<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Recherche d'information en langue arabe : influence des param&#232;tres linguistiques et de pond&#233;ration en LSA</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Recherche d&#8217;information en langue arabe : influence des 
param&#232;tres linguistiques et de pond&#233;ration de LSA 
</p>
<p>Siham Boulaknadel (1,2), Fadoua Ataa-Allah (2) 
</p>
<p>(1) LINA FRE CNRS 2729 &#8211; Universit&#233; de Nantes 
2 rue la Houssini&#232;re  BP 92208 44322 Nantes cedex 03, France 
</p>
<p>siham.boulaknadel@univ-nantes.fr 
(2) GSCM &#8211; Universit&#233; Mohammed V 
</p>
<p>BP 1014 Agdal Rabat-Maroc 
fadoua_01@yahoo.fr 
</p>
<p>Mots-clefs &#8211; Keywords  
Recherche d&#8217;information, Analyse de la s&#233;mantique latente, Langue arabe, Racinisation  
</p>
<p>Information retrieval, Latent semantic analyses, Arabic language, Stemming 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
Nous nous int&#233;ressons &#224; la recherche d&#8217;information en langue arabe en utilisant le mod&#232;le de 
l&#8217;analyse s&#233;mantique latente (LSA). Nous proposons dans cet article de montrer que le 
traitement linguistique et la pond&#233;ration des unit&#233;s lexicales influent sur la performance de la 
LSA  pour quatre cas d&#8217;&#233;tudes : le premier avec un simple pr&#233;traitement des corpus; le 
deuxi&#232;me en utilisant un anti-dictionnaire; le troisi&#232;me avec un racineur de l&#8217;arabe ; le 
quatri&#232;me o&#249; nous avons combin&#233; l&#8217;anti-dictionnaire et le racineur. Globalement les r&#233;sultats 
de nos exp&#233;rimentations montrent que les traitements linguistiques ainsi que la  pond&#233;ration 
des unit&#233;s lexicales utilis&#233;s am&#233;liorent la performance de LSA. 
</p>
<p>We are interested in information retrieval in Arabic language by using latent semantic 
analysis method (LSA). We propose in this article to show that the linguistic treatment and 
weighting of lexemes influence the performance of LSA. Four cases are studied: the first with 
a simple pretreatment of the corpora; the second by using a stopword list; the third with arabic 
stemmer; the fourth where we combined stopword list and arabic stemmer. Broadly the results 
of our experiments show that the linguistic treatments as well as weighting of lexemes used 
improve the performance of LSA. 
</p>
<p> 
 
 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Siham Boulaknadel, Fadoua Ataa-Allah 
  
</p>
<p>1 Introduction 
En recherche d&#8217;information, le probl&#232;me d&#8217;acc&#232;s au texte est essentiellement d&#251; &#224; l&#8217;&#233;cart entre 
les termes utilis&#233;s dans les requ&#234;tes et les documents. L&#8217;appariement entre requ&#234;te et 
document se fait donc par l&#8217;interm&#233;diaire de leur repr&#233;sentation respective. Le mod&#232;le de 
recherche le plus souvent utilis&#233; est le mod&#232;le vectoriel (Salton, 1983). Un des probl&#232;mes de 
ce mod&#232;le r&#233;side dans l&#8217;hypoth&#232;se d&#8217;ind&#233;pendance faite sur les termes d&#8217;indexation : chaque 
terme d&#8217;indexation constitue une dimension de l&#8217;espace vectoriel, sans consid&#233;ration 
d&#8217;&#233;ventuelles relations entre termes. 
</p>
<p>En l&#8217;absence d&#8217;une connaissance approfondie de la collection de documents, la requ&#234;te peut 
&#234;tre formul&#233; en des termes proches mais non identiques &#224; ceux employ&#233;s dans un document. 
Un certain nombre de chercheurs se sont int&#233;ress&#233;s &#224; ce probl&#232;me, soit par l&#8217;utilisation de 
r&#233;seaux s&#233;mantiques qui consiste &#224; recourir &#224; une base de connaissances linguistiques 
regroupant les mots s&#233;mantiquement proches et structur&#233; selon des relations hyperonymiques 
et/ou synonymiques (Grefenstette, 1994), soit par l&#8217;extension de requ&#234;tes, op&#233;ration par 
laquelle un certain nombre de termes issus de documents de la collection sont ajout&#233;s &#224; une 
requ&#234;te. 
</p>
<p>La troisi&#232;me possibilit&#233; que nous avons choisie, consiste &#224; se servir des relations s&#233;mantiques 
implicites induites par les cooccurrences entre termes dans les documents. Ainsi le mod&#232;le de 
l&#8217;analyse s&#233;mantique latente (LSA) (Deerwester et al., 1990) consiste &#224; r&#233;duire le nombre de 
dimensions de l&#8217;espace vectoriel en s&#8217;appuyant sur  le fait que les documents traitant des 
m&#234;mes sujets ont des vocabulaires proches et sont donc proches dans l&#8217;espace vectoriel.  
</p>
<p>Dans notre travail, nous avons s&#233;lectionn&#233; les sch&#233;mas de pond&#233;ration qui am&#233;liorent la 
performance de la m&#233;thode LSA pour le calcul de similarit&#233;, dans le cas de cinq corpus de 
petites tailles en langue arabe, tout en &#233;valuant l&#8217;importance de diff&#233;rents param&#232;tres 
linguistiques utilis&#233;s.  
</p>
<p>2 Pr&#233;sentation de LSA 
L&#8217;analyse s&#233;mantique latente (LSA) consiste &#224; r&#233;duire le nombre de dimensions de l&#8217;espace 
vectoriel par le biais d&#8217;une d&#233;composition en valeurs singuli&#232;res (SVD), de la matrice A en un 
produit de trois autres matrices :                    A = U S VT 
</p>
<p>O&#249; U est une matrice orthogonale de taille (m x n) de description d&#8217;unit&#233; lexicale, V est une 
matrice orthogonale de taille (n x n) de description d&#8217;unit&#233; textuelle et S une matrice 
diagonale de taille (n x n). 
</p>
<p>&#192; partir d&#8217;un certain nombre k&lt;n, nous nous apercevons de l&#8217;existence de valeurs singuli&#232;res 
tr&#232;s faibles et qui peuvent &#234;tre n&#233;glig&#233;es dans la matrice. 
</p>
<p>De ce fait, il est  d&#233;montr&#233; qu&#8217;il y a une meilleure approximation Ak de A qui est donn&#233;e par :
      Ak  =  Uk Sk VkT 
</p>
<p>Cette r&#233;duction va permettre de ne garder que les unit&#233;s lexicales les plus significatives. &#192; 
noter que k est d&#233;termin&#233; de fa&#231;on empirique en fonction du corpus utilis&#233; et du degr&#233; de 
performance voulu. 
</p>
<p>Pour &#233;valuer la performance de la LSA on utilise les deux mesures traditionnelles de pr&#233;cision 
et de taux de rappel (Salton, 1989). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche d&#8217;information en langue arabe : influence des param&#232;tres linguistiques et de 
pond&#233;ration en LSA 
 
 
3 Param&#232;tres de pond&#233;ration 
La pond&#233;ration des unit&#233;s lexicales consiste &#224; transformer l&#8217;occurrence d&#8217;une unit&#233; lexicale 
dans l&#8217;unit&#233; textuelle par une combinaison de pond&#233;rations locales L(i,j), indiquant 
l&#8217;importance de l&#8217;unit&#233; lexicale i dans l&#8217;unit&#233; textuelle j et pond&#233;rations globales G(i), 
indiquant l&#8217;importance de l&#8217;unit&#233; lexicale i dans l&#8217;ensemble des unit&#233;s textuelles de la 
collection.  
</p>
<p>Avec fij la fr&#233;quence de l&#8217;unit&#233; lexicale i dans l&#8217;unit&#233; textuelle j, dfi le nombre d&#8217;unit&#233;s 
textuelles auxquelles l&#8217;unit&#233; lexicale i appartient, gfi le nombre total de fois o&#249; l&#8217;unit&#233; lexicale 
i appara&#238;t dans la collection, N est le nombre d&#8217;unit&#233;s textuelles, M le nombre des termes dans 
le corpus et pij est le rapport de fij par gfi. 
</p>
<p>Pond&#233;ration globale 
</p>
<p>  Nom du 
sch&#233;ma Formule Int&#233;r&#234;t 
</p>
<p>Entropie ( )&#8721;&#8722;
N
</p>
<p>j N
ijpijp
</p>
<p>log
</p>
<p>log
1  
</p>
<p>Elle tient compte de la distribution des unit&#233;s lexicales dans les 
unit&#233;s textuelles et permet d&#8217;attribuer un poids minimum aux 
termes qui sont distribu&#233;s de la m&#234;me fa&#231;on dans toutes les unit&#233;s 
textuelles et un poids maximum aux termes qui sont concentr&#233;s 
dans quelques unit&#233;s textuelles  
</p>
<p>Normal &#8721;N
j ij
</p>
<p>f 2
1
</p>
<p> 
Elle a pour effet de donner un poids &#233;lev&#233; aux termes peu 
fr&#233;quents et elle ne d&#233;pend que de la somme des fr&#233;quences au 
carr&#233; et pas de la distribution de ces fr&#233;quences. 
</p>
<p>Gfldf 
idf
igf  
</p>
<p>Idf &#9119;&#9119;&#9120;
&#9118;
</p>
<p>&#9116;&#9116;&#9117;
&#9115;
</p>
<p>idf
</p>
<p>N
2log  
</p>
<p>Elles pond&#232;rent tous deux les termes par le nombre des unit&#233;s 
textuelles  diff&#233;rentes dans lesquelles ils apparaissent. La 
diff&#233;rence entre les deux c&#8217;est que GfIdf augmente le poids des 
mots fr&#233;quents. 
</p>
<p> 
</p>
<p>Figure 1 : Param&#232;tres de pond&#233;ration utilis&#233;s 
</p>
<p> 
</p>
<p>4 Traitements linguistiques 
L&#8217;arabe est une langue s&#233;mitique s&#8217;&#233;crivant de droite &#224; gauche elle comporte 28 consonnes et 
6 voyelles standard (3 longues :&#1614;&#1575; &#1615;&#1608;  &#1613;&#1610;  et 3 courtes :  &#1615;/  &#1616;/  &#1614;/). Le traitement automatique de l&#8217;arabe 
est difficile vu ses variations orthographiques et sa structure morphologique complexe. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Siham Boulaknadel, Fadoua Ataa-Allah 
  
</p>
<p>Deux approches sont utilis&#233;es dans l&#8217;analyse morphologique de l&#8217;arabe, la premi&#232;re que nous 
avons choisie (Darwish, 2002) est une analyse morphologique assouplie ou racinisation qui 
consiste &#224; essayer de d&#233;celer si des suffixes ou pr&#233;fixes ont &#233;t&#233; ajout&#233;s &#224; l&#8217;unit&#233; lexicale : par 
exemple pour le duel (&#1606;&#1575;) dans (&#1606;&#1575;&#1605;&#1604;&#1593;&#1605;, deux professeurs), le pluriel des noms masculins (&#1606;&#1608; , &#1606;&#1610;) 
dans (&#1606;&#1608;&#1605;&#1604;&#1593;&#1605;, des professeurs) et f&#233;minins (&#1578;&#1575;) dans (&#1578;&#1575;&#1605;&#1604;&#1587;&#1605;, musulmanes) ; la forme possessive 
(&#1575;&#1606;,  &#1605;&#1570;, &#1605;&#1607;) dans (&#1605;&#1607;&#1576;&#1575;&#1578;&#1570;, ses livres) et les pr&#233;fixes dans les articles d&#233;finis (&#1604;&#1575;,  &#1604;&#1575;&#1608;,  &#1604;&#1575;&#1576;,  &#1604;&#1575;&#1570;, &#1604;&#1575;&#1601;). 
</p>
<p>La deuxi&#232;me est une lemmatisation qui consiste &#224; r&#233;duire les formes d&#233;clin&#233;es &#224; une 
repr&#233;sentation canonique. 
</p>
<p>5 Exp&#233;rimentations 
Notre objectif est de s&#233;lectionner les sch&#233;mas de pond&#233;ration qui am&#233;liorent la performance 
de la m&#233;thode LSA pour le calcul de similarit&#233;, dans le cas des corpus de petite taille, tout en 
&#233;valuant l&#8217;importance de l&#8217;utilisation d&#8217;un anti-dictionnaire et d&#8217;un racineur. 
</p>
<p>5.1 Donn&#233;es  
</p>
<p>Afin de bien &#233;valuer nos r&#233;sultats sur les corpus de petite taille, nous avons choisi sur Internet 
une version arabe des contes partiellement voyell&#233;s de 1800 mots : &#171; Le paysan &#233;nergique &#187;1, 
de H.Darwish &#171;  Fleurs du miel  &#187;2 , &#171;Musique de la nature  &#187; 3 et  &#171; Sous les branches &#187; 4 de 
K.Abid et &#171;Les chaussures en bois&#187; 5 de J.alhamad. Nous avons appliqu&#233; la transcription de 
Buckwalter qui consiste &#224; transcrire l&#8217;alphabet arabe en alphabet latin (Buckwalter, 2002). 
Nous avons d&#233;cid&#233; de construire un anti-dictionnaire g&#233;n&#233;ral qui contient l&#8217;ensemble des 
unit&#233;s lexicales grammaticales extraites du dictionnaire arabe6  ensuite nous avons choisi de 
formuler les requ&#234;tes avec aussi peu de variations que possible par rapport &#224; la formulation 
d&#8217;origine. L&#8217;ensemble des requ&#234;tes que nous avons &#233;tabli est de l&#8217;ordre de 71 requ&#234;tes. 
</p>
<p>5.2 Calculs des courbes 
</p>
<p>Nous avons segment&#233; par la suite chacun de ces contes en paragraphes, ce qui nous a permis 
de construire cinq corpus dont le nombre d&#8217;unit&#233;s textuelles (paragraphes) varie entre 8 et 24. 
Apr&#232;s avoir transformer ces contes et requ&#234;tes textuelles en mode vectoriel, nous avons 
calcul&#233; la pr&#233;cision moyenne sur l&#8217;ensemble des requ&#234;tes de chaque corpus, en faisant varier 
k de 2 &#224; r (le rang de la matrice correspondant &#224; chaque corpus). Les paragraphes retourn&#233;s 
&#233;taient ceux dont le vecteur faisait un angle de cosinus sup&#233;rieur &#224; un seuil de 0.9 avec les 
vecteurs requ&#234;tes. 
</p>
<p>5.3 R&#233;sultats 
</p>
<p>Nous avons effectu&#233; des tests pour vingt trois sch&#233;mas de pond&#233;ration, plus un autre test o&#249; 
nous avons utilis&#233; la m&#233;thode LSA sans appliquer aucune pond&#233;ration &#224; la matrice originale. 
Effectivement, d&#8217;apr&#232;s les tests appliqu&#233;s sur le corpus &#171; Musique de la nature  &#187;, nous avons 
remarqu&#233; que la performance de la LSA sans pond&#233;r&#233; la matrice originale est relativement 
</p>
<p>                                                 
1  http://www.awu-dam.org/book/99/child99/5-a-d/book99-ch008.htm 
2  http://www.awu-dam.org/book/99/child99/11-h-a/book99-ch001.htm 
3  http://www.awu-dam.org/book/99/child99/11-h-a/book99-ch003.htm 
4  http://www.awu-dam.org/book/99/child99/11-h-a/book99-ch012.htm 
5  http://www.comp.leeds.ac.uk/latifa/research.htm 
6  http://www.almeshkat.net/books/archive/books/muajm arabia.zip </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche d&#8217;information en langue arabe : influence des param&#232;tres linguistiques et de 
pond&#233;ration en LSA 
 
 
inf&#233;rieure de 6% par rapport &#224; celle o&#249; nous appliquons le sch&#233;ma de pond&#233;ration 
&#8216;Pond&#233;ration Local Logarithmique * Entropie de Dumais&#8217; ; et les sch&#233;mas &#8216;Pond&#233;ration Local 
Logarithmique*Entropie Globale&#8217; et &#8216;Pond&#233;ration Local Logarithmique*GFIDF&#8217;.   
</p>
<p>   
 
</p>
<p>                    
              
</p>
<p>                    
 
</p>
<p>Figure 2 : L&#8217;influence des sch&#233;mas de pond&#233;ration sur la performance de la LSA 
</p>
<p>Pour &#233;valuer l&#8217;importance de l&#8217;utilisation d&#8217;un anti-dictionnaire et d&#8217;un racineur, nous avons 
extrait la pr&#233;cision maximale de l&#8217;ensemble des pr&#233;cisions moyennes r&#233;sultantes des tests 
r&#233;alis&#233;s. Nous avons pr&#233;sent&#233; l&#8217;&#233;volution de la pr&#233;cision moyenne de la m&#233;thode LSA, en 
appliquant les deux sch&#233;mas de pond&#233;ration &#171; Tf x IDF &#187; et &#171; LTC &#187;, pour le corpus &#171; Sous 
les branches &#187; sur la figure 3-(a) et sur la figure 3-(b) pour le corpus &#171; Musique de la nature &#187;.  
</p>
<p> 
</p>
<p>                    
 
</p>
<p>                    
 
</p>
<p>Figure 3 : Evolution de la pr&#233;cision en fonction du nombre de dimensions de l&#8217;espace  pour 
un seuil de 0.9 
</p>
<p>(a)
</p>
<p>(b)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Siham Boulaknadel, Fadoua Ataa-Allah 
  
</p>
<p>Globalement les courbes calcul&#233;es montrent que la performance de LSA s&#8217;am&#233;liore en 
utilisant soit un anti-dictionnaire soit un racineur, soit les deux. N&#233;anmoins pour certaines 
requ&#234;tes les traitements linguistiques n&#8217;am&#233;liorent pas la performance de la LSA. Ceci est d&#251; 
au racineur qui &#233;choue &#224; traiter certains pluriels et verbes. Par exemple pour les pluriels 
irr&#233;guliers des noms comme &#171; &#1604;&#1601;&#1591;, enfant &#187; &#171;  &#1604;&#1575;&#1601;&#1591;&#1571;, enfants &#187; qui ne sont pas une combinaison 
des formes singuli&#232;res. Pour  les verbes irr&#233;guliers comportant des consonnes particuli&#232;res 
dites faibles (&#1608;, &#1575;, &#1610;) qui sont  soit conserv&#233;e, soit remplac&#233;e ou &#233;limin&#233;e lors de leur 
d&#233;clinaison, exemple  &#171;&#1604;&#1575;&#1602; , il a dit &#187; &#171;&#1604;&#1608;&#1602;&#1610; , il dit &#187; . Vu aussi la petite  taille de nos corpus, par 
cons&#233;quent on peut dire que la LSA reste sensible dans le cas o&#249; on a peu de donn&#233;es &#224; traiter. 
</p>
<p>6 Conclusion 
Nous avons propos&#233; une approche pour am&#233;liorer la m&#233;thode de l&#8217;analyse s&#233;mantique latente 
(LSA) en int&#233;grant les param&#232;tres linguistiques et de pond&#233;ration. L&#8217;&#233;valuation a montr&#233; 
l&#8217;int&#233;r&#234;t d&#8217;appliquer conjointement le traitement linguistique et la pond&#233;ration des unit&#233;s 
lexicales pour pouvoir am&#233;liorer la performance de la LSA. Dans la suite de nos travaux, nous 
envisageons d&#8217;&#233;tendre cette &#233;tude &#224; l&#8217;utilisation de la lemmatisation. 
</p>
<p>R&#233;f&#233;rences 
Buckwalter T.(2002), Buckwalter Arabic Morphological Analyzer Version 1.0,  
http://www.ldc.upenn.edu/Catalog/CatologEntry.jsp?catologId=LDC2002L49. 
</p>
<p>Darwish K. (2002), Building a Shallow Arabic Morphological Analyzer in One Day, 
Proceedings of the workshop on Computational Approaches to Semitic Languages in the 40th 
Annual Meeting of the Association for Computational Linguistics (ACL-02) , pp. 47-54. 
</p>
<p>Deerwester S, Dumais S.T., Furnas G.W., Landauer T.K., Hrashman R. (1990), Indexing by 
latent semantic analysis, Journal of the american society for information science, Vol.41, pp. 
391-407. 
</p>
<p>Grefenstette G. (1994), Explorations in automatic thesaurus discovery, New York, Kluwer 
Academic Publishers. 
</p>
<p>Salton G. (1989), Automatic text processing the transformation analysis and retrieval of 
information by computer, New York, Addison-Wesley. 
</p>
<p>Salton G. (1983), An Introduction to Modern Information Retrieval, New York, McGraw-
Hill. </p>

</div></div>
</body></html>