<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers un Syst&#232;me d'&#233;criture Informatique Amazighe :M&#233;thodes et d&#233;veloppements</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Vers un Syst&#232;me d&#8217;Ecriture Informatique Amazighe : 
M&#233;thodes et D&#233;veloppements 
</p>
<p>Ali Rachidi1 &amp; Driss Mammass2 
</p>
<p>1
 Ecole Nationale de Commerce et de Gestion, B.P. 37/S Hay Salam  Agadir, 
</p>
<p>Maroc  
Laboratoire de Traitement d'Images et Syst&#232;mes d'Information (LTISI)  
</p>
<p>Email : rachidi.ali@caramail.com 
2
 Unit&#233; de Recherche en Traitement d'Images et de l'Information (URT2I), 
</p>
<p>Facult&#233; des Sciences, Universit&#233; Ibn Zohr, Agadir, Maroc, 
E-mail : driss_mammass@yahoo.fr 
</p>
<p>Mots-Cl&#233;s &#8211; Keywords 
Amazighe, Alphabet Tifinaghe, Traitement des langues naturelles. 
</p>
<p>Amazighe, Tifinaghe Alphabet, Natural Language Processing. 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
L'int&#233;gration des technologies de l'information et de communication (TIC) &#224; l'apprentissage 
de la langue Amazighe est absolument n&#233;cessaire pour qu&#8217;elle ait droit de cit&#233; plein et entier 
sur le Web et dans le monde informatis&#233;.  
Nous pr&#233;sentons quelques r&#233;flexions sur les strat&#233;gies et m&#233;thodes d'informatisation de 
l'amazighe qui est une langue peu dot&#233;e informatiquement. Ces r&#233;flexions visent surtout 
l'optimisation de l'effort d'informatisation. En effet, les m&#233;thodes propos&#233;es tiennent en 
compte non seulement l'alphabet propos&#233; par l'IRCAM1 et confirm&#233;e par l'ISO (format 
Unicode) le 21 juin 2004 (IRCAM, 2004 a) mais aussi le contexte francophone des 
populations berb&#232;res.  
</p>
<p>Learning the Amazighe language would require the introduction of Information and 
Communication technologies so that the language would have full entire freedom of a 
mentioning on the Web and in the computerized world.  
We present some reflections on strategies and methods of the amazighe computerization 
which is a language little dowered. These reflections aim particularly the optimisation of the 
effort of computerization. Indeed, proposed methods hold in account no only the proposed 
alphabet by the IRCAM1 and confirmed by the ISO (Unicode format) the 21 June 2004 but 
therefore the French speaking context of Berber populations.  
</p>
<p>                                                
</p>
<p>1
  Institut Royal de la Culture Amazighe, Rabat, Maroc </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un Syst&#232;me d&#8217;Ecriture Informatique Amazighe : M&#233;thodes et D&#233;veloppements 
</p>
<p> 
</p>
<p> 
</p>
<p>1. Introduction 
Cet article s&#8217;inscrit dans un large mouvement international qui vise &#224; ce que chaque peuple 
puisse disposer de tous les moyens pour communiquer dans sa langue. L&#8217;Amazighe fait partie 
des langues tr&#232;s peu dot&#233;es informatiquement. Par cons&#233;quent, des recherches scientifiques et 
linguistiques sont lanc&#233;es dans ce sens pour am&#233;liorer la situation actuelle. La conception et la 
r&#233;alisation d&#8217;applications capables de traiter de fa&#231;on automatique des donn&#233;es linguistiques, 
exprim&#233;es dans la langue naturelle amazighe, sont parmi les objectifs prioritaires de nos 
travaux de recherche en collaboration avec l&#8217;IRCAM. Dans ce contexte, nous proposons 
quelques r&#233;flexions, sur des m&#233;thodes et des strat&#233;gies &#224; mettre en &#339;uvre pour produire un 
outil de 1) traitement de texte amazighe sous codage ASCII et un autre sous format Unicode 
apr&#232;s l&#8217;int&#233;gration du format Unicode amazighe dans les applications informatiques par les 
firmes responsables et 2) traduction automatique et de gestion d&#8217;une base lexicale Amazighe. 
Cet article est compos&#233; de trois parties. Dans la premi&#232;re partie, nous pr&#233;sentons le contexte 
linguistique et le syst&#232;me d&#8217;&#233;criture de la langue Amazighe. La deuxi&#232;me partie pr&#233;sente les 
diff&#233;rentes m&#233;thodes d&#8217;informatisation. Enfin, la derni&#232;re partie est consacr&#233;e &#224; la 
pr&#233;sentation de la mise en &#339;uvre de certaines m&#233;thodes et des outils impliqu&#233;s. 
</p>
<p>2. Amazighe : langue naturelle 
La famille &#233;largie des Berb&#232;res qui utilise le Tifinaghe comme &#233;criture traditionnelle et 
commune est de pr&#232;s de vingt millions. Au Maroc, le berb&#232;re (&#171; amazighe &#187;) marocain 
englobe les trois grandes variantes : le Tarifite, le Tamazighte et le Tachelhite. Plus de 40% de 
la population marocaine est berb&#233;rophone. Nous pr&#233;sentons un petit aper&#231;u sur l&#8217;&#233;volution de 
la langue amazighe tout au long de l&#8217;histoire et sur son syst&#232;me d&#8217;&#233;criture. 
</p>
<p>2. 1. Historique 
</p>
<p>L'alphabet berb&#232;re ou Amazighe a subi des modifications et des variations depuis son origine 
jusqu'&#224; nos jours. Du libyque jusqu'au n&#233;otifinaghe en passant par le tifinaghe  saharien et le 
tifinaghe touareg. Nous retra&#231;ons ci-dessous les aspects les plus importants de chacune de ces 
&#233;tapes. 
</p>
<p>2. 1. 1. Le libyque 
Il s&#8217;agit des vari&#233;t&#233;s du Tifinaghe les plus anciennes. Il existe deux formes du libyque, 
l'oriental et l'occidental. 
</p>
<p>2. 1. 2. Le Tifinaghe saharien 
Cette vari&#233;t&#233; est &#233;galement appel&#233;e libyco-berb&#232;re ou touareg ancien. Elle contient des signes 
suppl&#233;mentaires par rapport au libyque, plus particuli&#232;rement un trait vertical pour noter la 
voyelle finale /a/. Cette vari&#233;t&#233; fut utilis&#233;e pour transcrire le touareg ancien mais ses 
inscriptions sont incomprises (IRCAM 2004 b). 
</p>
<p>2. 1. 3. Le Tifinaghe touareg 
Il existe au sein du Tifinaghe touareg quelques divergences dans la valeur attribu&#233;e aux signes 
qui correspondent aux variations dialectales touar&#232;gues. Si d'une r&#233;gion &#224; une autre, la forme 
et le nombre des signes peuvent changer, les textes restent en g&#233;n&#233;ral mutuellement 
compr&#233;hensibles. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Rachidi et D. Mammass 
</p>
<p> 
</p>
<p>2. 1. 4. Le n&#233;otifinaghe 
Le n&#233;otifinaghe d&#233;signe les syst&#232;mes d'&#233;criture d&#233;velopp&#233;s pour repr&#233;senter les parlers 
berb&#232;res (amazighes) du Maghreb. La premi&#232;re variante fut celle propos&#233;e &#224; la fin des ann&#233;es 
60 par l'Acad&#233;mie Berb&#232;re (AB) sur la base de lettres Tifinaghes touar&#232;gues, elle est 
largement diffus&#233;e au Maroc et en Alg&#233;rie (surtout en Kabylie). 
</p>
<p>2. 2. Tifinaghe : L&#8217;alphabet amazighe 
</p>
<p>2. 2. 1. Caract&#232;res Tifinaghe 
L&#8217;Alphabet Tifinaghe a &#233;t&#233; propos&#233;, par l&#8217;IRCAM (IRCAM 2004 a), &#224; l&#8217;Organisation de 
Standardisation Internationale qui l&#8217;a confirm&#233;e. Cette proposition comprend quatre sous-
ensembles de caract&#232;res Tifinaghes : a) le jeu de base de l&#8217;IRCAM ; b) le jeu &#233;tendu de 
l&#8217;IRCAM ; c) d&#8217;autres lettres n&#233;otifinaghes en usage et d) des lettres touar&#232;gues modernes 
dont l&#8217;usage est attest&#233;. 
La figure 1 montre la liste de l&#8217;alphabet Tifinaghe et le plan Unicode associ&#233; attribu&#233;e par 
l&#8217;ISO : 
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1: rang&#233; 2D de Unicode : Tifinaghe 
</p>
<p>Pour plus de d&#233;tails sur la phon&#233;tique/phonologie de la langue, sur les r&#232;gles orthographiques 
et sur les &#233;l&#233;ments de morphosyntaxe, consulter (IRCAM 2004 c). 
 
</p>
<p>2. 2. 2. Ponctuation 
Nous ne connaissons pas de signe de ponctuation particulier au Tifinaghe. L&#8217;IRCAM a 
pr&#233;conis&#233; l&#8217;emploi des signes conventionnels qu&#8217;on retrouve dans les &#233;critures latines : &#171; &#187; 
(espace), &#171; . &#187;, &#171; , &#187;, &#171; ; &#187;, &#171; : &#187;, &#171; ? &#187;, &#171; ! &#187;, &#171; &#8230; &#187;, etc. En cons&#233;quence, cette proposition ne 
pr&#233;sente aucun signe de ponctuation Tifinaghe. 
</p>
<p>2. 2. 3. Tri 
L&#8217;IRCAM a d&#233;fini un ordre pr&#233;cis d&#233;crit par l&#8217;expression ci-dessous (a &lt; b, signifie que a est 
tri&#233; avant b).   
 
</p>
<p> 
</p>
<p> 
</p>
<p>Jeu de base de l&#8217;IRCAM 
</p>
<p>Jeu &#233;tendu de l&#8217;IRCAM 
</p>
<p>Lettres n&#233;otifinaghes en usage 
</p>
<p>Lettres touar&#232;gues modernes
</p>
<p>R&#233;serv&#233; pour un usage ult&#233;rieur </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un Syst&#232;me d&#8217;Ecriture Informatique Amazighe : M&#233;thodes et D&#233;veloppements 
</p>
<p> 
</p>
<p>2. 2. 4. Chiffres 
L&#8217;IRCAM a retenu les chiffres &#171; arabes &#187; occidentaux (0, 1, 2, 3, 4, 5, 6, 7, 8, 9) pour 
l&#8217;&#233;criture Titifinaghe. Cette proposition n&#8217;introduit donc aucun nouveau chiffre ou nombre. 
</p>
<p>2. 2. 5. Directionnalit&#233; 
L&#8217;IRCAM a retenu la direction horizontale de gauche &#224; droite pour l&#8217;&#233;criture Tifinaghe. 
</p>
<p>3. M&#233;thodes pour l&#8217;informatisation de l&#8217;amazighe 
3. 1. Trouver des solutions adapt&#233;es : id&#233;es forces 
</p>
<p>3. 1. 1. B&#233;n&#233;ficier de d&#233;veloppements faits pour des langues li&#233;es 
L&#8217;Amazighe est une langue voisine de l&#8217;arabe et du fran&#231;ais. Par cons&#233;quent, il est tr&#232;s 
possible de b&#233;n&#233;ficier des liens qui unissent cette langue au fran&#231;ais et &#224; l&#8217;arabe pour utiliser 
leurs ressources et faciliter les d&#233;veloppements. Par exemple, on peut int&#233;grer une barre 
d&#8217;outils pour l&#8217;&#233;criture Amazighe qui se charge automatiquement avec Ms WinWord version 
Arabe ou Fran&#231;aise. Cette id&#233;e sera l&#8217;objet d&#8217;une section prochaine. 
 
</p>
<p>3. 1. 2. S&#8217;int&#233;grer &#224; des projets et environnements g&#233;n&#233;riques, open source et &#224; pivot 
Projet UNL (www.undl.org): Il est de plus en plus n&#233;cessaire de cr&#233;er des documents 
multilingues qui int&#232;grent l&#8217;Amazighe (Rachidi A. 2004). L&#8217;id&#233;e actuelle est de faire de la 
traduction manuelle collaborative sur le Web &#224; l&#8217;aide d&#8217;une m&#233;moire de polyphrases 
multilingues (MPM), outils en construction par l&#8217;&#233;quipe de C. Boitet (GETA, CLIPS, IMAG -
Grenoble, France) (Berment V. 2004), puis d&#8217;int&#233;grer le r&#233;sultat (les phrases en Amazighe) 
dans le document en UNL-XML. Enfin, il faudra construire un d&#233;convertisseur UNL-
Amazigh et un enconvertisseur. 
Projet Papillon (www.papillon-dictionary.org): L&#8217;amazighe int&#233;grera le projet d&#233;s que le 
format Unicode sera bien install&#233; dans les plates formes logicielles. En attendant, il faut 
pr&#233;parer une liste exhaustive de cat&#233;gories (part of speech) qui seront utilis&#233;es dans ce 
dictionnaire. 
</p>
<p>3. 2. Appliquer une gestion adapt&#233;e 
</p>
<p>1) D&#233;terminer quel produit r&#233;aliser ? 2) D&#233;terminer qui r&#233;alise les logiciels et ressources et 3) 
Etablir un plan de d&#233;veloppement. En effet, au sein de notre laboratoire et en collaboration 
avec l&#8217;IRCAM, les d&#233;veloppements se d&#233;rouleront en deux phases distinctes ayant n&#233;cessit&#233; 
chacune un plan de d&#233;veloppement sp&#233;cifique : 1) la r&#233;alisation d&#8217;un traitement de texte bien 
adapt&#233; &#224; l&#8217;&#233;criture Amazighe et 2) le d&#233;veloppement d&#8217;outils d&#8217;aide &#224; la traduction et d&#8217;une 
base lexicale en int&#233;grant les projets UNL et le papillon). 
</p>
<p>4. Mise en &#339;uvre et outils impliqu&#233;s 
4. 1. Phase actuelle (avant le format Unicode)  
4. 1. 1. Clavier Amazighe 
L&#8217;alphabet Tifinaghe est compos&#233; de trente trois caract&#232;res. Le centre CEISIC de L&#8217;IRCAM a 
propos&#233; un clavier sous format ASCII (police, pilote) comme l&#8217;illustre la figure 2 (IRCAM 
2003 a) (IRCAM 2003 b). Les 26 premiers caract&#232;res sont accessibles directement. Les 
caract&#232;res emphases s&#8217;obtiennent en utilisant la case Noir (le &#171; ^ &#187; en clavier latin) de la </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. Rachidi et D. Mammass 
</p>
<p> 
</p>
<p>m&#234;me fa&#231;on qu&#8217;on utilise le &#171; ^ &#187; en fran&#231;ais (pour taper le &#171; &#226; &#187;). L&#8217;IRCAM a propos&#233; un 
projet qui normalise deux groupes de claviers en pr&#233;cisant deux niveaux de conformit&#233;, l'un 
pour la saisie stricte des trente-deux lettres de l'alphabet Tifinaghe de base tel qu'enseign&#233; 
dans les &#233;coles marocaines, l'autre pour la saisie de l'alphabet de base, plus les vingt-deux 
lettres de l'alphabet Tifinaghe &#233;tendu et des ligatures (lorsque la technologie sous-jacente 
permet de traiter deux caract&#232;res de commande permettant de former ou d'emp&#234;cher la 
formation de ligatures). Ce projet sera confirm&#233; dans le prochain amendement &#224; la norme 
internationale ISO/CEI 14651. 
</p>
<p> 
</p>
<p>Figure 2 : Clavier Amazighe sous format Ascii 
</p>
<p>4. 1. 2. R&#233;aliser un traitement de texte pour l&#8217;amazighe  
On peut r&#233;aliser une plate forme logicielle qui permet de traiter un texte Amazighe sous 
format Ascii avec C / C++ et utilisant uniquement le SDK (Software Development Kit) de 
Windows, qui visait les premiers niveaux du service de traitement du texte (TALN 2003). Il 
inclut les fonctionnalit&#233;s suivantes : 1) saisie de textes amazighe ind&#233;pendant de la police 
utilis&#233;e et utilisant un clavier intuitif, 2) changement de police (donc transcodage), 3) mise en 
forme canonique du texte s&#233;lectionn&#233; (standardisation, saisie non univoque), 4) facilit&#233; de 
s&#233;lection &#224; la souris et au clavier des syllabes et des mots Amazighes, 5) formatage de textes 
Amazighes, pour les rendre utilisables par des traitements de texte commerciaux, 6) export 
aux formats TeX et RTF, 7) construction d&#8217;un lexique &#224; partir de textes (ajouter, modifier, 
supprimer une entr&#233;e dans un lexique local), 8) traduction en fran&#231;ais de mots Amazighes et 
9) transcription phon&#233;tique du texte s&#233;lectionn&#233;. L&#8217;interface propos&#233;e de cette plate forme est 
illustr&#233;e dans la figue 3 suivante : 
</p>
<p> 
</p>
<p>Figure 3 : interface pour un &#233;diteur Amazighe 
</p>
<p>4. 2. Phase apr&#232;s Unicode : r&#233;alisation d&#8217;un traitement de texte 
</p>
<p>4. 2. 1. En utilisant Word Pad 
Word Pad peut servir comme base pour une version Amazighe (Amazighe Pad). Ces sources 
sont disponibles dans C++ de MicroSoft. Word Pad est d&#233;velopp&#233; dans C++ et s&#8217;appuis sur 
les classes de la Biblioth&#232;que MFC (Microsoft Fondation Classes) (Berment V. 2004): a) 
Classe de la fen&#234;tre d&#8217;&#233;dition CRich Edit Ctrl et b) Format Rich text. 
</p>
<p>4. 2. 2. En utilisant WinWord 
On peut Utiliser le kit du d&#233;veloppeur Word (Word&#8217;s developer&#8217;s kit). C&#8217;est un Ensemble de 
modules C qui permet de s&#8217;interfacer avec Word. Le principe c&#8217;est de d&#233;velopper une librairie 
dynamique qui se charge avec Word et qui appelle les fonctions de Word &#224; travers une API 
appel&#233;e CAPI (Berment V. 2004).  
</p>
<p>Fen&#234;tre 
d&#8217;&#233;dition 
</p>
<p>Police 
amazighe </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un Syst&#232;me d&#8217;Ecriture Informatique Amazighe : M&#233;thodes et D&#233;veloppements 
</p>
<p> 
</p>
<p>Le format propos&#233; de cette barre est la suivante :  
De la gauche vers la droite, les fonctions des boutons sont : a) configuration AmazigheWord ; 
b) changement de police Amazighe ; c) tri de tableaux en Amazighe ; d) transcriptions 
Amazighe ; e) dictionnaire &#233;lectronique ; f) mise en forme du texte ; g) choix Amazighe-latin 
pour la saisie des textes et h) l&#8217;aide en ligne. 
</p>
<p>5. Conclusion 
N&#233;e avec l&#8217;informatique, l&#8217;informatisation des langues a &#233;volu&#233;, offrant de plus en plus de 
services pour de plus en plus de langues. C&#8217;est cependant un processus co&#251;teux qui ne 
b&#233;n&#233;ficie actuellement qu&#8217;&#224; une faible partie des langues du monde (moins de 1 %). 
Informatiser l'Amazighe demande un effort de plusieurs chercheurs et l'utilisation des leviers 
permettant d'obtenir rapidement des logiciels de qualit&#233;. L&#8217;existence du standard Unicode, qui 
vient d&#8217;int&#233;grer l&#8217;Amazighe ces derniers mois, a r&#233;cemment permis la r&#233;alisation de syst&#232;mes 
d&#8217;exploitation et de logiciels couvrant de nombreux syst&#232;mes d&#8217;&#233;criture tout en &#233;vitant la 
multiplication des incompatibilit&#233;s entre plates-formes. L&#8217;Amazighe b&#233;n&#233;ficie ainsi d&#8217;outils 
d&#8217;&#233;dition performants. Le codage et les principes de base &#233;tant communs aux diff&#233;rents 
syst&#232;mes d&#8217;&#233;criture. Notre projet, en collaboration avec l&#8217;IRCAM, &#339;uvre pour la r&#233;alisation 
d&#8217;un traitement de texte bien adapt&#233; &#224; l&#8217;&#233;criture Amazighe et le d&#233;veloppement d&#8217;outils d&#8217;aide 
&#224; la traduction et d&#8217;une base lexicale. 
</p>
<p>R&#233;f&#233;rences  
Berment V. (2004) m&#233;thodes pour informatiser des langues et des groupes de langues &#171;peu 
dot&#233;es&#8217;, th&#232;se de Doctorat de l&#8217;universit&#233; Joseph Fourier, Grenoble 1, UFR d'informatique et 
math&#233;matiques appliqu&#233;es, 18 mai 2004. 
</p>
<p>IRCAM (20004 a), &#8216;Proposition d&#8217;ajout de l&#8217;&#233;criture Tifinaghe au r&#233;pertoire de l&#8217;ISO/CEI 
10646 (format unicode)&#8217;, 21/06/2004, centre CEISIC, IRCAM, Rabat, Maroc 
</p>
<p>IRCAM (2004 b), &#8216;Graphie de la langue amazighe&#8217; Centre de l'Am&#233;nagement Linguistique 
Coordinateur El Mehdi Iazzi, Publications de l'IRCAM, Rabat, 2004. 
</p>
<p>IRCAM (2004 c), &#8216;Initiation &#224; la langue amazighe&#8217;, Centre de l&#8217;Am&#233;nagement Linguistique, 
publication de l&#8217;IRCAM, manuel N&#176; 1, Rabat, 2004. 
</p>
<p>IRCAM (2003 a), &#8216;&#201;laboration d'une premi&#232;re version du clavier amazighe&#8217;, Centre des 
&#233;tudes informatiques et des syst&#232;mes d'information et de communication, Rabat, plan d'action 
2003. 
</p>
<p>IRCAM (2003 b), &#8216;Conception et mise au point des polices Amazighes&#8217;, Centre des &#233;tudes 
informatiques et des syst&#232;mes d'information et de communication, Rabat, plan d'action 2003. 
</p>
<p>Rachidi A. (2004), &#8216; Les Graphes UNL : un concept unificateur pour l&#8217;int&#233;gration de 
l&#8217;Amazighe dans des Documents Multilingues&#8217;, s&#233;minaire international : La typographie entre 
les domaines de l&#8217;art et de l&#8217;informatique, IRCAM, Rabat septembre. 2004. 
</p>
<p>TALN (2003), &#8216;Traitement automatique des langues minoritaires et des petites langues&#8216;, 
l&#8217;atelier associ&#233; &#224; TALN 2003. 
</p>
<p> </p>

</div></div>
</body></html>