<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une utilisation du TAL dans la description p&#233;dagogique de textes dans l'enseignement des langues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Vers une utilisation du TAL dans la description p&#233;dagogique de 
textes dans l'enseignement des langues 
</p>
<p>Mathieu LOISEAU 
</p>
<p>LIDILEM &#8211; Universit&#233; Stendhal Grenoble 3 
mathieu.loiseau@u-grenoble3.fr
</p>
<p>Mots-clefs &#8211; Keywords 
</p>
<p>Corpus, ALAO, TAL, indexation p&#233;dagogique, ressources textuelles 
</p>
<p>Corpus, CALL, NLP, pedagogical indexation, textual resources 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Alors que de nombreux travaux portent actuellement sur la linguistique de corpus, l'utilisation 
de textes authentiques en classe de langue, ou de corpus dans l'enseignement des langues (via 
concordanciers), quasiment aucun travail n'a &#233;t&#233; r&#233;alis&#233; en vue de la r&#233;alisation de bases de 
textes &#224; l'usage des enseignants de langue, index&#233;es en fonction de crit&#232;res relevant de la 
probl&#233;matique de la didactique des langues. 
Dans le cadre de cet article, nous proposons de pr&#233;ciser cette notion d'indexation 
p&#233;dagogique, puis de pr&#233;senter les principaux standards de description de ressources 
p&#233;dagogiques existants, avant de montrer l'inad&#233;quation de ces standards &#224; la description de 
textes dans l'optique de leur utilisation dans l'enseignement des langues. Enfin nous en 
aborderons les cons&#233;quences relativement &#224; la r&#233;alisation de la base. 
</p>
<p>Despite numerous works concerning corpus linguistics, the use of authentic texts in language 
teaching as well as corpora in language teaching (through concordancers), hardly any work 
deals with the creation of a teacher-friendly text base that would be indexed according to 
criteria relevant to the set of problems of language didactics. 
In this article, we will first discuss the notion of pedagogical indexation. We will then present 
the principal pedagogical resource description standards, before showing that those standards 
are inadequate to handle our problem. Finally we shall give an overview of the consequences 
of these inadequacies on the implementation of the text base. 
</p>
<p>1 Indexation p&#233;dagogique pour l'enseignement des langues 
Parmi les diff&#233;rentes plateformes d&#8217;apprentissage des langues assist&#233; par ordinateur (ALAO), 
la plateforme MIRTO, en cours de d&#233;veloppement &#224; l&#8217;universit&#233; Stendhal &#8211; Grenoble 3, se </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LOISEAU 
</p>
<p>d&#233;marque gr&#226;ce &#224; une approche r&#233;solument centr&#233;e sur la didactique des langues. Alors que 
de telles plateformes forcent, en r&#232;gle g&#233;n&#233;rale, l&#8217;utilisateur enseignant &#8211; didacticien &#224; 
reformuler sa probl&#233;matique en termes informatiques, MIRTO reste avant tout un produit 
didactique : &#171; un programme qui met en oeuvre une solution didactique pour un probl&#232;me de 
la didactique des langues sans alt&#233;rer, ni la solution, ni, a fortiori, le probl&#232;me. &#187; (Antoniadis 
et al., 2004). Ainsi MIRTO permet la conception, sans comp&#233;tences informatiques pr&#233;alables, 
d&#8217;activit&#233;s didactiques. A l&#8217;heure actuelle, MIRTO est capable, &#224; la donn&#233;e d&#8217;un texte brut et 
d&#8217;une s&#233;rie de param&#232;tres entr&#233;e par l&#8217;enseignant, de g&#233;n&#233;rer divers types d&#8217;activit&#233;s parmi 
lesquels des exercices lacunaires ou des exercices de traduction avec aide&#8230; 
</p>
<p>Cette philosophie est &#224; l&#8217;origine du projet de cr&#233;ation d&#8217;une base de textes index&#233;e 
p&#233;dagogiquement pour l&#8217;enseignement des langues. En effet, gr&#226;ce &#224; son architecture, 
MIRTO est capable, de g&#233;n&#233;rer autant d&#8217;activit&#233;s d&#8217;un type donn&#233; que l&#8217;on sera capable de lui 
fournir de textes. D&#8217;o&#249; l&#8217;id&#233;e d&#8217;int&#233;grer un corpus &#224; la plateforme. Cependant, deux textes 
diff&#233;rents ne sont pas strictement interchangeables pour une activit&#233; donn&#233;e. Les propri&#233;t&#233;s de 
chaque texte les rendront plus ou moins adapt&#233;s &#224; une activit&#233; donn&#233;e. Un tel corpus ne 
pourra donc pas &#234;tre une simple collection de textes, cette collection devra &#234;tre organis&#233;e, 
index&#233;e. 
</p>
<p>Depuis le lancement de ce projet, sa port&#233;e a &#233;t&#233; &#233;largie, non seulement la base de textes 
devra &#234;tre int&#233;gr&#233;e &#224; la plateforme MIRTO, mais aussi pouvoir exister ind&#233;pendamment de 
celle-ci et permettre &#224; des enseignants de la consulter pour trouver des textes &#224; utiliser en 
classe. 
</p>
<p>L&#8217;approche choisie pour la conception de cette base, s&#8217;inscrit dans la philosophie MIRTO, 
dans la mesure o&#249; ses trois fonctionnalit&#233;s cl&#233;s seront centr&#233;e sur l&#8217;enseignant : 
</p>
<p>&#8226; Ex&#233;cution de requ&#234;tes selon des crit&#232;res relevant de la didactique des langues. 
&#8226; Ajout de textes dans la base, un processus qui doit &#234;tre automatis&#233; autant que faire se 
</p>
<p>peut, pour ne pas rendre cette op&#233;ration dissuasive de part sa complexit&#233; ou sa dur&#233;e. 
&#8226; Pr&#233;sence d&#8217;une interface qui permette aux enseignants n&#8217;ayant pas de connaissances 
</p>
<p>particuli&#232;res en informatique de pouvoir utiliser la base. 
Ces fonctionnalit&#233;s reposeront sur ce que l&#8217;on appellera l&#8217;indexation p&#233;dagogique de la base. 
On dira que des objets ont &#233;t&#233; index&#233;s p&#233;dagogiquement, s&#8217;ils ont &#233;t&#233; index&#233;s selon un 
syst&#232;me les d&#233;crivant en fonction de crit&#232;res p&#233;dagogiques (relevant de la probl&#233;matique de la 
didactique). Ici, les objets sont des textes et les crit&#232;res p&#233;dagogiques rel&#232;vent de la 
didactique des langues. On parlera donc d&#8217;indexation p&#233;dagogique pour l&#8217;enseignement des 
langues. 
</p>
<p>Le travail d&#8217;indexation p&#233;dagogique en soi, reviendra donc, a priori, d&#8217;une part, aux 
utilisateurs du syst&#232;me et d&#8217;autre part au syst&#232;me lui-m&#234;me, puisque lors de l&#8217;ajout d&#8217;un 
document dans la base, une partie du traitement sera vraisemblablement automatis&#233;e. C&#8217;est 
donc la d&#233;finition du langage documentaire qui nous incombe. Elle repose sur trois probl&#232;mes 
distincts et interd&#233;pendants : 
</p>
<p>&#8226; L&#8217;utilisation des textes dans l&#8217;enseignement des langues, que ce soit avec ou sans 
l&#8217;intervention de l&#8217;ordinateur 
</p>
<p>&#8226; Le processus de recherche d&#8217;un texte par un enseignant de langue que nous 
mod&#233;liserons, &#224; travers le recensement de crit&#232;res de recherche. 
</p>
<p>&#8226; L&#8217;impl&#233;mentation informatique de la base. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une utilisation du TAL dans la description p&#233;dagogique de textes dans l'enseignement 
des langues 
</p>
<p>Nous d&#233;taillerons ici principalement une partie du troisi&#232;me de ces aspects, m&#234;me si aucun 
des trois aspects ne peut &#234;tre trait&#233; compl&#232;tement ind&#233;pendamment des deux autres. Pour ce 
faire, nous utiliserons les r&#233;sultats d&#8217;une &#233;tude pr&#233;liminaire, qui nous a permis de commencer 
&#224; mettre en &#233;vidence certains besoins des enseignants, comme le fait de pouvoir choisir un 
texte en fonction de son contenu lexical et grammatical ou encore celui d&#8217;avoir recours &#224; des 
textes entiers et non &#224; des portions de texte. Les r&#233;sultats de cette &#233;tude ne sont pas d&#233;finitifs, 
ils ont servi de base &#224; la cr&#233;ation d&#8217;un questionnaire &#224; plus grande &#233;chelle. Ils permettent 
cependant d'&#233;valuer l&#8217;ad&#233;quation des syst&#232;mes existants avec la notion d&#8217;indexation 
p&#233;dagogique de textes pour l&#8217;enseignement des langues. 
</p>
<p>Avant de proposer une solution ad hoc pour le langage documentaire &#224; utiliser, nous devions 
nous assurer que l'existant ne r&#233;pondait pas d'ores et d&#233;j&#224; &#224; notre probl&#232;me, nous pr&#233;senterons 
donc tout d'abord les principaux standards de description de ressources p&#233;dagogiques, apr&#232;s 
quoi nous les soumettrons &#224; notre probl&#233;matique avant de conclure sur le sujet. 
</p>
<p>2 Standards de description de ressources p&#233;dagogiques 
</p>
<p>2.1 Pr&#233;sentations des principaux standards 
</p>
<p>La Dublin Core Metadata Initiative (DCMI) constitue le standard le plus ancien parmi ceux 
que nous allons pr&#233;senter. Bien que n&#8217;&#233;tant pas &#224; proprement parler un standard de 
description &#171; p&#233;dagogique &#187;, il a influenc&#233; les principaux standards de description d&#8217;objets 
p&#233;dagogiques existants, d&#8217;o&#249; sa pr&#233;sence ici. La DCMI est &#224; l&#8217;origine du Dublin Core 
Element Set (DCES) qui permet de d&#233;crire des ressources &#224; partir de quinze &#233;l&#233;ments, tous 
utilisables z&#233;ro, une ou plusieurs fois (Title, Creator, Subject, Description, Publisher, 
Contributor, Date, Type, Format, Identifier, Source, Language, Relation, Coverage, Rights) 
(DCMI, 2005). Ces &#233;l&#233;ments tr&#232;s g&#233;n&#233;raux ne permettront pas de d&#233;crire suffisamment 
pr&#233;cis&#233;ment tout type de document mais le DCES n&#8217;est pas fig&#233; : 
</p>
<p>Ce mod&#232;le permet aux diff&#233;rentes communaut&#233;s d&#8217;utilisateurs de se servir des &#233;l&#233;ments DC 
pour les informations descriptives fondamentales tout en autorisant les extensions sp&#233;cifiques 
&#224; un domaine et qui sont pertinentes pour un public moins large (Hillman, 2005) (Traduction 
de l&#8217;auteur) 
</p>
<p>Le Gateway to Educational Material (GEM, 2004) et Educational Network of Australia 
metadata (EdNA, 2002) constituent tous deux des exemples d'extensions / raffinements du 
DCES pour la description d&#8217;objets p&#233;dagogiques. 
</p>
<p>Enfin, le LOM (Learning Object Metadata), qui est probablement le plus utilis&#233; et le plus 
influent de ces formats, est le fruit de la collaboration d&#8217;&#233;quipes du projet europ&#233;en 
ARIADNE1 et du consortium am&#233;ricain IMS Global Learning1. 
</p>
<p>                                                 
1 http://www.ariadne-eu.org et http://www.imsproject.org respectivement </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LOISEAU 
</p>
<p>2.2 Caract&#233;ristiques communes 
</p>
<p>Tous ces standards restent tr&#232;s g&#233;n&#233;ralistes. C&#8217;est &#233;vident pour la DCMI, cependant, c&#8217;est le 
cas aussi pour les autres. Ils se veulent capable de d&#233;crire des ressources appartenant &#224; 
n&#8217;importe quel domaine de l&#8217;enseignement : dans le LOM un objet p&#233;dagogique est 
&#171; N&#8217;importe quelle entit&#233;, num&#233;ris&#233;e ou non, qui pourrait &#234;tre utilis&#233;e pour l&#8217;apprentissage, 
l&#8217;enseignement ou la formation &#187; (LOM, 2002) (traduction de l&#8217;auteur) 
</p>
<p>LOM utilise des niveaux d&#8217;agr&#233;gation cens&#233;s permettre &#224; partir du m&#234;me ensemble 
d&#8217;&#233;l&#233;ments de d&#233;crire aussi bien un texte qu&#8217;une formation enti&#232;re. Le fait que ces standards 
soient si g&#233;n&#233;ralistes nuira fatalement &#224; la pr&#233;cision de la description qu&#8217;elles proposent, 
comme le fait remarquer Jean-Philippe Pernin lorsqu'il cite parmi les impr&#233;cisions ou 
ambigu&#239;t&#233;s dont souffre le LOM : &#171; la volont&#233; d'int&#233;grer au sein d'un m&#234;me mod&#232;le des 
entit&#233;s de niveau conceptuellement tr&#232;s diff&#233;rent &#187; (Pernin, 2004). Notre probl&#232;me est 
extr&#234;mement sp&#233;cifique : la description que l&#8217;on pourra faire d&#8217;un texte dans le cadre de 
l&#8217;enseignement des langues, ne sera pas n&#233;cessairement applicable &#224; la description d&#8217;un texte 
dans une autre mati&#232;re et ne le sera assur&#233;ment pas pour d&#233;crire un probl&#232;me de 
math&#233;matique ou un cursus entier. 
</p>
<p>Les standards pr&#233;sent&#233;s sont donc trop g&#233;n&#233;ralistes pour &#234;tre appliqu&#233;s tels quels dans notre 
projet, mais elles pr&#233;sentent toutes la possibilit&#233; d&#8217;&#234;tre adapt&#233;es &#224; d&#8217;autres probl&#233;matiques. La 
conformit&#233; au LOM s&#8217;exprime en les termes suivants (LOM, 2002) : 
</p>
<p>&#8226; il n&#8217;est pas obligatoire de renseigner tous les &#233;l&#233;ments LOM 
&#8226; si l&#8217;on n'&#233;tend pas le standard l&#8217;instance sera strictement conforme 
&#8226; sinon elle sera conforme &#224; condition qu&#8217;aucun des &#233;l&#233;ments ajout&#233;s ne remplace un 
</p>
<p>&#233;l&#233;ment LOM 
On pourra donc tout &#224; fait r&#233;utiliser le LOM, on sortira du cadre de la stricte conformit&#233; mais 
cela ne l&#8217;exclut pas pour autant. EdNA Metadata et GEM, constituant des extensions du 
DCES, ils pourront eux aussi &#234;tre raffin&#233;s en respectant les principes de la grammaire DCMI. 
</p>
<p>Que ce soit dans LOM, le GEM ou EdNA metadata, les &#233;l&#233;ments &#171; p&#233;dagogiques &#187; sont 
s&#233;par&#233;s des autres &#233;l&#233;ments. Le GEM et EdNA suivent les directives DCMI et utilisent donc 
le DCES pour &#171; les informations descriptives fondamentales &#187;. Dans LOM, les objets 
p&#233;dagogiques sont d&#233;crits en 77 &#233;l&#233;ments r&#233;partis en 9 cat&#233;gories dont l&#8217;une et d&#233;di&#233;e &#224; la 
composante p&#233;dagogique de la description (&#171; Educational &#187;). 
</p>
<p>2.3 Les &#233;l&#233;ments p&#233;dagogiques 
</p>
<p>Le GEM ajoute cinq &#233;l&#233;ments dits p&#233;dagogique (Audience, Duration, Essential Ressources, 
Instructional Method et Standards) (GEM, 2004), EdNa Metadata trois (Audience, Category 
Code et Review) (EdNA, 2002) et enfin le LOM dispose de onze &#233;l&#233;ments de ce type (5.1. 
Interactivity Type, 5.2. Learning Resource Type, 5.3. Interactvity Level, 5.4. Semantic 
Density, 5.5. Intended End User Role, 5.6. Context, 5.7. Typical Age Range, 5.8. Difficulty, 
5.9. Typical Learning Time, 5.10. Description, 5.11. Language). 
</p>
<p>Quelle que soit le standard utilis&#233;, chacun des champs concerne une propri&#233;t&#233; jug&#233;e 
intrins&#232;que &#224; l&#8217;objet p&#233;dagogique. Pour le GEM, EdNA Metadata et LOM, un texte brut entre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une utilisation du TAL dans la description p&#233;dagogique de textes dans l'enseignement 
des langues 
</p>
<p>dans le cadre de l&#8217;utilisation du standard. Pourtant les propri&#233;t&#233;s consid&#233;r&#233;es comme 
intrins&#232;ques &#224; un objet p&#233;dagogique ne le sont pas forc&#233;ment pour un texte brut. 
</p>
<p>Prenons l&#8217;exemple des &#233;l&#233;ments &#171; Audience &#187; de GEM et EdNA, qui pourraient correspondre 
&#224; l&#8217;&#233;l&#233;ment 5.5 ou au couple d&#8217;&#233;l&#233;ments 5.5 et 5.7 de LOM. Il est ressorti de l&#8217;&#233;tude 
pr&#233;liminaire &#233;voqu&#233;e pr&#233;c&#233;demment que selon le type d&#8217;activit&#233;, un texte donn&#233; pouvait &#234;tre 
utilis&#233; avec des publics tr&#232;s vari&#233;s. Pour une activit&#233; de compr&#233;hension, il est moins important 
que les apprenants connaissent parfaitement les structures et le vocabulaire employ&#233;s que 
dans un exercice de grammaire. Le texte ne peut donc pas &#234;tre consid&#233;r&#233; comme 
intrins&#232;quement destin&#233; &#224; un public puisqu&#8217;en fonction du type d&#8217;activit&#233;, le public pourra 
&#234;tre diff&#233;rent. De m&#234;me les &#233;l&#233;ments &#171; Duration &#187; du GEM et 5.9 de LOM, que l&#8217;on peut 
consid&#233;rer comme &#233;quivalents, n&#8217;auront aucun sens pour un texte brut. Un texte donn&#233; 
pouvant servir de support &#224; un exercice de compr&#233;hension ou &#224; l&#8217;introduction d&#8217;une nouvelle 
notion grammaticale sera utilis&#233; beaucoup plus longtemps que le m&#234;me texte servant 
uniquement de base pour un exercice lacunaire concernant les d&#233;terminants pour un public 
plus avanc&#233;. Nous terminerons ce tour d&#8217;horizon non exhaustif des champs p&#233;dagogiques en 
faisant remarquer qu&#8217;un champ comme l&#8217;&#233;l&#233;ment 5.3 de LOM n&#8217;est pas seulement inadapt&#233; &#224; 
notre probl&#232;me, il est en outre complexe &#224; renseigner puisque les valeurs accept&#233;es sont &#224; 
choisir parmi &#171; very low, low, medium, high et very high &#187; sans que le standard ne fournisse 
de r&#233;elles directives pour leur utilisation. 
</p>
<p>3 Conclusion 
M&#234;le si ces diff&#233;rents standards, ne sont pas utilisables tels quels pour notre projet, il n&#8217;est pas 
exclu de r&#233;aliser un profil d&#8217;application de m&#233;tadonn&#233;es : &#171; un assemblage d&#8217;&#233;l&#233;ments de 
m&#233;tadonn&#233;es choisis &#224; partir d&#8217;un ou plusieurs sch&#233;mas de m&#233;tadonn&#233;es et combin&#233;s dans un 
sch&#233;ma composite &#187;. (Duval et al., 2002) (traduction de l'auteur) En effet la plupart des 
&#233;l&#233;ments non p&#233;dagogiques seront r&#233;utilisables. De plus, la cr&#233;ation d&#8217;un profil d&#8217;application 
de m&#233;tadonn&#233;es peut permettre d&#8217;am&#233;liorer les ensembles de valeurs propos&#233;s pour certains 
&#233;l&#233;ments, en fournissant des lignes directrices tr&#232;s pr&#233;cises quant &#224; l&#8217;utilisation d&#8217;une norme. 
</p>
<p>Les remarques que nous avons pu faire sur le caract&#232;re intrins&#232;que ou non de certaines 
propri&#233;t&#233;s d&#233;crites dans les &#233;l&#233;ments p&#233;dagogiques nous ont amen&#233; &#224; pr&#233;ciser l&#8217;architecture 
probable du syst&#232;me de gestion de la base de texte. Le fait que les &#233;l&#233;ments ne correspondent 
pas &#224; des propri&#233;t&#233;s intrins&#232;ques des textes ne signifie pas que certaines informations qu&#8217;ils 
pourraient contenir ne s&#8217;av&#233;reront pas int&#233;ressantes pour les enseignants. La description des 
textes devra, pour &#234;tre coh&#233;rente, contenir exclusivement des informations valables quelle que 
soit l&#8217;utilisation du texte. Nous nous proposons donc de s&#233;parer le processus en deux parties. 
Dans un premier temps on d&#233;crira les textes en fonction de traits pertinents pour les 
enseignants, mais qui ne varieront pas selon l&#8217;utilisation qui sera faite du texte. Les 
caract&#233;ristiques lexicales, syntaxiques (vocabulaire, structures grammaticales) du texte, par 
exemple sont des caract&#233;ristiques intrins&#232;ques au texte, qui pourront dans une certaine mesure 
&#234;tre relev&#233;es automatiquement gr&#226;ce &#224; l&#8217;utilisation d&#8217;outils TAL comme un lemmatiseur ou 
un analyseur morphologique. Mais les propri&#233;t&#233;s intrins&#232;ques aux textes ne seront 
probablement pas suffisantes pour r&#233;pondre &#224; toutes les questions des utilisateurs de la base. 
Nous aurons donc recours, &#224; une couche logicielle suppl&#233;mentaire, un moteur d&#8217;inf&#233;rence qui 
permettra de consid&#233;rer plusieurs facettes de chaque texte. Le moteur devra analyser les 
caract&#233;ristiques de chaque texte en les combinant avec des informations fournies par </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LOISEAU 
</p>
<p>l&#8217;utilisateur dans sa requ&#234;te afin d&#8217;en d&#233;duire certaines qualit&#233;s d&#8217;un texte en fonction de 
l&#8217;utilisation qui en sera faite. 
</p>
<p>Il nous est actuellement impossible de faire la liste des outils TAL n&#233;cessaires &#224; la r&#233;alisation 
de cette base. Les deux exemples ci-dessus (lemmatiseur / analyseur morphologique) 
paraissent correspondre &#224; la demande des enseignants2. Cependant cela devra &#234;tre confirm&#233; 
par une analyse plus pouss&#233;e des besoins des enseignants, via un questionnaire moins ouvert. 
En pr&#233;cisant les besoins, nous serons en mesure de dire si oui ou non ces outils peuvent 
r&#233;pondre &#224; la demande des enseignants. En outre, les r&#233;sultats obtenus avec ces types d'outils 
sont suffisamment fiables pour que ces derniers puissent &#234;tre employ&#233;s. Car si l'utilit&#233; de 
l'outil dans la perspective de la description du texte pour l'enseignement des langues est une 
valeur primordiale pour d&#233;cider de son utilisation, elle n'est pas la seule, une fiabilit&#233; 
minimum sera &#224; d&#233;finir plus tard afin que la pr&#233;cision des requ&#234;tes effectu&#233;es sur la base ne 
soit pas trop faible. Enfin, nous devrons probablement adopter une architecture modulaire 
pour le syst&#232;me, afin de pouvoir int&#233;grer plus tard de nouveaux outils &#224; la base. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Antoniadis, G., Echinard, S., Kraif, O., Lebarb&#233;, T., Ponton, C. (2004), Mod&#233;lisation de 
l&#8217;int&#233;gration de ressources TAL pour l&#8217;apprentissage des langues : la plateforme MIRTO 57-
70 actes de la journ&#233;e TAL et Apprentissage des langues du 22 Octobre 2004, 
http://www.u-grenoble3.fr/lidilem/talal/actes/JourneeTALAL-041022-antoniadis.pdf. 
</p>
<p>DCMI Usage Board (10 janvier 2005). DCMI Metadata Terms. Consult&#233; en janvier 2005 
http://dublincore.org/documents/dcmi-terms/
</p>
<p>Duval E., Hodgins W., Sutton S., Weibel S. L. (2002) Metadata Principles and Practicalities. 
D-Lib Magazine, 8 (4). Consult&#233; en avril 2005. 
http://www.dlib.org/dlib/april02/weibel/04weibel.html
</p>
<p>EdNA (septembre 2002), EdNA Metadata Standard V1.1. Consult&#233; en septembre 2004 
http://www.edna.edu.au/edna/go/pid/385
</p>
<p>GEM (1er Juin 2004), GEM Top-Level Elements. Consult&#233; en janvier 2005 
http://www.thegateway.org/about/documentation/metadataElements/
</p>
<p>Hillman D. (26 ao&#251;t 2003), Using Dublin Core Consult&#233; en septembre 2004 
http://dublincore.org/documents/usageguide/
</p>
<p>LOM (juillet 2002), Final 1484.12.1 LOM Draft Standard Document. Consult&#233; en avril 2005 
http://ltsc.ieee.org/wg12/files/LOM_1484_12_1_v1_Final_Draft.pdf
</p>
<p>Pernin J.P. (2004), A propos des objets p&#233;dagogiques, in &quot;Entre technique et p&#233;dagogie : la 
cr&#233;ation de contenus multim&#233;dia pour l'enseignement et la formation&quot;, Neuch&#226;tel : IRDP. 
</p>
<p>                                                 
2 Donn&#233;es provenant d'un premier questionnaire, volontairement tr&#232;s ouvert de mani&#232;re &#224; laisser les enseignants 
</p>
<p>s'exprimer sans qu'on leur impose un point de vue a priori, rempli par 130 enseignants. </p>

</div></div>
</body></html>