<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Utilisation de la Linguistique Syst&#233;mique Fonctionnelle pour la d&#233;tection des noms de personnes ambigus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Utilisation de la Linguistique Syst&#233;mique Fonctionnelle pour
la d&#233;tection des noms de personnes ambigus
</p>
<p>Thomas Heitz
LRI - Universit&#233; Paris Sud
</p>
<p>91405 Orsay Cedex - France
heitz@lri.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Linguistique Syst&#233;mique Fonctionnelle, D&#233;tection des entit&#233;s nomm&#233;es, Fouille de textes
Systemic Functional Linguistics, Named entity recognition, Text mining
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans cet article, nous nous proposons de construire un lexique &#233;tiquet&#233; selon les principes de
la Linguistique Syst&#233;mique Fonctionnelle (LSF) et de l&#8217;appliquer &#224; la d&#233;tection des noms de
personnes ambigus dans les textes. Nous ne faisons pas d&#8217;analyse compl&#232;te mais testons plut&#244;t
si certaines caract&#233;ristiques de la LSF peuvent permettre de compl&#233;ter les mod&#232;les linguistiques
actuellement utilis&#233;s pour la d&#233;tection des entit&#233;s nomm&#233;es. Nous souhaitons ainsi apporter une
contribution &#224; l&#8217;application du formalisme LSF dans l&#8217;analyse automatique de textes apr&#232;s son
application d&#233;j&#224; &#233;prouv&#233;e &#224; la g&#233;n&#233;ration de textes.
</p>
<p>In this paper, we propose to build a tagged lexicon according to the Systemic Functional Lin-
guistics (SFL) principles and to apply it to the recognition of ambiguous person names in texts.
We do not achieve a complete analysis but rather test if some characteristics of the SFL could
enable the completion of actual linguistic models used in named entity recognition. We want
thus to bring a contribution to the application of the SFL model in automatic text analysis while
it already proved its usefulness for text generation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thomas Heitz
</p>
<p>1 Introduction
</p>
<p>Nous allons discuter de l&#8217;int&#233;r&#234;t du formalisme de la Linguistique Syst&#233;mique Fonctionnelle
(LSF) pour la d&#233;tection des noms de personnes ambigus dans les textes. Nous nous situons
donc dans le domaine de la d&#233;tection des entit&#233;s nomm&#233;es qui est une des t&#226;ches essentielles de
la fouille de textes (Daille &amp; Morin, 2000).
La LSF (Halliday &amp; Matthiessen, 2004) offre une approche compl&#233;mentaire des linguistiques
habituellement utilis&#233;es. La LSF part du contexte social et d&#232;s le d&#233;part cherche &#224; comprendre
la fonction des mots alors que traditionnellement les linguistiques partent des mots pour arriver
finalement au sens.
</p>
<p>Nous souhaitons ici &#233;tudier l&#8217;int&#233;r&#234;t de caract&#233;ristiques de la LSF dans le but de les incorporer
dans les derni&#232;res &#233;tapes d&#8217;un syst&#232;me de d&#233;tection d&#8217;entit&#233;s nomm&#233;es similaire &#224; ceux utilis&#233;s
lors de la comp&#233;tition MUC-7 (Mikheev et al., 1998).
Dans le domaine de la d&#233;tection des entit&#233;s nomm&#233;es, il a &#233;t&#233; constat&#233; que le probl&#232;me de la
poly-cat&#233;gorisation d&#8217;une entit&#233; nomm&#233;e n&#233;cessite une meilleure analyse du contexte pour la
traiter (Daille &amp; Morin, 2000). La poly-cat&#233;gorisation existe, par exemple, pour le nom ambigu
de personne France, qui peut aussi &#234;tre un nom de pays.
</p>
<p>Nous nous int&#233;resserons ici aux verbes appartenant aux contextes des noms de personnes. Plus
pr&#233;cis&#233;ment, nous chercherons les processus de la LSF associ&#233;s &#224; ceux-ci puisque les processus
sont port&#233;s par les verbes. Les processus d&#8217;une phrase &#233;tant les &#233;l&#233;ments qui d&#233;signent la ou
les actions en cours entre les diff&#233;rents acteurs participant &#224; l&#8217;action et pour des circonstances
donn&#233;es. Puis, nous constaterons si des liens existent entre cat&#233;gories de processus et contextes
de noms de personnes. Ainsi, nous pensons pouvoir am&#233;liorer la discrimination entre les noms
de personnes et les autres noms propres ou les mots communs dans les cas ambigus.
</p>
<p>Nous allons &#233;tablir une m&#233;thodologie pour la d&#233;tection des noms de personnes ambigus &#224; l&#8217;aide
des processus de la LSF sur une premi&#232;re partie d&#8217;un corpus. Puis, nous validerons exp&#233;rimen-
talement notre hypoth&#232;se d&#8217;am&#233;lioration de la d&#233;tection des noms de personnes ambigus sur
une autre partie du m&#234;me corpus.
</p>
<p>1.1 Extraction des noms de personnes
</p>
<p>Comme la recherche sur les entit&#233;s nomm&#233;es l&#8217;a d&#233;j&#224; &#233;tabli (Poibeau, 2001), les noms de per-
sonnes sont souvent entour&#233;s par des mots inclus dans l&#8217;entit&#233; nomm&#233;e. A savoir, les noms
de fonction ou de titre qui peuvent se situer en pr&#233;fixe comme Mr., en infixe comme de la ou
en suffixe comme Second du nom. Par exemple Mr. Arnaud de la Tour Second du nom. De
nombreuses grammaires et lexiques ont &#233;t&#233; d&#233;velopp&#233;s pour rep&#233;rer ces formes.
</p>
<p>En plus de ces mots inclus dans le nom de personne, que nous appellerons indices locaux, les
indices contextuels ont &#233;t&#233; aussi &#233;tudi&#233;s. Par exemple, la pr&#233;position chez introduit presque
toujours une personne. De m&#234;me, des grammaires utilisant ces indices ont &#233;t&#233; d&#233;velopp&#233;es.
Mais ces indices contextuels restent la plupart du temps limit&#233;s aux mots grammaticaux que
sont les d&#233;terminants, conjonctions et pr&#233;positions pour les r&#232;gles non apprises. Nous voulons
donc l&#8217;&#233;tendre aux mots lexicaux que sont les verbes, noms, adjectifs et adverbes afin de mieux
traiter les cas ambigus de noms de personnes. Dans cet article, nous nous limiterons aux verbes
appartenant aux contextes des noms de personnes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utilisation de la LSF pour la d&#233;tection des noms de personnes ambigus
</p>
<p>1.2 Processus dans la Linguistique Syst&#233;mique Fonctionnelle
</p>
<p>Les processus appartiennent &#224; la fonction id&#233;ationnelle de la LSF (Halliday &amp; Matthiessen,
2004) qui est un mod&#232;le d&#8217;analyse de la phrase qui divise celle-ci en processus, participants
et circonstances. Dans ce mod&#232;le, les verbes peuvent &#234;tre cat&#233;goris&#233;s dans des processus
puisqu&#8217;ils les supportent. Il existe six principaux processus : mat&#233;riel, mental, verbal, rela-
tionnel, comportemental et existentiel. Dans le tableau 1 sont caract&#233;ris&#233;s les participants des
diff&#233;rents processus de la LSF.
</p>
<p>Processus Sens Nombre de Nature du Nature du
participant premier participant second participant
</p>
<p>Mat&#233;riel faire et avoir lieu 1 ou 2 chose chose
Mental resentir 2 chose consciente chose ou fait
Verbal dire 1 source de symboles
</p>
<p>Relationnel &#234;tre et avoir 1 ou 2 chose ou fait
Comportemental se comporter 1 chose consciente
</p>
<p>Existentiel exister 1 ou 01 chose ou fait
</p>
<p>Table 1: Caract&#233;ristiques des participants des processus de la LSF
</p>
<p>Les personnes, en tant que premiers participants, sont impliqu&#233;es presque syst&#233;matiquement
dans les processus mentaux, comportementaux et verbaux comme chose consciente pour les
deux premiers et source de symbole pour le troisi&#232;me et d&#8217;une fa&#231;on plus incertaine dans les
autres processus. Nous allons donc tester l&#8217;implication de ces processus dans les contextes de
noms de personnes sur un corpus afin de retenir les cat&#233;gories pertinentes.
</p>
<p>2 M&#233;thodologie pour la d&#233;tection des noms de personnes am-
bigus &#224; l&#8217;aide des processus de la LSF
</p>
<p>2.1 Extraction des relations syntaxiques et des noms de personnes
</p>
<p>Nous avons utilis&#233; un sous ensemble du corpus Aquaint d&#8217;une taille d&#8217;environ 10 m&#233;gaoctets
provenant de la comp&#233;tition TREC Novelty 2004 (Soboroff, 2004). Il contient des d&#233;p&#234;ches
&#233;crites en anglais en provenance d&#8217;agences de presse.
</p>
<p>Un lexique de verbes &#233;tiquet&#233;s selon les processus de la LSF &#224; &#233;t&#233; &#233;labor&#233; manuellement &#224;
partir de (Halliday &amp; Matthiessen, 2004) et &#233;tendu en rajoutant l&#8217;intersection des hyponymes et
synonymes contenus dans WordNet (Miller et al., 1990) pour chaque verbe initial. Puis, nous
avons extrait &#224; partir du corpus une liste de noms de personnes de mani&#232;re semi-automatique
avec des listes de noms de personnes d&#233;j&#224; connus et une correction manuelle.
Le logiciel Link Grammar 4.1 (Sleator &amp; Temperley, 1993) a &#233;t&#233; utilis&#233; afin d&#8217;extraire les rela-
tions syntaxiques des phrases du corpus. Seules les relations syntaxiques de type Sujet-Verbe
d&#233;nomm&#233;es S et SI dans la nomenclature de Link Grammar ont &#233;t&#233; prises en compte.
</p>
<p>1Par exemple, dans la phrase : There was a storm. il n&#8217;y a pas de participant juste un processus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thomas Heitz
</p>
<p>Nous avons ensuite lemmatis&#233; les verbes, &#233;tiquet&#233; les verbes lemmatis&#233;s selon les processus
de la LSF et &#233;tiquet&#233; les noms de personnes. Une partie du corpus contenant des noms de
personnes ambigus a &#233;t&#233; mise de c&#244;t&#233; afin de pouvoir tester les hypoth&#232;ses faite dans la section
2.2.
</p>
<p>2.2 &#201;tablissement de correspondances entre les processus de la LSF et les
contextes de noms de personnes
</p>
<p>Nous avons cherch&#233; les types de processus qui qualifient les verbes dont les sujets sont des noms
de personnes &#224; partir des relations Sujet-Verbe trouv&#233;es pr&#233;c&#233;demment dans la section 2.1. Les
r&#233;sultats sont pr&#233;sent&#233;s dans le tableau 2.
</p>
<p>Processus Sens Lexique Relation Personne-Verbe Comparaison
Mat&#233;riel faire et avoir lieu 46% (2462) 71% (6627) +25
Mental resentir 12% (653) 66% (6098) +54
Verbal dire 7% (353) 49% (4557) +42
</p>
<p>Relationnel &#234;tre et avoir 32% (1698) 71% (6609) +39
Comportemental se comporter 3% (166) 8% (345) +5
</p>
<p>Existentiel exister 2% (129) 14% (1305) +12
Total 5353 verbes 9285 relations
</p>
<p>Table 2: Occurrences des processus dans les relations Personne-Verbe. Il existe une cat&#233;gorie
par ligne dans le lexique mais plusieurs par ligne dans les relations.
</p>
<p>Nous pouvons constater que les processus de types mental et verbal semblent les plus adapt&#233;s
pour trouver les contextes de noms de personnes puisque ce sont les cat&#233;gories de processus
dont la proportion augmente le plus par rapport &#224; celle du lexique utilis&#233;. Ceci confirme en
partie ce qui &#233;tait attendu d&#8217;apr&#232;s le mod&#232;le th&#233;orique expos&#233; dans la section 1.2. Cependant
la cat&#233;gorie relationnel augmente aussi beaucoup bien que les verbes obtenus ne soient pas
tr&#232;s pertinents. Il sera donc utile dans une prochaine exp&#233;rimentation de tenir compte des sous
cat&#233;gories pour obtenir des r&#233;sultats plus pr&#233;cis.
</p>
<p>3 Validation exp&#233;rimentale
</p>
<p>3.1 Ambigu&#239;t&#233;s entre noms de personnes et autres noms propres
</p>
<p>De nombreux noms de personnes sont aussi des noms d&#8217;organisations ou de lieux notamment.
Plus g&#233;n&#233;ralement, ceci rejoint le probl&#232;me de la poly-cat&#233;gorisation des entit&#233;s nomm&#233;es.
Dans le tableau 3, sont pr&#233;sent&#233;s quelques cas d&#8217;ambigu&#239;t&#233; avec les autres noms propres. Les
r&#233;sultats sont donn&#233;s sous forme de fractions comportant au num&#233;rateur le nombre de mots bien
identifi&#233;s comme un nom de personne ou comme un autre nom propre et au d&#233;nominateur le
nombre d&#8217;occurrences de ce mot pour lesquels les verbes dont il est le sujet ont &#233;t&#233; cat&#233;goris&#233;s.
Les verbes sont cat&#233;goris&#233;s selon les processus de la LSF et lorsqu&#8217;ils appartiennent &#224; au
moins deux types parmi mental, verbal et comportemental nous consid&#233;rons que le mot</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utilisation de la LSF pour la d&#233;tection des noms de personnes ambigus
</p>
<p>est un nom de personne et non une organisation ou un lieu. Les modaux ne sont pas pris en
compte.
</p>
<p>Type d&#8217;ambigu&#239;t&#233; Nom Pr&#233;cision
Personne - Organisation Ford 24/35
</p>
<p>Bell 0/5
Morris 0/0
</p>
<p>Personne - Lieu Virginia 0/0
Madison 0/0
</p>
<p>Table 3: R&#233;sultats pour la distinction entre noms de personnes et autres noms propres
</p>
<p>3.2 Ambigu&#239;t&#233;s entre noms de personnes et mots communs
</p>
<p>Il existe de nombreux cas o&#249; la distinction entre noms propres et mots communs ne peut
s&#8217;effectuer gr&#226;ce &#224; la casse de la premi&#232;re lettre du mot. Les principaux cas sont : premier
mot de phrase ou de citation, titre, transcription de l&#8217;oral vers l&#8217;&#233;crit tout en minuscules, langue
sans diff&#233;renciation de casse entre noms propres et mots communs. En allemand, par exem-
ple, les mots communs s&#8217;&#233;crivent avec une majuscule en premi&#232;re lettre comme pour les noms
propres. Ceci justifie de traiter les cas d&#8217;ambigu&#239;t&#233;s entre noms de personnes et mots communs.
Une phrase exemplaire tir&#233;e de notre corpus est la suivante : Ray believes the electron beam
process is superior to gamma ray irradiation because the technology is easier and cheaper to
implement.
</p>
<p>On peut y voir le mot ray sous la forme de nom de personne et de mot commun. La majuscule
de d&#233;but de mot ne suffit pas ici &#224; les distinguer car Ray est le premier mot de la phrase qui par
d&#233;finition poss&#232;de toujours une majuscule en premi&#232;re lettre. Le verbe to believe, croire, qui le
suit est class&#233; dans les processus de type mental et correspond bien &#224; une cat&#233;gorie de processus
appartenant &#224; des contextes de noms de personnes comme vu dans la section 2.2.
</p>
<p>Dans le tableau 4, trois des cas les plus fr&#233;quents d&#8217;ambigu&#239;t&#233;s entre noms de personnes et
mots communs sont pr&#233;sent&#233;s. Les r&#233;sultats sont donn&#233;s sous la m&#234;me forme que les r&#233;sultats
pr&#233;c&#233;dents et avec le m&#234;me protocole.
</p>
<p>Type d&#8217;ambigu&#239;t&#233; Nom Pr&#233;cision
Personne - Nom commun bill 49/66
</p>
<p>bird 0/2
stone 3/3
ray 4/4
</p>
<p>Personne - Verbe drew 0/0
mark 0/0
</p>
<p>Personne - Adjectif brown 11/11
gray 20/32
</p>
<p>Table 4: R&#233;sultats pour la distinction entre noms de personnes et mots communs
</p>
<p>Exemples de phrases trait&#233;es :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thomas Heitz
</p>
<p>The bill died in a Transportation subcommittee, but Moreno said it had widespread support in
the house [...] To die, processus mental impliquant un nom de personne, mal cat&#233;goris&#233;.
Mel-Daniels was an assistant coach at State when Bird led the team the NCAA final in 1979.
To lead, processus verbal impliquant un nom de personne, bien cat&#233;goris&#233;.
</p>
<p>On trouve notamment le probl&#232;me de la poly-cat&#233;gorisation comme pour le verbe to die qui ne
devrait pas &#234;tre class&#233; mental mais mat&#233;riel et tr&#232;s rarement comme processus mental. Beau-
coup de mots communs sont ici personnifi&#233;s comme pour le mot bill, projet de loi en fran&#231;ais,
ce qui peut &#234;tre source d&#8217;erreurs.
</p>
<p>4 Conclusion et perspectives
</p>
<p>Nous nous sommes ici int&#233;ress&#233; aux verbes dont le sujet est un nom de personne. D&#8217;apr&#232;s
ces premiers r&#233;sultats, m&#234;me s&#8217;il appara&#238;t important de chercher quelle action subit ou effectue
un &#234;tre conscient pour d&#233;couvrir tous les noms de personnes d&#8217;un texte, il semble n&#233;cessaire
d&#8217;avoir des informations suppl&#233;mentaires comme les autres participants des processus et les
circonstances. L&#8217;utilisation des sous cat&#233;gories de processus coupl&#233;e &#224; l&#8217;apprentissage de r&#232;gles
de classification semble aussi une piste &#224; suivre.
</p>
<p>Une comparaison avec d&#8217;autres m&#233;thodes d&#8217;expansion de termes pour notre lexique de base et
d&#8217;autres lexiques cat&#233;gorisant les verbes diff&#233;remment serait utile. De m&#234;me qu&#8217;une comparai-
son avec d&#8217;autres syst&#232;mes de d&#233;tection d&#8217;entit&#233;s nomm&#233;es sur des corpus de r&#233;f&#233;rence une fois
l&#8217;analyse des processus de la LSF int&#233;gr&#233;e dans un syst&#232;me de d&#233;tection d&#8217;entit&#233;s nomm&#233;es.
</p>
<p>Je remercie mon directeur de th&#232;se, Yves Kodratoff, pour m&#8217;avoir fait d&#233;couvrir la LSF.
</p>
<p>R&#233;f&#233;rences
DAILLE B. &amp; MORIN E. (2000). Reconnaissance automatique des noms propres de la langue &#233;crite :
les r&#233;centes r&#233;alisations, In Traitement automatique des noms propres sous la direction de Denis Maurel
et Franz Guenthner, chapter 1, p. 601&#8211;621. Hermes. Collection : Traitement automatique des langues.
HALLIDAY M. A. K. &amp; MATTHIESSEN C. M. I. M. (2004). An Introduction to Functional Grammar.
Hodder Arnold. 3nd. edition.
</p>
<p>MIKHEEV A., GROVER C. &amp; MOENS M. (1998). Description of the ltg system used for muc-7. In
Message Understanding Conference Proceedings, MUC-7.
MILLER G. A., BECKWITH R., FELLBAUM C., GROSS D. &amp; MILLER K. J. (1990). Introduction to
wordnet: an on-line lexical database. International Journal of Lexicography 3 (4), p. 235&#8211;244. revised
august 1993.
POIBEAU T. (2001). Deconstructing harry, une &#233;valuation des syst&#232;mes de rep&#233;rage d&#8217;entit&#233;s nomm&#233;es.
Revue de la soci&#233;t&#233; d&#8217;&#233;lectronique, d&#8217;&#233;lectricit&#233; et de traitement de l&#8217;information.
SLEATOR D. &amp; TEMPERLEY D. (1993). Parsing english with a link grammar. In Third International
Workshop on Parsing Technologies.
</p>
<p>SOBOROFF I. (2004). Overview of the trec 2004 novelty track. In NIST Special Publication: The
Thirteenth Text Retrieval Conference (TREC 2004), p. 57&#8211;70.</p>

</div></div>
</body></html>