<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une plate-forme logicielle d&#233;di&#233;e &#224; la cartographie th&#233;matique de corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Une plate-forme logicielle d&#233;di&#233;e &#224; la cartographie
th&#233;matique de corpus
</p>
<p>Thibault ROY
Laboratoire GREYC, Equipe ISLanD - Universit&#233; de Caen / Basse-Normandie
</p>
<p>Campus II - C&#244;te de Nacre - Bd Mar&#233;chal Juin - 14032 Caen Cedex
troy@info.unicaen.fr
</p>
<p>date de soutenance pr&#233;vue fin 2007
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>cartographie de corpus, analyse th&#233;matique, logiciel individu-centr&#233;, analyse des donn&#233;es tex-
tuelles
corpora cartography, thematic analysis, user-centered software, textual data analysis
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article pr&#233;sente les principes de fonctionnement et les int&#233;r&#234;ts d&#8217;une plate-forme logicielle
centr&#233;e sur un utilisateur ou un groupe d&#8217;utilisateurs et d&#233;di&#233;e &#224; la visualisation de propri&#233;t&#233;s
th&#233;matiques d&#8217;ensembles de documents &#233;lectroniques. Cette plate-forme, appel&#233;e ProxiDocs,
permet de dresser des repr&#233;sentations graphiques (des cartes) d&#8217;un ensemble de textes &#224; partir
de th&#232;mes choisis et d&#233;finis par un utilisateur ou un groupe d&#8217;utilisateurs. Ces cartes sont inter-
actives et permettent de visualiser les proximit&#233;s et les diff&#233;rences th&#233;matiques entre textes com-
posant le corpus &#233;tudi&#233;. Selon le type d&#8217;analyse souhait&#233;e par l&#8217;utilisateur, ces cartes peuvent
&#233;galement s&#8217;animer afin de repr&#233;senter les changements th&#233;matiques d&#8217;un ensemble de textes
au fil du temps.
</p>
<p>This article presents a user-centered software dedicated to the visualization of thematic proper-
ties of sets of electronic documents. This software, called ProxiDocs, allows its users to realize
thematic maps from a corpora and themes they choose and defined. These maps are interactive
and reveal thematic proximities and differences between texts composing the studied corpus.
According to the analysis wished by the user, maps can be animated in order to represent the-
matic changes of the analysed set of texts relating to the time.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thibault ROY
</p>
<p>1 Introduction
</p>
<p>Cet article pr&#233;sente les principes de fonctionnement et les int&#233;r&#234;ts de la plate-forme logicielle
ProxiDocs d&#233;di&#233;e &#224; des analyses th&#233;matiques de corpus de textes. Sur le mod&#232;le de (Pichon et
S&#233;billot, 1999), nous entendons par th&#232;mes, les sujets abord&#233;s dans un texte. Traiter la th&#233;ma-
tique d&#8217;un texte revient donc pour nous &#224; mettre en &#233;vidence les principaux sujets abord&#233;s dans
ce dernier. Dans un grand nombre de situations (extraction et recherche d&#8217;information, analyse
de flux documentaires, etc.), l&#8217;appr&#233;hension des th&#232;mes abord&#233;s dans des textes constitue une
premi&#232;re analyse importante et d&#233;licate.
</p>
<p>ProxiDocs a pour objectif d&#8217;aider ses utilisateurs dans de telles situations en leur fournissant des
repr&#233;sentations graphiques (que nous appelons des cartes th&#233;matiques) d&#8217;un corpus de textes
donn&#233;. Les cartes construites mettent en &#233;vidence la r&#233;partition des th&#232;mes au sein des textes
du corpus et r&#233;v&#232;lent des proximit&#233;s et des diff&#233;rences de th&#232;mes entre textes. Ces cartes sont
construites &#224; partir de th&#232;mes choisis et d&#233;finis par l&#8217;utilisateur en fonction de la t&#226;che qu&#8217;il
souhaite accomplir. En ce sens, c&#8217;est un syst&#232;me anthropocentr&#233; tel que le d&#233;finit (Thlivitis,
1998) : son ex&#233;cution n&#8217;est pas guid&#233;e par des ressources propres, les traitements r&#233;alis&#233;s sont
personnalis&#233;s et int&#233;gralement conditionn&#233;s par les besoins et les choix de l&#8217;utilisateur.
</p>
<p>La plate-forme ProxiDocs est open-source, d&#233;velopp&#233;e en Java et disponible avec sa documen-
tation sur le Web1. C&#8217;est un syst&#232;me d&#233;velopp&#233; &#224; la fa&#231;on d&#8217;un logiciel d&#8217;&#233;tude au sens de (Ni-
colle, 1996), c&#8217;est-&#224;-dire qu&#8217;il est con&#231;u dans le but de v&#233;rifier des hypoth&#232;ses sur les langues
en les exp&#233;rimentant sur du mat&#233;riau textuel attest&#233;. ProxiDocs fait partie d&#8217;un ensemble de
logiciels d&#8217;&#233;tude en constante &#233;volution d&#233;di&#233;e &#224; l&#8217;analyse linguistique informatis&#233;e de corpus
de documents &#233;lectroniques2 d&#233;velopp&#233;s au sein de l&#8217;&#233;quipe ISLanD du laboratoire GREYC.
</p>
<p>Dans cet article, nous pr&#233;sentons tout d&#8217;abord des outils utilisant des techniques de cartogra-
phie afin d&#8217;acc&#233;der aux informations contenues dans des collections de documents. Ensuite,
nous abordons tout particuli&#232;rement la plate-forme ProxiDocs en d&#233;taillant ses principes de
fonctionnement et en pr&#233;sentant les diff&#233;rentes types de cartes qu&#8217;elle permet de construire.
</p>
<p>2 La cartographie d&#8217;ensembles de documents textuels
</p>
<p>Le nombre de documents textuels produits et &#233;chang&#233;s chaque jour ne cesse de cro&#238;tre. Afin
d&#8217;isoler les principales informations contenues dans des ensembles de documents textuels, il
peut &#234;tre int&#233;ressant de proposer des repr&#233;sentations graphiques de ces ensembles. De telles
repr&#233;sentations permettent de faire intervenir une notion de proximit&#233; entre &#233;l&#233;ments. Selon
le type d&#8217;analyse r&#233;alis&#233;e, il est alors possible d&#8217;observer des similarit&#233;s et des diff&#233;rences de
styles, de th&#232;mes, de mises en forme entre documents d&#8217;un m&#234;me ensemble.
</p>
<p>Depuis quelques ann&#233;es, des outils d&#8217;analyse textuelle exploitent une technique de visualisation
appel&#233;e cartographie. &#192; la mani&#232;re d&#8217;une carte routi&#232;re mettant en &#233;vidence des villes et des
routes les reliant, une carte d&#8217;un ensemble de donn&#233;es textuelles met en &#233;vidence des proximit&#233;s
et des liens entre entit&#233;s textuelles, tels des mots, des textes, etc.
</p>
<p>Dans une t&#226;che d&#8217;extraction d&#8217;information, les auteurs de (Mokrane et al., 2004) propose d&#8217;utili-
ser une technique de cartographie afin de visualiser les liens entre les principaux termes pr&#233;sents
</p>
<p>1http://www.info.unicaen.fr/~troy/proxidocs
2http://www.greyc.unicaen.fr/island/logiciel</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plate-forme logicielle d&#233;di&#233;e &#224; la cartographie th&#233;matique de corpus
</p>
<p>dans un ensemble de d&#233;p&#234;ches d&#8217;agences de presse.
</p>
<p>Depuis 2001, les deux m&#233;tamoteurs de recherche cartographiques KartOO (Chung et al., 2002)
et MapStan (Spinat, 2002) sont disponibles sur le Web3. En r&#233;ponse &#224; une requ&#234;te de l&#8217;utili-
sateur, ces deux outils retournent des cartes repr&#233;sentant les sites propos&#233;s en r&#233;ponse &#224; cette
requ&#234;te. Les sites jug&#233;s similaires par le syst&#232;me sont alors situ&#233;s &#224; proximit&#233; sur les cartes et il
est ainsi possible de distinguer les grandes cat&#233;gories d&#8217;informations propos&#233;es en r&#233;ponse &#224; la
requ&#234;te de l&#8217;utilisateur.
</p>
<p>Pour une t&#226;che de parcours rapide d&#8217;un ensemble documentaire, le logiciel NeuroNav (Lelu
et Aubin, 2001) de la soci&#233;t&#233; Diatopie4 pr&#233;sente sur une carte des groupes de documents. Les
diff&#233;rents groupes d&#233;termin&#233;s par le syst&#232;me et la disposition de ces groupes sur la carte peuvent
ainsi indiquer des proximit&#233;s de contenu entre documents et groupes repr&#233;sent&#233;s.
</p>
<p>De nombreux logiciels d&#233;di&#233;s &#224; l&#8217;analyse de donn&#233;es textuelles proposent &#233;galement des r&#233;-
sultats d&#8217;analyses sous forme de cartes. Parmi ces logiciels, nous pouvons citer Hyperbase
d&#8217;Etienne Brunet5, Lexico3 de l&#8217;&#233;quipe CLA2T de Paris III6 ou encore Lexica de la soci&#233;t&#233;
Le Sphinx7.
</p>
<p>&#192; la mani&#232;re de la plupart des outils pr&#233;c&#233;dents, la plate-forme que nous proposons va utili-
ser une technique de cartographie afin de mettre en &#233;vidence des proximit&#233;s et des liens entre
textes d&#8217;un m&#234;me ensemble. Contrairement &#224; ces outils, les traitements r&#233;alis&#233;s par ProxiDocs
prennent en consid&#233;ration les particularit&#233;s de l&#8217;utilisateur et de sa t&#226;che. &#192; partir de ressources
d&#233;crivant le point de vue de l&#8217;utilisateur sur des th&#232;mes de son choix, ProxiDocs cherche &#224; ex-
traire les tendances th&#233;matiques des textes d&#8217;un corpus. Ces tendances sont ensuite mises en
&#233;vidence sur des cartes.
</p>
<p>3 La plate-forme logicielle ProxiDocs
</p>
<p>3.1 D&#233;finitions et int&#233;r&#234;ts
</p>
<p>La plate-forme ProxiDocs permet de construire diff&#233;rents types de cartes th&#233;matiques &#224; partir
d&#8217;un corpus de textes et de th&#232;mes choisis et d&#233;finis par l&#8217;utilisateur :
</p>
<p>&#8211; des cartes en 2 ou 3 dimensions repr&#233;sentant chaque texte du corpus analys&#233; par un point, les
proximit&#233;s entre points indiquent des similarit&#233;s de th&#232;mes abord&#233;s dans les textes repr&#233;sent&#233;s
(figure 2) ;
</p>
<p>&#8211; des cartes en 2 ou 3 dimensions mettant en &#233;vidence des groupes de textes abordant des
th&#232;mes proches, chaque groupe est alors repr&#233;sent&#233; sur la carte par un disque ou une sph&#232;re
de diam&#232;tre proportionnelle &#224; nombre de textes qu&#8217;il contient (figure 3) ;
</p>
<p>&#8211; et des cartes en 2 dimensions anim&#233;es mettant en &#233;vidence l&#8217;&#233;volution des th&#232;mes abord&#233;s
dans les textes du corpus au fil du temps (figure 4).
</p>
<p>Les int&#233;r&#234;ts de ProxiDocs sont multiples. Les cartes th&#233;matiques construites par la plate-forme
permettent d&#8217;observer des regroupements entre textes abordant des th&#232;mes proches. De tels
</p>
<p>3Respectivement disponibles aux adresses : http://www.kartoo.fr et http://www.mapstan.net
4http://www.diatopie.com/
5http://ancilla.unice.fr/~brunet/pub/hyperbase.html
6http://www.cavi.univ-paris3.fr/ilpga/ilpga/tal/lexicowww/lexico3.htm
7http://www.lesphinx-developpement.fr/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thibault ROY
</p>
<p>regroupements sont tr&#232;s utiles dans des t&#226;ches de parcours rapide d&#8217;un grand ensemble de textes.
Dans des t&#226;ches de recherche documentaire sur Internet, la cartographie th&#233;matique appliqu&#233;e
aux pages d&#233;sign&#233;es par un moteur de recherche en r&#233;ponse &#224; une requ&#234;te permet d&#8217;observer
des regroupements entre pages abordant des th&#232;mes proches. De cette mani&#232;re, l&#8217;utilisateur peut
orienter sa recherche selon les th&#232;mes l&#8217;int&#233;ressant dans le cadre de sa recherche. Dans le cadre
de la veille documentaire, la cartographie d&#8217;un ensemble de documents sur diff&#233;rentes p&#233;riodes
cons&#233;cutives illustre des changements de th&#232;mes au fil du temps.
</p>
<p>3.2 Les th&#232;mes utilis&#233;s
</p>
<p>Afin de construire des cartes th&#233;matiques d&#8217;un corpus de textes, l&#8217;utilisateur doit tout d&#8217;abord
choisir et d&#233;finir les th&#232;mes qu&#8217;ils souhaitent faire intervenir sur ses cartes. Chaque th&#232;me est
repr&#233;sent&#233; par une liste de lexies (mots simples ou mots compos&#233;s) lui &#233;tant associ&#233;es du point
de vue de l&#8217;utilisateur. Afin de simplifier la phase de construction des th&#232;mes, l&#8217;utilisateur n&#8217;in-
dique que les formes lemmatis&#233;es des lexies. La plate-forme int&#233;gre une &#233;tape de g&#233;n&#233;ration
de formes fl&#233;chies &#224; l&#8217;aide d&#8217;une base de donn&#233;es lexicales. Un utilisateur peut par exemple
associer les lexies suivantes au th&#232;me de l&#8217;aviation : avion, appareil, vol, pilote, pilotage, piloter,
passager, Boeing, Air France, d&#233;collage, etc.
</p>
<p>Deux logiciels sont propos&#233;s &#224; l&#8217;utilisateur afin de l&#8217;aider &#224; construire ses th&#232;mes :
&#8211; l&#8217;outil Memlabor (Perlerin, 2002) permettant une analyse statistique des graphies r&#233;p&#233;t&#233;es
</p>
<p>d&#8217;un corpus. En exploitant le principe de coh&#233;sion lexicale, MemLabor se fonde sur l&#8217;hypo-
th&#232;se que plus une graphie (hors mots d&#8217;un anti-dictionnaire contenant par exemple les mots
grammaticaux) est r&#233;p&#233;t&#233;e dans le corpus, plus elle est susceptible de pouvoir &#234;tre associ&#233;e &#224;
l&#8217;un des th&#232;mes pr&#233;sents dans le corpus (Perlerin, 2004, p. 141). En pr&#233;sentant &#224; l&#8217;utilisateur
une liste des graphies class&#233;es par ordre d&#233;croissant de fr&#233;quence d&#8217;apparition, le logiciel per-
met une premi&#232;re assistance &#224; l&#8217;extraction de graphies int&#233;ressantes pour l&#8217;utilisateur selon
sa t&#226;che &#224; partir d&#8217;un corpus.
</p>
<p>&#8211; l&#8217;outil ThemeEditor (Beust, 2002) permettant de composer des graphies en lexies et de les
rassembler en th&#232;mes. Ce rassemblement est non exclusif, une lexie pouvant &#234;tre associ&#233;e &#224;
plusieurs th&#232;mes. Les ressources ainsi constitu&#233;es sont projet&#233;es sur le corpus initial par une
annotation XML. Un principe de surlignage avec diff&#233;rentes couleurs (une couleur corres-
pondant &#224; un th&#232;me) permet de mettre en &#233;vidence la r&#233;partition, l&#8217;alternance et les encha&#238;-
nements au long d&#8217;un texte des th&#232;mes ainsi cr&#233;&#233;s.
</p>
<p>Les th&#232;mes construits &#224; l&#8217;aide des logiciels pr&#233;c&#233;dents sont stock&#233;s en machine sous forme de
listes au format XML afin de permettre une facile r&#233;utilisation.
</p>
<p>3.3 Les traitements r&#233;alis&#233;s
</p>
<p>La plateforme ProxiDocs prend en entr&#233;e un fichier XML contenant des th&#232;mes construits par
l&#8217;utilisateur et un corpus de documents &#233;lectroniques au format texte ou HTML8. Les diff&#233;rents
traitements r&#233;alis&#233;s par ProxiDocs sont pr&#233;sent&#233;s en figure 1. Les cartes th&#233;matiques produites
en sortie de l&#8217;application sont repr&#233;sent&#233;es dans le format SVG (W3C, 2001), ceci afin de garan-
</p>
<p>8Dans le cas des documents HTML, seules les parties textuelles sont trait&#233;es. Les informations concernant la
structure du document et les &#233;l&#233;ments qu&#8217;il contient (telles les images) ne sont pas encore prises en consid&#233;ration
dans nos analyses mais pourront l&#8217;&#234;tre dans des prochaines versions de la plate-forme.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plate-forme logicielle d&#233;di&#233;e &#224; la cartographie th&#233;matique de corpus
</p>
<p>tir leur portabilit&#233; sur diff&#233;rents syst&#232;mes et de permettre &#224; l&#8217;utilisateur d&#8217;effectuer facilement
des zooms et des d&#233;placements.
</p>
<p>FIG. 1 &#8211; Cha&#238;ne de traitement de la plate-forme ProxiDocs
</p>
<p>Le premier traitement r&#233;alis&#233; par la plateforme est un comptage des occurrences de lexies de
chaque th&#232;me et de leurs formes fl&#233;chies dans chaque texte. Un vecteur d&#8217;entiers de dimension
&#233;gale au nombre de th&#232;mes choisis et d&#233;finis par l&#8217;utilisateur est alors associ&#233; &#224; chaque texte.
Supposons qu&#8217;un utilisateur fasse intervenir dans la construction de ses cartes th&#233;matiques les
th&#232;mes de la Bourse, de l&#8217;&#201;conomie, de la M&#233;t&#233;o et du Sport, les vecteurs repr&#233;sentant les textes
sont de la forme :
</p>
<p>Vecteur(Texte) = (nb_lexies(Bourse), nb_lexies(&#201;conomie), nb_lexies(M&#233;t&#233;o), nb_lexies(Sport))
Cette m&#233;thode de comptage est appel&#233;e absolue, du fait qu&#8217;elle ne fait pas intervenir la taille des
textes lors du comptage. Une seconde m&#233;thode, appel&#233;e relative, d&#233;termine pour chaque texte
du corpus, les pourcentages des lexies de chaque th&#232;me et de leurs formes fl&#233;chies par rapport
au nombre total de mots du texte. Cette m&#233;thode est particuli&#232;rement int&#233;ressante lorsque la
taille des textes du corpus varie significativement.
</p>
<p>Les vecteurs obtenus &#224; l&#8217;issue de l&#8217;&#233;tape de comptage prennent place dans des espaces de di-
mensions &#233;gales aux nombres de th&#232;mes d&#233;finis par l&#8217;utilisateur9. Pour visualiser ces vecteurs
sur des cartes en 2 ou 3 dimensions, il faut r&#233;aliser une projection de ces vecteurs. Pour cela,
nous proposons plusieurs m&#233;thodes d&#8217;analyse des donn&#233;es dont l&#8217;Analyse en Composante Prin-
cipales (ACP) (Bouroche et Saporta, 1980) et l&#8217;Analyse Factorielle des Correspondances (Ben-
z&#233;cri, 1980). &#192; l&#8217;issue de cette &#233;tape de projection, nous proposons aux utilisateurs des regrou-
</p>
<p>9Dans l&#8217;exemple pr&#233;c&#233;dent, les vecteurs repr&#233;sentant les textes prennent place dans un espace &#224; 4 dimensions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thibault ROY
</p>
<p>pements automatiques des textes sur les cartes. Pour cela, nous avons int&#233;gr&#233; une m&#233;thode de
cat&#233;gorisation, appel&#233;e Cat&#233;gorisation Hi&#233;rarchique Ascendante (Bouroche et Saporta, 1980).
Afin de mettre en &#233;vidence les r&#233;sultats produits par l&#8217;encha&#238;nement de ces diff&#233;rents traite-
ments, nous pr&#233;sentons dans la partie suivante des exemples de cartes th&#233;matiques construites
par ProxiDocs &#224; partir d&#8217;un corpus d&#8217;articles de presse et de th&#232;mes que nous avons d&#233;finis.
Pour plus de d&#233;tails sur ces traitements, nous renvoyons &#224; (Roy et Beust, 2004).
</p>
<p>3.4 Les cartes th&#233;matiques obtenues sur un exemple
</p>
<p>Les cartes pr&#233;sent&#233;es dans cette section ont &#233;t&#233; construites &#224; partir d&#8217;un corpus constitu&#233; de
789 articles de l&#8217;ann&#233;e 1989 du journal &#8220;Le Monde&#8221; totalisant environ 700 000 graphies. Le
jeu de th&#232;mes utilis&#233; est g&#233;n&#233;raliste et propose des descriptions des 18 th&#232;mes suivants : la
justice, la religion, la violence, l&#8217;&#233;ducation, l&#8217;agriculture, la s&#233;curit&#233; routi&#232;re, l&#8217;aviation, la navigation, le
dopage, l&#8217;&#233;conomie, la politique, l&#8217;a&#233;rospatial, la guerre, l&#8217;informatique, la pollution, le sport, la t&#233;l&#233;vision
et le travail . Nous avons construit un tel ensemble de th&#232;mes dans un objectif de d&#233;couverte
des sujets abord&#233;s dans des corpus de textes nous &#233;tant peu connus. Les outils MemLabor et
ThemeEditor ont &#233;t&#233; utilis&#233;s lors de la construction de ces th&#232;mes. La carte pr&#233;sent&#233;e en figure
2 a &#233;t&#233; construite &#224; partir de ces entr&#233;es10.
</p>
<p>FIG. 2 &#8211; Carte th&#233;matique du corpus analys&#233; repr&#233;sentant chaque article par un point. Version
&#233;lectronique : http ://www.info.unicaen.fr/&#8764;troy/proxidocs/cartes_classiques/acp1.html
</p>
<p>Chaque point sur la carte repr&#233;sente un article du corpus analys&#233;. La couleur d&#8217;un point corres-
pond au th&#232;me majoritaire rep&#233;r&#233; dans l&#8217;article repr&#233;sent&#233;11. Chaque point est un hyperlien vers
l&#8217;article repr&#233;sent&#233;. Les zones 1, 2 et 3 ont &#233;t&#233; marqu&#233;es manuellement sur la carte afin d&#8217;en fa-
ciliter l&#8217;analyse. La plupart des articles de la zone 1 sont de th&#232;me majoritaire Politique et &#233;lection
</p>
<p>10La m&#233;thode de comptage relative et la m&#233;thode de projection de l&#8217;ACP ont &#233;t&#233; utilis&#233;es lors de la construction
des cartes pr&#233;sent&#233;es dans cet article.
</p>
<p>11Une l&#233;gende de couleurs est disponible sur la droite de la carte, l&#8217;association d&#8217;une couleur &#224; un th&#232;me est
r&#233;alis&#233;e par l&#8217;utilisateur lors de la construction des th&#232;mes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plate-forme logicielle d&#233;di&#233;e &#224; la cartographie th&#233;matique de corpus
</p>
<p>alors que la zone 2 contient plus particuli&#232;rement des articles de th&#232;me majoritaire &#201;conomie et
commerce. La zone 3, pr&#233;sente en haut et &#224; droite de la carte, contient un petit nombre d&#8217;articles
de th&#232;me majoritaire Guerre.
&#192; partir de la carte pr&#233;c&#233;dente, nous avons choisi d&#8217;aider l&#8217;utilisateur dans son analyse en appli-
quant une m&#233;thode de cat&#233;gorisation automatique sur les textes de la carte. La carte pr&#233;sent&#233;e
en figure 3 met en &#233;vidence les r&#233;sultats de cette cat&#233;gorisation12. Chaque groupe de textes est
repr&#233;sent&#233; sur la carte par un disque de taille proportionnelle &#224; sa cardinalit&#233;. Chaque disque est
centr&#233; sur le centre de gravit&#233; de l&#8217;ensemble des points repr&#233;sentant les documents du groupe. La
couleur attribu&#233;e &#224; ce disque correspond au th&#232;me majoritaire rep&#233;r&#233; dans les textes du groupe.
Chaque disque est un hyperlien vers le texte repr&#233;sentatif du groupe, c&#8217;est-&#224;-dire le texte &#233;tant
le plus proche de son centre de gravit&#233;. Sur cette carte, chaque groupe est caract&#233;ris&#233; par les
cinq lexies des th&#232;mes les plus fr&#233;quentes au sein des textes du groupe.
</p>
<p>FIG. 3 &#8211; Carte th&#233;matique mettant en &#233;vidence des groupes d&#8217;articles. Version &#233;lectronique :
http ://www.info.unicaen.fr/&#8764;troy/proxidocs/cartes_categorisation/carte_avec_groupes.htm
</p>
<p>La couleur, la taille et la disposition des groupes sur la carte donnent une id&#233;e sur les th&#232;mes
abord&#233;s dans les textes du corpus ainsi que sur leur r&#233;partition. En visualisant les textes repr&#233;-
sentatifs des groupes, l&#8217;utilisateur peut avoir une id&#233;e plus pr&#233;cise des th&#232;mes abord&#233;s dans les
textes de chaque groupe. Ainsi, les textes repr&#233;sentatifs des groupes 1 et 2 (groupes marqu&#233;s
manuellement sur la carte, tout comme le groupe 3), traitent respectivement du rachat des parts
boursi&#232;res d&#8217;une grande entreprise et des enjeux des futures &#233;lections europ&#233;ennes. Il est alors
possible de d&#233;duire que les th&#232;mes abord&#233;s dans ces articles se retrouvent dans les autres textes
de leurs groupes respectifs.
</p>
<p>Les lexies caract&#233;risant les groupes de textes sur la carte peuvent &#233;galement aider l&#8217;utilisa-
teur dans l&#8217;appr&#233;hension des th&#232;mes abord&#233;s au sein des groupes. Les cartes &#233;tant interactives,
lorsque l&#8217;utilisateur passe avec sa souris sur l&#8217;une de ces lexies, celle-ci ainsi que les lexies
</p>
<p>12Le nombre de groupes empiriquement choisi dans cet exemple est de 20.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thibault ROY
</p>
<p>identiques caract&#233;risant les autres groupes se colorient en rouge. Cette op&#233;ration permet ainsi
d&#8217;observer des lexies communes &#224; plusieurs groupes ou bien des lexies ne caract&#233;risant qu&#8217;un
seul groupe. Nous pouvons ainsi observer que la lexie politique est commune aux groupes 1, 2 et
3. Par contre, si nous souhaitons diff&#233;rencier ces trois groupes les uns des autres, nous pouvons
remarquer que le groupe 3 est le seul &#224; poss&#233;der la lexie guerre, le groupe 2 est le seul &#224; poss&#233;der
la lexie parti et le groupe 1 est le seul &#224; poss&#233;der les lexies march&#233;, travail et banque.
</p>
<p>Afin d&#8217;offrir &#224; l&#8217;utilisateur une vision encore plus pr&#233;cise et dynamique de son corpus, nous pro-
posons de tenir compte du temps dans la construction de ses cartes. Pour cela, nous construisons
des cartes th&#233;matiques &#224; partir du corpus et des th&#232;mes choisis par l&#8217;utilisateur sur diff&#233;rentes
p&#233;riodes13. Une carte dynamique proposant un encha&#238;nement automatique de ces cartes peut
alors mettre en &#233;vidence l&#8217;&#233;volution des th&#232;mes abord&#233;s dans les articles du corpus au fil du
temps. A partir du corpus et des th&#232;mes consid&#233;r&#233;s pr&#233;c&#233;demment, une carte dynamique a pu
&#234;tre construite, des extraits de cette carte sur deux p&#233;riodes sont pr&#233;sent&#233;s en figure 4.
</p>
<p>FIG. 4 &#8211; Extraits de la carte dynamique globale du corpus. Version &#233;lectronique :
http ://www.info.unicaen.fr/&#8764;troy/proxidocs/cartes_temps/carte_dyn_1.html
</p>
<p>L&#8217;extrait situ&#233; sur la partie gauche de la figure met en &#233;vidence des groupes d&#8217;articles dont la
date de publication est comprise entre le 28 janvier et le 27 f&#233;vrier 1989. L&#8217;extrait de droite
repr&#233;sente des groupes d&#8217;articles publi&#233;s entre le 28 f&#233;vrier et le 27 mars. Pour des raisons
de lisibilit&#233;, la l&#233;gende de couleurs, identique &#224; celles des cartes des figures 2 et 3, n&#8217;est pas
rappel&#233;e. Pour ces m&#234;mes raisons, certains groupes sont marqu&#233;s manuellement sur les extraits.
</p>
<p>L&#8217;extrait de gauche met en &#233;vidence deux importants groupes d&#8217;articles de th&#232;mes majoritaires
Politique et &#233;lection et &#201;conomie et commerce (groupes 1 et 2, contenant respectivement 28 et
24 articles). Sur la partie en bas et &#224; gauche, un groupe de th&#232;me majoritaire Education est
&#233;galement pr&#233;sent (groupe 3). Ce groupe se situe &#224; proximit&#233; de groupes de th&#232;mes majoritaires
&#201;conomie et commerce et Politique et &#233;lection (groupes 1, 4, 5 et 6), ce qui laisse penser que les
articles contenus dans ce groupe abordent d&#8217;une certaine mani&#232;re ces deux th&#232;mes. Cette id&#233;e
se confirme en visualisant le texte repr&#233;sentatif du groupe 3, ce dernier abordant des r&#233;formes
budg&#233;taires du gouvernement sur le syst&#232;me &#233;ducatif. La partie de l&#8217;extrait situ&#233;e au-dessus de
l&#8217;axe des abscisses met en &#233;vidence des groupes de petite taille (contenant 1 ou 2 articles). En
</p>
<p>13Dans l&#8217;exemple pr&#233;sent&#233; ici, nous nous sommes bas&#233;s sur la date de publication des articles.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plate-forme logicielle d&#233;di&#233;e &#224; la cartographie th&#233;matique de corpus
</p>
<p>visualisant les articles repr&#233;sentatifs de ces groupes, nous pouvons remarquer qu&#8217;ils abordent
des sujets d&#8217;actualit&#233; tr&#232;s ponctuels, tels un crash d&#8217;avion et des actes terroristes.
L&#8217;extrait de droite met toujours en &#233;vidence un important groupe de th&#232;me majoritaire &#201;conomie
et commerce (groupe A, contenant 22 articles). En visualisant la carte dynamique globale du
corpus, nous pouvons remarquer qu&#8217;un tel groupe est pr&#233;sent tout au long de la p&#233;riode &#233;tudi&#233;e,
ce qui peut laisser penser que le th&#232;me de l&#8217;&#233;conomie est constamment abord&#233; dans les articles
du corpus analys&#233;. Au-dessus du groupe A se situe un groupe de th&#232;me majoritaire Automobile et
circulation routi&#232;re (groupe B). La grande majorit&#233; des articles de ce groupe traitent des ventes de
voitures en France. Nous pouvons &#233;galement remarquer la pr&#233;sence de petits groupes (contenant
1 ou 2 articles) de th&#232;mes majoritaires T&#233;l&#233;vision et cin&#233;ma (groupes C et D) et Violence (Groupe
E). Les articles repr&#233;sentatifs de ces groupes traitent de sujets d&#8217;actualit&#233; ponctuels li&#233;s &#224; la
disparition d&#8217;un grand producteur de cin&#233;ma (groupes C et D) et au d&#233;c&#232;s d&#8217;un jeune boxeur
lors d&#8217;un combat (groupe E).
La figure 4 comment&#233;e pr&#233;c&#233;demment pr&#233;sente deux extraits de la carte dynamique globale re-
tourn&#233;e &#224; l&#8217;utilisateur. Cette carte globale permet entre autres de visualiser les th&#232;mes constam-
ment abord&#233;s dans les articles du corpus tout au long de la p&#233;riode &#233;tudi&#233;e, mais aussi d&#8217;observer
des th&#232;mes li&#233;s &#224; l&#8217;actualit&#233; abord&#233;s de fa&#231;on plus ponctuels dans les textes.
</p>
<p>D&#8217;autres possibilit&#233;s, non d&#233;taill&#233;es dans cet article, sont &#233;galement offertes par la plate-forme,
telle la possibilit&#233; de construire des cartes th&#233;matiques en 3 dimensions14.
</p>
<p>4 Conclusions et perspectives
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; les principes de fonctionnement de la plate-forme logi-
cielle ProxiDocs d&#233;di&#233;e &#224; la cartographie th&#233;matique de corpus de textes. Nous avons illustr&#233;
les int&#233;r&#234;ts de cette plateforme sur un exemple pr&#233;cis : la d&#233;couverte des th&#232;mes abord&#233;s dans un
corpus d&#8217;articles d&#8217;un grand quotidien fran&#231;ais. Les diff&#233;rentes cartes construites permettent de
mettre en &#233;vidence les principaux sujets abord&#233;s dans les textes de cet ensemble, d&#8217;observer des
groupes de textes abordant des th&#232;mes proches et de visualiser l&#8217;&#233;volution des sujets abord&#233;s
dans ces articles au fil du temps.
</p>
<p>Plusieurs am&#233;liorations de la plate-forme ProxiDocs sont actuellement envisag&#233;es. D&#8217;un point
de vue th&#233;orique, nous souhaitons int&#233;grer un mod&#232;le de repr&#233;sentation des th&#232;mes beaucoup
plus fin que celui utilis&#233; jusqu&#8217;&#224; pr&#233;sent (d&#233;passant les simples listes de lexies). Le mod&#232;le
de repr&#233;sentation lexicale envisag&#233; (intitul&#233; LUCIA) est exp&#233;riment&#233; depuis plusieurs ann&#233;es
au sein de notre &#233;quipe (Nicolle et al., 2002; Perlerin, 2004). L&#8217;int&#233;gration de ce mod&#232;le &#224;
notre plate-forme permettrait &#224; l&#8217;utilisateur de pr&#233;ciser et de structurer les lexies relevant des
th&#233;matiques de son choix en pr&#233;cisant, pour chacune d&#8217;elles, les significations qu&#8217;ils jugent
pertinentes et appropri&#233;es &#224; la t&#226;che qu&#8217;il vise. Les cartes ainsi produites devraient r&#233;v&#233;ler des
informations plus pr&#233;cises sur le corpus analys&#233; et surtout plus en rapport avec le point de vue
de l&#8217;utilisateur ou du groupe d&#8217;utilisateurs destinataires des cartes.
</p>
<p>D&#8217;un point de vue applicatif, nous avons commenc&#233; le d&#233;veloppement de deux composants :
&#8211; le m&#233;tamoteur de recherche ProxiDocs Web interrogeant des moteurs de recherche g&#233;n&#233;ra-
</p>
<p>listes (tels Google, Yahoo, etc.) &#224; partir de mots-cl&#233;s saisis par l&#8217;utilisateur et retournant les
14Des exemples de cartes en 3 dimensions sont disponibles &#224; l&#8217;adresse : http://www.info.unicaen.fr/~troy/
</p>
<p>proxidocs/cartes_3D</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thibault ROY
</p>
<p>pages propos&#233;s par ces moteurs sous la forme de cartes th&#233;matiques construites &#224; partir de
th&#232;mes choisis et d&#233;finis par l&#8217;utilisateur ;
</p>
<p>&#8211; et l&#8217;outil ProxiDocs Mail r&#233;alisant la cartographie dynamique d&#8217;un flux de courriers &#233;lectro-
niques selon des th&#232;mes choisis et d&#233;finis par l&#8217;utilisateur.
</p>
<p>Ces deux outils devraient nous permettre de traiter d&#8217;autres types de corpus et ainsi proposer de
nouveaux services aux utilisateurs.
</p>
<p>Afin de mettre en &#233;vidence les int&#233;r&#234;ts et les limites de notre plate-forme, une exp&#233;rimenta-
tion avec un grand nombre d&#8217;utilisateurs nous semble incontournable. Cette exp&#233;rimentation,
et surtout son &#233;valuation, n&#8217;est pas sans poser probl&#232;mes car il n&#8217;est pas question ici de juger
(par exemple, en terme de rappel et de pr&#233;cision) si la plate-forme produit des r&#233;sultats cor-
rects ou non, mais plut&#244;t d&#8217;&#233;valuer la fa&#231;on dont les utilisateurs s&#8217;approprient l&#8217;outil chacun
&#224; leur fa&#231;on selon leurs buts. Ce n&#8217;est donc pas simplement le logiciel qu&#8217;il faut &#233;valuer mais
le couple outil-utilisateur. &#192; travers une telle exp&#233;rimentation, de nouveaux besoins devraient
&#233;merger, ceci nous persuadant &#224; toujours mieux instrumentaliser la dimension intertextuelle de
la s&#233;mantique des langues.
</p>
<p>R&#233;f&#233;rences
Benz&#233;cri J.P. (1980), L&#8217;analyse des donn&#233;es - tome 2 : l&#8217;analyse des correspondances, &#201;ditions Bordas.
Beust P. (2002), Un outil de coloriage de corpus pour la repr&#233;sentation de th&#232;mes, Actes des 6&#232;mes
Journ&#233;es internationales de l&#8217;Analyse statistique de Donn&#233;es Textuelles.
Bouroche J.M. et Saporta G. (1980) L&#8217;analyse des donn&#233;es, Collection Que sais-je ?, PUF.
Chung W., Chen H. et Numaker J.F.Jr. (2002) Business Intelligence Explorer : A Knowledge Map Fra-
mework for Discovering Business Intelligence on the Web, Actes de la 36&#232;me HICSS.
Lelu A. et Aubin S. (2001) Vers un environnement complet de synth&#232;se statistique de contenus textuels,
Pr&#233;sentation au s&#233;minaire Association pour la mesure des sciences et des techniques du 13/11/2001.
Mokrane A., Arezki R., Dray G. et Poncelet P. (2004) Cartographie automatique du contenu d&#8217;un corpus
de documents textuels, Actes des 7&#232;mes Journ&#233;es internationales de l&#8217;Analyse statistique de Donn&#233;es
Textuelles, pages 816-823.
Nicolle A. (1996), L&#8217;exp&#233;rimentation et l&#8217;intelligence artificielle, Intellectica, num&#233;ro 22, pages 9-19,
Association pour la Recherche Cognitive (ARC).
Nicolle A., Beust P. et Perlerin V. (2002), Un analogue de la m&#233;moire pour un agent logiciel interactif,
In Cognito, num&#233;ro 21, pages 37-66.
Perlerin V. (2002), MemLabor, un environnement de cr&#233;ation, de gestion et de manipulation de corpus
de textes, Actes de TALN / RECITAL 2002, pages 507 &#224; 516.
Perlerin V. (2004), S&#233;mantique l&#233;g&#232;re pour le document : assistance personnalis&#233;e pour l&#8217;acc&#232;s au do-
cument et l&#8217;exploration de son contenu, Th&#232;se d&#8217;informatique de l&#8217;Universit&#233; de Caen.
Pichon R. et S&#233;billot P. (1999), Diff&#233;rencier les sens des mots &#224; l&#8217;aide du th&#232;me et du contexte de leurs
occurrences : une exp&#233;rience, Actes de TALN 1999, pages 279-288.
Roy T. et Beust P. (2004), ProxiDocs, un outil de cartographie et de cat&#233;gorisation th&#233;matique de corpus,
Actes des 7&#232;mes Journ&#233;es internationales de l&#8217;Analyse statistique de Donn&#233;es Textuelles, pages 978-987.
Spinat E. (2002), Pourquoi int&#233;grer des outils de cartographie au sein des syst&#232;mes d&#8217;information de
l&#8217;entreprise ?, Colloque Cartographie de l&#8217;Information, Paris.
Thlivitis T. (1998), S&#233;mantique interpr&#233;tative intertextuelle : assistance anthropocentr&#233;e &#224; la compr&#233;-
hension des textes, Th&#232;se d&#8217;informatique de l&#8217;Universit&#233; de Rennes I.
W3C (2001), Scalable Vector Graphics (SVG), http://www.w3.org/TR/SVG/.</p>

</div></div>
</body></html>