<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse informatique du roman proustien &quot;Du cot&#233; de chez Swann&quot;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>1 
</p>
<p>Analyse informatique du roman proustien &#171; Du c&#244;t&#233; de chez 
</p>
<p>Swann &#187; 
 
</p>
<p>Katia ZELLAGUI 
Laboratoire le LASELDI &#8211; Universit&#233; de Franche-Comt&#233; 
</p>
<p>30 Rue M&#233;gevand - 25000 Besan&#231;on (France) 
katia.zellagui@univ-fcomte.fr 
</p>
<p> 
</p>
<p>Mots-clefs &#8211; Keywords:  
Automate fini, grammaire locale, dictionnaire &#233;lectronique, &#233;tiquetage morpho-syntaxique, 
d&#233;sambigu&#239;sation, textes litt&#233;raires. 
Finite state automata, local grammar, electronic dictionary, morpho-syntactic tagging, 
disambiguation, literary texts. 
 
R&#233;sum&#233; - Abstract 
Dans le cadre du d&#233;veloppement des environnements d&#8217;analyse linguistique, d&#8217;&#233;tiquetage de 
corpus et d&#8217;analyse statistique afin de traiter des corpus de grande taille, nous proposons de 
mettre au point des proc&#233;dures nouvelles d&#8217;&#233;tiquetage morpho-syntaxique et s&#233;mantique. Nous 
pr&#233;sentons un ensemble de ressources linguistiques - dictionnaires et grammaires - dans le but 
d&#8217;&#233;tiqueter enti&#232;rement le roman proustien : &#171; Du c&#244;t&#233; de chez Swann &#187;. Notre recherche 
avance deux atouts majeurs : la pr&#233;cision des &#233;tiquettes attribu&#233;es aux formes linguistiques du 
texte ; et le rep&#233;rage et &#233;tiquetage exhaustifs des mots compos&#233;s. 
To deal with a great amount of corpus data within the framework of environmental 
development of linguistic analysis of corpus' tagging and statistic analysis, we propose to 
establish new procedures of syntactic and semantic tagging. We present some general linguistic 
resources, such as dictionary and grammar built-in the way to entirely tag the novel of Proust 
&#171;Du c&#244;t&#233; de chez Swann&#187;. Our research leads to two main advantages: precise tagging assigned 
to linguistic forms of the text and identification and exhaustive tagging of compound nouns. 
</p>
<p>Introduction 
Face &#224; l&#8217;expansion des ressources &#233;lectroniques (e-book, sites Internet, CD-Rom), de plus en 
plus de donn&#233;es textuelles sont disponibles sur support &#233;lectronique. Cette expansion implique 
in&#233;vitablement le d&#233;veloppement des outils d&#8217;analyse de textes : que ce soit des analyseurs ou 
des logiciels d&#8217;&#233;tiquetage (e.g. Brill, Cordial, Lexico, Hyperbase, INTEX), et oblige les 
chercheurs en linguistique informatique &#224; repenser la gestion et l&#8217;organisation des donn&#233;es 
textuelles (e.g. Text Encoding Initiative). Le probl&#232;me des textes sur support &#233;lectronique 
actuellement disponibles est qu&#8217;ils ne sont pas d&#233;crits suffisamment d&#8217;un point de vue lexical, 
syntaxique et s&#233;mantique. Dans le cadre de nos recherches, nous proposons de fournir aux 
chercheurs en litt&#233;rature et en linguistique des proc&#233;d&#233;s sp&#233;cifiques d&#8217;&#233;tiquetage lexical et 
syntaxique de corpus litt&#233;raires, &#224; partir desquels il sera possible de r&#233;aliser (&#224; court terme) des 
analyses linguistiques et litt&#233;raires fines et de construire (&#224; long terme) des hypertextes d&#8217;un 
nouveau type : les liens seront &#233;tablis entre les unit&#233;s linguistiques (plut&#244;t qu&#8217;entre les formes 
superficielles). 
 
</p>
<p>1 Cadre th&#233;orique 
Notre d&#233;marche s&#8217;inspire en grande partie des travaux du LADL et plus sp&#233;cifiquement des 
travaux men&#233;s par Maurice Gross (1975) sur le lexique- grammaire. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse informatique du roman proustien : &#171; Du c&#244;t&#233; de chez Swann &#187; 
</p>
<p> 2 
</p>
<p>L&#8217;&#233;quipe qui s&#8217;int&#233;resse essentiellement au traitement automatique et &#224; la description &#224; large 
couverture des langues naturelles constitue depuis les ann&#233;es 60 une base de donn&#233;es de 
descriptions linguistiques tr&#232;s importante sous la forme principalement de dictionnaires 
&#233;lectroniques - les DELA (Courtois, 1990) - et de grammaires locales (Gross, 1997).  
Notre objectif est d&#8217;&#233;laborer des ressources linguistiques afin de r&#233;aliser de fa&#231;on automatique 
voire semi-automatique l&#8217;&#233;tiquetage du roman proustien &#171; Du c&#244;t&#233; de chez Swann &#187;1. 
L&#8217;&#233;tiquetage consiste &#224; &#171; associer &#224; des segments de texte, le plus souvent les &#8216;mots&#8217;, une ou 
plusieurs &#233;tiquettes, le plus souvent leur cat&#233;gorie grammaticale voire leur lemme. &#187; (Habert &amp; 
al., 1997). L&#8217;&#233;tiquetage que nous proposons de r&#233;aliser sera syst&#233;matique (toutes les formes du 
texte doivent avoir au minimum une &#233;tiquette lexicale et syntaxique. Une telle entreprise 
rencontre deux obstacles majeurs : le choix des unit&#233;s linguistiques &#224; traiter et le choix des 
outils d&#8217;&#233;tiquetage. Or, une des conditions sine qua non d&#8217;un &#233;tiquetage visant un taux d&#8217;erreur 
proche de z&#233;ro r&#233;side dans le rep&#233;rage exhaustif et l&#8217;&#233;tiquetage des mots compos&#233;s d&#232;s les 
premi&#232;res phases du traitement du corpus. Nous avons donc besoin d&#8217;un outil capable d&#8217;une 
part, de traiter les mots compos&#233;s ; et d&#8217;autre part, d&#8217;un outil permettant de cr&#233;er rapidement et 
facilement des r&#232;gles de grammaires. Notre choix s&#8217;est donc port&#233; sur le syst&#232;me INTEX 
(Silberztein, 1993). Cet outil utilise les vastes bases de donn&#233;es de descriptions linguistiques 
fines d&#233;velopp&#233;es au LADL et permet de d&#233;velopper des ressources linguistiques (dictionnaires 
et grammaires locales), puis de les appliquer au corpus. Apr&#232;s avoir pr&#233;sent&#233; les probl&#233;matiques 
li&#233;es &#224; une telle entreprise, nous tenterons de proposer des solutions en d&#233;crivant les ressources 
que nous avons cr&#233;&#233;es afin d&#8217;&#233;tiqueter le corpus Swann.  
 
</p>
<p>2  Unit&#233;s linguistiques et ambigu&#239;t&#233;s 
</p>
<p>2.1 - Les unit&#233;s linguistiques 
</p>
<p>Nous choisissons de traiter deux types d&#8217;unit&#233;s linguistiques : les mots simples (ou formes 
simples) et les mots compos&#233;s (ou formes compos&#233;es). 
En ce qui concerne la d&#233;finition d&#8217;une forme simple, nous partons d&#8217;une d&#233;finition formelle que 
nous empruntons &#224; Courtois (1990). Les formes simples sont : &#171; [&#8230;] des unit&#233;s de texte d&#233;finies 
sur l&#8217;alphabet des codes ASCII ou EBCDIC &#224; 256 caract&#232;res, et ne comportant aucun 
s&#233;parateur. &#187;  Les lettres (&#233;l&#233;ments de base) appartiennent &#224; un alphabet d&#233;termin&#233; (e.g. 
l&#8217;alphabet fran&#231;ais comprend 41 lettres). 
Il n&#8217;existe pas de d&#233;finition pr&#233;cise et admise de la composition. Gross (1988) annonce 
clairement qu&#8217;il est inutile car impossible de proposer une d&#233;finition unique et stable du mot 
compos&#233;. Il propose d&#8217;appr&#233;hender cette notion par le biais de contraintes linguistiques. Sa 
d&#233;marche consiste &#171; &#224; montrer que le figement n&#8217;est pas une valeur absolue mais rel&#232;ve d&#8217;une 
gradation correspondante &#224; des propri&#233;t&#233;s transformationnelles potentielles r&#233;alis&#233;es &#224; des 
degr&#233;s diff&#233;rents &#187;. Il propose donc de calculer le degr&#233; de figement en terme de propri&#233;t&#233;s non 
observ&#233;es (Gaston, 1986). Les listes des mots compos&#233;s &#233;labor&#233;es en grande partie &#224; partir de 
ces contraintes par les chercheurs du LADL et du LLI2 ont servi &#224; l&#8217;&#233;laboration du dictionnaires 
&#233;lectroniques des mots compos&#233;s : le DELAC.  
La reconnaissance des mots compos&#233;s (au m&#234;me titre que les mots simples) est n&#233;cessaire pour 
deux raisons principales :  
 1. ils forment une unit&#233; linguistique &#224; part enti&#232;re, e.g. parce que, pomme de terre ; 
 2. ils peuvent g&#233;n&#233;rer des erreurs lors de l&#8217;&#233;tiquetage s&#8217;ils ne sont pas reconnus.  
 
</p>
<p>                                                
1 Le texte sur support &#233;lectronique (issu de la reconnaissance optique) a &#233;t&#233; fourni par les &#233;ditions Champions 
(Paris). Nous le nommons corpus Swann. 
2 LLI : Laboratoire de Linguistique Informatique, Paris 13. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Katia Zellagui 
</p>
<p> 3 
 
</p>
<p>2.2  Les ambigu&#239;t&#233;s 
</p>
<p>La notion d'ambigu&#239;t&#233; est fondamentale car elle pose des probl&#232;mes majeurs dans l'analyse de 
texte. Certaines unit&#233;s de la langue (mots simples ou mots compos&#233;s) sont effectivement 
ambigu&#235;s et poss&#232;dent plusieurs &#233;tiquettes morpho-lexicales et syntaxiques dans les ressources 
d&#8217;INTEX, ce qui n&#233;cessite un travail de d&#233;sambigu&#239;sation. Par exemple, la forme simple la 
poss&#232;de trois entr&#233;es dans le DELAF :  la, la.N+z1:ms:mp : la est un nom ;  la, le.DET+z1:fs : 
la est un d&#233;terminant; la, le.PRO+z1:3fs : la est un pronom. 
L&#8217;ambigu&#239;t&#233; que nous venons de d&#233;crire rel&#232;ve de la syntaxe. Il existe effectivement six grands 
types d&#8217;ambigu&#239;t&#233;s : les ambigu&#239;t&#233;s orthographiques, morpho-flexionnelles, morpho-
d&#233;rivationnelles, syntaxiques, s&#233;mantiques, et les ambigu&#239;t&#233;s pragmatiques (Fuchs, 1996). 
Dans le cadre de notre recherche, nous traiterons deux types d&#8217;ambigu&#239;t&#233;s : 
 1. les ambigu&#239;t&#233;s syntaxiques qui se situent au niveau de la structure des &#233;nonc&#233;s; 
 2. les ambigu&#239;t&#233;s morpho-flexionnelles qui se situent au niveau de la flexion des formes 
verbales, e.g. j&#8217;aime / il aime (le verbe aimer est conjugu&#233; &#224; la 1&#232;re et 3&#232;me personne du singulier 
du pr&#233;sent de l&#8217;indicatif ou du pr&#233;sent du subjonctif) ;  
Une simple exploration des contextes gauche-droite de la forme suffit souvent &#224; lever 
l&#8217;ambigu&#239;t&#233; (les grammaires locales sont alors tr&#232;s efficaces). Mais certaines formes ne peuvent 
&#234;tre d&#233;sambigu&#239;s&#233;es qu&#8217;en tenant compte du contexte syntaxique ou s&#233;mantique global, au 
niveau de la phrase ou m&#234;me du discours (e.g. table ronde). 
 
</p>
<p>3  Les outils informatiques pour l&#8217;&#233;tiquetage  
 
Nous allons &#224; pr&#233;sent d&#233;crire les outils utilis&#233;s pour le traitement automatique et linguistique du 
corpus : les dictionnaires &#233;lectroniques et les grammaires locales. 
INTEX dispose de ressources lexicales. Pour le fran&#231;ais, il s&#8217;agit des dictionnaires &#233;lectroniques 
du LADL. Les deux dictionnaires principaux du syst&#232;me INTEX sont : le DELAF [dictionnaire 
des mots simples g&#233;n&#233;r&#233; automatiquement &#224; partir du DELAS (Courtois, 1990)] et le DELACF 
[dictionnaire des mots compos&#233;s g&#233;n&#233;r&#233; semi-automatiquement &#224; partir du  DELACF 
(Silberztein, 1989)]. Ces ressources (une fois appliqu&#233;es au corpus) permettent d&#8217;obtenir le 
vocabulaire complet du texte. Les ambigu&#239;t&#233;s sont alors rep&#233;rables (i.e. une forme ambigu&#235; 
poss&#232;de plusieurs entr&#233;es dans le dictionnaire). 
Les grammaires locales s&#8217;av&#232;rent &#234;tre des outils tr&#232;s efficaces afin de g&#233;rer les ambigu&#239;t&#233;s non 
r&#233;solues par consultation des dictionnaires. Elles se pr&#233;sentent sous forme d&#8217;automates. Dans le 
processus d&#8217;&#233;tiquetage, nous utiliserons des grammaires locales de d&#233;sambigu&#239;sation sous 
forme de transducteurs. Les transducteurs diff&#232;rent des automates dans la mesure o&#249; ils 
produisent en plus de l&#8217;information &#171; les transitions sont &#233;tiquet&#233;es par des couples de symbole 
(Sr/Sp), o&#249; Sr est un symbole reconnu, et Sp un symbole produit. &#187; (Silberztein, 1993).  
 
</p>
<p>4  L&#8217;&#233;tiquetage du texte 
 
La phase &#233;tiquetage se d&#233;roule en trois &#233;tapes successives : le pr&#233;-traitement du texte brut, 
l&#8217;&#233;tiquetage des formes compos&#233;es et l&#8217;&#233;tiquetage des formes simples. 
</p>
<p>4.1 Pr&#233;-traitement  
</p>
<p>Avant la phase d&#8217;&#233;tiquetage, il faut r&#233;aliser l&#8217;&#233;tape dite de pr&#233;-traitement. Sous INTEX, cette 
&#233;tape consiste d&#8217;une part &#224; segmenter le texte en phrases, ce qui passe par l&#8217;application d&#8217;une 
grammaire locale qui traite les ambigu&#239;t&#233;s li&#233;es au point (signe de ponctuation forte ou signe 
d&#8217;abr&#233;viation) et qui ins&#232;re le symbole {S} apr&#232;s chaque fin de phrase ; et d&#8217;autre part, &#224; 
reconna&#238;tre et &#233;tiqueter les mots compos&#233;s non ambigus : e.g. parce que, aujourd&#8217;hui (par le 
biais du dictionnaire Ucompound.dic int&#233;gr&#233; au syst&#232;me INTEX). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse informatique du roman proustien : &#171; Du c&#244;t&#233; de chez Swann &#187; 
</p>
<p> 4 
</p>
<p>Il s&#8217;agit ensuite d&#8217;appliquer les dictionnaires du syst&#232;me : le DELAF qui contient 746 214 
entr&#233;es, et le DELACF qui compte 248 885 entr&#233;es. Une fois cette op&#233;ration r&#233;alis&#233;e, INTEX 
fournit deux listes qui correspondent au vocabulaire du texte : la liste des mots simples (47 592 
entr&#233;es), et la liste des mots compos&#233;s (3 408 entr&#233;es). Il est alors possible de proc&#233;der &#224; la 
phase d&#8217;&#233;tiquetage, ce qui revient &#224; g&#233;rer les ambigu&#239;t&#233;s du texte. L&#8217;&#233;tape de d&#233;sambigu&#239;sation 
se d&#233;roule en deux temps : le traitement des formes compos&#233;es puis celui des formes simples. 
</p>
<p>4.2  Traitement des formes compos&#233;es  
</p>
<p>Le DLC contient donc 3 408 entr&#233;es, ce qui repr&#233;sente environ 7 240 mots compos&#233;s dans le 
texte. Le probl&#232;me majeur du traitement des mots compos&#233;s r&#233;side dans le fait que certaines 
s&#233;quences reconnues par une consultation de dictionnaire sont en fait des s&#233;quences libres de 
mots simples (ex. bien que). C&#8217;est pourquoi INTEX traite tous les mots compos&#233;s comme a 
priori ambigus. La d&#233;sambigu&#239;sation des mots compos&#233;s ne peut &#234;tre r&#233;alis&#233;e que par une 
analyse manuelle du contexte de leurs occurrences. En effet, une s&#233;quence peut &#234;tre fig&#233;e dans 
un certain contexte, et ne pas l&#8217;&#234;tre dans un autre (e.g. Je me rappelle bien que je n&#8217;ai pas 
dormi ; cela lui ferait plus de bien que son lit ; [&#8230;] il le disait bien que cela ne se fasse pas !).  
Nous utilisons un programme interactif de convivialit&#233; d&#8217;&#233;tiquetage : DIATAG3 afin de 
proc&#233;der &#224; la lev&#233;e d&#8217;ambigu&#239;t&#233; des mots compos&#233;s en contexte. DIATAG (int&#233;gr&#233; au syst&#232;me 
INTEX) pr&#233;sente la forme avec son contexte (gauche et droite) et la ou les &#233;tiquettes 
candidates. &#192; partir de l&#8217;observation directe, l&#8217;utilisateur peut alors valider la bonne &#233;tiquette 
qui sera int&#233;gr&#233;e directement dans le texte. 
Les s&#233;quences non valid&#233;es seront ensuite trait&#233;es comme des s&#233;quences de mots simples. 
&#192; l&#8217;issue de cette op&#233;ration, le DLC ne contient plus que 3 382 entr&#233;es et le texte poss&#232;de 6 580 
mots compos&#233;s. 
</p>
<p>4.3 Traitement des formes simples  
</p>
<p>Une fois les formes compos&#233;es &#233;tiquet&#233;es, il s&#8217;agit alors de traiter les formes simples. Ce 
traitement est entrepris en deux phases successives : 
 1. le traitement du plus grand nombre d&#8217;ambigu&#239;t&#233;s est r&#233;alis&#233; avec INTEX. La biblioth&#232;que 
de grammaires locales de lev&#233;e d&#8217;ambigu&#239;t&#233; contient deux types de grammaires : les 
grammaires locales dites g&#233;n&#233;rales applicables &#224; n&#8217;importe quel texte de la langue fran&#231;aise, et 
les grammaires locales dites ad hoc (i.e. grammaires sp&#233;cifiques qui ne fonctionnent que sur le 
corpus Swann). La biblioth&#232;que (dans son &#233;tat actuel) contient une cinquantaine de grammaires 
locales. Ces grammaires locales pr&#233;sent&#233;es sous forme de transducteurs fonctionnent par 
reconnaissance d&#8217;information et production d&#8217;information. Nous pr&#233;sentons deux grammaires 
de d&#233;sambigu&#239;sation. La grammaire locale forme s.grf (cf. Figure 1) fonctionne sur tous les 
textes de la langue fran&#231;aise. 
</p>
<p>s
&lt;N&gt;
</p>
<p>s'
</p>
<p>&lt;CONJS&gt;
</p>
<p>il
ils
</p>
<p>&lt;PRO&gt;
</p>
<p>s'
</p>
<p>&lt;PRO&gt;  
Figure1 : Grammaire locale de d&#233;sambigu&#239;sation : forme s.grf. 
</p>
<p> 
</p>
<p>                                                
3 http://www.nyu.edu/pages/linguistics/intex/#diatag </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Katia Zellagui 
</p>
<p> 5 
 
</p>
<p>Le premier chemin analyse la forme s comme &#233;tant un nom (et impose la contrainte &lt;N&gt; ; la 
forme s&#8217; suivie des pronoms il et ils, est syst&#233;matiquement une conjonction ; dans tous les 
autres cas, le s&#8217; est un pronom. 944 ambigu&#239;t&#233;s sont r&#233;solues en appliquant cette grammaire. 
La grammaire locale je plus V.grf (cf. Figure 2) appartient &#224; l&#8217;ensemble des grammaires locales 
ad hoc. Elle permet de d&#233;sambigu&#239;ser un grand nombre de pronoms (e.g. le, la, nous, lui) et de 
pr&#233;ciser la flexion du verbe. 
</p>
<p>je
&lt;PRO&gt;
</p>
<p>ne
&lt;ADV&gt;
</p>
<p>me
te
nous
vous
&lt;PRO&gt; le
</p>
<p>la
l'
les
&lt;PRO&gt;
</p>
<p>&lt;V:1s&gt;
&lt;V:1s&gt;m'
</p>
<p>t'
l'
lui
leur
nous
vous
&lt;PRO&gt;
</p>
<p>en
y
&lt;PRO&gt;
</p>
<p>n'
&lt;ADV&gt;
</p>
<p>lui
leur
&lt;PRO&gt;
</p>
<p>le
la
les
&lt;PRO&gt;
</p>
<p> 
Figure 2 : Grammaire locale de d&#233;sambigu&#239;sation : je plus verbe.grf. 
</p>
<p> 
Le graphe je plus verbe.grf reconna&#238;t 1 565 occurrences dans le corpus et permet de lever 1 378 
ambigu&#239;t&#233;s, par exemple : {je,.PRO+PpvIL+z1} {me,me.PRO+z1} {suis,&#234;tre.V+aux+z1:P1s} 
{couch&#233;,coucher.V+se+p+i+E+z1:Kms}. 
Les grammaires locales que nous avons construites ont permis de lever plus de 80% des 
ambigu&#239;t&#233;s de fa&#231;on automatique. 
 
 2. Traitement des ambigu&#239;t&#233;s r&#233;siduelles avec DIATAG 
Face &#224; l&#8217;impossibilit&#233; de lever certaines ambigu&#239;t&#233;s de fa&#231;on automatique, nous entreprenons 
une partie de l&#8217;&#233;tiquetage des formes simples de fa&#231;on manuelle &#224; l&#8217;aide du programme 
DIATAG. La d&#233;marche est alors similaire &#224; celle que nous avons suivie pour le traitement des 
formes compos&#233;es. Prenons l&#8217;exemple de la forme que (qui poss&#232;de cinq &#233;tiquettes 
syntaxiques : pronom relatif ou interrogatif, conjonction de subordination, introducteur ou 
adverbe). Compte tenu de la complexit&#233; de certaines phrases proustiennes, l&#8217;&#233;tiquetage de cette 
forme ne peut &#234;tre r&#233;alis&#233; qu&#8217;en se r&#233;f&#233;rant au contexte. Ce type d&#8217;ambigu&#239;t&#233; est donc r&#233;solu au 
cas par cas avec DIATAG. Nous avons eu recours &#224; ce proc&#233;d&#233; essentiellement afin de traiter 
les mots grammaticaux (Dister, 2001). &#192; l&#8217;issue de ce traitement, le DLS ne contient plus que 
16 372 entr&#233;es. 
 
</p>
<p>5  R&#233;sultats  
 
Nous avons d&#233;velopp&#233; un environnement qui a permis de lever plus de 80% des ambigu&#239;t&#233;s du 
texte de fa&#231;on automatique. Ces ressources comprennent des dictionnaires &#233;lectroniques et des 
grammaires locales de lev&#233;es d&#8217;ambigu&#239;t&#233;4. Le vocabulaire final du texte contient 164 060 mots 
</p>
<p>                                                
4 Les grammaires locales de d&#233;sambigu&#239;sation sont disponibles sur le site INTEX. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse informatique du roman proustien : &#171; Du c&#244;t&#233; de chez Swann &#187; 
</p>
<p> 6 
</p>
<p>simples et 6 580 mots compos&#233;s. Afin de r&#233;duire les erreurs d&#8217;&#233;tiquetage, nous concevons une 
cha&#238;ne de traitements incluant des proc&#233;dures de contr&#244;le qualit&#233; (permettant de d&#233;tecter le 
maximum d&#8217;erreurs). La qualit&#233; de l&#8217;&#233;tiquetage est ensuite &#233;valu&#233;e en comparant le corpus 
&#233;tiquet&#233; avec la version &#233;tiquet&#233;e propos&#233;e par FRANTEXT5. Notre objectif &#233;tant d&#8217;&#233;valuer la 
qualit&#233; de l&#8217;&#233;tiquetage, nous pr&#233;cisons que nous comparons dans ce cas pr&#233;cis les r&#233;sultats en 
ayant conscience du fait que les m&#233;thodes d&#8217;&#233;tiquetage sont diff&#233;rentes. Nous s&#233;lectionnons de 
fa&#231;on al&#233;atoire 10 paragraphes d&#8217;environ 200 mots chacun. Nous relevons dans la version 
FRANTEXT plusieurs erreurs dues essentiellement au fait que les mots compos&#233;s n&#8217;aient pas 
&#233;t&#233; reconnus (&#171; cette/DTN:sg femme/SUB:sg que/SUB$ j'/PRV:sg avais/ACJ:sg quitt&#233;e/VPAR:sg '/' 
il/PRV:sg y/PRV:++ avait/ACJ:sg quelques/DTN:pl moments/SUB :pl &#224;/PREP peine/SUB:sg ;/; &#187;6) 
Un objectif futur serait d&#8217;appliquer ces ressources et notre m&#233;thodologie &#224; un corpus plus 
cons&#233;quent ; nous pensons bien entendu &#224; la totalit&#233; de La Recherche. En s&#8217;appuyant sur 
l&#8217;exp&#233;rience que nous avons acquise au cours de ce projet, nous pensons qu&#8217;un travail 
d&#8217;&#233;tiquetage de l&#8217;ensemble de La Recherche pourrait &#234;tre effectu&#233; par un chercheur en quelques 
mois. 
 
</p>
<p>R&#233;f&#233;rences 
 
COURTOIS B. (1990), &#171; Un syst&#232;me de dictionnaires &#233;lectroniques pour les mots simples du 
fran&#231;ais &#187;, In Dictionnaires &#233;lectroniques du fran&#231;ais, &#201;ditions Blandine Courtois et Max 
Silberztein, Langue Fran&#231;aise, n&#176;87, Paris : Larousse, pp. 11-22. 
DISTER A. (2001), &#171; Lev&#233;e d&#8217;ambigu&#239;t&#233; sur les mots lexicaux et grammaticaux &#187;, fascicule 
sp&#233;cial, In Description et lev&#233;e des ambigu&#239;t&#233;s, &#201;ditions &#201;ric Laporte, Linguisticae 
Investigationes, Amsterdam/Philadelphia, John Benjamins, pp. 105-126. 
FUCHS C. (1996), Les ambigu&#239;t&#233;s du fran&#231;ais, Collection l&#8217;Essentiel Fran&#231;ais.  
GROSS G. (1988), &#171; Degr&#233; de figement dans les noms compos&#233;s &#187;, In Les locutions fig&#233;es, 
&#201;ditions Laurence Danlos, Langages, n&#176; 90, Paris : Larousse, pp. 57-72.  
GROSS G. (1990), &#171; D&#233;finition des noms compos&#233;s dans un lexique-grammaire &#187;, In 
Dictionnaires &#233;lectroniques du fran&#231;ais, &#201;ditions Blandine Courtois et Max Silberztein, Langue 
Fran&#231;aise, n&#176; 87, Paris: Larousse, pp. 84-90. 
GROSS Gaston (1996), Les expressions fig&#233;es en fran&#231;ais : noms compos&#233;s et autres locutions, 
Paris : Ophrys. 
GROSS M. (1975), M&#233;thodes en syntaxe. Paris : Hermann.  
GROSS M. (1997), &#171;The construction of local grammars &#187;, In Finite-State Language Processing, 
E. Roche and Y. Schabes (eds.), Cambridge, Mass/London, England:MIT Press, pp. 329-354. 
GROSS M. (2001), &#171; Les ambigu&#239;t&#233;s &#187;, In Description et lev&#233;e des ambigu&#239;t&#233;s, &#201;ditions &#201;ric 
Laporte, Linguisticae Investigationes, vol. 24, fascicule 1, John Benjamins Publishing 
Company, pp. 3-41. 
HABERT B., NAZARENKO A., SALEM A. (1997), Les linguistiques de corpus. Collection U 
Linguistique. Paris : Armand Colin/Masson. 
SILBERZTEIN M. (1990), &#171; Le dictionnaire &#233;lectronique des noms compos&#233;s &#187;, In Dictionnaires 
&#233;lectroniques du fran&#231;ais, &#201;ditions Blandine Courtois et Max Silberztein, Langue Fran&#231;aise, n&#176; 
87, Paris: Larousse, pp. 71-84. 
SILBERZTEIN M. (1993), Dictionnaires &#233;lectroniques et analyses automatiques de textes : le 
syst&#232;me INTEX, Paris : Masson. 
</p>
<p>                                                
5 Version &#233;tiquet&#233;e par Josette Lecomte &#224; l&#8217;INaLF &#8211; mars 2002. 
6 Nous avons soulign&#233; les erreurs d&#8217;&#233;tiquetage. </p>

</div></div>
</body></html>