<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Syst&#232;me AlALeR - Alignement au niveau phrastique des textes parall&#232;les fran&#231;ais-japonais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Syst&#232;me AlALeR
Alignement au niveau phrastique des textes parall&#232;les fran&#231;ais-japonais
</p>
<p>Yayoi NAKAMURA-DELLOYE
Universit&#233; Paris 7 (&#201;cole Doctorale de Sciences du Langage) - Lattice
</p>
<p>30 Rue du Ch&#226;teau des Rentiers 75013 Paris, http://www.linguist.jussieu.fr
1 rue Maurice Arnoux 92120 Montrouge, http://www.lattice.cnrs.fr
</p>
<p>yayoi@free.fr
Date de soutenance pr&#233;vue : 2006
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Alignement, corpus parall&#232;les, analyse morphologique japonaise partielle, m&#233;moire de traduc-
tion
Alignment, parallel corpora, partial japanese morphological analysis, translation memory
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>&#12354;&#12425;&#12428;&#12304;a&#1;a&#1;e&#12305;n.
1. Perle de glace. 2. Petit biscuit de 
</p>
<p>riz. 3. inform. AlALeR (syst&#232;me 
</p>
<p>d'Alignement Autonome, L&#233;ger et 
</p>
<p>Robuste) Aligneur adapt&#233; au 
</p>
<p>traitement du japonais caract&#233;ris&#233; par 
</p>
<p>l'absence  d'utilisation d'analyseur 
</p>
<p>morphologique et de dictionnaire.
</p>
<p>Le pr&#233;sent article d&#233;crit le Syst&#232;me AlALeR (Syst&#232;me d&#8217;Alignement
Autonome, L&#233;ger et Robuste). Capable d&#8217;aligner au niveau phrastique
un texte en fran&#231;ais et un texte en japonais, le Syst&#232;me AlALeR ne
recourt cependant &#224; aucun moyen ext&#233;rieur tel qu&#8217;un analyseur mor-
phologique ou des dictionnaires, au contraire des m&#233;thodes existantes.
Il est caract&#233;ris&#233; par son analyse morphologique partielle mettant &#224;
profit des particularit&#233;s du syst&#232;me d&#8217;&#233;criture japonais et par la trans-
cription des mots emprunts, &#224; l&#8217;aide d&#8217;un transducteur.
</p>
<p>The present paper describes the AlALeR System, an Autonomous, Robust and Light Alignment
System. Capable of aligning at the sentence level a French text and a Japanese one, the AlALeR
System doesn&#8217;t use any external tool, such as morphological parsers or dictionaries, contrary
to existing methods. This system is characterized by a partial morphological analysis taking
advantage of some peculiarities of japanese writing system, and by the transcription of loan
words with a transducer.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>1 Introduction
</p>
<p>La plupart des m&#233;thodes d&#8217;alignement au niveau phrastique sont caract&#233;ris&#233;es par leur simplicit&#233;
de r&#233;alisation et de calcul, obtenue gr&#226;ce &#224; l&#8217;utilisation exclusive d&#8217;informations &#171; internes &#187;,
telles que la distribution de cha&#238;nes de caract&#232;res ou la longueur de cha&#238;ne.
</p>
<p>Mais, les syst&#232;mes d&#8217;alignement du japonais int&#232;grent tous aussi bien un analyseur morpholo-
gique que des dictionnaires bilingues pour traiter cette langue tr&#232;s diff&#233;rente des langues telles
que l&#8217;anglais, l&#8217;allemand ou le fran&#231;ais.
</p>
<p>Cependant, l&#8217;alignement &#233;tant une op&#233;ration &#233;l&#233;mentaire constituant souvent une &#233;tape pr&#233;pa-
ratoire pour un autre traitement, un syst&#232;me l&#233;ger est favorable pour le traitement du japonais
&#233;galement. Ainsi, nous avons con&#231;u le syst&#232;me AlALeR adapt&#233; &#224; l&#8217;alignement des textes ja-
ponais, qui ne recourt &#224; aucun moyen ext&#233;rieur, ni dictionnaire ni analyseur morphologique, en
mettant pleinement &#224; profit certaines particularit&#233;s du syst&#232;me d&#8217;&#233;criture du japonais.
Nous pr&#233;sentons dans cet article ce nouveau syst&#232;me d&#8217;alignement du japonais : apr&#232;s un bref
parcours des techniques ant&#233;rieures, nous d&#233;crirons d&#8217;abord le principe de fonctionnement de
ce syst&#232;me avec le d&#233;tail des proc&#233;dures de certaines op&#233;rations, et pr&#233;senterons ensuite les
r&#233;sultats obtenus.
</p>
<p>2 Techniques ant&#233;rieures et Syst&#232;me AlALeR
</p>
<p>Les recherches sur la technique d&#8217;alignement ont d&#233;but&#233; dans le cadre de travaux sur la traduc-
tion automatique. Si bien que les pr&#233;curseurs ont cherch&#233; avant tout la simplicit&#233; de r&#233;alisation
et de calcul, donnant ainsi naissance &#224; des m&#233;thodes caract&#233;ris&#233;es par l&#8217;utilisation exclusive
d&#8217;informations internes telles que la distribution lexicale (KAY &amp; R&#214;SCHEISEN, 1993) ou la
longueur des phrases (BROWN et al., 1991), (GALE &amp; CHURCH, 1993).
Les chercheurs occidentaux ont choisi pour am&#233;liorer la technique, la poursuite de la voie ini-
ti&#233;e par ces pr&#233;curseurs en introduisant de nouvelles notions telles que les cognats ((SIMARD
et al., 1992), (LANGLAIS, 1997) et (KRAIF, 2001)), qui ne font pas appel aux informations
ext&#233;rieures.
</p>
<p>N&#233;anmoins, du fait que le syst&#232;me d&#8217;&#233;criture du japonais ne dispose pas de s&#233;parateur graphique
indiquant les fronti&#232;res entre les mots, les chercheurs japonais ont int&#233;gr&#233; tr&#232;s t&#244;t des analyseurs
morphologiques dans leurs syst&#232;mes d&#8217;alignement (MURAO, 1991). De plus, le japonais est
fortement diff&#233;rent des langues principalement trait&#233;es dans le TAL &#8211; telles que l&#8217;anglais, le
fran&#231;ais ou l&#8217;allemand &#8211; aussi bien sur le plan syntaxique que sur le plan lexical, ce qui n&#8217;a
pas permis une simple application des m&#233;thodes utilis&#233;es pour ces langues au traitement des
textes japonais. Aussi, les Japonais ont-ils &#233;galement d&#251; recourir &#224; des dictionnaires bilingues
et rechercher la performance plut&#244;t que la simplicit&#233; (HARUNO &amp; YAMAZAKI, 1996).
Notre syst&#232;me a r&#233;solu le probl&#232;me de segmentation par une analyse morphologique partielle
bas&#233;e sur une m&#233;thode traditionnelle1 qui profite d&#8217;une particularit&#233; du syst&#232;me d&#8217;&#233;criture du ja-
ponais, poss&#233;dant plusieurs types de caract&#232;res diff&#233;rents. Par ailleurs, la transcription des mots
emprunts, &#224; l&#8217;aide d&#8217;un transducteur, a permis un meilleur alignement des mots sans recourir &#224;
un dictionnaire bilingue.
</p>
<p>1Voir aussi (NAKAMURA-DELLOYE, 2003).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me AlALer
</p>
<p>3 Principe de fonctionnement
</p>
<p>3.1 Sch&#233;ma g&#233;n&#233;ral du Syst&#232;me
</p>
<p>AlaLeR
</p>
<p>c'est le r&#233;sultat.
</p>
<p>OK
</p>
<p>It's the result.
</p>
<p>c'est le r&#233;sultat. It's the result.
</p>
<p>Texte Fr Texte Jp
</p>
<p>Interface graphique
</p>
<p>.txt
</p>
<p>UTF-8
</p>
<p>.txt
</p>
<p>UTF-8
</p>
<p>AlALeR
</p>
<p>Module de
&quot;Post-
</p>
<p>alignement&quot;
</p>
<p>.XML
</p>
<p>R&#233;sultat partiel
</p>
<p>.XML
</p>
<p>R&#233;sultat complet
</p>
<p>Dictionnaires
</p>
<p>Analyseur
</p>
<p>morphologique
</p>
<p>FIG. 1 &#8211; Sch&#233;ma g&#233;n&#233;ral du Syst&#232;me AlALer
</p>
<p>Le syst&#232;me re&#231;oit comme donn&#233;es une paire de textes parall&#232;les r&#233;dig&#233;s en fran&#231;ais et en anglais,
ou plus particuli&#232;rement d&#8217;un texte en fran&#231;ais (ou en anglais) et d&#8217;un en japonais. Afin de
s&#8217;affranchir des probl&#232;mes d&#8217;encodage, fr&#233;quents lorsqu&#8217;il s&#8217;agit de traitements multilingues,
AlALeR pr&#233;suppose comme entr&#233;es des textes bruts au format texte, encod&#233;s en UTF-8.
</p>
<p>Le syst&#232;me peut fournir comme r&#233;sultat soit un alignement partiel tr&#232;s fiable des textes en-
tr&#233;s, soit un alignement complet avec l&#8217;option &#171; complet &#187;. Lorsque cette option est choisie, le
module de &#171; post-alignement &#187; r&#233;alise un appariement des phrases qui n&#8217;ont pas &#233;t&#233; align&#233;es
pendant le processus principal. L&#8217;appariement de ce module est r&#233;alis&#233; selon la probabilit&#233; d&#8217;ali-
gnement de paires de phrases, calcul&#233;e &#224; partir de la corr&#233;lation de leur longueur.
</p>
<p>Les r&#233;sultats sont fournis, soit sous forme de fichier XML, soit par transfert vers l&#8217;interface
graphique. Celle-ci permet non seulement de visualiser le r&#233;sultat sous un format plus agr&#233;able
&#224; lire, mais aussi de faciliter la v&#233;rification et &#233;ventuellement la modification manuelle des
r&#233;sultats fournis par le syst&#232;me2.
</p>
<p>3.2 Proc&#233;dure g&#233;n&#233;rale
</p>
<p>La proc&#233;dure g&#233;n&#233;rale est constitu&#233;e de deux grandes &#233;tapes :
</p>
<p>1. &#201;tape de construction de l&#8217;index du lexique, au cours de laquelle les mots graphiques
sont tri&#233;s pour constituer quatre listes selon leur nature : transfuges, cognats, katakana et
mots lexicaux ;
</p>
<p>2. Proc&#233;dure d&#8217;alignement :
&#8211; &#233;tape de pr&#233;alignement, au cours de laquelle un premier ancrage est r&#233;alis&#233; pour li-
</p>
<p>miter le nombre de possibilit&#233;s d&#8217;alignement, &#224; l&#8217;aide notamment des transfuges et des
cognats ;
</p>
<p>&#8211; proc&#233;dure principale, au cours de laquelle les phrases sont align&#233;es par un calcul de
similarit&#233; de la distribution des mots qu&#8217;elles contiennent. Cette proc&#233;dure est it&#233;rative.
</p>
<p>2Le syst&#232;me est impl&#233;ment&#233; en langage C++ et l&#8217;interface graphique avec les API Apple Carbon.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>Nous allons maintenant pr&#233;senter chaque &#233;tape. &#201;tant donn&#233; que le syst&#232;me fonctionne un peu
diff&#233;remment selon les langues trait&#233;es, nous ne nous pr&#233;occupons ici que du cas d&#8217;un aligne-
ment de textes fran&#231;ais et japonais, afin de mieux montrer la particularit&#233; de notre syst&#232;me.
</p>
<p>3.3 Construction de l&#8217;index du lexique
</p>
<p>Cette &#233;tape est compos&#233;e elle-m&#234;me de quatre &#233;tapes :
&#8211; Construction de la liste des phrases (LPH).
&#8211; Construction de la liste des mots graphiques (LMOT).
&#8211; Cr&#233;ation de quatre listes &#224; la suite du tri des mots graphiques : liste des transfuges (LTRNS),
</p>
<p>liste des cognats (LCOG), liste des mots en katakana (LKTKN) et liste des mots lexicaux
(LEX).
</p>
<p>&#8211; Cr&#233;ation de l&#8217;index des mots lexicaux apr&#232;s leur lemmatisation (ILX).
</p>
<p>3.3.1 Construction de la liste des phrases
</p>
<p>Comme il a d&#233;j&#224; &#233;t&#233; mentionn&#233; dans (SIMARD &amp; PLAMONDON, 1998), la reconnaissance
des phrases repr&#233;sente &#224; elle-seule, malgr&#233; l&#8217;impression de trivialit&#233; que l&#8217;on a g&#233;n&#233;ralement,
une question &#224; part enti&#232;re. La segmentation en phrases de textes fran&#231;ais ou anglais n&#8217;est pas
&#233;vidente &#224; cause du caract&#232;re polys&#233;mique du s&#233;parateur graphique principal de phrase, le point
final. Il est donc n&#233;cessaire de d&#233;finir des r&#232;gles assez d&#233;taill&#233;es permettant de segmenter cor-
rectement les s&#233;quences contenant des abr&#233;viations ou des sigles (&#171; U.S.A &#187;), des s&#233;quences
symboliques (&#171; abc@cdf.fr &#187;) ou encore des nombres d&#233;cimaux (1.5 en anglais).
Le point final japonais est beaucoup moins polys&#233;mique, facilitant ainsi la t&#226;che de d&#233;coupage.
</p>
<p>3.3.2 Extraction des mots graphiques
</p>
<p>Lors de la deuxi&#232;me &#233;tape, consacr&#233;e &#224; la construction de la liste des mots graphiques, la liste
pour le texte fran&#231;ais est construite par extraction des s&#233;quences entour&#233;es de s&#233;parateurs gra-
phiques des mots &#8211; pr&#233;alablement d&#233;finis.
</p>
<p>Pour le texte japonais &#8211; dans lequel il n&#8217;existe pas de s&#233;parateur graphique indiquant les fron-
ti&#232;res entre les mots &#8211;, une &#233;tape lourde de segmentation, r&#233;alis&#233;e g&#233;n&#233;ralement par analyse mor-
phologique, est n&#233;cessaire. Cependant, il est possible de reconna&#238;tre la plupart des mots lexicaux
sans analyse morphologique compl&#232;te, en profitant d&#8217;une particularit&#233; du syst&#232;me d&#8217;&#233;criture du
japonais qui utilise trois types de caract&#232;res diff&#233;rents selon la nature des mots : hiragana, ka-
takana et kanji.
&#8211; hiragana : premier syllabaire japonais souvent utilis&#233; pour repr&#233;senter la partie variable des
</p>
<p>mots variants et les mots grammaticaux ;
&#8211; kanji : id&#233;ogrammes utilis&#233;s pour repr&#233;senter les mots pleins et les radicaux ayant un sens ;
&#8211; katakana : second syllabaire japonais employ&#233; pour la transcription des mots emprunts des
</p>
<p>langues &#233;trang&#232;res (sauf le chinois).
Quoiqu&#8217;il soit impossible de segmenter totalement de mani&#232;re correcte une phrase en mots
uniquement avec cette m&#233;thode, il est possible de reconna&#238;tre la plupart des mots lexicaux en
extrayant les s&#233;quences de kanji ou de katakana.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me AlALer
</p>
<p>La liste ainsi obtenue ne contient n&#233;anmoins pas de mots grammaticaux. Nous supprimons
donc les mots grammaticaux de la liste LMOT du texte fran&#231;ais &#224; l&#8217;aide d&#8217;une liste de mots
grammaticaux pr&#233;alablement d&#233;finie.
</p>
<p>3.3.3 Tri des mots
</p>
<p>Le tri est ensuite r&#233;alis&#233; aussi bien pour la liste LMOT du texte fran&#231;ais que pour celle obte-
nue &#224; partir du texte japonais afin de construire quatre nouvelles listes : la liste des transfuges
(LTRNS), la liste des cognats (LCOG), la liste des mots en katakana (LKTKN) et la liste des mots
lexicaux (LEX).
Pour les mots des trois premi&#232;res listes, leur &#233;quivalence traductionnelle est calculable simple-
ment par leur forme. Qui plus est, le r&#233;sultat de ce calcul est beaucoup plus s&#251;r que le r&#233;sultat
obtenu par la similarit&#233; des distributions.
</p>
<p>Les &#171; cognats &#187;, mots apparent&#233;s, sont des cha&#238;nes de caract&#232;res identiques ou proches graphi-
quement se trouvant dans les lexiques de langues ayant une relation historique plus ou moins
&#233;troite, tels que les paires anglais-fran&#231;ais generation/g&#233;n&#233;ration et error/erreur. La notion de
cognats am&#233;liore de mani&#232;re simple et &#233;conomique les m&#233;thodes statistiques qui n&#8217;utilisent au-
cune information lexicale, encore que son efficacit&#233; soit limit&#233;e aux langues appartenant &#224; une
m&#234;me famille. Cependant, le japonais int&#233;grant &#233;galement dans son syst&#232;me d&#8217;&#233;criture l&#8217;alpha-
bet latin (r&#244;ma-ji), la possibilit&#233; d&#8217;obtention d&#8217;un r&#233;sultat a &#233;t&#233; signal&#233;e tr&#232;s t&#244;t dans (CHURCH
et al., 1993).
Le syst&#232;me AlALeR ne consid&#232;re comme cognats que les cha&#238;nes alphab&#233;tiques totalement
identiques apparaissant dans les deux textes entr&#233;s. Le syst&#232;me constitue d&#8217;abord la liste LCOG
du texte japonais en extrayant les mots &#233;crits en alphabet latin. Ensuite, en se r&#233;f&#233;rant &#224; la liste
japonaise, il construit une liste fran&#231;aise en recherchant les s&#233;quences identiques aux &#233;l&#233;ments
de la liste japonaise.
Les &#171; transfuges &#187; sont des cha&#238;nes invariantes &#224; la traduction telles que les chiffres ou les
symboles, inclus au d&#233;but dans les cognats par les d&#233;finitions du domaine de l&#8217;alignement, et
regroup&#233;s plus tard par (LANG&#201; &amp; GAUSSIER, 1995) pour constituer une nouvelle cat&#233;gorie.
Les listes de transfuges LTRANS sont constitu&#233;es s&#233;par&#233;ment dans les deux langues par simple
extraction des s&#233;quences de symboles ou de chiffres.
</p>
<p>La troisi&#232;me liste contient les mots du texte japonais &#233;crits en katakana. La figure 2 repr&#233;sente
la proc&#233;dure d&#8217;appariement d&#8217;un mot en katakana. Ces transcriptions des mots emprunts sont
retranscrites par le syst&#232;me &#224; l&#8217;aide d&#8217;un transducteur &#8211; que nous avons d&#233;velopp&#233; sp&#233;cifique-
ment &#8211; en une ou &#233;ventuellement en plusieurs formes en alphabet latin. Au cours du tri des mots
fran&#231;ais, si la similarit&#233; entre le mot fran&#231;ais consid&#233;r&#233; et une s&#233;quence de retranscription d&#8217;un
mot en katakana atteint un seuil pr&#233;d&#233;fini, le mot fran&#231;ais est stock&#233; dans la liste LKTKN. Les
mots japonais en katakana qui n&#8217;ont pas trouv&#233; d&#8217;&#233;quivalent une fois le tri des mots fran&#231;ais
termin&#233;, sont stock&#233;s dans la liste des mots lexicaux pour leur laisser &#224; nouveau une chance
d&#8217;&#234;tre finalement align&#233;s par la similarit&#233; de distribution.
</p>
<p>Le calcul de similarit&#233; entre une s&#233;quence retranscrite et un mot fran&#231;ais est proche de la m&#233;-
thode de la sous-cha&#238;ne maximale parall&#232;le utilis&#233;e dans (KRAIF, 2001) pour la reconnaissance
des cognats. Notre formule, adapt&#233;e aux besoins particuliers de la retranscription des katakana,
diff&#232;re de celle de ce dernier par le fait qu&#8217;elle tient compte non seulement de la sous-cha&#238;ne</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>&#12450;&#12501;&#12522;&#12459;
&#12467;&#12531;&#12479;&#12463;&#12488;
</p>
<p>&#12479;&#12452;&#12503;
&#12539;&#12539;&#12539;
&#12539;&#12539;&#12539;
&#12539;&#12539;&#12539;
&#12539;&#12539;&#12539;
</p>
<p>&#12467;&#12531;&#12479;&#12463;&#12488;
kontakuto
</p>
<p>kontacuto
</p>
<p>contakuto
</p>
<p>contacuto
</p>
<p>contact
</p>
<p>&#12467;&#12531;&#12479;&#12463;&#12488;
contact
</p>
<p>Table LKTKN
(japonais)
</p>
<p>Retranscription
</p>
<p>...
</p>
<p>...
</p>
<p>consid&#233;rables
</p>
<p>consommation
</p>
<p>contact
</p>
<p>contre
</p>
<p>contribuer
</p>
<p>...
</p>
<p>...
</p>
<p>...
</p>
<p>Table LMOT
(fran&#231;ais)
</p>
<p>Comparaison
</p>
<p>Calcul de la similarit&#233;
</p>
<p>Appariement
</p>
<p>FIG. 2 &#8211; Appariement des mots en katakana
</p>
<p>maximale parall&#232;le mais aussi des consonnes communes. Le nombre de consonnes communes
est pris en compte pour favoriser les deux cha&#238;nes ayant le plus de caract&#232;res consonantiques
communs plut&#244;t que celles dont les caract&#232;res vocaliques co&#239;ncident le plus.
</p>
<p>Les paires constitu&#233;es de deux mots appartenant &#224; l&#8217;une de ces trois listes constituent ensuite
des listes de paires de mots align&#233;s, appel&#233;es table des &#171; Transfuges align&#233;s &#187; (TRAL), table des
&#171; Cognats align&#233;s &#187; (COGAL) et table des &#171; Katakana align&#233;s &#187; (KTKNAL).
</p>
<p>3.3.4 Lemmatisation
</p>
<p>Lemmatisation des mots fran&#231;ais Nous avons eu recours &#224; la m&#233;thode utilis&#233;e &#224; l&#8217;&#233;tape
morphologique dans (KAY &amp; R&#214;SCHEISEN, 1993). Elle consiste &#224; trouver les sous-cha&#238;nes
pr&#233;fixales ou suffixales communes &#224; plusieurs formes effectives des mots graphiques et &#224; trouver
ensuite leurs radicaux, porteurs de sens. Ce traitement est impl&#233;ment&#233; efficacement gr&#226;ce &#224;
l&#8217;utilisation d&#8217;une structure de donn&#233;es appel&#233;e trie.
</p>
<p>Lemmatisation des mots japonais Apr&#232;s la segmentation par type de caract&#232;re, il subsiste
encore un cas de segmentation &#224; r&#233;aliser : les s&#233;quences de mots compos&#233;s constitu&#233;s de plu-
sieurs substantifs juxtapos&#233;s les uns derri&#232;res les autres. Dans ce type de s&#233;quence, g&#233;n&#233;rale-
ment enti&#232;rement en kanji, la fronti&#232;re entre les deux mots composants n&#8217;est pas marqu&#233;e par
un changement de type de caract&#232;re.
</p>
<p>Il s&#8217;agit donc &#233;galement de la recherche des sous-cha&#238;nes communes &#224; plusieurs formes effec-
tives. Si bien que nous avons adopt&#233; pour le japonais une lemmatisation reposant sur la structure
de donn&#233;es trie.
</p>
<p>La diff&#233;rence dans le cas du japonais est que les parties restantes ne sont pas des suffixes mais
un ou m&#234;me plusieurs autres mots portant eux-m&#234;mes un sens propre. On obtient donc &#224; partir
d&#8217;un mot graphique ab, non pas un lemme a, mais deux lemmes a et b. La figure 3 repr&#233;sente
un exemple d&#8217;arbres v&#233;rifiant des cha&#238;nes pr&#233;fixales et suffixales, cr&#233;&#233;s &#224; partir de sept entr&#233;es.
Elle montre comment segmenter les mots japonais &#224; l&#8217;aide de ces arbres. En r&#233;alisant de mani&#232;re
it&#233;rative cette op&#233;ration, on peut obtenir plus de deux lemmes si la s&#233;quence en contient.
</p>
<p>Nous obtenons ainsi l&#8217;ensemble des donn&#233;es n&#233;cessaires &#224; la mise en correspondance des mots
permettant d&#8217;associer ensuite les phrases &#224; aligner.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me AlALer
</p>
<p>&#19990;
</p>
<p>&#20013;
</p>
<p>&#21205;
</p>
<p>#
</p>
<p>&#19990;
</p>
<p>&#30028;
</p>
<p>&#39135;
</p>
<p>&#31975;
</p>
<p>&#39135;
</p>
<p>&#31975;
</p>
<p>&#35336;
</p>
<p>&#30011;
</p>
<p>&#25588;
</p>
<p>&#21161;
</p>
<p>&#34892;
</p>
<p>&#35336;
</p>
<p>&#30011;
</p>
<p>&#20379;
</p>
<p>&#32102;
</p>
<p>&#19981;
</p>
<p>&#36275;
</p>
<p>#
</p>
<p>&#30011;
</p>
<p>&#35336;
</p>
<p>&#21205;
</p>
<p>&#34892; &#39135;
</p>
<p>&#30028;
</p>
<p>&#31975;
</p>
<p>&#25588;
</p>
<p>&#21161;
</p>
<p>&#19990;
</p>
<p>&#30028;
</p>
<p>&#20013;
</p>
<p>&#24613;
</p>
<p>&#32202;
</p>
<p>&#32202;
</p>
<p>&#24613;
</p>
<p>&#25588;
</p>
<p>&#21161;
</p>
<p>&#32102;
</p>
<p>&#20379;&#19981;
</p>
<p>&#36275;
</p>
<p>&#39135;
</p>
<p>&#31975;
</p>
<p>&#39135;&#26009;&#20379;&#32102;
&#39135;&#26009;&#19981;&#36275;
</p>
<p>&#39135;&#26009;&#65291;&#20379;&#32102;
&#39135;&#26009;&#65291;&#19981;&#36275;
</p>
<p>&#39135;&#26009;
&#20379;&#32102;
&#19981;&#36275;
</p>
<p>&#39135;
</p>
<p>&#31975;
</p>
<p>&#25588;&#21161;
&#32202;&#24613;&#25588;&#21161;
</p>
<p>&#25588;&#21161;
&#32202;&#24613;&#65291;&#25588;&#21161;
</p>
<p>&#25588;&#21161;
&#32202;&#24613;
</p>
<p>FIG. 3 &#8211; Arbres v&#233;rifiant des cha&#238;nes pr&#233;fixales (&#224; gauche) et suffixales (&#224; droite)
</p>
<p>3.4 Proc&#233;dure d&#8217;alignement
</p>
<p>Notre syst&#232;me utilise une technique bas&#233;e sur les informations des distributions lexicales, pr&#233;-
sent&#233;e par (KAY &amp; R&#214;SCHEISEN, 1993). Cette m&#233;thode, reposant sur l&#8217;hypoth&#232;se que les
phrases correspondantes comprennent des &#233;l&#233;ments correspondants, est constitu&#233;e d&#8217;un appa-
riement grossier des mots, qui permet ensuite l&#8217;alignement des phrases contenant les mots ap-
pari&#233;s.
</p>
<p>Les deux textes sont repr&#233;sent&#233;s par une matrice dont les lignes correspondent &#224; chacune des
phrases du texte fran&#231;ais et les colonnes &#224; celles du texte japonais. L&#8217;&#233;tape d&#8217;alignement est
pr&#233;c&#233;d&#233;e par le pr&#233;alignement et compos&#233;e de trois op&#233;rations correspondant chacune &#224; la
construction d&#8217;une structure de donn&#233;es particuli&#232;re : la table &#171; Candidats des paires de phrases
&#224; aligner &#187; (CPR), la table &#171; Mots align&#233;s &#187; (MAL) et la table &#171; R&#233;sultat d&#8217;alignement &#187; (RAL).
</p>
<p>3.4.1 Pr&#233;alignement
</p>
<p>Le pr&#233;alignement consiste &#224; trouver des ancrages s&#251;rs permettant de r&#233;duire la zone de re-
cherche. Le pr&#233;alignement de notre syst&#232;me, inspir&#233; de la m&#233;thode propos&#233;e dans (KRAIF,
2001), est r&#233;alis&#233; &#224; l&#8217;aide des tables TRAL, COGAL et KTKNAL. Il se fait via deux parcours de
ces tables.
</p>
<p>3.4.2 Table &#171; Candidats des paires de phrases &#224; aligner &#187;
</p>
<p>La table CPR est une matrice indiquant les paires de phrases susceptibles d&#8217;&#234;tre align&#233;es. Bas&#233;e
sur l&#8217;hypoth&#232;se de diagonalit&#233; de l&#8217;alignement, la zone constitu&#233;e des cases correspondant aux
paires candidates forme une ellipse avec pour axe principal la diagonale de la matrice.
</p>
<p>3.4.3 Table &#171; Mots align&#233;s &#187;
</p>
<p>La table MAL contient l&#8217;ensemble des paires de mots suppos&#233;s &#234;tre traductions l&#8217;un de l&#8217;autre.
</p>
<p>L&#8217;appariement des mots est r&#233;alis&#233; selon la similarit&#233; de la distribution de chaque mot. Tous
les mots appartenant &#224; un m&#234;me candidat paire de phrases sont compar&#233;s, et leur est attribu&#233;e</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>une similarit&#233; bas&#233;e sur leur distribution. De nombreuses formules ont &#233;t&#233; propos&#233;es jusqu&#8217;au-
jourd&#8217;hui pour le calcul de cette similarit&#233; de distribution lexicale. Notre m&#233;thode est inspir&#233;e
de l&#8217;am&#233;lioration par (KITAMURA &amp; MATSUMOTO, 1997) du coefficient de Dice : en plus
de la diff&#233;rence de fr&#233;quences, elle tient &#233;galement compte de la fr&#233;quence elle-m&#234;me, donn&#233;e
contr&#244;l&#233;e s&#233;par&#233;ment dans les algorithmes ant&#233;rieurs. La nouveaut&#233; apport&#233;e par notre formule
est la prise en compte du nombre de phrases o&#249; les mots consid&#233;r&#233;s apparaissent. Cette modifi-
cation am&#233;liore les r&#233;sultats lorsque deux paires ont une similarit&#233; identique, situation entra&#238;nant
des conflits avec les m&#233;thodes pr&#233;c&#233;dentes.
</p>
<p>3.4.4 Table &#171; R&#233;sultat d&#8217;alignement &#187; et module de post-alignement
</p>
<p>La table RAL contient l&#8217;ensemble des paires de phrases suppos&#233;es &#234;tre traductions l&#8217;une de
l&#8217;autre.
</p>
<p>L&#8217;appariement des phrases utilise la table MAL obtenue pr&#233;c&#233;demment, en plus des tables TRAL,
COGAL et KTKNAL, pour calculer combien de couples de mots de ces tables contient chaque
paire de phrases appartenant &#224; la CPR. Si une paire de phrases comporte plus de paires de mots
align&#233;s que le seuil d&#233;fini &#8211; en fonction de la taille du texte &#8211;, ces phrases sont consid&#233;r&#233;es
comme correspondantes traductionnelles. Ces nouvelles paires servant de nouvelles ancres, on
cr&#233;e une nouvelle CPR pour r&#233;aliser de mani&#232;re it&#233;rative ces op&#233;rations d&#8217;alignement.
</p>
<p>Ce premier r&#233;sultat partiel peut &#234;tre compl&#233;t&#233; par une proc&#233;dure de post-alignement. Le module
de post-alignement extrait les sous-matrices constitu&#233;es des phrases non align&#233;es par le noyau
AlALeR et calcule la probabilit&#233; d&#8217;alignement de toutes les paires possibles de phrases. Il
r&#233;alise ensuite l&#8217;appariement de ces phrases avec une m&#233;thode de programmation dynamique,
de mani&#232;re &#224; mettre en relation toutes les phrases avec au moins une phrase de l&#8217;autre texte.
</p>
<p>4 R&#233;sultat
</p>
<p>Nous avons test&#233; les performances de notre syst&#232;me (sur PowerMac G5) avec cinq textes pa-
rall&#232;les fran&#231;ais-japonais et deux anglais-japonais : deux articles de Label France3 (d&#233;sign&#233;s
ci-apr&#232;s &#171; Bio &#187; et &#171; FIV &#187;), un texte du sommet G8 (&#171; G8 &#187;), How to Unicode (&#171; Unicode &#187;4),
un texte de l&#8217;EU (&#171; EUJP &#187;) et deux &#339;uvres litt&#233;raires (un extrait de Zadig de Voltaire (&#171; Za-
dig &#187;) et Balthasar (&#171; Balth &#187;) d&#8217;Anatole France).
Pour chaque texte, nous avons analys&#233; deux r&#233;sultats : le r&#233;sultat partiel sans op&#233;ration de post-
alignement (noyau AlALeR) et le r&#233;sultat complet obtenu gr&#226;ce au post-alignement.
</p>
<p>Bio FIV G8 Unicode Zadig EUJP Balth
Lang Fr Jp Fr Jp Fr Jp Fr Jp Fr Jp Ang Jp Ang Jp
Phr 69 75 54 52 53 47 274 268 1206 1376 252 238 321 423
M/C 1418 3615 1176 2597 1398 3077 4224 14155 17912 43426 3881 14308 4835 11491
</p>
<p>TAB. 1 &#8211; Caract&#233;ristiques des textes
</p>
<p>3Magazine du Minist&#232;re des affaires &#233;trang&#232;res
4Sites internet : (VF) http://www.freenix.fr/unix/linux/HOWTO/Unicode-HOWTO.html ;
</p>
<p>(VJ) http://www.linux.or.jp/JF/JFdocs/Unicode-HOWTO.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Syst&#232;me AlALer
</p>
<p>Mod&#232;les de traduction partiel complet
0-1 1-0 1-1 1-2 1-3 1-4+ 2-1 2-2 2-3 2-4+ 3-1 3-2 4+ -1 rap pr&#233; pr&#233;
</p>
<p>Bio 0 0 55 7 1 0 3 0 0 0 0 0 0 0.81 1 0,98
FIV 0 0 43 3 0 0 2 0 0 0 0 0 1 0,66 1 0,92
G8 0 0 38 1 0 0 7 0 0 0 0 0 0 0,95 1 0,98
</p>
<p>Unicode 1 0 195 22 1 0 19 2 0 0 1 1 1 0,90 0,99 0,96
Zadig 7 5 773 188 29 3 69 9 6 1 10 0 2 0,34 0,97 0,78
EUJP 0 4 208 5 1 0 17 0 0 0 0 0 0 0,87 0,98 0,92
Balth 1 2 185 68 16 4 9 13 1 0 0 0 0 0,49 0,97 0,86
</p>
<p>TAB. 2 &#8211; Mod&#232;les de traduction et r&#233;sultats : rappel et pr&#233;cision
</p>
<p>Le tableau 1 montre les nombres de phrases et de mots (textes fran&#231;ais) ou de caract&#232;res (textes
japonais) de chaque texte.
Le tableau 2 pr&#233;sente la r&#233;partition par mod&#232;le de traduction de chaque paire de textes. La
colonne 1-1 montre le nombre de paires en relation traductionnelle, constitu&#233;es d&#8217;une phrase du
premier texte (fran&#231;ais ou anglais) et d&#8217;une du second texte (japonais), la colonne 1-2 le nombre
de paires constitu&#233;es d&#8217;une phrase du texte 1 et de deux phrases du texte 2, et ainsi de suite.
</p>
<p>Le tableau 2 pr&#233;sente &#233;galement le r&#233;sultat d&#8217;alignement avec les taux de pr&#233;cision et de rappel,
dans le cas du r&#233;sultat partiel5.
</p>
<p>On peut d&#233;duire de l&#8217;analyse de ce tableau que le syst&#232;me supporte bien les mod&#232;les complexes
&#8211; i.e. les mod&#232;les constitu&#233;s de plus d&#8217;une phrase, tels que 1-3 &#8211;, qui perturbaient les syst&#232;mes
d&#8217;alignement bas&#233;s sur des m&#233;thodes probabilistes uniquement, au point de fausser tous les ali-
gnements effectu&#233;s apr&#232;s l&#8217;analyse d&#8217;un mod&#232;le complexe. Cette robustesse est due au r&#233;sultat
partiel extr&#234;mement pr&#233;cis, qui sert d&#8217;ancrage fiable pour le post-alignement plus robuste. Le
point faible de cette m&#233;thode par rapport aux m&#233;thodes probabilistes est, comme d&#233;j&#224; critiqu&#233;
par plusieurs auteurs, son utilisation importante de m&#233;moire.
</p>
<p>Par ailleurs, le taux de rappel tr&#232;s bas de certains textes est d&#251; non seulement &#224; la pr&#233;sence
faible voire l&#8217;absence de cognats ou de transfuges, mais aussi &#224; la pr&#233;sence importante des mots
de fr&#233;quence faible, notamment 1. C&#8217;est justement un autre point faible des m&#233;thodes bas&#233;es
sur la similarit&#233; de distribution. Afin de compenser cet inconv&#233;nient, notre syst&#232;me adopte un
appariement final bas&#233; sur la corr&#233;lation des longueurs.
</p>
<p>5 Conclusion et perspectives des travaux futurs
</p>
<p>Les r&#233;sultats d&#8217;alignement fournis par notre syst&#232;me AlALeR ont montr&#233; la possibilit&#233; de
conception d&#8217;un aligneur traitant les textes japonais qui ne recourt &#224; aucun dictionnaire ni analy-
seur morphologique. Ce r&#233;sultat est d&#8217;abord d&#251; &#224; la strat&#233;gie d&#8217;appariement des mots japonais en
katakana. Ceux-ci &#233;tant tr&#232;s nombreux dans les textes traduits, la retranscription de mots japo-
nais en katakana pour trouver leur mot d&#8217;origine a &#233;t&#233; d&#8217;autant plus efficace qu&#8217;ils sont souvent
absents des dictionnaires. En effet, ce sont tr&#232;s souvent des n&#233;ologismes ou des noms propres.
Cette strat&#233;gie s&#8217;est montr&#233;e extr&#234;mement robuste, ce que nous n&#8217;aurions pas pu constater si
</p>
<p>5Le taux de rappel repr&#233;sente la proportion de phrases appari&#233;es avec au moins une phrase de l&#8217;autre texte et
le taux de pr&#233;cision, la proportion parmi ces phrases appari&#233;es de celles l&#8217;&#233;tant correctement, avec au moins une
phrase de l&#8217;autre texte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yayoi NAKAMURA-DELLOYE
</p>
<p>nous avions d&#233;pendu d&#8217;un dictionnaire.
</p>
<p>Nous avons &#233;galement test&#233; le syst&#232;me avec quelques traductions de brevets techniques et nous
avons obtenu de tr&#232;s bons r&#233;sultats gr&#226;ce &#224; la pr&#233;sence tr&#232;s importante de transfuges. N&#233;an-
moins, les phrases de ce type de document sont si longues que l&#8217;alignement au niveau phras-
tique ressemble plut&#244;t &#224; un alignement de paragraphes. Comme Simard le fait remarquer dans
(SIMARD, 2003), l&#8217;alignement &#224; un niveau sous-phrastique est plus b&#233;n&#233;fique que celui r&#233;alis&#233;
au niveau phrastique, notamment en vue de la constitution de m&#233;moires de traduction. Nous
allons d&#233;sormais nous attacher &#224; r&#233;aliser un alignement de propositions, qui permettra tr&#232;s cer-
tainement de fournir une base de donn&#233;es plus int&#233;ressante, aussi bien pour la conception des
m&#233;moires de traduction que pour l&#8217;&#233;tude des linguistiques contrastives.
</p>
<p>R&#233;f&#233;rences
BROWN P. F., LAI J. C. &amp; MERCER R. L. (1991). Aligning sentences in parallel corpora. In
Proceedings of the 29th Annual Meeting of the Association for Computational Linguistics, p. 169 &#8211; 176.
CHURCH K., DAGAN I., GALE W., FUNG P. &amp; J. HELFMAN B. S. (1993). Aligning parallel
texts : do methodes developed for english-french generalize to asian languages ? In Proceedings of the
Pascific Asia Conference on Formal and Computational Linguistics.
GALE W. A. &amp; CHURCH K. W. (1993). A program for aligning sentences in bilingual corpora.
Computational Linguistics, 19(3), 75&#8211;102.
HARUNO M. &amp; YAMAZAKI T. (1996). Bilingual text alignment using statistical and dictionary
information. IPSJ SIG Notes, NL 112(4), 23&#8211;30. en japonais.
KAY M. &amp; R&#214;SCHEISEN M. (1993). Text-translation alignment. Computational Linguistics, 19(1),
121&#8211;142.
KITAMURA M. &amp; MATSUMOTO Y. (1997). Automatic extraction of translation patterns in parallel
corpora. IPSJ Journal, 38(4), 727&#8211; 736. en japonais.
KRAIF O. (2001). Exploitation des cognats dans les syst&#232;mes d&#8217;alignement bi-textuel : architecture et
&#233;valuation. TAL, 42(3).
LANG&#201; J.-M. &amp; GAUSSIER E. (1995). Alignement de corpus multilingues au niveau des phrases.
TAL, 36(1&#8211;2).
LANGLAIS P. (1997). Alignement de corpus bilingues : int&#233;r&#234;t, algorithmes et &#233;valuation. In Bulletin
de Linguistique Appliqu&#233;e et G&#233;n&#233;rale, num&#233;ro Hors S&#233;rie, p. 245&#8211;254. Universit&#233; de Franche-Comt&#233;.
MURAO H. (1991). Studies on bilingual text alignment. Bachelor thesis, Kyoto University. en japo-
nais.
NAKAMURA-DELLOYE Y. (2003). Analyse syntaxique du japonais. M&#233;moire de D.E.A., Institut
National des Langues et Civilisations Orientales.
SIMARD M. (2003). M&#233;moire de traduction sous-phrastique. Th&#232;se de doctorat en informatique,
Universit&#233; de Montr&#233;al.
SIMARD M., FOSTER G. &amp; ISABALLE P. (1992). Using cognates to align sentences in bilingual
corpora. In Proceedings of the Fourth International Conference on Thoretical and Methodological Issues
in Machine Translation (TMI), p. 67 &#8211;81.
SIMARD M. &amp; PLAMONDON P. (1998). Bilingual sentence alignment : Balancing robustness and
accuracy. Machine Translation, 13(1), 59&#8211;80.</p>

</div></div>
</body></html>