<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traduction des r&#232;gles de construction des mots pour r&#233;soudre l'incompl&#233;tude lexicale en traduction automatique - Etude de cas</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Traduction de r&#232;gles de construction des mots pour r&#233;soudre les 
probl&#232;mes d&#8217;incompl&#233;tude lexicale en traduction automatique 
</p>
<p>&#201;tude de cas 
</p>
<p>Bruno Cartoni 
</p>
<p>TIM/ISSCO &#8211; ETI &#8211; Universit&#233; de Gen&#232;ve 
</p>
<p>40 bd du Pont-d&#8217;Arve, CH-1205 Gen&#232;ve 
</p>
<p>bruno.cartoni@eti.unige.ch 
</p>
<p>Mots-clefs &#8211; Keywords 
</p>
<p>Traduction automatique, morphologie constructionnelle, incompl&#233;tude lexicale 
</p>
<p>Machine Translation, constructional morphology, lexical incompleteness 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Cet article propose d&#8217;exploiter les similitudes constructionnelles de deux langues 
</p>
<p>morphologiquement proches (le fran&#231;ais et l&#8217;italien), pour cr&#233;er des r&#232;gles de construction des 
</p>
<p>mots capables de d&#233;construire un n&#233;ologisme construit de la langue source et g&#233;n&#233;rer de 
</p>
<p>mani&#232;re similaire un n&#233;ologisme construit dans la langue cible. Nous commen&#231;ons par 
</p>
<p>pr&#233;senter diverses motivations &#224; cette m&#233;thode, puis d&#233;taillons une exp&#233;rience pour laquelle 
</p>
<p>plusieurs r&#232;gles de transfert ont &#233;t&#233; cr&#233;&#233;es et appliqu&#233;es &#224; un ensemble de n&#233;ologismes 
</p>
<p>construits. 
</p>
<p>This paper presents a method which aims at exploiting constructional similarities between 
</p>
<p>two morphologically-related languages (French an Italian), in order to create word-
</p>
<p>construction rules that can disassemble a constructed neologism and create in a similar way a 
</p>
<p>constructed neologism into the target language. We present the main motivation for this 
</p>
<p>method and describe an experiment for which transfer rules has been developed and applied 
</p>
<p>to a group of constructed neologism. 
</p>
<p>1 Introduction 
</p>
<p>Le pr&#233;sent article s&#8217;inscrit dans un travail de recherche qui vise &#224; exploiter les propri&#233;t&#233;s 
</p>
<p>constructionnelles des mots n&#233;ologiques construits pour r&#233;soudre l&#8217;incompl&#233;tude lexicale en 
</p>
<p>traduction automatique (ci-apr&#232;s TA). Nous entendons exploiter ces propri&#233;t&#233;s &#224; la fois pour 
</p>
<p>l&#8217;analyse des mots inconnus et pour la g&#233;n&#233;ration d&#8217;une traduction possible de ces mots. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>Cependant, une telle exploitation doit se faire au travers de moyens simples pour garantir la 
</p>
<p>&#171; portabilit&#233; &#187; et une certaine efficacit&#233; indispensables &#224; un tel syst&#232;me. 
</p>
<p>Deux hypoth&#232;ses guident ce travail : premi&#232;rement, nous &#233;mettons l&#8217;id&#233;e que les 
</p>
<p>constructions des n&#233;ologismes sont suffisamment transparentes et peu ambigu&#235;s pour &#234;tre 
</p>
<p>analys&#233;es par des moyens simples n&#233;cessitant peu de ressources. Deuxi&#232;mement, nous 
</p>
<p>pensons que les processus morphologiques sont suffisamment proches d&#8217;une langue &#224; l&#8217;autre 
</p>
<p>(du moins dans des langues de m&#234;me famille) pour permettre d&#8217;envisager la traduction d&#8217;un 
</p>
<p>processus de construction par un autre. Pour ce faire, nous proposons l&#8217;utilisation de r&#232;gles 
</p>
<p>bilingues de construction des mots. Leur &#233;laboration n&#233;cessite l&#8217;&#233;tude approfondie des 
</p>
<p>processus morphologiques &#224; traiter. Dans cette optique, nous d&#233;crivons ci-apr&#232;s les 
</p>
<p>diff&#233;rentes motivations qui sous-tendent cette approche (section 2), puis nous proposons un 
</p>
<p>mod&#232;le de traitement des mots construits inconnus, que nous appliquons ensuite &#224; une 
</p>
<p>exp&#233;rience (section 3) dans laquelle nous mettons au point un ensemble de r&#232;gles bilingues de 
</p>
<p>construction des mots exploitables en TA. 
</p>
<p>2 Motivation 
</p>
<p>2.1 Les lexiques informatis&#233;s et la n&#233;ologie formelle 
</p>
<p>De nombreuses applications de TAL reposent sur un lexique qui contient les mots de la 
</p>
<p>langue trait&#233;e (ou un sous-ensemble de ces mots), ainsi que certaines informations associ&#233;es &#224; 
</p>
<p>ces mots (Sproat, 1992). La couverture et la qualit&#233; du lexique d&#233;pendent de l&#8217;application 
</p>
<p>pour laquelle le lexique est &#233;labor&#233; (Arnold, et al., 1994). Or, l&#8217;absence d&#8217;un mot dans le 
lexique cause un certain nombre de probl&#232;mes, notamment en TA (Gdaniec, et al., 2001). Les 
concepteurs de syst&#232;me de TA recourent alors &#224; diff&#233;rentes strat&#233;gies pour faire face &#224; 
</p>
<p>l&#8217;incompl&#233;tude lexicale (comme la simple &#171; transposition &#187; du mot inconnu, sans le traduire). 
</p>
<p>D&#8217;autres syst&#232;mes, comme Systran (Whitelock et al., 1995), tentent au moins de deviner la 
cat&#233;gorie grammaticale du mot inconnu en se basant sur sa terminaison. Ceci permet 
</p>
<p>d&#8217;obtenir une analyse syntaxique plus correcte, m&#234;me si la traduction n&#8217;en est pas plus 
</p>
<p>r&#233;ussie. 
</p>
<p>Les mots inconnus des lexiques informatis&#233;s posent donc un vrai probl&#232;me. Parmi ces mots 
</p>
<p>inconnus, on trouve un nombre important de noms propres. Toutefois, la majeure partie des 
</p>
<p>mots inconnus a pour origine la cr&#233;ativit&#233; lexicale des langues. Celle-ci rel&#232;ve de plusieurs 
</p>
<p>proc&#233;d&#233;s, comme celui de la n&#233;ologie formelle qui consiste en la cr&#233;ation de nouveaux mots &#224; 
partir de mat&#233;riaux lexicaux pr&#233;existant (Gaudin et al., 2000). D&#8217;un point de vue quantitatif, 
la n&#233;ologie formelle est souvent d&#233;crite comme la plus productive et la plus utilis&#233;e. Ainsi, 
</p>
<p>par exemple, Cabr&#233; (2002) constate que dans la presse catalane, ce proc&#233;d&#233; est &#224; l&#8217;origine de 
</p>
<p>75 % des n&#233;ologismes. Elle note &#233;galement que au sein de la n&#233;ologie formelle, la pr&#233;fixation 
</p>
<p>repr&#233;sente la ressource n&#233;ologique la plus importante (32,3 %), suivie de pr&#232;s par la 
</p>
<p>suffixation (24,7 %). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction des RCM et incompl&#233;tude lexicale en TA 
</p>
<p>2.2 Le traitement de la morphologie constructionnelle 
</p>
<p>La pr&#233;fixation et la suffixation, source principale de la n&#233;ologie formelle, font partie des 
</p>
<p>sujets d&#8217;&#233;tude de la morphologie constructionnelle, qui &#233;tudie la formation des mots 
</p>
<p>construits, c&#8217;est-&#224;-dire les mots dont le sens est pr&#233;dictible et enti&#232;rement compositionnel par 
</p>
<p>rapport &#224; leur structure interne (Corbin, 1987). La formalisation d&#8217;un processus 
</p>
<p>constructionnel passe par l&#8217;&#233;criture de r&#232;gles de construction des mots (Corbin, ibid.) (ci-
apr&#232;s RCM) soumises &#224; des contraintes permettant de d&#233;crire le processus concern&#233;. 
</p>
<p>La morphologie constructionnelle reste souvent d&#233;crite comme irr&#233;guli&#232;re, et donc 
</p>
<p>difficilement g&#233;n&#233;ralisable, et partant non exploitable en TAL, m&#234;me si un r&#233;cent article (Dal 
</p>
<p>2002) remet en cause cette r&#233;putation d&#8217;irr&#233;gularit&#233;. Comme le soulignent Dal, et al., 
(sous presse), le TAL s&#8217;int&#233;resse peu &#224; la morphologie constructionnelle, sans doute &#171; parce 
</p>
<p>qu&#8217;il voit [dans les donn&#233;es constructionnelles] des ph&#233;nom&#232;nes impr&#233;visibles qui &#233;chappent 
</p>
<p>en grande partie au calcul &#187;. Dans de nombreux syst&#232;mes de traitement des langues, les 
</p>
<p>informations constructionnelles sont utilis&#233;es &#224; la seule fin d&#8217;&#233;tiquetage morphosyntaxique 
</p>
<p>(Dal, et al., ibid.). En TA, l&#8217;utilisation des propri&#233;t&#233;s de la morphologie constructionnelle est 
rare, sans doute parce que ces applications n&#233;cessitent &#233;galement une op&#233;ration de g&#233;n&#233;ration, 
</p>
<p>qui semble plus difficile pour les mots construits inconnus (Gdaniec, et al., 2001). 
</p>
<p>Parce que la morphologie constructionnelle est souvent &#224; l&#8217;origine de la formation de 
</p>
<p>nouveaux mots, certaines recherches se sont d&#233;j&#224; pench&#233;es sur le traitement automatique de la 
</p>
<p>n&#233;ologie formelle, principalement dans des buts de g&#233;n&#233;ration (voir par exemple 
</p>
<p>Namer et al, 2000). Pour le pr&#233;sent travail, nous partons de l&#8217;hypoth&#232;se que les n&#233;ologismes 
formels doivent &#234;tre s&#233;mantiquement transparents pour &#234;tre compris des locuteurs. Ainsi, la 
</p>
<p>construction de n&#233;ologismes ne devrait pas &#234;tre aussi impr&#233;visible et irr&#233;guli&#232;re que la 
</p>
<p>morphologie constructionnelle en g&#233;n&#233;ral, ce qui devrait faciliter le traitement informatique. 
</p>
<p>Avant de d&#233;crire une exp&#233;rience pratique utilisant certaines propri&#233;t&#233;s de la morphologie 
</p>
<p>constructionnelle, nous &#233;tudions les possibilit&#233;s de transfert de ces RCM d&#8217;une langue &#224; une 
</p>
<p>autre, de fa&#231;on &#224; pouvoir exploiter ces propri&#233;t&#233;s dans le traitement des n&#233;ologismes en TA. 
</p>
<p>2.3 La traduction des r&#232;gles de construction des mots 
</p>
<p>La deuxi&#232;me hypoth&#232;se qui sous-tend notre approche concerne l&#8217;exploitation des similitudes 
</p>
<p>morphos&#233;mantiques entre deux langues proches pour inf&#233;rer (ou deviner) l&#8217;&#233;quivalent d&#8217;un 
</p>
<p>n&#233;ologisme dans l&#8217;autre langue. Nous partons du principe que la proximit&#233; des lexiques de 
</p>
<p>deux langues proches d&#8217;un point de vue morphologique pourrait &#234;tre exploit&#233;e en TA. Ainsi, 
</p>
<p>deux langues morphologiquement proches poss&#232;dent des similitudes au niveau des proc&#233;d&#233;s 
</p>
<p>de construction morphologique. Certaines &#233;tudes ont d&#233;j&#224; montr&#233; la relative proximit&#233; entre le 
</p>
<p>fran&#231;ais et l&#8217;italien (Namer, 2001). Cependant, m&#234;me si ces deux langues poss&#232;dent le m&#234;me 
</p>
<p>&#171; fonds lexical commun &#187;, des divergences se sont d&#233;velopp&#233;es avec le temps, donnant 
</p>
<p>notamment lieu au ph&#233;nom&#232;ne des faux amis. La production n&#233;ologique semble n&#233;anmoins 
</p>
<p>s&#8217;effectuer d&#8217;une mani&#232;re plus r&#233;guli&#232;re et avec une relative similitude dans les diff&#233;rentes 
</p>
<p>langues, particuli&#232;rement dans les domaines scientifiques et techniques o&#249; la mondialisation 
</p>
<p>et les &#233;changes internationaux sont importants, influen&#231;ant par l&#224; m&#234;me leur vocabulaire. 
</p>
<p>Dans ces domaines, les emprunts ou calques de constructions morphologiques s&#8217;effectuent en </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>mettant la nouvelle unit&#233; lexicale &#224; la &#171; sauce &#187; morphologique de la langue empruntante 
</p>
<p>(Gaudin et al., 2000). 
</p>
<p>Cette hypoth&#232;se soul&#232;ve quelques questions th&#233;oriques auxquelles il est difficile d&#8217;apporter 
</p>
<p>une r&#233;ponse franche, au moins &#224; ce stade de nos recherches. Par exemple, m&#234;me si tout 
</p>
<p>locuteur de deux langues morphologiquement proches sent tr&#232;s bien que le pr&#233;fixe de 
</p>
<p>r&#233;it&#233;ration italien ri&#8211; peut &#234;tre traduit par re&#8211; en fran&#231;ais (comme l&#8217;attestent les paires 
ricomminciareit/recommencerfr, rifareit/refairefr, etc.), peut-on pour autant consid&#233;rer que 
l&#8217;utilisation de ces deux proc&#233;d&#233;s est r&#233;guli&#232;re, et donc exploitable en TA ? Et, s&#8217;il existe des 
</p>
<p>exceptions, comment les d&#233;finir pour &#233;viter des analyses ou des g&#233;n&#233;rations incorrectes ? Ces 
</p>
<p>questions restent ouvertes, mais l&#8217;exp&#233;rience ci-dessous propose quelques pistes de recherche 
</p>
<p>pour d&#233;couvrir les r&#233;gularit&#233;s morphos&#233;mantiques entre deux langues et ainsi extraire des 
</p>
<p>r&#232;gles bilingues de construction des mots. 
</p>
<p>3 Exp&#233;rience 
</p>
<p>L&#8217;exploitation des r&#233;gularit&#233;s constructionnelles pourrait donc apporter une solution &#224; 
</p>
<p>certains probl&#232;mes d&#8217;incompl&#233;tude lexicale en TA. Ainsi, dans un cadre plus large, nous 
</p>
<p>proposons un syst&#232;me de transfert d&#8217;information morphos&#233;mantiques d&#8217;une langue &#224; l&#8217;autre 
</p>
<p>de fa&#231;on &#224; g&#233;n&#233;rer un n&#233;ologisme construit en langue cible &#224; partir des informations 
</p>
<p>reconnues dans le n&#233;ologisme de la langue source. 
</p>
<p>En pr&#233;sence d&#8217;un mot inconnu du lexique d&#8217;un syst&#232;me de TA, notre mod&#232;le propose donc les 
</p>
<p>&#233;tapes suivantes : (1) analyse des n&#233;ologismes selon des RCM ; (2) traduction de la base des 
mots construits analys&#233;s en (1) ; (3) transfert des informations morphos&#233;mantiques ; 
(4) construction d&#8217;un n&#233;ologisme construit gr&#226;ce &#224; la base traduite en (2) et aux informations 
provenant de l&#8217;&#233;tape (3). Ce &#171; transfert &#187; des informations (r&#233;alis&#233; en 3) n&#233;cessite la mise en 
</p>
<p>correspondance des RCM du fran&#231;ais et de l&#8217;italien, un peu &#224; l&#8217;image des r&#232;gles de transfert 
</p>
<p>syntaxique de certains syst&#232;mes de TA. Dans notre approche, cette mise en correspondance 
</p>
<p>est formalis&#233;e par un ensemble de RCM bilingues permettant de d&#233;crire diff&#233;rents proc&#233;d&#233;s 
</p>
<p>de construction. 
</p>
<p>Cependant, m&#234;me si nos recherches visent, &#224; terme, une exploitation &#224; large &#233;chelle dans un 
</p>
<p>syst&#232;me de TA, nous concentrons pour l&#8217;instant nos efforts sur des unit&#233;s lexicales hors 
</p>
<p>contexte. Dans ce m&#234;me esprit, nous limitons les ressources d&#8217;analyse &#224; celles contenues dans 
</p>
<p>un syst&#232;me de TA. Il serait, en effet, peu appropri&#233; de proposer des m&#233;thodes d&#8217;analyse des 
</p>
<p>mots inconnus qui utilisent des proc&#233;d&#233;s gourmands en place et en connaissances, et qui 
</p>
<p>p&#233;jorerait ainsi les performances du syst&#232;me de TA en termes de vitesse et de taille. Nous 
</p>
<p>pr&#233;sentons ci-apr&#232;s les diff&#233;rentes &#233;tapes de l&#8217;&#233;laboration de telles r&#232;gles, et leurs 
</p>
<p>exploitations in vivo. 
</p>
<p>3.1 Le syst&#232;me d&#233;rivationnel choisi 
</p>
<p>Pour cet article, nous nous sommes limit&#233; &#224; l&#8217;&#233;tude d&#8217;un syst&#232;me d&#233;rivationnel pr&#233;sent dans 
</p>
<p>nos deux langues de travail, l&#8217;italien et le fran&#231;ais.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction des RCM et incompl&#233;tude lexicale en TA 
</p>
<p>En italien, il existe un pr&#233;fixe verbal r(i)&#8211; (parfois sous la forme de re&#8211;,) qui correspond &#224; la 
forme syntaxique de &#171; de nouveau &#187; (Dardano, 1978). Ce pr&#233;fixe est un des plus productif, 
</p>
<p>&#233;tant donn&#233; qu&#8217;il peut potentiellement &#234;tre associ&#233; &#224; tous les verbes (Dardano, ibid.). Cette 
productivit&#233; semble particuli&#232;rement int&#233;ressante pour ce travail. En effet, dans la mesure o&#249; 
</p>
<p>ce pr&#233;fixe peut potentiellement &#234;tre associ&#233; &#224; tous les verbes, il pose un r&#233;el probl&#232;me 
</p>
<p>d&#8217;exhaustivit&#233; pour les lexiques informatis&#233;s. La RCM bilingue qui le traitera peut donc 
</p>
<p>s&#8217;av&#233;rer tr&#232;s rentable en termes de gain en qualit&#233; de traduction. 
</p>
<p>Dardano (ibid.) associe ce proc&#233;d&#233; de pr&#233;fixation &#224; celui du pr&#233;fixe de&#8211;, en &#233;mettant 
l&#8217;hypoth&#232;se qu&#8217;une action qui doit &#234;tre re-faite, a d&#251; &#234;tre auparavant d&#233;-faite. Il propose alors 
une s&#233;rie paradigmatique comme stabilizzare &#1;destabilizzare &#1; ristabilizzare. Il note 
&#233;galement que cette s&#233;rie poss&#232;de la capacit&#233; de produire une s&#233;rie de noms d&#233;verbaux 
</p>
<p>(comme dans stabilizzazione &#1; destabilizzazione &#1; ristabilizzazione). 
</p>
<p>Pour le fran&#231;ais, un syst&#232;me d&#233;rivationnel &#233;quivalent semble exister. Le pr&#233;fixe re&#8211; (et ses 
allomorphes, r&#8211; , et r&#233;&#8211; ) signifie &#233;galement la r&#233;p&#233;tition de l&#8217;action d&#233;crite par la base 
verbale (Rey-Debove, 2004). Le lien soulign&#233; pour l&#8217;italien par Dardano (1978) entre les 
</p>
<p>pr&#233;fixes r(i)&#8211; et de&#8211; est &#233;galement pr&#233;sent dans le syst&#232;me morphologique du fran&#231;ais 
(Huot, 2001), avec le pr&#233;fixe d&#233;&#8211; (qui prend aussi les formes d&#233;s&#8211; et des&#8211;), comme l&#8217;attestent 
les paires d&#233;faire/refaire, ou d&#233;coudre/recoudre. Enfin, les s&#233;ries de noms d&#233;verbaux cit&#233;s par 
Dardano (ibid) (stabilizzazione &#1; destabilizzazione &#1; ristabilizzazione) se retrouvent en 
fran&#231;ais : stabilisation &#1; d&#233;stabilisation &#1;restabilisation. 
</p>
<p>3.2 &#201;laboration des r&#232;gles de construction des mots bilingues 
</p>
<p>La linguistique informatique s&#8217;inspire largement de la linguistique descriptive ou de la 
</p>
<p>linguistique th&#233;orique, mais elle doit bien souvent faire des compromis li&#233;s aux probl&#232;mes 
</p>
<p>d&#8217;implantation (Tzoukermann et al., 1997). Dans notre cas, ce sont les contraintes li&#233;es &#224; la 
portabilit&#233; et &#224; la rapidit&#233; de traitement des syst&#232;mes de TA qui guident notre approche. Ainsi, 
</p>
<p>nous impl&#233;mentons des RCM bilingues bas&#233;es uniquement sur les cha&#238;nes de caract&#232;res et &#224; 
</p>
<p>l&#8217;aide d&#8217;expressions r&#233;guli&#232;res. 
</p>
<p>La RCM bilingue pr&#233;sent&#233;e dans la Figure 1 porte sur le traitement de verbes pr&#233;fix&#233;s en ri&#8211; 
en italien et leur traduction en fran&#231;ais. Les contraintes portent sur les bases, qui doivent 
</p>
<p>appartenir au lexique de r&#233;f&#233;rence (Lit et Lfr) et qui doivent &#234;tre la traduction l&#8217;une de l&#8217;autre. 
</p>
<p>Une r&#232;gle identique a &#233;t&#233; cr&#233;&#233;e pour le pr&#233;fixe de&#8211;. De plus, &#233;tant donn&#233; que nous ne 
travaillons que sur la forme orthographique des mots, les r&#232;gles sont r&#233;p&#233;t&#233;es pour chaque 
</p>
<p>allomorphe (r&#8211;, re&#8211;, &#8230;). Notons &#233;galement que faute de place, nous ne mentionnons pas dans 
les r&#232;gles les changements morphograph&#233;miques r&#233;sultant de la concat&#233;nation de la base et du 
</p>
<p>pr&#233;fixe qui ont &#233;t&#233; d&#233;finies pour la partie fran&#231;aise. 
</p>
<p>=
</p>
<p>FR 
X/VERBE =&gt; ri/PREF [Y/VERBE] 
</p>
<p>Y/VERBE &#8712; Lit  
</p>
<p>X&#8217;/VERBE =&gt; re/PREF [Y&#8217;/VERBE] 
</p>
<p>Y/VERBE &#8712;Lfr  
</p>
<p>IT 
</p>
<p>o&#249; : Y/VERBE = Y&#8217;/VERBE (&#233;quivalent de traduction) 
</p>
<p>Figure 1: RCM bilingue pour le pr&#233;fixe italien ri&#8211; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>La figure 2 pr&#233;sente la RCM bilingue des noms d&#233;verbaux pr&#233;fix&#233;s par ri&#8211;, proc&#233;d&#233; &#233;tudi&#233; par 
Dardano (1978). Pour contraindre la r&#232;gle, nous choisissons les suffixes les plus fr&#233;quents des 
</p>
<p>noms d&#233;verbaux (&#8211;zione, &#8211;mento, &#8211;aggio). Une r&#232;gle similaire est &#233;galement construite pour 
</p>
<p>le pr&#233;fixe de&#8211; suivi d&#8217;un nom. 
</p>
<p>Si l&#8217;on ne peut, &#224; ce stade, affirmer avec certitude que la pr&#233;fixation fran&#231;ais en re- est la 
traduction de la construction italienne en ri&#8211;, il n&#8217;en reste pas moins que notre exp&#233;rience 
donne des r&#233;sultats encourageants, que nous pr&#233;sentons dans la suite. 
</p>
<p>3.3 Le corpus de mots inconnus 
</p>
<p>La presse &#233;crite &#233;tant un terrain particuli&#232;rement fertile pour la production n&#233;ologique 
</p>
<p>(Pruvost et al., 2003), nous avons utilis&#233; comme corpus textuel un recueil de textes italiens 
publi&#233; par ELRA, (corpus MLCC, 1997), contenant les &#233;ditions du mois de f&#233;vrier 1992 du 
</p>
<p>quotidien italien Il Sole 24 ore1. Ce corpus contient 1,88 millions d&#8217;occurrences. 
</p>
<p>Dans l&#8217;&#233;tude empirique des ph&#233;nom&#232;nes de n&#233;ologie, la d&#233;couverte de nouveaux mots ne peut 
</p>
<p>se faire qu&#8217;&#224; partir d&#8217;un lexique de r&#233;f&#233;rence, tant la notion de nouveaut&#233; est difficile &#224; 
</p>
<p>d&#233;finir. Pour obtenir une liste de n&#233;ologismes, nous avons donc confront&#233; le corpus &#224; un 
</p>
<p>lexique de r&#233;f&#233;rence qui a jou&#233; le r&#244;le de corpus d&#8217;exclusion (Gaudin et al., 2000). Ce lexique 
est celui d&#8217;un analyseur morphosyntaxique, qui entre dans un processus complet d&#8217;&#233;tiquetage 
</p>
<p>morphosyntaxique (Tatoo2). De cette premi&#232;re confrontation, nous obtenons une liste de 
225 075 unit&#233;s lexicales inconnues de notre lexique de r&#233;f&#233;rence, ce qui correspond &#224; environ 
</p>
<p>12 % du nombre total d&#8217;occurrences. Evidemment, ces mots inconnus ne sont pas tous des 
</p>
<p>n&#233;ologismes. Nous affinons notre liste en excluant les noms propres, qui repr&#233;sentent une part 
</p>
<p>importante de l&#8217;incompl&#233;tude lexicale en TA (cf. plus haut). Pour ce faire, nous appliquons 
</p>
<p>une simple routine bas&#233;e sur les majuscules (&#224; l&#8217;instar de Maurel, 2004), et nous obtenons un 
</p>
<p>nombre total de mots inconnus potentiellement n&#233;ologiques de 90 260 occurrences (environ 
</p>
<p>4,8 % du corpus). 
</p>
<p>3.4 R&#233;sultats et &#233;valuations 
</p>
<p>Nous avons donc appliqu&#233; &#224; notre corpus de mots inconnus les RCM bilingues propos&#233;es plus 
</p>
<p>haut, &#224; la fois pour analyser les mots inconnus construits selon le syst&#232;me d&#233;rivationnel 
</p>
<p>                                                 
</p>
<p>1  http ://www.ilsole24ore.com/ 
2  The ISSCO Tagger Tool : http://issco-www.unige.ch/staff/robert/tatoo/tatoo.html 
</p>
<p>FR IT 
</p>
<p>=
</p>
<p>X/NOM =&gt; ri/PREF [Y/NOM] 
</p>
<p>Y/NOM = [a-z]*zione/i |  
</p>
<p>[a-z]*mento/i | [a-z]*aggio/i 
</p>
<p>Y/NOM &#8712; Lit 
</p>
<p>X&#8217;/NOM =&gt; re/PREF [Y&#8217;/NOM] 
</p>
<p>Y/NOM = [a-z]*tion/s |  
</p>
<p>[a-z]*ment/s | [a-z]*age/s 
</p>
<p>Y&#8217;/NOM &#8712; Lfr 
</p>
<p>o&#249; : Y/NOM = Y&#8217;/NOM (&#233;quivalent de traduction) 
</p>
<p>Figure 2 : RCM bilingue pour le pr&#233;fixe italien ri&#8211; sur une base nominale </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction des RCM et incompl&#233;tude lexicale en TA 
</p>
<p>choisi, et pour g&#233;n&#233;rer la traduction en fran&#231;ais de ces n&#233;ologismes construits. Nous 
</p>
<p>pr&#233;sentons ci-dessous les r&#233;sultats des &#233;tapes d&#8217;analyse et de g&#233;n&#233;ration. Notons que la 
</p>
<p>traduction des bases a &#233;t&#233; effectu&#233;e par le syst&#232;me de traduction automatique Systransoft&#169;
3
.  
</p>
<p>3.4.1 Analyse des mots pr&#233;fix&#233;s  
</p>
<p>Cette premi&#232;re &#233;tape consiste analyser les mots construits en utilisant la partie italienne de la 
</p>
<p>RCM bilingue, en recensant semi-automatiquement les d&#233;riv&#233;s dans notre corpus de mots 
</p>
<p>inconnus. La partie automatique consiste &#224; rechercher les mots qui correspondent aux r&#232;gles 
</p>
<p>&#233;tablies plus haut, avec la contrainte que la base soit pr&#233;sente dans le lexique de r&#233;f&#233;rence. De 
</p>
<p>cette extraction automatique, nous obtenons en sortie une paire form&#233;e du d&#233;riv&#233; n&#233;ologique 
</p>
<p>et de sa base, elle-m&#234;me accompagn&#233;e de son analyse dans le lexique 
</p>
<p>(&quot;riorganizzare&quot; = &quot;organizzare&quot; Verb [&#8230;]). Etant donn&#233; que cette automatisation 
peut g&#233;n&#233;rer une certaine quantit&#233; de bruit, d&#251; au fait que l&#8217;analyse s&#8217;effectue uniquement sur 
</p>
<p>la forme orthographique du mot, nous v&#233;rifions ensuite manuellement les couples d&#233;riv&#233;/base 
</p>
<p>extraits automatiquement. Le tableau 1 pr&#233;sente les r&#233;sultats de l&#8217;analyse des pr&#233;fixes verbaux 
</p>
<p>(et de leurs allomorphes), accompagn&#233;s du nombre de formes &#171; lemmatis&#233;es &#187;. Par &#171; lemme 
</p>
<p>&#187;, il faut ici entendre la forme lemmatis&#233;e de la base du d&#233;riv&#233;. 
</p>
<p>Pr&#233;fixes verbaux Occurrences  Lemmes  Erreur 
</p>
<p>ri&#8211; 508 63 5 
</p>
<p>r&#8211; 37 4 2 
</p>
<p>re&#8211; 96 9 0 
</p>
<p>de- 36 10 6 
</p>
<p>Tableau 1: analyse des verbes pr&#233;fix&#233;s 
</p>
<p>Le nombre d&#8217;erreurs est calcul&#233; sur les formes lemmatis&#233;es. Ces erreurs correspondent &#224; des 
</p>
<p>cas o&#249; le sens du mot construit n&#8217;est pas compositionnel, comme dans 
</p>
<p>*debuttare = de + buttare4. Elles peuvent para&#238;tre fr&#233;quentes (13 cas sur 86) mais elles 
concernent uniquement des formes qui ne sont pas n&#233;ologiques et qui constituent donc 
</p>
<p>d&#8217;avantage des lacunes du lexique de r&#233;f&#233;rence utilis&#233; pour cette exp&#233;rience. D&#8217;ailleurs, tous 
</p>
<p>les mots d&#233;compos&#233;s incorrectement sont connus des syst&#232;mes de TA classiques, qui reposent 
</p>
<p>sur des lexiques plus exhaustifs. 
</p>
<p>Concernant les noms d&#233;riv&#233;s d&#233;verbaux, nous proc&#233;dons de la m&#234;me mani&#232;re avec la RCM 
</p>
<p>bilingue correspondante. Le tableau 2 propose un r&#233;sum&#233; des r&#233;sultats de cette extraction et 
</p>
<p>son &#233;valuation. (Pour des raisons de place, nous ne mentionnons pas les formes qui n&#8217;ont 
</p>
<p>donn&#233; aucun r&#233;sultat &#8211; les noms pr&#233;fix&#233;s avec l&#8217;allomorphe r&#8211; et le suffixe d&#233;verbal &#8211;aggio 
pour les trois pr&#233;fixes). 
</p>
<p>                                                 
</p>
<p>3  SYSTRAN S.A. http://www.systranet.com/systran/net (21 janvier 2005) 
4  ce qui correspondrait en fran&#231;ais &#224; *d&#233;buter = d&#233; + buter  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>Pr&#233;fixe verbal Suffixe d&#233;verbal Occurrences  Lemmes  Erreurs  
</p>
<p>&#8211;zione 119 17 1 
ri&#8211;  
</p>
<p>&#8211;mento 201 10 0 
</p>
<p>&#8211;zione 19 4 0 
re&#8211; 
</p>
<p>&#8211;mento 16 1 0 
</p>
<p>&#8211;zione 47 11 0 
de&#8211; 
</p>
<p>&#8211;mento 0 0 0 
</p>
<p>Tableau 2: analyse des noms d&#233;verbaux pr&#233;fix&#233;s 
</p>
<p>La v&#233;rification manuelle permet de trouver un taux de bruit presque nul. Une seule erreur o&#249; 
</p>
<p>le sens du mot construit n&#8217;est pas compositionnel a &#233;t&#233; trouv&#233;e, et elle provient d&#8217;une erreur 
</p>
<p>de typographie dans le corpus de d&#233;part. 
</p>
<p>De ces deux petites r&#232;gles, pour les noms et les verbes, nous voyons qu&#8217;un nombre important 
</p>
<p>d&#8217;unit&#233;s lexicales peut &#234;tre analys&#233; d&#8217;une mani&#232;re correcte d&#8217;un point de vue constructionnel 
</p>
<p>(1065). Un tel r&#233;sultat provient sans doute de plusieurs facteurs. Premi&#232;rement, les r&#232;gles ont 
</p>
<p>&#233;t&#233; soumises &#224; des contraintes (simples mais importantes), ce qui &#233;vite un nombre important 
</p>
<p>de mauvaises analyses (qui pourraient &#234;tre dues par exemple &#224; l&#8217;homographie des affixes). 
</p>
<p>Mais le facteur le plus important est sans doute que les mots analys&#233;s sont uniquement 
</p>
<p>n&#233;ologiques (les erreurs ne se retrouvent que dans les mots non n&#233;ologiques) et que l&#8217;analyse 
</p>
<p>s&#8217;effectue en fonction du lexique de r&#233;f&#233;rence. Tout ceci tend &#224; montrer que les mots 
</p>
<p>construits n&#233;ologiques sont rarement ambigus, ce qui v&#233;rifie, pour ce corpus en tout cas, notre 
</p>
<p>premi&#232;re hypoth&#232;se. 
</p>
<p>Pr&#233;cisons cependant que, m&#234;me si le bruit est quasiment inexistant, le silence serait &#233;galement 
</p>
<p>&#224; &#233;valuer. Toutefois, comme la contrainte la plus importante mise sur la r&#232;gle concerne la 
</p>
<p>pr&#233;sence de la base dans le lexique de r&#233;f&#233;rence, les mots non trouv&#233;s (le silence) sont 
</p>
<p>forc&#233;ment des mots dont la base est absente du lexique, et donc &#171; intraitables &#187; par le reste du 
</p>
<p>processus de traduction. 
</p>
<p>3.4.2 Traduction des mots analys&#233;s 
</p>
<p>Apr&#232;s avoir analys&#233; les mots construits et traduit les bases, nous avons &#171; reconstruit &#187; les 
</p>
<p>&#233;quivalents de traduction en appliquant la partie fran&#231;aise des RCM bilingues. Nous obtenons 
</p>
<p>alors une liste de mots construits italiens et leur &#233;quivalent de traduction, comme 
</p>
<p>deresponsabilizzazione = d&#233;responsabilisation, ridistribuzione = redistribution, riclassificare 
= reclassifier. Evaluer la correction de la traduction ne nous semblait pas tr&#232;s pertinent, car 
une bonne traduction d&#233;pend &#233;galement du contexte que nous n&#8217;avions pas. Nous avons donc 
</p>
<p>&#233;valu&#233; uniquement la correction du n&#233;ologisme fran&#231;ais. Cette &#233;valuation doit se faire en 
</p>
<p>fonction de la correction du n&#233;ologisme par rapport &#224; un sentiment linguistique propre &#224; la 
</p>
<p>langue fran&#231;aise. Mais le sentiment linguistique reste un concept tr&#232;s flou. Les mots ont donc </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction des RCM et incompl&#233;tude lexicale en TA 
</p>
<p>&#233;t&#233; &#233;valu&#233;s sur une &#233;chelle de trois valeurs : correct, incorrect, incertain. Cependant, aucun 
</p>
<p>mot n&#8217;a &#233;t&#233; jug&#233; &#171; incorrect &#187;. Les r&#233;sultats de l&#8217;&#233;valuation sont r&#233;sum&#233;s dans le tableau 3. 
</p>
<p>Proc&#233;d&#233;s constructionnels Lemmes  n&#233;ologismes corrects n&#233;ologismes incertains 
</p>
<p>ri&#8211; + verbe 58 56 2 
</p>
<p>r&#8211; + verbe 2 2 0 
</p>
<p>re&#8211; + verbe 9 9 0 
</p>
<p>de&#8211; + verbe 4 4 0 
</p>
<p>ri&#8211; + nom 26 22 4 
</p>
<p>re&#8211; + nom 5 5 0 
</p>
<p>de&#8211; + nom 11 11 0 
</p>
<p>Tableau 3 : &#233;valuation des n&#233;ologismes en fonction du pr&#233;fixe 
</p>
<p>Concernant les n&#233;ologismes jug&#233;s incertains, nous avons utilis&#233; le corpus du Web pour affiner 
</p>
<p>encore l&#8217;&#233;valuation. Ainsi, bien que des mots comme recrocheter ou r&#233;association aient paru 
&#233;tranges aux &#233;valuateurs, le nombre d&#8217;occurrences et la pertinence des sources d&#233;couvertes 
</p>
<p>sur l&#8217;Internet permettent de valider ces cr&#233;ations dans tous les cas. 
</p>
<p>4 Conclusion et travaux futurs 
</p>
<p>Le petit nombre de mots &#233;tudi&#233;s dans cette exp&#233;rience ne peut nous permettre de tirer des 
</p>
<p>conclusions d&#233;finitives et une exp&#233;rience similaire sur d&#8217;autres corpus permettrait de 
</p>
<p>confirmer les premi&#232;res tendances constat&#233;es. Il n&#8217;en reste pas moins que cette exp&#233;rience 
</p>
<p>semble montrer que des r&#232;gles de construction simples et pr&#233;cises donnent des r&#233;sultats 
</p>
<p>extr&#234;mement fiables. De plus, le faible bruit provenant de l&#8217;analyse compositionnelle des 
</p>
<p>n&#233;ologismes est tr&#232;s prometteur. 
</p>
<p>D&#8217;un point de vue quantitatif, l&#8217;ensemble des r&#232;gles propos&#233;es dans cet article a permis de 
</p>
<p>traduire 1065 occurrences. Dans l&#8217;absolu, ce chiffre peut para&#238;tre faible en comparaison des 
</p>
<p>90 260 mots inconnus dans le corpus. Cependant, si la pertinence d&#8217;une telle r&#232;gle est valid&#233;e 
</p>
<p>&#224; plus large &#233;chelle et si l&#8217;on y ajoute d&#8217;autres r&#232;gles similaires pour d&#8217;autres processus de 
</p>
<p>construction r&#233;put&#233;s productifs, nous profiterions alors d&#8217;un m&#233;canisme simple et moins 
</p>
<p>chronophage en terme de gestion des ressources linguistiques pour la TA.  
</p>
<p>La validit&#233; de ces r&#232;gles reste n&#233;anmoins &#224; prouver, notamment pour d&#8217;autres processus 
</p>
<p>constructionnels moins transparents et beaucoup moins d&#233;crit par la linguistique th&#233;orique. Et 
</p>
<p>tout comme pour les r&#232;gles syntaxiques dans le domaine de la TA, le traitement des 
</p>
<p>divergences entre les deux langues (on dit clonage en fran&#231;ais, mais clonazione en italien) est 
aussi un large objet d&#8217;&#233;tude. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>R&#233;f&#233;rence 
</p>
<p>Arnold D., Balkan L., Humphreys R., Meijer S., Sadler , (1994). Machine translation: An 
introductory Guide, Manchester, Blackwell. 
</p>
<p>Cabr&#233; T., Freixa, J., Sol&#233; E., (2002), A la limite des mots construits possible, Actes du Forum 
de morphologie, pp. 65-78. 
</p>
<p>Corbin D., (1987), Morphologie d&#233;rivationnelle et structuration du lexique, Tuebingen, 
Niemeyer. 
</p>
<p>Dal G. (2002). A propos d'une id&#233;e re&#231;ue, ou de la pr&#233;tendue irr&#233;gularit&#233; de la d&#233;rivation, 
</p>
<p>Bulag, Vol. 27, pp. 57-73. 
</p>
<p>Dal G., Hathout, N., Namer F., (sous presse), Morphologie Constructionnelle et Traitement 
Automatique des Langues : le projet MorTAL, Lexique Vol.16. 
</p>
<p>Dardano M., (1978), La formazione delle parole nell'italiano di oggi, Rome, Bulzoni. 
</p>
<p>Gaudin F., Guespin L., (2000), Initiation &#224; la lexicologie fran&#231;aise, Bruxelles, Duculot. 
</p>
<p>Gdaniec C., Manandise, E., McCord, M., (2001), Derivational Morphology to the Rescue: 
</p>
<p>How It Can Help Resolve Unfound Words in MT. Actes de MT Summit VIII. 
</p>
<p>Huot, H., (2001). Morphologie, Forme et sens des mots fran&#231;ais. Paris, Armand Colin. 
</p>
<p>Maurel, D. (2004). Les mots inconnus sont-ils des noms propres? Actes de JADT 2004, 
Louvain-la-Neuve. 
</p>
<p>Namer, F. (2001), G&#233;n&#233;ration automatique de n&#233;ologismes bilingues morphologiquement 
</p>
<p>construits en fran&#231;ais et en italien. Actes de TALN 2001. pp. 281-296. 
</p>
<p>Namer, F. (2000), G&#233;D&#233;riF : Automatic Generation and Analysis of Morphologically 
</p>
<p>Constructed Lexical Resources, Actes de LREC 2000, pp. 1447-1454 
</p>
<p>Rey-Debove J., Ed. (2004). Brio, Paris, Dictionnaire Le Robert. 
</p>
<p>Sproat R. (1992), Morphology and Computation. Cambridge, The MIT Press. 
</p>
<p>Tzoukermann E., Jacquemin, C. (1997), Analyse automatique de la morphologie 
</p>
<p>d&#233;rivationnelle et filtrage des mots possibles, Actes de Forum de morphologie, pp. 251-260. 
</p>
<p>Whitelock P., Kilby K, (1995) Linguistic and computational techniques in machine 
translation system design, London, UCL Press. </p>

</div></div>
</body></html>