<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Cent mille milliards de po&#232;mes et combien de sens? Une &#233;tude d'analyse potentielle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Cent mille milliards de po&#232;mes et combien de sens ? 
Une &#233;tude d&#8217;analyse potentielle 
</p>
<p>Florentina Vasilescu Armaselu  
Universit&#233; de Montr&#233;al, D&#233;partement de litt&#233;rature compar&#233;e 
</p>
<p>armaselu@sympatico.ca
 
</p>
<p>Mots-clefs &#8211; Keywords  
Unit&#233; du discours, r&#233;seaux de coh&#233;sion, analyse th&#233;matique, litt&#233;rature potentielle 
Discourse unity, networks of cohesion, thematic analysis, potential literature 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>A partir du concept de coh&#233;sion comme mesure de l&#8217;unit&#233; du texte et du mod&#232;le oulipien de la 
litt&#233;rature par contraintes, notre &#233;tude propose une m&#233;thode d&#8217;analyse potentielle sur 
ordinateur dans le cas des Cent mille milliards des po&#232;mes. En s&#8217;appuyant sur un ensemble de 
contraintes initiales, notre programme serait capable d&#8217;analyser tous les textes potentiels 
produits par la machine en utilisant ces contraintes. 
Using the concept of cohesion as a measure for the unity of text and the Oulipian model of the 
literature by constraints, our study proposes a computational method of potential analysis for 
One hundred billions sonnets. Starting from a set of initial constraints, our program would be 
able to analyze all the potential texts produced by the machine under these constraints.  
</p>
<p>1 Introduction 
Les m&#233;canismes de compr&#233;hension du sens d&#8217;un texte dans son ensemble restent encore peu 
connus. Des mod&#232;les du processus d&#8217;interpr&#233;tation (comme compr&#233;hension, pas comme 
interpr&#233;tation critique) ont &#233;t&#233; d&#233;j&#224; propos&#233;s : la th&#233;orie des cadres (Minsky, 1975), la 
hi&#233;rarchisation des expressions anaphoriques (Lakoff, 1976), les r&#233;seaux de coh&#233;sion 
(Halliday, Hasan, 1976), l&#8217;hypoth&#232;se de la connectivit&#233; (Gentner, 1981). (Rastier, 1987) relie 
la notion de sens d&#8217;un texte &#224; la modalit&#233; de perception de l&#8217;unit&#233; du texte, dans le processus 
d&#8217;interpr&#233;tation. A partir de l&#8217;&#233;tude des r&#233;seaux de coh&#233;sion (Stoddard, 1991) et de la notion 
de coh&#233;sion lexicale (Morris, Hirst, 1991) nous proposons une nouvelle approche d&#8217;analyse 
sur ordinateur des r&#233;seaux de coh&#233;sion comme mesures de l&#8217;unit&#233; d&#8217;un texte, dans le cas des 
Cents mille milliards de po&#232;mes (Queneau, 1961). Notre analyse s&#8217;appuie sur des relations 
d&#8217;ordre s&#233;mantique, syntaxique et cognitif qui contribuent &#224; la perception d&#8217;un texte comme 
un tout coh&#233;sif. Ne disposant pas d&#8217;un dictionnaire &#233;lectronique comportant ce type 
d&#8217;information, nous avons annot&#233; manuellement (voir 4.1) les mots consid&#233;r&#233;s significatifs 
(noms, verbes, adjectifs) des dix sonnets originaux de Queneau. A partir de cet ensemble 
d&#8217;annotations et en utilisant un m&#233;canisme combinatoire permettant l&#8217;engendrement de 
nouveaux sonnets, notre programme de composition et d&#8217;analyse produit des diagrammes, des 
calculs estimatifs et des descriptions th&#233;matiques (voir 4.1, 4.2, 5), en simulant la 
&#171; compr&#233;hension &#187; d&#8217;un sonnet en termes d&#8217;unit&#233; th&#233;matique et de relations de coh&#233;sion 
&#233;tablies entre les mots.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florentina Vasilescu Armaselu 
</p>
<p>Le choix des Cents mille milliards de po&#232;mes comme banc d&#8217;essai pour notre &#233;tude n&#8217;a pas 
&#233;t&#233; al&#233;atoire. Premi&#232;rement, parce que le mod&#232;le oulipien de la cr&#233;ation par contraintes et son 
m&#233;canisme combinatoire (voir 2), repr&#233;senteraient un point de d&#233;part pour une analyse 
potentielle du texte. Nous entendons par cela un programme qui, &#224; partir d&#8217;un ensemble de 
contraintes initiales (dans notre cas, les dix sonnets originaux annot&#233;s), serait capable 
d&#8217;analyser, par des proc&#233;d&#233;s combinatoires, tous les textes potentiels produits par la machine 
en utilisant ces contraintes. Deuxi&#232;mement, les dix po&#232;mes originaux, dou&#233;s, selon Queneau, 
d&#8217;un &#171; th&#232;me &#187; et d&#8217;une &#171; continuit&#233; &#187;, joueraient le r&#244;le de base de comparaison pour notre 
analyse. Troisi&#232;mement, en tenant compte que notre objet d&#8217;&#233;tude est une collection de 
sonnets, notre int&#233;r&#234;t porte sur les enjeux d&#8217;un traitement automatique du sens dans le cas des 
textes litt&#233;raires. En d&#8217;autres mots, il s&#8217;agissait de reformuler en termes interrogatifs la bien 
connue citation de Turing plac&#233;e par Queneau en t&#234;te de ses Cent mille milliards de po&#232;mes : 
Est-ce qu&#8217;une machine peut appr&#233;cier un sonnet &#233;crit par une autre machine ?  
</p>
<p>2 Une machine &#224; fabriquer des sonnets 
Les deux tendances majeures de la recherche oulipienne sont la reprise des &#339;uvres du pass&#233; et 
l&#8217;invention de nouvelles r&#232;gles de cr&#233;ation litt&#233;raire, &#224; partir de contraintes formelles (Le 
Lionnais, 1986). Selon (Motte W.F. Jr., 1986), les Cent mille milliards de po&#232;mes repr&#233;sentent 
le mod&#232;le de l&#8217;entreprise oulipienne, par la reprise d&#8217;une forme po&#233;tique traditionnelle, le 
sonnet, et par l&#8217;invention d&#8217;une nouvelle forme po&#233;tique combinatoire permettant &#224; chaque 
vers d&#8217;&#234;tre int&#233;gr&#233; dans l&#8217;ensemble quasi-infini de sonnets potentiels. Comme l&#8217;affirme 
(Queneau, 1961), Cent mille milliards de po&#232;mes est une &#171; machine &#187; &#224; fabriquer 1014  po&#232;mes 
diff&#233;rents. Le fonctionnement de cette machine s&#8217;appuie sur un ensemble de contraintes 
formelles, internes et combinatoires. Les contraintes internes concernent la forme de chaque 
sonnet (deux quatrains et deux tercets), les rimes qui ne doivent pas &#171; &#234;tre trop banales [&#8230;] 
trop rares ou uniques &#187; et l&#8217;existence d&#8217;un &#171; th&#232;me &#187; et d&#8217;une &#171; continuit&#233; &#187; pour chacun des 
dix sonnets d&#8217;origine. Les contraintes combinatoires exigent une structure grammaticale 
invariante et l&#8217;absence des d&#233;saccords en genre et en nombre pour toute substitution de vers 
possible. En tenant compte de cette immense mais encore limit&#233;e potentialit&#233; cr&#233;ative, qu&#8217;est-
ce qu&#8217;on pourrait dire alors sur la potentialit&#233; de sens de ce type de machine ?   
</p>
<p>3 Coh&#233;sion et unit&#233; du texte 
Le concept de sens fait l&#8217;objet d&#8217;&#233;tude de plusieurs disciplines dans le cadre des sciences 
humaines. Comme nous avons d&#233;j&#224; mentionn&#233;, notre d&#233;marche s&#8217;int&#233;resse seulement &#224; une 
partie plus restreinte de ce concept, reli&#233;e &#224; la modalit&#233; par laquelle nous percevons l&#8217;unit&#233; 
d&#8217;un texte dans le processus d&#8217;interpr&#233;tation (Rastier, 1987). Selon (Morris, Hirst, 1991), le 
texte ou le discours n&#8217;est pas une simple succession de mots et de phrases faisant r&#233;f&#233;rence &#224; 
des choses diff&#233;rentes, mais un ensemble d&#8217;entit&#233;s reli&#233;es l&#8217;une &#224; l&#8217;autre qui portent sur un 
m&#234;me sujet. C&#8217;est une propri&#233;t&#233; qui conf&#232;re au texte la qualit&#233; d&#8217;unit&#233; et qui est appel&#233;e 
coh&#233;sion. La coh&#233;sion n&#8217;est pas pourtant une caract&#233;ristique inh&#233;rente au texte, elle d&#233;pend 
aussi de lecteur. Dans l&#8217;acception de (Stoddard, 1991), la coh&#233;sion est un m&#233;canisme 
unificateur que nous construisons pendant le processus d&#8217;interpr&#233;tation et qui nous aide &#224; 
d&#233;river beaucoup plus de sens du texte dans son ensemble que de la simple somme des sens 
des mots et des phrases qui le composent. La coh&#233;sion impliquerait ainsi la construction de 
liens mentaux entre les parties composantes d&#8217;un texte, dans le processus d&#8217;interpr&#233;tation.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cent mille milliards de po&#232;mes et combien de sens ?
 
</p>
<p>Une &#233;tude d&#8217;analyse potentielle 
</p>
<p>Il y a plusieurs types de relations d&#233;terminant la coh&#233;sion. Notre &#233;tude s&#8217;int&#233;resse aux 
relations s&#233;mantiques existant entre les mots (partie/tout, co-occurrence dans des contextes 
similaires, appartenance &#224; un m&#234;me domaine) et d&#233;terminant la coh&#233;sion lexicale (Morris, 
Hirst, 1991). De plus, notre analyse s&#8217;appuie sur le mod&#232;le des r&#233;seaux de coh&#233;sion (Stoddard, 
1991), utilis&#233; dans l&#8217;analyse des articles d&#233;finis, des pronoms et des dislocations d&#8217;agents 
verbaux. Le r&#233;seau de Stoddard comporte un n&#339;ud (le r&#233;f&#233;rent, par exemple Abraham 
Lincoln) et des &#233;l&#233;ments de coh&#233;sion (par exemple, les pronoms he, him, his) reli&#233;s au n&#339;ud 
par des relations de coh&#233;sion s&#233;mantico-syntaxiques. Stoddard fait ainsi une distinction entre 
la coh&#233;sion, une caract&#233;ristique s&#233;mantico-syntaxique, et la coh&#233;rence une mesure de &#171; l&#8217;unit&#233; 
de sens d&#8217;un texte &#187; qui entra&#238;ne &#171; l&#8217;environnement cognitif &#187; et &#171; l&#8217;exp&#233;rience &#187; du lecteur. 
Nous avons adapt&#233; ce mod&#232;le, en consid&#233;rant le r&#233;seau de coh&#233;sion comme une structure de 
n&#339;uds (noms, verbes, adjectifs pr&#233;alablement annot&#233;s) reli&#233;s entre eux par des relations de 
coh&#233;sion qui d&#233;pendent de la nature des attributs attach&#233;s aux n&#339;uds et qui impliquent des 
connaissances d&#8217;ordre lexico-s&#233;mantique, syntaxique et cognitif (voir 4.1). 
</p>
<p>4 Ouvroir d&#8217;analyse potentielle 
Le programme permet &#224; la fois la construction et l&#8217;analyse d&#8217;un po&#232;me. Il y a deux modalit&#233;s 
de construire un po&#232;me : choisir un des dix sonnets originaux en indiquant son num&#233;ro dans 
un champ de saisie ou composer un nouveau po&#232;me, en combinant les vers des dix sonnets &#224; 
l&#8217;aide de 14 listes d&#233;roulantes. Le module d&#8217;analyse utilise les attributs attach&#233;s manuellement 
aux mots, comme des contraintes initiales. Apr&#232;s la composition d&#8217;un sonnet tel indiqu&#233; ci-
dessus, le programme compare les attributs et construit un lien entre deux mots (n&#339;uds), s&#8217;il y 
d&#233;tecte au moins une valeur commune, indiff&#233;remment du type des attributs. 
</p>
<p>4.1 Les contraintes initiales 
</p>
<p>L&#8217;annotation des mots (en format XML) comporte un attribut obligatoire (le lemme) et un 
ensemble d&#8217;attributs optionnels1 (voir Figure1), selon les quatre types de relations consid&#233;r&#233;s : 
1. Relations de type s&#233;mantique, d&#233;crites par l&#8217;attribut domaine, une classe s&#233;mantique reli&#233;e &#224; 
</p>
<p>&#171; l&#8217;exp&#233;rience d&#8217;un groupe &#187; et qui encode une &#171; pratique sociale &#187; (Rastier, 1997). Ce type 
d&#8217;attribut permet de construire, par exemple, un lien entre Tamise et bateaux (domaine = 
navigation), climat et bise (domaine = m&#233;t&#233;o), Socrate et Platon (domaine = philosophie), etc. 
</p>
<p>2. Relations de type syntaxique entre un nom et son compl&#233;ment (ou son attribut) et un verbe et son 
compl&#233;ment. Ces relations sont mises en &#233;vidence par l&#8217;attribut relatif_&#224; associ&#233; au compl&#233;ment 
ou &#224; l&#8217;attribut : &#171; climat londonien &#187; (londonien, relatif_&#224; = climat) ; &#171; Sa sculpture est illustre &#187; 
(illustre, relatif_&#224; = sculpture) ; &#171; on transporte et le marbre &#8230;&#187; (marbre, relatif_&#224; = transporter). 
</p>
<p>3. Relations extratextuelles supposant des connaissances du monde, d&#233;finies par les attributs 
appartenance et allusion. Le programme mettrait ainsi en relation Gr&#232;ce (lemme = Gr&#232;ce) avec 
Platon (appartenance = Gr&#232;ce) ; londonien avec Tamise (appartenance = Angleterre) ; Elgin 
(allusion = Parth&#233;non, Turquie) avec Parth&#233;non (lemme = Parth&#233;non) et Turc (appartenance = 
Turquie) ; frissonner avec bise (allusion = froid), etc. A la diff&#233;rence de (Stoddard, 1991) nous 
avons consid&#233;r&#233; ces connaissances du monde comme facteurs d&#233;terminant la coh&#233;sion du texte. 
</p>
<p>4. Relations &#233;tymologiques (gaucho, pampa, mat&#233; reli&#233;s par leur attribut &#233;tymologie = espagnol). 
                                                 
</p>
<p>1
 Leurs valeurs ont &#233;t&#233; sugg&#233;r&#233;es par Le Petit Larousse, Le Grand dictionnaire terminologique et EURODICAUTOM.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florentina Vasilescu Armaselu 
</p>
<p>Comme dans le mod&#232;le oulipien, l&#8217;annotation s&#8217;appuie sur des contraintes initiales, internes et 
combinatoires (voir 2), supposant une interpr&#233;tation au niveau de chacun des sonnets 
originaux et une sorte de m&#233;ta-interpr&#233;tation qui devrait tenir compte des combinaisons 
possibles des mots d&#8217;un sonnet avec les mots des autres. Il s&#8217;agissait ainsi de pr&#233;voir des 
valeurs d&#8217;attribut appropri&#233;es de fa&#231;on que Rameaux (sonnet 3) soit par exemple reli&#233; &#224; cloche 
(sonnet 1), corne (sonnet 1) soit reli&#233; &#224; taureau (sonnet 1) et &#224; veau (sonnet 5) mais pas &#224; chat 
(sonnet 9) ou &#224; baleine (sonnet 3), dans un sonnet potentiel. Un exemple de diagramme de 
coh&#233;sion produit par le programme est pr&#233;sent&#233; ci-dessous : 
</p>
<p> 
</p>
<p>Figure 1. R&#233;seaux de coh&#233;sion. Sonnet 2 
</p>
<p>4.2 Le banc d&#8217;essai 
</p>
<p>Les Cent mille milliards des po&#232;mes nous ont servi &#233;galement comme banc d&#8217;essai pour des 
estimations quantitatives (sur le contenu, la coh&#233;sion, le th&#232;me), consid&#233;r&#233;es comme des 
indicateurs globaux de l&#8217;unit&#233; d&#8217;un po&#232;me. Le programme d&#233;termine la composition (en %) de 
chaque po&#232;me analys&#233;, par rapport aux sonnets originaux (par exemple : 100% sonnet2 ; 50% 
sonnet1 +50% sonnet2, etc). C&#8217;est une mesure par laquelle on pourrait appr&#233;cier, en grandes 
lignes, le caract&#232;re homog&#232;ne ou h&#233;t&#233;rog&#232;ne d&#8217;un po&#232;me quant &#224; sa composition. A partir de 
l&#8217;hypoth&#232;se qu&#8217;un texte nous para&#238;trait plus unitaire si la plupart de ses mots sont reli&#233;s entre 
eux, nous avons d&#233;fini le coefficient de coh&#233;sion globale (CCG) comme : 
</p>
<p>CCG = 100&#8901;
TN
</p>
<p>NRD
, o&#249; NRD = le nombre de N&#339;uds du R&#233;seau de coh&#233;sion Dominant,  
</p>
<p>                TN = le nombre Total des N&#339;uds pour le texte analys&#233;. 
Comme un texte pourrait renfermer plusieurs r&#233;seaux de coh&#233;sion ind&#233;pendants (ce qui 
indiquerait une fragmentation de son unit&#233;), le r&#233;seau dominant regrouperait le plus grand </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cent mille milliards de po&#232;mes et combien de sens ?
 
</p>
<p>Une &#233;tude d&#8217;analyse potentielle 
</p>
<p>nombre de n&#339;uds connect&#233;s entre eux par des liens de coh&#233;sion, pour le texte donn&#233;. Un 
coefficient de coh&#233;sion de 100% caract&#233;riserait ainsi un texte o&#249; tous les mots analys&#233;s soient 
reli&#233;s entre eux, en formant un seul r&#233;seau. Le sonnet 2 (voir Figure 1) pr&#233;sente un coefficient 
de coh&#233;sion globale assez &#233;lev&#233;, puisque son r&#233;seau de coh&#233;sion dominant inclut presque tous 
les n&#339;uds, sauf trois (chanter, patauger, crise). Une autre mesure, utilis&#233;e comme indicateur 
du degr&#233; de coh&#233;sion entre les mots, est la densit&#233; moyenne (DM), i.e. le nombre moyen de 
connexions par n&#339;ud pour un texte donn&#233; (Stoddard, 1991). Une valeur &#233;lev&#233;e de la densit&#233; 
signalerait une coh&#233;sion forte, une valeur basse indiquerait une coh&#233;sion faible (un texte ayant 
moins de relations entre ses &#233;l&#233;ments). Comme base de comparaison, le programme affiche 
les valeurs du CCG et de la DM des dix sonnets originaux, par ordre d&#233;croissant.  
Le programme propose &#233;galement un th&#232;me, i.e. l&#8217;entit&#233; &#224; laquelle les mots du texte font le 
plus souvent r&#233;f&#233;rence et qui appartient au texte (valeur de l&#8217;attribut lemme) ou est ext&#233;rieure 
au texte (valeur d&#8217;un attribut domaine, allusion, appartenance, etc). Le programme compte le 
nombre de fois qu&#8217;une valeur d&#8217;attribut appara&#238;t dans l&#8217;annotation d&#8217;un sonnet, en choisissant 
comme th&#232;me la ou les valeurs les plus fr&#233;quentes. Pour une caract&#233;risation plus d&#233;taill&#233;e, 
chaque th&#232;me est accompagn&#233; des centres de focalisation du sonnet, i.e. les mots comportant 
le plus grand nombre de connexions (par exemple, Gr&#232;ce pour le sonnet 2, Figure 1). Cette 
description th&#233;matique serait une repr&#233;sentation condens&#233;e du sens global d&#8217;un texte (voir 5). 
</p>
<p>5 Observations sur les r&#233;sultats 
La Figure 2 pr&#233;sente les r&#233;sultats d&#8217;analyse pour les dix sonnets de d&#233;part et pour dix sonnets 
compos&#233;s. Le tableau indique une coh&#233;sion moins forte (densit&#233; plus basse) pour les sonnets 
compos&#233;s, bien que des valeurs plus &#233;lev&#233;es soient &#233;galement possibles (No 12). Le 
coefficient de coh&#233;sion globale pr&#233;sente des valeurs variables, comparables parfois avec les 
sonnets originaux. Les valeurs basses de cet indicateur montreraient l&#8217;existence de plusieurs 
r&#233;seaux de coh&#233;sion, dont aucun ne domine de fa&#231;on marquante, et alors une fragmentation de 
contenu (14, 19). Cette caract&#233;ristique ne semble pas reli&#233;e n&#233;cessairement au caract&#232;re trop 
h&#233;t&#233;rog&#232;ne d&#8217;un sonnet, une combinaison de tous les dix sonnets originaux pouvant 
d&#233;terminer des valeurs assez &#233;lev&#233;es (20). Comme le montre le tableau, les descriptions 
th&#233;matiques obtenues par le m&#233;canisme combinatoire d&#8217;analyse peuvent reprendre les th&#232;mes 
initiaux, avec un changement &#233;ventuel de centre de focalisation (11), engendrer de nouveaux 
th&#232;mes (14, 15, 16, 19, 20) ou des th&#232;mes composites (12, 13, 16, 17, 18). Dans ce dernier cas 
on pourrait avoir parfois une certaine compatibilit&#233; entre les &#233;l&#233;ments y impliqu&#233;s (12, 16), 
parfois un caract&#232;re plus h&#233;t&#233;rog&#232;ne, bien que pas tout &#224; fait incompatible (13, 17, 18). D&#8217;un 
autre c&#244;t&#233;, les r&#233;sultats d&#8217;analyse semblent fort d&#233;pendants de la description XML, i.e. de la 
subjectivit&#233; et du niveau de connaissances utilis&#233;s dans l&#8217;interpr&#233;tation des sonnets originaux. 
No Sonnet/Contenu CCG % DM Th&#232;me Centres de focalisation (no. liens/centre) 
</p>
<p>Sonnets originaux 
1 S1 62.8 2.7 Am&#233;rique du Sud Am&#233;rique du Sud; pampa (8) 
2 S2 91.8 4.7 Europe Gr&#232;ce (14) 
3 S3 72.5 9.5 mer poisson; dorade; molve_lotte (20) 
4 S4 72.5 2.8 noblesse blason; baron (8) 
5 S5 92.3 4.0 Europe latin (13) 
6 S6 96.6 2.8 urbanisme escroc; provincial (6) 
7 S7 62.0 3.9 g&#233;n&#233;alogie, famille g&#233;n&#233;alogiste; adult&#233;rin; parent (11) 
8 S8 92.5 6.5 langues m&#233;tromane (18) 
9 S9 89.1 9.6 alimentation turbot; requin (25) 
</p>
<p>10 S10 62.5 3.3 mort mort (12) 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florentina Vasilescu Armaselu 
</p>
<p>No Sonnet/Contenu CCG % DM Th&#232;me Centres de focalisation (no. liens/centre) 
Sonnets compos&#233;s 
</p>
<p>11 50%S6,S10 71.4 2.3 mort croque-morts; tissu; p&#226;lotte (6) 
12 50%S3,S9 95.1 9.9 alimentation, 
</p>
<p>zoologie 
poisson; dorade; molve lotte (25) 
</p>
<p>13 50%S1,S4 62.1 2.4 g&#233;ographie, 
Angleterre, noblesse 
</p>
<p>baron ; Malabar ; lord (6) 
</p>
<p>14 28.5%S4,S8 ; 21.4% S2,S6 26.1 2.1 Angleterre Tamise (8) 
15 35.7%S7,S8 ; 28.5%S9 70.5 2.5 psychologie idiot ; m&#233;tromane (6) 
16 35.7%S1; 
</p>
<p>21.4%S3,S7,S2 
63.6 2.1 navigation, eau marin (7) 
</p>
<p>17 28.5%S5,S1 ; 21.4%S2,S9 65.8 2.6 Europe, zootechnie taureau ; veau ; Grec (7) 
18 14.2%S1,S2,S3,S4,S8,S9,S10 78.7 2.4 alimentation, 
</p>
<p>emploi, transporter 
chauffeur ; sel ; marbre ; marbrier ; pompier 
</p>
<p>(5) 
19 14.2%S2,S4,S6,S7,S8 ; 
</p>
<p>7.1%S3,S5,S9,S10 
 
</p>
<p>35.4 
 
</p>
<p>1.9 
 
</p>
<p>art 
 
</p>
<p>a&#232;de ; po&#232;te (6) 
20 21.4%S4; 14.2%S2,S5; 
</p>
<p>7.1%S1,S3,S6,S7,S8,S9,S10 
 
</p>
<p>70.2 
 
</p>
<p>2.3 
 
</p>
<p>boissons 
 
</p>
<p>Beaune, Chianti, anglais (6) 
</p>
<p>Figure 2 : R&#233;sultats d&#8217;analyse. CCG &#8211; coefficient de coh&#233;sion globale, DM &#8211; densit&#233; moyenne 
</p>
<p>6 Conclusion 
Notre &#233;tude du sens des Cent mille milliards de po&#232;mes s&#8217;appuie sur la notion de coh&#233;sion 
comme expression de l&#8217;unit&#233; d&#8217;un texte. La question pos&#233;e par le titre est rh&#233;torique. L&#8217;&#233;tude 
compl&#232;te du sens des Cent mille milliards de po&#232;mes supposerait une analyse des 1014 sonnets 
potentiels, ce qui d&#233;passe &#233;videmment le but de notre projet. Notre d&#233;marche s&#8217;int&#233;resserait 
plut&#244;t aux enjeux d&#8217;une analyse potentielle, i.e. &#224; la capacit&#233; d&#8217;un programme d&#8217;analyser un 
ensemble quasi-infini de textes, &#224; partir d&#8217;un nombre fini de contraintes initiales. 
</p>
<p>R&#233;f&#233;rences 
GENTNER D. (1981), Verb semantic structures in memory for sentences: Evidence for 
componential representation. Cognitive psychology, Vol. 13, pp. 56-83. 
HALLIDAY M.A.K., HASAN R. (1976), Cohesion in English, London, Longman. 
LAKOFF G. (1976), Pronouns and reference, Syntax and semantics, Notes from the linguistic 
underground, Vol. 7, pp. 275-335. 
LE LIONNAIS F. (1986), Lipo. First Manifesto, In Oulipo, A Primer of Potential Literature, 
Translated and edited by Warren F. Motte Jr., Lincoln, University of Nebraska Press. 
MINSKY M. (1975), A framework for representing knowledge. In The Psychology of 
Computer Vision, P.H. Winston Editor, New York, McGraw-Hill. 
MORRIS J., HIRST G. (1991), Lexical Cohesion Computed by Thesaural Relations as an 
Indicator of the Structure of the Text, Computational Linguistics, Vol. 17, pp. 21-45. 
MOTTE W.F. Jr. (1986), Introduction, In A Primer of Potential Literature, Translated and 
edited by Warren F. Motte Jr., Lincoln, University of Nebraska Press. 
QUENEAU R. (1961), Cent mille milliards de po&#232;mes, Paris, Gallimard  
RASTIER F. (1987), S&#233;mantique interpr&#233;tative, Paris, Presses Universitaires de France. 
RASTIER F. (1997), Meaning and Textuality, Toronto, University of Toronto Press. 
STODDARD S. (1991), Text and Texture: Patterns of Cohesion, Norwood, Ablex Publishing. </p>

</div></div>
</body></html>