<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Dur&#233;e des consonnes g&#233;min&#233;es en parole arabe : mesures et comparaison</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p> Dur&#233;e des consonnes g&#233;min&#233;es en parole arabe : mesures et 
comparaison   
</p>
<p>Mohamed Khairallah KHOUJA (1), Mounir ZRIGUI (2) 
</p>
<p>(1) et (2)  Laboratoire RIADI (unit&#233; de Monastir) 
</p>
<p>(1)  khairallah_k@yahoo.fr
</p>
<p> (2) Facult&#233; des Sciences de Monastir, 
</p>
<p>mounir.zrigui@fsm.rnu.tn
</p>
<p>Mots-clefs &#8211; Keywords  
</p>
<p>Analyse acoustique, arabe standard, g&#233;mination, dur&#233;e, reconnaissance de la parole. 
</p>
<p>Acoustic analyze, standard Arabic, gemination, duration, speech recognition.   
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
</p>
<p>Dans ce papier, nous pr&#233;sentons les r&#233;sultats d&#8217;une &#233;tude exp&#233;rimentale de la dur&#233;e des 
consonnes g&#233;min&#233;es de l&#8217;arabe. Nous visons &#224; d&#233;terminer la dur&#233;e, pour une s&#233;quence 
VCCV, de la consonne g&#233;min&#233;e CC ainsi que de la voyelle qui la pr&#233;c&#232;de. Nous comparons 
ces valeurs &#224; celles mesur&#233;es pour une s&#233;quence VCV. Les r&#233;sultats ont prouv&#233; que la dur&#233;e 
de la consonne simple &#233;tait sensiblement diff&#233;rente de celle g&#233;min&#233;e, ainsi que la dur&#233;e de la 
voyelle pr&#233;c&#233;dant la consonne. A la base, ce travail est entrepris dans un but d&#8217;&#233;tudier 
l&#8217;utilisation des dur&#233;es de phon&#232;mes comme une source d&#8217;information pour optimiser un 
syst&#232;me de reconnaissance, donc introduire des mod&#232;les explicites de dur&#233;e des phon&#232;mes, et 
mettre en application ces mod&#232;les comme partie du mod&#232;le acoustique du syst&#232;me de 
reconnaissance. 
</p>
<p>In this paper, we represent the results of an experimental study concerning the duration of 
geminated consonants in the Arabic language. We are seeking to determine the duration of a 
sequence VCCV, of the geminated consonant CC and of the vowel that precedes it.  We are 
comparing these items with those measured for a sequence VCV.  The results have shown that 
the duration of the simple consonant was so apparently different from that geminated and the 
same was true for the duration of the vowel that precedes such consonant.  Basically, this 
work is undertaken with an aim of studying the use of the durations of phonemes like a source 
of information to optimize a recognition system, therefore to introduce explicit models of 
duration of the phonemes, and to apply these models like part of the acoustic model of the 
recognition system.   </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Khouja Khairallah , Zrigui Mounir 
</p>
<p>1 Introduction 
L&#8217;arabe est une langue dans laquelle les dur&#233;es des phon&#232;mes jouent un r&#244;le distinctif dans la 
reconnaissance automatique de la parole (RAP). L'information en dur&#233;e est la plupart du 
temps n&#233;glig&#233;e dans les syst&#232;mes de RAP dus &#224; l'utilisation des mod&#232;les cach&#233;s de Markov 
qui sont d&#233;ficients pour une mod&#233;lisation correcte des dur&#233;es des phon&#232;mes (Selouani S-A., 
2000). 
</p>
<p>2 La g&#233;mination dans l&#8217;arabe  
La g&#233;mination est d&#233;finie comme &#233;tant la succession de deux consonnes identiques 
prononc&#233;es cons&#233;cutivement. En arabe, la g&#233;mination est exprim&#233;e &#224; l&#8217;aide du symbole &#171;   &#1612;  &#187; 
(  )&#1577;&#1612;&#1583;&#1588;&#1604;&#1575; . Ce symbole joue un r&#244;le important dans la d&#233;finition et le sens de certains mots.  
</p>
<p>Pour la langue arabe le param&#232;tre de dur&#233;e est tr&#232;s important tant au niveau s&#233;mantique qu'au 
niveau grammatical. Il caract&#233;rise non seulement les voyelles, mais &#233;galement les consonnes 
g&#233;min&#233;es. Concernant ce trait, un double probl&#232;me se pose en RAP de l'arabe : il faut d&#233;celer 
les phon&#232;mes allong&#233;s tout en s'assurant que ce prolongement est pertinent, c'est &#224; dire en le 
distinguant des allongements dus au d&#233;bit d'&#233;locution, &#224; un accent particulier du locuteur, etc. 
En effet si l'on observe l'exemple du mot &#171; &#1609;&#1612;&#1604;&#1589; &#187; /salla:/ (prier) d&#233;riv&#233; de la racine  &#171; &#1604;&#1575;&#1589;  &#187; 
qui ne s'oppose que par la g&#233;mination de la consonne &#171;  &#1604;  &#187; au mot &#171; &#1609;&#1604;&#1589;  &#187; /sala :/ (griller) 
d&#233;riv&#233; de la racine &#171; &#1609;&#1604;&#1589; &#187;, nous mesurons &#224; la fois l'importance et la difficult&#233; d'un syst&#232;me 
automatique &#224; d&#233;celer ce trait. La g&#233;mination se manifeste par le renforcement de 
l'articulation et une prolongation de la fermeture de la plosive ou du continuant des autres 
consonnes (Barkat M., 2000).  
</p>
<p>Plusieurs &#233;tudes similaires &#224; ce travail ont &#233;t&#233; pr&#233;sent&#233;es pour d&#8217;autres langues, ou la 
g&#233;mination est consid&#233;r&#233;e comme un trait remarquable, notamment celle pour l&#8217;italien 
(Giovanardi M., Di Benedetto M-G., 1998), le grec (Arvaniti A., Tserdanelis G., 2000) et 
l&#8217;indien (Samudravijaya K., 2003). Pour l&#8217;arabe standard aucune &#233;tude n&#8217;est faite &#224; nos 
connaissances dans le cadre de la parole spontan&#233;e. Les travaux de Jomaa (Jomaa M., 1993) 
et Allatif (Allatif O., Abry C., 2004), sont int&#233;ress&#233;s par l&#8217;effet de la quantit&#233; de contraste 
pour les s&#233;quences VVC et CCV  et &#224; la quantit&#233; vocalique pour l&#8217;arabe dialectale.  
</p>
<p>3 Donn&#233;es et mesures 
</p>
<p>3.1 Acquisition des donn&#233;es 
</p>
<p>Vu l&#8217;absence d&#8217;un corpus annot&#233;, nous &#233;tions amen&#233;s &#224; effectuer nos propres enregistrements 
&#224; l&#8217;aide du logiciel PRAAT1 et d&#8217;un microphone professionnel mis &#224; la m&#234;me distance de la 
bouche de chacun des quatre locuteurs (2 hommes et 2 femmes) participant aux 
enregistrements, tous dans la m&#234;me salle pratiquement isol&#233;e. On a demand&#233; aux locuteurs de 
                                                 
</p>
<p>1 Logiciel d&#233;velopp&#233; &#224; l&#8217;institut des sciences phon&#233;tiques de l&#8217;universit&#233; d&#8217;Amsterdam par P. Boersma et D. 
Weenink.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dur&#233;e des consonnes g&#233;min&#233;es en parole arabe : mesures et comparaison   
 
</p>
<p>lire avec une vitesse moyenne tout en assurant une bonne articulation et en &#233;vitant les 
perturbations dus aux h&#233;sitations, les reprises, les respirations, &#8230;, dans de tel cas le locuteur 
est invit&#233; &#224; reprendre sa lecture. La fr&#233;quence d&#8217;&#233;chantillonnage des enregistrements est 
22050 Hz. Des phrases contenant les mots  choisis pour l&#8217;&#233;tude sont lus les unes apr&#232;s les 
autres sans arr&#234;t. La dur&#233;e totale des enregistrements est de 1 h 27 min. Les mots sont choisie 
afin d&#8217;avoir au moins, si possible, deux fois la couverture de toutes les consonnes dans le cas 
de g&#233;mination et simple. Le nombre total des mots analys&#233;s a atteint 520 mots. 
</p>
<p>3.2 Analyse acoustique 
</p>
<p>Les donn&#233;es &#233;tudi&#233;es ont &#233;t&#233; extraites manuellement &#224; l&#8217;aide du logiciel PRAAT. Le fait que 
tous les relev&#233;s aient &#233;t&#233; op&#233;r&#233;s par la m&#234;me personne, garantie l&#8217;unicit&#233; de la m&#233;thode et des 
principes de base et donc l&#8217;homog&#233;n&#233;it&#233; des donn&#233;es. Notre d&#233;coupage a &#233;t&#233; fait 
manuellement sur la base d&#8217;indices visuels (spectre, amplitude, formant) le contr&#244;le &#233;tant 
perceptif. 
</p>
<p>3.3 Mesures 
</p>
<p>La dur&#233;e des diff&#233;rentes unit&#233;s est consid&#233;r&#233;e en g&#233;n&#233;rale comme le ph&#233;nom&#232;ne central pour 
la prosodie. En effet chaque variation de fr&#233;quence fondamentale ou d'intensit&#233; s'&#233;tablit sur un 
certain laps de temps, dur&#233;e mesurable. Etudier l'organisation temporelle de la parole est 
incontournable. Etudier la dur&#233;e c'est observer et mod&#233;liser les dur&#233;es d'unit&#233;s bien 
d&#233;termin&#233;es. L&#8217;effort produit lors de l&#8217;articulation ne peut &#234;tre infini, la s&#233;quence est toujours 
la m&#234;me : effort et rel&#226;chement. Cet effort et ses variations sont v&#233;hicul&#233;s &#224; travers le signal, 
ils permettent une segmentation temporelle de la parole en unit&#233;s. Dans notre cas les unit&#233;s &#224; 
mesurer sont les phon&#232;mes. 
</p>
<p>Pour chaque mot extrait des enregistrements on commence par en extraire les unit&#233;s &#224; 
mesurer donc la voyelle, la consonne o&#249; la consonne g&#233;min&#233;e. Chaque unit&#233; est &#233;diter (signal 
+ spectre + formants) s&#233;par&#233;ment afin de pouvoir raffiner les limites et calculer la dur&#233;e. Une 
moyenne de la dur&#233;e pour chaque unit&#233; est calcul&#233;e sur les quatre locuteurs. 
</p>
<p>4 R&#233;sultats 
Les dur&#233;es des diverses unit&#233;s de la parole ont &#233;t&#233; calcul&#233;es et employ&#233;es pour &#233;tudier les 
caract&#233;ristiques en dur&#233;e des consonnes et des voyelles qui les pr&#233;c&#232;des. Les changements 
observ&#233;s des dur&#233;es dues &#224; la g&#233;mination sont pr&#233;sent&#233;s et discut&#233;s dans cette section.  
</p>
<p>4.1 Dur&#233;e de la voyelle 
</p>
<p>La Figure 1 pr&#233;sente la dur&#233;e moyenne pour les diff&#233;rents tests sur les trois voyelles courtes. 
Pour chaque couple de mots (simple et g&#233;min&#233;) nous calculons la dur&#233;e de la voyelle 
pr&#233;c&#233;dant la consonne sujet de la g&#233;mination. La dur&#233;e pour les voyelles longues est calcul&#233;e 
sur d&#8217;autres mots composant le corpus, elle est donn&#233;e &#224; titre indicatif.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Khouja Khairallah , Zrigui Mounir 
</p>
<p>Nous constatons que la dur&#233;e de la voyelle pr&#233;c&#233;dant une g&#233;mination diminue par rapport &#224; 
son homologue (consonne simple) pour 86% des mots &#233;tudi&#233;s. En moyenne on a une 
diminution de 11 ms pour le /a/, 13 ms pour /u/ et 12 ms pour /i/. Cette diminution peut &#234;tre 
expliqu&#233;e par une tendance du locuteur &#224; insister sur la g&#233;mination plut&#244;t que sur la voyelle 
qui la pr&#233;c&#232;de. Ce r&#233;sultat est trouv&#233; pour d&#8217;autres langues tels que l&#8217;italien et l&#8217;indien 
(diminution de 10 &#224; 15 ms) et il confirme les r&#233;sultats pr&#233;sent&#233;s dans (Zeki M. Hassan 2002). 
</p>
<p>0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>120
</p>
<p>140
</p>
<p>a u i
</p>
<p>avec
g&#233;mination
</p>
<p>sans
g&#233;mination
</p>
<p>longue
</p>
<p> 
</p>
<p>Figure 1 Repr&#233;sentation des dur&#233;es moyennes (ms) des voyelles pr&#233;c&#233;dant une consonne 
simple ou g&#233;min&#233; et celle d'une voyelle longue. 
</p>
<p>4.2 Dur&#233;e des consonnes  
</p>
<p>L'un des exercices les plus p&#233;rilleux du traitement de la parole consiste &#224; d&#233;terminer les 
fronti&#232;res des diff&#233;rentes unit&#233;s phon&#233;tiques contenues dans un &#233;nonc&#233;. Cette difficult&#233; tient &#224; 
la nature m&#234;me de la parole continue : les unit&#233;s sont fortement coarticul&#233;es, et l'on passe 
souvent de l'une &#224; l'autre de mani&#232;re continue. 
</p>
<p>Comme pr&#233;cis&#233; en 3.3, nous avons mesur&#233; la dur&#233;e pour chaque consonne simple et son 
homologue g&#233;min&#233;e en conservant la m&#234;me s&#233;quence qui pr&#233;c&#232;de et qui suit la consonne. 
Cela est possible puisque nous partons d&#8217;une racine verbale (&#1604;&#1593;&#1601;) et nous la d&#233;rivons en ( &#1612;&#1593;&#1601;&#1604; ), 
en plus de quelques noms et leurs d&#233;riv&#233;s.  
</p>
<p>Les r&#233;sultats des moyennes de quelques unes de ces dur&#233;es sont donn&#233;s par la Figure 2. Les 
valeurs sont arrondies et exprim&#233;es en ms. 
</p>
<p>Le rapport (G/S) donne une id&#233;e sur la diff&#233;rence entre une consonne simple et la m&#234;me 
g&#233;min&#233;e. La th&#232;se classique consid&#233;rant ce rapport &#233;gal &#224; 2, (Bonnot J.F., 1979), reste comme 
une moyenne mais n&#8217;est pas vraie pour toutes les consonnes puisque les r&#233;sultats 
exp&#233;rimentaux obtenus donnent un rapport variant entre 1,48 et 2,24. 
</p>
<p>Pour mieux cern&#233; les caract&#233;ristiques en dur&#233;e des consonnes nous avons &#233;tablis la Figure 3, 
qui pr&#233;sente les dur&#233;es suivant le type des consonnes. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dur&#233;e des consonnes g&#233;min&#233;es en parole arabe : mesures et comparaison   
 
</p>
<p>Consonne Simple G&#233;min&#233; G/S Consonne Simple G&#233;min&#233; G/S 
</p>
<p>/b/  &#1576;   58 99 1,71  /t/   &#1578; 62 105 1,69 
</p>
<p>/T/  &#1579;   65 123 1,89 /Z/  &#1580;   70 121 1,73 
</p>
<p>/x/  &#1582;   65 110 1,69 /&#61680;/  &#1581;    63 102 1,62 
</p>
<p>/d/  &#1583;   69 145 2,10 /D/  &#1584;   68 139 2,04 
</p>
<p>/r/  &#1585;   64 95 1,48 /h/  &#1607;   59 116 1,97 
</p>
<p>/s/  &#1587;   70 130 1,86 /S/ &#1588;   72 131 1,82 
</p>
<p>/&#711;/  &#1591;   69 134 1,94 /&#191;/  &#1593;   61 113 1,85 
</p>
<p>/f/  &#1601;   62 129 2,08 /q/  &#1602;   52 101 1,94 
</p>
<p>/k/  &#1603;   67 129 1,93 /l/  &#1604;    68 141 2,07 
</p>
<p>/m/  &#1605;   62 116 1,87 /n/  &#1606;   60 124 2,07 
</p>
<p>Figure 2 Extrait des moyennes des dur&#233;es des consonnes simples et g&#233;min&#233;es et leurs rapports  
</p>
<p>0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>120
</p>
<p>140
</p>
<p>160
</p>
<p>Dentales Alveolaires Bilabliales 
</p>
<p>simple
g&#233;min&#233;e
</p>
<p> 
</p>
<p>Figure 3 Repr&#233;sentation des dur&#233;es (ms) pour certains types de consonnes dans les cas 
simples et g&#233;min&#233;s. 
</p>
<p>Le classement des consonnes suivant leurs types donne une vision plus claire sur la notion de 
dur&#233;e. Cette classification montre bien la diff&#233;rence entre les diff&#233;rentes classes de consonnes 
puisque le rapport g&#233;min&#233;/simple est plus caract&#233;risant : 2,04 pour les dentales, 1,94 pour les 
alv&#233;olaires et 1,78 pour les bilabiales. Ces r&#233;sultats restent pr&#233;liminaires puisqu&#8217;une &#233;tude 
plus compl&#232;te sur un corpus plus important sera plus consistante. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Khouja Khairallah , Zrigui Mounir 
</p>
<p>5 Conclusion  
Dans cet article nous avons pr&#233;sent&#233; les r&#233;sultats des mesures en dur&#233;e des consonnes 
g&#233;min&#233;es pour la parole arabe. Les r&#233;sultats statistiques obtenus montrent bien que nous 
pouvons caract&#233;riser une consonne simple d&#8217;une g&#233;min&#233;e d&#8217;un point de vu dur&#233;e. Les 
r&#233;sultats ont prouv&#233; que la dur&#233;e de la consonne g&#233;min&#233;e &#233;tait sensiblement diff&#233;rente que 
celle simple avec les rapports pr&#233;sent&#233;s, ainsi que la dur&#233;e de la voyelle pr&#233;c&#233;dant cette 
consonne. Pour pouvoir r&#233;soudre le probl&#232;me de la g&#233;mination, dans un syst&#232;me de (RAP) 
continu pour la langue arabe, il faudrait diff&#233;rencier entre une g&#233;mination et une consonne 
simple suivie d&#8217;une voyelle longue. Cela passe par une bonne approche automatique 
acoustique pour la d&#233;termination des fronti&#232;res entre consonne et voyelle. 
</p>
<p>R&#233;f&#233;rences  
Allatif O., Abry C., (2004) Adaptabilit&#233; des param&#232;tres temporels et spectraux dans 
l'opposition de quantit&#233; vocalique de l'arabe de Mayadin (Syrie), JEP'2004, 2004. 
</p>
<p>Arvaniti A., Tserdanelis G., (2000) On the phonetics of geminates: evidence from cypriot 
greek, In proceedings of 6th International Conference on Spoken Language Processing, 
volume 2, p: 559-562. Beijing, China, 2000. 
</p>
<p>Barkat M. (2000) D&#233;termination d&#8217;indices acoustiques robustes pour l&#8217;identification 
automatique des parlers arabes, Th&#232;se de doctorat,  Universit&#233; Lumi&#232;re LYON 2, 2000.  
</p>
<p>Bonnot J.F. (1979) &#233;tude exp&#233;rimentale de certains aspects de la g&#233;mination et de l&#8217;emphase 
en arabe, travaux de l&#8217;institut phon&#233;tique de Strasbourg, N&#176;11, pp. 109-118, 1979. 
</p>
<p>Giovanardi M., Di Benedetto M-G. (1998) Acoustic Analysis of Singleton and Geminate 
Fricative in Italien, The European Student Journal of Language and Speech, 1998. 
</p>
<p>Jomaa M. (1993) Effect of quantity contrasts on the temporal regulation of mandibular 
movements in Arabic, Actes du colloque du 2i&#232;me congr&#233;s : Langue arabe et technologies 
informatiques avanc&#233;es, pages : 141-169, 1993. 
</p>
<p>Samudravijaya K. (2003) Durational Characteristics of Hindi Stop Consonants, 
EUROSPEECH 2003, 2003. 
</p>
<p>Selouani S-A. (2000) Reconnaissance automatique de la parole par des techniques multi-
agents, connexionnistes et hybrides, Th&#232;se d&#8217;&#233;tat, Universit&#233; des Sciences et Technologie 
Houari Boumedi&#232;nne, 2000. 
</p>
<p>Zeki M. Hassan (2002) Gemination in swedish &amp; arabic with a particular reference to the 
preceding vowel duration. An instrumental &amp; comparative approach, TMH-QPSR vol. 44 
Fonetik 2002. </p>

</div></div>
</body></html>