<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me de lissage lin&#233;aire pour la synth&#232;se de la parole arabe : Discussion des r&#233;sultats obtenus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Un syst&#232;me de lissage lin&#233;aire pour la synth&#232;se de la parole 
arabe : Discussion des r&#233;sultas obtenus 
</p>
<p>Tahar SAIDANE (1), Mounir ZRIGUI (2), Mohamed BEN AHMED (3) 
</p>
<p>(1) Centre de production de Sousse, Soci&#233;t&#233; 
Tunisienne d&#8217;Electricit&#233; et du Gaz, Tunisie 
</p>
<p>saidane.tahar@planet.tn 
 (2) Labaoratoire RIADI, Unit&#233; Monastir 
Facult&#233; des Sciences de Monastir, Tunisie 
</p>
<p>mounir.zrigui@fsm.rnu.tn 
(3) Labaoratoire RIADI, Ecole Nationale des Sciences 
</p>
<p>de l&#8217;informatique, Tunis, Tunisie 
Mohamed.BenAhmed@riadi.rnu.tn 
</p>
<p> 
</p>
<p>Mots cl&#233;s  &#8211; Keywords 
</p>
<p>Synth&#232;se de la parole arabe, Phon&#232;mes, Diphones, Triphones, Unit&#233;s acoustiques, 
Dictionnaire de polyphones.  
</p>
<p>Arabic speech sythesis, Phoneme, Diphones, Triphones, Acoustic units, Polyphones 
dictionary. 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Notre article s'int&#232;gre dans le cadre du projet intitul&#233; &quot;Or&#233;odule&quot; : un syst&#232;me embarqu&#233; 
temps r&#233;el de reconnaissance, de traduction et de synth&#232;se de la parole. L'objet de notre 
int&#233;r&#234;t dans cet article est la pr&#233;sentation de notre syst&#232;me de synth&#232;se hybride de la parole 
arabe. Nous pr&#233;senterons, dans ce papier, les diff&#233;rents modules et les diff&#233;rents choix 
techniques de notre syst&#232;me de synth&#232;se hybride par concat&#233;nation de polyph&#232;mes. Nous 
d&#233;taillerons &#233;galement les r&#232;gles de transcription et leurs effets sur le traitement linguistique, 
les r&#232;gles de syllabation et leurs impacts sur le co&#251;t (temps et difficult&#233;) de r&#233;alisation du 
module acoustique et nous poursuivrons par l'expos&#233; de nos choix au niveau du module de 
concat&#233;nation. Nous d&#233;crirons le module de lissage, un traitement acoustique, post 
concat&#233;nation, n&#233;cessaire &#224; l'am&#233;lioration de la qualit&#233; de la voix synth&#233;tis&#233;e. Enfin, nous 
pr&#233;senterons les r&#233;sultats de l'&#233;tude statistique de compr&#233;hension, r&#233;alis&#233;e sur un corpus.  
</p>
<p>This research paper is within the project entitled &quot;Oreillodule&quot; : a real time embedded system 
of speech recognition, translation and synthesis. The core of our interest in this work is the 
presentation of the hybrid system of the Arabic speech synthesis and more precisely of the 
linguistic and the acoustic treatment. Indeed, we will focus on the grapheme-phoneme </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de lissage lin&#233;aire pour la synth&#232;se de la parole arabe : Discussion des r&#233;sultas 
obtenus 
</p>
<p>transcription, an integral stage for the development of this speech synthesis system with an 
acceptable quality. Then, we will present some of the rules used for the realization of the 
phonetic treatment system. These rules are stocked in a data base and browsed several times 
during the transcription. We will also present the module of syllabication in acoustic units of 
variable sizes (phoneme, diphone and triphone), as well as the corresponding polyphones 
dictionary. We will list the stages of the establishment of this dictionary and the difficulties 
faced during its development. Finally, we will present the results of the statistical survey of 
understanding, achieved on a corpus. 
</p>
<p>1 Introduction 
Notre &#233;tude porte sur la conception et la r&#233;alisation d&#8217;un syst&#232;me de synth&#232;se de la parole 
arabe qui donne la voix la plus naturelle possible tout en tenant compte des particularit&#233;s de la 
langue. Cet objectif a n&#233;cessit&#233; l&#8217;&#233;tude de toutes les &#233;tapes de la synth&#232;se de la parole et le 
choix des solutions les plus adapt&#233;es &#224; chaque t&#226;che. Le r&#233;sultat de ces &#233;tudes nous a guid&#233; 
vers un syst&#232;me de synth&#232;se hybride utilisant la concat&#233;nation d&#8217;unit&#233;s acoustiques de tailles 
variables tout en utilisant des r&#232;gles &#233;tablies. Cet article pr&#233;sentera les modules de ce syst&#232;me 
de synth&#232;se &#224; savoir le transcripteur, le module de syllabation, le dictionnaire d&#8217;unit&#233;s 
acoustiques et le module de concat&#233;nation muni de son syst&#232;me de lissage (Dutoit, 1993). 
</p>
<p>2 LA TRANSCRIPTION 
L'analyse linguistique nous a permis d'&#233;tablir un ensemble de 133 r&#232;gles. Il est &#224; noter que 
l'ordre d'application de ces r&#232;gles est tr&#232;s important et influe sur le r&#233;sultat final. En ce qui 
suit la description de quelques r&#232;gles &#233;labor&#233;es (Saidane, 2004) : 
</p>
<p>1. [CC]={}&#1617;+{C} 
Lorsqu&#8217;une consonne est suivie par la &#1617; , elle est doubl&#233;e, on obtient alors le phon&#232;me [CC]. 
Exemple :  &#1614;&#1617;&#1583;&#1614;&#1608; ,&#1614;&#1580;&#1614;&#1617;&#1608;&#1614;&#1585; . 
</p>
<p>2. {CL}+{&#1600;&#1604;}+{V}+{CL}={CL}+{&#1600;&#1604;&#1575; }+{CL} 
3. {CL}+{&#1600;&#1604;}+{V}+{CS}={CL}+{&#1600;&#1604;&#1575; }+{CS} 
</p>
<p>Lorsque le &#1600;&#1604;&#1575; est entre suivi par une consonne lunaire, il est &#233;quivalent &#224; la non pr&#233;sence du &#1571;. 
Exemple : &#1604;&#1618;&#1570;&#1614;&#1604;&#1571;&#1575; &#1614;&#1593;&#1616;&#1606;&#1615;&#1605; ,&#1615;&#1604;&#1618;&#1570;&#1614;&#1604;&#1571;&#1575; &#1614;&#1604;&#1616;&#1570;&#1615;&#1571;  (Zrigui 1991). 
</p>
<p>3 LA SYLLABATION 
Les unit&#233;s acoustiques de notre syst&#232;me de synth&#232;se sont de trois types : les triphones, les 
diphones et les phon&#232;mes. On a &#233;tabli un ensemble de r&#232;gles de concat&#233;nation &#224; partir 
desquelles les diff&#233;rentes occurrences de trois phon&#232;mes pouvaient se transformer en : un 
triphone, un diphone suivi d'un phon&#232;me, un phon&#232;me suivi d'un diphone, ou &#233;ventuellement 
trois phon&#232;mes. La s&#233;lection dynamique des unit&#233;s se traduit alors par la recherche de la 
s&#233;quence optimale de repr&#233;sentants, visant &#224; minimiser les discontinuit&#233;s au point de 
concat&#233;nation (Boula, 2001). Le sch&#233;ma suivant pr&#233;sente un exemple de syllabation pour 
l'expression &#171;&#1616;&#1614;&#1606;&#1608;&#1615;&#1585;&#1616;&#1601;&#1575;&#1614;&#1587;&#1615;&#1605;&#1604;&#1575; &#1614;&#1606;&#1618;&#1610;&#1614;&#1571; &#187; (eaj.na.lmusaafiruuna1: O&#249; sont les voyageurs) (Saidane, 2004):  
                                                 
</p>
<p>1 Suivant l'alphabet phon&#233;tique internationale IPA 96 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tahar SAIDANE, Mounir ZRIGUI, Mohamed BEN AHMED 
</p>
<p> 
</p>
<p> 
</p>
<p>Fig. 1. Exemple de syllabation 
</p>
<p>La probl&#233;matique de la s&#233;lection des unit&#233;s a &#233;t&#233; formalis&#233;e en utilisant des r&#232;gles. Ces r&#232;gles 
de syllabation peuvent se r&#233;sumer en ce qui suit : 
1. [CVV] ={V}+{V}+{C} : lorsqu'une consonne est suivie de deux voyelles les trois 
graph&#232;mes constituent une unit&#233; acoustique de notre syst&#232;me. 
2. [CV]={C}+{V}+{C} : lorsqu'une consonne est suivie d'une voyelle puis d'une 
consonne les deux premiers graph&#232;mes constituent une unit&#233; acoustique. 
3. [CC]={C}+{C}+{C} : lorsque nous avons une succession de trois consonnes les deux 
premiers graph&#232;mes constituent une unit&#233; acoustique. 
4. [C]={V}+{C}+{C} : lorsque nous avons deux consonnes suivies par une voyelle seul 
le premier graph&#232;me constitue une unit&#233; acoustique. 
5. [VV]={V}+{V} : lorsque nous avons une succession de deux voyelles, les deux 
constituent une unit&#233; acoustique. 
6. [V]={V} : lorsque nous avons une voyelle isol&#233;e elle constitue une unit&#233; acoustique. 
Il est &#224; noter que l'ordre d'application de ces r&#232;gles ainsi &#233;tablies est tr&#232;s important pour une 
bonne syllabation et donc une meilleure concat&#233;nation sonore (Emerard, 1977). Ces six r&#232;gles 
de syllabation &#233;labor&#233;es vont imposer les types d'unit&#233;s acoustiques &#224; utiliser pour la synth&#232;se 
de la parole. Le dictionnaire ainsi &#233;tabli contient 196 unit&#233;s acoustiques suffisantes pour la 
r&#233;alisation des diff&#233;rentes occurrences possibles. Le nombre de phon&#232;mes est de 28, le 
nombre de diphones est de 84 et le nombre de triphones est de 84.N&#233;anmoins, la pratique et 
l'&#233;tude de la langue arabe ont permis de d&#233;gager une dizaine d'autres unit&#233;s dues 
principalement aux contraintes de la langue.  
Le module de concat&#233;nation a besoin de la totalit&#233; des unit&#233;s acoustiques sous la forme 
d'enregistrements sonores (Lemmety, 2000). Ces enregistrements constituent le dictionnaire 
de notre syst&#232;me. Le dictionnaire d'unit&#233;s acoustiques ainsi &#233;tabli a une taille de 9 M&#216; (en 
moyenne un phon&#232;me prend 20 k&#216;, un diphone 40 k&#216; et un triphone 60 k&#216;). 
</p>
<p> 
</p>
<p>Fig. 2. Un exemple de traitement pour l'obtention du triphone &#171; saa &#187;  
</p>
<p>eaj.na.lmusaafiru ea  j.  na  .l  mu  saa  fi  ru&#1614;&#1606;&#1608;&#1615;&#1585;&#1616;&#1601;&#1575;&#1614;&#1587;&#1615;&#1605;&#1604;&#1575; &#1614;&#1606;&#1618;&#1610;&#1614;&#1571; 
</p>
<p>.lmusaafiruu .l  mu  saa  fi  ruu&#1614;&#1606;&#1608;&#1615;&#1585;&#1616;&#1601;&#1575;&#1614;&#1587;&#1615;&#1605;&#1604;&#1575; 
</p>
<p>saa
</p>
<p>saa.wav ma  saa  fa  tu&#1612;&#1577;&#1614;&#1601;&#1575;&#1614;&#1587;&#1614;&#1605; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de lissage lin&#233;aire pour la synth&#232;se de la parole arabe : Discussion des r&#233;sultas 
obtenus 
</p>
<p>4 LA CONCATENATION 
Pour notre syst&#232;me nous avons voulu commencer par un traitement de lissage temporel pour 
mesurer l'effet d'un post traitement sur la qualit&#233; de la parole obtenue. Apr&#232;s l'analyse des 
diff&#233;rentes unit&#233;s acoustiques de l'arabe, il s'av&#232;re que celles-ci pr&#233;sentent une att&#233;nuation aux 
niveaux de leurs extr&#233;mit&#233;s. L'id&#233;e retenue consiste alors &#224; proc&#233;der, lors de la concat&#233;nation, 
&#224; une accentuation aux niveaux d'un certain nombre de valeurs d'extr&#233;mit&#233;s avant le collage 
en bout &#224; bout. Ce traitement touchera &#233;videment la fin de la premi&#232;re unit&#233; et le d&#233;but de la 
suivante.Un signal num&#233;rique de la parole &#233;tant : 
</p>
<p>&#8721; &#8722;= N n nTtsts 1 )()( &#948;  (1) 
s(t) : signal num&#233;ris&#233; de la parole (&#233;chantillonn&#233;), sn = s(nT) : la valeur du signal &#224; l'instant nT 
et &#948;(t) : impulsion de Dirac. La concat&#233;nation de deux unit&#233;s sera : 
</p>
<p>&#8721;&#8721; &#8722;+&#8722;=+= M nN n nTtsnTtstststs 1 21 121 )()()()()( &#948;&#948;  (2) 
L'id&#233;e consiste alors &#224; isoler X valeurs du premier signal et Y valeurs du second. Ces valeurs 
subiront alors une att&#233;nuation proportionnelle d&#233;finie par : 
</p>
<p>Ki
K
</p>
<p>iKss i
att&#233;nu&#233;
i ..1=&#8722;=  (3) 
</p>
<p>Le r&#233;sultat se pr&#233;sentera sous la forme : 
</p>
<p>&#8721;&#8721; &#8721; &#8721; &#8722;+&#8722; +&#8722; &#8722;+&#8722;&#8722;+&#8722;&#8722;+&#8722;= YMY nXN N XN Y nnn nTtsnTtY nYsnTtN nNsnTtsts 1 21 1 1 211 )()()()()( &#948;&#948;&#948;&#948;  (4) 
La fonction d'att&#233;nuation ainsi d&#233;finie a &#233;t&#233; appliqu&#233;e pour un nombre de points repr&#233;sentants 
10 % de la dur&#233;e du signal de l'unit&#233; acoustique. Les r&#233;sultats obtenus sont montr&#233;s en ce qui 
suit : 
</p>
<p> 
</p>
<p>Fig. 3. Effet du lissage temporel sur la forme d'onde au niveau des points de discontinuit&#233;s. 
</p>
<p>Lissage10%  et pause 
</p>
<p>Lissage 10% 
</p>
<p>Sans lissage </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tahar SAIDANE, Mounir ZRIGUI, Mohamed BEN AHMED 
</p>
<p>Les courbes pr&#233;c&#233;dentes montrent l'effet de ce lissage temporel sur un exemple de synth&#232;se 
du mot &#171; &#1612;&#1577;&#1614;&#1601;&#1575;&#1614;&#1587;&#1614;&#1605; &#187; (masaafatun : distance). En effet, la premi&#232;re courbe montre une 
concat&#233;nation bout &#224; bout nous y constatons une discontinuit&#233; flagrante aux niveaux des 
points de jointures. La courbe du bas introduit, quant &#224; elle, le r&#233;sultat d'une concat&#233;nation 
liss&#233;e et la fluidit&#233; aux niveaux des points de concat&#233;nation. Le r&#233;sultat obtenu a sensiblement 
am&#233;lior&#233; la qualit&#233; de la voix synth&#233;tis&#233;e. N&#233;anmoins, nous constatons un chevauchement 
entre les unit&#233;s. Pour &#233;viter un tel probl&#232;me nous avons introduit un temps de silence de 10 
milli&#232;mes de seconde. L'insertion d'une pause entre les unit&#233;s avec nous a alors permis 
d'obtenir une meilleure intelligibilit&#233;. 
</p>
<p>5 RESULTATS DES TESTS 
Afin d'&#233;valuer notre syst&#232;me, nous avons &#233;tabli une proc&#233;dure de test bas&#233;e sur l'&#233;coute et 
l'identification de phrases synth&#233;tis&#233;es. Nous avons utilis&#233; 20 phrases, soit 53 mots, 211 
unit&#233;s acoustiques dont 73 diff&#233;rentes ce qui constitue 37.2 % de la totalit&#233; des unit&#233;s 
acoustiques qu'utilise notre syst&#232;me. Nous les avons fait &#233;couter &#224; 8 personnes (4 femmes et 4 
hommes) ce qui a permis une &#233;valuation statistique r&#233;aliste du r&#233;sultat. Chaque phrase est 
&#233;cout&#233;e trois fois, &#224; chaque passage le sujet doit orthographier ce qu'il entend. En ce qui suit 
les r&#233;sultats obtenu : 
</p>
<p>R&#233;sultats des tests
</p>
<p>0,0%
20,0%
40,0%
60,0%
80,0%
</p>
<p>100,0%
</p>
<p>1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
</p>
<p>1er Essai
2&#232;me Essai
3&#232;me Essai
</p>
<p>P hras es
</p>
<p>Taux de  
reco nna is s ance
</p>
<p> 
</p>
<p>Fig. 4. Les r&#233;sultats de la phase de test 
</p>
<p>Nous avons alors pu conclure &#224; un pourcentage d'identification de plus de 81 % d&#232;s la 
premi&#232;re &#233;coute, ce taux passe &#224; plus de 92% pour la troisi&#232;me phase. Par ailleurs nous avons 
remarqu&#233; qu'une phase d'adaptation de 2 &#224; 3 phrases a &#233;t&#233; n&#233;cessaire pour avoir une 
stabilisation des taux de reconnaissance. De ces relev&#233;s nous avons aussi constat&#233; que les 
mots non courants sont difficilement identifiables (exp : &#1615;&#1607;&#1614;&#1578;&#1618;&#1593;&#1614;&#1584;&#1614;&#1604; phrase n&#176; 4), et que quelques 
caract&#232;res sont plus difficiles que d'autres pour l'identification (exp :&#1584; phrase n&#176; 3, 4 et 11). 
</p>
<p>6 CONCLUSION 
Nous avons pr&#233;sent&#233; dans cet article notre syst&#232;me de synth&#232;se de la parole, ces diff&#233;rents 
constituants, les diff&#233;rentes phases de son &#233;laboration et les choix techniques retenus pour 
chaque module. Le module de syllabation constitue &#224; notre sens le point de d&#233;part pour une 
autre vision de la langue arabe, vue la rupture totale avec les m&#233;thodes jusque l&#224; utilis&#233;es en </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de lissage lin&#233;aire pour la synth&#232;se de la parole arabe : Discussion des r&#233;sultas 
obtenus 
</p>
<p>langue arabe. Nous avons aussi expos&#233; l'op&#233;ration de concat&#233;nation ainsi que le poste 
traitement que nous avons choisi pour rem&#233;dier aux probl&#232;mes de discontinuit&#233;s. 
</p>
<p>La comparaison des r&#233;sultats obtenus par rapport &#224; l'existant demeure difficile. Les travaux 
sur les syst&#232;mes de synth&#232;se de la parole arabe sont peu nombreux et les r&#233;sultats d'&#233;valuation 
ne font pas l'objet d'articles publi&#233;s. N&#233;anmoins nous avons relev&#233; que notre syst&#232;me a permis 
de se restreindre &#224; trois types de syllabes seulement (CVV, CV et C) contrairement aux autres 
travaux pr&#233;conisant cinq voir six types de syllabes diff&#233;rents (Ben Sassi, 2001). Nous 
n'utilisons que 196 unit&#233;s acoustiques pour synth&#233;tiser n'importe quelle occurrence de l'arabe 
standard alors que le minimum jusque l&#224; &#233;tait de 310 unit&#233;s (Elshafei, 2002).  
</p>
<p>R&#233;f&#233;rences 
</p>
<p>1 Zrigui M., Mili A, Jemni M. 1991. Vers un syst&#232;me automatique de synth&#232;se de la 
parole arabe, Maghrebin symposium on programming and system, Alger. p 180-197. 
</p>
<p>2 Saidane Tahar, Zrigui Mounir, Pr Ben Ahmed Mohamed. 2004. La Transcription 
Orthographique-Phon&#233;tique de la Langue Arabe. R&#201;CITAL 2004, F&#232;s, Maroc. 
</p>
<p>3 Emerard Fron&#231;oise. 1977. Les diphones et le traitement de la prosodie dans la 
synth&#232;se de la parole. Bulletin de l'institut de phon&#233;tique de grenoble. 
</p>
<p>4 Dutoit Thierry. 1993. High quality  text to speech synthesis of the french language. 
Th&#232;se. Facult&#233; polytechnique de Mons. 
</p>
<p>5  Elshafei M., Al-Muhtaseb, H., Al-Gamdi M. 2002. Techniques for high quality Arabic 
speech synthesis, Information sciences, Vol.140, 255-267. 
</p>
<p>6 Ben Sassi S., Braham R., Belgith A. 2001. Neural speech synthesis system for Arabic 
language using celp algorithm, Proc. Conference on Computer Systems and Applications. 
</p>
<p>7 Saidane Tahar, Haddad Ahmed, Zrigui Mounir, Pr Ben Ahmed Mohamed. 2004. 
R&#233;alisation d&#8217;un syst&#232;me hybride de synth&#232;se de la parole arabe utilisant un dictionnaire de 
polyphones. JEP-TALN 2004, Traitement Automatique de l&#8217;Arabe, F&#232;s, Maroc. 
</p>
<p>8 Boula de Mareuil Philippe, C&#233;l&#233;rier Philippe, Cesses Thierry, Fabre Serge, Jobin 
Carine, Le Meur Pierre-Yves, Obadia David, Soulage Beno&#238;t, Toen Jacques. 2001. Elan text 
to speech : un syst&#232;me multilingue de synth&#232;se de la parole &#224; partir du texte. Elan TTS 
Toulouse. 
</p>
<p>9 Lemmety Sami. 2000. Review of speech synthesis technology. Th&#232;se. Helsinki 
University of Technology. 
</p>
<p> 
</p>
<p> </p>

</div></div>
</body></html>