<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;tude de quelques probl&#232;mes de phon&#233;tisation dans un syst&#232;me de synth&#232;se de la parole &#224; partir de SMS</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>&#201;tude de quelques probl&#232;mes de phon&#233;tisation  
dans un syst&#232;me de synth&#232;se de la parole &#224; partir de SMS 
</p>
<p>R&#233;mi Bove1 
</p>
<p>&#201;quipe DELIC &#150;&#8211; Universit&#233; de Provence 
29, Av. Robert Schuman, 13621 Aix-en-Provence Cedex 1 
</p>
<p>remi.bove@voila.fr 
 
</p>
<p>Mots-clefs &#150;&#8211; Keywords  
</p>
<p>SMS, phon&#233;tisation, synth&#232;se de la parole. 
</p>
<p>SMS, phonetisation, speech synthesis. 
</p>
<p>R&#233;sum&#233; &#150;&#8211; Abstract  
</p>
<p>Cet article pr&#233;sente une &#233;tude dont l&#146;&#8217;objectif &#233;tait d&#146;&#8217;am&#233;liorer la phon&#233;tisation d&#146;&#8217;un syst&#232;me 
de synth&#232;se vocale de SMS en ce qui concerne trois types de probl&#232;mes : l&#146;&#8217;&#233;criture r&#233;bus 
(chiffres et lettres utilis&#233;s pour leur valeur phonique), les abr&#233;viations sous forme de 
squelettes consonantiques et les agglutinations (d&#233;terminants ou pronoms coll&#233;s 
graphiquement au mot qui suit). Notre approche se base sur l&#146;&#8217;analyse d&#146;&#8217;un corpus de SMS, &#224; 
partir duquel nous avons extrait des listes de formes permettant de compl&#233;ter les lexiques du 
syst&#232;me, et mis au point de nouvelles r&#232;gles pour les grammaires internes. Les modifications 
effectu&#233;es apportent une am&#233;lioration substantielle du syst&#232;me, bien qu&#146;&#8217;il reste, &#233;videmment, 
de nombreuses autres classes de probl&#232;mes &#224; traiter. 
</p>
<p>This article presents a study whose goal is to improve the grapheme-to-phoneme component 
of an SMS-to-speech system. The three types of problems tackled in the study are: rebus 
writing (digits and letters used for their phonetic value), consonant skeleton abbreviations and 
agglutinations (determiner or pronouns merged with the next word). Our approach is based on 
the analysis of an SMS corpus, from which we extracted lists of forms to enhance the 
system&#146;&#8217;s lexicons, and developed new grammatical rules for the internal grammars. Our 
modifications result in a substantial improvement of the system, although, of course, there 
remain many other categories of problems to address. 
</p>
<p>                                                 
1 Cette &#233;tude a &#233;t&#233; r&#233;alis&#233;e dans le cadre d&#146;&#8217;un contrat de recherche avec France T&#233;l&#233;com Division R&amp;D. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOVE R&#233;mi 
</p>
<p>1 Introduction 
La synth&#232;se automatique de la parole &#224; partir de texte permet la conversion d'un document 
&#233;crit en son &#233;quivalent parl&#233;. Depuis 1965 et l&#146;&#8217;apparition sur le march&#233; commercial d&#146;&#8217;un 
syst&#232;me de synth&#232;se vocale d&#233;velopp&#233; par IBM, les programmes informatiques visant &#224; 
synth&#233;tiser de la parole n&#146;&#8217;ont pas cess&#233; de s&#146;&#8217;am&#233;liorer et de se multiplier (D&#146;&#8217;Alessandro, 
2001). Les dispositifs actuels permettent de produire un signal acoustique de qualit&#233; jug&#233;e 
suffisante pour des applications nombreuses dans des domaines tels que l&#146;&#8217;aide aux personnes 
handicap&#233;es, le monitoring vocal, la communication homme/machine ou encore les services 
de t&#233;l&#233;communication. Cependant, les progr&#232;s potentiels restent vastes tant en termes 
d&#146;&#8217;am&#233;lioration du naturel de la voix qu&#146;&#8217;en termes d&#146;&#8217;am&#233;lioration de la restitution du contenu 
s&#233;mantique. Un effort particulier doit &#234;tre r&#233;alis&#233; sur l&#146;&#8217;analyse linguistique pour parvenir &#224; la 
vocalisation automatique d&#146;&#8217;un plus grand &#233;ventail de textes et en particulier celles des textes 
dits &#171; mal form&#233;s &#187; &#151;&#8212; il conviendrait sans doute de dire plut&#244;t &#171; non-standards &#187; &#151;&#8212; comme 
ceux issus des SMS.  
</p>
<p>Cette communication rend compte de notre collaboration avec l&#146;&#8217;&#233;quipe du laboratoire 
Langues Naturelles (LN) au sein de France T&#233;l&#233;com Recherche et D&#233;veloppement (FT R&amp;D, 
p&#244;le bas&#233; &#224; Lannion, C&#244;te d&#146;&#8217;Armor) sur le projet &#171; SMS2Voice &#187;. Celui-ci propose un 
dispositif de vocalisation de SMS d&#233;velopp&#233; par France T&#233;l&#233;com R&amp;D sous ma&#238;trise 
d&#146;&#8217;ouvrage partag&#233;e Orange et FDF (Fixe et Distribution France), bas&#233; sur le couplage entre un 
analyseur syntaxique et un module de synth&#232;se vocale. Le but de notre intervention &#233;tait de 
tenter d&#146;&#8217;am&#233;liorer au mieux la couverture actuelle du syst&#232;me, en &#233;tudiant le fonctionnement 
du dispositif et en ciblant les traitements &#224; effectuer. Les r&#233;sultats de ce travail sont expos&#233;s 
dans ce papier. 
</p>
<p>2 SMS et synth&#232;se de la parole 
Le SMS (acronyme de Short Message Service) est un service d&#146;&#8217;&#233;change de messages &#233;crits 
(limit&#233;s &#224; 160 caract&#232;res), propos&#233; par tous les op&#233;rateurs de t&#233;l&#233;phonie mobile. 
La vocalisation automatique de SMS a de nombreuses applications. Elle int&#233;resse tout d&#146;&#8217;abord 
les diff&#233;rents op&#233;rateurs de t&#233;l&#233;phonie mobile pour la r&#233;ception de SMS sur poste fixe. La 
synth&#232;se vocale &#224; partir de SMS pourrait &#233;galement rendre ceux-ci accessibles aux aveugles et 
malvoyants. Enfin, la technologie aurait un int&#233;r&#234;t non n&#233;gligeable pour tous les m&#233;tiers o&#249; les 
mains sont occup&#233;es (par exemple, les chauffeurs routiers) et pour lesquels il serait plus 
pratique de pouvoir &#233;couter ses messages plut&#244;t que de les lire. 
</p>
<p>Lorsqu&#146;&#8217;on s&#146;&#8217;int&#233;resse &#224; ce type de messages, on se rend rapidement compte que ceux-ci 
pr&#233;sentent de nombreuses particularit&#233;s linguistiques probl&#233;matiques pour la vocalisation 
(Anis, 2001, 2002 ; Guimier de Neef &amp; V&#233;ronis, 2004). Il suffit pour s&#146;&#8217;en convaincre 
d&#146;&#8217;&#233;couter la sortie produite par un synth&#233;tiseur sur des messages tels que : 
</p>
<p>dsl ma bel! ms c derni&#233; tps jav&#233; pa tro le tps 
(D&#233;sol&#233; ma belle ! Mais ces derniers temps j&#146;&#8217;avais pas trop le temps.) 
 
slt jsp ke tt va bi1 
(Salut, j&#146;&#8217;esp&#232;re que tout va bien. ) 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#232;mes de phon&#233;tisation dans un syst&#232;me de synth&#232;se de la parole &#224; partir de SMS 
</p>
<p>Si les proc&#233;d&#233;s d&#146;&#8217;&#233;criture employ&#233;s dans les SMS sont divers et nombreux (nous renvoyons le 
lecteur &#224; Anis, 2002, pour une &#233;tude analytique du domaine), ils ne sont pas tous 
probl&#233;matiques pour un traitement automatique. Il est possible de dresser des listes 
exhaustives pour les sigles par exemple (SMS, RER, &#133;&#8230;). En revanche, d'autres ph&#233;nom&#232;nes 
sont productifs et ne peuvent &#234;tre r&#233;gl&#233;s par une simple liste. C'est notamment le cas des trois 
ph&#233;nom&#232;nes sp&#233;cifiques de l&#146;&#8217;&#233;criture SMS que nous exposons dans cette communication : 
l&#146;&#8217;&#233;criture r&#233;bus (chiffres et lettres), l&#146;&#8217;&#233;criture par squelettes consonantiques, et le proc&#233;d&#233; 
d&#146;&#8217;agglutination. Nous pensions en effet, apr&#232;s un relev&#233; syst&#233;matique des erreurs de 
vocalisation produites par SMS2Voice, qu&#146;&#8217;ils &#233;taient &#224; l&#146;&#8217;origine de nombreuses erreurs de 
traitement par l'analyseur linguistique (que nous d&#233;crivons plus bas). Ces proc&#233;d&#233;s sont 
pr&#233;sent&#233;s ci-dessous. 
</p>
<p>2.1 L&#146;&#8217;&#233;criture r&#233;bus 
</p>
<p>Nous entendons par &#171; r&#233;bus &#187; le proc&#233;d&#233; d&#146;&#8217;&#233;criture par lequel certaines s&#233;quences de lettres 
sont remplac&#233;es par un arrangement de chiffres et/ou de lettres correspondant au m&#234;me 
phon&#232;me que la s&#233;quence en question. Exemples2 :  
</p>
<p> 
2m1 = demain [r&#233;bus chiffre] 
</p>
<p>Kf&#233; = caf&#233; [r&#233;bus lettre] 
</p>
<p>2.2 Squelettes consonantiques 
</p>
<p>Nous consid&#233;rons comme squelettes consonantiques les mots dont les voyelles ont &#233;t&#233; 
supprim&#233;es, r&#233;duisant ainsi la forme &#224; une succession des consonnes principales du mot. 
Comme le souligne justement (Anis, 2002), nous savons depuis longtemps gr&#226;ce &#224; la th&#233;orie 
de l&#146;&#8217;information, que les consonnes ont une valeur informative plus forte que les voyelles. Le 
mot fran&#231;ais &#233;crit est fortement charpent&#233; autour des consonnes, dont certaines n&#146;&#8217;ont pas de 
contrepartie phonique. Exemples : 
</p>
<p> 
slt = salut  
</p>
<p>prtt = pourtant (notons que le &#171; n &#187; du son &#171; an &#187; n'est pas conserv&#233; alors que le &#171; t &#187; 
muet final l'est) 
</p>
<p>tjs = toujours (de la m&#234;me mani&#232;re ici le &#171; r &#187; pourtant prononc&#233; n&#146;&#8217;est pas conserv&#233; 
alors que le &#171; s &#187; muet l&#146;&#8217;est ) 
</p>
<p>2.3 Les agglutinations 
</p>
<p>Nous appelons enfin &#171; agglutination &#187; la formation d'un mot par la r&#233;union de deux ou 
plusieurs unit&#233;s lexicales (jpour&#233; = &#171; je pourrai &#187;). Il est &#224; noter que nous nous avons trait&#233; 
uniquement le cas des agglutinations binaires (combinaison de deux unit&#233;s). Le tableau 1 
donne un &#233;chantillon d&#146;&#8217;exemples pour les s&#233;quences d&#146;&#8217;agglutinations avec clitiques. 
</p>
<p>                                                 
2  Les exemples sont extraits du corpus sur lequel nous avons travaill&#233; et que nous pr&#233;sentons plus loin. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOVE R&#233;mi 
</p>
<p>Forme agglutin&#233;e Exemples de patrons observ&#233;s Exemples de formes 
</p>
<p>&#171; JE &#187; j + pronom j + verbe 
jte  (= je te) 
jsui (= je suis) 
</p>
<p>&#171; QUE &#187; 
(sous la forme &#171; KE &#187;) 
</p>
<p>k + article d&#233;fini 
k + pronom d&#233;monstratif 
k + pronom personnel 
</p>
<p>kle (= que le) 
kce (= que ce) 
ktu (= que tu) 
</p>
<p>Tableau 1 : Exemples d&#146;&#8217;agglutinations 
</p>
<p>3 Environnement technique 
Rappelons que cette &#233;tude porte sur l'am&#233;lioration du dispositif SMS2Voice. La figure 1 
repr&#233;sente globalement la structure de cette application. Notre travail a port&#233; sur la brique 
logicielle TiLT (TLiT ! TiLT, Traitement LInguistique de Textes ; cf. Guimier de Neef et 
al. 2002), d&#233;j&#224; en utilisation chez France T&#233;l&#233;com pour de nombreux projets (indexation et 
filtrage linguistique, r&#233;sum&#233; automatique, classement th&#233;matique, etc.), et qui constitue une 
v&#233;ritable &#171; bo&#238;te &#224; outils &#187; pour le Traitement Automatique des Langues. Un module permet 
de segmenter un texte d&#146;&#8217;entr&#233;e en mots ; ceux-ci sont ensuite soumis &#224; une analyse lexicale, 
morphologique, et &#233;ventuellement des corrections. Ces diverses informations sont ensuite 
traduites afin d&#146;&#8217;affecter une cat&#233;gorie grammaticale &#224; chaque type de mot, et pour pouvoir 
proc&#233;der &#224; une analyse syntaxique et s&#233;mantique des donn&#233;es ainsi trait&#233;es. Pour qu&#146;&#8217;il puisse 
fonctionner il lui faut donc (entre autre) : 
</p>
<p>! Des lexiques (avec informations morpho-flexionnelles pour l&#146;&#8217;association de chaque 
mot &#224; ces diff&#233;rentes analyses hors contexte) 
</p>
<p>! Des strat&#233;gies de corrections (pour la correction de formes erron&#233;es) 
</p>
<p>! Des grammaires (pour la d&#233;sambigu&#239;sation lexicale par exploration du contexte) 
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1 : Architecture g&#233;n&#233;rale du syst&#232;me SMS2Voice 
</p>
<p>Serveur 
PROLIX 
</p>
<p>(Reconnaissance 
de la langue) 
</p>
<p>TiLT 
(Pr&#233;traitement linguistique : 
</p>
<p>message SMS converti en 
fran&#231;ais standard) 
</p>
<p>Synth&#232;se vocale 
CVOX  
</p>
<p>(Fran&#231;aise, anglaise 
ou allemande) 
</p>
<p>SMS 
</p>
<p>Lexiques
</p>
<p>Processus Correctifs
</p>
<p>Grammaires
</p>
<p>&#133;&#8230;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#232;mes de phon&#233;tisation dans un syst&#232;me de synth&#232;se de la parole &#224; partir de SMS 
</p>
<p>Ce syst&#232;me est initialement pr&#233;vu pour analyser des textes au format &#171; standard &#187; et nous 
avons particip&#233; &#224; son adaptation aux traitements de textes non-standards. Le dispositif actuel 
&#233;tait op&#233;rationnel sur de nombreux points, mais son fonctionnement pouvait &#234;tre am&#233;lior&#233; 
pour certains ph&#233;nom&#232;nes &#233;tant encore partiellement trait&#233;s, tels que : 
</p>
<p>gcrai (j&#146;&#8217;essaierai) vocalis&#233; tel quel. 
attd (attend) vocalis&#233; tel quel. 
Deboulot (de boulot) traduit &#171; d&#233;boule &#187;. 
</p>
<p>A la suite des observations, nous nous sommes rendus compte que les syst&#232;mes de correction 
et les lexiques pr&#233;alablement en place pr&#233;sentaient certaines limites. C'est donc 
essentiellement sur ces deux modules que nous avons travaill&#233;. Il semblait donc important de 
poursuivre cette &#233;tude avec un travail sur corpus afin d&#146;&#8217;approfondir la connaissance des 
ph&#233;nom&#232;nes SMS choisis, et am&#233;liorer au mieux le syst&#232;me. 
</p>
<p>4 M&#233;thodologie et corpus 
Le premier pr&#233;requis important &#224; cette &#233;tude &#233;tait de disposer d&#146;&#8217;un corpus &#224; partir duquel il 
&#233;tait possible de faire un certain nombre d&#146;&#8217;observations et de traitements. Le corpus de SMS 
utilis&#233; dans cette &#233;tude a &#233;t&#233; r&#233;alis&#233; par des &#233;tudiants de l&#146;&#8217;Universit&#233; de Provence de 2000 &#224; 
2004 dans le cadre de travaux pratiques et de m&#233;moires. Celui-ci contient 13 400 messages 
repr&#233;sentant pr&#232;s de 156 620 mots. Ce volume de donn&#233;es reste &#233;videmment modeste, mais 
cela est principalement d&#251; &#224; la difficult&#233; de recueil des messages du fait de leur caract&#232;re 
intime et personnel pour de nombreux usagers. 
</p>
<p>A partir de ce corpus, nous  avons commenc&#233; par d&#233;gager des listes d&#146;&#8217;occurrences 
repr&#233;sentant les mots les plus fr&#233;quents selon divers crit&#232;res d&#146;&#8217;identification, afin d&#146;&#8217;&#233;tudier 
notamment si les formes les plus courantes &#233;taient les plus probl&#233;matiques ou non. Pour ce 
faire, nous avons compar&#233; les listes de mots extraites du corpus avec un lexique de fran&#231;ais 
standard de r&#233;f&#233;rence, le lexique MULTEXT (Ide &amp; V&#233;ronis, 1994). Le but de notre approche 
&#233;tait de voir pour chaque ph&#233;nom&#232;ne donn&#233; quelles sont les formes que le syst&#232;me est d&#233;j&#224; en 
mesure de traiter, et d&#146;&#8217;isoler ainsi les occurrences probl&#233;matiques pour leur appliquer le 
traitement ad&#233;quat en fonction de leurs particularit&#233;s (longueur, complexit&#233;, etc.). Pr&#233;cisons 
que notre analyse a port&#233; sur les lexiques (et donc sur des listes de mots hors contexte), ainsi 
que sur les processus correctifs. Nous avons donc travaill&#233; sur la production des corrections 
possibles et non sur le choix de celles-ci (qui rel&#232;ve plut&#244;t du module grammatical), afin 
d'assurer au mieux la conversion des forme SMS en fran&#231;ais standard. 
</p>
<p>4.1 Extraction des occurrences 
</p>
<p>La premi&#232;re &#233;tape pour &#233;tudier chacun des proc&#233;d&#233;s n&#233;cessite d&#146;&#8217;extraire le plus pr&#233;cis&#233;ment 
possible du corpus la liste des occurrences correspondant aux crit&#232;res d&#146;&#8217;identification du 
ph&#233;nom&#232;ne, par l&#146;&#8217;interm&#233;diaire d'expressions r&#233;guli&#232;res. Pour ce faire, nous avons mis en 
place des traitements qui permettent, &#224; partir de la liste des formes inconnues en fran&#231;ais 
standard, d&#146;&#8217;extraire le plus pr&#233;cis&#233;ment possible les formes voulues. L&#146;&#8217;op&#233;ration suivante 
consiste &#224; &#233;liminer manuellement les formes qui ont &#233;t&#233; extraites par le script sur une base </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOVE R&#233;mi 
</p>
<p>purement formelle, mais ne correspondent pas au ph&#233;nom&#232;ne recherch&#233;. En effet, la majorit&#233; 
des ph&#233;nom&#232;nes est difficile &#224; filtrer et &#224; extraire directement, et dans un premier temps nous 
ne pouvons nous baser que sur des indices pour les identifier. 
</p>
<p>4.2 &#201;tude quantitative 
</p>
<p>A la suite de l&#146;&#8217;&#233;tape d&#146;&#8217;extraction des occurrences, nous avons donc &#233;t&#233; contraint de proc&#233;der &#224; 
une phase de tri manuel des formes extraites pour ne garder que celles correspondant au 
patron voulu. Le tableau 2 donne, pour chacun des proc&#233;d&#233;s &#233;tudi&#233;s, les t&#234;tes de listes des 
occurrences (ainsi que leur fr&#233;quence d&#146;&#8217;apparition) lors de la premi&#232;re extraction, puis la liste 
des occurrences restantes &#224; traiter apr&#232;s filtrage manuel. 
 
</p>
<p>T&#202;TES DE LISTE POUR LES REBUS CHIFFRES 
</p>
<p>1&#232;re extraction de formes Formes restantes apr&#232;s filtrage manuel 
Fr&#233;quence Occurrence Fr&#233;quence Occurrence 
</p>
<p>63 2m1 63 2m1 
62 bi1 62 bi1 
35 2min 35 2min 
25 2main 25 2main 
17 2pui 17 2pui 
13 b1 13 b1 
13 1er 12 vi1 
12 vi1 10 qq1 
12 2m 7 dem1 
10 qq1 6 pl1 
</p>
<p> 
</p>
<p>T&#202;TES DE LISTE POUR LES REBUS LETTRES 
</p>
<p>1&#232;re extraction de formes Formes restantes apr&#232;s filtrage manuel 
Fr&#233;quence Occurrence Fr&#233;quence Occurrence 
</p>
<p>29 reCu 9 paC 
26 MonNum&#233;ro 4 pE 
9 paC 3 mR 
4 pE 2 vE 
4 gpVeuilz 2 trouV 
4 faCon 2 jaV 
3 mR 2 jV 
2 vE 2 danC 
2 trouV 2 creV 
2 reCus 2 cT </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#232;mes de phon&#233;tisation dans un syst&#232;me de synth&#232;se de la parole &#224; partir de SMS 
</p>
<p> 
</p>
<p>T&#202;TES DE LISTE POUR LES SQUELETTES CONSONANTIQUES 
</p>
<p>1&#232;re extraction de formes Formes restantes apr&#232;s filtrage manuel 
Fr&#233;quence Occurrence Fr&#233;quence Occurrence 
</p>
<p>209 sms 167 slt 
167 slt 145 svp 
145 svp 120 stp 
120 stp 52 qqch 
52 qqch 48 lgtps 
48 lgtps 39 rdv 
39 rdv 37 bcp 
37 bcp 35 jrs 
35 jrs 33 msg 
33 msg 29 tps 
</p>
<p> 
</p>
<p>T&#202;TES DE LISTE POUR LES AGGLUTINATIONS 
</p>
<p>1&#232;re extraction de formes Formes restantes apr&#232;s filtrage manuel 
Fr&#233;quence Occurrence Fr&#233;quence Occurrence 
</p>
<p>209 sms  55 jsui  
167 slt  42 jte  
145 svp  23 jt  
144 tro  20 jp  
132 ds  14 jme  
120 stp  12 jm  
97 st  11 ktu 
64 ms  10 1pe  
63 2m1  9 jvai  
60 ns  9 jtapel  
</p>
<p>Tableau 2 : T&#234;tes de liste des occurrences pour les diff&#233;rents proc&#233;d&#233;s 
</p>
<p>Pourcentage de formes pour chaque proc&#233;d&#233; par rapport au nombre total de 
formes SMS
</p>
<p>0%
</p>
<p>10%
</p>
<p>20%
</p>
<p>30%
</p>
<p>% de formes avant filtrage manuel 10% 0,60% 26,40% 7,25%
</p>
<p>% de formes apr&#232;s filtrage manuel 0,80% 0,14% 14,10% 1,10%
</p>
<p>Rebus Chiffres R&#233;bus Lettres Squelettes Agglutinations
</p>
<p> 
Figure 2 : Filtrage manuel  
</p>
<p>La figure 2 donne le r&#233;capitulatif statistique de nos observations pour chacun des ph&#233;nom&#232;nes 
&#233;tudi&#233;s, une fois le tri manuel effectu&#233;. Les pourcentages sont faibles mais restent en </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOVE R&#233;mi 
</p>
<p>proportion suffisante pour rep&#233;rer un nombre important de dysfonctionnements du syst&#232;me. 
On note qu&#146;&#8217;une grande partie des formes correspondant aux patrons d&#146;&#8217;extraction ne 
correspond pas aux proc&#233;d&#233;s recherch&#233;s, ce qui justifie une analyse linguistique manuelle. Un 
syst&#232;me automatique bas&#233; sur de tels patrons aurait des performances tr&#232;s faibles.  
</p>
<p>5 Etude qualitative et am&#233;lioration du syst&#232;me 
D&#232;s que les formes correspondant au proc&#233;d&#233; sont identifi&#233;es, il est n&#233;cessaire de v&#233;rifier si 
elles sont connues et correctement trait&#233;es par le syst&#232;me, afin d'am&#233;liorer les ressources de 
celui-ci. Pour cela nous avons recherch&#233; (&#224; l&#146;&#8217;aide de scripts &#224; base d'expressions r&#233;guli&#232;res) 
les listes d&#146;&#8217;occurrences extraites et non trait&#233;es par le syst&#232;me. Lorsque ces formes inconnues 
sont isol&#233;es, une strat&#233;gie de traitement doit &#234;tre adopt&#233;e. Deux possibilit&#233;s sont offertes (la 
d&#233;cision d&#233;pend g&#233;n&#233;ralement de la productivit&#233; du ph&#233;nom&#232;ne trait&#233;) :  
</p>
<p>- Figer l'encodage des formes SMS dans un lexique ; 
- Modifier les r&#232;gles des processus correctifs 
</p>
<p> 
Par exemple pour le cas des squelettes consonantiques, l'observation des listes extraites a 
permis de constater que bien que les occurrences soient fr&#233;quentes, elles pr&#233;sentent cependant 
une faible diversit&#233;. Les formes inconnues du syst&#232;me (slt, bcp, etc.) ont donc simplement 
&#233;t&#233; encod&#233;es dans le fichier des formes fig&#233;es. En revanche, des r&#232;gles ont &#233;t&#233; cr&#233;&#233;es pour les 
r&#233;bus et agglutinations. 
</p>
<p>Concernant le proc&#233;d&#233; d&#146;&#8217;&#233;criture r&#233;bus (chiffres et/ou lettres), nous avons ajout&#233; de nouvelles 
r&#232;gles phon&#233;tiques. Par exemple, une r&#232;gle de type 1 ! j&#238; donne la possibilit&#233; pour le chiffre 
&#171; 1 &#187; de correspondre &#224; la s&#233;quence &#171; ien &#187; (exemple : &#171; rev1 &#187; = reviens ; &#171; ch1 &#187; = chien ; 
etc.). Ce type de modification permet donc de g&#233;n&#233;rer un nouveau phon&#233;tiseur et d&#146;&#8217;am&#233;liorer 
ainsi la sortie produite lors de l&#146;&#8217;acc&#232;s au lexique (Tableau 3). 
</p>
<p>Avant modification du phon&#233;tiseur Apr&#232;s modification du phon&#233;tiseur 
&gt; v1 &gt; v1 
Mot analys&#233; : v1 Mot analys&#233; : v1 
Nombre de solutions : 10 Nombre de solutions : 12 
v1 v1 
vain vain 
vainc vainc 
vaincs vaincs 
vains vains 
vin viens 
vingt vient 
vins vin 
vint vingt 
v&#238;nt vins 
 vint 
 v&#238;nt 
</p>
<p>Tableau 3 : Exemple d&#146;&#8217;acc&#232;s au lexique 
</p>
<p>Pour le cas des agglutinations, on remarque que ce ph&#233;nom&#232;ne ne concerne que certains 
patrons syntaxiques (clitiques+verbe, d&#233;terminant+adj., etc.). Nous avons donc modifi&#233; et/ou 
ajout&#233; des r&#232;gles de grammaire adapt&#233;es.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#232;mes de phon&#233;tisation dans un syst&#232;me de synth&#232;se de la parole &#224; partir de SMS 
</p>
<p>Exemples : 
</p>
<p>((LETTRE_ELIDEE ADV_NEG_NE)(VERB))  
(pour le cas d&#146;&#8217;agglutination entre &#171; ne &#187; et un verbe, ex. : nviendrai) 
</p>
<p>((LETTRE_ELIDEE PREP)(VERB INF))  
(pour le cas d&#146;&#8217;agglutination entre pr&#233;position et verbe &#224; l&#146;&#8217;infinitif, ex. : dpartir) 
</p>
<p>Nous avons ensuite effectu&#233; diff&#233;rents tests de &#171;non-r&#233;gression &#187; afin de garantir la pertinence 
des modifications op&#233;r&#233;es. Ces tests consistent &#224; appliquer TiLT sur une s&#233;rie de fichiers 
sp&#233;cifiques (ex : messages avec syst&#233;matiquement le chiffre 2, la lettre d ou encore la forme 
interrogative &#171; eske &#187; [est-ce que]). Les fichiers de sortie permettent notamment de voir la 
diff&#233;rence entre les r&#233;sultats de l&#146;&#8217;ancien test et ceux de celui venant d&#146;&#8217;&#234;tre effectu&#233;. Cette 
phase est particuli&#232;rement importante car elle permet de s&#146;&#8217;assurer qu&#146;&#8217;il n&#146;&#8217;y a pas eu de 
probl&#232;me majeur avant de passer &#224; d&#146;&#8217;autres modifications sur les donn&#233;es, et elle permet de 
juger de la pertinence des am&#233;liorations apport&#233;es. 
</p>
<p>6 Conclusions / perspectives 
Le travail r&#233;alis&#233; a permis d&#146;&#8217;am&#233;liorer de fa&#231;on significative la performance du syst&#232;me 
SMS2Voice. Une &#233;valuation quantitative d&#233;taill&#233;e pourrait &#234;tre r&#233;alis&#233;e, mais sa mise en &#156;&#339;uvre 
aurait demand&#233; un effort important qui d&#233;passait le cadre qui nous &#233;tait imparti. De plus, une 
telle &#233;valuation serait plus pertinente &#224; entreprendre lorsque d&#146;&#8217;autres ph&#233;nom&#232;nes auront pu 
&#234;tre trait&#233;s (tels que ceux list&#233;s par Anis, 2003). Par une analyse qualitative syst&#233;matique, 
nous avons en effet pu mettre en &#233;vidence de nombreux points qui m&#233;ritent eux aussi 
am&#233;lioration. Au-del&#224; des interventions que nous avons d&#233;crites, nous avons pu proposer 
diff&#233;rentes grilles d&#146;&#8217;analyse et des typologies (morpho-lexicale, morpho-syntaxique, etc.) qui 
permettront de faciliter la suite de ce travail. 
</p>
<p>Quelques points restent &#224; am&#233;liorer pour les proc&#233;d&#233;s que nous avons trait&#233;s.  
Concernant le ph&#233;nom&#232;ne d&#146;&#8217;agglutination notamment, qui est soumis &#224; d'importantes 
contraintes linguistiques, diverses r&#232;gles grammaticales peuvent &#234;tre encore ajout&#233;es (par 
exemple, les observations men&#233;es sur les agglutinations binaires m&#233;ritent d&#146;&#8217;&#234;tre &#233;tendues au 
cas des agglutinations ternaires (ex : jtsouhaite [je te souhaite])).  Il reste &#233;galement un 
nombre important de formes et de proc&#233;d&#233;s que nous n&#146;&#8217;avons pas abord&#233;s et dont le traitement 
s&#146;&#8217;annonce extr&#234;mement d&#233;licat. Par exemple, une forme telle que &#171; 1dpdte &#187; (ind&#233;pendante) 
fait appel &#224; trois proc&#233;d&#233;s cumul&#233;s : 
</p>
<p>1. R&#233;bus avec chiffre : &#171; 1 &#187; (in-) 
2. R&#233;bus avec lettre : &#171; d &#187;  (-d&#233;-)  
3. Squelette consonantique : &#171; pdte &#187; (-pendante)  
</p>
<p>C'est &#233;galement le cas pour les squelettes consonantiques. Si la r&#233;duction aux consonnes 
concerne la totalit&#233; du mot, le ph&#233;nom&#232;ne est plut&#244;t limit&#233; (slt, bjr, vrmt, &#133;&#8230;). Il devient au 
contraire tr&#232;s productif lorsqu'il n'affecte que partiellement le mot. Par exemple, pour la forme 
&#171; sinc&#232;rement &#187; : s1c&#232;rmnt, s1cRmnt, sincRmnt, s1cRment, etc. 
</p>
<p>Ce type de combinaisons pose des probl&#232;mes de vocalisation difficilement r&#233;solubles dans 
l&#146;&#8217;&#233;tat actuel des connaissances. En effet, pour traiter de telles occurrences le syst&#232;me TiLT </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOVE R&#233;mi 
</p>
<p>devrait avoir simultan&#233;ment recours &#224; diverses strat&#233;gies de correction. La difficult&#233; vient de 
l&#146;&#8217;architecture modulaire du syst&#232;me (qui est d&#146;&#8217;ailleurs commune &#224; la plupart des syst&#232;mes de 
TAL actuels) : chaque module de correction int&#233;gr&#233; &#224; l&#146;&#8217;analyseur linguistique intervient de 
fa&#231;on ind&#233;pendante, s&#233;par&#233;ment des autres modules. Il n&#146;&#8217;y a pas de traitement global pour 
l&#146;&#8217;application des corrections, et l&#146;&#8217;application syst&#233;matique de toutes les combinaisons de 
modules produit une explosion combinatoire extr&#234;mement co&#251;teuse et n&#233;faste in fine &#224; la 
pr&#233;cision du syst&#232;me. 
</p>
<p>Il demeure donc de nombreux aspects int&#233;ressants pour des &#233;tudes futures. L&#146;&#8217;&#233;criture SMS 
n&#146;&#8217;est ni norm&#233;e, ni stable ; une vocalisation de qualit&#233; n&#233;cessite donc une explicitation de tout 
le message textuel quels que soient les proc&#233;d&#233;s d&#146;&#8217;&#233;criture employ&#233;s. Il est donc certainement 
n&#233;cessaire et important de poursuivre l&#146;&#8217;approfondissement des travaux de linguistique et de 
traitement automatique men&#233;s sur les donn&#233;es issues de SMS, ainsi que d&#146;&#8217;autres formes 
d&#146;&#8217;&#233;crit non standards qui utilisent des proc&#233;d&#233;s analogues (chats et e-mails, cf. Torzec, 2001). 
</p>
<p>Remerciements  
</p>
<p>Je tiens &#224; remercier Emilie Guimier de Neef qui a encadr&#233; ce stage au sein de France T&#233;l&#233;com, 
ainsi qu&#146;&#8217;&#224; toute l&#146;&#8217;&#233;quipe du laboratoire Langues Naturelles qui m&#146;&#8217;a accueilli. J&#146;&#8217;adresse 
&#233;galement tous mes remerciements &#224; Jean V&#233;ronis qui a dirig&#233; ce travail. Je leur suis 
reconnaissant pour leurs nombreux commentaires sur cet article.  
</p>
<p>R&#233;f&#233;rences  
</p>
<p>Anis, J. (2001). (Dir.), (2001), &#171; Parlez-vous texto ?&#187;, Paris : Le Cherche Midi &#201;diteur. 
</p>
<p>Anis, J. (2002), Communication &#233;lectronique scripturale et formes langagi&#232;res : chats et SMS. 
Actes des Quatri&#232;mes Rencontres R&#233;seaux Humains / R&#233;seaux Technologiques, Universit&#233; de 
Poitiers. [http://oav.univ-poitiers.fr/rhrt/2002/actes%202002/jacques%20anis.htm] 
</p>
<p>D&#146;&#8217;Alessandro. C. (2001). 33 ans de synth&#232;se de la parole &#224; partir de texte : une promenade 
sonore (1968-2001),  Traitement automatique de la parole, Vol. 42(1), pp. 297-321. 
</p>
<p>Guimier De Neef E., Boualem M., Chardenon C., Filoche P., Vinesse J. (2002), Natural 
Language processing software tools and linguistic data developped by France telecom R&amp;D, 
CDAC Conference, India. 
</p>
<p>Guimier de Neef, E. &amp; V&#233;ronis , J. (2004). 1 pw1 sr la kestion ;-). Journ&#233;e d'&#201;tude de 
l'ATALA &quot;Le traitement automatique des nouvelles formes de communication &#233;crite (e-mails, 
forums, chats, SMS, etc.)&quot;, Paris. 
</p>
<p>Ide, N., &amp; V&#233;ronis, J. (1994). MULTEXT (Multilingual Tools and Corpora), 14th 
International Conference on Computational Linguistics, COLING'94. Kyoto. 588-592. 
</p>
<p>Torzec, N., Moundenc, T., Emerard, F. (2001). Pr&#233;traitement et analyse linguistique dans le 
syst&#232;me de synth&#232;se TTS CVOX : Application &#224; la vocalisation automatique d&#146;&#8217;e-mails,  
Traitement automatique de la parole. Vol. 42(1), pp. 17-46. </p>

</div></div>
</body></html>