<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>De la linguistique aux statistiques pour indexer des documents dans un r&#233;f&#233;rentiel m&#233;tier</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005 
</p>
<p>De la linguistique aux statistiques pour indexer des documents dans 
un r&#233;f&#233;rentiel m&#233;tier  
</p>
<p>Wilfried Njomgue Sado (1,2), Dominique Fontaine (1) 
</p>
<p>(1) UMR CNRS 6599 Heudiasyc, Universit&#233; Technologie de Compi&#232;gne   BP 
20529, F-60205 Compi&#232;gne                                             
</p>
<p>{wilfried.njomgue-sado, dominique.fontaine}@hds.utc.fr  
(2) Suez Environnement CIRSEE P&#244;le Informatique M&#233;tier  
</p>
<p>38, rue du Pr&#233;sident Wilson, F-78230 Le Pecq 
</p>
<p>Mots-clefs &#8211; Keywords  
</p>
<p>Linguistique, indexation, recherche d&#8217;information, statistique 
</p>
<p>Linguistics, statistics, indexing, information processing 
</p>
<p>R&#233;sum&#233; &#8211; Abstract  
</p>
<p>Cet article pr&#233;sente une m&#233;thode d&#8217;indexation automatique de documents bas&#233;e sur une approche 
linguistique et statistique. Cette derni&#232;re est une combinaison s&#233;quentielle de l&#8217;analyse linguistique du 
document &#224; indexer par l&#8217;extraction des termes significatifs du document et de l&#8217;analyse statistique 
par la d&#233;composition en valeurs singuli&#232;res des mots composant le document. La pond&#233;ration des 
termes tire avantage de leur contexte local, par rapport au document, global, par rapport &#224; la base 
de donn&#233;es, et de leur position par rapport aux autres termes, les co-occurrences. Le syst&#232;me 
d&#8217;indexation pr&#233;sent&#233; fait des propositions d&#8217;affectations du document &#224; un r&#233;f&#233;rentiel m&#233;tier dont les 
th&#232;mes sont pr&#233;d&#233;finis. Nous pr&#233;sentons les r&#233;sultats de l&#8217;exp&#233;rimentation de ce syst&#232;me men&#233;e sur 
un corpus des p&#244;les m&#233;tiers de la soci&#233;t&#233; Suez-Environnement. 
</p>
<p>This article presents an automatic method of documents indexing based on a hybrid, linguistic 
statistical approach.  The proposed approach combines a linguistic analysis of the document by the 
extraction of the significant terms of the document in conformity with the referential; and a statistical 
analysis of the same document decomposed into separed words.  Innovating weighting of terms is set 
to take judiciously advantage of both their position with respect to other terms (co-occurrence) and 
their local and global context. An application was developed in order to assign referential-based 
topics to documents. Finally, we will present experiments results and evaluation carried out on 
documents of Suez-Environnement Company. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>W. Njomgue Sado, D. Fontaine 
</p>
<p>1 Introduction 
</p>
<p>Les op&#233;rations de stockage et la diffusion des documents sur diff&#233;rents supports exigent au pr&#233;alable 
une indexation qui consiste &#224; r&#233;duire le contenu s&#233;mantique de chaque document. La Direction 
Technique et de Recherche de Suez-Environnement a initi&#233; un projet de gestion des connaissances 
dont l&#8217;objectif principal est de concevoir un outil qui permette &#224; tout utilisateur d&#8217;introduire de 
nouveaux documents dans la base de donn&#233;es de l&#8217;Intranet du groupe. La particularit&#233; de ce projet 
r&#233;side dans l&#8217;existence d&#8217;un r&#233;f&#233;rentiel m&#233;tier qui a &#233;t&#233; &#233;labor&#233; il y a quelques ann&#233;es et est 
constamment mis &#224; jour. Il s&#8217;agit d&#8217;une taxonomie qui d&#233;crit l'ensemble des activit&#233;s et m&#233;tiers de 
l'entreprise. Avant de mettre un document dans la base de donn&#233;e, son auteur doit identifier au mieux 
le sujet du document, en fonction des activit&#233;s qui en caract&#233;risent la s&#233;mantique. Cette t&#226;che 
d&#8217;indexation s&#8217;av&#232;re fort fastidieuse : en effet, l&#8217;auteur est d&#8217;abord cens&#233; conna&#238;tre la plupart des 
activit&#233;s de l&#8217;entreprise, hypoth&#232;se fort risqu&#233;e, puis &#233;laborer sa propre repr&#233;sentation du document, 
et enfin choisir certains m&#233;tiers du r&#233;f&#233;rentiel parmi la multitude des possibilit&#233;s. Il est donc essentiel 
de r&#233;duire le temps n&#233;cessaire &#224; l'accomplissement de cette t&#226;che, en l'automatisant partiellement ou 
totalement. La plupart des syst&#232;mes n&#8217;indexent pas de fa&#231;on totalement autonome les textes 
num&#233;ris&#233;s, on parle alors d&#8217;indexation semi-automatique. Notre syst&#232;me propose une liste ordonn&#233;e 
d&#8217;affectations possibles du nouveau document &#224; des m&#233;tiers du r&#233;f&#233;rentiel afin que l&#8217;auteur puisse 
opter pour une ou plusieurs d&#8217;entre elles.  
</p>
<p>Le pr&#233;sent article a pour objectif principal de pr&#233;senter un processus d&#8217;indexation qui permet 
d&#8217;analyser chaque document et de d&#233;terminer les affectations possibles en fonction des m&#233;tiers du 
r&#233;f&#233;rentiel. Il pr&#233;sente d&#8217;abord la m&#233;thode d&#8217;indexation automatique, ensuite &#233;value la m&#233;thode sur 
une collection de documents, et conclut sur quelques perspectives. 
</p>
<p>2 Une m&#233;thode d&#8217;indexation automatique 
</p>
<p>L'indexation pr&#233;sent&#233;e ici a pour but d&#8217;extraire les concepts identifiant au mieux le document, puis de 
le rattacher aux m&#233;tiers pr&#233;d&#233;finis au sein du r&#233;f&#233;rentiel. L&#8217;indexation du document est faite 
relativement aux activit&#233;s de l&#8217;entreprise, et non relativement aux mots du document. La contrainte 
suppl&#233;mentaire est la suivante : nous ne sommes pas responsables de l'int&#233;grit&#233; et de la pertinence de 
ce r&#233;f&#233;rentiel qui comporte des relations entre concepts dont la s&#233;mantique est pour le moins variable 
voire au pire indiscernable. En outre, il ne nous est pas permis de modifier cette structure. Nous 
sommes en mesure d&#8217;&#233;valuer syst&#233;matiquement les r&#233;sultats produits par le syst&#232;me. En effet, nous 
les comparons &#224; ceux fournis manuellement par l&#8217;auteur du document tout en faisant l&#8217;hypoth&#232;se que 
les propositions faites par l&#8217;auteur sont pertinentes et donc qu&#8217;elles ne sont pas &#224; remettre en cause. 
Cette contrainte est extr&#234;mement forte car la diversit&#233; des auteurs fait qu&#8217;ils n&#8217;ont pas toujours la 
m&#234;me compr&#233;hension du r&#233;f&#233;rentiel, d&#8217;o&#249; la n&#233;cessit&#233; de concevoir un syst&#232;me semi-automatique. 
</p>
<p>Pour accomplir cette t&#226;che, le processus d&#8217;indexation, consid&#233;r&#233; dans sa globalit&#233;, s&#8217;appuie &#224; 
diff&#233;rents moments sur le r&#233;f&#233;rentiel, et comporte trois phases principales, o&#249; s&#8217;encha&#238;nent 
successivement des traitements linguistiques, statistiques et s&#233;mantiques. Nous n&#8217;abordons dans cet 
article que les deux premi&#232;res phases, la phase de traitement s&#233;mantique, bas&#233;e sur l&#8217;exploitation 
d&#8217;une ontologie du domaine, &#233;tant encore en cours de finalisation. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De la linguistique aux statistiques pour indexer des documents dans un r&#233;f&#233;rentiel m&#233;tier 
</p>
<p>3 Analyse et traitement linguistique 
</p>
<p>Il s&#8217;agit ici d&#8217;extraire automatiquement les termes composant un document (S&#233;gu&#233;la, 2001 ; 
Bourigault, Jacquemin, 2000). Parmi la multitude d&#8217;outils ayant de tr&#232;s bonnes performances (Ana, 
Termino, Syntex, Intex, Acabit, etc.), Intex (Silberztein, 2001) a retenu notre attention car il permet 
d&#8217;int&#233;grer des dictionnaires sp&#233;cialis&#233;s, des grammaires de reconnaissance des syntagmes, r&#233;pondant 
en particulier &#224; nos besoins. Le traitement linguistique comprend alors s&#233;quentiellement des analyses 
morphologique, puis syntaxique, et s&#233;mantique, celui-ci se r&#233;duisant &#224; un regroupement 
morphologique et/ou synonymique des termes cl&#233;s). Dans le but de compl&#233;ter l&#8217;analyse linguistique, 
nous avons ins&#233;r&#233; un dictionnaire sp&#233;cialis&#233;, et des grammaires locales afin de d&#233;tecter, modifier ou 
r&#233;duire certaines abr&#233;viations afin de ne pas perdre l&#8217;information associ&#233;e aux abr&#233;viations. Pour 
r&#233;duire la taille des mots non lemmatis&#233;s, nous avons construit des grammaires de reconnaissances 
de certains lemmes. Des grammaires de corrections de certains mots erron&#233;s ont &#233;galement &#233;t&#233; 
mises sur pied afin de ne pas biaiser l&#8217;information du document.  
</p>
<p>Au terme de cette &#233;tape, nous obtenons deux fichiers texte : un fichier &#171; tagg&#233; &#187; Ftag , fichier o&#249; les 
lemmes non ambigus sont &#233;crits entre accolades et un fichier Flemme , fichier des termes lemmatis&#233;s et 
des occurrences associ&#233;es. Afin d&#8217;affiner les lemmes ainsi obtenus, nous appliquons premi&#232;rement un 
&#171; stemming &#187; sur le fichier Flemme pour obtenir le fichier que nous noterons FStemming. Le stemming est 
la r&#233;duction des formes de surfaces similaires &#224; un seul concept, par exemple &#171; inint&#233;ressant &#187;, 
&#171; int&#233;ressant &#187;, &#171; int&#233;r&#234;t &#187;, &#171; int&#233;ress&#233; &#187; seront r&#233;duits en &#171; int&#233;r&#234;t &#187;. Ce &#171; stemming &#187; s&#8217;est bas&#233; sur 
la liste des mots du r&#233;f&#233;rentiel m&#233;tier ayant pr&#233;alablement subie un &#171; stemming &#187; manuel. L&#8217;objectif 
de cette m&#233;thode est de donner plus d&#8217;importance aux termes m&#233;tiers du domaine. Ensuite, nous 
obtenons le fichier issu de la phase linguistique par application de la technique dite de &#171; stop-list &#187; sur 
le fichier FStemming (Table 1). Celle-ci consiste souvent &#224; dresser une liste de termes non soumis &#224; 
l&#8217;indexation. Ici, plut&#244;t que d&#8217;utiliser une liste pr&#233;d&#233;termin&#233;e, nous avons fait le choix d&#8217;&#233;carter les 
termes dont le nombre de caract&#232;res est inf&#233;rieur &#224; une valeur fix&#233;e empiriquement (3 est la valeur 
optimale obtenue par exp&#233;rience), consid&#233;rant que ce sont des termes de poids s&#233;mantiquement 
faibles (&#171; le &#187;, &#171; la &#187;, etc.), et donc peu int&#233;ressants &#224; &#234;tre index&#233;s. 
</p>
<p>Table 1. R&#233;sultats des applications des techniques de &#171; stemming &#187; et de &#171; stop-list &#187; 
</p>
<p> 
</p>
<p>4 Un traitement statistique 
</p>
<p>Nous pr&#233;sentons le processus statistique &#224; travers successivement la m&#233;thode de pond&#233;ration des 
termes existantes dans le document, la recherche des proximit&#233;s entre les termes fond&#233;e sur la notion 
de co-occurrence, et enfin l&#8217;application de la m&#233;thode du &#171; latent semantic indexing &#187;.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>W. Njomgue Sado, D. Fontaine 
</p>
<p>4.1 M&#233;thode de pond&#233;ration 
</p>
<p>Pour mettre en valeur un terme par rapport &#224; un autre, le syst&#232;me le pond&#232;re. Avant de proc&#233;der au 
choix de notre mod&#232;le de pond&#233;ration, il nous a paru utile de faire une rapide synth&#232;se des 
diff&#233;rentes m&#233;thodes existantes.  De toutes les pond&#233;rations existantes, (Singhal et al., 1996) 
affirment que la pond&#233;ration P1 a  est la plus int&#233;ressante parmi celles ne prenant pas en compte la 
composante globale pour la recherche d&#8217;information. Pour celles qui prennent en compte cette 
composante, P2 a  est int&#233;ressante d&#8217;apr&#232;s (Faraj et al., 1996). La composante globale est le facteur 
qui permet d&#8217;accorder un poids plus important aux termes discriminants qui apparaissent moins 
fr&#233;quemment dans la collection des documents.  
</p>
<p>Nous noterons par Pf a  le poids du terme a du profil lexical Plex ; Ci,j le poids de co-occurrence du 
couple des termes (ui , uj) ; Pi le poids du terme ui dans le document ; nc le nombre de fois o&#249; les 
termes ui, et uj apparaissent ensemble ; ni le nombre de fois o&#249; le terme ui appara&#238;t seul, N le 
nombre de documents dans la base de donn&#233;e ; tf i l&#8217;occurrence du mot i dans un document ; dfj le 
nombre de documents dans lequel le terme j appara&#238;t.  
</p>
<p>P1 a = [ )log(1 atf+ ]x [
</p>
<p>&#229;
=
</p>
<p>+
n
</p>
<p>tf
1
</p>
<p>2)]log(1[
</p>
<p>1
</p>
<p>a
a
</p>
<p>]   et  P2 a  = [ )log(1 atf+ ] x [ )log(
adf
</p>
<p>N ]                 
</p>
<p>Nous d&#233;finissons alors, &#224; partir de ces deux pond&#233;rations, une m&#233;thode de pond&#233;ration par &#233;tude de 
cas (Table 2). Cette pond&#233;ration est normalis&#233;e dans [0,1]. On dira que la valeur de la pond&#233;ration 
est respectivement faible, moyenne et forte si cette valeur est incluse dans [0 ;0.25],] 0.25 ; 0.75[, 
[0.75 ; 1]. Tous les termes du fichier linguistique sont soumis &#224; cette m&#233;thode.  
</p>
<p>Table 2. Pond&#233;ration d&#233;finitive des termes. Max(P1 a ,P2 a ) et Min(P1 a ,P2 a ) d&#233;signent 
respectivement le maximum et le minimum entre les pond&#233;rations P1 a  et P2 a . 
</p>
<p> 
</p>
<p>4.2 Approche matricielle : adaptation du &#171; Latent Semantic indexing &#187; 
</p>
<p>Plusieurs applications dans le domaine de la recherche d&#8217;information (RI), de la classification des 
documents, du filtrage d&#8217;information (Deerwester et al., 1990 ; Dumais et al., 1996) ont &#233;t&#233; 
d&#233;velopp&#233;es selon l&#8217;approche matricielle du &#171; Latent Semantic Indexing &#187; (LSI) qui forunit de 
meilleurs r&#233;sultats par rapport aux m&#233;thodes standards. Ici, on suppose qu'il y a une structure 
&#171; latente &#187;, &#224; caract&#232;re &#171; s&#233;mantique &#187;, dans l&#8217;usage des mots d&#8217;un document qu&#8217;on r&#233;v&#232;lera par la 
d&#233;composition en valeur singuli&#232;re du LSI. Le plus souvent, la matrice (&#171; unit&#233;s lexicales &#187; x &#171; unit&#233;s 
textuelles &#187;) est le point de d&#233;part de cette m&#233;thode. Dans le cas pr&#233;sent&#233;, nous utilisons 
respectivement les th&#232;mes de ce r&#233;f&#233;rentiel et les termes du profil lexical pour d&#233;finir les unit&#233;s </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De la linguistique aux statistiques pour indexer des documents dans un r&#233;f&#233;rentiel m&#233;tier 
</p>
<p>Le rappel est le nombre de documents pertinents retourn&#233;s par rapport au nombre total de documents pertinents. 
</p>
<p>textuelles et les unit&#233;s lexicales et obtenir ainsi une matrice Termes-Th&#232;mes not&#233;e XTermes,Th&#232;mes=(Xi,j). 
Ainsi, la s&#233;mantique d&#8217;un document est consid&#233;r&#233;e comme une combinaison lin&#233;aire (Dumais et al., 
1996) du contenu des th&#232;mes du domaine ainsi que du sens des termes associ&#233;s. Notre but &#233;tant 
d&#8217;affecter un document par son contenu au r&#233;f&#233;rentiel, il est pertinent de repr&#233;senter un document en 
liaison avec les th&#232;mes du domaine, un th&#232;me &#233;tant un chemin de l&#8217;arborescence qu&#8217;est le r&#233;f&#233;rentiel. 
Alors : 
</p>
<p>   avec   
</p>
<p> 
</p>
<p>Xi,j est la contribution du terme i du document au th&#232;me j, relativement au document &#224; indexer. Les 
colonnes de cette matrice repr&#233;sentent la distribution du sens de chaque th&#232;me pour le document. 
Tout document est une combinaison lin&#233;aire de la contribution s&#233;mantique des th&#232;mes repr&#233;sentant le 
domaine. Apr&#232;s d&#233;composition en valeurs singuli&#232;res (Husbands et al., 1996), la matrice r&#233;duite 
contient seulement les premiers composants lin&#233;aires ind&#233;pendants k de XTermes &#8211; Th&#232;mes avec 
</p>
<p>kss &#179;&#179; ...1 &gt; 0. Nous chiffrons num&#233;riquement chaque th&#232;me afin d&#8217;en extraire les plus 
repr&#233;sentatifs, en calculant la norme des colonnes de la matrice projet&#233;e des th&#232;mes obtenue. 
</p>
<p>5 Exp&#233;rimentations 
</p>
<p>Pour r&#233;aliser les exp&#233;riences, nous disposons d&#8217;embl&#233;e de documents issus du groupe &#233;crits en 
langage naturel libre : le fran&#231;ais ; et des affectations au r&#233;f&#233;rentiel propos&#233;es par les auteurs de ces 
documents.  Dans notre exp&#233;rience, nous avons &#224; notre disposition un ensemble de pr&#232;s de 450 
documents. Il y a 165 th&#232;mes possibles pour l&#8217;indexation d&#8217;un document. L&#8217;auteur fait un choix 
parmi les 15 th&#232;mes propos&#233;s par le syst&#232;me semi-automatique. Il s&#8217;av&#232;re, dans cette &#233;tude, que la 
moyenne de mots utiles dans un document est d&#8217;environ 700 mots. Le syst&#232;me d&#8217;indexation &#233;tant 
semi-automatique, le silence, (i.e.) le fait que le syst&#232;me n&#8217;extraie pas un th&#232;me sugg&#233;r&#233; par l&#8217;auteur, 
nous pr&#233;occupe davantage que le bruit. Il nous est alors apparu judicieux d&#8217;&#233;valuer le syst&#232;me 
(Table 3) en terme de rappel plut&#244;t que de pr&#233;cision.  
</p>
<p>Table 3. R&#233;sultats de l&#8217;exp&#233;rience : rappel 
</p>
<p> 
</p>
<p>A ce stade, ces r&#233;sultats sont plut&#244;t satisfaisants (77,09% de rappel) eu &#233;gard &#224; la difficult&#233; de la 
t&#226;che : un r&#233;f&#233;rentiel assez h&#233;t&#233;rog&#232;ne et impos&#233;, une grande diversit&#233; de documents, et un jeu de 
tests dont la pertinence n&#8217;est pas toujours av&#233;r&#233;e mais auquel il faut se conformer. Bien s&#251;r dans 
l&#8217;absolu, quelques probl&#232;mes de silence demeurent, notamment dans les cas o&#249; aucun terme du </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>W. Njomgue Sado, D. Fontaine 
</p>
<p>th&#232;me n&#8217;appara&#238;t dans le document, o&#249; le document est trop technique (pr&#233;sence de vid&#233;o au 
d&#233;triment du texte), et enfin o&#249; l'information au sein du document est implicite.  
</p>
<p>6 Conclusion et perspectives 
</p>
<p>Le bien fond&#233; de l&#8217;approche mixte &#224; savoir linguistique puis statistique est confirm&#233; &#224; travers cette 
&#233;valuation. D&#8217;abord, l&#8217;utilisation des grammaires, des techniques de lemmatisation, de stemming, de 
stop-list permet de r&#233;duire le document &#224; indexer &#224; un ensemble de mots jug&#233;s int&#233;ressants. Ensuite, 
un traitement statistique discrimine ces mots en raison de leurs occurrences et de leurs co-
occurrences, puis estime la proximit&#233; entre le document et les th&#232;mes du r&#233;f&#233;rentiel par le biais du 
LSI. 
</p>
<p>Cette &#233;valuation r&#233;v&#232;le quelques insuffisances en terme de pr&#233;cision et de silence. Ces insuffisances 
ont &#233;t&#233; signal&#233;es d&#232;s le d&#233;but du projet et nous nous proposons de les r&#233;sorber certes par des 
am&#233;liorations au traitement effectu&#233;, mais surtout par un traitement s&#233;mantique. A cet effet, nous 
mettons en place une ontologie du domaine de l&#8217;eau, sp&#233;cialis&#233;e de fa&#231;on &#224; r&#233;pondre &#224; nos besoins 
en mati&#232;re d&#8217;indexation. Les experts et auteurs de l&#8217;entreprise sont actuellement sollicit&#233;s dans cette 
phase de construction et au-del&#224; d&#8217;exploitation de l&#8217;ontologie.  
</p>
<p>R&#233;f&#233;rences  
</p>
<p>BOURIGAULT D., JACQUEMIN C. (2000): &#171; Construction des ressources terminologiques, In 
Ing&#233;nierie des langues &#187;, pp 215-230, 2000, ed. J.M. Pierrel. Hermes Sciences 
</p>
<p>DEERWESTER S., DUMAIS S., FURNAS G., LANDAUER T., HARSHMAN R. (1990): &#171; Indexing by 
Latent Semantic Analysis &#187;, Journal of Society for Information Science, Vol.41, n.6, pp. 391-
407, 1990 
</p>
<p>DUMAIS S., LETSCHE T., LITTMAN M., LANDAUER T. (1996): &#171; Automatic Cross-Language 
Retrieval using Latent Semantic Indexing &#187;, SigIR Multilingual IR Workshop, Aug. 22, 1996 
</p>
<p>FARAJ N., GODIN R., MISSAOUI R., DAVID S., PLANTE P. (1996): &#171; Analyse d&#8217;une m&#233;thode 
d&#8217;indexation automatique bas&#233;e sur une analyse syntaxique de texte &#187;, Canadian Journal of 
Information and Library Science / Revue l&#8217;information et de biblioth&#233;conomie, 1996 
</p>
<p>HUSBANDS P., SIMON H., DING H. (1996): &#171; On the use of Singular Value Decomposition for Text 
Retrieval &#187;, Proceeding&#8217;s of SIAM Comp. Information Retrieval Workshop, 2000.  
</p>
<p>SEGUELA P. (2001): Construction de mod&#232;les de connaissances par analyse linguistique de relations 
lexicales dans les documents techniques, 2001, Universit&#233; Toulouse III, France 
</p>
<p>SINGHAL A., SALTON G., BUCKLEY C. (1996): &#171; Length normalization in degraded text collections&#187;, 
Proceedings of Fifth Annual Symposium on Document Analysis and Information Retrieval, 
April 15-17, 1996, pp. 149-162. 
</p>
<p>SILBERZTEIN,M. (2001), Intex @ manual , 2000-2001. ASSTRIL - LADL, 201p  </p>

</div></div>
</body></html>