<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Acquisition semi-automatique de relations lexicales bilingues (fran&#231;ais-anglais) &#224; partir du Web</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005
</p>
<p>Acquisition semi-automatique de relations lexicales bilingues
(fran&#231;ais-anglais) &#224; partir du Web
</p>
<p>St&#233;phanie L&#233;on &amp; Chrystel Millon
</p>
<p>Equipe DELIC &#8211; Universit&#233; de Provence
29, Av. Robert Schuman &#8211; 13621 Aix-en-Provence Cedex 1
</p>
<p>fanny.leon@orange.fr, Chrystel.Millon@up.univ-mrs.fr
</p>
<p>Mots-clefs &#8211; Keywords 
Traduction, corpus, relations lexicales bilingues, acquisition semi-automatique, World Wide
Web.
</p>
<p>Translation, corpus, bilingual lexical relations, semi-automatic acquisition, World Wide Web.
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
Cet  article  pr&#233;sente  une  m&#233;thode  d&#8217;acquisition  semi-automatique  de  relations  lexicales
bilingues  (fran&#231;ais-anglais)  faisant  appel  &#224;  un  processus  de  validation  sur  le  Web.  Notre
approche consiste d&#8217;abord &#224; extraire automatiquement des relations lexicales fran&#231;aises. Nous
g&#233;n&#233;rons  ensuite  leurs  traductions  potentielles  gr&#226;ce  &#224;  un  dictionnaire  &#233;lectronique.  Ces
traductions sont enfin automatiquement filtr&#233;es &#224; partir de requ&#234;tes lanc&#233;es sur le moteur de
recherche Google.  Notre &#233;valuation sur 10 mots  fran&#231;ais  tr&#232;s polys&#233;miques montre que le
Web permet de constituer ou compl&#233;ter des bases de donn&#233;es lexicales multilingues, encore
trop rares, mais dont l&#8217;utilit&#233; est pourtant primordiale pour de nombreuses applications, dont
la traduction automatique.
</p>
<p>This  paper  presents  a  method of  semi-automatic  acquisition  of bilingual  (French-English)
lexical  relations using a validation  process via the Web.  Our approach consists  firstly of
automatically extracting French lexical relations. We then generate their potential translations
by means of an electronic dictionary. These translations are finally automatically filtered using
queries on the Google search engine. Our evaluation on 10 very polysemous French words
shows  that  the  Web  is  a  useful  resource  for  building  or  improving  multilingual  lexical
databases,  which  are  urgently  needed  in  a  wide  range  of  applications,  such  as  machine
translation.
</p>
<p>1 Introduction
Bien qu&#8217;elle ait &#233;t&#233; la premi&#232;re application non-num&#233;rique de l&#8217;informatique, la traduction
automatique a connu des d&#233;buts d&#233;cevants,  qui  ont jet&#233;  un discr&#233;dit  sur  cette technologie
pendant plusieurs d&#233;cennies. Toutefois, des progr&#232;s ont &#233;t&#233; accomplis au cours des derni&#232;res
ann&#233;es,  en  raison  de  l&#8217;av&#232;nement  du  Web  dans  un  contexte  fortement  multilingue,  de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on &amp; Chrystel Millon
</p>
<p>l&#8217;accroissement tr&#232;s important de la couverture des dictionnaires pr&#233;sents dans les syst&#232;mes de
traduction,  et  de la  prise en compte  d&#8217;un  nombre croissant  d&#8217;expressions  compos&#233;es.  Par
exemple, le syst&#232;me Systran1 traduit  d&#233;sormais correctement du fran&#231;ais vers l&#8217;anglais des
expressions telles que : 
</p>
<p>vol &#224; main arm&#233;e &#8594; armed robbery 
vol &#224; la roulotte &#8594; stealing from parked vehicles
</p>
<p>En revanche, d&#232;s que l&#8217;on sort de ces listes d&#8217;expressions fig&#233;es, on retombe rapidement dans
des erreurs de traduction qui g&#234;nent consid&#233;rablement la compr&#233;hension, et lui donnent m&#234;me
parfois un caract&#232;re surr&#233;aliste. Ainsi, Systran utilise la traduction la plus fr&#233;quente du mot
vol, c&#8217;est-&#224;-dire flight (VOL AERIEN), dans toutes les autres situations. Si r&#233;server un vol est
correctement traduit (to reserve a flight), commettre un vol est traduit par to make a flight, ce
qui est totalement incompr&#233;hensible dans ce contexte pour un anglophone. 
</p>
<p>Pourtant, la relation lexicale2 commettre-vol  est un indice d&#233;sambigu&#239;sateur tr&#232;s fort, qui, si
elle &#233;tait correctement traduite dans une base de donn&#233;es (to commit-theft), pourrait servir &#224;
g&#233;n&#233;rer  des  traductions  correctes.  La  combinatoire  est  toutefois  beaucoup  plus  ouverte
qu&#8217;avec les expressions compos&#233;es mentionn&#233;es plus haut et la constitution manuelle d&#8217;une
base  de  donn&#233;es  de  combinaisons  lexicales  &#224;  grande  &#233;chelle  est  une  t&#226;che  &#224;  peu  pr&#232;s
impossible.  Les  dictionnaires  bilingues  se  contentent  d&#8217;ailleurs  de  rares  indications
ponctuelles, se fiant au jugement du lecteur et &#224; sa connaissance du monde, que l&#8217;on ne peut
gu&#232;re esp&#233;rer d&#8217;une machine. 
</p>
<p>Afin de constituer de telles bases de donn&#233;es bilingues, de nombreux travaux se sont appuy&#233;s
sur  des  corpus  parall&#232;les  ou  align&#233;s3 (V&#233;ronis,  2000).  Toutefois,  ces  m&#233;thodes  pr&#233;sentent
diverses  limites :  de  telles  ressources  sont  peu  nombreuses  et  concernent  des  domaines
restreints. Le paysage est un peu plus souriant avec des corpus comparables4 (Morin, Dufour-
Kowalski et Daille, 2004), mais les contraintes restent fortes. 
</p>
<p>Le  Web,  qui  g&#233;n&#232;re  des  besoins  consid&#233;rables  de  traduction,  offre  en  m&#234;me  temps  un
r&#233;servoir gigantesque de donn&#233;es qui peuvent &#234;tre exploit&#233;es par des moyens automatiques, en
particulier gr&#226;ce &#224; des moteurs de recherche tels que Google ou Altavista. En se basant sur les
travaux  de  (Kilgarriff  &amp; Grefenstette,  2003),  on  peut  estimer  &#224;  environ  100  milliards  le
nombre de mots index&#233;s par Google pour la seule langue anglaise. M&#234;me si les donn&#233;es du
Web  sont  moins  contr&#244;l&#233;es,  et  donc  plus  &#171;  bruit&#233;es  &#187;,  elles  permettent  d&#8217;envisager  un
changement  radical  d&#8217;&#233;chelle  pour  les  m&#233;thodes  bas&#233;es  sur  les  donn&#233;es,  &#224;  condition  de
d&#233;velopper  des  m&#233;thodes  et  des  techniques  adapt&#233;es.  Depuis  quelques  ann&#233;es,  divers
domaines du TAL utilisent le Web en tant que ressource de donn&#233;es linguistique. (Cao &amp; Li,
2002) proposent une m&#233;thode automatique de g&#233;n&#233;ration et de s&#233;lection de traductions pour
les syntagmes nominaux de l&#8217;anglais vers le chinois &#224; partir du Web. Les r&#233;sultats montrent
que le Web peut &#234;tre utile tant pour l&#8217;acquisition de donn&#233;es que pour une aide &#224; la validation.
</p>
<p>1 http://www.systransoft.com/
2 Concernant la combinatoire lexicale, la litt&#233;rature pr&#233;sente une terminologie disparate et  souvent
</p>
<p>floue. Certains parlent de &#171; pr&#233;f&#233;rences lexicales &#187; (Wilks, 1975),  de &#171; restrictions de s&#233;lection &#187; (Katz &amp;
Fodor, 1964) ou encore de &#171; collocations &#187; (Benson, 1990 ; Smadja, 1993 ; Cruse, 1986). Afin de d&#233;signer ce
ph&#233;nom&#232;ne,  nous employons ici le terme &#171; relation lexicale &#187;, plus neutre, d&#233;fini comme une cooccurrence
lexicale entre deux lex&#232;mes li&#233;s syntaxiquement. 
</p>
<p>3 Ensemble  de  textes  align&#233;s  avec  leur  traduction  au  niveau  du  paragraphe,  de  la  phrase,  des
expressions ou des mots.
</p>
<p>4 Corpus de langues diff&#233;rentes traitant du m&#234;me domaine mais non parall&#232;les.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition semi-automatique de relations lexicales bilingues &#224; partir du Web 
</p>
<p>L&#8217;objectif de notre article est de proposer une m&#233;thodologie de validation semi-automatique
de traductions anglaises via le Web, &#224; partir de relations lexicales fran&#231;aises du type  NOM
ADJECTIF, NOM1 DE NOM2 et VERBE NOM(objet) extraites d&#8217;un corpus fran&#231;ais de pages
Web en langue g&#233;n&#233;rale. Pour revenir &#224; nos exemples  commettre un vol  et  r&#233;server un vol
(voir Figure 1), Google nous permet de valider les traductions correctes, gr&#226;ce &#224; leur nombre
d&#8217;occurrences. Par exemple, la requ&#234;te [&#8243;commit a flight&#8243; OR &#8243;commit the flight&#8243;] retourne
seulement 13 r&#233;sultats. La requ&#234;te [&#8243;commit a theft&#8243; OR &#8243;commit the theft&#8243;] retourne quant &#224;
elle 5110 r&#233;sultats. Parmi ces deux traductions candidates, les r&#233;sultats s&#233;lectionnent de fa&#231;on
&#233;crasante la relation lexicale satisfaisante (to commit-theft).
</p>
<p>Effectifs absolus Effectifs par million
flight theft flight theft
</p>
<p>commit 13 5510 0 306
reserve 33 500 3 592 0
</p>
<p>Figure 1 : Exemples de r&#233;sultats sur Google (janvier 2005)
</p>
<p>2 M&#233;thodologie et traitement des donn&#233;es
Notre &#233;tude comporte trois  &#233;tapes.  Nous proc&#233;dons d&#8217;abord &#224; une acquisition de relations
lexicales fran&#231;aises via un corpus de pages Web. Nous g&#233;n&#233;rons ensuite de fa&#231;on automatique
leurs traductions potentielles &#224; partir d&#8217;un dictionnaire &#233;lectronique. Nous interrogeons enfin
le moteur de recherche Google afin de valider ces derni&#232;res de fa&#231;on semi-automatique.
</p>
<p>2.1 Extraction automatique des relations lexicales fran&#231;aises
</p>
<p>Notre m&#233;thode a &#233;t&#233; test&#233;e sur la combinatoire lexicale de 10 noms fran&#231;ais tr&#232;s polys&#233;miques
(barrage, d&#233;tention, formation, lancement, organe, passage, restauration, solution, station et
vol).  Ces mots  ont &#233;t&#233; jug&#233;s comme les plus polys&#233;miques parmi 200 noms de fr&#233;quence
&#233;quivalente,  lors  du  projet  Senseval  (V&#233;ronis,  1998)  et  constituent  donc  un  banc de  test
difficile,  qui  a  &#233;t&#233;  utilis&#233;  par  la  suite  dans  divers  travaux.  Nous  exploitons  la  version
lemmatis&#233;e  et  &#233;tiquet&#233;e  morpho-syntaxiquement  du  corpus  de  pages  Web  francophones
&#233;labor&#233; par Jean V&#233;ronis (V&#233;ronis, 2003) autour de ces 10 noms. 
</p>
<p>L&#8217;acquisition automatique des relations lexicales fran&#231;aises de type NOM ADJECTIF, NOM1
DE NOM21 et VERBE NOM(objet) utilise une version am&#233;lior&#233;e du programme employ&#233; dans
(Millon, 2004), dans lequel des filtres linguistiques d&#8217;extraction sont utilis&#233;s (repr&#233;sentation
de patrons syntaxiques, filtres de candidats ind&#233;sirables). Les relations lexicales sont ensuite
soumises &#224; un seuil limite de fr&#233;quence fix&#233; &#224; au moins 10 occurrences, afin d&#8217;obtenir des
relations lexicales repr&#233;sentatives de besoins en lexicographie. En effet, un nombre important
de relations moins fr&#233;quentes sont  &#171; accidentelles &#187; (comme par exemple  barrage violet), et
non pertinentes pour notre &#233;tude. L&#8217;objectif est d&#8217;extraire une majorit&#233; de relations lexicales
&#171; propres &#187; du c&#244;t&#233; fran&#231;ais. A l&#8217;inverse, des relations lexicales caract&#233;ristiques sont perdues
(ainsi barrage hydraulique a une fr&#233;quence de 4). 
</p>
<p>Une cat&#233;gorisation s&#233;mantique  des  relations  lexicales  n&#8217;est  pas  r&#233;alis&#233;e,  car,  outre  qu&#8217;elle
serait extr&#234;mement difficile &#224; obtenir avec fiabilit&#233;, elle se perdrait lors de l&#8217;interrogation des
traductions potentielles dans Google. Pour une relation lexicale fran&#231;aise telle que vol de nuit,
l&#8217;objectif est de donner un ensemble d&#8217;&#233;quivalences en anglais qui refl&#232;tent soit des variations
</p>
<p>1 Le nom source peut se trouver en position NOM1 ou NOM2.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on &amp; Chrystel Millon
</p>
<p>lexicales pour un m&#234;me usage comme dans les traductions night flight et night flying (usage
VOL AERIEN), soit des usages diff&#233;rents comme l&#8217;exemple de night robbery (usage DELIT).
La Figure  2  donne  la  quantit&#233;  de  donn&#233;es  obtenues  apr&#232;s  filtrage  des  relations  lexicales
fran&#231;aises (seuil de fr&#233;quence). 
</p>
<p>RLs fran&#231;aises totales RLs Fran&#231;aises &#8805; 10
Occurrences % restant
</p>
<p>N ADJ 1332 113 8,48%
N DE N 1940 173 8,92%
V N 1278 57 4,46%
TOTAL 4550 286 6,29%
</p>
<p>Figure 2 : R&#233;sultats de l&#8217;extraction des relations lexicales sources
</p>
<p>2.2 G&#233;n&#233;ration automatique des traductions potentielles
</p>
<p>Les dictionnaires  courants  contiennent  un nombre tr&#232;s  restreint  de  ces  relations lexicales,
g&#233;n&#233;ralement les plus fig&#233;es. Ainsi, le  Collins Pocket French-English Dictionary disponible
dans l&#8217;&#233;quipe sous forme &#233;lectronique gr&#226;ce &#224; un accord avec l&#8217;&#233;diteur Collins, ne propose de
traduction  que  pour  6,6  %  des  relations  lexicales  fran&#231;aises  que  nous  conservons  apr&#232;s
filtrage,  telles  que  barrage routier traduit  par  roadblock ou  station baln&#233;aire  traduite  par
seaside resort. 
</p>
<p>Pour  chacune  des  relations  lexicales  fran&#231;aises  non  pr&#233;sentes  dans  le  dictionnaire,  nous
g&#233;n&#233;rons automatiquement toutes les traductions possibles via le  Collins Pocket. Reprenons
pour exemple r&#233;server-vol. Le Collins Pocket donne les traductions suivantes pour les unit&#233;s
lexicales sources vol et r&#233;server (unit&#233; lexicale source vers unit&#233; lexicale cible) : 
</p>
<p>vol &#8594; flight, theft, flying
r&#233;server &#8594; to reserve, to book 
</p>
<p>Notre programme g&#233;n&#232;re toute la combinatoire :
</p>
<p>r&#233;server un vol  &#8594; to reserve a flight, to reserve a theft, to reserve a flying, to book a
flight, to book a theft, to book a flying
</p>
<p>Afin d&#8217;avoir un ensemble de traductions le plus exhaustif possible, nous recensons &#233;galement
les  &#171; traductions  invers&#233;es &#187; des  unit&#233;s  lexicales  fran&#231;aises,  en  recherchant  ces  derni&#232;res
lorsqu&#8217;elles apparaissent en tant que traduction dans la version English-French, ce qui rajoute
parfois des traductions, comme pour vol :
</p>
<p>larceny, robbery, snatch &#8594; vol
</p>
<p>Lorsque le dictionnaire propose une traduction (par exemple vol libre &#8594; hand-gliding), nous
n&#8217;avons pas g&#233;n&#233;r&#233; de traduction suppl&#233;mentaire. Dans certains cas, comme pour  rampe de
lancement, traduite par  launch pad et  launching pad dans le dictionnaire, nous manquerons
quelques traductions correctes comme launching ramp et launch ramp.
</p>
<p>La Figure 3 donne la quantit&#233; de traductions potentielles g&#233;n&#233;r&#233;es et la proportion de celles-ci
par relation lexicale fran&#231;aise.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition semi-automatique de relations lexicales bilingues &#224; partir du Web 
</p>
<p>Traductions g&#233;n&#233;r&#233;es Moyenne par RL
fran&#231;aise
</p>
<p>N ADJ 1215 11
N DE N 5155 30
V N 1012 18
TOTAL 7382 19
</p>
<p>Figure 3 : R&#233;sultats de l&#8217;&#233;tape de g&#233;n&#233;ration des traductions candidates
</p>
<p>2.3 Interrogation automatique du moteur de recherche Google
</p>
<p>Le moteur de recherche Google a &#233;t&#233; interrog&#233; automatiquement &#224; l&#8217;aide de l&#8217;interface de
programmation d&#8217;applications API (Application Programming Interface)1 afin de r&#233;cup&#233;rer le
nombre d&#8217;occurrences2 de chaque relation lexicale anglaise candidate. Ces fr&#233;quences seront
utilis&#233;es lors de la validation3. 
</p>
<p>Pour chaque traduction potentielle, nous g&#233;n&#233;rons un ensemble de requ&#234;tes (voir Figure 4), en
consid&#233;rant  les  mots  de  la  requ&#234;te  comme  une  expression  exacte,  via  l&#8217;utilisation  des
guillemets. La recherche est restreinte aux pages Web de langue anglaise.
</p>
<p>Patron syntaxique source Requ&#234;te (en langue cible)
NOM ADJECTIF &quot;the ADJ NOM&quot; OR &quot;a ADJ NOM&quot;
VERBE NOM(objet) &quot;VERBE the NOM&quot; OR &quot;VERBE a NOM&quot;
NOM1 de NOM2 &quot;NOM1 of NOM2&quot;
</p>
<p>&quot;NOM2 NOM1&quot;
</p>
<p>Figure 4 : Patrons des requ&#234;tes des relations lexicales anglaises
</p>
<p>La combinaison bool&#233;enne pour les patrons syntaxiques de type NOM ADJECTIF et VERBE
NOM(objet) ram&#232;ne un ensemble de r&#233;sultats qui prend en compte les variations dues aux
changements d&#8217;article, comme dans l&#8217;exemple &quot;commit a theft&quot; OR &quot;commit the theft&quot;.
</p>
<p>L&#8217;utilisation  d&#8217;articles  dans  les  requ&#234;tes  du  patron  syntaxique  NOM  ADJECTIF permet
&#233;galement de r&#233;duire le probl&#232;me de l&#8217;ambigu&#239;t&#233; cat&#233;gorielle. Par exemple, complete peut &#234;tre
un adjectif  (entier, complet,  int&#233;gral,  total) ou un verbe (parfaire,  compl&#233;ter). La relation
lexicale  complete restoration est ambigu&#235;. L&#8217;ajout de l&#8217;article permet d&#8217;&#233;liminer les cas o&#249;
complete est un verbe. 
</p>
<p>Le patron syntaxique  NOM1 DE NOM2  pouvant  &#234;tre  traduit  par  diff&#233;rentes  structures en
anglais selon la relation s&#233;mantique consid&#233;r&#233;e entre les deux objets, nous traitons s&#233;par&#233;ment
deux types de structures dans les requ&#234;tes (Chuquet &amp; Paillard, 1987) : d&#8217;une part, le patron
N2 N1 marque une relation &#233;troite entre les deux noms et d&#8217;autre part, la structure N1 of N2
accorde la priorit&#233; &#224; l&#8217;&#233;l&#233;ment rep&#233;r&#233; (N2)4.
</p>
<p>1 http://www.google.com/apis/
2 Des diff&#233;rences ont &#233;t&#233; remarqu&#233;es entre le nombre de r&#233;sultats renvoy&#233;s par l&#8217;API et par l&#8217;interface
</p>
<p>web. Ce probl&#232;me a &#233;t&#233; mentionn&#233; dans divers forums, mais aucune explication n&#8217;a pu &#234;tre fournie. 
3 Pr&#233;cisons que si les fr&#233;quences de Google sont peu fiables dans le cadre de certaines configurations
</p>
<p>de requ&#234;tes dans &#171; tout le Web &#187; (http://aixtal.blogspot.com/2005/02/web-le-mystre-des-pages-manquantes-
de.html), ce probl&#232;me ne concerne pas l&#8217;utilisation que nous faisons de Google puisque nous limitons les
requ&#234;tes &#224; une langue donn&#233;e.
</p>
<p>4 Le cas du g&#233;nitif (N1&#8217;s N2) n&#8217;est pas pris en compte dans le cadre de cette &#233;tude.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on &amp; Chrystel Millon
</p>
<p>2.4 Validation semi-automatique des traductions potentielles anglaises
</p>
<p>2.4.1 Filtre automatique
</p>
<p>Afin de r&#233;duire le bruit, un filtre simple a &#233;t&#233; appliqu&#233; aux traductions restantes. Nous ne
conservons que celles dont la fr&#233;quence sur le Web est au moins &#233;gale &#224; un milli&#232;me des
occurrences du mot cible. Nous utilisons &#224; l&#8217;heure actuelle une m&#233;thode statistique simple qui
est concluante pour une premi&#232;re approche. Mais nous pouvons envisager par la suite d&#8217;autres
techniques  plus  &#233;labor&#233;es.  Prenons  pour  exemple  r&#233;server-vol  et  deux  de  ses  traductions
candidates book a/the flight et book a/the theft :
</p>
<p>Seuil_theft : 2150000 / 1000 = 2150
Seuil_flight : 5760000 / 1000 = 5760
</p>
<p>La relation lexicale book a/the flight (avec une fr&#233;quence de 244000, donc sup&#233;rieure au seuil
limite pour le nom cible flight) est retenue, tandis que book a/the theft (avec une fr&#233;quence de
61, donc inf&#233;rieure au seuil limite pour le nom cible theft) est rejet&#233;e. 
</p>
<p>Ce filtre provoque &#233;videmment parfois des cas de silence. Ainsi, &#224; partir de la relation lexicale
barrage hydro-&#233;lectrique, la traduction hydroelectric dam est retenue (fr&#233;quence de 3920 et
seuil &#224; 1910), tandis que hydroelectric barrage, &#233;galement valide, a une fr&#233;quence de 32 (pour
un seuil &#224; 139) et est rejet&#233;e. Notre approche favorise volontairement la pr&#233;cision, car il s&#8217;agit
de compl&#233;ter le plus automatiquement possible des ressources existantes. L&#8217;augmentation du
bruit obligerait &#224; un filtrage manuel des r&#233;sultats beaucoup plus long et co&#251;teux. Apr&#232;s le
filtre  automatique  sur  les  fr&#233;quences,  7,5  %  des  relations  anglaises  potentielles  sont
conserv&#233;es (Figure 5).
</p>
<p>2.4.2 Validation manuelle
</p>
<p>Une validation manuelle nous permet d&#8217;&#233;valuer les relations lexicales restantes apr&#232;s filtre
automatique, en faisant appel &#224; divers dictionnaires de langue, ainsi qu&#8217;&#224; nos connaissances.
Les traductions candidates les plus &#171; d&#233;licates &#187; sont v&#233;rifi&#233;es en contexte sur le Web, par
reformulation de la requ&#234;te &#224; travers Google, ainsi que soumises au jugement de plusieurs
locuteurs. Nous d&#233;taillons les r&#233;sultats dans la section suivante.
</p>
<p>Traductions Filtre automatique Validation manuelle
g&#233;n&#233;r&#233;es Filtre seuil fr&#233;quence Traductions valides
</p>
<p>N ADJ 1215 136 11,2% 132 97,1%
N DE N 5155 351 6,8% 270 76,9%
V N 1012 63 6,2% 56 88,9%
TOTAL 7382 550 7,5% 458 83,3%
</p>
<p>Figure 5 : R&#233;sultats de la validation des traductions
</p>
<p>3 Premiers r&#233;sultats 
La  pr&#233;cision  globale  des  traductions  extraites  est  de  83,3%.  La  m&#233;thode  fonctionne
particuli&#232;rement bien pour les patrons syntaxiques NOM ADJECTIF (97,1%) et VERBE NOM
(objet)  (88,9%) (Figure 6). Le patron  NOM1 DE NOM2  pose davantage de  difficult&#233;s  en
traduction (76,9%). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition semi-automatique de relations lexicales bilingues &#224; partir du Web 
</p>
<p>MOT N ADJ N de N V N TOTAL
SOURCE Nb to-
</p>
<p>tal
% valide Nb total % valide Nb total % valide Nb to-
</p>
<p>tal
% valide
</p>
<p>Barrage 39 94,9 33 81,8 19 94,7 91 90,1
D&#233;tention 15 100,0 114 80,7 5 100,0 134 83,6
Formation 16 100,0 76 72,4 4 75,0 96 77,1
Lancement 7 100,0 17 88,2 2 100,0 26 92,3
Organe 27 96,3 21 76,2 4 25,0 52 82,7
Passage 10 90,0 21 57,1 13 92,3 44 75,0
restauration 2 100,0 23 78,3 Pas de RL Pas de RL 25 80,0
Solution 14 100,0 5 100,0 8 100,0 27 100,0
Station 4 100,0 18 72,2 4 100,0 26 80,8
Vol 2 100,0 23 73,9 4 75,0 29 75,9
TOTAL 136 97,1 351 76,9 63 88,9 550 83,3
</p>
<p>Figure 6 : Pr&#233;cision globale des relations lexicales anglaises &#233;valu&#233;es
</p>
<p>La Figure 7 pr&#233;sente le nombre moyen de traductions valides par relation lexicale fran&#231;aise.
En moyenne, on obtient deux traductions correctes pour chaque relation lexicale fran&#231;aise.
</p>
<p>RLs
fran&#231;aises
</p>
<p>Traductions
valid&#233;es
</p>
<p>Moyenne
par RL
</p>
<p>N ADJ 63 132 2,1
N de N 124 270 2,2
V N 31 56 1,8
MOYENNE 218 458 2,1
</p>
<p>Figure 7 : Nombre moyen de traductions valides par relation lexicale fran&#231;aise
</p>
<p>La Figure 8 pr&#233;sente un exemple de traductions obtenues pour les relations lexicales barrage
hydro-&#233;lectrique, construction de barrage et construire-barrage. 
</p>
<p>PATRON RL FRANCAISE TRADUCTION
N ADJ barrage hydro-&#233;lectrique hydroelectric dam
N de N construction de barrage barrage building
</p>
<p>barrage construction
barricade building
barricade construction
dam building
dam construction
weir building
weir construction
</p>
<p>V N construire-barrage to build-barrage
to build-barricade
to build-dam
to build-roadblock
to construct-dam
to erect-barricade
to erect-roadblock
</p>
<p>Figure 8 : Traductions des relations lexicales de barrage
</p>
<p>Les traductions obtenues permettent de multiplier par 10 la quantit&#233; de relations lexicales d&#233;j&#224;
pr&#233;sentes en entr&#233;e dans le dictionnaire pour le patron NOM ADJECTIF, par 45 celles pour le
patron  NOM1 DE  NOM2  et  par  56  pour  le  patron  VERBE  NOM(objet).  L&#8217;apport  de  la
m&#233;thode est donc appr&#233;ciable.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on &amp; Chrystel Millon
</p>
<p>4 Analyse des probl&#232;mes et perspectives 
</p>
<p>4.1 Erreurs et difficult&#233;s
</p>
<p>Les erreurs et les limites de notre strat&#233;gie sont cat&#233;goris&#233;es selon les types de probl&#232;me et les
perspectives d&#8217;am&#233;lioration.
</p>
<p>4.1.1 Erreurs syntaxiques
</p>
<p>Certaines  erreurs  sont  dues  &#224;  des  probl&#232;mes  d&#8217;ambigu&#239;t&#233;  de  rattachement  syntaxique
concernant les traductions candidates test&#233;es sur l&#8217;API Google. Le moteur de recherche ne
permettant pas un acc&#232;s direct aux cat&#233;gories morpho-syntaxiques, une analyse syntaxique des
contextes des traductions candidates n&#8217;a pu &#234;tre r&#233;alis&#233;e. Prenons l&#8217;exemple suivant :
</p>
<p>The Library of Congress set the changeover date.
</p>
<p>La relation lexicale recherch&#233;e est set the changeover. Or dans ce cas, changeover est r&#233;gi par
le  nom  date et  non  par  la  forme  verbale  set.  Une  autre  limite  concerne  les  probl&#232;mes
d&#8217;ambigu&#239;t&#233; cat&#233;gorielle. Les formes en -ing, par exemple, sont propices &#224; ce type d&#8217;erreurs.
Une perspective d&#8217;am&#233;lioration  des  probl&#232;mes d&#8217;ordre syntaxique est  donc manifestement
l&#8217;application d&#8217;un analyseur syntaxique aux pages Web anglaises.
</p>
<p>Enfin,  il  arrive  qu&#8217;une  relation  lexicale  ne  soit  pas  traduite  par  une  structure  de  m&#234;me
longueur. Par exemple,  barrage routier se traduit par une unit&#233; lexicale simple :  roadblock.
La formation des mots compos&#233;s en anglais, avec ou sans espace ou tiret, est &#233;videmment un
cas extr&#234;mement difficile, mais on peut envisager de g&#233;n&#233;rer des requ&#234;tes du type N-N ou NN
(sans espace).
</p>
<p>4.1.2 Erreurs s&#233;mantiques
</p>
<p>Un type d&#8217;erreurs d&#8217;ordre s&#233;mantique concerne l&#8217;acquisition de relations lexicales anglaises
valides, mais non correspondantes &#224; la relation lexicale source, comme dans l&#8217;exemple : 
</p>
<p>cours de formation --&gt; group rate (59900 occurrences)
</p>
<p>Ici, group rate signifie tarif de groupe. 
</p>
<p>De  plus,  la  traduction  d&#8217;une  relation  lexicale  n&#8217;est  pas  toujours  obtenue  de  fa&#231;on
compositionnelle (Melamed, 2001, cit&#233; par Morin  et al., 2004). Par exemple, en anglais, il
n&#8217;existe  pas  une  traduction  litt&#233;rale  de  forcer  un  barrage :  la  traduction  va  d&#233;pendre  du
contexte situationnel (to drive through a roadblock, to run through a roadblock, etc.). 
</p>
<p>Une autre limite est due &#224; l&#8217;absence de certains usages dans le dictionnaire. C&#8217;est le cas par
exemple de l&#8217;acception sportive du nom barrage (playoff). Ainsi, la relation lexicale match de
barrage est traduite par weir game et barrage game au lieu de la traduction correcte playoff
game.
</p>
<p>4.1.3 Erreurs techniques
</p>
<p>Google ne prend pas en compte des ph&#233;nom&#232;nes tels que la ponctuation, les majuscules, ou la
marque du g&#233;nitif (&#8217;s), lors des recherches sur le Web. Certaines relations lexicales anglaises</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition semi-automatique de relations lexicales bilingues &#224; partir du Web 
</p>
<p>erron&#233;es, comme  to reserve-theft (fr&#233;quence de 3) n&#8217;ont pas une fr&#233;quence nulle pour cette
raison.  L&#8217;exemple  suivant  montre  que  les  mots  reserve et  a  theft appartiennent  &#224;  deux
syntagmes diff&#233;rents : 
</p>
<p>A man will face court next month charged with stealing three date palms from a Swansea reserve, a
theft which sparked three months of community outrage. 
</p>
<p>Le filtre  sur  les  fr&#233;quences  permet  d&#8217;&#233;liminer  une  partie  des  relations  lexicales  erron&#233;es.
N&#233;anmoins,  ces  probl&#232;mes  concernent  &#233;galement  des  traductions  correctes,  et  &#171; bruitent &#187;
quelque peu les fr&#233;quences de l&#8217;API Google1.
</p>
<p>4.2 Perspectives d'am&#233;lioration du protocole
</p>
<p>4.2.1 Changement de seuil de filtrage des relations lexicales fran&#231;aises 
</p>
<p>Les relations lexicales fran&#231;aises qui comptent moins de 10 occurrences au sein du corpus
sont  &#233;limin&#233;es.  Or,  un  certain nombre  de  relations  lexicales  correctes  ont  des  fr&#233;quences
inf&#233;rieures &#224; ce seuil. C&#8217;est le cas, par exemple pour l&#8217;usage sportif de  barrage (match de
barrage, barrage aller, barrage retour, etc.). L&#8217;algorithme HyperLex (V&#233;ronis, 2003, 2004)
nous  permettrait  d&#8217;identifier  les  usages  peu  fr&#233;quents  des  mots  (jusqu&#8217;&#224;  environ  1% des
occurrences). Une am&#233;lioration consisterait &#224; ajuster le seuil des relations lexicales fran&#231;aises
selon la fr&#233;quence de l&#8217;usage du nom concern&#233;. 
</p>
<p>4.2.2 Description des patrons syntaxiques de l&#8217;anglais
</p>
<p>Contrairement &#224; notre m&#233;thode d&#8217;extraction des relations lexicales fran&#231;aises, ne sont pris en
compte que les patrons de &#171; base &#187; de l&#8217;anglais sans autres variations que celles de l&#8217;article
dans  le  cadre de  notre  acquisition  des  traductions.  Ces  patrons  &#171; de base &#187; ont  donn&#233; un
premier  &#233;ventail  de  r&#233;sultats  qui  ont  permis  d&#8217;&#233;valuer  notre  m&#233;thode.  Des  am&#233;liorations
ult&#233;rieures visent &#224; augmenter le panel de patrons morpho-syntaxiques anglais des traductions
candidates, en proc&#233;dant &#224; une analyse syntaxique du contenu des pages Web prospect&#233;es.
</p>
<p>4.2.3 Variations morpho-syntaxiques au sein des requ&#234;tes anglaises
</p>
<p>Une am&#233;lioration vise &#224; consid&#233;rer des variations morpho-syntaxiques au sein de nos requ&#234;tes
telles que des variations dues aux formes verbales ou au pluriel, comme dans l&#8217;exemple :
</p>
<p>&quot;commit a theft&quot;, &quot;commit the theft&#8221;, &quot;commit thefts&quot; , &quot;commit the thefts&quot;, &#8220;committed a
theft&#8221;, etc. 
</p>
<p>5 Conclusion
Nous avons d&#233;crit une m&#233;thode d&#8217;acquisition semi-automatique de relations de traductions du
fran&#231;ais vers l&#8217;anglais, en montrant que le Web s&#8217;av&#232;re &#234;tre un outil particuli&#232;rement efficace
d&#8217;aide  &#224;  la  validation  de  traductions  candidates.  Les  r&#233;sultats  sont  particuli&#232;rement
int&#233;ressants pour les patrons syntaxiques de type NOM ADJECTIF (pr&#233;cision de 97,1 %) et
VERBE NOM(objet) (pr&#233;cision de 88,9 %). La m&#233;thode reste imparfaite pour le patron NOM1
DE NOM2, mais le taux de pr&#233;cision est honorable (76,9%), surtout &#233;tant donn&#233; la difficult&#233;
</p>
<p>1 Une autre limite de l&#8217;API Google est de ne pouvoir lancer que 1000 requ&#234;tes par jour, ce qui impose
des contraintes de temps. Depuis,  mars 2005,  l&#8217;API Yahoo a &#233;t&#233;  lanc&#233; et  offre  une possibilit&#233;  de 5000
requ&#234;tes par jour. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie L&#233;on &amp; Chrystel Millon
</p>
<p>volontaire du banc de test choisi (mots tr&#232;s polys&#233;miques). M&#234;me en l&#8217;&#233;tat, la m&#233;thode permet
un accroissement  important  des  relations  lexicales  contenues  dans  notre  base  de  donn&#233;es
lexicale. Ces r&#233;sultats constituent un premier &#233;chantillon significatif des possibilit&#233;s qu&#8217;offre
le  Web en  mati&#232;re  de  validation  de  relations  lexicales.  Nos  perspectives  d&#8217;&#233;volution
concernent principalement la mise en place d&#8217;une analyse syntaxique des relations candidates
en contexte, ainsi qu&#8217;une d&#233;sambigu&#239;sation des relations lexicales &#224; traduire.
</p>
<p>R&#233;f&#233;rences
Benson M. (1990), Collocations and general-purpose dictionaries,  International Journal of
Lexicography, vol. 3(1), pp. 23-35.
</p>
<p>Cao Y., Li H. (2002), Base noun phrase translation using web data and the EM algorithm. In
Proceedings of CoLing.
</p>
<p>Chuquet H., Paillard M. (1987), Approche linguistique des probl&#232;mes de traduction: anglais-
fran&#231;ais, Gap, Ophrys. 
</p>
<p>Cruse D. A. (1986), Lexical Semantics, Cambridge, Cambridge University Press.
</p>
<p>Katz J. J, Fodor J. A. (1964), The structure of a semantic theory, In J. A. Fodor and J. J. Katz,
editors, The Structure of Language, chapter 19, pp. 479-518.
</p>
<p>Kilgarriff A., Grefenstette G. (2003), Introduction to the Special Issue on the Web as Corpus.
Computational Linguistics, 29(3): 333-348. 
</p>
<p>Melamed I. D. (2001), Empirical methods for exploiting parallel texts, MIT Press.
</p>
<p>Millon  C.  (2004),  Acquisition  de  relations  lexicales  d&#233;sambigu&#239;s&#233;es  &#224;  partir  du  Web,
Rencontre des Etudiants Chercheurs en Informatique pour le Traitement Automatique des
Langues (RECITAL 2004), F&#232;s, (Maroc). 
</p>
<p>Morin  E.,  Dufour-Kowalski  S.,  Daille  B.  (2004),  Extraction  de  terminologies  bilingues  &#224;
partir de corpus , Actes de TALN&#8217;2004, F&#232;s (Maroc). 
</p>
<p>Smadja F. (1993), Retrieving collocations from text : Xtract, Computational Linguistics, Vol.
19, pp. 143-177.
</p>
<p>V&#233;ronis  J.  (1998),  A  study  of  polysemy  judgements  and  inter-annotator  agreement,
Programme and advanced papers of the Senseval workshop,  pp. 2-4, Herstmonceux Castle
(England).
</p>
<p>V&#233;ronis J. (Ed.)  (2000). Parallel Text Processing: Alignment and use of translation corpora,
Kluwer Academic Publishers.
</p>
<p>V&#233;ronis J. (2003), Hyperlex : cartographie lexicale pour la recherche d&#8217;informations, Actes de
TALN&#8217;2003, pp. 265-274, Batz-sur-mer (France): ATALA.
</p>
<p>V&#233;ronis  J.  (2004),  HyperLex  :  cartographie  lexicale  pour  la  recherche
d&#8217;informations.Rapport  Interne  Equipe  DELIC,  Universit&#233;  de  Provence.  [En  ligne :
http://www.up.univmrs.fr/veronis/pdf/2004-hyperlex-rapport.pdf]
</p>
<p>Wilks Y. A. (1975), Preference Semantics, In: Keenan, E. (ed),  The Formal Semantics of
Natural Language, Cambridge University Press, pp. 329-348.</p>

</div></div>
</body></html>