<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Segmentation morphologique &#224; partir de corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2005, Dourdan, 6-10 juin 2005
</p>
<p>Segmentation morphologique &#224; partir de corpus
</p>
<p>Delphine Bernhard
</p>
<p>Laboratoire TIMC-IMAG
Institut de l'Ing&#233;nierie et de l'Information de Sant&#233;
</p>
<p>Pavillon Le Taillefer &#8211; Facult&#233; de M&#233;decine
F-38706 LA TRONCHE cedex
</p>
<p>Delphine.Bernhard@imag.fr
</p>
<p>Mots-clefs &#8211; Keywords
Segmentation morphologique, alignement de segments de mots, corpus.
</p>
<p>Morphological segmentation, word segments alignment, corpus.
</p>
<p>R&#233;sum&#233; &#8211; Abstract
Nous d&#233;crivons une m&#233;thode de segmentation morphologique automatique. L'algorithme
utilise uniquement une liste des mots d'un corpus et tire parti des probabilit&#233;s conditionnelles
observ&#233;es entre les sous-cha&#238;nes extraites de ce lexique. La m&#233;thode est &#233;galement fond&#233;e sur
l'utilisation de graphes d'alignement de segments de mots. Le r&#233;sultat est un d&#233;coupage de
chaque mot sous la forme (pr&#233;fixe*) + base + (suffixe*). Nous &#233;valuons la pertinence des
familles morphologiques d&#233;couvertes par l'algorithme sur un corpus de textes m&#233;dicaux
fran&#231;ais contenant des mots &#224; la structure morphologique complexe.
</p>
<p>We describe a method that automatically segments words into morphs. The algorithm only
uses a list of words collected in a corpus. It is based on the conditional probabilities between
the substrings extracted from this lexicon. The method also makes use of word segments
alignment graphs. As a result, all words are segmented into a sequence of morphs which has
the following pattern: (prefix*) + base + (suffix*). We evaluate the morphological families
discovered by the algorithm using a corpus of French medical texts containing words whose
morphological structure is complex.
</p>
<p>1 Introduction
L'analyse des mots en morph&#232;mes, qui sont les plus petites unit&#233;s porteuses de sens, facilite
l'ex&#233;cution de diverses t&#226;ches telles que la recherche d'informations (Hahn et al., 2003), la
construction de dictionnaires (Lovis et al., 1995) ou de terminologies (Zweigenbaum, Grabar,
2000). Les m&#233;thodes existantes permettent de d&#233;couvrir des suffixes flexionnels ou
d&#233;rivationnels (Gaussier, 1999), voire &#233;galement des pr&#233;fixes (D&#233;jean, 1998; Schone,
Jurafsky, 2001; Goldsmith, 2001; Creutz, Lagus, 2002). Cependant, l'analyse finale d'un mot
se limite g&#233;n&#233;ralement &#224; 3 unit&#233;s morphologiques au plus ((pr&#233;fixe?) + base + (suffixe?)).
</p>
<p>555</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>Certaines langues, comme l'allemand, et langues de sp&#233;cialit&#233;, comme le vocabulaire m&#233;dical,
pr&#233;sentent des caract&#233;ristiques n&#233;cessitant une segmentation plus fine, notamment en raison
du proc&#233;d&#233; de composition &#224; la base de la formation des mots. La proc&#233;dure de segmentation
que nous proposons permet d'obtenir un d&#233;coupage de chaque mot sous la forme (pr&#233;fixe*) +
base + (suffixe*) sans imposer de limite au nombre d'affixes. Pour cela, nous avons combin&#233;
l'utilisation de trois propri&#233;t&#233;s caract&#233;risant les morph&#232;mes et leurs fronti&#232;res :
</p>
<p>&#0; Il existe une fronti&#232;re morph&#233;mique lorsqu'il est difficile de pr&#233;dire le segment
suivant en fonction des segments pr&#233;c&#233;dents. Par exemple, la m&#233;thode propos&#233;e par
(Harris, 1955) pour les phon&#232;mes et appliqu&#233;e par (Hafer, Weiss, 1974) et (D&#233;jean,
1998) &#224; la langue &#233;crite utilise le nombre de phon&#232;mes diff&#233;rents qui peuvent suivre
une suite de phon&#232;mes. Un nombre &#233;lev&#233; de phon&#232;mes indique une fronti&#232;re entre
deux morph&#232;mes. Ainsi, dans notre corpus, seule 1 lettre, le &quot;o&quot;, peut suivre la
s&#233;quence initiale &quot;micr&quot; en fran&#231;ais tandis que la s&#233;quence &quot;micro&quot; peut &#234;tre suivie
par 10 lettres diff&#233;rentes, marquant ainsi une fronti&#232;re morph&#233;mique. Nous avons
exp&#233;riment&#233; une m&#233;thode similaire utilisant les probabilit&#233;s conditionnelles
observ&#233;es entre les sous-cha&#238;nes extraites d'une liste de mots pour pr&#233;dire les
fronti&#232;res morph&#233;miques d'un mot (section 2.1).
</p>
<p>&#0; La similitude graphique est un indice de lien morphologique. En effet, les mots
morphologiquement li&#233;s partagent une base identique et diff&#232;rent par leurs affixes.
La d&#233;couverte des bases et des affixes peut donc se faire en comparant la graphie des
mots, par exemple en recherchant la plus longue cha&#238;ne initiale commune (Gaussier,
1999; Zweigenbaum, Grabar, 2000). Dans de nombreux cas cependant la base ne
correspond pas &#224; la cha&#238;ne initiale, notamment pour les formes pr&#233;fix&#233;es comme
&quot;antihormone&quot; ou &quot;pr&#233;canc&#233;reux &quot; par rapport aux formes non pr&#233;fix&#233;es &quot;hormone&quot;
et &quot;canc&#233;reux&quot;. Nous avons donc choisi de dissocier les phases d'apprentissage des
affixes (section 2.2) et des bases (section 2.3). Nous utilisons &#233;galement une structure
de donn&#233;es (graphe) permettant d'aligner les mots &#224; partir d'une base qui peut
appara&#238;tre &#224; toute position dans les mots compar&#233;s.
</p>
<p>&#0; Si l'on remplace les mots par la liste des morph&#232;mes qu'ils contiennent, il est possible
de comprimer les donn&#233;es du lexique. La meilleure segmentation d'un ensemble de
mots est alors celle qui donne la repr&#233;sentation la plus compacte des donn&#233;es et qui
r&#233;utilise un maximum de morph&#232;mes. Ce principe est notamment utilis&#233; par
(Goldsmith, 2001) et (Creutz, Lagus, 2002). Ainsi, notre algorithme privil&#233;gie la
r&#233;utilisation d'unit&#233;s morphologiques apprises lors de la premi&#232;re phase de
l'apprentissage (section 2.2).
</p>
<p>Nous pr&#233;sentons dans un premier temps notre m&#233;thode de segmentation morphologique
(section 2). Nous d&#233;crivons ensuite l'&#233;valuation effectu&#233;e &#224; partir d'une liste de mots extraits
d'un corpus m&#233;dical fran&#231;ais (section 3). Enfin, nous discutons les r&#233;sultats et proposons des
possibilit&#233;s d'&#233;volution de l'algorithme (section 4).
</p>
<p>2 Pr&#233;sentation de la m&#233;thode
Nous d&#233;taillons tout d'abord notre m&#233;thode de segmentation morphologique bas&#233;e sur les
probabilit&#233;s conditionnelles (section 2.1) permettant de d&#233;couvrir une liste d'affixes initiaux
(section 2.2). Cette liste d'affixes est ensuite utilis&#233;e pour la d&#233;couverte des bases et la
segmentation finale (section 2.3).
</p>
<p>556</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation morphologique &#224; partir de corpus
</p>
<p>2.1 Segmentation bas&#233;e sur les probabilit&#233;s conditionnelles
</p>
<p>Nous pouvons &#224; partir de chaque mot former un graphe directionnel dont les n&#339;uds sont
&#233;tiquet&#233;s par une sous-cha&#238;ne du mot. Il existe un arc entre deux n&#339;uds si les sous-cha&#238;nes
correspondantes se suivent imm&#233;diatement dans le mot. Pour tout chemin du graphe tel que le
premier n&#339;ud n'a pas pr&#233;d&#233;cesseur, la concat&#233;nation des sous-cha&#238;nes associ&#233;es aux n&#339;uds du
chemin est &#233;quivalente au mot. Afin de faire la distinction entre les sous-cha&#238;nes apparaissant
en d&#233;but, milieu et fin de mot, les fronti&#232;res de mots sont marqu&#233;es par le caract&#232;re &quot;#&quot;. Tout
mot de longueur N est ainsi d&#233;composable en un ensemble de sous-cha&#238;nes de longueur 1
(caract&#232;res) &#224; N+2 (mot complet auquel s'ajoutent les marques de d&#233;but et de fin &quot;#&quot;). La
figure 1 repr&#233;sente une sous-partie du graphe des sous-cha&#238;nes du mot &quot;microcalcifications&quot;.
</p>
<p>Figure 1 : Sous-partie du graphe des sous-cha&#238;nes du mot &quot;microcalcifications&quot;.
</p>
<p>Pour un arc du graphe reliant deux n&#339;uds &#233;tiquet&#233;s par les sous-cha&#238;nes s1 et s2, nous pouvons
estimer les probabilit&#233;s conditionnelles p(s1|s2) et p(s2|s1) &#224; partir du nombre d'occurrences
dans le lexique de s1, s2 et de leur concat&#233;nation not&#233;e s1.s2 :
</p>
<p>p
&#0;
</p>
<p>s1 &#1; s2 &#2;&#4;&#3;
f &#0; s1 . s2 &#2;
</p>
<p>f &#0; s2 &#2; et
p
&#0;
</p>
<p>s2 &#1; s1 &#2;&#5;&#3;
f &#0; s1 . s2 &#2;
</p>
<p>f &#0; s1 &#2;
Si les sous-cha&#238;nes s1 et s2 appartiennent &#224; des morph&#232;mes diff&#233;rents, p(s1|s2) et p(s2|s1) sont
faibles car il est difficile de pr&#233;dire la succession de s1 et s2 . A l'inverse, si elles appartiennent
au m&#234;me morph&#232;me, les probabilit&#233;s conditionnelles sont plus fortes. Nous conservons le
maximum de p(s1|s2) et p(s2|s1). 
Pour chaque position dans le mot, nous obtenons ainsi un ensemble de valeurs correspondant
aux maximums des probabilit&#233;s conditionnelles entre les sous-cha&#238;nes se terminant &#224; cette
position et celles commen&#231;ant &#224; cette position. Le nombre de valeurs n'est pas le m&#234;me pour
toutes les positions. Afin d'analyser ces donn&#233;es et de les comparer, nous calculons &#224; chaque
position dans le mot le maximum, le quartile sup&#233;rieur, la m&#233;diane, la moyenne, le quartile
inf&#233;rieur et le minimum1 de ces valeurs. La figure 2 repr&#233;sente graphiquement ces donn&#233;es
pour le mot &quot;microcalcifications&quot;.
</p>
<p>Nous pouvons observer des minimums locaux sur ces courbes &#224; diverses positions dans le
mot. Ces minimums indiquent des fronti&#232;res morph&#233;miques potentielles. Un minimum local
constitue un point de segmentation potentiel si la diff&#233;rence avec le maximum pr&#233;c&#233;dent et le
maximum suivant est au moins &#233;gale &#224; un &#233;cart-type des valeurs de la courbe. Nous
appliquons un deuxi&#232;me crit&#232;re afin de garantir la pr&#233;cision de la segmentation : une fronti&#232;re
morph&#233;mique est valid&#233;e si elle correspond &#224; des points de segmentation potentiels sur au
moins la moiti&#233; des courbes. Les r&#233;sultats ont montr&#233; qu'une courbe ne pouvait &#234;tre
1 La m&#233;diane et les quartiles inf&#233;rieur et sup&#233;rieur permettent de partager l'ensemble des valeurs en 4
</p>
<p>sous-groupes de valeurs de m&#234;me taille : 25 % des valeurs sont inf&#233;rieures au quartile inf&#233;rieur, 50 % sont
inf&#233;rieures &#224; la m&#233;diane et 75 % sont inf&#233;rieures au quartile sup&#233;rieur.
</p>
<p>557</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>privil&#233;gi&#233;e par rapport &#224; une autre : nous avons donc appliqu&#233; la m&#234;me pond&#233;ration &#224; chacune
d'elles. Sur la figure 2, les fronti&#232;res morph&#233;miques valid&#233;es sont indiqu&#233;es par des fl&#232;ches.
Pour le mot &quot;microcalcifications&quot;, la segmentation propos&#233;e est donc &quot;micro + calcification + s&quot;.
</p>
<p>Figure 2 : Variation des probabilit&#233;s conditionnelles pour le mot &quot;microcalcifications&quot;.
</p>
<p>Cette m&#233;thode permet d'identifier des fronti&#232;res morph&#233;miques mais n'est pas suffisante pour
reconstituer des familles morphologiques. Elles peut donner lieu &#224; des segmentations erron&#233;es
notamment pour les mots courts (&quot;foyer&quot; donne &quot;fo + yer&quot;, &quot;m&#234;l&#233;&quot; : &quot;m&#234; + l&#233;&quot;) ou lorsque l'on
trouve peu de mots de la m&#234;me famille dans le corpus (&quot;incub&#233;es&quot; : &quot;incu + b&#233;es&quot;). Le tableau
1 donne les segmentations obtenues pour un ensemble de mots appartenant &#224; la famille de
&quot;microcalcifications&quot;. On constate l'absence de segmentation des mots les plus courts et du
segment &quot;calcification&quot;, ainsi qu'une segmentation erron&#233;e du pr&#233;fixe &quot;macro&quot; en &quot;ma + cro&quot;.
Cette derni&#232;re peut s'expliquer par une pr&#233;pond&#233;rance du pr&#233;fixe &quot;micro&quot; (25 occurrences) par
rapport au pr&#233;fixe &quot;macro&quot; (13 occurrences). De plus, en l'absence de base commune, il n'est
pas possible de reconstituer la famille morphologique. Cette m&#233;thode de segmentation est
donc utilis&#233;e uniquement pour obtenir une liste d'affixes initiaux qui sera r&#233;utilis&#233;e pour la
d&#233;couverte des bases et la segmentation finale des mots.
</p>
<p>Mots Segmentation
calcifier
calcifi&#233;e
calcifi&#233;s
calcifi&#233;es
calcifications
microcalcification
micro-calcifications
macrocalcifications
</p>
<p>calcifier
calcifi&#233;e
calcifi + &#233;s
calcifi&#233;es
calc + ification + s
micro + calcification
micro- + calcification + s
ma + cro + calcification + s
</p>
<p>Tableau 1 : Exemples de segmentations obtenues en utilisant les probabilit&#233;s conditionnelles.
</p>
<p>558</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation morphologique &#224; partir de corpus
</p>
<p>2.2 D&#233;couverte des affixes initiaux
</p>
<p>La s&#233;lection des affixes valides peut se faire en utilisant un crit&#232;re de fr&#233;quence (D&#233;jean,
1998) : dans ce cas, seuls sont conserv&#233;s les affixes qui d&#233;passent un certain nombre
d'occurrences apr&#232;s la phase d'apprentissage. Nous proposons un autre crit&#232;re de s&#233;lection des
affixes initiaux. En effet, les mots morphologiquement complexes sont g&#233;n&#233;ralement plus
longs que les mots morphologiquement simples. L'apprentissage des affixes initiaux n'est
donc effectu&#233; que sur les mots les plus longs du lexique et non pas sur l'ensemble des mots.
Le nombre de mots du lexique d'apprentissage est param&#233;trable (seules quelques centaines de
mots sont n&#233;cessaires).
Nous segmentons chacun des mots du lexique d'apprentissage en utilisant la m&#233;thode de
segmentation bas&#233;e sur les probabilit&#233;s conditionnelles d&#233;crite dans la section 2.1. Dans la
mesure o&#249; la segmentation met &#224; jour aussi bien des pr&#233;fixes que des suffixes, il n'est pas
possible de d&#233;terminer le type (pr&#233;fixe, suffixe ou base) d'un segment uniquement en utilisant
des crit&#232;res positionnels. (Vergne, 2003) utilise les diff&#233;rences de fr&#233;quence et de longueur
pour distinguer mots vides (fr&#233;quents et courts) et mots pleins (rares et longs) dans un &#233;nonc&#233;.
Nous pouvons &#233;tablir un parall&#232;le entre mots vides et affixes d'une part et mots pleins et bases
d'autre part. En effet, une base est g&#233;n&#233;ralement moins fr&#233;quente et plus longue qu'un affixe :
la combinaison de ces deux crit&#232;res nous permet de rep&#233;rer une pseudo-base2 parmi les
segments propos&#233;s. Les pseudo-bases identifi&#233;es par cette m&#233;thode correspondent aux
segments soulign&#233;s dans le tableau 1. Le tableau 2 donne quelques exemples de mise en
oeuvre de cette m&#233;thode. Dans le cas du mot &quot;chimio-hormonoth&#233;rapie&quot;, effectif minimal (2 :
&quot;chimio&quot;) et longueur maximale (9 : &quot;oth&#233;rapie&quot;) ne correspondent pas, la segmentation est
alors consid&#233;r&#233;e comme non valide.
</p>
<p>Segments micro calcification s
Effectifs 37 6 8289
</p>
<p>Longueurs 5 13 1
</p>
<p>Segments multi dimension nelle
Effectifs 32 5 41
</p>
<p>Longueurs 5 9 5
</p>
<p>Segments chimio- hormon oth&#233;rapie
Effectifs 2 29 25
</p>
<p>Longueurs 7 6 9
Tableau 2 : Rep&#233;rage de la base parmi des segments. Les cases gris&#233;es correspondent
</p>
<p>respectivement &#224; l'effectif minimal et &#224; la longueur maximale.
</p>
<p>Afin d'augmenter le nombre d'affixes extraits nous recherchons la pseudo-base dans
l'ensemble des mots du lexique et nous proc&#233;dons &#224; l'alignement de ces mots en les ins&#233;rant
dans un graphe. La pseudo-base sert de point d'ancrage. Nous appliquons des crit&#232;res
suppl&#233;mentaires pour v&#233;rifier la validit&#233; de la pseudo-base en fonction des mots dans lesquels
elle appara&#238;t :
</p>
<p>2 Nous r&#233;utilisons ici le terme &quot;pseudo-base&quot; employ&#233; par (Schone, Jurafsky, 2001). Il peut en effet
s'agir d'une base non valide ou contenant des affixes.
</p>
<p>559</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>&#0; Le nombre de mots de cette liste doit &#234;tre sup&#233;rieur ou &#233;gal &#224; 2.
&#0; La pseudo-base doit d&#233;buter un de ces mots. Par exemple, la segmentation du mot
</p>
<p>&quot;radiopharmaceutiques&quot; est &quot;radio + pharmac + eutiques&quot;. Le segment &quot;eutiques&quot; est
reconnu comme &#233;tant la pseudo-base car il est &#224; la fois le plus long et le moins
fr&#233;quent. Les 5 mots contenant &quot;eutiques&quot; sont : &quot;chimioth&#233;rapeutiques&quot;,
&quot;postth&#233;rapeutiques&quot;, &quot;pharmaceutiques&quot;, &quot;radiopharmaceutiques&quot;, et &quot;th&#233;rapeutiques&quot;.
Aucun des mots du corpus ne commence par &quot;eutiques&quot;, la pseudo-base est donc
consid&#233;r&#233;e comme non valide.
</p>
<p>La figure 3 donne deux exemples d'alignement &#224; partir des pseudo-bases &quot;calcification&quot; et
&quot;claviculaire&quot; ainsi que les pr&#233;fixes et les suffixes d&#233;couverts par l'alignement (&quot;#&quot; indique le
pr&#233;fixe ou suffixe vide). Seuls sont conserv&#233;s les pr&#233;fixes de longueur sup&#233;rieure ou &#233;gale &#224;
deux. L'ensemble des pr&#233;fixes et suffixes obtenus &#224; la fin de cette &#233;tape constitue la liste des
affixes initiaux.
</p>
<p>pr&#233;fixes micro-, micro, macro, # pr&#233;fixes axillo-, sus, sus-, sous, sous-, supra,
axillo-sus, #
</p>
<p>suffixes s, # suffixes s, #
</p>
<p>Figure 3 : Alignement des mots contenant les pseudo-bases &quot;calcification&quot; et &quot;claviculaire&quot;.
</p>
<p>2.3 D&#233;couverte des bases et segmentation des mots
</p>
<p>Cette derni&#232;re phase permet de segmenter tous les mots du corpus en r&#233;utilisant les affixes
d&#233;couverts lors de la phase pr&#233;c&#233;dente pour obtenir une liste des bases pr&#233;sentes dans le
corpus :
</p>
<p>1. Pour chaque mot du lexique, recherche des affixes initiaux qu'ils contient. Si l'on
retranche d'un mot les diverses combinaisons possibles de ces affixes et de la cha&#238;ne
vide, il est possible d'obtenir des pseudo-bases. Le mot lui-m&#234;me constitue une
pseudo-base, ce qui permet notamment de conserver dans la liste des pseudo-bases
les mots non fl&#233;chis. Ces pseudo-bases doivent avoir une longueur minimale de 3.
Par exemple, le mot &quot;calcifi&#233;es&quot; contient les suffixes initiaux &quot;i&#233;es&quot;, &quot;&#233;es&quot;, &quot;es&quot; et
&quot;s&quot;. Les pseudo-bases obtenues en retranchant ces suffixes initiaux sont : &quot;calcifi&#233;e&quot;,
&quot;calcifi&#233;&quot;, &quot;calcifi&quot; et&quot;calcif&quot;, auxquelles s'ajoute &quot;calcifi&#233;es&quot; (mot complet).
</p>
<p>2. Pour chaque pseudo-base, recherche des mots contenant la pseudo-base dans le
lexique. Par exemple, les mots contenant la pseudo-base &quot;calcifi&#233;&quot; sont : &quot;calcifi&#233;&quot;,
&quot;calcifi&#233;e&quot;, &quot;calcifi&#233;s&quot;, &quot;calcifi&#233;es&quot;.
</p>
<p>560</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation morphologique &#224; partir de corpus
</p>
<p>3. Construction du graphe d'alignement des mots contenant la pseudo-base. Nous
appliquons deux contraintes sur le graphe d'alignement : il doit contenir un nombre
suffisant d'affixes initiaux et le nombre de mots contenant la pseudo-base ne doit pas
exc&#233;der un certain seuil. Nous avons fix&#233; exp&#233;rimentalement la proportion d'affixes
initiaux &#224; 75 % et le nombre maximal de mots &#224; 50. Afin d'&#233;viter l'absence d'analyse
lorsque ces crit&#232;res ne sont pas v&#233;rifi&#233;s, deux tentatives suppl&#233;mentaires sont
effectu&#233;es : nous supprimons dans un premier temps les pr&#233;fixes inconnus du graphe
d'alignement, puis, si l'alignement n'est toujours pas consid&#233;r&#233; comme valide, nous
supprimons les suffixes inconnus. La meilleure pseudo-base est celle dont le graphe
d'alignement contient le plus grand nombre d'affixes initiaux. Les mots contenant la
meilleure pseudo-base sont alors segment&#233;s en fonction de leur alignement. Le
tableau 3 repr&#233;sente les pseudo-bases obtenues &#224; partir du mot &quot;calcifi&#233;es&quot; ainsi que
les segmentations correspondantes. La meilleure pseudo-base est &quot;calcifi&quot;.
</p>
<p>calcifi&#233;es calcifi calcifi&#233;e calcif calcifi&#233;
</p>
<p>calcifi&#233;es
</p>
<p>micro+
micro+
</p>
<p>micro-+
macro+
</p>
<p>calcifi
calcifi
calcifi
calcifi
calcifi
calcifi
calcifi
calcifi
calcifi
calcifi
calcifi
</p>
<p>+er
</p>
<p>+&#233;
+&#233;+e
+&#233; +s
+&#233;+e+s
+cation
+cation+s
+cation
+cation+s
+cation+s
+cation+s
</p>
<p>calcifi&#233;e
calcifi&#233;e+s
</p>
<p>micro+
micro+
</p>
<p>micro-+
macro+
</p>
<p>calcif
calcif
calcif
calcif
calcif
calcif
calcif
calcif
calcif
calcif
calcif
</p>
<p>+ier
+i&#233;
+i&#233;+e
+i&#233;+s
+i&#233;+e+s
+ication
+ication+s
+ication
+ication+s
+ication+s
+ication+s
</p>
<p>calcifi&#233;
calcifi&#233;+e
calcifi&#233;+s
calcifi&#233;+e+ s
</p>
<p>Tableau 3 : Pseudo-bases et segmentations obtenues &#224; partir du mot &quot;calcifi&#233;es&quot;. Les affixes
initiaux sont marqu&#233;s en gras. Les segmentations valid&#233;es se trouvent dans la colonne gris&#233;e.
</p>
<p>3 &#201;valuation
Nous avons &#233;valu&#233; la m&#233;thode sur un corpus compos&#233; de 80 documents traitant du cancer du
sein. Ce corpus se compose de 33 articles scientifiques et de 47 pages web. Il comprend
environ 280 000 mots pour 12 587 formes diff&#233;rentes. Nous &#233;valuons la validit&#233; des bases
associ&#233;es &#224; chaque mot et non pas la position des points de segmentation. L'ensemble des
mots qui contiennent la m&#234;me base forme une famille morphologique. Nous v&#233;rifions si deux
mots associ&#233;s &#224; la m&#234;me base par l'algorithme (comme c'est le cas pour &quot;microcalcification&quot;
et &quot;calcifier&quot;) sont effectivement morphologiquement li&#233;s. Nous avons automatis&#233; l'&#233;valuation
des variantes flexionnelles en utilisant le fichier DLF (formes simples) produit par INTEX
(Silberztein, 1993) par l'application du dictionnaire DELAF. Dans ce fichier, chaque forme
est associ&#233;e &#224; un ou plusieurs lemmes. Si deux formes sont associ&#233;es au m&#234;me lemme dans le
fichier DLF et &#224; la m&#234;me base par l'algorithme, la relation entre les deux formes est
consid&#233;r&#233;e comme valide (relation flexionnelle). L'analyse du lexique par INTEX produit
</p>
<p>561</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>12 116 relations binaires entre mots du corpus. En ce qui concerne les mots reli&#233;s par
d&#233;rivation ou composition ainsi que les mots ne figurant pas dans le fichier DLF, l'&#233;valuation
a &#233;t&#233; faite manuellement. 
</p>
<p>Le tableau 4 pr&#233;sente les r&#233;sultats de l'&#233;valuation en fonction de la taille du lexique
d'apprentissage et le tableau 5 donne quelques exemples de familles morphologiques obtenues
pour un lexique d'apprentissage de 100 mots. La pr&#233;cision d&#233;cro&#238;t avec l'augmentation du
nombre de mots du lexique d'apprentissage tandis que le rappel des relations flexionnelles
augmente pour culminer &#224; environ 75 %. Pour 600 mots dans le lexique d'apprentissage, le
rappel n'est pas meilleur, ce qui semble indiquer un seuil limite dans l'apprentissage.
</p>
<p>Nombre de mots du lexique
d'apprentissage 100 200 300 400 500
</p>
<p>Pr&#233;fixes initiaux 35 69 95 113 147
</p>
<p>Suffixes initiaux 18 77 112 138 177
</p>
<p>Nombre de bases 9 389 6 989 6 740 6 224 5 336
</p>
<p>Nombre total de relations 5 284 15 794 17 610 21 889 33 837
</p>
<p>Relations flexionnelles
(rappel)
</p>
<p>3 436
(28,4%)
</p>
<p>7 319
(60,4%)
</p>
<p>7 291
(60,2%)
</p>
<p>8 116
(67,0%)
</p>
<p>9 261
(76,4%)
</p>
<p>Relations d&#233;rivationnelles et
compositionnelles valides 1 740 7 145 8 343 10 524 14 807
</p>
<p>Relations non valides 108 1 330 1 976 3 249 9 769
</p>
<p>Pr&#233;cision 98,0% 91,6% 88,8% 85,2% 71,1%
</p>
<p>Tableau 4 : R&#233;sultats de l'&#233;valuation.
</p>
<p>Bases Variantes
</p>
<p>pathologi anatomo-pathologie, anatomo-pathologique, anatomo-pathologiques, anatomo-
pathologiste, anatomopathologie, anatomopathologique, anatomopathologiques,
anatomopathologiste, anatomopathologistes, cytopathologique, cytopathologiste,
histopathologie, histopathologique, histopathologiques, pathologie, pathologies,
pathologique, pathologiques, pathologiste, pathologistes, physio-pathologique,
physiopathologiques, radio-pathologiques, radiologique-anatomopathologique,
radio-pathologique, radiopathologiques.
</p>
<p>th&#233;rapi chimioth&#233;rapie, chimioth&#233;rapies, chimioth&#233;rapique, chimioth&#233;rapiques, hormono-
chimioth&#233;rapique, physioth&#233;rapie, polychimioth&#233;rapie, radio-chimioth&#233;rapie,
radioth&#233;rapie, radioth&#233;rapique, th&#233;rapie, th&#233;rapies.
</p>
<p>Tableau 5 : Exemples de familles morphologiques obtenues &#224; partir d'un lexique
d'apprentissage de 100 mots.
</p>
<p>562</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation morphologique &#224; partir de corpus
</p>
<p>4 Discussion et conclusion
L'algorithme que nous avons mis au point permet de traiter &#224; la fois les proc&#233;d&#233;s de flexion
(&quot;pathologique&quot;, &quot;pathologiques&quot;), d&#233;rivation (&quot;pathologie&quot;, &quot;pathologique&quot;) et composition
(&quot;anatomopathologique&quot;). De plus, il est possible de rep&#233;rer les pr&#233;fixes et les suffixes au
cours de la m&#234;me proc&#233;dure, gr&#226;ce &#224; l'alignement des segments de mots &#224; partir d'une base qui
peut se situer &#224; n'importe quelle position dans le mot. 
</p>
<p>La taille du corpus a &#233;t&#233; volontairement limit&#233;e afin de permettre une validation manuelle des
mots reli&#233;s par d&#233;rivation ou composition. Les m&#233;thodes d'apprentissage sur corpus sont
g&#233;n&#233;ralement d&#233;pendantes de la taille du corpus d'apprentissage : plus le corpus est important,
meilleurs sont les r&#233;sultats. Nous obtenons n&#233;anmoins un tr&#232;s bon pourcentage de relations
valides (entre 98 et 71 %) avec uniquement 12 587 formes diff&#233;rentes (le fran&#231;ais compte
plusieurs centaines de milliers de formes diff&#233;rentes).
Nous n'avons pas directement mesur&#233; le rappel. Nous en avons une indication indirecte &#224;
partir du nombre de relations d&#233;couvertes et du rappel des relations flexionnelles du fichier
DLF. Ce rappel est assez bon (de l'ordre des 60 &#224; 70 %) et ce d'autant plus qu'un certain
nombre de relations flexionnelles ne peuvent &#234;tre retrouv&#233;es par un algorithme de
segmentation morphologique (c'est le cas notamment des verbes irr&#233;guliers dont des formes
tr&#232;s diff&#233;rentes peuvent &#234;tre ramen&#233;es au m&#234;me lemme; par exemple les formes &quot;veut&quot;,
&quot;veux&quot;, &quot;voudrez&quot;, &quot;voudront&quot;, &quot;voulant&quot;, &quot;vouloir&quot;, &quot;voulu&quot; correspondent toutes au m&#234;me
lemme &quot;vouloir&quot;). D'une mani&#232;re g&#233;n&#233;rale, les variantes des bases et les cas de doublement
des consonnes constituent des pierres d'achoppement qui peuvent diminuer le rappel de
l'algorithme. Ainsi, les mots &quot;estrog&#232;nes&quot; et &quot;estrog&#233;nique&quot; ont deux bases diff&#233;rentes :
&quot;estrog&#232;n&quot; et &quot;estrog&#233;niqu&quot;. De m&#234;me &quot;fractions&quot; et &quot;fractionnement&quot; correspondent aux
bases &quot;fraction&quot; et &quot;fractionne&quot;. La m&#233;thode devrait &#234;tre am&#233;lior&#233;e pour prendre ces cas en
compte.
</p>
<p>Il faut &#233;galement noter que cette m&#233;thode n'est pas a priori limit&#233;e &#224; l'analyse du fran&#231;ais car
elle ne repose sur aucune ressource externe au corpus. Nous avons d'ailleurs obtenu quelques
exemples de segmentations de mots anglais, dans la mesure o&#249; ces mots contiennent des
segments communs au fran&#231;ais et &#224; l'anglais (par exemple &quot;radio + therapy&quot;). Il reste &#224; tester
la m&#233;thode sur des corpus &#233;trangers, notamment des corpus de langues agglutinantes telles
que l'allemand, afin d'&#233;prouver son efficacit&#233;. Des exp&#233;riences suppl&#233;mentaires devraient
&#233;galement &#234;tre conduites sur des corpus fran&#231;ais g&#233;n&#233;ralistes et de taille plus importante.
</p>
<p>La m&#233;thode de segmentation finale des mots d&#233;crite utilise une structure de mot simplifi&#233;e :
(pr&#233;fixe*) + base + (suffixe*). Nous obtenons par exemple les segmentations suivantes :
&quot;lymphangi + osarcome&quot;, &quot;lymphangi + te&quot; et &quot;ost&#233;o + sarcom + e&quot;. Il est int&#233;ressant de noter
que l'interfixe &quot;o&quot; reliant &quot;lymphangi&quot; et &quot;sarcom&quot; a bien &#233;t&#233; rep&#233;r&#233;. Cependant, seule une
base, &quot;lymphangi&quot;, a &#233;t&#233; identifi&#233;e, &quot;osarcome&quot; &#233;tant consid&#233;r&#233; comme un suffixe. Il serait
souhaitable d'affiner l'algorithme sur ce point afin de rep&#233;rer plusieurs bases par mot, comme
c'est souvent le cas pour les termes sp&#233;cialis&#233;s. Le rep&#233;rage de plusieurs bases par mot
permettrait de mettre le mot &quot;lymphangiosarcome&quot; en relation &#224; la fois avec &quot;lymphangite&quot;,
&quot;lymphe&quot; ou &quot;ost&#233;osarcome&quot; par le biais des bases &quot;lymph&quot; et &quot;sarcom&quot;.
</p>
<p>De plus, &#224; l'heure actuelle, l'algorithme utilise uniquement des crit&#232;res formels pour proc&#233;der
&#224; la segmentation morphologique des mots. Or les relations morphologiques impliquent &#224; la
fois forme et sens. Il para&#238;t donc n&#233;cessaire d'int&#233;grer des informations d'ordre s&#233;mantique &#224;
une m&#233;thode de segmentation morphologique. La prise en compte d'informations s&#233;mantiques
</p>
<p>563</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Bernhard
</p>
<p>peut se faire a priori en effectuant l'apprentissage &#224; partir de mots s&#233;mantiquement reli&#233;s telles
que les listes de termes synonymes issus d'une terminologie (Zweigenbaum, Grabar, 2000) ou
a posteriori en utilisant des mesures de distance s&#233;mantique bas&#233;es sur la distribution des mots
dans le corpus pour valider les segmentations (Schone, Jurafsky, 2001; Zweigenbaum et al.,
2003). Nous envisageons de compl&#233;ter l'algorithme avec des informations de ce type afin d'en
augmenter la pr&#233;cision.
</p>
<p>R&#233;f&#233;rences
Creutz M., Lagus K. (2002), Unsupervised Discovery of Morphemes, Proceedings of the 6th
Meeting of the ACL Special Interest Group of Computaional Phonology (SIGPHON), 21-30.
D&#233;jean H. (1998), Morphemes as Necessay Concept for Structures Discovery from Untagged
Corpora, NeMLaP3/CoNLL98 Workshop on Paradigms and Grounding in Language
Learning, 295-298.
</p>
<p>Gaussier E. (1999), Unsupervised Learning of Derivational Morphology from Inflectional
Lexicons, Proceedings of the ACL Workshop on Unsupervised Learning in Natural Language
Processing, 24-30.
</p>
<p>Goldsmith J. (2001), Unsupervised Learning of the Morphology of a Natural Language,
Computational Linguistics, Vol. 27(2), pp. 153-198.
Hafer M.A, Weiss S.F. (1974), Word Segmentation by Letter Successor Varieties,
Information Storage and Retrieval, Vol. 10, pp. 371-385.
Hahn U., Honeck M., Shulz S. (2003), Subword-Based Text Retrieval, Proceedings of the
36th Hawaii International Conference on System Sciences (HICSS'03), 108.1.
Harris Z. (1955), From Phoneme to Morpheme, Language, Vol. 31, pp. 190-222.
Lovis C., Michel PA., Baud, R., Scherrer JR.. (1995), Word Segmentation Processing: A Way
to Exponentially Extend Medical Dictionaries, Proceedings of the 8th World Congress on
Medical Informatics, 28-32.
Schone P., Jurafsky D. (2001), Knowledge-Free Induction of Inflectional Morphologies,
Proceedings of the North American Chapter of the Association for Computational Linguistics
(NAACL-2001), 183-191.
Silberztein M. (1993), Dictionnaires &#233;lectroniques et analyse automatique de textes : le
syst&#232;me INTEX, Paris, Masson.
</p>
<p>Vergne J. (2003), Un outil d'extraction terminologique endog&#232;ne et multilingue, Actes de
TALN 2003, 139-148.
</p>
<p>Zweigenbaum P., Grabar N. (2000), Liens morphologiques et structuration de terminologie,
Actes de IC 2000 : Ing&#233;nierie des Connaissances, 325-334.
</p>
<p>Zweigenbaum P., Hadouche F., Grabar N. (2003), Apprentissage de relations morphologiques
en corpus, Actes de TALN 2003, 285-294.
</p>
<p>564</p>

</div></div>
</body></html>