<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Quels types de connaissance s&#233;mantique pour Questions-R&#233;ponses ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Quels types de connaissance s&#233;mantique pour
Questions-R&#233;ponses ?
</p>
<p>Vincent Barbier
LIMSI, UPR CNRS 3251, B&#226;t. 508
Universit&#233; de Paris XI, 91403 Orsay
</p>
<p>barbier@limsi.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Syst&#232;me de Question R&#233;ponse, ressources s&#233;mantiques, &#233;valuation des reformulations
Question Answering system, semantic resources, evaluation of reformulations
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Les syst&#232;mes de Questions R&#233;ponse ont besoin de connaissances s&#233;mantiques pour trouver
dans les documents des termes susceptibles d&#8217;&#234;tre des reformulations des termes de la question.
Cependant, l&#8217;utilisation de ressources s&#233;mantiques peut apporter un bruit important et alt&#233;rer la
pr&#233;cision du syst&#232;me. ne fournit qu&#8217;une partie des reformulations possibles.
</p>
<p>Cet article pr&#233;sente un cadre d&#8217;&#233;valuation pour les ressources s&#233;mantiques dans les syst&#232;mes
de question-r&#233;ponse. Il d&#233;crit la fabrication semi-automatique d&#8217;un corpus de questions et de
r&#233;ponses destin&#233; &#224; &#233;tudier les reformulations pr&#233;sentes entre termes de la question et termes
de la r&#233;ponse. Il &#233;tudie la fr&#233;quence et la fiabilit&#233; des reformulations extraites de l&#8217;ontologie
WordNet.
</p>
<p>Question Answering systems need semantic knowledge to find in the documents terms that
are reformulations of the question&#8217;s terms. However, the use of semantic resources brings an
important noise and a system&#8217;s precision might get depreciated.
</p>
<p>This article presents a framework for evaluating semantic resources in question-answering sys-
tems. It describes the semi-automated construction of a corpus containing questions and an-
swers. This corpus can be used to study the various reformulations between the terms of the
questions and the terms of the answers. This article studies the frequency and reliability of
reformulations given by the WordNet ontology.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Barbier
</p>
<p>1 Introduction
</p>
<p>La probl&#233;matique questions-r&#233;ponses (QR) consiste &#224; concevoir un programme qui re&#231;oit de
l&#8217;utilisateur une question formul&#233;e en langue naturelle et recherche dans une collection de doc-
uments un fragment de texte, typiquement un court passage, r&#233;pondant &#224; cette question. Les
campagnes d&#8217;&#233;valuation TREC, dont l&#8217;enjeu est de r&#233;pondre &#224; des questions factuelles par de
courts passages d&#8217;articles de journaux ont encourag&#233; la r&#233;alisation de nombreux syst&#232;mes de
QR et donn&#233; une &#233;valuation globale de ces syst&#232;mes.
La plupart des syst&#232;mes sont constitu&#233;s de trois &#233;tapes principales (Grau, 2004). Tout d&#8217;abord,
l&#8217;analyse de la question qui permet de d&#233;couper la question en termes et de trouver le type
attendu de la r&#233;ponse. Ensuite, la recherche des documents dans la collection, au moyen d&#8217;un
moteur de recherche. On effectue pour cela une ou plusieurs requ&#234;tes successives compos&#233;es
des termes de la question et &#233;ventuellement de reformulations de ceux-ci. Enfin, la s&#233;lection des
r&#233;ponses mettant en jeu des crit&#232;res de pertinence faisant intervenir la syntaxe et la s&#233;mantique.
Pour trouver des documents pertinents, les syst&#232;mes ont besoin de reconna&#238;tre dans les docu-
ments des reformulations de termes de la question. Par exemple, dans la collection d&#8217;articles de
journaux Aquaint (TREC11), la question &#8220;What is the name of the volcano that destroyed Pom-
peii ?&#8221; , ne poss&#232;de pas de r&#233;ponse r&#233;utilisant le verbe to destroy. Par contre, des &#233;quivalents
comme to devastate, to bury under ashes... permettent de retrouver la r&#233;ponse.
</p>
<p>Les reformulations peuvent intervenir &#224; deux endroits. Premi&#232;rement, au niveau de la requ&#234;te,
pour permettre de retrouver les documents qui n&#8217;utilisent pas la m&#234;me formulation de la ques-
tion, c&#8217;est-&#224;-dire, augmenter le rappel de l&#8217;&#233;tape de recherche des documents. Ensuite au niveau
de la s&#233;lection des documents, des passages ou des phrases retourn&#233;s, afin d&#8217;am&#233;liorer leur
classement et s&#233;lectionner ceux dont la formulation approche le mieux possible celle de la
question. Plus les reformulations sont complexes et plus elles sont susceptibles d&#8217;engendrer du
bruit, c&#8217;est-&#224;-dire d&#8217;amener le syst&#232;me &#224; juger pertinents des documents ou passages qui ne le
sont pas. Les syst&#232;mes de questions-r&#233;ponses doivent donc utiliser les ressources linguistiques
avec pr&#233;caution, et pour cela, doivent estimer la fiabilit&#233; des reformulations utilis&#233;es.
</p>
<p>Notre but est d&#8217;&#233;tudier le besoin de reformulations des syst&#232;mes de questions r&#233;ponses, de
chercher quels types de reformulations seraient utiles &#224; ces syst&#232;mes et quel est le degr&#233; de
fiabilit&#233; de ces reformulations. Cette &#233;tude se fonde sur un corpus de questions r&#233;ponses con-
stitu&#233; automatiquement. Apr&#232;s un &#233;tat de l&#8217;art des syt&#232;mes de questions r&#233;ponses et de la fa&#231;on
dont ils utilisent les ressources s&#233;mantique, nous d&#233;crirons la construction du corpus, puis nous
&#233;tudierons les reformulations obtenues gr&#226;ce &#224; l&#8217;ontologie WordNet, et tenterons d&#8217;&#233;valuer leur
fiabilit&#233;.
</p>
<p>2 La s&#233;mantique dans les travaux actuels
</p>
<p>Lors du filtrage des documents ou des passages, les syst&#232;mes utilisent diff&#233;rents crit&#232;res pour
&#233;valuer la pr&#233;sence d&#8217;une r&#233;ponse. Ceux-ci se r&#233;partissent en crit&#232;res syntagmatiques et paradig-
matiques. Les crit&#232;res paradigmatiques sont ceux qui d&#233;terminent une proximit&#233; entre un &#233;l&#233;-
ment de la question et un &#233;l&#233;ment de la r&#233;ponse. Les crit&#232;res syntagmatiques sont ceux qui
tiennent compte de la disposition de ces &#233;l&#233;ments dans les entit&#233;s textuelles o&#249; ils apparais-
sent, ou de leurs dispositions relatives. Les syst&#232;mes allient ces deux types de contraintes sous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quels types de connaissance s&#233;mantique pour Questions-R&#233;ponses ?
</p>
<p>diverses formes.
</p>
<p>Des techniques les plus restrictives aux plus souples, la contrainte syntagmatique peut &#234;tre
impl&#233;ment&#233;e par :
</p>
<p>&#0; L&#8217;utilisation de patrons d&#8217;extraction de la r&#233;ponse, par exemple une date de naissance
peut &#234;tre rep&#233;r&#233;e par &#8220;X was born in &lt;date-naissance&gt;&#8221; ou &#8220;X ( &lt;date-naissance&gt; - &lt;date-
d&#233;c&#232;s&gt; ) &#8221;. (Jijkoun &amp; de Rijke, 2004) montre que cette m&#233;thode apporte des r&#233;sultats
pour des questions simples (TREC8). Elle est de plus bien adapt&#233;e &#224; des collections de
documents de taille tr&#232;s importante, comme celle rendue disponible par la toile.
</p>
<p>&#0; Une preuve logique visant &#224; d&#233;montrer une implication possible entre deux graphes,
repr&#233;sentant respectivement la question et un passage candidat &#224; contenir la r&#233;ponse
(Moldovan et al., 2002). Cette technique consiste &#224; &#233;crire la question et un passage can-
didat sous forme logique. Par exemple &#8220;How did Hitler die?&#8221; est retranscrit par :
</p>
<p>manner_at(e) &amp; hitler_nn(x) &amp; die_vb(e,x,y).
La preuve peut utiliser des axiomes linguistiques et semantiques. Un axiome s&#233;mantique,
tir&#233; de WordNet, pourrait &#234;tre &#8220;to kill cause to die&#8221; ce qui a &#233;t&#233; retranscrit par :
</p>
<p>kill(e1,x1,x2) -&gt; die(e1,x2,$c) ou encore - kill(e1,x1,x2) | die(e1,x2,$c)
o&#249; $c est un argument ind&#233;termin&#233;, et &#8216;-&#8217; l&#8217;op&#233;rateur de n&#233;gation.
</p>
<p>&#0; Une mesure de la proximit&#233; spatiale des &#233;l&#233;ments de la question dans le passage candidat.
</p>
<p>En ce qui concerne la contrainte paradigmatique, le but est d&#8217;associer les &#233;l&#233;ment de la ques-
tion &#224; des &#233;l&#233;ments correspondants dans la r&#233;ponse. Il peut s&#8217;agir de rep&#233;rer dans le passage
candidat un terme correspondant au type attendu de la r&#233;ponse (entit&#233;s nomm&#233;es trouv&#233;es dans
une taxonomie ou concept d&#8217;une ontologie), ou de rep&#233;rer des reformulations s&#233;mantiques des
termes de la question.
</p>
<p>La mise en correspondance des termes de la question et de la r&#233;ponse n&#233;cessite des ressources.
Le type de ressource majoritairement utilis&#233; sont les dictionnaires de synonymes (Magnini et al.,
2002; Ferret et al., 2001). Mais il est possible d&#8217;utiliser les diff&#233;rentes relations d&#8217;une ontologie
telle que WordNet (Moldovan et al., 2002). L&#8217;ontologie WordNet (Fellbaum, 1998) est int&#233;res-
sante pour sa couverture g&#233;n&#233;rale de la langue. C&#8217;est sur elle que s&#8217;axera en premier lieu notre
travail.
</p>
<p>WordNet est un lexique dont les entr&#233;es, les synsets, sont assimilables &#224; des concepts. Les
cat&#233;gories grammaticales trait&#233;es sont les noms, les verbes, les adjectifs et les adverbes. La
plupart des travaux concernant WordNet se concentrent sur l&#8217;ontologie des noms. Les entr&#233;es
de WordNet sont d&#233;crites par leurs connexions avec les autres entr&#233;es du lexique. Ces liens sont
de plusieurs types : l&#8217;hyponymie, qui relie un concept g&#233;n&#233;ral &#224; des concepts plus sp&#233;cifiques,
et son inverse, l&#8217;hyp&#233;ronymie. Cette paire de relation constitue la principale structuration de
l&#8217;ontologie noms. Les noms sont aussi organis&#233;s selon la relation d&#8217;holonymie qui relie un
&#233;l&#233;ment &#224; un ensemble le contenant (par exemple argentin est un m&#233;ronyme de Argentine). Les
relations structurant les verbes sont le couple hyponymie/hyp&#233;ronymie, ainsi que les relations
de cause (ex : tuer cause le fait de mourir) et d&#8217;implication (ex : ronfler entra&#238;ne que l&#8217;on dort).
Les adjectifs, peu structur&#233;s, sont d&#233;finis par leurs synonymes et antonymes, et surtout par les
noms auxquels ils se rapportent.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Barbier
</p>
<p>A la structuration des liens, il faut ajouter les d&#233;finitions (glosses), qui peuvent elles aussi ap-
porter des liens utiles qui ne seraient pas cod&#233;s explicitement.
</p>
<p>LCC fait un usage important de ces liens gr&#226;ce &#224; une version &#233;tendue de WordNet o&#249; les d&#233;fi-
nitions sont cod&#233;es sous forme de graphes et les mots de ces d&#233;finitions ont &#233;t&#233; d&#233;sambigu&#239;s&#233;s
manuellement, c&#8217;est-&#224;-dire rattach&#233;s au synset leur correspondant le mieux.
</p>
<p>Cependant, les relations cod&#233;es dans WordNet ne sont qu&#8217;une partie des relations existantes.
Par exemple, les liens de WordNet donnent principalement des relations entre mots d&#8217;une m&#234;me
cat&#233;gorie grammaticale. Or certaines reformulations ne s&#8217;effectuent pas mot &#224; mot mais sur une
combinaison de deux ou plusieurs mots (Jacquemin, 1999). Certaines constituent une transfor-
mation compl&#232;te de la phrase. Ces reformulations complexes peuvent remplacer un mot par un
mot d&#8217;une cat&#233;gorie grammaticale diff&#233;rente. Par exemple la question :
</p>
<p>&#8220;What is the democratic party symbol?&#8221;
</p>
<p>poss&#232;de une r&#233;ponse de la forme :
</p>
<p>&#8220;The democratic party was represented as a donkey.&#8221;
</p>
<p>Pour rem&#233;dier aux manques de WordNet, on peut utiliser les relations morphologiques qui re-
lient par exemple le verbe to make au nom maker. Cependant ces relations morphologiques
couvrent le lexique de fa&#231;on lacunaire et hasardeuse. Ainsi, en anglais, les termes d&#233;crivant les
relations conjugales : &#8220;husband, wife, married&#8221; ne sont pas morphologiquement reli&#233;s. Pour
combler ces manques, (Claveau &amp; Sebillot, 2004; de Chalendar G., 2001) acqui&#232;rent automa-
tiquement des relations nom-verbe sur corpus.
</p>
<p>Plusieurs sources de connaissances s&#233;mantiques sont donc disponibles, synonymes, ontolo-
gies, ou relations apprises sur corpus. L&#8217;architecture g&#233;n&#233;rale des syst&#232;mes de QR est d&#233;finie
et relativement homog&#232;ne d&#8217;un syst&#232;me &#224; l&#8217;autre. Dans ce cadre, il est maintenant n&#233;ces-
saire d&#8217;examiner plus en d&#233;tail l&#8217;apport des diff&#233;rentes &#233;tapes, ainsi que d&#8217;&#233;valuer l&#8217;apport des
ressources linguistiques utilis&#233;es.
</p>
<p>3 Construction du corpus
</p>
<p>Afin d&#8217;&#233;tudier l&#8217;utilit&#233; et d&#8217;&#233;valuer la fiabilit&#233; des reformulations, nous sommes pass&#233;s par la
construction d&#8217;un corpus. Nous voulons pouvoir utiliser ce corpus pour &#233;tudier, pour chaque
terme d&#8217;une question, les termes qui lui correspondent dans les r&#233;ponses. Ce corpus pourra
aussi servir pour apprendre automatiquement des mesures de proximit&#233;s s&#233;mantiques.
</p>
<p>Actuellement, ce corpus est fond&#233; sur 54 questions de la campagne d&#8217;&#233;valuation TREC11. Nous
l&#8217;&#233;tendrons &#224; plus de questions. La collection de documents utilis&#233;e est la collection Aquaint
fournie pour cette campagne.
</p>
<p>A chaque question est associ&#233; un ensemble de documents pertinents et non pertinents. Un
passage est jug&#233; pertinent s&#8217;il contient la r&#233;ponse &#224; la question, laquelle est rep&#233;r&#233;e par une
expression r&#233;guli&#232;re, telle que &#8220;John( F.)? Kerry&#8221;, qui indique que les caract&#232;res &#8220; F.&#8221; sont
facultatifs. Cette m&#233;thode laisse passer du bruit dans la liste de documents pertinents, mais elle
permet d&#8217;automatiser la s&#233;lection de ces documents.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quels types de connaissance s&#233;mantique pour Questions-R&#233;ponses ?
</p>
<p>3.1 Eviter les biais
</p>
<p>Pour la constitution du corpus, il est n&#233;cessaire d&#8217;effectuer une requ&#234;te sur un ensemble de
documents en &#233;vitant que cette requ&#234;te n&#8217;introduise un biais par rapport au sujet de l&#8217;&#233;tude.
Dans notre cas l&#8217;&#233;tude porte sur les reformulations des mots de la question, et notamment, les
reformulations obtenues en suivant les liens propos&#233;s par WordNet. Son but est de mesurer
la fiabilit&#233; de certaines reformulations par rapport &#224; d&#8217;autres, ou plus pr&#233;cis&#233;ment de certaines
caract&#233;ristiques de ces reformulations.
</p>
<p>Nous avons opt&#233; pour l&#8217;utilisation de requ&#234;tes bool&#233;ennes plut&#244;t que vectorielles car ces pre-
mi&#232;res permettent de mieux contr&#244;ler le contenu des documents rapport&#233;s.
</p>
<p>Or, si la requ&#234;te se pr&#233;sente sous la forme d&#8217;une conjonction de termes, ces termes appara&#238;tront
n&#233;cessairement dans les documents pertinents et les documents non pertinents. Ceci rendrait
inutilisable une mesure fond&#233;e sur la comparaison des fr&#233;quences d&#8217;un terme entre documents
pertinents et non pertinents.
</p>
<p>On peut tenter de pallier ce probl&#232;me en pr&#233;sentant les requ&#234;tes sous la forme d&#8217;une conjonction
de disjonctions o&#249; chaque terme de la question est remplac&#233; dans la requ&#234;te par une disjonc-
tion de variantes de ce terme. Cependant, les variantes choisies sont favoris&#233;es par rapport aux
autres. De plus, si ces variantes sont extraites d&#8217;une ressource telle que WordNet, les reformula-
tions apparaissant dans les documents collect&#233;s seront principalement celles de cette ressource,
ce qui r&#233;duirait la port&#233;e de l&#8217;&#233;tude &#224; un type de relations tr&#232;s particuli&#232;res.
</p>
<p>3.2 Requ&#234;te et filtrage
</p>
<p>La m&#233;thode que nous avons retenue est la cr&#233;ation &#224; partir des termes de la question d&#8217;une
&#8220;requ&#234;te &#224; trou&#8221;, c&#8217;est-&#224;-dire une requ&#234;te o&#249; au moins un des termes ne sera pas repr&#233;sent&#233;. Le
ou les termes omis seront l&#8217;objet de l&#8217;&#233;tude. Les autres termes sont reformul&#233;s gr&#226;ce WordNet.
Les variantes autoris&#233;es sont les synonymes des termes de la question, ainsi que les mots le plus
courant des synsets situ&#233;s &#224; un lien de distance. L&#8217;&#233;tendue des reformulations est volontairement
r&#233;duite afin que la requ&#234;te engendr&#233;e ne rapporte pas trop de documents non pertinents. Une
plus grande expansion de la requ&#234;te augmenterait le bruit qui est d&#233;j&#224; important (CF Table 2).
Enfin, les termes les moins significatifs de la question ne sont pas utilis&#233;s dans les requ&#234;tes.
Cette significativit&#233; est estim&#233;e par un expert humain qui classe les termes de la question par
ordre d&#233;croissant. Par exemple, les termes de la question &#8220;What is the name of the volcano that
destroyed the ancient city of Pompeii?&#8221; ont &#233;t&#233; class&#233;s dans l&#8217;ordre suivant :
</p>
<p>Pompeii &gt; volcano &gt; destroy &gt; ancient &gt; city.
De mani&#232;re syst&#233;matique, les entit&#233;s nomm&#233;es sont consid&#233;r&#233;s comme de meilleurs filtres que
les noms communs et les autres cat&#233;gories grammaticales d&#233;crites dans WordNet.
</p>
<p>Cet ordre permet ensuite de cr&#233;er des requ&#234;tes ad&#233;quates de fa&#231;on automatique. Par exemple, si
l&#8217;on veut &#233;tudier les reformulations possibles du terme &#8220;destroy&#8221;, on utilisera pour la requ&#234;te :
</p>
<p>Pompeii &amp; expansion(volcano) &amp; expansion( ancient )
avec expansion( volcano) = (mountain | mount | crater | volcano)
</p>
<p>Une fois les documents rapport&#233;s, on s&#233;pare les documents pertinents des non pertinents. Il faut
noter que par cette m&#233;thode, les documents pertinents sont obtenus par une m&#234;me requ&#234;te, ce
qui r&#233;duit les risques de biais.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Barbier
</p>
<p>Certains patrons de r&#233;ponses sont des filtres tr&#232;s impr&#233;cis, par exemple une date ou un per-
sonnage souvent cit&#233; dans le corpus pour des raisons vari&#233;es. Dans certains cas, la question
contient des termes assez pr&#233;cis - par exemple, une entit&#233; nomm&#233;e - pour permettre un filtrage
efficace des documents. Mais si ce n&#8217;est pas le cas, il peut &#234;tre n&#233;cessaire de rendre la requ&#234;te
plus pr&#233;cise en ajoutant des termes ou en r&#233;duisant l&#8217;&#233;tendue des reformulations. Dans le cas
extr&#232;me, on pourra supprimer une question de l&#8217;&#233;tude.
</p>
<p>3.3 R&#233;sultat
</p>
<p>Le corpus obtenu contient 5952 documents jug&#233;s pertinents par le programme et 65419 docu-
ments jug&#233;s non-pertinents. Il a &#233;t&#233; test&#233; manuellement pour 16 questions contenant 114 termes.
Nous avons obtenu 295 documents pertinents, et 156 erreurs, ce qui correspond &#224; un bruit de
35%. Un nettoyage manuel du corpus semble donc n&#233;cessaire.
</p>
<p>patron + patron -
5952 65419
</p>
<p>patron + patron -
valid&#233; + 294(65%) -
valid&#233; - 156(35%) -
</p>
<p>Table1: taille du corpus brut. Table2: qualit&#233; du corpus valid&#233;.
</p>
<p>Dans le sous-corpus valid&#233;, le nombre moyen de documents pertinents rapport&#233;s par question
est de 10,6. Ce nombre est tr&#232;s variable d&#8217;une question &#224; l&#8217;autre. Les extr&#234;mes valent 1 et 43.
Dans les deux quartiles centraux, ce nombre &#233;volue de 3 &#224; 11,5. Cette variabilit&#233; s&#8217;explique
par le fait que certaines informations sont r&#233;p&#233;t&#233;es (vie priv&#233;e de stars, &#233;v&#233;nements sportifs
marquants) alors que d&#8217;autres sont tr&#232;s peu cit&#233;s. D&#8217;autre part, on doit noter que les filtrages
effectu&#233;s pour r&#233;duire le bruit du corpus font n&#233;cessairement dispara&#238;tre certains documents
pertinents.
</p>
<p>4 Quelle s&#233;mantique pour les syst&#232;mes de questions r&#233;ponses
</p>
<p>4.1 Les types de reformulations pr&#233;sentes.
</p>
<p>A pr&#233;sent, analysons les types de reformulations pr&#233;sentes dans le corpus. Ceci peut s&#8217;effectuer
manuellement en recensant et examinant les liens, ou de fa&#231;on plus automatique, en mesurant
pour diff&#233;rentes caract&#233;ristiques des liens, les fr&#233;quences d&#8217;apparition dans les phrases con-
tenant la r&#233;ponse, compar&#233;es aux fr&#233;quences d&#8217;apparition dans le reste du corpus.
</p>
<p>4.1.1 Etude manuelle des liens
</p>
<p>Nous avons examin&#233; les liens trouv&#233;s par le programme, et nous avons not&#233; ceux qui semblaient
pertinents. Pour qu&#8217;un lien nous semble pertinent il faut qu&#8217;un trait s&#233;mantique se transmette
d&#8217;un bout &#224; l&#8217;autre de la cha&#238;ne. On peut avoir plusieurs niveaux de pertinence, selon que les
traits s&#233;mantiques partag&#233;s sont plus ou moins sp&#233;cifiques. Par exemple, le lien
</p>
<p>volcano-(hyponyme)-&gt;Krakatau-(holonyme)-&gt;Indon&#233;sie-(hyp&#233;ronyme)-&gt;country-(hyponyme)-
&gt; Philipines</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quels types de connaissance s&#233;mantique pour Questions-R&#233;ponses ?
</p>
<p>poss&#232;de une certaine pertinence, car il relie des noms g&#233;ographiques, mais celle-ci est tr&#232;s faible.
</p>
<p>Dans le corpus de test, on distingue deux cat&#233;gories de liens int&#233;ressants : des liens fortement
pertinents, pointant vers des mots susceptibles de faire partie de la r&#233;ponse. Et d&#8217;autres plus
distants, pointant vers des mots qui forment le th&#232;me g&#233;n&#233;ral de l&#8217;article. Dans un article sur
l&#8217;&#233;ruption du V&#233;suve on trouve des mots comme earth, Naples, Campania, qui viennent ren-
forcer les champs th&#233;matiques de la question.
</p>
<p>Cette observation, &#224; v&#233;rifier sur un corpus plus important, nous indique que des relations assez
distantes pourront peut-&#234;tre aider au filtrage de la question.
</p>
<p>Diff&#233;rentes cat&#233;gories de lien Voici une courte description des types de liens trouv&#233;s dans le
corpus. Aussi la majorit&#233; des liens trouv&#233;s concernent les noms. Les relations entre verbes sont
moins fr&#233;quentes. Les relations li&#233;es aux adjectifs sont rarement pertinentes.
Nous notons une part importante de liens triviaux. Il s&#8217;agit de la reprise du mot de la question
tel quel ou sous une forme fl&#233;chie. Les reformulations par synonyme sont &#233;galement pr&#233;sentes.
Pour certains mots, les reformulations morphologiques, permettant de changer de cat&#233;gorie
grammaticale sont importantes : par exemple pour la question
</p>
<p>&#8220;When did the shooting in Columbine happen?&#8221;
Les reformulations les plus trouv&#233;es sont les verbes to kill et to shoot (260 oc-
curences dans le corpus) devant le nom shooting (50 occurences).
</p>
<p>Les relations d&#8217;hyponymie-hyp&#233;ronymie et de m&#233;ronymie-holonymie fournissent toutes deux
des liens pertinents. Cette pr&#233;pond&#233;rance des relations entre noms s&#8217;explique par le fait que
les noms sont la cat&#233;gorie grammaticale la plus pr&#233;sente dans la question, et que le r&#233;seau des
noms contient plus de liens que celui des verbes.
</p>
<p>Nous remarquons que les reformulations se font parfois par une succession d&#8217;une seule relation,
par exemple, une succession d&#8217;hyp&#233;ronymes :
</p>
<p>political_party -(hyp&#233;ronyme)-&gt; organization -(hyp&#233;ronyme)-&gt; social_group -(hyp&#233;ronyme)-
&gt; group
</p>
<p>Mais des reformulations de ce type sont rares par rapport &#224; celles reliant deux concepts fr&#232;res,
c&#8217;est-&#224;-dire deux concepts pointant vers un m&#234;me concept par une m&#234;me relation. La relation
emprunt&#233;e est le plus souvent celle d&#8217;hyp&#233;ronymie-hyponymie, mais on peut aussi trouver les
relations d&#8217;holonymie-m&#233;ronymie et d&#8217;implication comme dans les exemples ci-dessous.
</p>
<p>Relation de co-m&#233;ronymie correspondant &#224; une proximit&#233; g&#233;ographique :
Vesuvius-(holonyme)-&gt;Italy&lt;-(holonyme)-Pompeii
</p>
<p>Verbes reli&#233;s par une relation de co-implication :
</p>
<p>destroy -(hyp&#233;ronyme)-&gt; smother -(implique)-&gt; cover &lt;-(implique)- entomb
De nombreuses relations de co-hyponymie
</p>
<p>score -(hyp&#233;ronyme)-&gt; achieve -(hyp&#233;ronyme)-&gt; succeed &lt;-(hyp&#233;ronyme)- hit
city -(hyp&#233;ronyme)-&gt; municipality &lt;-(hyp&#233;ronyme)- town
</p>
<p>Ces observations sont encourageantes et une analyse d&#233;taill&#233;e sur un corpus plus fourni permet-
tra d&#8217;y puiser les &#233;l&#233;ments d&#8217;une heuristique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Barbier
</p>
<p>4.2 Fiabilit&#233; des reformulations.
</p>
<p>4.2.1 Protocole d&#8217;&#233;valuation d&#8217;une heuristique
</p>
<p>Caract&#233;ristiques et heuristiques Les liens de WordNet permettent de constituer des chemins
plus o&#249; moins longs pour relier des mots sens&#233;s poss&#233;der un lien s&#233;mantique. Cependant, plus
on s&#8217;&#233;loigne et plus on risque d&#8217;aboutir &#224; un mot non pertinent pour la question pos&#233;e. Afin de
r&#233;duire le bruit engendr&#233;, on peut utiliser des heuristiques fond&#233;es sur les caract&#233;ristiques de la
g&#233;om&#233;trie des chemins parcourus (Budanitsky, 1999).
Le corpus peut servir &#224; &#233;valuer la fiabilit&#233; d&#8217;heuristiques complexes ou de caract&#233;ristiques &#233;l&#233;-
mentaires des chemins, telle que leur longueur ou la pr&#233;sence d&#8217;une relation particuli&#232;re. Ces
mesures &#233;l&#233;mentaires peuvent permettre de justifier ou invalider des heuristiques plus com-
plexes.
</p>
<p>Nous d&#233;crivons ci-apr&#232;s un cadre commun pour l&#8217;&#233;valuation d&#8217;heuristiques complexes et de
caract&#233;ristiques unitaires.
</p>
<p>Evaluer la fiabilit&#233; des caract&#233;ristiques On peut repr&#233;senter heuristiques et caract&#233;ristiques
sous la forme d&#8217;une fonction qui &#224; chaque &#233;l&#233;ment d&#8217;un ensemble (ici, l&#8217;ensemble des chemins)
associe une valeur, soit bool&#233;enne, soit r&#233;elle.
</p>
<p>Nous avons pour l&#8217;instant consid&#233;r&#233; des caract&#233;ristiques bool&#233;ennes telles que &#8220;est de longueur
N&#8221; ou &#8220;Contient la relation R&#8221;. On calcule parmi les chemins v&#233;rifiant cette caract&#233;ristique,
combien sont &#8220;pertinents&#8221;, c&#8217;est &#224; dire pointent vers un document pertinent. On calcule la
pr&#233;cision de cette caract&#233;ristique dans le corpus qui vaut :
</p>
<p>&#1;&#3;&#2;&#5;&#4;&#7;&#6;&#9;&#8;&#11;&#10;&#12;&#6;&#14;&#13;&#16;&#15;&#18;&#17;&#19;&#6;&#14;&#20;&#22;&#21;&#12;&#10;&#23;&#13;&#24;&#6;&#14;&#13;&#5;&#21;&#25;&#15;&#5;&#26;ff&#6;&#14;&#20;&#22;&#10;flfiffi&#10;&#12;&#31;&#7;&#13;&#24;&#21;&#18;&#8; &#31;&quot;!#&#31;&#7;&#20;$&#31;ff!%&#21;fl&#6;&#14;&#20;&#22;&#10;fl&#15;&amp;&#21;&#12;&#10;&#12;')(*&#6;
</p>
<p>&#1;+&#2;&#19;&#21;fl,)&#21;fl&#31;ff&#8;$&#4;ff&#6;&#9;&#8;&#11;&#10;&#12;&#6;#&#13;&#9;&#15;&#5;&#26;ff&#6;&#14;&#20;)&#10;flfiffi&#10;&#12;&#31;ff&#13;&#5;&#21;ffi&#8;-&#31;.!&amp;&#31;&#7;&#20;$!%&#21;fl&#6;&#14;&#20;&#22;&#10;&#12;&#15;#&#21;&#12;&#10;&#12;')(*&#6;
</p>
<p>La valeur de la pr&#233;cision calcul&#233;e d&#233;pend du ratio entre nombre de documents pertinents et
non-pertinents. Elle n&#8217;a donc pas de r&#233;alit&#233; absolue mais permet d&#8217;effectuer des comparaisons
entre deux caract&#233;ristiques ou heuristiques obtenues par le m&#234;me protocole.
</p>
<p>Estimer la significativit&#233; des mesures Nous appliquerons &#224; notre protocole une m&#233;thode de
validation par r&#233;&#233;chantillonnement utilis&#233;e par exemple dans (Voorhees, 2002) pour la cam-
pagne d&#8217;&#233;valuation TREC11. Cette m&#233;thode permettra d&#8217;estimer la variance des mesures effec-
tu&#233;es et de savoir si elles sont fiables. Pour l&#8217;instant nous n&#8217;avons pas effectu&#233; cette &#233;tape de
validation.
</p>
<p>4.2.2 Les caract&#233;ristiques test&#233;es
</p>
<p>Nous avons commenc&#233; par tester des caract&#233;ristiques &#233;l&#233;mentaires des chemins.
</p>
<p>Longueur La premi&#232;re est la longueur. Le r&#233;sultat est pr&#233;visible. En effet, on s&#8217;attend &#224; ce
que plus un chemin est de longueur courte et plus il est fiable que le protocole d&#8217;&#233;valuation.
</p>
<p>longueur 0 1 2 3 4
pr&#233;cision(%) 17* 40 20 10 5
</p>
<p>Table3: fiabilit&#233; des reformulations en fonction de la distance dans WordNet.
* Pr&#233;sence d&#8217;un biais dans le corpus pour les reformulations de longueur nulle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quels types de connaissance s&#233;mantique pour Questions-R&#233;ponses ?
</p>
<p>Ce r&#233;sultat est tr&#232;s int&#233;ressant car il montre bien que la fiabilit&#233; d&#8217;un lien d&#233;cro&#238;t avec sa
longueur.
</p>
<p>Effets de la combinaison de plusieurs relations Il semble que les relations apparaissent
pr&#233;f&#233;rentiellement accompagn&#233;es de leurs relation oppos&#233;e, par exemple, la relation d&#8217;hyp&#233;ronymie
accompagn&#233;e d&#8217;une ou plusieurs relation d&#8217;hyponymie. Nous voulons v&#233;rifier si certaines re-
lations &#8220;vont bien ensemble&#8221; en termes de fiabilit&#233; de la reformulation obtenue, ou si d&#8217;autres
assortiments ont des effets n&#233;gatifs. Ce probl&#232;me revient &#224; mesurer par le protocole que nous
avons pr&#233;sent&#233; la fiabilit&#233; des deux caract&#233;ristiques bool&#233;ennes suivantes :
</p>
<p>Cooccurrence exclusive : vraie s&#8217;il y a pr&#233;sence dans un chemin de deux types de relation &#224;
l&#8217;exclusion de tout autre type
</p>
<p>Cooccurrence non exclusive : vraie en cas de pr&#233;sence dans un chemin de ces deux types de
relation qu&#8217;il y ait ou non d&#8217;autres types de relations pr&#233;sents.
</p>
<p>Nous nous sommes limit&#233; aux cooccurrences non exclusives de 2 relations :
</p>
<p>hype hypo
hype 6,4% 7,8%
hypo 7,8% 4,9%
</p>
<p>mero holo
mero 3.6% 6,3%
holo 6,3% *40%
</p>
<p>*non significatif
Table4: fiabilit&#233; des reformulations selon les liens qui les composent.
</p>
<p>La cooccurrence d&#8217;un type de relation avec lui-m&#234;me n&#8217;est v&#233;rifi&#233;e que si cette relation est
pr&#233;sente deux fois dans le chemin.
</p>
<p>En ce qui concerne les cooccurences d&#8217;hyponymies et d&#8217;hyp&#233;ronymies, on constate que les
chemins contenant uniquement l&#8217;une ou l&#8217;autre relation sont moins fiables que ceux contenant
les deux. Une interpretation possible de ce r&#233;sultat est que les chemins qui ne sont constitu&#233;s
que de l&#8217;une de ces deux relations causent un changement du niveau de g&#233;n&#233;ralit&#233; entre un
terme et sa reformulation. Au contraire une reformulation mixte a plut&#244;t tendance &#224; conserver
le niveau de g&#233;n&#233;ralit&#233;.
</p>
<p>Ces r&#233;sultats rejoignent les observations sur le corpus qui soulignaient la pr&#233;sence de reformu-
lations mettant en relation des concepts &#8220;fr&#232;res&#8221;.
</p>
<p>4.3 Utilit&#233; d&#8217;une cat&#233;gorie de reformulation
</p>
<p>Notre travail pr&#233;sente une m&#233;thode pour &#233;valuer la fiabilit&#233; de diff&#233;rentes cat&#233;gories de refor-
mulations. Le probl&#232;me suivant est d&#8217;&#233;valuer l&#8217;utilit&#233; de ces cat&#233;gories de reformulations. Il
faut pour cette &#233;tude d&#233;finir ce qu&#8217;est l&#8217;utilit&#233; d&#8217;une cat&#233;gorie.
</p>
<p>Une premi&#232;re piste est de consid&#233;rer qu&#8217;une variante d&#8217;un terme est utile si le fait de la prendre
en compte permet de trouver au moins un document pertinent alors qu&#8217;ignorer cette variante
n&#8217;aurait pas permis d&#8217;en trouver. Le recensement de ces variantes utiles permettra d&#8217;&#233;valuer
dans quelle mesures des cat&#233;gories de variantes sont utiles &#224; la recherche des documents perti-
nents.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Barbier
</p>
<p>Conclusion
</p>
<p>Cette &#233;tude montre la possibilit&#233; d&#8217;utiliser un corpus de questions r&#233;ponses constitu&#233; semi-
automatiquement pour &#233;tudier les reformulations dans le cadre des syst&#232;mes de questions r&#233;ponses.
</p>
<p>Les r&#233;sultats obtenus peuvent nous guider dans le choix de reformulations fiables. Ils semblent
notamment indiquer l&#8217;utilit&#233; et la fiabilit&#233; de reformulations par mots &#8220;fr&#232;res&#8221;. Un autre facteur
important pour juger de l&#8217;utilit&#233; d&#8217;un type de reformulations est la fr&#233;quence avec laquelle celle-
ci peut s&#8217;utiliser. Ces consid&#233;rations n&#233;cessitent une &#233;tude de fr&#233;quence sur corpus que nous
effectuerons dans nos travaux futurs.
</p>
<p>Notre travail a port&#233; sur WordNet car c&#8217;est une ressource de large couverture lexicale et forte-
ment structur&#233;e. Cependant, le corpus produit n&#8217;est pas biais&#233; en faveur de WordNet, et per-
mettra par cons&#233;quent l&#8217;&#233;tude d&#8217;autres ressources s&#233;mantiques. Une perspective de mon travail
est d&#8217;&#233;tudier l&#8217;utilit&#233; de ressources s&#233;mantiques constitu&#233;es de liens nom-verbe et acquises au-
tomatiquement sur corpus par (de Chalendar G., 2001).
</p>
<p>R&#233;f&#233;rences
BUDANITSKY A. (1999). Lexical semantic relatedness and its application in natural language process-
ing. Rapport interne CSRG-390, University of Toronto, Department of Computer Science.
CLAVEAU V. &amp; SEBILLOT P. (2004). Extension de requ&#234;tes par lien s&#233;mantique nom-verbe acquis sur
corpus. In Actes de TALN 2004.
</p>
<p>DE CHALENDAR G. (2001). SVETLAN&#8217;, un syst&#232;me de structuration du lexique guid&#233; par la d&#233;termi-
nation automatique du contexte th&#233;matique. PhD thesis, Universit&#233; Paris XI.
FELLBAUM C. (1998). WordNet, an electronic lexical database. Cambridge, MA: The MIT Press.
FERRET O., GRAU B., HURAULT-PLANTET M., ILLOUZ G. &amp; JACQUEMIN C. (2001). Utilisation
des entit&#233;s nomm&#233;es et des variantes terminologiques dans un syst&#232;me de question-r&#233;ponse. In Actes de
TALN 2001.
</p>
<p>GRAU B. (2004). Les syst&#232;mes de question r&#233;ponse. In M. IHADJADENE, Ed., M&#233;thodes avanc&#233;es pour
les syst&#232;mes de recherche d&#8217;informations. Paris: Hermes Sciences.
JACQUEMIN C. (1999). Syntagmatic and paradigmatic representation of term variation. In Proceedings
of the 37th Annual Meeting of the Association for Computational Linguistics (ACL&#8217;99), p. 341&#8211;348.
JIJKOUN V. &amp; DE RIJKE M. (2004). Information extraction for question answering : Improving recall
through syntactic patterns. In Proceedings of ACL 2004.
MAGNINI B., NEGRI M., PREVETE R. &amp; TANEV H. (2002). Mining knowledge from repeated co-
occurences: Diogene at trec 2002. In Proceedings of the 11th Text REtrieval Conference, (TREC11).
MOLDOVAN D., HARABAGIU S., GIRJU R., MORARESCU P., LACATUSU F., NOVISCHI A., BAD-
ULESCU A. &amp; BOLOHAN O. (2002). Lcc tools for question answering. In Proceedings of the 11th Text
REtrieval Conference (TREC 2002).
VOORHEES E. (2002). Overall view of the question answering track. in special publication. In The 11th
Text REtrieval Conference (TREC 2002).</p>

</div></div>
</body></html>