<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apport de la diacritisation dans l&#8217;analyse morphosyntaxique de l&#8217;arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 247&#8211;254,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Apport de la diacritisation dans  
l&#8217;analyse morphosyntaxique de l&#8217;arabe  
</p>
<p>Ahmed Hamdi     
Aix Marseille Universit&#233;, LIF-CNRS, Marseille 
ahmed.hamdi@lif.univ-mrs.fr 
</p>
<p>RESUME ____________________________________________________________________________________________________________   
Ce travail s&#8217;inscrit dans le cadre de l&#8217;analyse morphologique et syntaxique automatique 
de la langue arabe. Nous nous int&#233;ressons au traitement de la diacritisation et &#224; son 
apport pour l&#8217;analyse morphologique. En effet, la plupart des analyseurs morphologiques 
et des &#233;tiqueteurs morphosyntaxiques existants ignorent les diacritiques pr&#233;sents dans le 
texte &#224; analyser et commettent des erreurs qui pourraient &#234;tre &#233;vit&#233;es. Dans cet article, 
nous proposons une m&#233;thode qui prend en consid&#233;ration les diacritiques lors de 
l&#8217;analyse, et nous montrons que cette prise en compte permet de diminuer 
consid&#233;rablement le taux d&#8217;erreur de l&#8217;analyse morphologique selon le taux de 
diacritiques du texte trait&#233;. 
ABSTRACT _________________________________________________________________________________________________________  
Apport of Diacritization in Arabic Morpho-Syntactic Analysis 
This work is concerned with the automatic morphological and syntactical analysis of the 
Arabic language. It focuses on diacritization and on its contribution to morphological 
analysis. Most of existing morphological analyzers and syntactical taggers do not take 
diacritics into account; as a consequence, they make mistakes that could have been 
avoided. 
In this paper, we propose a method which process diacritics. We show that doing so 
reduces considerably the morphological error rate, depending on the diacritics rate in 
the input text. 
MOTS-CLES : diacritisation, traitement automatique, analyse morphosyntaxique, langue 
arabe.  
KEYWORDS : diacritization, computer processing, morpho-syntaxic analysis, Arabic 
language. 
 
 
 
 
 
 
 
</p>
<p>247</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction 
En plus de sa morphologie fortement flexionnelle, d&#233;rivationnelle et agglutinante, la 
langue arabe se caract&#233;rise par l&#8217;absence des voyelles courtes (diacritiques) dans la 
plupart des textes &#233;crits. En effet, contrairement au fran&#231;ais, les voyelles courtes arabes 
ne sont pas des lettres de l&#8217;alphabet, ce sont des signes diacritiques qui se rajoutent aux 
consonnes (lettres) et qui jouent le m&#234;me r&#244;le que les voyelles dans les autres langues. La 
diacritisation en arabe est l&#8217;op&#233;ration qui consiste &#224; attribuer des diacritiques aux lettres 
des mots non diacrit&#233;s. Cet exercice est &#224; la fois classique et important dans le traitement 
automatique de l&#8217;arabe. 
G&#233;n&#233;ralement, les &#233;crits en arabe sont non diacrit&#233;s et c&#8217;est au lecteur de deviner les 
diacritiques des textes au moment de la lecture. En revanche, les textes religieux et 
quelques ouvrages scolaires sont enti&#232;rement diacrit&#233;s. D&#8217;autres ressources, telles que les 
textes journalistiques, peuvent &#234;tre partiellement diacrit&#233;s. Les diacritiques rajout&#233;s dans 
ces &#233;crits sont utilis&#233;s pour lever des ambigu&#239;t&#233;s morphologiques, syntaxiques et parfois 
s&#233;mantiques. Les diacritiques casuels, par exemple, servent &#224; lever l&#8217;ambigu&#239;t&#233; 
syntaxique. Ces diacritiques s&#8217;associent &#224; la derni&#232;re lettre d&#8217;un mot &#224; valeur nominale et 
ils marquent le cas. Ils aident &#224; identifier les fonctions syntaxiques des mots dans une 
phrase. Les diacritiques affect&#233;s aux autres lettres sont appel&#233;s lexicaux, ils sont 
employ&#233;s pour lever les ambigu&#239;t&#233;s morphologiques et s&#233;mantiques.  
On pourrait faire un parall&#232;le entre la diacritisation de l&#8217;arabe et l&#8217;accentuation du 
fran&#231;ais. Prenons le mot &#171; presse &#187; comme exemple,  ce mot peut &#234;tre reconnu comme un 
nom &#171; presse &#187; ou bien un participe pass&#233; &#171; press&#233; &#187;.  La diff&#233;rence entre accentuation et 
diacritisation est que, en arabe, cette op&#233;ration associe &#224; chaque lettre d&#8217;un mot un 
diacritique. 
Dans cet article, nous allons utiliser la convention de translitt&#233;ration d&#233;finie par 
(Buckwalter, 2004), nous repr&#233;sentons entre crochets les caract&#232;res translitt&#233;r&#233;s. La 
translitt&#233;ration est l&#8217;op&#233;ration qui consiste &#224; utiliser un autre jeu de caract&#232;res pour 
faciliter la lecture du lecteur francophone. Le diacritique est repr&#233;sent&#233; apr&#232;s la 
consonne &#224; laquelle il est affect&#233;. Les diacritiques arabes sont class&#233;s en trois cat&#233;gories :  
</p>
<p>&#8211; les diacritiques simples qui sont au nombre de quatre    [a],      [u],     [i] et     
[o], tous ces diacritiques se prononcent de la m&#234;me fa&#231;on que leurs 
translitt&#233;rations sauf le dernier qui indique l&#8217;absence de tout son.  
</p>
<p>&#8211; les diacritiques doubles sont     [F],      [N] et     [K] : il s&#8217;agit de diacritiques 
casuels, ils produisent, respectivement le m&#234;me son que les trois premi&#232;res 
voyelles simples avec l&#8217;ajout du son &#171; n &#187; &#224; la fin. Exemple :    se prononce &#171; an &#187;.  
</p>
<p>&#8211; le diacritique    appel&#233;  &#171;chadda&#187;, qui a pour effet le doublement de la lettre &#224; 
laquelle il est associ&#233;e. 
</p>
<p>Un mot arabe peut &#234;tre non diacrit&#233;, partiellement ou enti&#232;rement diacrit&#233;.  L&#8217;absence 
des diacritiques dans un mot provoque des difficult&#233;s dans le traitement automatique. 
C&#8217;est-&#224;-dire, qu&#8217;un mot non diacrit&#233; est plus ambigu qu&#8217;un mot partiellement diacrit&#233;.  
D&#8217;apr&#232;s (Debili, 1998), 74% des mots en moyenne acceptent plus d&#8217;une diacritisation 
lexicale, et 89.9% des noms acceptent plus d&#8217;un diacritique casuel. La proportion des 
mots ambigus est de 90.5% si les comptages portent sur leurs diacritisations globales 
</p>
<p>248</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(lexicales et casuelles). 
Pour illustrer ces ambigu&#239;t&#233;s de fa&#231;on plus claire, prenons l&#8217;exemple du mot non diacrit&#233; 
&#1583;&#1585;&#1608; [wrd]. Ce mot peut &#234;tre reconnu comme &#233;tant:  
</p>
<p>&#8211; le  verbe   &#1583;  &#1585;  &#1608; [warada] (appara&#238;tre), troisi&#232;me personne du singulier, pass&#233;, voix 
active : &#171;est apparu&#187;,  
</p>
<p>&#8211; le verbe   &#1583; &#1585;  &#1608; [wurida] (&#234;tre apparu), troisi&#232;me personne du singulier, pass&#233;, voix 
passive : &#171;a &#233;t&#233; apparu&#187;,  
</p>
<p>&#8211; le verbe   &#1583;  &#1585;  &#1608; [war~ada] (fleurir), troisi&#232;me personne du singulier, pass&#233;, voix 
active : &#171; a fleuri &#187;, 
</p>
<p>&#8211; le verbe    &#1583;  &#1585;  &#1608;  [wur~ida] (faire fleurir), troisi&#232;me personne du singulier, pass&#233;, 
voix passive : &#171; a fait fleurir &#187;, 
</p>
<p>&#8211; le nom &#1583;  &#1585;  &#1608;  [warod] (roses), cette forme peut prendre cinq voyelles casuelles 
diff&#233;rentes suivant le contexte. 
</p>
<p>En comptant, aussi, les deux formes agglutin&#233;es   &#1583;  &#1585;+  &#1608; [wa+rad~a] (et a rendu) et   &#1583;  &#1585;+  &#1608; 
[wa+rud~a] (et rends/et a &#233;t&#233; rendu), la forme &#1583;&#1585;&#1608; [wrd] pr&#233;sente au total 11 
diacritisations potentielles, pour 4 lemmes et 2 cat&#233;gories grammaticales. Cet exemple 
montre bien que l&#8217;ambigu&#239;t&#233; vocalique d&#8217;un mot produit des ambigu&#239;t&#233;s lemmatiques et 
grammaticales.  
Bien que les diacritiques soient destin&#233;s &#224; lever les ambigu&#239;t&#233;s lors d&#8217;un traitement 
automatique, la majorit&#233; des analyseurs morphosyntaxiques de l&#8217;arabe comme celui de 
Buckwalter (Buckwalter, 2004), Xerox (Beesley, 2005) ou l&#8217;analyseur MADA (Habash, 
2005) n&#8217;analysent que des textes non diacrit&#233;s &#224; cause du manque de ressources arabes 
diacrit&#233;es. Par cons&#233;quent, si l&#8217;entr&#233;e est partiellement diacrit&#233;e, ces analyseurs 
commencent par &#233;liminer tous les diacritiques, puis ils font l&#8217;analyse comme si l&#8217;entr&#233;e 
&#233;tait non diacrit&#233;e. Les analyseurs morphosyntaxiques de l&#8217;arabe ne profitent donc pas 
des diacritiques pr&#233;sents dans les textes pour d&#233;sambigu&#239;ser les mots. Dans le cadre du 
travail pr&#233;sent&#233; ici, nous proposons une m&#233;thode qui permet de prendre en compte ces 
diacritiques. Leur prise en compte am&#233;liorera naturellement la diacritisation 
automatique. Nous nous int&#233;ressons ici &#224; &#233;tudier l&#8217;apport de ces diacritiques sur les 
autres niveaux d&#8217;analyse : l&#8217;&#233;tiquetage grammatical et l&#8217;analyse morphologique.      
Dans la section 2 de cet article, nous pr&#233;sentons la m&#233;thode propos&#233;e, ainsi que 
l&#8217;analyseur auquel nous avons int&#233;gr&#233; notre proposition. Dans la section 3, nous 
d&#233;crivons les exp&#233;rimentations r&#233;alis&#233;es pour &#233;valuer notre travail, et nous donnons 
enfin les r&#233;sultats de l&#8217;analyse morphologique avant et apr&#232;s l&#8217;ajout de notre solution. 
</p>
<p>2 Description de la m&#233;thode 
Afin d&#8217;&#233;tudier d&#8217;une fa&#231;on  concr&#232;te l&#8217;influence des diacritiques sur l&#8217;analyse 
morphologique, nous avons introduit un ensemble de modules dans l&#8217;analyseur MADA. 
Nous commen&#231;ons par pr&#233;senter cet analyseur, en nous  focalisant sur les erreurs 
provoqu&#233;es par la  non prise en compte des diacritiques lors de l&#8217;analyse. Enfin, nous 
d&#233;crivons en d&#233;tail la m&#233;thode avec laquelle nous visons &#224; am&#233;liorer les performances de 
MADA. 
</p>
<p>249</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.1 L&#8217;analyseur morphosyntaxique MADA 
MADA (Morphological Analyzer and Disambiguator of Arabic) (Habash, 2005) est un 
analyseur morphologique de l&#8217;arabe. Cet analyseur r&#233;alise la segmentation, la 
diacritisation, la lemmatisation, l&#8217;&#233;tiquetage grammatical et l&#8217;analyse morphologique.  
Les donn&#233;es d&#8217;apprentissage de MADA proviennent du corpus the Penn Arabic Treebank 
PATB (Ma&#226;mouri, 2004), le corpus d&#8217;apprentissage contient 120 000 mots alors que       
12 000 mots ont &#233;t&#233; utilis&#233;s pour l&#8217;&#233;valuation. Nous pr&#233;sentons les r&#233;sultats de 
l&#8217;&#233;valuation dans la section suivante. 
Lors de l&#8217;analyse d&#8217;un texte, MADA produit pour chaque mot toutes ses analyses 
possibles, ensuite, le mod&#232;le SVM (Support Vector Machines) est utilis&#233; pour g&#233;n&#233;rer une 
pr&#233;diction de quelques traits morphologiques. Enfin, MADA fait la hi&#233;rarchisation des 
analyses retourn&#233;es, la meilleure analyse &#233;tant celle qui s&#8217;accorde le plus avec la 
pr&#233;diction.  
Comme nous l&#8217;avons &#233;voqu&#233; ci-dessus, l&#8217;un des inconv&#233;nients de cet analyseur est qu&#8217;il 
ne prend pas en consid&#233;ration les diacritiques de l&#8217;entr&#233;e, et peut donc produire des 
analyses incompatibles avec l&#8217;entr&#233;e. Une entr&#233;e E est non compatible avec une analyse 
A de MADA, si les diacritiques de E ne sont pas tous pr&#233;sents dans la diacritisation de A. 
Prenons comme exemple le mot partiellement diacrit&#233;       [ktbat], ce mot poss&#232;de un 
diacritique [a] associ&#233; &#224; la troisi&#232;me lettre du mot [ktbt]. Les trois premi&#232;res 
diacritisastions renvoy&#233;es par MADA sont respectivement : 
</p>
<p>1.        [katabotu] (j&#8217;ai &#233;crit) 
2.        [katabota] (tu as &#233;crit) 
3.        [katabat] (elle a &#233;crit) 
</p>
<p>Le diacritique affect&#233; &#224; la troisi&#232;me lettre de l&#8217;entr&#233;e dans les deux premi&#232;res analyses 
retourn&#233;es n&#8217;est pas identique avec l&#8217;entr&#233;e. Ainsi, ces deux analyses sont consid&#233;r&#233;es 
comme incompatibles avec l&#8217;entr&#233;e. Elles ont entrain&#233; des erreurs qui auraient pu &#234;tre 
&#233;vit&#233;es au niveau de la diacritisation et aussi dans d&#8217;autres traits morphologiques tels 
que le genre et la personne.  
</p>
<p>2.2 M&#233;thode propos&#233;e 
Pour rem&#233;dier &#224; ce probl&#232;me d&#8217;incompatibilit&#233; d&#8217;analyses, la m&#233;thode que nous 
proposons consiste &#224; restreindre l&#8217;ensemble des analyses des mots retourn&#233;es par MADA 
&#224; celles qui contiennent des diacritisations compatibles avec les mots diacrit&#233;s pass&#233;s en 
entr&#233;e. Pour ce faire, nous avons eu recours aux automates &#224; &#233;tats finis. Les mots 
comportant &#233;ventuellement des diacritiques, qui sont fournis &#224; MADA ainsi que les 
sorties de MADA sont repr&#233;sent&#233;s sous la forme d&#8217;automates. Ce mode de repr&#233;sentation 
va permettre de r&#233;aliser les tests de compatibilit&#233; entre l&#8217;entr&#233;e et la sortie gr&#226;ce &#224; des 
op&#233;rations standard sur les automates.  
Dans un premier temps, nous repr&#233;sentons l&#8217;entr&#233;e par un automate &#224; &#233;tats finis A1. 
Chaque lettre et chaque diacritique correspond &#224; une transition, la transition du 
diacritique vient juste apr&#232;s celle de la lettre qui lui a &#233;t&#233; associ&#233;e. La figure suivante 
donne un exemple de repr&#233;sentation d&#8217;un mot avec un automate &#224; travers le mot       
</p>
<p>250</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>[ktbat]. 
</p>
<p> 
FIGURE 1 &#8211; Repr&#233;sentation du mot partiellement diacrit&#233; [ktbat] par A1 
</p>
<p>De la m&#234;me mani&#232;re, les diacritisations produites par MADA sont repr&#233;sent&#233;es par des 
automates, sauf qu&#8217;on a ajout&#233; une transition vide (&#603;-transition) &#224; chaque transition qui 
repr&#233;sente un diacritique. Deux cas sont envisageables, selon que la diacritisation est 
compatible ou non avec le mot en entr&#233;e.  Reprenons l&#8217;exemple de la section 2.1, la 
figure 2 pr&#233;sente l&#8217;automate de la premi&#232;re diacritisation retourn&#233;e par l&#8217;analyseur        
[katabotu], alors que l&#8217;automate qui correspond &#224; la troisi&#232;me diacritisation        
[katabat] est pr&#233;sent&#233; dans la figure 3. 
</p>
<p> 
FIGURE 2 &#8211; Repr&#233;sentation de la diacritisation [katabotu] par A2  
</p>
<p>Le choix de l&#8217;analyse &#224; retenir passe par la v&#233;rification de la compatibilit&#233; de l&#8217;automate 
A1 avec les automates A2 et A3. Deux automates sont compatibles si leur intersection est 
non nulle, c&#8217;est-&#224;-dire, s&#8217;il existe un chemin commun entre eux de l&#8217;&#233;tat initial &#224; l&#8217;&#233;tat 
final. Par cons&#233;quent, nous pouvons constater que A1 n&#8217;est pas compatible avec A2, 
donc, l&#8217;analyse qui contient cette diacritisation devrait &#234;tre rejet&#233;e. En revanche, nous 
gardons la troisi&#232;me analyse puisqu&#8217;elle contient une diacritisation qui s&#8217;accorde avec 
l&#8217;entr&#233;e. 
</p>
<p> 
FIGURE 3 &#8211; Repr&#233;sentation de la diacritisation [katabat] par A3 
</p>
<p>3 Exp&#233;rimentation et &#233;valuation 
Pour &#233;valuer les pr&#233;dictions de MADA avant et apr&#232;s l&#8217;ajout de l&#8217;option d&#8217;analyse des 
textes diacrit&#233;s, nous avons eu recours &#224; un corpus de test partiellement diacrit&#233; (1.3% 
de diacritiques) qui contient 25 295 mots pr&#233;alablement annot&#233;s &#224; la main, c&#8217;est-&#224;-dire 
qu&#8217;&#224; chaque mot, lui est attribu&#233; son analyse morphologique correcte dans le contexte o&#249; 
le mot apparait. Ces analyses contiennent les diacritisations, les &#233;tiquettes grammaticales 
et d&#8217;autres valeurs des diff&#233;rents traits morphologiques.  
</p>
<p>251</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Afin de construire d&#8217;autres ressources textuelles partiellement diacrit&#233;es, nous sommes 
partis du corpus de test enti&#232;rement diacrit&#233;, et nous l&#8217;avons d&#233;pourvu, al&#233;atoirement, 
d&#8217;un taux variable de diacritiques. De cette mani&#232;re, 10 corpus de test ont &#233;t&#233; obtenus, 
ils contiennent un pourcentage de diacritiques qui varie entre 10% et 100%. 
Rappelons que MADA ne prend pas en consid&#233;ration les diacritiques pr&#233;sents dans le 
corpus en entr&#233;e, il produit alors les m&#234;mes r&#233;sultats d&#8217;analyse pour chacun  des corpus 
de test. Ses performances au niveau de la diacritisation, de l&#8217;&#233;tiquetage grammatical et 
de l&#8217;analyse morphologique  sont pr&#233;sent&#233;es dans le tableau suivant :  
</p>
<p>Crit&#232;re Diacritisation Etiquetage 
grammatical 
</p>
<p>Analyse 
morphologique 
</p>
<p>Performance 86.38% 96.09% 84.25% 
</p>
<p>TABLE 1 &#8211; Performances de MADA sur notre corpus de test 
Une analyse morphologique est estim&#233;e correcte, si toutes les valeurs pr&#233;dites des traits  
morphologiques sont conformes avec l&#8217;analyse annot&#233;e dans le corpus de r&#233;f&#233;rence. 
Ainsi, l&#8217;analyseur a produit environ 86% de bonnes diacritisations pour sa meilleure 
analyse, 96% des cat&#233;gories grammaticales correctes et 84% de bonnes analyses. 
Les tests ont &#233;t&#233; r&#233;alis&#233;s, aussi, avec la prise en compte des diacritiques. Tel que nous en  
faisons l&#8217;hypoth&#232;se, l&#8217;exp&#233;rience a montr&#233; que plus le corpus contient des diacritiques, 
plus les performances de MADA devraient s&#8217;am&#233;liorer (cf. table 2). 
</p>
<p>Taux de 
diacritisation 
</p>
<p>Performances MADA 
</p>
<p>Diacritisation Etiquetage 
grammatical 
</p>
<p>Analyse 
morphologique 
</p>
<p>1.3% 86.97% 96.41% 84.91% 
</p>
<p>10% 88.47% 96.79% 86.28% 
</p>
<p>40% 91.74% 97.12% 89.48% 
</p>
<p>70% 94.85% 97.33% 92.51% 
</p>
<p>100% 98.01% 97.49% 95.59% 
</p>
<p>TABLE 2 &#8211; Performances de MADA dans l&#8217;analyse des corpus diacrit&#233;s 
Le tableau 2 illustre l&#8217;apport de la diacritisation dans l&#8217;analyse morphologique de l&#8217;arabe. 
En effet, les performances de l&#8217;analyse morphologique passent de 84.25% &#224; 95.59% si 
MADA prend en consid&#233;ration les diacritiques pr&#233;sents dans les textes enti&#232;rement 
diacrit&#233;s. L&#8217;am&#233;lioration est significative, &#233;galement, dans la diacritisation et l&#8217;&#233;tiquetage 
grammatical. Nous remarquons, aussi, que m&#234;me si le texte est enti&#232;rement diacrit&#233;, les 
</p>
<p>252</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>performances de la diacritisation de MADA n&#8217;atteignent pas 100% et s&#8217;arr&#234;tent au niveau 
de 98%. Cela est d&#251; aux mots non  reconnus par MADA. 
La courbe ci-dessous d&#233;crit l&#8217;&#233;volution des performances de MADA en fonction de la 
proportion des diacritiques pr&#233;sents dans le corpus de test. 
</p>
<p> 
FIGURE 4 &#8211; Evolution des prformances de MADA 
</p>
<p>Ces courbes montrent l&#8217;apport des diacritiques dans la d&#233;sambigu&#239;sation morphologique. 
Plus il y en a dans l&#8217;entr&#233;e, plus les performances sont &#233;lev&#233;es. Nous remarquons, 
&#233;galement, que chaque courbe pr&#233;sente deux pentes, avec une pente maximale lorsque le 
taux de diacritiques de l&#8217;entr&#233;e est entre 0% et 1.3%. Cela vient du fait que les 
diacritiques rajout&#233;s &#224; l&#8217;entr&#233;e sont &#171; naturels &#187;, ajout&#233;s par des humains pour 
d&#233;sambigu&#239;ser des mots consid&#233;r&#233;s comme difficiles &#224; comprendre par le lecteur quand 
ils sont sous la forme non diacrit&#233;e. Il est donc normal que l&#8217;apport de ces diacritiques 
soit important. La deuxi&#232;me pente est constante puisque les diacritiques sont rajout&#233;s 
d&#8217;une fa&#231;on al&#233;atoire.    
</p>
<p>4 Conclusion 
Dans toute analyse linguistique, la d&#233;termination des traits morphologiques d&#8217;un mot 
dans son contexte constitue une &#233;tape importante. En arabe, cette d&#233;termination est 
rendue plus difficile par le fait que la majeure partie des mots de la langue sont ambigus. 
En effet, l&#8217;absence des diacritiques en arabe &#233;crit rend les niveaux d&#8217;ambigu&#239;t&#233; tr&#232;s &#233;lev&#233;s 
par rapport aux autres langues. Avec ce travail, nous avons voulu tester l&#8217;influence des 
diacritiques sur les performances pour l&#8217;analyse morphologique, l&#8217;&#233;tiquetage 
grammatical et la diacritisation automatiques de l&#8217;arabe. Les r&#233;sultats obtenus prouvent 
que la prise en compte des diacritiques pr&#233;sents  dans les textes am&#233;liore 
consid&#233;rablement toutes ces analyses. 
</p>
<p>253</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cette &#233;tude pourrait &#234;tre &#233;tendue &#224; d&#8217;autres niveaux d&#8217;analyse automatique, &#224; savoir 
syntaxique et s&#233;mantique. En effet, seules les diacritiques permettent de distinguer le 
sujet et l&#8217;objet dans ces deux phrases verbales1               &#1576;&#1581;&#1591;&#1589;   (l&#8217;homme a accompagn&#233; 
l&#8217;enfant) et               &#1576;&#1581;&#1591;&#1589;   (l&#8217;enfant a accompagn&#233; l&#8217;homme). Nous poursuivons nos 
travaux de th&#232;se dans cette perspective, afin de mesurer l&#8217;influence de la diacritisation 
dans l&#8217;analyse syntaxique de l&#8217;arabe. 
</p>
<p>Remerciements  
Je tiens &#224; exprimer ma reconnaissance la plus sinc&#232;re &#224; mes encadrants  Mme Nuria 
GALA et M. Alexis NASR, pour tout le temps qu&#8217;ils m&#8217;ont consacr&#233;, leur directives 
pr&#233;cieuses et leurs suivis r&#233;guliers. 
Mes plus vifs remerciements s&#8217;adressent aussi &#224; mes coll&#232;gues de l&#8217;&#233;quipe TALEP pour  
leurs sympathies et leur soutien. 
</p>
<p>    ren es 
BEESLEY, R. (2005). Xerox Arabic Morphological Analysis and Generation Romanization, 
Transcription and Transliteration. 
BUCKWALTER, T. (2004). Buckwalter Arabic Morphological Analyser Version 2.0. Linguistic 
Data Consortium (LDC) Catalog Number LDC2004L02, ISBN 1-58563-324-0.  
DEBILI, F. et ACHOUR, H. (1998). Voyellation automatique de l&#8217;arabe. Actes du Workshop 
on Computational Approaches To Semitic Languages, Universit&#233; de Montr&#233;al. 
DEBILI, F. et SOUISSI, E. (1998). Etiquetage grammatical de l&#8217;arabe voyell&#233; ou non. In 
Proceedings of the Workshop on Computational Approaches to Semetic Languages, 
Stroudsburg. 
DEBILI, F., ACHOUR, H. et SOUISSI, E. (2002). La langue arabe et l&#8217;ordinateur : de 
l&#8217;&#233;tiquetage grammatical &#224; la voyellation automatique. Correspondances de l&#8217;IRMC, N&#176;71, 
Tunis. 
HABASH, N. et OWEN, R. (2005). Arabic Tokenization, Part-of-speech Tagging and 
Morphological Disambiguation in One Fell Swoop. In Proceedings of the Conference of the 
American Association for Computational Linguistics, New York. 
HAJIC, J., SMRZ, F., BUCKWALTER, T. et JIN, H. (2005). Feature-Based Tagger of 
Approximations of Functional Arabic Morphology. Actes de la quatri&#232;me conf&#233;rence sur les 
Treebanks et les th&#233;ories linguistiques, Universit&#233; de Barcelone. 
MAAMOURI, M., BIES, A. et BUCKWALTER, T. (2004). The Pen Arabic Treebank: Building a 
Large-Scale Annotated Arabic Corpus. In EMAR Conference on Arabic Language Ressources 
and Tools, le Caire. 
</p>
<p>                                                   
1 Une phrase verbale dans la langue arabe est une phrase qui contient un verbe. 
</p>
<p>254</p>

</div></div>
</body></html>