<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Syst&#232;me de pr&#233;diction de n&#233;ologismes formels : le cas des N suffix&#233;s par -IER d&#233;notant des artefacts</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 57&#8211;70,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Syst&#232;me de pr&#233;diction de n&#233;ologismes formels : le 
cas des N suffix&#233;s par &#8211;IER d&#233;notant des artefacts 
</p>
<p>Aur&#233;lie Merlo1 
</p>
<p>(1) STL UMR 8163, rue du Barreau BP 60149 59653 Villeneuve d&#8217;Ascq Cedex 
</p>
<p>aurelie.merlo@etu.univ-lille3.fr 
</p>
<p>RESUME ________________________________________________________   
</p>
<p>Nous pr&#233;sentons ici un syst&#232;me de pr&#233;diction de n&#233;ologismes formels avec pour exemple 
la g&#233;n&#233;ration automatique de n&#233;ologismes nominaux suffix&#233;s par &#8211;IER d&#233;notant des 
artefacts (saladier, brassi&#232;re, thonier). L&#8217;objectif de cet article est double. Il s&#8217;agira (i) de 
mettre en &#233;vidence les contraintes de la suffixation par &#8211;IER afin de les impl&#233;menter 
dans un  syst&#232;me de g&#233;n&#233;ration morphologique puis (ii) de montrer qu&#8217;il est possible de 
pr&#233;dire les n&#233;ologismes formels. Ce syst&#232;me de pr&#233;diction permettrait ainsi de compl&#233;ter 
automatiquement les lexiques pour le Traitement Automatique des Langues (TAL). 
</p>
<p>ABSTRACT _______________________________________________________  
</p>
<p>Prediction Device of Formal Neologisms : the Case of &#8211;IER Suffixed Nouns 
Denoting Artifacts 
</p>
<p>We&#8217;ll introduce here a device that can predict neologisms using an example the 
automatical generation of nominal neologisms suffixed by &#8211;IER denoting artifacts 
(saladier, brassi&#232;re, thonier). The aim of this article is double. We will first address the &#8211;
IER suffixation constraints in order to take them into account on the implementation of 
our morphological generator. Second, we will describe our method to predict formal 
neologisms. Such a method will permit to automatically enrich NLP lexicons.  
</p>
<p>MOTS-CLES : morphologie constructionnelle, n&#233;ologie, g&#233;n&#233;ration morphologique,  
incompl&#233;tude lexicale.  
KEYWORDS : constructional morphology, neology, morphological generation, lexical 
incompleteness. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>57</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction 
</p>
<p>Certaines applications de Traitement Automatique des Langues (TAL) comme les 
traducteurs automatiques utilisent des lexiques (Sproat, 1992). Cependant, ces lexiques 
comme les dictionnaires (Sablayrolles, 2000 ; Sablayrolles, 2008) sont lacunaires dans la 
mesure o&#249; ils ne peuvent pas contenir l&#8217;ensemble des unit&#233;s lexicales d&#8217;une langue. 
L&#8217;absence d&#8217;une unit&#233; lexicale dans un lexique de TAL peut alors poser probl&#232;me. Ce 
probl&#232;me, nomm&#233; dans la litt&#233;rature scientifique l&#8217;incompl&#233;tude lexicale, a d&#233;j&#224; &#233;t&#233; 
abord&#233; dans de nombreux travaux. Certains de ces travaux proposent une typologie des 
mots inconnus (Dister &amp; Fairon, 2004 ; Maurel, 2004 ; Cartoni, 2006 ; Blancafort &amp; al., 
2010). D&#8217;autres travaux pr&#233;sentent des solutions pour palier cette incompl&#233;tude lexicale. 
Les travaux de (Dister &amp; Fairon, 2004) soumettent la solution d&#8217;un rep&#233;rage des mots 
inconnus dans un corpus qu&#233;b&#233;cois gr&#226;ce au syst&#232;me GlossaNet. (Cartoni, 2006) propose 
l&#8217;impl&#233;mentation de r&#232;gles de construction afin d&#8217;analyser les mots construits 1 . 
(Blancafort &amp; al., 2010) proposent quant &#224; eux un enrichissement dynamique d&#8217;un 
lexique TAL. Cela passe d&#8217;abord par une annotation en corpus des tokens inconnus pour 
une classification automatique. Puis, une validation manuelle est alors n&#233;cessaire pour 
d&#233;cider de l&#8217;ajout temporaire ou d&#233;finitif dans le lexique.   
</p>
<p>Dans le cadre de cet article, nous proposons une approche pour palier en partie 
l&#8217;incompl&#233;tude lexicale des lexiques de TAL. Dans la mesure o&#249; les n&#233;ologismes formels 
ont une large place dans les mots inconnus (Maurel, 2004 ; Cartoni, 2006), nous 
proposons de les pr&#233;dire afin de les int&#233;grer dans les lexiques de TAL. Notre hypoth&#232;se 
est que les nouvelles unit&#233;s lexicales qui satisfont les contraintes linguistiques li&#233;es &#224; un 
proc&#233;d&#233; constructionnel sont pr&#233;dictibles. Mais seront-elles pour autant attest&#233;es dans 
l&#8217;usage ? Afin de v&#233;rifier notre hypoth&#232;se, nous avons &#233;labor&#233; un g&#233;n&#233;rateur automatique 
de n&#233;ologismes formels &#224; base de contraintes linguistiques. Nous avons choisi de g&#233;n&#233;rer 
automatiquement des n&#233;ologismes formels nominaux suffix&#233;s par &#8211;IER2 d&#233;notant des 
artefacts (saladier, brassi&#232;re, thonier). Le choix de cette suffixation s&#8217;explique par sa 
diversit&#233; r&#233;f&#233;rentielle (Corbin &amp; Corbin, 1991). 
</p>
<p>Les objectifs de cet article sont alors (i) de mettre en &#233;vidence les contraintes linguistiques 
de la suffixation par &#8211;IER et (ii) de montrer qu&#8217;il est possible de pr&#233;dire les n&#233;ologismes 
formels.  
</p>
<p>Nous commencerons par un &#233;tat de l&#8217;art des g&#233;n&#233;rateurs morphologiques existants afin 
de mettre en &#233;vidence l&#8217;originalit&#233; de notre syst&#232;me de g&#233;n&#233;ration automatique de 
n&#233;ologismes formels. Puis, nous proc&#232;derons &#224; l&#8217;analyse de la suffixation par &#8211;IER afin de 
mettre en &#233;vidence ses contraintes linguistiques qui seront par la suite impl&#233;ment&#233;es au 
sein de notre syst&#232;me de g&#233;n&#233;ration morphologique. Nous commenterons les r&#233;sultats 
obtenus afin de montrer les avantages et les limites de notre approche. Enfin, nous 
terminerons cet article sur les perspectives de recherche en morphologie 
constructionnelle que permet cette premi&#232;re approche de la pr&#233;diction des n&#233;ologismes 
formels. 
</p>
<p>                                                   
1 Nous pensons ici &#224; D&#233;riF (Namer, 2009). 
2 Nous avons adopt&#233; cette convention d&#8217;&#233;criture afin de rassembler sous &#8211;IER les suffixes allomorphiques &#8211;
ier(e) et &#8211;er(e).  
</p>
<p>58</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 &#201;tat de l&#8217;art des g&#233;n&#233;rateurs morphologiques 
</p>
<p>Il existe actuellement des syst&#232;mes de g&#233;n&#233;ration morphologique permettant de g&#233;n&#233;rer 
automatiquement des formes fl&#233;chies et/ou des formes d&#233;riv&#233;es. 
</p>
<p>Le premier de ces syst&#232;mes que nous pr&#233;sentons bri&#232;vement est le syst&#232;me PILAF 
(Proc&#233;dures Interactives Linguistiques Appliqu&#233;es au Fran&#231;ais) (Courtin &amp; al., 1994). Le 
syst&#232;me PILAF a &#233;t&#233; &#233;labor&#233; dans le laboratoire CLIPS afin de r&#233;aliser des t&#226;ches 
d&#8217;analyse et de g&#233;n&#233;ration morphologique. Le syst&#232;me est compos&#233; d&#8217;une grammaire, 
d&#8217;un dictionnaire et de deux moteurs : l&#8217;un est consacr&#233; &#224; l&#8217;analyse, l&#8217;autre &#224; la g&#233;n&#233;ration. 
Ce syst&#232;me est capable de reconna&#238;tre et de g&#233;n&#233;rer 250 000 formes du fran&#231;ais &#224; l&#8217;aide 
d&#8217;un lexique comportant 35 000 entr&#233;es. Ce syst&#232;me, destin&#233; &#224; la morphologie 
flexionnelle, utilise un formalisme qui &#171; permet le codage de r&#232;gles de la morphologie 
d&#233;rivationnelle &#187; (Courtin &amp; al., 1994 : 101). 
</p>
<p>Le &#171; syst&#232;me d&#233;rivationnel &#187; de (Tzoukermann &amp; Jacquemin, 1997) est &#233;labor&#233; &#233;galement 
pour fonctionner aussi bien en analyse qu&#8217;en g&#233;n&#233;ration. En g&#233;n&#233;ration, le syst&#232;me repose 
sur le principe de la concat&#233;nation et pour &#233;viter la surg&#233;n&#233;ration, (Tzoukermann &amp; 
Jacquemin, 1997) proposent trois niveaux de filtrage : un filtrage lexical (les d&#233;riv&#233;s sont 
g&#233;n&#233;r&#233;s &#224; partir de bases attest&#233;es dans un dictionnaire), un filtrage d&#8217;attestation en 
corpus et un filtrage s&#233;mantique collocatif (les d&#233;riv&#233;s s&#233;lectionn&#233;s doivent appara&#238;tre en 
contexte en collocation avec un m&#234;me mot).  
</p>
<p>Le syst&#232;me Intex (Silverztein, 1993), dont la derni&#232;re version se nomme NooJ, est un 
environnement dans lequel il est possible d&#8217;&#233;laborer des descriptions formalis&#233;es 
applicables sur corpus. Cet environnement comprend des dictionnaires &#233;lectroniques 
(DELAF) et offre la possibilit&#233; de r&#233;aliser ses propres grammaires sous forme de graphes. 
Le syst&#232;me Intex est utilis&#233; en traitement automatique de corpus mais &#233;galement pour de 
la g&#233;n&#233;ration flexionnelle et/ou d&#233;rivationnelle.  
</p>
<p>Le syst&#232;me G&#233;D&#233;riF est le pendant de D&#233;riF (Namer, 2009). C&#8217;est un syst&#232;me de 
g&#233;n&#233;ration automatique d&#8217;unit&#233;s lexicales construites qui a une triple fonction : (i) &#171; 
produire un lexique d&#8217;unit&#233;s lexicales construites absentes des dictionnaires &#187;, (ii) &#171; 
enrichir ce lexique d&#8217;informations constructionnelles et s&#233;mantiques, (iii) &#171; constituer des 
micro-familles constructionnelles &#187; (Dal &amp; Namer, 2000). Les formes g&#233;n&#233;r&#233;es sont 
valid&#233;es par une recherche en ligne. L&#8217;inconv&#233;nient est que &#171; le g&#233;n&#233;rateur ne peut donc 
choisir la base des unit&#233;s qu&#8217;il va g&#233;n&#233;rer automatiquement que parmi les mots d&#233;j&#224; 
construits &#187; (Dal &amp; Namer, 2000) et analys&#233;s par D&#233;riF.  
</p>
<p>La pr&#233;sentation de ces syst&#232;mes de g&#233;n&#233;ration morphologique permet de mettre en 
&#233;vidence une limite commune. Ces syst&#232;mes offrent la possibilit&#233; de g&#233;n&#233;rer des mots 
d&#233;riv&#233;s et impl&#233;mentent un certain nombre de r&#232;gles d&#233;rivationnelles. Or, ces syst&#232;mes 
ne prennent pas en compte les contraintes s&#233;mantiques pouvant peser dans un processus 
d&#233;rivationnel.  
</p>
<p>&#192; pr&#233;sent, dans le cadre de l&#8217;analyse de la suffixation par &#8211;IER, nous allons montrer en 
quoi notre syst&#232;me de g&#233;n&#233;ration morphologique est original.   
</p>
<p>59</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Analyse de la suffixation par -IER 
</p>
<p>3.1 M&#233;thodologie 
</p>
<p>Nous allons mettre en &#233;vidence les contraintes linguistiques pesant sur la suffixation par 
&#8211;IER. Nous avons choisi cette suffixation pour sa diversit&#233; r&#233;f&#233;rentielle (Corbin &amp; Corbin, 
1991). Dans le cadre de cet article, nous &#233;tudierons de plus pr&#232;s les d&#233;riv&#233;s nominaux 
suffix&#233;s par &#8211;IER d&#233;notant des artefacts (saladier, brassi&#232;re, thonier). Nous pr&#233;cisons 
que les r&#233;sultats pr&#233;sent&#233;s sont extraits d&#8217;une &#233;tude plus large de la suffixation par &#8211;IER 
que nous avons r&#233;alis&#233;e dans le cadre d&#8217;un m&#233;moire de recherche (Merlo, 2011). 
</p>
<p>Le corpus &#233;labor&#233; dans le cadre de ce m&#233;moire provient de l&#8217;extraction du TLF d&#8217;une liste 
de candidats &#224; la suffixation par &#8211;IER. Cette liste a &#233;t&#233; nettoy&#233;e afin de ne retenir que les 
lex&#232;mes construits par la suffixation par &#8211;IER (&#233;limination des emprunts par exemple du 
type manager). Nous avons par la suite s&#233;lectionn&#233; 530 lex&#232;mes construits que nous 
avons analys&#233;s afin de faire appara&#238;tre les informations n&#233;cessaires &#224; la pr&#233;diction de 
n&#233;ologismes suffix&#233;s par &#8211;IER. Par cons&#233;quent, nous avons proc&#233;d&#233; &#224; une analyse 
morpho-s&#233;mantique, morphophonologique et graphique de la suffixation par &#8211;IER.  
</p>
<p>Pour cet article ne retenant que les d&#233;riv&#233;s d&#233;notant des artefacts, l&#8217;&#233;tude portera sur 119 
lex&#232;mes construits et 132 acceptions3.  
</p>
<p>3.2 Analyse morpho-s&#233;mantique 
</p>
<p>3. 2. 1. Approche r&#233;f&#233;rentielle 
</p>
<p>L&#8217;analyse morpho-s&#233;mantique des d&#233;riv&#233;s suffix&#233;s par &#8211;IER a consist&#233; en l&#8217;&#233;tude de la 
r&#233;f&#233;rence des d&#233;riv&#233;s et de leur base. Nous nous sommes inspir&#233; de l&#8217;approche par classe 
r&#233;f&#233;rentielle propos&#233;e dans (Roch&#233;, 1998) 4 . Par convention, les classes r&#233;f&#233;rentielles 
seront entre crochets ([r&#233;cipient] par exemple). 
</p>
<p>&#192; partir des d&#233;finitions du TLF, nous avons d&#233;termin&#233; la classe r&#233;f&#233;rentielle des 
acceptions des d&#233;riv&#233;s de notre corpus d&#8217;&#233;tude. Notre analyse morpho-s&#233;mantique a pu 
confirmer l&#8217;existence de sept classes r&#233;f&#233;rentielles pour les d&#233;riv&#233;s suffix&#233;s par &#8211;IER 
d&#233;notant des artefacts (cf. FIGURE 1 ci-dessous) que (Roch&#233;, 1998) avait mis en &#233;vidence.   
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>                                                   
3  Nous avons choisi de prendre en compte les acceptions lorsque celles-ci n&#8217;&#233;taient pas issues d&#8217;une 
d&#233;rivation s&#233;mantique. Ex : m&#233;dailler (s. v. m&#233;dailler dans le TLF) d&#233;signe &#224; la fois un meuble contenant des 
m&#233;dailles et un recueil de m&#233;dailles.  
4 Une classe r&#233;f&#233;rentielle est d&#233;finie comme la projection de propri&#233;t&#233;s s&#233;mantiques (Temple, 1996). 
</p>
<p>60</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>FIGURE 1 &#8211; Classe r&#233;f&#233;rentielle des d&#233;riv&#233;s suffix&#233;s par &#8211;IER d&#233;notant des artefacts 
(contrainte n&#176;1) 
</p>
<p>Du c&#244;t&#233; de la sortie, nous savons &#224; pr&#233;sent que les d&#233;riv&#233;s suffix&#233;s par &#8211;IER d&#233;notant des 
artefacts peuvent avoir pour r&#233;f&#233;rent un nom de r&#233;cipient, un nom de v&#234;tement, un nom 
de bateau, un nom d&#8217;habitat ou un nom de meuble. N&#233;anmoins, il nous reste &#224; d&#233;terminer 
si la suffixation par &#8211;IER s&#233;lectionne les bases en fonction d&#8217;une contrainte r&#233;f&#233;rentielle. 
Toujours &#224; partir des d&#233;finitions du TLF, nous avons d&#233;termin&#233; la classe r&#233;f&#233;rentielle des 
bases de notre corpus (cf. TABLE 1 ci-dessous).   
</p>
<p>Classe 
r&#233;f&#233;rentielle 
du d&#233;riv&#233; 
</p>
<p>Classe r&#233;f&#233;rentielle 
de la base 
</p>
<p>Nombre d&#8217;acceptions Exemples 
</p>
<p>[bateau] [poisson] 7 baleinier 
</p>
<p> [partie du bateau] 5 boulinier  
</p>
<p> [min&#233;ral] 3 m&#233;thanier 
</p>
<p> [personne] 1 n&#233;grier 
</p>
<p> [boisson] 1 pinardier 
</p>
<p> [fruit] 1 bananier  
</p>
<p> [rangement] 1 vraquier 
</p>
<p>[habitat] [animal] 15 pigeonnier 
</p>
<p> [personne] 2 gar&#231;onni&#232;re 
</p>
<p>61</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> [min&#233;ral] 1 terrier 
</p>
<p> [proc&#232;s] 1 voli&#232;re 
</p>
<p>[meuble] [objet] 9 bonneti&#232;re 
</p>
<p> [v&#233;g&#233;tal] 3 grainier 
</p>
<p> [dur&#233;e] 1 semainier  
</p>
<p>[pi&#232;ge] [animal] 3 rati&#232;re 
</p>
<p>[r&#233;cipient] [aliment] 22 beurrier 
</p>
<p> [objet] 11 bouquetier 
</p>
<p> [liquide] 8 tisanni&#232;re 
</p>
<p> [animal] 3 turboti&#232;re 
</p>
<p> [min&#233;ral] 2 sablier 
</p>
<p> [mode de cuisson] 1 daubi&#232;re  
</p>
<p>[recueil] [&#233;crit] 7 chansonnier 
</p>
<p> [objet] 2 m&#233;daillier 
</p>
<p> [v&#233;g&#233;tal] 2 herbier  
</p>
<p>[v&#234;tement] [partie du corps] 17 jambi&#232;re 
</p>
<p> [animal] 1 grenouill&#232;re 
</p>
<p> [meuble] 1 tablier  
</p>
<p>TABLE 1 &#8211; Classe r&#233;f&#233;rentielle des bases (contrainte n&#176;2) 
</p>
<p>Gr&#226;ce &#224; cette analyse de la classe r&#233;f&#233;rentielle des bases, &#224; pr&#233;sent nous savons que pour 
g&#233;n&#233;rer par exemple un nom de recueil, la suffixation par &#8211;IER peut s&#233;lectionner des 
bases dont le r&#233;f&#233;rent d&#233;signe un &#233;crit, un objet ou un v&#233;g&#233;tal. Cette table permet 
&#233;galement de mettre en &#233;vidence des pr&#233;f&#233;rences s&#233;mantiques telle que pour former un 
nom de meuble, la suffixation par &#8211;IER s&#233;lectionne de pr&#233;f&#233;rence une base dont le 
r&#233;f&#233;rent d&#233;signe un aliment (22 acceptions). Dans le cadre de la g&#233;n&#233;ration automatique 
de n&#233;ologismes formels suffix&#233;s par &#8211;IER, nous ne tiendrons pas compte de ces 
pr&#233;f&#233;rences.   
</p>
<p>62</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.2.1 Variation en genre 
</p>
<p>FIGURE 2 &#8211; Variation en genre des d&#233;riv&#233;s suffix&#233;s par &#8211;IER d&#233;notant des artefacts 
(contrainte n&#176; 3) 
</p>
<p>Pr&#233;dire les n&#233;ologismes suffix&#233;s par &#8211;IER d&#233;notant des artefacts n&#233;cessite &#233;galement de 
d&#233;terminer les cas de variation en genre. Selon (Roch&#233;, 1998 : 45), l&#8217;attribution du genre 
pour les artefacts s&#8217;applique par le biais d&#8217;&#171; un d&#233;termin&#233; implicite ou d&#8217;un terme 
g&#233;n&#233;rique &#187; (un (bateau) p&#233;trolier) ou par d&#233;faut au masculin lorsqu&#8217;il n&#8217;y a pas de 
d&#233;termin&#233; implicite. Sur la FIGURE 2 ci-dessous, nous avons r&#233;pertori&#233; le nombre de 
formes f&#233;minines et masculines par classe r&#233;f&#233;rentielle des d&#233;riv&#233;s.  
</p>
<p>La FIGURE 2 nous permet de faire des choix quant &#224; la flexion en genre des n&#233;ologismes 
suffix&#233;s par &#8211;IER. En effet, nous voyons nettement se d&#233;marquer les formes masculines 
pour les classes r&#233;f&#233;rentielles [bateau], [meuble] et  [recueil] et les formes f&#233;minines pour 
les classes r&#233;f&#233;rentielles [habitat], [pi&#232;ge], [r&#233;cipient] et [v&#234;tement]. Cependant, en 
l&#8217;absence de tests formels pour l&#8217;&#233;tiquetage en classe r&#233;f&#233;rentielle, nous admettons que 
l&#8217;attribution du genre ici est sujette &#224; caution. 
</p>
<p>&#192; pr&#233;sent, il nous reste &#224; d&#233;terminer les contraintes formelles de la suffixation par &#8211;IER.  
</p>
<p>3.3 Analyse morphophonologique 
</p>
<p>Deux ensembles de contraintes p&#232;sent plus particuli&#232;rement en morphophonologie : les 
contraintes de taille (Pl&#233;nat, 1997) et les contraintes dissimilatives5.  
</p>
<p>3.3.1 Contrainte de taille 
</p>
<p>Il s&#8217;agit de d&#233;couvrir ici si la suffixation par &#8211;IER comporte des contraintes de taille sur 
l&#8217;entr&#233;e et/ou la sortie de ses r&#232;gles de construction de lex&#232;me. Pour cela, nous avons 
calcul&#233; le nombre de syllabes de chaque base et de chaque d&#233;riv&#233; de notre corpus (cf. 
</p>
<p>                                                   
5 Les contraintes de dissimilation rejettent la contigu&#239;t&#233; de deux phon&#232;mes identiques ou similaires. 
</p>
<p>63</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TABLE 3 ci-dessous). 
</p>
<p>Taille de la base Taille du d&#233;riv&#233; Exemple  Nombre de 
lex&#232;mes 
</p>
<p>1 2 beurrier 41 
</p>
<p>1 3 oeufrier 16 
</p>
<p>2 2 jarreti&#232;re 4 
</p>
<p>2 3 grenouill&#232;re 61 
</p>
<p>2 4 vinaigrier 1 
</p>
<p>3 4 porcelainier 9 
</p>
<p>TABLE 3 &#8211; Contrainte de taille pour les d&#233;riv&#233;s suffix&#233;s par &#8211;IER d&#233;notant des artefacts 
(contrainte n&#176; 4) 
</p>
<p>Ces r&#233;sultats permettent de mettre en &#233;vidence que la suffixation par &#8211;IER ne s&#233;lectionne 
pas de base comportant plus de trois syllabes pour former des d&#233;riv&#233;s quadrisyllabiques. 
Par ailleurs, ces r&#233;sultats montrent que la suffixation par &#8211;IER s&#233;lectionne de pr&#233;f&#233;rence 
des bases dissyllabiques pour former des d&#233;riv&#233;s trissyllabiques (61 lex&#232;mes concern&#233;s). 
Enfin, &#224; travers ces r&#233;sultats, nous voyons que la suffixation par &#8211;IER utilise de 
pr&#233;f&#233;rence la concat&#233;nation avec un nombre important de lex&#232;mes construits comportant 
une syllabe de plus par rapport &#224; leur base. 
</p>
<p>Par cons&#233;quent, notre syst&#232;me de pr&#233;diction de n&#233;ologismes suffix&#233;s par &#8211;IER d&#233;notant 
des artefacts devra effectuer un tri formel (en plus d&#8217;un tri sur les classes r&#233;f&#233;rentielles) 
parmi les bases afin de ne s&#233;lectionner que les bases entre une et trois syllabes.   
</p>
<p>3.3.2 Contrainte sur l&#8217;attaque 
</p>
<p>Ce que nous appelons une attaque est le phon&#232;me plac&#233; au d&#233;but de la syllabe contenant 
le suffixe &#8211;IER. Ce phon&#232;me provient en g&#233;n&#233;ral de la finale consonantique de la base 
mais certaines attaques sont parfois des consonnes &#233;penth&#233;tiques (comme dans 
cafeti&#232;re), intercal&#233;es entre la base et le suffixe pour &#233;viter un hiatus car &#171; d&#8217;une fa&#231;on 
g&#233;n&#233;rale, la d&#233;rivation par &#8211;ier(e) est g&#234;n&#233;e par une finale vocalique (sans consonne 
latente) &#187; (Roch&#233;, 1998).  
</p>
<p>Nous avons relev&#233; les attaques des 119 lex&#232;mes construits de notre corpus (cf. FIGURE 3 ci-
dessous).   
</p>
<p>64</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>FIGURE 3 &#8211; Distribution des phon&#232;mes consonantiques en attaque 
</p>
<p>Ce graphique montre que les d&#233;riv&#233;s suffix&#233;s par &#8211;IER comportant une attaque /n/ ou /t/ 
sont les plus nombreux. D&#8217;une mani&#232;re g&#233;n&#233;rale, la suffixation par &#8211;IER tend &#224; 
s&#233;lectionner des bases dont la finale consonantique est une alv&#233;olaire (/t/ et /n/) et au 
contraire &#224; &#233;viter des bases dont la finale consonantique est un phon&#232;me labiodental (/v/ 
et /f/), bilabial (/p/, /b/ et /m/) ou v&#233;laire (/k/ et /g/). N&#233;anmoins, on ne peut pas parler 
de contraintes sur l&#8217;attaque mais plut&#244;t de pr&#233;f&#233;rences ce qui n&#8217;est pas le cas lorsque la 
base se termine par une finale vocalique avec l&#8217;apparition syst&#233;matique d&#8217;une consonne 
&#233;penth&#233;tique.    
</p>
<p>3.4 Analyse graphique  
</p>
<p>3.4.1 Cas de changements graphiques 
</p>
<p>L&#8217;adjonction du suffixe &#8211;IER provoque des modifications graphiques. La premi&#232;re de ces 
modifications est l&#8217;apparition d&#8217;une consonne &#233;penth&#233;tique entre la finale vocalique de la 
base et le suffixe &#8211;IER (contrainte n&#176;5). Dans le cadre de notre m&#233;moire, nous avons 
recens&#233; 19 d&#233;riv&#233;s suffix&#233;s par  -IER comportant une consonne &#233;penth&#233;tique. Parmi eux 
des noms d&#8217;artefacts comme cafeti&#232;re [r&#233;cipient], fourmili&#232;re [habitat], morutier 
[bateau] ou encore tabati&#232;re [r&#233;cipient]. Nous avons &#233;galement d&#233;couvert que le 
phon&#232;me /t/ est particuli&#232;rement utilis&#233; comme consonne &#233;penth&#233;tique.  
</p>
<p>Le second cas de modification graphique par adjonction du suffixe &#8211;IER est le 
changement d&#8217;accent qui traduit un changement d&#8217;aperture pour cause de contrainte 
dissimilative  (contrainte n&#176;6). Ainsi, parmi les noms d&#8217;artefacts, les d&#233;riv&#233;s ch&#233;quier 
[recueil] et n&#233;grier [bateau] ont subi un changement d&#8217;accent par rapport &#224; leur base 
respective ch&#232;que et n&#232;gre.   
</p>
<p>Enfin, la g&#233;mination est le dernier cas de modification graphique relev&#233;. La consonne 
finale de la base &#224; tendance &#224; se doubler avec la concat&#233;nation du suffixe &#8211;IER. Nous 
allons d&#233;tailler ci-dessous les diff&#233;rents cas de figure de g&#233;mination. 
</p>
<p>3.4.2 R&#232;gles graphiques de concat&#233;nation du suffixe &#8211;IER 
</p>
<p>&#192; partir de l&#8217;analyse de notre corpus, nous avons pos&#233; huit contraintes graphiques 
</p>
<p>65</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>r&#233;gissant la concat&#233;nation du suffixe &#8211;IER :  
</p>
<p>&#61623; Contrainte n&#176;1 : lorsque la base se termine par une consonne muette (abricot), il 
y a concat&#233;nation simple (abricotier). 
</p>
<p>&#61623; Contrainte n&#176;2 : lorsque la base se termine par un phon&#232;me consonantique et par 
une voyelle muette (agence), la voyelle finale est supprim&#233;e et le suffixe &#8211;IER se 
concat&#232;ne au radical de la base (agencier). 
</p>
<p>&#61623; Contrainte n&#176;3 : lorsque la base se termine par un phon&#232;me vocalique et par une 
voyelle (moru), la consonne &#233;penth&#233;tique &#8211;t- s&#8217;ajoute suivie de la concat&#233;nation 
du suffixe &#8211;IER (morutier). 
</p>
<p>&#61623; Contrainte n&#176;4 : lorsque la base se termine par &#8211;os, -as, -is ou &#8211;us, (matelas) la 
consonne &#8211;s- s&#8217;ajoute suivie de la concat&#233;nation du suffixe &#8211;IER (matelassier). 
</p>
<p>&#61623; Contrainte n&#176;5 : lorsque la base se termine par &#8211;on, la consonne &#8211;n- s&#8217;ajoute 
suivie de la concat&#233;nation du suffixe &#8211;IER (boutonni&#232;re). 
</p>
<p>&#61623; Contrainte n&#176;6 : lorsque la base se termine par &#8211;an ou &#8211;in, il y a concat&#233;nation 
simple du suffixe &#8211;IER (rubanier, jardini&#232;re). 
</p>
<p>&#61623; Contrainte n&#176;7 : lorsque la base se termine par &#8211;il, la consonne &#8211;l- s&#8217;ajoute suivie 
de la concat&#233;nation du suffixe &#8211;IER (&#339;ill&#232;re). 
</p>
<p>&#61623; Contrainte n&#176;8 : lorsque la base contient dans sa derni&#232;re syllabe un accent grave 
(tr&#232;fle), cet accent devient un accent aigu dans le d&#233;riv&#233; suffix&#233; par &#8211;IER 
(tr&#233;flier).  
</p>
<p>En ce qui concerne les r&#232;gles n&#176;4 et n&#176;5, elles ont &#233;t&#233; &#233;labor&#233;es sur la base de la fr&#233;quence 
des ph&#233;nom&#232;nes &#233;tudi&#233;s car il existe des contre-exemples &#224; ces r&#232;gles : tamis&gt;tamisier, 
thon&gt;thonier. 
</p>
<p>4 Impl&#233;mentation 
</p>
<p>Nous avons d&#233;gag&#233; les contraintes de la suffixation par &#8211;IER d&#233;terminant ainsi les 
connaissances linguistiques n&#233;cessaires &#224; la g&#233;n&#233;ration automatique de n&#233;ologismes 
suffix&#233;s par &#8211;IER. Cependant, la g&#233;n&#233;ration automatique de n&#233;ologismes formels 
n&#233;cessite &#233;galement un lexique de r&#233;f&#233;rence (ou lexique d&#8217;exclusion) et un lexique de 
bases annot&#233;. 
</p>
<p>Bien que l&#8217;utilisation d&#8217;un dictionnaire pr&#233;sente des limites lorsque l&#8217;on &#233;tudie la n&#233;ologie 
(Sablayrolles, 2000 ; Sablayrolles, 2008), nous avons choisi comme lexique de r&#233;f&#233;rence 
le lexique Morphalou &#233;labor&#233; &#224; partir de la nomenclature du TLF. L&#8217;objectif de ce lexique 
de r&#233;f&#233;rence est de retenir uniquement les formes nouvelles g&#233;n&#233;r&#233;es. Si une forme 
g&#233;n&#233;r&#233;e est attest&#233;e dans le lexique de r&#233;f&#233;rence, celle-ci ne sera pas retenue.   
</p>
<p>L&#8217;&#233;laboration du lexique de bases annot&#233; a &#233;t&#233; plus complexe. Ce lexique devait 
comprendre les informations linguistiques n&#233;cessaires &#224; l&#8217;application des contraintes de 
la suffixation par &#8211;IER. Ainsi, ce lexique devait contenir des indications sur la classe 
r&#233;f&#233;rentielle, le nombre de syllabe et une description graphique de la base afin de 
d&#233;terminer quelle r&#232;gle graphique &#224; appliquer. Au vu de ces informations, la ressource  
Lexique 3. 1. &#233;tait une ressource utile en ce qui concerne le nombre de syllabes et la 
description orthographique (cf. TABLE 4 ci-dessous). La description orthographique 
permet de savoir si la finale de la base est vocalique (caf&#233;) ou consonantique (cafard)  ce 
qui a son importance pour l&#8217;application des contraintes graphiques n&#176;1 et n&#176;3. La 
</p>
<p>66</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>description phon&#233;tique permet de savoir si la base se termine par une finale 
consonantique et une voyelle (agence) ce qui a de l&#8217;importance pour l&#8217;application de la 
contrainte n&#176;2. Enfin, la description orthographique des syllabes permet d&#8217;appliquer la 
contrainte n&#176;8 du changement d&#8217;accent.   
</p>
<p>Lemme  Description 
orthographique 
</p>
<p>Description 
phon&#233;tique 
</p>
<p>Nombre de 
syllabes 
</p>
<p>Description 
orthographique des 
syllabes 
</p>
<p>caf&#233; CVCV CVCV 2 ca-f&#233; 
</p>
<p>cafard CVCVCC CVCVC 2 ca-fard 
</p>
<p>agence VCVCCV VCVC 2 a-gen-ce 
</p>
<p>TABLE 4 &#8211; Informations contenues dans Lexique 3. 1. et utiles au lexique des bases 
</p>
<p>Nous avons choisi al&#233;atoirement 268 lex&#232;mes de Lexique 3. 1. pour constituer notre 
lexique de bases avec pour seul objectif d&#8217;obtenir une homog&#233;n&#233;it&#233; de classe r&#233;f&#233;rentielle. 
Puis, nous avons proc&#233;d&#233; &#224; l&#8217;annotation des classes r&#233;f&#233;rentielles de ces lex&#232;mes-bases. 
Aucune ressource actuellement en fran&#231;ais ne poss&#233;dant ce type d&#8217;information, nous nous 
sommes appuy&#233;s sur les d&#233;finitions du TLF pour &#233;tablir les classes r&#233;f&#233;rentielles.   
</p>
<p>5 R&#233;sultats 
</p>
<p>Notre hypoth&#232;se en introduction &#233;tait que les nouvelles unit&#233;s lexicales qui satisfont les 
contraintes linguistiques li&#233;es &#224; un proc&#233;d&#233; constructionnel sont pr&#233;dictibles. Ici, il 
s&#8217;agissait de mettre en &#233;vidence les contraintes de la suffixation par &#8211;IER en s&#8217;attachant 
particuli&#232;rement &#224; l&#8217;&#233;tude des noms d&#8217;artefacts. 
</p>
<p>Notre approche a permis de g&#233;n&#233;rer 544 nouvelles unit&#233;s lexicales dont 222 d&#233;notant des 
artefacts. Afin de v&#233;rifier notre hypoth&#232;se, nous avons interrog&#233; le Web et d&#233;termin&#233; 
quelles nouvelles unit&#233;s lexicales &#233;taient attest&#233;es. La FIGURE 4 ci-dessous dresse un bilan 
de cette v&#233;rification quantitative pour les n&#233;ologismes d&#233;notant des artefacts.    
</p>
<p>Ces r&#233;sultats, dont notamment le nombre de n&#233;ologismes formels g&#233;n&#233;r&#233;s attest&#233;s sur le 
Web (87 au total soit 39,19%), valident en partie notre hypoth&#232;se. Il appara&#238;t possible de 
pr&#233;dire les nouvelles unit&#233;s lexicales qui satisfont les contraintes linguistiques li&#233;es &#224; un 
proc&#233;d&#233; constructionnel. Il appara&#238;t m&#234;me possible de pr&#233;dire la r&#233;f&#233;rence de ces 
nouvelles unit&#233;s lexicales (18 au total parmi les attest&#233;s). N&#233;anmoins, il appara&#238;t 
&#233;galement que notre syst&#232;me est en surg&#233;n&#233;ration (135 non-attest&#233;s au total soit 60,81%).  
</p>
<p>Autant une attestation relev&#233;e sur le Web est sujette &#224; caution (Kilgarriff &amp; Grefenstette, 
2003), autant l&#8217;absence d&#8217;attestation sur le Web est significative.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>67</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>FIGURE 4 &#8211; &#201;valuation quantitative des r&#233;sultats 
</p>
<p>Nous sommes face &#224; trois types de r&#233;sultats. Le premier concerne tous les cas de 
n&#233;ologismes formels g&#233;n&#233;r&#233;s suffix&#233;s par &#8211;IER ne trouvant aucune attestation sur le Web. 
Cela provient-il d&#8217;une erreur de g&#233;n&#233;ration graphique ? Le n&#233;ologisme g&#233;n&#233;r&#233; antilopi&#232;re 
par exemple n&#8217;est pas attest&#233; sur le Web alors qu&#8217;il ne pr&#233;sente pas a priori d&#8217;erreur 
graphique. Cela provient-il alors d&#8217;une erreur de cat&#233;gorisation de la classe r&#233;f&#233;rentielle 
de la base ? Cette hypoth&#232;se est plus probable dans la mesure o&#249; nous avons proc&#233;d&#233; sans 
tests formels mais &#224; l&#8217;aide des d&#233;finitions du TLF. Le second type de r&#233;sultat conforte 
d&#8217;ailleurs cette hypoth&#232;se puisqu&#8217;il s&#8217;agit des n&#233;ologismes formels g&#233;n&#233;r&#233;s suffix&#233;s par &#8211;
IER attest&#233;s sur le Web mais pas dans la classe r&#233;f&#233;rentielle pr&#233;dite. C&#8217;est ainsi le cas de 
cochonni&#232;re pr&#233;dit dans la classe r&#233;f&#233;rentielle [pi&#232;ge] et attest&#233; dans un contexte faisant 
r&#233;f&#233;rence &#224; un v&#233;hicule6. Enfin, le dernier type de r&#233;sultat concerne les attestations de 
n&#233;ologismes g&#233;n&#233;r&#233;s suffix&#233;s par &#8211;IER dans les classes r&#233;f&#233;rentielles pr&#233;dites tels que 
choucrouti&#232;re pr&#233;dit dans la classe [r&#233;cipient]. D&#8217;autres hypoth&#232;ses peuvent &#234;tre avanc&#233;es 
pour expliquer cette surg&#233;n&#233;ration. Nous n&#8217;avons pas abord&#233; la question de l&#8217;&#233;changisme 
suffixal (Roch&#233;, 1997). La validation de notre hypoth&#232;se par le biais de la v&#233;rification des 
formes g&#233;n&#233;r&#233;es sur le Web est &#233;galement discutable. Une autre alternative pourrait &#234;tre 
une validation aupr&#232;s d&#8217;un panel de locuteurs.  
</p>
<p>6 Conclusion : sur les pas des connaissances encyclop&#233;diques  
</p>
<p>En conclusion, nous avons atteint nos deux objectifs qui &#233;taient (i) de mettre en &#233;vidence 
les contraintes li&#233;es &#224; la suffixation par &#8211;IER et (ii) de montrer qu&#8217;il est possible de 
pr&#233;dire les n&#233;ologismes formels par l&#8217;impl&#233;mentation de ces contraintes au sein d&#8217;un 
syst&#232;me de g&#233;n&#233;ration morphologique.  
</p>
<p>Du point de vue applicatif, cette approche apporte des perspectives quant &#224; 
l&#8217;incompl&#233;tude lexicale. Sur une th&#233;matique pr&#233;cise qui est l&#8217;&#233;tude des noms suffix&#233;s par 
&#8211;IER d&#233;notant des artefacts, nous avons pr&#233;dit 87 n&#233;ologismes formels au total pouvant 
</p>
<p>                                                   
6  &#171; Ren&#233; Thor&#233; avec Kapi (mulassier) attel&#233; &#224; une cochonni&#232;re &#224; 4 roues &#187; 
(http://picasaweb.google.com/lh/photo/Pp3EyPQcQH1DaduXJK_9Mw)   
</p>
<p>68</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>directement &#234;tre int&#233;gr&#233;s dans un lexique pour le TAL. Cette quantit&#233; est tr&#232;s insuffisante 
mais nous esp&#233;rons am&#233;liorer le taux de pr&#233;diction prochainement. Du point de vue 
th&#233;orique, cette approche apporte de nouvelles perspectives de recherche en morphologie 
constructionnelle. Nous avons pr&#233;dit la r&#233;f&#233;rence de 18 n&#233;ologismes formels sur 87 
attest&#233;s sur le Web gr&#226;ce &#224; une annotation en classe r&#233;f&#233;rentielle. Cela implique que notre 
approche de la pr&#233;diction par la notion de classe r&#233;f&#233;rentielle m&#233;riterait d&#8217;&#234;tre 
approfondie. Tout d&#8217;abord, afin d&#8217;&#233;viter l&#8217;utilisation du TLF pour la cat&#233;gorisation 
r&#233;f&#233;rentielle des lex&#232;mes, une premi&#232;re solution serait d&#8217;&#233;laborer une s&#233;rie de tests 
formels en s&#8217;inspirant de travaux en s&#233;mantique-cognitive (notamment Fillmore, 1982 ; 
Langacker, 1987 ; Kleiber, 1990). Une seconde solution consisterait &#224; utiliser des 
ontologies existantes telles que WOLF pour le fran&#231;ais (Sagot &amp; Fi&#353;er, 2008) ou WordNet 
(Fellbaum, 1998). Puis, &#224; partir de l&#224;, il faudrait, par classe r&#233;f&#233;rentielle, faire &#233;merger les 
contraintes extralinguistiques. Dans un travail de th&#232;se que nous venons de d&#233;buter, nous 
tentons de d&#233;montrer l&#8217;hypoth&#232;se de la n&#233;cessit&#233; des connaissances encyclop&#233;diques en 
morphologie constructionnelle (Aronoff,  1980 ; Clark &amp; Clark, 1979). L&#8217;exemple du 
n&#233;ologisme g&#233;n&#233;r&#233; cochonni&#232;re met en lumi&#232;re cette nouvelle hypoth&#232;se car si ce 
n&#233;ologisme appara&#238;t dans un contexte d&#233;signant un v&#233;hicule et non pas un pi&#232;ge c&#8217;est 
parce le cochon est un animal &#171; domestique &#187; que nous n&#8217;avons pas besoin de chasser. De 
la m&#234;me mani&#232;re, on rel&#232;ve bananier dont le r&#233;f&#233;rent d&#233;signe un nom de bateau form&#233; 
sur une base dont le r&#233;f&#233;rent d&#233;signe un fruit mais pas mirabellier car la mirabelle ne se 
commercialise pas dans le monde entier et n&#8217;a donc pas besoin d&#8217;un transport en bateau. 
Les connaissances encyclop&#233;diques permettraient ainsi de faire le tri entre ce qui est ce 
qui a une pertinence d&#233;nominative et ce qui n&#8217;en a pas. 
</p>
<p> &#233; &#233;ren es 
</p>
<p>ARONOFF, M. (1980). Contextuals, in Language, 56, No. 4, pp. 744-758. 
</p>
<p>BLANCAFORT, S. J. H., RECOURCE, G., COUTO, J., SAGOT, B., STERN, R. et TEYSSOU, D. 
(2010). Traitement des inconnus : une approche syst&#233;matique de l&#8217;incompl&#233;tude lexicale, 
in Actes de TALN 2010, Montr&#233;al : Canada. 
</p>
<p>CARTONI, B. (2006). Constance et variabilit&#233; de l&#8217;incompl&#233;tude lexicale. No&#251;s (3), pp. 10&#8211;
13. 
</p>
<p>CLARK, E. V. et CLARK, H. (1979). When Nouns Surface as Verbs, in Language, 55, No. 4, 
pp. 767-811.  
</p>
<p>CORBIN, D. et CORBIN, P. (1991). Un traitement unifi&#233; du suffixe -ier(e), in Lexique 10, pp. 
61-145. 
</p>
<p>COURTIN, J., DUJARDIN, D., GENTHIAL, D. et KOWARSKI, I. (1994). Analyse et g&#233;n&#233;ration 
morphologique avec le syst&#232;me PILAF, in TAL &#171; Morphologie computationnelle &#187;, vol. 
35, n&#176; 2. 
</p>
<p>DAL, G. et NAMER, F. (2000). G&#233;n&#233;ration et analyse automatiques de ressources lexicales 
construites utilisables en recherche d&#8217;informations, in TAL 41. 
</p>
<p>DISTER, A. et FAIRON, C. (2004). Extension des ressources lexicales gr&#226;ce &#224; un corpus 
dynamique, in Lexicometrica. 
</p>
<p>69</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FELLBAUM, C. (1998). WordNet: An Electronic Lexical Database, Cambridge : MIT Press. 
 
FILLMORE, C. J. (1982). Frame semantics in T. L. S. of Korea (Ed.), Linguistics in the 
Morning Calm. Seoul: Hanshin Publishing Co. 
</p>
<p>KILGARRIFF, A et GREFENSTETTE, G. (2003). Introduction to the special issue on the Web as 
a corpus, in Computational Linguistics, 29(3), 333347. 
</p>
<p>KLEIBER, G. (1990). La s&#233;mantique du prototype. Cat&#233;gorie et sens lexical, Paris : PUF. 
</p>
<p>LANGACKER, R.W. (1987). Foundations of Cognitive Grammar. Vol. I: Theoretical 
Prerequisites, Stanford: Stanford University Press.  
</p>
<p>MAUREL, D. (2004). Les mots inconnus sont-ils des noms propres ? in Actes des JADT 
2004. 
</p>
<p>MERLO, A. (2011). &#201;laboration d&#8217;un prototype de g&#233;n&#233;rateur automatique de 
n&#233;ologismes formels : le cas des suffix&#233;s par &#8211;IER. M&#233;moire de recherche en vue de 
l&#8217;obtention du Master professionnel &#171; Lexicographie, Terminographie et Traitement 
Automatique de Corpus &#187;. Universit&#233; Charles de Gaulle, Lille 3. 
</p>
<p>NAMER, F. (2009). Morphologie, lexique et Traitement Automatique des Langues &#8211; Le 
syst&#232;me D&#233;riF : TIC et Sciences cognitives, London : Herm&#232;s Sciences Publishing. 
</p>
<p>PLENAT, M. (1997). Analyse morpho-phonologique d&#8217;un corpus d&#8217;adjectifs en &#8211;esque, in 
Journal of French Language Studies, 7 : 163&#8211;179. 
</p>
<p>ROCHE, M. (1997). Briard, bougeoir et camionneur : d&#233;riv&#233;s aberrants, d&#233;riv&#233;s possibles, 
in Corbin et al., &#233;d. (1997), pp. 241&#8211;250. 
</p>
<p>ROCHE, M. (1998). Deux &#233;tudes sur la d&#233;rivation en -ier(e), Toulouse, Carnets de 
grammaire (Rapports internes de l'ERSS, CNRS et Universit&#233; de Toulouse-Le Mirail). 
</p>
<p>SAGOT, B. et FISER, D. (2008). Construction d'un wordnet libre du fran&#231;ais &#224; partir de 
ressources multilingues, in TALN 2008, Avignon, France. 
</p>
<p>TZOUKERMANN, E. et JACQUEMIN, C. (1997). Analyse automatique de la morphologie 
d&#233;rivationnelle et filtrage de mots possibles, in Silexicales &#171; Mots possibles et mots 
existants &#187;, n&#176; 1, pp. 251 &#8211; 260. 
</p>
<p>SABLAYROLLES, J.-F. (2000). La n&#233;ologie en fran&#231;ais contemporain. Examen du concept 
et analyse de productions n&#233;ologiques r&#233;centes, Paris : Honor&#233; Champion. 
</p>
<p>SABLAYROLLES, J.-F. (2008). N&#233;ologie et dictionnaire(s) comme corpus d&#8217;exclusion, in 
N&#233;ologie et terminologie dans les dictionnaires, douzi&#232;me Journ&#233;e des dictionnaires, 
Universit&#233; de Cergy-Pontoise, 17 mars 2004, sous la direction de Sablayrolles Jean-
Fran&#231;ois, Paris : H. Champion. 
</p>
<p>SILBERZTEIN, M. (1993). Dictionnaires &#233;lectroniques et analyse de texte : le syst&#232;me 
INTEX, Masson : Paris.  
</p>
<p>SPROAT, R. (1992). Morphology and Computation, Cambridge : MIT Press. 
</p>
<p>TEMPLE, M. (1996). Pour une s&#233;mantique des mots construits, Villeneuve d&#8217;Asq : Presses 
Universitaires du Septentrion.  
</p>
<p>70</p>

</div></div>
</body></html>