<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction d&#8217;indicateurs de construction collective de connaissances dans la formation en ligne</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 337&#8211;350,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Extraction d&#8217;indicateurs de construction collective de
connaissances dans la formation en ligne
</p>
<p>Alexandre Baudrillart1, 2
(1) Universit&#233; Stendhal Grenoble 3, BP 25, 38040 Grenoble Cedex 9, France
</p>
<p>(2) Universit&#233; de Lyon, CNRS INSA-Lyon, UMR5205 F-69621, France
alexandre.baudrillart@u-grenoble3.fr
</p>
<p>R&#201;SUM&#201;
Dans le cadre d&#8217;apprentissages humains assist&#233;s par des environnements informatiques,
les techniques de TAL ne sont que rarement employ&#233;es ou restreintes &#224; des t&#226;ches ou des
domaines sp&#233;cifiques comme l&#8217;ALAO (Apprentissage de la Langue Assist&#233; par Ordinateur)
o&#249; elles sont omnipr&#233;sentes mais ne concernent que certaines dimensions du TAL. Nous
cherchons &#224; explorer les possibilit&#233;s ou les performances des techniques voire des m&#233;-
thodes de TAL pour des syst&#232;mes moins sp&#233;cifiques d&#232;s lors qu&#8217;une dimension de r&#233;seau
et de collectivit&#233; est pr&#233;sente. Plus particuli&#232;rement, notre objectif est d&#8217;obtenir des indica-
teurs sur la construction collective de connaissances, et ses modalit&#233;s. Ce papier pr&#233;sente
la probl&#233;matique de notre th&#232;se, son contexte, nos motivations ainsi que nos premi&#232;res r&#233;flexions.
</p>
<p>ABSTRACT
Collaborative Knowledge Building Indicators Extraction in Distance Learning
</p>
<p>Natural Language Processing techniques are still not very much used within the field of
Technology Enhanced Learning. They are restricted to specific tasks or domains such as CALL
(standing for Computer Assisted Language Learning) in which they are ubiquitous but do not
match every linguistic aspect they could process. We are seeking to explore possibilities or
performances of thoses techniques for less specific systems including a network or community
aspect. More precisely, our goal is to get indicators about collective knowledge building and its
modalities. This paper presents the problem and the background of our thesis problem, as well
as our motivation and our first reflections.
</p>
<p>MOTS-CL&#201;S : TAL, EIAH, formation en ligne, socio-constructivisme, acquisition des connais-
sances, apprentissage collaboratif en ligne.
</p>
<p>KEYWORDS: NLP, TEL, distance learning, socio-constructivism, knowledge aquisition, collabora-
tion, CSCL.
</p>
<p>Introduction
</p>
<p>Nous abordons dans cet article une probl&#233;matique li&#233;e &#224; un potentiel apport des traitements
automatiques de la langue aux Environnements Informatiques pour l&#8217;Apprentissage Humain
(EIAH) avec une finalit&#233; d&#8217;am&#233;lioration des performances p&#233;dagogiques.
</p>
<p>337</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les Environnements Informatiques pour l&#8217;Apprentissage Humain permettent &#224; des apprenants, &#224;
des tuteurs ou &#224; des professeurs d&#8217;interagir avec et au travers d&#8217;un syst&#232;me. Les apprenants vont
gr&#226;ce &#224; lui pouvoir prendre part &#224; des situations d&#8217;apprentissages, participer individuellement
ou en groupe &#224; des activit&#233;s. Le r&#244;le du syst&#232;me est de faciliter l&#8217;apprentissage. Une mani&#232;re
de favoriser la r&#233;ussite d&#8217;un apprenant dans son entreprise peut &#234;tre de guider l&#8217;apprenant et
de lui fournir des retours (feedback), sur les performances d&#8217;apprentissage. Ces retours peuvent
pr&#233;senter des informations plus ou moins brutes, ou des conseils pr&#233;cis ou directifs. Ce sont
des indicateurs. Afin qu&#8217;un apprenant puisse en tirer un b&#233;n&#233;fice, ces retours doivent &#234;tre
interpr&#233;tables et exploitables.
</p>
<p>Dans le cadre d&#8217;apprentissages collectifs &#224; distance, un des r&#244;les importants de l&#8217;environnement
est de permettre l&#8217;interaction et la discussion entre les diff&#233;rents protagonistes et principalement
entre les apprenants. C&#8217;est gr&#226;ce &#224; ce dispositif qu&#8217;un partage d&#8217;informations peut avoir lieu et
que des d&#233;bats peuvent s&#8217;instaurer, permettant ainsi la construction collective de connaissances.
</p>
<p>Une des fonctionnalit&#233;s qu&#8217;offre ce genre de syst&#232;me est la conservation de traces d&#8217;activit&#233;s.
Ces traces sont donc de deux types : des traces d&#8217;interactions avec le syst&#232;me, c&#8217;est-&#224;-dire les
actions r&#233;alis&#233;es par les utilisateurs et m&#233;diatis&#233;es par l&#8217;Interface Homme-Machine, et des traces
d&#8217;interactions entre agents humains, support&#233;es par la langue et donc textuelles, au travers du
syst&#232;me (dans un cadre collaboratif). Ces &#233;changes textuels v&#233;hiculent des id&#233;es, des &#233;tats d&#8217;esprit
ou des comportements sociaux qui participent &#224; une construction individuelle et collective de
connaissances. Les traces textuelles et d&#8217;actions s&#8217;organisent sur un axe temporel ce qui permet
d&#8217;acc&#233;der &#224; une dimension s&#233;quentielle de l&#8217;activit&#233; des participants. &#192; ces traces s&#8217;ajoute la
conservation de documents produits individuellement ou en collaboration qui sont alors le
r&#233;sultat attendu des &#233;changes, qui synth&#233;tisent les id&#233;es et les cristallisent. Une production
collective peut &#234;tre construite en parall&#232;le des &#233;changes ou a posteriori, et est susceptible d&#8217;&#234;tre
augment&#233;e, r&#233;duite ou refondue, &#224; plusieurs reprises. Elle exprime un &#233;tat des connaissances
collectives.
</p>
<p>La probl&#233;matique que nous voulons aborder consiste &#224; &#233;valuer les possibilit&#233;s d&#8217;applications
des traitements automatiques des langues actuels pour extraire des indicateurs sur le niveau, la
qualit&#233; et les modalit&#233;s de connaissances construites collectivement et en r&#233;seau, d&#232;s lors que
des traces d&#8217;interactions en langue naturelle entre les diff&#233;rents apprenants ou de productions
collectives sont conserv&#233;es et collect&#233;es. Cette extraction, qui doit r&#233;sulter de traitements auto-
matiques sur les diff&#233;rentes traces accumul&#233;es, a pour but d&#8217;avoir un impact sur les performances
d&#8217;apprentissage. Cette probl&#233;matique est encore vague et sujet &#224; discussion, tant en ce qui
concerne les situations d&#8217;apprentissage pr&#233;cises concern&#233;es, le mat&#233;riau textuel susceptible d&#8217;&#234;tre
analyser et les indicateurs &#224; produire.
</p>
<p>Cet article a pour but de pr&#233;senter les motivations, apporter des justifications de notre probl&#233;ma-
tique. Il s&#8217;organise de la fa&#231;on suivante. Nous commencerons par exposer un mod&#232;le de notation
constituant pour nous une forme canonique de ce que nous pourrions vouloir automatiser :
une premi&#232;re motivation directe. Nous pr&#233;senterons ensuite dans quelle mesure sont utilis&#233;es
certaines m&#233;thodes de TAL pour les EIAH et notamment pour les syst&#232;mes ALAO pour &#233;clai-
rer non pas un verrou scientifique &#224; lever, mais une pluridisciplinarit&#233; encore embryonnaire :
apportant des motivations indirectes. Nous exposerons ensuite en quoi l&#8217;Analyse S&#233;mantique
Latente, convient pour repr&#233;senter la connaissance, pour simuler un mod&#232;le d&#8217;apprentissage ou
pour &#233;valuer des notions acquises par l&#8217;apprenant en tant qu&#8217;individu isol&#233;. Nous essayerons de
montrer qu&#8217;il est possible d&#8217;aller d&#8217;une approche statistique et connexionniste pour l&#8217;individu &#224; un
</p>
<p>338</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>mod&#232;le plus symbolique et dialogique pour un groupe d&#8217;apprenants, et donc &#224; caract&#232;re social,
ce qui rejoint notre probl&#233;matique. Nous terminerons sur la n&#233;cessit&#233; d&#8217;amorcer nos recherches
en nous focalisant sur un sous-probl&#232;me et en construisant un corpus d&#8217;observation.
</p>
<p>1 Motivation directe
</p>
<p>1.1 Pr&#233;sentation des travaux
</p>
<p>Dans (Hou et Wu, 2011), sont &#233;tudi&#233;es les caract&#233;ristiques des discussions synchrones m&#233;diatis&#233;es
&#224; but p&#233;dagogique. L&#8217;int&#233;r&#234;t se porte sur l&#8217;impact d&#8217;une discussion synchrone et de sa m&#233;diatisa-
tion informatique par messagerie instantan&#233;e sur la construction collective de connaissances, les
types d&#8217;interactions et les degr&#233;s de coordination. Un autre objectif est de voir &#233;merger des motifs
s&#233;quentiels de comportements c&#8217;est-&#224;-dire de types de message caract&#233;risant une discussion de
haute qualit&#233; ou une discussion de basse qualit&#233;. Pour cela, une exp&#233;rience &#224; deux facettes est
mise en place. Cette &#233;tude requiert l&#8217;intervention d&#8217;experts humains pour cat&#233;goriser et &#233;valuer
les interactions textuelles individuellement d&#8217;une part et la qualit&#233; des discussions d&#8217;autre part.
</p>
<p>1.2 L&#8217;exp&#233;rience
</p>
<p>L&#8217;exp&#233;rience consiste &#224; observer &#224; long terme, trois mois, des groupes d&#8217;&#233;tudiants de moins de
dix membres chacun, constituant au total quarante apprenants, discuter et d&#233;battre par le biais
d&#8217;une application de messagerie instantan&#233;e. Ces discussions portent sur un sujet fix&#233; par leur
professeur ; elles doivent mener les &#233;tudiants &#224; des conclusions et des synth&#232;ses.
</p>
<p>La premi&#232;re facette de l&#8217;exp&#233;rience est une analyse quantitative des messages. Des experts
humains, poss&#233;dant des comp&#233;tences psychologiques, classent les messages en types d&#8217;interaction
repr&#233;sentant un certain comportement de l&#8217;apprenant au sein de chacune des discussions,
comportements eux-m&#234;mes regroup&#233;s en quatre cat&#233;gories : &#233;laboration de la connaissance,
organisation et collaboration entre apprenants, interactions sociales et hors-sujet. Puis, ce sont
les qualit&#233;s des discussions enti&#232;res qui sont &#233;valu&#233;es par l&#8217;enseignant, expert dans la discipline
qu&#8217;il enseigne et sur lesquelles portent les discussions. Elles sont not&#233;es selon quatre crit&#232;res :
clarification du sujet, collecte d&#8217;informations, profondeur d&#8217;analyse et conclusion. Ces notes
permettent ensuite de construire deux cat&#233;gories : haute qualit&#233; et basse qualit&#233;. Peu de pr&#233;cisions
sont donn&#233;es &#224; ce sujet.
</p>
<p>La deuxi&#232;me facette de l&#8217;exp&#233;rience concerne les suites de comportements. Afin de faire &#233;merger
des continuit&#233;s, des discontinuit&#233;s ainsi que des d&#233;pendances entre comportements ou cat&#233;go-
ries de comportement, une analyse s&#233;quentielle des suites de comportements statistiquement
significatives est r&#233;alis&#233;e.
</p>
<p>1.3 R&#233;sultats
</p>
<p>Les r&#233;sultats quantitatifs concernant toutes les discussions montrent qu&#8217;entre la moiti&#233; et deux
tiers des contributions sont hors-sujet.
</p>
<p>339</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une autre part de 30 % est principalement constitu&#233; de messages concernant des &#233;changes sur le
savoir acad&#233;mique. Le reste concerne la coordination des &#233;tudiants ou des messages &#224; caract&#232;res
sociaux comme des remerciements ou des encouragements.
</p>
<p>Les r&#233;sultats relatifs &#224; chaque qualit&#233; de discussion apparaissent et discriminent haute qualit&#233; et
basse qualit&#233;. Le premier, le plus flagrant, met en &#233;vidence que les discussions de haute qualit&#233;
ont g&#233;n&#233;r&#233; quatre fois plus de contributions, ce qui souligne un rythme soutenu et une profondeur
des discussions, ainsi qu&#8217;une motivation de la part des apprenants. Ces discussions sont plus
vari&#233;es dans l&#8217;&#233;laboration de la connaissance, et l&#8217;identification de d&#233;saccords et la n&#233;gociation
du sens sont plus pr&#233;sentes. La dimension organisationnelle est presque inexistante au sein des
discussions de basse qualit&#233; alors qu&#8217;elle appara&#238;t de mani&#232;re pertinente dans celles de haute
qualit&#233; indiquant que ces apprenants explicitent la coordination de leurs d&#233;marches. Selon les
auteurs, il r&#233;sulte de la comparaison des chiffres que des interactions sociales telles que des
encouragements ou des f&#233;licitations sont un ciment entre la construction de la connaissances et la
coordination. Une autre observation int&#233;ressante est l&#8217;apparente ind&#233;pendance des contributions
hors-sujet vis-&#224;-vis de la qualit&#233; des discussions. Ces discussions peuvent &#234;tre &#224; l&#8217;origine d&#8217;un
climat propice &#224; une meilleure qualit&#233; de discussion.
</p>
<p>L&#8217;analyse s&#233;quentielle permet de mettre en &#233;vidence qu&#8217;il n&#8217;y a pas de v&#233;ritable continuit&#233; d&#8217;un
comportement particulier de construction de connaissance. Par contre, il existe des suites de
comportements vari&#233;s de construction de la connaissance, garante du maintien du focus des
apprenants sur le sujet et de discussions plus approfondies. En outre, ces motifs s&#233;quentiels
significatifs ne traduisent aucune d&#233;pendance des contributions hors-sujet vis-&#224;-vis des autres
cat&#233;gories.
</p>
<p>1.4 Discussion sur une automatisation
</p>
<p>Nous pouvons nous interroger quant &#224; la capacit&#233; de techniques informatiques &#224; automatiser ces
protocoles exp&#233;rimentaux et &#224; aboutir des conclusions similaires. Il faut noter que chaque analyse,
classification ou &#233;valuation est r&#233;alis&#233;e par des experts humains et qu&#8217;aucune remarque n&#8217;est
donn&#233;e au sujet de traitements pouvant automatiser ces processus. La classification des messages
est effectu&#233;e par des experts en psychologie, et les types de comportements sont eux-m&#234;mes
regroup&#233;s en cat&#233;gories selon, deux niveaux. La qualit&#233; des discussions est &#233;valu&#233;e, selon un
bar&#232;me par un expert du domaine : l&#8217;enseignant.
</p>
<p>Identifier automatiquement la cat&#233;gorie d&#8217;un message pourrait permettre la d&#233;tection de s&#233;-
quences particuli&#232;res et &#233;mettre des hypoth&#232;ses sur la direction que prennent les &#233;changes
permettant d&#8217;inf&#233;rer des conseils, des pistes ou encore simuler un participant virtuel (proche d&#8217;un
tuteur intelligent), &#224; cette discussion afin d&#8217;am&#233;liorer discussion et apprentissage par son biais.
Ces processus d&#233;cisionnels ne sont pas triviaux. Cette perspective nous am&#232;ne &#224; nous interroger
sur la pluridisciplinarit&#233; qui existe entre EIAH et TAL : a-t-on les moyens de r&#233;pondre &#224; cette
automatisation les m&#233;thodes voire les techniques et les ressources dont dispose la communaut&#233; ?
</p>
<p>340</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Motivations indirectes
</p>
<p>D&#8217;autres motivations &#224; notre probl&#233;matique proviennent d&#8217;une utilisation tr&#232;s mod&#233;r&#233;e et non
enti&#232;re du TAL. Pourtant, les connaissances ou les &#233;changes &#224; traiter au sein d&#8217;environnement
d&#8217;apprentissage sont support&#233;s par un mat&#233;riau langagier.
</p>
<p>Nous allons exposer des situations d&#8217;apprentissages assist&#233;es par ordinateur afin de montrer qu&#8217;il
y a encore beaucoup d&#8217;opportunit&#233;s &#224; marier EIAH et TAL par l&#8217;interm&#233;diaire d&#8217;un &#233;tat de l&#8217;art
encore partiel, en nous appuyant sur une classification propos&#233;e dans (Gurevych et al., 2009).
</p>
<p>L&#8217;actuelle utilisation des technologies du TAL au sein du champ des EIAH y est d&#233;peinte et
fractionn&#233;e en quatre cat&#233;gories : g&#233;n&#233;ration automatique d&#8217;exercices, &#233;valuation automatique de
dissertation, aide &#224; la lecture et &#224; l&#8217;&#233;criture et gestion de contenus et apprentissages collaboratif(s).
La suite d&#233;taille &#224; quelles activit&#233;s p&#233;dagogiques ou &#233;l&#233;ments de l&#8217;ing&#233;nierie p&#233;dagogique fait
r&#233;f&#233;rence chacune de ces cat&#233;gories, et pr&#233;senter en quoi est employ&#233; le TAL.
</p>
<p>2.1 G&#233;n&#233;ration automatique d&#8217;exercices
</p>
<p>La premi&#232;re cat&#233;gorie regroupe entre autres la g&#233;n&#233;ration automatique d&#8217;&#233;l&#233;ments d&#8217;exercices
tels que les questions &#224; choix multiples (Karamanis, 2006), ou d&#8217;exercices entiers tels que les
exercices lacunaires (Lee et Seneff, 2007). Elle r&#233;unit la construction des intitul&#233;s, des r&#233;ponses
associ&#233;es, la notation automatique des r&#233;sultats ainsi que l&#8217;&#233;valuation de l&#8217;efficacit&#233; de ces tests
pour juger la qualit&#233; d&#8217;acquisition de connaissances et pour diff&#233;rencier les &#171; bons &#187; &#233;tudiants des
&#171; moins bons&#187; .
</p>
<p>La d&#233;marche g&#233;n&#233;rale consiste &#224; extraire automatiquement de textes, &#224; l&#8217;aide de motifs syn-
taxiques, la r&#233;ponse &#224; une question, notamment au sein de phrases d&#233;finitoires. Pour les QCM, il
faut ensuite g&#233;n&#233;rer l&#8217;&#233;nonc&#233; qui va amener &#224; la bonne r&#233;ponse, en transformant affirmations en
interrogations, en inversant la construction syntaxique pour l&#8217;anglais et en choisissant un des
fameux pronoms &#8217;WH&#8217;. En revanche, pour de simples exercices lacunaires, il suffit de capturer le
mat&#233;riau authentique qui constitue en lui-m&#234;me l&#8217;objet du test. Il ne reste alors plus qu&#8217;&#224; &#244;ter
l&#8217;&#233;l&#233;ment qui constituera la lacune, et d&#8217;indiquer l&#8217;attente qui est souvent g&#233;n&#233;rique.
</p>
<p>D&#232;s lors qu&#8217;un choix multiple est envisag&#233;, une derni&#232;re &#233;tape intervient dans la g&#233;n&#233;ration de
l&#8217;exercice : le choix de &#171; distractors&#187; . Ces &#233;l&#233;ments repr&#233;sentent les autres choix possibles que les
r&#233;ponses attendues dont leur r&#244;le et leur choix r&#233;pondent &#224; des crit&#232;res particuliers comme une
proximit&#233; s&#233;mantique suffisante sans pour autant installer une ambigu&#239;t&#233;. Ces exercices attendent
des r&#233;ponses ferm&#233;es, simplifiant ainsi la v&#233;rification de celles propos&#233;es par les &#233;tudiants :
l&#8217;&#233;valuation automatique reste donc relativement ais&#233;e.
</p>
<p>Il faut noter que ces types d&#8217;exercices portent souvent sur des questions de vocabulaire, d&#8217;ortho-
graphe ou de conjugaison et ne concernent donc que l&#8217;apprentissage de la langue elle-m&#234;me,
maternelle ou seconde. Pr&#232;s de 90% des r&#233;f&#233;rences de cette cat&#233;gorie cit&#233;es dans (Gurevych
et al., 2009) concernent l&#8217;apprentissage de la langue. Leurs emplois ne se limitent pas &#224; cet
apprentissage mais peuvent aborder d&#8217;autres disciplines, pour des questions de terminologie ou
de compr&#233;hension.
</p>
<p>341</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.2 &#201;valuation automatique de dissertation
</p>
<p>L&#8217;&#233;valuation de r&#233;sum&#233;s ou de dissertations produits par des apprenants est une t&#226;che pouvant
&#233;prouver le TAL. Cette seconde cat&#233;gorie &#233;value des crit&#232;res que nous regroupons selon quatre
principaux points : lisibilit&#233;, focalisation sur le sujet &#224; traiter (en &#233;vitant les hors-sujet) et les
th&#232;mes ou notions abord&#233;s, qualit&#233; d&#8217;argumentation et validit&#233; des propos repr&#233;sentant la r&#233;elle
compr&#233;hension.
</p>
<p>L&#8217;&#233;valuation de la lisibilit&#233; est depuis longtemps trait&#233;e et utilise notamment des m&#233;thodes
num&#233;riques qui consistent par exemple &#224; compter des descripteurs de surface. Ces derniers
sont par exemple le nombre moyen de syllabes par mot, de mots ou de syntagmes par phrase,
ou encore le nombre d&#8217;hapax, de termes r&#233;p&#233;t&#233;es exactement sans emploi anaphorique ou de
synonymes (Burstein, 2009; Gurevych et al., 2009).
</p>
<p>La lisibilit&#233; d&#233;pend aussi d&#8217;une coh&#233;rence discursive, au moins &#224; courte port&#233;e. Pour cela il faut
d&#233;tecter des ruptures th&#233;matiques inappropri&#233;es entre des unit&#233;s textuelles adjacentes (Burstein,
2009). D&#233;tecter ces ruptures peut &#234;tre r&#233;alis&#233; par le biais de m&#233;thodes utilisant une repr&#233;sentation
vectorielle et lexicale du sens. Le Text Tiling de Martin Hearst (Hearst, 1997) permet &#224; l&#8217;aide
de telles repr&#233;sentations de r&#233;aliser un d&#233;coupage des paragraphes en ensembles de phrases
coh&#233;rents.
</p>
<p>Une dissertation n&#8217;est bien r&#233;dig&#233;e que si elle met en valeur une th&#232;se soutenue par suffisamment
d&#8217;arguments, eux-m&#234;mes &#233;tay&#233;s par des faits. Une argumentation insuffisamment aliment&#233;e et
structur&#233;e peine &#224; convaincre et ne r&#233;pond pas non plus &#224; une n&#233;cessit&#233; d&#8217;exposer des notions
attendues. Pouvoir construire un discours complet en restituant des connaissances organis&#233;es est
un moyen de montrer l&#8217;acquisition, la compr&#233;hension et la ma&#238;trise de notions (Trausan-Matu,
2010b). Cela permet d&#8217;aborder un point concernant l&#8217;&#233;valuation de la compr&#233;hension voire de
v&#233;rifier un caract&#232;re de v&#233;rit&#233; des propos.
</p>
<p>C&#8217;est pourquoi, il est possible de consid&#233;rer que la r&#233;daction d&#8217;un essai respectant les points
2 et 3 est un indicateur de compr&#233;hension. L&#8217;appariement de ces productions avec des textes,
fortement similaires, faisant autorit&#233; sur la question ou jouant le r&#244;le d&#8217;&#233;talons &#233;valu&#233;s par un
groupe de juges humains pour chaque &#171; note &#187; donn&#233;e est une mani&#232;re de pouvoir donner un
score &#224; la compr&#233;hension. Ce qui reviendrait &#224; un calcul de similarit&#233; avec, par exemple, un cours
(Dessus, 1999), ou une classification de nouvelles copies dans des cat&#233;gories correspondant &#224;
chaque &#233;chelon de notes, par &#224; un calcul de similarit&#233; maximale avec les copies repr&#233;sentatives
des cat&#233;gories (Foltz et al., 1999). Nous avons ainsi soit une r&#233;partition des copies selon leur
similarit&#233; avec un &#171; gold-standard &#187; soit une t&#226;che de classification supervis&#233;e.
</p>
<p>Ces similarit&#233;s sont calcul&#233;es sur le contenu (le signifiant) mais doivent rendre compte du sens
(le signifi&#233;). C&#8217;est pourquoi des mod&#232;les lexicaux de calcul et de repr&#233;sentation du sens peuvent
&#234;tre adapt&#233;s (pour plus de d&#233;tails, voir 3.1). En outre, l&#8217;utilisation d&#8217;ontologies, de th&#233;saurus
sp&#233;cifiques &#224; un domaine (GeneOntology 1, UMLS 2) ou de r&#233;seaux s&#233;mantiques plus g&#233;n&#233;raux
(WordNet 3) peut permettre la manipulation plus directe de concepts et de sens en faisant
abstraction des lex&#232;mes qui les incarnent, permettant notamment d&#8217;unifier des synonymes.
</p>
<p>1. http ://www.geneontology.org/
2. http ://www.nlm.nih.gov/research/umls/
3. http ://wordnet.princeton.edu/
</p>
<p>342</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.3 Aide &#224; la lecture et &#224; l&#8217;&#233;criture
</p>
<p>Lire des textes en langue non maternelle ou contenant des termes sp&#233;cifiques &#224; un domaine,
abordant des concepts inconnus (&#171; loin au-del&#224; de la zone proximale de d&#233;veloppement&#187; ) ou
r&#233;dig&#233;s avec un style pompeux peut &#234;tre une t&#226;che difficile. C&#8217;est pourquoi, ces lectures peuvent
n&#233;cessiter une aide ext&#233;rieure sous la forme de simplifications de textes, de propositions de
synonymes, de glossaires (Gaudio, 2007) ou encore de documents tiers explicitant d&#233;finitions,
concepts ou simplement traitant du m&#234;me sujet.
</p>
<p>Dans l&#8217;id&#233;al, ces documents doivent &#234;tre accessibles &#224; l&#8217;apprenant tant en terme de vocabulaire
que de connaissances pr&#233;-requises, tout en permettant l&#8217;acquisition de nouvelles connaissances.
Les connaissances qu&#8217;ils transportent sont alors pr&#233;sentes dans ce que Lev Vygotsky, p&#232;re du
constructivisme, nomme la zone proximale de d&#233;veloppement, &#171; ni trop proches &#187; du mod&#232;le de
l&#8217;apprenant &#171; ni trop &#233;loign&#233;s&#187; (Zampa, 2005).
</p>
<p>La r&#233;daction, quant &#224; elle, peut &#234;tre assist&#233;e en fournissant des correcteurs automatiques ortho-
graphiques et syntaxiques ou encore des dictionnaires de synonymes mais aussi en permettant
d&#8217;identifier les notions expos&#233;es par l&#8217;apprenant et abord&#233;es dans le cours dans le cadre duquel
la production &#233;crite s&#8217;inscrit (Lemaire et Dessus, 2001).
</p>
<p>L&#8217;identification d&#8217;une structure des th&#232;mes et des notions couverts par l&#8217;&#233;crit, et calqu&#233;e sur la
structure typographique ou logique peut mettre en &#233;vidence des probl&#232;mes de coh&#233;rence. En
observant les couvertures respectives d&#8217;unit&#233;s adjacentes, on peut alors identifier des ruptures
th&#233;matiques (Lemaire et Dessus, 2001). En cela, ces possibilit&#233;s rejoignent le Text-Tiling (Hearst,
1997) permettant d&#8217;identifier ces ruptures afin de d&#233;limiter des zones textuelles coh&#233;rentes.
</p>
<p>2.4 Gestion de contenus et apprentissage collaboratif(s)
</p>
<p>L&#8217;essor du Web a permis l&#8217;acc&#232;s &#224; des ressources en ligne comme des sites sp&#233;cialis&#233;s ou des
encyclop&#233;dies num&#233;riques, mais il a aussi permis de cr&#233;er un savoir construit socialement dans
des forums, des blogs ou encore des wikis. Dans (Gurevych et al., 2009), les auteurs insistent
quasi-exclusivement sur des travaux dans lesquels le TAL est utilis&#233; pour organiser et structurer
la connaissance notamment dans des wikis. Ces travaux sont dans l&#8217;ensemble tr&#232;s proche de
l&#8217;ing&#233;nierie des connaissances et de la recherche documentaire.
</p>
<p>Mais il s&#8217;agit aussi d&#8217;analyser des &#233;changes dans le cadre de d&#233;bats impos&#233;s, de forums de forma-
tions ou de discussions. Le projet europ&#233;en LTfLL a notamment apport&#233; une contribution non
n&#233;gligeable et on peut noter l&#8217;existence du module PolyCAFe (Rebedea et al., 2010; Trausan-Matu,
2010a,b) qui fournit des feedbacks aux diff&#233;rents protagonistes d&#8217;une situation d&#8217;apprentissage
sous forme de d&#233;bats. Nous revenons en particulier sur ce module dans la section suivante.
</p>
<p>Entre autres, des travaux sur l&#8217;analyse automatique de forums de formation &#224; distance alimentent
aussi cette cat&#233;gorie. Dans (Sidir et al., 2006), ce sont les forums libres c&#8217;est-&#224;-dire sans limite de
temps et sans t&#226;che fixe qui sont cibl&#233;s. Ces travaux essayent notamment d&#8217;identifier s&#8217;il existe
&#171; des processus de co-construction de connaissances entre apprenants ind&#233;pendamment des
interventions des tuteurs&#187; .
</p>
<p>Une analyse th&#233;matique automatique avec le logiciel ThemAgora souligne une progression
discursive en rapport avec celle de la formation. Une analyse linguistique et manuelle du discours
</p>
<p>343</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>fond&#233;e sur le mod&#232;le d&#8217;exposition de Yamada d&#233;gage plusieurs mouvements dans le discours
correspondant &#224; des phases diff&#233;rentes de cette co-construction de connaissance.
</p>
<p>2.5 Discussion
</p>
<p>Ces premiers &#233;l&#233;ments d&#8217;un &#233;tat de l&#8217;art nous am&#232;nent &#224; deux conclusions. La premi&#232;re est
que l&#8217;utilisation du TAL dans les EIAH semble se trouver principalement dans l&#8217;Apprentissage
de la Langue Assist&#233; par Ordinateur (ALAO) et que de surcro&#238;t l&#8217;apprentissage en groupe n&#8217;est
peut-&#234;tre pas ce qui tire le plus parti du TAL. La seconde conclusion r&#233;side dans le fait que
toutes les axes linguistiques ne sont pas couverts par l&#8217;application du TAL aux EIAH. En effet, la
dimension rh&#233;torique et l&#8217;argumentative zoning (Teufel, 1999) semblent d&#233;laiss&#233;s et l&#8217;utilisation
de mod&#232;les discursifs ou dialogiques encore embryonnaires. C&#8217;est pourquoi, le TAL a sa place
dans les EIAH car il pourrait notamment apporter des indicateurs qualitatifs sur la construction
de connaissances, ce qui fait actuellement d&#233;faut, laissant donc un espace encore vierge entre
TAL et EIAH et de nombreuses opportunit&#233;s (Antoniadis, 2008; Burstein, 2009; Antoniadis et al.,
2009)
</p>
<p>3 Du cognitif/connexionniste au socio-constructiviste : de
LSA vers le discours et le dialogue au travers d&#8217;un r&#233;seau
</p>
<p>3.1 L&#8217;Analyse S&#233;mantique Latente : d&#8217;un mod&#232;le documentaire, &#224; une re-
pr&#233;sentation des connaissances et un mod&#232;le de leurs acquisitions
</p>
<p>L&#8217;Analyse S&#233;mantique Latente est un mod&#232;le statistique et lexical de repr&#233;sentation vectorielle
du sens latent des termes port&#233; par les relations de co-occurence locale qu&#8217;ils entretiennent au
sein de documents d&#8217;un corpus (Deerwester et al., 1990) .
</p>
<p>Un corpus de documents est repr&#233;sent&#233; par une matrice de co-occurrence qui associe &#224; chacun
de ces documents (ou tout autre unit&#233; textuelle de grain pertinent) le nombre d&#8217;occurrences de
chacun des termes du corpus. Une d&#233;composition en valeurs singuli&#232;res permet de r&#233;duire le
rang de la matrice aux termes les pertinents et d&#8217;obtenir des vecteurs de m&#234;mes dimensions. Ce
mod&#232;le permet ainsi de calculer la proximit&#233; s&#233;mantique entre termes ou documents, c&#8217;est-&#224;-dire
les contextes qu&#8217;ils partagent directement ou indirectement, gr&#226;ce &#224; un simple cosinus entre
vecteurs.
</p>
<p>D&#8217;abord appliqu&#233; dans le champ de la recherche documentaire (Dumais, 1991), ce mod&#232;le s&#8217;est vu
employ&#233; dans diff&#233;rents autres domaines comme l&#8217;apprentissage et l&#8217;acquisition de connaissances,
et utilis&#233; dans des EIAH fournissant certains indicateurs.
</p>
<p>LSA permet de simuler certains processus cognitifs et notamment l&#8217;acquisition de vocabulaire
par exposition &#224; des textes. (Landauer et Dumais, 1997) ont montr&#233; qu&#8217;en faisant traiter par
LSA autant de mots/textes qu&#8217;un jeune entre 2 et 20 ans, le nombre de nouveaux mots acquis
par jour par celui-ci est du m&#234;me ordre que le nombre de nouvelles paires de mots proches
s&#233;mantiquement construites. De plus, la simulation de r&#233;ponses &#224; des tests de synonymies du
TOEFL par LSA, apr&#232;s exposition au contenu d&#8217;une encyclop&#233;die montre des r&#233;sultats proches de
</p>
<p>344</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ceux atteints par une population d&#8217;&#233;l&#232;ves &#233;trangers (Landauer et Dumais, 1997). La simulation
de r&#233;ponses de LSA &#224; des QCM sur des notions de math&#233;matiques apr&#232;s traitement de quelques
cours obtient des r&#233;sultats moins brillants. Dans ces deux cas, les r&#233;ponses choisies sont celles qui
sont les plus proches s&#233;mantiquement des &#233;nonc&#233;s dans le mod&#232;le vectoriel calcul&#233; &#224; partir du
corpus d&#8217;apprentissage. La diff&#233;rence de performance met alors en &#233;vidence l&#8217;importance de ce
corpus pour ces processus d&#233;cisionnels. LSA a aussi &#233;t&#233; mis &#224; profit dans des t&#226;ches de notations
et d&#8217;&#233;valuation de productions &#233;crites individuelles (Foltz et al., 1999). Dans (Dessus et Lemaire,
2002) les auteurs ont proc&#233;d&#233; &#224; des exp&#233;riences similaires mais avec un traitement diff&#233;rent. Une
indexation th&#233;matique sur deux niveaux hi&#233;rarchiques (Sujets et notions) de cours de sociologie
permet d&#8217;&#233;valuer ces productions tant en termes de coh&#233;rence que de couverture du sujet.
</p>
<p>En effet, le traitement de ce corpus par LSA selon ces deux niveaux permet de fournir des
indicateurs sur la couverture du sujet selon un axe macroscopique et microscopique. Le calcul
de similarit&#233; par LSA entre la production de l&#8217;apprenant et les diff&#233;rents sujets et notions du
cours permet de d&#233;terminer quel est le contenu du cours couvert par sa copie d&#8217;une part, mais
aussi d&#8217;appr&#233;hender le plan, l&#8217;organisation de sa copie gr&#226;ce &#224; un appariement &#224; des grains plus
petits. Ces indications de couvertures au niveau microscopique permettent aussi de fournir un
retour sur la coh&#233;rence textuelle inter-phrastique (Foltz et al., 1999; Dessus, 1999, 2000), d&#8217;une
mani&#232;re proche du Text-Tiling (Hearst, 1997), et d&#8217;identifier des ruptures et des changements
th&#233;matiques brutaux et inattendus faisant baisser la qualit&#233; de la copie.
</p>
<p>Ce principe est int&#233;gr&#233; dans le logiciel Apex (Dessus et Lemaire, 2002) qui permet de guider
l&#8217;apprenant dans l&#8217;exploration de documents ou de cours &#224; des fins d&#8217;apprentissage. Ce syst&#232;me
propose &#224; un &#233;tudiant de lire des textes en rapport avec une requ&#234;te qu&#8217;il fournit puis de dire
s&#8217;il peut ou non r&#233;sumer ce texte. Dans le cas affirmatif, il est invit&#233; &#224; construire un r&#233;sum&#233; du
texte qui est alors &#233;valu&#233; par le processus pr&#233;c&#233;dent. Dans l&#8217;autre cas ou si le r&#233;sum&#233; est de faible
qualit&#233;, un autre texte est propos&#233;. Le choix du texte suivant est crucial et fond&#233; sur LSA. En
effet, le texte suivant propos&#233; &#224; l&#8217;apprenant est celui qui est le plus proche s&#233;mantiquement de
l&#8217;ensemble des r&#233;sum&#233;s qu&#8217;il a pu produire.
</p>
<p>Deux choses sont int&#233;ressantes dans cette utilisation de LSA. La premi&#232;re est le fait que les
mod&#232;les de repr&#233;sentation des connaissances de l&#8217;apprenant et celui du but &#224; atteindre sont les
m&#234;mes : LSA. L&#8217;&#233;tat des connaissances de l&#8217;apprenant est alors l&#8217;ensemble des r&#233;sum&#233;s qu&#8217;il a pu
produire et le but r&#233;side dans les documents propos&#233;s en r&#233;ponse &#224; sa requ&#234;te pr&#233;alable. L&#8217;autre
aspect int&#233;ressant est d&#8217;utiliser la r&#233;ponse de l&#8217;apprenant sur sa capacit&#233; &#224; r&#233;sumer un texte pour
en r&#233;alit&#233; savoir s&#8217;il l&#8217;a compris.
</p>
<p>Nous avons essay&#233; de pr&#233;senter l&#8217;Analyse S&#233;mantique Latente, certaines de ses possibilit&#233;s et de
ses utilisations en rapport avec le domaine &#233;ducatif. Nous voulions insister sur le fait qu&#8217;il est
ici principalement utilis&#233; pour repr&#233;senter l&#8217;&#233;tat de connaissance d&#8217;un individu et permet entre
autres de comparer ses productions &#224; un mat&#233;riau qui fait autorit&#233; sur cette connaissance, gr&#226;ce
une repr&#233;sentation des relations entre termes. &#192; notre connaissance, LSA ne semble pas employ&#233;e
dans des situations d&#8217;apprentissage qui sont le si&#232;ge d&#8217;interactions distantes et informatiquement
m&#233;diatis&#233;es entre apprenants, du moins pas &#224; m&#234;me escient.
</p>
<p>345</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.2 Vers une construction sociale de connaissances gr&#226;ce au dialogue et
au partage dans un r&#233;seau
</p>
<p>Nous voudrions pr&#233;senter des travaux mettant en &#339;uvre diff&#233;rentes techniques du TAL pour
restituer certains indicateurs dans la collaboration. Leurs travaux s&#8217;appuient sur les transpositions
des notions de dialogisme, de polyphonie et d&#8217;inter-animation de Bakhtin ainsi que sur l&#8217;hypoth&#232;se
que discours et dialogue jouent un r&#244;le pr&#233;pond&#233;rant dans la construction et l&#8217;acquisition des
connaisances. (Trausan-Matu, 2010b).
</p>
<p>3.2.1 D&#233;finitions
</p>
<p>Voici les d&#233;finitions des notions relatives &#224; Bakhtin traduites depuis (Trausan-Matu, 2010b) :
</p>
<p>Dialogisme Un concept introduit par Mikhail Bahthin, qui consid&#232;re que chaque cr&#233;ation et
activit&#233; langagi&#232;re humaine est un dialogue, incluant non seulement les conversations mais
aussi des textes ou m&#234;me des r&#233;flexions.
</p>
<p>Inter-animation Un ph&#233;nom&#232;ne sp&#233;cifique &#224; la polyphonie ou &#224; des groupes de personnes colla-
borant dans lequel plusieurs voix entrent en dialogue et, &#224; cause d&#8217;interactions caract&#233;ris&#233;es
par le m&#234;me ou le diff&#233;rent (centrip&#232;te ou centrifuge), un th&#232;me est d&#233;velopp&#233;.
</p>
<p>Polyphonie Une r&#233;alisation conjointe qui implique plusieurs individus qui construisent en
collaborant une structure coh&#233;rente et durable &#224; partir d&#8217;un th&#232;me donn&#233;, m&#234;me si des
dissonances d&#233;lib&#233;r&#233;es et transitoires peuvent apparaitre. Afin d&#8217;atteindre une coh&#233;rence,
diff&#233;rentes r&#232;gles assurant l&#8217;harmonie se doivent d&#8217;&#234;tre respect&#233;es.
</p>
<p>3.2.2 Le syst&#232;me
</p>
<p>Dans (Trausan-Matu, 2010a) et (Rebedea et al., 2010), les auteurs pr&#233;sentent un syst&#232;me nomm&#233;
PolyCAFe analysant les &#233;changes entre des &#233;tudiants dans une optique de d&#233;bat, et de synth&#232;se,
concernant un domaine bien d&#233;fini, sur une plateforme informatique d&#233;di&#233;e conservant les traces
de ces discussions.
</p>
<p>Ce syst&#232;me associe &#224; une cha&#238;ne de traitement linguistique traditionnelle une ontologie repr&#233;sen-
tant les concepts du domaine, ici les interfaces Homme-Machine. Afin d&#8217;&#233;viter des ambigu&#239;t&#233;s
dues &#224; la polys&#233;mie des langues naturelles et dans le but d&#8217;identifier les diff&#233;rents fils de dis-
cussion, une LSA est r&#233;alis&#233;e au pr&#233;alable sur un corpus du domaine comparant les concepts
&#233;voqu&#233;s dans deux messages au sein de l&#8217;espace s&#233;mantique construit.
</p>
<p>Le but est ici d&#8217;identifier les dimensions longitudinale et transversale de la polyphonie mais
aussi de rendre compte de l&#8217;inter-animation : l&#8217;entrem&#234;lement des propos des uns dans ceux
des autres et d&#8217;identifier les r&#233;f&#233;rences des uns aux autres. &#192; cette fin, le syst&#232;me de discussion
invite les participants &#224; pr&#233;ciser &#224; quel apprenant ils r&#233;pondent. Cette information est utilis&#233;e
pour identifier de premi&#232;res interactions explicites. Des traitements linguistiques de plus haut
niveau prennent place pour identifier les r&#233;f&#233;rences implicites des uns aux autres. Ces traitements
consistent notamment en une identification de r&#233;p&#233;titions, une r&#233;solution de la cor&#233;f&#233;rence, un
calcul de similarit&#233; gr&#226;ce &#224; LSA et la prise en compte de connecteurs logiques afin d&#8217;identifier
des actes de langage et des paires adjacentes. Cette derni&#232;re identification peut permettre de
d&#233;tecter des comportements et les diff&#233;rents r&#244;les qu&#8217;endossent les apprenants dans la discussion.
</p>
<p>346</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ce point avait d&#233;j&#224; &#233;t&#233; envisag&#233; dans (George, 2004) mais &#233;vinc&#233; suite &#224; des r&#233;serves concernant
la faisabilit&#233; d&#8217;une automatisation de cette d&#233;tection.
</p>
<p>Capter les diff&#233;rentes interactions entre les apprenants permet de construire alors un r&#233;seau qui
va repr&#233;senter l&#8217;inter-animation amenant &#224; une construction du savoir. Une analyse des r&#233;seaux
sociaux identifie diff&#233;rents crit&#232;res significatifs comme la centralit&#233; des graphes, les degr&#233;s, les
participants faisant autorit&#233; (au sens du pagerank de Google) ou la coh&#233;sion, notamment avec
le calcul de composantes fortement connexes et de cliques. Cette &#233;tape permet de retourner
des indicateurs quant &#224; la participation de chacun dans les diff&#233;rents fils de discussions ou la
position plus ou moins centrale dans les d&#233;bats. S&#8217;ajoutent &#224; ces indicateurs des informations sur
la lisibilit&#233; et la coh&#233;rence textuelle des propos.
</p>
<p>Ces travaux sont tr&#232;s int&#233;ressants car ils mettent en perspective les techniques actuelles du TAL de
bas niveau (analyse morphosyntaxique, LSA, ontologie) et de haut niveau (discours et dialogisme)
mais aussi les techniques d&#8217;analyse de r&#233;seaux sociaux pour des situations collaboratif en ligne.
</p>
<p>3.3 Bilan
</p>
<p>Nous avons voulu montrer qu&#8217;en passant de l&#8217;individu au groupe, certaines m&#233;thodes restaient
int&#233;ressantes m&#234;me si leur utilisation n&#8217;&#233;tait pas identique et que les probl&#233;matiques concernant
la construction de la connaissance se d&#233;placent. Chez l&#8217;individu, c&#8217;est la connaissance construite
qui nous int&#233;resse alors que dans une co-construction, ce sont aussi les constructeurs et le chantier.
De plus, une constante apparait : la construction du sens gr&#226;ce, non pas aux &#233;l&#233;ments (termes ou
individus) eux-m&#234;mes, mais gr&#226;ce aux relations qu&#8217;ils entretiennent entre eux.
</p>
<p>4 R&#233;el et Focalisation
</p>
<p>Nous cherchons &#224; explorer un champ de recherche pluridisciplinaire mariant EIAH et TAL.
Cela nous impose de r&#233;soudre un conflit m&#233;thodologique. En effet, le champ des EIAH aborde
l&#8217;ing&#233;nierie pour r&#233;pondre &#224; des besoins et permettre des usages par un m&#233;dia et un outillage
informatique &#224; des fins didactiques : il met en &#339;uvre des analyses th&#233;oriques et g&#233;n&#233;ralistes, sans
n&#233;cessairement de mat&#233;riau d&#8217;observation, des mod&#233;lisations p&#233;dagogiques et informatiques,
des exp&#233;rimentations et des &#233;valuations par les utilisateurs des syst&#232;mes produits. Le TAL utilise
des m&#233;thodologies plus empiriques mettant habituellement &#224; profit l&#8217;observation d&#8217;un mat&#233;riau
repr&#233;sentatif d&#8217;une entr&#233;e &#224; traiter, proposant des mod&#232;les informatiques et linguistiques &#233;prouv&#233;s
dans le cadre d&#8217;exp&#233;rimentations sur des corpus d&#8217;&#233;valuations. La vastitude apparente de notre
probl&#233;matique nous invite ainsi &#224; amorcer nos recherches en pr&#233;cisant la t&#226;che &#224; traiter c&#8217;est-
&#224;-dire la situation ou les situations d&#8217;apprentissages, les protagonistes, les traces textuelles
collect&#233;es et les indicateurs &#224; produire, mais aussi &#224; observer un mat&#233;riau langagier r&#233;el &#224; partir
d&#8217;un corpus de traces.
</p>
<p>Les situations d&#8217;apprentissage socio-constructivistes auxquelles nous nous int&#233;ressons et pour
lesquelles nous devons fournir des indicateurs restent floues. Nos discussions ont mis en avant
parmi ces situations celles d&#8217;apprentissages par projet ou de d&#233;bat/r&#233;solutions de probl&#232;mes. Dans
ces deux situations, les apprenants sont amen&#233;s &#224; discuter, &#224; faire des recherches personnelles,
&#224; partager les informations recueillies et leurs points de vue. Il s&#8217;agit aussi de critiquer le point
</p>
<p>347</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de vue d&#8217;autrui ou le sien, de n&#233;gocier le sens de certaines informations, la validit&#233; de propos,
d&#8217;exclure en accord des informations ou encore de discuter en parall&#232;le de plusieurs notions.
Ce type d&#8217;exercice attend g&#233;n&#233;ralement sa cl&#244;ture par une &#233;tape de synth&#232;se et de conclusion
des d&#233;bats. Cette &#233;tape est le si&#232;ge de consensus ou de l&#8217;int&#233;gration de plusieurs opinions et a
pour vocation de r&#233;pondre &#224; l&#8217;exercice. Cette r&#233;ponse peut prendre plusieurs formes : clore les
&#233;changes ou &#234;tre r&#233;dig&#233;e collectivement de mani&#232;re d&#233;port&#233;e. Dans ce dernier cas, l&#8217;&#233;laboration
de la r&#233;ponse se d&#233;roule soit en parall&#232;le des &#233;changes soit a posteriori et peut alors &#234;tre r&#233;vis&#233;e
maintes et maintes fois. Des aspects comme la discipline abord&#233;e, la dur&#233;e des exercices et le
nombre d&#8217;apprenants participant au m&#234;me exercice restent obscurs. Il nous faudra aussi d&#233;cider
si nous devons traiter oui ou non ces param&#232;tres de mani&#232;re g&#233;n&#233;rique, ce qui para&#238;t ambitieux.
</p>
<p>Nous n&#8217;avons pas non plus d&#233;fini ou d&#233;crit la population qui constitue les diff&#233;rents utilisateurs,
la discipline concern&#233;e, leur niveau dans leur discipline la langue dans laquelle ils discutent
(maternelle ou seconde), leur niveau de langue. Or ces informations sont n&#233;cessaires pour &#233;tablir
un profil, un mod&#232;le de l&#8217;apprenant et pourraient s&#8217;av&#233;rer d&#233;terminantes dans une chaine de
traitement automatique de la langue.
</p>
<p>Les traces textuelles que nous allons traiter sont &#224; la fois des productions qui r&#233;pondent aux
exercices auxquels prennent part les apprenants, et des messages &#233;chang&#233;s au travers d&#8217;un r&#233;seau
de mani&#232;re synchrone ou asynchrone. Ce type de messages pr&#233;sente des caract&#233;ristiques proches
de l&#8217;oral et peut notamment &#234;tre bruit&#233;. (Sidir et al., 2006; Bouchet et Sansonnet, 2006).
</p>
<p>Nous travaillons donc un mat&#233;riau r&#233;el et bruit&#233; dans lesquels les usages et les normes ont
plus leur place que des r&#232;gles. Pour appr&#233;hender cette &#171; r&#233;alit&#233; empirique &#187; et capter certains
invariants propres &#224; ce genre et &#224; ce type de discours, il est donc n&#233;cessaire de s&#8217;impr&#233;gner d&#8217;un
&#233;chantillon repr&#233;sentatif et de s&#8217;atteler &#224; une description. Notre t&#226;che consiste &#224; manipuler du
sens, or, selon Rastier (Rastier, 2005), le sens ob&#233;it notamment &#224; ces sp&#233;cificit&#233;s &#224; causes des
probl&#232;mes s&#233;mantiques que sont l&#8217;implicite et la polys&#233;mie, caract&#233;risant la langue naturelle.
</p>
<p>Ainsi, (Rastier, 2005; Williams, 2003; Bouchet et Sansonnet, 2006) nous incitent donc &#224; construire
un corpus d&#8217;&#233;tude pouvant nous aider &#224; focaliser nos recherches sur le r&#233;el d&#8217;une situation. M&#234;me
si ce n&#8217;est qu&#8217;une amorce, cela nous permettra peut-&#234;tre par la suite d&#8217;atteindre une certaine
g&#233;n&#233;ricit&#233; attendue.
</p>
<p>Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; la probl&#233;matique que nous formulons, qui consiste &#224; explorer les capacit&#233;s
du TAL pour l&#8217;extraction d&#8217;indicateurs sur la construction collective de connaissances au sein
d&#8217;EIAH, et avons tent&#233; de la justifier en pr&#233;sentant des opportunit&#233;s et en montrant la couverture
partielle des EIAH par le TAL et du TAL par les EIAH. Nous avons montr&#233; les possibilit&#233;s qu&#8217;offre
LSA pour repr&#233;senter et &#233;valuer les connaissances d&#8217;un individu, mais aussi un syst&#232;me r&#233;cent
mettant en &#339;uvre diff&#233;rentes techniques du TAL pour fournir des indicateurs quantitatifs sur
la construction collective de connaissances et qui repr&#233;sentent un point de d&#233;part et de rep&#232;re
pour nos travaux. Nous terminons en pr&#233;sentant les particularit&#233;s li&#233;es &#224; la pluridisciplinarit&#233;
de notre probl&#233;matique et des choix qu&#8217;il nous faudra peut-&#234;tre faire assez t&#244;t malgr&#233; un conflit
m&#233;thodologique qui s&#8217;y oppose.
</p>
<p>Nos perspectives concernent la consolidation de l&#8217;&#233;tat de l&#8217;art et la justification de notre probl&#233;-
</p>
<p>348</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>matique mais aussi des questions li&#233;es &#224; la repr&#233;sentation de la construction et son &#233;volution en
prenant en compte ce qui est construit, qui construit quoi, et si le multiple construit du m&#234;me ou
du diff&#233;rent. Il nous faut aussi approfondir les moyens d&#8217;identifier des moments du discours et de
calculer des diff&#233;rentiels entre l&#8217;&#233;tat de la construction des connaissances entre deux instants
ou en un instant et &#233;tat cible. Les graphes (Zouaq et al., 2000) et les cartes conceptuelles nous
semblent un moyen envisageable (Berlanga et al., 2009).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ANTONIADIS, G. (2008). Du TAL et de son apport aux syst&#232;mes d&#8217;apprentissage des langues :
Contributions. Habilitation &#224; diriger des recherches en informatique et traitement automatique
des langues, Universit&#233; Stendhal - Grenoble 3.
ANTONIADIS, G., GRANGER, S., KRAIF, O., PONTON, C., MEDORI, J. et ZAMPA, V. (2009). Integrated
Digital Language Learning. In BALACHEFF, N., LUDVIGSEN, S., JONG, T., LAZONDER, A. et BARNES,
S., &#233;diteurs : Technology-Enhanced Learning, chapitre 6, pages 89&#8211;103. Springer Netherlands,
Dordrecht.
BERLANGA, A. J., KALZ, M., STOYANOV, S., van ROSMALEN, P., SMITHIES, A. et BRAIDMAN, I. (2009).
Using language technologies to diagnose learner&#8217;s conceptual development. Advanced Learning
Technologies, IEEE International Conference on, 0:669&#8211;673.
BOUCHET, F. et SANSONNET, J. (2006). &#201;tude d&#8217;un corpus de requ&#234;tes en langue naturelle pour
des agents assistants. In Actes du Deuxi&#232;me Workshop sur les Agents Conversationnels Anim&#233;s
(WACA 2006), pages 95&#8211;104, Toulouse, France.
BURSTEIN, J. (2009). Opportunities for natural language processing research in education.
CICLing 09 Proceedings of the 10th International Conference on Computational Linguistics and
Intelligent Text Processing, 5449:6&#8211;27.
DEERWESTER, S., DUMAIS, S. T., FURNAS, G. W., LANDAUER, T. K. et HARSHMAN, R. (1990). Indexing
by latent semantic analysis. Journal of the American Society for Information Science, 41(6):391&#8211;
407.
DESSUS, P. (1999). Apex, un syst&#232;me d&#8217;aide &#224; la pr&#233;paration d&#8217;examens. Sciences et Techniques
&#233;ducatives, 6(2):409&#8211;415.
DESSUS, P. (2000). Construction de connaissances par exposition &#224; un cours avec LSA. In Cognito,
18:27&#8211;34.
DESSUS, P. et LEMAIRE, B. (2002). Using production to assess learning : An ILE that fosters
self-regulated learning, volume 2363, pages 772&#8211;781. Springer.
DUMAIS, S. (1991). Improving the retrieval of information from external sources. Behavior
Research Methods, 23(2):229&#8211;236. 10.3758/BF03203370.
FOLTZ, P. W., LAHAM, D. et LANDAUER, T. K. (1999). Automated essay scoring : Applications to
education technology. In Proceedings of EDMEDIA, volume 1, pages 939&#8211;944. AACE.
GAUDIO, R. D. (2007). Supporting e-learning with automatic glossary extraction : Experiments
with portuguese. In RANLP 2007 workshop : Natural Language Processing and Knowledge
Representation for eLearning Environments.
GEORGE, S. (2004). Analyse automatique de conversations textuelles synchrones d&#8217;apprenants
pour la d&#233;termination de comportements sociaux. Sciences et Technologies de l&#8217;Information et de
la Communication pour l&#8217;&#201;ducation et la Formation (STICEF), Vol. 10:p. 165&#8211;193.
</p>
<p>349</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUREVYCH, I., BERNHARD, D. et BURCHARDT, A. (2009). Educational natural language processing.
Notes for ENLP tutorial held at AIED 2009 in Brighton.
</p>
<p>HEARST, M. A. (1997). Texttiling : Segmenting text into multi-paragraph subtopic passages.
Computational Linguistics, pages 33&#8211;64.
</p>
<p>HOU, H.-T. et WU, S.-Y. (2011). Analyzing the social knowledge construction behavioral pat-
terns of an online synchronous collaborative discussion instructional activity using an instant
messaging tool : A case study. Computers &amp; Education, 57:1459&#8211;1468.
</p>
<p>KARAMANIS, N. (2006). Generating multiple-choice test items from medical text : A pilot study.
In In Proceedings of INLG 2006, pages 104&#8211;107.
</p>
<p>LANDAUER, T. K. et DUMAIS, S. T. (1997). A solution to plato&#8217;s problem : The latent semantic
analysis theory of acquisition, induction, and representation of knowledge. Psychological review,
pages 211&#8211;240.
</p>
<p>LEE, J. et SENEFF, S. (2007). Automatic generation of cloze items for prepositions. In INTER-
SPEECH, pages 2173&#8211;2176. ISCA.
</p>
<p>LEMAIRE, B. et DESSUS, P. (2001). A system to assess the semantic content of student essays.
Journal of Educational Computing Research, 24(3):305&#8211;320.
</p>
<p>RASTIER, F. (2005). Enjeux &#233;pist&#233;mologiques de la linguistique de corpus, pages 31&#8211;45. Presses
Universitaires de Rennes.
</p>
<p>REBEDEA, T., DASCALU, M., TRAUSAN-MATU, S., BANICA, D., GARTNER, A., CHIRU, C. et MIHAILA,
D. (2010). Overview and preliminary results of using polycafe for collaboration analysis and
feedback generation. In Proceedings of the 5th European conference on Technology enhanced
learning conference on Sustaining TEL : from innovation to learning and practice, EC-TEL&#8217;10,
pages 420&#8211;425, Berlin, Heidelberg. Springer-Verlag.
</p>
<p>SIDIR, M., LUCAS, N. et GIGUET, E. (2006). De l&#8217;analyse des discours &#224; l&#8217;analyse structurale
des r&#233;seaux sociaux : une &#233;tude diachronique d&#8217;un forum &#233;ducatif. Sciences et Technologies de
l&#8217;Information et de la Communication pour l&#8217;&#201;ducation et la Formation (STICEF), 13.
</p>
<p>TEUFEL, S. (1999). Argumentative Zoning : Information Extraction from Scientific Text. Th&#232;se de
doctorat, University of Edinburgh, School of Cognitive Science.
</p>
<p>TRAUSAN-MATU, S. (2010a). Automatic support for the analysis of online collaborative learning
chat conversations. In Proceedings of the Third international conference on Hybrid learning,
ICHL&#8217;10, pages 383&#8211;394, Berlin, Heidelberg. Springer-Verlag.
</p>
<p>TRAUSAN-MATU, S. (2010b). The polyphonic model of hybrid and collaborative learning. In
WANG, F. L., FONG, J. et KWAN, R., &#233;diteurs : Handbook of Research on Hybrid Learning Models :
Advanced Tools, Technologies, and Applications, pages 466&#8211;486. Information Science Publishing,
New York.
</p>
<p>WILLIAMS, G. (2003). Texte et Corpus. In Actes des Troisi&#232;mes Journ&#233;es de la Linguistique de
Corpus, pages 1&#8211;307.
</p>
<p>ZAMPA, V. (2005). Utilisation de l&#8217;analyse s&#233;mantique latente pour tenter d&#8217;optimiser l&#8217;acquisition
par exposition &#224; une langue &#233;trang&#232;re de sp&#233;cialit&#233;. Volume 8.
</p>
<p>ZOUAQ, A., FRASSON, C. et ROUANE, K. (2000). The explanation agent. In GAUTHIER, G., FRASSON,
C. et VANLEHN, K., &#233;diteurs : Intelligent Tutoring Systems, 5th International Conference, ITS 2000,
Montr&#233;al, Canada, June 19-23, 2000, Proceedings, volume 1839 de Lecture Notes in Computer
Science, pages 554&#8211;563. Springer.
</p>
<p>350</p>

</div></div>
</body></html>