<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Compression textuelle sur la base de r&#232;gles issues d'un corpus de sms</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 309&#8211;322,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Compression textuelle sur la base de r&#232;gles issues 
d'un corpus de sms
</p>
<p>Arnaud Kirsch 
UCL - CenTAL - Place Blaise Pascal 1, Louvain-la-Neuve, 1348
</p>
<p>arnaud.kirsch@student.uclouvain.be
R&#201;SUM&#201;
</p>
<p>La pr&#233;sente recherche cherche &#224;  r&#233;duire la taille de messages  textuels sur  la  base de 
techniques de compression observ&#233;es, pour la  plupart, dans un  corpus  de sms. Ce papier 
explique la  m&#233;thodologie suivie pour  &#233;tablir  des r&#232;gles  de contraction. Il  pr&#233;sente 
ensuite les 33 r&#232;gles  retenues, et illustre les quatre niveaux  de compression  propos&#233;s par 
deux exemples concrets, produits automatiquement par  un premier prototype. Le but de 
cette recherche n'est  donc pas de produire de &quot;l'&#233;crit-sms&quot;, mais d'&#233;laborer un proc&#233;d&#233; 
de compression capable de produire des textes courts  et compr&#233;hensibles &#224; partir  de 
n'importe quelle source textuelle en fran&#231;ais. Le terme &quot;d'essentialisation&quot; est propos&#233; 
pour d&#233;signer cette approche de r&#233;duction textuelle.
</p>
<p>ABSTRACT
</p>
<p>Textual Compression Based on Rules Arising from a Corpus of Text 
Messages
</p>
<p>The present research seeks to reduce the size of text messages on the basis of 
compression techniques observed mostly in a corpus of sms. This  paper explains the 
methodology  followed to establish  compression rules. It then presents the 33 considered 
rules, and illustrates the four suggested levels of compression  with two practical 
examples, automatically  generated by a first prototype. This  research&#8217;s main purpose is 
not to produce &quot;sms-language&quot;, but consists in  designing a  textual  compression process 
able to generate short and understandable texts from  any textual  source in  French. The 
term of &quot;essentialization&quot; is proposed to describe this approach of textual reduction.
</p>
<p>MOTS-CLEFS : r&#233;sum&#233; automatique, compression de texte, sms, lisibilit&#233;, essentialisation.
</p>
<p>KEYWORDS : summarization, text compression, text messaging, readability, 
essentialization.
</p>
<p>309</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1. Introduction
</p>
<p>Les locuteurs, en pleine &quot;convergence num&#233;rique&quot;, sont amen&#233;s simultan&#233;ment &#224; 
&#233;changer divers types de messages &#233;crits  dans de m&#234;mes environnements (c'est le cas de 
Facebook o&#249;  la m&#234;me interface permet l'&#233;change de mails, de messages instantan&#233;s  et de 
sms) et de m&#234;mes types de messages &#233;crits dans des environnements divers (des  emails 
peuvent &#234;tre r&#233;dig&#233;s depuis un  ordinateur, une tablette ou un GSM). Un mode de 
communication bref et informel  traverse ainsi  les  genres et les media, mode mis en 
&#233;vidence par la  pr&#233;sente recherche, qui  veut proposer une aide &#224; la  r&#233;daction  de 
messages courts. 
</p>
<p>En  cela, nous nous sommes naturellement int&#233;ress&#233; au r&#233;sum&#233; automatique et &#224;  la 
compression de donn&#233;es, mais ces deux approches ne rencontrent pas  totalement notre 
objectif  : nous avons donc choisi de d&#233;river de nouvelles  r&#232;gles de contraction  &#233;manant 
des  pratiques des locuteurs. En effet, le r&#233;sum&#233; automatique, apparu  en linguistique 
informatique avec Luhn &#224;  la fin  des ann&#233;es 1950 (Luhn, 1958), &#224; pour  but la 
simplification d'un  texte en ne retenant que les  id&#233;es principales de celui-ci et en  les 
rassemblant dans un nouveau texte grammaticalement acceptable ((Minel, 2004), 
(Yousfi-Monod, 2007)). La  compression  de donn&#233;es vise elle &#224; modifier  la 
repr&#233;sentation  binaire des donn&#233;es pour en  r&#233;duire le poids num&#233;rique. Elle n&#233;cessite 
d&#233;compression du c&#244;t&#233; du r&#233;cepteur.
</p>
<p>&#192;  l'inverse, la proposition qui  fait l'objet de cet article poss&#232;de trois caract&#233;ristiques 
essentielles. (1) Le processus de simplification  se situe au caract&#232;re pr&#232;s : nous 
cherchons &#224; isoler  les caract&#232;res les plus essentiels  &#224;  la  transmission de la  totalit&#233; de 
l'information contenue dans le message initial, ce qui nous &#233;loigne du r&#233;sum&#233; 
automatique stricto sensu (Minel, 2004). Nous nous distinguons &#233;galement de la 
compression textuelle (Yousfi-Monod, 2007) qui  cherche &#224; supprimer  les segments non 
porteurs de sens  dans un texte. (2) Le processus de simplification ne doit pas entraver la 
compr&#233;hension  : quel  que soit le taux de compression  recherch&#233;, nous devons 
produire le texte le plus d&#233;codable possible, soit celui  &#224; partir duquel, malgr&#233; la 
disparition  d'un  certain nombre de caract&#232;res, un  lecteur  pourra le plus  ais&#233;ment 
retrouver le texte initial. Cela  signifie qu'il  y  aura une borne minimale en  de&#231;&#224; de 
laquelle il  ne sera pas possible de descendre, au  risque de rendre le texte de base 
totalement inintelligible (puisque nous entendons transmettre le texte tel  que comprim&#233;, 
sans intention  de d&#233;compression  &#224; l'arriv&#233;e). (3) Enfin, il  s'agit d'un processus de 
compression : seuls les  m&#233;canismes permettant de r&#233;duire la  taille du  message doivent 
&#234;tre pris en  compte. Pour  respecter  ces caract&#233;ristiques, nous nous sommes bas&#233; sur  le 
corpus de sms de (Fairon et al., 2006a), et avons  extrait une s&#233;rie de r&#232;gles de 
compression. Malgr&#233; les caract&#233;ristiques du  corpus d'entra&#238;nement, nous ne projetons 
pas de reproduire de l'&#233;crit-sms  ((Cougnon et  Fran&#231;ois, 2010) ; nous le noterons e-sms). 
Notre intention n'est donc pas d'inverser les syst&#232;mes de normalisation  tels que ceux 
d&#233;velopp&#233;s par (Yvon, 2008) et (Beaufort et al., 2010).
</p>
<p>Notre recherche, m&#234;me si  elle participe du  r&#233;sum&#233; automatique, s'en  distancie donc. En 
effet, selon  la  premi&#232;re caract&#233;ristique &#233;nonc&#233;e ci-dessus, nous ne cherchons pas &#224; 
extraire les id&#233;es principales d'un  texte, ni &#224; produire un  message grammaticalement 
acceptable : nous travaillons presque exclusivement au  niveau des caract&#232;res  et tentons 
de conserver  toutes les informations du  texte initial. Aussi  nous avons pr&#233;f&#233;r&#233; parler 
&quot;d'essentialisation&quot; de texte, dont voici  la d&#233;finition  : &quot;sous-proc&#233;d&#233; du r&#233;sum&#233; 
automatique focalis&#233; sur la  r&#233;duction  du nombre de caract&#232;res&quot;. Le prototype de 
programme d'essentialisation  automatique, ou  essentialiseur, a  notamment pour objectif 
</p>
<p>310</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>la  cr&#233;ation  d'une application Twitter&#174;1. Nous envisageons, &#224;  l'instar de ce qui  se fait d&#233;j&#224; 
en  anglais  (140it, 2012), qu'un utilisateur encode un texte plus grand et le r&#233;duise 
automatiquement &#224; l'aide dudit programme.
</p>
<p>Dans cet article nous aborderons tout d'abord la m&#233;thodologie que nous avons suivie 
pour &#233;tablir  nos r&#232;gles. Nous expliquerons ensuite le fonctionnement global d'un 
premier prototype d'essentialiseur, en d&#233;taillant les r&#232;gles retenues  et les classements de 
celles-ci. Nous terminerons par  l'&#233;vocation des difficult&#233;s et r&#233;sistances rencontr&#233;es et 
des perspectives de recherche que nous envisageons.
</p>
<p>2. M&#233;thodologie
</p>
<p>Notre proposition d'essentialisation se base sur  le corpus de (Fairon et al., 2006a). Ce 
corpus a  &#233;t&#233; constitu&#233; dans le cadre du projet sms4science : 30.000 messages ont &#233;t&#233; 
transcrits et annot&#233;s en 2004. Ces messages sont des sms v&#233;ritablement &#233;chang&#233;s entre 
usagers et permettent donc d'observer  les pratiques r&#233;elles de simplification de la 
population. Nous avons travaill&#233; sur trois  sous-corpus : l'un  contenant les messages 
d'exactement 160 caract&#232;res 2 , un autre ceux  de plus de 160 caract&#232;res, et le dernier les 
messages transcrits de plus de 160 caract&#232;res3. Les  messages de 160 caract&#232;res ont 
constitu&#233; notre corpus  d'entra&#238;nement, et les deux  autres ont servi  &#224;  valider nos 
observations.
</p>
<p>Sur la  base de ces  sous-corpus, nous avons &#233;tabli  une liste de r&#232;gles de contraction. 
Celles-ci consistent en la  formalisation  de certains ph&#233;nom&#232;nes en vue de respecter  deux 
enjeux majeurs : l'intercompr&#233;hension  et la  compression. Les ph&#233;nom&#232;nes les plus 
r&#233;currents  sont retenus parce qu'ils sont  suppos&#233;s &#234;tre les  plus intelligibles. Parmi ceux-
ci, nous ne nous int&#233;ressons qu'&#224;  ceux permettant de diminuer  la taille du  texte. &#192;  ces 
observations nous  avons ajout&#233; certaines r&#232;gles  qui  ne sont pas issues  de notre 
observation du corpus, par exemple la formalisation  des dates et des heures (norme ISO 
8601, cf. (ISO, 2012)). Enfin, nous  avons ordonn&#233; ses r&#232;gles et avons &#233;tabli diff&#233;rents 
niveaux de contraction.
</p>
<p>3. Le syst&#232;me
</p>
<p>La deuxi&#232;me &#233;tape de ce travail  a consist&#233; &#224; impl&#233;menter un premier  prototype 
d'essentialiseur. &#192;  ce stade de nos travaux, certains tests statistiques et  une &#233;valuation 
pr&#233;liminaire sont rendus possibles, comme nous le montrons ensuite.
</p>
<p>1 Site de microblogging, soit d'&#233;change de courts messages ne pouvant d&#233;passer 140 caract&#232;res.
</p>
<p>2 Ancienne limite technique, la limite de 160 caract&#232;res est aujourd'hui  une limite de facturation : 
un sms de 161  caract&#232;res sera factur&#233; comme deux  messages. Des &#233;tudes statistiques men&#233;es, 
notamment, sur  notre corpus, ont d&#233;montr&#233; qu'il  y  avait  un pic  de sms de  160 caract&#232;res (Cougnon 
et Fran&#231;ois, 2010).
</p>
<p>3 Le premier corpus contenait 2223 sms, le deuxi&#232;me 2298 et le troisi&#232;me 8310.
</p>
<p>311</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.1. Les r&#232;gles
</p>
<p>Nous avons &#233;tabli  33 r&#232;gles. Le TABLEAU 1  reprend chacune de ces r&#232;gles, en donne une 
explication  succincte et l'illustre par un  exemple concret. Les codes utilis&#233;s renvoient aux 
classements pr&#233;sent&#233;s par la suite (cf. 3.3.).
</p>
<p>R&#232;gle Description Exemple
</p>
<p>[0101]
</p>
<p>[0302]
</p>
<p>[0203]
</p>
<p>[0504]
</p>
<p>[0705]
</p>
<p>[0406]
</p>
<p>[1107]
</p>
<p>[1208]
</p>
<p>[0809]
</p>
<p>R&#233;duction des smileys
&#8226; :-) &#10132; :)
</p>
<p>&#8226; -__-&quot; &#10132; -_-&quot;
</p>
<p>Remplacement des URL par  une forme 
plus courte
</p>
<p>&#8226; http://
www.uclouvain.be/
cental-
cahiers.html#langsms 
&#10132; http://tinyurl.com/
7lumcf7
</p>
<p>R&#233;duction des r&#233;p&#233;titions inutiles de 
caract&#232;res
</p>
<p>&#8226; Mdrrrrrrr &#10132; mdr
</p>
<p>&#8226; Looooool &#10132; lol
</p>
<p>R&#233;alisation  des unit&#233;s lexicales en 
logogrammes
</p>
<p>&#8226; Vingt-quatre &#10132; 24
</p>
<p>&#8226; Et &#10132; &amp;
</p>
<p>Remplacement par un synonyme &#8226; Travailler &#10132; bosser
</p>
<p>Normalisation  des dates  et des  heures au 
format ISO 8601
</p>
<p>&#8226; Le 14 juillet 1989 vers 
12h30 &#10132; 1989-07-14 
vers 12:30
</p>
<p>Suppression  du pronom  sujet quand les 
formes verbales sont non ambigu&#235;s 
(notamment les il impersonnels)
</p>
<p>&#8226; Nous allons arriver &#10132; 
allons arriver
</p>
<p>&#8226; Il faut partir &#10132; Faut 
partir
</p>
<p>Si  deux verbes cons&#233;cutifs utilisent le 
m&#234;me pronom  sujet, et que la  premi&#232;re 
occurrence du  pronom sujet est 
maintenue, la seconde peut-&#234;tre 
supprim&#233;e
</p>
<p>&#8226; Je pense &#224; toi. Je veux 
te revoir. &#10132; Je pense &#224; 
toi. Veux te revoir.
</p>
<p>Ellipse des &quot;et&quot; qui retournent une 
interrogation et des &quot;ne&quot; de la n&#233;gation
</p>
<p>&#8226; Je vais bien, et toi ? &#10132; 
Je vais bien, toi ?
</p>
<p>&#8226; Je ne pense pas &#10132; Je 
pense pas
</p>
<p>312</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#232;gle Description Exemple
</p>
<p>[1010]
</p>
<p>[2411]
</p>
<p>[3012]
</p>
<p>[1513]
</p>
<p>[1614]
</p>
<p>[2115]
</p>
<p>[2016]
</p>
<p>[2317]
</p>
<p>[2218]
</p>
<p>[1319]
</p>
<p>[1420]
</p>
<p>[2721]
</p>
<p>[2522]
</p>
<p>[1723]
</p>
<p>Suppression  des mots r&#233;p&#233;t&#233;s (ne 
concerne pas les pronoms personnels) &#8226; Hello hello &#10132; Hello
</p>
<p>R&#233;duction  aux initiales des noms propres 
compos&#233;s et des noms communs 
compos&#233;s les plus courants
</p>
<p>&#8226; Pierre-Yves &#10132; P.Y.
</p>
<p>&#8226; Week-end &#10132; w.e.
</p>
<p>Simplification des  r&#233;p&#233;titions de 
pronoms personnels
</p>
<p>&#8226; Nous nous reverrons 
&#10132; nous reverrons
</p>
<p>&quot;tu&quot; et &quot;vous&quot;, suivis de voyelles, 
deviennent, respectivement, &quot;t'&quot; et &quot;z'&quot;
</p>
<p>&#8226; Tu arrives &#10132; t'arrives
</p>
<p>&#8226; Vous arrivez &#10132; 
z'arrivez
</p>
<p>R&#233;duction des &quot;tu&quot; et &quot;je&quot; &#224; l&#8217;initiale
&#8226; Tu vas &#10132; tvas
</p>
<p>&#8226; Je pense &#10132; jpense
</p>
<p>Fusion des  mots compos&#233;s, locutions, 
etc. Reconnus par ailleurs
</p>
<p>&#8226; Porte-monnaie &#10132; 
portemonnaie
</p>
<p>&quot;bisou(s)&quot; en fin de texte &gt; &quot;x&quot; &#8226; &#192;  plus, bisous. &#10132; &#224; plus, x
</p>
<p>Les monosyllabiques courants  sont 
r&#233;duits &#224; leur squelette &#8226; Temps &#10132; tps
</p>
<p>Certaines  fins de mots courantes sont 
r&#233;duites &#224; leur squelette
</p>
<p>&#8226; Internement &#10132; 
internemt
</p>
<p>Certains mots tr&#232;s courants du  texte sont 
r&#233;duits &#224; leur squelette &#8226; Beaucoup &#10132; bcp
</p>
<p>Apocopes des mots les plus fr&#233;quents &#8226; Anniversaire &#10132; anniv
</p>
<p>Suppression des consonnes  finales 
muettes, sauf les marques du pluriel &#8226; &#192; travers &#10132; &#224; traver
</p>
<p>Si  pas  d&#8217;ambigu&#239;t&#233;, suppression des 
marques muettes du pluriel &#8226; Journaux &#10132; journau
</p>
<p>Suppression  des schwas peu prononc&#233;s 
et fusion avec le mot suivant
</p>
<p>&#8226; Derni&#232;rement &#10132; 
derni&#232;rment
</p>
<p>&#8226; Je ne sais pas -&gt; je 
nsais pas
</p>
<p>313</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#232;gle Description Exemple
</p>
<p>[3124]
</p>
<p>[1825]
</p>
<p>[2626]
</p>
<p>[2827]
</p>
<p>[2928]
</p>
<p>[0629]
</p>
<p>[1930]
</p>
<p>[3231]
</p>
<p>[0932]
</p>
<p>[3333]
</p>
<p>Suppression  de tous les schwas ; les 
monosyllabiques fusionnent avec les 
mots qu&#8217;ils pr&#233;c&#232;dent
</p>
<p>&#8226; Je me grouillerai &#10132; 
jmgrouillerai
</p>
<p>Suppression des &quot;h&quot; muets &#8226; H&#233;risson &#10132; &#233;risson
</p>
<p>Simplification des doubles consonnes &#8226; Notamment &#10132; notament
</p>
<p>Les phon&#232;mes transcrits par plusieurs 
caract&#232;res  sont remplac&#233;s par des 
caract&#232;res uniques
</p>
<p>&#8226; Je voulais que tu 
viennes &#10132; je voul&#232; ke 
tu vienes
</p>
<p>Phon&#233;tisation  des  syllabes par  la lettre, le 
signe ou le chiffre
</p>
<p>&#8226; J'ai envie de toi &#10132; G 
envie 2 toi
</p>
<p>Simplification des abr&#233;viations &#8226; P.-S. &#10132; PS
</p>
<p>Suppression  des  points finaux, des 
apostrophes, des traits d&#8217;union  et 
simplification des points de suspension 
(r&#233;duits &#224; deux points successifs)
</p>
<p>&#8226; J'imagine &#10132; jimagine
</p>
<p>&#8226; Penses-tu &#10132; pensestu
</p>
<p>Suppression  des doubles points et 
points-virgules
</p>
<p>&#8226; Je disais : comment 
vas-tu ? &#10132; je disais 
comment vas-tu ?
</p>
<p>Les espaces s&#233;parant deux syst&#232;mes 
graphiques diff&#233;rents sont supprim&#233;s
</p>
<p>&#8226; J'ai pass&#233; 1 bonne 
journ&#233;e &#10132; j'ai 
pass&#233;1bonne journ&#233;e
</p>
<p>&#8226; Je suis d&#233;gout&#233; ! Et il 
est l&#224; ! &#10132; je suis 
d&#233;gout&#233;!Et il est l&#224;!
</p>
<p>Suppression de tous les espaces : 
scriptura continua (sauf entre deux 
caract&#232;res num&#233;riques)
</p>
<p>&#8226; Je ne crois pas &#10132; 
jenecroispas
</p>
<p>TABLEAU 1 - Pr&#233;sentation des r&#232;gles
</p>
<p>3.2. Remarques sur le tableau
</p>
<p>Nous regroupons ici une s&#233;rie de remarques concernant le Tableau 1 :
</p>
<p>&#8226; L'ordonnancement des r&#232;gles n'est pas  fig&#233; : en  fonction  des r&#233;sultats  d'une enqu&#234;te 
qualitative, ou  en cas  d'ajout ou de suppression  d'une r&#232;gle, l'ordre global  peut &#234;tre 
repens&#233; : il  y a une grande vari&#233;t&#233; de types de compression d'un m&#234;me texte, nous  en 
</p>
<p>314</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>choisissons une, sans pr&#233;tendre qu'elle soit la meilleure, afin qu'elle serve de ligne de 
conduite ;
</p>
<p>&#8226; Certaines r&#232;gles, comme [0101] et [0203] proviennent typiquement de 
caract&#233;ristiques propres au corpus sur  lequel nous nous sommes bas&#233; : le but de notre 
syst&#232;me &#233;tant de pouvoir travailler  sur  n'importe quel  type de texte, nous devons donc 
y int&#233;grer des r&#232;gles plus sp&#233;cifiques &#224; certains textes qu'&#224; d'autres ;
</p>
<p>&#8226; [0203] seule : il  est clair  que ces r&#233;p&#233;titions sont porteuses de sens &#233;galement, et que 
les supprimer revient &#224; enlever une partie du  sens encod&#233; initialement. C'est 
n&#233;anmoins un choix  que nous  posons de les r&#233;duire, afin  de gagner  quelques 
caract&#232;res ;
</p>
<p>&#8226; Un  logogramme (mentionn&#233; en [0504]) est un  &quot;[d]essin  repr&#233;sentatif d'une notion 
(logogramme s&#233;mantique ou id&#233;ogramme) ou  d'une suite phonique constitu&#233;e par  un 
mot (logogramme phon&#233;tique ou phonogramme).&quot; (TLFi, 2012) ;
</p>
<p>&#8226; Les synonymes, tels qu'&#233;voqu&#233;s par  la r&#232;gle [0705], soul&#232;vent un probl&#232;me &#233;vident : il 
n'existe que tr&#232;s peu  de synonymes  parfaits, et une substitution peut donc 
fr&#233;quemment modifier une partie du  sens apport&#233;. Pour  cette approche pr&#233;liminaire, 
nous avons &#233;tabli  manuellement une courte liste de synonymes, dont les variations 
s&#233;mantiques portent plut&#244;t sur le registre de langue (&quot;bosser&quot; pour  &quot;travailler&quot;, par 
exemple). Ce choix est certes discutable, mais est en  lien  avec notre remarque 
pr&#233;liminaire : nous cherchons &#224;  cadrer avec un  mode de communication bref et 
informel ;
</p>
<p>&#8226; De nombreuses  r&#232;gles, comme [1107], [1208], [0809], etc. se basent sur le constat que 
le fran&#231;ais  est parfois redondant (r&#233;p&#233;titions, reformulations, etc.). Nous cherchons &#224; 
d&#233;finir  ces redondances  (et  d'autres) pour les r&#233;duire au  maximum et donc gagner de 
l'espace ;
</p>
<p>&#8226; La r&#232;gle [2115] pr&#233;voit la  fusion  des mots compos&#233;s et autres locutions  (puisque plus 
facilement identifiables/compr&#233;hensibles par le lecteur). Si nous avions simplement 
d&#233;cid&#233; de fusionner les collocations4  se serait  pos&#233;e la  question de l'&#233;valuation  du 
degr&#233; de figement des syntagmes. Nous avons donc tout d'abord repris une liste finie 
de mots compos&#233;s que nous avons augment&#233;e de locutions relev&#233;es automatiquement 
dans notre corpus5 ;
</p>
<p>&#8226; Les r&#232;gles relatives aux squelettes  consonantiques ([2317], [2218] et  [1319]) sont 
&#233;tablies, elles aussi, sur  la  base de notre corpus : nous avons relev&#233; de tr&#232;s nombreux 
squelettes et en avons d&#233;gag&#233; des constantes. La difficult&#233; de ces trois  r&#232;gles est de 
d&#233;terminer quelles unit&#233;s sont plus facilement compr&#233;hensibles  lorsqu'elles sont 
autant r&#233;duites. En  ce qui  concerne leurs fr&#233;quences d'apparition, nous nous sommes 
bas&#233; sur une &#233;valuation statistique de notre corpus ;
</p>
<p>&#8226; Lors  de la  phon&#233;tisation  des syllabes  [2928], les lettres &#224;  lire pour leur valeur 
phon&#233;tique seront encod&#233;es en  majuscule. Aussi, avant l'application de cette r&#232;gle, 
toutes les  majuscules orthographiques sont r&#233;duites, afin  d'&#233;viter tout risque de 
</p>
<p>4 Au sens de &#171; cooccurrences statistiquement privil&#233;gi&#233;es &#187;.
</p>
<p>5Pour  ce faire, nous avons mesur&#233; la fr&#233;quence d'apparition de chaque mot  dans les transcriptions 
des sms du corpus, ainsi  que celle  de leurs contextes gauche et droit. Nous avons donc  pu  &#233;tablir 
les fr&#233;quences d'apparition de tous les syntagmes du corpus et avons retenu  les plus pr&#233;sents. 
Nous avons utilis&#233; les transcriptions afin d'&#233;viter les probl&#232;mes d'instabilit&#233; orthographique.
</p>
<p>315</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>confusion. La  question se pose cependant de savoir quel  syst&#232;me suivre lors de la 
fusion  des caract&#232;res [3333] : maintenir la phon&#233;tisation  ou concat&#233;ner  les  mots non 
phon&#233;tis&#233;s en utilisant des  majuscules pour marquer l'emplacement des espaces 
supprim&#233;s ? Cette question devra &#234;tre tranch&#233;e apr&#232;s enqu&#234;te qualitative ;
</p>
<p>&#8226; Nous distinguons quatre syst&#232;mes graphiques pour &#233;tablir  la r&#232;gle [0932] : les lettres, 
les  chiffres, les  signes de ponctuation  et les  symboles. Cette distinction  est &#233;tablie par 
nous-m&#234;me. La scriptura continua6  peut sembler  excessive. Elle est cependant 
pr&#233;sente dans quelques sms, et appara&#238;t  &#224; quelques reprises dans l'histoire de l'&#233;criture 
(par exemple durant l'Antiquit&#233;). Ainsi nous d&#233;cidons de la maintenir.
</p>
<p>3.3. Leur classement
</p>
<p>Nous avons ordonn&#233; ces r&#232;gles  selon  deux  classements distincts. L'un  d&#233;pendant de 
l'ordonnancement informatique, l'autre prenant en compte l'application du syst&#232;me.
</p>
<p>Le premier classement r&#233;pond &#224;  deux exigences : d'une part classer  les  r&#232;gles  selon leur 
influence sur la  lisibilit&#233; (ce classement est repr&#233;sent&#233; par les deux premiers chiffres du 
code d'une r&#232;gle) ; d'autre part selon  l'ordre dans lequel elles  doivent &#234;tre appliqu&#233;es 
pour ne pas se g&#234;ner mutuellement : par exemple, il  faut formaliser les  dates avant de 
phon&#233;tiser les noms des mois (les  deux derniers chiffres du  code illustrent ce second 
ordre).
</p>
<p>Le second classement, orient&#233; vers l'application finale, envisage deux  types d'utilisation : 
le premier, qualitatif, o&#249; l'utilisateur  doit choisir entre quatre niveaux d'essentialisation 
pr&#233;d&#233;finis, et le second, quantitatif, o&#249; le programme conna&#238;t le seuil  de caract&#232;res  sous 
lequel ramener le texte initial et applique les r&#232;gles jusqu'&#224; y parvenir (ou non).
</p>
<p>3.4. Les quatre niveaux
</p>
<p>Revenons plus en d&#233;tail  sur  les quatre niveaux d'essentialisation  que nous  proposons. 
Chaque niveau permet de d&#233;finir  une s&#233;quence de r&#232;gles &#224; appliquer  pour atteindre un 
certain  degr&#233; d'essentialisation. Nous envisageons d'abord deux exemples produits par 
notre prototype, puis nous les commentons et  d&#233;taillons les choix th&#233;oriques sous-
jacents.
</p>
<p>3.4.1.D&#233;finitions
</p>
<p>Superficiel : ce niveau touche uniquement &#224;  ce que nous jugeons accessoire, aux 
caract&#232;res qui  ne sont l&#224;  que pour fluidifier la  lecture, comme les r&#233;p&#233;titions &#233;motives de 
caract&#232;res (&quot;loooool&quot;), les espaces pr&#233;c&#233;dant certains signes de ponctuation (&quot;Non !&quot;), 
l'utilisation de logogrammes (&quot;vingt-quatre&quot; &gt; &quot;24&quot; ; &quot;et&quot; &quot;&amp;&quot;), la suppression de certains 
mots redondants, par ailleurs souvent absents du langage oral  (&quot;ne&quot; de la n&#233;gation), etc. 
Ce niveau  ne supprime donc que des caract&#232;res que nous pourrions  qualifier de 
s&#233;mantiquement moins pertinents.
</p>
<p>Conventionnel : Il  s'agit d'appliquer  une s&#233;rie de r&#232;gles qui  sont des pratiques 
fr&#233;quentes  de l'&#233;crit (bien  au-del&#224; des seuls sms), ou  des transcriptions de l'oral. Nous 
pensons par exemple aux apocopes de mots fr&#233;quents (&quot;anniv&quot;), &#224;  l'effacement des 
schwas toujours silencieux  (&quot;effacement&quot;), aux abr&#233;viations courantes (&quot;tps&quot;, &quot;ds&quot;, 
</p>
<p>6 Le terme scriptio continua est &#233;galement employ&#233;.
</p>
<p>316</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&quot;qq&quot;...), &#224; l'&#233;lision de certains pronoms sujets, ou  &#224;  leurs simplifications (&quot;zavez vu&quot;, 
&quot;faut y aller&quot;...). Nous commen&#231;ons ici &#224; atteindre plus cons&#233;quemment l'orthographe et 
la  syntaxe, mais  selon  des  pratiques qui, par leur fr&#233;quence dans notre corpus et notre 
propre perception, semblent rapidement d&#233;chiffrables.
</p>
<p>Morpho-syntaxe du sms : Ce niveau se concentre sur des ph&#233;nom&#232;nes  couramment 
trouv&#233;s dans  des  sms, notamment la  phon&#233;tisation de certains phon&#232;mes transcrits par 
plusieurs caract&#232;res, la  contraction  en  squelettes consonantiques  de certaines fins de 
mots, ou de certaines unit&#233;s lexicales  fr&#233;quentes. Nous ne recensons ici  que les 
ph&#233;nom&#232;nes les plus fr&#233;quents afin que nos messages restent les plus compr&#233;hensibles 
possible : en effet nous partons du principe que les  ph&#233;nom&#232;nes les plus  courants seront 
les plus intelligibles.
</p>
<p>Cryptage : On  parle ici de l'application  de toutes les r&#232;gles observ&#233;es dans notre corpus, 
afin de gagner un maximum de caract&#232;res. Il ne s'agit plus de tenter  de conserver un 
minimum de d&#233;codabilit&#233;, le but est la  compression : phon&#233;tisation de toutes les 
syllabes, suppression d'un partie de la ponctuation, suppression des espaces, etc.
</p>
<p>3.4.2.Application
</p>
<p>Les quatre niveaux d'essentialisation que nous avons d&#233;finis  servent &#224; d&#233;gager un 
formalisme. Ils ont  &#233;t&#233; pos&#233;s arbitrairement, puisque seule la d&#233;finition  des niveaux est 
importante. Le but est d'obtenir une description  stricte des attentes et conditions de ces 
niveaux, afin  de choisir les  r&#232;gles qui y  correspondront  le mieux. Quel que soit le nombre 
</p>
<p>Niveau Forme Taille
</p>
<p>Corpus Hi tite puce,g  pens&#233; a tf&#232;r 1pti  sign 2vi,tu m'mank grav.pq pa svoir 2m1?al&#233; pass 1bonnuit 90
</p>
<p>Forme standard
Hi petite puce, j'ai  pens&#233; &#224;  te faire un  petit signe de vie, 
tu me manques grave. Pourquoi  pas se voir  demain  ? 
Allez passe une bonne nuit
</p>
<p>138
</p>
<p>Superficiel
Hi petite puce,j'ai pens&#233; &#224;  te faire1petit signe de vie,tu 
me manquegrave.Pourquoi  pas se voir demain?Allez 
passe1bonne nuit
</p>
<p>124
</p>
<p>Conventionnel
Hi  ptit puc,jai pens&#233; &#224; tfair1ptit  signde vie,tu 
mmanqugrav.Pourquoi pas svoir  demain?Allez 
pass1bonnnuit
</p>
<p>105
</p>
<p>Morpho-syntaxe 
du sms
</p>
<p>hi  ptit puc G penC &#224; t9&#232;r1pttsign2vi tmmankgrav 
pourkoi pasvoir2m1al&#233; pas1bOn n8 80
</p>
<p>Cryptage hiptitpucGpenC&#224;t9&#232;r1pttsign2vitmemankgravpourkoipasevoir2m1al&#233;pas1bOnn8 71
</p>
<p>TABLEAU 2 - Essentialisation d'un message illustrant la proximit&#233;
</p>
<p>317</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de niveaux d&#233;finis, l'important r&#233;side dans la gradation  continue entre ceux-ci, tant du 
point de vue de l'intercompr&#233;hension que de la compression.
</p>
<p>Deux exemples permettent d'illustrer les r&#233;sultats de chaque niveau. Le premier 
exemple7  est un texte illustrant l'imm&#233;diatet&#233; (cf. TABLEAU 2), le second8  exposant la 
distance9 (cf. TABLEAU 3).
</p>
<p>Niveau Forme Taille
</p>
<p>Forme standard
Je rappelle que les banques ont pay&#233; plus &#224; l'&#201;tat belge 
que ce qu'on  leur a donn&#233;. Les garanties  sur Dexia ont 
rapport&#233; bien  plus que le milliard qui a &#233;t&#233; mis dans 
Dexia. Tout a &#233;t&#233; payant.
</p>
<p>191
</p>
<p>Superficiel
Je rapelle que lebanques ont pay&#233; plus &#224; l'&#201;tat belge 
que ce qu'on  leur a don&#233;.Les garanties  sur Dexia ont 
rapport&#233; bien  plus que le milliard qui a &#233;t&#233; mis dans 
Dexia.Tout a &#233;t&#233; payant.
</p>
<p>185
</p>
<p>Conventionnel
Jrapell  qulebanqus ont pay&#233; plus &#224;  l&#201;tat belgque cquon 
leur a don&#233; Les garanties sur Dexia ont rapport&#233; bien 
plus que lmilliard qui  a  &#233;t&#233; mis  ds Dexia.Tout a  &#233;t&#233; 
payant.
</p>
<p>169
</p>
<p>Morpho-syntaxe 
du sms
</p>
<p>jrap&#232;l  kl&#233;banks on p&#232;y&#233; + &#224;   l&#233;ta  b&#232;lj ke ce kon leur  a 
dOn&#233; l&#233; garantisur d&#232;xia on rapOrT bi1 + ke lmiliar ki  a 
&#233;T mi ds d&#232;xia tout a &#233;T p&#232;yan
</p>
<p>144
</p>
<p>Cryptage
j r a p &#232; l k e l &#233; b a n k o n p &#232; y &#233;
+&#224;l&#233;tab&#232;ljkecekoleuradOn&#233;.l&#233;garantisurd&#232;xiaonrapOrT
bi1+klmiliarkia&#233;Tmidand&#232;xiatouta&#233;Tp&#232;yan
</p>
<p>110
</p>
<p>TABLEAU 3 - Essentialisation d'un message illustrant la distance
</p>
<p>3.4.3.Analyse des r&#233;sultats
</p>
<p>Le niveau superficiel  enregistre un taux de r&#233;duction de 14% pour  le premier exemple, 
et de seulement 3% pour le second. Le taux  moyen  de compression  de ce niveau  se situe 
&#224; hauteur de 9%. Les textes  produits ne sont pas tr&#232;s r&#233;duits, mais restent 
compr&#233;hensibles : la  forme des mots n'est pas  atteinte. Il  reste quelques erreurs 
produites par notre prototype, notamment &quot;lebanques&quot;, qui  aurait d&#251; rester &quot;les 
banques&quot;, et la m&#234;me chose pour  &quot;maquegrave&quot;. Une assez grande diff&#233;rence que l'on 
</p>
<p>7 Il s'agit d'un sms issus du corpus.
</p>
<p>8 (Libre Belgique, 2011 : 5)
</p>
<p>9  L'opposition  imm&#233;diat  versus  distance  est  propos&#233;e par  (Koch et &#214;sterreicher, 2001). La 
distance communicative d&#233;note  le  degr&#233; d'implication (imm&#233;diat) ou  de d&#233;tachement (distance) 
des locuteurs dans le discours.
</p>
<p>318</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>trouve entre les  taux de compression des deux  messages  est probablement due au  fait 
que le premier message est du m&#234;me type que notre corpus d'entra&#238;nement.
</p>
<p>Au  niveau  conventionnel, le sms obtient un taux  de r&#233;duction de 24% et l'extrait de 
journal  10,5%. &#192;  nouveau, l'&#233;cart est assez large entre les deux. Le taux moyen se situe &#224; 
18%. Par  rapport au premier  niveau, la  progression  est assez marqu&#233;e du  point de vue de 
la  compression. En ce qui concerne la compr&#233;hension, le texte devient d&#233;j&#224; plus 
herm&#233;tique, principalement lorsque des schwas  ont &#233;t&#233; supprim&#233;s, avec l'espace qui  les 
suivait. Cette agglutination  de mots, si elle permet de gagner des caract&#232;res, g&#234;ne le 
d&#233;codage du  texte. Cependant, si  nous  regardons le troisi&#232;me niveau, l'&#233;cart perceptif 
entre celui-ci  et le deuxi&#232;me qui nous occupe semble plus important qu'entre les deux 
premiers niveaux. Notre impression est  donc que la gradation n'est pas  continue entre 
les trois premiers niveaux.
</p>
<p>Les taux de r&#233;duction  des deux exemples du  niveau morpho-syntaxe du sms sont 
respectivement de 42% et 25%. Le taux  moyen de ce troisi&#232;me niveau est de 34%. Les 
deux textes  reprennent certaines caract&#233;ristiques des sms et leur aspect est similaire &#224; 
l'&#233;crit sms. Nous pouvons  d'ailleurs  appr&#233;cier cette ressemblance en comparant le niveau 
3 du premier  exemple &#224; la version originale de ce sms dans notre corpus. Il  y a des 
diff&#233;rences, (rappelons que nous ne cherchons pas  &#224; produire de l'e-sms) mais  nous 
devons aussi  garder &#224; l'esprit que les  possibilit&#233;s de combinaison des  r&#232;gles  sont tr&#232;s 
nombreuses, et que notre syst&#232;me est d&#233;terministe : il  produira  toujours la m&#234;me sortie 
pour un m&#234;me texte. &#192;  l'inverse, un locuteur  n'emploiera pas forc&#233;ment les m&#234;mes 
techniques d'un message &#224; l'autre.
</p>
<p>Les deux taux de r&#233;duction  du  niveau cryptage convergent assez fort, puisque le 
premier texte atteint un  taux de r&#233;duction  de 49% et le second de 43%. Le taux moyen 
est de 44%. La compression  est excellente, puisque pr&#232;s  de la moiti&#233; du  texte a &#233;t&#233; 
supprim&#233;e. La compr&#233;hension est  par contre bien  plus d&#233;licate. Il  semblerait  qu'il 
manque trop de caract&#232;res pour  que la  lecture reste fluide. En  effet, l'absence d'espace 
emp&#234;che le lecteur de d&#233;limiter les unit&#233;s lexicales. Les deux textes produits ressemblent 
&#224; une suite continue de phon&#232;mes, &#224; l'instar de ce qu'est le signal sonore.
</p>
<p>3.5. &#201;valuation
</p>
<p>&#201;tant donn&#233; que nous sommes &#224;  une &#233;tape pr&#233;liminaire de notre recherche, nous 
n'avons pas encore pu  r&#233;aliser d'&#233;valuation  qualitative10  de ce travail. Nous  proposons 
donc une &#233;valuation  en deux parties : une &#233;valuation quantitative d'une part, et le relev&#233; 
manuel des limites de notre syst&#232;me, d'autre part.
</p>
<p>3.5.1.&#201;valuation quantitative
</p>
<p>Pour &#233;tablir les taux moyens de compression, nous avons utilis&#233; un corpus de test 
compos&#233; de cent textes courts ou  extraits r&#233;partis  comme suit : cinquante transcriptions 
de sms tir&#233;es de notre corpus, quarante extraits  de journaux et dix  extraits  litt&#233;raires11. 
Nous avons mesur&#233; le taux moyen  de compression produit par les  quatre niveaux 
mentionn&#233;s ci-dessus sur  l'ensemble de notre corpus de test. Il  nous est impossible de 
mesurer  la  divergence de nos r&#233;sultats par rapport &#224; une r&#233;f&#233;rence, celle-ci  n'existant 
</p>
<p>10 Validation des choix th&#233;oriques par un &#233;chantillon de testeurs humains.
</p>
<p>11 De dix auteurs diff&#233;rents.
</p>
<p>319</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pas. &#192; l'inverse du  r&#233;sum&#233; automatique, nous ne pouvons essentialiser manuellement, ni 
comparer les r&#233;sultats d'un syst&#232;me &#233;quivalent. 
</p>
<p>Au  mieux, dans le cas des 50 sms, aurions-nous  pu comparer nos taux  de compression &#224; 
ceux des locuteurs. Cependant, la  variabilit&#233; de l'&#233;crit sms nous emp&#234;cherait de savoir  &#224; 
quel  niveau  d'essentialisation  comparer  le sms r&#233;el. Et un taux moyen ne serait pas plus 
&#233;clairant. Nous devons donc nous limiter  &#224;  une observation des taux moyens de chaque 
niveau. Le but est d'&#233;valuer la  gradation  de la  compression  entre les quatre niveaux 
propos&#233;s.
</p>
<p>Les chiffres ainsi  obtenus viennent, d'une certaine fa&#231;on appuyer notre premi&#232;re 
impression : la  progression  n'est  pas continue entre les  quatre niveaux  d'essentialisation 
tels qu'ils sont d&#233;finis actuellement. Nous passons en effet de 9% &#224;  14%  puis &#224;  34% pour 
atteindre 44% au  dernier niveau. Le deuxi&#232;me niveau  semble donc ne pas &#234;tre un bon 
interm&#233;diaire entre le premier et le troisi&#232;me ; ou  alors  ceux-ci  sont-ils respectivement 
trop conservateur et trop destructeur. Nous devrons attendre d'avoir  obtenu  les  r&#233;sultats 
d'une &#233;valuation humaine pour le d&#233;terminer et corriger ces premi&#232;res propositions.
</p>
<p>Cependant, malgr&#233; certains soucis de gradation et quelques probl&#232;mes 
d'impl&#233;mentation, nous obtenons assez rapidement des taux de r&#233;duction int&#233;ressant. 
Le dernier  niveau peut aller jusqu'&#224;  r&#233;duire de moiti&#233; la taille du texte initial, et le 
deuxi&#232;me s'approche de 15% de r&#233;duction. Consid&#233;rant que notre but  est de transmettre 
un  texte maintenant toutes les nuances du texte d'origine et g&#233;n&#233;rant le moins 
d'ambigu&#239;t&#233; possible, ces  premiers r&#233;sultats sont assez encourageants, m&#234;me s'ils ne 
nous permettent pas encore d'&#233;valuer objectivement l'&#233;volution de la lisibilit&#233; des textes 
produits.
</p>
<p>3.5.2.Limites du syst&#232;me
</p>
<p>Il  convient d'&#234;tre assez critique au regard de nos premiers r&#233;sultats. Nous rencontrons 
en  effet deux  types de probl&#232;mes avec notre premier  prototype d'essentialiseur : le 
premier se situe au  niveau  de l'algorithme g&#233;n&#233;ral d'application  des r&#232;gles, l'autre au 
niveau de certaines r&#232;gles elles-m&#234;mes.
</p>
<p>Tout d'abord, bien que nous en ayons conscience et ayons tent&#233; d'&#233;viter  ce type 
d'inconv&#233;nients, certaines r&#232;gles g&#234;nent l'application  des suivantes, voire annulent leurs 
r&#233;sultats. Par exemple, la r&#232;gle [2031] supprime une s&#233;rie de signes de ponctuation qui 
pourraient se retrouver dans des adresses web pr&#233;alablement r&#233;duites par la  r&#232;gle 
[0302]. Ou encore, si  la  r&#232;gle [0504], qui  remplace, notamment, les nombres  &#233;crits en 
toutes lettres  par leur  &#233;quivalent en  chiffres arabes ne s'applique pas correctement, 
toutes les  autres r&#232;gles  qui  s'appuient sur des  chiffres seront induites  en erreur. Ensuite, 
certaines r&#232;gles qui  semblent &#233;videntes pour l'esprit humain ne sont pas toujours les 
plus simples &#224;  formaliser pour  la machine. Il en  va ainsi de la r&#232;gle [0504], que nous 
avons d&#233;j&#224; cit&#233;e : des trente-quatre, c'est elle qui fut la  plus difficile &#224;  impl&#233;menter, et &#224; 
optimiser. Il  existe en  effet une multitude de configurations possibles  pour  l'&#233;nonciation 
de nombres, et  nous n'avons consid&#233;r&#233; que les  plus fr&#233;quentes, partant du double 
constat que nous pourrons am&#233;liorer  cette r&#232;gle lors des  prochaines &#233;tapes de notre 
r&#233;flexion et qu'il  y  aura probablement fort peu  de cas o&#249;  les utilisateurs entreront des 
nombres en toutes lettres.
</p>
<p>Mais le principal  probl&#232;me que nous rencontrons reste la variabilit&#233; de la langue : 
comme nous l'avons  d&#233;j&#224; pr&#233;cis&#233; ci-dessus, le fran&#231;ais, comme d'autres langues 
naturelles, offre d'innombrables possibilit&#233;s de variations que nous ne pourrons pas 
</p>
<p>320</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>toutes envisager, or certaines d'entre elles am&#232;neront notre syst&#232;me &#224;  commettre des 
erreurs et &#224; manquer son objectif (par  exemple les dates : nous tentons de les formaliser, 
mais un utilisateur  pour aussi  bien entrer  &quot;le 2 juillet 1989&quot; que &quot;2 du 7 89&quot; ou  encore 
&quot;7-2-89&quot;). Ce premier prototype doit donc encore &#234;tre am&#233;lior&#233;.
</p>
<p>4. Conclusions
</p>
<p>La premi&#232;re &#233;tape de cette recherche ouvre de tr&#232;s nombreuses perspectives 
d'optimisation. D'un point de vue technique, pour corriger  les probl&#232;mes mentionn&#233;s ci-
dessus, nous envisageons notamment de marquer certains caract&#232;res, de sorte qu'ils ne 
puissent plus &#234;tre modifi&#233;s. Nous continuons par ailleurs &#224; r&#233;fl&#233;chir  &#224;  un  meilleur 
algorithme de conversion  de nombres. Au  niveau  du syst&#232;me lui-m&#234;me, d'autres r&#232;gles 
pourraient &#234;tre ajout&#233;es, s'appuyant &#233;ventuellement sur  d'autres types de corpus qu'un 
corpus de sms, pour y  observer  d'autres m&#233;canismes. Enfin  les quatre niveaux que nous 
avons pr&#233;sent&#233;s devront  &#233;galement &#234;tre affin&#233;s, et de nouveaux  pourraient &#234;tre ajout&#233;s 
au syst&#232;me.
</p>
<p>Une &#233;valuation  qualitative effectu&#233;e par  des locuteurs nous  permettra d'am&#233;liorer notre 
estimation de la  lisibilit&#233; des textes essentialis&#233;s, &#233;ventuellement de repenser 
l'organisation  des r&#232;gles ou des niveaux du  syst&#232;me actuel, mais &#233;galement de valider 
nos propositions quant  &#224; l'essentialisation  en  g&#233;n&#233;ral. Il  reste donc de nombreuses pistes 
de r&#233;flexion, et nous n'apportons ici que nos premi&#232;res propositions.
</p>
<p>Si  le champ de recherche ici  pr&#233;sent&#233; peut sembler  restreint ou  limit&#233; &#224;  quelques 
applications  ludiques, nous affirmons qu'il  n'en est rien. Il  ouvre d'une part la voie &#224; une 
approche originale de l'&#233;tude des ph&#233;nom&#232;nes de contraction pr&#233;sents dans les sms en 
ce qu'il  postule leur application formelle. D'autre part, il  propose une nouvelle m&#233;thode 
de compression  textuelle, pertinente notamment dans le cadre de sites de microblogging 
comme twitter&#174; ou  dans d'autres situations de communication textuelle soumises  &#224; une 
forte contrainte d'espace (affichage de messages d'alerte, de notifications). Mais il 
reconna&#238;t surtout l'existence d'un nouveau  mode de communication bref  et informel, et 
propose une aide &#224; son utilisation.
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224;  remercier  C&#233;drick Fairon  qui nous a souffl&#233; l'id&#233;e de cette recherche. 
Nous souhaitons que Louise-Am&#233;lie Cougnon soit &#233;galement reconnue pour son 
ind&#233;fectible soutien, sa  disponibilit&#233; et  son  aide pr&#233;cieuse. Enfin merci &#224;  MM Beaufort, 
Bouraoui et Watrin pour leurs conseils avis&#233;s.
</p>
<p>R&#233;f&#233;rences
</p>
<p>140it, 2012-03-20 http://140it.com.
</p>
<p>2011-11-05, La Libre Belgique, Bruxelles.
</p>
<p>BEAUFORT Richard, COUGNON Louise-Am&#233;lie, FAIRON C&#233;drick et ROEKHAUT Sophie, 
2010, &quot;Une approche hybride traduction/correction pour la  normalisation des sms&quot;, in 
TALN, Montr&#233;al.
</p>
<p>COTTIN Florent, 2011, Le &quot;pourrisseur de texte&quot; du RALI, Universit&#233; de Montr&#233;al.
</p>
<p>321</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>COUGNON Louise-Am&#233;lie et FRAN&#199;OIS Thomas, 2010, &#201;tudier l'&#233;crit sms. Un objectif du 
projet sms4science, Linguistik Online.
</p>
<p>COUGNON Louise-Am&#233;lie et LEDEGEN Gudrun, 2008, &quot;c'est &#233;crire comme je parle. Une 
&#233;tude comparatiste de vari&#233;t&#233;s de fran&#231;ais dans l'&#233;crit sms&quot;, Actes du Congr&#232;s annuel de 
l'AFLS, Oxford.
</p>
<p>FAIRON C., KLEIN J. et PAUMIER S., 2006a, sms pour la science. Corpus de  30.000 sms et 
logiciel de consultation, Presses universitaires de Louvain, Louvain-la-Neuve.
</p>
<p>FAIRON C., KLEIN J. et PAUMIER S., 2006b, Le  langage sms, &#233;tude d'un corpus 
informatis&#233; &#224; partir de  l'enqu&#234;te  &quot;fa&#238;tes  don de vos  sms &#224; la science&quot;, Cental  (Cahier du 
Cental), Louvain-la-Neuve.
</p>
<p>GLOR HOWARD Paul, 1993, The  Design and Analysis of Efficient Lossless Data 
Compression Systems, Brown University, Providence.
</p>
<p>International Organisation for Standardization, 2012-03-20 www.iso.org.
</p>
<p>KOCH Peter  et &#214;STERREICHER Wulf, 2001, &#171; Gesprochene Sprache und geschriebene 
Sprache &#187;, in Lexikon der romanistischen Linguistik, G&#252;nter  Holtus, T&#252;bingen, pp. 
584-627.
</p>
<p>LUHN H.P., 1958, &quot;The Automatic Creation of Literature Abstracts&quot;, in IBM Journal of 
Research and Development, pp. 159-165.
</p>
<p>MINEL Jean-Luc HDR, 2004, Le r&#233;sum&#233;  automatique de textes : solution et 
perspectives, Sorbonne, Paris.
</p>
<p>TLFi - Tr&#233;sor de la Langue Fran&#231;aise informatis&#233;, 2012-03-24, www.cnrtl.fr/definition/.
</p>
<p>YOUSFI-MONOD Mehdi, 2007, Compression automatique  ou semi-automatique de textes 
par &#233;lagage des constituants effa&#231;ables : une  approche  interactive et ind&#233;pendante des 
corpus, Th&#232;se de doctorat &#224; l'Universit&#233; de Montpellier II, Montpellier.
</p>
<p>YVON Fran&#231;ois, 2008, R&#233;orthographier des sms, LIMSI, Paris.
</p>
<p>322</p>

</div></div>
</body></html>