<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Construction automatique d&#8217;un lexique de modifieurs de polarit&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 123&#8211;136,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Construction automatique d&#8217;un lexique de modifieurs de
polarit&#233;
</p>
<p>No&#233;mi Boubel
UCLouvain, Cental, Place Blaise Pascal, 1, B-1348 Louvain-la-Neuve, Belgique
noemi.boubel@uclouvain.be
</p>
<p>R&#201;SUM&#201;
La recherche pr&#233;sent&#233;e 1 s&#8217;inscrit dans le domaine de la fouille d&#8217;opinion, domaine qui
consiste principalement &#224; d&#233;terminer la polarit&#233; d&#8217;un texte ou d&#8217;une phrase. Dans cette
optique, le contexte autour d&#8217;un mot polaris&#233; joue un r&#244;le essentiel, car il peut modifier la
polarit&#233; initiale de ce terme. Nous avons choisi d&#8217;approfondir cette question et de d&#233;tecter
pr&#233;cis&#233;ment ces modifieurs de polarit&#233;. Une &#233;tude exploratoire, d&#233;crite dans des travaux
ant&#233;rieurs, nous a permis d&#8217;extraire automatiquement des adverbes qui jouent un r&#244;le sur la
polarit&#233; des adjectifs auxquels ils sont associ&#233;s et de pr&#233;ciser leur impact. Nous avons ensuite
am&#233;lior&#233; le syst&#232;me d&#8217;extraction afin de construire automatiquement un lexique de structures
lexico-syntaxiques modifiantes associ&#233;es au type d&#8217;impact qu&#8217;elles ont sur un terme polaris&#233;.
Nous pr&#233;sentons ici le fonctionnement du syst&#232;me actuel ainsi que l&#8217;&#233;valuation du lexique obtenu.
</p>
<p>ABSTRACT
Automatic Construction of a Contextual Valence Shifters Lexicon
</p>
<p>The research presented in this paper takes place in the field of Opinion Mining, which is mainly
devoted to assigning a positive or negative label to a text or a sentence. The context of a highly
polarized word plays an essential role, as it can modify its original polarity. The present work
addresses this issue and focuses on the detection of polarity shifters. In a previous study, we have
automatically extracted adverbs impacting the polarity of the adjectives they are associated to
and qualified their influence. The extraction system has then been improved to automatically
build a lexicon of contextual valence shifters. This lexicon contains lexico-syntactic patterns
combined with the type of influence they have on the valence of the polarized item. The purpose
of this paper is to show how the current system works and to present the evaluation of the
created lexicon.
</p>
<p>MOTS-CL&#201;S : fouille d&#8217;opinion, modifieurs de valence affective, modifieurs de polarit&#233;.
</p>
<p>KEYWORDS: opinion mining, contextual valence shifters.
</p>
<p>1. avec le soutien de Wallonie-Bruxelles International
</p>
<p>123</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction et &#233;tat de l&#8217;art
</p>
<p>Le champ de recherche de la fouille d&#8217;opinion regroupe des t&#226;ches diverses, notamment celle
de distinguer le positif du n&#233;gatif et de d&#233;finir de cette fa&#231;on la polarit&#233; (ou valence) d&#8217;un texte.
D&#8217;un point de vue terminologique, nous pr&#233;f&#233;rerons le terme polarit&#233; au terme anglais valence
afin d&#8217;&#233;viter l&#8217;ambiguit&#233; avec le concept fran&#231;ais de valence en syntaxe. Ces derni&#232;res ann&#233;es,
les recherches dans ce domaine se sont fortement d&#233;velopp&#233;es, comme on peut le voir dans la
vue d&#8217;ensemble donn&#233;e par (Pang et Lee, 2008). Les t&#226;ches &#224; accomplir se sont diversifi&#233;es et
sp&#233;cialis&#233;es, selon les contraintes industrielles ou le niveau de pr&#233;cision voulu.
Il est progressivement apparu qu&#8217;une des entraves importantes &#224; l&#8217;efficacit&#233; des syst&#232;mes de
fouille d&#8217;opinion &#233;tait la prise en compte du contexte. En effet, la pr&#233;sence d&#8217;un terme n&#233;gatif
dans une phrase, par exemple, ne signifie pas forc&#233;ment que la phrase est n&#233;gative. Ce terme peut
effectivement &#234;tre ni&#233;, temp&#233;r&#233;, int&#233;gr&#233; dans un contexte hypoth&#233;tique, etc. Ainsi, de nombreux
ph&#233;nom&#232;nes contextuels ont un impact sur un terme polaris&#233; dans un texte. Notre objectif ici est
d&#8217;identifier et de d&#233;crire pr&#233;cis&#233;ment ces ph&#233;nom&#232;nes.
</p>
<p>1.1 Etat de l&#8217;art
</p>
<p>Dans le domaine de la fouille d&#8217;opinion, rares sont les travaux dont le sujet central d&#8217;&#233;tude
traite des ph&#233;nom&#232;nes qui ont un impact sur la polarit&#233; d&#8217;un terme. Zaenen et Polanyi (2004)
tentent, dans cette optique, de d&#233;crire tous les cas o&#249; le contexte modifie un terme polaris&#233;. Leur
&#233;tude, en anglais, postule l&#8217;existence d&#8217;&#233;l&#233;ments contextuels appel&#233;s contextual valence shifters
qui modifient la valeur initiale d&#8217;un terme. Leur hypoth&#232;se de travail est que la valence de termes
polaris&#233;s peut &#234;tre renforc&#233;e ou affaiblie par la pr&#233;sence d&#8217;autres items lexicaux, par la structure
du discours et le type de texte, ou enfin par des facteurs culturels.
</p>
<p>Sur leur impulsion, des travaux de plus en plus nombreux, introduisent dans des syst&#232;mes de
classification d&#8217;opinion, une certaine prise en compte du contexte, plus ou moins compl&#232;te et riche
(Kennedy et Inkpen, 2006; Musat et Trausan-Matu, 2010; Taboada et al., 2011). Les ressources
utilis&#233;es (comme des listes d&#8217;adverbes) sont g&#233;n&#233;ralement d&#233;finies intuitivement. La terminologie
anglophone qui traite de ces concepts relativement r&#233;cents est assez diverse et peu stabilis&#233;e.
Plusieurs notions sont utilis&#233;es, certaines se compl&#232;tent ou se recouvrent. Ainsi, Zaenen et Polanyi
(2004) traitent des concepts de contextual valence shifter, ou modifier et plus pr&#233;cis&#233;ment de la
negation (qui inverse la polarit&#233;) et des intensifiers (qui l&#8217;intensifient ou l&#8217;att&#233;nuent). Kennedy et
Inkpen (2006) pr&#233;cisent ensuite cette terminologie et divisent les modifieurs en trois types : la
negation, les intensifiers (qui ont la seule facult&#233; d&#8217;intensification) et les diminishers (qui att&#233;nuent
la force d&#8217;un terme polaris&#233;). Signalons &#233;galement le concept d&#8217;intensifiers d&#233;fini par (Quirk
et al., 1985) comme des &#233;l&#233;ments qui ont un impact sur l&#8217;intensit&#233; de la polarit&#233; d&#8217;un terme.
Ils se classent en deux grandes cat&#233;gories : les amplifiers qui amplifient l&#8217;intensit&#233; s&#233;mantique
du voisinnage lexical (very), et les downtoners, qui att&#233;nuent cette intensit&#233; (slightly). De plus,
au-del&#224; de l&#8217;id&#233;e d&#8217;intensit&#233;, sont d&#233;velopp&#233;s &#233;galement les concepts de polarity influencers
(Wilson et al., 2009), non veridical context (Zwarts, 1995; Giannakidou, 1998) ou irrealis markers
(Taboada et al., 2011).
</p>
<p>Cette terminologie n&#8217;est pas, &#224; notre connaissance, d&#233;velopp&#233;e dans les recherches francophones.
Vernier et al. (2009) et Petrakis et al. (2009) prennent en compte, dans certains cas, le contexte
autour de termes polaris&#233;s ou la combinaison de plusieurs termes polaris&#233;s, mais ne reprennent
</p>
<p>124</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pas le concept de contextual valence shifter tel qu&#8217;il est d&#233;fini plus haut. Nous parlerons ici de
modifieur de polarit&#233; (aussi appel&#233;s modifieur de valence affective), et des notions d&#8217;intensifieurs,
att&#233;nuateurs, et inverseurs, &#224; la suite des travaux de (Zaenen et Polanyi, 2004) et (Kennedy et
Inkpen, 2006).
</p>
<p>1.2 Objectifs
</p>
<p>Sur la base des constatations ci-dessus, notre objectif est d&#8217;extraire automatiquement, &#224; partir
d&#8217;un corpus, des ph&#233;nom&#232;nes contextuels qui ont un impact sur des termes polaris&#233;s, autrement
dit construire de fa&#231;on automatique une liste de modifieurs &#224; partir d&#8217;un corpus. Nous nous
limitons ici &#224; l&#8217;&#233;tude de toutes structures (ou patrons) lexico-syntaxiques dans lesquelles sont
int&#233;gr&#233;s des termes polaris&#233;s et qui ont un impact sur la polarit&#233; d&#8217;un terme. Il s&#8217;agira par exemple
du syntagme pr&#233;positionnel qui associe la pr&#233;position sans &#224; un nom, patron lexico-syntaxique qui
inverse la polarit&#233; du nom. Nos travaux ant&#233;rieurs ont conduit &#224; la cr&#233;ation d&#8217;une m&#233;thodologie,
qui rep&#232;re des structures de ce type susceptibles d&#8217;&#234;tre des modifieurs de polarit&#233;.
Cette m&#233;thodologie, appliqu&#233;e &#224; l&#8217;extraction d&#8217;adverbes (plus pr&#233;cis&#233;ment de syntagmes adjecti-
vaux modifi&#233;s par des adverbes), est d&#233;crite dans (Boubel et Bestgen, 2011). Les r&#233;sultats de cette
&#233;tude exploratoire permettent de supposer que certaines caract&#233;ristiques statistiques peuvent
pr&#233;dire des caract&#233;ristiques s&#233;mantiques (et pr&#233;dire donc en particulier l&#8217;impact s&#233;mantique
du modifieur sur un terme polaris&#233;). Une analyse linguistique des adverbes extraits, pr&#233;sent&#233;e
dans (Boubel, 2011) a ensuite &#233;t&#233; men&#233;e afin de v&#233;rifier cette hypoth&#232;se. Cette analyse a mis
en &#233;vidence trois types d&#8217;adverbes partageant des caract&#233;ristiques statistiques communes. Il est
apparu que les adverbes de chaque cat&#233;gorie remplissent &#233;galement un r&#244;le s&#233;mantique similaire.
Trois cas ont ainsi &#233;t&#233; d&#233;gag&#233;s 2 :
&#8211; le modifieur intensifie le terme polaris&#233; auquel il est associ&#233; (&#171; (. . . ) le film est absolument
</p>
<p>jubilatoire. &#187;) ;
&#8211; le modifieur inverse ou att&#233;nue la polarit&#233; du terme (&#171; C&#8217;est absurde, peu cr&#233;dible, inint&#233;ressant
</p>
<p>(...). &#187;) ;
&#8211; le modifieur apparait dans une structure &#233;valuative plus large, comme une comparaison ou une
</p>
<p>concession, et met souvent en relation plusieurs termes polaris&#233;s (&#171; On l&#8217;e&#251;t aim&#233; moins glac&#233;,
plus fi&#233;vreux, plus emport&#233;. &#187;) ; ce dernier cas se distingue des pr&#233;c&#233;dents car le modifieur n&#8217;a
pas un impact direct sur un terme pr&#233;cis.
</p>
<p>Notre objectif ici est d&#8217;am&#233;liorer et de perfectionner la m&#233;thodologie d&#8217;extraction sur deux points :
</p>
<p>1. D&#233;passer le cadre des adverbes : notre premi&#232;re &#233;tude a d&#233;montr&#233; la pertinence des
adverbes comme modifieurs potentiels ; nous cherchons maintenant &#224; d&#233;terminer dans
quelle mesure d&#8217;autres cat&#233;gories syntaxiques peuvent &#233;galement &#234;tre modifiantes. Pour
cela, nous avons adapt&#233; le syst&#232;me &#224; la d&#233;tection de toutes relations de d&#233;pendance
syntaxique &#233;ventuellement modifiantes.
</p>
<p>2. Automatiser le classement des modifieurs : la m&#233;thodologie d&#8217;extraction ne d&#233;finit pas, &#224;
l&#8217;origine, la nature du modifieur (son impact sur le terme polaris&#233;). Nous avons automatis&#233;,
dans notre syst&#232;me actuel, le classement des modifieurs dans une des trois cat&#233;gories
d&#233;finies plus haut.
</p>
<p>2. Cette cat&#233;gorisation pourra &#234;tre am&#233;lior&#233;e ou modifi&#233;e selon nos diff&#233;rentes investigations dans le domaine et
notamment selon les r&#233;sultats obtenus dans cette &#233;tude.
</p>
<p>125</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;outil fournit donc maintenant en sortie une liste de structures lexico-syntaxiques modifiantes
class&#233;es en trois groupes. L&#8217;objectif principal de l&#8217;article est d&#8217;&#233;valuer la pertinence des r&#233;sultats
obtenus, et la performance du syst&#232;me. L&#8217;&#233;valuation manuelle et syst&#233;matique effectu&#233;e nous
permet &#233;galement de juger de la pertinence de notre cat&#233;gorisation de modifieurs et de mettre
en lumi&#232;re d&#8217;autres ph&#233;nom&#232;nes contextuels int&#233;ressants.
</p>
<p>Dans la suite de cet article, nous d&#233;crivons l&#8217;approche adopt&#233;e et la m&#233;thodologie propos&#233;e,
avant d&#8217;&#233;valuer les r&#233;sultats et de conclure.
</p>
<p>2 M&#233;thodologie propos&#233;e
</p>
<p>La m&#233;thodologie d&#8217;extraction a &#233;t&#233; d&#233;velopp&#233;e en collaboration avec Yves Bestgen et est d&#233;crite
en d&#233;tail dans (Boubel et Bestgen, 2011). Nous rappelons ici les grandes lignes de l&#8217;approche.
Nous expliquons ensuite plus en d&#233;tail l&#8217;automatisation du classement des modifieurs gr&#226;ce &#224;
l&#8217;ajout de r&#232;gles bas&#233;es sur les r&#233;sultats statistiques.
</p>
<p>2.1 Approche
</p>
<p>Nous nous basons sur deux ressources : un corpus contenant des &#233;nonc&#233;s dont on conna&#238;t la
polarit&#233;, et un lexique de termes positifs ou n&#233;gatifs. L&#8217;id&#233;e de d&#233;part de notre approche est de
s&#8217;int&#233;resser au contexte linguistique des termes issus du lexique. En effet, on peut supposer que
l&#8217;impact du contexte sera diff&#233;rent selon qu&#8217;il porte sur un terme positif ou n&#233;gatif : (1) dans un
texte n&#233;gatif, (2) dans un texte positif ou (3) dans un texte pr&#233;sentant une opinion mitig&#233;e. Nous
nous limitons &#224; l&#8217;&#233;tude de structures lexico-syntaxiques, et &#233;tudions en cons&#233;quence les relations
de d&#233;pendance syntaxique mettant en jeu un terme polaris&#233;. L&#8217;objectif est de rendre compte, gr&#226;ce
&#224; des techniques statistiques, de l&#8217;influence du contexte sur la polarit&#233; d&#8217;un terme et de d&#233;gager
les contextes lexico-syntaxiques qui induisent toujours le m&#234;me impact.
</p>
<p>2.2 Ressources et outils utilis&#233;s
</p>
<p>Le corpus utilis&#233; est constitu&#233; d&#8217;extraits de critiques de films issus du site Allocin&#233; 3. Ce site
rassemble, pour un m&#234;me film, de brefs extraits (pouvant aller d&#8217;un syntagme &#224; quelques phrases)
d&#8217;articles provenant de diff&#233;rents journaux donnant une opinion sur le film. Ces extraits sont
class&#233;s selon la teneure de l&#8217;opinion sur une &#233;chelle de 1 &#224; 5 : les avis tr&#232;s n&#233;gatifs ont la note de
1, et les avis tr&#232;s positifs la note de 5. Le corpus contient 77561 critiques et environ 2 millions de
mots.
</p>
<p>Le lexique que nous avons utilis&#233; (lexique classant des termes selon leur polarit&#233;) a &#233;t&#233; constitu&#233;
automatiquement gr&#226;ce &#224; la m&#233;thode de (Vincze et Bestgen, 2011). Cette m&#233;thode permet de
construire un lexique de polarit&#233; adapt&#233; &#224; un domaine pr&#233;cis en se basant sur un corpus de
textes traitant du domaine voulu et sur une liste de mots dont la polarit&#233; a &#233;t&#233; d&#233;termin&#233;e
en demandant &#224; des personnes de les juger sur un &#233;chelle allant de 1 &#224; 7. Le lexique &#224; notre
disposition a donc &#233;t&#233; cr&#233;&#233; sur la base de notre corpus de critiques de films et est donc adapt&#233;
</p>
<p>3. http ://www.allocine.fr/
</p>
<p>126</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>au vocabulaire du cin&#233;ma (&quot;nanar&quot; est class&#233; dans les termes n&#233;gatifs, par exemple). Pour un
meilleur r&#233;sultat, nous n&#8217;avons retenu, du lexique de d&#233;part, que les termes positifs et n&#233;gatifs
les plus extr&#234;mes et avons ensuite fait un bref nettoyage des listes afin d&#8217;en supprimer les termes
incoh&#233;rents. Nous obtenons donc une liste de 846 termes n&#233;gatifs et 857 termes positifs.
</p>
<p>Enfin, nous utilisons l&#8217;analyseur syntaxique XIP de Xerox (A&#239;t-Mokhtar et al., 2002) pour extraire
les relations de d&#233;pendance syntaxique mettant en jeu un terme polaris&#233;.
</p>
<p>2.3 Traitement
</p>
<p>2.3.1 Analyses statistiques
</p>
<p>Gr&#226;ce aux diff&#233;rentes ressources et outils d&#233;crits ci-dessus, nous obtenons un corpus annot&#233; en
d&#233;pendances. Nous identifions automatiquement les syntagmes contenant un terme polaris&#233; et
obtenons en sortie une liste de syntagmes, la polarit&#233; du terme polaris&#233; contenu dans le syntagme,
et la note de la critique dans laquelle chaque syntagme a &#233;t&#233; extrait (cf. table 1).
</p>
<p>Relation extraite : DETERM_INT(&lt;NOUN :fluidit&#233;_fluidit&#233; :&gt;,&lt;DET :quelle_quel :&gt;)
Terme polaris&#233; : fluidit&#233;
Polarit&#233; du terme : positif
Phrase brute : &#171; Quel rythme, quelle fluidit&#233;. &#187;
Note de la critique : 5/5
Structure lexico-syntaxique : DETERM_INT(&lt;NOUN : :&gt;,&lt;DET :quel :&gt;)
</p>
<p>TABLE 1 &#8211; Les diff&#233;rentes caract&#233;ristiques d&#8217;un syntagme extrait
</p>
<p>Afin de juger de l&#8217;impact des syntagmes extraits sur la polarit&#233;, nous retirons le terme polaris&#233;
et recherchons au sein du corpus la structure lexico-syntaxique obtenue. Cette m&#233;thode nous
a permis de d&#233;terminer la fr&#233;quence d&#8217;apparition de chacune de ces structures dans le corpus
selon deux crit&#232;res : (1) la note de la critique, (2) la polarit&#233; du terme polaris&#233;. Nous analysons
ces donn&#233;es d&#8217;un point de vue statistique en construisant une table de contingence pour chaque
structure selon ces deux crit&#232;res (nous ne retenons que les structures ayant une fr&#233;quence de plus
de 20 quand elles sont associ&#233;es &#224; au moins une des deux polarit&#233;s). Nous analysons chaque table
au moyen du test du chi-carr&#233;, et &#233;valuons de cette mani&#232;re s&#8217;il y a ind&#233;pendance entre la note
de la critique et la fr&#233;quence de la relation. Nous retenons ensuite les relations pour lesquelles
le r&#233;sultat du test est significatif (seuil de 0,05) et en calculons les r&#233;sidus ajust&#233;s. De cette
fa&#231;on, nous mettons en &#233;vidence les structures lexico-syntaxiques dont la note de la critique et la
polarit&#233; du terme associ&#233; ont un effet sur leur distribution dans le corpus. Nous nous appuyons
enfin sur la valeur des r&#233;sidus ajust&#233;s significatifs (r&#233;sidus dont la probabilit&#233; est inf&#233;rieure &#224;
0,05) pour parler d&#8217;une relation surrepr&#233;sent&#233;e (r&#233;sidu ajust&#233; positif) ou sous-repr&#233;sent&#233;e (r&#233;sidu
ajust&#233; n&#233;gatif) dans une note particuli&#232;re avec un terme d&#8217;une certaine polarit&#233;.
La table 2 montre les r&#233;sultats statistiques obtenus pour le syntagme nominal modifi&#233; par l&#8217;adjectif
total. Lorsqu&#8217;elle est associ&#233;e &#224; un nom positif, cette structure obtient un chi-carr&#233; de 16,99,
correspondant &#224; une p-value de 0,002, valeur inf&#233;rieure au seuil de 0,05. Nous consid&#233;rons donc
le test significatif, et calculons les r&#233;sidus ajust&#233;s. Les valeurs des r&#233;sidus ajust&#233;s significatifs
indiquent que la structure, lorsqu&#8217;elle est associ&#233;e &#224; un nom positif, est sous-repr&#233;sent&#233;e dans
les notes 2 et 3, et surrepr&#233;sent&#233;e dans les notes 4 et 5. La m&#234;me analyse est effectu&#233;e lorsque
total est associ&#233; &#224; un nom n&#233;gatif. Ainsi, le syntagme s&#8217;av&#232;re notamment surrepr&#233;sent&#233; dans les
</p>
<p>127</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>critiques positives avec un nom positif (&#171; (...) un film d&#8217;une finesse totale &#187;) et surrepr&#233;sent&#233; dans
les critiques n&#233;gatives avec un nom n&#233;gatif (&#171; (...) d&#8217;une b&#234;tise abyssale, d&#8217;une abjection totale. &#187;)
</p>
<p>[total - nom positif] : &#967;2=16.99 (pvalue : 0,002)
Note R&#233;sidus Ajust&#233;s
</p>
<p>1 -1,04 (proba : 0,30) non-significatif
2 -2,24 (proba : 0,0253)sous-repr&#233;sentation
3 -2,23 (proba : 0,0259)sous-repr&#233;sentation
4 2,18 (proba : 0,0292) surrepr&#233;sentation
5 2,48 (proba : 0,0132) surrepr&#233;sentation
</p>
<p>[total - nom n&#233;gatif] : &#967;2=38,57 (pvalue : 0,000)
Note R&#233;sidus Ajust&#233;s
</p>
<p>1 5,14 (proba : 0,0000) surrepr&#233;sentation
2 2,58 (proba : 0,0099) surrepr&#233;sentation
3 -2,05 (proba : 0,0401) sous-repr&#233;sentation
4 -2,73 (proba : 0,0063) sous-repr&#233;sentation
5 -0,83 (proba : 0,40) non-significatif
</p>
<p>TABLE 2 &#8211; Caract&#233;ristiques statistiques de l&#8217;adjectif total
</p>
<p>2.3.2 R&#232;gles d&#8217;attribution automatique d&#8217;&#233;tiquettes
</p>
<p>Afin de finaliser la proc&#233;dure d&#8217;extraction, nous cherchons &#224; d&#233;finir automatiquement l&#8217;impact
des structures lexico-syntaxiques significatives extraites sur un terme polaris&#233;.
Dans (Boubel, 2011), notre analyse linguistique nous avait amen&#233;e &#224; analyser plus en d&#233;-
tail les r&#233;sultats statistiques. Nous avions ainsi mis en relation les surrepr&#233;sentations et sous-
repr&#233;sentations caract&#233;ristiques de ces adverbes avec leur r&#244;le s&#233;mantique. Globalement, trois
tendances se sont d&#233;gag&#233;es (la surrepr&#233;sentation s&#8217;est av&#233;r&#233;e plus informative que la sous-
repr&#233;sentation) :
</p>
<p>1. Les adverbes surrepr&#233;sent&#233;s avec des adjectifs dont la polarit&#233; co&#239;ncide avec celle de la
critique, comme pour l&#8217;adverbe profond&#233;ment (table 3), intensifient souvent la valeur des
adjectifs auxquels ils sont associ&#233;s : &#171; (...) Un film gonfl&#233; et profond&#233;ment attachant (...) &#187;.
</p>
<p>2. Les adverbes surrepr&#233;sent&#233;s avec un adjectif dont la polarit&#233; ne co&#239;ncide pas avec celle de
la critique, comme on peut le voir dans la table 4, remplissent souvent un r&#244;le d&#8217;att&#233;nuateur
ou d&#8217;inverseur : &#171; Ici, c&#8217;est &#233;puisant et jamais cr&#233;dible. &#187;.
</p>
<p>3. Les adverbes surrepr&#233;sent&#233;s dans les notes mitig&#233;es, comme c&#8217;est le cas pour l&#8217;adverbe
parfois (table 5) sont souvent inclus dans des structures rh&#233;toriques plus larges comme
des m&#233;canismes d&#8217;opposition, de concession ou de comparaison : &#171; La po&#233;sie trash du
r&#233;alisateur ne faiblit pas, contrairement au rythme de son r&#233;cit parfois r&#233;p&#233;titif. &#187;.
</p>
<p>Sur ces constatations, nous avons donc d&#233;gag&#233; trois cat&#233;gories d&#8217;adverbes ayant un r&#244;le s&#233;man-
tique diff&#233;rent. Pour plus de facilit&#233; pour la suite de notre &#233;tude, nous abr&#233;geons ces diff&#233;rentes
cat&#233;gories par intensifieurs (point 1 ci-dessus), inverseurs (point 2) et concessifs (point 3), bien
que ces termes soient r&#233;ducteurs.
</p>
<p>ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :profond&#233;ment :&gt;)
Avec mots positifs 1/5 2/5 3/5 4/5 5/5
</p>
<p>surrepr&#233;sent&#233; &#8226; &#8226;
non-significatif &#8226;
</p>
<p>sous-repr&#233;sent&#233; &#8226; &#8226;
TABLE 3 &#8211; Surrepr&#233;sentations et sous-repr&#233;sentations de l&#8217;adverbe profond&#233;ment
</p>
<p>128</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :jamais :&gt;)
Avec mots n&#233;gatifs 1/5 2/5 3/5 4/5 5/5
</p>
<p>surrepr&#233;sent&#233; &#8226; &#8226;
non-significatif
</p>
<p>sous-repr&#233;sent&#233; &#8226; &#8226; &#8226;
TABLE 4 &#8211; Surrepr&#233;sentations et sous-repr&#233;sentations de l&#8217;adverbe jamais
</p>
<p>ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :parfois :&gt;)
Avec mots positifs 1/5 2/5 3/5 4/5 5/5
</p>
<p>surrepr&#233;sent&#233; &#8226;
non-significatif &#8226; &#8226; &#8226;
</p>
<p>sous-repr&#233;sent&#233; &#8226;
Avec mots n&#233;gatifs 1/5 2/5 3/5 4/5 5/5
</p>
<p>surrepr&#233;sent&#233; &#8226;
non-significatif &#8226; &#8226;
</p>
<p>sous-repr&#233;sent&#233; &#8226; &#8226;
TABLE 5 &#8211; Surrepr&#233;sentations et sous-repr&#233;sentations de l&#8217;adverbe parfois
</p>
<p>Il est raisonnable de penser que ces conclusions peuvent &#234;tre valables pour d&#8217;autres structures
que les adverbes. C&#8217;est donc sur la base de l&#8217;&#233;tude empirique pr&#233;sent&#233;e ci-dessus que nous
avons d&#233;fini un ensemble de r&#232;gles qui attribuent un score &#224; une structure pour chaque type
de modifieurs. Nous conf&#233;rons ainsi un score de 1 &#224; 10 &#224; une structure pour chacune des trois
classes de modifieurs, gr&#226;ce &#224; une dizaine de r&#232;gles par classe. Ces r&#232;gles, que nous ne d&#233;taillons
pas ici pour une question de clart&#233; et de place, se basent sur les propri&#233;t&#233;s statistiques du
modifieur (surrepr&#233;sentations et sous-repr&#233;sentations) en fonction de deux crit&#232;res : la polarit&#233;
du terme et la note de la critique. Ainsi, une structure obtient un score &#233;lev&#233; : (1) dans la classe
des intensifieurs lorsqu&#8217;elle est surrepr&#233;sent&#233;e dans une critique dont la polarit&#233; co&#239;ncide avec
celle du terme polaris&#233; ; (2) dans la classe des inverseurs lorsqu&#8217;elle est surrepr&#233;sent&#233;e dans
une critique dont la polarit&#233; n&#8217;est pas celle du terme polaris&#233; ; (3) dans la classe des concessifs
lorsqu&#8217;elle est surrepr&#233;sent&#233;e dans les critiques mitig&#233;es (note 3/5). Nous classons ensuite la
structure dans la cat&#233;gorie de modifieurs qui obtient le score le plus &#233;lev&#233;.
De cette fa&#231;on, le syntagme nominal modifi&#233; par l&#8217;adjectif total (cf table 2) obtient un score
de 8 comme intensifieur, 0 comme inverseur et 2 commme concessif. Cette structure est en
effet surrepr&#233;sent&#233;e dans les critiques positives lorsqu&#8217;elle est associ&#233;e &#224; un nom positif, et
surrepr&#233;sent&#233;e dans les critiques n&#233;gatives lorsqu&#8217;elle est associ&#233;e &#224; un nom n&#233;gatif, ce qui lui
conf&#232;re un score d&#8217;intensification &#233;lev&#233;. Le syntagme nominal modifi&#233; par l&#8217;adjectif total est donc
r&#233;pertori&#233; comme intensifieur avec un score de 8.
</p>
<p>3 &#201;valuation
</p>
<p>3.1 R&#233;sultats de l&#8217;extraction
</p>
<p>Au terme de notre exp&#233;rimentation, nous obtenons une liste de 243 structures lexico-syntaxiques
suppos&#233;es modifiantes dont 108 intensifieurs, 74 inverseurs, 52 concessifs. De plus, 9 structures
</p>
<p>129</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>obtiennent un score ex-aequo maximal dans deux cat&#233;gories : 1 structure class&#233;e autant comme
un inverseur que comme un concessif, et 8 structures en tant qu&#8217;intensifieurs et concessifs.
Les scores obtenus pour chacune des structures sont relativement peu &#233;lev&#233;s : seulement 16
structures ont un score de 7 ou plus, et 127 structures, soit un peu plus de 50%, obtiennent un
score entre 3 et 4.
Les cat&#233;gories syntaxiques des &#233;l&#233;ments modifieurs au sein de la structure lexico-syntaxique sont
diverses, on trouve notamment 53 adverbes, 63 adjectifs, 66 noms, 20 pr&#233;positions. La table 6
pr&#233;sente les 10 structures remportant les scores les plus &#233;lev&#233;s.
</p>
<p>Structure Score Modifieur Exemple
NEGAT(&lt;VERB : :&gt;) 10 Inverseur Ce palace ne m&#233;rite vraiment
</p>
<p>pas d&#8217;&#233;toile...
DETERM(&lt;NOUN : :&gt;,&lt;DET :un :&gt;) 9 Intensifieur Un ratage assez complet
VMOD_POSIT1(&lt;VERB : :&gt;,&lt;ADV :pas :&gt;) 9 Inverseur Pas dr&#244;le, pas rythm&#233; (...)
ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :trop :&gt;) 8,5 Concessif Certains trouveront l&#8217;esquisse
</p>
<p>trop caricaturale, mais (...)
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;ADJ :total :&gt;) 8 Intensifieur un film d&#8217;une finesse totale
PREPOBJ(&lt;NOUN : :&gt;,&lt;PREP :sans :&gt;) 8 Inverseur C&#8217;est un ouvrage sans gr&#226;ce
ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :moins :&gt;) 8 Concessif C&#8217;est &#224; peine moins racoleur
</p>
<p>que (...)
ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :parfois :&gt;) 7,5 Concessif Jamais malsain, mais parfois
</p>
<p>vulgaire, (...)
ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :assez :&gt;) 7,5 Concessif Tout cela n&#8217;est pas m&#233;chant,
</p>
<p>mais assez vain.
DETERM(&lt;NOUN : :&gt;,&lt;DET :quelque :&gt;) 7,5 Concessif &#192; peine quelques lueurs dans
</p>
<p>un oc&#233;an de niaiseries
</p>
<p>TABLE 6 &#8211; Liste des 10 premi&#232;res structures extraites obtenant le score le plus &#233;lev&#233;.
</p>
<p>3.2 &#201;valuation des r&#233;sultats
</p>
<p>Pour &#233;valuer la pertinence des r&#233;sultats, nous avons parcouru manuellement la liste des 243
structures extraites afin de d&#233;terminer dans quelle mesure elles modifient effectivement la polar-
it&#233; d&#8217;un terme et de quelle fa&#231;on. Il s&#8217;agit donc d&#8217;une &#233;valuation qualitative des r&#233;sultats obtenus.
Bien entendu, il sera indispensable d&#8217;effectuer une analyse quantitative et d&#8217;&#233;valuer l&#8217;apport de
cette liste de modifieurs au sein d&#8217;une application de fouille d&#8217;opinion. Ces deux &#233;valuations n&#8217;ont
pas le m&#234;me objectif et se compl&#232;tent, c&#8217;est pourquoi il est int&#233;ressant de les mener &#224; bien toutes
les deux.
De nombreux retours sur corpus ont &#233;t&#233; n&#233;cessaires pour comprendre le r&#244;le des structures ex-
traites dans une critique. Certaines structures font r&#233;f&#233;rence &#224; des constructions lexico-syntaxiques
plus larges, que l&#8217;analyseur syntaxique ne peut pas restituer dans son int&#233;gralit&#233;. C&#8217;est le cas, par
exemple, de la relation PREPOBJ d&#8217;un verbe modifi&#233; par la pr&#233;position par, qui fait r&#233;f&#233;rence &#224; la
construction plus large : [il finit par - VB]). Dans ce cas, nous avons jug&#233; et class&#233; les structures
ou expressions dans leur int&#233;gralit&#233;. Nous les classons donc comme correctes lorsqu&#8217;elles sont
effectivement modifiantes.
</p>
<p>130</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.2.1 Cas pertinents
</p>
<p>Notre &#233;valuation manuelle nous a conduit &#224; juger 87 structures pertinentes sur 243, dont 37
intensifieurs, 22 inverseurs et 27 concessifs. Le dernier modifieur est la structure adjectivale
modifi&#233;e par l&#8217;adverbe peu class&#233;e autant comme un inverseur que comme un concessif (avec
un score de 4 pour les deux cat&#233;gories). Cette double fonction inverseur-concessif n&#8217;est pas
incoh&#233;rente dans l&#8217;absolu. Pour l&#8217;adverbe peu, en particulier, il est parfaitement concevable de lui
attribuer un r&#244;le d&#8217;att&#233;nuateur (&#171; Pour addicts peu exigeants. &#187;), mais aussi de le voir int&#233;grer une
structure comparative ou concessive plus large (&#171; Aussi peu r&#233;aliste que morale &#187;). En revanche, le
double classement intensifieur-inverseur est plus probl&#233;matique en soi. Aucune des 8 structures
dans cette situation (comme la pr&#233;position &#224; travers ou le compl&#233;ment du nom homme) n&#8217;a
&#233;t&#233; retenue. Les structures mises en &#233;vidence ici sont vari&#233;es. Elles sont souvent compos&#233;es
d&#8217;adverbes et d&#8217;adjectifs, cat&#233;gories syntaxiques largement utilis&#233;es dans d&#8217;autres travaux du
domaine. Toutefois d&#8217;autres structures rarement trait&#233;es apparaissent &#233;galement. Nous d&#233;taillons
ici les r&#233;sultats pour chaque cat&#233;gorie de modifieurs.
</p>
<p>La liste des 37 intensifieurs, dont des exemples sont report&#233;s dans la table 7, est principalement
constitu&#233;e, &#224; plus de 90%, de structures lexico-syntaxiques contenant des adjectifs ou des
adverbes. On remarquera toutefois la pr&#233;sence de certaines formes plus complexes, comme le
compl&#233;ment du nom &quot;de l&#8217;ann&#233;e&quot;, qui amplifie clairement la polarit&#233; du nom auquel il est associ&#233;.
</p>
<p>Structure Score Exemple
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;ADJ :total :&gt;) 8 Un total enchantement.
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;ADJ :v&#233;ritable :&gt;) 5 (...) un v&#233;ritable nanar sans int&#233;r&#234;t
</p>
<p>(...)
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;ADJ :tel :&gt;) 5 Dommage que les personnages, les
</p>
<p>gags et le sc&#233;nario (...) d&#233;gagent un
tel ennui.
</p>
<p>ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :profond&#233;ment :&gt;) 4 Un film profond&#233;ment g&#233;n&#233;reux.
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;NOUN :ann&#233;e :&gt;) 2 (...) le ratage le plus spectaculaire et
</p>
<p>inattendu de l&#8217;ann&#233;e.
</p>
<p>TABLE 7 &#8211; Exemple d&#8217;intensifieurs
</p>
<p>Ensuite, les 22 inverseurs ont des formes plus h&#233;t&#233;rog&#232;nes, les cat&#233;gories syntaxiques qui les
composent sont plus diverses. Il s&#8217;agit &#233;galement en majorit&#233; d&#8217;adverbes, mais peu d&#8217;adjectifs
sont pr&#233;sents. Les strat&#233;gies utilis&#233;es pour exprimer l&#8217;inversion ou l&#8217;att&#233;nuation semblent en effet
plus vari&#233;es. Les structures qui ont obtenu les scores les plus hauts sont clairement des inverseurs,
comme on peut le voir dans la table 8. Notons que la structure VMOD(&lt;VERB : :&gt;,&lt;CON-
JQUE :que :&gt;) correspond &#224; la construction syntaxique restrictive &quot;ne..que&quot;.
</p>
<p>Enfin, les 27 concessifs sont en majorit&#233; des structures contenant des adverbes, mais d&#8217;autres
structures plus diverses apparaissent, de la m&#234;me fa&#231;on que pour les inverseurs. L&#224; encore, les
adjectifs sont peu nombreux (au nombre de 3 : certain, in&#233;gal, m&#234;me). Au vu de la liste &#224; juger,
nous sommes amen&#233;e &#224; reconsid&#233;rer quelque peu la d&#233;finition de cette cat&#233;gorie. On y trouve en
effet des &#233;l&#233;ments tr&#232;s divers, mais qui expriment tous, et gr&#226;ce &#224; des strat&#233;gies plus ou moins
directes, un avis mitig&#233;, une opinion nuanc&#233;e, ou une h&#233;sitation, comme on peut l&#8217;entrevoir
dans les exemples de la table 9. Ainsi, les constructions plus complexes (vb - sans d&#233;plaisir,
finir par - vb) font r&#233;f&#233;rence &#224; des strat&#233;gies qui expriment un avis mitig&#233; ou peu enthousiaste.
</p>
<p>131</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure Score Exemple
NEGAT(&lt;VERB : :&gt;) 10 (...) son &#233;nergie, (...) ne desservent
</p>
<p>jamais l&#8217;ensemble
VMOD_POSIT1(&lt;VERB : :&gt;,&lt;ADV :pas :&gt;) 9 La po&#233;sie et le ton (...) ne fonction-
</p>
<p>nent pas.
PREPOBJ(&lt;NOUN : :&gt;,&lt;PREP :sans :&gt;) 8 C&#8217;est un ouvrage sans gr&#226;ce.
ADJMOD(&lt;ADJ : :&gt;,&lt;ADV :jamais :&gt;) 5 Ici, c&#8217;est &#233;puisant et jamais cr&#233;dible.
VMOD(&lt;VERB : :&gt;,&lt;CONJQUE :que :&gt;) 5 un exercice de style o&#249; la vie ne pal-
</p>
<p>pite que trop rarement.
PREPOBJ(&lt;NOUN : :&gt;,&lt;PREP :en d&#233;pit de :&gt;) 3 H&#233;las, en d&#233;pit de la g&#233;n&#233;rosit&#233; du
</p>
<p>propos, (...)
</p>
<p>TABLE 8 &#8211; Exemple d&#8217;inverseurs
</p>
<p>Structure Score Exemple
DETERM(&lt;NOUN : :&gt;,&lt;DET :quelque :&gt;) 7,5 (..) arrache cependant quelques
</p>
<p>sourires d&#233;sabus&#233;s.
PREPOBJ(&lt;VERB : :&gt;,&lt;PREP :par :&gt;) 7,5 (...) finit par s&#233;duire ; (...) finit par
</p>
<p>lasser
CONNECT(&lt;VERB : :&gt;,&lt;CONJ :si :&gt;) 7,5 Mais, avouons-le, si le m&#233;lo fonc-
</p>
<p>tionne c&#8217;est surtout gr&#226;ce &#224; (...)
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;ADJ :certain :&gt;) 7 (...) une certaine froideur habite
</p>
<p>son exercice de style virtuose.
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;ADJ :in&#233;gal :&gt;) 4 (...) avec un bonheur in&#233;gal.
PREPOBJ(&lt;NOUN : :&gt;,&lt;PREP :malgr&#233; :&gt;) 4 Bref, malgr&#233; la sinc&#233;rit&#233; du r&#233;alisa-
</p>
<p>teur, Bella Ciao est un film rat&#233;.
VMOD_POSIT1(&lt;VERB : :&gt;,&lt;NOUN :d&#233;plaisir :&gt;) 3,5 (...) cette com&#233;die (...) se d&#233;guste
</p>
<p>sans d&#233;plaisir.
</p>
<p>TABLE 9 &#8211; Exemple de concessifs
</p>
<p>Apr&#232;s ce tour d&#8217;horizon, il est int&#233;ressant de se pencher sur la nature des &#233;l&#233;ments pertinents.
Pr&#233;c&#233;demment, nous avions limit&#233; notre &#233;tude aux adverbes et montr&#233; leur pertinence en tant
que modifieurs de polarit&#233;. Au vu des r&#233;sultats obtenus ici pour les autres cat&#233;gories syntaxiques,
ils semblent occuper un r&#244;le central. Signalons tout de m&#234;me que, dans la mesure o&#249; la cat&#233;gorie
des adverbes est relativement ferm&#233;e, ils vont &#234;tre plus fr&#233;quents et donc plus facilement d&#233;clar&#233;s
significatifs par le test. Dans cet article, nous avons cherch&#233; &#224; &#233;valuer la pertinence des autres
cat&#233;gories syntaxiques. Les r&#233;sultats sont moins nombreux, mais ils viennent compl&#233;ter notre
lexique et apportent donc une information non-n&#233;gligeable.
</p>
<p>1. Verbes : Tr&#232;s peu de verbes sont extraits et aucun n&#8217;est pertinent. Certaines structures
verbales sont extraites cependant par l&#8217;interm&#233;diaire d&#8217;autres relations de d&#233;pendance (des
relations qui mettent en jeu des pr&#233;positions, par exemple). C&#8217;est le cas de l&#8217;expression [il
finit par - VB]. On pourrait envisager d&#8217;autres expressions pertinentes comme [&#234;tre loin
de - VB] ou [passer &#224; c&#244;t&#233; de - NOM]. Il serait int&#233;ressant d&#8217;&#233;tudier &#224; quel point les verbes
peuvent effectivement avoir un impact sur un terme polaris&#233;.
</p>
<p>2. Noms : Peu de noms se r&#233;v&#232;lent &#234;tre des modifieurs pertinents. De nombreux noms ont
pourtant &#233;t&#233; extraits. C&#8217;est la cat&#233;gorie la plus fr&#233;quemment source d&#8217;erreur. Ils semblent
avoir effectivement un impact important, mais cet impact est difficile &#224; justifier et &#224; juger.
</p>
<p>132</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3. Adjectifs : Les adjectifs sont souvent utilis&#233;s comme les indices principaux d&#8217;une polarit&#233;.
L&#8217;extraction de nombreux adjectifs ici montre qu&#8217;ils peuvent aussi &#234;tre des modifieurs, en
particulier pour l&#8217;intensification.
</p>
<p>Pour r&#233;sumer, plus de 50% des modifieurs jug&#233;s pertinents correspondent &#224; des structures con-
tenant un adverbe (associ&#233; &#224; un adjectif ou &#224; un verbe polaris&#233;). Environ 22% des modifieurs ne
sont pas des adjectifs ou des adverbes (noms, prepositions, d&#233;terminants...). Ceux-ci sont princi-
palement des inverseurs et des concessifs. Il semble donc que des strat&#233;gies plus diverses soient
utilis&#233;es pour exprimer la concession et l&#8217;inversion que pour l&#8217;intensification. L&#8217;intensification
agit en effet souvent de fa&#231;on plus directe sur un terme polaris&#233; gr&#226;ce &#224; une relation syntaxique
locale. Au contraire, l&#8217;apport d&#8217;une nuance, quelle qu&#8217;elle soit, ou d&#8217;une inversion, s&#8217;exprimera
plut&#244;t au niveau de l&#8217;organisation du discours, ou gr&#226;ce &#224; des formulations plus complexes. Il
serait int&#233;ressant de se pencher plus particuli&#232;rement sur ces ph&#233;nom&#232;nes.
</p>
<p>3.2.2 Erreurs ou incoh&#233;rences de l&#8217;extraction
</p>
<p>Lors de notre &#233;valuation manuelle, un certain nombre de r&#233;sultats se sont r&#233;v&#233;l&#233;s &#234;tre r&#233;ellement
inappropri&#233;s et ne pas avoir leur place dans le contexte d&#8217;une &#233;valuation ou d&#8217;une opinion.
Tout d&#8217;abord, 17 &#233;l&#233;ments proviennent d&#8217;erreurs d&#8217;extraction ou d&#8217;erreurs induites par la
m&#233;thodologie (erreurs de l&#8217;analyse syntaxique ou dans le lexique). Les scores de ces &#233;l&#233;ments
sont g&#233;n&#233;ralement peu &#233;lev&#233;s. D&#8217;autre part, une cinquantaine de structures se sont av&#233;r&#233;es plus
probl&#233;matiques, dans la mesure o&#249; il est difficile de d&#233;terminer en quoi elles ont un impact sur la
polarit&#233; d&#8217;un terme. Certaines font r&#233;f&#233;rence &#224; des constructions tr&#232;s courantes, que l&#8217;analyse
statistique a jug&#233;es significatives. C&#8217;est le cas du syntagme nominal introduit par le d&#233;terminant
ind&#233;fini un, class&#233; comme intensifieur avec un score de 9. Ces cas obtiennnent parfois des scores
&#233;lev&#233;s. D&#8217;autres structures apparaissent dans des contextes divers. Il est alors difficile de leur
d&#233;finir un r&#244;le s&#233;mantique clair. Enfin, nous avons consid&#233;r&#233; que 3 structures extraites effective-
ment modifiantes, reprises dans la table 10, ont &#233;t&#233; mal class&#233;es. Deux d&#8217;entre elles ont un score
tr&#232;s faible.
</p>
<p>Structure Score Type du modifieur
OBJ(&lt;VERB : :&gt;,&lt;PRON :rien :&gt;) 4 Concessif
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;ADJ :bon :&gt;) 1 Inverseur
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;ADJ :efficace :&gt;) 1 Inverseur
</p>
<p>TABLE 10 &#8211; 3 structures mal class&#233;es
</p>
<p>3.2.3 Autres ph&#233;nom&#232;nes contexuels
</p>
<p>A c&#244;t&#233; des cas corrects et des r&#233;elles incoh&#233;rences, notre syst&#232;me met &#233;galement en &#233;vidence
des &#233;l&#233;ments qui jouent un certain r&#244;le dans l&#8217;expression d&#8217;une polarit&#233; ou d&#8217;une &#233;valuation. Ce
ne sont pas des modifieurs, mais ils apportent un &#233;clairage int&#233;ressant sur les ph&#233;nom&#232;nes qui
apparaissent dans le contexte de termes polaris&#233;s.
</p>
<p>Parmi ces ph&#233;nom&#232;nes contextuels particuliers, 19 &#233;l&#233;ments font en fait partie du vocabulaire du
cin&#233;ma et d&#233;signent des caract&#233;ristiques du film soumises &#224; jugement, et donc, dans ce cadre
souvent associ&#233;es &#224; des termes positifs ou n&#233;gatifs (table 11).
</p>
<p>133</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure Exemple
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;NOUN :effet :&gt;) &#171; surench&#232;re d&#8217;effets &#187;
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;NOUN :dialogue :&gt;) &#171; pauvret&#233; des dialogues &#187;, &#171; musi-
</p>
<p>calit&#233; des dialogues &#187;
</p>
<p>TABLE 11 &#8211; Constructions contenant des termes issus du vocabulaire du cin&#233;ma
</p>
<p>Nous avons ensuite class&#233; 30 &#233;l&#233;ments comme &#233;tant eux-m&#234;mes polaris&#233;s. Comme notre syst&#232;me
se base sur des structures lexico-syntaxiques, certains &#233;l&#233;ments polaris&#233;s s&#8217;av&#232;rent &#234;tre des
structures complexes. C&#8217;est le cas par exemple du compl&#233;ment du nom &quot;de ma&#238;tre&quot;, clairement
positif, comme on peut le voir dans les expressions &quot;main de ma&#238;tre&quot; ou &quot;travail de ma&#238;tre&quot;. Les
lexiques de polarit&#233; classiques prennent souvent peu en compte ce type d&#8217;expressions &#224; mots
multiples, se concentrant sur les mots simples. Il serait avantageux d&#8217;utiliser &#233;galement ces
expressions polaris&#233;es pour une t&#226;che automatique de fouille d&#8217;opinion.
</p>
<p>Enfin, nous extrayons &#233;galement un certain nombre de structures diverses (36) qui jouent un r&#244;le
dans l&#8217;expresson d&#8217;une &#233;valuation. Il n&#8217;est pas possible de les consid&#233;rer comme des modifieurs,
dans le sens o&#249; elles n&#8217;ont pas un r&#233;el impact sur un terme polaris&#233;, mais elles occupent une
place importante dans le langage &#233;valuatif. Il ne s&#8217;agit pas de structures fig&#233;es plus larges, que
l&#8217;analyseur syntaxique n&#8217;a pas pu restituer dans son ensemble, mais plut&#244;t d&#8217;expressions ou
formulations diverses souvent utilis&#233;es qui aceptent de nombreuses variantes. Ici, elles sont
souvent le reflet de formulations utilis&#233;es pour juger un film. Des exemples en sont donn&#233;s
dans la table 12. Ces structures peuvent avoir diff&#233;rents r&#244;les. Certaines sont plut&#244;t positives
et n&#233;gatives dans le strict contexte du cin&#233;ma. D&#8217;autres semblent plus servir &#224; introduire un
jugement, sans &#234;tre en elles-m&#234;mes polaris&#233;es.
</p>
<p>Structure Exemple
PREPOBJ(&lt;VERB : :&gt;,&lt;PREP :&#224; :&gt;) &#171; c&#8217;est &#224; voir &#187; ; &#171; c&#8217;est &#224; d&#233;couvrir &#187;
OBJ(&lt;VERB : :&gt;,&lt;PRON :&#231;a :&gt;) &#171; (...) n&#8217;a pas m&#233;rit&#233; &#231;a &#187; ; &#171; on a vu &#231;a 100
</p>
<p>fois &#187; ; &#171; on n&#8217;a jamais vu &#231;a &#187;
NMOD_POSIT1(&lt;NOUN : :&gt;,&lt;NOUN :s&#233;rie :&gt;) &#171; com&#233;die de s&#233;rie b &#187; ; &#171; s&#233;rie z &#187; ; &#171; s&#233;rie
</p>
<p>t&#233;l&#233; &#187;
OBJ(&lt;VERB : :&gt;,&lt;NOUN :int&#233;r&#234;t :&gt;) &#171; n&#8217;offre aucun int&#233;r&#234;t &#187; ; &#171; &#233;veille l&#8217;in-
</p>
<p>t&#233;r&#234;t &#187; ; &#171; capte l&#8217;int&#233;r&#234;t &#187;
</p>
<p>TABLE 12 &#8211; Constructions &#233;valuatives diverses
</p>
<p>3.2.4 Performance de l&#8217;extraction
</p>
<p>Au terme de cette &#233;tude, une premi&#232;re remarque doit &#234;tre faite sur le nombre d&#8217;extractions. Il
s&#8217;av&#232;re en effet moins important que l&#8217;on aurait pu le supposer au d&#233;part, et peu de structures
obtiennent un score &#233;lev&#233; (30 &#233;l&#233;ments avec un score de 5 ou plus, et 16 avec 7 ou plus). Cela
s&#8217;explique en partie par le fait que les relations de d&#233;pendance que l&#8217;on extrait, relativement
pr&#233;cises, ont chacunes des fr&#233;quences peu &#233;lev&#233;es dans le corpus, ce qui complique l&#8217;analyse
statistique.
En ce qui concerne la performance proprement dite du syst&#232;me, 87 structures ont donc &#233;t&#233;
consid&#233;r&#233;es comme bien class&#233;es sur les 243 structures propos&#233;es, soit environ 35%. Il nous
</p>
<p>134</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>faut mesurer ce r&#233;sultat par le fait qu&#8217;aucun seuil minimal de score n&#8217;a &#233;t&#233; appliqu&#233; sur la liste
compl&#232;te. Les structures qui obtiennent un score &#233;lev&#233; sont cependant relativement pertinentes.
Ainsi sur les 30 structures ayant un score de 5 ou plus, 23 ont &#233;t&#233; jug&#233;es pertinentes (et 14
structures pertinentes sur 16 pour un score &#233;gal &#224; 7 ou plus). D&#8217;autre part, la m&#233;thodologie
n&#8217;extrait finalement qu&#8217;environ 30% de r&#233;elles incoh&#233;rences. Certaines extractions sont en effet
pertinentes dans le langage de l&#8217;&#233;valuation, comme nous l&#8217;avons montr&#233; pr&#233;c&#233;demment. Enfin,
le syst&#232;me a tendance &#224; d&#233;terminer de fa&#231;on correcte le type du modifieur lorsque celui-ci est
pertinent. Trois &#233;l&#233;ments seulement se r&#233;v&#232;lent mal class&#233;s. Ces r&#233;sultats sont r&#233;capitul&#233;s dans la
table 13.
</p>
<p>TABLE 13 &#8211; R&#233;partition des modifieurs &#233;valu&#233;s manuellement
</p>
<p>En conclusion, notre m&#233;thodologie nous a permis d&#8217;identifier des modifieurs pertinents en d&#233;pas-
sant le cadre de l&#8217;adverbe et d&#8217;extraire des &#233;l&#233;ments vari&#233;s, typiques du langage de l&#8217;&#233;valuation.
Elle met en avant des ph&#233;nom&#232;nes peu trait&#233;s dans d&#8217;autres travaux, et plus d&#233;taill&#233;s, dans la
mesure o&#249; l&#8217;on traite de structures lexico-syntaxiques et non de termes simples. Les r&#233;sultats ont
permis de mettre en avant deux fonctionnements un peu diff&#233;rents : l&#8217;intensification, port&#233;e par
des adjectifs et des adverbes, souvent avec un impact direct sur un terme polaris&#233;, et l&#8217;expression
de l&#8217;inversion, de l&#8217;att&#233;nuation ou d&#8217;une nuance, port&#233;e par des contructions plus diverses et
complexes.
</p>
<p>4 Conclusion et perspectives
</p>
<p>Le travail pr&#233;sent&#233; ici identifie des modifieurs de polarit&#233; gr&#226;ce &#224; l&#8217;&#233;tude de structures lexico-
syntaxiques qui mettent en jeu un terme polaris&#233;. Cette &#233;tude se r&#233;v&#232;le &#234;tre un bon point de
d&#233;part pour se rendre compte concr&#232;tement de divers ph&#233;nom&#232;nes de modification. Elle met en
avant en particulier, de par la m&#233;thodologie utilis&#233;e, les &#233;l&#233;ments qui ont un impact direct et
local sur un terme d&#8217;une certaine polarit&#233;. Il s&#8217;av&#232;re que ces &#233;l&#233;ments sont relativement limit&#233;s.
D&#8217;autres strat&#233;gies, plus diverses et complexes, apparaissent. Ces strat&#233;gies expriment souvent
une att&#233;nuation ou une inversion, se situent plut&#244;t au niveau de l&#8217;organisation du discours et
associent fr&#233;quemment plusieurs termes polaris&#233;s.
</p>
<p>D&#8217;une part, il sera n&#233;cessaire de compl&#233;ter cette analyse qualitative par une analyse quantitative
en int&#233;grant les modifieurs extraits ici dans un syst&#232;me de fouille d&#8217;opinion. L&#8217;objectif est de
savoir si la prise en compte de ces structures modifiantes am&#233;liore la d&#233;tection de la polarit&#233; d&#8217;un
syntagme ou d&#8217;une phrase.
D&#8217;autre part, cette &#233;tude a montr&#233; l&#8217;int&#233;r&#234;t d&#8217;approfondir la recherche sur les strat&#233;gies de
</p>
<p>135</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>modification sans se limiter aux relations de d&#233;pendance syntaxique. Deux pistes, en particulier,
seraient int&#233;ressantes &#224; explorer : (1) &#233;tude approfondie des ph&#233;nom&#232;nes d&#8217;inversion de la
polarit&#233;, (2) d&#233;finition de r&#232;gles de composition (afin de pouvoir d&#233;terminer la polarit&#233; d&#8217;une
phrase qui contient plusieurs termes polaris&#233;s).
</p>
<p>R&#233;f&#233;rences
</p>
<p>A&#207;T-MOKHTAR, S., CHANOD, J. et ROUX, C. (2002). Robustness beyond shallowness : Incremental
deep parsing. Natural Language Engineering, 8(2-3):121&#8211;144.
</p>
<p>BOUBEL, N. (2011). Extraction automatique de modifieurs de valence affective dans un texte.
etude exploratoire appliqu&#233;e au cas de l&#8217;adverbe. In Travaux du Cercle belge de Linguistique,
volume 6.
</p>
<p>BOUBEL, N. et BESTGEN, Y. (2011). Une proc&#233;dure pour identifier les modifieurs de la valence
affective d&#8217;un mot dans des textes. In Actes de TALN11, volume 2, pages 137&#8211;142, Montpellier.
</p>
<p>GIANNAKIDOU, A. (1998). Polarity sensitivity as (non) veridical dependency, volume 23. J.
Benjamins.
</p>
<p>KENNEDY, A. et INKPEN, D. (2006). Sentiment classification of movie reviews using contextual
valence shifters. Computational Intelligence, 22(2):110&#8211;125.
</p>
<p>MUSAT, C. et TRAUSAN-MATU, S. (2010). The impact of valence shifters on mining implicit
economic opinions. Artificial Intelligence : Methodology, Systems, and Applications, pages 131&#8211;
140.
</p>
<p>PANG, B. et LEE, L. (2008). Opinion mining and sentiment analysis. Foundations and Trends in
Information Retrieval, 2(1-2).
</p>
<p>PETRAKIS, S., KLENNER, M., AILLOUD, E. et FAHRNI, A. (2009). Composition multilingue de
sentiments. In Actes de TALN2009, Senlis.
</p>
<p>QUIRK, R., GREENBAUM, S., LEECH, G., SVARTVIK, J. et CRYSTAL, D. (1985). A comprehensive
grammar of the English language, volume 397. Cambridge Univ Press.
</p>
<p>TABOADA, M., BROOKE, J., TOFILOSKI, M., VOLL, K. et STEDE, M. (2011). Lexicon-based methods
for sentiment analysis. Computational Linguistics, 37(2):267&#8211;307.
</p>
<p>VERNIER, M., MONCEAUX, L., DAILLE, B. et DUBREIL, E. (2009). Cat&#233;orisation des &#233;valuations dans
un corpus de blogs multi-domaine. http ://hal.archives-ouvertes.fr/hal-00405407/fr/.
</p>
<p>VINCZE, N. et BESTGEN, Y. (2011). Identification de mots germes pour la construction d&#8217;un
lexique de valence au moyen d&#8217;une proc&#233;dure supervis&#233;e. In Actes de TALN11, volume 1, pages
223&#8211;234, Montpellier.
</p>
<p>WILSON, T., WIEBE, J. et HOFFMANN, P. (2009). Recognizing contextual polarity : An exploration
of features for phrase-level sentiment analysis. Computational linguistics, 35(3):399&#8211;433.
</p>
<p>ZAENEN, A. et POLANYI, L. (2004). Contextual valence shifters. In Proceedings of AAAI Spring
Symposium on Exploring Attitude and Affect in Text, pages 106&#8211;111.
</p>
<p>ZWARTS, F. (1995). Nonveridical contexts. Linguistic Analysis, 25:286&#8211;312.
</p>
<p>136</p>

</div></div>
</body></html>