<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>De l'utilisation du dialogue naturel pour masquer les QCM au sein des jeux s&#233;rieux</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 323&#8211;336,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>De l'utilisation du dialogue naturel pour masquer les QCM au sein des jeux s&#233;rieux
Franck Dernoncourt1
</p>
<p>(1) LIP6, 4 place Jussieu, 75005 Paris
franck.dernoncourt@lip6.fr
</p>
<p>R&#201;SUM&#201;____________________________________________________________________________________________________________
Une des principales faiblesses des jeux s&#233;rieux &#224; l'heure actuelle est qu'ils incorporent 
tr&#232;s souvent des questionnaires &#224; choix multiple (QCM). Or, aucune &#233;tude n'a d&#233;montr&#233;  
que  les  QCM  sont  capables  d'&#233;valuer  pr&#233;cis&#233;ment  le  niveau  de  compr&#233;hension  des 
apprenants. Au contraire, certaines &#233;tudes ont montr&#233; exp&#233;rimentalement que permettre 
&#224; l'apprenant d'entrer une phrase libre dans le programme au lieu de simplement cocher 
une  r&#233;ponse  dans  un  QCM  rend  possible  une  &#233;valuation  beaucoup  plus  fine  des 
comp&#233;tences  de  l'apprenant.  Nous  proposons  donc  de  concevoir  un  agent 
conversationnel capable de comprendre des &#233;nonc&#233;s en langage naturel dans un cadre 
s&#233;mantique  restreint,  cadre  correspondant  au  domaine  de  comp&#233;tence  test&#233;  chez 
l'apprenant.  Cette  fonctionnalit&#233;  est  destin&#233;e  &#224;  permettre  un  dialogue  naturel  avec 
l'apprenant,  en  particulier  dans  le  cadre  des  jeux  s&#233;rieux.  Une  telle  interaction  en 
langage naturel a pour but de masquer les QCM sous-jacents. Cet article pr&#233;sente notre 
approche.
</p>
<p>ABSTRACT__________________________________________________________________________________________________________
Of the Use of Natural Dialogue to Hide MCQs in Serious Games
A  major  weakness  of  serious  games  at  the  moment  is  that  they  often  incorporate 
multiple choice questionnaires (MCQs). However, no study has demonstrated that MCQs 
can accurately assess the level  of  understanding of a learner.  On the contrary, some 
studies have experimentally shown that allowing the learner to input a free-text answer 
in the program instead of just selecting one answer in an MCQ allows a much finer 
evaluation of the learner's skills. We therefore propose to design a conversational agent 
that can understand statements in natural language within a narrow semantic context 
corresponding to the area of competence on which we assess the learner. This feature is 
intended  to  allow  a  natural  dialogue  with  the  learner,  especially  in  the  context  of 
serious games. Such interaction in natural language aims to hide the underlying MCQs. 
This paper presents our approach.
MOTS-CL&#201;S : Agent  conversationnel  &#233;ducatif,  intelligence  artificielle,  jeu  s&#233;rieux, 
questionnaire &#224; choix multiple, syst&#232;me d'&#233;valuation de r&#233;ponses libres. 
KEYWORDS : Educational  conversational  agent,  artificial  intelligence,  serious  game, 
multiple-choice questionnaire, automatic assessment of free-text answer.
</p>
<p>323</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
Nous d&#233;finirons dans cette premi&#232;re partie les concepts cl&#233;s de l'article, nomm&#233;ment le 
contexte des jeux s&#233;rieux ainsi que les agents conversationnels qui constitue la solution 
que nous explorons pour r&#233;pondre &#224; la probl&#233;matique de masquage des QCM.
</p>
<p>1.1 Les jeux s&#233;rieux
Les jeux s&#233;rieux correspondent &#224; une approche de l'apprentissage qui utilise des moyens 
ludiques.  L'apprentissage peut se situer aussi bien dans le cadre d'une formation que 
dans un contexte de sensibilisation ou de communication (Thomas, 2004). Le march&#233; des 
jeux s&#233;rieux pr&#233;sente une croissance exponentielle : atteignant d&#233;j&#224; 1 milliard de dollars 
en 2004 (Sawyer, 2004), les sp&#233;cialistes l'estimaient &#224; environ 10 milliards de dollars en 
2010.
Dialoguer avec un agent virtuel contribue &#224; maintenir l'attention et la motivation du 
joueur dans un jeu s&#233;rieux. Actuellement, ce dialogue, que ce soit dans les jeux s&#233;rieux 
ou  dans  les  jeux  vid&#233;o  de  type  r&#233;cit  (storytelling)  ainsi  que  dans  la  plupart  des 
environnements informatiques pour l&#8217;apprentissage humain, est constitu&#233; de QCM : le 
joueur interagit donc avec le jeu avec des QCM, qui font office de dialogue.
Le dialogue est donc tr&#232;s contraint, r&#233;duisant ainsi l&#8217;apprentissage du joueur qui peut se 
contenter de cliquer sur une des possibilit&#233;s sans v&#233;ritablement r&#233;fl&#233;chir. Nous pensons 
que  des  syst&#232;mes  de  dialogue  davantage  flexibles  peuvent  constituer  une  r&#233;ponse 
pertinente &#224; ce probl&#232;me. 
</p>
<p>1.2 Les agents conversationnels
Un dialogue est une activit&#233; verbale qui fait  intervenir au moins deux interlocuteurs 
servant &#224; accomplir une t&#226;che ou simplement &#233;changer des mots dans une situation de 
communication  donn&#233;e.  Il  constitue  une  suite  coordonn&#233;e  d&#8217;actions  (langagi&#232;res  et 
non-langagi&#232;res) (Vernant, 1992).
L&#8217;id&#233;e d&#8217;une interaction homme-machine se basant sur le fonctionnement du langage 
naturel n&#8217;est pas nouvelle : elle a vu le jour dans les ann&#233;es 1950 avec le test de Turing.  
N&#233;anmoins, cette probl&#233;matique, aux niveaux conceptuel et pratique, demeure toujours 
d&#8217;actualit&#233;. Il existe, par exemple, des comp&#233;titions annuelles comme le Loebner Prize 
(Loebner, 2003) ou le Chatterbox Challenge visant &#224; r&#233;ussir un test de Turing en imitant 
l&#8217;interaction verbale humaine, mais aucun programme n&#8217;est parvenu &#224; ce jour &#224; atteindre 
le niveau d&#8217;un humain (Floridi et al., 2009).
Afin de d&#233;finir des crit&#232;res d&#8217;efficacit&#233; des agents conversationnels, nous allons prendre 
en  compte  les  quatre  crit&#232;res  suivants  pr&#233;-conditionnant  l'&#233;laboration  d'un  syst&#232;me 
de dialogue intelligent et propos&#233;s par (Rastier, 2001) :
</p>
<p>1. apprentissage : int&#233;gration au moins temporaire d'informations issues des propos 
de l'utilisateur ;&#8232;
</p>
<p>2. questionnement : demande de pr&#233;cisions de la part du syst&#232;me ;&#8232;
3. rectification :  suggestion  de  rectifications  &#224;  la  question  pos&#233;e,  lorsque 
</p>
<p>324</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>n&#233;cessaire ;
4. explicitation :  explicitation  par  le  syst&#232;me  d'une  r&#233;ponse  qu'il  a  apport&#233;e 
</p>
<p>pr&#233;c&#233;demment.
Les agents conversationnels se divisent en deux classes principales : 
</p>
<p>&#8226; les  agents  conversationnels  non  orient&#233;s  t&#226;che  destin&#233;s  &#224;  converser  avec 
l'utilisateur  sur  n'importe  quel  sujet  avec  une  relation  souvent  amicale,  tel 
ALICE (Wallace, 2009) ;
</p>
<p>&#8226; les  agents  conversationnels  orient&#233;s  t&#226;che,  lesquels  ont  un  but  qui  leur  est 
assign&#233; dans leur conception.
</p>
<p>Les agents conversationnels orient&#233;s t&#226;che sont eux-m&#234;mes class&#233;s usuellement en deux 
cat&#233;gories :
</p>
<p>&#8226; les agents conversationnels orient&#233;s service, par exemple fournir un service de 
conseil sur un site Internet, telle l&#8217;assistante virtuelle Sarah de PayPal1 ;
</p>
<p>&#8226; les  agents  conversationnels  &#233;ducatifs,  dont  le  but  est  d'aider  l'utilisateur  &#224; 
apprendre.
</p>
<p>Notre travail se concentre sur les agents conversationnels &#233;ducatifs (tutor bots). 
</p>
<p>2 &#201;tat de l'art
Apr&#232;s avoir pos&#233; les d&#233;finitions de base dans la partie pr&#233;c&#233;dente, nous exposerons ici 
bri&#232;vement l'&#233;tat de l'art sur l'architecture des agents conversationnels ainsi que sur les 
syst&#232;mes d'&#233;valuation des r&#233;ponses libres plus en d&#233;tails.
</p>
<p>2.1 Architecture d'un agent conversationnel
La figure 1 montre un exemple d'architecture d'un agent conversationnel. L'utilisateur 
entre  une  phrase  que  l&#8217;agent  conversationnel  convertit  en  un  langage  abstrait,  ici 
Artificial Intelligence Markup Language (AIML) : cette traduction permet d'analyser le 
contenu de la phrase et de faire des requ&#234;tes via un moteur de recherche dans une base 
de connaissances. La r&#233;ponse est g&#233;n&#233;r&#233;e via un langage abstrait, ici &#233;galement AIML, 
qu'il faut traduire en langage naturel avant de la pr&#233;senter &#224; l'utilisateur.
N&#233;anmoins,  cette  architecture  est  rudimentaire  et  tr&#232;s  rigide.  Il  faut  par  exemple 
souvent mettre &#224; jour la base de connaissances pour y inclure des connaissances sur 
l'utilisateur, notamment dans le cadre d'une activit&#233; de tutorat qui n&#233;cessite le suivi des 
acquis  de  l'utilisateur  ainsi  que  de  sa  motivation.  Un  certain  nombre  d&#8217;agents 
conversationnels &#233;ducatifs  ont d&#233;j&#224; &#233;t&#233; con&#231;us et impl&#233;ment&#233;s,  comme (Zhang et al., 
2009), (De Pietro et al., 2005), (Core et al., 2006), (Pilato et al., 2008) ou encore (Fonte 
et al., 2009). 
Diverses architectures ont &#233;t&#233; &#233;labor&#233;es, voici les &#233;l&#233;ments communs &#224; la plupart d&#8217;entre 
1 https://www.paypal-virtualchat.com/
</p>
<p>325</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>elles : 
&#8226; une base de connaissances inh&#233;rente au domaine, objet de l&#8217;application ;
&#8226; un gestionnaire de r&#233;pliques ; 
&#8226; des structures de stockage des &#233;changes sous forme d&#8217;arborescences surtout dans 
</p>
<p>les agents conversationnels &#233;ducatifs con&#231;us dans le cadre d&#8217;un jeu vid&#233;o.
</p>
<p>FIGURE 1 &#8211; Exemple d'architecture d'un agent conversationnel (TutorBot)
Source : (De Pietro et al., 2005).
</p>
<p>Bien  que sa simplicit&#233;  d'utilisation  ainsi  que la  performance relativement bonne des 
agents conversationnels l&#8217;utilisant le rendent attrayant, AIML est un langage tr&#232;s limit&#233; 
qui peut se r&#233;sumer &#224; un simple filtrage par motif, les motifs des inputs (phrases de 
l'utilisateur) et des outputs (r&#233;ponses de l'agent conversationnel) &#233;tant d&#233;finis en grande 
partie par extension et a priori.
</p>
<p>2.2 Syst&#232;mes d'&#233;valuation des r&#233;ponses libres
En parall&#232;le de la recherche sur les agents conversationnels, beaucoup de travaux se 
sont  pench&#233;s  sur  l'&#233;valuation  des  r&#233;ponses  libres,  c'est-&#224;-dire  en  langage  naturel, 
donn&#233;es par des apprenants. Ces travaux sont motiv&#233;s par les r&#233;sultats exp&#233;rimentaux 
montrant  les  limites  des  QCM,  en  tant  qu'outil  d'&#233;valuation  de  la  connaissance  des 
</p>
<p>326</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>apprenants (Whittington et Hunt, 1999), ainsi que sa compl&#233;mentarit&#233; avec les r&#233;ponses 
libres (Anbar, 1991). Par connaissance, nous entendons ici et dans le reste de l'article 
non seulement la capacit&#233; &#224; retranscrire des informations pr&#233;c&#233;demment apprises, mais 
&#233;galement la capacit&#233; &#224; op&#233;rer des raisonnements de base montrant la compr&#233;hension 
du sujet.
Par exemple, (Anbar, 1991) a montr&#233; que les &#233;tudiants qui excellent lors des examens 
oraux auront tendance &#224; avoir des performances m&#233;diocres dans les QCM. Inversement, 
les  r&#233;sultats  aux  QCM ne permettent pas  de pr&#233;dire les performances de l'apprenant 
dans le cadre d'un dialogue en langage naturel. 
Nonobstant ces limitations bien connues des QCM, ces derniers repr&#233;sentent toujours 
l'outil  le  plus  utilis&#233;  pour  les  &#233;valuations  des  apprenants.  Ce  paradoxe  s'explique 
simplement par le co&#251;t beaucoup plus &#233;lev&#233; des m&#233;thodes alternatives : s'il est trivial de 
corriger  automatiquement  les  QCM,  il  n'en  va  pas  de  m&#234;me  des  autres  m&#233;thodes, 
lesquelles n&#233;cessitent, &#233;tant donn&#233;es les techniques actuelles, des interventions humaines 
longues, donc co&#251;teuses.
L'&#233;valuation automatique des r&#233;ponses libres a toutefois &#233;galement ses d&#233;tracteurs, qui 
soulignent  que  le  fait  qu'&#233;valuer  un  essai  est  une  t&#226;che  par  nature  complexe  et 
subjective. Cependant, cette subjectivit&#233; ayant pour cons&#233;quence une variation de notes  
non n&#233;gligeable  parmi  les  correcteurs  humains,  le  syst&#232;me  d'&#233;valuation  automatique 
pourra au moins &#234;tre consistant dans sa subjectivit&#233;.
Les  premi&#232;res  recherches  sur  l'&#233;valuation  automatique  apparurent  il  y  a  une 
cinquantaine d'ann&#233;es. Un des projets remarquables fut le Project Essay Grade, dirig&#233; 
par Ellis  Batten Page &#224; l'universit&#233; Duke (Page, 1968).  Ses travaux se sont bas&#233;s sur 
l'utilisation des caract&#233;ristiques stylistiques de la r&#233;ponse de l'apprenant, tels la taille des 
mots et le nombre de pr&#233;positions, pour pr&#233;dire la note du correcteur humain. Dans ses  
derni&#232;res  exp&#233;riences  (Page,  1995),  ce syst&#232;me semble pr&#233;dire la note du correcteur 
humain plus pr&#233;cis&#233;ment que ne le fait un second correcteur humain.
&#192; la fin des ann&#233;es 1980, une nouvelle technique a &#233;t&#233; d&#233;velopp&#233;e en vue de mieux 
saisir  les  concepts  sous-jacents  &#224;  un  texte :  l'analyse  s&#233;mantique  latente  (LSA) 
(Deerwester et al., 1988 ; Deerwester et al., 1990). Cette technique fut dans un premier 
temps utilis&#233;e dans le cadre de recherche de l'information ;  elle ne fut que plus tard 
appliqu&#233;e &#224; l'&#233;valuation des r&#233;ponses libres. La LSA serait ais&#233;e &#224; r&#233;aliser si un mot ne 
correspondait  qu'&#224;  un  seul  concept,  et  inversement.  N&#233;anmoins,  dans  les  langages 
naturels, un mot peut avoir diff&#233;rentes significations : un mot peut subs&#233;quemment faire 
r&#233;f&#233;rence &#224; diff&#233;rents concepts, faisant ainsi appara&#238;tre une ambigu&#239;t&#233; &#224; l'&#233;chelle du mot. 
La  LSA  utilise  le  contexte  dans  lequel  le  mot  est  utilis&#233;  afin  de  lever  l'ambigu&#239;t&#233;,  
autrement  dit  de  comprendre  &#224;  quel  concept  le  mot  fait  r&#233;f&#233;rence  dans  le  contexte 
donn&#233;.  Par  exemple,  le  mot  vol d&#233;signe  tr&#232;s  certainement  le  concept  de  soustraire 
frauduleusement  le  bien  d'autrui  si  le  mot  est  utilis&#233;  &#224;  proximit&#233;  des  mots  butin et 
d&#233;rober. Par contre, si  mot  vol est proche des mots de  ciel et  oiseau,  vol d&#233;signe alors 
probablement un moyen de locomotion a&#233;rienne. La figure 2 illustre l'objectif de la LSA.
La LSA ne prend pas en compte l'ordre des mots, ni a fortiori les relations syntaxiques 
ou  logiques.  En  outre,  elle  peut  s'av&#233;rer  assez  co&#251;teuse  d'un  point  de  vue 
computationnel.  Malgr&#233;  cela,  des  exp&#233;riences  ont  montr&#233;  que  les  scores  de  qualit&#233; 
</p>
<p>327</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>globale &#224; un essai donn&#233;s par des experts sont moins pr&#233;cis que le score r&#233;sultant d'une 
LSA (Landauer,  1998).  Ce  r&#233;sultat  surprenant  est  n&#233;anmoins  &#224;  relativiser  au  vu des 
limitations de la LSA pr&#233;c&#233;demment mentionn&#233;es et d&#233;pend &#233;videmment des conditions 
de l'exp&#233;rience.
Une approche totalement diff&#233;rente de la LSA a &#233;t&#233; adopt&#233;e par l'Educational Testing 
Service (ETS). ETS est la plus grande organisation priv&#233;e &#224; but non lucratif de mesure et 
d&#8217;&#233;valuation  &#233;ducative  au  monde.  Faisant  passer  plus  de  20  millions  d'examens 
annuellement  (TOEFL,  GRE,  GMAT,  etc.),  ETS  peut  ainsi  avoir  acc&#232;s  &#224;  des  corpus 
consid&#233;rables. Depuis plus d'une vingtaine d'ann&#233;es, son d&#233;partement R&amp;D travaille sur 
des solutions permettant de noter automatiquement les r&#233;ponses des candidats.  Apr&#232;s 
avoir essay&#233; d'utiliser la LSA afin de classifier les r&#233;ponses (Burstein et al., 1996), ETS a 
d&#233;cid&#233; de s'en &#233;loigner pour d&#233;velopper la technologie c-rater (Leacock et al., 2003), C 
pour contenu, qui se focalise sur les r&#233;ponses de petite taille, allant de quelques &#224; une  
centaine  de  mots.  C-rater  se  base  sur  un  pr&#233;-traitement  de  la  r&#233;ponse  suivant 
l'architecture pr&#233;sent&#233;e &#224; la figure 3. Ce pr&#233;-traitement permet de faire appara&#238;tre dans 
la  r&#233;ponse  diverses  caract&#233;ristiques  linguistiques,  tels  les  POS  tags,  les  lemmes  de 
chaque mot ou la pr&#233;sence de n&#233;gation. Ces caract&#233;ristiques linguistiques sont ensuite 
utilis&#233;es pour comparer la r&#233;ponse du candidat avec une r&#233;ponse mod&#232;le &#224; l'aide d'un 
algorithme de d&#233;tection des concepts nomm&#233; Goldmap. Dans un premier temps, Goldmap 
&#233;tait bas&#233; sur un ensemble de r&#232;gles de filtrage par motif d&#233;termin&#233;es de fa&#231;on binaire. 
Bien que cela permettait de comprendre ais&#233;ment les d&#233;cisions, la binarit&#233; des r&#232;gles 
induisait un manque important de flexibilit&#233;. Afin de faire face &#224; ce probl&#232;me, Goldmap 
adopte &#224; pr&#233;sent une approche probabilistique en se basant sur le principe d'entropie 
maximale pour la d&#233;tection des concepts et en int&#233;grant une dizaine de r&#232;gles ad hoc.  
Les r&#233;sultats obtenus semblent prometteurs selon leurs auteurs (Leacock et al., 2003).  
Cependant,  &#224;  notre  connaissance  il  n'existe  pas  &#224;  ce  jour  de  test  de  performance 
standardis&#233; pour comparer les diff&#233;rents syst&#232;mes d'&#233;valuation automatique : il est donc 
difficile de comparer efficacement les diff&#233;rents syst&#232;mes.
</p>
<p>FIGURE 2 &#8211; Objectif de la LSA : trouver les concepts auxquels les mots sont associ&#233;s.
</p>
<p>Outre la LSA et c-rater, il est int&#233;ressant de noter que beaucoup d'articles soulignent les  
apports potentiels de la traduction automatique vers l'&#233;valuation de r&#233;ponses libres. Un 
des  meilleurs  exemples  est  la  m&#233;thode  BLEU  (Papineni  et  al.,  2001).   Con&#231;ue 
originellement  pour  &#233;valuer  et  classer  les  syst&#232;mes  de  traduction  automatique,  la 
</p>
<p>328</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>m&#233;thode BLEU a &#233;t&#233; appliqu&#233;e avec succ&#232;s &#224; l'&#233;valuation de r&#233;ponses libres. La m&#233;thode 
repose sur la comparaison entre le texte candidat  et un ensemble de textes mod&#232;les. 
Appliqu&#233;e  &#224;  la  traduction,  le  texte  candidat  correspond  &#224;  la  sortie  du  syst&#232;me  de 
traduction automatique, et les textes mod&#232;les correspondent &#224; des traductions r&#233;alis&#233;es 
par des experts humains.  La note donn&#233;e par BLEU au texte candidat  se base sur le 
nombre de N-grammes communs entre le texte candidat et les textes mod&#232;les, ce qui 
s'av&#232;re &#234;tre une mesure efficace malgr&#233; sa simplicit&#233;, mais est toutefois tr&#232;s sensible au 
choix d'&#233;criture dans les textes mod&#232;les. Lorsque BLEU est appliqu&#233; &#224; l'&#233;valuation de 
r&#233;ponses libres, le texte candidat correspond alors &#224; la r&#233;ponse de l'apprenant, et les 
textes  mod&#232;les  correspondent  &#224;  des  r&#233;ponses  types  donn&#233;es  par  les  professeurs. 
N&#233;anmoins, BLEU pr&#233;sente des limitations importantes, comme par exemple la mauvaise 
gestion des n&#233;gations : une phrase niant un fait A aurait par exemple presque le m&#234;me 
score qu'une phrase affirmant A.
Au-del&#224;  de  la  m&#233;thode BLEU,  il  est  int&#233;ressant  de  remarquer  que le  domaine  de  la 
traduction ainsi que de l'&#233;valuation cherche le m&#234;me id&#233;al : trouver un formalisme dans 
lequel les faits pourraient &#234;tre exprim&#233;s ind&#233;pendamment de langage.
</p>
<p>FIGURE 3 &#8211; Architecture de c-rater. Source : Sukkarieh et al., 2009.
</p>
<p>329</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Approche
Nous avons vu dans la partie pr&#233;c&#233;dente que beaucoup de travaux se sont pench&#233;s sur 
les syst&#232;mes d'&#233;valuation de r&#233;ponses libres. Dans cette partie, nous mettrons en exergue 
les  particularit&#233;s  de  notre  approche,  en  particulier  les  particularit&#233;s  aff&#233;rentes  &#224; 
l'&#233;valuation de la r&#233;ponse libre &#224; l'aune du QCM sous-jacent ainsi qu'&#224; l'environnement 
de jeu s&#233;rieux.
</p>
<p>3.1 Particularit&#233;s des QCM
Nos travaux ont pour but de donner une note &#224; la r&#233;ponse de l'apprenant. Dans notre 
approche, nous nous distinguons des syst&#232;mes d'&#233;valuation classiques de r&#233;ponses libres 
de par deux points majeurs :
</p>
<p>&#8226; La r&#233;ponse de l'apprenant n'est pas not&#233;e par rapport &#224; des r&#233;ponses mod&#232;les,  
mais est reli&#233;e &#224; un QCM sous-jacent ;
</p>
<p>&#8226; Une interaction est possible avec l'apprenant,  car le syst&#232;me a la forme d'un 
agent conversationnel.
</p>
<p>Ainsi, les recherches se sont pench&#233;es sur l'&#233;valuation de r&#233;ponses libres mais &#224; notre 
connaissance aucune n'a cherch&#233; &#224; &#233;valuer une r&#233;ponse libre &#224; l'aune d'un QCM sous-
jacent. Nous allons donc &#233;laborer des variantes aux techniques habituelles (LSA, BLEU 
et c-rater) afin de les adapter &#224; l'utilisation de QCM.
L'int&#233;r&#234;t d'apparenter la r&#233;ponse de l'utilisateur &#224; un QCM est multiple. D'une part, de  
nombreux  tests  d'&#233;valuation  se  pr&#233;sentent  actuellement  sous  forme  de  QCM :  nous 
pourrions ainsi nous baser directement sur les tests existants. D'autre part, la litt&#233;rature 
sur la g&#233;n&#233;ration automatique de QCM &#224; partir d'ontologie est riche (Papasalouros et al., 
2008) : nous pourrons donc &#224; terme avoir un syst&#232;me complet d'&#233;valuation directement 
&#224; partir des ontologies, voire des supports de cours. Le QCM permet de faire la jonction 
entre la base de connaissances que constitue le cours et les tests donn&#233;s &#224; l'apprenant.
Dans un QCM, l'apprenant choisit une ou plusieurs r&#233;ponses. Outre les choix corrects, il  
existe &#233;galement un certain nombre de choix incorrects. Ces choix incorrects permettent 
de d&#233;tecter la pr&#233;sence d'erreur chez l'apprenant de fa&#231;on active, c'est-&#224;-dire en v&#233;rifiant 
directement si la r&#233;ponse ne contient pas le choix incorrect. Cette d&#233;tection active des 
erreurs est absente de la plupart des syst&#232;mes d'&#233;valuation de r&#233;ponses libres car ces 
derniers ne reposent que sur la comparaison avec des phrases mod&#232;les. Nous pouvons 
par cons&#233;quent identifier ces erreurs alors que les syst&#232;mes classiques ont tendance &#224; les  
ignorer.
Le  fait  que  le  syst&#232;me  soit  sous  la  forme  d'un  agent  conversationnel  nous  permet 
naturellement de faire face plus ais&#233;ment aux situations o&#249; la r&#233;ponse de l'apprenant ne 
r&#233;ussit pas &#224; &#234;tre directement &#233;valu&#233;e par le syst&#232;me : via l'agent conversationnel, une 
nouvelle  question  pourra  &#234;tre  pos&#233;e  &#224;  l'apprenant  afin  de  l'inviter  &#224;  reformuler  ou 
pr&#233;ciser sa r&#233;ponse. Cette interaction avec l'agent conversationnel peut &#234;tre compar&#233;e 
aux tests oraux avec un examinateur humain et permet donc d'&#233;viter les inconv&#233;nients 
&#233;manant des examens &#233;crits classiques qui sont par nature statiques.
</p>
<p>330</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.2 Insertion dans un environnement ludique et s&#233;rieux
La simulation d'un dialogue naturel avec le joueur dans un jeu vid&#233;o date d'une trentaine 
d'ann&#233;es. Le jeu d'aventure King's Quest I: Quest for the Crown d&#233;velopp&#233; par Sierra On-
Line et publi&#233; en 1984 figure parmi les pionniers dans le genre. Ce n'est que r&#233;cemment 
que la modalit&#233; conversationnelle a &#233;t&#233; utilis&#233;e &#224; des fins p&#233;dagogiques,  notablement 
dans le jeu Fa&#231;ade (Mateas et al., 2005), que nous allons tr&#232;s bri&#232;vement pr&#233;senter dans 
le paragraphe suivant.
Dans Fa&#231;ade, le joueur est invit&#233; &#224; un d&#238;ner o&#249; se d&#233;roule un conflit marital  : l'objectif du 
joueur est de r&#233;concilier le couple. Pour cela, le joueur entre des phrases de mani&#232;re 
&#233;crite, et les deux membres du couples r&#233;pondent oralement. La figure 4 montre une 
capture  d'&#233;cran  dans  laquelle  le  joueur  demande  &#224;  la  femme  Grace  si  elle  se  sent 
&#233;nerv&#233;e  vis-&#224;-vis  de  son  mari  Trip.  En  interagissant  ainsi  avec  le  couple,  le  joueur 
apprend &#224; mieux comprendre les relations de couple.
</p>
<p>FIGURE 4 &#8211; Capture d'&#233;cran de jeu Fa&#231;ade. Le joueur interagit avec le couple.
N&#233;anmoins, jusqu'&#224; pr&#233;sent, ce genre de syst&#232;me de dialogue repose essentiellement sur 
le rep&#233;rage de mots cl&#233;s en fonction desquels le sc&#233;nario du jeu s'adapte  et ne fait pas 
appel &#224; un QCM sous-jacent. Afin de nous focaliser sur les aspects agent conversationnel  
et QCM, nous int&#233;grons notre syst&#232;me au sein de la plate-forme Learning Adventure2 
(Carron, 2010).
Learning Adventure est  un environnement ouvert  en 3D,  en ligne  et  multijoueur  o&#249; 
l'apprenant doit r&#233;aliser des qu&#234;tes en r&#233;alisant diverses activit&#233;s qui le font interagir  
avec l'environnement et les autres joueurs. L'accent est mis sur le caract&#232;re immersif du 
jeu,  &#224;  l'instar  des  MMORPG populaires  actuels.  L'interaction  avec  les  autres  joueurs, 
autrement dit avec les autres apprenants, est une dimension importante du jeu car elle  
contribue grandement &#224; la motivation du joueur : le QCM devient pas un jeu solitaire, 
mais un jeu social,  o&#249; entrent alors les m&#233;canismes classiques de motivation par les  
pairs (Dickey, 2007) (Kim et al.,2009).
</p>
<p>2 http://learning-adventure.eu
</p>
<p>331</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Outre la motivation r&#233;sultant de cette collaboration et comp&#233;tition entre les apprenants, 
cette dimension multijoueur peut &#233;galement donner l'occasion pour un tuteur humain 
d'intervenir dans le jeu. Une telle intervention peut avoir plusieurs objectifs : aider les 
apprenants dans les t&#226;ches r&#233;put&#233;es difficiles, renforcer les relations &#233;l&#232;ves-professeur en 
partageant un moment ludique, etc.
La  modalit&#233;  en  ligne  du  jeu  pr&#233;sente  quant  &#224;  elle  de  nombreux  autres  int&#233;r&#234;ts,  en 
particulier s'assurer que le contenu p&#233;dagogique est &#224; jour, suivre ais&#233;ment l'avancement 
des diff&#233;rents apprenants et faciliter le d&#233;ploiement de nouveaux contenus.
La figure 5 illustre un QCM qui appara&#238;t  dans le cadre du jeu. La figure 6 pr&#233;sente  
l'&#233;diteur de sc&#233;narii,  qui  permet notamment d'ajouter  et modifier  ais&#233;ment des QCM 
sans avoir aucune comp&#233;tence informatique particuli&#232;re. Notre syst&#232;me a pour objectif &#224; 
terme de  rendre le  QCM invisible  et  d'utiliser  l'&#233;diteur  de  sc&#233;narii  pour permettre &#224; 
l'enseignant d'inclure les QCM ainsi que les autres &#233;l&#233;ments du sc&#233;nario p&#233;dagogique.
</p>
<p>FIGURE 5 &#8211; Capture d'&#233;cran de la plate-forme Learning Adventure (Carron, 2010)
&#192; l'instar de c-rater d'ETS, nous op&#233;rons un pr&#233;-traitement de la phrase de l'apprenant,  
comme  le  montre  la  figure  3 :  apr&#232;s  une  &#233;tape  liminaire  de  correction  de  surface 
(orthographe,  ponctuation,  etc.),  la  r&#233;ponse est  analys&#233;e lexicalement,  puis  &#233;tiquet&#233;e 
grammaticalement et pars&#233;e, avant de passer &#224; l'&#233;tape de d&#233;sambigu&#239;sation r&#233;f&#233;rentielle 
et d'analyse morphologique.  Comme ces processus sont suppos&#233;s &#234;tre connus chez le 
lecteur,  nous ne les d&#233;taillerons pas ici. Sur le plan technique, ces &#233;tapes (hormis la 
premi&#232;re qui  utilise  le  correcteur Hunspell)  se  basent  essentiellement sur la  librairie  
open-source et gratuite NLTK (Bird et al. 2009) qui offre de nombreuses fonctionnalit&#233;s 
de traitement des langages.
Une fois la r&#233;ponse pr&#233;-trait&#233;e, chaque mot de la r&#233;ponse est d&#233;crit par un ensemble 
</p>
<p>332</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d'attributs. Nous pouvons alors la comparer avec les diff&#233;rentes r&#233;ponses du QCM. Les 
donn&#233;es  extraites  lors  de  la  phase  de  pr&#233;-traitement  contiennent  de  nombreuses 
informations essentielles pour la comparaison, telle la pr&#233;sence de n&#233;gation.
Afin d'accro&#238;tre la robustesse du syst&#232;me, nous envisageons de regrouper les r&#233;sultats  
issus  de  la  comparaison  se  basant  sur  la  r&#233;ponse  pr&#233;-trait&#233;e  avec  les  algorithmes 
statistiques  LSA et  BLEU.  Cette  comparaison multiple  ainsi  que  les  r&#233;sultats  obtenus 
seront expos&#233;s en d&#233;tail dans un futur article, le but du pr&#233;sent article &#233;tant de pr&#233;senter 
globalement les objectifs,  le contexte du probl&#232;me ainsi  que la structure g&#233;n&#233;rale de 
notre syst&#232;me.
Les agents conversationnels classiques n'utilisent que tr&#232;s peu les outils usuels du TALN, 
comme le montre cet exemple suivant issu du site officiel  de Cleverbot.com, qui est 
pourtant un des agents conversationnels les plus r&#233;put&#233;s :
Human: Hi.
Cleverbot: Are you a boy?
Human: Yes I am a boys
Cleverbot: Are you a girl?
</p>
<p>Dans cet exemple, nous voyons que la faute de frappe de l'utilisateur qui a &#233;crit &#171; boys &#187;  
au  lieu  de  &#171;  boy  &#187;  a  manifestement  emp&#234;ch&#233;  l'agent  conversationnel  Cleverbot  de 
comprendre la phrase et de proposer une suite coh&#233;rente au dialogue. 
</p>
<p>FIGURE 6 &#8211; L'&#233;diteur de sc&#233;narii pour Learning Adventure
</p>
<p>333</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>En restreignant le champ s&#233;mantique et en pr&#233;cisant son objectif, nous pouvons ainsi 
int&#233;grer  les  techniques  usuelles  du  TALN  dans  notre  agent  conversationnel  afin  de 
rendre transparents les QCM vis-&#224;-vis de l'apprenant.
Enfin, comme le montre (D&#8217;Mello et al., 2010), l'apprentissage par agent conversationnel 
est am&#233;lior&#233; lorsque la modalit&#233; est orale et non &#233;crite. Par cons&#233;quent, nous utilisons 
Dragon NaturallySpeaking 11, qui est le leader de la reconnaissance vocale et &#233;dit&#233; par 
la  soci&#233;t&#233;  Nuance,  ainsi  que  le  logiciel  AT&amp;T Natural  Voices&#174;  Text-to-Speech  pour 
transmettre les r&#233;ponses de l'agent conversationnel sous forme orale. &#192; noter que ces 
deux logiciels ne sont pas libres. 
</p>
<p>4 Conclusions et perspectives
Cet article a pr&#233;sent&#233; une approche nouvelle pour &#233;valuer les apprenants en se basant 
sur des QCM masqu&#233;s par un agent conversationnel au sein d'un jeu s&#233;rieux. La nature  
interactive du dialogue peut apporter au syst&#232;me d'&#233;valuation une dimension nouvelle, 
permettant notamment de faire des demandes de clarification (Purver et al., 2003).
Une des  difficult&#233;s dans la recherche de syst&#232;mes d'&#233;valuation de r&#233;ponses libres est 
l'absence de benchmarks, absence que certains expliquent par des raisons de propri&#233;t&#233; 
intellectuelle  (Sukkarieh  et  Blackmore,  2009).  Quelles  qu'en  soient  les  raisons,  cette 
lacune est g&#234;nante pour la recherche dans le domaine.
Depuis  quelques  mois,  trois  initiatives  majeures  MITx,  Coursera  et  Udacity  ont  &#233;t&#233; 
lanc&#233;es ; leur objectif est de fournir aux internautes des cours en ligne gratuits, qui ont  
d&#233;j&#224; attir&#233; plus de 100 000 &#233;tudiants. Tous trois reposent en grande partie (en plus des 
tests de programmation dans lesquels le code de l'apprenant est &#233;valu&#233; sur un jeu de 
tests) sur des QCM pour &#233;valuer les apprenants, &#224; d&#233;faut de syst&#232;mes plus efficaces. Or, 
ces QCM sont critiqu&#233;s comme &#233;tant une des limites de ce genre de cours en ligne dont 
l'&#233;valuation est enti&#232;rement automatique afin de pouvoir garantir la gratuit&#233; vis-&#224;-vis 
d'un nombre important d'apprenants. La demande de masquage des QCM est donc tr&#232;s 
importante et continuera de s'accentuer par le nombre croissant de cours en ligne.
Au-del&#224;  des  contextes  d'apprentissage,  un  tel  syst&#232;me pourrait  &#233;galement  &#234;tre utilis&#233; 
dans d'autres domaines comme l'aide personnalis&#233;e, &#224; l'instar de celle fournie par les 
centres d'appel qui est en g&#233;n&#233;ral tr&#232;s script&#233;e, c'est-&#224;-dire suivant des sc&#233;narii tr&#232;s peu 
flexibles, correspondant &#224; un encha&#238;nement de QCM.
</p>
<p>5 Remerciements
Je souhaite particuli&#232;rement remercier mon directeur de th&#232;se Jean-Marc Labat pour ses 
pr&#233;cieux conseils, indispensables &#224; la r&#233;alisation de ce projet, ainsi que la DGA pour son 
soutien financier. Je souhaite &#233;galement remercier Thibault Carron pour ses nombreuses 
id&#233;es ainsi que son aide sur Learning Adventure dont il est un des initiateurs.
</p>
<p>334</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>6 Ree&#769;fee&#769;rences
ALHADEFF,  E.  (2008). Reconciling  Serious  Games  Market  Size  Different  Estimates.  In  
Futurlab Business &amp; Games Magazine  - Num&#233;ro du 9 avril 2008.
BIRD, S., KLEIN, E. et LOPER, E. (2009). Natural Language Processing with Python. O&#8217;Reilly 
Media.
BURSTEIN, J., KAPLAN, R., WOLFF, S. et LU, C. (1996). Using Lexical Semantic Techniques 
to Classify Free-Responses.  In Proceedings of SIGLEX 1996 Workshop, Annual Meeting of  
the Association of Computational Linguistics, University of California, Santa Cruz.
CARRON T.,  MARTY JC.  et TALBOT S.  (2010).  Interactive  Widgets  for  Regulation  in 
Learning Games.  The 10th IEEE  Conference on  Advanced  Learning  Technologies,  Sousse, 
Tunisia.
CORE, M.,  TRAUM, D., LANE, H. C.,  SWARTOUT, W., GRATCH, J., LENT, M. V. et  MARSELLA. 
S.  (2006).  Teaching  negotiation  skills  through  practice  and  reflection  with  virtual 
humans. Simulation 82(11):685&#8211;701, 2006.
D'MELLO, S., GRAESSER, A. et KING, B. (2010). Toward Spoken Human-Computer Tutorial 
Dialogues. Human-Computer Interaction, (4):289--323. 
DE PIETRO,  O.,  M.  DE ROSE et G.  FRONTERA.  (2005).  Automatic  Update  of  AIML 
Knowledge Base in E-Learning Environment.  In  Proceedings of Computers and Advanced  
Technology in Education., Oranjestad, Aruba, August (2005): 29&#8211;31.  
DEERWESTER,  S.,  DUMAIS,  S.,  FURNAS,  G.,  LANDAUER,  T., HARSHMAN,  R., LOCHBAUM K.  et 
STREETER, L. (1988). Brevet (US Patent 4,839,853).
DEERWESTER,  S.,  DUMAIS,  S.,  FURNAS,  G.,  LANDAUER,  T.  et HARSHMAN,  R.,  Indexing  by 
Latent Semantic Analysis. In Journal of the Society for Information Science, vol. 41, no 6, 
1990, p. 391-407.
DICKEY, M. D. (2007). Game design and learning: A conjectural analysis of how massively 
multiple online role-playing games (MMORPGs) foster intrinsic motivation.  Educational  
Technology Research and Development, 55(3), 253&#8211;273.
FLORIDI,  L.,  TADDEO,  M.  et TURILLI,  M.  (2009).  Turing&#8217;s  Imitation  Game:  Still  an 
Impossible Challenge for All Machines and Some Judges&#8211;&#8211;An Evaluation of the 2008 
Loebner Contest. Minds and Machines. Springer.
LANDAUER, T.K., LAHAM, D., REHDER, B. et SCHREINER, M.E. (1997). How Well can Passage 
Meaning  be  Derived  Without  Using  Word  Order?  A  Comparison  of  Latent  Semantic 
Analysis and Humans, in Proceedings of the 19th Annual Conference of the Cognitive Science  
Society.
LEACOCK,  C.  et CHODOROW,  M.  (2003).  C-rater:  Automated  Scoring  of  Short-Answer 
Questions. Computers and Humanities. pp. 389-40.
LOEBNER,  H.  (2003).  Home  Page  of  the  Loebner  Prize  -  The  First  Turing  Test. 
http://www.loebner.net/Prizef/loebner-prize.html [consult&#233;e le 03/03/2012].
KIM, B., PARK, H.  et BAEK, Y. (2009). Not just fun, but serious strategies: Using meta-
</p>
<p>335</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>cognitive  strategies  in  game based  learning.  Computers  &amp;  Education,  52(4),  800-810. 
doi:10.1016/j.compedu.2008.12.004.
MATEAS, M.  et STERN, A.  (2005). Structuring Content in the Fa&#231;ade Interactive Drama 
Architecture. AIIDE.
PAGE, E.B. (1968). The Use of the Computer in Analyzing Student Essays.  International  
Review of Education, 14, 210-224.
PAGE,  E.B.  (1995).  The  Computer  Moves  into  Essay  Grading:  Updating  the  Ancient 
Test, Phi Delta Kappan, 76(Mar), 561-565.
PAPASALOUROS, A.,  KOTIS, K.  et KANARIS, K.  (2008).  Automatic generation of multiple-
choice questionsfrom domain ontologies. IADIS e-Learning, Amsterdam.
PAPINENI,  K., ROUKOS,  S., WARD T. et ZHU, W. (2001).  BLEU: a method for automatic 
evaluation of machine translation. In Proceedings of the 40th annual meeting on Association  
for Computational Linguistics. 311&#8212;318.
PEREZ, D., ALFONSECA, E. et RODRIGUEZ, P. (2004). Application of the BLEU method for 
evaluating free-text answers in an e-learning environment. In Proceedings of the Language  
Resources and Evaluation Conference (LREC).
PILATO, G., ROBERTO P. et RICCARDO R. (2008). A kst-based system for student tutoring. 
Applied Artificial Intelligence 22, no. 4: 283-308.
PURVER, M., GINZBURG, J. et HEALEY, P. (2003). On the means for clarification in dialogue. 
Current and new directions in discourse and dialogue. Springer. 235&#8212;255.
RASTIER, F. (2001). S&#233;mantique et recherches cognitives, PUF (2e &#233;d).
SUKKARIEH, J. Z.  et BLACKMORE, J. (2009). c-rater: Automatic content scoring for  short-
constructed responses. Florida Artificial Intelligence Research Society (FLAIRS) Conference, 
Sanibel, FL.
SAWYER, B. (2004). Serious  Games Market  Size.  Serious Games initiative Forum 01-04-
2004.
THOMAS,  P., &#233;diteurs (2010).  Actes de  RJC EIAH 2010  (Rencontres Jeunes Chercheurs en  
Environnements Informatiques pour l'Apprentissage Humain), Lyon. ATIEF.
VERNANT, D. (1992). Mod&#232;le projectif et structure actionnelle du dialogue informatif. In  
Du dialogue, Recherches sur la philosophie du langage, Vrin &#233;d., Paris, n&#176;14, p. 295-314.
WALLACE. , S. (2009). Parsing the Turing Test, The Anatomy of A.L.I.C.E. Springer.
WHITTINGTON, D. et HUNT, H. (1999). Approaches to the computerized assessment of free 
text responses. In Danson, M. (Ed.), Proceedings of the Sixth International Computer Assisted  
Assessment Conference, Loughborough, UK.
ZHANG, H. L., Z. SHEN, X. TAO, C. MIAO et B. Li. (2009). Emotional agent in serious game 
(DINO). In Proceedings of The 8th International Conference on Autonomous Agents and Multi-
agent Systems-Volume 2, 1385&#8211;1386. 
</p>
<p>336</p>

</div></div>
</body></html>