<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une plate-forme g&#233;n&#233;rique et ouverte pour l&#8217;acquisition des expressions polylexicales</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 137&#8211;149,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Une plate-forme g&#233;n&#233;rique et ouverte pour
l&#8217;acquisition des expressions polylexicales
</p>
<p>Carlos Ramisch
LIG-GETALP, Grenoble, France
</p>
<p>INF-UFRGS, Porto Alegre, Br&#233;sil
Carlos.Ramisch@imag.fr
</p>
<p>R&#201;SUM&#201;
Cet article pr&#233;sente et &#233;value une plate-forme ouverte et flexible pour l&#8217;acquisition automatique
d&#8217;expressions polylexicales (EPL) &#224; partir des corpus monolingues. Nous commen&#231;ons par une
motivation pratique suivie d&#8217;une discussion th&#233;orique sur le comportement et les d&#233;fis pos&#233;s par
les EPL dans les applications de TAL. Ensuite, nous d&#233;crivons les modules de notre plate-forme,
leur encha&#238;nement et les choix d&#8217;impl&#233;mentation. L&#8217;&#233;valuation de la plate-forme a &#233;t&#233; effectu&#233;e &#224;
travers une applications : la lexicographie assist&#233;e par ordinateur. Cette derni&#232;re peut b&#233;n&#233;ficier
de l&#8217;acquisition d&#8217;EPL puisque les expressions acquises automatiquement &#224; partir des corpus
peuvent &#224; la fois acc&#233;l&#233;rer la cr&#233;ation et am&#233;liorer la qualit&#233; et la couverture des ressources
lexicales. Les r&#233;sultats prometteurs encouragent une recherche plus approfondie sur la mani&#232;re
optimale d&#8217;int&#233;grer le traitement des EPL dans de nombreuses applications de TAL, notamment
dans les syst&#232;mes traduction automatique.
</p>
<p>ABSTRACT
An Open and Generic Framework for the Acquisition of Multiword Expressions
</p>
<p>In this paper, we present and evaluate an open and flexible methodological framework for the
automatic acquisition of multiword expressions (MWEs) from monolingual textual corpora. We
start with a pratical motivation followed by a theoretical discussion of the behaviour and of the
challenges that MWEs pose for NLP applications. Afterwards, we describe the modules of our
framework, the overall pipeline and the design choices of the tool implementing the framework.
The evaluation of the framework was performed extrinsically based on an application : computer-
assisted lexicography. This application can benefit from MWE acquisition because the expressions
acquired automatically from corpora can both speed up the creation and improve the quality and
the coverage of the lexical resources. The promising results of previous and ongoing experiments
encourage further investigation about the optimal way to integrate MWE treatment into NLP
applications, and particularly into machine translation systems.
</p>
<p>MOTS-CL&#201;S : Expressions polylexicales, extraction lexicale, lexique, mesures d&#8217;association,
corpus, lexicographie.
</p>
<p>KEYWORDS: Multiword expression, lexical extraction, lexicon, association measures, corpus,
lexicography.
</p>
<p>137</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Le terme expression polylexicale (EPL, en anglais multiword expression) comprend un grand
nombre de ph&#233;nom&#232;nes linguistiques qui engendrent des constructions vari&#233;es telles que les
expressions idiomatiques (payer les yeux de la t&#234;te), les expressions fig&#233;es (a priori), les noms
compos&#233;s (appareil photo), les constructions &#224; verbe support (rendre visite), etc. Il n&#8217;existe pas
une d&#233;finition unique et commun&#233;ment accept&#233;e pour le terme expression polylexicale, car il peut
&#234;tre d&#233;fini comme une &#171; combinaison arbitraire et r&#233;currente de mots &#187; (Smadja, 1993) ou &#171; une
unit&#233; syntaxique et s&#233;mantique dont le sens exact ou la connotation ne peuvent pas &#234;tre d&#233;riv&#233;s
directement et sans ambigu&#239;t&#233; du sens ou de la connotation de ses composantes &#187; (Choueka,
1988) ou simplement comme une &#171; interpr&#233;tation idiosyncrasique qui d&#233;passe la limite du mot
(ou les espaces) &#187; (Sag et al., 2002), avec la propri&#233;t&#233; qu&#8217;elle &#171; doit &#234;tre r&#233;pertori&#233;e dans un
lexique &#187; (Evert, 2004, p 17.).
</p>
<p>La tendance que les mots ont &#224; s&#8217;attirer mutuellement, c&#8217;est-&#224;-dire le ph&#233;nom&#232;ne cl&#233; derri&#232;re
le concept d&#8217;EPL, a lieu dans la zone floue entre le lexique et la grammaire. Cela constitue un
v&#233;ritable d&#233;fi pour les syst&#232;mes de TAL classiques. De plus, les EPL sont omnipr&#233;sentes dans une
langue, figurant fr&#233;quemment dans le langage oral et &#233;crit de tous les jours, ainsi que dans les
communications sp&#233;cialis&#233;es techniques et scientifiques. Parmi les caract&#233;ristiques notables des
EPL d&#233;crites dans la litt&#233;rature, les plus importantes sont :
</p>
<p>&#8211; Caract&#232;re arbitraire : Parfois, des constructions syntaxiquement et s&#233;mantiquement valides
ne sont pas du tout naturelles simplement parce que les locuteurs natifs de la langue ne les
utilisent pas. M&#234;me si ces constructions sont tout &#224; fait compr&#233;hensibles, elles paraissent
&#233;tranges et constituent des marqueurs d&#8217;un usage non natif. Cela rend l&#8217;apprentissage des
EPL difficile pour les apprenants d&#8217;une langue qui, malgr&#233; leur connaissance du lexique et
des r&#232;gles grammaticales g&#233;n&#233;rales, n&#8217;ont pas assez d&#8217;exp&#233;rience sur l&#8217;usage de cette langue.
Smadja (1993, p. 143 &#224; 144) illustre cela en pr&#233;sentant huit fa&#231;ons diff&#233;rentes de se r&#233;f&#233;rer &#224;
l&#8217;indice Dow Jones de la bourse de New York, dont seulement quatre sont acceptables.
</p>
<p>&#8211; Institutionnalisation : Les EPL sont r&#233;currentes, car elles correspondent &#224; des fa&#231;ons habi-
tuelles de s&#8217;exprimer. Jackendoff (1997) estime qu&#8217;elles correspondent &#224; la moiti&#233; des entr&#233;es
du lexique d&#8217;un locuteur natif. Sag et al. (2002) remarquent que cela pourrait &#234;tre une sous-
estimation si l&#8217;on prend en compte les EPLs dans les domaines sp&#233;cialis&#233;es, o&#249; elles constituent
le noyau des connaissances exprim&#233;es et repr&#233;sent&#233;es.
</p>
<p>&#8211; Non-compositionnalit&#233; : Le sens de l&#8217;expression enti&#232;re ne peut pas toujours &#234;tre d&#233;duit
directement des sens de ses parties. Par cons&#233;quent, la compositionnalit&#233; des EPL varie dans
un continuum allant des expressions compl&#232;tement compositionnelles (appareil photo) &#224; celles
qui sont compl&#232;tement opaques/idiomatiques (casser sa pipe).
</p>
<p>&#8211; H&#233;t&#233;rog&#233;n&#233;it&#233; : Les EPLs sont difficiles &#224; d&#233;finir car elles englobent une grande quantit&#233; de
ph&#233;nom&#232;nes. Cela les rend difficiles &#224; traiter par les applications de TAL, qui ne peuvent pas
utiliser une approche unifi&#233;e. Souvent, les applications de TAL utilisent une des multiples
typologies ou sch&#233;mas de classification existants 1.
</p>
<p>&#8211; Non-substituabilit&#233; : Il n&#8217;est pas possible de remplacer une partie d&#8217;une EPL par un mot proche
ou &#233;quivalent (synonyme, hyperonyme, etc). Cette propri&#233;t&#233; motive la notion d&#8217;anti-collocation
(Pearce, 2001), qui correspond &#224; une combinaison de mots maladroite ou inhabituelle (caf&#233;
cors&#233; vs ?caf&#233; consistant).
</p>
<p>1. Par exemple, Smadja (1993) classe les EPL selon leur fonction syntaxique dans la phrase alors que Sag et al. (2002)
les classent en fonction de leur degr&#233; de flexibilit&#233; (syntaxique).
</p>
<p>138</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>enSRC I paid my poor parents a visit
ptTA Eu pago os meus pais pobres uma visita
ptREF Eu fiz uma visita aos meus pobres pais
frTA J&#8217;ai pay&#233; mes pauvres parents une visite
frREF J&#8217;ai rendu visite &#224; mes pauvres parents
enSRC Students pay an arm and a leg to park on campus
ptTA Estudantes pagam bra&#231;o e uma perna para estacionar no campus
ptREF Estudantes pagam os olhos da cara para estacionar no campus
frTA Les &#233;tudiants paient un bras et une jambe pour se garer sur le campus
frREF Les &#233;tudiants paient les yeux de la t&#234;te pour se garer sur le campus
enSRC It shares the translation-invariance and homogeneity properties with the cen-
</p>
<p>tral moment
ptTA Ele compartilha a tradu&#231;&#227;o invari&#226;ncia e propriedades de homogeneidade com
</p>
<p>o momento central
ptREF Ele compartilha as propriedades de invari&#226;ncia por transla&#231;&#227;o e de homoge-
</p>
<p>neidade com o momento central
frTA Il partage la traduction-invariance et propri&#233;t&#233;s d&#8217;homog&#233;n&#233;it&#233; avec le moment
</p>
<p>central
frREF Il partage les propri&#233;t&#233;s d&#8217;invariance par translation et d&#8217;homog&#233;n&#233;it&#233; avec le
</p>
<p>moment central
</p>
<p>TABLE 1 &#8211; Phrases contenant des EPL qui posent probl&#232;me pour un syst&#232;me de TA empirique.
</p>
<p>&#8211; Lexicalisation : Quelque part dans les applications de TAL, l&#8217;information, indiquant qu&#8217;un
ensemble ou s&#233;quence de mots est &#171; indissociable &#187;, doit &#234;tre disponible. Les concepteurs du
syst&#232;me doivent donc choisir l&#8217;endroit o&#249; chaque EPL sera repr&#233;sent&#233;e : on ne peut pas les
&#233;num&#233;rer une &#224; une dans le lexique (sous-g&#233;n&#233;ration), ni toutes les inclure dans les r&#232;gles
de la grammaire comme des combinaisons libres (sur-g&#233;n&#233;ration). Identifier le degr&#233; de
lexicalisation de chaque (classe d&#8217;) EPL est important pour toutes les t&#226;ches d&#8217;analyse et de
g&#233;n&#233;ration en TAL.
</p>
<p>Dans ce travail, nous adoptons la d&#233;finition propos&#233;e par Calzolari et al. (2002), qui d&#233;finissent
les EPL comme :
</p>
<p>. . . diff&#233;rents ph&#233;nom&#232;nes li&#233;s qui peuvent &#234;tre d&#233;crits comme une s&#233;quence [ou
groupe] de mots 2 &#224; voir comme une unit&#233; &#224; un certain niveau d&#8217;analyse linguistique.
</p>
<p>Cette d&#233;finition g&#233;n&#233;rique et volontairement vague peut &#234;tre instanci&#233;e selon les besoins des
applications. Par exemple, le tableau 1 3 montre des erreurs g&#233;n&#233;r&#233;es par un syst&#232;me de traduction
automatique (TA) empirique. Pour ce syst&#232;me, une EPL est une s&#233;quence de mots qui doit &#234;tre
traduite comme une unit&#233;. Sinon, le syst&#232;me g&#233;n&#232;rera des erreurs, c&#8217;est-&#224;-dire des constructions
agrammaticales ou artificielles (phrase 1), des traductions litt&#233;rales maladroites d&#8217;expressions
idiomatiques (phrase 2) et des mauvais choix lexicaux et syntaxiques dans les textes sp&#233;cialis&#233;s
(phrase 3). Dans un syst&#232;me de TA experte, ces EPL seraient typiquement repr&#233;sent&#233;es comme
</p>
<p>2. Cette d&#233;finition est r&#233;ductrice car elle ne consid&#232;re que les s&#233;quences de mots. Nous &#233;tendons la notion de s&#233;quence
vers des groupes de mots, c&#8217;est-&#224;-dire des s&#233;quences contig&#252;es mais aussi des groupes de mots non adjacents li&#233;s
syntaxiquement et/ou s&#233;mantiquement par leur contexte d&#8217;occurrence.
</p>
<p>3. Source en anglais (enSRC) &#224; partir du web. Traductions automatiques (TA) en portugais (pt) et en fran&#231;ais (fr)
fournies par Google Translate (http://translate.google.com/) le 18 f&#233;vrier 2012. Traductions de r&#233;f&#233;rence
(REF) fournies par des locuteur natifs.
</p>
<p>139</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>une entr&#233;e &#224; part enti&#232;re dans le lexique (ou plus pr&#233;cis&#233;ment, dans le dictionnaire de tournures),
sans quoi les m&#234;mes erreurs pourraient survenir.
</p>
<p>Ces exemples illustrent l&#8217;importance de traiter les EPL dans les syst&#232;mes de TA. Plus g&#233;n&#233;ralement,
le traitement d&#8217;EPL peut acc&#233;l&#233;rer et aider &#224; &#233;liminer des ambigu&#239;t&#233;s dans de nombreuses
applications de TAL, par exemple :
&#8211; Lexicographie : Church et Hanks (1990) utilisent un environnement lexicographique comme
</p>
<p>cadre d&#8217;&#233;valuation, en comparant la recherche manuelle et intuitive avec la m&#233;thode automa-
tique propos&#233;e.
</p>
<p>&#8211; Reconnaissance optique de caract&#232;res : Supposons qu&#8217;un syst&#232;me de reconnaissance optique
de caract&#232;res a autant de chances de reconna&#238;tre les mots poule et po&#234;le dans poule/po&#234;le &#233;lev&#233;e
en plein air. La connaissance d&#8217;une EPL utilisant la premi&#232;re option l&#8217;aide &#224; choisir 4.
</p>
<p>&#8211; D&#233;sambigu&#239;sation lexicale : Les EPL ont tendance &#224; &#234;tre moins polys&#233;miques que leurs
composantes isol&#233;es. Finlayson et Kulkarni (2011) illustrent que le mot world poss&#232;de neuf
significations possibles dans WordNet 1.6, record en poss&#232;de quatorze, mais world record en a
seulement une.
</p>
<p>&#8211; &#201;tiquetage morpho-syntaxique et analyse syntaxique : des publications en analyse et &#233;ti-
quetage morpho-syntaxique indiquent que les EPL peuvent aider &#224; &#233;liminer les ambigu&#239;t&#233;s
syntaxiques (Seretan, 2008; Constant et Sigogne, 2011).
</p>
<p>&#8211; Recherche d&#8217;information : Lorsqu&#8217;une EPL telle que pop star est index&#233;e comme une unit&#233;
dans un syst&#232;me de recherche d&#8217;information, la pr&#233;cision du syst&#232;me s&#8217;am&#233;liore (Acosta et al.,
2011).
</p>
<p>&#8211; Apprentissage de langues &#233;trang&#232;res : Puisque les EPL sont tr&#232;s difficiles &#224; apprendre pour
des locuteurs non natifs, les dictionnaires et les ressources p&#233;dagogiques contenant des entr&#233;es
polylexicales peuvent &#234;tre tr&#232;s utiles dans l&#8217;enseignement des langues. Un exemple d&#8217;une telle
ressource est le dictionnaire italien de collocations d&#233;crit par Spina (2010).
</p>
<p>&#8211; Traduction automatique : les exp&#233;riences montrent que l&#8217;inclusion d&#8217;EPL dans les syst&#232;mes
de TA am&#233;liore la qualit&#233; de la traduction (Carpuat et Diab, 2010; Stymne, 2011).
</p>
<p>Cet article porte sur le traitement des EPL, allant de l&#8217;acquisition automatique &#224; leur int&#233;gration
dans des applications. Dans un premier temps, nous pr&#233;sentons un bref tour d&#8217;horizon de la
bibliographie en acquisition automatique d&#8217;EPL (&#167; 2). Dans un deuxi&#232;me temps, nous d&#233;crivons
le mod&#232;le conceptuel et la plate-forme logicielle d&#233;velopp&#233;e pour l&#8217;acquisition des EPL (&#167; 3). Par
la suite, nous pr&#233;sentons la validation de cette plate-forme dans le cadre de la lexicographie
assist&#233;e par ordinateur (&#167; 4). Les exp&#233;riences en cours montrent des r&#233;sultats prometteurs mais
des enqu&#234;tes suppl&#233;mentaires seront n&#233;cessaires pour mieux comprendre les apports des EPL
aux syst&#232;mes de TAL et en particulier aux syst&#232;mes de TA (&#167; 5).
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Plusieurs projets ont eu pour objectif de compiler manuellement des ressources lexicales com-
prenant des EPL. Par exemple, pour le fran&#231;ais, le LADL constitue depuis de nombreuses ann&#233;es
des listes de noms compos&#233;s compatibles avec le formalisme/outil Unitex (Gross, 1986). Ce
formalisme, cependant, pr&#233;sente des avantages et des inconv&#233;nients en ce qui concerne le
</p>
<p>4. En fait, cela se fait souvent &#224; l&#8217;aide des mod&#232;les de langage &#224; n-grammes, mais les n-grammes ne peuvent pas
mod&#233;liser ad&#233;quatement tous les types d&#8217;EPL. Prenons l&#8217;exemple d&#8217;une expression tr&#232;s flexible telle que take patient risk
factors and comfort into account.
</p>
<p>140</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>corpus brut
</p>
<p>corpus
pr&#233;-trait&#233;
</p>
<p>PR&#201;-TRAITEMENT
  * &#201;tiquetage de POS
  * Lemmatisation
  * Analyse de d&#233;pendances
</p>
<p>corpus
index&#233;
</p>
<p>INDEXATION motifs d'extraction
</p>
<p>EPL
candidates
</p>
<p>EXTRACTION DE CANDIDATES
  * n-grammes
  * s&#233;quences de POS 
    (RegExp multi-niveaux)
  * syntaxe
</p>
<p>candidates
filtr&#233;es
</p>
<p>web comme
un corpus
</p>
<p>motifs de
filtrage
</p>
<p>FILTRAGE DE CANDIDATES
  * Comptage
  * Mesures d'association
  * Filtres :
    - Stopwords
    - Motifs
    - Seuils d'occurrence
  * Classement et s&#233;lection
</p>
<p>candidates
valid&#233;es
</p>
<p>VALIDATION
  * &#201;chantillon OU
  * Annotation par un humain OU
  * Comparaison avec r&#233;f&#233;rence
</p>
<p>mod&#232;le 
d'acquisition
</p>
<p>d'EPL
</p>
<p>application
de TALN
</p>
<p>APPRENTISSAGE
</p>
<p>RETRO-APPLICATION
</p>
<p>Gestion
contributive de
</p>
<p>ressource
lexicale
</p>
<p>FIGURE 1 &#8211; Sch&#233;ma du mwetoolkit &#8212; plate-forme d&#8217;acquisition d&#8217;EPL &#224; partir de corpus.
</p>
<p>compromis entre pouvoir d&#8217;expression et temps d&#8217;apprentissage (Gralin&#769;ski et al., 2010). La
compilation manuelle de ressources lexicales &#233;tant tr&#232;s on&#233;reuse, la recherche des derni&#232;res
ann&#233;es s&#8217;est concentr&#233;e sur l&#8217;acquisition automatique des EPL, dans le but d&#8217;acc&#233;l&#233;rer le travail
des lexicographes.
</p>
<p>Parmi les premiers travaux d&#233;veloppant des m&#233;thodes automatiques d&#8217;identification d&#8217;EPL, il y a
celui de Smadja (1993). Il a propos&#233; et d&#233;velopp&#233; l&#8217;outil Xtract pour l&#8217;extraction de collocations
&#224; partir de textes &#224; travers une combinaison de n-grammes et d&#8217;une mesure d&#8217;information
mutuelle. Sur des textes communs, Xtract a une pr&#233;cision de l&#8217;ordre de 80%. Depuis lors, de
nombreux progr&#232;s ont &#233;t&#233; r&#233;alis&#233;s, soit sur l&#8217;extraction d&#8217;EPLs en g&#233;n&#233;ral (Dias, 2003), soit en se
concentrant sur un type d&#8217;EPL sp&#233;cifique, tel que les collocations (Pearce, 2002), les verbes &#224;
particule (Ramisch et al., 2008) et les noms compos&#233;s (Keller et Lapata, 2003).
</p>
<p>Une approche ind&#233;pendante du type devenue tr&#232;s populaire consiste &#224; utiliser des mesures d&#8217;asso-
ciation (Evert et Krenn, 2005), qui ont &#233;t&#233; appliqu&#233;es avec des degr&#233;s variables de succ&#232;s. Un des
avantages de cette approche est qu&#8217;elle est ind&#233;pendante de la langue. Ceci est particuli&#232;rement
important car les travaux sur l&#8217;anglais pr&#233;dominent (Pearce, 2002; Ramisch et al., 2008), m&#234;me
si des travaux sur les EPL dans plusieurs langues ont &#233;t&#233; publi&#233;s, par exemple Dias (2003) pour
le portugais, Evert et Krenn (2005) pour l&#8217;allemand et de Cruys et na Villada Moir&#243;n (2007) pour
le n&#233;erlandais.
</p>
<p>3 Acquisition d&#8217;EPL
</p>
<p>Nous proposons une nouvelle plate-forme, d&#233;crite dans la figure 1. Elle int&#232;gre de multiples
techniques parmi celles cit&#233;es ci-dessus et couvre l&#8217;ensemble du pipeline de l&#8217;acquisition d&#8217;EPL.
Cette plate-forme a &#233;t&#233; mise en &#339;uvre dans un outil libre appel&#233; mwetoolkit 5. Ici, nous ne
r&#233;sumons que les aspects principaux de la plate-forme, qui a &#233;t&#233; d&#233;crite pr&#233;c&#233;demment dans
</p>
<p>5. http://mwetoolkit.sourceforge.net/
</p>
<p>141</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;autres publications (Ramisch et al., 2010a,b; Araujo et al., 2011).
</p>
<p>Le point de d&#233;part de l&#8217;extraction est un corpus monolingue de texte brut. Avant l&#8217;application
du mwetoolkit, il est possible de pr&#233;traiter le corpus, &#224; condition que les outils de pr&#233;traitement
soient disponibles pour la langue cible, en l&#8217;enrichissant avec des &#233;tiquettes morpho-syntaxiques,
des lemmes et de la syntaxe de d&#233;pendance. Pour simplifier la repr&#233;sentation des donn&#233;es,
nous avons choisi d&#8217;utiliser seulement les informations d&#8217;analyse syntaxique qui peuvent &#234;tre
repr&#233;sent&#233;es comme un attribut du mot, excluant ainsi toute forme d&#8217;arborescence. N&#233;anmoins,
il est possible de repr&#233;senter les relations syntaxiques de d&#233;pendance &#224; travers une paire &#9001; type
de relation, mot p&#232;re &#9002; qui attribue &#224; chaque mot le mot dont il d&#233;pend et l&#8217;&#233;tiquette qui d&#233;crit le
type de relation (par exemple, objet direct, modificateur, sujet).
</p>
<p>Ensuite, &#224; l&#8217;aide des connaissances linguistiques d&#8217;experts, de l&#8217;intuition, de l&#8217;observation empi-
rique et/ou des exemples, il faut d&#233;crire les EPL cibles &#224; travers des motifs multiniveaux dans
un formalisme similaire aux expressions r&#233;guli&#232;res. Il est possible d&#8217;utiliser plusieurs niveaux
d&#8217;analyse simultan&#233;ment, par exemple : on veut extraire tous les noms qui sont l&#8217;objet direct du
verbe cuisiner. L&#8217;application de ces motifs sur un corpus index&#233; g&#233;n&#232;re une liste d&#8217;EPL candidates.
</p>
<p>Pour le filtrage, un grand nombre de m&#233;thodes est disponible, allant de simples seuils de
fr&#233;quence &#224; des listes de mots interdits (stopwords), en passant par des mesures d&#8217;association plus
sophistiqu&#233;es. Les mesures d&#8217;association disponibles (score t, coefficient de Dice, information
mutuelle et rapport de vraisemblance) sont, &#224; l&#8217;exception de la derni&#232;re, applicables &#224; des
candidates de longueur arbitraire, ce qui n&#8217;est pas toujours le cas dans les outils de linguistique
de corpus traditionnels.
</p>
<p>Finalement, les candidates r&#233;sultantes filtr&#233;es sont soit directement inject&#233;es dans une appli-
cation de TAL, soit valid&#233;es manuellement avant l&#8217;application. Il est possible de r&#233;utiliser les
candidates pour l&#8217;apprentissage d&#8217;un mod&#232;le. Ce mod&#232;le sera appliqu&#233; sur de nouveaux corpus
afin d&#8217;identifier et d&#8217;extraire automatiquement de nouvelles EPL selon les caract&#233;ristiques de
celles acquises auparavant.
</p>
<p>&#192; ce jour, il n&#8217;y a pas de consensus sur une m&#233;thode optimale d&#8217;acquisition d&#8217;EPL. Il n&#8217;est donc pas
possible de d&#233;terminer s&#8217;il existe une m&#233;thode unique pour toutes les EPL, ou alors s&#8217;il faudrait
chercher une combinaison de m&#233;thodes ou un sous-ensemble de m&#233;thodes qui fonctionne mieux
pour un type d&#8217;EPL en particulier. La plupart des travaux r&#233;cents se concentrent sur l&#8217;extraction
d&#8217;EPL &#224; partir de corpus pr&#233;trait&#233;s (Seretan, 2008) et sur le filtrage automatique et le tri gr&#226;ce &#224;
des mesures d&#8217;association (Evert, 2004; Pecina, 2010), mais peu d&#8217;auteurs fournissent une vue
d&#8217;ensemble de la cha&#238;ne de traitement d&#8217;EPL.
</p>
<p>Un des avantages de la plate-forme et de l&#8217;outil propos&#233;s dans cet article est qu&#8217;ils mod&#233;lisent le
processus d&#8217;acquisition par des t&#226;ches modulaires qui peuvent &#234;tre encha&#238;n&#233;s de plusieurs fa&#231;ons.
Chaque t&#226;che a de multiples techniques disponibles pour leur accomplissement. Par cons&#233;quent,
il est hautement personnalisable et permet un param&#233;trage d&#233;taill&#233; selon les types d&#8217;EPL cibles,
contrairement &#224; des outils similaires tels que NSP 6 et UCS. 7
</p>
<p>De plus, les techniques d&#233;velopp&#233;es ne d&#233;pendent pas d&#8217;une longueur fixe d&#8217;expressions candi-
dates (par exemple, les paires de mots) ni sur l&#8217;hypoth&#232;se de contigu&#239;t&#233;. Gr&#226;ce &#224; cette souplesse,
cette m&#233;thodologie peut &#234;tre facilement appliqu&#233;e &#224; un grand nombre de langues, de types
</p>
<p>6. http://search.cpan.org/dist/Text-NSP
7. http://www.collocations.de/software.html
</p>
<p>142</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;EPL et de domaines, ne d&#233;pendant pas d&#8217;un formalisme donn&#233; ou d&#8217;un outil. 8 Pour une langue
donn&#233;e, si certains outils de pr&#233;traitement tels que les &#233;tiqueteurs morpho-syntaxiques et/ou
analyseurs sont disponibles, il n&#8217;y a pas de raison pour ne pas s&#8217;en servir. Dans ce cas, intuitive-
ment, les r&#233;sultats seront bien meilleurs que sur du texte brut non analys&#233;. Mais comme toutes
les langues ne disposent pas de ces outils, la m&#233;thodologie a &#233;t&#233; con&#231;ue pour &#234;tre appliqu&#233;e
m&#234;me dans le contexte o&#249; aucun outil de pr&#233;traitement n&#8217;est disponible. Dans l&#8217;avenir, nous
voudrions valider cette hypoth&#232;se en r&#233;alisant l&#8217;extraction d&#8217;EPL sur un corpus dans une langue
pauvrement dot&#233;e.
</p>
<p>4 R&#233;sultats
</p>
<p>Ici, nous pr&#233;sentons les r&#233;sultats de l&#8217;&#233;valuation de notre plate-forme dans le cadre de la
lexicographie assist&#233;e par ordinateur. Tout d&#8217;abord, nous introduisons une nouvelle classification
pour les diff&#233;rents axes d&#8217;&#233;valuation de l&#8217;acquisition automatique d&#8217;EPL (&#167; 4.1). Ensuite, nous
r&#233;sumons l&#8217;&#233;valuation quantitative et qualitative extrins&#232;que de la plate-forme d&#8217;acquisition d&#8217;EPL
propos&#233;e pr&#233;c&#233;demment (&#167; 4.2).
</p>
<p>4.1 &#201;valuation de l&#8217;acquisition d&#8217;EPL
</p>
<p>Comme l&#8217;a soulign&#233; Pecina (2005), &#171; l&#8217;&#233;valuation des m&#233;thodes d&#8217;extraction de collocations
est une t&#226;che complexe. D&#8217;une part, les diff&#233;rentes applications exigent diff&#233;rents [. . . ] seuils.
D&#8217;autre part, les m&#233;thodes donnent des r&#233;sultats distincts selon les intervalles de leurs scores
d&#8217;association &#187;. Nous structurons l&#8217;&#233;valuation de l&#8217;acquisition d&#8217;EPL selon les crit&#232;res suivants :
&#8211; Selon la nature des mesures :
</p>
<p>&#8211; Quantitative : consiste &#224; &#233;valuer l&#8217;acquisition &#224; travers des mesures objectives telles que la
pr&#233;cision, le rappel, la F-mesure et la pr&#233;cision moyenne. Alors que de nombreux articles
calculent uniquement la pr&#233;cision sur les premi&#232;res n EPL retourn&#233;es, il faut aussi &#233;valuer
le rappel, ce qui est rarement fait. N&#233;anmoins, cela est d&#8217;une importance capitale dans
l&#8217;attribution de l&#8217;utilit&#233; d&#8217;une m&#233;thode. Une m&#233;thode tr&#232;s pr&#233;cise qui n&#8217;extrait qu&#8217;une
douzaine d&#8217;expressions quand il y a en r&#233;alit&#233; des milliers d&#8217;expressions &#224; r&#233;cup&#233;rer n&#8217;est
pas plus efficace que la force brute ou la recherche manuelle. La quantit&#233; d&#8217;EPL d&#233;couvertes
est un facteur aussi important que leur qualit&#233;, et il est difficile d&#8217;&#233;valuer combien d&#8217;EPL
sont &#171; suffisantes &#187; pour que l&#8217;acquisition automatique soit utile (Villavicencio et al., 2005;
Church, 2011).
</p>
<p>&#8211; Qualitative : le but de l&#8217;&#233;valuation qualitative est d&#8217;obtenir une compr&#233;hension approfondie
des EPL obtenues et des erreurs commises par la m&#233;thode d&#8217;acquisition. Cela consiste &#224;
observer les motifs r&#233;currents en analysant les listes r&#233;sultantes en termes de leur ad&#233;quation
&#224; l&#8217;application cible. Cette &#233;valuation est souvent it&#233;rative, c&#8217;est-&#224;-dire que les am&#233;liorations
possibles sont retro-appliqu&#233;es sur la m&#233;thode d&#8217;acquisition, avec une nouvelle &#233;valuation,
et ainsi de suite.
</p>
<p>&#8211; Selon l&#8217;objectif de l&#8217;acquisition :
</p>
<p>8. Toutefois, la m&#233;thodologie est con&#231;ue pour traiter les langues qui utilisent des espaces pour s&#233;parer les mots. Ainsi,
lorsque l&#8217;on travaille avec du chinois, du japonais, ou m&#234;me avec des noms compos&#233;s en allemand, un pr&#233;traitement
suppl&#233;mentaire est n&#233;cessaire.
</p>
<p>143</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Langue Type Corpus Mots Cand. EPL Publication
</p>
<p>anglais V&#224;P Europarl-frg 13M 5,3K 875 (Ramisch et al., 2012)
grec NC Europarl 26M 5K 815 (Linardaki et al., 2010)
</p>
<p>portugais EV PLN-BR-FULL 29M 407K 773 (Duran et al., 2011)
</p>
<p>TABLE 2 &#8211; Acquisition d&#8217;EPL appliqu&#233;e &#224; la lexicographie assist&#233;e par ordinateur.
</p>
<p>&#8211; Intrins&#232;que : la plupart des r&#233;sultats d&#8217;&#233;valuation publi&#233;s dans les r&#233;f&#233;rences bibliogra-
phiques cit&#233;es dans cet article sont intrins&#232;ques, c&#8217;est-&#224;-dire, ils consid&#232;rent les EPL en
elles-m&#234;mes, directement, en tant que produit final d&#8217;un processus. M&#234;me si elle pr&#233;sente de
nombreuses limitations, l&#8217;&#233;valuation intrins&#232;que donne toujours une estimation de qualit&#233;
qui permet une comparaison inter-m&#233;thodes fiable.
</p>
<p>&#8211; Extrins&#232;que : il est souvent plus facile d&#8217;estimer la qualit&#233; du r&#233;sultat pour une t&#226;che de TAL
concr&#232;te que pour une liste d&#8217;EPL dont on ne connait pas l&#8217;application. Ainsi, l&#8217;&#233;valuation
extrins&#232;que, c&#8217;est-&#224;-dire l&#8217;utilisation des EPL dans une application de TAL ext&#233;rieure, peut
&#234;tre tr&#232;s concluante pour d&#233;montrer si les EPL acquises sont utiles.
</p>
<p>&#8211; Selon le type d&#8217;EPL :
&#8211; Fond&#233;e sur les types : certaines expressions ne sont pas ambigu&#235;s et peuvent &#234;tre annot&#233;es
</p>
<p>hors contexte, comme des entr&#233;es dans un lexique. C&#8217;est souvent le cas quand il s&#8217;agit de
noms compos&#233;s, de termes techniques et de constructions &#224; verbe support. La d&#233;cision de
savoir si une s&#233;quence de mots est une EPL, dans ce type d&#8217;annotation, est ind&#233;pendante du
contexte dans lequel elle appara&#238;t.
</p>
<p>&#8211; Fond&#233;e sur les occurrences : cette annotation doit &#234;tre effectu&#233;e quand les EPL cibles sont
ambigu&#235;s, comme les verbes &#224; particule et les expressions idiomatiques. Hors contexte, il est
impossible de dire si les mots doivent &#234;tre trait&#233;s comme une unit&#233; ou ind&#233;pendamment.
</p>
<p>D&#8217;une part, les r&#233;sultats de ces &#233;valuations intrins&#232;ques sont souvent vagues ou peu concluants.
Bien qu&#8217;ils fassent la lumi&#232;re sur les param&#232;tres optimaux pour un sc&#233;nario donn&#233;, ils sont
difficiles &#224; g&#233;n&#233;raliser et ne peuvent pas &#234;tre directement appliqu&#233;es &#224; d&#8217;autres configurations.
La qualit&#233; des EPL acquises mesur&#233;e par des crit&#232;res objectifs d&#233;pend de la langue, du domaine
et du type de la construction cible, ainsi que de la taille et du genre du corpus, des ressources
d&#233;j&#224; disponibles 9, des filtres appliqu&#233;s, des &#233;tapes de pr&#233;traitement, . . .
</p>
<p>D&#8217;autre part, l&#8217;&#233;valuation extrins&#232;que consiste &#224; ins&#233;rer les EPL acquises dans des applications
de TAL r&#233;elles et &#224; &#233;valuer l&#8217;impact de ces nouvelles donn&#233;es sur la performance globale du
syst&#232;me. Ainsi, une contribution originale du pr&#233;sent travail est l&#8217;application de l&#8217;&#233;valuation
extrins&#232;que de l&#8217;acquisition d&#8217;EPL sur une &#233;tude de cas : la lexicographie assist&#233;e par ordinateur.
Notre objectif &#224; long terme est d&#8217;&#233;tudier (1) quel est l&#8217;impact de ces EPL sur les applications de
TAL en g&#233;n&#233;ral et (2) la (ou les) meilleure(s) m&#233;thodes(s) pour les int&#233;grer dans le pipeline
complexe de l&#8217;application cible.
</p>
<p>9. Il est inutile d&#8217;acqu&#233;rir des EPL d&#233;j&#224; pr&#233;sentes dans le dictionnaire.
</p>
<p>144</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.2 Lexicographie assist&#233;e par ordinateur
</p>
<p>Nous avons travaill&#233; pour cette &#233;valuation en collaboration avec des coll&#232;gues linguistes et
lexicographes exp&#233;riment&#233;s, dans le but de cr&#233;er de nouvelles ressources lexicales contenant des
EPL. Les langues des ressources sont l&#8217;anglais, le grec et le portugais. Le tableau 2 r&#233;sume les
r&#233;sultats de chaque &#233;valuation.
</p>
<p>Nous avons extrait les verbes &#224; particule (V&#224;P) &#224; partir d&#8217;un fragment de la partie anglaise du
corpus Europarl. 10 Nous avons consid&#233;r&#233; un V&#224;P comme &#233;tant form&#233; par un verbe (&#224; l&#8217;exception
de be et have) suivi d&#8217;une particule pr&#233;positionnelle 11 &#233;loign&#233;e d&#8217;au plus 5 mots apr&#232;s le verbe. 12
</p>
<p>Nous avons obtenu 5 302 candidates &#224; V&#224;P qui apparaissent plus d&#8217;une fois dans le corpus.
L&#8217;&#233;valuation de ces candidates a &#233;t&#233; effectu&#233;e de fa&#231;on automatique, en les comparant avec un
dictionnaire de r&#233;f&#233;rence. Parmi les candidates, 875 ont &#233;t&#233; classifi&#233;es comme de v&#233;ritables V&#224;P.
Cette &#233;valuation quantitative et fond&#233;e sur les types est une premi&#232;re &#233;tape d&#8217;une exp&#233;rience en
cours sur l&#8217;int&#233;gration de ces constructions dans un syst&#232;me de traduction automatique.
</p>
<p>Pour le grec, il existe une vaste litt&#233;rature portant sur les propri&#233;t&#233;s linguistiques des EPL,
mais les approches informatiques sont encore limit&#233;es (Fotopoulou et al., 2008). Dans nos
exp&#233;riences, nous avons extrait de la partie grecque du corpus Europarl, &#233;tiquet&#233;e morpho-
syntaxiquement, des noms compos&#233;s (NC) correspondant aux motifs suivants : adjectif-nom,
nom-nom, nom-d&#233;terminant-nom, nom-pr&#233;position-nom, pr&#233;position-nom-nom, nom-adjectif-
nom et nom-conjonction-nom. Les candidates ont &#233;t&#233; compt&#233;es dans deux corpus et class&#233;es par
quatre mesures d&#8217;association. Les premi&#232;res 150 candidates selon chaque mesure d&#8217;association
ont &#233;t&#233; &#233;valu&#233;es intrins&#232;quement par trois locuteurs natifs. Ainsi, chaque annotateur a jug&#233;
environ 1 200 candidates. Finalement, les annotations ont &#233;t&#233; combin&#233;es, entra&#238;nant la cr&#233;ation
d&#8217;un lexique avec 815 EPL nominales en grec.
</p>
<p>L&#8217;objectif du travail avec les expressions verbales (EV) en portugais &#233;tait de r&#233;aliser une ana-
lyse qualitative de ces constructions bien comme de la m&#233;thode d&#8217;acquisition. Nous avons
&#233;tiquet&#233; morpho-syntaxiquement le corpus PLN-BR-Full 13 et ensuite nous avons effectu&#233;
quelques it&#233;rations d&#8217;une phase d&#8217;&#233;valuation qualitative par un lexicographe exp&#233;riment&#233; sui-
vie d&#8217;une nouvelle phase d&#8217;extraction. Finalement, nous avons extrait des s&#233;quences de mots
correspondant aux motifs verbe-[d&#233;terminant]-nom-pr&#233;position, verbe-pr&#233;position-nom, verbe-
[pr&#233;position/d&#233;terminant]-adverbe et verbe-adjectif. Le processus d&#8217;extraction a ainsi conduit &#224;
une liste de 407 014 candidates qui ont ensuite &#233;t&#233; filtr&#233;es avec des mesures d&#8217;association.
</p>
<p>Durant l&#8217;&#233;valuation quantitative fond&#233;e sur les types, un annotateur humain expert a valid&#233;
manuellement 12 545 candidates, parmi lesquelles 699 ont &#233;t&#233; annot&#233;es comme des EV com-
positionnelles et 74 comme des EV idiomatiques. Ensuite, une analyse fine de chaque motif
d&#8217;extraction a &#233;t&#233; r&#233;alis&#233;e dans le but de trouver des corr&#233;lations entre la flexibilit&#233; syntaxique et
les propri&#233;t&#233;s s&#233;mantiques telles que la compositionnalit&#233;. Les retours fournis par le lexicographe
ont montr&#233; que l&#8217;outil est plus flexible et plus efficace que les concordanciers traditionnels, car il
permet d&#8217;identifier des EPL candidates sans fixer une liste pr&#233;-d&#233;finie de verbes support. Ainsi, des
constructions non prototypiques ont pu &#234;tre identifi&#233;es gr&#226;ce &#224; l&#8217;utilisation de notre plate-forme.
</p>
<p>10. http://statmt.org/europarl
11. up, off, down, back, away, in, on.
12. M&#234;me si la particule pourrait appara&#238;tre plus loin que 5 mots apr&#232;s le verbe, de tels cas sont suffisamment rares
</p>
<p>pour &#234;tre ignor&#233;es dans cette exp&#233;rience.
13. www.nilc.icmc.usp.br/plnbr
</p>
<p>145</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 Conclusions et perspectives
</p>
<p>Dans cet article, nous avons d&#233;crit une plate-forme pour l&#8217;acquisition des EPL &#224; partir de
corpus monolingues. La contribution principale de ce travail r&#233;side dans le fait qu&#8217;il repr&#233;sente
une &#233;tape vers l&#8217;int&#233;gration des EPL automatiquement extraites dans des applications r&#233;elles.
Premi&#232;rement, nous avons propos&#233; un cadre m&#233;thodologique unifi&#233;, ouvert et flexible pour
l&#8217;acquisition automatique des EPL. Deuxi&#232;mement, nous avons effectu&#233; une vaste &#233;valuation
de l&#8217;acquisition d&#8217;EPL, afin de diss&#233;quer l&#8217;influence des diff&#233;rents types de ressources utilis&#233;es
dans l&#8217;acquisition sur la qualit&#233; des EPL r&#233;sultantes. De plus, nous avons propos&#233; une nouvelle
taxonomie qui classifie les r&#233;sultats de l&#8217;&#233;valuation d&#8217;acquisition d&#8217;EPL selon trois axes principaux.
</p>
<p>Nous sommes actuellement en train de d&#233;velopper des m&#233;thodes pour l&#8217;int&#233;gration des EPL
verbales acquises automatiquement dans un syst&#232;me de TA empirique. Les EPL verbales sont des
constructions syntaxiquement flexibles. Par cons&#233;quent, elles constituent un d&#233;fi pour les syst&#232;mes
de TA empirique fond&#233;s sur les s&#233;quences de mots. Apr&#232;s quelques exp&#233;riences pr&#233;liminaires, nous
avons constat&#233; le besoin d&#8217;appliquer une m&#233;thode identification fond&#233;e sur la syntaxe. En m&#234;me
temps, nous analysons les alignements lexicaux et les entr&#233;es de la table de traduction du syst&#232;me
sur un ensemble d&#8217;EPL prototypiques, afin de mieux comprendre l&#8217;impact des EPL sur les r&#233;sultats
du syst&#232;me. Enfin, nous voulons r&#233;aliser des exp&#233;riences sur la simplification d&#8217;EPL, par exemple,
le remplacement d&#8217;un verbe polylexical comme come back par sa forme simple regress. Ainsi,
l&#8217;intuition qui veut que l&#8217;on fasse ressembler la langue source &#224; la langue cible facilite la t&#226;che
d&#8217;apprentissage d&#8217;alignements inter-langue (Stymne, 2011). Comme ces am&#233;liorations d&#233;pendent
du paradigme de TA choisi, nous voulons &#233;galement &#233;valuer les strat&#233;gies pour l&#8217;int&#233;gration des
EPL verbales dans les syst&#232;mes de TA experte tels que ITS2 (Wehrli et Ramluckun, 1993) et
Etap-3 (Apresian et al., 2003).
</p>
<p>En d&#233;pit d&#8217;un important effort de recherche dans ce domaine, le traitement d&#8217;EPL dans les
applications de TAL est encore un probl&#232;me ouvert. Bien s&#251;r, ceci n&#8217;est pas vraiment une surprise
dans la mesure o&#249; les linguistes ont d&#233;montr&#233; la complexit&#233; de ce probl&#232;me depuis des d&#233;cennies
(Sag et al., 2002). Au d&#233;but des ann&#233;es 2000, Schone et Jurafsky (2001) ont pos&#233; la question
si l&#8217;identification automatique d&#8217;EPL &#233;tait un probl&#232;me r&#233;solu, et la r&#233;ponse que cet article
apporta &#224; l&#8217;&#233;poque fut n&#233;gative. De m&#234;me, les pr&#233;faces du num&#233;ro sp&#233;cial sur les EPL de la revue
Language Resources and Evaluation (Rayson et al., 2010) et de l&#8217;atelier MWE 2011 (Kordoni
et al., 2011) indiquent que, d&#8217;un point de vue pratique, plusieurs d&#233;fis sont &#224; relever dans le
but d&#8217;obtenir des r&#233;sultats moins artificiels pour les EPL dans les syst&#232;mes de TAL. Nous croyons
que, &#224; long terme, le pr&#233;sent travail de recherche contribuera &#224; la conception d&#8217;applications de
TAL qui int&#232;grent pleinement le traitement des EPL comme une &#233;tape tr&#232;s importante dans la
constitution du lexique et de la grammaire. N&#233;anmoins, &#233;tant donn&#233; la complexit&#233; du probl&#232;me,
ce traitement doit &#234;tre continuellement am&#233;lior&#233;, car ils nous semble peu probable que, dans un
avenir proche, on puisse proposer une solution d&#233;finitive et unifi&#233;e pour le traitement des EPL
dans les applications de TAL.
</p>
<p>146</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Remerciements
</p>
<p>Je remercie mes tuteurs Christian Boitet et Aline Villavicencio, ainsi que les coll&#232;gues qui ont
contribu&#233; activement &#224; ce travail : Evita Linardaki, Magali Sanchez Duran et Vitor De Araujo.
Merci aux r&#233;viseurs pour leurs suggestions et &#224; Antoine Gay pour la relecture. Ce travail est
financ&#233; par une allocation du Minist&#232;re de l&#8217;Enseignement Sup&#233;rieur et de la Recherche et par le
projet CAMELEON (CAPES-COFECUB 707-11).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ACOSTA, O., VILLAVICENCIO, A. et MOREIRA, V. (2011). Identification and treatment of multiword
expressions applied to information retrieval. In (Kordoni et al., 2011), pages 101&#8211;109.
</p>
<p>APRESIAN, J., BOGUSLAVSKY, I., IOMDIN, L. et TSINMAN, L. (2003). Lexical functions as a tool of
ETAP-3. In Proc. of the First MTT Conference (MTT 2003).
</p>
<p>ARAUJO, V. D., RAMISCH, C. et VILLAVICENCIO, A. (2011). Fast and flexible MWE candidate
generation with the mwetoolkit. In (Kordoni et al., 2011), pages 134&#8211;136.
</p>
<p>CALZOLARI, N., FILLMORE, C., GRISHMAN, R., IDE, N., LENCI, A., MACLEOD, C. et ZAMPOLLI, A.
(2002). Towards best practice for multiword expressions in computational lexicons. In Proc. of
the Third LREC (LREC 2002), pages 1934&#8211;1940, Las Palmas, Canary Islands, Spain. ELRA.
</p>
<p>CARPUAT, M. et DIAB, M. (2010). Task-based evaluation of multiword expressions : a pilot study
in statistical machine translation. In Proc. of HLT : The 2010 Annual Conf. of the NAACL (NAACL
2003), pages 242&#8211;245, Los Angeles, California. ACL.
</p>
<p>CHOUEKA, Y. (1988). Looking for needles in a haystack or locating interesting collocational
expressions in large textual databases. In RIAO&#8217;88, pages 609&#8211;624.
</p>
<p>CHURCH, K. (2011). How many multiword expressions do people know ? In (Kordoni et al.,
2011), pages 137&#8211;144.
</p>
<p>CHURCH, K. W. et HANKS, P. (1990). Word association norms mutual information, and lexicogra-
phy. Comp. Ling., 16(1):22&#8211;29.
</p>
<p>CONSTANT, M. et SIGOGNE, A. (2011). MWU-aware part-of-speech tagging with a CRF model
and lexical resources. In (Kordoni et al., 2011), pages 49&#8211;56.
</p>
<p>de CRUYS, T. V. et na VILLADA MOIR&#211;N, B. (2007). Semantics-based multiword expression
extraction. In GREGOIRE, N., EVERT, S. et KIM, S. N., &#233;diteurs : Proc. of the ACL Workshop on A
Broader Perspective on MWEs (MWE 2007), pages 25&#8211;32, Prague, Czech Republic. ACL.
</p>
<p>DIAS, G. (2003). Multiword unit hybrid extraction. In BOND, F., KORHONEN, A., MCCARTHY, D.
et VILLAVICENCIO, A., &#233;diteurs : Proc. of the ACL Workshop on MWEs : Analysis, Acquisition and
Treatment (MWE 2003), pages 41&#8211;48, Sapporo, Japan. ACL.
</p>
<p>DURAN, M. S., RAMISCH, C., ALU&#205;SIO, S. M. et VILLAVICENCIO, A. (2011). Identifying and analyzing
brazilian portuguese complex predicates. In (Kordoni et al., 2011), pages 74&#8211;82.
</p>
<p>EVERT, S. (2004). The Statistics of Word Cooccurrences : Word Pairs and Collocations. Th&#232;se
de doctorat, Institut f&#252;r maschinelle Sprachverarbeitung, University of Stuttgart, Stuttgart,
Germany.
</p>
<p>147</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EVERT, S. et KRENN, B. (2005). Using small random samples for the manual evaluation of
statistical association measures. Comp. Speech &amp; Lang. Special issue on MWEs, 19(4):450&#8211;466.
FINLAYSON, M. et KULKARNI, N. (2011). Detecting multi-word expressions improves word sense
disambiguation. In (Kordoni et al., 2011), pages 20&#8211;24.
FOTOPOULOU, A., GIANNOPOULOS, G., ZOURARI, M. et MINI, M. (2008). Automatic recognition
and extraction of multiword nominal expressions from corpora (in greek). In Proceedings of the
29th Annual Meeting, Department of Linguistics, Aristotle University of Thessaloniki, Greece.
GRALIN&#769;SKI, F., SAVARY, A., CZEREPOWICKA, M. et MAKOWIECKI, F. (2010). Computational lexi-
cography of multi-word units : How efficient can it be ? In (Laporte et al., 2010), pages
1&#8211;9.
</p>
<p>GROSS, M. (1986). Lexicon - grammar the representation of compound words. In Proc. of the
11th COLING (COLING 1986).
JACKENDOFF, R. (1997). Twistin&#8217; the night away. Language, 73:534&#8211;559.
KELLER, F. et LAPATA, M. (2003). Using the web to obtain frequencies for unseen bigrams. Comp.
Ling. Special Issue on the Web as Corpus, 29(3):459&#8211;484.
KORDONI, V., RAMISCH, C. et VILLAVICENCIO, A., &#233;diteurs (2011). Proc.of the ACL Workshop on
MWEs : from Parsing and Generation to the Real World (MWE 2011), Portland, OR, USA. ACL.
LAPORTE, E., NAKOV, P., RAMISCH, C. et VILLAVICENCIO, A., &#233;diteurs (2010). Proc.of the COLING
Workshop on MWEs : from Theory to Applications (MWE 2010), Beijing, China. ACL.
LINARDAKI, E., RAMISCH, C., VILLAVICENCIO, A. et FOTOPOULOU, A. (2010). Towards the construc-
tion of language resources for greek multiword expressions : Extraction and evaluation. In
PIPERIDIS, S., SLAVCHEVA, M. et VERTAN, C., &#233;diteurs : Proc. of the LREC Workshop on Exploitation
of multilingual resources and tools for Central and (South) Eastern European Languages, pages
31&#8211;40, Valetta, Malta. May.
</p>
<p>PEARCE, D. (2001). Synonymy in collocation extraction. In WordNet and Other Lexical Resources :
Applications, Extensions and Customizations (NAACL 2001 Workshop), pages 41&#8211;46.
PEARCE, D. (2002). A comparative evaluation of collocation extraction techniques. In Proc. of
the Third LREC (LREC 2002), Las Palmas, Canary Islands, Spain. ELRA.
PECINA, P. (2005). An extensive empirical study of collocation extraction methods. In Proc. of
the ACL 2005 SRW, pages 13&#8211;18, Ann Arbor, MI, USA. ACL.
PECINA, P. (2010). Lexical association measures and collocation extraction. Lang. Res. &amp; Eval.
Special Issue on Multiword expression : hard going or plain sailing, 44(1-2):137&#8211;158.
RAMISCH, C., ARAUJO, V. D. et VILLAVICENCIO, A. (2012). A broad evaluation of techniques for
automatic acquisition of multiword expressions. In Proc. of the ACL 2012 SRW, Jeju, Republic of
Korea. ACL.
</p>
<p>RAMISCH, C., VILLAVICENCIO, A. et BOITET, C. (2010a). Multiword expressions in the wild ? the
mwetoolkit comes in handy. In LIU, Y. et LIU, T., &#233;diteurs : Proc. of the 23rd COLING (COLING
2010) &#8212; Demonstrations, pages 57&#8211;60, Beijing, China. The Coling 2010 Organizing Committee.
RAMISCH, C., VILLAVICENCIO, A. et BOITET, C. (2010b). mwetoolkit : a framework for multiword
expression identification. In Proc. of the Seventh LREC (LREC 2010), Malta. ELRA.
RAMISCH, C., VILLAVICENCIO, A., MOURA, L. et IDIART, M. (2008). Picking them up and figuring
them out : Verb-particle constructions, noise and idiomaticity. In CLARK, A. et TOUTANOVA, K.,
&#233;diteurs : Proc. of the Twelfth CoNLL (CoNLL 2008), pages 49&#8211;56, Manchester, UK. The Coling
2008 Organizing Committee.
</p>
<p>148</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RAYSON, P., PIAO, S., SHAROFF, S., EVERT, S. et MOIR&#211;N, B. V. (2010). Multiword expressions :
hard going or plain sailing ? Lang. Res. &amp; Eval. Special Issue on Multiword expression : hard going
or plain sailing, 44(1-2):1&#8211;5.
</p>
<p>SAG, I., BALDWIN, T., BOND, F., COPESTAKE, A. et FLICKINGER, D. (2002). Multiword expressions :
A pain in the neck for NLP. In Proc. of the 3rd CICLing (CICLing-2002), volume 2276/2010 de
LNCS, pages 1&#8211;15, Mexico City, Mexico. Springer.
</p>
<p>SCHONE, P. et JURAFSKY, D. (2001). Is knowledge-free induction of multiword unit dictionary
headwords a solved problem ? In LEE, L. et HARMAN, D., &#233;diteurs : Proc. of the 2001 EMNLP
(EMNLP 2001), pages 100&#8211;108, Pittsburgh, PA USA. ACL.
</p>
<p>SERETAN, V. (2008). Collocation extraction based on syntactic parsing. Th&#232;se de doctorat,
University of Geneva, Geneva, Switzerland.
</p>
<p>SMADJA, F. A. (1993). Retrieving collocations from text : Xtract. Comp. Ling., 19(1):143&#8211;177.
</p>
<p>SPINA, S. (2010). The dictionary of italian collocations : Design and integration in an online
learning environment. In Proc. of the Seventh LREC (LREC 2010), Malta. ELRA.
</p>
<p>STYMNE, S. (2011). Pre- and postprocessing for statistical machine translation into germanic
languages. In Proc. of the ACL 2011 SRW, pages 12&#8211;17, Portland, OR, USA. ACL.
</p>
<p>VILLAVICENCIO, A., BOND, F., KORHONEN, A. et MCCARTHY, D. (2005). Introduction to the special
issue on multiword expressions : Having a crack at a hard nut. Comp. Speech &amp; Lang. Special
issue on MWEs, 19(4):365&#8211;377.
</p>
<p>WEHRLI, E. et RAMLUCKUN, M. (1993). ITS-2 : an interactive personal translation system. In Proc.
of the 6th Conf. of the EACL (EACL 1993), page 476, Utrecht, The Netherlands. ACL.
</p>
<p>149</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div>
</div></div>
</body></html>