<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L&#8217;analyse de l&#8217;&#233;motion dans les forums de sant&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 267&#8211;280,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>L&#8217;analyse de l&#8217;&#233;motion dans les forums de sant&#233;
</p>
<p>C&#233;line Batta&#239;a (Doctorante en Sciences de l&#8217;information et de la communication
&#224; l&#8217;universit&#233; Stendhal de Grenoble)
</p>
<p>Groupe de Recherche sur les Enjeux de la Communication (GRESEC), Universit&#233; Stendhal, Laboratoire
</p>
<p>Gresec, Grenoble 3 celine.battaia@u-grenoble3.fr
</p>
<p>R&#201;SUM&#201;
Les travaux sur l&#8217;&#233;motion dans les forums sont nombreux en Linguistique et Psychologie. L&#8217;objectif
de cette contribution est de proposer une analyse de l&#8217;&#233;motion dans les forums de sant&#233; selon
l&#8217;angle des Sciences de l&#8217;Information et de la Communication mais &#233;galement selon une approche
interdisciplinaire. Il s&#8217;agira ici, d&#8217;&#233;tudier l&#8217;&#233;motion comme un crit&#232;re de pertinence lorsque des
personnes malades effectuent des recherches dans les forums.
Ce papier introduit la m&#233;thodologie utilis&#233;e en traitement automatique de la langue afin de
r&#233;pondre &#224; cette interrogation. Ainsi, le travail pr&#233;sent&#233; abordera l&#8217;exploitation d&#8217;un corpus de
messages de forums, la cat&#233;gorisation semi-supervis&#233;e et l&#8217;utilisation du logiciel NooJ pour traiter
de mani&#232;re automatique les donn&#233;es.
</p>
<p>ABSTRACT
Analysis of Emotion in Health Fora
</p>
<p>Studies about emotion in fora are numerous in Linguistics and Psychology. This contribution
approaches this subject from an Information and Communication Sciences point of view, and
studies emotion as a criteron of pertinence for patients in a health forum. This paper introduces
the empirical step of automatic language processing in order to answer this question, and uses
data processing on the corpus of forum messages, semi-supervised categorisation of messages
and use of software NooJ for Natural Language Processing.
</p>
<p>MOTS-CL&#201;S : &#233;motion, forum de sant&#233;, traitement automatique de la langue, d&#233;sambigu&#239;sation
lexicale.
</p>
<p>KEYWORDS: emotion, health forum, automatic language processing, lexical disambiguation.
</p>
<p>267</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>La recherche d&#8217;information peut &#234;tre d&#233;finie comme &#171; l&#8217;activit&#233; d&#8217;un individu qui vise &#224; localiser
et traiter une ou plusieurs informations au sein d&#8217;un environnement documentaire complexe, afin
de r&#233;pondre &#224; une question ou r&#233;soudre un probl&#232;me &#187;(Dinet et Rouet, 2002). Dans le contexte
de la maladie rare, grave, ou chronique, la recherche d&#8217;information est une activit&#233; subordonn&#233;e
&#224; d&#8217;autres objectifs tels que rechercher des informations pratiques, des renseignements sur les
traitements ou encore des contacts avec d&#8217;autres malades (Romeyer, 2008). Pour les Sciences
de l&#8217;Information et de la Communication, la sant&#233; est un domaine illustrant les &#233;volutions du
processus de recherche d&#8217;information (Boub&#233;e et Tricot, 2010). En effet, ce champ &#171; est tellement
important qu&#8217;il influence m&#234;me le domaine de la recherche d&#8217;information en g&#233;n&#233;ral [...] sur &#224;
peu pr&#232;s tous les aspects : besoin d&#8217;information, t&#226;che de recherche d&#8217;information, d&#233;marche de
recherche d&#8217;information, &#233;valuation des sources, etc. &#187;(Boub&#233;e et Tricot, 2010).
Avec le succ&#232;s d&#8217;Internet (Renahy et al., 2007) et plus pr&#233;cis&#233;ment des forums de sant&#233; (Paganelli
et Clavier, 2010), se pose la question de l&#8217;&#233;valuation de l&#8217;information recherch&#233;e. En effet, dans
ces dispositifs, il n&#8217;est pas possible de mobiliser les crit&#232;res de pertinence pr&#233;caunis&#233;s par les
diff&#233;rents mod&#232;les repr&#233;sentant le processus de recherche d&#8217;information (auteur, date, sources,
etc.). Nous nous int&#233;ressons, par cons&#233;quent, aux crit&#232;res de pertinence mobilis&#233;s par les
malades pour valider les informations m&#233;dicales recherch&#233;es dans des forums. En effet, puisqu&#8217;il
n&#8217;est pas possible de mobiliser les crit&#232;res traditonnels tels que la connaissance de l&#8217;auteur, la
source, ou encore l&#8217;ad&#233;quation avec le domaine, nous nous demandons comment les malades
valident les diff&#233;rentes informations trouv&#233;es.
Lors d&#8217;une maladie grave, rare, ou chronique, la motivation des malades &#224; utiliser un forum
de sant&#233; est informationnelle mais &#233;galement &#233;motionnelle (Paganelli et Clavier, 2010). Cela
nous am&#232;ne &#224; nous int&#233;resser &#224; l&#8217;&#233;motion non pas seulement comme raison pour rechercher
de l&#8217;information dans les forums de sant&#233; mais &#233;galement comme crit&#232;re de pertinence pour
&#233;valuer les recherches faites dans dispositifs. &#201;tudier l&#8217;&#233;motion comme crit&#232;re de pertinence
est une approche originale car cela permet de mettre en lumi&#232;re les mutations du processus de
recherche d&#8217;information et &#224; terme, proposer un nouveaux paradigme de recherche d&#8217;information.
</p>
<p>Pour r&#233;pondre &#224; cette question, nous formulons quatres hypoth&#232;ses : a) les malades uti-
lisent le forum de sant&#233; pour des raisons &#233;motionnelles mais &#233;galement parce qu&#8217;il s&#8217;apparente
&#224; un dispositif de recherche d&#8217;information simple &#224; utiliser et non contraignant, b) dans les
forums de sant&#233; l&#8217;&#233;valuation de l&#8217;information se fait de mani&#232;re affective, c) Les malades sont &#224;
la recherche d&#8217;astuces de vie avec la maladie, d)lorsqu&#8217;il y a de l&#8217;information m&#233;dicale, elle est
donn&#233;e sur un ton &#233;motif.
Afin d&#8217;affirmer ou infirmer ces hypoth&#232;ses, nous avons mobilis&#233; deux m&#233;thodes de travail
empirique : une m&#233;thode d&#8217;exp&#233;rimentation-entretien et une m&#233;thode de traitement automatique
de la langue. Dans ce travail, nous pr&#233;senterons d&#8217;abord notre posture th&#233;orique puis la m&#233;thode
de traitement automatique de la langue employ&#233;e. Nous expliciterons, donc, la cat&#233;gorisation
semi-supervis&#233;e utilis&#233;e afin de classer les diff&#233;rents types de messages et l&#8217;utilisation du logiciel
NooJ afin d&#8217;&#233;tudier la proximit&#233; entre des termes &#233;motifs et des termes m&#233;dicaux. Enfin, dans la
derni&#232;re partie nous pr&#233;senterons les premiers r&#233;sultats obtenus.
</p>
<p>268</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 &#201;tat de l&#8217;art
</p>
<p>2.1 Cadre
</p>
<p>Plusieurs mod&#232;les d&#233;crivent les diff&#233;rentes &#233;tapes adopt&#233;es par un utilisateur lors d&#8217;une
recherche d&#8217;information (Barry et Schamber, 1998), (Guthrie, 1988), (Kuhlthau, 1991), etc. Ces
mod&#233;lisations sont majoritairement issues des Sciences de l&#8217;Information et de la Communication
et de la Psychologie Cognitive.
Les Sciences de l&#8217;Information et de la Communication, mettent l&#8217;accent sur le fait que la
recherche d&#8217;information est un processus dans le sens o&#249; il s&#8217;agit d&#8217;une &#171; suite continue de faits
pr&#233;sentant une unit&#233; &#187;(Boub&#233;e et Tricot, 2010). Il s&#8217;agit d&#8217;une activit&#233; dynamique et &#233;volutive
car humaine. Cependant, pour la Psychologie Cognitive, l&#8217;activit&#233; de recherche d&#8217;information
n&#8217;existe pas intrins&#232;quement mais d&#233;pend de contextes d&#8217;utilisation diff&#233;rents. L&#8217;individu r&#233;alise
une t&#226;che et s&#8217;aper&#231;oit qu&#8217;il manque de connaissances pour la mener &#224; bien. Il d&#233;cide donc
de pallier ce manque et de rechercher les informations qui lui font d&#233;fauts. Mais pour cela
il doit poss&#233;der des connaissances sur le contenu qui lui manque car, pour le domaine de la
Psychologie Cognitive, il n&#8217;est pas possible de rechercher une information sans avoir un minimum
de connaissances sur le domaine.
Quelque soit la posture disciplinaire de ces mod&#232;les, tous accordent une place importante
&#224; l&#8217;&#233;valuation de la pertinence de l&#8217;information ou du document s&#233;lectionn&#233;. Ils mettent en
&#233;vidence des crit&#232;res de confiance que les individus doivent utiliser pour leur recherche. Ainsi,
des crit&#232;res tels que l&#8217;ad&#233;quation au th&#232;me recherch&#233;, la clart&#233; des donn&#233;es, la source d&#8217;o&#249;
provient le document, l&#8217;auteur, sont autant d&#8217;indices qui peuvent &#234;tre mobilis&#233;s pour &#233;valuer
l&#8217;information (Barry et Schamber, 1998).
</p>
<p>Cependant, force est de constater que les nouvelles technologies ont transform&#233; les pra-
tiques de recherche d&#8217;information (Boub&#233;e et Tricot, 2010). En effet, diff&#233;rentes enqu&#234;tes
r&#233;alis&#233;es en Europe et aux &#201;tats-Unis, mettent en avant le fait qu&#8217;Internet est de plus en plus
utilis&#233; pour rechercher de l&#8217;information m&#233;dicale (Aube et Tho&#235;r, 2010).
Le champ de la sant&#233; est un domaine dans lequel ces &#233;volutions sont le plus visibles (Boub&#233;e
et Tricot, 2010). Le succ&#232;s de la recherche sant&#233; en ligne est tel que &#171; Google Flu &#187;d&#233;tecte les
&#233;pid&#233;mies de grippe quelques jours avant leur survenue en analysant les requ&#234;tes des malades
(Ginsberg et al., 2008). Pour certains chercheurs, Internet conduirait &#224; trois types de recherche
de la part des personnes malades (Aube et Tho&#235;r, 2010) :
&#8211; une &#171; logique professionnelle &#187; : le malade cherche &#224; obtenir des informations pour lui permettre
</p>
<p>d&#8217;appr&#233;hender la d&#233;cision des m&#233;decins.
&#8211; une &#171; logique consum&#233;riste &#187; : le malade utilise Internet pour confronter les informations sur
</p>
<p>sa maladie, les diff&#233;rents traitements et ainsi faire un choix.
&#8211; une &#171; logique communautaire &#187; : le malade participe &#224; des r&#233;seaux communautaires, tels
</p>
<p>que des forums, o&#249; s&#8217;exercent &#224; la fois &#233;change d&#8217;informations de sant&#233; et informations
personnelles.
</p>
<p>Nous nous int&#233;ressons &#224; cette derni&#232;re logique car, dans les pays occidentaux, les forums de
sant&#233; rencontrent beaucoup de succ&#232;s (Paganelli et Clavier, 2010).
Un forum peut se d&#233;finir comme un dispositif de communication m&#233;diat&#233; par ordinateur,
asynchrone et anonyme (Blanchard, 2007). C&#8217;est un lieux d&#8217;&#233;change o&#249; l&#8217;information est
</p>
<p>269</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>construite collectivement et le contenu auto-structur&#233;. En effet, les participants sont &#224; la fois
producteurs et usagers de l&#8217;information (Clavier et al., 2010). Par cons&#233;quent, l&#8217;inconv&#233;nient
majeur des informations d&#233;livr&#233;es dans un forum, que ce soit des informations sur un utilisateur
ou dans le contenu du message, est l&#8217;impossibilit&#233; de mobiliser les crit&#232;res d&#8217;&#233;valuation
traditionnellement utilis&#233;s, m&#234;me si le forum est h&#233;berg&#233; dans un site fiable. Se pose alors la
question de savoir pourquoi les forums de sant&#233; ont autant de succ&#232;s.
Il appara&#238;t que ce dispositif pr&#233;sente, un double objectif : un soutien informationnel et
&#233;motionnel (Gaglio, 2010), (Paganelli et Clavier, 2010). Avant de poursuivre, il nous semble
important de d&#233;finir ce que nous entendons par &#233;motion car bien que ce concept ait &#233;t&#233; tr&#232;s
&#233;tudi&#233; ces derni&#232;res ann&#233;es, il reste assez difficile &#224; appr&#233;hender de fa&#231;on claire (Novakova et
Tutin, 2009a). Il existe plusieurs syst&#232;mes de d&#233;finitions de l&#8217;&#233;motion. Ainsi, les sp&#233;cialistes ne
sont pas toujours d&#8217;accord sur les d&#233;finitions &#224; adopter. Dans notre travail, nous avons choisi
de traiter de l&#8217;&#233;motion au sens large du terme. Cela signifie que nous englobons l&#8217;&#233;motion
(joie, tristesse, haine, etc.) et les sentiments (amertume, crainte, honte, etc.) (Blumenthal, 2009).
</p>
<p>Pour les Sciences de l&#8217;Information de la Communication, la prise en compte de l&#8217;&#233;mo-
tion dans le processus de recherche d&#8217;information n&#8217;est pas nouveau. N&#233;anmoins, force est de
constater que l&#8217;&#233;motion n&#8217;est &#233;tudi&#233;e que en tant qu&#8217;&#233;motion ressentie par un individu dans
les &#233;tapes de sa recherche ou dans des lieux documentaires. &#192; titre d&#8217;exemple, nous pouvons
citer le mod&#232;le Information Search Process cr&#233;&#233; en 1991 (Kuhlthau, 1991). Contrairement aux
pr&#233;c&#233;dentes mod&#232;lisations du processus de recherche d&#8217;information, celui-ci mettait en &#233;vidence
les r&#244;le des &#233;motions et de la confiance en soi dans les &#233;tapes d&#8217;une recherche documentaire. Le
mod&#232;le ISP se compose de six phases :
</p>
<p>&#8211; une phase d&#8217;initiation qui correspond &#224; l&#8217;apparition d&#8217;une sensation d&#8217;incertitude et d&#8217;attente
informationnelle,
</p>
<p>&#8211; une phase de s&#233;lection o&#249; l&#8217;individu d&#233;finit ce qu&#8217;il veut rechercher et a donc un sentiment
d&#8217;optimisme,
</p>
<p>&#8211; une phase d&#8217;exploration qui correspond &#224; une phase de r&#233;flexion et d&#8217;acquisition d&#8217;information
&#8211; une phase de formulation. Cette &#233;tape correspond &#224; une phase de s&#233;r&#233;nit&#233;, d&#8217;incertitude
</p>
<p>diminu&#233;e et une augmentation de confiance dans sa recherche,
&#8211; une phase de collecte des donn&#233;es qui renforce la confiance de l&#8217;individu au fur et &#224; mesure
</p>
<p>qu&#8217;il trouve des informations,
&#8211; Enfin, une phase de pr&#233;sentation des r&#233;sultats. L&#8217;individu n&#8217;a pas d&#8217;incertitude mais se trouve
</p>
<p>dans un &#233;tat de satisfaction ou d&#8217;insatisfaction.
</p>
<p>Au cours de ces &#233;tapes, l&#8217;individu va chercher &#224; r&#233;duire son principe d&#8217;incertitude. L&#8217;incertitude
est un &#233;tat cognitif vague, difficile &#224; formuler pour l&#8217;individu et souvent accompagn&#233; de
sentiments de confusion ou de frustration (Boub&#233;e et Tricot, 2010).
</p>
<p>Plus r&#233;cemment, d&#8217;autres travaux, se sont interrog&#233;s sur le r&#244;le de l&#8217;&#233;motion dans la d&#233;-
termination des prises de d&#233;cision (Julien et al., 2005) ou encore sur le lien entre contr&#244;le
de l&#8217;&#233;motion et t&#226;che de recherche en ligne (Kim, 2008). Il semblerait qu&#8217;Internet favorise
le lien entre recherche d&#8217;information et &#233;motion (Abbasi et al., 2008). Leur enqu&#234;te met en
avant la richesse &#233;motionnelle des discours sur Internet. Par cons&#233;quent, ces derni&#232;res ann&#233;es,
l&#8217;analyse des sentiments a &#233;t&#233; appliqu&#233; &#224; diff&#233;rentes formes du web et dans diff&#233;rents domaine.
Par exemple, l&#8217;analyse des sentiments dans les forums a d&#233;j&#224; &#233;t&#233; trait&#233; en linguistique mais
dans le but d&#8217;am&#233;liorer la qualit&#233; d&#8217;un syst&#232;me d&#8217;extraction de sentiment gr&#226;ce au traitement
</p>
<p>270</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>automatique de la langue naturelle (Maurel et al., 2008). Plus g&#233;n&#233;ralement, d&#8217;autres travaux en
linguistique cherchent &#224; caract&#233;riser les &#233;motions, &#233;tudient un ou deux champs s&#233;mantiques
de l&#8217;&#233;motion ou encore travaillent sur l&#8217;extraction automatique des affects (Novakova et Tutin,
2009a), (Barb&#233;, 2007). Nous n&#8217;allons pas &#233;tudier l&#8217;&#233;motion de cette mani&#232;re l&#224; mais nous aider
des pr&#233;c&#233;dents travaux pour nous int&#233;resser aux indices &#233;motionnels contenus dans les messages
des forums de sant&#233; et nous demander si l&#8217;&#233;motion peut devenir un crit&#232;re de pertinence.
</p>
<p>2.2 Hypoth&#232;ses
</p>
<p>A/ Les malades ou proches de malades cherchent principalement des astuces de vie avec la
maladie
Les travaux r&#233;alis&#233;s pr&#233;c&#233;demment (Romeyer, 2008), (Lemire, 2009),(Clavier et al., 2010)
mettent en avant le fait que les internautes, et plus pr&#233;cis&#233;ment les malades ou proches de
malades, recherchent principalement des informations pratiques concernant la vie avec la
maladie ; ceux-ci veulent, par exemple, obtenir des astuces sur la gestion des effets secondaires
d&#8217;un m&#233;dicament pour la thyro&#239;de. Or, d&#8217;autres &#233;tudes ont des r&#233;sultats contraires et r&#233;v&#232;lent que :
&#171; Dans son panorama de la &#171; consommation d&#8217;informations &#187;sur l&#8217;Internet m&#233;dical, D. Nabarette
(Nabarette, 2002) y relie cinq buts : s&#8217;informer pour conna&#238;tre (maladies, traitements...), choisir
(praticiens, plans de soins...), superviser l&#8217;action des professionnels, produire (un diagnostic...), se
coordonner dans le cadre de la relation patient/m&#233;decin. Notre enqu&#234;te r&#233;v&#232;le une pr&#233;&#233;minence de la
premi&#232;re cat&#233;gorie (Gaglio, 2010) &#187;.
Il nous semble important de pouvoir d&#233;terminer quel type d&#8217;information vont chercher les
malades dans les forums de sant&#233;. Or, les r&#233;sultats des travaux r&#233;alis&#233;s jusqu&#8217;&#224; pr&#233;sent ne vont
pas toujours dans le m&#234;me sens.
Apr&#232;s une premi&#232;re observation et un croisement des lectures qui ont pu &#234;tre faites, nous
&#233;mettons l&#8217;hypoth&#232;se que les malades sont plut&#244;t &#224; la recherche d&#8217;astuces de vie avec la maladie.
Afin de typer les informations contenues dans notre corpus, nous r&#233;alisons, &#224; l&#8217;aide d&#8217;un
partenariat avec le Laboratoire d&#8217;Informatique d&#8217;Orl&#233;ans, une cat&#233;gorisation semi-supervis&#233;e.
</p>
<p>B/ L&#8217;information m&#233;dicale est donn&#233;e sur un ton &#233;motif
Par information m&#233;dicale nous voulons dire information m&#233;dicale (professionnelle) et
information de sant&#233; (grand public, non sp&#233;cialis&#233;e) (Romeyer, 2008). Plusieurs enqu&#234;tes
telles que celle de Jo&#235;lle Kivits (Kivits, 2006), d&#8217;H&#233;l&#232;ne Romeyer (Romeyer, 2008), ou encore
G&#233;rard Gaglio (Gaglio, 2010) rappellent que la relation avec le praticien ne change pas
dans le sens o&#249; les professionnels de sant&#233; restent les principales sources d&#8217;obtention de
l&#8217;information m&#233;dicale(Vercher et Touboul, 2011). Les forums de sant&#233; ne sont donc pas
des lieux uniquement faits pour &#233;changer de l&#8217;information m&#233;dicale. &#201;tant donn&#233; que le
forum est un lieux d&#8217;&#233;change avec d&#8217;autres malades, nous pensons que les informations
m&#233;dicales sont d&#233;livr&#233;es sur un ton &#233;motif car li&#233; &#224; l&#8217;exp&#233;rience et au ressenti que le ma-
lade &#233;prouve face &#224; la maladie. Afin d&#8217;infirmer ou affirmer cette hypoth&#232;se, nous allons nous
servir du logiciel NooJ et observer la proximit&#233; entre les termes d&#8217;&#233;motion et les termes m&#233;dicaux.
</p>
<p>Les deux hypoth&#232;ses suivantes ne font pas l&#8217;objet d&#8217;un traitement automatique de la
langue mais d&#8217;une exp&#233;rimentation conmpl&#233;t&#233;e par des entretiens. Cela nous permet &#224; la fois de
</p>
<p>271</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#233;passer le biais m&#233;thodologique puisque les entretiens ne sont finalement que des discours sur
leurs pratiques faites par les individus interrog&#233;s, et non l&#8217;observation du processus en train de
se faire (Blanchard, 2007). N&#233;anmoins, nous avons choisi de les &#233;voquer bri&#232;vement, afin de
pr&#233;senter de mani&#232;re approfondie le cadre th&#233;orique sur lequel la recherche est fond&#233;e.
</p>
<p>C/ Motivation des malades &#224; utiliser le forum de sant&#233;
Nous pensons que, outre la dimension &#233;motionnelle et le fait de pouvoir s&#8217;exprimer entre
personnes malades, que l&#8217;on peut retrouver dans d&#8217;autres dispositifs, le forum de sant&#233; donne
l&#8217;impression d&#8217;&#234;tre un outil de recherche d&#8217;information moins contraignant que les autres pour
deux raisons. La premi&#232;re est que l&#8217;on peut poser les questions que l&#8217;on veut sans avoir besoin
de naviguer entre plusieurs sources pour obtenir une r&#233;ponse. Il est &#233;galement possible de
trouver des informations sans avoir besoin de participer, de s&#8217;inscrire. La lecture des messages
suffit. La deuxi&#232;me raison, induite par les observations qui ont pu &#234;tre men&#233;es lors de la
composition du corpus de travail, est que lorsque les malades obtiennent une r&#233;ponse &#224; leur
question ou n&#8217;en ressentent plus le besoin, il est plus facile de ne plus participer au forum.
Nous nous appuyons ici sur les travaux d&#8217;H. Romeyer (Romeyer, 2008). En effet, son enqu&#234;te
de 2008 a r&#233;v&#233;l&#233; que les malades ne cherchent pas a &#233;tablir de lien avec les autres malades.
C&#8217;est la raison pour laquelle nous pensons que d&#232;s qu&#8217;ils ont obtenu satisfaction ou non avec
leur recherche, les malades ne participent plus ou ne lisent plus les messages des forums de sant&#233; .
</p>
<p>D/ &#201;valuation affective de l&#8217;information faite dans les forums de sant&#233;
Nous consid&#233;rons le forum de sant&#233; comme une source d&#8217;information &#224; dimension affective dans
le sens o&#249; les malades partagent aussi bien des informations m&#233;dicales que personnelles (Clavier
et al., 2008), (Clavier et al., 2010), (Paganelli et Clavier, 2010). Les messages sont un m&#233;lange
d&#8217;informations objectives et &#233;motionnelles. Pour nous, l&#8217;&#233;motion change la perception qu&#8217;un
internaute a du message et modifie les crit&#232;res de s&#233;lection habituellement utilis&#233;s. Cela signifie
que les malades s&#8217;attachent aux indices &#233;motionnels contenu dans un message pour l&#8217;&#233;valuer.
Plus un message contiendra d&#8217;indices &#233;motionnels (mots, ponctuation exag&#233;r&#233;e, smileys), plus
les individus auront confiance dans l&#8217;information v&#233;hicul&#233;e. Cela leur donnerait l&#8217;impression
que le message n&#8217;a pas pu &#234;tre invent&#233;. Par cons&#233;quent, nous pensons que plus un message
contiendra des termes &#233;motifs, plus les malades le consid&#232;reront comme vrai, comme digne de
confiance car ils se reconnaissent dans les termes &#233;motifs utilis&#233;s.
</p>
<p>3 M&#233;thodologie du travail empirique
</p>
<p>Dans cette partie, nous pr&#233;sentons la m&#233;thodologie de traitement automatique de la langue
mobilis&#233;e pour r&#233;pondre &#224; nos deux premi&#232;res hypoth&#232;ses (A/ et B/).
Le nombre de forums de sant&#233; francophones existant sur Internet est trop &#233;lev&#233; pour qu&#8217;il soit
possible de les recenser de mani&#232;re exhaustive. Notre parti-pris a donc &#233;t&#233; de les r&#233;pertorier &#224;
l&#8217;aide du Catalogue et Index des Sites M&#233;dicaux de langue Fran&#231;aise (Cismef 1), du site Health On
the Net Foundation (Honcode 2) et via une requ&#234;te sans la zone de recherche de deux moteurs de
recherche. 3. Le Cismef est un projet initi&#233; par le Centre Hospitalier Universitaire de Rouen depuis
</p>
<p>1. http ://www.chu-rouen.fr/cismef/
2. http ://www.hon.ch/HONcode/French/
3. &#171; Forum+sant&#233; &#187;dans Google et Yahoo
</p>
<p>272</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1995. Des documentalistes et m&#233;decins recensent des sites m&#233;dicaux r&#233;pondant au r&#233;f&#233;rentiel
des crit&#232;res de qualit&#233; de l&#8217;information de sant&#233; sur le net (netscoring 4). Le netscoring a &#233;t&#233;
d&#233;velopp&#233; par un groupement de professionnels de sant&#233;, biblioth&#233;caires m&#233;dicaux et juristes.
Le Honcode quant &#224; lui,est financ&#233;e par le Canton de Gen&#232;ve, des projets Europ&#233;ens, la Haute
Autorit&#233; de Sant&#233; de France (HAS) et la fondation Provisu. Sa mission est de guider les utilisateurs
d&#8217;internet vers des sources d&#8217;informations m&#233;dicales et de sant&#233; fiables.
</p>
<p>Les forums accessibles via ces trois types de sources, ont &#233;t&#233; cat&#233;goris&#233;s selon leur sp&#233;cialisation :
forums de sant&#233; g&#233;n&#233;ralistes, sp&#233;cialis&#233;s dans une maladie, mod&#233;r&#233;s, mod&#233;r&#233;s par un m&#233;decin.
Nous avons s&#233;lectionn&#233; des fils de discussion traitant de maladies rares, graves, ou chroniques
car nous pensons qu&#8217;ils sont plus &#224; m&#234;me de fournir &#224; la fois des donn&#233;es informationnelles et
&#233;motionnelles. D&#8217;autre part, il est extr&#234;ment difficile de trouver un forum sp&#233;cialis&#233; sur le rhume
par exemple. Or, nous voulons pouvoir effectuer des comparaisons entre forums g&#233;n&#233;ralistes et
forums sp&#233;cialis&#233;s.
</p>
<p>Nous travaillons sur un corpus de 2481 messages r&#233;pertori&#233;s comme suit :
</p>
<p>&#8211; Forums g&#233;n&#233;ralistes mod&#233;r&#233;s par un m&#233;decin= cat&#233;gorie GD
Forum Atoute (8 fils de discussion, 631 messages)
</p>
<p>&#8211; Forums g&#233;n&#233;ralistes mod&#233;r&#233;s= cat&#233;gorie GM
Forums Au f&#233;minin (1 fil de discussion, 101 messages), Doctissimo (1 fil de discussion, 159
messages), E-sant&#233; (1 fil de discussion, 172 messages) et Sant&#233; m&#233;decine (2 fils de discussion,
150 messages).
</p>
<p>&#8211; Forums sp&#233;cialis&#233;s mod&#233;r&#233;s par un m&#233;decin= cat&#233;gorie SD
Forums Ligue Cancer (6 fils de discussion et 329 messages) et Traitement du pied bot &#224; la
naissance (14 fils de discussions, 292 messages).
</p>
<p>&#8211; Forums sp&#233;cialis&#233;s mod&#233;r&#233;s= cat&#233;gorie SM
Forums maladies Lysosomales (2 fils de discussion, 153 messages), Renaloo (2 fils de discussion,
157 messages), Solhand (3 fils de discussion, 173 messages) Vivre sans thyro&#239;de (1 fil de
discussion, 164 messages).
</p>
<p>Il aurait &#233;t&#233; int&#233;ressant pour notre enqu&#234;te de pouvoir &#233;galement analyser des forums de sant&#233;
non mod&#233;r&#233;s mais nous n&#8217;en avons pas trouv&#233;.
Un traitement semi-automatique (avec le logiciel Python 5) a &#233;t&#233; r&#233;alis&#233; sur notre corpus. Nous
avons en effet, r&#233;pertori&#233; et class&#233; les informations externes au contenu des messages tel que
le titre des fils de discussion, la source, l&#8217;url ou encore le nombre de messages. Nous avons
souhait&#233; traiter ces informations afin de pouvoir effectuer des comparaisons entre les diff&#233;rents
fils de discussion mais &#233;galement afin d&#8217;avoir une trace d&#8217;archivage. Nous avons ensuite cr&#233;&#233; un
filtre Python afin de num&#233;roter automatiquement les messages et de ne conserver que le texte.
L&#8217;inconv&#233;nient majeur est la suppression des smileys car le filtre ne conserve que le texte et non
les images. Les smileys ont ensuite &#233;t&#233; int&#233;gr&#233;s au corpus en tant que signification (par exemple :
SMILEY=SOURIRE).
</p>
<p>4. http ://www.chu-rouen.fr/netscoring/
5. http ://www.python.org/
</p>
<p>273</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.1 Cat&#233;gorisation semi-supervis&#233;e
</p>
<p>La cat&#233;gorisation semi-supervis&#233;e se fait en partenariat avec le Laboratoire d&#8217;Informatique Fonda-
mentale d&#8217;Orl&#233;ans 6. La classification semi-supervis&#233;e est une hybridation entre la classification
supervis&#233;e (ou classification par apprentissage) et la classification par extraction (non-supervis&#233;e).
La classification par apprentissage permet d&#8217;&#233;tablir des classifications &#224; partir de documents
pr&#233;-class&#233;s tandis que, la classification par extraction consiste en une fouille de donn&#233;es. Cela
permet de pallier le nombre trop &#233;lev&#233; de documents en les classant de mani&#232;re automatique.
Faire du semi-supervis&#233; dans le cadre de ce travail, permet d&#8217;orienter la classification et de faire
ainsi du clustering semi-supervis&#233; avec plusieurs vues : lexique, smileys, ponctuation exag&#233;r&#233;e.
L&#8217;objectif est donc de r&#233;pondre &#224; l&#8217;hypoth&#232;se concernant le type d&#8217;information recherch&#233;e par
les malades (hypoth&#232;se A/) et de pouvoir ainsi cat&#233;goriser de mani&#232;re semi-automatique les
messages. L&#8217;originalit&#233; de cette m&#233;thode est &#233;galement de permettre de travailler en parall&#232;le sur
les diff&#233;rentes mani&#232;res de transmettre l&#8217;&#233;motion dans un forum de sant&#233;, &#224; savoir les mots, la
ponctuation et les smileys. En effet, quelques fois l&#8217;&#233;motion n&#8217;est pas transmise par les termes
&#233;motifs.
</p>
<p>Je conduis pour aller au boulot , mais c'est mais arriver de
</p>
<p>m'endormir en voiture apr&#232;s le travail SMILEY=PEUR fatigue .
</p>
<p>Je vais a Cr&#233;teil environ tout les 18 mois comme la maladie
</p>
<p>et stable ( pour le moment ,rien ne dit que sa peut &#233;valuer !!!!!!
</p>
<p>Forum sp&#233;cialis&#233; mod&#233;re Solidarit&#233; Handicap, Fil de discussion Syndrome
</p>
<p>de Poems (num&#233;ro 1), Message SMSH01-0014
</p>
<p>Nous avons, dans un premier temps, cr&#233;&#233; une liste de cat&#233;gories d&#8217;apr&#232;s le compte rendu du
colloque : web participatif et sant&#233; (Paganelli et Clavier, 2010), d&#8217;une exploration de notre
corpus, et de forums de sant&#233; sur Internet. La raison pour laquelle nous avons d&#233;cid&#233; de proc&#233;der
ainsi est que nous ne voulons pas avoir de cat&#233;gories correspondant uniquement &#224; notre corpus
car cela risquerait de fausser les r&#233;sultats.
Une pr&#233;-cat&#233;gorisation manuelle de 586 messages du corpus a ainsi &#233;t&#233; faite et envoy&#233; au
laboratoire d&#8217;Informatique Fondamentale d&#8217;Orl&#233;ans. 9 &#171; items &#187;ont ainsi pu &#234;tre mis en &#233;vidence :
</p>
<p>&#8211; Astuces face &#224; la maladie
</p>
<p>&#8211; Autre
Demande de pr&#233;sentation de soi ou d&#8217;un proche sans &#233;voquer son r&#233;cit de vie, pr&#233;sentation de
soi sans &#233;voquer son r&#233;cit de vie avec la maladie, encouragements sans apports d&#8217;informations,
demande de contact physique ou virtuel, r&#233;ponse &#224; une demande de contact, proposition de
contact sans demande pr&#233;alable dans les autres messages.
</p>
<p>&#8211; Feed Backs
</p>
<p>6. le LIFO
</p>
<p>274</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; Hors sujet
</p>
<p>&#8211; Informations ponctuelles
</p>
<p>&#8211; Informations sur le traitement suivi
</p>
<p>&#8211; Information sur la maladie en g&#233;n&#233;ral
</p>
<p>&#8211; Ressenti vis-&#224;-vis de la maladie
</p>
<p>&#8211; T&#233;moignage
</p>
<p>Ces classes ont ensuite &#233;t&#233; divis&#233;es en sous-cat&#233;gories. Le typage des messages et le corpus de
travail ont ensuite &#233;t&#233; envoy&#233;s au LIFO pour traitement informatique.
</p>
<p>3.2 Traitement automatique de la langue avec NooJ
</p>
<p>Une phase de lemmatisation pr&#233;c&#232;de le traitement du corpus avec NooJ 7. Elle permet de ramener
les termes &#224; leur forme de lemme, mais &#233;galement de corriger les fautes (nombreuses dans les
forums). Lemmatiser le corpus permet, en effet, de mettre en &#233;vidence les fautes puisque le
logiciel ne reconna&#238;tra pas les mots mal orthographi&#233;s et les cat&#233;gorisera comme &#171; unknows &#187;. La
lemmatisation a &#233;t&#233; faite &#224; l&#8217;aide du logiciel Treetagger 8. Ne pas corriger les erreurs auraient
compliqu&#233; l&#8217;analyse du corpus puisque les termes mal orthographi&#233;s n&#8217;auraient pas pu &#234;tre
analys&#233;s par NooJ.
NooJ est un environnement linguistique cr&#233;&#233; en 1993 , d&#8217;abord sous le nom d&#8217;INTEX, par M.
Silberztein (Svetla et al., 2007). Il permet de formaliser les langues naturelles, de d&#233;velopper
des applications de traitement automatique du langage mais &#233;galement de travailler sur de gros
corpus (Yamouni-Aoughlis, 2010).
Afin de pouvoir affirmer ou infirmer notre hypoth&#232;se sur la proximit&#233; de termes &#233;motifs et de
termes m&#233;dicaux (hypoth&#232;se B/), nous avons cr&#233;&#233; des grammaires afin de localiser les adjectifs,
noms et verbes &#233;motifs. La figure 1 pr&#233;sente un extrait de la grammaire faite pour les adjectifs.
</p>
<p>FIGURE 1 &#8211; Extait de la grammaire NAdjectif
</p>
<p>7. http ://www.nooj4nlp.net/pages/nooj.html
8. http ://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger/
</p>
<p>275</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les affects ne constituent pas une classe homog&#232;ne (Novakova et Tutin, 2009b). Certains se
rapprochent des sentiments (par exemple honte), d&#8217;autre des &#233;motions (par exemple peur).
N&#233;anmoins, force est de constater que nous ne travaillons pas sur la cat&#233;gorisation de l&#8217;&#233;motion
en tant que tel. Pour le moment, nous n&#8217;&#233;tudions pas la valeur des termes utilis&#233;s par les
internautes mais nous nous servons de listes de termes &#233;motifs pour analyser la mani&#232;re dont est
transmise l&#8217;information m&#233;dicale. Le but est d&#8217;analyser la proximit&#233; entre les termes &#233;motifs et
les termes m&#233;dicaux. Les trois grammaires (Nadjectif, Nnom et Nverbe) permettent de mettre en
lumi&#232;re les phrases contenant des affects. Une comparaison est ensuite faite afin de v&#233;rifier la
pr&#233;sence ou non de termes m&#233;dicaux transmis aussi bien sous la forme sp&#233;cialis&#233;e (Carcinome &#224;
cellules claires) que sur le mode grand public (Tumeur r&#233;nale).
L&#8217;inconv&#233;nient de cette m&#233;thode est de ne pas pouvoir mettre en lumi&#232;re des expressions ne
mobilisant pas a priori de&#8217;affects mais transmettant n&#233;anmoins une &#233;motion : en avoir gros sur la
patate. Pour pallier ce d&#233;sagr&#233;ment, nous &#233;tablirons une liste d&#8217;expressions refl&#233;tant des &#233;motions
et nous cr&#233;erons une quatri&#232;me grammaire.
</p>
<p>Enfin, il nous semble important de pr&#233;ciser, que les param&#232;tres standarts de Treetagger et NooJ
ont &#233;t&#233; utlis&#233;s pour traiter le corpus.
</p>
<p>4 Premiers r&#233;sultats et discussion
</p>
<p>4.1 Les malades recherchent des t&#233;moignages
</p>
<p>Nous sommes en attente des r&#233;sultats de la cat&#233;gorisation semi-supervis&#233;e. N&#233;anmoins, le typage
manuel transmis au LIFO, nous permet d&#8217;affirmer, &#224; priori, que les malades ne sont pas &#224; la
recherche d&#8217;astuce de vie (un saignement du nez provoqu&#233; par un m&#233;dicament pour le foie).
Les messages analys&#233;s contiennent essentiellement des t&#233;moignages, des r&#233;cits de vie li&#233;s &#224; la
maladie.
En effet, sur 586 messages trait&#233;s, 150 proviennent d&#8217;&#233;changes de t&#233;moignages (17 demandes,
24 apports de t&#233;moignages suite &#224; une demande, 109 apports de t&#233;moignages sans demande
particuli&#232;re au pr&#233;alable).
116 messages sont li&#233;s au ressenti &#233;motionnel vis-&#224;-vis de la maladie, 95 correspondent &#224; des
demandes de contact et/ou encouragments, 93 concernent des &#233;changes d&#8217;information sur les
traitements, 66 sont hors sujet. 47 messages sont des retours sur les r&#233;ponses (feedback), 46
concernent des &#233;changes d&#8217;informations ponctuelles, d&#8217;astuce de vie et 19 &#233;changes traitent de la
maladie en g&#233;n&#233;ral.
Il s&#8217;agit majoritairement d&#8217;&#233;changes de t&#233;moignages et de ressentis avec la maladie. Cela confirme
l&#8217;affirmation de C&#233;line Paganelli et Viviane Clavier (Paganelli et Clavier, 2010), &#224; savoir que les
motivations des malades sont d&#8217;ordre &#233;motionnel. Par contre cela remet en cause les travaux
faits par (Clavier et al., 2010) puisque les r&#233;sultats de leur &#233;tude montrent que les malades sont
plut&#244;t &#224; la recherche d&#8217;astuce de vie avec la maladie.
Le traitement entier du corpus doit &#234;tre attendu pour g&#233;n&#233;raliser les r&#233;sultats. N&#233;anmoins
les premi&#232;res donn&#233;es montreraient que les malades n&#8217;utilisent pas les forums dans un but
informationnel. Ces r&#233;sultats doivent &#234;tre mis en parrall&#232;le avec la th&#232;se r&#233;alis&#233;e par (S&#233;nis,
2003), pour qui les malades restent attach&#233;s au monde m&#233;dical pour valider les informations
recherch&#233;es sur Internet. Cela expliquerait &#233;galement un autre de ses r&#233;sultats, &#224; savoir que les
</p>
<p>276</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>patients sont hostiles &#224; la pr&#233;sence de m&#233;decins comme intervenants dans les forums. Ce ne sont
pas, pour eux des lieux de recherche mais d&#8217;&#233;change de leur vie.
</p>
<p>4.2 L&#8217;information m&#233;dicale n&#8217;est pas donn&#233;e sur un ton &#233;motif
</p>
<p>La question de l&#8217;&#233;motion dans les forums est majoritairement trait&#233;e selon une approche com-
municationnelle dichotomisante. Ce type de communication favoriserait l&#8217;&#233;mergence d&#8217;une
communication &#233;motive entre &#233;crit et oral (ponctuation exag&#233;r&#233;e, smileys)tandis que, &#224; l&#8217;inverse,
d&#8217;autres &#233;tudes consid&#232;rent que la communication dans les forums et plus g&#233;n&#233;ralement la
communication m&#233;diatis&#233;e par ordinateur, entraverait la communication &#233;motionnelle (Atifi
et al., 2010). Les premiers r&#233;sultats obtenus avec l&#8217;analyse du corpus par NooJ, confirment la ca-
t&#233;gorisation semi-supervis&#233;e du contenu et laissent &#224; penser que la communication &#233;motionnelle
exite bien mais elle est r&#233;serv&#233;e aux t&#233;moignages, aux exp&#233;riences de vie avec la maladie et non
avec la diffusion d&#8217;informations m&#233;dicales. Ainsi, sur 200 messages analys&#233;s, 153 contiennent de
l&#8217;&#233;motion que cela soit par les smileys, les mots ou la ponctuation exag&#233;r&#233;e :
</p>
<p>Ma m&#232;re se fait op&#233;rer mercredi et depuis 2 jours,
</p>
<p>comme vous, son moral est au plus bas.
</p>
<p>Elle angoisse et est tr&#232;s n&#233;gative.
</p>
<p>Heureusement elle n'a ni vertige ni maux
</p>
<p>de t&#234;te mais elle est tr&#232;s fatigu&#233;e
</p>
<p>Forum G&#233;naraliste Mod&#233;re par un m&#233;decin Atoute,
</p>
<p>Fil de discussion Op&#233;ration d'un m&#233;ningiome, Message GDAT02-0002
</p>
<p>Sur les 57 messages restants, 22 messages contiennent des informations objectives comme des
informations pratiques par exemple et seulement 35 messages contiennent des informations
m&#233;dicales. D&#8217;apr&#232;s nos premiers r&#233;sultats, les informations m&#233;dicales ne semblent pas &#234;tre
transmises sur un ton &#233;motionnel :
</p>
<p>mon m&#233;decin me prescrit un scanner et le 5 Juillet : m&#233;ningiome
</p>
<p>4 x 3,5 x 2,5 avec &#247;d&#232;me. Premier contact avec un
</p>
<p>chirurgien de la Piti&#233;-Salp&#233;tri&#232;re (en vacance) RDV pour
</p>
<p>consultation le 11/8, diagnostique : op&#233;ration pour le 30
</p>
<p>Ao&#251;t. Je suis entr&#233;e &#224; l'h&#244;pital le 29 car j'avais pass&#233; les
</p>
<p>examens demand&#233;s chez moi. Le 29 au soir double douche avec
</p>
<p>shampooing &#224; la B&#233;tadine, l&#233;ger somnif&#232;re et le lendemain
</p>
<p>matin 6H.
</p>
<p>Forum G&#233;naraliste Mod&#233;re par un m&#233;decin Atoute,
</p>
<p>Fil de discussion Op&#233;ration d'un m&#233;ningiome, Message GDAT02-0006
</p>
<p>277</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les donn&#233;es recuillies, donnent l&#8217;impression que l&#8217;&#233;motion est vraiment r&#233;serv&#233;e &#224; l&#8217;apport
d&#8217;informations personnelles. On peut alors s&#8217;interroger sur l&#8217;&#233;motion comme crit&#232;re de pertinence.
En effet, cela laisse &#224; penser que les individus ont peur de ne plus &#234;tre cr&#233;dibles s&#8217;ils d&#233;livrent
une information m&#233;dicale avec beaucoup d&#8217;&#233;motion. Le forum de sant&#233; serait, avant d&#8217;&#234;tre un
lieu de recherche d&#8217;information, un dispositif de maintien de lien entre des personnes vivant la
m&#234;me exp&#233;rience de maladie.
</p>
<p>5 Conclusion
</p>
<p>Ce travail s&#8217;int&#233;resse &#224; l&#8217;analyse de l&#8217;&#233;motion dans l&#8217;&#233;tude des pratiques de recherche d&#8217;infor-
mation, que les sp&#233;cificit&#233;s propres aux forums font &#233;voluer (Paganelli et Clavier, 2010) et
tout particuli&#232;rement dans le domaine de la sant&#233; o&#249; la fiabilit&#233; des informations m&#233;dicales
recherch&#233;e est difficilement v&#233;rifiable pour des malades. C&#8217;est la raison pour laquelle il est
int&#233;ressant d&#8217;&#233;tudier comment l&#8217;&#233;motion peut devenir un crit&#232;re de pertinence.
</p>
<p>La m&#233;thodologie pr&#233;sent&#233;e dans l&#8217;article a mis en &#233;vidence que les malades semblent
plut&#244;t &#234;tre &#224; la recherche de r&#233;cit de vie avec la maladie. Les conversations, lorsqu&#8217;elles
concernent la maladie en elle-m&#234;me sont plus objectives. L&#8217;&#233;motion intervient lorsqu&#8217;il s&#8217;agit
d&#8217;&#233;change plus personnels sur la vie avec la maladie. Les premiers r&#233;sultats nous laissent &#224;
penser que l&#8217;&#233;motion n&#8217;est pas un crit&#232;re de pertinence en tant que tel car elle n&#8217;intervient pas
dans les &#233;changes d&#8217;informations m&#233;dicales mais dans l&#8217;&#233;change de t&#233;moignages, de ressenti
vis-&#224;-vis de la maladie. Cela confirme les r&#233;sultats de l&#8217;enqu&#234;te men&#233;e par (Clavier et al., 2008), &#224;
savoir que les malades ne viennent pas pour rechercher des informations m&#233;dicales stricto sensu
mais pour partager leur exp&#233;rience avec la maladie. La mutation du processus de recherche
d&#8217;information interviendrait dans le sens o&#249; des personnes recherchent des informations filtr&#233;es
par l&#8217;exp&#233;rience de l&#8217;individu et non plus des informations objectives. N&#233;anmoins, les r&#233;sultats
sont &#224; compl&#233;ter par la continuation du travail de terrain (cat&#233;gorisation semi-supervis&#233;e et
traitement NooJ de tout le corpus), mais &#233;galement par la phase d&#8217;exp&#233;rimentation-entretien
afin d&#8217;appr&#233;hender le discours des malades mais aussi leur mani&#232;re de faire.
</p>
<p>Remerciements
</p>
<p>Un grand merci &#224; Julien Corman qui a lemmatis&#233; le corpus de travail avec Treetagger et &#224; Agn&#232;s
Tutin pour nous avoir transmis les listes de termes &#233;motifs.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABBASI, A., CHEN, H. et SALEM, A. (2008). Sentiment analysis in multiple languages : Feature
selection for opinion classification in web forums.
</p>
<p>278</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ATIFI, H., GAUDUCHEAU, N. et MARCOCCIA, M. (2010). L&#8217;expression et le r&#244;le des &#233;motions dans
les forums de discussion. In YASRI-LABRIQUE, E., &#233;diteur : Les forums dediscussion : agora du
XXI&#232;me si&#232;cle ? Th&#233;orie, enjeux et pratiques discursives, pages 71&#8211;87. Paris.
</p>
<p>AUBE, S. et THO&#203;R, C. (2010). La construction des savoirs relatifs aux m&#233;dicaments sur internet :
&#233;tude exploratoire d&#8217;un forum sur les produits amaigrissants utilis&#233;s sans supervision m&#233;dicale.
In RENAUD, L., &#233;diteur : Les m&#233;dias et la sant&#233; : de l&#8217;&#233;mergence &#224; l&#8217;appropriation des normes sociales,
pages 239&#8211;266. Qu&#233;bec.
</p>
<p>BARB&#201;, M. (2007). Analyses linguistiques et mod&#233;lisations des connaissances en vue d&#8217;un traitement
automatique des e-mails entrants : vers un syst&#232;me de veille dans le tourisme a&#233;rien.
</p>
<p>BARRY, L. C. et SCHAMBER, L. (1998). User&#8217;s criteria for relevance evaluation : a cross-situational
comparison. Information Processing and Management, 34(2-3):219&#8211;236.
</p>
<p>BLANCHARD, G. (2007). La communication politique partisane sur Internet : des pratiques et des
strat&#233;gies nouvelles ?
</p>
<p>BLUMENTHAL, P. (2009). Les noms d&#8217;&#233;motion : trois syst&#232;mes d&#8217;ordre. In NOVAKOVA, I. et TUTIN,
A., &#233;diteurs : Le lexique des &#233;motions, pages 41&#8211;79. Grenoble.
</p>
<p>BOUB&#201;E, N. et TRICOT, A. (2010). Qu&#8217;est-ce-que rechercher de l&#8217;information ? : &#233;tat de l&#8217;art, page
204. Villeurbanne.
</p>
<p>CLAVIER, V., PAGANELLI, C., MANES-GALLO, M.-C., MOUNIER, E., ROMEYER, H. et STAII, A. (2010).
Dynamiques interactionnelles et rapport &#224; l&#8217;information dans les forums de discussion m&#233;dicale.
In MILLERAND, F. e. a., &#233;diteur : Web social : mutation de la communication, pages 297&#8211;314.
Qu&#233;bec.
</p>
<p>CLAVIER, V., PAGANELLI, C., MANES-GALLO, M.-C., MOUNIER, E., ROMEYER, H. et STAII, A. (Qu&#233;bec
6-7 mai 2008). Web participatif et sant&#233; : de nouveaux rapports &#224; l&#8217;information ? In Web
participatif : mutation de la communication ?
</p>
<p>DINET, J. et ROUET, J.-F. (2002). La recherche d&#8217;information : processus cognitifs,facteurs de
difficult&#233;s et dimension de l&#8217;expertise. In PAGANELLI, C., &#233;diteur : Interaction Homme-Machine et
recherche d&#8217;information, pages 113&#8211;161. Paris.
</p>
<p>GAGLIO, G. (2010). Consommation d&#8217;informations sur internet et modulation de la relation aux
m&#233;decins. le cas d&#8217;aidantes de malades atteints d&#8217;une pathologie lourde. Sociologies Pratiques,
1(20):63&#8211;74.
</p>
<p>GINSBERG, J., MOHEBBI, M.-H., P. R.-S. B. L., SMOLINSKI, M.-S. et BRILLIANT, L. (2008). Detecting
influenza epidemics using search engine query data.
</p>
<p>GUTHRIE, J. T. (1988). Locating information in documents : Examination of a cognitive model.
Reading Research Quarterly, 23:178&#8211;199.
</p>
<p>JULIEN, H., MCKECHNIE, L. E. F. et HART, S. (2005). Affective issues in library and information
science systems work : A content analysis. Library and Information Science Research, 27(4):453&#8211;
466.
</p>
<p>KIM, K. (2008). Effects of emotion control and task on web searching behavior. Information
Processing and Management, 44(1):373&#8211;385.
</p>
<p>KIVITS, J. (2006). Informed patients and the internet : a mediated context for consultations
with health professionnals. Journal of Health Psychology, 11(2):269&#8211;282.
</p>
<p>KUHLTHAU, C. C. (1991). Inside the search process : Information seeking from the user&#8217;s
perspective. Journal of the American Society for Information Science, 42(5):361&#8211;371.
</p>
<p>279</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LEMIRE, M. (2009). Internet et responsabilisation : perspective de l&#8217;usager au quotidien. Sant&#233;
Publique, 21:13&#8211;25.
</p>
<p>MAUREL, S., CURTONI, P. et DINI, L. (Fontainebleau - 2008). L&#8217;analyse des sentiments dans les
forums. In Atelier Fouille des Donn&#233;es d&#8217;Opinion.
</p>
<p>NABARETTE, H. (2002). L&#8217;internet m&#233;dical et la consommation d&#8217;information par les patients.
R&#233;seaux, 4:249&#8211;286.
</p>
<p>NOVAKOVA, I. et TUTIN, A. (2009a). Le lexique des &#233;motions. Grenoble.
</p>
<p>NOVAKOVA, I. et TUTIN, A. (2009b). Les &#233;motions sont-elles comptables. In NOVAKOVA, I. et TUTIN,
A., &#233;diteurs : Le lexique des &#233;motions, pages 65&#8211;79. Grenoble.
</p>
<p>PAGANELLI, C. et CLAVIER, V. (2010). Le forum de discussion : une ressource informationnelle
hybride entre information grand public et information sp&#233;cialis&#233;e. In YASRI-LABRIQUE, E.,
&#233;diteur : Les forums dediscussion : agora du XXI&#232;me si&#232;cle ? Th&#233;orie, enjeux et pratiques discursives,
pages 39&#8211;54. Paris.
</p>
<p>RENAHY, E., PARIZOT, I. et CHAUVIN, P. (2007). Whist :a web-based survey on health information
seeking on internet in france. Rapport technique, Paris, INSERM.
</p>
<p>ROMEYER, H. (2008). Tic et sant&#233; : entre information m&#233;dicale et information de sant&#233;.
</p>
<p>SVETLA, K., MAUREL, D. et SILBERZTEIN, M. (2007). Formaliser les langues avec l&#8217;ordinateur : de
INTEX &#224; NooJ.
</p>
<p>S&#201;NIS, F. (2003). Pourquoi acc&#233;der &#224; l&#8217;information m&#233;dicale sur Internet par le biais des groupes
de discussion ? Qualit&#233;, centres d&#8217;intr&#233;r&#234;t et motivations des participants aux forums m&#233;dicaux. &#192;
propos du forum Usenet Fr.bio.medecine.
</p>
<p>VERCHER, E. et TOUBOUL, A.-L. (2011). L&#8217;information sant&#233; : entre vulgarisation scientifique
et circulation communautaire, le cas des sites sant&#233; 2.0. In Internet et sant&#233; : regards crois&#233;s
France/Qu&#233;bec. Lyon : M&#233;diath&#232;que Universit&#233; Lyon 1, 21 f&#233;vrier.
</p>
<p>YAMOUNI-AOUGHLIS, Y. (2010). Construction d&#8217;un dictionnaire &#233;lectronique de terminologie infor-
matique et analyse automatique de textes par grammaires locales.
</p>
<p>280</p>

</div></div>
</body></html>