<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Pour un &#233;tiquetage automatique des s&#233;quences verbales fig&#233;es : &#233;tat de l&#8217;art et approche transformationnelle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 255&#8211;266,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Pour un &#233;tiquetage automatique des s&#233;quences verbales 
fig&#233;es : &#233;tat de l&#8217;art et approche transformationnelle 
</p>
<p>Aur&#233;lie JOSEPH 
LDI, 99 avenue Jean-Baptiste Cl&#233;ment, 93 Villetaneuse 
ITESFOT, Parc d&#8217;Andron, Le S&#233;quoia, 30470 Aimargues 
</p>
<p>joseph.aurelie@gmail.com 
</p>
<p>RESUME____________________________________________________________________________________________________________  
</p>
<p>Cet article pr&#233;sente une approche permettant de reconnaitre automatiquement dans un 
texte des s&#233;quences verbales fig&#233;es (casser sa pipe, briser la glace, prendre en compte) &#224; 
partir d&#8217;une ressource. Cette ressource d&#233;crit chaque s&#233;quence en termes de possibilit&#233;s 
et de restrictions transformationnelles. En effet, les s&#233;quences fig&#233;es ne le sont pas 
compl&#232;tement et n&#233;cessitent une description exhaustive afin de ne pas extraire seulement 
les formes canoniques. Dans un premier temps nous aborderons les approches 
traditionnelles permettant d&#8217;extraire des s&#233;quences phras&#233;ologiques. Par la suite, nous 
expliquerons comment est constitu&#233;e notre ressource et comment celle-ci est utilis&#233;e 
pour un traitement automatique. 
</p>
<p>ABSTRACT _________________________________________________________________________________________________________  
</p>
<p>For an Automatic Fixed Verbal Sequence Tagging: State of the Art and 
Transformational Approach 
</p>
<p>This article presents a resource-based method aiming at automatically recognizing fixed 
verbal sequences in French (i.e casser sa pipe, briser la glace, prendre en compte) inside a 
text. This resource describes each sequence from the view-point of transformational 
possibilities and restrictions. Fixed sequences are not totally fixed and an exhaustive 
description is necessary to not only extract canonical forms. We will first describe some 
transformational approaches that are able to extract phraseological sequences. The 
building of the resource will be then addressed followed by our approach to 
automatically recognize fixed sequences in corpora. 
</p>
<p> 
MOTS-CLES : s&#233;quences verbales fig&#233;es, reconnaissance automatique, &#233;tiquetage, 
transformations linguistiques, ressources &#233;lectroniques. 
</p>
<p>KEYWORDS: fixed verbal sequences, automatic recognition, tagging, linguistical 
transformations, electronic resources. 
</p>
<p>255</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction 
</p>
<p>Le d&#233;coupage en mots est la premi&#232;re op&#233;ration effectu&#233;e dans un traitement 
automatique de la langue. Mais le terme mot est linguistiquement inappropri&#233; car il 
correspond en informatique &#224; une entit&#233;, appel&#233;e token, d&#233;limit&#233;e par des s&#233;parateurs 
graphiques (blancs, retour &#224; la ligne&#8230;). Il n&#8217;est pas n&#233;cessaire de rappeler ici que la 
notion de mot est beaucoup plus complexe. Et lorsque nous disons complexe nous 
pensons tout autant &#224; la difficult&#233; de les cerner qu&#8217;&#224; leur potentielle polylexicalit&#233;. En 
effet, alors que les traitements informatiques se sont concentr&#233;s sur le mot simple, les 
chercheurs ont prouv&#233; que les mots complexes sont tout aussi importants dans le 
traitement des langues (Gross, 1982 ; Gross, 1996 ; Mejri, 1997 ; Lamiroy, 2006&#8230;). Le 
traitement automatique de ces s&#233;quences devient un enjeu incontournable et se doit 
d&#8217;&#234;tre trait&#233; correctement car la bonne identification et donc l&#8217;&#233;tiquetage correct de ces 
s&#233;quences dites fig&#233;es est utile pour de nombreuses applications telles que la traduction, 
l&#8217;extraction d&#8217;information, la classification... Notre approche consiste &#224; cr&#233;er une 
ressource &#233;lectronique d&#233;crivant les s&#233;quences verbales fig&#233;es (SVF) en termes de 
possibilit&#233;s transformationnelles. Nous pensons, que comme les termes simples, elles ont 
besoin d&#8217;&#234;tre, dans un premier temps, reconnaissables sous toutes leurs formes. Comme 
un verbe peut &#234;tre reconnu dans un texte m&#234;me s&#8217;il est conjugu&#233;, les SVF doivent &#234;tre 
&#233;galement reconnues malgr&#233; leurs modifications. Inversement, pour les s&#233;quences avec 
un d&#233;doublement de sens (Mejri, 2003), les contraintes li&#233;es &#224; certaines transformations 
peuvent nous diriger sur une s&#233;quence litt&#233;rale et non globale (prendre la veste verte sera 
reconnu comme non fig&#233;).  
</p>
<p>2 S&#233;quence fig&#233;e et extraction automatique : &#233;tat de l&#8217;art 
</p>
<p>Notre objet d&#8217;&#233;tude concerne la s&#233;quence fig&#233;e (SF) connue aussi sous le nom 
d&#8217;expression fig&#233;e, locution, expression idiomatique... Une s&#233;quence fig&#233;e est un groupe 
de mots non n&#233;cessairement contigus, poss&#233;dant une unit&#233; s&#233;mantique (sens global), et 
un figement &#224; la fois morphologique (blocage du nombre), lexical (blocage du paradigme 
commutationnel) et syntaxique (blocage de la passivation, de la relativation&#8230; pour des 
s&#233;quences verbales) (Lamiroy et al., 2008).  
</p>
<p>A l&#8217;instar de Mejri (2011) nous distinguons les s&#233;quences fig&#233;es de deux autres concepts :  
</p>
<p>&#8211; les s&#233;quences totalement fig&#233;es (au fur et &#224; mesure) qui n&#8217;acceptent aucune 
modification. L&#8217;ensemble est un bloc immuable et dont le traitement n&#233;cessite un 
simple r&#233;f&#233;rencement dans un dictionnaire. 
</p>
<p>&#8211; Les collocations : s&#233;quences r&#233;p&#233;t&#233;es apparaissant fr&#233;quemment ensembles 
(Firth, 1957). Elles peuvent &#234;tre propres &#224; un domaine (collocation 
terminologique selon Smadja, 1993) ou typique d&#8217;une langue (comme les verbes 
supports ou les verbes appropri&#233;s) 
</p>
<p>Nous &#233;tudions ici, plus pr&#233;cis&#233;ment la s&#233;quence verbale fig&#233;e (casser sa pipe, prendre le 
taureau par les cornes, faire faux bond&#8230;). La probl&#233;matique des SF et de fa&#231;on plus 
importante des SVF, vient du fait qu&#8217;elles ne sont pas totalement fig&#233;es (Gross, 1982 ;  
Gross, 1996 ; Lamiroy, 2005 ; Abeill&#233;, 1989). En effet, elles autorisent certaines 
modifications d&#8217;ordre syntagmatique et/ou paradigmatique cr&#233;ant ainsi des degr&#233;s de 
</p>
<p>256</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>figement (Gross, 1996). Cependant, il n&#8217;est apparemment pas possible de d&#233;finir a priori 
les transformations  r&#233;alisables d&#8217;une s&#233;quence. Villada-Moir&#242;n (2005) remarque que 
&#8220;there is no uniform presence or absence of syntactic constraints in all fixed expressions since 
not all fixed expressions exhibit the same syntactic versatility&#8221;.1 (Villada Moir&#242;n, 2005:46). 
Balibar-Mrabti (2005) va plus loin en postulant que des s&#233;quences de m&#234;me structure 
syntaxique n&#8217;acceptent pas les m&#234;mes libert&#233;s transformationnelles (bruler ses vaisseaux 
vs casser sa pipe). Comment peut-on alors extraire de telles s&#233;quences malgr&#233; des 
modifications &#233;videntes ? Il existe plusieurs approches assez r&#233;pandues.  
</p>
<p>La premi&#232;re est purement syntaxique. Laporte et al. (2008) utilisent les patrons 
syntaxiques productifs en noms compos&#233;s et vont les proposer &#224; un transducteur (avec 
l&#8217;outil Unitex). En permettant certaines transformations (insertion, coordination&#8230;) ils  
r&#233;cup&#232;rent ainsi des s&#233;quences nominales correspondant syntaxiquement &#224; des noms 
compos&#233;s.  
</p>
<p>La deuxi&#232;me approche est purement statistique. Ces m&#233;thodes utilisent une mesure pour 
d&#233;terminer au mieux la coh&#233;sion entre les &#233;l&#233;ments. Dias (2003) propose ainsi le 
GenLocalMax qui permet de calculer le degr&#233; de figement d&#8217;une s&#233;quence plus grande 
que deux mots non obligatoirement contigu&#235;. Cependant l&#8217;approche est largement 
d&#233;pendante du corpus et de sa taille. 
</p>
<p>L&#8217;approche la plus utilis&#233;e conjugue &#224; la fois syntaxe et statistique. Certains chercheurs  
(Manning &amp; Sch&#252;tze, 1999 ; Daille, 1996 ; Watrin, 2008&#8230;) commencent par un filtrage 
linguistique (s&#233;lection de lex&#232;mes, patrons syntaxiques) pour ensuite prendre une 
d&#233;cision bas&#233;e sur un calcul probabiliste (logarithme de vraisemblance, information 
mutuelle&#8230;). D&#8217;autres &#224; l&#8217;inverse, g&#233;n&#232;rent un premier filtrage par crit&#232;res statistiques 
pour ensuite effectuer leur choix sur crit&#232;res linguistiques (Smadja, 1993). Ces m&#233;thodes 
hybrides sont les plus pris&#233;es. Toutefois, elles permettent l&#8217;extraction de donn&#233;es 
terminologiques (souvent nominales) plus que l&#8217;extraction de s&#233;quences fig&#233;es que nous 
pourrions appeler &#8216;langagi&#232;res&#8217;, c'est-&#224;-dire, qui peuvent se retrouver dans n&#8217;importe quel 
texte quel que soit le domaine. Les possibles modifications int&#233;gr&#233;es sont de l&#8217;ordre de 
l&#8217;expansion de s&#233;quence. Peu d&#8217;&#233;tudes (Al Haj et Wintner, 2010) testent les 
transformations morphologiques, lexicales ou m&#234;me syntaxiques que peut subir une SF 
afin d&#8217;en calculer le degr&#233; de figement. 
</p>
<p>Une autre approche, permettant d&#8217;extraire des unit&#233;s phras&#233;ologiques, est bas&#233;e sur des 
dictionnaires &#233;lectroniques : les travaux du LDI (notamment ceux de Ben-Henia Ayat, 
2006, 2009 ; Buvet, 2008 ; Cartier, 2008) ou du Lexique-Grammaire (notamment Tolone, 
2011). Les dictionnaires &#233;lectroniques du LDI d&#233;crivent les emplois des termes de 
mani&#232;re syntactico-s&#233;mantique. Les &#233;l&#233;ments sont cat&#233;goris&#233;s en pr&#233;dicat, argument, 
actualisateur et leur comportement syntaxique li&#233; au sens est d&#233;termin&#233; par ces m&#234;mes 
notions : prendre(HUM,taureau,corne). Les s&#233;quences polylexicales sont &#233;galement 
</p>
<p>                                                   
</p>
<p>1 &#171; observationnel il n'y aucune uniformit&#233; dans la  pr&#233;sence ou dans l&#8217;absence de contraintes syntaxiques dans toutes 
les expressions fig&#233;es puisque toutes les expressions fig&#233;es ne pr&#233;sentent pas la m&#234;me polyvalence syntaxique &#187; (Villada 
Moir&#242;n 2005:46). 
</p>
<p> 
</p>
<p>257</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>trait&#233;es de la sorte : prendre le taureau par les cornes(HUM). Cependant leur description 
est souvent li&#233;e &#224; la syntaxe externe (les arguments qu&#8217;elles acceptent) et leur traitement 
interne n&#8217;est pas exhaustif. Une description des emplois en termes de pr&#233;dicat et 
d&#8217;argument peut se r&#233;v&#233;ler essentielle pour extraire, par exemple, des SF analytiquement 
fausses c'est-&#224;-dire dont le rapprochement syntactico-s&#233;mantique n&#8217;est pas logiquement 
correct (avoir un chat dans la gorge : un humain ne peut pas avoir litt&#233;ralement un chat 
dans la gorge) (Ben-Henia Ayat, 2009) ou pour les d&#233;sambigu&#239;ser d&#8217;une s&#233;quence 
homonyme dont le sens est litt&#233;ral (prendre une veste). Cependant, cette description 
s&#8217;av&#232;re co&#251;teuse en description sous-jacente car le traitement d&#8217;un texte doit &#234;tre tr&#232;s fin 
pour pouvoir &#234;tre analys&#233;.  
</p>
<p>Abeill&#233; et Schabes (1989) proposent, gr&#226;ce aux grammaires d&#8217;arbres adjoints une 
m&#233;thode pouvant extraire les SF malgr&#233; leur discontinuit&#233; (insertion, modifieur) et leurs 
potentiels changements syntaxiques (passivation, clivage&#8230;). Cela implique toutefois que 
la description transformationnelle soit compl&#232;te. 
</p>
<p>Finalement, les approches hybrides sont assez rapides et n&#233;cessitent peu de ressources et 
de pr&#233;traitement. Toutefois elles incluent dans leur extraction toutes sortes d&#8217;unit&#233;s 
phras&#233;ologiques (souvent des collocations terminologiques). De plus, elles ne prennent 
pas en compte toutes les possibilit&#233;s transformationnelles d&#8217;une s&#233;quence en se limitant 
souvent &#224; de simples expansions. Les dictionnaires &#233;lectroniques, plus exhaustifs et pr&#233;cis 
sont n&#233;anmoins co&#251;teux en r&#233;alisation et en pr&#233;traitement. De plus, m&#234;me si les 
chercheurs d&#233;crivent la s&#233;quence fig&#233;e comme ayant une double structuration, la 
description syst&#233;matique de la structuration interne n&#8217;est pas d&#233;taill&#233;e. 
</p>
<p>Nous voulons constituer une ressource &#233;lectronique r&#233;pertoriant chaque SVF associ&#233;e &#224; 
toutes les transformations qu&#8217;elle accepte. Cette ressource sera utilis&#233;e dans un outil et 
permettra de reconnaitre toutes les SVF malgr&#233; leurs variations possibles. 
</p>
<p>3 Cr&#233;ation de la ressource 
</p>
<p>3.1 Les transformations 
</p>
<p>Les transformations &#8216;bloqu&#233;es&#8217; des SVF ont &#233;t&#233; d&#233;crites dans la litt&#233;rature (notamment 
Gross, 1982 ; Gross, 1996 ; Mejri, 1997 ; Lamiroy et al., 2006&#8230;). Nous l&#8217;avons dit 
pr&#233;c&#233;demment, certaines de ces transformations peuvent &#234;tre r&#233;alis&#233;es dans certaines 
SVF mais elles ne sont pas d&#233;terminables a priori. Nous reprenons donc chacune d&#8217;elles 
afin de transformer automatiquement chaque s&#233;quence2  (Cartier et Joseph, 2011).  Cette 
m&#233;thode s&#8217;apparente &#224; l&#8217;utilisation de grammaire d&#8217;arbres adjoints (Abeill&#233;, 1989) sans 
pour autant aspirer &#224; des phrases toujours grammaticales. 
</p>
<p>&#8211; Conjugaison : le verbe est mis &#224; toutes les personnes au pr&#233;sent, imparfait et 
futur. 
</p>
<p>&#8211; Flexion : chaque s&#233;quence est modifi&#233;e en changeant le nombre des noms et de 
leurs actualisateurs associ&#233;s. Toutes les possibilit&#233;s sont prises en compte. S&#8217;il y a 
</p>
<p>                                                   
2  Les s&#233;quences &#233;tudi&#233;es ont &#233;t&#233; r&#233;cup&#233;r&#233;es dans diverses ressources et correspondent &#224; des s&#233;quences 
</p>
<p>particuli&#232;res (cf Cartier et Joseph 2011) 
</p>
<p>258</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>deux noms dans la s&#233;quence nous aurons donc 4 possibilit&#233;s (prendre le taureau 
par les cornes, prendre les taureaux par les cornes, prendre le taureau par la corne, 
prendre les taureaux par la corne). 
</p>
<p>&#8211; Substitutions : les noms, les adjectifs, les verbes, les adverbes sont substitu&#233;s par 
leurs synonymes et antonymes (pour les adjectifs et verbes) les plus r&#233;currents. 
Les d&#233;terminants sont substitu&#233;s par d&#8217;autres d&#233;terminants (ind&#233;fini, d&#233;fini, 
possessif, d&#233;monstratif). 
</p>
<p>&#8211; Modifieurs nominaux : seuls les compl&#233;ments du nom et les relatives peuvent 
&#234;tre mod&#233;lis&#233;es pour &#234;tre requ&#234;t&#233;s sur des donn&#233;es non &#233;tiquet&#233;es. (l&#8217;adjectif 
sera un simple mot joker). 
</p>
<p>&#8211; Suppression d&#8217;&#233;l&#233;ments : les adjectifs (pr&#234;ter main forte &#1;  pr&#234;ter main), les 
adverbes, les d&#233;terminants, le verbe &#8216;introducteur&#8217; sont tour &#224; tour supprim&#233;s. 
Lorsqu&#8217;une s&#233;quence poss&#232;de plusieurs syntagmes alors on supprime tour &#224; tour 
les syntagmes (prendre le taureau par les cornes &#1;  prendre le taureau, prendre par 
les cornes). 
</p>
<p>&#8211; Insertion : on teste la possibilit&#233; d&#8217;ins&#233;rer un d&#233;terminant entre le verbe et le 
nom ou la pr&#233;position et le nom s&#8217;il n&#8217;existe pas (prendre peur &#1; prendre la peur). 
</p>
<p>&#8211; N&#233;gation / affirmation : les s&#233;quences affirmatives sont mises au n&#233;gatif et 
inversement. 
</p>
<p>&#8211; Inversion : les syntagmes d&#8217;une s&#233;quence sont invers&#233;s s&#8217;ils sont au moins deux 
(prendre le taureau par les cornes &#1; prendre par les cornes le taureau) 
</p>
<p>&#8211; Passivation : la s&#233;quence est modifi&#233;e en une phrase au passif (le taureau est pris 
par les cornes, le taureau par les cornes est pris) 
</p>
<p>&#8211; Relativation : la s&#233;quence est modifi&#233;e en une relative (le taureau que je prends 
par les cornes). 
</p>
<p>&#8211; Clivage : chaque syntagme est cliv&#233; (c&#8217;est le taureau que je prends par les cornes, 
c&#8217;est par les cornes que je prends le taureau). 
</p>
<p>&#8211; Pronominalisation/D&#233;tachement : test non effectu&#233; actuellement 
automatiquement. 
</p>
<p>&#8211; Les questions : test non effectu&#233; actuellement automatiquement. 
</p>
<p>3.2 Aide &#224; la cr&#233;ation de la ressource 
</p>
<p>Afin que la d&#233;cision sur la possibilit&#233; transformationnelle ne soit pas uniquement li&#233;e &#224; 
l&#8217;intuition du linguiste, un programme (Cartier et Joseph, 2011) va permettre de 
soumettre chaque s&#233;quence transform&#233;e en tant que requ&#234;te &#224; un moteur de recherche 
(Google, Google Books, Google News). Ce moteur de recherche va nous retourner le 
nombre de liens trouv&#233;s dans le web. Le linguiste pourra finalement valider les possibles 
transformations en s&#8217;appuyant &#224; la fois sur les r&#233;sultats et les attestations retourn&#233;es par 
les moteurs de recherche en v&#233;rifiant que la transformation effectu&#233;e est bien relative au 
sens de la s&#233;quence fig&#233;e. Le linguiste reste malgr&#233; tout le garant de la validit&#233; des 
transformations en ayant une aide sur l&#8217;usage r&#233;el de la s&#233;quence.  
</p>
<p>Nous obtenons ainsi une ressource d&#233;crivant pour chaque SF les transformations qu&#8217;elle 
peut subir et par cons&#233;quent celles qui sont bloqu&#233;es. Actuellement notre base se 
restreint &#224; environ 500 s&#233;quences transform&#233;es et valid&#233;es. Chaque s&#233;quence g&#233;n&#232;re en 
moyenne 40 transformations. Le nombre de transformations r&#233;alis&#233;es d&#233;pend du nombre 
</p>
<p>259</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de constituants. Pr&#233;cisons &#233;galement que les trois quart des SVF de notre base 
correspondent &#224; la structure &#8216;verbe d&#233;terminant nom pr&#233;position d&#233;terminant nom&#8217;. Ce 
choix totalement arbitraire, avait pour but de trouver des r&#232;gles transformationnelles 
potentielles malgr&#233; les postulats de d&#233;part. 
</p>
<p>Le peu de donn&#233;es actuelles est essentiellement d&#251; au fait que le programme de 
transformation a n&#233;cessit&#233; une attention toute particuli&#232;re afin de garantir sa robustesse 
pour qu&#8217;il puisse traiter toutes sortes de structures syntaxiques.  
</p>
<p>Voici comment se pr&#233;sentent les transformations d&#8217;une SVF, dans un premier temps 
celles qui affectent les constituants (Table 1), dans un deuxi&#232;me temps celles qui 
affectent la s&#233;quence enti&#232;re (Table 2). 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>TABLE 1 &#8211; Transformations des constituants de la s&#233;quence prendre le taureau par les cornes 
</p>
<p>TABLE 2 &#8211; Transformations possibles de la s&#233;quence prendre le taureau par les cornes 
</p>
<p>Cette ressource nous permet de conna&#238;tre sous formes de traits d&#233;finitoires ce qui 
caract&#233;rise les s&#233;quences en termes de transformations possibles. De plus, il peut exister 
des liens entre les transformations. En effet, un d&#233;terminant peut se voir substituer si et 
seulement si le nom qu&#8217;il actualise est modifi&#233;. C&#8217;est le cas de le qui devient un si taureau 
est modifi&#233; par un adjectif plac&#233; avant lui (not&#233; Adj0). Il est donc primordial de le 
r&#233;pertorier. 
</p>
<p>4 Outil de reconnaissance des SVF 
</p>
<p>Nous proposons une m&#233;thode, qui devra &#234;tre am&#233;lior&#233;e par la suite, permettant de 
reconnaitre automatiquement des SVF m&#234;me si celles-ci ont &#233;t&#233; transform&#233;es et de les 
distinguer partiellement de s&#233;quences litt&#233;rales homographes. Finalement nous pourrons 
les relier &#224; leur forme canonique cr&#233;ant ainsi une lemmatisation de la SVF. 
</p>
<p>4.1 Corpus 
</p>
<p>Nous testons actuellement notre outil sur une base constitu&#233;e des premi&#232;res pages 
retourn&#233;es par le moteur de recherche lors de nos requ&#234;tes sur les diff&#233;rentes 
transformations de prendre le taureau par les cornes. Dans l&#8217;&#233;tat actuel des choses, la base 
</p>
<p>260</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>n&#8217;est utile que pour tester visuellement notre outil. Un corpus servant de r&#233;f&#233;rence, 
permettant de tester nos r&#233;sultats doit &#234;tre r&#233;alis&#233; au plus t&#244;t. Notre corpus actuel, de 
plus de 32000 mots, est &#233;tiquet&#233; morpho-syntaxiquement et lemmatis&#233; par Treetagger &#224; 
l&#8217;exception des noms. En effet, une s&#233;quence fig&#233;e se caract&#233;rise tr&#232;s souvent par un 
blocage flexionnel des noms (singulier/pluriel). C&#8217;est pour cette raison que nous ne 
lemmatisons pas les noms. Toutefois, les s&#233;quences ayant des noms acceptant les 
versions singulier et pluriel seront indiqu&#233;es dans la ressource et ne seront bien 
&#233;videmment pas &#233;cart&#233;es de l&#8217;analyse. 
</p>
<p>4.2 &#201;tapes de reconnaissance 
</p>
<p>Notre programme proc&#232;de en plusieurs &#233;tapes. La premi&#232;re consiste &#224; constituer un 
dictionnaire d&#8217;entr&#233;es des composants de la SVF (noms, verbes, adjectifs, adverbes), qui 
n&#8217;acceptent ni substitution ni suppression. Nous les appelons &#8216;invariants&#8217;. Ce terme utilis&#233; 
de mani&#232;re un peu abusive repr&#233;sente les termes obligatoirement pr&#233;sents dans la 
s&#233;quence mais peuvent toutefois varier en nombre. Ils peuvent s&#8217;apparenter &#224; la &#171; zone 
fixe &#187; de Laporte (1988) correspondant &#224; un ou plusieurs termes obligatoirement 
pr&#233;sents dans la s&#233;quence. Les &#8216;invariants&#8217; se rapprochent de la d&#233;finition de &#171; t&#234;te &#187; 
d&#8217;Abeill&#233; (1989) qui correspond &#224; un terme simple d&#233;clenchant la zone de recherche 
d&#8217;une potentielle SF. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>TABLE 3 &#8211; &#201;chantillon de SVF associ&#233;es &#224; leurs invariants 
</p>
<p>Les &#8216;invariants&#8217; sont utilis&#233;s comme des d&#233;clencheurs d&#8217;une potentielle SVF. En effet, le 
texte &#233;tudi&#233; est d&#233;coup&#233; en tokens et chaque forme diff&#233;rente (nom, adjectif, adverbe) 
est recherch&#233;e comme un possible invariant. Les SVF associ&#233;es &#224; cet invariant sont donc 
r&#233;cup&#233;r&#233;es et deviennent les s&#233;quences candidates &#224; &#233;valuer de mani&#232;re plus 
approfondie.  Autour de cet invariant une fen&#234;tre de recherche (que nous appellerons 
</p>
<p>261</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8216;capture&#8217;) est r&#233;cup&#233;r&#233;e. Elle correspond &#224; 10 mots de part et d&#8217;autre de l&#8217;invariant. Ce 
nombre a &#233;t&#233; choisi arbitrairement. Il sera par la suite r&#233;&#233;valu&#233;, pouvant m&#234;me d&#233;pendre 
du nombre de constituants de la s&#233;quence. Il s&#8217;en suit &#224; partir de cette capture, une 
succession de tests, susceptibles d&#8217;&#233;liminer la capture et par la m&#234;me occasion la 
potentielle SVF associ&#233;e. Ces tests concernent dans un premier temps, les constituants de 
la s&#233;quence : 
</p>
<p>&#8211; les autres &#8216;invariants&#8217; : tous les &#233;l&#233;ments obligatoires dans la s&#233;quence doivent 
&#234;tre retrouv&#233;s dans la capture. 
</p>
<p>&#8211; les &#233;l&#233;ments &#8216;variants&#8217; : substituables ou supprimables.  
Si l&#8217;&#233;l&#233;ment est supprimable sa pr&#233;sence n&#8217;est pas requise. Un &#233;l&#233;ment 
supprimable peut &#234;tre &#233;galement le fait d&#8217;un syntagme supprimable (avoir des 
fourmis dans les jambes, avoir des fourmis). 
Un &#233;l&#233;ment de la s&#233;quence peut &#234;tre substitu&#233;. Dans ce cas les substitutions 
possibles sont list&#233;es sous formes de lemmes ou de classes d&#8217;objets (avoir des 
fourmis dans &lt;PARTIE DU CORPS&gt;) 
</p>
<p>&#8211; les modifieurs possibles ou impossibles : les compl&#233;ments du nom, les adjectifs, 
les subordonn&#233;es relatives sont actuellement les trois modifieurs que nous 
recherchons dans la capture &#224; partir d&#8217;un nom. Si ce nom ne doit pas &#234;tre 
modifi&#233; et que des &#233;l&#233;ments repr&#233;sentants les modifieurs sont trouv&#233;s (de, une 
&#233;tiquette &lt;adjectif&gt;, un relatif) alors la s&#233;quence est &#233;limin&#233;e. 
</p>
<p>&#8211; les modifieurs possibles selon une contrainte particuli&#232;re (substitution du 
d&#233;terminant : prendre une veste, prendre la veste de sa vie). 
</p>
<p>Dans un deuxi&#232;me temps, nous testons les transformations li&#233;es &#224; la s&#233;quence enti&#232;re 
(inversion, passivation, clivage, relativation). Pour ce faire, nous testons tout d&#8217;abord 
l&#8217;ordre dans lequel apparaissent les constituants. En effet, ces types de transformations 
impliquent un changement syntagmatique des &#233;l&#233;ments. Ainsi, en disant que prendre le 
taureau par les cornes poss&#232;de 3 composants (prendre, taureau, cornes), ces composants 
constituent l&#8217;ordre suivant : 1 2 3. Le clivage de taureau modifie alors l&#8217;ordre en 2 1 3 
(c&#8217;est le taureau qu&#8217;il prend par les cornes). En proc&#233;dant de cette mani&#232;re nous validons 
l&#8217;ordre des &#233;l&#233;ments par rapport &#224; la transformation associ&#233;e. Cependant, ceci n&#8217;est pas 
suffisant pour savoir si nous traitons bien la transformation cible. Il nous faut ainsi des 
&#233;l&#233;ments d&#233;finitoires de chaque transformation devant &#234;tre pr&#233;sents dans la capture pour 
que la transformation soit valid&#233;e. Ainsi le passif est d&#233;fini par la pr&#233;sence d&#8217;un verbe au 
participe pass&#233; avec l&#8217;auxiliaire &#234;tre, la relativation par un pronom relatif et le clivage 
par la pr&#233;sence de c&#8217;est et un pronom relatif (Riegel et al., 1994). 
</p>
<p>Prenons un exemple : la ressource nous renseigne sur le fait qu&#8217;une passivation est 
accept&#233;e (l&#8217;indice 1 indique que c&#8217;est une passivation de type : le taureau est pris par les 
cornes. Pour affirmer que nous avons ce passif, nous devons donc trouver l&#8217;ordre 2 1 3 
mais &#233;galement avoir un participe pass&#233; avec l&#8217;auxiliaire &#234;tre (ou sans l&#8217;auxiliaire selon 
certaines conditions).  
</p>
<p>Pr&#233;cisons &#233;galement que des interd&#233;pendances peuvent survenir et qu&#8217;il faut les prendre 
en compte. C&#8217;est le cas dans prendre le taureau par les cornes o&#249; lors d&#8217;une inversion le 
taureau doit &#234;tre modifi&#233; par un compl&#233;ment du nom pour que l&#8217;inversion soit accept&#233;e 
(prendre par les cornes le taureau de la fantaisie &#224; la fran&#231;aise dans actualites.leparisien.fr). 
</p>
<p>262</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.3 Prenons le taureau par les cornes : exemple 
</p>
<p>L&#8217;outil a &#233;t&#233; test&#233; sur notre corpus constitu&#233;, comme nous l&#8217;avons dit pr&#233;c&#233;demment, de 
diff&#233;rentes phrases incluant prendre le taureau par les cornes sous diff&#233;rentes formes (les 
diff&#233;rentes transformations). Les s&#233;quences libres et les s&#233;quences fig&#233;es cohabitent donc 
dans ce corpus. La figure 1 illustre une partie des r&#233;sultats retourn&#233;s par l&#8217;outil. 
</p>
<p>FIGURE 1 &#8211; Reconnaissance de prendre le taureau par les cornes 
</p>
<p>Nous pouvons remarquer que les SVF m&#234;me transform&#233;es ont &#233;t&#233; retrouv&#233;es (en vert). 
Les s&#233;quences ne correspondant pas aux possibilit&#233;s transformationnelles d&#233;crites ne sont 
pas extraites (en bleu). Elles correspondent en effet &#224; la version litt&#233;rale de la s&#233;quence. 
Cependant, nous ne r&#233;glons pas &#8211; et nous l&#8217;avions pr&#233;vu &#8211; les conflits entre s&#233;quence 
litt&#233;rale et s&#233;quence fig&#233;e ayant les m&#234;mes transformations ou la forme canonique (en 
rouge). L&#8217;outil aura donc tendance &#224; privil&#233;gier la s&#233;quence fig&#233;e. Pour r&#233;gler de tels 
conflits, nous ne pourrons pas nous d&#233;douaner d&#8217;un traitement de la syntaxe externe par 
l&#8217;analyse des arguments ou encore par un traitement s&#233;mantique plus &#233;tendu. 
</p>
<p>Nous pr&#233;sentons Table 4 les r&#233;sultats de l&#8217;&#233;tiquetage de la s&#233;quence prendre le taureau par 
les cornes. La mesure prend en compte des s&#233;quences libres correctement ou 
incorrectement &#233;tiquet&#233;es. 
</p>
<p> 
</p>
<p>Prendre le taureau 
par les cornes 
</p>
<p>Rappel 99.29% 
Pr&#233;cision 99.53% 
F-score 99.41% 
</p>
<p>TABLE 4 &#8211; Reconnaissance de prendre le taureau par les cornes 
</p>
<p>Les principaux faux n&#233;gatifs sont dus a des probl&#232;mes d&#8217;&#233;tiquetage morpho-syntaxique. 
</p>
<p>Pr&#233;cisons que ces donn&#233;es chiffr&#233;es sont &#224; titre indicatives car elles ne repr&#233;sentent 
qu&#8217;une petite partie du probl&#232;me, d&#8217;autant plus que m&#234;me s&#8217;il peut avoir un sens litt&#233;ral, 
</p>
<p>263</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>le sens opaque pour prendre le taureau par les cornes est plus fr&#233;quent. Le nombre 
d&#8217;attestations de s&#233;quences libres en t&#233;moignent avec seulement 1% des occurrences 
dans notre corpus. Ces r&#233;sultats doivent &#233;galement &#234;tre compar&#233;s &#224; d&#8217;autres m&#233;thodes 
(probabilistes, hybrides&#8230;). Toutefois, nous pensons que le d&#233;but est prometteur et sera 
comp&#233;titif avec d&#8217;autres m&#233;thodes, notamment par le fait que la reconnaissance est 
ind&#233;pendante de la taille du document et que l&#8217;importance est donn&#233;e aux s&#233;quences 
transform&#233;es qui repr&#233;sentent plus de 10% des occurrences, dans notre corpus. 
</p>
<p>5 Conclusion et Perspectives 
</p>
<p>Nous venons de pr&#233;senter une m&#233;thode permettant de reconnaitre automatiquement des 
s&#233;quences verbales semi-fig&#233;es. Cette approche est bas&#233;e sur  une ressource &#233;lectronique 
constitu&#233;e de SVF associ&#233;es &#224; leurs transformations possibles ou impossibles. Celle-ci 
r&#233;pertorie &#224; la fois les transformations li&#233;es aux composants de la s&#233;quence (modification 
flexionnelle, substitution, modifieurs&#8230;) mais &#233;galement les changements li&#233;s &#224; la 
s&#233;quence enti&#232;re (passivation, relativation, inversion&#8230;) et les d&#233;pendances possibles 
entre les transformations (changement de d&#233;terminant en pr&#233;sence d&#8217;un modifieur). La 
ressource permet dans un premier temps, de trouver les mots du texte qui apparaissent 
comme des &#233;l&#233;ments obligatoirement pr&#233;sents dans la s&#233;quence, permettant de 
s&#233;lectionner des SVF potentielles qui seront test&#233;es sur une fen&#234;tre autour de cet 
&#233;l&#233;ment. Par la suite les composants sont v&#233;rifi&#233;s aussi bien par leur pr&#233;sence, leur 
substitution  ou leur possible modification. Enfin l&#8217;ordre des composants est analys&#233; s&#8217;il 
ne correspond pas &#224; l&#8217;ordre canonique. Si aucune transformation syntagmatique n&#8217;est 
r&#233;alisable alors la s&#233;quence est rejet&#233;e. A l&#8217;inverse, si l&#8217;ordre trouv&#233; correspond &#224; une 
transformation possible celle-ci doit &#234;tre valid&#233;e par rapport &#224; ses &#233;l&#233;ments d&#233;finitoires 
(participe pass&#233; pour le passif). C&#8217;est ainsi, par l&#8217;utilisation d&#8217;une ressource &#233;lectronique 
et une m&#233;thode qui se veut &#234;tre la plus rapide possible (pour une &#233;ventuelle utilisation 
industrielle), que nous arrivons &#224; extraire des SVF et &#224; d&#233;sambigu&#239;ser certaines de leur 
double litt&#233;ral, ind&#233;pendamment de la taille du corpus. N&#233;anmoins, le travail est loin 
d&#8217;&#234;tre termin&#233;. La ressource &#233;tablissant les diff&#233;rentes possibilit&#233;s transformationnelles 
doit &#234;tre compl&#233;t&#233;e. Les SVF peuvent &#234;tre d&#233;compos&#233;es en plusieurs types non pas selon 
leur degr&#233; de figement mais selon leur litt&#233;ralit&#233;, leur d&#233;doublement de sens, leur 
opacit&#233;, ou selon le domaine dans lequel on se trouve. En effet, les &#233;tapes de 
reconnaissance peuvent &#234;tre all&#233;g&#233;es selon certaines conditions. De plus, la notion 
d&#8217;invariant doit &#234;tre revue et &#233;largie peut-&#234;tre m&#234;me jusqu&#8217;&#224; une prise en compte de 
classes d&#8217;objets. L&#8217;ajout de la syntaxe externe doit &#233;galement compl&#233;ter la description 
pour une d&#233;sambigu&#239;sation totale. Enfin, des tests de robustesse doivent &#234;tre effectu&#233;s 
sur un corpus de r&#233;f&#233;rence, et les r&#233;sultats doivent &#234;tre compar&#233;s aussi bien &#224; d&#8217;autres 
mesures qu&#8217;&#224; d&#8217;autres ressources. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>ABEILLE, A. et SCHABES, Y. (1989). Parsing idioms in lexicalized TAGs. In Proceedings of the 
the European Chapter of the Association for Computational Linguistics (EACL'89). 
Manchester, Angleterre. 
</p>
<p>AL-HAJ, A. et WINTNER, S. (2010). Identifying Multi-words Expressions by Leveraging 
</p>
<p>264</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Morphological and Syntactic Idiosyncrasy. In Proceedings of COLING 2010 (Conference on 
Computational Linguistics), Beijing, Chine. 
</p>
<p>BALIBAR-MRABTI, A. (2005). Semi-figement et limites de la phrase fig&#233;e. In LINX (53), 
pages 35&#8211;54. 
</p>
<p>BEN-HENIA AYAT, I. (2006). Degr&#233;s de figement et double structuration des s&#233;quences 
verbales fig&#233;es. Th&#232;se de doctorat, Universit&#233; Paris 13, Paris. 
</p>
<p>BEN-HENIA AYAT, I. (2009). Les s&#233;quences verbales fig&#233;es m&#233;taphoriques. In Synergie (1), 
pages 159&#8211;171. 
</p>
<p>BUVET, P.-A., (2008). Quelle description lexicographique du figement pour le TAL? Le cas 
des adjectifs pr&#233;dicatifs &#224; forme complexe. In (Blumenthal et Mejri 2008), pages 43&#8211;54. 
</p>
<p>CARTIER, E. (2008). Rep&#233;rage automatique des expressions fig&#233;es : &#233;tat des lieux, 
perspectives. In (Blumenthal et Mejri 2008), pages 55-70. 
</p>
<p>CARTIER, E. et JOSEPH A. (2011). Rep&#233;rage automatique des s&#233;quences fig&#233;es pour la 
classification des documents. In LTT 2011 (Lexicologie, Terminologie, Traduction). 
</p>
<p>DAILLE, B. (2001). Extraction de collocation &#224; partir de textes. In TALN 2001 (Traitement 
automatique des langues naturelles). Tours.  
</p>
<p>DAILLE, B. (1996). Study and Implementation of Combined Techniques for Automatic 
Extraction of Terminology. In (Klavans et Resnik 1996), pages 29&#8211;36. 
</p>
<p>DIAS, G. (2003). Multiword Unit Hybrid Extraction. In Workshop on multiword expressions 
of ACL meeting (Association for Computational Linguistics). Sapporo, Japon. 
</p>
<p>GROSS, G. (1996). Les expressions fig&#233;es en fran&#231;ais noms compos&#233;s et autres locutions. 
Ophrys, Paris. 
</p>
<p>GROSS, M. (1982). Une classification des &#171; phrases fig&#233;es &#187; du fran&#231;ais. In Revue 
qu&#233;b&#233;coise de linguistique. 
</p>
<p>LAMIROY, B. et al. (2010). Les expressions verbales fig&#233;es de la francophonie Belgique, 
France, Qu&#233;bec et Suisse. Ophrys, Paris. 
</p>
<p>LAMIROY, B. (2008). Les expressions fig&#233;es : &#224; la recherche d&#8217;une d&#233;finition. In 
(Blumenthal et Mejri 2008), pages 85&#8211;88. 
</p>
<p>LAMIROY, B. (2005). Le probl&#232;me central du figement est le semi figement. In LINX (53), 
pages 135&#8211;153. 
</p>
<p>LAPORTE, E. (1988). Reconnaissance des expressions fig&#233;es lors de l&#8217;analyse automatique.  
In Langages 23(90), pages 117&#8211;126. 
</p>
<p>LAPORTE, E., NAKAMURA, T. et VOYATZI, S. (2008). A French Corpus Annotated for 
Multiword Nouns. In LREC 2008 (International Conference on Language Resources and 
Evaluation). Maroc. 
</p>
<p>LEPESANT, D. et MATHIEU-COLAS, M. (1998). Introduction aux classes d&#8217;objets. In Langages 
32(131), pages 6&#8211;33. 
</p>
<p>MANNING, C. et SCH&#220;TZE, H. (1999). Collocation. In Draft, pages 141&#8211;177. 
</p>
<p>265</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MEJRI, S. (2011). Les Dictionnaires &#233;lectroniques s&#233;mantico-syntaxiques. In (CARDOSO et 
al. 2011), pages 159&#8211;188. 
</p>
<p>MEJRI, S. (2008). La place du figement dans la description des langues. In (Blumenthal et 
Mejri 2008), pages 117&#8211;129. 
</p>
<p>MEJRI, S. (2003). Polys&#233;mie et polylexicalit&#233;. In Syntaxe et s&#233;mantique (5).  
</p>
<p>RIEGEL, M., PELLAT, J.-C. et RIOUL, R. (1994). Grammaire m&#233;thodique du fran&#231;ais. PUF, 
Paris. 
</p>
<p>SMADJA, F. (1993). Retrieving Collocations from Text: Xtract. In Computational linguistics 
19(1), pages 144&#8211;177. 
</p>
<p>TOLONE, E. (2011). Analyse syntaxique &#224; l&#8217;aide des tables du Lexique-Grammaire du 
fran&#231;ais. Th&#232;se de doctorat, &#201;cole des Ponts ParisTech, Paris. 
</p>
<p>VILLADA MOIRON, M.B. (2005). Data-driven identification of fixed expressions and their 
modifiability. Th&#232;se de doctorat. Universit&#233; de Groningen, Pays-Bas. 
</p>
<p>WATRIN, P. (2007). Collocations et traitement automatique des langues. In Lexis and 
Grammar, Bonifacio.  
</p>
<p>266</p>

</div></div>
</body></html>