<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;tat de l&#8217;art sur l&#8217;acquisition de relations s&#233;mantiques entre termes : contextualisation des relations de synonymie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 163&#8211;175,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>&#201;tat de l&#8217;art sur l&#8217;acquisition de relations s&#233;mantiques entre
termes : contextualisation des relations de synonymie
</p>
<p>Mounira Manser
LIM&amp;BIO (EA3969)
Universit&#233; Paris 13
</p>
<p>93017 Bobigny Cedex
France
manser.mounira@gmail.com
</p>
<p>R&#201;SUM&#201;
L&#8217;acc&#232;s au contenu des textes de sp&#233;cialit&#233; est une t&#226;che difficile &#224; r&#233;aliser. Cela n&#233;cessite
la d&#233;finition de m&#233;thodes automatiques ou semi-automatiques pour identifier des relations
s&#233;mantiques entre les termes que contiennent ces textes. Nous distinguons les approches de TAL
permettant d&#8217;acqu&#233;rir ces relations suivant deux types d&#8217;information : la structure interne des
termes ou le contexte de ces termes en corpus. Afin d&#8217;am&#233;liorer la qualit&#233; des relations acquises
et faciliter leur r&#233;utilisation en corpus, nous nous int&#233;ressons &#224; la prise en compte du contexte
dans une m&#233;thode d&#8217;acquisition de relations de synonymie bas&#233;e sur l&#8217;utilisation de la structure
interne des termes. Nous pr&#233;sentons les r&#233;sultats d&#8217;une exp&#233;rience pr&#233;liminaire tenant compte
de l&#8217;usage des termes dans un corpus biom&#233;dical en anglais. Nous donnons quelques pistes de
travail pour d&#233;finir des contraintes s&#233;mantiques sur les relations de synonymie acquises.
</p>
<p>ABSTRACT
State of the Art on the Acquisition of Semantic Relations between Terms : Contextualisa-
tion of the Synonymy Relations
</p>
<p>Accessing to the context of specialised texts is a crucial but difficult task. It requires automatic
or semi-automatic methods dedicated to the identification of semantic relations between terms
appearing in the texts. NLP approaches for acquiring semantic relations between terms can be
distinguished according to the type of information : the internal structure of the terms and
the term context. In order to improve the quality of the acquired synonymy relations and their
reusability in other corpora, we aim at taking into account the context into an approach based on
the internal structure of the terms. We present the results of a preliminary experiment taking into
account the use of the terms in a English biomedical corpora. This experiment will be helpful to
add semantic constraints to the already acquired synonymy relations.
</p>
<p>MOTS-CL&#201;S : Acquisition de relations, Synonymie, Relations s&#233;mantiques, Terminologie, Do-
maine Biom&#233;dical, Corpus de sp&#233;cialit&#233;.
</p>
<p>KEYWORDS: Relation Acquisition, Synonymy, Semantic Relations, Terminology, Biomedical
Domain, Specialised corpora.
</p>
<p>163</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Devant la masse consid&#233;rable de donn&#233;s disponibles, la difficult&#233; d&#8217;extraire et de rechercher
l&#8217;information &#224; partir des textes devient de plus en plus importante et demande un effort de
structuration et d&#8217;ordonnancement des donn&#233;es. Les ressources terminologiques r&#233;pondent
partiellement &#224; ce besoin en proposant les termes du domaine et diff&#233;rents types de relations
(synonymie, hyp&#233;ronymie ou des relations plus sp&#233;cifiques au domaine comme a-pour-sympt&#244;me).
La projection des termes issus d&#8217;une terminologie ne suffit pas (Cabr&#233;, 1999; Hamon, 2005;
Spasic et al., 2005; McIntosh et Curran, 2009). Il est n&#233;cessaire de disposer de terminologies
structur&#233;es afin d&#8217;&#234;tre capable de s&#8217;adapter aux usages dans les documents manipul&#233;s. Pour cela,
des approches automatiques ou semi-automatiques doivent &#234;tre mises en &#339;uvre. Des approches
de TAL ont ainsi &#233;t&#233; propos&#233;es pour aider &#224; l&#8217;identification des termes et des relations permettant
de structurer ces listes de termes. Cependant, la qualit&#233; des r&#233;sultats peut varier en termes de
rappel (les m&#233;thodes sont trop restrictives) ou de pr&#233;cision (les ambigu&#239;t&#233;s ou la polys&#233;mie sont
peu ou mal prises en compte).
</p>
<p>Nous nous int&#233;ressons ici &#224; l&#8217;acquisition de relations de synonymie entre termes. Notre travail
consiste &#224; proposer et &#224; tester des m&#233;thodes dans le but d&#8217;am&#233;liorer l&#8217;acquisition de relations de
synonymie produites par SynoTerm (Hamon et Nazarenko, 2001). Il s&#8217;agit de filtrer des relations
de synonymie en exploitant les informations contextuelles et s&#233;mantiques li&#233;es aux termes ou &#224;
leur composants. Le travail est r&#233;alis&#233; sur des donn&#233;es issues du domaine biom&#233;dical en langue
anglaise. Nous travaillons &#224; la fois avec les ressources terminologiques Gene Ontology et UMLS,
ainsi qu&#8217;avec un ensemble des r&#233;sum&#233;s Medline (voir section 3).
</p>
<p>Dans cet article nous pr&#233;sentons d&#8217;abord les relations s&#233;mantiques pouvant &#234;tre fournies par
une ressource terminologique (section 2.1). Puis nous pr&#233;sentons un &#233;tat de l&#8217;art des approches
d&#8217;acquisition de ces relations (section 2). La section 3 est consacr&#233;e au mat&#233;riel que nous avons
utilis&#233; pour nos exp&#233;riences. Nous d&#233;crivons &#224; la section 4 les pistes de travail pour l&#8217;am&#233;lioration
de l&#8217;acquisition de relations de synonymie et les r&#233;sultats d&#8217;une exp&#233;rience pr&#233;liminaire (section
5).
</p>
<p>2 Approches pour l&#8217;identification des relations s&#233;mantiques
entre les termes
</p>
<p>Diff&#233;rents types d&#8217;approches de TAL permettent d&#8217;extraire des relations s&#233;mantiques entre les
termes. L&#8217;acquisition de telles relations est r&#233;alis&#233;e soit en exploitant la structure interne des
termes issus de corpus ou de terminologie (section 2.2), soit en s&#8217;appuyant sur le contexte de
ces termes en corpus (section 2.3). Dans cette section, nous pr&#233;sentons tout d&#8217;abord les types
de relations pouvant appara&#238;tre dans une terminologie puis un panorama des approches et des
types de relations qu&#8217;elles peuvent permettre d&#8217;acqu&#233;rir.
</p>
<p>2.1 Relations s&#233;mantiques dans une terminologie
</p>
<p>Les terminologies visent &#224; recenser les termes d&#8217;un domaine de sp&#233;cialit&#233;, c&#8217;est-&#224;-dire les unit&#233;s
linguistiques d&#233;signant un concept, un objet ou un processus (Bourigault et Jacquemin, 2000),
</p>
<p>164</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>mais aussi les relations s&#233;mantiques qu&#8217;entretiennent ces termes entre eux. Plusieurs types de
relations s&#233;mantiques sont propos&#233;es par les ressources terminologiques (Sager, 1990), le choix
d&#8217;inclure un type de relation &#233;tant surtout d&#233;pendant de l&#8217;usage de la ressource :
</p>
<p>&#8211; les relations taxinomiques : Ce type de relation structure des termes dans une arborescence.
</p>
<p>Les relations d&#8217;hyp&#233;ronymie (is-a/est-un) relient un terme g&#233;n&#233;ral &#224; un terme sp&#233;cifique.
Par exemple, nous avons les relations oxidase is-a enzyme ou contractil fiber is-a fiber.
</p>
<p>Les relations partitives (m&#233;ronymie ou partie-tout) sont utilis&#233;es pour d&#233;finir une relation
entre deux termes ou l&#8217;un est une partie de l&#8217;autre. On a par exemple la relation de
m&#233;ronymie nucleus partie-de cell.
</p>
<p>&#8211; Les relations s&#233;mantiques lexicales regroupent deux types de relations :
</p>
<p>les relations de synonymie ou d&#8217;&#233;quivalence qui relient les termes poss&#233;dant le m&#234;me sens,
par exemple red blood et erythrocyte ;
</p>
<p>les relations d&#8217;antonymie ou d&#8217;opposition qui relient les termes ayant des sens contraires,
par exemple anabolosm et catabolism
</p>
<p>&#8211; Les relations inter-hi&#233;rarchiques (transversales) relient les termes appartenants &#224; des
branches distinctes d&#8217;une ou plusieurs hi&#233;rarchies. Ces relations sont tr&#232;s variables suiv-
ant les domaines. Par exemple, la relation localis&#233;e-dans permet de lier les termes division
cellulaire et cellule.
</p>
<p>2.2 Exploitation de la structure interne des termes
</p>
<p>L&#8217;acquisition des relations s&#233;mantiques bas&#233;e sur la structure interne des termes a donn&#233; lieu &#224; de
nombreux travaux. Ceux-ci utilisent diff&#233;rents types d&#8217;informations issus de l&#8217;analyse linguistique
des termes (informations morphologiques, syntaxiques et plus rarement s&#233;mantiques) et/ou
des indices statistiques comme la fr&#233;quence ou la productivit&#233;. La combinaison de ces travaux
s&#8217;av&#232;rent tr&#232;s utiles pour la structuration d&#8217;une liste de termes (Daille, 2003).
</p>
<p>Le partage de bases morphologiques communes peut aider &#224; l&#8217;acquisition de relations s&#233;mantiques.
Ainsi, dans le domaine biom&#233;dical, (Zweigenbaum et Grabar, 2000) ont exploit&#233; ces types
d&#8217;informations morphologiques entre des termes et leur productivit&#233; pour identifier les relations
de synonymie, d&#8217;hyp&#233;ronymie ou inter-hi&#233;rarchiques (acide, acido, acidit&#233;, acidurie, acidocitose,
acidophile). La d&#233;rivation est &#233;galement tr&#232;s utile pour identifier des variantes terminologiques
en corpus (Jacquemin, 1997; Grabar et Hamon, 2006) ou structurer s&#233;mantiquement un lexique
dans un contexte multilingue (Namer et Baud, 2007). Ainsi, le premier travail permet d&#8217;identifier
une relation entre stenosis of the aorta et aortic stenosis. Tandis que dans le second, il est possible
de lier les termes proctorrhagia et colorrhagia, ou les adjectifs bact&#233;rio&#239;de et bact&#233;riforme.
</p>
<p>D&#8217;autres travaux utilisent des techniques d&#8217;apprentissage par analogie sur l&#8217;emploi des fonctions
lexicales pour identifier des relations inter-hi&#233;rarchiques entre les termes (Claveau et L&#8217;Homme,
2005). Par exemple, les auteurs exploite la fonction lexicale connue entre connecteur et con-
necter (caract&#233;risant la relation inter-hi&#233;rarchique instrument_pour), pour identifier la m&#234;me
relation ou la m&#234;me fonction lexicale entre &#233;diteur et &#233;diter.
</p>
<p>L&#8217;analyse syntaxique des termes permet g&#233;n&#233;ralement d&#8217;identifier des relations d&#8217;hyp&#233;ronymie.
Ainsi, de nombreux travaux exploitent l&#8217;inclusion lexicale, c&#8217;est-&#224;-dire l&#8217;hypoth&#232;se que lorsqu&#8217;un
</p>
<p>165</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>terme est lexicalement inclus dans un autre, une relation d&#8217;hyp&#233;ronymie peut &#234;tre &#233;tablie (par
exemple, fatty acids essential / fatty acids). Pour cela, ils s&#8217;appuient sur une d&#233;composition en
t&#234;te/expansion des termes (Bourigault, 1994; Bodenreider et al., 2001; Grabar et Zweigenbaum,
2002). Une analyse fine des relations induites par inclusion lexicale montre cependant que celle-ci
permet &#233;galement de produire des relations inter-hi&#233;rarchiques (Ibekwe-SanJuan, 2005). Dans
Faster (Jacquemin, 1997), des variantes terminologiques sont identifi&#233;es &#224; l&#8217;aide des m&#233;canismes
syntaxiques d&#8217;insertion, de juxtaposition et de coordination. Une approche similaire mais bas&#233;e
uniquement sur le remplacement de cha&#238;nes de caract&#232;res est utilis&#233;e par (Verspoor et al., 2003)
pour acqu&#233;rir des relations d&#8217;hyp&#233;ronymie dans les termes de Gene Ontology. La variation verbo-
nominale combin&#233;e &#224; un apprentissage inductif peut &#233;galement &#234;tre pris en consid&#233;ration pour
identifier des relations s&#233;mantiques (Bouillon et al., 2000).
</p>
<p>Bien qu&#8217;en g&#233;n&#233;ral les informations s&#233;mantiques sont plut&#244;t utilis&#233;es dans des m&#233;thodes bas&#233;es
sur le contexte des termes, quelques travaux prenant en compte la structure interne des termes
exploitent ces types d&#8217;informations. Il est alors n&#233;cessaire de faire l&#8217;hypoth&#232;se de la compo-
sitionnalit&#233; des termes et de s&#8217;appuyer sur la pr&#233;sence d&#8217;un invariant syntaxique. Les indices
s&#233;mantiques sont alors des relations entre les composants des termes. Ainsi, le processus d&#8217;ac-
quisition de variation morpho-syntaxique propos&#233; par (Jacquemin, 1997) peut &#234;tre &#233;tendu en
exploitant des relations de synonymie (Jacquemin, 1999). D&#8217;autres travaux visent &#224; propager
les relations s&#233;mantiques sur les termes complexes (Hamon et Nazarenko, 2001) en combinant
diff&#233;rentes ressources lexicales. La qualit&#233; des relations inf&#233;r&#233;es d&#233;pend de la sp&#233;cialisation des
relations s&#233;mantiques initiales par rapport au domaine. Un moyen d&#8217;obtenir ces relations initiales
sp&#233;cifiques au domaine consiste &#224; utiliser les relations s&#233;mantiques issues d&#8217;une terminologie
(Verspoor et al., 2003; Hamon et Grabar, 2008). Les relations initiales induites doivent cependant
&#234;tre filtr&#233;es ou contextualis&#233;es, comme nous le pr&#233;sentons &#224; la section 4.
</p>
<p>2.3 Prise en compte du contexte des termes
</p>
<p>Les approches exploitant le contexte des termes s&#8217;appuient sur l&#8217;hypoth&#232;se que la s&#233;mantique
des termes peut &#234;tre identifi&#233;e avec les contextes dans lesquels ils apparaissent. Ainsi, outre la
d&#233;sambigu&#239;sation s&#233;mantique des termes, l&#8217;&#233;tude du contexte des termes fournit des indices
importants et parfois indispensables pour acqu&#233;rir et caract&#233;riser les relations s&#233;mantiques qu&#8217;ils
entretiennent entre eux.
</p>
<p>Nous nous int&#233;ressons ici principalement aux travaux r&#233;alis&#233;s sur les langues de sp&#233;cialit&#233; et
qui s&#8217;int&#233;ressent essentiellement &#224; identifier les relations hi&#233;rarchiques et les relations inter-
hi&#233;rarchiques. Les relations de synonymie sont plus rarement identifi&#233;es de cette mani&#232;re.
</p>
<p>2.3.1 D&#233;finition de patrons lexico-syntaxiques
</p>
<p>Une des principales strat&#233;gies pour acqu&#233;rir des relations s&#233;mantiques &#224; l&#8217;aide du contexte des
termes consiste &#224; d&#233;finir des patrons lexico-syntaxiques caract&#233;ristiques de la relation vis&#233;e
(Hearst, 1992; Auger et Barri&#232;re, 2008). Les patrons sont d&#233;finis &#224; partir d&#8217;observations en corpus
et permettent d&#8217;extraire des relations d&#8217;hyp&#233;ronymie. Par exemple, le patron NP , NP * , or other
NP appliqu&#233; &#224; la phrase &quot;Bruises, wounds, broken bones or other injuries...&quot; identifie des relations
d&#8217;hyp&#233;ronymie bruise is_a Injury, wound is_a injury et broken bone is_a injury. L&#8217;utilisation
</p>
<p>166</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;une m&#233;thode d&#8217;identification automatique des patrons lexico-syntaxiques en corpus permet
d&#8217;affiner les observations r&#233;alis&#233;es et d&#8217;obtenir de meilleurs r&#233;sultats (Morin, 1999). Des relations
transversales peuvent &#233;galement &#234;tre acquises gr&#226;ce &#224; cette strat&#233;gie (Hamon et al., 2010; R&#248;st
et al., 2010).
</p>
<p>Si les approches bas&#233;es sur les patrons exploitent en g&#233;n&#233;ral des informations lexicales et morpho-
syntaxiques dans un contexte relativement restreint, certains travaux cherchent &#224; utiliser des
relations de d&#233;pendance syntaxique (Snow et al., 2005). Les patrons syntaxiques sont alors
construits par apprentissage supervis&#233; sur des chemins de d&#233;pendance syntaxique entre les
termes. Un filtrage sur la longueur de ces chemins est ensuite appliqu&#233;. C&#8217;est &#233;galement le cas
lorsqu&#8217;il s&#8217;agit d&#8217;identifier des relations inter-hi&#233;rarchiques. Les patrons lexico-syntaxiques servent
de base &#224; la d&#233;finition de mod&#232;le d&#8217;apprentissage exploitant les CRF (Yang et de Roeck, 2010) ou
les SVM (Grouin et al., 2010). Dans ces deux travaux, les entit&#233;s mises en relations ainsi que leur
types s&#233;mantiques sont connues, ce qui est g&#233;n&#233;ralement pas le cas dans les approches classiques
visant &#224; acqu&#233;rir des relations s&#233;mantiques entre termes. Les indices trouv&#233;s en corpus dans le
contexte peuvent &#234;tre exploit&#233;s pour inf&#233;rer des patrons par programmation logique inductive
(Martienne et Morin, 1999; Claveau et L&#8217;Homme, 2004). Des relations d&#8217;hyp&#233;ronymie, dans le
premier travail, ou des relations entre des verbes et des noms, dans le second, peuvent ainsi &#234;tre
identifi&#233;es.
</p>
<p>On peut aussi remarquer que les patrons lexico-syntaxiques sont plus rarement utilis&#233;s pour
l&#8217;acquisition de relations de synonymie. Cependant, il semble que certains domaines de sp&#233;cialit&#233;,
comme la biologie, s&#8217;y pr&#234;tent mieux (Weissenbacher, 2004; Mccrae et Collier, 2008). Ce
ph&#233;nom&#232;ne particulier est probablement d&#251; aux pratiques de renommage des noms de g&#232;nes
lors de la d&#233;couverte de leur fonction, l&#8217;explicitation de termes, mais aussi aux efforts dans ce
domaine pour am&#233;liorer la recherche d&#8217;information et l&#8217;interop&#233;rabilit&#233; s&#233;mantique entre les
terminologies existantes et les textes. Ainsi, par exemple le patron also known permet d&#8217;extraire
la relation de synonymie dans l&#8217;extrait suivant : reculatory factor (IRF) also know IRF-8.
</p>
<p>Des contextes plus larges peuvent &#234;tre exploit&#233;s pour acqu&#233;rir des relations entre termes. Ainsi,
des contextes riches en connaissance (Knowledge-Rich Context) sont d&#233;finis selon (Meyer, 2001)
comme &#233;tant un contexte qui contient des termes d&#8217;un domaine sp&#233;cialis&#233; et des models (patterns)
de connaissaces. Des relations hi&#233;rarchiques (hyp&#233;ronymie et m&#233;ronymie) et des relations
transversales (Schumann, 2011) entre les termes et les models sont alors obtenues. Par exemple,
la phrase tNF kappa B is a potent mediator of specific gene expression in human monocytes and has
been shown to play a role in transcription of the HIV-1 genome in promonocytic leukemias est d&#233;fini
comme un contexte riche en connaissance pour la relation d&#8217;hyperonymie tNF kappa B / potent
mediator.
</p>
<p>2.3.2 Exploitation de la distribution contextuelle des termes
</p>
<p>Une autre utilisation du contexte des termes consiste &#224; r&#233;aliser une analyse distributionnelle
(Harris, 1990) pour regrouper des termes partageant des contextes (&#224; l&#8217;origine syntaxique). Par
exemple, les termes insuffisance r&#233;nale et d&#233;tresse respiratoire sont s&#233;mantiquement proches car
ils partagent les m&#234;mes contextes prise en charge d&#8217;une insuffisance r&#233;nale et prise en charge d&#8217;une
d&#233;tresse respiratoire, apparition d&#8217;une insuffisance r&#233;nale et apparition d&#8217;une d&#233;tresse respiratoire. Il
est ainsi possible d&#8217;identifier une relation de proximit&#233; s&#233;mantique entre des termes (Bourigault
et al., 2004), voire des relations de synonymie (Ferret, 2011). Par exemple, dans (Grefenstette,
</p>
<p>167</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1994), l&#8217;analyse distributionnelle appliqu&#233;e &#224; un corpus m&#233;dical permet de rep&#233;rer plusieurs
types de relations : synonymie (large / important / great), m&#233;ronymie (patient / group) ainsi que
des relations d&#8217;hyp&#233;ronymie patient / woman.
</p>
<p>Cette m&#233;thode a &#233;t&#233; &#233;galement utilis&#233;e par (Resnik, 1993) afin de mettre en &#233;vidence les
relations s&#233;mantiques associ&#233;es aux termes. Il s&#8217;agit alors de remplacer les termes pr&#233;sents
dans les contextes par leurs classes s&#233;mantiques, issues de WordNet. Par exemple les termes
infirmier et docteur sont remplac&#233;s par la classe profession de sant&#233; de WordNet. Il est &#233;galement
possible d&#8217;adopter une approche mixte qui combine l&#8217;analyse distributionnelle et les patrons
lexico-syntaxiques (Caraballo, 1999). Les termes sont d&#8217;abord regroup&#233;s en fonction des contextes
partag&#233;s, et des patrons sont alors appliqu&#233;s pour identifier des relations d&#8217;hyp&#233;ronymie.
</p>
<p>Enfin, nous pouvons &#233;galement mentionner l&#8217;approche propos&#233;e par (Cimiano et al., 2000)
pour acqu&#233;rir des relations taxonomiques de mani&#232;re semi-automatique. L&#8217;analyse syntaxique
des phrases est utilis&#233;e pour construire des contextes formels (chaque nom est caract&#233;ris&#233; par
un ensemble d&#8217;attributs compos&#233; par des verbes et pour lesquels le nom appara&#238;t comme un
argument). Les noms partageant les m&#234;mes contextes seront utilis&#233;s pour former un treillis.
L&#8217;Analyse Formelle de Concepts (FCA) est alors appliqu&#233;e pour rep&#233;rer les appariements entre les
concepts (Ganter et Wille, 1999). Cette approche vise &#224; structurer les connaissances sous forme
d&#8217;une hi&#233;rarchie &#224; partir d&#8217;un ensemble d&#8217;entit&#233;. Les entit&#233;s sont repr&#233;sent&#233;es sous forme d&#8217;un
treillis de Galois. Le treillis est compos&#233; d&#8217;un ensemble d&#8217;individus (les objets formels, par exemple
des termes), d&#8217;un ensemble de caract&#233;ristique (les attributs formels, par exemple des contextes)
et d&#8217;une relation binaire entre les objets et les attributs. Il est &#233;galement possible d&#8217;extraire des
relations autre que des relations d&#8217;hyp&#233;ronymie, notamment des relations inter-hi&#233;rarchique &#224;
l&#8217;aide de l&#8217;analyse relationnelle de concepts (Bendaoud et al., 2010).
</p>
<p>2.3.3 Discussion et analyse
</p>
<p>Les travaux pr&#233;sent&#233;s ci-dessus refl&#232;tent l&#8217;importance de ce champ scientifique et montrent une
certaine diversit&#233; dans les approches permettant d&#8217;acqu&#233;rir des relations en termes issus de
domaine de sp&#233;cialit&#233;. Dans cet article, nous proposons de combiner des approches bas&#233;es sur
des informations externes et internes aux termes. Notre objectif se rapproche des travaux de
(Resnik, 1993). Mais ici, nous nous situons dans un domaine de sp&#233;cialit&#233; et nous visons &#224;
contextualiser s&#233;mantiquement les relations de synonymie acquises par une approche exploitant
la structure interne des termes.
</p>
<p>3 Mat&#233;riel
</p>
<p>Dans cette section, nous d&#233;crivons le mat&#233;riel que nous avons &#224; notre disposition pour nos
exp&#233;riences. Nous avons s&#233;lectionn&#233; des ressources terminologiques (UMLS et Gene Ontology) et
des corpus issus du domaine biom&#233;dical (corpus Genia et BioNLP). Nous envisageons &#233;galement
d&#8217;utiliser des ressources g&#233;n&#233;rales (notamment WordNet) pour &#233;tiqueter s&#233;mantiquement nos
corpus de travail.
</p>
<p>168</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.1 Ressources terminologiques et lexicales
</p>
<p>&#8211; Gene ontology : Gene Ontology (GO) (The Gene Ontology Consortium, 2000) est une
ressource terminologique dont l&#8217;objectif est de d&#233;crire le r&#244;le des g&#232;nes dans les organismes
(prokaryotes et eukaryotes) ainsi que leurs produits g&#233;niques. Elle propose 54 453 concepts et
94 161 termes. Les termes de GO sont structur&#233;s en trois arbres hi&#233;rarchiques : processus bi-
ologiques, fonctions mol&#233;culaires et composants cellulaires. Le vocabulaire de GO est structur&#233;
&#224; l&#8217;aide de trois types de relations : l&#8217;hyp&#233;ronymie (119 430 relations), m&#233;ronymie (29 573
relations) et la synonymie (101 254 relations). Actuellement, nous n&#8217;utilisons que les relations
de synonymie.
</p>
<p>&#8211; UMLS (Lindberg et al., 1993) Unified Medical Language System (UMLS) est une ressource
terminologique biom&#233;dicale. D&#233;velopp&#233; par la National Library of Medicine (NLM), elle
regroupe plus d&#8217;une centaine de th&#233;saurus de diff&#233;rentes langues dans un m&#233;ta-thesaurus.
Celui-ci organise 700 000 concepts au sein d&#8217;un r&#233;seau s&#233;mantique compos&#233; de 134 types
s&#233;mantiques et structur&#233; par 54 relations s&#233;mantiques hi&#233;rarchis&#233;es par le lien is-a. Les
types s&#233;mantiques associ&#233;s aux termes de l&#8217;UMLS seront utilis&#233;s pour d&#233;finir les contraintes
s&#233;mantiques sur les mots ou les termes pour lesquels nous avons acquis des relations de
synonymie.
</p>
<p>&#8211; WordNet : WordNet (Fellbaum, 1998) est une base de donn&#233;es lexicale, d&#233;velopp&#233;e &#224; l&#8217;Univer-
sit&#233; de Princeton en 1985. Son objectif est de structurer le contenu s&#233;mantique et lexicale de la
langue anglaise. WordNet est organis&#233; en ensembles de synonymes appel&#233;s synsets. &#192; chaque
synset, correspond un concept. Les relations lexicales pr&#233;sentes dans WordNet ne lient que
les mots de la m&#234;me cat&#233;gorie morpho-syntaxique. Il existe donc quatre hi&#233;rarchies (pour les
noms, les verbes, les adjectifs et les adverbes). Dans la version 3.0, WordNet contient 155 287
mots avec 117 798 noms, 11 529 verbes, 21 479 adjectifs et 4 481 adverbes organis&#233;s en
117 659 synset. Nous envisageons d&#8217;exploiter, dans un deuxi&#232;me temps, les relations issues de
WordNet pour &#233;tendre le processus d&#8217;acquisition de relations de synonymie, et d&#8217;exploiter les
synsets dans la d&#233;finition des contraintes s&#233;mantiques.
</p>
<p>3.2 Corpus de travail
</p>
<p>Notre approche vise &#224; contextualiser les relations de synonymie acquises automatiquement. Nous
exploiterons deux corpus de sp&#233;cialit&#233;, constitu&#233;s d&#8217;un ensemble d&#8217;articles issus de la base de
donn&#233;es Medline 1.
</p>
<p>Le corpus GENIA 2 contient, dans sa version 3.0, 2 000 r&#233;sum&#233;s Medline au format XML, recueillis
&#224; l&#8217;aide des termes MESH : &quot;Human&quot;, &quot;Blood Cells&quot;, et &quot;Transcription Factors&quot; (Kim et al., 2003).
Il est compos&#233; de 400 000 mots. Il est annot&#233; avec diff&#233;rents niveaux d&#8217;informations linguistiques
et s&#233;mantiques.
</p>
<p>Dans un premier temps, nous utilisons le corpus d&#8217;entra&#238;nement de la campagne BioNLP2011 3
</p>
<p>(Pyysalo et al., 2011). Celui-ci est un ensemble de 800 articles de Medline issus du corpus
GENIA. Il est compos&#233; de 176 146 mots. Il est &#233;galement annot&#233; avec des informations lin-
guistiques et s&#233;mantiques et notamment des relations inter-hi&#233;rarchiques Protein/component et
subunit/complex.
</p>
<p>1. http ://www.ncbi.nlm.nih.gov/Entrez/
2. http ://www.nactem.ac.uk/genia/genia-corpus
3. http ://2011.bionlp-st.org/
</p>
<p>169</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Prise en compte du contexte des termes dans l&#8217;acquisition
de relations de synonymie
</p>
<p>Notre travail s&#8217;appuie sur la m&#233;thode impl&#233;ment&#233;e dans SynoTerm pour acqu&#233;rir des relations
de synonymie entre termes complexes (Hamon et Nazarenko, 2001). Cette m&#233;thode se base
sur l&#8217;hypoth&#232;se que des relations de synonymie peuvent &#234;tre propag&#233;es &#224; travers le principe de
compositionnalit&#233;. Trois r&#232;gles sont propos&#233;es pour inf&#233;rer des relations de synonymie entre
termes complexes &#224; partir de relations &#233;l&#233;mentaires de synonymie entre mots 4 (&#233;tape d&#8217;inf&#233;rence
sur la figure 1). Ainsi, deux termes complexes sont consid&#233;r&#233;s comme synonymes si au moins
un de leur composant dans la m&#234;me position syntaxique sont synonymes. Par exemple, &#233;tant
donn&#233; la relation de synonymie entre les mots infection et sepsis, les termes wound infection et
wound sepsis sont identifi&#233;s comme synonymes. Les auteurs ont &#233;galement montr&#233; que la qualit&#233;
des relations inf&#233;r&#233;es d&#233;pend de l&#8217;origine des relations entre les termes simples : des relations
de synonymie issues d&#8217;un dictionnaire de langue g&#233;n&#233;rale contribuent &#224; augmenter le rappel,
tandis que des relations sp&#233;cialis&#233;es acquises sur un corpus du domaine permettent d&#8217;am&#233;liorer
la pr&#233;cision.
</p>
<p>La difficult&#233; &#233;tant de disposer de relations entre termes simples, sp&#233;cifiques au domaine, l&#8217;ap-
proche inverse a &#233;t&#233; d&#233;finie pour induire des relations &#233;l&#233;mentaires &#224; partir des relations fournies
par une ressource terminologique (&#233;tape d&#8217;induction sur la figure 1) (Hamon et Grabar, 2008).
L&#8217;application de la m&#233;thode sur Gene Ontology permet d&#8217;acqu&#233;rir 3 707 relations de synonymie
avec une pr&#233;cision de 0,72. Nous avons pu parfois observer des d&#233;calages s&#233;mantiques entre le
type de la relation issue de la ressource terminologique et la relation induite : alors que la relation
initiale est une relation de synonymie, la relation induite exprime un autre type de relation. Par
exemple, &#224; la figure 1, cell receptor complex et lymphocyte receptor complex sont des synonymes
dans GO tandis que la relation induite est consid&#233;r&#233;e comme une relation d&#8217;hyp&#233;ronymie. On peut
supposer que cette modification de type s&#233;mantique entre la relation induite et la relation entre
les termes complexes est d&#251; &#224; un usage particulier qui peut &#234;tre captur&#233; &#224; travers le contexte
terminologique ou l&#8217;usage en corpus. De plus, la synonymie &#233;tant une relation contextuelle
(Cruse, 1986), il semble important de prendre en compte le contexte lors de l&#8217;acquisition des
relations &#233;l&#233;mentaires.
</p>
<p>L&#8217;objectif de notre travail est ainsi de d&#233;finir une m&#233;thode permettant de contextualiser les
relations &#233;l&#233;mentaires induites. Nous souhaitons pouvoir associer des cat&#233;gories s&#233;mantiques
issues du contexte des termes pour contraindre l&#8217;utilisation des relations induites.
</p>
<p>Pour cela, nous avons identifi&#233; deux pistes de travail :
</p>
<p>1. Filtrage des relations induites par leur usage dans un corpus. Les relations &#233;l&#233;mentaires
induites &#224; partir d&#8217;une ressource terminologique (&#233;tape d&#8217;induction) sont d&#8217;abord exploit&#233;es
sur un corpus pour inf&#233;rer des relations entre termes complexes (&#233;tape d&#8217;inf&#233;rence).
L&#8217;objectif est d&#8217;identifier les relations &#233;l&#233;mentaires utiles et leur associer un poids ou une
confiance plus importante. Ici nous faisons l&#8217;hypoth&#232;se que les relations incorrectes ne
devraient pas &#234;tre utilis&#233;es dans un corpus. Ce travail permettra &#233;galement d&#8217;identifier des
contextes lexicaux puis s&#233;mantiques utiles pour contextualiser les relations &#233;l&#233;mentaires.
</p>
<p>2. Exploitation d&#8217;informations s&#233;mantiques associ&#233;es aux termes. Il s&#8217;agit de contraindre le
champ d&#8217;application des relations entre les termes simples en exploitant les informations
</p>
<p>4. ou des termes moins complexes, c&#8217;est-&#224;-dire de longueur plus petite.
</p>
<p>170</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etape
d&#8217;induction
</p>
<p>Etape
d&#8217;inf&#233;rence Utilisation d&#8217;un corpus
</p>
<p>Cleavage complex Cleavage system
Synonymes dans GO
</p>
<p>complex system
Synonymie entre termes simples
</p>
<p>Immune systemImmune complex
Synonymie entre termes complexes
</p>
<p>lymphocyte cell
Hyperonymie entre termes simples
</p>
<p>development
cell
</p>
<p>development
lymphocyte
</p>
<p>Hyperonymie entre termes complexes
</p>
<p>complex
Lymphocyte receptor
</p>
<p>complex
Cell receptor
</p>
<p>Synonymes dans GO
</p>
<p>FIGURE 1 &#8211; Processus d&#8217;acquisition de relations de synonymie (inf&#233;rence et induction).
</p>
<p>s&#233;mantiques associ&#233;es aux termes. Nous allons annoter les textes avec des informations
s&#233;mantiques (cat&#233;gories s&#233;mantiques ou r&#244;les s&#233;mantiques). Pour cela nous allons projeter
les cat&#233;gories s&#233;mantiques de l&#8217;UMLS et de WordNet sur les corpus de travail ou sur les
composants des termes de GO. Nous envisageons d&#8217;utiliser des m&#233;thodes d&#8217;apprentissage
par analogie et par la programmation logique inductive pour en d&#233;duire les contraintes
s&#233;mantiques sur les relations &#233;l&#233;mentaires.
</p>
<p>Pour des raisons de facilit&#233; de mise en &#339;uvre nous nous sommes pour l&#8217;instant concentr&#233;e sur la
premi&#232;re piste, et plus particuli&#232;rement sur le filtrage des relations &#233;l&#233;mentaires induites.
</p>
<p>5 Filtrage des relations &#233;l&#233;mentaires par l&#8217;usage en corpus
</p>
<p>Pour filtrer les relations &#233;l&#233;mentaires en fonction de leur usage en corpus, nous avons travaill&#233;
sur le corpus BioNLP. Le corpus a d&#8217;abord &#233;t&#233; segment&#233; en mots et en phrases. Les mots ont &#233;t&#233;
&#233;tiquet&#233;s morpho-syntaxiquement et lemmatis&#233;s avec Genia Tagger (Tsuruoka et al., 2005). Nous
avons ensuite extrait les termes avec YATEA (Aubin et Hamon, 2006). Les diff&#233;rent traitements
ont &#233;t&#233; pris en charge par la plate-forme d&#8217;annotation linguistique Ogmios (Hamon et Nazarenko,
2008).
</p>
<p>L&#8217;acquisition de relations de synonymie entre les termes du corpus a &#233;t&#233; r&#233;alis&#233;e &#224; l&#8217;aide de
SynoTerm. Nous avons utilis&#233; les 3 707 relations &#233;l&#233;mentaires induites &#224; partir de GO. 277
relations entre termes complexes ont &#233;t&#233; inf&#233;r&#233;es sur le corpus BioNLP. 104 relations &#233;l&#233;mentaires
ont &#233;t&#233; utilis&#233;es. Les r&#233;sultats sont en cours d&#8217;analyse. La figure 2 pr&#233;sente quelques relations
inf&#233;r&#233;es. Nous sommes conscient que la taille du corpus utilis&#233; aura une influence sur le volume
de relations inf&#233;r&#233;es. Un filtrage bas&#233; uniquement sur le corpus demande une r&#233;flexion sur la
taille minimale pour appliquer cette approche, ou le recrutement de textes dans lesquels tous les
mots ou termes simples en relation apparaissent.
</p>
<p>171</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Formation /Development &#8722;&#8594; Cell development /Cell formation
&#8722;&#8594; Lymphocyte development /Lymphocyte formation
</p>
<p>Contact /Adhesion &#8722;&#8594; Cell contact /Cell adhesion
Embryonic /Fetal &#8722;&#8594; Development embryonic /Development fetal
</p>
<p>FIGURE 2 &#8211; Exemples de relations inf&#233;r&#233;es
</p>
<p>6 Conclusion
</p>
<p>L&#8217;&#233;tude des relations &#233;l&#233;mentaires induites &#224; partir de Gene Ontology nous conduit &#224; nous
int&#233;resser &#224; l&#8217;am&#233;lioration d&#8217;acquisition de relation de synonymie lorsqu&#8217;elle est bas&#233;e sur
l&#8217;analyse de la structure interne. Les pistes de travail que nous proposons visent &#224; prendre en
compte les contextes des termes en corpus de sp&#233;cialit&#233;. Nous proposons d&#8217;abord d&#8217;utiliser la
structure interne des termes pour acqu&#233;rir des relations, puis de les filtrer ou les trier en contexte
(en utilisant des corpus textuels ou les contextes terminologiques que constituent les termes de
GO). Les relations &#233;l&#233;mentaires induites seront ainsi affin&#233;es en leur associant des contraintes.
</p>
<p>Dans cette perspective, afin de commencer &#224; mettre en &#339;uvre nos pistes de travail, nous avons
r&#233;alis&#233; une premi&#232;re exp&#233;rience sur des donn&#233;es textuelles issues du domaine biom&#233;dical (corpus
BioNLP et Gene Ontology). Les relations &#233;l&#233;mentaires issues de l&#8217;analyse des termes de Gene
Ontology ont &#233;t&#233; exploit&#233;es sur le corpus BioNLP pour inf&#233;rer des relations de synonymie
entre termes complexes. Ces premiers r&#233;sultats vont nous permettre de d&#233;finir pr&#233;cis&#233;ment une
m&#233;thode de filtrage bas&#233;e sur le contexte et l&#8217;usage des termes.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AUBIN, S. et HAMON, T. (2006). Improving term extraction with terminological resources. In
SALAKOSKI, T., GINTER, F., PYYSALO, S. et PAHIKKALA, T., &#233;diteurs : Advances in Natural Language
Processing (5th International Conference on NLP, FinTAL 2006), num&#233;ro 4139 de LNAI, pages
380&#8211;387. Springer.
</p>
<p>AUGER, A. et BARRI&#200;RE, C. (2008). Pattern-based approaches to semantic relation extraction :
A state-of-the-art. Special Issue on Pattern-based Approaches to Semantic Relation Extraction,
Terminology, 14(1):1&#8211;19.
</p>
<p>BENDAOUD, R., TOUSSAINT, Y. et NAPOLI, A. (2010). L&#8217;analyse Formelle de Concepts au service
de la construction et l&#8217;enrichissement d&#8217;une ontologie. Revue des Nouvelles Technologies de
l&#8217;Information, E-18:133&#8211;164.
</p>
<p>BODENREIDER, O., BURGUN, A. et RINDFLESCH, T. C. (2001). Lexically-suggested hyponymic
relations among medical terms and their representation in the UMLS. In URI INIST CNRS,
&#233;diteur : Actes de la conf&#233;rence TIA-2001, pages 11&#8211;21, Nancy, France.
</p>
<p>BOUILLON, P., FABRE, C., S&#201;BILLOT, P. et JACQMIN, L. (2000). Apprentissage de ressources lexicales
pour l&#8217;extension de requ&#234;tes. Traitement Automatique des Langues, 41(2):367&#8211;393.
</p>
<p>BOURIGAULT, D. (1994). LEXTER un Logiciel d&#8217;EXtraction de TERminologie. Application &#224; l&#8217;extrac-
tion des connaissances &#224; partir de textes. Th&#232;se en math&#233;matiques, informatique appliqu&#233;e aux
sciences de l&#8217;homme, &#201;cole des Hautes &#201;tudes en Sciences Sociales, Paris, France.
</p>
<p>172</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOURIGAULT, D., AUSSENAC-GILLES, N. et CHARLET, J. (2004). Construction de ressources termi-
nologiques ou ontologiques &#224; partir de textes : un cadre unificateur pour trois &#233;tudes de cas.
Revue d&#8217;Intelligence Artificielle (RIA) &#8211; Techniques Informatiques et structuration de terminologiques,
18(1):87&#8211;110.
</p>
<p>BOURIGAULT, D. et JACQUEMIN, C. (2000). Constitution de ressources terminologiques. In
Ing&#233;nierie des langues, chapitre 9, pages 215&#8211;233. Hermes Science. Sous la direction de Jean-
Marie Pierrel.
</p>
<p>CABR&#201;, M. T. (1999). Terminology. Theory, methods and applications, volume 1 de Terminology
and Lexicography, Research and practice. John Benjamins, Amsterdam/Philadelphia.
</p>
<p>CARABALLO, S. (1999). Automatic acquisition of a hypernym-labeled noun hierarchy from text.
In Proceedings of the 37th Annual Meeting of the Association for Computational Linguistics ACL99,
pages 120&#8211;126.
</p>
<p>CIMIANO, P., STAAB, S. et TANE, J. (2000). Automatic acquisition oftaxonomies from text : Fca
meets nlp. In Proceedings of the ECMLPKDD Workshop on Adaptive Text Extraction and Mining
CavtatDubrovnik Croatia, pages 10&#8211;17.
</p>
<p>CLAVEAU, V. et L&#8217;HOMME, M.-C. (2004). Discoveringe specific semantic relationships between
nouns and verbs in a specialized french corpus. In Proceedings of the 3rd International Workshop
on Computational Terminology, CompuTerm&#8217;04, pages 39&#8211;46, Gen&#232;ve, Suisse.
</p>
<p>CLAVEAU, V. et L&#8217;HOMME, M.-C. (2005). Apprentissage par analogie pour la structuration de
terminologie-utilisation compar&#233;e de ressources endog&#232;nes et exog&#232;nes. In Conf&#233;rence TIA-2005,
Rouen, 4 et 5 avril 2005, Montr&#233;al, Canada.
</p>
<p>CRUSE, D. A. (1986). Lexical Semantics. Cambridge University Press, Cambridge.
</p>
<p>DAILLE, B. (2003). Conceptual structuring through term variations. In BOND, F., KOHONEN, A.,
CARTHY, D. M. et VILLACIENCIO, A., &#233;diteurs : Proceedings of the ACL&#8217;2003 Workshop on Multiword
Expressions : Analysis, Acquisition, and Treatment, pages 9&#8211;16.
</p>
<p>FELLBAUM, C., &#233;diteur (1998). WordNet : An Electronic Lexical Database. MIT Press, Cambridge,
MA.
</p>
<p>FERRET, O. (2011). Utiliser l&#8217;amor&#231;age pour am&#233;liorer une mesure de similarit&#233; s&#233;mantique. In
Actes de TALN 2011, pages 1&#8211;6, Montpellier.
</p>
<p>GANTER, B. et WILLE, R. (1999). Formal concept analysis - mathematical foundations. Springer.
</p>
<p>GRABAR, N. et HAMON, T. (2006). Terminology structuring through the derivational morphology.
In SALAKOSKI, T., GINTER, F., PYYSALO, S. et PAHIKKALA, T., &#233;diteurs : Advances in Natural Language
Processing (5th International Conference on NLP, FinTAL 2006), num&#233;ro 4139 de LNAI, pages
652&#8211;663. Springer.
</p>
<p>GRABAR, N. et ZWEIGENBAUM, P. (2002). Lexically-based terminology structuring : some inherent
limits. In Proceedings of Computerm&#8217;2002 (Second Workshop on Computational Terminology),
Taiwan.
</p>
<p>GREFENSTETTE, G. (1994). Exploration in Automatic Thesaurus Discovery. Kluwer Academic
Publishers, Boston, USA.
</p>
<p>GROUIN, C., ABACHA, A. B., BERNHARD, D., CARTONI, B., DEL&#201;GER, L., GRAU, B., LIGOZAT, A.-L.,
MINARD, A.-L., ROSSET, S. et ZWEIGENBAUM, P. (2010). Caramba : Concept, assertion, and relation
annotation using machine-learning based approaches. In Proceedings of the workshop I2B2 2010.
</p>
<p>173</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HAMON, T. (2005). Indexer les documents sp&#233;cialis&#233;s : les ressources terminologiques contr&#244;l&#233;es
sont-elles suffisantes ? In 6e&#768;me rencontres Terminologie et Intelligence Artificielle, pages 71&#8211;82,
Rouen, France.
</p>
<p>HAMON, T. et GRABAR, N. (2008). Acquisition of elementary synonym relations from biological
structured terminology. In GELBUKH, A., &#233;diteur : Computational Linguistics and Intelligent Text
Processing - 9th International Conference, CICLing - Proceedings, num&#233;ro 4919 de LNCS, pages
40&#8211;51, Haifa, Israel. Springer-Verlag Berlin Heidelberg.
</p>
<p>HAMON, T., GRA&#209;A, M., RAGGIO, V., GRABAR, N. et NAYA, H. (2010). Identification of relations
between risk factors and their pathologies or health conditions by mining scientific literature.
In MEDINFO 2010, pages 964&#8211;968. Stud Health Technol Inform. PMID : 20841827.
</p>
<p>HAMON, T. et NAZARENKO, A. (2001). Detection of synonymy links between terms : experiment
and results. In Recent Advances in Computational Terminology, pages 185&#8211;208. John Benjamins.
</p>
<p>HAMON, T. et NAZARENKO, A. (2008). Le d&#233;veloppement d&#8217;une plate-forme pour l&#8217;annotation
sp&#233;cialis&#233;e de documents web : retour d&#8217;exp&#233;rience. Traitement Automatique des Langues,
49(2):127&#8211;154.
</p>
<p>HARRIS, Z. (1990). La gen&#232;se de l&#8217;analyse des transformations et de la m&#233;talangue. Langages,
99:9&#8211;20. A. Daladier (resp.).
</p>
<p>HEARST, M. A. (1992). Automatic acquisition of hyponyms from large text corpora. In In
Proceedings of the 14th International Conference on Computational Linguistics, pages 539&#8211;545.
</p>
<p>IBEKWE-SANJUAN, F. (2005). Inclusion lexicale et proximit&#233; s&#233;mantique entre termes. In Actes de
la conf&#233;rence TIA 2005, pages 45&#8211;57, Rouen.
</p>
<p>JACQUEMIN, C. (1997). Variation terminologique : Reconnaissance et acquisition automatiques
de termes et de leurs variantes en corpus. M&#233;moire d&#8217;habilitation &#224; diriger des recherches en
informatique fondamentale, Universit&#233; de Nantes.
</p>
<p>JACQUEMIN, C. (1999). Syntagmatic and paradigmatic representations of term variation. In
37th Annual Meeting of the Association for Computational Linguistics (ACL&#8217;99), pages 341&#8211;348,
University of Maryland.
</p>
<p>KIM, J.-D., OHTA, T., TATEISI, Y. et TSUJII, J. (2003). GENIA corpus - a semantically annotated
corpus for bio-textmining. In ISMB (Supplement of Bioinformatics), pages 180&#8211;182.
</p>
<p>LINDBERG, D., HUMPHREYS, B. et MCCRAY, A. (1993). The unified medical language system.
Methods of Information in Medicine, 32(4):281&#8211;291.
</p>
<p>MARTIENNE, E. et MORIN, E. (1999). Using s symbolic machine learning tool to refine lexico-
syntactic patterns. Rapport de Recherche 183, Institut de Recherche en Informatique de Nantes
(IRIN).
</p>
<p>MCCRAE, J. et COLLIER, N. (2008). Synonym set extraction from the biomedical literature by
lexical pattern discovery. BMC Bioinformatics, 9:159+.
MCINTOSH, T. et CURRAN, J. R. (2009). Challenges for automatically extracting molecular
interactions from full-text articles. BMC Bioinformatics, 10:311+.
MEYER, I. (2001). Extracting Knowledge-rich Contexts for Terminography. In BOURIGAULT, D.,
JACQUEMIN, C. et L&#8217;HOMME, M., &#233;diteurs : Recent Advances in Computational Terminology, pages
279&#8211;302. John Benjamins, Amsterdam/Philadelphia.
MORIN, E. (1999). Extraction de liens s&#233;mantiques entre termes &#224; partir de corpus de textes
techniques. Th&#232;se de doctorat, Universit&#233; de Nantes, FRANCE, Universit&#233; de Nantes, Nantes,
FRANCE.
</p>
<p>174</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NAMER, F. et BAUD, R. (2007). Defining and relating biomedical terms : towards a cross-language
morphosemantics-based system. Int J Med Inform, 76(2-3):226&#8211;233.
</p>
<p>PYYSALO, S., OHTA, T. et TSUJII, J. (2011). Overview of the entity relations (rel) supporting task
of bionlp shared task 2011. In Proceedings of BioNLP Shared Task 2011 Workshop, pages 83&#8211;88,
Portland, Oregon, USA. Association for Computational Linguistics.
</p>
<p>RESNIK, P. (1993). Selection and Information : A Class-Based Approach to Lexical Relationships.
Th&#232;se de doctorat, University of Pennsylvania.
</p>
<p>R&#216;ST, T. B., AKBAR, S., &#216;ystein NYTR&#216; et BASGALUPP, M. (2010). Medical relation extraction with
semantic grammars. In Proceedings of the workshop I2B2 2010.
</p>
<p>SAGER, J. C. (1990). A Practical Course in Terminology Processing. John Benjamins, Amsterdam.
</p>
<p>SCHUMANN, A.-K. (2011). A case study of knowledge-rich context extraction in russian. In
KAGEURA, K. et ZWEIGENBAUM, P., &#233;diteurs : Proceedings of the 9th International Conference on
Terminology and Artificial Intelligence (TIA 2011), pages 143&#8211;146, INaLCO.
</p>
<p>SNOW, R., JURAFSKY, D. et NG, A. Y. (2005). Learning syntactic patterns for automatic hypernym
discovery. In SAUL, L. K., WEISS, Y. et BOTTOU, L., &#233;diteurs : Advances in Neural Information
Processing Systems 17, pages 1297&#8211;1304. MIT Press, Cambridge, MA.
</p>
<p>SPASIC, I., ANANIADOU, S., MCNAUGHT, J. et KUMAR, A. (2005). Text mining and ontologies in
biomedicine : making sense of raw text. Briefings in Bioinformatics, 6(3):239&#8211;251.
</p>
<p>THE GENE ONTOLOGY CONSORTIUM (2000). Gene ontology : tool for the unification of biology.
Nature genetics, 25:25&#8211;29.
</p>
<p>TSURUOKA, Y., TATEISHI, Y., KIM, J.-D., OHTA, T., MCNAUGHT, J., ANANIADOU, S. et TSUJII, J. (2005).
Developing a robust part-of-speech tagger for biomedical text. In Proceedings of Advances in
Informatics - 10th Panhellenic Conference on Informatics, LNCS 3746, pages 382&#8211;392.
</p>
<p>VERSPOOR, C. M., JOSLYN, C. et PAPCUN, G. J. (2003). The gene ontology as a source of lexical
semantic knowledge for a biological natural language processing application. In SIGIR workshop
on Text Analysis and Search for Bioinformatics, pages 51&#8211;56.
</p>
<p>WEISSENBACHER, D. (2004). La relation de sysnonymie en g&#233;nomique. In Actes de la conf&#233;rence
RECITAL&#8217;2004, F&#232;s, Maroc.
</p>
<p>YANG, H. et de ROECK, A. (2010). Extraction of medical information using crfs, context patterns,
and dependency parse trees. In Proceedings of the workshop I2B2 2010.
</p>
<p>ZWEIGENBAUM, P. et GRABAR, N. (2000). Liens morphologiques et structuration de terminologie.
In Actes IC&#8217;2000, pages 325&#8211;334, Toulouse, France.
</p>
<p>175</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div>
</div></div>
</body></html>