<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Cr&#233;ation d&#8217;un multi-arbre &#224; partir d&#8217;un texte balis&#233; : l&#8217;exemple de l&#8217;annotation d&#8217;un corpus d&#8217;oral spontan&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 109&#8211;122,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Cr&#233;ation d&#8217;un multi-arbre &#224; partir d&#8217;un texte balis&#233; : l&#8217;exemple
de l&#8217;annotation d&#8217;un corpus d&#8217;oral spontan&#233;
</p>
<p>Julie Beli&#227;o
LPP - Universit&#233; Paris Sorbonne Nouvelle (ILPGA) - CNRS - UMR 7018
</p>
<p>MoDyCo - Universit&#233; Paris Ouest Nanterre La D&#233;fense - CNRS - UMR 7114
</p>
<p>julie@beliao.fr
</p>
<p>R&#201;SUM&#201;
Dans cette &#233;tude, nous nous int&#233;ressons au probl&#232;me de l&#8217;analyse d&#8217;un corpus annot&#233; de l&#8217;oral. Le
syst&#232;me d&#8217;annotation consid&#233;r&#233; est celui introduit par l&#8217;&#233;quipe des syntacticiens du projet Rhapsodie.
La principale probl&#233;matique qui sous-tend un tel projet est que la base &#233;crite sur laquelle on travaille
est en r&#233;alit&#233; une transcription de l&#8217;oral, balis&#233;e par les annotateurs de mani&#232;re &#224; d&#233;limiter un
ensemble de structures arborescentes. Un tel syst&#232;me introduit plusieurs structures, en particulier
macro et micro-syntaxiques. Du fait de leur &#233;troite imbrication, il s&#8217;est av&#233;r&#233; difficile de les analyser
de fa&#231;on ind&#233;pendante et donc de travailler sur l&#8217;aspect macro-syntaxique ind&#233;pendamment de
l&#8217;aspect micro-syntaxique. Cependant, peu d&#8217;&#233;tudes jusqu&#8217;&#224; pr&#233;sent consid&#232;rent ces probl&#232;mes
conjointement et de mani&#232;re automatis&#233;e. Dans ce travail, nous pr&#233;sentons nos efforts en vue
de produire un outil de parsing capable de rendre compte &#224; la fois de l&#8217;information micro et
macro-syntaxique du texte annot&#233;. Pour ce faire, nous proposons une repr&#233;sentation partant de la
notion de multi-arbre et nous montrons comment une telle structure peut &#234;tre g&#233;n&#233;r&#233;e &#224; partir de
l&#8217;annotation et utilis&#233;e &#224; des fins d&#8217;analyse.
</p>
<p>ABSTRACT
Creating a Multi-Tree from a Tagged Text : Annotating Spoken French
</p>
<p>This study focuses on automatic analysis of annotated transcribed speech. The annotation system
considered has been recently introduced to address the several limitations of classical syntactic
annotations when faced to natural speech transcriptions. It introduces many different components
such as embedding, piles, kernels, pre-kernels, discursive markers etc.. All those components are
tightly coupled in a complex tree structure and can hardly be considered separately because of their
close intrication. Hence, a joint analysis is required but no analysis tool to handle them all together
was available yet. In this study, we introduce such an automatic parser of annotated transcriptions
of speech and present the corresponding framework based on multi-trees. This framework permits
to jointly handle separate aspects of speech such as macro and micro syntactic levels, which are
traditionnaly considered separately. Several applications are proposed, including analysis of the
transcribed speech by classical parsers designed for written language.
</p>
<p>MOTS-CL&#201;S : Arbres syntaxiques, unit&#233; illocutoire, unit&#233;s rectionnelles, micro-syntaxe, macro-
syntaxe, entassement.
</p>
<p>KEYWORDS: Syntactic trees, illocutionary unit, microsyntax, macrosyntax, piles.
</p>
<p>109</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Le projet ANR Rhapsodie (Rhapsodie, 2012) a pour but de cr&#233;er un corpus de trois heures de
parole transcrite, annot&#233; en prosodie et en syntaxe, qui serve de r&#233;f&#233;rence pour le fran&#231;ais parl&#233;.
Une analyse et une annotation prosodique et syntaxique sont r&#233;alis&#233;es ind&#233;pendamment l&#8217;une de
l&#8217;autre sur l&#8217;ensemble du corpus, de mani&#232;re &#224; permettre une &#233;tude intono-syntaxique(Benzitoun
et al., 2009)(Benzitoun et al., 2010)(Lacheret-Dujour et al., 2011). Nous nous concentrerons ici sur
la t&#226;che d&#8217;exploitation informatique du corpus annot&#233; syntaxiquement.
</p>
<p>La probl&#233;matique qui sous-tend le syst&#232;me d&#8217;annotation syntaxique de Rhapsodie est que le
fran&#231;ais parl&#233; transcrit ne pr&#233;sente que peu de similitudes par rapport &#224; la syntaxe de l&#8217;&#233;crit
pour pouvoir &#234;tre trait&#233; directement par des parsers syntaxiques tels que FRMG (de la Clergerie
et al., 2009). Les transcriptions de l&#8217;oral sur lesquelles ont travaill&#233; les syntacticiens ne sont ni
ponctu&#233;es, ni segment&#233;es et comportent un grand nombre de ph&#233;nom&#232;nes propres &#224; l&#8217;oral tels
que les disfluences, les greffes (d&#233;crites en section 3.3), etc. Ce sont ces particularit&#233;s inh&#233;rentes
&#224; la transcription du fran&#231;ais parl&#233; qui posent probl&#232;me aux parsers classiques. Les syntacticiens
de Rhapsodie ont donc d&#233;velopp&#233; un syst&#232;me d&#8217;annotation syntaxique centr&#233; sur le cas de l&#8217;oral
(Benzitoun et al., 2009)(Benzitoun et al., 2010). Leurs travaux se basent sur ceux de l&#8217;&#233;cole d&#8217;Aix
(Blanche-Benveniste et al., 1990) et sur la syntaxe de d&#233;pendance introduite par Tesni&#232;re (Tesni&#232;re,
1959). Ce syst&#232;me de balisage manuel dispose de suffisamment de souplesse pour rendre compte
d&#8217;un grand nombre de ph&#233;nom&#232;nes relatifs &#224; la micro et &#224; la macro-syntaxe. Cependant, aucune
repr&#233;sentation informatique n&#8217;&#233;tait jusqu&#8217;&#224; pr&#233;sent disponible pour exploiter ce formalisme de
mani&#232;re automatis&#233;e. Dans cette &#233;tude, nous introduisons une telle repr&#233;sentation et montrons
comment elle peut &#234;tre mise &#224; profit pour l&#8217;analyse de la parole transcrite annot&#233;e.
</p>
<p>Dans un premier temps, nous pr&#233;senterons bri&#232;vement les diff&#233;rents niveaux micro et macro-
syntaxiques consid&#233;r&#233;s en section 2. Ensuite, nous pr&#233;ciserons le syst&#232;me d&#8217;annotation utilis&#233; en
section 3. Enfin, la notion de multi-arbre sera discut&#233;e pour sa repr&#233;sentation informatique en
section 4 puis exploit&#233;e dans le but de proc&#233;der &#224; une analyse automatique de la parole annot&#233;e.
</p>
<p>2 Ph&#233;nom&#232;nes micro et macro syntaxiques
</p>
<p>2.1 Unit&#233;s rectionnelles
</p>
<p>L&#8217;approche adopt&#233;e ici est une approche &#8220;de bas en haut&#8221; (Benzitoun et al., 2010; Lacheret-Dujour
et al., 2011). Une Unit&#233; Rectionnelle (UR) est une unit&#233; construite autour d&#8217;une t&#234;te, qui n&#8217;est &#224;
priori syntaxiquement d&#233;pendante d&#8217;aucun &#233;l&#233;ment de rang sup&#233;rieur dans le texte. La rection
est caract&#233;ris&#233;e par les contraintes impos&#233;es sur une position donn&#233;e en termes de parties du
discours, de marques morphologiques et de possibilit&#233;s de restructuration (commutation avec un
pronom, effacement, passivation, clivage, etc.). Il est important de souligner le fait que les UR ne
sont pas d&#233;finies dans l&#8217;absolu. C&#8217;est toujours relativement &#224; un texte donn&#233; que l&#8217;on peut affirmer
raisonnablement que certaines constructions ne d&#233;pendent d&#8217;aucune cat&#233;gorie du contexte. Les
UR, unit&#233;s micro-syntaxiques sont souvent consid&#233;r&#233;es comme les unit&#233;s significatives maximales
et sont d&#233;finies &#224; la fois par leur connexit&#233; rectionnelle interne et par leur autonomie externe
(Berrendonner, 2002) : &#8220;La micro-syntaxe vise &#224; d&#233;crire des constructions syntaxiques con&#231;ues comme
des ensembles rectionnels complets&#8221; (Benzitoun et al., 2010).
</p>
<p>110</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.2 Unit&#233;s Illocutoires
</p>
<p>Parall&#232;lement &#224; l&#8217;UR, il y a l&#8217;Unit&#233; Illocutoire (UI) dont la d&#233;limitation est li&#233;e &#224; la reconnaissance de
la force illocutoire qui peut affecter un segment dans un texte. UR et UI sont des unit&#233;s relativement
autonomes qui ont leurs propres r&#232;gles de formation et leurs propres combinatoires. L&#8217;UI fait partie
de la macro-syntaxe et &#8220;on appelle unit&#233; illocutoire une portion de discours comportant un unique acte
illocutoire, soit une assertion, soit une interrogation, soit une injonction&#8221;. (Benzitoun et al., 2010)
</p>
<p>Les syntacticiens de Rhapsodie ont consid&#233;r&#233; que ces deux modules de l&#8217;analyse syntaxique sont
compl&#233;mentaires mais que la sortie de l&#8217;un ne constitue pas l&#8217;entr&#233;e de l&#8217;autre. Ainsi les UI sont
constitu&#233;es d&#8217;UR vari&#233;es, allant de l&#8217;interjection &#224; des constructions plus complexes &#224; plusieurs
ench&#226;ssements. Les UI peuvent donc combiner plusieurs UR, mais leurs fronti&#232;res ne co&#239;ncident
pas forc&#233;ment entre elles.
</p>
<p>Le principe d&#8217;annotation consiste &#224; segmenter par une balise ad&#233;quate d&#232;s que l&#8217;on ne peut plus
effectuer de rattachement micro-syntaxique &#224; l&#8217;int&#233;rieur du texte. Dans le cadre de notre &#233;tude, ce
travail est effectu&#233; manuellement.
</p>
<p>Chaque UI se d&#233;compose en un certain nombre d&#8217;unit&#233;s, prosodiquement marqu&#233;es &#8212; c&#8217;est du
moins l&#8217;hypoth&#232;se qui est faite : (Blanche-Benveniste, 1997)(Cresti, 2000) &#8212; que l&#8217;on appelle
composantes illocutoires (CI). Ces unit&#233;s sont nomm&#233;es suivant leur position par rapport au noyau.
Le noyau (kernel) est l&#8217;UR qui comporte la force illocutoire de l&#8217;UI. Les autres UR, d&#233;pourvues de
force illocutoire, s&#8217;associent au noyau et sont appel&#233;es : pr&#233;noyaux (prekernel) &#224; gauche du noyau,
in-noyaux (inkernel) dans le noyau ou post-noyaux (postkernel) &#224; droite du noyau.
</p>
<p>3 Balisage de la transcription
Dans cette section, nous pr&#233;sentons le syst&#232;me de balisage manuel introduit dans (Benzitoun et al.,
2009)(Benzitoun et al., 2010) et permettant d&#8217;annoter la transcription selon les niveaux de la micro
et macro-syntaxes.
</p>
<p>3.1 Balisage des UI
</p>
<p>&#8211; Les UI sont d&#233;limit&#233;es par le symbole // qui est une marque de fin d&#8217;UI 1 :
a. on peut apr&#232;s passer le concours de l&#8217;agreg pour enseigner &#224; l&#8217;universit&#233; // (&#233;chantillon
M103-Corpus Rhapsodie)
</p>
<p>&#8211; Par d&#233;faut, le symbole //, qui marque la fin d&#8217;une UI, marque aussi la fin d&#8217;une UR. Cependant,
UR et UI ne se correspondent pas toujours. Le symbole //+ (le + indique de mani&#232;re g&#233;n&#233;rale
une relation de rection) indique que l&#8217;UR se poursuit apr&#232;s la fin de l&#8217;UI.
b. c&#8217;est un Chinois //+ tr&#232;s riche // (&#233;chantillon D210-Corpus Rhapsodie)
</p>
<p>&#8211; La notion de parall&#233;lisme permet d&#8217;identifier la mise en paral&#232;lle de deux UIs. Les parall&#232;lismes
sont annot&#233;s par le signe //=.
c. &quot;oh&quot; tout est relatif //= tout est relatif // (&#233;chantillon D009-Corpus Rhapsodie)
</p>
<p>1. Pour des raisons p&#233;dagogiques, tous les exemples donn&#233;s dans cet article sont simples et ne comportent chacun
qu&#8217;une partie des ph&#233;nom&#232;nes &#233;tudi&#233;s afin de les mettre en &#233;vidence. Cela-dit, il est entendu que le formalisme pr&#233;sent&#233;
est op&#233;rationnel et a &#233;t&#233; test&#233; pour plus de trois heures de fran&#231;ais parl&#233; spontan&#233;. La plupart du temps l&#8217;ensemble des
ph&#233;nom&#232;nes sont r&#233;alis&#233;s simultan&#233;ment.
</p>
<p>111</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.2 Balisage des marqueurs d&#8217;UR et de Composante illocutoire
</p>
<p>3.2.1 Pr&#233;-noyau, post-noyaux, in-noyaux
</p>
<p>&#8211; Le pr&#233;-noyau, annot&#233; &lt; (ou &lt;+ si relation de rection).
a. bien &#233;videmment &lt; c&#8217;est vrai pour la peinture religieuse en Occident // (&#233;chantillon M202-Corpus
Rhapsodie)
b. au d&#233;but &lt;+ il n&#8217; y avait pratiquement pas d&#8217; informatique // (&#233;chantillon D005-Corpus Rhapsodie)
</p>
<p>&#8211; Les symboles &gt; et &gt;+ signalent les post-noyaux :
a. ^et &quot;euh&quot; Charlot s&#8217;est accus&#233; &gt; plut&#244;t que de laisser la jeune fille s&#8217;accuser // (&#233;chantillon
M024-Corpus Rhapsodie)
b. ^mais vous &#233;tiez aupr&#232;s des femmes &gt;+ l&#224;-bas // (&#233;chantillon D204-Corpus Rhapsodie)
</p>
<p>&#8211; L&#8217;in-noyau est annot&#233; par les symboles ( ) et (+ ) :
a. une rallonge &#224; venir ( &#233;galement ) dans le secteur automobile // (&#233;chantillon M206-Corpus
Rhapsodie)
b. le cri de Job (+ que nous avons entendu dans la premi&#232;re lecture ) retentit &#224; nos oreilles //
(&#233;chantillon M203-Corpus Rhapsodie)
</p>
<p>3.2.2 Introducteurs
</p>
<p>&#8211; Une UI peut commencer par un ou plusieurs introducteurs. Ces &#233;l&#233;ments ont la fonction de
pr&#233;ciser la nature de la relation entre l&#8217;UI qu&#8217;ils introduisent et d&#8217;autres UI dans le discours
(notamment l&#8217;UI qui pr&#233;c&#232;de). On les annote par le symbole ^.
a. ^donc c&#8217;est pas normal qu&#8217;ils arrivent en CP ne parlant pas fran&#231;ais // (&#233;chantillon D002-Corpus
Rhapsodie)
b. ^et tu arrives &#224; la fontaine place Notre Dame // (&#233;chantillon M001-Corpus Rhapsodie)
</p>
<p>&#8211; Sont annot&#233;s avec le m&#234;me symbole les marqueurs d&#8217;entassement ou joncteurs comme et, ou,
mais, etc :
c. { les uns | ^et les autres } (&#233;chantillon M203-Corpus Rhapsodie)
</p>
<p>3.3 Balisage des ench&#226;ssements et parenth&#232;ses
</p>
<p>Une UI peut se trouver &#224; l&#8217;int&#233;rieur d&#8217;une autre UI. On distingue deux cas, les ench&#226;ssements et les
insertions.
&#8211; Le discours rapport&#233; dans cet exemple, &quot;casse-toi pauvre con&quot; forme une UI. Par contre, &quot;il a dit&quot;
</p>
<p>n&#8217;est ni une UI compl&#232;te, ni une UR compl&#232;te. On consid&#232;re donc que &quot;casse-toi pauvre con&quot; dans
&quot;il a dit casse-toi pauvre con&quot; est r&#233;gi par le verbe dire.
a. il a dit [ casse-toi &gt; pauvre con // ] //
</p>
<p>&#8211; La greffe est la r&#233;alisation d&#8217;une UI au sein d&#8217;une UI. &#8220;Il s&#8217;agit du proc&#233;d&#233; qui consiste &#224; remplir
une position syntaxique &#224; l&#8217;aide d&#8217;une autre cat&#233;gorie que celle attendue&#8221; (Deulofeu, 1999). Ces
deux types d&#8217;ench&#226;ssement sont annot&#233;s par des crochets et un marqueur de fin d&#8217;UI [ //] :
b. vous avez dit que [ disons ma carri&#232;re pour simplifier // ] t&#233;moigne de ma bonne conduite //
(&#233;chantillon D201-Corpus Rhapsodie)
</p>
<p>&#8211; L&#8217;ench&#226;ssement ne contient pas toujours une UI, en effet il peut aussi contenir des sous-
composantes d&#8217;une composante illocutoire (CI). Ici il s&#8217;agit d&#8217;un ench&#226;ssement d&#8217;une proposition
avec un pr&#233;-noyau mais qui n&#8217;est pas une UI :
c. ce qui fait que [ au moment de la guerre &lt; nous &#233;tions toujours en Bretagne ] // (&#233;chantillon
D003-Corpus Rhapsodie)
</p>
<p>112</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; On parle d&#8217;insertion d&#8217;UI chaque fois qu&#8217;une UI vient interrompre momentan&#233;ment une autre UI.
On utilise les parenth&#232;ses simples ( ) pour d&#233;limiter l&#8217;UI ins&#233;r&#233;e.
d. &quot;euh&quot; et sinon &lt; les sp&#233;cialit&#233;s { les m~ | un { peu moins ( je sais pas si c&#8217;est &#231;a qui vous int&#233;resse
// ) | petit peu moins } } prises &lt; &quot;bah&quot; { { c&#8217;est les | c&#8217;est les } sp&#233;cialit&#233;s &#224; risques //+ | { la gyn&#233;co
obst&#233;trique ( par exemple ) | la canc&#233;rologie } } // (&#233;chantillon D006-Corpus Rhapsodie)
</p>
<p>3.4 Balisage des Entassements
</p>
<p>Les entassement font normalement partie de la micro-syntaxe, l&#8217;entassement, aussi appel&#233; pile
(voir (Gerdes et Kahane, 2009)(Kahane et Pietrandrea, 2012)(Kahane, 2012)), est un dispositif
de connexion syntaxique qui relie tous les &#233;l&#233;ments qui occupent la m&#234;me position syntaxique &#224;
l&#8217;int&#233;rieur de l&#8217;UR. On utilise les symboles { et } pour marquer le d&#233;but et la fin de la liste et | pour
signaler le ou les points de jonction dans le prolongement des listes paradigmatiques et de l&#8217;analyse
en grille propos&#233;es dans (Blanche-Benveniste, 1990). Les conjoints ne sont pas n&#233;cessairement des
constituants micro-syntaxiques mais peuvent &#234;tre des disfluences par exemple :
</p>
<p>a. ^et { la | la } Loire est en bas // (&#233;chantillon D003-Corpus Rhapsodie)
</p>
<p>4 L&#8217;arbre complet et son exploitation
</p>
<p>La r&#233;alisation d&#8217;un balisage manuel permettant d&#8217;encoder de l&#8217;information macro et micro-
syntaxique implique de r&#233;aliser un parsing de ce balisage afin de pouvoir l&#8217;exploiter. Il y a trois
raisons importante pour cela :
</p>
<p>1. La cr&#233;ation &#224; partir du balisage d&#8217;une multi-arborescence macro et micro-syntaxique dans la
transcription afin d&#8217;en extraire des arbres topologiques et d&#8217;entassement.
</p>
<p>2. Pouvoir &#224; partir des diff&#233;rents parcours de cet arbre, fournir une version d&#233;pli&#233;e de la
transcription afin de faciliter la t&#226;che de l&#8217;analyseur syntaxique automatique.
</p>
<p>3. &#192; partir de l&#8217;arbre initial et des r&#233;sultats du parser automatique, restituer l&#8217;ordre original
des mots de la transcription et proc&#233;der &#224; leur int&#233;gration dans la structure arborescente
initialement annot&#233;e.
</p>
<p>Dans le but de r&#233;aliser ces diff&#233;rentes t&#226;ches, il a dont fallu impl&#233;menter un algorithme capable de
r&#233;aliser ces diff&#233;rentes t&#226;ches.
</p>
<p>La grammaire de balisage d&#233;velopp&#233;e ne rentrant pas dans les cadres classiques des grammaires
non-contextuelles ou m&#234;me des grammaires-contextuelles d&#8217;ordre k, il a &#233;t&#233; n&#233;cessaire de mettre
au point un parser ad-hoc pouvant permettre l&#8217;analyse de l&#8217;int&#233;gralit&#233; des symboles du balisage.
L&#8217;objectif de cette partie est de mettre en &#233;vidence l&#8217;utilit&#233; de r&#233;unir en tant qu&#8217;objets, l&#8217;information
micro, macro-syntaxique et d&#8217;entassement dans un m&#234;me arbre appel&#233; multi-arbre. Pour des raisons
de place, nous ne d&#233;taillons pas ici l&#8217;agorithme de parsage, d&#233;crit dans (Beliao et Liutkus, 2012),
mais nous concentrons plut&#244;t sur l&#8217;utilit&#233; de la repr&#233;sentation arbor&#233;e qu&#8217;il produit.
</p>
<p>On appellera arbre une structure de donn&#233;es qui peut se repr&#233;senter sous la forme d&#8217;une hi&#233;rarchie
dont chaque &#233;l&#233;ment est appel&#233; n&#339;ud. Dans notre cas, nous avons choisi d&#8217;impl&#233;menter un
parser qui construit un arbre multiple ou englobant qui repr&#233;sente &#224; la fois l&#8217;information micro et
macro-syntaxique. Ainsi chaque n&#339;ud correspond &#224; un type d&#8217;unit&#233; et est typ&#233; en tant qu&#8217;unit&#233;
illocutoire, entassement, ench&#226;ssement, marqueur discursif et de mani&#232;re g&#233;n&#233;rale tout typage
donn&#233; par le balisage. Ainsi, cet arbre int&#232;gre toutes les informations contenues dans le balisage.
</p>
<p>113</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;impl&#233;mentation d&#8217;un tel arbre pr&#233;sente l&#8217;avantage de pouvoir &#234;tre parcouru selon un point de
vue macro et micro-syntaxique ou les deux en m&#234;me temps, permettant diff&#233;rents traitements
impliquant ou non toute l&#8217;information.
</p>
<p>Nous allons pr&#233;senter en sous-section 4.1 une s&#233;rie d&#8217;exemples qui nous permettront de constater
que le balisage peut se repr&#233;senter efficacement sous la forme d&#8217;un arbre. Nous pr&#233;senterons
ensuite en sous-section 4.2 l&#8217;op&#233;ration de d&#233;pliage, qui consiste, &#224; partir de l&#8217;arbre, &#224; g&#233;n&#233;rer
un ensemble de phrases susceptibles d&#8217;&#234;tre trait&#233;es par un analyseur syntaxique automatique.
Nous pr&#233;senterons ensuite en sous-section 4.3 l&#8217;op&#233;ration que nous avons &#233;voqu&#233;e plus haut et
qui consiste &#224; extraire du multi-arbre les noeuds d&#233;sir&#233;s pour en obtenir un arbre particularis&#233;.
Nous verrons que l&#8217;obtention de l&#8217;arbre topologique et de l&#8217;arbre des entassements sont des cas
particuliers de cette op&#233;ration de projection. Nous &#233;voquerons ensuite la phase de repliage en
section 4.4, qui consiste &#224; r&#233;int&#233;grer au multi-arbre l&#8217;information donn&#233;e par le parser automatique.
Enfin, nous montrerons en sous-section 4.5 comment le multi-arbre arbre peut &#234;tre utilis&#233; de
mani&#232;re naturelle pour convertir l&#8217;information d&#8217;annotation dans un format structur&#233; tel que XML.
</p>
<p>4.1 Exemples d&#8217;arbres
</p>
<p>Consid&#233;rons l&#8217;exemple suivant :
</p>
<p>a. vous avez dit que [ disons ma carri&#232;re pour simplifier // ] t&#233;moigne de ma bonne conduite //
(&#233;chantillon D201-Corpus Rhapsodie)
</p>
<p>Cet exemple 2 peut &#234;tre repr&#233;sent&#233; comme indiqu&#233; dans la figure 1. En effet, on voit que cette
phrase est compos&#233;e de deux UI, la deuxi&#232;me &#233;tant ench&#226;ss&#233;e dans le noyau de la premi&#232;re par
une greffe. Cette deuxi&#232;me UI contient un noyau.
</p>
<p>|=&gt; root :
|=&gt; iu :
</p>
<p>|=&gt; ru :
|=&gt; kerne l : vous avez d i t que [ . . . ] t&#233;moigne de ma bonne conduite
</p>
<p>|=&gt; g r a f t :
|=&gt; ui :
</p>
<p>|=&gt; ru :
|=&gt; kerne l : d i sons ma c a r r i &#232; r e pour s i m p l i f i e r
</p>
<p>FIGURE 1 &#8211; Repr&#233;sentation macro de a.
</p>
<p>Dans cet exemple, on n&#8217;a pas encore consid&#233;r&#233; le ph&#233;nom&#232;ne d&#8217;entassement. Consid&#233;rons donc
l&#8217;exemple suivant :
</p>
<p>b. les f&#234;tes y sont { plus | plus } nombreuses // (&#233;chantillon D101-Corpus Rhapsodie)
</p>
<p>On voit que cette UI contient une UR de type noyau.
</p>
<p>Cependant, certains de ses &#233;l&#233;ments : &#8220;plus, plus&#8221; sont entass&#233;s (disfluence) selon deux couches. On
observe donc par le balisage que ce segment est un entassement inclut dans un noyau. Le typage
noyau correspond &#224; une information macro-syntaxique ind&#233;pendante du typage des entassements
qui rel&#232;ve de la micro-syntaxe. On peut assimiler ces deux informations &#224; deux niveaux ou encore
deux dimensions diff&#233;rentes du discours et plusieurs approches sont envisageables ici.
</p>
<p>2. Pour des raisons didactiques les num&#233;ros d&#8217;identifiant des lex&#232;mes ont &#233;t&#233; remplac&#233;s par les token-mots dans les
exemples donn&#233;s.
</p>
<p>114</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La premi&#232;re approche consisterait &#224; repr&#233;senter de mani&#232;re ind&#233;pendante les d&#233;pendances macro-
syntaxiques (noyaux, pr&#233;-noyaux, ench&#226;ssements, etc) et les informations d&#8217;entassements sous la
forme de deux arbres &#8220;projet&#233;s&#8221;. Elle pr&#233;senterait l&#8217;avantage d&#8217;offrir directement au sp&#233;cialiste une
repr&#233;sentation pertinente selon le point de vue d&#233;sir&#233;. Ainsi, on obtiendrait deux arbres donn&#233;s
en figure 2, un premier arbre contenant l&#8217;information macro et un deuxi&#232;me arbre contenant
l&#8217;information des entassements.
</p>
<p>Information macro :
|=&gt; root :
</p>
<p>|=&gt; iu :
|=&gt; ru :
</p>
<p>|=&gt; kerne l : l e s f &#234; t e s y sont p lus p lus nombreuses
</p>
<p>Information des entassements :
|=&gt; root :
</p>
<p>|=&gt; ui : l e s f &#234; t e s y sont [ . . . ] nombreuses
|=&gt; p i l e :
</p>
<p>|=&gt; l a y e r : p lus
|=&gt; l a y e r : p lus
</p>
<p>FIGURE 2 &#8211; Abres donnant l&#8217;information macro (haut) et l&#8217;information des entassements pour
l&#8217;exemple b. (bas)
</p>
<p>Cependant, comme on le verra en sous-section 4.2, certaines taches ne sont plus r&#233;alisables si une
telle disjonction est faite car l&#8217;information port&#233;e par l&#8217;un des deux typage sera perdue.
</p>
<p>Par cons&#233;quent, la deuxi&#232;me approche consiste &#224; int&#233;grer l&#8217;ensemble de ces informations dans
la m&#234;me structure, c&#8217;est &#224; dire de consid&#233;rer dans le m&#234;me arbre l&#8217;information macro et micro-
syntaxique. Par exemple, on peut repr&#233;senter l&#8217;UI consid&#233;r&#233;e par l&#8217;arbre donn&#233; en figure 3 ( l&#8217;id&#233;al
&#233;tant un graphe) :
</p>
<p>|=&gt; root :
|=&gt; iu :
</p>
<p>|=&gt; ru
|=&gt; kerne l : l e s f &#234; t e s y sont [ . . . ] nombreuses
|=&gt; p i l e :
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : p lus
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : p lus
</p>
<p>FIGURE 3 &#8211; Repr&#233;sentation macro+entassement de b.
</p>
<p>Cet arbre, dit &#8220;multiple&#8221; contient ainsi l&#8217;ensemble des informations contenues dans le balisage, ce
qui est n&#233;cessaire pour certains traitements comme on le verra en sous-section 4.2. Cependant, il a
l&#8217;inconv&#233;nient pour le syntacticien de ne pas repr&#233;senter de mani&#232;re conventionnelle l&#8217;information
syntaxique. Cela dit, il est possible de ne garder de cet arbre que l&#8217;information micro ou macro-
syntaxique de mani&#232;re &#224; obtenir des repr&#233;sentations plus conventionnelles comme on le verra en
section 4.3.
</p>
<p>Consid&#233;rons un autre exemple un peu plus complexe :
</p>
<p>c. il faut avoir un don sp&#233;cial parce que [ la psychiatrie &lt; { c&#8217; est | c&#8217; est } quelque chose ] //
(&#233;chantillon D006-Corpus Rhapsodie)
</p>
<p>L&#8217;ensemble peut &#234;tre repr&#233;sent&#233; sous la forme de l&#8217;arbre donn&#233; en figure 4 :
</p>
<p>115</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>|=&gt; root :
|=&gt; iu :
</p>
<p>|=&gt; ru :
|=&gt; kerne l : i l f au t avo i r un don s p &#233; c i a l parce que
|=&gt; embedded :
</p>
<p>|=&gt; prekerne l : l a p s y c h i a t r i e
|=&gt; p i l e :
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : c &#8217; e s t
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : c &#8217; e s t
</p>
<p>|=&gt; kerne l : quelque chose
</p>
<p>FIGURE 4 &#8211; Repr&#233;sentation macro+entassement+micro de c.
</p>
<p>4.2 D&#233;pliage
</p>
<p>L&#8217;une des premi&#232;res applications possibles de l&#8217;arbre est de proc&#233;der au d&#233;pliage du texte. On
entend par d&#233;pliage du texte un r&#233;arrangement des entassements permettant ensuite une analyse
syntaxique automatique par un programme informatique. En effet les structures d&#8217;entassement,
d&#8217;ench&#226;ssement et de parenth&#232;sage, particuli&#232;rement courantes &#224; l&#8217;oral, ne sont pas analysables en
l&#8217;&#233;tat par les analyseurs syntaxiques qui sont calibr&#233;s pour l&#8217;&#233;crit. Les parsers ne savent pas traiter les
disfluences et font encore beaucoup d&#8217;erreurs sur les coordinations (difficult&#233; avec le rattachement
du deuxi&#232;me conjoint). Le d&#233;pliage va donc explorer chaque chemin de l&#8217;entassement et donne
une UR bien form&#233;e sans entassement (Gerdes et Kahane, 2009). Il est n&#233;cessaire de fournir des
segments syntaxiques d&#233;barrass&#233;s de tout ph&#233;nom&#232;nes de l&#8217;oral &#224; ce type de programme.
</p>
<p>Consid&#233;rons le premier exemple suivant :
</p>
<p>a. les f&#234;tes y sont { plus | plus } nombreuses // (&#233;chantillon D101-Corpus Rhapsodie)
</p>
<p>Le d&#233;pliage correspondant est donn&#233; figure 5.
</p>
<p>Unrol led sentences :
l e s f &#234; t e s y sont p lus nombreuses
l e s f &#234; t e s y sont p lus nombreuses
</p>
<p>FIGURE 5 &#8211; D&#233;pliage correspondant &#224; l&#8217;exemple a.
</p>
<p>Pour obtenir ce d&#233;pliage, il nous a fallu prendre en compte les &#233;l&#233;ments micro-syntaxiques (ici
l&#8217;entassement) et macro-syntaxiques (l&#8217;UI compos&#233;e d&#8217;un noyau), pour ce faire le multi-arbre donn&#233;
figure 3 est n&#233;cessaire.
</p>
<p>Soit &#224; pr&#233;sent l&#8217;exemple suivant :
</p>
<p>b. ^alors le petit fauteuil { que j&#8217;ai { l&#224; | &#224; c&#244;t&#233; } | que je veux rhabiller } a toujours &#233;t&#233; appel&#233; par
mes parents fauteuil-crapaud // (&#233;chantillon D009-Corpus Rhapsodie)
</p>
<p>Le multi-arbre obtenu est repr&#233;sent&#233; sur la figure 6 et le d&#233;pliage qui en r&#233;sulte sur la figure 7.
</p>
<p>116</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>|=&gt; root :
|=&gt; iu :
</p>
<p>|=&gt; ru :
|=&gt; i n t r o : a l o r s
</p>
<p>|=&gt; ru :
|=&gt; kerne l : l e p e t i t f a u t e u i l [ . . . ] a tou jour s
</p>
<p>&#233; t&#233; appel&#233; par mes parents f a u t e u i l&#8722;crapaud
|=&gt; p i l e :
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : que j &#8217; a i
|=&gt; p i l e :
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : l &#224;
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : &#224; c&#244;t&#233;
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : que j e veux r h a b i l l e r
</p>
<p>FIGURE 6 &#8211; multi-arbre de b.
</p>
<p>a l o r s
l e p e t i t f a u t e u i l que j &#8217; a i l &#224; a tou jour s &#233; t&#233; appel&#233; par mes parents f a u t e u i l crapaud
l e p e t i t f a u t e u i l que j &#8217; a i &#224; c&#244;t&#233; a tou jour s &#233; t&#233; appel&#233; par mes parents f a u t e u i l crapaud
l e p e t i t f a u t e u i l que j e veux r h a b i l l e r a tou jour s &#233; t&#233; appel&#233; par mes parents f a u t e u i l crapaud
</p>
<p>FIGURE 7 &#8211; UR d&#233;pli&#233;es extraites du multi-arbre de b. et envoy&#233;e au parser automatique
</p>
<p>Ici on constate que chaque alternative d&#8217;entassement (chaque couche qui compose la pile) est
explor&#233;e, chaque couche de chaque pile va venir occuper le r&#244;le syntaxique qu&#8217;elle doit occuper.
On obtient donc autant d&#8217;alternatives qu&#8217;il y a de piles et de couches dans une pile. On notera
&#233;galement que les &#233;l&#233;ments de type introducteurs (ici : alors), marqueurs discursifs etc [...] sont
&#8220;s&#233;par&#233;s&#8221; des autres UR car eux aussi peuvent perturber l&#8217;analyse syntaxique automatique. En aucun
cas ils ne seront ignor&#233;s, ils seront r&#233;int&#233;gr&#233;s (cf section 4.4) aux autres UR apr&#232;s l&#8217;analyse en ligne
du parser FRMG par un algorithme de &#8220;repliage&#8221; (cf (Beliao et Liutkus, 2012)).
</p>
<p>De plus, il est important de voir que l&#8217;information d&#8217;entassement n&#8217;est pas suffisante &#224; elle seule
pour fournir le d&#233;pliage de l&#8217;arbre, mais que le multi-arbre complet est bien n&#233;cessaire &#224; cette t&#226;che.
En effet l&#8217;information d&#8217;entassement est d&#8217;ordre micro-syntaxique et n&#8217;est pas suffisante pour la
t&#226;che de d&#233;pliage car on l&#8217;a vu plus haut, les marqueurs discursifs aussi peuvent poser probl&#232;me et
que l&#8217;on a donc besoin parall&#232;lement de l&#8217;information macro. Consid&#233;rons l&#8217;exemple suivant :
</p>
<p>c. il faut avoir un don sp&#233;cial parce que [ la psychiatrie &lt; { c&#8217; est | c&#8217; est } quelque chose ] //
(&#233;chantillon D006-Corpus Rhapsodie)
</p>
<p>L&#8217;UI contient un ench&#226;ssement dans lequel on remarque une UR de type pr&#233;-noyau et un noyau
contenant un entassement. Si l&#8217;on ignore l&#8217;une de ces informations le d&#233;pliage ne serait que partiel.
Si l&#8217;on consid&#232;re seulement l&#8217;information en UR, le pr&#233;-noyau &#8220;la psychiatrie&#8221; sera effectivement
extrait mais on obtiendra une UI contenant la disfluence &#8220;c&#8217;est c&#8217;est&#8221;, ce qui ne manquerait pas de
provoquer un probl&#232;me au moment de passage dans le parser automatique. Une fois de plus le
multi-arbre s&#8217;av&#232;re indispensable.
</p>
<p>l a p s y c h i a t r i e
i l f au t avo i r un don s p &#233; c i a l parce que c &#8217; e s t quelque chose
i l f au t avo i r un don s p &#233; c i a l parce que c &#8217; e s t quelque chose
</p>
<p>FIGURE 8 &#8211; D&#233;pliage r&#233;sultant de l&#8217;analyse de c.
</p>
<p>117</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le d&#233;pliage obtenu figure 8 nous permet de constater que le pr&#233;-noyau &#8220;la psychiatrie&#8221; a bien &#233;t&#233;
sorti des phrases g&#233;n&#233;r&#233;es, ce qui n&#8217;aurait pas &#233;t&#233; possible si l&#8217;information topologique avait &#233;t&#233;
&#233;limin&#233;e par la consid&#233;ration d&#8217;un arbre simple.
</p>
<p>4.3 Projections
</p>
<p>On a vu pr&#233;c&#233;demment que l&#8217;arbre complet &#233;tait n&#233;cessaire &#224; l&#8217;op&#233;ration de d&#233;pliage. En effet si l&#8217;on
veut obtenir un tri des ph&#233;nom&#232;nes &#224; extraire provisoirement des UI et les multiples possibilit&#233;s
qu&#8217;offrent les piles, la concomitance de ces informations au sein du m&#234;me arbre est indispensable.
</p>
<p>Pour faire un parall&#232;le g&#233;om&#233;trique, on peut difficilement conceptualiser un hypercube. L&#8217;op&#233;ration
de projection ou d&#8217;extraction consiste ainsi &#224; diminuer le nombre de dimensions pr&#233;sentes dans le
multi-arbre, de mani&#232;re &#224; se focaliser sur un point de vue particulier, cela revient &#224; extraire l&#8217;arbre
voulu, par la s&#233;lection des noeuds d&#233;sir&#233;s.
</p>
<p>Prenons l&#8217;exemple suivant :
</p>
<p>a. ^alors ce que je souhaiterais faire de ma vie &lt; c&#8217;est { devenir professeur d&#8217;italien &#224; savoir certifi&#233; |
donc &quot;euh&quot; enseigner { au coll&#232;ge | ^ainsi ^qu&#8217;au lyc&#233;e } } // (&#233;chantillon M103-Corpus Rhapsodie)
</p>
<p>Le multi-arbre obtenu est donn&#233; en figure 9 et l&#8217;arbre macro-syntaxique correspondant est donn&#233;
figure 10. En revanche si l&#8217;on souhaite &#233;tudier uniquement les ph&#233;nom&#232;nes d&#8217;entassement, on peut
obtenir un arbre d&#8217;entassement par l&#8217;extraction des n&#339;uds d&#8217;entassement uniquement, donn&#233;e
figure 11. Les arbres projet&#233;s macro-syntaxiques et d&#8217;entassement sont obtenus comme leur nom
l&#8217;indique par des projections des n&#339;uds voulus sur le multi-arbre. Admettons que l&#8217;on veuille l&#8217;arbre
d&#8217;entassement, il suffit de n&#8217;afficher que les n&#339;uds relatifs &#224; l&#8217;information d&#8217;entassement etc...
</p>
<p>|=&gt; root :
|=&gt; iu :
</p>
<p>|=&gt; ru :
|=&gt; i n t r o : a lo r s , a i n s i qu &#8217;
</p>
<p>|=&gt; ru :
|=&gt; prekerne l : ce que j e s o u h a i t e r a i s f a i r e de ma v ie
</p>
<p>|=&gt; ru :
|=&gt; kerne l : c &#8217; e s t [ . . . ]
|=&gt; p i l e :
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : devenir p ro f e s seu r d &#8217; i t a l i e n &#224; s a v o i r c e r t i f i &#233;
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : donc ense igner
|=&gt; p i l e :
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : au c o l l &#232; g e
</p>
<p>|=&gt; l a y e r :
|=&gt; kerne l : au l yc&#233;e
</p>
<p>|=&gt; ru :
|=&gt; d i scur s i vemarker : euh
</p>
<p>FIGURE 9 &#8211; Multi-arbre r&#233;sultant de l&#8217;analyse de a.
</p>
<p>118</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>|=&gt; root :
|=&gt; iu :
</p>
<p>|=&gt; ru :
|=&gt; i n t r o : a lo r s , a i n s i qu &#8217;
</p>
<p>|=&gt; ru :
|=&gt; prekerne l : ce que j e s o u h a i t e r a i s f a i r e de ma v ie
</p>
<p>|=&gt; ru :
|=&gt; kerne l : c &#8217; e s t devenir p ro f e s seu r d &#8217; i t a l i e n &#224; s a v o i r
</p>
<p>c e r t i f i &#233; , donc enseigner , au co l l &#232;ge , au lyc&#233;e
|=&gt; ru :
</p>
<p>|=&gt; d i scur s i vemarker : euh
</p>
<p>FIGURE 10 &#8211; Arbre projet&#233; de macro-syntaxe r&#233;sultant de l&#8217;analyse de a.
|=&gt; root :
</p>
<p>|=&gt; p i l e :
|=&gt; l a y e r : devenir p ro f e s seu r d &#8217; i t a l i e n &#224; s a v o i r c e r t i f i &#233;
|=&gt; l a y e r : euh donc ense igner
</p>
<p>|=&gt; p i l e :
|=&gt; l a y e r : au c o l l &#232; g e
|=&gt; l a y e r : a i n s i qu &#8217; au l yc&#233;e
</p>
<p>FIGURE 11 &#8211; Arbre projet&#233; des entassements r&#233;sultant de l&#8217;analyse de a.
Ces arbres projet&#233;s ont &#233;t&#233; obtenus par l&#8217;application d&#8217;un algorithme de regroupement des n&#339;uds
sur l&#8217;arbre complet. Pour des raisons de place, on ne rentrera pas dans les d&#233;tails de cet algorithme
ici 3.
</p>
<p>4.4 Repliage des r&#233;sultats du parser automatique
</p>
<p>Nous avons vu que la phase de d&#233;pliage visait &#224; simplifier le parsage par un analyseur automatique.
Pour chaque d&#233;pliage possible d&#8217;une UI, une analyse automatique produit un ensemble de traits
syntaxiques et un syst&#232;me de d&#233;pendance. Le repliage consiste &#224; repercuter tous ces traits et
liens de d&#233;pendance sur la transcription originale. Cette phase complexe est rendue possible par
l&#8217;identification des &#233;l&#233;ments communs aux diff&#233;rents d&#233;pliages et par le fait que les donn&#233;es sont
repr&#233;sent&#233;s comme des objets, pouvant avoir plusieurs attributs et liens entre eux.
</p>
<p>Pour chaque lex&#232;me, on obtient ainsi autant de r&#244;les syntaxiques et de liens de d&#233;pendance que
le nombre d&#8217;UI d&#233;pli&#233;es dans lesquelles ce lex&#232;me apparait. L&#8217;avantage de cette phase est qu&#8217;elle
permet de d&#233;sambiguiser l&#8217;analyse syntaxique de certains lex&#232;mes, par exemple en choisissant
pour trait syntaxique (genre, nb etc...) de chaque mot celui qui apparait le plus de fois ou, en cas
d&#8217;&#233;galit&#233;, de choisir le dernier (crit&#232;re de proximit&#233;). Ainsi, dans :
</p>
<p>a. &#8220;j&#8217;ai achet&#233; { un | une } baguette //&#8221;
</p>
<p>le lex&#232;me baguette re&#231;oit le trait f&#233;minin, malgr&#233; les segments d&#233;pli&#233;s contradictoires envoy&#233;s au
parser automatique :
</p>
<p>j &#8217; a i achet&#233; un baguette
j &#8217; a i achet&#233; une baguette
</p>
<p>Une propri&#233;t&#233; int&#233;ressante de l&#8217;approche par d&#233;pliage/repliage est qu&#8217;elle permet &#8212; avec seulement
des modifications mineures &#8212; de consid&#233;rer plusieurs annotations diff&#233;rentes du m&#234;me texte. En
effet, chaque annotation diff&#233;rente produirait son propre lot de d&#233;pliages &#224; analyser. Le repliage
permettrait alors de rendre compte des ces diff&#233;rentes annotation et rendrait possible une plus
grande robustesse en cas d&#8217;ambiguit&#233;s dans les choix des annotateurs.
</p>
<p>3. l&#8217;algorithme est consultable dans le rapport technique (Beliao et Liutkus, 2012).
</p>
<p>119</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour finir, la phase de repliage permet de visualiser l&#8217;ensemble des traits et d&#233;pendances ainsi
construits directement sur la transcription originale.
</p>
<p>4.5 Conversion en formats structur&#233;s
</p>
<p>L&#8217;un des objectifs du traitement du balisage est l&#8217;obtention de donn&#233;es structur&#233;es. On cherche &#224;
g&#233;n&#233;rer &#224; partir du corpus annot&#233; l&#8217;ensemble des arbres topologiques et des arbres d&#8217;entassement
possibles. Pour ce faire, l&#8217;&#233;quipe de recherche a opt&#233; pour une structure XML, ce format sert de
format d&#8217;import-export pour le corpus annot&#233; et la base SQL du projet. &#192; terme, tous les r&#233;sultats
des diff&#233;rentes phases d&#8217;annotations syntaxiques du corpus sont donc appel&#233;s &#224; &#234;tre charg&#233;s
dans une base de donn&#233;es SQL. Le tables relationnelles de la base sont enrichies &#224; partir de ces
fichiers XML. Le format XML des diff&#233;rentes phase d&#8217;annotaion sert &#233;galement d&#8217;input au logiciel
Vakyartha-Arborator (Gerdes, 2012) qui permet &#224; l&#8217;&#233;quipe des syntacticiens de proc&#233;der &#224; une
phase de v&#233;rification et correction manuelle apr&#232;s les phases de projection, d&#233;pliage et repliage des
donn&#233;es annot&#233;es.
</p>
<p>La probl&#233;matique qui se pose est donc de convertir des structures de donn&#233;es obtenues vers des
fichiers structur&#233;s XML. La repr&#233;sentation du balisage sous la forme d&#8217;arbre permet d&#8217;effectuer
cette t&#226;che de mani&#232;re triviale &#224; partir du multi-arbre. Pour l&#8217;op&#233;ration de projection de la micro
ou de la macro-syntaxe, des algorithmes r&#233;cursifs tr&#232;s simples permettent de convertir un arbre en
format structur&#233; de type XML.
</p>
<p>Pour l&#8217;exemple a. on aura la repr&#233;sentation de la figure 12 pour la repr&#233;sentation topologique et la
figure 13 pour la repr&#233;sentation de l&#8217;entassement.
</p>
<p>a. ^qui ( donc ) reste { toute seule | fort &#233;tonn&#233;e } // (&#233;chantillon M002-Corpus Rhapsodie)
</p>
<p>&lt;cons t ree cons t_ type=&quot; topology &quot; id=&quot; a &quot;&gt;
&lt;const type=&quot; iu &quot;&gt;
</p>
<p>&lt;const type=&quot; i n t r o &quot;&gt;
&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; qui &quot; /&gt;
</p>
<p>&lt;/ const&gt;
&lt;const type=&quot; i nke rne l &quot;&gt;
</p>
<p>&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; donc &quot; /&gt;
&lt;/ const&gt;
&lt;const type=&quot; kerne l &quot;&gt;
</p>
<p>&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; r e s t e &quot; /&gt;
&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; toute &quot; /&gt;
&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; seu le &quot; /&gt;
&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; f o r t &quot; /&gt;
&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; &#233;tonn&#233;e &quot; /&gt;
</p>
<p>&lt;/ const&gt;
&lt;/ const&gt;
</p>
<p>&lt;/ cons t ree&gt;
</p>
<p>FIGURE 12 &#8211; Arbre topologique r&#233;sultant de l&#8217;analyse de a.
</p>
<p>120</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&lt;cons t ree cons t_ type=&quot; p i l e &quot; id=&quot; a &quot;&gt;
&lt;const type=&quot; p i l e &quot;&gt;
</p>
<p>&lt;const type=&quot; l a y e r &quot;&gt;
&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; toute &quot; /&gt;
&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; seule &#8217; &quot; /&gt;
</p>
<p>&lt;/ const&gt;
&lt;const type=&quot; l a y e r &quot;&gt;
</p>
<p>&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; f o r t &quot; /&gt;
&lt;const cons t_ type=&quot; lexeme &quot; id=&quot; &#233;tonn&#233;e &quot; /&gt;
</p>
<p>&lt;/ const&gt;
&lt;/ const&gt;
</p>
<p>&lt;/ cons t ree&gt;
</p>
<p>FIGURE 13 &#8211; Arbre d&#8217;entassement r&#233;sultant de l&#8217;analyse de a.
</p>
<p>Apr&#232;s le passage des UI d&#233;pli&#233;es dans l&#8217;analyseur automatique on proc&#232;de au repliage des UIs
d&#233;pli&#233;es et on obtient &#8212;apr&#232;s modification de certains traits et ajout de certains liens&#8212; un arbre de
d&#233;pendance au format XML. Pour l&#8217;UI de exemple a. nous obtiendrons alors l&#8217;arbre de d&#233;pendance
XML de la figure 14.
</p>
<p>a. les f&#234;tes y sont { plus | plus } nombreuses //
&lt;dependency id=&quot; dep33 &quot; markupIU=&quot; l e s f &#234; t e s y sont { plus | p lus } nombreuses // &quot;&gt;
</p>
<p>&lt; l i n k depid=&quot; p lus &quot; func=&quot; dep &quot; govid=&quot; nombreuses &quot; id=&quot; func402 &quot; /&gt;
&lt; l i n k depid=&quot; p lus &quot; func=&quot; dep &quot; govid=&quot; nombreuses &quot; id=&quot; func403 &quot; /&gt;
&lt; l i n k depid=&quot; l e s &quot; func=&quot; dep &quot; govid=&quot; f &#234; t e s &quot; id=&quot; func404 &quot; /&gt;
&lt; l i n k depid=&quot; f &#234; t e s &quot; func=&quot; sub &quot; govid=&quot; sont &quot; id=&quot; func405 &quot; /&gt;
&lt; l i n k depid=&quot; y &quot; func=&quot; ad &quot; govid=&quot; sont &quot; id=&quot; func406 &quot; /&gt;
&lt; l i n k depid=&quot; sont &quot; func=&quot; root &quot; id=&quot; func407 &quot; /&gt;
&lt; l i n k depid=&quot; nombreuses &quot; func=&quot; pred &quot; govid=&quot; sont &quot; id=&quot; func408 &quot; /&gt;
</p>
<p>&lt;/dependency&gt;
</p>
<p>FIGURE 14 &#8211; Arbre de d&#233;pendance obtenu apr&#232;s repliage des UI d&#233;pli&#233;es r&#233;sultant de a.
</p>
<p>Le multi-arbre n&#8217;est pas g&#233;n&#233;r&#233; en format XML dans le cadre du projet, il n&#8217;est utilis&#233; que comme
structure relais permettant l&#8217;ensemble des traitements n&#233;cessaires &#224; la r&#233;alisation des t&#226;ches de
d&#233;pliage et de projection.
</p>
<p>5 Conclusion
</p>
<p>Dans cette pr&#233;sentation on a propos&#233; une syst&#233;matisation informatique du syst&#232;me d&#8217;annotation
du corpus Rhapsodie pour son exploitation par un parser FRMG. Cette proposition allie une
repr&#233;sentation sous forme d&#8217;arbre, adapt&#233;e au formalisme souhait&#233;, et les diff&#233;rents algorithmes
permettant de mettre en &#339;uvre cette proposition. Dans cette &#233;tude, nous nous sommes concentr&#233;s
sur la pr&#233;sentation de cette repr&#233;sentation et sur les diff&#233;rents traitements qu&#8217;elle permet. La
pr&#233;sentation des traitements informatiques correspondants fait l&#8217;objet d&#8217;un rapport technique
ind&#233;pendant.
</p>
<p>Il a &#233;t&#233; vu que l&#8217;impl&#233;mentation dans un multi-arbre de la totalit&#233; de l&#8217;information encod&#233;e
dans le balisage est n&#233;cessaire pour certains traitements, tels que le d&#233;pliage, montrant qu&#8217;une
exploitation conjointe des niveaux micro et macro-syntaxiques est parfois n&#233;cessaire. Ce multi-arbre
peut ais&#233;ment &#234;tre projet&#233; &#8212; ou particularis&#233; &#8212; pour ne plus inclure qu&#8217;un sous ensemble des
informations qu&#8217;il contient.
</p>
<p>Un grand nombre de points &#233;voqu&#233;s dans cette &#233;tude peuvent faire l&#8217;objet de travaux ult&#233;rieurs.
Tout d&#8217;abord, il est possible d&#8217;&#233;tendre la pr&#233;sente &#233;tude au cas o&#249; plusieurs annotations sont
</p>
<p>121</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>disponibles pour la m&#234;me transcription. Ensuite, il ne semble pas que la notion d&#8217;arbre, limit&#233;e
au cas o&#249; chaque noeud n&#8217;a qu&#8217;un seul p&#232;re, permette de rendre compte de tous les liens de
d&#233;pendance envisageables. Un graphe, plus g&#233;n&#233;ral, pourrait &#234;tre plus ad&#233;quat dans ce but.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BELIAO, J. et LIUTKUS, A. (2012). Rapport technique provisoire des algorithmes utilis&#233;s pour le
parsing d&#8217;un corpus de francais oral annot&#233;. Rapport technique, HAL : halshs-00682283 version 1.
</p>
<p>BENZITOUN, C., DISTER, A., GERDES, K., KAHANE, S. et MARLET, R. (2009). annoter du des textes
tu te demandes si c&#8217;est syntaxique tu vois. The 28th Conference on Lexis and Grammar, Arena
Romanistica 4, Presses de l&#8217;Universit&#233; de Bergen:16&#8211;27.
</p>
<p>BENZITOUN, C., DISTER, A., GERDES, K., KAHANE, S., PIETRANDREA, P. et SABIO, F. (2010). Tu veux
couper l&#224; faut dire pourquoi. propositions pour une segmentation syntaxique du francais parl&#233;.
Actes du Congr&#232;s Mondial de Linguistique Francaise, La Nouvelle Orl&#233;ans.
BERRENDONNER, A. (2002). Morpho-syntaxe, pragma-syntaxe et ambivalences s&#233;mantiques. An-
dersen, N. Nolke (&#233;ds). Macro-syntaxe et macro-s&#233;mantique. Actes du colloque d&#8217;Aarhus, pages
23&#8211;41.
</p>
<p>BLANCHE-BENVENISTE, C. (1990). Un mod&#232;le d&#8217;analyse syntaxique &#8217;en grilles&#8217; pour les productions
orales. Anuario de Psicologia Liliane Tolchinsky (coord.) Barcelona, vol. 47:11&#8211;28.
BLANCHE-BENVENISTE, C. (1997). Approches de la langue parl&#233;e en francais. Paris : Ophrys.
BLANCHE-BENVENISTE, C., BILGER, M., ROUGET, C. et van den EYND, K. (1990). Le fran&#231;ais parl&#233;.
&#233;tudes grammaticales. Paris, CNRS &#201;ditions.
CRESTI, E. (2000). Corpus di italiano parlato. Florence, Accademia della Crusca.
de la CLERGERIE, E., SAGOT, B., NICOLAS, L. et GU&#201;NOT, M.-L. (2009). Frmg : &#233;volutions d&#8217;un
analyseur syntaxique tag du francais. 11th International Conference on Parsing Technologies
(IWPT&#8217;09).
DEULOFEU, J. (1999). Recherches sur les formes de la pr&#233;dication dans les &#233;nonc&#233;s assertifs en fran&#231;ais
contemporain (le cas des &#233;nonc&#233;s introduits par le morph&#232;me que). Th&#232;se de doctorat, Universit&#233;
Paris 3.
</p>
<p>GERDES, K. (2012). Arborator : A tool for collaborative dependency annotation. http ://arbora-
tor.ilpga.fr/vakyartha/.
GERDES, K. et KAHANE, S. (2009). Speaking in piles : Paradigmatic annotation of french spoken
corpus. Proceedings of the Fifth Corpus Linguistics Conference, Liverpool.
KAHANE, S. (2012). De l&#8217;analyse en grille &#224; la mod&#233;lisation des entassements. (&#224; paraitre)
Hommage &#224; Claire Blanche-Benveniste, Presses de l&#8217;universit&#233; de Provence., in S. Caddeo, M.-N.
Roubaud, M. Rouquier, F. Sabio &#233;ds.
</p>
<p>KAHANE, S. et PIETRANDREA, P. (2012). Typologie des entassements en francais. In Actes de la
conf&#233;rence Linx.
LACHERET-DUJOUR, A., KAHANE, S., PIETRANDREA, P., AVANZI, M. et VICTORRI, B. (2011). Oui mais
elle est o&#249; la coupure, l&#224; ? Quand syntaxe et prosodie s&#8217;entraident ou se compl&#232;tent. Langue
fran&#231;aise, Paris-Larousse, 170:61&#8211;80.
RHAPSODIE (2012). Site du projet rhapsodie, corpus prosodique de r&#233;f&#233;rence en francais parl&#233;.
http ://rhapsodie.risc.cnrs.fr.
TESNI&#200;RE, L. (1959). &#201;l&#233;ments de syntaxe structurale. Librairie C. Klincksieck.
</p>
<p>122</p>

</div></div>
</body></html>