<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Incr&#233;mentation lexicale dans les textes : une auto-organisation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 15&#8211;28,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Incr&#233;mentation lexicale dans les textes :  
une auto-organisation 
</p>
<p>Matthias Tauveron 
Fonctionnements Discursifs et Traduction 
</p>
<p>UR LiLPa, Universit&#233; de Strasbourg 
</p>
<p>matthias.tauveron@etu.unistra.fr 
</p>
<p>RESUME 
</p>
<p>Nous proposons une &#233;tude dynamique du lexique, en d&#233;crivant la mani&#232;re dont il 
</p>
<p>s&#8217;organise progressivement du d&#233;but &#224; la fin d&#8217;un texte. Pour ce faire, nous nous 
</p>
<p>focalisons sur la co-occurrence g&#233;n&#233;ralis&#233;e, en formant un graphe qui repr&#233;sente tous les 
</p>
<p>lemmes du texte et synth&#233;tise leurs relations mutuelles de co-occurrence. L&#8217;&#233;tude d&#8217;un 
</p>
<p>corpus de 40 textes montre que ces relations &#233;voluent d&#8217;une mani&#232;re auto-organis&#233;e : la 
</p>
<p>forme &#8211; et l&#8217;identit&#233; &#8211; du graphe de co-occurrence restent stables apr&#232;s une phase 
</p>
<p>d&#8217;organisation termin&#233;e avant la 1&#232;re moiti&#233; du texte. Ensuite, il n&#8217;&#233;volue plus : les 
</p>
<p>nouveaux mots et les nouvelles relations de co-occurrence s&#8217;inscrivent peu &#224; peu dans le 
</p>
<p>r&#233;seau, sans modifier la forme d&#8217;ensemble de la structure. La relation de co-occurrence 
</p>
<p>g&#233;n&#233;ralis&#233;e dans un texte appara&#238;t donc comme la construction rapide d&#8217;un syst&#232;me, qui 
</p>
<p>est ensuite assez souple pour canaliser un flux d&#8217;information sans changer d&#8217;identit&#233;. 
</p>
<p>ABSTRACT 
</p>
<p>Lexical Incrementation within Texts: a Self-Organization 
</p>
<p>We propose here a dynamic study of lexicon: we describe how it is organized 
</p>
<p>progressively from the beginning to the end of a given text. We focus on the &#8220;generalized 
</p>
<p>co-occurrence&#8221;, forming a graph that represents all the lemmas of the text and their 
</p>
<p>mutual co-occurrence relations. The study of a corpus of 40 texts shows that these 
</p>
<p>relations have a self-organized evolution: the shape and the identity of the graph of co-
</p>
<p>occurrence become stable after a period of organization finished before the first half of the 
</p>
<p>text. Then they no longer change: new words and new co-occurrence relations gradually 
</p>
<p>take place in the network without changing its overall shape. We show that the evolution 
</p>
<p>of the &#8220;generalized co-occurrence&#8221; is the quick construction of a system, which is then 
</p>
<p>flexible enough to channel the flow of information without changing its identity. 
</p>
<p>MOTS-CLES : Texte ; lexique ; co-occurrence g&#233;n&#233;ralis&#233;e ; auto-organisation 
</p>
<p>KEYWORDS: Text; lexicon; generalized co-occurrence; self-organization 
</p>
<p>1 Introduction 
Le texte n&#8217;est pas qu&#8217;une suite lin&#233;aire de mots, propositions ou phrases. Il cro&#238;t au fur et 
</p>
<p>&#224; mesure de son d&#233;roulement, &#224; la mani&#232;re d&#8217;une boule de neige et poss&#232;de ainsi une 
</p>
<p>dimension &#171; incr&#233;mentielle &#187; (Legallois, 2006). Nous proposons ici d&#8217;&#233;tudier cette 
</p>
<p>incr&#233;mentation au niveau lexical. Nous montrons que le texte est un agencement 
</p>
<p>complexe mais non anarchique de mots &#8211; comme (Adam, 2004, 35) l&#8217;a dit &#224; propos des 
</p>
<p>15</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>propositions &#8211; et proposons une description de la dynamique de cet agencement. Notre 
</p>
<p>propos porte sur la &#171; texture &#187; ou la &#171; textualit&#233; &#187;, c&#8217;est-&#224;-dire la dimension formelle des 
</p>
<p>textes et leur organisation, et ne concerne pas directement le sens ni sa construction en 
</p>
<p>discours. 
</p>
<p>L&#8217;agencement des mots sera envisag&#233; ici au travers de leurs relations de co-occurrence. 
</p>
<p>Sous le nom de co-occurrence g&#233;n&#233;ralis&#233;e, l&#8217;&#233;tude de l&#8217;ensemble des relations de co-
</p>
<p>occurrence entre les lemmes d&#8217;un texte ou d&#8217;un corpus permet de r&#233;v&#233;ler l&#8217;organisation en 
</p>
<p>r&#233;seau de son lexique (V&#233;ronis, 2004, Viprey, 2006, Paranyushkin, 2010). Ces &#233;tudes en 
</p>
<p>restent cependant &#224; une image statique, montrant le r&#233;seau de co-occurrences tel qu&#8217;il se 
</p>
<p>d&#233;ploie une fois le texte lu dans son entier. Nous proposons ici une &#233;tude de la dynamique 
</p>
<p>de cette co-occurrence g&#233;n&#233;ralis&#233;e en montrant son &#233;volution du d&#233;but &#224; la fin d&#8217;un texte. 
</p>
<p>Notre corpus de travail est form&#233; en premier lieu de 20 textes courts (200 &#224; 2000 mots, 
</p>
<p>total de 11.015 mots), et en second lieu de 20 textes longs (5.000 &#224; 22.500 mots, total de 
</p>
<p>192.477 mots). 
</p>
<p>Dans les cas typiques que nous observons, le r&#233;seau de co-occurrence g&#233;n&#233;ralis&#233;e cro&#238;t 
</p>
<p>tr&#232;s progressivement au d&#233;but du texte. Cependant, de mani&#232;re surprenante, &#224; l&#8217;issue 
</p>
<p>d&#8217;une premi&#232;re phase termin&#233;e avant la 1&#232;re moiti&#233; du texte, ce r&#233;seau atteint un stade qui, 
</p>
<p>sans &#234;tre totalement fig&#233;, n&#8217;&#233;volue plus gu&#232;re par la suite. Ce r&#233;seau s&#8217;est donc form&#233; une 
</p>
<p>identit&#233; qui reste stable malgr&#233; l&#8217;apport ult&#233;rieur d&#8217;information. L&#8217;incr&#233;mentation lexicale 
</p>
<p>dans la suite du texte ne fait que renforcer cette identit&#233;. Nous pensons qu&#8217;un tel 
</p>
<p>comportement ob&#233;it &#224; la d&#233;finition que Moreno (2004) a donn&#233; des syst&#232;mes auto-
</p>
<p>organis&#233;s : ce sont des syst&#232;mes qui connaissent une construction progressive de leur 
</p>
<p>identit&#233;. Nous expliciterons les arguments qui militent pour et contre la caract&#233;risation 
</p>
<p>du r&#233;seau de co-occurrence g&#233;n&#233;ralis&#233;e comme syst&#232;me auto-organis&#233;, en montrant les 
</p>
<p>enjeux linguistiques et cognitifs sous-jacents &#224; cette question. 
</p>
<p>2 M&#233;thode 
</p>
<p>2.1 Corpus 
Notre corpus de textes courts est fait d&#8217;&#233;ditoriaux de revues scientifiques (revues 
</p>
<p>D&#233;veloppement durable et territoire, Vertigo, Langages) et universitaires (revue 
</p>
<p>Savoir(s), &#171; magazine d&#8217;information de l&#8217;Universit&#233; de Strasbourg &#187;). Une fois les 
</p>
<p>premiers r&#233;sultats obtenus, la d&#233;marche a &#233;t&#233; appliqu&#233;e au corpus de textes longs : 
</p>
<p>articles scientifiques (Langages 182 sur les th&#233;ories du langage et les politiques des 
</p>
<p>linguistes, Intellectica, 40 sur la notion de repr&#233;sentation) et encyclop&#233;diques 
</p>
<p>(Wikip&#233;dia, articles biographiques et analyses d&#8217;&#339;uvres dans le domaine musical, grands 
</p>
<p>articles portant sur la vie en soci&#233;t&#233;, tels &#171; Religion &#187;, &#171; D&#233;mocratie &#187;). Nous disposons 
</p>
<p>&#233;galement d&#8217;un corpus de contr&#244;le (textes totalement diff&#233;rents du corpus de travail sur 
</p>
<p>lesquels on applique la m&#234;me m&#233;thode, pour en tester le fonctionnement, le bien-fond&#233; et 
</p>
<p>la d&#233;marche) fait de deux textes po&#233;tiques d&#8217;Arthur Rimbaud issus des Illuminations 
</p>
<p>(total : 1221 mots), choisis pour le caract&#232;re a priori d&#233;sordonn&#233; de leur lexique. En tant 
</p>
<p>16</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>que tels, ils illustrent un cas extr&#234;me concernant l&#8217;organisation des mots dans un texte. 
</p>
<p>On verra que leur &#233;tude permet de circonscrire certains comportements particuliers 
</p>
<p>rencontr&#233;s dans le corpus de travail. 
</p>
<p>2.2 Formation du graphe de co-occurrences 
Le graphe de co-occurrences vise &#224; donner une repr&#233;sentation visuelle synth&#233;tique de la 
</p>
<p>co-occurrence g&#233;n&#233;ralis&#233;e dans un texte. Chaque lemme est repr&#233;sent&#233; sous la forme d&#8217;un 
</p>
<p>point (n&#339;ud du graphe) et un lien est trac&#233; entre deux n&#339;uds lorsque les lemmes 
</p>
<p>correspondants sont co-occurrents. Tout lien est dot&#233; d&#8217;un poids qui indique le nombre de 
</p>
<p>fois que la co-occurrence a &#233;t&#233; constat&#233;e dans le texte. On mesure ainsi directement 
</p>
<p>l&#8217;importance de chaque lien. Nous consid&#233;rons que deux unit&#233;s sont co-occurrentes 
</p>
<p>lorsqu&#8217;elles se trouvent &#224; une distance de moins de trois mots1, et ce, ind&#233;pendamment 
</p>
<p>des coupures de phrases. 
</p>
<p>La premi&#232;re &#233;tape du traitement consiste en une tokenisation et une lemmatisation faites 
</p>
<p>en Perl gr&#226;ce au dictionnaire fourni par l&#8217;ABU2. Le texte r&#233;sultant est parcouru pour cr&#233;er 
</p>
<p>deux listes : celle des lemmes et celle des relations de co-occurrence. Ensuite, un 
</p>
<p>programme Perl suppl&#233;mentaire effectue, par l&#8217;interm&#233;diaire du module Graph de Jarkko 
</p>
<p>Hietaniemi3, le calcul de la betweenness centrality des n&#339;uds (d&#233;finie infra en 2.3.1).  
</p>
<p> 
</p>
<p>Figure 1 &#8211; D&#233;tail d&#8217;un graphe de co-occurrence pour un texte entier4 
</p>
<p>Notre choix de repr&#233;senter les lemmes du texte sur le graphe (et non les formes 
</p>
<p>rencontr&#233;es, ou encore des traits s&#233;mantiques) r&#233;pond lui aussi &#224; des raisons d&#8217;&#233;conomie 
</p>
<p>                                                             
1 Le choix d&#8217;une distance aussi courte est motiv&#233;e par la performance des outils de traitement, et par des 
questions de lisibilit&#233; du graphe. Comme nous l&#8217;a fait remarquer Tristan Vanrullen, accro&#238;tre la taille de la 
fen&#234;tre alourdit le graphe en multipliant les liens, ce qui g&#233;n&#232;re par ailleurs un bruit important, notamment sur 
des textes longs portant sur plusieurs th&#233;matiques. La distance de 3 mots est un choix a minima. 
2 http://abu.cnam.fr/DICO/mots-communs.html 
3 http://search.cpan.org/~jhi/Graph-0.94/.  
4 Obtenu gr&#226;ce &#224; Gephi 0.7beta (www.gephi.org). Les couleurs signalent les tendances qu&#8217;ont les n&#339;uds &#224; &#234;tre 
reli&#233;s : un n&#339;ud est plus li&#233; aux n&#339;uds de la m&#234;me couleur que lui. 
</p>
<p>17</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>dans le traitement des donn&#233;es. Si la lemmatisation fait perdre des informations sur le 
</p>
<p>sens des unit&#233;s (Lemaire, 2008), nous pensons que cette perte n&#8217;est pas si significative 
</p>
<p>dans notre probl&#233;matique, formelle et non s&#233;mantique, d&#8217;organisation des mots dans les 
</p>
<p>textes. 
</p>
<p>2.3 Analyse des textes &#224; l&#8217;aide du graphe de co-occurrences 
</p>
<p>2.3.1 L&#8217;organisation hi&#233;rarchique des graphes 
</p>
<p>L&#8217;int&#233;r&#234;t du graphe ne r&#233;side pas dans la seule visualisation ergonomique qu&#8217;il propose. Il 
</p>
<p>s&#8217;agit d&#8217;une structure math&#233;matique pourvue de descripteurs permettant de caract&#233;riser 
</p>
<p>num&#233;riquement et qualitativement les graphes, leurs n&#339;uds et leurs liens. Nous nous 
</p>
<p>int&#233;ressons ici sp&#233;cifiquement &#224; ceux qui r&#233;v&#232;lent son organisation hi&#233;rarchique5. 
</p>
<p>Du fait des liens qu&#8217;ils nouent avec leurs voisins, et de leur position &#224; l&#8217;&#233;chelle globale du 
</p>
<p>graphe, certains lemmes ont une position centrale dans le r&#233;seau de co-occurrence. Parmi 
</p>
<p>tous les indicateurs disponibles dans la litt&#233;rature pour mesurer cette centralit&#233;, nous 
</p>
<p>avons recours &#224; la centralit&#233; d&#8217;interm&#233;diarit&#233; (betweenness centrality, d&#233;sormais BC). 
</p>
<p>Notre choix se porte sur cette mesure pour trois raisons. En premier lieu, elle refl&#232;te 
</p>
<p>l&#8217;intuition (Wasserman, Faust, 1994, 215) : les unit&#233;s qui semblent les plus centrales &#224; 
</p>
<p>l&#8217;&#339;il nu ont la BC la plus &#233;lev&#233;e. En second lieu, la BC est assez bien corr&#233;l&#233;e &#224; la 
</p>
<p>fr&#233;quence : un lemme fr&#233;quent a en g&#233;n&#233;ral une BC &#233;lev&#233;e. La BC a cependant l&#8217;avantage 
</p>
<p>de creuser les &#233;carts entre les unit&#233;s de fr&#233;quence similaire, et fait donc mieux appara&#238;tre 
</p>
<p>les unit&#233;s importantes. Enfin, elle renvoie &#224; une forme pertinente d&#8217;organisation du 
</p>
<p>lexique du texte : les unit&#233;s ayant une BC &#233;lev&#233;e ont &#224; la fois un r&#244;le organisateur dans le 
</p>
<p>graphe (du fait de leur position hi&#233;rarchique), et jouent un r&#244;le d&#8217;interm&#233;diaire entre les 
</p>
<p>diff&#233;rentes notions du texte (Verg&#232;s, Bouriche, 2001, 69). Ce dernier aspect d&#233;coule 
</p>
<p>directement de la d&#233;finition de ce param&#232;tre.  
</p>
<p>La BC d&#8217;un n&#339;ud donn&#233; est en effet obtenue en additionnant la probabilit&#233;, pour tout 
</p>
<p>couple de n&#339;uds du graphe, que le n&#339;ud en question se trouve sur le plus court chemin 
</p>
<p>reliant ces deux n&#339;uds. Un n&#339;ud a donc une BC &#233;lev&#233;e si et seulement si beaucoup 
</p>
<p>d&#8217;autres n&#339;uds sont en relation directe avec lui ou sont oblig&#233;s de passer par lui pour 
</p>
<p>entrer en relation avec d&#8217;autres. Les n&#339;uds dot&#233;s de la BC la plus &#233;lev&#233;e jouent donc un 
</p>
<p>r&#244;le constitutif dans le graphe de co-occurrence : c&#8217;est gr&#226;ce &#224; eux que se font la majorit&#233; 
</p>
<p>des liens &#224; &#233;chelle locale et &#224; &#233;chelle globale. Un classement des n&#339;uds par BC 
</p>
<p>d&#233;croissante donne une image de l&#8217;organisation hi&#233;rarchique du lexique du texte. Une BC 
</p>
<p>importante est le signe d&#8217;une position saillante dans le texte6. 
</p>
<p>                                                             
5 Nous entendons par l&#224; que certains n&#339;uds ont une position pr&#233;-&#233;minente par rapport &#224; d&#8217;autres. Sur la 
Figure 1, il s&#8217;agit notamment de rubrique, article, d&#233;veloppement et durable. Soulignons que l&#8217;on pourrait 
chercher, ind&#233;pendamment de cette organisation hi&#233;rarchique, d&#8217;autres formes d&#8217;organisation du graphe, 
notamment une organisation modulaire (Tauveron, 2012) que les param&#232;tres que nous &#233;voquons dans la section 
5.2 permettent de caract&#233;riser. 
6 Contrairement &#224; Boguraev, Neff (2000), notre d&#233;finition de la saillance est purement interne au texte 
consid&#233;r&#233;, sans r&#233;f&#233;rence &#224; une norme ext&#233;rieure. 
</p>
<p>18</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.3.2 Une analyse longitudinale 
</p>
<p>L&#8217;originalit&#233; de notre &#233;tude r&#233;side dans le fait que nous nous focalisons sur l&#8217;&#233;volution des 
</p>
<p>graphes avec l&#8217;avanc&#233;e du texte phrase apr&#232;s phrase7. Pour chaque texte, un premier 
</p>
<p>graphe d&#233;crit la 1&#232;re phrase, le 2&#232;me graphe d&#233;crit les 2 premi&#232;res, etc. Le texte entier n&#8217;est 
</p>
<p>d&#233;crit que par le dernier graphe. Le choix d&#8217;une fen&#234;tre s&#8217;&#233;largissant &#224; chaque &#233;tape (et 
</p>
<p>non d&#8217;une &#171; fen&#234;tre glissante &#187;) se justifie par le fait que nous travaillons sur un 
</p>
<p>ph&#233;nom&#232;ne d&#8217;incr&#233;mentation. Une synth&#232;se faite par un dernier programme Perl permet 
</p>
<p>de comparer ces diff&#233;rentes &#233;tapes8. La comparaison est faite en relevant, dans l&#8217;&#233;volution 
</p>
<p>du texte au fil des &#233;tapes, les n&#339;uds et les liens qui, au moins &#224; un instant donn&#233;, ont une 
</p>
<p>certaine pr&#233;&#233;minence. L&#8217;&#233;tude de l&#8217;ensemble de l&#8217;histoire de chacun de ces n&#339;uds et de 
</p>
<p>ces liens fournit une image d&#8217;ensemble des unit&#233;s les plus saillantes, de ce point de vue, 
</p>
<p>dans le texte. Ainsi, l&#8217;&#233;volution du texte vue sous le seul angle de la co-occurrence 
</p>
<p>g&#233;n&#233;ralis&#233;e permet d&#8217;&#233;tudier l&#8217;incr&#233;mentation lexicale qui a lieu dans le texte, non 
</p>
<p>seulement sous son aspect quantitatif, mais d&#8217;&#233;tudier &#233;galement sa construction. 
</p>
<p>3 R&#233;sultats 
</p>
<p>3.1 Trois types d&#8217;&#233;volution 
Dans notre corpus, nous avons mis en &#233;vidence trois grands types d&#8217;&#233;volution d&#8217;ensemble 
</p>
<p>de la co-occurrence g&#233;n&#233;ralis&#233;e. 
</p>
<p>Premier type, une croissance d&#8217;un bout &#224; l&#8217;autre du texte : se cr&#233;ent sans arr&#234;t de 
</p>
<p>nouveaux n&#339;uds et de nouveaux liens susceptibles de prendre une place pr&#233;&#233;minente 
</p>
<p>assez rapidement. 
</p>
<p>Second type, une stabilisation progressive et unidirectionnelle du graphe : il commence 
</p>
<p>par conna&#238;tre une phase de croissance d&#233;sordonn&#233;e, analogue au comportement 
</p>
<p>pr&#233;c&#233;dent, mais cette croissance d&#233;bouche rapidement sur un &#233;tat stable, atteint en 
</p>
<p>g&#233;n&#233;ral avant la moiti&#233; du texte. Une fois ce palier atteint, le graphe n&#8217;&#233;volue plus que 
</p>
<p>dans le d&#233;tail. C&#8217;est le comportement auto-organis&#233; auquel nous avons fait r&#233;f&#233;rence en 
</p>
<p>introduction ; il est d&#8217;ailleurs largement majoritaire dans notre corpus. 
</p>
<p>En troisi&#232;me lieu, des cycles de stabilisation et de r&#233;organisation successives. Le 
</p>
<p>comportement pr&#233;c&#233;dent d&#233;bouche subitement sur une nouvelle phase d&#8217;organisation au 
</p>
<p>cours de laquelle est cr&#233;&#233; un nouvel &#233;tat stable, diff&#233;rent du pr&#233;c&#233;dent.  
</p>
<p>Dans le corpus que nous avons utilis&#233;, seul le second comportement est attest&#233; de fa&#231;on 
</p>
<p>r&#233;currente, comme le montre le tableau suivant : 
</p>
<p>  
</p>
<p>                                                             
7 Nous ne pouvons revenir ici sur la question de la non-pertinence &#233;ventuelle de cette unit&#233; syntaxique dans 
l&#8217;&#233;tude de textes sur corpus, y compris dans le cas des corpus &#233;crits. 
8 Ces synth&#232;ses sont repr&#233;sent&#233;es graphiquement &#224; partir de la section 3.2. 
</p>
<p>19</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Croissance permanente  3 textes 
Textes brefs (Tous les textes de 
Rimbaud + un &#233;ditorial) 
</p>
<p>Stabilisation progressive et 
unidirectionnelle 
</p>
<p>33 textes 
Textes brefs (&#233;ditoriaux) et tous les 
textes longs (scientifiques, 
encyclop&#233;diques) 
</p>
<p>Cycles de stabilisation et de 
r&#233;organisation 
</p>
<p>4 textes Textes brefs (&#233;ditoriaux) 
</p>
<p>Tableau 1 &#8211; R&#233;partition des textes selon les types d&#8217;&#233;volution. 
</p>
<p>3.2 Les cas de stabilisation progressive et unidirectionnelle 
</p>
<p>3.2.1 Le corpus de textes brefs 
</p>
<p>Le d&#233;but du texte9 conna&#238;t &#233;ventuellement un sursaut de d&#233;part, phase br&#232;ve (au plus un 
</p>
<p>sixi&#232;me du texte) au cours de laquelle les variations de centralit&#233; des n&#339;uds et de poids 
</p>
<p>des liens sont tr&#232;s rapides et impr&#233;visibles, allant parfois d&#8217;un extr&#234;me &#224; l&#8217;autre10. 
</p>
<p>L&#8217;essentiel de l&#8217;&#233;volution commence ensuite par une phase de stabilisation progressive. 
</p>
<p>Les param&#232;tres varient alors graduellement pour amener le texte &#224; un certain stade 
</p>
<p>organis&#233;. Cette phase occupe en g&#233;n&#233;ral entre un et deux cinqui&#232;mes du texte. Une fois 
</p>
<p>atteint ce stade organis&#233;, l&#8217;&#233;volution est, qualitativement au moins, termin&#233;e. Les lemmes 
</p>
<p>et les liens importants deviennent ensuite de plus en plus importants, &#224; des vitesses 
</p>
<p>diff&#233;rentes et impr&#233;visibles. Ceux qui sont moins importants le restent, parfois en 
</p>
<p>s&#8217;&#233;changeant leurs places. Par contre, &#224; quelques exceptions pr&#232;s, aucun n&#339;ud ou lien ne 
</p>
<p>conna&#238;t d&#8217;important changement de classement pass&#233; ce stade. Il s&#8217;agit donc d&#8217;une phase 
</p>
<p>d&#8217;am&#233;nagement de l&#8217;organisation. Le syst&#232;me que constitue la co-occurrence g&#233;n&#233;ralis&#233;e 
</p>
<p>se donne au cours de la premi&#232;re phase une identit&#233; qui &#233;volue ensuite sans se renier. 
</p>
<p>Toute &#233;volution ne fait que la raffermir, en accroissant le poids des unit&#233;s importantes. 
</p>
<p>Dans notre corpus, un des cas les plus repr&#233;sentatifs est celui de l&#8217;&#233;ditorial du num&#233;ro de 
</p>
<p>1 de D&#233;veloppement durable et territoire (Figure 2, chaque courbe repr&#233;sente l&#8217;&#233;volution 
</p>
<p>d&#8217;un lemme au long du texte). Dans ce texte, la relation de co-occurrence g&#233;n&#233;ralis&#233;e a 
</p>
<p>form&#233; son identit&#233; pendant les 13 premi&#232;res phrases du texte. La suite de l&#8217;&#233;volution ne 
</p>
<p>constitue qu&#8217;un r&#233;am&#233;nagement. 
</p>
<p>On peut mettre en &#233;vidence un ph&#233;nom&#232;ne analogue pour le comportement des liens. On 
</p>
<p>voit sur les Figures 3 et 4 que le comportement des liens du graphe a la m&#234;me histoire au 
</p>
<p>cours de l&#8217;avanc&#233;e du texte que celui des n&#339;uds11. &#192; ceci pr&#232;s que la construction de l&#8217;&#233;tat 
</p>
<p>                                                             
9 Les diff&#233;rentes &#233;tapes sont qualitativement les m&#234;mes dans tous les textes relevant de ce comportement. Seules 
changent la dur&#233;e respective des phases et leur nettet&#233;. 
10 Cette forte variabilit&#233; s&#8217;explique par le fait que la mesure en question porte sur une portion du texte tr&#232;s 
r&#233;duite, et donc d&#8217;autant plus sujette &#224; des variations al&#233;atoires. On rencontre le m&#234;me probl&#232;me qu&#8217;avec un 
calcul de fr&#233;quence. 
11 Pour des raisons de lisibilit&#233;, nous r&#233;partissons les liens du graphe en 3 cat&#233;gories. Les liens les plus 
importants (respectivement m&#233;dians, moins importants) sont ceux qui, au moins une fois dans toute leur 
&#233;volution, ont un poids qui d&#233;passe 60% du poids maximal (respectivement 40%, 30%).  
</p>
<p>20</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>organis&#233; du graphe a lieu sur une p&#233;riode plus &#233;tendue que pour les n&#339;uds, &#224; savoir entre 
</p>
<p>la 11&#232;me et la 15&#232;me phrase. 
</p>
<p>Dans les d&#233;tails, des diff&#233;rences parmi les Figures 3 et 4 r&#233;v&#232;lent un aspect de la 
</p>
<p>dynamique du ph&#233;nom&#232;ne : moins les liens sont importants et plus ils &#233;voluent vite au 
</p>
<p>cours de la premi&#232;re phase. En effet, on constate pendant cette phase 4 mont&#233;es abruptes 
</p>
<p>sur le graphique des liens les plus importants et 10 sur le graphique suivants. C&#8217;est-&#224;-dire 
</p>
<p>que les liens les plus importants sont plus stables, et les liens les moins importants sont 
</p>
<p>plus volatiles. Le poids des liens d&#233;note donc la solidit&#233; et le caract&#232;re architectural des 
</p>
<p>relations au cours d&#8217;une &#233;volution. La relation de co-occurrence g&#233;n&#233;ralis&#233;e appara&#238;t donc 
</p>
<p>comme un v&#233;ritable syst&#232;me, dont les parties les plus significatives sont p&#233;rennes, et les 
</p>
<p>parties les plus l&#233;g&#232;res sont adaptables au cours du temps12. 
</p>
<p> 
</p>
<p> 
</p>
<p>                                                             
12 On remarque sur Figure 4 que de nouveaux liens gagnent en importance dans la deuxi&#232;me partie de 
l&#8217;&#233;volution. Malgr&#233; le caract&#232;re unidirectionnel de ces &#233;volutions, les parties les plus volatiles du graphe peuvent 
conna&#238;tre des phases de croissance ponctuelles. 
</p>
<p>0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>1
</p>
<p>1
 &#224;
</p>
<p> 2
</p>
<p>1
 &#224;
</p>
<p> 3
</p>
<p>1
 &#224;
</p>
<p> 4
</p>
<p>1
 &#224;
</p>
<p> 5
</p>
<p>1
 &#224;
</p>
<p> 6
</p>
<p>1
 &#224;
</p>
<p> 7
</p>
<p>1
 &#224;
</p>
<p> 8
</p>
<p>1
 &#224;
</p>
<p> 9
</p>
<p>1
 &#224;
</p>
<p> 1
0
</p>
<p>1
 &#224;
</p>
<p> 1
1
</p>
<p>1
 &#224;
</p>
<p> 1
2
</p>
<p>1
 &#224;
</p>
<p> 1
3
</p>
<p>1
 &#224;
</p>
<p> 1
4
</p>
<p>1
 &#224;
</p>
<p> 1
5
</p>
<p>1
 &#224;
</p>
<p> 1
6
</p>
<p>1
 &#224;
</p>
<p> 1
7
</p>
<p>1
 &#224;
</p>
<p> 1
8
</p>
<p>1
 &#224;
</p>
<p> 1
9
</p>
<p>1
 &#224;
</p>
<p> 2
0
</p>
<p>1
 &#224;
</p>
<p> 2
1
</p>
<p>1
 &#224;
</p>
<p> 2
2
</p>
<p>1
 &#224;
</p>
<p> 2
3
</p>
<p>1
 &#224;
</p>
<p> 2
4
</p>
<p>1
 &#224;
</p>
<p> 2
5
</p>
<p>1
 &#224;
</p>
<p> 2
6
</p>
<p>Te
xt
</p>
<p>e
</p>
<p>Figure 2 - &#201;volution de la BC des lemmes dans DDT-1 
</p>
<p>0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>1
</p>
<p>1
 &#224;
</p>
<p> 2
</p>
<p>1
 &#224;
</p>
<p> 3
</p>
<p>1
 &#224;
</p>
<p> 4
</p>
<p>1
 &#224;
</p>
<p> 5
</p>
<p>1
 &#224;
</p>
<p> 6
</p>
<p>1
 &#224;
</p>
<p> 7
</p>
<p>1
 &#224;
</p>
<p> 8
</p>
<p>1
 &#224;
</p>
<p> 9
</p>
<p>1
 &#224;
</p>
<p> 1
0
</p>
<p>1
 &#224;
</p>
<p> 1
1
</p>
<p>1
 &#224;
</p>
<p> 1
2
</p>
<p>1
 &#224;
</p>
<p> 1
3
</p>
<p>1
 &#224;
</p>
<p> 1
4
</p>
<p>1
 &#224;
</p>
<p> 1
5
</p>
<p>1
 &#224;
</p>
<p> 1
6
</p>
<p>1
 &#224;
</p>
<p> 1
7
</p>
<p>1
 &#224;
</p>
<p> 1
8
</p>
<p>1
 &#224;
</p>
<p> 1
9
</p>
<p>1
 &#224;
</p>
<p> 2
0
</p>
<p>1
 &#224;
</p>
<p> 2
1
</p>
<p>1
 &#224;
</p>
<p> 2
2
</p>
<p>1
 &#224;
</p>
<p> 2
3
</p>
<p>1
 &#224;
</p>
<p> 2
4
</p>
<p>1
 &#224;
</p>
<p> 2
5
</p>
<p>1
 &#224;
</p>
<p> 2
6
</p>
<p>Te
xt
</p>
<p>e
</p>
<p>Figure 3 - Poids des liens les plus importants dans DDT-1-1 
</p>
<p>Fin de la 13&#232;me phrase 
</p>
<p>De la 11&#232;me &#224; la 15&#232;me phrase 
</p>
<p>21</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>3.2.2 Le corpus de textes longs 
</p>
<p>Le comportement attest&#233; sur la majorit&#233; des textes brefs du corpus de travail est 
</p>
<p>&#233;galement constatable sur l&#8217;ensemble du corpus de textes longs13. Il est m&#234;me plus net sur 
</p>
<p>ce second corpus. En effet, la phase initiale de stabilisation peut &#234;tre &#8211; en proportion &#8211; 
</p>
<p>largement plus courte, n&#8217;occupant qu&#8217;un dixi&#232;me du texte dans certains cas. Il semble en 
</p>
<p>particulier que plus le texte est long, plus la phase de stabilisation est courte en 
</p>
<p>proportion. On le voit en particulier sur la Figure 5, repr&#233;sentant l&#8217;&#233;volution d&#8217;un texte de 
</p>
<p>14.601 mots, divis&#233; en 40 &#233;tapes de 15 phrases (article &#171; Beethoven &#187; de Wikip&#233;dia), et 
</p>
<p>dans laquelle il appara&#238;t bien que l&#8217;&#233;volution de la BC des n&#339;uds est finie d&#232;s la 4&#232;me &#233;tape. 
</p>
<p> 
</p>
<p>Le retard de l&#8217;&#233;volution des liens par rapport &#224; celle des n&#339;uds est l&#224; encore constatable 
</p>
<p>(Figure 6) : la phase d&#8217;organisation des liens du graphe s&#8217;&#233;tend jusqu&#8217;&#224; l&#8217;&#233;tape 10, c&#8217;est-&#224;-
</p>
<p>dire jusqu&#8217;&#224; la fin du 1er quart du texte. 
</p>
<p>                                                             
13 Pour des raisons de lourdeur de traitement informatique, l&#8217;incr&#233;mentation est &#233;tudi&#233;e par paliers de 10 &#224; 15 
phrases, et non plus d&#8217;une seule. Le texte le plus long du corpus (22.500 mots) compte en effet 1.027 phrases. 
</p>
<p>0
</p>
<p>10
</p>
<p>20
</p>
<p>30
</p>
<p>40
</p>
<p>1
</p>
<p>1
 &#224;
</p>
<p> 2
</p>
<p>1
 &#224;
</p>
<p> 3
</p>
<p>1
 &#224;
</p>
<p> 4
</p>
<p>1
 &#224;
</p>
<p> 5
</p>
<p>1
 &#224;
</p>
<p> 6
</p>
<p>1
 &#224;
</p>
<p> 7
</p>
<p>1
 &#224;
</p>
<p> 8
</p>
<p>1
 &#224;
</p>
<p> 9
</p>
<p>1
 &#224;
</p>
<p> 1
0
</p>
<p>1
 &#224;
</p>
<p> 1
1
</p>
<p>1
 &#224;
</p>
<p> 1
2
</p>
<p>1
 &#224;
</p>
<p> 1
3
</p>
<p>1
 &#224;
</p>
<p> 1
4
</p>
<p>1
 &#224;
</p>
<p> 1
5
</p>
<p>1
 &#224;
</p>
<p> 1
6
</p>
<p>1
 &#224;
</p>
<p> 1
7
</p>
<p>1
 &#224;
</p>
<p> 1
8
</p>
<p>1
 &#224;
</p>
<p> 1
9
</p>
<p>1
 &#224;
</p>
<p> 2
0
</p>
<p>1
 &#224;
</p>
<p> 2
1
</p>
<p>1
 &#224;
</p>
<p> 2
2
</p>
<p>1
 &#224;
</p>
<p> 2
3
</p>
<p>1
 &#224;
</p>
<p> 2
4
</p>
<p>1
 &#224;
</p>
<p> 2
5
</p>
<p>1
 &#224;
</p>
<p> 2
6
</p>
<p>Te
xt
</p>
<p>e
</p>
<p>Figure 4 - Poids des liens les moins importants dans DDT-1-1 
</p>
<p>De la 11&#232;me &#224; la 15&#232;me phrase 
</p>
<p>0
10
20
30
40
50
60
70
80
90
</p>
<p>100
</p>
<p>Figure 5 &#8211; BC des n&#339;uds dans &#171; Beethoven &#187; 
</p>
<p>22</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>3.3 Les cas cycliques 
</p>
<p>Comme &#233;voqu&#233; plus haut, nous avons pu mettre en &#233;vidence un fonctionnement cyclique 
</p>
<p>sur un petit nombre de textes. Dans ces cas, l&#8217;&#233;volution d&#233;crite en 3.2 se produit deux 
</p>
<p>fois : une fois un &#233;tat stable atteint, et maintenu pendant un laps de temps assez long, 
</p>
<p>arrive une phase de r&#233;organisation vers un autre &#233;tat stable, maintenu lui aussi. On voit 
</p>
<p>que le texte DDT2-2 (Figure 7) alterne phases d&#8217;organisation (6 &#224; 9, 21 &#224; 30) et phases de 
</p>
<p>stabilit&#233; (9 &#224; 21, 30 &#224; 41). La croissance de certaines unit&#233;s qui a lieu lors de cette derni&#232;re 
</p>
<p>phase (les deux courbes vertes correspondent &#224; politique et &#224; culture) ne bouleverse pas 
</p>
<p>l&#8217;organisation d&#8217;ensemble. Par ailleurs, l&#8217;&#233;tat du graphe lors des deux p&#233;riodes de stabilit&#233; 
</p>
<p>est bien distinct : c&#8217;est par exemple le lemme notion qui domine entre 9 et 21, alors que 
</p>
<p>c&#8217;est d&#233;veloppement qui domine apr&#232;s 30. 
</p>
<p> 
</p>
<p>Un retour &#224; la lettre du texte permet de voir que ces deux phases de stabilit&#233; 
</p>
<p>correspondent &#224; des changements de th&#233;matique. La premi&#232;re partie du texte est 
</p>
<p>consacr&#233;e &#224; la r&#233;silience, qualifi&#233;e 5 fois de notion. Une phrase d&#233;note ensuite un 
</p>
<p>abandon de cette th&#233;matique (&#171; il semblerait qu'il n'y ait qu'un pas de la r&#233;silience &#224; la 
</p>
<p>0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>1
</p>
<p>1
 &#224;
</p>
<p> 3
</p>
<p>1
 &#224;
</p>
<p> 5
</p>
<p>1
 &#224;
</p>
<p> 7
</p>
<p>1
 &#224;
</p>
<p> 9
</p>
<p>1
 &#224;
</p>
<p> 1
1
</p>
<p>1
 &#224;
</p>
<p> 1
3
</p>
<p>1
 &#224;
</p>
<p> 1
5
</p>
<p>1
 &#224;
</p>
<p> 1
7
</p>
<p>1
 &#224;
</p>
<p> 1
9
</p>
<p>1
 &#224;
</p>
<p> 2
1
</p>
<p>1
 &#224;
</p>
<p> 2
3
</p>
<p>1
 &#224;
</p>
<p> 2
5
</p>
<p>1
 &#224;
</p>
<p> 2
8
</p>
<p>1
 &#224;
</p>
<p> 3
0
</p>
<p>1
 &#224;
</p>
<p> 3
1
</p>
<p>1
 &#224;
</p>
<p> 3
3
</p>
<p>1
 &#224;
</p>
<p> 3
5
</p>
<p>1
 &#224;
</p>
<p> 3
7
</p>
<p>1
 &#224;
</p>
<p> 3
9
</p>
<p>Te
xt
</p>
<p>e
</p>
<p>Figure 7 - &#201;volution de la BC des n&#339;uds dans DDT2-2 
</p>
<p>Stabilit&#233;  
Stabilit&#233; apr&#232;s 30 
</p>
<p>Figure 6 &#8211; Poids des liens les plus importants dans &#171; Beethoven &#187; 
</p>
<p>23</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>r&#233;sistance dans le cadre du d&#233;veloppement durable &#187;) et un passage &#224; la th&#233;matique du 
</p>
<p>d&#233;veloppement durable (on trouve plus loin &#171; [&#233;]videmment difficile de d&#233;finir ici et en 
</p>
<p>une phrase ce qu'est le d&#233;veloppement durable &#187;) 14. 
</p>
<p>3.4 Les cas de croissance permanente 
Nous avons men&#233; sur un corpus de contr&#244;le fait de deux po&#232;mes d&#8217;Arthur Rimbaud la 
</p>
<p>m&#234;me &#233;tude que sur le corpus de travail (Figure 8 : po&#232;me Enfance). Elle met en &#233;vidence 
</p>
<p>un fonctionnement totalement diff&#233;rent des deux pr&#233;sent&#233;s plus haut, que l&#8217;on retrouve, 
</p>
<p>de mani&#232;re moins nette, sur un des textes du corpus (Vertigo3-1). Dans ces textes, la co-
</p>
<p>occurrence g&#233;n&#233;ralis&#233;e cro&#238;t en permanence : au fur et &#224; mesure qu&#8217;apparaissent de 
</p>
<p>nouvelles phrases et de nouveaux mots, apparaissent &#233;galement de nouveaux lemmes et 
</p>
<p>de nouvelles relations de co-occurrence. On n&#8217;identifie pas de phase de stabilit&#233; &#224; un 
</p>
<p>quelconque moment. Comme sur le cas pr&#233;c&#233;dent, la plus haute valeur en BC est prise 
</p>
<p>successivement par des lemmes diff&#233;rents, sans cette fois que cette alternance ne refl&#232;te 
</p>
<p>des phases organis&#233;es. 
</p>
<p>Les trois textes marginaux qui connaissent ce comportement constituent en quelque sorte 
</p>
<p>des cas limites. Dans les deux comportements organis&#233;s d&#233;crits plus haut, l&#8217;organisation 
</p>
<p>en partie hi&#233;rarchique des graphes servait en effet &#224; assurer la coh&#233;sion du r&#233;seau de co-
</p>
<p>occurrence g&#233;n&#233;ralis&#233;e, et permettait donc l&#8217;&#233;mergence d&#8217;une forme d&#8217;ensemble. Les 
</p>
<p>n&#339;uds les plus importants construisaient leur position de pr&#233;&#233;minence au cours d&#8217;une 
</p>
<p>&#233;volution mesur&#233;e, pour la garder par la suite. Au contraire, dans les cas de croissance 
</p>
<p>permanente, aucun &#233;tat stable n&#8217;est maintenu au cours du temps, ce qui n&#8217;emp&#234;che pas de 
</p>
<p>consid&#233;rer qu&#8217;on a affaire &#224; une certaine forme d&#8217;organisation. 
</p>
<p> 
</p>
<p>                                                             
14 Il faut noter cependant que le changement de th&#233;matique n&#8217;intervient pas &#224; l&#8217;instant pr&#233;cis du changement de 
phase que nous identifions. Le grand nombre d&#8217;occurrences de notion au d&#233;but du texte donne une certaine 
inertie &#224; ce terme . Dans la mesure que nous faisons, sa position pr&#233;&#233;minente se maintient apr&#232;s le changement 
de th&#233;matique. 
</p>
<p>0
</p>
<p>10
</p>
<p>20
</p>
<p>30
</p>
<p>40
</p>
<p>50
</p>
<p>60
</p>
<p>70
</p>
<p>80
</p>
<p>90
</p>
<p>100
</p>
<p>1
</p>
<p>1
 &#224;
</p>
<p> 3
</p>
<p>1
 &#224;
</p>
<p> 5
</p>
<p>1
 &#224;
</p>
<p> 7
</p>
<p>1
 &#224;
</p>
<p> 9
</p>
<p>1
 &#224;
</p>
<p> 1
1
</p>
<p>1
 &#224;
</p>
<p> 1
3
</p>
<p>1
 &#224;
</p>
<p> 1
5
</p>
<p>1
 &#224;
</p>
<p> 1
7
</p>
<p>1
 &#224;
</p>
<p> 1
9
</p>
<p>1
 &#224;
</p>
<p> 2
1
</p>
<p>1
 &#224;
</p>
<p> 2
3
</p>
<p>1
 &#224;
</p>
<p> 2
5
</p>
<p>1
 &#224;
</p>
<p> 2
8
</p>
<p>1
 &#224;
</p>
<p> 3
0
</p>
<p>1
 &#224;
</p>
<p> 3
1
</p>
<p>1
 &#224;
</p>
<p> 3
3
</p>
<p>1
 &#224;
</p>
<p> 3
5
</p>
<p>1
 &#224;
</p>
<p> 3
7
</p>
<p>1
 &#224;
</p>
<p> 3
9
</p>
<p>1
 &#224;
</p>
<p> 4
1
</p>
<p>1
 &#224;
</p>
<p> 4
3
</p>
<p>1
 &#224;
</p>
<p> 4
5
</p>
<p>1
 &#224;
</p>
<p> 4
7
</p>
<p>1
 &#224;
</p>
<p> 4
9
</p>
<p>1
 &#224;
</p>
<p> 5
1
</p>
<p>Figure 8 - &#201;volution de la BC des n&#339;uds dans Enfance de Rimbaud 
</p>
<p>24</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Discussion 
</p>
<p>4.1 Un syst&#232;me auto-organis&#233; 
Il est surprenant que le graphe ne connaisse pas syst&#233;matiquement une croissance 
</p>
<p>permanente d&#8217;un bout &#224; l&#8217;autre du texte. Dans les faits, le cas normal est celui d&#8217;une 
</p>
<p>stabilisation progressive et unidirectionnelle du graphe de co-occurrence15. Ce 
</p>
<p>fonctionnement particulier peut s&#8217;expliquer en r&#233;f&#233;rence &#224; un m&#233;canisme g&#233;n&#233;ral 
</p>
<p>d&#8217;&#233;volution de certains syst&#232;mes, appel&#233; auto-organisation (van de Vijver, 2004). 
</p>
<p>Les observations faites montrent que l&#8217;&#233;volution de la co-occurrence g&#233;n&#233;ralis&#233;e ne se fait 
</p>
<p>pas au hasard, et ne prend pas la forme d&#8217;une croissance permanente. En effet, au fur et &#224; 
</p>
<p>mesure de l&#8217;avanc&#233;e du texte, les mots et les relations de co-occurrence ne sont pas 
</p>
<p>ajout&#233;s de mani&#232;re effr&#233;n&#233;e, ni plac&#233;s anarchiquement mais sont dispos&#233;s de mani&#232;re 
</p>
<p>syst&#233;matique. Ce placement passe par une phase de stabilisation qui a lieu au d&#233;but du 
</p>
<p>texte, avant d&#8217;atteindre un &#233;tat certes relativement stable, mais surtout susceptible de se 
</p>
<p>r&#233;ajuster pour permettre l&#8217;int&#233;gration des nouveaux contenus. C&#8217;est la force de cette 
</p>
<p>structure : elle permet de canaliser le flux d&#8217;information continu dans la deuxi&#232;me partie 
</p>
<p>du texte. Elle repose sur la pr&#233;sence d&#8217;une certaine hi&#233;rarchie entre unit&#233;s &#8211; les lemmes et 
</p>
<p>les liens les plus importants, du fait de leur r&#244;le architectural, &#233;tant moins volatiles. C&#8217;est 
</p>
<p>cette organisation qui assure en premier lieu la stabilit&#233; du syst&#232;me et son existence 
</p>
<p>(Ladri&#232;re, 2009), malgr&#233; la sollicitation (et le risque de d&#233;sorganisation) que repr&#233;sente 
</p>
<p>l&#8217;apport de nouveaux contenus. L&#8217;ensemble du processus montre donc une construction 
</p>
<p>progressive de l&#8217;identit&#233; du r&#233;seau de co-occurrence g&#233;n&#233;ralis&#233;e (d&#233;finitoire de l&#8217;auto-
</p>
<p>organisation chez Moreno, 2004). Ce r&#233;seau &#233;labore donc son identit&#233; de syst&#232;me au 
</p>
<p>cours d&#8217;une premi&#232;re phase. Par la suite, m&#234;me si ce syst&#232;me ne reste pas fig&#233; et &#233;volue, 
</p>
<p>c&#8217;est sans modifier cette identit&#233;. Comme on l&#8217;a vu, comprendre l&#8217;&#233;volution du syst&#232;me 
</p>
<p>suppose de le consid&#233;rer dans sa globalit&#233;. Cette &#233;volution d&#8217;ensemble d&#233;passe l&#8217;histoire 
</p>
<p>de chacun des n&#339;uds et des liens, et est impr&#233;visible &#224; partir de leurs &#233;volutions 
</p>
<p>ponctuelles (comme le montre le passage brusque de la phase chaotique initiale &#224; la phase 
</p>
<p>organis&#233;e). Par d&#233;finition, l&#8217;organisation de la co-occurrence g&#233;n&#233;ralis&#233;e est donc 
</p>
<p>&#233;mergente. Nous allons montrer de surcro&#238;t qu&#8217;elle semble pr&#233;vue (par le scripteur du 
</p>
<p>texte) pour &#234;tre identifi&#233;e (par le lecteur) &#8211; il s&#8217;agit donc d&#8217;une auto-organisation au sens 
</p>
<p>faible dans la typologie d&#8217;Atlan (2011, 194)16. 
</p>
<p>Si on peut mettre le ph&#233;nom&#232;ne que nous avons constat&#233; ici sur le compte d&#8217;une propri&#233;t&#233; 
</p>
<p>g&#233;n&#233;rale de certains syst&#232;mes, nous allons montrer maintenant qu&#8217;il repose sur des 
</p>
<p>contraintes et ressources de la cognition humaine. 
</p>
<p>                                                             
15 L&#8217;interpr&#233;tation faite ici s&#8217;applique &#233;galement, dans une moindre mesure, sur les textes pr&#233;sentant une 
&#233;volution cyclique. 
16 Ces syst&#232;mes s&#8217;opposent chez l&#8217;auteur aux auto-organisations au sens fort, que sont par exemple les &#234;tres 
vivants, dans lesquelles la structure a une finalit&#233; et une signification qui tirent leur origine de l&#8217;int&#233;rieur du 
syst&#232;me. De tels syst&#232;mes ont donc une &#233;volution autonome. Un texte &#233;tant produit pour &#234;tre lu, sa finalit&#233; et 
son fonctionnement sont n&#233;cessairement &#224; mettre sur le compte du scripteur. 
</p>
<p>25</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.2 Interpr&#233;tation en termes cognitifs 
</p>
<p>4.2.1 Contraintes du syst&#232;me cognitif 
</p>
<p>Van Dijk, Kintsch (1983) ont suppos&#233; l&#8217;existence de m&#233;canismes cognitifs permettant la 
</p>
<p>structuration de l&#8217;information rencontr&#233;e dans les textes. Parmi eux, la suppression 
</p>
<p>d&#8217;informations secondaires, et le regroupement de plusieurs informations en une seule. 
</p>
<p>On peut supposer que ces m&#233;canismes ob&#233;issent &#224; la n&#233;cessit&#233; d&#8217;organiser le sens (et, 
</p>
<p>indirectement, le lexique) du texte. Une des cons&#233;quences de ces ph&#233;nom&#232;nes est la 
</p>
<p>pr&#233;sence de th&#232;mes (au sens de Hj&#248;rland, 2001), qui structurent le contenu s&#233;mantique 
</p>
<p>du texte de mani&#232;re notamment hi&#233;rarchique. 
</p>
<p>Le comportement auto-organis&#233; que nous avons d&#233;cel&#233; r&#233;v&#232;le un des aspects de cette 
</p>
<p>contrainte. En effet, le maintien de la pr&#233;&#233;minence d&#8217;unit&#233;s importantes et la relative 
</p>
<p>rigidit&#233; des liens les plus forts ont un r&#244;le architectural dans la co-occurrence g&#233;n&#233;ralis&#233;e 
</p>
<p>similaire &#224; l&#8217;&#233;conomie des th&#232;mes dans un texte. Il appara&#238;t donc que le caract&#232;re auto-
</p>
<p>organis&#233; de la co-occurrence g&#233;n&#233;ralis&#233;e permet l&#8217;application des op&#233;rations de 
</p>
<p>suppression et de structuration de l&#8217;information. 
</p>
<p>4.2.2 Ressources du syst&#232;me cognitif 
</p>
<p>Par ailleurs, le fonctionnement auto-organis&#233; d&#233;crit ici n&#8217;est possible que gr&#226;ce &#224; certaines 
</p>
<p>ressources du syst&#232;me cognitif. Deux des op&#233;rations cognitives fondamentales postul&#233;es 
</p>
<p>par Langacker (1987, 116-140) &#8211; la s&#233;lection et la transformation &#8211; rendent ce type 
</p>
<p>d&#8217;&#233;volution possible. 
</p>
<p>Le fonctionnement des textes tel que nous l&#8217;avons montr&#233; repose en effet sur la capacit&#233; 
</p>
<p>qu&#8217;a le syst&#232;me cognitif &#224; s&#233;lectionner les unit&#233;s et les relations les plus saillantes pour 
</p>
<p>focaliser son attention sur elles et les placer au centre de sa construction du sens textuel. 
</p>
<p>La modification permanente du syst&#232;me auto-organis&#233; repose sur ses capacit&#233;s de 
</p>
<p>transformation : les repr&#233;sentations form&#233;es sont sans cesse d&#233;form&#233;es pour accepter de 
</p>
<p>nouvelles informations arrivant certes par incr&#233;mentation successive, mais, et c&#8217;est notre 
</p>
<p>conclusion, de mani&#232;re structur&#233;e. 
</p>
<p>Le fonctionnement de ces ressources contribue &#224; expliquer la difficult&#233; &#224; la lecture des 
</p>
<p>deux textes po&#233;tiques de Rimbaud. L&#8217;impression de d&#233;sordre qu&#8217;on peut avoir &#224; leur sujet 
</p>
<p>est d&#233;montr&#233;e ici, sur son seul versant lexical. Comme on l&#8217;a vu, ces textes font partie de 
</p>
<p>ceux qui ne t&#233;moignent pas d&#8217;une stabilisation progressive : les op&#233;rations que sont la 
</p>
<p>s&#233;lection et la transformation d&#8217;informations par le syst&#232;me cognitif sont dans ces cas 
</p>
<p>inop&#233;rantes et ne permettent pas facilement l&#8217;&#233;laboration d&#8217;un sens d&#8217;ensemble. 
</p>
<p>5 Conclusions 
</p>
<p>5.1 Perspectives d&#8217;application 
Nous avons consid&#233;r&#233; ici (&#224; la mani&#232;re d&#8217;Utiyama, Isahara, 2001) que les th&#232;mes des 
</p>
<p>textes se d&#233;finissaient par des relations de co-occurrence (fr&#233;quence des liens par 
</p>
<p>26</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>l&#8217;interm&#233;diaire de leur poids, centralit&#233;). En suivant les id&#233;es de Hearst (1997) ou Ferret 
</p>
<p>(2007), on pourrait appliquer ce travail en premier lieu &#224; des fins de segmentation 
</p>
<p>th&#233;matique. Nous avons en effet montr&#233; dans certains cas que notre m&#233;thode permettait 
</p>
<p>de diviser les textes en diff&#233;rentes sections. Elle montre &#233;galement dans d&#8217;autres cas 
</p>
<p>(croissance permanente) que certains textes ne sont pas segmentables th&#233;matiquement.  
</p>
<p>Erkan, Radev (2004) et Xie (2005) ont par ailleurs montr&#233; que la centralit&#233; dans le 
</p>
<p>lexique des textes permettait de mettre en &#233;vidence la structuration hi&#233;rarchique des 
</p>
<p>informations, et donc de rep&#233;rer les &#233;l&#233;ments qui doivent figurer dans leur r&#233;sum&#233;. La 
</p>
<p>sp&#233;cificit&#233; de notre m&#233;thode &#8211; envisager le texte dans sa dynamique &#8211; permettrait de 
</p>
<p>rep&#233;rer les passages qui apportent le plus d&#8217;informations. Si une telle &#233;tude confirme le 
</p>
<p>fait que les informations essentielles se situent souvent au d&#233;but des textes, nous avons 
</p>
<p>pu montrer qu&#8217;il ne s&#8217;agit pas d&#8217;une g&#233;n&#233;ralit&#233; (dans les cas de croissance permanente). 
</p>
<p>En troisi&#232;me lieu, la m&#233;thode pr&#233;sent&#233;e ici reposant sur le seul examen du lexique, c&#8217;est 
</p>
<p>dans l&#8217;indexation des documents qu&#8217;elle conna&#238;trait ses meilleures applications. Elle 
</p>
<p>pourrait permettre d&#8217;identifier les mots les plus essentiels du texte selon les passages et 
</p>
<p>d&#8217;identifier leurs relations mutuelles mieux que ne le ferait une liste de mots-cl&#233;s. 
</p>
<p>Enfin, l&#8217;examen des sp&#233;cificit&#233;s de l&#8217;organisation lexicale des textes permettrait de faire 
</p>
<p>un pas dans la caract&#233;risation du style et du genre d&#8217;un texte (voire d&#8217;un auteur)17.  
</p>
<p>5.2 Nouvelles perspectives de recherche 
La m&#233;thode pr&#233;sent&#233;e ici se doit d&#8217;&#234;tre affin&#233;e et pr&#233;cis&#233;e en recourant &#224; d&#8217;autres 
</p>
<p>param&#232;tres math&#233;matiques donnant une meilleure description qualitative de la position 
</p>
<p>des n&#339;uds dans les graphes (eigenvector centrality, clustering coefficient, classes de 
</p>
<p>modularit&#233;, etc.). L&#8217;effet de la taille de l&#8217;empan d&#233;finissant la co-occurrence, d&#8217;un &#233;ventuel 
</p>
<p>&#233;lagage du graphe ou de la lemmatisation restent &#233;galement &#224; caract&#233;riser en d&#233;tail. 
</p>
<p>R&#233;f&#233;rences 
ADAM, J.-M., (2004), Linguistique textuelle. Des genres de discours aux textes, Paris, 
</p>
<p>Nathan. 
</p>
<p>ATLAN, H., (2011), Le Vivant post-g&#233;nomique ou qu&#8217;est-ce que l&#8217;auto-organisation ?, 
</p>
<p>Paris : Odile Jacob. 
</p>
<p>BOGURAEV, B., NEFF, M., (2000), &#8220;Lexical Cohesion, Discourse Segmentation and 
</p>
<p>Document Summarization,&#8221; Proceedings of RIAO&#8217;2000, Paris (12&#8211;14 avril 2000). 
</p>
<p>ERKAN, G., RADEV, D., &#8220;LexRank: Graph-based Lexical Centrality as Salience in Text 
</p>
<p>Summarization&#8221;, Journal of Articial Intelligence Research, 22, 457-479. 
</p>
<p>FERRET, O. 2007. &#8220;Finding document topics for improving topic segmentation&#8221;. ACL 
</p>
<p>2007. 480-487. 
</p>
<p>                                                             
17 Cette suggestion de Tristan Vanrullen portera tous ses fruits dans un prochain travail. 
</p>
<p>27</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HEARST, M. 1997. &#8220;TextTiling : Segmenting Text into Multi-paragraph Subtopic Passages&#8221;. 
</p>
<p>Computational Linguistics, 23, 1, 33-64. 
</p>
<p>HJ&#216;RLAND, B., (2001), &#8220;Towards a Theory of Aboutness, Subject, Topicality, Theme, 
</p>
<p>Domain, Field, Content&#8230; and Relevance&#8221;, Journal of the American Society for 
</p>
<p>Information Science and Technology, 52, 9, 774&#8211;778. 
</p>
<p>LADRIERE, J., (2009), &#171; Syst&#232;me, &#233;pist&#233;mologie &#187;, Encyclopaedia Universalis. 
</p>
<p>LANGACKER, R., (1987), Foundations of Cognitive Grammar. Theoretical Prerequisites, 
</p>
<p>Stanford : Standford UP. 
</p>
<p>LEGALLOIS, D., (2006), &#171; Pr&#233;sentation g&#233;n&#233;rale. Le texte et le probl&#232;me de son et ses 
</p>
<p>unit&#233;s : propositions pour une d&#233;clinaison &#187;, Langages, 163, 3-9. 
</p>
<p>LEMAIRE, B., (2008), &#171; Limites de la lemmatisation pour l'extraction de significations &#187;, 
</p>
<p>JADT 2008, 725-732. 
</p>
<p>MORENO, A., (2004), &#171; Auto-organisation, autonomie et identit&#233; &#187;, Revue internationale 
</p>
<p>de philosophie, 228, 135-150. 
</p>
<p>PARANYUSHKIN, D., (2010), &#171; Text network analysis &#187;, Conf&#233;rence du Performing Arts 
</p>
<p>Forum, http://noduslabs.com/research/pathways-meaning-circulation/, (14.09.2011). 
</p>
<p>TAUVERON, M., (2012), &#171; Variation du sens lexical en discours : la co-occurrence 
</p>
<p>g&#233;n&#233;ralis&#233;e valide une non-correspondance entre deux langues &#187;. La cooccurrence : du 
</p>
<p>fait statistique au fait textuel. Besan&#231;on, 9 f&#233;vrier 2012. 
</p>
<p>UTIYAMA, M. ISAHARA, H.. 2001. &#8220;A statistical model for domain-independent text 
</p>
<p>segmentation&#8221;. In ACL&#8217;01, 491&#8211;498. 
</p>
<p>VAN DE VIJVER, G., (2004), &#171; Auto-organisation, autonomie, identit&#233; : Introduction &#187;, 
</p>
<p>Revue internationale de philosophie, 228, 129-133. 
</p>
<p>VAN DIJK, T. KINTSCH, W., (1983), Strategies of Discourse Comprehension, Orlando : 
</p>
<p>Academic Press. 
</p>
<p>VERGES, P., BOURICHE, B., (2001). &#8220;L&#8217;analyse des donn&#233;es par les graphes de similitude&#8221;. 
</p>
<p>Sciences humaines, http://www.scienceshumaines.com/textesInedits/Bouriche.pdf. 
</p>
<p>VERONIS, J., (2004), &#8220;HyperLex : Lexical Cartography for Information Retrieval&#8221;, 
</p>
<p>Computer Speech &amp; Language, 18, 3, 223-252. 
</p>
<p>VIPREY, J.-M., (2006), &#8220;Structure non-s&#233;quentielle des textes&#8221;, Langages, 163, 71-85. 
</p>
<p>WASSERMAN, S., FAUST, K., (1994), Social Network Analysis, Cambridge UP. 
</p>
<p>XIE, Z., (2005), &#8220;Centrality Measures in Text Mining : Prediction of Noun Phrases that 
</p>
<p>Appear in Abstracts&#8221;. ACL&#8217;05, Proceedings of the Student Research Workshop. Ann 
</p>
<p>Arbor. 
</p>
<p>28</p>

</div></div>
</body></html>