<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Adaptation d&#8217;un syst&#232;me de reconnaissance d&#8217;entit&#233;s nomm&#233;es pour le fran&#231;ais &#224; l&#8217;anglais &#224; moindre co&#251;t</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Actes de la conf&#233;rence conjointe JEP-TALN-RECITAL 2012, volume 3: RECITAL, pages 151&#8211;161,
Grenoble, 4 au 8 juin 2012. c&#169;2012 ATALA &amp; AFCP
</p>
<p>Adaptation d&#8217;un syst&#232;me de reconnaissance d&#8217;entit&#233;s
nomm&#233;es pour le fran&#231;ais &#224; l&#8217;anglais &#224; moindre co&#251;t
</p>
<p>Mohamed Hatmi
LINA, UMR 6241,Universit&#233; de Nantes
mohamed.hatmi@univ-nantes.fr
</p>
<p>R&#201;SUM&#201;
La portabilit&#233; entre les langues des syst&#232;mes de reconnaissance d&#8217;entit&#233;s nomm&#233;es est co&#251;teuse
en termes de temps et de connaissances linguistiques requises. L&#8217;adaptation des syst&#232;mes symbo-
liques souffrent du co&#251;t de d&#233;veloppement de nouveaux lexiques et de la mise &#224; jour des r&#232;gles
contextuelles. D&#8217;un autre c&#244;t&#233;, l&#8217;adaptation des syst&#232;mes statistiques se heurtent au probl&#232;me
du co&#251;t de pr&#233;paration d&#8217;un nouveau corpus d&#8217;apprentissage. Cet article &#233;tudie l&#8217;int&#233;r&#234;t et le
co&#251;t associ&#233; pour porter un syst&#232;me existant de reconnaissance d&#8217;entit&#233;s nomm&#233;es pour du texte
bien form&#233; vers une autre langue. Nous pr&#233;sentons une m&#233;thode peu co&#251;teuse pour porter un
syst&#232;me symbolique d&#233;di&#233; au fran&#231;ais vers l&#8217;anglais. Pour ce faire, nous avons d&#8217;une part traduit
automatiquement l&#8217;ensemble des lexiques de mots d&#233;clencheurs au moyen d&#8217;un dictionnaire
bilingue. D&#8217;autre part, nous avons manuellement modifi&#233; quelques r&#232;gles de mani&#232;re &#224; respecter
la syntaxe de la langue anglaise. Les r&#233;sultats exp&#233;rimentaux sont compar&#233;s &#224; ceux obtenus avec
un syst&#232;me de r&#233;f&#233;rence d&#233;velopp&#233; pour l&#8217;anglais.
</p>
<p>ABSTRACT
Adapting a French Named Entity Recognition System to English with Minimal Costs
</p>
<p>Cross-language portability of Named Entity Recognition systems requires linguistic expertise and
needs human effort. Adapting symbolic systems suffers from the cost of developing new lexicons
and updating grammar rules. Porting statistical systems on the other hand faces the problem of
the high cost of annotation of new training corpus. This paper examines the cost of adapting a
rule-based Named Entity Recognition system designed for well-formed text to another language.
We present a low-cost method to adapt a French rule-based Named Entity Recognition system
to English. We first solve the problem of lexicon adaptation to English by simply translating the
French lexical resources. We then get to the task of grammar adaptation by slightly modifying
the grammar rules. Experimental results are compared to a state-of-the-art English system.
</p>
<p>MOTS-CL&#201;S : Reconnaissance d&#8217;entit&#233;s nomm&#233;es, approche symbolique, portabilit&#233; entre les
langues.
</p>
<p>KEYWORDS: Named entity recognition, symbolic approache, cross-language portability.
</p>
<p>151</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>La reconnaissance des entit&#233;s nomm&#233;es (REN) est une sous-t&#226;che de l&#8217;extraction d&#8217;information
consistant &#224; d&#233;limiter et &#224; cat&#233;goriser certaines expressions linguistiques autonomes et
mono-r&#233;f&#233;rentielles (Ehrmann, 2008). Ces derni&#232;res correspondent traditionnellement &#224;
l&#8217;ensemble des noms propres (noms de personnes, de lieu et d&#8217;organisation) ainsi que certaines
expressions num&#233;riques et temporelles (expressions de dates, de temps, de pourcentages, etc.).
La d&#233;limitation et la cat&#233;gorisation des entit&#233;s nomm&#233;es sont connues sous le nom d&#8217;annotation
qui consiste g&#233;n&#233;ralement &#224; encadrer une entit&#233; nomm&#233;e par le biais d&#8217;une balise de d&#233;but et de
fin mentionnant sa typologie.
</p>
<p>Certaines langues ont suscit&#233; beaucoup d&#8217;int&#233;r&#234;t, notamment via les campagnes d&#8217;&#233;va-
luations telles que MUC (Grishman et Sundheim, 1996) pour l&#8217;anglais et le japonais, CONLL
(Tjong Kim Sang, 2002) pour l&#8217;espagnol et l&#8217;allemand et ESTER (Galliano et al., 2009) pour
le fran&#231;ais. Plusieurs syst&#232;mes ont &#233;t&#233; d&#233;velopp&#233;s pour ces diff&#233;rentes langues. La plupart
d&#8217;entre eux utilisent soit des m&#233;thodes symboliques soit des m&#233;thodes statistiques. Les syst&#232;mes
symboliques sont bas&#233;s sur des lexiques (listes de pr&#233;nom, de pays, etc.) et sur un ensemble
de r&#232;gles de r&#233;&#233;criture (Maurel et al., 2011; Brun et Ehrmann, 2010; Stern et Sagot, 2010).
D&#8217;un autre c&#244;t&#233;, les syst&#232;mes statistiques sont bas&#233;s sur un mod&#232;le appris &#224; partir d&#8217;un corpus
pr&#233;alablement annot&#233; (Bikel et al., 1997; Raymond et Fayolle, 2010; B&#233;chet et Charton, 2010).
</p>
<p>La portabilit&#233; entre les langues des syst&#232;mes de REN est co&#251;teuse en termes de temps
et de connaissances linguistiques requises. Par exemple, les syst&#232;mes symboliques n&#233;cessitent
un traitement lourd incluant, notamment, la modification des r&#232;gles contextuelles et le
d&#233;veloppement de nouvelles listes de mots d&#233;clencheurs et de noms propres. La raret&#233; et
le co&#251;t de construction de ces ressources repr&#233;sentent un probl&#232;me majeur pour certaines
langues (Poibeau, 2003; Gamon et al., 1997). D&#8217;un autre c&#244;t&#233;, les syst&#232;mes probabilistes se
heurtent au probl&#232;me de disponibilit&#233; des corpus d&#8217;apprentissages. Ces derniers ne sont pas
faciles &#224; constituer et ne sont pas disponibles pour toutes les langues. Plusieurs travaux visent
&#224; automatiser le processus d&#8217;annotation en exploitant l&#8217;encyclop&#233;die multilingue Wikip&#233;dia
(Nothman et al., 2009) et les corpus multilingues comparables (Klementiev et Roth, 2006).
</p>
<p>Dans cet article, nous examinons l&#8217;int&#233;r&#234;t et le co&#251;t associ&#233; pour porter un syst&#232;me
existant de REN pour du texte bien form&#233; vers une autre langue. Nous nous sommes appuy&#233;s
pour cela sur le syst&#232;me symbolique fran&#231;ais Nemesis (Fourour, 2002). Nous pr&#233;sentons une
m&#233;thode permettant de porter Nemesis vers l&#8217;anglais &#224; moindre co&#251;t. Nous d&#233;crivons le syst&#232;me
Nemesis dans la section 2 et les corpus d&#8217;&#233;valuation dans la section 3. Nous pr&#233;sentons ensuite le
d&#233;tail du processus d&#8217;adaptation dans la section 4. La section 5 pr&#233;sente les r&#233;sultats sur les
corpus ayant servi aux &#233;valuations et les compare aux r&#233;sultats obtenus par Stanford Named
Entity Recognizer 1 (Finkel et al., 2005), un syst&#232;me de REN d&#233;velopp&#233; pour l&#8217;anglais. Pour
terminer, dans la section 6, nous discutons les apports et les limites de cette approche.
</p>
<p>1. Ce syst&#232;me est disponible gratuitement &#224; : http ://nlp.stanford.edu/software/CRF-NER.shtml
</p>
<p>152</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Nemesis : un syst&#232;me symbolique de REN pour le fran&#231;ais
</p>
<p>Nemesis (Fourour, 2002) est un syst&#232;me qui permet la d&#233;limitation et la cat&#233;gorisation des
entit&#233;s nomm&#233;es d&#233;velopp&#233; pour le fran&#231;ais et pour du texte bien form&#233; (c&#8217;est-&#224;-dire qui respecte
les r&#232;gles du fran&#231;ais &#233;crit). Il se base essentiellement sur les indices internes et externes d&#233;finis
par McDonald (1996). L&#8217;architecture de Nemesis se compose principalement de trois modules
qui s&#8217;ex&#233;cutent s&#233;quentiellement : pr&#233;traitement lexical, projection des lexiques et application
des r&#232;gles.
</p>
<p>Pr&#233;traitement lexical : segmentation du texte en occurrences de formes et de phrases,
puis association des sigles &#224; leur forme &#233;tendue.
Projection des lexiques : les lexiques ont &#233;t&#233; construits soit manuellement, soit automatique-
ment &#224; partir du Web. Les &#233;l&#233;ments composant ces lexiques (79 476 &#233;l&#233;ments) sont r&#233;partis en
45 listes selon les cat&#233;gories dans lesquelles ils sont utilis&#233;s : pr&#233;nom connu, mot d&#233;clencheur
d&#8217;un nom d&#8217;organisation (l&#8217;&#233;l&#233;ment fait partie de l&#8217;entit&#233; nomm&#233;e : &#171; F&#233;d&#233;ration fran&#231;aise de
handball &#187;), contexte d&#8217;un nom de personne (l&#8217;&#233;l&#233;ment appartient au contexte gauche imm&#233;diat
de l&#8217;entit&#233; nomm&#233;e, mais ne fait pas partie de celle-ci : &#171; philosophe Emmanuel Kant &#187;), fin d&#8217;un
nom d&#8217;organisation (l&#8217;&#233;l&#233;ment est la derni&#232;re forme composant l&#8217;entit&#233; nomm&#233;e : &#171; Conseil
r&#233;gional &#187;, &#171; Coupe du monde de football &#187;), etc.
La projection des lexiques consiste &#224; associer les &#233;tiquettes li&#233;es aux lexiques aux diff&#233;rentes
formes du texte. Une forme peut avoir plusieurs &#233;tiquettes (Washington|pr&#233;nom-connu|lieu-
connu).
Application des r&#232;gles : les r&#232;gles de r&#233;&#233;criture permettent l&#8217;annotation du texte par des
balises identifiant les entit&#233;s nomm&#233;es (d&#233;limitation et cat&#233;gorisation). Elles sont bas&#233;es sur des
&#233;tiquettes s&#233;mantiques r&#233;f&#233;rant &#224; une forme capitalis&#233;e ou &#224; une forme appartenant &#224; un lexique.
En tout, Nemesis utilise 93 r&#232;gles qui s&#8217;ex&#233;cutent dans un ordre pr&#233;d&#233;fini. Lorsque plusieurs
r&#232;gles s&#8217;appliquent, Nemesis opte pour la r&#232;gle ayant la priorit&#233; la plus &#233;lev&#233;e. Voici un exemple
de r&#232;gles de r&#233;&#233;criture :
</p>
<p>$Cl&#233;-oronyme $Article-min [ $Forme-capitalis&#233;e+ ]&#8594; ORONYME
et le r&#233;sultat de son application :
</p>
<p>&quot;montagne du &lt;ORONYME&gt; Mont-Blanc &lt;/ORONYME&gt;&quot;
</p>
<p>L&#8217;&#233;valuation de Nemesis a &#233;t&#233; r&#233;alis&#233;e sur un corpus compos&#233; de textes issus du journal
Le Monde et du Web (31 000 mots). Les performances sur l&#8217;ensemble des entit&#233;s nomm&#233;es
montrent un rappel de 79 % et une pr&#233;cision de 91 % (Fourour, 2003).
</p>
<p>3 Description des corpus et mesure des performances
</p>
<p>Trois corpus dont deux en langue fran&#231;aise et un autre en langue anglaise ont &#233;t&#233; utilis&#233;s dans
nos exp&#233;rimentations.
</p>
<p>153</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le corpus de r&#233;f&#233;rence anglais, BBN Pronoun Coreference and Entity Type Corpus 2, est
compos&#233; d&#8217;articles provenant de Wall Street Journal manuellement annot&#233; en entit&#233;s nomm&#233;es.
Le guide d&#8217;annotation comporte 12 cat&#233;gories principales (Person, Facility, Organization, GPE,
Location, Nationality, Product, Event, Work of Art, Law, Language, Contact-Info) et plusieurs
sous-cat&#233;gories. Seules les entit&#233;s sont prises en compte dans l&#8217;&#233;tiquette. Les formes qui ne
font pas partie de l&#8217;entit&#233; elle-m&#234;me sont exclues de l&#8217;annotation (Mr. &lt;PERSON&gt; Spoon
&lt;/PERSON&gt;). Ce corpus a &#233;t&#233; divis&#233; en deux parties, d&#233;veloppement (3/4 du corpus) et test
(1/4 du corpus).
</p>
<p>Le corpus de r&#233;f&#233;rence fran&#231;ais (Stern et Sagot, 2010) 3 est constitu&#233; de d&#233;p&#234;ches pro-
venant de l&#8217;Agence France-Presse (AFP) et contient des annotations manuelles des entit&#233;s
de type Personne, Lieu et Organisation (comprenant les noms d&#8217;entreprises). Les formes non
constitutives du nom de l&#8217;entit&#233; lui-m&#234;me sont exclues de l&#8217;annotation (M. &lt;PERSON&gt; Spoon
&lt;/PERSON&gt;). La taille de ce corpus est bien plus faible que celle du corpus anglais. Pour des
raisons de comparaison, nous avons &#233;galement eu recours &#224; un corpus non annot&#233; constitu&#233; des
articles du journal Le Monde (2007).
</p>
<p>Dans ce travail, seules les entit&#233;s communes entre les deux corpus annot&#233;s ont &#233;t&#233; rete-
nues pour les exp&#233;riences (Personne, Organisation, Lieu et Entreprise). La table 1 d&#233;crit les
diff&#233;rents corpus utilis&#233;s dans ce travail. Les performances sont mesur&#233;es en termes de rappel et
</p>
<p>Corpus Langue Nb de mots Nb d&#8217;entit&#233;s
Corpus BBN (d&#233;veloppement) anglais 938 330 46 478
Corpus BBN (test) anglais 235 274 11 930
Corpus AFP fran&#231;ais 38 831 1 497
Corpus Le Monde fran&#231;ais 1 010 000 -
</p>
<p>TABLE 1: Description des corpus
</p>
<p>de pr&#233;cision. Le rappel est d&#233;fini par le nombre d&#8217;entit&#233;s correctement &#233;tiquet&#233;es au regard du
nombre d&#8217;entit&#233;s &#233;tiquet&#233;es dans la r&#233;f&#233;rence. La pr&#233;cision est le nombre d&#8217;entit&#233;s correctement
&#233;tiquet&#233;es au regard du nombre d&#8217;entit&#233;s correctement et incorrectement &#233;tiquet&#233;es. La F-mesure
combine ces deux mesures.
</p>
<p>Rappel =
Nombre d &#8242;enti t e&#769;s cor rectement e&#769;t iquet e&#769;es
</p>
<p>Nombre d &#8242;enti t e&#769;s e&#769;t iquet e&#769;es dans la r e&#769; f e&#769;rence (1)
</p>
<p>Pre&#769;cision=
Nombre d &#8242;enti t e&#769;s cor rectement e&#769;t iquet e&#769;es
</p>
<p>Nombre d &#8242;enti t e&#769;s e&#769;t iquet e&#769;es f ournis (2)
</p>
<p>F &#8722;mesure = 2 &#8727; rappel &#8727; pr e&#769;cision
rappel + pr e&#769;cision
</p>
<p>(3)
</p>
<p>2. Catalogue LDC n&#778; LDC2005T33
3. Ce corpus est disponible librement dans le cadre de la distribution de SXPipe
</p>
<p>154</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Adaptation de Nemesis &#224; l&#8217;anglais
</p>
<p>La mesure des performances des syst&#232;mes de REN d&#233;pend directement de la coh&#233;rence entre les
annotations manuelles et les annotations automatiques. Nous avons donc commenc&#233; par ajuster
les r&#232;gles de d&#233;limitation et de cat&#233;gorisation de Nemesis aux normes d&#8217;annotation des corpus
d&#8217;&#233;valuation.
</p>
<p>Notre objectif est de porter Nemesis vers l&#8217;anglais d&#8217;une fa&#231;on simple et peu co&#251;teuse.
La m&#233;thode propos&#233;e consiste &#224; adapter s&#233;par&#233;ment et s&#233;quentiellement les deux principaux
&#233;l&#233;ments constitutifs de Nemesis : les lexiques et les r&#232;gles de r&#233;&#233;criture.
</p>
<p>4.1 Adaptation des lexiques
</p>
<p>Nous avons construit l&#8217;ensemble des lexiques pour l&#8217;anglais en traduisant tout simplement les
lexiques existants pour le fran&#231;ais. La traduction est faite automatiquement en utilisant un
dictionnaire bilingue 4 sans aucune information contextuelle. Cela concerne principalement
l&#8217;ensemble des lexiques de mots d&#233;clencheurs. Les lexiques des noms de personne et d&#8217;entreprise
sont conserv&#233;s. Cette t&#226;che n&#8217;est pas co&#251;teuse en termes de temps et ne demande pas une
expertise linguistique (des outils en ligne comme Google Translate peuvent &#234;tre utilis&#233;s pour
les langues pour lesquelles les dictionnaires &#233;lectroniques ne sont pas disponibles). Lorsque
le dictionnaire comporte plusieurs traductions pour un mot, l&#8217;ensemble des traductions sont
conserv&#233;es (nous ne traitons pas &#224; ce niveau les probl&#232;mes de polys&#233;mie). Une fois la phase de
traduction termin&#233;e, nous avons utilis&#233; une liste des mots outils en anglais pour &#233;carter certaines
entr&#233;es pouvant produire de bruit, par exemple le mot even qui se pr&#233;sente comme un nom de
personne dans le lexique fran&#231;ais. En d&#233;finitive, l&#8217;ensemble des lexiques pour l&#8217;anglais compte 83
305 entr&#233;es.
</p>
<p>4.2 Adaptation des r&#232;gles
</p>
<p>4.2.1 Classification des r&#232;gles
</p>
<p>Avant d&#8217;adapter les r&#232;gles, nous avons commenc&#233; par mesurer la fr&#233;quence et la pr&#233;cision
relatives de chacune des r&#232;gles utilis&#233;es par Nemesis (93 r&#232;gles). La fr&#233;quence repr&#233;sente le
nombre de fois o&#249; chaque r&#232;gle est d&#233;clench&#233;e pour reconna&#238;tre une entit&#233; nomm&#233;e. La figure
1 pr&#233;sente les r&#233;sultats obtenus sur le corpus Le Monde pour le fran&#231;ais (1a) et sur le corpus
de d&#233;veloppement BBN pour l&#8217;anglais (apr&#232;s adaptation des lexiques) (1b). Les observations
montrent que la loi de Zipf est respect&#233;e pour les deux langues : un nombre limit&#233; de r&#232;gles est
&#224; l&#8217;origine de la plupart des entit&#233;s extraites, les autres r&#232;gles sont rarement d&#233;clench&#233;es. Par
exemple pour l&#8217;anglais, 11 r&#232;gles couvrent 86% des entit&#233;s extraites. On remarque aussi que de
nombreuses r&#232;gles ne sont pas d&#233;clench&#233;es (38 pour l&#8217;anglais contre 17 pour le fran&#231;ais).
</p>
<p>La pr&#233;cision mesure la quantit&#233; d&#8217;entit&#233;s correctement reconnues parmi les r&#233;ponses re-
tourn&#233;es. En effet, ce n&#8217;est pas parce qu&#8217;une r&#232;gle est fr&#233;quente qu&#8217;elle est pour autant pr&#233;cise.
</p>
<p>4. Catalogue ELRA-M0033 (http ://catalog.elra.info/product_info.phpproducts_id=666&amp;language=fr)
</p>
<p>155</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nous avons calcul&#233; la pr&#233;cision de chacune des r&#232;gles d&#233;clench&#233;es pour le fran&#231;ais sur le corpus
AFP et pour l&#8217;anglais sur le corpus de d&#233;veloppement BBN. La figure 2 pr&#233;sente les r&#233;sultats
obtenus pour l&#8217;anglais. Plusieurs r&#232;gles d&#233;clench&#233;es obtiennent une pr&#233;cision relativement
faible (32 r&#232;gles ont une pr&#233;cision inf&#233;rieure &#224; 50%, ce qui repr&#233;sente environ 60% des r&#232;gles
d&#233;clench&#233;es). En se basant sur les crit&#232;res de fr&#233;quence et de pr&#233;cision, nous avons ensuite class&#233;
</p>
<p>(a) Fran&#231;ais (corpus Le Monde)
</p>
<p>(b) Anglais (corpus de d&#233;veloppement BBN)
</p>
<p>FIGURE 1: Nombre de d&#233;clenchements des r&#232;gles pour le fran&#231;ais et pour l&#8217;anglais
</p>
<p>les r&#232;gles en diff&#233;rentes cat&#233;gories, par exemple : r&#232;gles fr&#233;quentes 5 ayant une bonne pr&#233;cision 6
</p>
<p>dans les deux langues (7 r&#232;gles), r&#232;gles fr&#233;quentes pour l&#8217;anglais avec une faible pr&#233;cision 7 (3
r&#232;gles), r&#232;gles d&#233;clench&#233;es seulement pour le fran&#231;ais (19 r&#232;gles), r&#232;gles non d&#233;clench&#233;es dans
les deux langues (15 r&#232;gles), etc. Ces diff&#233;rentes cat&#233;gories vont nous permettre de d&#233;terminer
quelles sont les r&#232;gles &#224; modifier pour la langue anglaise.
</p>
<p>5. Fr&#233;quence &gt; 1 000
6. Pr&#233;cision &gt; 70 %
7. Pr&#233;cision &lt; 50 %
</p>
<p>156</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 2: Pr&#233;cision des r&#232;gles d&#233;clench&#233;es pour l&#8217;anglais (corpus BBN)
</p>
<p>4.2.2 Adaptation des r&#232;gles
</p>
<p>Pour adapter les r&#232;gles, nous avons s&#233;lectionn&#233; celles n&#8217;appartenant pas aux cat&#233;gories de bonne
pr&#233;cision pour l&#8217;anglais. Nous avons &#233;galement &#233;limin&#233; certaines r&#232;gles d&#233;clench&#233;es seulement
pour le fran&#231;ais car elles sont tr&#232;s sp&#233;cifiques &#224; cette langue, par exemple :
</p>
<p>[ $Cl&#233;-organisation $Article-min $Item $Article-min
$Forme-capitalis&#233;e+ ] &#8594; ORGANISATION
et un exemple d&#8217;application :
</p>
<p>&quot;&lt;ORGANISATION&gt; Centre de recherche de Solaize &lt;/ORGANISATION&gt;&quot;
</p>
<p>Nous avons ensuite modifi&#233; les r&#232;gles s&#233;lectionn&#233;es de mani&#232;re &#224; respecter la syntaxe
de la langue anglaise (29 r&#232;gles), comme la r&#232;gle suivante pour le fran&#231;ais :
</p>
<p>$Fonction $Adjectif-de-nationalit&#233; [ $Forme-capitalis&#233;e+ ] &#8594; PERSON
et le r&#233;sultat de son application :
</p>
<p>&quot;Le pr&#233;sident fran&#231;ais &lt;PERSON&gt; Jacques Chirac &lt;/PERSON&gt;&quot;
</p>
<p>et la r&#232;gle pour l&#8217;anglais apr&#232;s adaptation :
</p>
<p>$Adjectif-de-nationalit&#233; $Fonction [ $Forme-capitalis&#233;e+ ] &#8594; PERSON
et le r&#233;sultat de son application :
</p>
<p>&quot;The French President &lt;PERSON&gt; Jacques Chirac &lt;/PERSON&gt;&quot;
</p>
<p>157</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 R&#233;sultats
</p>
<p>Pour des raisons de comparaison, nous avons dans un premier temps appliqu&#233; Nemesis au
corpus de test BBN et au corpus AFP. Aucune adaptation n&#8217;a &#233;t&#233; r&#233;alis&#233;e. La table 2 pr&#233;sente les
performances r&#233;alis&#233;es par cat&#233;gorie. Nous pouvons remarquer que la reconnaissance des noms
de personne demeure satisfaisante (perte d&#8217;environ 5 points de F-mesure). Cela s&#8217;explique par
le fait que les lexiques de Nemesis contiennent des pr&#233;noms anglais et qu&#8217;il y a des r&#232;gles de
r&#233;&#233;criture communes. La reconnaissance se voit fortement d&#233;grad&#233;e pour les autres cat&#233;gories.
Nous avons ensuite mesur&#233; l&#8217;apport de l&#8217;adaptation des lexiques et des r&#232;gles. La table 3 affiche
</p>
<p>Nemesis Fran&#231;ais Nemesis Anglais
(sans aucune adaptation)
</p>
<p>Corpus AFP Corpus de test BBN
(fran&#231;ais) (anglais)
F1 (P/R) F1 (P/R)
</p>
<p>Personne 77,33 (85,83/71,03) 71,82 (66,65/77,85)
Lieu 88,82 (90,24/87,44) 37,46 (45,61/31,79)
Organisation 54,24 (65,04/46,51) 1,5 (1,1/2)
Entreprise 37,73 (54,05/30) 10 (36,83/5,84)
</p>
<p>TABLE 2: Performances de Nemesis pour le fran&#231;ais et l&#8217;anglais sans adaptation
</p>
<p>les gains obtenus pour chaque adaptation. Ces r&#233;sultats sont compar&#233;s &#224; ceux obtenus avec un
syst&#232;me natif (Stanford NER).
</p>
<p>Nemesis Anglais Nemesis Anglais Stanford NER
(adaptation lexiques) (adaptation lexiques
</p>
<p>et r&#232;gles)
Corpus BBN Corpus BBN Corpus BBN
</p>
<p>(anglais) (anglais) (anglais)
F1 (P/R) F1 (P/R) F1 (P/R)
</p>
<p>Personne 77,3 (74,48/80,34) 79,51 (81,08/78,01) 90,9 (88,07/93,9)
Lieu 74,38 (72,5/76,35) 79,17 (78,59/79,76) 90,8 (87,6/94,2)
Organisation 21,02 (24,2/18,58) 38,15 (41,9/35,02) 84,6 (89,2/80,04)
Entreprise 27,52 (50,72/18,88) 30,15 (68,34/19,34)
</p>
<p>TABLE 3: Performances de Nemesis pour le fran&#231;ais et l&#8217;anglais
</p>
<p>L&#8217;adaptation des lexiques a permis un apport significatif concernant la reconnaissance des
noms de lieu (environ 37 points de F-mesure). La reconnaissance des noms d&#8217;organisation et
d&#8217;entreprise se voit am&#233;lior&#233;e mais elle reste toutefois faible. En effet, ce probl&#232;me semble li&#233; &#224;
une couverture insuffisante des lexiques de Nemesis et &#224; une ambiguit&#233; li&#233;e &#224; la cat&#233;gorisation
des organisations et des entreprises (entreprise cat&#233;goris&#233;e en tant qu&#8217;organisation et vice-versa).
</p>
<p>L&#8217;adaptation des r&#232;gles montre un gain relativement bon pour la cat&#233;gorie organisation
</p>
<p>158</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(environ 17 points de F-mesure) et une l&#233;g&#232;re am&#233;lioration concernant les autres cat&#233;gories.
Les r&#233;sultats globaux sont bien en dessous de ceux obtenus avec Stanford NER, surtout pour la
cat&#233;gorie organisation. Stanford NER est un syst&#232;me &#224; base d&#8217;apprentissage d&#233;velopp&#233; pour
l&#8217;anglais. Pour ce dernier, les noms d&#8217;entreprises sont cat&#233;goris&#233;s comme &#233;tant organisation.
</p>
<p>6 Discussion
</p>
<p>Cette approche peu co&#251;teuse pour porter Nemesis vers l&#8217;anglais montre des r&#233;sultats satisfaisants
pour la reconnaissance des noms de personne et de lieu. Elle montre ses limites pour la
reconnaissance des noms d&#8217;organisation et d&#8217;entreprise. L&#8217;analyse des r&#233;sultats obtenus nous a
permis de souligner deux probl&#232;mes r&#233;currents de la reconnaissance des entit&#233;s nomm&#233;es : la
d&#233;limitation des entit&#233;s nomm&#233;es et la d&#233;limitation des cat&#233;gories.
</p>
<p>Les r&#232;gles d&#8217;annotation sont loin de faire consensus. Elles suscitent toujours des vives
discussions et plusieurs remises en cause du guide d&#8217;annotation, par exemple dans le cadre de la
campagne ETAPE (&#201;valuations en Traitement Automatique de la Parole). Le premier probl&#232;me
rencontr&#233; concerne la d&#233;limitation des entit&#233;s nomm&#233;es. En effet, les r&#232;gles de d&#233;limitation de
Nemesis ne sont pas les m&#234;mes que celles utilis&#233;es pour annoter le corpus AFP et le corpus
BBN. Par exemple, Nemesis inclut les titres dans les noms de personne (&lt;PERSON&gt; M. Dorgan
&lt;/PERSON&gt;) alors que ces derniers ne sont pas inclus dans le corpus AFP (M. &lt;PERSON&gt;
Dorgan &lt;/PERSON&gt;). Nous avons d&#251; adapter les r&#232;gles de d&#233;limitation de Nemesis aux
sp&#233;cificit&#233;s du corpus trait&#233;. Cependant, plusieurs erreurs de d&#233;limitation ont &#233;t&#233; relev&#233;es. Le
deuxi&#232;me probl&#232;me concerne la d&#233;limitation des cat&#233;gories. Nemesis adopte une cat&#233;gorisation
fine (5 cat&#233;gories et 30 sous-cat&#233;gories). Cette typologie a l&#8217;avantage de pouvoir s&#8217;adapter aux
typologies moins fines en regroupant des sous-cat&#233;gories. Nous avons donc adapt&#233; la typologie
de Nemesis en fonction des cat&#233;gories du corpus AFP et du corpus BBN. Toutefois, beaucoup
d&#8217;erreurs sont dues &#224; une incoh&#233;rence de cat&#233;gorisation. Par exemple, la notion d&#8217;organisation et
d&#8217;entreprise n&#8217;est pas identique entre Nemesis et le corpus BBN (l&#8217;entit&#233; &#171; Federal Reserve Board
&#187; est annot&#233;e comme &#233;tant une entreprise par le syst&#232;me Nemesis alors qu&#8217;elle est consid&#233;r&#233;e
comme &#233;tant une organisation dans le corpus BBN).
</p>
<p>7 Conclusion et perspectives
</p>
<p>Cet article pr&#233;sente une m&#233;thode peu co&#251;teuse pour porter un syst&#232;me symbolique de REN
d&#233;di&#233; pour le fran&#231;ais vers l&#8217;anglais. L&#8217;adaptation est bas&#233;e principalement sur les ressources
d&#233;velopp&#233;es pour le fran&#231;ais. Elle consiste &#224; traduire les lexiques fran&#231;ais et &#224; adapter l&#233;g&#232;rement
quelques r&#232;gles de la grammaire. L&#8217;&#233;valuation du syst&#232;me adapt&#233; montre des r&#233;sultats satisfai-
sants pour la reconnaissance des noms de personne et de lieu. En revanche, les r&#233;sultats restent
insuffisants pour les noms d&#8217;organisation et d&#8217;entreprise. Un traitement plus approfondi est n&#233;ces-
saire pour ces deux cat&#233;gories. Pour cela, nous comptons mesurer l&#8217;impact d&#8217;un enrichissement
des lexiques de Nemesis (notamment les listes d&#8217;organisation et d&#8217;entreprise). D&#8217;un autre c&#244;t&#233;,
nous envisageons d&#8217;adapter les r&#232;gles de r&#233;&#233;criture automatiquement et de tester cette m&#233;thode
sur d&#8217;autres langues qui sont moins proches du fran&#231;ais que l&#8217;anglais.
</p>
<p>159</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>B&#201;CHET, F. et CHARTON, E. (2010). Unsupervised knowledge acquisition for extracting named
entities from speech. In Proceedings of the 35th IEEE International Conference on Acoustics, Speech,
and Signal Processing (ICASSP&#8217;10), pages 5338&#8211;5341, Dallas, Texas, USA.
</p>
<p>BIKEL, D. M., MILLER, S., SCHWARTZ, R. et WEISCHEDEL, R. (1997). Nymble : a high-performance
learning name-finder. In Proceedings of the 5th Conference on Applied Natural Language Processing
(ANLP&#8217;97), pages 194&#8211;201, Washington, DC, USA.
</p>
<p>BRUN, C. et EHRMANN, M. (2010). Un syst&#232;me de d&#233;tection d&#8217;entit&#233;s nomm&#233;es adapt&#233; pour la
campagne d&#8217;&#233;valuation ester 2. In Actes de la 17&#232;me conf&#233;rence sur le Traitement Automatique
des Langues Naturelles (TALN&#8217;10), Montr&#233;al, Canada.
</p>
<p>EHRMANN, M. (2008). Les Entit&#233;s Nomm&#233;es, de la Linguistique au TAL - Statut Th&#233;orique et
M&#233;thodes de D&#233;sambigu&#239;sation. Th&#232;se de doctorat, Universit&#233; Paris 7, France.
</p>
<p>FINKEL, J. R., GRENAGER, T. et MANNING, C. (2005). Incorporating non-local information into
information extraction systems by gibbs sampling. In Proceedings of the 43rd Annual Meeting on
Association for Computational Linguistics (ACL&#8217;05), pages 363&#8211;370, Ann Arbor, Michigan, USA.
</p>
<p>FOUROUR, N. (2002). Nemesis, un syst&#232;me de reconnaissance incr&#233;mentielle des entit&#233;s nom-
m&#233;es pour le fran&#231;ais. In Actes de la 9&#232;me conf&#233;rence sur le Traitement Automatique des Langues
Naturelles (TALN&#8217;02), pages 265&#8211;274, Nancy, France.
</p>
<p>FOUROUR, N. (2003). Apport du web dans la reconnaissance des entit&#233;s nomm&#233;es. In Revue
Qu&#233;b&#233;coise de Linguistique (RQL), pages 41&#8211;60.
</p>
<p>GALLIANO, S., GRAVIER, G. et CHAUBARD, L. (2009). The ester 2 evaluation campaign for the rich
transcription of french radio broadcasts. In Proceedings of the 10th conference Interspeech, pages
2583&#8211;2586, Brighton, UK.
</p>
<p>GAMON, M., LOZANO, C., PINKHAM, J. et REUTTER, T. (1997). Practical experience with grammar
sharing in multilingual nlp. In Workshop From research to commercial applications : making NLP
work in practice, pages 49&#8211;56, Madrid, Spain.
</p>
<p>GRISHMAN, R. et SUNDHEIM, B. (1996). Message Understanding Conference-6 : a brief history.
In Proceedings of the 16th conference on Computational linguistics (COLING&#8217;06), pages 466&#8211;471,
Copenhagen, Denmark.
</p>
<p>KLEMENTIEV, A. et ROTH, D. (2006). Named entity transliteration and discovery from multilingual
comparable corpora. In Proceedings of Human Language Technology Conference of the North
American Chapter of the Association of Computational Linguistics (HLT-NAACL&#8217;06), pages 82&#8211;88,
New York, USA.
</p>
<p>MAUREL, D., FRIBURGER, N., ANTOINE, J.-Y., ESHKOL-TARAVELLA, I. et NOUVEL, D. (2011). Cascades
de transducteurs autour de la reconnaissance des entit&#233;s nomm&#233;es. In Traitement Automatique
des Langues (TAL), pages 69&#8211;96.
</p>
<p>MCDONALD, D. D. (1996). Internal and external evidence in the identification and semantic
categorization of proper names. In Corpus processing for lexical acquisition, pages 21&#8211;39. MIT
Press, Cambridge, MA, USA.
</p>
<p>NOTHMAN, J., MURPHY, T. et CURRAN, J. R. (2009). Analysing wikipedia and gold-standard
corpora for ner training. In Proceedings of the 12th Conference of the European Chapter of the
Association for Computational Linguistics (EACL&#8217;09), pages 612&#8211;620, Athens, Greece.
</p>
<p>160</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>POIBEAU, T. (2003). The multilingual named entity recognition framework. In Proceedings of the
10th Conference on European chapter of the Association for Computational Linguistics (EACL&#8217;03),
pages 155&#8211;158, Budapest, Hungary.
</p>
<p>RAYMOND, C. et FAYOLLE, J. (2010). Reconnaissance robuste d&#8217;entit&#233;s nomm&#233;s sur de la parole
transcrite automatiquement. In Actes de la 17&#232;me conf&#233;rence sur le Traitement Automatique des
Langues Naturelles (TALN&#8217;10), pages 19&#8211;23, Montr&#233;al, Canada.
</p>
<p>STERN, R. et SAGOT, B. (2010). D&#233;tection et r&#233;solution d&#8217;entit&#233;s nomm&#233;es dans des d&#233;p&#234;ches
d&#8217;agence. In Actes de la 17&#232;me conf&#233;rence sur le Traitement Automatique des Langues Naturelles
(TALN&#8217;10), Montr&#233;al, Canada.
</p>
<p>TJONG KIM SANG, E. F. (2002). Introduction to the conll-2002 shared task : language-independent
named entity recognition. In Proceedings of the 6th Workshop on Computational Language
Learning (CoNLL&#8217;02), pages 155&#8211;158, Taipei, Taiwan.
</p>
<p>161</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div>
</div></div>
</body></html>