<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une plateforme pour l'acquisition, la maintenance et la validation de ressources lexicales</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Une plateforme pour l&#8217;acquisition, la maintenance et la
validation de ressources lexicales
</p>
<p>VanRullen T. , Blache P. , Portes C. , Rauzy S. , Maeyhieux J.-F. , Gu&#233;not
M.-L. ,Balfourier J.-M. , Bellengier E.
</p>
<p>Laboratoire Parole et Langage - CNRS - Universit&#233; de Provence
29, Avenue Robert Schuman - 13100 Aix-en-Provence
</p>
<p>{tristan,pb}@lpl.univ-aix.fr
</p>
<p>Mots-clefs : dictionnaire, lexique, lexique noyau
Keywords: dictionary, lexicon, kernel lexicon
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons une plateforme de d&#233;veloppement de lexique offrant une base
lexicale accompagn&#233;e d&#8217;un certain nombre d&#8217;outils de maintenance et d&#8217;utilisation. Cette base,
qui comporte aujourd&#8217;hui 440.000 formes du Fran&#231;ais contemporain, est destin&#233;e &#224; &#234;tre diffus&#233;e
et remise &#224; jour r&#233;guli&#232;rement. Nous exposons d&#8217;abord les outils et les techniques employ&#233;es
pour sa constitution et son enrichissement, notamment la technique de calcul des fr&#233;quences
lexicales par cat&#233;gorie morphosyntaxique. Nous d&#233;crivons ensuite diff&#233;rentes approches pour
constituer un sous-lexique de taille r&#233;duite, dont la particularit&#233; est de couvrir plus de 90% de
l&#8217;usage. Un tel lexique noyau offre en outre la possibilit&#233; d&#8217;&#234;tre r&#233;ellement compl&#233;t&#233; manuelle-
ment avec des informations s&#233;mantiques, de valence, pragmatiques etc.
</p>
<p>Abstract We present a lexical development platform which comprises a lexical database
of 440.000 lemmatized words of contemporary French, plus a set of maintenance tools. The
lexical database is intended to be distributed and updated regularly. We present in this paper
tools and techniques applied for the lexicon constitution and its enrichment, in particular the
computation of lexical frequencies by morphosyntactic category. Then we describe various
approaches to build an under-lexicon of reduced size, whose characteristic is to cover more
than 90% of the use. Such a kernel lexicon makes it moreover possible to be really enriched by
hand with semantic, valence, pragmatic information, etc.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VanRullen T., Blache P., Portes C., Rauzy S., Maeyhieux J.-F., Gu&#233;not M.-L. ,
Balfourier J.-M., Bellengier E.
</p>
<p>1 Introduction
</p>
<p>L&#8217;&#233;laboration d&#8217;un lexique &#233;lectronique peut sembler une t&#226;che obsol&#232;te, de nombreux lex-
iques du fran&#231;ais &#233;tant r&#233;f&#233;renc&#233;s. Cependant, force est de constater que cette affirmation doit
&#234;tre modul&#233;e. La premi&#232;re constatation est que seul un petit nombre d&#8217;entre eux est effec-
tivement accessible. Il faut de ce point de vue souligner le r&#244;le consid&#233;rable jou&#233; par Bdlex
(cf. [de Calmes98]) qui, dans le cadre des activit&#233;s du GdR-PRC Communication Homme-
Machine, a longtemps &#233;t&#233; le lexique le plus largement diffus&#233; en contribuant ainsi puissamment
&#224; l&#8217;&#233;volution du domaine en France. Le mode de diffusion constitue &#233;videmment un aspect
critique 1. Un rapide survol des ressources lexicales libres d&#8217;acc&#232;s pour le fran&#231;ais permet d&#8217;en
identifier deux :
- Lexique : il s&#8217;agit d&#8217;un lexique comportant 130.000 formes et comportant des
</p>
<p>informations morphosyntaxiques, phonologiques et des indications de
fr&#233;quence (cf. [New01], http://www.lexique.org/).
</p>
<p>- ABU : contient 300.000 formes avec indications morphosyntaxiques (cf. [ABU],
http://abu.cnam.fr/).
</p>
<p>On peut par ailleurs trouver quelques ressources verbales, par exemple :
</p>
<p>- Lefff : il contient 200.000 formes verbales, avec les informations de base (temps,
nombre, personne) (cf. [Cl&#233;ment04], http://www.lefff.net/);
</p>
<p>- Litote : c&#8217;est une base contenant les formes conjugu&#233;es de 6.500 verbes.
(http://www.loria.fr/equipes/calligramme/litote/)
</p>
<p>Par ailleurs, il faut &#233;galement signaler la d&#233;marche initi&#233;e par le Loria dans le cadre du pro-
jet Morphalou (cf. [Romary04], http://loreley.loria.fr/morphalou/). Ce projet
fournira &#233;galement &#224; terme un lexique morphologique de 540.000 formes. Son int&#233;r&#234;t tient
d&#8217;une part au fait qu&#8217;il est collaboratif mais &#233;galement qu&#8217;il s&#8217;inscrit dans le cadre du projet
LMF (Lexical Markup Framework), proposant la normalisation du codage des informations
linguistiques.
</p>
<p>Il reste donc un travail important pour parvenir &#224; un lexique de qualit&#233;. Pour cela, une base
lexicale doit avant tout &#234;tre nettoy&#233;e de fa&#231;on &#224; proposer une couverture ad&#233;quate du fran&#231;ais. Il
ne sert &#224; rien de constituer une ressource de 400 ou 500.000 formes si la plupart d&#8217;entre elles ne
sont pas attest&#233;es. Le second aspect concerne le type d&#8217;informations contenu dans le lexique. Il
est en effet n&#233;cessaire qu&#8217;un lexique contienne pour une m&#234;me entr&#233;e autant d&#8217;informations que
possible concernant ses propri&#233;t&#233;s morphologiques, syntaxiques, bien entendu, mais &#233;galement
s&#233;mantiques, phon&#233;tiques ou phonologiques. La forme phon&#233;tis&#233;e de l&#8217;entr&#233;e, la syllabation ou
la fr&#233;quence sont par exemple autant d&#8217;informations pr&#233;cieuses pour la description.
</p>
<p>Nous d&#233;crivons dans cet article la base lexicale d&#233;velopp&#233;e au LPL. Cette base, construite au-
tour d&#8217;un lexique morphologique, pr&#233;sente la particularit&#233; d&#8217;&#234;tre couvrante, de contenir des
information vari&#233;es et d&#8217;avoir &#233;t&#233; valid&#233;e sur corpus. Cette base est associ&#233;e &#224; une v&#233;ritable
plateforme de d&#233;veloppement lexical, munie de divers outils de maintenance et d&#8217;acc&#232;s. Apr&#232;s
une pr&#233;sentation des principales caract&#233;ristiques de cette plateforme, nous en proposons une
&#233;valuation se fondant sur diff&#233;rents corpus. Nous d&#233;crivons de plus l&#8217;exploitation de cette base
dans la perspective d&#8217;une &#233;tude lexicale du fran&#231;ais contemporain.
</p>
<p>1Nous nous associons de ce point de vue &#224; la d&#233;marche aujourd&#8217;hui propos&#233;e par le projet Morphalou et nos
ressources seront distribu&#233;es dans ce cadre</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plateforme pour l&#8217;acquisition, la maintenance et la validation de ressources
lexicales
</p>
<p>2 Le lexique complet
</p>
<p>Le lexique que nous avons mis au point a fait l&#8217;objet de beaucoup d&#8217;&#233;tudes et de travaux
d&#8217;am&#233;lioration. Nous aboutissons actuellement &#224; un lexique d&#233;factoris&#233; de plus de 444.000
entr&#233;es correspondant &#224; environ 320.000 formes orthographiques diff&#233;rentes. Ce lexique est
associ&#233; &#224; un ensemble d&#8217;outils permettant sa maintenance, sa s&#233;curisation et son interrogation.
Ce projet est la base n&#233;cessaire &#224; des applications du TALN qui auront besoin d&#8217;une ressource
fiable, c&#8217;est pourquoi l&#8217;accent a &#233;t&#233; mis sur la maintenabilit&#233; de la ressource.
</p>
<p>Les entr&#233;es du lexique DicoLPL sont bas&#233;es sur des ressources libres et une acquisition semi-
automatique. Comme le montre la figure 1, nous avons au d&#233;part recens&#233; et incorpor&#233; des
lexiques libres, tels ABU ou Lexique.org. Le formatage de notre lexique a n&#233;cessit&#233; un travail
de transformation, de cat&#233;gorisation, de phon&#233;tisation etc., afin de faire correspondre les entr&#233;es
acquises. L&#8217;&#233;tape importante que constitue le calcul des fr&#233;quences lexicales est abord&#233; dans la
prochaine section.
</p>
<p>Figure 1: Conception du dictionnaire
</p>
<p>Forme Phonetisation Frequence Categorie Lemme
de_traviole d@_tRavjOl@ 9 Rgp de_traviole
dealer dil@R 188 Ncms&#8211; dealer
dealers dil@R 368 Ncmp&#8211; dealer
d&#233;ambula dea&#8764;byla 5 Vmis3s&#8211; d&#233;ambuler
d&#233;ambulai dea&#8764;bylE 0 Vmis1s&#8211; d&#233;ambuler
d&#233;ambulaient dea&#8764;bylE 23 Vmii3p&#8211; d&#233;ambuler
d&#233;ambulais dea&#8764;bylE 1 Vmii1s&#8211; d&#233;ambuler
d&#233;ambulais dea&#8764;bylE 0 Vmii2s&#8211; d&#233;ambuler
d&#233;ambulait dea&#8764;bylE 17 Vmii3s&#8211; d&#233;ambuler
</p>
<p>Figure 2: Extrait du lexique
</p>
<p>Le format du lexique, son codage, et son stockage ont &#233;t&#233; pens&#233;s afin d&#8217;acc&#233;l&#233;rer son charge-
ment dans les applications qui le requi&#232;rent. Ce lexique est en effet actuellement embarqu&#233; dans
des applications de communication sur des machines ayant de petites capacit&#233;s. D&#8217;autre part,
il s&#8217;agit de permettre avec le m&#234;me stockage un d&#233;veloppement et des modifications manuels.
C&#8217;est pourquoi un format ASCII, structur&#233; en CSV tabul&#233; classique a &#233;t&#233; choisi, plut&#244;t qu&#8217;un
standard XML ou qu&#8217;une forme binaire de type base de donn&#233;es. Ce choix a r&#233;pondu &#224; nos
attentes et permet une transformation rapide dans d&#8217;autres formats tels que le XML r&#233;pondant
aux normes ISO (TC37/SC4) utilis&#233;es par le projet MORPHALOU par exemple.
Notre lexique se structure sous une forme d&#233;factoris&#233;e (une ligne par quadruplet [Mot, Phoneti-
sation, Categorie, Lemme] par opposition &#224; d&#8217;autres lexiques pour lesquels une seule ligne est
r&#233;serv&#233;e pour chaque forme orthographique.
</p>
<p>L&#8217;extrait de lexique donn&#233; dans la table 2 met en &#233;vidence les caract&#233;ristiques de son format.
On y observe la d&#233;factorisation du mot d&#233;ambulais.
</p>
<p>Certaines colonnes ont &#233;t&#233; r&#233;serv&#233;es pour un usage ult&#233;rieur; les mots accept&#233;s dans ce lex-
ique ne doivent pas &#234;tre des affixes, mais toujours des mots (simples ou compos&#233;s) du langage
courant. Ainsi, les pr&#233;fixes et suffixes tels que anti, hecto, isme ou able en sont rejet&#233;s.
Le codage des champs du lexique est lui aussi contraint: les fr&#233;quences correspondent au nom-
bre d&#8217;occurences de chaque entr&#233;e mesur&#233;e sur les corpus d&#8217;apprentissage. Les valeurs sont des
entiers et ne repr&#233;sentent pas des pourcentages. Les valeurs de traits des cat&#233;gories de chaque
entr&#233;e sont format&#233;es selon un codage d&#233;riv&#233; de Multext et de Grace. La forme phon&#233;tis&#233;e est
exprim&#233;e &#224; l&#8217;aide de l&#8217;alphabet standard Sampa, qui permet un codage phon&#233;tique en texte brut
sans faire appel &#224; des polices de caract&#232;res sp&#233;cifiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VanRullen T., Blache P., Portes C., Rauzy S., Maeyhieux J.-F., Gu&#233;not M.-L. ,
Balfourier J.-M., Bellengier E.
</p>
<p>3 Plateforme d&#8217;enrichissement du lexique
</p>
<p>Le lexique DicoLPL est une ressource en &#233;volution. Nous pr&#233;sentons ici quelques uns des outils
qui permettent son enrichissement.
</p>
<p>Figure 3: segmenteur et &#233;tiqueteur
</p>
<p>Deux outils - un segmenteur et un &#233;tiqueteur- met-
tent en relation les mots d&#8217;un texte fourni en en-
tr&#233;e avec les mots du lexique. La figure 3 illus-
tre leur usage. Le segmenteur, bas&#233; sur des au-
tomates simples, effectue un d&#233;coupage du texte
en tokens. C&#8217;est &#224; partir de ces informations
que l&#8217;&#233;tiqueteur effectuera la d&#233;sambiguisation en
contexte des cat&#233;gories &#224; attribuer &#224; chaque token.
</p>
<p>La technique de d&#233;sambiguisation que nous utilisons s&#8217;inspire des techniques stochastiques ex-
istantes. Nous avons cependant pr&#233;f&#233;r&#233; d&#233;velopper notre propre &#233;tiqueteur afin de correspondre
au mieux avec la pr&#233;cision des traits morphosyntaxiques que nous employons. Une premi&#232;re
&#233;valuation de l&#8217;&#233;tiqueteur sur le corpus du projet Multitag (cf. [Paroubek00]) a donn&#233; des r&#233;-
sultats par cat&#233;gorie variant de 60% &#224; 99%. Le score moyen calcul&#233; sur le corpus de r&#233;f&#233;rence
Multitag est de 95%.
</p>
<p>Figure 4: calcul des fr&#233;quences lexicales
</p>
<p>Afin d&#8217;enrichir le lexique et de calculer au besoin
les fr&#233;quences lexicales sp&#233;cifiques &#224; un ensem-
ble de corpus, nous avons d&#233;velopp&#233; un outil de
fr&#233;quen&#231;age. Comme l&#8217;indique la figure 4, cet
outil fait appel aux r&#233;sultats de l&#8217;&#233;tiquetage pour
en d&#233;duire les fr&#233;quences des entr&#233;es du lexique,
pour chaque couple (mot, cat&#233;gorie). A partir
d&#8217;un lexique initial, &#233;tant donn&#233; un ensemble de
textes, nous obtenons en sortie du fr&#233;quenceur un
lexique des mots inconnus, un lexique des noms-
propres et une nouvelle version du lexique initial,
dont les champs fr&#233;quence sont mis &#224; jour.
</p>
<p>La version actuelle de DicoLPL dispose des fr&#233;quences acquises sur 153 millions de mots tir&#233;s
du journal Le Monde, de ressources litt&#233;raires gratuites, de transcriptions de corpus oraux et des
textes sp&#233;cifiques (domaine m&#233;dical, corpus de mails etc.).
D&#8217;autre part, la forme phon&#233;tis&#233;e des entr&#233;es est obtenue gr&#226;ce &#224; un phon&#233;tiseur inspir&#233; du
projet Syntaix (cf. [Di Cristo01]) pour la conception d&#8217;un syst&#232;me de synth&#232;se vocale. D&#8217;autres
champs (s&#233;mantique, valence verbale etc.) n&#233;cessitent toujours une validation manuelle.
L&#8217;&#233;valuation des outils et du lexique est r&#233;alis&#233;e avec les techniques suivantes: Nous pouvons
mesurer la couverture du lexique pour un corpus donn&#233; (calculer le quotient nombre de mots
reconnus / nombre total de mots). La couverture actuelle du lexique repr&#233;sente 96% des corpus
analys&#233;s (153 millions de mots). Lorsque nous souhaitons une information plus fine concernant
l&#8217;&#233;tiquetage, il faut alors disposer d&#8217;un corpus de r&#233;f&#233;rence, pour lequel chaque mot est associ&#233; &#224;
une cat&#233;gorie morphosyntaxique certifi&#233;e. Il est alors possible de mesurer les scores de rappel
et pr&#233;cision pour chaque cat&#233;gorie. C&#8217;est dans ce cadre que nous avons pu calculer un score de
95% sur le corpus de r&#233;f&#233;rence Multitag.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une plateforme pour l&#8217;acquisition, la maintenance et la validation de ressources
lexicales
</p>
<p>4 Un lexique noyau du fran&#231;ais contemporain
</p>
<p>Une fois le lexique constitu&#233;, il est n&#233;cessaire de v&#233;rifier sa couverture. Par ailleurs, l&#8217;analyse
des corpus d&#233;crits plus haut permet de fournir des indications pour la constitution d&#8217;un dic-
tionnaire minimal (ou lexique noyau) du fran&#231;ais ayant une couverture maximale (un tel sous-
lexique est toujours sp&#233;cifique &#224; un ensemble de corpus). Cette ressource est d&#8217;une grande
importance pour le futur: Il n&#8217;est pas possible d&#8217;enrichir un grand lexique manuellement. Or,
nombre d&#8217;informations ne peuvent aujourd&#8217;hui &#234;tre acquises totalement automatiquement, no-
tamment les informations s&#233;mantiques. Un lexique noyau permet d&#8217;identifier un nombre limit&#233;
d&#8217;entr&#233;es lexicales qu&#8217;il est possible d&#8217;enrichir y compris manuellement. L&#8217;objectif est &#224; terme
de disposer d&#8217;une ressource lexicale tr&#232;s compl&#232;te, comportant des informations syntaxiques,
s&#233;mantiques, voire pragmatiques. Un lexique limit&#233; aux 10.000 formes les plus fr&#233;quentes
couvre en moyenne 90% du fran&#231;ais. Il s&#8217;av&#232;re donc int&#233;ressant de s&#233;lectionner un lexique
noyau du Fran&#231;ais contemporain avoisinant cette taille. La qualit&#233; de l&#8217;information concernant
la fr&#233;quence de chacune des entr&#233;es du lexique complet permet de concevoir un lexique noyau
(dor&#233;navant LN) des mots les plus fr&#233;quents. C&#8217;est aussi l&#8217;occasion d&#8217;&#233;valuer diachroniquement
l&#8217;&#233;volution du lexique de base du fran&#231;ais depuis &quot;Le Fran&#231;ais Fondamental&quot; (cf. [Gougen-
heim64] et [Blache05]). Nous avons s&#233;lectionn&#233; les formes pertinentes du LN gr&#226;ce &#224; une
m&#233;thode simple utilisant une fr&#233;quence seuil (une autre m&#233;thode bas&#233;e sur une r&#233;flexion &#224; pro-
pos des types de cat&#233;gories &#224; conserver ind&#233;pendamment de leur fr&#233;quence s&#8217;est r&#233;v&#233;l&#233;e moins
efficace et a &#233;t&#233; abandonn&#233;e). Ainsi, pour obtenir un dictionnaire de 10.000 formes (LN10)
avons nous s&#233;lectionn&#233; les 10.000 entr&#233;es les plus fr&#233;quentes du lexique g&#233;n&#233;ral DicoLPL, c&#8217;est-
&#224;-dire toutes les formes dont la fr&#233;quence est sup&#233;rieure &#224; 1091. Diff&#233;rentes versions de LN de
taille croissante ont &#233;t&#233; produites suivant la m&#234;me m&#233;thode : LN15 (fr&#233;quence&gt;613, 15.017
formes), LN20 (fr&#233;quence&gt;389,19.990 formes) et LN30 (fr&#233;quence&gt;193, 30.018 formes) afin
de comparer leurs couvertures et choisir le meilleur rendement taille/couverture.
</p>
<p>DicoNoyau Corpus &#233;crit Corpus oral
LN10 (f&gt;1091) 88,63% 91,56%
LN15 (f&gt;613) 91,07% 93,60%
LN20 (f&gt;389) 92,50% 94,60%
LN30 (f&gt;193) 94,08% 96,46%
DicoLPL 96,21% 99,02%
</p>
<p>Figure 5: couvertures par taille de lexique
et par type de corpus
</p>
<p>Nous avons soumis les diff&#233;rentes versions du
LN &#224; un test de couverture sur deux types dif-
f&#233;rents de corpus: un corpus &#233;crit (580.000
mots extraits d&#8217;articles publi&#233;s dans le journal
Le Monde) et un corpus oral (435.000 mots
et regroupe le Bristol Corpus, un ensemble de
95 entretiens enregistr&#233;s et transcrits par Kate
Beeching (1988-1990), ainsi que des corpus de
parole recueillis au LPL).
</p>
<p>Les r&#233;sultats pr&#233;sent&#233;s dans la figure 5 appellent plusieurs commentaires: nous constatons
d&#8217;abord que la couverture du lexique g&#233;n&#233;ral DicoLPL (derni&#232;re ligne) n&#8217;est pas totale et qu&#8217;elle
est meilleure pour le corpus oral que pour le corpus &#233;crit, remarque qui vaut aussi pour les
autres dictionnaires. Ceci s&#8217;explique selon nous par le fait que l&#8217;&#233;crit utilise un vocabulaire
beaucoup plus &#233;tendu et vari&#233; que l&#8217;oral. On constate aussi que les performances de couverture
s&#8217;am&#233;liorent r&#233;guli&#232;rement au fur et &#224; mesure que le LN contient plus de formes, ce qui est bien
s&#251;r attendu. Il faut n&#233;anmoins noter qu&#8217;il existe un saut qualitatif plus important entre LN10
et LN15 qu&#8217;entre LN15 et LN20 ou LN20 et LN30 alors m&#234;me que l&#8217;&#233;cart de taille entre ces
deux derniers est plus important. Le dictionnaire noyau de 15000 formes appara&#238;t donc comme
la version optimale pour obtenir la plus grande couverture avec un nombre r&#233;duit de formes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VanRullen T., Blache P., Portes C., Rauzy S., Maeyhieux J.-F., Gu&#233;not M.-L. ,
Balfourier J.-M., Bellengier E.
</p>
<p>5 Conclusion
</p>
<p>La plateforme de d&#233;veloppement de lexique d&#233;crite dans cet article r&#233;pond &#224; un certain nombre
de besoins &#224; la fois en termes de richesse d&#8217;informations, mais &#233;galement de d&#233;veloppements
de lexiques sp&#233;cialis&#233;s en produisant des fr&#233;quences sp&#233;cifiques. Notre approche permet de
rationaliser le choix des entr&#233;es sur lesquelles travailler en proposant la construction d&#8217;un lex-
ique noyau &#233;labor&#233; sur la base d&#8217;une v&#233;ritable analyse de la langue. L&#8217;enrichissement manuel
de petits lexiques avec des informations s&#233;mantiques, pragmatiques etc. s&#8217;en trouve facilit&#233;.
C&#8217;est pourquoi nous d&#233;fendons la d&#233;marche qui consiste &#224; concentrer les efforts sur un sous-
lexique dont la couverture a &#233;t&#233; v&#233;rifi&#233;e sur corpus. D&#8217;autre part, un lexique de petite taille offre
de nombreuses possibilit&#233;s d&#8217;&#233;tudes sur l&#8217;usage avec notamment les r&#233;seaux s&#233;mantiques, les
petits mondes etc. (voir &#224; ce propos [Ferrer01]).
Le fait de disposer d&#8217;un grand lexique de formes n&#8217;en reste pas moins un atout, puisque c&#8217;est
&#224; partir d&#8217;une telle ressource que peuvent &#234;tre extraits des sous-lexiques ad hoc couvrant des
types de texte de domaines divers que le fr&#233;quen&#231;age permet d&#8217;isoler.
Enfin, la t&#226;che de constituer une telle ressource est immense. Nous souhaitons la voir s&#8217;am&#233;liorer
avec le temps, ce qui suppose sa diffusion, sa confrontation &#224; l&#8217;usage et un retour de la com-
munaut&#233;. La plateforme d&#233;crite ici comportant une s&#233;rie d&#8217;outils de maintenance, il est ainsi
possible d&#8217;envisager une mise &#224; jour r&#233;guli&#232;re des informations. Au total, notre contribution
viendrait s&#8217;inscire dans le mouvement de mise &#224; disposition de ressources du fran&#231;ais initi&#233; par
les diff&#233;rents projets signal&#233;s plus haut.
</p>
<p>R&#233;f&#233;rences
Association des Bibliophiles Universels, &#8220;ABU. Dictionnaire des mots communs&#8221;, in La Biblioth&#232;que
Universelle, http://abu.cnam.fr/DICO/mots-communs.html. CNAM.
Blache P., M.-L. Gu&#233;not &amp; C. Portes (2005), &#8220;Outils et ressources pour la mise &#224; jour du Fran&#231;ais
Fondamental&#8221;, in Proceedings of Fran&#231;ais Fondamental: 50 ans de travaux et d&#8217;enjeux.
Cl&#233;ment L., B. Sagot &amp; B. Lang (2004), &#8220;Morphology-Based Automatic Acquisition&#8221;, in proceedings of
LREC-04.
de Calm&#232;s M. &amp; G. P&#233;rennou (1998), &#8220;BDLEX : a Lexicon for Spoken and Written French&#8221;, in proceed-
ings of LREC-98
Di Cristo &amp; P. Di Cristo (2001), &#8220;Syntaix : une approche m&#233;trique-autosegmentale de la prosodie&#8221;, in
revue TAL, 42:1
</p>
<p>Ferrer R., Cancho I. &amp; Sole R. (2001), &#8220;The small-world of human language&#8221;, Proceedings of the Royal
Society of London, B 268, 2261&#8211; 2266 url = &quot;citeseer.ist.psu.edu/ferrer01small.html&quot;
Gougenheim, G. ; Rivenc, P. ; Mich&#233;a, R. &amp; Sauvageot, A. (1964), &#8220;L&#8217;&#233;laboration du Fran&#231;ais Fonda-
mental&#8221;, 1er degr&#233;, Didier : New B.
Pallier C., L. Ferrand &amp; R.Matos (2001), &#8220;Une base de donn&#233;es lexicales du Fran&#231;ais contemporain sur
Internet : Lexique &#8221;, in L&#8217;Ann&#233;e Pschologique, 101
Paroubek P. &amp; M. Rajman (2000), &#8220;MULTITAG, une ressource linguistique produit du paradigme
d&#8217;&#233;valuation&#8221;, in Actes de la conf&#233;rence TALN-2000
Romary L., S. Salmon-Alt &amp; G. Francopoulo (2004), &#8220;Standards going concrete: from LMF to Mor-
phalou&#8221;, in Workshop on Electronic Dictionaries, COLING-04.</p>

</div></div>
</body></html>