<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Combiner analyse superficielle et profonde : bilan et perspectives</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Combiner analyse superficielle et profonde : bilan et
perspectives
</p>
<p>Philippe Blache
Laboratoire Parole et Langage
</p>
<p>CNRS &amp; Universit&#233; de Provence
pb@lpl.univ-aix.fr
</p>
<p>Mots-clefs : Analyse syntaxique, analyse superficielle, analyse profonde
Keywords: Parsing, shallow and deep parsing
</p>
<p>R&#233;sum&#233; L&#8217;analyse syntaxique reste un probl&#232;me complexe au point que nombre d&#8217;applications
n&#8217;ont recours qu&#8217;&#224; des analyseurs superficiels. Nous faisons dans cet article le point sur les
notions d&#8217;analyse superficielles et profondes en proposant une premi&#232;re caract&#233;risation de la
notion de complexit&#233; op&#233;rationnelle pour l&#8217;analyse syntaxique automatique permettant de dis-
tinguer objets et relations plus ou moins difficiles &#224; identifier. Sur cette base, nous proposons
un bilan des diff&#233;rentes techniques permettant de caract&#233;riser et combiner analyse superficielle
et profonde.
</p>
<p>Abstract Deep parsing remains a problem for NLP so that many applications has to
use shallow parsers. We propose in this paper a presentation of the different characteristics
of shallow and deep parsing techniques relying on the notion of operational complexity. We
present different approaches combining these techniques and propose a new approach making
it possible to use the output of a shallow parser as the input of a deep one.
</p>
<p>1 Introduction
</p>
<p>Le probl&#232;me de l&#8217;analyse syntaxique reste une question complexe &#224; la fois du point de vue
th&#233;orique et computationnel. La solution g&#233;n&#233;ralement adopt&#233;e pour traiter des masses de don-
n&#233;es volumineuses ou des entr&#233;es non standard consiste &#224; recourir &#224; des analyseurs superficiels,
robustes et efficaces, mais ne construisant que des informations partielles. Il existe un certain
nombre d&#8217;&#233;tudes proposant de combiner les techniques d&#8217;analyse superficielle profonde perme-
ttant soit d&#8217;am&#233;liorer l&#8217;efficacit&#233; des analyseurs profonds en leur offrant un meilleur contr&#244;le
des processus, soit de proposer une approche permettant de choisir le type d&#8217;analyse d&#233;sir&#233; en
fonction des besoins. Cet article dresse un bilan de ces diff&#233;rentes techniques en caract&#233;risant
les notions d&#8217;analyse profonde et superficielle. Ces caract&#233;ristiques sont donn&#233;es non seule-
ment d&#8217;un point de vue op&#233;rationnel, mais &#233;galement en introduisant la notion de complexit&#233;
des ph&#233;nom&#232;nes syntaxiques &#224; analyser. Il s&#8217;agit d&#8217;une premi&#232;re tentative de classification dis-
tinguant les ph&#233;nom&#232;nes faciles &#224; analyser de ceux plus complexes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache
</p>
<p>On distingue g&#233;n&#233;ralement analyse de surface et analyse profonde en fonction de la pr&#233;cision de
l&#8217;information linguistique construite par un analyseur. Les techniques utilis&#233;es sont habituelle-
ment diff&#233;rentes : on retrouve plut&#244;t les techniques probabilistes du c&#244;t&#233; des analyseurs su-
perficiels tandis que les analyseurs profonds utilisent plut&#244;t des approches symboliques. Cette
caract&#233;risation doit &#234;tre compl&#233;t&#233;e par la prise en compte de la finalit&#233; de l&#8217;application util-
isant l&#8217;analyseur. Il convient pour cela d&#8217;identifier pr&#233;cis&#233;ment les besoins en termes morpho-
syntaxiques ou s&#233;mantiques pour identifier le niveau d&#8217;analyse requis (chunks pour les sys-
t&#232;mes de synth&#232;se de la parole, rep&#233;rage d&#8217;objets nominaux pour les applications de recherche
d&#8217;information, etc.). Cependant, certaines applications n&#233;cessitent, m&#234;me ponctuellement, des
informations plus d&#233;taill&#233;es concernant les relations syntaxiques ou les effets de sens pour une
construction donn&#233;e. Nous avons ainsi d&#8217;une part une distinction en termes d&#8217;efficacit&#233; (les
analyseurs superficiels sont plus rapides et plus robustes que les analyseurs profonds) et de
l&#8217;autre une distinction de finalit&#233;.
</p>
<p>La question du d&#233;terminisme est &#224; prendre en compte de fa&#231;on distincte. Si les analyseurs su-
perficiels sont d&#233;terministes, les analyseurs profonds traitent quant &#224; eux l&#8217;ambigu&#239;t&#233; : toutes
les possibilit&#233;s sont prises en compte pendant l&#8217;analyse et le syst&#232;me fournit plusieurs solu-
tions lorsque l&#8217;ambigu&#239;t&#233; ne peut &#234;tre lev&#233;e. Une fa&#231;on de r&#233;duire la complexit&#233; d&#8217;un analyseur
profond sans le ramener &#224; un analyseur superficiel consiste &#224; le rendre d&#233;terministe. A un pre-
mier niveau, l&#8217;entr&#233;e elle-m&#234;me peut &#234;tre d&#233;terminis&#233;e par l&#8217;utilisation d&#8217;un &#233;tiqueteur d&#233;sam-
bigu&#239;sant. La d&#233;terminisation de l&#8217;analyse consiste alors &#224; &#233;liminer des constructions en cours.
Les propri&#233;t&#233;s de coupure utilis&#233;es peuvent &#234;tre de type tr&#232;s diff&#233;rents : probabilistes (par ex-
emple en utilisant des informations syntaxiques associ&#233;es &#224; des poids), topologiques (propri&#233;t&#233;s
formelles des structures construites, par exemple profondeur des arbres, taille des constituants,
etc.), ou encore cognitives (pr&#233;f&#233;rences de cat&#233;gorisation, de rattachement, etc.). Ces techniques
permettent de prendre des d&#233;cisions de fa&#231;on incr&#233;mentale en cours d&#8217;analyse. Elles peuvent
&#234;tre associ&#233;es &#224; des techniques de retardement consistant &#224; repousser certains choix et maintenir
plusieurs solutions en parall&#232;le, par exemple en les factorisant. On peut donc &#224; ce stade donner
quelques crit&#232;res distinctifs entre les deux approches :
</p>
<p>&#8226; analyseur superficiel : rapide et robuste, il fournit une structuration simple en termes
d&#8217;unit&#233;s non r&#233;cursives ainsi que des relations portant sur ces unit&#233;s
</p>
<p>&#8226; analyseur profond : fournit une description couvrante des constructions de la langue en
indiquant les relations syntaxiques ou syntactico-s&#233;mantiques entre ses constituants.
</p>
<p>Il existe plusieurs approches permettant de combiner ces approches, la section suivante en pro-
pose une pr&#233;sentation. Nous reviendrons ensuite sur une caract&#233;risation de la complexit&#233; des
ph&#233;nom&#232;nes &#224; analyser avant de d&#233;crire, dans la derni&#232;re partie, une technique hybride permet-
tant &#224; un analyseur profond de tirer parti d&#8217;une analyse superficielle.
</p>
<p>2 Approches combinant analyse superficielle et analyse pro-
fonde
</p>
<p>Il existe un certain nombre de travaux proposant d&#8217;utiliser simultan&#233;ment les techniques d&#8217;analyse
superficielle et profonde. Un workshop a &#233;t&#233; r&#233;cemment consacr&#233; &#224; l&#8217;&#233;tude de ce probl&#232;me (cf.
[Hinrichs04]) et a permis de faire un tour d&#8217;horizon de la situation. Dans la plupart des cas,
la technique consiste &#224; utiliser l&#8217;analyse superficielle en tant que pr&#233;-traitement d&#8217;une analyse</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Combiner analyse superficielle et profonde
</p>
<p>profonde. Par analyse superficielle, on entend surtout ici formatage de l&#8217;entr&#233;e visant la d&#233;sam-
bigu&#239;sation de l&#8217;&#233;tiquetage morpho-syntaxique, le traitement des mots inconnus et pouvant aller
jusqu&#8217;&#224; l&#8217;analyse d&#8217;unit&#233;s enti&#232;res comme les entit&#233;s nomm&#233;es par exemple &#224; l&#8217;aide de gram-
maires locales. Ce type d&#8217;approche peut s&#8217;av&#233;rer tr&#232;s efficace et offre l&#8217;avantage de r&#233;utiliser
voire d&#8217;adapter des composants diff&#233;rents : on trouve par exemple dans [Grover01] une descrip-
tion de la r&#233;utilisation d&#8217;outils originellement pr&#233;vus pour l&#8217;analyse en GPSG. Dans ce type
d&#8217;approche, le contr&#244;le de l&#8217;analyse profonde se fait donc en limitant l&#8217;espace de recherche
de l&#8217;analyseur gr&#226;ce &#224; une r&#233;duction du nombre d&#8217;&#233;tiquettes &#224; prendre en compte. De plus,
des parties enti&#232;res peuvent &#234;tre pr&#233;-analys&#233;es, ce qui r&#233;duit d&#8217;autant le nombre de structures &#224;
construire. L&#8217;int&#233;r&#234;t majeur de ce type d&#8217;approche r&#233;side dans le fait l&#8217;analyseur n&#8217;a pas &#224; &#234;tre
modifi&#233; : il est donc possible de traiter avec le m&#234;me syst&#232;me une entr&#233;e brute ou pr&#233;-trait&#233;e.
</p>
<p>Un second type d&#8217;approche, relativement peu r&#233;pandu, consiste &#224; utiliser les r&#233;sultats d&#8217;un
analyseur syntaxique superficiel. L&#8217;entr&#233;e de l&#8217;analyseur profond est la sortie de l&#8217;analyseur su-
perficiel, ce qui n&#233;cessite l&#8217;adaptation de l&#8217;analyseur profond. Une premi&#232;re technique consiste
&#224; modifier (on emploie &#233;galement le terme de lifter) les informations construites par l&#8217;analyseur
superficiel. Cela concerne les unit&#233;s lexicales comme les groupes syntaxiques. Dans le premier
cas, il s&#8217;agit de transformer une unit&#233; simple en une structure enrichie adapt&#233;e au format de
l&#8217;analyseur profond, par exemple par des patterns de filtrage (cf. [Blache95]). Les chunks ou
les unit&#233;s syntaxiques construites peuvent &#233;galement &#234;tre transform&#233;s &#224; l&#8217;aide de r&#232;gles adapt&#233;es
utilisant l&#224; encore des patterns. Une telle approche est d&#233;crite dans [Marimon02] qui transforme
ainsi les unit&#233;s lexicales et les chunks en structures attribut-valeurs du type HPSG comme d&#233;crit
dans l&#8217;exemple suivant :
</p>
<p>rule(
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63728;SYNSEM | LOCAL
&#63726;&#63727;&#63727;&#63727;&#63728;MORPH
</p>
<p>&#63726;&#63727;&#63728;LEMME 2MORPHEME 1
AGR fem, sing
</p>
<p>&#63737;&#63738;&#63739;
CAT | HEAD
</p>
<p>[
NCLASS common
</p>
<p>]
&#63737;&#63738;&#63738;&#63738;&#63739;
&#63737;&#63738;&#63738;&#63738;&#63738;&#63739;, [Pos=&#8217;Ncfs-&#8217;, Lemma= 2 ], 1 ).
</p>
<p>On trouve dans la m&#234;me perspective une technique consistant &#224; enrichir directement la structure
construite &#224; l&#8217;aide de techniques sp&#233;cifiques. C&#8217;est le cas de [Johnson02]) qui d&#233;crit comment,
&#224; partir d&#8217;arbres syntaxiques simples, cr&#233;er des arbres complexes &#224; n&#339;ud vide. Il s&#8217;agit dans
ce cas d&#8217;une op&#233;ration d&#8217;adjonction qui s&#8217;appuie sur des sch&#233;mas d&#8217;arbre sp&#233;cifiant les en-
droits o&#249; ces n&#339;uds peuvent &#234;tre ins&#233;r&#233;s et la valeur des arguments qu&#8217;ils doivent prendre. Le
contr&#244;le du processus se fait gr&#226;ce &#224; une hi&#233;rarchisation de ces sch&#233;mas. Un troisi&#232;me type
d&#8217;approche, d&#233;fendu dans [Uszkoreit02], propose l&#8217;utilisation en parall&#232;le d&#8217;une analyse super-
ficielle et d&#8217;une analyse profonde. Cette approche (cf. [Crysmann02] ou [Frank03]) consiste
&#224; exploiter les informations de l&#8217;analyseur superficiel pour contr&#244;ler l&#8217;analyseur profond et r&#233;-
duire son espace de recherche. Les informations de contr&#244;le fournies par l&#8217;analyseur superficiel
portent dans cet exemple sur la structure topologique de la phrase en allemand. L&#8217;id&#233;e est de
rep&#233;rer les champs topologiques par diff&#233;rentes techniques (cf. [Neumann00]) et guider ainsi la
construction de la structure par l&#8217;analyseur profond. Le dernier type d&#8217;approche repose sur la
possibilit&#233; de r&#233;gler la finesse de l&#8217;analyse en fonction des objectifs. On peut distinguer deux cas
selon que les ressources utilis&#233;es sont identiques ou pas. Un premier type d&#8217;approche consiste
simplement &#224; faire varier la grammaire en entr&#233;e. L&#8217;utilisation d&#8217;une grammaire simple, peu
ambigu&#235; et n&#8217;utilisant que des constituants de forte granularit&#233; permettra d&#8217;obtenir une analyse
grossi&#232;re d&#8217;un &#233;nonc&#233;. Dans ce cas, nous pouvons parler de superficialisation d&#8217;un analyseur
profond par l&#8217;utilisation d&#8217;une grammaire superficielle (cf. [Puver04]). Mais il est &#233;galement</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache
</p>
<p>Type Caract&#233;ristiques Exemple
Pr&#233;-traitement Etiqueteur d&#233;sambigu&#239;sant, grammaires locales [Grover01]
Pr&#233;-analyse Analyse superficielle = input de l&#8217;analyseur profond [Marimon02],[Johnson02]
Contr&#244;le L&#8217;analyseur profond est guid&#233; par l&#8217;analyseur superficiel [Crysmann02], [Frank03]
Granularit&#233; variable M&#234;me analyseur, le type de sortie est une option [Blache02]
</p>
<p>Figure 1: Diff&#233;rentes techniques de combinaison d&#8217;analyseurs
</p>
<p>possible de proposer des techniques permettant d&#8217;exploiter des ressources identiques en termes
de lexique et de grammaire. Ce type d&#8217;approche n&#233;cessite la possibilit&#233; pour l&#8217;analyseur de
construire des structures partielles, limit&#233;es &#224; un certain type de constituant (par exemple les
SN dans le cas de syst&#232;mes de recherche d&#8217;information). De m&#234;me, ce type de syst&#232;me doit
pouvoir construire une segmentation de l&#8217;input (par exemple sous la forme de chunks). Mais
le m&#234;me analyseur doit pouvoir &#224; l&#8217;autre bout de la cha&#238;ne construire &#233;galement une structure
d&#233;taill&#233;e. Un exemple de ce type d&#8217;approche est d&#233;crit dans [Blache02]. Il s&#8217;appuie sur une
repr&#233;sentation d&#233;centralis&#233;e de l&#8217;information sous la forme de contraintes. Le r&#233;glage de la
granularit&#233; d&#8217;analyse s&#8217;op&#232;re en faisant varier la tol&#233;rance de l&#8217;analyseur par un seuil de con-
traintes qu&#8217;il est possible de rel&#226;cher. Le choix de la structure construite en sortie se fait quant
&#224; lui en sp&#233;cifiant le type de contraintes &#224; satisfaire.
</p>
<p>3 Les difficult&#233;s syntaxiques
</p>
<p>Une analyse pr&#233;cise des difficult&#233;s rencontr&#233;es par les analyseurs syntaxiques, en dehors des
probl&#232;mes purement computationnels, reste &#224; &#233;tablir. Il serait en effet tr&#232;s utile de distinguer
les ph&#233;nom&#232;nes faciles &#224; analyser de ceux qui ne le sont pas et d&#8217;en expliquer les raisons. Il
s&#8217;agit d&#8217;un exercice difficile, ce probl&#232;me ne recoupant pas toujours la notion de complexit&#233;
linguistique : certaines constructions peuvent &#234;tre facilement interpr&#233;tables, mais pr&#233;senter des
difficult&#233;s en termes d&#8217;implantation. C&#8217;est le cas par exemple des ph&#233;nom&#232;nes d&#8217;extraction
qui ne pr&#233;sentent que peu d&#8217;ambigu&#239;t&#233; d&#8217;interpr&#233;tation mais pour lesquels les syst&#232;mes ont des
difficult&#233;s d&#8217;analyse. R&#233;ciproquement, les ench&#226;ssements de syntagmes peuvent &#234;tre complexes
mais ne pr&#233;sentent pas en soi de difficult&#233;s pour un analyseur. Il est int&#233;ressant de proposer une
ensemble de constructions ou ph&#233;nom&#232;nes qu&#8217;un analyseur doit pouvoir traiter. L&#8217;article de
synth&#232;se [Abeill&#233;00] en fournit une premi&#232;re liste &#233;tablie de fa&#231;on tout &#224; fait empirique sur la
base d&#8217;une analyse des capacit&#233;s des analyseurs existants au moment de la r&#233;daction de l&#8217;article
(voici 5 ans, ce domaine a bien entendu beaucoup &#233;volu&#233; depuis) :
</p>
<p>&#8226; d&#233;pendances locales: accord, sous-cat&#233;gorisation des pr&#233;dicats, expressions semi-fig&#233;es,
restrictions modifieur-modifi&#233;, clitiques, etc.
</p>
<p>&#8226; d&#233;pendances moyennes : pronominalisation, contr&#244;le des infinitives, association n&#233;gative,
quantifieurs flottants, etc.
</p>
<p>&#8226; d&#233;pendances &#224; distance : questions, relatives, constructions disloqu&#233;es, etc.
&#8226; alternances syntaxiques : passif, impersonnel, causatives, etc.
&#8226; ph&#233;nom&#232;nes de coordination et de comparaison
</p>
<p>Cette liste comporte des ph&#233;nom&#232;nes vari&#233;s et dont la complexit&#233; de traitement d&#233;pend de la
finesse de l&#8217;analyse qu&#8217;on veut en donner, ainsi que du type de repr&#233;sentation de l&#8217;information
choisi. Les ph&#233;nom&#232;nes d&#8217;accord par exemple sont g&#233;n&#233;ralement faciles &#224; traiter pour le
fran&#231;ais ou l&#8217;anglais &#224; condition de disposer dans la grammaire ou le lexique d&#8217;un codage</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Combiner analyse superficielle et profonde
</p>
<p>explicite de l&#8217;information. Pour ce qui concerne les d&#233;pendances &#224; distance, on observe des
situations tr&#232;s diff&#233;rentes. Les relatives font partie des constructions souvent faciles &#224; traiter,
y compris du point de vue de la structure s&#233;mantique. Les constructions disloqu&#233;es posent en
revanche plus de probl&#232;mes. Elles sont assez faciles &#224; rep&#233;rer, mais la relation s&#233;mantique entre
l&#8217;&#233;l&#233;ment disloqu&#233; et le reste de l&#8217;&#233;nonc&#233; est assez complexe &#224; traiter, m&#234;me en pr&#233;sence d&#8217;un
pronom r&#233;somptif. Il convient dans ce cas tout d&#8217;abord d&#8217;identifier ce pronom, celui-ci pouvant
appara&#238;tre dans des positions tr&#232;s vari&#233;es, de v&#233;rifier les compatibilit&#233;s morpho-syntaxiques en-
tre l&#8217;ant&#233;c&#233;dent et le pronom, mais aussi les compatibilit&#233;s s&#233;mantiques entre l&#8217;ant&#233;c&#233;dent et
la structure r&#233;gissant le pronom. Les constructions cliv&#233;es pr&#233;sentent le m&#234;me type de prob-
l&#232;me : elles sont en fran&#231;ais faciles &#224; identifier, mais le rep&#233;rage de leur site d&#8217;attachement est
g&#233;n&#233;ralement complexe. Il faut souligner que cette complexit&#233; de traitement ne se traduit pas
par une difficult&#233; d&#8217;interpr&#233;tation par un humain : les cliv&#233;es sont au contraire dans la plupart
des cas tr&#232;s facile &#224; interpr&#233;ter (ce type de probl&#232;me est signal&#233; dans [Puver04]). Pour une m&#234;me
construction, certaines informations sont donc plus complexes &#224; obtenir que d&#8217;autres. Si l&#8217;on
prend en compte le crit&#232;re de facilit&#233; d&#8217;analyse pour caract&#233;riser un analyseur superficiel, on
peut alors dire que l&#8217;identification de la pr&#233;sence d&#8217;une d&#233;pendance &#224; distance peut &#234;tre obtenue
facilement notamment gr&#226;ce &#224; des marques morphologiques fortes.
</p>
<p>Par ailleurs, il faut distinguer d&#8217;un c&#244;t&#233; la structure elle-m&#234;me (la hi&#233;rarchie des objets) et de
l&#8217;autre les relations existant entre ces objets. Dans le cas d&#8217;une approche syntagmatique par
exemple, un analyseur devra produire un arbre, mais &#233;galement indiquer les relations syntax-
iques ou s&#233;mantiques existant entre les constituants. Un certain nombre de propositions ont
&#233;t&#233; faites pour cela dans le cadre de l&#8217;&#233;valuation des analyseurs syntaxiques (cf. [Carroll01],
[Briscoe02] ou [Carroll03]). Ce paradigme propose de recenser un certain nombre de relations
servant de base &#224; la comparaison et l&#8217;&#233;valuation des analyseurs syntaxique. L&#8217;ensemble des
relations (adapt&#233; aux besoins du fran&#231;ais par rapport &#224; la proposition de [Carroll01]) est d&#233;crit
dans la figure 3 et s&#8217;organise selon la hi&#233;rarchie suivante :
</p>
<p>d&#233;pendance
</p>
<p>&#187;&#187;&#187;
&#187;&#187;&#187;
</p>
<p>&#187;&#187;
</p>
<p>&#169;&#169;
&#169;&#169;
</p>
<p>HH
HH
</p>
<p>XXX
XXX
</p>
<p>XX
</p>
<p>mod arg-mod arg aux conj
mod
</p>
<p>&#169;&#169;
&#169;&#169;
</p>
<p>HH
HH
</p>
<p>ncmod cmod detmod
</p>
<p>arg
</p>
<p>&#169;&#169;
&#169;&#169;
</p>
<p>&#169;
</p>
<p>HH
HH
</p>
<p>H
</p>
<p>subj
&#169;&#169; HH
</p>
<p>ncsubj csubj
</p>
<p>comp
</p>
<p>&#169;&#169;
&#169;
</p>
<p>HH
H
</p>
<p>obj
&#169;&#169; HH
</p>
<p>dobj iobj
clausal
&#169;&#169; HH
</p>
<p>xcomp ccomp
</p>
<p>On propose dans le tableau suivant une r&#233;partition entre relations faciles et difficiles &#224; identifier.
Ce jugement est ici &#233;tabli sur une base empirique. On essaie de donner quelques arguments
justifiant ce classement, mais il conviendrait d&#8217;en faire une description plus syst&#233;matique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache
</p>
<p>Nom Description
d&#233;pendance Relation de d&#233;pendance g&#233;n&#233;rique entre une t&#234;te et un d&#233;pendant
mod Relation entre une t&#234;te et son modifieur. Le type est le mot introduisant la d&#233;pendance
ncmod Modificateur lexical (non propositionnel)
cmod Modificateurs propositionnels
detmod Relation d&#233;terminants / noms
arg-mod Relation t&#234;te/argument, celui-ci &#233;tant r&#233;alis&#233; comme un modifieur (par exemple un SP
</p>
<p>compl&#233;ment du verbe)
arg Relation g&#233;n&#233;rique t&#234;te/argument (plut&#244;t de type compl&#233;ment)
subj Relation pr&#233;dicat/sujet
ncsubj Sujet lexical (non propositionnel)
csubj Sujets propositionnels (par exemple infinitive sujet)
comp Relation t&#234;te/compl&#233;ment
obj Relation t&#234;te/objet
dobj Relation pr&#233;dicat/objet direct (premier compl&#233;ment non propositionnel)
iobj Relation pr&#233;dicat/compl&#233;ment non propositionnel introduit par une pr&#233;position
clausal Relation t&#234;te/compl&#233;ment propositionnel
xcomp la proposition compl&#233;ment n&#8217;a pas de sujet r&#233;alis&#233;
ccomp la proposition compl&#233;ment a un sujet r&#233;alis&#233;
</p>
<p>Figure 2: Description des relations
</p>
<p>Faciles Difficiles
Relation Caract&#233;ristique Relation Caract&#233;ristique
</p>
<p>Ncmod
les relations adj/n, sp/n, sp/v, sa/n sont
juxtapos&#233;es n/sp s&#233;par&#233; par d&#8217;autres &#233;l&#233;ments
</p>
<p>Cmod rel
marque morphologique et g&#233;n&#233;rale-
ment adjacence Cmod
</p>
<p>ambigu&#239;t&#233; de rattachement (p. ex. sp/V
vs. sp/n)
</p>
<p>Detmod lin&#233;arit&#233;, adjacence Arg-mod doit tenir compte de la forme verbale etde la s&#233;mantique du mod
Ncsubj ordre, marque morpho (accord) Csubj
</p>
<p>rep&#233;rage de la proposition, complexit&#233;
potentielle, identification du verbe t&#234;te
de la prop sujet, de la t&#234;te de la phrase.
</p>
<p>Xcomp marques morphologiques et ordre (eg
attribut, infinitif ant&#233;pos&#233;, etc.) Ccomp
</p>
<p>rep&#233;rage de la subordonn&#233;e, identifica-
tion des t&#234;tes verbales
</p>
<p>Dobj
forme du compl&#233;ment (nonclausal), or-
dre (premier) et adjacence avec le verbe
Iobj mais ambigu&#239;t&#233; rattachement
</p>
<p>Conj
difficult&#233; de distinguer les conjonctions
simples (coordonn&#233;s de m&#234;me type)
des autres
</p>
<p>Aux marque morphologique, adjacence Contr&#244;le
Cette relation n&#8217;est pas exprim&#233;e di-
rectement mais par doublement de la
relation subj. D&#233;pend du type du verbe
et du type du compl&#233;ment
</p>
<p>Cette observation rapide permet de d&#233;gager quelques &#233;l&#233;ments de caract&#233;risation de la com-
plexit&#233; op&#233;rationnelle (et non pas th&#233;orique) de l&#8217;analyse syntaxique. D&#8217;une fa&#231;on g&#233;n&#233;rale en
effet, les relations les plus faciles &#224; analyser sont celles profitant d&#8217;une conjonction de plusieurs
sources d&#8217;information stables : faible taux d&#8217;ambigu&#239;t&#233; des constituants entrant en jeu dans la
relation (par exemple seule la relation Detmod peut relier un d&#233;terminant et un nom), marque
morphologique r&#233;guli&#232;re (pronom relatif, conjonctions, construction &#8220;c&#8217;est ... que&#8221;, etc.), or-
dre lin&#233;aire strict, etc. De plus, le niveau de la relation dans la hi&#233;rarchie influe &#233;galement sur
sa complexit&#233; : une relation g&#233;n&#233;rique sera plus facile &#224; rep&#233;rer qu&#8217;un de ses sous-type (par
exemple la relation Comp est plus facile &#224; indiquer que Ccomp).
A l&#8217;inverse, les relations complexes sont celles n&#233;cessitant d&#8217;acc&#233;der &#224; des informations lo-
cales sp&#233;cifiques (par exemple des traits lexicaux), d&#233;pendant de la forme des constituants non
lexicaux reli&#233;s (par exemple type du verbe ou de la pr&#233;position dans le SV ou le SP) ou en-
core reposant sur des ph&#233;nom&#232;nes s&#233;mantiques de restriction. Le niveau s&#233;mantique pr&#233;sente</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Combiner analyse superficielle et profonde
</p>
<p>d&#8217;ailleurs des caract&#233;ristiques similaires : il est par exemple plus facile de traiter le r&#244;le d&#8217;un
modifieur que la port&#233;e de la quantification.
</p>
<p>Il n&#8217;est donc pas possible de distinguer simplement, comme nous l&#8217;avons vu en premi&#232;re partie,
un analyseur superficiel d&#8217;un analyseur profond sur de simples crit&#232;res d&#8217;efficacit&#233;. Mais il ne
semble pas non plus pertinent de distinguer les deux approches sur la base du type d&#8217;information
construit en sortie. Le parenth&#233;sage d&#8217;un &#233;nonc&#233; est une t&#226;che globalement facile si on se con-
tente de constituants non r&#233;cursifs. Elle devient nettement plus difficile si l&#8217;on cherche &#224; d&#233;crire
le niveau propositionnel ou les dispositifs complexes. De m&#234;me, comme nous venons de le
voir, certaines relations syntaxiques peuvent &#234;tre plus faciles &#224; identifier que d&#8217;autres. Il est
donc int&#233;ressant d&#8217;introduire deux nouveaux crit&#232;res pour la distinction entre types d&#8217;analyse :
niveau op&#233;rationnel (un analyseur profond est non d&#233;terministe) et niveau formel (un analyseur
superficiel ne construit que des informations simples). Les crit&#232;res de d&#233;terminisme et de type
d&#8217;information peuvent bien entendu &#234;tre combin&#233;s. On pourra par exemple trouver des analy-
seurs d&#233;terministes pouvant construire des informations complexes. Il est possible dans ce cas
de parler d&#8217;analyseurs interm&#233;diaires.
</p>
<p>4 Une strat&#233;gie d&#8217;analyse hybride
</p>
<p>Ainsi que nous venons de le voir, l&#8217;analyse profonde a fr&#233;quemment recours &#224; des techniques
d&#8217;analyse superficielle, notamment gr&#226;ce &#224; une d&#233;sambigu&#239;sation de l&#8217;entr&#233;e. Par ailleurs, les
r&#233;sultats obtenus pour la construction d&#8217;une analyse superficielle par un analyseur superficiel et
un analyseur profond ne sont pas tr&#232;s diff&#233;rents, quelque soit la forme de l&#8217;input. La compara-
ison des r&#233;sultats obtenus par deux analyseurs sur un m&#234;me ensemble de corpus dans le cadre
de la campagne Easy (ces r&#233;sultats seront pr&#233;sent&#233;s lors du workshop Easy associ&#233; &#224; TALN)
montre en effet une forte convergence, aussi bien pour le traitement de corpus de langue &#233;crite
que de langue parl&#233;e.
</p>
<p>Nous avons donc un certain nombre d&#8217;arguments qui militent en faveur de syst&#232;mes mixtes per-
mettant de fournir comme r&#233;sultat, en fonction des besoins,aussi bien une analyse superficielle
qu&#8217;approfondie. Plus pr&#233;cis&#233;ment, nous proposons une architecture &#224; deux niveaux permettant
de r&#233;utiliser une analyse superficielle comme entr&#233;e d&#8217;un analyseur profond. Il ne s&#8217;agit pas de
modifier la structure superficielle construite (&#224; la diff&#233;rence de l&#8217;approche propos&#233;e par [John-
son02]), mais bien de construire une repr&#233;sentation plus riche utilisant les objets construits par
la superficielle pour construire des objets plus complexes. Il est pour cela n&#233;cessaire de d&#233;finir
les objets &#8220;superficiels&#8221; comme pouvant &#234;tre des constituants pour l&#8217;analyse d&#233;taill&#233;e. Un par-
enth&#233;sage classique sous forme de chunks ne serait pas pertinente dans cette approche, un chunk
ne pouvant &#234;tre une unit&#233; constitutive d&#8217;un groupe syntaxique de niveau sup&#233;rieur.
</p>
<p>L&#8217;objectif d&#8217;une telle approche est tout d&#8217;abord de combiner des outils diff&#233;rents, en ne d&#233;clen-
chant &#233;ventuellement une analyse d&#233;taill&#233;e qu&#8217;en fonction des besoins. Mais elle permet &#233;gale-
ment d&#8217;envisager l&#8217;analyse superficielle comme outil de contr&#244;le de l&#8217;analyse d&#233;taill&#233;e. Dans
ce cas, toutes les informations construites par l&#8217;analyseur superficiel sont susceptibles d&#8217;&#234;tre
utilis&#233;es par l&#8217;analyseur profond. Ces informations sont de deux types : il s&#8217;agit d&#8217;une part
de groupes de mots (donc des informations de parenth&#233;sage) et d&#8217;autre part des relations entre
des formes ou des groupes. Il convient donc de proposer la construction de groupes qui soient
&#224; la fois pertinents pour une analyse superficielle, mais &#233;galement utilisables par un analyseur
d&#233;taill&#233;. Ces groupes sont n&#233;cessairement de premier niveau (i.e. sans constituants embo&#238;t&#233;s),</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache
</p>
<p>ils ne contiennent que des &#233;l&#233;ments lexicaux. L&#8217;objectif est de d&#233;finir des groupements tr&#232;s
simples et peu ambigus. La grammaire suivante donne une id&#233;e du type de groupes pouvant
&#234;tre construits :
GV ::= [Adv[neg]] (Clit) [Aux] (Adv) V
GN ::= Det [Adv] [Adj] N[c] | [Det] N[p] | [Det] [Adj] N[p] | Pro[p]
GP ::= Prep Det [Adv] [Adj] N[c] | Prep N[p] | Prep V[ppres] | Prep V[inf]
GA ::= [Adv] Adj | [Adv] V[ppas]
Gadv ::= Adv&#8727;
</p>
<p>Bien entendu, cette grammaire est largement incompl&#232;te, et de nombreuses cat&#233;gories ne sont
pas prises en compte, ce qui ne perturbe pas le comportement d&#8217;un analyseur superficiel. De
m&#234;me, d&#8217;autres r&#232;gles compl&#233;tant la description de ce qu&#8217;on peut consid&#233;rer comme &#233;tant des
syntagmes noyaux peuvent &#234;tre ajout&#233;es. Enfin, une repr&#233;sentation sous forme syntagmatique
ne pr&#233;juge pas non plus du formalisme choisi. On peut par exemple d&#233;crire cette m&#234;me infor-
mation sous forme de d&#233;pendances ou de contraintes. Signalons qu&#8217;une grammaire de ce type
a &#233;t&#233; utilis&#233;e lors de la campagne d&#8217;&#233;valuation Easy (cf. [Vilnat04]). De leur c&#244;t&#233;, les relations
pouvant &#234;tre &#233;tablies par un analyseur superficiel sont relativement g&#233;n&#233;rales et d&#233;termin&#233;es
sur la base d&#8217;informations simples, en particulier l&#8217;ordre lin&#233;aire. Le tableau suivant propose
quelques relations avec leur s&#233;mantique op&#233;rationnelle. Chaque relation est caract&#233;ris&#233;e par des
propri&#233;t&#233;s qu&#8217;il est possible d&#8217;extraire de la liste des groupes pr&#233;c&#233;demment construite. Nous
utiliserons dans ce qui suit les notations suivantes : GX+ pour indiquer que le groupe GX fait
d&#233;j&#224; partie d&#8217;une relation et X pour indiquer une suite quelconque d&#8217;objets.
</p>
<p>Sujet (GN &#8826; X &#8826; GV) &#8743; (6 &#8707; GN+ &#8712; X)
Aux (Aux &#8826; X &#8826; V[ppas]) &#8743; ( 6 &#8707; V &#8712; X)
Objet (GV &#8826; X &#8826; GN) &#8743; (6 &#8707; GN+ &#8712; X)
Conj (GX &#8826; X &#8826; Conj &#8826; GX) &#8743; (6 &#8707; GX &#8712; X)
</p>
<p>Les relations telles qu&#8217;elles sont d&#233;finies ne permettent de sp&#233;cifier qu&#8217;une partie des relations.
Par exemple, la relation sujet ne prend pas en compte les inversions, de m&#234;me que la relation
de coordination ne permet que les coordinations simples. Le probl&#232;me essentiel de ce type de
relation est la surg&#233;n&#233;ration. Il est cependant possible d&#8217;ajouter un niveau de contr&#244;le sp&#233;ci-
fique, notamment concernant le type de relation possible pour une cat&#233;gorie donn&#233;e ou encore
en ayant recours &#224; des informations lexicales. Une analyse interm&#233;diaire ou d&#233;taill&#233;e tirant
parti d&#8217;une analyse superficielle de ce type vise donc la construction de groupes syntaxiques
de niveau sup&#233;rieur ainsi que de relations complexes. Le principe consiste &#224; utiliser en entr&#233;e
les objets construits par l&#8217;analyseur superficiel. Les constituants des unit&#233;s syntaxiques d&#233;tail-
l&#233;es sont donc soit des groupes soit des cat&#233;gories lexicales. Dans les deux cas, l&#8217;analyseur
superficiel peut associer &#224; ces groupes et cat&#233;gories des indications en termes de probabilit&#233;s
permettant ainsi de contr&#244;ler le processus d&#8217;analyse profonde en r&#233;duisant l&#8217;espace de recherche
de l&#8217;analyseur. Il est possible de d&#233;finir les bases d&#8217;une analyse interm&#233;diaire. Les r&#232;gles de la
grammaire correspondante utilisent les groupes et les relations construits par l&#8217;analyseur super-
ficiel, ce qui permet de pr&#233;ciser ou d&#8217;exclure certains constituants en fonction de leur propri&#233;t&#233;s
syntaxiques. Ces relations sont indiqu&#233;es entre chevrons. Nous obtenons ainsi des r&#232;gles de la
forme :
</p>
<p>SN ::= GN [GA] [Rel] [GP] &lt; 6 &#8707; mod(GP,GV)&gt;
SV ::= GV [GN] [GP] &lt; 6 &#8707; mod(GN,GV)&gt;
Rel ::= Pro[rel] [GN1] GV [GN2] &lt; 6 &#8707; suj(GN2,GV)&gt;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Combiner analyse superficielle et profonde
</p>
<p>SX &#8592; pile_synt[en_cours]
si GC &#8712; SX
</p>
<p>ajouter(GC, SX)
finsi sinon
</p>
<p>r&#233;p&#233;ter
fermer(SX);
en_cours-;
</p>
<p>tant que ((GC 6&#8712; pile_synt[en_cours]) et (ouvert(pile_synt[en_cours]))
et (en_cours &#8805; 0))
</p>
<p>si en_cours 6= 0
ajouter(GC, pile_synt[en_cours])
</p>
<p>finsi
pile_synt[top++] &#8592; GC
</p>
<p>Figure 3: Algorithme interm&#233;diaire
</p>
<p>SN_cliv&#233;
FORM
</p>
<p>[
SEM
[
</p>
<p>FOCUS GN1 .SEM
]]
</p>
<p>PROPS
</p>
<p>&#63729;&#63732;&#63732;&#63730;&#63732;&#63732;&#63731;
Const =
</p>
<p>{
Pro[ce], GV[&#234;tre], ProR[qu-), GN1
</p>
<p>}
Pro &#8826; GV, GV &#8826; GN1, GN1 &#8826; ProR
Pro &#8658; GV
Uniq =
</p>
<p>{
GN1
</p>
<p>}
&#63740;&#63732;&#63732;&#63741;&#63732;&#63732;&#63742;
</p>
<p>SV_SNcliv&#233;
</p>
<p>FORM
</p>
<p>&#63726;&#63728;SYNT[ARG_S[COMP1 SN_cliv&#233;1 .GN.SYNT]
SEM
[
</p>
<p>PRED_S
[
</p>
<p>REC SN_cliv&#233;1 .GN.SEM
]]]&#63737;&#63739;
</p>
<p>PROPS
</p>
<p>{
Const =
</p>
<p>{
SN_cliv&#233;1
</p>
<p>}
GV 6&#8658; GN
</p>
<p>}
Figure 4: Description du SN cliv&#233; en GP
</p>
<p>Un algorithme simple (cf. figure 3) consiste pour chaque groupe &#224; v&#233;rifier s&#8217;il peut appartenir
&#224; un syntagme. On utilise pour cela une pile des syntagmes (not&#233;e pile_synt) construits et
deux pointeurs : l&#8217;un pointant sur le sommet de la pile (not&#233; top), l&#8217;autre sur le syntagme
en cours (not&#233; en_cours). On indique par GC le groupe courant, on se dote d&#8217;une fonc-
tion ajouter_constituant(Const, SX) permettant d&#8217;ajouter const la liste des constituants de SX
ainsi que d&#8217;une fonction fermer(SX) cl&#244;turant la liste de constituants de SX et d&#8217;une fonction
bool&#233;enne ouvert(SX) indiquant si SX est ouvert ou ferm&#233;.
Il est donc possible d&#8217;obtenir &#224; faible co&#251;t un analyseur interm&#233;diaire construisant des objets
dont les constituants sont des groupes fournis par l&#8217;analyse superficielle. La figure (4) pr&#233;sente
l&#8217;exemple d&#8217;une description du clivage du SN dans le formalisme des grammaires de propri&#233;t&#233;s
(cf. [Blache05]). Cette analyse s&#8217;appuie sur deux constructions : la premi&#232;re d&#233;crivant le site de
l&#8217;extraction, et la seconde les relations avec le site duquel l&#8217;&#233;l&#233;ment a &#233;t&#233; extrait. On y constate,
de la m&#234;me fa&#231;on que pour l&#8217;analyseur interm&#233;diaire, l&#8217;utilisation des groupes et des relations en
tant que source d&#8217;information &#233;l&#233;mentaire, tout en la compl&#233;tant avec des informations propres
au formalisme choisi.
</p>
<p>5 Conclusion
</p>
<p>L&#8217;analyse syntaxique est un probl&#232;me dont les facteurs de complexit&#233; doivent &#234;tre pr&#233;cis&#233;s. Il
est pour cela n&#233;cessaire de distinguer pr&#233;cis&#233;ment les diff&#233;rents types d&#8217;analyse (superficielle ou
profonde) avant de proposer une caract&#233;risation des ph&#233;nom&#232;nes influant sur cette complexit&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Philippe Blache
</p>
<p>Nous proposons dans cet article une premi&#232;re approche de ce probl&#232;me qui permet d&#8217;envisager
une coop&#233;ration entre ces diff&#233;rentes approches. La technique propos&#233;e permet &#224; l&#8217;analyse
d&#233;taill&#233;e de s&#8217;appuyer sur les r&#233;sultats de la superficielle, ce qui permet de r&#233;duire l&#8217;espace
de recherche en fournissant en entr&#233;e non plus des objets atomiques, mais des informations
complexes.
</p>
<p>R&#233;f&#233;rences
Abeill&#233; A. &amp; P. Blache. (2000). &#8220;Grammaires et analyseurs syntaxiques&#8221;, Trait&#233; IC2, Volume Ing&#233;nierie
des langues, Herm&#232;s.
</p>
<p>Blache P. &amp; M. Delpui (1995) &#8220;Outil d&#8217;int&#233;gration de bases de connaissances lexicales aux analyseurs
syntaxiques&#8221;, in actes des Journ&#233;es &#8220;Lexicomatique et Dictionnairique&#8221;.
</p>
<p>Blache P., J.-M. Balfourier &amp; T. van Rullen (2002), &#8220;From Shallow to Deep Parsing Using Constraint
Satisfaction&#8221;, in proceedings of COLING-2002
</p>
<p>Blache P. (2005) &#8220;Property Grammars: A Fully Constraint-Based Theory&#8221;, in Constraint Satisfaction
and Language Processing, H. Christiansen &amp; al. (eds), Springer-Verlag LNAI 3438.
Briscoe, E., J. Carroll, J. Graham &amp; A. Copestake (2002) &#8220;Relational evaluation schemes&#8221;, in proceed-
ings of the Beyond PARSEVAL Workshop, LREC-02.
</p>
<p>Carroll J. &amp; T. Briscoe (2001) &#8220;High Precision Extraction of Grammatical Relations&#8221;, in proceedings of
IWPT-01.
</p>
<p>Carroll J., G. Minnen &amp; T. Briscoe (2003) &#8220;Parser Evaluation. Using a Grammatical Relation Annotation
Scheme&#8221;, in A. Abeill&#233; (ed) Treebanks: Building and Using Syntactically Annotated Corpora, Kluwer.
Crysmann B. A. Frank, B. Kiefer, S. M&#252;ller, G. Neumann, J. Piskorski, U. Sch&#228;fer, M. Siegel, H. Uszkor-
eit, F. Xu, M. Becker &amp; H. Krieger (2002) &#8220;An Integrated Architecture for Shallow and Deep Processing&#8221;,
in proceedings of ACL-02.
</p>
<p>Frank A., M. Becker, B. Crysmann, B. Kiefer &amp; U. Sch&#228;fer (2003) &#8220;Integrated Shallow and Deep Parsing:
TopP meets HPSG&#8221;, in proceedings of ACL-03.
</p>
<p>Grover C. &amp; A. Lascarides (2001) &#8220;XML-Based Data Prepartion for Robust Deep Parsing&#8221;, in proceed-
ings of ACL/EACL-01.
</p>
<p>Hinrichs E. &amp; K. Simov eds.(2004) Proceedings of the Workshop &#8220;Combining Shallow and Deep
Processing for NLP&#8221;, ESSLLI-04.
Johnson M. (2002) &#8220;A Simple Pattern-Matching Algorithm for Recovering Empty Nodes and their An-
tecedents&#8221;, in proceedings of ACL-02.
</p>
<p>Marimon M. (2002) &#8220;Integrating Shallow Linguistic Processing into a Unification-Based Spanish Gram-
mar&#8221;, in proceedings of COLING-02.
</p>
<p>Neumann G., C. Braun &amp; J. Piskorski (1999) &#8220;A Divide and Conquer Strategy for Shallow Parsing of
German Free Texts&#8221;, in proceedings of ANLP-00.
</p>
<p>Puver M. &amp; R. Kempson (2004) &#8220;Incremental Parsing or Incremental Grammar? &#8221;, in proceedings of the
workshop Incremental Parsing: Bringing Engineering and Cognition Together, ACL-04.
</p>
<p>Uszkoreit H. (2002) &#8220;New Chances for Deep Linguistic Processing&#8221;, in proceedings of COLING-02.
Vilnat A., L. Monceaux, P. Paroubek, I. Robba, V. Gendner, G. Illouz &amp; M. Jardino (2004) &#8220;Annoter en
constituants pour &#233;vlauer des analyseurs syntaxiques&#8221;, in actes de TALN-04.</p>

</div></div>
</body></html>