<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Application du m&#233;talangage de la BD&#233;f au traitement formel de la polys&#233;mie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Application du m&#233;talangage d&#233;finitionnel de la BD&#233;f
au traitement formel de la polys&#233;mie
</p>
<p>Lucie Barque (1), Alain Polgu&#232;re (2)
(1) Lattice - Universit&#233; Paris 7
</p>
<p>UFRL, Case 7003
75251 Paris cedex 5, France
lbarque@linguist.jussieu.fr
</p>
<p>(2) OLST - Universit&#233; de Montr&#233;al
C.P.6128, succ. Centre-ville
</p>
<p>Montr&#233;al (Qc), H3C 3J7, Canada
alain.polguere@umontreal.ca
</p>
<p>Mots-clefs : Base de donn&#233;es lexicale, m&#233;talangage d&#233;finitionnel, Lexicologie Explica-
tive et Combinatoire, polys&#233;mie
</p>
<p>Keywords: lexical database, definitionnal metalanguage, Explanatory Combinatorial
Lexicology, polysemy
</p>
<p>R&#233;sum&#233; Cet article a pour objet le m&#233;talangage d&#233;finitionnel de la base de donn&#233;es lexi-
cale BD&#233;f, plus pr&#233;cis&#233;ment l&#8217;utilisation de ce m&#233;talangage dans la mod&#233;lisation des structures
polys&#233;miques du fran&#231;ais. La Bd&#233;f encode sous forme de d&#233;finitions lexicographiques les sens
lexicaux d&#8217;un sous-ensemble repr&#233;sentatif du lexique du fran&#231;ais parmi lequel on compte envi-
ron 500 unit&#233;s polys&#233;miques appartenant aux principales parties du discours. L&#8217;article comprend
deux sections. La premi&#232;re pr&#233;sente le m&#233;talangage de la BD&#233;f et le situe par rapport aux dif-
f&#233;rents types de d&#233;finitions lexicales, qu&#8217;elles soient ou non formelles, qu&#8217;elles visent ou non
l&#8217;informatisation. La seconde section pr&#233;sente une application de la BD&#233;f qui vise &#224; terme &#224;
rendre compte de la polys&#233;mie r&#233;guli&#232;re du fran&#231;ais. On y pr&#233;sente, &#224; partir d&#8217;un cas sp&#233;cifique,
la notion de patron de polys&#233;mie.
</p>
<p>Abstract We present the defining metalanguage of the BD&#233;f lexical database ; more spe-
cifically, we focus on how this metalanguage can be used to model relations of polysemy in
French. The BD&#233;f contains lexical definitions for a representative subset of the French lexicon :
around 500 polysemic words belonging to all major parts of speech. This paper contains two
sections. Firstly, the BD&#233;f metalanguage is introduced and positioned relative to different types
of existing lexical definitions : formal vs. non formal definitions, definitions that are tailored
or not for implementation. Secondly, the paper shows how the BD&#233;f approach is used in a re-
search whose goal is the modeling of the regular polysemy of the French language. The notion
of pattern of polysemy is introduced using a specific example.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L.Barque, A.Polgu&#232;re
</p>
<p>1 Place de la d&#233;finition BD&#233;f dans une typologie de la d&#233;fini-
tion en lexicographie et en s&#233;mantique formelle
</p>
<p>La BD&#233;f, base de donn&#233;es lexicale d&#233;velopp&#233;e &#224; l&#8217;Observatoire de Linguistique Sens-Texte de
l&#8217;Universit&#233; de Montr&#233;al (Altman et Polgu&#232;re, 2003), encode les d&#233;finitions du Dictionnaire
Explicatif et Combinatoire (Mel&#8217;c&#780;uk et al. 1984, 1988, 1992, 1999) dans un formalisme qui
explicite leur structure interne.
</p>
<p>Nous classons les diff&#233;rents types de d&#233;finitions lexicales connus en deux grandes familles,
caract&#233;ris&#233;es non sur la base de leurs fondements th&#233;oriques, mais sur celle des formalismes
adopt&#233;s : d&#8217;un c&#244;t&#233; les approches qui ont recours &#224; la paraphrase pour expliciter le sens d&#8217;une
unit&#233; lexicale, de l&#8217;autre celles qui repr&#233;sentent le sens lexical au moyen de structures de traits.
</p>
<p>1. Les formes de la paraphrase La paraphrase d&#233;finitionnelle est une d&#233;composition s&#233;-
mantique d&#8217;une unit&#233; lexicale organis&#233;e de fa&#231;on lin&#233;aire. Le caract&#232;re lin&#233;aire de ce type
de repr&#233;sentation lexicale est le point commun des trois formes de paraphrases pr&#233;sent&#233;es
ci-dessous. Elles divergent par leur degr&#233; de formalisation.
</p>
<p>(a) Les d&#233;finitions lexicographiques standard utilisent un m&#233;talangage proche de la
langue objet qu&#8217;il d&#233;crit. Cela leur conf&#232;re un caract&#232;re naturel qui r&#233;pond bien &#224;
l&#8217;exigence de substituabilit&#233; de la paraphrase.
</p>
<p>(b) Les d&#233;finitions analytiques suivent les m&#234;mes principes d&#233;finitoires (Aristote, ed.
2004) que les dictionnaires de langue courants mais sont construites de mani&#232;re &#224;
pouvoir identifier clairement les diff&#233;rents &#233;l&#233;ments de la d&#233;composition (Wierzbi-
cka, 1987), (Mel&#8217;c&#780;uk et al., 1995).
</p>
<p>(c) Les d&#233;finitions logiques comme celles de (Dowty, 1979) sont tr&#232;s diff&#233;rentes des
deux autres types de paraphrases du point de vue de la th&#233;orie s&#233;mantique sous-
jacentes. Les formules logiques se pr&#233;sentent cependant elles aussi sous une forme
lin&#233;aire qui permet une appr&#233;hension relativement naturelle du sens lexical.
</p>
<p>2. Les structures de traits Comme les paraphrases d&#233;finitionnelles, les structures de traits
repr&#233;sentent une d&#233;composition du sens lexical. Ici, la d&#233;composition n&#8217;est pas organis&#233;e
de fa&#231;on lin&#233;aire mais prend la forme d&#8217;un ensemble de traits. Les th&#233;ories de s&#233;mantique
computationnelle adoptent en g&#233;n&#233;ral ce mode de repr&#233;sentation de la d&#233;composition
lexicale (Pottier 1974), (Rastier 1987), (Pustejovsky, 1995).
</p>
<p>Le formalisme d&#8217;encodage des d&#233;finitions lexicales de la BD&#233;f emprunte ses caract&#233;ristiques &#224;
l&#8217;une et l&#8217;autre des deux grandes familles qui viennent d&#8217;&#234;tre distingu&#233;es. D&#8217;une part la BD&#233;f,
parce qu&#8217;elle se veut un outil servant &#224; r&#233;fl&#233;chir sur la nature du sens lexical, s&#8217;attache &#224; mettre
en &#233;vidence les diff&#233;rentes composantes de sens qui forment la d&#233;finition ainsi que la fa&#231;on dont
ces composantes s&#8217;organisent. Le formalisme adopt&#233; permet de r&#233;tablir facilement la forme
lin&#233;aire de mani&#232;re &#224; aider le lexicographe lors de la construction des d&#233;finitions. D&#8217;autre part,
la BD&#233;f doit constituer une ressource au service de la communaut&#233; du TAL et utilise de ce fait
un formalisme tr&#232;s proche de celui des r&#233;seaux s&#233;mantiques. Une d&#233;finition Bd&#233;f peut ainsi &#234;tre
exploit&#233;e dans des calculs, comme nous le verrons dans la seconde section de cet article.
</p>
<p>Une pr&#233;sentation d&#233;taill&#233;e des principes sous-jacents &#224; la base de donn&#233;es BD&#233;f et du forma-
lisme d&#8217;encodage des d&#233;finitions adopt&#233; figure dans (Altman et Polgu&#232;re, 2003). Nous en pr&#233;-
sentons ici les grandes lignes. La figure 1 ci-dessous reproduit la fiche BD&#233;f mod&#233;lisant le sens
de la lexie MAISONI.1 [Elle cherche la maison o&#249; habite son cousin]. Cet exemple va nous servir</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Application du m&#233;talangage de la BD&#233;f au traitement formel de la polys&#233;mie
</p>
<p>&#224; illustrer les diff&#233;rentes notions d&#233;crivant la structure des d&#233;finitions : les propositions &#233;l&#233;men-
taires sont organis&#233;es en blocs d&#233;finitionnels &#233;l&#233;mentaires, eux-m&#234;mes regroup&#233;s en blocs de
second niveau, la composante centrale et les diff&#233;rences sp&#233;cifiques.
</p>
<p>MAISON I.1
Composante centrale :
1 : habitation de X
</p>
<p>diff&#233;rences sp&#233;cifiques :
/*Dimensions*/
</p>
<p>2 : *1 grand.relativement
</p>
<p>/*Structure*/
3 : *1 constitu&#233; de niveau
</p>
<p>/*Mat&#233;riau*/
4 : *1 fabriqu&#233; avec mat&#233;riau.r&#233;sistant
</p>
<p>Typage des actants :
X : individu
</p>
<p>FIG. 1 &#8211; La d&#233;finition BD&#233;f de MAISON I.1
</p>
<p>La proposition &#233;l&#233;mentaire C&#8217;est la composante s&#233;mantique minimale de la d&#233;finition. Cha-
que proposition &#233;l&#233;mentaire est constitu&#233;e d&#8217;un pr&#233;dicat accompagn&#233; des positions actancielles
qu&#8217;il requiert et est identifi&#233;e par un num&#233;ro. Une position actancielle peut ainsi &#234;tre occup&#233;e
par un pointeur (*1, *2, . . .) vers une autre proposition. Par exemple la proposition n&#730;2 de la
d&#233;finition pr&#233;sent&#233;e dans la figure 1 est constitu&#233;e du pr&#233;dicat grand qui a comme argument
la proposition n&#730;1.
</p>
<p>Le bloc d&#233;finitionnel &#233;l&#233;mentaire Les propositions &#233;l&#233;mentaires sont regroup&#233;es en blocs
d&#233;finitionnels qui repr&#233;sentent des composantes &#171; autonomes &#187; de la d&#233;finition. Chaque bloc
est introduit par un en-t&#234;te synth&#233;tisant l&#8217;information qui y est contenue. Dans la d&#233;finition de
MAISON I.1, la proposition n&#730;2 sp&#233;cifie les dimensions d&#8217;une maison.
</p>
<p>La composante centrale et les diff&#233;rences sp&#233;cifiques Les blocs d&#233;finitionnels &#233;l&#233;mentaires
sont organis&#233;s au niveau sup&#233;rieur en deux grands blocs : la composante centrale, qui corres-
pond au sens g&#233;n&#233;ral de la lexie d&#233;crite &#8211; ce que la tradition appelle le genre prochain &#8211; et les
diff&#233;rences sp&#233;cifiques.
</p>
<p>2 Mod&#233;lisation des liens de polys&#233;mie
</p>
<p>Le d&#233;veloppement de la BD&#233;f et de son m&#233;talangage a donn&#233; lieu &#224; un projet de mod&#233;lisation
des structures polys&#233;miques du fran&#231;ais, que nous pr&#233;sentons dans cette section.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L.Barque, A.Polgu&#232;re
</p>
<p>2.1 D&#233;finitions
</p>
<p>Un vocable polys&#233;mique est constitu&#233; d&#8217;un ensemble de lexies partageant les m&#234;mes formes et
qui ont en commun une composante s&#233;mantique non triviale1. Cette derni&#232;re propri&#233;t&#233; permet
de distinguer deux lexies en relation de polys&#233;mie de deux lexies en relation d&#8217;homonymie
(Mel&#8217;c&#780;uk et al., 1995), (Victorri et Fuchs, 1996), (Kleiber, 1999).
Un lien de polys&#233;mie se d&#233;finit comme un lien s&#233;mantique entre deux lexies d&#8217;un vocable poly-
s&#233;mique. Nous nous int&#233;resserons ici &#224; un type particulier de lien de polys&#233;mie, celui qui r&#233;sulte
d&#8217;un processus de d&#233;rivation s&#233;mantique. On dira qu&#8217;une lexie L2 est d&#233;riv&#233;e s&#233;mantiquement
d&#8217;une lexie L1 si le sens de L2 est &#171; construit &#224; partir du &#187; sens de L1. On appelera dans ce cas
de figure L1 la lexie source et L2 la lexie d&#233;riv&#233;e.
Un patron de polys&#233;mie mod&#233;lise un lien de polys&#233;mie au moyen d&#8217;une paire de structures
d&#233;finitionnelles sous sp&#233;cifi&#233;es. Le nom du patron doit rendre compte d&#8217;une part du change-
ment (ou non) de l&#8217;&#233;tiquette s&#233;mantique (Polgu&#232;re, 2003) et d&#8217;autre part de la transformation &#224;
laquelle on a affaire (par exemple, quel type de m&#233;tonymie, quel type de m&#233;taphore, etc). Un
patron de polys&#233;mie doit &#234;tre suffisamment g&#233;n&#233;ral pour pouvoir s&#8217;appliquer &#224; au moins deux
couples de lexies.
</p>
<p>2.2 Un exemple de mod&#233;lisation : le cas du vocable MAISON
</p>
<p>Notre choix s&#8217;est port&#233; ici sur deux lexies du vocable MAISON :MAISONI.1 [Elle cherche la
maison o&#249; habite son cousin.] et MAISONI.2 [Elle a quitt&#233; la maison &#224; l&#8217;&#226;ge de 18 ans.]2. Les
d&#233;finitions des lexies sont pr&#233;sent&#233;es ci-dessous sous forme lin&#233;aire3 :
MAISONI.1 de X &#0; &#8216; /*habitation*/ habitation de l&#8217;individu X, /*Dimensions*/ relativement
</p>
<p>grande, /*Structure*/ constitu&#233;e d&#8217;un ou plusieurs &#233;tages et /*Mat&#233;riau*/ fabriqu&#233;e avec
des mat&#233;riaux solides &#8217;
</p>
<p>MAISONI.2 de X &#0; &#8216; /*lieu occup&#233;*/ lieu occup&#233; par un individu ou un groupe d&#8217;individus X
/*Limites*/ situ&#233; &#224; l&#8217;int&#233;rieur de l&#8217;habitation de X &#8217;
</p>
<p>Notons que la lexie d&#233;riv&#233;e est beaucoup plus contrainte dans son fonctionnement dans la phrase
que la lexie source puisqu&#8217;elle ne s&#8217;emploie qu&#8217;au d&#233;fini singulier et n&#8217;accepte pas le d&#233;termi-
nant possessif : dans la phrase Elle a quitt&#233;e sa maison &#224; l&#8217;&#226;ge de 18 ans, il s&#8217;agit n&#233;cessairement
de MAISONI.1 et non de MAISONI.2.
</p>
<p>La figure 2 ci-dessous repr&#233;sente le patron de polys&#233;mie Synecdoque faible : (partie d&#8217;une)
construction &#1; lieu occup&#233; s&#8217;appliquant au couple MAISONI.1 &#2; MAISONI.2. Le lien entre les deux
lexies est une synecdoque dans la mesure o&#249; le sens de la lexie d&#233;riv&#233;e d&#233;signe une partie de
ce que d&#233;note la lexie source : comme on le voit dans le patron de la figure 2, le pr&#233;dicat de
synecdoque &#234;tre_int&#233;rieur_de lie le sens g&#233;n&#233;ral de la lexie d&#233;riv&#233;e &#224; celui de la lexie
source4. Le fait que le second argument du pr&#233;dicat &#234;tre_int&#233;rieur_de, dans la d&#233;finition
</p>
<p>1Concernant l&#8217;identification de la polys&#233;mie, nous adoptons les crit&#232;res descriptifs et m&#233;thodologiques de la
lexicologie explicative et combinatoire, explicit&#233;s dans (Mel&#8217;c&#780;uk et al., 1995).
</p>
<p>2Ces deux lexies ont des correspondants en anglais qui n&#8217;appartiennent pas au m&#234;me vocable, respectivement
HOUSE et HOME.
</p>
<p>3Nous avons introduit (en italique) dans les d&#233;fintitions lin&#233;aires les en-t&#234;tes de blocs des d&#233;fintions BD&#233;f
correspondantes afin de faciliter par la suite la lecture du patron de polys&#233;mie auquel s&#8217;applique ce couple de
lexies.
</p>
<p>4le sens g&#233;n&#233;ral d&#8217;un lexie est repr&#233;sent&#233; dans le patron par l&#8217;&#233;tiquette du bloc de la composante centrale de
sa d&#233;finition, ou une &#233;tiquette m&#232;re de celle-ci. Par exemple, l&#8217;&#233;tiquette construction est l&#8217;&#233;tiquette m&#232;re de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Application du m&#233;talangage de la BD&#233;f au traitement formel de la polys&#233;mie
</p>
<p>de MAISONI.2, soit habitation de X et non MAISONI.1 ( i.e une inclusion compl&#232;te) nous
am&#232;ne &#224; qualifier cette synecdoque de faible. Cette particularit&#233; est marqu&#233;e linguistiquement
par le fait que l&#8217;on peut dire elle a quitt&#233;e la maison &#224; l&#8217;&#226;ge de 18 ans, que cette personne ait
habit&#233; dans une maison, dans un appartement ou dans une tout autre habitation. &#192; l&#8217;inverse,
on dira que les lexies ASSIETTEI.1 [Il a cass&#233; trois assiettes.] et ASSIETTEI.2 [Il a mang&#233; trois
assiettes de riz.] sont li&#233;es par une synecdoque forte car on ne peut pas dire Il a mang&#233; trois
assiettes de riz si le riz n&#8217;est pas contenu dans une assiette (ASSIETTEI.1). Comme il a &#233;t&#233; si-
gnal&#233; plus haut, un patron de polys&#233;mie doit rendre compte du type de lien de polys&#233;mie (dans
notre cas, il s&#8217;agit d&#8217;une synecdoque faible) mais &#233;galement de l&#8217;&#233;ventuel changement du type
s&#233;mantique entre la lexie source et la lexie cible. Cette information figure dans le patron au
niveau de la valeur de l&#8217;attribut Composante centrale.
</p>
<p>LEXIE SOURCE
Composante centrale [1] (partie d&#8217;une) construction
Composante export&#233;e [1]
Adresse de la composante export&#233;e /*Construction*/
LEXIE D&#201;RIV&#201;E S&#201;MANTIQUEMENT
Composante centrale [2] lieu occup&#233;
Adresse de la composante import&#233;e /*Limites*/
Pr&#233;dicat de synecdoque &#234;tre_int&#233;rieur_de([2], [1])
</p>
<p>FIG. 2 &#8211; Patron de polys&#233;mie Synecdoque faible : (partie d&#8217;une) construction &#1; lieu occup&#233;
</p>
<p>Le patron de polys&#233;mie qui vient d&#8217;&#234;tre identifi&#233; mod&#233;lise une alternance r&#233;currente en fran-
&#231;ais, quoique plus marginale que celles de la famille des synecdoques fortes. Le patron Sy-
necdoque faible : (partie d&#8217;une) construction &#1; lieu occup&#233; peut par exemple s&#8217;appliquer &#233;gale-
ment au couple de lexies BUREAUI.2 [Les fen&#234;tres du bureau donnent sur la cour.] &#2; BUREAUI.3
[Quand on est au bureau, le temps passe lentement.] dans la mesure o&#249; l&#8217;on peut dire que Jean a
pass&#233; la journ&#233;e au bureau m&#234;me si Jean n&#8217;a pu mettre les pieds dans son bureau (BUREAUI.2),
retenu toute la journ&#233;e en salle de r&#233;union. Le degr&#233; de d&#233;composition des d&#233;finitions et l&#8217;orga-
nisation explicite de cette d&#233;composition nous permet ainsi distinguer de mani&#232;re fine des liens
de polys&#233;mie proches. Cela nous permet par exemple de pr&#233;ciser la distinction entre polys&#233;mie
syst&#233;matique et polys&#233;mie r&#233;guli&#232;re (Apresjan, 1974) : toute lexie &#233;tiquet&#233;e construction
ou partie de construction est susceptible de &#171; g&#233;n&#233;rer &#187; une lexie &#233;tiquet&#233;e lieu
occup&#233; (par exemple &#201;COLE, &#201;GLISE, APPARTEMENT, . . .) &#8211; en cela il s&#8217;agit d&#8217;une polys&#233;mie
syst&#233;matique &#8211; mais la d&#233;finition de la lexie d&#233;riv&#233;e sera diff&#233;rente selon que les deux lexies
seront reli&#233;es par un lien de synecdoque forte ou faible.
</p>
<p>3 Conclusion
</p>
<p>Le travail qui vient d&#8217;&#234;tre pr&#233;sent&#233; doit mener &#224; terme &#224; la constitution d&#8217;une typologie des
liens de polys&#233;mie du fran&#231;ais. La classification des diff&#233;rents types de structures polys&#233;miques
d&#8217;une langue a d&#233;j&#224; fait l&#8217;objet de plusieurs travaux, notamment sur le fran&#231;ais (Martin, 1972a,
1972b) et sur le russe (Apresjan, 1974), mais ces travaux ne reposaient pas sur une exploitation
syst&#233;matique de descriptions lexicales formelles du type de celles qui sont fournies par la BD&#233;f.
</p>
<p>habitation. L&#8217;op&#233;rateur optionnel partie de permet de rendre plus g&#233;n&#233;ral le patron. Pour une pr&#233;sentation
d&#233;taill&#233;e de la notion d&#8217;&#233;tiquette s&#233;mantique dans les lexiques Sens-texte, voir (Polgu&#232;re, 2003).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L.Barque, A.Polgu&#232;re
</p>
<p>Cette recherche pr&#233;sente l&#8217;int&#233;r&#234;t de contribuer &#224; la rationalisation de la base de donn&#233;es, le but
&#233;tant d&#8217;obtenir des d&#233;finitions suffisamment homog&#232;nes et structur&#233;es pour mettre en relation les
informations de la BD&#233;f avec celles du DiCo, qui est quant &#224; elle d&#233;j&#224; enti&#232;rement informatis&#233;e
(Steinlin et al., 2004). L&#8217;exploitation de la BD&#233;f vise par ailleurs &#224; produire un ensemble de
patrons de polys&#233;mie qui pourront par exemple servir de base &#224; l&#8217;&#233;laboration de r&#232;gles pour le
d&#233;veloppement de lexiques incr&#233;mentaux du type du Lexique G&#233;n&#233;ratif (Copestake et Briscoe,
1995), (Rappaport et Levin, 1998).
</p>
<p>R&#233;f&#233;rences
Altman J., Polgu&#232;re A. (2003), La BD&#233;f : base de d&#233;finitions d&#233;riv&#233;e du Dictionnaire explicatif et com-
binatoire, Proceedings of the First International Conference on Meaning-Text Theory, Paris, p. 43-54.
Apresjan J. (1974), Regular Polysemy, Linguistics, 142, p. 5-32.
Aristote (2004), Les Topiques, Librairie Philosophique J.Vrin, Paris.
Bouillon P., Busa F. (2001), Generativity in the Lexicon, Cambridge University Press, Cambridge.
Copestake A., Briscoe E. (1995), Semi-Productive Polysemy and Sense extension, Journal of Semantics,
12(1), p. 15-67 .
Dowty D. (1979), Word Meaning and Montague Grammar, Reidel, Dordrecht.
Kleiber G. (1999), Probl&#232;mes de s&#233;mantique : la polys&#233;mie en question, Presses Universitaires du Sep-
tentrion, Villeneuve d&#8217;Ascq.
Martin R. (1972), Esquisse d&#8217;une analyse formelle de la polys&#233;mie, Travaux de linguistique et de litt&#233;-
rature, 10, p. 125-136.
Martin R. (1972), La polys&#233;mie verbale, esquisse d&#8217;une typologie formelle, Travaux de linguistique et
de litt&#233;rature, 17, p. 261-256.
Mel&#8217;c&#780;uk I., Clas A., Polgu&#232;re A. (1995), Introduction &#224; la lexicologie explicative et combinatoire,
AUPELF-UREF/Duculot, Louvain-la-Neuve.
Mel&#8217;c&#780;uk I. et al. (1984, 1988, 1992, 1999), Dictionnaire explicatif et combinatoire du fran&#231;ais contem-
porain, vol I-IV, Les Presses de l&#8217;Universit&#233; de Montr&#233;al, Montr&#233;al.
Polgu&#232;re A. (2000), Towards a theoretically-motivated general public dictionnary of semantic derivations
and collocations for French, Proceedings of EURALEX&#8217;2000, Stuttgart, p. 512-527.
Polgu&#232;re A. (2003), &#201;tiquetage s&#233;mantique des lexies dans la base de donn&#233;es DiCo, TAL, 44, 2, p. ?.
Pottier B. (1974), Linguistique g&#233;n&#233;rale. Th&#233;orie et description, Klincksieck, Paris.
Pustejovsky J. (1995), The Generative Lexicon, MIT Press, Cambridge, Mass.
Rappaport Hovav M., Levin B. (1998), Building Verb Meanings, in M. Butt and W. Geuder (eds) The
projection of arguments : Lexical and Compositionnal Factors, CSLI Publications, Stanford, p. 97-134.
Rastier F. (1987), S&#233;mantique interpr&#233;tative, Presses Universitaires de France, Paris.
Steinlin J., Kahane S., Polgu&#232;re A., El Ghali A. (2004), De l&#8217;article lexicographique &#224; la mod&#233;lisation
objet du dictionnaire et des liens lexicaux, Proceedings of EURALEX&#8217;2004, Lorient, p. 177-186.
Victorri B., Fuchs C. (1996), La polys&#233;mie, construction dynamique du sens, Herm&#232;s, Paris.
Wierzbicka A. (1987), English Speech Act Verbs : A semantic dictionnary, Academic, Sydney.</p>

</div></div>
</body></html>