<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>ILIMP: Outil pour rep&#233;rer les occurences du pronom impersonnel il</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p> ILIMP : Outil pour rep&#233;rer les occurrences                                               
du pronom impersonnel il 
</p>
<p>Laurence Danlos 
</p>
<p>LATTICE, Universit&#233; Paris 7, Institut Universitaire de France 
Laurence.Danlos@linguist.jussieu.fr 
</p>
<p>Mots-cl&#233;s :   Pronom impersonnel (expl&#233;tif), Pronom anaphorique, Lexique-grammaire, 
Automates, R&#233;solution d'anaphores, Analyse syntaxique modulaire 
Keywords:   Expletive pronouns, Anaphoric pronouns, Lexicon-Grammar, Automata, 
Anaphora resolution, Modular syntactic analysis 
 
</p>
<p> 
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons un outil, ILIMP, qui prend en entr&#233;e un texte brut (sans annotation 
linguistique) r&#233;dig&#233; en fran&#231;ais et qui fournit en sortie le texte d'entr&#233;e o&#249; chaque occurrence 
du pronom il est d&#233;cor&#233;e de la balise [ANAphorique] ou [IMPersonnel]. Cet outil a donc comme 
fonctionnalit&#233; de distinguer les occurrences anaphoriques du pronom il, pour lesquelles un 
syst&#232;me de r&#233;solution des anaphores doit chercher un ant&#233;c&#233;dent, des occurrences o&#249; il est un 
pronom impersonnel (expl&#233;tif) pour lequel la recherche d'ant&#233;c&#233;dent ne fait pas sens. ILIMP 
donne un taux de pr&#233;cision de 97,5%. Nous pr&#233;sentons une analyse d&#233;taill&#233;e des erreurs et 
nous d&#233;crivons bri&#232;vement d'autres applications potentielles de la m&#233;thode utilis&#233;e dans ILIMP, 
ainsi que l&#8217;utilisation et le positionnement d&#8217;ILIMP dans un syst&#232;me d&#8217;analyse syntaxique 
modulaire. 
 
</p>
<p>Abstract We present a tool, ILIMP, which takes as input a French raw text and which 
produces as output the input text in which every occurrence of the word il is tagged either 
with the tag [ANA] for anaphoric or [IMP] for expletive. This tool is therefore designed to 
distinguish the anaphoric occurrences of il, for which an anaphora resolution system has to 
look for an antecedent, from the expletive occurrences of this pronoun, for which it does not 
make sense to look for an antecedent. The precision rate for ILIMP is 97,5%. The few errors 
are analyzed in detail. Other tasks using the method for ILIMP are described briefly, as well as 
the use of ILIMP in a modular syntactic analysis system. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Danlos 
</p>
<p>1 Introduction 
En TAL, la r&#233;solution d'anaphores est un sujet de recherche fort &#233;tudi&#233; car c'est une question 
cruciale pour des applications comme la Recherche d'Informations ou le R&#233;sum&#233; 
Automatique. Parmi les anaphores, les pronoms sont largement trait&#233;s car fr&#233;quents et 
facilement identifiables. Parmi les pronoms, on peut  distinguer un &#233;l&#233;ment (il en fran&#231;ais, it 
en anglais) avec un emploi impersonnel (expl&#233;tif) (il pleut, it rains) qui se distingue de 
l'emploi anaphorique (il est cher, it is expensive). Un syst&#232;me de r&#233;solution des anaphores doit 
&#234;tre capable de rep&#233;rer les occurrences des pronoms impersonnels avant de s'attaquer aux 
pronoms anaphoriques et aux autres anaphores. De ce fait, il existe un certain nombre de 
travaux sur les emplois impersonnels du pronom anglais it, citons (Lapin, Leass, 1994), 
(Kennedy, Bogurev, 1996) et (Evans 2001). Mais &#224; notre connaissance, il n&#8217;existe pas de 
travaux similaires sur le pronom fran&#231;ais il. Ce travail pr&#233;sente un outil, ILIMP, qui est con&#231;u 
pour reconna&#238;tre toutes les occurrences du pronom impersonnel il dans les textes fran&#231;ais : 
ILIMP d&#233;core chaque occurrence de il de la balise [ANAphorique] ou [IMPersonnel]. Cet outil est 
&#224; base de r&#232;gles (comme c&#8217;est le cas du syst&#232;me de Lapin et Leass) ; il travaille sur des textes 
bruts sans annotation linguistique (contrairement au syst&#232;me de Lapin et Leass qui repose sur 
une analyse syntaxique). 
</p>
<p>Si ILIMP est un outil s'imposant en amont d'un syst&#232;me de r&#233;solution d'anaphores, c&#8217;est aussi 
un outil qui peut s&#8217;int&#233;grer dans la cha&#238;ne de traitements d&#8217;un analyseur syntaxique modulaire. 
En effet, d&#8217;une part, les balises [IMP] et [ANA] sur le pronom il peuvent &#234;tre vues comme un 
raffinement des &#233;tiquettes morpho-syntaxiques traditionnellement utilis&#233;es dans les taggeurs : 
l'&#233;tiquette &quot;pronom&quot; serait remplac&#233;e par deux &#233;tiquettes, &quot;pronom anaphorique&quot; et &quot;pronom 
impersonnel&quot;. Or on sait que plus le jeu d'&#233;tiquettes morpho-syntaxiques d&#8217;un taggeur est 
riche, plus un analyseur venant en aval de ce taggeur a des chances d'aboutir &#224; l&#8217;analyse 
syntaxique correcte (Nasr, 2004). D&#8217;autre part, nous verrons que des outils d&#233;riv&#233;s d&#8217;ILIMP 
peuvent &#234;tre utilis&#233;s pour d&#8217;autres annotations linguistiques. 
</p>
<p>La Section 2 pr&#233;sente notre m&#233;thode qui est bas&#233;e, pour l'aspect  linguistique, sur le lexique-
grammaire du LADL, et pour l'aspect informatique sur UNITEX. La Section 3 d&#233;crit la 
r&#233;alisation d'ILIMP, les difficult&#233;s que nous avons rencontr&#233;es et les choix effectu&#233;s pour les 
surmonter. Finalement, la Section 4 donne une &#233;valuation d'ILIMP et discute de son 
positionnement dans une analyse syntaxique modulaire. 
</p>
<p>2 M&#233;thode 
</p>
<p>2.1 Lexique-grammaire 
</p>
<p>Comme la plupart des ph&#233;nom&#232;nes linguistiques, les constructions impersonnelles reposent 
sur des conditions tant lexicales que syntaxiques. Par exemple, l'adjectif violet ne peut jamais 
&#234;tre la t&#234;te lexicale d'une phrase impersonnelle, (1a), l'adjectif probable ancre une phrase 
impersonnelle lorsqu'il est suivi d'un compl&#233;ment phrastique, (1b), l'adjectif difficile ancre une 
phrase impersonnelle (resp. personnelle) lorsqu'il est suivi d'une infinitive introduite par la 
pr&#233;position de (resp. &#224;), (1c) et (1d). 
</p>
<p>(1)a Il est violet  
    b Il est probable que Fred viendra  
    c Il est difficile de r&#233;soudre ce probl&#232;me  
    d Il est difficile &#224; r&#233;soudre (ce probl&#232;me) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ILLIMP 
</p>
<p>De ce fait, le lexique-grammaire du fran&#231;ais d&#233;velopp&#233; par Maurice Gross et son &#233;quipe 
(Gross1994, Lecl&#232;re 2003) est une ressource linguistique appropri&#233;e pour ILIMP puisqu'il 
d&#233;crit l'ensemble des t&#234;tes lexicales des phrases simples du fran&#231;ais avec leurs arguments 
syntaxiques et les alternances possibles. Nous avons donc extrait (manuellement) du lexique-
grammaire tous les items lexicaux qui peuvent ancrer une phrase impersonnelle en 
enregistrant leur compl&#233;mentation syntaxique. Pr&#233;sentons un bref aper&#231;u des constructions 
impersonnelles du fran&#231;ais que nous avons recens&#233;es. On peut distinguer les constructions  
intrins&#232;quement impersonnelles, qui ne peuvent avoir comme sujet que il, des constructions 
avec un &quot;sujet profond extrapos&#233;&quot;. Parmi les premi&#232;res, on trouve 45 verbes m&#233;t&#233;orologiques 
de la table 31i de (BGL, 1976a) (Il pleut, Il fait beau), 21 verbes de la table 17 de (Gross, 
1975) (Il faut du pain /que Fred vienne) et 38 expressions fig&#233;es de (Gross, 1993) (Il &#233;tait une 
fois, quoi qu'il en soit). Pour les constructions impersonnelles &#224; sujet profond extrapos&#233;, on 
peut distinguer celles &#224; sujet phrastique de celles &#224; sujet nominal. Parmi les premi&#232;res, on 
trouve 682 adjectifs dispers&#233;s dans les tables de (Picabia, 1978) et (Meunier, 1981) (Il est 
probable que Fred viendra), 88 expressions &quot;&#234;tre Pr&#233;p X&quot; des tables Z5P et Z5D de (Danlos 
1980) (Il est de r&#232;gle de porter un chapeau), 21 verbes de la table 5 de (Gross 1975) (Il pla&#238;t &#224; 
Vanne que Fred vienne), et enfin 140 verbes de la table 6 et 92 verbes de la table 9 de (Gross 
1975) construits au passif ou au se-moyen (Il a &#233;t&#233; dit/se raconte que Fred viendra). Les 
constructions impersonnelles &#224; sujet extrapos&#233; nominal ont pour t&#234;te lexicale des verbes qui 
sont dispers&#233;s dans les tables &#233;labor&#233;es par (BGL, 1976b). On peut distinguer d'un c&#244;t&#233; des 
verbes comme manquer ou rester dont l'emploi en construction impersonnelle est tout &#224; fait 
courant (Il manque /reste du pain), et de l'autre c&#244;t&#233; des verbes &quot;inacusatifs&quot; (Il est venu trois 
personnes) ou des verbes construits au passif (Il a &#233;t&#233; mang&#233; trois g&#226;teaux), dont l'emploi 
dans une construction impersonnelle rel&#232;ve d'un niveau de langue ch&#226;ti&#233;. 
</p>
<p>2.2 UNITEX 
UNITEX1 est un outil qui permet d'&#233;crire des patrons linguistiques (expressions r&#233;guli&#232;res ou 
automates) qui sont localis&#233;s dans le texte d'entr&#233;e, avec un &#233;ventuel ajout d'annotations 
lorsque les automates sont en fait des transducteurs. Un texte brut donn&#233; en entr&#233;e &#224; UNITEX 
est d'abord pr&#233;-trait&#233; : le texte est segment&#233; en phrases et les phrases segment&#233;es en tokens. 
Chaque token est &#233;tiquet&#233; avec toutes les parties du discours et traits flexionnels enregistr&#233;s 
dans le &quot;full-form&quot; dictionnaire DELAF (Courtois, 2004). Il n'y a pas de d&#233;sambigu&#239;sation, 
autrement dit le pr&#233;-traitement d'UNITEX n'est pas &#233;quivalent &#224; un &#233;tiquetage morpho-
syntaxique. 
Pour r&#233;aliser ILIMP, l'id&#233;e de base consiste &#224; rep&#233;rer les constructions impersonnelles gr&#226;ce &#224; 
leur t&#234;te lexicale et &#224; leur compl&#233;mentation. Il s'agit donc d'&#233;crire (manuellement) un 
ensemble de transducteurs comme celui pr&#233;sent&#233; en (2) sous une forme lin&#233;aire simplifi&#233;e. 
La balise [IMP] est l'ajout d'information amen&#233;e par l'aspect transducteur de (2). Les &#233;l&#233;ments 
entre chevrons de (2) se glosent de la fa&#231;on suivante : &lt;&#234;tre.V:3s&gt; correspond &#224; toutes les 
formes du verbe &#234;tre conjugu&#233; &#224; la troisi&#232;me personne du singulier, &lt;Adj1:ms&gt; correspond 
aux adjectifs masculins singuliers de la classe Adj1 qui regroupe des adjectifs se comportant 
comme difficile, &lt;V:W&gt; correspond aux verbes &#224; l'infinitif. 
(2) Il [IMP] &lt;&#234;tre.V:3s&gt; &lt;Adj1:ms&gt; de &lt;V:W&gt; 
                                                 
1 UNITEX est un logiciel sous licence GPL, dont l'anc&#234;tre est INTEX (Silberstein, 1994). La documentation et le 
</p>
<p>t&#233;l&#233;chargement de UNITEX se trouvent sur le site  http://ladl.univ-mlv.fr. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Danlos 
</p>
<p> 
La balise [IMP] - abr&#233;viation de impersonnelle- vient d&#233;corer les occurrences de il qui 
apparaissent dans les phrases correspondant au patron de (2). Cette balise vient donc d&#233;corer 
il dans (1c). La balise [ANA] - abr&#233;viation de anaphorique- est la balise par d&#233;faut : elle vient 
d&#233;corer les occurrences de il qui n'ont pas &#233;t&#233; balis&#233;es par [IMP]. Cette balise vient d&#233;corer il 
dans (1d). N&#233;anmoins, la situation est un peu plus complexe, car il existe une troisi&#232;me balise 
[AMB] - abr&#233;viation de ambigu- qui sera expliqu&#233;e dans la section 3.2. Apr&#232;s cet expos&#233; des 
principes th&#233;oriques sous-tendant ILIMP, passons &#224; sa r&#233;alisation pratique. 
</p>
<p>3 R&#233;alisation de ILIMP 
</p>
<p>3.1 Contexte gauche de la t&#234;te lexicale 
</p>
<p>Dans l&#8217;exemple (1c), le contexte gauche de la t&#234;te lexicale de la phrase - la s&#233;quence de 
tokens &#224; gauche de difficile - se r&#233;duit &#224; Il est. Mais on trouve fr&#233;quemment dans les corpus 
des phrases comme (3a) ou (3b) dans lesquelles le contexte gauche de la t&#234;te lexicale est 
plus complexe. Dans (3a), ce contexte gauche inclut (de droite &#224; gauche) l'adverbe tr&#232;s qui 
modifie l'adjectif, le verbe para&#238;tre, &#224; la forme infinitive, qui est &quot;un verbe support&quot; 
(Danlos, 1992) pour les adjectifs, le pronom lui et finalement le verbe modal peut pr&#233;c&#233;d&#233; 
par il. Dans (3b), le contexte gauche inclut le verbe support s'av&#233;rer qui est conjugu&#233; &#224; un 
temps compos&#233; (s'est av&#233;r&#233;) et ni&#233; (ne s'est pas av&#233;r&#233;). 
(3)a Il peut lui para&#238;tre tr&#232;s difficile de r&#233;soudre ce probl&#232;me  
    b Il ne s'est pas av&#233;r&#233; difficile de r&#233;soudre ce probl&#232;me  
 
De ce fait, pour chaque type de t&#234;te lexicale (e.g. adjectif, verbe) qui ancre une construction 
impersonnelle, on doit d&#233;terminer tous les &#233;l&#233;ments qui peuvent figurer dans son contexte 
gauche et int&#233;grer ces &#233;l&#233;ments dans les patrons linguistiques. Cette t&#226;che ne se heurte pas &#224; 
de r&#233;elles difficult&#233;s, disons que c'est un travail minutieux et co&#251;teux en temps2. Par contre, 
on se heurte &#224; de r&#233;elles ambigu&#239;t&#233;s avec le contexte droit de la t&#234;te lexicale, comme nous 
allons le montrer. Dans la suite de cet article, les contextes gauches des t&#234;tes lexicales sont 
pr&#233;sent&#233;s de fa&#231;on simplifi&#233;e - comme en (2) - pour faciliter la lecture. 
</p>
<p>3.2 Contexte droit de la t&#234;te lexicale 
</p>
<p>3.2.1 Ambigu&#239;t&#233;s syntaxiques 
</p>
<p>Les ambigu&#239;t&#233;s syntaxiques sont l&#233;gion dans le contexte droit car, comme il est bien connu, 
une s&#233;quence de parties du discours peut recevoir plusieurs analyses syntaxiques. A titre 
d'illustration, consid&#233;rons le patron en (4a), dans lequel le symbole &#937; correspond &#224; une 
s&#233;quence non-vide de tokens. Ce patron correspond &#224; deux analyses syntaxiques : (4b) dans 
lequel il est impersonnel et l'infinitive sous-cat&#233;goris&#233;e par difficile, et (4c) dans lequel il 
                                                 
2 Ce travail peut &#234;tre r&#233;utilis&#233; dans un outil qui rep&#232;re la t&#234;te lexicale d'une phrase simple, outil qui peut 
</p>
<p>s'int&#233;grer dans la cha&#238;ne de traitements d&#8217;un analyseur syntaxique modulaire. Ce travail revient &#224; mettre sous 
forme d'automates la notion d'&quot;amas verbal&quot; de (Gerdes, Kahane, 2004). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ILLIMP 
</p>
<p>est anaphorique et l'infinitive fait partie d'un GN. Ces deux analyses sont illustr&#233;es 
respectivement dans les phrases (4b) et (4e) - ces phrases diff&#232;rent seulement par l'adverbe 
ici/juste. 
(4)a Il est difficile pour &#937; &lt;de V:W&gt; 
    b Il [IMP] est difficile pour (&#937;)GN &lt;de V:W&gt; 
    c Il [ANA] est difficile pour (&#937; de &lt; V:W&gt;)GN 
    d Il est difficile pour (les &#233;tudiants qui viennent ici)GN de r&#233;soudre ce probl&#232;me 
    e Il est difficile pour (les &#233;tudiants qui viennent juste de r&#233;soudre ce probl&#232;me)GN 
 
Pour traiter ces ambigu&#239;t&#233;s syntaxiques, une solution consiste &#224; d&#233;clarer explicitement qu'un 
patron comme (4a) est ambigu, ce qui revient &#224; d&#233;corer l'occurrence de il dans (4a) par la 
balise [AMB] qui doit &#234;tre interpr&#233;t&#233;e de la fa&#231;on suivante : &quot;ILIMP ne peut pas d&#233;terminer si il 
est anaphorique ou impersonnel&quot;. Cependant cette &#233;tiquette n'est d'aucune utilit&#233; pour les 
traitements ult&#233;rieurs d'un syst&#232;me de r&#233;solution d'anaphores ou d'une cha&#238;ne de traitements 
syntaxiques : elle doit donc &#234;tre utilis&#233;e avec mod&#233;ration. Une autre solution consiste &#224; faire 
appel &#224; des heuristiques bas&#233;es sur des fr&#233;quences. Par exemple, l'heuristique suivante : les 
phrases qui suivent le patron de (4a) sont plus fr&#233;quemment analys&#233;es comme (4b) que 
comme (4c), par cons&#233;quent, il dans les phrases qui suivent (4a) peut recevoir la balise [IMP], 
m&#234;me si cette balise est fausse dans quelques cas. Nous avons adopt&#233; cette derni&#232;re 
solution. ILIMP repose donc sur tout un ensemble d'heuristiques que nous avons &#233;tablies soit &#224; 
partir de notre connaissance/intuition linguistique soit &#224; partir d'&#233;tudes quantitatives sur les 
corpus. L'&#233;valuation de ILIMP r&#233;v&#232;lera si nos heuristiques sont judicieuses (Section 4). 
</p>
<p>3.2.2 Ambigu&#239;t&#233;s lexicales 
</p>
<p>Dans un tr&#232;s petit nombre de cas (une dizaine), un item lexical peut ancrer une construction 
impersonnelle ou personnelle avec le m&#234;me cadre de sous-cat&#233;gorisation. C'est le cas pour 
l'adjectif certain construit avec un compl&#233;ment phrastique, comme illustr&#233; dans la phrase en 
(5a). Comme les deux lectures de (5a) semblent &#233;galement fr&#233;quentes, il dans le patron (5b) 
re&#231;oit la balise [AMB]. 
 (5) a Il est certain Fred que viendra (Jean/Cela est certain que Fred viendra) 
      b Il [AMB] est certain que P3 
</p>
<p>3.2.3 Autres difficult&#233;s  
</p>
<p>Le dernier type de difficult&#233;s s'observe avec des constructions impersonnelles &#224; sujet nominal 
extrapos&#233; qui ne diff&#232;rent en surface que de fa&#231;on tr&#232;s subtile par rapport &#224; des constructions 
personnelles. Voir la paire en (6) qui ne diff&#232;re que par du/de mais o&#249; (6a) est impersonnelle 
et (6b) personnelle. Voir aussi la paire en (6') qui ne diff&#232;re que par les noms valise/ priorit&#233; 
mais o&#249; (6'a) est impersonnelle et (6'b) personnelle. Nous avons tent&#233; d&#8217;&#233;tablir des 
heuristiques pour distinguer ces cas, sans toutefois nous lancer, par exemple, dans l&#8217;utilisation 
(p&#233;rilleuse) de traits s&#233;mantiques, comme &#177; concret. 
</p>
<p> (6)a Il manque du poivre (dans cette maison) 
</p>
<p>                                                 
3 P symbolise un patron destin&#233; &#224; repr&#233;senter une phrase. Il est compos&#233; d&#8217;une s&#233;quence non vide de tokens 
</p>
<p>incluant un verbe fini. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Danlos 
</p>
<p>     b Il manque de poivre, ce r&#244;ti 
(6')a Il reste la valise du chef (dans la voiture)  
     b Il reste la priorit&#233; du chef (le ch&#244;mage) 
 
Pour conclure cette section sur la r&#233;alisation de ILIMP, disons qu'il est fait fr&#233;quemment appel 
&#224; des heuristiques afin d'&#233;viter une utilisation abusive de l'&#233;tiquette [AMB]. Ces heuristiques 
peuvent mener &#224; des erreurs qui vont &#234;tre examin&#233;es dans la section suivante. 
</p>
<p>4  Evaluation de ILIMP 
Notre corpus de travail a &#233;t&#233; Le Monde. Plus pr&#233;cis&#233;ment, un corpus de 3.782.613 tokens 
extraits du corpus Le Monde 1994. UNITEX segmente ce corpus en 71.293 phrases. Il contient 
13.611 occurrences du token il sur 20.549 occurrences de pronoms personnels sujet de la 
troisi&#232;me personne (il, elle, ils, elles). Le pronom il est donc le pronom sujet de la troisi&#232;me 
personne le plus fr&#233;quent, avec un taux de 66 %. De ce corpus, 8544 phrases qui incluent au 
moins une occurrence de il ont &#233;t&#233; extraites et elles totalisent pr&#232;s de 10.000 occurrences de il 
(une phase complexe ench&#226;ssant diverses propositions peut inclure plusieurs occurrences de 
il). Ces phrases ont &#233;t&#233; donn&#233;es en entr&#233;e &#224; ILIMP et les r&#233;sultats - les balises [IMP], [ANA], et 
[AMB] - ont &#233;t&#233; &#233;valu&#233;s manuellement par des amis, coll&#232;gues et &#233;tudiants4. Ces &#233;valuateurs  
devaient se fier uniquement &#224; leur intuition de locuteur : ils ne devaient pas mettre en &#339;uvre 
leur &#233;ventuelle comp&#233;tence de linguiste pour essayer de d&#233;tecter des ambigu&#239;t&#233;s virtuelles 
d'occurrences de il. Dans ces conditions, l'attribution d'une balise [IMP] ou [ANA] est imm&#233;diate 
dans quasiment tous les cas, la balise [AMB] ne concernant qu'un nombre n&#233;gligeable de cas 
(rappelons, section 3.2.2, qu'elle n'est lexicalement justifi&#233;e que pour une dizaine de t&#234;tes 
lexicales). Il ressort de cette &#233;valuation un taux de pr&#233;cision de 97,5%. Nous allons examiner 
en d&#233;tail les erreurs, en laissant de c&#244;t&#233; la balise [AMB].  
</p>
<p>4.1 Erreurs provenant d'ambigu&#239;t&#233;s morphologiques 
</p>
<p>Les erreurs d'ILIMP provenant d'ambigu&#239;t&#233;s morphologiques sont (&#233;videmment) 
comptabilis&#233;es comme les autres erreurs provenant de la r&#233;alisation d'ILIMP. Ces derni&#232;res 
seront examin&#233;es dans les sections suivantes. Pour l'instant, examinons les erreurs dues au fait 
que le pr&#233;-processing d'UNITEX n'effectue pas de d&#233;sambigu&#239;sation : ce n'est pas un taggeur 
(Section 2.2). Consid&#233;rons le patron en (7a) : rappelons (note 3) que P repr&#233;sente une 
s&#233;quence non vide de tokens qui inclut un verbe fini ; &lt;V6:K&gt; couvre les verbes de la table 6 
au participe pass&#233;, e.g. choisi. Le patron en (7a) est destin&#233; &#224; couvrir les phrases 
impersonnelles comme (7b). N&#233;anmoins, il couvre aussi (7c), o&#249; le pronom il est donc balis&#233; 
&#224; tort [IMP]. Cette erreur est due au fait que le dictionnaire DELAF comprend &#224; juste titre deux 
entr&#233;es pour le mot m&#232;tres - forme finie du verbe m&#233;trer et pluriel du nom m&#232;tre - et 
qu'UNITEX ne fait aucune distinction entre ces deux entr&#233;es. La s&#233;quence l&#8217;acier ou le b&#233;ton 
pour soutenir une toiture de 170 m&#232;tres correspond donc au patron P (elle contient un verbe 
fini).  
</p>
<p>(7)a Il [IMP] &lt;avoir.V:3s&gt; &#233;t&#233;  &lt;V6:K&gt;  (ADV) que P 
                                                 
4 A savoir Isabelle Faugeras, Annie Meunier, Christian Lecl&#232;re, Laurence Delort, Ane Dybro-Johansen, 
</p>
<p>Fran&#231;ois Lareau, Alexis Nasr, C&#233;line Raynal, Jacques Steinlin, Fran&#231;ois Toussenel et M&#233;lodie Soufflard, que 
nous remercions chaleureusement. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ILLIMP 
</p>
<p>    b Il a &#233;t&#233; choisi que les s&#233;ances se feraient le matin vers 9h 
    c Il a &#233;t&#233; choisi plut&#244;t que l&#8217;acier ou le b&#233;ton pour soutenir une toiture de 170 m&#232;tres 
 
</p>
<p>Tout taggeur devrait attribuer au mot m&#232;tres de (7c) une &#233;tiquette nominale. Si ILIMP 
travaillait non pas sur du texte brut mais sur la sortie d'un taggeur, l'erreur de balisage de il 
dans (7c) serait donc &#233;vit&#233;e. Cette strat&#233;gie est envisageable5, mais ILIMP serait alors tributaire 
des erreurs d'un taggeur. D'une mani&#232;re plus g&#233;n&#233;rale, en admettant qu'un syst&#232;me d'analyse 
syntaxique repose sur une approche modulaire s&#233;quentielle o&#249; collabore &quot;en pipe-line&quot; tout un 
ensemble de modules - taggeur, reconnaisseur d'entit&#233;s nomm&#233;es, ILIMP, chunker, etc.- la 
question se pose de savoir dans quel ordre encha&#238;ner ces modules. Mais laissons cette 
question ouverte et revenons aux erreurs d'ILIMP travaillant sur un texte brut. 
</p>
<p>4.2 il balis&#233; &#224; tort [IMP] au lieu de [ANA] : 0,3% 
</p>
<p>Tr&#232;s peu d'erreurs : 33. Ce faible taux d'erreur est surprenant vu le recours fr&#233;quent &#224; des 
heuristiques &quot;brutales&quot;. A titre d'illustration, nous avons mis la balise [IMP] dans le patron il y 
&lt;avoir.V:3s&gt; avec ses variantes de contexte gauche. Cette heuristique ne donne lieu qu'&#224; deux 
erreurs, cit&#233;es en (8), sur environ 1500 phrases qui suivent ce patron o&#249; il est correctement 
balis&#233; [IMP]. 
</p>
<p>(8)a Il s'&#233;tait r&#233;fugi&#233; en Angleterre. Il y avait tr&#232;s t&#244;t connu les pianos de &#8230;. 
    b Il revient de Rimini. Il y a donn&#233; la r&#233;plique &#224; Madeleine. 
</p>
<p>4.3 il balis&#233; &#224; tort [ANA] au lieu de [IMP] : 2% 
</p>
<p>Plus d'erreurs. Les erreurs de ce type viennent de ce que [ANA] est la balise par d&#233;faut : elles 
viennent donc de lacunes dans l'ensemble des patrons composant ILIMP. Parmi celles-ci, on 
peut d'abord distinguer celles dues &#224; de la paresse/lassitude/manque de temps. Par exemple, 
nous avons autoris&#233; des guillemets &#224; certains endroits mais pas partout, de ce fait il est balis&#233; 
&#224; tort [ANA] dans (9a). De m&#234;me, nous avons &#233;crit certains automates pour traiter les cas avec 
inversion du sujet, mais nous n'avons pas pris le temps de les &#233;crire tous, d'o&#249; l'erreur en (9b). 
Et nous avons fait l'impasse totale sur toute coordination, d'o&#249; (9c). 
</p>
<p>(9)a Il [ANA] &#233;tait &quot; m&#234;me souhaitable &quot; que celui-ci soit issu &quot; de l&#8217;opposition &quot;.  
    b Est-il [ANA] inconcevable que ...  
    c Il [ANA] est donc indispensable et l&#233;gitime de les aider &#8230; 
 
Un second type d'erreurs provient de lacunes lexicales dans nos patrons. Dans l&#8217;&#233;tat actuel 
d&#8217;ILIMP, il manque principalement des adjectifs ancrant une construction impersonnelle, car 
les adjectifs n&#8217;ont pas &#233;t&#233; &#233;tudi&#233;s de fa&#231;on aussi syst&#233;matique que les verbes dans le lexique-
grammaire. La liste des 682 adjectifs ancrant une construction impersonnelle &#8211; &#224; sujet 
phrastique extraposable - peut donc encore &#234;tre compl&#233;t&#233;e. Un relecteur anonyme de cet 
article pose la question de savoir si on peut effectivement recenser les adjectifs ayant un usage 
dans une construction impersonnelle. Il/Elle note qu&#8217;un adjectif comme myope, qui a priori 
n&#8217;ancre pas de construction impersonnelle, pourrait en fait permettre une phrase 
impersonnelle comme (10). 
                                                 
5  Elle demande qu&#8217;UNITEX soit adapt&#233; pour prendre en compte les r&#233;sultats d'un taggeur, ce qui a &#233;t&#233; fait 
</p>
<p>par Patrick Watrin pour Tree Tagger. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Danlos 
</p>
<p>(10) Il  semble tout &#224; fait myope, voire aveugle, de penser que la situation ne peut se d&#233;t&#233;riorer 
 
Si cette phrase est joliment construite et compr&#233;hensible, elle nous semble quand m&#234;me 
inacceptable (m&#234;me en tentant de l&#8217;am&#233;liorer en ajoutant de sa part sur le mod&#232;le de Il est 
idiot de sa part d&#8217;avoir refus&#233; cette offre). Nous sommes plusieurs linguistes &#224; juger (10) 
aussi inacceptable que *Cette action/id&#233;e est myope6. Est-ce &#224; dire qu&#8217;il est exclu de trouver 
une phrase comme (10) en corpus ? Totalement exclu, peut-&#234;tre pas, car elle pr&#233;sente un joli 
effet de style. Mais il semble qu&#8217;on peut affirmer qu&#8217;elle est hautement improbable. De ce 
fait, myope et aveugle peuvent &#234;tre exclus de la liste des adjectifs ancrant une construction 
impersonnelle. De mani&#232;re plus g&#233;n&#233;rale, nous pensons que la liste des adjectifs (ou verbes) 
ancrant une construction impersonnelle n&#8217;est pas ouverte aux glissements de sens : c&#8217;est une 
liste ferm&#233;e, donc recensable. 
</p>
<p>Un troisi&#232;me type d'erreurs provient de lacunes syntaxiques. En particulier, nous avons 
consid&#233;r&#233; obligatoire un sujet phrastique extrapos&#233;, alors qu&#8217;il existe des cas o&#249; il n&#8217;est pas 
r&#233;alis&#233;, par exemple dans des expressions en comme, comme en (11). Nous avons ajout&#233; 
certaines de ces expressions, mais nous n'avons pas men&#233; d'&#233;tude linguistique pour conna&#238;tre 
l'&#233;tendue du ph&#233;nom&#232;ne, nous avons donc des lacunes syntaxiques. 
</p>
<p>(11) Comme il / a &#233;t&#233; annonc&#233; / conviendrait / arrive souvent / est bien connu  
 
Un quatri&#232;me et dernier type d'erreurs concerne les constructions impersonnelles &#224; sujet 
profond nominal. D'une part, comme nous l'avons expliqu&#233; en 3.2.3, ces constructions sont 
d&#233;licates &#224; rep&#233;rer pour des verbes courants comme manquer ou rester. D'autre part, nous 
n'avons &#233;crit aucun patron pour rep&#233;rer les formes impersonnelles avec un verbe au passif ou 
au se-moyen relevant d'un niveau de langue ch&#226;ti&#233;, voir section 2.1, d'o&#249; des erreurs comme 
en (12). 
</p>
<p>(12) Il [ANA] s'&#233;tait form&#233; un cercle d'inimiti&#233; autour de cet individu abject &#8230; 
 
Les trois premiers types d'erreurs sont &#233;vitables &#224; faible co&#251;t, mais il n'en est pas de m&#234;me 
pour le quatri&#232;me type.  
</p>
<p>4.4 Autres erreurs : 0,2% 
</p>
<p>Les autres erreurs proviennent de ce que le mot il n'est pas employ&#233; comme pronom sujet, 
mais par exemple comme &#233;l&#233;ment d'un nom propre &#233;tranger, (13a) 7. Il y a aussi des fautes de 
frappe/d'orthographe, (13b) et (13c). Ces erreurs sont imparables en partant d'un texte brut. 
</p>
<p> (13)a Cela a commenc&#233; dans la seconde moiti&#233; du 18&#232;me, quand, &#224; Milan, se publie cette revue 
illuministe appel&#233;e Il [ANA] Caff&#232; 
     b Il [ANA] y vingt-cinq ans 
     c Puis il [ANA] ont franchi les obstacles dans les bois 
</p>
<p>                                                 
6 On peut avancer l&#8217;hypoth&#232;se d&#8217;une corr&#233;lation entre la possibilit&#233; pour un adjectif d&#8217;ancrer une construction 
</p>
<p>impersonnelle et celle d&#8217;avoir un sujet abstrait comme action ou id&#233;e, voir la paire Il est abracadabrantesque 
de penser que Fred va voter non et Cette id&#233;e est abracadabrantesque. 
</p>
<p>7  Si ILIMP prenait en entr&#233;e un texte o&#249; les entit&#233;s nomm&#233;es sont reconnues, l'erreur en (13a) serait &#233;vit&#233;e 
puisque la s&#233;quence  Il Caff&#232; serait reconnue comme une entit&#233; nomm&#233;e. Dans le pr&#233;sent article, le mot il 
appartient souvent &#224; la m&#233;ta-langue et n'est alors pas employ&#233; comme pronom sujet. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ILLIMP 
</p>
<p>4.5 Evaluation sur des corpus de genre diff&#233;rent 
</p>
<p>Nous avons aussi r&#233;alis&#233; une &#233;valuation d'ILIMP sur des textes litt&#233;raires du XIX&#232;me si&#232;cle 
concernant 1858 occurrences de il. Le taux de bons r&#233;sultats baisse par rapport au genre 
journalistique : il passe de 97,5% de bons r&#233;sultats &#224; 96,8%. Cette baisse est due d'une part &#224; 
des tournures impersonnelles qui ne sont plus usit&#233;es, voir (14), d'autre part &#224; un nombre 
&#233;lev&#233; de phrases impersonnelles avec inversion du sujet comme en (9b), cas que nous n'avons 
pas pris le temps de traiter syst&#233;matiquement. 
</p>
<p>(14) Mais peut-&#234;tre &#233;tait-il un peu matin pour organiser un concert, &#8230; 
 
Le pourcentage de il impersonnel dans ces textes litt&#233;raires augmente par rapport au corpus Le 
Monde : il passe de 42% &#224; 49,8%. D'une mani&#232;re g&#233;n&#233;rale, nous nous attendons &#224; des 
diff&#233;rences importantes de pourcentage de il impersonnel selon les corpus8, mais nous ne nous 
attendons pas &#224; des diff&#233;rences significatives sur le taux de bons r&#233;sultats d'ILIMP (surtout si 
nous prenons le temps de corriger les trois premiers types d'erreurs signal&#233;s dans la section 
4.2) : nous pensons en effet que les t&#234;tes lexicales des constructions impersonnelles forment 
une liste ferm&#233;e (voir section 4.2) et stable quel que soit le corpus.  
</p>
<p>5 Conclusion et recherche future 
La m&#233;thode employ&#233;e dans ILIMP pour rep&#233;rer les occurrences de il impersonnelles ou 
anaphoriques, qui donnent des r&#233;sultats satisfaisants, peut &#234;tre utilis&#233;e pour d&#8217;autres langues et 
pour d&#8217;autres t&#226;ches. Nous avons d&#233;j&#224; signal&#233; (note 2) qu&#8217;on peut d&#233;river d&#8217;ILIMP un outil 
rep&#233;rant la t&#234;te lexicale d&#8217;une phrase simple. On peut aussi envisager d&#8217;utiliser ILIMP pour 
enrichir le calcul des fonctions syntaxiques en identifiant les &quot;sujets profonds extrapos&#233;s&quot;. Par 
ailleurs, la m&#233;thode peut &#234;tre utilis&#233;e pour d&#233;sambigu&#239;ser des mots aussi fr&#233;quents et ambigus 
que il. Ainsi, (Jacques, 2005) utilise une m&#233;thode similaire &#224; la n&#244;tre dans la premi&#232;re &#233;tape 
du traitement qu'elle propose pour d&#233;sambigu&#239;ser le mot que : sans m&#234;me utiliser la richesse 
du lexique-grammaire du LADL, elle augmente le taux de pr&#233;cision sur l'&#233;tiquetage de ce mot 
de 14% par rapport &#224; Tree Tagger (passage de 75% de bons r&#233;sultats &#224; 89%).  
</p>
<p>On peut s'interroger sur la pertinence de ces &quot;petits&quot; outils qui se cantonnent sur un seul mot 
ou sur une fonctionnalit&#233; bien particuli&#232;re. Ils sont certes bien modestes par rapport &#224; un 
syst&#232;me qui produirait, pour n'importe quelle phrase donn&#233;e en entr&#233;e, une (et une seule) 
analyse syntaxique, compl&#232;te, et ce, avec un taux de pr&#233;cision avoisinant les 98%. Mais force 
est de constater qu'un tel syst&#232;me n'existe pas encore. Nous avancerons donc pour la d&#233;fense  
des petits outils le c&#233;l&#232;bre dicton : Les petits ruisseaux font les grandes rivi&#232;res. Il reste &#224; 
canaliser ces ruisseaux, i.e. &#224; organiser un vaste effort de recherche pour d&#233;terminer comment 
ordonnancer les &quot;petits&quot; outils dans une cha&#238;ne de traitement aboutissant &#224; une analyse 
syntaxique robuste, compl&#232;te et correcte. 
</p>
<p>                                                 
8 Le quotidien Le Monde contient un certain nombre de longs articles racontant la vie et l'&#339;uvre de personnes 
</p>
<p>c&#233;l&#232;bres. Ces articles, quand ils concernent une personne c&#233;l&#232;bre de sexe masculin, encha&#238;nent de 
nombreuses occurrences de il anaphorique r&#233;f&#233;rant &#224; cet homme. On peut s'attendre &#224; ce que le pourcentage 
de il impersonnel augmente dans les journaux traitant seulement d'actualit&#233; ou d'&#233;conomie.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Danlos 
</p>
<p>Remerciements 
Je remercie Eric Laporte qui m'a fourni toute la logistique n&#233;cessaire pour r&#233;aliser ce travail &#224; 
l'Universit&#233; Marne-la-Vall&#233;e, et Olivier Blanc pour l'assistance technique vitale qu'il m'a 
apport&#233;e. Je remercie aussi Sylvain Kahane et Alexis Nasr pour leurs commentaires fructueux 
sur cet article. 
</p>
<p>R&#233;f&#233;rences 
BGL : BOONS J-P., GUILLET A., LECLERE C. (1976a), La structure des phrases simples en fran&#231;ais: 
constructions intransitives. Gen&#232;ve: Droz, 378 p. BGL  
</p>
<p>BGL : BOONS J-P., GUILLET A., LECLERE C. (1976b), La structure des phrases simples en fran&#231;ais: 
classes de constructions transitives. Rapport de Recherches du LADL n&#176; 6, Paris: Universit&#233; Paris 7.  
</p>
<p>COURTOIS B. (2004), Dictionnaires &#233;lectroniques DELAF anglais et fran&#231;ais, Syntax, Lexis and 
Lexicon-Grammar. Papers in honour of Maurice Gross , Lingvistic&#230; Investigationes Supplementa 24, 
Amsterdam/Philadelphia : Benjamins, pp. 113&#8211;133. 
</p>
<p>DANLOS L. (1980), Repr&#233;sentation d'informations linguistiques: les constructions N &#234;tre Pr&#233;p X. 
Th&#232;se de troisi&#232;me cycle, Paris: Universit&#233; Paris 7.  
</p>
<p>DANLOS L. (1992), Support Verb Constructions: linguistic properties, representation, translation, 
Journal of French Linguistic Studies, Vol. 2, n&#176;1, Cambridge University Press, Cambridge. 
</p>
<p>EVANS R. (2001), Applying Machine Learning toward an Automatic Classification of it, Literary and 
Linguistic Computing, Vol. 16, n&#176;1, pp. 45-57. 
</p>
<p>GERDES K., KAHANE S. (2004), L&#8217;amas verbal au c&#339;ur d&#8217;une mod&#233;lisation topologique du fran&#231;ais, 
Journ&#233;es de la syntaxe : ordre des mots dans la phrase fran&#231;aise, positions et topologie, Bordeaux, 8. 
</p>
<p>GROSS M. (1975), M&#233;thode en syntaxe, Paris, Hermann. 
</p>
<p>GROSS M. (1993), Les phrases fig&#233;es en fran&#231;ais, L'information grammaticale 59, Paris, p. 36-41.  
</p>
<p>GROSS M. (1994), Constructing Lexicon-Grammars, Computational Approaches to the Lexicon, 
Oxford, Oxford  University Press, p. 213-263. 
</p>
<p>JACQUES M.P. (2005), Que : la valse des &#233;tiquettes, Actes de TALN 05, Dourdan. 
</p>
<p>KENNEDY C., BOGURAEV B. (1996), Anaphora for Eveyone; Pronominal Anaphora Resolution 
without a Parser, in COLING'96, Copenhagen. 
</p>
<p>LAPIN S., LEASS H.J. (1994), An algorithm for pronominal anaphora resolution, Computational 
Linguistics, 20(4), p. 535-561. 
</p>
<p>LECLERE . C. (2003), The lexicon-grammar of French verbs: a syntactic database, In Proceedings of 
the First International Conference on Linguistic Informatics, Kawaguchi Y. et alii (eds.), UBLI, 
Tokyo University of Foreign Studies. 
</p>
<p>MEUNIER A. (1981), Nominalisations d'adjectifs par verbes supports. Th&#232;se de troisi&#232;me cycle, 
LADL, Universit&#233; Paris 7.  
</p>
<p>NASR A. (2004), Analyse syntaxique probabiliste pour grammaires de d&#233;pendances extraites 
automatiquement, Habilitation &#224; diriger des recherches, Universit&#233; Paris 7  
PICABIA L. (1978), Les constructions adjectivales en fran&#231;ais, Gen&#232;ve: Droz.  
</p>
<p>SILBERZTEIN M. (1994), INTEX: a corpus processing system, in COLING'94, Kyoto, Japon, vol. 1, 
pp. 579-583.  </p>

</div></div>
</body></html>