<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitement automatique de la saillance</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Traitement automatique de la saillance
</p>
<p>Fr&#233;d&#233;ric Landragin
</p>
<p>Thales Research &amp; Technology
</p>
<p>Domaine de Corbeville
</p>
<p>91404 Orsay CEDEX
</p>
<p>Frederic.Landragin@thalesgroup.com
</p>
<p>Mots-clefs : facteurs de saillance, saillance linguistique, saillance visuelle, principe de
primordialit&#233;, principe de singularit&#233;, structure communicative, m&#233;thodes de quantification
</p>
<p>Keywords: salience factors, linguistic salience, visual salience, primordiality principle,
singularity principle, communicative structure, quantifying methods
</p>
<p>R&#233;sum&#233; Lorsque nous &#233;coutons un &#233;nonc&#233; ou que nous lisons un texte, les ph&#233;nom&#232;nes
de saillance accaparent notre attention sur une entit&#233; du discours particuli&#232;re. Cette notion de
</p>
<p>saillance comprend un grand nombre d&#8217;aspects, incluant des facteurs lexicaux, syntaxiques, s&#233;-
</p>
<p>mantiques, pragmatiques, ou encore cognitifs. En tant que point de d&#233;part de l&#8217;interpr&#233;tation du
</p>
<p>langage, la saillance fonctionne de pair avec la structure communicative. Dans cet article, notre
</p>
<p>but principal est de montrer comment aboutir &#224; un mod&#232;le computationnel de la saillance, qui
</p>
<p>soit valable aussi bien pour la saillance linguistique que pour la saillance visuelle. Pour cela,
</p>
<p>nous retenons une liste de facteurs qui contribuent &#224; rendre saillante une entit&#233;. Dans le cas
</p>
<p>d&#8217;une entit&#233; du discours, cette approche nous permet de clarifier les rapports entre saillance et
</p>
<p>structure communicative. Nous d&#233;finissons nos principes de primordialit&#233; et de singularit&#233;, puis
</p>
<p>nous passons en revue les diff&#233;rentes m&#233;thodes de quantification de la saillance qui sont com-
</p>
<p>patibles avec ces principes. Nous illustrons alors l&#8217;une d&#8217;entre elles sur un exemple linguistique
</p>
<p>et sur un exemple visuel.
</p>
<p>Abstract Salience attracts the attention on a particular discourse entity when hearing an
utterance or reading a text. Salience is linked to a wide set of aspects from lexical, syntactic,
</p>
<p>semantic, and pragmatic factors to cognitive factors. Being the starting point of the interpreta-
</p>
<p>tion process, salience works in close connection with communicative structure. In this article,
</p>
<p>our main purpose is to show how to tend to a computational model of salience, that can be used
</p>
<p>for linguistic salience as well as for visual salience. With this aim, we provide a list of factors
</p>
<p>that contribute to making an entity salient. For a discourse entity, this approach allows us to
</p>
<p>clarify the links between salience and communicative structure. We define our principles of
</p>
<p>primordiality and singularity, and we discuss the possible methods to quantify salience that are
</p>
<p>compatible with these principles. Then we illustrate one of them with a linguistic example and
</p>
<p>a visual example.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>1 Introduction
</p>
<p>La saillance intervient fortement lors de l&#8217;interpr&#233;tation d&#8217;un &#233;nonc&#233; en situation de dialogue
</p>
<p>ou lors de la compr&#233;hension d&#8217;un texte : mettant en avant un &#233;l&#233;ment, elle dirige l&#8217;attention sur
</p>
<p>cet &#233;l&#233;ment et rend sa prise en compte prioritaire dans le processus de r&#233;solution des r&#233;f&#233;rences
</p>
<p>et des cor&#233;f&#233;rences. Elle permet ainsi d&#8217;attribuer un r&#233;f&#233;rent &#224; un pronom ou &#224; une expression
</p>
<p>ambigu&#235; telle que &#171; le N &#187; lorsque le contexte contient plusieurs objets du type N. La saillance
</p>
<p>linguistique constitue par exemple une aide &#224; la r&#233;solution des anaphores : le N qui vient d&#8217;&#234;tre
</p>
<p>mentionn&#233; est saillant et peut &#234;tre repris par un pronom (Lappin, Leass, 1994). Dans le dialogue
</p>
<p>homme-machine sur &#233;cran, la saillance visuelle constitue un crit&#232;re d&#8217;identification du N per&#231;u
</p>
<p>de mani&#232;re prioritaire et sur lequel est bas&#233; l&#8217;expression &#171; le N &#187; (cf. par exemple (Kievit et al.,
</p>
<p>2001)). La saillance due &#224; la situation d&#8217;interaction permet la compr&#233;hension d&#8217;un pronom sans
</p>
<p>ant&#233;c&#233;dent linguistique, comme dans l&#8217;exemple de (Isard, 1975) o&#249; un enfant tente de caresser
</p>
<p>un lion &#224; travers une cage et se voit pr&#233;venir du danger par &#171; attention, il risque de te mordre &#187;.
</p>
<p>La saillance due au contexte de t&#226;che et &#224; l&#8217;historique de l&#8217;interaction joue le m&#234;me r&#244;le de
</p>
<p>d&#233;sambigu&#239;sation : &#171; le N &#187; peut se comprendre non pas comme &#171; le seul N &#187; mais comme &#171; le N
</p>
<p>qui vient d&#8217;&#234;tre manipul&#233; &#187; ou &#171; le N suivant dans la succession des t&#226;ches &#187;. Nous voyons en
</p>
<p>cela la saillance comme un indice important sur lequel baser l&#8217;identification de l&#8217;implicite, et
</p>
<p>donc comme un point de d&#233;part dans le processus de compr&#233;hension.
</p>
<p>L&#8217;id&#233;e que nous d&#233;fendons ici est que la saillance est un ph&#233;nom&#232;ne global, qui int&#232;gre les
</p>
<p>diff&#233;rentes facettes du contexte (perception visuelle, langage, t&#226;che applicative, historique de
</p>
<p>l&#8217;interaction), et qu&#8217;une caract&#233;risation de la saillance en vue de son calcul par un syst&#232;me de
</p>
<p>compr&#233;hension doit reposer sur des aspects plus g&#233;n&#233;raux que les distinctions classiques entre
</p>
<p>th&#232;me et rh&#232;me ou entre topique et commentaire. Apr&#232;s une section dans laquelle nous pr&#233;-
</p>
<p>cisons notre vision de la saillance et d&#233;finissons les principes de primordialit&#233; et de singularit&#233;
</p>
<p>qui la caract&#233;risent, nous proposons une caract&#233;risation de la saillance linguistique par le biais
</p>
<p>d&#8217;une liste de facteurs de saillance. C&#8217;est sur la base d&#8217;une telle liste que peut se construire
</p>
<p>un mod&#232;le computationnel de la saillance. Nous d&#233;crivons alors les m&#233;canismes des princi-
</p>
<p>pales m&#233;thodes de calcul de la saillance. En adaptant la m&#233;thode de la moyenne des facteurs
</p>
<p>aux principes de primordialit&#233; et de singularit&#233;, nous montrons comment la m&#233;thode r&#233;sultante
</p>
<p>peut &#234;tre exploit&#233;e &#224; la fois pour la saillance linguistique et pour la saillance visuelle. Les
</p>
<p>deux exemples que nous d&#233;crivons constituent ainsi un premier pas vers une mod&#233;lisation de
</p>
<p>l&#8217;attention dans les syst&#232;mes de compr&#233;hension automatique.
</p>
<p>2 Comment appr&#233;hender la saillance ?
</p>
<p>Une premi&#232;re d&#233;finition de ce qui est saillant est ce qui arrive en premier &#224; l&#8217;esprit, ce qui
</p>
<p>capte l&#8217;attention. Ce point de vue correspond souvent &#224; consid&#233;rer comme saillant ce qui est
</p>
<p>naturel, simple, clair. Selon (Stevenson, 2002), les premiers travaux dans les ann&#233;es 1970 se
</p>
<p>sont focalis&#233;s sur la saillance visuelle avec cette id&#233;e de simplicit&#233; naturelle. (Osgood, Bock,
</p>
<p>1977) parlent par exemple de simplicit&#233; naturelle (naturalness) et de clart&#233; (vividness). Ainsi,
</p>
<p>l&#8217;ordre naturel des constituants dans une phrase refl&#232;te souvent l&#8217;ordre naturel des &#233;v&#233;nements
</p>
<p>(agent&#8211;action&#8211;patient) et par cons&#233;quent une certaine hi&#233;rarchie de saillance. Du c&#244;t&#233; de la
</p>
<p>perception visuelle, ce point de vue rejoint celui de la Gestalt &#224; propos de bonne forme : quelque
</p>
<p>chose de simple, d&#8217;imm&#233;diat, de percutant (Guillaume, 1979).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement automatique de la saillance
</p>
<p>Deux autres d&#233;finitions sont souvent avanc&#233;es. En suivant la conception de la Gestalt selon
</p>
<p>laquelle la saillance d&#233;note la force de r&#233;sistance aux perturbations, est saillant ce qui est stable.
</p>
<p>D&#8217;un autre c&#244;t&#233;, est saillant ce qui est original ou nouvellement introduit dans la situation. Ce
</p>
<p>dernier facteur rejoint le crit&#232;re de non-familiarit&#233; de (Loftus, Mackworth, 1978) : des objets
</p>
<p>non familiers tendent &#224; &#234;tre fix&#233;s plus longtemps et en deviennent saillants. Ce facteur rejoint
</p>
<p>&#233;galement celui d&#8217;inattendu : est saillant l&#8217;&#233;l&#233;ment perturbateur, inattendu, curieux, intrigant,
</p>
<p>&#233;nigmatique. Il s&#8217;agit en effet de l&#8217;&#233;l&#233;ment sur lequel on s&#8217;interroge, ou sur lequel le regard va
</p>
<p>s&#8217;attarder pour r&#233;soudre le probl&#232;me qu&#8217;il pose. Par exemple, tout &#233;l&#233;ment visuel ou langagier
</p>
<p>pour lequel l&#8217;activit&#233; perceptive de reconnaissance s&#8217;av&#232;re difficile en devient saillant. Les deux
</p>
<p>d&#233;finitions se contredisent ainsi totalement.
</p>
<p>Un autre probl&#232;me appara&#238;t lorsque la saillance est d&#233;finie par rapport &#224; des facteurs cognitifs
</p>
<p>tels que l&#8217;attention, la m&#233;moire ou la familiarit&#233;. Ces facteurs sont propres &#224; l&#8217;utilisateur et
</p>
<p>montrent en quoi la saillance est subjective. Citons la familiarit&#233; culturelle (par exemple la
</p>
<p>pr&#233;sence d&#8217;un &#234;tre humain ou d&#8217;un lion dans notre champ de vision est saillante et nous incite &#224;
</p>
<p>nous tourner vers eux) et la familiarit&#233; individuelle (au cours de notre &#233;ducation et de notre vie
</p>
<p>pass&#233;e, nous acqu&#233;rons tous nos propres sensibilit&#233;s). La saillance d&#233;pend de plus de l&#8217;attention
</p>
<p>de l&#8217;utilisateur au moment de l&#8217;interaction, de son int&#233;r&#234;t, de son intention communicative : est
</p>
<p>saillant ce qui a de l&#8217;int&#233;r&#234;t compte tenu de l&#8217;objectif de la communication. (Osgood, Bock,
</p>
<p>1977) parlent ainsi de saillance li&#233;e &#224; l&#8217;int&#233;r&#234;t du locuteur (motivation-of-speaker). Nous pou-
</p>
<p>vons d&#233;duire de ce facteur une d&#233;pendance de la saillance envers la t&#226;che applicative : quand
</p>
<p>on invite des coll&#232;gues &#224; entrer dans un bureau, les chaises sont saillantes car ils vont vouloir
</p>
<p>s&#8217;asseoir. D&#8217;un autre c&#244;t&#233;, il n&#8217;y a pas &#233;quivalence entre saillance et intention communicative.
</p>
<p>La saillance peut au contraire prendre un r&#244;le perturbateur : on peut se focaliser intentionnelle-
</p>
<p>ment sur un objet pr&#233;cis tout en &#233;tant perturb&#233; par un objet fortement saillant.
</p>
<p>Tous ces probl&#232;mes se retrouvent lors du passage des d&#233;finitions aux formalisations. Une il-
</p>
<p>lustration imm&#233;diate concerne la distinction entre &#171; donn&#233; &#187; (given) et &#171; nouveau &#187; (new) : le
</p>
<p>donn&#233; est saillant car il est stable et connu, mais le nouveau peut &#234;tre tout autant voire plus
</p>
<p>saillant, &#233;tant justement nouveau et susceptible d&#8217;intriguer. Nous retrouvons la m&#234;me difficult&#233;
</p>
<p>&#224; d&#233;terminer l&#8217;&#233;l&#233;ment saillant dans la distinction entre &#171; th&#232;me &#187; et &#171; rh&#232;me &#187; : selon (Caron,
</p>
<p>1989), la s&#233;quence la plus naturelle de deux phrases est celle o&#249; le rh&#232;me de la premi&#232;re phrase
</p>
<p>est repris comme th&#232;me de la seconde. Le rh&#232;me est repris et est donc saillant. Quant au th&#232;me
</p>
<p>de la nouvelle phrase, on peut aussi consid&#233;rer qu&#8217;il est saillant. Caron conclut qu&#8217;il est impos-
</p>
<p>sible de savoir si c&#8217;est le th&#232;me ou le rh&#232;me qui est l&#8217;&#233;l&#233;ment le plus saillant dans un &#233;nonc&#233;.
</p>
<p>M&#234;me chose &#224; propos de la distinction entre &#171; pr&#233;suppos&#233; &#187; et &#171; pos&#233; &#187; : une information pr&#233;-
</p>
<p>suppos&#233;e, donc implicite, peut s&#8217;av&#233;rer aussi saillante qu&#8217;une information explicite. M&#234;me
</p>
<p>chose &#224; propos de la saillance de l&#8217;&#171; agent &#187; et de la saillance du &#171; patient &#187; : classiquement, par
</p>
<p>exemple dans la Th&#233;orie du Centrage (Grosz et al., 1995), l&#8217;agent est consid&#233;r&#233; comme plus
</p>
<p>saillant que le patient, lui-m&#234;me consid&#233;r&#233; avant les autres r&#244;les th&#233;matiques. Il n&#8217;y a cepen-
</p>
<p>dant pas unanimit&#233; &#224; propos de cette hi&#233;rarchie. Dans des travaux plus r&#233;cents et bas&#233;s sur des
</p>
<p>exp&#233;rimentations, (Stevenson et al., 1994) montrent qu&#8217;entre agent et patient, la pr&#233;f&#233;rence est
</p>
<p>significativement pour le patient, du moins pour certaines constructions verbales. Ainsi, pour
</p>
<p>les phrases qui d&#233;crivent un &#233;v&#233;nement, les cons&#233;quences de l&#8217;&#233;v&#233;nement sont plus pr&#233;sentes
</p>
<p>dans les repr&#233;sentations mentales que les conditions initiales. Ces cons&#233;quences s&#8217;appliquant
</p>
<p>au patient, celui-ci en devient plus saillant que l&#8217;agent. Pour les phrases qui ne d&#233;crivent pas
</p>
<p>d&#8217;&#233;v&#233;nement, tout d&#233;pend des composants de la phrase et rien ne peut &#234;tre conclu. Pour d&#233;ter-
</p>
<p>miner quelle est l&#8217;entit&#233; saillante entre agent et patient, il faudrait d&#233;tailler chaque type d&#8217;action,
</p>
<p>donc chaque type de verbe, en &#233;tudiant sa s&#233;mantique. Le probl&#232;me s&#8217;av&#232;re complexe, du fait de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>la multiplicit&#233; des crit&#232;res qui entrent en jeu. (Stevenson et al., 1994) ainsi que (Pearson et al.,
</p>
<p>2001) d&#233;taillent par exemple le cas des verbes de transfert (donner quelque chose &#224; quelqu&#8217;un)
</p>
<p>et montrent que le receveur est plus saillant que le donneur et que l&#8217;objet transf&#233;r&#233;. Bref, dans
</p>
<p>l&#8217;&#233;tat actuel des recherches, il s&#8217;av&#232;re impossible de faire des liens d&#233;finitifs entre la saillance
</p>
<p>et les distinctions classiques que nous avons cit&#233;es. Les facteurs de saillance souvent avanc&#233;s
</p>
<p>se recouvrent, se contredisent, et rien de pr&#233;cis ne peut &#234;tre d&#233;gag&#233; facilement.
</p>
<p>Une derni&#232;re consid&#233;ration donnera le fil directeur de notre approche : dans le cadre d&#8217;une t&#226;che
</p>
<p>consistant en la description t&#233;l&#233;phonique d&#8217;un itin&#233;raire routier, (Edmonds, 1993) montre que
</p>
<p>la saillance d&#233;pend du contexte incluant le r&#233;f&#233;rent. Il donne l&#8217;exemple d&#8217;un immeuble a priori
</p>
<p>saillant par sa taille importante, et qui perd toute saillance lorsqu&#8217;il est entour&#233; d&#8217;immeubles
</p>
<p>encore plus grands. Il consid&#232;re &#233;galement que certaines caract&#233;ristiques sont saillantes pour
</p>
<p>certains objets et pas pour d&#8217;autres, de m&#234;me que certaines caract&#233;ristiques sont saillantes dans
</p>
<p>un but pr&#233;cis du dialogue et non dans un autre but. Par exemple, la caract&#233;ristique &#171; taille &#187; est
</p>
<p>saillante lorsque le but du dialogue est la d&#233;signation d&#8217;un immeuble, mais ne l&#8217;est pas lorsqu&#8217;il
</p>
<p>s&#8217;agit de la d&#233;signation d&#8217;une intersection de rues. Ainsi, plut&#244;t que de chercher une d&#233;finition
</p>
<p>propre &#224; un objet ou &#224; une structure en particulier, nous nous tournons vers l&#8217;&#233;mergence de
</p>
<p>saillance dans un ensemble contextuel. Les propri&#233;t&#233;s de l&#8217;&#233;nonc&#233; et les propri&#233;t&#233;s physiques de
</p>
<p>l&#8217;ensemble des objets de la sc&#232;ne permettent de distinguer certains &#233;l&#233;ments, et de les consid&#233;rer
</p>
<p>comme saillants. Plus pr&#233;cis&#233;ment, la distinction ne peut se faire que selon deux principes que
</p>
<p>nous appelons &#171; principe de primordialit&#233; &#187; et &#171; principe de singularit&#233; &#187; :
</p>
<p>&#0; Principe de primordialit&#233; : l&#8217;entit&#233; saillante se distingue des autres entit&#233;s du fait d&#8217;une
</p>
<p>importance particuli&#232;re. Dans un &#233;nonc&#233; d&#233;crivant un &#233;v&#233;nement qui concerne un agent,
</p>
<p>un patient et un instrument, le patient est consid&#233;r&#233; comme le r&#244;le th&#233;matique le plus im-
</p>
<p>portant. Du fait de cette importance, l&#8217;entit&#233; correspondante devient l&#8217;entit&#233; du discours
</p>
<p>la plus saillante pour le r&#244;le th&#233;matique.
</p>
<p>&#0; Principe de singularit&#233; : l&#8217;entit&#233; saillante se distingue des autres entit&#233;s du fait d&#8217;une
</p>
<p>singularit&#233;. Dans une sc&#232;ne visuelle contenant des objets bleus et un objet rouge, l&#8217;objet
</p>
<p>rouge est le seul &#224; &#234;tre rouge, et, du fait de cette singularit&#233;, devient l&#8217;objet le plus saillant
</p>
<p>pour la couleur.
</p>
<p>Selon la nature du facteur de saillance consid&#233;r&#233;, c&#8217;est ainsi le principe de primordialit&#233; ou le
</p>
<p>principe de singularit&#233; qui sera appliqu&#233;. La saillance ne d&#233;pendant pas d&#8217;un unique facteur, il
</p>
<p>nous reste &#224; sp&#233;cifier une liste de facteurs de saillance.
</p>
<p>3 Une caract&#233;risation de la saillance linguistique
</p>
<p>Consid&#233;rant qu&#8217;il est plus facile d&#8217;appr&#233;hender les facteurs de saillance visuelle que ceux de
</p>
<p>saillance linguistique, nous avons analys&#233; les r&#244;les des propri&#233;t&#233;s physiques des objets et des
</p>
<p>particularit&#233;s visuelles d&#8217;une sc&#232;ne pour en d&#233;gager des facteurs applicables &#224; la saillance en
</p>
<p>g&#233;n&#233;ral. Nous retenons ainsi les facteurs suivants :
</p>
<p>&#8211; facteurs intrins&#232;ques aux unit&#233;s (unit&#233;s visuelles : objets ; unit&#233;s linguistiques : mots) ;
</p>
<p>&#8211; placement &#224; un endroit strat&#233;gique (dans le cadre de l&#8217;image ; dans la structure de l&#8217;&#233;nonc&#233;) ;
</p>
<p>&#8211; isolement (singleton dans une partition en groupes perceptifs ; groupe de mots en apposition) ;
</p>
<p>&#8211; rupture dans une continuit&#233; (par exemple dans le rythme de l&#8217;image ou de l&#8217;&#233;nonc&#233;) ;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement automatique de la saillance
</p>
<p>&#8211; r&#233;p&#233;tition (dans la disposition des objets ; dans l&#8217;apparition des mots ou expressions) ;
</p>
<p>&#8211; sym&#233;trie (dans la disposition des objets ; par une figure de style telle qu&#8217;un chiasme).
</p>
<p>Ces facteurs mettent l&#8217;accent sur la structure de l&#8217;image ou de l&#8217;&#233;nonc&#233;. D&#8217;autres facteurs
</p>
<p>rel&#232;vent du sens que prennent l&#8217;image et l&#8217;&#233;nonc&#233;. Ce sont ces deux cat&#233;gories (facteurs li&#233;s &#224;
</p>
<p>la forme et facteurs li&#233;s au sens) que nous allons maintenant d&#233;tailler dans le cas de la saillance
</p>
<p>linguistique.
</p>
<p>Des facteurs li&#233;s &#224; la forme de l&#8217;&#233;nonc&#233;. C&#8217;est &#224; la suite de (Stevenson, 2002) que nous distin-
</p>
<p>guons les aspects formels, c&#8217;est-&#224;-dire li&#233;s aux caract&#233;ristiques prosodiques et grammaticales
</p>
<p>de l&#8217;&#233;nonc&#233; oral, des aspects s&#233;mantiques li&#233;s au contenu du message. Dans la majorit&#233; des
</p>
<p>travaux en linguistique computationnelle, par exemple dans (Alshawi, 1987), (Lappin, Leass,
</p>
<p>1994), (Grosz et al., 1995), ou encore dans (Hajic&#780;ov&#225; et al., 1995), ce sont essentiellement des
</p>
<p>facteurs formels qui d&#233;finissent la saillance. Comme le soulignent (Krahmer, Theune, 2002),
</p>
<p>la r&#233;cence est souvent mise en avant, les entit&#233;s les plus saillantes &#233;tant d&#233;finies comme &#233;tant
</p>
<p>les plus r&#233;cemment mentionn&#233;es. A partir de ces travaux et de nos facteurs ci-dessus, nous pro-
</p>
<p>posons la classification suivante (cf. aussi (Landragin, 2004) pour une description d&#233;taill&#233;e) :
</p>
<p>1. La saillance intrins&#232;que au mot : mots constitu&#233;s de phon&#232;mes sonores ; noms propres ;
</p>
<p>d&#233;ictiques purs du fait de leur manque d&#8217;autonomie r&#233;f&#233;rentielle et de l&#8217;habitude qu&#8217;ils
</p>
<p>entra&#238;nent chez l&#8217;interlocuteur &#224; faire attention aux conditions de leur &#233;nonciation.
</p>
<p>2. La saillance par une mise en avant explicite lors de l&#8217;&#233;nonciation : prosodie particuli&#232;re ;
</p>
<p>pr&#233;sence d&#8217;une pause avant et apr&#232;s la prononciation d&#8217;un mot ; erreur de prononciation.
</p>
<p>3. La saillance par une construction syntaxique d&#233;di&#233;e : d&#233;tachements en t&#234;te (&#171; le triangle,
</p>
<p>le rouge, tu dois le mettre &#224; c&#244;t&#233; du bleu &#187;) ; constructions cliv&#233;es (&#171; c&#8217;est ... qui ... &#187;).
</p>
<p>4. La saillance syntaxique li&#233;e &#224; l&#8217;ordre d&#8217;apparition des mots : le d&#233;but et la fin sont pr&#233;dis-
</p>
<p>pos&#233;s pour rendre saillant le mot ou le groupe de mot qui y prend place ; les r&#233;p&#233;titions et
</p>
<p>les sym&#233;tries.
</p>
<p>5. La saillance grammaticale, c&#8217;est-&#224;-dire li&#233;e aux fonctions grammaticales des mots : le
</p>
<p>sujet est souvent consid&#233;r&#233; comme le plus saillant (justifiant les constructions passives).
</p>
<p>6. La saillance indirecte ou transfert grammatical de saillance : une entit&#233; du discours en lien
</p>
<p>grammatical direct avec l&#8217;entit&#233; focalis&#233;e en devient saillante, dans une moindre mesure.
</p>
<p>Des crit&#232;res li&#233;s au sens de l&#8217;&#233;nonc&#233;. C&#8217;est quand nous abordons la s&#233;mantique que nous
</p>
<p>consid&#233;rons les notions de th&#232;me, de focus ou encore de topique :
</p>
<p>1. La saillance li&#233;e &#224; la s&#233;mantique des mots : selon la s&#233;mantique du verbe, ce sera l&#8217;agent
</p>
<p>ou le patient qui sera consid&#233;r&#233; comme le r&#244;le th&#233;matique primordial (cf. plus haut).
</p>
<p>2. La saillance li&#233;e &#224; la s&#233;mantique de l&#8217;&#233;nonc&#233; : selon l&#8217;utilisation qui va &#234;tre faite du
</p>
<p>calcul de la saillance, ce sera le th&#232;me ou le rh&#232;me qui sera consid&#233;r&#233; comme le plus
</p>
<p>important. Par exemple, un calcul destin&#233; &#224; exploiter une saillance pr&#233;alable donnera une
</p>
<p>plus grande importance au rh&#232;me, et un calcul destin&#233; &#224; traduire une nouvelle mise en
</p>
<p>saillance donnera une plus grande importance au th&#232;me.
</p>
<p>3. La saillance li&#233;e &#224; la s&#233;mantique de la conversation (qui se construit au cours du dia-
</p>
<p>logue) : compte tenu du lien fort qu&#8217;il entretient avec la saillance, le topique est consid&#233;r&#233;
</p>
<p>comme le plus important. S&#8217;il recouvre plusieurs entit&#233;s de discours, celle qui est men-
</p>
<p>tionn&#233;e le plus souvent sera consid&#233;r&#233;e comme la plus saillante.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>4. La saillance indirecte ou transfert s&#233;mantique de saillance : un r&#233;f&#233;rent tr&#232;s li&#233; au topique
</p>
<p>est plus saillant qu&#8217;un r&#233;f&#233;rent qui ne lui est pas apparent&#233;.
</p>
<p>Maintenant que ces facteurs sont d&#233;finis, il s&#8217;agit de d&#233;terminer les m&#233;thodes permettant de
</p>
<p>quantifier leur intervention dans un syst&#232;me de compr&#233;hension automatique.
</p>
<p>4 M&#233;thodes pour le calcul num&#233;rique de la saillance
</p>
<p>Nous pr&#233;sentons ici rapidement les diff&#233;rentes m&#233;thodes de calcul utilis&#233;es pour confronter
</p>
<p>des facteurs de saillance et pour quantifier ainsi la saillance d&#8217;une entit&#233; de discours. L&#8217;ordre
</p>
<p>de pr&#233;sentation va de la m&#233;thode la plus facile &#224; mettre en &#339;uvre (celle que nous illustrerons
</p>
<p>ensuite de mani&#232;re d&#233;taill&#233;e sur un exemple) &#224; la plus difficile &#224; mettre en &#339;uvre. L&#8217;importance
</p>
<p>relative des facteurs est d&#233;termin&#233;e a priori dans les premi&#232;res (m&#233;thodes statiques), et en cours
</p>
<p>de traitement dans les derni&#232;res (m&#233;thodes dynamiques).
</p>
<p>La somme ou la moyenne des facteurs. A partir du moment o&#249; l&#8217;on dispose d&#8217;une liste de
</p>
<p>facteurs de saillance, la m&#233;thode la plus simple consiste &#224; identifier pour chacune des entit&#233;s
</p>
<p>du discours quels facteurs privil&#233;gient sa saillance, puis de compter ces facteurs, en divisant
</p>
<p>&#233;ventuellement ensuite le total par le nombre de facteurs. Il s&#8217;agit de la moyenne arithm&#233;tique
</p>
<p>classique, qui privil&#233;gie l&#8217;entit&#233; caract&#233;ris&#233;e par le plus grand nombre de facteurs jouant en sa
</p>
<p>faveur. Cette m&#233;thode ne n&#233;cessite qu&#8217;une liste non hi&#233;rarchis&#233;e de facteurs. En s&#8217;inspirant
</p>
<p>de la th&#233;orie de Tversky qu&#8217;ils d&#233;crivent, (Iwayama et al., 1990) puis (Pattabhiraman, 1993)
</p>
<p>utilisent pour leur part la moyenne g&#233;om&#233;trique, plus pr&#233;cis&#233;ment la multiplication de deux
</p>
<p>scores, l&#8217;int&#233;r&#234;t &#233;tant l&#8217;influence relative des deux termes du produit. D&#8217;une mani&#232;re g&#233;n&#233;rale,
</p>
<p>la m&#233;thode de la moyenne pr&#233;sente plusieurs inconv&#233;nients : les facteurs ont tous la m&#234;me
</p>
<p>importance or il se peut au contraire qu&#8217;un facteur ait beaucoup plus de poids qu&#8217;un autre ;
</p>
<p>en s&#8217;appliquant, un facteur peut en annuler un ou plusieurs autres (p&#233;nalisant d&#8217;autant l&#8217;entit&#233;
</p>
<p>auquel il s&#8217;applique) ; et il se peut que plusieurs facteurs soient fr&#233;quemment conjoints, et que
</p>
<p>leur prise en compte incr&#233;mentale favorise une entit&#233; plus qu&#8217;il ne l&#8217;est souhaitable. Certains de
</p>
<p>ces inconv&#233;nients seront illustr&#233;s dans la section suivante.
</p>
<p>La prise en compte du facteur optimal. Il s&#8217;agit ici de classer a priori les facteurs de saillance
</p>
<p>par ordre d&#8217;importance, et de tester leur application sur chacune des entit&#233;s du discours, en com-
</p>
<p>men&#231;ant par le facteur le plus important. D&#232;s qu&#8217;un facteur s&#8217;applique, l&#8217;entit&#233; correspondante
</p>
<p>est consid&#233;r&#233;e comme la plus saillante. Autrement dit, l&#8217;entit&#233; la plus saillante est celle qui
</p>
<p>satisfait le facteur le plus &#233;lev&#233; (ou optimal). C&#8217;est une simplification du principe de la Th&#233;orie
</p>
<p>de l&#8217;Optimalit&#233; (Prince, Smolensky, 1993), qui, bien qu&#8217;initialement con&#231;ue pour la phonologie,
</p>
<p>constitue une m&#233;tath&#233;orie qui nous semble exploitable ici. Cette m&#233;thode n&#233;cessite d&#8217;&#234;tre ca-
</p>
<p>pable de fournir une hi&#233;rarchie des facteurs. C&#8217;est ce que font (Hajic&#780;ov&#225; et al., 1995) lorsqu&#8217;ils
</p>
<p>privil&#233;gient par exemple les &#233;l&#233;ments focalis&#233;s dans l&#8217;&#233;nonc&#233; &#224; ceux d&#233;sign&#233;s par un groupe
</p>
<p>nominal dans sa partie topique. Le probl&#232;me avec une telle &#233;chelle, et d&#8217;une mani&#232;re g&#233;n&#233;rale
</p>
<p>d&#232;s qu&#8217;on consid&#232;re une hi&#233;rarchie, c&#8217;est qu&#8217;une entit&#233; peut satisfaire le seul facteur optimal
</p>
<p>alors qu&#8217;une autre entit&#233; peut satisfaire une multitude de facteurs secondaires et constituer ainsi
</p>
<p>un candidat th&#233;oriquement plus pertinent.
</p>
<p>La moyenne pond&#233;r&#233;e des facteurs. La pond&#233;ration de facteurs selon leur importance et la prise
</p>
<p>en compte de l&#8217;ensemble des facteurs par une moyenne s&#8217;av&#232;re une solution aux probl&#232;mes
</p>
<p>des deux m&#233;thodes pr&#233;c&#233;dentes. D&#233;terminer des poids s&#8217;av&#232;re cependant d&#233;licat : l&#8217;intuition</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement automatique de la saillance
</p>
<p>ne suffit pas &#224; justifier des chiffres tels que 0.8 ou 0.6, et une analyse de corpus peut aboutir
</p>
<p>&#224; des r&#233;sultats biais&#233;s de par la nature du corpus ou les difficult&#233;s que pose l&#8217;identification par
</p>
<p>l&#8217;annotateur des causes de saillance. La pond&#233;ration de (Alshawi, 1987) est l&#8217;une des premi&#232;res
</p>
<p>et des plus int&#233;ressantes. Si les poids sont critiquables, avec par exemple une trop grande impor-
</p>
<p>tance donn&#233;e &#224; la r&#233;cence, leur exploitation sur un large &#233;ventail de ph&#233;nom&#232;nes linguistiques
</p>
<p>est en revanche appr&#233;ciable. La m&#233;thode de la moyenne pond&#233;r&#233;e semble ad&#233;quate au calcul
</p>
<p>de la saillance mais n&#233;cessite un &#233;norme travail de d&#233;termination des poids des facteurs. Pour
</p>
<p>&#234;tre valide, ce travail devrait inclure le test syst&#233;matique d&#8217;un facteur en inhibant tous les autres,
</p>
<p>puis le test de chaque paires de deux facteurs, etc.
</p>
<p>Les m&#233;thodes proc&#233;durales. Pour r&#233;soudre des anaphores pronominales, (Mitkov, 1998) d&#233;finit
</p>
<p>des heuristiques bas&#233;es sur des scores intuitifs. Son approche caract&#233;ris&#233;e par le peu d&#8217;infor-
</p>
<p>mation exploit&#233;e ne n&#233;cessite m&#234;me pas d&#8217;analyse syntaxique compl&#232;te. Les facteurs de sail-
</p>
<p>lance en sont tr&#232;s r&#233;duits (ex : 0 pour un d&#233;fini et -1 pour un ind&#233;fini). Cette approche illustre le
</p>
<p>recours &#224; une m&#233;thode calculatoire extr&#234;me, avec son avantage d&#8217;&#234;tre op&#233;rationnelle et parfois
</p>
<p>pertinente, et son inconv&#233;nient majeur : aucune plausibilit&#233; linguistique.
</p>
<p>Les m&#233;thodes statistiques et les approches hybrides. (Pattabhiraman, 1993) utilise un r&#233;seau de
</p>
<p>relations statistiques entre concepts pour identifier la cat&#233;gorie la plus saillante dans une situa-
</p>
<p>tion donn&#233;e. Les r&#233;sultats s&#8217;av&#232;rent convaincants et montrent l&#8217;int&#233;r&#234;t de certaines m&#233;thodes
</p>
<p>statistiques. C&#8217;est le cas de l&#8217;analyse factorielle des correspondances permettant (avec l&#8217;avis
</p>
<p>d&#8217;experts) de d&#233;terminer les influences relatives des divers facteurs, par exemple l&#8217;influence
</p>
<p>de la position initiale et de la fonction sujet sur le statut de th&#232;me. Cette id&#233;e reste cepen-
</p>
<p>dant &#224; l&#8217;&#233;tat de perspective de recherche. Une autre perspective qui nous semble int&#233;ressante
</p>
<p>est l&#8217;exploration de m&#233;thodes hybrides, telle que la combinaison d&#8217;une m&#233;thode bas&#233;e sur la
</p>
<p>moyenne pond&#233;r&#233;e de facteurs avec une m&#233;thode statistique, celle-ci remettant en question les
</p>
<p>diff&#233;rents poids compte tenu des interf&#233;rences entre facteurs.
</p>
<p>Les m&#233;thodes dynamiques. Figer une hi&#233;rarchie de facteurs peut sembler dangereux : rien ne dit
</p>
<p>que dans un contexte ou un autre, tel facteur prendra une importance toute particuli&#232;re. Exem-
</p>
<p>ples : dans une suite de deux phrases o&#249; le th&#232;me de la seconde reprend le rh&#232;me de la premi&#232;re,
</p>
<p>le facteur li&#233; &#224; la distinction th&#232;me-rh&#232;me n&#8217;a pas le m&#234;me poids dans les deux phrases ; lorsque
</p>
<p>le propos du discours est identifi&#233; et consid&#233;r&#233; comme saillant, ce calcul doit rester activ&#233; pour
</p>
<p>l&#8217;analyse de plusieurs phrases. Un autre exemple o&#249; l&#8217;importance des facteurs de saillance est
</p>
<p>g&#233;r&#233;e dynamiquement est celui de (Lappin, Leass, 1994), qui se basent sur (Alshawi, 1987) pour
</p>
<p>proposer un algorithme de r&#233;solution des anaphores pronominales. Un seuil initial varie au fur
</p>
<p>et &#224; mesure du traitement des phrases. Certaines &#233;tapes consistent par exemple &#224; diviser par 2
</p>
<p>le poids de tel facteur. M&#234;me si cette approche pr&#233;sente quelques d&#233;fauts (r&#233;cence privil&#233;gi&#233;e,
</p>
<p>limitation &#224; des facteurs purement formels) et reste &#224; am&#233;liorer, elle constitue une premi&#232;re
</p>
<p>&#233;tape dans la gestion dynamique de scores qui nous semble th&#233;oriquement int&#233;ressante. Cette
</p>
<p>m&#233;thode est cependant tr&#232;s difficile &#224; mettre en &#339;uvre : il s&#8217;agit d&#8217;identifier l&#8217;ensemble des
</p>
<p>influences contextuelles sur chacun des facteurs de saillance. Face aux difficult&#233;s, les auteurs
</p>
<p>avouent eux-m&#234;mes que les poids qu&#8217;ils proposent sont arbitraires. Le principal constat que
</p>
<p>nous pouvons faire &#224; ce stade est ainsi le suivant : si les m&#233;thodologies math&#233;matiques et statis-
</p>
<p>tiques semblent stabilis&#233;es, il en n&#8217;est pas de m&#234;me de celles relatives au traitement de corpus
</p>
<p>pour d&#233;terminer les poids et les influences relatives des divers facteurs. C&#8217;est dans ce sens qu&#8217;il
</p>
<p>nous semble important de continuer les recherches. Et c&#8217;est aussi pour cette raison que nous ne
</p>
<p>pr&#233;sentons pas ici d&#8217;analyse de corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>5 Illustration de la moyenne des facteurs sur un exemple
</p>
<p>Pour le moment, plusieurs m&#233;thodes peuvent &#234;tre mises en &#339;uvre sans trop de difficult&#233;s, et il
</p>
<p>nous semble utile de d&#233;tailler l&#8217;une d&#8217;entre elles sur des exemples faisant intervenir le principe
</p>
<p>de primordialit&#233; et le principe de singularit&#233;. Nous retenons ainsi un exemple d&#8217;une sc&#232;ne
</p>
<p>visuelle dans laquelle les objets se distinguent par leur forme, leur couleur et leur taille. A
</p>
<p>ces propri&#233;t&#233;s physiques qui constituent autant de facteurs de saillance s&#8217;ajoute l&#8217;isolement que
</p>
<p>nous avons d&#233;fini plus haut comme un autre facteur. Comme le montre la figure 1, des scores
</p>
<p>de 0 ou de 1 sont attribu&#233;s &#224; chacun des objets pour chacun des facteurs de saillance. C&#8217;est
</p>
<p>dans la mani&#232;re d&#8217;attribuer ces scores que se traduisent les principes de primordialit&#233; et de
</p>
<p>singularit&#233; :
</p>
<p>&#1; Application du principe de primordialit&#233; : l&#8217;objet qui s&#8217;av&#232;re le plus important compte
</p>
<p>tenu du facteur de saillance consid&#233;r&#233; obtient un score de 1 pour ce facteur, et les autres
</p>
<p>objets un score de 0. C&#8217;est ce qui est fait avec le facteur taille dans la figure 1-A, l&#8217;objet
</p>
<p>b ayant la taille la plus importante.
</p>
<p>&#1; Application du principe de singularit&#233; : compte tenu d&#8217;un facteur de saillance et des
</p>
<p>valeurs qui peuvent &#234;tre prises pour ce facteur, un objet ou une entit&#233; du discours qui
</p>
<p>partage sa valeur avec d&#8217;autres obtient un score de 0 pour ce facteur ; un objet qui est
</p>
<p>le seul &#224; poss&#233;der sa valeur obtient un score de 1. C&#8217;est ce qui est fait avec le facteur
</p>
<p>forme, les valeurs instanci&#233;es &#233;tant &#171; triangle &#187; et &#171; cercle &#187;. Ainsi, l&#8217;unique cercle de la
</p>
<p>figure 1-A obtient le score de 1, alors que tous les objets de la figure 1-B restent &#224; 0.
</p>
<p>A. Par la couleur et la taille B. Par l&#8217;isolement
</p>
<p>forme :
</p>
<p>couleur :
</p>
<p>taille :
</p>
<p>isolement :
</p>
<p>saillance :
</p>
<p>a
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>b
</p>
<p>0
</p>
<p>1
</p>
<p>1
</p>
<p>0
</p>
<p>0.5
</p>
<p>c
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>d
</p>
<p>1
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0.25
</p>
<p>forme :
</p>
<p>couleur :
</p>
<p>taille :
</p>
<p>isolement :
</p>
<p>saillance :
</p>
<p>a
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>1
</p>
<p>0.25
</p>
<p>b
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>c
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>d
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>0
</p>
<p>a
</p>
<p>c
</p>
<p>b
</p>
<p>d
a
</p>
<p>b d
</p>
<p>c
</p>
<p>Figure 1: Scores num&#233;riques pour un premier calcul de la saillance visuelle.
</p>
<p>Cette m&#233;thode nous semble op&#233;rationnelle, dans la mesure o&#249; rep&#233;rer des singularit&#233;s et des
</p>
<p>primordialit&#233;s dans une liste de propri&#233;t&#233;s s&#8217;av&#232;re possible d&#8217;un point de vue computationnel,
</p>
<p>du moins &#224; partir du moment o&#249; ces propri&#233;t&#233;s peuvent se repr&#233;senter formellement.
</p>
<p>Plus pr&#233;cis&#233;ment &#224; propos de la figure 2 : les deux cas pr&#233;sent&#233;s ont la m&#234;me saillance alors
</p>
<p>que le second est pourtant intuitivement le plus saillant, du fait du pr&#233;sentatif. En effet, certains
</p>
<p>facteurs se contredisent, particuli&#232;rement la construction d&#233;di&#233;e et la fonction grammaticale
</p>
<p>sujet : le cas B se voit attribuer un point de plus que le cas A pour la construction d&#233;di&#233;e, mais
</p>
<p>du coup perd un point pour la fonction sujet. Or justement la construction d&#233;di&#233;e prend le pas</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement automatique de la saillance
</p>
<p>A. &#171; le triangle rouge se met &#224; c&#244;t&#233; du bleu &#187;
</p>
<p>&#171; le triangle rouge &#187; &#171; le bleu &#187;
</p>
<p>construction syntaxique d&#233;di&#233;e : 0 0
</p>
<p>ordre d&#8217;apparition des mots (d&#233;but) : 1 0
</p>
<p>fonction grammaticale (sujet) : 1 0
</p>
<p>s&#233;mantique des mots (r&#244;le th&#233;matique) : 1 0
</p>
<p>s&#233;mantique de l&#8217;&#233;nonc&#233; (th&#232;me) : 1 0
</p>
<p>total de saillance entre 0 et 1 : 0.8 0
</p>
<p>B. &#171; c&#8217;est le triangle rouge que tu dois mettre &#224; c&#244;t&#233; du bleu &#187;
</p>
<p>&#171; le triangle rouge&#187; &#171; le bleu &#187;
</p>
<p>construction syntaxique d&#233;di&#233;e : 1 0
</p>
<p>ordre d&#8217;apparition des mots (d&#233;but) : 1 0
</p>
<p>fonction grammaticale (sujet) : 0 0
</p>
<p>s&#233;mantique des mots (r&#244;le th&#233;matique) : 1 0
</p>
<p>s&#233;mantique de l&#8217;&#233;nonc&#233; (th&#232;me) : 1 0
</p>
<p>total de saillance entre 0 et 1 : 0.8 0
</p>
<p>Figure 2: Scores num&#233;riques pour un premier calcul de la saillance linguistique.
</p>
<p>sur la fonction sujet et celle-ci ne devrait plus &#234;tre compt&#233;e, ou du moins devrait &#234;tre compt&#233;e
</p>
<p>dans une proportion moindre. On arrive ainsi &#224; la notion de poids : comme dans les approches
</p>
<p>d&#8217;Alshawi et de Lappin et Leass, les poids relatifs des diff&#233;rents facteurs sont d&#8217;importance.
</p>
<p>Reste que leur d&#233;termination est empirique et n&#233;cessite de co&#251;teuses &#233;tudes de corpus.
</p>
<p>6 Conclusion et perspectives
</p>
<p>La saillance ne fait pas partie du message communiqu&#233;, mais tout le message se base sur elle,
</p>
<p>s&#8217;explique par elle, se structure en fonction d&#8217;elle. C&#8217;est pourquoi cette notion nous semble avoir
</p>
<p>une importance toute particuli&#232;re dans les recherches en traitement automatique des langues.
</p>
<p>Nous avons voulu montrer ici que la notion de saillance linguistique pouvait &#234;tre appr&#233;hend&#233;e
</p>
<p>d&#8217;une mani&#232;re efficace en clarifiant ses rapports avec la structure informationnelle et en la rap-
</p>
<p>prochant de la saillance visuelle. La liste des facteurs de saillance &#224; laquelle nous aboutissons
</p>
<p>nous permet d&#8217;envisager comment la saillance linguistique aussi bien que la saillance visuelle
</p>
<p>peuvent &#234;tre exploit&#233;es dans un syst&#232;me de compr&#233;hension automatique, qu&#8217;il s&#8217;agisse de dia-
</p>
<p>logue homme-machine, de traduction ou de r&#233;sum&#233; automatique. Les principes de primordialit&#233;
</p>
<p>et de singularit&#233; que nous d&#233;finissons et que nous appliquons &#224; la m&#233;thode de la moyenne des
</p>
<p>facteurs constituent un premier pas vers une formalisation de la saillance. Cette formalisation
</p>
<p>reste &#224; compl&#233;ter avec l&#8217;apport des autres m&#233;thodes pr&#233;sent&#233;es dans cet article, avec par exem-
</p>
<p>ple des strat&#233;gies suppl&#233;mentaires pour tenir compte des interactions entre facteurs de saillance.
</p>
<p>Nous aurons en particulier &#224; sp&#233;cifier des strat&#233;gies de confrontation de la saillance visuelle
</p>
<p>avec la saillance linguistique pour la r&#233;solution des r&#233;f&#233;rences en contexte visuel.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin
</p>
<p>R&#233;f&#233;rences
</p>
<p>Alshawi H. (1987), Memory and Context for Language Interpretation, Cambridge University Press.
</p>
<p>Caron J. (1989), Pr&#233;cis de psycholinguistique, Paris, PUF.
</p>
<p>Edmonds P.G. (1993), A Computational Model of Collaboration on Reference in Direction-Giving Dia-
</p>
<p>logues, Ms. Thesis, University of Toronto, Canada.
</p>
<p>Grosz B.J., Joshi A.K.,Weinstein S. (1995), Centering: A Framework for Modelling the Local Coherence
</p>
<p>of Discourse, Computational Linguistics, Vol. 21(2).
</p>
<p>Guillaume P. (1979), La psychologie de la forme, Paris, Flammarion.
</p>
<p>Hajic&#780;ov&#225; E., Hoskovec T., Sgall P. (1995), Discourse Modelling Based on Hierarchy of Salience, Prague
</p>
<p>Bulletin of Mathematical Linguistics, Vol. 64.
</p>
<p>Isard S. (1975), Changing the Context, In: Keenan E.L. (Ed.) Formal Semantics of Natural Language,
</p>
<p>London &amp; New York, Cambridge University Press.
</p>
<p>Iwayama M., Tokunaga T., Tanaka H. (1990), A Method for Calculating the Measure of Salience in
</p>
<p>Understanding Metaphors, In: Proceedings of the National Conference on Artificial Intelligence, Boston.
</p>
<p>Kievit L., Piwek P., Beun R.J., Bunt H. (2001), Multimodal Cooperative Resolution of Referential Ex-
</p>
<p>pressions in the DENK System, In: Bunt H., Beun R.J. (Eds.), Cooperative Multimodal Communication,
</p>
<p>Berlin &amp; Heidelberg, Springer.
</p>
<p>Krahmer E., Theune M. (2002), Efficient Context-Sensitive Generation of Referring Expressions, In:
</p>
<p>van Deemter K., Kibble R. (Eds.), Information Sharing: Reference and Presupposition in Language
</p>
<p>Generation and Interpretation, Stanford, CSLI Publications.
</p>
<p>Landragin F. (2004), Saillance physique et saillance cognitive, Cognition, Repr&#233;sentation, Langage
</p>
<p>(CORELA), Vol. 2(2).
</p>
<p>Lappin S., Leass H.J. (1994), A Syntactically Based Algorithm for Pronominal Anaphora Resolution,
</p>
<p>Computational Linguistics, Vol. 20(4).
</p>
<p>Loftus G.R., Mackworth N.H. (1978), Cognitive Determinants of Fixation Location during Picture View-
</p>
<p>ing, Journal of Experimental Psychology: Human Perception and performance, Vol. 4.
</p>
<p>Mitkov R. (1998), Robust Pronoun Resolution with Limited Knowledge, In: Proceedings of the Eigh-
</p>
<p>teenth International Conference on Computational Linguistics, Montr&#233;al.
</p>
<p>Osgood C.E., Bock J.K. (1977), Salience and Sentencing: Some Production Principles, In: Rosenberg S.
</p>
<p>(Ed.), Sentence Production: Developments in Research and Theory, Hillsdale, Erlbaum.
</p>
<p>Pattabhiraman T. (1993), Aspects of Salience in Natural Language Generation, Ph.D. Thesis, Simon
</p>
<p>Fraser University.
</p>
<p>Pearson J., Poesio M., Stevenson R. (2001), The Effects of Animacy, Thematic Role and Surface Position
</p>
<p>on the Focusing of Entities in Discourse, In: Proceedings of the First Workshop on Cognitively Plausible
</p>
<p>Models of Semantic Processing.
</p>
<p>Prince A., Smolensky P. (1993), Optimality Theory: Constraint Interaction in Generative Grammar,
</p>
<p>Technical Report, Rutgers University.
</p>
<p>Stevenson R.J., Crawley R.A., Kleinman D. (1994), Thematic Roles, Focus and the Representation of
</p>
<p>Events, Language and Cognitive Processes, Vol. 9(4).
</p>
<p>Stevenson R.J. (2002), The Role of Salience in the Production of Referring Expressions, In: van Deemter
</p>
<p>K., Kibble R. (Eds.), Information Sharing: Reference and Presupposition in Language Generation and
</p>
<p>Interpretation, Stanford, CSLI Publications.</p>

</div></div>
</body></html>