<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La plate-forme LinguaStream : un outil d'exploration linguistique sur corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>La plate-forme LinguaStream :
un outil d&#8217;exploration linguistique sur corpus
</p>
<p>WIDL&#214;CHER Antoine, BILHAUT Fr&#233;d&#233;rik
GREYC - CNRS UMR &#63286;&#63280;&#63287;&#63282; - Universit&#233; de Caen
</p>
<p>Campus II, Sciences 3, B.P. 5186, 14032 Caen Cedex, France
{awidloch,fbilhaut}@info.unicaen.fr
</p>
<p>Mots-clefs : Linguistique de corpus, TAL, plate-forme logicielle
Keywords: Corpus linguistics, NLP, software framework
</p>
<p>R&#233;sum&#233; &#192; travers la pr&#233;sentation de la plate-forme LinguaStream, nous pr&#233;sentons cer-
tains principes m&#233;thodologiques et diff&#233;rents mod&#232;les d&#8217;analyse pouvant permettre l&#8217;articula-
tion de traitements sur corpus. Nous envisageons en particulier les besoins n&#233;s de perspectives
&#233;mergentes en TAL telles que l&#8217;analyse du discours.
</p>
<p>Abstract By presenting the LinguaStream platform, we introduce different methodologi-
cal principles and analysis models, which make it possible to articulate corpus processing tasks.
More especially, we consider emerging approaches in NLP, such as discourse analysis.
</p>
<p>1 Introduction
</p>
<p>Par del&#224; la diversit&#233; des domaines d&#8217;investigation et des objets d&#8217;&#233;tude, un certain nombre de
tendances communes se confirment peu &#224; peu au sein de la communaut&#233; TAL. Se manifeste
tout d&#8217;abord, d&#233;sormais distinctement, la g&#233;n&#233;ralisation du travail sur corpus, mouvement qui
constitue d&#8217;ailleurs un point de convergence f&#233;cond entre les travaux sp&#233;cifiquement d&#233;di&#233;s au
TAL et les d&#233;marches plus imm&#233;diatemment linguistiques. Les mod&#232;les th&#233;oriques propos&#233;s
doivent d&#233;sormais trouver leur justification et prouver leur validit&#233; &#171; en corpus &#187;, et leur per-
tinence sera jug&#233;e, tant&#244;t sur leur capacit&#233; &#224; rendre compte de la diversit&#233; dudit corpus (dans
une perspective descriptive), tant&#244;t &#224; la lumi&#232;re de leur capacit&#233; &#224; l&#8217;explorer &#171; efficacement &#187;
(dans une perspective d&#8217;ing&#233;nierie documentaire). Se pose alors in&#233;vitablement la question de
la m&#233;thode et des outils &#224; adopter pour travailler ainsi &#171; sur corpus &#187;.
Il devient en effet difficilement envisageable de consid&#233;rer celui-ci comme une mati&#232;re brute &#224;
laquelle devraient se r&#233;f&#233;rer imm&#233;diatement les diff&#233;rents mod&#232;les et traitements. Au contraire,
la multiplication des points de vue sur le corpus, qu&#8217;ils soient morphologiques, syntaxiques, s&#233;-
mantiques, rh&#233;toriques ou pragmatiques, qu&#8217;ils ne visent que l&#8217;une de ces dimensions ou qu&#8217;ils
les croisent, rend pressante la question des interd&#233;pendances entre ces vues possibles, interd&#233;-
pendances qui seront d&#8217;autant plus nombreuses que des r&#233;sultats satisfaisants seront obtenus
par chacune des approches. Une r&#233;cente Journ&#233;e d&#8217;&#201;tude de l&#8217;ATALA a d&#8217;ailleurs permis de
poser tr&#232;s frontalement la question d&#233;sormais centrale de l&#8217;articulation des traitements sur cor-
pus. Or, si l&#8217;articulation des traitements rend indispensable une r&#233;flexion sur leur modularit&#233;,
elle conduit &#233;galement &#224; r&#233;interroger l&#8217;ensemble de leur processus d&#8217;&#233;laboration, de la prise en</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>WIDL&#214;CHER Antoine, BILHAUT Fr&#233;d&#233;rik
</p>
<p>charge du corpus, jusqu&#8217;&#224; l&#8217;&#233;valuation des r&#233;sulats, en imposant que soient repens&#233;es les no-
tions m&#234;me d&#8217;observation et d&#8217;exp&#233;rimentation, &#224; travers, en particulier, une r&#233;flexion sur les
cycles d&#8217;&#233;valuation/validation puis d&#8217;ajustement des m&#233;thodes d&#8217;analyse.
Enfin, de nouvelles perspectives en TAL confirment ces nouveaux besoins. Si nous consid&#233;rons
l&#8217;int&#233;r&#234;t r&#233;cent accord&#233; &#224; l&#8217;analyse automatique de l&#8217;organisation discursive, par exemple en
termes th&#233;matiques (Bilhaut, 2004) ou rh&#233;toriques (Widl&#246;cher, 2004), il appara&#238;t clairement
que ces investigations sont rendues possibles par la pr&#233;existence de r&#233;sultats satisfaisants aux
niveaux de granularit&#233; inf&#233;rieurs, en mati&#232;re d&#8217;analyse morpho-syntaxique et s&#233;mantique, aux
niveaux lexicaux et syntagmatiques. Ces travaux se trouvent consubstantiellement li&#233;s &#224; des
strat&#233;gies d&#8217;empilement de traitements successifs permettant l&#8217;enrichissement incr&#233;mental des
vues sur le corpus et l&#8217;abstraction progressive des formes de surface par l&#8217;utilisation des analyses
pr&#233;alables. &#192; travers la pr&#233;sentation de LinguaStream1, nous envisageons ici diff&#233;rents &#233;l&#233;ments
m&#233;thodologiques et techniques pouvant permettre d&#8217;assumer ces nouvelles orientations.
</p>
<p>2 La plate-forme LinguaStream
</p>
<p>LinguaStream (Bilhaut &amp; Widl&#246;cher, 2005) a pour principale ambition de faciliter la r&#233;alisa-
tion d&#8217;exp&#233;riences sur corpus non triviales en TAL, ainsi que le cycle d&#8217;&#233;valuation/ajustement
qui en d&#233;coule. Sans outil adapt&#233;, le co&#251;t de d&#233;veloppement induit par chaque nouvelle ex-
p&#233;rience devient en effet un frein consid&#233;rable &#224; l&#8217;approche exp&#233;rimentale. Pour r&#233;pondre &#224;
ce probl&#232;me, LinguaStream facilite la mise en &#339;uvre de proc&#233;d&#233;s complexes tout en requ&#233;-
rant des comp&#233;tences informatiques minimales. Plate-forme g&#233;n&#233;rique fond&#233;e sur le principe
d&#8217;enrichissement incr&#233;mental des documents &#233;lectroniques, elle facilite la conception et l&#8217;&#233;va-
luation de cha&#238;nes de traitements complexes, par assemblage visuel de modules d&#8217;analyse de
types et de niveaux vari&#233;s : morphologique, syntaxique, s&#233;mantique, discursif... Chaque palier
de la cha&#238;ne de traitement se traduit par la d&#233;couverte et le marquage de nouvelles informations,
sur lesquelles pourront s&#8217;appuyer les analyseurs subs&#233;quents.
Un environnement de d&#233;veloppement int&#233;gr&#233; permet de construire visuellement ces cha&#238;nes de
traitement, &#224; partir d&#8217;une &#171; palette &#187; de composants (une cinquantaine est int&#233;gr&#233;e en standard)
facilement extensible gr&#226;ce une API Java, un syst&#232;me de macro-composants, et des templates.
Certains sont sp&#233;cifiquement d&#233;di&#233;s au TAL, et d&#8217;autres permettent de r&#233;soudre diff&#233;rents pro-
bl&#232;mes li&#233;s &#224; la gestion des documents &#233;lectroniques (traitements XML en particulier). D&#8217;autres
peuvent &#234;tre utilis&#233;s pour effectuer des calculs sur les annotations produites par les analyseurs,
ou encore g&#233;n&#233;rer des diagrammes. Chacun dispose d&#8217;un ou plusieurs points d&#8217;entr&#233;e et/ou de
sortie que l&#8217;on relie pour obtenir la cha&#238;ne voulue, celle-ci &#233;tant repr&#233;sent&#233;e par un graphe o&#249; les
divers composants apparaissent sous forme de &#171; bo&#238;tes &#187; reli&#233;es entre elles. Chaque composant
propose un nombre variable de param&#232;tres permettant d&#8217;adapter leur comportement. Les mar-
quages produits sur un m&#234;me document sont organis&#233;s en couches ind&#233;pendantes, supportant
ench&#226;ssements et chevauchements. La plate-forme se base syst&#233;matiquement sur les standards
et outils XML, et peut traiter tout fichier de ce type en pr&#233;servant sa structure orginelle. &#192; l&#8217;ex&#233;-
cution, elle se charge de l&#8217;ordonnancement des sous-t&#226;ches, et diff&#233;rents outils permettent in
fine de visualiser les documents analys&#233;s et leurs annotations.
</p>
<p>Principes fondamentaux
En premier lieu, la plate-forme recourt syst&#233;matiquement &#224; des repr&#233;sentations d&#233;claratives
pour sp&#233;cifier les diff&#233;rents traitements, ainsi que leur encha&#238;nement sous forme de graphe.
Les diff&#233;rents formalismes disponibles permettent ainsi de transcrire directement l&#8217;expertise
</p>
<p>1On trouvera une pr&#233;sentation compl&#232;te de la plate-forme &#224; l&#8217;adresse http://www.linguastream.org.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La plate-forme LinguaStream
</p>
<p>linguistique &#224; mettre en &#339;uvre, l&#8217;appareil proc&#233;dural qui en r&#233;sulte &#233;tant pris en charge par
la plate-forme. Les r&#232;gles donn&#233;es ont donc une valeur tant descriptive, en tant que repr&#233;-
sentations formelles d&#8217;un ph&#233;nom&#232;ne linguistique, que prescriptive, en tant qu&#8217;instructions de
traitement fournies &#224; un processus informatique.
De plus, la plate-forme exploite la compl&#233;mentarit&#233; des mod&#232;les d&#8217;analyse, plut&#244;t que de pri-
vil&#233;gier un hypoth&#233;tique mod&#232;le &#171; omnipotent &#187; capable d&#8217;exprimer efficacement tout type de
contrainte. Nous faisons en effet l&#8217;hypoth&#232;se qu&#8217;un analyseur complexe doit adopter successi-
vement plusieurs regards sur le m&#234;me mat&#233;riau linguistique, auxquels r&#233;pondront des forma-
lismes distincts. On pourra combiner, au sein d&#8217;un m&#234;me traitement, des expressions r&#233;guli&#232;res
au niveau morphologique, une grammaire locale au niveau syntagmatique, un transducteur au
niveau phrastique et une grammaire DSDL (cf. infra) au niveau discursif. L&#8217;interop&#233;rabilit&#233; des
diff&#233;rents mod&#232;les d&#8217;analyse propos&#233;s est garantie par l&#8217;usage d&#8217;une repr&#233;sentation unifi&#233;e des
marquages et des annotations. Ces derni&#232;res sont uniform&#233;ment repr&#233;sent&#233;es par des structures
de traits, mod&#232;le commun&#233;ment utilis&#233; en TAL et en linguistique, et permettant de repr&#233;sen-
ter des annotations riches et structur&#233;es. Tout composant d&#8217;analyse pourra produire son propre
marquage en s&#8217;appuyant sur les analyses pr&#233;c&#233;dentes : les formalismes propos&#233;s permettent de
sp&#233;cifier des contraintes sur les annotations existantes par unification. La plate-forme favorise
ainsi l&#8217;abstraction progressive des formes de surface. Chaque palier d&#8217;analyse pouvant acc&#233;-
der simultan&#233;ment aux annotations produites par tous les paliers ant&#233;rieurs, les analyseurs de
plus haut niveau sont g&#233;n&#233;ralement conduits &#224; s&#8217;abstraire progressivement du mat&#233;riau textuel
pour ne plus reposer que sur des repr&#233;sentations symboliques ant&#233;rieurement calcul&#233;es.
Un autre aspect important concerne la variabilit&#233; du grain d&#8217;analyse au cours du traitement.
De nombreux mod&#232;les d&#8217;analyse imposent la d&#233;finition d&#8217;un grain d&#8217;analyse minimal, dit &#171; je-
ton &#187; ou token. C&#8217;est par exemple le cas de toute grammaire ou transducteur : ces formalismes
supposent l&#8217;existence d&#8217;une unit&#233; textuelle (comme le caract&#232;re ou le mot) &#224; laquelle s&#8217;ap-
pliquent les patrons. Quand la d&#233;finition de ce grain minimal est n&#233;cessaire au fonctionnement
d&#8217;un composant, la plate-forme permet de sp&#233;cifier localement le ou les types d&#8217;unit&#233;s &#224; consi-
d&#233;rer comme jetons. Toute unit&#233; pr&#233;alablement d&#233;limit&#233;e peut jouer ce r&#244;le : il pourra s&#8217;agir
du d&#233;coupage habituel en mots, mais aussi de toute autre unit&#233; ayant &#233;t&#233; pr&#233;alablement mar-
qu&#233;e : syntagmes, phrases, cadres du discours, etc. Le grain minimal peut donc &#234;tre diff&#233;rent
pour chaque palier de l&#8217;analyse, ce qui augmente consid&#233;rablement la port&#233;e des diff&#233;rents mo-
d&#232;les d&#8217;analyses utilisables dans la plate-forme. D&#8217;autre part, chaque module d&#8217;analyse sp&#233;cifie
les marquages ant&#233;rieurs auxquels il souhaite faire r&#233;f&#233;rence, pouvant ainsi ne tenir compte
que des marquages qu&#8217;il estime pertinents, et donc s&#8217;affranchir partiellement de la lin&#233;arit&#233; du
texte. La combinaison de ces fonctionnalit&#233;s permet d&#8217;adopter un point de vue sur le document
sp&#233;cifique &#224; chaque &#233;tape d&#8217;une cha&#238;ne de traitement.
La modularit&#233; des cha&#238;nes de traitements favorise quant &#224; elle la r&#233;utilisabilit&#233; des compo-
sants dans des contextes diff&#233;rents : un module d&#8217;analyse d&#233;velopp&#233; au sein d&#8217;une premi&#232;re
cha&#238;ne pourra &#234;tre r&#233;utilis&#233; dans d&#8217;autres cha&#238;nes. De fa&#231;on similaire, toute cha&#238;ne pourra &#234;tre
r&#233;utilis&#233;e en tant que constituant d&#8217;une cha&#238;ne de plus haut niveau, sous forme de &#171; macro-
composant &#187;. R&#233;ciproquement, pour une cha&#238;ne donn&#233;e, on pourra substituer &#224; un composant
tout autre composant fonctionnellement &#233;quivalent. Pour une sous-t&#226;che donn&#233;e, un prototype
rudimentaire pourra &#234;tre remplac&#233; in fine par un &#233;quivalent pleinement op&#233;rationnel. Ceci rend
possible la mise en comparaison des traitements, en soumettant ces derniers &#224; des contextes
rigoureusement identiques, condition sine qua non d&#8217;une comparaison pertinente.
</p>
<p>Mod&#232;les d&#8217;analyse
Nous avons &#233;voqu&#233; plus haut quelques-uns des composants susceptibles de prendre part &#224; une
cha&#238;ne de traitement. Parmi ceux sp&#233;cifiquement d&#233;di&#233;s au TAL, on peut distinguer deux fa-
milles. La premi&#232;re regroupe les analyseurs &#171; pr&#234;ts &#224; l&#8217;emploi &#187;, d&#233;di&#233;s &#224; une t&#226;che pr&#233;cise.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>WIDL&#214;CHER Antoine, BILHAUT Fr&#233;d&#233;rik
</p>
<p>Il s&#8217;agira par exemple de l&#8217;&#233;tiquetage morpho-syntaxique, une interface avec TreeTagger &#233;tant
int&#233;gr&#233;e par d&#233;faut. Ces composants sont param&#233;trables, mais il n&#8217;est pas possible de modifier
fondamentalement leur fonctionnement. D&#8217;autres au contraire proposent un mod&#232;le d&#8217;analyse,
c&#8217;est-&#224;-dire un formalisme de repr&#233;sentation de contraintes linguistiques, &#233;ventuellement asso-
ci&#233; &#224; un mod&#232;le op&#233;ratoire, par lequel l&#8217;utilisateur peut sp&#233;cifier int&#233;gralement le traitement &#224;
op&#233;rer. Ils permettent d&#8217;exprimer des contraintes tant sur les formes de surface que sur les an-
notations ins&#233;r&#233;es par les analyseurs pr&#233;c&#233;dents. Toutes les annotations sont repr&#233;sent&#233;es sous
forme de structures de traits, et les contraintes sont syst&#233;matiquement sp&#233;cifi&#233;es par unification
sur ces structures. Quelques-uns des syst&#232;mes propos&#233;s sont :
&#8211; Un syst&#232;me appel&#233; EDCG (pour Extended-DCG), permettant de d&#233;crire des grammaires lo-
</p>
<p>cales d&#8217;unification en se basant sur la syntaxe DCG (Definite Clause Grammars) de Prolog.
Une telle grammaire peut &#234;tre d&#233;crite dans le plus pur style d&#233;claratif, bien que les sp&#233;cificit&#233;s
du langage logique restent accessibles aux utilisateurs exp&#233;riment&#233;s.
</p>
<p>&#8211; Un syst&#232;me, nomm&#233; MRE (pour Macro-Regular-Expressions), permettant de d&#233;crire des pa-
trons par transducteurs, s&#8217;appliquant aussi bien aux formes de surface qu&#8217;aux annotations
pr&#233;alablement calcul&#233;es. Sa syntaxe est similaire &#224; celle des expressions r&#233;guli&#232;res commu-
n&#233;ment utilis&#233;es en TAL et en linguistique sur corpus. Mais &#224; la diff&#233;rence de ces derni&#232;res,
ce formalisme ne s&#8217;applique pas sp&#233;cifiquement aux caract&#232;res ni aux mots, et peut porter sur
toute unit&#233; textuelle pr&#233;alablement analys&#233;e.
</p>
<p>&#8211; Un formalisme d&#8217;expression de contraintes au niveau discursif. En cours d&#8217;&#233;laboration,
DSDL (Discourse Structure Description Language), que nous d&#233;crirons plus loin, permet
l&#8217;exploration des organisations discursives par l&#8217;expression et la satisfaction de contraintes,
pouvant &#234;tre non s&#233;quentielles exprim&#233;es &#224; l&#8217;aide d&#8217;un ensemble de fonctions discursives pri-
mitives (pr&#233;sence/absence, coh&#233;rence s&#233;mantique...), et pouvant porter en particulier sur les
annotations produites en amont et sur des relations entre ces derni&#232;res.
</p>
<p>&#8211; Un syst&#232;me d&#8217;annotation &#224; partir de lexiques s&#233;mantiques, un syst&#232;me de tokenisation bas&#233;
sur des expressions r&#233;guli&#232;res (au niveau caract&#232;re), un syst&#232;me permettant de d&#233;limiter des
objets linguistiques en se basant sur le balisage XML du document, etc.
</p>
<p>3 Analyse du discours
</p>
<p>Voyons quels avantages l&#8217;analyse automatique du discours peut tirer des principes propos&#233;s.
Un premier apport significatif r&#233;sulte de l&#8217;approche par enrichissement incr&#233;mental et par abs-
traction progressive des formes de surface. S&#8217;il est naturel d&#8217;op&#233;rer au niveau de ces derni&#232;res
pour une analyse par exemple morphologique ou syntaxique, il va sans dire que l&#8217;analyse dis-
cursive ne peut s&#8217;accomoder de la diversit&#233; combinatoire apparaissant &#224; ce niveau, et qu&#8217;un
filtrage s&#8217;impose. En plus de la possibilit&#233; d&#8217;op&#233;rer la pure et simple occultation d&#8217;&#233;l&#233;ments peu
pertinents pour tel ou tel besoin interpr&#233;tatif, la plate-forme permet d&#8217;op&#233;rer ladite abstraction
de deux mani&#232;res compl&#233;mentaires. En premier lieu, l&#8217;unicit&#233; du mod&#232;le de marquage et d&#8217;an-
notation donne &#224; chaque &#233;tape d&#8217;analyse l&#8217;acc&#232;s aux repr&#233;sentations symboliques produites en
amont, et permet ainsi de ramener la diversit&#233; combinatoire de surface &#224; celle des valeurs in-
terpr&#233;t&#233;es, g&#233;n&#233;ralement moins nombreuses. En second lieu, le principe de variabilit&#233; du grain
d&#8217;analyse d&#233;j&#224; &#233;voqu&#233; permet d&#8217;exploiter au niveau discursif des mod&#232;les d&#8217;analyse habituel-
lement d&#233;di&#233;s &#224; des niveaux de granularit&#233; inf&#233;rieurs. Par exemple, des r&#232;gles EDCG pourront
aussi bien d&#233;crire des patrons syntagmatiques qu&#8217;une grammaire textuelle, selon le grain choisi.
Par ailleurs, la plate-forme propose des mod&#232;les d&#8217;analyse sp&#233;cifiquement adapt&#233;s au niveau
discursif. Le langage DSDL en particulier, s&#8217;&#233;carte des paradigmes g&#233;n&#233;ralement adopt&#233;s par
les autres formalismes (y compris MRE ou EDCG), qui reposent fondamentalement sur des prin-
cipes de lin&#233;arit&#233; (on tient compte de tous les &#233;l&#233;ments successifs) et de s&#233;quentialit&#233; (un ordre
est impos&#233;), principes souvent inadapt&#233;s au niveau discursif. En permettant l&#8217;expression de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La plate-forme LinguaStream
</p>
<p>contraintes non s&#233;quentielles et non lin&#233;aires, le formalisme DSDL autorise l&#8217;expression et la
d&#233;tection de motifs pouvant porter sur des &#233;l&#233;ments distants dans le texte, sans faire d&#8217;hypoth&#232;se
sur leur ordre, ce qui s&#8217;av&#232;re particuli&#232;rement adapt&#233; &#224; l&#8217;analyse du discours.
Afin de donner une id&#233;e plus concr&#232;te des principes m&#233;thodologiques pr&#233;sent&#233;s, envisageons &#224;
pr&#233;sent une configuration linguistique particuli&#232;re, assez repr&#233;sentative des probl&#232;mes pos&#233;s par
l&#8217;analyse discursive, en abordant le probl&#232;me de l&#8217;encadrement du discours (Charolles, 1997),
et plus particuli&#232;rement de la d&#233;tection automatique des cadres temporels. Rappelons que cette
th&#233;orie qualifie ainsi des segments textuels homog&#232;nes du point de vue d&#8217;un crit&#232;re d&#8217;interpr&#233;-
tation fix&#233; dans une expression en position d&#233;tach&#233;e en d&#233;but de phrase, dite introducteur de
cadre. L&#8217;op&#233;rationnalisation en TAL de ce mod&#232;le psycho-linguistique impose la r&#233;solution de
deux probl&#232;mes principaux : d&#233;tection des introducteurs, puis &#233;valuation de leur port&#233;e, c&#8217;est-
&#224;-dire d&#233;termination de la borne droite du cadre introduit. Bien que cette derni&#232;re t&#226;che soit
tr&#232;s probl&#233;matique dans la mesure o&#249; les crit&#232;res formels de cl&#244;ture des cadres sont difficiles &#224;
&#233;tablir, un certain nombre d&#8217;indices ont toutefois pu &#234;tre d&#233;gag&#233;s dans le cas pr&#233;cis des cadres
temporels (Bilhaut et al., 2003), que nous &#233;voquerons ci-apr&#232;s.
Le probl&#232;me de la d&#233;tection des introducteurs temporels se d&#233;cline lui-m&#234;me en deux sous-
probl&#232;mes : l&#8217;analyse des expressions temporelles, et celle des introducteurs s&#8217;appuyant sur
elles. Les principes de modularit&#233; &#233;voqu&#233;s trouvent ici leur justification, puisque nous souhai-
terons g&#233;n&#233;ralement traiter ces probl&#232;mes ind&#233;pendamment. L&#8217;analyse s&#233;mantique des expres-
sions temporelles fait l&#8217;objet d&#8217;une grammaire EDCG, exprimant des contraintes sur les r&#233;sultats
d&#8217;une analyse morpho-syntaxique pr&#233;liminaire, et associant aux expressions reconnues une re-
pr&#233;sentation de leur &#171; sens &#187; sous forme de structures de traits. Sur cette base, la d&#233;tection
des introducteurs peut &#234;tre mise en place &#224; l&#8217;aide de crit&#232;res essentiellement positionnels. Les
contraintes exprim&#233;es sont fondamentalement s&#233;quentielles : nous recherchons des zones de
texte v&#233;rifiant des motifs imposant la pr&#233;sence, dans un ordre fix&#233;, d&#8217;&#233;l&#233;ments imm&#233;diatement
successifs. Ces r&#232;gles sont donc simplement exprimables &#224; l&#8217;aide du formalisme MRE (outre
les expressions temporelles, nous exploitons ici le marquage des phrases et des connecteurs de
discours) :
</p>
<p>{type : phrase, anchor : start}
&lt;introducteur&gt;
{type : connecteur}? {tag : pre} {type : temporel} /as $t
&lt;/introducteur&gt; /sem {axe : temps, valeur : $t} &quot;,&quot;
</p>
<p>Les contraintes sur les structures de traits produites en amont (ici en gras), ainsi que sur les
formes de surface (ici, la virgule en fin de motif) permettent de d&#233;limiter l&#8217;introducteur. Nous
recherchons les &#233;l&#233;ments pr&#233;c&#233;d&#233;s d&#8217;un d&#233;but de phrase et compos&#233;s, d&#8217;un &#233;ventuel connecteur
de discours, d&#8217;une pr&#233;position et d&#8217;une expression temporelle. Le reste de l&#8217;expression corres-
pond au marquage et &#224; l&#8217;annotation produits en sortie. L&#8217;&#233;l&#233;ment reconnu aura le type &#171; intro-
ducteur &#187; et sera associ&#233; &#224; l&#8217;annotation s&#233;mantique qui lui fait suite. Pr&#233;cisons que la variable
$t permet de faire &#171; remonter &#187; l&#8217;information contenue dans la structure de traits associ&#233;e &#224;
l&#8217;expression temporelle, pour un usage ult&#233;rieur.
Pour la d&#233;termination de la port&#233;e de l&#8217;introducteur, la m&#233;thode pr&#233;sent&#233;e dans (Bilhaut et al.,
2003) s&#8217;appuie sur des crit&#232;res &#233;nonciatifs tels que la coh&#233;sion des temps verbaux, sur la struc-
turation en paragraphes, et sur des calculs s&#233;mantiques de coh&#233;rence entre l&#8217;introducteur et les
autres expressions temporelles. La nature de ces contraintes diff&#232;re radicalement des pr&#233;c&#233;-
dentes. D&#8217;une part, nous pouvons d&#233;sormais nous abstraire de la lin&#233;arit&#233; du texte : contraire-
ment &#224; une approche par expressions r&#233;guli&#232;res, nous pouvons ici ignorer un certain nombre
d&#8217;&#233;l&#233;ments du flot textuel. D&#8217;autre part, s&#8217;il existe bien des contraintes interpr&#233;tatives entre
l&#8217;introducteur et certains &#233;l&#233;ments de la zone introduite, il n&#8217;est pas souhaitable de concevoir
ces contraintes comme imposant un ordre strict entre ces &#233;l&#233;ments. Pour l&#8217;expression de telles
contraintes &#224; la fois non lin&#233;aires et non s&#233;quentielles, nous disposons du formalisme DSDL</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>WIDL&#214;CHER Antoine, BILHAUT Fr&#233;d&#233;rik
</p>
<p>et pouvons formuler la &#171; grammaire &#187; ci-dessous. Nous recherchons une unit&#233; textuelle com-
pos&#233;e de phrases compl&#232;tes, commen&#231;ant par un &#233;l&#233;ment identifi&#233; comme introducteur et ne
comportant pas d&#8217;autre &#233;l&#233;ment de ce type, dont tous le verbes sont au m&#234;me temps, et au sein
de laquelle les expressions temporelles portent sur une plage comprise dans l&#8217;intervalle fix&#233; par
l&#8217;introducteur, en ne retenant que le plus long des candidats partageant un m&#234;me introducteur.
</p>
<p>Rule {type : &quot;cadre&quot;} :
start({type : &quot;introducteur&quot;})
end({type : &quot;phrase&quot;})
homogeneity(comparator : port&#233;e)
not presence(pattern : {type : &quot;intro&quot;}, amount : 2)
size(mode : #LONGEST)
</p>
<p>Comparator port&#233;e ({type : &quot;verbe&quot;} as $v1, {type : &quot;verbe&quot;} as $v2) :
$v1/temps = $v2/temps
</p>
<p>Comparator port&#233;e ({type : &quot;intro&quot;} as $i, {type : &quot;tempo&quot;} as $t) :
($t/debut &gt;= $i/debut) and ($t/fin &lt;= $i/fin)
</p>
<p>Il est ainsi possible, &#224; l&#8217;aide des principes m&#233;thodologiques promus par la plate-forme, et en
nous appuyant sur la compl&#233;mentarit&#233; des mod&#232;les d&#8217;analyse, de mettre en place un analyseur
de cadres temporels, certes encore imparfait, mais ne faisant usage que de formalismes pure-
ment d&#233;claratifs propices &#224; la capitalisation de l&#8217;expertise linguistique mise en &#339;uvre.
</p>
<p>4 Conclusion
</p>
<p>Initialement d&#233;velopp&#233;e dans le cadre du projet GeoSem2, la plate-forme &#233;volue maintenant
ind&#233;pendamment. Elle est aujourd&#8217;hui utilis&#233;e dans le cadre d&#8217;un projet TCAN3, de diff&#233;rents
travaux de recherche en TAL, notamment en analyse s&#233;mantique du discours : organisation
th&#233;matique (Bilhaut, 2004), ou rh&#233;torique (Widl&#246;cher, 2004). Le logiciel est &#233;galement utilis&#233; &#224;
des fins p&#233;dagogiques au GREYC et &#224; l&#8217;ERSS, et a &#233;t&#233; mis &#224; la disposition de laboratoires tels que
LIUPPA ou LATTICE. La plate-forme reste en elle-m&#234;me ind&#233;pendante des mod&#232;les d&#8217;analyse
utilis&#233;s, pour peu qu&#8217;ils partagent le m&#234;me syst&#232;me de marquage et d&#8217;annotation, et il est donc
envisageable d&#8217;int&#233;grer des modules exploitant d&#8217;autres mod&#232;les d&#8217;analyse.
</p>
<p>R&#233;f&#233;rences
BILHAUT F. (2004). Analyse automatique de la structure th&#233;matique du discours pour la navigation
documentaire. In Journ&#233;e ATALA &#171; Mod&#233;liser et d&#233;crire l&#8217;organisation discursive &#224; l&#8217;heure du document
num&#233;rique &#187;.
BILHAUT F., HO-DAC M., BORILLO A., CHARNOIS T., ENJALBERT P., DRAOULEC A. L., MATHET
Y., MIGUET H., P&#201;RY-WOODLEY M.-P. &amp; SARDA L. (2003). Indexation discursive pour la navi-
gation intradocumentaire : cadres temporels et spatiaux dans l&#8217;information g&#233;ographique. In Actes de
Traitement Automatique du Langage Naturel (TALN), Batz-sur-Mer, France.
BILHAUT F. &amp; WIDL&#214;CHER A. (2005). La plate-forme LinguaStream. In Journ&#233;e ATALA &#171; Architec-
tures logicielles pour articuler les traitements sur corpus &#187;.
CHAROLLES M. (1997). L&#8217;encadrement du discours : Univers, champs, domaines et espaces. Cahier de
Recherche Linguistique no 6. Universit&#233; de Nancy 2.
WIDL&#214;CHER A. (2004). Analyse macro-s&#233;mantique : vers une analyse rh&#233;torique du discours. In Actes
de RECITAL 2004, p. 183&#8211;188, F&#232;s, Maroc.
</p>
<p>2&#171; Traitement s&#233;mantique de l&#8217;information g&#233;ographique &#187;, programme CNRS &#171; Soci&#233;t&#233; de l&#8217;information &#187;.
3&#171; Intervalles temporels et applications &#224; la linguistique textuelle &#187;, projet interdisciplinaire du CNRS.</p>

</div></div>
</body></html>