<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traduction de termes biom&#233;dicaux par inf&#233;rence de transducteurs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Traduction de termes biom&#233;dicaux par inf&#233;rence de
transducteurs
</p>
<p>Vincent Claveau (1), Pierre Zweigenbaum (2, 3 &amp; 4)
(1) OLST - Universit&#233; de Montr&#233;al
</p>
<p>CP 6128 succ. Centre-Ville
Montr&#233;al, QC, H3C 3J7, Canada
vincent.claveau@umontreal.ca
</p>
<p>(2) AP-HP, STIM/DSI, H&#244;pital Broussais,
96, rue Didot, 75674 Paris cedex 14
</p>
<p>(3) INSERM, U729, 15, rue de l&#8217;&#201;cole de M&#233;decine, 75006 Paris
(4) INaLCO, CRIM, 2, rue de Lille, 75343 Paris cedex 07
</p>
<p>pz@biomath.jussieu.fr
</p>
<p>Mots-clefs : Traduction automatique de termes, terminologie biom&#233;dicale, apprentis-
sage artificiel, inf&#233;rence de transducteurs
</p>
<p>Keywords: Automatic translation of terms, biomedical terminology, machine
learning, transducer induction
</p>
<p>R&#233;sum&#233; Cet article propose et &#233;value une m&#233;thode de traduction automatique de termes
biom&#233;dicaux simples du fran&#231;ais vers l&#8217;anglais et de l&#8217;anglais vers le fran&#231;ais. Elle repose
sur une technique d&#8217;apprentissage artificiel supervis&#233;e permettant d&#8217;inf&#233;rer des transducteurs
&#224; partir d&#8217;exemples de couples de termes bilingues ; aucune autre ressource ou connaissance
n&#8217;est requise. Ces transducteurs, capturant les grandes r&#233;gularit&#233;s de traduction existant dans le
domaine biom&#233;dical, sont ensuite utilis&#233;s pour traduire de nouveaux termes fran&#231;ais en anglais
et vice versa. Les &#233;valuations men&#233;es montrent que le taux de bonnes traductions de notre
technique se situe entre 52 et 67%. &#192; travers un examen des erreurs les plus courantes, nous
identifions quelques limites inh&#233;rentes &#224; notre approche et proposons quelques pistes pour les
d&#233;passer. Nous envisageons enfin plusieurs extensions &#224; ce travail.
</p>
<p>Abstract This paper presents and evaluates a method to automatically translate simple
terms from French into English and English into French in the biomedical domain. It relies on
a machine-learning technique that infers transducers from examples of bilingual pairs of terms;
no additional resources or knowledge is needed. Then, these transducers, making the most
of high translation regularities in the biomedical domain, can be used to translate new French
terms into English or vice versa. Evaluations reported show that our technique achieves good
successful translation rates (between 52 and 67%). When examining at the most frequent errors
made, some inherent limits of our approach are identified, and several avenues are proposed in
order to bypass them. Finally, some perspectives are put forward to extend this work.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau et Pierre Zweigenbaum
</p>
<p>1 Introduction
</p>
<p>Dans le domaine biom&#233;dical, l&#8217;&#233;volution rapide des connaissances et la pr&#233;dominance de l&#8217;an-
glais comme langue de communication rendent cruciales les probl&#233;matiques de production et
de gestion de ressources terminologiques multilingues. Dans ce cadre, la traduction de termino-
logies existantes (par exemple le th&#233;saurus MeSH), dont fait l&#8217;objet cet article, rev&#234;t une grande
importance. Par ailleurs, outre leur utilit&#233; pour les professionnels du domaine, les ressources
terminologiques multilingues sont aussi essentielles &#224; beaucoup d&#8217;applications du TAL et plus
particuli&#232;rement pour la traduction automatique. En effet, l&#8217;un des probl&#232;mes majeurs de cette
derni&#232;re, lorsqu&#8217;elle est appliqu&#233;e &#224; des textes sp&#233;cialis&#233;s, est l&#8217;absence de ressources de traduc-
tion (terminologies ou corpus align&#233;s) portant sur le domaine. Ainsi, les exp&#233;riences men&#233;es par
P. Langlais et M. Carl (2004) montrent que, dans certains textes, 35% des phrases contiennent
au moins un mot inconnu de leur syst&#232;me de traduction g&#233;n&#233;raliste. Les auteurs montrent que
ces mots sont en fait des termes du domaine d&#8217;&#233;tude et soulignent donc l&#8217;importance de disposer
de ressources terminologiques multilingues pour mener &#224; bien ces t&#226;ches de traduction.
</p>
<p>Dans cet article, nous pr&#233;sentons et &#233;valuons une m&#233;thode automatique tentant de r&#233;pondre &#224;
ces besoins dans un cadre toutefois restreint. Cette m&#233;thode doit permettre de produire des tra-
ductions de termes simples (i.e. compos&#233;s d&#8217;un seul mot) du domaine biom&#233;dical d&#8217;une langue
source dans une langue cible. Les exp&#233;riences rapport&#233;es ici portent sur la traduction du fran&#231;ais
vers l&#8217;anglais et de l&#8217;anglais vers le fran&#231;ais. Ce travail repose sur deux hypoth&#232;ses majeures :
</p>
<p>1. dans le domaine biom&#233;dical, les termes simples en anglais et fran&#231;ais sont en majorit&#233;
morphologiquement proches ;
</p>
<p>2. les diff&#233;rences entre termes de chaque langue sont r&#233;guli&#232;res et peuvent &#234;tre apprises
automatiquement.
</p>
<p>Ces deux hypoth&#232;ses tirent parti du fait que les termes biom&#233;dicaux fran&#231;ais et anglais sont
construits sur les m&#234;mes racines grecques et latines, et leurs d&#233;rivations tr&#232;s r&#233;guli&#232;res (e.g. oph-
talmorragie/ophthalmorrhagia, ophtalmoplastie/ophthalmoplasty, leucorragie/leukorrhagia).
Notre approche s&#8217;appuie sur une technique d&#8217;apprentissage artificiel qui nous permet d&#8217;inf&#233;rer
un classifieur &#224; partir de couples de termes fran&#231;ais-anglais traduction l&#8217;un de l&#8217;autre et mor-
phologiquement proches. C&#8217;est ce classifieur qui, &#233;tant donn&#233;s en entr&#233;e des termes fran&#231;ais,
doit ensuite permettre de produire les termes anglais correspondants ou inversement. Plus pr&#233;-
cis&#233;ment, dans notre cas, le classifieur est un transducteur (cf. section suivante) et nous utilisons
donc une technique existante d&#8217;inf&#233;rence de transducteurs pour le g&#233;n&#233;rer &#224; partir d&#8217;exemples
de couples de termes bilingues. Il est int&#233;ressant de noter qu&#8217;&#224; part cette phase de supervision,
aucune autre connaissance, ni intervention humaine n&#8217;est requise.
</p>
<p>Peu de travaux se placent dans le cadre de la traduction directe de termes. On peut n&#233;anmoins
citer les travaux de S. Schulz et al. (2004) de traduction de termes biom&#233;dicaux du portugais
vers l&#8217;espagnol fond&#233;s sur une analyse morphologique et l&#8217;utilisation de r&#232;gles de r&#233;&#233;criture
fournies manuellement. Cependant, des probl&#233;matiques proches sont souvent abord&#233;es dans le
domaine de la traduction automatique de textes. Ainsi, l&#8217;acquisition de cognats (couples de mots
bilingues de formes proches) (Fluhr et al., 2000, inter alia) s&#8217;appuie sur des op&#233;rations mor-
phologiques simples (distance d&#8217;&#233;dition, plus longue sous-cha&#238;ne commune) pour aligner des
mots dans un corpus bilingue. Les transducteurs sont &#233;galement parfois utilis&#233;s pour la traduc-
tion non pas de termes, mais de textes sous forme de cha&#238;nes de mots (Knight &amp; Al-Onaizan,
1998) ou d&#8217;arbres syntaxiques (Knight &amp; Graehl, 2005) ; les techniques de construction des
transducteurs propos&#233;es dans ce cadre n&#8217;assurent cependant pas la m&#234;me capacit&#233; &#224; traiter des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction de termes biom&#233;dicaux par inf&#233;rence de transducteurs
</p>
<p>s&#233;quences inconnues que celle que nous pr&#233;sentons ci-apr&#232;s. D&#8217;autres travaux reposent quant &#224;
eux sur des techniques statistiques de cooccurrences pour trouver des alignements entre mots ou
termes dans des corpus align&#233;s (Ahrenberg et al., 2000; Gale &amp; Church, 1991) ou comparables
(Fung &amp; McKeown, 1997). Outre le probl&#232;me de la raret&#233; de corpus sp&#233;cialis&#233;s align&#233;s, ces
approches diff&#232;rent de la n&#244;tre en cela qu&#8217;il s&#8217;agit pour ces auteurs de retrouver une traduction
d&#8217;un mot dans un texte (mise en relation), alors que nous nous posons dans le cadre plus strict
de la traduction (g&#233;n&#233;ration). Mentionnons enfin les travaux sur la translitt&#233;ration, notamment
du katakana ou de l&#8217;arabe (Tsuji et al., 2002; Knight &amp; Graehl, 1998, par exemple). Les tech-
niques utilis&#233;es dans ceux-ci sont parfois proches de celle propos&#233;e ici, mais ne concernent que
la repr&#233;sentation d&#8217;imports dans des langues ayant un alphabet diff&#233;rent de la langue source.
</p>
<p>La section suivante pr&#233;sente la technique que nous utilisons pour inf&#233;rer des transducteurs.
Nous d&#233;crivons ensuite en section 3 la m&#233;thodologie employ&#233;e pour nos exp&#233;rimentations et
les donn&#233;es utilis&#233;es. La section 4 d&#233;taille d&#8217;un point de vue quantitatif et qualitatif les r&#233;sultats
obtenus et nous concluons en donnant quelques perspectives ouvertes par ce travail.
</p>
<p>2 Inf&#233;rence de transducteurs
</p>
<p>D&#8217;un point de vue g&#233;n&#233;ral, un transducteur est un outil qui permet d&#8217;accepter en entr&#233;e des
s&#233;quences d&#8217;un certain langage (langage &#233;tant pris ici au sens le plus large) et de produire en
sortie les s&#233;quences associ&#233;es dans un autre langage. L&#8217;emploi de ce type d&#8217;outils &#224; des t&#226;ches
de traduction en langage naturel semble donc &#233;vident. Cependant, en pratique, la complexit&#233;
des relations entre langue d&#8217;entr&#233;e et langue de sortie impose deux importantes limites &#224; leur
utilisation :
</p>
<p>1. l&#8217;expressivit&#233; des transducteurs n&#8217;est pas assez importante pour repr&#233;senter certains ph&#233;-
nom&#232;nes complexes de traduction ;
</p>
<p>2. la construction des transducteurs pour ce type de t&#226;che est trop complexe pour &#234;tre men&#233;e
manuellement.
</p>
<p>Ces deux raisons expliquent pourquoi ce type de techniques est en pratique peu employ&#233;e en
dehors de t&#226;ches restreintes.
</p>
<p>Dans le travail que nous pr&#233;sentons ici, ces deux probl&#232;mes cruciaux sont att&#233;nu&#233;s par le fait
que notre t&#226;che de traduction est limit&#233;e : nous tentons de traduire des termes simples, dans
un domaine restreint, entre des langues proches. Par ailleurs, pour ce qui est de la premi&#232;re
limite cit&#233;e ci-dessus, les types de transducteurs que nous utilisons sont relativement expressifs
(cf. sous-section suivante) et les r&#233;sultats pr&#233;sent&#233;s en section 4 semblent indiquer qu&#8217;ils sont
adapt&#233;s &#224; notre t&#226;che. De plus, ces transducteurs ne sont pas construits manuellement mais
inf&#233;r&#233;s automatiquement &#224; l&#8217;aide d&#8217;un algorithme d&#8217;apprentissage artificiel (voir Cornu&#233;jols &amp;
Miclet (2002) pour une introduction) d&#233;velopp&#233; par J. Oncina (1991) et nomm&#233; OSTIA (cf.
section 2.2). C&#8217;est ce dernier point qui fait l&#8217;originalit&#233; de ce travail et permet de contourner la
seconde limite &#233;nonc&#233;e ci-dessus.
</p>
<p>2.1 Transducteurs sous-s&#233;quentiels
</p>
<p>Les transducteurs inf&#233;r&#233;s par OSTIA &#8212; utilis&#233;s pour traduire nos termes biom&#233;dicaux &#8212; sont
une extension des transducteurs classiques appel&#233;s transducteurs sous-s&#233;quentiels. Des d&#233;fi-
nitions formelles de ces objets peuvent &#234;tre trouv&#233;es dans (Oncina et al., 1993) ; nous n&#8217;en</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau et Pierre Zweigenbaum
</p>
<p>donnons ci-dessous que des descriptions g&#233;n&#233;rales.
</p>
<p>Les transducteurs sont des machines &#224; &#233;tats finis que l&#8217;on peut voir comme des graphes dans
lesquels un symbole d&#8217;entr&#233;e et une s&#233;quence de sortie sont associ&#233;s &#224; chaque arc. Un trans-
ducteur a un &#233;tat initial et un ou plusieurs &#233;tats finals. Intuitivement, un transducteur est donc
un automate auquel on associe des s&#233;quences de sortie aux symboles d&#8217;entr&#233;e sur les arcs. Une
s&#233;quence d&#8217;entr&#233;e E est reconnue ou accept&#233;e s&#8217;il existe une suite d&#8217;arcs partant de l&#8217;&#233;tat initial
et arrivant &#224; un &#233;tat final telle que les symboles d&#8217;entr&#233;e, concat&#233;n&#233;s dans l&#8217;ordre de parcours de
ces arcs, forment exactement E. La traduction d&#8217;une s&#233;quence d&#8217;entr&#233;e E correspond &#224; la conca-
t&#233;nation, dans l&#8217;ordre, de toutes les s&#233;quences de sortie des arcs travers&#233;s pour la reconnaissance
de E.
</p>
<p>Un transducteur s&#233;quentiel est un transducteur dans lequel tous les &#233;tats sont finals, et o&#249; il est
impossible d&#8217;avoir deux arcs sortant d&#8217;un m&#234;me &#233;tat ayant le m&#234;me symbole d&#8217;entr&#233;e. Cette
derni&#232;re propri&#233;t&#233; est celle qui assure le d&#233;terminisme des traductions issues de ces transduc-
teurs. Enfin, un transducteur sous-s&#233;quentiel est un transducteur s&#233;quentiel dans lequel &#224; chaque
&#233;tat est associ&#233;e une s&#233;quence de sortie. Celle-ci est produite lorsque la s&#233;quence d&#8217;entr&#233;e se
termine sur l&#8217;&#233;tat ; c&#8217;est ce qui rend les transducteurs sous-s&#233;quentiels relativement expressifs.
</p>
<p>La figure 1 pr&#233;sente un transducteur sous-s&#233;quentiel simple avec les notations habituelles des
automates. Il repr&#233;sente la fonction de traduction qui fait correspondre un mot d&#8217;entr&#233;e vide &#224;
la s&#233;quence de sortie D, a(bc)n &#224; A(BC)nE et a(bc)nb &#224; A(BC)nBF . En revanche, un mot
comme abca n&#8217;est pas reconnu, et donc non traduit par ce transducteur.
</p>
<p>/D a/A b/B 
</p>
<p>c/C
</p>
<p>/E /F
</p>
<p>FIG. 1 &#8211; Exemple de transducteur sous-s&#233;quentiel
</p>
<p>Dans notre cas, les s&#233;quences d&#8217;entr&#233;e sont soit les termes biom&#233;dicaux en fran&#231;ais, vus comme
des suites de lettres, et les s&#233;quences de sortie sont les termes correspondants en anglais, soit
l&#8217;inverse.
</p>
<p>2.2 Algorithme OSTIA
</p>
<p>L&#8217;inf&#233;rence de transducteurs est une technique d&#8217;apprentissage artificiel symbolique supervi-
s&#233;e. Elle permet d&#8217;inf&#233;rer, c&#8217;est-&#224;-dire de produire automatiquement, un classifieur &#224; partir
d&#8217;exemples de couples s&#233;quence d&#8217;entr&#233;e/s&#233;quence de sortie ; dans notre cas, ce sont des couples
de termes biom&#233;dicaux fran&#231;ais-anglais. Ce classifieur est un transducteur qui reconna&#238;t toutes
les s&#233;quences d&#8217;entr&#233;e exemples et les traduit correctement en leur s&#233;quence de sortie corres-
pondante, mais doit aussi id&#233;alement &#234;tre capable de produire la sortie correcte d&#8217;une cha&#238;ne
d&#8217;entr&#233;e inconnue appartenant au m&#234;me langage que les s&#233;quences d&#8217;entr&#233;e exemples. Les m&#233;-
canismes de traduction des s&#233;quences d&#8217;entr&#233;e en s&#233;quences de sortie doivent donc &#234;tre suffi-
samment r&#233;guliers pour permettre &#224; l&#8217;algorithme d&#8217;apprentissage de g&#233;n&#233;raliser les exemples ;
on parle alors de saut inductif. Dans les travaux que nous pr&#233;sentons ici, cette phase d&#8217;inf&#233;rence
est mise en &#339;uvre par l&#8217;algorithme OSTIA.
</p>
<p>Cet algorithme d&#8217;inf&#233;rence est formellement pr&#233;sent&#233; par J. Oncina (1991), nous n&#8217;en d&#233;cri-
vons ici que le principe g&#233;n&#233;ral de fonctionnement. Nous l&#8217;illustrons &#224; l&#8217;aide d&#8217;un exemple :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction de termes biom&#233;dicaux par inf&#233;rence de transducteurs
</p>
<p>nous cherchons &#224; apprendre le transducteur pr&#233;c&#233;dent (figure 1) avec les six exemples sui-
vants : {&#178;/D, a/AE, ab/ABF, abc/ABCE, abcb/ABCBF, abcbc/ABCBCE} o&#249; &#178; repr&#233;sente
la cha&#238;ne vide. L&#8217;algorithme OSTIA se d&#233;roule en trois &#233;tapes (Oncina, 1998) :
</p>
<p>1. un arbre des pr&#233;fixes de toutes les s&#233;quences d&#8217;entr&#233;e du jeu d&#8217;entra&#238;nement est construit.
Des cha&#238;nes vides sont assign&#233;es &#224; tous les n&#339;uds et arcs internes de cet arbre, et &#224; chaque
n&#339;ud feuille est associ&#233;e la s&#233;quence de sortie correspondant &#224; la s&#233;quence d&#8217;entr&#233;e re-
connue par cette branche (cf. figure 2).
</p>
<p>2. tous les pr&#233;fixes communs des s&#233;quences de sortie sont ensuite remont&#233;s des feuilles vers
la racine de l&#8217;arbre (figure 3).
</p>
<p>/D /AE /ABF /ABCBF/ABCE
</p>
<p>/ABCBCE
</p>
<p>a/ b/ b/c/ c/
FIG. 2 &#8211; Transducteur apr&#232;s l&#8217;&#233;tape 1
</p>
<p>/D /E /F /F/E /E
</p>
<p>a/A b/B b/Bc/C c/C
FIG. 3 &#8211; Transducteur apr&#232;s l&#8217;&#233;tape 2
</p>
<p>3. enfin, en partant de la racine, tous les n&#339;uds sont consid&#233;r&#233;s deux &#224; deux et fusionn&#233;s si le
transducteur r&#233;sultant n&#8217;entre pas en contradiction avec les donn&#233;es du jeu d&#8217;entra&#238;nement
(figures 4 et 5). L&#8217;ordre de ces tentatives de fusion est g&#233;n&#233;ralement indiqu&#233; par une fonc-
tion heuristique. Il est possible de repousser des s&#233;quences de sortie vers les feuilles pour
permettre des fusions. Quand plus aucune fusion n&#8217;est possible, l&#8217;algorithme termine.
</p>
<p>/D /E /F /F/E 
</p>
<p>a/A b/B
</p>
<p>b/B
</p>
<p>c/C
c/C
</p>
<p>FIG. 4 &#8211; Transducteur apr&#232;s une fusion
</p>
<p>/D /E /F /E 
</p>
<p>a/A b/B
b/B
</p>
<p>c/C
</p>
<p>FIG. 5 &#8211; Transducteur apr&#232;s deux fusions
</p>
<p>C&#8217;est bien s&#251;r cette derni&#232;re &#233;tape qui assure le pouvoir inductif du transducteur, puisqu&#8217;elle
assure de reconna&#238;tre et traduire correctement tous les couples exemples, mais permet &#233;galement
de reconna&#238;tre et traduire de nouvelles s&#233;quences d&#8217;entr&#233;e. Il a &#233;t&#233; montr&#233; formellement que cet
algorithme converge et produit un transducteur d&#233;crivant le concept de traduction repr&#233;sent&#233;
par l&#8217;&#233;chantillon de donn&#233;es pair&#233;es constituant le jeu d&#8217;entra&#238;nement (Oncina, 1991). OSTIA a
d&#233;j&#224; &#233;t&#233; appliqu&#233; &#224; de nombreuses t&#226;ches avec succ&#232;s, dont la traduction de phrases en langage
contr&#244;l&#233; (structures et vocabulaires restreints) (Oncina, 1998).
</p>
<p>3 Exp&#233;rimentations
</p>
<p>Nous pr&#233;sentons tout d&#8217;abord les donn&#233;es utilis&#233;es pour nos exp&#233;rimentations et la fa&#231;on dont
elles ont &#233;t&#233; pr&#233;par&#233;es. Nous d&#233;crivons ensuite le cadre m&#233;thodologique des exp&#233;riences d&#8217;in-
f&#233;rence que nous avons men&#233;es &#224; partir de ces donn&#233;es.
</p>
<p>3.1 Constitution des donn&#233;es d&#8217;apprentissage et d&#8217;&#233;valuation
</p>
<p>Les donn&#233;es que nous utilisons pour &#233;valuer notre technique sont issues d&#8217;un dictionnaire m&#233;di-
cal fran&#231;ais en ligne (Dictionnaire M&#233;dical Masson, http://www.atmedica.com) contenant pour
certaines de ses entr&#233;es les termes anglais &#233;quivalents. Parmi toutes les entr&#233;es, nous ne rete-
nons que celles qui sont des mots simples &#224; la fois en fran&#231;ais et en anglais (absence d&#8217;espace et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau et Pierre Zweigenbaum
</p>
<p>de tiret), ne contenant pas de majuscules (pour &#233;viter les noms propres) et d&#8217;une longueur mini-
male de 8 lettres (pour &#233;viter les acronymes et se focaliser sur des termes techniques, contenant
plusieurs morphes). Ce sont ainsi environ 12 000 paires de termes fran&#231;ais-anglais qui sont
obtenues des 35 000 entr&#233;es du dictionnaire.
</p>
<p>Pour se focaliser sur les termes qui sont morphologiquement proches, la similarit&#233; formelle de
chaque paire a &#233;t&#233; &#233;valu&#233;e &#224; l&#8217;aide d&#8217;une distance d&#8217;&#233;dition normalis&#233;e par la longueur des mots.
Les paires sont class&#233;es dans une liste selon ce score en ordre d&#233;croissant de similarit&#233; :
</p>
<p>1.00|zirconium|zirconium
...
</p>
<p>0.93|ophtalmotoxine|ophthalmotoxin
0.93|ophtalmologiste|ophthalmologist
...
</p>
<p>0.71|osch&#233;ite|oscheitis
0.71|organis&#233;|organized
...
</p>
<p>0.12|acouph&#232;ne|tinnitus
0.11|engelures|chilblain
</p>
<p>3.2 M&#233;thodologie
</p>
<p>Notre technique d&#8217;inf&#233;rence repose enti&#232;rement sur les exemples, il est donc n&#233;cessaire de ne
lui fournir pour l&#8217;entra&#238;nement que des paires effectivement morphologiquement proches, c&#8217;est-
&#224;-dire issues de la partie sup&#233;rieure de la liste tri&#233;e. Les donn&#233;es de test permettant d&#8217;&#233;valuer
notre approche peuvent quant &#224; elles &#234;tre tir&#233;es &#224; n&#8217;importe quel niveau de la liste, m&#234;me s&#8217;il
semble &#233;vident qu&#8217;on ne peut pas attendre d&#8217;un quelconque syst&#232;me des traductions correctes
des termes du bas de la liste. Aucun seuil n&#8217;apparaissant dans la distribution des mesures de
similarit&#233;, on propose deux types d&#8217;exp&#233;rience pour tenir compte de cela :
exp. 1. les paires d&#8217;entra&#238;nement et de test sont issues de la moiti&#233; sup&#233;rieure de la liste ;
exp. 2. les paires d&#8217;entra&#238;nement sont issues de la moiti&#233; sup&#233;rieure de la liste et celles de test
</p>
<p>de toute la liste.
Pour chacune des exp&#233;riences, nous testons les sens de traductions fran&#231;ais vers anglais et l&#8217;in-
verse, avec diff&#233;rentes tailles de jeux d&#8217;entra&#238;nement. Les jeux de test comportent 2000 paires
(bien entendu diff&#233;rentes des paires d&#8217;entra&#238;nement) et les processus d&#8217;inf&#233;rence et de valida-
tion sont r&#233;p&#233;t&#233;s dix fois et les r&#233;sultats moyenn&#233;s. L&#8217;exp&#233;rience 2 est une &#233;valuation dans le
pire des cas puisque les transducteurs inf&#233;r&#233;s sont test&#233;s sur des paires qui peuvent n&#8217;&#234;tre pas
morphologiquement apparent&#233;es.
</p>
<p>L&#8217;unique mesure utilis&#233;e pour rendre compte de la performance des transducteurs est la pr&#233;ci-
sion des traductions propos&#233;es. Cette pr&#233;cision est le ratio de termes de la langue source correc-
tement traduits dans la langue cible (i.e. identiques aux termes attendus). Si le terme d&#8217;entr&#233;e
n&#8217;est pas reconnu par le transducteur, il est consid&#233;r&#233; comme mal traduit.
</p>
<p>4 R&#233;sultats
</p>
<p>Cette section d&#233;taille les performances obtenues par les exp&#233;riences pr&#233;sent&#233;es ci-avant. Nous
en pr&#233;sentons d&#8217;abord les r&#233;sultats d&#8217;un point vue quantitatif puis, en sous-section 4.2, nous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction de termes biom&#233;dicaux par inf&#233;rence de transducteurs
</p>
<p>proposons un examen plus qualitatif des traductions issues des transducteurs. Enfin, &#224; la lumi&#232;re
de ces r&#233;sultats, nous mettons en &#233;vidence en sous-section 4.3 certaines limites inh&#233;rentes &#224;
notre approche.
</p>
<p>4.1 Pr&#233;cision et complexit&#233; des transducteurs inf&#233;r&#233;s
</p>
<p>La pr&#233;cision des transducteurs est mesur&#233;e pour nos deux exp&#233;riences selon le nombre
d&#8217;exemples de couples d&#8217;entra&#238;nement utilis&#233;s par OSTIA. Les figures 6 et 7 pr&#233;sentent les
courbes obtenues respectivement pour les exp&#233;riences 1 et 2, dans les deux sens de traduction.
Comme base de comparaison (baseline), nous calculons la pr&#233;cision qu&#8217;obtiendrait un syst&#232;me
de g&#233;n&#233;ration de traduction simpliste proposant pour terme cible la m&#234;me cha&#238;ne de caract&#232;res
que le terme source (traduction &#224; l&#8217;identique).
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  500  1000  1500  2000  2500  3000
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p> (%
)
</p>
<p>Nombre d&#8217;exemples
</p>
<p>Exp&#233;rience 1 Fr. &#224; Ang.
Exp&#233;rience 1 Ang. &#224; Fr.
</p>
<p>Baseline
</p>
<p>FIG. 6 &#8211; Pr&#233;cision selon le nombre d&#8217;exemples
pour l&#8217;exp. 1
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 0  500  1000  1500  2000  2500  3000
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p> (%
)
</p>
<p>Nombre d&#8217;exemples
</p>
<p>Exp&#233;rience 2 Fr. &#224; Ang.
Exp&#233;rience 2 Ang. &#224; Fr.
</p>
<p>Baseline
</p>
<p>FIG. 7 &#8211; Pr&#233;cision selon le nombre d&#8217;exemples
pour l&#8217;exp. 2
</p>
<p>On remarque tout d&#8217;abord que le sens de traduction influe peu sur la pr&#233;cision. Par ailleurs,
les r&#233;sultats qui ressortent de ces figures sont plut&#244;t bons. Pour 3000 exemples, la pr&#233;cision
est d&#8217;environ 67% pour l&#8217;exp&#233;rience 1 et 52% pour l&#8217;exp&#233;rience 2, que ce soit du fran&#231;ais vers
l&#8217;anglais ou l&#8217;inverse. Comme l&#8217;indique la baseline, beaucoup de termes sont identiques en
fran&#231;ais et en anglais, mais les r&#233;sultats des transducteurs d&#233;passent largement cette base. Le
taux de r&#233;ussite &#233;lev&#233; pour l&#8217;exp&#233;rience 2 est particuli&#232;rement int&#233;ressant puisqu&#8217;il repr&#233;sente
les r&#233;sultats de notre technique sans aucune restriction, les tests &#233;tant effectu&#233;s sur des couples
parfois morphologiquement non apparent&#233;s. Ces r&#233;sultats confirment donc le bien-fond&#233; de
notre approche, et notamment les deux hypoth&#232;ses pr&#233;sent&#233;es en introduction.
</p>
<p>Nous mesurons &#233;galement la variation de la complexit&#233; des transducteurs inf&#233;r&#233;s selon le
nombre d&#8217;exemples. Cette complexit&#233; est mesur&#233;e en fonction du nombre de n&#339;uds et d&#8217;arcs des
transducteurs (figure 8) et en temps de calcul de la phase d&#8217;inf&#233;rence (figure 9). Les informations
report&#233;es concernent l&#8217;exp&#233;rience 1, dans le sens fran&#231;ais vers l&#8217;anglais, celles des autres exp&#233;-
riences &#233;tant similaires. On constate que la complexit&#233; arcs/n&#339;uds est quasi lin&#233;aire en nombre
d&#8217;exemples, mais tr&#232;s &#233;lev&#233;e. La taille de ces transducteurs est telle qu&#8217;il n&#8217;est d&#8217;ailleurs pas
possible de les visualiser en totalit&#233;. La complexit&#233; en temps de calcul est plus probl&#233;matique
car elle augmente de mani&#232;re exponentielle avec le nombre d&#8217;exemples, ce qui peut freiner
l&#8217;utilisation de cette approche sur de plus larges jeux de donn&#233;es. N&#233;anmoins, la pr&#233;cision se
stabilisant assez rapidement, l&#8217;emploi de tels jeux de donn&#233;es semble inutile.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau et Pierre Zweigenbaum
</p>
<p> 0
</p>
<p> 20
</p>
<p> 40
</p>
<p> 60
</p>
<p> 80
</p>
<p> 100
</p>
<p> 120
</p>
<p> 140
</p>
<p> 0  500  1000  1500  2000  2500  3000
 0
</p>
<p> 500
</p>
<p> 1000
</p>
<p> 1500
</p>
<p> 2000
</p>
<p>N
om
</p>
<p>br
e 
</p>
<p>d&#8217;
&#233;t
</p>
<p>at
s
</p>
<p>N
om
</p>
<p>br
e 
</p>
<p>d&#8217;
ar
</p>
<p>cs
</p>
<p>Nombre d&#8217;exemples
</p>
<p>Nombre d&#8217;arcs
Nombre d&#8217;&#233;tats
</p>
<p>FIG. 8 &#8211; Complexit&#233; en n&#339;uds et arcs selon le
nombre d&#8217;exemples (exp. 1)
</p>
<p> 0
</p>
<p> 50
</p>
<p> 100
</p>
<p> 150
</p>
<p> 200
</p>
<p> 0  500  1000  1500  2000  2500  3000
</p>
<p>Te
m
</p>
<p>ps
 d
</p>
<p>&#8217;in
f&#233;
</p>
<p>re
nc
</p>
<p>e 
(se
</p>
<p>c.)
</p>
<p>Nombre d&#8217;exemples
</p>
<p>Exp&#233;rience 1
</p>
<p>FIG. 9 &#8211; Complexit&#233; en temps selon le nombre
d&#8217;exemples (exp. 1)
</p>
<p>4.2 Examen des r&#233;sultats
</p>
<p>Les erreurs commises par les transducteurs inf&#233;r&#233;s rel&#232;vent de diff&#233;rentes causes. Tout d&#8217;abord,
certaines sont simplement dues &#224; des termes dont la traduction n&#8217;est pas morphologiquement
proche du terme d&#8217;origine. Comme attendu, ce type d&#8217;erreur est plus particuli&#232;rement pr&#233;sent
dans l&#8217;exp&#233;rience 2 (environ 10% des erreurs).
D&#8217;autres erreurs sont dues quant &#224; elles &#224; des exceptions aux r&#233;gularit&#233;s de traduction. On
constate en effet que certaines traductions de familles de termes, bien que r&#233;guli&#232;res dans
leur majorit&#233;, pr&#233;sentent quelques cas particuliers. Ceux-ci font que les traductions pro-
pos&#233;es par les transducteurs inf&#233;r&#233;s sont incorrectes. Par exemple, les termes fran&#231;ais en
-rragie se traduisent g&#233;n&#233;ralement en -rrhagia (e.g., stomatorragie/stomatorrhagia, pneu-
morragie/pneumorrhagia...). Cependant, les couples h&#233;morragie/hemorrhage et pleurorra-
gie/pleurorrhage font exception &#224; cette r&#232;gle. Dans les exp&#233;riences report&#233;es pr&#233;c&#233;demment,
lorsqu&#8217;ils &#233;taient rencontr&#233;s dans le jeu de test, h&#233;morragie &#233;tait (incorrectement) traduit en
hemorrhagia et pleurorragie en pleurorrhagia. Il est int&#233;ressant de noter que ces termes irr&#233;gu-
liers sont g&#233;n&#233;ralement d&#8217;emploi courant, appartenant presque &#224; la langue g&#233;n&#233;rale, de laquelle
ils ont certainement acquis cette d&#233;rivation particuli&#232;re.
</p>
<p>Enfin, certaines erreurs sont dues &#224; l&#8217;apparente proximit&#233; de mots relevant de parties du discours
ou de classes s&#233;mantiques diff&#233;rentes. Par exemple, les adjectifs fran&#231;ais en -ique se traduisent
g&#233;n&#233;ralement par un terme anglais en -ic (e.g., spasmolytique/spasmolytic), alors que les noms
avec le m&#234;me suffixe se traduisent en -ics (thermodynamique/thermodynamics) ; ou encore, les
noms de discipline en -logie se traduisent en -logy (cardiologie/cardiology) et les troubles du
langage avec le m&#234;me suffixe en -logia (dyslogie/dyslogia).
</p>
<p>4.3 Limites de notre approche
</p>
<p>Les erreurs de traduction pr&#233;sent&#233;es ci-avant mettent en relief certaines limitations de notre
approche, ou plus pr&#233;cis&#233;ment de la technique d&#8217;apprentissage utilis&#233;e. Tout d&#8217;abord, on ne peut
apprendre que les r&#233;gularit&#233;s de traduction, il est donc normal que les exceptions, impr&#233;visibles
par nature, ne puissent pas &#234;tre apprises. Cependant, ces exceptions, lorsqu&#8217;elles se trouvent</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction de termes biom&#233;dicaux par inf&#233;rence de transducteurs
</p>
<p>dans le jeu d&#8217;entra&#238;nement, risquent de provoquer de mauvaises inf&#233;rences et complexifient les
transducteurs. Malheureusement, OSTIA ne sait pas rep&#233;rer ces paires irr&#233;guli&#232;res et ne permet
pas d&#8217;apprendre des classifieurs distinguant r&#232;gles g&#233;n&#233;rales et exceptions. Le m&#234;me probl&#232;me
se pose pour g&#233;rer le bruit, c&#8217;est-&#224;-dire des paires incorrectement encod&#233;es (faute d&#8217;orthographe
dans l&#8217;un des termes ou erreur de traduction). M&#234;me si ce cas s&#8217;est peu pr&#233;sent&#233; dans nos
donn&#233;es, ce crit&#232;re est &#224; consid&#233;rer si l&#8217;on souhaite employer cette m&#234;me technique sur des
paires de mots obtenues d&#8217;une source moins fiable.
</p>
<p>Une autre limite de cette technique d&#8217;apprentissage est son incapacit&#233; &#224; inclure des informations
externes lors de sa phase d&#8217;inf&#233;rence. En effet, OSTIA ne s&#8217;attache qu&#8217;&#224; la suite de lettres compo-
sant les mots pour produire un transducteur, alors que, nous l&#8217;avons constat&#233;, des informations
cat&#233;gorielles ou s&#233;mantiques permettraient de lever des ambigu&#239;t&#233;s et d&#8217;am&#233;liorer les r&#233;sultats.
D&#8217;autres techniques d&#8217;apprentissage permettent d&#8217;adjoindre ais&#233;ment ce type d&#8217;informations
suppl&#233;mentaires, comme la programmation logique inductive (Cornu&#233;jols &amp; Miclet, 2002, cha-
pitre II.2), mais ne sont pas aussi performantes qu&#8217;OSTIA pour manipuler des s&#233;quences de
lettres.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Cet article pr&#233;sente une technique de traduction de termes simples du domaine biom&#233;dical du
fran&#231;ais vers l&#8217;anglais et inversement, s&#8217;appuyant sur une technique d&#8217;apprentissage artificiel,
l&#8217;inf&#233;rence de transducteurs. Les transducteurs sont inf&#233;r&#233;s par l&#8217;algorithme OSTIA &#224; partir
d&#8217;exemples de paires de termes bilingues. Ils permettent ensuite, &#233;tant donn&#233; un terme dans
une langue, de g&#233;n&#233;rer le terme correspondant dans une autre langue. Aucune connaissance ou
ressource autre que les exemples n&#8217;est requise, laissant augurer une bonne portabilit&#233; de cette
technique &#224; d&#8217;autres paires de langues. Les &#233;valuations que nous pr&#233;sentons montrent que cette
technique obtient de bons r&#233;sultats en produisant entre 50% et 66% de traductions correctes
selon les exp&#233;riences. On note de plus que certaines des erreurs de traduction sont dues &#224; des
mots largement utilis&#233;s, relevant presque de la langue courante. Ces mots ont par cons&#233;quent
une grande chance d&#8217;appara&#238;tre dans des dictionnaires ou autres ressources de traduction, et
donc ne n&#233;cessiteront pas l&#8217;emploi de transducteurs pour les traduire.
</p>
<p>Beaucoup de perspectives sont ouvertes par ce travail. D&#8217;un point de vue technique, on peut no-
tamment envisager d&#8217;appliquer cette m&#234;me technique en consid&#233;rant les termes non plus comme
des s&#233;quences de lettres mais des s&#233;quences de morphes (e.g. broncho&#8853;pleuro&#8853;pneumo&#8853;nie).
Des syst&#232;mes d&#8217;analyse morphologique d&#233;rivationnelle et compositionnelle existent d&#233;j&#224; pour
le domaine biom&#233;dical en fran&#231;ais (Namer &amp; Zweigenbaum, 2004) et pourraient ainsi servir de
premi&#232;re &#233;tape &#224; OSTIA. Une autre extension possible porte sur la recherche de traductions de
termes complexes (&#224; plusieurs mots). En effet, si l&#8217;on dispose de la traduction individuelle de
chaque composant d&#8217;un terme complexe, on peut construire ou rechercher celle du terme pris
dans sa globalit&#233;. Mais il faut pour cela tenir compte des variations possibles de ces termes (vi-
rus de la variole/virus variolique, variola virus/variolic virus) (Jacquemin, 2001; Daille, 2003).
D&#8217;un point de vue applicatif, nous envisageons d&#8217;utiliser et d&#8217;&#233;valuer cette approche sur d&#8217;autres
paires de langues (comprenant notamment l&#8217;espagnol, le portugais, l&#8217;allemand). Enfin, notre
technique pourrait &#234;tre utilis&#233;e pour l&#8217;alignement de corpus, les syst&#232;mes existants fonctionnant
d&#8217;autant mieux que des couples de mots en relation de traduction sont connus (V&#233;ronis, 2000).
Il sera alors int&#233;ressant de mesurer le gain de cette approche par rapport &#224; une simple distance
d&#8217;&#233;dition, commun&#233;ment utilis&#233;e dans ce contexte. Elle peut m&#234;me &#234;tre utilis&#233;e pour aligner</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Claveau et Pierre Zweigenbaum
</p>
<p>directement des ressources terminologiques. Dans ces deux cas, le probl&#232;me abord&#233; est quelque
peu diff&#233;rent puisque, comme &#233;voqu&#233; en introduction, il s&#8217;agit alors de mettre en relation des
termes et non plus de produire des traductions.
</p>
<p>Remerciements
Nous tenons &#224; remercier Jos&#233; Oncina pour nous avoir donn&#233; acc&#232;s au code d&#8217;OSTIA, et Fran&#231;ois
Coste pour nous avoir fait partager son exp&#233;rience sur l&#8217;inf&#233;rence de langages r&#233;guliers.
</p>
<p>R&#233;f&#233;rences
AHRENBERG L., ANDERSSON M. &amp; MERKEL M. (2000). A knowledge-lite approach to word align-
ment, chapitre 5. In (V&#233;ronis, 2000).
CORNU&#201;JOLS A. &amp; MICLET L. (2002). Apprentissage artificiel. Paris : Eyrolles.
DAILLE B. (2003). Conceptual structuring through term variation. In Proceedings of the ACL&#8217;03 Work-
shop on Multiword Expressions: Analysis, Acquisition and Treatment, p. 9&#8211;16, Sapporo, Japon.
FLUHR C., BISSON F. &amp; ELKATEB F. (2000). Parallel text alignment using crosslingual information
retrieval techniques, chapitre 9. In (V&#233;ronis, 2000).
FUNG P. &amp; MCKEOWN K. (1997). A technical word and term translation aid using noisy parallel
corpora across language groups. Machine Translation, 12(1/2), 53&#8211;87.
GALE W. &amp; CHURCH K. (1991). Identifying word correspondences in parallel texts. In Proceedings of
the 4th Darpa Workshop on Speech and Natural Language, p. 152&#8211;157, Pacific Grove, CA, &#201;tats-Unis.
JACQUEMIN C. (2001). Spotting and Discovering Terms through NLP. Cambridge : MIT Press.
KNIGHT K. &amp; AL-ONAIZAN Y. (1998). Translation with Finite-State Devices. In Third Conference of
the Association for Machine Translation in the Americas, AMTA&#8217;98, p. 421&#8211;437, Langhorne, &#201;tats-Unis.
KNIGHT K. &amp; GRAEHL J. (1998). Machine transliteration. Computational Linguistics, 24(4), 599&#8211;612.
KNIGHT K. &amp; GRAEHL J. (2005). An Overview of Probabilistic Tree Transducers for Natural Language
Processing. In Proceedings of the 6th International Conference, CICLing 2005,, Mexico, Mexique.
LANGLAIS P. &amp; CARL M. (2004). General-purpose statistical translation engine and domain specific
texts: Would it work ? Terminology, 10(1), 131&#8211;152.
NAMER F. &amp; ZWEIGENBAUM P. (2004). Acquiring meaning for french medical terminology: contri-
bution of morpho-semantics. In Proceedings of the Conference MEDINFO 2004, San-Francisco, &#201;tats-
Unis.
ONCINA J. (1991). Aprendizaje de lenguajes regulares y transducciones subsecuenciales. Th&#232;se de
doctorat, Universidad Polit&#233;cnica de Valencia, Valence, Espagne.
ONCINA J. (1998). The data driven approach applied to the OSTIA algorithm. In Proceedings of the
Fourth International Colloquium on Grammatical Inference, ICGI&#8217;98, p. 50&#8211;56, Ames, &#201;tats-Unis.
ONCINA J., GARC&#205;A P. &amp; VIDAL E. (1993). Learning subsequential transducers for pattern regognition
interpretation tasks. IEEE Transactions on Pattern Analysis and Machine Intelligence, 15(5), 448&#8211;458.
SCHULZ S., MARK&#211; K., SBRISSIA E., NOHAMA P. &amp; HAHN U. (2004). Cognate mapping - a heuristic
strategy for the semi-supervised acquisition of a spanish lexicon from a portuguese seed lexicon. In
Proceedings of the 20th International Conference on Computational Linguistics, COLING&#8217;04, p. 813&#8211;
819, Gen&#232;ve, Suisse.
TSUJI K., DAILLE B. &amp; KAGEURA K. (2002). Extracting french-japanese word pairs from bilingual
corpora based on transliteration rules. In Proceedings of the Third International Conference on Language
Resources and Evaluation LREC&#8217;02, p. 499&#8211;502, Las Palmas de Gran Canaria, Espagne.
J. V&#201;RONIS, Ed. (2000). Parallel Text Processing. Dordrecht : Kluwer Academic Publishers.</p>

</div></div>
</body></html>