<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Etiquetage morpho-syntaxique du fran&#231;ais &#224; base d'apprentissage supervis&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Etiquetage morpho-syntaxique du fran&#231;ais &#224; base
d&#8217;apprentissage supervis&#233;
</p>
<p>Julien Bourdaillet, Jean-Gabriel Ganascia
LIP6 - Univesit&#233; Paris VI
</p>
<p>8 rue du capitaine Scott - 75015 Paris
{Julien.Bourdaillet, Jean-Gabriel.Ganascia}@lip6.fr
</p>
<p>Mots-clefs : &#233;tiquetage morpho-syntaxique, apprentissage supervis&#233;, mod&#232;le de Markov
cach&#233;, &#233;valuation, homographes
</p>
<p>Keywords: part-of-speech tagging, supervised learning, hidden Markov model, eval-
uation, homographs
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons un &#233;tiqueteur morpho-syntaxique du fran&#231;ais. Celui-ci utilise
l&#8217;apprentissage supervis&#233; &#224; travers un mod&#232;le de Markov cach&#233;. Le mod&#232;le de langage est appris
&#224; partir d&#8217;un corpus &#233;tiquet&#233;. Nous d&#233;crivons son fonctionnement et la m&#233;thode d&#8217;apprentissage.
L&#8217;&#233;tiqueteur atteint un score de pr&#233;cision de 89 % avec un jeu d&#8217;&#233;tiquettes tr&#232;s riche. Nous
pr&#233;sentons ensuite des r&#233;sultats d&#233;taill&#233;s pour chaque classe grammaticale et &#233;tudions en parti-
culier la reconnaissance des homographes.
</p>
<p>Abstract A french part-of-speech tagger is described. It is based on supervised learning:
hidden Markov model and trained using a corpus of tagged text. We describe the way the model
is learnt. A 89 % precision rate is achieved with a rich tagset. Detailed results are presented for
each grammatical class. We specially pay attention to homographs recognition.
</p>
<p>1 Introduction
</p>
<p>L&#8217;&#233;tiquetage morpho-syntaxique consiste &#224; assigner la bonne classe grammaticale, d&#233;finie sui-
vant un certain niveau de granularit&#233;, &#224; chaque mot d&#8217;un texte en entr&#233;e. Nous pr&#233;sentons ici
un &#233;tiqueteur (ou tagger) du fran&#231;ais bas&#233; sur un mod&#232;le d&#8217;apprentissage supervis&#233;. Celui-ci est
une adaptation du tagger de l&#8217;analyseur syntaxique RASP de la langue anglaise. Cet &#233;tiqueteur
apprend un mod&#232;le de langage &#224; partir d&#8217;un corpus pr&#233;alablement &#233;tiquet&#233;.
</p>
<p>Plusieurs approches ont &#233;t&#233; pr&#233;sent&#233;es pour l&#8217;&#233;tiquetage morpho-syntaxique du fran&#231;ais. Le
Brill Tagger (Brill, 92) apprend des r&#232;gles &#224; partir d&#8217;un corpus &#233;tiquet&#233; et a &#233;t&#233; adapt&#233; pour le
fran&#231;ais avec WinBrill. (Giguet, 97) et (Chanod, 95) se basent sur des propri&#233;t&#233;s de la langue
comme les mots noyaux ou des m&#233;thodes &#224; base de contraintes. (Chanod, 95) pr&#233;sente un
autre &#233;tiqueteur &#224; base d&#8217;apprentissage non-supervis&#233;, qui apprend un mod&#232;le de langage &#224; par-
tir d&#8217;un corpus non-&#233;tiquet&#233; via une variante de l&#8217;algorithme Estimation-Maximisation (EM).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Julien Bourdaillet, Jean-Gabriel Ganascia
</p>
<p>(Chanod, 95) pr&#233;sente les limites de ce mod&#232;le qui est fortement d&#233;pendant des conditions
initiales et peut rester bloqu&#233; sur un optimum local. (Stein, 95) pr&#233;sente une adapatation au
fran&#231;ais du TreeTagger. Celui-ci est bas&#233; sur un mod&#232;le de Markov cach&#233; (Hidden Markov
Model ou HMM) mod&#233;lis&#233; par un arbre de d&#233;cisions. Nous nous situons dans la lign&#233;e de ces
deux derniers travaux et utilisons &#233;galement un HMM. Toutefois puisqu&#8217;il a &#233;t&#233; prouv&#233; dans
(Elworthy, 94) que l&#8217;apprentissage d&#8217;un mod&#232;le &#224; partir d&#8217;un corpus manuellement &#233;tiquet&#233;
produit de meilleurs r&#233;sultats que la proc&#233;dure d&#8217;apprentissage d&#8217;EM et que nous disposions
d&#8217;un tel corpus, nous avons choisi cette alternative.
</p>
<p>2 Pr&#233;sentation de l&#8217;&#233;tiqueteur
</p>
<p>Nous utilisons l&#8217;&#233;tiqueteur morpho-syntaxique de l&#8217;anglais du projet RASP (Briscoe, 02). Cet
&#233;tiqueteur, d&#233;taill&#233; dans (Elworthy, 94), est bas&#233; sur HMM du premier ordre (bigramme). Celui-
ci est repr&#233;sent&#233; par un lexique des formes fl&#233;chies qui associe &#224; chaque mot ses tags potentiels
et par une matrice de transition entre &#233;tats. Nous l&#8217;avons adapt&#233; au traitement de la langue
fran&#231;aise.
</p>
<p>Nous avons utilis&#233; le corpus GRACE qui est annot&#233; morpho-syntaxiquement. Il comporte env-
iron 800.000 mots et est constitu&#233; pour moiti&#233; d&#8217;articles du Monde et pour moiti&#233; d&#8217;oeuvres
et d&#8217;essais litt&#233;raires. Ce corpus est &#233;tiquet&#233; avec un jeu de 312 &#233;tiquettes qui correspon-
dent &#224; un &#233;tiquetage tr&#232;s fin. Les mots sont tout d&#8217;abord regroup&#233;s en 12 grandes classes tr&#232;s
g&#233;n&#233;rales : adjectif, conjonction, d&#233;terminant, mot-phrase, nom, pronom, adverbe, pr&#233;position,
verbe, r&#233;sidu, ponctuation et extra-lexical. Ces classes sont ensuite affin&#233;es, comme par exem-
ple conjonction en conjonction de coordination et conjonction de subordination, verbe en verbe
auxiliaire et verbe principal. On aboutit ainsi &#224; un jeu de 36 &#233;tiquettes. Enfin, ont &#233;t&#233; adjoints
&#224; ces classes grammaticales des traits proprement morphologiques, tels que le genre, le nom-
bre, la personne, le mode ou encore le temps qui donnent le jeu de 312 &#233;tiquettes. Nous avons
ajout&#233;, pour des facilit&#233;s d&#8217;impl&#233;mentation et sans d&#233;naturer la coh&#233;rence de l&#8217;ensemble, huit
&#233;tiquettes compos&#233;es (qui existaient dans le corpus sous la forme d&#8217;une composition de deux
&#233;tiquettes) et sommes ainsi arriv&#233;s &#224; un jeu de 320 &#233;tiquettes.
Nous avons choisi d&#8217;effectuer l&#8217;apprentissage sur le corpus GRACE avec le jeu de 320 &#233;ti-
quettes. En effet, l&#8217;int&#233;r&#234;t de ce jeu est que les classes tr&#232;s fines apportent beaucoup d&#8217;informa-
tions sur les mots et permettent de se passer d&#8217;analyseur morphologique en vue d&#8217;une &#233;tape
ult&#233;rieure d&#8217;analyse en constituants.
</p>
<p>Ainsi la proc&#233;dure d&#8217;apprentissage permet d&#8217;apprendre un HMM bas&#233; sur 320 &#233;tats. Nous avons
gard&#233; la majeure partie du corpus comme donn&#233;es d&#8217;apprentissage et utilis&#233; le reste comme
donn&#233;es de test, soit environ 26.000 mots. L&#8217;entra&#238;nement du mod&#232;le a permis d&#8217;obtenir un
dictionnaire d&#8217;environ 44.000 formes fl&#233;chies.
</p>
<p>Nous avons modifi&#233; l&#8217;algorithme d&#8217;&#233;tiquetage proprement dit pour que celui-ci prenne en compte
les locutions. Pour cela, nous avons appliqu&#233; l&#8217;heuristique du motif le plus long. Au moment de
lire le texte en entr&#233;e, l&#8217;&#233;tiqueteur va chercher, gr&#226;ce au lexique, si la combinaison du mot sui-
vant au mot courant forme une locution. Si tel est le cas, on applique ce principe it&#233;rativement
avec le mot suivant jusqu&#8217;&#224; ce que l&#8217;application ne soit plus possible, auquel cas, on garde la
derni&#232;re locution trouv&#233;e. L&#8217;&#233;tiquetage de la phrase par Viterbi est ensuite effectu&#233; avec celle-ci.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etiquetage morpho-syntaxique du fran&#231;ais &#224; base d&#8217;apprentissage supervis&#233;
</p>
<p>3 Evaluation
</p>
<p>Pour &#233;valuer notre travail, nous utilisons la pr&#233;cision (proportion d&#8217;&#233;tiquetages corrects parmi
les &#233;tiquetages stricts) et la d&#233;cision (proportion d&#8217;&#233;tiquetages stricts parmi l&#8217;ensemble de tous
les &#233;tiquetages). Dans un premier temps, nous avons d&#233;velopp&#233; un script Perl charg&#233; de cette
&#233;valuation, qui sera appel&#233; par la suite EVAL. Dans un second temps nous avons r&#233;utilis&#233; la
bo&#238;te &#224; outils d&#8217;&#233;valuation des analyseurs du projet ELSE1. Notons que EVAL comporte 150
lignes de code alors que l&#8217;&#233;valuateur ELSE en comporte plusieurs milliers, m&#234;me si ce dernier
se veut plus ambitieux et traite, par exemple, divers formats de fichiers en entr&#233;e.
</p>
<p>3.1 R&#233;sultats
</p>
<p>Lors de tous nos tests, notre analyseur atteint un score de d&#233;cision de 100% et ceci pour
deux raisons. Tout d&#8217;abord, il ne renvoie qu&#8217;une seule &#233;tiquette par mot, ce qui ne g&#233;n&#232;re
pas d&#8217;&#233;tiquetage ambigu. Et ensuite, notre jeu d&#8217;&#233;tiquettes est identique &#224; celui de GRACE.
Il n&#8217;y a donc pas de probl&#232;mes de projection d&#8217;un jeu dans l&#8217;autre (ph&#233;nom&#232;ne qui entra&#238;ne
des regroupements de plusieurs &#233;tiquettes en une seule ou inversement) lors de l&#8217;utilisation de
l&#8217;&#233;valuateur ELSE.
</p>
<p>Nous avons effectu&#233; des tests avec trois niveaux de granularit&#233; de l&#8217;&#233;tiquetage. Le premier
niveau correspond au jeu complet des 320 &#233;tiquettes. Le second est ce m&#234;me jeu mais sans les
traits morphologiques, ce qui donne 36 &#233;tiquettes. Le dernier niveau est l&#8217;&#233;tiquetage le plus
g&#233;n&#233;ral en 12 grandes classes grammaticales. Dans le tableau 1 nous pr&#233;sentons les scores
de pr&#233;cision dans diff&#233;rents cas. La premi&#232;re colonne correspond &#224; l&#8217;&#233;tiquetage du corpus de
test produit par notre analyseur morpho-syntaxique avec EVAL. La deuxi&#232;me fait r&#233;f&#233;rence au
m&#234;me &#233;tiquetage mais avec l&#8217;&#233;valuateur ELSE. Et la derni&#232;re pr&#233;sente l&#8217;&#233;valuation par ELSE
de ce m&#234;me corpus de test mais &#233;tiquet&#233; par l&#8217;analyseur Cordial. En effet, ce dernier cas nous
a sembl&#233; int&#233;ressant comme &#233;l&#233;ment de comparaison puisque Cordial semble actuellement &#234;tre
le meilleur analyseur du fran&#231;ais.
</p>
<p>A partir de ces chiffres nous pouvons
EVAL ELSE ELSE / Cordial
</p>
<p>320 tags 87.65 % 89.07 % 94.44 %
36 tags 92.24 % 93.52 % 94.63 %
12 tags 94.39 % 95.69 % 97.52 %
</p>
<p>Table 1: Scores de pr&#233;cision
</p>
<p>tirer plusieurs constations. Tout d&#8217;ab-
ord remarquons qu&#8217;entre l&#8217;&#233;valuation
de notre analyseur avec EVAL et celle
avec ELSE, on a pour les trois niveaux
environ 1.5 point d&#8217;&#233;cart. Ceci vient
de la diff&#233;rence des m&#233;thodes de seg-
mentation utilis&#233;es. Avec ELSE, l&#8217;alignement entre la sortie de l&#8217;&#233;tiqueteur et le corpus cor-
rectement &#233;tiquet&#233; n&#8217;est pas tr&#232;s bon car ELSE utilise un segmenteur g&#233;n&#233;rique et non un seg-
menteur adapt&#233; &#224; l&#8217;analyseur comme EVAL. Ainsi plus de tokens ne sont pas correctement
r&#233;align&#233;s avec ELSE, comme certains mots compos&#233;s ou contenant une apostrophe. Ceux-ci ne
sont donc pas soumis &#224; &#233;valuation, ce qui tend &#224; am&#233;liorer m&#233;caniquement la pr&#233;cision. D&#8217;autre
part, cela souligne l&#8217;importance de la question de la segmentation et la difficult&#233; d&#8217;y apporter
une r&#233;ponse qui soit valide &#224; travers plusieurs formalismes. Avec EVAL, les tokens incorrecte-
ment r&#233;align&#233;s sont des mots contenant des tirets, des mots compos&#233;s et des expressions non
pr&#233;sentes dans le dictionnaire. On en compte environ 0.8 % du nombre de tokens contenus dans
le corpus de test.
</p>
<p>1http://www.limsi.fr/TLP/ELSE</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Julien Bourdaillet, Jean-Gabriel Ganascia
</p>
<p>Ensuite, avec le jeu d&#8217;&#233;tiquettes complet (320 tags) et l&#8217;&#233;valuateur ELSE, notre analyseur est
moins performant que Cordial. Cependant si l&#8217;on compare ce score avec ceux pr&#233;sent&#233;s dans
(Adda, 99), nous nous situons dans la moyenne des analyseurs &#233;valu&#233;s qui obtiennent de 82
&#224; 96 % de pr&#233;cision. De plus, notons que lors de cette campagne les meilleurs r&#233;sultats ont
&#233;t&#233; obtenus non par des &#233;tiqueteurs mais par des analyseurs syntaxiques complets. Ceux-ci
ayant un avantage certain sur les premiers pour d&#233;sambigu&#239;ser les cas les plus difficiles. En
effet, leur r&#233;solution peut &#234;tre report&#233;e au niveau syntaxique, ce qui am&#233;liore de quelques (mais
pr&#233;cieux) points la pr&#233;cision. Au vu de nos r&#233;sultats et du fait que nous nous limitons au niveau
de l&#8217;&#233;tiquetage, notre approche est int&#233;ressante vis-&#224;-vis des autres.
</p>
<p>Enfin, nous avons effectu&#233; l&#8217;&#233;valuation avec des jeux d&#8217;&#233;tiquettes plus concis. En effet, ceux-ci
se rapprochant plus des jeux utilis&#233;s par les analyseurs de l&#8217;anglais, la comparaison est rendue
possible. Notre score se situe &#233;galement dans la moyenne de ceux pr&#233;sent&#233;s dans la litt&#233;ra-
ture. Notons que dans (Briscoe, 02), donc pour RASP sur l&#8217;anglais, les auteurs atteignent
une pr&#233;cision de 97 %. Nous nous situons en dessous, ce qui laisse entrevoir des possibilit&#233;s
d&#8217;am&#233;lioration. Toutefois un tel score semble difficilement atteignable par un &#233;tiqueteur seul
pour le fran&#231;ais. En effet, du fait de sa plus grande richesse morphologique, le fran&#231;ais est plus
dur &#224; &#233;tiqueter que l&#8217;anglais. Ceci est confirm&#233;, au vu de la litt&#233;rature, par le fait que globale-
ment les scores des &#233;tiqueteurs de l&#8217;anglais sont plus &#233;lev&#233;s, de quelques (et toujours pr&#233;cieux)
points, que ceux du fran&#231;ais.
</p>
<p>3.2 Evaluation par classes
</p>
<p>Nous cherchons dans cette partie &#224; &#233;valuer les points forts et les points faibles de notre &#233;tiqueteur
de fa&#231;on plus pr&#233;cise. Dans un premier temps, nous pr&#233;sentons dans cette section les r&#233;sultats
pour chaque classe grammaticale. Dans un second temps, nous pr&#233;sentons dans la section
suivante le taux de reconnaissance des homographes.
</p>
<p>Dans le tableau 2, nous pr&#233;sentons pour chaque classe grammaticale, le nombre d&#8217;occurrences
dans le corpus de test, le pourcentage d&#8217;&#233;tiquetage correct et les trois types d&#8217;erreurs les plus
fr&#233;quentes par ordre d&#233;croissant.
</p>
<p>Occurrences % Correct Erreur 1 Erreur 2 Erreur 3
Nom 6506 95.2 % Adj / 2 % V / 0.8 % D / 0.7 %
Verbe 3184 96 % Adj / 2.4 % N / 1.1 % Prep / 0.3 %
</p>
<p>Verbe auxiliaire 669 78.5 % Vp / 21 % N / 0.1 % Adv / 0.1 %
Verbe principal 2515 92.8 % Adj / 3 % Va / 2.3 % N / 1.3 %
</p>
<p>Adjectif 1773 85.4 % V / 6.6 % N / 5.1 % Adv / 1.2 %
Pronom 1456 89.3 % C / 4.5 % D / 2 % Adv / 1.7 %
</p>
<p>D&#233;terminant 3162 94.0 % Prep / 1.8 % Pron / 1.7 % N / 1.6 %
Adverbe 1170 94.9 % C / 2.3 % Prep / 1 % N / 0.8 %
</p>
<p>Conjonction 856 97.9 % Adv / 1% Prep / 1 % Pron / 0.6 %
Pr&#233;position 3863 81.8 % D / 16.4 % Pron / 0.6 % N / 0.3 %
Ponctuation 3424 98.8 % Adv / 0.8 % Pron / 0.3 % N / 0.1 %
</p>
<p>Table 2: Scores et types d&#8217;erreurs par classes
</p>
<p>Nous consid&#233;rons que les classes pr&#233;sentant un taux sup&#233;rieur &#224; 94 % sont bien reconnues et
que les efforts d&#8217;am&#233;lioration de l&#8217;&#233;tiqueteur devraient plut&#244;t se porter sur la reconnaissance</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etiquetage morpho-syntaxique du fran&#231;ais &#224; base d&#8217;apprentissage supervis&#233;
</p>
<p>des autre classes. En &#233;tudiant en particulier les deux composantes de la classe Verbe (auxiliaire
et principal), on constate que les auxiliaires sont les plus mal reconnus. N&#233;anmoins le tagger
h&#233;site essentiellement entre Verbe auxiliaire et Verbe principal, ce qui est satisfaisant pour une
&#233;tape ult&#233;rieure d&#8217;analyse syntaxique. La ponctuation pr&#233;sente un score &#233;lev&#233; mais toutefois
insuffisant, ce qui est d&#251; aux points de suspension mal &#233;tiquet&#233;s.
</p>
<p>Les pr&#233;positions semblent particuli&#232;rement mal reconnues. En analysant les erreurs, on constate
que ce sont les mots du type &#8220;de la, de l&#8217;, des&#8221; qui posent la plupart des probl&#232;mes, c&#8217;est-&#224;-dire
les mots homographes qui sont soit des articles partitifs, soit des pr&#233;positions contract&#233;es. Cette
difficult&#233; est due &#224; la forte ambigu&#239;t&#233; entre les deux cas, &#233;l&#233;ment caract&#233;ristique de la grammaire
fran&#231;aise. De plus, les adjectifs et les pronoms sont un point faible de notre &#233;tiqueteur.
</p>
<p>3.3 Evaluation des homographes
</p>
<p>En nous inspirant de (Vergne, 99) qui pr&#233;sente diff&#233;rents types d&#8217;homographes du fran&#231;ais, nous
avons cherch&#233; &#224; affiner ces r&#233;sultats. Le tableau 3 pr&#233;sente ci-dessous les taux de reconnais-
sance de diff&#233;rents types d&#8217;homographes. Dans la premi&#232;re colonne (H1) sont pr&#233;sent&#233;s les
homographes d&#233;terminant/pronom (le, l&#8217;, la, les); en H2, les homographes pr&#233;position contrac-
t&#233;e/article partitif (de, d&#8217;, du, des); en H3, les homographes conjonction/pronom relatif (que,
qu&#8217;); en H4, les homographes auxiliaire/nom (est, &#234;tre, avoir); en H5, les homographes ad-
verbe/nom (bien, mal, moins, plus, pas, point...); en H6, les homographes nom/adjectif et en
H7, les homographes nom/verbe principal. La premi&#232;re ligne pr&#233;sente le nombre d&#8217;occurrences
dans le corpus de test de la classe majoritaire (en effet, pour les cas d&#8217;homographes, une classe
est largement majoritaire par rapport &#224; l&#8217;autre, de l&#8217;ordre de 70 &#224; 95 % des cas); la seconde,
le nombre d&#8217;occurrences de la classe minoritaire; la troisi&#232;me, le taux de reconnaissance de la
classe majoritaire, et la derni&#232;re le taux de reconnaissance de la classe minoritaire.
</p>
<p>H1 H2 H3 H4 H5 H6 H7
Occ. Maj D: 1767 Prep: 1601 C: 200 Aux: 267 Adv: 223 Adj: 290 N: 141
Occ. min Pro: 59 Part: 132 Pro: 47 N: 6 N: 27 N: 171 VP: 96
</p>
<p>% OK Maj 97.7 % 82.5 % 98 % 99.2 % 97.3 % 91.7 % 92.9 %
% OK min 69.5 % 62.1 % 17 % 85.7 % 85.2 % 87.7 % 83.3 %
</p>
<p>Table 3: Reconnaissance des homographes
</p>
<p>Au vu de ces r&#233;sultats, nous constatons que les classes majoritaires sont bien reconnues (sauf
en H2, o&#249; on retrouve la difficult&#233; pr&#233;c&#233;dente). Pour les classes minoritaires, les r&#233;sultats sont
r&#233;ellement encourageants pour H4, H5, H6 et H7, or ce sont ces cas qui sont les plus int&#233;ressants
pour l&#8217;&#233;tape ult&#233;rieure d&#8217;analyse syntaxique. En effet, nous pensons que discriminer un nom
d&#8217;un verbe (H7) apporte plus d&#8217;information qu&#8217;une pr&#233;position d&#8217;un partitif (H2), m&#234;me si cela
semble difficilement quantifiable. Nous avons d&#233;j&#224; discut&#233; de la difficult&#233; du cas H2. Pour
ce qui est de H1 et H3, dans les deux cas, la classe minoritaire est le pronom. Nous pensons
atteindre ici certaines limites de l&#8217;&#233;tiquetage pour ce qui est de la reconnaissance des pronoms.
En effet, celle-ci serait probablement plus pertinente au niveau de l&#8217;analyse en constituants .</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Julien Bourdaillet, Jean-Gabriel Ganascia
</p>
<p>4 Conclusion
</p>
<p>A travers ce travail, nous avons cherch&#233; &#224; d&#233;velopper un &#233;tiqueteur morpho-syntaxique du
fran&#231;ais se fondant sur une m&#233;thode d&#8217;apprentissage supervis&#233;. Pour ce faire, en nous basant sur
un tagger de l&#8217;anglais, nous avons adapt&#233; la proc&#233;dure d&#8217;apprentissage aux exigences du traite-
ment automatique du fran&#231;ais. Nous obtenons un score de pr&#233;cision de 89 %, score inf&#233;rieur &#224;
ceux des meilleurs &#233;tiqueteurs mais comme, d&#8217;une part ceux-ci sont des analyseurs syntaxiques
complets et d&#8217;autre part nous n&#8217;avons effectu&#233; aucune optimisation sur notre &#233;tiqueteur, ce r&#233;-
sultat est int&#233;ressant. Apr&#232;s avoir analys&#233; en d&#233;tail les erreurs d&#8217;&#233;tiquetage, il ressort que les
points faibles se situent au niveau des adjectifs, pronoms et pr&#233;positions et en particulier sur
ceux qui sont homographes avec une autre classe. Toutefois nous avons identifi&#233; certains cas
d&#8217;homographes comme &#233;tant les plus int&#233;ressants et ceux-ci s&#8217;av&#232;rent bien reconnus.
</p>
<p>Dans une perspective de poursuite de ce travail, nous avons effectu&#233; des tests prospectifs avec
le dictionnaire appris &#224; partir de tout le corpus (mais avec les m&#234;mes transitions), la pr&#233;cision
s&#8217;est am&#233;lior&#233;e de 1.5 &#224; 2 points pour les trois niveaux. Cela laisse &#224; penser que l&#8217;augmentation
de la taille du dictionnaire pr&#233;senterait des gains significatifs de pr&#233;cision et, plus g&#233;n&#233;ralement,
l&#8217;acquisition d&#8217;un mod&#232;le de langage &#224; partir d&#8217;un corpus plus cons&#233;quent. D&#8217;autre part, nous
avons r&#233;utilis&#233; tel quel le guesser qui est optimis&#233; pour l&#8217;anglais. Puisqu&#8217;il repose sur des r&#232;gles
statistiques, il fonctionne &#233;galement ici mais m&#233;riterait d&#8217;&#234;tre &#233;tudi&#233; plus en d&#233;tail et adapt&#233;.
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224; remercier John Carroll pour son concours et Emmanuel Giguet pour ses com-
mentaires sur ce travail.
</p>
<p>R&#233;f&#233;rences
Adda G., Mariani J., Paroubek P., Rajman M., Lecomte J. (1999), M&#233;trique et premiers r&#233;sultats de
l&#8217;&#233;valuation GRACE des &#233;tiqueteurs morphosyntaxiques pour le fran&#231;ais, Actes de la Sixi&#232;me Con-
f&#233;rence sur le Traitement Automatique des Langues Naturelles.
Brill E. (1992), A simple rule-based part of speech tagger, Actes de Third Conference of Applied Natural
Language Processing.
</p>
<p>Briscoe T., Carroll J.(2002), Robust accurate statistical annotation of general text. Actes de Third Inter-
national Conference on Language Resources and Evaluation. p. 1499-1504.
Chanod J-P., Tapanainen P. (1995), Tagging French - comparing a statistical and a constraint-based
method, Actes de Seventh Conference of the European Chapter of the ACL.
Elworthy D. (1994), Does Baum-Welch re-estimation help taggers ?, Actes de Fourth ACL Conference
on Applied NLP.
</p>
<p>Giguet E., Vergne J. (1997), From part of speech tagging to memory-based deep syntactic analysis, Actes
de Fifth Iternational Workshop on Parsing Technologies.
Stein A., Schmid H. (1995), Etiquetage morphologique de textes fran&#231;ais avec un arbre de d&#233;cisions,
Revue T.A.L, Vol. 36.
</p>
<p>Vergne J. (1999), Habilitation &#224; diriger des recherches, p. 36.</p>

</div></div>
</body></html>