<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Les M&#233;ta-RCG: description et mise en oeuvre</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Les M&#233;ta-RCG, un formalisme linguistique non-lin&#233;aire :
description et mise en &#339;uvre
</p>
<p>Beno&#238;t Sagot
INRIA - Projet Atoll
</p>
<p>Domaine de Voluceau, B.P. 105, 78153 Le Chesnay Cedex, France
benoit.sagot@inria.fr
</p>
<p>Mots-clefs : Analyse syntaxique, interface syntaxe-s&#233;mantique, grammaires non-lin&#233;aires,
Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (RCG)
</p>
<p>Keywords: Parsing, syntax-semantics interface, non-linear grammars, Range Concate-
nation Grammars (RCG)
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons dans cet article un nouveau formalisme linguistique qui repose
sur les Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (RCG), appel&#233; M&#233;ta-RCG. Nous exposons
tout d&#8217;abord pourquoi la non-lin&#233;arit&#233; permet une repr&#233;sentation ad&#233;quate des ph&#233;nom&#232;nes lin-
guistiques, et en particulier de l&#8217;interaction entre les diff&#233;rents niveaux de description. Puis
nous pr&#233;sentons les M&#233;ta-RCG et les concepts linguistiques suppl&#233;mentaires qu&#8217;elles mettent
en &#339;uvre, tout en restant convertibles en RCG classiques. Nous montrons que les analyses
classiques (constituants, d&#233;pendances, topologie, s&#233;mantique pr&#233;dicat-arguments) peuvent &#234;tre
obtenues par projection partielle d&#8217;une analyse M&#233;ta-RCG compl&#232;te. Enfin, nous d&#233;crivons la
grammaire du fran&#231;ais que nous d&#233;veloppons dans ce nouveau formalisme et l&#8217;analyseur effi-
cace qui en d&#233;coule. Nous illustrons alors la notion de projection partielle sur un exemple.
</p>
<p>Abstract In this paper, we present a novel linguistic formalism based on Range Conca-
tenation Grammars (RCG), called Meta-RCG. We first expose why non-linearity allows a sa-
tisfying representation of linguistic phenomena, and in particular of the interaction between the
different levels of description. Then we introduce Meta-RCGs and the extra linguistic concepts
they manipulate, while remaining compilable into classical RCGs. Moreover, we show that
classical analyses (consituency, dependency, topology, predicate-arguments semantics) can be
obtained by partial projection of a full Meta-RCG parse. Finally, we describe the grammar for
French we develop in this new formalism and the associated efficient parser. We illustrate the
notion of partial projection with an example.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. Sagot
</p>
<p>1 Introduction
</p>
<p>Dans (Sagot &amp; Boullier, 2004), les auteurs montrent que les Grammaires &#224; Concat&#233;nation d&#8217;In-
tervalles (Range Concatenation Grammars, ci-apr&#232;s RCG) sont bien adapt&#233;es &#224; la description
du langage naturel. Toutefois, et malgr&#233; la disponibilit&#233; d&#8217;un analyseur (Boullier, 2004), ils ne
pr&#233;sentent pas de syst&#232;me d&#8217;analyse complet incluant une grammaire linguistique.
</p>
<p>L&#8217;objectif de cet article est de d&#233;crire un tel syst&#232;me d&#8217;analyse. Mais cela ne se limite pas &#224;
une grammaire : en r&#233;alit&#233;, les RCG ne sont pas directement utilisables pour repr&#233;senter des
ph&#233;nom&#232;nes linguistiques. Si le principe qui leur est sous-jacent, celui de la concat&#233;nation d&#8217;in-
tervalles de la cha&#238;ne d&#8217;entr&#233;e, est adapt&#233; &#224; la description du langage naturel, d&#8217;autres concepts
linguistiques de base sont &#224; prendre en consid&#233;ration, tels les ph&#233;nom&#232;nes d&#8217;homonymie, de
syntagmes &#224; t&#234;tes, de traits, d&#8217;extraction ou d&#8217;interface syntaxe-s&#233;mantique.
</p>
<p>Les langages d&#233;finis par les RCG couvrent tout PTIME, c&#8217;est-&#224;-dire l&#8217;ensemble des langages
analysables en temps polynomial. Ceci est d&#251; &#224; une propri&#233;t&#233; fondamentale des RCG, leur non-
lin&#233;arit&#233; (ou cl&#244;ture par intersection). Dans la premi&#232;re section, nous montrons que cette non-
lin&#233;arit&#233; permet une description appropri&#233;e des r&#233;alit&#233;s linguistiques, alors que la plupart des
formalismes d&#233;velopp&#233;s jusqu&#8217;&#224; pr&#233;sent ont un squelette lin&#233;aire (car clos par homomorphisme,
voir plus bas). En particulier, cette non-lin&#233;arit&#233; permet la d&#233;finition d&#8217;un formalisme qui &#233;tend
les RCG en prenant en compte les concepts linguistiques de base cit&#233;s plus haut, tout en restant
convertible en RCG standard. La deuxi&#232;me section donne un aper&#231;u de ce formalisme, appel&#233;
M&#233;ta-RCG. Enfin, nous pr&#233;sentons dans la troisi&#232;me section une grammaire du fran&#231;ais &#233;crite
en M&#233;ta-RCG. Ainsi, nous montrons que la grammaire que nous avons &#233;crite fait interagir
intimement tous les niveaux d&#8217;analyse linguistique, de la morphologie &#224; la s&#233;mantique lexicale
en passant par la syntaxe. De ce fait, les analyses classiques (en constituants, en d&#233;pendances,
en bo&#238;tes topologiques, en pr&#233;dicats s&#233;mantiques) peuvent &#234;tre extraites de nos analyses M&#233;ta-
RCG par projection partielle.
</p>
<p>2 Non-lin&#233;arit&#233; et grammaires pour les langues naturelles
</p>
<p>La complexit&#233; des langues naturelles est au-del&#224; de celle des Grammaires Non-Contextuelles
(CFG). Pour des raisons pratiques et th&#233;oriques, tous les formalismes envisag&#233;s pour d&#233;crire les
langues naturelles &#233;tendent les CFG, m&#234;me si la fa&#231;on dont ils les &#233;tendent varie. La plupart re-
posent sur une architecture &#224; deux niveaux. Ils utilisent tout d&#8217;abord un squelette syntaxique qui
&#233;tend lui-m&#234;me les CFG tout en &#233;tant clos par homomorphisme1. Au dessus de ce squelette, ils
mettent en jeu des structures, dites d&#233;corations, qui sont calcul&#233;es sur les analyses syntaxiques
(souvent des arbres) fournies par le squelette, et ce le plus souvent par des m&#233;canismes reposant
sur l&#8217;unification. C&#8217;est par exemple le cas des Grammaires Fonctionnelles-Lexicales (LFG) ou
des Grammaires d&#8217;Arbres Adjoints avec d&#233;corations (Feature-based TAG).
Ce n&#8217;est pourtant pas le seul choix possible. En r&#233;alit&#233;, un formalisme qui &#233;tend les CFG et qui
est de complexit&#233; raisonnable2 ne peut &#234;tre clos &#224; la fois par intersection et par homomorphisme.
Et choisir, comme cela se fait g&#233;n&#233;ralement, la cl&#244;ture par homomorphisme a une grande in-
fluence sur la nature des formalismes. En effet, de nombreux faits linguistiques de diff&#233;rentes
</p>
<p>1Un homomorphisme &#233;tant un cas particulier de substitution, la cl&#244;ture par homomorphisme d&#233;coule de la
cl&#244;ture par substitution, plus classiquement utilis&#233;e et d&#233;crite.
</p>
<p>2Plus pr&#233;cis&#233;ment, qui d&#233;finit un sous-ensemble strict des langages r&#233;cusivement &#233;num&#233;rables.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les M&#233;ta-RCG : description et mise en &#339;uvre
</p>
<p>natures peuvent concerner les m&#234;mes parties d&#8217;une phrase. La lin&#233;arit&#233; induite par la cl&#244;ture
par homomorphisme impose alors de faire un choix : une seule classe de faits linguistiques est
d&#233;crite par le squelette syntaxique et les autres ne peuvent effectivement qu&#8217;&#234;tre rel&#233;gu&#233;s dans
des d&#233;corations &#224; la complexit&#233; mal contr&#244;l&#233;e. C&#8217;est la raison d&#8217;&#234;tre des architectures &#224; deux
niveaux (TAG et traits pour les FTAG, CFG et &#233;quations fonctionnelles pour les LFG, etc.), qui
ont certains inconv&#233;nients3. Il est donc int&#233;ressant d&#8217;explorer l&#8217;autre piste, celle des formalismes
clos par intersection, ou non-lin&#233;aires, puisqu&#8217;ils permettent de se d&#233;barasser des d&#233;corations et
ont de nombreux avantages computationnels et linguistiques.
</p>
<p>Les formalismes non-lin&#233;aires &#224; un seul niveau ont la puissance d&#8217;expression n&#233;cessaire pour
d&#233;crire le langage naturel, m&#234;me si l&#8217;on fait comme ici l&#8217;hypoth&#232;se que l&#8217;on peut se limiter
&#224; des formalismes polynomiaux4. En prenant les RCG comme exemple d&#8217;un tel formalisme,
(Boullier, 2003) pr&#233;sente ainsi des grammaires pour les langages {a2n} et {anban&#8722;1b . . . bab}
(nombres chinois, g&#233;nitifs en g&#233;orgien ancien,. . .) et pour une version abstraite du scrambling.
De nombreux langages mod&#233;lisant des ph&#233;nom&#232;nes purement syntaxiques non repr&#233;sentables
dans un formalisme syntaxique lin&#233;aire peuvent &#234;tre d&#233;crits par des grammaires non-lin&#233;aires.
Mais cette augmentation de la complexit&#233; ne se fait pas au d&#233;triment de l&#8217;efficacit&#233; d&#8217;analyse5.
</p>
<p>Par ailleurs, la non-lin&#233;arit&#233; est appropri&#233;e pour d&#233;crire les langues car celles-ci reposent elles-
m&#234;mes sur des m&#233;canismes non-lin&#233;aires : si dans les formalismes &#224; deux niveaux il faut re-
porter dans les d&#233;corations le traitement de certains ph&#233;nom&#232;nes, c&#8217;est bien parce que la non-
lin&#233;arit&#233; des langues ne peut &#234;tre repr&#233;sent&#233;e par un formalisme lin&#233;aire. On peut citer, comme
exemples de ph&#233;nom&#232;nes linguistiques non-lin&#233;aires, les m&#233;canismes non-lin&#233;aires purement
syntaxiques6, comme les verbes &#224; contr&#244;le ou &#224; mont&#233;e, et l&#8217;interaction entre diff&#233;rents types
de contraintes linguistiques, et en particulier la syntaxe et la s&#233;mantique lexicale. De fait, un
formalisme non-lin&#233;aire permet par exemple de contraindre trivialement la construction d&#8217;une
d&#233;pendance &#224; des contraintes syntaxiques (accord, . . .) et &#224; des contraintes s&#233;mantiques (restric-
tions de s&#233;lection, . . .) de mani&#232;re simultan&#233;e, voire &#224; toutes sortes de contraintes7.
Outre une meilleure repr&#233;sentation des faits linguistiques, la non-lin&#233;arit&#233; permet une meilleure
efficacit&#233; d&#8217;analyse. En effet, la multiplication des contraintes de diverses natures induit un
abandon pr&#233;coce des analyses invalides : d&#232;s qu&#8217;une contrainte &#233;choue, l&#8217;analyse &#233;choue. Ainsi,
plus il y a de contraintes, et plus elle a de chances d&#8217;&#233;chouer vite. C&#8217;est l&#8217;antith&#232;se des forma-
lismes &#224; deux niveaux comme LFG, o&#249; l&#8217;on peut &#234;tre amen&#233; &#224; effectuer un nombre colossal
d&#8217;analyses de premier niveau (CFG) et &#224; calculer sur les arbres produits de co&#251;teuses d&#233;cora-
tions (que ce soit fait en une seule phase ou en deux phases).
Un formalisme non-lin&#233;aire &#233;tendant les CFG couvre au moins PTIME. Or nous faisons l&#8217;hypo-
th&#232;se que l&#8217;on peut se cantonner aux formalismes polynomiaux. Suivant ainsi (Sagot &amp; Boullier,
2004), nous sommes donc int&#233;ress&#233;s par les formalismes couvrant exactement PTIME.
</p>
<p>3Ces inconv&#233;nients sont &#224; la fois computationnels et linguistiques : l&#8217;unification induit une complexit&#233; algo-
rithmique trop &#233;lev&#233;e (analyseurs exponentiels), des m&#233;canismes d&#8217;interaction (successifs ou simultan&#233;s) entre le
squelette et les d&#233;corations, et un arbitraire linguistique dans la position exacte de la s&#233;paration entre squelette
et d&#233;corations. De plus, il existe des ph&#233;nom&#232;nes purement syntaxiques qui d&#233;passent strictement la puissance
d&#8217;expression des squelettes lin&#233;aires (CFG, TAG, MC-TAG), etc.
</p>
<p>4Dont les grammaires d&#233;finissent des langages analysables en temps polynomial en la longueur de l&#8217;entr&#233;e.
5Ainsi, on peut convertir une CFG ou une TAG en une RCG fortement &#233;quivalente qui s&#8217;analyse respectivement
</p>
<p>en O(n3) ou en O(n6). On peut analyser en O(n3) toute intersection de CFG. Le langage {a2n}, quoiqu&#8217;ayant peu
de rapport avec la linguistique, montre la puissance de la non-lin&#233;arit&#233; : il ne respecte pas la propri&#233;t&#233; de croissance
constante (CGP) mais est reconnaissable en temps logarithmique et donc sublin&#233;aire avec une RCG.
</p>
<p>6Bien qu&#8217;aucun formalisme ne les reconnaisse comme tels, puisqu&#8217;ils ne sont pas en mesure de les traiter ainsi
7Des exp&#233;riences sont en cours concernant la structuration du discours.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. Sagot
</p>
<p>Deux de ces formalismes ont &#233;t&#233; plus particuli&#232;rement &#233;tudi&#233;s : les simple Literal Movement
Grammars (sLMG, (Groenink, 1996)) et les Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (RCG,
(Boullier, 2004)). Leur d&#233;finition formelle et leurs propri&#233;t&#233;s ont &#233;t&#233; d&#233;j&#224; publi&#233;es &#224; maintes
reprises, et ne seront pas r&#233;p&#233;t&#233;es ici. Rappelons simplement que dans les deux cas une gram-
maire est un ensemble de clauses &#224; la Horn qui mettent en jeu des pr&#233;dicats sur des portions
de la cha&#238;ne d&#8217;entr&#233;e. Pour plusieurs raisons, les RCG sont plus adapt&#233;es aux descriptions lin-
guistiques8. Mais ce choix n&#8217;est pas v&#233;ritablement d&#233;terminant, et nous l&#8217;avons fait en partie
aussi en raison de la disponibilit&#233; d&#8217;un analyseur extr&#234;mement efficace pour les RCG (Boullier,
2004).
</p>
<p>3 Les M&#233;ta-RCG : une br&#232;ve description
</p>
<p>Si la notion d&#8217;intervalle est bien adapt&#233;e &#224; la description linguistique, il manque aux RCG
un certain nombre de concepts primaires pour pouvoir pr&#233;tendre au titre de formalisme lin-
guistique. Nous avons donc d&#233;fini un formalisme qui &#233;tend la syntaxe des RCG pour rendre
accessibles ces concepts. Ce formalisme, d&#233;crit dans (Sagot, 2005), s&#8217;appelle M&#233;ta-RCG. Il
n&#8217;introduit pas de d&#233;corations formant un second niveau, comme dans les formalismes au sque-
lette syntaxique lin&#233;aire : la non-lin&#233;arit&#233; permet &#224; ces extensions d&#8217;&#234;tre incluses &#224; l&#8217;int&#233;rieur
de la grammaire, par compilation de toute M&#233;ta-RCG en une RCG classique. Nous avons donc
&#233;crit un compilateur qui effectue cette transformation, ainsi qu&#8217;un convertisseur permettant de
traduire l&#8217;analyse d&#8217;une phrase obtenue &#224; l&#8217;aide de cette RCG en une analyse M&#233;ta-RCG.
</p>
<p>3.1 Extensions linguistiques de la syntaxe des RCG
</p>
<p>Une M&#233;ta-RCG, comme une RCG, est constitu&#233;e de clauses manipulant des pr&#233;dicats. Et toute
RCG est une M&#233;ta-RCG. Cependant, les pr&#233;dicats et les arguments M&#233;ta-RCG sont des exten-
sions des pr&#233;dicats et des arguments RCG. Nous allons donc passer en revue successivement
les trois familles d&#8217;extensions : les t&#234;tes de syntagmes, les traits et num&#233;ros d&#8217;homonymes, et
les contextes.
</p>
<p>La notion de t&#234;te d&#8217;un syntagme est r&#233;pandue dans la litt&#233;rature linguistique. Dans le cas des
M&#233;ta-RCG, l&#8217;id&#233;e est formul&#233;e de la fa&#231;on suivante : il est impossible, en raison de la non-
lin&#233;arit&#233; des RCG et donc des M&#233;ta-RCG, de rendre visible une portion d&#8217;analyse &#224; diff&#233;rents
endroits de l&#8217;analyse, car cela d&#233;passerait PTIME. Or on a parfois besoin de rendre visible plus
d&#8217;informations qu&#8217;un simple intervalle (ce qui est la version basique de la non-lin&#233;arit&#233;). De ce
fait, on essaie de construire des repr&#233;sentations partielles de portions d&#8217;analyses. On fait alors
l&#8217;hypoth&#232;se suivante : on n&#8217;a jamais besoin de conna&#238;tre &#224; propos d&#8217;un syntagme et &#224; l&#8217;ext&#233;rieur
de celui-ci plus que ses t&#234;tes (il y en a plusieurs en cas de coordination) et un certain nombre
de traits (voir ci-dessous). Outre un intervalle simple, un argument M&#233;ta-RCG peut donc repr&#233;-
senter en plus la liste de ses t&#234;tes9. On appelle argument syntagmatique un tel argument &#224; t&#234;tes.
</p>
<p>8Il est toujours possible de convertir une sLMG en une RCG et inversement. La diff&#233;rence entre RCG et sLMG
r&#233;side dans ce que l&#8217;on entend par &#171; portion &#187; de la cha&#238;ne d&#8217;entr&#233;e. Pour les sLMG, il s&#8217;agit de sous-cha&#238;nes, alors
que pour les RCG il s&#8217;agit d&#8217;intervalles (c&#8217;est-&#224;-dire d&#8217;occurrences de sous-cha&#238;nes). En cons&#233;quence, et &#224; titre
d&#8217;exemple, il n&#8217;y a qu&#8217;une seule cha&#238;ne vide pour les sLMG, alors que pour les RCG il y a n + 1 intervalles vides
distincts entre les mots d&#8217;une phrase de longueur n, ce qui semble plus satisfaisant.
</p>
<p>9On dispose naturellement d&#8217;op&#233;rateurs d&#8217;empilement d&#8217;une t&#234;te dans une telle liste.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les M&#233;ta-RCG : description et mise en &#339;uvre
</p>
<p>Les pr&#233;dicats M&#233;ta-RCG &#233;tendent les pr&#233;dicats RCG. Tout d&#8217;abord, un pr&#233;dicat M&#233;ta-RCG
est d&#233;cor&#233; par des traits d&#233;finis sur des domaines finis qui permettent de repr&#233;senter de ma-
ni&#232;re &#233;l&#233;gante des propri&#233;t&#233;s de syntagmes, c.-&#224;-d. des propri&#233;t&#233;s de portions d&#8217;analyses et non
seulement d&#8217;intervalles. Ensuite, on associe &#224; chaque nom de pr&#233;dicat une liste de positions
d&#8217;arguments dits &#224; num&#233;ros d&#8217;homonymes : ces arguments, remplis par un intervalle vide ou
par un &#171; mot &#187;, sont associ&#233;s &#224; des num&#233;ros qui diff&#233;rencient les homonymes. Enfin, &#224; chaque
nom de pr&#233;dicat est associ&#233;e une liste de contextes (des intervalles syntagmatiques et/ou des
traits) qui peuvent &#234;tre trait&#233;s comme des intervalles (ou des traits) standard. Sauf indication
contraire, un contexte pr&#233;sent dans deux pr&#233;dicats d&#8217;une m&#234;me clause a une valeur unique10.
</p>
<p>3.2 Projection partielle d&#8217;une analyse globale en analyses classiques
La non-lin&#233;arit&#233; des M&#233;ta-RCG permet de traiter au m&#234;me niveau les ph&#233;nom&#232;nes de d&#233;pen-
dance, de constituance, de s&#233;mantique lexicale, et autres. De plus, le fondement m&#234;me des RCG,
&#224; savoir la concat&#233;nation d&#8217;intervalles, rend la vision topologique de la langue inh&#233;rente &#224; toute
grammaire M&#233;ta-RCG. Aussi l&#8217;analyse d&#8217;une phrase obtenue &#224; partir d&#8217;une grammaire M&#233;ta-
RCG regroupe-t-elle des faits linguistiques participant de ces diverses classes de ph&#233;nom&#232;nes.
</p>
<p>Il est ainsi ais&#233; d&#8217;extraire d&#8217;une analyse M&#233;ta-RCG des vues partielles qui constituent des ana-
lyses classiques (en constituants, en d&#233;pendances, en bo&#238;tes topologiques, en relations pr&#233;dicats-
arguments s&#233;mantiques, etc.). Cette extraction se fait par projection partielle : aucune informa-
tion n&#8217;est calcul&#233;e &#224; partir de l&#8217;analyse M&#233;ta-RCG, elles en sont extraites par projection.
</p>
<p>4 Une M&#233;ta-RCG du fran&#231;ais
</p>
<p>Le d&#233;veloppement du formalisme M&#233;ta-RCG s&#8217;est fait en parall&#232;le avec celui d&#8217;une grammaire
du fran&#231;ais. Faute de place, nous ne pouvons en donner ici de fragment. Actuellement, elle com-
porte 370 clauses grammaticales (non lexicales) se compilant en une RCG &#224; 625 clauses, d&#8217;arit&#233;
73 et de degr&#233; maximal 40. Elle couvre d&#233;j&#224; un grand nombre de ph&#233;nom&#232;nes linguistiques.
&#192; titre d&#8217;illustration, consid&#233;rons les deux phrases suivantes :
</p>
<p>(1) Les entreprises dans lesquelles le Japon veut que la Commission accepte que
l&#8217;Europe investisse fabriquent des ordinateurs.
</p>
<p>(2) Cette id&#233;e pose un probl&#232;me &#224; Nancy.
La phrase (1) inclut une relative qui modifie un verbe ench&#226;ss&#233; &#224; travers un contr&#244;le sujet et
une compl&#233;tive. L&#8217;efficacit&#233; du syst&#232;me permet d&#8217;obtenir une analyse unique en 0,38s11, dont
la projection partielle pour obtenir un graphe de d&#233;pendances produit la figure 1. La phrase (2)
illustre l&#8217;interaction entre syntaxe et s&#233;mantique au niveau de la grammaire. En effet, Nancy
&#233;tant ambigu (pr&#233;nom ou lieu), et pose (verbe transitif direct ou verbe support &#224; compl&#233;ment
d&#8217;objet indirect), seules les contraintes s&#233;mantiques permettent de n&#8217;obtenir que deux analyses,
ce qui est bien le cas ici (en 0.01s)12. Nous montrons dans la figure 2 l&#8217;arbre de constituance
(commun aux deux analyses) obtenu par projection partielle de notre analyse.
</p>
<p>10La notion de barri&#232;re est alors facilement impl&#233;ment&#233;e : en n&#8217;associant pas un certain contexte &#224; un certain
pr&#233;dicat, on l&#8217;emp&#234;che d&#8217;&#234;tre visible dans la portion d&#8217;analyse dont ce pr&#233;dicat est la racine. D&#8217;o&#249; un traitement
&#233;l&#233;gant de divers ph&#233;nom&#232;nes, tels que d&#233;pendances &#224; longue distance, contr&#244;le, mont&#233;e, etc.
</p>
<p>11L&#8217;architecture utilis&#233;e est un Apple Powerbook avec processeur G4 &#224; 1,5 GHz, et gcc 3.3.
12L&#8217;ambigu&#239;t&#233; sur pose est lev&#233;e, mais pas celle sur Nancy. Naturellement, si l&#8217;on remplace un probl&#232;me par un
</p>
<p>vase, on n&#8217;obtient qu&#8217;une seule analyse, o&#249; Nancy est un lieu.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B. Sagot
</p>
<p>Phrase (1)
</p>
<p>fabriquent
</p>
<p>SujetObjet direct
</p>
<p>entreprises
</p>
<p>Japon_2
</p>
<p>veut
</p>
<p>SujetObjet direct
</p>
<p>accepte
</p>
<p>SujetObjet direct
</p>
<p>Commission_2investisse
</p>
<p>SujetCirconstant
</p>
<p>Europe_2ordinateurs
</p>
<p>Figure 1. Graphe de d&#233;pendance produit par
projection partielle de l&#8217;analyse de (1).
</p>
<p>Phrase (2)
</p>
<p>S
</p>
<p>cette id&#233;e pose_5 un probl&#232;me &#224;_2 Nancy
</p>
<p>GN
</p>
<p>GV
</p>
<p>Nom
</p>
<p>NDET
</p>
<p>D&#233;terminant Nom
</p>
<p>N
</p>
<p>GN
</p>
<p>DET
</p>
<p>D&#233;terminant Pr&#233;position
</p>
<p>PREP PN
</p>
<p>Nom Propre
</p>
<p>GN
</p>
<p>GP
</p>
<p>V
</p>
<p>Verbe
</p>
<p>Figure 2. Arbre des constituants produit par projection
partielle de l&#8217;analyse de (2).
</p>
<p>5 Conclusion
</p>
<p>Dans cet article, nous avons montr&#233; l&#8217;importance du concept de non-lin&#233;arit&#233; pour la description
formelle des langues. Nous avons introduit en particulier un formalisme, les M&#233;ta-RCG, fond&#233;
sur les Grammaires &#224; Concat&#233;nation d&#8217;Intervalles (RCG). Nous avons ensuite d&#233;crit tr&#232;s rapi-
dement la grammaire du fran&#231;ais que nous d&#233;veloppons, montrant ainsi la pertinence de la prise
en compte simultan&#233;e de faits linguistiques de natures diff&#233;rentes, et le fait que les analyses
classiques peuvent &#234;tre obtenues &#224; partir de nos analyses par simple projection.
Nous envisageons d&#233;sormais d&#8217;augmenter la couverture de la grammaire, de d&#233;velopper des
m&#233;thodes automatiques pour la construction du lexique tr&#232;s riche sous-jacent &#224; un tel type de
grammaires, et d&#8217;&#233;tendre la port&#233;e de notre grammaire en y incluant des faits linguistiques
g&#233;n&#233;ralement n&#233;glig&#233;s dans les grammaires, tels que la structuration du discours.
</p>
<p>R&#233;f&#233;rences
BOULLIER P. (2003). Counting with range concatenation grammars. Theoretical Computer Science,
293, 391&#8211;416.
BOULLIER P. (2004). Range concatenation grammars. In New developments in parsing technology, p.
269&#8211;289. Kluwer Academic Publishers.
GROENINK A. (1996). Mild context-sensitivity and tuple-based generalizations of context-free gram-
mar. In D. JOHNSON &amp; L. MOSS, Eds., Actes de MoL 4 : Linguistics and Philosophy.
SAGOT B. (2005). Linguistic facts as predicates over ranges of the sentence. In Proceedings of LACL
05, Bordeaux, France. To appear.
SAGOT B. &amp; BOULLIER P. (2004). Les RCG comme formalisme grammatical pour la linguistique. In
Actes de TALN 04, p. 403&#8211;412, F&#232;s, Maroc.</p>

</div></div>
</body></html>