<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Naviguer dans les textes pour apprendre</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Naviguer dans les textes pour apprendre 
</p>
<p>Javier Couto(1), Lita Lundquist (2), Jean-Luc Minel(1) 
 
</p>
<p>(1) LaLICC &#8211; CNRS, Universit&#233; Paris-Sorbonne 
Maison de la Recherche, 28 rue Serpente, 75 006 Paris  
</p>
<p>{Prenom.nom}@paris4.sorbonne.fr 
(2) D&#233;partement de fran&#231;ais Institut F.I.R.S.T 
</p>
<p>Handelsh&#248;jskolen i K&#248;benhavn, CBS, Denmark 
ll.first@cbs.dk  
</p>
<p> 
</p>
<p> 
</p>
<p>Mots-cl&#233;s :   Navigation textuelle, apprentissage en lingusitique textuelle 
Keywords:   Textual navigation, teaching texts and text linguistics 
 
</p>
<p>R&#233;sum&#233; Dans cet article nous pr&#233;sentons un langage de navigation textuelle et son 
implantation dans la plate-forme Navitexte. Nous d&#233;crivons une application de ces principes 
de navigation dans un cadre d&#8217;apprentissage de la bonne formation des textes, destin&#233;e &#224; des 
dans un cadre d&#8217;apprentissage de la bonne formation des textes, destin&#233;e &#224; des &#233;tudiants 
apprenant le fran&#231;ais langue &#233;trang&#232;re. 
</p>
<p> 
</p>
<p>Abstract In this article we present a declarative language, which models ways of 
visualising and navigating in texts, together with its implementation in a workstation, 
NaviTexte. First, we show how the language can be used to build an application in text 
linguistics. This application aims to teach foreign language students to identify different 
coherence creating units in a text and to navigate between them. Then we detail the 
declarative language. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Javier Couto, Lita Lundquist, Jean-Luc Minel 
</p>
<p>1 Introduction 
L&#8217; activit&#233; consistant &#224; s&#233;lectionner des informations &#224; l&#8217; int&#233;rieur d&#8217; un texte donn&#233; est une 
d&#233;marche qui mobilise de multiples fonctions cognitives  et qui varie en fonction des sujets, 
de leur expertise du domaine trait&#233; ainsi que de leur degr&#233; d&#8217; attention au moment o&#249; ils en 
prennent connaissance. Si la mod&#233;lisation de ces fonctions n&#8217; est pas actuellement possible, du 
moins dans toute leur complexit&#233;,  en revanche, un certain nombre de travaux en linguistique 
textuelle nous fournissent des concepts et des mod&#232;les sur lesquels il est possible de 
s&#8217; appuyer, notamment dans un contexte p&#233;dagogique. En d&#233;passant le palier de la phrase,  la 
linguistique textuelle a en effet prouv&#233; sa port&#233;e dans l&#8217; enseignement, que ce soit dans 
l&#8217; enseignement de la langue maternelle, dans l&#8217; enseignement des langues &#233;trang&#232;res dans 
l&#8217; enseignement de la litt&#233;rature, dans l&#8217; enseignement des langues de sp&#233;cialit&#233; et de la 
traduction [Lundquist 1999], pour ne mentionner que quelques disciplines pour lesquelles la 
linguistique textuelle pr&#233;sente un int&#233;r&#234;t p&#233;dagogique. De plus, la linguistique textuelle 
permet de focaliser l&#8217; attention de l&#8217; apprenant sur des structures textuelles et des r&#233;alisations 
linguistiques de la coh&#233;rence qui sont propres &#224; des types de textes particuliers (texte narratif, 
texte argumentatif, etc.), voire propres &#224; des langues diff&#233;rentes. En effet, il s&#8217; av&#232;re, en 
adoptant une perspective linguistique contrastive, que les textes ne s&#8217; organisent pas de la 
m&#234;me mani&#232;re, m&#234;me dans des langues apparemment proches, comme le fran&#231;ais et l&#8217; anglais, 
ou comme le fran&#231;ais et le danois. Ainsi, les langues romanes r&#233;alisent souvent la reprise 
anaphorique par des SNs pleins et vari&#233;s (les soi-disant &#171; anaphores infid&#232;les &#187;), [Lundquist &#224; 
para&#238;tre], compar&#233;es aux langues germaniques comme le danois, qui pr&#233;f&#232;rent 
l&#8217; anaphorisation pronominale ; un signe parmi d&#8217; autres de strat&#233;gies totalement diff&#233;rentes 
pour pr&#233;senter et organiser l&#8217; information dans les textes.  
</p>
<p>Si la coh&#233;rence textuelle constitue bien une &#171; heuristique g&#233;n&#233;rale &#187; d&#8217; interpr&#233;tation textuelle 
[Charolles 1981], il est possible de l&#8217; exploiter pour montrer, et enseigner, comment la 
coh&#233;rence se manifeste linguistiquement dans les textes en g&#233;n&#233;ral, et dans des types de textes 
diff&#233;rents en particulier, de m&#234;me que dans des langues diff&#233;rentes. Il nous semble donc que 
l&#8217; enseignement de la linguistique textuelle contribue, dans de multiples contextes, &#224; aiguiser 
l&#8217; attention des apprenants vers la r&#233;alisation de la &#171; bonne formation &#187; des textes, et &#224; stimuler 
leur propre production de textes bien form&#233;s. Un outil qui permette &#224; l&#8217; &#233;l&#232;ve/l&#8217; &#233;tudiant de voir 
et de naviguer dans le texte entre des unit&#233;s textuelles assurant la coh&#233;rence, sera un 
instrument didactique tr&#232;s performant et motivant, tant pour l&#8217; apprentissage de la lecture que 
pour l&#8217; apprentissage de la production &#233;crite de textes. Dans cette perspective, les dispositifs de 
visualisation et de navigation sont consid&#233;r&#233;s comme essentiels. Par cons&#233;quent une plate-
forme logicielle qui permette d&#8217; une part, de sp&#233;cifier des connaissances de visualisation et de 
navigation, et d&#8217; autre part de les ex&#233;cuter dans un environnement interactif, constitue un 
dispositif d&#8217; apprentissage extr&#234;mement utile.  
</p>
<p>2 Repr&#233;sentation des unit&#233;s textuelles n&#233;cessaires &#224; la situation 
d&#8217;apprentissage 
</p>
<p>En &#233;tudiant le proc&#233;d&#233;, par lequel le lecteur apprend &#224; naviguer dans un texte en suivant ses 
diff&#233;rentes pistes de coh&#233;rence, bas&#233;es sur la r&#233;f&#233;rence, sur la pr&#233;dication et sur les 
connecteurs &#8211; nous attaquons des probl&#232;mes cognitifs cruciaux pour lire, comprendre et 
interpr&#233;ter correctement un texte, ainsi que pour apprendre par les textes. Le premier 
probl&#232;me consiste &#224; identifier les r&#233;f&#233;rents discursifs d&#8217; un texte et d&#8217; &#233;tablir les relations 
correctes entre les SN qui y r&#233;f&#232;rent. En d&#8217; autres mots, de d&#233;cider s&#8217; il s&#8217; agit d&#8217; une relation de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Naviguer dans les textes pour apprendre 
</p>
<p>cor&#233;f&#233;rence, cas o&#249; il y a identit&#233; et donc question d&#8217; un m&#234;me r&#233;f&#233;rent ou s&#8217; il y a disjonction 
r&#233;f&#233;rentielle, c&#8217; est-&#224;-dire question de deux (ou plusieurs) r&#233;f&#233;rents diff&#233;rents. Cette 
comp&#233;tence cognitive est primordiale pour arriver &#224; &#233;tablir une repr&#233;sentation mentale 
coh&#233;rente et correcte du texte en question, qui est, de son c&#244;t&#233; &#224; la base de toute 
compr&#233;hension par les textes : &#171; learning from text requires that the learner construct a 
coherent mental representation of the text &#187; [Kintsch 1998: 307] ; voir aussi la question de la 
Anaphora resolution, ibid. : 144 ss). 
</p>
<p>Le second probl&#232;me cognitif consiste &#224; identifier le &#171; o&#249; veut en venir l&#8217; &#233;metteur &#187; du texte. 
Cette orientation &#8211; expressive, argumentative, et d&#8217; autre &#8211; a &#233;t&#233; qualifi&#233;e de &#171; programme 
d&#8217; interpr&#233;tation &#187; par [Lundquist 1990], &#233;tant donn&#233; qu&#8217; il s&#8217; agit d&#8217; une orientation marqu&#233;e 
d&#232;s le d&#233;but du texte, qui agit tel un &#171; programme &#187; qui fonctionne du g&#233;n&#233;ral au particulier, 
et qui permet d&#8217; identifier des marques suivantes dans le texte qui &#171; vont dans le m&#234;me sens &#187;, 
c&#8217; est-&#224;-dire du sp&#233;cifique au g&#233;n&#233;rique, (voir macrostructure et microstructure, [Kintsch 
1998: 50 ss.]. Cette identification de l&#8217; orientation, apport&#233;e entre autres par les pr&#233;dications, 
est primordiale pour un d&#233;chiffrage correct de la coh&#233;rence s&#233;mantique et pragmatique du 
texte. 
</p>
<p>Pour naviguer dans l&#8217; objet texte, nous isolons des unit&#233;s textuelles qui permettent de sp&#233;cifier 
des op&#233;rations de navigation, ce qui &#233;quivaut &#224; &#233;tablir des liens de coh&#233;rence entre des unit&#233;s 
de m&#234;me nature. Comme les &#233;l&#233;ments textuels appartiennent &#224; des types diff&#233;rents, la 
navigation permet d&#8217; une part de suivre des pistes de coh&#233;rence diff&#233;rentes dans un m&#234;me 
texte, et d&#8217; autre part d&#8217; en identifier les r&#233;alisations linguistiques dans une langue donn&#233;e (ici 
et pour le moment, le fran&#231;ais). Plut&#244;t que de manipuler des structures textuelles hi&#233;rarchiques 
[Couto, Minel 2004], nous distinguons ici des pistes parall&#232;les de marques textuelles qui 
chacune contribue &#224; un type particulier de coh&#233;rence. Ces types de coh&#233;rence sont fond&#233;s, 
grosso modo, sur les principes expos&#233;s dans [Lundquist 1980], selon lesquels on peut 
distinguer dans les textes une coh&#233;rence r&#233;f&#233;rentielle, une coh&#233;rence pr&#233;dicative et une 
coh&#233;rence pragmatique, fond&#233;e respectivement sur les trois actes de langage : la r&#233;f&#233;rence, la 
pr&#233;dication et l&#8217; illocution qui entrent dans l&#8217; &#233;nonciation de chaque phrase [Searle 1969]. En 
fait, chaque phrase contient, en r&#232;gle g&#233;n&#233;rale, un ou des SN qui r&#233;f&#232;rent &#224; des entit&#233;s extra-
textuelles et instaurent des r&#233;f&#233;rents discursifs ; une ou plusieurs pr&#233;dications qui d&#8217; une part 
pr&#233;diquent des propri&#233;t&#233;s et &#233;tablissent des relations s&#233;mantiques entre les r&#233;f&#233;rents discursifs 
et d&#8217; autre part peuvent porter des traces &#233;nonciatives, indicateurs avec d&#8217; autres, comme par 
exemple les connecteurs, de l&#8217; acte d&#8217; illocution : d&#233;crire, convaincre, etc., et de la coh&#233;rence 
pragmatique. 
</p>
<p> A partir de ces unit&#233;s, il importe d&#8217; identifier les pistes de coh&#233;rence qui sont propres au texte 
en question. Ainsi, dans l&#8217; exemple 1, le titre L&#8217;amnistie fiscale n&#8217;est pas immorale ! installe 
un programme d&#8217; interpr&#233;tation du type argumentatif, avec deux voix, celle du protagoniste et 
celle de l&#8217; antagoniste : L&#8217;amnistie fiscale est immorale. Ces deux voix ouvrent deux pistes de 
coh&#233;rence, qui sont &#224; identifier et &#224; relier de par le texte par les proc&#233;d&#233;s de navigation. Elles 
sont identifiables, entre autres, par des marqueurs argumentatifs, tels que les modes 
(l&#8217; indicatif  et le conditionnel) et les connecteurs (il est vrai, mais faut-il pour autant&#8230;). 
Nous allons illustrer l&#8217; exploitation de ces marques sur le texte suivant : 
</p>
<p>EXEMPLE (1) :&#3;&#169;&#3;/&#10;DPQLVWLH&#3;ILVFDOH&#3;Q&#10;HVW&#3;SDV&#3;LPPRUDOH&#3;&#4;&#3;3$5&#3;)/25,1&#3;$)7$/,21&#3;&#3; 
</p>
<p>&#171; Le gouvernement de Jean-Pierre Raffarin &#233;tudie l'opportunit&#233; d'instituer une taxe sur les 
fonds plac&#233;s &#224; l'&#233;tranger et rapatri&#233;s en France. Le produit de cette taxe financerait le plan </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Javier Couto, Lita Lundquist, Jean-Luc Minel 
</p>
<p>que vient de d&#233;voiler son ministre de la Coh&#233;sion sociale. De nombreux responsables 
politiques ont manifest&#233; leur hostilit&#233; &#224; une telle mesure. Elle serait inefficace et, surtout, 
immorale car elle blanchirait les &#171;criminels en col blanc&#187;. [&#8230;] Une telle somme ne 
contribuerait, il est vrai, que modestement au financement du plan de coh&#233;sion sociale dont le 
co&#251;t, en cinq ans, se monterait &#224; 13 milliards d'euros. Mais faut-il pour autant d&#233;clarer la 
mesure envisag&#233;e par M. Raffarin inefficace ? Non, car d'autres avantages en r&#233;sulteraient. 
Des capitaux import&#233;s, qu'ils soient pr&#234;t&#233;s ou investis, cr&#233;ent des emplois. &#187; [Le Figaro, le 16 
juillet 2004]. 
</p>
<p>De m&#234;me, il est possible de naviguer entre des unit&#233;s fond&#233;es sur des r&#233;f&#233;rents discursifs, tel 
la taxe, qui est reprise par des anaphores du type cette taxe, une telle mesure, elle, la mesure 
envisag&#233;e par M. Raffarin, des types de reprises anaphoriques qui pr&#234;tent amplement &#224; des 
commentaires linguistiques contrastives. 
</p>
<p>3 Mod&#233;lisation et description des connaissances de visualisation 
et de navigation 
</p>
<p>Avant de d&#233;crire le langage qui permet d&#8217; encoder les connaissances de visualisation et de 
navigation, il convient de rappeler bri&#232;vement le mod&#232;le de description du texte utilis&#233;. En 
effet, le texte trait&#233; par NaviTexte doit &#234;tre pr&#233;alablement annot&#233;1 ce qui implique un choix 
dans les unit&#233;s textuelles susceptibles d&#8217; &#234;tre annot&#233;es, et par cons&#233;quent un mod&#232;le de 
description du texte le plus flexible possible.  Notre associe une description hi&#233;rarchique, il est 
possibilit&#233; d&#8217; embo&#238;ter des unit&#233;s textuelles de type diff&#233;rent, et une description ouverte gr&#226;ce 
aux m&#233;canismes pr&#233;d&#233;finis de cr&#233;ation de nouveaux &#233;l&#233;ments. Il faut n&#233;anmoins souligner que 
la s&#233;mantique de ces relations est implicite, ce qui implique qu&#8217; elle doit &#234;tre prise en compte 
par le concepteur des modules de navigation. La repr&#233;sentation du texte se d&#233;crit dans un 
format standard XML et se divise en deux parties : le Corps, o&#249; les unit&#233;s textuelles, 
significatives pour la t&#226;che sont d&#233;limit&#233;es, et la  T&#234;te, o&#249; s&#8217; expriment les relations non 
hi&#233;rarchiques entre ces m&#234;mes unit&#233;s. Dans le Corps, l&#8217; &#233;l&#233;ment de base de notre mod&#232;le est 
l&#8217; Unit&#233; Textuelle (UT) typ&#233;e, ce qui permet d&#8217; incorporer de nouveaux &#233;l&#233;ments textuels de 
mani&#232;re simple. Une UT peut avoir un titre associ&#233; et un nombre non limit&#233; d&#8217; attributs typ&#233;s 
et valu&#233;s. Les unit&#233;s textuelles les plus internes poss&#232;dent un &#233;l&#233;ment nomm&#233; cha&#238;ne qui 
repr&#233;sente la cha&#238;ne de caract&#232;res typographiques. Dans la T&#234;te, il est possible de d&#233;finir de 
nouveaux &#233;l&#233;ments compos&#233;s d&#8217; unit&#233;s textuelles du Corps du texte en les associant avec sous 
la forme d&#8217; un Ensemble, d&#8217; une S&#233;quence, d&#8217; une Reference ou d&#8217; un Graphe. Un Ensemble 
d&#233;finit un ensemble d&#8217; UT ; Une S&#233;quence d&#233;finit un ensemble ordonn&#233; d&#8217; UT ; Une Reference 
d&#233;finit une relation entre une UT et une s&#233;quence finie d&#8217; UT ; un Graphe, comme dans la TEI, 
permet de relier des unit&#233;s textuelles, les n&#339;uds du graphe, par des arcs &#233;tiquet&#233;s. Enfn, un 
nouvel &#233;l&#233;ment d&#233;crit dans la T&#234;te peut poss&#233;der des attributs propres. 
</p>
<p>                                                 
</p>
<p>1
 Le processus d&#8217; annotation du texte peut &#234;tre manuel ou r&#233;alis&#233; par une plate-forme d&#233;di&#233;e comme ContextO 
</p>
<p>[Minel &amp; al. 2001], ou Lingstream [Bilhaut &amp; al. 2003]. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Naviguer dans les textes pour apprendre 
</p>
<p>3.1 Pr&#233;sentation du langage de description des connaissances 
</p>
<p>Ce langage a pour finalit&#233; d&#8217; offrir des fonctionnalit&#233;s &#224; la fois suffisamment g&#233;n&#233;riques tout 
en proposant une s&#233;mantique qui se focalise sur l&#8217; essentiel du processus de visualisation et de 
navigation, &#224; l&#8217; inverse de langages de transformation ou de programmation comme, par 
exemple, XSLT ou XPATH. Notre langage est donc de type d&#233;claratif et s&#8217; appuie sur des 
op&#233;rations pr&#233;d&#233;finies, mais qui pourront &#234;tre enrichies en fonction du d&#233;veloppement de la 
plate-forme. Techniquement, l&#8217; ensemble des connaissances est d&#233;crit dans des modules sous 
la forme d&#8217; expressions symboliques qui doivent respecter une DTD XML. Ces modules sont 
propres &#224; chaque t&#226;che et correspondent &#224; des pratiques de lecture sp&#233;cifiques qui peuvent &#234;tre 
diff&#233;rentes pour un m&#234;me texte. 
</p>
<p>La navigation est conceptualis&#233;e comme une op&#233;ration qui relie une unit&#233; textuelle source 
avec une unit&#233; textuelle cible. Une op&#233;ration de navigation comprend une source, une cible, 
une ou plusieurs conditions, et un empan. L&#8217; ex&#233;cution d&#8217; une op&#233;ration est ainsi soumise &#224; des 
conditions qui contraignent les attributs des unit&#233;s textuelles consid&#233;r&#233;es. L&#8217; empan de texte 
peut &#234;tre sp&#233;cifi&#233; de mani&#232;re &#224; restreindre l&#8217; espace de recherche des unit&#233;s textuelles cibles. 
Chaque op&#233;ration est typ&#233;e avec une valeur qui appartient &#224; l&#8217; ensemble {Premier, Dernier, 
Suivant[i], Pr&#233;c&#233;dent[i]}. Ces valeurs sp&#233;cifient d&#8217; une part l&#8217; orientation, c&#8217; est-&#224;-dire dans 
quel sens (avant ou apr&#232;s l&#8217; unit&#233; textuelle source) doit &#234;tre effectu&#233; la recherche de l&#8217; unit&#233; 
textuelle cible, et d&#8217; autre part le r&#233;f&#233;rentiel, absolu (Premier, Dernier), ou relatif (Suivant[i], 
Pr&#233;c&#233;dent[i]), par rapport &#224; la source. Dans le cas d&#8217; un r&#233;f&#233;rencement relatif, l&#8217; index i permet 
de sp&#233;cifier le rang de la cible recherch&#233;e. Les conditions expriment des contraintes sur les 
valeurs des attributs des unit&#233;s textuelles source et/ou cible. Ces conditions simples peuvent 
&#234;tre combin&#233;es entre elles avec les op&#233;rateurs logiques (ET, OU, NON). En ce qui concerne 
l&#8217; empan, les valeurs possibles doivent &#234;tre choisies parmi les valeurs d&#233;clar&#233;es dans la partie 
Corps du mod&#232;le du texte (cf. 3). Formellement, la syntaxe g&#233;n&#233;rique d&#8217; une op&#233;ration de 
navigation est la suivante : Op&#233;ration_Navigation : (Texte, Conditions, Type,  Empan) &#147; Unit&#233; Textuelle 
</p>
<p>4 Construction des parcours de lecture 
Une premi&#232;re version de la plate-forme Navitexte, d&#233;velopp&#233;e en Java, est op&#233;rationnelle 
[Couto &amp; Minel 2004] et son utilisation pour l&#8217; apprentissage, par des &#233;tudiants &#233;trangers, des 
manifestations langagi&#232;res de la coh&#233;rence textuelle constitue une exp&#233;rimentation in&#233;dite et 
une mise &#224; l&#8217; &#233;preuve des hypoth&#232;ses fondatrices [Minel 2002]. Cette exp&#233;rimentation nous 
conduit par ailleurs &#224; r&#233;fl&#233;chir &#224; une m&#233;thodologie d&#8217; acquisition, d&#8217; organisation et 
d&#8217; exploitation des connaissances mises en &#339;uvre dans la navigation textuelle. En effet, les 
nombreuses exp&#233;riences r&#233;alis&#233;es avec l&#8217; hypertexte ont mis en &#233;vidence le ph&#233;nom&#232;ne de 
d&#233;sorientation cognitive [Cotte 2004] engendr&#233; par une trop grande richesse dans le graphe 
des lectures possibles. Comme le montre l&#8217; exp&#233;rimentation d&#233;crite pr&#233;c&#233;demment, le 
concepteur d&#8217; un module doit faire face &#224; deux difficult&#233;s. Premi&#232;rement, les parcours de 
navigation qu&#8217; il con&#231;oit sont en g&#233;n&#233;ral construits &#224; partir d&#8217; exemples de textes annot&#233;s, alors 
que les modules vont s&#8217; appliquer sur toute une &#171; famille &#187; de textes qui pr&#233;sentent le m&#234;me 
type d&#8217; annotations. Il s&#8217; agit alors pour le concepteur d&#8217; anticiper les effets  que peuvent 
impliquer l&#8217; utilisation de certaines variantes par un scripteur qui ne se conformerait pas aux 
standards, plus ou moins normatifs, des pratiques d&#8217; &#233;criture. Dans le cas de l&#8217; apprentissage, ce 
probl&#232;me peut &#234;tre r&#233;solu par un contr&#244;le des textes propos&#233;s, mais cette situation est 
sp&#233;cifique et nous visons une utilisation de Navitexte beaucoup plus flexible. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Javier Couto, Lita Lundquist, Jean-Luc Minel 
</p>
<p>La deuxi&#232;me difficult&#233; d&#233;coule de notre conceptualisation d&#8217; une op&#233;ration de navigation qui 
est une relation, de type 1-1, entre une source et une cible. Ce qui implique qu&#8217; une unit&#233; cible 
pour une op&#233;ration Op1 peut &#234;tre une source pour une op&#233;ration Opp et qu&#8217; une plusieurs 
op&#233;rations Opi peuvent avoir la m&#234;me source. Un module de navigation construit ainsi un 
graphe de parcours orient&#233; entre des unit&#233;s textuelles, et c&#8217; est la ma&#238;trise de ce graphe, dans 
son aspect combinaoire qu&#8217; il convient de maitriser. Notre solution repose sur le 
d&#233;veloppement d&#8217; un environnement d&#8217; aide &#224; la conception qui propose au concepteur des 
aides visuelles &#224; la fois g&#233;n&#233;riques, ind&#233;pendantes d&#8217; un texte, et sp&#233;cifiques, par l&#8217; ex&#233;cution 
d&#8217; un module sur un texte &#233;ventuellement fabriqu&#233; pour la validation2. 
</p>
<p>5 Conclusion 
Nous avons pr&#233;sent&#233; une exp&#233;rimentation d'aide &#224; l'apprentissage des proc&#233;d&#233;s de marquage 
de la coh&#233;rence textuelle qui s'appuie sur l'utilisation d'un outil de navigation dans les textes, 
Navitexte. Concue &#224; l'origine &#224; partir des r&#233;sultats obtenus dans le cadre de travaux men&#233;s 
dans le domaine du filtrage s&#233;mantique [Minel &amp; al. 2001] et de la segmentation th&#233;matique 
[Couto &amp; al. 2004], les concepts de navigation et de visualisation propos&#233;s d&#233;montrent ainsi 
leur plasticit&#233; et leur g&#233;n&#233;ricit&#233;. 
</p>
<p>R&#233;f&#233;rences  
BILHAUT, F., HO-DAC, M., BORILLO, A., CHARNOIS, T., ENJALBERT, P., LE DRAOULEC, A., MATHET, Y., MIGUET, H., PERY-
</p>
<p>WOODLEY, M .P., SARDA, L., (2003), &#171; Indexation discursive pour la navigation intradocumentaire : cadres temporels et 
spatiaux dans l&#8217; information g&#233;ographique &#187;, $FWHV&#3;GH&#3;7$/1, Batz-sur Mer, , p. 315-320. 
</p>
<p>CHAROLLES, M. (1981), &#171;Coherence as a principle in the interpretation of discourse &#170;. 7H[W 3, p. 71-99. 
CHAROLLES, M. (1997), &#171; L'encadrement du discours : univers, champs, domaines et espaces &#187;, &amp;DKLHU&#3;GH&#3;5HFKHUFKH&#3;
</p>
<p>/LQJXLVWLTXH&#15;&#3;/$1',6&amp;2, Universit&#233; Nancy 2, p. 1-73. 
COTTE, D. (2004), &#171; Leurres, ruses, d&#233;sorientation dans les &#233;crits de r&#233;seau : la m&#233;tis &#224; l&#8217; &#233;cran. &#187;, &amp;RPPXQLFDWLRQ&#3;&#9;&#3;
</p>
<p>ODQJDJHV, n&#176; 139, Avril 2004, p. 63-74. 
COUTO, J., FERRET, O., GRAU, B., HERNANDEZ, N., JACKIEWICZ, A., MINEL, J.-L., PORHIEL, S. (2004), &#171; R&#201;GAL, un syst&#232;me 
</p>
<p>pour la visualisation s&#233;lective de documents. &#187;, 5HYXH&#3;G&#10;,QWHOOLJHQFH&#3;$UWLILFLHOOH, Herm&#232;s, p. 481-514. 
COUTO, J., MINEL, J.-L. (2004), &#171; Outils dynamiques de fouilles textuelles &#187;,&#3;$FWHV&#3;GH&#3;5,$2&#15;&#3;Avignon, p. 420-430.  
KINTSCH, W. (1998), &amp;RPSUHKHQVLRQ&#17;&#3;$&#3;3DUDGLJP&#3;IRU&#3;&amp;RJQLWLRQ, Cambridge, Cambridge University Press. 
LUNDQUIST, L. (1980), /D&#3;FRKpUHQFH&#3;WH[WXHOOH&#29;&#3;V\QWD[H&#15;&#3;VpPDQWLTXH&#15;&#3;SUDJPDWLTXH. Copenhagen : Nordisk Forlag. 
LUNDQUIST, L. (1999), &#171; Le factum textus. Fait de grammaire, fait de linguistique ou fait de cognition? &#187; /DQJXH&#3;IUDQoDLVH. 
</p>
<p>56-75. 
</p>
<p>LUNDQUIST, L. (a para&#238;tre)  &#171; Noms, verbes et anaphores (in)fid&#232;les. Pourquoi les Danois sont plus fid&#232;les que les Fran&#231;ais. &#187;, 
/DQJXH&#3;IUDQoDLVH. 
</p>
<p>MINEL, J.-L., CARTIER, E., CRISPINO, G., DESCL&#201;S, J.-P., BEN HAZEZ, S., JACKIEWICZ, A. (2001), &#171; R&#233;sum&#233; automatique par 
filtrage s&#233;mantique d&#8217; informations dans des textes, Pr&#233;sentation de la plate-forme FilText &#187;, 7HFKQLTXH&#3;HW&#3;6FLHQFH&#3;
,QIRUPDWLTXHV&#15;&#3;n&#176; 3, Herm&#232;s, Paris, p. 369-396 
</p>
<p>SEARLE, J. (1969), 6SHHFK&#3;$FWV&#15;&#3;$Q&#3;(VVD\&#3;LQ&#3;WKH&#3;3KLORVRSK\&#3;RI&#3;/DQJXDJH, Cambridge, Cambridge University Press. 
 
</p>
<p>                                                 
</p>
<p>2
 Ce travail a &#233;t&#233; r&#233;alis&#233; par deux &#233;tudiants, Isabelle Ranque et Benoit Lamey, du DESS ILSI de l&#8217; Universit&#233; 
</p>
<p>Paris-Sorbonne. </p>

</div></div>
</body></html>