<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Utilisation de corpus de sp&#233;cialit&#233; pour le filtrage de synonymes de la langue g&#233;n&#233;rale</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Utilisation de corpus de sp&#233;cialit&#233;
pour le filtrage de synonymes de la langue g&#233;n&#233;rale&#8727;
</p>
<p>Natalia Grabar1, 2, Pierre Zweigenbaum1, 2
(1) INSERM, U729, 75006 Paris ;
</p>
<p>(2) INALCO, CRIM, 75343 Paris Cedex 07 ;
(3) Assistance Publique - H&#244;pitaux de Paris, STIM/DSI, 75674 Paris Cedex 14
</p>
<p>{ngr,pz}@biomath.jussieu.fr
</p>
<p>Mots-clefs : Langue de sp&#233;cialit&#233;, langue g&#233;n&#233;rale, structuration de terminologies, sy-
nonymes, portabilit&#233;, filtrage
</p>
<p>Keywords: Specialized language, general language, terminology structuring, synonyms,
portability, filtering
</p>
<p>R&#233;sum&#233; Les ressources linguistiques les plus facilement disponibles en TAL ressortissent
g&#233;n&#233;ralement au registre g&#233;n&#233;ral d&#8217;une langue. Lorsqu&#8217;elles doivent &#234;tre utilis&#233;es sur des textes
de sp&#233;cialit&#233; il peut &#234;tre utile de les adapter &#224; ces textes. Cet article est consacr&#233; &#224; l&#8217;adaptation
de ressources synonymiques g&#233;n&#233;rales &#224; la langue m&#233;dicale. L&#8217;adaptation est obtenue suite &#224;
une s&#233;rie de filtrages sur un corpus du domaine. Les synonymes originaux et les synonymes
filtr&#233;s sont ensuite utilis&#233;s comme une des ressources pour la normalisation de variantes de
termes dans une t&#226;che de structuration de terminologie. Leurs apports respectifs sont &#233;valu&#233;s
par rapport &#224; la structure terminologique de r&#233;f&#233;rence. Cette &#233;valuation montre que les r&#233;sultats
sont globalement encourageants apr&#232;s les filtrages, pour une t&#226;che comme la structuration de
terminologies : une am&#233;lioration de la pr&#233;cision contre une l&#233;g&#232;re diminution du rappel.
</p>
<p>Abstract General language resources are often more easily available for NLP applica-
tions. When using them to process specialized texts it might be useful to adapt them to these
texts. This paper describes experiments in adapting general language synonymous resources to
the medical domain. A set of filtering methods through a domain corpora is applied. Original
and filtered synonyms are then used for normalizing term variation in a terminology structuring
task. Their relative contributions are evaluated in comparison with the original structure of the
reference terminology. This evaluation shows that the overall results are encouraging, as for the
terminology structuring task : improvement of precision while recall is slightly decreased.
</p>
<p>&#8727;Nos exp&#233;riences en structuration de terminologies ont &#233;t&#233; pr&#233;sent&#233;es dans (Grabar &amp; Zweigenbaum, 2004).
Cet article est plus sp&#233;cifiquement consacr&#233; &#224; l&#8217;adaptation de ressources linguistiques g&#233;n&#233;rales aux textes de
sp&#233;cialit&#233; et &#224; l&#8217;influence de cette adaptation sur les r&#233;sultats.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Natalia Grabar, Pierre Zweigenbaum
</p>
<p>1 Introduction
</p>
<p>Les ressources linguistiques les plus facilement disponibles en TAL ressortissent g&#233;n&#233;ralement
au registre g&#233;n&#233;ral d&#8217;une langue : lexiques flexionnels, dictionnaires g&#233;n&#233;raux, synonymes, etc.
Par d&#233;finition, la contrainte de sp&#233;cialisation domaniale est absente de ces ressources. Pour ob-
tenir de meilleurs r&#233;sultats lors de leur utilisation dans un domaine de sp&#233;cialit&#233;, une adaptation
&#224; ce domaine peut &#234;tre utile. Le but de ce travail consiste ainsi &#224; adapter un ensemble de syno-
nymes g&#233;n&#233;raux au domaine m&#233;dical gr&#226;ce aux filtrages effectu&#233;s sur un corpus m&#233;dical. Nous
utilisons les synonymes originaux et filtr&#233;s, &#224; c&#244;t&#233; d&#8217;autres ressources et traitements, pour la
normalisation de variantes de termes m&#233;dicaux. Ces normalisations s&#8217;av&#232;rent importantes dans
de nombreuses applications (indexation et recherche d&#8217;information, questions-r&#233;ponses, codage
dans des terminologies contr&#244;l&#233;es, acquisition terminologique, traduction, etc.). Avec des ob-
jectifs similaires, (Jacquemin, 1999) applique des r&#232;gles de transformation morpho-syntaxique
pour apparier les termes d&#8217;un corpus avec une terminologie contr&#244;l&#233;e. Dans le domaine m&#233;di-
cal, (McCray et al., 1994) exploitent en plus d&#8217;autres niveaux de normalisation pour mettre en
correspondance des termes provenant de diff&#233;rentes terminologies. En structuration de termi-
nologies, (Hamon et al., 1998) utilisent des synonymes simples pour la d&#233;tection de liens de
synonymie entre termes complexes, gr&#226;ce &#224; la compositionnalit&#233; s&#233;mantique. Dans les exp&#233;-
riences pr&#233;sent&#233;es ici, nous effectuons diff&#233;rents types de normalisation de termes (traitements
au niveau de caract&#232;res et de l&#8217;ordre de mots, ressources morphologiques et synonymiques) : des
termes potentiellement proches par leur sens peuvent ainsi &#234;tre appari&#233;s. Nous appliquons ces
diff&#233;rentes normalisations en structuration de terminologies, &#224; travers l&#8217;hypoth&#232;se d&#8217;inclusion
lexicale qui nous permet d&#8217;induire des relations hyperonymiques entre termes.
</p>
<p>Dans la section 2, nous pr&#233;sentons les synonymes g&#233;n&#233;raux provenant du Petit Robert ; dans la
section 3, les m&#233;thodes pour le filtrage de ces synonymes et pour leur &#233;valuation. L&#8217;&#233;valuation
est faite au sein d&#8217;une t&#226;che de structuration de terminologie, o&#249; la structure induite est com-
par&#233;e avec la structure originale de ces m&#234;mes termes. Dans la section 4, nous pr&#233;sentons et
analysons les r&#233;sultats. Nous terminons avec une conclusion et des perspectives (sec. 5).
</p>
<p>2 Synonymes de la langue g&#233;n&#233;rale : Le Robert
</p>
<p>L&#8217;innovation du dictionnaire Le Robert a &#233;t&#233; le d&#233;passement de l&#8217;organisation alphab&#233;tique des
lex&#232;mes gr&#226;ce &#224; l&#8217;ajout des rapports analogiques &#233;tablis sur la base des &#233;tymologies, d&#233;finitions,
encha&#238;nements syntaxiques, liens de synonymie et d&#8217;antonymie (Robert, 1967). L&#8217;ensemble de
ces rapports permet aux usagers de saisir plus ais&#233;ment le sens des lex&#232;mes. Il a fourni &#233;gale-
ment les s&#233;ries de synonymes que nous utilisons : plus de 140 000 paires de synonymes simples,
comme par exemple {culot, fond}. Elles semblent correspondre &#224; une &#233;dition des ann&#233;es 70 de
ce dictionnaire1. Plusieurs questions peuvent se poser lors de l&#8217;utilisation de ressources syno-
nymiques en TAL. Nous discutons ici de leur sym&#233;trie, transitivit&#233; et sp&#233;cialisation.
</p>
<p>La synonymie, reliant des lex&#232;mes ou expressions contextuellement interchangeables (Cruse,
1986, p. 88), est souvent consid&#233;r&#233;e comme une relation sym&#233;trique. Les ressources synony-
miques du Robert se pr&#233;sentent sous forme {entr&#233;e dictionnairique, famille de synonymes} ou
{entr&#233;e dictionnairique, synonyme}. Nous consid&#233;rons alors l&#8217;entr&#233;e dictionnairique comme
</p>
<p>1Nous remercions l&#8217;INaLF et Didier Bourigault d&#8217;avoir rendu ces ressources disponibles, Thierry Hamon de
nous les avoir fournies nettoy&#233;es et format&#233;es et Jean-Luc Manguin de nous avoir communiqu&#233; leur datation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Filtrage de synonymes de la langue g&#233;n&#233;rale
</p>
<p>canon vers lequel sa famille ou ses synonymes peuvent &#234;tre &#171; normalis&#233;s &#187;. Par contre, nous
n&#8217;autorisons pas la normalisation dans le sens oppos&#233;, ni donc la sym&#233;trie. Cela semble raison-
nable, comme le montre l&#8217;exemple de la famille boulimie :
</p>
<p>boulimie : cynorexie, hyperorexie, hyperphagie, sitiomanie, faimcalle, app&#233;tit, avi-
dit&#233;,
</p>
<p>qui re&#231;oit, si nous consid&#233;rons la synonymie comme une relation sym&#233;trique, faim, fringale et
fr&#233;n&#233;sie. De la m&#234;me mani&#232;re, ventre passe de 11 synonymes &#224; 19 et trouble de 22 &#224; 64.
Lors de l&#8217;utilisation de synonymes, pour ne pas g&#233;n&#233;rer trop de bruit, nous ne calculons pas de
fermeture transitive compl&#232;te. Par contre, nous autorisons une transitivit&#233; &#171; locale &#187; : au sein
d&#8217;une famille, deux synonymes (comme cynorexie et hyperorexie) peuvent &#234;tre normalis&#233;s vers
leur entr&#233;e (boulimie), et donc consid&#233;r&#233;s eux-m&#234;mes comme synonymes.
Et enfin, la sp&#233;cialisation de ces ressources. D&#8217;une part, les sens sp&#233;cifiques peuvent manquer,
ce qui peut &#234;tre cause de silence. Par exemple, la famille culot :
</p>
<p>culot : fond, d&#233;p&#244;t, r&#233;sidu, benjamin, aplomb, assurance, audace, effronterie, tou-
pet, estomac.
</p>
<p>ne contient pas l&#8217;acception m&#233;dicale (&#171; Amas d&#8217;&#233;rythrocytes tass&#233;s au fond du r&#233;cipient de
conservation apr&#232;s centrifugation du plasma sanguin &#187;) proche de transfusion. D&#8217;autre part,
le m&#233;lange de registres et donc l&#8217;instabilit&#233; s&#233;mantique des lex&#232;mes, surtout dans un contexte
de sp&#233;cialit&#233;, peuvent &#234;tre cause de bruit. Rappelons que les rapports analogiques du Robert
peuvent correspondre en r&#233;alit&#233; &#224; plusieurs relations, g&#233;n&#233;ralement non distingu&#233;es (synonymes,
analogies, th&#232;mes d&#8217;expressions, variantes orthographiques, sous-entr&#233;es, hyperonymes, etc.) et
mettent ensemble des donn&#233;es fondamentalement h&#233;t&#233;rog&#232;nes (Marcus, 2003). Pour toutes ces
raisons, il peut &#234;tre utile de filtrer les synonymes de la langue g&#233;n&#233;rale, surtout lorsqu&#8217;ils doivent
&#234;tre utilis&#233;s dans des traitements automatiques appliqu&#233;s &#224; un domaine de sp&#233;cialit&#233;.
</p>
<p>3 M&#233;thodes
</p>
<p>3.1 M&#233;thode d&#8217;adaptation des synonymes g&#233;n&#233;raux
</p>
<p>Pour l&#8217;adaptation de synonymes g&#233;n&#233;raux aux textes de sp&#233;cialit&#233;, nous utilisons un corpus
m&#233;dical d&#8217;environ 8,5 millions d&#8217;occurrences. Ce corpus contient des documents hospitaliers
(lettres, comptes rendus hospitaliers) et des documents Web collect&#233;s &#224; travers le portail m&#233;dical
CISMeF (Darmoni et al., 2001)2. Nous supposons ainsi que les synonymes les plus pertinents
doivent appartenir au m&#234;me registre. Les tests utilis&#233;s se basent sur le fait que ces synonymes
apparaissent dans les m&#234;mes textes et &#171; pas trop loin &#187; (cf. Recherche d&#8217;associations), et plus
sp&#233;cifiquement qu&#8217;il existe des constructions syntaxiques qui sont des indices forts de synony-
mie (cf. Rep&#233;rage d&#8217;indices de synonymie).
</p>
<p>Recherche d&#8217;associations. La recherche de mots associ&#233;s (cooccurrences, collocations, etc.,
voir (Manning &amp; Sch&#252;tze, 1999)) est une m&#233;thode courante en TAL &#171; &#224; base de corpus &#187;. Nous
utilisons la mesure du &#171; rapport de vraisemblance &#187; (log likelihood ratio) comme dans (Zwei-
genbaum et al., 2003), dont nous avons repris et adapt&#233; les programmes. Nous recherchons des
</p>
<p>2http://www.chu-rouen.fr/cismef/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Natalia Grabar, Pierre Zweigenbaum
</p>
<p>paires de synonymes qui cooccurrent plus souvent que le hasard dans une fen&#234;tre de 2*150 mots
pleins. Cela permet de confirmer des paires de synonymes comme :
</p>
<p>{abc&#232;s, phlegmon}, {biopsie, ponction} et {dernier, culot}, {signal, appel}.
Avec cette approche de filtrage, une premi&#232;re s&#233;lection est faite &#224; travers le corpus : les syno-
nymes doivent appara&#238;tre dans la fen&#234;tre de mots fix&#233;e. Une deuxi&#232;me s&#233;lection est faite gr&#226;ce
au classement : les associations de synonymes les plus stables ont un meilleur classement.
</p>
<p>Rep&#233;rage d&#8217;indices de synonymie en corpus. Les patrons lexico-syntaxiques (S&#233;gu&#233;la &amp;
Aussenac-Gilles, 1999) et les marqueurs de coordination (Lame, 2002, sec.6.1) sont utilis&#233;s
par les auteurs pour la structuration de termes. Ils sont projet&#233;s sur les corpus et permettent de
mettre au jour des relations s&#233;mantiques recherch&#233;es entre les termes X et Y :
</p>
<p>&#171; X appel&#233; Y &#187;, &#171; X est d&#233;fini comme 1-MOT Y &#187;,
&#171; X est confondu avec Y &#187;, &#171; X n&#8217;est autre que 1-MOT Y &#187;,
&#171; X ou Y &#187;, &#171; X ni Y &#187;, &#171; X et Y &#187;, &#171; pas de X, pas de Y &#187;.
</p>
<p>La projection de patrons de synonymie et marqueurs de coordination sur notre corpus permet
de valider des paires de synonymes comme :
&#8211; {gonflement, &#339;d&#232;me} : &#171; L&#8217;&#339;d&#232;me est d&#233;fini comme un gonflement palpable produit par l&#8217;ex-
</p>
<p>pansion du volume interstitiel liquidien. &#187;
&#8211; {rhinopharynx, cavum} : &#171; Le rhinopharynx appel&#233; cavum est situ&#233; sous la base du cr&#226;ne, en arri&#232;re
</p>
<p>des fosses nasales, au-dessus de l&#8217;oropharynx et en avant des 2 premi&#232;res vert&#233;bres cervicales. &#187;
&#8211; {syndrome, affection} : &#171; Cette affection est appel&#233;e le syndrome h&#233;pato-r&#233;nal qui est d&#233;fini
</p>
<p>comme une augmentation progressive de la cr&#233;atinine plasmatique, sans cause &#233;vidente autre chez un
patient atteint de maladie h&#233;patique avanc&#233;e. &#187;
</p>
<p>&#8211; {repos, sommeil} : &#171; Trop souvent, repos est confondu avec sommeil et activit&#233; avec &#233;veil. &#187;
&#8211; {bruit, souffle} : &#171; Examen cardiaque : bruits bien frapp&#233;s aux 4 foyers sans souffle ni bruit surajou-
</p>
<p>t&#233;s. &#187;
&#8211; {orthopn&#233;e, dyspn&#233;e} : &#171; Examen cardio-vasculaire : pas de dyspn&#233;e, pas d&#8217;orthopn&#233;e, pr&#233;sence
</p>
<p>d&#8217;&#339;d&#232;mes des membres inf&#233;rieurs avec un godet positif. &#187;
</p>
<p>3.2 M&#233;thodes d&#8217;&#233;valuation du filtrage des synonymes
</p>
<p>L&#8217;&#233;valuation des synonymes originaux et des synonymes filtr&#233;s est faite &#224; travers une t&#226;che de
structuration de termes (Grabar &amp; Zweigenbaum, 2004). Les synonymes, &#224; c&#244;t&#233; d&#8217;autres traite-
ments et ressources, sont utilis&#233;s pour la normalisation de la variation des termes du thesaurus
MeSH (NLM, 2001)3. Nous recourons &#224; ces normalisations en effectuant des calculs d&#8217;inclu-
sions lexicales pour la d&#233;tection de relations hi&#233;rarchiques. Nous utilisons ensuite la structure
originale du MeSH comme r&#233;f&#233;rence pour &#233;valuer le rappel et la pr&#233;cision des relations induites.
</p>
<p>D&#233;tection d&#8217;inclusions lexicales. L&#8217;inclusion lexicale est naturellement utilis&#233;e dans la for-
mation de termes (Kleiber &amp; Tamba, 1990) :
</p>
<p>acides gras / acides gras indispensables.
Nous exploitons ce fait pour la d&#233;tection de relations hyperonymiques entre termes. Pour ceci,
nous v&#233;rifions si tous les mots d&#8217;un terme sont inclus dans un autre terme. Si c&#8217;est le cas, le
terme inclus est suppos&#233; &#234;tre le p&#232;re hi&#233;rarchique P , et le terme incluant, son fils F . Nous
effectuons les tests sur les termes segment&#233;s en mots, d&#8217;abord sur leurs formes brutes et ensuite
avec une s&#233;rie de normalisations :
</p>
<p>3http://www.nlm.nih.gov/mesh/meshhome.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Filtrage de synonymes de la langue g&#233;n&#233;rale
</p>
<p>&#8211; normalisation de base : conversion en caract&#232;res minuscules, suppression des accents, de la
ponctuation, des nombres et des mots &#171; vides &#187; ;
</p>
<p>&#8211; normalisations avec des ressources morphologiques flexionnelles de la langue m&#233;dicale et
g&#233;n&#233;rale, des ressources d&#233;rivationnelles et allomorphiques ;
</p>
<p>&#8211; normalisations avec des synonymes qui sont ceux de la langue m&#233;dicale, soit ceux de la
langue g&#233;n&#233;rale, soit les synonymes de la langue g&#233;n&#233;rale filtr&#233;s sur les corpus m&#233;dicaux.
</p>
<p>Les ressources linguistiques utilis&#233;es se pr&#233;sentent sous forme de paires de mots {canon, forme}.
Lors des traitements, si un mot d&#8217;un terme correspond &#224; une forme, il est normalis&#233; en son canon
correspondant.
</p>
<p>Nous effectuons la mise en minuscules et la suppression d&#8217;accents parce que dans la version
2001 du MeSH les termes &#233;taient encore &#233;crits en majuscules non accentu&#233;es (EPITHELIOMA
SQUIRRHEUX), tandis que nos ressources linguistiques sont en minuscules accentu&#233;es {car-
cinome, &#233;pith&#233;lioma}. &#192; c&#244;t&#233; de cela, les termes du MeSH, qui correspondent &#224; un langage
d&#8217;indexation artificiel, peuvent comporter des virgules (VIRUS A ADN, INFECTIONS) ou faire
omission des mots grammaticaux (LESION REPERFUSION MYOCARDIQUE), ce qui ex-
plique que nous appliquons une suppression automatique de la ponctuation, des mots &#171; vides &#187;
et que nous ignorons l&#8217;ordre des mots. L&#8217;abstraction de l&#8217;ordre des mots et des mots &#171; vides &#187; est
aussi utile lorsque les termes &#224; apparier comportent des d&#233;rivations (st&#233;nose de l&#8217;aorte et aorte
st&#233;nos&#233;e, TRANSPLANTATION CARDIAQUE et TRANSPLANTATION COEUR-POUMON).
Notons &#233;galement que nous n&#8217;effectuons pas d&#8217;analyse syntaxique. L&#8217;ensemble de nos norma-
lisations peut ainsi conduire vers des appariements non pertinents (AGE DENTAIRE / SOINS
DENTAIRES SUJET AGE). On peut supposer qu&#8217;une analyse syntaxique des d&#233;pendances dans
les termes permettrait d&#8217;en &#233;liminer un certain nombre.
</p>
<p>&#201;valuation par rapport au r&#233;f&#233;rentiel existant. Pour &#233;valuer les relations induites, nous
les comparons avec les relations qui existent dans la structure originale du thesaurus MeSH.
Nous cherchons ainsi &#224; savoir si les relations hi&#233;rarchiques du MeSH pouvent &#234;tre induites avec
l&#8217;hypoth&#232;se d&#8217;inclusion lexicale. Nous calculons alors le rappel et la pr&#233;cision (rMeSH est le
nombre de relations dans le MeSH (95 815), re le nombre de relations induites existant dans le
MeSH, et rn le nombre de relations induites hors-MeSH) : R = rerMeSH ;P = rere+rn
</p>
<p>4 Apport du filtrage des synonymes : r&#233;sultats et analyse
</p>
<p>Nous avons mis en &#339;uvre les m&#233;thodes de filtrage pr&#233;sent&#233;es en 3.1 aux synonymes du Robert
(sec. 2) &#224; l&#8217;aide du corpus m&#233;dical. Les synonymes originaux et filtr&#233;s ont &#233;t&#233; utilis&#233;s dans la
t&#226;che de structuration de terminologies (sec. 3.2). Nous pr&#233;sentons ici les r&#233;sultats du filtrage
des synonymes et leur impact relatif sur la t&#226;che de structuration : &#233;volution quantitative des re-
lations, utilisation effective des ressources linguistiques, &#233;valuation de ces relations par rapport
&#224; la structure originale du MeSH et analyse de quelques relations.
</p>
<p>Filtrage des synonymes. Le calcul d&#8217;associations permet de valider le nombre le plus &#233;lev&#233;
de synonymes : 15 589 paires en gardant 60 % des meilleures associations ; les marqueurs de
coordination en valident 1 736 et les patrons lexico-syntaxiques 46 paires. Le filtrage complet
(union) nous donne un ensemble de 16 154 paires de synonymes, soit une r&#233;duction de 88,5 %
par rapport aux 140 141 paires d&#8217;origine. Il est int&#233;ressant de remarquer qu&#8217;aucune instanciation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Natalia Grabar, Pierre Zweigenbaum
</p>
<p>de patrons de (S&#233;gu&#233;la &amp; Aussenac-Gilles, 1999) n&#8217;a &#233;t&#233; relev&#233;e dans la partie documents hos-
pitaliers du corpus. Cela semble raisonnable : ces documents s&#8217;adressent &#224; des sp&#233;cialistes avec,
comme but principal, la transmission d&#8217;informations sur les patients. Par contre dans les docu-
ments du Web, destin&#233;s souvent &#224; un public plut&#244;t non averti, les reformulations et le recours
&#224; la synonymie sont fr&#233;quents. Il appara&#238;t en outre que les marqueurs de coordination relient
souvent non des synonymes mais des co-hyponymes ({bruit, souffle}, {orthopn&#233;e, dyspn&#233;e}
dans les exemples de la sec. 3.1). Ce caract&#232;re des marqueurs d&#233;j&#224; not&#233; dans (Pearson, 1998)
est accentu&#233; ici par la nature h&#233;t&#233;rog&#232;ne des relations qui constituent les rapports analogiques
dans Le Robert. Notons que l&#8217;ensemble de filtrages utilis&#233; exploite les relations syntagmatiques
entre les mots. Il serait int&#233;ressant d&#8217;&#233;tudier en plus la piste paradigmatique, par exemple les
calculs distributionnels (Nazarenko et al., 2001).
</p>
<p>&#201;volution quantitative des relations. Le calcul d&#8217;inclusion lexicale a &#233;t&#233; appliqu&#233; &#224; une liste
&#171; &#224; plat &#187; de 19 638 termes du MeSH (&#233;crits &#224; l&#8217;&#233;poque en majuscules non accentu&#233;es). La figure
1(a) montre le nombre de relations induites &#224; chaque &#233;tape des normalisations : normalisation
des caract&#232;res et suppression des mots vides (base), application des ressources flexionnelles
de la langue g&#233;n&#233;rale (lem-gen) et de la langue m&#233;dicale (lem-med), des ressources d&#233;rivation-
nelles (rac-med) et allomorphiques (allom), des synonymes de la langue m&#233;dicale (syno-med),
de la langue g&#233;n&#233;rale (syno-gen) et des synonymes de la langue g&#233;n&#233;rale filtr&#233;s (syno-gen-f ).
Chaque ressource synonymique est utilis&#233;e alternativement, en plus des normalisations ant&#233;-
rieures (base, lem-med, rac-med et allom). Nous analysons ici les deux derni&#232;res &#233;tapes : syno-
gen (synonymes de la langue g&#233;n&#233;rale) et syno-gen-f (synonymes de la langue g&#233;n&#233;rale filtr&#233;s).
L&#8217;analyse de l&#8217;impact des synonymes m&#233;dicaux syno-med constitue une perspective. La figure
1(a) d&#233;compose le nombre total des relations induites en relations correctes (directes et indi-
rectes du MeSH4) et les nouvelles relations (hors-MeSH). Les ressources syno-gen, comportant
un nombre tr&#232;s &#233;lev&#233; de paires de synonymes, doublent le volume des relations induites &#224; l&#8217;&#233;tape
pr&#233;c&#233;dente : de 14 884 relations allom nous passons &#224; 29 969 avec syno-gen, ce qui fait 15 085
relations en plus. Avec les synonymes g&#233;n&#233;raux filtr&#233;s le volume est un peu moins important :
26 986 relations (12 102 de plus qu&#8217;avec allom).
</p>
<p>Utilisation effective des ressources linguistiques. La figure 1(b) montre l&#8217;utilisation effec-
tive de ressources linguistiques. Pour chaque normalisation, nous indiquons le nombre de mots
dans la ressource, le nombre de mots dans les termes du MeSH (15 446) et le nombre de mots
r&#233;ellement trait&#233;s. Nous pouvons ainsi voir que la totalit&#233; des ressources est rarement utilis&#233;e,
surtout avec les ressources de la langue g&#233;n&#233;rale (lem-gen et syno-gen). Cela ne ralentit pas
les calculs car seules les ressources pertinentes sont charg&#233;es. Par contre, cela montre a poste-
riori que le recouvrement entre les deux ensembles (les donn&#233;es &#224; traiter et les ressources) est
faible. Il serait int&#233;ressant de pouvoir &#233;valuer ce recouvrement avant les traitements et choisir
les ressources qui conviennent le mieux, comme proposent de le faire (Ninova et al., 2005).
</p>
<p>&#201;valuation des relations par rapport &#224; la structure du MeSH. La comparaison des re-
lations induites avec la structure originale du MeSH permet d&#8217;&#233;valuer les rappel et pr&#233;cision
(fig. 1(c) et 1(d)). Nous pouvons ainsi voir que le rappel augmente de mani&#232;re g&#233;n&#233;rale avec
l&#8217;injection de connaissances linguistiques suppl&#233;mentaires. De 13,7 % &#224; l&#8217;&#233;tape base et 21,6 %
</p>
<p>4Les relations directes existent entre un p&#232;re et un fils hi&#233;rarchiques. Les relations indirectes correspondent &#224;
toute relation d&#8217;un terme vers l&#8217;un de ses anc&#234;tres.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Filtrage de synonymes de la langue g&#233;n&#233;rale
</p>
<p> 0
 5000
</p>
<p> 10000
 15000
 20000
 25000
 30000
</p>
<p>ba
se
</p>
<p>le
m
</p>
<p>&#8722;g
en
</p>
<p>le
m
</p>
<p>&#8722;m
ed
</p>
<p>ra
c&#8722;
</p>
<p>m
ed
</p>
<p>al
lo
</p>
<p>m
</p>
<p>sy
no
</p>
<p>&#8722;m
ed
</p>
<p>sy
no
</p>
<p>&#8722;g
en
</p>
<p>sy
no
</p>
<p>&#8722;g
en
</p>
<p>&#8722;f
</p>
<p>N
om
</p>
<p>br
e 
</p>
<p>de
 li
</p>
<p>en
s
</p>
<p>Types de normalisation
</p>
<p>liens induits
liens directs
</p>
<p>liens indirects
nouveaux liens
</p>
<p>(a) &#201;volution du nombre de relations induites
</p>
<p> 0
 50000
</p>
<p> 100000
 150000
 200000
 250000
 300000
</p>
<p>ba
se
</p>
<p>le
m
</p>
<p>&#8722;g
en
</p>
<p>le
m
</p>
<p>&#8722;m
ed
</p>
<p>ra
c&#8722;
</p>
<p>m
ed
</p>
<p>al
lo
</p>
<p>m
</p>
<p>sy
no
</p>
<p>&#8722;m
ed
</p>
<p>sy
no
</p>
<p>&#8722;g
en
</p>
<p>sy
no
</p>
<p>&#8722;g
en
</p>
<p>&#8722;f
</p>
<p>Ta
ill
</p>
<p>e 
du
</p>
<p> m
at
</p>
<p>&#233;r
ie
</p>
<p>l
</p>
<p>Types de normalisation
</p>
<p>taille de ressources
taille MeSH
</p>
<p>r&#233;ellement analys&#233;s
</p>
<p>(b) Utilisation de ressources linguistiques
</p>
<p> 0
 10
 20
 30
 40
 50
</p>
<p>ba
se
</p>
<p>le
m
</p>
<p>&#8722;g
en
</p>
<p>le
m
</p>
<p>&#8722;m
ed
</p>
<p>ra
c&#8722;
</p>
<p>m
ed
</p>
<p>al
lo
</p>
<p>m
</p>
<p>sy
no
</p>
<p>&#8722;m
ed
</p>
<p>sy
no
</p>
<p>&#8722;g
en
</p>
<p>sy
no
</p>
<p>&#8722;g
en
</p>
<p>&#8722;f
</p>
<p>Ra
pp
</p>
<p>el
</p>
<p>Types de normalisation
</p>
<p>(c) Rappel des relations
</p>
<p> 0
 10
 20
 30
 40
 50
</p>
<p>ba
se
</p>
<p>le
m
</p>
<p>&#8722;g
en
</p>
<p>le
m
</p>
<p>&#8722;m
ed
</p>
<p>ra
c&#8722;
</p>
<p>m
ed
</p>
<p>al
lo
</p>
<p>m
</p>
<p>sy
no
</p>
<p>&#8722;m
ed
</p>
<p>sy
no
</p>
<p>&#8722;g
en
</p>
<p>sy
no
</p>
<p>&#8722;g
en
</p>
<p>&#8722;f
</p>
<p>Pr
&#233;c
</p>
<p>isi
on
</p>
<p>Types de normalisation
</p>
<p>(d) Pr&#233;cision des relations
</p>
<p>FIG. 1 &#8211; Illustration des diff&#233;rentes &#233;tapes du calcul des inclusions lexicales avec et sans le
filtrage des synonymes de la langue g&#233;n&#233;rale.
</p>
<p>&#224; l&#8217;&#233;tape allom il atteint un sommet avec les synonymes de la langue g&#233;n&#233;rale (37,6 %), ces
derniers pr&#233;sentant beaucoup de candidats synonymes. Suite aux filtrages, le rappel diminue : il
perd 3 % et se fixe &#224; 34,6 %. Face &#224; ces valeurs de rappel tr&#232;s faibles, n&#8217;oublions pas que nous
testons une seule approche de structuration de termes &#224; travers les relations hyponymiques,
bas&#233;e sur un type d&#8217;indices lexicaux (inclusions lexicales). Sa combinaison avec d&#8217;autres ap-
proches devrait donner une structuration plus compl&#232;te (Kavanagh, 1995). Comme c&#8217;est souvent
le cas, l&#8217;&#233;volution de la pr&#233;cision est oppos&#233;e : l&#8217;injection de connaissances suppl&#233;mentaires ap-
porte plus de &#171; risque &#187; dans la g&#233;n&#233;ration de relations incorrectes. Par rapport &#224; la configuration
de base (43,3 %) et d&#8217;allom (39 %), la pr&#233;cision est de 20,4 % avec syno-gen et 22,9 % avec
syno-gen-f , avec une am&#233;lioration de 2,5 % suite aux filtrages. L&#8217;apport relatif des ressources
synonymiques adapt&#233;es ou non au domaine semble alors &#234;tre similaire &#224; celui des ressources
sp&#233;cialis&#233;es ou g&#233;n&#233;rales (voir par exemple (Hamon et al., 1998)) : les ressources g&#233;n&#233;rales
prises dans leur ensemble augmentent le rappel, tandis que leur adaptation augmente la pr&#233;ci-
sion. Le choix de filtrer ou non doit donc &#234;tre fait selon qu&#8217;on privil&#233;gie le rappel ou la pr&#233;ci-
sion. Dans une t&#226;che comme la structuration de terminologies, qui demande une intervention
humaine lors de la validation des inductions automatiques, il peut ainsi &#234;tre plus utile d&#8217;avoir
une meilleure pr&#233;cision. Une autre piste pour l&#8217;am&#233;lioration de la pr&#233;cision est li&#233;e sans doute &#224;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Natalia Grabar, Pierre Zweigenbaum
</p>
<p>Relation hyponymique Canon Synonyme(s)
{ad&#233;nocarcinome, &#233;pith&#233;lioma squirrheux} carcinome ad&#233;nocarcinome, &#233;pith&#233;lioma
{c&#233;ramiques, porcelaine dentaire} c&#233;ramique porcelaine
{famille, filiation ill&#233;gitime} filiation famille
{gravitation, modification pesanteur} attraction gravitation, pesanteur
{immunisation, rappel vaccination} immunit&#233; immunisation, vaccination
</p>
<p>Li
en
</p>
<p>sd
ire
</p>
<p>ct
s
</p>
<p>{mouvement, activit&#233; motrice} vie mouvement, activit&#233;
{rhinite, coryza spasmodique} rhume rhinite, coryza
{th&#233;rapeutique, traitement combin&#233;} th&#233;rapeutique traitement
{anesth&#233;sie, hypnose dentisterie} narcose anesth&#233;sie, hypnose
{assainissement, drainage sanitaire} ass&#232;chement assainissement, drainage
{calculs, lithiase r&#233;nale} calcul lithiase
{&#233;pith&#233;lioma, carcinome lobulaire} carcinome &#233;pith&#233;lioma
{personnalit&#233;, concept soi} personnalit&#233; soi
</p>
<p>Li
en
</p>
<p>si
nd
</p>
<p>ire
ct
</p>
<p>s
</p>
<p>{th&#233;rapeutique, traitement par art} th&#233;rapeutique traitement
{vascularite, art&#233;rite temporale} ang&#233;ite vascularite, art&#233;rite
</p>
<p>TAB. 1 &#8211; Exemples de relations directes et indirectes du MeSH perdues suite aux filtrages.
</p>
<p>notre d&#233;cision d&#8217;autoriser la transitivit&#233; &#171; locale &#187; des synonymes au sein d&#8217;une famille, comme
le montre l&#8217;exemple {abc&#232;s, volume sanguin} dans la suite de cette section. Ce fait est amplifi&#233;
d&#8217;une part parce que les termes du MeSH ont pour vocation de couvrir tout le domaine m&#233;dical.
La coh&#233;sion s&#233;mantique de l&#8217;ensemble de ces termes est donc moins importante que ce qu&#8217;elle
pourrait &#234;tre dans un texte. D&#8217;autre part, nous ne v&#233;rifions pas l&#8217;existence de termes interm&#233;-
diaires qui servent &#224; l&#8217;appariement (grosseur et grosseur sanguine pour l&#8217;exemple ci-dessus).
Notons que lors de la d&#233;tection de relations de synonymie entre termes complexes, (Hamon
et al., 1998) bloquent la transitivit&#233; &#171; locale &#187;.
De mani&#232;re g&#233;n&#233;rale, nous constatons que ce sont les synonymes g&#233;n&#233;raux qui pr&#233;sentent une
rupture avec l&#8217;&#233;volution des courbes du rappel et de la pr&#233;cision par rapport aux &#233;tapes pr&#233;c&#233;-
dentes. Il serait ainsi int&#233;ressant d&#8217;analyser de plus pr&#232;s ce que nous obtenons avec l&#8217;application
de la transitivit&#233; &#171; locale &#187; et de compl&#233;ter ces comparaisons en analysant &#233;galement l&#8217;apport
relatif des synonymes g&#233;n&#233;raux (filtr&#233;s ou originaux) et des synonymes sp&#233;cifiques au domaine.
</p>
<p>Analyse de relations &#171; filtr&#233;es &#187;. Nous examinons ici des relations que nous n&#8217;induisons plus
suite aux filtrages des synonymes. Elles correspondent aux relations correctes du MeSH et &#224; des
relations hors-MeSH, donc potentiellement incorrectes.
</p>
<p>Dans le tableau 1, nous pr&#233;sentons des relations correctes du MeSH, directes et indirectes. La
premi&#232;re colonne contient ces relations, la deuxi&#232;me contient le canon et la troisi&#232;me les sy-
nonymes normalis&#233;s vers le canon lors des traitements. Nous induisons 69 relations directes
du MeSH et 106 indirectes en moins. Ainsi dans le premier exemple, la famille de carcinome,
qui avait deux &#233;l&#233;ments &#224; l&#8217;origine (ad&#233;nocarcinome, &#233;pith&#233;lioma), n&#8217;en garde plus que le pre-
mier. Ce qui emp&#234;che d&#8217;induire la relation {ad&#233;nocarcinome, &#233;pith&#233;lioma squirrheux}, pourtant
correcte, apr&#232;s les filtrages. Dans le deuxi&#232;me exemple {c&#233;ramiques, porcelaine dentaire}, les
termes sont appari&#233;s &#224; travers une lemmatisation {c&#233;ramiques, c&#233;ramique} et une relation de
synonymie {porcelaine, c&#233;ramique}.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Filtrage de synonymes de la langue g&#233;n&#233;rale
</p>
<p>Nous avons analys&#233; environ 5 % des 3 000 relations hors-MeSH que nous n&#8217;induisons plus.
Sur cet ensemble, les filtrages semblent montrer pour la plupart leur efficacit&#233;. Par exemple, la
famille grosseur, de 19 &#233;l&#233;ments &#224; l&#8217;origine, parmi lesquels abc&#232;s, volume et ob&#233;sit&#233;, permet
d&#8217;induire les paires comme {abc&#232;s, volume sanguin} et {ob&#233;sit&#233;, volume sanguin}, manifes-
tement erron&#233;es. Cette famille &#233;tant r&#233;duite lors des filtrages &#224; trois &#233;l&#233;ments, ces paires ne
sont plus g&#233;n&#233;r&#233;es. De la m&#234;me mani&#232;re, les paires comme {absorption, sid&#233;ration myocarde},
{ac&#233;tyl&#232;ne, infusion goudron}, {autoritarisme, gouvernement &#201;tats Unis}, {crime, faute pro-
fessionnelle} ou {&#233;meute, lutte contre moustique} n&#8217;apparaissent plus suite &#224; la r&#233;duction des
familles an&#233;antissement (46 &#233;l&#233;ments &#224; l&#8217;origine), combustible (27), gouvernement (38), crime
(12) et r&#233;volte (16), respectivement.
Dans (Grabar &amp; Zweigenbaum, 2004), nous soulignons que des relations hors-MeSH peuvent
souvent &#234;tre pertinentes, par exemple la paire hors-MeSH {ad&#233;nocarcinome, &#233;pith&#233;lioma mixte}
perdue suite &#224; la r&#233;duction de la famille carcinome. Bien qu&#8217;&#233;tant hors-MeSH, cette paire est
probablement correcte car elle suit le m&#234;me mod&#232;le que la paire directe du MeSH {ad&#233;no-
carcinome, &#233;pith&#233;lioma squirrheux} (tab. 1). D&#8217;autres paires, comme {agraphie, alexie pure}
ou {agraphie, aphasie anomique} (famille aphasie : agraphie, alexie), sont aussi des relations
potentiellement pertinentes, mais non hi&#233;rarchiques.
</p>
<p>Parmi les relations hors-MeSH analys&#233;es ici nous avons beaucoup d&#8217;erreurs, mais aussi des
paires potentiellement pertinentes, qu&#8217;elles correspondent aux relations hyperonymiques ou
non. La d&#233;cision de les encoder dans une terminologie rel&#232;ve d&#8217;une d&#233;cision humaine, que
les approches automatiques ne peuvent pas induire.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Les exp&#233;riences et analyses pr&#233;sent&#233;es avaient pour but de montrer que lorsque des ressources
sp&#233;cifiques &#224; un domaine de sp&#233;cialit&#233; ne sont pas disponibles il est possible de recourir aux
ressources de la langue g&#233;n&#233;rale. Pour que leur utilisation soit plus b&#233;n&#233;fique, il peut &#234;tre utile
de les adapter &#224; ce domaine. Nous avons ainsi test&#233; les ressources synonymiques de la langue
g&#233;n&#233;rale (Le Petit Robert) sur des donn&#233;es provenant du domaine m&#233;dical. Ces ressources ont
&#233;t&#233; utilis&#233;es en structuration de terminologie &#224; c&#244;t&#233; d&#8217;autres ressources et traitements pour la
normalisation des variantes de termes. L&#8217;int&#233;r&#234;t de l&#8217;utilisation des synonymes lors des normali-
sations est d&#251; au fait qu&#8217;ils permettent d&#8217;acc&#233;der &#224; des variations qui ne sont pas accessibles avec
d&#8217;autres ressources. L&#8217;adaptation est effectu&#233;e &#224; travers des filtrages sur des corpus m&#233;dicaux.
Trois approches sont utilis&#233;es : recherche d&#8217;associations, marqueurs de coordination et patrons
lexico-syntaxiques. L&#8217;ensemble des filtrages permet de r&#233;duire les synonymes originaux d&#8217;envi-
ron 90 %. La comparaison de l&#8217;apport de ressources synonymiques filtr&#233;es et originales montre
une am&#233;lioration de la pr&#233;cision de 2,5 % et une perte du rappel de 3 %, ce qui nous semble
b&#233;n&#233;fique pour une t&#226;che comme la structuration de terminologie o&#249; le bruit est important.
</p>
<p>Parmi les perspectives de ce travail, notons essentiellement l&#8217;exploration de la piste paradigma-
tique, par exemple distributionnelle (Nazarenko et al., 2001), pour le filtrage de synonymes ; une
analyse plus pouss&#233;e de l&#8217;impact de la transitivit&#233; &#171; locale &#187; ; la comparaison de l&#8217;apport relatif
des synonymes g&#233;n&#233;raux et sp&#233;cialis&#233;s ; et l&#8217;application d&#8217;une analyse syntaxique des d&#233;pen-
dances dans les termes. Par ailleurs, il serait int&#233;ressant d&#8217;observer l&#8217;influence de l&#8217;adaptation
de synonymes, et de ressources linguistiques en g&#233;n&#233;ral, dans d&#8217;autres contextes applicatifs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Natalia Grabar, Pierre Zweigenbaum
</p>
<p>R&#233;f&#233;rences
</p>
<p>CRUSE D. A. (1986). Lexical Semantics. Cambridge : Cambridge University Press.
DARMONI S. J., THIRION B., LEROY J.-P., DOUY&#200;RE M., LACOSTE B., GODARD G.,
RIGOLLE I., BRISOU M., VIDEAU S., GOUPY E., PIOT J., QU&#201;R&#201; M., OUAZIR S. &amp; AB-
DULRAB H. (2001). A search tool based on &#8216;encapsulated&#8217; MeSH thesaurus to retrieve quality
health resources on the Internet. MIIM, 26(3), 165&#8211;178.
GRABAR N. &amp; ZWEIGENBAUM P. (2004). Lexically-based terminology structuring. In Ter-
minology, volume 10, p. 23&#8211;54.
HAMON T., NAZARENKO A. &amp; GROS C. (1998). A step towards the detection of semantic
variants of terms in technical documents. In International Conference on Computational Lin-
guistics (COLING-ACL&#8217;98), p. 498&#8211;504, Universit&#233; de Montr&#233;al, Montr&#233;al, Quebec, Canada.
JACQUEMIN C. (1999). Syntagmatic and paradigmatic representations of term variation. In
37th Annual Meeting of the Association for Computational Linguistics (ACL&#8217;99), p. 341&#8211;348,
University of Maryland.
KAVANAGH J. (1995). The Text Analyser : A Tool for Extracting Knowledge From Text. Master
of computer science thesis, University of Ottawa, Ottawa, Canada.
KLEIBER G. &amp; TAMBA I. (1990). L&#8217;hyperonymie revisit&#233;e : inclusion et hi&#233;rarchie. Langages,
98, 7&#8211;32. L&#8217;hyponymie et l&#8217;hyperonymie (dir. Marie-Fran&#231;oise Mortureux).
LAME G. (2002). Construction d&#8217;ontologies &#224; partir de textes. Une ontologie du droit d&#233;di&#233; &#224;
la recherche d&#8217;information sur le Web. Th&#232;se de doctorat en informatique temps r&#233;el, robotique
et automatique, &#201;cole des Mines de Paris, Paris.
MANNING C. D. &amp; SCH&#220;TZE H. (1999). Foundations of statistical natural language proces-
sing. Cambridge, MA : MIT Press.
MARCUS A. (2003). Dictionnaires &#233;lectroniques et hypertextualit&#233;. Analyse critique des ren-
vois doubles du Grand Robert. M&#233;moire de DESS, CRIM/INaLCO. Sous la direction de
David Piotrovsky.
MCCRAY A. T., SRINIVASAN S. &amp; BROWNE A. C. (1994). Lexical methods for managing
variation in biomedical terminologies. In Proceedings of the Annual SCAMC, p. 235&#8211;239.
NAZARENKO A., ZWEIGENBAUM P., HABERT B. &amp; BOUAUD J. (2001). Corpus-based ex-
tension of a terminological semantic lexicon. In Recent Advances in Computational Termino-
logy, p. 327&#8211;351. John Benjamins.
NINOVA G., NAZARENKO A. &amp; HAMON T. (2005). Comment mesurer la couverture d&#8217;une
ressource terminologique pour un corpus ? In TALN 2005. &#192; para&#238;tre.
NLM (2001). Medical Subject Headings. National Library of Medicine, Bethesda, Maryland.
http://www.nlm.nih.gov/mesh/meshhome.html.
PEARSON J. (1998). Terms in Context, volume 1 of Studies in Corpus Linguistics. Amster-
dam/Philadelphia : John Benjamins.
ROBERT P. (1967). Pr&#233;face du Petit Robert. Paris : Dictionnaires Le Robert. Premi&#232;re &#233;dition.
S&#201;GU&#201;LA P. &amp; AUSSENAC-GILLES N. (1999). Extraction de relations s&#233;mantiques entre
termes et enrichissement de mod&#232;les du domaine. In Actes d&#8217;Ing&#233;nierie des Connaissances
(IC), p. 79&#8211;88, Palaiseau, France.
ZWEIGENBAUM P., HADOUCHE F. &amp; GRABAR N. (2003). Apprentissage de relations mor-
phologiques en corpus. In B. DAILLE, Ed., Actes de TALN 2003 (Traitement automatique des
langues naturelles), p. 285&#8211;294, Batz-sur-mer : ATALA IRIN.</p>

</div></div>
</body></html>