<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Parsing de l'oral: traiter les disfluences</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Parsing de l&#8217;oral : traiter les disfluences
</p>
<p>Marie-Laure Gu&#233;not
Laboratoire Parole et Langage &#8211; CNRS / Universit&#233; de Provence
</p>
<p>{prenom.nom}@lpl.univ-aix.fr
</p>
<p>Mots-clefs : Disfluences, Parsing, Linguistique de corpus, Linguistique formelle, D&#233;ve-
loppement de grammaires, Grammaire de Construction (CxG), Grammaires de Propri&#233;t&#233;s (GP).
</p>
<p>Keywords: Disfluencies, Parsing, Corpus linguistics, Formal linguistics, Grammar de-
velopment, Construction Grammar (CxG), Property Grammars (PG).
</p>
<p>R&#233;sum&#233; Nous proposons une r&#233;flexion th&#233;orique sur la place d&#8217;un ph&#233;nom&#232;ne tel que
celui des disfluences au sein d&#8217;une grammaire. Les descriptions fines qui en ont &#233;t&#233; donn&#233;es
m&#232;nent &#224; se demander quel statut accorder aux disfluences dans une th&#233;orie linguistique com-
pl&#232;te, tout en conservant une perspective globale de repr&#233;sentation, c&#8217;est-&#224;-dire sans nuire &#224; la
coh&#233;rence et &#224; l&#8217;homog&#233;n&#233;it&#233; g&#233;n&#233;rale. Nous en introduisons une repr&#233;sentation formelle, &#224; la
suite de quoi nous proposons quelques m&#233;canismes de parsing permettant de les traiter.
</p>
<p>Abstract We propose a theoretical reflexion about the place of a phenomenon like dis-
fluencies, in a grammar. The precise descriptions that are available leads to a question : what
status shall we give to disfluencies into a complete linguistic theory ?, keeping a global point
of view and without compromising the coherence and the homogeneity of its representation.
We introduce a formal representation of the phenomenon, and then we propose some parsing
mechanisms in order to treat it.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not
</p>
<p>Introduction
</p>
<p>On s&#8217;int&#233;resse ici au traitement automatique des disfluences : ph&#233;nom&#232;ne non n&#233;gligeable
puisque tr&#232;s fr&#233;quent en oral spontan&#233;, la linguistique descriptive en a fourni un certain nombre
d&#8217;&#233;tudes fines, pr&#233;sentant son organisation interne et ses caract&#233;ristiques. Cependant ces des-
criptions, quoique tr&#232;s pr&#233;cises dans leurs propositions, ne sont souvent pas exploit&#233;es en TALN,
sans doute en partie parce que le statut des disfluences dans une grammaire n&#8217;y est pas d&#233;fini de
mani&#232;re claire et formalisable. En effet les applications symboliques de traitement automatique
qui s&#8217;efforcent d&#8217;analyser des donn&#233;es orales font appel &#224; des techniques diff&#233;rentes pour traiter
les disfluences, techniques qui sont pourtant bas&#233;es pour la plupart sur les m&#234;mes descriptions
initiales.
</p>
<p>Nous proposons ici une r&#233;flexion th&#233;orique concernant la place de ph&#233;nom&#232;nes tels que les
disfluences de l&#8217;oral dans une grammaire, laquelle grammaire a pour objet d&#8217;&#234;tre repr&#233;sent&#233;e
formellement, en vue notamment d&#8217;une exploitation en TALN. Nous conduisons notre r&#233;flexion
en nous basant sur les travaux de linguistique descriptive, et dans le cadre du d&#233;veloppement
de plusieurs parseurs, aux caract&#233;ristiques et aux objectifs diff&#233;rents, mais qui sont tous bas&#233;s
sur une repr&#233;sentation formelle de descriptions linguistiques du fran&#231;ais. Nous commencerons
donc par exposer les &#233;tudes faites des disfluences en linguistique, puis nous montrerons com-
ment nous avons interpr&#233;t&#233; ces descriptions pour les rendre formalisables dans un mod&#232;le de
repr&#233;sentation, avant de proposer un ensemble de m&#233;canismes d&#8217;analyse automatique qui per-
mettront d&#8217;exploiter cette grammaire et d&#8217;en tirer les r&#233;sultats les plus efficaces possibles.
</p>
<p>1 Situation du probl&#232;me
</p>
<p>1.1 Typologie(s) des disfluences
Dans la litt&#233;rature linguistique, une disfluence est un endroit dans un &#233;nonc&#233; o&#249; &#8220;le d&#233;roule-
ment syntagmatique est bris&#233;&#8221; (Blanche-Benveniste et al. (1990)) : on occupe une m&#234;me place
syntaxique avec plusieurs objets (ex. (1a)1).
</p>
<p>(1) a.
il
il a quand-m&#234;me un :
</p>
<p>une fibre p&#233;dagogique assez :
assez euh enfin r&#233;elle quoi
</p>
<p>b.
</p>
<p>tu as toujours un rapport (il) y a un directeur de fouilles
(il) y a
(il) y a les chouchous du directeur de fouille et puis
</p>
<p>les cr&#233;tins de base enfin bon
Ce m&#233;canisme n&#8217;est pas propre aux disfluences puisque l&#8217;on retrouve un m&#234;me entassement
dans les &#233;num&#233;rations (ex. (1b)) ; en revanche, alors que dans ces derni&#232;res chaque occurrence
de la m&#234;me place ajoute un &#233;l&#233;ment &#224; la s&#233;mantique de l&#8217;&#233;nonc&#233;, l&#8217;accumulation de il dans (1a)
n&#8217;en modifie pas les caract&#233;ristiques s&#233;mantiques. Il serait de m&#234;me abusif d&#8217;inscrire cette r&#233;-
</p>
<p>1Pour plus de clart&#233; dans la lecture des disfluences, nos exemples sont repr&#233;sent&#233;s en grille (Blanche-Benveniste
(1987)), et l&#8217;on notera en caract&#232;res gras les &#233;l&#233;ments illustratifs. Sauf mention contraire, tous les exemples de
cet article sont tir&#233;s du Corpus d&#8217;Interactions Dilogiques (Bertrand &amp; Priego-Valverde (2005)).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Parsing de l&#8217;oral: traiter les disfluences
</p>
<p>p&#233;tition comme &#233;tant une m&#233;thode de constitution syntagmatique (i.e., l&#8217;accumulation paradig-
matique ne forme pas de syntagme), ou de lui affecter des relations de d&#233;pendance syntaxique.
Parmi ces disfluences, on distingue deux grandes classes g&#233;n&#233;rales : les bribes qui sont des
reprises &#224; partir de syntagmes inachev&#233;s (ex. (1a)), et les amorces qui sont des reprises &#224; partir
de morph&#232;mes inachev&#233;s (p. ex. paran- dans (2)).
</p>
<p>(2)
s&#8217;il n&#8217;y a pas d&#8217;&#233;l&#233;ments &#224; mon avis euh il
</p>
<p>il tombe dans la paran-
dans la parano quoi
</p>
<p>Au sein des amorces Pallaud &amp; Henry (2004) identifient trois formes diff&#233;rentes (formes que
l&#8217;on peut, d&#8217;apr&#232;s elles, appliquer &#233;galement aux bribes) : les amorces qui sont laiss&#233;es inache-
v&#233;es (ex (3a)), celles qui sont compl&#233;t&#233;es (ex. (2)), et celles qui sont modifi&#233;es (ex. (3b)).
</p>
<p>(3) a. tu sais j&#8217;ai v- enfindans mon champ visuel (il) y a eu quelque chose tu vois
</p>
<p>b.
ils ont des ouvriers euh pay&#233;s
</p>
<p>sp&#233;cialis&#233;s sup-
sur les chantiers de fouille
</p>
<p>Pour sa part, Shriberg (1994), inspir&#233;e par Levelt (1983), a d&#233;crit l&#8217;organisation interne des dis-
fluences en un ensemble d&#8217;espaces distincts : le reparandum qui est le lieu de la premi&#232;re pro-
duction, inachev&#233;e au niveau du point d&#8217;interruption (interruption point), suivi de l&#8217;interregnum
au sein duquel il peut se produire soit rien, soit une marque d&#8217;h&#233;sitation, soit une &#224; plusieurs
nouvelles tentatives de formulation (inachev&#233;es), jusqu&#8217;au repair qui correspond &#224; la reprise du
d&#233;roulement syntagmatique.
</p>
<p>Toutes ces &#233;tudes, qui d&#233;crivent l&#8217;organisation interne des disfluences, peuvent &#234;tre prises en
consid&#233;ration dans le d&#233;veloppement d&#8217;une formalisation. Elles les pr&#233;sentent comme un ph&#233;-
nom&#232;ne unique, avec des caract&#233;ristiques r&#233;guli&#232;res (l&#8217;entassement paradigmatique, l&#8217;absence
de fonction syntaxique et de fonction s&#233;mantique, les espaces internes), et des caract&#233;ristiques
plus sp&#233;cifiques &#224; certains cas (bribes vs. amorces, inach&#232;vement vs. compl&#233;tion vs. modifica-
tion, composition de l&#8217;interregnum). Cependant elles n&#8217;indiquent pas comment l&#8217;on diff&#233;rencie
une disfluence d&#8217;une autre construction, ni comment l&#8217;on doit les traiter lors de l&#8217;analyse d&#8217;un
&#233;nonc&#233;.
</p>
<p>1.2 Les disfluences en TALN
</p>
<p>Observons maintenant comment le ph&#233;nom&#232;ne est trait&#233; en TALN2 : en d&#233;pit de la prise en
consid&#233;ration, dans la plupart des cas, de tout ou partie des descriptions expos&#233;es ci-dessus, les
solutions concr&#232;tes propos&#233;es pour le traitement automatique sont nettement diff&#233;rentes suivant
la t&#226;che &#224; accomplir et le type d&#8217;approche.
</p>
<p>La premi&#232;re technique que l&#8217;on peut rencontrer consiste &#224; &#8220;effacer&#8221; les disfluences de l&#8217;entr&#233;e
qui sera analys&#233;e, en effectuant un pr&#233;-traitement des donn&#233;es dont l&#8217;objet est de reconna&#238;tre les
disfluences et de les remplacer par une forme consid&#233;r&#233;e comme &#8220;&#233;quivalente&#8221; ne pr&#233;sentant
pas de rupture du d&#233;roulement syntagmatique (p.ex. chez Dowding et al. (1999)). On peut se
</p>
<p>2Parce que l&#8217;on se place nous-m&#234;me dans la perspective g&#233;n&#233;rale de la repr&#233;sentation formelle de la langue,
on ne s&#8217;int&#233;resse ici qu&#8217;aux m&#233;thodes de TALN qui sont bas&#233;es sur des descriptions linguistiques, et non sur les
techniques probabilistes, qui certes proposent des approches int&#233;ressantes, mais ne font pas partie de notre cadre
de recherche.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not
</p>
<p>demander quel est pr&#233;cis&#233;ment le niveau d&#8217;&#8220;&#233;quivalence&#8221; recherch&#233;, et quelles sont les limites
impos&#233;es par des r&#233;sultats d&#8217;analyse pour des utilisations ult&#233;rieures, si ceux-ci sont bas&#233;s sur
des entr&#233;es qui ne contiennent plus la totalit&#233; des informations linguistiques produites.
</p>
<p>La deuxi&#232;me technique consiste en quelque sorte &#224; &#8220;ignorer&#8221; les disfluences, i.e. &#224; ne pas les
prendre en compte lors de l&#8217;analyse (cf. par exemple P&#233;rennou (1996)). Ceci permet d&#8217;obtenir
un r&#233;sultat de parsing dit &#8220;robuste&#8221;, mais ne pose pas la question du statut des unit&#233;s qui n&#8217;ont
pas &#233;t&#233; consid&#233;r&#233;es dans l&#8217;analyse : bien que les disfluences n&#8217;aient pas de fonction syntaxique
en tant que telles, chaque &#233;l&#233;ment qui occupe une place syntagmatique remplit en lui-m&#234;me la
fonction syntaxique de cette place, et il semble difficile d&#8217;admettre dans ce cas que seule une
occurrence de chaque place sera consid&#233;r&#233;e dans l&#8217;analyse. En d&#8217;autres termes, si l&#8217;on n&#8217;analyse
que le repair, quel est le statut des constituants des autres espaces de la disfluence ?
</p>
<p>La troisi&#232;me technique est celle qui consiste &#224; regrouper les disfluences en un groupe. Antoine
et al. (2003) proposent dans cette perspective des analyseurs qui forment des disfluences en ras-
semblant des chunks (chacun d&#8217;eux devant &#234;tre une occurrence de la m&#234;me place syntaxique)
en vertu de &#8220;relations de d&#233;pendance s&#233;mantico-pragmatiques&#8221;. Dans un m&#234;me ordre d&#8217;id&#233;es,
Godfrey et al. (1992) proposent une m&#233;thode d&#8217;annotation des disfluences qui consiste &#224; effec-
tuer un parenth&#233;sage de la totalit&#233; de l&#8217;accumulation paradigmatique. Dans ce cas on peut se
demander comment est d&#233;termin&#233;e la cat&#233;gorie syntagmatique de cet ensemble (indispensable
&#224; l&#8217;analyse), qui peut &#234;tre constitu&#233; de plusieurs r&#233;p&#233;titions ne comptant pas toujours les m&#234;mes
constituants, et qui ne correspond pas syst&#233;matiquement &#224; un syntagme complet.
</p>
<p>On voit que les techniques qui prennent en compte les disfluences, bien que se basant sur tout ou
partie des descriptions donn&#233;es ci-dessus, diff&#232;rent nettement dans leurs traitements, qui sont
tous limit&#233;s par la nature de leur repr&#233;sentation du ph&#233;nom&#232;ne. Nous allons donc commen-
cer par expliquer quelle place nous lui donnons dans notre grammaire, avant d&#8217;en montrer la
formalisation propos&#233;e &#224; partir de l&#224;.
</p>
<p>2 Description et repr&#233;sentation
</p>
<p>Le fait de vouloir int&#233;grer un ph&#233;nom&#232;ne tel que celui des disfluences dans une grammaire, met
en avant une diff&#233;rence fondamentale entre les descriptions linguistiques et leur formalisation :
l&#224; o&#249; la premi&#232;re s&#8217;attache &#224; d&#233;crire finement le fonctionnement interne et les propri&#233;t&#233;s d&#8217;un
ph&#233;nom&#232;ne donn&#233;, le mod&#232;le formel qui a pour t&#226;che de le repr&#233;senter doit &#233;galement int&#233;grer,
en plus de sa description interne, les propri&#233;t&#233;s plus g&#233;n&#233;rales du ph&#233;nom&#232;ne, i.e. conserver un
point de vue plus global sur l&#8217;articulation entre celui-ci et les autres, sur la fa&#231;on dont le tout
s&#8217;articule et conserve une coh&#233;rence g&#233;n&#233;rale.
</p>
<p>C&#8217;est ce &#224; quoi nous allons nous attacher ici. Nous allons proposer une r&#233;flexion g&#233;n&#233;rale sur
la place des disfluences au sein d&#8217;un syst&#232;me grammatical. La grammaire du fran&#231;ais que nous
d&#233;veloppons et dans laquelle nous t&#226;chons d&#8217;int&#233;grer ce que nous pr&#233;sentons ici a pour cadre
th&#233;orique celui de la Construction Grammar (CxG, cf. p.ex. Kay &amp; Fillmore (1999)), et pour
mod&#232;le formel celui des Grammaires de Propri&#233;t&#233;s (GP, cf. p.ex. Blache (2005)). La description
et la repr&#233;sentation formelle qui suivent sont donc bas&#233;es sur ce cadre de travail CxG/GP, ce-
pendant nous esp&#233;rons les pr&#233;senter de telle sorte qu&#8217;elles puissent s&#8217;appliquer &#224; d&#8217;autres cadres
th&#233;oriques et formels que celui qui fait l&#8217;objet de notre travail.
Ce que l&#8217;on a pu voir jusqu&#8217;ici met en avant le fait que pour traiter des disfluences, il est n&#233;-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Parsing de l&#8217;oral: traiter les disfluences
</p>
<p>cessaire de commencer par r&#233;pondre &#224; une question d&#8217;ordre plus g&#233;n&#233;ral : Quelle est leur place
dans la grammaire ? Et pour r&#233;pondre &#224; cette question, la premi&#232;re chose que l&#8217;on doit se de-
mander est ce que l&#8217;on repr&#233;sente au juste dans une grammaire : quels sont les objets que l&#8217;on
y manipule ? Y repr&#233;sente-t-on des relations entre les occurrences possibles d&#8217;un &#233;nonc&#233;, ou
alors entre les places syntaxiques occup&#233;es par ces occurrences ? Dans le cas d&#8217;&#233;nonc&#233;s sans
disfluences, ces questions ne sont pas si &#233;videntes ; ainsi, dans un &#233;nonc&#233; tel que celui de la
figure 13, les occurrences possibles et les places syntaxiques sont confondues, puisque chaque
place syntaxique n&#8217;est occup&#233;e que par une unique occurrence.
</p>
<p>quelque part je
a
</p>
<p>##
vais
</p>
<p>{{
b
</p>
<p>$$
&#234;tre
</p>
<p>zz
impardonnable (1)
</p>
<p>FIG. 1 &#8211; Relations dans un &#233;nonc&#233; sans disfluences.
</p>
<p>Par contre, quand on traite des &#233;nonc&#233;s avec des disfluences, ces questions prennent toute leur
importance. Consid&#233;rons d&#8217;abord que l&#8217;on repr&#233;sente dans une grammaire des relations entre
des occurrences possibles. L&#8217;analyse d&#8217;une disfluence peut alors &#234;tre repr&#233;sent&#233;e selon l&#8217;illus-
tration de la figure 2.
</p>
<p>quelque part je
a
</p>
<p>##
</p>
<p>a ((
</p>
<p>vais
{{
</p>
<p>&#4;&#4;
</p>
<p>b
</p>
<p>&#15;&#15;je
a
</p>
<p>;;
</p>
<p>a 66
</p>
<p>vaiscc
</p>
<p>ZZ
</p>
<p>b
==&#234;tre
</p>
<p>tt
</p>
<p>aa impardonnable
</p>
<p>(2)
</p>
<p>FIG. 2 &#8211; Relations entre occurrences.
</p>
<p>On voit que dans ce cas on multiplie le nombre de chaque relation par le nombre d&#8217;occurrences
de la m&#234;me place syntagmatique : la relation a figure quatre fois et la b deux fois, au lieu d&#8217;une
seule dans la figure 1. La cons&#233;quence de cela est que l&#8217;ensemble de caract&#233;ristiques, sp&#233;ci-
fique au syntagme qui contient la disfluence (ici, je vais je vais &#234;tre impardonnable), varie non
seulement en fonction de la pr&#233;sence, mais aussi de la forme d&#8217;une disfluence : l&#8217;ensemble {a,
b} de la figure 1 devient {a, a, a, a, b, b} pour la disfluence pr&#233;cise de la figure 2. De plus, un
certain nombre de propri&#233;t&#233;s d&#233;finitoires du syntagme (e.g. l&#8217;unicit&#233; du pronom clitique nomi-
natif, ou l&#8217;ordre lin&#233;aire entre ce m&#234;me pronom et le verbe) sont fauss&#233;es par la pr&#233;sence de la
r&#233;p&#233;tition, et la d&#233;finition dans la grammaire doit tenir compte de ces variations de caract&#233;ris-
tiques. Pourtant comme on l&#8217;a vu plus haut, les caract&#233;ristiques sp&#233;cifiques &#224; la pr&#233;sence d&#8217;une
disfluence n&#8217;ont pas d&#8217;incidence sur l&#8217;analyse syntaxique d&#8217;un &#233;nonc&#233;, et donc ne devraient pas
avoir d&#8217;incidence sur la d&#233;finition (syntaxique) d&#8217;un syntagme.
Repr&#233;senter des relations entre occurrences ne semble donc pas &#234;tre le fait d&#8217;une grammaire ;
consid&#233;rons alors que l&#8217;on y repr&#233;sente des relations entre des places syntagmatiques. Dans ce
cas, si l&#8217;on suit l&#8217;approche de Godfrey et al. (1992), on peut illustrer le traitement des disfluences
comme dans la figure 3.
</p>
<p>Ici l&#8217;on r&#233;sout le probl&#232;me de la multiplication injustifi&#233;e des caract&#233;ristiques, mais on se trouve
face &#224; un autre probl&#232;me : pour pouvoir faire une analyse syntaxique il faut qu&#8217;&#224; chaque place
</p>
<p>3Les &#8220;relations&#8221; que l&#8217;on repr&#233;sente ici sont des repr&#233;sentations intuitives, et n&#8217;illustrent pas une th&#233;orie donn&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not
</p>
<p>quelque part je
a
</p>
<p>33
b
</p>
<p>&#31;&#31;
</p>
<p>vaisii
</p>
<p>je
a ++
</p>
<p>vaisuu &#234;tre impardonnable
</p>
<p>(3)
</p>
<p>FIG. 3 &#8211; Relations entre places syntagmatiques.
</p>
<p>corresponde une cat&#233;gorie, et dans l&#8217;exemple quelle est la cat&#233;gorie de je vais je vais, ou de
c&#8217;&#233;tait je crois qu&#8217;il &#233;tait dans l&#8217;ex. (4) ?
</p>
<p>(4) c&#8217;&#233;taitje crois qu&#8217;il &#233;tait autrichien ou un truc comme &#231;a
En effet, s&#8217;il est simple de traiter de cette fa&#231;on les reprises simples telle que il il dans l&#8217;exemple
(1a) en lui affectant la place de &#8220;pronom clitique&#8221;, il devient plus difficile de s&#8217;accorder sur le
statut d&#8217;un groupe constitu&#233; d&#8217;un fragment de d&#233;but de syntagme, qui ne correspond &#224; aucune
&#233;tiquette syntaxique. Comment int&#233;grer dans une analyse syntaxique, des objets qui ne sont
pas des &#233;l&#233;ments syntaxiques ? Il faudrait pour cela les ajouter artificiellement &#224; la grammaire,
int&#233;grer ces groupes qui ne sont pas vraiment des syntagmes, mais dont la seule raison d&#8217;y
figurer est qu&#8217;ils peuvent appara&#238;tre en tant qu&#8217;occurrence. Au-del&#224; du probl&#232;me linguistique
de fond que ce type d&#8217;artefact suppose (quelle analyse fait-on ? quelle est la nature des objets
que l&#8217;on introduit ?), on en revient &#233;galement au probl&#232;me pos&#233; par la technique pr&#233;c&#233;dente :
les disfluences ne sont pas d&#233;crites en tant que ph&#233;nom&#232;ne, mais chacune des possibilit&#233;s de
disfluence devra &#234;tre l&#8217;objet d&#8217;une construction particuli&#232;re, et l&#8217;on sera limit&#233; &#224; un moment ou
&#224; un autre par l&#8217;it&#233;ration limitative des possibilit&#233;s a priori infinies.
</p>
<p>Une fa&#231;on de rem&#233;dier &#224; ce probl&#232;me sans fabriquer de cat&#233;gories ad hoc est de ne pas rassem-
bler les diff&#233;rentes occurrences d&#8217;une disfluence en un groupe unique, mais de consid&#233;rer que
chaque reprise est une occurrence, achev&#233;e ou non, du syntagme complet (figure 4).
</p>
<p>quelque part je
a
</p>
<p>33 vaisii
</p>
<p>je
a ++
</p>
<p>vaisuu
b ++
</p>
<p>&#234;tre
ss impardonnable
</p>
<p>(4)
</p>
<p>FIG. 4 &#8211; Les disfluences comme occurrences compl&#232;tes de syntagmes.
</p>
<p>Pour ne pas recourir &#224; des cat&#233;gories vides4, on peut tout simplement consid&#233;rer (ce qui est
tout &#224; fait coh&#233;rent dans le cadre CxG/GP) que la caract&#233;risation des occurences inachev&#233;es de
syntagme seront le reflet de leur constitution : un certain nombre de propri&#233;t&#233;s seront, &#224; juste
titre, non &#233;valu&#233;es, et d&#8217;autres seront &#233;valu&#233;es et non-satisfaites, en comparaison avec le repair.
Il s&#8217;agit ensuite, pour ne pas se contenter de d&#233;placer au niveau sup&#233;rieur le probl&#232;me pos&#233; par
la premi&#232;re possibilit&#233; envisag&#233;e ici, de mettre en relation ces occurrences du m&#234;me syntagme
au sein de la grammaire, en tant que &#8220;ph&#233;nom&#232;ne de disfluence&#8221;. Il est possible de le rep&#233;rer par
un ensemble de caract&#233;ristiques telles que la diff&#233;rence de caract&#233;risation entre les premi&#232;res
occurrences, incompl&#232;tes, et le repair, ainsi que l&#8217;occupation des m&#234;mes fonctions syntaxique
et s&#233;mantique. D&#8217;autres &#233;l&#233;ments peuvent ensuite permettre de distinguer les diff&#233;rentes formes
</p>
<p>4Nous n&#8217;avons pas la place de justifier notre position sur ce point ici, cependant nous d&#233;veloppons une gram-
maire qui n&#8217;a pas de recours au postulat de cat&#233;gories vides, que ce soit pour ce cas ou pour tous les autres.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Parsing de l&#8217;oral: traiter les disfluences
</p>
<p>de disfluences : les inachev&#233;es n&#8217;auront pas les m&#234;mes constituants que le repair, les modifi&#233;es
s&#8217;en &#233;carteront par un sous-ensemble variable de traits (diff&#233;rences de genre, de nombre, etc.),
contrairement aux compl&#233;t&#233;es dont les constituants (pr&#233;sents) seront identiques &#224; ceux du repair.
Ce qui pose un probl&#232;me plus d&#233;licat dans cette repr&#233;sentation, c&#8217;est l&#8217;expression de relations
entre parties diff&#233;rentes d&#8217;occurrences diff&#233;rentes. Observons par exemple l&#8217;&#233;nonc&#233; suivant :
</p>
<p>(5)
lesquels registres sont tr&#232;s euh
</p>
<p>sont
doivent &#234;tre
doivent pouvoir &#234;tre contr&#244;l&#233;s
</p>
<p>tir&#233; de Blanche-Benveniste et al. (1990), p. 24, o&#249; l&#8217;auteur dit que l&#8217;on &#8220;vise &#224; d&#233;gager la
s&#233;quence maximale qui a &#233;t&#233; donn&#233;e par le locuteur, en tenant compte de toutes les bribes
qu&#8217;il a fournies ; dans l&#8217;exemple pr&#233;c&#233;dent, on retiendra comme s&#233;quence maximale : lesquels
registres doivent pouvoir &#234;tre tr&#232;s contr&#244;l&#233;s&#8221;, ce qui implique de pouvoir &#233;tablir des relations
entre tr&#232;s apparu dans le reparandum, et contr&#244;l&#233;s apparu dans le repair. Or, bien qu&#8217;une analyse
en GP rep&#233;rera cette relation, il para&#238;t par contre bien difficile de la repr&#233;senter au sein m&#234;me
de la grammaire et donc d&#8217;en tenir compte dans la description de la &#8220;s&#233;quence maximale&#8221;.
Difficile, parce que cela demanderait d&#8217;utiliser une relation entre constituants de syntagmes
diff&#233;rents, lorsque ces syntagmes sont li&#233;s entre eux par une relation de disfluence, et que l&#8217;on
n&#8217;utilise pas de telles relations dans d&#8217;autres cas. On devrait donc cr&#233;er artificiellement, non pas
de nouveaux syntagmes comme pr&#233;c&#233;demment, mais de nouvelles propri&#233;t&#233;s (ou de nouvelles
s&#233;mantiques de propri&#233;t&#233;s, cf. Vanrullen et al. (2003)) uniquement pour traiter le ph&#233;nom&#232;ne.
La repr&#233;sentation que l&#8217;on propose conserve la vision des disfluences en tant que construction
&#224; part enti&#232;re, telle que montr&#233;e ci-dessus, mais ne la consid&#232;re pas syst&#233;matiquement comme
mettant en relation des syntagmes : on reliera en tant que disfluence chaque occurrence r&#233;p&#233;t&#233;e
d&#8217;une m&#234;me place syntaxique, qu&#8217;elle soit construite ou non (figure 5).
</p>
<p>quelque part je vais
</p>
<p>je
a ++
</p>
<p>vais
b ++
</p>
<p>&#234;tre impardonnable
</p>
<p>(5)
</p>
<p>FIG. 5 &#8211; Les disfluences comme accumulation de places syntagmatiques.
</p>
<p>Ainsi, toutes les places syntaxiques qui doivent &#234;tre mises en relation lors de l&#8217;introduction du
syntagme qui les contient (le &#8220;syntagme maximal&#8221; de Blanche) sont s&#233;par&#233;es les unes des autres
et peuvent &#234;tre prises en compte par le reste de la grammaire de la m&#234;me fa&#231;on, qu&#8217;elles soient
disfluentes ou non, sans introduire ni formes de constructions ni relations ad hoc. Concr&#232;tement,
une bribe compl&#233;t&#233;e aura la forme de la figure 4, et une modifi&#233;e aura cette m&#234;me forme &#224; ceci
pr&#232;s que les &#233;l&#233;ments d&#8217;une disfluence auront quelques diff&#233;rences de valeurs de traits. Les
inachev&#233;es, enfin, seront trait&#233;es comme des reprises de syntagmes (donc comme d&#233;crites dans
le cas pr&#233;c&#233;dent, mais uniquement quand aucune identit&#233; de forme ne permet de relier des unit&#233;s
plus petites entre elles).
Dans la grammaire, la construction correspondant aux disfluences aura la forme propos&#233;e dans
la figure 65. Ces quelques caract&#233;ristiques nous permettent de signifier qu&#8217;une disfluence consiste
en la mise en relation d&#8217;un x et un ou plusieurs x&#8217;, dont chacun des traits, mis &#224; part l&#8217;INDEX,
</p>
<p>5Il s&#8217;agit d&#8217;une repr&#233;sentation extr&#234;mement simplifi&#233;e pour les besoins de l&#8217;article. La d&#233;velopper ici sous sa
forme r&#233;elle e&#251;t demand&#233; des explications superflues dans ce contexte pr&#233;cis.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not
</p>
<p>X (disfluent)
</p>
<p>TRAITS
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>FORME
[
...
</p>
<p>]
ANCRE
</p>
<p>[
INDEX ...
</p>
<p>...
</p>
<p>]
</p>
<p>SYNSEM
</p>
<p>[
CAT x
...
</p>
<p>]
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
</p>
<p>PROPRI&#201;T&#201;S
</p>
<p>obligation x
constituance x&#8217;
exigence x&#8658; x&#8217;
accord x&#8217;.trait &#8776; x.trait, (trait 6= index)
</p>
<p>(6)
</p>
<p>FIG. 6 &#8211; repr&#233;sentation formelle de la construction &#8220;disfluente&#8221;.
</p>
<p>sont de valeurs identiques un &#224; un. La satisfaction compl&#232;te de ces propri&#233;t&#233;s caract&#233;rise une
bribe compl&#233;t&#233;e ; si un certain nombre de propri&#233;t&#233;s d&#8217;accord sont &#233;valu&#233;es et non satisfaites
alors on caract&#233;rise une bribe modifi&#233;e, et l&#8217;application de x et x&#8217; en tant que syntagmes nous
permet de reconna&#238;tre les bribes inachev&#233;es. Les accords, dans notre grammaire, font r&#233;f&#233;rence
&#224; la totalit&#233; des traits d&#8217;un objet, que ceux-ci soient morphologiques ou syntaxiques ou s&#233;man-
tiques (ou autres), ce qui nous permet de traiter avec une m&#234;me description tout aussi bien les
disfluences dont la modification est syntaxique (un une dans (1a)), que celles dont la modifica-
tion est s&#233;mantique (ex. (6)).
</p>
<p>(6) ils sont pas &#224; l&#8217;abri de &#231;a quoi mais c&#8217;est un peupas mal d&#8217;hypocrisie quand-m&#234;me &#224; ce niveau-l&#224;
</p>
<p>3 M&#233;canismes de parsing
</p>
<p>Dans notre cadre on s&#8217;int&#233;resse principalement &#224; des t&#226;ches de parsing non-d&#233;terministe, ce-
pendant l&#8217;on suppose (et l&#8217;on esp&#232;re) que les quelques m&#233;canismes qui suivent pourront s&#8217;ap-
pliquer aussi bien &#224; du parsing d&#233;terministe. En outre, l&#8217;impl&#233;mentation de cette grammaire est
en cours, mais &#224; l&#8217;heure actuelle elle n&#8217;est pas suffisamment avanc&#233;e pour que l&#8217;on puisse la
consid&#233;rer comme &#233;valuable. Nous verrons donc ici les id&#233;es g&#233;n&#233;rales qui dirigent la phase
d&#8217;impl&#233;mentation qui est en cours de r&#233;alisation.
</p>
<p>Nous avons vu jusque l&#224; comment repr&#233;senter les disfluences au sein de la grammaire, et pour-
quoi ; voyons maintenant quelles cons&#233;quences cette introduction peut avoir sur le parsing. En
effet, les tenants et les aboutissants de l&#8217;automatisation d&#8217;une analyse bas&#233;e sur une grammaire
formelle ont ceci de diff&#233;rent du d&#233;veloppement de la grammaire elle-m&#234;me, qu&#8217;ils doivent
fournir un r&#233;sultat exploitable &#224; l&#8217;issue d&#8217;un traitement le plus efficace et le plus robuste pos-
sible. L&#8217;obstacle principal ici est un probl&#232;me d&#8217;explosion combinatoire : la description des dis-
fluences propos&#233;e est tellement large qu&#8217;elle va engendrer l&#8217;introduction de constructions dis-
fluentes non seulement dans les cas pertinents, mais &#233;galement dans une quantit&#233; d&#233;raisonnable
de cas superflus. Plusieurs fa&#231;ons de limiter les introductions superflues sont envisageables :
&#8211; Borner l&#8217;introduction d&#8217;une disfluence &#224; une distance arbitrairement d&#233;finie (qu&#8217;elle soit fixe
</p>
<p>ou relative &#224; la longueur de l&#8217;&#233;nonc&#233;). M&#234;me si les disfluences peuvent &#234;tre non born&#233;es (et
elles le sont dans de nombreux cas selon notre description), elles ne sont probablement que</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Parsing de l&#8217;oral: traiter les disfluences
</p>
<p>tr&#232;s rarement s&#233;par&#233;es de plus d&#8217;une certaine distance.
&#8211; Introduire une s&#233;rie de marques linguistiques permettant de diff&#233;rencier les disfluences et
</p>
<p>les &#233;num&#233;rations (c&#8217;est ce que font p.ex. Johnson et al. (2004)). Les diff&#233;rentes parties des
disfluences auraient tendance &#224; &#234;tre s&#233;par&#233;es par des pauses oralis&#233;es, des connecteurs, alors
que les &#233;num&#233;rations seraient plut&#244;t s&#233;par&#233;es par des coordonnants. De plus, les &#233;num&#233;ra-
tions sont des entassements de syntagmes dont des occurrences sont (normalement) toutes
achev&#233;es, contrairement aux disfluences comme on l&#8217;a vu.
</p>
<p>A terme, l&#8217;observation des r&#233;sultats fournis en parsing en faisant varier ces diff&#233;rentes possi-
bilit&#233;s devrait nous permettre de faire remonter des informations exactes &#224; ce propos, que l&#8217;on
pourra int&#233;grer directement &#224; la grammaire comme autant de propri&#233;t&#233;s suppl&#233;mentaires des
disfluences.
</p>
<p>Un autre m&#233;canisme &#224; traiter lors du parsing est celui de l&#8217;instanciation des traits de la construc-
tion disfluente en vertu des traits de ses constituants. Notre m&#233;thode consisterait, pour le cas o&#249;
l&#8217;accord n&#8217;est pas satisfait, &#224; affecter &#224; la construction disfluente la valeur de trait de l&#8217;occurrence
du repair, pour justifier de l&#8217;analyse par exemple de un une dans (1a) comme &#233;tant un d&#233;termi-
nant de genre f&#233;minin (et non simplement ind&#233;termin&#233;). Ceci permettrait d&#8217;affiner l&#8217;analyse et
donc de r&#233;duire la possibilit&#233; d&#8217;introduction de relations non pertinentes par la suite.
</p>
<p>Conclusion et perspectives
</p>
<p>Les disfluences dont nous traitons ici ont &#233;t&#233; d&#233;crites comme des entassements paradigmatiques
qui ont ceci de particulier qu&#8217;ils n&#8217;ont ni de fonction syntaxique, ni de fonction s&#233;mantique.
Les objets accumul&#233;s sur une m&#234;me place syntaxique peuvent &#234;tre parfaitement identiques ou
partiellement diff&#233;rents, mais ont toujours un certain nombre de caract&#233;ristiques communes, et
l&#8217;on peut en d&#233;crire une organisation interne assez pr&#233;cise. Cependant l&#8217;exploitation tr&#232;s va-
riable que l&#8217;on peut en voir en TALN montre qu&#8217;en plus de tout cela, il est n&#233;cessaire avant
de traiter les disfluences dans un mod&#232;le bas&#233; sur un formalisme linguistique, de r&#233;pondre aux
questions suivantes : Quelle est la place des disfluences dans une grammaire ? Quand et com-
ment les analyse-t-on ? Nous avons donc ici propos&#233; une r&#233;flexion sur la place des disfluences
dans une grammaire formelle, &#224; la suite de laquelle nous avons introduit notre repr&#233;sentation
de ce ph&#233;nom&#232;ne. Au del&#224; du probl&#232;me pos&#233; par cette repr&#233;sentation particuli&#232;re, nous avons
men&#233; une r&#233;flexion plus g&#233;n&#233;rale sur la place de ce type de ph&#233;nom&#232;nes, propres &#224; l&#8217;oral, et par
l&#224; nous avons pr&#233;sent&#233; une vision globale du d&#233;veloppement de grammaire et de ces sp&#233;cifici-
t&#233;s. Nous avons propos&#233; ensuite quelques m&#233;canismes de traitement de la grammaire propos&#233;e,
qui devraient permettre de garantir des r&#233;sultats plus pertinents et robustes pour la t&#226;che pr&#233;cise
du parsing, tout en mettant en avant la m&#233;thode de d&#233;veloppement de grammaire assist&#233; par
l&#8217;informatique, qui permet d&#8217;effectuer un va-et-vient entre les hypoth&#232;ses form&#233;es &#224; partir de
l&#8217;&#233;tude de corpus, leur formalisation et leur v&#233;rification sur une quantit&#233; importante de donn&#233;es
de mani&#232;re automatis&#233;e.
</p>
<p>Ce travail ne s&#8217;arr&#234;te bien &#233;videmment pas l&#224;. Nous avons pr&#233;sent&#233; ici une &#233;tude dont l&#8217;im-
pl&#233;mentation est en cours, qui a pour objectif &#224; terme de proposer une grammaire formelle du
fran&#231;ais oral, bas&#233;e sur des descriptions fines de corpus. Un autre objectif qui transpara&#238;t &#224; tra-
vers cet article, et qui sera sans aucun doute n&#233;cessaire &#224; la finalisation de cette grammaire,
est l&#8217;int&#233;gration au sein m&#234;me de la grammaire formelle, d&#8217;informations de plusieurs domaines
diff&#233;rents : nous avons &#233;voqu&#233; la syntaxe et la s&#233;mantique ici, mais pour traiter de l&#8217;oral il nous
semble &#233;vident qu&#8217;&#224; cela nous devrons ajouter des informations prosodiques (p. ex. Morel &amp;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not
</p>
<p>Danon-Boileau (1998)). Nous avons &#233;galement pour projet d&#8217;ajouter &#224; cela les informations ges-
tuelles pertinentes6, suite &#224; l&#8217;&#233;tude du corpus qui nous a servi de base pour cet article, et qui est
disponible sous forme audiovisuelle. Il serait &#233;galement int&#233;ressant d&#8217;int&#233;grer au traitement des
&#233;l&#233;ments concernant l&#8217;interpr&#233;tation (pragmatique et/ou psycholinguistique) de ces disfluences,
et qui justifient leur apparition et leur statut lors de la perception d&#8217;un message. Enfin, outre le
d&#233;veloppement de grammaire, cette &#233;tude s&#8217;inscrit dans un projet d&#8217;annotation multi-niveaux
de corpus, et dans ce cadre permet de r&#233;fl&#233;chir aux diff&#233;rences et aux liens existants entre les
diff&#233;rents niveaux &#224; repr&#233;senter, en se basant sur l&#8217;&#233;tude de ph&#233;nom&#232;nes r&#233;els et concrets.
</p>
<p>R&#233;f&#233;rences
Jean-Yves Antoine, J&#233;rome Goulian, &amp; Jeanne Villaneau. Quand le tal robuste s&#8217;attaque au langage
parl&#233; : analyse incr&#233;mentale pour la compr&#233;hension de la parole spontan&#233;e. In Actes de TALN 2003,
2003.
Roxanne Bertrand &amp; B&#233;atrice Priego-Valverde. Le corpus d&#8217;interactions dilogiques : Pr&#233;sentation et
perspectives. Technical report, Laboratoire Parole et Langage &#8211; CNRS / Universit&#233; de Provence, 2005.
Philippe Blache. Property grammars : A fully constraint-based theory. In H Christiansen, P Skadhauge,
&amp; J Villadsen, editors, Constraint Satisfaction and Language Processing. Springer-Verlag, 2005.
Claire Blanche-Benveniste. Syntaxe, choix du lexique et lieux de bafouillage. DRLAV, 36-37 :123&#8211;157,
1987.
Claire Blanche-Benveniste, Mireille Bilger, Christine Rouget, &amp; Karel Van Den Eynde. Le fran&#231;ais
parl&#233; : Etudes grammaticales. Sciences du langage. CNRS Editions, Paris, 1990.
J. Dowding, J. Gawron, D. Appelt, J. Bear, L. Cherny, R. Moore, &amp; D. Moran. Gemini : A natural
language system for spoken language understanding. In Proceedings of ARPA Workshop on Human
Language Technology, pages 21&#8211;24, 1999.
J. J. Godfrey, E. C. Holliman, &amp; J. McDaniel. Switchboard : A telephone speech corpus for research and
development. In Proceedings of the IEEE, pages 517&#8211;520, 1992.
Marie-Laure Gu&#233;not &amp; Emmanuel Bellengier. Quelques principes pour une grammaire multimodale du
fran&#231;ais. In Proceedings of RECITAL 2004, 2004.
Mark Johnson, Eugene Charniak, &amp; Matthew Lease. An improved model for recognizing disfluencies in
conversational speech. In Rich Transcription 2004 Fall workshop, 2004.
Paul Kay &amp; Charles J. Fillmore. Grammatical constructions and linguistic generalizations : The what&#8217;s
X doing Y ? construction. Language, 75(1) :1&#8211;33, March 1999.
W Levelt. Monitoring and self-repair in speech. Cognition, 14 :41&#8211;104, 1983.
Mary-Annick Morel &amp; Laurent Danon-Boileau. Grammaire de l&#8217;intonation. Biblioth&#232;que de faits de
langues. Ophrys, Paris, 1998.
Berthille Pallaud &amp; Sandrine Henry. Amorces de mots et r&#233;p&#233;titions : des h&#233;sitations plus que des erreurs
en fran&#231;ais parl&#233;. In Actes de JADT 2004, 2004.
G. P&#233;rennou. Compr&#233;hension du dialogue oral : le role du lexique dans l&#8217;approche par segments concep-
tuels. In Actes de Lexique et Communication Parl&#233;e, pages 169&#8211;178, 1996.
Elizabeth Shriberg. Preliminaries to a theory of speech dislfuencies. PhD thesis, University of Califor-
nia, Berkeley, 1994.
Tristan Vanrullen, Marie-Laure Gu&#233;not, &amp; Emmanuel Bellengier. Formal representation of property
grammars. In Proceedings of ESSLLI Student Session, 2003.
</p>
<p>6Ce point avait &#233;t&#233; introduit dans Gu&#233;not &amp; Bellengier (2004).</p>

</div></div>
</body></html>