<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Indexation automatique de ressources de sant&#233; &#224; l'aide de paires de descripteurs MeSH</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Indexation automatique de ressources de sant&#233;  
&#224; l&#8217;aide de paires de descripteurs MeSH 
</p>
<p>Aur&#233;lie N&#233;v&#233;ol1, 2       Alexandrina Rogozan1      St&#233;fan J. Darmoni1, 2 
</p>
<p>1Laboratoire PSI &#8211; FRE 2645 CNRS Universit&#233; et  INSA de Rouen 
{aneveol, arogozan}@insa-rouen.fr 
</p>
<p>2Equipe CISMeF, CHU de Rouen - 1, rue de Germont - 76031 Rouen  
stefan.darmoni@univ-rouen.fr 
</p>
<p>Mots-cl&#233;s: Indexation Automatique, Terminologie M&#233;dicale, Vocabulaire Contr&#244;l&#233;. 
</p>
<p>Keywords: Automatic Indexing, Medical Terminology, Controlled Vocabulary.  
</p>
<p>R&#233;sum&#233;: Depuis quelques ann&#233;es, m&#233;decins et documentalistes doivent faire face &#224; une 
demande croissante dans le domaine du codage m&#233;dico-&#233;conomique et de l'indexation des 
diverses sources d'information disponibles dans le domaine de la sant&#233;. Il est donc n&#233;cessaire 
de d&#233;velopper des outils d&#8217;indexation automatique qui r&#233;duisent les d&#233;lais d&#8217;indexation et 
facilitent l'acc&#232;s aux ressources m&#233;dicales. Nous proposons deux m&#233;thodes d&#8217;indexation 
automatique de ressources de sant&#233; &#224; l&#8217;aide de paires de descripteurs MeSH. La combinaison 
de ces deux m&#233;thodes permet d'optimiser les r&#233;sulats en exploitant la compl&#233;mentarit&#233; des 
approches. Les performances obtenues sont &#233;quivalentes &#224; celles des outils de la litt&#233;rature 
pour une indexation &#224; l&#8217;aide de descripteurs seuls.  
</p>
<p>Abstract: The increasing number of health documents available in electronic form, and 
the demand on both practitioners and librarians to encode these documents with controlled 
vocabulary information calls for automatic tools and methods to help them perform this task 
efficiently. In this article, we are presenting and comparing two methods for the automatic 
indexing of heath resources with pairs of MeSH descriptors. A combination of both methods 
achieves better results by exploiting the complementarity of the approaches. This 
performance matches the tools described in the litterature for single term indexing. 
</p>
<p>Introduction 
</p>
<p>Depuis quelques ann&#233;es, le nombre de documents &#233;lectroniques augmente de mani&#232;re 
exponentielle. Se pose alors la question de l'exploitation efficace de ces ressources. Dans les 
domaines de la sant&#233; et de la bio-m&#233;decine, de nombreux travaux ont &#233;t&#233; entrepris afin de 
guider les utilisateurs dans leur recherche d'information. Ainsi, la base documentaire 
MEDLINE&#174; recense 11 millions d&#8217;articles scientifiques en langue anglaise index&#233;s &#224; l'aide 
du th&#233;saurus MeSH&#174; (Medical Subject Headings) d&#233;velopp&#233; et maintenu par la NLM </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. N&#233;v&#233;ol, A. Rogozan et SJ. Darmoni 
</p>
<p>(National Library of Medicine). En Europe, la fondation HON (Health On the Net- 
http://www.hon.ch/) ou le Catalogue et Index des Sites M&#233;dicaux Francophones (CISMeF- 
http://www.cismef.org) se proposent de guider les internautes vers une information m&#233;dicale 
de qualit&#233;. Dans ces deux projets europ&#233;ens, la description des ressources1 s'appuie sur la 
version fran&#231;aise du MeSH. Notre objectif est de formaliser cette d&#233;marche et de proposer 
une m&#233;thode d'indexation automatique en ad&#233;quation avec les caract&#233;ristiques de l'indexation 
manuelle. Nous pr&#233;sentons deux m&#233;thodes r&#233;pondant &#224; ces crit&#232;res. Apr&#232;s les avoir &#233;valu&#233;es 
s&#233;par&#233;ment puis combin&#233;es, nous discutons de l&#8217;int&#233;r&#234;t d&#8217;utiliser de tels outils dans le cadre 
de l'aide &#224; l'indexation. 
</p>
<p>1 M&#233;thodes d&#8217;indexation 
</p>
<p>1.1 Indexation Manuelle 
</p>
<p>Les principes de l'indexation manuelle &#224; l'aide de descripteurs MeSH (mots cl&#233;s et 
qualificatifs) sont clairement expos&#233;s dans (Dailland et al., 2003). Les caract&#233;ristiques de 
cette indexation sont: (a) l&#8217;utilisation de descripteurs obligatoires (des mots cl&#233;s particuliers, 
par exemple &lt;sujet &#226;g&#233;&gt;), (b) l&#8217;association de qualificatifs pour pr&#233;ciser les mots cl&#233;s le cas 
&#233;ch&#233;ant (par exemple, la paire &lt;diab&#232;te/chimioth&#233;rapie&gt; sera utilis&#233;e de pr&#233;f&#233;rence au mot 
cl&#233; isol&#233; &lt;diab&#232;te&gt; pour &#233;voquer les traitements m&#233;dicamenteux du diab&#232;te) et (c) 
l'adaptation du nombre de mots cl&#233;s (ou de paires) utilis&#233;s pour indexer une ressource en 
fonction de son contenu (par exemple, dans le catalogue CISMeF, les ressources sont 
index&#233;es avec un nombre de mots cl&#233;s (ou paires) pouvant aller de z&#233;ro &#224; plusieurs dizaines). 
De mani&#232;re plus g&#233;n&#233;rale, on retiendra &#233;galement qu'il existe un consensus entre les experts 
(Anderson et P&#233;rez-Carballo, 2001) selon lequel l'indexation manuelle s'effectue en deux 
&#233;tapes: 1- l'analyse du document, afin d'en retirer le contenu et 2- la traduction de ce contenu 
dans le langage retenu pour la description (par exemple, le MeSH). En pratique, une troisi&#232;me 
&#233;tape de relecture et de r&#233;vision peut &#233;galement &#234;tre ajout&#233;e.  
</p>
<p>1.2 Indexation Automatique 
</p>
<p>1.2.1 M&#233;thode de Traitement Automatique de la Langue Naturelle (TALN) 
</p>
<p>Cette m&#233;thode, d&#233;taill&#233;e dans (N&#233;v&#233;ol, 2004), suit les &#233;tapes de l'indexation manuelle 
(analyse, traduction et r&#233;vision). Une analyse de surface utilisant un dictionnaire MeSH et une 
biblioth&#232;que de graphes permet de reconna&#238;tre les diff&#233;rentes formes prises par les concepts 
m&#233;dicaux (flexions, synonymes, hyperonymes, &#8230;) et de les comptabiliser afin d'attribuer un 
score &#224; chaque concept. Les informations n&#233;cessaires &#224; la traduction des concepts sous forme 
MeSH sont contenues dans le dictionnaire (pour les mots cl&#233;s) et dans les graphes (pour les 
paires). Les relations hi&#233;rarchiques entre termes MeSH permettent de r&#233;duire la liste des 
candidats en reportant les occurrences des mots cl&#233;s p&#232;res vers leurs fils afin d&#8217;indexer au 
</p>
<p>                                                 
1  Afin de rendre compte de la multiplicit&#233; des documents &#233;lectroniques index&#233;s tant du point de vue du format, 
</p>
<p>du type de document, que des usages auxquels ils sont destin&#233;s, nous utiliserons le terme de &quot;ressource&quot;.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide de paires de descripteurs MeSH 
</p>
<p>plus pr&#233;cis. L&#8217;application de r&#232;gles d&#8217;indexation dans un deuxi&#232;me temps permet de r&#233;viser la 
liste des candidats avant d&#8217;obtenir l&#8217;indexation finale avec la fonction de rupture d&#233;crite en 
1.2.3. Les r&#232;gles d&#8217;indexation sont de deux types : 
</p>
<p>1. Des r&#232;gles d&#8217;indexation issues de la NLM pr&#233;conisant l&#8217;utilisation d&#8217;un mot cl&#233; 
MeSH de pr&#233;f&#233;rence &#224; une paire mot cl&#233;/qualificatif pour repr&#233;senter un concept. La 
r&#232;gle &#171; MC1/Q1 =&gt; MC2 &#187; indique qu&#8217;il convient de remplacer la paire MC1/Q1 par le 
seul mot cl&#233; MC2. Par exemple:&lt;c&#339;ur/transplantation&gt; =&gt; &lt;transplantation 
cardiaque&gt; 
</p>
<p>2. Des r&#232;gles d&#8217;indexation CISMeF pr&#233;conisant l&#8217;introduction d'un mot cl&#233; (ou paire). 
Ainsi, la r&#232;gle &#171; MC1/Q12 + MC2/Q22 &#187; indique qu&#8217;il convient d&#8217;ajouter la paire 
MC2/Q2 &#224; l&#8217;indexation d&#8217;une ressource d&#233;j&#224; index&#233;e avec la paire MC1/Q1. Par 
exemple : &lt;appendicectomie&gt; + &lt;appendicite/chirurgie&gt; 
</p>
<p>1.2.2 M&#233;thode des k plus proches voisins (k-PPV) 
</p>
<p>La m&#233;thode des k-PPV est une r&#233;f&#233;rence dans le domaine de la classification. Son principe est 
simple. Soit C une collection de ressources &#233;tiquet&#233;es not&#233;es ri. Soit r&#8713; C une ressource &#224; 
&#233;tiqueter. On calcule la similarit&#233; s(r, ri) de r &#224; chaque ressource ri de C, et on s&#233;lectionne ses 
k plus proches voisins, c'est &#224; dire r1, &#8230;rk tels que s(r, ri) soit maximum pour i=1, &#8230;k. La 
similarit&#233; s(r, ri) entre deux ressources correspond au nombre de mots pleins en commun 
entre le titre de r et celui de ri. Chaque ressource est repr&#233;sent&#233;e par un sac de mots issu du 
titre apr&#232;s filtrage des mots grammaticaux &#224; l'aide d'un anti-lexique (Salton et Mc Gill, 1983). 
Dans le cas o&#249; on cherche &#224; &#233;tiqueter les ressources avec une seule classe, la nouvelle 
ressource peut &#234;tre &#233;tiquet&#233;e avec la classe dominante parmi ses k plus proches voisins. Dans 
le cadre de l'indexation, les classes avec lesquelles nous allons &#233;tiqueter les ressources sont 
des mots cl&#233;s ou des paires mot cl&#233;/qualificatif MeSH. De plus, l'indexation d'une ressource 
doit &#234;tre compos&#233;e d'un nombre a-priori inconnu de mots cl&#233;s (ou paires). Nous associons 
donc &#224; r une liste de candidats MeSH auxquels un score S (compris entre 1 et k) est attribu&#233; 
en fonction du vote des k voisins. Le choix d'une valeur de k est &#233;voqu&#233; &#224; la section 2. La 
fonction de rupture d&#233;crite en 1.2.3 permet de s&#233;lectionner les candidats retenus pour 
l'indexation finale.  
</p>
<p>1.2.3 Fonction de rupture 
</p>
<p>Soit N le nombre de mots cl&#233;s (ou paires) candidats &#224; l&#8217;indexation extraits &#224; l&#8217;aide de l&#8217;une 
des m&#233;thodes ci-dessus. Soit Si le score attribu&#233; au i-&#232;me candidat. On suppose que les 
candidats sont class&#233;s par ordre de scores d&#233;croissants, de sorte que S1&gt; &#8230;&gt; Si &gt;&#8230; &gt;SN. Pour 
</p>
<p>i =1, &#8230;, N-1, on calcule 
1ii
</p>
<p>1ii
</p>
<p>S  S
S - S
</p>
<p>+
+
</p>
<p>+=F . Le seuil retenu sera i tel que F soit maximum. 
</p>
<p>                                                 
2  On consid&#232;re ici que les qualificatifs peuvent &#234;tre &#171; vides &#187;, c&#8217;est &#224; dire que les r&#232;gles CISMeF peuvent statuer sur des 
</p>
<p>mots cl&#233;s seuls ou associ&#233;s &#224; un qualificatif.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. N&#233;v&#233;ol, A. Rogozan et SJ. Darmoni 
</p>
<p>1.2.4 M&#233;thodes Mixtes 
</p>
<p>Afin d'&#233;valuer la compl&#233;mentarit&#233; des m&#233;thodes pr&#233;sent&#233;es ci-dessus (1.2.1 et 1.2.2), nous 
avons combin&#233; les indexations obtenues selon deux proc&#233;d&#233;s, l'un prenant en compte le rang 
des mots cl&#233;s (ou paires) r&#233;sultant de l'indexation TALN et k-PPV, l'autre prenant en compte 
le score attribu&#233; aux mots cl&#233;s (ou paires) par ces m&#233;thodes. Ainsi, &#224; chaque mot cl&#233; (ou 
paire) est attribu&#233; un nouveau score &#233;gal &#224; la somme de ses rangs (resp. scores relatifs) dans 
les deux m&#233;thodes. Si un mot cl&#233; n'a &#233;t&#233; extrait que par une seule m&#233;thode, son rang (resp. 
score relatif) pour la deuxi&#232;me m&#233;thode est consid&#233;r&#233; comme nul. Les mots cl&#233;s (ou paires) 
sont ensuite class&#233;s par score d&#233;croissant. Dans les deux cas, nous avons plac&#233; en t&#234;te du 
classement les mots cl&#233; (ou paires) extraits conjointement par les deux m&#233;thodes.  
</p>
<p>2 Exp&#233;rimentation  
</p>
<p>Le corpus d'&#233;valuation utilis&#233; est compos&#233; de 82 ressources extraites al&#233;atoirement du 
catalogue CISMeF. Chaque ressource du corpus a &#233;t&#233; index&#233;e automatiquement &#224; l'aide des 
m&#233;thodes TALN et k-PPV successivement. Les r&#233;sultats obtenus par les deux m&#233;thodes ont 
ensuite &#233;t&#233; combin&#233;s comme indiqu&#233; en 1.2.4. Dans chaque cas, l&#8217;indexation automatique 
obtenue a &#233;t&#233; compar&#233;e &#224; l&#8217;indexation manuelle de r&#233;f&#233;rence. Les performances sont &#233;valu&#233;es 
avec les mesures habituelles de pr&#233;cision et de rappel, ainsi que la F-measure qui combine ces 
deux derni&#232;res. Un poids &#233;quivalent est alors accord&#233; &#224; la pr&#233;cision et au rappel (Manning et 
Sch&#252;tze, 1999). La Figure 1 pr&#233;sente la F-measure en fonction du rang pour chacune des 
m&#233;thodes. 
</p>
<p> 
</p>
<p>Figure 1 : Courbes F-measure en fonction du rang 
</p>
<p>Le Tableau 1 pr&#233;sente la pr&#233;cision et le rappel obtenus pour chaque m&#233;thode s&#233;par&#233;ment 
(colonnes 1 &#224; 3), et pour la combinaison des m&#233;thodes fond&#233;e sur le rang et sur les scores 
(colonnes 4 et 5). Pour la m&#233;thode des k-PPV, plusieurs valeurs de k ont &#233;t&#233; test&#233;es (k=1, 3, 5, 
10, 15) et les meilleurs r&#233;sultats ont &#233;t&#233; observ&#233;s avec k=10, bien que pour certaines 
ressources, il ne soit pas possible de trouver dix voisins (il arrive m&#234;me qu'aucun voisin ne 
soit trouv&#233;). Dans ce cas, les valeurs de pr&#233;cision et de rappel de la m&#233;thode sur une telle 
ressource sont consid&#233;r&#233;es comme nulles. Dans la troisi&#232;me colonne (N=73) nous donnons les 
performances obtenues pour les soixante treize ressources pour lesquelles au moins dix 
voisins ont &#233;t&#233; trouv&#233;s.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide de paires de descripteurs MeSH 
</p>
<p>Rang TALN 10-PPV (N=82) 10-PPV (N=73) Mixte Rang Mixte Score  
</p>
<p>  
</p>
<p>1 
4 
10 
50 
</p>
<p>T 
</p>
<p>P - R  
</p>
<p>36 &#8211; 5 
32 &#8211; 16 
22 &#8211; 27 
8 &#8211; 40 
</p>
<p>27 - 21  
(Tmoyen=12) 
</p>
<p>P - R  
</p>
<p>51 -  6 
30 &#8211; 13 
20 &#8211; 21 
7 &#8211; 35 
</p>
<p>32 &#8211; 16  
(Tmoyen =5) 
</p>
<p>P - R  
</p>
<p>57 -  6 
34 &#8211; 15 
22 &#8211; 23 
 8 - 40 
</p>
<p>36 &#8211; 18 
(Tmoyen =5) 
</p>
<p>P - R  
</p>
<p>51 -  6  
38 -  17 
26 -  31 
10 -  53  
</p>
<p>34 &#8211; 24 
 (Tmoyen =9) 
</p>
<p>P - R  
</p>
<p>49 -  6  
36 -  18  
27 -  33  
10 -  53  
</p>
<p> 32 &#8211; 25 
(Tmoyen =9) 
</p>
<p>Tableau. 1 : Pr&#233;cision et Rappel de chaque m&#233;thode sur un corpus de 82 ressources 
</p>
<p>3 Discussion  
</p>
<p>3.1 Performances des diff&#233;rentes m&#233;thodes 
</p>
<p>D'apr&#232;s le Tableau 1 et la Figure 1, on peut remarquer que la combinaison des deux m&#233;thodes 
d'indexation pr&#233;sent&#233;es offre une pr&#233;cision sup&#233;rieure ou &#233;gale &#224; chacune des m&#233;thodes. 
Rappel et F-measure sont &#233;galement meilleurs. Cela rejoint les conclusions de (Aronson et al. 
2004) qui observent une am&#233;lioration des performances du syst&#232;me MTI lorsqu'un module 
statistique vient compl&#233;ter le module de traitement linguistique. Les r&#233;sultats de la 
combinaison des deux m&#233;thodes sont &#233;quivalents &#224; ceux des extracteurs MeSH francophones 
de la litt&#233;rature (N&#233;v&#233;ol et al. 2005). Cependant, le syst&#232;me que nous pr&#233;sentons a l'avantage 
d'indexer &#224; l&#8217;aide de paires mot cl&#233;/qualificatifs alors que les autres syt&#232;mes existants &#8211; par 
exemple, (Pouliquen, 2002) ou (Gaudinat et al., 2002), extraient des termes isol&#233;s. La 
fonction de rupture est efficace dans la mesure o&#249;, la pr&#233;cision au seuil T est g&#233;n&#233;ralement 
plus &#233;lev&#233;e que la pr&#233;cision obtenue au rang fixe &#233;quivalent (par exemple, la pr&#233;cision est de 
32 &#224; T=5 contre 29 au rang fixe 5 pour la m&#233;thode k-PPV). Pour les m&#233;thodes combin&#233;es, les 
chiffres sur le seuil (en italique) sont donn&#233;s &#224; titre indicatif, et ont &#233;t&#233; obtenus en effectuant 
une moyenne entre pr&#233;cision et rappel aux seuils pour les m&#233;thodes TALN et k-PPV.  
</p>
<p>3.2 Compl&#233;mentarit&#233; des m&#233;thodes 
</p>
<p>Le dictionnaire MeSH utilis&#233; par la m&#233;thode TALN permet de ne pas limiter l&#8217;indexation aux 
termes MeSH d&#233;j&#224; pr&#233;sents dans la base de ressources index&#233;es (~11.000 termes MeSH sur 
pr&#232;s de 23.000). L&#8217;approche k-PPV utilise une indexation manuelle de r&#233;f&#233;rence, et permet 
ainsi de proposer une indexation coh&#233;rente avec la base existante. De plus, elle peut extraire 
des mots cl&#233;s qui sont pour l&#8217;instant difficilement rep&#233;rables avec la m&#233;thode TALN, comme 
&lt;&#233;tude comparative&gt;. En effet, ces termes apparaissent rarement dans le texte des ressources 
et doivent &#234;tre d&#233;duits d&#8217;une analyse globale de la ressource. Par exemple, un article faisant 
&#233;tat d&#8217;une m&#234;me &#233;tude &#233;pid&#233;miologique r&#233;alis&#233;e en France et au Canada pourra &#234;tre index&#233; 
avec le mot cl&#233; &lt;&#233;tude comparative&gt; bien que celui-ci ne soit jamais explicitement utilis&#233;. 
Ainsi, d&#232;s les premiers rangs, le rappel obtenu avec la fusion des m&#233;thodes est sup&#233;rieur au 
rappel obtenu avec l&#8217;une des m&#233;thodes utilis&#233;e s&#233;par&#233;ment. Cependant, la m&#233;thode des k-PPV </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. N&#233;v&#233;ol, A. Rogozan et SJ. Darmoni 
</p>
<p>est fond&#233;e sur le titre des ressources, ce qui peut poser probl&#232;me si le titre n&#8217;est pas 
suffisamment explicite, ou si la base comporte trop peu de ressources aux titres similaires. 
Ainsi, on peut observer un silence de la m&#233;thode (11% des cas sur le corpus utilis&#233;) ou bien 
une indexation approximative. L&#8217;utilisation conjointe de la m&#233;thode TALN permet de 
minimiser l&#8217;impact de ces erreurs. Le fait de placer les termes communs aux deux m&#233;thodes 
en t&#234;te de l'indexation combin&#233;e permet de mettre en avant des termes qui avaient obtenu un 
score bas avec les deux m&#233;thodes. 
</p>
<p>4 Conclusion et perspectives 
</p>
<p>Nous avons pr&#233;sent&#233; deux m&#233;thodes d'indexation automatique de documents m&#233;dicaux 
inovantes dans la mesure o&#249; elles proposent une indexation &#224; l'aide de paires de descripteurs 
MeSH. Ces approches ont &#233;t&#233; &#233;valu&#233;es s&#233;par&#233;ment, puis combin&#233;es sur un corpus de 82 
ressources. Il appara&#238;t que la fusion des deux approches offre des performances sup&#233;rieures &#224; 
chacune des m&#233;thodes seules. Pour la poursuite de ce travail, nous pr&#233;parons une &#233;valuation 
aupr&#232;s d'indexeurs professionnels afin de d&#233;terminer si la r&#233;vision de l'indexation automatique 
propos&#233;e par les syst&#232;mes combin&#233;s permet un gain de temps et/ou une r&#233;duction du silence 
de l'indexation manuelle. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>ANDERSON, JD., P&#201;REZ-CARBALLO, J. (2001) The nature of indexing: how humans and 
machines analyze messages and texts for retrieval. Part I. IPM 37(2), 231-254. 
</p>
<p>ARONSON AR., MORK JG., GAY CW., HUMPHREY SM., ROGERS WJ (2004). The NLM 
Indexing Initiative&#8217;s Medical Text Indexer. Actes de MEDINFO 2004; 268-71. 
</p>
<p>DAILLAND, F. LEUTHEREAU, A. AND VALLEE, H. (2003).  Aide m&#233;moire d&#8217;indexation MeSH 
et F-MeSH pour le catalogage. Rapport Technique de l&#8217;INSERM. Biblioth&#232;que de la Facult&#233; 
de M&#233;decine de Paris XI.  
</p>
<p>GAUDINAT, A., BOYER, C., BAUJARD, V., RUCH P. (2002) Evaluation de l'extraction de termes 
MeSH pour les syst&#232;mes de recherche d'information dans le domaine m&#233;dical. Actes des 
JFIM.  
</p>
<p>MANNING, C., SH&#220;TZE, H. (1999) Foundations of Statistical NLP, MIT Press. 
NEVEOL, A. (2004) Indexation automatique de ressources de sant&#233; &#224; l&#8217;aide d&#8217;un vocabulaire 
contr&#244;l&#233;. Actes de RECITAL. 2004;105-114. 
</p>
<p>N&#201;V&#201;OL, A., MARY V, GAUDINAT, A., ROGOZAN A., DARMONI SJ. (2005) Benchmark 
evaluation of the French MeSH indexing systems; soumis &#224; AIME 2005. 
</p>
<p>POULIQUEN B. (2002) Indexation de textes m&#233;dicaux par indexation de concepts, et ses 
utilisations, Th&#232;se de Doctorat, Universit&#233; Rennes 1. 
</p>
<p>SALTON, G., MC GILL, M.J. (1983) Introduction to Modern Information Retrieval. New York : 
McGraw-Hill. 
 </p>

</div></div>
</body></html>