<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Des arbres de d&#233;rivation aux for&#234;ts de d&#233;pendance : un chemin via les for&#234;ts partag&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#150;10 juin 2005
</p>
<p>Des arbres de d&#216;rivation aux for&#338;ts de d&#216;pendance : un
chemin via les for&#338;ts partag&#216;es
</p>
<p>Djam&#233; Seddah - Bertrand Gaiffe
Laboratoire LORIA, Equipe Langue et Dialogue
</p>
<p>Campus Scientifique, BP 239
F-54506 Vand&#339;uvre-l&#232;s-Nancy Cedex
</p>
<p>{djame.seddah,bertrand.gaiffe}@loria.fr
</p>
<p>Mots-clefs : TAG, analyse syntaxique, s&#233;mantique, arbre de d&#233;pendance,for&#234;t partag&#233;e,
for&#234;t de d&#233;rivation
</p>
<p>Keywords: TAG, syntax, semantic, dependency tree, shared forest, derivation forest
</p>
<p>R&#216;sum&#216; L&#8217;objectif de cet article est de montrer comment b&#226;tir une structure de r&#233;pre-
sentation proche d&#8217;un graphe de d&#233;pendance &#224; l&#8217;aide des deux structures de repr&#233;sentation
canoniques fournies par les Grammaires d&#8217;Arbres Adjoints Lexicalis&#233;es . Pour illustrer cette
approche, nous d&#233;crivons comment utiliser ces deux structures &#224; partir d&#8217;une for&#234;t partag&#233;e.
</p>
<p>Abstract This paper aims describing an approach to semantic representation in the Lexi-
calized Tree Adjoining Grammars (LTAG) paradigm : we show how to use all the informations
contained in the two representation structures provided by the LTAG formalism in order to
provide a dependency graph.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Seddah, B. Gaiffe
</p>
<p>1 Introduction
</p>
<p>Dans cet article1, nous montrerons comment construire un graphe de d&#233;pendance dont les prin-
cipales propri&#233;t&#233;s sont de mat&#233;rialiser des liens syntaxiques non repr&#233;sent&#233;s dans l&#8217;arbre de
d&#233;rivation et de d&#233;crire toutes les analyses dans une seule structure compacte.
</p>
<p>1.1 Les grammaires d&#8217;arbres adjoints
</p>
<p>Une grammaire LTAG est essentiellement un lexique o&#249; chaque lemme est associ&#233; &#224; un ensem-
ble d&#8217;arbres. Ces arbres, appel&#233;s arbres &#233;l&#233;mentaires, sont manipulables par deux op&#233;rations :
la substitution et l&#8217;adjonction. La substitution op&#232;re sur un ensemble restreint d&#8217;arbres appel&#233;s
arbres initiaux et correspond &#224; une d&#233;rivation hors-contexte. Cette op&#233;ration est obligatoire,
contrairement, d&#8217;une fa&#231;on g&#233;n&#233;rale, &#224; l&#8217;adjonction qui op&#232;re sur des arbres appel&#233;s auxiliaires
et qui correspond &#224; l&#8217;insertion d&#8217;un arbre sp&#233;cifique au sein d&#8217;un arbre &#233;l&#233;mentaire (indiff&#233;rem-
ment initial ou auxiliaire) .
</p>
<p>&#945;3 &#946;1&#945;1|&#945;2
Arbres initiaux Arbre auxiliaire
</p>
<p>N
</p>
<p>(Jean | Marie)
</p>
<p>P
</p>
<p>VN0 N1
</p>
<p>aime
</p>
<p>V
</p>
<p>V* Adv
</p>
<p>beaucoup
</p>
<p>Figure 1: Arbres &#233;l&#233;mentaires d&#8217;une LTAG
</p>
<p>Tous les arbres &#233;l&#233;mentaires sont des projections d&#8217;entr&#233;es lexicales et par d&#233;finition d&#233;crivent
tous les arguments syntaxiques des ancres associ&#233;es. De fait quand une LTAG suit les principes
de bonnes constructions (Abeill&#233;, 1991) tels que le principe de co-occurence pr&#233;dicat-argument
et le principe de minimalit&#233; s&#233;mantique, les arguments syntaxiques correspondent &#224; des ar-
guments s&#233;mantiques. C&#8217;est pourquoi l&#8217;une des deux structures de repr&#233;sentation des LTAG,
l&#8217;arbre de d&#233;rivation, qui formellement n&#8217;est que l&#8217;enregistrement des op&#233;rations r&#233;sultant
d&#8217;une analyse syntaxique, peut &#234;tre vu comme une structure pr&#233;dicat-argument.
La figure 2 nous montre que l&#8217;arbre de d&#233;rivation 2 refl&#232;te la structure pr&#233;dicat-argument de la
phrase &#147;Jean aime beaucoup Marie&#148;.
&#201;tant donn&#233; que chaque n&#339;ud de l&#8217;arbre de d&#233;rivation correspond &#224; une projection d&#8217;un arbre
&#233;l&#233;mentaire et que chacune de ses branches d&#233;crit l&#8217;op&#233;ration de combinaison entre deux n&#339;uds,
on associe &#224; ces n&#339;uds une adresse de Gorn3 indiquant o&#249; l&#8217;op&#233;ration a eu lieu. Ainsi, l&#8217;arbre de
d&#233;rivation d&#233;crit de fa&#231;on univoque l&#8217;arbre d&#233;riv&#233; qui est l&#8217;arbre syntagmatique d&#8217;un &#233;nonc&#233;
(fig. 2).
</p>
<p>1Nous tenons &#224; remercier vivement les reviewers de TALN 2005 pour leurs commentaires et leurs aimables
corrections.
</p>
<p>2Pour des raisons de simplicit&#233;, chaque arbre dont le nom commence par &#946;, resp. &#945;, est un arbre auxiliaire,
resp. initial. &#947; quand ce type est indiff&#233;rent.
</p>
<p>3Cette adresse correspond &#224; une s&#233;quence d&#8217;entiers positifs d&#233;finie par induction de la fa&#231;on suivante : la
s&#233;quence vide not&#233;e 0 est l&#8217;adresse du n&#339;ud racine de l&#8217;arbre et p.k est l&#8217;adresse du k-i&#232;me fils du n&#339;ud d&#8217;adresse p.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Des arbres de d&#233;rivation aux for&#234;ts de d&#233;pendance
</p>
<p>Arbre de d&#233;rivation Arbre d&#233;riv&#233;
</p>
<p>&#945;3 aime
</p>
<p>(1) &#945;1 Jean (3) &#945;3 Marie (2) &#946;1 beaucoup
</p>
<p>P
</p>
<p>N0
</p>
<p>Jean
</p>
<p>V
</p>
<p>V
</p>
<p>aime
</p>
<p>Adv
</p>
<p>beaucoup
</p>
<p>N1
</p>
<p>Marie
</p>
<p>Figure 2: Arbre d&#233;riv&#233; et arbre de d&#233;rivation pour Jean aime beaucoup Marie
</p>
<p>1.2 Un formalisme id&#233;al pour une interface syntaxe s&#233;mantique id&#233;ale ?
</p>
<p>Dans un monde id&#233;al il serait possible de travailler &#224; partir de cette structure afin de construire
une repr&#233;sentation logique dans l&#8217;optique d&#8217;une s&#233;mantique compositionnelle &#224; la Montague.
Pour &#233;tablir les fondements d&#8217;un tel mod&#232;le il suffirait d&#8217;associer un &#955;-terme &#224; chaque arbre &#233;l&#233;-
mentaire et d&#8217;utiliser l&#8217;arbre de d&#233;rivation comme support aux diff&#233;rentes &#946;-r&#233;ductions induites
par les combinaisons syntaxiques de l&#8217;analyse. Ainsi, si l&#8217;on se base sur la propri&#233;t&#233; obligatoire
de compl&#233;tion d&#8217;un n&#339;ud de substitution, on peut consid&#233;rer ce type de n&#339;uds comme support
&#224; des variables argumentales. Comme l&#8217;adjonction a comme propri&#233;t&#233;s d&#8217;&#234;tre non pr&#233;dictible et
optionnelle, on pourrait consid&#233;rer l&#8217;arbre o&#249; l&#8217;adjonction a lieu comme un argument &#224; la fonc-
tion associ&#233;e &#224; l&#8217;arbre auxiliaire qui s&#8217;adjoint. De cette fa&#231;on, on pourrait interpr&#233;ter l&#8217;arbre de
d&#233;rivation figure 2 de la fa&#231;on suivante (figure 3) sachant que dans ce mini mod&#232;le, on remplace
les variables classiques du &#955;-calcul par des positions argumentales entre crochets4.
</p>
<p>&#946;1 (beaucoup): &#955;([1]) &#946;1([1]) (&#945;1)
</p>
<p>[1] &#945;1 (aimer):
&#955;([1], [2]) &#945;1([1], [2]) (&#945;2, &#945;3)
</p>
<p>[1] &#945;2 (Jean) [2] &#945;3 (Marie)
</p>
<p>Figure 3: Interface syntaxe s&#233;mantique dans un monde id&#233;al
</p>
<p>Le probl&#232;me de ce type d&#8217;interfaces syntaxe-s&#233;mantique est qu&#8217;elles fonctionnent uniquement
sur un sous-ensemble restreint du langage avec des structures pr&#233;dicatives simples. Les LTAG
en tant que formalisme de d&#233;part ne font pas de distinctions entre adjonctions pr&#233;dicatives et
modifieures (les premi&#232;res inversant le sens des d&#233;pendances s&#233;mantiques (Candito &amp; Kahane,
1998)) ; de plus il n&#8217;y a pas de m&#233;canismes permettant de r&#233;soudre les probl&#232;mes d&#8217;ambigu&#239;t&#233;s
des quantifieurs et, pire, certains liens syntaxiques entre des compl&#233;ments verbaux et leurs su-
jets n&#8217;apparaissent pas dans l&#8217;arbre de d&#233;rivation.
Les solutions analysant les d&#233;ficiences de l&#8217;arbre de d&#233;rivation sont nombreuses (Candito &amp;
Kahane, 1998; Schabes &amp; Shieber, 1994; Rambow &amp; Joshi, 1994). Ces solutions peuvent &#234;tre
divis&#233;es en deux groupes : celles o&#249; l&#8217;arbre de d&#233;rivation est consid&#233;r&#233; comme inutilisable,
l&#8217;arbre d&#233;riv&#233; est donc utilis&#233; comme support &#224; une interface syntaxe-s&#233;mantique (Gardent &amp;
Kallmeyer, 2003; Franck &amp; van Genabith, 2001) ; et celles o&#249; l&#8217;on consid&#232;re que les informa-
tions port&#233;es par l&#8217;arbre de d&#233;rivation doivent &#234;tre enrichies, le formalisme LTAG &#233;tant modifi&#233;
</p>
<p>4Les &#955;-termes lexicaux sont ici, bien s&#251;r, simplifi&#233;s</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Seddah, B. Gaiffe
</p>
<p>sinon remplac&#233; par les TAG Ensemblistes5 afin de pouvoir g&#233;rer les informations de port&#233;es des
modifieurs (Kallmeyer &amp; Joshi, 1999).
</p>
<p>Les solutions bas&#233;es sur l&#8217;arbre d&#233;riv&#233; ont pour principal probl&#232;me d&#8217;&#234;tre bas&#233;es sur l&#8217;unification
de structures de traits et sur l&#8217;utilisation conjointe d&#8217;une s&#233;mantique plate comme liant via uni-
fication des arguments afin d&#8217;obtenir une structure pr&#233;dicative correcte ou une formule logique.
Le probl&#232;me est que chaque &#233;v&#233;nement qui a lieu durant ce processus advient sur un n&#339;ud o&#249;
une d&#233;rivation a pris place (adjonction ou substitution) ; ces solutions simulent donc de fa&#231;on
implicite l&#8217;arbre de d&#233;rivation au sein d&#8217;une structure que lui-m&#234;me d&#233;crit sans &#233;quivoque6.
Nous partons du principe que pour &#233;tablir une interface syntaxe s&#233;mantique &#224; partir des LTAG,
nous devons d&#8217;abord nous assurer que tous les liens argumentaux sont pr&#233;sents dans la structure
de repr&#233;sentation.
Sur la base de l&#8217;analyse de la probl&#233;matique des verbes &#224; contr&#244;le, nous proposons une fa&#231;on
de construire un graphe de d&#233;pendance &#224; partir des informations contenues tant dans l&#8217;arbre
d&#233;riv&#233; que dans l&#8217;arbre de d&#233;rivation &#224; l&#8217;aide d&#8217;une structure d&#233;crivant ces deux arbres : la for&#234;t
partag&#233;e.
</p>
<p>2 La probl&#216;matique pos&#216;e par les verbes &#224; contr&#244;le
Nous rappellerons bri&#232;vement dans cette section la difficult&#233; d&#8217;analyse que posent les verbes &#224;
contr&#244;le dans le formalisme LTAG7.
On utilise souvent les verbes &#224; contr&#244;le comme t&#233;moin d&#8217;un hiatus entre syntaxe et s&#233;mantique
en TAG pour la simple raison que s&#8217;il existe un lien de sous-cat&#233;gorisation entre un sujet et le
verbe qui le sous-cat&#233;gorise, ce lien devrait &#234;tre repr&#233;sent&#233; dans l&#8217;arbre de d&#233;rivation (principe
de co-occurence pr&#233;dicat-argument).
Or l&#8217;arbre de d&#233;rivation (fig. 5) issu de l&#8217;analyse de la phrase (1) Jean esp&#321;re dormir , suivant
la grammaire jouet figure 48, ne contient pas de lien entre le sujet non r&#233;alis&#233; de &#8220;dormir&#8221; et le
sujet qu&#8217;il sous-cat&#233;gorise : &#8220;Jean&#8221;. Or ce lien est pr&#233;sent via la structure de traits dans l&#8217;arbre
d&#233;riv&#233;9 figure 5.
En r&#233;alit&#233; la structure que nous voudrions obtenir est un graphe dans lequel ce lien est pr&#233;sent
(figure 6).
Dans cette analyse, un verbe &#224; contr&#244;le ancre un arbre auxiliaire (i.e arbre &#224; contr&#244;le) qui
s&#8217;adjoint sur la racine d&#8217;un arbre initial ayant au plus un n&#339;ud de substitution non-r&#233;alis&#233;.
On peut donc consid&#233;rer qu&#8217;un verbe &#224; contr&#244;le transf&#321;re l&#8217;un de ses arguments vers l&#8217;arbre
sur lequel il s&#8217;adjoint. L&#8217;objectif est donc de formaliser ce processus &#224; travers une op&#233;ration
</p>
<p>5(Weir, 1988) pour les TAG ensemblistes.
6Un autre probl&#232;me de ce type de solutions bas&#233;es sur l&#8217;arbre d&#233;riv&#233; et les structures de traits est l&#8217;emploi d&#8217;un
</p>
<p>nombre non fini de traits ce qui a pour cons&#233;quence d&#8217;accro&#238;tre la capacit&#233; g&#233;n&#233;rative du formalisme(Kallmeyer,
2004).
</p>
<p>7On pourra se reporter &#224; (Abeill&#233;, 1999) pour une analyse compl&#232;te mise en perspective avec les ph&#233;nom&#232;nes
des verbes &#224; mont&#233;es et compar&#233;e &#224; d&#8217;autres formalismes.
</p>
<p>8On notera la position vide domin&#233;e par le n&#339;ud N de l&#8217;arbre &#945;5, nous appelons ce n&#339;ud &#8220;n&#339;ud de substitu-
tion non r&#233;alis&#233;e&#8221; ou sujet non r&#233;alis&#233;
</p>
<p>9comme le trait d&#8217;accord pour la phrase (2) Marie esp&#232;re &#234;tre belle. A des fins de lisibilit&#233;, nous marquons cet
accord par un indice de co-indiciation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Des arbres de d&#233;rivation aux for&#234;ts de d&#233;pendance
</p>
<p>arbre auxiliaire : arbre initial :
(&#946;2) esp&#233;rer (&#945;5) dormir
</p>
<p>P
</p>
<p>N0&#8595; V
</p>
<p>[esp&#233;rer]
</p>
<p>P0*
</p>
<p>P
</p>
<p>N
</p>
<p>&#949;
</p>
<p>V
</p>
<p>[dormir]
</p>
<p>Figure 4: Grammaire jouet verbe &#224; contr&#244;le
</p>
<p>Arbre d&#233;riv&#233; : Arbre de d&#233;rivation : Graphe de d&#233;pendance
</p>
<p>P
</p>
<p>Ni
</p>
<p>Jean
</p>
<p>V
</p>
<p>esp&#232;re
</p>
<p>P
</p>
<p>Ni
</p>
<p>&#178;
</p>
<p>V
</p>
<p>dormir
</p>
<p>&#945;5 : dormir
</p>
<p>(0) &#946;2 : esp&#232;re
</p>
<p>(1) &#945;1 : Jean
</p>
<p>Figure 5: Analyse LTAG : &#8220;Jean esp&#232;re dormir&#8221;
</p>
<p>dormir
</p>
<p>Jean
</p>
<p>esp&#233;rer
</p>
<p>Figure 6: Graphe pour &#8220;Jean esp&#232;re dormir&#8221;
</p>
<p>appel&#233;e : fusion argumentale.
</p>
<p>2.1 Informations pr&#233;alables
</p>
<p>Les seules op&#233;rations visibles sur un arbre de d&#233;rivation sont la substitution et l&#8217;adjonction
parce qu&#8217;elles t&#233;moignent du passage d&#8217;un arbre &#224; un autre. Si nous voulons faire appara&#238;tre
ce lien manquant, nous devons donc simuler la d&#233;rivation qu&#8217;il induit forc&#233;ment. De quelles
informations disposons-nous ?
</p>
<p>&#8226; Nous connaissons le nombre d&#8217;arguments dans un arbre (n&#339;uds de substitution)
</p>
<p>&#8226; Nous connaissons quel argument doit &#234;tre transf&#233;r&#233; car il s&#8217;agit d&#8217;une information lexi-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Seddah, B. Gaiffe
</p>
<p>cale, le canevas de contr&#244;le, que nous marquons directement sur le n&#339;ud concern&#233;. Le
canevas de contr&#244;le associ&#233; au n&#339;ud N d&#8217;un arbre ancr&#233; par un verbe &#224; contr&#244;le trans-
f&#233;rant son i-eme argument vers le j-eme argument est not&#233; Ni&#8594;j .
Exemple : Jean interdit &#224; Marie de dormir Jean esp&#321;re dormir
canevas de contr&#244;le N1 &#8594; N0 N1 &#8594; N0
</p>
<p>&#8226; Nous savons qu&#8217;un arbre dont un n&#339;ud domine une position vide, un argument non
r&#233;alis&#233;, va recevoir un argument provenant de l&#8217;adjonction d&#8217;un arbre &#224; contr&#244;le via
l&#8217;op&#233;ration de fusion. Ce transfert d&#8217;argument marquera la cr&#233;ation effective du lien.
</p>
<p>Dans ce cas, si nous savons &#224; l&#8217;avance que ce lien va &#234;tre cr&#233;&#233;, nous pouvons d&#8217;ores et d&#233;ja
pr&#233;voir la position de ce lien dans le graphe de d&#233;rivation. C&#8217;est pourquoi nous cr&#233;ons une
nouvelle d&#233;rivation que nous appelons D&#233;rivation incompl&#232;te (marqu&#233;e par la variable libre
? dans la figure 7) et qui t&#233;moigne d&#8217;une substitution non r&#233;alis&#233;e sur le n&#339;ud N d&#8217;un arbre &#945;.
</p>
<p>?
</p>
<p>&#945;5
</p>
<p>&#945;1
</p>
<p>&#945;5
</p>
<p>adj
onc
</p>
<p>tion
</p>
<p>analyse syntaxique Graphe de d&#233;pendancea
apr&#233;s la cr&#233;ation du
lien manquant
</p>
<p>&#946;2&#946;2
adj
</p>
<p>onc
tion
</p>
<p>&#945;1 fusi
on
</p>
<p>su
bs
</p>
<p>tit
ut
</p>
<p>io
n
</p>
<p>su
bs
</p>
<p>tit
ut
</p>
<p>io
n
</p>
<p>Figure 7: Vision synth&#233;tique de l&#8217;op&#233;ration de fusion
</p>
<p>Avant de d&#233;finir formellement l&#8217;op&#233;ration de fusion sous la forme de r&#232;gles d&#8217;inf&#233;rence, la
section suivante va expliciter le processus d&#8217;extraction des items de d&#233;rivations.
</p>
<p>3 For&#338;t partag&#216;es et items de d&#216;rivations
Cette section pr&#233;sente l&#8217;extraction d&#8217;une for&#234;t de d&#233;rivation classique, c&#8217;est-&#224;-dire sans prise
en compte du processus de fusion. La for&#234;t partag&#233;e sur laquelle nous basons notre processus
r&#233;sulte de l&#8217;intersection d&#8217;une grammaire TAG et d&#8217;un automate d&#8217;entr&#233;e, (Vijay-Shanker &amp;
Weir, 1993) et (Billot &amp; Lang, 1989). La d&#233;finition donn&#233;e par (Vijay-Shanker &amp; Weir, 1993)
est &#233;tendue par (Seddah, 2004) afin de lier la reconnaissance du sous arbre domin&#233; par le n&#339;ud
site d&#8217;une adjonction au n&#339;ud pied de l&#8217;arbre auxiliaire qui s&#8217;adjoint. Ceci afin de permettre un
parcours synchrone de la for&#234;t partag&#233;e. Nous la repr&#233;sentons sous la forme d&#8217;une grammaire
hors-contexte augment&#233;e d&#8217;une pile born&#233;e contenant les adjonctions en cours. Chaque partie de
r&#232;gle correspond &#224; un item de type Cocke-Kasami-Younger de la forme &lt; N,POS, I, J, P ile &gt;
o&#249; N est un n&#339;ud d&#8217;un arbre, Pos indique si l&#8217;on se situe apr&#232;s une adjonction pr&#233;visible ou</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Des arbres de d&#233;rivation aux for&#234;ts de d&#233;pendance
</p>
<p>pas (marqu&#233;e &gt; si une adjonction sur le n&#339;ud est possible et &#8869; si elle ne l&#8217;est plus, symbolis&#233;e
par un point gras en position haute ou basse d&#8217;un n&#339;ud sur les sch&#233;mas), I et J sont les indices
de d&#233;but et de fin de la cha&#238;ne reconnue par le n&#339;ud N et Pile est la pile contenant les appels
des sous arbres ayant d&#233;marr&#233; une adjonction et qui doivent &#234;tre reconnus par la r&#232;gle de recon-
naissance du pied.
Le processus a lieu en deux temps : 1) La for&#234;t partag&#233;e est g&#233;n&#233;r&#233;e &#224; partir de la grammaire
TAG initiale et d&#8217;une cha&#238;ne d&#8217;entr&#233;e 2) la for&#234;t partag&#233;e est ensuite parcourue afin d&#8217;en extraire
les d&#233;rivations.
L&#8217;extraction est simple : si une r&#232;gle t&#233;moignant d&#8217;une d&#233;rivation est valid&#233;e, un item de d&#233;ri-
vation est inf&#233;r&#233;.
</p>
<p>3.1 Forme des items de d&#233;rivation
</p>
<p>A chaque occurrence d&#8217;une r&#232;gle de d&#233;rivation, nous produisons un item de d&#233;rivation en t&#233;-
moignant. Cet item que nous appelons Deriv est de la forme &lt; N, &#947;, &#945;, type &gt; avec N , le
n&#339;ud qui re&#231;oit la substitution ; &#947;, l&#8217;arbre de ce n&#339;ud, &#945; l&#8217;arbre qui va s&#8217;y substituer, type est
le type de d&#233;rivation.
Trois d&#233;rivations sont possibles :
</p>
<p>&#8226; une premi&#232;re &#233;vidente lors d&#8217;une substitution : on passe d&#8217;un n&#339;ud N d&#8217;un arbre &#947; &#224; un
n&#339;ud d&#8217;un arbre &#945; :
</p>
<p>Item de substitution : &lt; N,&#945;, &#947;, subst &gt;
</p>
<p>&#8226; lors d&#8217;une adjonction : on passe d&#8217;un n&#339;ud d&#8217;un arbre &#947; au n&#339;ud racine d&#8217;un arbre &#946;.
Nous ne consid&#233;rons pas comme une d&#233;rivation le passage du n&#339;ud pied de l&#8217;arbre &#946;
au sous arbre du n&#339;ud site de l&#8217;adjonction de l&#8217;arbre &#945;. Cette information est de fait
&#233;videmment redondante : une adjonction &#233;tant une insertion, il doit y avoir retour et
analyse de l&#8217;arbre appelant.
</p>
<p>Item d&#8217;adjonction : &lt; N, &#946;, &#947;, adj &gt;
</p>
<p>&#8226; lors de la reconnaissance d&#8217;un arbre initial &#945; ayant port&#233;e sur toute la cha&#238;ne, on cr&#233;e une
d&#233;rivation de type &#8220;t&#234;te&#8221;.
</p>
<p>Item axiomes : &lt; N,&#945;,&#8722;,&#8722; &gt;
</p>
<p>3.2 R&#232;gles d&#8217;inf&#233;rence de l&#8217;algorithme d&#8217;extraction du graphe de d&#233;riva-
tion
</p>
<p>Pour toute r&#232;gle r &#8712; R se situant sur le chemin succ&#232;s, nous appliquons les r&#232;gles d&#8217;inf&#233;rence
suivantes :
</p>
<p>&#8226; D&#233;rivation de l&#8217;axiome
Si la r&#232;gle r = S &#8722;&#8594; &lt; &gt;, N&#945;, 0, n,&#8722;,&#8722;, &#8709; &gt; est valid&#233;e lors de l&#8217;ex&#233;cution de la grammaire,
alors nous produisons l&#8217;item &lt; N, &#945;,&#8722;,&#8722; &gt;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Seddah, B. Gaiffe
</p>
<p>S &#8722;&#8594; &lt; &gt;, N&#945;, 0, n,&#8722;,&#8722;, &#8709; &gt;
Reconnaissance d&#8217;un axiome
</p>
<p>S &#8722;&#8594; &lt; &gt;, N&#945;, 0, n,&#8722;,&#8722;, &#8709; &gt;
&lt; N, &#945;,&#8722;,&#8722; &gt;
</p>
<p>avec n=longueur de la chaine
</p>
<p>S
</p>
<p>n
&#945;
</p>
<p>&#8226; D&#233;rivation d&#8217;une substitution
Si la r&#232;gle r = &lt; &#8869;, n&#947; , i, j,&#8722;,&#8722;, P ile &gt; &#8722;&#8594; &lt; &gt;, n&#945;, i, j,&#8722;,&#8722;, P ile &gt; est valid&#233;e
alors nous produisons l&#8217;item &lt; N,&#945;, &#947;, subst &gt;.
&lt; &#8869;, n&#947; , i, j,&#8722;,&#8722;, P ile &gt; &#8722;&#8594; &lt; &gt;, n&#945;, i, j,&#8722;,&#8722;, P ile &gt;
</p>
<p>Reconnaissance d&#8217;une substitution
</p>
<p>&lt; &#8869;, n&#947; , i, j,&#8722;,&#8722;, P ile &gt; &#8722;&#8594; &lt; &gt;, n&#945;, i, j,&#8722;,&#8722;, P ile &gt;
</p>
<p>&lt; N, &#945;, &#947;, subst &gt;
</p>
<p>&#947;
</p>
<p>&#945;
</p>
<p>n
</p>
<p>ji
</p>
<p>n
</p>
<p>&#8226; D&#233;rivation d&#8217;une adjonction
Si la r&#232;gle r = &lt; &gt;, n&#947; , i, j, p, q, P ile &gt; &#8722;&#8594; &lt; &gt;, n&#946;, i, j, p, q, P ile&#8242; &gt; est valid&#233;e
alors nous produisons l&#8217;item &lt; N, &#946;, &#947;, adj &gt; .
&lt; &gt;, n&#947; , i, j, p, q, P ile &gt; &#8722;&#8594; &lt; &gt;, n&#946;, i, j, p, q, P ile
</p>
<p>&#8242; &gt;
</p>
<p>Reconnaissance d&#8217;une adjonction
</p>
<p>&lt; &gt;, n&#947; , i, j, p, q, P ile &gt; &#8722;&#8594; &lt; &gt;, n&#946;, i, j, p, q, P ile
&#8242; &gt;
</p>
<p>&lt; N, &#946;, &#947;, adj &gt;
</p>
<p>&#946;
</p>
<p>&#947;
</p>
<p>1 : Call Adj
X
</p>
<p> X*
</p>
<p>X
</p>
<p>p q
</p>
<p>Les variables Pile et Pile&#8242; repr&#233;sentent l&#8217;&#233;tat de la pile d&#8217;appel des adjonctions lors de l&#8217;ex&#233;cution
d&#8217;une for&#234;t produite. Leurs valeurs n&#8217;est pas prise en compte par cette r&#232;gle d&#8217;inf&#233;rence, car
l&#8217;appel d&#8217;une adjonction est une op&#233;ration hors contexte. Quelque soit le contenu de ces 2 vari-
ables, la d&#233;rivation sera celle t&#233;moignant de l&#8217;adjonction de l&#8217;arbre &#946; sur le n&#339;ud X de l&#8217;arbre
&#947;.
</p>
<p>3.3 item de d&#233;rivation pour la d&#233;rivation incompl&#232;te
</p>
<p>Nous avons d&#233;crit (section 2.1) un n&#339;ud dominant une position vide comme t&#233;moignant d&#8217;une
substitution non r&#233;alis&#233;e et, par cons&#233;quent t&#233;moin d&#8217;une d&#233;rivation incompl&#232;te. La r&#232;gle
d&#8217;inf&#233;rence suivante d&#233;finit cette nouvelle d&#233;rivation :
</p>
<p>&#8226; Si la r&#232;gle &lt; &#8869;, N&#947; , i, j,&#8722;,&#8722;, P ile &gt; &#8722;&#8594; vrai est valid&#233;e alors on produit la d&#233;riva-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Des arbres de d&#233;rivation aux for&#234;ts de d&#233;pendance
</p>
<p>tion suivante :
</p>
<p>&lt; &#8869;, N&#947;, i, j,&#8722;,&#8722;, P ile &gt; &#8722;&#8594; vrai
D&#233;rivation d&#8217;une substitution non-r&#233;alis&#233;e
</p>
<p>&lt; &#8869;, N&#947; , i, j,&#8722;,&#8722;, P ile &gt;
</p>
<p>&lt; N,&#945;,X, subst &gt;
avec X , non instanci&#233; X=?
</p>
<p>i j
</p>
<p>&#947;
</p>
<p>n
</p>
<p>L&#8217;ensemble des items de d&#233;rivation est g&#233;n&#233;r&#233; dans un chart sp&#233;cifique et correspond &#224; l&#8217;ensemble
des analyses possibles. Partant d&#8217;un item axiome, nous d&#233;crivons tr&#232;s exactement un arbre de
d&#233;rivation. Si la grammaire suit les recommandations de (Rambow &amp; Joshi, 1994), cet arbre
peut &#234;tre vu comme un arbre de d&#233;pendance, ainsi l&#8217;ensemble des arbres d&#233;crits par cette for&#234;t
d&#8217;items est dans ce cas une for&#234;t de d&#233;pendance.
</p>
<p>4 Formalisation du processus de fusion argumentale
</p>
<p>L&#8217;analyse de l&#8217;adjonction d&#8217;un arbre &#224; contr&#244;le sur un arbre &#233;l&#233;mentaire met en jeu 3 d&#233;ri-
vations : la d&#233;rivation D1 t&#233;moignant de la substitution d&#8217;un arbre &#945;1 sur le n&#339;ud N ,dont
le canevas de contr&#244;le est Ni&#8594;j , d&#8217;un arbre &#224; contr&#244;le &#946;2 ; la d&#233;rivation D3 t&#233;moignant de
l&#8217;adjonction de l&#8217;arbre &#224; contr&#244;le &#946;2 sur la racine d&#8217;un arbre &#233;l&#233;mentaire &#947;10 et la d&#233;rivation
incompl&#232;te D2 t&#233;moignant de la pr&#233;sence d&#8217;un n&#339;ud Nj de substitution non r&#233;alis&#233;e sur l&#8217;arbre
&#947;. L&#8217;op&#233;ration de fusion est donc la r&#232;gle d&#8217;inf&#233;rence permettant de simuler la cr&#233;ation du lien
manquant via un nouvel item de d&#233;rivation D4 qui remplace l&#8217;item de d&#233;rivation incompl&#232;te
D3.
</p>
<p>D3 :&lt; X, &#946;2, &#947;, adj &gt; D1 :&lt; Ni&#8594;j , &#945;1, &#946;2, subst &gt; D2 :&lt; Nj , ? , &#947;, subst &gt;
D4 :&lt; Nj , &#945;1, &#947;, subst &gt;
</p>
<p>5 Conclusion
</p>
<p>Ce travail a &#233;t&#233; impl&#233;ment&#233; dans (Seddah, 2004). Sa caract&#233;ristique principale est de faire un
usage intensif des propri&#233;t&#233;s des for&#234;ts partag&#233;es afin de parcourir simultan&#233;ment les n&#339;uds
de l&#8217;arbre d&#233;riv&#233; et de l&#8217;arbre de d&#233;rivation. Les n&#339;uds qui sont utilis&#233;s lors de l&#8217;op&#233;ration de
fusion proviennent de l&#8217;arbre de d&#233;rivation pour les d&#233;rivations compl&#232;tes et de l&#8217;arbre d&#233;riv&#233;
pour la d&#233;rivation incompl&#232;te. Si l&#8217;on consid&#232;re que chaque item de d&#233;rivation correspond &#224;
un argument s&#233;mantique, le graphe de d&#233;rivation correspond &#224; un graphe s&#233;mantique similaire
au DSyntS de la th&#233;orie sens-texte (Mel&#8217;Cuk, 1997). Une extension du mod&#232;le pour traiter des
ph&#233;nom&#232;nes li&#233;s aux coordinations elliptiques est actuellement en cours d&#8217;&#233;laboration. Pour
b&#226;tir ce mod&#232;le nous avons d&#251; modifier l&#233;g&#232;rement le formalisme TAG pour inclure une in-
formation lexicale n&#233;cessaire aux r&#232;gles d&#8217;inf&#233;rence. La m&#233;thodologie consistant &#224; travailler
</p>
<p>10L&#8217;arbre &#233;l&#233;mentaire &#947; g&#233;n&#233;ralise le cas pr&#233;sent&#233; figure 7 o&#249; la fusion op&#233;rait sur l&#8217;arbre initial &#945;5.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Seddah, B. Gaiffe
</p>
<p>syst&#233;matiquement au coeur de la for&#234;t partag&#233;e nous permet de travailler sur toutes les analyses
&#224; la fois et donc de g&#233;n&#233;rer tous les graphes de d&#233;pendance au sein d&#8217;une for&#234;t compacte.
</p>
<p>References
</p>
<p>ABEILL&#201; A. (1991). Une grammaire lexicalis&#216;e d&#8217;arbres adjoints pour le fran&#231;ais. PhD
thesis, Paris 7.
</p>
<p>ABEILL&#201; A. (1999). Verbes &quot;&#224; mont&#233;&quot; et auxiliaires dans une grammaire d&#8217;arbres adjoints.
LINX,Linguistique Institut Nanterre Paris X.
</p>
<p>BILLOT S. &amp; LANG B. (1989). The structure of shared forests in ambigous parsing. In 33rd
Conference of the Association for Computional Linguistics (ACL&#8217;89).
CANDITO M.-H. &amp; KAHANE S. (1998). Can the TAG derivation tree represent a semantic
graph ? In Proceedings TAG+4, Philadelphie, p. 21&#8211;24.
</p>
<p>FRANCK A. &amp; VAN GENABITH J. (2001). Gluetag : Linear logic based semantics for LTAG
-and what it teaches us about LFG and LTAG-. In Proceddings of the LFG01 Conference,
University of Hong Kong, Hong Kong.
GARDENT C. &amp; KALLMEYER L. (2003). Semantic construction in feature-based tag. In
Procedings of EACL 2003.
KALLMEYER L. (2004). LTAG Semantics with Semantic Unification. In Proceedings of
TAG+7, To appears.
</p>
<p>KALLMEYER L. &amp; JOSHI A. (1999). Factoring predicate argument and scope semantics:
Underspecified semantics with LTAG. In Proceedings of the 12th Amsterdam Colloquium,
December.
</p>
<p>MEL&#8217;CUK I. (1997). Vers une linguistique Sens-Texte. Le&#231;on inaugurale. College de France,
Paris.
</p>
<p>RAMBOW O. &amp; JOSHI A. K. (1994). A Formal Look at Dependency Grammar and Phrase
Structure Grammars, with Special consideration of Word Order Phenomena. Leo Wanner,
Pinter London, 94.
</p>
<p>SCHABES Y. &amp; SHIEBER S. (1994). An alternative conception of tree-adjoining derivation.
Computational Linguistics, 20(1), 91&#8211;124.
</p>
<p>SEDDAH D. (2004). Synchronisation des connaissances syntaxiques et s&#216;mantiques pour
l&#8217;analyse d&#8217;&#216;nonc&#216;s en langage naturel &#224; l&#8217;aide des grammaires d&#8217;arbres adjoints lexicalis&#216;es.
PhD thesis, Universit&#233; Henry Poincar&#233;, Nancy.
</p>
<p>VIJAY-SHANKER K. &amp; WEIR D. (1993). The use of shared forests in tree adjoining grammar
parsing. In EACL &#8217;93, p. 384&#8211;393.
</p>
<p>WEIR D. (1988). Characterizing Midly Context-Sensitive Grammar Formalisms. PhD thesis,
University of Pennsylvania.</p>

</div></div>
</body></html>