<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me de g&#233;n&#233;ration automatique de dictionnaires linguistiques de l'arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
 
</p>
<p>Un syst&#232;me de g&#233;n&#233;ration automatique de dictionnaires 
linguistiques de l&#8217;arabe 
</p>
<p>Ahmed HADDAD (1), Mounir ZRIGUI (2), Mohamed Ben AHMED (3) 
</p>
<p> (1) Laboratoire RIADI (unit&#233; de Monastir), Facult&#233; des Sciences de Monastir  
</p>
<p>ahmed.haddad@ensi.rnu.tn 
</p>
<p>(2)  Laboratoire RIADI (unit&#233; de Monastir), Facult&#233; des Sciences de Monastir  
</p>
<p>mounir.zrigui@fsm.rnu.tn  
</p>
<p>(3) Laboratoire RIADI, Ecole Nationale des Sciences Informatiques 
</p>
<p>mohamed.benahmed@riadi.rnu.tn   
</p>
<p>Mots-cl&#233;s : dictionnaires &#233;lectroniques, Conditions de Structures Morph&#233;matiques, 
matrices lexicales, Restrictions combinatoires, Restrictions s&#233;quentielles.  
</p>
<p>Keywords: electronic dictionaries, Conditions of Morphemic Structures  , lexical matrix, 
Combinative circumscriptions, Sequential  circumscriptions.  
</p>
<p>R&#233;sum&#233; L&#8217;objectif de cet article est la pr&#233;sentation d&#8217;un syst&#232;me de g&#233;n&#233;ration 
automatique de dictionnaires &#233;lectroniques de la langue arabe classique, d&#233;velopp&#233; au sein du 
laboratoire RIADI (unit&#233; de Monastir). Ce syst&#232;me entre dans le cadre du projet &#8220;oreillodule&#8221;: 
un syst&#232;me embarqu&#233; de synth&#232;se, traduction et reconnaissance de la parole arabe. 
</p>
<p> Dans cet article, nous pr&#233;senterons, les diff&#233;rentes &#233;tapes de r&#233;alisation, et 
notamment la g&#233;n&#233;ration automatique de ces dictionnaires se basant sur une th&#233;orie originale : 
les Conditions de Structures Morph&#233;matiques (CSM), et les matrices lexicales. 
</p>
<p>Abstract the objective of this article is the presentation of a system of automatic 
generation of electronic dictionaries of the classic Arabian language, developed within RIADI 
laboratory (unit of Monastir). This system enters in the setting of project &quot;oreillodule&quot;: an 
embedded system of synthesis, translation and recognition of the Arabian word. 
</p>
<p> In this article, we will present the different stages of realization, and notably the automatic 
generation of these dictionaries basing on an original theory: Conditions of Morphemic 
Structure (CSM), and the lexical matrixes. 
</p>
<p>1 Introduction 
Plusieurs linguistes ont pouss&#233; l&#8217;id&#233;e de g&#233;n&#233;ration de lexique &#224; partir des conditions de 
</p>
<p>structures morph&#233;matiques(CSM), comme Cantinau et Greenberg (HABAILI, 1976). Cette 
id&#233;e est &#224; la base de ce travail o&#249; nous pr&#233;senterons un syst&#232;me de g&#233;n&#233;ration automatique des 
dictionnaires arabes, en se basant sur les CSM et les matrices lexicales (ML), leurs structures 
et leurs modes d&#8217;acc&#232;s (ZAAFRANI, 2004) (SILBERZTEIN, 1993). Nous focalisons sur le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>                                                    Ahmed HADDAD, Mounir ZRIGUI, Mohamed BEN AHMED 
</p>
<p>dictionnaire des racines admissibles et attest&#233;es. Nous appliquerons des proc&#233;dures autant que 
possible automatis&#233;es, pour engendrer un maximum d'entr&#233;es et d'informations et &#233;liminer les 
bruits : l&#8217;intervention manuelle des sp&#233;cialistes de la langue s&#8217;av&#232;re n&#233;cessaire dans certains 
cas bien d&#233;termin&#233;s et limit&#233;s pour &#233;liminer ces derniers.  
</p>
<p>2   Base th&#233;orique : 
</p>
<p>2.1  Les conditions de structures morph&#233;matiques (CSM) 
</p>
<p>Les phon&#232;mes de l&#8217;arabe sont li&#233;s &#224; des restrictions combinatoires et des restrictions 
s&#233;quentielles tr&#232;s strictes qui sont &#233;nonc&#233;es sous la forme de CSM. Ces conditions sont des 
r&#232;gles qui r&#233;gissent la g&#233;n&#233;ration des mots dans la langue arabe : un mot qui enfreint une 
condition ne peut pas appartenir &#224; l&#8217;arabe (HABAILI, 1976).  
</p>
<p>  Cadre th&#233;orique: 
Soit x l&#8217;ensemble des traits possibles d&#233;finis par la th&#233;orie linguistique. 
</p>
<p>Soit C l&#8217;ensemble des 28 consonnes de la langue arabe. Soit C1C2C3 une racine trilit&#232;re, 
avec C1, C2 et C3 &#1028; C. Soit MP[j] [k] la matrice phonologique (avec 1 &#8804; j &#8804; 14 et 1&#8804; k &#8804; 28) 
cette matrice repr&#233;sente l'ensemble des traits des consonnes de l'arabe. Soit V  l&#8217;ensemble des 
6 voyelles de la langue arabe. Soit C1V1C2V2C3V3 une racine trilit&#232;re voyell&#233;e, avec V1, V2  et 
V3 &#1028; V.  Soit MPv[j][k] la matrice phonologique des voyelles (avec 1 &#8804; j &#8804; 14 : l'ensemble 
des traits des voyelles de l&#8217;arabe et 1&#8804; k &#8804; 6 ) 
</p>
<p>Les linguistes d&#233;nombrent cinq CSM qui r&#233;gissent la formation des mots arabes. Ces 
conditions sont class&#233;es en deux types: les restrictions combinatoires et les restrictions 
s&#233;quentielles. 
</p>
<p> 2.1.1  Restrictions combinatoires :   
</p>
<p>Ces restrictions r&#233;gissent les sp&#233;cifications des traits correspondant aux phon&#232;mes de la 
langue arabes. Dans ce cas trois r&#232;gles sont &#224; &#233;noncer : 
</p>
<p>1) CSM1 : tous les phon&#232;mes sont [-aspir&#233;s] 
</p>
<p>Tout phon&#232;me de l'arabe est une colonne de x sp&#233;cifications correspondant &#224; ces x traits, les 
(x-quatorze) sp&#233;cifications qui ne sont pas repr&#233;sent&#233;es d&#233;coulent automatiquement des 
quatorze pr&#233;sentes en vertu de conditions propres &#224; l&#8217;arabe classique. La condition CSM1 
distingue l&#8217;arabe classique de nombreuses langues naturelles qui opposent phon&#232;mes aspir&#233;s 
et non aspir&#233;s. C&#8217;est l&#8217;existence de telles restrictions valables pour tous les phon&#232;mes de 
l&#8217;arabe classique, qui a permis de ne faire figurer que quatorze  traits (HABAILI, 1976), 
parmi x traits possibles d&#233;finis par la th&#233;orie linguistique.  
</p>
<p>Si  ci   &#1028; C et  ci    C&#8834; 1C2C3 (avec 1&#8804; i &#8804; 28)  alors MP[aspir&#233;][i] = [0] . (1)
</p>
<p>2) CSM2 : tous les phon&#232;mes vocaliques sont [-nasal] 
La condition CSM2 exclut les voyelles nasales de l&#8217;inventaire des phon&#232;mes de l&#8217;arabe 
</p>
<p>classique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de g&#233;n&#233;ration automatique de dictionnaires linguistiques de l&#8217;arabe 
</p>
<p> 
</p>
<p>Si   vi   &#1028; V et  vi    C&#8834; 1V1C2V2C3V3 (avec 1&#8804; i &#8804; 6)  alors   MPv[nasale][ i ] = [0] . (2)
</p>
<p>3) CSM3 : tous les phon&#232;mes qui sont [+consonantiques] sont aussi [-syllabiques] 
La condition CSM3 exclut les consonnes [+syllabiques]. Cette r&#232;gle est formul&#233;e de la 
</p>
<p>mani&#232;re suivante: 
                          Si  MP[consonante][ i ] = [-] alors MP[syllabique][ k ] = [0] . (3)
Outre les restrictions combinatoires entre les valeurs des traits appartenant &#224; un m&#234;me 
</p>
<p>segment, il existe aussi des restrictions s&#233;quentielles.    
</p>
<p>2.1.2  Restrictions s&#233;quentielles 
</p>
<p>Ce sont des restrictions qui lient les sp&#233;cifications de traits appartenant &#224; des segments 
successifs de la matrice de l&#8217;arabe classique, ces restrictions refl&#232;tent le fait que n&#8217;importe 
quelle s&#233;quence de phon&#232;mes de l&#8217;arabe n&#8217;est pas un morph&#232;me-racine ou un allomorphe 
possible (variante combinatoire d&#8217;un phon&#232;me). Par exemple &#1617;&#1583;&#1605;  et &#1576;&#1580;&#1570; sont des s&#233;quences de 
consonnes permises par la structure de la langue, mais pas &#8221; &#1584;&#1582;&#1582;&#8220;   (SAIDANE, 2004). 
</p>
<p>Le fait qu&#8217;il n&#8217;existe aucun morph&#232;me-racine dont la repr&#233;sentation phonologique soit 
&#8220;&#1576;&#1580;&#1570;&#8221; n&#8217;est la s&#233;quence d&#8217;aucune contrainte structurelle, il s&#8217;agit seulement d&#8217;une lacune 
accidentelle : Il s&#8217;agit d&#8217;une combinaison admissible par la structure de la langue, mais qui est 
absente du lexique.  En revanche, des s&#233;quences telles que &quot;&#1583;&#1582;&#1582;&quot; ou &quot;&#1584;&#1576;&#1584;&quot; ne sont pas des 
morph&#232;mes-racines possibles en arabe classique. La premi&#232;re enfreint la restriction qui est 
exprim&#233;e par la condition CSM4 et la seconde celle qui est exprim&#233;e par CSM5 : 
</p>
<p>CSM4 : La condition CSM4 exclut de l&#8217;ensemble des morph&#232;mes-racines possibles en arabe 
classique toute s&#233;quence de phon&#232;mes form&#233;e de deux segments identiques, en premi&#232;re et en 
deuxi&#232;me consonne radicale.  
 
</p>
<p>Si     c,d   &#1028; C et  c,d   {C&#8834; 1C2C3} (tel que c = C1 et d = C2 ) alors (c &#8800;d). (4)
CSM5 : La condition CSM5 interdit des consonnes identiques qui sont [+continu, +vois&#233;] en 
premi&#232;re et troisi&#232;me consonnes radicales. 
 
</p>
<p>Si [(MP[continu][ i ] = [+], MP[vois&#233;][ i ] = [+] ) et (MP[continu ][ l ] = [+],  
MP[vois&#233;][ l ] =  [+] )   alors   ci,dl   C&#8834; 1C2C3 . (5)
</p>
<p> 
Puisque les CSM n&#8217;op&#232;rent que sur chaque allomorphe pris isol&#233;ment, elles ne rendent 
</p>
<p>compte que des contraintes &#224; l&#8217;int&#233;rieur d&#8217;un m&#234;me morph&#232;me. D&#8217;o&#249;, le processus de 
g&#233;n&#233;ration des verbes n&#233;cessite l'utilisation d'autres outils, qui sont  les matrices lexicales 
(MOUSSA, 1973).     
</p>
<p>2.2 Matrices Lexicales  
</p>
<p>2.2.1  Matrices Lexicales Trilit&#232;res (MLT) 
Ce sont des matrices bidimensionnelles qui repr&#233;sentent la position des consonnes dans une 
</p>
<p>racine trilit&#232;re, ces matrices sont extraites de la r&#233;f&#233;rence &quot;&#1587;&#1608;&#1585;&#1593;&#1604;&#1575; &#1580;&#1575;&#1578; &quot;, avec quelques </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>                                                    Ahmed HADDAD, Mounir ZRIGUI, Mohamed BEN AHMED 
</p>
<p>transformations afin de l&#8217;utiliser dans ce travail (HADDAD, 2004). Aux 28 consonnes de la 
langue arabe correspondent 28 MLT. Les 28 matrices sont issues d&#8217;une statistique &#233;labor&#233;e 
par  Amr Helmi MOUSSA sur le dictionnaire  &#1587;&#1608;&#1585;&#1593;&#1604;&#1575; &#1580;&#1575;&#1578;, en transformant les racines trilit&#232;res 
du dictionnaire en des matrices d&#233;crivant les racines attest&#233;es par ce dictionnaire. 
</p>
<p> Ce sont des matrices binaires Mi, avec 1&#8804; i &#8804; n (n = 28 : nombre des consonnes).  
Mi [j][k] exprime les raines CiCjCk (avec i,j et k &#1028; [1..28])(exemple &#1576;&#1578;&#1570;  KTB), tel que : 
Mi[][]  indique la lettre qui est en premi&#232;re position dans la racine CiCjCk (&#1603;) K 
Mi[j][] indique la lettre qui est en deuxi&#232;me position dans la racine CiCjCk  (&#1578;) T 
Mi[][k] indique la lettre qui est en troisi&#232;me position dans la racine CiCjCk (&#1576;) B 
</p>
<p>Nous distinguons les cas suivants : 
&#8226; Si Mi [j][k]= 1 alors la racine CiCjCk est une racine attest&#233;e par le dictionnaire  &#1580;&#1575;&#1578;
</p>
<p>&#1587;&#1608;&#1585;&#1593;&#1604;&#1575; (exemple &#1576;&#1578;&#1570;) 
&#8226; Sinon (Mi [j][k]= 0) alors la racine CiCjCk n&#8217;est pas attest&#233;e par le dictionnaire &#8220;   &#1580;&#1575;&#1578;      
</p>
<p>&#1587;&#1608;&#1585;&#1593;&#1604;&#1575; &#8221;.(exemple &#1584;&#1590;&#1591;). 
Nous pouvons sch&#233;matiser comme suit cette repr&#233;sentation: 
 Mi [j][k] Ci = &#1603; 1               &#1578;  Ck                     28 
</p>
<p>    1 
</p>
<p>&#1576;  Cj 000000000010000000000000 
   28  
</p>
<p>                                             Figure 1 : Repr&#233;sentation de la matrice lexicale 
</p>
<p>2.2.2 Matrices Lexicales Quadrilit&#232;res (MLQ) 
 
</p>
<p>Les matrices lexicales quadrilit&#232;res sont des matrices bidimensionnelles qui repr&#233;sentent la 
position des consonnes dans une racine quadrilit&#232;re. En s'inspirant de &quot;&#1587;&#1608;&#1585;&#1593;&#1604;&#1575; &#1580;&#1575;&#1578; &quot;, et du 
&quot;&#1577;&#1617;&#1610;&#1576;&#1585;&#1593;&#1604;&#1575; &#1604;&#1575;&#1593;&#1601;&#1604;&#1571;&#1575; &#1601;&#1610;&#1585;&#1589;&#1578; &#1610;&#1601; &#1604;&#1605;&#1575;&#1588;&#1604;&#1575; &quot;, nous avons pu &#233;tablir 28 matrices comme suit : 
</p>
<p>Soit Mi une matrice, avec 1&#8804; i &#8804;28. Soit Q une repr&#233;sentation d&#8217;une racine quadrilit&#232;re 
quelconque attest&#233;e par la langue arabe, soit C1C2C3 une repr&#233;sentation d&#8217;une racine trilit&#232;re 
attest&#233;e et qui a donn&#233;e la racine quadrilit&#232;re Q, avec C1, C2  et C3 &#1028; C. Mi [j][k] exprime les 
racines CiCjCk (avec i, j et k &#1028; [1..28]) 
</p>
<p>Ces matrices bidimensionnelles sont  formul&#233;es de la mani&#232;re suivante : 
&#8226; Si Mi [j][k]= 1 alors la racine CiCjCk est une racine attest&#233;e et Q est la racine 
</p>
<p>quadrilit&#232;re g&#233;n&#233;r&#233;e de CiCjCk par d&#233;rivation avec le sch&#232;me &quot;&#1604;&#1593;&#1575;&#1601;&quot;, comme &quot;&#1576;&#1578;&#1575;&#1570;&quot;. 
&#8226; Si Mi [j][k]= 2 alors la racine CiCjCk est une racine attest&#233;e et Q est la racine 
</p>
<p>quadrilit&#232;re g&#233;n&#233;r&#233;e de CiCjCk par d&#233;rivation avec le sch&#232;me &quot;&#1604;&#1617;&#1593;&#1601;&quot;, comme &quot;&#1583;&#1617;&#1593;&#1576;&quot;. 
&#8226; Si Mi [j][k]= 3 alors la racine CiCjCk est une racine attest&#233;e et Q est la racine 
</p>
<p>quadrilit&#232;re g&#233;n&#233;r&#233;e de CiCjCk par d&#233;rivation avec le sch&#232;me &quot;&#1604;&#1593;&#1601;&#1571;&quot;  , comme &quot; &#1583;&#1593;&#1576;&#1571;&quot;. 
&#8226; Si Mi [j][k]= 4 alors la racine CiCjCk est une racine attest&#233;e et Q est la racine 
</p>
<p>quadrilit&#232;re g&#233;n&#233;r&#233;e de CiCjCk par d&#233;rivation avec le sch&#232;me &quot;&#1604;&#1604;&#1593;&#1601;&quot;  , comme 
&quot;&#1604;&#1586;&#1604;&#1586;&quot;. 
</p>
<p>&#8226; Si Mi [j][k]= x, avec x &#1028; [ &#1583; &#1580; &#1576; &#1571;...&#1610; &#1608; &#1607; ] , alors  Q =  CiCjCk x , comme &quot;&#1604;&#1602;&#1608;&#1581;&quot;. 
&#8226; Sinon (Mi [j][k]= 0) alors la racine CiCjCk n&#8217;est pas attest&#233;e par le dictionnaire &quot; &quot; 
</p>
<p>&#1587;&#1608;&#1585;&#1593;&#1604;&#1575; &#1580;&#1575;&#1578;. 
 
 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de g&#233;n&#233;ration automatique de dictionnaires linguistiques de l&#8217;arabe 
</p>
<p> 
Mi [j][k]         Ci = &#1603;  1                &#1578; Ck       28 
                                 1  
</p>
<p>   &#1576;                          Cj             010231&#1587; &#1604; 240 
                                28 
</p>
<p>               Figure 2 : Repr&#233;sentation de la matrice lexicale quadrilit&#232;re 
</p>
<p>3.  Description du syst&#232;me r&#233;alis&#233; : 
</p>
<p>3.1. Les dictionnaires : 
Le syst&#232;me d&#233;velopp&#233; est compos&#233; de deux fonctions qui sont : 
</p>
<p>1. la g&#233;n&#233;ration des dictionnaires, 
2. la consultation des dictionnaires. 
</p>
<p>3.1.1. La g&#233;n&#233;ration automatique de cinq dictionnaires de racines trilit&#232;res et quadrilit&#232;res 
arabes : 
</p>
<p>&#8226; Le premier dictionnaire est th&#233;orique (21952 racines = (28)^3).  Il contient toutes 
les racines trilit&#232;res th&#233;oriquement possibles del&#8217;arabe standard. 
</p>
<p>&#8226; Le deuxi&#232;me dictionnaire(20415 racines) : c&#8217;est le dictionnaire des racines trilit&#232;res 
admissibles. C'est-&#224;-dire les racines qui n&#8217;enfreignent aucune des  (CSM). 
</p>
<p>&#8226; Le troisi&#232;me dictionnaire (7836): c&#8217;est le dictionnaire des racines trilit&#232;res attest&#233;es ; 
c'est-&#224;-dire utilis&#233;es dans la langue arabe et qui sont tir&#233;es des tableaux de 
r&#233;partitions construits &#224; partir du grand dictionnaire arabe &#1610;&#1585;&#1607;&#1608;&#1580;&#1604;&#1575; &#1606;&#1576;&#1604;&#1573; &#1581;&#1575;&#1581;&#1589;&#1604;&#1575;( ). 
</p>
<p>&#8226; Le Quatri&#232;me dictionnaire (13023 racines): c&#8217;est le dictionnaire des racines 
admissibles par la langue arabe mais non attest&#233;es. Ces racines peuvent &#234;tre utilis&#233;es 
pour enrichir la langue arabe par d&#8217;autres mots nouveaux. 
</p>
<p>&#8226; Le cinqui&#232;me dictionnaire (4000 racines) : c&#8217;est le dictionnaire des racines 
quadrilit&#232;res attest&#233;es ;  qui sont tir&#233;es des matrices lexicales quadrilit&#233;res.  
</p>
<p>Le sch&#233;ma suivant illustre le diagramme de donn&#233;es relatif &#224; la g&#233;n&#233;ration automatique des 
diff&#233;rents dictionnaires : 
</p>
<p>Liste des 
consonnes 
</p>
<p> 
</p>
<p>Racine 
courante
</p>
<p>dictionnaire 
</p>
<p>Racine admissible CSM 
</p>
<p>MLT 
</p>
<p>Racine 
attest&#233;e 
</p>
<p>Racine non 
attest&#233;e
</p>
<p>dictionnaire 
</p>
<p>Trois consonnes Racine courante Racine accept&#233;e 
</p>
<p>  construire 
</p>
<p>Verbe Arabe 
</p>
<p>Dictionnaire 
quadrilit&#232;re 
</p>
<p>MLQ 
</p>
<p> 
 
</p>
<p>Figure 3 : Diagramme de g&#233;n&#233;ration des diff&#233;rents dictionnaires  arabes 
Certaines racines trilit&#232;res attest&#233;es n&#8217;ob&#233;issent pas &#224; une ou plusieurs CSM : nous avons 
</p>
<p>cr&#233;&#233; un sixi&#232;me dictionnaire ( 203 racines) qui regroupe ces racines, avec pour chacune, 
l&#8217;affichage de la CSM qui n&#8217;est pas v&#233;rifi&#233;e. Exemple : la racine (&#1576;&#1576;&#1576;) est attest&#233;e mais ne 
v&#233;rifie pas la condition CSM4.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>                                                    Ahmed HADDAD, Mounir ZRIGUI, Mohamed BEN AHMED 
</p>
<p>3.1.2. La consultation de ces dictionnaires dans le but, de la recherche d&#8217;une racine, 
ou l&#8217;affichage d&#8217;une liste de racines d&#8217;un dictionnaire bien d&#233;termin&#233;, ou sa mise &#224; jour.  
</p>
<p>3.2 Structure interne des donn&#233;es du dictionnaire &#233;lectronique : 
</p>
<p>Pour r&#233;aliser le dictionnaire capital, nous avons adopt&#233; la structure de listes cha&#238;n&#233;es. Cette 
structure permet un acc&#232;s simple et une recherche facile des informations. La figure suivante 
d&#233;crit cette repr&#233;sentation interne ainsi que les diff&#233;rents niveaux des donn&#233;es : 
</p>
<p> 
</p>
<p> 
</p>
<p>Zone3 
</p>
<p>Code de d&#233;rivation 
</p>
<p>Zone5 
</p>
<p>45&#1578; 
</p>
<p>G&#233;n&#233;ration des racines 
</p>
<p>T  tableau contenant les racines 
</p>
<p>                                &#1571;&#1604;&#1570;
</p>
<p>                                &#1604;&#1614;&#1570;&#1571; 
</p>
<p>Information 
fl i ll
</p>
<p>Code morpho-syntaxique 
</p>
<p>Code de d&#233;rivation 
</p>
<p>Code de conjugaison 
</p>
<p>D&#233;rivation nominale 
</p>
<p>D&#233;rivation verbale 
</p>
<p>&#1601;2  
</p>
<p>&#1589;1
</p>
<p>&#1593;1&#1584;     1 
</p>
<p>&#1604;&#1608;&#1570;&#1571; 
</p>
<p>&#1605;2 
</p>
<p>Zone1
</p>
<p>Zone2
</p>
<p>Zone6 
</p>
<p>Zone4 
</p>
<p>Zone7
</p>
<p>Zone8
</p>
<p> 
Figure 4 : Structure interne des donn&#233;es 
</p>
<p>Conclusion 
 
</p>
<p>La g&#233;n&#233;ration automatique du dictionnaire des racines trilit&#232;res et quadrilit&#232;res en utilisant 
les CSM et les ML fait l&#8217;originalit&#233; de ce travail. Ce dictionnaire sera &#224; la base de toute 
analyse morpho-syntaxique de l&#8217;arabe, il regroupe les racines du grand dictionnaire ( &#1605;&#1580;&#1593;&#1605; 
&#1581;&#1575;&#1581;&#1589;&#1604;&#1575;), auquel on peut ajouter d&#8217;autres dictionnaires. 
</p>
<p>Le dictionnaire capital, resultat de ce syst&#232;me, contient 36876216 verbes et mots de l'arabe : 
ce dictionnaire est g&#233;n&#233;r&#233; automatiquement &#224; la demande de l&#8217;utilisateur donc ne pose pas de 
probl&#232;mes d&#8217;encombrement en m&#233;moire.  
</p>
<p> 
R&#233;f&#233;rences 
</p>
<p>M. SILBERZTEIN, (1993).Dictionnaires &#233;lectroniques et analyse automatique de textes (Le 
syst&#232;me INTEX). (Masson, Paris) 
</p>
<p>H. HABAILI, (1976). Contraintes de structure morph&#233;matique en Arabe, DEA en 
linguistique, Canada, universit&#233; de Montr&#233;al. 
</p>
<p>A. HADDAD, (2004). Un syst&#232;me de g&#233;n&#233;ration automatique de dictionnaires linguistiques et 
th&#233;matiques de la langue arabe. Mast&#232;re en informatique, Ecole Nationale des Sciences de 
l'informatique, TUNISIE.   
</p>
<p>A. H. MOUSSA, (1973). Statistical study of Arabic roots in moijam arous. Kouyet . 
R ZAAFRANI,(2004). Un dictionnaire &#233;lectronique pour apprenant de l'arabe (langue 
</p>
<p>seconde) bas&#233; sur corpus. JEP-TALN 2004, F&#232;s, Maroc. 
T.SAIDANE, A.HADDAD, M.ZRIGUI, Pr. M. BEN AHMED, (2004). R&#233;alisation d&#8217;un 
</p>
<p>syst&#232;me hybride de synth&#232;se de la parole arabe utilisant un dictionnaire de polyphones 
JEP-TALN 2004, F&#232;s, Maroc. </p>

</div></div>
</body></html>