<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Recherche en corpus de r&#233;ponses &#224; des questions d&#233;finitoires</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Recherche en corpus de r&#233;ponses &#224; des questions d&#233;finitoires
</p>
<p>V&#233;ronique Malais&#233;1, 2 Thierry Delbecque2, 3 Pierre Zweigenbaum2, 3, 4
(1) DRE de l&#8217;Institut National de l&#8217;Audiovisuel
</p>
<p>4, avenue de l&#8217;Europe, 94366 Bry-sur-Marne Cedex
(2) INSERM, U729, 75006 Paris
</p>
<p>(3) INALCO, CRIM, 75343 Paris Cedex 07
(4) Assistance Publique - H&#244;pitaux de Paris, STIM/DSI, 75674 Paris Cedex 14
</p>
<p>vmalaise@ina.fr, thd@biomath.jussieu.fr, pz@biomath.jussieu.fr
Mots-clefs : Syst&#232;mes de questions-r&#233;ponses, rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires, patrons
lexico-syntaxiques, m&#233;decine
</p>
<p>Keywords: Question-answering systems, mining definitions, lexico-syntactic patterns,
medicine
</p>
<p>R&#233;sum&#233; Les syst&#232;mes de questions-r&#233;ponses, essentiellement focalis&#233;s sur des questions
factuelles en domaine ouvert, testent &#233;galement d&#8217;autres t&#226;ches, comme le travail en domaine
contraint ou la recherche de d&#233;finitions. Nous nous int&#233;ressons ici &#224; la recherche de r&#233;ponses &#224;
des questions &#171; d&#233;finitoires &#187; portant sur le domaine m&#233;dical. La recherche de r&#233;ponses de type
d&#233;finitoire se fait g&#233;n&#233;ralement en utilisant deux types de m&#233;thodes : celles s&#8217;appuyant essentiel-
lement sur le contenu du corpus cible, et celles faisant appel &#224; des connaissances externes. Nous
avons choisi de nous limiter au premier de ces deux types de m&#233;thodes. Nous pr&#233;sentons une
exp&#233;rience dans laquelle nous r&#233;utilisons des patrons de rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires, con&#231;us
pour une autre t&#226;che, pour localiser les r&#233;ponses potentielles aux questions pos&#233;es. Nous avons
int&#233;gr&#233; ces patrons dans une cha&#238;ne de traitement que nous &#233;valuons sur les questions d&#233;fini-
toires et le corpus m&#233;dical du projet EQueR sur l&#8217;&#233;valuation de syst&#232;mes de questions-r&#233;ponses.
Cette &#233;valuation montre que, si le rappel reste &#224; am&#233;liorer, la &#171; pr&#233;cision &#187; des r&#233;ponses obtenue
(mesur&#233;e par la moyenne des inverses de rangs) est honorable. Nous discutons ces r&#233;sultats et
proposons des pistes d&#8217;am&#233;lioration.
</p>
<p>Abstract Question-answering systems mostly focus on open-domain, factoid questions,
but also test other tasks such as restricted-domain and &#171; definitional &#187; questions. We address
here the search for definitional questions in the medical domain. Searching for answers to de-
finitional questions generally resorts to two kinds of methods : those which mostly rely on the
contents of the target corpus, and those which call on external resources. We have chosen to
limit ourselves to the first kind. We present an experiment in which we reuse lexico-syntactic
patterns, formerly designed for another task, to locate answers to definitional questions. We
have integrated these patterns in a processing chain which we evaluate on the medical definitio-
nal questions and corpus of project EQueR (evaluation of French QA systems). This evaluation
shows that, while recall still needs to be increased, the &#171; precision &#187; of the obtained answers (as
measured through the mean reciprocal rank) is honorable. We discuss these results and propose
directions for improvement.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Thierry Delbecque, Pierre Zweigenbaum
</p>
<p>1 Introduction
</p>
<p>Les syst&#232;mes de questions-r&#233;ponses ont &#233;t&#233; jusqu&#8217;ici principalement &#233;valu&#233;s sur des questions
de type &#171; factuel &#187;, dont la r&#233;ponse attendue est un fait (Voorhees &amp; Tice, 2000). Des ques-
tions recherchant des d&#233;finitions ont cependant &#233;t&#233; introduites lors de la campagne d&#8217;&#233;valuation
TREC-12 QA de 2003 (Voorhees, 2003). Sur les 500 questions de TREC-12, 50 portaient sur
des d&#233;finitions : 30 concernaient un personnage (&#171; Who is Andrea Bocceli ? &#187;), 10 une organi-
sation (&#171; What is ETA in Spain ? &#187;), et 10 d&#8217;autres &#171; choses &#187; (&#171; What is feng shui ? &#187;) 1.
La campagne EQueR2 pour l&#8217;&#233;valuation de syst&#232;mes de questions-r&#233;ponses en fran&#231;ais a &#233;gale-
ment inclus des questions &#171; d&#233;finitoires &#187;. Une particularit&#233; de cette campagne est d&#8217;avoir mis
en place, &#224; c&#244;t&#233; d&#8217;une traditionnelle t&#226;che de questions-r&#233;ponses en domaine ouvert, une t&#226;che
de questions-r&#233;ponses &#224; domaine restreint (corpus et questions de domaine m&#233;dical). Dans la
t&#226;che m&#233;dicale, sur 200 questions, 70 (soit plus d&#8217;un tiers) portaient sur des d&#233;finitions, dont
aucune ne concernait un personnage ou une organisation.
</p>
<p>Cet article porte sur cette recherche de r&#233;ponses &#224; des questions &#171; d&#233;finitoires &#187; m&#233;dicales3.
Dans les travaux ant&#233;rieurs, deux types principaux de m&#233;thodes sont employ&#233;es pour rechercher
ce type de r&#233;ponse : des m&#233;thodes endog&#232;nes, par application sur le corpus de patrons d&#8217;&#233;nonc&#233;s
d&#233;finitoires, et des m&#233;thodes exog&#232;nes, qui projettent sur ce corpus des d&#233;finitions obtenues dans
des ressources dictionnairiques externes ((Hildebrandt et al., 2004), par exemple, combinent les
deux). Nous avions &#224; notre disposition les d&#233;finitions d&#8217;une partie des termes du thesaurus
MeSH, r&#233;dig&#233;es par l&#8217;&#233;quipe CISMeF du CHU de Rouen. Pour les questions portant sur des
termes de ce thesaurus, la projection en corpus de ces d&#233;finitions aurait pu &#234;tre pertinente.
Cependant, les questions ayant &#233;t&#233; pr&#233;par&#233;es par l&#8217;&#233;quipe CISMeF, l&#8217;usage de ces d&#233;finitions
constituerait un biais4. Nous nous sommes donc focalis&#233;s sur une m&#233;thode endog&#232;ne, et avons
cherch&#233; &#224; r&#233;utiliser des travaux r&#233;alis&#233;s sur le rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires &#224; des fins de
construction d&#8217;ontologie (Malais&#233; et al., 2004). C&#8217;est cette m&#233;thode qui fait l&#8217;objet de cet article.
Apr&#232;s une revue de travaux existants (section 2), nous pr&#233;sentons le corpus m&#233;dical EQueR
(section 3), la m&#233;thode que nous avons mise en place (section 4) et ses r&#233;sultats (section 5).
Nous discutons ces r&#233;sultats (section 6) et concluons (section 7).
</p>
<p>2 Travaux ant&#233;rieurs
</p>
<p>Les travaux r&#233;alis&#233;s autour de la t&#226;che TREC-QA de 2003 constituent une source naturelle de
bibliographie. Les r&#233;ponses aux questions d&#233;finitoires ont &#233;t&#233; consid&#233;r&#233;es comme un ensemble
de &#171; p&#233;pites &#187; d&#8217;information (Voorhees, 2003) correspondant &#224; des &#233;l&#233;ments de d&#233;finition &#224; re-
trouver : &#233;l&#233;ments &#171; vitaux &#187;, &#171; non-vitaux &#187; ou non pertinents. Les syst&#232;mes doivent ramener
un maximum d&#8217;&#233;l&#233;ments vitaux et un minimum d&#8217;&#233;l&#233;ments non pertinents. Nous consid&#233;rons
</p>
<p>1La notion de &#171; d&#233;finition &#187; d&#8217;un personnage peut sembler &#233;trange, mais c&#8217;est le typage qui a &#233;t&#233; choisi dans
cette campagne d&#8217;&#233;valuation.
</p>
<p>2EQueR fait partie du projet Technolangue EVALDA coordonn&#233; par ELDA ; contacts : Christelle Ayache
(ELDA), Brigitte Grau (LIMSI) (http://www.technolangue.net/article61.html). La t&#226;che m&#233;-
dicale a &#233;t&#233; g&#233;r&#233;e par Magaly Douy&#232;re (CISMeF). L&#8217;&#233;valuation a &#233;t&#233; men&#233;e en juillet 2004.
</p>
<p>3La m&#233;thode pr&#233;sent&#233;e ici n&#8217;a pas &#233;t&#233; mise en place, faute de temps, dans le prototype que nous avons pr&#233;sent&#233;
&#224; EQueR. Les connaissances utilis&#233;es ont n&#233;anmoins &#233;t&#233; pr&#233;par&#233;es ind&#233;pendamment des questions EQueR.
</p>
<p>4Un examen a posteriori montre effectivement que 15 des r&#233;ponses aux questions d&#233;finitoires sont constitu&#233;es
par ces d&#233;finitions, qui figurent dans certains documents du corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche en corpus de r&#233;ponses &#224; des questions d&#233;finitoires
</p>
<p>&#233;galement, suivant (Meyer, 2001), qu&#8217;un &#233;nonc&#233; est &#171; d&#233;finitoire &#187; s&#8217;il contient au moins un
&#233;l&#233;ment susceptible de servir de base &#224; la construction d&#8217;une d&#233;finition lexicographique. Cet
&#233;l&#233;ment peut &#234;tre, par exemple, l&#8217;hyperonyme du terme ou une caract&#233;ristique qui permet de le
distinguer d&#8217;autres termes proches dans le domaine. Id&#233;alement, les &#233;nonc&#233;s que nous recher-
chons combinent ces deux types d&#8217;&#233;l&#233;ments. Parmi les participants &#224; TREC 2003, (Hildebrandt
et al., 2004) s&#8217;appuient sur plusieurs sources de connaissances pour composer une r&#233;ponse &#224; une
question d&#233;finitoire. La premi&#232;re est obtenue en appliquant sur le corpus cible (AQUAINT) onze
patrons recherchant des &#171; p&#233;pites &#187; de d&#233;finition. La deuxi&#232;me utilise le dictionnaire Merriam-
Webster en ligne. La troisi&#232;me consiste, en dernier recours, &#224; collecter toutes les phrases du cor-
pus contenant le terme cible. L&#8217;&#233;valuation des r&#233;ponses aux questions d&#233;finitoires privil&#233;giait
largement le rappel par rapport &#224; la pr&#233;cision. De ce fait, un syst&#232;me reposant essentiellement
sur de simples techniques de recherche d&#8217;information, soumis par BBN apr&#232;s l&#8217;&#233;valuation (Xu
et al., 2003), a obtenu de meilleurs r&#233;sultats que les syst&#232;mes des participants. L&#8217;&#233;valuation des
d&#233;finitions dans EQueR n&#8217;a pas mis en place une telle prime au rappel. Il &#233;tait donc raisonnable
de privil&#233;gier une approche plus pr&#233;cise.
</p>
<p>Ind&#233;pendamment des syst&#232;mes de questions-r&#233;ponses, (Klavans &amp; Muresan, 2001) se sont in-
t&#233;ress&#233;es au rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires dans le domaine m&#233;dical. Elles indiquent que 75 %
des &#233;nonc&#233;s d&#233;finitoires peuvent &#234;tre retrouv&#233;s &#224; l&#8217;aide des patrons qu&#8217;elles ont mis au point,
et que ce rappel peut &#234;tre augment&#233; par bootstrapping. Les diff&#233;rents travaux de recherche de
d&#233;finitions, que ce soit au moyen de patrons lexico-syntaxiques (Rebeyrolle, 2000), d&#8217;explora-
tion contextuelle (Cartier, 1997) ou de r&#232;gles (Klavans &amp; Muresan, 2001), se basent sch&#233;mati-
quement sur des indices ou marqueurs de la d&#233;finition, associ&#233;s &#224; des contraintes concernant le
voisinage lexical et/ou syntaxique du marqueur. Les contextes de ces marqueurs doivent v&#233;rifier
en corpus l&#8217;ensemble des contraintes d&#233;finies pour que l&#8217;&#233;nonc&#233; correspondant soit consid&#233;r&#233;
comme de type d&#233;finitoire. La m&#233;thode retenue par (Malais&#233; et al., 2004) reprend cette approche
fond&#233;e sur des patrons lexico-syntaxiques ancr&#233;s sur des marqueurs.
</p>
<p>3 Le corpus m&#233;dical EQueR
</p>
<p>3.1 Les documents
</p>
<p>Le corpus m&#233;dical EQueR est un sous-ensemble des documents index&#233;s par le Catalogue et In-
dex des Sites M&#233;dicaux Francophones (CISMeF, http://www.chu-rouen.fr/cismef/) :
ceux de neuf &#171; sites &#233;diteurs &#187;5, auxquels viennent se joindre les documents r&#233;f&#233;renc&#233;s un lien
plus loin sur le m&#234;me site. L&#8217;ensemble comporte 5621 documents originellement au format
HTML ou PDF (convertis en texte brut), pour un total d&#8217;environ 19 millions de mots.
</p>
<p>3.2 Les questions d&#233;finitoires
</p>
<p>Les questions d&#8217;EQueR, comme celles de TREC, &#233;taient typ&#233;es au pr&#233;alable : l&#8217;identifiant de
la question indiquait s&#8217;il s&#8217;agissait d&#8217;une question factuelle, bool&#233;enne, d&#233;finitoire ou &#224; r&#233;ponse
</p>
<p>5F&#233;d&#233;ration Nationale des Centres de Lutte Contre le Cancer ; La Documentation Fran&#231;aise ; Agence Fran&#231;aise
de S&#233;curit&#233; Sanitaire des Produits de Sant&#233; ; Agence Nationale d&#8217;Accr&#233;ditation et d&#8217;&#201;valuation en Sant&#233; ; Orphanet,
serveur d&#8217;informations sur les maladies rares ; site officiel du S&#233;nat ; le CHU de Rouen ; Universit&#233; de Rouen,
restreinte &#224; sa branche m&#233;dicale ; site bilingue Sant&#233; Canada (minist&#232;re f&#233;d&#233;ral de la sant&#233;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Thierry Delbecque, Pierre Zweigenbaum
</p>
<p>sous forme de liste. Parmi les 70 questions d&#233;finitoires m&#233;dicales d&#8217;EQueR, cinq portaient sur
des acronymes : &#171; Comment l&#8217;IPS peut-il &#234;tre d&#233;fini ? &#187;, etc. Dans le syst&#232;me que nous avons
pr&#233;sent&#233; &#224; EQueR (syst&#232;me STIM-LIPN, voir (Delbecque et al., 2005)), les acronymes &#233;taient
rep&#233;r&#233;s par le classique patron &#171; expression (ACRONYME) &#187; ou sa variante &#171; ACRONYME
(expression) &#187;. Ces patrons se sont d&#233;clench&#233;s par exemple sur le passage &#171; L&#8217;index de pression
systolique (IPS) [...] &#187;. Ils ont &#233;t&#233; appliqu&#233;s sur l&#8217;ensemble du corpus et les r&#233;sultats stock&#233;s dans
une base de donn&#233;es, avant de recevoir les questions. Les questions rep&#233;r&#233;es comme portant sur
un acronyme ont &#233;t&#233; envoy&#233;es sur un traitement sp&#233;cifique qui acc&#232;de &#224; cette base.
</p>
<p>Les 65 questions restantes portent sur des termes &#224; d&#233;finir : &#171; Quelle est la d&#233;finition de la
d&#233;sinfection ? &#187;, &#171; Qu&#8217;est-ce que le syndrome du d&#233;calage horaire ? &#187;. Une cha&#238;ne sp&#233;cifique a
&#233;t&#233; con&#231;ue pour traiter ces questions. C&#8217;est sur ces traitements que nous nous concentrons ici.
</p>
<p>4 Recherche d&#8217;&#233;nonc&#233;s d&#233;finitoires pour un terme sp&#233;cifique
</p>
<p>La m&#233;thode que nous avons mise en &#339;uvre peut se d&#233;crire en trois grandes parties :
&#8211; comme pour les &#171; entit&#233;s nomm&#233;es &#187; des questions factuelles (Delbecque et al., 2005), nous
</p>
<p>cherchons &#224; rep&#233;rer et indexer au pr&#233;alable tous les &#233;nonc&#233;s d&#233;finitoires ;
&#8211; une question d&#233;finitoire &#233;tant donn&#233;e, il faut en extraire le terme dont on cherche la d&#233;finition ;
&#8211; il faut enfin s&#233;lectionner et classer les &#233;nonc&#233;s d&#233;finitoires pr&#233;index&#233;s concernant ce terme.
</p>
<p>4.1 Rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires en corpus
</p>
<p>Nous nous sommes appuy&#233;s sur des travaux ant&#233;rieurs, tant th&#233;oriques ((Fuchs, 1994), par
exemple) qu&#8217;appliqu&#233;s &#224; la recherche en corpus (Rebeyrolle, 2000), et de nos propres cor-
pus de test pour compiler une liste de marqueurs d&#8217;&#233;nonc&#233;s &#224; int&#233;r&#234;t d&#233;finitoire. Nous avons
mis au point des patrons lexico-syntaxiques &#224; partir de ces marqueurs et les avons test&#233;s lors
d&#8217;exp&#233;rimentations ant&#233;rieures visant &#224; rep&#233;rer des relations s&#233;mantiques entre termes (Malais&#233;
et al., 2004). Ces patrons sont appliqu&#233;s sur un corpus pr&#233;alablement analys&#233; par Cordial Ana-
lyseur 6 : Cordial segmente en phrases, lemmatise, &#233;tiquette les mots et indique leurs relations
syntaxiques. Nos patrons portent sur les lemmes et les cat&#233;gories des mots.
</p>
<p>Pour le pr&#233;sent travail, nous n&#8217;avons conserv&#233; que les patrons qui avaient donn&#233; les meilleurs
r&#233;sultats dans ces travaux ant&#233;rieurs (voir le tableau 1), &#224; savoir ceux mod&#233;lis&#233;s autour de :
&#8211; verbes m&#233;talinguistiques : &#171; appeler &#187;, &#171; nommer &#187;, &#171; r&#233;f&#233;rer &#187;, &#171; d&#233;nommer &#187;, &#171; d&#233;signer &#187;, &#171; d&#233;no-
</p>
<p>ter &#187;, &#171; signifier &#187;, &#171; d&#233;finir &#187; ;
&#8211; noms m&#233;talinguistiques associ&#233;s &#224; un ensemble de verbes supports : &#171; nom &#187;, &#171; terme &#187;, &#171; mot &#187;,
</p>
<p>&#171; expression &#187;, &#171; vocable &#187;, &#171; appellation &#187;, &#171; d&#233;signation &#187;, &#171; d&#233;nomination &#187;, &#171; concept &#187;, &#171; notion &#187;,
&#171; acception &#187;, associ&#233;s &#224; &#171; porter &#187;, &#171; appliquer &#187;, &#171; employer &#187;, &#171; r&#233;server &#187;, &#171; utiliser &#187;, &#171; donner &#187;,
&#171; renvoyer &#187;, &#171; r&#233;f&#233;rer &#187;, &#171; &#234;tre &#187; ;
</p>
<p>&#8211; indices de reformulation et d&#8217;hyperonymie : &#171; vouloir dire &#187;, &#171; entendre par &#187;, &#171; &#224; savoir &#187;, &#171; sorte
de &#187;, &#171; est un &#187;, &#171; par exemple &#187; ;
</p>
<p>&#8211; la parenth&#232;se.
Nos patrons lexico-syntaxiques permettent d&#8217;extraire des &#171; d&#233;finitions candidates &#187; et deux
groupes syntaxiques dans ces &#233;nonc&#233;s, qui sont susceptibles de contenir l&#8217;&#233;l&#233;ment d&#233;fini : le
definiendum. Ces groupes syntaxiques sont extraits selon deux modalit&#233;s :
</p>
<p>6http://www.synapse-fr.com/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche en corpus de r&#233;ponses &#224; des questions d&#233;finitoires
</p>
<p>Type de marqueur Patrons lexico-syntaxiques
Verbes m&#233;talinguistiques VerbeMeta NonPr&#233;c&#233;d&#233;De &#171; se &#187; ET NonSuiviDe [pas/.]
Noms m&#233;talinguistiques NomMeta {0-6}MOTS VerbeSupport ; VerbeSupport {0-6}MOTS NomMeta ;
</p>
<p>&#171; &#234;tre &#187; {0-1}MOT [le/ce] NomMeta ; sous [le/ce] NomMeta
Indices de reformulation ou
d&#8217;hyperonymie
</p>
<p>&#171; vouloir &#187; {0-n}MOTS &#171; dire &#187; NonSuiviDe &#171; que &#187; ; &#171; entendre &#187; {0-
6}MOTS &#171; par &#187; ; &#171; par &#187; {0-6}MOTS &#171; entendre &#187; ; &#171; &#224; savoir &#187; Pr&#233;c&#233;d&#233;De
Ponctuation ; &#171; &#224; savoir &#187; NonPr&#233;c&#233;d&#233;De Ponctuation ; Determinant &#171; sorte
de &#187; ; &#171; &#234;tre &#187; {0-3}MOTS [le/la/les/un/une/des] Nom ; &#171; par exemple &#187; Pr&#233;c&#233;-
d&#233;De 1MOT ET SuiviDe 1MOT
</p>
<p>Parenth&#232;se NomCommun (1MOT) ; NomCommun (&#171; ou &#187; Nom ; NomCommun (&#171; qui &#187;
[est/se] ; Verbe (VerbeInfinitif
</p>
<p>TAB. 1 &#8211; Patrons lexico-syntaxiques pour le rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires.
</p>
<p>&#8211; si le marqueur est un verbe, nous extrayons son sujet et son objet direct dans l&#8217;&#233;nonc&#233;, s&#8217;il en
contient, et sinon, nous extrayons respectivement :
&#8211; le groupe syntaxique ayant la m&#234;me fonction que le nom pr&#233;c&#233;dant le marqueur ;
&#8211; le groupe syntaxique ayant la fonction du premier mot plein suivant le marqueur ;
</p>
<p>&#8211; si le marqueur n&#8217;est pas un verbe, nous extrayons les groupes syntaxiques pr&#233;c&#233;dant et suivant
le marqueur de la mani&#232;re d&#233;crite ci-dessus.
</p>
<p>Dans les cas o&#249; deux marqueurs doivent &#234;tre pr&#233;sents dans la phrase (d&#233;finir associ&#233; &#224; comme,. . .),
nous ne sp&#233;cifions pas la position relative des deux marqueurs dans la phrase, et extrayons les
sujets et objets ou les contextes droits et gauches du verbe. Ce proc&#233;d&#233; rudimentaire donne tou-
tefois des r&#233;sultats de l&#8217;ordre de 55 % de pr&#233;cision (Malais&#233; et al., 2004) et permet de factoriser
les patrons. La qualit&#233; de cette extraction d&#233;pend &#233;galement de la qualit&#233; de la segmentation
initiale des phrases et de leur analyse. Par exemple, dans l&#8217;&#233;nonc&#233; (5598-1) (qui comporte un
titre mal segment&#233;) &#171; RECOMMANDATIONS ET R&#201;F&#201;RENCES Les patients dyslipid&#233;miques sont d&#233;finis
par une augmentation des taux1 s&#233;riques du cholest&#233;rol et ou des triglyc&#233;rides. [...] &#187;, le marqueur &#171; d&#233;fini &#187;
a permis de rep&#233;rer les deux groupes &#171; R&#201;F&#201;RENCES Les patients dyslipid&#233;miques sont &#187; et &#171; par une
augmentation des taux1 s&#233;riques du cholest&#233;rol et ou des triglyc&#233;rides. Ils ont de ce fait &#187;.
</p>
<p>Selon la phrase, l&#8217;un des deux groupes peut &#233;galement &#234;tre vide : pour l&#8217;&#233;nonc&#233; (5601-6) &#171; [. . .]
La SFHH recommande le terme de pr&#233;-d&#233;sinfection pour l&#8217; &#233;tape pr&#233;alable &#224; la d&#233;sinfection ou &#224; la st&#233;rilisation
Op&#233;ration utilisant des d&#233;tergents contenant au moins un principe actif reconnu pour ses propri&#233;t&#233;s bact&#233;ricides
, fongicides , sporicides ou virucides ( SFHH ) [. . .] &#187;, le syst&#232;me n&#8217;a extrait qu&#8217;un groupe &#171; droit &#187; :
&#171; de pr&#233;-d&#233;sinfection [. . .] Op&#233;ration utilisant des d&#233;tergents contenant au moins un principe actif reconnu pour ses
propri&#233;t&#233;s bact&#233;ricides &#187;.
</p>
<p>Les &#233;nonc&#233;s d&#233;finitoires candidats ainsi trouv&#233;s, avec le ou les deux groupes extraits correspon-
dant aux positions hypoth&#233;tiques du definiendum, sont not&#233;s dans une table, qui est index&#233;e par
les mots (leurs formes graphiques et lemmes) pr&#233;sents dans chacun des groupes. C&#8217;est cet index
des definienda hypoth&#233;tiques qui servira lors de la recherche de r&#233;ponses.
</p>
<p>4.2 Analyse de la question
</p>
<p>Les questions pos&#233;es sont trait&#233;es en fonction de leur type. Le traitement g&#233;n&#233;ral appliqu&#233; par
d&#233;faut a &#233;t&#233; r&#233;alis&#233; par l&#8217;&#233;quipe du LIPN (Thierry Poibeau), et s&#8217;appuie sur une s&#233;rie de trans-
ducteurs mis en &#339;uvre avec Unitex (http://www-igm.univ-mlv.fr/~unitex/). Pour les
questions de type &#171; d&#233;finition &#187; (par exemple, &#171; Quelle est la d&#233;finition de &quot;chimioth&#233;ra-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Thierry Delbecque, Pierre Zweigenbaum
</p>
<p>pie&quot; ? &#187;), un traitement sp&#233;cifique vise &#224; extraire de la question le terme dont on cherche la
d&#233;finition7. Il proc&#232;de par &#233;limination, en supprimant de la question tous les mots consid&#233;r&#233;s
comme &#171; vides &#187; : principalement la copule, les d&#233;terminants, les particules interrogatives et les
verbes de parole. Les mots des deux premi&#232;res cat&#233;gories (&#171; est &#187;, &#171; la &#187;, &#171; de &#187;) sont puis&#233;s dans
plusieurs listes collect&#233;es dans des travaux ant&#233;rieurs, qui ont &#233;t&#233; augment&#233;es par une liste de
particules interrogatives (&#171; quel &#187;, &#171; quelle &#187;, &#171; quelles &#187;, &#171; quels &#187;, &#171; quoi &#187;, &#171; comment &#187;,. . .)
et d&#8217;autres mots (&#171; fa&#231;on &#187;, etc.). Les mots qui d&#233;signent une d&#233;finition (&#171; d&#233;finition &#187;, &#171; d&#233;-
finir &#187;, &#171; appeler &#187;...) ont &#233;t&#233; pris dans les listes des principaux marqueurs employ&#233;s dans les
patrons : ceux qui se sont appliqu&#233;s sur le corpus. Les listes employ&#233;es contiennent directement
les formes fl&#233;chies des mots. Ainsi, pour la question ci-dessus, le terme restant est &#171; chimioth&#233;-
rapie &#187;.
</p>
<p>4.3 Recherche de d&#233;finitions en r&#233;ponse &#224; une question
</p>
<p>Il s&#8217;agit ici de proposer des d&#233;finitions pour le terme extrait d&#8217;une question. On va pour cela
le chercher parmi les definienda hypoth&#233;tiques relev&#233;s pr&#233;c&#233;demment (section 4.1). Ils sont
class&#233;s en fonction du nombre de mots du terme de la question qu&#8217;ils contiennnent. Dans les
exp&#233;riences pr&#233;sent&#233;es ici, nous avons impos&#233; que tous les mots du terme recherch&#233; soient
pr&#233;sents. Les r&#233;ponses ont alors &#233;t&#233; class&#233;es dans l&#8217;ordre des documents du corpus. Dans l&#8217;&#233;va-
luation EQueR, un syst&#232;me peut renvoyer jusqu&#8217;&#224; cinq r&#233;ponses ordonn&#233;es. Nous conservons
donc les cinq premiers candidats. Une r&#233;ponse se compose d&#8217;un passage (l&#8217;&#233;nonc&#233;, tronqu&#233; &#224;
250 caract&#232;res si n&#233;cessaire) et d&#8217;une r&#233;ponse courte (la d&#233;finition). Nous proposons comme
d&#233;finition celui des deux groupes qui ne contient pas le terme de la question (ou celui qui le
contient si l&#8217;autre est vide). Si l&#8217;&#233;nonc&#233; est tronqu&#233;, il est centr&#233; sur ce groupe.
Ainsi, &#224; la question &#171; Qu&#8217;est-ce qu&#8217;une aniridie ? &#187; , l&#8217;&#233;nonc&#233; (5590-2) donnera comme r&#233;ponse
&#171; courte &#187; &#171; comme l&#8217; absence totale d&#8217; iris &#187;, et comme passage &#171; Aniridie sporadique TITLE L&#8217; aniridie
est une absence clinique d&#8217; iris [. . .] L&#8217; aniridie se d&#233;finit comme l&#8217; absence totale d&#8217; iris . &#187;. Pour la question
&#171; Quelle est la d&#233;finition de l&#8217;asthme ? &#187;, l&#8217;&#233;nonc&#233; (5586-2) donne la r&#233;ponse courte erron&#233;e
&#171; D&#233;finition Le clinicien &#187;, mais le passage correct &#171; National des Prescriptions et Consommations des
M&#233;dicaments [. . .] D&#233;finition Le clinicien d&#233;finit l&#8217; asthme comme un acc&#232;s de dyspn&#233;e , de toux et de sifflement
paroxystique , dont l&#8217; expression peut &#187;8.
</p>
<p>4.4 &#201;valuation
L&#8217;objectif de ce travail &#233;tait de r&#233;pondre aux questions de type d&#233;finitoire pos&#233;es dans la cam-
pagne EQueR d&#8217;&#233;valuation de syst&#232;mes de questions-r&#233;ponses, t&#226;che m&#233;dicale. Pour ne pas
biaiser le syst&#232;me, la mise au point du module de recherche de r&#233;ponse &#224; des questions d&#233;-
finitoires s&#8217;est faite ind&#233;pendamment des questions EQueR. Nous avons utilis&#233; pour cela un
ensemble de 735 termes m&#233;dicaux tir&#233;s du thesaurus MeSH pour lesquels nous disposions de
d&#233;finitions en fran&#231;ais9. Ces termes nous ont servi &#224; tester notre cha&#238;ne de traitement.
</p>
<p>L&#8217;&#233;valuation proprement dite s&#8217;est faite sur les questions de la campagne EQueR. Ce module
ayant &#233;t&#233; termin&#233; apr&#232;s la fin de l&#8217;&#233;valuation officielle, nous avons nous-m&#234;mes calcul&#233; les
</p>
<p>7Ce terme sera alors stock&#233; sous la forme graphique selon laquelle il appara&#238;t dans la question.
8Ce passage n&#8217;a h&#233;las pas &#233;t&#233; class&#233; parmi les cinq premiers par notre syst&#232;me.
9Ces d&#233;finitions sont celles mises au point par l&#8217;&#233;quipe CISMeF, dans une version du printemps 2004.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche en corpus de r&#233;ponses &#224; des questions d&#233;finitoires
</p>
<p>scores, en reprenant les principes utilis&#233;s dans EQueR. Cette &#233;valuation repose sur un juge-
ment humain de pertinence des r&#233;ponses courtes et passages produits par le syst&#232;me, avec une
possibilit&#233; de variation non n&#233;gligeable10. Nous l&#8217;avons effectu&#233;e nous-m&#234;mes, les jugements
individuels et les chiffres synth&#233;tiques qui en d&#233;coulent ne sont donc pas directement compa-
rables &#224; ceux de l&#8217;&#233;valuation EQueR officielle. Nous estimons cependant qu&#8217;ils devraient rester
dans le m&#234;me esprit.
</p>
<p>Pour EQuER, une r&#233;ponse courte est jug&#233;e correcte si elle est juste et pr&#233;cise ; inexacte si elle
n&#8217;est pas assez pr&#233;cise, incorrecte si elle n&#8217;est pas juste, et non justifi&#233;e si elle est correcte mais
que le document indiqu&#233; ne la corrobore pas. Un passage est correct s&#8217;il contient au moins une
partie d&#8217;une r&#233;ponse juste (le reste &#233;tant dans le document) ou incorrect s&#8217;il ne contient pas
assez ou pas du tout d&#8217;&#233;l&#233;ments corrects (non compl&#233;t&#233;s par le document).
Nous avons not&#233; nos r&#233;ponses (courtes ou passages) sur trois niveaux : s&#251;rement correcte, pos-
siblement correcte, incorrecte. Le niveau interm&#233;diaire vise &#224; prendre en compte l&#8217;&#233;cart qui peut
exister entre notre jugement et celui qu&#8217;auraient rendu les &#233;valuateurs d&#8217;EQueR. Nous donnons
ainsi deux s&#233;ries de r&#233;sultats, un &#171; score strict &#187; qui consid&#232;re les &#171; possiblement correctes &#187;
comme incorrectes, et un &#171; score laxiste &#187; qui les compte comme correctes.
</p>
<p>La note assign&#233;e &#224; une question est l&#8217;inverse du rang de la premi&#232;re bonne r&#233;ponse renvoy&#233;e
par le syst&#232;me. La note globale est la moyenne de ces inverses du rang.
</p>
<p>5 R&#233;sultats
</p>
<p>Le rep&#233;rage des &#233;nonc&#233;s d&#233;finitoires a &#233;t&#233; appliqu&#233; &#224; l&#8217;ensemble du corpus m&#233;dical EQueR11.
17 792 &#233;nonc&#233;s d&#233;finitoires potentiels ont &#233;t&#233; rep&#233;r&#233;s. Les patrons les plus productifs sont ceux
centr&#233;s sur les marqueurs : &#171; d&#233;finir &#187; (4950), &#171; exemple &#187; (4347), parenth&#232;se (1851), &#171; appe-
ler &#187; (1336), &#171; &#234;tre &#187; (1272). Les 65 questions d&#233;finitoires d&#8217;EQueR hors acronymes ont &#233;t&#233;
analys&#233;es, et les termes extraits ont &#233;t&#233; recherch&#233;s dans les groupes repr&#233;sentant les definienda
hypoth&#233;tiques12. Notre syst&#232;me a propos&#233; des r&#233;ponses &#224; 22 des 65 questions (tableau 2). Selon
le jugement port&#233;, entre 5 et 10 des r&#233;ponses courtes et entre 9 et 16 des passages &#233;taient cor-
rects. Le rang des bonnes r&#233;ponses trouv&#233;es varie du premier au cinqui&#232;me (et dernier) rang.
Dans la version stricte, le bon passage est en moyenne trouv&#233; au troisi&#232;me rang (MRR = 0, 33),
et la moiti&#233; des 22 questions n&#8217;obtient aucune bonne r&#233;ponse. Dans la version laxiste, le bon
passage est en moyenne au second rang (MRR = 0, 53), et seules 6 de ces questions n&#8217;ob-
tiennent pas de bonne r&#233;ponse.
</p>
<p>6 Discussion
</p>
<p>Pour les raisons expliqu&#233;es plus haut, il est difficile de comparer nos r&#233;sultats &#224; ceux obtenus
pour les d&#233;finitions dans les comp&#233;titions TREC-QA (pour 2003, f-mesure m&#233;diane &#224; 0,192,
</p>
<p>10Dans le cadre de TREC-QA, la marge d&#8217;erreur li&#233;e &#224; des diff&#233;rences d&#8217;appr&#233;ciation sur la pertinence de
certaines r&#233;ponses semble globalement ne pas modifier le classement des syst&#232;mes.
</p>
<p>11Il a &#233;t&#233; programm&#233; en XSLT, et son application sur l&#8217;ensemble du corpus EQueR m&#233;dical prend 25 minutes
sur un biprocesseur Xeon 2,4 GHz avec 1,2 Go de m&#233;moire.
</p>
<p>12Les programmes pour l&#8217;analyse des questions et la recherche des r&#233;ponses aux 65 questions d&#233;finitoires
EQueR, impl&#233;ment&#233;s en Perl, mettent 10 secondes pour traiter l&#8217;ensemble des questions sur la m&#234;me machine.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;ronique Malais&#233;, Thierry Delbecque, Pierre Zweigenbaum
</p>
<p>Score strict Score laxiste
no EQueR Question C P C P
MD28 Quelle est la d&#233;finition de chimioth&#233;rapie ? 0 0 0 0,25
MD52 Qu&#8217;est-ce qu&#8217;une aniridie ? 0,5 0,5 0,5 0,5
MD56 Qu&#8217;est ce qu&#8217;un m&#233;soth&#233;liome ? 1 1 1 1
MD57 Qu&#8217;est-ce qu&#8217;une anomalie cong&#233;nitale ? 0 0 0 0
MD61 Qu&#8217;est-ce qu&#8217;une anorexie ? 0,33 0,33 0,33 0,33
MD62 Quelle est la d&#233;finition de la d&#233;sinfection ? 0 0,33 0 0,33
MD64 Qu&#8217;est-ce que la radioth&#233;rapie ? 0 0 0 0,5
MD66 Quelle est la d&#233;finition de l&#8217;asthme ? 0 0 0 0
MD69 Qu&#8217;est-ce que le s&#233;quen&#231;age ? 0 0 0 0
MD70 Qu&#8217;est-ce que le syndrome du d&#233;calage horaire ? 1 1 1 1
MD71 Qu&#8217;est-ce qu&#8217;un trouble d&#233;pressif ? 0 0 1 1
MD75 Qu&#8217;est-ce que l&#8217;Index de Pression Systolique ? 0,2 1 0,2 1
MD77 Qu&#8217;est-ce que la schizophr&#233;nie ? 0 0 1 1
MD79 Qu&#8217;est-ce qu&#8217;une amblyopie ? 0 0 0,33 0,33
MD82 Qu&#8217;est-ce qu&#8217;un scanner ? 0 0 0 0
MD87 Quelle est la d&#233;finition de la g&#233;nomique ? 0 0 0 0
MD89 Quelle est la d&#233;finition du neuroblastome ? 0 1 0 1
MD91 Qu&#8217;est-ce que la th&#233;rapie g&#233;nique ? 0 1 1 1
MD94 Qu&#8217;est-ce que la vir&#233;mie ? 0 1 0 1
MD98 Qu&#8217;est-ce qu&#8217;une sialographie ? 0 0 0 0
MRD153 Que signifie le terme chimioth&#233;rapie ? 0 0 0 0,5
MRD189 Comment peut-on d&#233;finir un trouble d&#233;pressif ? 0 0 1 1
</p>
<p>Moyenne des inverses de rang (MRR) 0,138 0,326 0,335 0,534
Nombre de r&#233;ponses trouv&#233;es 5 9 10 16
</p>
<p>TAB. 2 &#8211; Les 22 questions auxquelles le syst&#232;me a r&#233;pondu, et le score des r&#233;ponses fournies. C =
r&#233;ponse courte, P = passage. Les scores sont des inverses de rangs (un score de 0,33 correspond &#224; une
r&#233;ponse trouv&#233;e au rang 3). Le score &#171; laxiste &#187; accepte des r&#233;ponses moins compl&#232;tes.
</p>
<p>meilleure &#224; 0,555) : ils comportaient de nombreuses questions sur des personnes ou des organi-
sations et n&#8217;&#233;taient pas calcul&#233;s de la m&#234;me fa&#231;on (&#171; p&#233;pites &#187; de connaissance). La comparaison
aux r&#233;sultats d&#8217;EQueR est elle aussi malais&#233;e, du fait de la part de jugement humain impliqu&#233;e
dans l&#8217;&#233;valuation des r&#233;ponses individuelles13.
</p>
<p>On peut n&#233;anmoins noter qu&#8217;un nombre relativement faible (un tiers) de questions obtiennent
une r&#233;ponse, et qu&#8217;une partie seulement de ces questions re&#231;oivent une r&#233;ponse correcte parmi
les cinq premi&#232;res propos&#233;es par le syst&#232;me (entre 40 et 73 % pour les passages). D&#8217;apr&#232;s
les donn&#233;es globales dont nous disposons, nous avons calcul&#233; que dans EQueR, 39 questions
d&#233;finitoires ont obtenu au moins un passage correct de la part d&#8217;un participant, dont 35 avec la
r&#233;ponse courte correcte. Il est cependant important d&#8217;analyser l&#8217;origine de ces pertes de fa&#231;on
&#224; augmenter le rappel du syst&#232;me actuel. Ce syst&#232;me &#233;tant compos&#233; de modules encha&#238;n&#233;s,
chaque module est susceptible de participer &#224; cette perte d&#8217;information.
</p>
<p>Le rep&#233;rage des &#233;nonc&#233;s d&#233;finitoires et des definienda hypoth&#233;tiques est une premi&#232;re origine :
dans les travaux pr&#233;c&#233;dents, leur rappel a &#233;t&#233; &#233;valu&#233; &#224; environ 50 %, et leur pr&#233;cision de 10 &#224;
69 % suivant la complexit&#233; syntaxique des &#233;nonc&#233;s. De plus les patrons n&#8217;ont pas &#233;t&#233; adapt&#233;s
au domaine m&#233;dical, ce qui entra&#238;ne &#224; la fois du bruit (marqueurs polys&#233;miques en m&#233;decine) et
du silence (patrons de d&#233;finitions de type &#171; m&#233;dical &#187; non mod&#233;lis&#233;es). L&#8217;analyse des questions,
</p>
<p>13Cette part pourra &#234;tre r&#233;duite si tous les passages corrects sont relev&#233;s pour chaque question, ce qui a &#233;t&#233; fait
au moins partiellement par les organisateurs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche en corpus de r&#233;ponses &#224; des questions d&#233;finitoires
</p>
<p>r&#233;alis&#233;e ici de fa&#231;on simpliste, a laiss&#233; passer plusieurs mots &#171; vides &#187;14 non pr&#233;vus ou dont
la forme employ&#233;e n&#8217;&#233;tait pas pr&#233;vue (&#171; dire &#187;, &#171; sigle &#187;, &#171; d&#233;finie &#187;, &#171; possible &#187;, ...). Les
termes ainsi obtenus (MD15 &#171; possible ost&#233;osynth&#232;se &#187;, MD16 &#171; dire noyade subl&#233;tale &#187;, ...)
ne peuvent &#234;tre trouv&#233;s en position de definiendum. Huit termes ont ainsi &#233;t&#233; mal identifi&#233;s.
On peut esp&#233;rer qu&#8217;une analyse employant par exemple des transducteurs et une lemmatisation
comme pour les autres questions, donnerait des r&#233;sultats plus pr&#233;cis. Enfin, dans les cas o&#249; plus
de cinq r&#233;ponses ont &#233;t&#233; trouv&#233;es, un meilleur classement des r&#233;ponses pourrait augmenter le
rappel si la bonne r&#233;ponse ne fait partie des premiers passages renvoy&#233;s (une dizaine de cas).
Par exemple, la m&#233;thode consistant &#224; collecter toutes les phrases o&#249; appara&#238;t le terme &#224; d&#233;finir,
puis les mots les plus fr&#233;quents dans ces phrases, et &#224; privil&#233;gier les phrases qui contiennent le
plus grand nombre de ces mots (Xu et al., 2003) semble une piste int&#233;ressante.
Il semblerait pertinent de comparer ce que donnerait l&#8217;application brute de cette m&#233;thode &#224; ce
que nous obtenons en filtrant &#224; l&#8217;aide du rep&#233;rage d&#8217;&#233;nonc&#233;s d&#233;finitoires. On peut esp&#233;rer que
cette focalisation sur les &#233;nonc&#233;s d&#233;finitoires r&#233;duit le bruit (m&#234;me si elle ne le supprime pas,
en particulier du fait que les patrons employ&#233;s sont eux-m&#234;mes sources de bruit) : on a vu qu&#8217;il
n&#8217;&#233;tait pas excessif dans les r&#233;ponses donn&#233;es par notre syst&#232;me (MRR entre 0,33 et 0,53).
Ensuite, on peut supposer que l&#8217;usage de connaissances ext&#233;rieures (dictionnaires, terminolo-
gies avec d&#233;finitions, locaux ou interrogeables en ligne), que nous nous sommes interdit ici,
devrait aider &#224; localiser des d&#233;finitions candidates non contraintes par les patrons dont nous
disposons. Par exemple, certaines d&#233;finitions sont donn&#233;es en plusieurs phrases, voire en faisant
implicitement r&#233;f&#233;rence au titre du document, avec une pr&#233;sentation du type &#171; &lt;TITLE&gt;Noyade
subl&#233;tale&lt;/TITLE&gt; D&#233;finition [MeSH Scope Note ; traduction CISMeF] : immersion non fatale dans l&#8217;eau. Le su-
jet peut &#234;tre r&#233;anim&#233;. &#187; ou &#171; &lt;TITLE&gt;Ad&#233;nite&lt;/TITLE&gt; D&#233;finition [MeSH Scope Note ; traduction CISMeF] :
inflammation des ganglions lymphatiques. &#187;. Ce type de pr&#233;sentation ne semble pas possible &#224; d&#233;tecter
par des patrons g&#233;n&#233;riques. En revanche, le fait de savoir que l&#8217;&#171; Ad&#233;nite &#187; est une &#171; Inflamma-
tion des ganglions lymphatiques &#187; permet d&#8217;associer cet &#233;nonc&#233; au terme correspondant. Cette
information peut se trouver dans un dictionnaire m&#233;dical, comme celui disponible en ligne &#224;
l&#8217;URL http://www.AtMedica.com.
</p>
<p>Pour terminer, soulignons qu&#8217;une source importante de bruit est constitu&#233;e par le corpus lui-
m&#234;me, obtenu par conversion en texte de documents HTML et PDF, conversion dont on sait
qu&#8217;elle reste difficile &#224; r&#233;aliser proprement de fa&#231;on automatique. Sur un corpus de taille im-
portante, une r&#233;vision manuelle compl&#232;te reste hors de port&#233;e, et les passages bruit&#233;s sont nom-
breux. Ces passages sont &#224; l&#8217;origine d&#8217;&#233;nonc&#233;s mal segment&#233;s ou incoh&#233;rents, que nos pro-
grammes n&#8217;ont pas su prendre en compte correctement. Ce point constitue aussi probablement
une diff&#233;rence importante par rapport au corpus AQUAINT utilis&#233; dans TREC.
</p>
<p>7 Conclusion
</p>
<p>Le syst&#232;me assembl&#233; ici permet de proposer des r&#233;ponses &#224; des questions de type d&#233;finitoire
&#224; partir du corpus m&#233;dical EQueR. Si son rappel doit &#234;tre am&#233;lior&#233;, la pr&#233;cision des r&#233;ponses
propos&#233;es est honorable. Notons qu&#8217;il a trouv&#233; quelques r&#233;ponses correctes qu&#8217;aucun participant
&#224; EQueR n&#8217;a trouv&#233;es, par exemple celle de &#171; Quelle est la d&#233;finition de la d&#233;sinfection ? &#187;.
Nous avons soulign&#233; qu&#8217;au-del&#224; des am&#233;liorations &#224; apporter &#224; la pr&#233;paration du corpus et aux
</p>
<p>14Particules interrogatives, verbes de parole, etc. (cf. section 4.2).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;F&#201;RENCES V&#233;ronique Malais&#233;, Thierry Delbecque, Pierre Zweigenbaum
</p>
<p>m&#233;thodes pr&#233;sent&#233;es elles-m&#234;mes, essentiellement endog&#232;nes, un recours &#224; des connaissances
ext&#233;rieures (d&#233;finitions existantes) devrait aider &#224; renforcer la d&#233;tection des d&#233;finitions correctes
en corpus. Ce sera le th&#232;me de nos prochains travaux.
</p>
<p>Remerciements
</p>
<p>Nous remercions Magaly Douy&#232;re pour ses conseils sur l&#8217;&#233;valuation des d&#233;finitions trouv&#233;es.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CARTIER E. (1997). La d&#233;finition dans les textes scientifiques et techniques : pr&#233;sentation
d&#8217;un outil d&#8217;extraction automatique de relations d&#233;finitoires. In 2e Rencontres Terminologie et
Intelligence Artificielle, p. 127&#8211;140, Toulouse : ERSS.
DELBECQUE T., JACQUEMART P. &amp; ZWEIGENBAUM P. (2005). Utilisation du r&#233;seau s&#233;man-
tique de l&#8217;UMLS pour la d&#233;finition de types d&#8217;entit&#233;s nomm&#233;es m&#233;dicales dans un syst&#232;me de
questions-r&#233;ponses : impact de la source des documents explor&#233;s. In CORIA (COnf&#233;rence en
Recherche d&#8217;Informations et Applications), p. 101&#8211;115, Grenoble : CLIPS.
FUCHS C. (1994). Paraphrase et &#233;nonciation. Paris, Ophrys.
HILDEBRANDT W., KATZ B. &amp; LIN J. (2004). Answering definition questions using multiple
knowledge sources. In S. DUMAIS, D. MARCU &amp; S. ROUKOS, Eds., Actes HLT-NAACL, p.
49&#8211;56, Boston, Massachusetts, USA : ACL.
KLAVANS J. &amp; MURESAN S. (2001). Evaluation of the DEFINDER system for fully automa-
tic glossary construction. Journal of the American Medical Informatics Association, 8(suppl),
324&#8211;328.
MALAIS&#201; V., ZWEIGENBAUM P. &amp; BACHIMONT B. (2004). Rep&#233;rage et exploitation d&#8217;&#233;non-
c&#233;s d&#233;finitoires en corpus pour l&#8217;aide &#224; la construction d&#8217;ontologie. In P. BLACHE, Ed., Actes
de TALN 2004 (Traitement automatique des langues naturelles), p. 269&#8211;278, F&#232;s, Maroc :
ATALA LPL.
MEYER I. (2001). Extracting knowledge-rich contexts for terminography. In D. BOURI-
GAULT, C. JACQUEMIN &amp; M.-C. L&#8217;HOMME, Eds., Recent Advances in Computational Ter-
minology, p. 279&#8211;302. Amsterdam : John Benjamins.
REBEYROLLE J. (2000). Forme et fonction de la d&#233;finition en discours. Th&#232;se de doctorat,
Universit&#233; de Toulouse II - Le Mirail.
VOORHEES E. M. (2003). Overview of the TREC 2003 question answering track. In E. M.
VOORHEES &amp; L. P. BUCKLAND, Eds., Actes Twelfth Text Retrieval Conference (TREC 2003),
p. 54&#8211;68, Washington DC : NIST.
VOORHEES E. M. &amp; TICE D. M. (2000). The TREC-8 question answering track evaluation.
In E. M. VOORHEES &amp; D. K. HARMAN, Eds., Eighth Text REtrieval Conference (TREC-8),
NIST Special Publication 500-246, p. 83&#8211;105.
XU J., LICUANAN A. &amp; WEISCHEDEL R. (2003). TREC2003 QA at BBN : Answering
definitional questions. In E. M. VOORHEES &amp; L. P. BUCKLAND, Eds., Actes Twelfth Text
Retrieval Conference (TREC 2003), p. 98&#8211;106, Washington DC : NIST.</p>

</div></div>
</body></html>