<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction semi-supervis&#233;e de couples d'antonymes gr&#226;ce &#224; leur morphologie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Extraction semi-supervis&#233;e de couples d&#8217;antonymes
gr&#226;ce &#224; leur morphologie
</p>
<p>Didier Schwab, Mathieu Lafourcade et Violaine Prince
LIRMM
</p>
<p>Laboratoire d&#8217;informatique, de Robotique
et de Micro&#233;lectronique de Montpellier
</p>
<p>MONTPELLIER - FRANCE.
{schwab,lafourca,prince}@lirmm.fr
</p>
<p>http ://www.lirmm.fr/ &#732;{schwab, lafourca, prince}
</p>
<p>Mots-clefs : antonymie, morphologie, antonymie compl&#233;mentaire, antonymie scalaire,
antonymie duale, r&#233;partition statistique
</p>
<p>Keywords: antonymy, morphology, complementar antonymy, scalar antonymy, dual an-
tonymy, statistic distribution
</p>
<p>R&#233;sum&#233; Dans le cadre de la recherche sur la repr&#233;sentation du sens en Traitement Au-
tomatique des Langues Naturelles, nous nous concentrons sur la construction d&#8217;un syst&#232;me
capable d&#8217;acqu&#233;rir le sens des mots, et les relations entre ces sens, &#224; partir de dictionnaires &#224;
usage humain, du Web ou d&#8217;autres ressources lexicales. Pour l&#8217;antonymie, il n&#8217;existe pas de
listes s&#233;parant les antonymies compl&#233;mentaire, scalaire et duale. Nous pr&#233;sentons dans cet ar-
ticle une approche semi-supervis&#233;e permettant de construire ces listes. Notre m&#233;thode est bas&#233;e
sur les oppositions de nature morphologique qui peuvent exister entre les items lexicaux. &#192; par-
tir d&#8217;un premier ensemble de couples antonymes, elle permet non seulement de construire ces
listes mais aussi de trouver des oppositions morphologiques. Nous &#233;tudions les r&#233;sultats obtenus
par cette m&#233;thode. En particulier, nous pr&#233;sentons les oppositions de pr&#233;fixes ainsi d&#233;couvertes
et leur validit&#233; sur le corpus puis nous discutons de la r&#233;partition des types d&#8217;antonymie en
fonction des couples oppos&#233;s de pr&#233;fixes.
</p>
<p>Abstract In the framework of meaning representation in Natural Language Processing,
we focus on enabling a system to autonomously learn word meanings and semantic relations
from user dictionaries, web contents and other lexical resources. For antonymy, as a lexical
semantic relation, no resource provides distinctions between complementary, scalar and dual
antonymies. In this paper, we present a semi-supervized method to collate such lists, based
on operating morphological opposition holding between lexical items. The approach presented
here starts from a bootstraped initial list. It is able to augment such lists but also to find out
morphological oppositions. We scrutinize the obtained results and discuss the distribution of
antonymy types.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab, Mathieu Lafourcade et Violaine Prince
</p>
<p>1 Introduction
Dans le cadre de la recherche sur la repr&#233;sentation du sens en Traitement Automatique des
Langues Naturelles, nous nous concentrons sur la construction d&#8217;un syst&#232;me capable d&#8217;acqu&#233;-
rir le sens des mots, et les relations entre ces sens, &#224; partir de dictionnaires &#224; usage humain,
du Web ou d&#8217;autres ressources lexicales. Pour le Fran&#231;ais, qui constitue la langue de r&#233;f&#233;rence
de notre exp&#233;rimentation, des bases de donn&#233;es gratuites regroupant les principales fonctions
lexicales n&#8217;existent pas ou ne correspondent pas exactement &#224; nos attentes. En effet, les diction-
naires d&#8217;antonymes, regroupent indiff&#233;remment les trois types d&#8217;antonymie connus : antonymie
compl&#233;mentaire, antonymie scalaire et antonymie duale. Ces trois types seront expliqu&#233;s dans
le prochain chapitre. Afin de gagner en pr&#233;cision, nous cherchons donc &#224; construire des listes
d&#8217;antonymes bas&#233;es sur cette typologie.
</p>
<p>Nous pr&#233;sentons dans cet article une approche semi-supervis&#233;e permettant de construire ces
listes. Notre m&#233;thode est bas&#233;e sur les oppositions de nature morphologique qui peuvent exister
entre les items lexicaux. Ainsi, les pr&#233;fixes ante- et post- s&#8217;opposent sur une id&#233;e de dur&#233;e.
Cette m&#233;thode, &#224; partir d&#8217;un premier ensemble de couples connus comme antonymes, extrait
les pr&#233;fixes susceptibles de s&#8217;opposer puis, cherche, dans un corpus constitu&#233; par les entr&#233;es de
notre base lexicale, d&#8217;autres termes susceptibles d&#8217;&#234;tre antonymes. Un expert valide les couples
ainsi extraits et, par l&#224; m&#234;me, les couples de pr&#233;fixes qui leur correspondent. Une recherche
automatique de nouveaux pr&#233;fixes oppos&#233;s est effectu&#233;e dans le corpus &#224; partir de ces nouveaux
couples. La m&#233;thode est it&#233;r&#233;e jusqu&#8217;au moment o&#249; il n&#8217;y a plus de pr&#233;fixes candidats.
Nous &#233;tudions les r&#233;sultats obtenus par cette m&#233;thode. En particulier, nous pr&#233;sentons les op-
positions de pr&#233;fixes ainsi d&#233;couvertes et leur validit&#233; dans le corpus puis nous discutons de la
r&#233;partition des types d&#8217;antonymie en fonction des couples oppos&#233;s de pr&#233;fixes.
</p>
<p>2 L&#8217;antonymie
On consid&#232;re que &#171; deux items lexicaux sont en relation d&#8217;antonymie si on peut exhiber une
sym&#233;trie de leurs traits s&#233;mantiques par rapport &#224; un axe. &#187; (Schwab et al., 2002). La sym&#233;trie
se d&#233;cline alors de diff&#233;rentes mani&#232;res, selon la nature de son support. Il se d&#233;gage ainsi trois
types d&#8217;antonymie : l&#8217;antonymie compl&#233;mentaire, l&#8217;antonymie scalaire et l&#8217;antonymie duale,
cette derni&#232;re regroupant les conversifs et les duals propres. Nous notons l&#8217;antonymie par un
signe d&#8217;&#233;quivalence ayant subit une rotation de 90 degr&#233;s (&#8618;riche&#8617;ppp&#8618;pauvre&#8617;). Ce signe rappelle &#224;
la fois le signe marquant la synonymie, relation consid&#233;r&#233;e comme oppos&#233;e &#224; l&#8217;antonymie, chez
Polgu&#232;re (Polgu&#232;re, 2003) et la sym&#233;trie axiale existant entre les deux termes antonymes.
2.1 Antonymie compl&#233;mentaire
Cette antonymie concerne les couples tels que &#8618;absent&#8617;pppc&#8618;pr&#233;sent&#8617;, ou &#8618;existence&#8617;pppc&#8618;inexistence&#8617;.
</p>
<p>il est pr&#233;sent &#8658; il n&#8217;est pas absent il n&#8217;est pas absent &#8658; il est pr&#233;sent
il est absent &#8658; il n&#8217;est pas pr&#233;sent il n&#8217;est pas pr&#233;sent &#8658; il est absent
</p>
<p>En termes de logique, nous avons :
&#8704;x P(x)&#8658;&#172;Q(x) &#8704;x &#172;P(x)&#8658; Q(x)
&#8704;x Q(x)&#8658;&#172;P(x) &#8704;x &#172;Q(x)&#8658; P(x)
</p>
<p>Nous reconnaissons ici une relation de disjonction exclusive. Dans ce cadre, l&#8217;affirmation d&#8217;un
des termes implique n&#233;cessairement la n&#233;gation de l&#8217;autre. Sur le plan de la sym&#233;trie, l&#8217;anto-
nymie compl&#233;mentaire pr&#233;sente deux types de sym&#233;trie : (1) une sym&#233;trie de valeur dans un
syst&#232;me &#224; deux valeurs seulement, comme dans l&#8217;exemple pr&#233;c&#233;dent, (2) une sym&#233;trie par rap-
port &#224; l&#8217;application d&#8217;une propri&#233;t&#233; : le noir est l&#8217;absence de couleur, il est donc &quot;oppos&#233;&quot; &#224;
toute couleur, et &#224; toute combinaison de couleurs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction semi-supervis&#233;e de couples d&#8217;antonymes gr&#226;ce &#224; leur morphologie
</p>
<p>2.2 Antonymie scalaire
Les antonymes scalaires (ou gradables) concernent les syst&#232;mes &#233;chelonn&#233;s comme la taille
(&#8618;grand&#8617;ppps&#8618;petit&#8617;) ou la temp&#233;rature (&#8618;chaud&#8617;ppps&#8618;froid&#8617;). La sym&#233;trie se r&#233;alise par rapport &#224; une
valeur de r&#233;f&#233;rence du syst&#232;me qui n&#8217;est pas toujours repr&#233;sent&#233;e par un mot. Par exemple, pour
&#8618;grand&#8617;ppps&#8618;petit&#8617;, nous avons :
</p>
<p>Cet homme est grand &#8658; Cet homme n&#8217;est pas petit
Cet homme est petit &#8658; Cet homme n&#8217;est pas grand
Cet homme n&#8217;est pas grand &#8658; Cet homme est petit &#8744; cet homme est de taille moyenne
Cet homme n&#8217;est pas petit &#8658; Cet homme est grand &#8744; cet homme est de taille moyenne
</p>
<p>Cet homme est &#171; ni grand ni petit &#187; qui d&#233;signe en g&#233;n&#233;ral la taille moyenne, mais qui ne signifie
pas dans le cas pr&#233;sent (comme dans le cas de &#8618;vivant&#8617;ppp&#8618;mort&#8617;) que la propri&#233;t&#233; ne s&#8217;applique pas.
C&#8217;est simplement qu&#8217;il existe ici une &quot;valeur neutre&quot; &#224; partir de laquelle les autres s&#8217;&#233;chelonnent.
En logique classique, on pourrait l&#8217;exprimer, si R est la propri&#233;t&#233; ayant la valeur de r&#233;f&#233;rence
(neutre ou m&#233;diane), par
</p>
<p>&#8704;xP(x)&#8658;&#172;Q(x)&#8743;R(x)
&#8704;xQ(x)&#8658;&#172;P(x)&#8744;R(x) &#8704;x&#172;Q(x) 6&#8658; P(x)
&#8704;x,R(x)&#8658;&#172;Q(x)&#8743;&#172;P(x) &#8704;x&#172;P(x) 6&#8658; Q(x)
</p>
<p>La valeur de r&#233;f&#233;rence peut ne pas &#234;tre la seule valeur possible, mais un des &#233;l&#233;ments remar-
quables de l&#8217;&#233;chelle (pour des propri&#233;t&#233;s multi-valu&#233;es par exemple). L&#8217;usage de termes gra-
dables implique toujours une &#233;valuation et donc une comparaison. Celle-ci peut &#234;tre explicite :
&#171; Jean est plus petit/grand que Pierre &#187;, &#171; il avance/recule &#187; (le terme moyen &#233;tant immobile1).
Elle peut aussi &#234;tre implicite et renvoyer &#224; des normes tacitement admises par l&#8217;individu ou la
communaut&#233; &#224; laquelle il appartient : &#171; il fait chaud &#187; dit par un habitant d&#8217;un pays &#233;quatorial ne
se r&#233;f&#232;rera pas &#224; la m&#234;me id&#233;e de chaleur (donc &#224; la m&#234;me valeur de r&#233;f&#233;rence) qu&#8217;un habitant
des fj&#246;rds de Norv&#232;ge.
</p>
<p>2.3 Antonymie duale
Les antonymes duals sont compos&#233;s de deux sous-familles : les antonymes conversifs et les
duals propres. Ils correspondent au troisi&#232;me type de sym&#233;trie, celui que l&#8217;usage et la nature
m&#234;me des objets peut introduire.
</p>
<p>2.3.1 Conversifs
Les conversifs (appel&#233;s aussi r&#233;ciproques) sont des couples tels que &#8618;mari&#8617;pppd &#8618;femme&#8617;, &#8618;ache-
ter&#8617;pppd &#8618;vendre&#8617;, &#8618;pr&#234;ter&#8617;pppd &#8618;emprunter&#8617;, &#8618;avant&#8617;pppd &#8618;apr&#232;s&#8617;, &#8618;p&#232;re&#8617;pppd &#8618;fils&#8617;. De nombreux linguistes com-
me Igor Mel&#8217;c&#780;huk (Mel&#8217;c&#780;uk et al., 1995) ne les consid&#232;rent pas comme des antonymes. La
fonction anti de son DEC d&#233;signe en r&#233;alit&#233; les antonymes compl&#233;mentaires et les antonymes
scalaires. Il d&#233;die aux conversifs une autre fonction lexicale conv. Cependant, dans la mesure
o&#249; pour nous, la mod&#233;lisation de l&#8217;antonymie correspond &#224; une &#233;tude compl&#233;te des m&#233;canismes
de sym&#233;trie, nous avons consid&#233;r&#233; les conversifs comme un cas particulier de sym&#233;trie, et les
avons naturellement associ&#233;s &#224; un processus antonymique &quot;&#233;tendu&quot;.
</p>
<p>Pierre est le p&#232;re de Marc &#8596; Marc est le fils de Pierre.
Ce qui s&#8217;exprime, en terme de logique, par :
</p>
<p>&#8704;x,yP(x,y)&#8596; Q(y,x)
1On peut remarquer que le neutre d&#8217;un type d&#8217;antonymie peut &#234;tre opposable dans une autre antonymie. Ici, par
</p>
<p>exemple, &#8618;mobile&#8617;pppc &#8618;immobile&#8617;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab, Mathieu Lafourcade et Violaine Prince
</p>
<p>Dans le cas des conversifs, si on remplace dans une phrase un terme x par son r&#233;ciproque y,
on peut syst&#233;matiquement r&#233;tablir la synonymie entre les deux phrases &#224; condition de permuter
les arguments syntaxiques mis en relation par x comme le montre la formule. Ainsi, pour les
conversifs, il y a sym&#233;trie par rapport &#224; la place des arguments (P est r&#233;ciproque de Q).
</p>
<p>2.3.2 Duals
Les duals propres sont une notion d&#8217;antonymie que nous introduisons pour rendre compte
d&#8217;un effet particulier de mise en relation de termes o&#249; la sym&#233;trie porte cette fois-ci sur des
fonctions culturelles (sym&#233;trie consacr&#233;e par l&#8217;usage) et spatio-temporelles (propri&#233;t&#233;s particu-
li&#232;res de l&#8217;espace-temps). Les duals sont des mots que la culture associe comme &#8618;soleil&#8617;pppd &#8618;lune&#8617;,
ou qui ne vont pas, &#224; priori, l&#8217;un sans l&#8217;autre comme &#8618;question&#8617;pppd &#8618;r&#233;ponse&#8617; ou alors sont l&#8217;ex-
pression d&#8217;une antonymie temporelle i.e. qui exprime le passage d&#8217;un &#233;tat &#224; un autre comme
&#8618;naissance&#8617;pppd &#8618;d&#233;c&#232;s&#8617;. Dans ce troisi&#232;me cas, on peut remarquer que ces deux &#233;v&#232;nements mar-
quent le passage entre deux antonymes compl&#233;mentaires (&#8618;inexistence&#8617;pppc&#8618;existence&#8617; dans le cas
de &#8618;naissance&#8617;pppd &#8618;d&#233;c&#232;s&#8617; ou bien &#8618;pr&#233;sence&#8617;pppc&#8618;absence&#8617; dans le cas de &#8618;d&#233;part&#8617;pppd &#8618;arriv&#233;e&#8617;). L&#8217;anto-
nymie duale propre pr&#233;sente naturellement une sym&#233;trie qui n&#8217;est pas relev&#233;e dans l&#8217;&#233;change
des places d&#8217;arguments puisqu&#8217;il s&#8217;agit de pr&#233;dicats unaires. Elle exprime le fait que si l&#8217;un des
deux pr&#233;dicats est vrai, il existe une valeur pour laquelle l&#8217;autre l&#8217;est aussi n&#233;cessairement. Pour
la mod&#233;liser, on &#233;crira :
</p>
<p>&#8707;x0 P(x0)&#8596;&#8707;Q, Q(x0)
</p>
<p>avec Q dual de P qui mod&#233;lise par exemple le fait que si x0 a un d&#233;but, alors il existe aussi une
fin &#224; x0 ou :
</p>
<p>&#8707;x0 P(x0)&#8596;&#8707;Q, &#8707;y0 Q(y0)
avec Q dual de P qui exprime que, si x est une question, il existe un objet y et il existe un
pr&#233;dicat r&#233;ponse, tel que y est une r&#233;ponse &#224; x.
</p>
<p>Cette n&#233;cessit&#233; du pr&#233;dicat dual peut rendre compte de certains couples de descripteurs tempo-
rels. Ainsi, &#8618;avant&#8617;pppd &#8618;apr&#232;s&#8617; en pr&#233;dicats unaires, sont linguistiquement diff&#233;renci&#233;s sur le plan
de la cat&#233;gorie grammaticale, comme dans &#171; il y a un avant et un apr&#232;s &#187; &#224; ne pas confondre
avec &#8618;avant&#8617;ppps&#8618;apr&#232;s&#8617; qui sont des scalaires avec comme valeur m&#233;diane &#8618;pendant&#8617;.
</p>
<p>3 Construction de listes d&#8217;antonymes
3.1 Probl&#233;matique
Dans le cadre de nos recherches sur la repr&#233;sentation du sens en TALN, notre mod&#232;le est bas&#233;
sur un apprentissage effectu&#233; &#224; partir de diverses sources comme des dictionnaires &#224; usage
humain, le Web, ou des dictionnaires de relations lexicales (Schwab et al., 2004). S&#8217;il existe
depuis quelques ann&#233;es pour le Fran&#231;ais des dictionnaires de synonymes sur le web (celui du
CRISCO2 mais aussi une partie d&#8217;EuroWordNet), les dictionnaires d&#8217;antonymes &#233;taient eux
inexistants. Seul, depuis quelques mois, le dictionnaire du CRISCO fournit des antonymes.
Toutefois, il ne consid&#232;re pas les diff&#233;rents types d&#8217;antonymies pr&#233;sent&#233;es dans la section 2.
C&#8217;est pourquoi, dans le but d&#8217;am&#233;liorer nos repr&#233;sentations nous avons cherch&#233; &#224; &#233;tudier des
m&#233;thodes qui nous permettraient de construire le plus automatiquement possible des listes de
couple d&#8217;antonymes class&#233;es suivant leur type. La m&#233;thode choisie va utiliser les oppositions
de nature morphologique entre les termes.
</p>
<p>2urlhttp ://elsap1.unicaen.fr/cgi-bin/cherches.cgi</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction semi-supervis&#233;e de couples d&#8217;antonymes gr&#226;ce &#224; leur morphologie
</p>
<p>3.2 Morphologie et antonymie
Depuis Charlemagne, l&#8217;habitude a &#233;t&#233; prise de cr&#233;er des termes &#224; partir de racines latines mais
aussi grecques (Walter, 1988). C&#8217;est pourquoi en fran&#231;ais il n&#8217;est pas rare de trouver des termes
dits populaires c&#8217;est-&#224;-dire ayant subi des d&#233;formations normales dans une langue (&#8618;m&#232;re&#8617;, &#8618;ciel&#8617;)
&#224; c&#244;t&#233; de termes dits savants qui eux sont directement construits &#224; partir de morph&#232;mes issus
du latin ou du grec (&#8618;maternel&#8617;, &#8618;c&#233;leste&#8617;).
Les morph&#232;mes sont les unit&#233;s minimales significatives qui constituent les mots. Par exemple,
le mot &#8220;fleurs&#8221; est compos&#233; de deux morph&#232;mes : le radical (ou base) correspondant &#224; l&#8217;item
&#8618;fleur&#8617; et le suffixe marquant le pluriel s. Il existe deux types de morph&#232;mes : (1) les morph&#232;mes
lexicaux qui correspondent aux items lexicaux ou &#224; une l&#233;g&#232;re variante ; (2) les morph&#232;mes
grammaticaux, autrement appel&#233;s affixes. Situ&#233;s avant le radical, un affixe est dit pr&#233;fixe, apr&#232;s,
suffixe, dans le radical, infixe.
Les morph&#232;mes sont porteurs de sens. Par exemple, le pr&#233;fixe latin bi- correspond &#224; deux
(&#8618;binaire&#8617;, &#8618;bisexuel&#8617;), le pr&#233;fixe latin semi- et le pr&#233;fixe grec h&#233;mi- &#224; une id&#233;e de milieu (&#8618;semi-
conducteur&#8617;, &#8618;semi-rigide&#8617;, &#8618;h&#233;misph&#232;re&#8617;) et le pr&#233;fixe grec p&#233;ri- &#224; &#8618;tour&#8617; (&#8618;p&#233;rim&#232;tre&#8617;, &#8618;p&#233;ricarde&#8617;).
De nombreux mots &quot;savants&quot; ont donc &#233;t&#233; (et sont encore) cr&#233;&#233;s &quot;de toute pi&#232;ce&quot; en utili-
sant des pr&#233;fixes ou des suffixes marquant une id&#233;e n&#233;gative par rapport &#224; la racine ou alors
provenant de mots oppos&#233;s en Latin, en Grec et aujourd&#8217;hui en Fran&#231;ais. Ce sont ces deux
types d&#8217;affixes que nous allons utiliser pour construire automatiquement des listes d&#8217;antonymes.
Ainsi, les pr&#233;fixes poly- (&#8618;plusieurs&#8617;) et mono- (&#8618;un&#8617;) s&#8217;opposent sur le nombre, hyper- (superla-
tif) et hypo- (au-dessous) s&#8217;opposent par rapport &#224; une valeur de r&#233;f&#233;rence tandis que non-
ou m&#233;s- marquent la n&#233;gation. Pour les suffixes, on remarquera l&#8217;opposition -phobeppp-phile
(&#8618;homophobe&#8617;ppp&#8618;homophile&#8617;) ou l&#8217;opposition -dynamiqueppp-statique (&#8618;hydrostatique&#8617;ppp&#8618;hydrodynami-
que&#8617;). Notre article n&#8217;&#233;tudie ici que les pr&#233;fixes mais la m&#233;thode choisie pour extraire les suffixes
est la m&#234;me.
</p>
<p>Il existe des &#233;tudes comme (B&#233;chade, 1992) sur les pr&#233;fixes du Fran&#231;ais et leur signification.
Elles permettent de faire une premi&#232;re &#233;tude du comportement des pr&#233;fixes mais ne permettent
pas de fa&#231;on rigoureuse d&#8217;opposer deux pr&#233;fixes et encore moins de chercher &#224; savoir de quel
type d&#8217;antonymie ils sont marqueurs. Ainsi, une v&#233;rification en corpus s&#8217;av&#232;re imp&#233;rative. C&#8217;est
pour cette raison que nous avons mis au point un processus semi-automatique de construction
de listes d&#8217;antonymes qui permet aussi d&#8217;extraire les pr&#233;fixes oppos&#233;s.
</p>
<p>4 Processus
4.1 Principe
Notre m&#233;thode est proche de celle utilis&#233;e par (Morin, 1999) pour l&#8217;acquisition de sch&#233;mas
lexico-syntaxiques mais elle s&#8217;en diff&#233;rencie sur deux points principaux :
</p>
<p>&#8211; Notre probl&#233;matique premi&#232;re n&#8217;est pas de r&#233;cup&#233;rer des morph&#232;mes oppos&#233;s mais bien de
construire, le plus automatiquement possible, des listes d&#8217;antonymes. Nous avons tout de
m&#234;me conserv&#233; les informations concernant ces pr&#233;fixes afin de savoir s&#8217;ils caract&#233;risent plus
particuli&#232;rement telle ou telle antonymie. Nous pr&#233;sentons ces r&#233;sultats dans la section 5.
</p>
<p>&#8211; Dans (Morin, 1999), les experts valident directement les sch&#233;mas. Ici, les sch&#233;mas sont va-
lid&#233;s indirectement si des couples d&#8217;items antonymes, caract&#233;ris&#233;s par ces sch&#233;mas, le sont.
Cette m&#233;thode semble augmenter le nombre de cas &#224; examiner mais il nous para&#238;t difficile
d&#8217;&#233;liminer des couples de pr&#233;fixes sans observer leur comportement. Un filtrage automatique
bas&#233; sur le nombre de couples valid&#233;s permet de limiter ces cas.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab, Mathieu Lafourcade et Violaine Prince
</p>
<p>La figure 1 pr&#233;sente le processus de construction de ces listes qui est compos&#233; de sept &#233;tapes.
La m&#233;thode utilisant les suffixes est identique.
</p>
<p>Fournir une liste
de couples d'items antonymes
</p>
<p>couples d'items lexicaux antonymes
</p>
<p>Extraire les couples qui
s'opposent par
ces pr&#233;fixes
</p>
<p>corpus
(liste d'items lexicaux)
</p>
<p>Extraire les pr&#233;fixes
par lesquels s'opposent
</p>
<p>ces items
</p>
<p>Valider les couples
d'items candidats et ainsi 
</p>
<p>les couple de pr&#233;fixes candidats
</p>
<p>Couples de pr&#233;fixes oppos&#233;s candidats
</p>
<p>Liste de couples d'items candidats
</p>
<p>1
</p>
<p>2
</p>
<p>3
</p>
<p>4
</p>
<p>Extraire de nouveaux couples
de pr&#233;fixes candidats
</p>
<p>couples d'items lexicaux oppos&#233;s
Couples de
</p>
<p>pr&#233;fixes oppos&#233;s
candidats
</p>
<p>5
</p>
<p>Filtrage des pr&#233;fixes candidats
</p>
<p>couples de pr&#233;fixes oppos&#233;s candidats
</p>
<p>6
</p>
<p>FIG. 1 &#8211; Processus d&#8217;acquisition de pr&#233;fixes et de termes antonymes.
</p>
<p>1. Fournir une liste de couples d&#8217;items lexicaux antonymes : cette liste peut &#234;tre fournie par
des dictionnaires ou bien sp&#233;cifi&#233;es manuellement. Elle va permettre d&#8217;avoir un noyau de
r&#233;f&#233;rence pour amorcer le processus.
</p>
<p>2. Extraire les pr&#233;fixes par lesquel s&#8217;opposent ces items : la m&#233;thode consiste &#224; enlever aux
mots le plus long suffixe commun aux deux. Ainsi, avec &#8618;monos&#233;mique&#8617; et &#8618;polys&#233;mique&#8617;,
on enl&#232;ve le suffixe s&#233;mique. On obtient ainsi une liste de couples de pr&#233;fixes candidats.
Ces deux premi&#232;res &#233;tapes sont facultatives. On peut directement fournir une liste de
pr&#233;fixes cens&#233;s s&#8217;opposer.
</p>
<p>3. Extraire les couples qui s&#8217;opposent par ces pr&#233;fixes : on extrait du corpus ces couples
d&#8217;items. On obtient ainsi une liste de couples d&#8217;items candidats.
</p>
<p>4. Valider les couples candidats : on v&#233;rifie manuellement les termes candidats et on ne
conserve que ceux qui sont effectivement des antonymes. Cette phase est r&#233;alis&#233;e par un
&quot;expert&quot;. Si au moins un des couples valid&#233;s est caract&#233;ris&#233; par un des couples de pr&#233;fixes
candidats, ce dernier est valid&#233;.
</p>
<p>5. Extraire des pr&#233;fixes candidats : parmi la liste des couples retenus, on extrait les suf-
fixes pour trouver dans la base de nouveaux pr&#233;fixes marquant l&#8217;opposition. Le principe
consiste &#224; sortir du corpus l&#8217;ensemble des termes ayant ce suffixe et d&#8217;extraire les pr&#233;fixes
de chacun.
</p>
<p>6. Filtrer les pr&#233;fixes candidats : il s&#8217;agit de ne retenir que les couples de pr&#233;fixes qui carac-
t&#233;risent au moins n couples d&#8217;items lexicaux dans le corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction semi-supervis&#233;e de couples d&#8217;antonymes gr&#226;ce &#224; leur morphologie
</p>
<p>Le choix de n est important puisque si n est grand, on &#233;limine un grand nombre de pr&#233;fixes
&#224; v&#233;rifier manuellement ce qui facilite la t&#226;che de l&#8217;expert mais ne garantit pas l&#8217;extraction
de l&#8217;ensemble des oppositions de pr&#233;fixes. En revanche, le choix d&#8217;un n trop petit multiplie le
nombre de couples &#224; v&#233;rifier et s&#8217;av&#232;re difficile &#224; concevoir (un choix de n = 2 sur la liste des
&quot;a&quot; privatifs entra&#238;ne la v&#233;rification de 3251 couples de pr&#233;fixes !). Notre choix s&#8217;est port&#233; sur
un compromis de n = 5 qui &#233;limine un nombre suffisant de candidats (Dans notre exp&#233;rience,
nous n&#8217;avons plus alors que 110 v&#233;rifications &#224; effectuer).
4.2 D&#233;roulement
Consid&#233;rons le corpus tr&#232;s r&#233;duit suivant : &#8618;acyclique&#8617;, &#8618;anticyclique&#8617;, &#8618;anticyclone&#8617;, &#8618;antimoine&#8617;,
&#8618;bis&#233;mique&#8617;, &#8618;biphonie&#8617;, &#8618;cyclique&#8617;, &#8618;moine&#8617;, &#8618;monophonie&#8617;, &#8618;monos&#233;mique&#8617;, &#8618;polyphonie&#8617;, &#8618;polys&#233;mique&#8617;,
&#8618;souris&#8617;. Du fait de la taille du corpus, ici n = 2.
</p>
<p>1. &#233;tape 1 : On prend une liste de couples que l&#8217;on consid&#232;re comme antonymes :
&#8618;monos&#233;mique&#8617;ppp&#8618;polys&#233;mique&#8617;, &#8618;acyclique&#8617;ppp&#8618;cyclique&#8617;
</p>
<p>2. &#233;tape 2 : On extrait les pr&#233;fixes par lesquels ces couples s&#8217;opposent :
mono-ppppoly-, a-ppp&#949;
</p>
<p>3. &#233;tape 3 : On extrait les couples qui s&#8217;opposent par ces pr&#233;fixes :
pour mono-ppppoly-, &#8618;monos&#233;mique&#8617;ppp&#8618;polys&#233;mique&#8617;, &#8618;monophonie&#8617;ppp&#8618;polyphonie&#8617;
pour a-ppp&#949;, &#8618;acyclique&#8617;ppp&#8618;cyclique&#8617;
</p>
<p>4. &#233;tape 4 : L&#8217;expert valide les paires extraites :
&#8618;monos&#233;mique&#8617;ppp&#8618;polys&#233;mique&#8617; et &#8618;acyclique&#8617;ppp&#8618;cyclique&#8617; sont valid&#233;es, les deux couples de
pr&#233;fixes sont valid&#233;s.
&#8618;monophonie&#8617;ppp&#8618;polyphonie&#8617; est rejet&#233;e, cela n&#8217;entra&#238;ne aucune cons&#233;quence sur la validit&#233;
des pr&#233;fixes.
</p>
<p>5. &#233;tape 5 : On extrait de nouveaux pr&#233;fixes candidats gr&#226;ce aux paires valid&#233;es et au corpus.
&#8618;monos&#233;mique&#8617;ppp&#8618;polys&#233;mique&#8617; poss&#232;dent en commun le suffixe s&#233;mique, on recherche dans
le corpus les termes qui ont cette m&#234;me caract&#233;ristique. On extrait ainsi &#8618;polys&#233;mique&#8617;,
&#8618;monos&#233;mique&#8617; et &#8618;bis&#233;mique&#8617;. En excluant l&#8217;opposition d&#233;j&#224; consid&#233;r&#233;e mono-ppppoly-, ces
couples de termes nous permettent comme nouveaux couples de pr&#233;fixes candidats mono-
pppbi- et polypppbi-. De m&#234;me, &#8618;acyclique&#8617;ppp&#8618;cyclique&#8617; permet d&#8217;obtenir anti-ppp&#949;
</p>
<p>6. &#233;tape 6 : On filtre les couples de pr&#233;fixes :
&#8211; mono-pppbi- appara&#238;t dans deux couples (&#8618;monos&#233;mique&#8617;ppp&#8618;bis&#233;mique&#8617;, &#8618;monophonie&#8617;ppp&#8618;bi-
</p>
<p>phonie&#8617;), il est donc conserv&#233;.
&#8211; polypppbi-, en revanche, n&#8217;appara&#238;t qu&#8217;une fois dans le corpus, il est donc supprim&#233;. Dans
</p>
<p>notre exp&#233;rience, ces pr&#233;fixes candidats n&#8217;ont pas &#233;t&#233; rejet&#233;s par le filtrage automatique
mais par les experts qui ont invalid&#233; les dix couples d&#8217;items extraits pour ce couple de
pr&#233;fixes. Il ne semble donc pas y avoir d&#8217;exception pour les pr&#233;fixes bi- (marquant une
id&#233;e de &#8618;deux&#8617;) et poly (marquant une id&#233;e de &#8618;plusieurs&#8617;) dont les id&#233;es sont incluses
l&#8217;une dans l&#8217;autre.
</p>
<p>&#8211; anti-ppp&#949; appara&#238;t lui dans trois couples &#8618;cyclone&#8617;ppp&#8618;anticyclone&#8617;, &#8618;cyclique&#8617;ppp&#8618;anticyclique&#8617;
et &#8618;moine&#8617;ppp&#8618;antimoine&#8617;. En pratique la validation ne cherche bien s&#251;r pas tous les couples
et s&#8217;arr&#234;te d&#232;s qu&#8217;elle en a trouv&#233; deux.
</p>
<p>On r&#233;it&#232;re l&#8217;&#233;tape 3
7. &#233;tape 3 : On extrait les couples qui s&#8217;opposent par ces pr&#233;fixes :
</p>
<p>pour mono-pppbi-, &#8618;monos&#233;mique&#8617;ppp&#8618;bis&#233;mique&#8617;, &#8618;monophonie&#8617;ppp&#8618;biphonie&#8617;
pour anti-ppp&#949;, &#8618;cyclone&#8617;ppp&#8618;anticyclone&#8617;, &#8618;cyclique&#8617;ppp&#8618;anticyclique&#8617; et &#8618;moine&#8617;ppp&#8618;antimoine&#8617;.
</p>
<p>8. &#233;tape 4 : L&#8217;expert valide les paires extraites :
&#8618;monos&#233;mique&#8617;ppp&#8618;bis&#233;mique&#8617;, &#8618;monophonie&#8617;ppp&#8618;biphonie&#8617; &#8618;cyclone&#8617;ppp&#8618;anticyclone&#8617;, et &#8618;cyclique&#8617;ppp&#8618;an-
ticyclique&#8617; sont valid&#233;es, les couples de pr&#233;fixes mono-pppbi- et anti-ppp&#949; sont valid&#233;s.
&#8618;moine&#8617;ppp&#8618;antimoine&#8617; est rejet&#233;e, cela n&#8217;entra&#238;ne aucune cons&#233;quence sur la validit&#233; des pr&#233;-
fixes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab, Mathieu Lafourcade et Violaine Prince
</p>
<p>9. &#233;tape 5 : On cherche &#224; extraire de nouveaux pr&#233;fixes candidats gr&#226;ce aux paires valid&#233;es
et au corpus.
Il n&#8217;y en a plus, le processus s&#8217;arr&#234;te.
</p>
<p>5 R&#233;sultats
Le corpus que nous avons utilis&#233; est constitu&#233; de 79 220 items lexicaux issus de notre base
lexicale s&#233;mantique (Schwab et al., 2004). Ces termes correspondent globalement aux entr&#233;es
hors noms propres de dictionnaires sous forme &#233;lectronique : dictionnaires classiques (Larousse,
2004) (Robert, 2000), dictionnaires de synonymes (CRISCO3), th&#233;saurus (Larousse, 1992).
Lors de cette exp&#233;rience, pour de simples raisons pratiques, les auteurs de cette publication ont
jou&#233; le r&#244;le d&#8217;expert validateur. On peut estimer le temps de r&#233;alisation de l&#8217;exp&#233;rience &#224; une
cinquantaine d&#8217;heures utilis&#233;es &#224; plus de 99% par la phase de validation (&#233;tape 4).
Cette m&#233;thode nous a permis d&#8217;extraire 49 couples de pr&#233;fixes oppos&#233;s. Le tableau de la figure
2 en pr&#233;sente quelques uns.
</p>
<p>pr&#233;fixe 1 pr&#233;fixe 2 exemple contre-exemple
a- &#949; &#8618;chromatique&#8617;ppp&#8618;achromatique&#8617; &#8618;afin&#8617;6ppp&#8618;fin&#8617;
</p>
<p>an- &#949; &#8618;a&#233;robie&#8617;ppp&#8618;ana&#233;robie&#8617; &#8618;anatomiste&#8617;6ppp&#8618;atomiste&#8617;
anti- &#949; &#8618;communiste&#8617;ppp&#8618;anticommuniste&#8617; &#8618;moine&#8617;6ppp&#8618;antimoine&#8617;
d&#233;s- &#949; &#8618;accord&#8617;ppp&#8618;d&#233;saccord&#8617; &#8618;avouer&#8617;6ppp&#8618;d&#233;savouer&#8617;
in- &#949; &#8618;imaginable&#8617;ppp&#8618;inimaginable&#8617; &#8618;incas&#8617;6ppp&#8618;cas&#8617;
il- &#949; &#8618;licite&#8617;ppp&#8618;illicite&#8617; &#8618;illustre&#8617;6ppp&#8618;lustre&#8617;
</p>
<p>pr&#233;- post- &#8618;pr&#233;face&#8617;ppp&#8618;postface&#8617; &#949;
hyper- hypo- &#8618;hyperonymie&#8617;ppp&#8618;hyponymie&#8617; &#8618;hyperstatique&#8617;6ppp&#8618;hypostatique&#8617;
syno- anto- &#8618;synonymie&#8617;ppp&#8618;antonymie&#8617; &#949;
m&#233;ro- holo- &#8618;m&#233;ronymie&#8617;ppp&#8618;holonymie&#8617; &#949;
mono- poly- &#8618;polys&#233;mique&#8617;ppp&#8618;monos&#233;mique&#8617; &#8618;monophonie&#8617;6ppp&#8618;polyphonie&#8617;
mono- st&#233;r&#233;o &#8618;monophonie&#8617;ppp&#8618;st&#233;r&#233;ophonie&#8617; &#8618;monotype&#8617;6ppp&#8618;st&#233;r&#233;otype&#8617;
</p>
<p>FIG. 2 &#8211; Exemples de pr&#233;fixes antonymes extraits
</p>
<p>La figure 3 pr&#233;sente le pourcentage de paires valid&#233;es par l&#8217;expert, c&#8217;est-&#224;-dire le nombre de
paires consid&#233;r&#233;es comme valides pour chaque couple de pr&#233;fixes antonymes candidats. On
peut constater que si le taux de validation est tr&#232;s important pour la plupart des couples de
pr&#233;fixes il est, en revanche, tr&#232;s faible pour le a privatif (a- et an-).
Finissons par la typologie des paires d&#8217;antonymes extraites. La figure 4 pr&#233;sente les r&#233;sultats
obtenus. On constate que globalement la morphologie permet de relativement bien conna&#238;tre le
type d&#8217;antonymie. Ainsi, on peut donner quelques indications sur les couple de pr&#233;fixes suivant
leur s&#233;mantique :
</p>
<p>&#8211; temporels (ant&#233;-ppp&#949;, post-ppp&#949;, ant&#233;-ppppost-, pr&#233;-ppppost-) : Tous sont scalaires sauf le couple
dual &#8618;christ&#8617;pppd &#8618;ant&#233;christ&#8617;. La d&#233;finition de (Larousse, 2004) nous donne &#171; Imposteur qui, sui-
vant l&#8217;Apocalypse, doit venir quelque temps avant la fin du monde pour essayer d&#8217;&#233;tablir une
religion oppos&#233;e &#224; celle de J&#233;sus-Christ. &#187;. Dans ce cas, l&#8217;opposition s&#233;mantique s&#8217;explique
</p>
<p>3urlhttp ://elsap1.unicaen.fr/cgi-bin/cherches.cgi</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction semi-supervis&#233;e de couples d&#8217;antonymes gr&#226;ce &#224; leur morphologie
</p>
<p>pr&#233;fixe 1 pr&#233;fixe 2 nombre de nombre de nombre de paires pourcentage
paires extraites paires valid&#233;es invalid&#233;es
</p>
<p>a- &#949; 288 71 217 24,6%
an- &#949; 61 15 41 24,6%
</p>
<p>anti- &#949; 156 147 9 94,2%
d&#233;s- &#949; 195 179 16 91,7%
in- &#949; 616 539 77 87,5%
il- &#949; 31 18 13 58%
</p>
<p>ant&#233;- &#949; 15 10 5 80%
post- &#949; 37 33 4 89%
ant&#233;- post- 3 2 1 66,6%
pr&#233;- post- 11 11 0 100%
</p>
<p>hyper- hypo- 25 24 1 96%
syno- anto- 4 4 0 100%
m&#233;ro- holo- 2 2 0 100%
mono- poly- 28 25 3 89,2%
mono- st&#233;r&#233;o- 5 4 1 80%
</p>
<p>FIG. 3 &#8211; Extraits des r&#233;sultats d&#8217;extraction
</p>
<p>par l&#8217;opposition &#8618;dieu&#8617;ppp&#8618;d&#233;mon&#8617; tandis que la construction de l&#8217;opposition morphologique ex-
prime l&#8217;id&#233;e de l&#8217;arriv&#233;e du d&#233;mon avant le retour du christ.
</p>
<p>&#8211; m&#233;dicaux (hyper-ppphypo-) : Ils caract&#233;risent des mesures qui sont donc au-dessus ou au-
dessous de la normale (&#8618;hyperthyro&#239;die&#8617;ppp&#8618;hypothyro&#239;die&#8617;).
</p>
<p>&#8211; nombre (bi-ppp&#949;, tri-ppp&#949;, mono-ppppoly-, mono-pppst&#233;r&#233;o-) : Ils s&#8217;opposent par une propri&#233;t&#233; pos-
s&#233;d&#233;e une fois (mono) ou plusieurs (bi-, tri-, poly, st&#233;r&#233;o-). Ils sont compl&#233;mentaires.
</p>
<p>&#8211; absence de propri&#233;t&#233; : il-ppp&#949; (&#8618;illicite&#8617;ppp&#8618;licite&#8617;, &#8618;illimit&#233;&#8617;ppp&#8618;limit&#233;&#8617;), a-ppp&#949; (&#8618;typique&#8617;ppp&#8618;atypique&#8617;,
&#8618;sociabilit&#233;&#8617;ppp&#8618;asociabilit&#233;&#8617;), an-ppp&#949; (&#8618;anenc&#233;phale&#8617;ppp&#8618;enc&#233;phale&#8617;) ils sont tous compl&#233;mentaires
sauf &#8618;anion&#8617;ppp&#8618;ion&#8617; qui rel&#232;ve plut&#244;t de l&#8217;antonymie duale.
</p>
<p>&#8211; opposition culturelle ou produit permettant de lutter contre quelque chose : anti-ppp (&#8618;anticl&#233;ri-
cal&#8617;ppp&#8618;cl&#233;rical&#8617;, &#8618;antiviral&#8617;ppp&#8618;viral&#8617;). Ils sont duals.
</p>
<p>6 Conclusion
Dans cet article, nous avons pr&#233;sent&#233; la m&#233;thode semi-supervis&#233;e qui nous a permis de cons-
truire le plus efficacement possible trois listes de couples d&#8217;antonymes, chacune correspondant &#224;
un des trois types : compl&#233;mentaire, scalaire et dual. Cette m&#233;thode est bas&#233;e sur les oppositions
de nature morphologique qui peuvent exister entre les items lexicaux et utilise un corpus consti-
tu&#233; des entr&#233;es de notre base lexicale. &#192; partir d&#8217;un premier ensemble de couples antonymes,
cette m&#233;thode permet &#224; la fois de construire ces listes et de trouver de nouveaux couples de pr&#233;-
fixes antonymes. Nous avons ainsi pu &#233;tudier la distribution des diff&#233;rents types d&#8217;antonymie
en fonction du couple de pr&#233;fixe.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab, Mathieu Lafourcade et Violaine Prince
</p>
<p>pr&#233;fixe 1 pr&#233;fixe 2 compl&#233;mentaires scalaires duals
a- &#949; 71 (100 %)
</p>
<p>an- &#949; 14 ( 92,8%) 1 ( 7,2%)
anti- &#949; 147 (100 %)
d&#233;s- &#949; 3 (1,6 %) 176 (98,3 %)
in- &#949; 539 (100 %)
il- &#949; 18 (100%)
</p>
<p>ant&#233;- &#949; 9 (90%) 1 (10%)
post- &#949; 23 (100 %)
ant&#233;- post- 2 (100%)
pr&#233;- post- 11 (100%)
</p>
<p>hyper- hypo- 24 (100 %
mono- poly- 25 (100%)
mono- st&#233;r&#233;o- 4 (100 %)
</p>
<p>FIG. 4 &#8211; R&#233;partition des sch&#233;mas suivant le type
</p>
<p>R&#233;f&#233;rences
</p>
<p>Herv&#233; B&#201;CHADE. Phon&#233;tique et morphologie du fran&#231;ais moderne et contemporain. Presses
Universitaires de France, 1992.
LAROUSSE, Th&#233;saurus Larousse - des id&#233;es aux mots, des mots aux id&#233;es. Larousse, 1992.
LAROUSSE, Le Petit Larousse Illustr&#233; 2004. Larousse, 2004.
Igor MEL&#8217; &#711;CUK, Andr&#233; CLAS, et Alain POLGU&#200;RE. Introduction &#224; la lexicologie explicative
et combinatoire. Duculot, 1995.
Emmanuel MORIN. &#171; Extraction de liens s&#233;mantiques entre termes &#224; partir de corpus tech-
niques &#187;. Th&#232;se de doctorat, Universit&#233; de Nantes, 1999.
Alain POLGU&#200;RE. Lexicologie et s&#233;mantique lexicale. Les Presses de l&#8217;Universit&#233; de Mont-
r&#233;al, 2003.
Le ROBERT, Le Nouveau Petit Robert, dictionnaire alphab&#233;tique et analogique de la langue
fran&#231;aise. &#201;ditions Le Robert, 2000.
Didier SCHWAB, Mathieu LAFOURCADE, et Violaine PRINCE. &#171; Vers l&#8217;apprentissage automa-
tique, pour et par les vecteurs conceptuels, de fonctions lexicales. L&#8217;exemple de l&#8217;antonymie &#187;.
Dans les actes de TALN 2002, volume 1, Nancy, Juin 2002.
Didier SCHWAB, Mathieu LAFOURCADE, et Violaine PRINCE. &#171; Hypoth&#232;ses pour la construc-
tion et l&#8217;exploitation conjointe d&#8217;une base lexicale s&#233;mantique bas&#233;e sur les vecteurs concep-
tuels &#187;. Dans les actes de JADT 2004, Louvain-La-Neuve, Belgique, Mars 2004.
Henriette WALTER. Le Fran&#231;ais dans tous les sens. Livre de poche, 1988.</p>

</div></div>
</body></html>