<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Direkt Profil : un syst&#232;me d'&#233;valuation de textes d'&#233;l&#232;ves de fran&#231;ais langue &#233;trang&#232;re fond&#233; sur les itin&#233;raires d'acquisition</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Direkt Profil : un syst&#232;me d&#8217;&#233;valuation de textes d&#8217;&#233;l&#232;ves 
de fran&#231;ais langue &#233;trang&#232;re fond&#233; sur les itin&#233;raires 
</p>
<p>d&#8217;acquisition 
</p>
<p>Jonas Granfeldt (1), Pierre Nugues (2), Emil Persson (1), Lisa Persson (2), 
Fabian Kostadinov (3), Malin &#197;gren (1), Suzanne Schlyter (1) 
</p>
<p>(1) Institut des langues romanes &#8211; Universit&#233; de Lund 
Box 201, S-221 00 Lund, Su&#232;de 
</p>
<p>{Jonas.Granfeldt, Malin.Agren, Suzanne.Schlyter}@rom.lu.se, 
emil.person@telia.com 
</p>
<p>(2) Institut d&#8217;informatique &#8211; Universit&#233; de Lund 
Box 118, S-221 00 Lund, Su&#232;de 
</p>
<p>Pierre.Nugues@cs.lth.se, nossrespasil@hotmail.com 
(3) Institut d&#8217;informatique &#8211; Universit&#233; de Zurich 
</p>
<p>fabian.kostadinov@access.unizh.ch 
</p>
<p>Mots-cl&#233;s : fran&#231;ais langue &#233;trang&#232;re, itin&#233;raires d&#8217;acquisition, &#233;valuation, annotation, 
analyse syntaxique partielle 
Keywords: second language French, developmental sequences, evaluation, annotation, 
partial parsing 
</p>
<p>R&#233;sum&#233; : Direkt Profil est un analyseur automatique de textes &#233;crits en fran&#231;ais comme 
langue &#233;trang&#232;re. Son but est de produire une &#233;valuation du stade de langue des &#233;l&#232;ves sous la 
forme d&#8217;un profil d&#8217;apprenant. Direkt Profil r&#233;alise une analyse des phrases fond&#233;e sur des 
itin&#233;raires d&#8217;acquisition, i.e. des ph&#233;nom&#232;nes morphosyntaxiques locaux li&#233;s &#224; un 
d&#233;veloppement dans l&#8217;apprentissage du fran&#231;ais. L&#8217;article pr&#233;sente les corpus que nous 
traitons et d&#8217;une fa&#231;on sommaire les itin&#233;raires d&#8217;acquisition. Il d&#233;crit ensuite l&#8217;annotation 
que nous avons d&#233;finie, le moteur d&#8217;analyse syntaxique et l&#8217;interface utilisateur. Nous 
concluons par les r&#233;sultats obtenus jusqu&#8217;ici : sur le corpus de test, le syst&#232;me obtient un 
rappel de 83% et une pr&#233;cision de 83% 
</p>
<p>Abstract: Direkt Profil is an automatic analyzer of texts written in French as a second 
language. The objective is to produce an evaluation of the development stage of the students 
under the form of a learner profile. Direkt Profil carries out a sentence analysis based on 
developmental sequences, i.e. local morphosyntactic phenomena linked to a development in 
the learning of French. The paper presents the corpus that we use and briefly, the 
developmental sequences. Furthermore, it describes the annotation that we have defined, the 
parser, and the user interface. We conclude by the results obtained so far: on the test corpus 
the systems obtains a recall of 83% and a precision of 83%. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas Granfeldt, Pierre Nugues, Emil Persson, Lisa Persson, Fabian Kostadinov, Malin 
&#197;gren, Suzanne Schlyter 
</p>
<p> 
</p>
<p>1 Introduction 
Les syst&#232;mes d&#8217;&#233;valuation des comp&#233;tences linguistiques et d&#8217;apprentissage des langues 
assist&#233; par ordinateur (ALAO) ont peu recours aux techniques de traitement automatique des 
langues (TAL). Les applications commerciales existantes produisent des exercices dont la 
correction d&#233;pend de techniques de reconnaissance de forme. Ces techniques limitent non 
seulement la qualit&#233; et la nature du feedback, mais elles restreignent aussi les types d&#8217;activit&#233;s 
possibles. Nous pr&#233;sentons ici un syst&#232;me r&#233;alisant une analyse automatique de textes 
produits librement. Il est fond&#233; sur l&#8217;&#233;tude de l&#8217;acquisition des langues &#233;trang&#232;res &#224; l&#8217;&#226;ge 
adulte. Pour analyser les phrases, nous avons cr&#233;&#233; un sch&#233;ma d&#8217;annotation des textes, 
construit un analyseur syntaxique et d&#233;velopp&#233; un ensemble de r&#232;gles. 
</p>
<p>L&#8217;interface du programme est con&#231;ue pour que les enseignants ou les chercheurs puissent 
copier des textes &#233;crits par des apprenants et les soumettre &#224; l&#8217;analyseur. Le programme 
identifie les structures caract&#233;ristiques du d&#233;veloppement grammatical du fran&#231;ais et affiche 
les r&#233;sultats &#224; l&#8217;utilisateur. Le premier objectif de Direkt Profil est d&#8217;&#234;tre un outil dans la 
recherche des stades de d&#233;veloppement du fran&#231;ais &#233;crit en identifiant des telles structures. &#192; 
plus long terme, le but du syst&#232;me est de produire une &#233;valuation des textes d&#8217;&#233;l&#232;ves en 
fran&#231;ais sous la forme d&#8217;un profil d&#8217;apprenant. 
</p>
<p>2 Le corpus CEFLE de Lund 
Pour le d&#233;veloppement et l&#8217;&#233;valuation de notre syst&#232;me, nous avons utilis&#233; le corpus CEFLE 
de Lund (&#171; Corpus &#201;crit de Fran&#231;ais Langue &#201;trang&#232;re de Lund &#187;). Ce corpus contient 
environ 100 000 mots (&#197;gren, 2005). Les textes qui le composent sont des r&#233;cits de longueur 
et de niveaux vari&#233;s. Nous l&#8217;avons rassembl&#233; en demandant &#224; 85 lyc&#233;ens su&#233;dois et &#224; 22 
jeunes Fran&#231;ais de raconter par &#233;crit, entre autres, l&#8217;histoire &#233;voqu&#233;e par les images de la 
Figure 1. Le but du syst&#232;me &#233;tant d&#8217;analyser le fran&#231;ais langue &#233;trang&#232;re, nous avons utilis&#233; 
les textes des Fran&#231;ais comme groupe de contr&#244;le. 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1 : Voyage en Italie. 
</p>
<p>Le r&#233;cit qui suit est un exemple provenant d&#8217;une apprenante d&#233;butante : 
</p>
<p>Elles sont deux femmes. Elles sont a italie au une vacanse. Mais L&#8217;Auto est tr&#232;s petite. 
Elles va a Italie. Au l&#8217;hothel elles demande une chambre. Un homme a le cl&#233;. Le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Direkt Profil : un syst&#232;me d&#8217;&#233;valuation de textes d&#8217;&#233;l&#232;ves de fran&#231;ais langue &#233;trang&#232;re fond&#233; 
sur les itin&#233;raires d&#8217;acquisition 
</p>
<p>chambre est grande avec deux lies. Il fait chaud. C&#8217;est noir. Cette deux femmes est a une 
restaurang. Dans une bar cet deux hommes. Ils amour les femmes. Ils parlons dans la 
bar. Ils ont tres bien. Le homme et la femme participat a un sightseeing dans la Rome. Ils 
achetons une robe. La robe est verte. La femme et l&#8217;homme reste au un banqe. Ils c&#8217;est 
amour. La femme et l&#8217;homme est au une ristorante. es hommes va avec les femmes. 
L&#8217;auto est petite. 
</p>
<p>Ce texte contient un certain nombre de constructions caract&#233;ristiques : parataxe, ordre des 
mots tr&#232;s simple, absence de pronoms objets, des formes verbales de base, fautes d&#8217;accord 
verbal et nominal, de genre, orthographe. Les travaux sur l&#8217;acquisition d&#8217;une langue &#233;trang&#232;re 
ont montr&#233; que ces constructions (et d&#8217;autres) apparaissent avec une certaine syst&#233;maticit&#233; 
selon le stade linguistique de l&#8217;apprenant. Ils permettent de d&#233;crire le d&#233;veloppement de 
grammaires d&#8217;apprenants sous la forme d&#8217;itin&#233;raires d&#8217;acquisition. Le corpus contient les 
textes bruts annot&#233;s avec leur stade de d&#233;veloppement (Tableau 1). 
</p>
<p>3 Direkt Profil et d&#8217;autres syst&#232;mes 
Direkt Profil est un analyseur de textes &#233;crits en fran&#231;ais comme langue &#233;trang&#232;re. Il repose 
sur les constructions linguistiques des itin&#233;raires d&#8217;acquisition. Nous avons &#233;tabli une 
description syst&#233;matique de ces itin&#233;raires sous la forme d&#8217;une annotation et l&#8217;objectif du 
syst&#232;me est de les d&#233;tecter automatiquement. L&#8217;analyseur parcourt le texte d&#8217;un apprenant en 
annotant et calculant les occurrences d&#8217;un ph&#233;nom&#232;ne particulier dans ses formes diverses. Le 
r&#233;sultat est un profil de texte bas&#233; sur ces crit&#232;res et, &#233;ventuellement, une indication du niveau 
du texte. L&#8217;interface pr&#233;sente les r&#233;sultats &#224; l&#8217;utilisateur en visualisant par des couleurs 
diff&#233;rentes les structures qu&#8217;il a d&#233;tect&#233;es. Il est important de souligner que le syst&#232;me n&#8217;est 
pas un correcteur. 
</p>
<p>La plupart des outils informatiques relevant du domaine ont pour but d&#8217;aider &#224; la r&#233;daction. Ils 
identifient et parfois corrigent des fautes d&#8217;orthographe et des erreurs de grammaire. La lign&#233;e 
de programmes aboutissant &#224; PLNLP (Jensen et al. 1993) et NLPWin (Heidorn 2000) est 
l&#8217;une des r&#233;alisations les plus notables. Le correcteur grammatical de PLNLP op&#232;re une 
analyse syntaxique compl&#232;te. Il a &#233;t&#233; cr&#233;&#233; pour l&#8217;anglais et appliqu&#233; ensuite &#224; d&#8217;autres langues 
dont le fran&#231;ais. Il utilise des r&#232;gles syntagmatiques binaires et prend en compte des relations 
de d&#233;pendance. PLNLP s&#8217;adresse essentiellement, mais non exclusivement, &#224; des utilisateurs 
r&#233;digeant dans leur langue maternelle. 
</p>
<p>D&#8217;autres syst&#232;mes rel&#232;vent de l&#8217;enseignement des langues assist&#233; par ordinateur (ELAO) tels 
que FreeText (Granger et al., 2001) pour le fran&#231;ais et Granska (Bigert et al. 2004) pour le 
su&#233;dois. FreeText se place dans une approche communicative &#224; l&#8217;apprentissage des langues. Il 
utilise un analyseur syntaxique chomskyen pour le fran&#231;ais. En cas d&#8217;&#233;chec, il op&#232;re &#224; un 
rel&#226;chement de contraintes, par exemple sur les accords, pour diagnostiquer une erreur. 
Granska, &#224; la diff&#233;rence de FreeText, r&#233;alise une analyse syntaxique partielle. Les auteurs 
justifient ce type d&#8217;analyse par une robustesse qu&#8217;ils jugent sup&#233;rieure et qui permet 
d&#8217;accepter plus facilement des phrases incorrectes. 
</p>
<p>4 Une m&#233;thode d&#8217;analyse fond&#233;e sur les itin&#233;raires d&#8217;acquisition 
du langage 
</p>
<p>Les syst&#232;mes actuels diff&#232;rent en ce qui concerne le type d&#8217;analyse op&#233;r&#233;e : analyse compl&#232;te 
ou partielle de la phrase. L&#8217;analyse compl&#232;te et la correction d&#8217;erreurs sont difficilement </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas Granfeldt, Pierre Nugues, Emil Persson, Lisa Persson, Fabian Kostadinov, Malin 
&#197;gren, Suzanne Schlyter 
</p>
<p> 
</p>
<p>applicables aux textes d&#8217;apprenants de (tr&#232;s) bas niveau linguistique parce que le nombre de 
mots inconnus et de phrases incorrectes y sont tr&#232;s souvent &#233;lev&#233;s. 
</p>
<p>Dans notre corpus de test de 6 842 mots, la distribution des mots inconnus et de phrases 
incorrectes &#233;tait la suivante. Au Stade 1, pr&#232;s de 100 % des phrases sont incorrectes (98,9 %) 
et 24,7 % des mots sont inconnus1,2. &#192; ce stade, toute analyse compl&#232;te des phrases nous 
semble tr&#232;s difficile. En revanche, dans le groupe de contr&#244;le les chiffres correspondants sont 
de 32,7 % pour les phrases incorrectes et de 10,6% pour les mots inconnus. La Figure 2 
montre aussi que la seule quantification des mesures de &#171; mots inconnus &#187; et &#171; phrases 
incorrectes &#187; est insuffisante pour d&#233;finir le niveau linguistique des textes des apprenants. Les 
apprenants du Stade 3 produisent moins de phrases incorrectes que les apprenants du Stade 4 
(70,5% vs. 80,2%). De plus, le pourcentage de mots inconnus chez le groupe de contr&#244;le 
(natifs) est l&#233;g&#232;rement sup&#233;rieur &#224; celui des apprenants du Stade 4 (10,6% vs. 10,4%) cf. note 
1 sur la d&#233;finition du mot inconnu utilis&#233; ici. Ainsi, le simple calcul des erreurs ne suffit pas 
pour distinguer les apprenants entre eux et les apprenants des natifs. La distinction des 
apprenants de diff&#233;rents niveaux linguistiques n&#233;cessite des analyses plus d&#233;taill&#233;es et des 
mesures plus fines. C&#8217;est exactement l&#8217;objet des itin&#233;raires d&#8217;acquisition et de l&#8217;analyse de 
Direkt Profil. 
</p>
<p>Mots inconnus et phrases incorrectes
</p>
<p>0,0%
</p>
<p>10,0%
</p>
<p>20,0%
</p>
<p>30,0%
</p>
<p>40,0%
</p>
<p>50,0%
</p>
<p>60,0%
</p>
<p>70,0%
</p>
<p>80,0%
</p>
<p>90,0%
</p>
<p>100,0%
</p>
<p>Stade 1 Stade 2 Stade 3 Stade 4 Groupe de contr&#244;le
</p>
<p>%
</p>
<p>Mots inconnus (%)
Phrases incorrectes (%)
</p>
<p> 
</p>
<p>Figure 2. Les mots inconnus et phrases incorrectes dans le corpus de test. 
</p>
<p>                                                
</p>
<p>1
 Est d&#233;fini comme &#171; mot inconnu &#187; un mot qui dans sa forme actuelle n&#8217;appara&#238;t pas dans le lexique employ&#233; 
</p>
<p>par le syst&#232;me (en l&#8217;occurrence le lexique de l&#8217;ABU CNAM, voir ci-dessous). 
2
 Est d&#233;finie comme &#171; phrase incorrecte &#187; : toute phrase qui contient ou moins une erreur orthographique, 
</p>
<p>syntaxique, morphologique ou s&#233;mantique. Pour le niveau de la s&#233;mantique, un crit&#232;re d&#8217;interpr&#233;tation &#233;tait 
utilis&#233; : une phrase &#233;tait consider&#233;e s&#233;mantiquement incorrecte si elle n&#8217;avait aucun sens. Les phrases 
syntaxiquement etc correctes mais s&#233;mantiquement non appropri&#233;es dans le contexte (par exemple par 
rapport aux images, cf. section 2) &#233;taient jug&#233;es correctes. De plus, aucune &#233;valuation du choix de mots ou du 
registre des mots n&#8217;a &#233;t&#233; faite. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Direkt Profil : un syst&#232;me d&#8217;&#233;valuation de textes d&#8217;&#233;l&#232;ves de fran&#231;ais langue &#233;trang&#232;re fond&#233; 
sur les itin&#233;raires d&#8217;acquisition 
</p>
<p>4.1 Les itin&#233;raires d&#8217;acquisition 
</p>
<p>La diff&#233;rence la plus importante entre Direkt Profil et les autres syst&#232;mes actuels est la 
m&#233;thode sur laquelle se fonde l&#8217;analyse. Direkt Profil r&#233;alise une analyse des ph&#233;nom&#232;nes 
locaux qui se sont av&#233;r&#233;s li&#233;s &#224; un d&#233;veloppement dans l&#8217;apprentissage du fran&#231;ais. Ces 
ph&#233;nom&#232;nes sont d&#233;crits sous forme d&#8217;itin&#233;raires d&#8217;acquisition. Les itin&#233;raires sont le r&#233;sultat 
d&#8217;observations empiriques montrant que certaines constructions grammaticales sont acquises 
et peuvent &#234;tre produites dans la langue parl&#233;e spontan&#233;e dans un ordre fixe. Cet ordre a aussi 
&#233;t&#233; nomm&#233; &#171; ordre naturel &#187;, en anglais &#171; natural order &#187;. 
</p>
<p>Clahsen et al. (1983) ainsi que Pienemann &amp; Johnston, (1987) ont &#233;tabli des itin&#233;raires 
d&#8217;acquisition pour allemand et l&#8217;anglais parl&#233;. Pour le fran&#231;ais parl&#233;, Schlyter (2003) et 
Bartning et Schlyter (2004) proposent 6 stades de d&#233;veloppement et des itin&#233;raires 
d&#8217;acquisition couvrant plus de 20 ph&#233;nom&#232;nes locaux. Ces ph&#233;nom&#232;nes morphosyntaxiques 
sont d&#233;crits sous la forme de structures locales &#224; l&#8217;int&#233;rieur du domaine verbal ou nominal. Le 
Tableau 1 en pr&#233;sente un sous-ensemble. 
</p>
<p>Ph
. 
</p>
<p>Stades 1 2 3 4 5 6 
A. &#201;nonc&#233;s contenant un 
</p>
<p>verbe 
20-40% 30-40% 50% 60% 70% 75% 
</p>
<p>B. 
Formes conjugu&#233;es 
(Types de verbes en 
opposition) 
</p>
<p>Pas 
d&#8217;opposition 10-20% 50% 75-100% + + 
</p>
<p>C. 
Formes conjugu&#233;es 
(je parle) vs. (*je 
parlE) (% 
occurrences) 
</p>
<p>50% - 75% 70-80% 80-90% 90-98% + + 
</p>
<p>D. 1-2-3 pers singulier (&#234;tre/avoir) 
</p>
<p> est, a, va  
</p>
<p>formule sans 
opposition: 
j&#8217;ai/ c&#8217;est 
</p>
<p>opposition 
(ex. j&#8217;ai vs. il 
</p>
<p>a) 
</p>
<p>erreurs isol&#233;es 
(ex. *je va 
</p>
<p>* je a) 
+ + + 
</p>
<p>E. 1
re
</p>
<p> pers. pluriel (V-
ons) (% correct) - 70-80% 80-95% 
</p>
<p>erreurs dans 
des constr. 
complexes 
</p>
<p>+ + 
</p>
<p>F. Sujet + viennent, 
veulent, prennent - 
</p>
<p>- 
</p>
<p>(ex. *ils 
prend) 
</p>
<p>occs. isol&#233;es de 
V-(n)ent 50% 
</p>
<p>probl&#232;mes 
encore 
</p>
<p>+ 
</p>
<p>G. Placement des 
pronoms objet 
</p>
<p>- SVO S(v)oV SovV appara&#238;t SovV 
productif 
</p>
<p>+ 
</p>
<p>H. Genre Article-Nom 
(% correct) 
</p>
<p>55-75% 60-80% 65-85% 70-90% 75-95% ? 90-
100% 
</p>
<p>Tableau 1. Itin&#233;raires d&#8217;acquisition (exemples) et stades propos&#233;s. 
L&#233;gende : Ph = Ph&#233;nom&#232;ne ; occs. = occurrences ; - = pas d&#8217;occurrence / pas encore acquis ; 
+ = acquis &#224; 100% ; opp(osition) = deux formes diff&#233;rentes d&#8217;un verbe particulier dans le 
m&#234;me enregistrement / texte ; formule = expression fig&#233;es dans la langue de l&#8217;apprenant ; V-
ons/V-(n)ent = Racine verbale + flexion. 
</p>
<p>L&#8217;axe horizontal indique le d&#233;veloppement en fonction du temps d&#8217;un ph&#233;nom&#232;ne particulier, 
donc son itin&#233;raire de d&#233;veloppement. L&#8217;axe vertical indique l&#8217;ensemble de ph&#233;nom&#232;nes 
grammaticaux &#233;tudi&#233;s regroup&#233;s de telle fa&#231;on qu&#8217;ils pr&#233;sentent des caract&#233;ristiques pour 
l&#8217;&#233;tablissement d&#8217;un stade acquisitionnel. Pour illustrer, comparons les ph&#233;nom&#232;nes C 
(occurrences des formes verbales conjugu&#233;es) et G (pronoms objet). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas Granfeldt, Pierre Nugues, Emil Persson, Lisa Persson, Fabian Kostadinov, Malin 
&#197;gren, Suzanne Schlyter 
</p>
<p> 
</p>
<p>D&#232;s le Stade 1, les formes conjugu&#233;es et les formes non-conjugu&#233;es coexistent. On trouve 
aussi bien &#171; je parle &#187; (transcription de /je parl/ analys&#233; comme une &#171; forme conjugu&#233;e &#187;) que 
&#171; je parler &#187; (transcription de /je parle/ analys&#233; comme une forme &#171; non-conjugu&#233;e &#187;). 
L&#8217;estimation actuelle est qu&#8217;au Stade 1, il y a entre 50 et 75% de formes conjugu&#233;es 
(calcul&#233;es sur les occurrences des verbes dans un contexte o&#249; ils sont normalement conjugu&#233;s). 
Au Stade 4, le pourcentage de formes conjugu&#233;es a augment&#233; jusqu&#8217;&#224; 90-98%. Pour ce 
ph&#233;nom&#232;ne morphologique, les itin&#233;raires d&#8217;acquisition d&#233;crivent une morphologisation 
successive. 
</p>
<p>Le ph&#233;nom&#232;ne G d&#233;crit l&#8217;itin&#233;raire d&#8217;acquisition des pronoms objets. Les premiers pronoms 
objets sont plac&#233;s dans une position post-verbale selon le sch&#233;ma Sujet-Verbe-Objet (SVO), 
par exemple *je vois le/la/lui (pour je le/la vois). Au stade 3, les apprenants peuvent produire 
des &#233;nonc&#233;s selon le sch&#233;ma SvoV (Sujet-verbe auxiliaire-pronom objet-Verbe), par exemple 
Je veux le voir (correct) mais aussi *j&#8217;ai le vu (incorrect). Au stade 4, je l&#8217;ai vu appara&#238;t. Pour 
ce ph&#233;nom&#232;ne syntaxique, les itin&#233;raires d&#8217;acquisition d&#233;crivent un changement dans 
l&#8217;organisation lin&#233;aire des constituants concern&#233;s. 
</p>
<p>Ce tableau est soumis &#224; une r&#233;vision continuelle et les taux sont encore approximatifs. 
L&#8217;important est que les itin&#233;raires d&#8217;acquisition nous fournissent un grand nombre 
d&#8217;hypoth&#232;ses d&#233;taill&#233;es sous la forme de structures locales et qui ensemble couvrent une 
grande partie de la langue (domaine verbal et nominal). 
</p>
<p>5 Annotation 
Le concept de groupe, nominal ou verbal, correct ou non, repr&#233;sente le support grammatical 
essentiel de notre annotation. La plupart des normes d&#8217;annotation syntaxique pour le fran&#231;ais 
tiennent compte d&#8217;une mani&#232;re ou d&#8217;une autre de tels groupes. Celle que propose Gendner et 
al. (2004) r&#233;concilie un grand nombre de pratiques et forme une base consensuelle. Ces 
normes sont cependant insuffisantes pour rendre compte des constructions du Tableau 1. 
</p>
<p>Nous avons d&#233;fini une annotation des textes propres au projet Direkt Profil. Elle repose sur 
l&#8217;inventaire des ph&#233;nom&#232;nes linguistiques caract&#233;ristiques des itin&#233;raires de d&#233;veloppement et 
elle reprend les cat&#233;gories d&#233;crites par Barting et Schlyter (2004) (Tableau 1). Nous avons 
repr&#233;sent&#233; ces ph&#233;nom&#232;nes par des arbres de d&#233;cisions dont les n&#339;uds terminaux 
correspondent &#224; une cat&#233;gorie d&#8217;analyse. 
</p>
<p>L&#8217;annotation de Direkt Profil utilise le format XML et annote les textes sur 4 niveaux. Seul le 
3e niveau est r&#233;ellement d&#8217;ordre syntaxique. 
</p>
<p>&#8226; Le premier niveau correspond &#224; la segmentation du texte en mots.  
</p>
<p>&#8226; Le deuxi&#232;me niveau annote les multimots et les expressions fig&#233;es (par exemple je 
m&#8217;appelle). Ces expressions correspondent aux phrases &#171; par c&#339;ur &#187; qui ont une grande 
importance dans les premi&#232;res ann&#233;es d&#8217;apprentissage du fran&#231;ais. 
</p>
<p>&#8226; Le troisi&#232;me niveau correspond &#224; une annotation syntaxique partielle du texte, restreinte 
aux ph&#233;nom&#232;nes &#224; identifier. Ce niveau balise simultan&#233;ment chacun des mots avec sa 
partie du discours et les groupes verbaux et nominaux auxquels ils appartiennent. Le 
groupe verbal incorpore les pronoms clitiques y compris les sujets. 
L&#8217;&#233;l&#233;ment XML span marque les groupes et comporte un attribut pour indiquer leur type 
dans la grille. Les parties du discours utilisent un &#233;l&#233;ment tag avec des attributs pour </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Direkt Profil : un syst&#232;me d&#8217;&#233;valuation de textes d&#8217;&#233;l&#232;ves de fran&#231;ais langue &#233;trang&#232;re fond&#233; 
sur les itin&#233;raires d&#8217;acquisition 
</p>
<p>indiquer le lemme, la partie du discours et les traits grammaticaux. 
Pour le groupe verbal, la phrase Ils parlons dans la bar extraite du texte d&#8217;introduction 
re&#231;oit l&#8217;annotation &lt;span class=&quot;c03&quot;&gt;&lt;tag pos=&quot;pro:nom:pl:p3:mas&quot;&gt; 
Ils&lt;/tag&gt; &lt;tag pos=&quot;ver:impre:pl:p1&quot;&gt; parlons &lt;/tag&gt;&lt;/span&gt; 
dans la bar. La classe c03 s&#8217;interpr&#232;te comme &#171; verbe lexical conjugu&#233; sans 
accord &#187;. 
</p>
<p>&#8226; Le quatri&#232;me niveau d&#233;nombre les types de structures caract&#233;ristiques d&#8217;un stade 
d&#8217;acquisition. Il utilise un &#233;l&#233;ment XML counter, &lt;counter id=&quot;counter.2&quot; 
counter_name=&quot;passe_compose&quot; rule_id=&quot;participe_4b&quot; 
value=&quot;1&quot;/&gt;. 
</p>
<p>6 Implantation 
Le programme Direkt Profil est pour l&#8217;instant restreint &#224; l&#8217;analyse des groupes verbaux et des 
pronoms clitiques sujets. Pour chacune des cat&#233;gories du Tableau 1, le programme d&#233;tecte les 
constructions correspondantes dans un texte et les d&#233;nombre. 
</p>
<p>L&#8217;analyseur utilise des r&#232;gles &#233;crites manuellement et s&#8217;appuie sur un lexique de formes 
fl&#233;chies. La vari&#233;t&#233; des constructions contenues dans le corpus est grande et afin de ne pas 
multiplier le nombre de r&#232;gles, nous avons choisi une strat&#233;gie d&#8217;analyse par renforcement de 
contraintes. Conceptuellement, l&#8217;analyseur recherche des classes de structures syntagmatiques 
dont tous les traits ont &#233;t&#233; &#244;t&#233;s. Il identifie les structures progressivement en faisant varier les 
valeurs des traits. La reconnaissance des limites des groupes se fait par un ensemble de mots 
vides et par des heuristiques &#224; l&#8217;int&#233;rieur des r&#232;gles. Elle suit ainsi une strat&#233;gie ancienne mais 
robuste utilis&#233;e notamment par Vergne (1999), inter alia, pour le fran&#231;ais. 
</p>
<p>Direkt Profil applique en cascade trois ensembles de r&#232;gles pour produire les quatre niveaux 
d&#8217;annotations. Le premier ensemble segmente le texte en mots. Un ensemble interm&#233;diaire 
identifie les expressions fig&#233;es. Le troisi&#232;me ensemble annote simultan&#233;ment les parties du 
discours et les groupes. Finalement, le moteur cr&#233;e un groupe de r&#233;sultats reli&#233; au Stade de 
l&#8217;apprenant. Il est &#224; noter que le moteur n&#8217;annote pas tous les mots, ni tous les segments. Il ne 
consid&#232;re que ceux qui sont pertinents pour la d&#233;termination du Stade. Le moteur applique les 
r&#232;gles de gauche &#224; droite puis de droite &#224; gauche pour r&#233;soudre certains probl&#232;mes d&#8217;accord. 
</p>
<p>Les r&#232;gles repr&#233;sentent des structures partielles de groupe et sont divis&#233;es en une partie 
condition et une partie action. La partie condition contient les param&#232;tres de recherche. Il peut 
s&#8217;agir d&#8217;un lemme, d&#8217;une expression r&#233;guli&#232;re ou d&#8217;une classe de flexion. Le moteur parcourt 
le texte et applique les r&#232;gles &#224; l&#8217;aide d&#8217;un arbre de d&#233;cision. Il ex&#233;cute la partie condition 
pour identifier les s&#233;quences de mots contigus. Chaque r&#232;gle produit un r&#233;sultat positif 
(&#171; match &#187;) ou n&#233;gatif (&#171; no match &#187;). Ils sont ex&#233;cut&#233;s suivant le r&#233;sultat de la condition et 
ont pour effet d&#8217;annoter le texte, de compter le nombre d&#8217;occurrences du ph&#233;nom&#232;ne et 
d&#8217;encha&#238;ner une autre r&#232;gle. En parcourant les n&#339;uds de l&#8217;arbre, le moteur m&#233;morise les 
r&#232;gles qu&#8217;il a parcourues sur son chemin ainsi que les r&#233;sultats des parties condition de ces 
r&#232;gles. Quand il arrive &#224; un n&#339;ud terminal, le moteur applique les parties action de toutes les 
r&#232;gles. 
</p>
<p>Le moteur recherche les mots dans un dictionnaire de formes fl&#233;chies. Il ne corrige pas les 
fautes d&#8217;orthographe &#224; l&#8217;exception des accents et de certains radicaux. En effet, les apprenants 
construisent fr&#233;quemment des participes pass&#233;s erron&#233;s &#224; partir d&#8217;une g&#233;n&#233;ralisation abusive </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas Granfeldt, Pierre Nugues, Emil Persson, Lisa Persson, Fabian Kostadinov, Malin 
&#197;gren, Suzanne Schlyter 
</p>
<p> 
</p>
<p>de radicaux verbaux voisins. Un exemple est le mot *prendu (pris) form&#233; sur le radical de 
prendre et du suffixe de rendu. Nous avons utilis&#233; le lexique disponible au site de 
l&#8217;Association des Bibliophiles Universels que nous avons corrig&#233;, transpos&#233; en XML et que 
nous avons enrichi des radicaux des verbes. 
</p>
<p>7 Interface 
Direkt Profil fusionne l&#8217;ensemble des niveaux d&#8217;annotations dans un objet r&#233;sultat. Cet objet 
repr&#233;sente le texte d&#8217;origine, l&#8217;annotation et la trace de l&#8217;application des r&#232;gles et des 
compteurs. L&#8217;objet r&#233;sultat, qui peut &#234;tre enregistr&#233;, est ensuite transform&#233; par le programme 
pour &#234;tre pr&#233;sent&#233; &#224; l&#8217;utilisateur. L&#8217;affichage utilise les sp&#233;cifications XHTML 1.1 qui 
peuvent &#234;tre lues par un navigateur internet. Direkt Profil fonctionne en mode client-serveur 
o&#249; le serveur r&#233;alise l&#8217;annotation d&#8217;un texte et le client, int&#233;gr&#233; &#224; un navigateur, prend en 
charge l&#8217;affichage et l&#8217;interaction. 
</p>
<p>La Figure 3 est une copie d&#8217;&#233;cran de l&#8217;interface graphique de Direkt Profil qui montre 
l&#8217;analyse du texte pr&#233;sent&#233; dans l&#8217;Introduction. L&#8217;interface indique &#224; l&#8217;utilisateur par une 
couleur diff&#233;rente toutes les structures que l&#8217;analyseur a d&#233;tect&#233;es. Le cadre inf&#233;rieur donne le 
code des couleurs et le d&#233;nombrement de ces structures. 
</p>
<p> 
</p>
<p>Figure 3. L&#8217;interface graphique de Direkt Profil 1.5. 
</p>
<p>8 R&#233;sultats et &#233;valuation 
Nous avons &#233;valu&#233; Direkt Profil avec un sous-ensemble du corpus CEFLE de Lund. Nous 
avons choisi 20 textes au hasard r&#233;partis sur 4 Stades d&#8217;apprentissage. Nous avons aussi 
utilis&#233; 5 textes provenant du groupe de contr&#244;le. Nous n&#8217;avons pas test&#233; dans cette version la 
correction des mots mal orthographi&#233;s : accent et radicaux. Le Tableau 2 pr&#233;sente quelques </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Direkt Profil : un syst&#232;me d&#8217;&#233;valuation de textes d&#8217;&#233;l&#232;ves de fran&#231;ais langue &#233;trang&#232;re fond&#233; 
sur les itin&#233;raires d&#8217;acquisition 
</p>
<p>statistiques sur la taille de textes et le Tableau 3 donne les r&#233;sultats sous forme de rappel et 
pr&#233;cision.3  
</p>
<p> Stade 1 Stade 2 Stade 3 Stade 4 Contr&#244;le Total 
Nombre de textes analys&#233;s 5 5 5 5 5 25 
Nombre de mots 740 1233 1571 1672 1626 6842 
Nombre de phrases 85 155 166 126 107 639 
Longueur moyenne des textes (mots) 148 247 314 334 325  
Longueur moyenne des phrases 8,7 7,9 9,5 13,3 15,2  
</p>
<p>Tableau 2. Corpus de test. 
</p>
<p> Stade 1 Stade 2 Stade 3 Stade 4 Contr&#244;le Total 
Nombre de structures de r&#233;f&#233;rence 23 97 101 119 85 425 
Nombre de structures propos&#233;es 27 98 100 112 92 429 
Nombre de structures d&#233;tect&#233;es 
correctes 
</p>
<p>15 81 89 96 73 354 
</p>
<p>Nombre de structures non 
d&#233;tect&#233;es 
</p>
<p>5 16 12 20 11 64 
</p>
<p>Nombre de structures surd&#233;tect&#233;es 10 17 11 17 19 74 
Rappel 65 84 88 81 86 83 
Pr&#233;cision 56 83 89 86 79 83 
F-measure 0,6 0,83 0,89 0,83 0,82 0,83 
</p>
<p>Tableau 3 : R&#233;sum&#233; des r&#233;sultats de Direkt Profil 1.5.1 
&#192; un niveau global, les r&#233;sultats montrent que Direkt Profil parvient bien &#224; d&#233;tecter les 
ph&#233;nom&#232;nes d&#233;sir&#233;s. Il r&#233;v&#232;le aussi des diff&#233;rences int&#233;ressantes suivant les stades des textes. 
Le tableau montre que les textes du Stade 1 sont les plus difficiles &#224; traiter (rappel de 65%). 
Ceci est d&#251; en grande partie au nombre de mots inconnus &#224; ce stade d&#8217;acquisition (cf. infra 
Figure 2). Le r&#233;sultat en est une surdectection du ph&#233;nom&#232;ne &#171; phrases sans verbes &#187; &#224; ce 
stade. Les r&#233;sultats montrent aussi que Direkt Profil analyse mieux les textes des apprenants 
que les textes des &#233;tudiants fran&#231;ais (Groupe de contr&#244;le). Sans savoir exactement &#224; quoi ce 
r&#233;sultat est d&#251;, nous pouvons constater qu&#8217;il sugg&#232;re que la d&#233;marche adopt&#233;e qui vise &#224; 
l&#8217;analyse des textes en fran&#231;ais langue &#233;trang&#232;re semble prometteuse. 
</p>
<p>9 Conclusion et travaux futurs 
Nous avons pr&#233;sent&#233; un syst&#232;me r&#233;alisant une analyse automatique de textes fond&#233;e sur les 
itin&#233;raires d&#8217;acquisition dont le but est de produire un profil d&#8217;apprenant. Nous avons 
construit un analyseur syntaxique et d&#233;velopp&#233; un ensemble de r&#232;gles pour annoter les textes. 
Direkt Profil est int&#233;gr&#233; dans une architecture client-serveur et dispose d&#8217;une interface 
permettant l&#8217;interaction avec l&#8217;utilisateur. 
</p>
<p>Les r&#233;sultats montrent qu&#8217;il est possible de d&#233;crire sous forme de r&#232;gles la vaste majorit&#233; des 
structures locales d&#233;finies par les itin&#233;raires d&#8217;acquisition. Direkt Profil peut ainsi les d&#233;tecter 
                                                
</p>
<p>3
 Dans le corpus de test, nous n&#8217;avons pas d&#8217;exemples de textes d&#8217;apprenants des Stades 5 et 6 (cf. Tableau 1). 
</p>
<p>Pour le moment, les textes du groupe de contr&#244;le (des jeunes Fran&#231;ais) peuvent servir d&#8217;exemples des textes 
de haut niveau linguistique.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jonas Granfeldt, Pierre Nugues, Emil Persson, Lisa Persson, Fabian Kostadinov, Malin 
&#197;gren, Suzanne Schlyter 
</p>
<p> 
</p>
<p>et les analyser automatiquement. Nous pouvons ainsi v&#233;rifier la validit&#233; des crit&#232;res 
d&#8217;acquisition &#233;tablis pour l&#8217;oral sur notre corpus &#233;crit. 
</p>
<p>Direkt Profil peut aussi avoir un r&#244;le p&#233;dagogique car il sera possible d&#8217;analyser, de mani&#232;re 
automatique et pr&#233;cise, le niveau grammatical d&#8217;un apprenant ou d&#8217;un &#233;l&#232;ve dans la 
production &#233;crite et libre. Le programme pourra &#234;tre utilis&#233; d&#8217;une part par des professeurs 
pour &#233;valuer les textes de leurs &#233;l&#232;ves et d&#8217;autre part par les &#233;l&#232;ves eux-m&#234;mes comme auto-
&#233;valuation et dans le perfectionnement de la langue. 
</p>
<p>Une version pr&#233;liminaire de Direkt Profil est disponible en ligne &#224; l&#8217;adresse 
http://www.rom.lu.se:8080/profil 
</p>
<p>R&#233;f&#233;rences 
BARTNING, I, S. SCHLYTER (2004) &#171; Stades et itin&#233;raires acquisitionnels des apprenants 
su&#233;dophones en fran&#231;ais L2 &#187;. JFLS (Journal of French Language Studies). &#192; para&#238;tre. 
BIGERT, J., KANN, V., KNUTSSON, O., SJ&#214;BERGH J. (2004). Grammar checking for Swedish 
second language learners. Chapter in CALL in the Nordic Languages, Copenhagen Studies in 
Language, Copenhagen Business School. 
</p>
<p>CLAHSEN, H., MEISEL, J-M., PIENEMANN, M. (1983) Deutsch als Fremdsprache. Der 
Spracherwerb ausl&#228;ndischer Arbeiter. T&#252;bingen: Narr 
</p>
<p>GENDNER, V., VILNAT, A., MONCEAUX, L., PAROUBEK, P., ROBBA I. (2004) Les annotations 
syntaxiques de r&#233;f&#233;rence PEAS. 
http://www.limsi.fr/Recherche/CORVAL/easy/PEAS_reference_annotations_v1.6.html 
</p>
<p>GRANGER, S., VANDEVENTER A., HAMEL M-J. (2001). &#171; Analyse de corpus d&#8217;apprenants pour 
l&#8217;ELAO bas&#233; sur le TAL &#187;. Traitement Automatique des Langues, 42(2), 609-621. 
</p>
<p>HEIDORN G. E., Intelligent Writing Assistance, (2000) in Robert Dale, Hermann Moisl, et 
Harold Somers eds, Handbook of Natural Language Processing, Marcel Dekker. 
JENSEN, K., HEIDORN G. E., RICHARDSON S. D., (1993) Natural Language Processing: The 
PLNLP Approach, Kluwer Academic Publishers. 
</p>
<p>PIENEMANN, M, JOHNSTON, M (1987) &#171; Factors influencing the development of second 
language proficiency&#8221;. In D. Nunan (ed.) Applying second language acquisition research, 45-
141. Adelaide: National Curriculum Resource Centre. 
</p>
<p>SCHLYTER, S. (2003). &#171; Stades de d&#233;veloppement en fran&#231;ais L2 &#187;. Ms. Institut d&#8217;&#233;tudes 
romanes de Lund. Universit&#233; de Lund. Disponible en ligne : 
http://www.rom.lu.se/durs/STADES_DE_DEVELOPPEMENT_EN_FRANCAIS_L2.pdf 
</p>
<p>VERGNE, J. (1999) &#201;tude et mod&#233;lisation de la syntaxe des langues &#224; l&#8217;aide de l&#8217;ordinateur. 
Analyse syntaxique automatique non combinatoire. Synth&#232;se et R&#233;sultats. Habilitation &#224; 
Diriger des Recherches, 29 septembre 1999, Caen. 
</p>
<p>&#197;GREN, M. (2005) &#171; Le marquage morphologique du nombre dans la phrase nominale. Une 
&#233;tude sur l&#8217;acquisition du fran&#231;ais L2 &#233;crit &#187; Ms. Institut d&#8217;&#233;tudes romanes de Lund. 
Universit&#233; de Lund. </p>

</div></div>
</body></html>