<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Projection et monotonie dans un langage de repr&#233;sentation lexico-grammatical</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Projection et monotonie dans un langage de repr&#233;sentation
lexico-grammatical
</p>
<p>Benoit Crabb&#233;
LORIA - Universit&#233; Nancy 2
</p>
<p>BP 239, 54506 Vandoeuvre-l&#232;s-Nancy Cedex
crabbe@loria.fr
</p>
<p>Mots-clefs : Syntaxe, Lexique, Liage, Interface syntaxe s&#233;mantique, TAG
Keywords: Syntax, Lexicon, Linking, Syntax Semantics interface, TAG
</p>
<p>R&#233;sum&#233; Cet article apporte une m&#233;thode de d&#233;veloppement grammatical pour la r&#233;ali-
sation de grammaires d&#8217;arbres adjoints (TAG) de taille importante augment&#233;es d&#8217;une dimen-
sion s&#233;mantique. La m&#233;thode que nous pr&#233;sentons s&#8217;exprime dans un langage informatique de
repr&#233;sentation grammatical qui est d&#233;claratif et monotone. Pour arriver au r&#233;sultat, nous mon-
trons comment tirer parti de la th&#233;orie de la projection dans le langage de repr&#233;sentation que
nous utilisons. Par cons&#233;quent cet article justifie l&#8217;utilisation d&#8217;un langage monotone pour la
repr&#233;sentation lexico-grammaticale.
</p>
<p>Abstract This papers provides a methodology for the grammatical development of large
sized tree adjoining grammars (TAG) augmented with a semantic dimension. The provided
methodology is expressed in a monotnic and declarative language designed for the compact
representation of grammatical descriptions. To achieve the result, we show how to express
a linking theory in the language used. Therefore this paper justifies the use of a monotonic
language for lexico-grammatical representation.
</p>
<p>1 Introduction
</p>
<p>Dans cet article, nous donnons une m&#233;thode g&#233;n&#233;rale qui permet repr&#233;senter de mani&#232;re com-
pacte un fragment significatif de grammaire TAG pour le fran&#231;ais comportant une interface
syntaxe-s&#233;mantique. TAG n&#8217;&#233;tant pas en tant que tel un formalisme d&#8217;analyse syntaxique com-
portant une sp&#233;cification explicite de la repr&#233;sentation s&#233;mantique, nous utilisons ici la variante
introduite par (GK03). Celle-ci utilise des unit&#233;s &#233;l&#233;mentaires qui sont des structures &#224; deux
dimensions. Une dimension syntaxique qui est l&#8217;arbre TAG habituel, et une dimension s&#233;man-
tique qui repr&#233;sente l&#8217;information s&#233;mantique associ&#233;e &#224; cet arbre. La dimension s&#233;mantique
est constitu&#233;e de formules du langage de repr&#233;sentation s&#233;mantique utilis&#233; par (GK03). Celui-ci
est de la m&#234;me famille que la minimal recursive semantics.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Benoit Crabb&#233;
</p>
<p>2 Enjeux m&#233;thodologiques
Pour repr&#233;senter une grammaire TAG de mani&#232;re non redondante, nous utilisons un langage
informatique destin&#233; &#224; exprimer la grammaire de mani&#232;re compacte (CD04). Celui-ci repose
sur l&#8217;utilisation de macros (ou classes) r&#233;utilisables. Ce langage est destin&#233; &#224; servir de source
&#224; un interpr&#233;te effectivement impl&#233;ment&#233; qui r&#233;alise l&#8217;expansion de la description compacte
(DLP04). Le langage utilis&#233; pose que dans un syst&#232;me de description grammatical, il est
souhaitable de reconna&#238;tre deux types de g&#233;n&#233;ralisations : les g&#233;n&#233;ralisations de structure d&#8217;une
part et les g&#233;n&#233;ralisations d&#8217;alternatives d&#8217;autre part.
</p>
<p>S
</p>
<p>N&#8595; V&#5; N&#8595;
</p>
<p>Jean mange une pomme
</p>
<p>N
</p>
<p>N* S
</p>
<p>C
</p>
<p>que
</p>
<p>S
</p>
<p>N&#8595; V&#5;
</p>
<p>La pomme que Jean mange
</p>
<p>On identifie dans la description gram-
maticale un certain nombre de construc-
tions r&#233;currentes que l&#8217;on souhaiterait
pouvoir r&#233;utiliser. Par exemple dans les
deux arbres suivants, nous avons encer-
cl&#233; l&#8217;information qui repr&#233;sente un su-
jet nominal r&#233;alis&#233; en position canon-
ique. D&#8217;autre part, et ind&#233;pendamment
</p>
<p>du partage de structure, on souhaite capturer la notion d&#8217;alternative. Par exemple ou souhaitera
identifier qu&#8217;une construction passive est une alternative d&#8217;une construction active. Les alter-
natives que nous identifions ont un statut particulier. En effet, ces g&#233;n&#233;ralisations contribuent
&#224; d&#233;crire des ensembles d&#8217;unit&#233;s grammaticales mises en relation. Dans l&#8217;exemple donn&#233; ci-
dessus, l&#8217;alternative entre un contexte transitif actif (a) et un contexte transitif passivis&#233; (b) con-
tribuent &#224; d&#233;crire un ensemble de deux arbres qui partagent une s&#233;mantique commune (pr&#233;dicat
binaire transitif). La reconnaissance explicite des alternatives constitue un point important du
langage que nous utilisons. En effet, une famille d&#8217;arbres (Abe02), n&#8217;est rien d&#8217;autre qu&#8217;un
ensemble de r&#233;alisations alternatives d&#8217;une m&#234;me structure pr&#233;dicat-argument. Or la repr&#233;sen-
tation des alernatives a souvent &#233;t&#233; n&#233;glig&#233;e dans les propositions r&#233;centes pour la repr&#233;sentation
grammaticale de TAG (Can99; Xia01; GCR02)1.
</p>
<p>Rejet des r&#232;gles lexicales Le cadre que nous proposons ici se veut op&#233;rationnel. Dans ce
contexte, la m&#233;thode que nous proposons se caract&#233;rise par le rejet des r&#232;gles lexicales. La
raison principale est que l&#8217;utilisation d&#8217;une m&#233;canique proc&#233;durale dans le d&#233;veloppement de
grammaires d&#8217;arbres adjoints de tailles cons&#233;quentes pose en pratique de tr&#232;s s&#233;rieux probl&#232;mes
d&#8217;ordonnancement de r&#232;gles (Pro02). En lieu et place de r&#232;gles lexicales, nous utilisons un lan-
gage purement d&#233;claratif muni de deux op&#233;rateurs qui permettent de combiner des descriptions
grammaticales fragmentaires : la conjonction et la disjonction.
</p>
<p>3 Langage utilis&#233;
</p>
<p>Le langage que nous utilisons (not&#233; LC) permet de tirer parti des deux types de g&#233;n&#233;ralisations
que nous avons identifi&#233;s. Celui-ci repose crucialement sur la notion de classe. Une classe con-
tient une description de structure(s) grammaticale(s) partielle(s). Pour une TAG, une description
est une description partielle d&#8217;arbre potentiellement augment&#233;e de structures de traits associ&#233;es
</p>
<p>1En particulier, mentionnons que (Can99; GCR02) permettent d&#8217;exprimer les alternatives de mani&#232;re d&#233;tourn&#233;e
&#224; l&#8217;aide d&#8217;un algorithme de &#171; croisement &#187;. En pratique nous avons observ&#233; que cet algorithme complique consid-
&#233;rablement le travail de conception de grammaires.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Projection et monotonie dans un langage de repr&#233;sentation lexico-grammatical
</p>
<p>aux noeuds. Une classe a pour fonction de nommer la description D &#224; laquelle elle est associ&#233;e
de telle sorte qu&#8217;il est possible de r&#233;utiliser D par ailleurs dans une description D &#8242; quelconque.
Ce sont les classes qui nous permettent dans le langage de capturer les g&#233;n&#233;ralisations gram-
maticales. Ce langage d&#233;taill&#233; par (CD04) comporte quatre aspects.
Nommage Le langage permet de nommer une description. Associer un nom &#224; une description
permet de la r&#233;utiliser par apr&#232;s. Ceci est illustr&#233; par les exemples suivants o&#249; on associe un
nom (&#224; gauche) &#224; la description indiqu&#233;e &#224; droite2.
</p>
<p>SujetCanonique &#8594;
</p>
<p>S
</p>
<p>N&#8595; V SujetRelativis&#233; &#8594;
</p>
<p>N
</p>
<p>N* S
</p>
<p>N&#8595; V FormeVerbale&#8594;
</p>
<p>S
</p>
<p>V&#5;
R&#233;utilisation Il est possible dans une description donn&#233;e de r&#233;utiliser une description d&#233;j&#224; asso-
ci&#233;e &#224; un nom par ailleurs. Dans l&#8217;exemple suivant, on r&#233;utilise ainsi la &#171; macro &#187; FormeVerbale
dans la description de VerbeActif.
</p>
<p>VerbeActif &#8594; FormeVerbale
Alternative On peut exprimer dans le langage la notion d&#8217;alternative (ou de choix) en utilisant
le symbole &#8744;. Ainsi, l&#8217;exemple suivant montre comment exprimer que la notion de sujet recou-
vre aussi bien la notion de sujet canonique que de sujet relativis&#233;.
</p>
<p>Sujet &#8594; SujetCanonique &#8744; SujetRelativis&#233;
Composition Il est &#233;galement possible de combiner deux descriptions. Ainsi, on peut exprimer
qu&#8217;une famille de constructions intransitives est faite d&#8217;un sujet et d&#8217;une forme verbale &#224; l&#8217;actif
de la mani&#232;re suivante :
</p>
<p>VerbeIntransitif&#8594; Sujet &#8743; VerbeActif
S
</p>
<p>N&#8595; V
Le gar&#231;on. . .
</p>
<p>&#8743;
S
</p>
<p>V&#5;
dort
</p>
<p>&#8658;
S
</p>
<p>N&#8595; V&#5;
Le gar&#231;on dort
</p>
<p>N
</p>
<p>N* S
</p>
<p>N&#8595; V
(Le gar&#231;on) qui. . .
</p>
<p>&#8743;
</p>
<p>S
</p>
<p>V&#5;
</p>
<p>dort
</p>
<p>&#8658;
</p>
<p>N
</p>
<p>N* S
</p>
<p>N&#8595; V&#5;
Le gar&#231;on qui dort
</p>
<p>Figure 1: Deux arbres &#224; contexte intransitif
Interpr&#233;tation du langage Formellement, comme l&#8217;indiquent (CD04), l&#8217;interpr&#233;tation d&#8217;une
description grammaticale d formul&#233;e en LC se ram&#232;ne &#224; un interpr&#233;ter un programme logique
de la famille Definite Clause Grammar (DCG). Cela se comprend en consid&#233;rant que d est
une grammaire dont les terminaux sont des descriptions arborescentes, que l&#8217;op&#233;ration de con-
cat&#233;nation est ici la conjonction et en imposant que la DCG sous-jacente &#224; d soit non r&#233;cursive
(CD04). L&#8217;interpr&#233;tation d&#8217;une description d engendre de mani&#232;re ind&#233;terministe toutes les
phrases, prises comme des conjonctions de descriptions, de la DCG sous-jacente &#224; d. Dans
l&#8217;exemple pr&#233;sent&#233; jusqu&#8217;ici, en consid&#233;rant la classe VerbeIntransitif comme axiome de la
DCG, l&#8217;interpr&#232;te engendre deux arbres repr&#233;sentant deux contextes de verbe intransitif, comme
indiqu&#233; en figure 1. O&#249; on illustre sur la gauche les deux conjonctions de descriptions engen-
dr&#233;es par l&#8217;interpr&#232;te et sur la droite le r&#233;sultat de la composition des descriptions3.
</p>
<p>2Nous utilisons dans ce document une syntaxe abstraite pour illustrer notre propos. Un interpr&#232;te concret pour
ce langage a &#233;t&#233; implant&#233; par (DLP04).
</p>
<p>3Le m&#233;canisme de composition est d&#233;taill&#233; par (CD04)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Benoit Crabb&#233;
</p>
<p>4 Th&#233;orie de la projection lexicale
Le langage &#233;tant pos&#233;, nous donnons dans cette section une m&#233;thode g&#233;n&#233;rale qui permet
d&#8217;exprimer de mani&#232;re d&#233;clarative une grammaire &#224; l&#8217;aide de ce langage. Cette m&#233;thode re-
pose sur la th&#233;orie de la projection (linking theory). La fonction de projection associe chaque
&#233;l&#233;ment de la structure argumentale &#224; un &#233;l&#233;ment de la structure syntaxique, comme indiqu&#233; ici :
</p>
<p>MANGER &#12296;agent patient&#12297;
</p>
<p>manger &#12296;sujet objet&#12297;
</p>
<p>MANGER &#12296;agent patient&#12297;
</p>
<p>mangerpass &#12296;sujet par &#8722; objet&#12297;
</p>
<p>MANGER &#12296;agent patient&#12297;
</p>
<p>mangerpass &#12296;sujet &#8709;&#12297;
</p>
<p>Approche monotone Utiliser la projection dans un langage
tel que celui que nous proposons consiste &#224; consid&#233;rer que
l&#8217;on g&#233;n&#232;re un ensemble d&#8217;unit&#233;s grammaticales compl&#232;tement
sp&#233;cifi&#233;es par sursp&#233;cifiation de la structure argumentale. Cette
</p>
<p>m&#233;thode permet de garantir un m&#233;canisme monotone pour exprimer l&#8217;interface syntaxe s&#233;man-
tique. Pour illustrer ce point, prenons le cas classique du passif court qui, dans la litt&#233;rature est
souvent utilis&#233; pour justifier l&#8217;utilisation d&#8217;une m&#233;canique proc&#233;durale (Bec93; Can99; Xia01).
Dans ce cas, Marie est vue est consid&#233;r&#233; comme variante de Jean voit Marie dans laquelle
l&#8217;agent n&#8217;est pas exprim&#233;. Le traitement par r&#232;gle lexicale du passif court consiste &#224; effacer
l&#8217;agent (i.e. Jean). Dans le cas du mod&#232;le projectif, rien n&#8217;est effac&#233;. Au contraire l&#8217;agent non
exprim&#233; est projet&#233; sur une r&#233;alisation vide en syntaxe, comme illustr&#233; &#224; gauche. L&#8217;approche
projective ne fait qu&#8217;ajouter de l&#8217;information, et &#233;ventuellement de l&#8217;information vide &#224; la struc-
ture argumentale.
</p>
<p>Projection pour une grammaire TAG L&#8217;approche projective pr&#233;sent&#233;e jusqu&#8217;&#224; pr&#233;sent s&#8217;ada-
pte facilement &#224; une grammaire semi-lexicalis&#233;e du type LFG. Ainsi dans une grammaire
LFG, une structure syntaxique comme manger&#12296;sujet objet&#12297; correspond directement &#224; la f-
structure de l&#8217;entr&#233;e lexicale d&#8217;un verbe.
</p>
<p>S
</p>
<p>N&#8595;?x V&#5; N&#8595;?y
</p>
<p>&#5;(?x,?y)
</p>
<p>En pratique, dans le cas d&#8217;une grammaire TAG &#224; dimension s&#233;mantique,
les entr&#233;es lexicales &#224; d&#233;crire sont des sch&#233;mas d&#8217;arbres comme illus-
tr&#233; &#224; droite. La dimension s&#233;mantique est prise comme contrepartie de
la structure argumentale et la structure arborescente est prise comme
contrepartie de la dimension syntaxique. La fonction de projection est
repr&#233;sent&#233;e par le partage de valeurs des traits s&#233;mantiques associ&#233;s aux
</p>
<p>noeuds de l&#8217;arbre et les variables d&#8217;individus de la pr&#233;dication &#233;l&#233;mentaire (indiqu&#233;e en gras).
La m&#233;thodologie que nous proposons repose sur l&#8217;id&#233;e de base que les arbres &#233;l&#233;mentaires TAG
sont d&#233;crits par assemblage de fragments de structure correspondant &#224; la repr&#233;sentation des
arguments et du pr&#233;dicat. La m&#233;thodologie qui suit consiste ensuite &#224; produire des familles
d&#8217;arbres en assemblant ces diff&#233;rents fragments. Ce qui g&#233;n&#233;ralise l&#8217;exemple donn&#233; en fig-
ure 1. La m&#233;thode comporte quatre &#233;tapes : (1) Description des fragments (2) Description de
fonctions syntaxiques (3) Description de changements de diath&#232;se (4) Description de familles.
Pour r&#233;aliser l&#8217;interface syntaxe-s&#233;mantique, l&#8217;id&#233;e consiste &#224; &#233;tablir le lien entre la structure
pr&#233;dicative et les valeurs de traits dans les arbres &#224; l&#8217;aide de classes param&#233;tr&#233;es4
</p>
<p>La premi&#232;re &#233;tape de la description consiste &#224; d&#233;finir des fragments repr&#233;sentant diff&#233;rentes
</p>
<p>4On se rappelle que le langage de contr&#244;le LC est vu comme la contrepartie d&#8217;une DCG ce qui nous autorise &#224;
utiliser des param&#232;tres.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Projection et monotonie dans un langage de repr&#233;sentation lexico-grammatical
</p>
<p>SujCan(?x)&#8594;
</p>
<p>S
</p>
<p>N&#8595;?x V ObjCan(?x)&#8594;
</p>
<p>S
</p>
<p>V N&#8595;?x ForActive &#8594;
S
</p>
<p>V&#5; ForPassive &#8594;
</p>
<p>S
</p>
<p>V
</p>
<p>V&#8595; V&#5;
</p>
<p>IndObjCan(?x)&#8594;
</p>
<p>S
</p>
<p>V PP
</p>
<p>P
</p>
<p>&#224;
</p>
<p>N&#8595;?x
</p>
<p>IndObjWh(?x)&#8594;
</p>
<p>S
</p>
<p>PP
</p>
<p>P
</p>
<p>&#224;
</p>
<p>N&#8595;?x
S
</p>
<p>ParObjCan(?x)&#8594;
</p>
<p>S
</p>
<p>V PP
</p>
<p>P
</p>
<p>par
</p>
<p>N&#8595;?x
</p>
<p>ParObjWh(?x)&#8594;
</p>
<p>S
</p>
<p>PP
</p>
<p>P
</p>
<p>par
</p>
<p>N&#8595;?x
S
</p>
<p>SujRel(?x)&#8594;
</p>
<p>N
</p>
<p>N* S
</p>
<p>N&#8595;?x V ObjWh(?x)&#8594;
</p>
<p>S
</p>
<p>N&#8595;?x S
</p>
<p>V
</p>
<p>Figure 2: Fragments d&#8217;arbres utilis&#233;s comme &#171; blocs de construction &#187; de la grammaire
</p>
<p>formes du pr&#233;dicat et des arguments (Figure 2). Chacun de ces fragments est r&#233;utilis&#233; pour la
description des arbres. Par exemple, toute description d&#8217;arbre qui repr&#233;sente un contexte o&#249; le
sujet est r&#233;alis&#233; en position canonique utilisera le fragment SujCan. De plus, pour impl&#233;menter
le liage syntaxe/s&#233;mantique, chaque classe d&#233;crivant un fragment arborescent coindexe la valeur
du trait s&#233;mantique dans la structure arborescente avec un param&#232;tre de classe appropri&#233;. La
seconde &#233;tape regroupe les classes qui d&#233;crivent les fonctions syntaxiques. Celles-ci capturent
le fait qu&#8217;une fonction syntaxique est une notion qui permet de s&#8217;abstraire de la question de
l&#8217;ordre des mots.
</p>
<p>(1) Sujet(?x) &#8594; SujetCan(?x) &#8744; SujRel(?x)
Objet(?x) &#8594; ObjCan(?x) &#8744; ObjWh(?x)
ParObjet(?x) &#8594; ParObjCan(?x) &#8744; ParObjWh(?x)
ObjetIndirect(?x)&#8594; IndObjCan(?x) &#8744; IndObjWh(?x)
</p>
<p>Par exemple, la classe Sujet quoi que simplifi&#233;e ici capture le fait que le sujet recouvre alterna-
tivement une r&#233;alisation nominale devant le verbe (SujCan) ou en position relativis&#233;e (SujRel).
En outre, les classes d&#233;crivant les variantes fonctionnelles contribuent &#224; &#233;tablir le liage entre
syntaxe et s&#233;mantique en propageant la coindexation de valeurs par utilisation de param&#232;tres.
</p>
<p>La troisi&#232;me &#233;tape o&#249; l&#8217;on d&#233;crit les changements de diath&#232;se constitue le point important. Pour
capturer l&#8217;alternance actif/passif, nous utilisons la d&#233;finition suivante :
</p>
<p>(2) AlternancePassive(?x, ?y) &#8594;
(Sujet(?x) &#8743; FormeActive &#8743; Objet(?y))
&#8744;(Sujet(?y) &#8743; FormePassive &#8743; ParObjet(?x))
&#8744;(Sujet(?y) &#8743; FormePassive)
</p>
<p>Ce qui indique que les r&#233;alisations alternatives de l&#8217;actif et du passif sont soit faites d&#8217;un sujet,
d&#8217;une forme verbale active et d&#8217;un objet; soit d&#8217;un sujet, d&#8217;une forme verbale passive et op-
tionellement d&#8217;un compl&#233;ment d&#8217;agent. Cette classe d&#233;finit deux param&#232;tres ?x et ?y qui sont
coindex&#233;s avec les param&#232;tres des classes de fonctions syntaxiques. Les valeurs des param&#232;tres
?x et ?y repr&#233;sentent les valeurs associ&#233;es aux arguments dans la structure argumentale. Ainsi
la premi&#232;re ligne, qui repr&#233;sente l&#8217;actif, a pour effet de lier le premier argument (?x) au sujet et
le second (?y) &#224; l&#8217;objet. Par contre, la seconde ligne, qui repr&#233;sente le passif, lie le premier argu-
ment au compl&#233;ment d&#8217;agent et le second au sujet. Finalement la derni&#232;re ligne, qui repr&#233;sente
le passif sans agent, lie uniquement le second argument au sujet. Le premier argument n&#8217;est
tout simplement pas li&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Benoit Crabb&#233;
</p>
<p>En dernier lieu, la d&#233;finition des familles (Abe02) demande d&#8217;introduire explicitement la repr&#233;sen-
tation s&#233;mantique et de lier les variables de la pr&#233;dication &#233;l&#233;mentaire avec les param&#232;tres de
classe appropri&#233;s. On d&#233;finira une famille ditransitive de la mani&#232;re suivante :
</p>
<p>(3) FamilleDitransitive &#8594;
AlternancePassive(?x, ?y) &#8743; ObjetIndirect(?z)
&#8743; &lt;sem&gt; &#5;(?x, ?y, ?z)
</p>
<p>o&#249; &lt;sem&gt; repr&#233;sente la description d&#8217;un litt&#233;ral s&#233;mantique dont les variables d&#8217;individu sont
coindex&#233;es avec les param&#232;tres de classes appropri&#233;s Le litt&#233;ral s&#233;mantique ainsi d&#233;crit est
la contrepartie dans notre langage de ce que la th&#233;orie de la projection appelle la structure
argumentale. &#192; chacun des niveaux de description les variables sont coindex&#233;es de mani&#232;re
appropri&#233;e. La g&#233;n&#233;ration de l&#8217;ensemble des arbres de la famille produit bien un ensemble de
couples (arbre, repr&#233;sentation s&#233;mantique) dans lesquels la projection est bien r&#233;alis&#233;e.
</p>
<p>5 Conclusion
Dans cet article, nous avons propos&#233; une m&#233;thode de d&#233;veloppement de grammaires d&#8217;arbres
adjoints qui s&#8217;exprime dans un cadre monotone. Cette m&#233;thode permet de justifier l&#8217;usage
d&#8217;un langage monotone pour la repr&#233;sentation lexico-grammaticale. En second lieu elle ou-
vre la porte au d&#233;veloppement de grammaires d&#8217;arbres adjoints &#224; large couverture comportant
une interface syntaxe-s&#233;mantique. Ces grammaires doivent &#234;tre interfac&#233;es avec les analyseurs
TAG existants (GP05). Le langage ainsi que la m&#233;thode propos&#233;s ont permis de g&#233;n&#233;rer une
grammaire d&#8217;arbre adjoints de taille importante (environ 4000 arbres). De plus le cadre pro-
pos&#233; ici s&#8217;adapte facilement au d&#233;veloppement de grammaires pour d&#8217;autres formalismes forte-
ment lexicalis&#233;s. Ainsi, G. Perrier a pu r&#233;utiliser cette m&#233;thode pour produire une grammaire
d&#8217;interaction. Nous avons &#233;galement men&#233; quelques exp&#233;riences encourageantes qui ont permis
de cr&#233;er une petite grammaire XDG du fran&#231;ais.
</p>
<p>R&#233;f&#233;rences
Anne Abeill&#233;. (Abe02) Une grammaire d&#8217;arbres adjoints pour le fran&#231;ais. CNRS, Paris, 2002.
Tilman Becker. (Bec93) HyTAG: A new Type of Tree Adjoining Grammars for Hybrid Syntactic Repre-
sentation of Free Word Order Language. PhD thesis, Universit&#228;t des Saarlandes, 1993.
Marie-H&#233;l&#232;ne Candito. (Can99) Organisation Modulaire et Param&#233;trable de Grammaires Electroniques
Lexicalis&#233;es. PhD thesis, Universit&#233; de Paris 7, 1999.
Benoit Crabb&#233; and Denys Duchier. (CD04) Metagrammar redux. In Constraint Solving and Language
Processing, Copenhagen, 2004.
Denys Duchier, Joseph Leroux, and Yannick Parmentier. (DLP04) The metagrammar compiler: An nlp
application with a multi-paradigm architecture. In Mozart 2004, Charleroi, 2004.
Bertrand Gaiffe, Benoit Crabb&#233;, and Azim Roussanaly. (GCR02) A new metagrammar compiler. In
Proc. TAG+6, Venise, 2002.
Claire Gardent and Laura Kallmeyer. (GK03) Semantic construction in feature-based tree adjoining
grammar. In Proc. EACL, 2003.
Claire Gardent and Yannick Parmentier. (GP05) Large scale semantic construction for tree adjoining
grammar. In Proc. LACL 2005, Bordeaux, 2005.
Carlos Prolo. (Pro02) Systematic grammar development in the XTAG project. In COLING&#8217;02, 2002.
Fei Xia. (Xia01) Automatic Grammar Generation from two Different Perspectives. PhD thesis, Univer-
sity of Pennsylvania, 2001.</p>

</div></div>
</body></html>