<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Comment obtenir plus des M&#233;ta-Grammaires</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#150;10 juin 2005
</p>
<p>Comment obtenir plus des M&#216;ta-Grammaires
</p>
<p>Fran&#231;ois Thomasset, Eric Villemonte de la Clergerie
ATOLL - INRIA
</p>
<p>Domaine de Voluceau
Rocquencourt, B.P. 105, 78153 Le Chesnay (France)
</p>
<p>{Francois.Thomasset,Eric.De_La_Clergerie}@inria.fr
</p>
<p>Mots-clefs : M&#233;ta-grammaires, Analyse Syntaxique, TAG, TIG
Keywords: Meta-grammars, Parsing, TAG, TIG
</p>
<p>R&#216;sum&#216; Cet article pr&#233;sente un environnement de d&#233;veloppement pour les m&#233;ta-grammaires
(MG), utilis&#233; pour concevoir rapidement une grammaire d&#8217;arbres adjoints (TAG) du fran&#231;ais &#224;
large couverture et n&#233;anmoins tr&#232;s compacte, gr&#226;ce &#224; des factorisations d&#8217;arbres. Exploitant
les fonctionnalit&#233;s fournies par le syst&#232;me DYALOG, cette grammaire a permis de construire
un analyseur syntaxique hybride TAG/TIG utilis&#233; dans le cadre de la campagne d&#8217;&#233;valuation
syntaxique EASY.
</p>
<p>Abstract This paper presents a development environment for Meta-Grammars (MG),
used to design, in a short period, a wide coverage but still very compact Tree Adjoining Gram-
mar (TAG) for French, thanks to tree factorizations. Exploiting the functionalities provided by
DYALOG system, an hybrid TAG/TIG parser was compiled from the grammar and used for the
EASY parsing evaluation campaign.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Thomasset, Eric Villemonte de la Clergerie
</p>
<p>1 Introduction
</p>
<p>Les m&#233;ta-grammaires (MG) (Candito, 1999) renouvellent les m&#233;thodes de conception des gram-
maires, en introduisant un niveau plus abstrait de description &#224; l&#8217;aide de contraintes &#233;l&#233;men-
taires, regroup&#233;es en classes relativement simples, elles-m&#234;mes ins&#233;r&#233;es dans une hi&#233;rarchie
multiple d&#8217;h&#233;ritage. Une phase de compilation permet ensuite de croiser ces classes et d&#8217;utiliser
les contraintes pour d&#233;river des structures grammaticales pour un formalisme cible comme les
grammaires d&#8217;arbres adjoints (TAG) ou les grammaires fonctionnelles lexicales (LFG) (Gaiffe
et al., 2003; Cl&#233;ment &amp; Kinyon, 2003). Les descriptions deviennent plus modulaires et per-
mettent la factorisation d&#8217;ensembles de contraintes communs &#224; plusieurs ph&#233;nom&#232;nes syn-
taxiques (comme des r&#232;gles d&#8217;accord). L&#8217;h&#233;ritage permet d&#8217;affiner progressivement la descrip-
tion d&#8217;un ph&#233;nom&#232;ne, par exemple pour la structure verbale. Il rend aussi raisonnable l&#8217;espoir
qu&#8217;une partie de l&#8217;organisation en classes ainsi qu&#8217;une partie du contenu des classes puissent
&#234;tre conserv&#233;es d&#8217;une langue &#224; une autre et d&#8217;un formalisme cible &#224; un autre.
</p>
<p>Ces raisons nous ont conduit &#224; choisir les m&#233;ta-grammaires pour concevoir rapidement un ana-
lyseur syntaxique hybride TAG/TIG du fran&#231;ais &#224; large couverture, analyseur qui a finalement
pu &#234;tre d&#233;ploy&#233; dans le cadre de la campagne EASY d&#8217;&#233;valuation d&#8217;analyseurs syntaxiques.
N&#233;anmoins, nos premi&#232;res tentatives ont montr&#233; certaines limites dans les capacit&#233;s descriptives
des MG mais ont &#233;galement sugg&#233;r&#233; des possibilit&#233;s pour obtenir &#224; peu de frais des grammaires
TAG beaucoup plus compactes. En effet, il est bien connu que les grammaires TAG &#224; large
couverture ont tendance &#224; exploser en nombre d&#8217;arbres, avec plusieurs milliers ou dizaines de
milliers de (sch&#233;mas d&#8217;) arbres (Abeill&#233;, 2002), ce qui rend tr&#232;s difficile l&#8217;analyse, m&#234;me en
exploitant des techniques de filtrage par les mots de la cha&#238;ne d&#8217;entr&#233;e. Les alternatives propo-
s&#233;es passent par des techniques d&#8217;analyse des arbres pour retrouver et factoriser leurs parties
communes (Carroll et al., 1998) ou par la description de sch&#233;mas de parcours multiples dans
les arbres (Harbusch &amp; Woch, 2004). Les m&#233;ta-grammaires s&#8217;appuyant sur des descriptions
factoris&#233;es nous permettent d&#8217;aller plus facilement dans la direction de tels arbres factoris&#216;s.
Le syst&#232;me DYALOG que nous utilisons pour la construction d&#8217;analyseurs syntaxiques peut
g&#233;rer de tels arbres factoris&#233;s (Section 2). En cons&#233;quence, en parall&#232;le avec la conception
d&#8217;une m&#233;ta-grammaire du fran&#231;ais, nous avons &#233;tendu les possibilit&#233;s descriptives des MG et
les possibilit&#233;s g&#233;n&#233;ratives de notre compilateur de MG (Section 3). Nous avons &#233;galement
compl&#233;t&#233; notre environnement de travail pour les MG. La section 4 fournit quelques &#233;l&#233;ments
d&#8217;information sur notre m&#233;ta-grammaire et sur la grammaire r&#233;sultante, en particulier au niveau
de la compacit&#233;. Enfin, la section 5 fournit quelques r&#233;sultats pr&#233;liminaires pour notre analyseur.
</p>
<p>2 Analyseurs hybrides TAG/TIG avec le syst&#321;me DYALOG
</p>
<p>Le syst&#232;me DYALOG (Villemonte de la Clergerie, 2002) fournit un environnement de compi-
lation et d&#8217;ex&#233;cution d&#8217;analyseurs syntaxiques tabulaires (&#224; la Earley) offrant la puissance d&#8217;un
langage de programmation en logique. Il couvre divers formalismes syntaxiques, dont ceux
utilis&#233;s dans notre exp&#233;rience, &#224; savoir les Grammaires d&#8217;Arbres Adjoints (TAG) et les Gram-
maires d&#8217;Insertion d&#8217;Arbres (TIG).
</p>
<p>Les TAG (Joshi, 1987) sont form&#233;es d&#8217;arbres partiels d&#8217;analyse combinables par substitution et
adjonction. Un n&#339;ud feuille &#233;tiquet&#233; par un non-terminal peut &#234;tre substitu&#233; par un arbre initial.
Une adjonction ins&#232;re le contenu d&#8217;un arbre auxiliaire &#946; au niveau d&#8217;un n&#339;ud N , le sous-arbre</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comment obtenir plus des M&#233;ta-Grammaires
</p>
<p>de racine N &#233;tant rattach&#233; au niveau du pied f&#946; de &#946;. Dans les FTAG, les n&#339;uds sont d&#233;cor&#233;s
par une paire d&#8217;attributs top et bot, g&#233;n&#233;ralement exprim&#233;s comme des structures de traits.
</p>
<p>Les TIG (Schabes &amp; Waters, 1995) sont une variante des TAG restreignant les arbres auxiliaires
de sorte qu&#8217;ils ne puissent s&#8217;ins&#233;rer qu&#8217;&#224; droite ou &#224; gauche du n&#339;ud d&#8217;adjonction. Cette condi-
tion implique en particulier que les arbres auxiliaires aient leur dorsale (c.a.d. le chemin de la
racine au pied) comme fronti&#232;re gauche ou droite. L&#8217;int&#233;r&#234;t majeur des TIG provient du fait
qu&#8217;elles sont analysables, comme les CFG, avec une complexit&#233; en O(n3) alors que les TAG le
sont en O(n6) o&#249; n d&#233;note la longueur de la cha&#238;ne d&#8217;entr&#233;e. De plus, la plupart des grammaires
TAG sont essentiellement TIG et il est en fait possible de construire des analyseurs syntaxiques
hybrides TAG/TIG (Alonso &amp; D&#237;az, 2003). DYALOG peut analyser une grammaire TAG pour
identifier les parties TIG afin de construire de tels analyseurs hybrides TAG/TIG1.
</p>
<p>Pour les diff&#233;rents formalismes syntaxiques qu&#8217;il couvre, le syst&#232;me DYALOG permet, &#224; l&#8217;in-
t&#233;rieur des structures grammaticales, l&#8217;usage d&#8217;op&#216;rateurs r&#216;guliers tels que la disjonction,
l&#8217;&#233;toile de Kleene et l&#8217;entrelacement, ce dernier permettant d&#8217;indiquer un ordre libre entre
des s&#233;quences de constituants (Nederhof et al., 2003). Ces op&#233;rateurs ne changent pas le for-
malisme sous-jacent car ils peuvent en th&#233;orie &#234;tre expans&#233;s et &#233;limin&#233;s en introduisant de
nouvelles structures grammaticales (arbres ou productions) et/ou de nouveaux non-terminaux.
N&#233;anmoins, le taux d&#8217;expansion peut &#234;tre exponentiel en le nombre d&#8217;occurrences de ces op&#233;ra-
teurs. Leur utilisation permet donc d&#8217;obtenir des grammaires beaucoup plus compactes et plus
efficaces, car ces op&#233;rateurs sont utilis&#233;s sans expansion. D&#8217;autre part, il est &#224; noter que l&#8217;usage
de ces op&#233;rateurs rend plus naturel les for&#234;ts de d&#233;rivations en &#233;vitant l&#8217;usage de non-terminaux
artificiels.
</p>
<p>3 &#201;tendre les MetaGrammaires
</p>
<p>1 c l a s s c o l l e c t _ r e a l _ s u b j e c t _ c a n o n i c a l {
2 &lt; : c o l l e c t _ r e a l _ s u b j e c t ;
3 $ a r g . e x t r a c t e d = va lue (~ c l e f t ) ;
4 S &gt;&gt; VSubj ; VSubj &lt; V ; V &gt;&gt; p o s t s u b j ; VMod &lt; p o s t s u b j ;
5 node p o s t s u b j : [ c a t : N2 , i d : s u b j e c t , t y p e : s u b s t , t o p : [ wh :&#8722; , s a t : + ] ] ;
6 &#8722; p o s t s u b j : : ag reemen t ; p o s t s u b j = p o s t s u b j : :N;
7 p o s t s u b j =&gt;
8 node ( I n f l ) . b o t . i n v = va lue ( + ) ,
9 $ a r g . e x t r a c t e d = va lue (&#8722;) , $ a r g . r e a l = va lue ( N2 ) ,
</p>
<p>10 desc . e x t r a c t i o n = va lue (~&#8722;) ,
11 node (V) . t o p . mode= va lue (~ i n f i n i t i v e | i m p e r a t i v e | g e r u n d i v e | p a r t i c i p l e ) ;
12 ~ p o s t s u b j =&gt; node ( I n f l ) . b o t . i n v = va lue (~ + ) ;
13 }
</p>
<p>Listing 1 &#8211; Exemple de classe
</p>
<p>Le listing 1 illustre une classe fille collect_real_subject_canonical h&#233;ritant de la
classe parente collect_real_subject. Cette derni&#232;re d&#233;crit l&#8217;ensemble des r&#233;alisations
possibles du sujet et est utilis&#233;e comme mod&#232;le pour les diverses r&#233;alisations du sujet en position
canonique ou en extraction cliv&#233;e2. La classe fille compl&#232;te la classe parente pour le cas cano-
</p>
<p>1Il est &#224; noter que cette analyse ne garantit pas toujours l&#8217;&#233;quivalence entre analyseurs TAG et analyseurs
hybrides TAG/TIG suite aux d&#233;corations et &#224; des gestions diff&#233;rentes de l&#8217;adjonction, &#224; savoir adjonction &#171;cha&#238;n&#233;e&#187;
(sur les racines des arbres auxiliaires) pour les TAG contre adjonction multiple pour les TIG.
</p>
<p>2Type &#171; C&#8217;est de travailler qui me fatigue ! &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Thomasset, Eric Villemonte de la Clergerie
</p>
<p>nique, en pr&#233;cisant la position du sujet (sous S et devant le noyau verbal V) et en introduisant la
notion de sujet post-verbal uniquement r&#233;alisable par un groupe nominal (N2).
</p>
<p>Plus formellement, les m&#233;ta-grammaires permettent une description syntaxique &#233;clat&#233;e &#224; l&#8217;aide
de contraintes &#233;l&#233;mentaires regroup&#233;es en classes. Une classe peut h&#233;riter des contraintes de
plusieurs classes parentes (&lt;:, ligne 2) et peut &#233;galement fournir une ressource (+r) ou requ&#233;rir
une ressource (&#8722;r, l. 6).
Les contraintes peuvent porter sur les n&#339;uds (l. 4 et 6) incluant l&#8217;&#233;galit&#233; =, la pr&#233;c&#233;dence &lt;
ainsi que les dominances imm&#233;diates &gt;&gt; et indirectes &gt;&gt;+. Les contraintes peuvent aussi porter
sur les d&#233;corations des n&#339;uds (l. 5) ou de la classe elle-m&#234;me (desc, l. 10). Les d&#233;corations
sont exprim&#233;es comme des structures de traits (l. 5) avec possibilit&#233; d&#8217;utiliser des disjonctions
| et n&#233;gations ~ sur des valeurs atomiques (l. 11) ainsi que des variables ($arg). Les contraintes
sur les d&#233;corations s&#8217;expriment soit directement soit au travers d&#8217;&#233;quations entre chemins de
traits ancr&#233;s sur des n&#339;uds (l. 8), sur la classe elle-m&#234;me (desc, ligne 10) ou sur des variables
(l. 9). Des macros peuvent &#234;tre utilis&#233;es pour nommer des valeurs ou des chemins. Enfin, il est
possible de faire porter des contraintes sur le p&#232;re d&#8217;un n&#339;ud N avec la notation &#171; father (N)&#187;.
</p>
<p>L&#8217;objectif du compilateur de m&#233;ta-grammaire3 est alors de croiser, par point fixe, les classes
terminales (c.a.d. sans descendants) de mani&#232;re &#224; obtenir des classes neutres pour lesquelles
chaque ressource fournie est consomm&#233;e et r&#233;ciproquement. Les contraintes sont accumul&#233;es
lors des croisements et seules sont conserv&#233;es les classes dont les contraintes accumul&#233;es, pre-
nant en compte leurs cons&#233;quences logiques, sont satisfiables4 . Les contraintes des classes
neutres survivantes sont ensuite exploit&#233;es pour produire les structures grammaticales mini-
males, en l&#8217;occurrence des arbres pour les TAG.
</p>
<p>Dans la formalisation standard des MG (Candito, 1999), une ressource peut &#234;tre neutralis&#233;e
au plus une fois pour produire une classe neutre. Cette restriction am&#232;ne &#224; dupliquer certaines
classes pour nommer diff&#233;remment la m&#234;me ressource. Ainsi, pour exprimer qu&#8217;une classe
d&#233;crivant les verbes a besoin de 2 arguments verbaux, il faut dupliquer une partie importante
de la hi&#233;rarchie des classes pour deux ressources similaires -varg1 et -varg2. Pour lever
cette limitation, nous avons introduit la notion d&#8217;espace de noms et rompu la sym&#233;trie entre
fournisseurs et consommateurs : une ressource peut maintenant &#234;tre demand&#233;e dans un certain
espace de nom ns (ns = postsub dans &#8722;postsubj::agreement, l. 6) et lors d&#8217;un croisement avec
une classe fournisseuse C (ici, fournissant +agreement), les n&#339;uds, variables et besoins de C
sont alors plong&#233;s dans l&#8217;espace de nom ns (ici postsubj ). Les espaces de noms permettent un
usage beaucoup plus intensif du m&#233;canisme de ressources et une bien meilleure factorisation
des m&#233;ta-grammaires. Les MG sont alors moins redondantes et plus faciles &#224; maintenir.
</p>
<p>Les d&#233;corations port&#233;es par les n&#339;uds et la classe sont libres mais certaines ont n&#233;anmoins un
statut sp&#233;cial par rapport &#224; la g&#233;n&#233;ration des arbres TAG. Pour les n&#339;uds, on peut citer les traits
cat pour la cat&#233;gorie syntaxique, type pour le type de n&#339;ud, lex pour une valeur lexicale,
adj pour indiquer le statut du n&#339;ud pour l&#8217;adjonction, top et bot comme arguments. Pour
les classes, le trait ht indique l&#8217;hypertag qui sera associ&#233; aux arbres pour permettre l&#8217;ancrage
avec les entr&#233;es lexicales (voir Section 4).
</p>
<p>La possibilit&#233; d&#8217;engendrer des arbres factoris&#216;s r&#233;sulte de divers m&#233;canismes. En premier lieu, &#224;
c&#244;t&#233; des types standards de n&#339;uds, il existe les types sp&#233;ciaux alternative et sequence.
Le trait optional permet de rendre optionnel un n&#339;ud tandis que le trait star permet de
</p>
<p>3D&#233;velopp&#233; sous le syst&#232;me DYALOG.
4Par exemple, le compilateur v&#233;rifie qu&#8217;un noeud ne pr&#233;c&#232;de pas son p&#232;re.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comment obtenir plus des M&#233;ta-Grammaires
</p>
<p>rendre un n&#339;ud r&#233;p&#233;table, correspondant &#224; une &#233;toile de Kleene5. Enfin, lors de l&#8217;&#233;num&#233;ra-
tion des arbres minimaux v&#233;rifiant un ensemble de contraintes, le compilateur utilise l&#8217;op&#233;ra-
teur d&#8217;entrelacement (##) pour rendre compte de sous-sp&#233;cification de pr&#233;c&#233;dence entre n&#339;uds
fr&#232;res. Ainsi, les contraintes &#171;N &gt;&gt; N_1; N&gt;&gt; N_2; N &gt;&gt; N_3; N_1 &lt; N_2&#187; produisent le fragment
d&#8217;arbre N((N1, N2)##N3) indiquant que N3 se positionne librement (avant, au milieu, apr&#232;s)
par rapport &#224; la s&#233;quence N1, N2. Pour favoriser l&#8217;obtention d&#8217;arbres TIG, le compilateur &#233;vite,
dans la mesure du possible, d&#8217;utiliser l&#8217;op&#233;rateur d&#8217;entrelacement quand il couvre un n&#339;ud
pied comme dans R&#946;(N##F&#946;). Dans ce cas, les diff&#233;rentes possibilit&#233;s d&#8217;ordonnancement
des n&#339;uds sont examin&#233;es pour produire des arbres que l&#8217;on esp&#232;re &#234;tre TIG. Il est &#233;galement
possible d&#8217;assigner un rang &#224; un n&#339;ud avec le trait rank et les valeurs first et last.
</p>
<p>L&#8217;optionnalit&#233; fournie par l&#8217;emploi du trait optional n&#8217;est pas assez fine en pratique. L&#8217;em-
ploi de gardes permet d&#8217;imposer des conditions &#224; l&#8217;existence d&#8217;un n&#339;ud (l. 7) ou &#224; sa non-
existence (l. 12). Ces gardes s&#8217;expriment comme des expressions bool&#233;ennes sur des &#233;quations
entre chemins. Le compilateur de MG v&#233;rifie la satisfiabilit&#233; de ces gardes, &#233;liminant les alter-
natives conduisant &#224; des &#233;checs et les &#233;quations devenues tautologiquement vraies. Les gardes
restantes sont alors &#233;mises dans les arbres TAG pour &#234;tre &#233;valu&#233;es pendant l&#8217;analyse.
</p>
<p>Outre les extensions des m&#233;ta-grammaires et du compilateur, le travail de description a &#233;t&#233; fa-
cilit&#233; par le d&#233;ploiement d&#8217;un environnement de travail adapt&#233; pour pouvoir ais&#233;ment visualiser
et tester. En premier lieu, nous disposons d&#8217;un mode Emacs pour les MG interagissant avec
un outil graphique de visualisation de la hi&#233;rarchie des classes. Par ailleurs, la cha&#238;ne de trai-
tement allant des m&#233;ta-grammaires aux analyseurs produit des repr&#233;sentations interm&#233;diaires
sous formats XML6 pouvant &#234;tre visualis&#233;es, en particulier sous forme HTML pour les arbres,
d&#233;corations et gardes. Les for&#234;ts de d&#233;rivations produites par notre analyseur sont &#233;galement
convertibles en XML et visualisables sous diff&#233;rentes formes, en particulier sous forme de d&#233;-
pendances. L&#8217;utilisation d&#8217;un serveur d&#8217;analyseurs7 coupl&#233; &#224; divers scripts facilite la conduite
de tests sur corpus, pour mesurer divers param&#232;tres (temps d&#8217;analyse, taux d&#8217;ambigu&#239;t&#233;, taux
de couverture, . . . ) et indiquer les diff&#233;rences entre 2 s&#233;ries de tests. Enfin, il est possible de
d&#233;sactiver des classes8 pour d&#233;boguer ou, &#224; terme, pour obtenir des grammaires sp&#233;cialis&#233;es.
Ces diverses possibilit&#233;s permettent un suivi fin des performances de la grammaire engendr&#233;e.
</p>
<p>4 Anatomie de la grammaire produite
</p>
<p>Gr&#226;ce aux r&#233;sultats d&#233;crits pr&#233;c&#233;demment, nous avons pu rapidement concevoir une m&#233;ta-
grammaire du fran&#231;ais engendrant une grammaire tr&#232;s compacte, comme le montrent les di-
verses tables de la figure 1. Ainsi, la grammaire ne comporte que 133 arbres, incluant 7 arbres
construits manuellement. Elle est essentiellement TIG avec seulement 12 arbres auxiliaires en-
veloppants principalement utilis&#233;s pour g&#233;rer les diverses formes de guillemets9. La grammaire
n&#8217;est pas totalement lexicalis&#233;e, avec un nombre assez important d&#8217;arbres sans ancre (mais
</p>
<p>5&#192; terme, la valeur du trait sera exploit&#233;e pour pouvoir sp&#233;cifier un intervalle de r&#233;p&#233;tition.
6Ces formats XML s&#8217;appuient de plus sur les propositions de normalisation, &#224; savoir TAGML pour les TAG et
</p>
<p>FSR pour les structures de traits.
7Accessible en ligne sur http://atoll.inria.fr/parserdemo.
8Il est en fait possible d&#8217;activer ou d&#233;sactiver de mani&#232;re plus fine, en exprimant un ensemble de contraintes
</p>
<p>invalidant une classe.
9Pour &#234;tre plus pr&#233;cis, ces arbres sont uniquement utilis&#233;s pour les guillemets autour de groupes, ceux autour
</p>
<p>de mots simples sont g&#233;r&#233;s avant analyse syntaxique. Le traitement propos&#233; est clairement une source d&#8217;ineffi-
cacit&#233; pouvant peut-&#234;tre &#234;tre g&#233;r&#233; autrement. Par ailleurs, il est &#224; noter que le compilateur MG a produit plus</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Thomasset, Eric Villemonte de la Clergerie
</p>
<p>poss&#233;dant &#233;ventuellement des n&#339;uds lexicaux), essentiellement utilis&#233;s pour des adjonctions10.
Les arbres ancr&#233;s le sont surtout par les verbes mais ils ne repr&#233;sentent qu&#8217;une infime fraction
d&#8217;un ensemble &#233;quivalent d&#8217;arbres TAG non factoris&#233;s. On voit que 7 arbres suffisent &#224; cou-
vrir un ensemble cons&#233;quent de constructions verbales &#171; canoniques &#187;. Ces r&#233;sultats d&#233;coulent
d&#8217;un usage intensif de la factorisation dans les arbres, en particulier contr&#244;l&#233;e par des gardes.
L&#8217;&#233;toile de Kleene est uniquement utilis&#233;e pour g&#233;rer la coordination tandis que les entrelace-
ments proviennent essentiellement d&#8217;un ordre libre entre arguments du verbe (incluant le sujet
post-verbal). Les arbres factoris&#233;s obtenus peuvent &#234;tre relativement cons&#233;quents (jusqu&#8217;&#224; 46
n&#339;uds) mais la figure 1(e) montre n&#233;anmoins que la plupart des arbres restent simples.
</p>
<p>Classes Arbres Init. Aux. Aux. Env. Aux. Gauches Aux. Droits
191 133=126+7 44 89 12 29 48
</p>
<p>(a) Distribution par types d&#8217;arbres
</p>
<p>non ancr&#233;s v coo adv adj csu prep aux np nc det pro
50 27 12 10 8 4 3 2 2 1 1 1
</p>
<p>(b) Distribution par ancres
</p>
<p>Canonique Extr. Actif Passif Quest. Rel. Cliv&#233;es Coord Adv Adj
7 19 19 6 4 4 11 12 14 11
</p>
<p>(c) Distribution par ph&#233;nom&#232;nes syntaxiques
</p>
<p>Gardes Disjonctions Entrelacement &#201;toiles de Kleene
820 92 26 13
</p>
<p>(d) Distribution des factorisations
</p>
<p>noeuds
1 3 5 7 9 11 13 15 17 19 21 23 25 27 29 31 33 35 37 39 41 43 45
</p>
<p>a
rb
</p>
<p>re
s
</p>
<p>0
</p>
<p>5
</p>
<p>10
</p>
<p>15
</p>
<p>20
</p>
<p>25
</p>
<p>30
</p>
<p>35
</p>
<p>2 3
</p>
<p>16
</p>
<p>35
</p>
<p>14
</p>
<p>9
</p>
<p>14
</p>
<p>3
1 1 2 1 1 2
</p>
<p>3
1 1
</p>
<p>3
1
</p>
<p>3 2 3 1 2 1 1
</p>
<p>arbres
</p>
<p>(e) Distribution des tailles d&#8217;arbres
</p>
<p>FIG. 1 &#8211; Anatomie de la grammaire
</p>
<p>La complexit&#233; des arbres factoris&#233;s est illustr&#233;e par la figure 2 repr&#233;sentant une vue simplifi&#233;e
d&#8217;un des arbres verbaux canoniques pour la voix active. Cet arbre #111 r&#233;sulte du croisement
de 25 classes terminales, comprend 43 n&#339;uds plus 3 n&#339;uds d&#8217;alternatives et 1 n&#339;ud d&#8217;entre-
lacement, et est contr&#244;l&#233; par 35 gardes11. Il est difficile d&#8217;obtenir le taux exact de factorisation
atteint, mais voici n&#233;anmoins quelques param&#232;tres indicatifs pour essayer de l&#8217;estimer :
</p>
<p>d&#8217;arbres auxiliaires que n&#233;cessaire pour &#233;viter d&#8217;avoir des pseudo-arbres enveloppants et que certains ph&#233;nom&#232;nes
syntaxiques pouvant produire des arbres enveloppants ont &#233;t&#233; brid&#233;s pour obtenir des arbres TIG.
</p>
<p>10Cette non lexicalisation partielle est guid&#233;e par des raisons pragmatiques (limitation du nombre d&#8217;arbres) mais
&#233;galement linguistiques. Elle ne remet pas en cause la notion de domaine de localit&#233; s&#233;mantique des arbres TAG. Au
contraire, l&#8217;accroche d&#8217;une participiale sur un nom, par exemple, est non lexicalis&#233;e car distincte (s&#233;mantiquement)
de la construction d&#8217;une participiale.
</p>
<p>11Un tel arbre avec toutes ses gardes et d&#233;corations serait extr&#234;mement difficile &#224; &#233;crire &#224; la main (2171 lignes
de XML TAGML), ce qui justifie d&#8217;autant plus le recours &#224; une m&#233;ta-grammaire.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comment obtenir plus des M&#233;ta-Grammaires
</p>
<p>S
</p>
<p>VMod
</p>
<p>|
</p>
<p>&#5;cln &#8595;N2 &#8595;CS &#8595;S &#8595;PP
</p>
<p>V
</p>
<p>VMod
</p>
<p>V1
</p>
<p>&#5;clneg &#5;advneg &#5;clr clseq
&#5;cld &#5;cla &#5;cld &#5;cll &#5;clg
</p>
<p>Infl
</p>
<p>3v &#5;cln
clseq
</p>
<p>##
</p>
<p>&#8595;N2 VMod
&#5;advneg |
</p>
<p>CS
</p>
<p>&#5;prep ce &#5;csu &#8595;S
&#8595;PP
</p>
<p>VMod
</p>
<p>&#5;advneg |
&#8595;N2 &#8595;comp &#8595;PP
</p>
<p>FIG. 2 &#8211; Arbre #111 (simplifi&#233;)
</p>
<p>subjreal = 5 choix de r&#233;alisations pour un sujet pr&#233;-verbal : cln (clitique nominatif), N2
(groupe nominal), CS (phrase), S (infinitive), PP (infinitive introduite par &#171; d&#8217; &#187;) ;
</p>
<p>subjpos choix entre &#171; pas de sujet &#187;, &#171; sujet pr&#233;-verbal &#187;, &#171; sujet pr&#233;-verbal et clitique post-
verbal &#187;, &#171; clitique post-verbal &#187;, &#171; sujet post-verbal &#187; ;
</p>
<p>argspos = 3 entrelacements entre 2 arguments post-verbaux et un sujet post-verbal, tous op-
tionnels ;
</p>
<p>clseqpos = X choix entre 2 s&#233;quences de clitiques pr&#233; ou post verbaux optionnels : cld, cla,
cld, cll, clg ;
</p>
<p>clopt = 2 clitiques pr&#233;-verbaux optionnels : clneg (&#171; ne &#187;), clr (r&#233;flexif) ;
neg = 3 positions de n&#233;gation (advneg &#171; que &#187; sur les arguments verbaux ou advneg pr&#233;-verbal
</p>
<p>pour les infinitives) ;
arg1real = 3 r&#233;alisations possibles pour arg1 : N2 (objet), comp (attribut), PP (groupe pr&#233;po-
</p>
<p>sitionnel nominal, adjectival, infinitif, compl&#233;tif, . . . ) ;
arg2real = 2 r&#233;alisations possibles (au moins) pour arg2 (CS,PP) ;
</p>
<p>Divers calculs approch&#233;s donnent un taux de factorisation entre 10 000 et 100 000, sans m&#234;me
prendre compl&#232;tement en compte les disjonctions apport&#233;es par certaines gardes. Ce taux d&#8217;ex-
pansion astronomique est bien entendu tr&#232;s largement au-dessus de la r&#233;alit&#233; si on prend mieux
en compte la satisfiabilit&#233; des gardes. N&#233;anmoins, m&#234;me un taux d&#8217;expansion plus r&#233;aliste de
l&#8217;ordre de 100 ou 1000 montre l&#8217;int&#233;r&#234;t des ces structures factoris&#233;es, difficilement construc-
tibles manuellement sans le support apport&#233; par les m&#233;ta-grammaires. De plus, les exp&#233;riences
men&#233;es ont montr&#233; que l&#8217;analyse reste efficace m&#234;me avec des structures aussi complexes12.
</p>
<p>Un arbre comme l&#8217;arbre #111 couvre de fait de tr&#232;s nombreuses constructions syntaxiques,
bien plus en g&#233;n&#233;ral que celles autoris&#233;es pour un mot donn&#233;. L&#8217;ancrage entre mots et arbres,
ainsi que la s&#233;lection des constructions autoris&#233;es pour un mot se fait par unification entre des
structures de traits appel&#233;es hypertag associ&#233;s aux arbres et aux mots (Kinyon, 2000)13. Ainsi
la figure 3(a) donne l&#8217;hypertag produit pour l&#8217;arbre #111 tandis que la figure 3(b) montre un
des hypertags mentionn&#233;s pour &#171; promettre &#187; dans notre lexique. Parmi toutes les constructions
possibles pour l&#8217;arbre #111, l&#8217;unification s&#233;lectionne uniquement les constructions verbales
canoniques autorisant un objet optionnel et un groupe pr&#233;positionnel optionnel introduit par
</p>
<p>12En g&#233;n&#233;ral, les mauvaises performances r&#233;sultent plut&#244;t d&#8217;arbres sous-contraints faisant exploser le nombre
d&#8217;analyses.
</p>
<p>13Ce m&#233;canisme d&#8217;ancrage par hypertags rend caduque la notion trop rigide de famille d&#8217;arbres pr&#233;sente dans
l&#8217;architecture XTAG (Doran et al., 1994).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Thomasset, Eric Villemonte de la Clergerie
</p>
<p>&#171; &#224; &#187;14. Le lien entre hypertag H et des constructions syntaxiques se fait gr&#226;ce aux variables
pr&#233;sentes dansH et dans les d&#233;corations des n&#339;uds ou dans les &#233;quations des gardes.
&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>arg0 arg0
</p>
<p>&#63726;&#63727;&#63727;&#63728;
extracted -
kind subj
pcas -
real real0 - |CS |N2 | PP | S | cln | prel | pri
</p>
<p>&#63737;&#63738;&#63738;&#63739;
</p>
<p>arg1 arg1
</p>
<p>&#63726;&#63727;&#63727;&#63728;
extracted -
kind kind1 - | acomp | obj | prepacomp | prepobj
pcas pcas1 + | - | apres | &#224; | avec | de | par | . . .
real real1 - |CS |N |N2 | PP | S |V | adj | cla | . . .
</p>
<p>&#63737;&#63738;&#63738;&#63739;
</p>
<p>arg2 arg2
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>extracted -
kind kind2 - | prepacomp | prepobj | preps-
</p>
<p>comp | prepvcomp | scomp |
vcomp | whcomp
</p>
<p>pcas pcas2 + | - | apres | &#224; | ...
real real2 - |CS |N |N2 | PP | S | ...
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
cat v
diathesis active
refl refl
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
(a) pour l&#8217;arbre #111
</p>
<p>&#63726;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63727;&#63728;
</p>
<p>arg0
</p>
<p>[
kind subj | -
pcas -
</p>
<p>]
</p>
<p>arg1
</p>
<p>[
kind obj | scomp | -
pcas -
</p>
<p>]
</p>
<p>arg2
</p>
<p>[
kind prepobj | -
pcas &#224; | -
</p>
<p>]
refl -
</p>
<p>&#63737;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63738;&#63739;
(b) pour &#171;promettre&#187;
</p>
<p>FIG. 3 &#8211; Hypertags
</p>
<p>5 Exp&#216;riences
L&#8217;analyseur hybride TAG/TIG compil&#233; &#224; partir de la grammaire a &#233;t&#233; test&#233; sur divers corpus tout
au long de la phase de d&#233;veloppement et pendant la campagne EASY. Les analyses s&#8217;effectuent
sur des treillis de mots (pour g&#233;rer les ambigu&#239;t&#233;s morpho-syntaxiques et les mots inconnus) en
s&#8217;appuyant sur un lexique de plus de 400 000 formes fl&#233;chies fournissant des informations de
sous-cat&#233;gorisation pour les verbes. Nous n&#8217;avons pas utilis&#233; d&#8217;&#233;tiqueteur morpho-syntaxique.
L&#8217;analyseur s&#8217;appuie sur une strat&#233;gie d&#8217;analyse tabulaire descendante gauche-droite et peut
rendre soit une analyse compl&#232;te de la phrase soit un ensemble d&#8217;analyses partielles couvrant
au mieux l&#8217;entr&#233;e. Les analyses sont extraites sous forme de for&#234;ts partag&#233;es de d&#233;rivations,
convertibles en for&#234;ts partag&#233;es de d&#233;pendances. Ces for&#234;ts nous servent de base pour calculer
un taux moyen d&#8217;ambigu&#239;t&#216; par mot &#945; d&#233;fini comme le nombre moyen d&#8217;arcs de d&#233;pendances
atteignant un mot moins un15.
</p>
<p>Corpus #phrases % couv. temps moyen (s) temps m&#233;dian (s) ambigu&#239;t&#233;
EUROTRA / OLD 334 95.80 / 89.22 1.81 / 0.70 1.27 / 0.54 0.7 / 0.3
TSNLP / OLD 1661 93.38 / 86.15 0.72 / 0.43 0.56 / 0.33 0.4 / 0.2
MD10x20 / OLD 5000 63.18 / 43.06 2.85 / 1.97 1.80 / 1.30 0.8 / 0.5
EASY 34438 42.45 / - 5.55 / - 1.61 / - 0.6 / -
</p>
<p>TAB. 1 &#8211; R&#233;sultats (avec un timeout de 100s)
14La s&#233;lection des constructions avec une compl&#233;tive (scomp) se fait avec un autre arbre.
15Pour une analyse non-ambigu&#235;, tout mot sauf la &#171; t&#234;te &#187; de la phrase est atteignable par une seule d&#233;pendance.
</p>
<p>Le nombre maximal d&#8217;analyses pour un taux d&#8217;ambigu&#239;t&#233; &#945; et une phrase de longueur n est en O((1 + &#945;)n).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comment obtenir plus des M&#233;ta-Grammaires
</p>
<p>La table 1 fournit des r&#233;sultats d&#8217;analyses compl&#232;tes de 2 versions successives de l&#8217;analyseur
pour les jeux de tests EUROTRA et TSNLP ainsi que pour MD10x20, un corpus journalistique
de phrases de longueur comprise entre 10 et 20 extraites (na&#239;vement) du &#171; Monde Diploma-
tique &#187; et pour le corpus fourni pour la campagne EASY (couvrant divers styles : journalistique,
litt&#233;raire, oral, mail, m&#233;dical, questions/r&#233;ponses). Les r&#233;sultats de couverture sont excellents
sur les jeux de tests, en particulier &#224; cause d&#8217;un vocabulaire relativement restreint pour lequel
notre lexique est complet. Sur le corpus MD10x20 qui est relativement homog&#232;ne et pour le-
quel un minimum d&#8217;adaptation du lexique a &#233;t&#233; effectu&#233;, les r&#233;sultats restent honorables. Les
r&#233;sultats sont moins bons pour EASY qui est tr&#232;s h&#233;t&#233;rog&#232;ne16. Ce manque de couverture tra-
duit bien &#233;videmment des manques dans la m&#233;ta-grammaire, en particulier sur les coordinations
complexes, les superlatives et les comparatives, ainsi que sur les cadres de sous-cat&#233;gorisation
pour les cat&#233;gories non-verbales et sur certaines articulations de phrase. Cependant, le manque
de couverture provient &#233;galement de notre lexique qui est tr&#232;s r&#233;cent et ne fournit pas n&#233;cessai-
rement des informations syntaxiques compl&#232;tes voire correctes pour tous les mots17.
</p>
<p>La table 1 fournit aussi des r&#233;sultats pour une version ant&#233;rieure de l&#8217;analyseur (OLD) qui illus-
trent l&#8217;importance du suivi constant des grammaires. En effet, nous avons effectu&#233;, sans r&#233;el
contr&#244;le, des modifications de derni&#232;re minute avant EASY pour essayer d&#8217;am&#233;liorer la cou-
verture (extension des cliv&#233;es, g&#233;n&#233;ralisation abusive des incises, articulation des phrases par la
ponctuation, gestion na&#239;ve des verbes support, . . . ). Ces modifications ont bien augment&#233; la cou-
verture, mais, mal contr&#244;l&#233;es, elles ont fait doubler les taux d&#8217;ambigu&#239;t&#233; et les temps d&#8217;analyse
(avec en premi&#232;re approximation, une relation lin&#233;aire entre temps et taux d&#8217;ambigu&#239;t&#233;).
</p>
<p>Enfin, sans corpus de r&#233;f&#233;rence, il nous est impossible pour l&#8217;instant de fournir des r&#233;sultats
concernant la pr&#233;cision des analyses (compl&#232;tes ou partielles). Nous avons effectu&#233; de nom-
breuses v&#233;rifications manuelles sur les vues graphiques des for&#234;ts mais attendons maintenant
les r&#233;sultats de la campagne EASY pour avancer.
</p>
<p>6 Conclusion
</p>
<p>Notre m&#233;ta-grammaire est encore loin d&#8217;&#234;tre compl&#232;te mais l&#8217;exp&#233;rience montre n&#233;anmoins que
les m&#233;ta-grammaires rendent possible le d&#233;veloppement rapide de grammaires &#224; relativement
large couverture. Il est &#224; noter que ce d&#233;veloppement a &#233;t&#233; en partie frein&#233; par le manque d&#8217;in-
formation dans le lexique, en particulier pour avoir une discrimination plus fine des adverbes et
pour traiter les sous-cat&#233;gorisations des adjectifs et des noms.
</p>
<p>Les extensions apport&#233;es aux m&#233;ta-grammaires ainsi que les am&#233;liorations de notre environ-
nement de travail se sont r&#233;v&#233;l&#233;es tr&#232;s utiles. N&#233;anmoins, concevoir une m&#233;ta-grammaire reste
un exercice d&#233;licat demandant une solide expertise linguistique et une utilisation syst&#233;matique
d&#8217;outils de tests et de visualisation. Il nous semble aussi souhaitable d&#8217;ajouter de nouveaux types
de contraintes, m&#234;me si elles peuvent s&#8217;exprimer &#224; l&#8217;aide des contraintes actuelles, comme des
contraintes d&#8217;exclusion entre n&#339;uds, des contraintes de cardinalit&#233; pour exprimer des r&#232;gles to-
pologiques, ou des contraintes de rangs exprimables dans les gardes. Pour aller dans le sens de
grammaires param&#233;trables (autorisant divers niveaux de langue) ou pour aller vers des forma-
lismes cibles distincts, il serait utile de regrouper les contraintes par contextes &#224; l&#8217;int&#233;rieur des
</p>
<p>16On peut aussi pr&#233;ciser que les phrases pour EASY sont en moyenne plus longues.
17Mais nous exploitons progressivement les r&#233;sultats d&#8217;analyse pour rep&#233;rer et corriger les entr&#233;es incorrectes
</p>
<p>ou incompl&#232;tes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois Thomasset, Eric Villemonte de la Clergerie
</p>
<p>classes de mani&#232;re &#224; pouvoir plus facilement n&#8217;en exploiter qu&#8217;une partie lors de la compilation
(en s&#233;lectionnant un ensemble de contextes).
</p>
<p>La factorisation des arbres, rendue possible par l&#8217;emploi de gardes et d&#8217;op&#233;rateurs r&#233;guliers,
nous semble une approche g&#233;n&#233;rique extr&#234;mement prometteuse pour contr&#244;ler l&#8217;explosion com-
binatoire du nombre de structures grammaticales produites, permettant ainsi de construire des
analyseurs syntaxiques plus efficaces. Les arbres factoris&#233;s peuvent &#234;tre complexes mais leur
description au niveau de la m&#233;ta-grammaire reste simple.
</p>
<p>Le formalisme cible TAG que nous avons utilis&#233; est judicieux mais n&#233;anmoins pas suffisamment
puissant pour exprimer &#233;l&#233;gamment certains ph&#233;nom&#232;nes syntaxiques comme les incises ou
certaines extractions (comme l&#8217;extraction de g&#233;nitifs dans &#171; de qui lis-tu un livre &#187;). Nous envi-
sageons d&#8217;&#233;voluer vers des formalismes cibles permettant d&#8217;exprimer plus de sous-sp&#233;cification
dans les arbres, comme par exemple les Local Multi Component TAG, avec l&#8217;ambition, &#224; terme,
de r&#233;duire la distance entre les m&#233;ta-grammaires et le formalisme cible.
</p>
<p>Les outils mentionn&#233;s dans cet article ainsi que la m&#233;ta-grammaire sont librement disponibles18.
</p>
<p>R&#216;f&#216;rences
ABEILL&#201; A. (2002). Une grammaire &#233;lectronique du fran&#231;ais. Paris : CNRS Editions.
ALONSO M. A. &amp; D&#205;AZ V. J. (2003). Variants of mixed parsing of TAG and TIG. Traitement Automa-
tique des Langues (T.A.L.), 44(3), 41&#8211;65.
CANDITO M.-H. (1999). Organisation modulaire et param&#233;trable de grammaires &#233;lectroniques lexica-
lis&#233;es. PhD thesis, Universit&#233; Paris 7.
CARROLL J., NICOLOV N., SMETS M., SHAUMYAN O. &amp; WEIR D. (1998). Grammar compaction and
computation sharing in automata-based parsing. In Proceedings of Tabulation in Parsing and Deduction
(TAPD&#8217;98), p. 16&#8211;25, Paris (FRANCE).
CL&#201;MENT L. &amp; KINYON A. (2003). Generating parallel multilingual LFG-TAG grammars from a
metaGrammar. In Proc. of ACL&#8217;03.
DORAN C., EGEDI D., HOCKEY B. A., SRINIVAS B. &amp; ZAIDEL M. (1994). XTAG system &#8212; a
wide coverage grammar for English. In Proc. of the 15th International Conference on Computational
Linguistics (COLING&#8217;94), p. 922&#8211;928, Kyoto, Japan.
GAIFFE B., CRABB&#201; B. &amp; ROUSSANALY A. (2003). Repr&#233;sentation et gestion du lexique d&#8217;une gram-
maire d&#8217;arbres adjoints. Traitement Automatique des Langues (T.A.L.), 44(3).
HARBUSCH K. &amp; WOCH J. (2004). Integrated natural language generation with schema-tree adjoining
grammars. In C. HABEL &amp; E. THOMAS PECHMANN, Eds., Language Production. Mouton De Gruyter.
JOSHI A. K. (1987). An introduction to tree adjoining grammars. In A. MANASTER-RAMER, Ed.,
Mathematics of Language, p. 87&#8211;115. Amsterdam/Philadelphia : John Benjamins Publishing Co.
KINYON A. (2000). Hypertags. In Proc. of COLING, p. 446&#8211;452.
NEDERHOF M.-J., SATTA G. &amp; SHIEBER S. (2003). Partially ordered multiset context-free grammars
and free-word-order parsing. In In 8th International Workshop on Parsing Technologies (IWPT&#8217;03), p.
171&#8211;182.
SCHABES Y. &amp; WATERS R. C. (1995). Tree insertion grammar : a cubic-time, parsable formalism that
lexicalizes context-free grammar without changing the trees produced. Fuzzy Sets Syst., 76(3), 309&#8211;317.
VILLEMONTE DE LA CLERGERIE E. (2002). Construire des analyseurs avec DyALog. In Proc. of
TALN&#8217;02.
</p>
<p>18Sur http://atoll.inria.fr/packages/packages.html.</p>

</div></div>
</body></html>