<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Grammaire d'Unification Sens-Texte : modularit&#233; et polarisation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p> 
</p>
<p>Grammaire d&#8217;Unification Sens-Texte : modularit&#233; et polarisation 
</p>
<p>Sylvain Kahane (1), Fran&#231;ois Lareau (2) 
</p>
<p>(1) Modyco, U. Paris 10 / Lattice, U. Paris 7  
sk@ccr.jussieu.fr  
</p>
<p>(2) OLST, U. de Montr&#233;al / Lattice, U. Paris 7 
francois.lareau@umontreal.ca 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
L&#8217;objectif de cet article est de pr&#233;senter l&#8217;&#233;tat actuel du mod&#232;le de la Grammaire 
d&#8217;Unification Sens-Texte, notamment depuis que les bases formelles du mod&#232;le ont &#233;t&#233; 
&#233;claircies gr&#226;ce au d&#233;veloppement des Grammaires d&#8217;Unification Polaris&#233;es. L&#8217;accent est mis 
sur l&#8217;architecture du mod&#232;le et le r&#244;le de la polarisation dans l&#8217;articulation des diff&#233;rents 
modules &#8212; l&#8217;interface s&#233;mantique-syntaxe, l&#8217;interface syntaxe-morphotopologie et les 
grammaires d&#233;crivant les diff&#233;rents niveaux de repr&#233;sentation. Nous &#233;tudions comment les 
proc&#233;dures d&#8217;analyse et de g&#233;n&#233;ration sont contr&#244;lables par diff&#233;rentes strat&#233;gies de 
neutralisation des diff&#233;rentes polarit&#233;s. 
</p>
<p>This article presents the Meaning-Text Unification Grammar&#8217;s current state, now that its 
formal foundations have been clarified with the development of Polarized Unification 
Grammars. Emphasis is put on the model&#8217;s architecture and the role of polarization in linking 
the various modules &#8212; semantic-syntax interface, syntax-morphotopology interface and the 
well-formedness grammars of each representation level. We discuss how various polarity 
neutralization strategies can control different analysis and generation procedures. 
</p>
<p>Mots Cl&#233;s &#8211; Keywords 
Th&#233;orie Sens-Texte, interface syntaxe-s&#233;mantique, synchronisation, grammaire d&#8217;unification 
polaris&#233;e, grammaire de d&#233;pendance, grammaire topologique, g&#233;n&#233;ration de textes. 
 
Meaning-Text Theory, syntax-semantics interface, synchronization, polarized unification 
grammar, dependency grammar, topology grammar, text generation. 
</p>
<p>1 Introduction 
L&#8217;objectif de cet article est de pr&#233;senter l&#8217;&#233;tat actuel du mod&#232;le de la Grammaire 
d&#8217;Unification Sens-Texte [GUST], notamment depuis que ses bases formelles ont &#233;t&#233; 
&#233;claircies gr&#226;ce au d&#233;veloppement des Grammaires d&#8217;Unification Polaris&#233;es [GUP]. Le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane et Fran&#231;ois Lareau 
</p>
<p> 
</p>
<p>formalisme des GUP permet de simuler &#233;l&#233;gamment la plupart des formalismes bas&#233;s sur la 
combinaison de structures, notamment les grammaires de r&#233;&#233;criture, TAG, LFG ou HPSG 
(Kahane 2004). Toutefois, GUP a &#233;t&#233; initialement d&#233;velopp&#233; pour donner une assise formelle 
solide &#224; GUST, mais la formalisation de GUST en GUP n&#8217;a encore jamais &#233;t&#233; pr&#233;sent&#233;e. 
</p>
<p>L&#8217;architecture de GUST est bas&#233;e sur la th&#233;orie Sens-Texte (Mel&#8217;cuk 1997 ; Kahane 2001). 
Plusieurs niveaux de repr&#233;sentation de la phrase sont consid&#233;r&#233;s : s&#233;mantique, syntaxique, 
morphotopologique et phonologique. Ces niveaux sont bien s&#233;par&#233;s et chacun poss&#232;de sa 
grammaire propre. La structure s&#233;mantique est un graphe, la structure syntaxique un arbre de 
d&#233;pendance, la structure morphotopologique un arbre ordonn&#233;, et la structure phonologique 
une cha&#238;ne lin&#233;aire. Sur ces structures peuvent s&#8217;ajouter d&#8217;autres structures comme une 
hi&#233;rarchie logique ou une structuration informationnelle au niveau s&#233;mantique ou encore une 
structure prosodique au niveau phonologique, mais nous n&#8217;en parlerons pas ici. De plus, ces 
niveaux sont ordonn&#233;s, du plus profond au plus proche de la surface, ce qui nous donne trois 
modules d&#8217;interface pour passer du sens au &#171; texte &#187; : s&#233;mantique-syntaxe, syntaxe-
morphotopologie et morphotopologie-phonologie. 
</p>
<p>L&#8217;impl&#233;mentation de GUST n&#233;cessite donc un formalisme capable de manipuler diff&#233;rents 
types de structures (graphe, arbre, arbre ordonn&#233;, cha&#238;ne) et de pouvoir les apparier. Comme 
on le verra, le formalisme des GUP est un formalisme math&#233;matique sp&#233;cialement con&#231;u pour 
manipuler aussi simplement que possible de telles structures. Par ailleurs, GUP contr&#244;le la 
saturation des structures qu&#8217;il combine par une polarisation de leurs objets : on peut comparer 
la construction d&#8217;une phrase en GUP &#224; la formation d&#8217;une mol&#233;cule en chimie par la 
neutralisation de la valence des atomes. 
</p>
<p>Notre impl&#233;mentation de GUST fait un grand usage de la polarisation en contr&#244;lant la 
construction des objets (et donc la saturation des structures) par une polarit&#233; propre &#224; chaque 
module, que ce soit une grammaire de bonne formation des structures d&#8217;un niveau donn&#233; ou 
une grammaire d&#8217;interface entre deux niveaux. De plus, chaque module utilise la polarit&#233; des 
modules adjacents pour son articulation avec eux. L&#8217;ordre dans lequel nous neutraliserons ces 
diff&#233;rentes polarit&#233;s va d&#233;cider d&#8217;une proc&#233;dure particuli&#232;re en analyse ou en g&#233;n&#233;ration. Les 
proc&#233;dures en largeur r&#233;sultent de la neutralisation successive de toutes les polarit&#233;s propres &#224; 
un module (neutralisation de toute la structure s&#233;mantique, puis syntaxique, etc), tandis que 
les proc&#233;dures en profondeur r&#233;sultent d&#8217;une neutralisation en cascade de toutes les polarit&#233;s 
introduites par un objet, c&#8217;est-&#224;-dire que d&#232;s qu&#8217;un objet est construit &#224; un niveau donn&#233;, on 
cherche &#224; neutraliser les polarit&#233;s des autres niveaux associ&#233;es &#224; cet objet plut&#244;t que de 
construire d&#8217;autres objets du m&#234;me niveau. Malgr&#233; une architecture stratifi&#233;e (s&#233;paration des 
niveaux et des interfaces), notre mod&#232;le peut donc tout &#224; fait g&#233;rer une interaction complexe 
entre les diff&#233;rents modules et simuler une analyse ou une g&#233;n&#233;ration incr&#233;mentale (tentative 
de neutralisation de la structure du premier mot de la phrase du niveau phonologique jusqu&#8217;au 
niveau s&#233;mantique, puis du deuxi&#232;me mot, etc).  
</p>
<p>La d&#233;finition de GUP sera bri&#232;vement rappel&#233;e dans la section 2. Dans la section 3, nous 
proposerons des grammaires de bonne formation pour les diff&#233;rents types de structures que 
nous consid&#233;rons dans GUST. Dans la section 4, nous introduirons la notion de grammaire de 
correspondance et nous montrerons comment GUP permet d&#8217;&#233;crire des interfaces. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Grammaire d&#8217;Unification Sens-Texte : modularit&#233; et polarisation 
</p>
<p> 
</p>
<p>2 Grammaires d&#8217;unification polaris&#233;es [GUP] 
Les grammaires d&#8217;unification polaris&#233;es sont des grammaires permettant de g&#233;n&#233;rer des 
ensembles de structures finies. Une structure repose sur des objets. Par exemple, pour un 
graphe (orient&#233;), les objets sont des n&#339;uds et des arcs. Chaque arc est li&#233; &#224; deux n&#339;uds par les 
fonctions source et cible. Ce sont ces fonctions qui fournissent la structure proprement dite. 
</p>
<p>Une structure polaris&#233;e est une structure dont les objets sont polaris&#233;s, c&#8217;est-&#224;-dire associ&#233;s 
par une fonction &#224; une valeur appartenant &#224; un ensemble fini P de polarit&#233;s. L&#8217;ensemble P est 
muni d&#8217;une op&#233;ration commutative et associative not&#233;e &#171; . &#187;, appel&#233;e produit. Un sous-
ensemble N de P contient les polarit&#233;s dites neutres. Une structure polaris&#233;e est dite neutre si 
tous les objets de cette structure sont neutres. Nous utiliserons ici un syst&#232;me de polarit&#233;s P = 
{&#9679;,&#61602;,&#9679;} (que nous appellerons ainsi : &#9679; = noire = satur&#233;e, &#61602; = blanche = contexte obligatoire 
et &#9679; = grise = neutre absolu), avec N = {&#9679;,&#9679;}, et un produit d&#233;fini par le tableau suivant (o&#249; &#8869; 
repr&#233;sente l&#8217;impossibilit&#233; de se combiner) : 
</p>
<p> . &#9679; &#61602; &#9679; 
&#9679; &#9679; &#61602; &#9679; 
&#61602; &#61602; &#61602; &#9679; 
&#9679; &#9679; &#9679; &#8869; 
</p>
<p>Tableau 1 &#8212; Le produit des polarit&#233;s 
</p>
<p>Les structures peuvent &#234;tre combin&#233;es par unification. L&#8217;unification de deux structures A et B 
donne une nouvelle structure A&#8853;B obtenue en &#171; collant &#187; ensemble ces structures par 
l&#8217;identification d&#8217;une partie des objets de A avec une partie de ceux de B. Lorsque A et B sont 
unifi&#233;es, la polarit&#233; d&#8217;un objet de A&#8853;B obtenu par identification d&#8217;un objet de A et d&#8217;un objet 
de B est le produit de leurs polarit&#233;s. Toutes les fonctions associ&#233;es aux objets unifi&#233;s sont 
n&#233;cessairement identifi&#233;es (comme le sont les traits quand on unifie deux structures de traits). 
</p>
<p>Une grammaire d&#8217;unification polaris&#233;e (GUP) est d&#233;finie par une famille finie T de types 
d&#8217;objets (avec des fonctions associ&#233;es aux diff&#233;rents types d&#8217;objets), un syst&#232;me (P,.) de 
polarit&#233;s, un sous-ensemble N de P de polarit&#233;s neutres, et un ensemble fini de structures 
&#233;l&#233;mentaires polaris&#233;es, dont les objets sont d&#233;crits par T et dont une peut &#234;tre marqu&#233;e 
comme la structure initiale. Les structures g&#233;n&#233;r&#233;es par la grammaire sont les structures 
neutres obtenues par combinaison de la structure initiale et/ou d&#8217;un nombre fini de structures 
&#233;l&#233;mentaires. Rappelons que le formalisme est monotone (avec l&#8217;ordre &#9679; &lt; &#61602; &lt; &#9679; sur les 
polarit&#233;s) et que les structures peuvent &#234;tre combin&#233;es dans n&#8217;importe quel ordre. 
</p>
<p>Nous verrons dans la section suivante deux exemples de GUP qui g&#233;n&#232;rent respectivement les 
graphes s&#233;mantiques et les arbres syntaxiques. Tous nos exemples seront illustr&#233;s par (1) : 
</p>
<p>(1) Pierre mange deux pommes. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane et Fran&#231;ois Lareau 
</p>
<p> 
</p>
<p>3 Grammaires de bonne formation 
</p>
<p>3.1 Grammaire s&#233;mantique 
</p>
<p>Nos repr&#233;sentations s&#233;mantiques sont essentiellement bas&#233;es sur un graphe de relations 
pr&#233;dicat-argument entre s&#233;mant&#232;mes (les signifi&#233;s des unit&#233;s lexicales et grammaticales de la 
phrase). On peut superposer sur ce graphe d&#8217;autres informations pour encoder la structure 
informationnelle ou les relations de port&#233;e (Mel&#8217;cuk 2001, Kahane 2005). Les n&#339;uds d&#8217;une 
repr&#233;sentation s&#233;mantique repr&#233;sentent les s&#233;mant&#232;mes et les arcs repr&#233;sentent les relations 
pr&#233;dicat-argument. Notre grammaire Gs&#233;m est donc une grammaire de graphe dont les objets 
portent chacun une polarit&#233;, not&#233;e ps&#233;m dans la suite1, qui indique quel est le n&#339;ud construit 
par la r&#232;gle (polaris&#233; en noir) et quels sont les n&#339;uds constituant la valence s&#233;mantique du 
pr&#233;dicat (polaris&#233;s en blanc) (Figure 1). 
</p>
<p> 
         
 
</p>
<p>Figure 1 &#8212; Un extrait de Gs&#233;m g&#233;n&#233;rant le graphe s&#233;mantique de (1) 
</p>
<p>3.2 Grammaire syntaxique 
</p>
<p>Nos repr&#233;sentations syntaxiques sont des arbres de d&#233;pendance dont les n&#339;uds sont &#233;tiquet&#233;s 
par des repr&#233;sentations lemmatis&#233;es de mots. Plus exactement le n&#339;ud syntaxique est &#233;tiquet&#233; 
par le nom d&#8217;un lex&#232;me et des fonctions dites grammaticales lient ce n&#339;ud &#224; d&#8217;autres objets 
repr&#233;sentant les gramm&#232;mes2. Les arcs de l&#8217;arbre sont &#233;tiquet&#233;s par des fonctions syntaxiques, 
(qui varient d&#8217;une langue &#224; l&#8217;autre). Voir Figure 2 &#224; droite la repr&#233;sentation syntaxique de (1). 
</p>
<p>Nous pr&#233;sentons notre grammaire syntaxique Gsynt avec une seule polarit&#233; psynt, qui comme 
pr&#233;c&#233;demment indique quels sont les objets construits par la r&#232;gle et permet de v&#233;rifier que les 
fonctions associ&#233;es &#224; chaque objet sont bien instanci&#233;es : la source et la cible pour les arcs, 
l&#8217;&#233;tiquette, la partie du discours (pdd) pour les n&#339;uds et les fonctions grammaticales 
&#233;ventuelles (nombre pour les noms, mode, temps, nombre et personne pour les verbes, etc.)3. 
Une deuxi&#232;me polarit&#233;, psynt-gouv, masqu&#233;e ici, sert &#224; v&#233;rifier que la structure est bien un arbre, 
c&#8217;est-&#224;-dire que chaque n&#339;ud est gouvern&#233; une et une seule fois, &#224; l&#8217;exception du sommet. 
</p>
<p>                                                
1  Par convention, nous faisons r&#233;f&#233;rence aux polarit&#233;s par le nom de la fonction qui les associe aux objets qui 
</p>
<p>les portent. Ainsi, &#224; tous les objets des r&#232;gles de Gs&#233;m est associ&#233;e une fonction ps&#233;m qui retourne comme 
valeur une des polarit&#233;s de l&#8217;ensemble P d&#233;crit plus haut. 
</p>
<p>2  Nous indiquons ces fonctions en italiques dans nos figures, suivies du gramm&#232;me en question. Les 
gramm&#232;mes sont eux-m&#234;mes li&#233;s aux lex&#232;mes par des fonctions inverses que nous masquons. Ce double lien 
rend les deux objets indissociables : l&#8217;unification de l&#8217;un force l&#8217;unification de l&#8217;autre. 
</p>
<p>3  Nous pr&#233;sentons un syst&#232;me grammatical simplifi&#233; en masquant par exemple la d&#233;termination pour le nom 
ou la finitude et la voix pour le verbe. 
</p>
<p>&#8216;pomme&#8217; &#8216;Pierre&#8217; 
&#8216;deux&#8217; 
</p>
<p>1 
</p>
<p>&#8216;manger&#8217; 
</p>
<p>2 1 
</p>
<p>&#8216;pomme&#8217; &#8216;Pierre&#8217; 
</p>
<p>&#8216;deux&#8217; 
1 
</p>
<p>&#8216;manger&#8217; 
</p>
<p>2 1 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Grammaire d&#8217;Unification Sens-Texte : modularit&#233; et polarisation 
</p>
<p> 
</p>
<p>La Figure 2 pr&#233;sente un extrait de Gsynt permettant de g&#233;n&#233;rer l&#8217;arbre syntaxique de (1). La 
toute premi&#232;re r&#232;gle est la structure initiale, qui doit &#234;tre utilis&#233;e une et une seule fois et qui 
correspond au sommet de l&#8217;arbre (et qui devra recevoir une polarit&#233; psynt-gouv noire indiquant 
qu&#8217;il ne peut &#234;tre gouvern&#233;). Les quatre r&#232;gles suivantes sont des r&#232;gles lexicales ; elles 
indiquent la partie du discours des lex&#232;mes et les gramm&#232;mes qui leur sont n&#233;cessaires. On 
notera que ces r&#232;gles ne contr&#244;lent pas la valence syntaxique, qui sera contr&#244;l&#233;e par l&#8217;interface 
s&#233;mantique-syntaxe. Les trois r&#232;gles qui suivent sont des r&#232;gles sagittales ; elles d&#233;crivent 
diff&#233;rentes relations syntaxiques possibles (et contr&#244;le la structure d&#8217;arbre par une polarisation 
psynt-gouv noire du n&#339;ud d&#233;pendant, non indiqu&#233;e ici). Les autres r&#232;gles sont des r&#232;gles 
grammaticales. Ces r&#232;gles peuvent d&#233;pendre du contexte : ainsi l&#8217;indicatif n&#233;cessite une 
relation sujet et vice-versa, la pr&#233;sence d&#8217;un num&#233;ral impose le pluriel ou celle d&#8217;un sujet non 
pronominal la 3e personne du verbe. Notons &#233;galement que l&#8217;introduction d&#8217;un gramm&#232;me 
peut d&#233;pendre d&#8217;un autre gramm&#232;me : l&#8217;indicatif par exemple exigera un temps, mais pas 
l&#8217;infinitif4. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 2 &#8212; Un extrait de Gsynt g&#233;n&#233;rant la repr&#233;sentation syntaxique de (1) 
</p>
<p>Nous pr&#233;senterons la grammaire morphotopologique en m&#234;me temps que l&#8217;interface syntaxe-
morphotopologie, dans la section 4.3. Nous laisserons de c&#244;t&#233; la phonologie. 
</p>
<p>4 Interfaces 
Nous introduisons d&#8217;abord la notion de grammaire de correspondance avant d&#8217;introduire les 
deux interfaces consid&#233;r&#233;es ici : s&#233;mantique-syntaxe et syntaxe-morphotopologie. 
</p>
<p>                                                
4  Nous consid&#233;rons l&#8217;opposition entre l&#8217;infinitif et l&#8217;infinitif dit &#171; pass&#233; &#187; d&#8217;ordre aspectuel. 
</p>
<p>  cod 
 pdd : V 
</p>
<p>  suj 
 pdd : V 
</p>
<p>mode     ind 
 
</p>
<p> pdd : V 
mode ind 
temps pr&#233;s   suj 
</p>
<p> pers      3 
</p>
<p> pdd : &#172;Pro 
  suj 
</p>
<p> nbre      sg 
</p>
<p> nbre      sg 
  d&#233;t 
</p>
<p> nbre      pl 
</p>
<p> pdd : Num 
</p>
<p>cod suj 
</p>
<p>MANGER 
</p>
<p>PIERRE 
</p>
<p>POMME 
d&#233;t 
</p>
<p> pdd : Num DEUX 
</p>
<p> pdd : N 
 pdd : N nbre      pl 
</p>
<p> pdd : V 
mode :   ind 
temps :   pr&#233;s 
pers :   3 
nbre :   sg 
</p>
<p> 
</p>
<p> pdd : V 
mode      ind 
temps 
pers 
nbre 
</p>
<p>  suj 
</p>
<p> pdd : V mode 
 pdd : V mode 
</p>
<p>MANGER 
pdd : Num 
</p>
<p>DEUX 
</p>
<p> pdd : N nbre 
</p>
<p>POMME 
 pdd : N nbre      sg 
</p>
<p>PIERRE 
</p>
<p>structure initiale 
</p>
<p>  d&#233;t 
 pdd : N 
</p>
<p> 
</p>
<p> pdd : Num 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane et Fran&#231;ois Lareau 
</p>
<p> 
</p>
<p>4.1 Grammaires de correspondance 
</p>
<p>Une grammaire de correspondance G est une grammaire qui met en correspondance des 
structures appartenant &#224; deux ensembles, que nous notons A et B. Les r&#232;gles de G mettent en 
correspondance des structures &#233;l&#233;mentaires composant les &#233;l&#233;ments de A et de B. On peut 
consid&#233;rer trois fonctionnements pour G : &#233;quatif, transductif et g&#233;n&#233;ratif, selon qu&#8217;on fournit 
en entr&#233;e deux, une ou z&#233;ro structures (Kahane 2000). Une grammaire &#233;quative v&#233;rifie que 
deux structures fournies se correspondent, une grammaire transductive traduit une structure 
fournie en une autre, tandis qu&#8217;une grammaire g&#233;n&#233;rative g&#233;n&#232;re un couple de structures en 
correspondance. 
</p>
<p>Consid&#233;rons le fonctionnement &#233;quatif de G, qui est le plus &#233;l&#233;mentaire : G partitionne les 
deux structures en un m&#234;me nombre de fragments qui se correspondent deux &#224; deux par les 
r&#232;gles de la grammaire. En termes de polarit&#233;s, cela signifie que les deux structures en entr&#233;e 
doivent &#234;tre d&#233;clar&#233;es comme des ressources que G devra toutes &#171; consommer &#187; (assurant 
ainsi que les deux structures ont &#233;t&#233; totalement mises en correspondance). Les objets des deux 
structures recevront donc une polarit&#233; p
</p>
<p>G
 blanche que les r&#232;gles de G devront neutraliser. Les 
</p>
<p>r&#232;gles de G contiendront quant &#224; elles des objets (des niveaux de repr&#233;sentation de A et de B) 
de polarit&#233; p
</p>
<p>G
 noire mis en correspondance. Ainsi, en neutralisant les deux structures fournies, 
</p>
<p>G les met en correspondance. 
</p>
<p>Voyons maintenant comment la m&#234;me grammaire G fonctionne de mani&#232;re transductive. 
C&#8217;est ce mode de fonctionnement qui mod&#233;lise les processus linguistiques de synth&#232;se et 
d&#8217;analyse. On fournit &#224; G une structure A de A dont tous les objets portent une polarit&#233; p
</p>
<p>G
 
</p>
<p>blanche. On d&#233;clenche alors un jeu de r&#232;gles afin de neutraliser A, ce qui nous construit une 
structure B synchronis&#233;e avec A. Une grammaire de bonne formation des structures de B doit 
maintenant v&#233;rifier que B appartient bien &#224; B. La structure B, tout en &#233;tant neutre pour G 
(tous ses objets portent une polarit&#233; p
</p>
<p>G
 noire), doit donc d&#233;clencher la grammaire de B. Elle 
</p>
<p>doit pour cela &#234;tre enti&#232;rement blanche en polarit&#233; p
B
. En somme, chaque module, qu&#8217;il soit 
</p>
<p>une grammaire de bonne formation ou une grammaire d&#8217;interface, poss&#232;de une polarit&#233; propre 
contr&#244;lant la construction des objets par cette grammaire, mais pour assurer l&#8217;appel des 
modules adjacents, les objets des r&#232;gles de A et de B re&#231;oivent, en plus de leurs polarit&#233;s 
respectives p
</p>
<p>A
 et p
</p>
<p>B
, une polarit&#233; p
</p>
<p>G
 blanche, tandis qu&#8217;il faut ajouter aux r&#232;gles de G une 
</p>
<p>polarit&#233; blanche p
A
 pour les &#233;l&#233;ments du niveau de repr&#233;sentation de A et p
</p>
<p>B
 pour les 
</p>
<p>&#233;l&#233;ments du niveau de B. Un objet construit par A aura donc une double polarisation p
A
-p
</p>
<p>G
 
</p>
<p>(&#9679;,&#61602;), tandis que l&#8217;&#233;l&#233;ment correspondant construit par G aura une double polarisation p
A
-p
</p>
<p>G
 
</p>
<p>(&#61602;,&#9679;). Ceci nous donne un syst&#232;me &#224; quatre polarit&#233;s {(&#61602;,&#61602;),(&#61602;,&#9679;),(&#61602;,&#9679;),(&#9679;,&#9679;)} &#233;quivalent 
au syst&#232;me {&#61602;,&#8211;,+,&#9679;} de Bonfante et al. 2004 et Kahane 2004. Ces couples de polarit&#233;s sont 
les polarit&#233;s d&#8217;articulation. 
</p>
<p>4.2 Interface s&#233;mantique-syntaxe 
</p>
<p>L&#8217;interface s&#233;mantique-syntaxe Is&#233;m-synt est une grammaire de correspondance entre l&#8217;ensemble 
des graphes s&#233;mantiques d&#233;crit par Gs&#233;m et l&#8217;ensemble des arbres syntaxiques d&#233;crit par Gsynt. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Grammaire d&#8217;Unification Sens-Texte : modularit&#233; et polarisation 
</p>
<p> 
</p>
<p>Nous allons illustrer la pr&#233;sentation de Is&#233;m-synt par son fonctionnement transductif en synth&#232;se. 
On fournit &#224; la grammaire un graphe s&#233;mantique comme celui de la Figure 1 &#224; droite, &#224; la 
diff&#233;rence que chacun des objets re&#231;oit maintenant une double polarisation ps&#233;m-ps&#233;m-synt (&#9679;,&#61602;). 
Les objets des r&#232;gles de Is&#233;m-synt portent tous une polarit&#233; ps&#233;m-synt (blanche ou noire, selon qu&#8217;ils 
sont ou non construits par la r&#232;gle en question), mais ceux du niveau s&#233;mantique (resp. 
syntaxique) auront en plus une polarit&#233; ps&#233;m (resp. psynt) blanche. La Figure 3 pr&#233;sente un 
extrait de la grammaire d&#8217;interface qui traite le graphe s&#233;mantique de (1). Seule la polarit&#233; 
ps&#233;m-synt est repr&#233;sent&#233;e. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 3 &#8212; Un extrait de la grammaire d&#8217;interface Is&#233;m-synt 
</p>
<p>Dans la Figure 4, nous donnons trois structures : le graphe s&#233;mantique de (1) avec la double 
polarisation ps&#233;m-ps&#233;m-synt, le r&#233;sultat apr&#232;s neutralisation par Is&#233;m-synt de toutes les polarit&#233;s qui 
pouvaient l&#8217;&#234;tre (c&#8217;est-&#224;-dire ps&#233;m-synt et ps&#233;m, mais pas psynt), puis le r&#233;sultat apr&#232;s application de 
Gsynt sur l&#8217;arbre syntaxique construit par Is&#233;m-synt. Les polarit&#233;s qui servent &#224; l&#8217;articulation avec 
le module adjacent sont indiqu&#233;es en d&#233;cal&#233;. A noter que les gramm&#232;mes d&#8217;accord (comme le 
nbre et pers pour le verbe) n&#8217;ont pas de contrepartie s&#233;mantique directe et ne doivent donc pas 
porter de polarit&#233; ps&#233;m-synt. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>+ 
 
</p>
<p> 
</p>
<p>Figure 4 &#8212; Le graphe s&#233;mantique de (1) avant et apr&#232;s l&#8217;application de Is&#233;m-synt et Gsynt 
</p>
<p>De m&#234;me que Gs&#233;m, la grammaire syntaxique Gsynt doit &#234;tre enrichie pour assurer l&#8217;articulation 
avec &#224; la fois l&#8217;interface s&#233;mantique-syntaxe et l&#8217;interface syntaxe-morphotopologie. Comme 
on peut le voir dans de bas de la Figure 4, l&#8217;application de Gsynt sur la sortie de Is&#233;m-synt permet 
de neutraliser toutes les polarit&#233;s psynt des objet syntaxiques construits par Is&#233;m-synt. Cependant, 
il n&#8217;est pas possible d&#8217;introduire le lex&#232;me MANGER sans lui attribuer un mode (cf.  Figure 2) 
</p>
<p>cod suj 
</p>
<p>&#8216;manger&#8217; 
2 1  
</p>
<p>pdd : V 
MANGER 
</p>
<p>  
&#8216;Pierre&#8217; 
</p>
<p> pdd : N 
PIERRE 
</p>
<p>  
</p>
<p>&#8216;pomme&#8217; 
 pdd : N 
</p>
<p>POMME 
  
</p>
<p>&#8216;pomme&#8217; &#8216;Pierre
&#8217; 
</p>
<p>&#8216;deux&#8217; 
1 
</p>
<p>&#8216;manger&#8217; 
2 1 
</p>
<p>d&#233;t 
1 
</p>
<p> 
</p>
<p> pdd : Num 
DEUX 
</p>
<p> 
&#8216;deux&#8217; 
</p>
<p> 
</p>
<p>cod suj  pdd : V 
MANGER 
</p>
<p> pdd : N PIERRE 
POMME 
</p>
<p>d&#233;t 
</p>
<p> pdd : Num 
DEUX 
</p>
<p> pdd : N 
&#8216;deux&#8217; 
</p>
<p>&#8216;pomme&#8217; &#8216;Pierre&#8217; 
</p>
<p>1 
</p>
<p>&#8216;manger&#8217; 
2 1 
</p>
<p>cod suj 
</p>
<p>MANGER 
</p>
<p> pdd : N 
nbre :  sg 
 
</p>
<p>PIERRE 
POMME 
</p>
<p>d&#233;t 
</p>
<p> pdd : Num DEUX 
</p>
<p> pdd : N 
&#8216;deux&#8217; 
</p>
<p>&#8216;pomme&#8217; &#8216;Pierre&#8217; 
</p>
<p>1 
</p>
<p>&#8216;manger&#8217; 
</p>
<p>2 1 
</p>
<p> pdd : V 
mode :    indic 
temps :    pr&#233;s 
pers :    3 
nbre :    sg </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane et Fran&#231;ois Lareau 
</p>
<p> 
</p>
<p>et en lui attribuant le mode indicatif, par exemple, on force l&#8217;utilisation d&#8217;un gramm&#232;me de 
temps et de gramm&#232;mes d&#8217;accord en personne et en nombre. La grammaire Gsynt, en 
neutralisant les polarit&#233;s psynt de la sortie de Is&#233;m-synt, introduit donc des gramm&#232;mes qui ne 
figuraient pas dans cette sortie et qui pour certains (pas les gramm&#232;mes d&#8217;accord) auront une 
polarit&#233; ps&#233;m-synt blanche (Figure 4 en bas). Cette polarit&#233; blanche sur les gramm&#232;mes de mode 
et de temps ainsi introduits devra donc &#234;tre neutralis&#233;e par des r&#232;gles de Is&#233;m-synt. Or, rien dans 
la structure s&#233;mantique de d&#233;part ne peut correspondre &#224; ces gramm&#232;mes. Qu&#8217;&#224; cela ne 
tienne ! Le jeu des polarit&#233;s de GUST permet de modifier en cours de route la repr&#233;sentation 
donn&#233;e en entr&#233;e afin de satisfaire des contraintes provenant d&#8217;autres niveaux de 
repr&#233;sentation. Supposons que notre mod&#232;le comprenne les deux r&#232;gles donn&#233;es en Figure 5. 
La premi&#232;re est une r&#232;gle de Gs&#233;m qui donne une repr&#233;sentation d&#8217;un des sens du temps 
pr&#233;sent. La seconde est une r&#232;gle de Is&#233;m-synt qui fait correspondre &#224; ce sens le gramm&#232;me de 
temps pr&#233;sent. Ces deux r&#232;gles peuvent s&#8217;appliquer dans le sens inverse de la synth&#232;se qui est 
en cours pour venir modifier la structure de d&#233;part en lui ajoutant le sens du pr&#233;sent (nous 
laissons de c&#244;t&#233; la question du mode pour des raisons de clart&#233;). On obtient alors la structure 
s&#233;mantique &#224; droite. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 5 &#8212; Le pr&#233;sent 
</p>
<p>Bien entendu, il existe d&#8217;autres r&#232;gles qui peuvent saturer les besoins en mode et en temps, et 
on obtiendra autant de structures s&#233;mantiques modifi&#233;es qu&#8217;il y a de fa&#231;ons de satisfaire les 
contraintes syntaxiques. Dans le cadre d&#8217;un syst&#232;me de g&#233;n&#233;ration de texte, il faut alors que le 
programme choisisse, parmi les graphes s&#233;mantiques propos&#233;s, celui qui convient le mieux 
selon les connaissances du monde auxquelles il a acc&#232;s. Dans le cas qui nous pr&#233;occupe, le 
syst&#232;me aura ainsi &#224; r&#233;pondre &#224; la question &#171; Quand Pierre mange-t-il deux pommes : est-ce 
dans le pass&#233;, dans le pr&#233;sent ou dans le futur ? &#187;. Ce m&#233;canisme mod&#233;lise bien le fait que les 
sens grammaticaux ne sont pas n&#233;cessairement exprim&#233;s parce qu&#8217;ils r&#233;pondent &#224; un besoin 
communicatif de la part du locuteur, mais plut&#244;t parce qu&#8217;ils sont impos&#233;s par la langue (voir 
&#224; ce sujet Polgu&#232;re 1998). Ce type de m&#233;canisme, en plus d&#8217;&#234;tre plausible d&#8217;un point de vue 
cognitif, pourrait s&#8217;av&#233;rer particuli&#232;rement utile dans le cadre de la traduction automatique, o&#249; 
la repr&#233;sentation s&#233;mantique obtenue par analyse dans la langue source n&#8217;est pas forc&#233;ment 
exprimable dans la langue cible. Il peut &#233;galement op&#233;rer en situation d&#8217;analyse. C&#8217;est alors la 
cha&#238;ne sonore qui est donn&#233;e en entr&#233;e et qui peut &#234;tre modifi&#233;e si elle n&#8217;est pas tout &#224; fait 
bien form&#233;e, ce qui permettrait de contourner certains probl&#232;mes li&#233;s au bruit ou aux erreurs 
de performance. Ces hypoth&#232;ses n&#8217;ont toutefois pas encore &#233;t&#233; valid&#233;es par exp&#233;rimentation. 
</p>
<p>4.3 Interface syntaxe-morphotopologie 
</p>
<p>Nous allons simplifier la pr&#233;sentation de l&#8217;interface syntaxe-morphotopologie au maximum en 
ne traitant pas r&#233;ellement la morphologie (nous associons directement un lex&#232;me et les 
gramm&#232;mes qui lui correspondent &#224; une forme fl&#233;chie) et en adoptant une structure 
topologique conventionnelle du type de celle des grammaires syntagmatiques (cf. Gerdes &amp; 
</p>
<p>&#8216;pomme&#8217; &#8216;Pierre&#8217; 
</p>
<p>&#8216;deux&#8217; 
</p>
<p>1 
</p>
<p>&#8216;manger&#8217; 
2 1 &#8216;maintenant&#8217; 
</p>
<p>&#8216;concomitant&#8217; 
1 2 
</p>
<p>&#8216;concomitant&#8217; 
2 1 
</p>
<p>&#8216;maintenant&#8217; 
</p>
<p>&#8216;concomitant&#8217; 
</p>
<p>&#8216;maintenant&#8217; 
</p>
<p> pdd : V 
mode :    indic 
temps :    pr&#233;s 
 
</p>
<p>2 1 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Grammaire d&#8217;Unification Sens-Texte : modularit&#233; et polarisation 
</p>
<p> 
</p>
<p>Kahane 2004  pour une &#233;tude de la topologie du fran&#231;ais et Gerdes &amp; Kahane 2001 pour une 
mod&#233;lisation formelle). La grammaire de bonne formation topologique est donc &#233;quivalente &#224; 
une grammaire de r&#233;&#233;criture hors-contexte (cf. Kahane 2004 pour la simulation en GUP des 
grammaires de r&#233;&#233;criture) : elle construit un arbre de constituants topologiques et son 
principal objectif est d&#8217;indiquer dans quel ordre se trouvent les constituants fr&#232;res (cf. r&#232;gle 
R1 &#233;quivalente &#224; S &#8594; GN GV)5. L&#8217;interface syntaxe-morphotopologie contient trois types de 
r&#232;gles : des r&#232;gles pour le sous-constituant t&#234;te (cf. r&#232;gle R2 disant que GV est la t&#234;te de S et 
que donc GV et S sont synchronis&#233;s avec le m&#234;me n&#339;ud syntaxique), des r&#232;gles pour le 
placement d&#8217;un d&#233;pendant (cf. r&#232;gle R3 disant que le sujet correspond au GN sous S) et des 
r&#232;gles de &#171; morphologie &#187; (cf. r&#232;gle R4 disant que mange &#8660; MANGERind, pr&#233;s, 3, sg). Cette 
interface est assez proche d&#8217;une grammaire LFG (Bresnan 1999), assurant comme elle la 
synchronisation d&#8217;une structure de constituants avec une structure de d&#233;pendance, mais la 
polarisation permet d&#8217;expliciter ce que chaque r&#232;gle construit r&#233;ellement et de d&#233;couper 
davantage l&#8217;information (par exemple, nos trois premi&#232;res r&#232;gles correspondent &#224; une unique 
r&#232;gle LFG : S &#8594; GN[&#8595;=&#8593;Subj] GV[&#8595;=&#8593;]). Dans la Figure 6, nous n&#8217;indiquons que la polarit&#233; 
propre &#224; chaque module (ptopo dans R1 et psynt-topo dans les autres). 
</p>
<p> 
</p>
<p> 
</p>
<p> 
 
</p>
<p> 
 
</p>
<p>Figure 6 &#8212; Morphotopologie 
</p>
<p>5 Conclusion 
Notre article porte essentiellement sur l&#8217;architecture d&#8217;un mod&#232;le linguistique. Nous avons 
propos&#233; un mod&#232;le modulaire (3 grammaires de bonne formation et 2 grammaires d&#8217;interface 
dans la version simplifi&#233;e pr&#233;sent&#233;e ici) permettant de g&#233;rer diff&#233;rents niveaux d&#8217;organisation 
et diff&#233;rents types de structures (graphe, arbre, arbre ordonn&#233;) et pourtant nous utilisons un 
unique formalisme. Cela nous permet de combiner les r&#232;gles dans n&#8217;importe quel ordre et 
permet aux diff&#233;rents modules d&#8217;interagir constamment. De plus, la saturation des structures 
ainsi que l&#8217;interaction des modules sont soigneusement contr&#244;l&#233;es gr&#226;ce &#224; la polarisation 
(g&#233;n&#233;ralement multiple) de tous les objets. Chaque polarit&#233; ayant un r&#244;le bien d&#233;termin&#233;, nous 
pouvons diriger l&#8217;application du mod&#232;le. On peut ainsi choisir entre une proc&#233;dure en largeur 
et une proc&#233;dure en profondeur : en privil&#233;giant la neutralisation de tous les objets portant une 
                                                
5 Les n&#339;uds gris dans la r&#232;gle R1 servent &#224; indiquer le d&#233;but et la fin des constituants. Il re&#231;oivent une polarit&#233; 
</p>
<p>ptopo grise, c&#8217;est-&#224;-dire qu&#8217;ils sont absolument neutres et peuvent se combiner librement &#224; chaque fois qu&#8217;une 
unification d&#8217;arc l&#8217;oblige. Ils n&#8217;auront pas de polarit&#233; psynt-topo, puisqu&#8217;ils n&#8217;ont pas de correspondant au niveau 
syntaxique. A noter que, comme pour le niveau syntaxique, une deuxi&#232;me polarit&#233;, non consid&#233;r&#233;e ici, est 
n&#233;cessaire pour assurer la structure d&#8217;arbre et v&#233;rifier que chaque &#171; arc &#187; est gouvern&#233;. 
</p>
<p>S 
</p>
<p>GN GV 
</p>
<p>R1 S 
</p>
<p>GV 
</p>
<p>R2 
</p>
<p>pdd :V 
</p>
<p>V 
</p>
<p>mange R4 
</p>
<p>MANGER 
pdd : V 
mode       indic 
temps      pr&#233;s 
pers         3 
nbre        sg 
</p>
<p>S 
</p>
<p>GN 
</p>
<p>suj 
</p>
<p>R3 
</p>
<p>pdd : N 
</p>
<p>pdd : V </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane et Fran&#231;ois Lareau 
</p>
<p> 
</p>
<p>polarit&#233; propre &#224; un module, les modules s&#8217;appliqueront les uns &#224; la suite des autres, tandis 
qu&#8217;en privil&#233;giant la neutralisation de toutes les polarit&#233;s associ&#233;es &#224; un objet, chaque &#233;l&#233;ment 
de la structure d&#8217;entr&#233;e sera trait&#233; du sens au texte (ou vice-versa). Il est important de noter 
que la proc&#233;dure en profondeur n&#8217;est possible que parce qu&#8217;un m&#234;me formalisme a &#233;t&#233; utilis&#233; 
pour l&#8217;ensemble des modules. Nous avons &#233;galement vu que, gr&#226;ce &#224; l&#8217;interaction &#233;troite des 
diff&#233;rents modules, une GUST peut accepter en entr&#233;e une repr&#233;sentation s&#233;mantique sous-
sp&#233;cifi&#233;e o&#249; tous les sens flexionnels sont absents, et g&#233;n&#233;rer quand m&#234;me des phrases bien 
form&#233;es en ajoutant &#224; la repr&#233;sentation initiale les sens flexionnels qu&#8217;impose la langue. 
Enfin, comme l&#8217;ont montr&#233; Bonfante et al. (2004), la polarisation permet un filtrage efficace 
des r&#232;gles r&#233;duisant les calculs sans issue. 
</p>
<p>Le d&#233;veloppement d&#8217;un mod&#232;le du fran&#231;ais est en cours. Le noyau central de la topologie du 
fran&#231;ais est d&#233;crit par Gerdes &amp; Kahane (2004), la syntaxe des temps du fran&#231;ais est d&#233;crite 
par Lareau (2004), d&#8217;autres points de l&#8217;interface s&#233;mantique-syntaxe (les distorsions entre 
syntaxe et s&#233;mantique et les questions de port&#233;e des quantificateurs) sont &#233;tudi&#233;s par Kahane 
(2003, 2005). L&#8217;impl&#233;mentation de GUST dans le formalisme GUP est &#233;galement en cours. 
Mais davantage que la couverture, l&#8217;accent est mis sur la propret&#233; du traitement th&#233;orique et 
l&#8217;ad&#233;quation de la formalisation. 
</p>
<p>R&#233;f&#233;rences 
BRESNAN J. (1999), Lexical-Functional Syntax, Blackwell. 
BONFANTE G., GUILLAUME B. &amp; PERRIER G. (2004), Polarization and abstraction of grammatical 
formalisms as methods for lexical disambiguation, Actes CoLing, Gen&#232;ve, 303-309. 
GERDES K. &amp; KAHANE S. (2001), Word order in German: A formal dependency grammar using a 
topological hierarchy, Actes ACL, Toulouse, 220-227. 
GERDES K. &amp; KAHANE S. (2004), L&#8217;amas verbal au c&#339;ur d&#8217;une mod&#233;lisation topologique du fran&#231;ais, 
Actes Journ&#233;es de la syntaxe &#8211; Ordre des mots dans la phrase fran&#231;aise, positions et topologie, 
Bordeaux, 8 p. 
KAHANE S. (2000), Des grammaires formelles pour d&#233;finir une correspondance, Actes TALN, 
Lausanne, 197-206. 
KAHANE S. (2001), Grammaires de d&#233;pendance formelles et th&#233;orie Sens-Texte, Tutoriel, Actes TALN, 
vol. 2, 17-76. 
KAHANE S. (2004), Grammaires d&#8217;unification polaris&#233;es, Actes TALN, F&#232;s, 233-242. 
KAHANE S. (2005), Structure des repr&#233;sentations logiques, polarisation et sous-sp&#233;cification, Actes 
TALN, Dourdan, 10 p. 
LAREAU F. (2004), Vers un mod&#232;le formel de la conjugaison fran&#231;aise dans le cadre des grammaires 
d&#8217;unification Sens-Texte polaris&#233;es, Document pour l&#8217;examen g&#233;n&#233;ral de synth&#232;se, Montr&#233;al, 
Universit&#233; de Montr&#233;al. 
MEL&#8217;CUK I. (1997), Vers une linguistique sens-texte : le&#231;on inaugurale, Paris, Coll&#232;ge de France. 
MEL&#8217;CUK I. (2001), Communicative Organisation of Natural Language, Benjamins. 
NASR A. (1995), A formalism and a parser for lexicalised dependency grammars, 4th Int. Workshop 
on Parsing Technologies, State University of New York Press. 
POLGUERE A. (1998), Pour un mod&#232;le stratifi&#233; de la lexicalisation en g&#233;n&#233;ration de texte, TAL, 39:2, 
57-76. 
SHIEBER S. M. &amp; SCHABES Y. (1990),  Synchronous tree-adjoining grammars, Proceedings of the 
13th Int. Conference on  Computational Linguistics, vol. 3, 253-258, Helsinki, Finland. </p>

</div></div>
</body></html>