<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Ritel : un syst&#232;me de dialogue homme-machine &#224; domaine ouvert</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>RITEL : dialogue homme-machine &#224; domaine ouvert
</p>
<p>Olivier Galibert, Gabriel Illouz, Sophie Rosset
LIMSI - CNRS
</p>
<p>F-91403 Orsay Cedex
{galibert,gabrieli,rosset}@limsi.fr
</p>
<p>Mots-clefs : dialogue homme machine, recherche d&#8217;information pr&#233;cise, corpus
Keywords: human machine dialog, question answering, information retrieval, corpus
</p>
<p>R&#233;sum&#233; L&#8217;objectif du projet RITEL est de r&#233;aliser un syst&#232;me de dialogue homme-machine
permettant &#224; un utilisateur de poser oralement des questions, et de dialoguer avec un syst&#232;me de
recherche d&#8217;information g&#233;n&#233;raliste (par exemple, chercher sur l&#8217;Internet &#8220;Qui est le Pr&#233;sident
du S&#233;nat ?&#8221;) et d&#8217;en &#233;tudier les potentialit&#233;s. Actuellement, la plateforme RITEL permet de
collecter des corpus de dialogue homme-machine. Les utilisateurs peuvent parfois obtenir une
r&#233;ponse, de type factuel (Q : qui est le pr&#233;sident de la France ; R : Jacques Chirac.). Cet article
pr&#233;sente bri&#232;vement la plateforme d&#233;velopp&#233;e, le corpus collect&#233; ainsi que les questions que
soul&#232;vent un tel syst&#232;me et quelques unes des premi&#232;res solutions envisag&#233;es.
</p>
<p>Abstract The project RITEL aims at integrating a spoken language dialog system and
an open-domain question answering system to allow a human to ask a general question (f.i.
&#8220;Who is currently presiding the Senate?&#8221;) and refine his research interactively. As this point in
time the RITEL platform is used to collect a new human-computer dialog corpus. The user can
sometimes recieve factual answers (Q : who is the president of France ; R : Jacques Chirac).
This paper briefly presents the current system, the collected corpus, the problems encountered
by such a system and our first answers to these problems.
</p>
<p>Introduction
</p>
<p>Les progr&#232;s r&#233;alis&#233;s ces derni&#232;res ann&#233;es tant en reconnaissance de la parole qu&#8217;en recherche
d&#8217;information permettent d&#8217;envisager de nouvelles &#233;tudes. L&#8217;objectif du projet RITEL est de
r&#233;aliser un syst&#232;me de dialogue homme-machine permettant &#224; un utilisateur de poser orale-
ment des questions, et de dialoguer avec un syst&#232;me de recherche d&#8217;information g&#233;n&#233;raliste
(par exemple, chercher sur l&#8217;Internet &#8220;Qui est le Pr&#233;sident du S&#233;nat ?&#8221;) et d&#8217;en &#233;tudier les po-
tentialit&#233;s. Le terme de syst&#232;me de dialogue indique g&#233;n&#233;ralement un syst&#232;me permettant une
interaction entre un humain et un syst&#232;me dans un cadre restreint (Glass J. R. et al., 2000).
Toutefois, notamment dans le cadre des travaux sur les syst&#232;mes de question-r&#233;ponse, le cadre
tend &#224; s&#8217;&#233;largir. Un dialogue est une suite d&#8217;&#233;changes entre interlocuteurs dans un contexte
donn&#233;. Un syst&#232;me de dialogue homme-machine interpr&#232;te les requ&#234;tes de l&#8217;utilisateur en fonc-
tion de la t&#226;che &#224; accomplir, de l&#8217;histoire du dialogue et du comportement de l&#8217;utilisateur. Son</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>O. Galibert, G. Illouz, S. Rosset
</p>
<p>objectif est de donner &#224; l&#8217;utilisateur les informations recherch&#233;es tout en assurant une interac-
tion efficace et naturelle. Actuellement, Les syst&#232;mes concernent des domaines restreints tels
que l&#8217;information horaire de moyens de transports (trains, avions, cin&#233;ma) ou les informations
touristiques, par exemple le projet europ&#233;en Le3-Arise (horaires de train), le projet am&#233;ricain
ATIS du DARPA Communicator (voyages en avions), et le projet fran&#231;ais Technolangue ME-
DIA (informations touristiques). Ces projets ont donn&#233; lieu &#224; des &#233;valuations et ont permis
d&#8217;en asseoir la faisabilit&#233;. Des mod&#232;les de gestion dynamique du dialogue et de g&#233;n&#233;ration
adapt&#233;e ont &#233;t&#233; propos&#233;s. M&#234;me si ce qu&#8217;on entend par interaction naturelle est tr&#232;s variable
d&#8217;un syst&#232;me &#224; un autre (Villaneau J., 2003), ces syst&#232;mes permettent une interaction (orale)
relativement naturelle : l&#8217;utilisateur peut &#224; tout moment changer d&#8217;avis et revenir sur des choix
exprim&#233;s, interrompre la r&#233;ponse du syst&#232;me en prenant la parole, le syst&#232;me peut lui aussi
changer de strat&#233;gie d&#8217;interaction en fonction des r&#233;actions de l&#8217;utilisateur. Un syst&#232;me de di-
alogue utilise des sources de connaissances diverses et complexes : connaissances acoustiques,
phon&#233;tiques, lexicales, morphologiques, syntaxiques et s&#233;mantiques, pragmatiques, ainsi que
des connaissances sur le dialogue, sur la t&#226;che &#224; r&#233;aliser et sur l&#8217;interlocuteur. En recherche
d&#8217;information et extraction d&#8217;information, des progr&#232;s (Harabagiu S. et al., 2001) ont &#233;t&#233; mo-
tiv&#233;s par des campagnes d&#8217;&#233;valuations (am&#233;ricaine TREC, 98-2003, europ&#233;enne CLEF, et na-
tionale Equer/Technolangue, 2004). Ces syst&#232;mes sont limit&#233;s &#224; une question et une r&#233;ponse.
Des tentatives ont &#233;t&#233; faites pour des questions encha&#238;n&#233;es, portant sur un m&#234;me th&#232;me. Mais
il ne s&#8217;agissait pas de dialogues, il n&#8217;y avait pas r&#233;ellement d&#8217;interaction, il n&#8217;y avait pas de
n&#233;gociations possibles. Le projet RITEL s&#8217;appuie sur des progr&#232;s r&#233;cents en reconnaissance de
la parole conversationnelle et multi-locuteurs (Gauvain J.L., Lamel L., 2002) Un projet riche et
complexe doit faire face &#224; plusieurs points &#233;pineux. Les plus &#233;vidents sont : la reconnaissance
de la parole qui doit &#234;tre &#224; grand vocabulaire et sur laquelle une contrainte temps r&#233;el s&#8217;applique,
la gestion d&#8217;un dialogue en domaine ouvert, la communication et l&#8217;&#233;change d&#8217;informations en-
tre un syst&#232;me de question-r&#233;ponse et le dialogue, la g&#233;n&#233;ration de la r&#233;ponse. Cet article ne
r&#233;pond pas &#224; toutes ces questions, seuls certains probl&#232;mes rencontr&#233;s et les r&#233;ponses apport&#233;es
seront pr&#233;sent&#233;s. Nous pr&#233;sentons un &#233;tat des lieux du projet RITEL et d&#233;crivons le corpus
collect&#233; jusqu&#8217;&#224; pr&#233;sent avec la plateforme. Nous concluons sur les perspectives de cette &#233;tude.
</p>
<p>1 Dialogue oral et recherche d&#8217;information : int&#233;gration
</p>
<p>Un syst&#232;me de dialogue oral homme-machine a pour objectif de donner &#224; l&#8217;utilisateur l&#8217;informa-
tion qu&#8217;il recherche en s&#8217;aidant de diverses sources de connaissances (statiques : connaissance
du domaine, dynamique...), et le syst&#232;me de question-r&#233;ponse de rechercher une r&#233;ponse pr&#233;cise
&#224; une question. L&#8217;objectif du projet RITEL est l&#8217;int&#233;gration de ces diff&#233;rents syst&#232;mes en une
plateforme unique.
</p>
<p>1.1 Reconnaissance de la parole
</p>
<p>Int&#233;grer un syst&#232;me de reconnaissance de parole dans une telle plateforme suppose de mettre en
place un syst&#232;me de reconnaissance &#224; grand vocabulaire (taille de lexique de 65000 &#224; 300000
mots), temps r&#233;el, multi-locuteur et fonctionnant sur un signal t&#233;l&#233;phonique. Dans de telles
conditions aucun syst&#232;me de reconnaissance, au niveau de l&#8217;&#233;tat de l&#8217;art, ne permet d&#8217;obtenir des
performances n&#233;cessaires pour un syst&#232;me de dialogue (aux alentours de 20% d&#8217;erreur). Il faut
donc envisager des techniques d&#8217;adaptations dynamiques des diff&#233;rents mod&#232;les. L&#8217;adaptation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RITEL : dialogue homme-machine &#224; domaine ouvert
</p>
<p>Table 1: Exemples avec une question : qui est le pr&#233;sident des &#201;tats-Unis?
R&#233;ponses score th&#232;me contexte R&#233;ponses score th&#232;me contexte
G.W. Bush 0.99 pol 2000- &#233;lu au suffrage indirect 0.6 droit -
Bill Clinton 0.7 pol 93-2000 n&#233; sur le sol am&#233;ricain 0.6 droit -
Satan 0.1 pol_opi 2005 un pantin 0.2 pol_opi -
M&#232;re Theresa 0.2 pol_opi 2002-04
Dumbo Bush 0.3 pol_opi 2004
Bartlet 0.6 fic_s&#233;rie 1999-
H. Ford 0.5 fic_film 1997-
</p>
<p>dynamiques des mod&#232;les de langage est rendue possible par l&#8217;indexation en th&#232;me des &#233;nonc&#233;s
utilisateur et des r&#233;ponses du syst&#232;me de recherche d&#8217;information. L&#8217;adaptation des mod&#232;les
acoustiques s&#8217;effectue dynamiquement et de mani&#232;re de plus en plus pouss&#233;e au fur et &#224; mesure
des &#233;changes entre l&#8217;utilisateur et le syst&#232;me. De plus le gestionnaire de dialogue peut le cas
&#233;ch&#233;ant demander &#224; l&#8217;utilisateur d&#8217;&#233;peler certains mots de sa demande.
</p>
<p>1.2 Recherche d&#8217;information
</p>
<p>Le syst&#232;me d&#8217;information prend en entr&#233;e la sortie du syst&#232;me de reconnaissance. Il s&#8217;agit de
parole libre et potentiellement erron&#233;e. Il est donc n&#233;cessaire d&#8217;adapter la communication par
rapport &#224; un moteur question-r&#233;ponse classique, notamment l&#8217;analyse de la question ne peut
se faire &#224; l&#8217;aide de contraintes morpho-syntaxiques fortes mais plut&#244;t d&#8217;une analyse syntaxico-
s&#233;mantique plus l&#226;che. Les &#233;tapes suivantes restent sensiblement les m&#234;mes que dans un moteur
question-r&#233;ponse classique. Par contre, pour ce qui est du retour de l&#8217;information, celle-ci doit
&#234;tre adapt&#233; au dialogue. Il ne s&#8217;agit plus seulement de mettre les &quot;meilleures&quot; r&#233;ponses en pre-
mier mais bien de permettre au dialogue d&#8217;aider l&#8217;utilisateur &#224; choisir celles qui lui conviennent
le mieux. Pour ce faire, les r&#233;ponses sont constitu&#233;es de listes indic&#233;es par un score de confiance
ce qui aide le syst&#232;me de dialogue &#224; prendre sa d&#233;cision pour g&#233;n&#233;rer une r&#233;ponse (ou non) &#224;
l&#8217;utilisateur (cf. tableau 1). Selon ce score la r&#233;ponse pourra comporter une information infor-
mant l&#8217;utilisateur du degr&#233; de confiance qu&#8217;a le syst&#232;me dans sa r&#233;ponse (ex. je crois que,...) Le
nombre de document est lui aussi associ&#233; &#224; une r&#233;ponse. Pour un grand nombre de document
retourn&#233;, deux strat&#233;gies sont possibles.
Le Regroupement par th&#232;mes permet au dialogue de proposer diff&#233;rentes possibilit&#233;s &#224; l&#8217;uti-
lisateur pour que celui-ci oriente sa recherche. Pour chacun de ces topics, un score de confiance
sera attribu&#233; de fa&#231;on &#224; aider le dialogue &#224; orienter au mieux l&#8217;utilisateur. (R: J&#8217;ai plusieurs
r&#233;ponses possibles, 2 dans le domaine de la politique, 3 qui s&#8217;apparentent &#224; des opinions et 2
concernant des fictions. Quelle est la th&#233;matique de votre recherche ? )
La Demande de pr&#233;cision a lieu si le regroupement par th&#232;me n&#8217;est pas possible. Le syst&#232;me
soit demande &#224; l&#8217;utilisateur de pr&#233;ciser sa requ&#234;te soit lui propose quelques exemples pour qu&#8217;il
y r&#233;agisse. ( R: J&#8217;ai des r&#233;ponses avec des noms de personnes et d&#8217;autres sans. Par exemple,
G.W. Bush est le ... ou une r&#233;ponse de type d&#233;finition comme &#233;lu au suffrage universel indirect.
Que recherchez-vous pr&#233;cis&#233;ment ? ) Ainsi, contrairement &#224; l&#8217;augmentation de la pr&#233;cision en
utilisant le retour d&#8217;information en aveugle (Blind relevance feedback), nous avons ici un retour
d&#8217;information &#233;clair&#233; par l&#8217;utilisateur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>O. Galibert, G. Illouz, S. Rosset
</p>
<p>2 Architecture g&#233;n&#233;rale du syst&#232;me actuel
</p>
<p>Lignes
T&#233;l&#233;phoniques
</p>
<p>Transcription
</p>
<p>D&#233;tection de
Parole
</p>
<p>Sp&#233;cifiques
Entit&#233;s Dialogue
</p>
<p>D&#8217;information
Recherche
</p>
<p>G&#233;n&#233;ration Synth&#232;se
</p>
<p>Figure 1: Organisation des composants de RITEL
</p>
<p>Le syst&#232;me est compos&#233; d&#8217;un ensemble simple de composants communicants (figure 1). Le
module de gestion de lignes t&#233;l&#233;phonique envoie le signal audio au d&#233;tecteur de parole et au
syst&#232;me de transcription. Le d&#233;tecteur de parole contr&#244;le l&#8217;activit&#233; de la transcription. La
suite de mots obtenue est envoy&#233;e &#224; la d&#233;tection d&#8217;entit&#233;s sp&#233;cifiques puis au gestionnaire de
dialogue. Celui-ci communique avec le composant de recherche d&#8217;informations pour d&#233;cider
d&#8217;une r&#233;ponse &#224; l&#8217;utilisateur. Le sch&#233;ma s&#233;mantique obtenu est envoy&#233; &#224; la g&#233;n&#233;ration qui en
fait une phrase que la synth&#232;se transforme en un signal audio qui revient finalement au module
t&#233;l&#233;phonique. Nous pr&#233;sentons bri&#232;vement le syst&#232;me de reconnaissance, le syst&#232;me d&#8217;analyse
et le gestionnaire de dialogue dans les sections suivantes.
</p>
<p>2.1 D&#233;tection de parole et syst&#232;me de reconnaissance
</p>
<p>La d&#233;tection de parole est bas&#233;e sur notre segmenteur de conversations t&#233;l&#233;phoniques spon-
tan&#233;es : des mod&#232;les multi-gaussiens mod&#233;lisent le silence et la parole. Un d&#233;codage de viterbi
classique segmente le signal. Le syst&#232;me de reconnaissance est un d&#233;codeur monopasse util-
isant des mod&#232;les acoustiques triphones et un mod&#232;le de langage trigramme suivi d&#8217;un rescoring
en consensus avec un mod&#232;le quadrigramme. Les mod&#232;les acoustiques sont ceux du syst&#232;me
de dialogue Arise (Lamel et al., 2000). Vocabulaire (65000 mots, 1.7% OOV) et mod&#232;les de
langage ont &#233;t&#233; obtenus par interpolation de mod&#232;les de diverses sources sur le d&#233;veloppement.
Elle sont le corpus d&#8217;entra&#238;nement RITEL, les textes de journaux de 1988 &#224; nos jours, les tran-
scriptions d&#8217;&#233;missions de nouvelles radio- et t&#233;l&#233;-diffus&#233;es, des questions venant d&#8217;internet (ex.:
Madwin.fr). La prochaine version int&#232;grera les nouvelles transcriptions du corpus ainsi que des
transcriptions de conversations t&#233;l&#233;phoniques spontan&#233;es.
</p>
<p>2.2 D&#233;tection d&#8217;entit&#233;s sp&#233;cifiques
</p>
<p>Un syst&#232;me de d&#233;tection d&#8217;entit&#233;s sp&#233;cifiques est utilis&#233;. Il prend en entr&#233;e la suite de mots
envoy&#233;e par le syst&#232;me de reconnaissance. Les entit&#233;s sp&#233;cifiques se d&#233;composent en trois
classes: Entit&#233;s nomm&#233;es telles que les personnes (&lt;pers&gt;), les productions (&lt;prod&gt;), les
marqueurs temporels (&lt;time&gt;), les organisations (&lt;org&gt;), les unit&#233;s lexicales (&lt;ul&gt;) et les lieux
(&lt;loc&gt;), les Marqueurs syntaxiques de requ&#234;te (qui, o&#249;, quand, comment, combien...), les
Marqueurs s&#233;mantiques de requ&#234;te qui correspondent &#224; des th&#232;mes (litt&#233;rature, g&#233;ographie,
histoire, soci&#233;t&#233;, cin&#233;ma, politique, &#233;conomie...) et sous-th&#232;mes (auteur, dirigeant, orthographe,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RITEL : dialogue homme-machine &#224; domaine ouvert
</p>
<p>Table 2: G&#233;n&#233;ration de r&#233;ponses : &#224; gauche, une r&#233;ponse factuelle, &#224; droite une incitation
S: Bonjour et bienvenue sur le service Ritel S: Bonjour et bienvenue sur le service Ritel
</p>
<p>du Limsi. Souhaitez-vous &#233;couter le guide ? du Limsi. Souhaitez-vous &#233;couter le guide ?
U: euh non merci je voudrais la capitale de la France U: je voudrais des informations sur l&#8217; ONU
S: La capitale de la France est Paris. S: Vous cherchez une information sur ONU.
</p>
<p>Quelle autre informations d&#233;sirez-vous ? Pouvez-vous &#234;tre plus pr&#233;cis ?
U: euh quel est son pr&#233;sident U: quels pays sont impliqu&#233;s
S: Jacques-Chirac est le dirigeant de la France. S: Votre question porte sur la g&#233;ographie.
</p>
<p>Quelle autre informations d&#233;sirez-vous ? Mais plus pr&#233;cis&#233;ment ? Un pays ? Un ville ?
</p>
<p>population...). Toutes ces entit&#233;s sont extraites et normalis&#233;es via un ensemble de r&#232;gles &#233;crites
sous forme d&#8217;expressions r&#233;guli&#232;res de mots. Des macros (r&#232;gles locales) et des listes peuvent
&#234;tre utilis&#233;es pour la d&#233;finitions des r&#232;gles. Ces macros et listes, ainsi que des r&#232;gles elles-
m&#234;mes, peuvent servir dans la d&#233;finition de contexte. Les analyses sont s&#233;par&#233;es selon leur
fonction : la premi&#232;re &#233;tape consiste &#224; traiter les nombres. La deuxi&#232;me &#233;tape consiste en un
traitement lexical c&#8217;est &#224; dire une normalisation des mots marqueurs syntaxiques de questions.
La troisi&#232;me &#233;tape enfin annote les th&#232;mes, sous-th&#232;mes et entit&#233;s nomm&#233;es. Ainsi un &#233;nonc&#233;
comme qui a &#233;crit le rouge et le noir en mille huit cent trente a pour repr&#233;sentation &lt;subsubject&gt;
&lt;Tauteur&gt; &lt;Tqui&gt; qui &lt;/Tqui&gt; a &#233;crit &lt;/Tauteur&gt; &lt;/subsubject&gt; &lt;prod&gt; le rouge et le noir
&lt;/prod&gt; &lt;time&gt; &lt;1830&gt; mille huit cent trente &lt;/1830&gt; &lt;/time&gt; .
</p>
<p>2.3 Gestionnaire de dialogue
</p>
<p>La premi&#232;re version du gestionnaire de dialogue a consist&#233; exclusivement &#224; inciter les sujets
&#224; parler le plus possible tout en permettant de conserver une interaction raisonnablement na-
turelle. La seconde version permet d&#8217;interroger une base de donn&#233;es. Le r&#244;le du gestionnaire de
dialogue est d&#8217;interpr&#233;ter contextuellement le sch&#233;ma s&#233;mantique que le syst&#232;me de d&#233;tection
d&#8217;entit&#233;s sp&#233;cifiques lui envoie ; r&#233;cup&#233;rer les informations n&#233;cessaires &#224; l&#8217;interrogation de la
base de donn&#233;es ; g&#233;n&#233;rer les sch&#233;mas s&#233;mantiques pour la g&#233;n&#233;ration ; choisir une strat&#233;gie de
g&#233;n&#233;ration ; Le gestionnaire de dialogue commence par mettre &#224; jour les diff&#233;rents marqueurs
caract&#233;risant le dialogue en cours (fonctionnalit&#233;s en cours, g&#233;n&#233;rations pr&#233;c&#233;dentes, nombre
de nouveaux &#233;l&#233;ments...) L&#8217;&#233;nonc&#233; est alors trait&#233;. l&#8217;interpr&#233;tation contextuelle g&#233;n&#232;re un
sch&#233;ma s&#233;mantique en ad&#233;quation avec l&#8217;&#233;tat du dialogue. Le module de d&#233;cision r&#233;interpr&#232;te
ce sch&#233;ma selon un historique plus large en se fondant sur le mod&#232;le de la t&#226;che et le mod&#232;le
de dialogue. Si ce module &#8220;d&#233;cide&#8221; que l&#8217;&#233;nonc&#233; correspond &#224; une possible recherche dans une
base de donn&#233;es, celle-ci est effectu&#233;e. Sinon, la requ&#234;te est trait&#233;e par le module d&#8217;incitation
(cf. tableau 2). Ces deux modules g&#233;n&#232;rent enfin un sch&#233;ma s&#233;mantique qui est envoy&#233; au
module de g&#233;n&#233;ration en langue naturelle.
</p>
<p>Table 3: Corpus RITEL
dialogues 369 mots distincts U 1993 Th&#232;mes 767
dur&#233;e totale U 3h40 moyen &#233;nonc&#233;s U / dial. 9 Sous-Th&#232;mes 701
&#233;nonc&#233;s U 3300 dur&#233;e moyenne U / dial. 34s. marqueurs syntaxiques 3220
mots U 32634 Entit&#233;s Nomm&#233;es 8174</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>O. Galibert, G. Illouz, S. Rosset
</p>
<p>3 Corpus
</p>
<p>Le corpus (Table 3) a &#233;t&#233; collect&#233; entre septembre 2004 et janvier 2005. 13 personnes ont appel&#233;
le serveur. Ces personnes ont re&#231;u chacune une liste diff&#233;rente d&#8217;environ 300 questions. Il leur
&#233;tait demand&#233; de chercher &#224; obtenir une information et d&#8217;utiliser pour cela les moyens qu&#8217;elles
souhaitaient. Il leur &#233;tait pr&#233;cis&#233; qu&#8217;elles ne devaient pas lire les questions qu&#8217;elles avaient en
exemple et qu&#8217;elles pouvaient en choisir d&#8217;autres plus proches de leurs int&#233;r&#234;ts.
</p>
<p>Conclusion - Perspectives
</p>
<p>Actuellement la plateforme permet une interaction naturelle, quoique limit&#233;e, entre un util-
isateur qui recherche des informations et le syst&#232;me. Elle a permis de collecter un corpus
r&#233;aliste et riche d&#8217;un point de vue linguistique. Une recherche d&#8217;information (minimaliste)
est possible, puisque une partie des dialogues a abouti &#224; une r&#233;ponse. Cette premi&#232;re &#233;tude
nous permet de d&#233;gager les points sur lesquels nos travaux futurs vont porter : reconnais-
sance vocale temps-r&#233;el en flux sur vocabulaire large dynamiquement extensible et en domaine
ouvert avec adaptation des mod&#232;les &#224; l&#8217;interlocuteur tout au long de l&#8217;interaction, gestion de
dialogue en domaine ouvert et gestion de l&#8217;information multi-niveau retourn&#233; par le syst&#232;me
de recherche d&#8217;information, recherche d&#8217;information(classification/pr&#233;sentation des r&#233;ponses
suivant l&#8217;&#233;tat du dialogue), types d&#8217;information n&#233;cessaire pour permettre au dialogue et aux
autres modules d&#8217;&#233;valuer leurs analyses et r&#233;ponses suivant l&#8217;&#233;tat du dialogue et des r&#233;sultats
de la recherche d&#8217;information, &#233;tude du co&#251;t des diff&#233;rentes strat&#233;gies pour le lancement de
la recherche d&#8217;information (en continu ou sur d&#233;cision du gestionnaire de dialogue), fonction-
nement en parall&#232;le de la recherche d&#8217;information et du dialogue, g&#233;n&#233;ration de la r&#233;ponse,
r&#233;sum&#233; automatique, etc...
</p>
<p>R&#233;f&#233;rences
EQueR, ELDA (2003) - Evaluation de syst&#232;mes de Question-R&#233;ponse,
http://www.elda.org/article118.html
Gauvain J. L. et Lamel L. F. (2002), Syst&#232;mes de reconnaissance, de compr&#233;hension et de dialogue,
Reconnaissance de la parole Traitement automatique du langage parl&#233;, Hermes Lavoisier, J. Mariani.
Glass J. R. et al. (2000), Data collection and performance evaluation of spoken dialogue systems : the
MIT experience, Actes de ICSLP&#8217;00, Pekin, Chine.
Grau B. (2005), Les syst&#232;mes de question-r&#233;ponse, M&#233;thodes avanc&#233;es pour les syst&#232;mes de recherche
d&#8217;informations, sous la direction de Madjid Ihadjadene, collection Trait&#233; des sciences et techniques de
l&#8217;information, Hermes-science.
S. Harabagiu, et al., (2001), The Role of Lexico-Semantic Feedback in Open-Domain Textual Question-
Answering, Actes de Association for Computational Linguistics
L. Lamel et al., (2000), The LIMSI ARISE System, Speech Communication Vol. 31(4):339-354.
Devillers L. et al. (2004), The French MEDIA/EVALDA Project: the Evaluation of the Understanding
Capability of Spoken Language Dialogue Systems, LREC&#8217;04
J. Villaneau (2003), Contribution au traitement syntactico-pragmatique de la langue naturelle parl&#233;e :
approche logique pour la compr&#233;hension de la parole, Th&#232;se de Doctorat, Universit&#233; de Bretagne Sud.</p>

</div></div>
</body></html>