<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Simplification interactive pour la production de textes adapt&#233;s aux personnes souffrant de troubles de la compr&#233;hension</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Simplification interactive pour la production de textes adapt&#233;s
aux personnes souffrant de troubles de la compr&#233;hension
</p>
<p>Aur&#233;lien Max
LIR-LIMSI-CNRS
Universit&#233; Paris 11
</p>
<p>Orsay, France
aurelien.max@limsi.fr
</p>
<p>Mots-clefs : troubles du langage, simplification syntaxique, r&#232;gles de r&#233;&#233;criture, valida-
tion interactive, traitements de texte
</p>
<p>Keywords: language disorders, syntactic simplification, rewriting rules, interactive valida-
tion, word processors
</p>
<p>R&#233;sum&#233; Cet article traite du probl&#232;me de la compr&#233;hensibilit&#233; des textes et en particulier
du besoin de simplifier la complexit&#233; syntaxique des phrases pour des lecteurs souffrant de
troubles de la compr&#233;hension. Nous pr&#233;sentons une approche &#224; base de r&#232;gles de simplification
d&#233;velopp&#233;es manuellement et son int&#233;gration dans un traitement de texte. Cette int&#233;gration
permet la validation interactive de simplifications candidates produites par le syst&#232;me, et lie la
t&#226;che de cr&#233;ation de texte simplifi&#233; &#224; celle de r&#233;daction.
</p>
<p>Abstract This paper addresses the issue of text readability and in particular the need for
simplifying the syntactic complexity of sentences for language-impaired readers. The proposed
approach uses handcrafted simplification rules and has been integrated into a word processor.
This allows interactive validation of candidate simplified sentences produced by the system, and
integrates the task of creating simplified texts into that of authoring.
</p>
<p>1 Simplification de texte
</p>
<p>La compr&#233;hensibilit&#233; est une propri&#233;t&#233; cruciale d&#8217;un texte, et l&#8217;usage d&#8217;une langue sans con-
traintes particuli&#232;res peut mener &#224; des textes difficiles &#224; comprendre. Or la vocation premi&#232;re
d&#8217;un texte informatif est de v&#233;hiculer une information aupr&#232;s de ses lecteurs (soit d&#8217;atteindre
certains buts communicatifs), ce qui impose des contraintes sur la r&#233;daction de ce texte. Des
troubles du langage peuvent n&#233;anmoins interdire la compr&#233;hension de textes qui seraient autre-
ment jug&#233;s raisonnablement compr&#233;hensibles. L&#8217;aphasie de Broca1 a pour effets de rendre
compliqu&#233;e l&#8217;expression ainsi que l&#8217;interpr&#233;tation d&#8217;&#233;nonc&#233;s contenant une certaine complexit&#233;
</p>
<p>1L&#8217;aphasie est un trouble du langage pouvant survenir &#224; la suite d&#8217;une attaque c&#233;r&#233;brale touchant les lobes
frontaux et temporaux de l&#8217;h&#233;misph&#232;re gauche du cerveau. Plusieurs cat&#233;gories d&#8217;aphasies existent, et elles peuvent
affecter la compr&#233;hension aussi bien que la production du langage.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien Max
</p>
<p>linguistique, alors que les connaissances s&#233;mantiques du sujet sont intactes. Il semble donc im-
portant de pouvoir produire des textes adapt&#233;s &#224; ces lecteurs, ou au moins de d&#233;river des textes
simplifi&#233;s &#224; partir de textes existants.
</p>
<p>La simplification de texte a r&#233;cemment &#233;t&#233; l&#8217;objet de plusieurs travaux, avec comme motiva-
tion la simplification de texte en vue d&#8217;une analyse syntaxique (Chandrasekar et al, 1996) ou
la simplification de texte destin&#233;e aux lecteurs souffrant de troubles du langage (Carroll et al,
1998; Devlin, 1999; Liben-Nowell, 2000; Canning, 2002). L&#8217;approche de Chandrasekar et
al. se base sur des r&#232;gles de simplification syntaxique qui sont apprises depuis un corpus sim-
plifi&#233; manuellement. Les autres approches utilisent des r&#232;gles &#233;crites manuellement qui sont
appliqu&#233;es sur la sortie d&#8217;un analyseur syntaxique. Plus r&#233;cemment, (Siddharthan, 2003) s&#8217;est
int&#233;ress&#233; &#224; la conservation de la coh&#233;rence des textes r&#233;sultant de simplifications syntaxiques.
</p>
<p>L&#8217;approche que nous pr&#233;sentons ici se distingue des pr&#233;c&#233;dentes par le fait qu&#8217;elle vise &#224; int&#233;grer
un module de simplification de texte &#224; base de r&#232;gles dans un outil de r&#233;daction traditionnel (un
traitement de texte). Il nous semble en effet important de pouvoir consid&#233;rer la production d&#8217;un
texte simplifi&#233; comme une activit&#233; li&#233;e &#224; celle de la r&#233;daction du texte dont il est issu, ce qui
permet d&#8217;impliquer l&#8217;auteur dans les choix pour lesquels un syst&#232;me automatique ne pourrait
prendre de d&#233;cision satisfaisante dans le cas g&#233;n&#233;ral. Dans cet article, nous nous concentrerons
sur la simplification syntaxique des phrases2. Dans l&#8217;approche que nous avons choisie, les sim-
plifications sont le r&#233;sultat de l&#8217;application non-d&#233;terministe de r&#232;gles de r&#233;&#233;criture d&#233;velopp&#233;es
manuellement par un linguiste. Cette approche est en partie justifi&#233;e par la difficult&#233; &#224; obtenir
des corpus align&#233;s de textes et de leur simplification qui pourraient servir &#224; un apprentissage de
ces r&#232;gles3 ou &#224; des techniques bas&#233;es sur l&#8217;exemple.
</p>
<p>2 Syst&#232;me de simplification syntaxique par r&#233;&#233;criture
</p>
<p>Nous avons choisi une approche &#224; base de r&#232;gles pour la simplification syntaxique des phrases
d&#8217;un texte en anglais s&#8217;inspirant de travaux sur la transduction d&#8217;arbres. L&#8217;utilisation de r&#232;-
gles permet d&#8217;exprimer des conditions sur leur applicabilit&#233; qui offrent une meilleure ma&#238;trise
du contexte de simplification qui peut &#234;tre plus ou moins sp&#233;cifi&#233; (des mots jusqu&#8217;aux cat&#233;-
gories syntaxiques profondes les dominant par exemple). Le d&#233;veloppement des r&#232;gles peut
&#234;tre incr&#233;mental, ce qui autorise une &#233;valuation progressive du syst&#232;me sur un corpus de test
constant, afin de contr&#244;ler que l&#8217;ajout de r&#232;gles ne d&#233;grade pas les performances. Par ailleurs,
la non-couverture d&#8217;une structure syntaxique particuli&#232;re ne r&#233;alise pas de simplification non
souhait&#233;e, et laisse donc localement la phrase inchang&#233;e, ce qui garantit au pire la conservation
de sa complexit&#233; syntaxique. Une telle approche nous a sembl&#233; d&#8217;autant plus acceptable si elle
est int&#233;gr&#233;e &#224; un traitement de texte qui autorise facilement les r&#233;visions ou modifications.
</p>
<p>Le niveau de description des phrases utilis&#233; pour d&#233;crire les patrons de r&#233;&#233;criture est choisi par
le linguiste en charge de l&#8217;&#233;criture des r&#232;gles. Ce niveau doit &#234;tre d&#233;rivable automatiquement
&#224; partir du texte, ce qui pose la question du compromis entre la robustesse de l&#8217;analyse et la
finesse de description. Au minimum, la s&#233;quence de parties du discours des mots du texte peut
</p>
<p>2Un syst&#232;me complet de simplification de texte doit &#233;galement au minimum pouvoir permettre de r&#233;soudre les
anaphores ainsi que de simplifier la complexit&#233; lexicale.
</p>
<p>3Comme le note (Siddharthan, 2003), la simplification manuelle d&#8217;un corpus de texte permettrait vraisem-
blablement de proposer un jeu de r&#232;gles de simplification qui devrait avoir une performance au moins comparable
&#224; celle de r&#232;gles apprises sur ce corpus simplifi&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Simplification interactive pour la production de textes adapt&#233;s aux personnes
souffrant de troubles de la compr&#233;hension
</p>
<p>&#234;tre utilis&#233;e comme une structure plate, mais elle n&#8217;offre que peu de possibilit&#233;s de simplifica-
tion. Des structures syntaxiques plus ou moins profondes seront donc utilis&#233;es en fonction des
analyseurs disponibles4.
</p>
<p>Une contrainte importante de notre approche de r&#233;&#233;criture par r&#232;gles est que les informations
n&#233;cessaires &#224; la g&#233;n&#233;ration des phrases simplifi&#233;es doivent pouvoir &#234;tre d&#233;riv&#233;es &#224; partir des
phrases en entr&#233;e (bien que l&#8217;auteur ait ensuite l&#8217;opportunit&#233; de modifier les phrases simpli-
fi&#233;es). Si passer par une repr&#233;sentation s&#233;mantique interm&#233;diaire des phrases pour faire de la
simplification par reg&#233;n&#233;ration serait souhaitable, cela pose d&#8217;importants probl&#232;mes d&#8217;analyse
et de repr&#233;sentation et implique la disponibilit&#233; d&#8217;un moteur de g&#233;n&#233;ration de texte param&#233;tra-
ble. Les r&#232;gles syntaxiques permettent de r&#233;utiliser le contenu pr&#233;sent en entr&#233;e dans la sortie
du simplificateur, et de nouveaux &#233;l&#233;ments peuvent soit &#234;tre directement sp&#233;cifi&#233;s dans la sortie,
soit exprim&#233;s par le biais de conditions sur les r&#232;gles.
</p>
<p>Il n&#8217;est cependant pas enti&#232;rement possible de s&#8217;affranchir de certaines fonctionnalit&#233;s de g&#233;n&#233;ra-
tion morphologique, puisque certaines modifications de la syntaxe impliqueront la production
de formes de surface adapt&#233;es au nouveau contexte5. Divers modules d&#8217;analyse et de g&#233;n&#233;ration
linguistiques peuvent ainsi &#234;tre utilis&#233;s dans les conditions des r&#232;gles.
</p>
<p>La simplification d&#8217;un texte est op&#233;r&#233;e phrase par phrase. Les patrons sp&#233;cifiant les structures
syntaxiques &#224; r&#233;&#233;crire sont recherch&#233;s dans la structure obtenue pour la phrase en entr&#233;e, et ce &#224;
quelque profondeur que ce soit. Sous r&#233;serve que les &#233;ventuelles conditions d&#8217;application soient
remplies, le patron sp&#233;cifiant la sortie remplace le patron d&#8217;entr&#233;e, ce qui peut g&#233;n&#233;rer autant de
simplifications qu&#8217;il y a d&#8217;occurrences du patron d&#8217;entr&#233;e dans la phrase. Les patrons d&#8217;entr&#233;e
des r&#232;gles sont r&#233;cursivement recherch&#233;s dans les sorties du syst&#232;me pour produire l&#8217;ensemble
des simplifications possibles tenant compte des diff&#233;rents ordres d&#8217;application des r&#232;gles.
</p>
<p>Le format des patrons de sortie doit donc &#234;tre compatible avec le format des patrons d&#8217;entr&#233;e,
mais les &#233;tiquettes de sortie peuvent &#234;tre volontairement modifi&#233;es afin, soit d&#8217;interdire l&#8217;applica-
tion ult&#233;rieure d&#8217;autres r&#232;gles sur un constituant particulier, soit au contraire de d&#233;clencher
l&#8217;application d&#8217;une r&#232;gle r&#233;alisant un traitement particulier6.
</p>
<p>Enfin, la nature des r&#233;&#233;critures effectu&#233;es requiert la possibilit&#233; d&#8217;ins&#233;rer dans la sortie du sys-
t&#232;me de nouvelles phrases, qui pourront pr&#233;c&#233;der ou suivre la phrase dans laquelle le patron
d&#8217;entr&#233;e a &#233;t&#233; trouv&#233;.
</p>
<p>Format des r&#232;gles de r&#233;&#233;criture Nous avons donn&#233; une importance particuli&#232;re au fait que
les r&#232;gles puissent &#234;tre &#233;crites par des linguistes familiers notamment avec des notations d&#8217;arbres
de d&#233;rivation syntaxiques. Les r&#232;gles sont fortement bas&#233;es sur la notion d&#8217;unification de varia-
</p>
<p>4Un analyseur probabiliste robuste pour l&#8217;anglais tel que RASP (Bricoe et Carroll, 2002) offre une solution
robuste pouvant retourner une for&#234;t de solutions annot&#233;es par leur probabilit&#233;. Cela pose notamment le probl&#232;me
de la s&#233;lection de l&#8217;analyse retenue pour op&#233;rer la simplification. Bien qu&#8217;il soit possible de consid&#233;rer par d&#233;faut
l&#8217;analyse la plus probable retourn&#233;e par le syst&#232;me, une certaine d&#233;sambigu&#239;sation parmi les plus probables pourrait
&#234;tre envisag&#233;e dans notre contexte interactif.
</p>
<p>5C&#8217;est par exemple le cas du verbe de la proposition principale lors du passage d&#8217;une phrase de la voix pas-
sive &#224; la voix active, puisque celui-ci doit s&#8217;accorder en personne et en nombre avec l&#8217;agent du verbe qui &#233;tait
pr&#233;c&#233;demment situ&#233; dans un syntagme pr&#233;positionnel, ex: The cat is chased by the dog. ! The dog chases the cat.
</p>
<p>6Par exemple, il est ainsi possible de marquer un groupe nominal ind&#233;fini comme devant &#234;tre transform&#233; en
groupe nominal d&#233;fini par une r&#232;gle appropri&#233;e lorsqu&#8217;il est repris dans une nouvelle phrase, ex.:A terrifying dog
chases the cat. ! A dog is chasing the cat. The dog is terrifying.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien Max
</p>
<p>bles, qui peuvent correspondre &#224; des litt&#233;raux, &#224; des arbres, ou &#224; des for&#234;ts d&#8217;arbres7.
</p>
<p>La r&#232;gle ci-dessous donne un exemple pour le passage &#224; la voix active de phrases &#224; la voix
passive contenant un agent exprim&#233;8. Les cat&#233;gories et structures syntaxiques de l&#8217;exemple
sont celles utilis&#233;es dans le Penn TreeBank qui nous a servi comme corpus de test initial.
</p>
<p>d e f i n e A c t i v i s e p a s s i v e s e n t e n c e s wi th o v e r t a g e n t
</p>
<p>i f [ be , I n f l B e ] i s a n a l y z e V e r b ( TagBe , [ Be ] ) ;
? OptAdvs c o n t a i n s on ly advp rb ; ? O p t P a r t c o n t a i n s on ly p r t ;
</p>
<p>r e w r i t e [ s [ ? Opt1
[ np&#0;Index NPTheme ]
? Opt2
[ vp [ [ TagBe [ Be ] ]
</p>
<p>[ vp [ ? OptAdvs
[ vbn Verb ]
? O p t P a r t
[ np [ [ none [ Trace&#0;Index ] ] ] ]
</p>
<p>? Opt3
[ pp [ [ p r ep [ by ] ]
</p>
<p>[ np / l g s NPAgent ] ] ]
? Opt4 ] ] ] ]
</p>
<p>? Opt5 ] ]
a s [ s [ ? Opt1
</p>
<p>[ np NPAgent ]
? Opt2
[ vp [ [ S u r f a c e T a g [ S u r f a c e V e r b ] ]
</p>
<p>? O p t P a r t
[ np NPTheme ]
? Opt3
? Opt4 ] ]
</p>
<p>? Opt5 ] ]
where [ Number , Pe r s on ] i s number ( NPAgent ) ;
</p>
<p>[ BaseForm , I n f l ] i s a n a l y z e V e r b ( vbn , Verb ) ;
[ Sur faceVerb , S u r f a c e T a g ] i s g e n e r a t e V e r b ( BaseForm , I n f l B e , Number , Pe r s on ) ;
</p>
<p>La premi&#232;re condition de la clause if qui fait l&#8217;appel de la fonction linguistique analyzeVerb
indique que le verbe de la clause principale doit avoir pour lemme be, et que la flexion du verbe
(temps et personne) doit se retrouver dans la variable InflBe. Cette derni&#232;re information sera
utilis&#233;e dans la clause where pour produire la version de surface du verbe principal dans la
phrase &#224; la voix active (fonction generateVerb). Les deux autres conditions de la clause
where tentent de reconna&#238;tre la personne et le nombre du groupe nominal agent, ainsi que le
lemme du verbe au participe pass&#233; (fonctions number et analyzeVerb).
Les constituants optionnels repr&#233;sentant des for&#234;ts d&#8217;arbres (ex: ?OptAdvs) peuvent &#234;tre r&#233;u-
tilis&#233;s ou non dans les patrons de sortie, mais il n&#8217;est pas possible de faire r&#233;f&#233;rence &#224; leur struc-
ture interne dans la r&#232;gle dans laquelle ils sont reconnus, ce qui pourra &#234;tre fait par l&#8217;application
de r&#232;gles ult&#233;rieures si ces constituants sont r&#233;inject&#233;s dans un patron de sortie. Cette fonction-
nalit&#233; est particuli&#232;rement utile pour des constituants qui ne sont pas pertinents pour la r&#232;gle de
simplification en cours d&#8217;application mais qui sont domin&#233;s par le constituant racine d&#8217;un pa-
</p>
<p>7L&#8217;impl&#233;mentation du moteur de simplification a &#233;t&#233; r&#233;alis&#233;e en langage Prolog.
8Une estimation (Canning, 2002) indique qu&#8217;environ 80% des phrases en anglais au passif n&#8217;ont pas d&#8217;agent
</p>
<p>exprim&#233;, et que dans ce cas il est particuli&#232;rement difficile, voire impossible, de le retrouver (ex: She was taken
to the hospital). Notre syst&#232;me n&#8217;a pas la pr&#233;tention de simplifier de telles phrases, bien qu&#8217;il serait possible dans
certains cas d&#8217;ins&#233;rer un agent ind&#233;fini tel que something ou someone (ce qui requiert n&#233;anmoins la d&#233;termination
du caract&#232;re &quot;anim&#233;&quot; de cet agent).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Simplification interactive pour la production de textes adapt&#233;s aux personnes
souffrant de troubles de la compr&#233;hension
</p>
<p>tron d&#8217;entr&#233;e (par exemple, ?Opt4 et ?Opt5 regrouperont l&#8217;ensemble des constituants suivant
le syntagme pr&#233;positionnel contenant l&#8217;agent et appartenant au groupe verbal englobant).
</p>
<p>S&#233;lection de la meilleure simplification L&#8217;application des r&#232;gles de simplification syntaxique
produit une liste de sorties qui sont ordonn&#233;es par ordre de production par le moteur de simplifi-
cation, qui d&#233;pend de l&#8217;ordre d&#8217;analyse des r&#232;gles. Puisque nous avons choisi d&#8217;int&#233;grer la sim-
plification syntaxique dans un traitement de texte, il est possible de demander &#224; l&#8217;utilisateur de
choisir la simplification qui lui semble la plus appropri&#233;e. Cependant, il est souhaitable de pou-
voir au pr&#233;alable ordonner les simplifications candidates par un score d&#233;croissant qui indique
leur qualit&#233;. Id&#233;alement, cette qualit&#233; impliquerait une prise en compte de la compr&#233;hensibilit&#233;
des phrases, ainsi que de la conservation du sens par rapport &#224; la phrase de d&#233;part. Or ce dernier
&#233;l&#233;ment rel&#232;ve du jugement expert de l&#8217;auteur du texte (ou de l&#8217;utilisateur de notre syst&#232;me)9.
De nombreuses mesures de compr&#233;hensibilit&#233; (readability) des textes ont &#233;t&#233; propos&#233;es (voir
par ex. (Siddharthan, 2003)), comme par exemple la formule de Flesch qui combine le nombre
de syllabes par mot et le nombre de mots par phrase. Une hypoth&#232;se fondamentale de notre
approche est qu&#8217;une r&#232;gle de simplification &quot;casse&quot; une structure syntaxique difficile pour la
remplacer par une structure syntaxique plus facile &#224; comprendre10. Ainsi, la simplification
syntaxique effectu&#233;e doit corr&#233;ler avec le nombre de r&#232;gles appliqu&#233;es. L&#8217;ordonnancement des
simplifications utilis&#233; prend donc en compte le nombre d&#8217;applications de r&#232;gles sans doublons
dans la sortie11, puis la taille moyenne des phrases. &#192; la demande de l&#8217;utilisateur, une phrase est
analys&#233;e puis simplifi&#233;e, puis les 5 simplifications obtenant les meilleurs scores sont propos&#233;es.
</p>
<p>&#201;valuation initiale du syst&#232;me Nous avons d&#233;velopp&#233; un jeu de r&#232;gles destin&#233; &#224; simplifier
les textes pour les personnes souffrant d&#8217;aphasie. Pour cela, nous avons notamment suivi les
r&#233;sultats exp&#233;rimentaux obtenus par Caplan (Caplan, 1987) et avons extrait des structures syn-
taxiques pr&#233;sentant une complexit&#233; particuli&#232;re pour ces patients. Le tableau 1 illustre certains
types de ph&#233;nom&#232;nes trait&#233;s avec un exemple de simplification propos&#233;e.
</p>
<p>Nous n&#8217;avons pas &#233;t&#233; en mesure de pouvoir nous-m&#234;mes &#233;valuer l&#8217;impact sur la compr&#233;hension
de phrases par des patients aphasiques. L&#8217;&#233;valuation de la conservation du sens est un pro-
bl&#232;me tr&#232;s difficile auquel est confront&#233; toute approche de paraphrase. L&#8217;applicabilit&#233; de notre
approche vient du fait que l&#8217;auteur du texte d&#8217;origine a la possibilit&#233; de valider interactivement
la simplification propos&#233;e par le syst&#232;me qui lui semble la plus ad&#233;quate. Il nous reste &#224; &#233;valuer
empiriquement l&#8217;acceptabilit&#233; et l&#8217;utilisabilit&#233; de notre syst&#232;me au sein d&#8217;un traitement de texte.
</p>
<p>9Sans d&#233;cision humaine, la simplification obtenant le meilleur score peut &#234;tre propos&#233;e par d&#233;faut.
10Ceci ne concerne n&#233;anmoins pas toutes les r&#232;gles, puisque certaines ont pour but de r&#233;aliser des changements
</p>
<p>n&#233;cessaires pour assurer la coh&#233;rence du texte, comme la r&#232;gle mentionn&#233;e plus t&#244;t transformant un groupe nominal
ind&#233;fini en groupe nominal d&#233;fini.
</p>
<p>11Afin de contourner ce probl&#232;me, nous souhaitons modifier le moteur de simplification pour qu&#8217;il applique
d&#8217;abord les r&#232;gles qui simplifient les structures les plus &quot;profondes&quot; dans l&#8217;arbre syntaxique de la phrase en entr&#233;e.
Cette approche semble &#233;galement intuitivement plus proche de la m&#233;thodologie de simplification suivie par un
humain.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien Max
</p>
<p>Type de phrase Exemple de simplification
Passive The elephant
i
</p>
<p>was hit t
i
</p>
<p>by the monkey
! The monkey hit the elephant.
</p>
<p>Cleft Object It was the elephant
i
</p>
<p>[that the monkey hit t
i
</p>
<p>]
! The monkey hit the elephant.
</p>
<p>Dative The elephant gave the rabbit the monkey
! The elephant gave the monkey. The rabbit received the monkey.
</p>
<p>Conjoined The elephant [[hit the monkey] and [hugged the rabbit]]
! The elephant hit the monkey. The elephant hugged the rabbit.
</p>
<p>Subject-Object relative The elephant
i
</p>
<p>[that the monkey hit t
i
</p>
<p>] hugged the rabbit
! The monkey hugged the elephant. The elephant hugged the rabbit.
</p>
<p>Object-Subject relative The elephant hit [the monkey that hugged the rabbit]
! The monkey hugged the rabbit. The elephant hit the monkey.
</p>
<p>Figure 1: Exemples d&#8217;application de r&#232;gles de simplification
</p>
<p>3 Perspectives
</p>
<p>Un point important pour l&#8217;acceptabilit&#233; du syst&#232;me concerne le fait que le syst&#232;me doit &#233;viter
de demander &#224; l&#8217;utilisateur plusieurs validations pour des phrases similaires, et propager des
d&#233;cisions lorsque cela est possible. La validation interactive permet de constituer progressive-
ment un corpus align&#233; de phrases et de leur simplification, ainsi que d&#8217;attribuer des poids aux
r&#232;gles de simplification &#233;tant donn&#233; l&#8217;historique d&#8217;une s&#233;rie d&#8217;applications de r&#232;gle. Ces poids
pourraient alors &#234;tre utilis&#233;s par le moteur pour guider les simplifications ult&#233;rieures d&#8217;apr&#232;s la
m&#233;moire de simplification ainsi constitu&#233;e.
</p>
<p>Remerciements L&#8217;auteur remercie David Liben-Nowell pour les nombreuses discussions sur
le th&#232;me de la simplification syntaxique et pour le travail commun sur le syst&#232;me initial.
</p>
<p>R&#233;f&#233;rences
Briscoe, Edward et John Carroll (2002), Robust accurate statistical annotation of general text, Actes de
Conference on Language Resources and Evaluation (LREC&#8217;02), Las Palmas, Gran Canaria.
Canning, Yvonne (2002), Syntactic simplification of text, Th&#232;se de PhD, Universit&#233; de Sunderland.
Caplan, D. (1987), Neurolinguistics and Linguistic Aphasiology, Cambridge University Press, Cam-
bridge.
Carroll, John, Guido Minnen, Yvonne Canning, Siobhan Devlin et John Tait (1998), Practical Simplifi-
cation of English Newspaper Text to Assist Aphasic Readers, Actes de AAAI-98 Workshop on Integrating
Artificial Intelligence and Assistive Technology, Madison, &#201;tats-Unis.
Chandrasekar, R., C. Doran et B. Srinivas (1996), Motivations and methods for text simplification, Actes
de COLING&#8217;96, Copenhague, Danemark.
Devlin, Siobhan (1999), Simplifying natural language for aphasic readers, Th&#232;se de PhD, Universit&#233; de
Sunderland.
Liben-Nowell, David (2000), Syntactic Simplification, Th&#232;se de MPhil, Universit&#233; de Cambridge.
Siddharthan, Advaith (2003), Syntactic Simplification and Text Cohesion, Th&#232;se de PhD, Universit&#233; de
Cambridge.</p>

</div></div>
</body></html>