<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Morphos&#233;mantique pour l'appariement de termes dans le vocabulaire m&#233;dical : approche multilingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Morphos&#233;mantique pour l'appariement de termes dans le 
vocabulaire m&#233;dical : approche multilingue 
</p>
<p>Fiammetta Namer 
</p>
<p>UMR &quot;ATILF&quot; CNRS &amp; Universit&#233; Nancy2 
</p>
<p>Mots Clefs : morphologie, s&#233;mantique, multilinguisme, composition savante, relation 
lexicale, terminologie m&#233;dicale 
</p>
<p>Keywords: morphology, semantics, multilingualism, neoclassical compounding, lexical 
relation, medical terminology 
</p>
<p>R&#233;sum&#233; : Cet article s'int&#233;resse &#224; la mani&#232;re dont la morphos&#233;mantique peut contribuer &#224; l'appariement 
multilingue de variantes terminologiques entre termes. L'approche d&#233;crite permet de relier automatiquement 
entre eux les noms et adjectifs compos&#233;s savants d'un corpus sp&#233;cialis&#233; en m&#233;decine (synonymie, hyponymie, 
approximation). L'acquisition de relations lexicales est une question particuli&#232;rement cruciale lors de 
l'&#233;laboration de bases de donn&#233;es et de syst&#232;mes de recherche d'information multilingues. La m&#233;thode est 
applicable &#224; au moins cinq langues europ&#233;ennes dont elle exploite les caract&#233;ristiques morphologiques similaires 
des mots compos&#233;s dans les langues de sp&#233;cialit&#233;. Elle consiste en l'int&#233;raction de trois dispositifs : (1) un 
analyseur morphos&#233;mantique monolingue, (2) une table multilingue qui d&#233;finit des relations de base entre les 
racines gr&#233;co-latines des lex&#232;mes savants, (3) quatre r&#232;gles ind&#233;pendantes de la langue qui inf&#232;rent, &#224; partir de 
ces relations de base, les relations lexicales entre les lex&#232;mes contenant ces racines. L'approche d&#233;crite est 
impl&#233;ment&#233;e en fran&#231;ais, o&#249; l'on dispose d'un analyseur morphologique capable de calculer la d&#233;finition de mots 
construits inconnus &#224; partir du sens de ses composants. Le corpus de travail est un lexique sp&#233;cialis&#233; m&#233;dical 
d'environ 29000 lex&#232;mes, que le calcul des relations de synonymie, hyponymie et approximation a permis de 
regrouper en plus de 3000 familles lexicales. 
</p>
<p>Abstract: This paper addresses the issue of the interaction between morphosemantics and term variants 
extraction. The described method enables neoclassical compound nouns and adjectives of a biomedical 
specialized corpus to be automatically related by synonymy, hyponymy and approximation links. Acquiring 
lexical relations is a particularly crucial issue when elaborating multilingual databases and when developing 
cross-language information retrieval systems. This method can be applied at least to five European languages 
and exploits the similarity between the morphological characteristics of compound words in specialized 
domains. It requires the interaction of three techniques: (1) a language-specific morphosemantic parser, (2) a 
multilingual table defining basic relations between word roots, and (3) a set of language-independant rules to 
draw up the list of related terms. This approach has been fully implemented for French, on an about 29,000 terms 
biomedical lexicon, resulting to more than 3,000 lexical families. 
</p>
<p>1 Variation terminologique et morphologie 
Dans le domaine bio-m&#233;dical, comme dans toute langue de sp&#233;cialit&#233;, l'extraction de variantes 
terminologiques constitue un enjeu important (Bourigault et al. 2001). L'objectif que la 
d&#233;marche pr&#233;sent&#233;e ici vise &#224; atteindre, est de mettre &#224; contribution la morpho-s&#233;mantique 
pour ma&#238;triser l'appariement terminologique bilingue, voire translinguistique. Le but est 
l'enrichissement des relations entre termes dans les bases multilingues de connaissances. 
L'interrogation de ressources h&#233;t&#233;rog&#232;nes (bases de donn&#233;es, notices bibliographiques etc.) 
</p>
<p>TALN 2005, Dourdan, 6-10 juin 2005</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>dans plusieurs langues est une pr&#233;occupation constante dans les domaines de sp&#233;cialit&#233;, qui a 
conduit au d&#233;veloppement de plusieurs techniques pour l'&#233;tablissement de terminologies 
multilingues. L'extraction terminologique et l'alignement de corpus parall&#232;les (Gaussier 
2001), sont deux &#233;tapes classiques dans la conception de tels syst&#232;mes (voir l'exp&#233;rience de 
(Tran et al. 2003)). En mati&#232;re de synergie entre terminologie et morphologie, diff&#233;rentes 
&#233;tudes et applications existent. Certaines se basent sur la reconnaissance de s&#233;quences au 
moyen de patrons (Daille 2001; Jacquemin, Tzoukermann 1999) d'autres utilisent plut&#244;t des 
syst&#232;mes statistiques fond&#233;s sur l'apprentissage de r&#232;gles (Hathout 2003; Grabar, 
Zweigenbaum 2000). Enfin, des travaux ont &#233;t&#233; men&#233;s dans le but de faire coop&#233;rer 
morphologie et terminologie bilingue, entre autre par (Chiao, Zweigenbaum 2003). Notre 
approche se situe plut&#244;t dans la lign&#233;e des syst&#232;mes bas&#233;s sur l'application de contraintes. 
L'analyseur morphologique D&#233;riF1 (Namer 2003), qui constitue l'une des &#233;tapes de notre 
syst&#232;me, a &#233;t&#233; r&#233;cemment adapt&#233; pour l'analyse du vocabulaire bio-m&#233;dical, dans le cadre des 
projets UMLF et Vumef. Comme nous allons le voir, D&#233;riF se fonde sur la transposition de 
connaissances linguistiques pour apparier les lex&#232;mes sp&#233;cialis&#233;s au moyen de relations de 
trois types : (1) il relie le lex&#232;me analys&#233; &#224; sa base (bact&#233;rien, bact&#233;rie) m&#234;me si celle-ci est 
d'origine gr&#233;co-latine (h&#233;patique, foie), (2) ce lien est annot&#233; au moyen d'une pseudo-
d&#233;finition (amyotrophie : &quot;absence de d&#233;veloppement des muscles&quot;) ; (3) gr&#226;ce &#224; l'adaptation 
des ressources sp&#233;cifiques au domaine bio-m&#233;dical, D&#233;riF calcule les relations de synonymie, 
hyponymie et approximation2 entre les mots compos&#233;s dits-savants (Fradin 2000; Warren 
1990) : hyst&#233;rorragie y est vu comme synonyme de m&#233;trorragie, hyponyme de hyst&#233;rorrh&#233;e, 
voisin de colporragie ; l'int&#233;r&#234;t de ces compos&#233;s savants est qu'ils constituent &#224; eux seuls pr&#232;s 
de la moiti&#233; des n&#233;ologismes recens&#233;s dans les textes m&#233;dicaux (Lovis et al. 1998). La 
possibilit&#233; de b&#226;tir une m&#233;thode translinguistique vient du fait que, contrairement &#224; la langue 
g&#233;n&#233;rale, la morphologie des lex&#232;mes sp&#233;cialis&#233;s ob&#233;it &#224; des r&#232;gles constructionnelles 
extr&#234;mement proches dans toutes les langues europ&#233;ennes (Iacobini 2003). Pour les m&#234;mes 
raisons, la d&#233;marche multilingue s'applique au calcul des liens lexicaux entre mots compos&#233;s 
savants du vocabulaire m&#233;dical3 ; trois types de ressources int&#233;ragissent : un analyseur 
morphologique, une table &#233;tablissant des relations de base entre les racines gr&#233;co-latines 
pouvant entrer dans la formation de mots, et un syst&#232;me de r&#232;gles calculant les relations 
lexicales entre les termes. Alors que la conception d'un analyseur est une t&#226;che qui doit &#234;tre 
r&#233;it&#233;r&#233;e pour chaque nouvelle langue, nous allons voir que la table est une donn&#233;e unique 
multilingue et que le syst&#232;me de r&#232;gles est ind&#233;pendant de la langue choisie. L'approche a &#233;t&#233; 
impl&#233;ment&#233;e en fran&#231;ais, sur un lexique d'environ 29000 termes, et donne lieu &#224; l'&#233;mergence 
d'environ 3000 familles lexicales. L'article s'organise comme suit. Nous pr&#233;sentons tout 
d'abord (&#167;2) les connaissances et donn&#233;es sur lesquelles repose l'approche morphologique 
pour la d&#233;finition multilingue de relations lexicales entre termes. Ensuite, (&#167;3) nous 
d&#233;veloppons la m&#233;thode utilis&#233;e pour r&#233;aliser cet objectif, et nous pr&#233;sentons (&#167;4) les r&#233;sultats 
obtenus en fran&#231;ais. Ces r&#233;sultats conduisent naturellement &#224; une discussion et &#224; des 
perspectives (&#167;5) qui cl&#244;tureront cette pr&#233;sentation. 
</p>
<p>2 Gen&#232;se 
Comme annonc&#233; en &#167;1, la m&#233;thode propos&#233;e s'appuie sur la synergie entre un analyseur 
morphologique bas&#233; sur r&#232;gles, une table qui classe et annote les racines gr&#233;co-latines 
</p>
<p>                                                 
1 D&#233;riF a &#233;t&#233; d&#233;velopp&#233; lors des projets ACI MorTAL (G. Dal, CNRS) et UMLF (P. Zweigenbaum, INSERM), 
</p>
<p>et RNTS VumeF (S. Darmoni, L@stics et JF Forget, Vidal) (Zweigenbaum et al. 2003; Darmoni et al. 2003). 
2 L'approximation (voisinage) subsume les notions de co-m&#233;ronymie, de co-hyponymie et de compatibilit&#233;. 
3 Les exemples sont donn&#233;s en fran&#231;ais, italien, espagnol, allemand anglais, not&#233;s respectivement : FR, IT, ES, DE,EN 
</p>
<p>Fiammetta Namer</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>utilis&#233;es dans les termes m&#233;dicaux, et des r&#232;gles de calcul de relations lexicales entre mots 
compos&#233;s savants. Un certain nombre de constatations sont &#224; l'origine de cette d&#233;marche qui 
est &#224; la fois ind&#233;pendante de la langue de travail, et sp&#233;cifique aux domaines de sp&#233;cialit&#233; 
proches du biom&#233;dical. (1) Les th&#233;ories en morphologie lexicale4 permettent de d&#233;duire la 
d&#233;finition d'un mot morphologiquement complexe en fonction de celui de ses constituants. 
Donc, un syst&#232;me impl&#233;mentant une telle approche th&#233;orique (comme D&#233;riF, cf. &#167;4) est &#224; 
m&#234;me de calculer la pseudo-d&#233;finition de mots inconnus &#224; partir des proc&#233;d&#233;s 
morphologiques mis en &#339;uvre. (2) Quelle que soit la langue europ&#233;enne consid&#233;r&#233;e, les mots 
complexes en biom&#233;decine contiennent dans leur grande majorit&#233; des racines gr&#233;co-latines 
(gastr-, -phage, -hydr-), qu'&#224; la suite de (Haspelmath 2002) entre autres, nous nommerons 
&#233;l&#233;ments de formation, not&#233;s EFs. Un EF partage sa cat&#233;gorie et son sens avec l'entr&#233;e 
lexicale contemporaine auquel il suppl&#233;e (ainsi, gastr- signifie estomacFR, et son type 
cat&#233;goriel est NOM). D'une langue &#224; l'autre, la r&#233;alisation des EFs ne pr&#233;sente que de l&#233;g&#232;res 
variations graphiques, et leur emploi dans la formation de termes de sp&#233;cialit&#233; met en jeu des 
r&#232;gles quasiment identiques (Iacobini 2003). Il en r&#233;sulte que les EFs et les structures de mots 
complexes peuvent avantageusement &#234;tre repr&#233;sent&#233;s par des symboles abstraits, qui 
gomment les diff&#233;rences entre les langues. Ainsi, le terme abstrait VASCUL--ITE5 correspond &#224; 
vascul--iteFR, Vascul--itisDE, vascol--iteIT et vascul--itisES/EN. (3) La derni&#232;re observation qui 
sous-tend cette approche, peut-&#234;tre la plus importante, est l'exploitabilit&#233; des syst&#232;mes 
internationaux de classification (SNOMED, CIM-10, MesH), qui organisent la terminologie 
m&#233;dicale au moyen notamment de relations lexicales (synonymie, m&#233;ronymie, 
(co)hyponymie&#8230;). L'identit&#233; entre un EF et sa traduction rend transposables ces syst&#232;mes 
classificatoires pour l'organisation hi&#233;rarchique des EFs : de la m&#234;me fa&#231;on que estomac est 
une partie du ventre, tous deux &#233;tant d&#233;crits dans le chapitre anatomie, GASTR est une partie 
de ABDOMIN, les deux EFs se trouvant &#233;galement sous le descripteur anatomie. On &#233;tablit 
alors quatre types de relations lexicales entre les EFs : synonymie, not&#233;e = (OPT=OPHTALM, 
vision), hyponymie, not&#233;e &lt; (BLAST cellule embryonnaire &lt; CYT cellule), m&#233;ronymie, not&#233;e 
&#197; (CORO pupille &#197; OCUL &#339;il) et approximation, not&#233;e ~ (RHIN nez ~ OTO oreille). 
</p>
<p>3 D&#233;marche 
Rappelons que notre objectif est l'appariement multilingue de termes m&#233;dicaux compos&#233;s 
savants au moyen de relations lexicales calcul&#233;es au cours de l'analyse morphologique de ces 
termes. Notre approche s'articule autour de trois types de donn&#233;es et techniques, qui 
r&#233;pondent aux observations faites en &#167;2 : un ensemble r&#233;duit de r&#232;gles g&#233;n&#233;rales (&#167;3.3) 
inf&#232;rent des relations lexicales entre les mots compos&#233;s d'un corpus &#224; partir de relations de 
base &#233;tablies entre les EFs qui constituent ces termes, et r&#233;unies dans une table (&#167;3.2) ; enfin, 
l'identification de ces EFs requiert l'intervention d'un analyseur morphologique (&#167;3.1). 
</p>
<p>3.1 Analyseur Morphologique monolingue 
</p>
<p>Le processus de d&#233;composition d'un lex&#232;me complexe en constituants est une t&#226;che 
monolingue, d&#233;volue &#224; un analyseur morphologique qui peut fonctionner selon des approches 
diverses, allant de la simple segmentation (Lovis et al. 1995) &#224; l'application de contraintes 
permettant d'annoter les r&#233;sultats d'informations s&#233;mantiques (Namer 2003). Les r&#233;sultats des 
analyseurs bas&#233;s sur contraintes ont l'avantage d'associer &#224; une d&#233;composition hi&#233;rarchique la 
                                                 
4 Nos travaux suivent des hypoth&#232;ses li&#233;es &#224; une morphologie de type l&#233;x&#233;matique, o&#249; sens et structure se 
</p>
<p>calculent conjointement, et constituent une adaptation de la th&#233;orie &#233;labor&#233;e &#224; l'origine dans (Corbin 1987). 
5 Les EFs abstraits sont &#233;crits en petites majuscules, les fronti&#232;res entre EFs sont repr&#233;sent&#233;s par '--' 
</p>
<p>Morphos&#233;mantique pour l'appariement de termes dans le vocabulaire m&#233;dical</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#233;finition du mot analys&#233; en fonction du proc&#233;d&#233; morphologique identifi&#233;. Ainsi, le sens d'un 
lex&#232;me obtenu par affixation est calcul&#233; &#224; partir de celui de sa base, via la traduction de celle-
ci, lorsqu'elle est r&#233;alis&#233;e sous forme d'EF : h&#233;patiqueADJ = &quot;en relation avec le foie&quot;. Comme 
l'illustre la Fig.1, les EFs apparaissent tr&#232;s fr&#233;quemment dans la formation de termes suffix&#233;s, 
pr&#233;fix&#233;s ou compos&#233;s, toutes langues confondues. Contrairement &#224; l'affixation, la composition 
construit un nom ou un adjectif en associant deux constituants (chacun peut &#234;tre un lex&#232;me 
autonome ou un EF, et le cas &#233;ch&#233;ant, d'origine grecque ou latine). Dans les langues romanes, 
la composition savante (saxifrageA) se distingue de la composition dite populaire (casse-
pierreA) par la place occup&#233;e par le constituant t&#234;te (not&#233; X), plac&#233; &#224; droite du constituant 
modifieur, not&#233; Y. Le sens du compos&#233; est fonction, entre autres, de sa cat&#233;gorie et du rapport 
s&#233;mantique entre X et Y : le compos&#233; peut &#234;tre de type (a) additif (buccodentaireA caract&#233;rise 
ce &quot;qui concerne la bouche : bucc et les dents), (b) endocentrique (gastralgieN est hyponyme 
de douleur : algie, et affecte l'estomac : gastr) ou (c) exocentrique (brachyc&#233;phaleA n'est pas 
hyponyme de t&#234;te : c&#233;phal(e), mais d&#233;signe ce(lui) &quot;qui a une t&#234;te : c&#233;phal courte : brachy&quot;). 
</p>
<p>Lang. Affixation6 traduction EF abs. Composition   (type) traduction EFs abs 
IT 
FR 
EN 
DE 
ES 
</p>
<p>epat#ico 
bucc#al 
an#alges(ic) 
Hypo#thermie 
intra#cefal(ico) 
</p>
<p>h&#233;patique 
buccal 
analg&#233;sique 
hypothermie 
intrac&#233;phalique 
</p>
<p>HEPAT 
BUCC 
ALGES 
THERM 
CEPHAL 
</p>
<p>gastro--ectomia   (b) 
bucco--dent(aire) (a) 
thermo--algesia   (b) 
Thermo--taxis     (b) 
braqui--cefalo      (c) 
</p>
<p>gastrectomie 
buccodentaire 
thermoag&#233;sie 
thermotaxie 
brachyc&#233;phale 
</p>
<p>GASTR, ECTOMI 
BUCC 
THERM, ALGES 
THERM, TAXI 
BRACHY,CEPHAL
</p>
<p>Figure 1 : El&#233;ments de Formation et proc&#233;d&#233;s morphologiques 
</p>
<p>3.2 Table multilingue des El&#233;ments de Formation 
</p>
<p>EF 
 
</p>
<p> 
 
</p>
<p>Instanciation (2) CAT 
 
</p>
<p>Chapitre 
SNOMED 
</p>
<p>Relation  
lexicale 
</p>
<p>(1)  Anglais Allemand Fran&#231;ais7 Italien Espagnol (3) (4) (5) 
 
</p>
<p>GASTR 
 
</p>
<p>r&#233;al 
trad 
</p>
<p> 
gastr 
</p>
<p>stomach 
</p>
<p> 
Gastr 
</p>
<p>Magen 
</p>
<p> 
gastr 
</p>
<p>estomac 
</p>
<p> 
gastr 
</p>
<p>stomaco 
</p>
<p> 
gastr 
</p>
<p>estomago 
</p>
<p> 
N 
</p>
<p> 
ANATOMIE 
</p>
<p> 
</p>
<p>  =STOMAC,  
 &#8592;ABDOMIN,  
 ~HEPAT, ~ENTER , 
~PANCREAT 
</p>
<p>ALGI r&#233;al 
trad 
</p>
<p>algia/algy 
pain 
</p>
<p>algie 
Schmerz 
</p>
<p>algie 
douleur 
</p>
<p>algia 
dolore 
</p>
<p>algia 
dolor 
</p>
<p>N SYMPTOME   =ODYN, ~ITE 
</p>
<p>ITE r&#233;al 
trad 
</p>
<p>itis 
inflammation  
</p>
<p>ite 
Inflammation 
</p>
<p>ite 
inflammation  
</p>
<p>ite 
infiammazione
</p>
<p>itis 
inflamaci&#243;n  
</p>
<p>N SYMPTOME   ~ALGI, 
  ~ODYN 
</p>
<p>PHLEB r&#233;al 
trad 
</p>
<p>phleb 
vein 
</p>
<p>Phleb 
Vene 
</p>
<p>phl&#233;b 
veine 
</p>
<p>fleb 
vena 
</p>
<p>fleb 
vena 
</p>
<p>N ANATOMIE   =VEN, &lt;ANGI,  
   &lt;VASCUL 
</p>
<p>ANGI  r&#233;al 
trad 
</p>
<p>angio 
blood vessel  
</p>
<p>Angio 
Blutader 
</p>
<p>angio 
vaisseau 
sanguin 
</p>
<p>angio 
vaso 
</p>
<p>sanguigno 
</p>
<p>angio 
vaso 
</p>
<p>sangu&#237;neo 
</p>
<p>N ANATOMIE   =VASCUL,  
  ~VAS 
</p>
<p> 
ECTOMI
</p>
<p>r&#233;al 
trad 
</p>
<p>ectomy 
ablation 
</p>
<p>ektomie 
Ablation 
</p>
<p>ectomie 
ablation 
</p>
<p>ectomia 
ablazione 
</p>
<p>ectom&#237;a 
ablaci&#243;n 
</p>
<p>N ACTE 
MEDICAL 
</p>
<p>  ~TOMI,  
  ~STOMI 
</p>
<p>Figure 2 : Table multilingue des El&#233;ments de Formation (&#233;chantillon) 
</p>
<p>Les observations (2) et (3) du &#167;2 conduisent tout naturellement &#224; la conception d'une table 
r&#233;unissant l'ensemble des quelques 900 EFs utilis&#233;s dans le vocabulaire biom&#233;dical, et dont la 
Fig. 2 donne un &#233;chantillon. A chaque repr&#233;sentation abstraite d'un EF (col.1) correspondent 
</p>
<p>                                                 
6 Les fronti&#232;res base-affixe sont marqu&#233;es '#' 
7 Les r&#233;alisations indiqu&#233;es poss&#232;dent des variantes allomorphiques cod&#233;es &#233;galement dans la Table quand elles 
</p>
<p>refl&#232;tent des situations morphologiquement pertinentes. Ainsi, algo et alg&#233;s sont des variantes de algie ne 
pouvant occuper que la position Y dans un compos&#233;. 
</p>
<p>Fiammetta Namer</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>sa cat&#233;gorie grammaticale (col.3), la t&#234;te de chapitre SNOMED o&#249; il appara&#238;t (col.4), et les 
relations lexicales de base (col.5) dont les symboles sont expliqu&#233;s en &#167;2, et que l'EF abstrait 
entretient avec d'autres EFs abstraits pr&#233;sents dans la table. Par exemple, GASTR est synonyme 
de STOMAC, appartient &#224; ABDOMIN, et a &#224; voir avec HEPAT (foie), ENTER (intestin) et PANCREAT 
(pancr&#233;as). Enfin, la col.2 d&#233;crit les instances de l'EF pour chaque langue prise en compte : 
chaque instance couple la r&#233;alisation du symbole abstrait, avec sa traduction. Ainsi, ALGI est 
instanci&#233; par algia/algyEN : 'pain', algieDE : 'Schmerz', algieFR : 'douleur', algiaIT : 'dolore', 
algiaES : 'dolor'. L'ajout d'une nouvelle langue dans le syst&#232;me suppose donc uniquement 
l'insertion d'une nouvelle sous-colonne dans la col.2. 
</p>
<p>3.3 R&#232;gles ind&#233;pendantes de la langue pour le calcul des relations lexicales 
</p>
<p>La projection des relations lexicales entre EFs (Fig.2), sur les noms et adjectifs compos&#233;s dont 
l'analyse morphologique fait appara&#238;tre ces EFs, requiert l'activation de l'une des quatre r&#232;gles 
indiqu&#233;es dans la Fig. 3. Ces r&#232;gles sont totalement ind&#233;pendantes de la langue. Chacune est 
d&#233;crite formellement dans la col. 1, et exemplifi&#233;e dans les colonnes suivantes. La r&#232;gle R2, 
par exemple, &#233;tablit que tout couple de compos&#233;s A et B dont les constituants XA et XB sont 
synonymes, entretiennent la m&#234;me relation R que celle &#233;tablie entre YA et YB, sauf si R est la 
relation de m&#233;ronymie : si YA est une partie de YB en effet, A est hyponyme de B. A titre 
d'exemples, la synonymie entre MORT et THANAT (mort) se propage entre les adjectifs 
mortiferoIT et tanatogenoIT, la relation d'hyponymie entre apivoreFR et entomophageFR 
provient de celle entre API (abeille) et ENTOMO (insecte), alors que celle entre EnterodynieDE 
et AbdominalgieDE r&#233;sulte de la m&#233;ronymie entre ENTER (intestin) et ABDOMIN (abdomen). 
Enfin, l'approximation entre BACTERI et BACILL entra&#238;ne celle entre bacilliformEN et 
bacterioidEN. La r&#232;gle R4 est sym&#233;trique &#224; R2, en ce que YA et YB y sont synonymes, et la 
relation entre A et B d&#233;pend alors de celle qu'entretiennent XA et XB. Enfin R1 (resp. R3) est 
la version simplifi&#233;e de R2 (resp. R4), o&#249; A et B partagent le constituant X (resp. Y) 8. 
</p>
<p>Exemple R&#232;gle 
Y X [YAXA] R [YBXB] 
</p>
<p>R1        A = [YAX] et B=[YBX] 
Si  YA &#197; YB alors A &lt; B 
sinon si YA R YB et R est { =, &lt;, ~}  
          alors A R B 
</p>
<p>PROCTO &#197; COLO 
LEUCO &#197; HEMATO 
ABDOMIN=LAPAR 
</p>
<p>ALBUMIN&lt;PROTEIN 
XER ~SCLER 
</p>
<p>RRAGIE 
GRAMME 
SCOPIE 
</p>
<p>EMIE 
OPHTALMIE 
</p>
<p>EN: proctorrhagia &lt; colorrhagia 
DE: Leukogramm &lt; H&#228;matogramm 
FR: abdominoscopie = laparoscopie 
IT:  albuminemia &lt; proteinemia 
ES: xerophthalmia ~sclerophthalmia 
</p>
<p>R2     A = [YAXA] et B=[YBXB]  
         et XA = XB 
si  YA &#197; YB alors A &lt; B 
sinon si YA R YB et R est { =, &lt;, ~} 
         alors A R B 
</p>
<p> 
ENTER&#197;ABDOMIN 
MORT = THANAT 
API &lt; ENTOMO 
</p>
<p>BACILL ~BACTERI 
</p>
<p>XA = XB 
ALGIE = ODYNIE 
</p>
<p>FERE = GENE 
VORE = PHAGE 
FORME = O&#207;DE 
</p>
<p> 
DE: Enterodynie &lt; Abdominalgie 
IT:   mortifero = tanatogeno 
FR:  apivore &lt; entomophage 
EN: bacilliform ~bacterioid 
</p>
<p>R3       A = [YXA] et B=[YXB] 
Si XA R XB et R est {=, &lt;, ~} 
    alors A R B 
</p>
<p>BACTER 
OTO 
</p>
<p>ARTHR 
</p>
<p>O&#207;DE = FORME 
RRAGIE &lt; RRHEE 
</p>
<p>ALGIE ~ITE 
</p>
<p>FR:  bact&#233;rio&#239;de = bact&#233;riforme 
DE: Otorrhagie &lt; Otorrh&#246; 
ES: artralgia ~artritis 
</p>
<p>R4     A = [YAXA] et B=[YBXB] 
         et  YA = YB 
si XA R XB et R est {=, &lt;, ~} 
     alors A R B 
</p>
<p>YA = YB 
ORTHO = RECTI 
METR = HYSTER 
</p>
<p>LIP = ADIP 
</p>
<p> 
DONTE = DENT 
</p>
<p>RRAGIE &lt; RRHEE 
MATOSE ~OME 
</p>
<p> 
FR:  orthodonte = rectident 
FR:  m&#233;trorragie &lt; hyst&#233;rorr&#233;e 
EN: lipomatosis ~adipoma 
</p>
<p>Figure 3 : R&#232;gles de Calcul des Relations Lexicales 
</p>
<p>L'int&#233;raction entre un analyseur morpho-s&#233;mantique, la table multilingue des EFs et les r&#232;gles 
</p>
<p>                                                 
8 Une version monolingue des r&#232;gles et de la table des EF est pr&#233;sent&#233;e dans (Namer, Zweigenbaum 2004). 
</p>
<p>Morphos&#233;mantique pour l'appariement de termes dans le vocabulaire m&#233;dical</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de calcul des relations lexicales r&#233;sulte en une cha&#238;ne de traitement qui conduit &#224; 
l'appariement des mots compos&#233;s savants au moyen des relations lexicales de synonymie =, 
hyponymie &lt; et approximation ~. L'analyseur d&#233;compose le lex&#232;me d'entr&#233;e, en identifiant s'il 
y a lieu, les EFs qui le constituent9. Ces EFs servent &#224; alimenter le syst&#232;me des r&#232;gles de 
calcul des relations lexicales : pour chaque EF, rapport&#233; &#224; sa structure abstraite, l'ensemble 
des relations lexicales de base d&#233;finies dans la table est collect&#233;. Les r&#232;gles R1 &#224; R4 sont 
activ&#233;es, et pr&#233;disent toutes les relations potentielles abstraites avec l'input. La derni&#232;re t&#226;che 
&#224; effectuer consiste alors &#224; filtrer les relations correspondant &#224; des mots inexistants dans le 
corpus dans lequel les appariements sont calcul&#233;s. C'est cet encha&#238;nement, r&#233;alis&#233; en fran&#231;ais 
sur un lexique de grande taille, qui fait l'objet du prochain paragraphe. 
</p>
<p>4 R&#233;sultats pour le fran&#231;ais 
L'approche d&#233;crite ci-dessus a &#233;t&#233; impl&#233;ment&#233;e en fran&#231;ais. Les r&#233;sultats ont &#233;t&#233; obtenus &#224; 
partir d'un lexique totalisant 29000 noms, adjectifs et verbes du vocabulaire sp&#233;cialis&#233;, 
collect&#233;s &#224; partir de diverses sources, librement accessibles en ligne, ou mises &#224; la disposition 
des projets UMLF et VumeF 10. La r&#233;alisation de la cha&#238;ne de traitement en fran&#231;ais est 
rendue possible avant tout par l'existence de l'analyseur morpho-s&#233;mantique D&#233;riF 
(&quot;D&#233;rivation en fran&#231;ais&quot;). L'analyse par D&#233;riF d'un lex&#232;me cat&#233;goris&#233; adapte les hypoth&#232;ses 
th&#233;oriques avanc&#233;es &#224; l'origine dans (Corbin 1987). Bas&#233; sur l'application d'un syst&#232;me 
ordonn&#233; de r&#232;gles, le m&#233;canisme est r&#233;cursif et permet la gestion des ambigu&#239;t&#233;s, se 
r&#233;appliquant sur chaque (liste de) r&#233;sultat obtenu pr&#233;c&#233;demment. L'analyse morphologique 
d'un lex&#232;me construit sur une base elle-m&#234;me construite est donc est hi&#233;rarchis&#233;e. Le r&#233;sultat 
est un triplet, la premi&#232;re partie retrace sous forme crochet&#233;e l'historique des &#233;tapes d'analyse, 
la seconde r&#233;unit les lex&#232;mes r&#233;sultats obtenus &#224; chaque &#233;tape, et la troisi&#232;me est constitu&#233;e 
d'une formulation en langue naturelle de la relation morphologique liant l'input &#224; son (ses) 
constituant(s) imm&#233;diat(s). Les n&#233;ologismes sont analys&#233;s et pseudo-d&#233;finis comme des mots 
r&#233;guli&#232;rement construits (ce qui est g&#233;n&#233;ralement le cas). Quand il analyse un mot compos&#233;, 
enfin, D&#233;riF fournit une repr&#233;sentation lin&#233;aire Y/X de la d&#233;composition de celui-ci en 
constituants. Le fonctionnement ainsi r&#233;sum&#233; de D&#233;riF est illustr&#233; par l'analyse de 
gastralgieNOM, dans les 3 premi&#232;res lignes de la Fig.4. On note que la d&#233;finition calcul&#233;e pour 
gastralgie mobilise la table des EFs qui fournit la traduction, respectivement de gastr 
(estomac) et algie (douleur). Les repr&#233;sentations abstraites de Y et X ('Constituants', Fig.4, 
ligne 4) sont transmises au syst&#232;me de calcul des relations lexicales. Comme cela a &#233;t&#233; 
mentionn&#233; en &#167;3.3, les quatre r&#232;gles R1 &#224; R4 sont activ&#233;es pour produire les relations 
lexicales candidates de l'input (i.e. dans l'exemple, gastralgie). Tout d'abord, (R1) X est 
conserv&#233;, et Y est remplac&#233; par tous les EFs trouv&#233;s dans la table avec lesquels Y est en 
relation ; ceux-ci sont restitu&#233;s sous leur forme de r&#233;alisation en fran&#231;ais, et la relation 
potentielle est calcul&#233;e selon R1 (e.g. dans la Fig. 4 eql:stomach/algie11) ; ensuite, (R2), X 
est remplac&#233; par chacun de ses synonymes dans la Table des EFs, et l'op&#233;ration de 
substitution de Y est identique &#224; ce qui se passe avec R1 (e.g. isa:abdomin/odynie) ; puis 
les r&#244;les de Y et X sont invers&#233;s, lors de l'activation de R3 (e.g. see:gastr/ite) et de R4 
(e.g. see:stomach/ite). 
</p>
<p>                                                 
9 Selon le type d'analyseur, l'analyse morphologique de l'input fournit &#233;ventuellement aussi une pseudo-
</p>
<p>d&#233;finition, sous-forme de relation entre l'input et ses composants. 
10 Pour ne mentionner que quelques sources : les versions fran&#231;aises de la CIM-10, du MesH et le dictionnaire en 
</p>
<p>ligne BIOTOP (URL : http://georges.dolisi.free.fr/Terminologie/Menu/terminologie__medicale_menu.htm) 
11 L'affichage par D&#233;riF des relations lexicales possibles est de la forme 'R:Y/X'; R symbolise la synonymie = 
</p>
<p>par 'eql', l'hyponymie &lt; par 'isa' et l'approximation ~ par 'see'.  
</p>
<p>Fiammetta Namer</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>gastralgie/NOM==&gt; [ [ gastr N* ] [ algie N* ]  NOM ] 
(gastralgie/NOM, algie/N*) 
&quot; douleur (du -- li&#233;e au) estomac &quot; 
</p>
<p>Constituants = /gastr/algie/ 
Type = maladie 
Relations possibles = (eql:gastr/algo, eql:gastr/alg&#233;s, eql:gastr/odyn, 
eql:stomac/algie, eql:stomac/algo, eql:stomac/alg&#233;s, eql:stomac/odyn, 
eql:stomach/algie, eql:stomach/algo, eql:stomach/alg&#233;s, eql:stomach/odyn, 
isa:abdomin/algie, isa:abdomin/algo, isa:abdomin/alg&#233;s, isa:abdomin/odyn, 
see:ent&#233;ro/algie, see:ent&#233;ro/algo, see:ent&#233;ro/alg&#233;s, see:ent&#233;ro/odyn, 
see:gastr/ite, see:h&#233;pat/algie, see:h&#233;pat/algo, see:h&#233;pat/alg&#233;s, 
see:h&#233;pat/odyn, see:pancr&#233;at/algie, see:pancr&#233;at/algo, see:pancr&#233;at/alg&#233;s, 
see:pancr&#233;at/odyn, see:stomac/ite, see:stomach/ite) 
</p>
<p>Figure 4 : Relations lexicales candidates pour gastralgieNOM 
</p>
<p>A partir de cet ensemble de relations candidates, le syst&#232;me ne garde que les relations 
concernant les termes attest&#233;s. Pour gastralgie, et &#233;tant donn&#233; le contenu du lexique de 29000 
entr&#233;es du fran&#231;ais, on s'attend &#224; ce que seuls les &#233;l&#233;ments soulign&#233;s correspondent &#224; des 
lex&#232;mes &quot;r&#233;els&quot;. Les autres sont soient morphologiquement impossibles (gastr/alg&#233;s, par 
exemple ne peut pas se r&#233;aliser, car alg&#233;s est une forme que l'on ne trouve qu'en position Y), 
soit non attest&#233;s (dans le corpus du moins) : c'est par exemple le cas de pancr&#233;at/odyn, car 
pancr&#233;atodynie n'est pas dans notre lexique. Etant donn&#233; un compos&#233; A (ex. gastralgie) 
l'identification de ses relations lexicales 'r&#233;elles' s'effectue au moyen du couple Y/X, calcul&#233; 
par D&#233;riF pour chaque entr&#233;e B du lexique et consign&#233; en valeur du trait 'Constituants'. Quand 
pour un input B donn&#233;, Y/X s'identifie &#224; l'un des candidats de la listes des relations possibles 
de A, B est ajout&#233; &#224; la liste des relations attest&#233;es de A. A la fin de cette &#233;tape, chaque input A 
du lexique de travail se voit associ&#233; sa famille lexicale, regroupant l'ensemble des compos&#233;s 
du corpus avec lesquels A entretient l'une des relations de synonymie, hyponymie et 
approximation. La Fig. 5 reproduit la famille lexicale de gastralgie.12 
</p>
<p> 
</p>
<p>Figure 5 : Famille lexicale de gastralgie 
</p>
<p>Les modules d'analyse de D&#233;riF impl&#233;mentent &#224; ce jour divers proc&#233;d&#233;s morphologiques, que 
ce soit la suffixation, la pr&#233;fixation, la conversion ou la composition savante. D&#233;riF est 
actuellement &#224; m&#234;me d'analyser comme complexes 17240 des 29000 lex&#232;mes du corpus de 
travail13. La cha&#238;ne de traitement enfin produit plus de 3000 familles lexicales &#224; partir des 
lex&#232;mes compos&#233;s du corpus, g&#233;n&#233;rant au total des liens entre 7438 ADJs et/ou NOMs distincts. 
</p>
<p>5 Discussion, perspectives 
L'utilisation de la morphologie des mots compos&#233;s dans le but d'optimiser la recherche 
d'information en biom&#233;decine a d&#233;j&#224; fait l'objet d'exp&#233;rimentations, entre autre par (Schulz et 
                                                 
12 D'autres termes sont ajout&#233;s &#224; la famille suivant des cri&#232;res morphologiques. Notamment, un adjectif 
</p>
<p>relationnel (e.g. gastralgique) est consid&#233;r&#233; comme 'synonyme' de son nom base. 
13 Les lex&#232;mes complexes non analys&#233;s sont ceux form&#233;s suivant des patrons constructionnels non encore 
</p>
<p>(compl&#232;tement) int&#233;gr&#233;s dans D&#233;riF. 
</p>
<p>Morphos&#233;mantique pour l'appariement de termes dans le vocabulaire m&#233;dical</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>al. 1999), et (Hahn et al. 2001), qui se servent &#233;galement d'EFs (qu'ils appellent 'subwords'). 
Cependant, contrairement &#224; ce qui est pr&#233;sent&#233; ici, ils n'exploitent pas les relations lexicales 
entre les EFs (donc ne calculent pas de relations lexicales), et leur analyse morphologique est 
r&#233;duite &#224; un simple d&#233;coupage lin&#233;aire, qui ne permet pas d'associer une d&#233;finition &#224; l'input. 
En contrepartie, bien entendu, notre approche pr&#233;sente un inconv&#233;nient majeur, qui est celui 
de tout syst&#232;me bas&#233; sur l'utilisation de contraintes linguistiques, et demandant la gestion des 
exceptions. Il n&#233;cessite une validation humaine &#224; trois niveaux au moins : pour v&#233;rifier la 
pertinence des analyses, pour valider les pseudo-d&#233;finitions et surtout pour contr&#244;ler les 
relations lexicales de base dans la table des EFs. Notamment, il faut &#233;viter des annotations 
trop sp&#233;cifiques sur des EFs polyr&#233;f&#233;rentielles en m&#233;decine. Ainsi, &#233;tiqueter LABI (l&#232;vre) 
comme partie-de BUCC (bouche) entra&#238;nerait un codage pour le moins curieux d'adjectifs 
comme inguino-labial, relatif &#224; la gyn&#233;cologie.14  
</p>
<p>Les am&#233;liorations prioritaires de la d&#233;marche pr&#233;sent&#233;e (en dehors de l'&#233;volution de D&#233;riF, qui 
ne concerne que le fran&#231;ais) passent tout d'abord par l'ajout de nouvelles r&#232;gles de calcul des 
relations lexicales, qui s'appliquent aux termes pr&#233;fix&#233;s et/ou suffix&#233;s. Elles permettront par 
exemple d'identifier gastrique comme une propri&#233;t&#233; synonyme de stomacal, et hyponyme 
d'abdominal. Dans la table des EFs, certaines relations d'approximation pourraient se 
sp&#233;cialiser. Certains EFs constituent en effet des p&#244;les oppos&#233;s d'une m&#234;me propri&#233;t&#233; : e.g. 
BRACHY court, versus DOLICHO long. Enfin, mais cela conduira &#224; ajouter un nouveau module 
monolingue au syst&#232;me, on pourrait g&#233;n&#233;rer automatiquement (dans la langue de son choix) 
les termes correspondant aux relations lexicales possibles d'un terme A, absents du corpus de 
travail et morphologiquement plausibles: pour le fran&#231;ais, cela reviendrait, par exemple (Fig. 
4), &#224; g&#233;n&#233;rer abdominodynie, pancr&#233;atodynie, stomac(h)ite qui sont non seulement absents du 
corpus de travail mais aussi introuvables sur Internet.  
</p>
<p> 
</p>
<p>Figure 5 : Une Famille Lexicale Abstraite: celle de GASTRALGI 
</p>
<p>La r&#233;alisation dans d'autres langues que le fran&#231;ais15 de l'approche pr&#233;sent&#233;e ne n&#233;cessite 
pratiquement que de disposer d'un parseur morphologique pour chaque nouvelle langue. En 
un premier temps, celui-ci peut &#234;tre extr&#234;mement rudimentaire (e.g. un simple raciniseur) 
                                                 
14 Plus g&#233;n&#233;ralement, les EFs ambigus n&#233;cessitent un traitement par D&#233;riF qui exploite des listes d'exception : 
</p>
<p>e.g. p&#233;d signifie pied (p&#233;dologue, p&#233;dicure, p&#233;destre) ou enfant (p&#233;dagogue, p&#233;dophile, p&#233;diatre). 
15 L'&#233;bauche de ce travail d'extension est actuellement en cours pour l'anglais.  
</p>
<p>Fiammetta Namer</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>dans la mesure o&#249; sa t&#226;che fondamentale est d'identifier les composants X et Y d'un compos&#233; 
savant. Une fois cet analyseur disponible e.g. pour les cinq langues qui nous ont servi &#224; 
illustrer notre d&#233;marche, la cha&#238;ne de traitement (&#224; l'exception de l'analyseur) ne manipule 
plus que des donn&#233;es abstraites. On obtient alors un ensemble de familles lexicales abstraites 
&#224; l'image de ce qu'illustre la Fig. 5. Dans chacune d'elles, les noms partageant la m&#234;me 
structure et les m&#234;mes composants dans diff&#233;rentes langues sont identifi&#233;s par une &#233;tiquette 
abstraite ; ce sont ces &#233;tiquettes qui sont alors reli&#233;es entre elles par les relations lexicales 
selon le m&#234;me m&#233;canisme que celui que nous avons d&#233;crit pour le fran&#231;ais au &#167;4. 
</p>
<p>6 Conclusion 
Nous avons d&#233;crit une m&#233;thode permettant de regrouper les noms et adjectifs compos&#233;s 
savants du langage biom&#233;dical selon des liens s&#233;mantico-lexicaux, gr&#226;ce &#224; une classification 
multilingue de base (la table des EFs) &#233;tablie &#224; partir des terminologies internationales du 
domaine m&#233;dical. Quelques r&#232;gles ind&#233;pendantes de la langue servent &#224; propager ces relations 
de base sur les compos&#233;s qui contiennent ces EFs, pour calculer les relations lexicales 
qu'entretiennent les compos&#233;s entre eux. Les r&#233;sultats obtenus en fran&#231;ais sont utilis&#233;s pour 
&#233;tendre le syst&#232;me d'extraction de variantes terminologiques &#224; de nouveaux liens simples : 
maladie du foie / maladie h&#233;patique mais aussi plus complexes : traitement contre la douleur 
&#224; l'estomac / traitement antigastralgique. Nous testons &#233;galement la r&#233;utilisabilit&#233; des r&#232;gles 
de calcul des relations lexicales pour &#233;tablir des liens de synonymie, hyponymie et 
approximation entre les termes polylex&#233;matiques. L'id&#233;e est de v&#233;rifier la validit&#233; des 
appariements du type : douleur &#224; l'estomac &lt; douleur au ventre. On pourrait &#233;galement 
envisager une utilisation en analyse du discours des relations d'hyponymie (abdominalgie &lt; 
douleur) pour la recherche des liens anaphoriques16.  
</p>
<p>Les applications multilingues de la d&#233;marche pr&#233;sent&#233;e (selon Fig. 5) sont pour la plupart 
imm&#233;diatement concevables : question-r&#233;ponse multilingue, recherche d'information, 
enrichissement de bases de connaissances translinguistiques&#8230; Une autre utilisation est la 
traduction par voisinage, qu'illustre la Fig.5. Chaque &#233;tiquette abstraite y regroupe les noms 
qui ont &#233;t&#233; effectivement rencontr&#233;s dans les corpus sp&#233;cialis&#233;s de chaque langue. On note, &#224; 
ce sujet, que abdominodyniaEN tout comme stomachodynieFR sont des structures qui ne se 
rencontrent que dans une langue. Cependant, leur traduction est calculable imm&#233;diatement via 
le lien de synonymie qui part de leur &#233;tiquette abstraite ; les traductions indirectes de e.g. 
stomachodynieFR sont donc : stomacalgiaIT, GastrodynieDE, gastrodin&#236;aES, gastrodyniaEN. 
Enfin, on voit comment les relations d'hyponymie peuvent &#234;tre exploit&#233;es de mani&#232;re 
similaire, pour concevoir des classes lexicales translinguistiques. 
</p>
<p>R&#233;f&#233;rences 
BOURIGAULT, D., JACQUEMIN, C., et al. 2001. Recent Advances in Computational Terminologies. 
Amsterdam/Philadelphia: John Benjamins. 
</p>
<p>CHIAO, Y-C., ZWEIGENBAUM, P. 2003. The effect of a general lexicon in corpus-based identification 
of French-English medical word translations. Actes MIE, Amsterdam:. 
</p>
<p>CORBIN, D. 1987. Morphologie d&#233;rivationnelle et structuration du lexique. Lille: PUL. 
</p>
<p>                                                 
16 Merci au relecteur anonyme pour cette suggestion. 
</p>
<p>Morphos&#233;mantique pour l'appariement de termes dans le vocabulaire m&#233;dical</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DAILLE, B. 2001. L'identification en corpus d'adjectifs relationnels: une piste linguistique pour 
l'extraction automatique de terminologie. In T.A.L, 42/3, Paris, Herm&#232;s:815-832. 
</p>
<p>DARMONI, S. J., JARROUSSE, E., et al. 2003. VumeF: Extending the French part of the UMLS. 
Proceedings of the AMIA Symposium, Washington, DC:824 
</p>
<p>FRADIN, B. 2000. Combining forms, blends and related phenomena. In Extragrammatical and 
Marginal Morphology, M&#252;nchen: Lincom Europa: 11-59 
</p>
<p>GAUSSIER, E. 2001. General Considerations on Bilingual Terminology Extraction. In Recent Advances 
in Computational Terminology. Amsterdam/Philadelphia: John Benjamins: 167-184 
</p>
<p>GRABAR, N., ZWEIGENBAUM, P. 2000. A general method for sifting linguistic knowledge from 
structured terminologies. Journal of AMIA 7(suppl):310-314. 
</p>
<p>HAHN, U., HONECK, M., et al. 2001. Subword segmentation: Leveling out morphological variations 
for medical document retrieval. Journal of AMIA 8(suppl):229-233. 
</p>
<p>HASPELMATH, M. 2002. Understanding Morphology. London: Arnold. 
</p>
<p>HATHOUT, N. 2003. L'analogie, un moyen de croiser les contraintes et les paradigmes. Acquisition de 
connaissances &#224; partir de dictionnaires de synonymes, RIA. 17(5-6),:923-934.  
</p>
<p>IACOBINI, C. 2003. Composizione con elementi neoclassici. In La formazione delle parole in italiano, 
T&#252;bingen: Niemeyer: 69-96  
</p>
<p>JACQUEMIN, C., TZOUKERMANN, E. 1999. NLP for term variant extraction: A synergy of morphology, 
lexicon, and syntax. In NLP and Information Retrieval, Boston, Kluwer: 25-74.  
</p>
<p>LOVIS, C., MICHEL, P.A., et al. 1995. Word segmentation processing: a way to exponentially extend 
medical dictionaries. 8th World Congress on Medical Informatics: 28-32.  
</p>
<p>LOVIS, C., BAUD, R., et al. 1998. Medical dictionaries for patient encoding systems: a methodology. 
Artificial Intelligence in Medecine 14:201-214.  
</p>
<p>NAMER, F. 2003. Automatiser l'analyse morpho-s&#233;mantique non affixale: le syst&#232;me D&#233;riF. In Cahiers 
de Grammaire. Toulouse: ERSS: 31-48.  
</p>
<p>NAMER, F., ZWEIGENBAUM P., 2004 Acquiring meaning for French Medical Terminology: 
contribution of Morphosemantics. in 11th MEDINFO. 2004. San Francisco, CA:535-539. 
</p>
<p>SCHULZ, S., ROMACKER, M., et al. 1999. Towards a multilingual morpheme thesaurus for medical 
free-text retrieval. Proceedings of MIE, Ljubliana, Slovenia: 891-894. 
</p>
<p>TRAN, T-D., BURGUN, A., et al. 2003. Acquisition semi-automatique de terminologie bilingue en 
biologie mol&#233;culaire &#224; partir des corpus comparables. TIA, Strasbourg: 166-175 
</p>
<p>WARREN, B. 1990. The importance of combining forms. In Contemporary Morphology, Berlin, New 
York: Mouton - Walter de Gruyter: 111-132. 
</p>
<p>ZWEIGENBAUM, P., BAUD, R., et al.. 2003. Towards a unified medical lexicon for French. In Actes 
MIE, Amsterdam: IOS Press: 415-420. 
</p>
<p>Fiammetta Namer</p>

</div></div>
</body></html>