<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Que : la valse des &#233;tiquettes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Que : la valse des &#233;tiquettes 
</p>
<p>Marie-Paule Jacques 
</p>
<p>ERSS &#8211; Universit&#233; Toulouse II le Mirail 
5, all&#233;es Antonio Machado 31058 Toulouse Cedex 9 
</p>
<p>mpjacques@univ-tlse2.fr 
</p>
<p>Mots-cl&#233;s : Analyse syntaxique automatique, &#233;tiquetage morphosyntaxique 
Keywords: Automatic parsing, tagging 
</p>
<p>R&#233;sum&#233; Nous pr&#233;sentons ici une strat&#233;gie d&#8217;&#233;tiquetage et d&#8217;analyse syntaxique de que. Cette 
forme est en effet susceptible d&#8217;appartenir &#224; trois cat&#233;gories diff&#233;rentes et d&#8217;avoir de multiples 
emplois pour chacune de ces cat&#233;gories. Notre objectif est aussi bien d&#8217;en assurer un &#233;tiquetage 
correct que d&#8217;annoter les relations de d&#233;pendance que que entretient avec les autres mots de la 
phrase. Les deux &#233;tapes de l&#8217;analyse mobilisent des ressources diff&#233;rentes. 
</p>
<p>Abstract In this paper I present a method for tagging and parsing the grammatical word que. 
This word is particularly difficult to tag because it may belong to three different categories and 
may give rise to many constructions for each category. My aim is to assign the correct tag and to 
annotate dependency relations between que and the other words of the sentence. 
</p>
<p>1 Introduction 
Le mot que est de ces formes redoutables pour le TAL fran&#231;ais. Non seulement peut-il recevoir 
plusieurs &#233;tiquettes diff&#233;rentes selon ses emplois (voir section 2.1), mais encore entre-t-il dans 
quantit&#233; de constructions syntaxiques diff&#233;rentes, qui correspondent &#224; autant de valeurs 
s&#233;mantiques et d&#8217;instaurations de d&#233;pendances diff&#233;rentes entre les &#233;l&#233;ments de la phrase. Or, il 
est bien souvent n&#233;cessaire de r&#233;soudre les questions pos&#233;es par la pr&#233;sence d&#8217;un que dans une 
phrase pour proposer une analyse syntaxique satisfaisante de celle-ci. 
</p>
<p>Notre &#233;tude poursuit deux objectifs : i. assigner une &#233;tiquette morphosyntaxique correcte &#224; que ; 
ii. annoter les relations syntaxiques qu&#8217;il entretient avec d&#8217;autres &#233;l&#233;ments de la phrase. Notre 
propos n&#8217;est pas de discuter les avantages de telle ou telle proc&#233;dure d&#8217;&#233;tiquetage 
morphosyntaxique, par r&#232;gles ou probabiliste (pour un tour d&#8217;horizon, Abney, 1996 ; Garside et 
al., 1997 ; Habert et al., 1997), mais de tester une m&#233;thode d&#8217;analyse qui &#233;tablit l&#8217;&#233;tiquetage 
d&#233;finitif par l&#8217;analyse syntaxique. Alors que bien souvent ces deux t&#226;ches se succ&#232;dent &#8211; 
&#233;tiquetage puis analyse syntaxique appuy&#233;e sur les r&#233;sultats du tagger &#8211;, nous proc&#233;dons &#224; un 
&#233;tiquetage d&#233;finitif de que en fonction de l&#8217;identification de constructions syntaxiques </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Paule Jacques 
</p>
<p>caract&#233;ristiques de telle ou telle cat&#233;gorie. Pour tracer un panorama des difficult&#233;s d&#8217;analyse, un 
tour d&#8217;horizon des diverses valeurs et constructions possibles de que s&#8217;impose. 
</p>
<p>2 Polycat&#233;gorie et polyfonctionnalit&#233; syntaxique 
Dans le Tr&#233;sor de la Langue Fran&#231;aise informatis&#233; (TLFi), la description de que couvre 14 
pages format A4, c&#8217;est dire la vari&#233;t&#233; de ses emplois. Selon les cas, il peut s&#8217;agir d&#8217;un adverbe, 
d&#8217;un pronom ou d&#8217;une conjonction de subordination. 
</p>
<p>2.1 Les diverses cat&#233;gories de que 
</p>
<p>&#8226; que adverbe 
Que se voit classer comme adverbe dans les phrases exclamatives du type : 
</p>
<p>Que cela nous semble alors loin ! 
</p>
<p>En fonction des auteurs, dictionnaires et autres ouvrages de grammaire, il y a d&#233;saccord sur la 
valeur de que dans une construction telle que : 
</p>
<p>Les geysers n&#8217;entrent en activit&#233; que la nuit et au petit matin. 
</p>
<p>Dans cette structure de n&#233;gation exceptive ne V que, que est consid&#233;r&#233; soit comme adverbe, soit 
comme une conjonction de subordination. Nous avons choisi la premi&#232;re solution, que adverbe, 
qui pr&#233;sente l&#8217;avantage d&#8217;une coh&#233;rence d&#8217;ensemble des constructions impliquant le premier 
morph&#232;me de n&#233;gation ne : tous les &#233;l&#233;ments qui participent &#224; la n&#233;gation quels qu&#8217;ils soient 
sont &#233;tiquet&#233;s adverbe1. Ainsi, que entre dans un paradigme de formes pouvant co-occurrer avec 
ne pour former tous types de n&#233;gations. 
</p>
<p>&#8226; que pronom relatif 
Comme tous les pronoms relatifs, que est susceptible d&#8217;introduire une subordonn&#233;e dans 
laquelle il a une fonction syntaxique, g&#233;n&#233;ralement celle d&#8217;objet direct : 
</p>
<p>Le volcan est connu pour les risques qu&#8217;il constitue pour les populations avoisinantes. 
</p>
<p>Dans certaines constructions cliv&#233;es, que est ce qu&#8217;on appelle un relatif sans ant&#233;c&#233;dent : 
</p>
<p>C&#8217;est dans les Andes que l&#8217;on trouve les plus hauts volcans du monde. 
</p>
<p>Les cliv&#233;es dans lesquelles c&#8217;est l&#8217;objet du verbe de la subordonn&#233;e qui est extrait &#8211; par exemple 
c&#8217;est le chocolat que j&#8217;aime &#8211; se ram&#232;nent au cas de figure &#233;voqu&#233; pr&#233;c&#233;demment. 
</p>
<p>                                                 
1  Un autre motif de ce choix tient au fait que, dans le corpus CRATER (cf. 3.1) qui nous sert d&#8217;&#233;talon pour la 
</p>
<p>mesure des performances de notre module d&#8217;analyse, que est &#233;tiquet&#233; adverbe pour la n&#233;gation exceptive. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Que : la valse des &#233;tiquettes 
</p>
<p>&#8226; que conjonction de subordination 
C&#8217;est en tant que conjonction de subordination que que manifeste la plus grande vari&#233;t&#233; 
d&#8217;emplois. La place nous manque pour &#234;tre absolument exhaustive, nous indiquons ici les 
constructions les plus typiques des textes sur lesquels nous avons bas&#233; notre inventaire2. 
</p>
<p>Dans une part massive de ses emplois, que introduit une compl&#233;tive, c&#8217;est-&#224;-dire soit l&#8217;objet 
direct d&#8217;un verbe, soit le compl&#233;ment d&#8217;un nom ou encore le compl&#233;ment d&#8217;un adjectif : 
</p>
<p>Tout le monde est d' accord pour penser que le gaz toxique est venu du fond du lac. 
</p>
<p>Les raisons invoqu&#233;es proviennent du fait que la m&#233;decine n&#8217;est pas une science exacte. 
</p>
<p>Il est rare qu&#8217;un s&#233;isme provoque directement une activit&#233; volcanique. 
</p>
<p>Tout en continuant &#224; &#234;tre cat&#233;goris&#233; comme conjonction par l&#8217;ensemble des grammaires et 
dictionnaires, que entre dans quantit&#233; de structures que, par commodit&#233;, nous regroupons sous 
l&#8217;appellation de corr&#233;latives. Dans celles-ci, que n&#8217;introduit pas n&#233;cessairement une phrase 
subordonn&#233;e, ce qui a pu donner lieu &#224; une analyse en terme d&#8217;ellipse (Riegel et al., 1994)3. 
Nous pouvons remarquer que, dans ces emplois, que fonctionne n&#233;cessairement avec un autre 
&#233;l&#233;ment, un &#233;l&#233;ment &#171; d&#233;clencheur &#187; situ&#233; avant lui dans la phrase, pour assurer une mise en 
relation de deux constituants : celui qui est contigu &#224; (ou qui contient) l&#8217;&#233;l&#233;ment d&#233;clencheur, 
celui qui est introduit par que. Ces structures corr&#233;latives se caract&#233;risent donc par la pr&#233;sence 
d&#8217;un couple de marqueurs tant&#244;t contigus, tant&#244;t discontinus, comme par exemple plus/moins&#8230; 
que, d&#8217;autant plus/d&#8217;autant moins&#8230; que, aussi&#8230; que, tel&#8230; que, autre/m&#234;me&#8230; que, 
tant/autant/aussi bien&#8230; que, etc. : 
</p>
<p>Aucun ph&#233;nom&#232;ne n&#8217;a donn&#233; naissance &#224; autant de mythes, de symboles, de l&#233;gendes, de 
rites ou de superstitions que le 'feu de la terre'. 
</p>
<p>2.2 Difficult&#233;s pour l&#8217;analyse 
</p>
<p>Les difficult&#233;s essentielles &#224; surmonter viennent de ce que des constructions analogues sur le 
plan de la forme ne le sont cependant pas sur la valeur de que. Par exemple, nous n&#8217;insisterons 
pas sur la difficult&#233;, bien connue, de distinguer de fa&#231;on automatique la valeur de pronom relatif 
de celle de conjonction de subordination : 
</p>
<p>On appelle comp&#233;tence du courant la possibilit&#233; qu&#8217;il a de transporter des mat&#233;riaux. 
</p>
<p>J. et M. semblent exclure la possibilit&#233; que des opportunit&#233;s demeurent non per&#231;ues. 
</p>
<p>De la m&#234;me mani&#232;re, la valeur d&#8217;adverbe ne se laisse pas simplement cerner par la pr&#233;sence de 
ne devant le verbe : 
</p>
<p>                                                 
2  Nous laissons de c&#244;t&#233; diverses collocations qui peuvent sans ambigu&#239;t&#233; &#234;tre &#233;tiquet&#233;es &#8216;conjonction de 
</p>
<p>subordination&#8217;, comme &#224; condition que, afin que, de sorte que, parce que, etc. 
</p>
<p>3  Nous n&#8217;avons pas ici la place de discuter du bien-fond&#233; de cette analyse. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Paule Jacques 
</p>
<p>Cependant on n'est plus persuad&#233; que cette action rasante soit enti&#232;rement responsable des 
formes de champignons constat&#233;es dans les d&#233;serts 
</p>
<p>Contrairement &#224; ce que l&#8217;on pourrait penser, ce n&#8217;est pas seulement le morph&#232;me plus qui fait 
que l&#8217;on n&#8217;a pas de n&#233;gation exceptive, comme on le voit dans la phrase suivante : 
</p>
<p>Le volcan n&#8217;&#233;met plus, par de nombreux points du crat&#232;re, que de la vapeur d&#8217;eau 
surchauff&#233;e 
</p>
<p>Autre exemple, la pr&#233;sence d&#8217;un marqueur lexical caract&#233;ristique d&#8217;une corr&#233;lative n&#8217;est pas un 
gage d&#8217;identification certaine de la valeur de que, comme le montrent les deux extraits suivants, 
dans lesquels, au sein d&#8217;une m&#234;me construction plus/moins difficile &#224; Vinf que&#8230;, que assume 
une fonction d&#8217;op&#233;rateur de comparaison aussi bien que d&#8217;objet direct du verbe : 
</p>
<p>Une solution fran&#231;aise semble dans ce cas plus difficile &#224; envisager qu&#8217;une reprise par un 
groupe &#233;tranger. 
</p>
<p>Il n&#8217;en reste pas moins difficile &#224; expliquer que les cr&#234;tes et sillons pr&#233;littoraux ne soient 
pas toujours parall&#232;les &#224; la c&#244;te. 
</p>
<p>Face &#224; la diversit&#233; des constructions et des &#233;l&#233;ments &#224; prendre en compte pour les identifier, 
nous avons test&#233; une strat&#233;gie qui intervient &#224; deux moments de l&#8217;analyse syntaxique et mobilise 
des informations diff&#233;rentes dans chacun de ces deux moments. Nous indiquons maintenant le 
cadre de notre exp&#233;rimentation, la teneur de la m&#233;thode et les r&#233;sultats obtenus. 
</p>
<p>3 L&#8217;analyse de que : cadre, m&#233;thode et r&#233;sultat 
</p>
<p>3.1 Cadre de l&#8217;exp&#233;rimentation 
</p>
<p>L&#8217;exp&#233;rimentation que nous d&#233;crivons prend place dans une analyse syntaxique de type 
modulaire, celle mise en &#339;uvre par Syntex (voir ici m&#234;me Bourigault, Fr&#233;rot, 2005). A partir 
d&#8217;un texte &#233;tiquet&#233; par TreeTagger (Schmid, 1994), divers modules se succ&#232;dent, chacun 
effectuant une partie de l&#8217;analyse syntaxique, ce qui autorise les modules les plus tardifs &#224; 
utiliser les relations pos&#233;es par les modules pr&#233;c&#233;dents pour leur propre analyse. 
</p>
<p>Syntex fournit une annotation de relations de d&#233;pendance entre mots. Par exemple, d&#8217;un nom 
pourront d&#233;pendre un d&#233;terminant, un ou plusieurs adjectifs, une ou plusieurs pr&#233;positions&#8230; ; 
d&#8217;une pr&#233;position pourront d&#233;pendre un nom ou un verbe ; d&#8217;un verbe pourront d&#233;pendre un 
nom et/ou un pronom en fonction sujet, idem en fonction objet, une ou plusieurs pr&#233;positions, 
etc. Chaque mot de la phrase est donc susceptible d&#8217;entrer dans deux types de d&#233;pendances &#8211; 
&#234;tre r&#233;gi par un autre mot, &#234;tre recteur d&#8217;un autre mot &#8211;, mais qui ne sont pas toutes deux 
obligatoires : par exemple, le verbe d&#8217;une principale n&#8217;est pas r&#233;gi. 
</p>
<p>Pour ce qui concerne que, TreeTagger lui attribue l&#8217;une des trois &#233;tiquettes &#8216;Pronom relatif&#8217;, 
&#8216;Adverbe&#8217; ou &#8216;Conjonction de subordination&#8217;. Notre analyse a pour objet : i. de revenir sur cet 
&#233;tiquetage pour &#233;ventuellement le rectifier, ii. de relier que aux &#233;l&#233;ments convenables dans les 
deux directions, c&#8217;est-&#224;-dire vers un recteur et vers un r&#233;gi (par exemple, le verbe de la 
subordonn&#233;e), et ce par la relation idoine. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Que : la valse des &#233;tiquettes 
</p>
<p>Afin de d&#233;terminer les indices sur lesquels appuyer l&#8217;analyse et d&#8217;avoir un aper&#231;u r&#233;aliste de la 
diversit&#233; des constructions, nous avons constitu&#233; un corpus d&#8217;&#233;tude en rassemblant, de fa&#231;on 
opportuniste, la plus grande vari&#233;t&#233; de textes dont nous pouvions disposer sous format 
&#233;lectronique : articles du journal Le Monde, articles scientifiques du domaine de l&#8217;ing&#233;nierie des 
connaissances, recettes de cuisine, documents professionnels, textes litt&#233;raires, textes sp&#233;cialis&#233;s 
de domaines aussi divers que la volcanologie, la g&#233;omorphologie, la m&#233;decine, le vol libre. Il 
s&#8217;agissait pour nous de ne pas nous cantonner &#224; un seul genre, sans toutefois pr&#233;tendre couvrir 
tous les genres possibles. Nous pensons tout de m&#234;me avoir de cette mani&#232;re recueilli une bonne 
gamme des possibilit&#233;s d&#8217;emploi de que. 
</p>
<p>L&#8217;&#233;valuation n&#8217;a pas &#233;t&#233; men&#233;e sur ce corpus, mais sur un corpus de test extrait de la partie 
fran&#231;aise du corpus CRATER4. Celui-ci offre l&#8217;int&#233;r&#234;t d&#8217;un &#233;tiquetage morphosyntaxique &#8211; 
relativement &#8211; fiable parce que v&#233;rifi&#233; par des annotateurs humains. Il constitue donc un banc 
d&#8217;essai id&#233;al pour mesurer l&#8217;efficacit&#233; de notre analyse sur l&#8217;&#233;tiquetage. Nous avons extrait de ce 
corpus toutes les phrases contenant la forme que, puis nous avons annot&#233; manuellement les 1100 
premi&#232;res pour les relations de d&#233;pendance. 
</p>
<p>3.2 M&#233;thode d&#8217;analyse 
</p>
<p>L&#8217;analyse de que se fait en deux &#233;tapes principales intervenant &#224; des moments diff&#233;rents dans le 
processus global. Son principe essentiel est d&#8217;exploiter les acquis des modules pr&#233;c&#233;dents pour 
rep&#233;rer certaines constructions syntaxiques mod&#233;lis&#233;es &#224; partir du travail sur corpus et d&#233;cider, 
en fonction de celles-ci, de la cat&#233;gorie d&#233;finitive de que. En r&#233;sum&#233;, ce n&#8217;est que lorsqu&#8217;une 
construction syntaxique est positivement identifi&#233;e que que est r&#233;&#233;tiquet&#233;. 
</p>
<p>Dans un premier temps, sont rep&#233;r&#233;es certaines constructions qui ne requi&#232;rent pour &#234;tre 
identifi&#233;es que peu d&#8217;informations de structure. Puis, en toute fin d&#8217;analyse, un module 
sp&#233;cifique rep&#232;re les constructions faisant intervenir des relations &#224; plus grande distance. 
</p>
<p>3.2.1 Premi&#232;re &#233;tape : des constructions locales 
</p>
<p>Rappelons que Syntex produit une analyse &#224; partir d&#8217;un texte pr&#233;alablement &#233;tiquet&#233;. Cela 
implique que la qualit&#233; de l&#8217;analyse syntaxique d&#233;pend crucialement de la qualit&#233; de 
l&#8217;&#233;tiquetage. Par exemple, si un que adverbe est faussement &#233;tiquet&#233; conjonction de 
subordination, le module de recherche des objets directs est mis en &#233;chec : une conjonction de 
subordination constitue une barri&#232;re apr&#232;s laquelle on ne peut avoir un objet direct. Pour &#233;viter 
ces obstacles li&#233;s &#224; des erreurs d&#8217;&#233;tiquetage, il est apparu n&#233;cessaire d&#8217;avoir le plus t&#244;t possible 
dans l&#8217;analyse un processus de v&#233;rification et de correction de que. Mais, &#171; tr&#232;s t&#244;t dans 
l&#8217;analyse &#187; signifie que l&#8217;on ne peut s&#8217;appuyer que sur tr&#232;s peu d&#8217;informations de structure, 
puisque celle-ci ne sera d&#233;couverte que par les modules suivants et pr&#233;cis&#233;ment qu&#8217;&#224; condition 
qu&#8217;un mauvais &#233;tiquetage ne rende pas la t&#226;che impossible. 
</p>
<p>Pour l&#8217;essentiel, dans cette premi&#232;re &#233;tape, sont donc analys&#233;s et r&#233;&#233;tiquet&#233;s des que dont le 
contexte proche fournit une information exploitable : des que adverbes plac&#233;s imm&#233;diatement 
</p>
<p>                                                 
4  Universit&#233; Lancaster. UCREL Projects [en ligne]. http://www.comp.lancs.ac.uk/ucrel/projects.html#crater (page 
</p>
<p>consult&#233;e le 4 f&#233;vrier 2005) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Paule Jacques 
</p>
<p>apr&#232;s le verbe, des que objets situ&#233;s eux aussi &#224; proximit&#233; du verbe, des que introduisant un 
compl&#233;ment de nom (le fait que, l&#8217;id&#233;e que, l&#8217;hypoth&#232;se que, &#8230;), des que pris dans une structure 
comparative tr&#232;s locale du type plus/moins/aussi/autant/si Adj que. L&#8217;objectif lors de cette phase 
est de d&#233;couvrir le plus possible de que adverbe ou conjonction de subordination en op&#233;rant, 
gr&#226;ce au contexte, une &#171; d&#233;duction affirmative &#187; (Vergne, Giguet, 1998) sur la cat&#233;gorie de que. 
Dans le m&#234;me temps, et parce que cette d&#233;duction est li&#233;e au rep&#233;rage d&#8217;un type de construction 
syntaxique, sont annot&#233;es les relations de que avec son recteur. Pour ce qui est des relations 
avec les r&#233;gis, seules sont annot&#233;es celles des compl&#233;tives car c&#8217;est le seul cas dans lequel on est 
s&#251;r que l&#8217;&#233;l&#233;ment r&#233;gi soit le verbe conjugu&#233; d&#8217;une proposition subordonn&#233;e. En effet, dans une 
structure corr&#233;lative, que n&#8217;introduit pas n&#233;cessairement une proposition (davantage que je ne 
croyais vs. davantage que l&#8217;autre jour). 
</p>
<p>Les informations mobilis&#233;es m&#234;lent des listes lexicales &#8211; une vingtaine de noms qui prennent un 
compl&#233;ment en que, une dizaine d&#8217;adverbes susceptibles d&#8217;entrer dans une structure corr&#233;lative 
mettant en jeu un adjectif ou un participe pass&#233;, moins d&#8217;une dizaine d&#8217;adverbes de n&#233;gation 
(pas, point, gu&#232;re, etc.), deux cents verbes qui prennent un objet direct en que (penser que, 
croire que, etc.) &#8211;, l&#8217;exploitation des quelques relations qui ont &#233;t&#233; pos&#233;es &#8211; rattachement des 
adverbes autour des verbes et des adjectifs et rattachement des auxiliaires et des modaux aux 
participes pass&#233;s pour les premiers, &#224; un verbe &#224; l&#8217;infinitif pour les seconds &#8211; et enfin, la prise en 
compte de la cat&#233;gorie des mots avant et apr&#232;s que. Rappelons que la d&#233;marche consiste 
essentiellement &#224; rep&#233;rer des &#233;l&#233;ments positifs d&#8217;analyse dans le contexte proche (nous 
donnerons en 3.2.3 un exemple de r&#232;gle d&#8217;analyse). L. Danlos (2005) adopte pour la 
d&#233;sambigu&#239;sation de il (pronom impersonnel vs. pronom anaphorique) une d&#233;marche tr&#232;s 
similaire &#8211; mod&#233;lisation de patrons linguistiques qui constituent les &#8216;marqueurs&#8217; d&#8217;une valeur 
donn&#233;e &#8211; et elle obtient avec cette approche 97,5% de bons r&#233;sultats, ce qui est plus que 
satisfaisant. 
</p>
<p>3.2.2 Deuxi&#232;me &#233;tape : la structure globale 
</p>
<p>Au moment de cette seconde &#233;tape, tous les modules ont fait leur travail et ont plac&#233; diverses 
relations qui vont &#234;tre exploit&#233;es pour l&#8217;analyse de que. Le principe est de remonter vers la 
gauche de que &#224; la recherche d&#8217;indices de telle ou telle structure. En fonction de la nature des 
constituants rencontr&#233;s, certains &#233;l&#233;ments sont recherch&#233;s. Par exemple, si dans ce parcours vers 
la gauche un nom est rencontr&#233;, on v&#233;rifie si ce nom r&#233;git un adjectif tel que m&#234;me ou autre, si 
oui, on estime &#234;tre face &#224; une structure corr&#233;lative et l&#8217;analyse s&#8217;arr&#234;te l&#224;, si non, on se d&#233;place 
sur le recteur du nom, on teste &#224; nouveau une s&#233;rie de contraintes et ainsi de suite. Pour chaque 
nouveau constituant, une s&#233;rie de contraintes est &#233;valu&#233;e et d&#232;s qu&#8217;une contrainte est satisfaite, 
l&#8217;analyse s&#8217;arr&#234;te. De cette fa&#231;on, dans les deux exemples suivants, extraits de CRATER, on 
analyse successivement divers syntagmes pr&#233;positionnels jusqu&#8217;&#224; arriver aux &#233;l&#233;ments qui 
permettent d&#8217;identifier deux structures corr&#233;latives diff&#233;rentes. 
</p>
<p>L&#8217;indication de fonction peut ou non contenir le m&#234;me num&#233;ro d&#8217;identification de fonction 
que celui qui se trouvait dans la demande d&#8217;activation de fonction d&#8217;origine. 
</p>
<p>Les proc&#233;dures s&#8217;appliquent aussi bien &#224; une interface &#224; d&#233;bit de base qu&#8217;&#224; une interface &#224; 
d&#233;bit primaire.  
</p>
<p>Les informations mobilis&#233;es sont donc les m&#234;mes que pour la premi&#232;re &#233;tape, plus &#8211; et 
essentiellement &#8211; toutes les informations de structure disponibles. Ce sont celles-l&#224; qui sont 
essentielles car, le principe &#233;tant de progresser vers la gauche constituant par constituant, en </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Que : la valse des &#233;tiquettes 
</p>
<p>s&#8217;appuyant sur les relations que les modules pr&#233;c&#233;dents ont annot&#233;es, l&#8217;analyse s&#8217;interrompt 
d&#232;s qu&#8217;un constituant de la cha&#238;ne est &#171; orphelin &#187;, c&#8217;est-&#224;-dire n&#8217;est rattach&#233; &#224; aucun autre 
&#233;l&#233;ment. 
</p>
<p>Cette seconde &#233;tape rajoute quelques r&#232;gles d&#8217;analyse, notamment pour l&#8217;analyse des syntagmes 
nominaux et pr&#233;positionnels, pour lesquels on ne disposait d&#8217;aucune relation de d&#233;pendance lors 
de la premi&#232;re &#233;tape, mais aussi elle permet d&#8217;appliquer des r&#232;gles d&#233;j&#224; d&#233;finies &#224; des &#233;l&#233;ments 
de la phrase plac&#233;s non imm&#233;diatement dans le contexte de que. Pour l&#8217;illustrer, nous prendrons 
comme exemple la r&#232;gle qui s&#8217;applique &#224; l&#8217;analyse d&#8217;un verbe conjugu&#233; &#224; gauche de que. 
</p>
<p>3.2.3 Un exemple de r&#232;gle d&#8217;analyse 
</p>
<p>Il s&#8217;agit ici d&#8217;une r&#232;gle utilis&#233;e aux deux &#233;tapes de l&#8217;analyse pour rep&#233;rer certaines constructions 
verbales. Elle permet de d&#233;cider dans un certain nombre de cas d&#8217;&#233;tiqueter que comme 
conjonction de subordination (CSub) ou comme adverbe (Adv), en rep&#233;rant les &#233;l&#233;ments d&#8217;une 
corr&#233;lative, d&#8217;une relation d&#8217;objet direct ou d&#8217;une n&#233;gation exceptive. 
</p>
<p>Lorsque la forme que est imm&#233;diatement pr&#233;c&#233;d&#233;e d&#8217;un verbe conjugu&#233; ou pr&#233;c&#233;d&#233;e d&#8217;un 
adverbe lui-m&#234;me pr&#233;c&#233;d&#233; d&#8217;un verbe conjugu&#233;, alors on lance l&#8217;analyse du verbe, qui consiste &#224; 
tester les conditions &#233;num&#233;r&#233;es ci-dessous et, en cas de test positif, &#224; attribuer &#224; que l&#8217;&#233;tiquette 
mentionn&#233;e apr&#232;s la fl&#232;che. 
</p>
<p>&#8226; pr&#233;sence des adverbes : plus, moins, davantage, autant, mieux, tellement &#198; CSub ; 
&#8226; pr&#233;sence de ne imm&#233;diatement pr&#233;c&#233;d&#233; par rien, nul, personne (par exemple Nul ne 
</p>
<p>comprendrait que&#8230; qui n&#8217;est pas une n&#233;gation exceptive) &#198; CSub ; 
&#8226; pr&#233;sence conjointe de ne et de pas, point ou un autre que adverbe &#198; CSub ; 
&#8226; pr&#233;sence seule de ne : n&#233;gation exceptive &#198; Adv ; 
&#8226; appartenance du verbe &#224; la liste de ceux qui prennent que comme objet direct &#198; CSub 
</p>
<p>+ recherche du verbe de la subordonn&#233;e introduite par que. 
</p>
<p>Il est possible aussi qu&#8217;on ne se prononce pas, c&#8217;est-&#224;-dire qu&#8217;on laisse l&#8217;&#233;tiquette attribu&#233;e par 
TreeTagger en l&#8217;&#233;tat, si on n&#8217;a recueilli aucun indice pour faire mieux que lui. 
</p>
<p>Dans la seconde &#233;tape, la m&#234;me r&#232;gle est utilis&#233;e pour analyser des verbes plac&#233;s plus loin de 
que, par exemple : 
</p>
<p>Un &#171; champ &#233;lectrique &#187; implique une activit&#233; qui ne peut &#234;tre exprim&#233;e d&#8217;une fa&#231;on 
univoque qu&#8217;en fonction du temps et de deux ou trois dimensions. 
</p>
<p>En suivant les relations de d&#233;pendance plac&#233;es par l&#8217;analyse syntaxique, le module se d&#233;place 
de l&#8217;adjectif univoque &#224; son recteur fa&#231;on, de celui-ci &#224; la pr&#233;position de, de cette derni&#232;re au 
participe pass&#233; exprim&#233;e, puis au verbe &#234;tre et enfin au verbe pouvoir, auquel s&#8217;applique la r&#232;gle 
expos&#233;e ci-dessus, qui permet de reconna&#238;tre un que adverbe. 
</p>
<p>Il s&#8217;agit ici d&#8217;une partie de la r&#232;gle qui couvre la plus grande proportion de que : dans le corpus 
CRATER, les que objets directs ou adverbes partie prenante d&#8217;une n&#233;gation repr&#233;sentent 52% des 
relations vers un recteur. Dans la premi&#232;re &#233;tape, la r&#232;gle permet d&#8217;identifier 76% des que objets 
et 61% des adverbes, un pourcentage qui est diversement am&#233;lior&#233; dans la seconde &#233;tape </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Paule Jacques 
</p>
<p>puisqu&#8217;il passe &#224; 78% pour les objets et 82% pour les adverbes. Ces chiffres ne sont qu&#8217;une 
composante des r&#233;sultats, int&#233;ressons-nous maintenant &#224; ceux-ci. 
</p>
<p>3.3 R&#233;sultats 
</p>
<p>Dans la mesure o&#249; la t&#226;che concerne aussi bien l&#8217;&#233;tiquetage que l&#8217;annotation de relations, nous 
avons &#233;valu&#233; notre m&#233;thode sur ces deux points. 
</p>
<p>3.3.1 L&#8217;&#233;tiquetage 
</p>
<p>Pour ce qui concerne l&#8217;&#233;tiquetage, la seule mesure que nous pr&#233;sentons concerne la pr&#233;cision. 
En effet, le rappel est de 100% : absolument tous les mots re&#231;oivent une et une seule &#233;tiquette. 
La mesure porte sur 1183 que, &#233;tiquet&#233;s initialement par TreeTagger. Le tableau ci-dessous 
r&#233;capitule les r&#233;sultats : 
</p>
<p>Etape Pr&#233;cision 
</p>
<p>&#233;tiquetage initial 75% 
</p>
<p>&#233;tape 1 89%  +14% 
</p>
<p>&#233;tape finale 92%  +3% 
</p>
<p>Tableau 1 : Mesure de la pr&#233;cision de l&#8217;&#233;tiquetage morphosyntaxique 
</p>
<p>On voit que l&#8217;essentiel du gain est obtenu apr&#232;s la premi&#232;re &#233;tape, ce qui tend &#224; montrer que 
pour la d&#233;termination de la cat&#233;gorie de que, des informations tr&#232;s locales suffisent. Il n&#8217;en est 
pas de m&#234;me pour l&#8217;annotation des relations. 
</p>
<p>3.3.2 Les relations 
</p>
<p>Les mesures propos&#233;es ici sont restreintes aux cas o&#249; l&#8217;&#233;tiquetage de que est correct. Le nombre 
de relations &#233;valu&#233;es n&#8217;est donc pas le m&#234;me &#224; chacune des &#233;tapes : 1789 pour la premi&#232;re, 1843 
pour la seconde, toutes relations confondues. Il faut noter que pour les que adverbes, l&#8217;analyse 
n&#8217;inscrit qu&#8217;une relation, vers le recteur, alors que pour les que conjonction ou pronom relatif, 
deux relations doivent &#234;tre annot&#233;es, l&#8217;une vers le recteur, l&#8217;autre vers le r&#233;gi pour les 
conjonctions, vers un ant&#233;c&#233;dent nominal pour le pronom. Ceci pose, dans le cas des relatifs 
sans ant&#233;c&#233;dent, tels que ceux qui participent &#224; une structure cliv&#233;e (voir la section 2.1), de 
v&#233;ritables probl&#232;mes de repr&#233;sentation : soit on note une relation d&#8217;ant&#233;c&#233;dence fictive et 
arbitraire vers l&#8217;un quelconque des &#233;l&#233;ments du constituant cliv&#233;, soit aucune relation 
d&#8217;ant&#233;c&#233;dence n&#8217;est mentionn&#233;e (c&#8217;est la position retenue actuellement).  
</p>
<p>Le rappel et la pr&#233;cision de l&#8217;annotation des relations sont indiqu&#233;s dans le tableau 2. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Que : la valse des &#233;tiquettes 
</p>
<p>Etape Rappel Pr&#233;cision 
</p>
<p>&#233;tape 1 60% 97% 
</p>
<p>&#233;tape finale 93%  +33% 94% -3% 
</p>
<p>Tableau 2 : Mesures de rappel et de pr&#233;cision de l&#8217;annotation des relations 
</p>
<p>A titre de comparaison, la pr&#233;cision de Syntex pour le rattachement des pr&#233;positions varie de 78 
&#224; 87 % selon les corpus (Bourigault, Fr&#233;rot, 2005). 
</p>
<p>Il appara&#238;t ici clairement que l&#8217;annotation des relations b&#233;n&#233;ficie consid&#233;rablement des 
informations sur les relations existantes au sein de la phrase, notamment parce qu&#8217;il devient 
alors possible de placer des relations &#224; distance. Mais cette annotation de relations se trouve 
am&#233;lior&#233;e aussi pour la simple raison que la recherche des r&#233;gis des conjonctions de 
subordination dans les corr&#233;latives n&#8217;est pas du tout effectu&#233;e dans la premi&#232;re &#233;tape, et ce parce 
que l&#8217;on a besoin de disposer des d&#233;pendances pour, par exemple, ne pas prendre un pronom 
pour r&#233;gi et arriver jusqu&#8217;au verbe dont il est sujet, en d&#8217;autres termes, ne pas analyser tel que 
nous l&#8217;avons d&#233;fini comme tel que nous. 
</p>
<p>A l&#8217;heure actuelle, les performances sont limit&#233;es par deux types d&#8217;obstacles. D&#8217;une part, 
l&#8217;ambigu&#239;t&#233; de certaines structures : comme nous l&#8217;avons d&#233;j&#224; mentionn&#233;, la pr&#233;sence des 
marqueurs recherch&#233;s ne garantit pas d&#8217;&#234;tre effectivement face &#224; la structure suppos&#233;e, ce qui est 
parfaitement illustr&#233; par les deux exemples suivants, formellement analogues. Dans le premier, 
la pr&#233;sence de tels conduit l&#8217;analyseur &#224; manquer la relation avec le verbe dire. 
</p>
<p>On dit couramment de tels r&#233;seaux m&#233;sochrones qu&#8217;ils sont synchronis&#233;s. 
</p>
<p>La nature sociale comporte de tels hasards que l&#8217;imagination des inventeurs est &#224; tout 
moment d&#233;pass&#233;e. 
</p>
<p>D&#8217;autre part, les limites du fichier d&#8217;entr&#233;e constituent des &#233;cueils actuellement 
infranchissables : si par exemple un verbe n&#8217;est pas &#233;tiquet&#233; verbe mais nom, si une pr&#233;position 
n&#8217;a pas &#233;t&#233; rattach&#233;e ou encore si un adjectif ne r&#233;git pas l&#8217;adverbe qui manifesterait une 
comparaison, le processus d&#8217;annotation des relations est bloqu&#233;. Ce sont donc deux directions 
vers lesquelles porter les efforts. 
</p>
<p>Avant de conclure, soulignons que ces r&#233;sultats sont partiels dans la mesure o&#249; ils se limitent &#224; 
l&#8217;analyse de la forme que. En fait, il faudrait pouvoir &#233;valuer l&#8217;impact d&#8217;un meilleur traitement 
de que sur l&#8217;analyse globale, ce que nous n&#8217;avons pas &#233;t&#233; en mesure de faire. 
</p>
<p>4 Conclusion 
Nous avons pr&#233;sent&#233; une strat&#233;gie qui effectue dans le m&#234;me mouvement l&#8217;analyse et 
l&#8217;&#233;tiquetage de que, en prenant appui sur les acquis de l&#8217;analyse syntaxique au fur et &#224; mesure de 
son d&#233;roulement. La confrontation &#224; un corpus de r&#233;f&#233;rence montre que l&#8217;&#233;tiquetage est 
grandement am&#233;lior&#233; avec peu d&#8217;informations de structure, qui sont en revanche indispensables 
pour l&#8217;annotation des relations de d&#233;pendance. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Paule Jacques 
</p>
<p>Parmi les pistes &#224; continuer &#224; explorer, nous voudrions mentionner la question de la 
repr&#233;sentation des relations. La repr&#233;sentation de certaines relations ne nous semble pas poser 
probl&#232;me : les compl&#233;tives, les objets directs, les adverbes sont reli&#233;s sans difficult&#233; au nom, 
adjectif, verbe, etc., concern&#233;. Mais les structures corr&#233;latives, par leur diversit&#233;, ne se laissent 
pas facilement appr&#233;hender. A l&#8217;heure actuelle, nos choix d&#8217;annotation impliquent de 
repr&#233;senter de la m&#234;me fa&#231;on des structures similaires en surface. Consid&#233;rons par exemple une 
structure aussi Adj que&#8230; Il nous importe de reconna&#238;tre une corr&#233;lative, en identifiant la 
relation entre l&#8217;adjectif et l&#8217;adverbe aussi, quel que soit l&#8217;autre &#233;l&#233;ment de la comparaison. Mais 
selon la nature de cet &#233;l&#233;ment, l&#8217;interpr&#233;tation de la structure n&#8217;est pas la m&#234;me : 
</p>
<p>Jean est aussi gentil que beau Jean gentil + beau 
</p>
<p>Jean est aussi gentil que son fr&#232;re Jean gentil + son fr&#232;re gentil 
</p>
<p>Dans le premier cas, que r&#233;git un adjectif, l&#8217;interpr&#233;tation doit &#234;tre que les deux adjectifs se 
rapportent au m&#234;me SN, dans le second cas, que r&#233;git un SN, on doit alors interpr&#233;ter que les 
deux SN &#171; partagent &#187; l&#8217;adjectif. Il nous semble qu&#8217;il n&#8217;est absolument pas trivial de d&#233;cider 
comment distinguer ces deux constructions, soit elles sont distingu&#233;es au moment de 
l&#8217;annotation, par des relations diff&#233;renci&#233;es, soit on estime que l&#8217;annotation doit rester au plus 
pr&#232;s des structures de surface et que c&#8217;est dans l&#8217;interpr&#233;tation qu&#8217;elles seront diff&#233;renci&#233;es. 
Cela m&#233;rite r&#233;flexion et approfondissement, au-del&#224; du cas particulier de que. 
</p>
<p>Remerciements 
</p>
<p>Je remercie vivement C&#233;cile Fabre, Didier Bourigault ainsi que les relecteurs de TALN pour 
toutes leurs remarques et conseils. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>ABNEY S. (1996), Part-of-Speech Tagging and Partial Parsing, In K. Church, S. Young et 
G. Bloothooft (Eds.), Corpus-Based Methods in Language and Speech, pp. 118-136, Dordrecht, 
Kluwer Academic Publishers.  
</p>
<p>BOURIGAULT D., FREROT C. (2005), Acquisition et &#233;valuation sur corpus de propri&#233;t&#233;s de sous-
cat&#233;gorisation syntaxique, Actes de TALN'2005. 
</p>
<p>DANLOS L. (2005), ILIMP : Outil pour rep&#233;rer les occurrences du pronom impersonnel il, Actes 
de TALN'2005. 
</p>
<p>GARSIDE R., LEECH G., MCENERY T. (1997), Corpus Annotation: Linguistic Information from 
Computer, Londres, Longman. 
</p>
<p>HABERT B., NAZARENKO A., SALEM A. (1997), Les linguistiques de corpus, Paris, Armand 
Colin. 
</p>
<p>RIEGEL M., PELLAT J.-C., RIOUL R. (1994), Grammaire m&#233;thodique du fran&#231;ais, Paris, P.U.F. 
</p>
<p>SCHMID H. (1994), Probabilistic Part-of-Speech Tagging Using Decision Trees, Actes de 
NEMLAP. 
</p>
<p>VERGNE J., GIGUET E. (1998), Regards Th&#233;oriques sur le &quot;Tagging&quot;, Actes de TALN'98, 22-31. </p>

</div></div>
</body></html>