<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Acquisition et &#233;valuation sur corpus de propri&#233;t&#233;s de sous-cat&#233;gorisation syntaxique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Acquisition et &#233;valuation sur corpus 
de propri&#233;t&#233;s de sous-cat&#233;gorisation syntaxique 
</p>
<p>Didier Bourigault et C&#233;cile Fr&#233;rot 
</p>
<p>ERSS &#8211; CNRS &amp; Universit&#233; Toulouse le Mirail 
5, all&#233;es Antonio Machado 
31 058 Toulouse Cedex 1 
</p>
<p>{didier.bourigault,cecile.frerot}@univ-tlse2.fr 
</p>
<p>Mots-cl&#233;s :   analyse syntaxique, ambigu&#239;t&#233; de rattachement pr&#233;positionnel, sous-
cat&#233;gorisation syntaxique  
Keywords: syntactic parsing, PP attachment disambiguation, subcategorization lexicon 
</p>
<p>R&#233;sum&#233; 
Cette &#233;tude est men&#233;e dans le cadre du d&#233;veloppement de l&#8217;analyseur syntaxique de corpus 
Syntex et porte sur la t&#226;che de d&#233;sambigu&#239;sation des rattachements pr&#233;positionnels. Les 
donn&#233;es de sous-cat&#233;gorisation syntaxique exploit&#233;es par Syntex pour la d&#233;sambigu&#239;sation se 
pr&#233;sentent sous la forme de probabilit&#233;s de sous-cat&#233;gorisation (que telle unit&#233; lexicale - 
verbe, nom ou adjectif - se construise avec telle pr&#233;position). Elles sont acquises 
automatiquement &#224; partir d&#8217;un corpus de 200 millions de mots, &#233;tiquet&#233; et partiellement 
analys&#233; syntaxiquement. Pour &#233;valuer ces donn&#233;es, nous utilisons 4 corpus de test de genres 
vari&#233;s, sur lesquels nous avons annot&#233; &#224; la main plusieurs centaines de cas de rattachement 
pr&#233;positionnels ambigus. Nous testons plusieurs strat&#233;gies de d&#233;sambigu&#239;sation, une strat&#233;gie 
de base, une strat&#233;gie endog&#232;ne qui exploite des propri&#233;t&#233;s de sous-cat&#233;gorisation sp&#233;cifiques 
acquises &#224; partir du corpus en cours de traitement, une strat&#233;gie exog&#232;ne qui exploite des 
propri&#233;t&#233;s de sous-cat&#233;gorisation g&#233;n&#233;riques acquises &#224; partir du corpus de 200 millions de 
mots, et enfin une strat&#233;gie mixte qui utilisent les deux types de ressources. L&#8217;analyse des 
r&#233;sultats montre que la strat&#233;gie mixte est la meilleure, et que les performances de l&#8217;analyseur 
sur la t&#226;che de d&#233;sambigu&#239;sation des rattachements pr&#233;positionnels varient selon les corpus de 
79.4 % &#224; 87.2 %. 
</p>
<p>Abstract  
We carry out an experiment aimed at using subcategorization information into a syntactic 
parser for PP attachment disambiguation. The subcategorization lexicon consists of 
probabilities between a word (verb, noun, adjective) and a preposition. The lexicon is 
acquired automatically from a 200 million word corpus, that is partially tagged and parsed. In 
order to assess the lexicon, we use 4 different corpora in terms of genre and domain. We </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Bourigault, C. Fr&#233;rot 
</p>
<p>assess various methods for PP attachment disambiguation : an exogeous method relies on the 
sub-categorization lexicon whereas an endogenous method relies on the corpus specific 
ressource only and an hybrid method makes use of both. The hybrid method proves to be the 
best and the results vary  from 79.4 % to 87.2 %. 
</p>
<p>1 Introduction 
Les nombreux travaux sur le d&#233;veloppement de parseurs statistiques concernent la langue 
anglaise et tendent &#224; utiliser comme corpus d&#8217;apprentissage et comme corpus de test des 
portions de la section du Wall Street Journal du Penn TreeBank (Charniak, 1997). Outre 
qu&#8217;elle permet d&#8217;&#233;viter la t&#226;che l aborieuse de construction de corpus annot&#233;s, cette d&#233;marche 
pr&#233;sente l&#8217;immense avantage de po uvoir comparer les parseurs entre eux (Ratnaparkhi et al., 
1994 ; Pantel et Lin, 1998). Cette exploitation mono-corpus pose cependant la question de la 
stabilit&#233; des performances en fonction du type de corpus, comme le mentionnent Kilgarrif et 
Grefenstette (2003 :341) : &#171; there is little work on assessing how well one language model 
fares when applied to a text type that is different from that of the training corpus &#187;. Par 
ailleurs, il est maintenant bien connu que, dans tout corpus, certaines unit&#233;s lexicales ont des 
propri&#233;t&#233;s syntaxiques de sous-cat&#233;gorisation sp&#233;cifiques, qui peuvent donc varier d&#8217;un 
domaine &#224; l&#8217;autre (R oland, Jurafsky, 1998 ; Basili et al., 1999). Or peu de travaux relatent des 
exp&#233;riences sur la variation des performances de l&#8217;analyseur en fonction du type de corpus &#224; 
traiter, sur le probl&#232;me de la possible variation inter-corpus et sur celui de la n&#233;cessaire 
adaptation des r&#232;gles de l&#8217;analyseur &#224; un corpus  donn&#233;. On peut n&#233;anmoins citer (Sekine, 
1997 ; Gildea, 2001 ; Slocum, 1986). 
</p>
<p>Dans cet article, nous nous int&#233;ressons &#224; l&#8217;acquisition et &#224; l&#8217;&#233;valuation sur corpus de donn&#233;es 
de sous-cat&#233;gorisation syntaxique. Cette &#233;tude est men&#233;e dans le cadre du d&#233;veloppement de 
l&#8217;analyseur syntaxique de corpus Syntex et porte sur la t&#226;che de d&#233;sambigu&#239;sation des 
rattachements pr&#233;positionnels1 (section 2). Les donn&#233;es de sous-cat&#233;gorisation syntaxique 
exploit&#233;es par Syntex pour la d&#233;sambigu&#239;sation se pr&#233;sentent sous la forme de probabilit&#233;s de 
sous-cat&#233;gorisation (que telle unit&#233; lexicale - verbe, nom ou adjectif &#8211; se construise avec telle 
pr&#233;position). Dans la section 3, nous d&#233;crivons comment elles sont acquises automatiquement 
&#224; partir d&#8217;un corpus de 200 millions de mot s, &#233;tiquet&#233; et partiellement analys&#233; 
syntaxiquement. La section 4 est consacr&#233;e &#224; l&#8217;&#233;valuation sur des donn&#233;es acquises sur 4 
corpus de test de genres vari&#233;s, sur lesquels nous avons annot&#233; &#224; la main plusieurs centaines 
de cas de rattachement pr&#233;positionnels ambigus. Dans la section 5, nous pr&#233;sentons plusieurs 
strat&#233;gies de d&#233;sambigu&#239;sation : une strat&#233;gie de base, une strat&#233;gie endog&#232;ne qui exploite des 
propri&#233;t&#233;s de sous-cat&#233;gorisation sp&#233;cifiques, acquises &#224; partir du corpus en cours de 
traitement, une strat&#233;gie exog&#232;ne qui exploite des propri&#233;t&#233;s de sous-cat&#233;gorisation 
g&#233;n&#233;riques, acquises &#224; partir du corpus de 200 millions de mots, et enfin une strat&#233;gie mixte 
qui utilise les deux types de ressources. L&#8217;analyse des r&#233;sultats (section 6) montre que la 
strat&#233;gie mixte est la plus performante, et que les performances de l&#8217;analyseur sur la t&#226;che de 
d&#233;sambigu&#239;sation des rattachements pr&#233;positionnels varient selon les corpus. 
</p>
<p>                                                 
</p>
<p>1
 Nous nous int&#233;ressons dans cet article aux pr&#233;positions autres que de. Le traitement de la pr&#233;position de repose 
</p>
<p>sur les m&#234;mes principes, mais est sensiblement plus complexe (Fr&#233;rot et al., 2003). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition et &#233;valuation sur corpus &#8230; 
</p>
<p>2 Syntex, un analyseur syntaxique de corpus 
Cette exp&#233;rience est men&#233;e dans le cadre du d&#233;veloppement de l&#8217;analyseur syntaxique de 
corpus Syntex (Bourigault, Fabre, 2000). Syntex est un analyseur en d&#233;pendance qui prend en 
entr&#233;e un corpus de phrases &#233;tiquet&#233;es2, et calcule pour chaque phrase les relations de 
d&#233;pendance syntaxique entre les mots. C&#8217;est un analyseur en couches ( A&#239;t-Moktar et al., 
2002) : le corpus est analys&#233; en plusieurs passes, diff&#233;rents modules prenant successivement 
en charge une relation syntaxique de d&#233;pendance donn&#233;e, et les sorties d&#8217;un module 
constituant les entr&#233;es du module suivant. Chaque module est constitu&#233; d&#8217;un e nsemble de 
r&#232;gles construites &#171; &#224; la main &#187;. 
</p>
<p>Syntex est un analyseur semi-lexicalis&#233;. Le module qui effectue les rattachements 
pr&#233;positionnels exploite des donn&#233;es lexico-syntaxiques de sous-cat&#233;gorisation, exprim&#233;es 
sous la forme de probabilit&#233;s qu&#8217;une unit&#233; lexicale donn&#233;e (verbe, nom, adjectif) se construise 
avec telle ou telle pr&#233;position. Le rattachement des pr&#233;positions &#224; leur recteur s&#8217;effectue en 
deux passes : (1) recherche des candidats recteurs, (2) choix d&#8217;un recteur. Un premier module 
(rechercher-candidats) traite l&#8217;ensemble des phrases du corpus, et recherche pour chaque 
pr&#233;position, le ou les mots susceptibles de r&#233;gir cette pr&#233;position. Ce module est constitu&#233; de 
r&#232;gles qui reconnaissent un certain nombre de configurations lin&#233;aires de mots et de cat&#233;gories 
morphosyntaxiques &#224; gauche de la pr&#233;position au sein desquelles sont identifi&#233;s des mots 
susceptibles de r&#233;gir la pr&#233;position. Ces r&#232;gles s&#8217;appuient sur les relations de d &#233;pendance 
plac&#233;es par les modules ant&#233;rieurs, et sont capables d&#8217;aller chercher des candidats recteurs 
dans des configurations relativement complexes, incluant par exemple des structures 
coordonn&#233;es ou des incises. Les configurations d&#8217;ambigu&#239;t&#233;s, d&#233;finies comme la succes sion 
des cat&#233;gories grammaticales des candidats recteurs, sont tr&#232;s vari&#233;es. Sur les 4 corpus de test 
pr&#233;sent&#233;s dans la section 4, la configuration &#8216;V N&#8217;, o&#249; seuls un verbe  et un nom sont en 
comp&#233;tition - configuration trait&#233;e dans beaucoup de travaux dont ceux, fondateurs, de Hindle 
et Rooth (1993) -, ne repr&#233;sente que 50 % des cas dans le corpus litt&#233;raire, environ 35 % dans 
le corpus journalistique et  15 % dans le corpus juridique et le corpus technique. 
Au cours de la seconde &#233;tape du traitement des ambigu&#239;t&#233;s pr&#233;positionnelles, le second 
module (choisir-candidat) revient sur chaque cas ambigu et choisit le recteur de la pr&#233;position 
parmi les candidats. Pour ce faire, ce module exploite des informations de sous-cat&#233;gorisation 
associ&#233;es aux couples (candidat, pr&#233;position). Depuis l&#8217;origine de nos travaux sur l&#8217;analyse 
syntaxique, ces informations sont acquises de fa&#231;on endog&#232;ne sur le corpus en cours de 
traitement (Bourigault, 1993). En effet, l&#8217;analyseur est utilis&#233; dans diff&#233;rents conte xtes 
applicatifs, et principalement dans des applications de construction de terminologies ou 
d&#8217;ontologies sp&#233;cialis&#233;es &#224; pa rtir de textes. Il traite des corpus sp&#233;cialis&#233;s, th&#233;matiques, de 
taille moyenne (quelques centaines de milliers de mots, sur des domaines techniques, 
juridiques, m&#233;dicaux). Les exp&#233;riences men&#233;es sur de nombreux corpus ont montr&#233; que ces 
corpus renferment des sp&#233;cificit&#233;s lexicales, en particulier que certains mots, fr&#233;quents dans le 
corpus, manifestent des comportements syntaxiques sp&#233;cifiques et impr&#233;dictibles. C&#8217;est 
pourquoi, nous avons port&#233; nos efforts depuis une dizaine d&#8217;ann&#233;es sur le d&#233;veloppement de 
proc&#233;dures d&#8217;apprentissage endog&#232;ne sur co rpus qui permettent &#224; l&#8217;analyseur d&#8217;acqu&#233;rir lui -
</p>
<p>                                                 
</p>
<p>2
 Nous utilisons actuellement les versions fran&#231;aise et anglaise du Treetager (http://www.ims.uni-stuttgart.de) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Bourigault, C. Fr&#233;rot 
</p>
<p>m&#234;me, par analyse du corpus &#224; traiter, des informations de sous-cat&#233;gorisation sp&#233;cifiques &#224; 
ce corpus, acquises &#224; partir des cas non ambigus rep&#233;r&#233;s par le module rechercher-candidats. 
</p>
<p>Devant les limites inh&#233;rentes &#224; l&#8217;exploitation d&#8217;informations de sous -cat&#233;gorisation acquises 
exclusivement sur le corpus en cours de traitement, nous travaillons &#224; l&#8217;&#233;laboration de 
ressources g&#233;n&#233;rales, susceptibles d&#8217;&#234;tre exploit&#233;es pour tout corpus (Fr&#233;rot et al., 2003). 
Nous avons exp&#233;riment&#233; l&#8217;utilisation d&#8217;un lexique de sous -cat&#233;gorisation construit &#224; partir des 
tables du Lexique Grammaire (Fr&#233;rot, &#224; para&#238;tre). Nous pr&#233;sentons dans ce travail une 
exp&#233;rience d&#8217;acquisition de probabilit&#233;s de sous -cat&#233;gorisation &#224; partir d&#8217;un corpus de 200 
millions de mots. 
</p>
<p>3 Acquisition de propri&#233;t&#233;s de sous-cat&#233;gorisation &#224; partir d&#8217;un 
corpus de 200 millions de mots 
</p>
<p>Les m&#233;thodes d&#8217;acquisition de propri&#233;t&#233;s de sous -cat&#233;gorisation exploitent classiquement des 
corpus &#233;tiquet&#233;s de grande taille (Basili, Vindigni, 1998). Le Web est aussi consid&#233;r&#233; comme 
source potentielle d&#8217;acquisiti on (Gala Pavia, 2003). Dans notre &#233;tude, nous utilisons comme 
base d&#8217;apprentissage un corpus de 200  millions de mots, constitu&#233; des articles du journal Le 
Monde, des ann&#233;es 1991 &#224; 2000 (corpus LM103). Nous ne pr&#233;tendons pas que ce corpus soit 
repr&#233;sentatif de la &#171; langue g&#233;n&#233;rale &#187;, mais nous consid&#233;rons que sa taille et sa diversit&#233; 
th&#233;matique en font un corpus r&#233;f&#233;rentiellement et linguistiquement peu marqu&#233;, &#224; partir 
duquel il est possible d&#8217;acqu&#233;rir des do nn&#233;es de sous-cat&#233;gorisation relativement g&#233;n&#233;riques. 
La proc&#233;dure d&#8217;acquisition est adapt&#233;e des m&#233;thodes d&#8217;apprentissage endog&#232;ne int&#233;gr&#233;es dans 
Syntex. La m&#233;thode de calcul des probabilit&#233;s de sous-cat&#233;gorisation s&#8217;appuie sur un 
ensemble de triplets (recteur, pr&#233;position, r&#233;gi) extraits d&#8217;une analyse syntaxique du corpus 
LM10 effectu&#233;e par Syntex. La proc&#233;dure d&#8217;acquisition se d&#233;roule en deux &#233;tapes, au cours 
desquelles la m&#234;me m&#233;thode de calcul de probabilit&#233;s est lanc&#233;e successivement sur deux 
ensembles diff&#233;rents de triplets : une &#233;tape d&#8217;amor&#231;age et une &#233;tape de consolidation. 
</p>
<p>Au cours de l&#8217;&#233;tape d&#8217;amor&#231;age, le module rechercher-candidats traite l&#8217;ensemble du corpus 
LM10, qui a &#233;t&#233; analys&#233; par les modules ant&#233;rieurs de Syntex, et construit, &#224; partir des cas 
non-ambigus, c&#8217;est -&#224;-dire ceux pour lesquels il n&#8217;a identifi&#233; qu&#8217;un seul candidat  recteur pour 
la pr&#233;position, un ensemble de triplets (w,p,w&#8217;), o&#249; w est le recteur de la pr&#233;position p, et w&#8217; le 
mot (nom, ou verbe &#224; l&#8217;infinitif) r&#233;gi par la pr&#233;position. Le modul e rechercher-candidats 
compte aussi pour chaque mot w le nombre d&#8217;occurrences dans le corpus o&#249; ce mot n&#8217;est 
candidat d&#8217;aucune pr&#233;position. A l&#8217;issue du traitement de l&#8217;ensemble du corpus, on dispose 
des donn&#233;es de fr&#233;quence suivantes : 
</p>
<p>&#8226; F(w,0) : nombre d&#8217;o ccurrences non ambigu&#235;s o&#249; le mot w ne r&#233;git aucune 
pr&#233;position ; 
</p>
<p>                                                 
</p>
<p>3
 Ce corpus a &#233;t&#233; pr&#233;par&#233;, &#224; partir de fichiers obtenus aupr&#232;s de l&#8217;agence Elra, par Beno&#238;t Habert (LIMSI),  qui a 
</p>
<p>effectu&#233; les t&#226;ches de nettoyage, de balisage et de signalisation n&#233;cessaires pour transformer les fichiers 
initiaux en un corpus effectivement &#171; traitable &#187; par des outils de Traitement Automatique des Langues. 
Nous remercions Beno&#238;t Habert et le LIMSI de nous avoir permis de b&#233;n&#233;ficier de cette ressource. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition et &#233;valuation sur corpus &#8230; 
</p>
<p>&#8226; F(w,p,w&#8217; ) : nombre d&#8217;occurrences non ambigu&#235;s o&#249; le mot w r&#233;git la 
pr&#233;position p, qui elle-m&#234;me r&#233;git le mot w&#8217; . 
</p>
<p>A partir de ces donn&#233;es, un premier ensemble de probabilit&#233;s de sous-cat&#233;gorisation P(w,p) 
est calcul&#233;, selon la m&#233;thode d&#233;crite plus loin dans la pr&#233;sente section. 
</p>
<p>Au cours de l&#8217;&#233;tape de consolidation, le module choisir-candidat exploite ce premier lexique 
et traite &#224; son tour l&#8217;ensemble du corpus LM10, analys&#233; par le module rechercher-candidats. 
Il revient sur les cas ambigus et choisit le candidat recteur dont la probabilit&#233; de construction 
avec la pr&#233;position, fournie dans le premier lexique, est la plus importante. A partir de ces 
nouvelles annotations, un nouvel ensemble de triplets est constitu&#233;, qui inclut le pr&#233;c&#233;dent et 
auquel s&#8217;ajoutent les triplets ( w,p,w&#8217; ) issus des cas ambigus r&#233;solus. De nouvelles donn&#233;es de 
fr&#233;quence F(w,p,w&#8217; ) et F(w,0) sont alors constitu&#233;es, &#224; partir desquelles un second ensemble 
de probabilit&#233;s de sous-cat&#233;gorisation est calcul&#233;, selon la m&#233;thode d&#233;crite ci-dessous. C&#8217;est le 
lexique construit &#224; l&#8217;issue de cette &#233;tape de consolidation qui est utilis&#233; dans Syntex. 
</p>
<p>La m&#233;thode de calcul des probabilit&#233;s est simple. La probabilit&#233; est calcul&#233;e comme une 
fr&#233;quence relative pond&#233;r&#233;e4. Soit T, l&#8217;ensemble des triplets ( w,p,w&#8217; ), obtenu &#224; l&#8217;issue de 
l&#8217;&#233;tape d&#8217;amor&#231;age ou &#224; celle de consolidation. Pour un couple (w,p), on d&#233;finit E
</p>
<p>w,p comme 
l&#8217;ensemble des mots w&#8217;  tels que la fr&#233;quence F(w,p,w&#8217; ) est sup&#233;rieure &#224; 0. On d&#233;finit la 
productivit&#233; du couple (w,p), Prod(w,p), comme le cardinal de l&#8217;ensemble E
</p>
<p>w,p, c&#8217;est -&#224;-dire 
comme le nombre de mots diff&#233;rents que r&#233;git la pr&#233;position p quand elle-m&#234;me est r&#233;gie par 
le mot w. Nous utilisons ce coefficient pour pond&#233;rer la fr&#233;quence totale du couple (w,p). A 
fr&#233;quence &#233;gale, plus le couple (w,p) a &#233;t&#233; rep&#233;r&#233; avec des contextes w&#8217;  diff&#233;rents, plus grande 
est estim&#233;e la propension du mot w &#224; r&#233;gir la pr&#233;position p. L&#8217;exp&#233;rience montre que, dans des 
corpus th&#233;matiques, la tr&#232;s haute fr&#233;quence de certains syntagmes tr&#232;s r&#233;p&#233;titifs incluant le 
triplet (w,p,w&#8217; ) vient biaiser la probabilit&#233; d&#8217;association lexicale entre w et p. La pond&#233;ration 
propos&#233;e ci-dessus vise &#224; limiter une telle surestimation et &#224; accorder un poids non seulement 
&#224; la fr&#233;quence de l&#8217;association, mais aussi &#224; sa diversit&#233;. La formule de calcul de la probabil it&#233; 
pond&#233;r&#233;e est donn&#233;e dans le tableau 1 : F(w,p) est la fr&#233;quence totale du couple (w,p), F(w) est 
la fr&#233;quence totale du mot w, et &#8226; est un coefficient de normalisation, choisi de telle sorte que 
la somme des probabilit&#233;s associ&#233;es &#224; un mot donn&#233; soit &#233;gale &#224; 1. 
</p>
<p>                                                 
</p>
<p>4
 Nous n&#8217;avons pour le moment pas test&#233; d&#8217;autres m&#233;thode de filtrage, comme celle de la distribution 
</p>
<p>polynomiale (Manning, 1993). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Bourigault, C. Fr&#233;rot 
</p>
<p>T = { (w,p,w&#8217;) / F( w,p,w&#8217; ) &gt; 0 }, ensemble de triplets 
</p>
<p>F(w,p,w&#8217; ) : nombre de cas o&#249; le mot w r&#233;git la pr&#233;position p, elle-
m&#234;me r&#233;gissant le mot w&#8217;  
</p>
<p>F(w,0) : nombre de cas o&#249; le mot w ne r&#233;git aucune pr&#233;position 
</p>
<p>E
w,p = { w&#8217; / F( w,p,w&#8217; ) &gt; 0 }, le contexte du couple (w,p) 
</p>
<p>Prod(w,p) = Card(E
w,p), la productivit&#233; du couple (w,p) 
</p>
<p>F(w,p) = &#8226;
  w&#8217; &#8226; Ew,p F(w,p,w&#8217; ) 
</p>
<p>F(w)=F(w,0)+ &#8226;
 p F(w,p) 
</p>
<p>P(w,0) = F(w,0)/F(w) 
</p>
<p>P(w,p)=F(w,p) /F(w)*log(1 + Prod(w,p))/ &#8226; 
</p>
<p>Tableau 1. M&#233;thode de calcul des probabilit&#233;s de sous-cat&#233;gorisation 
</p>
<p>Le nombre total d&#8217;occurrences de triplets ( w,p,w&#8217; ) &#224; partir desquels les probabilit&#233;s sont 
calcul&#233;es est de l&#8217;ordre de 6,7 millions &#224; l&#8217;issue de l&#8217;&#233;tape d&#8217;amor&#231;age, et de 12 millions &#224; 
l&#8217;issue de l&#8217;&#233;tape de consolidation. Le nombre total d&#8217;occurrences de mots ne r&#233;gissant pas de 
pr&#233;position est d&#8217;environ 87 millions &#224; l&#8217;issue de l&#8217;&#233;tape d&#8217;amor&#231;age , et de 95 millions &#224; 
l&#8217;issue de l&#8217;&#233;tape de consolidation. Les probabilit&#233;s ne sont calcul&#233;es que pour les couples 
(w,p) tels que la fr&#233;quence totale du mot w est sup&#233;rieure &#224; 20. Un couple n&#8217;est retenu dans le 
lexique de d&#233;sambigu&#239;sation que si la probabilit&#233; d&#233;passe le seuil de 0.01. Le lexique final 
compte 6 693 verbes diff&#233;rents (chacun pouvant &#234;tre pr&#233;sent avec plusieurs pr&#233;positions), 
11 528 noms et 698 adjectifs. 
</p>
<p>4 Annotation 
De fa&#231;on g&#233;n&#233;rale, le d&#233;veloppement d&#8217;un analyseur sy ntaxique robuste exige une m&#233;thode de 
travail qui assume la tr&#232;s grande variabilit&#233; des corpus sur le plan syntaxique. Les strat&#233;gies et 
r&#232;gles des diff&#233;rents modules de Syntex sont &#224; chaque exp&#233;rimentation &#233;labor&#233;es &#224; partir de 
tests effectu&#233;s sur plusieurs corpus, aussi diversifi&#233;s que possible, pour limiter les biais 
d&#8217;impl&#233;mentation que pourrait introduire une a pproche mono-corpus. A la variabilit&#233; inter-
corpus, il faut ajouter la variabilit&#233; intra-corpus. Pour &#233;viter d&#8217;&#233;laborer des r &#232;gles trop 
d&#233;pendantes de telle ou telle configuration syntaxique ou unit&#233; lexicale, il faut sur chaque 
corpus annoter &#224; la main un tr&#232;s grand nombre de cas. Dans le cadre de cette &#233;tude, nous 
avons &#233;valu&#233; le lexique de sous-cat&#233;gorisation sur 4 corpus de test, de genres vari&#233;s, dans 
lesquels nous avons valid&#233; &#224; la main plusieurs centaines de cas : 
</p>
<p>&#8226; BAL. Le roman &#171; Splendeurs et mis&#232;res des courtisanes &#187;, d&#8217;Honor&#233; de Balzac 
(199 789 mots) : 672 cas valid&#233;s 
</p>
<p>&#8226; LMO. Un extrait du journal Le Monde (673 187 mots) : 1 238 cas valid&#233;s </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition et &#233;valuation sur corpus &#8230; 
</p>
<p>&#8226; REA. Un corpus de comptes-rendus d&#8217;hospitalisation dans le domaine de la 
r&#233;animation chirurgicale (377 967 mots) : 646 cas valid&#233;s 
</p>
<p>&#8226; TRA. Le Code du travail de la l&#233;gislation fran&#231;aise (509 124 mots) : 1 150 cas 
valid&#233;s 
</p>
<p>Les r&#232;gles d&#8217;annotation sont les suivantes  : (1) ne pas valider de cas o&#249; il y a des erreurs 
d&#8217;analyse des modules ant&#233;rieurs, en pa rticulier des erreurs d&#8217;&#233;tiquetage, autrement dit on 
&#233;value le module de rattachement pr&#233;positionnel dans des contextes o&#249; les informations sur 
lesquelles il s&#8217;appuie sont justes ; (2) s e donner la possibilit&#233; de retenir comme valides deux 
recteurs pour une pr&#233;position donn&#233;e, en particulier pour les constructions &#224; verbe support 
(apporter une aide &#224;) ; (3) ne pas valider certains cas trop r&#233;p&#233;titifs, afin de ne pas sur 
repr&#233;senter un cas trop sp&#233;cifique au corpus, comme par exemple dans le corpus CTRA, o&#249; les 
cas de rattachement des participes pass&#233;s &#224; la pr&#233;position sont massifs (ex: d&#233;finir les 
modalit&#233;s vis&#233;es &#224; l&#8217;article ) ; (4) valider de mani&#232;re indiff&#233;renci&#233;e des groupes 
pr&#233;positionnels arguments ou circonstants. Ce dernier point est important, et peut pr&#234;ter &#224; 
controverse, si on ne replace pas la t&#226;che d&#8217;annotation dans le contexte de l&#8217;&#233;valuation des 
performances d&#8217;un analyseur syntaxique. La distinction argument/circonstant, ou co mpl&#233;ment 
essentiel/compl&#233;ment circonstanciel, ne fait pas l&#8217;objet d&#8217;un consensus dans la communaut&#233; 
linguistique. En dehors des cas trivaux, choisis en g&#233;n&#233;ral soigneusement pour illustrer cette 
distinction, la confrontation avec des &#233;nonc&#233;s r&#233;els met &#224; mal la clart&#233; de cette distinction 
(Fabre, Fr&#233;rot, 2002). Dans ces conditions, la t&#226;che essentielle d&#233;volue &#224; l&#8217;analyseur est 
d&#8217;abord de choisir le bon recteur parmi un ensemble de recteurs possibles, et ensuite 
seulement, et &#233;ventuellement, de distinguer le type de compl&#233;ment.  
</p>
<p>5 M&#233;thode de d&#233;sambigu&#239;sation 
L&#8217;algorithme de d&#233;sambigu&#239;sation mis en &#339;uvre dans le module choisir-candidat est simple. 
Nous comparons 4 strat&#233;gies diff&#233;rentes, selon le type des donn&#233;es de sous-cat&#233;gorisation 
qu&#8217;elles exploitent.  
</p>
<p>&#8226; Mode base. En mode base, le module choisir-candidat se contente de choisir comme 
recteur le premier candidat dans l&#8217;ordre lin&#233;aire de phrase, c&#8217;est -&#224;-dire le plus &#233;loign&#233; 
de la pr&#233;position5. 
</p>
<p>&#8226; Mode exog&#232;ne. En mode exog&#232;ne, le module choisir-candidat exploite le lexique de 
sous-cat&#233;gorisation construit &#224; partir du corpus LM10 (section 3). Il choisit le 
candidat dont la probabilit&#233; est la plus &#233;lev&#233;e. On distingue exog&#232;ne 1 et exog&#232;ne 2, 
selon que le lexique utilis&#233; est obtenu apr&#232;s la phase d&#8217;amor&#231;age ou apr&#232;s la phase de 
consolidation. 
</p>
<p>&#8226; Mode endog&#232;ne. En mode endog&#232;ne, le module choisir-candidat exploite le lexique 
de sous-cat&#233;gorisation construit &#224; partir du corpus en cours d&#8217;analyse 6. Avant 
</p>
<p>                                                 
</p>
<p>5
 Globalement - sur l&#8217;ensemble des corpus et sur l&#8217;ensemble des configurations d&#8217;ambigu&#239;t&#233; -, cette strat&#233;gie est 
</p>
<p>meilleure que celle qui choisirait le candidat le plus proche. 
</p>
<p>6
 Selon la m&#233;thode d&#233;crite dans la section 3, sans l&#8217;&#233;tape de consolidation. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Bourigault, C. Fr&#233;rot 
</p>
<p>d&#8217;exploiter les probabilit&#233;s de sous -cat&#233;gorisation, il exploite la liste des fr&#233;quences 
des triplets (w,p,w&#8217; ) construite par le module rechercher-candidats : si p est la 
pr&#233;position et w&#8217;  le mot qu&#8217;elle r&#233;git, le module choisit le candidat wi pour lequel la 
fr&#233;quence F(wi,p,w&#8217; ) est la plus &#233;lev&#233;e. Sinon, il choisit le candidat dont la probabilit&#233; 
endog&#232;ne est la plus &#233;lev&#233;e. 
</p>
<p>&#8226; Mode mixte. Le mode mixte est analogue au mode endog&#232;ne, &#224; ceci pr&#232;s que le 
module choisir-candidat choisit le candidat qui a la probabilit&#233; endog&#232;ne ou la 
probabilit&#233; exog&#232;ne la plus &#233;lev&#233;e. 
</p>
<p>Dans tous ces modes, la r&#232;gle par d&#233;faut est celle de la strat&#233;gie de base, &#224; savoir le choix du 
premier candidat.  
</p>
<p> BAL LMO REA TRA 
</p>
<p>base 83.0 70.3 59.9 65.5 
</p>
<p>endog&#232;ne 83.5 80.1 78.0 82.3 
</p>
<p>exog&#232;ne 1 85.7 85.5 65.3 85.9 
</p>
<p>exog&#232;ne 2 86.9 86.6 66.3 86.3 
</p>
<p>mixte 86.6 85.9 78.3 87.3 
</p>
<p>Tableau 2. Taux de pr&#233;cision (%) des diff&#233;rentes strat&#233;gies de d&#233;sambigu&#239;sation 
sur les 4 corpus de test 
</p>
<p>6 R&#233;sultats et discussion 
Le tableau 2 donne les taux de pr&#233;cision des diff&#233;rentes strat&#233;gies de d&#233;sambigu&#239;sation 
sur les 4 corpus de test. On peut rapprocher ces r&#233;sultats de ceux, r&#233;capitul&#233;s dans (Pantel et 
Lin, 1998), obtenus sur 3 000 cas ambigus extraits de la partie Wall Street Journal du Penn 
TreeBank par diff&#233;rentes m&#233;thodes :  81,6% avec une m&#233;thode supervis&#233;e utilisant un mod&#232;le 
d&#8217;entro pie maximale (Ratnaparkhi et al., 1994), 88,1% avec une m&#233;thode supervis&#233;e utilisant 
un dictionnaire s&#233;mantique (Stetina, Nagao, 1997) et 84.3% avec une m&#233;thode non supervis&#233;e 
utilisant des mots distributionnellement proches (Pantel, Lin, op.cit.). Etant donn&#233; que les 
langues, le type de corpus de test et les conventions d&#8217;annotations sont diff&#233;rentes, il est 
d&#233;licat de comparer ces chiffres avec ceux que nous pr&#233;sentons dans le tableau 4. Ceux-ci 
doivent &#234;tre analys&#233;s de fa&#231;on autonome et contrastive. Notons d&#8217;abord que les r&#233;sultats des 
strat&#233;gies exog&#232;nes 1 et 2 justifient l&#8217;int&#233;r&#234;t d&#8217;acqu&#233;rir les informations de sous -cat&#233;gorisation 
en 2 &#233;tapes (amor&#231;age et consolidation, section 3). Le corpus m&#233;dical (REA), qui est le plus 
sp&#233;cialis&#233; des 4 corpus de test, pr&#233;sente un comportement particulier. Sur ce corpus, les 
performances des diff&#233;rentes strat&#233;gies sont globalement moins bonnes que sur les 3 autres 
corpus, ce qui illustre le point que nous avons &#233;voqu&#233; au d&#233;but de cet article, &#224; propos de la 
sensibilit&#233; des r&#233;sultats des analyseurs aux genres des textes. Par ailleurs, la strat&#233;gie de base 
donne de tr&#232;s mauvais r&#233;sultats sur ce corpus, alors qu&#8217;ils sont particuli&#232;rement bons sur le 
corpus litt&#233;raire. C&#8217;est uniquement sur le corpus m&#233;dical qu&#8217;appara&#238;t, de fa&#231;on nette, la </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Acquisition et &#233;valuation sur corpus &#8230; 
</p>
<p>n&#233;cessit&#233; d&#8217;exploiter des probabilit&#233;s de sous -cat&#233;gorisation sp&#233;cifiques au corpus 
(apprentissage endog&#232;ne). Sur ce corpus, la strat&#233;gie endog&#232;ne donne de meilleurs r&#233;sultats 
que la strat&#233;gie exog&#232;ne, et la strat&#233;gie mixte est tr&#232;s l&#233;g&#232;rement sup&#233;rieure &#224; la strat&#233;gie 
endog&#232;ne. Sur les corpus litt&#233;raire et journaliste, la strat&#233;gie exog&#232;ne est meilleure que la 
strat&#233;gie mixte. 
</p>
<p>Les ressources de sous-cat&#233;gorisation syntaxique construites &#224; partir du corpus LM10 sont 
exploit&#233;es par l&#8217;analyseur  sans avoir &#233;t&#233; valid&#233;es manuellement, et les r&#233;sultats montrent 
qu&#8217;elles sont performantes pour cette t&#226;che. Il convient de pr&#233;ciser que, sur le plan 
linguistique, ces propri&#233;t&#233;s de sous-cat&#233;gorisation ne sont pas comparables aux descriptions 
que l&#8217;on peu t trouver dans des lexiques construits &#224; la main, comme le Lexique Grammaire, 
dans les dictionnaires de langue ou dans les &#233;tudes de psycholinguistique. C&#8217;est 
particuli&#232;rement vrai pour les verbes. La probabilit&#233; qu&#8217;a un verbe de sous -cat&#233;goriser telle 
pr&#233;position est calcul&#233;e &#224; partir de toutes les occurrences (lemmatis&#233;es) de ce verbe, sans 
distinction des diff&#233;rentes acceptions du verbe, alors que l&#8217;on sait qu&#8217;un m&#234;me verbe peut 
avoir des cadres de sous-cat&#233;gorisation diff&#233;rents selon ses diff&#233;rents sens. Dans le contexte 
du d&#233;veloppement d&#8217;un analyseur syntaxique &#171;  tout terrain &#187;, l&#8217;approximation &#224; laquelle 
conduit ce lissage des sens est un mal n&#233;cessaire.  
</p>
<p>R&#233;f&#233;rences 
A&#207;T-MOKTAR S., CHANOD J.-P, ROUX C. (2002), Robustness beyond shallowness : 
incremental deep parsing, Natural Language Engineering Journal, 8(2/3):121-147 
</p>
<p>BASILI R., PAZIENZA M.-T., VINDIGNI M. (1999), Adaptative Parsing and Lexical Learning, 
Proceedings of VEXTAL&#8217;99 , Venise 
BASILI R., VINDIGNI M. (1998), Adapting a Subcategorization Lexicon to a Domain, 
Proceedings of the ECML98 Workshop TANLPS, Chemnitz, Germany 
BOURIGAULT D. (1993), An endogenous Corpus Based Method for Structural Noun Phrase 
Disambiguation, In Proceedings of the 6th Conference of the European Chapter of ACL 
(EACL), pp. 81-86, Utrecht, The Netherlands 
</p>
<p>BOURIGAULT D., FABRE C. (2000), Approche linguistique pour l&#8217;analyse syntaxique de 
corpus, Cahiers de Grammaire, 25, Universit&#233; Toulouse le Mirail, pp. 131-151 
</p>
<p>CHARNIAK E. (1997), Statistical Parsing with a Contexte-Free Grammar and Word Statistics. 
Proceedings of the AAAI97 Conference, Browne University, Rhode Island, pp.598-603 
FABRE C., FR&#201;ROT C (2002), Groupes pr&#233;positionnels arguments ou circonstants : vers un 
rep&#233;rage automatique en corpus. Actes de la Conf&#233;rence TALN, pp. 215-224. 
</p>
<p>FR&#201;ROT C. (2005), Etude en corpus vari&#233;s sur l&#8217;int&#233;gration de ressources linguistiques 
g&#233;n&#233;rales dans un analyseur syntaxique, Th&#232;se en sciences du langage de l&#8217;Universit&#233; 
Toulouse le Mirail </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D. Bourigault, C. Fr&#233;rot 
</p>
<p>FR&#201;ROT C., BOURIGAULT D., FABRE C. (2003), Marier apprentissage endog&#232;ne et ressources 
exog&#232;nes dans un analyseur syntaxique de corpus. Le cas du rattachement verbal &#224; distance de 
la pr&#233;position &#171; de &#187;,  in Revue t.a.l., 44-3 
</p>
<p>GALA PAVIA N. (2003), Un mod&#232;le d&#8217;analyseur syntaxique robuste bas&#233; sur la modularit&#233; et 
la lexicalisation de ses grammaires, PhD, University of Paris XI, Orsay 
</p>
<p>GILDEA D. (2001), Corpus Variation and Parser Performance. In Lillian Lee and Donna 
Harma, editors, in Proceedings of the 2001 Conference on Empirical Methods in Natural 
Language Processing, pp. 167-202 
</p>
<p>HINDLE D., ROOTH M. (1993), Structural Ambiguity and Lexical Relations. Computational 
Linguistics, 19(1):103-120 
</p>
<p>KILGARRIFF A.,  GREFENSTETTE G. (2003), Introduction to the special issue of Web as 
Corpus. Computational Linguistics, 29:3, pp. 333-338 
</p>
<p>MANNING C. (1993), Automatic Acquisition of Large Subcategorization Dictionary from 
Corpora, Proceedings of the 31st Meeting of the Association for Computational Linguistics, 
Columbus 
</p>
<p>PANTEL P., LIN D. (2000), An unsupervised approach to prepositional phrase attachment 
using contextually similar words. In K. VijayShanker and Chang-Ning Huang, editors, 
Proceedings of the 38th Meeting of the Association for Computational Linguistics, pp. 101-
108, Hong Kong 
</p>
<p>RATNAPARKHI A., REYNAR J., ROUKOS S. (1994), A Maximum Entropy Model for 
Prepositional Phrase Attachment. Proceedings of the ARPA Workshop on Human Language 
Technology, Morgan Kaufmann 
</p>
<p>ROLAND D., JURAFSKY, D. (1998). How Verb Subcategorization Frequencies Are Affected By 
Corpus Choice. Proceedings of Coling-ACL, pp. 1122-1128 
SEKINE S. (1997), The domain dependence of parsing. Proceedings of the Fith Conference on 
Applied Natural Language Processing, pp. 96-102 
</p>
<p>SLOCUM J. (1986), How one might Automatically Identify and Adapt to a Sublanguage: An 
Initial Exploration, in Grishman R. and Kittredge R., eds., Analyzing Language in Restricted 
Domains: Sublanguage Description and Processing. Lawrence Erlbaum Associates, 
Hillsdale, N.J., 1986, pp. 195-210 
</p>
<p>STETINA J., NAGAO M. (1997), Corpus-based PP attachment ambiguity resolution with a 
semantic dictionary. In J. Zhou and K. Church editors, Proceedings of the 5th Workshop on 
Very Large Corpora, Beijing and Hongkong. </p>

</div></div>
</body></html>