<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Correction Automatique en temps r&#233;&#233;l, contraintes, m&#233;thodes et voies de recherche</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005
</p>
<p>Correction automatique en temps r&#233;el
Contraintes, m&#233;thodes et voies de recherche
</p>
<p>Roger Rainero
</p>
<p>                     Soci&#233;t&#233; Diagonal
1, Traverse des Brucs &#8211; Valbonne &#8212; Sophia Antipolis
</p>
<p>roger.r@prolexis.com
</p>
<p>Mots-cl&#233;s&#160;:
Correction automatique, temps r&#233;el, analyse syntaxique, grammaire de contraintes.
</p>
<p>R&#233;sum&#233;
Cet article expose un cas concret d&#8217;utilisation d&#8217;une grammaire de contraintes. Le produit qui les
applique a &#233;t&#233; commercialis&#233; en 2003 pour corriger automatiquement et en temps r&#233;el les fautes
d&#8217;accord pr&#233;sentes dans les sous-titres des retransmissions en direct des d&#233;bats du S&#233;nat du
Canada. Avant la mise en place du syst&#232;me, le taux moyen de fautes &#233;tait de l&#8217;ordre de 7 pour
100 mots. Depuis la mise en service, le taux d&#8217;erreurs a chut&#233; &#224; 1,7&#160;%.
</p>
<p>Nous expliquons dans ce qui suit les principaux atouts des grammaires de contraintes dans le
cas particulier des traitements temps r&#233;el, et plus g&#233;n&#233;ralement pour toutes les applications qui
n&#233;cessitent une analyse au fur et &#224; mesure du discours (c.-&#224;-d. sans attendre la fin des phrases).
</p>
<p>Keywords:
Automatic correction, real-time, syntactic analysis, grammar of constraints.
</p>
<p>Abstract
This article sets out a concrete use case of a grammar of constraints. The product which applies
them was commercialised in 2003 to automatically correct in real time the errors of agreement
present in the sub-titles of live televised debates from the Senate of Canada.
</p>
<p>Before the introduction of this system, the average rate of mistakes was in the order of 7 per 100
words. With the introduction of this system, the rate of errors has fallen to 1.7%.
</p>
<p>In the following section, we explain the main advantages of a grammar of constraints in the
specific case of real-time processing, and more generally for all applications which require an
analysis during the speech (that is, without waiting until the end of sentences).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Roger Rainero
</p>
<p>1. Expos&#233; du probl&#232;me
Le S&#233;nat du Canada diffuse certains de ses d&#233;bats en direct sur une cha&#238;ne de t&#233;l&#233;vision
sp&#233;cialis&#233;e. Chaque s&#233;nateur pouvant s&#8217;exprimer dans sa langue maternelle (fran&#231;ais ou anglais),
les interventions se succ&#232;dent indiff&#233;remment dans ces deux langues. Les t&#233;l&#233;spectateurs ont la
possibilit&#233; d&#8217;afficher des sous-titres, soit en fran&#231;ais, soit en anglais, mais lorsqu&#8217;une langue est
choisie, la totalit&#233; des d&#233;bats est transcrite dans cette langue (fonction l&#233;gale pour les
malentendants).
</p>
<p>Les sous-titrages fran&#231;ais sont obtenus par retranscription st&#233;notyp&#233;e soit directe (locuteur
fran&#231;ais) soit indirecte (locuteur anglais traduit simultan&#233;ment en fran&#231;ais, la st&#233;notypiste
enregistrant alors la traduction). Les st&#233;notypistes francophones et anglophones utilisent la
m&#234;me m&#233;thode de saisie mise au point en Am&#233;rique du Nord, tr&#232;s performante pour les langues
globalement phon&#233;tiques (o&#249; la majorit&#233; des lettres se prononcent). Cette m&#233;thode donne ainsi
d&#8217;excellents r&#233;sultats en anglais. Mais pour le fran&#231;ais qui comporte de nombreuses syllabes
finales muettes, les ajustements ont &#233;t&#233; longs et fastidieux, et la mise en ondes a &#233;t&#233; maintes fois
repouss&#233;e, &#224; la recherche d&#8217;un taux acceptable de transcription exacte. Les r&#233;sultats ont
r&#233;guli&#232;rement progress&#233; jusqu&#8217;en 2002, o&#249; ce taux a plafonn&#233; aux alentours de 93&#160;%. (sur 100
mots, seuls 93 &#233;taient corrects).
</p>
<p>Bien que ce taux paraisse tr&#232;s &#233;lev&#233;, il g&#233;n&#232;re un nombre d&#8217;incidents de lecture tr&#232;s au-del&#224; de ce
qui est acceptable. Il suffit, pour s&#8217;en convaincre, de constater qu&#8217;il correspond &#224; 8 fautes par
minute de lecture. Le S&#233;nat du Canada a alors fait un appel d&#8217;offres international dans le but de
trouver une solution automatique susceptible d&#8217;am&#233;liorer cette situation. La solution propos&#233;e
devait permettre de corriger automatiquement le plus grand nombre de fautes r&#233;siduelles
possibles, sans ajouter de fautes l&#224; o&#249; il n&#8217;y en a pas. Par ailleurs, l&#8217;automate devait s&#8217;intercaler
dans le processus d&#8217;acquisition du texte st&#233;notyp&#233; (logiciel Eclipse d&#233;j&#224; install&#233;) sans le ralentir
de fa&#231;on notable.
</p>
<p>La soci&#233;t&#233; Diagonal a soumissionn&#233; en proposant une adaptation sp&#233;cifique de ses moteurs
d&#8217;analyse d&#233;j&#224; utilis&#233;s dans les logiciels de correction ProLexis et Myriade. Cette solution
retenue par le S&#233;nat a &#233;t&#233; livr&#233;e en octobre&#160;2003.
</p>
<p>2. Exigences dynamiques de la correction automatique des sous-
titrages en temps r&#233;el
</p>
<p>Le syst&#232;me demand&#233; par le S&#233;nat imposait de faire les corrections au fur et &#224; mesure de la saisie,
c&#8217;est-&#224;-dire sans que l&#8217;on puisse attendre la fin des phrases. Cette obligation vient
essentiellement du direct&#160;: les sous-titres suivent &#224; peu pr&#232;s les paroles des orateurs. En th&#233;orie
donc, les corrections doivent &#234;tre faites quasi imm&#233;diatement apr&#232;s les fautes.
</p>
<p>En pratique, nous disposions des souplesses suivantes&#160;:
</p>
<p>&#8226; les diffusions sont en l&#233;ger diff&#233;r&#233; d&#8217;une &#224; deux secondes,
&#8226; les sous-titres sont d&#233;coup&#233;s en lignes qui ne partent &#224; l&#8217;antenne que lorsqu&#8217;elles sont pleines.
</p>
<p>Exemple avec la phrase&#160;: &#171;&#160;Les filles jouent aux billes, les gar&#231;ons jouent au ballon.&#160;&#187;
</p>
<p>Voici ce que saisit la st&#233;notypiste par tranche de 0,5 seconde (avec les fautes)&#160;:
</p>
<p>0,5 s Les
1,0 s Les fille
1,5 s Les fille joue
2,0 s Les fille joue au
2,5 s Les fille joue au bille,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Correction automatique en temps r&#233;el&#160;: contraintes, m&#233;thodes et voies de recherche
</p>
<p>3,0 s Les fille joue au bille, les
3,5 s Les fille joue au bille, les gar&#231;on
4,0 s Les fille joue au bille, les gar&#231;on joue
4,5 s Les fille joue au bille, les gar&#231;on joue au
5,0 s Les fille joue au bille, les gar&#231;on joue au ballon.
</p>
<p>Et voici ce que doit voir le t&#233;l&#233;spectateur (entre parenth&#232;ses, les corrections &#224; faire)&#160;:
</p>
<p>0 s (rien)
3 s LES FILLE(S) JOUE(NT) AU(X) BILLE(S),
6 s LES GAR&#199;ON(S) JOUE(NT) AU BALLON.
</p>
<p>L&#8217;automate doit corriger les fautes de la 1re ligne au plus tard au temps 5,0 (temps r&#233;el 3,0 + 2
secondes de diff&#233;r&#233;), c&#8217;est-&#224;-dire lorsque le 4e mot de la ligne suivante vient d&#8217;arriver. Pour la
premi&#232;re faute (fille), il dispose d&#8217;un retard de 7 mots, mais pour la derni&#232;re faute (bille), il ne
b&#233;n&#233;ficie plus que d&#8217;un retard de 4 mots. L&#8217;automate ignorant totalement &#224; quel moment les
lignes sont d&#233;clar&#233;es &#171;&#160;pleines&#160;&#187;, il est oblig&#233; de s&#8217;astreindre &#224; faire toutes ses corrections avec
un maximum de quatre mots de retard&#160;!
</p>
<p>C&#8217;&#233;tait bien l&#224; la plus grande difficult&#233; &#224; laquelle nous allions &#234;tre confront&#233;s.
</p>
<p>3. Les atouts des syst&#232;mes d&#8217;analyse bas&#233;s sur les contraintes
Ce qui a rendu la chose possible avec ProLexis tient dans le fait essentiel que notre moteur
exploite un principe de propagation de contraintes.
</p>
<p>Comme dans les principaux syst&#232;mes bas&#233;s sur la satisfaction de contraintes (cf. (Blache00)),
notre approche ne vise pas &#224; construire un arbre syntaxique de la phrase, mais plut&#244;t &#224; optimiser,
dans un r&#233;seau de contraintes, le chemin menant du premier au dernier mot de la phrase&#160;:
</p>
<p>&#8226; mot1(a) &#8226; mot2 (a) &#8226; mot3 (a) &#8226; mot4 (a) &#8226; etc.
&#8226; mot1(b) &#8226; mot2 (b) &#8226; mot3 (b) &#8226; mot4 (b)
&#8226; mot1(c) &#8226; mot2 (c) &#8226; mot3 (c) &#8226; mot4 (c)
&#8226; mot1(d) &#8226; mot3 (d)
</p>
<p>&#8226; mot3 (e)
</p>
<p>Sur ce sch&#233;ma, les contraintes ne sont pas figur&#233;es. Elles ne se manifestent qu&#8217;au travers du
choix du chemin affich&#233; qui est cens&#233; satisfaire le maximum d&#8217;entre elles.
</p>
<p>Chaque nouveau mot apporte son lot de variantes possibles, mais aussi son lot de contraintes
potentielles pour toutes les variantes &#233;tablies depuis le d&#233;but de la phrase&#160;:
&#10132; Appliquer une contrainte revient &#224; calculer son coefficient de satisfaction (son &#171;&#160;poids&#160;&#187;) dans
</p>
<p>toutes les variantes &#233;tablies.
&#10132; Propager une contrainte revient &#224; reconsid&#233;rer l&#8217;application des contraintes d&#233;j&#224; appliqu&#233;es,
</p>
<p>comme cons&#233;quence de l&#8217;arriv&#233;e du nouveau jeu de contraintes.
</p>
<p>Notre syst&#232;me ne construit donc pas un arbre, mais il pond&#232;re un r&#233;seau. &#192; la fin de la phrase,
un algorithme simple peut restituer l&#8217;arborescence de la structure syntaxique, si le besoin s&#8217;en
fait sentir, mais cela n&#8217;est pas n&#233;cessaire pour diagnostiquer les erreurs et les corriger.
</p>
<p>La pond&#233;ration est souple, dans la mesure o&#249; une contrainte mal satisfaite n&#8217;est qu&#8217;une
indication d&#8217;un &#233;cart par rapport &#224; la norme formalis&#233;e par cette contrainte. En ce sens, elle
produit des analyses robustes qui s&#8217;accommodent de d&#233;viances parfois fortes par rapport aux
usages ou m&#234;me de l&#8217;absence de certains mots.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Roger Rainero
</p>
<p>Tout cela est bien connu et caract&#233;rise les grammaires bas&#233;es sur les contraintes, mais n&#8217;est pas
d&#233;terminant dans le cas qui nous int&#233;resse.
</p>
<p>Le plus gros avantage de notre grammaire, dans le cadre de la correction automatique en temps
r&#233;el, provient de sa capacit&#233; &#224; d&#233;livrer une analyse pond&#233;r&#233;e des variantes apr&#232;s chaque mot. Bien
s&#251;r, l&#8217;analyse est r&#233;put&#233;e optimale lorsque tous les mots de la phrase sont connus, mais cette
analyse est n&#233;anmoins disponible en phase interm&#233;diaire apr&#232;s chaque mot.
</p>
<p>Enfin, le m&#233;canisme de propagation apr&#232;s chaque mot pr&#233;sente un autre avantage de taille dans le
cas de notre application &#171;&#160;temps r&#233;el&#160;&#187;&#160;: il permet, par un choix judicieux des coefficients de
pond&#233;ration, de marginaliser assez vite certaines variantes isol&#233;es et de limiter &#224; un niveau
raisonnable le nombre de variantes concurrentes que le logiciel &#233;value en parall&#232;le &#224; chaque
it&#233;ration.
</p>
<p>Ce m&#233;canisme peut m&#234;me s&#8217;autor&#233;guler en d&#233;truisant syst&#233;matiquement les variantes les moins
probables &#224; chaque passe, de telle sorte que leur nombre total reste en dessous d&#8217;un seuil
critique pour le temps d&#8217;ex&#233;cution.
</p>
<p>&#201;videmment, toutes ces actions aveugles sont pr&#233;judiciables &#224; la qualit&#233; de l&#8217;analyse in fine.
Toute la question &#233;tait de quantifier leur influence r&#233;elle sur la fiabilit&#233; des corrections attendues.
</p>
<p>4. Tests de fiabilit&#233; des r&#233;sultats interm&#233;diaires &#224; &#171;&#160;mot + 4 &#187;
Jusqu&#8217;&#224; pr&#233;sent, nous n&#8217;avions jamais test&#233; la fiabilit&#233; des r&#233;sultats interm&#233;diaires avant la fin de
la phrase. Il nous fallait donc v&#233;rifier que dans le contexte du S&#233;nat, nous disposions
effectivement de suffisamment d&#8217;indices pour d&#233;cider des corrections au maximum &#224; mot + 4.
</p>
<p>En th&#233;orie, en effet, tout nouveau mot dans une phrase peut changer totalement son analyse.
C&#8217;est un exercice bien connu auquel se livrent volontiers les professionnels de l&#8217;analyse
syntaxique. Et c&#8217;est aussi avec de tels exemples que l&#8217;on peut d&#233;montrer que ce que nous avons
fait est impossible. En voici quelques-uns&#160;:
</p>
<p>D&#233;but&#160;: Le chien regarde le chat et la souris&#8230;
Suite 1&#160;: Le chien regarde le chat et la souris mais&#8230;
Suite 2&#160;: Le chien regarde le chat et la souris prise&#8230;
Suite 2a&#160;: Le chien regarde le chat et la souris prise&#8230; (au pi&#232;ge&#160;?)
Suite 2b&#160;: Le chien regarde le chat et la souris prise&#8230; (du tabac&#160;?)
</p>
<p>Mais quelle est la port&#233;e statistique r&#233;elle d&#8217;un tel ph&#233;nom&#232;ne et quelle est son influence sur la
fiabilit&#233; d&#8217;un syst&#232;me de correction automatique apr&#232;s quatre mots&#160;?
</p>
<p>Pour l&#8217;estimer, nous avons fabriqu&#233; un prototype du produit fini simulant le comportement de
l&#8217;outil d&#8217;acquisition Eclipse. Ce logiciel lisait un extrait des d&#233;bats du S&#233;nat obtenu par
st&#233;notypie et l&#8217;envoyait signe &#224; signe &#224; l&#8217;automate qui gardait trace dans un fichier de sortie de
toutes les corrections faites et du moment o&#249; elles pouvaient &#234;tre faites.
</p>
<p>Le tableau suivant montre un extrait de ce fichier de sortie, concernant un d&#233;but de phrase telle
qu&#8217;elle est d&#233;livr&#233;e par Eclipse, fautes comprises (colonne de gauche). &#192; droite, les fautes
corrig&#233;es sont intercal&#233;es apr&#232;s le mot qui les rend possibles&#160;:</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Correction automatique en temps r&#233;el&#160;: contraintes, m&#233;thodes et voies de recherche
</p>
<p>Apr&#232;s la saisie de&#8230; Les corrections suivantes sont faites&#8230;
</p>
<p>Il faut &#233;galement des solution pratique qui&#8230; solution &#10132; solutions
pratique &#10132; pratiques
</p>
<p>soit sens&#233;&#8230; soit &#10132; soient
</p>
<p>pour&#8230; sens&#233; &#10132; sens&#233;es
</p>
<p>ceux qui travaille sur&#8230; travaille &#10132; travaillent
</p>
<p>On constate que les deux premi&#232;res erreurs &#171;&#160;solution&#160;&#187; et &#171;&#160;pratique&#160;&#187; sont corrig&#233;es d&#232;s la
saisie de &#171;&#160;qui&#160;&#187;, donc respectivement &#224; mot + 2 et mot + 1.
</p>
<p>Regardons de plus pr&#232;s les analyses qui sont faites &#224; ce stade&#160;: le mot &#171;&#160;pratique&#160;&#187; est ambigu&#160;:
ce peut &#234;tre un nom, un adjectif ou un verbe. Toutes ces formes g&#233;n&#232;rent potentiellement autant
de variantes. Les variantes verbales paraissent improbables, mais, comme toujours en pareil cas,
une petite r&#233;flexion permet d&#8217;en d&#233;couvrir certaines formes l&#233;gitimes&#160;:
</p>
<p>&#171;&#160;Il faut &#233;galement des solutions, pratique ce sport et tu verras&#160;!&#160;&#187;
&#171;&#160;Il faut &#233;galement des solutions(,) explique C&#233;sar&#8230;&#160;&#187;
</p>
<p>Bien s&#251;r, la virgule semble cruciale, mais la pond&#233;ration de son absence n&#8217;est pas suffisante ici.
En revanche, l&#8217;arriv&#233;e du mot suivant &#171;&#160;qui&#160;&#187; est d&#233;terminante, elle rend la flexion verbale pour le
mot &#171;&#160;pratique&#160;&#187; quasiment impossible. En th&#233;orie, la flexion verbale ne peut &#234;tre totalement
exclue, car l&#8217;hypoth&#232;se d&#8217;oubli d&#8217;un mot peut toujours la justifier. Mais les r&#233;glages actuels de
nos seuils de probabilit&#233;s pour des textes de provenance st&#233;notyp&#233;e font qu&#8217;elle est rejet&#233;e ici.
</p>
<p>La suite est compr&#233;hensible&#160;: d&#233;termin&#233; nominal, le groupe pr&#233;c&#233;dent est fautif sur l&#8217;accord GN.
Deux formes correctes sont possibles&#160;: &#171;&#160;une solution pratique&#160;&#187; et &#171;&#160;des solutions pratiques&#160;&#187;.
C&#8217;est l&#224; qu&#8217;interviennent des automates sp&#233;cialis&#233;s dans la correction automatique sp&#233;cifique du
S&#233;nat du Canada&#160;: ces automates choisissent de fa&#231;on probabiliste la correction au pluriel.
</p>
<p>Appliqu&#233; au texte de r&#233;f&#233;rence de 2&#160;000 mots fourni par le S&#233;nat, contenant 149 fautes et
correspondant &#224; un d&#233;bat r&#233;el de 20 minutes, le prototype a donn&#233; les r&#233;sultats suivants&#160;:
</p>
<p>Nombre de fautes corrig&#233;es&#160;: &#8230;avec un retard de&#160;:
</p>
<p>89
17
3
1
</p>
<p>1 mot
2 mots
3 mots
4 mots
</p>
<p>La faible incidence des situations ambigu&#235;s sur les corrections automatiques envisag&#233;es pour les
d&#233;bats du S&#233;nat du Canada paraissait donc confirm&#233;e, au moins sur le texte &#233;tudi&#233;. Et la
propagation de contraintes montrait l&#224; une capacit&#233; tout &#224; fait &#233;tonnante &#224; r&#233;soudre le probl&#232;me
pos&#233;. Restaient &#224; d&#233;montrer son efficacit&#233; et sa stabilit&#233; &#224; grande &#233;chelle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Roger Rainero
</p>
<p>5. M&#233;thode d&#8217;&#233;valuation &#224; grande &#233;chelle.
L&#8217;inconv&#233;nient des syst&#232;mes probabilistes est que leur comportement ne peut &#234;tre totalement
d&#233;duit de tests &#224; petite &#233;chelle. Typiquement, dans le cas du S&#233;nat, la nature m&#234;me des d&#233;bats
influe grandement sur le vocabulaire, les intervenants et donc sur les types de phrases
prononc&#233;es. Nul doute qu&#8217;un simple &#233;chantillon de 2&#160;000 mots ne pouvait repr&#233;senter
correctement la totalit&#233; des situations auxquelles devrait faire face l&#8217;automate apr&#232;s sa mise en
service.
</p>
<p>Apr&#232;s avoir &#233;t&#233; choisis par le S&#233;nat du Canada pour ex&#233;cuter le march&#233;, nous avons donc lanc&#233;
en parall&#232;le les deux r&#233;alisations suivantes&#160;: d&#8217;une part, le logiciel lui-m&#234;me (bien entendu), et
d&#8217;autre part, l&#8217;&#233;talonnage d&#8217;un corpus de 50&#160;000 mots destin&#233; &#224; valider les tests d&#8217;usine du
logiciel, avant sa livraison chez le client.
</p>
<p>Ce corpus a &#233;t&#233; extrait des transcriptions st&#233;notyp&#233;es de d&#233;bats r&#233;cents repr&#233;sentant un peu plus
de 10&#160;heures d&#8217;antenne r&#233;parties sur une p&#233;riode de deux mois. On ne s&#8217;est limit&#233; &#224; cette taille
que pour des contraintes de temps. Deux personnes ont travaill&#233; pendant un mois pour
s&#233;lectionner les textes, &#233;liminer les passages en double, d&#233;tecter les fautes et les baliser dans le
texte. Quelque 3&#160;500 fautes y ont &#233;t&#233; rep&#233;r&#233;es.
</p>
<p>L&#8217;application de l&#8217;automate sur ce corpus a corrig&#233; plus de 2&#160;500 fautes sur 3&#160;500, &#233;tablissant
un taux de reconnaissance &#224; grande &#233;chelle stable &#224; 98,31&#160;%. Sur ce m&#234;me corpus, l&#8217;automate
n&#8217;a introduit que 23 fautes, soit un taux moyen de surcorrection de 1/2100.
</p>
<p>6. Perspectives et voies de recherche
Il faut se m&#233;fier de l&#8217;id&#233;e fausse qui consiste &#224; penser que le temps d&#8217;ex&#233;cution n&#8217;est pas un
probl&#232;me majeur pour les algorithmes d&#8217;analyse automatique. On entend souvent dire&#160;: &#171;&#160;de
toute mani&#232;re, les machines iront de plus en plus vite et un jour viendra o&#249; les algorithmes lents
s&#8217;ex&#233;cuteront vite&#160;!&#160;&#187;.
</p>
<p>Tout cela est vrai, sauf pour les applications &#171;&#160;temps r&#233;el&#160;&#187;. La correction automatique des sous-
titrages est un exemple, mais il y en a bien d&#8217;autres. La reconnaissance vocale multilocuteur et la
traduction simultan&#233;e sont deux domaines qui pointent d&#233;j&#224; &#224; l&#8217;horizon et qui n&#8217;attendent que
l&#8217;&#233;mergence de nouvelles technologies linguistiques pour se d&#233;ployer &#224; grande &#233;chelle.
</p>
<p>Le d&#233;coupage du m&#233;canisme d&#8217;analyse en strates successives ou le contr&#244;le int&#233;gr&#233; du nombre
de variantes concurrentes que permettent aujourd&#8217;hui les grammaires guid&#233;es par la satisfaction
de contraintes semble &#234;tre un atout de poids dans les applications temps r&#233;els.
</p>
<p>R&#233;f&#233;rences
Blache&#160;P. (2000) Le r&#244;le des contraintes dans les th&#233;ories linguistiques et leur int&#233;r&#234;t pour
l&#8217;analyse automatique, Actes de TALN 2000.
</p>
<p>Blache&#160;P. (2000) Constraints, Linguistic Theories and Natural Language Processing, Lecture
Notes in Artificial Intelligence, Springer-Verlag.
</p>
<p>Harper&#160;M.&#160;P., Helzerman&#160;R.&#160;A. (1995). Extensions to constraint dependency parsing for spoken
language processing. Computer Speech and Language, Vol. 9 (3), pp 187-234.
</p>
<p>Maruyama,&#160;H. (1990). Constraint dependency grammar and its weak generative capacity.
Computer Software.</p>

</div></div>
</body></html>