<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Structure des repr&#233;sentations logiques et interface s&#233;mantique-syntaxe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Structure des repr&#233;sentations logiques, 
polarisation et sous-sp&#233;cification 
</p>
<p>Sylvain Kahane 
</p>
<p>Modyco, Universit&#233; Paris 10 
Lattice, Universit&#233; Paris 7 
</p>
<p> sk@ccr.jussieu.fr 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
Cet article s&#8217;int&#233;resse &#224; la structure des repr&#233;sentations logiques des &#233;nonc&#233;s en langue 
naturelle. Par repr&#233;sentation logique, nous entendons une repr&#233;sentation s&#233;mantique incluant 
un traitement de la port&#233;e des quantificateurs. Nous montrerons qu&#8217;une telle repr&#233;sentation 
combine fondamentalement deux structures sous-jacentes, une structure &#171; pr&#233;dicative &#187; et une 
structure hi&#233;rarchique logique, et que la distinction des deux permet, par exemple, un 
traitement &#233;l&#233;gant de la sous-sp&#233;cification. Nous proposerons une grammaire polaris&#233;e pour 
manipuler directement la structure des repr&#233;sentations logiques (sans passer par un langage 
lin&#233;aire avec variables), ainsi qu&#8217;une grammaire pour l&#8217;interface s&#233;mantique-syntaxe. 
</p>
<p>This paper aims at the structure of logic representations in natural languages. By logic 
representation we mean a semantic representation including a quantifier scope processing. We 
show that such a representation basically combines two underlying substructures, a 
&#8220;predicative&#8221; structure and a logic hierarchic structure, and that the identification of the two 
allows for an elegant processing of underspecification. We will propose a polarized grammar 
that directly handles the structure of logic representations (without using a linear language 
with variables), as well as a grammar for the semantics-syntax interface. 
</p>
<p>Mots Cl&#233;s &#8211;Keywords 
Logique du premier ordre, calcul des pr&#233;dicats, repr&#233;sentation s&#233;mantique, relation pr&#233;dicat-
argument, quantificateur, grammaire d&#8217;unification polaris&#233;e, grammaire de d&#233;pendance, dag, 
interface syntaxe-s&#233;mantique. 
 
First order logic, predicate calculus, semantic representation, predicate-argument relation, 
quantifier, polarized unification grammar, dependency grammar, dag, syntax-semantics 
interface. 
</p>
<p>1 Introduction 
Les objectifs de cet article sont multiples. D&#8217;un point de vue math&#233;matique, il s&#8217;agit de mieux 
comprendre la structure des formules logiques du premier ordre (= formules du calcul des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane 
</p>
<p>pr&#233;dicats), notamment lorsque celles-ci sont utilis&#233;es comme repr&#233;sentations s&#233;mantiques 
d&#8217;&#233;nonc&#233;s en langue naturelle. Il s&#8217;agit en particulier de mieux comprendre la nature des 
quantificateurs et de leur port&#233;e. D&#8217;un point de vue linguistique, il s&#8217;agit de combiner deux 
modes de repr&#233;sentations utilis&#233;s en s&#233;mantique des langues naturelles : des repr&#233;sentations 
logiques, utilis&#233;es en s&#233;mantique non lexicale et issues des travaux de Frege et d&#8217;autres 
logiciens, et des repr&#233;sentations issues de la s&#233;mantique lexicale, qui traitent tous les signifi&#233;s 
lexicaux comme des pr&#233;dicats, y compris les quantificateurs et la n&#233;gation (cf. Dymetman &amp; 
Coperman 1996 pour une probl&#233;matique analogue). 
La section 2 introduira diff&#233;rentes &#171; &#233;critures &#187; pour une repr&#233;sentation logique et mettra en 
&#233;vidence les deux structures sous-jacentes, tandis que la section 3 proposera une grammaire 
permettant de manipuler directement de telles structures, de r&#233;aliser une interface s&#233;mantique-
syntaxe et de contr&#244;ler la sous-sp&#233;cification. 
</p>
<p>2 Repr&#233;sentation logique 
</p>
<p>2.1 Variations sur la repr&#233;sentation logique 
Cette section s&#8217;articulera autour des diff&#233;rents modes de repr&#233;sentation du sens d&#8217;un &#233;nonc&#233; 
comportant plusieurs quantificateurs. Nous travaillerons avec l&#8217;&#233;nonc&#233; suivant : 
</p>
<p>(1) Tout homme aime une femme. 
On lui associe g&#233;n&#233;ralement la repr&#233;sentation logique suivante : 
</p>
<p>(2) &#8704;x [homme'(x) &#8594; &#8707;y [femme'(y) &#8743; aimer'(x,y)]] 
</p>
<p>En s&#8217;autorisant la confusion entre un pr&#233;dicat et son extension, on peut utiliser la 
repr&#233;sentation suivante, plus proche de la langue naturelle : 
</p>
<p>(3) &#8704;x&#8712;homme' [&#8707;y&#8712;femme' aimer'(x,y)] 
</p>
<p>Dans une telle repr&#233;sentation, un quantificateur est li&#233; &#224; trois objets : une variable, une 
restriction (sur cette variable) et la port&#233;e. Pour le quantificateur &#8704; en (3), il s&#8217;agit 
respectivement de la variable x, de la restriction homme'(x) et de la sous-formule &#8707;y&#8712;femme' 
aimer'(x,y). De nombreuses approches en s&#233;mantique (Woods 1975, Copestake et al. 1999) 
rendent cette structure explicite en associant &#224; (1) la repr&#233;sentation suivante :   
</p>
<p>(4) tout'(x, homme'(x), un'(y, femme'(y), aimer'(x,y))) 
On pourra ainsi repr&#233;senter les autres quantificateurs (certains, quelques, la plupart de, etc.) 
de la m&#234;me fa&#231;on que tout et un, c&#8217;est-&#224;-dire par un pr&#233;dicat &#224; trois arguments. La formule en 
(4) poss&#232;de une structure arborescente que nous donnons en (5) : 
</p>
<p>(5)  
 
</p>
<p> 
 
</p>
<p> 
</p>
<p>La repr&#233;sentation des quantificateurs comme des pr&#233;dicats &#224; trois arguments est cons&#233;quente &#224; 
l&#8217;utilisation d&#8217;une variable li&#233;e, qui n&#8217;a pas de contribution s&#233;mantique, mais uniquement un 
r&#244;le structural en liant diff&#233;rentes positions de la formule. La variable n&#8217;est utile qu&#8217;en raison 
</p>
<p>y x 
</p>
<p>aimer' 
</p>
<p>y 
</p>
<p>y femme' 
</p>
<p>un' 
</p>
<p>x 
</p>
<p>x homme' 
</p>
<p>tout' </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure des repr&#233;sentations logiques 
</p>
<p>de l&#8217;&#233;criture lin&#233;aire1 de la formule en (4). On peut en effet supprimer la variable en (5) en 
associant &#224; (4) non pas un arbre, mais un dag2, c&#8217;est-&#224;-dire une structure r&#233;entrante o&#249; les 
diff&#233;rentes occurrences de la variable correspondent &#224; un seul n&#339;ud. Mais ce n&#339;ud fait alors 
double emploi avec le n&#339;ud de homme' et on peut consid&#233;rer que la variable x n&#8217;est en fait 
qu&#8217;une r&#233;ification de cet &#233;l&#233;ment s&#233;mantique. Ceci est assez coh&#233;rent avec le fait que le 
s&#233;mant&#232;me &#8216;homme&#8217;, le signifi&#233; du nom homme, repr&#233;sente en fait une entit&#233; (un objet du 
monde), qui m&#234;me s&#8217;il est ind&#233;termin&#233;, n&#8217;est pas en soi un pr&#233;dicat unaire (le pr&#233;dicat unaire 
homme' que nous avions introduit correspond &#224; l&#8217;expression &#234;tre un homme plut&#244;t qu&#8217;au nom 
homme proprement dit). Nous obtenons ainsi une nouvelle repr&#233;sentation pour (1)3 : 
</p>
<p>(6)   
 
</p>
<p> 
 
</p>
<p> 
</p>
<p>Bien que directement li&#233;e aux repr&#233;sentations logiques les plus classiques, cette repr&#233;sentation 
n&#8217;a jamais &#233;t&#233; propos&#233;e &#224; notre connaissance. Polgu&#232;re (1992) propose une repr&#233;sentation tr&#232;s 
similaire, en ajoutant &#224; une structure pr&#233;dicative (voir caract&#233;risation plus bas) un argument 
de port&#233;e pour les quantificateurs ; mais contrairement &#224; ici, la port&#233;e est explicitement 
repr&#233;sent&#233;e comme une portion de la structure pr&#233;dicative, alors que nous l&#8217;encodons, comme 
nous le verrons plus loin, par une relation hi&#233;rarchique. 
Dans cette nouvelle repr&#233;sentation, les quantificateurs (&#8216;tout&#8217; et &#8216;un&#8217;) sont explicitement des 
op&#233;rateurs &#224; deux arguments (cf. Barwise &amp; Cooper 1981). En fait, m&#234;me dans la 
repr&#233;sentation (4), en raison du caract&#232;re li&#233; de la variable, le quantificateur est aussi un 
op&#233;rateur &#224; deux arguments, dont on peut donner le lambda-terme &#955;P&#955;Q.[tout'(x,P(x),Q(x))], 
ou m&#234;me &#955;P&#955;Q.[tout'(&#955;x[P(x),Q(x)])], en explicitant le caract&#232;re li&#233; de la variable x. 
</p>
<p>Nous adopterons dor&#233;navant la repr&#233;sentation propos&#233;e en (6), que nous appellerons la 
repr&#233;sentation s&#233;mantique de l&#8217;&#233;nonc&#233; (1). Nous allons maintenant &#233;tudier plus en d&#233;tail la 
structure de cette repr&#233;sentation. Elle combine en fait deux sous-structures : une structure 
pr&#233;dicative et une structure hi&#233;rarchique li&#233;e &#224; la port&#233;e. 
</p>
<p>Notons auparavant que notre repr&#233;sentation s&#233;mantique n&#8217;est pas moins riche que la 
repr&#233;sentation logique traditionnelle (en (2), (3) ou (4)), puisqu&#8217;on peut revenir &#224; la 
repr&#233;sentation logique en r&#233;ifiant (&#224; la fa&#231;on de Davidson 1967 pour les &#233;v&#232;nements) les 
s&#233;mant&#232;mes sur lesquels pointent les quantificateurs, c&#8217;est-&#224;-dire en leur associant une 
variable, en leur ajoutant cette variable comme argument et en donnant cette variable comme 
argument aux pr&#233;dicats pointant sur eux (voir section 3.4 pour un exemple). 
                                                
1  On utilise aussi la variable pour d&#233;signer les r&#233;f&#233;rents de discours. N&#233;anmoins, cet usage devrait &#234;tre 
</p>
<p>nettement s&#233;par&#233; de l&#8217;autre, car dans ce deuxi&#232;me cas la variable renvoie &#224; un objet du monde et ne devrait 
pas figurer comme argument d&#8217;un s&#233;mant&#232;me, si l&#8217;on distingue sens et d&#233;notation. 
</p>
<p>2  On appelle dag un graphe orient&#233; acyclique (de l&#8217;anglais directed acyclic graph). 
3  La structure en (5) est un arbre ordonn&#233;, c&#8217;est-&#224;-dire que les fils de chaque n&#339;ud sont ordonn&#233;s, indiquant 
</p>
<p>ainsi pour chaque pr&#233;dicat quel est son premier (deuxi&#232;me &#8230;) argument. En (6), nous adoptons une autre 
convention : les diff&#233;rents arcs du graphe sont &#233;tiquet&#233;s pour indiquer les diff&#233;rentes places argumentales. 
Par ailleurs, comme nous le verrons, ce graphe est partiellement hi&#233;rarchis&#233; : les arcs droits correspondent &#224; 
la structure arborescente sous-jacente (la structure hi&#233;rarchique logique, section 2.2). 
</p>
<p>&#8216;&#8216;femme&#8217; 
</p>
<p>2 
</p>
<p>2 
</p>
<p>&#8216;aimer&#8217; 
</p>
<p>&#8216;un&#8217; 
</p>
<p>&#8216;homme&#8217; 
</p>
<p>&#8216;tout&#8217; 
1 
</p>
<p>1 
</p>
<p>1 
</p>
<p>2 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane 
</p>
<p>2.2 Repr&#233;sentation logique et structure pr&#233;dicative 
La structure que nous appelons pr&#233;dicative (qu&#8217;on aurait pu aussi appeler structure 
argumentale) est un graphe de relations pr&#233;dicat-argument, o&#249; les pr&#233;dicats repr&#233;sentent des 
s&#233;mant&#232;mes, c&#8217;est-&#224;-dire les signifi&#233;s des &#233;l&#233;ments lexicaux de l&#8217;&#233;nonc&#233;. Une telle structure 
est utilis&#233;e comme repr&#233;sentation s&#233;mantique par la th&#233;orie Sens-Texte (Mel&#8217;cuk 1988, 
Polgu&#232;re 1992, Kahane 2001). Une relation pr&#233;dicative correspond &#224; une relation actancielle 
ou modificative et doit &#234;tre &#171; valid&#233;e &#187; par une relation de d&#233;pendance syntaxique4. En tant 
que pr&#233;dicat s&#233;mantique, les quantificateurs n&#8217;ont qu&#8217;un argument : le nom qu&#8217;ils 
d&#233;terminent. La port&#233;e est d&#8217;une nature diff&#233;rente : cela n&#8217;aurait pas de sens de consid&#233;rer 
qu&#8217;il existe en (1) une relation pr&#233;dicative entre tout et un, car il n&#8217;y a aucune relation 
syntaxique entre eux. La structure pr&#233;dicative de (1) est donc : 
</p>
<p>(7)   
 
</p>
<p>Par d&#233;finition, la structure pr&#233;dicative est tr&#232;s proche de la structure syntaxique, lorsque celle-
ci est repr&#233;sent&#233;e par un arbre de d&#233;pendance syntaxique. Nous donnons en (8) l&#8217;arbre 
syntaxique de (1) ainsi que le graphe hi&#233;rarchis&#233; obtenu en superposant au graphe en (7) la 
hi&#233;rarchie de l&#8217;arbre syntaxique. 
</p>
<p>(8)   
 
 
 
</p>
<p>On voit que la structure syntaxique est en quelque sorte une hi&#233;rarchisation de la structure 
pr&#233;dicative. Or la repr&#233;sentation s&#233;mantique poss&#232;de &#233;galement une hi&#233;rarchie sous-jacente, 
mais celle-ci est diff&#233;rente et rend compte des relations de port&#233;e5. Nous donnons en (9) la 
structure hi&#233;rarchique logique de (1), ainsi que l&#8217;arbre de d&#233;composition de la formule 
logique en (3) : 
</p>
<p>(9)   
 
 
</p>
<p> 
 
</p>
<p>Comme on le voit en (9), c&#8217;est la structure hi&#233;rarchique que privil&#233;gie la repr&#233;sentation 
logique traditionnelle, au d&#233;triment de la structure pr&#233;dicative. On peut noter des distorsions 
                                                
4  Il existe en fait un certain nombre de distorsions possibles entre la structure pr&#233;dicative et la structure 
</p>
<p>syntaxique (Mel&#8217;cuk 1988, Kahane 2001). C&#8217;est le cas par exemple des ph&#233;nom&#232;nes de mont&#233;e, comme dans 
Pierre semble dormir, o&#249; la relation pr&#233;dicative entre &#8216;dormir&#8217; et &#8216;Pierre&#8217; est valid&#233;e par la relation 
syntaxique sujet entre semble et Pierre. 
</p>
<p>5  Nous laissons de c&#244;t&#233; une question fort int&#233;ressante, mais qui d&#233;passe le cadre de cet article. Il s&#8217;agit des 
liens entre la structure informationnelle et la structure logique. La th&#233;orie Sens-Texte n&#8217;a par exemple jamais 
introduit de structure hi&#233;rarchique explicite, consid&#233;rant que celle-ci n&#8217;est qu&#8217;une cons&#233;quence de la structure 
communicative et notamment de la partition th&#232;me-rh&#232;me (Polgu&#232;re 1992, Mel&#8217;cuk 2003). 
</p>
<p>&#8216;aimer&#8217; &#8216;un&#8217; 
</p>
<p>&#8216;homme&#8217; 
</p>
<p>&#8216;tout&#8217; 
1 1 1 
</p>
<p>2 
</p>
<p>&#8216;femme&#8217; 
</p>
<p>&#8216;homme&#8217; &#8216;femme&#8217; 
</p>
<p>&#8216;aimer&#8217; 
</p>
<p>&#8216;un&#8217; &#8216;tout&#8217; 
1 
</p>
<p>1 
</p>
<p>1 
</p>
<p>2 
</p>
<p>HOMME FEMME 
</p>
<p>AIMER 
</p>
<p>UN TOUT 
d&#233;t 
</p>
<p>suj 
</p>
<p>d&#233;t 
</p>
<p>cod 
</p>
<p>&#8216;femme&#8217; 
</p>
<p>2 
</p>
<p>2 
</p>
<p>&#8216;aimer&#8217; 
</p>
<p>&#8216;un&#8217; 
</p>
<p>&#8216;homme&#8217; 
</p>
<p>&#8216;tout&#8217; 
</p>
<p>1 2 
aimer' 
</p>
<p>&#8707;y 
</p>
<p>x 
</p>
<p>&#8704;x 
</p>
<p>y </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure des repr&#233;sentations logiques 
</p>
<p>notables entre la hi&#233;rarchie logique et la hi&#233;rarchie syntaxique, sources de r&#233;elles difficult&#233;s 
pour l&#8217;interface s&#233;mantique-syntaxe, lorsque la structure s&#233;mantique repose sur la hi&#233;rarchie 
logique comme en (2)-(4). La structure logique est d&#8217;ailleurs plus directement li&#233;e &#224; l&#8217;ordre 
lin&#233;aire qu&#8217;&#224; la structure syntaxique, &#224; notre avis. Ainsi, en (10)a et b, dans l&#8217;interpr&#233;tation 
pr&#233;f&#233;r&#233;e6, &#8216;tout&#8217; est dans la port&#233;e de &#8216;un&#8217;, &#224; l&#8217;inverse de (1), alors que l&#8217;ordre des 
quantificateurs dans la phrase est &#233;galement l&#8217;inverse de celui de (1) : 
</p>
<p>(10) a. Une femme est aim&#233;e de tout homme.  
b. Il y a une femme que tout homme aime. 
</p>
<p>La repr&#233;sentation s&#233;mantique que nous avons adopt&#233;e peut &#234;tre &#233;tendue, par exemple pour 
traiter des modifieurs. Dans un homme heureux, &#8216;heureux&#8217; sera trait&#233; comme un pr&#233;dicat 
unaire ayant comme argument &#8216;homme&#8217; et se trouvant dans la port&#233;e de &#8216;homme&#8217; (la relation 
pr&#233;dicat-argument et la port&#233;e auront des sens oppos&#233;s). Ce pr&#233;dicat peut lui-m&#234;me &#234;tre 
modifi&#233;, par exemple, par &#8216;tr&#232;s&#8217;. La portion de la repr&#233;sentation se trouvant dans la port&#233;e 
d&#8217;un s&#233;mant&#232;me repr&#233;sentant une entit&#233; restreint l&#8217;extension de ce s&#233;mant&#232;me et contribue &#224; 
la restriction du quantificateur portant sur cette entit&#233;7. 
</p>
<p>Nous allons maintenant proposer une grammaire permettant de g&#233;n&#233;rer nos repr&#233;sentations 
s&#233;mantiques, avant de l&#8217;&#233;tendre pour en faire une interface s&#233;mantique-syntaxe. 
</p>
<p>3 Une grammaire pour les repr&#233;sentations logiques 
 
</p>
<p>Nous allons proposer une grammaire &#171; lexicalis&#233;e &#187; pour les repr&#233;sentations logiques, c&#8217;est-&#224;-
dire une grammaire qui construit la repr&#233;sentation en combinant des morceaux de structure 
associ&#233;s aux diff&#233;rents s&#233;mant&#232;mes. Nous nous tournons vers un formalisme capable de 
manipuler des graphes, les grammaires d&#8217;unification polaris&#233;es (Kahane 2004). Nous 
rappelerons bri&#232;vement ce formalisme avant de pr&#233;senter notre grammaire s&#233;mantique. 
</p>
<p>3.1 Grammaires d'unification polaris&#233;es 
Les grammaires d'unification polaris&#233;es sont des grammaires permettant de g&#233;n&#233;rer des 
ensembles de structures finies. Une structure repose sur des objets. Par exemple, pour un 
graphe (orient&#233;), les objets sont les n&#339;uds et les arcs. Chaque arc est li&#233; &#224; deux n&#339;uds par les 
</p>
<p>                                                
6  Comme on le sait, il est possible qu&#8217;un quantificateur en deuxi&#232;me position ait une port&#233;e large. Par exemple 
</p>
<p>(10)a peut &#233;ventuellement recevoir la m&#234;me interpr&#233;tation que (1), mais une telle interpr&#233;tation est plus 
difficile d&#8217;acc&#232;s et doit &#234;tre conditionn&#233;e par le contexte ou les connaissances du monde. 
</p>
<p>7  Nous pouvons traiter d&#8217;autres types de restrictions, comme une relative ou une participiale. Ainsi, pour la 
phrase Tout homme aimant une femme est heureux, les relations de port&#233;es seront : 
</p>
<p>  &#8216;tout&#8217; &#63719;2&#8594; &#8216;heureux&#8217; &#63719;1&#8594; &#8216;homme&#8217; &#63719;&#8594; &#8216;un&#8217; &#63719;2&#8594; &#8216;aimer&#8217; &#63719;2&#8594; &#8216;femme&#8217;. 
 La relation de port&#233;e entre &#8216;homme&#8217; et la participiale est &#171; valid&#233;e &#187; par la relation pr&#233;dicative &#8216;aimer&#8217; &#63719;1&#8594; 
</p>
<p>&#8216;homme&#8217;, qui est dans le sens inverse (comme pour un adjectif). 
 Les syntagmes nominaux complexes, comme dans Tout locuteur de deux langues est heureux, posent un 
</p>
<p>probl&#232;me int&#233;ressant. Ici les relations de port&#233;es sont : 
  &#8216;tout&#8217; &#63719;2&#8594; &#8216;deux&#8217; &#63719;2&#8594; &#8216;heureux&#8217; &#63719;1&#8594; &#8216;locuteur&#8217; &#63719;1&#8594; &#8216;langue&#8217;. 
 Il est &#233;galement int&#233;ressant de comparer des exemples comme (i) Les soldats fatigu&#233;s se sont arr&#234;t&#233;s et 
</p>
<p>(ii) Les soldats, fatigu&#233;s, se sont arr&#234;t&#233;s. La structure pr&#233;dicative est la m&#234;me (&#8216;s&#8217;arr&#234;ter&#8217; &#63719;1&#8594; &#8216;soldat&#8217; 
&#8592;1&#63719; &#8216;fatigu&#233;&#8217;), mais, en (i) seulement, &#8216;fatigu&#233;&#8217; restreint la port&#233;e du quantificateur et doit &#234;tre dans la 
d&#233;pendance logique de &#8216;soldat&#8217;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane 
</p>
<p>fonctions source et cible. Ce sont ces fonctions qui fournissent la structure proprement dite. 
Une structure polaris&#233;e est une structure dont les objets sont polaris&#233;s, c&#8217;est-&#224;-dire &#233;tiquet&#233;s 
par une valeur appartenant &#224; un ensemble fini P de polarit&#233;s. L'ensemble P est muni d'une 
op&#233;ration commutative et associative not&#233;e &#171; . &#187;, appel&#233;e produit. Un sous-ensemble N de P 
contient les polarit&#233;s dites neutres. Une structure polaris&#233;e est dite neutre si tous ses objets 
sont neutres. 
Nous allons utiliser un syst&#232;me de polarit&#233;s P = 
{&#9679;,&#61602;,&#9679;}, avec N = {&#9679;,&#9679;}, et un produit d&#233;fini par 
le tableau suivant (o&#249; &#8869; repr&#233;sente l&#8217;impossibilit&#233; 
de se combiner). Nous appellerons nos polarit&#233;s &#9679; 
= noir = saturation, &#61602; = blanc = contexte 
(obligatoire) et &#9679; = gris = neutre absolu. 
</p>
<p> . &#9679; &#61602; &#9679; 
</p>
<p>&#9679; &#9679; &#61602; &#9679; 
&#61602; &#61602; &#61602; &#9679; 
&#9679; &#9679; &#9679; &#8869; 
</p>
<p>Les structures peuvent &#234;tre combin&#233;es par unification. L'unification de deux structures A et B 
donne une nouvelle structure A&#8853;B obtenue en &#171; collant &#187; ensemble ces structures par 
l'identification d'une partie des objets de la premi&#232;re structure avec ceux de la deuxi&#232;me. 
Lorsque deux structures polaris&#233;es A et B sont unifi&#233;es, la polarit&#233; d'un objet de A&#8853;B obtenu 
par identification de deux objets de A et B est le produit de leurs polarit&#233;s. 
Une grammaire d'unification polaris&#233;e (GUP) est d&#233;finie par une famille finie T de types 
d'objets (avec des fonctions attach&#233;es aux diff&#233;rents types d'objets), un syst&#232;me (P,.) de 
polarit&#233;s, un sous-ensemble N de P de polarit&#233;s neutres, et un ensemble fini de structures 
&#233;l&#233;mentaires polaris&#233;es, dont les objets sont d&#233;crits par T et dont une est &#233;ventuellement 
marqu&#233;e comme la structure initiale (et appel&#233;e top dans la suite). Les structures g&#233;n&#233;r&#233;es par 
la grammaire sont les structures neutres obtenues par combinaison de l&#8217;&#233;ventuelle structure 
initiale et d'un nombre fini de structures &#233;l&#233;mentaires. 
</p>
<p>Rappelons que le formalisme est monotone (avec l&#8217;ordre &#9679; &lt; &#61602; &lt; &#9679; sur les polarit&#233;s) et que 
les structures peuvent &#234;tre combin&#233;es absolument dans n&#8217;importe quel ordre. 
</p>
<p>3.2 Une grammaire s&#233;mantique 
Nous allons pr&#233;senter notre grammaire en plusieurs &#233;tapes pour en faciliter la compr&#233;hension 
et pour en montrer le caract&#232;re &#233;l&#233;mentaire. 
</p>
<p>La structure pr&#233;dicative est un graphe. Elle peut donc &#234;tre g&#233;n&#233;r&#233;e par une grammaire aussi 
simple que Gpr&#233;d, o&#249; chaque pr&#233;dicat ancre un morceau du graphe avec ses arguments : le 
n&#339;ud du pr&#233;dicat est satur&#233; et les positions des arguments doivent &#234;tre remplies et sont 
polaris&#233;es en blanc. 
</p>
<p> Gpr&#233;d 
</p>
<p> 
</p>
<p>Nous avons ajout&#233; une polarit&#233; suppl&#233;mentaire d : &#61602; et d : &#9679; sur certains n&#339;uds. La polarit&#233; 
d : &#61602; indique que ces s&#233;mant&#232;mes sont ind&#233;termin&#233;s. Un s&#233;mant&#232;me d&#8217;une entit&#233; d&#233;termin&#233;e, 
comme &#8216;Paul&#8217;, recevra une polarit&#233; d : &#9679;. La polarisation multiple fonctionne ainsi : si un 
objet A de polarit&#233;s (x,y) et un objet B de polarit&#233;s (z,t) sont identifi&#233;s, l&#8217;objet r&#233;sultant re&#231;oit 
le couple de polarit&#233;s (x.z,y.t). 
La structure logique est un arbre. La structure d&#8217;arbre est tr&#232;s facile &#224; encoder avec une GUP 
(Kahane 2004) : il suffit d&#8217;assurer que chaque &#233;l&#233;ment autre que la racine ait un unique 
</p>
<p>d : &#9679; 
</p>
<p>&#8216;aimer&#8217; &#8216;un&#8217; 
</p>
<p>&#8216;homme&#8217; 
</p>
<p>&#8216;tout&#8217; 
</p>
<p>1 
2 
</p>
<p>&#8216;femme&#8217; 
1 
</p>
<p>d : &#9679; 
</p>
<p>d : &#61602; d : &#61602; 1 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure des repr&#233;sentations logiques 
</p>
<p>gouverneur (la connexit&#233; &#233;tant elle assur&#233;e par d&#233;finition). Nous obtenons la grammaire Glog, 
o&#249; chaque s&#233;mant&#232;me ancre la racine d&#8217;un sous-arbre. Nous typons, selon l&#8217;usage, les n&#339;uds 
en deux classes : e pour les entit&#233;s et t pour les propositions (truth value). 
</p>
<p> top :  
</p>
<p> G log 
</p>
<p> 
</p>
<p>En superposant8 Gpr&#233;d et Glog, nous obtenons la grammaire s&#233;mantique Gs&#233;m = Gpr&#233;d &#215; Glog. Du 
fait de la superposition, chaque n&#339;ud h&#233;rite d&#8217;un couple de polarit&#233;. Un n&#339;ud qui n&#8217;appara&#238;t 
pas dans une des deux grammaires est consid&#233;r&#233; comme neutre absolu l&#224; o&#249; il n&#8217;appara&#238;t pas. 
Nous notons (&#61602;,&#9679;) =    et (&#9679;,&#61602;) =   . On remarquera que    et    se comportent comme des 
polarit&#233;s oppos&#233;s de type besoin-ressource. 
</p>
<p> top: 
</p>
<p> G s&#233;m 
</p>
<p> 
</p>
<p>Nous devons encore enrichir un peu Gs&#233;m pour assurer que la restriction d&#8217;un quantificateur 
est dans sa port&#233;e. Une GUP permet facilement de contr&#244;ler le chemin entre deux n&#339;uds : 
nous ajoutons pour cela un lien de dominance dans la structure du quantificateur entre la 
port&#233;e et la restriction. Une grammaire d&#233;di&#233;e permet de &#171; r&#233;&#233;crire &#187; ce lien de dominance en 
une cha&#238;ne de d&#233;pendance. On peut facilement contr&#244;ler la nature de cette cha&#238;ne, puisqu&#8217;une 
GUP peut simuler n&#8217;importe quelle grammaire de r&#233;&#233;criture (Kahane 2004). Nous donnons ci-
dessous la grammaire Gs&#233;m r&#233;vis&#233;e, avec les structures compl&#232;tes pour les quantificateurs et, &#224; 
droite, les deux r&#232;gles n&#233;cessaires &#224; la propagation de la dominance, o&#249; les liens de 
dominance sont repr&#233;sent&#233;s par des fl&#232;ches pointill&#233;es. 
</p>
<p> 
</p>
<p> G s&#233;m (r&#233;vis&#233;e) 
</p>
<p> 
 
</p>
<p>3.3 Interface s&#233;mantique-syntaxe 
Nous appelons interface s&#233;mantique-syntaxe une grammaire capable de faire se correspondre 
une repr&#233;sentation s&#233;mantique et une repr&#233;sentation syntaxique. La difficult&#233; de la t&#226;che vient 
du fait qu&#8217;il y a entre les deux repr&#233;sentations des distorsions importantes au niveau de la 
hi&#233;rarchie entre les &#233;l&#233;ments9. Le probl&#232;me a &#233;t&#233; &#233;tudi&#233; dans le cadre de nombreux 
                                                
8  Comme l&#8217;a fait remarquer un relecteur, la superposition des grammaires est un cas particulier de 
</p>
<p>synchronisation (voir section 3.3). Celle-ci est possible quand les deux grammaires manipulent les m&#234;mes 
objets. 
</p>
<p>9  Le fait que notre repr&#233;sentation syntaxique soit un arbre de d&#233;pendance plut&#244;t qu&#8217;un arbre syntagmatique ne 
change pas fondamentalement le probl&#232;me. Nous pr&#233;f&#233;rons pour notre part traiter la question de l&#8217;ordre 
lin&#233;aire s&#233;par&#233;ment et consid&#233;rer une structure syntaxique sans ordre lin&#233;aire. 
</p>
<p>(t) &#8216;aimer&#8217; (t) &#8216;un&#8217; (e) &#8216;homme&#8217; (t) &#8216;tout&#8217; 
</p>
<p>2 
</p>
<p>(e) &#8216;femme&#8217; 
2 
</p>
<p>(t) (t) 
 
</p>
<p>(e) (e) 
</p>
<p> 
</p>
<p>1 2 
(t) 
 
</p>
<p>(e) &#8216;femme&#8217; (e) 
</p>
<p> 
</p>
<p>(t) &#8216;aimer&#8217; (t) &#8216;un&#8217; 
(e) &#8216;homme&#8217; 
</p>
<p>(t) &#8216;tout&#8217; 
</p>
<p>1 2 
</p>
<p>(t) 
</p>
<p> 
(e) (e) 
</p>
<p> 
</p>
<p>d : &#9679; d : &#9679; d : &#61602; 
</p>
<p>d : &#61602; 
1 2 1 2 
</p>
<p>(e) 
</p>
<p>(t) 
</p>
<p> 
</p>
<p>(t) &#8216;tout&#8217; 
</p>
<p>(t) 
</p>
<p>d : &#9679; 
</p>
<p>1 2 
</p>
<p>(e) 
</p>
<p>(t) 
</p>
<p>(t) 
</p>
<p>(e) 
</p>
<p>(e) 
</p>
<p>(t) (t) &#8216;un&#8217; 
</p>
<p>(t) 
</p>
<p>d : &#9679; 
</p>
<p>1 2 
</p>
<p>(e) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane 
</p>
<p>formalismes &#224; commencer par la grammaire de Montague (1973). Celle-ci privil&#233;gie 
l&#8217;organisation logique, alors que des travaux plus r&#233;cents tendent &#224; favoriser l&#8217;organisation 
syntaxique, comme Copestake et al. 1999 avec HPSG ou Kallmeyer &amp; Joshi 1999 avec TAG. 
Pour notre part, nous r&#233;solvons le probl&#232;me de mani&#232;re triviale, en synchronisant notre 
grammaire s&#233;mantique avec une grammaire de d&#233;pendance syntaxique, sans privil&#233;gier aucun 
des deux niveaux de repr&#233;sentation. Seule la structure pr&#233;dicative est prise en compte dans 
cette interface s&#233;mantique-syntaxe (Is&#233;m-synt). En combinaison avec Gs&#233;m et Gsynt, elle permet 
de construire parall&#232;lement les repr&#233;sentations s&#233;mantiques et syntaxiques10. En GUP, la 
synchronisation de deux grammaires s&#8217;effectue simplement en alignant les deux grammaires 
et en synchronisant certains n&#339;uds (cf. Shieber &amp; Schabes 1990, Perrier 2004, Kahane &amp; 
Lareau 2005). La synchronisation est assur&#233;e par des liens dit de synchronisation qui 
obligeront, lorsqu&#8217;on identifie deux n&#339;uds dans une des structures, &#224; identifier les n&#339;uds qui 
sont synchronis&#233;s avec eux dans l&#8217;autre structure. L&#8217;obligation d&#8217;unifier les liens de 
synchronisation (et donc de synchroniser les &#233;l&#233;ments qu&#8217;ils relient) est encore une fois 
assur&#233;e par la polarisation (repr&#233;sent&#233;e dans des losanges). 
</p>
<p>I s&#233;m-synt      G s&#233;m+I s&#233;m-synt +G synt 
</p>
<p> 
</p>
<p> 
 
</p>
<p> 
</p>
<p>Notre grammaire est &#233;quivalente au niveau de l&#8217;expressivit&#233; aux autres interfaces s&#233;mantique-
syntaxe &#233;voqu&#233;es et s&#8217;apparente tout particuli&#232;rement &#224; la grammaire propos&#233;e par Perrier 
2004, qui est &#224; notre connaissance le premier &#224; avoir utilis&#233; une grammaire polaris&#233;e pour 
traiter les repr&#233;sentations logiques et la sous-sp&#233;cification. Notre grammaire peut &#234;tre utilis&#233;e 
pour l&#8217;analyse comme pour la synth&#232;se et sera compatible avec diverses proc&#233;dures. Une 
proc&#233;dure pour une GUP consiste &#224; donner un ordre dans le traitement des structures (par 
exemple suivre l&#8217;ordre impos&#233; par la hi&#233;rarchie logique ou syntaxique) et choisir un ordre 
dans la neutralisation des polarit&#233;s. L&#8217;un de ces ordres m&#233;rite quelques commentaires. 
</p>
<p>3.4 Sous-sp&#233;cification et neutralisation partielle 
Lorsqu&#8217;on utilise notre grammaire pour l&#8217;analyse, on remarque que la structure syntaxique ne 
permet pas de d&#233;cider quelle doit &#234;tre la port&#233;e respective des quantificateurs. Pour ne pas 
introduire une ambigu&#239;t&#233; qu&#8217;on n&#8217;a pas les moyens de r&#233;soudre, on peut pr&#233;f&#233;rer construire 
une repr&#233;sentation s&#233;mantique o&#249; la hi&#233;rarchie logique reste sous-sp&#233;cifi&#233;e. Cette question a 
&#233;t&#233; beaucoup &#233;tudi&#233;e dans la litt&#233;rature r&#233;cente (Reyle 1993, Bos 1995, Copestake et al. 1999, 
Kallmeyer &amp; Joshi 1999, Perrier 2004). Dans notre cadre, la solution est &#233;l&#233;mentaire : il suffit 
de ne pas chercher &#224; neutraliser les polarit&#233;s qui contr&#244;lent la hi&#233;rarchie logique (c&#8217;est-&#224;-dire 
</p>
<p>                                                
10  Notre grammaire syntaxique Gsynt a &#233;t&#233; d&#233;crite dans de nombreux articles (notamment Kahane 2001 et 
</p>
<p>Kahane &amp; Lareau 2005). Le fait que les noms doivent avoir un unique d&#233;terminant est ici assur&#233; par la 
polarit&#233; d de la grammaire s&#233;mantique. Il faut n&#233;anmoins noter que des &#233;l&#233;ments s&#233;mantiquement d&#233;termin&#233;s 
comme &#8216;Paris&#8217; ou &#8216;la France&#8217; peuvent &#234;tre ou non syntaxiquement d&#233;termin&#233;s (la France vs en France) et 
qu&#8217;un traitement syntaxique de la d&#233;termination doit venir compl&#233;ter le traitement purement s&#233;mantique. 
</p>
<p>(t) &#8216;tout&#8217; 
(e) (N) 
</p>
<p>d&#233;t 
</p>
<p>(D) TOUT (t) &#8216;tout&#8217; 
</p>
<p>1 
</p>
<p>(e) 
</p>
<p>(t) 
</p>
<p>d : &#9679; 
</p>
<p>1 2 (N) 
d&#233;t 
</p>
<p>(D) TOUT </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure des repr&#233;sentations logiques 
</p>
<p>de ne pas consid&#233;rer Gpr&#233;d lors de l&#8217;analyse). On obtient, pour (1) ou (10), la repr&#233;sentation 
s&#233;mantique sous-sp&#233;cifi&#233;e (11) (en version simplifi&#233;e &#224; droite, en mettant en vis-&#224;-vis les 
n&#339;uds qui fusionneront pour obtenir (6)), o&#249; comme on le voit les seules polarit&#233;s non neutres 
sont les polarit&#233;s blanches associ&#233;es &#224; la hi&#233;rarchie logique : 
</p>
<p>(11)  
 
</p>
<p> 
 
</p>
<p> 
 
</p>
<p> 
Autrement dit, l&#8217;interface syntaxe-s&#233;mantique est uniquement r&#233;alis&#233;e entre la structure 
syntaxique et la structure pr&#233;dicative. C&#8217;est ce que pr&#233;conise depuis les ann&#233;es 60 la th&#233;orie 
Sens-Texte, originellement con&#231;ue pour la traduction automatique, o&#249; la lev&#233;e des ambigu&#239;t&#233;s 
logiques est g&#233;n&#233;ralement inutile. 
Notons que la repr&#233;sentation s&#233;mantique en (11) peut &#234;tre traduite en une &#233;criture lin&#233;aire en 
r&#233;ifiant les diff&#233;rents n&#339;uds : p pour la racine, p1 et p2 pour les quantificateurs &#8216;tout&#8217; et &#8216;un&#8217;, e 
pour le pr&#233;dicat &#8216;aimer&#8217;, x et y pour les entit&#233;s &#8216;homme&#8217; et &#8216;femme&#8217; et h1 et h2 pour les port&#233;es 
des quantificateurs (h pour hole, d&#8217;apr&#232;s la Hole Semantics de Bos 1995) : 
</p>
<p>(12) top:p, p1:&#8216;tout&#8217;(x,h1), p2:&#8216;un&#8217;(y,h2), e:&#8216;aimer&#8217;(x,y), x:&#8216;homme&#8217;, y:&#8216;femme&#8217; 
ou encore avec une double r&#233;ification des entit&#233;s (en introduisant les variables a1 et a2) : 
</p>
<p>(13) top:p, p1:tout'(x,a1,h1), p2:un'(y,a2,h2), e:aimer'(x,y), a1:homme'(x), a2:femme'(y) 
Les relations de dominance, ainsi que la n&#233;cessit&#233; de neutraliser les trous h1 et h2, seront 
donn&#233;es par des conditions telles que : 
</p>
<p>(14) p &#8805; p1 &gt; h1 &#8805; e, p &#8805; p2 &gt; h2 &#8805; e, {p,h1,h2} = {e,p1,p2} 
M&#234;me si les deux repr&#233;sentations, (11) et (13)+(14) (qui est la repr&#233;sentation de Copestake et 
al. 1999) sont (quasiment) &#233;quivalentes, on peut voir un avantage &#224; utiliser des structures 
polaris&#233;es et &#224; ne pas utiliser d&#8217;&#233;criture lin&#233;aire for&#231;ant l&#8217;introduction de multiples variables. 
</p>
<p>4 Conclusion 
Notre contribution concerne la repr&#233;sentation s&#233;mantique des &#233;nonc&#233;s et tout particuli&#232;rement 
la structure logique, c&#8217;est-&#224;-dire la repr&#233;sentation des ph&#233;nom&#232;nes de port&#233;e. Nous n&#8217;avons 
pas r&#233;ellement abord&#233; de questions de logique, c&#8217;est-&#224;-dire la fa&#231;on dont nos repr&#233;sentations 
pouvaient servir directement &#224; un calcul logique. De ce point de vue, nous nous sommes 
couverts par la possibilit&#233; de revenir aux formules usuelles de la logique du premier ordre, 
mais une description directe de l&#8217;inf&#233;rence dans notre formalisme serait certainement 
int&#233;ressante. Notre objectif &#233;tait d&#8217;avoir une repr&#233;sentation qui soit &#224; la fois suffisante pour 
l&#8217;interpr&#233;tation logique, mais qui permette aussi un traitement ad&#233;quat d&#8217;autres ph&#233;nom&#232;nes 
s&#233;mantiques qui ne se manifestent pas en termes de port&#233;e. 
</p>
<p>Le v&#233;ritable point de notre contribution est d&#8217;avoir rappel&#233; que la structure s&#233;mantique des 
&#233;nonc&#233;s n&#8217;est pas lin&#233;aire et qu&#8217;il y a tout int&#233;r&#234;t dans ces conditions &#224; utiliser un langage qui 
</p>
<p>(t) 
</p>
<p>&#8216;aimer&#8217; 
</p>
<p>&#8216;tout&#8217; (t) 
</p>
<p>1 2 
</p>
<p>(t) 
</p>
<p>d : &#9679; 
(e) &#8216;femme&#8217; 
</p>
<p>(t) &#8216;un&#8217; 
</p>
<p>&#8216;homme&#8217; (e) 
d : &#9679; 
</p>
<p>1 2 2 1 
</p>
<p>(t) 
</p>
<p>(t) 
</p>
<p>&#8216;aimer&#8217; 
</p>
<p>&#8216;tout&#8217; 
</p>
<p>1 2 
</p>
<p>&#8216;femme&#8217; 
</p>
<p>&#8216;un&#8217; 
</p>
<p>&#8216;homme&#8217; 
</p>
<p>1 
2 
</p>
<p>2 1 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylvain Kahane 
</p>
<p>permette de manipuler directement des arbres, des graphes et des produits des deux. Nous 
avons ainsi montr&#233; qu&#8217;une repr&#233;sentation s&#233;mantique est la superposition d&#8217;une structure 
pr&#233;dicative et d&#8217;une structure hi&#233;rarchique encodant les relations de port&#233;e. Lorsqu&#8217;on ne 
privil&#233;gie plus la relation de port&#233;e, comme le fait la logique classique, il devient facile de 
d&#233;finir une repr&#233;sentation sous-sp&#233;cifi&#233;e en &#171; neutralisant &#187; une des deux structures 
seulement. 
</p>
<p>Remerciements 
Je remercie chaleureusement pour leurs commentaires Pascal Amsili, Laurence Danlos, Laura 
Kallmeyer, Fran&#231;ois Lareau, Guy Perrier, Alain Polgu&#232;re, Igor Mel&#8217;cuk, Beno&#238;t Sagot et les 
trois relecteurs de TALN. 
</p>
<p>R&#233;f&#233;rences 
BARWISE J. &amp; COOPER R. (1981), Generalized quantifiers and natural language, Linguistics and 
Philosophy, 4, 159-219. 
BOS J. (1995), Predicate Logic Unplugged, Tenth Amsterdam Colloquium.  
COPESTAKE A., FLICKINGER D. &amp; SAG I. A. (1999), Minimal Recursion Semantics : An Introduction, 
draft, 26 p. 
DAVIDSON D. (1967), The Logical Form of Action Sentences, in N. Rescher (ed.), The Logic of 
Decision and Action, University of Pittsburgh Press, 81-95. Reprinted in D. Davidson, Essays on 
Actions and Events, Oxford: Clarendon Press, 1990,105-122. 
DYMETMAN M., COPPERMAN M. (1996), Extended dependency structures and their formal 
interpretation, Proceedings CoLing, Copenhague. 
</p>
<p>KAHANE S. (2001), Grammaires de d&#233;pendance formelles et th&#233;orie Sens-Texte, Tutoriel, Actes TALN, 
vol. 2, 17-76. 
KAHANE S. (2004), Grammaires d'unification polaris&#233;es, Actes TALN, F&#232;s, 233-242. 
KAHANE S. &amp; LAREAU F. (2005), Grammaire d&#8217;Unification Sens-Texte : polarisation et modularit&#233;, 
Actes TALN, Dourdan, 10 p. 
KALLMEYER L. &amp; JOSHI A. (1999), Factoring predicate argument and scope semantics: Underspecied 
semantics with LTAG, Proceedings of the 12th Amsterdam Colloquium. 
MEL&#8217;CUK I. (1988), Dependency Syntax: Theory and Practice, SUNY Press. 
MEL&#8217;CUK I. (2003), Communicative Organisation of Natural Language, Benjamins. 
MONTAGUE R. (1973), The proper treatment of quantification in ordinary English, in J. Hintikka (&#233;d.), 
Approaches to Natural Language, 221-242, Reidel. 
PERRIER G. (2004), La s&#233;mantique dans les grammaires d'interaction, Actes TALN, F&#232;s, Maroc, 351-
360. 
POLGUERE A. (1992), Remarques sur les r&#233;seaux s&#233;mantiques Sens-Texte, in A. Clas (&#233;d.), Le mot, les 
mots, les bons mots, Presses de l&#8217;Universit&#233; de Montr&#233;al. 
REYLE U. (1993), Dealing with ambiguities by underspecification, Journal of semantics, 10, 123-179. 
SHIEBER S. M. &amp; SCHABES Y. (1990),  Synchronous tree-adjoining grammars, Proceedings CoLing, 
vol. 3, 253-258, Helsinki, Finland. 
WOODS W.A. (1975), What&#8217;s in a link: Foundations for semantic networks, in D. Bobrow &amp; A. 
Collins, Representation and Understanding&#8211;Studies in Cognitive Science, 55-82, Academic Press, 
Orlando. </p>

</div></div>
</body></html>