<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Utilisation de la structure morpho-syntaxique des phrases dans le r&#233;sum&#233; automatique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Utilisation de la structure morpho-syntaxique des phrases
dans le r&#233;sum&#233; automatique : compression de phrases
</p>
<p>narratives
</p>
<p>Mehdi Yousfi-Monod, Violaine Prince
LIRMM - CNRS - Universit&#233; Montpellier 2, UMR 5506
</p>
<p>161 rue Ada, 34392 Montpellier Cedex 5 - France
{yousfi, prince}@lirmm.fr
</p>
<p>Mots-clefs : r&#233;sum&#233; automatique, compression de phrases, analyse syntaxique
Keywords: automatic summarization, sentence compression, syntactic analysis
</p>
<p>R&#233;sum&#233; Nous proposons une technique de r&#233;sum&#233; automatique de textes par contraction
de phrases. Notre approche se fonde sur l&#8217;&#233;tude de la fonction syntaxique et de la position dans
l&#8217;arbre syntaxique des constituants des phrases. Apr&#232;s avoir d&#233;fini la notion de constituant, et
son r&#244;le dans l&#8217;apport d&#8217;information, nous analysons la perte de contenu et de coh&#233;rence discur-
sive que la suppression de constituants engendre. Nous orientons notre m&#233;thode de contraction
vers les textes narratifs. Nous s&#233;lectionnons les constituants &#224; supprimer avec un syst&#232;me de
r&#232;gles utilisant les arbres et variables de l&#8217;analyse morpho-syntaxique de SYGFRAN [Cha84].
Nous obtenons des r&#233;sultats satisfaisants au niveau de la phrase mais insuffisants pour un r&#233;-
sum&#233; complet. Nous expliquons alors l&#8217;utilit&#233; de notre syst&#232;me dans un processus plus g&#233;n&#233;ral
de r&#233;sum&#233; automatique.
</p>
<p>Abstract We propose an automated text summarization through sentence compression.
Our approach uses constituent syntactic function and position in the sentence syntactic tree.
We first define the idea of a constituent as well as its role as an information provider, before
analyzing contents and discourse consistency losses caused by deleting such a constituent. We
explain why our method works best with narrative texts. With a rule-based system using SYG-
FRAN&#8217;s morpho-syntactic analysis for French [Cha84], we select removable constituents. Our
results are satisfactory at the sentence level but less effective at the whole text level. So we
explain the usefulness of our system in a more general automatic summarization process.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi Yousfi-Monod, Violaine Prince
</p>
<p>1 Introduction
</p>
<p>La quantit&#233; d&#8217;informations disponibles sur Internet ou au sein de certaines entreprises, admi-
nistrations et laboratoires ne cesse de cro&#238;tre. Ce ph&#233;nom&#232;ne rend la recherche d&#8217;information
de plus en plus difficile. Le r&#233;sum&#233; automatique, visant &#224; r&#233;duire consid&#233;rablement la taille de
ces donn&#233;es, appara&#238;t comme une des solutions permettant, non seulement de faciliter cette re-
cherche en pr&#233;sentant un texte pertinent de plus petite taille, mais aussi de rendre plus rapide le
choix d&#8217;acceptation de la pertinence ou non d&#8217;un texte par rapport &#224; une requ&#234;te.
</p>
<p>La suppression des phrases estim&#233;es les moins pertinentes est une technique majoritaire parmi
l&#8217;ensemble des r&#233;sumeurs automatiques actuels. Ces approches travaillent &#224; un niveau de gra-
nularit&#233; grossier : la phrase. Pourtant dans de nombreux textes narratifs, certaines phrases sont
longues et peuvent r&#233;unir &#224; la fois des passages importants et d&#8217;autres moins importants. Pour
gagner en contraction, il devient donc n&#233;cessaire de p&#233;n&#233;trer dans les phrases afin d&#8217;&#233;liminer les
constituants1 les moins importants. L&#8217;id&#233;e centrale de notre recherche est de traquer les limites
de la contraction de textes par compression de phrases sans perte majeure d&#8217;information. L&#8217;ori-
ginalit&#233; de notre approche est de se baser conjointement sur la fonction syntaxique et la position
dans l&#8217;arbre syntaxique des constituants de la phrase pour s&#233;lectionner les constituants suppri-
mables. Nous ne tenons pas compte du contexte ni du cotexte d&#8217;une phrase dans son analyse :
seules les informations syntaxiques pr&#233;sentes dans la phrase sont utilis&#233;es.
</p>
<p>Dans la prochaine section, nous survolons les principales approches sur le r&#233;sum&#233; automatique
puis nous traitons de deux m&#233;thodes bas&#233;es sur la compression de phrases (section 2) ; nous
pr&#233;sentons ensuite notre approche (section 3), nous continuons en illustrant l&#8217;efficacit&#233; de notre
syst&#232;me par une exp&#233;rimentation bas&#233;e sur une application prototype appliqu&#233;e &#224; un texte du
genre conte (section 4) et enfin nous discutons sur les r&#233;sultats de cette exp&#233;rimentation et sur
les perspectives envisag&#233;es (section 5).
</p>
<p>2 La compression de phrases
</p>
<p>Une grande partie des techniques de r&#233;sum&#233; automatique proc&#232;de par extraction de segments
textuels. Ces m&#233;thodes sont fond&#233;es sur l&#8217;hypoth&#232;se &#171; qu&#8217;il existe, dans tout texte, des unit&#233;s tex-
tuelles saillantes &#187; [Min04]. Ces derni&#232;res repr&#233;sentent des points focaux, qui, soit expriment
l&#8217;apport s&#233;mantique du texte, soit permettent de le repr&#233;senter dans sa globalit&#233;. D&#232;s lors, le
r&#233;sum&#233; par extraction cherchera &#224; rep&#233;rer ces unit&#233;s saillantes et proposera un texte de taille
plus petite que le document initial qui garderait majoritairement ces unit&#233;s. Nous faisons &#233;ga-
lement l&#8217;hypoth&#232;se de l&#8217;existence de ces unit&#233;s ainsi que de leur int&#233;r&#234;t pour le r&#233;sum&#233;. Ce
seront les constituants dits gouverneurs, d&#233;finis en section 3.2, qui correspondront &#224; ces uni-
t&#233;s saillantes. Parmi ces techniques de r&#233;sum&#233;, une majorit&#233; utilise l&#8217;extraction de phrase cl&#233;s
[Luh58, BE97, GMCK00, BN00] pour produire le r&#233;sum&#233; final. Dans cet article nous nous in-
t&#233;ressons uniquement au r&#233;sum&#233; intra-phrase et plus pr&#233;cis&#233;ment &#224; la compression de phrases.
</p>
<p>[KM02] aborde le probl&#232;me de la compression de phrases en utilisant un mod&#232;le de canal
bruyant (noisy-channel model) qui consiste &#224; faire l&#8217;hypoth&#232;se (1) : la phrase &#224; comprimer
</p>
<p>1Nous appelons constituants les syntagmes des phrases, c&#8217;est-&#224;-dire toute unit&#233; de la phrase &#224; laquelle on peut
attribuer une fonction. Par exemple, prenons le groupe nominal &#8220;un m&#233;decin de famille&#8221;. Il est compos&#233; de deux
constituants : un groupe nominal &#8220;un m&#233;decin&#8221; et un groupe nominal pr&#233;positionnel &#8220;de famille&#8221;. Ce dernier a
un r&#244;le de modificateur du premier.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utilisation de la structure morpho-syntaxique des phrases dans le r&#233;sum&#233; automatique
</p>
<p>f&#251;t autrefois courte et l&#8217;auteur y a ajout&#233; des informations suppl&#233;mentaires (le bruit). Le but est
alors de retrouver ces informations pour les supprimer. Les auteurs utilisent un mod&#232;le proba-
biliste de type mod&#232;le de Bayes qu&#8217;ils entra&#238;nent sur un corpus de documents avec leur r&#233;sum&#233;.
Le moteur d&#8217;apprentissage a pour but de s&#233;lectionner les mots &#224; conserver dans la phrase com-
prim&#233;e. Une faible probabilit&#233; sera attribu&#233;e &#224; une phrase comprim&#233;e lorsque cette derni&#232;re sera
incorrecte grammaticalement ou aura perdu certaines informations comme la n&#233;gation. D&#8217;apr&#232;s
leur &#233;valuation, les r&#233;sultats sont assez concluants. Relativement aux compressions r&#233;alis&#233;es par
des &#234;tres humains, une l&#233;g&#232;re perte d&#8217;importance et de justesse grammaticale est observ&#233;e.
[Gre98] utilise la nature des syntagmes et propositions pour estimer leur importance, puis sup-
prime les moins importants pour produire les phrases compress&#233;es. La coherence obtenue est
&#233;videmment faible mais suffisante pour l&#8217;application souhait&#233;e qui est la r&#233;duction de textes
t&#233;l&#233;graphiques destin&#233;s &#224; &#234;tre lus par les mal voyants.
</p>
<p>Ces deux approches ne prennent pas en compte les informations sur la fonction syntaxique et la
position dans l&#8217;arbre syntaxique des constituants des phrases. Ces informations pourraient &#234;tre
grandement utiles dans l&#8217;aide au choix des constituants &#224; supprimer.
</p>
<p>[Lin03] a &#233;valu&#233; la qualit&#233; d&#8217;un r&#233;sum&#233; produit par extraction de phrases cl&#233;s puis compression
des phrases extraites. L&#8217;auteur conclut, d&#8217;apr&#232;s les r&#233;sultats de ses exp&#233;rimentations, qu&#8217;on ne
peut pas se fier &#224; une compression strictement bas&#233;e sur la syntaxe des phrases pour am&#233;liorer
la qualit&#233; des r&#233;sum&#233;s produits par extraction. Cependant, &#233;tant donn&#233; que l&#8217;auteur n&#8217;utilise
qu&#8217;une seule m&#233;thode (celle de [KM00]) pour comprimer les phrases, nous ne sommes pas
d&#8217;accord sur sa conclusion g&#233;n&#233;ralis&#233;e &#224; l&#8217;ensemble des m&#233;thodes de compression. Ce que
nous concluons c&#8217;est que la m&#233;thode de compression utilis&#233;e, qui, en pratique, m&#233;lange &#224; la
fois paradigme statistique, apprentissage, technique de &#8220;noyage&#8221; (dans le bruit) et structure
syntaxique, ne satisfait pas les contraintes de conservation du contenu. Notre approche diff&#232;re
grandement de celle de [KM00] sur au moins deux points : nos r&#232;gles de compression sont
produites manuellement, en relation avec des mod&#232;les linguistiques, puis mises en &#339;uvre, et
non inf&#233;r&#233;es automatiquement de fa&#231;on calculatoire. De plus, nous ne faisons pas l&#8217;hypoth&#232;se
de d&#233;part (1) de [KM02] qui pour nous est tr&#232;s discutable.
</p>
<p>3 La compression par &#233;lagage de l&#8217;arbre syntaxique
</p>
<p>Le point de d&#233;part de notre approche f&#251;t l&#8217;intuition que la fonction syntaxique et la position
dans l&#8217;arbre syntaxique des constituants des phrases jouaient un r&#244;le cons&#233;quent dans
l&#8217;importance de ces constituants pour la compr&#233;hension d&#8217;un texte. Cette intuition prend
ses racines dans l&#8217;analyse grammaticale logique enseign&#233;e depuis longtemps et dont on trouve
des manuels connus (citons Gr&#233;visse [Gre97] pour m&#233;moire). En effet, ne sont pas toujours
indispensables pour comprendre le sens principal de la phrase, certains &#233;pith&#232;tes, certains com-
pl&#233;ments circonstanciels, etc. Par exemple, dans la phrase &#171; Un chat gros et laid mange une
souris. &#187;, le groupe adjectival &#233;pith&#232;te &#8220;gros et laid&#8221; peut &#234;tre supprim&#233; sans nuire r&#233;ellement &#224;
la compr&#233;hension et &#224; l&#8217;int&#233;r&#234;t.
</p>
<p>Une autre approche se basant sur la fonction syntaxique est celle de [LBM04] qui travaille &#224; un
niveau de granularit&#233; tr&#232;s fin, nettement inf&#233;rieur &#224; la proposition. Dans le syst&#232;me des auteurs,
les fonctions syntaxiques des syntagmes sont extraites par un syst&#232;me &#224; base de r&#232;gles. Une
forme logique des phrases est produite et repr&#233;sent&#233;e par un arbre dont les noeuds sont les
syntagmes (ou des variables si des informations sont manquantes) et les ar&#234;tes les fonctions. &#192;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi Yousfi-Monod, Violaine Prince
</p>
<p>partir des relations entre les syntagmes, un graphe du document est cr&#233;&#233; sur lequel l&#8217;algorithme
Pagerank [BP98] est appliqu&#233; pour &#233;valuer l&#8217;importance de chaque noeud. Les noeuds les plus
importants sont ensuite extraits et fournis &#224; un module de g&#233;n&#233;ration de phrases qui produit le
r&#233;sum&#233; final. Leur syst&#232;me utilise la fonction syntaxique des syntagmes mais pas la structure
syntaxique des phrases2, ceci laisse au module de g&#233;n&#233;ration la lourde t&#226;che de produire des
phrases syntaxiquement et s&#233;mantiquement coh&#233;rentes. Notre syst&#232;me ne fait que supprimer
des sous-arbres de l&#8217;arbre syntaxique, ceci &#233;vite de tomber dans ces probl&#232;mes d&#8217;incoh&#233;rence.
</p>
<p>Notre approche n&#233;cessite un outil d&#8217;analyse morpho-syntaxique des phrases (section 3.1) et une
&#233;tude sur l&#8217;importance des constituants relativement &#224; leur fonction syntaxique et leur position
dans l&#8217;arbre syntaxique (section 3.2). Nous pr&#233;sentons l&#8217;architecture de notre syst&#232;me dans la
section 3.3.
</p>
<p>3.1 L&#8217;analyseur morpho-syntaxique
</p>
<p>Nous utilisons l&#8217;analyseur morpho-syntaxique du fran&#231;ais SYGFRAN, bas&#233; sur le syst&#232;me op&#233;-
rationnel SYGMART, tous deux d&#233;finis dans [Cha84]. SYGFRAN utilise un ensemble de r&#232;gles
de transformations d&#8217;&#233;l&#233;ments structur&#233;s, bas&#233;es sur les r&#232;gles de la grammaire fran&#231;aise, qui
permettent de transformer une phrase (texte brut) en un arbre syntaxique (&#233;l&#233;ment structur&#233;)
enrichi d&#8217;informations sur les constituants. Cet analyseur a les avantages suivant :
&#8211; la rapidit&#233; : la complexit&#233; d&#8217;analyse est en O(k &#8727; n &#8727; log2(n)) o&#249; k est le nombre de r&#232;gles
</p>
<p>et n la donn&#233;e textuelle. Il s&#8217;agit d&#8217;une limite sup&#233;rieure, car l&#8217;analyseur &#233;tant structur&#233; en
plusieurs grammaires ordonn&#233;es, le facteur multiplicatif r&#233;el est beaucoup plus petit que k.
Cela dit, m&#234;me ainsi, plus le texte est important, plus k est petit devant n. Aujourd&#8217;hui, SYG-
FRAN analyse un corpus de 220000 phrases en moins d&#8217;une demi-heure (avec un Pentium
IV 2,4Ghz, 4734 Bigomips, 1Go Ram).
</p>
<p>&#8211; la robustesse : SYGFRAN parvient &#224; obtenir une structure correcte pour au moins 30 % de
l&#8217;ensemble des diff&#233;rents cas de syntaxe des phrases du fran&#231;ais, pour les autres cas, SYG-
FRAN fournit une analyse partielle mais exploitable.
</p>
<p>&#8211; la production d&#8217;un arbre syntaxique : la plupart des syst&#232;mes actuels d&#8217;analyse syntaxique ne
r&#233;alisent qu&#8217;un simple marquage lin&#233;aire, ceux qui produisent un arbre sont tr&#232;s peu robustes
&#224; l&#8217;&#233;gard de l&#8217;ensemble des constructions syntaxiques existantes.
</p>
<p>SYGFRAN prend en entr&#233;e du texte brut et produit une structure parenth&#233;s&#233;e, correspondant
&#224; l&#8217;arbre morpho-syntaxique de chaque phrase du texte, dans laquelle de nombreuses variables
sont renseign&#233;es sur les diff&#233;rents natures, fonctions syntaxiques, formes canoniques, cat&#233;gories
grammaticales, temps, modes, genres, nombres, etc. des constituants.
</p>
<p>3.2 Fonction et Position
</p>
<p>Le test de suppression des constituants est abord&#233; par de nombreux ouvrages sur la grammaire
fran&#231;aise pour aider &#224; la d&#233;termination de la fonction syntaxique d&#8217;un constituant. Le test est
valid&#233; si la phrase r&#233;sultante reste grammaticalement coh&#233;rente. Cependant, les textes linguis-
tiques traitant de l&#8217;importance des constituants dans la phrase selon leur fonction syntaxique
sont beaucoup plus rares. Des recommandations sont fournies par les linguistes, mais pas de
r&#232;gle fondamentale. Nous avons donc proc&#233;d&#233; de la mani&#232;re suivante. Nous avons consid&#233;r&#233;
</p>
<p>2Les auteurs utilisent une structure logique diff&#233;rente de l&#8217;arbre syntaxique des phrases.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utilisation de la structure morpho-syntaxique des phrases dans le r&#233;sum&#233; automatique
</p>
<p>ces recommandations comme des hypoth&#232;ses de travail et nous avons cherch&#233; &#224; les &#233;tayer
empiriquement. Ainsi, Mel&#8217;c&#780;uk, dans son analyse du fran&#231;ais contemporain, parle de fonctions
syntaxiques dites de &#8220;gouvernement&#8221; (&#224; la suite des travaux de Chomsky). Sont gouverneurs
des constituants consid&#233;r&#233;s comme indispensables &#224; la coh&#233;rence grammaticale et s&#233;mantique
de la phrase. Ainsi, le sujet d&#8217;une phrase et son groupe verbal sont gouverneurs sur le plan de la
coh&#233;rence grammaticale.
</p>
<p>Consid&#233;rons la phrase simple suivante : &#171; Jean mange une pomme verte. &#187;. Le sujet &#8220;Jean&#8221;, s&#8217;il
est supprim&#233;, produit une phrase incoh&#233;rente. Comme il est atomique, on ne peut pas le r&#233;duire.
Le verbe &#8220;mange&#8221; &#233;galement. Si on supprime le compl&#233;ment d&#8217;objet direct, &#8220;une pomme verte&#8221;,
on a une phrase grammaticalement coh&#233;rente (car le verbe manger a une forme intransitive). En
revanche, on perd de l&#8217;information importante, vu que le verbe n&#8217;est pas utilis&#233; ici de mani&#232;re
intransitive. Il est sp&#233;cifiquement qualifi&#233;, il importe donc de lui restituer son compl&#233;ment, sur
lequel on regarde si on peut appliquer une fonction de restriction. Dans le constituant &#8220;une
pomme verte&#8221; il y a en r&#233;alit&#233; deux constituants, qui se divisent &#224; leur tour en gouverneur et non
gouverneur. Dans un groupe nominal adjectival, le nom est gouverneur et la restriction &#8220;une
pomme&#8221; par rapport &#224; &#8220;une pomme verte&#8221; ne perd pas en coh&#233;rence grammaticale et ne perd pas
sa fonction syntaxique. Ainsi la d&#233;termination du constituant secondaire se fait par rapport au
r&#244;le syntaxique. Trois niveaux de granularit&#233; sont consid&#233;r&#233;s, la phrase (qui peut comprendre
plusieurs propositions), la proposition (qui est d&#233;finie par un sujet, un verbe et &#233;ventuellement
un ou plusieurs compl&#233;ments) et le constituant nominal.
Voici les ordres d&#8217;importance (d&#233;croissante) des &#233;l&#233;ments &#224; chaque niveau de granularit&#233; :
&#8211; la phrase : la proposition principale, les propositions relatives tenant lieu de compl&#233;ment du
</p>
<p>verbe, les propositions relatives tenant lieu d&#8217;&#233;pith&#232;te et se trouvant g&#233;n&#233;ralement en apposi-
tion ;
</p>
<p>&#8211; la proposition : les sujets et verbes, les compl&#233;ments d&#8217;objet (directs et indirects), les com-
pl&#233;ments circonstanciels ;
</p>
<p>&#8211; le constituant nominal : les noms, les compl&#233;ments de noms, les adjectifs (&#233;pith&#232;tes).
L&#8217;id&#233;e est de dire que plus on descend dans la liste (par rapport &#224; une granularit&#233; donn&#233;e) plus
on a de chances de r&#233;aliser une compression sans perte de coh&#233;rence ni perte d&#8217;information.
Tout le probl&#232;me consiste &#224; savoir si on peut supprimer syst&#233;matiquement ou non des &#233;l&#233;ments
de granularit&#233; plus large comme les propositions relatives, si on peut supprimer les moins im-
portants des constituants (les compl&#233;ments circonstanciels par exemple), si on peut &#233;laguer des
constituants nominaux, et si ces actions peuvent &#234;tre relativement g&#233;n&#233;ralis&#233;es (grosso modo, &#224;
tout type de texte).
Pour cela, &#224; partir de textes de genres vari&#233;s, nous avons r&#233;alis&#233; des tests de suppression de cer-
tains constituants en fonction de leur fonction syntaxique (donc plut&#244;t la granularit&#233; &#8220;moyen-
ne&#8221;), en estimant les pertes de coh&#233;rence discursive et de contenu important dans les phrases
comprim&#233;es. Dans les textes du genre article scientifique ou &#233;nonc&#233; technique, chaque consti-
tuant se r&#233;v&#232;le avoir beaucoup plus d&#8217;importance que dans un texte narratif (roman, conte, ...).
La raison est que les auteurs de textes narratifs ajoutent de nombreuses informations &#224; caract&#232;re
essentiellement descriptif qui aident le lecteur &#224; &#234;tre transport&#233; dans l&#8217;histoire mais qui ne sont
pas indispensables &#224; la compr&#233;hension du c&#339;ur de l&#8217;histoire. Alors que dans un article scien-
tifique ou technique, chaque constituant a un r&#244;le important &#224; jouer dans la compr&#233;hension du
discours. Afin d&#8217;&#233;valuer les qualit&#233;s de la compression par suppression de constituants, nous
avons donc cherch&#233; &#224; la tester sur des corpus o&#249; elle avait un sens, en d&#8217;autre termes dans les
textes de type narratif, en se proposant ult&#233;rieurement de tester d&#8217;autres paradigmes pour les
textes scientifiques ou techniques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi Yousfi-Monod, Violaine Prince
</p>
<p>[Man04] aborde la probl&#233;matique du r&#233;sum&#233; de textes narratifs, en s&#8217;appuyant principalement
sur des indices temporels. Il &#233;tudie les &#233;v&#233;nements sur trois plans : la sc&#232;ne, l&#8217;histoire et l&#8217;in-
trigue, dans le but d&#8217;extraire les &#233;v&#233;nements cl&#233;s, sc&#232;nes cl&#233;s, et les intrigues saillantes. Il
compte sur les m&#233;thodes actuelles (bas&#233;es sur le marquage lexical, l&#8217;&#233;tude de la structure rh&#233;-
torique, l&#8217;analyse morpho-syntaxique, ...) et futures pour extraire les indices temporels n&#233;ces-
saires. Notre m&#233;thode actuelle ne tient compte que des informations syntaxiques.
</p>
<p>En supprimant dans une premi&#232;re passe les constituants les plus secondaires on obtient un r&#233;-
sum&#233; dont le contenu important est bien conserv&#233; mais dont la taille est grande. La compression
peut alors consister &#224; plusieurs passes jusqu&#8217;&#224; obtenir un rapport sp&#233;cifique ( taille/pertes ) du
r&#233;sum&#233; produit. Chaque constituant est supprim&#233; par &#233;lagage de l&#8217;arbre syntaxique. Apr&#232;s une
premi&#232;re passe, les arbres syntaxiques obtenus se r&#233;v&#232;lent &#234;tre de bons repr&#233;sentants des origi-
naux. Leur repr&#233;sentativit&#233; se d&#233;grade sensiblement apr&#232;s chaque passe.
</p>
<p>Nous avons not&#233; trois cat&#233;gories de constituants susceptibles d&#8217;&#234;tre supprim&#233;s selon leur fonc-
tion syntaxique et leur position : les compl&#233;ments circonstanciels, les &#233;pith&#232;tes et les apposi-
tions. Comme on peut le voir, ils sont de granularit&#233; moyenne. Les appositions, lorsqu&#8217;elles
se transforment en propositions relatives (compl&#233;ment de nom) deviennent de granularit&#233; plus
importante, et augmentent de ce fait le taux de compression obtenu.
</p>
<p>Les compl&#233;ments circonstanciels. De mani&#232;re g&#233;n&#233;rale, ce sont les CC de temps et de but
qui r&#233;pondent aux questions les plus importantes, &#224; savoir &#8220;Quand ?&#8221; et &#8220;Dans quel but ?&#8221;. Les
CC de lieu (questions &#8220;O&#249; ?&#8221;) ont leur importance principalement au d&#233;but du texte, lorsque le
d&#233;cor est pos&#233;. Ceux de mani&#232;re (questions &#8220;Comment ?&#8221;) et de cause (questions &#8220;Comment
est-ce arriv&#233; ?&#8221;) sont peu importants dans une majorit&#233; des cas. La fr&#233;quence d&#8217;apparition des
autres CC (comparaison, condition, cons&#233;quence, opposition, mesure, ...) &#233;tant assez faible, leur
suppression n&#8217;aboutit fr&#233;quemment qu&#8217;&#224; une petite perte de contenu. Certains g&#233;rondifs fonc-
tionnent comme des propositions subordonn&#233;es circonstancielles, nous les supprimons aussi.
L&#8217;importance des CC varie aussi selon la nature du verbe de la proposition. Dans le cas d&#8217;un
CC de lieu plac&#233; apr&#232;s le verbe &#8220;&#234;tre&#8221;, la suppression ne sera pas possible. Enfin nous avons
remarqu&#233; qu&#8217;un CC situ&#233; dans une phrase interrogative &#233;tait tr&#232;s important car la question porte
g&#233;n&#233;ralement sur lui.
</p>
<p>Les &#233;pith&#232;tes. Les adjectifs et groupes adjectivaux ont une fonction d&#8217;&#233;pith&#232;te. D&#8217;une mani&#232;re
comparable aux CC, lorsqu&#8217;un &#233;pith&#232;te est plac&#233; apr&#232;s le verbe &#8220;&#234;tre&#8221;, et plus g&#233;n&#233;ralement
apr&#232;s un verbe d&#8217;&#233;tat, son importance s&#8217;accro&#238;t consid&#233;rablement, rendant la suppression im-
possible. Enfin, nous avons not&#233; que lorsque l&#8217;&#233;pith&#232;te &#233;tait plac&#233; dans un groupe nominal dans
lequel le d&#233;terminant &#233;tait un article d&#233;fini, alors sa suppression &#233;tait difficile. Ceci est d&#251; au fait
que l&#8217;article d&#233;fini est utilis&#233; pour parler d&#8217;une entit&#233; particuli&#232;re et que les &#233;pith&#232;tes du nom
permettent de diff&#233;rencier cette entit&#233; des autres. Certaines propositions relatives ont aussi une
fonction d&#8217;&#233;pith&#232;te. Les relatives constituent, d&#8217;apr&#232;s Mann et Thompson [MT88], des informa-
tions sur le contexte, elle ne sont donc pas indispensables.
</p>
<p>Les appositions. L&#8217;apposition peut avoir des natures vari&#233;es, elle peut &#234;tre :
&#8211; un groupe nominal (&#171; Jean, le gourmand, aime les bonbons. &#187;),
&#8211; un pronom (&#171; Jean doit manger lui-m&#234;me les bonbons. &#187;),
&#8211; une proposition relative (&#171; Jean, qui aime les bonbons, a beaucoup de caries. &#187;),
&#8211; une proposition participale pr&#233;sent (&#171; Jean, aimant les bonbons, a beaucoup de caries. &#187;),
&#8211; une proposition participale pass&#233; (&#171; Jean, aim&#233; des enfants, fera un bon p&#232;re. &#187;),
&#8211; une proposition infinitive (&#171; Jean, manger des l&#233;gumes, cela m&#8217;&#233;tonnerait ! &#187;).
Dans les trois premiers cas, les constituants se suppriment sans difficult&#233;. Les propositions par-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utilisation de la structure morpho-syntaxique des phrases dans le r&#233;sum&#233; automatique
</p>
<p>ticipales sont aussi sujettes &#224; la suppression, mais une perte un peu plus importante de contenu
est &#224; noter. Dans le dernier cas, la suppression para&#238;t difficile car la proposition infinitive apporte
syst&#233;matiquement une information importante qui vient compl&#233;ter le sujet.
</p>
<p>3.3 Architecture
</p>
<p>L&#8217;architecture de notre syst&#232;me est pr&#233;sent&#233;e en figure 1. Du texte source sont produits les arbres
syntaxiques correspondant au r&#233;sultat de l&#8217;analyse faite par SYGFRAN. Ensuite, le module
de s&#233;lection/coloration de segments textuels utilise les informations suivantes pour effectuer la
s&#233;lection : le texte source, les arbres syntaxiques et les variables/valeurs fournis par SYGFRAN,
le seuil du rapport taille/pertes &#224; ne pas d&#233;passer fourni par l&#8217;utilisateur ou d&#233;fini par le type
d&#8217;application et l&#8217;ensemble des r&#232;gles de s&#233;lection des constituants pour effectuer les diff&#233;rentes
passes de s&#233;lection des constituants jusqu&#8217;&#224; satisfaction du rapport taille/pertes. Les constituants
s&#233;lectionn&#233;s sont ensuite supprim&#233;s.
</p>
<p>Texte source
</p>
<p>Arbres syntaxiques
et variables associ&#233;es
</p>
<p>Texte 
contract&#233;
</p>
<p>Texte color&#233;
</p>
<p>Si CC et ...
Si &#233;pith&#232;te et ...
Si apposition et ...
</p>
<p>R&#232;gles de s&#233;lection 
des constituants
</p>
<p>Utilisateur ou 
application
</p>
<p>Cycles de s&#233;lection
des constituants
</p>
<p>jusqu'&#224; satisfaction
du rapport taille / pertes
</p>
<p>Module de s&#233;lection
</p>
<p>passes
acc&#232;s au
</p>
<p>texte source
</p>
<p>utilisation
des arbres et
des variables
</p>
<p>application
des r&#232;gles
</p>
<p>transformation
SYGFRAN
</p>
<p>Suppression 
des
</p>
<p>constituants 
color&#233;s
</p>
<p>choix du rapport
taille / pertes
</p>
<p>FIG. 1 &#8211; Du texte source au texte contract&#233; : notre syst&#232;me de compression de phrases
</p>
<p>4 Exp&#233;rimentations
</p>
<p>Nous avons r&#233;alis&#233; un programme prototype afin de pouvoir mesurer l&#8217;efficacit&#233; d&#8217;une telle ap-
proche. Nous avons d&#233;fini un syst&#232;me utilisant des r&#232;gles simples, bas&#233;es sur les r&#233;sultats de
notre &#233;tude exp&#233;rimentale (section 3.2). Chaque r&#232;gle poss&#232;de un nom auquel on associe un
ensemble de couples (cl&#233;,valeur). Chaque nom repr&#233;sente un type de constituant susceptible
d&#8217;&#234;tre supprim&#233;. Les couples (cl&#233;,valeur) sont les contraintes qu&#8217;un constituant doit respecter
pour &#234;tre s&#233;lectionn&#233; &#224; la suppression. Notre syst&#232;me actuel poss&#232;de trois types de contraintes :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi Yousfi-Monod, Violaine Prince
</p>
<p>une sur la valeur de la variable du constituant fournie par SYGFRAN (par exemple, le consti-
tuant doit &#234;tre un compl&#233;ment circonstanciel), une sur la position du constituant par rapport &#224;
un autre constituant relativement &#224; un n&#339;ud p&#232;re sp&#233;cifique (par exemple, le constituant ne doit
pas &#234;tre &#224; droite d&#8217;un verbe d&#8217;&#233;tat) et une sur la position du constituant par rapport &#224; un ant&#233;c&#233;-
dent poss&#233;dant une valeur sp&#233;cifique &#224; une cl&#233; (par exemple, le constituant ne doit pas &#234;tre un
sous-constituant d&#8217;une phrase interrogative).
Notre prototype actuel n&#8217;effectue qu&#8217;une passe. Nous comptons cr&#233;er par la suite des r&#232;gles
param&#233;trables afin de g&#233;rer plusieurs rapports de taille/pertes dans la production du r&#233;sum&#233;. La
premi&#232;re phase consiste &#224; colorier les constituants susceptibles d&#8217;&#234;tre &#244;t&#233;s par la suite. Une cou-
leur est attribu&#233;e &#224; chaque type de constituant. Ainsi il est ais&#233; d&#8217;estimer la qualit&#233; des r&#232;gles
sur le texte en cours avant de supprimer r&#233;ellement ces constituants. Dans la seconde phase,
les segments textuels color&#233;s sont supprim&#233;s pour obtenir le r&#233;sum&#233; final. Nous avons utilis&#233;
comme texte de test un conte ha&#239;tien. La principale raison de ce choix est que SYGFRAN pro-
duit une syntaxe correcte pour l&#8217;int&#233;gralit&#233; des phrases de ce texte. Le r&#233;sultat de la coloration
de la premi&#232;re moiti&#233; de ce texte est pr&#233;sent&#233; en figure 2.
</p>
<p>MAUI PART &#192; LA RECHERCHE DE SES PARENTS.
&#192; partir de ce soir-l&#224;, Maui fut le favori de sa m&#232;re : m&#234;me s&#8217;il faisait des b&#234;tises, elle ne le grondait
pas. Quand ses fr&#232;res protestaient, il se moquait d&#8217;eux parce qu&#8217;il savait avoir la protection de sa
m&#232;re. Mais pendant son absence, il devait faire attention &#224; ne pas d&#233;passer les limites, sinon il risquait
d&#8217;&#234;tre puni par eux au cours de la journ&#233;e.
Une nuit, Maui imagina un tour &#224; jouer &#224; sa m&#232;re afin de d&#233;couvrir o&#249; elle allait. Une fois tous les
autres endormis sur leurs nattes, il se releva et fit le tour de la maison, examinant les grands stores
tress&#233;s qui la fermaient pour la nuit. Partout o&#249; filtrait la clart&#233; d&#8217;une &#233;toile, il bouchait vite l&#8217;ouverture
avec des &#233;toffes d&#8217;&#233;corce et calfeutrait m&#234;me les fentes avec des roseaux. Puis il d&#233;roba le manteau,
la ceinture et la couronne de sa m&#232;re et les cacha en se disant qu&#8217;il en aurait besoin plus tard. Maui
reprit alors sa place sur les nattes et d&#233;cida de rester &#233;veill&#233;. La longue nuit passa lentement sans que
sa m&#232;re ne bouge.
Quand vint le matin, pas un rai de lumi&#232;re ne put percer pour &#233;veiller les dormeurs. Bient&#244;t ce
fut l&#8217;heure
</p>
<p>:::
o&#249;
</p>
<p>::
le
::::::
soleil
</p>
<p>:::::::::
grimpait
</p>
<p>:::::::::::
au-dessus
</p>
<p>:::
de
</p>
<p>:::::::::
l&#8217;horizon. D&#8217;habitude Maui pouvait distinguer dans
</p>
<p>la p&#233;nombre les formes des pieds de ses fr&#232;res &#224; l&#8217;autre bout de la maison, mais ce matin il faisait trop
noir. Et sa m&#232;re continuait &#224; dormir.
Au bout d&#8217;un moment elle bougea et marmonna : &#8220;Quelle sorte de nuit est-ce donc pour durer si
longtemps ?&#8221; Mais elle se rendormit parce qu&#8217;il faisait aussi noir qu&#8217;au c&#339;ur de la nuit dans la maison.
Finalement elle se r&#233;veilla en sursaut et se mit &#224; chercher ses v&#234;tements. Courant de tous c&#244;t&#233;s, elle
arracha ce que Maui avait fourr&#233; dans les fentes. Mais c&#8217;&#233;tait le jour ! Le grand jour ! Le soleil &#233;tait
d&#233;j&#224; haut dans le ciel ! Elle s&#8217;empara d&#8217;un morceau de tapa pour se couvrir et se sauva de la maison,
en pleurant &#224; la pens&#233;e d&#8217;avoir &#233;t&#233; ainsi tromp&#233;e par ses propres enfants . Sa m&#232;re partie, Maui bondit
pr&#232;s du store qui se balan&#231;ait encore de son passage et regarda par l&#8217;ouverture. Il vit qu&#8217;elle &#233;tait d&#233;j&#224;
loin, sur la premi&#232;re pente de la montagne. Puis elle s&#8217;arr&#234;ta, saisit &#224; pleines mains un arbuste de tiare
Tahiti, le souleva d&#8217;un coup : un trou apparut, elle s&#8217;y engouffra et remit le buisson en place comme
avant.
Maui jaillit de la maison aussi vite qu&#8217;il put, escalada la pente abrupte, tr&#233;buchant et tombant sur les
mains car il gardait les yeux fix&#233;s sur l&#8217;arbuste de tiare. Il l&#8217;atteignit finalement, le souleva et d&#233;couvrit
une
</p>
<p>:::::
belle caverne
</p>
<p>:::::::::
spacieuse
</p>
<p>:::
qui
</p>
<p>:::::::::::
s&#8217;enfon&#231;ait
</p>
<p>:::::
dans
</p>
<p>:::
la
::::::::::
montagne.
</p>
<p>L&#233;gende : compcir (compl&#233;ment circonstanciel), phger (proposition au g&#233;rondif),
:::::
phrel (proposition
</p>
<p>relative),
::::
gadj (groupe adjectival).
</p>
<p>FIG. 2 &#8211; Coloration d&#8217;un texte, d&#8217;apr&#232;s notre m&#233;thode de compression de phrases</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utilisation de la structure morpho-syntaxique des phrases dans le r&#233;sum&#233; automatique
</p>
<p>5 Discussion sur les r&#233;sultats et perspectives
</p>
<p>Avec le jeu de r&#232;gles actuel, notre approche nous a permis d&#8217;&#233;liminer environ 34 % du texte
complet. Nous constatons une l&#233;g&#232;re perte de contenu et de coh&#233;rence discursive, celle-ci reste
plus que raisonnable au regard des techniques actuelles de r&#233;sum&#233; automatique. La coh&#233;rence
grammaticale, quand &#224; elle, est tr&#232;s bien conserv&#233;e. Nous estimons que les r&#232;gles peuvent encore
&#234;tre affin&#233;es, mais les donn&#233;es linguistiques dans ce domaine sont tr&#232;s limit&#233;es. Pour ce texte,
SYGFRAN nous fournit des arbres syntaxiques corrects, mais les valeurs des variables ne sont
pas syst&#233;matiquement justes et compl&#232;tes. Pour les CC, SYGFRAN ne sp&#233;cifie actuellement la
s&#233;mantique de l&#8217;objet que pour ceux de temps et de lieu.
Pour le constituant &#8220;afin de d&#233;couvrir o&#249; elle allait&#8221; du deuxi&#232;me paragraphe, nous poss&#233;dons
l&#8217;information que c&#8217;est un CC mais pas que c&#8217;est un CC de but. Ce genre de constituant devrait
&#234;tre conserv&#233;. Dans le cas du constituant &#8220;D&#8217;habitude&#8221; du troisi&#232;me paragraphe, SYGFRAN ne
d&#233;tecte pas que c&#8217;est un CC de temps, c&#8217;est pourquoi nous le s&#233;lectionnons &#224; tort &#224; la suppres-
sion. Idem pour &#8220;Finalement&#8221; au quatri&#232;me paragraphe. L&#8217;&#233;volution des r&#232;gles de SYGFRAN
permettra de g&#233;rer de tels cas.
</p>
<p>Les r&#232;gles de s&#233;lection des constituants &#224; supprimer peuvent &#234;tre affin&#233;es davantage selon la
fonction des constituants et surtout selon le genre des textes. Nous comptons, &#224; cet effet, ef-
fectuer des exp&#233;rimentations sur plus de textes touchant &#224; des genres plus vari&#233;s. Cependant,
la compression de phrases ne suffit pas &#224; produire un r&#233;sum&#233; d&#8217;une taille convenable dans la
plupart des cas d&#8217;applications. Comme nous l&#8217;avons vu, elle est aussi fortement d&#233;pendante du
genre de texte. Nous consid&#233;rons donc notre approche intra-phrase comme une des t&#226;ches &#224; ef-
fectuer lors de la production d&#8217;un r&#233;sum&#233; automatique, en compl&#233;ment avec d&#8217;autres approches
qui travaillent &#224; un niveau de granularit&#233; sup&#233;rieur ou &#233;gal aux phrases.
</p>
<p>6 Conclusion
</p>
<p>Bien que le probl&#232;me du r&#233;sum&#233; automatique ait d&#233;j&#224; &#233;t&#233; abord&#233; par de nombreux scientifiques
depuis presque 50 ans [Luh58], l&#8217;approche que nous avons adopt&#233;e est novatrice. En effet,
les approches actuelles du r&#233;sum&#233; automatique utilisent des informations telles la fr&#233;quence
des termes, les relations lexicales entre les termes, les &#233;tiquettes sur la nature des constituants
fournis par des POS tagger (lemmatiseurs), les probabilit&#233;s d&#8217;un constituant d&#8217;appara&#238;tre dans
un r&#233;sum&#233; d&#8217;apr&#232;s des moteurs d&#8217;apprentissage, la structure rh&#233;torique du texte, cependant,
aucune d&#8217;entre elles n&#8217;utilise conjointement la fonction syntaxique et la position dans l&#8217;arbre
syntaxique des constituants.
</p>
<p>Ces informations n&#8217;ont pas &#233;t&#233; r&#233;ellement exploit&#233;es jusqu&#8217;&#224; pr&#233;sent car elles ne peuvent &#234;tre
extraites qu&#8217;avec des analyseurs morpho-syntaxiques fonctionnant avec un niveau suffisant. Ce
niveau n&#8217;a &#233;t&#233; atteint que r&#233;cemment en traitement automatique des langues, parce qu&#8217;il est
fort co&#251;teux en temps de calcul. Le syst&#232;me op&#233;rationnel SYGMART est l&#8217;un de ces outils. En
outre, il ajoute &#224; l&#8217;analyse des constituants de nombreuses informations concernant les relations
entre constituants, ce que peu d&#8217;autres analyseurs proposent.
</p>
<p>Notre approche a d&#233;but&#233; par une &#233;tude sur l&#8217;importance des constituants dans une phrase. Le
crit&#232;re de suppression a &#233;t&#233; l&#8217;&#233;valuation de la perte de contenu et de coh&#233;rence que la suppres-
sion de ces constituants engendre. Le crit&#232;re de s&#233;lection est celui de la fonction syntaxique et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mehdi Yousfi-Monod, Violaine Prince
</p>
<p>de la position dans l&#8217;arbre syntaxique des constituants. Les textes narratifs (romans, contes, ...)
se sont r&#233;v&#233;l&#233;s &#234;tre les plus ad&#233;quats pour une telle approche. Nous avons alors mod&#233;lis&#233; une
compression de phrases bas&#233;e sur la suppression de ces constituants. La cr&#233;ation d&#8217;un syst&#232;me
de r&#232;gles bas&#233; sur notre mod&#233;lisation nous a permis de tester la faisabilit&#233; d&#8217;une telle approche.
Nous sommes pass&#233;s par une &#233;tape de coloration des constituants en fonction des r&#232;gles qui les
avaient s&#233;lectionn&#233;s, afin d&#8217;estimer la pertinence de chaque r&#232;gle. Notre m&#233;thode nous a permis
de supprimer environ 34 % du texte de test, tout en conservant une tr&#232;s bonne coh&#233;rence gram-
maticale. Nous avons conclu que notre compression a son utilit&#233; dans un processus plus large
de r&#233;sum&#233; automatique.
</p>
<p>R&#233;f&#233;rences
[BE97] R. Barzilay and M. Elhadad. Using lexical chains for text summarization. In Proceedings of the
</p>
<p>Intelligent Scalable Text Summarization Workshop (ISTS&#8217;97), Madrid, Spain, 1997. ACL.
[BN00] Branimir K. Boguraev and Mary S. Neff. Lexical cohesion, discourse segmentation and docu-
</p>
<p>ment summarization. In RIAO-2000, Paris, April 2000.
[BP98] Sergey Brin and Lawrence Page. The anatomy of a large-scale hypertextual web search engine.
</p>
<p>In WWW7 : Proceedings of the seventh international conference on World Wide Web 7, pages 107&#8211;117,
Amsterdam, The Netherlands, The Netherlands, 1998. Elsevier Science Publishers B. V.
</p>
<p>[Cha84] Jacques Chauch&#233;. Un outil multidimensionnel de l&#8217;analyse du discours. In Coling&#8217;84, pages
11&#8211;15, Standford University, California, 1984.
</p>
<p>[GMCK00] J. Goldstein, V. Mittal, J. Carbonell, and M. Kantrowitz. Multi-document summarization by
sentence extraction. In Hahn et al.[15], pages 40&#8211;48, 2000.
</p>
<p>[Gre97] Maurice Grevisse. le Bon Usage &#8211; Grammaire fran&#231;aise. &#233;dition refondue par Andr&#233; Goosse,
DeBoeck-Duculot, Paris &#8211; Louvain-la-Neuve, 13e &#233;dition, ISBN 2-8011-1045-0, 1993-1997.
</p>
<p>[Gre98] Gregory Grefenstette. Producing intelligent telegraphic text reduction to provide audio scanning
service for the blind. In In AAAI symposium on Intelligent Text Summarisation, pages 111&#8211;117, Menlo
Park, California, 1998.
</p>
<p>[KM00] Kevin Knight and Daniel Marcu. Statistics-based summarization - step one : Sentence com-
pression. In Proceedings of the Seventeenth National Conference on Artificial Intelligence and Twelfth
Conference on Innovative Applications of Artificial Intelligence, pages 703&#8211;710, Sapporo, Japan, 2000.
</p>
<p>[KM02] Kevin Knight and Daniel Marcu. Summarization beyond sentence extraction : a probabilistic
approach to sentence compression. Artificial Intelligence archive, 139(1) :91&#8211;107, Jully 2002.
</p>
<p>[LBM04] Vanderwende Lucy, Michele Banko, and Arul Menezes. Event-centric summary generation. In
In Document Understanding Conference at HLT-NAACL, Boston, MA, 2004.
</p>
<p>[Lin03] Chin-Yew Lin. Improving summarization performance by sentence compression - a pilot study.
In Proceedings of the Sixth International Workshop on Information Retrivial with Asian Language (IRAL
2003), Sapporo, Japan, Jully 2003.
</p>
<p>[Luh58] H.P. Luhn. The automatic creation of literature abstracts. Journal of research and development,
IBM, 1958.
</p>
<p>[Man04] Inderjeet Mani. Narrative Summarization, volume 45/1. 2004.
[Min04] Jean-Luc Minel. Le r&#233;sum&#233; automatique de textes : solutions et perspectives, volume 45/1.
</p>
<p>2004.
[MT88] William C. Mann and Sandra A. Thompson. Rhetorical structure theory : toward a functionnal
</p>
<p>theory of text organization. In Research Report RR-87-190, USC/Information Sciences Institute, pages
243&#8211;281, Marina del Rey, CA, 1988.</p>

</div></div>
</body></html>