<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Dialogue automatique et personnalit&#233; : m&#233;thodologie pour l'incarnation de traits humains</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6&#8211;10 juin 2005
</p>
<p>Dialogue automatique et personnalit&#233; : M&#233;thodologie pour
l&#8217;Incarnation de Traits Humains
</p>
<p>Florence Duclaye, Franck Panaget
France T&#233;l&#233;com R&amp;D
</p>
<p>2, avenue Pierre Marzin 22307 Lannion Cedex
{florence.duclaye,franck.panaget}@francetelecom.com
</p>
<p>Mots-clefs : dialogue incarn&#233;, personnages virtuels, personnalit&#233;, g&#233;n&#233;ration automa-
tique
</p>
<p>Keywords: embodied dialogue, virtual characters, personality, natural language gen-
eration
</p>
<p>R&#233;sum&#233; Cet article introduit une m&#233;thodologie d&#8217;int&#233;gration de la personnalit&#233; dans un
syst&#232;me de dialogue automatique, en vue de l&#8217;incarnation de personnages virtuels. Notion
complexe non encore &#233;puis&#233;e dans la litt&#233;rature, la personnalit&#233; d&#8217;un individu peut s&#8217;illustrer
de multiples mani&#232;res possibles. Notre objectif consiste &#224; pr&#233;senter une m&#233;thode g&#233;n&#233;rique de
prise en compte de la personnalit&#233; dans un syst&#232;me de dialogue par mod&#233;lisation et exploita-
tion des connaissances relatives &#224; la personnalit&#233; de l&#8217;individu &#224; incarner. Cet article pr&#233;sente
les avantages et inconv&#233;nients de cette m&#233;thode en l&#8217;illustrant au travers de la stylistique des
&#233;nonc&#233;s g&#233;n&#233;r&#233;s par le syst&#232;me.
</p>
<p>Abstract This article introduces a methodology to integrate personality into a dialogue
system. This work constitutes a step towards the embodiment of virtual characters. The per-
sonality of an individual, which is a complex and non-exhausted concept in literature, can show
through multiple possible ways. Our purpose is to describe a generic methodology of personal-
ity integration into a dialogue system based on the modelling and use of knowledge relative to
the personality of a given individual. This article describes the advantages and drawbacks of the
proposed methodology by illustrating it through the linguistic style of the generated messages.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florence Duclaye et Franck Panaget
</p>
<p>1 Introduction
</p>
<p>La personnalit&#233; constitue un champ de recherche prometteur dans le monde des syst&#232;mes d&#8217;inter-
action homme/machine. Inscrite dans la perspective d&#8217;une meilleure acceptabilit&#233; des syst&#232;mes
de dialogue par les utilisateurs, la pr&#233;sente &#233;tude propose une m&#233;thodologie d&#8217;introduction
d&#8217;une personnalit&#233; dans ces syst&#232;mes. Cet article se pr&#233;sente comme suit. La partie 2 introduit
le concept de personnalit&#233; et son int&#233;gration dans les syst&#232;mes existants &#224; travers les travaux de
la litt&#233;rature. La partie 3 d&#233;veloppe la mani&#232;re dont la personnalit&#233; est mod&#233;lis&#233;e et exploit&#233;e
pour &#234;tre rendue &#224; travers notre syst&#232;me de dialogue. Quelques r&#233;sultats sont pr&#233;sent&#233;s dans
cette partie et nous am&#232;nerons &#224; mettre en &#233;vidence les perspectives d&#8217;&#233;volution possibles de
notre syst&#232;me.
</p>
<p>2 Personnalit&#233; et dialogue automatique : analyse de l&#8217;existant
</p>
<p>2.1 La personnalit&#233; : caract&#233;ristiques et moyens d&#8217;expression
</p>
<p>La litt&#233;rature nous fournit plus de cinquante d&#233;finitions du concept de personnalit&#233; (Allport,
1937) mais toutes les th&#233;ories s&#8217;accordent &#224; affirmer que la personnalit&#233; concerne les carac-
t&#233;ristiques uniques et distinctives des individus et s&#8217;int&#233;resse &#224; la nature fondamentale de l&#8217;&#234;tre
humain. (Cattell, 1965) affirme l&#8217;id&#233;e suivante : &#8220;la personnalit&#233; est ce qui permet de pr&#233;dire
ce qu&#8217;une personne fera dans une situation donn&#233;e&#8221;. Notre objectif est d&#8217;analyser par quels
moyens la personnalit&#233; peut s&#8217;exprimer afin de les reproduire. La th&#233;orie d&#233;velopp&#233;e par Cat-
tell repose sur quelque seize param&#232;tres, tels que le temp&#233;rament extraverti/r&#233;serv&#233;, le niveau
d&#8217;intelligence, le temp&#233;rament exp&#233;rimentateur/traditionnel, t&#233;m&#233;raire/timide, etc. Chacun de
ces traits varie pour constituer la personnalit&#233; d&#8217;un individu. (McCrae, John, 1992) proposent
une version distill&#233;e de la th&#233;orie de Cattell et consid&#233;rent seulement cinq traits qui se com-
binent pour constituer la personnalit&#233; (&#8220;Five Factor Model&#8221;). Ces traits sont l&#8217;ouverture (fan-
taisie, lib&#233;ralisme, cr&#233;ativit&#233;...), le temp&#233;rament consciencieux (ordre, auto-discipline, volont&#233;
de r&#233;ussir...), l&#8217;extraversion (agitation, calme, timidit&#233;...), le temp&#233;rament agr&#233;able (altruisme,
indiff&#233;rence, &#233;go-centrisme...) et la n&#233;vrose (anxi&#233;t&#233;, d&#233;pression, impulsivit&#233;... ).
</p>
<p>2.2 Int&#233;gration de la personnalit&#233; dans les syst&#232;mes de dialogue existants
</p>
<p>De multiples moyens sont envisageables pour faire v&#233;hiculer des traits de personnalit&#233; par un
syst&#232;me de dialogue : l&#8217;apparence physique (visage, corps, v&#234;tements...), l&#8217;intonation de la voix,
les traits prosodiques, la vitesse d&#8217;&#233;locution, ou encore la mani&#232;re de s&#8217;exprimer du personnage
(ex : choix lexicaux, syntaxiques, blancs, h&#233;sitations...). Les actions men&#233;es par un person-
nage constituent une autre mani&#232;re efficace de transmettre sa personnalit&#233; (ex : temp&#233;rament
t&#233;m&#233;raire/timide), tout comme le contenu de ses actes de langage (ex : degr&#233; de coop&#233;ration).
Nous n&#8217;abordons ici que les travaux de recherche portant sur l&#8217;expression de la personnalit&#233;
d&#8217;un individu au travers de ses productions linguistiques.
</p>
<p>La litt&#233;rature traditionnelle introduit souvent directement les param&#232;tres stylistiques dans le
g&#233;n&#233;rateur. Par exemple, (Biber, 1988) analyse la variation syst&#233;matique entre &#233;nonc&#233;s en ter-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dialogue Automatique et Personnalit&#233; : M&#233;thodologie pour l&#8217;Incarnation de
Traits Humains
</p>
<p>mes de dimensions sous-jacentes. L&#8217;auteur consid&#232;re pour cela un espace multi-dimensionnel,
dans lequel chaque dimension comporte un ensemble de traits syntaxiques et lexicaux qui cooc-
current fr&#233;quemment dans les &#233;nonc&#233;s (ex: temps employ&#233;, etc). Cette m&#233;thode de param&#233;-
trage du g&#233;n&#233;rateur par des traits s&#233;mantiques, surfaciques, etc, est reprise par (Stede, 1993) et
(Reiter, 2004). (Hovy, 1990) constitue l&#8217;un des travaux-phares en mati&#232;re de variation stylis-
tique d&#8217;&#233;nonc&#233;s g&#233;n&#233;r&#233;s. Les param&#232;tres de son g&#233;n&#233;rateur concernent des aspects comme
l&#8217;atmosph&#232;re conversationnelle de l&#8217;interaction, les caract&#233;ristiques personnelles des interlocu-
teurs, ou encore le but du locuteur sur son auditeur.
</p>
<p>3 Mod&#233;lisation et expression de la personnalit&#233; dans notre
syst&#232;me de dialogue
</p>
<p>3.1 Mod&#233;lisation de la personnalit&#233;
</p>
<p>Notre syst&#232;me de dialogue est constitu&#233; de trois composants principaux. Une unit&#233; rationnelle,
qui conf&#232;re au syst&#232;me ses capacit&#233;s de dialogue, impl&#233;mente une Th&#233;orie de l&#8217;Interaction for-
malisant des attitudes mentales telles que la croyance ou l&#8217;intention avec un mod&#232;le d&#8217;actions
communicatives (Bretier, Sadek, 1997). En contexte de dialogue homme-machine, le syst&#232;me
n&#233;cessite une unit&#233; de traitement des langues naturelles qui produit l&#8217;interpr&#233;tation s&#233;mantique
des &#233;nonc&#233;s de l&#8217;utilisateur d&#8217;une part, et d&#8217;autre part les &#233;nonc&#233;s verbalisant les actes com-
municatifs planifi&#233;s par l&#8217;unit&#233; rationnelle. Les connaissances n&#233;cessaires pour comprendre,
raisonner et s&#8217;exprimer sont pr&#233;sentes dans le composant de gestion des connaissances, qui est
notamment constitu&#233; d&#8217;un r&#233;seau s&#233;mantique sp&#233;cifique &#224; l&#8217;application vis&#233;e (domaine ferm&#233;).
La personnalit&#233; est mod&#233;lis&#233;e dans notre syst&#232;me de dialogue, au niveau de ce composant de
gestion des connaissances, sous forme d&#8217;un mod&#232;le s&#233;mantique unique. La figure 1 pr&#233;sente
le sous-mod&#232;le d&#233;crivant un individu. On y aper&#231;oit au centre la classe Personne, d&#8217;o&#249; par-
tent trois relations (Biographie, LangueParlee, Personnalite). LangueParlee d&#233;signe les
langues connues par la Personne et la mani&#232;re dont elle les parle (voir 3.2). Un ensemble de
classes est li&#233; &#224; la Personnalite, inspir&#233; des traits de personnalit&#233; majeurs mis en &#233;vidence
par (McCrae, John, 1992) (voir 2.1). La figure 1 n&#8217;inclut pas l&#8217;int&#233;gralit&#233; des caract&#233;ristiques
du personnage mais illustre n&#233;anmoins que les connaissances sont mod&#233;lis&#233;es &#224; un seul endroit
dans le syst&#232;me de dialogue et peuvent &#234;tre exploit&#233;es de divers moyens possibles. Dans cet ar-
ticle, nous ne d&#233;taillerons que l&#8217;influence de ces traits sur la g&#233;n&#233;ration (voir partie 3.2). Notons
que nous ne mod&#233;lisons pas la personnalit&#233; de l&#8217;allocutaire humain avec lequel l&#8217;interaction se
fait. L&#8217;originalit&#233; de cette approche r&#233;side dans le fait que les param&#232;tres permettant au syst&#232;me
de dialogue d&#8217;incarner un personnage sont mod&#233;lis&#233;s et entr&#233;s au coeur du syst&#232;me.
</p>
<p>Figure 1: Extrait de la base de connaissances</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florence Duclaye et Franck Panaget
</p>
<p>3.2 La personnalit&#233; vue &#224; travers l&#8217;expression des messages
</p>
<p>Afin de restituer les traits de personnalit&#233;, le g&#233;n&#233;rateur prend en compte les connaissances
relatives au profil linguistique du personnage &#224; incarner au moment des choix lexicaux (entre
pseudo-synonymes) et syntaxiques (insertion d&#8217;h&#233;sitations, de tics de langage...). La figure 2 il-
lustre (r&#233;seau incomplet) notre mod&#233;lisation d&#8217;un profil linguistique. Pour une LangueParlee,
de Nature donn&#233;e (ex : fran&#231;ais), un ensemble de param&#232;tres associ&#233;s d&#233;crivent la mani&#232;re
dont le personnage Personne s&#8217;exprime dans cette langue (niveau de langage, la couverture
lexicale ou Etendue, ou encore variantes parl&#233;es).
</p>
<p>Figure 2: Extrait de la base de connaissances - Profil linguistique d&#8217;un individu
</p>
<p>Le g&#233;n&#233;rateur de notre syst&#232;me de dialogue (Panaget, 1996) respecte le sch&#233;ma fonctionnel
classique &#224; trois composants (Levelt, 1989) : un macro-planificateur, un micro-planificateur
et un formulateur. Le macro-planificateur g&#232;re la structure organisationnelle du message &#224;
g&#233;n&#233;rer en transformant les actes communicatifs produits par l&#8217;unit&#233; rationnelle en une expres-
sion de s&#233;mantique id&#233;ationnelle. Le micro-planificateur s&#233;lectionne le meilleur ensemble de
ressources linguistiques (lexicales et grammaticales) verbalisant l&#8217;expression &#224; communiquer.
Finalement, le formulateur utilise une grammaire d&#8217;arbres adjoints (Joshi, 1987) pour ordonner
les &#233;l&#233;ments de l&#8217;&#233;nonc&#233;, les accorder et appliquer un traitement morphologique. Les traits de
personnalit&#233; qui peuvent produire des effets sur la forme des messages produits sont utilis&#233;s
pour impacter la macro-planification (production d&#8217;expressions id&#233;ationnelles diff&#233;rentes), et
la micro-planification (s&#233;lection de pseudo-synonymes). Au niveau de la macro-planification,
le g&#233;n&#233;rateur peut chercher &#224; r&#233;duire une expression id&#233;ationnelle &#224; verbaliser dans le but de
produire un &#233;nonc&#233; minimal. Par exemple, &#224; la question &#8220;O&#249; es-tu n&#233; ?&#8221; , le syst&#232;me pourra
r&#233;pondre &#8220;Je suis n&#233; &#224; Ulm&#8221; (personnage pos&#233;, rigoureux) ou uniquement &#8220;&#224; Ulm&#8221; (personnage
stress&#233;, press&#233;). La seconde t&#226;che est l&#8217;introduction d&#8217;interjections telles que l&#8217;exclamation
positive (&#8220;ah&#8221;) ou n&#233;gative (&#8220;oh&#8221;) (personnage extraverti) ou encore l&#8217;h&#233;sitation (&#8220;euh&#8221;) (per-
sonnage timide). Un m&#233;canisme d&#8217;ajout de tics de langage a aussi &#233;t&#233; mis en oeuvre. Au niveau
de la micro-planification, le g&#233;n&#233;rateur met en oeuvre un m&#233;canisme de s&#233;lection de ressources
linguistiques verbalisant l&#8217;expression id&#233;ationnelle produite. Les ressources linguistiques pos-
s&#232;dent des informations de style qui les diff&#233;rencient. Pour un concept donn&#233;, le choix entre
les pseudo-synonymes disponibles est fond&#233; sur l&#8217;exploitation d&#8217;un vecteur de style associ&#233;
aux ressources linguistiques. Dans la version actuelle, les vecteurs de style sont limit&#233;s &#224; trois
traits : (1) formalit&#233; (vulgaire, familier, courant, formel, soutenu), (2) fioriture (r&#233;aliste, imag&#233;,
figure de style), (3) temporel (archa&#239;que, vieilli, actuel, n&#233;ologisme). Le pseudo-synonyme
retenu est celui ayant la distance la plus faible selon la formule ci-dessous. Cette formule est
constitu&#233;e de trois composantes. La premi&#232;re composante est la distance euclidienne au carr&#233;
entre le vecteur de style de la ressource linguistique candidate RL (V ectRL) et le vecteur de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dialogue Automatique et Personnalit&#233; : M&#233;thodologie pour l&#8217;Incarnation de
Traits Humains
</p>
<p>r&#233;f&#233;rence (V ectRef ), d&#233;fini par le mod&#232;le s&#233;mantique de l&#8217;individu. Cette distance est sem-
blable &#224; celle d&#233;crite dans (Stede, 1993). La seconde composante, qui est la distance entre la
ressource candidate et la derni&#232;re ressource linguistique s&#233;lectionn&#233;e (V ectRLprec), exprime le
fait qu&#8217;il faut &#233;viter au maximum les &#233;carts de styles entre les ressources s&#233;lectionn&#233;es. La
troisi&#232;me composante mod&#233;lise l&#8217;&#233;tendue des comp&#233;tences linguistiques de l&#8217;individu en p&#233;-
nalisant les ressources qui ont &#233;t&#233; utilis&#233;es derni&#232;rement (Phc est le num&#233;ro de la phrase en
cours de g&#233;n&#233;ration, PhRL est celui de la derni&#232;re phrase construite &#224; partir de la ressource lin-
guistique RL, Phc=PhRL si cette ressouce n&#8217;a pas encore &#233;t&#233; retenue). Le param&#232;tre Etendue
repr&#233;sente l&#8217;&#233;tendue des comp&#233;tences langagi&#232;res de l&#8217;individu (diversification des ressources
linguistiques choisies).
d(V ectRL, V ectRef , V ectRLprec, Phc, PhRL) = (1)
</p>
<p>si Phc = PhRL (2)
&#945;1
</p>
<p>n&#8721;
i=1
</p>
<p>(V ectiRef &#8722; V ectiRL)2 + &#945;2
n&#8721;
i=1
</p>
<p>(V ectiRLprec &#8722; V ectiRL)2 + &#945;3Etendue (3)
sinon (4)
</p>
<p>&#945;1
n&#8721;
i=1
</p>
<p>(V ectiRef &#8722; V ectiRL)2 + &#945;2
n&#8721;
i=1
</p>
<p>(V ectiRLprec &#8722; V ectiRL)2 + &#945;3
Etendue
</p>
<p>Phc &#8722; PhRL(5)
</p>
<p>Cette m&#233;thode est illustr&#233;e dans une application de dialogue avec deux personnages virtuels aux
personnalit&#233;s tr&#232;s diff&#233;rentes. Charles est un brillant scientifique ayant v&#233;cu au d&#233;but du 20&#232;me
si&#232;cle et ayant un style linguistique riche et soutenu. Fred est une pop star de l&#8217;&#233;poque actuelle
et s&#8217;exprime d&#8217;une mani&#232;re quasi-oppos&#233;e &#224; celle de Charles :
</p>
<p>Charles : Mes hommages, Madame ! Mes hommages, Monsieur !
Que puis-je faire pour vous &#234;tre agr&#233;able ?
</p>
<p>Utilisateur : En quelle ann&#233;e &#234;tes vous n&#233;, Charles ?
Charles : J&#8217;ai vu le jour en 1879.
Utilisateur : Et dans quelle ville avez-vous vu le jour ?
Charles : Je suis venu au monde &#224; Ulm.
Utilisateur : Quand &#234;tes-vous mort ?
Charles : J&#8217;ai v&#233;cu jusqu&#8217;en 1955.
Utilisateur : Merci Charles. Au revoir !
Charles : Dois-je comprendre que vous souhaitez mettre fin &#224; notre conversation ?
Utilisateur : Oui, je voudrais parler avec Fred, maintenant.
Fred : Ah que coucou ! Qu&#8217;est-ce que tu veux ?
Utilisateur : Quand es-tu n&#233;, Fred ?
Fred : A que j&#8217;ai point&#233; le bout du nez en 1943.
Utilisateur : O&#249; tu es n&#233; ?
Fred : Que je suis n&#233; &#224; la capitale.
Utilisateur : OK. Merci Fred. A bient&#244;t !
Fred : Tu veux vraiment qu&#8217;on arr&#234;te de discuter tous les deux ?
Utilisateur Oui. A plus tard.
Fred : Tchao, &#224; plus.
</p>
<p>4 Conclusion et perspectives
</p>
<p>Cet article pr&#233;sente une m&#233;thode g&#233;n&#233;rique de prise en compte de la personnalit&#233; d&#8217;un individu
en vue de son incarnation par un syst&#232;me de dialogue automatique. La m&#233;thode d&#233;crite permet</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Florence Duclaye et Franck Panaget
</p>
<p>d&#8217;exprimer la personnalit&#233; au travers de variations stylistiques des messages g&#233;n&#233;r&#233;s. Notre
m&#233;thode pr&#233;sente l&#8217;avantage d&#8217;int&#233;grer les donn&#233;es relatives &#224; la personnalit&#233; au niveau-m&#234;me
du composant de gestion des connaissances et ainsi d&#8217;exploiter ces param&#232;tres dans diff&#233;rents
composants, et donc par plusieurs moyens possibles (g&#233;n&#233;ration, raisonnement...). De plus,
par le param&#233;trage de chaque trait ind&#233;pendamment des autres traits, cette m&#233;thode permet de
v&#233;hiculer de nombreuses personnalit&#233;s existantes, ou inexistantes. Illustr&#233;s sur deux person-
nages virtuels, les r&#233;sultats obtenus s&#8217;av&#232;rent d&#8217;ors et d&#233;j&#224; prometteurs, mais tracent &#233;galement
la voie des prochaines am&#233;liorations. Une mod&#233;lisation plus fine de la personnalit&#233; permettrait
en effet d&#8217;atteindre plus de granularit&#233; et d&#8217;att&#233;nuer la caricature comportementale et stylistique
obtenue. De plus, des axiomes de comportement adapt&#233;s restent &#224; mettre en oeuvre dans le sys-
t&#232;me. Enfin, les prochains efforts se concentreront sur une reproduction stylistique plus pr&#233;cise
et pourront par exemple s&#8217;appuyer sur des travaux tels que ceux de (Paiva, Evans, 2004), qui
propose une m&#233;thode d&#8217;apprentissage de r&#232;gles de production stylistique &#224; partir de corpus de
textes illustrant un &#233;ventail de variations stylistiques.
</p>
<p>R&#233;f&#233;rences
Allport G.W. (1937), Personality - A psychological interpretation, New York, Henry Holt.
Biber D. (1988), Variation across speech and writing, Cambridge University Press, Cambridge.
Bretier P., Sadek D. (1997), A rational agent as the kernel of a cooperative spoken dialogue system: im-
plementing a logical theory of interaction. Proc. of ECAI&#8217;96 workshop on Agent theories, Architectures
and Languages, 189-204, Berlin:Springer.
Cattell R.B. (1965), The Scientific Analysis of Personality, Penguin.
Hovy E.H. (1990), Pragmatics and Natural Language Generation, Artificial Intelligence, Vol. 43, 153-
197.
Joshi A. (1987), The relevance of Tree Adjoining Grammar, Natural Language Generation: News Re-
sults in Artificial Intelligence, Psychology and Linguistics, G. Kempen ed., Nato Asi Series 135, Martinus
Nijhoff Publishers, Boston.
Levelt W. (1989), Speaking: From Intention to Articulation, Cambridge MIT Press.
McCrae R., John O. (1992), An introduction to the five-factor model and its applications, Journal of
Personality, Vol. 60, 175-216.
Paiva D., Evans R. (2004), A Framework for Stylistically Controlled Generation, International Confer-
ence on Natural Language Generation, 120-129.
Panaget F. (1996), D&#8217;un syst&#232;me g&#233;n&#233;rique de g&#233;n&#233;ration d&#8217;&#233;nonc&#233;s en contexte de dialogue oral &#224; la
formalisation logique des capacit&#233;s linguistiques d&#8217;un agent rationnel dialoguant. Th&#232;se de doctorat,
Universit&#233; de Rennes I, France.
</p>
<p>Reiter E., Sripada S. (2004), Contextual Influences on Near-Synonyme Choice, Proceedings of the Third
International Conference on Natural Language Generation, 161-170.
Searle, J.R. (1969), Speech Acts, Cambridge University Press.
Stede M. (1993), Lexical Choice Criteria in Language Generation, Proceedings of European Chapter of
the Association for Computational Linguistics, 454-459.</p>

</div></div>
</body></html>