<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Sur le statut r&#233;f&#233;rentiel des entit&#233;s nomm&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Sur le statut r&#233;f&#233;rentiel des entit&#233;s nomm&#233;es 
</p>
<p>Thierry Poibeau 
</p>
<p>Laboratoire d&#8217;Informatique de Paris Nord &#8211; CNRS et Universit&#233; Paris 13 
99, av. J.-B. Cl&#233;ment &#8211; F-93430 Villetaneuse 
</p>
<p>thierry.poibeau@lipn.univ-paris13.fr 
 
</p>
<p>Mots-cl&#233;s :   Entit&#233;s nomm&#233;es, r&#233;f&#233;rence, s&#233;mantique lexicale 
</p>
<p>Keywords:   Named entities, reference, lexical semantics 
</p>
<p> 
</p>
<p>R&#233;sum&#233; Nous montrons dans cet article qu&#8217;une m&#234;me entit&#233; peut &#234;tre d&#233;sign&#233;e de 
multiples fa&#231;ons et que les noms d&#233;signant ces entit&#233;s sont par nature polys&#233;miques. 
L&#8217;analyse ne peut donc se limiter &#224; une tentative de r&#233;solution de la r&#233;f&#233;rence mais doit mettre 
en &#233;vidence les possibilit&#233;s de nommage s&#8217;appuyant essentiellement sur deux op&#233;rations de 
nature linguistique : la synecdoque et la m&#233;tonymie. Nous pr&#233;sentons enfin une mod&#233;lisation 
permettant de rendre explicite les diff&#233;rentes d&#233;signations en discours, en unifiant le mode de 
repr&#233;sentation des connaissances linguistiques et des connaissances sur le monde. 
</p>
<p>Abstract We show in this paper that, on the one hand, named entities can be designated 
using different denominations and that, on the second hand, names denoting named entities 
are polysemous. The analysis cannot be limited to reference resolution but should take into 
account naming strategies, which are mainly based on two linguistic operations: synecdoche 
and metonymy. Lastly, we present a model that explicitly represents the different 
denominations in discourse, unifying the way to represent linguistic knowledge and world 
knowledge.   
</p>
<p> 
</p>
<p>1 Introduction 
</p>
<p>Les entit&#233;s nomm&#233;es d&#233;signent les noms de personnes, de lieux, d&#8217;organisations mais aussi 
les dates ou les unit&#233;s mon&#233;taires. Alors que ces &#233;l&#233;ments ont longtemps &#233;t&#233; d&#233;laiss&#233;s par les 
syst&#232;mes de traitement automatique des langues, le renouveau li&#233; au travail sur corpus a 
r&#233;v&#233;l&#233; qu&#8217;il s&#8217;agissait en fait d&#8217;&#233;l&#233;ments majeurs pour l&#8217;analyse. Les conf&#233;rences en extraction 
d&#8217;information (Message Understanding Conferences, cf. MUC-7, 1998) ont mis en avant 
plusieurs t&#226;ches g&#233;n&#233;riques, au premier rang desquelles l&#8217;analyse des entit&#233;s nomm&#233;es. Il 
s&#8217;agit en fait d&#8217;une double t&#226;che : d&#8217;une part une t&#226;che de reconnaissance des s&#233;quences 
pertinentes, d&#8217;autre part une t&#226;che de typage des s&#233;quences ainsi reconnues en fonction d&#8217;une 
ontologie pr&#233;-&#233;tablie. Sur des textes de type journalistique, les syst&#232;mes obtiennent </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>g&#233;n&#233;ralement d&#8217;assez bons scores, avec un taux combin&#233; de rappel et de pr&#233;cision sup&#233;rieur &#224; 
0,90.  
</p>
<p>Les entit&#233;s nomm&#233;es sont particuli&#232;rement importantes pour l&#8217;acc&#232;s au contenu du document 
car elles forment les briques &#233;l&#233;mentaires sur lesquelles repose l&#8217;analyse. Les entit&#233;s sont 
g&#233;n&#233;ralement consid&#233;r&#233;es comme directement r&#233;f&#233;rentielles : ce sont les d&#233;signateurs rigides 
de Kripke (1982) qui font r&#233;f&#233;rence aux objets du monde, organis&#233;s en ontologie. Nous 
montrons ici les limites de cette approche et nous contestons la vue traditionnelle qui rend 
compte d&#8217;une fa&#231;on tr&#232;s simplifi&#233;e de la complexit&#233; de la langue. Nous proposons quelques 
pistes pour mieux prendre en compte le s&#233;mantisme complexe des entit&#233;s.  
</p>
<p>Nous pr&#233;sentons dans un premier temps les syst&#232;mes classiques de rep&#233;rage d&#8217;entit&#233;s 
nomm&#233;es. Ceux-ci reposent sur un ensemble de r&#232;gles permettant de typer les s&#233;quences 
pertinentes d&#8217;apr&#232;s un ensemble de cat&#233;gories pr&#233;d&#233;finies.  Nous montrons ensuite les limites 
de cette approche : la plupart des entit&#233;s sont polys&#233;miques et leur analyse d&#233;pend &#233;troitement 
du contexte. Partant de ce constat, l&#8217;analyse mise en &#339;uvre ne peut qu&#8217;&#234;tre dynamique et 
refl&#233;ter les effets de sens en contexte. Nous proposons enfin, dans une derni&#232;re partie, une 
mod&#233;lisation &#224; base de structures de traits permettant de mieux rendre compte des 
ph&#233;nom&#232;nes en jeu. 
</p>
<p>2 Syst&#232;mes de rep&#233;rage et de cat&#233;gorisation des entit&#233;s nomm&#233;es 
</p>
<p>Les entit&#233;s nomm&#233;es sont traditionnellement typ&#233;es suivant une hi&#233;rarchie pr&#233;-&#233;tablie. Nous 
examinons ce type de hi&#233;rarchie et les probl&#232;mes pos&#233;s par les textes.  
</p>
<p>2.1 Hi&#233;rarchies de types d&#8217;entit&#233;s 
</p>
<p>Sous l&#8217;influence des conf&#233;rences am&#233;ricaines d'&#233;valuation MUC, les travaux en extraction 
d'entit&#233;s nomm&#233;es ont traditionnellement &#233;t&#233; effectu&#233;s sur des textes journalistiques ou des 
d&#233;p&#234;ches d'agence. L'identification des entit&#233;s nomm&#233;es inclut trois types d'expressions : 
</p>
<p>&#8722; ENAMEX : les expressions de noms propres incluant les noms de personnes, de lieux et 
d'organisations. 
</p>
<p>&#8722; TIMEX : les expressions temporelles comme les dates et les heures. 
</p>
<p>&#8722; NUMEX : les expressions num&#233;riques telles que les expressions mon&#233;taires et les 
pourcentages.  
</p>
<p>Voici par exemple la hi&#233;rarchie de types d&#233;finie par le LIMSI pour le syst&#232;me QALC (Ferret 
et al., 2001) et calqu&#233; sur la hi&#233;rarchie d&#233;finie pour MUC (Grishman et Sundheim, 1995). 
</p>
<p> 
</p>
<p>Les hi&#233;rarchies comportent ainsi, pour les plus simples, une douzaine de types de base 
(feuilles de la hi&#233;rarchie) mais ont souvent besoin d&#8217;&#234;tre &#233;tendues pour couvrir de nouveaux </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>besoins (de nouvelles t&#226;ches, de nouveaux domaines). Il n&#8217;est ainsi pas rare de faire face &#224; des 
hi&#233;rarchies de plus de 200 &#233;l&#233;ments (Sekine, 2004).  
</p>
<p>2.2 Rep&#233;rage et classification des entit&#233;s nomm&#233;es 
</p>
<p>De nombreux travaux ont port&#233; sur l&#8217;identification des noms propres dans des textes 
journalistiques, notamment les Message Understanding Conferences (MUC7, 1998). La 
reconnaissance des entit&#233;s nomm&#233;es &#224; partir de textes &#233;crits est actuellement la t&#226;che 
d&#8217;extraction d&#8217;information qui obtient les meilleures performances. Les performances sont 
mesur&#233;es en utilisant des mesures classiques comme P&amp;R, fond&#233;e sur un taux combin&#233; de 
pr&#233;cision et de rappel suivant la r&#232;gle suivante :  
</p>
<p>RAPPELPRECISION
</p>
<p>RAPPELPRECISION
RP
</p>
<p>+
=
</p>
<p>**2
&amp; . Les taux obtenus 
</p>
<p>sont comparables &#224; ceux des humains, de l&#8217;ordre de 0,90 P&amp;R sur des d&#233;p&#234;ches 
journalistiques.  
</p>
<p>Deux grandes approches sont g&#233;n&#233;ralement suivies pour leur identification : une approche 
linguistique &#171; de surface &#187; et une approche probabiliste. L&#8217;approche linguistique est fond&#233;e 
sur la description syntaxique et lexicale des syntagmes recherch&#233;s. Des r&#232;gles de grammaire 
utilisent des marqueurs lexicaux (ex. Mr pour Mister ou Inc. pour Incorporated), des 
dictionnaires de noms propres et des dictionnaires de la langue g&#233;n&#233;rale (essentiellement pour 
rep&#233;rer les mots inconnus) sont utilis&#233;s pour rep&#233;rer et typer les syntagmes int&#233;ressants 
(Aberdeen et al., 1995 ; Grishman, 1995 ; Appelt et Martin, 1999). De son c&#244;t&#233;, l&#8217;approche 
probabiliste utilise un mod&#232;le de langage entra&#238;n&#233; sur de larges corpus de textes pr&#233;-&#233;tiquet&#233;s. 
Cette approche est particuli&#232;rement robuste lorsque les textes sont bruit&#233;s, c&#8217;est pourquoi la 
grande majorit&#233; des syst&#232;mes d&#233;di&#233;s &#224; l&#8217;oral adoptent une telle approche (Kubala, 1999). 
</p>
<p>3 Difficult&#233;s et limites de la cat&#233;gorisation 
</p>
<p>Nous montrons dans cette partie les limites de l&#8217;approche traditionnelle. Nous montrons 
notamment la polys&#233;mie fr&#233;quente des entit&#233;s nomm&#233;es et les cons&#233;quences pour l&#8217;analyse 
automatique. 
</p>
<p>3.1 Polys&#233;mie des entit&#233;s nomm&#233;es 
</p>
<p>La cat&#233;gorisation des entit&#233;s repose en grande partie sur l&#8217;hypoth&#232;se que les entit&#233;s sont 
r&#233;f&#233;rentielles et peuvent donc recevoir un type rendant compte de leur r&#233;f&#233;rent. Cette analyse 
est le plus souvent erron&#233;e comme on peut ais&#233;ment le montrer, les entit&#233;s nomm&#233;es r&#233;f&#233;rant 
le plus souvent &#224; plusieurs classes (Leroy, 2004). Les dates se confondent ainsi fr&#233;quemment 
avec des &#233;v&#233;nements : 
</p>
<p>Le 11 septembre 2001 a repr&#233;sent&#233; un tournant dans l&#8217;histoire am&#233;ricaine. (Elie Wiesel, 
site www.france-amerique.com)  
</p>
<p>Il est parfois difficile de classer les noms d&#8217;organisations, qui peuvent &#234;tre cat&#233;goris&#233;s comme 
institution, communaut&#233; d&#8217;individus ou encore b&#226;timent.  
</p>
<p>Le journal t&#233;l&#233;vis&#233; a eu lieu hier en direct de l&#8217;ONU. 
</p>
<p>L&#8217;ONU &#233;tait en gr&#232;ve hier. 
</p>
<p>L&#8217;ONU a f&#234;t&#233; ses 50 ans.  
L&#8217;ONU n&#8217;acceptera pas une attaque frontale de l&#8217;Irak (forum du Monde) 
</p>
<p>On retrouve le m&#234;me ph&#233;nom&#232;ne pour les noms de lieu : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;Europe veut garder la t&#234;te du FMI. (Lib&#233;ration, 10 mars 2004) 
</p>
<p>Les noms de personnes sont encore plus labiles. Nous laisserons de c&#244;t&#233; les exemples o&#249; le 
nom de personne est en fait devenu la d&#233;signation d&#8217;une entreprise, d&#8217;un stade ou d&#8217;un lieu 
quelconque.  
</p>
<p>Une rencontre d&#8217;un niveau technique assez m&#233;diocre &#224; l&#8217;Abb&#233; Deschamps. (stade 
</p>
<p>d&#8217;Auxerre, Journal L&#8217;&#233;quipe) 
</p>
<p>M&#234;me sans prendre en compte ces ph&#233;nom&#232;nes de transfert de sens, les exemples de 
cat&#233;gorisation changeante sont l&#233;gion. Un nom de personne peut r&#233;f&#233;rer &#224; une &#339;uvre, &#224; un 
objet ou &#224; tout autre &#233;l&#233;ment ayant un lien direct ou non avec la personne. 
</p>
<p>J&#8217;ai tout Chirac sur l&#8217;&#233;tag&#232;re 
</p>
<p>Pierre est gar&#233; en face. (cf. Cadiot et Visetti 2001, p. 167) 
</p>
<p>Il existe par ailleurs des ph&#233;nom&#232;nes plus rares mais bien attest&#233;s o&#249; un nom propre, 
particuli&#232;rement un nom de la personne, ne renvoie pas au r&#233;f&#233;rent traditionnel. C&#8217;est par 
exemple le cas de l&#8217;antonomase, largement &#233;tudi&#233;e par S. Leroy (2003) : mon oncle est un 
vrai Harpagon ne r&#233;f&#232;re pas &#224; un personnage r&#233;el s&#8217;appelant Harpagon.  
</p>
<p>On voit &#224; travers ces exemples rapides que les entit&#233;s nomm&#233;es ne se comportent pas 
fondamentalement diff&#233;remment des autres unit&#233;s linguistiques. L&#8217;exemple le plus connu est 
certainement celui du Prix Goncourt introduit initialement par Kayser (1988). Celui-ci 
distingue plusieurs sens diff&#233;rents, suivant qu&#8217;il s&#8217;agisse du prix, de sa valeur mon&#233;taire, du 
livre qui a obtenu le prix, de l&#8217;institution ou encore de l&#8217;auteur.  
</p>
<p>3.2 R&#233;f&#233;rentialit&#233; des entit&#233;s nomm&#233;es 
</p>
<p>Nous retrouvons sous ces th&#232;mes d&#233;j&#224; &#233;voqu&#233;s &#224; de multiples reprises dans la litt&#233;rature, le 
questionnement habituel sur la notion de polys&#233;mie. Comment traiter ces cas ? Leurs sens 
sont-ils mutuellement incompatibles ou peut-on d&#233;finir une th&#233;orie unificatrice du sens 
rendant compte de ces multiples emplois ? 
</p>
<p>Les entit&#233;s nomm&#233;es constituent &#224; cet &#233;gard une classe de syntagmes proche des termes. De 
nombreux travaux &#233;trangers ne font d&#8217;ailleurs le plus souvent pas de diff&#233;rences entre ces 
&#233;l&#233;ments (Collier et al., 2000), d&#8217;autant que certains domaines contribuent &#224; rendre floues les 
distinctions qui semblent classiques par ailleurs. Dans une phrase issue d&#8217;un corpus de 
biologie comme Abd-a interagit avec trx, a-t-on affaire &#224; des entit&#233;s nomm&#233;es ou &#224; des 
termes ? Abd-a constitue-t-il un nom de g&#232;nes ou une classe ? Les r&#233;ponses ne sont pas 
toujours claires. Le propre des entit&#233;s nomm&#233;es est malgr&#233; tout d&#8217;&#234;tre r&#233;f&#233;rentielles. C&#8217;est 
essentiellement ce trait qui d&#233;finit leur nature et qui les distingue des termes. Leurs propri&#233;t&#233;s 
r&#233;f&#233;rentielles ont &#233;t&#233; bien &#233;tudi&#233;es, depuis Frege (1892) et Kripke (notion de d&#233;signateur 
rigide, cf. Kripke, 1982), jusqu&#8217;aux travaux r&#233;cents dans des cadres linguistiques divers 
(Charolles, 2002).  
</p>
<p>On remarque cependant la m&#234;me variation au niveau des entit&#233;s nomm&#233;es qu&#8217;au niveau des 
termes. Il existe de multiples fa&#231;ons de d&#233;signer une personne ou un objet, il n&#8217;y a pas de nom 
unique et in&#233;vitable (cf. l&#8217;exemple de Frege autour de l&#8217;&#233;toile du soir et l&#8217;&#233;toile du matin  qui 
d&#233;signent toutes deux V&#233;nus &#8230;). On peut d&#232;s lors s&#8217;interroger sur la nature r&#233;f&#233;rentielle de 
l&#8217;entit&#233; nomm&#233;e employ&#233;e en discours. Il ne s&#8217;agit bien &#233;videmment pas de nier les 
possibilit&#233;s r&#233;f&#233;rentielles de l&#8217;entit&#233; nomm&#233;e mais il est permis de se demander si l&#8217;emploi </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;une entit&#233; nomm&#233;e en discours ne laisse pas de c&#244;t&#233; son statut r&#233;f&#233;rentiel : celui-ci serait en 
quelque sorte dans un &#233;tat latent. Concr&#232;tement, cela signifie qu&#8217;en discours il n&#8217;y a pas de 
r&#233;elle diff&#233;rence entre une affirmation portant sur une entit&#233;, sur un terme ou sur un autre 
groupe nominal. Comme le rappelle Charolles (2002, p. 7-10), dans la litt&#233;rature linguistique, 
les auteurs distinguent la d&#233;notation de la r&#233;f&#233;rence. La d&#233;notation &#171; prend acte du fait que le 
signifi&#233; (des signes linguistiques) exprime un concept muni d&#8217;une certaine intension (i.e. un 
ensemble d&#8217;attributs caract&#233;ristiques en propre) et que cette intension d&#233;limite virtuellement 
son extension (c&#8217;est-&#224;-dire une classe d&#8217;&#234;tres satisfaisants ces attributs) &#187;. L&#8217;acte de r&#233;f&#233;rence 
est quant &#224; lui &#171; un accord non entre deux pens&#233;es (&#8230;) mais entre deux pens&#233;es &#224; propos de 
quelque chose et cela par le biais de la production, en contexte, d&#8217;une expression 
r&#233;f&#233;rentielle &#187;. Nous reprenons &#224; notre compte l&#8217;essentiel de ces d&#233;finitions mais &#224; l&#8217;inverse 
de Charolles, nous soutenons que l&#8217;on peut alors parler d&#8217;op&#233;ration linguistique pour la 
d&#233;notation, contrairement &#224; la r&#233;f&#233;rence qui ressortit &#224; une logique visant &#224; apparier niveau 
linguistique et niveau extra-linguistique.  
</p>
<p>En discours, l&#8217;aspect d&#233;notationnel est primordial, passant bien avant l&#8217;aspect r&#233;f&#233;rentiel. 
Cette distinction n&#8217;est pas seulement d&#8217;ordre philosophique : il s&#8217;agit d&#8217;une dimension 
essentielle de l&#8217;interpr&#233;tation du texte dans la mesure o&#249; la d&#233;notation, &#224; l&#8217;inverse de la 
r&#233;f&#233;rence, peut supporter une sous-sp&#233;cification par d&#233;faut1. Ainsi, dans l&#8217;exemple de biologie 
ci-dessus, la r&#233;solution du fait que Abd-a r&#233;f&#232;re &#224; un g&#232;ne particulier ou &#224; une classe n&#8217;a pas 
lieu d&#8217;&#234;tre dans la mesure o&#249; cela est inutile pour l&#8217;interpr&#233;tation de la phrase. Le fait que 
l&#8217;&#233;toile du soir et l&#8217;&#233;toile du matin d&#233;signent la m&#234;me plan&#232;te n&#8217;est pas fondamental au niveau 
linguistique mais est en revanche essentiel pour assigner une valeur de v&#233;rit&#233; aux assertions 
&#233;mises sur ces objets2. On rejoint ici le point de vue de Searle (1983) pour qui &#171; l&#8217;acte de 
r&#233;f&#233;rence, le processus de r&#233;f&#233;renciation &#187;, inclut une dimension externe &#224; la langue &#171; &#224; savoir 
que l&#8217;entit&#233; vis&#233; par cet acte, la chose (au sens le plus g&#233;n&#233;ral du terme) &#224; laquelle il renvoie, 
existe au-del&#224; de ce que le locuteur en dit, en dehors de son esprit et de celui de celles ou ceux 
&#224; qui il s&#8217;adresse &#187;. (Charolles, 2002, p. 38) 
</p>
<p>3.3 Cat&#233;gorisation &#224; partir d&#8217;une ontologie 
</p>
<p>La plupart des auteurs  qui se sont int&#233;ress&#233;s &#224; la question du traitement automatique de la 
m&#233;tonymie ou de la synecdoque proposent des approches fond&#233;es sur des ressources 
g&#233;n&#233;rales comme Wordnet (cf. l&#8217;atelier The lexicon and figurative language durant ACL 2003 
[Wellington, 2003]). Il est en effet difficile d&#8217;acqu&#233;rir directement &#224; partir du corpus des 
informations comme une d&#233;composition des objets en relation partie-tout. L&#8217;analogie peut 
jouer un r&#244;le et permettre le rep&#233;rage de relations de d&#233;pendance sp&#233;cifiques (voir [Nehaniv, 
1999] ou [Lepage, 2003]) mais ceci reste toutefois marginal dans la plupart des cas.  
</p>
<p>Les exemples et les remarques de la section pr&#233;c&#233;dente semblent toutefois aller dans le sens 
de la th&#233;orie d&#233;fendue par Cadiot et Visetti (2001), qui contestent l&#8217;existence pr&#233;alable d&#8217;une 
</p>
<p>                                                
</p>
<p>1 On retrouve ici la notion de profondeur variable de Kayser et Coulon [1981], que nous interpr&#233;tons ainsi : 
l&#8217;analyse n&#8217;a pas &#224; se pr&#233;occuper d&#8217;un certain nombre de traits s&#233;mantiques latents tant que ceux-ci ne sont 
pas activ&#233;s de mani&#232;re explicite. D&#8217;une mani&#232;re plus globale, il n&#8217;est pas toujours n&#233;cessaire de chercher &#224; 
d&#233;sambigu&#239;ser finement le r&#244;le de l&#8217;entit&#233; suivant la t&#226;che ou l&#8217;application vis&#233;e. 
</p>
<p>2 Les cas o&#249; l&#8217;analyse de la r&#233;f&#233;rence est obligatoire sont somme toute relativement rares pour les applications de 
traitement automatique des langues. Le cadre privil&#233;gi&#233; est la commande de syst&#232;me, la communication avec 
des robots ou tout autre cadre o&#249; la parole entra&#238;ne une action tr&#232;s directe sur le monde.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ontologie, notamment pour les groupes nominaux d&#233;termin&#233;s et plus g&#233;n&#233;ralement, pour les 
unit&#233;s dites r&#233;f&#233;rentielles. La notion de &#171; facette &#187; (Cruse, 2004) rend partiellement compte de 
l&#8217;aspect polys&#233;mique des entit&#233;s envisag&#233;es mais plusieurs auteurs ont soulign&#233; que les 
facettes ne rendent pas compte des liens entre les diff&#233;rents sens envisag&#233;es. Cadiot et Visetti 
montrent bien qu&#8217;il s&#8217;agit essentiellement de ph&#233;nom&#232;nes de synecdoque et de m&#233;tonymie, 
qui ruinent toute tentative directement r&#233;f&#233;rentielle mais qui appellent plut&#244;t une analyse 
dynamique par &#171; profilage &#187; de sens en fonction du contexte, pour reprendre une partie de la 
terminologie employ&#233;e par les deux auteurs (sur ces questions, voir aussi Fass, 1988). Chibout 
(1999) donne une typologie claire de plusieurs figures de style impliquant des liens 
s&#233;mantiques complexes entre unit&#233;s linguistiques mises en jeu. Une mod&#233;lisation par un 
ensemble de traits activables en contexte semble particuli&#232;rement appropri&#233;.  
</p>
<p>Plusieurs auteurs ont propos&#233; des mod&#232;les informatiques visant &#224; r&#233;soudre des probl&#232;mes 
relativement similaires aux n&#244;tres. La plupart se situent dans le cadre du dialogue homme-
machine et s&#8217;en tiennent &#224; identifier les probl&#232;mes de r&#233;f&#233;rence qui se posent lors de l&#8217;analyse 
(Salmon-Alt, 2001). Citons toutefois l&#8217;&#233;tude de Pospescu-Belis et al. (1999) qui pr&#233;sente un 
mod&#232;le de r&#233;solution des anaphores fond&#233; sur le mod&#232;le des repr&#233;sentations mentales. 
L&#8217;auteur &#233;voque la notion de point de vue et la variabilit&#233; de la r&#233;f&#233;rence dans un cadre 
conversationnel. Il faut d&#8217;ailleurs souligner le r&#244;le de la t&#226;che pour ce type d&#8217;analyse.  
</p>
<p>Il semble toutefois difficile de se passer de toute cat&#233;gorisation pr&#233;alable, de se fonder 
uniquement sur une approche constructiviste, voire herm&#233;neutique, &#224; partir d&#8217;unit&#233; de sens 
activables (ou non) en contexte3. Les cat&#233;gories pr&#233;d&#233;termin&#233;es souffrent des m&#234;mes d&#233;fauts 
que les facettes de Cruse : l&#8217;analyse ne dit rien des rapports entre date et &#233;v&#233;nement, et, plus 
g&#233;n&#233;ralement, n&#8217;explique pas le continuum qui existe entre les diff&#233;rents aspects s&#233;mantiques 
des entit&#233;s en contexte. Mais au moins une telle analyse ne pr&#233;juge pas de la s&#233;mantique de 
l&#8217;entit&#233; en contexte, elle laisse ouverte une liste de possibles. On laissera &#224; la s&#233;mantique 
lexicale, voire infra lexicale, le soin de mettre au jour les liens entre traits activables au sein 
du mot.  
</p>
<p>4 Proposition de mod&#233;lisation 
</p>
<p>Nous gardons de ce qui pr&#233;c&#232;de l&#8217;id&#233;e d&#8217;hypoth&#232;ses construites en parall&#232;le, pouvant &#234;tre 
activ&#233;es ou non en contexte. Nous nous inspirons des structures de traits &#224; la DATR (Evans et 
Gazdar, 1996) et du lexique g&#233;n&#233;ratif (Pustejovsky, 1995) pour coder les diff&#233;rents traits 
activables pour les entit&#233;s. 
</p>
<p>4.1 Mod&#233;lisation sous forme de structures de traits 
</p>
<p>La hi&#233;rarchie de types d&#233;finie dans le cadre des conf&#233;rences MUC et pr&#233;sent&#233;e dans la 
premi&#232;re partie de cette &#233;tude a prouv&#233; son efficacit&#233;. Il nous semble donc pertinent de nous 
appuyer sur celle-ci pour d&#233;finir des types de base.  
</p>
<p>La plupart des propositions qui ont par la suite &#233;t&#233; faites pour raffiner cette hi&#233;rarchie ou 
d&#8217;autres cat&#233;gorisations ayant une granularit&#233; comparable (Sekine, 2004) ont &#233;t&#233; confront&#233;es 
</p>
<p>                                                
</p>
<p>3 Une proposition allant toutefois dans ce sens est celle de Sabah (1996) qui propose un mod&#232;le informatis&#233; 
appel&#233; &#171; carnet d&#8217;esquisses &#187;. On retrouve sous ce terme une vue dynamique de la s&#233;mantique en train de se 
construire de mani&#232;re dynamique, en fonction du co-texte et du contexte. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>aux probl&#232;mes de polys&#233;mie soulev&#233;s ci-dessus. Pour reprendre un exemple d&#233;j&#224; entrevu : 
comment faire un choix parmi les diff&#233;rents sens du mot ONU, a-t-on affaire &#224; l&#8217;institution, 
au b&#226;timent ou &#224; l&#8217;ensemble des personnes qui composent l&#8217;organisme ? Il s&#8217;agit 
essentiellement d&#8217;un m&#233;canisme de focalisation permettant de mettre en avant un aspect de 
l&#8217;entit&#233; en contexte. Nous proposons donc d&#8217;adjoindre un trait saillance aux entit&#233;s afin de 
mettre en avant de mani&#232;re explicite cette focalisation qui peut changer de mani&#232;re 
dynamique en fonction du contexte. Reprenons quelques uns des exemples d&#233;j&#224; trait&#233;s : 
</p>
<p>L&#8217;ONU n&#8217;acceptera pas une telle d&#233;cision. 
</p>
<p>Entity{  
    Lexical_unit=ONU; 
    Sem{  
</p>
<p>Type=organization;  
Focalisation=diplomatic_org; } 
</p>
<p>} 
 
</p>
<p>L&#8217;ONU d&#233;signe dans ce cadre l&#8217;organisation politique. Cette information peut &#234;tre rep&#233;r&#233;e &#224; 
partir d&#8217;informations sur le monde, sur le r&#244;le de l&#8217;ONU sur la sc&#232;ne diplomatique et sur 
l&#8217;analyse du groupe verbal qui suit l&#8217;entit&#233;. On peut rapprocher cette information du r&#244;le 
t&#233;lique d&#233;fini par Pustejovsky (1995) : le propre de l&#8217;ONU, c&#8217;est de prendre et de faire 
appliquer des d&#233;cisions d&#8217;ordre diplomatique.  
</p>
<p>Le journal t&#233;l&#233;vis&#233; a eu lieu en direct de l&#8217;ONU. 
</p>
<p>Entity{  
    Lexical_unit=ONU; 
    Sem{  
</p>
<p>Type=organization;  
Focalisation=location; } 
</p>
<p>} 
</p>
<p>Ici le verbe avoir lieu fait clairement allusion &#224; un processus en train de se d&#233;rouler dans un 
lieu donn&#233;. La focalisation porte donc sur la localisation de l&#8217;&#233;v&#233;nement.  
</p>
<p>L&#8217;ONU &#233;tait en gr&#232;ve hier. 
</p>
<p>Entity{  
    Lexical_unit=ONU; 
    Sem{  
</p>
<p>Type=organization;  
Focalisation=human_org; } 
</p>
<p>} 
</p>
<p>Le m&#234;me ph&#233;nom&#232;ne op&#232;re ici. La notion de gr&#232;ve active la notion d&#8217;organisation compos&#233;e 
d&#8217;individus (human_org). Le trait de focalisation est donc mis &#224; jour. L&#8217;exemple qui suit est &#224; 
cet &#233;gard moins clair : 
</p>
<p>L&#8217;ONU a f&#234;t&#233; ses 50 ans.  
</p>
<p>Entity{  
    Lexical_unit=ONU; 
    Sem{  
</p>
<p>Type=organization;  
Focalisation=none; } 
</p>
<p>} 
</p>
<p>L&#8217;auteur pr&#234;te ici des traits humains &#224; l&#8217;institution. Il ne s&#8217;agit plus d&#8217;une simple synecdoque 
mais d&#8217;un ph&#233;nom&#232;ne m&#233;taphorique, en tant que tel plus difficile &#224; analyser automatiquement. 
D&#8217;un c&#244;t&#233;, le verbe f&#234;ter invite &#224; voir une communaut&#233; d&#8217;individus dans le sujet. Mais c&#8217;est 
bien l&#8217;institution qui a 50 ans. Une focalisation sur la communaut&#233; d&#8217;individus serait quelque 
peu abusive dans ce cas. Peut-&#234;tre faut-il s&#8217;en tenir &#224; une certaine sous-sp&#233;cification au niveau </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de l&#8217;analyse automatique : l&#8217;institution et les individus qui la composent forment ici une unit&#233; 
syncr&#233;tique qui &#233;chappe partiellement &#224; l&#8217;analyse.  
</p>
<p>4.2 Du formulaire d&#8217;entit&#233;s &#224; la r&#233;solution des anaphores nominales  
</p>
<p>L&#8217;analyse des entit&#233;s suivant le mod&#232;le que nous proposons demande &#224; avoir acc&#232;s &#224; des 
informations sur les entit&#233;s. Ces informations peuvent &#234;tre qualifi&#233;es de connaissances sur le 
monde ou encore de connaissances de sens commun. La fa&#231;on d&#8217;encoder ces informations 
doit &#234;tre g&#233;n&#233;rique mais il semble encore hors de port&#233;e de d&#233;velopper des syst&#232;mes &#224; large 
couverture ayant une telle masse de connaissances sur le monde. Le plus grand projet connu 
allant dans ce sens est le projet CYC de Doug Lenat (Lenat et Guha, 1990) mais les articles de 
l&#8217;auteur ont depuis r&#233;v&#233;l&#233; que la t&#226;che &#233;tait sans doute hors d&#8217;atteinte et les r&#233;alisations ont 
jusqu&#8217;&#224; maintenant &#233;t&#233; peu concluantes (Lenat, 2001).  
</p>
<p>L&#8217;analyse des entit&#233;s  demande une mod&#233;lisation fine du domaine vis&#233;. Une tentative allant 
dans ce sens est celle des conf&#233;rences d&#8217;extraction d&#8217;information &#224; partir de textes MUC 
(Message Understanding Conferences). Plusieurs t&#226;ches g&#233;n&#233;riques ont &#233;t&#233; d&#233;finies dans le 
cadre de ces conf&#233;rences, dont le remplissage de &#171; formulaires d&#8217;entit&#233; &#187;. Le formulaire 
permet de relier &#224; une entit&#233; donn&#233;e un ensemble d&#8217;informations de natures diverses. En nous 
fondant sur les exp&#233;riences men&#233;es dans le cadre de MUC, nous pouvons offrir par exemple 
une repr&#233;sentation enrichie de la notion d&#8217;organisation. 
</p>
<p>Entity{  
    Lexical_unit=ONU; 
    Sem{  
</p>
<p>Type=organization;  
Focalisation=none; 
</p>
<p>         } 
         EntityTemplate{ 
</p>
<p>IsLocatedIn = New_York; 
IsComposedOf = employees &amp;&amp; diplomats; 
IsLeadedBy = Kofi_Annan; 
KindOf =diplomatic_org) 
</p>
<p>         } 
} 
</p>
<p>Ce type de structures permet d&#8217;avoir acc&#232;s aux diff&#233;rentes composantes de l&#8217;entit&#233; et permet 
d&#8217;expliquer certaines d&#233;nominations fond&#233;es sur la m&#233;tonymie ou la mise en avant d&#8217;un des 
aspects de l&#8217;objet vis&#233;. Le mod&#232;le d&#233;velopp&#233; rend explicite les apparents changements de 
cat&#233;gorie qui peuvent s&#8217;expliquer par une fonction d&#8217;acc&#232;s &#224; un des aspects de l&#8217;entit&#233;. Les 
outils d&#8217;extraction d&#8217;information (Poibeau, 2003) peuvent ici s&#8217;appliquer pour contribuer &#224; 
produire ces ressources automatiquement. Ils demandent toutefois la mise au point de 
syst&#232;mes collaboratifs, dans la mesure o&#249; toute l&#8217;information ne peut pas &#234;tre acquise 
directement &#224; partir du corpus. Le peu de ressources disponibles pour le fran&#231;ais, notamment 
au niveau s&#233;mantique, rend la t&#226;che particuli&#232;rement difficile.  
</p>
<p>4.3 La question des anaphores nominales 
</p>
<p>Les m&#233;canismes de mise en avant d&#8217;un aspect de l&#8217;entit&#233; en fonction du contexte restent &#224; 
&#233;tudier. L&#8217;entit&#233; est constitu&#233;e d&#8217;un ensemble de traits permettant d&#8217;avoir acc&#232;s &#224; ses 
diff&#233;rentes composantes. Il est ainsi possible d&#8217;expliquer certaines anaphores nominales qui 
r&#233;sistent traditionnellement &#224; l&#8217;analyse : 
</p>
<p>L&#8217;organisation de Kofi Annan&#8230; 
</p>
<p>Syn(L&#8217;organisation de Kofi Annan) = ONU </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Justification:  IsLeadedBy(ONU)=Kofi Annan 
</p>
<p>Ces m&#233;canismes peuvent &#234;tre mod&#233;lis&#233;s au moyen de fonctions &#224; la Melc&#8217;uk pour offrir une 
version unifi&#233;e du lexique, int&#233;grant connaissances linguistiques et connaissances sur le 
monde. En ne cherchant pas &#224; rendre explicite la r&#233;f&#233;rence de l&#8217;entit&#233; par rapport &#224; un mod&#232;le 
du monde, notre mod&#233;lisation se d&#233;marque nettement des travaux effectu&#233;s dans le cadre de 
l&#8217;analyse du dialogue (Popescu-Belis, 1999 ; Salmon-Alt, 2001). Elle rend en revanche 
explicite les effets de sens au sein de l&#8217;entit&#233;, afin d&#8217;expliquer les ph&#233;nom&#232;nes de synecdoque 
et de m&#233;tonymie entrevus pr&#233;c&#233;demment.   
</p>
<p>5 Conclusion 
</p>
<p>Nous avons essay&#233; de montrer dans cet article qu&#8217;une m&#234;me entit&#233; peut &#234;tre d&#233;sign&#233;e de 
multiples fa&#231;ons et que les noms d&#233;signant ces entit&#233;s sont par nature polys&#233;miques. 
L&#8217;analyse ne peut donc se limiter &#224; une tentative de r&#233;solution d&#8217;anaphores mais doit mettre 
en &#233;vidence les possibilit&#233;s de nommage s&#8217;appuyant essentiellement sur deux op&#233;rations de 
nature linguistique : la synecdoque et la m&#233;tonymie. Nous avons enfin pr&#233;sent&#233; une 
mod&#233;lisation permettant de rendre explicite les diff&#233;rentes d&#233;signations en discours, en 
unifiant le mode de repr&#233;sentation des connaissances linguistiques et des connaissances sur le 
monde.  
</p>
<p>6 R&#233;f&#233;rences 
</p>
<p>ABERDEEN J., BURGER J., DAY D., HIRSCHMAN L, ROBINSON P., VILAIN M. (1995) &#171; MITRE: 
Description of the Alembic System as Used for MUC-6 &#187;, In Actes MUC-6, Morgan 
Kaufmann Publishers, San Francisco. 
</p>
<p>APPELT, D., MARTIN D. (1999) &#171; Named  Entity Recognition in Speech: Approach and results 
using the TextPro System &#187;, Proceedings of the DARPA Broadcast News Workshop, 
Herndon, Virginia. 
</p>
<p>CADIOT P., VISETTI Y.-M. (2001) Pour une th&#233;orie des formes s&#233;mantiques, PUF, Paris.  
</p>
<p>CHAROLLES M. (2002) La r&#233;f&#233;rence et les expressions r&#233;f&#233;rentielles en fran&#231;ais. Ophrys. 
Paris. 
</p>
<p>CHIBOUT K. (1999) La polys&#233;mie lexicale : observations linguistiques, mod&#233;lisation 
informatique, &#233;tudes ergonomique et psycho-linguistique. Th&#232;se de doctorat, Universit&#233; 11.   
</p>
<p>COLLIER N., NOBATA C., TSUJII J. (2000) &#171; Comparison between Tagged Corpora for the 
Named Entity Task &#187;, In Actes 18th International Conference on Computational Linguistics 
(COLING 2000), Saarbr&#252;cken, Allemagne. pp. 201-207.  
</p>
<p>CRUSE A. (2004) Meaning in language, an introduction to semantics and pragmatics, Oxford 
University Press, Oxford.  
</p>
<p>EVANS R. et GAZDAR G. (1996) &#171; DATR : A language for lexical knowledge representation &#187;, 
Computational Linguistics, n&#176;22(2). pp. 167-216. 
</p>
<p>FASS D. (1988). &#171; Metonymy and metaphor: what's the difference? &#187;. In Actes 12th 
International Conference on Computational Linguistics (COLING 1988), Budapest, Hungrie, 
pp. 177-181.  
</p>
<p>FERRET O., GRAU B., HURAULT-PLANTET M., ILLOUZ G., MONCEAUX L., ROBBA I., VILNAT 
A. (2001) &#171; Finding An Answer Based on the Recognition of the Question Focus &#187;, Actes de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TREC 2001. 
</p>
<p>FREGE G. (1971) &#171; &#220;ber Sinn und Bedeutung &#187;. In Zeitschrift f&#252;r Philosophie und 
philosophische Kritik, 100. Trad. fr. &#171; Sens et d&#233;notation &#187;. In Ecrits logiques et 
philosophiques, Seuil, Paris. pp. 102-126. 
</p>
<p>GRISHMAN R. (1995) &#171; Where's the Syntax? The NYU MUC-6 System &#187;, In Actes MUC-6, 
Morgan Kaufmann Publishers, San Francisco. 
</p>
<p>KAYSER D., COULON D. (1981) &#171; Variable-Depth Natural Language Understanding &#187;. 7th 
International Joint Conference on Artificial Intelligence. Vancouver. pp.64-66. 
</p>
<p>KAYSER D. (1988) &#171; What kind of thing is a concept? &#187;, In  Computational Intelligence 
n&#176;4(2). pp. 158-165  
</p>
<p>KRIPKE S. (1982) La logique des noms propres, &#201;ditions de Minuit, Paris. 
</p>
<p>KUBALA F., SCHWARTZ R., STONE R., WEISCHEDEL R. (1998) &#171; Named Entity Extraction 
from Speech &#187;, Proceedings of the DARPA Broadcast Transcription and Understanding 
Workshop, Lansdowne, Virginie. 
</p>
<p>LENAT D., GUHA R. (1990) Building large knowledge-based systems, Addison-Wesley, 
Reading.  
</p>
<p>LENAT D. (2001) &#171; Common sense and the mind of HAL &#187;. In Stork D. (&#233;d.), From 2001 to 
2001: HAL legacy.  
</p>
<p>LEPAGE Y. (2003) De l&#8217;analogie rendant compte de la commutation en linguistique, 
Habilitation &#224; Diriger des recherches, Universit&#233; de Grenoble.  
</p>
<p>LEROY S. (2003) &#171; Antonomase, m&#233;taphore et nom propre : identification ou 
cat&#233;gorisation ? &#187;, In Travaux linguistiques du CerLiCO. Vol 16 (1. Morphosyntaxe du 
lexique &#8211; 2 : cat&#233;gorisation et mise en discours), PUR, Rennes. pp. 161-178 
</p>
<p>LEROY S. (2004) Le nom propre en fran&#231;ais, Ophrys, Paris.  
</p>
<p>MUC-7 (1998) Proceedings of the Seventh Message Understanding Conference. 
</p>
<p>NEHANIV C.L. &#233;d. (1999) Computation for Metaphors, Analogy, and Agents, Lecture Notes in 
Artificial Intelligence n&#176;1562, Springer-Verlag,  Allemagne. 
</p>
<p>POIBEAU T. (2003) Extraction automatique d&#8217;information. Herm&#232;s. Paris.  
</p>
<p>POPESCU-BELIS A., ROBBA I., SABAH G. (1998) &#171; Reference Resolution Beyond Coreference: 
a Conceptual Frame and its Application &#187;. Proceedings of Coling-ACL 1998, Montreal, 
Canada. pp.1046-1052. 
</p>
<p>PUSTEJOVSKY J. (1995) The generative lexicon, MIT Press, Cambridge, 1995. 
</p>
<p>SABAH G. (1996) &#171; Le carnet d'esquisses : une m&#233;moire interpr&#233;tative dynamique &#187;, Actes 
Repr&#233;sentation des formes et Intelligence artificielle, Rennes. 
</p>
<p>SALMON-ALT S. (2001) &#171; Reference Resolution within the Framework of Cognitive 
Grammar &#187;, International Colloquium on Cognitive Science, San Sebastian. 
</p>
<p>SEARLE J. (1983) L&#8217;intentionnalit&#233;. Essai de philosophie de l&#8217;esprit, &#201;ditions de Minuit, Paris. 
</p>
<p>SEKINE S. (2004) &#171; Definition, dictionaries and tagger for Extended Named Entity 
Hierarchy &#187;, Actes LREC 2004, Lisbonne.  
</p>
<p>WELLINGTON A. &#233;d. (2003) The Lexicon and Figurative Language. Atelier ACL 2003. 
Sapporo. Japon. </p>

</div></div>
</body></html>