<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me Multi-Agent pour la d&#233;tection et la correction des erreurs cach&#233;es en langue Arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Un syst&#232;me multi-agent pour la d&#233;tection et la correction des 
erreurs cach&#233;es en langue arabe 
</p>
<p>(1) Chiraz  Ben Othmane Zribi, (2) F&#233;riel Ben Fraj, (3) Mohamed Ben Ahmed 
</p>
<p>Laboratoire RIADI &#8211; Universit&#233; La Manouba 
ENSI, La Manouba, Tunisie  
</p>
<p>(1) Chiraz.benothmane@riadi.rnu.tn, (2)Feriel.BenFraj@riadi.rnu.tn,  
(3)Mohamed.BenAhmed@riadi.rnu.tn  
</p>
<p>Mots-cl&#233;s :   Erreurs orthographiques cach&#233;es,  D&#233;tection, Correction, Syst&#232;me multi-
agent, Analyse linguistique, Langue arabe 
Keywords:   Hidden spelling errors, Detection, Correction, Multi-Agent System, 
Linguistic analysis, Arabic language 
</p>
<p>R&#233;sum&#233;  
</p>
<p>Cet article s&#8217;int&#233;resse au probl&#232;me des erreurs orthographiques produisant des mots 
lexicalement corrects dans des textes en langue arabe. Apr&#232;s la description de l&#8217;influence des 
sp&#233;cificit&#233;s de la langue arabe sur l&#8217;augmentation du risque de commettre ces fautes cach&#233;es, 
nous proposons une classification hi&#233;rarchique de ces erreurs en deux grandes cat&#233;gories ; &#224; 
savoir syntaxique et s&#233;mantique. Nous pr&#233;sentons, &#233;galement, l&#8217;architecture multi-agent que 
nous avons adopt&#233;e pour la d&#233;tection et la correction des erreurs cach&#233;es en textes arabes. 
Nous examinons alors, les comportements sociaux des agents au sein de leurs organisations 
respectives et de leur environnement. Nous exposons vers la fin la mise en place et 
l&#8217;&#233;valuation du syst&#232;me r&#233;alis&#233;. 
</p>
<p>Abstract  
</p>
<p>In this paper, we address the problem of detecting and correcting hidden spelling errors in 
Arabic texts. Hidden spelling errors are morphologically valid words and therefore they 
cannot be detected or corrected by conventional spell checking programs. In the work 
presented here, we investigate this kind of errors as they relate to the Arabic language. We 
start by proposing a classification of these errors in two main categories: syntactic and 
semantic, then we present our multi-agent system for hidden spelling errors detection and 
correction. The multi-agent architecture is justified by the need for collaboration, parallelism 
and competition, in addition to the need for information exchange between the different 
analysis phases. Finally, we describe the testing framework used to evaluate the system 
implemented.    </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chiraz Ben Othmane Zribi, F&#233;riel Ben Fraj et Mohamed Ben Ahmed 
</p>
<p>1 Introduction 
Le probl&#232;me des erreurs cach&#233;es pr&#233;sente une incommodit&#233; pour  les scripteurs lors de la 
saisie de leurs textes. Ces fautes ne sont autres que des erreurs orthographiques qui produisent 
pour autant des mots lexicalement corrects. La pr&#233;sence d&#8217;un vocable au sein d&#8217;un contexte 
syntaxique ou s&#233;mantique qui n&#8217;est pas le sien peut rendre insens&#233;e toute la phrase. L&#8217;exemple 
suivant illustre ce ph&#233;nom&#232;ne : 
</p>
<p>Exemple : Le jardinier utilise le g&#226;teau pour b&#234;cher la terre 
Le mot &quot;g&#226;teau&quot; est introduit dans un contexte qui ne lui est pas appropri&#233;. Cette faute de 
frappe peut &#234;tre corrig&#233;e en la changeant par le vocable &quot;r&#226;teau&quot;. 
</p>
<p>Les statistiques r&#233;alis&#233;es par Eastman et Oakman (1991) (Verberne, 2002), affirment que les 
erreurs cach&#233;es comptent 25% parmi toutes les erreurs orthographiques commises et 
contenues dans leur corpus de r&#233;f&#233;rence. Mitton (1987) leur attribue une valeur plus grande &#224; 
savoir : 40% parmi toutes les erreurs orthographiques &#233;tudi&#233;es. Ces deux valeurs assez 
importantes ont rendu l&#8217;&#233;tude de ce genre d&#8217;erreurs une n&#233;cessit&#233; en soi. En effet, plusieurs 
recherches ont &#233;t&#233; entreprises dans le but de rem&#233;dier &#224; ce probl&#232;me. Nous pouvons, alors, 
citer comme exemples : les recherches de Golding (Golding, Dan, 1996) qui a &#233;tudi&#233; ce genre 
d&#8217;erreurs en langue anglaise. Il a ainsi propos&#233; de multiples m&#233;thodes comme la m&#233;thode de 
Bayes (Golding, 1995), la m&#233;thode des trigrammes des parties du discours (Golding, Schabes, 
1996) et la m&#233;thode &#224; base de r&#233;seaux neuronaux dite Winnow (Golding, Dan, 1999). Le 
chinois a &#233;t&#233; aussi trait&#233; par les deux chercheurs Jianhua et Xiaolong (Xiaolong, Jianhua, 
2001). Le su&#233;dois a fait l&#8217;objet d&#8217;une recherche pareille avec Bigert et Knutsson (Bigert, 
Knutsson, 2002). 
</p>
<p>En ce qui concerne la langue arabe, aucun travail n&#8217;a &#233;t&#233; r&#233;alis&#233; sur les erreurs cach&#233;es malgr&#233; 
l&#8217;importance de l&#8217;entreprise d&#8217;une telle recherche. La langue arabe pr&#233;sente, en effet, des 
sp&#233;cificit&#233;s qui rendent le risque de commettre une erreur cach&#233;e plus important que pour les 
autres langues. Nous nous sommes donc propos&#233;s de nous int&#233;resser &#224; ce probl&#232;me en 
construisant un syst&#232;me permettant &#224; la fois de d&#233;tecter et de corriger ce type d&#8217;erreurs 
pouvant survenir dans des textes arabes. A cause de la complexit&#233; de ce travail, nous avons 
&#233;t&#233; amen&#233;s &#224; &#233;mettre certaines hypoth&#232;ses pour restreindre les champs de nos investigations. 
Nous avons consid&#233;r&#233; alors l&#8217;arabe non voyell&#233; avec une seule erreur cach&#233;e par phrase. 
L&#8217;erreur consiste en une seule faute d&#8217;&#233;dition &#224; savoir ; l&#8217;ajout d&#8217;un caract&#232;re, l&#8217;omission d&#8217;un 
caract&#232;re, la substitution d&#8217;un caract&#232;re par un autre ou l&#8217;interversion de deux caract&#232;res 
adjacents. Des statistiques ont en effet montr&#233; que l'une (seulement) de ces op&#233;rations est &#224; 
l'origine d&#8217;une erreur orthographique dans 90% des cas (Ben Hamadou, 1993). 
</p>
<p>Dans ce qui suit, nous d&#233;crivons dans la premi&#232;re section les sp&#233;cificit&#233;s de la langue arabe 
qui ont particip&#233; &#224; augmenter le risque de commettre des erreurs cach&#233;es lors de la saisie des 
textes. Dans la seconde section, nous pr&#233;sentons la classification que nous avons adopt&#233;e pour 
ces erreurs. Sur la base de ladite classification  et de nos besoins, nous avons opt&#233; pour une 
architecture multi-agent dont la conception est d&#233;crite dans la troisi&#232;me section de l&#8217;article. La 
quatri&#232;me section est consacr&#233;e, quant &#224; elle,  &#224; la description des r&#233;sultats de l&#8217;&#233;valuation du 
syst&#232;me mis en place. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me multi-agent pour la d&#233;tection et la correction des erreurs cach&#233;es en langue 
arabe 
</p>
<p>2 Quelles difficult&#233;s pour la langue arabe ? 
Pour la langue arabe, le probl&#232;me des erreurs cach&#233;es s&#8217;aggrave et se complique encore plus 
que pour d&#8217;autres langues (notamment indo-europ&#233;ennes). En effet, on se trouve confront&#233; 
dans cette langue, &#224; des contraintes d&#8217;&#233;criture et &#224; diverses ambigu&#239;t&#233;s : telles que 
l&#8217;agglutination des enclinom&#232;nes aux formes simples, l&#8217;ambigu&#239;t&#233; grammaticale, et la 
proximit&#233; lexicale des formes textuelles. 
</p>
<p>2.1 Le ph&#233;nom&#232;ne d&#8217;agglutination 
</p>
<p>L&#8217;agglutination est l&#8217;ajout de pr&#233;fixes appel&#233;s &#8216;proclitiques&#8217; et de suffixes dits &#8216;enclitiques&#8217; 
aux formes simples pour obtenir ce qu&#8217;on a appelle  des &quot;formes agglutinantes&quot; ou encore des 
&quot;hyperformes&quot;. Les proclitiques et les enclitiques forment l&#8217;ensemble des enclinom&#232;nes1 de la 
langue arabe. Une erreur cach&#233;e peut &#234;tre la cons&#233;quence d&#8217;une op&#233;ration d&#8217;ajout ou 
d&#8217;omission d&#8217;un enclinom&#232;ne &#224; un radical. Cette op&#233;ration peut donner naissance &#224; une forme 
textuelle licite, mais malencontreusement, inject&#233;e dans un contexte qui ne lui est pas 
appropri&#233;. 
</p>
<p>2.2 L&#8217;ambigu&#239;t&#233; grammaticale 
</p>
<p>Les mots en arabe pr&#233;sentent une ambigu&#239;t&#233; grammaticale. Les statistiques r&#233;alis&#233;es par 
(Debili et al., 2002) sur un texte en langue arabe confirment cette ambigu&#239;t&#233;. L&#8217;auteur a 
constat&#233; l&#8217;importance du taux d&#8217;ambigu&#239;t&#233; grammaticale pour les textes voyell&#233;s qui est &#233;gale 
&#224; 5,63 en moyenne. Ce taux est augment&#233; par l&#8217;absence des voyelles pour atteindre en 
moyenne 8,71 cat&#233;gories grammaticales par forme textuelle. L&#8217;ambigu&#239;t&#233; grammaticale est 
l&#8217;une des causes de l&#8217;abondance des erreurs cach&#233;es en langue arabe car ce genre de fautes 
peut &#234;tre d&#251; &#224; une confusion dans l&#8217;interpr&#233;tation grammaticale des formes textuelles. 
</p>
<p>2.3 La proximit&#233; lexicale 
</p>
<p>La caract&#233;ristique des mots arabes la plus remarquable pour notre probl&#233;matique est celle de 
la proximit&#233; lexicale. En effet, les mots en langue arabe sont tr&#232;s proches graphiquement les 
uns des autres, nous pouvons l&#8217;affirmer en nous basant sur l&#8217;&#233;tude r&#233;alis&#233;e par (Ben Othmane 
Zribi, 1998) &#224; ce propos. Cette exp&#233;rience consistait &#224; appliquer les quatre op&#233;rations 
d&#8217;&#233;dition, pr&#233;c&#233;demment cit&#233;es, sur tous les mots d&#8217;un dictionnaire de la langue. Parmi les 
formes, automatiquement construites, on a proc&#233;d&#233; par d&#233;nombrer les graphies correctes, 
comptant ainsi ce qu&#8217;on appelle &#1524;le nombre de mots approchants ou lexicalement voisins&#1524;. 
Ces comptages nous ont donn&#233; une id&#233;e claire sur la similarit&#233; dite aussi le degr&#233; de 
ressemblance entre les vocables d&#8217;une langue. Ainsi, avons-nous constat&#233; que les mots en 
langue arabe sont beaucoup plus proches les uns des autres avec un nombre moyen de formes 
voisines de 26,5 : valeur importante compar&#233;e &#224; celle calcul&#233;e pour la langue fran&#231;aise &#233;gale &#224; 
3,5 et celle relative &#224; l&#8217;anglais &#233;gale &#224; 3. De ce fait, la ressemblance typographique des mots 
</p>
<p>                                                 
1   Ce sont des particules affixes repr&#233;sentant les pronoms personnels, les conjonctions, les pr&#233;positions, etc. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chiraz Ben Othmane Zribi, F&#233;riel Ben Fraj et Mohamed Ben Ahmed 
</p>
<p>en arabe augmente le risque de tomber sur des erreurs cach&#233;es, comme elle augmente la taille 
de la liste des candidats &#224; la correction lors de la phase de correction. 
</p>
<p>3 Typologie des erreurs cach&#233;es 
Pour d&#233;tecter les erreurs cach&#233;es, une simple analyse morphologique s&#8217;av&#232;re insuffisante 
puisque ces erreurs engendrent des formes morphologiquement correctes mais erron&#233;es sur le 
plan syntaxique ou s&#233;mantique (voir m&#234;me pragmatique). Ainsi, une phrase contenant une 
erreur syntaxique est lexicalement correcte mais la structuration de ses mots est incorrecte. On 
parle alors d&#8217;un d&#233;r&#232;glement syntaxique. Par contre, une phrase contenant une erreur 
s&#233;mantique est d&#233;nu&#233;e de sens puisque l&#8217;erreur est un mot venant s&#8217;intercaler dans un contexte 
s&#233;mantique qui n&#8217;est pas le sien. 
</p>
<p>3.1 Les anomalies syntaxiques 
</p>
<p>Les d&#233;r&#232;glements grammaticaux peuvent &#234;tre de diff&#233;rents types. Ainsi, la classe des 
anomalies grammaticale peut &#234;tre subdivis&#233;e en des sous-classes d&#8217;erreurs syntaxiques qui se 
pr&#233;sentent comme suit :  
</p>
<p>&#8226; Les erreurs d&#8217;accord : Ce sont des d&#233;r&#232;glements syntaxiques qui sont dus au non-
respect des contraintes d&#8217;accord qui g&#232;rent la langue. Ils causent des incompatibilit&#233;s 
au niveau des informations morpho-syntaxiques relatives aux mots d&#8217;une m&#234;me 
phrase. Exemple :  (&#1577;&#1585;&#1610;&#1576;&#1603;&#1604;&#1575;) &quot;&#1585;&#1610;&#1576;&#1603;&#1604;&#1575; &#1577;&#1576;&#1610;&#1602;&#1581;&#1604;&#1575; &#1585;&#1601;&#1575;&#1587;&#1605;&#1604;&#1575; &#1593;&#1601;&#1585;&quot;, (&quot;Le voyageur a soulev&#233; le grand 
valise &#187;, la forme correcte est : la grande).  
</p>
<p>&#8226; Les erreurs li&#233;es &#224; la transitivit&#233; : La transitivit&#233; est un lien syntaxique (et 
s&#233;mantique) entre un verbe et un compl&#233;ment d&#8217;objet lui succ&#233;dant en g&#233;n&#233;ral. 
L&#8217;absence de ce compl&#233;ment ou son apparition l&#224; o&#249; il ne faut pas rend incorrecte la 
phrase. Exemple : (&#1609;&#1600;&#1617;&#1605;&#1581;&#1604;&#1575;&#1576;) &quot;&#1609;&#1605;&#1581;&#1604;&#1575; &#1593;&#1610;&#1590;&#1585;&#1604;&#1575; &#1590;&#1585;&#1605;&quot; (&quot;le nourrisson est tomb&#233; malade 
fi&#232;vre&quot;, la forme correcte est : &#224; cause de la fi&#232;vre). 
</p>
<p>&#8226; Les erreurs d&#8217;agrammaticalit&#233; : Ce genre de fautes concerne l&#8217;agencement des 
cat&#233;gories grammaticales au sein de la phrase. Exemple: (&#1607;&#1600;&#1576;&#1578;&#1603;&#1605;) &quot;&#1607;&#1576;&#1578;&#1603;&#1606; &#1610;&#1601; &#1585;&#1610;&#1583;&#1605;&#1604;&#1575; &#1587;&#1604;&#1580;&quot;  
(&quot;le directeur s&#8217;est assis dans nous l&#8217;&#233;crivons&quot;, la forme correcte est : son bureau).  
</p>
<p>3.2 Les anomalies syntaxiques 
</p>
<p>Tout comme pour le niveau syntaxique, les anomalies s&#233;mantiques peuvent &#234;tre scind&#233;es en 
des sous classes d&#8217;erreurs dont nous pouvons citer : 
</p>
<p>&#8226; Les incompatibilit&#233;s s&#233;mantiques : Une incompatibilit&#233; s&#233;mantique consiste en 
l&#8217;injection d&#8217;un mot dans un contexte s&#233;mantique qui n&#8217;est pas le sien. Exemple :   
(&#1577;&#1603;&#1605;&#1587;) &quot;&#1577;&#1585;&#1610;&#1576;&#1570;  &#1577;&#1603;&#1587; &#1583;&#1575;&#1610;&#1589;&#1604;&#1575; &#1583;&#1580;&#1608;&quot; (&quot;Le p&#233;cheur a trouv&#233; une grande voie&quot;, la forme correcte 
est : poisson ; en langue arabe le mot poisson est au f&#233;minin) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me multi-agent pour la d&#233;tection et la correction des erreurs cach&#233;es en langue 
arabe 
</p>
<p>&#8226; Les incompl&#233;tudes s&#233;mantiques : L&#8217;omission ou l&#8217;insertion l&#224; o&#249; il ne faut pas d&#8217;une 
conjonction de coordination ou toute autre particule rendent parfois la phrase d&#233;nu&#233;e 
de sens (Aloulou, 1996).  Exemple : &quot;(&#1609;&#1603;&#1576;&#1601;) &#1609;&#1603;&#1576; &#1583;&#1604;&#1608;&#1604;&#1575; &#1578;&#1576;&#1585;&#1590; &quot; (&quot;j&#8217;ai frapp&#233; le gar&#231;on il a 
pleur&#233;&quot;, la forme correcte est : ensuite il a pleur&#233;). 
</p>
<p>4 La solution propos&#233;e 
La complexit&#233; de notre probl&#232;me ainsi constat&#233;e, ainsi que la hi&#233;rarchie pr&#233;sent&#233;e dans la 
classification des erreurs cach&#233;es d&#233;notent la n&#233;cessit&#233; d&#8217;une interf&#233;rence entre les diff&#233;rentes 
phases d&#8217;analyse pour le traitement de ce genre d&#8217;erreurs. En effet, la d&#233;tection et la correction 
des erreurs syntaxiques n&#233;cessitent la contribution des connaissances s&#233;mantiques. De m&#234;me 
que, le traitement des erreurs cach&#233;es de type s&#233;mantique n&#233;cessite des retours en arri&#232;re 
syntaxiques pour une meilleure d&#233;tection et correction.  
</p>
<p>En cons&#233;quence, nous avons opt&#233; pour une architecture multi-agent o&#249; les diff&#233;rents agents 
travaillent en : collaboration, comp&#233;tition, coordination et parall&#233;lisme afin d&#8217;atteindre 
l&#8217;objectif global du syst&#232;me. Chacun d&#8217;eux apporte sa contribution &#224; la solution finale. Tous 
s&#8217;organisent dans une soci&#233;t&#233; commune o&#249; ils peuvent discuter et coop&#233;rer.   
</p>
<p>5 L&#8217;architecture du syst&#232;me 
Pour qu&#8217;un syst&#232;me de v&#233;rification des textes en langue naturelle soit efficace, il doit avoir &#224; 
sa disposition un ensemble d&#8217;informations linguistiques concernant ces textes. C&#8217;est pour 
cette raison que nous nous sommes propos&#233;s d&#8217;effectuer une analyse morpho-syntaxique des 
textes &#224; traiter. Ces textes analys&#233;s serviront comme entr&#233;es pour notre syst&#232;me. La figure1 
illustre l&#8217;architecture g&#233;n&#233;rale de notre syst&#232;me.  
</p>
<p>5.1 Le groupe syntaxique d&#8217;agents 
</p>
<p>Ce groupe est form&#233; de quatre agents &#224; savoir ; l&#8217;agent Accord, l&#8217;agent Transitivit&#233;, l&#8217;agent 
Compatibilit&#233; syntaxique et l&#8217;agent superviseur des trois premiers. Le  superviseur syntaxique 
re&#231;oit alors le texte &#224; v&#233;rifier et l&#8217;envoie phrase par phrase &#224; ses coll&#232;gues de la m&#234;me soci&#233;t&#233; 
d&#8217;agents.  
</p>
<p>&#8226; L&#8217;agent Accord  v&#233;rifie la validit&#233; des contraintes d&#8217;accord en appliquant un 
ensemble de r&#232;gles d&#8217;accord (on compte environ 800 r&#232;gles). 
</p>
<p>&#8226; L&#8217;agent Transitivit&#233;  essaie de d&#233;tecter les anomalies pouvant exister entre les verbes 
et leurs compl&#233;ments d&#8217;objet.  
</p>
<p>&#8226; L&#8217;agent Compatibilit&#233; syntaxique v&#233;rifie la structuration des Cat&#233;gories 
Grammaticales des Hyperformes (HyperCGs) dans la phrase en consid&#233;rant des 
s&#233;quences ternaires d&#8217;HyperCGs. Il utilise &#224; cet effet, une matrice &#224; trois dimensions 
qui indique la validit&#233; de ces s&#233;quences ternaires. 
</p>
<p>Les travaux de ces trois agents sont contr&#244;l&#233;s par le superviseur. En effet, une fois que l&#8217;un 
d&#8217;eux d&#233;tecte une anomalie, il informe ses coll&#232;gues pour qu&#8217;ils arr&#234;tent leurs traitements 
respectifs et annonce la nouvelle au superviseur pour que ce dernier d&#233;clenche le processus de 
correction.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chiraz Ben Othmane Zribi, F&#233;riel Ben Fraj et Mohamed Ben Ahmed 
</p>
<p> 
</p>
<p>Figure 1 : Architecture du syst&#232;me Multi-Agent de d&#233;tection/correction des erreurs cach&#233;es  
</p>
<p>5.2 Le groupe s&#233;mantique d&#8217;agents 
</p>
<p>Ce groupe est aussi constitu&#233; de quatre agents. Le premier est le superviseur qui envoie le 
texte d&#233;coup&#233; en phrases aux autres agents du m&#234;me groupe. Les trois autres sont : l&#8217;agent 
Cooccurrence, l&#8217;agent R&#233;p&#233;tition et l&#8217;agent Coordinateur. 
</p>
<p>Notons : 
</p>
<p>Ph = {m1, ..., mi,..., mn} : la phrase soumise &#224; la v&#233;rification  s&#233;mantique. 
</p>
<p>C = {c-k, ..., c-1, c1, ..., ck} : l&#8217;ensemble des mots entourant le mot analys&#233; (en 
consid&#233;rant une fen&#234;tre de taille k). 
</p>
<p>L = {l1, &#8230;, li, &#8230;, ln} : l&#8217;ensemble des lemmes des mots de la phrase. 
</p>
<p>&#8226; L&#8217;agent Cooccurrence  v&#233;rifie pour chaque mot de la phrase s&#8217;il poss&#232;de des 
affinit&#233;s s&#233;mantiques avec son contexte. Il proc&#232;de alors de deux fa&#231;ons, ne pouvant 
&#234;tre qualifi&#233;es de diff&#233;rentes mais plut&#244;t de compl&#233;mentaires. Cet agent va, tout 
d&#8217;abord, chercher s&#8217;il existe des collocations2 entre le mot cible d&#8217;analyse et les mots 
l&#8217;avoisinant dans le m&#234;me contexte. Les collocations, si elles sont trouv&#233;es, vont 
</p>
<p>                                                 
2 Une collocation est une association habituelle de deux ou plusieurs termes (collocats) au sein d&#8217;un discours. 
</p>
<p>Texte 
analys&#233; 
</p>
<p>Analyseur 
morpho-
syntaxique
</p>
<p> Groupe syntaxique 
d&#8217;agents 
</p>
<p> 
 
&#1; 
</p>
<p>Agent Syntaxe 
 
 
</p>
<p>&#9786; 
Agent Accord 
</p>
<p> 
</p>
<p>&#9786;    
Agent Transitivit&#233; 
</p>
<p> 
</p>
<p>&#9786; 
Agent Compatibilit&#233; 
</p>
<p>Grammaticale    
  
</p>
<p> Groupe s&#233;mantique 
d&#8217;agents 
</p>
<p> 
</p>
<p>&#1; 
Agent S&#233;mantique 
</p>
<p> 
 
</p>
<p>&#9786; 
Agent Cooccurrence 
</p>
<p> 
</p>
<p>&#9786;    
Agent R&#233;p&#233;tition 
</p>
<p> 
</p>
<p>&#9786; 
Agent Coordinateur   
</p>
<p> 
</p>
<p>&#1;
</p>
<p>Agent 
Correction 
</p>
<p>&#9786; 
Agent G&#233;n&#233;rateur 
</p>
<p>de mots 
avoisinants  
</p>
<p>Le mot 
soup&#231;onn&#233; 
d&#8217;erreur 
</p>
<p>Texte 
brut 
</p>
<p> 
</p>
<p>Phrases   
candidates 
</p>
<p>La liste tri&#233;e 
des 
</p>
<p>propositions de 
correction 
</p>
<p>Liste minimis&#233;e 
des candidats de 
</p>
<p>correction 
</p>
<p>&#1; 
</p>
<p>&#2; 
&#3;
</p>
<p>&#4;
</p>
<p>&#5;
</p>
<p>&#6; 
&#7; 
</p>
<p>&#8; 
&#9;
</p>
<p>&#10; 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me multi-agent pour la d&#233;tection et la correction des erreurs cach&#233;es en langue 
arabe 
</p>
<p>permettre de conforter chaque mot dans le contexte o&#249; il a &#233;t&#233; mis. Ainsi, pour 
chaque vocable est attribu&#233;e une valeur dite information mutuelle calcul&#233;e &#224; l&#8217;aide de 
la formule suivante : 
</p>
<p>)jp(c&#215;)ip(m
</p>
<p>)jc,ip(m
Log
</p>
<p>k&#8804;j&#8804;k
max=)iI(m  
</p>
<p>Avec p(mi) la probabilit&#233; d&#8217;observer mi, p(cj) la probabilit&#233; d&#8217;observer cj et p(mi,cj) la 
probabilit&#233; de les observer ensemble. 
</p>
<p>Affirmer que le mot mi est en collocation avec son contexte revient &#224; &#233;valuer la 
valeur I(mi) de la fa&#231;on suivante : 
</p>
<p>- si I(mi) est positive, alors mi est en collocation avec son contexte. 
</p>
<p>- si I(mi) s&#8217;approche de la valeur nulle alors mi n&#8217;a pas de rapport avec son 
contexte. 
</p>
<p>- si I(mi) est n&#233;gative alors mi a des distributions compl&#233;mentaires avec son 
contexte. 
</p>
<p>Outre les collocations, l&#8217;agent Cooccurrence va chercher s&#8217;il existe des 
cooccurrences ordinaires entre chaque mot cible d&#8217;analyse et son entourage. Pour ce 
faire, nous avons choisi d&#8217;utiliser la formule des probabilit&#233;s conditionnelles de 
Bayes suivante : 
</p>
<p>p(C)
</p>
<p>)ip(m&#215;)imp(C=C)ip(m  
</p>
<p>Plus la valeur p(mi/C) est &#233;lev&#233;e, plus le mot analys&#233; mi a d&#8217;affinit&#233; s&#233;mantique au 
sein de son contexte C. 
</p>
<p>&#8226; L&#8217;agent R&#233;p&#233;tition, pour sa part, cherche si le lemme de la forme textuelle &#224; 
analyser se r&#233;p&#232;te au sein du texte lui m&#234;me. Il se base sur le principe qui dit que &#8216;les 
mots ou plus pr&#233;cis&#233;ment les lemmes des mots d&#8217;un texte ont tendance &#224; se r&#233;p&#233;ter 
dans le texte lui-m&#234;me&#8217;. En effet, d&#8217;apr&#232;s des comptages r&#233;alis&#233;s (Ben Othmane 
Zribi, Ben Ahmed, 2003) sur un corpus textuel en langue arabe appartenant &#224; un 
domaine bien particulier, nous savons qu&#8217;une forme textuelle peut appara&#238;tre en 
moyenne 5,6 fois alors qu&#8217;un lemme peut appara&#238;tre en moyenne 6,3 fois et ce dans 
le m&#234;me texte. Nous calculons alors pour chaque lemme sa fr&#233;quence d&#8217;occurrence 
au sein de tout le texte, avec la formule suivante :  
</p>
<p>lemmesdetotalnombre
il de soccurrenced' nombre)ip(l =  
</p>
<p>Nous consid&#233;rons alors que plus la valeur de la probabilit&#233; p(li) est &#233;lev&#233;e plus il y a 
affinit&#233; s&#233;mantique entre le mot mi &#224; v&#233;rifier dont le lemme est li et le texte o&#249; il a &#233;t&#233; 
mis. 
</p>
<p>&#8226; L&#8217;agent Coordinateur  englobe les r&#233;sultats trouv&#233;s par les deux agents 
Cooccurrence et R&#233;p&#233;tition dans la formule :  
</p>
<p>( ) )ip(l*&#955;Cimp*&#946;)iI(m*&#945;)iF(m ++=  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chiraz Ben Othmane Zribi, F&#233;riel Ben Fraj et Mohamed Ben Ahmed 
</p>
<p>Avec F(mi) la fr&#233;quence totale d&#8217;apparition du mot mi au sein du texte, &#945; , &#946;  et &#955;  
sont trois coefficients li&#233;s aux trois probabilit&#233;s contextuelles calcul&#233;es, les valeurs 
associ&#233;es &#224; ces coefficients ne peuvent &#234;tre pr&#233;dites, mais il faut qu&#8217;elles soient 
obtenues &#224; travers des tests et des comparaisons de pertinence. Toutefois, nous 
estimons que les valeur de &#945;  et &#946;  sont plus importantes que celle de &#955;  vu que 
l&#8217;importance du contexte voisin du mot analys&#233; est, sans aucun doute, plus grande 
que celle du contexte lointain de ce m&#234;me mot. 
</p>
<p>Pour chaque mot, nous calculons la valeur de F(mi) qui, compar&#233;e aux valeurs des 
mots voisins et &#224; une valeur seuil, va confirmer ou infirmer la validit&#233; de l&#8217;existence 
de ce mot entour&#233; de ses voisins. 
</p>
<p>Le r&#233;sultat final de la v&#233;rification s&#233;mantique est aussit&#244;t envoy&#233; au superviseur pour 
qu&#8217;il d&#233;clenche le processus de correction. 
</p>
<p>5.3 Collaboration des deux groupes d&#8217;agents : syntaxique et s&#233;mantique 
</p>
<p>Avant le d&#233;clanchement du processus de correction, les deux groupes d&#8217;agents syntaxique et 
s&#233;mantique entrent en communication par le biais de leurs superviseurs respectifs. Etant 
donn&#233; que ces deux groupes d&#8217;agents sont lanc&#233;s en parall&#232;le &#224; la recherche d&#8217;une erreur 
cach&#233;e dans une phrase, le premier qui trouve doit informer l&#8217;autre et demander une 
confirmation sur l&#8217;erreur.  Si consensus, il y a, le processus de d&#233;tection est arr&#234;t&#233; et l&#8217;erreur 
est envoy&#233;e vers l&#8217;agent Correction. Il s&#8217;agit dans ce cas l&#224;, d&#8217;une erreur cach&#233;e provoquant un 
d&#233;r&#232;glement &#224; la fois syntaxique et s&#233;mantique. Dans le cas contraire,  le deuxi&#232;me groupe 
d&#8217;agents continue de balayer toute la phrase &#224; la recherche d&#8217;une autre erreur. Deux cas se 
pr&#233;sentent : si ce dernier n&#8217;a pas trouv&#233; alors il informe le premier groupe, qui,  lui a d&#233;j&#224; 
trouv&#233; une erreur,  pour qu&#8217;il d&#233;clenche la correction. Si par contre, il a trouv&#233; une autre 
erreur, il l&#8217;envoie &#224; son tour au premier groupe demandant une confirmation. Si les deux 
groupes se mettent d&#8217;accord sur cette nouvelle erreur, alors c&#8217;est cette derni&#232;re erreur qui est 
envoy&#233;e pour &#234;tre corrig&#233;e &#224; la place de la premi&#232;re erreur. Enfin, s&#8217;il les deux groupes ne se 
sont pas mis d&#8217;accord sur aucune erreur chacun envoie de son c&#244;t&#233; sa propre pr&#233;sum&#233;e erreur 
&#224; l&#8217;agent Correction.  
</p>
<p>5.4 L&#8217;agent Correction 
</p>
<p>Finalement, l&#8217;agent Correction vient corriger les fautes d&#233;tect&#233;es par les deux v&#233;rificateurs : 
syntaxique et s&#233;mantique. Il proc&#232;de alors par la g&#233;n&#233;ration de toutes les formes proches de la 
forme erron&#233;e, &#224; une diff&#233;rence d&#8217;&#233;dition pr&#232;s pour former ainsi une liste contenant les 
candidats &#224; la correction. Ladite liste est assez longue. Elle contient en moyenne plus de 27 
formes candidates et peut atteindre 185 formes : valeur pouvant &#234;tre augment&#233;e par 
l&#8217;agglutination des enclinom&#232;nes (Ben Othmane Zribi, 1998). Pour r&#233;duire ce grand nombre 
de propositions, l&#8217;agent Correction substitue la forme erron&#233;e par chacune des formes 
propos&#233;es et forme ainsi un ensemble de phrases candidates. Ces derni&#232;res seront r&#233;inject&#233;es, 
au fur et &#224; mesure de leur production, dans les deux v&#233;rificateurs (autrement dit la partie 
d&#233;tection du syst&#232;me). Celles qui contiennent toujours des anomalies seront &#233;limin&#233;es et c&#8217;est 
le m&#234;me sort que subissent les propositions qui leur sont respectives. La liste des propositions 
restantes est par la suite tri&#233;e par ordre de pertinence et pr&#233;sent&#233;e &#224; l&#8217;utilisateur. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me multi-agent pour la d&#233;tection et la correction des erreurs cach&#233;es en langue 
arabe 
</p>
<p>6 Exp&#233;rimentation et r&#233;sultats 
Notre objectif &#233;tant la r&#233;alisation d&#8217;un syst&#232;me capable de d&#233;tecter et de corriger les erreurs 
cach&#233;es, nous avons alors impl&#233;ment&#233; &#224; ce stade de notre travail une partie du syst&#232;me, d&#233;j&#224; 
con&#231;u, &#224; savoir le groupe syntaxique d&#8217;agents et int&#233;gr&#233; l&#8217;agent Correction de (Ben Othmane 
Zribi, 1998).  
</p>
<p>De plus, pour &#233;valuer le syst&#232;me ainsi r&#233;alis&#233;, nous avons besoin d&#8217;un corpus textuel 
contenant suffisamment d&#8217;erreurs cach&#233;es. Chacune de ces derni&#232;res doit &#234;tre identifi&#233;e avec 
sa forme corrective. Toutefois, faute de corpus contenant ce genre d&#8217;erreurs sous sa forme 
naturelle, nous avons choisi de cr&#233;er notre propre corpus manuellement. Nous avons, ainsi, 
g&#233;n&#233;r&#233; parmi les formes qui existent dans le corpus de test une liste d&#8217;erreurs cach&#233;es tout en 
respectant les hypoth&#232;ses restrictives de nos champs d&#8217;investigation. Ce corpus, qui 
constituera l&#8217;entr&#233;e de notre syst&#232;me, contient environ 750 formes textuelles non voyell&#233;es, 
dans lesquelles nous avons introduit 100 erreurs cach&#233;es du type syntaxique.   
</p>
<p>6.1 R&#233;sultats de l&#8217;&#233;valuation de la d&#233;tection 
</p>
<p>L&#8217;exp&#233;rimentation de notre syst&#232;me de d&#233;tection des erreurs cach&#233;es  a donn&#233; des r&#233;sultats 
que nous jugeons satisfaisants avec un pourcentage de pr&#233;cision &#233;gal &#224; 80% et un pourcentage 
de rappel &#233;gal &#224; 77%. La pr&#233;sence de bruit 20% (1- Pr&#233;cision) et de silence 23% (1 &#8211; Rappel) 
s&#8217;expliquer principalement par les causes cit&#233;es ci-dessous : 
</p>
<p>- La largeur de la port&#233;e de v&#233;rification dans les phrases manipul&#233;es. En effet, malgr&#233; 
la phase de segmentation, le nombre de mots constituant certaines phrases reste 
important ce qui contrarie les principes de v&#233;rification de certains agents qui 
travaillent &#224; base de phrases courtes. 
</p>
<p>- La comp&#233;tition entre agents, qui a &#233;t&#233; l&#8217;une des principales hypoth&#232;ses de notre 
choix d&#8217;une architecture multi-agent et qui s&#8217;est manifest&#233;e par le fait que le 
premier agent d&#233;tecteur de faute arr&#234;te ses coll&#232;gues et ce, sans savoir si la faute 
d&#233;tect&#233;e est ou n&#8217;est pas une fausse alarme. 
</p>
<p>- La non exhaustivit&#233; de nos r&#232;gles linguistiques et l&#8217;absence de certaines 
informations linguistiques. Les notions d&#8217;&quot;anim&#233;&quot; ou d&#8217;&quot;inanim&#233;&quot;, pourraient par 
exemple aider &#224; effectuer une meilleure v&#233;rification syntaxique ou s&#233;mantique. 
</p>
<p>6.2 R&#233;sultats de l&#8217;&#233;valuation de la correction 
</p>
<p>Cette phase a &#233;t&#233; test&#233;e &#224; deux niveaux ; d&#8217;abord apr&#232;s l&#8217;obtention de toutes les propositions 
de correction, ensuite apr&#232;s la minimisation de la liste de ces propositions. Les r&#233;sultats 
obtenus sont illustr&#233;s dans le tableau ci-apr&#232;s. 
</p>
<p> Couverture Pr&#233;cision Ambigu&#239;t&#233; Proposition Position 
Initialement 100% 100% 100% 82,5  8,7  
</p>
<p>Apr&#232;s minimisation 93,3% 86,6% 86,6% 18,4  2,8  
</p>
<p>Figure 2 Evaluation du correcteur des erreurs cach&#233;es </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chiraz Ben Othmane Zribi, F&#233;riel Ben Fraj et Mohamed Ben Ahmed 
</p>
<p>Nous remarquons que notre m&#233;thode de minimisation de la liste des propositions a permis de 
diminuer, consid&#233;rablement, le nombre moyen des propositions de 77% (de 82,5 &#224; 18,4 
propositions en moyenne). Cette diminution, bien qu&#8217;elle ait r&#233;duit l&#8217;ambigu&#239;t&#233; de notre 
correcteur de 13,4%, ne s&#8217;est pas pass&#233;e sans d&#233;g&#226;ts. Elle s&#8217;est faite aux d&#233;pens de la 
couverture (diminution de 6,4%) et de la pr&#233;cision (diminution de 13,4%). 
</p>
<p>7 Conclusions et perspectives 
La partie du syst&#232;me ainsi impl&#233;ment&#233;e a donn&#233; des r&#233;sultats assez satisfaisants. Les choix 
que nous avons adopt&#233;s nous ont permis d&#8217;atteindre nos objectifs initialement dress&#233;s. 
Cependant, nous estimons que les r&#233;sultats obtenus peuvent &#234;tre encore am&#233;lior&#233;s d&#8217;abord par 
l'amendement des r&#232;gles linguistiques utilis&#233;es et ensuite par la prise en consid&#233;ration des 
informations s&#233;mantiques. Aussi, l&#8217;impl&#233;mentation du groupe s&#233;mantique d&#8217;agents figure 
parmi les perspectives proches de nos travaux de recherche. 
</p>
<p>R&#233;f&#233;rences  
ALOULOU C. (1996), Utilisation de l'approche multi-crit&#232;re pour orienter un processus de correction 
des erreurs d'accord dans des phrases de la langue arabe non voyell&#233;e, M&#233;moire de DEA, Institut 
Sup&#233;rieur de Gestion, Universit&#233; de Tunis III. 
</p>
<p>BEN HAMADOU A. (1993), V&#233;rification et correction automatique par analyse affixale des textes &#233;crits 
en langue naturelle : le cas de l&#8217;arabe non voyell&#233;, Th&#232;se d&#8217;&#233;tat en informatique, Facult&#233; des Sciences 
de Tunis. 
</p>
<p>BEN OTHMANE ZRIBI C. (1998), De la synth&#232;se lexicographique &#224; la d&#233;tection et &#224; la correction des 
graphies fautives arabes, Th&#232;se de doctorat, Universit&#233; de Paris XI, Orsay. 
</p>
<p>BEN OTHMANE ZRIBI C. et BEN AHMED M. (2003), Le contexte au service de la correction des 
graphies fautives arabes, TALN'03, Nantes. 
</p>
<p>BIGERT J., KNUTSSON O. (2002), Robust Error Detection : A Hybrid Approach Combining 
Unsupervised Error Detection and Linguistic Knowledge, In Proceedings of Robust Methods in 
Analysis of Natural Language Data (ROMAND&#8217;02), Frascati, Italie. 
</p>
<p>DEBILI F., ACHOUR H., SOUISSI E. (2002), La langue arabe et l'ordinateur:  De l'&#233;tiquetage 
grammatical &#224; la voyellation automatique, Correspondances N&#176;71, Lyon. 
</p>
<p>GOLDING A. R. (1995), A bayesian hybrid method for context- sensitive spelling correction, In 
Proceedings of the Third Workshop on Very Large Corpora, Cambridge, Massachusetts, USA, pages 
39-53. 
</p>
<p>GOLDING A. R., SCHABES Y. (1996), Combining trigram-based and feature-based methods for 
context-Sensitive Spelling Correction, ACL&#8217;96, San Fransisco. 
</p>
<p>GOLDING A. R., DAN R., (1999), A winnow-based approach to context-sensitive spelling correction, 
Machine Learning, 34(1-3), 107-130. 
</p>
<p>VERBERNE S. (2002), Context sensitive spell checking based on word trigram probabilities, M&#233;moire 
de Mast&#232;re, Universit&#233; de Nijmegen. 
</p>
<p>XIAOLONG W., JIANHUA L. (2001), Combine trigram and automatic weight distribution in Chinese 
spelling error correction, Journal of computer Science and Technology, Volume 17 Issue 6, Province, 
China. </p>

</div></div>
</body></html>