<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Y a-t-il une taille optimale pour les r&#232;gles de successions intervenant dans l'&#233;tiquetage grammatical ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2005, Dourdan, 6-10 juin 2005 
</p>
<p>Y a-t-il une taille optimale des r&#232;gles de succession         
intervenant dans l&#8217;&#233;tiquetage grammatical ? 
</p>
<p>Fathi Debili (1), Emna Souissi (2) 
</p>
<p>(1) CNRS &#8211; ICAR &#8211; ENS LSH 
15, Parvis Ren&#233; Descartes 
</p>
<p>69342 Lyon Cedex 07 
France 
</p>
<p>fathi.debili@wanadoo.fr 
</p>
<p>(2) ISG &#8211; Universit&#233; de Sousse 
BP 763 Sousse 4000 - Tunisie 
</p>
<p>emna.souissi@isgs.rnu.tn 
 
</p>
<p>Mots-cl&#233;s : Etiquetage grammatical, r&#232;gle de succession, taille des r&#232;gles, cha&#238;nage de r&#232;gles, 
r&#232;gle attest&#233;e, r&#232;gle simul&#233;e, discriminance, couverture, &#233;valuation en usage vs &#233;valuation en 
d&#233;finition d&#8217;un ensemble de r&#232;gles. 
</p>
<p>Keywords: Part-of-speech tagging, tag sequences, rule length, rule composition, attested rule, 
simulated rule, evaluation of generation vs evaluation of analysis. 
</p>
<p>R&#233;sum&#233; 
La quasi-totalit&#233; des &#233;tiqueteurs grammaticaux mettent en &#339;uvre des r&#232;gles qui portent sur les 
successions ou collocations permises de deux ou trois cat&#233;gories grammaticales. Leurs performances 
s&#8217;&#233;tablissent &#224; hauteur de 96% de mots correctement &#233;tiquet&#233;s, et &#224; moins de 57% de phrases 
correctement &#233;tiquet&#233;es. Ces r&#232;gles binaires et ternaires ne repr&#233;sentent qu&#8217;une fraction du total des 
r&#232;gles de succession que l&#8217;on peut extraire &#224; partir des phrases d&#8217;un corpus d&#8217;apprentissage, alors 
m&#234;me que la majeure partie des phrases (plus de 98% d&#8217;entre elles) ont une taille sup&#233;rieure &#224; 3 mots. 
Cela signifie que la plupart des phrases sont analys&#233;es au moyen de r&#232;gles reconstitu&#233;es ou simul&#233;es &#224; 
partir de r&#232;gles plus courtes, ternaires en l&#8217;occurrence dans le meilleur des cas. Nous montrons que 
ces r&#232;gles simul&#233;es sont majoritairement agrammaticales, et que l&#8217;avantage inf&#233;rentiel qu&#8217;apporte le 
cha&#238;nage de r&#232;gles courtes pour parer au manque d&#8217;apprentissage, plus marqu&#233; pour les r&#232;gles plus 
longues, est largement neutralis&#233; par la permissivit&#233; de ce processus dont toutes sortes de poids, 
scores ou probabilit&#233;s ne r&#233;ussissent pas &#224; en hi&#233;rarchiser la production afin d&#8217;y distinguer le 
grammatical de l&#8217;agrammatical. Force est donc de reconsid&#233;rer les r&#232;gles de taille sup&#233;rieure &#224; 3, 
lesquelles, il y a une trentaine d&#8217;ann&#233;es, avaient &#233;t&#233; d&#8217;embl&#233;e &#233;cart&#233;es pour des raisons essentielle-
ment li&#233;es &#224; la puissance des machines d&#8217;alors, et &#224; l&#8217;insuffisance des corpus d&#8217;apprentissage. Mais si 
l&#8217;on admet qu&#8217;il faille d&#233;sormais &#233;tendre la taille des r&#232;gles de succession, la question se pose de 
savoir jusqu&#8217;&#224; quelle limite, et pour quel b&#233;n&#233;fice. Car l&#8217;on ne saurait non plus plaider pour une 
port&#233;e des r&#232;gles aussi longue que les plus longues phrases auxquelles elles sont susceptibles d&#8217;&#234;tre 
appliqu&#233;es. Autrement dit, y a-t-il une taille optimale des r&#232;gles qui soit suffisamment petite pour que 
leur apprentissage puisse converger, mais suffisamment longue pour que tout cha&#238;nage de telles r&#232;gles </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi Debili, Emna Souissi 
</p>
<p>pour embrasser les phrases de taille sup&#233;rieure soit grammatical. La cons&#233;quence heureuse &#233;tant que 
poids, scores et probabilit&#233;s ne seraient plus invoqu&#233;s que pour choisir entre successions d&#8217;&#233;tiquettes 
toutes &#233;galement grammaticales, et non pour &#233;liminer en outre les successions agrammaticales.  
Cette taille semble exister. Nous montrons qu&#8217;au moyen d&#8217;algorithmes relativement simples l&#8217;on peut 
assez pr&#233;cis&#233;ment la d&#233;terminer. Qu&#8217;elle se situe, compte tenu de nos corpus, aux alentours de 12 
pour le fran&#231;ais, de 10 pour l&#8217;arabe, et de 10 pour l&#8217;anglais. Qu&#8217;elle est donc en particulier inf&#233;rieure &#224; 
la taille moyenne des phrases, quelle que soit la langue consid&#233;r&#233;e. 
</p>
<p>Abstract  
Is there an optimal n for n-grams used in part-of-speech tagging?  
Almost all part-of-speech taggers apply rules about permitted successions and collocations of two or 
three grammatical categories. Their performance amounts to 96 percent of correctly tagged words, 
and to less than 57 percent of correctly tagged sentences. These binary and ternary succession rules 
represent a small fraction of succession rules one can extract from sentences in a learning corpus, 
where most sentences (more than 98 percent of them) have a length of more than three words. In 
other words, most sentences are processed by rules that are reconstructed, or simulated, from shorter 
ones, here ternary at best. We show that most such simulated rules are agrammatical, and that, if 
some inferential benefit comes from the chaining of short rules to compensate inexistent learning, 
mainly in the case of long rules, this benefit is nullified by the permissive behaviour of this process, 
in which a variety of weights, scores or probability are ineffective in hierarchizing its production and 
yield a separation between grammatical and agrammatical rules. So we feel forced to look again at 
larger-than-ternary rules. However, if we admit a necessity of enlarging succession rules, we must ask 
the question &quot;up to which limit, and for what profit&quot;. For we also decline to argue for rules as long as 
the longest sentences upon which they might apply. So the real question is, can we define an optimal 
size for rules, short enough for learning to converge, and long enough for any chaining of rules to deal 
with larger sentences to be grammatical? A positive result would be that weights, scores or 
probability would then be invoked only to decide between equally grammatical successions of tags, 
and no longer to eliminate agrammatical ones. 
This optimal size apparently exists. We show that the use of rather simple algorithms leads to its 
determination. And its value, according to our corpora, is near 12 for French, 10 for Arabic and 10 for 
English. Therefore, it is less than the average length of sentences, for each of these three languages. 
</p>
<p>1 Introduction 
Cet article rend compte d&#8217;une &#233;tude critique des r&#232;gles les plus couramment mises en &#339;uvre dans les 
&#233;tiqueteurs grammaticaux. Il souligne de fa&#231;on quantitative le caract&#232;re infond&#233; de l&#8217;emploi 
g&#233;n&#233;ralis&#233;, du moins dans la plupart des mod&#232;les probabilistes, des seules r&#232;gles de succession (ou de 
pr&#233;c&#233;dence) d&#8217;ordre deux ou trois que renferment les expressions : P(&#233;tiquette de rang i | 
&#233;tiquette de rang i-1) ; P(&#233;tiquette de rang i | &#233;tiquette de rang i-2, &#233;tiquette de rang i-1). 
La sanction, s&#8217;il en est, de cet &#233;tat de fait est bien connue : un niveau de performance &#8211; 96% de mots 
correctement &#233;tiquet&#233;s &#8211; rapidement atteint (par exemple Debili, 1977 ; DeRose, 1988), mais que l&#8217;on 
peine &#224; d&#233;passer de fa&#231;on substantielle et reproductible, en d&#233;pit d&#8217;efforts qui ne se sont point 
rel&#226;ch&#233;s depuis plus de trente ans (par exemple Andreewsky et Fluhr, 1973 ; M&#233;rialdo, 1994 ; Leech 
et al., 1994 ; Adda et al., 1999 ; Valli et V&#233;ronis, 1999 ; Nasr et Volanschi, 2004). Ce niveau de 
performance est relativement faible. Il signifie que si la taille moyenne de la phrase est de 20 mots, 
alors en moyenne 4 phrases sur 5 sont mal &#233;tiquet&#233;es. Dans la pratique, la situation est sans doute 
meilleure, mais demeurant &#224; des niveaux qui restent tr&#232;s faibles, les performances au niveau de la 
phrase sont rarement affich&#233;es. 57% de phrases correctement &#233;tiquet&#233;es est semble-t-il le meilleur 
r&#233;sultat publi&#233; que l&#8217;on ait pu atteindre (Toutanova et al., 2003). Erig&#233;s en barri&#232;re depuis une 
trentaine d&#8217;ann&#233;es, ces niveaux de performances, ajout&#233;s aux difficult&#233;s r&#233;elles que pose leur 
&#233;valuation comparative, ont pu amener jusqu&#8217;&#224; douter du statut de l&#8217;&#233;tiquetage tel que pr&#233;conis&#233; 
(Fairon et Sennelart, 1999).  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y a-t-il une taille optimale des r&#232;gles de succession intervenant dans l&#8217;&#233;tiquetage 
grammatical ? 
</p>
<p>Nous voulons ici revenir sur une hypoth&#232;se non toujours formul&#233;e li&#233;e &#224; la port&#233;e des r&#232;gles mises en 
&#339;uvre dans les &#233;tiqueteurs grammaticaux. Leur extr&#234;me localit&#233; &#8211; examen de contextes tr&#232;s proches 
portant sur les deux positions qui pr&#233;c&#232;dent, entourent ou suivent l&#8217;ambigu&#239;t&#233; &#233;tudi&#233;e &#8211; est souvent 
point&#233;e pour expliquer les &#233;checs constat&#233;s, mais elle est &#233;galement souvent assum&#233;e au nom de 
contraintes techniques li&#233;es autant &#224; la puissance des machines qu&#8217;&#224; la taille des corpus 
d&#8217;apprentissage, et de fait en partie justifi&#233;e sur le plan exp&#233;rimental, puisque aussi bien l&#8217;on a pu en 
effet enregistrer des r&#233;sultats meilleurs avec des r&#232;gles de port&#233;es paradoxalement plus courtes. 
Il ne s&#8217;agit pas &#233;videmment de rejeter ces r&#232;gles qui restent utiles. Il s&#8217;agit de s&#8217;attaquer au probl&#232;me 
que leur cha&#238;nage soul&#232;ve d&#232;s lors que l&#8217;on essaie de les appliquer &#224; des phrases dont la taille est 
sup&#233;rieure &#224; 2 ou &#224; 3 mots, ce qui arrive dans plus de 98% des cas. Le sch&#233;ma suivant o&#249; les mi sont 
les mots de la phrase, et les tij, leurs diverses &#233;tiquettes grammaticales potentielles respectives, 
rappelle ce qui se passe : 
</p>
<p>   m1     m2     m3  m4   ...       mL 
 
</p>
<p> t11    t21    t31    t41     ...       tL1 
 t12    t22    t32    t42     ...      tL2 
 &#8230;    &#8230;    &#8230;       ...      &#8230; 
</p>
<p>  t1,n1     t2,n2     t3,n3     t4,n4      ...       tL,nL 
</p>
<p>Figure 1 
L&#8217;&#233;tiquetage consiste &#224; reconna&#238;tre parmi les NL chemins combinatoirement possibles (N &#233;tant le 
nombre moyen d&#8217;&#233;tiquettes pour un mot, et L le nombre de mots de la phrase), le chemin qui permet 
d&#8217;attribuer &#224; chacun des mots l&#8217;&#233;tiquette grammaticale qui lui sied dans la phrase. La situation est 
plus complexe en fait car la segmentation en mots n&#8217;est pas toujours unique. Mais nous ne nous en 
pr&#233;occuperons pas ici, car cela n&#8217;a pas d&#8217;incidence sur ce que nous essayons de montrer. Nous ne 
nous pr&#233;occuperons pas non plus de la nature des &#233;tiquettes que nous recevrons comme telles. 
Appliquer des r&#232;gles binaires pour construire ces chemins, c&#8217;est joindre bout &#224; bout des successions 
attest&#233;es (c'est-&#224;-dire qui ont &#233;t&#233; relev&#233;es dans un corpus d&#8217;apprentissage) de 2 &#233;tiquettes, de fa&#231;on 
telle que la seconde &#233;tiquette de la premi&#232;re r&#232;gle soit identique &#224; la premi&#232;re de la seconde r&#232;gle. 
Ainsi, si a, b, c, &#8230;, z, sont des &#233;tiquettes grammaticales, et (a b), (b c) des successions attest&#233;es, alors 
(a b c) est une succession d&#8217;ordre 3 potentiellement valide ou, dirons-nous, potentiellement attestable. 
Appliquer des r&#232;gles ternaires, c&#8217;est cha&#238;ner de la m&#234;me fa&#231;on des successions attest&#233;es de trois 
&#233;tiquettes de fa&#231;on telle que les deux derni&#232;res du premier triplet soient identiques aux deux 
premi&#232;res du second triplet. Ainsi, si (a b c) et (b c d) sont des successions ternaires attest&#233;es, alors on 
peut former la succession quaternaire (a b c d). Et de proche en proche (a b c d e) si (c d e) est une 
succession attest&#233;e, et ainsi de suite. Nous remarquons qu&#8217;il y a l&#224; production de successions qui &#224; 
leur tour peuvent &#234;tre assimil&#233;es &#224; des r&#232;gles d&#8217;ordre sup&#233;rieur. La diff&#233;rence est que les premi&#232;res 
sont attest&#233;es, alors que les secondes ne le sont pas. Pour les distinguer, nous les appellerons simul&#233;es 
dans la suite de l&#8217;expos&#233;. 
C&#8217;est ainsi qu&#8217;op&#232;rent basiquement la plupart des &#233;tiqueteurs qui essaient d&#8217;&#233;tablir ou de reconna&#238;tre 
des continuit&#233;s syntaxiques. Le probl&#232;me r&#233;side dans le fait que les successions ainsi obtenues et que 
l&#8217;on peut en effet assimiler &#224; des r&#232;gles de succession de taille aussi longue que les phrases auxquelles 
elles s&#8217;appliquent, ne se r&#233;v&#232;lent pas toujours, loin s&#8217;en faut, attestables, bien qu&#8217;&#233;tablies &#224; partir de 
r&#232;gles binaires ou ternaires attest&#233;es. L&#8217;on s&#8217;aper&#231;oit que ces successions ou r&#232;gles simul&#233;es sont au 
contraire souvent agrammaticales. Cela est bien connu. Mais &#224; notre connaissance aucune &#233;tude &#224; 
caract&#232;re quantitatif n&#8217;a &#233;t&#233; men&#233;e pour mesurer la proportion du potentiellement attestable ou 
grammatical par opposition &#224; ce qui demeurera non attestable ou agrammatical. 
La question qui surgit est alors : y a-t-il corr&#233;lation entre ces proportions grammaticales vs 
agrammaticales de r&#232;gles simul&#233;es et la taille des r&#232;gles attest&#233;es leur ayant donn&#233; naissance ? Sans 
doute oui, mais l&#224; aussi nous n&#8217;en connaissons pas la nature. L&#8217;on imagine toutefois que la proportion 
des r&#232;gles simul&#233;es agrammaticales devrait aller en diminuant &#224; mesure que la taille des r&#232;gles </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi Debili, Emna Souissi 
</p>
<p>attest&#233;es g&#233;n&#233;ratrices irait croissant. Si tel est le cas, quelle est la valeur minimale de cette taille, taille 
&#224; partir de laquelle l&#8217;on n&#8217;obtiendrait plus que des successions simul&#233;es attestables ? Ne pourrait-on 
pas &#233;laborer un protocole exp&#233;rimental pour d&#233;terminer de meilleure fa&#231;on, empirique et non plus 
apriorique, la taille optimale des r&#232;gles de succession devant intervenir dans l&#8217;&#233;tiquetage 
grammatical ? 
C&#8217;est &#224; ces questions que nous allons essayer de r&#233;pondre &#224; partir d&#8217;observations et de calculs 
effectu&#233;s sur trois corpus &#233;tiquet&#233;s : &#8226; fran&#231;ais (MULTITAG du CNRS-LIMSI, un ensemble de textes 
du Monde d&#8217;environ 754 000 mots regroup&#233;s en 31 points et utilisant 337 &#233;tiquettes grammaticales, 
Paroubek et Rajman, 2000) ; &#8226; arabe (un ensemble de 53 textes du Monde Diplomatique d&#8217;environ 
92 000 mots manuellement voyell&#233;s et &#233;tiquet&#233;s au CNRS-ICAR, utilisant 558 &#233;tiquettes) ; &#8226; et 
anglais (SUZANNE Corpus, 64 textes d&#8217;environ 149 000 mots, utilisant 308 &#233;tiquettes). 
</p>
<p>2 Notations 
</p>
<p>Ayant &#224; consid&#233;rer pour les besoins de nos exp&#233;rimentations diff&#233;rentes tailles de corpus ou de 
r&#232;gles :  
</p>
<p>&#8226; T1...x : d&#233;signera le corpus constitu&#233; de l&#8217;ensemble de textes {T1, T2, &#8230;, Tx} 
&#8226; RAp(T1...x) ou plus simplement RAp(T) : d&#233;signera l&#8217;ensemble des r&#232;gles d&#8217;ordre p attest&#233;es 
</p>
<p>ou apprises &#224; partir du corpus T1...x, ou plus simplement T. 
</p>
<p>&#8226; RSq[RAp(T)] : d&#233;signera l&#8217;ensemble des r&#232;gles simul&#233;es d&#8217;ordre q engendr&#233;es &#224; partir des 
r&#232;gles attest&#233;es d&#8217;ordre p (p &lt; q) du corpus T. 
</p>
<p>Rappelons qu&#8217;une r&#232;gle simul&#233;e d&#8217;ordre q est obtenue en cha&#238;nant (q &#8211; p + 1) r&#232;gles attest&#233;es d&#8217;ordre 
p. Exemple avec q = 7 et p = 5 : 
</p>
<p>  1 2 3 4 5 6 7 
R&#232;gle attest&#233;e 1 a b c d e   
R&#232;gle attest&#233;e 2  b c d e f  
R&#232;gle attest&#233;e 3   c d e f g 
R&#232;gle simul&#233;e  a b c d e f g 
</p>
<p>Figure 2 : R&#232;gle simul&#233;e d&#8217;ordre 7 engendr&#233;e au moyen de r&#232;gles attest&#233;es d&#8217;ordre 5.  
</p>
<p>3 R&#232;gles de succession attest&#233;es 
Les r&#232;gles attest&#233;es sont les successions d&#8217;&#233;tiquettes grammaticales de diverses longueurs que l&#8217;on 
peut extraire des phrases prises une &#224; une dans des textes pr&#233;alablement &#233;tiquet&#233;s. Une phrase de trois 
mots respectivement &#233;tiquet&#233;s (a b c) donnera lieu aux six successions suivantes : &#8226; unaires : (a), (b), 
(c) ; &#8226; binaires : (a b), (b c) ; &#8226; et ternaire : (a b c). Plus g&#233;n&#233;ralement, une phrase donn&#233;e de longueur 
L donnera naissance &#224; L(L + 1)/2 successions diff&#233;rentes, de taille allant de une &#224; L &#233;tiquettes. 
La figure 3 donne les effectifs associ&#233;s aux trois corpus fran&#231;ais, arabe et anglais. Dans les cas 
d&#8217;esp&#232;ce, si l&#8217;on s&#8217;int&#233;resse aux r&#232;gles binaires et ternaires qui sont les seules mises en &#339;uvre dans la 
quasi totalit&#233; des &#233;tiqueteurs probabilistes, ces histogrammes r&#233;v&#232;lent qu&#8217;en fait celles-ci cumul&#233;es ne 
repr&#233;sentent au plus que 3,57% du total des r&#232;gles de succession potentielles que l&#8217;on peut extraire 
d&#8217;un texte d&#251;ment &#233;tiquet&#233;, cas de l&#8217;anglais. Et moins d&#8217;un pour cent (0,75%) lorsque la taille du 
corpus est plus importante, cas du fran&#231;ais, l&#8217;arabe &#233;tant &#224; 3,10%.  Plus de 96%, voire 99%, des r&#232;gles 
potentiellement utiles pour une analyse plus discriminante de ces m&#234;mes corpus ou d&#8217;autres ne sont 
pas retenues, tandis que plus de 98% des phrases ont d&#8217;une fa&#231;on g&#233;n&#233;rale plus de trois mots. Ces 
proportions soulignent que dans une perspective d&#8217;analyse, plus de 98% des phrases sont &#233;tiquet&#233;es 
au moyen de moins de 4%, voire moins d&#8217;un pour cent, du total des r&#232;gles que l&#8217;on peut extraire des 
corpus. Autrement dit, 98% des phrases ou davantage sont &#233;tiquet&#233;es aux moyen de r&#232;gles simul&#233;es. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y a-t-il une taille optimale des r&#232;gles de succession intervenant dans l&#8217;&#233;tiquetage 
grammatical ? 
</p>
<p>Nombre de r&#232;gles de succession apprises par taille et par langue
</p>
<p>0
</p>
<p>100000
</p>
<p>200000
</p>
<p>300000
</p>
<p>400000
</p>
<p>500000
</p>
<p>600000
</p>
<p>1 6 11 16 21 26 31 36 41 46 51 56 61 66 71 76 81 86 91 96 101 106 111 116 121 126 131 136 141
</p>
<p>Taille des r&#232;gles
</p>
<p>N
o
</p>
<p>m
br
</p>
<p>e
 
</p>
<p>de
 
</p>
<p>r&#232;
gl
</p>
<p>es
</p>
<p>Arabe Anglais Fran&#231;ais
</p>
<p> 
</p>
<p>Figure 3 : Histogramme des successions attest&#233;es selon leur taille 
</p>
<p>Ce constat ne signifie pas bien 
entendu qu&#8217;il faille opter 
d&#8217;embl&#233;e pour l&#8217;apprentissage 
de toutes les r&#232;gles de succes-
sion, y compris de celles qui 
seraient aussi longues que les 
plus longs tron&#231;ons ou phrases 
dont elles sont issues. Quelle 
valeur aurait une r&#232;gle hapax 
qui aurait toutes les chances 
de ne pouvoir jamais &#234;tre 
appliqu&#233;e qu&#8217;au fragment ou &#224; 
la phrase d&#8217;o&#249; elle provient ? 
L&#8217;id&#233;e n&#8217;est donc pas de 
sauvegarder  toutes  les  r&#232;gles 
</p>
<p>quelle que soit leur taille, d&#8217;autant qu&#8217;il s&#8217;av&#232;re que celles-ci sont toutes pr&#233;cis&#233;ment syst&#233;mati-
quement hapax d&#232;s lors que leur taille d&#233;passe un certain seuil, ici respectivement pour les trois 
corpus : 16 pour l&#8217;anglais, 19 pour l&#8217;arabe, et 60 pour le fran&#231;ais. 
Cependant, dans la perspective qui est la n&#244;tre d&#8217;argumenter en faveur d&#8217;une extension de la taille des 
r&#232;gles apprises, ces valeurs peuvent &#234;tre consid&#233;r&#233;es d&#232;s maintenant comme des limites qu&#8217;il ne sera 
pas utile de d&#233;passer. Nous verrons, moyennant d&#8217;autres observations, qu&#8217;il ne sera pas non plus utile 
d&#8217;aller aussi loin. 
Il nous faut auparavant argumenter davantage et en particulier tenter d&#8217;&#233;valuer, &#8211; en amont des 
performances d&#8217;&#233;tiquetage d&#233;j&#224; signal&#233;es, et que nous qualifierons d&#8217;extrins&#232;ques (ou exog&#232;nes), dans 
la mesure o&#249; elles renseignent sur la couverture et la discriminance en usage des r&#232;gles binaires et 
ternaires, &#8211; de ces m&#234;mes propri&#233;t&#233;s mais en d&#233;finition. C&#8217;est-&#224;-dire de la propension combinatoire 
d&#8217;un ensemble de r&#232;gles &#224; n&#8217;engendrer intrins&#232;quement (ou de fa&#231;on endog&#232;ne) par cha&#238;nage, que des 
r&#232;gles simul&#233;es attestables, ou en tout cas &#224; minimiser la proportion du g&#233;n&#233;r&#233; non attestable. A 
l&#8217;inverse de l&#8217;&#233;valuation en usage, qui sans doute au final seule compte, l&#8217;&#233;valuation en d&#233;finition 
d&#8217;un ensemble de r&#232;gles a une valeur pr&#233;dictive. En introduisant des crit&#232;res et des indices permettant 
de comparer des ensembles de r&#232;gles diff&#233;rents sous l&#8217;angle de leur fonctionnement interne et en 
dehors de toute confrontation aux textes &#224; &#233;tiqueter, on se dote de moyens permettant d&#8217;anticiper 
pr&#233;cis&#233;ment de la qualit&#233; de l&#8217;&#233;tiquetage. L&#8217;on imagine en effet que de deux ensembles de r&#232;gles 
engendrant les m&#234;mes r&#232;gles simul&#233;es attestables par ailleurs, celui qui produirait 
proportionnellement le moins de r&#232;gles agrammaticales concomitamment, devrait conduire 
incontestablement &#224; de meilleures performances en usage, c&#8217;est-&#224;-dire de &#233;tiquetage proprement dit. 
</p>
<p>4 R&#232;gles de succession simul&#233;es 
L&#8217;argument souvent avanc&#233; en faveur des r&#232;gles binaires ou ternaires est li&#233; &#224; leur capacit&#233; 
inf&#233;rentielle ou &#171; g&#233;n&#233;rative &#187; et &#224; la rapidit&#233; de leur apprentissage. Les r&#232;gles de plus longue taille 
sont par opposition moins productives, et l&#8217;on met plus de temps &#224; les acqu&#233;rir, temps signifiant ici 
volume des corpus n&#233;cessaires &#224; leur apprentissage. 
Dans la perspective d&#8217;une extension de la taille des r&#232;gles apprises, ces avantages subsistent, puisqu&#8217;il 
ne s&#8217;agit nullement de se d&#233;partir des r&#232;gles binaires et ternaires, mais seulement de leur adjoindre les 
r&#232;gles de plus longue taille. L&#8217;on peut donc s&#8217;interroger sur l&#8217;utilit&#233; de cette extension, d&#8217;autant que 
ces r&#232;gles de plus longue taille peuvent &#234;tre totalement simul&#233;es &#224; partir des r&#232;gles binaires ou 
ternaires, et qu&#8217;en outre, cette simulation produira m&#234;me potentiellement plus encore de r&#232;gles 
attestables de longue taille que nous ne pourrions en extraire directement &#224; partir des m&#234;mes corpus 
d&#8217;apprentissage. La figure suivante illustre ces imbrications. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi Debili, Emna Souissi 
</p>
<p> 
</p>
<p>Figure 4 : Imbrication des ensembles de r&#232;gles simul&#233;es RSq[RA3(T)] avec 3&lt;q&#1;L 
</p>
<p>Or, ces capacit&#233;s productives des r&#232;gles binaires ou ternaires n&#8217;ont &#224; notre connaissance jamais &#233;t&#233; 
&#233;valu&#233;es autrement qu&#8217;au travers de l&#8217;utilisation qui en est faite, c'est-&#224;-dire des performances des 
outils d&#8217;&#233;tiquetage mettant en &#339;uvre ces r&#232;gles. Une &#233;valuation en usage donc, qui au demeurant reste 
&#224; des niveaux peu satisfaisants comme nous avons pu le voir, et non en d&#233;finition. En particulier, nous 
n&#8217;avons aucune connaissance des proportions relatives des diverses r&#232;gles simul&#233;es : &#8211; attest&#233;es,  &#8211; 
potentiellement attestables, &#8211; et non attestables, rapport&#233;es au total des r&#232;gles simul&#233;es. Ni a fortiori 
de l&#8217;&#233;volution des ces m&#234;mes proportions en fonction de la taille des r&#232;gles ou des corpus 
d&#8217;apprentissage. Ces proportions et leurs &#233;volutions respectives semblent pourtant &#234;tre de nature &#224; 
nous renseigner de fa&#231;on apriorique sur la couverture et la discriminance d&#8217;un ensemble de r&#232;gles par 
opposition &#224; un autre. Id&#233;alement, &#224; couverture ou &#224; capacit&#233; d&#8217;engendrement &#233;quivalente, celui des 
deux ensembles qui produira en proportion le plus de r&#232;gles attestables sera consid&#233;r&#233; plus 
prometteur, car, surg&#233;n&#233;rant moins, il est plus discriminant. Dans la r&#233;alit&#233;, concilier couverture et 
discriminance s&#8217;av&#232;re contradictoire. C&#8217;est pourquoi la comparaison reste difficile, et qu&#8217;il nous 
faudra rechercher non le meilleur, mais un optimum qui ne correspondra qu&#8217;&#224; un meilleur local. 
Probl&#232;me : comment mesurer ces proportions et leurs &#233;volutions ? 
</p>
<p>5 Discriminance, couverture, &#233;valuation d&#8217;un syst&#232;me de r&#232;gles 
Nous proposons d&#8217;appeler discriminance en g&#233;n&#233;ration de rang q d&#8217;un ensemble de r&#232;gles attest&#233;es 
d&#8217;ordre p, q&gt;p, le rapport : 
</p>
<p>&#1;q,p = Card &#2; RSq[RAp(T)] &#3; RAq(T) &#4;  &#5;  Card &#2; RSq[RAp(T)] &#4; 
Ce qui simplement correspond &#224; la proportion des r&#232;gles simul&#233;es d&#8217;ordre q, et attest&#233;es par le corpus 
T, rapport&#233;e au total des r&#232;gles simul&#233;es d&#8217;ordre q, les r&#232;gles simul&#233;es &#233;tant engendr&#233;es &#224; partir des 
r&#232;gles d&#8217;ordres p issues du m&#234;me corpus T. 
</p>
<p> 
</p>
<p>Nous dirons que cette discriminance est intrins&#232;que, et nous d&#233;signerons par : 
</p>
<p>&#6;q,p = Card &#2; RSq[RAp(Ta)] &#3; RAq(T1&#8230;x) &#4;  &#5;  Card &#2; RSq[RAp(Ta)] &#4; avec Ta &#7; T1&#8230;x 
</p>
<p>RSq[RAp(T)] 
</p>
<p>RSq[RAp(T)] &#3; RAq(T) = RAq(T)   RAp(T) 
</p>
<p>Figure 5a 
</p>
<p>R&#232;gles simul&#233;es non attestables (qui en principe resteront agrammaticales au-del&#224; de T) 
</p>
<p>R&#232;gles simul&#233;es potentiellement attestables (mais qui ne figurent pas 
dans T) 
</p>
<p>R&#232;gles simul&#233;es attest&#233;es (figurent dans T) 
</p>
<p>R&#232;gles binaires et ternaires 
attest&#233;es RA2(T) et RA3(T) 
</p>
<p>R&#232;gles simul&#233;es 
RSq[RA3(T)] 
</p>
<p>R&#232;gles 
attestables 
non simul&#233;es </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y a-t-il une taille optimale des r&#232;gles de succession intervenant dans l&#8217;&#233;tiquetage 
grammatical ? 
</p>
<p>la discriminance extrins&#232;que, laquelle correspond &#224; la proportion des r&#232;gles simul&#233;es d&#8217;ordre q, et 
attest&#233;es par le corpus T1&#8230;x, rapport&#233;e au total des r&#232;gles simul&#233;es d&#8217;ordre q, les r&#232;gles simul&#233;es &#233;tant 
engendr&#233;es &#224; partir des r&#232;gles d&#8217;ordres p issues du corpus Ta, Ta pouvant &#234;tre inclus, ou 
&#233;ventuellement, partiellement inclus, ou non inclus dans T1&#8230;x. 
</p>
<p> 
</p>
<p>Figure 5b : Intersection des r&#232;gles simul&#233;es RSq[RAp(Ta)] avec les r&#232;gles attest&#233;es RAq(T1&#8230;x) 
</p>
<p>De m&#234;me, nous proposons d&#8217;appeler couverture en g&#233;n&#233;ration de rang q d&#8217;un ensemble de r&#232;gles 
attest&#233;es d&#8217;ordre p, q&gt;p, le rapport : 
</p>
<p>&#8;q,p = Card &#2; RSq[RAp(Ta)] &#3; RAq(T1&#8230;x) &#4;  &#5;  Card &#2; RAq(T1&#8230;x) &#4; 
Cela correspond &#224; la proportion des r&#232;gles simul&#233;es d&#8217;ordre q, engendr&#233;es &#224; partir des r&#232;gles d&#8217;ordres 
p issues du corpus Ta, et attest&#233;es par le corpus T1&#8230;x, rapport&#233;e au total des r&#232;gles attest&#233;es d&#8217;ordre q 
de ce m&#234;me corpus T1&#8230;x. Nous remarquons que dans le cas particulier o&#249; Ta est identique &#224; T1&#8230;x, 
alors &#8;q,p = 1. 
</p>
<p>D&#8217;une fa&#231;on plus g&#233;n&#233;rale et par extension, nous appellerons discriminance en g&#233;n&#233;ration d&#8217;un 
ensemble de r&#232;gles attest&#233;es de diverses longueurs issues d&#8217;un corpus d&#8217;apprentissage Ta, la 
proportion des r&#232;gles engendr&#233;es &#224; partir de ces r&#232;gles, et attest&#233;es par le sur corpus T1&#8230;x &#9; Ta, 
rapport&#233;e au total des r&#232;gles engendr&#233;es ; et couverture en g&#233;n&#233;ration d&#8217;un ensemble de r&#232;gles 
attest&#233;es de diverses longueurs issues du sous corpus Ta &#7; T1&#8230;x, la proportion des r&#232;gles engendr&#233;es &#224; 
partir de ces r&#232;gles, et attest&#233;es par T1&#8230;x, rapport&#233;e au total des r&#232;gles attest&#233;es de T1&#8230;x. 
</p>
<p>Les protocoles exp&#233;rimentaux permettant de calculer les rapports &#1;q,p, &#6;q,p et &#8;q,p sont relativement 
simples. Ils exigent n&#233;anmoins des temps de calcul relativement long, d&#8217;autant plus long que p est 
petit, et (q-p) grand. C&#8217;est pourquoi nous ne pouvons donner ici, en particulier pour p=3, que les 
&#233;volutions li&#233;es &#224; de faibles &#233;carts, mais que nous continuons d&#8217;&#233;largir. Les tendances que nous 
voulons faire valoir &#224; l&#8217;appui d&#8217;une extension des r&#232;gles de succession d&#8217;une part, et pour la 
d&#233;termination d&#8217;une limite &#224; cette extension d&#8217;autre part, sont cependant pr&#233;sentes. 
En faisant varier les param&#232;tres p, q, et x (taille du corpus), plusieurs familles de courbes peuvent &#234;tre 
trac&#233;es. Ces courbes donnent les &#233;volutions des discriminances (intrins&#232;que &#1;q,p et extrins&#232;que &#6;q,p), et 
de la couverture (&#8;q,p) d&#8217;un ensemble de r&#232;gles, soit en fonction de la taille des corpus (x), soit en 
fonction de la taille des r&#232;gles g&#233;n&#233;ratrices (p), soit en fonction de la taille des r&#232;gles engendr&#233;es (q). 
L&#8217;observation de l&#8217;&#233;volution en interne d&#8217;un syst&#232;me de r&#232;gles au travers de ces diverses courbes et 
caract&#233;risations rec&#232;le ce qui pourrait permettre de comparer entre eux des syst&#232;mes de r&#232;gles 
diff&#233;rents, et d&#232;s lors de proc&#233;der &#224; une certaine forme d&#8217;&#233;valuation de ces syst&#232;mes de r&#232;gles. 
</p>
<p>6 Discriminance en g&#233;n&#233;ration 
Nous focaliserons notre attention ici sur l&#8217;&#233;volution des indices de discriminance en g&#233;n&#233;ration 
d&#8217;ensembles de r&#232;gles en fonction de p et de q. Et sur deux constats pressentis, mais d&#233;sormais 
chiffr&#233;s : 1&#176;) la d&#233;croissance, d&#8217;autant plus rapide que p est petit, de la discriminance, aussi bien 
intrins&#232;que qu&#8217;extrins&#232;que, &#224; mesure que q croit ; 2&#176;) et &#224; l&#8217;inverse, la croissance rapide de cette 
m&#234;me discriminance &#224; mesure que p croit. 
</p>
<p>Les courbes ou tableaux &#1;q,p et &#6;q,p (voir figure 6 pour le fran&#231;ais) montrent qu&#8217;en passant simplement 
de q=4 &#224; q=5 pour p=3, alors la proportion des r&#232;gles attest&#233;es passe de 13,35% &#224; 1,30% pour le 
</p>
<p>RSq[RAp(Ta)] RAq(T1&#8230;x) 
</p>
<p>  RSq[RAp(Ta)] &#3; RAq(T1&#8230;x) RAp(Ta) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi Debili, Emna Souissi 
</p>
<p>fran&#231;ais, de 11,08% &#224; 1,11% pour l&#8217;arabe, et de 10,73% &#224; 0,8% pour l&#8217;anglais. Et que si l&#8217;on tient 
compte en outre des r&#232;gles potentiellement attestables, alors l&#8217;on passe de 50,13% &#224; 14,78% pour le 
fran&#231;ais, de 50,49% &#224; 18,71% pour l&#8217;arabe, et de 56,09% &#224; 18,92% pour l&#8217;anglais.  
</p>
<p>Evolution des discriminances intrins&#232;ques et extrins&#232;ques pour  p=3 &#224; 9  et  q=4 &#224; 13
</p>
<p>1,30%
0,10%
</p>
<p>13,35%
</p>
<p>50,13%
</p>
<p>0,42%
3,00%
</p>
<p>14,78%
</p>
<p>0,05%0%
5%
</p>
<p>10%
15%
20%
25%
30%
35%
40%
45%
50%
55%
60%
65%
70%
75%
80%
85%
90%
95%
</p>
<p>100%
</p>
<p>4 5 6 7 8 9 10 11 12 13
Taille des r&#232;gles engendr&#233;es (q)
</p>
<p>q
</p>
<p>&#948;q,6
</p>
<p>&#948;q,5
&#948;q,4&#948;q,3
</p>
<p>&#8710;q,3
</p>
<p>&#8710;q,5
</p>
<p>&#948;q,q-1
</p>
<p>&#8710;q,4
</p>
<p>&#8710;q,7
</p>
<p>&#8710;q,8
&#8710;q,9
</p>
<p>&#8710;q,6
</p>
<p>&#8710;q,q-1
</p>
<p>&#948;q,7
</p>
<p>&#948;q,8
</p>
<p>&#948;q,9
</p>
<p> 
</p>
<p>Figure 6 : La discriminance d&#233;cro&#238;t &#224; mesure  que 
q cro&#238;t (&#1;q,p et &#6;q,p du fran&#231;ais) 
</p>
<p>Proportion des r&#232;gles simul&#233;es attest&#233;es de taille p+1 engendr&#233;es 
&#224; partir des r&#232;gles de taille p
</p>
<p>0%
</p>
<p>10%
</p>
<p>20%
</p>
<p>30%
</p>
<p>40%
</p>
<p>50%
</p>
<p>60%
</p>
<p>70%
</p>
<p>80%
</p>
<p>90%
</p>
<p>100%
</p>
<p>3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30
Taille des r&#232;gles (p)
</p>
<p>&#948;&#948; &#948;&#948; p
+
</p>
<p>1,
p Arabe Anglais Fran&#231;ais
</p>
<p>p
</p>
<p> 
</p>
<p>Figure 7 : La discriminance cro&#238;t &#224; mesure que p 
cro&#238;t (&#1;p+1,p de l&#8217;arabe, de l&#8217;anglais et du fran&#231;ais) 
</p>
<p>Une d&#233;croissance qui signifie que, dans le meilleur des cas, si pour &#233;tiqueter une phrase de quatre 
mots l&#8217;on peut encore compter sur 50,13% de r&#232;gles attest&#233;es ou potentiellement attestables, pour 
&#233;tiqueter une phrase de cinq mots l&#8217;on ne peut plus compter que sur 14,78%. Et beaucoup moins si 
l&#8217;on passe &#224; l&#8217;&#233;tiquetage des phrases de six mots (3%) ou de sept (0,42%), et moins encore au-del&#224; 
(&#6;8,3 = 0,05% !). 
Si maintenant nous observons l&#8217;&#233;volution de la discriminance en fonction de p, (voir figure 7), nous 
constatons que ce rapport tend rapidement vers 1 &#224; mesure que p augmente. Ce qui sugg&#232;re que nous 
puissions limiter l&#8217;apprentissage aux seules r&#232;gles de taille inf&#233;rieure ou &#233;gale &#224; une certaine valeur 
de p, valeur au-del&#224; de laquelle les r&#232;gles simul&#233;es se r&#233;v&#232;lent pour la plupart attest&#233;es. La figure 7 
donne l&#8217;&#233;volution de la proportion des r&#232;gles simul&#233;es attest&#233;es rapport&#233;es au total des r&#232;gles 
engendr&#233;es &#224; partir des r&#232;gles attest&#233;es d&#8217;ordre imm&#233;diatement inf&#233;rieur, c'est-&#224;-dire de &#1;p+1,p. 
</p>
<p>Nous observons que plus de 99% des r&#232;gles simul&#233;es se r&#233;v&#232;lent attest&#233;es &#224; partir de p = 10 pour 
l&#8217;anglais et l&#8217;arabe, et &#224; partir de p=12 pour le fran&#231;ais (corpus 5 &#224; 7 fois plus important que celui de 
l&#8217;anglais ou de l&#8217;arabe). Moins d&#8217;un pour cent des r&#232;gles simul&#233;es restent non attest&#233;es, sans que l&#8217;on 
puisse affirmer qu&#8217;elles sont toutes non attestables. 
Nous retrouvons l&#224;, de fa&#231;on empirique, ce que nous savions d&#233;j&#224; : plus le contexte avant (ou apr&#232;s) 
est long, plus le choix sur ce qui suit (ou pr&#233;c&#232;de) est contraint. Ce que nous ne savions pas, pour ce 
qui est de l&#8217;&#233;tiquetage, c&#8217;est la taille de ce contexte, taille minimale &#224; partir de laquelle nous 
constatons que le choix sur ce qui suit devient si contraint qu&#8217;il laisse peu de place &#224; la production de 
successions qui ne soient pas tr&#232;s probablement attestables. 
Nous n&#8217;avons pas fini d&#8217;exploiter les potentialit&#233;s qu&#8217;offrent ces calculs. Nous pensons en particulier 
que les &#233;volutions crois&#233;es de certaines courbes (discriminance et couverture en fonction de la taille 
des corpus), que nous n&#8217;avons pas pu mentionner ici, pourraient renseigner sur l&#8217;&#233;tat de convergence 
de l&#8217;apprentissage, ind&#233;pendamment de toute application des r&#232;gles &#224; l&#8217;&#233;tiquetage d&#8217;un texte nouveau, 
ainsi qu&#8217;il est traditionnellement fait. 
</p>
<p>7 Couverture en g&#233;n&#233;ration d&#8217;ensembles de r&#232;gles de succession 
Si la discriminance est &#224; l&#8217;avantage des r&#232;gles de succession longues, la couverture est &#224; l&#8217;avantage 
des r&#232;gles courtes. Les courbes de la figure 8 le rappellent, m&#234;me si elles sont incompl&#232;tes. Associ&#233;es 
aux courbes des figures 6 et 7, elles mat&#233;rialisent ce que l&#8217;on peut intuitivement pressentir : &#224; savoir 
que plus une r&#232;gle ou un ensemble de r&#232;gles est inf&#233;rent ou productif, moins il est discriminant, et 
inversement. Mais par leurs formes ces courbes r&#233;v&#232;lent en m&#234;me temps que l&#8217;avantage inf&#233;rentiel 
doit &#234;tre relativis&#233;, et combien au final la taille des corpus doit &#234;tre plus importante encore. L&#8217;on </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y a-t-il une taille optimale des r&#232;gles de succession intervenant dans l&#8217;&#233;tiquetage 
grammatical ? 
</p>
<p>constate en effet que si &#224; q constant, la couverture est bien meilleure pour p=3 que pour p=4 ou plus 
(courbes en rouge), cet avantage ne semble se r&#233;aliser de fa&#231;on notable que pour des valeurs de p 
petites (inf&#233;rieures &#224; 5), mais surtout ne se maintenir que pour des valeurs de q, ou plus exactement 
des diff&#233;rences (q-p) relativement faibles, n&#8217;exc&#233;dant pas quatre en l&#8217;occurrence. Au-del&#224;, pour p 
constant, l&#8217;on observe que la couverture, apr&#232;s avoir un temps progress&#233;e, d&#233;cro&#238;t &#224; partir de q=p+4 
environ (courbes en bleu discontinu). En particulier pour p=3, on note une d&#233;croissance &#224; partir de 
q=8. D&#233;croissance qui indique que les effets inf&#233;rentiels du cha&#238;nage de r&#232;gles ne semblent assurer 
une meilleure couverture que pour les phrases dont la taille est l&#233;g&#232;rement sup&#233;rieure &#224; p.  
</p>
<p>Evolution des Kappas en fonction de p  et de q
</p>
<p>0,00%
</p>
<p>5,00%
</p>
<p>10,00%
</p>
<p>15,00%
</p>
<p>20,00%
</p>
<p>25,00%
</p>
<p>30,00%
</p>
<p>35,00%
</p>
<p>3 4 5 6 7 8 9 10 11 12 13
</p>
<p>p ou q
</p>
<p>kappa q,3 kappa q,4
kappa q,5 kappa q,6
kappa q,7 kappa q,8
kappa q,9 kappa 4,p
kappa 5,p kappa 6,p
kappa 7,p kappa 8,p
kappa 9,p kappa 10,p
kappa 11,p&#922;q,4
</p>
<p>&#922;q,3
</p>
<p>&#922;q,5
&#922;q,6 &#922;q,7
</p>
<p>&#922;q,8 &#922;q,9
</p>
<p>&#922;5,p
</p>
<p> 
</p>
<p>Figure 8 : La couverture de rang q des r&#232;gles d&#8217;ordre 
p (&#8;q,p) d&#233;cro&#238;t &#224; mesure que p cro&#238;t. Elle cro&#238;t 
l&#233;g&#232;rement puis d&#233;cro&#238;t &#224; mesure que q cro&#238;t. 
</p>
<p>Pour les phrases plus longues, les effets 
semblent s&#8217;estomper rapidement, &#224; mesure 
que q cro&#238;t, ainsi que les tendances des 
courbes l&#8217;annoncent. L&#8217;espoir d&#8217;une 
meilleure couverture au prix d&#8217;une moins 
bonne discriminance se perd, puisque plut&#244;t 
que d&#8217;&#233;voluer en sens inverse, discriminance 
et couverture semblent, au-del&#224; d&#8217;un certain 
seuil, &#233;voluer dans un m&#234;me sens, celui d&#8217;une 
d&#233;gradation &#224; mesure que q cro&#238;t. Ce r&#233;sultat 
souligne en fait moins l&#8217;importance de la 
capacit&#233; inf&#233;rentielle des r&#232;gles de succession 
courtes, que l&#8217;insuffisance r&#233;currente des 
corpus d&#8217;apprentissage. 
</p>
<p>8 Conclusion 
Dans le r&#233;sum&#233; et l&#8217;introduction nous avons argument&#233; en faveur et pour l&#8217;extension de la taille des 
r&#232;gles de succession couramment mises en &#339;uvre dans les &#233;tiqueteurs. Les arguments, d&#233;taill&#233;s dans 
les sections 2 &#224; 7, ont &#233;t&#233; de montrer que ne mettre en &#339;uvre que les r&#232;gles binaires et ternaires, c&#8217;est, 
dans plus de 98% des cas en situation d&#8217;&#233;tiquetage, tr&#232;s rapidement surg&#233;n&#233;rer un tr&#232;s grand nombre 
de r&#232;gles non attest&#233;es, que l&#8217;avantage inf&#233;rentiel ne permet pas de r&#233;sorber, la proportion des r&#232;gles 
engendr&#233;es attest&#233;es ou attestables restant &#224; moins d&#8217;une fraction de pour cent du total des r&#232;gles 
engendr&#233;es, d&#232;s que l&#8217;on d&#233;passe la taille 5 ou 6. 
La seconde partie de l&#8217;argumentation a &#233;t&#233; de montrer qu&#8217;il n&#8217;&#233;tait pas d&#233;raisonnable non plus 
d&#8217;envisager cette extension, et d&#8217;ajouter aux r&#232;gles binaires et ternaires, des r&#232;gles de tailles 
sup&#233;rieures. Pourquoi ? Parce que nous avons pu d&#233;couvrir que cette extension pouvait &#234;tre limit&#233;e, 
sans perte ou pratiquement, et que cette limite se situait aux environs de 12. Une taille de r&#232;gle au 
del&#224; de laquelle l&#8217;on constate, pour trois langues diff&#233;rentes, le fran&#231;ais, l&#8217;arabe, et l&#8217;anglais, que l&#8217;on 
n&#8217;engendre plus, &#8211; ou  tr&#232;s peu, c'est-&#224;-dire bien en de&#231;&#224; du pour cent &#8211; de r&#232;gles non attestables. Une 
taille qui pourrait trouver ses fondements dans la notion de proposition ou de phrase simple, dont la 
taille moyenne est pr&#233;cis&#233;ment inf&#233;rieure &#224; la taille moyenne de la phrase en g&#233;n&#233;ral, (soit 27 pour le 
corpus du Monde). 
Les protocoles exp&#233;rimentaux propos&#233;s sont simples. Ils n&#8217;exigent de disposer que d&#8217;un corpus aussi 
grand que possible, d&#251;ment &#233;tiquet&#233; et d&#233;coup&#233; en phrases. En fait, seules les s&#233;quences d&#8217;&#233;tiquettes 
associ&#233;es aux phrases sont utiles. C&#8217;est pourquoi, disponibilit&#233; des corpus aidant, nous esp&#233;rons voir 
s&#8217;&#233;tendre ces observations &#224; d&#8217;autres langues d&#8217;une part, et pour des volumes de corpus plus grands, 
d&#8217;autre part. 
Cette &#233;tude des r&#232;gles en soi, sous l&#8217;angle de leur fonctionnement interne, c'est-&#224;-dire sous l&#8217;angle de 
leur assemblage ou aspect g&#233;n&#233;ratif, ind&#233;pendamment de leur utilisation dans l&#8217;&#233;tiquetage, en analyse 
donc, nous a amen&#233; &#224; poser le probl&#232;me d&#8217;une &#233;valuation intrins&#232;que, en d&#233;finition avons-nous 
propos&#233; de dire, d&#8217;un syst&#232;me de r&#232;gles d&#8217;une fa&#231;on g&#233;n&#233;rale. Le meilleur argument en faveur de 
r&#232;gles ayant une port&#233;e sup&#233;rieure &#224; deux ou &#224; trois est encore d&#8217;en montrer l&#8217;efficacit&#233; en comparant </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fathi Debili, Emna Souissi 
</p>
<p>les performances auxquelles ces r&#232;gles conduisent, au regard des performances obtenues en utilisant 
des r&#232;gles plus classiques, binaires ou ternaires. Bien entendu, et nous aurons &#224; effectuer ces 
&#233;valuations en usage. Mais nous voulons insister sur la compl&#233;mentarit&#233; de ces deux visions de 
l&#8217;&#233;valuation, &#171; en usage &#187; vs &#171; en d&#233;finition &#187;, et des potentialit&#233;s de la seconde, dans une perspective 
pr&#233;dictive ou comparative, comme nous l&#8217;avons signal&#233;. 
Cette distinction &#233;valuation en usage vs &#233;valuation en d&#233;finition semble bien s&#8217;appliquer &#224; notre cas 
qui est un cas d&#8217;analyse. Mais qu&#8217;en est-il de cette distinction si l&#8217;application englobante n&#8217;est pas, &#224; 
l&#8217;image de l&#8217;&#233;tiquetage, une application d&#8217;analyse, mais une application de synth&#232;se. Comment 
&#233;valuer en d&#233;finition un syst&#232;me de r&#232;gles intervenant dans un programme de g&#233;n&#233;ration de phrases 
par exemple ? 
Faut-il voir dans cette dichotomie &#171; en usage &#187; vs &#171; en d&#233;finition &#187;, la dichotomie &#171; analyse &#187; vs 
&#171; synth&#232;se &#187; ? Ou encore la distinction &#171; performance &#187; vs &#171; comp&#233;tence &#187; ? Ce qui conduirait &#224; 
parler d&#8217;une &#233;valuation en analyse (ou en performance) par opposition &#224; une &#233;valuation en synth&#232;se 
(ou en comp&#233;tence). La question est ouverte. Mais bien que nous n&#8217;ayons pas pour l&#8217;heure une vision 
claire de ce que pourrait &#234;tre une &#233;valuation en d&#233;finition d&#8217;un ensemble de r&#232;gles orient&#233; vers un 
syst&#232;me de g&#233;n&#233;ration automatique de phrases comme en traduction par exemple, il nous semble que 
la distinction &#171; en d&#233;finition &#187; vs &#171; en usage &#187; devrait encore subsister. La g&#233;n&#233;ration ou synth&#232;se 
serait dans ce cas, comme l&#8217;est l&#8217;analyse, une application particuli&#232;re qui met en &#339;uvre un ensemble 
de r&#232;gles dont l&#8217;&#233;valuation ind&#233;pendante reste pertinente et op&#233;ratoire. A moins que seule la 
g&#233;n&#233;ration ne puisse faire l&#8217;objet d&#8217;une grammaire sur laquelle s&#8217;appuierait l&#8217;analyse. Ce qui ne remet 
pas en cause l&#8217;id&#233;e d&#8217;une double &#233;valuation d&#8217;un syst&#232;me de r&#232;gles, mais d&#233;bouche sur une question 
qui d&#233;passe le cadre de ce papier. 
</p>
<p>Remerciements 
Le pr&#233;sent travail a &#233;t&#233; r&#233;alis&#233; dans le cadre des deux projets EurADic (Action Technolangue du Minist&#232;re de la 
recherche), et MUSCLE (6&#232;me PCRD). Il a en outre b&#233;n&#233;fici&#233; de l&#8217;accueil de la Facult&#233; des Lettres de 
l&#8217;Universit&#233; de la Manouba, sous les auspices du MRSTDC. 
</p>
<p>R&#233;f&#233;rences 
ADDA, G., MARIANI, J., PAROUBEK, P., RAJMAN, M., &amp; LECOMTE, J. (1999). &#8220;L&#8217;action GRACE d'&#233;valuation de 
l&#8217;assignation des parties du discours pour le fran&#231;ais&#8221;. Langues, 2(1). 
ANDREEWSKY A., FLUHR C. (1973), &#8220;Exp&#233;rience de constitution d&#8217;un programme d&#8217;apprentissage pour le 
traitement automatique du langage&#8221;, Actes de COLING 1973, Volume 2. 
DEBILI F. (1977), &#8220;Traitements syntaxiques utilisant des matrices de pr&#233;c&#233;dence fr&#233;quentielles construites 
automatiquement par apprentissage&#8221;, Th&#232;se de Docteur-Ing&#233;nieur, Universit&#233; Paris VII, U.E.R. de Physique, 
Septembre 1977. 
DEROSE STEVEN J., (1988), &#8220;Grammatical Category Disambiguation by Statistical Optimization&#8221;, 
Computational Linguistics, Vol. 14, Num. 1. 
FAIRON C., SENELLART J. (1999), &#8220;R&#233;flexions sur la localisation, l&#8217;&#233;tiquetage, la reconnaissance et la traduction 
d&#8217;expressions linguistiques complexes&#8221;, Actes de TALN 1999. 
LEECH G., GARSIDE R., BRYANT M. (1994), &#8220;CLAWS4: The tagging of the British National Corpus&#8221;, 
Proceedings of the 15th International Conference on Computational Linguistics, COLING 94, Kyoto, Japan. 
M&#201;RIALDO B. (1994), &#8220;Tagging English text with a probabilistic model&#8221;, Computational Linguistics, 20.2. 
NASR A., VOLANSCHI A. (2004), &#8220;Couplage d&#8217;un &#233;tiqueteur morpho-syntaxique et d&#8217;un analyseur partiel 
repr&#233;sent&#233;s sous la forme d&#8217;automates finis pond&#233;r&#233;s&#8221;, Actes de TALN 2004. 
PAROUBEK P., RAJMAN M. (2000), &#8220;MULTITAG, une ressource linguistique produit du paradigme 
d&#8217;&#233;valuation&#8221;, Actes de TALN 2000. 
TOUTANOVA K., KLEIN D., MANNING C. D., SINGER Y. (2003), &#8220;Feature-Rich Part-of-Speech Tagging with a 
Cyclic Dependency Network&#8221;, Actes de HLT-NAACL, 2003. 
VALLI A., V&#201;RONIS J. (1999), &#8220;Etiquetage grammatical des corpus de parole: probl&#232;mes et perspectives&#8221;, Revue 
Fran&#231;aise de Linguistique Appliqu&#233;e. </p>

</div></div>
</body></html>