<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Ressources lexicales au service de recherche et d&#8217;indexation des images</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>Ressources lexicales au service de recherche et d&#8217;indexation des images 
 
</p>
<p>Inga Gheorghita
1,2 
</p>
<p>(1) ATILF-CNRS, Nancy-Universit&#233; (UMR 7118), France 
(2) XILOPIX, 37 rue de la Plaine, 75020 Paris, France 
</p>
<p>inga.gheorghita@atilf.fr 
</p>
<p> 
</p>
<p>Cet article pr&#233;sente une m&#233;thodologie d&#8217;utilisation du Tr&#233;sor de la Langue Fran&#231;aise informatis&#233;e (TLFi) 
pour l&#8217;indexation et la recherche des images fond&#233;e sur l&#8217;annotation textuelle. Nous utilisons les 
d&#233;finitions du TLFi pour la cr&#233;ation automatique et l&#8217;enrichissement d&#8217;un th&#233;saurus &#224; partir des mots-cl&#233;s 
de la requ&#234;te de recherche et des mots-cl&#233;s attribu&#233;s &#224; l&#8217;image lors de l&#8217;indexation. Plus pr&#233;cisement il 
s&#8217;agit d&#8217;associer, de fa&#231;on automatis&#233;, &#224; chaque mot-cl&#233; de l&#8217;image une liste des mots extraits de ses 
d&#233;finitions TLFi pour un domaine donn&#233;, en construisant ainsi un arbre hi&#233;rarchique. L&#8217;approche 
propos&#233;e permet une cat&#233;gorisation tr&#232;s pr&#233;cise des images, selon les domaines, une indexation de 
</p>
<p>grandes quantit&#233;s d&#8217;images et une recherche rapide. 
</p>
<p>This article presents a methodology for using the &#8220;Tr&#233;sor de la Langue Fran&#231;aise informatis&#233;e&#8221; (TLFi) 
for indexing and searching images based on textual annotation. We use the definitions of TLFi for 
</p>
<p>automatic creation and enrichment of a thesaurus based on keywords from the search query and the 
</p>
<p>keywords assigned to the image during indexing. More specifically it is automatically to associate, to each 
</p>
<p>keyword of the image a list of words from their TLFi&#8217;s definitions for a given area, thus building a 
hierarchical tree. The proposed approach allows a very accurate categorization of images, depending on 
</p>
<p>the fields, a indexing of large amounts of images and a quick search. 
</p>
<p>Mots-cl&#233;s :   TLFi, indexation, recherche, images, th&#233;saurus 
</p>
<p>Keywords:   TLFi, indexing, search, images, thesaurus 
</p>
<p> 
</p>
<p>1 Introduction 
</p>
<p>Avec l&#8217;arriv&#233;e de l&#8217;Internet le march&#233; de l&#8217;image num&#233;rique a progress&#233; de mani&#232;re exponentielle. L&#8217;offre d&#8217;illustration 
</p>
<p>n&#8217;a jamais &#233;t&#233; aussi grande. En tenant compte des faits qu&#8217;une agence de photo g&#232;re habituellement entre un et vingt 
</p>
<p>millions d&#8217;images, qu&#8217;un satellite m&#233;t&#233;o envoie plusieurs giga-octets de donn&#233;s chaque jour, qu&#8217;un possesseur 
</p>
<p>d&#8217;appareil photo num&#233;rique actif prendra de l&#8217;ordre de cents mille photos en trente ans  (Gross, 2007), nous voyons 
</p>
<p>bien que le probl&#232;me d&#8217;acc&#232;s et de recherche dans cette masse d&#8217;information &#233;norme pose de nouveaux d&#233;fis. La grande 
</p>
<p>quantit&#233; des images provoque un tr&#232;s grand d&#233;sordre et l&#8217;extraordinaire confusion qui en r&#233;sultent concernant leur 
</p>
<p>identification. La cause principale est le fait que les principes d&#8217;annotation des images par mots cl&#233;s restent souvent tr&#232;s 
</p>
<p>approximatifs et ne garantissent ni la concordance, ni la pertinence des images.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INGA GHEORGHITA 
</p>
<p> 
</p>
<p>Pour g&#233;rer et utiliser efficacement ces bases d&#8217;images, un syst&#232;me d&#8217;indexation et de recherche d&#8217;images 
</p>
<p>est n&#233;cessaire. C&#8217;est pour cette raison que la recherche d&#8217;images est devenue un sujet tr&#232;s actif dans la 
</p>
<p>communaut&#233; internationale depuis plus d&#8217;une dizaine d&#8217;ann&#233;es. Dans nos recherches nous nous focalisons 
</p>
<p>sur l&#8217;&#233;laboration d&#8217;un moteur de recherche et d&#8217;indexation d&#8217;images utilisant les ressources lexicales de 
</p>
<p>l&#8217;ATILF, plus particuli&#232;rement le Tr&#233;sor de la Langue Fran&#231;aise Informatis&#233; (TLFi : www.atilf.fr/tlfi). 
</p>
<p>Nous articulons notre analyse autour de l&#8217;insensibilit&#233; des syst&#232;mes de recherche &#224; la s&#233;mantique en nous 
</p>
<p>appuyant sur une recherche des images bas&#233;e sur l&#8217;exploitation du texte brut associ&#233; aux images. Notre 
</p>
<p>objectif, afin de pouvoir r&#233;aliser l&#8217;indexation et la recherche des images, est de trouver une intersection 
</p>
<p>suffisante entre le vocabulaire utilis&#233; pour la description d&#8217;images par son auteur et la d&#233;finition 
</p>
<p>hi&#233;rarchique des descripteurs dans le th&#233;saurus de la base de donn&#233;es images (XILOPIX : 
</p>
<p>www.xilopix.com). 
</p>
<p>2 G&#233;n&#233;ralit&#233; et probl&#233;matique  
</p>
<p>L&#8217;indexation des images a comme but de faciliter l&#8217;organisation d&#8217;information selon certains crit&#232;res 
</p>
<p>comme la date de prise de photo, le lieu, la marque de l&#8217;appareil photo num&#233;rique etc. L&#8217;objectif de la 
</p>
<p>recherche est, par contre, de mieux r&#233;pondre aux besoins d&#8217;information de l&#8217;utilisateur, c'est-&#224;-dire de 
</p>
<p>retrouver l&#8217;information pertinente. 
</p>
<p>Il existe deux approches concernant l&#8217;indexation et la recherche d&#8217;images : soit  par le contenu visuel, 
</p>
<p>soit  par le contenu textuel de leur description. L&#8217;indexation par le contenu visuel se r&#233;alise en utilisant les 
</p>
<p>caract&#233;ristiques symboliques de l&#8217;image comme les histogrammes, les formes, les textures, les couleurs. Ce 
</p>
<p>type d&#8217;indexation est utilis&#233; dans les domaines sp&#233;cifiques (m&#233;dicine, astronomie, design, publicit&#233;) o&#249; la 
</p>
<p>mod&#233;lisation de l&#8217;image est possible. Par exemple, &#224; partir des images m&#233;dicales des patients on peut 
</p>
<p>construire une mod&#233;lisation informatique de ses organes et de leurs pathologies. 
</p>
<p>La recherche des images par le contenu visuel reste encore &#224; l&#8217;&#233;tape de travaux de recherche et 
</p>
<p>d&#8217;&#233;laboration de prototypes, tandis qu&#8217;aujourd&#8217;hui les moteurs de recherche d&#8217;images existants sont bas&#233;s 
</p>
<p>sur la recherche par mots cl&#233;s. Les proc&#233;dures d&#8217;acc&#232;s aux donn&#233;es photographiques peuvent alors &#234;tre 
</p>
<p>sch&#233;matis&#233;es ainsi : l&#8217;utilisateur formule une requ&#234;te compos&#233;e de termes langagiers et le syst&#232;me lui 
</p>
<p>propose en r&#233;ponse des images qu&#8217;il consid&#232;re comme proches des termes de sa requ&#234;te. Pour ce faire, le 
</p>
<p>syst&#232;me, le plus souvent &#224; l&#8217;aide de calculs statistiques, d&#233;termine la similarit&#233; entre les termes de requ&#234;te 
</p>
<p>et les termes associ&#233;s aux images.  
</p>
<p>Toutefois les images propos&#233;es &#224; l&#8217;utilisateur ne semblent pas toujours correspondre &#224; sa requ&#234;te de 
</p>
<p>recherche. Ces &#233;carts sont li&#233;s essentiellement &#224; l&#8217;opacit&#233; des syst&#232;mes de recherches par rapport &#224; la 
</p>
<p>signification s&#233;mantique : aucune analyse du contenu de la requ&#234;te pour d&#233;terminer sa signification n&#8217;est 
</p>
<p>pas r&#233;alis&#233;e. Une autre probl&#233;matique de l&#8217;indexation textuelle des images est le fait que la description 
</p>
<p>textuelle de l&#8217;image est souvent trop courte pour d&#233;crire son contenu. Il y a aussi des aspects subjectifs du 
</p>
<p>contenu d&#8217;une image, qui d&#233;pendent du domaine de connaissances et de la perception de celui qui la 
</p>
<p>regarde, et qui d&#233;terminent la diversit&#233; de la description d&#8217;une image.  
</p>
<p>Afin de rendre &#224; l&#8217;utilisateur des r&#233;sultats r&#233;pondant mieux &#224; sa requ&#234;te, il convient d&#8217;utiliser des 
</p>
<p>ressources s&#233;mantiques1. 
</p>
<p>3 Le TLFi 
</p>
<p>Le Tr&#233;sor de la langue fran&#231;aise (TLF) est le plus grand dictionnaire de langue fran&#231;aise r&#233;dig&#233; en 16 
</p>
<p>volumes par l&#8217;Institut National de la Langue Fran&#231;aise (INaLF, laboratoire du CNRS). Son apparition en 
</p>
<p>2000 sur l&#8217;Internet a &#233;t&#233; un vrai succ&#232;s, 30 000 &#224; 40 000 demandes quotidiennes provenant de tout le 
</p>
<p>monde (Dendien &amp; Pierrel, 2003). Il est utilis&#233; dans le milieu d&#8217;enseignement (les &#233;coles, les lyc&#233;es, les 
</p>
<p>universit&#233;s etc.) avec le m&#234;me engouement que dans le milieu de recherche. Ainsi le TLFi devient la base 
</p>
<p>                                                        
1
  Les ressources s&#233;mantiques sont repr&#233;sent&#233;es sous forme de bases de connaissances structur&#233;es comme 
</p>
<p>les taxonomies, les th&#233;saurus, les ontologies. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESSOURCES LEXICALES AU SERVICE DE RECHERCHE ET D&#8217;INDEXATION DES IMAGES 
 
</p>
<p> 
</p>
<p>de plusieurs projets de recherche comme par exemple le projet Definiens (Barque &amp; Polgu&#232;re, 2009) ou le 
</p>
<p>projet RELIEF2.  
</p>
<p>Quelles sont alors les facteurs qui d&#233;terminent l&#8217;utilisation du TLFi dans ces projets ? Tout d&#8217;abord TLFi 
</p>
<p>est une ressource norm&#233;e en XML qui est accessible &#224; la toute communaut&#233; scientifique. C&#8217;est aussi une 
</p>
<p>source de donn&#233;es lexicales tr&#232;s riche. On y retrouve toute l&#8217;information synchronique et diachronique 
</p>
<p>d&#8217;un mot. Sa structure assez normalis&#233;e et structur&#233;e permet une extraction des connaissances, par 
</p>
<p>exemple pour le domaine de Traitement Automatique des Langues. Le TLFi pr&#233;sent aussi un grand int&#233;r&#234;t 
</p>
<p>dans la structure de ses d&#233;finitions lexicographiques. Les d&#233;finitions du TLFi sont des d&#233;finitions logiques 
</p>
<p>(hyperonymiques) constitu&#233;es d&#8217;une classe ou genre prochain &#224; laquelle appartient le mot d&#233;fini et des 
</p>
<p>propri&#233;t&#233;s qui le particularisent &#224; l&#8217;int&#233;rieur de cette classe.  
</p>
<p>Si les deux projets pr&#233;c&#233;demment cit&#233;s visent l&#8217;utilisation du TLFi pour la cr&#233;ation des nouvelles 
</p>
<p>ressources linguistiques, nous nous proposons ici comme but l&#8217;utilisation du TLFi pour la recherche et 
</p>
<p>l&#8217;indexation des images fond&#233;e sur l&#8217;annotation textuelle. Nous utilisons les d&#233;finitions du TLFi pour la 
</p>
<p>cr&#233;ation automatique et l&#8217;enrichissement d&#8217;un th&#233;saurus &#224; partir des mots-cl&#233;s de la requ&#234;te de recherche 
</p>
<p>et des mots-cl&#233;s attribu&#233;s &#224; l&#8217;image lors l&#8217;indexation. Plus pr&#233;cisement il s&#8217;agit d&#8217;associer, de fa&#231;on 
</p>
<p>automatis&#233;, &#224; chaque mot-cl&#233; de l&#8217;image une liste des mots extraits de ses d&#233;finitions TLFi pour un 
</p>
<p>domaine donn&#233;, en construisant ainsi un arbre hi&#233;rarchique. 
</p>
<p>4 Repr&#233;sentation et analyse de corpus de travail 
</p>
<p>Le corpus de travail que nous utilisons est constitu&#233; des donn&#233;es de la ressource lexicale SEMEME, 
</p>
<p>construite &#224; partir du TLFi dans le cadre du projet DIXEME. SEMEME contient 78 476 fichiers XML 
</p>
<p>pour 93 697 entr&#233;es. L&#8217;int&#233;r&#234;t que nous portons pour SEMEME est qu&#8217;il contient les d&#233;finitions TLFi 
</p>
<p>lemmatis&#233;es3 et filtr&#233;es, en ne gardant que les mots &#224; s&#233;mantisme pleine (substantifs, verbes, adjectives, 
</p>
<p>adverbes). A chaque d&#233;finition du TLFi sont aussi attribu&#233;es des statistiques d&#8217;occurrences de chaque 
</p>
<p>lemme, le domaine d&#8217;emploi et des informations de contraintes structurelles li&#233;s au lex&#232;me. Par rapport au 
</p>
<p>TLFi initiale, dans SEMEME ne sont pas gard&#233;es les informations relatives &#224; l&#8217;organisation hi&#233;rarchique 
</p>
<p>(marques de plan, marques de niveau hi&#233;rarchique), l&#8217;information lexicographique sur l&#8217;indicateur 
</p>
<p>d&#8217;emploi, les synonymes et les antonymes. L&#8217;information sur les donn&#233;es de corpus de travail est pr&#233;sent&#233;e 
</p>
<p>dans le tableau 1 ci-dessous : 
</p>
<p> Total Vedette Syntagme 
</p>
<p>Lemmes diff&#233;rents 38 617 35 468 (91.84%) 22 779 (58.98%) 
</p>
<p>D&#233;finitions 265 475 206 052 (77.61%) 59 423 (22.38%) 
</p>
<p>Tableau 1 : L&#8217;information sur les donn&#233;es de corpus de travail 
</p>
<p> 
</p>
<p>Pour pouvoir faire une analyse profonde de notre corpus de travail, toutes les donn&#233;es contenues dans les 
</p>
<p>fichiers XML ont &#233;t&#233; mises dans une base de donn&#233;es. 
</p>
<p> 
</p>
<p>                                                        
2
  Ressource Lexicale Informatis&#233;e d&#8217;Envergure. Il s&#8217;agit d&#8217;un nouveau projet lexicographe qui vise la 
</p>
<p>construction d&#8217;une nouvelle ressource lexicale du fran&#231;ais &#224; large couverture, appel&#233;e le R&#233;seau 
</p>
<p>Lexical du Fran&#231;ais (RLF), &#224; partir de TLFi. 
</p>
<p>3  Les d&#233;finitions ont &#233;t&#233; lemmatis&#233;es et annot&#233;es avec un outil r&#233;alis&#233; par l&#8217;ATILF. La lemmatisation n&#8217;a 
</p>
<p>pas &#233;t&#233; sans erreurs, le fait qui doit &#234;tre pris en compte lors l&#8217;exploitation des r&#233;sultats. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INGA GHEORGHITA 
</p>
<p> 
</p>
<p>4.1 La structure des d&#233;finitions TLFi 
</p>
<p>Les d&#233;finitions d&#8217;un dictionnaire sont r&#233;dig&#233;es selon certaines r&#232;gles qui d&#233;terminent le type et la structure 
</p>
<p>des d&#233;finitions. En lexicographie il y a plusieurs types de d&#233;finitions : logique (hyperonymique), par 
</p>
<p>&#233;quivalence synonymique, morphos&#233;mantique, m&#233;ronymique, par approximation (Touratier, 2000).  
</p>
<p>En g&#233;n&#233;ral, les d&#233;finitions du TLFi sont construites selon sch&#233;ma suivante &#171; classificateur+sp&#233;cifications &#187; 
</p>
<p>o&#249; le classificateur repr&#233;sente la classe &#224; la quelle appartient le mot d&#233;fini et les sp&#233;cifications d&#233;signent 
</p>
<p>les caract&#233;ristiques sp&#233;cifiques du mot au sein de cette classe. D&#8217;habitude le classificateur repr&#233;sente la 
</p>
<p>classe &#224; laquelle appartient le mot d&#233;fini et il varie en fonction du domaine de d&#233;finition. Par exemple le 
</p>
<p>mot &#171; crime &#187; dans le domaine juridique a comme classificateur &#171;infraction &#187; et dans une d&#233;finition par 
</p>
<p>hyperbole son classificateur est &#171; action &#187;. Donc suivant le domaine, le mot &#171; crime &#187; peut &#234;tre group&#233; 
</p>
<p>dans deux classes &#171; infraction &#187; et &#171; action &#187;. 
</p>
<p>Les d&#233;finitions nominales du TLFi suivent le mieux la structure d&#8217;une d&#233;finition hyperonymique. Nous 
</p>
<p>avons remarqu&#233; que, dans ces d&#233;finitions, le classificateur correspond dans la plupart des cas au premier 
</p>
<p>substantif de la d&#233;finition, en indiquant ainsi le concept le plus voisin du mot &#224; d&#233;finir. 
</p>
<p>4.2 Les connaissances lexicales pour le regroupement des d&#233;finitions TLFi 
</p>
<p>Pour une entr&#233;e du TLFi, les d&#233;finitions sont structur&#233;es selon une hi&#233;rarchie de niveaux. Cette 
</p>
<p>structuration n&#8217;est pas toujours similaire. Pour certaines entr&#233;es, les d&#233;finitions pr&#233;c&#233;d&#233;es des indicateurs 
</p>
<p>d&#8217;emploi, des domaines, apparaissent aux niveaux plus hauts (I, II) de la hi&#233;rarchie, mais pour d&#8217;autres 
</p>
<p>entr&#233;es les d&#233;finitions apparaissent aux niveaux inf&#233;rieurs. Donc le fait de consid&#233;rer la d&#233;finition de haut 
</p>
<p>niveau comme la plus appropri&#233;e pour un mot de l&#8217;entr&#233;e du TLFi n&#8217;est pas tout &#224; fait juste.  
</p>
<p>Les indicateurs d&#8217;emploi, les domaines, les informations mises entre crochets semblent &#234;tre plus 
</p>
<p>pertinentes pour la d&#233;termination des d&#233;finitions appropri&#233;es pour un mot.  
</p>
<p>Dans les fichiers XML de SEMEME, les domaines sont les seules connaissances lexicales qui permettent 
</p>
<p>d&#8217;associer &#224; un mot une d&#233;finition particuli&#232;re. Cela nous permet de regrouper les d&#233;finitions d&#8217;une entr&#233;e 
</p>
<p>du TLFi selon les domaines.  
</p>
<p>Par contre seulement 30.87% d&#233;finitions vedettes du TLFi ont des domaines. Les d&#233;finitions sans 
</p>
<p>domaines sont group&#233;es dans nouveau domaine nomm&#233; &#171; generic &#187;. 
</p>
<p>4.3 Les expressions m&#233;talinguistiques des d&#233;finitions 
</p>
<p>Chaque type de d&#233;finition (nominale, verbale, adjectivale, adverbiale) est li&#233; &#224; des expressions 
</p>
<p>m&#233;talinguistiques caract&#233;ristiques de son type. Dans les d&#233;finitions nominales on rencontre souvent les 
</p>
<p>expressions m&#233;talinguistiques de type : &#171; action de &#187;, &#171; mani&#232;re de &#187;, &#171; fait de &#187;, &#171; partie de &#187;, &#171; manque 
</p>
<p>de &#187; etc. Pour les d&#233;finitions verbales sont caract&#233;ristiques des locutions verbales et des locutions 
</p>
<p>comprenant les verbes fonctionnels tels &#171; faire &#187; ou &#171; laisser &#187;. Les d&#233;finitions adjectivales, quant &#224; elles, 
</p>
<p>ont plus souvent la structure &#171; Qui+&#234;tre+Adj.&#187;, &#171; Qui+verbe &#187;, &#171; propre &#224; &#187;, &#171; relatif &#224; &#187;, &#171; se dit de &#187; etc. 
</p>
<p>Dans nos recherches nous avons port&#233; plus d&#8217;attention aux d&#233;finitions nominales car lors de la 
</p>
<p>construction du th&#233;saurus seuls seront utilis&#233;s seulement les substantifs. 
</p>
<p>Si la classe des &#233;v&#233;nements ou la classe des transports est d&#233;finissable, la classe des actions, des mani&#232;res 
</p>
<p>est plus difficile &#224; d&#233;finir. Les hyperonymes de type &#171; action, mani&#232;re, caract&#232;re etc. &#187; sont trop g&#233;n&#233;riques 
</p>
<p>pour repr&#233;senter des concepts. C&#8217;est pour cette raison que nous avons cr&#233;&#233; une classe, nomm&#233;e la classe 
</p>
<p>M, qui contient toutes les expressions m&#233;talinguistiques trouv&#233;es dans les d&#233;finitions du TLFi. Les mots 
</p>
<p>qui appartiennent &#224; cette classe ne sont pas utilis&#233;s. Toutefois pour pouvoir les garder4, ils sont ajout&#233;s de 
</p>
<p>mani&#232;re suivante  au substantif qui les pr&#233;c&#232;de : 
</p>
<p>                                                        
4  Nous consid&#233;rons important de garder les expressions m&#233;talinguistiques afin de pouvoir sp&#233;cifier le 
</p>
<p>mot qui les pr&#233;c&#232;de. Par exemple le mot &#171; continent &#187; ne peut pas &#234;tre consid&#233;r&#233; comme &#171; monde &#187; 
</p>
<p>quand en r&#233;alit&#233; il repr&#233;sente une partie de ce monde.  
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESSOURCES LEXICALES AU SERVICE DE RECHERCHE ET D&#8217;INDEXATION DES IMAGES 
 
</p>
<p> 
</p>
<p>Classe M + Subst. =&gt; Subst. (Classe M) 
</p>
<p> 
</p>
<p>Dans les d&#233;finitions du TLFi sont utilis&#233;es aussi des expressions m&#233;talinguistiques d&#8217;oppositions de type 
</p>
<p>&#171; sans, pas avec, non, ni, par opposition au &#187;. Pour ce type des expressions nous avons cr&#233;&#233; une autre 
</p>
<p>classe N. Les substantifs situ&#233;s dans la d&#233;finition apr&#232;s les mots qui appartiennent &#224; cette classe, sont 
</p>
<p>&#233;limin&#233;s : 
</p>
<p>Classe N + Subst. =&gt; Subst. 
</p>
<p>5 Pond&#233;ration des mots dans une d&#233;finition TLFi 
</p>
<p>Dans une d&#233;finition les mots ont des statuts diff&#233;rents et n&#8217;apportent pas la m&#234;me quantit&#233; d&#8217;information. 
</p>
<p>Afin de pouvoir attribuer &#224; un mot-cl&#233; une liste des noms qui repr&#233;sente le classificateur et les 
</p>
<p>sp&#233;cifications dans un domaine donn&#233;, nous regroupons toutes les d&#233;finitions du TLFi selon les domaines 
</p>
<p>et calculons la pond&#233;ration de chaque lemme.  
</p>
<p>Par rapport aux autres formules de pond&#233;ration comme TF.IDF (Sparck Jones, 1972) qui privil&#232;ge les 
</p>
<p>termes discriminants et rares, notre but est de donner plus de poids aux termes situ&#233;s au d&#233;but de la 
</p>
<p>d&#233;finition, consid&#233;r&#233;s comme des repr&#233;sentants des classes, et aux termes discriminants dans la collection 
</p>
<p>des d&#233;finitions pour un domaine donn&#233;, consid&#233;r&#233;s comme des caract&#233;ristiques sp&#233;cifiques. Les 4 mesures 
</p>
<p>qui composent notre formule de pond&#233;ration ont &#233;t&#233; obtenues gr&#226;ce aux analyses effectu&#233;es sur notre 
</p>
<p>corpus de travail. 
</p>
<p>6 Hi&#233;rarchisation des termes 
</p>
<p>Afin de pouvoir faire une hi&#233;rarchisation des termes, d&#8217;autres crit&#232;res doivent &#234;tre pris en compte car la 
</p>
<p>pond&#233;ration n&#8217;est pas tout &#224; fait suffisante. En total nous avons analys&#233; 10 crit&#232;res qui pourraient &#234;tre 
</p>
<p>utilis&#233;s lors de la hi&#233;rarchisation des termes, mais seulement 2 ont &#233;t&#233; retenus : 
</p>
<p>1. La pr&#233;sence du mot vedette dans les d&#233;finitions de ses lemmes. 
</p>
<p>2. La pr&#233;sence des lemmes dans les d&#233;finitions des autres lemmes pour le m&#234;me mot vedette.  
</p>
<p>Quand le lemme L1 s&#8217;inclut dans les d&#233;finitions de lemme L2 et inversement, on peut parler de 
</p>
<p>ph&#233;nom&#232;nes d&#8217;hyp&#233;ronymie ou de synonymie. Ainsi dans le cas quand herbe &#8834; p&#226;turage et p&#226;turage &#8834; 
herbe on peut dire qu&#8217;ils sont des synonymes mais il est assez difficile de d&#233;terminer la relation de 
</p>
<p>l&#8217;hyp&#233;ronymie. Afin de pouvoir d&#233;terminer quel lemme repr&#233;sente un hyp&#233;ronyme pour l&#8217;autre il faut 
</p>
<p>v&#233;rifier sa position dans les d&#233;finitions. Le lemme avec la position la plus initiale est consid&#233;r&#233; comme 
</p>
<p>l&#8217;hyperonyme de l&#8217;autre lemme. 
</p>
<p>Ainsi dans notre exemple l&#8217;herbe est un hyperonyme de p&#226;turage, car il appara&#238;t en troisi&#232;me position 
</p>
<p>dans la d&#233;finition du lemme &#171; p&#226;turage &#187; alors qu&#8217;&#224; l&#8217;inverse &#171; p&#226;turage &#187; n&#8217;apparait qu&#8217;en 17e position 
</p>
<p>dans une des d&#233;finitions du lemme &#171; herbe &#187;. 
</p>
<p>7 Les principes de construction du th&#233;saurus 
</p>
<p>Les termes du th&#233;saurus sont les mots-cl&#233;s utilis&#233;s par utilisateur lors de la recherche ou de l&#8217;indexation 
</p>
<p>des images. Afin de pouvoir r&#233;aliser la hi&#233;rarchisation, &#224; chaque mot-cl&#233; est attribu&#233;e une liste de lemmes 
</p>
<p>avec les pond&#233;rations dans chaque domaine auquel peut appartenir le mot-cl&#233;. En s&#8217;appuyant sur les 
</p>
<p>crit&#232;res d&#233;crits ci-dessus nous avons pu d&#233;finir un processus automatique de hi&#233;rarchisation des termes. Le 
</p>
<p>th&#233;saurus est en constante &#233;volution car il est construit au fur et &#224; mesure que de nouveaux mots-cl&#233;s 
</p>
<p>apparaissent dans la base d&#8217;indexation des images. Le th&#233;saurus a une structure hi&#233;rarchique &#224; 
</p>
<p>arborescence simple o&#249; les fils du n&#339;ud p&#232;re repr&#233;sentent des &#233;l&#233;ments de celui-l&#224; li&#233;s par la relation &#171; est 
</p>
<p>un &#187; (cf. fig.1).   
</p>
<p> 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INGA GHEORGHITA 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1 : Mod&#232;le de th&#233;saurus hi&#233;rarchique &#224; arborescence simple 
</p>
<p> 
</p>
<p>L&#8217;arbre de la hi&#233;rarchie est peu profond et se d&#233;veloppe avant tout en largeur. 
</p>
<p>8 Analyse des r&#233;sultats 
</p>
<p>L&#8217;analyse des premiers r&#233;sultats a montr&#233; que les pond&#233;rations des termes et les crit&#232;res utilis&#233;s ne sont 
</p>
<p>pas toujours suffisants pour la construction autonome de la hi&#233;rarchie. Le probl&#232;me principal est la 
</p>
<p>capacit&#233; &#224; extraire &#224; partir d&#8217;une d&#233;finition les lemmes qui repr&#233;sentent la classe &#224; laquelle appartient le 
</p>
<p>mot-cl&#233; et ses sp&#233;cifications. Ci-dessous (cf. tableau 2) nous pr&#233;sentons les r&#233;sultats obtenus pour le mot-
</p>
<p>cl&#233; &#171; tanaisie &#187;. 
</p>
<p>Domaine Lemme Pond&#233;ration 
</p>
<p>Botanique plante 0.09659559704474198 
</p>
<p>Botanique famille 0.0298607629748796 
</p>
<p>Botanique fleur 0.01445838603979702 
</p>
<p>Botanique bouquet 9.579406148522748E-5 
</p>
<p>Botanique tige 0.0018571130644637402 
</p>
<p>Botanique herboristerie 7.80560689215469E-6 
</p>
<p>Botanique propri&#233;t&#233; 2.508329670387084E-4 
</p>
<p>Tableau 2 : Pond&#233;rations des lemmes du mot-cl&#233; &#171; tanaisie &#187; 
</p>
<p> 
</p>
<p>Le lemme &#171; plante &#187; a une pond&#233;ration la plus grande et est consid&#233;r&#233; comme l&#8217;hyperonyme du mot 
</p>
<p>&#171; tanaisie &#187;. 
</p>
<p>Afin de pouvoir construire la hi&#233;rarchie nous v&#233;rifions quels lemmes sont inclus dans les d&#233;finitions des 
</p>
<p>autres lemmes (cf. tableau 3). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESSOURCES LEXICALES AU SERVICE DE RECHERCHE ET D&#8217;INDEXATION DES IMAGES 
 
</p>
<p> 
</p>
<p>Lemmes 1 Lemmes 2 
</p>
<p>famille tige 
</p>
<p>fleur tige 
</p>
<p>fleur bouquet 
</p>
<p>tige plante 
</p>
<p>plante fleur 
</p>
<p>plante tige 
</p>
<p>plante herboristerie 
</p>
<p>plante bouquet 
</p>
<p>Tableau 3 : La liste des Lemmes 1qui se trouvent dans les d&#233;finitions des Lemmes 2 
</p>
<p> 
</p>
<p>Puisque le lemme &#171; plante &#187; a &#233;t&#233; choisi comme l&#8217;hyperonyme du mot &#171; tanaisie &#187; (cf. tableau 3), nous 
</p>
<p>v&#233;rifions seulement pour ce lemme sa position dans les d&#233;finitions des autres lemmes et choisissons le 
</p>
<p>lemme dans la quelle le lemme &#171; plante &#187; a la position la plus initiale. Dans le cas pr&#233;sent, c&#8217;est dans la 
</p>
<p>d&#233;finition de lemme &#171; fleur &#187; que le lemme &#171; plante &#187; a la position la plus initiale. La structure 
</p>
<p>hi&#233;rarchique construite est donc de la forme suivante (cf. image 1) : 
</p>
<p> 
</p>
<p>Image 1 : Exemple de construction d&#8217;une hi&#233;rarchie pour le mot-cl&#233; &#171; tanaisie &#187; 
</p>
<p> 
</p>
<p>Les autres lemmes &#171; tige, herboristerie, bouquet &#187; sont consid&#233;r&#233;s comme des caract&#233;ristiques de terme 
</p>
<p>&#171; plante &#187; et dans le th&#233;saurus seront situ&#233;s au niveau le plus bas. 
</p>
<p>Toutefois les r&#232;gles propos&#233;es, lors de la hi&#233;rarchisation ne sont pas suffisantes pour satisfaire tous les cas. 
</p>
<p>Comme un syst&#232;me informatique ne poss&#232;de pas d&#8217;intuition &#233;pilinguistique, l&#8217;intervention de l&#8217;homme est 
</p>
<p>indispensable. 
</p>
<p>La pr&#233;sence des domaines comme des termes g&#233;n&#233;riques du th&#233;saurus est tr&#232;s importante et permet de 
</p>
<p>r&#233;soudre les probl&#232;mes d&#8217;ambigu&#239;t&#233;. Lorsqu&#8217;un mot-cl&#233; appartient plusieurs domaines, l&#8217;utilisateur peut 
</p>
<p>pr&#233;ciser le domaine concret qu&#8217;il souhaite pour indexer son image. L&#8217;interaction homme-machine permet 
</p>
<p>ainsi d&#8217;am&#233;liorer les r&#233;sultats de recherches en proposant &#224; l&#8217;utilisateur seulement les images d&#8217;un 
</p>
<p>domaine exact.  
</p>
<p>La validation des r&#233;sultats pourra &#234;tre r&#233;alis&#233;e &#224; l&#8217;aide de projet Definiens, o&#249; la segmentation des 
</p>
<p>d&#233;finitions TLFi, en composante centrale et composante p&#233;riph&#233;riques, a &#233;t&#233; r&#233;alis&#233;e manuellement5.  
</p>
<p>                                                        
5  Les premiers r&#233;sultats de ce projet Definiens en cours devaient &#234;tre disponibles dans quelques mois. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INGA GHEORGHITA 
</p>
<p> 
</p>
<p>9 Conclusion 
</p>
<p>L&#8217;objectif poursuivi dans nos recherches est la cr&#233;ation d&#8217;un syst&#232;me automatique d&#8217;indexation et de 
</p>
<p>recherche d&#8217;images exploitant des s&#233;mantiques du TLFi. La solution propos&#233;e dans cet article consiste en 
</p>
<p>cr&#233;ation d&#8217;un th&#233;saurus construit &#224; l&#8217;aide des ressources linguistiques qui permettent d&#8217;enrichir les 
</p>
<p>descriptions textuelles de l&#8217;image et d&#8217;interpr&#233;ter son contenu. Gr&#226;ce &#224; sa forte capacit&#233; d&#8217;apprentissage, le 
</p>
<p>th&#233;saurus permet une cat&#233;gorisation tr&#232;s pr&#233;cis&#233;ment des images, selon les domaines, une indexation de 
</p>
<p>grandes quantit&#233;s d&#8217;images et une recherche rapide. 
</p>
<p>A l&#8217;&#233;tape actuelle les recherches ont &#233;t&#233; men&#233;es sur l&#8217;analyse des d&#233;finitions du TLFi et la d&#233;termination 
</p>
<p>des r&#232;gles de hi&#233;rarchisation. Prochainement les r&#232;gles seront impl&#233;ment&#233;es dans le syst&#232;me afin de 
</p>
<p>r&#233;aliser les premi&#232;res exp&#233;rimentes sur un corpus d&#8217;entra&#238;nement. 
</p>
<p> 
</p>
<p>Remerciements 
</p>
<p>Je tiens &#224; exprimer mes remerciements &#224; Monsieur Jean-Marie Pierrel, mon directeur de recherche, pour 
</p>
<p>sa disponibilit&#233; et ses conseils, et messieurs Eric Mathieu et Cyril March, responsables de XILOPIX, pour 
</p>
<p>m&#8217;offrir la possibilit&#233; de mener mes recherches dans le cadre de leur entreprise. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BARQUE L., &amp; POLGUERE A. (2009). Structuration et balisage s&#233;mantique des d&#233;finitions du Tr&#233;sor de la 
</p>
<p>Langue Fran&#231;aise informatis&#233; (TLFi). Fourth International Conference on Meaning-Text Theory. 
</p>
<p>Montr&#233;al. 
</p>
<p>DENDIEN J., &amp; PIERREL J.-M. (2003). Le Tr&#233;sor de la Langue Fran&#231;aise informatis&#233; : un exemple 
</p>
<p>d'informatisation d'un dictionnaire de langue de r&#233;f&#233;rence. TAL (Traitement Automatique des Langues), 
</p>
<p>Vol. 44 - n&#176;2. Hermes Sciences. 
</p>
<p>GROSS P. (2007). L'indexation multim&#233;dia : description et recherche automatique. Lavoisier. 
</p>
<p>SPARCK JONES K. (1972). A statistical interpretation of term specificity and its application in retrieval. 
</p>
<p>Journal of Documentation , 28(1), 11-20. 
</p>
<p>TOURATIER C. (2000). La s&#233;mantique. Paris: Armand Colin. </p>

</div></div>
</body></html>