<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une alg&#232;bre des relations de discours pour la comparaison de structures discursives</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Vers une alg&#232;bre des relations de discours
pour la comparaison de structures discursives
</p>
<p>Charlotte Roze
Alpage, INRIA Paris&#8211;Rocquencourt &amp; Universit&#233; Paris 7
</p>
<p>charlotteroze@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. Nous proposons une m&#233;thodologie pour la construction de r&#232;gles de d&#233;duction de relations de dis-
cours, destin&#233;es &#224; &#234;tre int&#233;gr&#233;es dans une alg&#232;bre de ces relations. La construction de ces r&#232;gles a comme principal
objectif de pouvoir calculer la fermeture discursive d&#8217;une structure de discours, c&#8217;est-&#224;-dire de d&#233;duire toutes les
relations que la structure contient implicitement. Calculer la fermeture des structures discursives peut permettre
d&#8217;am&#233;liorer leur comparaison, notamment dans le cadre de l&#8217;&#233;valuation de syst&#232;mes d&#8217;analyse automatique du
discours. Nous pr&#233;sentons la m&#233;thodologie adopt&#233;e, que nous illustrons par l&#8217;&#233;tude d&#8217;une r&#232;gle de d&#233;duction.
</p>
<p>Abstract. We propose a methodology for the construction of discourse relations inference rules, to be
integrated into an algebra of these relations. The construction of these rules has as main objective to allow for the
calculation of the discourse closure of a structure, i.e. deduce all the relations implicitly contained in the structure.
Calculating the closure of discourse structures improves their comparison, in particular within the evaluation of
discourse parsing systems. We present the adopted methodology, which we illustrate by the study of a rule.
</p>
<p>Mots-cl&#233;s : Relation de discours, fermeture discursive, &#233;valuation, d&#233;duction.
</p>
<p>Keywords: Discourse relation, discourse closure, evaluation, inference.
</p>
<p>1 Introduction
</p>
<p>L&#8217;analyse rh&#233;torique (ou discursive) d&#8217;un texte a pour but de repr&#233;senter sa structure globale, c&#8217;est-&#224;-dire les liens
qui s&#8217;&#233;tablissent entre les diff&#233;rentes parties du texte, permettant &#224; son lecteur de l&#8217;interpr&#233;ter comme formant un
tout coh&#233;rent, et pas comme une simple succession de phrases ind&#233;pendantes les unes des autres. Ces liens sont
appel&#233;s relations rh&#233;toriques ou relations de discours. Ils s&#8217;&#233;tablissent entre des segments de discours, qui couvrent
des propositions, des phrases et/ou de plus larges portions du texte. Diff&#233;rentes th&#233;ories et formalismes, comme la
RST (Rhetorical Structure Theory, Mann &amp; Thompson, 1988), la SDRT (Segmented Discourse Representation
Theory, Asher &amp; Lascarides, 2003), D&#8211;LTAG (Discourse Lexicalized Tree Adjoining Grammar, Webber, 2004),
et D&#8211;STAG (Discourse Synchronous Tree Adjoining Grammar, Danlos, 2009), proposent de repr&#233;senter ce type
de structures. Dans le travail pr&#233;sent&#233; ici, le cadre th&#233;orique adopt&#233; est la SDRT.
</p>
<p>Le traitement automatique du discours vise principalement &#224; d&#233;velopper des syst&#232;mes permettant de g&#233;n&#233;rer des
analyses de la structure discursive d&#8217;un texte. Dans cette perspective, la constitution de corpus de r&#233;f&#233;rence et
l&#8217;&#233;valuation des annotations produites par les syst&#232;mes d&#8217;analyse automatique sont des t&#226;ches primordiales. Les
corpus de r&#233;f&#233;rence fournissent des donn&#233;es aux syst&#232;mes bas&#233;s sur des m&#233;thodes d&#8217;apprentissage et permettent
d&#8217;&#233;valuer les annotations en sortie d&#8217;un analyseur. La constitution de ces corpus n&#233;cessite bien souvent la &#171; fu-
sion &#187; de diff&#233;rentes annotations d&#8217;un m&#234;me texte, donc la comparaison de structures discursives. L&#8217;&#233;valuation des
annotations g&#233;n&#233;r&#233;es par un syst&#232;me implique elle aussi la comparaison de structures discursives : les structures
contenues dans les annotations du syst&#232;me et les structures contenues dans les annotations de r&#233;f&#233;rence.
</p>
<p>Les questions qui se posent dans un objectif de construction d&#8217;une r&#233;f&#233;rence ou d&#8217;&#233;valuation sont donc les sui-
vantes : comment comparer deux annotations en discours ? quelles structures de discours sont &#233;quivalentes ou
compatibles ? En effet, deux annotations discursives d&#8217;un m&#234;me texte peuvent diff&#233;rer sans que l&#8217;une ou l&#8217;autre
soit pour autant &#171; fausse &#187; ou &#171; incompl&#232;te &#187;. Consid&#233;rons par exemple le discours en (1), qui contient trois seg-
ments de discours, que nous nommons (pi1), (pi2) et (pi3). On peut avoir deux annotations diff&#233;rentes et n&#233;an-
moins &#233;quivalentes pour ce discours : une premi&#232;re annotation A1, contenant les relations Result(pi1, pi2) et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLOTTE ROZE
</p>
<p>Elaboration(pi2, pi3) ; une seconde annotationA2 contenant ces deux m&#234;mes relations et la relation Result(pi1, pi3).
Les deux annotations diff&#232;rent, mais sont &#233;quivalentes : dans l&#8217;annotation A1, il est renseign&#233; que (pi3) &#233;labore
(pi2), qui lui-m&#234;me d&#233;crit un r&#233;sultat de (pi1) ; il est donc implicitement renseign&#233; que (pi3) d&#233;crit un r&#233;sultat de
(pi1), ce qui signifie que l&#8217;on peut d&#233;duire l&#8217;annotation A2 &#224; partir de l&#8217;annotation A1.
</p>
<p>1. (a) Il a beaucoup plu aujourd&#8217;hui. (pi1)
(b) Du coup, Jean n&#8217;a pas pu faire ce qu&#8217;il avait pr&#233;vu. (pi2)
(c) Il n&#8217;a pas pu faire son footing, notamment. (pi3)
</p>
<p>Dans le cadre de la construction d&#8217;une annotation de r&#233;f&#233;rence pour un texte donn&#233;, on veut pouvoir int&#233;grer les
informations pr&#233;sentes dans les diff&#233;rentes annotations de ce texte, si bien s&#251;r elles sont compatibles. Dans le
cadre de l&#8217;&#233;valuation, on veut savoir si certaines informations absentes dans une annotation A1 (que ce soit la
r&#233;f&#233;rence ou non) et pr&#233;sentes dans une annotation A2 sont en r&#233;alit&#233; implicitement renseign&#233;es dans l&#8217;annotation
A1. Autrement dit, on voudrait pouvoir d&#233;duire toutes les informations (les relations de discours) implicitement
pr&#233;sentes dans les deux annotations &#224; comparer.
</p>
<p>&#201;tant donn&#233;e une structure discursive associ&#233;e &#224; un texte, compos&#233;e de relations de discours entre les segments qui
le constituent, notre objectif est donc de pouvoir calculer, &#224; l&#8217;aide de r&#232;gles de d&#233;duction, la fermeture discursive
de la structure, c&#8217;est-&#224;-dire toutes les relations de discours qui peuvent &#234;tre d&#233;duites &#224; partir des relations d&#233;j&#224;
annot&#233;es. Pour calculer la fermeture discursive d&#8217;une structure, des r&#232;gles de d&#233;duction de relations de discours
sont n&#233;cessaires. Par exemple, pour calculer la fermeture discursive de l&#8217;annotation A1 du discours en (1), nous
avons besoin de la r&#232;gle suivante : Result(pi1, pi2) &#8743; Elaboration(pi2, pi3) &#8594; Result(pi1, pi3). Or, les th&#233;ories du
discours ne d&#233;finissent pas (ou peu) de r&#232;gles de ce type. Nous proposons d&#8217;&#233;tudier et de construire des r&#232;gles de
d&#233;duction de relations de discours, destin&#233;es &#224; &#234;tre int&#233;gr&#233;es dans une alg&#232;bre des relations de discours, similaire
&#224; celle construite par Allen (1983) pour les relations temporelles.
</p>
<p>L&#8217;ensemble de relations rh&#233;toriques utilis&#233; varie selon les th&#233;ories, ainsi que la fa&#231;on dont ces relations sont d&#233;-
finies. N&#233;anmoins, il existe un consensus sur un certain nombre de relations, comme par exemple les relations
Elaboration et Narration. De plus, les relations peuvent g&#233;n&#233;ralement &#234;tre mises en correspondance d&#8217;une th&#233;orie
&#224; une autre : par exemple, la relation Result de la SDRT recouvre les relations Volitional Result et Non-Volitional
Result de la RST. Nous avons choisi de placer ce travail dans le cadre th&#233;orique de la SDRT (Asher &amp; Las-
carides, 2003), parce que : d&#8217;une part, cette th&#233;orie se trouve, en ce qui concerne la d&#233;finition des relations de
discours, &#224; un niveau de granularit&#233; interm&#233;diaire entre les approches multiplicatrices comme celle de la RST,
qui construisent des listes &#233;tendues de relations, et les approches r&#233;ductionnistes, comme celle de Grosz &amp; Sidner
(1986), qui proposent de ne distinguer que deux relations structurelles : dominates (dominance) et satisfaction-
precedence (satisfaction de la pr&#233;c&#233;dence) ; d&#8217;autre part, elle rend explicites les contraintes s&#233;mantiques &#233;tablies
par une relation de discours sur ses arguments, et ces contraintes sont le point de d&#233;part de l&#8217;&#233;tude des r&#232;gles de
d&#233;duction. Dans la SDRT, l&#8217;&#233;tablissement d&#8217;une relation donn&#233;e impose des contraintes (temporelles, causales,
structurelles) sur les deux segments qu&#8217;elle relie : par exemple, la relation Narration implique une pr&#233;c&#233;dence
temporelle entre les &#233;ventualit&#233;s qu&#8217;elle relie, la relation Result implique une relation causale entre deux &#233;ventua-
lit&#233;s, etc. (voir section 3.2). La structure hi&#233;rarchique du discours est repr&#233;sent&#233;e &#224; l&#8217;aide d&#8217;une distinction entre
relations coordonnantes et relations subordonnantes, ce qui permet &#233;galement de restreindre, dans un discours
donn&#233;, l&#8217;ensemble des segments disponibles pour l&#8217;attachement de nouveaux segments dans un discours.
</p>
<p>Dans la section 2, nous justifions l&#8217;utilisation de r&#232;gles de d&#233;duction dans l&#8217;&#233;valuation des structures discursives,
en montrant pourquoi les m&#233;triques d&#8217;&#233;valuation utilis&#233;es en analyse syntaxique ne permettent pas d&#8217;&#233;valuer cor-
rectement des analyses discursives. Dans un second temps, nous pr&#233;sentons des travaux qui s&#8217;int&#233;ressent aux
relations temporelles, et qui proposent d&#8217;am&#233;liorer l&#8217;&#233;valuation de graphes temporels &#224; l&#8217;aide de r&#232;gles de d&#233;duc-
tion. Dans la section 3, nous pr&#233;sentons une m&#233;thodologie pour la construction des r&#232;gles de d&#233;duction. Dans la
section 4, nous illustrons cette m&#233;thodologie par l&#8217;&#233;tude et la construction compl&#232;te d&#8217;une r&#232;gle. Pour terminer,
dans la section 5, nous concluons en apportant des perspectives dans la construction des r&#232;gles de d&#233;duction.
</p>
<p>2 &#201;valuation de graphes discursifs
</p>
<p>Les travaux en traitement automatique du discours, et plus pr&#233;cis&#233;ment le d&#233;veloppement de syst&#232;mes d&#8217;analyse
automatique de la structure discursive, posent, comme toutes les t&#226;ches de TAL, la question cruciale de l&#8217;&#233;valua-
tion : il faut &#233;valuer les analyses produites par les syst&#232;mes, en prenant en compte les particularit&#233;s des structures</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VERS UNE ALG&#200;BRE DES RELATIONS DE DISCOURS
</p>
<p>discursives. L&#8217;analyse de la structure discursive d&#8217;un texte comprend deux t&#226;ches distinctes : la segmentation en
unit&#233;s minimales de discours (appel&#233;s segments &#233;l&#233;mentaires), et l&#8217;annotation des relations existant entre les dif-
f&#233;rents segments (certains de ces segments recouvrent plusieurs segments &#233;l&#233;mentaires, et sont appel&#233;s segments
complexes). Nous ne traiterons ici que de l&#8217;&#233;valuation de la seconde &#233;tape.
</p>
<p>Les structures discursives sont, dans la SDRT, repr&#233;sent&#233;es par des graphes, dont les noeuds sont des segments
de discours (qui recouvrent des portions plus ou moins larges d&#8217;un texte : propositions, phrases, paragraphes,
etc.), et dont les arcs sont des relations de discours (par exemple : Narration, Explanation, etc.). Dans la RST, les
structures de discours sont repr&#233;sent&#233;es par des arbres binaires &#233;tiquet&#233;s (Marcu, 1996), dans lesquels les feuilles
sont des segments &#233;l&#233;mentaires, les autres noeuds sont des relations rh&#233;toriques, les &#233;tiquettes des arcs d&#233;crivant
le type des arguments de relations (Nucleus ou Satellite).
</p>
<p>Dans cette section, nous d&#233;crivons succinctement certaines m&#233;triques utilis&#233;es dans l&#8217;&#233;valuation de structures
proches des structures discursives : les arbres de constituants syntaxiques (proches des arbres de la RST, si l&#8217;on
fait un parall&#232;le entre les segments de discours et les mots, et un autre entre les relations rh&#233;toriques et les consti-
tuants), et les graphes de d&#233;pendances syntaxiques (proches des graphes de la SDRT). Nous verrons pourquoi ces
m&#233;triques ne permettent pas d&#8217;&#233;valuer correctement des analyses discursives. Dans un second temps, nous pr&#233;sen-
tons des travaux qui s&#8217;int&#233;ressent aux relations temporelles, et qui proposent d&#8217;am&#233;liorer l&#8217;&#233;valuation de graphes
temporels &#224; l&#8217;aide de r&#232;gles de d&#233;duction. Pour terminer, nous proposons d&#8217;utiliser des r&#232;gles de d&#233;duction pour
l&#8217;&#233;valuation de graphes discursifs, et discutons de la forme de ces r&#232;gles.
</p>
<p>Les syst&#232;mes de TAL sont g&#233;n&#233;ralement &#233;valu&#233;s en termes de rappel, pr&#233;cision et F-score (adapt&#233;s &#224; l&#8217;&#233;valua-
tion de la classification d&#8217;objets ind&#233;pendants), mais diverses m&#233;triques sont utilis&#233;es, selon la t&#226;che et le type de
structure &#224; &#233;valuer : m&#233;trique Parseval en analyse syntaxique, m&#233;trique BLEU (qui s&#8217;applique &#224; des s&#233;quences
de mots) en traduction automatique, etc. En analyse syntaxique, les arbres de constituants sont le plus souvent
&#233;valu&#233;s suivant la m&#233;trique Parseval (Black et al., 1991), qui calcule, pour un arbre syntaxique, la pr&#233;cision et
le rappel des constituants, en partant du principe suivant : un constituant dans l&#8217;arbre calcul&#233; par l&#8217;analyseur est
correct s&#8217;il existe un constituant dans l&#8217;arbre correspondant du corpus de r&#233;f&#233;rence qui domine la m&#234;me s&#233;quence
de symboles terminaux et poss&#232;de le m&#234;me label. Elle calcule &#233;galement la moyenne des constituants dans un
arbre qui &#171; croisent &#187; des fronti&#232;res de constituants dans l&#8217;autre arbre (crossing brackets). Dans l&#8217;&#233;valuation de
d&#233;pendances syntaxiques, les m&#233;triques utilis&#233;es (Nivre &amp; Scholz, 2004) sont g&#233;n&#233;ralement : UAS (unlabelled
attachment score), qui calcule la proportion de mots pour lesquels le gouverneur assign&#233; est correct ; LAS (label-
led attachment score), qui calcule la proportion de mots pour lesquels le gouverneur assign&#233; est correct et le type
de d&#233;pendance est correct ; et LabAcc (labelled accuracy score), qui calcule la proportion de mots pour lesquels
le type de d&#233;pendance est correct.
</p>
<p>Si l&#8217;on tente d&#8217;adapter les m&#233;triques utilis&#233;es dans l&#8217;&#233;valuation de d&#233;pendances syntaxiques pour &#233;valuer des
graphes discursifs (en rempla&#231;ant les mots par les segments de discours, et les d&#233;pendances syntaxiques par les re-
lations de discours), on constate qu&#8217;elles ne permettent pas toujours une &#233;valuation satisfaisante. Consid&#233;rons par
exemple le discours en (2). Dans ce discours, le segment (pi1) est &#233;labor&#233; par les segments (pi2) et (pi3) : ces deux
segments d&#233;crivent une partie du repas de Jean mentionn&#233; en (pi1). La description du repas est faite dans l&#8217;ordre
chronologique, les segments (pi2) et (pi3) forment donc une narration. Si l&#8217;on adapte les m&#233;triques UAS, LAS et
LabAcc pour &#233;valuer une annotation A de ce discours contenant Elaboration(pi1, pi2)&#8743;Narration(pi2, pi3), en pre-
nant comme r&#233;f&#233;rence l&#8217;annotationR de ce m&#234;me discours contenant Elaboration(pi1, [pi2, pi3])&#8743;Narration(pi2, pi3),
on n&#8217;obtient pas un score de 1. Pourtant, &#233;tant donn&#233; la s&#233;mantique des relations en jeu, on peut d&#233;duire que les
deux structures annot&#233;es sont &#233;quivalentes. En effet, l&#8217;annotation A permet de d&#233;duire l&#8217;annotation R : les infor-
mations a priori &#171; manquantes &#187; en A sont en r&#233;alit&#233; implicitement pr&#233;sentes.
</p>
<p>2. (a) Jean a fait un excellent repas. (pi1)
</p>
<p>(b) Il a mang&#233; un d&#233;licieux saumon, (pi2)
</p>
<p>(c) puis s&#8217;est r&#233;gal&#233; d&#8217;un copieux plateau de fromages. (pi3)
</p>
<p>Il est donc n&#233;cessaire d&#8217;utiliser des r&#232;gles de d&#233;duction pour proc&#233;der &#224; une &#233;valuation pr&#233;cise de structures
discursives. Concernant le discours en (2), la SDRT poss&#232;de une r&#232;gle qui permet d&#8217;&#233;tablir l&#8217;&#233;quivalence entre
l&#8217;annotation A et la r&#233;f&#233;rence R : Elaboration(&#945;, &#946;) &#8743; Narration(&#946;, &#947;) &#8594; Elaboration(&#945;, [&#946;, &#947;]). Cependant,
la question des &#233;quivalences entre structures discursives reste tr&#232;s peu &#233;tudi&#233;e dans les th&#233;ories du discours, et
pour une majorit&#233; de couples de relations de discours (R1, R2), nous ne savons pas (par exemple) si la structure
R1(&#945;, &#946;) &#8743; R2(&#946;, &#947;) contient une information implicite, et si oui, laquelle. Nous proposons donc d&#8217;&#233;tudier et de
d&#233;finir des r&#232;gles de d&#233;duction permettant une meilleure &#233;valuation des graphes discursifs. L&#8217;id&#233;e d&#8217;utiliser des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLOTTE ROZE
</p>
<p>r&#232;gles de d&#233;duction pour compl&#233;ter et &#233;valuer des annotations a d&#233;j&#224; &#233;t&#233; exploit&#233;e en ce qui concerne les relations
temporelles (Setzer et al., 2003) et les relations de cor&#233;f&#233;rence (Vilain et al., 1995). Par exemple, si une annotation
temporelle contient les informations : l&#8217;&#233;v&#233;nement e1 a lieu avant e2 (e1 &lt; e2) et l&#8217;&#233;v&#233;nement e2 a lieu avant e3
(e2 &lt; e3), alors il est implicite que l&#8217;&#233;v&#233;nement e1 a lieu avant e3 (et l&#8217;on peut d&#233;duire e1 &lt; e3). De la m&#234;me
fa&#231;on, si dans une annotation en cha&#238;nes de cor&#233;f&#233;rence les informations suivantes sont pr&#233;sentes : l&#8217;expression e1
cor&#233;f&#232;re avec e2 et l&#8217;expression e2 cor&#233;f&#232;re avec e3, alors il est implicite que l&#8217;expression e1 cor&#233;f&#232;re avec e3.
</p>
<p>En ce qui concerne les relations temporelles, Allen (1983) d&#233;finit une alg&#232;bre temporelle compl&#232;te, avec des
r&#232;gles de la forme : r1(A,B) &#8743; r2(B,C) &#8594; r3(A,C)1. L&#8217;alg&#232;bre utilise 13 relations (before, during, overlaps,
etc.). Dans beaucoup de cas, il existe plus d&#8217;une relation r3 d&#233;ductible entre les intervalles A et C. Par exemple :
overlaps(A,B) &#8743; overlaps(B,C) &#8594; before(A,C) &#8744; overlaps(A,C) &#8744; meets(A,C). Setzer et al. (2003) intro-
duisent la notion de fermeture temporelle d&#8217;un graphe temporel, qui est la repr&#233;sentation compl&#232;te des cons&#233;-
quences temporelles du graphe. Pour aider &#224; la cr&#233;ation de corpus de r&#233;f&#233;rence, ils proposent de comparer deux
annotations temporelles d&#8217;un m&#234;me texte en termes d&#8217;&#233;quivalence ou de recouvrement de leurs fermetures tem-
porelles, qui sont calcul&#233;es &#224; partir de r&#232;gles d&#8217;inf&#233;rences similaires &#224; celles d&#233;finies par Allen (1983). Ces r&#232;gles
peuvent &#233;galement servir d&#8217;aide &#224; l&#8217;annotation. Tannier &amp; Muller (2008) proposent une autre m&#233;thode de com-
paraison de graphes temporels. Ils distinguent deux types de relations dans un graphe temporel : les relations
essentielles, et les relations qui peuvent &#234;tre d&#233;duites &#224; partir d&#8217;autres relations. Ils proposent d&#8217;effectuer la com-
paraison et l&#8217;&#233;valuation d&#8217;annotations temporelles uniquement &#224; partir des relations essentielles, ce qui n&#233;cessite
&#233;galement l&#8217;exploitation de r&#232;gles de d&#233;duction.
</p>
<p>Nous proposons de construire une alg&#232;bre des relations de discours, inspir&#233;e de l&#8217;alg&#232;bre des relations temporelles
construite par Allen (1983), afin d&#8217;am&#233;liorer la qualit&#233; de l&#8217;&#233;valuation de graphes discursifs : &#233;tant donn&#233;e une
annotation discursive d&#8217;un texte, compos&#233;e de relations de discours entre les segments qui le constituent, notre
objectif est de calculer, &#224; l&#8217;aide de r&#232;gles de d&#233;duction, la fermeture discursive de l&#8217;annotation, c&#8217;est-&#224;-dire toutes
les relations de discours qui peuvent &#234;tre d&#233;duites &#224; partir des relations d&#233;j&#224; annot&#233;es. Pour construire une alg&#232;bre
des relations de discours, au moins deux types de r&#232;gles semblent n&#233;cessaires. En effet, si l&#8217;on consid&#232;re un
discours quelconque &#224; trois segments (&#945;), (&#946;) et (&#947;), il y a potentiellement deux structures (pr&#233;sent&#233;es &#224; la Figure
1) pour lesquelles une relation reste ind&#233;termin&#233;e (en pointill&#233;s dans la figure) : dans la premi&#232;re structure, la
relation entre (&#945;) et (&#947;) n&#8217;est pas explicite ; dans la seconde, c&#8217;est la relation entre (&#946;) et (&#947;) qui ne l&#8217;est pas2.
Consid&#233;rant ces deux structures, nous proposons d&#8217;utiliser deux types de r&#232;gles de d&#233;duction3 (repr&#233;sent&#233;s &#224; la
Figure 1). Notons que la d&#233;duction peut &#234;tre une disjonction de relations, comme dans l&#8217;alg&#232;bre de Allen.
</p>
<p>&#945;
&#946;
</p>
<p>&#947;
Rx Ry
</p>
<p>Rz
&#945;
</p>
<p>&#946;
&#947;
</p>
<p>Rx Ry
</p>
<p>Rz
</p>
<p>FIG. 1 &#8211; Sch&#233;mas de d&#233;duction pour les deux types de r&#232;gles : d&#233;duction de Rz ou d&#233;duction de Ry (o&#249; (&#945;), (&#946;)
et (&#947;) repr&#233;sentent trois segments de discours successifs)
</p>
<p>3 M&#233;thodologie pour la construction d&#8217;une alg&#232;bre des relations de dis-
cours
</p>
<p>Nous d&#233;taillons dans cette section la m&#233;thodologie adopt&#233;e dans l&#8217;&#233;tude et la construction des r&#232;gles de d&#233;duction.
Pour plus de lisibilit&#233;, nous ne pr&#233;sentons la m&#233;thodologie que pour le premier type de r&#232;gle propos&#233; (&#224; gauche
dans la Figure 1). La construction des r&#232;gles se fait pr&#233;misse par pr&#233;misse. Dans la section 3.1, nous d&#233;crivons
</p>
<p>1 A, B et C repr&#233;sentent des intervalles temporels, et r1, r2 et r3 des relations temporelles.
2 Dans la SDRT, la seconde structure n&#8217;est valide que si Rx est une relation subordonnante : selon la contrainte de la fronti&#232;re droite,
</p>
<p>si Rx est coordonnante, (&#947;) ne peut th&#233;oriquement pas &#234;tre &#171; attach&#233; &#187; &#224; (&#945;). Cependant, ces structures en th&#233;orie invalides ne sont pas
n&#233;cessairement exclues des annotations en discours, nous les prenons donc en compte dans les r&#232;gles de d&#233;duction &#224; &#233;tudier.
</p>
<p>3 Si les relations trait&#233;es &#233;taient des relations temporelles, le cas Rx(&#945;, &#946;) &#8743; Rz(&#945;, &#947;) pourrait &#234;tre ramen&#233; au cas : R&#8722;1x (&#946;, &#945;) &#8743;
Rz(&#945;, &#947;), o&#249;R&#8722;1x est la relation &#171; inverse &#187; deRx. En effet, dans l&#8217;alg&#232;bre de Allen, il n&#8217;existe que des r&#232;gles dont la pr&#233;misse est r1(A,B)&#8743;
r2(B,C). En ce qui concerne les relations de discours, il nous faut distinguer les deux cas, puisqu&#8217;il n&#8217;existe pas de relation &#171; inverse &#187; &#224;
chaque relation de discours. De plus, l&#8217;ordre des segments dans un discours a un impact sur sa structure et son interpr&#233;tation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VERS UNE ALG&#200;BRE DES RELATIONS DE DISCOURS
</p>
<p>le travail d&#8217;extraction de r&#232;gles candidates &#224; partir du corpus ANNODIS (P&#233;ry-Woodley et al., 2009)4. Dans la
section 3.2, nous pr&#233;sentons les &#233;l&#233;ments qui nous permettent de mettre en &#233;vidence les diff&#233;rentes d&#233;ductions
possibles pour une pr&#233;misse de r&#232;gle donn&#233;e. Dans la section 3.3, nous montrons comment les r&#232;gles sont valid&#233;es
par l&#8217;annotation de donn&#233;es empiriques, extraites &#224; partir de corpus non annot&#233;s en discours.
</p>
<p>3.1 Extraction de d&#233;ductions candidates pour la construction des r&#232;gles
</p>
<p>Pour construire une alg&#232;bre des relations de discours utilisant environ 20 relations, il y a potentiellement 8000
r&#232;gles du type Rx(&#945;, &#946;) &#8743; Ry(&#946;, &#947;) &#8594; Rz(&#945;, &#947;) &#224; &#233;tudier (il y a 20 &#215; 20 pr&#233;misses de r&#232;gles possibles, et pour
chaque pr&#233;misse 20 d&#233;ductions possibles), plus 8000 r&#232;gles du type Rx(&#945;, &#946;) &#8743; Rz(&#945;, &#947;) &#8594; Ry(&#946;, &#947;), donc en-
viron 16000 r&#232;gles en tout. Chaque r&#232;gle n&#233;cessitant une &#233;tude linguistique, il est imp&#233;ratif de faire une s&#233;lection
dans les r&#232;gles &#224; &#233;tudier en priorit&#233;, et de d&#233;gager les r&#232;gles candidates les plus pertinentes. Pour extraire des
d&#233;ductions candidates, nous exploitons le corpus ANNODIS, constitu&#233; de 100 textes annot&#233;s en discours, prove-
nant notamment de Wikip&#233;dia et du corpus de l&#8217;Est R&#233;publicain. Apr&#232;s avoir &#233;t&#233; segment&#233; en unit&#233;s minimales
de discours, chaque texte du corpus a re&#231;u deux annotations distinctes, avec la SDRT comme point de d&#233;part au
guide d&#8217;annotation. 19 relations de discours sont utilis&#233;es dans le corpus. Nous les pr&#233;sentons dans le tableau 1,
avec leur nombre d&#8217;occurrences dans les annotations.
</p>
<p>Relation Nombre d&#8217;occurrences Relation Nombre d&#8217;occurrences
Elaboration 1662 Parallel 154
Entity Elaboration 1169 Attribution 151
Continuation 658 Background 134
Narration 567 Flashback 106
Frame 416 Description Continuation 54
Contrast 334 Conditional 53
Result 303 Alternation 35
Explanation 259 Source 18
Goal 238 Explanation* 12
Commentary 222 Result* 0
</p>
<p>TAB. 1 &#8211; Relations utilis&#233;es dans le corpus ANNODIS
</p>
<p>Nous d&#233;gageons &#224; partir de ce corpus des r&#232;gles de d&#233;duction candidates : pour chaque pr&#233;misse de r&#232;gle de la
formeRx(&#945;, &#946;)&#8743;Ry(&#946;, &#947;) nous extrayons la ou les relation(s)Rz(&#945;, &#947;) les plus probables. Nous nous int&#233;ressons
donc aux annotations contenant des triplets de segments de discours (&#945;, &#946;, &#947;) pour lesquels les relations sont
satur&#233;es, c&#8217;est-&#224;-dire telles que : une relation (au moins) a &#233;t&#233; annot&#233;e entre (&#945;) et (&#946;), de m&#234;me entre (&#946;) et
(&#947;), ainsi qu&#8217;entre (&#945;) et (&#947;). Les triplets &#171; satur&#233;s &#187; du corpus permettent de calculer, pour toute relation Rz , la
probabilit&#233; que la relation Rz(&#945;, &#947;) soit &#233;tablie sachant que les relations Rx(&#945;, &#946;) et Ry(&#946;, &#947;) sont pr&#233;sentes :
</p>
<p>P (Rz(&#945;, &#947;) | Rx(&#945;, &#946;) &#8743;Ry(&#946;, &#947;)) = count(Rx(&#945;,&#946;),Ry(&#946;,&#947;),Rz(&#945;,&#947;))count(Rx(&#945;,&#946;),Ry(&#946;,&#947;),R(&#945;,&#947;))
5.
</p>
<p>Ces probabilit&#233;s nous donnent, pour une pr&#233;misse de r&#232;gle donn&#233;e, une id&#233;e de la plausibilit&#233; des d&#233;ductions :
plus la probabilit&#233; P (Rz(&#945;, &#947;) | Rx(&#945;, &#946;)&#8743;Ry(&#946;, &#947;)) est grande, plus la r&#232;gle Rx(&#945;, &#946;)&#8743;Ry(&#946;, &#947;)&#8594; Rz(&#945;, &#947;)
est plausible. Dans l&#8217;exploitation du corpus, nous r&#233;&#233;crivons les relations impliquant des segments complexes6
</p>
<p>avec les r&#232;gles de r&#233;&#233;criture suivantes : R1(&#945;, [&#946;, &#947;]) &#8743; R2(&#946;, &#947;) &#8594;rew R1(&#945;, &#946;) &#8743; R1(&#945;, &#947;) &#8743; R2(&#946;, &#947;) ; et
R1(&#945;, &#946;)&#8743;R2([&#945;, &#946;], &#947;)&#8594;rew R1(&#945;, &#946;)&#8743;R2(&#945;, &#947;)&#8743;R2(&#946;, &#947;). La r&#233;&#233;criture permet d&#8217;exploiter un plus grand
nombre de donn&#233;es du corpus. Par exemple, nous obtenons 0 occurrence du triplet (Result(&#945;, &#946;), Contrast(&#946;, &#947;),
Contrast(&#945;, &#947;)) sans la r&#233;&#233;criture, et 127 occurrences avec la r&#233;&#233;criture. La r&#233;&#233;criture des segments complexes
permet donc de d&#233;gager une r&#232;gle candidate comme Result(&#945;, &#946;) &#8743; Contrast(&#946;, &#947;) &#8594; Contrast(&#945;, &#946;)7 &#224; partir
</p>
<p>4 Les donn&#233;es du corpus ANNODIS ne sont pas encore disponibles, mais nous ont &#233;t&#233; gentiment fournies par les membres du projet.
5 R(&#945;, &#947;) signifie qu&#8217;il existe une relation entre (&#945;) et (&#947;).
6 Dans un discours, certains segments &#233;l&#233;mentaires sont &#224; la fois arguments d&#8217;une relation de discours, et &#224; la fois partie d&#8217;un segment de
</p>
<p>discours plus large (appel&#233; segment complexe) qui est lui-m&#234;me argument d&#8217;une relation de discours. Par exemple, la structure du discours en
(2) de la section 2 est Elaboration(pi1, [pi2, pi3]) &#8743; Narration(pi2, pi3), o&#249; (pi2) et (pi3) sont les deux arguments de la relation Narration, mais
sont aussi inclus dans un segment complexe plus large ([pi2, pi3]) qui &#233;labore (pi1).
</p>
<p>7 Voir la section 4 pour une &#233;tude d&#233;taill&#233;e de la pr&#233;misse Result(&#945;, &#946;) &#8743; Contrast(&#946;, &#947;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLOTTE ROZE
</p>
<p>des structures annot&#233;es Result(&#945;, &#946;) &#8743; Contrast([&#945;, &#946;], &#947;) dans le corpus. Notons que la s&#233;mantique de R1(&#945;, &#946;)
devient alors : &#171; la relation R1 est &#233;tablie entre (&#945;) (ou un segment contenant (&#945;)) et (&#946;) (ou un segment contenant
(&#946;)) &#187;.
</p>
<p>3.2 Mise en &#233;vidence des d&#233;ductions possibles
</p>
<p>Pour construire les r&#232;gles de d&#233;duction, nous effectuons une premi&#232;re &#233;tude de la pr&#233;misse de r&#232;gle consid&#233;r&#233;e,
qui nous permet de d&#233;gager la ou les d&#233;duction(s) possible(s), et dans certains cas de d&#233;gager des param&#232;tres
influant sur la d&#233;duction. Cette &#233;tude s&#8217;appuie sur diff&#233;rents &#233;l&#233;ments : les d&#233;ductions candidates extraites &#224; partir
du corpus ANNODIS, la s&#233;mantique des relations pr&#233;sentes dans la pr&#233;misse et dans les d&#233;ductions candidates,
et l&#8217;analyse d&#8217;exemples construits et attest&#233;s8.
</p>
<p>Les probabilit&#233;s calcul&#233;es sur le corpus ANNODIS nous permettent de d&#233;gager la/les d&#233;duction(s) plausible(s) :
plus la probabilit&#233; P (Rz(&#945;, &#947;) | Rx(&#945;, &#946;)&#8743;Ry(&#946;, &#947;)) est grande, plus la r&#232;gle Rx(&#945;, &#946;)&#8743;Ry(&#946;, &#947;)&#8594; Rz(&#945;, &#947;)
est plausible. Cependant, nous ne pouvons pas nous baser sur ces seules informations pour d&#233;gager des r&#232;gles de
d&#233;duction, en partie parce que ces calculs exploitent des discours o&#249; toute l&#8217;information est explicit&#233;e par l&#8217;annota-
teur, et que nous voulons mettre au jour l&#8217;information implicite &#233;tablie par la pr&#233;sence des relations des pr&#233;misses
de r&#232;gles. Pour cela, nous devons examiner, pour la pr&#233;misse de r&#232;gle consid&#233;r&#233;e, les cons&#233;quences de l&#8217;&#233;tablisse-
ment des relationsRx(&#945;, &#946;) etRy(&#946;, &#947;). En effet, lorsqu&#8217;une relation de discours est &#233;tablie, elle impose certaines
contraintes sur ses arguments et sur les liens qui existent entre eux. La nature de ces contraintes varie selon les
relations de discours. Certaines relations, comme Narration, &#233;tablissent des contraintes temporelles sur les &#233;ven-
tualit&#233;s qu&#8217;elles relient : si l&#8217;on a Narration(&#945;, &#946;), alors l&#8217;&#233;ventualit&#233; e&#945; d&#233;crite dans le premier segment (&#945;) a
lieu avant l&#8217;&#233;ventualit&#233; e&#946; d&#233;crite dans le second segment. D&#8217;autres relations, comme Explanation, &#233;tablissent
des relations causales : si l&#8217;on a Explanation(&#945;, &#946;), alors l&#8217;&#233;ventualit&#233; e&#946; d&#233;crite dans le second segment est la
cause de l&#8217;&#233;ventualit&#233; e&#945; d&#233;crite dans le premier segment. Par exemple, dans le discours : Jean est tomb&#233;. Max l&#8217;a
pouss&#233;., l&#8217;&#233;ventualit&#233; d&#233;crite dans la seconde phrase est la cause de l&#8217;&#233;ventualit&#233; dans la seconde phrase.
</p>
<p>Observer les contraintes &#233;tablies par les relations Rx et Ry permet de mieux caract&#233;riser le lien existant entre
les segments (&#945;) et (&#947;), en exploitant la d&#233;finition th&#233;orique des relations de discours en jeu. Les contraintes
&#233;tablies par les relations contenues dans la pr&#233;misse de la r&#232;gle nous permettent ainsi dans certains cas de pr&#233;dire
la d&#233;duction (voir section 4.2.3), d&#8217;un point de vue th&#233;orique au moins. De plus, les contraintes &#233;tablies par les
relations contenues dans la pr&#233;misse nous permettent d&#8217;exclure certaines relations des d&#233;ductions possibles, car
les cons&#233;quences de Rx(&#945;, &#946;) et Ry(&#946;, &#947;) sont incompatibles avec l&#8217;&#233;tablissement de Rz(&#945;, &#947;). Par exemple,
lorsque les relations Narration(&#945;, &#946;) et Narration(&#946;, &#947;) sont &#233;tablies, la relation Flashback ne peut lier (&#945;) et (&#946;).
Cette incompatibilit&#233; est illustr&#233;e dans le discours en (3), o&#249; l&#8217;on a Narration(pi1, pi2) et Narration(pi2, pi3), avec
pour cons&#233;quences temporelles : l&#8217;&#233;v&#233;nement d&#233;crit en (pi1) a lieu avant l&#8217;&#233;v&#233;nement d&#233;crit en (pi2) (epi1 &lt; epi2 ) ;
l&#8217;&#233;v&#233;nement d&#233;crit en (pi2) a lieu avant l&#8217;&#233;v&#233;nement d&#233;crit en (pi3) (epi2 &lt; epi3 ) ; donc l&#8217;&#233;v&#233;nement d&#233;crit en (pi1)
a lieu avant l&#8217;&#233;v&#233;nement d&#233;crit en (pi3) (epi1 &lt; epi3 ), ce qui est incompatible avec l&#8217;&#233;tablissement de la relation
Flashback(pi1, pi3), car sa cons&#233;quence temporelle est : epi3 &lt; epi1 .
</p>
<p>3. (a) Aujourd&#8217;hui, Julie est all&#233;e voir une expo. (pi1)
</p>
<p>(b) Ensuite, elle a d&#233;jeun&#233; avec des amis. (pi2)
</p>
<p>(c) Puis elle a fait des courses au march&#233;. (pi3)
</p>
<p>L&#8217;&#233;tude des r&#232;gles de d&#233;duction n&#233;cessite &#233;galement un travail d&#8217;introspection, consistant &#224; construire des discours
comportant la pr&#233;misse de r&#232;gle &#233;tudi&#233;e. Ce travail permet de v&#233;rifier les hypoth&#232;ses formul&#233;es &#224; partir des calculs
effectu&#233;s sur le corpus et des contraintes &#233;tablies par les relations de discours. Dans la construction des discours, on
essaie de couvrir le plus grand nombre de cas de figure. Pour cela, selon les relations pr&#233;sentes dans la pr&#233;misse,
nous faisons varier certains param&#232;tres. Par exemple, lors de la construction de discours impliquant la relation
Contrast, on peut &#233;tablir des contrastes o&#249; : une m&#234;me entit&#233; pr&#233;sente deux propri&#233;t&#233;s distinctes, deux entit&#233;s
distinctes pr&#233;sentent chacune une propri&#233;t&#233;, une n&#233;gation est pr&#233;sente dans une des propositions, etc. ; pour les
discours contenant la relation Explanation(&#945;, &#946;), l&#8217;&#233;ventualit&#233; d&#233;crite dans le segment (&#945;) peut &#234;tre un &#233;v&#233;nement,
un &#233;tat, une cause future, etc. Pour analyser les donn&#233;es construites ou attest&#233;es, et v&#233;rifier la d&#233;duction d&#8217;une
relation entre (&#945;) et (&#947;), on utilise les tests d&#8217;insertion d&#8217;un connecteur et de r&#233;organisation du discours, d&#233;crits
dans les deux paragraphes suivants.
</p>
<p>8 Ces exemples attest&#233;s proviennent du corpus ANNODIS et des corpus de discours extraits gr&#226;ce &#224; l&#8217;outil pr&#233;sent&#233; &#224; la section 3.3.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VERS UNE ALG&#200;BRE DES RELATIONS DE DISCOURS
</p>
<p>Insertion d&#8217;un connecteur L&#8217;insertion d&#8217;un connecteur permet de tester la pr&#233;sence d&#8217;une relation de discours
entre (&#945;) et (&#947;) dans l&#8217;&#233;tude de r&#232;gles de la forme : Rx(&#945;, &#946;) &#8743; Ry(&#946;, &#947;) &#8594; Rz(&#945;, &#947;). Si l&#8217;on veut v&#233;rifier la
pr&#233;sence d&#8217;une relation Rz donn&#233;e entre les segments (&#945;) et (&#947;) d&#8217;un discours, on peut utiliser le test suivant :
si, apr&#232;s avoir ins&#233;r&#233; dans le segment (&#947;) un connecteur adverbial lexicalisant Rz , le discours reste coh&#233;rent et
que son interpr&#233;tation est inchang&#233;e, alors la pr&#233;sence de la relation Rz(&#945;, &#947;) est v&#233;rifi&#233;e. Observons les discours
en (4), dans lesquels les relations Result(pi1, pi2) et Explanation(pi2, pi3) sont &#233;tablies. On constate &#224; l&#8217;aide du test
d&#8217;insertion que : pour (4c-i), le connecteur de r&#233;sultat du coup peut &#234;tre ins&#233;r&#233; sans rendre le discours incoh&#233;rent,
et sans en modifier l&#8217;interpr&#233;tation, donc la relation Result(pi1, pi3) peut &#234;tre inf&#233;r&#233;e ; pour le discours en (4c-ii),
en revanche, l&#8217;insertion d&#8217;un connecteur de r&#233;sultat rend le discours incoh&#233;rent, donc la relation Result(pi1, pi3) ne
peut pas &#234;tre &#233;tablie.
</p>
<p>4. (a) L&#8217;&#233;lectricit&#233; est revenue ce matin. (pi1)
(b) Les habitants sont tr&#232;s contents, (pi2)
(c) i. car du coup ils ont pu regagner leurs appartements. (pi3)
</p>
<p>ii. car (# ainsi / # du coup) ils ont besoin de chauffage. (pi3)
R&#233;organisation du discours Une autre m&#233;thode pour mettre au jour la relation &#233;tablie entre les segments (&#945;) et
(&#947;) est de r&#233;organiser le discours en &#233;changeant la position des segments (&#946;) et (&#947;). Le connecteur qui lexicalise
la relation Ry(&#946;, &#947;) est remplac&#233; par un connecteur lexicalisant la relation &#171; inverse &#187; Ry&#8722;1(&#947;, &#946;) si elle existe :
par exemple, si l&#8217;on a la relation Result(&#946;, &#947;), on utilise un marqueur de la relation Explanation(&#947;, &#946;). Dans le
discours ainsi form&#233;, si un connecteur lexicalisant Rz peut &#234;tre ins&#233;r&#233; entre les segments (&#945;) et (&#947;) sans rendre
le discours incoh&#233;rent et en conservant l&#8217;interpr&#233;tation d&#8217;origine, alors on peut d&#233;duire que la relation Rz(&#945;, &#947;)
s&#8217;&#233;tablit dans le discours d&#8217;origine. Par exemple, en (5b-i), la r&#233;organisation du discours en (4c-i) nous permet de
mettre en &#233;vidence la pr&#233;sence de la relation Result(pi1, pi3), car le connecteur de r&#233;sultat du coup peut &#234;tre ins&#233;r&#233;.
En revanche, la r&#233;organisation du discours (4c-ii) nous permet d&#8217;exclure la pr&#233;sence de la relation Result entre les
segments (pi1) et (pi3), car le discours en (5b-ii) est incoh&#233;rent.
</p>
<p>5. (a) L&#8217;&#233;lectricit&#233; est revenue ce matin. (pi1)
(b) i. Du coup, les habitants ont pu regagner leurs appartements. (pi3)
</p>
<p>ii. # Du coup, ils ont besoin de chauffage. (pi3)
(c) Donc ils sont tr&#232;s contents. (pi2)
</p>
<p>3.3 Annotation pour la validation des r&#232;gles construites
</p>
<p>Apr&#232;s avoir mis en &#233;vidence les d&#233;ductions possibles pour une pr&#233;misse donn&#233;e, on r&#233;alise une &#233;tude syst&#233;matique
sur un corpus de plusieurs centaines de discours contenant la pr&#233;misse &#233;tudi&#233;e : pour chaque discours du corpus
collect&#233;, on annote la relation d&#233;duite9. Cette annotation permet d&#8217;une part de v&#233;rifier la validit&#233; des hypoth&#232;ses
formul&#233;es quant aux d&#233;ductions possibles, et aux param&#232;tres ayant un impact sur la d&#233;duction ; d&#8217;autre part, elle
permet, dans le cas o&#249; plusieurs d&#233;ductions sont possibles pour une pr&#233;misse donn&#233;e, de conna&#238;tre la fr&#233;quence de
chacune des d&#233;ductions.
</p>
<p>Pour mener une telle &#233;tude, le corpus ANNODIS ne contient g&#233;n&#233;ralement pas suffisamment de triplets de seg-
ments (&#945;, &#946;, &#947;) au sein desquels les pr&#233;misses &#233;tudi&#233;es (et seulement les pr&#233;misses) sont &#233;tablies. Pour constituer
un corpus d&#8217;exemples suffisamment grand, nous avons donc d&#233;velopp&#233; un outil permettant d&#8217;extraire des discours
contenant les pr&#233;misses de r&#232;gles &#224; partir de donn&#233;es non-annot&#233;es en discours. L&#8217;identification de la pr&#233;sence
des relations de discours en jeu dans la pr&#233;misse de r&#232;gle consid&#233;r&#233;e est effectu&#233;e gr&#226;ce &#224; la pr&#233;sence de marques
de surface : les connecteurs de discours. L&#8217;extraction est effectu&#233;e sur le corpus de l&#8217;Est R&#233;publicain, annot&#233; en
d&#233;pendances syntaxiques par l&#8217;analyseur BONSAI (Candito et al., 2009), et exploite un lexique des connecteurs
discursifs du fran&#231;ais, LEXCONN (Roze et al., 2010), qui contient 330 connecteurs auxquels sont associ&#233;es une
cat&#233;gorie syntaxique et la relation de discours qu&#8217;il &#233;tablissent. Afin de mieux exploiter le lexique, nous avons
compl&#233;t&#233; dans celui-ci un certain nombre de contraintes concernant les positions pouvant &#234;tre occup&#233;es par les
diff&#233;rents connecteurs lorsqu&#8217;ils lexicalisent une relation donn&#233;e. En effet, certains connecteurs n&#8217;&#233;tablissent une
relation de discours que lorsqu&#8217;ils occupent certaines positions, ou bien peuvent &#233;tablir des relations diff&#233;rentes
selon la position occup&#233;e. Pour les adverbes, c&#8217;est la position dans la proposition qui peut avoir une importance ;
pour les conjonctions de subordination, c&#8217;est la position de la proposition subordonn&#233;e par rapport &#224; la principale.
</p>
<p>9 Dans la phase d&#8217;annotation, nous utilisons les tests d&#8217;insertion d&#8217;un connecteur et de r&#233;organisation du discours.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLOTTE ROZE
</p>
<p>Pour extraire des occurrences d&#8217;une pr&#233;misse de r&#232;gle Rx(&#945;, &#946;) &#8743; Ry(&#946;, &#947;), on recherche dans le corpus des
contextes dans lesquels on a : p1 [connx]p2 [conny]p3, o&#249; connx est un connecteur accueilli par la proposition p2
et lexicalise la relation Rx, et conny est un connecteur accueilli par la proposition p3 et lexicalise la relation Ry .
Soit conny se trouve dans la m&#234;me phrase que connx, soit dans la phrase suivante. Par exemple, pour la pr&#233;misse
de r&#232;gle Explanation(&#945;, &#946;) &#8743; Result(&#946;, &#947;), on extrait des discours comme en (6), o&#249; la conjonction car marque
la pr&#233;sence de la relation Explanation, et l&#8217;adverbe alors marque la pr&#233;sence de la relation Result. De la m&#234;me
fa&#231;on, pour la pr&#233;misse de r&#232;gle Result(&#945;, &#946;) &#8743; Contrast(&#946;, &#947;), on extrait des discours comme en (7).
</p>
<p>6. Malgr&#233; l&#8217;annonce de la fin possible des combats, ils n&#8217;ont plus du tout confiance car, lors des ann&#233;es pass&#233;es,
ils ont vu la guerre et la paix se succ&#233;der. Alors, ils se disent que, cette fois encore, la guerre pourrait revenir...
</p>
<p>7. Mme Mulot, assistante sociale DVIS, est en absence de longue dur&#233;e. Ses permanences sont donc annul&#233;es.
La prise en charge des urgences reste n&#233;anmoins assur&#233;e : joindre la circonscription DVIS centre-Vosges...
</p>
<p>4 Construction d&#8217;une r&#232;gle de d&#233;duction
</p>
<p>Dans cette section, nous d&#233;roulons pour la pr&#233;misse de r&#232;gle Result(&#945;, &#946;) &#8743; Contrast(&#946;, &#947;) la m&#233;thodologie pr&#233;-
sent&#233;e &#224; la section 3. Il nous a paru int&#233;ressant d&#8217;&#233;tudier cette pr&#233;misse de r&#232;gle, et d&#8217;observer les cons&#233;quences de
l&#8217;&#233;tablissement des deux relations relations en jeu, car elles appartiennent &#224; deux groupes de relations distincts : les
relations causales (pour Result) et les relations adversatives (pour Contrast), selon la classification de (Halliday &amp;
Hasan, 1976). La premi&#232;re relie deux &#233;ventualit&#233;s dont l&#8217;une est la cause de l&#8217;autre, et c&#8217;est une relation de coh&#233;-
rence, c&#8217;est-&#224;-dire une relation li&#233;e au contenu s&#233;mantique des propositions reli&#233;es. La seconde, en revanche, relie
des &#233;ventualit&#233;s pr&#233;sent&#233;es par le locuteur comme &#233;tant en opposition ou en contradiction. Elle est g&#233;n&#233;ralement
consid&#233;r&#233;e comme une relation intentionnelle, li&#233;e aux buts communicatifs.
</p>
<p>4.1 Extraction de d&#233;ductions candidates
</p>
<p>L&#8217;exploitation du corpus ANNODIS permet d&#8217;obtenir les probabilit&#233;s pr&#233;sent&#233;es dans le tableau 2. Les calculs
sont effectu&#233;s &#224; partir des 150 contextes du corpus o&#249; l&#8217;on a : Result(&#945;, &#946;), Contrast(&#946;, &#947;) et une relationRz(&#945;, &#947;),
apr&#232;s r&#233;&#233;criture des relations entre segments complexes. Le calcul des probabilit&#233;s nous permet de d&#233;gager la r&#232;gle
candidate : Result(&#945;, &#946;)&#8743;Contrast(&#946;, &#947;)&#8594; Contrast(&#945;, &#947;)&#8744;Result(&#945;, &#947;). En effet, on ne retient pas la d&#233;duction
de Goal dans la r&#232;gle candidate, car la probabilit&#233; observ&#233;e pour cette r&#232;gle provient d&#8217;une seule annotation du
corpus, au sein de laquelle les relations annot&#233;es ne sont pas coh&#233;rentes. On constate que la d&#233;duction candidate
la plus probable est Contrast.
</p>
<p>Relation Rz(&#945;, &#947;) p(Rz(&#945;, &#947;) | Result(&#945;, &#946;),Contrast(&#946;, &#947;))
Rz = Contrast 0.847
Rz = Result 0.127
Rz = Goal 0.027
Rz 6&#8712; {Result,Contrast,Goal} 0.0
</p>
<p>TAB. 2 &#8211; Probabilit&#233;s p(Rz(&#945;, &#947;) | Result(&#945;, &#946;),Contrast(&#946;, &#947;)) pour toute relation Rz
</p>
<p>4.2 Mise en &#233;vidence des d&#233;ductions possibles
</p>
<p>Nous cherchons ici &#224; mettre en &#233;vidence les d&#233;ductions possibles pour la pr&#233;misse de r&#232;gle Result(&#945;, &#946;) &#8743;
Contrast(&#946;, &#947;). Dans la section 4.2.1, nous fournissons une d&#233;finition de ces deux relations, et distinguons deux
sous-cas pour la relation Contrast : un premier o&#249; elle est de type opposition s&#233;mantique, et un second o&#249; elle de
type concession ou violation d&#8217;attente. Cette distinction nous am&#232;ne &#224; pr&#233;senter l&#8217;&#233;tude des d&#233;ductions possibles
dans deux sections s&#233;par&#233;es : 4.2.2 pour le premier sous-cas, et 4.2.3 pour le second.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VERS UNE ALG&#200;BRE DES RELATIONS DE DISCOURS
</p>
<p>4.2.1 D&#233;finition des relations Result et Contrast
</p>
<p>Au sein de la SDRT, la relation Result peut &#234;tre &#233;tablie par : des marques linguistiques, comme certains connec-
teurs de discours (donc, du coup, alors, etc.) et des verbes causatifs (provoquer, entra&#238;ner, etc.) ; des connaissances
(extra-)linguistiques, comme pousser(x, y) &gt; tomber(y)10 (qui permet par exemple l&#8217;interpr&#233;tation de : L&#233;a a
pouss&#233; Max. Il est tomb&#233;.). Elle a pour cons&#233;quence s&#233;mantique l&#8217;&#233;tablissement d&#8217;une relation causale entre les
deux &#233;ventualit&#233;s reli&#233;es, &#224; savoir que l&#8217;&#233;ventualit&#233; d&#233;crite dans le premier argument de la relation est la cause
de l&#8217;&#233;ventualit&#233; d&#233;crite dans le second argument : cause(e&#945;, e&#946;) (pour Result(&#945;, &#946;)). Cette relation causale re-
couvre l&#8217;implication non monotone K&#945; &gt; K&#946; (K&#945; d&#233;signe le contenu s&#233;mantique du segment &#945;). Result poss&#232;de
&#233;galement des effets temporels : l&#8217;&#233;ventualit&#233; du premier argument a lieu avant l&#8217;&#233;ventualit&#233; du second argument.
</p>
<p>La relation Contrast relie des segments qui pr&#233;sentent une dissimilarit&#233; s&#233;mantique. Cette relation recouvre dans
la SDRT trois relations qui sont parfois distingu&#233;es dans la litt&#233;rature (Busquets, 2007) : opposition s&#233;mantique ou
contraste formel, concession, et violation d&#8217;attente. L&#8217;opposition s&#233;mantique (OS) est d&#233;finie par Spooren (1989)
comme une relation entre deux propositions qui ont deux sujets distincts, auxquels sont attribu&#233;s des propri&#233;t&#233;s
qui s&#8217;excluent mutuellement dans le contexte. Selon Oversteegen (1997), l&#8217;opposition s&#233;mantique ne n&#233;cessite pas
la pr&#233;sence de deux entit&#233;s distinctes : il peut aussi n&#8217;y avoir qu&#8217;une seule entit&#233;, &#224; laquelle diff&#233;rentes propri&#233;t&#233;s
sont assign&#233;es, &#224; des localisations temporelles ou spatiales distinctes, o&#249; dans diff&#233;rents mondes possibles. Dans
la SDRT, cette relation implique une similarit&#233; structurelle entre les segments reli&#233;s. Busquets (2007) r&#233;sume
la relation d&#8217;opposition s&#233;mantique comme un contraste ou une dissimilarit&#233; entre les &#233;l&#233;ments compar&#233;s (des
&#233;tats, des &#233;v&#233;nements ou des individus) sans contradiction entre eux. En revanche, les &#233;l&#233;ments impliqu&#233;s dans
une relation de concession ou de violation d&#8217;attente sont en contradiction. Ils s&#8217;inscrivent dans le sch&#233;ma suivant :
(A &gt; C)&#8743;(B &gt; &#172;C). En ce qui concerne la concession (CS), les propositionsA etB sont explicites (Gr&#246;te et al.,
1995). Par exemple, dans le discours en (8), on inf&#232;re de (8a) la proposition nous avons mang&#233; (= C), et de (8b)
la proposition nous n&#8217;avons pas mang&#233; (= &#172;C). En ce qui concerne la violation d&#8217;attente (VA), la proposition &#172;C
est pr&#233;sente. Par exemple, en (9) on inf&#232;re Pierre n&#8217;aime pas le foot (= C) de la proposition en (9a) et l&#8217;on a &#172;C
en (9b). On note que les deux &#233;l&#233;ments en relation de VA peuvent appara&#238;tre dans l&#8217;ordre inverse.
</p>
<p>8. (a) Nous avions faim, &gt; Nous avons mang&#233;.
</p>
<p>(b) mais les restaurants &#233;taient ferm&#233;s. &gt; Nous n&#8217;avons pas mang&#233;.
</p>
<p>9. (a) Pierre n&#8217;aime pas le sport, &gt; Pierre n&#8217;aime pas le foot.
</p>
<p>(b) mais il aime le foot.
</p>
<p>Il nous faut noter que deux segments de discours peuvent &#224; la fois entretenir une relation de Result et une relation
de Contrast. Par exemple, dans le discours en (10), on inf&#232;re que l&#8217;accident de Marie est la cause de ses fractures,
ce qui correspond &#224; l&#8217;&#233;tablissement de la relation Result. On inf&#232;re &#233;galement que l&#8217;accident aurait normalement
d&#251; causer des blessures plus graves que des fractures, mais qu&#8217;il n&#8217;en a pas caus&#233;. Dans ce discours, l&#8217;&#233;tablissement
de la relation Result a pour cons&#233;quence s&#233;mantique Kpi1 &gt; Kpi2 , et l&#8217;&#233;tablissement de la relation Contrast (de
type CS) a pour cons&#233;quence s&#233;mantique (Kpi1 &gt; P )&#8743; (Kpi2 &gt; &#172;P ) (o&#249; P = Marie a des blessures graves). Cet
exemple nous montre qu&#8217;il peut exister des cas dans lesquels on d&#233;duira &#224; la fois la relation Result et la relation
Contrast.
</p>
<p>10. (a) Marie a eu un accident de voiture, (pi1)
</p>
<p>(b) mais elle n&#8217;a que quelques fractures. (pi2)
</p>
<p>4.2.2 D&#233;duction dans le cas o&#249; Contrast est de type opposition s&#233;mantique
</p>
<p>Dans le cas o&#249; la relation Contrast(&#946;, &#947;) est de type OS il semble que trois d&#233;ductions soient possibles : soit on
d&#233;duit Result(&#945;, &#947;) comme dans le discours en (11), o&#249; l&#8217;on inf&#232;re que Julie est aux anges parce que la France
a perdu le match, et o&#249; l&#8217;&#233;ventualit&#233; en (&#945;) a des effets oppos&#233;s sur deux entit&#233;s distinctes (Marie et Julie) ; soit
on d&#233;duit Contrast(&#945;, &#947;) comme dans le discours en (12a), o&#249; l&#8217;on inf&#232;re que malgr&#233; l&#8217;accident, Julie n&#8217;est pas
bless&#233;e ; soit on d&#233;duit Result(&#945;, &#947;) &#8743; Contrast(&#945;, &#947;) comme dans le discours en (12b), o&#249;, par le contenu de (&#945;)
et le contenu de (&#946;), on inf&#232;re que Julie aurait normalement d&#251; &#234;tre plus gravement bless&#233;e, ce qui est contredit
par le segment (&#947;), qui d&#233;crit parall&#232;lement un &#233;tat caus&#233; par l&#8217;accident d&#233;crit en (&#945;).
</p>
<p>10 L&#8217;op&#233;rateur conditionnel non monotone permet d&#8217;exprimer des r&#232;gles d&#233;faisables (ou r&#233;visables) (Asher &amp; Lascarides, 2003). Par
exemple, A &gt; B signifie : &#171; si A est vrai, alors normalement, B est vrai &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLOTTE ROZE
</p>
<p>11. (&#945;) La France a perdu le match.
</p>
<p>(&#946;) Du coup, Marie est tr&#232;s d&#233;&#231;ue.
</p>
<p>(&#947;) Par contre, Julie est aux anges.
</p>
<p>12. (&#945;) Marie et Julie ont eu un accident de voiture.
</p>
<p>(&#946;) Marie a une jambe cass&#233;e.
</p>
<p>(&#947;) a. En revanche, Julie est indemne.
</p>
<p>b. En revanche, Julie n&#8217;a que quelques &#233;gratignures.
</p>
<p>Notons que lorsque la d&#233;duction de Contrast a lieu, le type de contraste &#233;tabli entre (&#945;) et (&#947;) n&#8217;est pas le m&#234;me
que celui &#233;tabli entre (&#946;) et (&#947;). Par exemple, dans le discours en (13), le contraste entre (&#946;) et (&#947;) est de type
OS car deux entit&#233;s distinctes (Julie et L&#233;a) pr&#233;sentent des propri&#233;t&#233;s oppos&#233;es. En revanche, entre les segments
(&#945;) et (&#947;), c&#8217;est un contraste de type VA qui s&#8217;&#233;tablit. En effet, on a : K&#945; &gt; &#172;K&#947; (si Marie se fait agresser,
alors normalement L&#233;a devrait intervenir). D&#8217;ailleurs, si l&#8217;on r&#233;organise le discours en (13) en intervertissant les
positions de (&#946;) et (&#947;), on lexicalise la relation entre (&#945;) et (&#947;) par le connecteur mais, qui &#233;tablit la relation
Contrast (Marie s&#8217;est fait agresser. Mais L&#233;a n&#8217;a pas boug&#233;. Par contre, Julie a tent&#233; de la d&#233;fendre.).
</p>
<p>13. (&#945;) Marie s&#8217;est fait agresser.
</p>
<p>(&#946;) Du coup, Julie a tent&#233; de la d&#233;fendre.
</p>
<p>(&#947;) Par contre, L&#233;a n&#8217;a pas boug&#233;.
</p>
<p>4.2.3 D&#233;duction dans le cas o&#249; Contrast est de type concession ou violation d&#8217;attente
</p>
<p>Dans le cas o&#249; la relation Contrast(&#946;, &#947;) est de type CS ou VA, il semble que l&#8217;on puisse d&#233;duire la relation
Contrast(&#945;, &#947;) directement &#224; partir des cons&#233;quences s&#233;mantiques de l&#8217;&#233;tablissement des relations de la pr&#233;misse.
Notons que la pr&#233;sence de la relation Result(&#945;, &#946;) a toujours pour cons&#233;quence K&#945; &gt; K&#946; . Si le contraste est de
type CS, comme dans le discours en (14), alors on a de plus : (K&#946; &gt; P ) et (K&#947; &gt; &#172;P ). On a doncK&#945; &gt; K&#946; &gt; P ,
et l&#8217;on peut d&#233;duire : K&#945; &gt; P . Comme K&#947; &gt; &#172;P , on retrouve les cons&#233;quences s&#233;mantiques de l&#8217;&#233;tablissement
d&#8217;une relation de CS entre (&#945;) et (&#947;).
</p>
<p>14. (&#945;) Nous n&#8217;avions pas mang&#233; de la journ&#233;e.
</p>
<p>(&#946;) Donc nous avions tr&#232;s faim. &gt; P (Nous avons mang&#233;.)
</p>
<p>(&#947;) Mais les restaurants &#233;taient ferm&#233;s. &gt; &#172;P (Nous n&#8217;avons pas mang&#233;.)
Si le contraste est de type VA, on a deux cas possibles, repr&#233;sent&#233;s par les discours en (15) et (16). Dans le premier
cas, on a (K&#946; &gt; P ) et (K&#947; = &#172;P ). On a donc K&#945; &gt; K&#946; &gt; P , et l&#8217;on peut d&#233;duire : K&#945; &gt; P . Comme
K&#947; = &#172;P , on retrouve les cons&#233;quences de l&#8217;&#233;tablissement d&#8217;une relation de VA entre (&#945;) et (&#947;). Dans le second
cas, illustr&#233; en (16), on a (K&#946; = P ) et (K&#947; &gt; &#172;P ). On a K&#945; &gt; K&#946; = P , et l&#8217;on peut d&#233;duire K&#945; &gt; P . On a
donc : (K&#945; &gt; P ) et (K&#947; &gt; &#172;P ), ce qui correspond &#224; l&#8217;&#233;tablissement d&#8217;une relation de CS entre (&#945;) et (&#947;).
</p>
<p>15. (&#945;) Pierre n&#8217;aime pas courir.
</p>
<p>(&#946;) Du coup il n&#8217;aime pas le sport. &gt; P (Pierre n&#8217;aime pas le foot.)
</p>
<p>(&#947;) Mais il aime le foot. (&#172;P )
16. (&#945;) Tous les copains de Pierre jouent au foot.
</p>
<p>(&#946;) Du coup, il s&#8217;est inscrit avec eux. (P )
</p>
<p>(&#947;) Pourtant il n&#8217;aime pas le sport. &gt; &#172;P (Pierre ne s&#8217;est pas inscrit au foot.)
</p>
<p>4.3 R&#233;sultats de l&#8217;annotation
</p>
<p>Nous pr&#233;sentons dans cette section les r&#233;sultats de l&#8217;annotation effectu&#233;e sur les discours extraits automatiquement
en utilisant les connecteurs de discours comme marques des relations recherch&#233;es. Parmi les 360 discours analys&#233;s,
189 (soit 52.5%) ne contiennent pas la pr&#233;misse11 ou sont difficilement analysables, par manque de contexte (extra-
)linguistique. En revanche, 171 discours contiennent bien la pr&#233;misse &#224; &#233;tudier (soit 47.5%). Nous pr&#233;sentons dans</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VERS UNE ALG&#200;BRE DES RELATIONS DE DISCOURS
</p>
<p>Relation(s) d&#233;duite(s) Pourcentage Nombre
Contrast 73.7 126
Result 12.3 21
Unknown 5.8 10
None 5.3 9
Contrast et Result 2.9 5
Total 100 171
</p>
<p>TAB. 3 &#8211; Pourcentages des relations d&#233;duites entre (&#945;) et (&#947;) pour les discours extraits contenant la pr&#233;misse
Result(&#945;, &#946;) &#8743; Contrast(&#946;, &#947;)
</p>
<p>le tableau 3 les r&#233;sultats obtenus pour ces discours. On regroupe les cas o&#249; la relation d&#233;duite est ambigu&#235; sous
Unknown, et les cas o&#249; aucune relation n&#8217;est d&#233;duite &#224; partir de la pr&#233;misse sous None.
</p>
<p>Ces r&#233;sultats nous montrent que dans une majorit&#233; de cas, la relation Contrast est d&#233;duite (76.6%). Nous propo-
sons donc d&#8217;&#233;tablir une r&#232;gle d&#233;faisable : Result(&#945;, &#946;)&#8743;Contrast(&#946;, &#947;) &gt; Contrast(&#945;, &#947;). De fa&#231;on plus g&#233;n&#233;rale,
l&#8217;&#233;tude de la pr&#233;misse permet de formuler une r&#232;gle dure : Result(&#945;, &#946;) &#8743; Contrast(&#946;, &#947;) &#8594; Contrast(&#945;, &#947;) &#8744;
Result(&#945;, &#947;)&#8744;None(&#945;, &#947;). Pour que les r&#232;gles puissent s&#8217;inscrire dans une alg&#232;bre des relations de discours, il nous
faut d&#233;finir une relation artificielle None, exprimant le fait qu&#8217;il n&#8217;existe aucune relation de discours entre deux seg-
ments, qui est exclusive de toutes les autres relations de la d&#233;duction. Concernant les cas o&#249; l&#8217;on d&#233;duit None(&#945;, &#947;)
pour la pr&#233;misse &#233;tudi&#233;e, nous avons observ&#233; que d&#8217;autres relations que celles contenues dans la pr&#233;misse sont
g&#233;n&#233;ralement pr&#233;sentes. Par exemple, pour le discours en (17), deux relations temporelles (de recouvrement tem-
porel plus pr&#233;cis&#233;ment) viennent s&#8217;ajouter aux relations de la pr&#233;misse &#233;tudi&#233;e : on a Backgroundforward(pi1, pi2)
et Backgroundforward(pi2, pi3). Nous formulons l&#8217;hypoth&#232;se que la pr&#233;sence d&#8217;autres relations que celles conte-
nues dans la pr&#233;misse peuvent &#171; bloquer &#187; la d&#233;duction. Les interactions entre les diff&#233;rentes r&#232;gles de d&#233;duction
restent donc &#224; &#233;tudier, ainsi que les relations incompatibles.
</p>
<p>17. (a) Le g&#233;n&#233;raliste &#233;tait bien connu dans sa petite localit&#233; pour ses probl&#232;mes d&#8217;alcool. (pi1)
(b) Entre avril et ao&#251;t 2001 , on lui interdisait donc de continuer &#224; exercer. (pi2)
(c) Or la CPAM a continu&#233; &#224; recevoir des feuilles de remboursement de patients. (pi3)
</p>
<p>Pour raffiner la r&#232;gle g&#233;n&#233;rale formul&#233;e, on peut distinguer des sous-cas nous permettant de mieux pr&#233;dire la
d&#233;duction, en nous basant sur le type de contraste &#233;tabli, comme nous l&#8217;avons montr&#233; dans la section 4.2 :
Result(&#945;, &#946;) &#8743; (ContrastCS(&#946;, &#947;) &#8744; ContrastVA(&#946;, &#947;))&#8594; Contrast(&#945;, &#947;).
</p>
<p>5 Conclusion et perspectives
</p>
<p>Nous avons propos&#233; une m&#233;thodologie pour la construction de r&#232;gles de d&#233;duction de relations de discours, des-
tin&#233;es &#224; &#234;tre int&#233;gr&#233;es dans une alg&#232;bre (compl&#232;te) de ces relations. La construction d&#8217;une telle alg&#232;bre a comme
principal objectif de permettre une meilleure comparaison des structures dans le cadre de l&#8217;&#233;valuation de syst&#232;mes
d&#8217;analyse automatique du discours et dans le cadre de la construction de corpus de r&#233;f&#233;rence. Elle peut &#233;galement
aider &#224; la d&#233;tection d&#8217;incoh&#233;rences dans des structures discursives, ce qui peut servir &#224; am&#233;liorer l&#8217;annotation
discursive manuelle ou automatique. Nous avons pr&#233;sent&#233; l&#8217;&#233;tude compl&#232;te d&#8217;une pr&#233;misse de r&#232;gle, qui a servi &#224;
l&#8217;&#233;laboration de la m&#233;thodologie propos&#233;e. Cette &#233;tude nous am&#232;ne &#224; formuler : des r&#232;gles dures, &#233;tablies gr&#226;ce &#224;
des &#233;l&#233;ments th&#233;oriques sur les relations de discours, des donn&#233;es construites et des donn&#233;es attest&#233;es ; des r&#232;gles
molles, &#233;tablies gr&#226;ce &#224; des probabilit&#233;s de d&#233;duction calcul&#233;es &#224; partir de l&#8217;annotation manuelle de donn&#233;es ex-
traites automatiquement. Pour extraire ces donn&#233;es, nous avons d&#233;velopp&#233; un outil qui exploite les connecteurs de
discours pour d&#233;tecter la pr&#233;sence des relations de discours recherch&#233;es.
</p>
<p>La construction des r&#232;gles de d&#233;duction est en cours, et nous avons pour objectif de d&#233;gager des traits linguistiques
permettant de pr&#233;dire la relation d&#233;duite lorsqu&#8217;une r&#232;gle donne lieu &#224; la d&#233;duction d&#8217;une disjonction de relations,
en nous basant sur l&#8217;&#233;tude linguistique des r&#232;gles et sur l&#8217;exploitation des donn&#233;es annot&#233;es par des m&#233;thodes sta-
tistiques. Au fur et &#224; mesure de l&#8217;&#233;tude des r&#232;gles, nous allons chercher &#224; &#233;tablir des g&#233;n&#233;ralisations sur les r&#232;gles,
</p>
<p>11 Certains de ces exemples impliquent les relations Result et Contrast sans contenir pr&#233;cis&#233;ment la s&#233;quence recherch&#233;e : les segments
(&#945;), (&#946;) et (&#947;) ne sont pas cons&#233;cutifs, et l&#8217;on a par exemple la structure Result(&#945;, &#946;1) &#8743;R(&#946;1, &#946;2) &#8743; Contrast(&#946;2, &#947;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLOTTE ROZE
</p>
<p>et tenter de d&#233;terminer si le type de relation (coordonnante ou subordonnante) a un impact sur la d&#233;duction, et si
des relations partageant certaines cons&#233;quences s&#233;mantiques ont un comportement similaire dans la d&#233;duction.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALLEN J. (1983). Maintaining knowledge about temporal intervals. In Communications of the ACM : ACM
Press.
</p>
<p>ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation. Cambridge University Press.
</p>
<p>BLACK E., ABNEY S., FLICKENGER D., GDANIEC C., GRISHMAN R., HARRISON P., HINDLE D., INGRIA
R., JELINEK F., KLAVANS J., LIBERMAN M., MARCUS M., ROUKOS S., SANTORINI B. &amp; STRZALKOWSKI
T. (1991). A procedure for quantitatively comparing the syntactic coverage of English grammars. In Speech and
Natural Language : Proceedings of a Workshop Held at Pacific Grove, California.
</p>
<p>BUSQUETS J. (2007). Discourse contrast : Types an tokens. Language, Representation and Reasoning. Memorial
Volume to Isabel G&#243;mez Txurruka, p. 103&#8211;123.
</p>
<p>CANDITO M., CRABB&#201; B., DENIS P. &amp; GU&#201;RIN F. (2009). Analyse syntaxique du fran&#231;ais : des constituants
aux d&#233;pendances. In Proceedings of TALN&#8217;09, Senlis, France.
</p>
<p>DANLOS L. (2009). D-STAG : un formalisme d&#8217;analyse automatique de discours bas&#233; sur les TAG synchrones.
Revue TAL, 50, 1&#8211;30.
GROSZ B. &amp; SIDNER C. (1986). Attention, intentions, and the structure of discourse. Computational Linguistics,
12, 175&#8211;204.
GR&#214;TE B., LENKE N. &amp; STEDE M. (1995). Ma(r)king concessions in English and German. In LEIDEN, Ed.,
Proceedings of the Fifth European Workshop on Natural Language Generation, Netherlands.
</p>
<p>HALLIDAY M. A. K. &amp; HASAN R. (1976). Cohesion in English. London : Longman.
</p>
<p>MANN W. &amp; THOMPSON S. (1988). Rhetorical structure theory : Towards a functional theory of text organiza-
tion. Text, 8, 243&#8211;281.
MARCU D. (1996). Building up rhetorical structure trees. In Proceedings of 13th National Conference on
Artificial Intelligence, volume 2, p. 1069&#8211;1074, Portland, Oregon.
</p>
<p>NIVRE J. &amp; SCHOLZ M. (2004). Deterministic dependency parsing of english text. In COLING 2004, p. 64&#8211;70,
Geneva, Switzerland.
</p>
<p>OVERSTEEGEN L. E. (1997). On the pragmatic nature of causal and contrastive connectives. Discourse Pro-
cesses, 24, 51&#8211;85.
P&#201;RY-WOODLEY M.-P., ASHER N., ENJALBERT P., BENAMARA F., BRAS M., FABRE C., FERRARI S.,
HO-DAC L.-M., DRAOULEC A. L., MATHET Y., MULLER P., PR&#201;VOT L., REBEYROLLE J., TANGUY L.,
COURET M. V., VIEU L. &amp; WIDL&#214;CHER A. (2009). ANNODIS : une approche outill&#233;e de l&#8217;annotation de
structures discursives (poster). In Traitement Automatique des Langues Naturelles (TALN 2009), Senlis, France.
</p>
<p>ROZE C., DANLOS L. &amp; MULLER P. (2010). LEXCONN : a French Lexicon of Discourse Connectives. In
Proceedings of Multidisciplinary Approaches to Discourse (MAD 2010), Moissac, France.
</p>
<p>SETZER A., GAIZAUSKAS R. &amp; HEPPLE M. (2003). Using semantic inferences for temporal annotation compa-
rison. In Proceedings of the Fourth International Workshop on Inference in Computational Semantics (ICoS-4).
</p>
<p>SPOOREN W. (1989). Some aspects of the form and interpretation of global contrastive coherence relations.
PhD thesis, K.U. Nijmegen.
</p>
<p>TANNIER X. &amp; MULLER P. (2008). Evaluation metrics for automatic temporal annotation of texts. In Language
Resources and Evaluation Conference (LREC 2008), Marrakech.
</p>
<p>VILAIN M., BURGER J., ABERDEEN J., CONNOLLY D. &amp; HIRSCHMAN L. (1995). A model-theoretic corefe-
rence scoring scheme. In Sixth Message Understanding Conference (MUC&#8211;6), Columbia, Maryland.
</p>
<p>WEBBER B. (2004). D&#8211;LTAG : Extending lexicalized TAG to discourse. Cognitive Science, 28, 751&#8211;779.</p>

</div></div>
</body></html>