<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Des outils de TAL en support aux experts de s&#251;ret&#233; industrielle pour l&#8217;exploitation de bases de donn&#233;es de retour d&#8217;exp&#233;rience</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Des outils de TAL en support aux experts de s&#251;ret&#233; industrielle pour
l&#8217;exploitation de bases de donn&#233;es de retour d&#8217;exp&#233;rience
</p>
<p>Nikola TULECHKI
CLLE-ERSS, Universit&#233; de Toulouse-Le Mirail, CNRS
</p>
<p>nikola.tulechki@univ-tlse2.fr
Conseil en Facteurs Humains
</p>
<p>http://www.cfh-ergonomie-linguistique.com/
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente des applications d&#8217;outils et m&#233;thodes du traitement automatique des langues
(TAL) &#224; la ma&#238;trise du risque industriel gr&#226;ce &#224; l&#8217;analyse de donn&#233;es textuelles issues de volumineuses bases
de retour d&#8217;exp&#233;rience (REX). Il explicite d&#8217;abord le domaine de la gestion de la s&#251;ret&#233;, ses aspects politiques
et sociaux ainsi que l&#8217;activit&#233; des experts en s&#251;ret&#233; et les besoins qu&#8217;ils expriment. Dans un deuxi&#232;me temps il
pr&#233;sente une s&#233;rie de techniques, comme la classification automatique de documents, le rep&#233;rage de subjectivit&#233;,
et le clustering, adapt&#233;es aux donn&#233;es REX visant &#224; r&#233;pondre &#224; ces besoins pr&#233;sents et &#224; venir, sous forme d&#8217;outils,
en support &#224; l&#8217;activit&#233; des experts.
</p>
<p>Abstract. This article presents a series of natural language processing (NLP) techniques, applied to the
domain of industrial risk management and the analysis of large collections of textual feedback data. First we
describe the socio-political aspects of the risk mangement domain, the activity of the investigators working with
this data. We then present present applications of NLP techniques like automatic text classification, clustering and
opinion extraction, responding to different needs stated by the investigators.
</p>
<p>Mots-cl&#233;s : REX, rapport d&#8217;incident, risque, s&#251;ret&#233; industrielle, signaux faibles, classification automa-
tique, clustering, recherche d&#8217;information, similarit&#233;, subjectivit&#233;.
</p>
<p>Keywords: risk management, incident report, industrial safety, weak signals, automatic classification,
information retrieval, similarity, clustering, subjectivity.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Dans toute industrie hautement technologique, un incident peut avoir des cons&#233;quences d&#233;sastreuses, provoquer
des pertes mat&#233;rielles consid&#233;rables, des d&#233;g&#226;ts environnementaux ou, pire, co&#251;ter des vies humaines. La com-
plexit&#233; de chaque op&#233;ration, leurs intrications et la multiplicit&#233; des facteurs diff&#233;rents intervenant dans le fonction-
nement de ces industries rendent les risques toujours pr&#233;sents et am&#232;nent les acteurs (op&#233;rateurs) &#224; d&#233;velopper des
strat&#233;gies de gestion de la s&#251;ret&#233; des op&#233;rations. Avoir une vision d&#8217;ensemble sur l&#8217;&#233;tat du syst&#232;me &#224; tout moment
est crucial pour toute d&#233;marche de ma&#238;trise du risque et, lorsqu&#8217;il est question de macrosyst&#232;mes techniques de
l&#8217;&#233;chelle d&#8217;une compagnie a&#233;rienne ou p&#233;troli&#232;re, d&#8217;une centrale nucl&#233;aire, ou encore, &#224; un niveau sup&#233;rieur, d&#8217;un
secteur d&#8217;activit&#233; tel que le transport a&#233;rien, acqu&#233;rir des informations venant du plus pr&#232;s des op&#233;rations devient
une t&#226;che fondamentale et tr&#232;s difficile. Les politiques de retour d&#8217;exp&#233;rience (REX) mises en place dans les sec-
teurs &#224; risque t&#233;moignent de ce besoin vital. Les REX visent pr&#233;cis&#233;ment ce recueil syst&#233;matique d&#8217;information,
le plus souvent sous forme de compte rendus &#233;crits, et sa (plus ou moins) libre transmission &#224; toute la hi&#233;rarchie
organisationnelle.
</p>
<p>Une fois recueilli, le REX doit &#234;tre correctement exploit&#233;, afin d&#8217;identifier les sources de risques. Ceci est le
r&#244;le des experts en s&#251;ret&#233;, nos principaux interlocuteurs dans le cadre de cette recherche. Leur travail consiste
&#224; analyser des &#233;v&#233;nements anormaux survenus dans un secteur d&#8217;activit&#233; donn&#233; et relat&#233;s, des incidents, quasi-
accidents et accidents et, en se basant sur ces &#233;v&#233;nements d&#8217;&#233;mettre des recommandations ad&#233;quates, afin que ces
m&#234;mes &#233;v&#233;nements ne se reproduisent plus dans le futur. Or souvent, compte tenu de l&#8217;&#233;chelle des op&#233;rations,
des politiques de recueil de REX de plus en plus d&#233;velopp&#233;es et de la multiplications des canaux de partage
d&#8217;informations li&#233;s &#224; la s&#251;ret&#233; entre institutions, les experts se trouvent face &#224; une quantit&#233; de donn&#233;es h&#233;t&#233;rog&#232;nes
qui deviennent difficilement ma&#238;trisables de fa&#231;on traditionnelle (codage manuel et statistiques classiques).
</p>
<p>De plus, actuellement nous assistons &#224; une &#233;volution dans le concept m&#234;me de gestion de la s&#251;ret&#233; ; les acteurs sont
incit&#233;s &#224; adopter une strat&#233;gie proactive, autrement dit &#224; s&#8217;affranchir de l&#8217;analyse a posteriori (post accidentelle)
et &#224; identifier des risques latents avant qu&#8217;ils ne m&#232;nent &#224; un accident majeur. Cette d&#233;marche de pr&#233;vention met
l&#8217;accent sur l&#8217;importance des &#233;v&#233;nements mineurs qui peuvent contenir des indications sur une catastrophe &#224; venir.
&#171; On le savait. C&#8217;&#233;tait dans nos bases. Nous sommes juste pass&#233;s &#224; cot&#233; &#187; entend-on dire les experts,le plus souvent
sous anonymat, &#224; la suite d&#8217;un drame industriel.
</p>
<p>Le but de nos recherches, associant ergonomie et traitement automatique des langues (TAL) est donc de proposer
des outils permettant d&#8217;abord un acc&#232;s facilit&#233; aux contenus des bases de REX et, dans un deuxi&#232;me temps des
m&#233;thodes automatiques d&#8217;identification de risques &#233;mergents et de pr&#233;curseurs de situations &#224; risque. Ce projet
pluridisciplinaire doit donc dans un premier temps identifier les besoins pr&#233;cis exprim&#233;s par les experts en s&#251;-
ret&#233;, expliciter le contexte dans lequel s&#8217;inscrit leur activit&#233;, notamment les flux d&#8217;information et les contraintes
politiques et sociales qui lui sont associ&#233;s. Dans un deuxi&#232;me temps, ces besoins seront traduits en une s&#233;rie
de propositions op&#233;rationnels, des m&#233;thodes d&#8217;analyse automatique, ainsi que des traitements et algorithmes. &#192;
terme l&#8217;aboutissement sera une s&#233;rie d&#8217;outils destin&#233;s &#224; venir en support &#224; l&#8217;analyse de bases de REX dans une
perspective d&#8217;une meilleure ma&#238;trise du risque.
</p>
<p>Cet article est organis&#233; comme suit : Dans un premier temps nous ferons un tour rapide sur le concept de risque
industriel en nous concentrant notamment sur les derni&#232;res &#233;volutions dans le domaine qui placent de plus en
plus l&#8217;accent sur le r&#244;le de l&#8217;organisation dans son ensemble. Parall&#232;lement nous mentionnerons les &#233;volutions
politiques et sociales, intervenues r&#233;cemment dans certains secteurs d&#8217;activit&#233;, qui ont un impact direct sur la
nature de notre objet d&#8217;&#233;tude, le REX.
</p>
<p>Dans un deuxi&#232;me temps nous d&#233;crirons le travail des experts en s&#251;ret&#233; et leur rapport avec l&#8217;information du REX.
Ayant ainsi &#233;tabli le contexte g&#233;n&#233;ral nous allons nous tourner vers les sciences de gestion et le concept de signal
faible que nous adapterons &#224; notre probl&#233;matique.
</p>
<p>Dans la deuxi&#232;me partie de cet article, nous pr&#233;senterons un &#233;ventail de m&#233;thodes et techniques de TAL, que
nous adaptons &#224; notre mat&#233;riau textuel et aux besoins exprim&#233;s. Ces recherches, venant tout juste de commencer
sont encore pour la plupart &#224; un stade inachev&#233; et fortement exploratoires, stade o&#249; nous cherchons encore &#224;
valider la pertinence des techniques par rapport aux besoins des experts. Nous commencerons par l&#8217;activit&#233; la plus
aboutie &#224; ce jour - la cat&#233;gorisation automatique d&#8217;&#233;v&#232;nements. Ensuite nous pr&#233;senterons l&#8217;approche d&#8217;analyse
de similarit&#233;, encore en travaux, mais dont les premiers r&#233;sultats sont encourageants. Dans un troisi&#232;me temps
nous d&#233;velopperons les pistes que nous explorons actuellement visant &#224; exploiter davantage la notion de similarit&#233;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>en l&#8217;associant &#224; la fois &#224; des m&#233;thodes de d&#233;tection d&#8217;anomalie afin de rep&#233;rer des &#233;v&#233;nements anormaux ainsi
qu&#8217;&#224; des techniques de clustering afin de proc&#233;der &#224; des regroupements d&#8217;&#233;v&#233;nements similaires que nous pouvons
caract&#233;riser de diff&#233;rents mani&#232;res en fonction de leur comportement dans le temps. Enfin nous explorerons un
axe de recherche diff&#233;rent, qui consiste &#224; effectuer des analyses linguistiques fines sur le contenu textuel afin de
rep&#233;rer des variations stylistiques, afin de rep&#233;rer les &#233;tats &#233;motionnels des r&#233;dacteurs de ces documents.
</p>
<p>Chacune de ces techniques fera l&#8217;objet de publications d&#233;taill&#233;es dans le futur. De plus, &#233;tant donn&#233; la nouveaut&#233;
du domaine, et le manque de protocoles d&#8217;&#233;valuation ad&#233;quates ou de standards pr&#233;&#233;tablis (contrairement aux
domaines &#171; classiques &#187;, comme le RI ou EI) nous ne sommes pas encore en mesure de proposer une &#233;valuation
chiffr&#233;e dans cet article, dont la vocation est avant tout d&#8217;introduire la probl&#233;matique g&#233;n&#233;rale de nos recherches.
Une th&#232;se est en cours depuis le mois de janvier 2011 au laboratoire CLLE-ERSS &#224; l&#8217;Universit&#233; de Toulouse 2
- Le Mirail en &#233;troite collaboration avec la soci&#233;t&#233; de conseil en ergonomie industrielle &#171; Conseil en Facteurs
Humains &#187;.
</p>
<p>2 REX et s&#251;ret&#233; industrielle
</p>
<p>2.1 Fondements du REX
</p>
<p>Aujourd&#8217;hui, il existe un consensus total sur la n&#233;cessit&#233; de tirer des le&#231;ons d&#8217;&#233;v&#233;nements pass&#233;s, de dysfonc-
tionnements, accidents, incidents ou tout autres &#233;carts au fonctionnement normal. Le REX, que nous pouvons
d&#233;finir comme &#171; toute formalisation d&#8217;un &#233;v&#233;nement pass&#233; &#187; remplit ce r&#244;le de vecteur d&#8217;informations. A une
petite &#233;chelle, lorsque peu d&#8217;acteurs sont impliqu&#233;s ce processus est trivial 1, mais &#224; l&#8217;&#233;chelle d&#8217;un macrosys-
t&#232;me technique, tel que, par exemple, l&#8217;aviation civile au niveau europ&#233;en, impliquant des centaines de milliers
d&#8217;individus, des centaines de compagnies a&#233;riennes et une vingtaine de gouvernements, utiliser et faire circuler
l&#8217;information devient une entreprise monumentale, mais n&#233;cessaire si l&#8217;on veut prendre en consid&#233;ration tous
les facteurs pouvant intervenir dans la gestion du risque et adopter une approche globale envers sa ma&#238;trise. La
figure no 1, extraite de (Rasmussen, 1997) illustre la complexit&#233; d&#8217;un macrosyst&#232;me technique &#224; risque et la mul-
titude de forces, ayant un impact sur la s&#251;ret&#233;, impliqu&#233;es &#224; diff&#233;rents niveaux, allant des op&#233;rateurs interagissant
avec des machines (techniciens, pilotes etc..) passant par les syndicats, le management, les diff&#233;rents organismes
r&#233;gulateurs jusqu&#8217;aux gouvernements.
</p>
<p>Particuli&#232;rement int&#233;ressants pour nous sont les flux d&#8217;information dans cette hi&#233;rarchie. L&#8217;un, &#233;vident, est le
flux &#171; descendant &#187; ; l&#233;gislation, recommandations, formations et manuels d&#8217;utilisation visent &#224; contraindre les
op&#233;rateurs &#224; un comportement standardis&#233;, r&#233;put&#233; &#171; plus s&#251;r &#187; afin d&#8217;am&#233;liorer le niveau global de s&#251;ret&#233; du
syst&#232;me.
</p>
<p>Le flux inverse encore moins &#233;vident. Faire remonter des informations du terrain jusqu&#8217;aux instances r&#233;gulatrices
n&#233;cessite un ensemble de mesures, des m&#233;thodes et un cadre juridique ad&#233;quat. Le secteur a&#233;ronautique est pion-
nier dans cette politique du REX global, gr&#226;ce &#224; la r&#233;glementation obligeant son recueil syst&#233;matique et le partage
avec des instances r&#233;gulatrices au niveau national, tout comme au niveau europ&#233;en. Il est utile de noter le conflit
majeur suscit&#233; par le REX : la tension entre s&#233;curit&#233; et responsabilit&#233;. Afin que le REX soit efficace, on doit pou-
voir faire part des erreurs commises lors des op&#233;rations. Or &#171; avouer &#187; une erreur remet en cause l&#8217;op&#233;rateur qui l&#8217;a
commise et peut l&#8217;exposer, dans des organisations &#171; traditionnelles &#187; &#224; des sanctions &#233;ventuelles. Nous laisserons
de cot&#233; le d&#233;bat actuel sur le statut de &#171; l&#8217;erreur humaine &#187; 2 vis-&#224;-vis de la s&#233;curit&#233;, pour dire qu&#8217;afin de r&#233;duire
le silence g&#233;n&#233;r&#233; par la crainte de sanctions, et am&#233;liorer la qualit&#233; du REX, de nombreuses industries ont mis
en place des politiques de non-punition et/ou d&#8217;anonymisation afin de favoriser le REX volontaire de la part des
op&#233;rateurs. Ce nouveau canal d&#8217;information est amplement utilis&#233; dans le secteur a&#233;ronautique.
</p>
<p>1. Prenons un exemple de tous les jours : Une famille acquiert une nouvelle friteuse (nouvel &#233;quipement). Lors de la premi&#232;re utilisation,
le mari (op&#233;rateur), n&#8217;ayant pas lu le manuel d&#8217;utilisation, introduit brusquement les pommes de terre fra&#238;chement coup&#233;es dans l&#8217;huile tr&#232;s
chaude (op&#233;ration). L&#8217;accident survient imm&#233;diatement. L&#8217;huile bout et s&#8217;&#233;chappe de l&#8217;appareil (&#233;v&#233;nements redout&#233;). Apr&#232;s avoir nettoy&#233; sa
cuisine (r&#233;cup&#233;ration), il fait part de son exp&#233;rience aux autres membres de la famille (REX), en les incitant &#224; ne pas introduire les pommes de
terre rapidement dans l&#8217;huile trop chaude (recommandation).
</p>
<p>2. Sinon pour dire que le consensus est qu&#8217;il n&#8217;existe pas d&#8217;activit&#233; humaine sans erreurs, la plupart du temps r&#233;cup&#233;r&#233;es par l&#8217;op&#233;rateur
lui m&#234;me, ces coll&#232;gues ou des automates.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 1 &#8211; Composantes d&#8217;une activit&#233; humaine intervenant dans le fonctionnement d&#8217;un processus dangereux
</p>
<p>2.2 Utilisation du REX
</p>
<p>Avoir acc&#232;s aux informations ne signifie pas qu&#8217;elles seront automatiquement mises &#224; contribution &#224; l&#8217;am&#233;liora-
tion de la s&#251;ret&#233;. Nous somme rapidement arriv&#233;s &#224; une &#233;tape, o&#249; la quantit&#233; d&#8217;information accessible d&#233;passe les
capacit&#233;s d&#8217;analyse humaine. De plus puisque l&#8217;information provient le plus souvent de sources diff&#233;rentes, cha-
cune avec sa propre culture vis-&#224;-vis du recueil du REX, les informations peuvent &#234;tre tr&#232;s h&#233;t&#233;rog&#232;nes du point
de vue de leur format (bases de donn&#233;es, fichiers MS Excel, MS Word etc). Afin de servir de support d&#8217;analyse
ces donn&#233;es doivent &#234;tre converties en un format commun. Dans le cas de l&#8217;aviation, ou le r&#233;cit d&#8217;un &#233;v&#233;nement
est accompagn&#233; d&#8217;un vaste ensemble de (m&#233;ta)donn&#233;es relatives, par exemple au type d&#8217;appareil, aux conditions
m&#233;t&#233;orologiques, donn&#233;es g&#233;ographiques etc, un effort de standardisation est en cours en Europe pilot&#233; par la
Commission Europ&#233;enne et visant &#224; &#233;tablir un tel format et un support logiciel pour son exploitation : l&#8217;environ-
nement ECCAIRS 3 en est le fruit. V&#233;ritable &#171; boite &#224; outils &#187; destin&#233;e &#224; l&#8217;expert en s&#251;ret&#233;, ECCAIRS propose
en plus d&#8217;un format facilement &#233;changeable, un ensemble de fonctionnalit&#233;s comme un langage de requ&#234;te, un
navigateur sp&#233;cialis&#233; etc.
</p>
<p>Un des &#233;tapes-cl&#233;s lors de l&#8217;analyse d&#8217;un &#233;v&#233;nement nouveau est sa codification, un proc&#233;d&#233; visant &#224; attribuer
&#224; un &#233;v&#232;nement un ensemble de codes correspondant &#224; ses diff&#233;rents facettes ; le type de l&#8217;&#233;v&#233;nement (e.g sor-
tie de piste, choc avec un oiseau, etc.) des facteurs d&#8217;environnement d&#233;crivant l&#8217;&#233;v&#233;nement (conditions m&#233;t&#233;o
d&#233;favorables, panne d&#8217;un &#233;quipement, etc.), des facteurs contribuant &#224; l&#8217;explication de l&#8217;&#233;v&#233;nement (fatigue de
l&#8217;op&#233;rateur, m&#233;connaissance d&#8217;une proc&#233;dure, etc.) En tout une liste 4 de plusieurs milliers de valeurs, organis&#233;es
en une s&#233;rie de taxonomies, &#233;tablies par l&#8217;organisation de l&#8217;aviation civile internationale (OACI), lors d&#8217;un effort
de standardisation de l&#8217;analyse d&#8217;incidents en a&#233;ronautique. Une fois codifi&#233; un rapport peut &#234;tre stock&#233; dans une
base et est r&#233;utilisable par la suite. Cependant puisque le contexte est en perp&#233;tuelle &#233;volution, le sch&#233;ma de co-
dification doit &#234;tre constamment mis &#224; jour 5. Des m&#233;thodes de classification automatique peuvent venir en aide &#224;
</p>
<p>3. European Coordination Centre for Accident Incident Reporting Systems : http://eccairsportal.jrc.ec.europa.eu/
4. Le sch&#233;ma de codification ADREP actuelle est disponible &#224; cette adresse : http://www.icao.int/anb/aig/Taxonomy/
5. Les perturbations du transport a&#233;rien en 2010 dues &#224; l&#8217;&#233;ruption d&#8217;un volcan en Islande ont naturellement amen&#233;s au rajout d&#8217;une s&#233;rie</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ces proc&#233;d&#233;s de codification (voir infra).
</p>
<p>2.3 Vis&#233;e proactive, contexte dynamique et signaux faibles
</p>
<p>Lors des investigations de v&#233;ritables accidents, les experts cherchent &#224; identifier les causes dites &#171; primaires &#187; de
ces derniers. Il s&#8217;agit dans la plupart des cas d&#8217;une configuration particuli&#232;re d&#8217;&#233;v&#233;nements ou d&#8217;&#233;tats, souvent
clairement identifiables et signal&#233;s bien avant que l&#8217;accident lui m&#234;me se produise 6.
</p>
<p>Partant de ce constat, au cours de la derni&#232;re d&#233;cennie, d&#8217;importants efforts ont &#233;t&#233; faits afin de d&#233;passer la gestion
du risque a posteriori et de se positionner dans une v&#233;ritable d&#233;marche &#171; proactive &#187;. L&#8217;attention est port&#233;e non pas
sur un accident qui s&#8217;est produit, mais un &#233;tat des choses potentiellement dangereux, une catastrophe future que
l&#8217;on peut &#233;viter &#224; la lumi&#232;re des informations que nous avons aujourd&#8217;hui. Ainsi, les experts en s&#233;curit&#233; sont de
plus en plus sollicit&#233;s pour traiter des gros volumes d&#8217;informations relatives &#224; la s&#233;curit&#233;, traitant de faits pouvant
para&#238;tre peu importants chacun isol&#233; et en se basant sur leur connaissance du domaine, faire des rapprochements
entre ces faits et d&#233;celer des risques cach&#233;s. Parall&#232;lement, les acteurs (pilotes, m&#233;caniciens, op&#233;rateurs, etc.) sont
incit&#233;s &#224; signaler tout &#233;v&#232;nement anormal relatif &#224; la s&#233;curit&#233;, ainsi qu&#8217;&#224; s&#8217;exprimer d&#232;s qu&#8217;ils jugent qu&#8217;il y a
un risque quelconque. Ce basculement vers une vis&#233;e proactive dans la gestion du risque am&#232;ne donc d&#8217;une part
une augmentation importante du volume d&#8217;information disponible 7, puisque des faits de moins en moins &#233;loign&#233;s
de la norme prescrite sont signal&#233;s (Macrae, 2010) et d&#8217;autre part un changement du statut de cette information
vis-&#224;-vis de l&#8217;expert en s&#233;curit&#233;, qui est amen&#233; &#224; se concentrer sur des faits o&#249; le risque est de moins en moins
explicite et, en faisant appel &#224; son intuition et &#224; son exp&#233;riences, &#224; chercher &#224; aller au-del&#224; de ce qui est r&#233;ellement
signal&#233; et d&#233;celer les risques cach&#233;s.
</p>
<p>Une telle int&#233;gration de la gestion de la s&#233;curit&#233; dans les op&#233;rations m&#234;me d&#8217;une entreprise est au c&#339;ur du mod&#232;le
SGS (Syst&#232;mes de Gestion de la S&#233;curit&#233;) vers lequel sont amen&#233;s &#224; s&#8217;orienter de plus en plus d&#8217;industries &#171; &#224;
risque &#187;. D&#233;fini comme &#171; une fa&#231;on de g&#233;rer la s&#233;curit&#233; sous une optique commerciale &#187; (TC, 2001), un SGS part
de l&#8217;hypoth&#232;se que la s&#233;curit&#233; au sein de l&#8217;entreprise doit devenir &#171; l&#8217;affaire de tout le monde &#187;, amenant ainsi &#224;
une encore plus grande diversification des types d&#8217;informations relatives &#224; la s&#233;curit&#233; ainsi que ses sources. Ainsi
l&#8217;identification d&#8217;une information importante risque de devenir de plus en plus difficile, ne serait-ce que du fait du
volume et de la diversit&#233; des bases textuelles. Litt&#233;ralement &#171; noy&#233;s dans la masse &#187; 8, l&#8217;acc&#232;s &#224; ces informations
sera un g&#233;n&#233;rateur de frustration pour les experts en s&#233;curit&#233;, qui doivent ne rien laisser de cot&#233;.
</p>
<p>Les probl&#232;mes inh&#233;rents &#224; la gestion de la s&#233;curit&#233; dans un SGS, &#224; savoir la diversit&#233; des sources d&#8217;information,
la redondance, la n&#233;cessit&#233; absolue d&#8217;interpr&#233;tation de cette information par un expert, et la disproportion entre
sa fr&#233;quence et son importance, sont depuis longtemps connus des sciences de gestion. Partant d&#8217;une toute autre
probl&#233;matique, celle de la n&#233;cessit&#233; d&#8217;adaptation constante &#224; un environnement commercial et concurrentiel en
constante mutation, toute entreprise est amen&#233;e &#224; mettre en place des proc&#233;d&#233;s de veille strat&#233;gique, autrement dit
d&#8217;&#234;tre constamment &#171; &#224; l&#8217;&#233;coute &#187; de son environnement, pour toute information pouvant indiquer un changement
futur de ce dernier.
</p>
<p>Voulant syst&#233;matiser ce processus d&#8217;&#233;coute et d&#8217;adaptation, les chercheurs en gestion strat&#233;gique des entreprises
ont forg&#233; la notion de &#171; signal faible &#187; (Ansoff, 1975). Loin d&#8217;&#234;tre une th&#233;orie &#224; proprement parler, ce concept
est plut&#244;t une fa&#231;on particuli&#232;re et originale de voir l&#8217;information. D&#233;fini comme un &#171; signe d&#8217;alerte pr&#233;coce &#187;,
le signal faible est une &#171; information dont l&#8217;interpr&#233;tation sugg&#232;re qu&#8217;un &#233;v&#233;nement susceptible d&#8217;&#234;tre important
pour l&#8217;avenir d&#8217;une firme pourrait s&#8217;amorcer &#187; (Lesca &amp; Blanco, 2002). L&#8217;hypoth&#232;se de base est que tout chan-
gement dans le contexte suffisamment important pour pouvoir influencer le bon fonctionnement d&#8217;une entreprise
est forcement signal&#233; bien avant qu&#8217;il ne produise des cons&#233;quences visibles par tous. De plus, dans la p&#233;riode
</p>
<p>de codes en rapport avec les cendres volcaniques.
6. L&#8217;exemple de l&#8217;explosion d&#8217;une colonne dans la raffinerie de BP &#224; Texas City au mois de mars 2005 est parlant. Ce d&#233;sastre, provoquant
</p>
<p>la mort de 15 personnes, est survenu lorsqu&#8217;un nuage de vapeur, form&#233; suite &#224; une erreur dans la quantit&#233; de p&#233;trole vers&#233; dans une colonne, s&#8217;est
&#233;chapp&#233; et en contact avec une &#233;tincelle, s&#8217;est enflamm&#233;. Lors de l&#8217;investigation qui a suivi, six autres cas quasiment identiques, impliquant &#224;
la fois la m&#234;me proc&#233;dure et le m&#234;me &#233;quipement, survenus au cours des dix derni&#232;res ann&#233;es, &#233;taient mis au jour, aucun n&#8217;ayant tourn&#233; au
cauchemar uniquement du fait de l&#8217;absence d&#8217;une source de flamme &#224; proximit&#233;. Tous les six &#233;taient pourtant d&#251;ment document&#233;s, mais ce
n&#8217;est que lors de l&#8217;investigation qu&#8217;un lien entre ces six occurrences est identifi&#233;.
</p>
<p>7. Dans une grande compagnie a&#233;rienne, le nombre de nouveaux rapports d&#8217;incidents est aux alentours de 600 par mois.
8. La politique actuelle de signalement d&#8217;&#233;v&#232;nements relatifs &#224; la s&#233;curit&#233; actuellement mise en place pr&#233;conise le signalement de tout
</p>
<p>&#233;v&#232;nement potentiellement dangereux. Or, on note que dans les faits, sont signal&#233;s une multitude d&#8217;&#233;v&#232;nements de routine, des &#171; d&#233;rapages &#187;
de tous les jours, (comme par exemple des chocs avec des oiseaux au d&#233;collage pour les pilotes d&#8217;avion) qui finalement sont de peu d&#8217;int&#233;r&#234;t
pour l&#8217;expert en s&#233;curit&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>relativement longue, entre le moment du premier signalement d&#8217;un changement et le jour o&#249; ce changement de-
vient r&#233;alit&#233; au point de menacer l&#8217;activit&#233; de l&#8217;entreprise, on peut observer une amplification de l&#8217;intensit&#233; du
signalement. Inversement, la marge de man&#339;uvre dont dispose l&#8217;entreprise diminue au fur et &#224; mesure de cette
p&#233;riode 9.
</p>
<p>2.4 Caract&#233;ristiques des donn&#233;s
</p>
<p>Les donn&#233;es sur lesquelles nous travaillons proviennent de bases de donn&#233;es diff&#233;rentes mises &#224; notre disposi-
tion par des instances r&#233;gulatrices de l&#8217;aviation civile, nationales et europ&#233;ennes, ainsi que par divers industriels
dans des secteurs &#224; risque (transports, industrie chimique, etc.). A l&#8217;heure actuelle notre corpus contient plusieurs
dizaines de milliers de documents, &#233;crits en anglais et en fran&#231;ais et cro&#238;t constamment.
</p>
<p>La plupart des documents sont &#233;crits dans un langage tr&#232;s technique, propre au secteur d&#8217;activit&#233;. Abondant d&#8217;acro-
nymes, de termes techniques, de chiffres, de mesures, ces textes pr&#233;sentent, en r&#232;gle g&#233;n&#233;rale des caract&#233;ristiques
comme une variation lexicale relativement faible, peu de polys&#233;mie et une absence de constructions syntaxiques
&#233;labor&#233;s. Il s&#8217;agit de documents courts, la plupart ne d&#233;passent pas les 500 mots.
</p>
<p>Nous sommes en train de d&#233;velopper une grille de cat&#233;gorisation fine de ces textes, qui sera pr&#233;sent&#233;e dans une
prochaine publication.
</p>
<p>3 Analyses automatiques de bases de REX
</p>
<p>Dans cette deuxi&#232;me partie nous pr&#233;senterons quelques diff&#233;rents applications de m&#233;thodes issues du TAL aux
donn&#233;es REX.
</p>
<p>3.1 Cat&#233;gorisation automatique d&#8217;&#233;v&#233;nements
</p>
<p>Nous avons vu que la codification des &#233;v&#233;nements est une &#233;tape cruciale de leur analyse et permet leur r&#233;utilisabi-
lit&#233; par la suite. Or, dans la r&#233;alit&#233;, cette t&#226;che est effectu&#233;e de mani&#232;re insatisfaisante pour plusieurs raisons. Vu la
complexit&#233; des sch&#233;mas de codification, contenant plusieurs centaines de classes, les codeurs attribuent souvent la
classe la plus probable sans v&#233;ritablement rentrer dans les d&#233;tail. Les efforts de standardisation des bases de REX
&#233;tant relativement r&#233;cents, nous disposons de vastes quantit&#233;s d&#8217;&#233;v&#233;nements pass&#233;s qui n&#8217;ont jamais &#233;t&#233; cod&#233;s,
mais qui pr&#233;sentent un int&#233;r&#234;t pour des campagnes d&#8217;analyse d&#8217;aujourd&#8217;hui. Parall&#232;lement, puisque les sch&#233;mas
de codification &#233;voluent, et ce en r&#232;gle g&#233;n&#233;rale apr&#232;s qu&#8217;un certain nombre d&#8217;&#233;v&#233;nements de type nouveau soient
survenus, de fa&#231;on &#224; justifier cette &#233;volution, il est n&#233;cessaire de les identifier &#224; posteriori et de leur attribuer les
nouveaux codes.
</p>
<p>Afin de r&#233;pondre &#224; ce besoin nous employons des techniques d&#8217;apprentissage automatique supervis&#233; et plus pr&#233;-
cis&#233;ment de classification automatique. Cette t&#226;che consiste &#224; attribuer automatiquement une classe &#224; un individu
en se basant sur les valeurs d&#8217;un ensemble de variables. Dans notre cas l&#8217;individu est un texte &#224; classer, les va-
riables sont les fr&#233;quences des termes dans le texte et la classe &#224; pr&#233;dire est le code de la taxonomie ADREP (voir
supra). Voici le processus en d&#233;tail. Nous partons d&#8217;un ensemble suffisamment large de documents d&#233;j&#224; codifi&#233;s.
Compte tenu des sp&#233;cificit&#233;s des textes, comme par exemple l&#8217;abondance de mesures et de noms g&#233;ographiques,
nous appliquerons une s&#233;rie de pr&#233;traitements qui r&#233;duisent ces termes &#224; des tokens g&#233;n&#233;riques (mesure, pays,
etc). Ensuite nous proc&#233;dons &#224; une analyse morphosyntaxique en utilisant l&#8217;analyseur TreeTagger 10, suivie d&#8217;une
analyse syntaxique en d&#233;pendances. Enfin en se basant sur la structure syntaxique, nous effectuons une extraction
de s&#233;quences de mots en suivant les liens syntaxiques.
</p>
<p>9. Illustrons ce propos par un exemple : prenons une entreprise sp&#233;cialis&#233;e dans la fabrication de cassettes audio vierges. L&#8217;avancement de
la technologie et plus pr&#233;cis&#233;ment l&#8217;invention du CD-ROM, rend son produit obsol&#232;te et l&#8217;oblige &#224; s&#8217;adapter en cons&#233;quence. Or le fait que le
CD-ROM deviendra le support de r&#233;f&#233;rence est signal&#233; bien avant que ceci ne devienne r&#233;alit&#233;. Au d&#233;but, on peut imaginer des publications
scientifiques qui d&#233;crivent la possibilit&#233; de stockage d&#8217;information sur un support optique. Ensuite un brevet est d&#233;pos&#233; pour ce nouveau
support. Encore plus tard on commence &#224; rep&#233;rer des publications dans la presse sp&#233;cialis&#233;e parlant d&#8217;un nouveau support qui vient d&#8217;&#234;tre
invent&#233;, suivies de publications dans les m&#233;dias g&#233;n&#233;ralistes, et ainsi de suite. Une progression dans la visibilit&#233; du signal est clairement
perceptible et l&#8217;entreprise doit en tenir compte afin d&#8217;&#233;viter toute surprise.
</p>
<p>10. http://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger/DecisionTreeTagger.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ainsi la phrase :
</p>
<p>Vers 200ft, d&#233;viation de l avion vers la gauche de la piste puis retour
sensible, &#224; 200ft alarme autoland.
</p>
<p>Est repr&#233;sent&#233;e par des s&#233;quences comme :
</p>
<p>&lt;mesure&gt;, avion, gauche, piste, d&#233;viation, d&#233;viation avion, d&#233;viation
gauche, d&#233;viation avion gauche, d&#233;viation piste, d&#233;viation avion piste
</p>
<p>Un classificateur est ensuite entra&#238;n&#233; sur la base des corr&#233;lations entre les s&#233;quences extraites et les cat&#233;gories
&#224; sugg&#233;rer (voir (Hermann et al., 2008) pour une explication an d&#233;tail) qu&#8217;ont ces termes &#224; appara&#238;tre dans un
rapport cod&#233; dans une classe donn&#233;e.
</p>
<p>Cette activit&#233; de codification automatique est, &#224; l&#8217;heure actuelle op&#233;rationnelle dans le cadre de la collaboration
de la soci&#233;t&#233; CFH avec les organismes r&#233;gulateurs nationaux et europ&#233;ens.
</p>
<p>3.2 Analyses de similarit&#233; et param&#232;tre temporel
</p>
<p>Une autre piste de recherche que nous avons entreprise, en utilisant de m&#233;thodes issues de la recherche d&#8217;informa-
tion (RI), consiste &#224; identifier automatiquement des &#233;v&#233;nements similaires et d&#8217;&#233;tudier leur comportement dans le
temps.
</p>
<p>Les exemples ci dessus sont issus d&#8217;une base d&#8217;analyses d&#8217;accidents a&#233;ronautiques, de 1943 &#224; nos jours, accessible
au public 11. Apr&#232;s un tri sur la longueur des textes, afin de ne pas inclure des rapports sans texte ou avec tr&#232;s peu
de contenu, le corpus contient environ 14000 documents &#233;crits en anglais.
</p>
<p>La premi&#232;re &#233;tape est de calculer automatiquement un score de similarit&#233; pour une paire de documents donn&#233;e. En
se basant sur les termes que les documents partagent, nous utilisons la similarit&#233; cosinus, m&#233;trique classique en RI
pour attribuer un score compris entre 0 et 1 &#224; chaque paire de documents dans la collection. Un score de 0 signifie
une absence de termes en commun et un score de 1 - une identit&#233; compl&#232;te. Ce score est obtenu en calculant le
cosinus entre deux vecteurs dans un espace &#224; n dimensions d&#233;termin&#233;es par le nombre de termes dans la collection.
Chaque document est repr&#233;sent&#233; par un vecteur en fonction des termes qu&#8217;il contient. Voici le processus en d&#233;tail :
</p>
<p>D&#8217;abord, afin de r&#233;duire la variation morphologique, nous proc&#233;dons &#224; une lemmatisation par Tree Tagger. Dans
un deuxi&#232;me temps nous construisons un espace termes en prenant les lemmes des noms, adjectifs et verbes
contenus dans le texte. Ensuite nous construisons une matrice terme/document ou chaque ligne est un vecteur
correspondant &#224; un document de la collection dont les composants sont les importances dans son contenu de ses
termes, calcul&#233;es en utilisant la m&#233;thode de pond&#233;ration TF/IDF (Jones, 2004). Enfin nous calculons le cosinus
entre les deux vecteurs documents A et B en avec leur produit scalaire et leur norme.
</p>
<p>cos(&#952;) =
A &#183;B
&#8214;A&#8214;&#8214;B&#8214; =
</p>
<p>&#8721;n
i=1Ai &#215;Bi&#8730;&#8721;n
</p>
<p>i=1 (Ai)
2 &#215;&#8730;&#8721;ni=1 (Bi)2 (1)
</p>
<p>Afin d&#8217;explorer le comportement dans le temps des ensembles de documents similaires, nous avons mis en place
un outil 12 qui projette ces documents sur un axe temporel. La copie d&#8217;&#233;cran ci dessous s&#8217;interpr&#232;te de la mani&#232;re
suivante. Chaque point repr&#233;sente un document par rapport &#224; un document source. les documents sont ordonn&#233;s
chronologiquement sur l&#8217;abscisse et class&#233;s par similarit&#233; sur l&#8217;ordonn&#233;e. Un seuil de (arbitrairement fix&#233; &#224; 0.1)
est appliqu&#233; afin de ne pas surcharger le graphique. Plus un point est &#224; droite, plus il est r&#233;cent et plus il est haut,
plus il est similaire au document source. Ici est repr&#233;sent&#233; l&#8217;ensemble d&#8217;&#233;v&#232;nements similaires au document source
suivant, datant du 06/01/2003.
</p>
<p>11. L&#8217;Aviation Safety Network, disponible &#224; l&#8217;adresse suivante :http://aviation-safety.net/ collecte les rapports traitant d&#8217;ac-
cidents a&#233;ronautiques s&#233;rieux.
</p>
<p>12. Une d&#233;monstration de cet outil sur des donn&#233;es d&#8217;incidents a&#233;ronautiques est disponible &#224; l&#8217;adresse suivante :http://slow-start.
org/safetyDataDemos/timePlotASN/main.cgi</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>The captain&#8217;s failure to attain a proper touchdown on runway, and his subsequent
failure to perform a go-around, both of which resulted in a runway overrun. Fac-
tors were the company&#8217;s inadequate dispatch procedures with their failure to
provide all NOTAMS for the airport to the flight crew, and the snow covered run-
way
</p>
<p>FIGURE 2 &#8211; &#201;v&#233;nements similaires sur un axe temporelle
</p>
<p>Comparons deux documents au document source, l&#8217;un (datant du 24/01/2007, indiqu&#233; par a) relativement similaire
(0.35) :
</p>
<p>(en gras, nous avons mis les mots partag&#233;s) :
</p>
<p>The copilot&#8217;s failure to maintain the proper airspeed, and failure to obtain
the proper touchdown point, and the pilot-in-command&#8217;s inadequate supervision,
which resulted in an overrun. Contributing to the accident was the PIC&#8217;s failure
to activate the speed brake upon touchdown and the snow contaminated runway
</p>
<p>et le deuxi&#232;me (datant du 14/09/2007, indiqu&#233; par b) un peu moins (0.15) :
</p>
<p>The pilot&#8217;s failure to initiate a missed approach and his failure to obtain the
proper touchdown point while landing in the rain. Contributing to the accident
were the operator&#8217;s lack of standard operating procedures and the inadequate
maintenance of the windshield
</p>
<p>Nous pouvons voir comment la notion de similarit&#233; traduit un degr&#233; de ressemblance entre les deux &#233;v&#233;nements ;
comme le document source, les deux traitent d&#8217;atterrissage rat&#233;s, mais uniquement l&#8217;&#233;v&#233;nement plus similaire
mentionne des pistes enneig&#233;es.
</p>
<p>Une entrave potentielle &#224; l&#8217;utilisabilit&#233; de cette approche par similarit&#233; est le besoin de faire une requ&#234;te, autrement
dit de s&#233;lectionner un document,une manifestation du paradoxe de M&#233;no 13, dont les experts en s&#251;ret&#233;, craignant de
biaiser leur analyse en faisant des pr&#233;suppos&#233;s, nous ont fait part. De ce fait nous envisageons de faire &#233;voluer ces
approches en employant des techniques d&#8217;apprentissage non supervis&#233;, afin de faire &#233;merger des regroupements
naturels d&#8217;&#233;v&#233;nements similaires. Ces techniques, dites de clustering (voir (Srivastava &amp; Zane-Ulman, 2005) pour
un exemple sur des donn&#233;es textuelles de type REX) permettent de s&#8217;affranchir de la requ&#234;te bas&#233;e sur le contenu
des documents regroup&#233;s comme mode d&#8217;acc&#232;s et ouvrent la voie &#224; &#233;tablir d&#8217;autres types de requ&#234;tes. Une piste
que nous envisageons, peu explor&#233;e jusqu&#8217;&#224; maintenant est celle du profilage chronologique (voir (Matthews et al.,
2010) pour un exemple d&#8217;un outil semblable destin&#233; &#224; des archives de presse). Une fois obtenus, les clusters de
</p>
<p>13. Meno demande &#224; Socrate comment quelqu&#8217;un peut rechercher quelque chose quand il n&#8217;a aucune id&#233;e de ce qu&#8217;est cette chose.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>documents sont projet&#233;s sur un axe temporel et leur distribution chronologique est calcul&#233;e. Si l&#8217;on consid&#232;re les
textes de l&#8217;exemple ci dessus comme les membres d&#8217;un cluster, ce cluster aurait un profil &#233;mergeant, puisque les
documents r&#233;cents sont beaucoup plus fr&#233;quents que les documents anciens et est susceptible d&#8217;indiquer un risque
nouveau prenant de l&#8217;ampleur. A l&#8217;inverse la fr&#233;quence diminuant dans le temps d&#8217;un groupe de documents si-
milaires, peut indiquer l&#8217;efficacit&#233; d&#8217;une recommandation nouvellement &#233;mise 14. D&#8217;autres profils chronologiques
sont aussi int&#233;ressants, comme des &#233;v&#233;nements survenant &#224; des rythmes particuliers (hebdomadaire, mensuel,
annuel), par exemple.
</p>
<p>3.3 D&#233;tection d&#8217;anomalie et &#233;v&#233;nements anormaux
</p>
<p>Les bases de REX contiennent un grand nombre d&#8217;&#233;v&#233;nements similaires. Quotidiennement les avions heurtent
des volatiles et ratent des atterrissages &#224; cause d&#8217;un vent lat&#233;ral. Cependant un petit nombre d&#8217;&#233;v&#233;nements anor-
maux jamais vus jusqu&#8217;ici surviennent et il est possible de les identifier de mani&#232;re enti&#232;rement automatique en
utilisant des techniques de rep&#233;rage d&#8217;anomalie, un ensemble de techniques statistiques, enti&#232;rement bas&#233;es sur
les donn&#233;es, visant &#224; identifier dans une population les individus exceptionnels, bizarres, les outliers (Chandola
et al., 2009).
</p>
<p>Puisqu&#8217;il s&#8217;agit de m&#233;thodes quantitatives, la principale difficult&#233; porte sur la transformation des donn&#233;s textuelles
(symboliques et qualitatives) en une s&#233;rie de scores num&#233;riques. Nous nous baserons pour cela sur les travaux en
recherche d&#8217;information, domaine qui rencontre les m&#234;mes difficult&#233;s. Parmi eux, certains comme (Arampatzis
et al., 2000) proposent des m&#233;thodes automatiques linguistiquement motiv&#233;es qui visent &#224; ma&#238;triser la variation
inh&#233;rente au langage naturel (variation lexicale, morphologique, syntaxique voire s&#233;mantique) afin d&#8217;atteindre un
niveau sup&#233;rieur d&#8217;abstraction, et par cons&#233;quent de produire des scores de similarit&#233; plus pertinents, scores pr&#233;-
cis&#233;ment sur lesquels se basent la majorit&#233; des techniques de d&#233;tection d&#8217;anomalies. Lors de quelques exp&#233;riences
autour du clustering (classification hi&#233;rarchique ascendante (CHA) (McQuitty, 1966), plus pr&#233;cis&#233;ment), inspir&#233;s
des travaux de (Ah-Pine et al., 2005) nous avons pu valider l&#8217;int&#233;r&#234;t et la faisabilit&#233; de ces techniques pour le
rep&#233;rage des &#233;v&#233;nements &#171; anormaux &#187;.
</p>
<p>Voici une esquisse de cette m&#233;thode. Partant d&#8217;une matrice de similarit&#233;, un algorithme regroupe progressivement
les documents les plus similaires pour former une hi&#233;rarchie de partitions binaires incluses les unes dans les
autres. Plus on monte dans la hi&#233;rarchie, plus les regroupements sont g&#233;n&#233;rales, plus on descend plus le crit&#232;re
implicite de regroupement est sp&#233;cifique. Les &#233;v&#233;nements anormaux, n&#8217;&#233;tant, par d&#233;finition, pas similaires avec
les autres, ont une tendance de former des branches hautes dans la hi&#233;rarchie (pr&#232;s de la racine). Nous avons
exp&#233;riment&#233; avec cette m&#233;thode utilisant un sous corpus de 110 documents, choisis manuellement afin de simuler
une base avec une r&#233;partition in&#233;gale entre beaucoup de documents traitant d&#8217;&#233;v&#233;nements semblables et peu de
documents traitant d&#8217;&#233;v&#233;nements vari&#233;s. Ce corpus de test comprend 50 documents traitant des collisions avec des
oiseaux, 50 traitant des remises de gaz 15 et 10 documents divers, pris au hasard. Nous avons calcul&#233; leur matrice
de similarit&#233; en utilisant la m&#233;thode d&#233;crite ci-dessus avant de proc&#233;der &#224; une CHA avec la fonction hclust de
l&#8217;environnement d&#8217;analyse statistique R 16. La figure no 3 repr&#233;sente le dendrogramme produit par la CHA.
</p>
<p>Nous nous int&#233;resserons en particulier aux regroupements se situant haut dans la hi&#233;rarchie. Les clusters f et
g contiennent la majorit&#233; des documents traitant respectivement de collisions avec des oiseaux et de remises de
gaz. Plus pr&#232;s de la racine, les clusters a, b et c, contiennent les 10 documents choisies au hasard, c&#8217;est &#224; dire
les &#233;v&#233;nements anormaux que nous cherchons &#224; faire &#233;merger. Le cluster e est aussi int&#233;ressant, car il contient
six documents traitant &#224; la fois de collisions avec des oiseaux et de remises de gaz, autrement dit d&#8217;&#233;v&#233;nements
combinant plusieurs facteurs et par ce fait int&#233;ressants pour une analyse approfondie. Cette exp&#233;rience &#224; petite
&#233;chelle validant la faisabilit&#233; de la m&#233;thode, nous sommes actuellement en train d&#8217;explorer davantage cette voie
en vue d&#8217;un passage &#224; l&#8217;&#233;chelle en traitant des bases enti&#232;res.
</p>
<p>14. Nous avons r&#233;cemment rencontr&#233; ce cas de figure, lors de la d&#233;monstration de ces outils aux industrielles dans une grande usine
chimique. On voyait clairement les &#233;v&#233;nements concernant le incidents dus aux projections re&#231;ues dans les yeux en forte baisse depuis 2007,
ce qui, d&#8217;apr&#232;s notre interlocuteur refl&#233;tait l&#8217;effet positif de la campagne de sensibilisation au port de lunettes de protection, entreprise cette
m&#234;me ann&#233;e.
</p>
<p>15. Une remise de gaz est une proc&#233;dure d&#8217;urgence tr&#232;s courante lors de laquelle les pilotes d&#233;cident au dernier moment d&#8217;avorter un
atterrissage et de refaire un tour de l&#8217;a&#233;rodrome et une deuxi&#232;me tentative d&#8217;atterrissage.
</p>
<p>16. http://www.r-project.org/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 3 &#8211; Dendrograme des r&#233;sultats de la CHA
</p>
<p>3.4 Analyses linguistiques fines et pr&#233;curseurs de situations &#224; risque
</p>
<p>Parall&#232;lement aux m&#233;thodes bas&#233;es sur l&#8217;ensemble des donn&#233;es, mentionn&#233;es ci-dessus, nous nous sommes in-
t&#233;ress&#233; &#224; une autre particularit&#233; de certains donn&#233;s REX, ceux r&#233;dig&#233;s par les op&#233;rateurs eux m&#234;mes ; le statut
particulier de la place de l&#8217;auteur dans le texte. Nous avons remarqu&#233; que certains textes &#233;taient plus &#171; &#233;motion-
nellement charg&#233;s &#187; que d&#8217;autres. Au-del&#224; de produire un simple r&#233;cit neutre d&#8217;un &#233;v&#233;nement, certains auteurs
expriment des &#233;tats &#233;motionnels tels que le stress, le doute, la col&#232;re et la peur. Clairement identifiables d&#8217;un
point de vue linguistique, ces &#233;tats sont de v&#233;ritables indicateurs de situations potentiellement &#224; risque 17. De plus,
ayant identifi&#233; un risque r&#233;current et frustr&#233;s par sa non prise en compte, les acteurs manifestent souvent leur
m&#233;contentement dans leurs &#233;crits.
</p>
<p>Actuellement, en particulier gr&#226;ce au d&#233;veloppement du web 2.0, les travaux sur le th&#232;me du rep&#233;rage automa-
tique d&#8217;opinion et d&#8217;&#233;tats &#233;motionnels connaissent un d&#233;veloppement spectaculaire et de nombreuses techniques
innovantes voient le jour (Pang &amp; Lee, 2008).
</p>
<p>S&#8217;inspirant de certains travaux sur la subjectivit&#233;, nous employons une vari&#233;t&#233; de traits lexicaux (adverbes axiolo-
giques, pronoms &#224; la premi&#232;re personne etc..) syntaxiques (emploi du conditionnel) et typographiques 18 que nous
</p>
<p>17. Les pilotes, par exemple, font parfois part d&#8217;un doute ou encore d&#8217;une incompr&#233;hension d&#8217;une situation dans laquelle ils se sont trouv&#233;s.
Or la ma&#238;trise totale de la situation par les pilotes est d&#8217;une importance capitale pour la s&#233;curit&#233; du vol et toute source de doute est &#224; prendre
au s&#233;rieux, car elle peut indiquer soit une lacune dans la formation soit un probl&#232;me d&#8217;ordre organisationnel.
</p>
<p>18. En &#233;tudiant les textes en question nous avons remarqu&#233; des pratiques tels que l&#8217;usage des majuscules ou des r&#233;p&#233;titions de point</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>projetons sur les textes afin de les classer par degr&#233; de subjectivit&#233;. Les deux textes suivants, de la m&#234;me longueur
et issues de la m&#234;me base textuelle, illustrent cet axe, le premier faisant part de jugements personnels et &#233;crit &#224; la
premi&#232;re personne, contraste fortement avec le second, beaucoup plus technique et impersonnel.
</p>
<p>Rapport d&#8217;incident exprimant un niveau de subjectivit&#233; &#233;lev&#233; :
</p>
<p>LIAISON CASQUE ASSISTANT DEFICIENTE . [ REPORT ] . A l&#8217;arriv&#233;e , l&#8217;assistant est
inaudible , je lui demande de changer de casque avant le d&#233;part dans 1h30 . Lors
des pleins , il est toujours inaudible , le m&#233;cano X, pr&#233;sent au poste est &#233;tonn&#233;
car &#224; l&#8217;arriv&#233;e c&#8217;&#233;tait bon . Je lui explique que ce n&#8217;est pas le cas et que
j&#8217;avais d&#233;j&#224; demand&#233; l&#8217;&#233;change . Liaison parfaite avec m&#233;cano X pour le litrage
faisant penser &#224; un autre casque . Au d&#233;part , de nouveau inaudible , alors que
j&#8217;informe l&#8217;assistant de la situation , il l&#232;ve l&#8217;avion ( le BEACON est sur OFF!!
) . Il demande s&#8217;il peut pousser . Je redemande un changement de casque . Attente
7 &#8217; , rien n&#8217;est fait , avec une r&#233;ception &#224; 1/ 5 , nous poussons . A la fin je suis
oblig&#233; de demander 3 fois qu&#8217;il se d&#233;branche et me fasse signe . Manifestement ,
la liaison est d&#233;faillante dans les deux sens , alors que le casque du m&#233;cano X
fonctionnait parfaitement . -FIN- . [ ASR ] . En cas de probl&#232;me lors du P/ B ,
l&#8217;&#233;quipage n&#8217;a aucune chance de comprendre ce qu&#8217;il se passe!!! Pourquoi cette
inertie : on se contente de me dire &#171; yes , ok , ... &#171; et rien ne se passe ... Faut
-il un accident pour que l&#8217;escale de Y se conforme au r&#233;f&#233;rentiel . Quant &#224; la
qualit&#233; de mat&#233;riels ...
</p>
<p>Cet exemple montre plusieurs indices refl&#233;tant un &#233;tat &#233;motionnel du r&#233;dacteur, sur lesquels nous nous basons
pour classer ce document comme &#233;tant subjectif :
&#8211; emploi de la premi&#232;re personne
&#8211; emploi de constructions &#224; verbe modal (peut pousser)
&#8211; emploi de mots &#233;valuatifs n&#233;gatifs 19 (d&#233;faillante, inaudible, probl&#232;me, qualit&#233;, etc.)
&#8211; emploi de certains verbes refl&#233;tant des &#233;tats cognitifs (penser, &#233;tonner)
&#8211; emploi de signes de ponctuation r&#233;p&#233;t&#233;s (!!, ...)
Cette cat&#233;gorisation unidimensionnelle, sur l&#8217;axe subjectif/objectif, n&#8217;est que la premi&#232;re &#233;tape de cette facette
de nos recherches. Par la suite nous chercherons &#224; &#233;tablir un sch&#233;ma de cat&#233;gorisation plus fine et &#234;tre capables
de rep&#233;rer s&#233;par&#233;ment des &#233;tats tels que le stress, le doute, mais aussi des cas de figure comme des erreurs de
compr&#233;hension, de perception ou des lacunes dans les comp&#233;tences mentionn&#233;s par les r&#233;dacteurs.
</p>
<p>4 Conclusion
</p>
<p>Nous venons de pr&#233;senter nos travaux sur l&#8217;analyse automatique de bases de REX. Le domaine de la s&#251;ret&#233;
industrielle, l&#8217;analyse et l&#8217;exploitation des donn&#233;es textuelles issues de ces bases repr&#233;sentent un champ, qui, &#224;
notre connaissance, n&#8217;a jamais b&#233;n&#233;fici&#233; de solutions utilisant des m&#233;thodes du TAL, m&#233;thodes que, nous venons
de d&#233;montrer, peuvent r&#233;ponde &#224; une s&#233;rie de besoins exprim&#233;s dans ce secteur. De plus, nous sommes convaincus
que, compte tenu de la dynamique actuelle, incitant d&#8217;un cot&#233; l&#8217;accroissement de la production de donn&#233;es tout
autant que leur partage entre institutions les besoins d&#8217;outils sp&#233;cialement adapt&#233;s se sentiront davantage.
</p>
<p>Pour le TAL, un nombre de nouveaux d&#233;fis se pr&#233;sentent. Un large &#233;ventail de techniques d&#233;j&#224; connues devra &#234;tre
adapt&#233; &#224; ce nouveau mat&#233;riau bien particulier. Des aspects comme le flux constant de nouveaux documents et le
langage tr&#232;s sp&#233;cialis&#233;, mais aucunement contraint, dans lequel sont r&#233;dig&#233;s la plupart d&#8217;eux, doivent &#234;tre pris en
compte. Enfin, le param&#232;tre temporel, &#233;tant essentiel pour la ma&#238;trise du risque dans un contexte dynamique, doit
&#233;galement occuper une place centrale dans toute approche visant &#224; automatiser une partie de ce processus.
</p>
<p>d&#8217;exclamation ou d&#8217;interrogation.
19. nous utilisons le &#171; lexique de l&#8217;&#233;valuation &#187;, d&#233;velopp&#233; par l&#8217;&#233;quipe TALN au laboratoire LINA &#224; l&#8217;universit&#233; de Nantes, que nous avons
</p>
<p>adapt&#233; &#224; nos besoins notamment en rajoutant certains mots comme &#171; qualit&#233; &#187; dont nous avons v&#233;rifi&#233; le comportement axiologique dans notre
corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>AH-PINE J., LEMOINE J. &amp; BENHADDA H. (2005). Un nouvel outil de classification non supervis&#233;e de docu-
ments pour la d&#233;couverte de connaissances et la d&#233;tection de signaux faibles : Rares texttm. In Journ&#233;e sur les
syst&#232;mes d&#8217;information &#233;labor&#233;s, &#206;le Rousse.
</p>
<p>ANSOFF I. (1975). Managing strategic surprise by response to weak signals. California Management Review,
18(2), 21&#8211;33.
ARAMPATZIS A., VAN DER WEIDE T. P., KOSTER C. H. A. &amp; VAN BOMMEL P. (2000). An evaluation of
linguistically-motivated indexing schemes. In Proceedings of the 22nd bcs-irsg colloquium on IR research.
</p>
<p>CHANDOLA V., BANERJEE A. &amp; KUMAR V. (2009). Anomaly detection : A survey. ACM Computing Surveys
(CSUR), 41(3), 15.
HERMANN E., LEBLOIS S., MAZEAU M., BOURIGAULT D., FABRE C., TRAVADEL S., DURGEAT P. &amp; NOU-
VEL D. (2008). Outils de Traitement Automatique des Langues appliqu&#233;s aux comptes rendus d&#8217;incidents et
d&#8217;accidents. In 16e Congr&#232;s de Ma&#238;trise des Risques et de S&#251;ret&#233; de Fonctionnement, Avignon.
</p>
<p>JONES K. (2004). A statistical interpretation of term specificity and its application in retrieval. Journal of
documentation, 60(5), 493&#8211;502.
LESCA H. &amp; BLANCO S. (2002). Contribution &#224; la capacit&#233; d&#8217;anticipation des entreprises par la sensibilisation
aux signaux faibles. In Congres International Francophone sur les PME 6eme &#233;dition, p. 10&#8211;1.
</p>
<p>MACRAE C. (2010). Constructing near misses : Proximity, distance and the space between. Risk&amp;Regulation.
</p>
<p>MATTHEWS M., TOLCHINSKY P., BLANCO R., ATSERIAS J., MIKA P. &amp; ZARAGOZA H. (2010). Searching
through time in the New York Times. In HCIR Challenge 2010.
</p>
<p>MCQUITTY L. (1966). Similarity analysis by reciprocal pairs for discrete and continuous data. Educational and
Psychological Measurement, 26(4), 825.
PANG B. &amp; LEE L. (2008). Opinion mining and sentiment analysis. Foundations and Trends in Information
Retrieval, 2(1-2), 1&#8211;135.
RASMUSSEN J. (1997). Risk management in a dynamic society : a modelling problem. Safety science, 27(2-3),
183&#8211;213.
</p>
<p>SRIVASTAVA A. N. &amp; ZANE-ULMAN B. (2005). Discovering recurring anomalies in text reports regarding
complex space systems. In Proceedings of the 2005 IEEE Aerospace Conference.
</p>
<p>TC (2001). An introduction to safety management systems. Transport Canada.</p>

</div></div>
</body></html>