<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Rep&#233;rer les phrases &#233;valuatives dans les articles de presse &#224; partir d&#8217;indices et de st&#233;r&#233;otypes d&#8217;&#233;criture</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>Rep&#233;rer les phrases &#233;valuatives dans les articles de presse &#224; partir 
d&#8217;indices et de st&#233;r&#233;otypes d&#8217;&#233;criture  
</p>
<p>Mathias Lambert 
</p>
<p>Universit&#233; Paris IV-Sorbonne, Laboratoire STIH (LaLIC) - 28 rue Serpente, 75006 Paris 
Mathias.Lambert@paris-sorbonne.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233;. Ce papier pr&#233;sente une m&#233;thode de recherche des phrases &#233;valuatives dans les articles 
de presse &#233;conomique et financi&#232;re &#224; partir de marques et d&#8217;indices st&#233;r&#233;otyp&#233;s, propres au style 
journalistique, apparaissant de mani&#232;re concomitante &#224; l&#8217;expression d&#8217;&#233;valuation(s) dans les 
phrases. Ces marques et indices ont &#233;t&#233; d&#233;gag&#233;s par le biais d&#8217;une annotation manuelle. Ils ont 
ensuite &#233;t&#233; impl&#233;ment&#233;s, en vue d&#8217;une phase-test d&#8217;annotation automatique, sous forme de 
grammaires DCG/GULP permettant, par filtrage, de matcher les phrases les contenant. Les 
r&#233;sultats de notre premi&#232;re tentative d&#8217;annotation automatique sont pr&#233;sent&#233;s dans cet article. 
Enfin les perspectives offertes par cette m&#233;thode relativement peu co&#251;teuse en ressources (&#224; base 
d&#8217;indices non intrins&#232;quement &#233;valuatifs) font l&#8217;objet d&#8217;une discussion. 
</p>
<p>Abstract. This paper presents a method to locate evaluative sentences in financial and economic 
newspapers, relying on marks and stereotyped signs. Peculiar to journalese, these are present 
concomitantly with the expression of evaluation(s) in sentences. These marks or signs have been 
found by means of a manual annotation. Then, in preparation for an automatic annotation phase, 
they have been implemented in the form of DCG/GULP grammars which, by filtering, allows to 
locate the sentences containing them. The results of our first automatic annotation attempt are 
shown in this article. Furthermore, the prospects offered by this method, which relies on non-
intrinsically evaluative marks and therefore does not require long lists of lexical resources, are 
discussed. 
</p>
<p>Mots-cl&#233;s : Opinion, &#233;valuation, rep&#233;rage de phrases &#233;valuatives, presse &#233;conomique et 
financi&#232;re, style journalistique, indices/marques/st&#233;r&#233;otypes d&#8217;&#233;criture.   
Keywords: Opinion, appraisal, detection of evaluative sentences, financial and economic 
newspapers, journalese, writing signs/marks/stereotypes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATHIAS LAMBERT 
 
</p>
<p>1 Le rep&#233;rage automatique d&#8217;&#233;valuation : un th&#232;me de recherche strat&#233;gique d&#8217;actualit&#233; 
</p>
<p>Au cours des dix derni&#232;res ann&#233;es, le nombre de travaux, aussi bien &#224; vis&#233;es acad&#233;miques qu&#8217;&#224; vis&#233;es 
industrielles, ayant pour th&#232;me la recherche informatis&#233;e des opinions, des &#233;valuations, des attitudes, des 
sentiments ou des &#233;motions exprim&#233;es dans les documents textuels a augment&#233; de mani&#232;re significative. 
L&#8217;int&#233;r&#234;t croissant que suscite ce th&#232;me atteste d&#8217;un r&#233;el besoin, notamment dans le domaine de la veille 
&#233;conomique. Avec internet, la quantit&#233; de donn&#233;es disponibles (notamment dans le domaine de la presse) &#224; 
traiter est aujourd&#8217;hui trop volumineuse pour un analyste humain seul. La demande d&#8217;outils informatiques de 
rep&#233;rage ou d&#8217;aide au rep&#233;rage des segments porteurs d&#8217;&#233;valuation est donc tr&#232;s forte, car au c&#339;ur d&#8217;enjeux 
strat&#233;giques et &#233;conomiques importants.  
</p>
<p>La plupart des travaux actuels se limitent souvent &#224; la simple d&#233;termination de polarit&#233;s (positive, n&#233;gative 
ou neutre) et n'arrivent &#224; capter que partiellement les ph&#233;nom&#232;nes vis&#233;s qui recouvrent pourtant des 
significations riches, diversifi&#233;es et souvent complexes. Le but de notre recherche, qui s&#8217;inscrit plus 
largement au sein du projet ANR OntOpiTex1, est d&#8217;avancer dans le domaine en cherchant &#224; identifier, &#224; 
agr&#233;ger et &#224; caract&#233;riser finement des segments textuels porteurs d'opinions, en fonction de plusieurs crit&#232;res 
(valeur s&#233;mantique, source, intensit&#233; et force, type d'objet &#233;valu&#233;...). Le pr&#233;sent article d&#233;crit une &#233;tude 
exploratoire visant &#224; d&#233;couvrir et &#224; mettre en &#339;uvre de nouvelles m&#233;thodes pour d&#233;tecter les &#233;valuations 
dans les textes. Nous avons cherch&#233;, &#224; partir d&#8217;une annotation manuelle sur un corpus d&#8217;articles de la presse 
&#233;conomique tir&#233;s du web, &#224; mettre au jour des indices textuels et lexicaux r&#233;currents voire st&#233;r&#233;otyp&#233;s 
apparaissant de mani&#232;re concomitante &#224; l&#8217;expression (ou au relais) d&#8217;&#233;valuation(s). Ces indices ont ensuite 
&#233;t&#233; regroup&#233;s dans une dizaine de cat&#233;gories, en fonction de crit&#232;res syntaxiques et s&#233;mantiques. Une 
premi&#232;re impl&#233;mentation, &#224; l&#8217;aide de la plateforme SemioLabs2, sous forme de grammaires locales 
d&#8217;unification a alors permis de tester, sur un nouveau corpus d&#8217;articles issus de la presse &#233;conomique, la 
fiabilit&#233; des indices, et par la m&#234;me la pertinence de notre m&#233;thode. Le principal int&#233;r&#234;t de notre approche 
est que, contrairement aux autres travaux dans le domaine, elle est relativement peu co&#251;teuse en ressources 
lexicales. Nous n&#8217;avons en effet pas eu &#224; constituer de longues listes de ressources lexicales &#233;valuatives 
(adjectifs, adverbes et/ou verbes).  
</p>
<p>1.1 Concept et domaine 
</p>
<p>Opinion, subjectivit&#233;, &#233;valuation, attitude, jugement, appr&#233;ciation, sentiment, &#233;motion, affect, &#8230;, la 
prolif&#233;ration des termes pour nommer le concept semble, d&#8217;une part, r&#233;v&#233;latrice de la difficult&#233; qu&#8217;ont les 
auteurs &#224; l&#8217;appr&#233;hender et &#224; le manipuler, et d&#8217;autre part, fortement li&#233;e &#224; la diversit&#233; des travaux dans le 
domaine. De mani&#232;re g&#233;n&#233;rale, les travaux en TAL relatifs au ph&#233;nom&#232;ne de l'&#233;valuation sont en majorit&#233; 
ceux traitant de la fouille d'opinion et de l'analyse de sentiments. Ils s'inscrivent dans trois grandes 
cat&#233;gories : (i) la constitution de ressources lexicales pour la fouille d'opinion ; (ii) la classification de textes 
et/ou de phrases (objectif vs subjectif et/ou positif vs n&#233;gatif) ; (iii) l&#8217;analyse d'opinion dans les textes. Pour 
un &#233;tat de l&#8217;art complet et d&#233;taill&#233; de la question en TAL, voir (Pang et Lee, 2008). 
</p>
<p>Le travail pr&#233;sent&#233; ici s&#8217;inscrit dans la deuxi&#232;me cat&#233;gorie : la classification de phrases (objectives vs 
subjectives). Pour &#234;tre plus pr&#233;cis, il s&#8217;agit de rep&#233;rage de phrases subjectives dans les textes. Pour faire 
r&#233;f&#233;rence &#224; ces phrases, nous parlerons de phrases &#233;valuatives. Cette appellation nous &#233;vitera de fait d&#8217;avoir 
&#224; aborder la question d&#233;licate de la d&#233;limitation des segments &#233;valuatifs. Quant &#224; la probl&#233;matique 
concernant ce qu&#8217;il faut consid&#233;rer comme &#233;tant &#233;valuatif ou non, nous la discuterons plus bas, dans la 
partie ayant trait &#224; l&#8217;annotation. 
</p>
<p>1.2 M&#233;thode 
</p>
<p>La m&#233;thode la plus triviale pour rep&#233;rer des phrases &#233;valuatives consiste &#224; constituer manuellement (avec 
possibilit&#233; d&#8217;enrichissement semi-automatique) une liste de lexique &#233;valuatif (principalement &#224; base 
d&#8217;adjectifs et d&#8217;adverbes) et de projeter ce lexique sur les textes. [Bloom et al, 2007a] et [Bloom et al, 
                                                          
</p>
<p>1
 Projet soutenu par l&#8217;ANR (2009 CORD 016) ; site : https://ontopitex.greyc.fr/ 
</p>
<p>2
 D&#233;velopp&#233;e par la soci&#233;t&#233; Noopsis : www.noopsis.fr/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>REPERER LES PHRASES EVALUATIVES DANS LES ARTICLES DE PRESSE A PARTIR D&#8217;INDICES ET DE STEREOTYPES 
D&#8217;ECRITURE 
</p>
<p> 
</p>
<p>2007b] proc&#232;dent de cette mani&#232;re3 pour extraire les phrases porteuses d&#8217;opinion, et les pr&#233;sentent dans un 
navigateur (Appraisal Navigator) qui offre &#224; l&#8217;utilisateur la possibilit&#233; d&#8217;attribuer une &#233;tiquette aux phrases 
en fonction de cat&#233;gories propres &#224; la th&#233;orie de l&#8217;Appraisal de (Martin et White, 2005). 
Certains auteurs, comme (Wiebe et al., 2002) et (Wiebe et al., 2005), en s&#8217;appuyant sur une liste d&#8217;&#233;l&#233;ments 
subjectifs (SE) r&#233;colt&#233;s &#224; la suite d&#8217;une annotation manuelle, proposent de rechercher automatiquement dans 
les phrases des &#233;l&#233;ments potentiellement subjectifs ou PSE (hapax, collocations, adjectifs et verbes ayant 
des similarit&#233;s distributionnelles avec des SE) et de d&#233;cider ensuite si leur potentiel subjectif s&#8217;actualise ou 
pas en fonction de la densit&#233; de SE pr&#233;sents dans le cotexte. Ces travaux sont relativement proches de ceux 
de (Riloff et Wiebe 2003) qui utilisent une m&#233;thode de bootstrapping, o&#249; des phrases &#233;tiquet&#233;es &#233;valuatives 
sont utilis&#233;es comme donn&#233;es d'apprentissage, pour produire automatiquement des modalit&#233;s repr&#233;sentant 
des expressions subjectives et ainsi diff&#233;rencier les phrases objectives des phrases subjectives. 
</p>
<p>D&#8217;autres, comme (Yu et Hatzivassiloglou, 2003) qui s&#8217;int&#233;resse &#224; la classification de phrases et de 
propositions pour distinguer les opinions des faits dans un syst&#232;me de Question/R&#233;ponse, s&#8217;appuient 
essentiellement sur des techniques statistiques (approche par similarit&#233;, classifieur bay&#233;sien na&#239;f, classifieur 
bay&#233;sien na&#239;f multiple). 
</p>
<p>Notre m&#233;thode se distingue des pr&#233;c&#233;dentes dans la mesure o&#249; nous n&#8217;avons pas constitu&#233; de listes de 
ressources lexico-grammaticales &#233;valuatives ni utilis&#233; de proc&#233;d&#233;s statistiques pour d&#233;tecter les phrases 
porteuses d&#8217;&#233;valuation(s). Notre id&#233;e est n&#233;e d&#8217;une constatation suite &#224; l&#8217;annotation manuelle. Etant donn&#233; 
que l&#8217;&#233;criture journalistique se trouve soumise &#224; de fortes contraintes (souci d&#8217;objectivisation, concision, 
clart&#233;, &#8230;), le journaliste a tendance &#224; recourir &#224; des tours sp&#233;cifiques (formes morphosyntaxiques et/ou 
syntaxiques, marques rh&#233;toriques ou emphatiques) r&#233;currents lorsqu&#8217;il cherche &#224; att&#233;nuer/dissimiler une 
&#233;valuation. Ces formes, qui trahissent une certaine subjectivit&#233;, peuvent alors &#234;tre consid&#233;r&#233;es comme des 
indices ou des sympt&#244;mes attestant de la pr&#233;sence d&#8217;&#233;valuations. 
</p>
<p>2 Annotation, observations et hypoth&#232;se, exp&#233;rience 
</p>
<p>2.1 Annotation 
</p>
<p>Cette t&#226;che a &#233;t&#233; r&#233;alis&#233;e manuellement sur un corpus de 36 articles de presse &#233;conomique collect&#233;s &#224; partir 
de la base documentaire Factiva. Ces articles, r&#233;partis par groupes de 6, concernaient 6 entreprises/domaines 
(Apple, EDF-ENR, Goldman Sachs, Google, Total, les laboratoires pharmaceutiques). Pour distinguer ce 
qui est de l&#8217;ordre de l&#8217;&#233;valuation de ce qui est du contenu factuel, nous nous sommes donn&#233; un crit&#232;re 
simple : &#171; si nous &#233;tions un investisseur, un analyste &#233;conomique, ou tout autre type de partie prenante (au 
sens de &#8216;stakeholder&#8217;), quels &#233;l&#233;ments seraient susceptibles de nous int&#233;resser ? (&#171; Is this relevant for my 
goals/needs? &#187; (Bednarek, 2009, p.158)) &#187;. Ci-dessous quelques exemples de phrases relev&#233;es : 
</p>
<p>&#8226; C'est un troph&#233;e que Christophe de Margerie peut se r&#233;jouir de perdre. (01total) 
</p>
<p>&#8226; &#171; Les gens sont exc&#233;d&#233;s par cette attente &#187;, explique Patrice Leclaire, d&#233;l&#233;gu&#233; syndical Force 
ouvri&#232;re. (04total) 
</p>
<p>&#8226; Mais ce rendez-vous incontournable des fans de la pomme, s'illustre, pour sa 25e &#233;dition, par 
l'absence d'Apple... (08apple) 
</p>
<p>&#8226; Le dieu de la finance semble s'&#234;tre transform&#233; en diable. (15glodmansachs) 
</p>
<p>&#8226; Pas facile de concilier morale et commerce, surtout en Chine... (21google) 
</p>
<p>&#8226; Certaines questions auraient d&#251; &#234;tre pos&#233;es. (27labopharma) 
</p>
<p>&#8226; Gare aux d&#233;sillusions en bourse ! (32EDFENR) 
</p>
<p>                                                          
</p>
<p>3
 En s&#8217;appuyant sur la th&#233;orie Appraisal de (Martin et White, 2005) pour construire le lexique </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATHIAS LAMBERT 
 
</p>
<p>2.2 Observations et hypoth&#232;se 
</p>
<p>A partir des phrases &#233;valuatives relev&#233;es (plus de 300), les marques/indices ont &#233;t&#233; regroup&#233;s en 11 
groupes/types se voulant syntaxiquement et/ou s&#233;mantiquement homog&#232;nes et coh&#233;rents :  
</p>
<p>1. Citation-Mise en relief (exemples d&#8217;indices : &#171; &#187;, &#8243; &#8243;, d&#8217;apr&#232;s, selon) ; 
</p>
<p>2. Conjecture (exemples d&#8217;indices : verbes au conditionnel, verbes au futur simple, peut-&#234;tre, sans 
doute, Reste (adv)*4 &#224; voir/savoir/attendre). En effet d&#8217;apr&#232;s (Wiebe et Wilson, 2002, p.112) : 
&#171; Subjectivity in natural language refers to aspects of language used to express emotion, 
evaluation and speculation &#187; ;  
</p>
<p>3. Constat (exemples d&#8217;indices : force est de, somme toute, en d&#233;finitive, bref, finalement) ; 
</p>
<p>4. Opposition-Concession (exemples d&#8217;indices : mais, pourtant, n&#233;anmoins, toutefois, en revanche) ; 
</p>
<p>5. Construction attributive (exemples d&#8217;indices : verbes attributifs et assimil&#233;s). De fait, d&#8217;apr&#232;s 
(Wagner et Pinchon, 1962, p.147) : &#171; l&#8217;attribut fait partie d&#8217;une phrase o&#249; l&#8217;on pose un jugement 
pr&#233;dicatif. Il &#233;voque une qualit&#233; qu&#8217;on reconna&#238;t appartenir &#224; une personne, &#224; une chose, qu&#8217;on 
leur attribue. &#187; 
</p>
<p>6. Phrase averbale (exemples d&#8217;indices : absence de verbe conjugu&#233;) ; 
</p>
<p>7. Qualit&#233; :(exemples d&#8217;indices : principal/premier/deuxi&#232;me/second atout/avantage/point positif, ne 
manque (adv)?5 pas de) ; 
</p>
<p>8. Rang (exemples d&#8217;indices : le g&#233;ant/champion/leader (adj)* (de)?) ; 
</p>
<p>9. Subjectivit&#233; journalistique affleurante (exemples d&#8217;indices : !, ?, utilisation de &#8216;on&#8217; hors de 
citations). En effet, d&#8217;apr&#232;s (Wiebe et Wilson, 2002, p.113) : &#171; some expressions such as ! are 
subjective in all contexts. &#187;. Cette cat&#233;gorie, un peu plus g&#233;n&#233;rale que les autres, a permis de 
regrouper certains ph&#233;nom&#232;nes ; 
</p>
<p>10. Tournure emphatique (exemples d&#8217;indices : ce qui frappe le plus c&#8217;est, c&#8217;est... qui) ; 
</p>
<p>11. Volont&#233;/Strat&#233;gie (exemples d&#8217;indices : verbes vouloir/souhaiter/pr&#233;f&#233;rer). 
</p>
<p>Sur ces 11 groupes, 8 (Citation, Conjecture, Constat, Opposition-Concession, Phrase attributive, Phrase 
averbale, Subjectivit&#233; journalistique affleurante, et Tournure emphatique) sont directement li&#233;s au style 
d&#8217;&#233;criture. L&#8217;hypoth&#232;se qui d&#233;coule de cette observation est donc la suivante : dans un corpus d&#8217;articles 
journalistiques, des marques/indices non intrins&#232;quement &#233;valuatifs et propres au style d&#8217;&#233;criture 
journalistique (i.e., des st&#233;r&#233;otypes6) peuvent aider, par leur pr&#233;sence r&#233;currente et concomitante aux 
&#233;valuations, &#224; rep&#233;rer des phrases &#233;valuatives. 
</p>
<p>2.3 Exp&#233;rience 
</p>
<p>Pour tester cette hypoth&#232;se, une impl&#233;mentation, sous forme de grammaires locales, des 8 cat&#233;gories cit&#233;es 
plus haut a &#233;t&#233; r&#233;alis&#233;e &#224; l&#8217;aide de la plateforme SemioLabs. Cette derni&#232;re est une plateforme g&#233;n&#233;rique 
pour le d&#233;veloppement d&#8217;applications TAL d&#233;velopp&#233;e par la soci&#233;t&#233; Noopsis pour son usage interne. 
Noopsis a mis cet outil &#224; notre disposition dans le cadre du projet Ontopitex. L&#8217;int&#233;r&#234;t de la plateforme 
SemioLabs est qu&#8217;elle fonctionne de mani&#232;re modulaire par articulation de composants de traitement plus 
ou moins ind&#233;pendants parmi lesquels un tokeniseur et un tagger int&#233;gr&#233;s. Notre travail d&#8217;impl&#233;mentation a 
donc pu &#234;tre r&#233;duit &#224; l&#8217;&#233;criture de grammaires locales (DCG/GULP) permettant, par filtrage, de rep&#233;rer les 
                                                          
</p>
<p>4
 Notations issues des expressions rationnelles : (X)* = z&#233;ro, une, deux ou plusieurs fois X 
</p>
<p>5
 Notations issues des expressions rationnelles : (X)? = z&#233;ro ou une seule fois X 
</p>
<p>6
 Le sens premier de ce terme peut &#234;tre &#233;clairant &#224; ce sujet : m&#233;thode en imprimerie, au XIX&#232;me si&#232;cle, 
</p>
<p>permettant la reproductibilit&#233; en masse d&#8217;un mod&#232;le fixe. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>REPERER LES PHRASES EVALUATIVES DANS LES ARTICLES DE PRESSE A PARTIR D&#8217;INDICES ET DE STEREOTYPES 
D&#8217;ECRITURE 
</p>
<p> 
</p>
<p>phrases contenant les marques/indices sp&#233;cifiques dont nous avons parl&#233; plus haut. Un total d&#8217;environ 200 
r&#232;gles (pour l&#8217;ensemble des 8 grammaires) a vu le jour. Comme SemioLabs offre la possibilit&#233; d&#8217;associer 
chaque grammaire &#224; un module sp&#233;cifique d&#8217;annotation pouvant fonctionner individuellement, nous avons 
ensuite pu observer le r&#233;sultat de l&#8217;annotation pour chaque grammaire, i.e. pour chacune des cat&#233;gories 
d&#8217;indices. Cette annotation automatique a &#233;t&#233; men&#233;e sur un nouveau corpus de 20 articles de presse 
&#233;conomique r&#233;colt&#233;s &#224; partir de Factiva et concernant Airbus-Boeing (10 textes) et les Cleantechs (10 
textes). En parall&#232;le, les 20 articles ont &#233;galement &#233;t&#233; annot&#233;s manuellement par nos soins pour fournir une 
premi&#232;re base de comparaison. 
</p>
<p>3 R&#233;sultats et conclusion 
</p>
<p>La pertinence de chaque type de marques (i.e. dans quelle mesure chacun de ces types de marques appara&#238;t 
de mani&#232;re concomitante &#224; l&#8217;expression d&#8217;&#233;valuation(s) ?) a &#233;t&#233; &#233;valu&#233;e. On peut parler d&#8217;un calcul de la 
pr&#233;cision Pi de chacun des types de marques i, selon la formule suivante : 
P i=
</p>
<p>nombre de phrases &#233;valuativescontenant au moins une marque de type i correctement rep&#233;r&#233;es par le syst&#232;me
nombre total de phrases contenant au moinsune marque de type i rep&#233;r&#233;es par le syst&#232;me
</p>
<p>Le calcul du rappel (i.e. le nombre de phrases &#233;valuatives contenant au moins une marque de type i 
correctement rep&#233;r&#233;es par le syst&#232;me / le nombre total de phrases &#233;valuatives contenant au moins une 
marque de type i pr&#233;sentes dans le corpus) a fait appara&#238;tre des taux entre 0,9 et 1. Deux interpr&#233;tations 
coexistent : le silence est infime car i) les grammaires ont une excellente couverture et/ou ii) parce que 
l&#8217;&#233;valuation n&#8217;est pas totalement objective (cf &#167;2 du 3.2).  
 
</p>
<p>3.1 D&#233;tail des r&#233;sultats pour la pr&#233;cision Pi 
</p>
<p>Pour chaque type de marques des tableaux7 r&#233;capitulatifs d&#233;taill&#233;s (un pour chacun des 20 articles du 
corpus) ont &#233;t&#233; constitu&#233;s. Ci-dessus un tableau r&#233;capitulant la pr&#233;cision obtenue pour chacun des types 
d&#8217;indices/marques sur l&#8217;ensemble des 20 textes : 
</p>
<p>Type i de marques Pi
 
</p>
<p>Citation-Mise en relief 0,698 
Conjecture 0,807 
</p>
<p>Constat 0,912 
Opposition-Concession 0,951 
</p>
<p>Construction attributive #1 (verbe &#8216;&#234;tre&#8217; pris en compte) 0,592 
Construction attributive #2 (verbe &#8216;&#234;tre non pris en compte) 0,879 
</p>
<p>Phrase averbale 0,950 
Subjectivit&#233; journalistique affleurante 0,972 
</p>
<p>Tournure emphatique 0,967 
Tableau 1 : R&#233;sultats du calcul de la pr&#233;cision pour chaque type de marques 
</p>
<p>A l&#8217;exception des marques de type Citation-Mise en relief et celles de type Construction attributive #1, on 
constate que, dans l&#8217;ensemble, le bruit est tr&#232;s faible, donc que les marques sont plut&#244;t de bons, voire de tr&#232;s 
bons, jalons pour rep&#233;rer les &#233;valuations.  
</p>
<p>Concernant la cat&#233;gorie Citation-Mise en relief, des phrases comme &#8216;En plus de l'espace &#171; Recherche et 
financement &#187;, Pollutec organise la convention d'affaires internationale B2Fair.&#8216; (02CleanTech), contenant 
entre guillemets des sp&#233;cifications de noms concourent &#224; faire baisser la pr&#233;cision. Quant au r&#233;sultat moyen 
concernant la cat&#233;gorie Construction attributive #1, l&#8217;analyse des indices de type Construction attributive #2 
montre que la copule &#8216;&#234;tre&#8217; est une source importante de bruit. Une phrase comme &#8216;on est ici dans la r&#233;gion 
de Seattle .&#8217; (01AirbusBoeing) a &#233;t&#233; relev&#233;e alors que, d&#8217;une part, il ne s&#8217;agit pas d&#8217;une phrase attributive et 
                                                          
</p>
<p>7
 Que par manque de place nous ne pouvons faire figurer dans cet article. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATHIAS LAMBERT 
 
</p>
<p>que, d&#8217;autre part, elle ne porte aucune &#233;valuation. De m&#234;me les phrases passives (&#8216;180 A320 ont &#233;t&#233; 
command&#233;s par IndiGo, 60 autres par Virgin Atlantic.&#8217; (06AirbusBoeing)) ou avec des verbes dont les 
temps compos&#233;s se forment avec l&#8217;auxiliaire &#8216;&#234;tre&#8217; (&#8216;L'&#233;v&#233;nement annuel 'Materials Day' s'est tenu fin avril 
&#224; l'Institut de Thermotechnique (sciences appliqu&#233;es) de la KULeuven.&#8217; (06CleanTech)) ont occasionn&#233; du 
bruit. 
</p>
<p>3.2 Conclusion et perspectives 
</p>
<p>Loin d&#8217;&#234;tre une &#233;valuation dont on puisse tirer des r&#233;sultats cat&#233;goriques, cette petite exp&#233;rience de rep&#233;rage 
automatique nous a permis i) d&#8217;effectuer quelques petits r&#233;glages au niveau des grammaires locales pour 
&#233;viter des erreurs grossi&#232;res, et ii) d&#8217;obtenir un premier retour, plut&#244;t encourageant, quant &#224; la pertinence de 
notre hypoth&#232;se. Globalement, s&#8217;appuyer sur des marques non-intrins&#232;quement &#233;valuatives, r&#233;currentes dans 
le discours journalistique, et apparaissant concomitamment &#224; des &#233;valuations semble une m&#233;thode 
prometteuse. Peu co&#251;teuse en ressources et relativement simple &#224; mettre en &#339;uvre, cette m&#233;thode 
permettrait d&#8217;offrir une solution concr&#232;te &#224; une probl&#233;matique compl&#232;tement d&#8217;actualit&#233; car en prise avec 
des enjeux sensibles et strat&#233;giques.   
</p>
<p>La prochaine &#233;tape dans notre recherche devrait consister &#224; nous procurer un corpus annot&#233; par un analyste 
(ou tout autre partie prenante) afin de pouvoir mener une &#233;valuation compl&#232;te (pr&#233;cision et rappel) et 
pleinement objective (car bas&#233;e sur des donn&#233;es d&#8217;annotation ind&#233;pendantes). 
</p>
<p>Nous envisageons &#233;galement par la suite de fournir, de mani&#232;re automatique, pour chaque phrase rep&#233;r&#233;e 
par le syst&#232;me, un indice de fiabilit&#233; bas&#233; sur la densit&#233; d&#8217;indices/marques pr&#233;sents dans la phrase. Cette 
id&#233;e repose sur l&#8217;hypoth&#232;se que plus une phrase contient d&#8217;indices/marques r&#233;currentes dans le discours 
journalistique et apparaissant concomitamment &#224; des &#233;valuations, plus la probabilit&#233; qu&#8217;on ait &#224; faire &#224; une 
phrase &#233;valuative est forte. La validit&#233; d&#8217;une telle hypoth&#232;se devra &#234;tre d&#233;montr&#233;e par une &#233;tude concr&#232;te. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BEDNAREK M. (2009). Dimensions of evaluation: cognitive and linguistic perspectives. Pragmatics &amp; 
Cognition 17/1: 146-175. 
</p>
<p>BLOOM K., GARG N., ARGAMON S. (2007 a). Extracting Appraisal Expressions, HLT/NAACL 2007. 
</p>
<p>BLOOM K., STEIN N., ARGAMON S. (2007 b). Appraisal Extraction for News Opinion Analysis, NTCIR6 
2007. 
</p>
<p>MARTIN J. R., WHITE P. R. R. (2005). The Language of Evaluation : Appraisal in English, New York and 
London : Palgrave McMillan. 
</p>
<p>PANG B., LEE L. (2008). Opinion Mining and Sentiment Analysis. In Fondations and Trends in Information 
Retrieval, Vol 2, pp 1&#8211;135. 
</p>
<p>RILOFF E., WIEBE J. (2003). Learning Extraction Patterns for Subjective Expressions in Proceedings of the 
2003 Conference on Empirical Methods in Natural Language Processing (EMNLP-2003), pp 105&#8211;112, 
Sapporo, Japan. ACL. 
</p>
<p>WAGNER R.L., PINCHON J. (1962). Grammaire du fran&#231;ais classique et moderne, Paris : Hachette 
Universit&#233;. 
</p>
<p>WIEBE J., WILSON T., CARDIE C. (2005). Annotating Expressions of Opinions and Emotions in Language. 
Language Resources and Evaluation, vol. 39, issue 2-3, pp 165&#8211;210. 
 
</p>
<p>WIEBE J., WILSON T. (2002). Learning to disambiguate potentially subjective expressions. In Proceedings of 
CoNLL-2002, Taipei, Taiwan. 
</p>
<p>YU H., HATZIVASSILOGLOU V. (2003). Towards Answering Opinion Questions: Separating Facts from 
Opinions and Identifying the Polarity of Opinion Sentences. In Proceedings of the 2003 Conference on 
Empirical Methods in Natural Language Processing (EMNLP 2003), Sapporo, Japan. pp 129&#8211;136. ACL. </p>

</div></div>
</body></html>