<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse de l&#8217;ambigu&#239;t&#233; des requ&#234;tes utilisateurs par cat&#233;gorisation th&#233;matique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Analyse de l&#8217;ambigu&#239;t&#233; des requ&#234;tes utilisateurs par cat&#233;gorisation
th&#233;matique
</p>
<p>Fanny Lalleman1, 2
</p>
<p>(1) CLLE &amp; CNRS, 5, all&#233;es Antonio Machado 31058 Toulouse Cedex 9
(2) Orange Labs, 2, Avenue Pierre Marzin 22307 Lannion Cedex
</p>
<p>fanny.lalleman@univ-tlse2.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous cherchons &#224; identifier la nature de l&#8217;ambigu&#239;t&#233; des requ&#234;tes utilisateurs issues
d&#8217;un moteur de recherche d&#233;di&#233; &#224; l&#8217;actualit&#233;, 2424actu.fr, en utilisant une t&#226;che de cat&#233;gorisation. Dans un premier
temps, nous verrons les diff&#233;rentes formes de l&#8217;ambigu&#239;t&#233; des requ&#234;tes d&#233;j&#224; d&#233;crites dans les travaux de TAL. Nous
confrontons la vision lexicographique de l&#8217;ambigu&#239;t&#233; &#224; celle d&#233;crite par les techniques de classification appliqu&#233;es
&#224; la recherche d&#8217;information. Dans un deuxi&#232;me temps, nous appliquons une m&#233;thode de cat&#233;gorisation th&#233;matique
afin d&#8217;explorer l&#8217;ambigu&#239;t&#233; des requ&#234;tes, celle-ci nous permet de conduire une analyse s&#233;mantique de ces requ&#234;tes,
en int&#233;grant la dimension temporelle propre au contexte des news. Nous proposons une typologie des ph&#233;nom&#232;nes
d&#8217;ambigu&#239;t&#233; bas&#233;e sur notre analyse s&#233;mantique. Enfin, nous comparons l&#8217;exploration par cat&#233;gorisation &#224; une
ressource comme Wikip&#233;dia, montrant concr&#232;tement les divergences des deux approches.
</p>
<p>Abstract. In this paper, we try to identify the nature of ambiguity of user queries from a search engine
dedicated to news, 2424actu.fr, using a categorization task. At first, we see different forms of ambiguity queries
already described in the works of NLP. We confront lexicographical vision of the ambiguity to that described by
classification techniques applied to information retrieval. In a second step, we apply a method of categorizing
themes to explore the ambiguity of queries, it allow us to conduct a semantic analysis of these applications by
integrating temporal context-specific news. We propose a typology of phenomena of ambiguity based on our
semantic analysis. Finally, we compare the exploration by categorization with a resource as Wikipedia, showing
concretely the differences between these two approaches.
</p>
<p>Mots-cl&#233;s : recherche d&#8217;information, ambigu&#239;t&#233;, classification de requ&#234;tes.
</p>
<p>Keywords: Information retrieval, ambiguity, classification queries.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>1 Introduction
</p>
<p>La d&#233;sambigu&#239;sation lexicale a &#233;t&#233; appliqu&#233;e &#224; la recherche d&#8217;information avec un succ&#232;s variable. Le pr&#233;curseur
sur cette th&#233;matique (Weiss, 1973) a &#233;t&#233; suivi par un certain nombre de travaux (Krovetz &amp; Croft, 1992; Stokoe
et al., 2003; Sanderson, 2000), o&#249; la d&#233;sambigu&#239;sation &#233;tait focalis&#233;e sur les mots dont les sens &#233;taient r&#233;pertori&#233;s
dans des dictionnaires (Voorhees, 1993). L&#8217;enjeu &#233;tait de r&#233;perer de la polys&#233;mie, c&#8217;est-&#224;-dire diff&#233;rents sens pour
une m&#234;me forme. Les performances des syst&#232;mes n&#8217;ont pas &#233;t&#233; &#224; la hauteur des esp&#233;rances aboutissant &#224; un ques-
tionnement sur l&#8217;ad&#233;quation des dictionnaires pour une telle t&#226;che, et la question de la nature de l&#8217;ambigu&#239;t&#233;.
Les dictionnaires sont peu adapt&#233;s au traitement des requ&#234;tes, contenant peu de noms propres, ou de termes com-
plexes et la nature de l&#8217;ambigu&#239;t&#233; des requ&#234;tes se limite aux relations s&#233;mantiques contenues dans les dictionnaires
(homonymie et polys&#233;mie). Ces difficult&#233;s ont rendu le traitement de l&#8217;ambigu&#239;t&#233; secondaire en recherche d&#8217;infor-
mation. Mais le d&#233;veloppement du web et des moteurs de recherche grand public ont remis en avant la question
de l&#8217;ambigu&#239;t&#233; des requ&#234;tes, en particulier le CLIR (Cross-Language Information Retrieval) (Darwish &amp; Oard,
2003). En effet, la traduction est tr&#232;s d&#233;pendante de la d&#233;sambigu&#239;sation, d&#8217;autant plus quand le contexte est ab-
sent. La taille des requ&#234;tes entre &#233;galement en jeu dans les performances des syst&#232;mes de d&#233;sambigu&#239;sation. Ils
se trouvent &#234;tre relativement performants sur les requ&#234;tes dites &#171; longues &#187; provenant des campagnes d&#8217;&#233;valua-
tion comme TREC ou CLEF, mais en grande difficult&#233; face des requ&#234;tes &#171; courtes &#187; provenant de moteurs de
recherche. Actuellement, l&#8217;accent est mis sur les donn&#233;es r&#233;elles et l&#8217;int&#233;ractivit&#233; avec l&#8217;utilisateur. L&#8217;enjeu n&#8217;est
plus de construire un syst&#232;me de d&#233;sambigu&#239;sation, mais de savoir identifier une requ&#234;te ambig&#252;e soit pour pou-
voir proposer par exemple une pr&#233;sentation adapt&#233;e &#224; l&#8217;utilisateur, comme une pr&#233;sentation hi&#233;rarchique (Hearst,
2009), soit pour am&#233;liorer les performances du syst&#232;me en lui-m&#234;me. Les solutions actuelles pr&#233;f&#232;rent en pr&#233;sence
de donn&#233;es r&#233;elles, se servir des logs de requ&#234;tes contenant les pages r&#233;ponses choisies par les utilisateurs pour
identifier les requ&#234;tes ambig&#252;es (Clough et al., 2009). Nous nous situons dans un contexte applicatif sp&#233;cifique,
un moteur de recherche d&#233;di&#233; &#224; l&#8217;actualit&#233;, o&#249; l&#8217;ambigu&#239;t&#233; des requ&#234;tes doit &#234;tre abord&#233;e diff&#233;remment. La base
documentaire &#233;volue avec l&#8217;actualit&#233; et ne conserve pas les documents anciens, il faut donc envisager une m&#233;thode
diff&#233;rente qui ne se base pas sur les choix des utilisateurs pour essayer d&#8217;identifier l&#8217;ambigu&#239;t&#233;.
</p>
<p>Dans ce contexte, nous cherchons &#224; identifier la nature de l&#8217;ambigu&#239;t&#233; pr&#233;sente dans nos requ&#234;tes en les examinant
gr&#226;ce &#224; une t&#226;che de cat&#233;gorisation. Cette approche doit nous permettre d&#8217;&#233;tudier la forme que peut prendre l&#8217;am-
bigu&#239;t&#233; des requ&#234;tes produites dans un contexte applicatif. Dans un premier temps, nous allons passer en revue
les diff&#233;rentes formes de l&#8217;ambigu&#239;t&#233; d&#233;j&#224; d&#233;crites dans les travaux de TAL, en confrontant la vision &#171; tradition-
nelle &#187; de l&#8217;ambigu&#239;t&#233; des requ&#234;tes, lexicographique, &#224; une vision produite par des techniques de classification et
de clustering appliqu&#233;es &#224; la recherche d&#8217;information. Dans un deuxi&#232;me temps, nous appliquerons ces techniques
de classification pour explorer l&#8217;ambigu&#239;t&#233; des requ&#234;tes dans notre contexte applicatif 2424actu.fr afin d&#8217;effectuer
une analyse s&#233;mantique des requ&#234;tes. Cette analyse d&#233;bouchera sur une typologie de l&#8217;ambigu&#239;t&#233; dans ce cadre
applicatif. Enfin, nous confronterons l&#8217;exploration par cat&#233;gorisation &#224; une ressource comme Wikip&#233;dia, en mon-
trant les divergences de ces deux approches et l&#8217;importance d&#8217;une d&#233;marche d&#8217;analyse refl&#233;tant les particularit&#233;s
du contexte et de la base de texte &#224; traiter.
</p>
<p>2 L&#8217;ambigu&#239;t&#233; dans les requ&#234;tes utilisateurs
</p>
<p>2.1 L&#8217;ambigu&#239;t&#233; des requ&#234;tes vue &#224; travers les dictionnaires
</p>
<p>L&#8217;ambigu&#239;t&#233; des requ&#234;tes est souvent analys&#233;e &#224; la lumi&#232;re des dictionnaires et autres ressources (WordNet,
Wikip&#233;dia) (Sanderson, 2000, 2008; Santamar&#237;a et al., 2010). Le principe est de rechercher les termes des re-
qu&#234;tes dans divers dictionnaires afin de r&#233;p&#233;rer les mots ayant plusieurs sens. Comme en d&#233;sambiguisation clas-
sique, WordNet est la principale source de comparaison, mais il lui est reproch&#233; d&#8217;&#234;tre peu repr&#233;sentatif de la
diversit&#233; pr&#233;sente dans les requ&#234;tes des utilisateurs de moteur de recherche. Il est donc utilis&#233; en compl&#233;ment
d&#8217;une autre ressource, en l&#8217;occurrence Wikip&#233;dia (Santamar&#237;a et al., 2010; Sanderson, 2008; Clough et al., 2009).
Par exemple, (Sanderson, 2008) propose d&#8217;examiner l&#8217;ambigu&#239;t&#233; en s&#8217;appuyant conjointement sur WordNet et sur
les pages de Wikip&#233;dia, il collecte dans cette ressource les pages identifiant une forme ambig&#252;e et les diff&#233;rents
sujets qui portent le nom de cette forme. Gr&#226;ce &#224; ces deux types de ressources, Sanderson &#233;value l&#8217;ambigu&#239;t&#233;
pr&#233;sente dans deux corpus de requ&#234;tes provenant de deux moteurs de recherche (1 million de requ&#234;tes Live Search
et 500 000 requ&#234;tes de UK&#8217;s Press Association). 16% des requ&#234;tes Live Search sont estim&#233;es ambig&#252;es &#224; la lu-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>mi&#232;re des ressources, et 23,6% pour les requ&#234;tes du moteur UK&#8217;s Press Association. Il confirme l&#8217;importance du
ph&#233;nom&#232;ne et sugg&#232;re que l&#8217;ambigu&#239;t&#233; varie selon les requ&#234;tes &#233;tudi&#233;es. Par ailleurs, on peut se demander si l&#8217;am-
bigu&#239;t&#233; pr&#233;sente en recherche d&#8217;information est de la polys&#233;mie d&#233;crite dans les dictionnaires (h&#244;te peut d&#233;signer
la personne qui re&#231;oit ou celle qui est re&#231;ue) ou bien de l&#8217;homonymie comme Wikip&#233;dia le propose (&#233;ruption
comme nom ou Eruption groupe de musique).
</p>
<p>D&#8217;autre part, il y a deux probl&#232;mes li&#233;s &#224; cette approche de l&#8217;ambigu&#239;t&#233; des requ&#234;tes. Le premier probl&#232;me est
li&#233; aux ressources. Wikip&#233;dia ne couvre que 60% des sens pr&#233;sents dans un moteur de recherche (en anglais) et
WordNet seulement 32 %(Santamar&#237;a et al., 2010). Le deuxi&#232;me probl&#232;me est l&#8217;absence de prise en compte de
l&#8217;environnement sp&#233;cifique &#224; la t&#226;che de recherche d&#8217;information. En effet, l&#8217;ambigu&#239;t&#233; d&#8217;une requ&#234;te ne peut &#234;tre
envisag&#233;e en dehors de la base textuelle interrog&#233;e, l&#8217;utilisateur cherchant une information pr&#233;sente dans la base
qu&#8217;il consulte et qu&#8217;il anticipe. L&#8217;ambigu&#239;t&#233; typ&#233;e dans des ressources comme des dictionnaires et des th&#233;saurus
g&#233;n&#233;ralistes n&#8217;est donc pas forc&#233;ment adapt&#233;e pour caract&#233;riser l&#8217;ambigu&#239;t&#233; effective des requ&#234;tes utilisateurs pour
une application donn&#233;e.
</p>
<p>2.2 L&#8217;ambigu&#239;t&#233; &#171; non classique &#187;
</p>
<p>Rompant avec la vision lexicographique de l&#8217;ambigu&#239;t&#233; des requ&#234;tes, certains travaux proposent d&#8217;analyser d&#8217;autres
formes d&#8217;ambigu&#239;t&#233;. Ils avancent que des requ&#234;tes peuvent &#234;tre ambigues si elles renvoient &#224; plusieurs &#171; sous-
domaines &#187; (Zhai et al., 2003) ou &#224; plusieurs &#171; facettes &#187;(Hearst, 2006). Ce type de distinction est &#224; mettre en
rapport avec l&#8217;utilisation de techniques de classification et de clustering en recherche d&#8217;information. Ces tech-
niques permettent de faire appara&#238;tre des rapprochements pertinents sans poser d&#8217;a priori sur ce qui est recherch&#233;.
On retrouve ce type de distinction vis &#224; vis de l&#8217;ambigu&#239;t&#233; des requ&#234;tes dans (Song et al., 2009). Ils utilisent une
typologie &#224; trois &#233;l&#233;ments qu&#8217;ils ont d&#233;finie dans le but d&#8217;annoter manuellement des requ&#234;tes :
</p>
<p>1. Type A (requ&#234;te ambig&#252;e) : requ&#234;te qui a plus d&#8217;un seul sens : &#171; giant &#187; &gt; plusieurs r&#233;f&#233;rents Giant Company,
Giant (film), San Francisco Giant (&#233;quipe de basket ball)
</p>
<p>2. Type B (requ&#234;te &#171; large &#187;) : requ&#234;te qui couvre plusieurs sujets ou th&#233;matiques : &#171; songs &#187; &gt; &#171; song lyrics &#187;,
&#171; love songs &#187;, &#171; download songs &#187;
</p>
<p>3. Type C (requ&#234;te non ambig&#252;e) : requ&#234;te qui a un sens sp&#233;cifique et un r&#233;f&#233;rent facilement identifiable :
&#171; Billie Holiday &#187; (chanteuse jazz)
</p>
<p>Les crit&#232;res ont utilis&#233; pour discriminer les requ&#234;tes de type A et C ne sont pas clairement &#233;tablis. En effet, po-
tentiellement l&#8217;exemple donn&#233; comme requ&#234;te non ambig&#252;e, &#171; Billie Holiday &#187; peut &#234;tre discut&#233; puisqu&#8217;il s&#8217;av&#232;re
qu&#8217;il existe un album eponyme de Billie Holiday. La distinction entre &#171; ambig&#252;e &#187; et &#171; non ambigu &#187; est donc
difficile &#224; &#233;tablir, laissant appara&#238;tre des requ&#234;tes &#171; entre les deux &#187;. (Song et al., 2009) les distinguent en cr&#233;ant
une cat&#233;gorie de requ&#234;tes contenant un terme g&#233;n&#233;rique (requ&#234;te B). Le ph&#233;nom&#232;ne de &#171; g&#233;n&#233;ralit&#233; &#187; existe d&#233;j&#224;
dans les conceptions de l&#8217;ambigu&#239;t&#233; s&#233;mantique (Aarts &amp; MacMahon, 2006). Il d&#233;crit un ph&#233;nom&#232;ne d&#8217;ambigu&#239;t&#233;
diff&#233;rent de la polys&#233;mie et de l&#8217;homonymie dont le nom varie selon les auteurs : sous-sp&#233;cification, sens vague,
ind&#233;termination ou g&#233;n&#233;ralit&#233;. Cette forme d&#8217;ambigu&#239;t&#233; d&#233;crit un sens g&#233;n&#233;ral ou inclusif qui peut avoir diff&#233;rentes
significations selon le contexte, par exemple &#171; vache &#187; va pourvoir prendre un sens g&#233;n&#233;ral &#171; animal ruminant &#187; ou
un sens sp&#233;cifique &#171; femelle du taureau &#187;. Il se pose donc la question de la pr&#233;sence de ce type d&#8217;ambigu&#239;t&#233; &#171; non
classique &#187; en recherche d&#8217;information.
</p>
<p>2.3 La question des entit&#233;s nomm&#233;es &#171; ambig&#252;es &#187;
</p>
<p>L&#8217;utilisation de Wikip&#233;dia comme ressource pour capter l&#8217;ambigu&#239;t&#233; des requ&#234;tes ou bien d&#233;sambigu&#239;ser (Rahurkar
et al., 2008) est principalement due &#224; la possibilit&#233; d&#8217;exploiter les entit&#233;s nomm&#233;es (ENs) qu&#8217;elle contient. Or,
l&#8217;&#233;tude des requ&#234;tes utilisateurs de AllTheWeb et Altavista avaient mis en &#233;vidence que 11-17% des requ&#234;tes
&#233;taient compos&#233;es d&#8217;un nom propre d&#233;signant une personne (Spink et al., 2004). Les entit&#233;s nomm&#233;es d&#233;signant
des lieux sont aussi tr&#232;s pr&#233;sentes. Gan et al. (Gan et al., 2008) montrent dans une &#233;tude des logs de requ&#234;tes
de AOL (2006) qu&#8217;il y a environ 38% des requ&#234;tes qui contiennent des termes de type &#171; g&#233;ographique &#187; comme
&#171; New York &#187; ou &#171; Kentucky Fried Chicken &#187;. Pour des moteurs de m&#234;me type comme AOL et Altavista (moteurs
g&#233;n&#233;ralistes), on arriverait environ &#224; plus de 50% d&#8217;entit&#233;s nomm&#233;es. L&#8217;utilisation d&#8217;entit&#233;es nomm&#233;es en nombre
par les utilisateurs de moteurs de recherche renforce les ph&#233;nom&#232;nes d&#8217;ambigu&#239;t&#233; des requ&#234;tes, &#224; tel point que</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>cela a justifi&#233; une t&#226;che d&#233;di&#233;e &#224; la d&#233;sambigu&#239;sation des noms de personnes dans un contexte de recherche
d&#8217;information nomm&#233;e WePS (Artiles et al., 2007, 2010). En effet, il est courant qu&#8217;un m&#234;me nom propre d&#233;signe
un grand nombre de personnes. (Artiles et al., 2007) donnaient l&#8217;exemple du bureau de recensement am&#233;ricain qui
rapporte 90 000 noms port&#233;s par 100 millions de personnes. L&#8217;homonymie n&#8217;est pas la seule cause d&#8217;ambigu&#239;t&#233;
des ENs. Elles forment un ensemble h&#233;t&#233;rog&#232;ne compos&#233; d&#8217;une collection d&#8217;expressions linguistiques diverses,
r&#233;unies sur la base de caract&#233;ristiques r&#233;f&#233;rentielles communes (Erhmann, 2008), c&#8217;est-&#224;-dire que sont rassembl&#233;es
sous la m&#234;me &#233;tiquette diff&#233;rentes expressions comme les noms de lieux, de personnes ou des d&#233;nominations
d&#8217;organisation, qui par nature, ne manifestent pas les m&#234;mes propri&#233;t&#233;s. Par cons&#233;quent, l&#8217;ambigu&#239;t&#233; appara&#238;t
sous diff&#233;rentes formes : m&#233;tonymie (&#171; la France a gagn&#233; 3-0 &#187;), facettes r&#233;f&#233;rentielles (Carla Bruni, chanteuse,
ancienne mannequin, &#233;pouse du pr&#233;sident de la R&#233;publique) ou comme on l&#8217;a vu homonymie. Face &#224; une telle
variabilit&#233;, l&#8217;utilisation de ressources pour traiter l&#8217;ambigu&#239;t&#233; des Entit&#233;s Nomm&#233;es a des limites. C&#8217;est pourquoi
les techniques de clustering se sont d&#233;velopp&#233;es pour tenter de d&#233;sambigu&#239;ser les ENs (Santamar&#237;a et al., 2010;
Bernardini et al., 2009).
</p>
<p>2.4 La question de l&#8217;&#233;valuation de l&#8217;ambigu&#239;t&#233;
</p>
<p>Actuellement, la question de la forme que prend l&#8217;ambigu&#239;t&#233; des requ&#234;tes utilisateurs reste ouverte. En effet, con-
sid&#233;rer uniquement l&#8217;ambigu&#239;t&#233; &#224; travers des ressources semble non satisfaisant (Hearst, 2006, 2009). L&#8217;utilisation
de m&#233;thodes inductives reste dans les travaux r&#233;cents un compl&#233;ment pour augmenter la couverture de Wikip&#233;dia.
En effet, la question de l&#8217;&#233;valuation de l&#8217;ambigu&#239;t&#233; des requ&#234;tes reste enti&#232;re. D&#8217;une part, l&#8217;acc&#232;s aux r&#233;ponses
choisies par l&#8217;utilisateur &#224; une requ&#234;te donn&#233;e est difficile, ce sont des informations p&#233;rissables et d&#233;tenues par
les moteurs de recherche. D&#8217;autre part, il n&#8217;y a que tr&#232;s peu de tests d&#8217;&#233;valuation et il ne sont pas con&#231;us pour
des requ&#234;tes &#171; r&#233;elles &#187; (TREC 7). Cependant, le rep&#233;rage et l&#8217;&#233;valuation de l&#8217;ambigu&#239;t&#233; ne peuvent &#234;tre effectu&#233;s
sans savoir au pr&#233;alable quelle forme prend le ph&#233;nom&#232;ne que l&#8217;on cherche &#224; contr&#244;ler. Il est donc n&#233;cessaire de
mieux comprendre comment se manifeste l&#8217;ambigu&#239;t&#233;, en tentant de voir si les ambigu&#239;t&#233;s dites non classiques
sont bien pr&#233;sentes. Cette t&#226;che implique de prendre en compte un certain nombre de param&#232;tres variables et
subjectifs comme les connaissances de l&#8217;utilisateur, son intention lorsqu&#8217;il effectue une requ&#234;te. Il faut &#233;galement
consid&#233;rer le cadre dans lequel il effectue cette recherche, le type de moteur et la base documentaire associ&#233;e, un
moteur g&#233;n&#233;raliste ne semble pas g&#233;n&#233;rer le m&#234;me type d&#8217;ambigu&#239;t&#233; qu&#8217;un moteur dit vertical, d&#233;di&#233; &#224; la recherche
d&#8217;information sur un domaine particulier comme la vid&#233;o ou les publications scientifiques (Sanderson, 2008).
</p>
<p>3 Faire &#233;merger l&#8217;ambigu&#239;t&#233; des requ&#234;tes automatiquement &#224; partir de
corpus
</p>
<p>Le cadre applicatif de ce travail est un plateforme d&#8217;actualit&#233;s vid&#233;os d&#233;velopp&#233;e par Orange Labs, 2424 actu.fr 1.
Ce site permet de consulter l&#8217;actualit&#233; fran&#231;aise en temps r&#233;el, et propose diff&#233;rents types d&#8217;acc&#232;s &#224; l&#8217;information :
par clustering, par th&#233;matiques et par barre de recherche traditionnelle. Le moteur de recherche &#224; la disposition
des utilisateurs ne propose pas de pr&#233;sentation de r&#233;sultats par clusters ou par th&#233;matiques, mais par format des
sources (vid&#233;o, texte, audio).
</p>
<p>La question de l&#8217;ambigu&#239;t&#233; des requ&#234;tes dans un cadre applicatif est une question importante pour plusieurs
secteurs de la recherche d&#8217;information comme la complexit&#233; des requ&#234;tes et la pr&#233;diction de la difficult&#233; d&#8217;une
requ&#234;te (Clough et al., 2009). L&#8217;ambigu&#239;t&#233; est &#233;galement un aspect important pour la personnalisation des moteurs
de recherche vis &#224; vis des utilisateurs. Notre contexte renforce cet int&#233;r&#234;t, l&#8217;actualit&#233; est un usage quotidien pour
beaucoup d&#8217;utilisateurs, mais elle a la particularit&#233; d&#8217;&#234;tre &#233;volutive. Nous connaissons &#233;galement des contraintes
propres au contexte applicatif 2 qui demandent d&#8217;aborder l&#8217;ambigu&#239;t&#233; des requ&#234;tes sous un angle diff&#233;rent. Dans
ce but, nous cherchons &#224; identifier l&#8217;ambigu&#239;t&#233; &#224; partir d&#8217;une t&#226;che de cat&#233;gorisation.
</p>
<p>1. http ://www.2424actu.fr
2. Le site est une plateforme qui reccueille temporairement les productions des partenaires, elle ne poss&#232;de donc pas les contenus et ne
</p>
<p>peut les conserver pour un usage commercial.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>3.1 L&#8217;ambigu&#239;t&#233; examin&#233;e par une t&#226;che de cat&#233;gorisation
</p>
<p>Le but de cette exp&#233;rimentation n&#8217;est pas de reproduire un processus de recherche d&#8217;information, mais d&#8217;&#233;tudier
la forme que peut prendre l&#8217;ambigu&#239;t&#233; des requ&#234;tes produites dans un contexte applicatif. L&#8217;utilisation d&#8217;une
ressource nous para&#238;t peu appropri&#233;e pour cette t&#226;che. En effet, comme nous l&#8217;avons vu dans (2.2), il existe des
ambigu&#239;t&#233;s que l&#8217;on peut qualifier de non-classiques et qui ne sont pas recens&#233;es dans une ressource existante.
L&#8217;enjeu est donc de faire &#233;merger &#224; la fois l&#8217;ambigu&#239;t&#233; &#171; classique &#187; telle que la polys&#233;mie ou l&#8217;homonymie, et les
ambigu&#239;t&#233;s &#171; non classiques &#187; et de pouvoir observer leurs manifestations.
</p>
<p>Cette &#233;tude pr&#233;liminaire utilise les moyens disponibles dans le cadre de cette application, une double cat&#233;gorisa-
tion des documents &#171; cibles &#187; des requ&#234;tes. Notre but est de parvenir &#224; transposer une cat&#233;gorisation externe &#224; une
cat&#233;gorisation interne. Pour cela, nous nous servons de documents qui ont la particularit&#233; d&#8217;&#234;tre classifi&#233;s &#224; deux
niveaux : chaque document (ou news) appartient &#224; un cluster et &#224; une cat&#233;gorie th&#233;matique. Les cat&#233;gories th&#233;-
matiques sont h&#233;rit&#233;es de l&#8217;AFP et elles sont au nombre de six : &#233;conomie (questions &#233;conomiques), international
(actualit&#233;s hors de France), soci&#233;t&#233;, politique, cultures (musique, sciences, art, people) et sport. Elles forment un
&#233;tiquetage que nous allons utilis&#233;s. L&#8217;hypoth&#232;se est que les cat&#233;gories, en nombre r&#233;duit et correspondant &#224; un
classement adapt&#233; pour les news, vont donner une approximation des domaines pr&#233;sents dans l&#8217;actualit&#233; et un
premier point d&#8217;entr&#233;e sur le comportement des requ&#234;tes. Nous nous appuyons donc sur le corpus que nous avons
constitu&#233; au fil des jours &#224; partir des actualit&#233;s quotidiennes du site (tableau 1). Le corpus de documents est la
collection de documents sous forme textuelle disponible pour les utilisateurs du site d&#8217;actualit&#233; pour une p&#233;riode
donn&#233;e en fran&#231;ais. Les sources sont h&#233;t&#233;rog&#232;nes : audio retranscrit, d&#233;p&#234;ches AFP, articles de journaux, retran-
scription de journaux t&#233;l&#233;vis&#233;s. Les documents proviennent des diff&#233;rents partenaires du site (AFP, Le Monde, Le
Point, L&#8217;Express, France T&#233;l&#233;vision, Paris Match, etc.). La notion temporelle structure le corpus, il est partitionn&#233;
en huit sous-corpus.
</p>
<p>L&#8217;exp&#233;rimentation consiste &#224; cat&#233;goriser les requ&#234;tes pour pouvoir observer leur distribution sur plusieurs do-
maines. Les requ&#234;tes d&#8217;une p&#233;riode temporelle sont projet&#233;es sur la base textuelle correspondant &#224; la m&#234;me p&#233;ri-
ode temporelle, et si elles apparaissent dans un document, elles h&#233;ritent de la cat&#233;gorie th&#233;matique du document.
Les cat&#233;gories sont pond&#233;r&#233;es selon la fr&#233;quence d&#8217;apparition. Nous effectuons &#233;galement un filtrage des cat&#233;-
gories attribu&#233;es : une cat&#233;gorie est consid&#233;r&#233;e seulement si elle repr&#233;sente plus de 10% des textes o&#249; la requ&#234;te
appara&#238;t. Le filtre permet de limiter l&#8217;apparition de cat&#233;gories r&#233;siduelles, il a &#233;t&#233; choisi de fa&#231;on arbitraire. Le
corpus de requ&#234;tes utilis&#233; contient les requ&#234;tes utilisateurs du site 2424actu des huit derniers mois (de Mai 2010
&#224; D&#233;cembre 2010). Il totalise 487 231 requ&#234;tes non d&#233;doublonn&#233;es (pour environ 30 700 requ&#234;tes uniques). Ce
corpus de requ&#234;tes est d&#233;coup&#233; en partition temporelle, chaque partition est organis&#233;e en fonction de la fr&#233;quence
des requ&#234;tes 3. Nous utiliserons dans cette exp&#233;rimentation les 49 requ&#234;tes les plus fr&#233;quentes de chaque sous-
partition du corpus c&#8217;est-&#224;-dire ayant une fr&#233;quence sup&#233;rieure &#224; 100 pour la p&#233;riode consid&#233;r&#233;e, ce qui fait au
total 391 requ&#234;tes. Pr&#233;alablement, les requ&#234;tes contenant plusieurs mots et ne formant pas des termes sont volon-
tairement exclues de la cat&#233;gorisation comme par exemple &#171; boue hongrie &#187;, alors qu&#8217;une requ&#234;te comme &#171; festival
de cannes &#187; va &#234;tre cat&#233;goris&#233;e. Le parti pris est que ces requ&#234;tes contenant plusieurs termes sont moins affect&#233;es
par l&#8217;ambigu&#239;t&#233; (Sanderson, 2008).
</p>
<p>Mai2010 Juin2010 Juillet2010 Ao&#251;t2010 Sept2010 Octobre2010 Nov2010 D&#233;c2010
23 521 26 782 15 773 19 543 17 634 22 822 16 015 11 096
</p>
<p>TABLE 1 &#8211; Corpus de documents (news 2424actu)
</p>
<p>3.2 Analyse de l&#8217;ambigu&#239;t&#233; des requ&#234;tes
</p>
<p>Nous cherchons &#224; savoir si la cat&#233;gorisation th&#233;matique est un bon proc&#233;d&#233; pour explorer la manifestation de
l&#8217;ambigu&#239;t&#233; et donc si une pluri-cat&#233;gorisation est synonyme d&#8217;ambigu&#239;t&#233;. Pour &#233;tudier cette question, nous allons
proc&#233;der tout d&#8217;abord &#224; une analyse des requ&#234;tes qui n&#8217;ont &#233;t&#233; rattach&#233;es qu&#8217;&#224; une seule cat&#233;gorie ce qui va
permettre de regarder si l&#8217;ambigu&#239;t&#233; est pr&#233;sente malgr&#233; un rattachement unique. Puis dans un deuxi&#232;me temps,
l&#8217;analyse se focalisera sur les requ&#234;tes rattach&#233;es plusieurs cat&#233;gories th&#233;matiques.
</p>
<p>3. A noter, que les sous-partitions pour les mois de septembre et novembre ne sont pas compl&#232;tes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>Nous avons effectu&#233; une &#233;valuation sur le corpus de requ&#234;tes les plus fr&#233;quentes (mai &#224; d&#233;cembre), soit 391
requ&#234;tes. Ce corpus contient 70% de requ&#234;tes contenant une EN ou &#233;tant une EN. Parmi ces 391 requ&#234;tes, 35%
ne sont pas cat&#233;goris&#233;es, leur recherche ne donnant pas de r&#233;sultats dans la base textuelle. La r&#233;partition entre
les requ&#234;tes mono-cat&#233;gorielles et pluri-cat&#233;gorielles est la suivante : 54% sont mono-cat&#233;gorielles et 46% pluri-
cat&#233;gorielles (au moins deux cat&#233;gories).
</p>
<p>3.2.1 Les requ&#234;tes rattach&#233;es &#224; une seule cat&#233;gorie
</p>
<p>La r&#233;partition des requ&#234;tes qui donnent lieu &#224; un classement th&#233;matique unique varie selon les corpus-tests (environ
67% pour le sous-corpus de d&#233;cembre contre 27% dans le sous-corpus de mai). Ces requ&#234;tes sont &#224; 80% des en-
tit&#233;es nomm&#233;es, ce qui ne repr&#233;sente pas l&#8217;ensemble des requ&#234;tes contenant des ENs (40% environ sont rattach&#233;es
&#224; plusieurs cat&#233;gories). Par exemple, &#171; miss france &#187; va &#234;tre cat&#233;goris&#233;e exclusivement en cultures tout comme
les requ&#234;tes &#171; prince william &#187; ou &#171; audrey pulvar &#187;, &#171; nicolas dupont-aignan &#187; sera cat&#233;goris&#233; en &#233;conomie. Ces
requ&#234;tes contiennent des noms propres complets ce qui aide &#224; l&#8217;identification, mais il y a &#233;galement des requ&#234;tes
mono-mots qui n&#8217;ont qu&#8217;une seule cat&#233;gorie comme &#171; vogica &#187; en international. Les requ&#234;tes mono-cat&#233;gorielles
ne contenant pas d&#8217;entit&#233;e nomm&#233;e comme &#171; neiges &#187; en soci&#233;t&#233; ou &#171; agriculture &#187; en &#233;conomie sont moins nom-
breuses (environ 20%). Nous observons &#233;galement qu&#8217;une grande partie de ces classements uniques s&#8217;op&#232;re dans
les cat&#233;gories international (environ 40% des requ&#234;tes mono-cat&#233;goris&#233;es) et cultures (environ 20%). Ces cat&#233;-
gories sont vastes et englobent &#233;norm&#233;ment de sujets.
</p>
<p>3.2.2 Les requ&#234;tes rattach&#233;es &#224; plusieurs cat&#233;gories
</p>
<p>Nous avons effectu&#233; une analyse bas&#233;e sur les 115 requ&#234;tes pluri-cat&#233;goris&#233;es, nous cherchons &#224; faire &#233;merger des
ph&#233;nom&#232;nes identifiables afin de construire une typologie des requ&#234;tes manifestant de l&#8217;ambigu&#239;t&#233;. Les requ&#234;tes
renvoyant &#224; plusieurs cat&#233;gories th&#233;matiques sont majoritairement des entit&#233;es nomm&#233;es comme pour les requ&#234;tes
mono-cat&#233;gorielles, mais on trouve &#233;galement 40% de requ&#234;tes ne contenant pas d&#8217;EN.
</p>
<p>Parmi les requ&#234;tes pluri-cat&#233;gorielles, il existe des requ&#234;tes porteuses d&#8217;ambigu&#239;t&#233; de type classique (polys&#233;mie
et homonymie). Elles renvoient &#224; plusieurs cat&#233;gories qui pr&#233;sentent des pond&#233;rations similaires comme par ex-
emple &#171; royal &#187; (tableau 2). C&#8217;est une requ&#234;te ambig&#252;e et la cat&#233;gorisation fait ressortir deux aspects int&#233;ressants,
d&#8217;une part une cat&#233;gorisation en politique et d&#8217;autre part une cat&#233;gorisation en sport. La cat&#233;gorisation en poli-
tique de &#171; royal &#187; renvoie &#224; &#171; S&#233;gol&#232;ne Royal &#187;, contrairement &#224; la cat&#233;gorisation en sport qui renvoie l&#8217;adjectif
&#171; royal &#187; pr&#233;sent dans un certain nombre de stades sud-africains utilis&#233;s lors de la Coupe du monde de football,
par exemple &#171; stade Royal Bafokeng de Rustenburg &#187;. L&#8217;ambigu&#239;t&#233; lexicale dans nos requ&#234;tes est essentiellement
de l&#8217;homonymie. En effet, le seul exemple de polys&#233;mie trouv&#233; dans notre corpus est la requ&#234;te &#171; tabac &#187; (tableau
3). Elle peut d&#233;signer plusieurs choses (le lieu o&#249; l&#8217;on vend du tabac, le tabac comme plante, ou comme cigarettes)
et c&#8217;est aussi un nom que l&#8217;on retrouve fr&#233;quemment dans l&#8217;expression &#171; passer &#224; tabac &#187;. Le contexte d&#8217;actualit&#233;
contient plusieurs sens de &#171; tabac &#187; : lieu de vente, tabac comme cause de maladie, cigarettes, tabac comme plante
cultiv&#233;e ou encore passage &#224; tabac. La polys&#233;mie est extr&#234;ment rare dans notre corpus.
</p>
<p>Th&#233;matiques int pol spr
royal 27 63 40
</p>
<p>TABLE 2 &#8211; La requ&#234;te &#171; royal &#187; cat&#233;goris&#233;e en juin
</p>
<p>Th&#233;matiques int eco soc
tabac 11 27 25
</p>
<p>TABLE 3 &#8211; La requ&#234;te &#171; tabac &#187; au mois de novembre
</p>
<p>Nous observons un autre type de requ&#234;tes pluri-cat&#233;gorielles avec des fr&#233;quences d&#8217;apparition sup&#233;rieures aux re-
qu&#234;tes pr&#233;c&#233;dentes (requ&#234;tes homonymiques), comme par exemple &#171; soci&#233;t&#233; &#187; (tableau 4), &#171; obama &#187; ou &#171; sarkozy &#187;.
Ces requ&#234;tes sont difficiles &#224; interpr&#233;ter m&#234;me &#224; l&#8217;aide du contexte des documents cibles parce qu&#8217;elles balaient
un champ tr&#232;s large. Ainsi on voit par exemple qu&#8217;une requ&#234;te comme &#171; sarkozy &#187; (tableau 5), va ouvrir vers un</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>grand nombre de cat&#233;gories th&#233;matiques. Cette requ&#234;te est ambig&#252;e car elle a besoin d&#8217;&#234;tre sp&#233;cifi&#233;e, d&#8217;&#234;tre com-
pl&#233;t&#233;e. L&#8217;observation ne permet pas d&#8217;identifier un lien interpr&#233;table en termes d&#8217;ambigu&#239;t&#233;s entre la requ&#234;te et
une cat&#233;gorie. Nous les rapprochons du type de requ&#234;tes dites &#171; larges &#187; (type B) d&#233;crites par (Song et al., 2009),
ce sont des requ&#234;tes g&#233;n&#233;riques.
</p>
<p>Th&#233;matiques eco int pol soc
soci&#233;t&#233; 114 64 45 84
</p>
<p>TABLE 4 &#8211; La requ&#234;te &#8220;soci&#233;t&#233;&#8221; (mai)
</p>
<p>Th&#233;matiques int pol soc
sarkozy 196 544 182
</p>
<p>TABLE 5 &#8211; La requ&#234;te &#171; sarkozy &#187; (juin)
</p>
<p>Enfin, nous distinguons un troisi&#232;me type de requ&#234;tes pluri-cat&#233;gorielles, relativement proches des requ&#234;tes &#171; g&#233;n&#233;ri-
ques &#187; du point de vue des cat&#233;gorisations. Elles sont cependant diff&#233;rentes car elles sont porteuses d&#8217;ambigu&#239;t&#233;
r&#233;f&#233;rentielle. Par ambigu&#239;t&#233; r&#233;f&#233;rentielle, nous d&#233;signons une requ&#234;te qui n&#8217;a pas de r&#233;f&#233;rent fixe et qui potentielle-
ment peut d&#233;signer deux ou plusieurs r&#233;f&#233;rents. Par exemple, &#171; intemp&#233;ries &#187; para&#238;t peu ambigu dans un contexte
d&#8217;actualit&#233;s, pourtant la cat&#233;gorisation fait ressortir deux cat&#233;gories (international et soci&#233;t&#233;). De nombreuses re-
qu&#234;tes comme &#171; otages &#187; ou &#171; ministre &#187; (tableau 6) sont ambig&#252;es d&#8217;un point de vue r&#233;f&#233;rentiel, &#171; ministre &#187;
d&#233;signe une fonction mais aussi un grand nombre de personnes occupant cette fonction. Ces requ&#234;tes sont forte-
ment d&#233;pendantes du contexte g&#233;n&#233;ral et par cons&#233;quent sujettes &#224; des variations de sens et de r&#233;f&#233;rents, dans des
p&#233;riodes temporelles plus ou moins longues.
</p>
<p>Th&#233;matiques eco int pol soc
ministre 311 474 571 415
</p>
<p>TABLE 6 &#8211; La requ&#234;te &#171; ministre &#187; en novembre
</p>
<p>3.2.3 Analyse de la dimension diachronique de l&#8217;ambigu&#239;t&#233; des requ&#234;tes
</p>
<p>L&#8217;analyse de requ&#234;tes a fait appara&#238;tre un facteur de variation : la dimension diachronique. En effet, certaines
requ&#234;tes changent de cat&#233;gorisation selon les p&#233;riodes temporelles comme &#171; &#233;ruption &#187; ou &#171; cannabis &#187;. Le cas de
la requ&#234;te &#171; &#233;ruption &#187; est int&#233;ressant car la requ&#234;te d&#233;signe un m&#234;me ph&#233;nom&#232;ne, mais &#224; chaque fois un volcan
diff&#233;rent, ce qui va donner la cat&#233;gorie soci&#233;t&#233; au mois de d&#233;cembre pour l&#8217;&#233;ruption du Piton de la Fournaise,
l&#8217;&#233;ruption du mois de novembre du volcan Merapi en Indon&#233;sie sera class&#233;e comme international, alors que
l&#8217;&#233;ruption islandaise en mai est cat&#233;goris&#233;e en &#233;conomie. La mono-cat&#233;gorisation variable s&#8217;applique &#233;galement &#224;
certaines entit&#233;s nomm&#233;es comme la requ&#234;te &#171; delarue &#187; cons&#233;cutivement cat&#233;goris&#233;e en cultures puis en soci&#233;t&#233;,
ce qui permet de r&#233;perer un changement, et potentiellement une ambigu&#239;t&#233; si deux cat&#233;gories co-occurrent dans
la m&#234;me p&#233;riode temporelle. On observe que sur les 50 requ&#234;tes les plus fr&#233;quentes chaque mois, seules quelques
unes persistent au cours des huit mois : &#171; afghanistan &#187;, &#171; ha&#239;ti &#187;, &#171; isra&#235;l &#187; ou encore &#171; pakistan &#187;. Elles ont pour
caract&#233;ristique principale d&#8217;&#234;tre pour la plupart des entit&#233;es nomm&#233;es (environ 70% des requ&#234;tes &#171; durables &#187;, ce
qui est comparable &#224; la proportion dans l&#8217;ensemble du corpus). Ces requ&#234;tes d&#233;signent toutes des pays et s&#8217;av&#232;rent
&#234;tre pluri-cat&#233;goris&#233;es. Nous allons analyser plus en d&#233;tail deux requ&#234;tes &#224; l&#8217;actualit&#233; tr&#232;s riche &#171; pakistan &#187; et
&#171; ha&#239;ti &#187;, pour illustrer la manifestation de l&#8217;ambigu&#239;t&#233; dans le temps.
</p>
<p>La requ&#234;te &#171; pakistan &#187; (tableau 7) a une cat&#233;gorisation tr&#232;s variable. La cat&#233;gorie international est majoritaire
sur l&#8217;ensemble du corpus. Mais nous observons plusieurs variations au niveau des cat&#233;gories majoritaires selon le
sous-corpus consid&#233;r&#233;. La premi&#232;re variation en juin (cat&#233;gorisation en politique), correspond dans notre corpus &#224;
l&#8217;apparition d&#8217;une affaire impliquant le Pakistan en tant qu&#8217;Etat : la vente de sous-marins au Pakistan par la France
aurait servi de moyens de financements &#224; un ancien premier ministre. La cat&#233;gorie international, correspond &#224;
un emploi du Pakistan comme lieu, servant &#224; localiser principalement des attentats et des op&#233;rations de la CIA
contre les talibans. La cat&#233;gorisation ne permet malheureusement pas d&#8217;identifier strictement les deux emplois de
ce mot. La deuxi&#232;me variation en novembre fait ressortir une cat&#233;gorisation en soci&#233;t&#233;, celle-ci renvoyant &#224; un</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>emploi de Pakistan comme lieu, en l&#8217;occurrence lieu qui produit des fili&#232;res de combattants pour Al-Qua&#239;da et des
&#171; potentiels auteurs d&#8217;attentats &#187;. On identifie donc plusieurs significations pour la requ&#234;te &#171; Pakistan &#187;, &#224; la fois
lieu g&#233;ographique, &#233;tat-nation et lieu de formation de combattants. On observe que la requ&#234;te &#171; ha&#239;ti &#187; (tableau 8)
a le m&#234;me type de comportement. La pluri-cat&#233;gorisation montre deux emplois possibles du mot &#171; ha&#239;ti &#187; : comme
r&#233;f&#233;rence au tremblement de terre (cat&#233;goris&#233;e en cultures et international) ou comme lieu. A noter cependant, la
requ&#234;te au mois d&#8217;octobre qui est mono-cat&#233;gorielle (international). Il s&#8217;av&#232;re que cela est du &#224; une focalisation
sur un &#233;v&#232;nement unique en effet pendant cette p&#233;riode, Ha&#239;ti a &#233;t&#233; touch&#233; par une &#233;pid&#233;mie de chol&#233;ra. La requ&#234;te
a pris une signification diff&#233;rente. Ces deux exemples manifestent deux types particuliers d&#8217;ambigu&#239;t&#233;, d&#233;crit par
(Lecolle, 2007) sous le terme de &#171; polysignifiance &#187;. La polysignifiance d&#233;signe le fait qu&#8217;un nom de lieu habit&#233;
pr&#233;sente des valeurs s&#233;mantico-r&#233;f&#233;rentielles diff&#233;rentes, renvoyant &#224; la fois au lieu, mais aussi aux habitants et &#224;
l&#8217;institution qui le gouverne. Cette propri&#233;t&#233; des noms de lieux leur permet de pouvoir porter diff&#233;rentes significa-
tions, comme par exemple &#171; Outreau &#187; qui a pris la valeur d&#8217;erreur judiciaire en suppl&#233;ment de sa valeur locative,
ou &#171; Tchernobyl &#187; qui d&#233;signe d&#233;sormais une catastrophe nucl&#233;aire. Cette mal&#233;abilit&#233; du nom de lieu d&#233;crite par
(Lecolle, 2007) ouvre une gamme large de possibilit&#233;s, mais aussi de probl&#232;mes &#233;vidents si les diff&#233;rentes valeurs
ne peuvent &#234;tre discrimin&#233;es et qu&#8217;elles apparaissent dans des contextes identiques. La polysignifiance semble
difficile &#224; appr&#233;hender par le biais de ressources lexicographiques ou de bases de connaissances, les diff&#233;rentes
valeurs ne sont pas prises en compte, seule la fonction de localisation est retenue dans le cas des noms de lieu.
La cat&#233;gorisation th&#233;matique nous permet d&#8217;observer une partie de ce ph&#233;nom&#232;ne, en mettant en &#233;vidence les
diff&#233;rentes significations de requ&#234;tes comme &#171; ha&#239;ti &#187; ou &#171; pakistan &#187;.
</p>
<p>Th&#233;matiques clt eco int pol soc
Mai 9 22 14 14
Juin 8 24
</p>
<p>Juillet 67
Aout 474
Sept 82
Oct 91 10
Nov 31 68
Dec 47
</p>
<p>TABLE 7 &#8211; Cat&#233;gorisation de la requ&#234;te &#171; pakistan &#187;
</p>
<p>Th&#233;matiques clt eco int soc spr
Mai 1 1 1
Juin 1 3 2
</p>
<p>Juillet 17 5
Aout 50
Sept 9 1
Oct 102
Nov 146
Dec 55 34
</p>
<p>TABLE 8 &#8211; Cat&#233;gorisation de la requ&#234;te &#171; ha&#239;ti &#187;
</p>
<p>3.3 Vers une typologie de l&#8217;ambigu&#239;t&#233; des requ&#234;tes
</p>
<p>L&#8217;ensemble de ces descriptions et analyses nous conduisent &#224; proposer une synth&#232;se sous forme de typologie, afin
de rassembler les diff&#233;rentes formes que peut prendre l&#8217;ambigu&#239;t&#233; dans notre contexte applicatif. Nous distinguons
au final deux types de requ&#234;tes &#171; ambigues &#187; &#224; la suite de notre analyse : les requ&#234;tes qui manifestent de l&#8217;ambigu&#239;t&#233;
&#171; classique &#187; et celles qui manifestent de l&#8217;ambigu&#239;t&#233; &#171; non classique &#187; (tableau 9). Les requ&#234;tes du premier type
contiennent de l&#8217;homonymie. La polys&#233;mie est quasi-absente de notre corpus de requ&#234;tes. Les requ&#234;tes du deu-
xi&#232;me type contiennent trois types de manifestations de l&#8217;ambigu&#239;t&#233; : les requ&#234;tes &#171; polysignifiantes &#187;, les requ&#234;tes
&#171; pluri-r&#233;f&#233;rentielles &#187; et les requ&#234;tes &#171; g&#233;n&#233;riques &#187;. Nous avons en effet consid&#233;r&#233; les requ&#234;tes &#171; polysignifiantes &#187;
comme &#233;tant des requ&#234;tes ambig&#252;es car la propri&#233;t&#233; de polysignifiance vaut potentiellement pour les noms de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>lieux habit&#233;s dans un contexte d&#8217;actualit&#233;. Les noms de lieux sont tr&#232;s pr&#233;sents dans notre corpus de requ&#234;tes
en particulier parmi les plus fr&#233;quentes (18,6% des requ&#234;tes de notre corpus test contiennent un nom de lieu).
L&#8217;ambigu&#239;t&#233; r&#233;f&#233;rentielle est avant tout observ&#233;e sur des noms et non pas des entit&#233;s nomm&#233;es. Les utilisateurs
en formulant ce type de requ&#234;tes semblent faire confiance au contexte imm&#233;diat (par exemple &#171; inondations &#187;),
mais lorsque l&#8217;actualit&#233; comporte plusieurs &#233;v&#232;nements auxquels peut r&#233;f&#233;rer cette requ&#234;te, l&#8217;ambigu&#239;t&#233; na&#238;t. Les
requ&#234;tes que nous avons qualifi&#233;es de &#171; g&#233;n&#233;rique &#187; r&#233;f&#232;rent &#224; un objet, un &#233;v&#232;nement ou un domaine vaste et
riche, contenant diff&#233;rentes &#171; facettes &#187;(Hearst, 2006). Ainsi, la requ&#234;te &#171; roman polanski &#187; illustre ce cas de
requ&#234;tes manifestant plusieurs facettes lors de la cat&#233;gorisation, celle-ci fait appara&#238;tre deux cat&#233;gories cultures et
international, mettant en avant ses diff&#233;rents r&#244;les dans l&#8217;actualit&#233;. Ces observations questionnent les conceptions
qui consid&#232;rent le nom propre en tant que &#171; d&#233;signateur rigide &#187; (Kripke, 1980), parce qu&#8217;il d&#233;signe le m&#234;me
objet dans tous les mondes o&#249; cet objet est pr&#233;sent, &#233;tant alors univoque. Or, les ressources cr&#233;es pour contenir
diverses informations sur les entit&#233;s nomm&#233;es sont construites sur ce mod&#232;le, les variations contextuelles ne sont
pas prises en compte. C&#8217;est pourquoi nous allons &#224; pr&#233;sent regarder si ces formes d&#8217;ambigu&#239;t&#233; sont pr&#233;sentes
dans une ressource comme Wikip&#233;dia, l&#8217;encyclop&#233;die en ligne, utilis&#233;e pour construire de nombreuses bases de
connaissances comme DBP&#233;dia 4.
</p>
<p>Requ&#234;tes avec ambigu&#239;t&#233; &#171; classique &#187; Requ&#234;tes avec ambigu&#239;t&#233; &#171; non classique &#187;
Homonymie Polysignifiance Ambigu&#239;t&#233; r&#233;f&#233;rentielle G&#233;n&#233;ricit&#233;
</p>
<p>voile, younes, cor&#233;e ha&#239;ti, pakistan, irak &#233;ruption, otages, sport, sarkozy
royal, tabac afghanistan, xynthia ministres, inondations obama, gouvernement
</p>
<p>TABLE 9 &#8211; Typologie de l&#8217;ambigu&#239;t&#233; des requ&#234;tes 2424 actu
</p>
<p>3.4 Comparaison avec Wikip&#233;dia
</p>
<p>Nous avons mis au jour de formes d&#8217;ambigu&#239;t&#233; qui ne sont pas d&#233;crites dans les dictionnaires &#171; traditionnels &#187;
comme la polysignifiance. Nous proposons alors de comparer notre classification &#224; une ressource, afin de mon-
trer la diff&#233;rence entre une proc&#233;dure exploratoire comme la n&#244;tre et une proc&#233;dure de comparaison, entre une
ressource et des requ&#234;tes. Nous avons compar&#233; manuellement une partie de notre corpus (98 requ&#234;tes) avec l&#8217;en-
cyclop&#233;die en ligne Wikip&#233;dia. Deux aspects sont examin&#233;s :
&#8211; est-ce que la requ&#234;te consid&#233;r&#233;e est pr&#233;sente dans Wikip&#233;dia ?
&#8211; si la requ&#234;te est une entr&#233;e de page d&#8217;encyclop&#233;die, est-ce qu&#8217;elle renvoie vers une page d&#8217;homonymie ou de
</p>
<p>d&#233;sambiguisation ?
Une page d&#8217;homonymie ou de d&#233;sambigu&#239;sation dans Wikip&#233;dia est simplement une page qui r&#233;pertorie les dif-
f&#233;rents sujets et articles partageant un m&#234;me nom. Par exemple &#171; &#233;ruption &#187; renvoie vers une page qui recense un
certain nombre d&#8217;&#171; &#233;ruption &#187; :
&#8211; une &#233;ruption volcanique en g&#233;ologie ;
&#8211; une &#233;ruption cutan&#233;e ou rash en m&#233;decine
&#8211; une &#233;ruption solaire, un ph&#233;nom&#232;ne tr&#232;s &#233;nerg&#233;tique se produisant &#224; la surface du Soleil.
&#8211; un morceau de guitare &#233;lectrique du groupe am&#233;ricain Van Halen, Eruption.
&#8211; un groupe disco Eruption
Nous avons compar&#233; l&#8217;annotation &#224; partir de Wikip&#233;dia &#224; la classification th&#233;matique, pour mesurer l&#8217;&#233;ventuel
d&#233;calage. L&#8217;annotation a &#233;t&#233; effectu&#233;e sur les 97 requ&#234;tes du corpus test et seulement 61 requ&#234;tes sont annot&#233;es
et compar&#233;es. La comparaison porte donc sur un nombre r&#233;duit de requ&#234;tes (tableau 10). 23 requ&#234;tes sont con-
sid&#233;r&#233;es comme non ambig&#252;es selon Wikip&#233;dia et mono-cat&#233;gorielles, mais 7 requ&#234;tes sont mono-cat&#233;gorielles et
consid&#233;r&#233;es comme ambig&#252;es par l&#8217;encyclop&#233;die. En effet, Wikip&#233;dia recense parfois plus de sens qu&#8217;il n&#8217;existe
dans notre contexte sp&#233;cialis&#233;, par exemple, Johnny Hallyday peut aussi &#234;tre un cascadeur selon l&#8217;encyclop&#233;die,
l&#8217;actualit&#233; ne conna&#238;t que le chanteur. La situation s&#8217;inverse lorsqu&#8217;on consid&#232;re l&#8217;accord entre la cat&#233;gorisation
et Wikip&#233;dia pour la pluri-cat&#233;gorisation comme le montre le tableau (10). Un certain nombre de requ&#234;tes est
identifi&#233; comme n&#8217;&#233;tant pas ambig&#252;es par Wikip&#233;dia, et pluri-cat&#233;goris&#233;es dans notre contexte (19 requ&#234;tes). Ces
requ&#234;tes n&#8217;ont pas de pages de d&#233;sambigu&#239;sation. Parmi ces requ&#234;tes on retrouve &#171; Ha&#239;ti &#187;, &#171; Afghanistan &#187;, &#171; face-
book &#187;, &#171; gouvernement &#187;, &#171; Carla Bruni &#187;, etc. Le probl&#232;me &#233;tant que Wikip&#233;dia ne recense pas des ambigu&#239;t&#233;s
aussi fines de ce type, il se limite aux ambigu&#239;t&#233;s de type homonymie. Des aspects comme la polysignifiance
</p>
<p>4. http ://dbpedia.org/About</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>ou des variations propres au contexte ne figureront pas dans l&#8217;encyclop&#233;die aussi riche soit-elle. La question de
l&#8217;inad&#233;quation d&#8217;une ressource pour capter des ph&#233;nom&#232;nes qui cr&#233;ent de l&#8217;ambigu&#239;t&#233; mais qui ne rel&#232;vent pas de
la polys&#233;mie ou de l&#8217;homonymie se pose.
</p>
<p>Comparaison Mono-cat&#233;gories Pluri-cat&#233;gories Total
Un seul sens dans Wikip&#233;dia 23 12 35
</p>
<p>D&#233;sambigu&#239;sation dans Wikip&#233;dia 7 19 26
</p>
<p>TABLE 10 &#8211; Comparaison de la cat&#233;gorisation avec Wikip&#233;dia
</p>
<p>4 Conclusion et Perspectives
</p>
<p>L&#8217;exp&#233;rimentation montre que l&#8217;ambigu&#239;t&#233; peut se manifester &#224; diff&#233;rents niveaux et sous diff&#233;rentes formes. La
cat&#233;gorisation th&#233;matique des requ&#234;tes a &#233;t&#233; un premier pas pour observer la diversit&#233; de l&#8217;ambigu&#239;t&#233; et la comple-
xit&#233; d&#8217;un contexte applicatif comme le n&#244;tre. L&#8217;actualit&#233; est un domaine riche et continuellement en mouvement,
c&#8217;est &#233;galement un enjeu important d&#8217;am&#233;liorer l&#8217;acc&#232;s au contenu des news. La constitution des corpus a &#233;t&#233; un
challenge, il a fallu r&#233;unir &#224; la fois les requ&#234;tes utilisateurs et les corpus de news o&#249; les utilisateurs avaient effectu&#233;
leurs recherches. Bien qu&#8217;il ne soit pas possible d&#8217;assimiler la pluri-cat&#233;gorisation &#224; de l&#8217;ambigu&#239;t&#233; de mani&#232;re
&#233;quivalente, la cat&#233;gorisation nous a permis de mettre en &#233;vidence diff&#233;rentes manifestations de l&#8217;ambigu&#239;t&#233; dans
nos requ&#234;tes, &#224; diff&#233;rents niveaux (durables ou variables). Les requ&#234;tes ambig&#252;es ne relevant pas de la polys&#233;mie
ou de l&#8217;homonymie s&#8217;av&#232;rent tr&#232;s mouvantes th&#233;matiquement, faisant appara&#238;tre une granularit&#233; plus fine, illus-
trant des facettes ou des &#233;v&#232;nements. Par ailleurs, la typologie propos&#233;e a fait appara&#238;tre certaines ph&#233;nom&#232;nes qui
ne peuvent &#234;tre rep&#233;r&#233;s par des ressources classiques. Les dictionnaires ne recensent pas les variations de points
de vue et de signification ponctuelles. On voit donc l&#8217;int&#233;r&#234;t d&#8217;utiliser des m&#233;thodes de type cat&#233;gorisation ou
clustering dans le rep&#233;rage de l&#8217;ambigu&#239;t&#233;. Cela pose la question dans un deuxi&#232;me temps de l&#8217;int&#233;r&#234;t de l&#8217;utili-
sateur, que va-t-il gagner &#224; percevoir ces diff&#233;rents facettes ? Du point de vue de la m&#233;thode utilis&#233;e dans cette
exp&#233;rimentation, il appara&#238;t qu&#8217;il serait int&#233;ressant de la compl&#233;ter et de la comparer &#224; d&#8217;autres types de m&#233;tho-
des automatiques de classification. La cat&#233;gorisation par th&#233;matique a &#233;t&#233; utilis&#233;e parce que celle-ci offrait une
lisibilit&#233; des r&#233;sultats obtenus, c&#8217;est un outil grossier mais &#233;clairant. Mais l&#8217;ambigu&#239;t&#233; r&#233;f&#233;rentielle ou l&#8217;ambigu&#239;t&#233;
caus&#233;e par trop de g&#233;n&#233;ralit&#233;, gagnerait &#224; &#234;tre observ&#233;e &#224; travers une repr&#233;sentation de l&#8217;information diff&#233;rente.
La double cat&#233;gorisation de la base textuelle, cat&#233;gorisation th&#233;matique et clustering, nous permet de d&#233;buter
l&#8217;analyse de requ&#234;tes classifi&#233;es, et de mettre en relation une requ&#234;te avec un ou plusieurs clusters de documents
d&#233;gageant ainsi des groupements pertinents.
</p>
<p>Dans la perspective d&#8217;un rep&#233;rage de l&#8217;ambigu&#239;t&#233; des requ&#234;tes, nous pensons que la combinaison des moyens de
classification avec d&#8217;autres indices pourrait &#234;tre fructueuse, comme par exemple la reformulation de requ&#234;tes. Mais
c&#8217;est une mesure &#224; ne pas dissocier du comportement utilisateur, le cadre applicatif joue sur la reformulation ainsi
que le mode de consommation (dans le cas de l&#8217;actu un &#171; mur &#187; interactif permet de consommer de l&#8217;actualit&#233; sans
faire de requ&#234;tes). Cette exp&#233;rimentation m&#233;rite donc d&#8217;&#234;tre compl&#233;t&#233;e. Elle constitue un pr&#233;alable &#224; un potentiel
rep&#233;rage de l&#8217;ambigu&#239;t&#233; et &#224; la mise en place d&#8217;aide pour l&#8217;utilisateur. Le rep&#233;rage est un outil pour avancer dans
la connaissance de la complexit&#233; des requ&#234;tes, ou pour assurer une meilleure expansion de requ&#234;te. Le traitement
de l&#8217;ambigu&#239;t&#233; en elle-m&#234;me peut passer par la proposition d&#8217;aide &#224; l&#8217;utilisateur (Hearst, 2009). Notre contexte
nous permet de d&#233;velopper une r&#233;ponse de ce type &#224; la manifestation de l&#8217;ambigu&#239;t&#233;. La pr&#233;sentation des r&#233;sultats
peut gagner &#224; l&#8217;injection de techniques de clustering et de classification, mais elle doit &#234;tre ma&#238;tris&#233;e et faire sens
pour l&#8217;utilisateur. De ce fait, la mise en place de tests utilisateurs est indispensable.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AARTS B. &amp; MACMAHON A. (2006). The Handbook of English Linguistics. Oxford : Blackwell.
</p>
<p>ARTILES J., BORTHWICK A., GONZALO J., SEKINE S. &amp; AMIG&#211; E. (2010). Weps-3 evaluation cam-
paign : Overview of the web people search clustering and attribute extraction tasks. In CLEF (Notebook Pa-
pers/LABs/Workshops).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FANNY LALLEMAN
</p>
<p>ARTILES J., GONZALO J. &amp; SEKINE S. (2007). The semeval-2007 weps evaluation : Establishing a benchmark
for the web people search task. In Proceedings of the 4th International Workshop on Semantic Evaluations
(Semeval-2007).
</p>
<p>BERNARDINI A., CARPINETO C. &amp; D&#8217;AMICO M. (2009). Full-subtopic retrieval with keyphrase-based search
results clustering. In Proceedings of the 2009 IEEE/WIC/ACM International Joint Conference on Web Intelli-
gence and Intelligent Agent Technology - Volume 01, WI-IAT &#8217;09, p. 206&#8211;213, Washington, DC, USA : IEEE
Computer Society.
</p>
<p>CLOUGH P., SANDERSON M., ABOUAMMOH M., NAVARRO S. &amp; PARAMITA M. L. (2009). Multiple ap-
proaches to analysing query diversity. In SIGIR, p. 734&#8211;735.
</p>
<p>DARWISH K. &amp; OARD D. W. (2003). Probabilistic structured query methods. In Proceedings of the 26th
annual international ACM SIGIR conference on Research and development in informaion retrieval, SIGIR &#8217;03,
p. 338&#8211;344, New York, NY, USA : ACM.
</p>
<p>ERHMANN M. (2008). Les Entit&#233;s Nomm&#233;es, de la linguistique au TAL : statut th&#233;orique et m&#233;thodes de
d&#233;sambigu&#239;sation. PhD thesis, Paris VII.
</p>
<p>GAN Q., ATTENBERG J., MARKOWETZ A. &amp; SUEL T. (2008). Analysis of geographic queries in a search
engine log. In Proceedings of the first international workshop on Location and the web, LOCWEB &#8217;08, p.
49&#8211;56, New York, NY, USA : ACM.
</p>
<p>HEARST M. A. (2006). Clustering versus faceted categories for information exploration. Communications of
the ACM, 49, 59&#8211;61.
HEARST M. A. (2009). Search User Interfaces. Cambridge University Press.
</p>
<p>KRIPKE S. A. (1980). Naming and Necessity. Harvard University Press.
</p>
<p>KROVETZ R. &amp; CROFT W. B. (1992). Lexical ambiguity and information retrieval. ACM Trans. Inf. Syst., 10,
115&#8211;141.
</p>
<p>LECOLLE M. (2007). Polysignifiance du toponyme, historicit&#233; du sens et interpr&#233;tation en corpus. Le cas Out-
reau. Corpus, (6), 101&#8211;125.
</p>
<p>RAHURKAR M. A., ROTH D. &amp; HUANG T. S. (2008). Which &quot;Apple&quot; are you talking about ? In Proceeding of
the 17th international conference on World Wide Web, WWW &#8217;08, p. 1197&#8211;1198, New York, NY, USA : ACM.
</p>
<p>SANDERSON M. (2000). Retrieving with good sense. Information Retrieval, 2(1), 45&#8211;65.
SANDERSON M. (2008). Ambiguous queries : test collections need more sense. In SIGIR, p. 499&#8211;506.
</p>
<p>SANTAMAR&#205;A C., GONZALO J. &amp; ARTILES J. (2010). Wikipedia as sense inventory to improve diversity in
web search results. In ACL, p. 1357&#8211;1366.
</p>
<p>SONG R., LUO Z., NIE J.-Y., YU Y. &amp; HON H.-W. (2009). Identification of ambiguous queries in web search.
Information Processing and Management, 45(2), 216&#8211;229.
SPINK A., JANSEN B. J. &amp; PEDERSEN J. (2004). Searching for people on web search engine. Journal of
Documentation, 60(3), 266&#8211;278.
STOKOE C., OAKES M. P. &amp; TAIT J. (2003). Word sense disambiguation in information retrieval revisited. In
SIGIR, p. 159&#8211;166.
</p>
<p>VOORHEES E. M. (1993). Using wordnet to disambiguate word senses for text retrieval. In SIGIR, p. 171&#8211;180.
</p>
<p>WEISS S. F. (1973). Learning to disambiguate. Information Storage and Retrieval, 9(1), 33&#8211;41.
ZHAI C. X., COHEN W. W. &amp; LAFFERTY J. (2003). Beyond independent relevance : methods and evalua-
tion metrics for subtopic retrieval. In Proceedings of the 26th annual international ACM SIGIR conference on
Research and development in informaion retrieval, SIGIR &#8217;03, p. 10&#8211;17.</p>

</div></div>
</body></html>