<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction Automatique d'Informations P&#233;dagogiques Pertinentes &#224; partir de Documents Textuels</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>Extraction Automatique d'Informations P&#233;dagogiques Pertinentes &#224; 
partir de Documents Textuels  
</p>
<p> 
 
</p>
<p>Boutheina Smine1,2  Rim Faiz2  Jean-Pierre Descl&#233;s1 
</p>
<p>(1) LaLIC, Universit&#233; Paris-Sorbonne, 28 rue Serpente, 75006 Paris, France. 
Boutheina.Smine@etudiants.univ-paris4.fr , Jean-pierre.Descles@paris4.sorbonne.fr 
</p>
<p>(2) LaRODEC, IHEC de Carthage, 2016 Carthage Pr&#233;sidence, Tunisie. Rim.Faiz@ihec.rnu.tn 
 
</p>
<p>R&#201;SUM&#201;. Plusieurs utilisateurs ont souvent besoin d'informations p&#233;dagogiques pour les 
int&#233;grer dans  leurs ressources p&#233;dagogiques, ou pour les utiliser dans un processus 
d'apprentissage. Une indexation de ces informations s'av&#232;re donc utile en vue d'une 
extraction des informations p&#233;dagogiques pertinentes en r&#233;ponse &#224; une requ&#234;te utilisateur. 
La plupart des syst&#232;mes d'extraction d'informations p&#233;dagogiques existants proposent une 
indexation bas&#233;e sur une annotation manuelle ou semi-automatique des informations 
p&#233;dagogiques, t&#226;che qui n'est pas pr&#233;f&#233;r&#233;e par les utilisateurs. Dans cet article, nous 
proposons une approche d'indexation d'objets p&#233;dagogiques (D&#233;finition, Exemple, Exercice, 
etc.) bas&#233;e sur une annotation s&#233;mantique par Exploration Contextuelle des documents. 
L'index g&#233;n&#233;r&#233; servira &#224; une extraction des objets pertinents r&#233;pondant &#224; une requ&#234;te 
utilisateur s&#233;mantique. Nous proc&#233;dons, ensuite, &#224; un classement des objets extraits selon 
leur pertinence en utilisant l'algorithme Rocchio. Notre objectif est de mettre en valeur une 
indexation &#224; partir de contextes s&#233;mantiques et non pas &#224; partir de seuls termes 
linguistiques.  
</p>
<p>ABSTRACT. Different users need pedagogical information in order to use them in their 
resources or in a learning process. Indexing this information is therefore useful for 
extracting relevant pedagogical information in response to a user request.  Several 
searching systems of pedagogical information propose manual or semi-automatic 
annotations to index documents, which is a complex task for users. In this article, we 
propose an approach to index pedagogical objects (Definition, Exercise, Example, etc.) 
based on automatic annotation of documents using Contextual Exploration. Then, we use 
the index to extract relevant pedagogical objects as response to the user's requests. We 
proceed to sort the extracted objects according to their relevance. Our objective is to reach 
the relevant objects using a contextual semantic analysis of the text. 
</p>
<p>MOTS-CL&#201;S : extraction d&#8217;informations, objets p&#233;dagogiques, carte s&#233;mantique, 
exploration contextuelle, algorithme Rocchio 
</p>
<p>KEYWORDS : Information retrieval, pedagogical objects, semantic map, Contextual 
Exploration, Rocchio algorithm </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOUTHEINA SMINE, RIM FAIZ, JEAN-PIERRE DESCLES 
 
</p>
<p>1 Introduction 
</p>
<p>Avec la croissance rapide de la quantit&#233; d'information disponible en ligne et dans les bases de donn&#233;es, les 
moteurs de recherche jouent un r&#244;le important dans l'apprentissage en ligne, car ils peuvent soutenir 
l'apprenant dans sa recherche d'informations n&#233;cessaires &#224; son apprentissage, &#224; sa formation, etc. Toutefois, 
ces syst&#232;mes de recherche d'information sont bas&#233;s sur l'indexation des termes sans tenir compte de la 
s&#233;mantique du contenu p&#233;dagogique (Dehors et al., 2005), (Buffa et al.,  2005). Une meilleure alternative 
est de proposer une approche d'indexation bas&#233;e sur l'annotation s&#233;mantique des informations p&#233;dagogiques 
qui sont attest&#233;es dans les documents. Par une telle indexation, les informations p&#233;dagogiques pr&#233;sent&#233;es 
par l'auteur d'un document sont captur&#233;es et le processus d'apprentissage ou d'enseignement pour l'&#233;l&#232;ve ou 
l'enseignant respectivement est facilit&#233;. 
</p>
<p>Nous proposons, dans cet article, une approche d'indexation automatique d'informations p&#233;dagogiques &#224; 
partir de documents. Notre travail consiste d'abord &#224; annoter les segments textuels (objets) refl&#233;tant un 
contenu p&#233;dagogique (D&#233;finition, Exemple, Exercice, etc.). Ensuite, nous proc&#233;dons &#224; une indexation de 
ces objets annot&#233;s pour extraire ceux qui sont pertinents par rapport &#224; une requ&#234;te utilisateur. Enfin, nous 
proc&#233;dons &#224; un classement de ces objets en utilisant l'algorithme de classification Rocchio. 
</p>
<p>Dans la section 2, nous positionnons cette contribution par rapport aux travaux existants. Nous consacrons 
la section 3 &#224; la d&#233;finition de la notion d'objet p&#233;dagogique. Une description d&#233;taill&#233;e de notre approche 
d'indexation d'informations p&#233;dagogiques est le sujet de la quatri&#232;me section. Avant de conclure, nous 
illustrons les r&#233;sultats des exp&#233;rimentations de notre approche dans la cinqui&#232;me section.  
</p>
<p>2 Etat des lieux autour de la recherche d'informations p&#233;dagogiques 
</p>
<p>Nous d&#233;taillons ici divers points de l'&#233;tat de l'art li&#233;s &#224; notre approche d'indexation d'objets p&#233;dagogiques, &#224; 
savoir l'annotation, l'indexation, et l'extraction d'informations p&#233;dagogiques &#224; partir de documents textuels.  
</p>
<p>L'annotation comme technique d'indexation est appliqu&#233;e dans plusieurs syst&#232;mes comme le syst&#232;me QBLS 
(Dehors et al., 2005) qui est une partie de la plateforme TRIAL SOLUTION (Buffa et al.,  2005). Dans 
cette derni&#232;re,  les utilisateurs annotent les livres manuellement selon le r&#244;le p&#233;dagogique de leur contenu, 
les sujets abord&#233;s dans leur contenu (mots cl&#233;s) et leurs relations avec d'autres ressources (r&#233;f&#233;rence, 
pr&#233;requis, etc.). Le syst&#232;me QBLS a pour but de structurer le cours en se r&#233;f&#233;rant &#224; une ontologie 
p&#233;dagogique constitu&#233;e de fiches  (d&#233;finition, exemple, &#233;nonc&#233;, proc&#233;dure, solution, etc.) et de ressources 
p&#233;dagogiques abstraites (cours, th&#232;me, notion, question). Il existe aussi le syst&#232;me SYFAX  (Smei et al., 
2005) qui annote semi-automatiquement le document p&#233;dagogique selon plusieurs crit&#232;res (type du 
document, point de vue de l'utilisateur sur le document, etc.). 
</p>
<p>En vue d'indexer les documents, les annotations propos&#233;es par les diff&#233;rents syst&#232;mes cit&#233;s ci-dessus sont 
stock&#233;es dans un entrep&#244;t de connaissances p&#233;dagogiques. Par la suite, les r&#233;ponses aux requ&#234;tes sont 
extraites &#224; partir de cet entrep&#244;t gr&#226;ce &#224; un moteur de recherche (Corese pour le syst&#232;me QBLS). Le 
syst&#232;me SYFAX applique un processus de raffinement de la requ&#234;te bas&#233; sur une ontologie des types de 
documents p&#233;dagogiques et une autre ontologie des domaines des documents informatiques. Ceci permet 
d'extraire les documents pertinents par rapport &#224; la requ&#234;te. 
</p>
<p>Pour tous les syst&#232;mes pr&#233;sent&#233;s ci-dessus, une intervention humaine est requise afin d'enrichir les 
documents par des m&#233;tadonn&#233;es. Cependant, la plupart des producteurs de ressources p&#233;dagogiques ne 
s'int&#233;ressent probablement pas au retour aux documents pour annoter leurs propres travaux. Notre travail se 
place dans cette perspective tout en proc&#233;dant &#224; l'automatisation du processus d'annotation. 
</p>
<p>D'autres travaux se sont int&#233;ress&#233;s &#224; la recherche de ressources p&#233;dagogiques &#224; partir du web (Thomson et 
al., 2003). Toutefois, le but de leur travail est limit&#233; &#224; une extraction de m&#233;tadonn&#233;es (Travaux Dirig&#233;s, 
Programme, Travaux Pratiques) relatives au document en entier en vue de les annoter et de les classifier. 
Toujours dans la m&#234;me perspective, (Hassen et al., 2009) comparent l'efficacit&#233; des algorithmes Na&#239;ve 
Bayes et SVM dans la classification des ressources p&#233;dagogiques bas&#233;e sur un ensemble de propri&#233;t&#233;s 
(cat&#233;gorie du contenu, titre du cours, ann&#233;e, auteur, etc.). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>A notre connaissance, ces travaux de recherche portant sur l'indexation de documents p&#233;dagogiques se sont 
int&#233;ress&#233;s &#224; une indexation du document en l'annotant par un ensemble de m&#233;tadonn&#233;es relatives &#224; la 
totalit&#233; du document. D'autres approches bas&#233;es sur des patrons linguistiques ont &#233;t&#233; appliqu&#233;es dans 
plusieurs travaux pour extraire les d&#233;finitions &#224; partir de ressources p&#233;dagogiques afin de constituer un 
glossaire  (Westerhout et al., 2008) ou encore pour r&#233;pondre &#224; divers types de questions (Greenwood et al., 
2003). Cependant, les patrons sont appliqu&#233;s la plupart du temps &#224; extraire des objets p&#233;dagogiques de type 
&quot;D&#233;finition&quot; en raison de l'accessibilit&#233; des structures langagi&#232;res relatives &#224; ce type que ce soit sur le web 
(wikip&#233;dia, dictionnaires, etc.) ou dans d'autres sources comme les rapports, les manuels d'utilisation, etc. 
</p>
<p>Dans cet article, nous proposons une annotation automatique des informations p&#233;dagogiques avec des 
m&#233;tadonn&#233;es s&#233;mantiques (D&#233;finition, Exemple, Exercice, etc.). Ce qui nous permettrait d'indexer ces 
informations en vue d'une extraction des informations pertinentes par rapport &#224; une requ&#234;te utilisateur.  
</p>
<p>3 Notion d'objets p&#233;dagogiques 
</p>
<p>Un utilisateur &quot;extracteur&quot; d'informations p&#233;dagogiques pertinentes est guid&#233; dans sa lecture par certains 
passages, des segments textuels (phrases ou de paragraphes). L'hypoth&#232;se g&#233;n&#233;rale utilis&#233;e ici est d'essayer 
de reproduire ce que fait un humain, en particulier l'apprenant, en soulignant certains segments textuels 
refl&#233;tant un contenu p&#233;dagogique. Ces segments de type p&#233;dagogique, appel&#233;s objets p&#233;dagogiques, 
existent, g&#233;n&#233;ralement, dans les documents p&#233;dagogiques sous forme de d&#233;finitions, exemples, exercices, 
plan, questions et r&#233;ponses, etc. Un objet p&#233;dagogique peut &#234;tre d&#233;fini comme une entit&#233; num&#233;rique ou non 
(Flory, 2004) qui peut &#234;tre utilis&#233;e ou cit&#233;e dans un apprentissage. Dans notre cas, un objet p&#233;dagogique 
correspond &#224; un segment textuel refl&#233;tant un contenu p&#233;dagogique. 
</p>
<p>Un apprenant pourrait &#234;tre int&#233;ress&#233; par une d&#233;finition en formulant une requ&#234;te, par exemple: trouver les 
documents qui contiennent &quot;La d&#233;finition du langage SQL&quot;. Un autre utilisateur recherche, en explorant de 
nombreux textes (encyclop&#233;dies sp&#233;cialis&#233;es, manuels, articles), des exemples sur un concept (par exemple, 
&#171;l'inflation&#187; dans l'&#233;conomie, &#171;polys&#233;mique&#187; en linguistique, ..) pour l'int&#233;grer &#224; ses ressources 
p&#233;dagogiques. Un autre utilisateur peut &#234;tre int&#233;ress&#233;, &#224; la pratique des exercices sur un concept. L'objectif 
de ces types d'objets p&#233;dagogiques (D&#233;finition, Exemple, Exercice) est une annotation possible des 
segments textuels p&#233;dagogiques qui correspondent &#224; une recherche guid&#233;e afin d'en extraire des objets 
p&#233;dagogiques &#224; partir de textes. 
Chaque type p&#233;dagogique, comme nous l'avons mentionn&#233; ci-dessus, est explicitement indiqu&#233; par les 
marqueurs linguistiques identifiables dans les textes. Notre hypoth&#232;se est que chaque type d'objet 
p&#233;dagogique laisse des traces discursives dans le document texte. Les types d'objets p&#233;dagogiques sont 
d&#233;crits comme suit: 
</p>
<p>&#8226; D'une part, une relation complexe entre les concepts dans une structure &#171;carte s&#233;mantique&#187; 
(Figure 1) et d'autre part un ensemble de classes et sous-classes d'unit&#233;s linguistiques (indicateurs et 
indices). 
</p>
<p>&#8226; Un ensemble de r&#232;gles communautaires o&#249; chaque r&#232;gle concerne une classe d'indicateurs avec 
des indices diff&#233;rents. 
</p>
<p>La carte s&#233;mantique (Figure 1) est une organisation des types d'objets p&#233;dagogiques. Elle peut &#234;tre con&#231;ue 
aussi comme une ontologie des types d'objets p&#233;dagogiques ind&#233;pendamment des diff&#233;rents domaines 
d'application. En effet, les expressions de la carte s&#233;mantique pour un type d'objet sont les m&#234;mes dans 
diff&#233;rents domaines comme l'informatique, math&#233;matiques, gestion, ... car ces expressions sont utilis&#233;es par 
l'auteur pour exprimer une information p&#233;dagogique. Dans certains types de textes (textes narratifs, articles 
de presse,) les expressions p&#233;dagogiques ne sont pas pr&#233;sentes mais dans d'autres (support de cours, 
devoirs, travaux dirig&#233;s, ..), ces expressions organisent le texte et donnent des informations sur l'intention 
de l'auteur. 
</p>
<p>Le premier niveau de la carte s&#233;mantique (Figure 1) pr&#233;sente 6 types d'objets p&#233;dagogiques : (i) Cours, (ii) 
Plan, (iii) Exercice, (iv) Exemple, (v) D&#233;finition, (vi) Caract&#233;ristique. Par exemple, les r&#232;gles du type 
d'objet &quot;D&#233;finition&quot; sont d&#233;clench&#233;s par la pr&#233;sence de noms ou de verbes d&#233;finitoires (par exemple: &quot;est 
d&#233;fini&quot;, et l'annotation s&#233;mantique est attribu&#233;e si des indices linguistiques, comme les pr&#233;positions (l'indice 
de l'exemple pr&#233;c&#233;dent est &quot;par&quot;), sont trouv&#233;s dans le contexte de l'indicateur.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOUTHEINA SMINE, RIM FAIZ, JEAN-PIERRE DESCLES 
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1 : Carte s&#233;mantique des types d'objets p&#233;dagogiques 
</p>
<p>4 Approche propos&#233;e pour la recherche d'informations p&#233;dagogiques &#224; partir de 
documents  
</p>
<p>L'approche que nous proposons se d&#233;compose en deux principales parties: dans la premi&#232;re partie, nous 
proc&#233;dons &#224; une annotation s&#233;mantique des segments textuels repr&#233;sentant des objets p&#233;dagogiques (Smine 
et al., 2010). La deuxi&#232;me partie exploite les annotations g&#233;n&#233;r&#233;es par la premi&#232;re partie pour cr&#233;er un 
index qui est capable de localiser les segments textuels pertinents par rapport &#224; des requ&#234;tes associ&#233;es aux 
types p&#233;dagogiques (D&#233;finition, Exemple, Exercice, etc.). Pour classer les r&#233;ponses selon leurs pertinences, 
nous appliquons l'algorithme de classification Rocchio sur les objets p&#233;dagogiques extraits.  
</p>
<p>4.1 Annotation des objets p&#233;dagogiques 
</p>
<p>4.1.1 Segmentation 
</p>
<p>La segmentation est la d&#233;termination des limites des unit&#233;s linguistiques (unit&#233;s comme proposition, phrase, 
paragraphe, etc.). La segmentation des textes en petites unit&#233;s (phrases) reste encore une t&#226;che difficile &#224; 
r&#233;aliser, vu qu'un point suivi d'une majuscule ne peut pas d&#233;terminer le d&#233;but ou la fin d'un segment. Il est 
n&#233;cessaire de prendre en compte tous les marqueurs typographiques. Il existe des travaux qui consid&#232;rent 
l'aspect multilangue dans leur segmentation comme le travail de (Mourad, 2002) qui propose de d&#233;finir un 
segment textuel en se basant sur une &#233;tude syst&#233;matique des marques de ponctuation. Nous avons effectu&#233; 
la segmentation de nos documents en int&#233;grant  les r&#232;gles linguistiques d&#233;velopp&#233;es par Mourad. Pour 
chaque document segment&#233;, le r&#233;sultat obtenu est un fichier XML balis&#233; par des balises &lt;Section&gt;, 
&lt;Paragraphe&gt;, &lt;Phrase&gt;. 
</p>
<p>4.1.2 Annotation des objets p&#233;dagogiques 
</p>
<p>Pour annoter les objets, nous explorons la technique d&#8217;Exploration Contextuelle 'EC' (Descl&#233;s, 1997). C'est 
une technique de traitement linguistique et s&#233;mantique du langage, qui fait appel &#224; des marqueurs discursifs 
explicites (morph&#232;mes, mot, expression, etc.) caract&#233;ristiques d'une intention pragmatique de l'auteur. 'EC' 
consiste &#224; appliquer des r&#232;gles dans un contexte d&#233;termin&#233; par des indices. Elle a l'avantage d'&#234;tre 
ind&#233;pendante d'un domaine particulier, car les r&#232;gles d&#233;crivant les structures linguistiques sont 
ind&#233;pendantes d'un domaine particulier. C'est une m&#233;thode qui a &#233;t&#233; valid&#233;e par les travaux de (Djioua et 
al., 2006) et (Elkhlifi et al., 2010). En plus, 'EC' ne n&#233;cessite pas une analyse morphosyntaxique du texte, 
ce qui r&#233;duit consid&#233;rablement le temps d'ex&#233;cution pendant l'impl&#233;mentation de la m&#233;thode. 
</p>
<p>Par l&#8217;exploration contextuelle du contenu des documents, nous pouvons rep&#233;rer et annoter les objets 
p&#233;dagogiques contenu dans ces documents, par exemple, &#171; des exemples de requ&#234;tes SQL&#187;, &#171; des exercices 
sur le langage UML &#187;, &#171; les d&#233;finitions d&#8217;une ou de plusieurs notions &#187;, etc. Ces objets sont exprim&#233;s par 
des structures langagi&#232;res comme &#171; &#8230;se d&#233;finit par&#8230; &#187;, &#171; est d&#233;fini par&#8230; &#187; pour le type D&#233;finition ou 
&#171; Exercices sur&#8230; &#187;, &#171; Travaux dirig&#233;s &#187; pour le type Exercice. Ils sont explicitement indiqu&#233;s par des 
indicateurs linguistiques identifiables dans les textes (verbes, noms,  adjectifs). Ces indicateurs sont parfois 
polys&#233;miques, ils ont besoin d'indices linguistiques pour clarifier l'ind&#233;termination. Les relations reliant les 
</p>
<p>Sommaire 
</p>
<p>Objet P&#233;dagogique
</p>
<p>Cours D&#233;finition Exemple Exercice
Plan 
</p>
<p>Caract&#233;ristique 
</p>
<p>Cours Magistral 
Question &#224; choix multiple
</p>
<p>Cours int&#233;gr&#233; 
</p>
<p>Pr&#233;sentation Plan de cours 
</p>
<p>Table des mati&#232;res 
</p>
<p>Travaux Pratiques
</p>
<p>Travaux  dirig&#233;sApplication
</p>
<p>Etude de cas 
Explication Contre-exemple
</p>
<p>Illustration Cas particulier 
</p>
<p>Signe distinctif  
</p>
<p>Point fort 
</p>
<p>Point faible Explication 
</p>
<p>Signification 
</p>
<p>Formulation  de conditions</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>indicateurs aux indices sont d&#233;finis dans le cadre des r&#232;gles. Une r&#232;gle (IdR) se d&#233;clenche au moment de 
l'identification de l'un de ses indicateurs (Indicateur) ensuite elle essaye de localiser des indices 
linguistiques dans le contexte gauche (CL1, CL2) et/ou droite (CR1, CR2) de l'indicateur ce qui confirme ou 
non la valeur s&#233;mantique exprim&#233;e par l'indicateur. A chaque type d'objet p&#233;dagogique correspond un 
ensemble de r&#232;gles. Des exemples de r&#232;gles sont pr&#233;sent&#233;s dans le tableau suivant (Tableau 1). 
</p>
<p>IdR CL1 CL2 Indicateur CR1 CR2 Type|Sous-type de 
l'objet p&#233;dagogique 
</p>
<p>RD1 est|sont  d&#233;fini|d&#233;finie| 
d&#233;finis 
</p>
<p>par   D&#233;finition|Explication 
</p>
<p>RD2   est | sont  le|la|un|une 
</p>
<p>|des|les 
</p>
<p> D&#233;finition|Explication 
</p>
<p>RC1 La|Les 
</p>
<p>Des|Une  
</p>
<p> caract&#233;ristique|  
</p>
<p>caract&#233;ristiques 
</p>
<p>du|de|des est| 
</p>
<p>sont 
</p>
<p>Caract&#233;ristique|Signes 
distinctifs 
</p>
<p>RE1 Voici un|l'|les 
</p>
<p>|des  
</p>
<p>exemple| 
exemples 
</p>
<p>du|de|des  Exemple|Illustration 
</p>
<p>Tableau 1 : Des exemples de r&#232;gles  
</p>
<p>Nous avons ajout&#233; un composant &#224; chaque r&#232;gle qui repr&#233;sente l'emplacement du terme de la requ&#234;te &#224; 
rechercher dans le cadre du segment exprimant l'objet p&#233;dagogique. Le besoin d'ajouter ce composant est 
n&#233; de la variation de l'emplacement du terme &#224; rechercher avec la variation des structures langagi&#232;res 
exprimant les objets p&#233;dagogiques. Ceci permet d'identifier les segments textuels exprimant le type  d'objet 
p&#233;dagogique ainsi que le concept demand&#233;s par l'utilisateur. Par exemple, pour le m&#234;me type d'objet 
p&#233;dagogique &quot;D&#233;finition&quot; : le terme &#224; rechercher &quot;Maintenance&quot; peut  exister au d&#233;but du segment &quot;La 
maintenance est d&#233;finie comme l'ensemble des activit&#233;s destin&#233;s &#224; maintenir ou &#224; r&#233;tablir un bien dans un 
&#233;tat de s&#251;ret&#233; de fonctionnement&quot; ou au milieu du segment pour le cas &quot;L'AFNOR a d&#233;fini la maintenance 
comme &#233;tant l'ensemble des activit&#233;s de remise en &#233;tat de fonctionnement d'un syst&#232;me&quot;. Sans la 
consid&#233;ration de ce param&#232;tre, le syst&#232;me peut ne pas extraire l'objet demand&#233; par l'utilisateur comme par 
exemple, pour le type Cours, la plupart de ses r&#232;gles d'EC exigent un emplacement du terme de la requ&#234;te 
au niveau du Titre du document. Au cas o&#249; le terme est recherch&#233; ailleurs du titre, le r&#233;sultat de la 
recherche sera erron&#233;. 
</p>
<p>De ce fait, l'emplacement du terme est un param&#232;tre qui diff&#232;re d'une r&#232;gle &#224; une autre selon la structure 
langagi&#232;re exprim&#233;e par cette derni&#232;re. Nous avons d&#233;sign&#233; cet emplacement par une &#233;tiquette, qui prendra 
une valeur parmi un ensemble fini de valeurs d&#233;signant l'emplacement du terme par rapport aux indicateurs 
et indices. Par exemple, GIND indique le terme se place &#224; gauche de l'indicateur ou TITRE indique que 
l'emplacement du terme est au niveau du titre du document. En fait, dans plusieurs cas, le titre peut nous 
r&#233;v&#233;ler des connaissances  sur le contenu du document. 
</p>
<p>Pour chaque type d'objet de la carte s&#233;mantique (cf. Figure 1), nous avons d&#233;fini un ensemble de r&#232;gles qui 
couvrent toutes les formes linguistiques possibles de l'objet p&#233;dagogique. Nous avons commenc&#233; par un 
exemple textuel relatif &#224; chaque type pour g&#233;n&#233;raliser toutes les structures langagi&#232;res. Cette m&#233;thode 
permet de d&#233;finir de mani&#232;re incr&#233;mentale une base solide de r&#232;gles. Nous avons d&#233;velopp&#233; en totalit&#233; 
environ 200 r&#232;gles. L'ensemble des r&#232;gles d&#233;velopp&#233;es, ainsi que la carte s&#233;mantique forment les ressources 
linguistiques utilis&#233;es dans notre approche.  
</p>
<p>Nous prenons un extrait de texte &#224; partir d'un document p&#233;dagogique </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOUTHEINA SMINE, RIM FAIZ, JEAN-PIERRE DESCLES 
 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 2 : Un extrait d'un document p&#233;dagogique 
</p>
<p>Pour le type d'objet p&#233;dagogique &quot;D&#233;finition&quot;, la r&#232;gle RD2 (cf. Tableau 1), appliqu&#233;e &#224; l'exemple ci-
dessus, permet d'annoter la phrase &quot; SQL est un langage complet de gestion de bases de donn&#233;es 
relationnelles&quot;. Le type d'objet p&#233;dagogique est d&#233;tect&#233; gr&#226;ce &#224; l'expression &quot;est &quot; qui est une occurrence Ii 
de l'indicateur du type &quot;D&#233;finition&quot; et l'indice droit CR1 &quot;un&quot;. 
</p>
<p>Pour le type &quot;Cours&quot;, le rep&#233;rage de l'occurrence Ii au niveau du titre est suffisant pour annoter le document 
comme un cours. L'indicateur nominal de l'objet p&#233;dagogique est le mot &quot;Cours&quot;, et d'autres noms comme 
&quot;Chapitre, &quot;Notes de cours&quot;. A part le titre, l'existence de l'indicateur &quot;Cours&quot; n'implique pas l'annotation 
du document comme un cours. 
</p>
<p>Notons que la phrase &quot;Il n'est pas un langage conceptuel&quot; illustre le cas des indices n&#233;gatifs. En effet, la 
pr&#233;sence de l'expression &quot;n'&#8230;.pas&quot; annule l'annotation du segment comme D&#233;finition, malgr&#233; la pr&#233;sence 
de l'indicateur &quot;est&quot; et l'indice droit CR1 &quot;un&quot;. 
</p>
<p>Afin d'annoter le segment &quot; Il a &#233;t&#233; con&#231;u, dans les ann&#233;es 70, par IBM&quot; comme une &quot;Caract&#233;ristique&quot;, 
nous d&#233;tectons en premier lieu l'expression &quot;a &#233;t&#233; con&#231;u&quot; ensuite nous cherchons, dans le contexte droit de 
l'indicateur, le CR1 &quot;par&quot;. En cas o&#249; les deux &#233;l&#233;ments (Ii et CR1) sont pr&#233;sents, alors le syst&#232;me annote le 
segment comme une caract&#233;ristique. 
</p>
<p>Concernant le type d'objet &quot;Exercice&quot;, l'indicateur peut &#234;tre verbal (a) ou nominal (b), par exemple :  
</p>
<p>&#8226; (a) &quot;Formulez une clause SQL&#8230;&#8230;&#8230;&quot;  a comme indicateur verbal &quot;Formulez&quot; 
&#8226; (b) &quot;Exercices sur requ&#234;tes SQL&quot;, son indicateur est le nom &quot;Exercices&quot; 
</p>
<p>4.2 G&#233;n&#233;ration de l'index 
</p>
<p>Notre objectif, par l'annotation, est de g&#233;n&#233;rer un index s&#233;mantique contenant &#224; la fois des objets 
p&#233;dagogiques annot&#233;s selon leur type, en utilisant la m&#233;thode d'annotation d&#233;taill&#233;e ci-dessus, et 
l'emplacement du terme de la requ&#234;te sp&#233;cifi&#233; par la r&#232;gle appliqu&#233;e pour annoter l'objet. Cet index servira &#224; 
extraire les objets r&#233;pondant &#224; la requ&#234;te utilisateur. Les m&#233;tadonn&#233;es g&#233;n&#233;r&#233;es par les annotations des 
diff&#233;rents objets sont stock&#233;s dans une base de donn&#233;es. Pour chaque objet p&#233;dagogique annot&#233;, les 
m&#233;tadonn&#233;es suivantes sont introduites dans l'index : (1) L'objet p&#233;dagogique annot&#233; (OBJECT), (2) 
Chemin du document analys&#233; (PATH), (3) Type de l'objet annot&#233; (TYPE), (4) Identifiant de la r&#232;gle 
appliqu&#233;e pour annoter le segment (IDRule) et (5) L'emplacement du terme de la requ&#234;te (TERMEMP). La 
figure suivante (Figure 3) montre deux exemples d'objets annot&#233;s. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 3 : Deux exemples d'objets annot&#233;s et index&#233;s 
</p>
<p>Afin de pouvoir extraire les objets p&#233;dagogiques qui contiennent des termes de la requ&#234;te, nous avons 
utilis&#233; la base de synonymes WOLF (qui repr&#233;sente la partie traduite en Fran&#231;ais du dictionnaire WordNet) 
permettant d'enrichir la requ&#234;te en prenant en compte tous les termes &#233;quivalents au terme de la requ&#234;te. Ce 
</p>
<p>Chapitre 1 
</p>
<p>Pr&#233;sentation de SQL 
</p>
<p>SQL est un langage complet de gestion de bases de donn&#233;es relationnelles. Il n'est pas 
un langage conceptuel. Il a &#233;t&#233; con&#231;u,  dans les ann&#233;es 70, par IBM. Il est devenu le 
langage standard des syst&#232;mes de gestion de base de donn&#233;es (SGBD). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>dernier est remplac&#233; par la liste de ses synonymes. Ceci permet d'&#233;tendre le champ de la recherche. La 
requ&#234;te est ainsi compos&#233;e des termes &#224; rechercher (par exemple &quot;Langage SQL&quot;) et du type d'objets 
p&#233;dagogiques requis par l'utilisateur (par exemple : Exercice). 
</p>
<p>Gr&#226;ce &#224; un moteur de recherche (impl&#233;ment&#233; sous la plateforme Lucene), le syst&#232;me se connecte &#224; l'index 
g&#233;n&#233;r&#233; et retient les documents contenant des objets p&#233;dagogiques de m&#234;me type que celui &#233;nonc&#233; dans la 
requ&#234;te (Exercice). Ensuite, le moteur proc&#232;de &#224; une recherche des termes de la requ&#234;te (Langage SQL 
ainsi que ses synonymes) &#224; partir des objets annot&#233;s et index&#233;s. Cette recherche s'effectue dans 
l'emplacement d&#233;sign&#233; par la r&#232;gle avec laquelle est annot&#233; l'objet p&#233;dagogique. Par exemple, si 
l'emplacement du terme sp&#233;cifi&#233; par la r&#232;gle est DIND, le terme de la requ&#234;te est recherch&#233; &#224; droite de 
l'indicateur de la r&#232;gle appliqu&#233;e (Dans ce cas r&#232;gle de type Exercice). Dans le cas o&#249; la requ&#234;te est 
compos&#233;e du type p&#233;dagogique &quot;Exercice&quot; et le terme &#171;Langage SQL&quot;, le moteur de recherche proc&#232;de 
comme suit: 
</p>
<p>&#8226; il extrait tous les objets p&#233;dagogiques trouv&#233;s dans l'index associ&#233; &#224; l'annotation &#171;Exercice&#187; 
&#8226; Pour chaque objet extrait, il recherche le terme &quot;langage SQL&#187; et ses synonymes dans 
l'emplacement sp&#233;cifi&#233; par la r&#232;gle d'annotation. 
</p>
<p>&#8226; S&#233;lection, &#224; partir des objets p&#233;dagogiques extraits, les objets comportant une occurrence du 
terme &#171;langage SQL&#187; ou ses synonymes dans le bon emplacement. 
</p>
<p>&#8226; Afficher toutes les informations pr&#233;sentes dans l'index associ&#233; &#224; chaque objet p&#233;dagogique 
s&#233;lectionn&#233;.  
</p>
<p>4.3 Classement des objets p&#233;dagogiques 
</p>
<p>Apr&#232;s l'extraction des objets p&#233;dagogiques r&#233;pondant &#224; la requ&#234;te utilisateur, une autre &#233;tape suit pour 
classer les r&#233;ponses dans un ordre croissant selon leur similarit&#233; avec la requ&#234;te. Pour classer ces objets, 
nous avons utilis&#233; l'algorithme de Rocchio (Rocchio, 1971), adapt&#233; &#224; la classification des textes (Ittner et 
al., 1995). L'utilisateur choisit un concept pour le correspondre au terme de sa requ&#234;te, parmi une liste de 
15 concepts appartenant &#224; diff&#233;rents domaines (domaine de l'informatique, &#233;conomie, g&#233;nie m&#233;canique, 
biologie, etc.). Ce sont des concepts auxquels appartient l'ensemble des documents du corpus d'annotation 
et d'indexation. Le concept choisi repr&#233;sente la classe Cuser par rapport &#224; laquelle les objets seront class&#233;s 
selon leur pertinence.  Rappelons que nous consid&#233;rons un objet p&#233;dagogique comme un segment textuel 
ayant diff&#233;rentes tailles (Phrase, paragraphe, document, etc.) selon le type de l'objet. 
</p>
<p>Nous repr&#233;sentons les donn&#233;es (les objets d'apprentissage et de test) par des vecteurs de poids num&#233;riques. 
Le vecteur de poids pour le m i&#232;me objet p&#233;dagogique est Vm= (p1m, p2m,&#8230;&#8230;..,plm), o&#249; l est le nombre de 
termes index utilis&#233;s. Nous utilisons comme termes des mots singuliers et compos&#233;s. Nous adoptons la 
mesure de poids  TF-IDF (Salton, 1991) et nous d&#233;finissons le poids pkm comme suit :          
</p>
<p>&#8721; == lj jmj
k
</p>
<p>m
km
</p>
<p>k
nNf
</p>
<p>nNf
p
</p>
<p>1
)log(
</p>
<p>)log(  
</p>
<p>Avec N est le nombre total d'objets, n k est le nombre d'objets dans lesquels le terme index k appara&#238;t, et 
m
</p>
<p>kf  est :         
Sinon
q
</p>
<p>q
f mk
</p>
<p>0
1)log(
</p>
<p>0 =
&#9129;&#9128;
&#9127;
</p>
<p>+=
 
</p>
<p>Avec q est le nombre d'occurrences du terme index k dans l'objet m. Dans l'algorithme de Rocchio, un 
prototype est produit pour chaque classe C. Ce prototype est repr&#233;sent&#233; par un vecteur singulier jc
</p>
<p>r
 de 
</p>
<p>m&#234;me dimension que le vecteur de poids original v1, &#8230;&#8230;&#8230;, vN. Pour chaque classe C, the k i&#232;me terme 
dans son prototype est d&#233;fini comme 
</p>
<p>                &#8721;&#8721; &#8713;&#8712; &#8722;= jj Cm mkjCm
m
k
</p>
<p>j
</p>
<p>p
CN
</p>
<p>p
C
</p>
<p>&#946;&#945; _cjr  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOUTHEINA SMINE, RIM FAIZ, JEAN-PIERRE DESCLES 
 
</p>
<p>Avec Cj est l'ensemble de documents appartenant &#224; la classe C. Les param&#232;tres &#945; et &#946;  contr&#244;lent la 
contribution des exemples positifs et n&#233;gatifs par rapport au vecteur prototype. Nous utilisons les valeurs 
standards &#945; =4 et &#946; = 16 (Buckley et al., 1994). 
</p>
<p>Une fois l'apprentissage achev&#233;, nous classons les nouveaux objets fournis comme r&#233;ponses &#224; la requ&#234;te 
utilisateur. Ce classement se fait selon leur pertinence  par rapport &#224; la classe Cuser choisie par l'utilisateur. 
Les objets &#224; classer sont tout d'abord convertis en vecteurs de poids, et puis compar&#233;s aux vecteurs de poids 
prototypes des diff&#233;rentes classes en utilisant la mesure de similarit&#233; cosinus. 
</p>
<p>La mesure de similarit&#233; entre l'objet de vecteur O
r
</p>
<p>et la classe Cuser de vecteur userC
r
</p>
<p>est d&#233;finie comme :   
</p>
<p>OC
OCOC
</p>
<p>userl
</p>
<p>user
user rr
</p>
<p>rrrr *),cos( =  
</p>
<p>Les objets ayant une valeur de similarit&#233; avec la classe Cuser sup&#233;rieure &#224; un seuil &#952; sont s&#233;lectionn&#233;s, 
ensuite class&#233;s dans un ordre croissant selon la valeur de leurs similarit&#233;s par rapport &#224; la classe Cuser. La 
valeur du seuil &#952; varie selon le type d'objet p&#233;dagogique. Par exemple, un objet annot&#233; par le type &quot;Cours&quot; 
contient plus de termes significatifs qu'un objet annot&#233; par le type &quot;Exercice&quot; (&#952;Course &lt; &#952;Exercice). Nous ne 
prenons en compte que les valeurs positives de la mesure de similarit&#233;. Les objets s&#233;lectionn&#233;s sont alors 
affich&#233;s pour constituer la fiche p&#233;dagogique demand&#233;e par l'utilisateur. Une fiche p&#233;dagogique rassemble 
les objets p&#233;dagogiques de type celui exprim&#233;e par l'utilisateur dans sa requ&#234;te et correspondant au m&#234;me 
concept  que celui recherch&#233; par l'utilisateur. Cette fiche permet une accessibilit&#233; aux objets directement 
sans avoir acc&#232;s au document en entier. 
</p>
<p>5 Exp&#233;rimentations et R&#233;sultats 
</p>
<p>L&#8217;objectif de cette &#233;tape est d&#8217;&#233;valuer les performances des diff&#233;rents modules. Un des indicateurs 
importants est donc le nombre des r&#233;ponses pertinentes par rapport au nombre de documents index&#233;s. Pour 
valider notre approche d'indexation d&#8217;objets p&#233;dagogiques, nous avons d&#233;velopp&#233; le syst&#232;me SRIDoP 
(Syst&#232;me de Recherche d'Informations &#224; partir de Documents P&#233;dagogiques) en utilisant le langage Java 
sous l'environnement Eclipse et le syst&#232;me de gestion de base de donn&#233;es Oracle. SRIDoP comporte les 
trois modules suivants : Annotation et indexation des objets p&#233;dagogiques selon leurs types, Appariement 
entre la requ&#234;te utilisateur et les objets p&#233;dagogiques index&#233;s, et Classement des objets p&#233;dagogiques. 
</p>
<p>Notre corpus d'apprentissage ainsi que celui du test est le m&#234;me pour toutes les &#233;tapes d'annotation, 
d'indexation et de classification. Pour le corpus d'apprentissage, nous avons collect&#233; un ensemble de 
documents couvrant 15 concepts (ceux utilis&#233;s dans la g&#233;n&#233;ration de fiches p&#233;dagogiques). En fait, pour 
chacun de ces concepts, une requ&#234;te a &#233;tait formul&#233;e et ex&#233;cut&#233;e sur le moteur de recherche Google. Les 20 
premiers r&#233;sultats sont collect&#233;s. Notons que le sens de quelques termes peut &#234;tre ambigu, par exemple 
&quot;Base&quot; ou &quot;Enregistrement&quot;. Pour d&#233;sambigu&#239;ser la requ&#234;te, nous ajoutons le terme &quot;Donn&#233;es&quot;. Pour faire 
disparaitre l'ambigu&#239;t&#233;, nous misons sur le type p&#233;dagogique des documents retourn&#233;s en r&#233;ponse. Les 
documents collect&#233;s sont constitu&#233;s de 60 supports de cours, 65 Travaux Dirig&#233;s, 83 Pr&#233;sentation 
PowwerPoint, 30 Travaux Pratiques, et quelques documents de diff&#233;rentes natures (articles de Presse, 
articles scientifiques, etc.). La longueur moyenne de ces documents constituant le corpus d'apprentissage 
est 23 pages. 
</p>
<p>Notre corpus de test est compos&#233; de 1000 documents, principalement de nature p&#233;dagogique : des Supports 
de cours, des Travaux Dirig&#233;s, des pr&#233;sentations PowerPoint, des Travaux Pratiques, des manuels 
d'utilisation, et d'autres documents de diff&#233;rentes natures. La longueur moyenne des documents est 53.6 
pages. Les documents ont diff&#233;rents formats (DOC, PDF, HTML, PPT, etc.). 
</p>
<p>5.1 Premi&#232;re &#233;tape : Annotation des objets p&#233;dagogiques 
</p>
<p>Pour &#233;valuer le processus d'annotation, le corpus de test a &#233;t&#233; annot&#233; par deux experts : pour chaque objet 
p&#233;dagogique rep&#233;r&#233;, ils pr&#233;cisent son type. Les r&#233;sultats du processus d'annotation effectu&#233; par notre 
syst&#232;me SRIDoP sont illustr&#233;s dans le Tableau 2. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>Type de l'objet  
p&#233;dagogique NOA NOAC NOMAC 
</p>
<p>Pr&#233;cision 
(%) Rappel (%) F-Mesure (%) 
</p>
<p>Plan 88 85 98 96,59 86,73 91,40 
</p>
<p>Cours 72 60 85 83,33 70,59 76,43 
</p>
<p>D&#233;finition 228 140 266 61,40 52,63 56,68 
</p>
<p>Caract&#233;ristique 139 124 156 89,21 79,49 84,07 
</p>
<p>Exemple 357 349 376 97,76 92,82 95,23 
</p>
<p>Exercice 760 705 776 92,76 90,85 91,80 
</p>
<p>Tableau 2 : Les r&#233;sultats de l'&#233;tape Annotation   
</p>
<p>NOA
NOAC&#233;cision =Pr           
</p>
<p>NOMAC
NOACRappel =            
</p>
<p>Rappel&#233;cision
Rappel&#233;cisionMesureF +=&#8722; Pr
</p>
<p>*Pr*2
 
</p>
<p>Avec : NOA : Nombre d'objets annot&#233;s, NOAC : Nombre d'objets annot&#233;s correctement, NOMAC: 
Nombre d'objets annot&#233;s par les experts. 
</p>
<p>Nous remarquons que la pr&#233;cision de l&#8217;annotation d&#233;passe les 85% pour la plupart des types d'objets 
(Exemple, Exercice, Plan, etc.). Notons que, pour le type &#171; D&#233;finition &#187;, cette pr&#233;cision est moyenne. Ceci 
d&#233;rive du fait que certaines r&#232;gles peuvent annoter &#224; la fois des &#233;nonc&#233;s d&#233;finitoires ou non. Tel le cas de la 
r&#232;gle &#171; R2 &#187; ayant comme indicateur l&#8217;occurrence &#171;est un&#187;. Cet indicateur peut identifier un segment de 
nature d&#233;finitoire (exemple : &#171; UML est un langage de mod&#233;lisation conceptuelle orient&#233; objet &#187;) ou un 
autre segment de nature non d&#233;finitoire (exemple : &#171; Le facteur temps est un des plus importants dans la 
r&#233;alisation d&#8217;un projet &#187;). Pendant la phase d&#8217;exp&#233;rimentation, nous avons pu constater aussi que la qualit&#233; 
de l&#8217;annotation est &#233;troitement li&#233;e &#224; la qualit&#233; de la segmentation du document. 
</p>
<p>5.2 Deuxi&#232;me &#233;tape : Indexation des objets p&#233;dagogiques 
</p>
<p>A travers une interface de recherche d&#8217;informations, l&#8217;utilisateur saisit les termes &#224; rechercher, et choisit le 
type (et sous-type) de l'objet p&#233;dagogique relatif au terme &#224; rechercher. Les r&#233;ponses aux requ&#234;tes sont 
affich&#233;es sous forme de liens permettant d&#8217;acc&#233;der &#224; l'objet p&#233;dagogique r&#233;pondant au besoin de 
l'utilisateur. Pour tester ce module de recherche d'objets p&#233;dagogiques, nous avons formul&#233; les  m&#234;mes 25 
requ&#234;tes pour chacun des types d'objets p&#233;dagogiques. Ces requ&#234;tes appartiennent aux diff&#233;rents domaines 
du corpus. Pour chaque type d'objet, nous avons illustr&#233; le nombre de r&#233;ponses ramen&#233;es et le nombre de 
r&#233;ponses jug&#233;es pertinentes compte tenu de l'ensemble des requ&#234;tes formul&#233;es. Les r&#233;sultats sont r&#233;sum&#233;s 
dans le tableau suivant (Tableau 3).  
</p>
<p>Type de l'objet p&#233;dagogique 
exprim&#233; par  la requ&#234;te NR NRP NRRU Pr&#233;cision (%) Rappel (%) F-Mesure (%)
</p>
<p>Plan 72 66 77 91,67 85,71 88,59 
</p>
<p>Cours 43 35 54 81,40 64,81 72,16 
</p>
<p>D&#233;finition 156 112 193 71,79 58,03 64,18 
</p>
<p>Caracteristique 94 86 112 91,49 76,79 83,50 
</p>
<p>Exemple 213 198 230 92,96 86,09 89,39 
</p>
<p>Exercice 517 465 520 89,94 89,42 89,68 
</p>
<p>Tableau 3 : Les r&#233;sultats de l'&#233;tape d'appariement Documents-Requ&#234;te 
</p>
<p>NR
NRP&#233;cision =Pr                        
</p>
<p>NRRU
NRPRappel =                 
</p>
<p>Rappel&#233;cision
Rappel&#233;cisionMesureF +=&#8722; Pr
</p>
<p>*Pr*2
 
</p>
<p>Avec : NR : Nombre d'objets (r&#233;ponses) retourn&#233;s &#224; l'utilisateur, NRP : Nombre d'objets (r&#233;ponses) 
pertinents retourn&#233;es &#224; l'utilisateur, NRRU: Nombre d'objets pertinents. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOUTHEINA SMINE, RIM FAIZ, JEAN-PIERRE DESCLES 
 
</p>
<p>A l'issue de ces exp&#233;rimentations, nous remarquons que les r&#233;sultats de l'indexation d'informations 
p&#233;dagogiques sont &#233;troitement li&#233;s aux r&#233;sultats de l'annotation (cf. Figure 4). La valeur de &quot;F-Mesure&quot; de 
l'extraction &#233;volue avec la valeur de &quot;F-Mesure&quot; de l'annotation. Ceci s'explique par le fait, que l'extraction 
est effectu&#233;e &#224; partir d'objets p&#233;dagogiques annot&#233;s et index&#233;s. La qualit&#233; de la recherche s'am&#233;liore en 
am&#233;liorant celle de l'annotation. Cette derni&#232;re est elle-m&#234;me d&#233;pendante de la qualit&#233; de segmentation 
comme nous l'avons d&#233;j&#224; mentionn&#233;.  
</p>
<p>F-Mesure
</p>
<p>0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>76,43 84,07 91,4 91,8 95,23
</p>
<p>Annotation
</p>
<p>R
ec
</p>
<p>he
rc
</p>
<p>he
</p>
<p>F-Mesure
</p>
<p> 
</p>
<p>Figure 4 : Evolution des r&#233;sultats de la recherche par rapport &#224; celles de l'annotation 
</p>
<p>5.3 Troisi&#232;me &#233;tape : Classement des objets pertinents 
</p>
<p>Apr&#232;s une extraction des objets p&#233;dagogiques, nous classons ces objets selon leur similarit&#233; avec la classe 
Cuser. Suite &#224; plusieurs exp&#233;rimentations, nous avons fix&#233; la valeur du seuil &#952; : 
</p>
<p>&#8226; 0.1   pour les types &quot;Cours&quot; et &quot;D&#233;finition&quot;,  
&#8226; 0.3  pour les types &quot;Plan&quot; et &quot;Exemple&quot;,  
&#8226; 0.45   pour les types &quot;Caract&#233;ristique&quot; et &quot;Exercice&quot;.  
Notons que d'un c&#244;t&#233;, diminuer la valeur de &#952; r&#233;duit l'ensemble des objets pertinents retourn&#233;s &#224; 
l'utilisateur. D'un autre c&#244;t&#233;, augmenter la valeur de &#952; am&#232;ne &#224; une s&#233;lection des objets non pertinents. 
</p>
<p>Nous avons assign&#233; chaque objet &#224; l'une de ces trois cat&#233;gories : A (objets class&#233;s comme pertinents), B 
(objets class&#233;s correctement comme pertinents), C (objets pertinents). Les valeurs de pr&#233;cision, de rappel et 
de F-Mesure sont calcul&#233;es pour chaque type d'objet p&#233;dagogique comme suit :  
</p>
<p>A
B&#233;cision =Pr                
</p>
<p>C
BRappel =               
</p>
<p>Rappel&#233;cision
Rappel&#233;cisionMesureF +=&#8722; Pr
</p>
<p>*Pr*2
 
</p>
<p>Nous illustrons ces valeurs relatives &#224; chacun des types d'objets dans la Figure 5. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 5 : Pr&#233;cision, Rappel et F-Mesure de l'&#233;tape de classement des objets 
</p>
<p>65,00 
</p>
<p>70,00 
</p>
<p>75,00 
</p>
<p>80,00 
</p>
<p>85,00 
</p>
<p>90,00 
</p>
<p>Pla
n
</p>
<p>Co
urs
</p>
<p>D&#233;
fin
</p>
<p>itio
n
</p>
<p>Ca
rac
</p>
<p>t&#233;r
ist
</p>
<p>iqu
e
</p>
<p>Ex
em
</p>
<p>ple
</p>
<p>Ex
erc
</p>
<p>ice
</p>
<p>Pr&#233;cision
Rappel
F-Mesure</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>La figure ci-dessus pr&#233;sente, pour chaque type d'objet (repr&#233;sent&#233; sur l'axe des abscisses), sa valeur de 
pr&#233;cision repr&#233;sent&#233;e en bleu, sa valeur de rappel en pointill&#233; et sa valeur de F-Mesure repr&#233;sent&#233;e en 
rayures. Nous constatons que les valeurs de pr&#233;cision sont comprises entre 75% et 87% et que celles du 
rappel entre 74% et 85%. Notons que l'&#233;tape de classement ne d&#233;pend pas strictement de celles de 
l'annotation et d'appariement mais plut&#244;t d'autres param&#232;tres comme le corpus d'apprentissage, le choix des 
termes index, etc. 
</p>
<p>6 Conclusion et Perspectives 
</p>
<p>Dans cet article, nous avons propos&#233; une approche d'indexation d'objets p&#233;dagogiques bas&#233;e sur une 
annotation s&#233;mantique du texte par exploration contextuelle en vue d'une extraction des objets 
p&#233;dagogiques pertinents. Actuellement, notre travail pr&#233;sente un int&#233;r&#234;t important dans plusieurs domaines 
d'application comme l'apprentissage en ligne, l'enseignement &#224; distance (e-learning), l'&#233;ducation, etc. Pour 
&#233;valuer notre approche, nous avons d&#233;velopp&#233; le syst&#232;me SRIDoP qui comprend les modules d'annotation, 
d'indexation, et de classement des objets selon leur pertinence. Nous remarquons, &#224; travers les r&#233;sultats 
d&#8217;&#233;valuation, que notre approche permet d&#8217;avoir acc&#232;s aux connaissances qui sont exprim&#233;es dans les textes 
selon un type donn&#233;, et de ramener des &#233;nonc&#233;s qu&#8217;un syst&#232;me de recherche d&#8217;informations classique ne 
parvient &#224; capter par son approche d&#8217;indexation par mots cl&#233;s. 
</p>
<p>L'un des travaux futurs que nous envisageons est l'extension de la carte s&#233;mantique des types d'objets 
p&#233;dagogiques par d'autres types comme M&#233;thode, Auteur, Date, etc. Nous pensons aussi &#224; la proposition 
d'une fonction score qui fusionne les r&#233;sultats des deux modules d'annotation et de classement en vue de 
s&#233;lectionner les r&#233;sultats pertinents. 
</p>
<p>Bibliographie 
</p>
<p>BUCKLEY C., SALTON G., ALLAN J. (1994). The effect of adding relevance information in a relevance 
feedback environment. Actes de International ACM SIGIR Conference, 292-300. 
</p>
<p>BUFFA M., DEHORS S., FARON-ZUCKER C., SANDER P. (2005). Vers une approche Web S&#233;mantique dans la 
conception d&#8217;un syst&#232;me d&#8217;apprentissage. Revue du projet TRIAL SOLUTION, AFIA. 
</p>
<p>DEHORS S., FARON-ZUCKER C., STROMBONI J.P., GIBOIN A. (2005). Des annotations S&#233;mantiques pour 
apprendre : l&#8217;Exp&#233;rimentation QBLS. WebLearn. 
</p>
<p>DESCLES J.P. (1997). Syst&#232;me d&#8217;exploration Contextuelle. Co-texte et calcul du sens, Caen, 215-232. 
</p>
<p>DJIOUA B., FLORES, J.G, BLAIS A., DESCLES J.P., GUIBERT G., JACKIEWIEZ A., LE PRIOL F., NAIT BAHA L., 
SAUZAY B. (2006) Excom: an automatic annotation engine for semantic information. Dans Proc. 
FLAIRS, AAAI Press, Florida, 285-290. 
</p>
<p>ELKHLIFI A., FAIZ R. (2009). Automatic Annotation Approach of Events in News Articles. International 
Journal of Computing &amp; Information Sciences, 19-28. 
</p>
<p>Elkhlifi A., FAIZ, R. (2010). French-Written Event Extraction Based on Contextual Exploration. Dans Proc. 
FLAIRS, AAAI Press, Florida. 
</p>
<p>FLORY L. (2004). Les caract&#233;ristiques d'une ressource p&#233;dagogique et les besoins d'indexation qui en 
r&#233;sultent. Journ&#233;e d'&#233;tude sur l'Indexation des ressources p&#233;dagogiques num&#233;riques, Ennsib, 
Villeurbanne. 
</p>
<p>GREENWOOD M.A., SAGGION H. (2004). A Pattern Based Approach to Answering Factoid, List and 
Definition Questions. Dans Proc. RIAO 2004, Avignon, France. 
</p>
<p>HASSAN S., MIHALCEA R. (2009). Learning to identify educational materials. Dans Proc. RANLP, Bulgaria. 
</p>
<p>ITTNER D.J., LEWIS D.D., AHN D. D. (1995). Text categorization of low quality images. Actes de SDAIR, 
Las Vegas, US, 301-315. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BOUTHEINA SMINE, RIM FAIZ, JEAN-PIERRE DESCLES 
 
</p>
<p>MOURAD G. (2002). La segmentation de textes par Explration Contextuelle automatiques, pr&#233;sentation du 
module SegATex. Dans Inscription Spatiale du Langage : structure et processus ISLsp, Toulouse. 
</p>
<p>ROCCHIO J. (1971). Relevance feedback information retrieval. In Gerard Salton editor, The Smart retrieval 
system experiments in automatic document processing, Prentice-Hall, Englewood Cliffs, NJ, 313-323. 
</p>
<p>SALTON G. (1991). Developments in automatic text retrieval. Science, 253 (5023), 974-980. 
</p>
<p>SMEI H., BEN HAMADOU A. (2005). Un syst&#232;me &#224; base de m&#233;tadonn&#233;es pour la cr&#233;ation d&#8217;un cache 
communautaire-Cas de la communaut&#233; p&#233;dagogique. Dans Proc. IEBC, Hammamet, Tunisie. 
</p>
<p>SMINE B., FAIZ R., DESCLES J.P. (2010). Analyse de documents p&#233;dagogiques en vue de leur annotation. 
Revue des Nouvelles Technologies de l'Information (RNTI), E-19, Ed. C&#233;padu&#232;s, 429-434. 
</p>
<p>THOMPSON C., SMARR J., NGUYEN H., MANNING C. (2003). Finding educational resources on the web : 
Exploiting automatic extraction of metadata. Proc. ECML, Workshop on Adaptive Text Extraction and 
Mining. 
</p>
<p>WESTERHOUT E., MONACHESI P. (2008). Creating glossaries using pattern-based and machine learning 
techniques. Dans Proceedings of Map of Language Resources, Technologies and Evaluation. </p>

</div></div>
</body></html>