<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Ces noms qui cachent des &#233;v&#233;nements : un premier rep&#233;rage</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Ces noms qui cachent des &#233;v&#233;nements : un premier rep&#233;rage
</p>
<p>Adila Amaria Bouabdallah1
</p>
<p>(1) LERIA - Universit&#233; d&#8217;Angers, 2 Bd Lavoisier 49000 Angers, France
amaria@info.univ-angers.fr
</p>
<p>R&#233;sum&#233;. La d&#233;tection des informations temporelles est cruciale pour le traitement automatique des
textes, qu&#8217;il s&#8217;agisse de mod&#233;lisation linguistique, d&#8217;applications en compr&#233;hension du langage ou encore
de t&#226;ches de recherche documentaire ou d&#8217;extraction d&#8217;informations. De nombreux travaux ont &#233;t&#233; d&#233;-
di&#233;s &#224; l&#8217;analyse temporelle des textes, et plus pr&#233;cis&#233;ment l&#8217;annotation des expressions temporelles ou des
&#233;v&#233;nements sous leurs diff&#233;rentes formes : verbales, adjectivales ou nominales. Dans cet article, nous d&#233;-
crivons une m&#233;thode pour la d&#233;tection des syntagmes nominaux d&#233;notant des &#233;v&#233;nements. Notre approche
est bas&#233;e sur l&#8217;impl&#233;mentation d&#8217;un test linguistique simple propos&#233; par les linguistes pour cette t&#226;che.
Nous avons exp&#233;riment&#233; notre m&#233;thode sur deux corpus diff&#233;rents ; le premier est compos&#233; d&#8217;articles de
presse et le second est beaucoup plus grand, utilisant une interface pour interroger automatiquement le
moteur de recherche Yahoo. Les r&#233;sultats obtenus ont montr&#233; que cette m&#233;thode se r&#233;v&#232;le plus pertinente
pour un plus large corpus.
</p>
<p>Abstract. The detection of temporal information is a crucial task for automatic text processing. It
is not only used in linguistics for the modelization of phenomenon and reasoning implying time entities
but also in numerous applications in language comprehension, information retrieval, question-answering
and information extraction. Many studies have been devoted to the temporal analysis of texts, and more
precisely to the tagging of temporal entities and relations occurring in texts. Among these lasts, the various
avatars of events in their multiples occurring forms has been tackled by numerous works. In this article
we describe a method for the detection of noun phrases denoting events. Our approach is based on the
implementation of a simple linguistic test proposed by linguists for this task. Our method is applied on
two different corpora ; the first is composed of newspaper articles and the second, a much larger one, rests
on an interface for automatically querying the Yahoo search engine. Primary results are encouraging and
increasing the size of the learning corpora should allow for a real statistical validation of the results.
</p>
<p>Mots-cl&#233;s : Rep&#233;rage des &#233;v&#233;nements nominaux, annotation temporelle.
</p>
<p>Keywords: Nominal event recognition, temporal annotation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADILA AMARIA BOUABDALLAH
</p>
<p>1 Introduction
</p>
<p>La d&#233;tection des informations temporelles est cruciale pour le traitement automatique des textes, qu&#8217;il
s&#8217;agisse de mod&#233;lisation linguistique (Amghar et al., 2002), d&#8217;applications en compr&#233;hension du langage
ou encore de t&#226;ches de recherche documentaire ou d&#8217;extraction d&#8217;informations. C&#8217;est ainsi que ce sont
d&#233;velopp&#233;es de nombreuses ontologies, permettant de rendre compte de diff&#233;rents aspects des ph&#233;no-
m&#232;nes temporels exprim&#233;s par les langues naturelles (Gayral &amp; Grandemange, 1992; Reichenbach, 1947;
Mokhtari &amp; Kayser, 1996; Battistelli &amp; Descl&#233;s, 1999). Sont aussi apparus des outils de rep&#233;rage et de
normalisation de ce type de donn&#233;es se donnant pour but l&#8217;am&#233;lioration des performances et de la couver-
ture des applications mettant en jeu le temps (Bittar, 2008) comme c&#8217;est le cas des syst&#232;mes de r&#233;ponses &#224;
des questions ou encore de l&#8217;extraction d&#8217;informations, sujet qui a fait l&#8217;objet d&#8217;une tr&#232;s grande attention
ces derni&#232;res ann&#233;es.
</p>
<p>Parmi les nombreux travaux consacr&#233;s &#224; l&#8217;analyse temporelle du document, beaucoup se sont interess&#233;s
plus particuli&#232;rement au rep&#233;rage et &#224; l&#8217;annotation de diff&#233;rents types d&#8217;expressions temporelles et d&#8217;&#233;v&#233;-
nements. Parmi les travaux consacr&#233;s au rep&#233;rage d&#8217;entit&#233;s temporelles, citons : (MUC-7, 1998) qui ne
s&#8217;est interess&#233; qu&#8217;aux entit&#233;s temporelles absolues (ponctuelles) (date et heure), (Schilder &amp; Habel, 2001)
qui proposent dans leur travail un marquage s&#233;mantique des entit&#233;s temporelles calendaires, ou plus r&#233;-
cemment, (Battistelli et al., 2006) qui proposent une analyse fonctionnelle pour la repr&#233;sentation formelle
des expressions calendaires avec pour projet l&#8217;impl&#233;mentation de cette formalisation dans le cadre d&#8217;un
syst&#232;me de navigation temporelle dans des textes biographiques.
</p>
<p>Pour les travaux relatifs au rep&#233;rage et &#224; l&#8217;annotation d&#8217;&#233;v&#233;nements, on peut citer entre autre (Bittar,
2008) et (Parent et al., 2008), qui se basent sur un langage de sp&#233;cification TimeML 1 (Pustejovsky et al.,
2003) pour l&#8217;annotation des informations temporelles.
Contrairement &#224; la notion d&#8217;&#233;v&#233;nement sur laquelle nous nous sommes bas&#233;s pour annoter ce type d&#8217;in-
formations, et que nous allons d&#233;finir dans la section 2.2, TimeML &#233;largit la classe d&#8217;&#233;v&#233;nements pour
contenir outre les &#233;v&#233;nements, certains &#233;tats, ce qui correspond plus &#224; la notion d&#8217;&#233;ventualit&#233;s (Bach,
1986), sous leurs diff&#233;rentes formes : verbes, noms et adjectifs.
</p>
<p>Nous proposons ici une approche statistique, pour d&#233;tecter des &#233;v&#233;nements d&#233;crits par des syntagmes
nominaux dans des articles de presse &#233;crite en fran&#231;ais. La section 2 est consacr&#233;e &#224; la caract&#233;risation
de la notion d&#8217;aspect pour ce qui concerne les verbes et d&#233;crit une typologie des verbes (ou syntagmes
verbaux). La section 3 se focalise sur l&#8217;aspect dans le domaine nominal. C&#8217;est sur ce point particulier que
porte le travail d&#233;crit ici. La section 4 est d&#233;di&#233;e au corpus. La section 5 d&#233;taille les diff&#233;rentes &#233;tapes sur
lesquelles nous nous basons pour &#233;laborer et d&#233;velopper notre m&#233;thode pour le rep&#233;rage des &#233;v&#233;nements
nominaux. Nous avons exp&#233;riment&#233; notre m&#233;thode sur deux corpus diff&#233;rents, les r&#233;sultats sont d&#233;taill&#233;s
dans la section 6.
</p>
<p>1. Issu de l&#8217;atelier TERQAS (Time and Event Recognition for Question Answering Systems) dans le cadre du projet
AQUAINT. Ce dernier vise &#224; am&#233;liorer les syst&#232;mes de questions r&#233;ponses en leur permettant de r&#233;pondre &#224; des questions
de nature temporelle sur les entit&#233;s et les &#233;v&#233;nements.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CES NOMS QUI CACHENT DES &#201;V&#201;NEMENTS : UN PREMIER REP&#201;RAGE
</p>
<p>2 L&#8217;aspect dans le domaine verbal
</p>
<p>2.1 Classification des verbes
</p>
<p>Dans (Gosselin, 1996), on d&#233;signe sous le concept de proc&#232;s les repr&#233;sentations s&#233;mantiques associ&#233;es aux
pr&#233;dicats verbaux (ainsi qu&#8217;aux substantifs d&#233;verbaux). Toute une litt&#233;rature linguistique, logique, philo-
sophique et, plus r&#233;cemment, issue des recherches en intelligence artificielle et en psychologie cognitive,
s&#8217;est d&#233;velopp&#233;e autour de la question des &#171; types de proc&#232;s &#187;. Comment d&#233;finir des classes et des sous-
classes de proc&#232;s ? Sur quelles bases (aspectuelles, actancielles. . .) ? Comment identifier le type de proc&#232;s
exprim&#233; par un &#233;nonc&#233; ? Comment calculer (pr&#233;dire) le type de proc&#232;s exprim&#233; &#224; partir d&#8217;un ensemble de
marques linguistiques ?
Le mode de proc&#232;s est la r&#233;alisation linguistique de ces marques, c&#8217;est une notion linguistique qui peut ne
pas &#234;tre identifi&#233;e avec la r&#233;alit&#233; physique du proc&#232;s concern&#233; (Bestougeff &amp; Ligozat, 1989).
La classification de (Bennett &amp; Partee, 1978) ou celle &#233;tablie par (Vendler, 1967), et qui continue de servir
de base de r&#233;flexion dans les &#233;tudes concernant l&#8217;aspect lexical, consiste &#224; classer les verbes ( ou les syn-
tagmes verbaux ) en quatre classes : (1) &#233;tats, (2) processus, (3) accomplissements et (4) ach&#232;vements.
Ces quatre classes peuvent &#234;tre caract&#233;ris&#233;es intuitivement de la fa&#231;on suivante :
</p>
<p>1. Etats : proc&#232;s qui n&#8217;ont ni d&#233;but ni fin, ils ne comportent en eux-m&#234;me aucune id&#233;e de chan-
gement. Ils durent un certain temps mais n&#8217;&#233;voquant pas l&#8217;id&#233;e d&#8217;un processus &#233;voluant dans le
temps (Schwer &amp; Tovena, 2009), on ne peut demander combien de temps ils ont pris, ou s&#8217;ils se sont
termin&#233;s, Et ne sont pas compatibles avec une description ponctuelle. Par exemple : Paul conna&#238;t le
fonctionnement du syst&#232;me.
Les verbes dits psychologiques ou de connaissance, comme penser, savoir et conna&#238;tre, d&#233;crivent
des &#233;tats, qui n&#8217;impliquent aucun changement et n&#8217;ont pas d&#8217;effets causaux. A un moment donn&#233;,
un &#233;tat tient ou ne tient pas, il n&#8217;y a pas de milieu. Ainsi, la phrase Jean pense que la terre est ronde
ne peut &#234;tre que la description d&#8217;un &#233;tat car elle est la description d&#8217;un &#233;tat psychologique de son
sujet. De fa&#231;on similaire, les verbes intentionnels, tels que vouloir, d&#233;sirer, avoir envie, souhaiter,
d&#233;signent des &#233;tats psychologiques. C&#8217;est aussi le cas des verbes comme aimer, adorer, d&#233;tester et
ha&#239;r.
Les verbes de possession avoir, poss&#233;der, et appartenir ainsi que les verbes habiter, rester, demeu-
rer et exister d&#233;signent des &#233;tats car ils n&#8217;impliquent pas un changement dans le monde. Ce sont des
verbes statifs. Philippe a une 206 rouge d&#233;signe un &#233;tat. La phrase n&#8217;implique aucun changement.
Un autre verbe statif est &#234;tre. Le plomb est plus dense que le fer est la description d&#8217;un &#233;tat.
</p>
<p>2. Activit&#233;s (Processus) : sont associ&#233;es &#224; une id&#233;e de progression dans le temps, avec une possibilit&#233;
de mesure de cette progression, mais sans terme attendu.
L&#8217;arr&#234;t de l&#8217;activit&#233;, &#224; tout moment apr&#232;s un temps minimal qui d&#233;passe sa mise en route ne met
pas en doute la r&#233;alisation de ce processus. Donc on peut le caract&#233;riser comme un proc&#232;s sans fin
d&#233;termin&#233;e, de nature durative, non conclusif. Par exemple : Paul programme en lisp.
</p>
<p>Lorsque l&#8217;objet de l&#8217;activit&#233; est exprim&#233; ou plus pr&#233;cis&#233;ment le but de l&#8217;acte exprim&#233;, elle devient
un accomplissement.
</p>
<p>3. Accomplissements : par opposition &#224; la classe pr&#233;c&#233;dente, cette classe dynamique progresse dans le
temps vers un terme. C&#8217;est l&#8217;atteinte de ce terme qui seule permet la r&#233;alisation de l&#8217;accomplissement
et le rend conclusif. Par exemple : Paul programme l&#8217;algorithme de Robinson.
On peut voir la diff&#233;rence entre ces deux derni&#232;res classes Activit&#233;s/Accomplissements en supposant</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADILA AMARIA BOUABDALLAH
</p>
<p>que Paul a d&#251; s&#8217;interrompre ; dans le cas des processus, on pourra quand m&#234;me conclure que &#171; Paul
a programm&#233; en lisp &#187;, mais on ne peut pas dire que &#171; Paul a programm&#233; l&#8217;algorithme de Robinson
&#187;.
</p>
<p>4. Ach&#232;vements : ce type de proc&#232;s d&#233;crit le d&#233;but ou la terminaison d&#8217;une action et atteint sa r&#233;a-
lisation en un seul point. Cette classe concerne essentiellement des verbes psychologiques et de
perception. Ces proc&#232;s sont caract&#233;ris&#233;s par leur caract&#232;re essentiellement ponctuel. Par exemple :
Paul a perdu son mot de passe.
D&#8217;apr&#232;s certains auteurs, tels (Mourelatos, 1978) et (Verkuyl, 1989), accomplissements et ach&#232;ve-
ments sont regroup&#233;s sous le terme d&#8217;&#233;v&#233;nement.
</p>
<p>On admet commun&#233;ment que les deux principaux crit&#232;res de distinction de ces diff&#233;rentes cat&#233;gories sont
(i) la dynamicit&#233; et (ii) la d&#233;limitation temporelle inh&#233;rente, ou t&#233;licit&#233; (Huyghe &amp; Marin, 2007)
</p>
<p>Dynamicit&#233; D&#233;limitation temporelle
Etats - -
Activit&#233;s + -
Acc &amp; Ach + +
</p>
<p>TABLE 1 &#8211; Crit&#232;res de distinction des diff&#233;rentes cat&#233;gories
</p>
<p>On peut aussi diff&#233;rencier ces quatre classes, en se basant sur d&#8217;autres crit&#232;res 2 :
</p>
<p>Type T&#233;lique Dur&#233;e Exemples
</p>
<p>Etats
pendant une heure &#234;tre+ADJ, penser,
</p>
<p>non *en une heure savoir,croire, aimer
conna&#238;tre.
</p>
<p>Activit&#233;s
</p>
<p>pendant une heure travailler, peindre,
non *en une heure ronfler, chanter,
</p>
<p>courir,
manger
</p>
<p>Accomplissements
</p>
<p>*pendant une heure aller &#224; + GN, manger
oui en une heure + GN, raconter +
</p>
<p>GN, peindre + GN,
chanter + GN
</p>
<p>Ach&#232;vements
</p>
<p>*pendant une heure atteindre, gagner,
oui *en une heure perdre, r&#233;ussir,
</p>
<p>mourir,
reconna&#238;tre, dire
</p>
<p>TABLE 2 &#8211; La classification des verbes selon Vendler
</p>
<p>2.2 La notion d&#8217;&#233;v&#233;nement
</p>
<p>D&#8217;apr&#232;s Bach (1986) on regroupe sous le terme &#233;ventualit&#233; les &#233;v&#233;nements et les &#233;tats, qui sont des entit&#233;s
ayant une port&#233;e sur le monde r&#233;el.
</p>
<p>2. L&#8217;&#233;toile (*) indique que ce qui la suit est non accept&#233;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CES NOMS QUI CACHENT DES &#201;V&#201;NEMENTS : UN PREMIER REP&#201;RAGE
</p>
<p>Les &#233;v&#233;nements ont des propri&#233;t&#233;s spatiotemporelles et des effets causaux, sont localisables dans le monde,
&#224; cause de leurs participants - un agent/sujet qui les d&#233;clenche &#224; un instant donn&#233; et &#233;ventuellement un
th&#232;me/objet qui les subit.
</p>
<p>Les &#233;v&#233;nements s&#8217;opposent aux &#233;tats en ce qu&#8217;ils engendrent comme changement de l&#8217;&#233;tat du monde
(ils ont des effets causaux). Les &#233;v&#233;nements regroupent donc les activit&#233;s, les accomplissements et les
ach&#232;vements pr&#233;c&#233;demment cit&#233;s.
</p>
<p>Afin de caract&#233;riser les &#233;v&#233;nements, (Asher, 1993) a proc&#233;d&#233; a une &#233;tude portant sur les contextes d&#8217;ap-
parition et leurs emplois en anglais. (Amsili et al., 2005) ont &#233;bauch&#233; un travail similaire pour le fran&#231;ais.
Dans les deux cas, la notion de conteneur de Vendler (Vendler, 1967) a &#233;t&#233; emprunt&#233;e. Cette notion consiste
en la d&#233;limitation des contextes linguistiques et des constructions qui n&#233;cessitent la pr&#233;sence d&#8217;un &#233;v&#233;ne-
ment. Il s&#8217;agit de d&#233;limiter les expressions verbales qui sous cat&#233;gorisent un argument &#233;v&#233;nementiel. Pour
les &#233;v&#233;nements, en fran&#231;ais, ce sont les verbes arriver, se produire, avoir lieu, se passer, etc. qui prennent
tous un &#233;v&#233;nement, obligatoirement sous forme nominale, en position sujet. Par exemple : La chute du
mur de Berlin est arriv&#233;e/s&#8217;est produite/a eu lieu hier.
Les verbes tels que assister &#224;, &#234;tre t&#233;moin de, et manquer attendent un objet &#233;v&#233;nementiel, aussi sous
forme nominale. Par exemple : Jean a assist&#233; &#224; la chute du mur de Berlin.
</p>
<p>Les constructions cliv&#233;es ( Par exemple : Ce qui s&#8217;est pass&#233;, c&#8217;est que le mur de Berlin est tomb&#233;, pseudo-
cliv&#233;es ( Par exemple : C&#8217;est en 1989 que le mur de Berlin est tomb&#233; ) et impersonnelles ( Par exemple :
Il s&#8217;est pass&#233; que le mur de Berlin est tomb&#233; ) avec des verbes comme arriver, se produire etc. sont aussi
des conteneurs qui requi&#232;rent l&#8217;intervention d&#8217;un &#233;v&#233;nement, mais dans ces cas, l&#8217;argument &#233;v&#233;nementiel
est sous la forme d&#8217;une compl&#233;tive, introduite par la conjonction de subordination que.
</p>
<p>La notion de conteneur &#233;v&#233;nementiel de Vendler, que l&#8217;on a &#233;voqu&#233;e ci-dessus, regroupe les verbes qui
requi&#232;rent un sujet &#233;v&#233;nementiel (se passer, se produire, arriver et avoir lieu), ou un objet &#233;v&#233;nementiel
(assister &#224;, &#234;tre t&#233;moin de , et manquer). Les arguments de ces verbes doivent &#234;tre soit sous forme nomi-
nale, la chute du mur de Berlin a eu lieu, soit pronominale, &#231;a a eu lieu. Le conteneur d&#233;termine le type
d&#8217;entit&#233; qu&#8217;un pronom peut reprendre.
</p>
<p>3 L&#8217;aspect dans le domaine nominal
</p>
<p>(Huyghe &amp; Marin, 2007), pose la question de l&#8217;application aux syntagmes nominaux : du crit&#232;re aspectuel
de la dynamicit&#233;, on peut conclure que l&#8217;aspect dynamique existe dans le domaine nominal, bien qu&#8217;il
ne soit pas toujours facile &#224; mettre en &#233;vidence, et que l&#8217;h&#233;ritage aspectuel de la dynamicit&#233; n&#8217;est pas
observ&#233; pour tous les d&#233;verbaux. Plus pr&#233;cis&#233;ment, lorsque le nom a une interpr&#233;tation concr&#232;te, il n&#8217;est
pas dot&#233; de traits aspectuels et a fortiori n&#8217;est pas susceptible d&#8217;exprimer l&#8217;aspect dynamique. L&#8217;hypoth&#232;se
de travail suivante a &#233;t&#233; formul&#233;e : lorsqu&#8217;une nominalisation a des caract&#233;ristiques aspectuelles, alors elle
conserve la sp&#233;cification du trait [+ ou - dynamique] de sa base verbale. Autrement dit, les d&#233;verbaux
d&#8217;&#233;tats, d&#8217;activit&#233;s, d&#8217;accomplissements et d&#8217;ach&#232;vements, dans leur signification abstraite, sont fid&#232;les
&#224; leurs verbes d&#8217;origine au regard du trait statique / dynamique. Le crit&#232;re de la dynamicit&#233;, permet de
distinguer les noms statiques et noms dynamiques, et par cons&#233;quent distinguer les &#233;tats des trois autres
classes : Activit&#233;s, Ach&#232;vements et accomplissements qui sont regoup&#233;s dans la classe des &#233;v&#233;nements,
pr&#233;c&#233;demment d&#233;finie.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADILA AMARIA BOUABDALLAH
</p>
<p>4 Description du corpus
</p>
<p>Le corpus que nous utilisons est constitu&#233; des donn&#233;es textuelles correspondant &#224; des &#233;ditions int&#233;grales
du quotidien r&#233;gional, l&#8217;est r&#233;publicain.
Ce type journalistique de textes est assez riche en expressions d&#233;notant des &#233;v&#233;nements sous diff&#233;rentes
formes. Nous avons utilis&#233; 358 articles journalistiques de l&#8217;ann&#233;e 2002. Ces articles sont repr&#233;sent&#233;s sous
un format XML et sont soumis &#224; un pr&#233;traitement permettant d&#8217;en extraire le contenu textuel :
&#8211; La premi&#232;re &#233;tape du traitement concerne la prise en compte du codage des caract&#232;res de chaque article.
&#8211; La deuxi&#232;me &#233;tape concerne l&#8217;extraction du contenu textuel de chaque article, en supprimant les balises
</p>
<p>et les &#233;ventuels &#233;l&#233;ments ind&#233;sirables tels que les commentaires ou les retours &#224; la ligne.
</p>
<p>5 D&#233;tection des noms &#233;v&#233;nementiels
</p>
<p>Nous avons impl&#233;ment&#233; des tests linguistiques pour la d&#233;tection des noms d&#233;notant des &#233;v&#233;nements par
un traitement statistique distributionnel. Pour ce faire, nous utilisons UNITEX qui est une plateforme de
manupilation de machines d&#8217;&#233;tats finis adapt&#233;e au TALN, elle permet de d&#233;crire des patrons linguistiques
sous forme d&#8217;expressions r&#233;guli&#232;res ou d&#8217;automates et d&#8217;en trouver des r&#233;alisations dans un texte en entr&#233;e.
</p>
<p>Dans un premier temps, nous rep&#233;rons les syntagmes nominaux du texte au moyen de transducteurs ana-
logues &#224; ceux pr&#233;sent&#233;s dans la figure1 sous une forme simplifi&#233;e.
</p>
<p>FIGURE 1 &#8211; Expressions r&#233;guli&#232;res pour le rep&#233;rage des syntagmes nominaux
</p>
<p>Le premier transducteur correspondant au singulier, c&#8217;est la concat&#233;nation de trois &#233;l&#233;ments, &lt;DET&gt; cor-
respondent aux d&#233;terminants pr&#233;c&#233;dants les noms, (&lt;A :s&gt;+&lt;E&gt;) correspondent, soit aux adjectifs singu-
liers, soit &#224; des chaines vides et &lt;N :s&gt; correspondent aux noms singuliers. Par exemple, dans la phrase
extraite de notre texte en entr&#233;e &#171; Le jeune couple s&#8217;est install&#233; &#224; Beauz&#233;e-sur-Aire &#187;, la premi&#232;re exe-
pression r&#233;guli&#232;re permet de rep&#233;rer le syntagme &#171; Le jeune couple &#187;.
</p>
<p>5.1 La caract&#233;risation des &#233;v&#233;nements
</p>
<p>Rappelons que les &#233;v&#233;nements sont des entit&#233;s situ&#233;es spatiotemporellement, ayant des effets causaux et
localisables dans le monde. Ce sont des choses qui arrivent, se produisent ou, plus g&#233;n&#233;ralement, qui &#171; ont
lieu &#187;.
</p>
<p>Nous utilisons le test linguistique de (Huyghe &amp; Marin, 2007) pour rep&#233;rer les noms &#233;v&#233;nementiels : &#171; les
noms qui d&#233;notent des &#233;v&#233;nements, i.e. qui peuvent appara&#238;tre en position de N dans Le N a eu lieu (&#224; tel
endroit, &#224; tel moment), d&#233;crivent des entit&#233;s dot&#233;es d&#8217;une d&#233;limitation temporelle &#187;. Par exemple, &#171; L&#8217;ex-
plosion a eu lieu &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CES NOMS QUI CACHENT DES &#201;V&#201;NEMENTS : UN PREMIER REP&#201;RAGE
</p>
<p>En se basant sur cette r&#232;gle, nous avons d&#233;velopp&#233; une fonction, permettant de rechercher toutes les
concordances form&#233;es des noms du texte en entr&#233;e d&#233;j&#224; rep&#233;r&#233;s pr&#233;c&#233;demment avec le syntagme &#171; a eu
lieu &#187; dans le corpus &#233;labor&#233;. Pour chaque occurrence de &#171; GN a eu lieu &#187; rep&#233;r&#233;e, la fonction calcule un
contexte gauche et un contexte droit, dont la taille a &#233;t&#233; fix&#233;e &#224; 40 caract&#232;res de chaque c&#244;t&#233;.
</p>
<p>FIGURE 2 &#8211; Extrait de la concordance du &#171; le tirage au sort a eu lieu &#187; dans le corpus
</p>
<p>Pour &#233;liminer les &#171; faux positifs &#187;, nous avons proc&#233;d&#233; &#224; un filtrage en &#233;liminant les concordances dont le
contexte gauche se termine par des pr&#233;positions, telles que : de, par, sur. . ..
En effet, dans ces cas l&#224;, le nom associ&#233; &#224; &#171; a eu lieu &#187; ne repr&#233;sente pas le sujet principal de ce qui
s&#8217;est produit, mais un compl&#233;ment du nom. Ce dernier pr&#233;sente le sujet de l&#8217;action qui a bien eu lieu. Par
exemple, le contexte gauche de la concordance :
&#171; l&#8217;audition des eleves de l&#8217;ecole de musique a eu lieu a la salle des fetes devant un public n &#187;
se termine par la p&#233;position &#171; de &#187; et montre bien que le sujet principal de l&#8217;action est &#171; l&#8217;audition des
&#233;l&#232;ves &#187; et non &#171; l&#8217;&#233;cole de musique &#187;.
Apr&#232;s l&#8217;&#233;limination de ce type de concordances, on obtient un fichier contenant que les concordances dont
les noms pr&#233;c&#233;dant &#171; a eu lieu &#187; d&#233;notent des noms &#233;v&#233;nementiels.
</p>
<p>6 &#201;valuation
</p>
<p>Pour &#233;valuer notre m&#233;thode, nous avons s&#233;lectionn&#233; un texte au hasard parmi notre corpus de r&#233;f&#233;rence.
Notre &#233;valuation a pour but d&#8217;&#233;valuer en terme de rappel et pr&#233;cision, la capacit&#233; de la m&#233;thode &#224; d&#233;tecter
les &#233;v&#233;nements nominaux rep&#233;r&#233;s dans ce texte. Le rappel est d&#233;fini comme le nombre des &#233;v&#233;nements no-
minaux corrects d&#233;tect&#233;s par notre m&#233;thode sur le nombre total des &#233;v&#233;nements nominaux du texte, quant
&#224; La pr&#233;cision, elle est d&#233;finie comme le pourcentage des &#233;v&#233;nements nominaux corrects d&#233;tect&#233;s sur le
nombre total d&#8217;&#233;v&#233;nements d&#233;tect&#233;s par la m&#233;thode. Nous avons &#233;tiquet&#233; le texte choisi manuellement.
Cette &#233;valuation est r&#233;alis&#233;e &#224; partir des noms d&#233;tect&#233;s par la premi&#232;re &#233;tape de notre m&#233;thode fond&#233;e sur
les outils d&#8217;Unitex.
Pour le texte s&#233;lectionn&#233;, un nombre de 464 noms a &#233;t&#233; rep&#233;r&#233; par la premi&#232;re &#233;tape de notre m&#233;-
thode. Au niveau de l&#8217;annotation, sur les 464 noms rep&#233;r&#233;s, 52 noms ont &#233;t&#233; annot&#233;s manuellement
comme &#233;tant &#171; &#233;v&#233;nementiels &#187;. D&#8217;un autre c&#244;t&#233;, notre m&#233;thode a permis d&#8217;annoter 10 noms comme
&#233;tant des &#171; &#233;v&#233;nements nominaux &#187;, parmi ces 10 noms, 9 sont corrects. Ces chiffres m&#232;nent &#224; un taux de
pr&#233;cision de 90% et &#224; un taux de rappel de 17,30%.
Les r&#233;sultats pr&#233;sent&#233;s ci-dessus permettent de tirer un certain nombre de conclusions. En ce qui concerne
le rappel, un des facteurs d&#8217;am&#233;lioration passe par l&#8217;augmentation de la taille du corpus, puisqu&#8217;on s&#8217;ap-
puie dans notre travail sur une m&#233;thode bas&#233;e sur une recherche de motifs, donc plus la taille du corpus est
grande, plus les chances de trouver les motifs de la forme &#171; Nom a eu lieu &#187; augmentent ce qui va accroitre
le nombre de noms &#233;v&#233;nementiels et par cons&#233;quent, am&#233;liorer le taux de rappel. On peut aussi songer
&#224; faire appel &#224; d&#8217;autres tests linguistiques semblables &#224; celui utilis&#233; dans notre m&#233;thode, en utilisant des
synonymes du syntagme &#171; a eu lieu &#187; tels que : s&#8217;est produit, est arriv&#233;. . .</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADILA AMARIA BOUABDALLAH
</p>
<p>Une &#233;tape en plus peut quant &#224; elle &#234;tre envisag&#233;e pour am&#233;liorer la pr&#233;cision de notre m&#233;thode. Et cela
en augmentant les &#233;l&#233;ments contextuels pris en compte dans le filtrage, ainsi par exemple, l&#8217;occurrence de
l&#8217;expression adverbiale temporelle pr&#233;c&#233;dant &#171; a eu lieu &#187;. Ensuite filtrer notre fichier, en &#233;liminant toutes
les concordances correspondantes. Par exemple :
</p>
<p>Comme le montre l&#8217;exemple, &#171; Ce week-end &#187; ne d&#233;note pas un nom &#233;v&#233;nementiel, mais un adverbe de
temps.
Afin d&#8217;am&#233;liorer le rappel, nous avons appliqu&#233; notre m&#233;thode sur toutes les pages web en fran&#231;ais de
Yahoo. Un script utilisant l&#8217;interface de programmation d&#8217;applications API 3 pour interroger automatique-
ment le moteur de recherche Yahoo. &#192; partir de la m&#234;me liste des 464 noms du texte utilis&#233; pr&#233;c&#233;demment,
nous avons construit 464 requ&#234;tes. Chaque requ&#234;te est compos&#233;e d&#8217;un nom combin&#233; avec &#171; a eu lieu &#187;.
En plus, ces derni&#232;res sont encadr&#233;es par des guillemets afin d&#8217;&#234;tre consid&#233;r&#233;es comme une expression
exacte. Par exemple, pour le nom &#171; la mont&#233;e des eaux &#187;, la requ&#234;te sera : &#171; &quot;la mont&#233;e des eaux a eu
lieu&quot; &#187;Pour optimiser le temps d&#8217;ex&#233;cution de chaque requ&#234;te, nous avons limit&#233; le nombre de r&#233;sultats &#224;
100 documents par requ&#234;te. L&#8217;API Yahoo permet aussi, pour chaque ducument trouv&#233;, d&#8217;extraire la partie
du texte contenant la requ&#234;te en question. Ceci permet par la suite de reconduire le m&#234;me traitement effec-
tu&#233; pr&#233;c&#233;demment sur le corpus. En particulier, l&#8217;&#233;limination des concordances dont le contexte gauche se
termine par des pr&#233;positions (voir section 5.1).
Sur les 464 noms pris en entr&#233;e, 64 noms ont &#233;t&#233; annot&#233;s comme &#233;tant &#233;v&#233;nementiels :
&#8211; Nombre de documents retourn&#233; est sup&#233;rieur &#224; 0.
&#8211; Le contexte gauche pr&#233;c&#233;dant le syntagme &#171; Nom a eu lieu &#187; dans les textes retourn&#233;s, ne se termine pas
</p>
<p>par une pr&#233;position.
Sur les 64 noms &#233;v&#233;nementiels, 47 noms correspondent aux &#233;v&#233;nements &#233;tiquet&#233;s manuellement (N = 52),
alors que 17 ne repr&#233;sentent pas des &#233;v&#233;nements. Ce qui nous m&#232;ne &#224; un rappel de 90,38%, et une pr&#233;cision
de 73,44%. Ces r&#233;sultats laissent penser que l&#8217;utilisation d&#8217;un plus grand corpus permettra d&#8217;am&#233;liorer le
taux de rappel. D&#8217;un autre c&#244;t&#233;, nous remarquons aussi que malgr&#233; la diminution de la pr&#233;cision qui est
pass&#233;e de 90% &#224; 73,44%, cette derni&#232;re reste relativement &#233;lev&#233;e.
Cette derni&#232;re &#233;valuation a montr&#233; l&#8217;utilit&#233; des APIs tel que Yahoo, qui nous offre un plus large corpus
&#224; disposition. Cependant, l&#8217;inconv&#233;nient majeur r&#233;side dans le temps d&#8217;ex&#233;cution ind&#233;termin&#233; (d&#233;pendant
du d&#233;bit de la connexion). D&#8217;autres probl&#232;mes peuvent &#234;tre cit&#233;s, tel que les diff&#233;rents types de codage
utilis&#233;s dans les pages web, &#224; la diff&#233;rence d&#8217;un corpus, o&#249; on utilise un seul type de codage.
</p>
<p>7 Conclusion
</p>
<p>Nous avons propos&#233; dans cet article, une m&#233;thode pour le rep&#233;rage des noms &#233;v&#233;nementiels en fran&#231;ais.
Notre travail se d&#233;compose en deux &#233;tapes. La premi&#232;re consiste &#224; d&#233;tecter tous les noms d&#8217;un fichier en
entr&#233;e, en utilisant les outils d&#8217;UNITEX, puis parmi ces noms, faire un tri pour en d&#233;duire que les noms
d&#233;notant des &#233;v&#233;nements.
Pour cela nous nous sommes bas&#233;s sur des recherches de motifs dans notre corpus. Les types de textes
qui nous int&#233;ressent particuli&#232;rement sont les articles ou les d&#233;p&#234;ches de presse, les textes biographiques
ou encore les textes narratifs, en raison de leur fort contenu temporel, c&#8217;est pour cela qu&#8217;on se base sur
</p>
<p>3. http://developer.yahoo.net/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CES NOMS QUI CACHENT DES &#201;V&#201;NEMENTS : UN PREMIER REP&#201;RAGE
</p>
<p>des donn&#233;es textuelles de type journalistiques correspondant &#224; des &#233;ditions int&#233;grales du quotidien r&#233;gio-
nal &#171; Est R&#233;publicain &#187; et qui nous servent de corpus pour l&#8217;impl&#233;mentation de notre m&#233;thodologie.
Nos r&#233;sultats refl&#232;tent bien l&#8217;inter&#234;t de la m&#233;thode, surtout avec une pr&#233;cision aussi importante. Par contre
pour am&#233;liorer le taux de rappel, nous envisageons d&#8217;augmenter la taille de notre corpus, et par cons&#233;-
quent, augmenter les chances de trouver les bons motifs qui servent de base pour la d&#233;tection des noms
&#233;v&#233;nementiels, comme le fait apparaitre la deuxi&#232;me &#233;valuation appliqu&#233;e &#224; un plus large corpus.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AMGHAR T., BATTISTELLI D. &amp; CHARNOIS T. (2002). Reasonning on aspectual-temporal information
in french within conceptual graphs. In Proceedings of ICTAI, p. 315&#8211;.
</p>
<p>AMSILI P., DENIS P. &amp; ROUSSARIE L. (2005). Anaphores abstraites en fran&#231;ais : repr&#233;sentation for-
melle. TAL (Traitement Automatique des Langues), 46(1), 15&#8211;39.
ASHER N. (1993). Reference to Abstract Objects in Discourse : A Philosophical Semantics for Natural
Language Metaphysics, volume 50 of SLAP. http ://www.wkap.nl/ : Kluwer.
</p>
<p>BACH E. (1986). The algebra of events. Linguistics and Philosophy, 9(1), 5&#8211;16.
BATTISTELLI D. &amp; DESCL&#201;S J.-P. (1999). Modalit&#233;s d&#8217;action et raisonnements aspecto-temporels. In
Actes de VEXTAL&#8217;99 (Venezia per il trattamento automatico delle lingue), p. 351&#8211;359.
</p>
<p>BATTISTELLI D., MINEL J. &amp; R. SCHWER S. (2006). Quelques exemples d&#8217;utilisation des S_langages
pour le traitement de la temporalit&#233; en linguistique. In Actes de SDC Semaine de la Connaissance :
SDC06.
</p>
<p>BENNETT M. &amp; PARTEE B. (1978). Towards the logic of tense and aspect in English. Indiana University
Linguistic Club.
</p>
<p>BESTOUGEFF H. &amp; LIGOZAT G. (1989). Outils logiques pour le traitement du temps. Masson.
</p>
<p>BITTAR A. (2008). Annotation des informations temporelles dans des textes en fran&#231;ais. In Actes de
RECITAL 2008, Avignon, France.
</p>
<p>GAYRAL F. &amp; GRANDEMANGE P. (1992). Une ontologie du temps pour le langage naturel. In Actes de
COLING 1992, p. 295&#8211;302.
</p>
<p>GOSSELIN L. (1996). S&#233;mantique de la temporalit&#233; en fran&#231;ais : Un mod&#232;le calculatoire. Duculot.
</p>
<p>HUYGHE R. &amp; MARIN R. (2007). L&#8217;h&#233;ritage aspectuel des noms d&#233;verbaux en fran&#231;ais et en espagnol.
Faits de langues, 30, 302.
MOKHTARI A. &amp; KAYSER D. (1996). Time in a causal theory. In Proceedings of TIME 1996, p. 14&#8211;20.
</p>
<p>MOURELATOS A. (1978). Events, processes and states. Linguistics and Philosophy, 2, 415&#8211;434.
MUC-7 (1998). Defense advanced research projects agency. Proceedings of the Seventh Message
Understanding Conferences (MUC-7).
</p>
<p>PARENT G., GAGNON M. &amp; MULLER P. (2008). Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements
en fran&#231;ais. In Actes de (TALN), Avignon, http ://www.atala.org/ : ATALA.
</p>
<p>PUSTEJOVSKY J., CASTANO J., INGRIA R., SAURI R., GAUZAUSKAS R., SETZER A. &amp; KATZ G.
(2003). Timeml : Robust specification of event and temporal expression in text. IWCS-5, Fifth Interna-
tional Workshop on Computational Semantics.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADILA AMARIA BOUABDALLAH
</p>
<p>REICHENBACH H. (1947). Elements of symbolic logic. Berkeley, CA : University of California Press.
</p>
<p>SCHILDER F. &amp; HABEL C. (2001). From temporal expressions to temporal information : Semantic
tagging of news messages. In in Proceedings of the ACL-2001 Workshop on Temporal and Spatial
Information Processing, ACL-2001. Toulouse, p. 65&#8211;72.
</p>
<p>SCHWER S. &amp; TOVENA L. (2009). Ontologies temporelles et s&#233;mantique de la temporalit&#233;. In Actes de
XVI&#232;mes rencontres de Rochebrune, Rencontres interdisciplinaires sur les syst&#232;mes complexes naturels
et artificiels, p. 12.
</p>
<p>VENDLER Z. (1967). Linguistics in Philosophy. Cornell University Press.
</p>
<p>VERKUYL H. (1989). Aspectual classes and aspectual composition. Linguistics and Philosophy, 12,
39&#8211;94.</p>

</div></div>
</body></html>