<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Densid&#233;es : calcul automatique de la densit&#233; des id&#233;es dans un corpus oral</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Densid&#233;es : calcul automatique de la densit&#233; des id&#233;es dans un corpus oral 
</p>
<p>Hyeran Lee
1
, Philippe Gambette
</p>
<p>2
, Elsa Maill&#233; 
</p>
<p>3
, Constance Thuillier
</p>
<p>3
 
</p>
<p>(1) Praxiling - Universit&#233; Montpellier 3 / CNRS, 17 rue Abb&#233; de l'&#201;p&#233;e 34090 
</p>
<p>Montpellier France 
</p>
<p>(2) LIRMM - Universit&#233; Montpellier 2 / CNRS, 34095 Montpellier Cedex 5  
</p>
<p>(3) ISTR - Universit&#233; Claude Bernard Lyon 1, 69622 Villeurbanne Cedex 
hlee1@univ-montp3.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233; La densit&#233; des id&#233;es, qui correspond au ratio entre le nombre de propositions s&#233;mantiques et le 
nombre de mots dans un texte refl&#232;te la qualit&#233; informative des propositions langagi&#232;res d&#8217;un texte. 
L'apparition de la maladie d'Alzheimer a &#233;t&#233; reli&#233;e &#224; une d&#233;gradation de la densit&#233; des id&#233;es, ce qui explique 
l'int&#233;r&#234;t pour un calcul automatique de cette mesure. Nous proposons une m&#233;thode bas&#233;e sur un &#233;tiquetage 
morphosyntaxique et des r&#232;gles d'ajustement, inspir&#233;e du logiciel CPIDR. Cette m&#233;thode a &#233;t&#233; valid&#233;e sur un 
corpus de quarante entretiens oraux transcrits et obtient de meilleurs r&#233;sultats pour le fran&#231;ais que CPIDR 
pour l&#8217;anglais. Elle est impl&#233;ment&#233;e dans le logiciel libre Densid&#233;es disponible sur 
http://code.google.com/p/densidees. 
</p>
<p>Abstract Idea density, which is the ratio of semantic propositions divided by the number of words in a 
text, reflects the informative quality of the sentences of a text. A decreasing idea density has been identified 
as one of the symptoms of Alzheimer&#8217;s disease, which explains the interest in an automatic calculation of 
idea density. We propose a method based on part-of-speech tagging followed by adjustment rules inspired 
from the CPIDR software. This method was validated on a corpus of 40 transcribed conversations in French 
and obtains better results in French than CPIDR in English. It is implemented in the free software Densid&#233;es 
available at http://code.google.com/p/densidees. 
</p>
<p>Mots-cl&#233;s :   densit&#233; des id&#233;es, analyse pr&#233;dicative, &#233;tiquetage s&#233;mantique, psycholinguistique  
</p>
<p>Keywords:   idea density, propositional analysis, semantic tagging, psycholinguistics 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HYERAN LEE, PHILIPPE GAMBETTE, ELSA MAILL&#201;, CONSTANCE THUILLIER  
</p>
<p>1 Introduction 
</p>
<p>La d&#233;gradation de la capacit&#233; linguistique est un &#233;l&#233;ment caract&#233;ristique de la maladie d&#8217;Alzheimer  
(Moreaud et al., 2001). Le d&#233;ficit linguistique dans cette pathologie est d&#251; &#224; l&#8217;alt&#233;ration de la m&#233;moire 
s&#233;mantique. Ainsi, pour &#233;valuer la performance langagi&#232;re des patients atteints de la maladie d&#8217;Alzheimer, 
une mesure fine au niveau s&#233;mantique du langage est n&#233;cessaire. La densit&#233; des id&#233;es (DI), ratio pour dix 
mots du nombre de propositions s&#233;mantiques dans un texte, est aujourd&#8217;hui reconnue comme un 
indicateur pertinent des fonctions intellectuelles de sujets. Cette m&#233;thode a &#233;t&#233; valid&#233;e par de nombreuses 
&#233;tudes psycholinguistiques appliqu&#233;es : la compr&#233;hension du texte (Kintsch et al., 1973 ; Kintsch, 1978), 
la m&#233;moire (Thorson et al., 1984), la maladie d'Alzheimer (Snowdon et al., 1996 ; Lee et al., 2009), la 
qualit&#233; de prise de note des &#233;tudiants (Takao et al., 2002), le vieillissement (Kemper et al., 2001), la 
schizophr&#233;nie (Covington et al., 2007), le genre du discours (Covington, 2009). Cependant, son analyse 
longue, fastidieuse, et parfois subjective fait souvent obstacle &#224; son utilisation pratique. Par cons&#233;quent, il 
serait int&#233;ressant et innovant de d&#233;velopper un outil automatique permettant de donner un r&#233;sultat rapide 
et fiable de la DI. Nous proposerons une m&#233;thode de calcul automatique de la DI, bas&#233;e sur un &#233;tiquetage 
morphosyntaxique et des r&#232;gles d'ajustement, inspir&#233;e du logiciel CPIDR (Brown et al., 2008). Enfin nous 
testerons la validit&#233; de cette m&#233;thode sur un corpus de quarante entretiens oraux transcrits. 
</p>
<p> 
</p>
<p>1.1 Analyse pr&#233;dicative et densit&#233; des id&#233;es  
</p>
<p>Pour &#233;tudier les m&#233;canismes qui sous-tendent la pens&#233;e humaine, la psychologie cognitive n'ayant acc&#232;s 
qu'aux productions du sujet, consid&#232;re qu'elles poss&#232;dent en leur sein les marques des m&#233;canismes qui les 
ont engendr&#233;es. En ce sens, les productions discursives sont privil&#233;gi&#233;es car le langage est &#224; la fois le 
support et le produit de la pens&#233;e. Autrement dit, les structures langagi&#232;res peuvent refl&#233;ter les structures 
cognitives. Ainsi, une certaine forme d'analyse du discours revient &#224; mod&#233;liser des ph&#233;nom&#232;nes cognitifs.   
</p>
<p>La fonction primitive du langage est la fonction r&#233;f&#233;rentielle (Jakobson, 1963), c'est-&#224;-dire qu'il sert &#224; 
transmettre &#224; autrui des informations du monde r&#233;el par la symbolisation. Cette fonction est accomplie en 
v&#233;hiculant du sens. L'activit&#233; s&#233;mantique consiste donc &#224; produire du sens dans l'intellect du r&#233;cepteur, 
c'est-&#224;-dire la formation de repr&#233;sentation mentale chez l'interlocuteur par l'interm&#233;diaire du langage. 
Depuis la logique aristot&#233;licienne ainsi que dans la logique classique de Frege (1967, 1971), en passant par 
la th&#233;orie psychologique des r&#233;seaux s&#233;mantiques propositionnels d'Anderson (1976), les chercheurs se 
sont int&#233;ress&#233;s au traitement s&#233;mantique de l'information et ont tent&#233; de d&#233;finir la structure cognitive. Ils 
ont fait l'hypoth&#232;se que l'information dans la m&#233;moire est organis&#233;e sous forme propositionnelle. En effet, 
un mot isol&#233; seul ne suffit pas &#224; cr&#233;er une id&#233;e, c'est l'ensemble de propri&#233;t&#233;s et de relations s'y rapportant 
qui permet d'appr&#233;hender et de produire la signification psychologique. &#192; partir de ces th&#233;ories logiques et 
psychologiques, Kintsch (1974) a d&#233;velopp&#233; une m&#233;thode d'analyse linguistique qui permet de mod&#233;liser 
la mani&#232;re dont l'humain encode les informations, appel&#233;e analyse pr&#233;dicative. Il part du postulat que la 
forme dominante de la repr&#233;sentation cognitive du langage est de nature propositionnelle. Ainsi, &#171; si l'on 
consid&#232;re que la pr&#233;dication qui s'exprime dans un message linguistique est une activit&#233; cognitive 
essentielle de l'homme et que, sous-jacent &#224; la r&#233;alisation de surface, c'est-&#224;-dire au mot, se trouve un 
concept, on peut estimer que l'analyse pr&#233;dicative, outil de description s&#233;mantique des textes, est pour le 
psychologue la transcription d'une activit&#233; cognitive &#187; (Ghiglione et al., 1995 : 49). 
</p>
<p>L'analyse pr&#233;dicative permet d'extraire les propositions s&#233;mantiques dans le discours par la concat&#233;nation 
des unit&#233;s &#233;l&#233;mentaires du sens : pr&#233;dicat et argument(s). Par exemple, dans la phrase &#171; Le chien 
poursuivait un chat dans le jardin &#187;, exemple emprunt&#233; &#224; Le Ny (1989), les concepts g&#233;n&#233;riques qui font 
r&#233;f&#233;rence &#224; des objets (&#171; chien &#187;, &#171; chat &#187;, &#171; jardin &#187;), &#224; des &#233;v&#233;nements (&#171; poursuivre &#187;), et &#224; des relations </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DENSID&#201;ES : CALCUL AUTOMATIQUE DE LA DENSIT&#201; DES ID&#201;ES DANS UN CORPUS ORAL 
dans l&#8217;espace (&#171; dans &#187;) peuvent &#234;tre extraits. On parle des arguments qui sont des entit&#233;s r&#233;f&#233;rentielles 
pouvant correspondre &#224; des &#234;tres ou des objets, et des pr&#233;dicats qui sont des unit&#233;s requ&#233;rant des 
arguments. Ainsi les pr&#233;dicats assignent des propri&#233;t&#233;s aux arguments ou d&#233;finissent la relation entre les 
arguments (Coirier et al., 1996). L&#8217;analyse pr&#233;dicative de cette phrase peut &#234;tre not&#233;e selon la forme 
classique ci-dessous : 
P1. POURSUIVRE (a1, a2) a1= chien, a2= chat 
P2. DANS (P1, a3) a3= jardin 
L&#8217;ensemble constitu&#233; d&#8217;un pr&#233;dicat et de son ou ses arguments forme une id&#233;e ou proposition s&#233;mantique. 
</p>
<p>Si l'analyse pr&#233;dicative refl&#232;te l'activit&#233; cognitive, la densit&#233; des id&#233;es, quant &#224; elle, permet de la 
quantifier. En ramenant le nombre de propositions s&#233;mantiques au nombre de mots produits dans le 
discours (multipli&#233; par 10 pour obtenir une DI pour 10 mots), on peut mesurer la densit&#233; des id&#233;es d'un 
discours. La DI permet donc de mesurer la quantit&#233; informative dans le discours. Une DI &#233;lev&#233;e peut 
refl&#233;ter l'aptitude d'un locuteur &#224; exprimer efficacement ses id&#233;es ainsi que leur interrelation complexe. 
Par contre, une faible DI dans le discours peut r&#233;v&#233;ler un discours peu efficient, du fait de l'utilisation d'un 
plus grand nombre de mots pour exprimer les id&#233;es essentielles. Le score de DI de la phrase &#171; Le chien 
poursuivait un chat dans le jardin &#187; pr&#233;c&#233;demment &#233;voqu&#233;e est donc de 2.5 (2/8*10 = 2.5 : 2 propositions 
s&#233;mantiques divis&#233;es par 8 mots, multipli&#233; par 10). 
</p>
<p> 
</p>
<p> 
</p>
<p>1.2 Calcul automatique de la densit&#233; des id&#233;es : Densid&#233;es 
</p>
<p>Les &#233;tudes portant sur l&#8217;analyse pr&#233;dicative en langue fran&#231;aise ont &#233;t&#233; d&#233;velopp&#233;es principalement par Le 
Ny (1979), Ghiglione (1982), Denhi&#232;re (1983). Cependant, il n&#8217;y a pas de m&#233;thode clairement &#233;tablie pour 
l&#8217;analyse pr&#233;dicative du fran&#231;ais et de texte oral. Aussi, selon les auteurs, quelques divergences peuvent 
&#234;tre observ&#233;es selon l&#8217;&#233;volution de la th&#233;orie linguistique, par exemple la proposition de Le Ny (1987) 
d&#8217;int&#233;grer les acquis de la grammaire des cas de Fillmore (1968) dans l&#8217;analyse pr&#233;dicative. Nous avons 
ainsi &#233;tabli des r&#232;gles d&#8217;analyse pr&#233;dicative, bas&#233;es sur les &#233;tudes pr&#233;c&#233;dentes (Kintsch, 1974 ; Turner et 
al., 1977 ; Le Ny, 1979 ; Ghiglione et al., 1995 ; Kemper et al., 2001 ; Chand et al., 2010). L&#8217;exemple ci-
dessous montre notre m&#233;thode d&#8217;analyse pr&#233;dicative : 
</p>
<p>le plus beau jour de ma vie bon bah r&#233;fl&#233;chissons c'est le jour de mon mariage voil&#224; il y a 52 ans bient&#244;t donc voil&#224; 
</p>
<p>bien que &#231;a a &#233;t&#233; un mariage tout &#224; fait simple parce que je ne je n'avais plus mes parents donc quand on s'est mari&#233;s 
</p>
<p>on &#233;tait 12 personnes donc vous voyez 
</p>
<p>P1. BEAU (a1) a1= jour 
</p>
<p>P2. LE PLUS (P1) 
</p>
<p>P3. DE (P1, a2) a2= vie 
</p>
<p>P4. MON (a2)  
</p>
<p>P5. COPULE (P3, a=1) 
</p>
<p>P6. DE (P5, a3) a3= mariage 
</p>
<p>P7. MON (a3)   
</p>
<p>P8. IL Y A (a4) a4= ans 
</p>
<p>P9. 52 (a4)  
</p>
<p>P10. BIENT&#212;T (P8) 
</p>
<p>P11. COPULE (P7, a3) 
</p>
<p>P12. SIMPLE (a3) 
</p>
<p>P13. TOUT A FAIT (P12) 
</p>
<p>P14. BIEN QUE (P6, P11) 
</p>
<p>P15. POSSEDER (a5, a6) a5= je, 
</p>
<p>a6= parents 
</p>
<p>P16. MON (a6) 
</p>
<p>P17. NE PLUS (P15) 
</p>
<p>P18. PARCE QUE (P12, P17) 
</p>
<p>P19. SE MARIER (a7) a7= on 
</p>
<p>P20. COPULE (a8, a9) a8= on, a9= 
</p>
<p>personnes 
</p>
<p>P21. 12 (a9) 
</p>
<p>P22. QUAND (P19, P20) 
</p>
<p>P23. DONC (P17, P22)
</p>
<p>23/57*10= 4.04 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HYERAN LEE, PHILIPPE GAMBETTE, ELSA MAILL&#201;, CONSTANCE THUILLIER  
Les pr&#233;dicats peuvent &#234;tre class&#233;s en trois grandes cat&#233;gories : pr&#233;dicateur, modificateur, et connecteur. 
Les pr&#233;dicateurs expriment l&#8217;action ou l&#8217;&#233;tat (e.g. verbes &#171; se marier &#187;, &#171; &#234;tre &#187; dans notre corpus) ; les 
modificateurs sp&#233;cifient la qualit&#233; ou la quantit&#233; de l&#8217;argument (e.g. adjectif &#171; 52 &#187;, adverbe &#171; bient&#244;t &#187;) ; 
les connecteurs relient les diff&#233;rentes id&#233;es (e.g. pr&#233;position &#171; de &#187;, conjonction &#171; donc &#187;, causalit&#233; &#171; parce 
que &#187;, concession &#171; bien que &#187;). Les arguments renvoient aux objets et/ou personnes (e.g. &#171; je &#187;, &#171; on &#187;, 
&#171; mariage &#187;), et rel&#232;vent d'une cat&#233;gorie lexicale qui a pour fonction principale la d&#233;signation d'objets, en 
l'occurrence les substantifs. Ainsi, une proposition peut &#234;tre l&#8217;argument d&#8217;une autre proposition. Si les 
pr&#233;dicats et les arguments peuvent &#234;tre relev&#233;s facilement, il est difficile d&#8217;&#233;tablir leurs relations, 
l&#8217;utilisation des anaphores, l&#8217;ambigu&#239;t&#233; s&#233;mantique cr&#233;&#233;e par l&#8217;emploi du pronom &#171; on &#187; (&#171; on &#187; de a7 dans 
P19 a comme r&#233;f&#233;rent vis&#233; &#171; nous &#187; : locutrice + son mari alors que &#171; on &#187; de a8 dans P20 a comme 
r&#233;f&#233;rent &#171; les gens &#187; incluant a7) requi&#232;rent une attention soutenue au sens v&#233;hicul&#233;. 
</p>
<p>Plusieurs probl&#233;matiques de traitement automatique des langues naturelles (e.g. traduction automatique, 
extraction d'informations, etc.) ont fait appel &#224; l'analyse pr&#233;dicative, avec l'objectif de repr&#233;senter un texte 
en langue naturelle par une formule logique, en langage des pr&#233;dicats du premier ordre. Divers 
formalismes sont par exemple pr&#233;sent&#233;s par Fran&#231;ois (1991). Toutefois, cette approche s'est heurt&#233;e aux 
limites du formalisme de repr&#233;sentation, et de telles analyses pr&#233;dicatives d'&#233;tiquetage s&#233;mantique sont 
actuellement utilis&#233;es en pratique uniquement sur des t&#226;ches tr&#232;s sp&#233;cifiques et des corpus cibl&#233;s, comme 
dans le syst&#232;me pr&#233;sent&#233; par Meurs et al. (1998). Sur des corpus plus g&#233;n&#233;raux, la couverture des bases de 
donn&#233;es s&#233;mantiques (comme FrameNet) est trop faible, et l'analyse s&#233;mantique conduit &#224; des taux 
d'erreurs importants. Ces erreurs sont amplifi&#233;es sur les corpus oraux du type de ceux qui nous int&#233;ressent 
dans le contexte du calcul de la DI, du fait des contraintes qu'ils induisent. En effet, de nombreuses 
utilisations de l&#8217;anaphore, les ph&#233;nom&#232;nes oraux particuliers tels que les mots fragment&#233;s, les &#233;nonc&#233;s 
inachev&#233;s, les ratages, les reformulations, les r&#233;p&#233;titions, les interjections, les habitudes du langage 
(gimmicks), les pauses remplies, etc. rendent l&#8217;analyse de l&#8217;oral complexe. 
</p>
<p>Cependant, le calcul de la DI ne n&#233;cessite en fait pas de calculer l'ensemble des pr&#233;dicats et de leurs 
arguments, mais seulement de compter les pr&#233;dicats. Nous avons donc choisi d'&#233;viter d'utiliser une 
approche s&#233;mantique, et d'utiliser plut&#244;t les travaux de Brown et al. (2008) sur la langue anglaise. Ceci 
dans le but de concevoir une approche du comptage des pr&#233;dicats par un ensemble de r&#232;gles appliqu&#233;es 
apr&#232;s un &#233;tiquetage morphosyntaxique du texte. Pour calculer la densit&#233; des id&#233;es, Brown et al. proposent 
le logiciel CPIDR qui &#233;tiquette chaque mot du texte comme pr&#233;dicat, ou bien comme non-pr&#233;dicat. L'id&#233;e 
principale de l'&#233;tiquetage est qu'un pr&#233;dicat correspond typiquement &#224; un verbe (pr&#233;dicateur), &#224; un adjectif, 
&#224; un adverbe (modificateurs), &#224; une pr&#233;position, ou &#224; une conjonction (connecteurs). Ainsi, l'&#233;tiquetage 
morphosyntaxique est &#224; la base du calcul approximatif de la densit&#233; des id&#233;es. Cette &#233;tape d'&#233;tiquetage 
morphosyntaxique, trait&#233;e dans le cas de CPIDR par le logiciel MontyLingua (Liu, 2004), est suivie d'un 
post-traitement &#224; base de r&#232;gles destin&#233;es &#224; corriger les erreurs d'&#233;tiquetage morphosyntaxique qui ont une 
influence sur le nombre de pr&#233;dicats, &#224; traiter le cas sp&#233;cifique des corpus oraux (avec une gestion basique 
de certaines r&#233;p&#233;titions ou auto-corrections), et enfin &#224; ajuster le calcul du nombre de pr&#233;dicats. Cette 
m&#233;thode est efficace en anglais, puisque CPIDR obtient g&#233;n&#233;ralement un meilleur accord avec un 
ensemble d'&#233;tiqueteurs humains que les &#233;tiqueteurs humains entre eux. Nous avons donc choisi de suivre 
les m&#234;mes principes, en apportant une attention particuli&#232;re au caract&#232;re oral de notre corpus, important &#224; 
la fois pour nos objectifs d'utilisation de la densit&#233; des id&#233;es, m&#234;me si l'outil que nous proposons est aussi 
destin&#233; &#224; l'&#233;crit. L'impl&#233;mentation de ces principes pour le fran&#231;ais nous a fait recourir &#224; TreeTagger 
(Schmid, 1994) pour l'&#233;tiquetage morphosyntaxique du texte. C'est ensuite un ensemble de 35 r&#232;gles 
d'ajustement que nous proposons pour d&#233;terminer si un mot est un pr&#233;dicat ou non. Des exemples de 
r&#232;gles sont fournis en figure 1, elles sont int&#233;gralement d&#233;crites dans le manuel d'utilisation de Densid&#233;es. 
Dans la mesure du possible, les num&#233;ros de r&#232;gles utilis&#233;s dans CPIDR ont &#233;t&#233; conserv&#233;s dans Densid&#233;es. 
En outre, le logiciel Densid&#233;es est &#233;crit en Python de fa&#231;on comment&#233;e et tr&#232;s lisible. Il fonctionne en </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DENSID&#201;ES : CALCUL AUTOMATIQUE DE LA DENSIT&#201; DES ID&#201;ES DANS UN CORPUS ORAL 
ligne de commande mais peut &#233;galement &#234;tre appel&#233; depuis Windows par l&#8217;interm&#233;diaire d&#8217;une interface 
graphique montr&#233;e en figure 2. 
</p>
<p> 
</p>
<p>Figure 1 : Exemples de r&#232;gles de Densid&#233;es 
</p>
<p> 
</p>
<p>Figure 2. L&#8217;interface graphique de Densid&#233;es sous Windows 
</p>
<p>2 M&#233;thode 
</p>
<p>2.1 Corpus  
</p>
<p>Pour examiner la validit&#233; de notre m&#233;thode, nous avons analys&#233; 40 textes oraux. Ce corpus est issu d&#8217;une 
&#233;tude sur la description fine de la d&#233;gradation linguistique dans la maladie d&#8217;Alzheimer. Pour le recueillir, 
nous avons men&#233; un entretien individuel semi-dirig&#233; aupr&#232;s de 40 sujets volontaires. Ces sujets sont &#226;g&#233;s 
de 65 &#224; 85 ans, ne pr&#233;sentant pas d&#8217;une pathologie cognitive, et sont locuteurs fran&#231;ais natifs. Cet entretien 
dure environ 35 minutes dont 5 &#224; 15 minutes pour l'enregistrement du discours oral. Une narration libre de 
l'&#233;vocation d'un souvenir personnel a &#233;t&#233; demand&#233;e pour la production du discours spontan&#233;, et une 
description d'image &#171; voleur du biscuit &#187;, tir&#233;e de  Boston Diagnostic Aphasia Examination (Goodglass et 
al., 1983), pour un discours descriptif. Tous les entretiens ont &#233;t&#233; enregistr&#233;s num&#233;riquement. Ces discours 
oraux ont &#233;t&#233; transcrits individuellement avec une transcription orthographique standard de type GARS 
(Blanche-Benveniste, 1998), c'est-&#224;-dire sans renormalisation de la parole (e.g. sans introduire de 
l&#8217;&#233;l&#233;ment absent &#171; ne &#187; dans &#171; il y a pas &#187;), aligner la parole et le texte. 
 
</p>
<p>R&#232;gle 208 - Comparatif : &quot;que&quot; n'est pas proposition apr&#232;s &quot;autant&quot;, &quot;moins&quot;, &quot;pire&quot;, &quot;plus&quot;  
</p>
<p>R&#232;gle 301 - Verbes de liaison (&quot;appara&#238;tre&quot;, &quot;&#234;tre&quot;, &quot;sembler&quot;, &quot;devenir&quot;, &quot;para&#238;tre&quot;, 
&quot;rester&quot;, &quot;demeurer&quot;) non propositions si suivis d'un adjectif ou d'un adverbe  
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HYERAN LEE, PHILIPPE GAMBETTE, ELSA MAILL&#201;, CONSTANCE THUILLIER  
Ce corpus a &#233;t&#233; tronqu&#233; de mani&#232;re &#224; garder environ 300  mots par transcription pour que les corpus soient 
comparables statistiquement. Kemper et al. (2001) recommande que l&#8217;&#233;chantillon du discours ne soit pas 
trop bref pour avoir un r&#233;sultat fiable, et que l&#8217;analyse porte sur un minimum de 10 &#233;nonc&#233;s, ce qui bien 
est le cas ici. 
</p>
<p>2.2 Proc&#233;dure  
</p>
<p>Nous avons choisi de proposer un pr&#233;traitement manuel du corpus pour marquer certaines caract&#233;ristiques 
sp&#233;cifiques &#224; l'oral qui ne semblent difficilement traitables de fa&#231;on automatique. Nous avons utilis&#233; les 
crochets [ ] pour marquer les mots fragment&#233;s, les r&#233;p&#233;titions successives qui ne doivent pas &#234;tre compt&#233;es 
ni comme pr&#233;dicats ni comme mots. Les parenth&#232;ses ( ) servent &#224; entourer les mots qui doivent &#234;tre 
int&#233;gr&#233;s dans le compte du nombre total de mots mais ne doivent pas &#234;tre marqu&#233;s comme pr&#233;dicats. 
Entrent dans ce cas les &#233;nonc&#233;s inachev&#233;s, les &#233;nonc&#233;s et/ou mots inaudibles, les marqueurs discursifs 
(e.g. &#171; vous voyez &#187;), les interjections (e.g. &#171; bon &#187;) qui ne doivent pas &#234;tre trait&#233;es comme des adjectifs 
(donc des pr&#233;dicats) mais qui sont consid&#233;r&#233;es comme des mots contrairement aux pauses remplies non-
lexicales (e.g. &#171; bah &#187;, &#171; hein &#187;, etc.), et les noms propres pour &#233;viter les probl&#232;mes d&#8217;&#233;tiquetage 
morphosyntaxique. Par exemple, voici le pr&#233;traitement de la phrase analys&#233;e plus haut : 
</p>
<p>le plus beau jour de ma vie (bon) bah (r&#233;fl&#233;chissons) c'est le jour de mon mariage (voil&#224;) il y a 52 ans 
bient&#244;t (donc voil&#224;) bien que &#231;a a &#233;t&#233; un mariage tout &#224; fait simple parce que [je ne] je n'avais plus 
mes parents donc quand on s'est mari&#233;s on &#233;tait 12 personnes (donc vous voyez) 
</p>
<p>Ce corpus pr&#233;trait&#233; manuellement a &#233;t&#233; soumis au calcul automatique de la DI avec la version 1.2 de 
Densid&#233;es. Deux experts ont travaill&#233; individuellement chaque texte en notant pr&#233;dicat et argument de 
chaque mot sur Excel, un troisi&#232;me examinateur a v&#233;rifi&#233; leur analyse. Le r&#233;sultat obtenu par Densid&#233;es 
est donc v&#233;rifi&#233; par ces trois experts, pour mesurer le coefficient de corr&#233;lation de l&#8217;analyse manuelle et 
automatique. 
</p>
<p>3 R&#233;sultats 
</p>
<p>La figure 3 montre les r&#233;sultats obtenus. On peut noter, entre la densit&#233; des id&#233;es calcul&#233;e manuellement et 
automatiquement, pour les 40 textes, un coefficient de corr&#233;lation de 0.972, l&#224; o&#249; CPIDR obtenait 0.942. 
</p>
<p> 
</p>
<p>Figure 3. Repr&#233;sentation de la densit&#233; des id&#233;es calcul&#233;e automatiquement en fonction de la densit&#233; des 
id&#233;es calcul&#233;e manuellement pour chacun des 40 textes du corpus </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DENSID&#201;ES : CALCUL AUTOMATIQUE DE LA DENSIT&#201; DES ID&#201;ES DANS UN CORPUS ORAL 
Pour une &#233;valuation plus fine du logiciel, nous avons choisi de d&#233;terminer le taux de faux n&#233;gatifs 
(pr&#233;dicats non &#233;tiquet&#233;s comme tels) et de faux positifs (non-pr&#233;dicats &#233;tiquet&#233;s comme pr&#233;dicats) : 
respectivement 2.7% et 3.1%. Comme la formule de densit&#233; des id&#233;es fait intervenir le nombre total de 
pr&#233;dicats, ces deux types d'erreurs se compensent, pour arriver &#224; un taux d'erreur moyen de 0.5% sur le 
nombre de pr&#233;dicats. Le corpus a alors &#233;t&#233; s&#233;par&#233; en une base de test (correspondant &#224; 10 sujets pour 
assurer une vari&#233;t&#233; dans les scores de DI) de 3728 mots et 1548 pr&#233;dicats et une base de validation de 
10211 mots et 4199 pr&#233;dicats. La base de test a &#233;t&#233; utilis&#233;e pour &#233;valuer la pertinence de chaque r&#232;gle, en 
testant l'effet de sa suppression. Pour &#233;valuer la qualit&#233; d'un &#233;tiquetage automatique, on calcule la F-
mesure, qui se base sur la pr&#233;cision (i.e. proportion de pr&#233;dicats corrects parmi les pr&#233;dicats trouv&#233;s 
automatiquement) et le rappel (i.e. proportion des pr&#233;dicats corrects trouv&#233;s par Densid&#233;es sur l'ensemble 
des pr&#233;dicats corrects). En n'utilisant que la r&#232;gle 200, qui &#233;tiquette les conjonctions, num&#233;raux, 
d&#233;terminants, pr&#233;positions, adjectifs, adverbes et verbes comme pr&#233;dicats, on obtient 29 faux n&#233;gatifs et 
1003 faux positifs, ce qui correspond &#224; une F-mesure de 0.747 sur la base de test. Si l'on prend en compte 
l'ensemble des 35 r&#232;gles de la version 1.2, on arrive &#224; une F-mesure de 0,975.  
</p>
<p>Figure 4. F-mesure obtenue apr&#232;s suppression de chaque r&#232;gle de la version 1.2 de Densid&#233;es 
</p>
<p>La figure 4 illustre la d&#233;gradation de la F-mesure induite par la suppression de chaque r&#232;gle. Ainsi, on 
constate par exemple qu'en retirant la r&#232;gle 201 d&#233;di&#233;e &#224; l'&#233;tiquetage des d&#233;terminants &quot;un&quot;, &quot;une&quot;, &quot;le&quot;, 
&quot;la&quot;, etc. (qui ne sont pas des pr&#233;dicats), la F-mesure d&#233;cro&#238;t &#224; 0.900. Inversement, la suppression de 
certaines r&#232;gles (24, 203, 208, 214, 601, 602, 703) n'a aucun effet, voire am&#233;liore l&#233;g&#232;rement la F-mesure 
en supprimant un faux positif pour la r&#232;gle 500.  
</p>
<p>M&#234;me si la suppression de ces r&#232;gles semble n'avoir aucun effet sur le corpus de test, elle pourrait en avoir 
sur d'autres textes, ce qui explique que nous les laissons dans Densid&#233;es. En effet, certaines de ces r&#232;gles 
sont plus adapt&#233;es pour des discours &#233;crits (comme la 214 qui consid&#232;re &#171; si ... alors &#187; comme un seul 
pr&#233;dicat). D'autres, &#224; l'inverse, sont pr&#233;vues pour le discours oral, mais cibl&#233;es sur des marqueurs 
discursifs particuliers que les locuteurs n'utilisent pas n&#233;cessairement : la r&#232;gle 602 consid&#232;re par exemple 
que &#171; donc &#187; n'est pas un pr&#233;dicat apr&#232;s le verbe &#171; dire &#187;.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HYERAN LEE, PHILIPPE GAMBETTE, ELSA MAILL&#201;, CONSTANCE THUILLIER  
Munis de ce score de qualit&#233; qu'est la F-mesure, nous proposons la m&#233;thodologie suivante pour l'ajout de 
nouvelles r&#232;gles ou la modification de r&#232;gles existantes dans Densid&#233;es. Nous utilisons la base de test &#224; 
titre d'exploration pour &#233;valuer l'&#233;volution de la F-mesure suite &#224; des modifications du programme, la base 
de validation sert quant &#224; elle &#224; valider la pertinence des modifications, en v&#233;rifiant que les modifications 
propos&#233;es &#224; partir du corpus de test ne sont pas biais&#233;es par les sp&#233;cificit&#233;s linguistiques de ce corpus. Par 
exemple, par rapport &#224; la version 1.2, parmi toutes les modifications de r&#232;gles test&#233;es, une seule 
(modification de la r&#232;gle 301), raisonnable du point de vue linguistique, a permis d'am&#233;liorer la F-mesure 
en atteignant 0.978 sur le corpus de test. Sur la base de validation, cette modification a permis de passer 
d'une F-mesure de 0.969 &#224; 0.972. Ainsi, elle sera int&#233;gr&#233;e dans la version 1.3 de Densid&#233;es. 
</p>
<p>4 Discussion 
</p>
<p>Un entretien oral de 300 mots n&#233;cessite environ 25 minutes de transcription, 10 minutes de parenth&#233;sage 
et 35 minutes d'&#233;tiquetage manuel des id&#233;es. Ainsi, Densid&#233;es permet de diviser par deux le temps total 
n&#233;cessaire &#224; l'&#233;valuation manuelle de la densit&#233; des id&#233;es. Il permet surtout de normaliser l'&#233;tiquetage en 
&#233;vitant les sp&#233;cificit&#233;s d'&#233;tiquetage des experts humains sur certains mots difficiles &#224; &#233;tiqueter. Pr&#233;cisons 
que le temps de parenth&#233;sage est principalement d&#251; &#224; la relecture attentive du texte n&#233;cessaire &#224; la 
d&#233;tection des passages vides de sens ou correspondant &#224; des id&#233;es r&#233;p&#233;t&#233;es. Rappelons que notre corpus 
n&#8217;&#233;tait pas cr&#233;&#233; pour l&#8217;&#233;tude du calcul automatique de la densit&#233; des id&#233;es. Si l&#8217;objectif est bien d&#233;termin&#233; 
au d&#233;part (e.g. application m&#233;dicale) et que les entretiens sont r&#233;alis&#233;s dans l'optique exclusive de calculer 
la densit&#233; des id&#233;es, la transcription ob&#233;it &#224; des contraintes cibl&#233;es, et peut se faire plus rapidement en 
conjonction avec l'&#233;tiquetage (e.g. les passages incompr&#233;hensibles plac&#233;s entre crochets ne sont alors 
simplement pas transcrits). 
</p>
<p>Il faut aussi noter, &#224; propos des bonnes performances obtenues par Densid&#233;es, que les r&#232;gles d&#8217;&#233;tiquetage 
de mots en pr&#233;dicats ou non-pr&#233;dicats pr&#233;sentent une certaine robustesse par rapport &#224; d&#8217;&#233;ventuelles 
erreurs au cours de l&#8217;&#233;tiquetage morphosyntaxique. En effet, une erreur d&#8217;&#233;tiquetage d&#8217;un verbe pris pour 
un adjectif n&#8217;aura souvent aucune cons&#233;quence sur l&#8217;&#233;tiquetage r&#233;alis&#233; par Densid&#233;es, puisque verbes et 
adjectifs sont g&#233;n&#233;ralement tous deux consid&#233;r&#233;s comme des pr&#233;dicats (par la r&#232;gle 200). 
</p>
<p>Si la densit&#233; des id&#233;es est une m&#233;thode efficace pour mesurer la quantit&#233; d&#8217;informations dans un discours, 
de nombreuses applications de l&#8217;analyse qualitative fine qu&#8217;offre l&#8217;analyse pr&#233;dicative sont d&#233;laiss&#233;es, du 
fait que les arguments ne sont pas pris en compte dans cette m&#233;thode. Par exemple, le calcul du  d&#233;calage  
(i.e. produit par le partage du m&#234;me argument par diff&#233;rentes propositions, marquant la coh&#233;sion du 
discours et sa complexit&#233; s&#233;mantique) (Duong et al., 2000). Aussi, le calcul du pr&#233;dicat de premier rang 
(i.e. qui n&#8217;implique que des arguments objets) et du pr&#233;dicat de rang sup&#233;rieur (i.e. implique &#233;galement 
ou exclusivement des arguments propositionnels). &#201;tant donn&#233; que le pr&#233;dicat de rang sup&#233;rieur a un co&#251;t 
cognitif plus important, ce type de calcul serait utile pour l&#8217;&#233;tude psycholinguistique. Pour contourner ces 
limites, une m&#233;thode probabilistique peut &#234;tre envisag&#233;e, en mesurant par exemple le nombre et le type 
d&#8217;arguments que peut avoir un pr&#233;dicat (e.g. verbe transitif &#171; vendre &#187; comporte 3 places d&#8217;argument : 
agent, objet, r&#233;cepteur). Densid&#233;es version 1.2 fait ses premiers pas vers une interpr&#233;tation qualitative du 
r&#233;sultat de la DI, en offrant les r&#233;sultats d&#233;taill&#233;s des r&#232;gles utilis&#233;es pour le calcul (e.g. le taux important 
de l&#8217;utilisation de la r&#232;gle 211 refl&#233;terait un discours construit principalement autour de la n&#233;gation, etc.).  
</p>
<p>5 Conclusion 
</p>
<p>Le logiciel Densid&#233;es fournit actuellement une approximation tout &#224; fait satisfaisante de la densit&#233; des 
id&#233;es d'un discours oral transcrit selon la m&#233;thodologie que nous proposons ici. Cette m&#233;thodologie fait 
intervenir une d&#233;tection humaine des id&#233;es r&#233;p&#233;t&#233;es, et il pourrait &#234;tre envisag&#233; d'aborder ce probl&#232;me de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DENSID&#201;ES : CALCUL AUTOMATIQUE DE LA DENSIT&#201; DES ID&#201;ES DANS UN CORPUS ORAL 
fa&#231;on automatique. Toutefois, nous pensons que l'effort d'&#233;tiquetage humain des id&#233;es r&#233;p&#233;t&#233;es pendant la 
transcription constitue un effort minime, et envisageons plut&#244;t pour de prochaines versions du logiciel 
d'am&#233;liorer l'&#233;tiquetage morphosyntaxique sur lequel se basent les r&#232;gles de Densid&#233;es, en faisant appel au 
logiciel Cordial au lieu de TreeTagger.  
</p>
<p>On peut &#233;galement noter que l'&#233;tiquetage automatique des pr&#233;dicats d&#233;pend fortement des habitudes 
langagi&#232;res r&#233;currentes des locuteurs (ajout de &#171; quoi &#187; en fin de phrase par exemple). Ainsi, compl&#233;ter 
cette approche par r&#232;gles avec une partie statistique (par exemple pour d&#233;tecter des mots fr&#233;quents 
inattendus) pourrait aider &#224; rep&#233;rer ces habitudes langagi&#232;res, et proposer automatiquement de nouvelles 
r&#232;gles adapt&#233;es.  
</p>
<p>Enfin, la densit&#233; des id&#233;es a d'autres applications cit&#233;es plus haut, dont la mesure du niveau de technicit&#233; 
d'articles scientifiques en langue anglaise. Il serait int&#233;ressant de calculer la densit&#233; des id&#233;es de corpus 
&#233;crits en fran&#231;ais pour tenter d'identifier certains genres de textes associ&#233;s &#224; une densit&#233; des id&#233;es tr&#232;s 
&#233;lev&#233;e ou au contraire tr&#232;s basse. La densit&#233; des id&#233;es pourrait aussi s&#8217;ajouter aux param&#232;tres pertinents 
pour choisir des textes en fonction de leur niveau de technicit&#233; en enseignement du fran&#231;ais langue 
&#233;trang&#232;re (Thomas, 2009). 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>ANDERSON J. (1976). Language, memory and thought. Hillsdale, NJ: Erlbaum Associates.  
</p>
<p>BLANCHE-BENVENISTE C. (1998). Approches de la langue parl&#233;e en fran&#231;ais. Paris : Ophrys. 
</p>
<p>BROWN C., SNODGRASS T., KEMPER S., HERMAN R., COVINGTON M. (2008). Automatic measurement of 
propositional idea density from part-of-speech tagging. Behavior Research Methods, 40(2), 540-545.  
</p>
<p>CHAND V., BAYNES K., BONNICI L., TOMASZEWSKI FARIAS S. (2010). Analysis of idea density (AID) : A 
manual. University of California at Davis. 
</p>
<p>COIRIER P., GAONAC'H D., PASSERAULT J.-M. (1996). Psycholinguistique textuelle : approche cognitive de 
la compr&#233;hension et de la production des textes. Paris: Armand Colin.  
</p>
<p>COVINGTON M. (2009). Idea Density: A potentially informative characteristic of retrieved documents. 
Proceedings, IEEE SoutheastCon.   
</p>
<p>COVINGTON M., RIEDEL W., BROWN C., HE C., MORRIS E., WEINSTEIN S., et al. (2007). Does ketamine 
mimic aspects of schizophrenic speech? Journal of Psychopharmacology, 21, 338-346.  
</p>
<p>DENHI&#200;RE G. (1984).  Il &#233;tait une fois... Compr&#233;hension et souvenir de r&#233;cits. Lille: Presses Universitaires 
de Lille. 
</p>
<p>DUONG A., SKA B., POISSANT A., JOANETTE Y. (2000). Effet du vieillissement de la scolarit&#233; et du stimulus 
sur la production de narrations. In Le vieillissement cognitif normal. Vers un mod&#232;le explicatif du 
vieillissement, 137-154. Bruxelles : Edition de De Boeck Universit&#233;. 
</p>
<p>FILLMORE C. (1968). The case for case. In Universals in linguistic theory, 1-88. New York: Holt, Rinehart, 
and Winston. 
</p>
<p>FRAN&#199;OIS J. (1991). Pertinence linguistique des repr&#233;sentations propositionnelles de la s&#233;mantique 
cognitive. S&#233;miotiques, 1(1), 69-80. 
</p>
<p>FRAN&#199;OIS T. (2009). Mod&#232;les statistiques pour l'estimation automatique de la difficult&#233; de textes de FLE. 
Actes de RECITAL 2009. 
</p>
<p>FREGE G. (1967). The basic laws of arithmetic. Berkeley: University of California.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HYERAN LEE, PHILIPPE GAMBETTE, ELSA MAILL&#201;, CONSTANCE THUILLIER  
FREGE G. (1971). &#201;crits logiques et philosophiques. Paris : Presses Universitaires de France.  
</p>
<p>GHIGLIONE R. (1982). Analyse propositionnelle et mod&#232;les argumentatifs. Connexions, 38, 89-106.  
</p>
<p>GHIGLIONE R., KEKENBOSCH C., LANDR&#201; A. (1995). L'analyse cognitivo-discursive. Grenoble: Presses 
Universitaires de Grenoble.  
</p>
<p>GOODGLASS H., KAPLAN E. (1983) The assessment of aphasia and related disorders. Philadelphia : Lea 
and Febiger.   
</p>
<p>JAKOBSON R. (1963). Essais de linguistique g&#233;n&#233;rale. Paris : &#201;ditions de Minuit.  
</p>
<p>KEMPER S., GREINER L., MARQUIS J., PRENEVOST K., MITZNER T. (2001). Language decline across life 
span: findings from the Nun study. Psychology and Aging, 16(2), 227-239.  
</p>
<p>KINTSCH W. (1974). The representation of meaning in memory. Hillsdale, NJ : Erlbeaum.  
</p>
<p>KINTSCH W., KEENAN J. (1973). Reading rate and retention as a function of the number of propositions in 
the base structure of sentences. Cognitive Psychology, 5(3), 257-274.  
</p>
<p>KINTSCH W., KEENAN J. (1978). Toward a model of text comprehension and production. Psychological 
Review, 85, 363-394.  
</p>
<p>LE NY J.-F. (1979). La s&#233;mantique psychologique. Paris : Presses Universitaires de France. 
</p>
<p>LE NY J.-F. (1987). S&#233;mantique psychologique. In Probl&#232;mes de psycholinguistique, 13-42. Bruxelles : 
Pierre Mardaga.  
</p>
<p>LE NY J.-F. (1989). Science cognitive et compr&#233;hension du langage. Paris : Presses Universitaires de 
France.  
</p>
<p>LEE H., BARKAT-DEFRADAS M. (2009). La densit&#233; des id&#233;es : un mod&#232;le d'analyse du discours pertinent 
pour le diagnostic pr&#233;coce de la maladie d'Alzheimer ? Actes des 8&#232;me Rencontres Jeunes Chercheurs en 
Parole.  
</p>
<p>LIU H. (2004). MontyLingua : An end-to-end natural language processor with common sense. Available at: 
web.media.mit.edu/~hugo/montylingua 
</p>
<p>MEURS M., DUVERT F., B&#201;CHET F., LEF&#200;VRE F., DE MORI R. (2008). Annotation en Frames S&#233;mantiques 
du corpus de dialogue MEDIA. Actes de TALN 2008.  
</p>
<p>MOREAUD O., DAVID D., CHARNALLET A., PELLAT J. (2001). Are semantic errors actually semantic ? 
Evidence from Alzheimer&#8217;s disease. Brain and language, 77, 176-186. 
</p>
<p>SCHMID H. (1994). Probabilistic Part-of-Speech tagging using decision trees. In New Methods in Language 
Processing, 154-164. London : UCL Press.  
</p>
<p>SNOWDON D., KEMPER S., MORTIMER J., GREINER L., WEKSTEIN D., MAYKESBERY W. (1996). Linguistic 
ability in early life and cognitive function and Alzheimer's disease in late life: findings from the Nun 
Study, JAMA, 275, 528-532.  
</p>
<p>TAKAO A., PROTHERO W., KELLY G. (2002). Applying argumentation analysis to assess the quality of 
university oceanography students' scientific writing. Journal of Geoscience Education, 50, 40-48.  
</p>
<p>THORSON E., SNYDER R. (1984). Viewer recall of television commercials: structure of commercial scripts. 
Psychological Review, 85, 363-394. 
</p>
<p>TURNER A., GREENE E. (1977). The construction and use of a propositional text base. Technical report, 63. 
Boulder: Institute for the study of intellectual behavior, University of Colorado. 
</p>
<p> </p>

</div></div>
</body></html>