<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Automatiser la r&#233;daction de d&#233;finitions terminographiques : questions et traitements</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Automatiser la r&#233;daction de d&#233;finitions terminographiques :
questions et traitements
</p>
<p>Selja Sepp&#228;l&#228;
TIM/ISSCO, ETI, Universit&#233; de Gen&#232;ve, Suisse
</p>
<p>seppala2@etu.unige.ch
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons une analyse manuelle de corpus de contextes conceptuels
afin (i) de voir dans quelle mesure les m&#233;thodes de TALN existantes sont en principe ad&#233;quates pour au-
tomatiser la r&#233;daction de d&#233;finitions terminographiques, et (ii) de d&#233;gager des question pr&#233;cises dont la
r&#233;solution permettrait d&#8217;automatiser davantage la production de d&#233;finitions. Le but est de contribuer &#224; la
r&#233;flexion sur les enjeux de l&#8217;automatisation de cette t&#226;che, en proc&#233;dant &#224; une s&#233;rie d&#8217;analyses qui nous
m&#232;nent, &#233;tape par &#233;tape, &#224; examiner l&#8217;ad&#233;quation des m&#233;thodes d&#8217;extraction de d&#233;finitions et de contextes
plus larges au travail terminographique de r&#233;daction des d&#233;finitions. De ces analyses &#233;mergent des ques-
tions pr&#233;cises relatives &#224; la pertinence des informations extraites et &#224; leur s&#233;lection. Des propositions de
solutions et leurs implications pour le TALN sont examin&#233;es.
</p>
<p>Abstract. A manual corpus analysis of conceptual contexts is presented in order (i) to indicatively
evaluate to what extent NLP methods can in principle be used to automate the production of terminogra-
phic definitions, and (ii) to identify central questions to be answered if one wants to further automate the
task. The objective is to contribute to reflection on the challenges faced by the automation of this task.
Through a series of analyses, the adequacy of extraction methods for defining or knowledge-rich contexts
is examined in the light of the terminographic activity of definition writing. Precise questions emerge from
these analyses relating to the relevance and the selection of the extracted information. Some solutions are
proposed and their implications to NLP reviewed.
</p>
<p>Mots-cl&#233;s : Terminologie, d&#233;finitions terminographiques, s&#233;lection des traits, pertinence des traits,
extraction de d&#233;finitions, contextes conceptuels, traitement automatique des d&#233;finitions.
</p>
<p>Keywords: Terminology, terminographic definitions, feature selection, feature relevance, defini-
tion extraction, conceptual contexts, definition processing.
</p>
<p>1 Introduction
</p>
<p>En terminologie, la r&#233;daction de d&#233;finitions implique, traditionnellement, le d&#233;pouillement manuel de
vastes corpus textuels sp&#233;cialis&#233;s. Afin de faciliter la t&#226;che, le terminologue a souvent recours au TALN
pour automatiser autant que possible la production de ressources terminologiques (dictionnaires, bases
de donn&#233;es, etc.). S&#8217;agissant de la r&#233;daction de d&#233;finitions, au moins deux m&#233;thodes de TALN peuvent
&#234;tre int&#233;gr&#233;es &#224; la m&#233;thodologie terminographique : les m&#233;thodes d&#8217;acquisition automatique de d&#233;finitions
&#171; canoniques &#187;, par exemple (Cartier, 2004; Malais&#233; et al., 2004; Rebeyrolle &amp; Tanguy, 2000; Rebeyrolle,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SELJA SEPP&#196;L&#196;
</p>
<p>2000, pour le fran&#231;ais) et (Meyer, 2001; Pearson, 1998, pour l&#8217;anglais), et celles d&#8217;extraction d&#8217;informa-
tions ou de relations conceptuelles (par exemple, Marshman et al., 2002). Cependant, dans la perspective
du terminologue traditionnel, il est l&#233;gitime de se demander (i) dans quelle mesure l&#8217;application de ces
m&#233;thodes de TALN permet, en principe, de r&#233;aliser un travail d&#233;finitoire &#233;quivalent au travail manuel et
(ii) ce qui pourrait &#234;tre envisag&#233; pour parvenir &#224; une plus grande automatisation de la t&#226;che. Dans cet ar-
ticle, nous tentons de r&#233;pondre &#224; ces questions &#224; titre indicatif. Pour ce faire, nous analysons manuellement
un corpus de contextes conceptuels tir&#233;s de corpus textuels sp&#233;cialis&#233;s. L&#8217;ad&#233;quation des deux m&#233;thodes
cit&#233;es plus haut est &#233;valu&#233;e sur la base (i) du contenu du corpus de contextes et (ii) par comparaison avec
des d&#233;finitions r&#233;dig&#233;es manuellement suivant la m&#233;thodologie terminographique enseign&#233;e et pratiqu&#233;e
par la plupart des terminologues dans un cadre professionnel. Cet examen vise ainsi l&#8217;ad&#233;quation des m&#233;-
thodes de TALN &#224; la m&#233;thodologie de r&#233;daction des d&#233;finitions terminographiques, et non l&#8217;inverse. Il
ne s&#8217;agit donc pas d&#8217;&#233;valuer les performances de ces m&#233;thodes en soi, mais de voir quelle peut &#234;tre leur
couverture th&#233;orique lorsqu&#8217;elles sont appliqu&#233;es &#224; la terminographie. Nous proposons ensuite de mener
une r&#233;flexion sur la nature des informations en corpus et leur relation aux d&#233;finitions. Ces r&#233;flexions nous
am&#232;neront &#224; identifier des questions centrales auxquelles la terminologie doit r&#233;pondre pour parvenir &#224;
une plus grande automatisation de la production de d&#233;finitions. Ces consid&#233;rations peuvent &#233;galement &#234;tre
utiles pour le TALN en mati&#232;re de g&#233;n&#233;ration automatique de d&#233;finitions.
</p>
<p>Apr&#232;s une br&#232;ve pr&#233;sentation du corpus (section 2), nous proposons, premi&#232;rement (section 3), une analyse
quantitative (mais non significative) de la proportion de d&#233;finitions canoniques figurant dans un corpus de
d&#233;pouillement terminographique et en comparons les r&#233;sultats aux d&#233;finitions issues d&#8217;un travail termino-
graphique classique (manuel). Un d&#233;calage apparent nous am&#232;ne, deuxi&#232;mement (section 4), &#224; consid&#233;rer
les contextes formant le corpus &#224; la lumi&#232;re de la m&#233;thodologie terminographique que l&#8217;on souhaite au-
tomatiser, &#224; savoir la production de d&#233;finitions. Ceci implique la prise en compte d&#8217;une d&#233;finition de la
d&#233;finition qui corresponde &#224; cette pratique : un &#233;nonc&#233; construit &#224; partir de traits extraits de corpus. Une
nouvelle analyse du corpus en termes de traits nous permet de soulever la question de la pertinence des
informations, ce qui nous conduit &#224; un r&#233;examen des traits selon leur degr&#233; de pertinence (section 5). Cet
examen permet d&#8217;identifier l&#8217;une des probl&#233;matiques centrales du traitement (en l&#8217;occurrence, la g&#233;n&#233;ra-
tion) automatique des d&#233;finitions en terminologie : la s&#233;lection des traits &#224; inclure dans une d&#233;finition. Cette
probl&#233;matique recouvre diff&#233;rentes questions qui doivent &#234;tre r&#233;solues pour toute (semi-)automatisation du
travail terminographique. Finalement (section 6), nous proposons quelques pistes de solutions possibles,
ainsi que l&#8217;examen d&#8217;une solution empirique &#224; la question de la s&#233;lection d&#8217;informations d&#233;finitoires.
</p>
<p>2 Pr&#233;sentation du corpus de contextes conceptuels
</p>
<p>Les r&#233;sultats indicatifs pr&#233;sent&#233;s dans ce travail proviennent de l&#8217;analyse de 127 contextes conceptuels
(voir paragraphe suivant) relatifs &#224; 56 concepts tir&#233;s de cinq domaines distincts : 21 concepts du domaine
des catastrophes &#233;cologiques, 18 du traitement des d&#233;chets, 4 de la m&#233;t&#233;orologie, 5 de la lutte antidopage et
8 du stress. Les corpus sp&#233;cialis&#233;s dont sont tir&#233;s les contextes regroupent des textes r&#233;dig&#233;s par des experts
des diff&#233;rents domaines. Ces textes comportent la terminologie des domaines concern&#233;s et apportent des
informations sur les concepts du domaine, ainsi que sur l&#8217;usage des termes. Les sources ont donc &#233;t&#233;
s&#233;lectionn&#233;es pour leur fiabilit&#233; et pour la richesse de leur contenu informatif 1. Ces donn&#233;es proviennent
</p>
<p>1. Sur les crit&#232;res de s&#233;lection de textes &#224; inclure dans un corpus de d&#233;pouillement terminographique, voir notamment
(Pearson, 1998).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AUTOMATISER LA R&#201;DACTION DE D&#201;FINITIONS TERMINOGRAPHIQUES :
QUESTIONS ET TRAITEMENTS
</p>
<p>de travaux de d&#233;pouillement effectu&#233;s dans le cadre de cours de m&#233;thodologie terminographique dispens&#233;s
&#224; l&#8217;&#201;cole de traduction et d&#8217;interpr&#233;tation de l&#8217;Universit&#233; de Gen&#232;ve ; la nature du corpus peut de ce
fait sembler quelque peu artificielle. Cependant, aussi bien la m&#233;thodologie de constitution des corpus,
que celles d&#8217;extraction manuelle des donn&#233;es et de r&#233;daction des d&#233;finitions sont les m&#234;mes que celles
qui sont pratiqu&#233;es par la plupart des terminologues dans un cadre professionnel. Soulignons &#233;galement
qu&#8217;au vu du nombre restreint de concepts examin&#233;s, la pr&#233;sente &#233;tude ne vise ni &#224; l&#8217;exhaustivit&#233; ni &#224; la
repr&#233;sentativit&#233;, son but est principalement de voir dans quelle mesure les m&#233;thodes de TALN sont en
principe ad&#233;quates pour l&#8217;automatisation de la r&#233;daction de d&#233;finitions (sachant que les chiffres indiquent
seulement une tendance &#224; v&#233;rifier sur d&#8217;autres donn&#233;es 2).
</p>
<p>Un contexte conceptuel correspond &#224; un extrait de texte tir&#233; d&#8217;un ouvrage sp&#233;cialis&#233; qui comporte une
ou plusieurs unit&#233;(s) d&#8217;information conceptuelle (trait(s), voir section 4) relative(s) au concept &#224; d&#233;finir, y
compris parfois des d&#233;finitions canoniques. Comme le pr&#233;cise Meyer (2001, 282, 299), ce type de contexte
a une triple fonction en terminographie : fournir des d&#233;finitions, fournir des points de d&#233;part pour la
r&#233;daction de d&#233;finitions, et enrichir les connaissances du terminologue relativement au domaine trait&#233;. La
notion de contexte ici consid&#233;r&#233;e est cependant plus large et moins formelle que celle qui est propos&#233;e
notamment par (Meyer, 2001; Pearson, 1998; Rebeyrolle, 2000), puisqu&#8217;elle ne suppose pas forc&#233;ment la
pr&#233;sence du terme d&#233;signant le concept, m&#234;me si, de fait, il y figure souvent. L&#8217;extraction des contextes a
&#233;t&#233; r&#233;alis&#233;e manuellement apr&#232;s identification de toutes les informations sur le concept susceptibles ou non
d&#8217;&#234;tre inclues dans une d&#233;finition. Le rep&#233;rage des ces informations &#233;tant bas&#233; sur le contenu-m&#234;me des
contextes, on peut consid&#233;rer qu&#8217;il n&#8217;y a que peu de silence dans les informations extraites. Chaque concept
du corpus est, par ailleurs, accompagn&#233; d&#8217;une d&#233;finition r&#233;dig&#233;e manuellement 3 suivant la m&#233;thodologie
traditionnelle. La structure g&#233;n&#233;rale des donn&#233;es pour chaque concept du corpus est la suivante 4 :
&lt;concept&gt;[&lt;contexte(s)&gt;[&lt;trait(s)&gt;|&lt;d&#233;f_en_contexte&gt;]][&lt;d&#233;f&gt;].
</p>
<p>Voici l&#8217;exemple du concept gravit&#233; dans le domaine des catastrophes g&#233;ologiques :
</p>
<p>Ctxt1 En faisant r&#233;f&#233;rence &#224; un [espace du danger dont] [les deux dimensions] sont la gravit&#233; et la proba-
bilit&#233;, [les grandes catastrophes ont une faible fr&#233;quence mais une gravit&#233; importante.]
</p>
<p>Ctxt2 [Un danger peut &#234;tre repr&#233;sent&#233; selon] [deux param&#232;tres qui sont la gravit&#233;] et la probabilit&#233;. C&#8217;est
en agissant sur ces deux axes que l&#8217;on pourra diminuer le nombre et [l&#8217;ampleur des catastrophes] qui
ne [sont que r&#233;alisation du danger.]
</p>
<p>D&#233;f. Param&#232;tre repr&#233;sentant l&#8217;une des deux dimensions du danger, qui permet de mesurer l&#8217;importance
d&#8217;une catastrophe.
</p>
<p>Le tableau 1 r&#233;capitule le nombre de contextes par concept, d&#8217;occurrences de traits 5 par concept et d&#8217;oc-
currences de traits par contexte. Si le nombre de contextes par concept est en moyenne de 2,3, il importe
de noter pour la suite que le nombre d&#8217;occurrences le plus fr&#233;quent, c&#8217;est-&#224;-dire le mode, est de 1 contexte
par concept (28/56 concepts, soit 50 %). Au total, 75 % des concepts dans le corpus &#233;tudi&#233; font l&#8217;objet
d&#8217;au maximum 2 contextes. Les concepts faisant l&#8217;objet de 3 contextes ou plus sont par cons&#233;quent, ici,
exceptionnels.
</p>
<p>2. Les donn&#233;es sont actuellement annot&#233;es par un autre terminologue en vue d&#8217;une &#233;valuation interannotateurs.
3. Les d&#233;finitions existantes pour chaque concept ont &#233;t&#233;, pour la plupart, r&#233;dig&#233;es par nous-m&#234;me dans le cadre des cours
</p>
<p>de terminographie ; il y aurait donc lieu d&#8217;effectuer le m&#234;me type d&#8217;&#233;tude sur des d&#233;finitions r&#233;dig&#233;es par un tiers.
4. Nous n&#8217;entrons pas, ici, dans les d&#233;tails du sch&#233;ma d&#8217;annotation XML utilis&#233; pour l&#8217;analyse des donn&#233;es.
5. Nous distinguons plus loin le nombre d&#8217;occurrences de traits (499) des types de traits (380).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SELJA SEPP&#196;L&#196;
</p>
<p>contextes/concept occ. de traits/concept traits/contexte
totaux 127/56 499/56 499/127
</p>
<p>moyenne 2,3 8,9 3,9
mode 1 (50 %) 3 (16 %) 1 (24 %)
</p>
<p>TABLE 1 &#8211; Contextes et traits par concept et par contexte
</p>
<p>3 D&#233;finitions canoniques dans le corpus
</p>
<p>Pour voir dans quelle mesure l&#8217;extraction automatique de d&#233;finitions &#224; structure canonique peut &#234;tre utili-
s&#233;e pour l&#8217;automatisation de la production de d&#233;finitions, nous avons identifi&#233; toutes les d&#233;finitions cano-
niques du corpus. Nous distinguons les d&#233;finitions enti&#232;res des d&#233;finitions partielles 6. Une d&#233;finition est
consid&#233;r&#233;e comme enti&#232;re lorsqu&#8217;elle correspond au patron g&#233;n&#233;ral g&#233;n&#233;rique+sp&#233;cifique et qu&#8217;elle peut
&#234;tre extraite suivant les m&#233;thodes propos&#233;es notamment par Rebeyrolle (2000) ou Cartier (2004), pour le
fran&#231;ais. En ce sens, elle peut &#234;tre (ou a effectivement &#233;t&#233;, dans les d&#233;finitions bas&#233;es sur ces donn&#233;es)
reprise telle quelle du corpus de d&#233;pouillement, moyennant des modifications mineures de mise en forme
pour satisfaire les conventions de r&#233;daction dictionnairiques. Elle est consid&#233;r&#233;e comme partielle lorsqu&#8217;il
manque un ou plusieurs traits &#8212; en particulier le g&#233;n&#233;rique, mais aussi un sp&#233;cifique, si on la compare &#224;
la d&#233;finition qui a &#233;t&#233; r&#233;dig&#233;e &#224; partir des contextes disponibles. Parmi les 127 contextes analys&#233;s, seul 21
</p>
<p>nb. concepts % nb. contextes %
d&#233;finitions (enti&#232;res ou partielles) 16 29 21 16,5
</p>
<p>d&#233;finitions enti&#232;res 11 19,6 13 10,2
d&#233;finitions partielles 5 8,9 8 6,3
</p>
<p>TABLE 2 &#8211; D&#233;finitions dans le corpus
</p>
<p>(16,5 %) comportent une d&#233;finition enti&#232;re ou partielle. Dans la mesure o&#249; un m&#234;me concept peut faire
l&#8217;objet de plusieurs contextes comportant une d&#233;finition 7, il convient plut&#244;t de rapporter le total des d&#233;fi-
nitions &#171; canoniques &#187; au nombre de concepts dans le corpus. Ainsi consid&#233;r&#233;, le total est de 16 d&#233;finitions
pour 56 concepts (28,6 %), parmi lesquelles 11 d&#233;finitions (19,6 %) sont enti&#232;res et 5 (8,9 %), partielles.
Ces chiffres &#233;tant relativement r&#233;duits, il semble raisonnable de dire que les corpus (pour le moins ceux
qui ont &#233;t&#233; utilis&#233;s dans ces travaux, mais ces chiffres semblent confirmer les observations de Meyer (2001,
284)) ne comportent que peu de d&#233;finitions &#224; part enti&#232;re.
</p>
<p>Du point de vue de l&#8217;automatisation de la production de d&#233;finitions, ces r&#233;sultats impliquent que m&#234;me
si un syst&#232;me avait extrait toutes les d&#233;finitions du corpus, moins d&#8217;un tiers des concepts seraient au final
accompagn&#233;s d&#8217;une d&#233;finition en bonne et due forme. Or, chacun des 56 concepts du corpus s&#8217;est vu attri-
buer une d&#233;finition sur la base du m&#234;me corpus &#233;tudi&#233;. Donc, en principe, le recours aux seules m&#233;thodes
d&#8217;extraction automatique de d&#233;finitions canoniques est insuffisant. Ce d&#233;calage s&#8217;explique par le fait que
la m&#233;thodologie terminographique de r&#233;daction de d&#233;finitions ne repose pas exclusivement sur le rep&#233;rage
de d&#233;finitions canoniques, mais aussi sur celle d&#8217;informations inclues dans des contextes conceptuels plus
larges. Ces informations ou traits permettent ensuite de construire une d&#233;finition canonique, d&#8217;o&#249; l&#8217;int&#233;r&#234;t
de recourir &#224; l&#8217;extraction de contextes conceptuels plus larges. En effet, comme le souligne Meyer (2001,
284), m&#234;me s&#8217;ils ne comportent pas de d&#233;finitions &#224; part enti&#232;re, les contextes extraits (semi-)automatique-
ment n&#8217;en sont pas moins utiles pour le terminologue. La question serait alors plut&#244;t de savoir comment
</p>
<p>6. Voir aussi les d&#233;finitions formelles et semi-formelles chez Pearson (1998).
7. Par exemple, des contextes tir&#233;s de sources distinctes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AUTOMATISER LA R&#201;DACTION DE D&#201;FINITIONS TERMINOGRAPHIQUES :
QUESTIONS ET TRAITEMENTS
</p>
<p>passer &#224; une (semi-)automatisation de l&#8217;&#233;tape suivante : la construction de d&#233;finitions. Il convient, pour ce
faire, de prendre en compte la m&#233;thodologie traditionnelle, afin d&#8217;identifier les questions qui se posent et
d&#8217;en examiner les cons&#233;quences sur l&#8217;automatisation de la production de d&#233;finitions.
</p>
<p>4 Traits dans le corpus
</p>
<p>Partant de la m&#233;thodologie terminographique de r&#233;daction des d&#233;finitions, nous proposons la d&#233;finition
de d&#233;finition suivante : une d&#233;finition est un &#233;nonc&#233; compos&#233; d&#8217;un ensemble de traits tir&#233;s d&#8217;un corpus
sp&#233;cialis&#233;. Elle comporte g&#233;n&#233;ralement un trait g&#233;n&#233;rique et un ou plusieurs trait(s) sp&#233;cifique(s). Un trait
correspond &#224; une unit&#233; d&#8217;information textuelle contenue dans un contexte. Il ne s&#8217;agit pas d&#8217;une unit&#233; syn-
taxique mais conceptuelle. Ainsi, une phrase &#224; l&#8217;int&#233;rieur d&#8217;un contexte peut &#234;tre subdivis&#233;e en plusieurs
traits, dans la mesure o&#249; ceux-ci peuvent chacun &#234;tre caract&#233;ris&#233;s par un type de classe ou de relation
conceptuelle 8 donn&#233; et &#234;tre autonomes par rapport aux autres traits. Ces traits sont rep&#233;r&#233;s dans les cor-
pus de d&#233;pouillement. Une fois les traits pertinents identifi&#233;s, le terminologue proc&#232;de &#224; une synth&#232;se des
informations s&#233;lectionn&#233;es pour chaque concept en les int&#233;grant dans une phrase unique. Les d&#233;finitions
ainsi obtenues figurent dans les ressources (dictionnaires ou bases de donn&#233;es) terminographiques. Les
d&#233;finitions associ&#233;es aux concepts du corpus analys&#233; ont &#233;t&#233; r&#233;dig&#233;es suivant cette m&#233;thodologie, ce qui
explique le d&#233;calage observ&#233; dans la section pr&#233;c&#233;dente.
</p>
<p>Sur la base de cette d&#233;finition, nous avons manuellement annot&#233; le corpus de contextes conceptuels de
fa&#231;on &#224; faire ressortir tous les traits relatifs aux 56 concepts des domaines consid&#233;r&#233;s, qu&#8217;ils soient ou
non susceptibles d&#8217;&#234;tre utilis&#233;s pour d&#233;finir. Dans cette section, nous faisons une analyse de la r&#233;partition
des traits dans le corpus, afin de quantifier la proportion de traits susceptibles d&#8217;&#234;tre utiles pour d&#233;finir
un concept. Un examen du corpus sous forme de traits devrait permettre d&#8217;identifier la probl&#233;matique
sous-tendant la r&#233;daction de d&#233;finitions.
</p>
<p>Le corpus compte un total de 380 types de traits (ou 499 occurrences de traits si l&#8217;on compte les traits qui
apparaissent deux fois ou plus). Dans la plupart des analyses, le d&#233;compte final du nombre de traits ne tient
pas compte des r&#233;p&#233;titions, car m&#233;thodologiquement parlant, ce sont les types d&#8217;information susceptibles
d&#8217;entrer dans une d&#233;finition qui comptent et non leurs diff&#233;rents modes d&#8217;expression.
</p>
<p>On constate, l&#224; encore, un d&#233;calage entre la moyenne et le mode, respectivement de 8,9 et 3 traits par
concept et de 3,9 et 1 trait(s) par contexte. Concernant les occurrences de traits par concept et par contexte,
on constate un grand nombre de configurations distinctes avec des fr&#233;quence allant de 1 &#224; 54 traits par
concept et de 1 &#224; 25 traits par contexte, o&#249; les fr&#233;quences les plus &#233;lev&#233;es sont de 3 &#224; 7 traits par concept
(51,8 %) et de 1 &#224; 5 traits par contexte (27,5 %). On sait, par ailleurs, &#224; travers des &#233;tudes de corpus de
d&#233;finitions terminographiques (Sepp&#228;l&#228;, 2005), que le nombre de traits par d&#233;finition le plus fr&#233;quent (le
mode) est de 3 (40,2 % de 500 cas), g&#233;n&#233;rique et sp&#233;cifiques confondus. Ces chiffres montrent que le
corpus rec&#232;le donc bien plus d&#8217;informations sous forme de traits qu&#8217;il n&#8217;est n&#233;cessaire pour d&#233;finir un
concept. Ce constat am&#232;ne une premi&#232;re conclusion : tous les traits figurant dans le corpus ne semblent
pas forc&#233;ment utiles pour d&#233;finir un concept. Il y a donc lieu d&#8217;analyser les contextes plus en d&#233;tail pour
en extraire tous les traits (les informations) relatifs &#224; chaque concept et voir dans quelle mesure ils sont
susceptibles d&#8217;&#234;tre inclus dans une d&#233;finition. Se pose donc la question de la pertinence des traits.
</p>
<p>8. Par exemple, les classes ARTEFACT, ENTITE ABSTRAITE, etc., ou les relations FONCTION, PARTIE,
CAUSE, CONSEQUENCE, etc.. Il est &#224; noter que ce corpus-ci n&#8217;est pas annot&#233; avec ces classes et ces relations.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SELJA SEPP&#196;L&#196;
</p>
<p>5 Classification des traits en fonction de leur pertinence
</p>
<p>Afin de voir si tous les types de traits dans le corpus sont susceptibles d&#8217;&#234;tre inclus dans une d&#233;finition,
nous faisons appel &#224; la notion intuitive de pertinence des traits 9. Nous proposons donc un cadre descriptif
permettant de cat&#233;goriser les traits figurant dans le corpus selon qu&#8217;ils sont susceptibles ou non de figurer
dans une entr&#233;e (fiche) terminologique (traits latents vs traits saillants), et selon qu&#8217;ils sont potentiellement
pertinentes ou non pour d&#233;finir le concept consid&#233;r&#233; (traits saillants vs traits potentiellement pertinents).
Les niveaux consid&#233;r&#233;s sont les suivants :
Trait latent Un trait latent (L) correspond &#224; une information qui n&#8217;est en principe pas exprim&#233;e dans une
</p>
<p>entr&#233;e terminologique 10, par exemple, le trait &#171; [. . . ] ils ressemblent aux mouvements d&#8217;un liquide dans
une marmite plac&#233;e sur une source chaude. &#187; associ&#233; au concept courant de convection dans le domaine
des catastrophes &#233;cologiques.
</p>
<p>Trait saillant Un trait saillant (S) correspond &#224; une information qui est en principe exprim&#233;e dans tout
autre champ d&#8217;une entr&#233;e terminologique que celui de la d&#233;finition, par exemple, le trait &#171; [. . . ] repr&#233;sen-
ter 40 % du volume des ordures et 15 % de leur poids. &#187; associ&#233; au concept emballage dans le domaine
du traitement des d&#233;chets.
</p>
<p>Trait potentiellement pertinent Un trait potentiellement pertinent (PP) correspond &#224; une information
qui est susceptible d&#8217;&#234;tre exprim&#233;e dans le champ d&#233;finition d&#8217;une entr&#233;e terminologique, par exemple,
le trait &#171; [. . . ] &#233;tablis pour faire face &#224; des risques naturels ou technologiques ne faisant pas l&#8217;objet de
plans particuliers. &#187; associ&#233; au concept plan de secours sp&#233;cialis&#233; dans le domaine des catastrophes
&#233;cologiques.
</p>
<p>Les traits figurant dans le corpus de contextes conceptuels ont &#233;t&#233; (section 5.1) annot&#233;s &#224; l&#8217;aide de ces
descripteurs, ainsi qu&#8217;avec des marques indiquant leur &#233;ventuel r&#244;le dans la d&#233;finition (le type d&#8217;&#233;l&#233;ment
d&#233;finitoire : g&#233;n&#233;rique, sp&#233;cifique ou extension). Ces annotations ont permis deux types d&#8217;analyses : (i)
d&#233;terminer la proportion de traits PP, S et L dans le corpus, et (ii) voir la r&#233;partition des traits selon
l&#8217;&#233;ventuel type d&#8217;information d&#233;finitoire auquel ils pourraient correspondre. Par ailleurs, les d&#233;finitions
propos&#233;es pour chaque concept ont &#233;t&#233; (section 5.2) d&#233;compos&#233;es en traits, que nous appelons pertinents
(P) 11. Chaque occurrence de trait pertinent a ensuite &#233;t&#233; recherch&#233;e dans le corpus afin de voir son niveau
de pertinence (PP, S ou L) originel. Cette analyse permet (i) de d&#233;terminer la proportion de traits en corpus
finalement pertinente pour d&#233;finir, et (ii) de voir si tous les traits P correspondent &#224; des traits PP en corpus.
</p>
<p>5.1 Niveaux de pertinence des traits dans le corpus
</p>
<p>Dans la suite de l&#8217;analyse, nous ne consid&#233;rons que les types de traits de fa&#231;on &#224; avoir une id&#233;e plus pr&#233;cise
de la r&#233;partition effective des traits selon (i) leur degr&#233; de pertinence (L, S et PP), (ii) le type d&#8217;&#233;l&#233;ment
auquel un trait pourrait correspondre dans une d&#233;finition (gen, spe ou ext), et (iii) leur nature L, S ou PP
lorsqu&#8217;ils sont pertinents (P), c&#8217;est-&#224;-dire lorsqu&#8217;ils figurent dans la d&#233;finition finale propos&#233;e pour chaque
concept.
</p>
<p>9. Le choix des traits inclus dans la d&#233;finition est, en effet, bien souvent fait intuitivement, sur la base des informations
contenues dans les textes, des recommandations d&#8217;experts et des connaissances d&#8217;arri&#232;re-plan du terminologue.
</p>
<p>10. M&#234;me si cette information peut &#234;tre utile dans un dictionnaire &#224; vis&#233;e vulgarisatrice, par exemple, elle n&#8217;est pas signifi-
cative pour l&#8217;expert dans la connaissance de son domaine.
</p>
<p>11. Nous choisissons de les consid&#233;rer comme pertinents, dans la mesure o&#249; ils ont &#233;t&#233; d&#233;lib&#233;r&#233;ment s&#233;lectionn&#233;s pour d&#233;finir
les concepts consid&#233;r&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AUTOMATISER LA R&#201;DACTION DE D&#201;FINITIONS TERMINOGRAPHIQUES :
QUESTIONS ET TRAITEMENTS
</p>
<p>L&#8217;analyse de la r&#233;partition des types de traits en fonction de leur degr&#233; de pertinence montre que plus de
la moiti&#233; (240/380, 64 %) sont PP, que 125/380 (33 %) sont S et que la part des types de traits L est tr&#232;s
petite (13/380, 3 %) 12. Ce r&#233;sultat implique, &#224; nouveau, que les informations contenues dans le corpus ne
sont pas toutes forc&#233;ment susceptibles d&#8217;&#234;tre utiles pour d&#233;finir, puisque le corpus comporte des traits qui
ne sont a priori pas pertinents pour d&#233;finir. Se pose alors la probl&#233;matique de la s&#233;lection des traits.
</p>
<p>S&#8217;agissant de la r&#233;partition des types de traits selon les &#233;l&#233;ments d&#233;finitoires auxquels ils sont suscep-
tibles de correspondre dans une d&#233;finition, on constate que la plupart correspondent soit &#224; des sp&#233;cifiques
(44,2 %) soit &#224; aucun &#233;l&#233;ment d&#233;finitoire (35,3 %) puisqu&#8217;il s&#8217;agit de traits L ou S. Une infime proportion
de types de traits (3,4 %) correspond &#224; des traits extensionnels ; de ce fait, ils pourraient &#234;tre compris
dans une d&#233;finition de ce type ou dans une d&#233;finition mixte m&#234;lant traits sp&#233;cifiques et extensionnels. Il
est &#233;galement &#224; noter que les contextes comportent davantage de g&#233;n&#233;riques (17,1 %) qu&#8217;il n&#8217;en faudrait
proportionnellement au nombre de concepts consid&#233;r&#233;s : 65 g&#233;n&#233;riques potentiels pour 56 concepts. Cette
disproportion implique &#224; nouveau que, dans plusieurs cas, un choix doit &#234;tre fait entre diff&#233;rents g&#233;n&#233;riques
disponibles pour un m&#234;me concept.
</p>
<p>5.2 Niveaux de pertinence des traits dans les d&#233;finitions
</p>
<p>L&#8217;analyse de la r&#233;partition des traits pertinents montre que, sur les 380 types de traits du corpus, 180 sont
P (47,4 %) 13, c&#8217;est-&#224;-dire qu&#8217;ils ont &#233;t&#233; s&#233;lectionn&#233;s pour d&#233;finir un concept. Presque tous ces traits P sont
issus de l&#8217;ensemble de traits PP (170/180, soit 94 %). Ceci semble tout &#224; fait normal, puisque les traits
PP sont justement ceux qui ont &#233;t&#233; consid&#233;r&#233;s comme susceptibles d&#8217;entrer dans une d&#233;finition. On notera
cependant que la part des types de traits PP du corpus qui sont &#233;galement P est de 70,2 % (170 PP=P sur
242 PP). Parmi les traits P, 10 sur 180 (6 %) correspondent &#224; des traits qui ont &#233;t&#233; cat&#233;goris&#233;s comme S. Si
l&#8217;on observe ces traits-l&#224; de plus pr&#232;s, on constate qu&#8217;il s&#8217;agit pour la plupart de traits extensionnels (6/10
traits). Les autres correspondent &#224; des traits S s&#233;lectionn&#233;s comme pertinents pour diff&#233;rentes raisons que
nous n&#8217;avons pas la place de d&#233;tailler ici. Il est n&#233;anmoins &#224; noter que ces derniers auraient tout aussi bien
pu &#234;tre mis dans un champ note s&#233;par&#233;. Par cons&#233;quent, si l&#8217;on fait abstraction de ces traits S=P, on peut
consid&#233;rer qu&#8217;une d&#233;finition ne comporte que des traits PP, ce qui confirme la n&#233;cessit&#233; de distinguer entre
traits PP et traits S et L, en vue de la s&#233;lection des premiers.
</p>
<p>Cette analyse des traits, en corpus et dans les d&#233;finitions, en fonction de leur degr&#233; de pertinence permet de
mettre en lumi&#232;re une probl&#233;matique g&#233;n&#233;rale de la r&#233;daction de d&#233;finitions : la s&#233;lection des traits. Elle
permet, en particulier, d&#8217;identifier trois questions pr&#233;cises &#224; r&#233;soudre pour toute (semi-)automatisation de
cette t&#226;che, et donc pour le traitement automatique des d&#233;finitions, mais aussi plus g&#233;n&#233;ralement dans une
th&#233;orie des d&#233;finitions. La premi&#232;re question, issue des constats qu&#8217;un tiers des types traits dans le corpus
sont S ou L, et que les traits P de la d&#233;finition sont PP en corpus, est de savoir comment distinguer les traits
PP des traits S et L. La deuxi&#232;me question est de savoir comment s&#233;lectionner les traits P parmi les traits
PP. Elle &#233;merge des constats que les traits P correspondent &#224; quelques exceptions pr&#232;s aux traits PP dans
</p>
<p>12. Ces r&#233;sultats sont n&#233;anmoins &#224; nuancer, car il se peut que la part des traits S et L soit, ici, plus r&#233;duite que ce que l&#8217;on peut
trouver g&#233;n&#233;ralement dans les corpus de d&#233;pouillement, y compris ceux dont ont &#233;t&#233; extraits les contextes analys&#233;s. De fait, les
donn&#233;es dont nous disposions &#233;taient destin&#233;es &#224; des cours sur la m&#233;thodologie de r&#233;daction de d&#233;finitions ; il se peut d&#232;s lors
que certains contextes qui ne comportaient que des traits S ou L n&#8217;aient pas &#233;t&#233; retenus par les enseignants. Il est cependant
int&#233;ressant de noter que, m&#234;me en tenant compte de ce biais, les contextes comportent une proportion importante de traits S.
Cet &#233;ventuel biais ne nuit donc en rien &#224; notre propos, mais il y aurait n&#233;anmoins lieu d&#8217;effectuer le m&#234;me type d&#8217;analyses sur
d&#8217;autres donn&#233;es pour voir si l&#8217;on obtient des r&#233;sultats comparables.
</p>
<p>13. Rapport&#233; au nombre total d&#8217;occurrences de traits, le nombre de traits P est de 283 sur 499, soit 56,7 % des traits.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SELJA SEPP&#196;L&#196;
</p>
<p>le corpus, et qu&#8217;environ 30 % des types de traits PP ne sont pas effectivement P. La troisi&#232;me question, qui
d&#233;coule du fait que le corpus comporte plus de g&#233;n&#233;riques qu&#8217;il n&#8217;y a de concepts, est de savoir comment
s&#233;lectionner le g&#233;n&#233;rique ad&#233;quat.
</p>
<p>Si le terminologue peut souvent faire confiance &#224; ses intuitions, &#224; son exp&#233;rience et &#224; l&#8217;aide d&#8217;experts du
domaine pour cat&#233;goriser (implicitement) les traits en fonction du niveau de pertinence et faire ces diff&#233;-
rents choix 14, ce n&#8217;est pas le cas d&#8217;un programme informatique. L&#8217;adoption de ce cadre descriptif inspir&#233;
de la pratique terminographique a donc des cons&#233;quences pour le traitement automatique, puisqu&#8217;il exige
que la notion de niveau de pertinence soit d&#233;finie plus formellement. L&#8217;absence de ce type de crit&#232;res a
notamment des r&#233;percussions sur l&#8217;&#233;valuation des syst&#232;mes d&#8217;extraction, comme le souligne Meyer (2001,
298). Il y aurait, par cons&#233;quent, lieu de d&#233;terminer des crit&#232;res de pertinence des traits qui permettent
d&#8217;automatiser, au moins partiellement, la s&#233;lection de traits &#224; inclure dans une d&#233;finition.
</p>
<p>6 Examen d&#8217;un crit&#232;re de s&#233;lection empirique
</p>
<p>Dans cette section, nous nous int&#233;ressons plus particuli&#232;rement &#224; la premi&#232;re et &#224; la deuxi&#232;me question,
&#224; savoir comment distinguer les traits PP des traits S et L, et comment s&#233;lectionner les traits P parmi
les traits PP. L&#8217;une des solutions propos&#233;e par Meyer (2001) est de cibler l&#8217;extraction non pas sur les
d&#233;finitions &#224; proprement parler ou les contextes en g&#233;n&#233;ral, mais sur les traits en fonction du type de
relation qu&#8217;ils expriment. Cette m&#233;thode, qui permet de disposer des traits pouvant &#234;tre combin&#233;s pour
former une d&#233;finition, implique &#224; son tour deux difficult&#233;s : (i) mettre au point des algorithmes d&#8217;extraction
capables de cat&#233;goriser les informations en fonction du type de relation conceptuelle exprim&#233; ; et, plus
fondamentalement, (ii) savoir, ensuite, quels sont les types de relations pertinents pour d&#233;finir 15. Cette
derni&#232;re question se pose d&#8217;ailleurs aussi au terminologue qui compose la d&#233;finition manuellement. Une
solution &#224; ce probl&#232;me serait d&#8217;&#233;tudier la nature conceptuelle (en termes de classes et de relations) des
traits composant des d&#233;finitions existantes, afin de voir si elles pr&#233;sentent des r&#233;gularit&#233;s, par exemple, en
fonction du type de classe conceptuelle d&#233;finie ou du domaine 16. Il est &#224; noter que ce type d&#8217;entreprise
pose, lui aussi, des d&#233;fis en TALN, notamment en ce qui concerne la segmentation des d&#233;finitions en
traits et leur annotation conceptuelle. Une autre solution, mais qui ne permettrait que de distinguer entre
traits S et PP (ce qui ne r&#233;pond pas &#224; la question des traits pertinents), serait de rechercher des marqueurs
linguistiques caract&#233;ristiques des traits S, notamment la pr&#233;sence de noms propres, de valeurs num&#233;riques,
ou d&#8217;autres types d&#8217;informations non g&#233;n&#233;ralisantes (voir notamment les propositions de Pearson (1998)
et de Meyer (2001), tels que les modaux). Ce type de solution implique, l&#224; encore, la mise au point
d&#8217;algorithmes tels que ceux qui sont utilis&#233;s pour l&#8217;extraction d&#8217;entit&#233;s nomm&#233;es, par exemple. Les deux
types de solutions propos&#233;es impliquent, en outre, un minimum de th&#233;orie des d&#233;finitions, si ce n&#8217;est des
concepts, qui rende compte de la nature des concepts et de leurs relations, ou de la nature discursive des
propositions pouvant &#234;tre &#233;nonc&#233;es &#224; propos des objets et de leur statut d&#233;finitoire.
</p>
<p>Pour tenter de pallier les probl&#232;mes &#233;voqu&#233;s ci-dessus, nous proposons d&#8217;examiner une hypoth&#232;se de
pertinence des traits purement empirique : la r&#233;p&#233;tition d&#8217;un trait en corpus est un signe de pertinence.
Il s&#8217;agit, ici, de rep&#233;rer et d&#8217;analyser dans le corpus les traits qui figurent deux fois ou plus dans un ou
</p>
<p>14. M&#234;me s&#8217;il serait souhaitable qu&#8217;il dispose d&#8217;autres crit&#232;res pour ce faire, et donc d&#8217;une th&#233;orie de la d&#233;finition qui rende
compte de ces crit&#232;res.
</p>
<p>15. Au sujet des relations, voir &#233;galement la discussion de Meyer (2001, 297&#8211;298), sections 4.2 et 4.3.
16. Des travaux en ce sens ont &#233;t&#233; initi&#233;s dans Sepp&#228;l&#228; (2005) et font actuellement l&#8217;objet de notre th&#232;se de doctorat.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AUTOMATISER LA R&#201;DACTION DE D&#201;FINITIONS TERMINOGRAPHIQUES :
QUESTIONS ET TRAITEMENTS
</p>
<p>plusieurs contexte(s) relatif(s) &#224; un m&#234;me concept. L&#224; encore, il y a lieu de distinguer les occurrences des
types de traits qui se r&#233;p&#232;tent (respectivement 185/499 traits et 66/380 types). La moyenne de r&#233;p&#233;titions
d&#8217;un trait est de 2,76 traits/type, le nombre d&#8217;occurrences le plus fr&#233;quent (le mode) &#233;tant de 2 traits/type
et concerne 61 % des types. Ensemble, les types se r&#233;p&#233;tant deux et trois fois repr&#233;sentent 84 % du total
des types de traits. Pour 48 types sur 66 (73 %), la r&#233;p&#233;tition a lieu dans des contextes distincts (contextes
multiples) ; seul 18 types sur 66 (27 %) ont leurs diff&#233;rentes occurrences &#224; l&#8217;int&#233;rieur d&#8217;un m&#234;me contexte
(contexte unique).
</p>
<p>En ce qui concerne l&#8217;analyse du niveau de pertinence des types de traits &#224; occurrences multiples, on
constate que la tr&#232;s grande majorit&#233; de ces types de traits (61/66, soit 92 %) sont des traits PP ; il n&#8217;y a
aucun trait L et seulement 8 % de traits S (5/66 types de traits). On constate, par ailleurs, que 54/66 types
(82 %) sont aussi pertinents (P) 17, ce qui tend &#224; confirmer notre hypoth&#232;se sur la pertinence des traits qui
se r&#233;p&#232;tent. Parmi ces derniers, on ne trouve qu&#8217;un seul trait S ; les 53 restants sont tous des traits PP. La
r&#233;p&#233;tition pourrait donc &#234;tre un bon indice pour discriminer les traits PP des traits S et L. En outre, seul
3 % des types de traits &#224; occurrences multiples (soit 2/66 types) ne correspondent &#224; aucun &#233;l&#233;ment de la
structure d&#233;finitoire (contre 35,5 % pour l&#8217;ensemble des types de traits du corpus). Ces r&#233;sultats tendent
&#224; montrer que les types de traits qui se r&#233;p&#232;tent ont potentiellement leur place dans une d&#233;finition. En
revanche, la proportion de g&#233;n&#233;riques (27 %, contre 17,1 %), de sp&#233;cifiques (65 %, contre 44,2 %) et de
traits extensionnels (5 %, contre 3,4 %) est similaire.
</p>
<p>Ramen&#233;s &#224; l&#8217;ensemble des traits du corpus, les types de traits &#224; occurrences multiples repr&#233;sentent 17,4 %
des types de traits du corpus (66/380), soit 37,1 % des occurrences de traits (185/499). Ils repr&#233;sentent,
par ailleurs, un quart des traits PP et seulement 4 % des traits S. En termes d&#8217;&#233;l&#233;ments de la structure
d&#233;finitoire, ils repr&#233;sentent plus ou moins un quart des g&#233;n&#233;riques, des sp&#233;cifiques et des extensions, mais
seulement 1,5 % des traits qui ne sont attribuables &#224; aucun &#233;l&#233;ment d&#233;finitoire (soit 2/134). Le r&#233;sultat le
plus int&#233;ressant reste, cependant, que les types de traits &#224; occurrences multiples qui sont effectivement P ne
repr&#233;sentent que 30 % de l&#8217;ensemble des traits P figurant dans les d&#233;finitions 18, ce qui oblige &#224; relativiser
les r&#233;sultats consid&#233;r&#233;s uniquement par rapport aux types de traits &#224; occurrences multiples dans le corpus.
Ce chiffre tend &#233;galement &#224; infirmer l&#8217;hypoth&#232;se test&#233;e.
</p>
<p>Ainsi, la r&#233;p&#233;tition des traits semble, &#224; premi&#232;re vue, &#234;tre un bon indice empirique pour d&#233;cider de leur
pertinence, et ce d&#232;s deux occurrences du m&#234;me trait (configuration de loin la plus fr&#233;quente, qui concerne
61 % des types de traits qui se r&#233;p&#232;tent 19). Cette conclusion est n&#233;anmoins &#224; nuancer au vu d&#8217;un certain
nombre de limites susceptibles de remettre en cause la fiabilit&#233; de cette m&#233;thode pour d&#233;terminer la per-
tinence d&#8217;un trait, et surtout son impl&#233;mentation : les types de traits &#224; occurrences multiples pertinents
ne repr&#233;sentent que 30 % de l&#8217;ensemble des traits pertinents ; la plupart du temps (73 %), les diff&#233;rentes
occurrences d&#8217;un m&#234;me type de trait figurent dans des contextes distincts, or l&#8217;analyse g&#233;n&#233;rale du corpus
de contextes (section 3) r&#233;v&#232;le que la moiti&#233; des concepts ne fait l&#8217;objet que d&#8217;un seul contexte, il peut d&#232;s
lors s&#8217;av&#233;rer difficile d&#8217;utiliser cette m&#233;thode de fa&#231;on syst&#233;matique, notamment si l&#8217;on souhaite l&#8217;automa-
tiser ; la m&#234;me information peut &#234;tre formul&#233;e de fa&#231;ons si diff&#233;rentes d&#8217;une occurrence &#224; l&#8217;autre qu&#8217;il peut
parfois &#234;tre difficile de dire s&#8217;il s&#8217;agit vraiment du m&#234;me type de trait &#8212; l&#224; encore, il peut s&#8217;av&#233;rer difficile
d&#8217;utiliser cette m&#233;thode de fa&#231;on syst&#233;matique &#8212; ; l&#8217;information r&#233;p&#233;t&#233;e peut &#234;tre implicite et n&#233;cessiter
une intervention humaine, voire celle d&#8217;un expert, pour d&#233;terminer s&#8217;il s&#8217;agit bien de la m&#234;me information
ou non ; la m&#233;thode, purement empirique, manque de pouvoir explicatif.
</p>
<p>17. Ramen&#233; au nombre d&#8217;occurrences de traits qui se r&#233;p&#232;tent, les traits P repr&#233;sentent 85 % du total, soit 157/185 traits.
18. Cela implique, &#224; l&#8217;inverse, que 70 % des traits P ne se r&#233;p&#232;tent pas dans le corpus.
19. &#192; savoir 40 types de traits P se r&#233;p&#233;tant deux fois sur un total de 66 types de traits &#224; occurrences multiples.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SELJA SEPP&#196;L&#196;
</p>
<p>7 Conclusion
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; une analyse manuelle de corpus de contextes conceptuels afin (i) de
voir dans quelle mesure les m&#233;thodes de TALN existantes sont en principe ad&#233;quates pour automatiser la
r&#233;daction de d&#233;finitions, et (ii) de d&#233;gager des question pr&#233;cises dont la r&#233;solution permettrait d&#8217;automa-
tiser davantage la production de d&#233;finitions. Gr&#226;ce &#224; une premi&#232;re analyse de contextes conceptuels, nous
avons montr&#233; que la part des d&#233;finitions &#171; canoniques &#187; dans les corpus est relativement r&#233;duite, et donc
que la seule extraction automatique de d&#233;finitions est en principe insuffisante. Ce constat nous a conduit &#224;
prendre en compte la m&#233;thodologie terminographique de r&#233;daction de d&#233;finitions, afin d&#8217;examiner le cor-
pus suivant un cadre descriptif correspondant : une analyse sous forme de traits. &#192; l&#8217;issue de cette analyse,
nous avons montr&#233; que toutes les informations contenues dans un corpus ne sont pas forc&#233;ment utiles pour
d&#233;finir un concept. Pour voir dans quelle mesure les diff&#233;rents traits figurant dans le corpus sont suscep-
tibles d&#8217;entrer dans une d&#233;finition, nous avons pos&#233; un cadre descriptif permettant d&#8217;annoter les traits en
fonction de leur degr&#233; de pertinence. Nous avons ensuite proc&#233;d&#233; &#224; l&#8217;analyse des donn&#233;es ainsi annot&#233;es
pour les comparer avec les traits pertinents composant les d&#233;finitions existantes de chaque concept. Les
r&#233;sultats nous ont permis de d&#233;gager de fa&#231;on empirique trois questions pr&#233;cises li&#233;es &#224; la probl&#233;matique
centrale de la s&#233;lection des traits. Une fois les questions identifi&#233;es, nous avons consid&#233;r&#233; la question de
leur r&#233;solution, c&#8217;est-&#224;-dire de l&#8217;identification de crit&#232;res de s&#233;lection des traits pertinents. Nous avons pro-
pos&#233; quelques pistes et &#233;voqu&#233; leurs implications pour le TALN, puis examin&#233; une hypoth&#232;se purement
empirique : la r&#233;p&#233;tition d&#8217;un trait dans le corpus est un signe de pertinence. Cette derni&#232;re &#233;tude tend &#224;
montrer que l&#8217;automatisation de la s&#233;lection des traits sur la seule base de la fr&#233;quence est limit&#233;e. La difi-
cult&#233; pourrait en partie &#234;tre due au fait qu&#8217;il s&#8217;agit de questions li&#233;es au contenu conceptuel ou s&#233;mantique
des traits, donc difficilement abordables sans th&#233;orie. Les r&#233;sultats de cette analyse nous permettent de
conclure &#224; l&#8217;int&#233;r&#234;t qu&#8217;il y aurait &#224; consid&#233;rer des solutions th&#233;oriques &#224; la probl&#233;matique de la s&#233;lection
des traits, pour ensuite &#233;tudier la possibilit&#233; de les impl&#233;menter de fa&#231;on (semi-)automatique.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CARTIER E. (2004). Rep&#233;rage automatique des expressions d&#233;finitoires. PhD thesis.
MALAIS&#201; V., ZWEIGENBAUM P. &amp; BACHIMONT B. (2004). Extraction d&#8217;informations s&#233;mantiques
pour l&#8217;aide &#224; la construction d&#8217;ontologies diff&#233;rentielles. In Actes Journ&#233;es d&#8217;&#233;tude Terminologie, Onto-
logie et Repr&#233;sentation des Connaissances. Lyon.
MARSHMAN E., MORGAN T. &amp; MEYER I. (2002). French patterns for expressing concept relations.
Terminology, 8(1), 1&#8211;29.
MEYER I. (2001). Extracting knowledge-rich contexts for terminography. In Recent Advances in Com-
putational Terminology. John Benjamins.
PEARSON J. (1998). Terms in Context. Studies in corpus linguistics 1.
REBEYROLLE J. (2000). Utilisation de contextes d&#233;finitoires pour l&#8217;acquisition de connaissances &#224; partir
de textes. Actes IC&#8217;2000, p. 105&#8211;114.
REBEYROLLE J. &amp; TANGUY L. (2000). Rep&#233;rage automatique de structures linguistiques en corpus : le
cas des &#233;nonc&#233;s d&#233;finitoires. Cahiers de grammaire, 25, 153&#8211;174.
SEPP&#196;L&#196; S. (2005). Structure des d&#233;finitions terminographiques : une &#233;tude pr&#233;liminaire. In Actes
TIA&#8217;05, p. 19&#8211;29.</p>

</div></div>
</body></html>