<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Cat&#233;gorisation automatique d'adjectifs d'opinion &#224; partir d'une ressource linguistique g&#233;n&#233;rique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2010 &#8211; Session Posters, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Cat&#233;gorisation automatique d'adjectifs d'opinion &#224; partir d'une ressource 
</p>
<p>linguistique g&#233;n&#233;rique 
</p>
<p>Baptiste Chardon
1,2 
</p>
<p>(1)  Synapse D&#233;veloppement, 33 rue Maynard, 31000 Toulouse 
(2) IRIT, UMR5505, 31000 Toulouse 
</p>
<p>chardon@irit.fr, baptiste.chardon@synapse-fr.com 
</p>
<p>R&#233;sum&#233; Cet article d&#233;crit un processus d&#8217;annotation manuelle de textes d&#8217;opinion, bas&#233; sur un 
sch&#233;ma fin d'annotation ind&#233;pendant de la langue et du corpus. Ensuite, &#224; partir d'une partie de ce 
</p>
<p>sch&#233;ma, une m&#233;thode de construction automatique d'un lexique d'opinion &#224; partir d'un analyseur 
</p>
<p>syntaxique et d'une ressource linguistique est d&#233;crite. Cette m&#233;thode consiste &#224; construire un arbre de 
</p>
<p>d&#233;cision bas&#233; sur les classes de concepts de la ressource utilis&#233;e. Dans un premier temps, nous avons 
</p>
<p>&#233;tudi&#233; la couverture du lexique d'opinion obtenu par comparaison avec l&#8217;annotation manuelle effectu&#233;e 
sur un premier corpus de critiques de restaurants. La g&#233;n&#233;ricit&#233; de ce lexique a &#233;t&#233; mesur&#233;e en le 
</p>
<p>comparant avec un second lexique, g&#233;n&#233;r&#233; &#224; partir d'un corpus de commentaires de films. Dans un 
</p>
<p>second temps, nous avons &#233;valu&#233; l'utilisabilit&#233; du lexique au travers d'une t&#226;che extrins&#232;que, la 
</p>
<p>reconnaissance de la polarit&#233; de commentaires d'internautes. 
</p>
<p>Abstract This paper introduces a manual annotation process of opinion texts, based on a fine-
featured annotation scheme, independent of language and corpus. Then, from a part of this scheme, a 
</p>
<p>method to build automatically an opinion lexicon from a syntactic analyser and a linguistic resource is 
</p>
<p>described. This method consists in building a decision tree from the classes of the resource. The 
</p>
<p>coverage of the lexicon has been determined by comparing it to the gold annotation of a restaurants 
</p>
<p>review corpus. Its genericity was determined by comparing it to another lexicon generated from a 
</p>
<p>different domain corpus (movie reviews). Eventually, the usefulness of the lexicon has been measured 
</p>
<p>with an extrinsic task, the recognition of the polarity of reviews. 
</p>
<p>Mots-cl&#233;s :   Analyse d'opinion, Extension de lexique, Annotation d'opinions 
</p>
<p>Keywords:   Opinion mining, Lexicon extension, Opinion annotation 
 
</p>
<p>1 Introduction 
</p>
<p>Afin de r&#233;pondre au besoin grandissant d'automatisation du processus de traitement des donn&#233;es 
</p>
<p>d'opinion, la recherche en extraction d'opinion a connu un essor important ces derni&#232;res ann&#233;es. 
</p>
<p>Plusieurs projets de repr&#233;sentation et d'annotations de l'opinion dans les textes ont &#233;t&#233; r&#233;alis&#233;s : citons 
</p>
<p>notamment le projet d'annotations MPQA (Wiebe et al., 2005), les travaux li&#233;s &#224; la th&#233;orie Appraisal 
</p>
<p>(Martin et al., 2005), et les travaux bas&#233;s sur l&#8217;analyse du discours (Asher et al., 2009). En parall&#232;le de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAPTISTE CHARDON 
</p>
<p>ces approches plus linguistiques, des m&#233;thodes computationnelles de constitution de ressources 
</p>
<p>linguistiques ont &#233;t&#233; propos&#233;es, suivant deux approches principales : approches dites &#224; base de corpus 
</p>
<p>(Turney et al., 2002) et &#224; base de dictionnaires (Kamps et al., 2004). Dans ce contexte, nos travaux 
</p>
<p>r&#233;pondent &#224; plusieurs objectifs : 
</p>
<p>1. &#201;tudier finement les expressions d'opinion en fran&#231;ais. Pour cela, nous proposons en section 2 un 
</p>
<p>sch&#233;ma g&#233;n&#233;rique d'annotation des opinions d'un texte prenant en compte le maximum d'&#233;l&#233;ments 
</p>
<p>linguistiques jug&#233;s pertinents pour l'&#233;valuation et la compr&#233;hension de ces opinions. Ce mod&#232;le a &#233;t&#233; 
</p>
<p>utilis&#233; et &#233;valu&#233; dans le cadre d'une annotation de critiques francophones de restaurants. 
</p>
<p>2. Afin d'automatiser le processus  d'extraction d'opinions, il est n&#233;cessaire d'&#233;laborer une ressource 
</p>
<p>linguistique d&#233;crivant les termes porteurs d'opinions. Nous proposons en section 3 un algorithme 
</p>
<p>permettant d'&#233;tendre une liste de mots germes &#224; partir d'une ressource linguistique g&#233;n&#233;rique et d'un 
</p>
<p>analyseur syntaxique.  
</p>
<p>3. Enfin, pour &#233;valuer la qualit&#233; du lexique g&#233;n&#233;r&#233;, nous proposons trois &#233;tapes de test. Tout d'abord, 
nous avons &#233;valu&#233; la couverture du lexique en le comparant &#224; celui produit lors de l'annotation manuelle. 
</p>
<p>Ensuite, nous avons test&#233; sa g&#233;n&#233;ricit&#233; en comparant les lexiques produits &#224; partir de deux listes de 
</p>
<p>germes diff&#233;rentes, issues de deux corpus de domaines distincts (critiques de films et critiques de 
</p>
<p>restaurants). Nous avons enfin test&#233; l'utilisabilit&#233; de ce lexique en d&#233;terminant automatiquement la 
</p>
<p>polarit&#233; de critiques de restaurants. Les r&#233;sultats de ces &#233;valuations sont d&#233;taill&#233;s en section 4. 
</p>
<p>2 Mod&#232;le d'annotation pour l'&#233;tude fine des expressions d'opinion 
</p>
<p>Une opinion peut &#234;tre positive, n&#233;gative ou neutre. Cette distinction s'av&#232;re n&#233;anmoins insuffisante. En 
</p>
<p>effet, &#224; cela s'ajoutent des nuances d'intensit&#233;, par exemple entre des adjectifs tels que &quot;excellent&quot; et 
</p>
<p>&quot;correct&quot;. Une opinion ne se limite pas non plus aux seules expressions d'opinion : elle est 
</p>
<p>n&#233;cessairement &#233;mise par une personne ou un groupe de personnes, qui peut &#233;ventuellement &#234;tre 
</p>
<p>diff&#233;rent du locuteur. De m&#234;me, elle porte sur un sujet, plus ou moins pr&#233;cis. D'autres &#233;l&#233;ments externes 
</p>
<p>peuvent &#233;galement venir modifier la s&#233;mantique de l'opinion. Ces &#233;l&#233;ments, qui jouent le r&#244;le 
</p>
<p>d'op&#233;rateur, peuvent apporter des modifications au niveau de la polarit&#233; et/ou de l'intensit&#233;, du degr&#233; de 
</p>
<p>certitude de l'&#233;metteur, ou du degr&#233; de v&#233;racit&#233; d'une opinion rapport&#233;e. Enfin, une opinion s'inscrit dans 
</p>
<p>un contexte discursif, et est par cons&#233;quent reli&#233;e &#224; d'&#233;ventuelles autres opinions au travers des relations 
</p>
<p>du discours. Notre objectif pour &#233;tablir notre mod&#232;le d'annotation &#233;tait de prendre en compte la totalit&#233; 
</p>
<p>de ces &#233;l&#233;ments. 
</p>
<p>2.1 Projets d'annotation d'opinions existants 
</p>
<p>Parmi les travaux existants, le plus connu est sans doute le projet d'annotation MPQA (Wiebe et al., 
</p>
<p>2005), qui se base sur la notion d'&#233;tat priv&#233; de (Quirk et al., 1985). Il pr&#233;voit une annotation de la polarit&#233; 
</p>
<p>des opinions, de leur intensit&#233; sur quatre niveaux (&#233;chelle allant de faible &#224; extr&#234;me), une distinction 
</p>
<p>entre opinions explicites et implicites (i.e. support&#233;es par des termes pr&#233;cis du texte, ou sous-entendues), 
</p>
<p>et une annotation de l'&#233;metteur de l'opinion. 
</p>
<p>D'un autre c&#244;t&#233;, (Whitelaw et al., 2005) ont utilis&#233; la th&#233;orie Appraisal (Martin et al., 2005) afin de 
</p>
<p>proposer une classification des expressions d'opinion via un large panel d'attributs. N&#233;anmoins, ces 
</p>
<p>travaux se limitent principalement &#224; la classification fine d'adjectifs d'opinion et d'op&#233;rateurs d'intensit&#233;.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CATEGORISATION AUTOMATIQUE D'ADJECTIFS D'OPINION A PARTIR D'UNE RESSOURCE LING. GENERIQUE 
</p>
<p>(Asher et al., 2009) ont quant &#224; eux propos&#233; un travail tr&#232;s descriptif d'annotation de l'opinion. Les 
</p>
<p>opinions ont  &#233;t&#233; classifi&#233;es suivant quatre cat&#233;gories : sentiment, jugement, conseil et reportage (i.e. 
</p>
<p>verbes introducteurs de la parole) ; chacune de ces cat&#233;gories &#233;tant li&#233;es &#224; des informations 
</p>
<p>compl&#233;mentaires de polarit&#233;, d'intensit&#233;, d'engagement de l'&#233;metteur. Ces opinions &#233;taient ensuite reli&#233;es 
</p>
<p>&#224; leur &#233;metteur  et &#224; leur sujet, et enfin reli&#233;es entre elles via un sous-ensemble des relations discursives 
</p>
<p>de la SDRT (Th&#233;orie des Repr&#233;sentations Discursives Segment&#233;es, Asher et Lascarides, 2003). 
</p>
<p>Nos travaux se situent dans le cadre de la SDRT et dans la continuit&#233; de (Asher et al., 2009), avec une 
</p>
<p>reprise des cat&#233;gories et &#233;l&#233;ments pr&#233;c&#233;demment &#233;voqu&#233;s. Ceux-ci ont &#233;t&#233; retravaill&#233;s et compl&#233;t&#233;s, afin 
</p>
<p>de prendre en compte notamment les op&#233;rateurs de modalit&#233;, d'intensit&#233;, et de n&#233;gation, ainsi qu'un 
</p>
<p>ensemble plus large de relations de discours. L'annotation manuelle r&#233;pond &#224; plusieurs objectifs. Tout 
</p>
<p>d'abord, elle a permis de valider la pertinence des cat&#233;gories et relations s&#233;lectionn&#233;es, dans le sens o&#249; un 
</p>
<p>annotateur humain doit pouvoir annoter chaque phrase sans trop de doute. Elle a &#233;galement permis de 
</p>
<p>tester la validit&#233; de nos hypoth&#232;ses concernant les &#233;l&#233;ments intervenant dans le calcul de l'opinion au 
</p>
<p>niveau local, avec les op&#233;rateurs de n&#233;gation, d'intensit&#233;  et de modalit&#233;. De m&#234;me, elle permet d'&#233;tudier 
</p>
<p>au niveau global l'importance des ph&#233;nom&#232;nes discursifs, via notamment les relations de la SDRT 
</p>
<p>s&#233;lectionn&#233;es. L'annotation des &#233;l&#233;ments a enfin permis de mesurer et valider les r&#233;sultats des 
</p>
<p>applications d'extraction d'opinions en fran&#231;ais. 
</p>
<p>2.2 Mod&#232;le propos&#233; 
</p>
<p>Voici le mod&#232;le que nous avons utilis&#233; pour l'annotation du document. Cette annotation est centr&#233;e sur 
</p>
<p>les opinions v&#233;hicul&#233;es par le document et prend en compte le maximum d'&#233;l&#233;ments linguistiques jug&#233;s 
</p>
<p>pertinents pour l'&#233;valuation et la compr&#233;hension de ces opinions. Le mod&#232;le propos&#233; est ind&#233;pendant de 
</p>
<p>la langue, m&#234;me s'il s'appuie sur des exemples en fran&#231;ais. De m&#234;me, il est ind&#233;pendant du domaine. 
</p>
<p>Un document est un triplet : D = &lt;O,U,R&gt;, o&#249; O d&#233;signe l'ensemble des expressions d'opinion 
</p>
<p>&#233;l&#233;mentaires du document, U l'ensemble des segments de discours du document, et R l'ensemble des 
</p>
<p>relations entre les &#233;l&#233;ments de U. Plus pr&#233;cis&#233;ment, O est un ensemble de quadruplets &lt;Sujet, &#201;metteur, 
</p>
<p>Expressions d'opinion, Op&#233;rateurs&gt; , tels que:  
</p>
<p>- Sujet d&#233;signe ici le sujet de l'opinion. &#201;metteur d&#233;signe l'&#233;metteur de l'opinion. 
</p>
<p>- Expressions d'opinion d&#233;signe un quadruplet : &lt;txt, cat, val, hyp&gt;, tels que txt d&#233;signe les bornes de 
</p>
<p>l'annotation (lexicalisation), cat la cat&#233;gorie s&#233;mantique de l&#8217;expression, val une mesure de la polarit&#233; et 
de l&#8217;intensit&#233; de l&#8217;expression (valeur enti&#232;re entre -3 pour &quot;tr&#232;s n&#233;gatif&quot; et +3 pour &quot;tr&#232;s positif&quot;, 0 
d&#233;signant une opinion mitig&#233;e ou ambigu&#235;), enfin, hyp est un bool&#233;en, vrai si l'opinion est &#233;mise dans le 
</p>
<p>cadre d'une hypoth&#232;se (Si ce restaurant est bon, nous y retournerons.). La cat&#233;gorie 
</p>
<p>s&#233;mantique peut &#234;tre :  
</p>
<p> Explicite : d&#233;signe une opinion explicitement support&#233;e par des termes pr&#233;cis du texte. 
</p>
<p>L'expression peut &#234;tre un avis (Le restaurant est bon.) ou une recommandation (Je 
</p>
<p>recommande fortement les ramen.). 
</p>
<p> Implicite d&#233;signe les opinions sous-entendues, les faits &#233;tant interpr&#233;t&#233;s comme opinion dans le 
</p>
<p>contexte. (De la terrasse, on voit toute la ville. ) 
</p>
<p> 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAPTISTE CHARDON 
</p>
<p>- Op&#233;rateurs d&#233;signe les diff&#233;rents op&#233;rateurs qui peuvent influer sur l'opinion, nous distinguons : 
</p>
<p> Les op&#233;rateurs d'engagement : verbes introducteurs de l'opinion (ex : Paul affirme que ce 
restaurant est bon.). 
</p>
<p> Les op&#233;rateurs de n&#233;gation : cet op&#233;rateur peut avoir une port&#233;e locale (ex : Ce restaurant 
n'est pas bon.), ou globale (ex : Il est impossible, m&#234;me en tenant compte des 
</p>
<p>points &#233;voqu&#233;s ci-dessus, de qualifier ce restaurant de bon.). 
</p>
<p> Les op&#233;rateurs de modalit&#233; : (ex : Il est possible que ce restaurant soit bon.), 
</p>
<p> Les op&#233;rateurs d'intensit&#233; (ex : Ce restaurant est tr&#232;s bon.). 
</p>
<p>U est l'ensemble des segments de discours contenant une expression d'opinion, ou &#233;tant reli&#233; &#224; un 
</p>
<p>&#233;l&#233;ment de U par une relation r R (cf. Asher et al., 2009, pour la d&#233;finition d&#8217;un segment de discours). 
</p>
<p>R est un sous-ensemble des relations discursives de la SDRT, &#224; savoir les relations {Rcontinuation Rcontraste 
</p>
<p>Rattribution Rcondition Rr&#233;sultat Rsupport} (cf. Asher et al, 2009, pour la d&#233;finition de ces relations). 
</p>
<p>2.3 Corpus utilis&#233;s et accords inter annotateurs 
</p>
<p>Le corpus principal annot&#233; est constitu&#233; de commentaires sur des restaurants ou bars d&#233;pos&#233;s en ligne sur 
</p>
<p>le site http://www.qype.fr/. Ces commentaires sont libres, de temps &#224; autre hors sujet, et contiennent 
</p>
<p>parfois de multiples fautes d&#8217;orthographe. Afin de ne pas influencer l'annotateur, le corpus pr&#233;sent&#233; ne 
contenait que le texte du commentaire, et aucune des informations annexes disponibles en ligne. 
</p>
<p>L'annotation a &#233;t&#233; effectu&#233;e par deux annotateurs familiers du domaine, sous l'environnement Glozz 
</p>
<p>(http://www.glozz.org/). Le corpus &#233;tait constitu&#233; de 40 documents (commentaires) a priori plut&#244;t 
</p>
<p>positifs et de  20 documents plut&#244;t n&#233;gatifs. Chaque commentaire est constitu&#233; en moyenne d'environ 3 
</p>
<p>phrases / 70 mots. Un manuel d'annotation a &#233;t&#233; fourni aux annotateurs afin de les guider dans la t&#226;che. 
</p>
<p>Apr&#232;s une premi&#232;re annotation de 10 documents, un retour a &#233;t&#233; effectu&#233; sur le manuel afin de pr&#233;ciser et 
</p>
<p>corriger certains points ambigus. L'annotation des &#233;l&#233;ments discursifs a &#233;t&#233; laiss&#233;e en suspens pour le 
</p>
<p>moment. 
</p>
<p>&#192; titre d'exemple, un de nos annotateurs propose l&#8217;annotation suivante de la phrase &quot;La viande est de tr&#232;s 
bonne qualit&#233;, le service &#233;galement avec des serveurs anglophones.&quot; : 
</p>
<p>La &lt;Sujet id=1 type=&quot;part of&quot;&gt;viande&lt;/Sujet&gt; est de &lt;Operateur id=2 type=&quot;intensite&quot; 
</p>
<p>valeur=&quot;+&quot;&gt;tr&#232;s&lt;/Operateur&gt; &lt;ExpressionOpinion id=3 categorie=&quot;explicite&quot; valence=&quot;+2&quot;&gt;bonne 
</p>
<p>qualit&#233;&lt;/ExpressionOpinion&gt;, le &lt;Sujet id=4 type=&quot;part of&quot;&gt;service&lt;/Sujet&gt; &lt;ExpressionOpinion id=5 
</p>
<p>categorie=&quot;explicite&quot; valence=&quot;+2&quot;&gt;&#233;galement&lt;/ExpressionOpinion&gt; avec des serveurs anglophones. 
</p>
<p>Les accords inter annotateurs pr&#233;sent&#233;s ici prennent en compte, pour le moment, la lexicalisation des 
</p>
<p>expressions d'opinion (correspondance des bornes de l'annotation), leur polarit&#233; et leur cat&#233;gorie. Le 
</p>
<p>calcul d'accord s'est fait de mani&#232;re souple : les deux annotateurs sont consid&#233;r&#233;s comme en accord sur 
</p>
<p>une annotation s'il y a chevauchement entre deux annotations. Les valeurs ont &#233;t&#233; calcul&#233;es de la m&#234;me 
</p>
<p>mani&#232;re que (Wiebe et al., 2005) l'ont effectu&#233; pour MPQA, l'accord agr(A||B) indiquant la proportion 
</p>
<p>d'annotations relev&#233;es par l'annotateur A &#233;galement relev&#233;es par l'annotateur B.
1
 
</p>
<p>                                                 
1
  agr(A||B) = |{annotations(A) en accord avec annotations(B)}| / |{annotations(A)}|. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CATEGORISATION AUTOMATIQUE D'ADJECTIFS D'OPINION A PARTIR D'UNE RESSOURCE LING. GENERIQUE 
</p>
<p> Agr(A||B) Agr(B||A) moyenne 
</p>
<p>Expressions d'opinion (OW) 86% 75% 80% 
</p>
<p>OW : explicites + polarit&#233; 77% 69% 73% 
</p>
<p>OW : implicites 23% 20% 21% 
</p>
<p>Figure 1 : Accords inter annotateurs obtenus 
</p>
<p>Les r&#233;sultats observ&#233;s pour les annotations d'expressions implicites montrent un d&#233;saccord entre les 
</p>
<p>annotateurs. En effet ce qui est un simple fait pour un annotateur peut &#234;tre interpr&#233;t&#233; diff&#233;remment pour 
</p>
<p>un autre. Par exemple, pour le syntagme &quot;ambiance rock'n'roll&quot;, rock'n'roll a &#233;t&#233; consid&#233;r&#233; soit 
</p>
<p>comme expression d'opinion implicite positive (&#233;quivalente &#224; &quot;bonne ambiance&quot;), soit comme simple 
</p>
<p>fait (simple &#233;vocation du type de musique diffus&#233;e dans le bar). Ces annotations nous informent en fait 
</p>
<p>beaucoup plus sur ce que per&#231;oit l'annotateur, en fonction de ses centres d'int&#233;r&#234;ts, que sur ce que 
</p>
<p>souhaitait exprimer le locuteur. &#192; la suite de cette annotation, une version &quot;gold standard&quot; de 
</p>
<p>l'annotation a &#233;t&#233; produite reprenant les annotations sur lesquelles les annotateurs sont tomb&#233;s d'accord. 
</p>
<p>Pour la suite de nos travaux, nous nous sommes donc concentr&#233;s sur les expressions d'opinion explicites, 
</p>
<p>qui semblent effectivement rep&#233;rables avec pr&#233;cision par un &#234;tre humain. 
</p>
<p>3 Extension de lexique 
</p>
<p>L'objectif de la mise en place de ce mod&#232;le d'annotation est l'extraction d'opinions pour le calcul de 
</p>
<p>l'opinion g&#233;n&#233;rale &#224; l'&#233;chelle d'une phrase et d'un document dans des corpus issus de domaine vari&#233;s. 
</p>
<p>Pour mettre en &#339;uvre ce processus, il nous faut constituer une ressource lexicale. Pour ce faire, nous 
proposons, dans un premier temps, de constituer une ressource pour les adjectifs &#224; partir d'une 
</p>
<p>classification g&#233;n&#233;rique des mots du fran&#231;ais. 
</p>
<p>3.1 Principales m&#233;thodes d'&#233;laboration de ressources lexicales 
</p>
<p>Pour &#233;tendre un lexique, deux principales cat&#233;gories de m&#233;thodes sont utilis&#233;es dans la litt&#233;rature. Les 
</p>
<p>premi&#232;res sont des m&#233;thodes &#224; base de corpus qui n'utilisent que les informations pr&#233;sentes dans le 
</p>
<p>corpus, annot&#233; ou non, pour classer les mots. De ce fait, ces m&#233;thodes requi&#232;rent g&#233;n&#233;ralement un corpus 
</p>
<p>assez important. (Hatzivassiloglou et McKeown, 1997) ont utilis&#233; les conjonctions pour &#233;tendre leur 
</p>
<p>lexique, partant de la supposition que deux adjectifs en conjonction (par exemple, reli&#233;s par un &quot;et&quot;) ont 
</p>
<p>une polarit&#233; similaire, et que deux mots en contraste conjonction (par exemple, reli&#233;s par un &quot;mais&quot;) ont 
</p>
<p>une polarit&#233; oppos&#233;e. Turney et Littman ont propos&#233; en 2002 et 2003 deux scores calculant la polarit&#233; 
</p>
<p>d'un terme : le SO-PMI (Semantic Oriented Pointwise Mutual Information) bas&#233; sur les cooccurrences 
</p>
<p>du mot avec un lexique germe polaris&#233;, et la LSA (Latent Semantic Analysis), calculant la proximit&#233; des 
</p>
<p>contextes d'utilisation de deux mots. Pour le fran&#231;ais, Harb et al. (2008) ont utilis&#233; les corr&#233;lations entre 
</p>
<p>adjectifs et mots germes pour constituer une liste d'adjectifs d'opinion polaris&#233;s. 
</p>
<p>Les secondes m&#233;thodes, dites &#224; base de dictionnaire, consistent &#224; augmenter un lexique via des liens 
</p>
<p>s&#233;mantiques et/ou syntaxiques, retrouv&#233;s dans des ressources linguistiques externes. (Kamps et al., 2004) 
</p>
<p>ont utilis&#233; la relation de synonymie de WordNet pour calculer une distance entre adjectifs. La distance 
</p>
<p>relative avec les mots germes good et bad a permis la classification d'adjectifs entre positif et n&#233;gatif. 
</p>
<p>(Kim et Hovy, 2005) ont quant &#224; eux directement &#233;tendu leurs lexiques &#224; partir des synonymes et 
</p>
<p>antonymes de ces mots germes. (Esuli et Sebastiani, 2006) ont am&#233;lior&#233; ces m&#233;thodes en effectuant au 
</p>
<p>pr&#233;alable une d&#233;sambigu&#239;sation syntaxique. Les phrases de description des synsets de WordNet ont </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAPTISTE CHARDON 
</p>
<p>&#233;galement permis de classer ces derniers entre positif, n&#233;gatif, et neutre, soit en testant la pr&#233;sence de 
</p>
<p>mots germes dans les description (Andreevskaia et Bergler, 2006), soit en comparant les descriptions 
</p>
<p>entre elles (Esuli et Sebastiani, 2006). Enfin, (Chesley et al., 2006) ont class&#233; les adjectifs suivant le 
</p>
<p>nombre d'occurrences de mots germes dans leur page de description du Wiktionnary. 
</p>
<p>Pour le fran&#231;ais, peu d'&#233;tudes &#224; base de dictionnaire ont &#233;t&#233; men&#233;es &#224; notre connaissance. Disposant 
</p>
<p>d'une ressource linguistique fine pour le fran&#231;ais, nous avons souhait&#233; tester ce type d'approche. 
</p>
<p>3.2 Ressource utilis&#233;e : Taxinomie des concepts Synapse D&#233;veloppement 
</p>
<p>Pour &#233;laborer notre ressource lexicale sur les adjectifs d'opinion, nous avons utilis&#233; une ressource 
</p>
<p>lexicale g&#233;n&#233;rique. Celle-ci propose pour 158 320 syntagmes (divis&#233;s en 174 810 sens) un ou plusieurs 
</p>
<p>liens vers une taxinomie de concepts structur&#233;e hi&#233;rarchiquement sur quatre niveaux. 
</p>
<p> 
Figure 2 : Exemple de repr&#233;sentation des 2 sens de l'adjectif &quot;cher&quot;. 
</p>
<p>L'adjectif &quot;cher&quot; est ici mod&#233;lis&#233; comme ayant 2 sens. Le sens 1 est d&#233;fini par un lien vers un concept 
</p>
<p>(65.5/amour/couple). Cette taxinomie se rapproche des synsets de WordNet, &#224; la diff&#233;rence qu'ici le 
</p>
<p>nombre de cat&#233;gories conceptuelles est born&#233; (3387 cat&#233;gories au niveau 4, 256 au niveau 3), et que les 
</p>
<p>mots sont d&#233;finis par sens et non par classes de regroupements. 
</p>
<p>Nous avons donc &#233;tiquet&#233; tous les corpus avec l'analyseur syntaxique de Synapse D&#233;veloppement 
</p>
<p>(Laurent et al., 2009). &#192; chaque mot est associ&#233; son lemme, sa cat&#233;gorie syntaxique et le(s) num&#233;ro(s) de 
</p>
<p>sens reconnu(s) lors de la d&#233;sambigu&#239;sation s&#233;mantique locale. Par extension, un ensemble de cat&#233;gories 
</p>
<p>conceptuelles de niveau 4 est donc associ&#233; &#224; chaque mot. Nous avons observ&#233; que les cat&#233;gories o&#249; l'on 
</p>
<p>trouve des adjectifs d'opinion rassemblent des mots de sens proches et de m&#234;me polarit&#233;. Elles 
</p>
<p>regroupent cependant des mots d'intensit&#233; diff&#233;rentes. L'intensit&#233; des adjectifs d'opinion n'a donc pas &#233;t&#233; 
</p>
<p>prise en compte lors de l'extension du lexique pr&#233;sent&#233;e ci-apr&#232;s. 
</p>
<p>3.3 Algorithme d'extension du lexique 
</p>
<p>3.3.1 Constitution du lexique &#233;tendu 
</p>
<p>&#192; partir d'un petit nombre de documents annot&#233;s manuellement, on extrait une liste lemmatis&#233;e 
</p>
<p>d'adjectifs germes d'opinion et leur polarit&#233; (positif/n&#233;gatif). Cette &#233;tape est critique, au sens o&#249; un 
</p>
<p>ensemble de mots germes trop restreint ou d&#233;s&#233;quilibr&#233; nuira aux r&#233;sultats. 
</p>
<p>Initialisation : On cr&#233;e ensuite un graphe sans ar&#234;tes dont les sommets sont les concepts de niveau 4 de 
</p>
<p>la taxinomie. Pour chacun des mots du lexique germe extrait, on ajoute un sommet au graphe, auquel on 
</p>
<p>associe la polarit&#233; p du mot. Si &#224; ce mot sont associ&#233;s un ou plusieurs concepts, on relie ce nouveau </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CATEGORISATION AUTOMATIQUE D'ADJECTIFS D'OPINION A PARTIR D'UNE RESSOURCE LING. GENERIQUE 
</p>
<p>sommet aux sommets associ&#233;s &#224; ces concepts. On obtient ainsi un graphe bipartite reliant les n&#339;uds de 
type &quot;taxinomie&quot; via les n&#339;uds de type &quot;mot&quot;, que l'on peut nettoyer en supprimant les n&#339;uds esseul&#233;s. 
</p>
<p>Simplification : L'objectif est de construire un arbre de d&#233;cision &#224; partir des cat&#233;gories de taxinomie des 
</p>
<p>adjectifs. Plus formellement, on souhaite affecter &#224; chaque n&#339;ud &quot;taxinomie&quot; une polarit&#233; et une hauteur 
dans l'arbre telles que : 
</p>
<p> 
</p>
<p> 
</p>
<p>hauteur(t) est donc ici l'inverse de la priorit&#233; avec laquelle la cat&#233;gorie est prise en compte : plus celle-ci 
</p>
<p>est &#233;lev&#233;e, moins la cat&#233;gorie est consid&#233;r&#233;e comme discriminante pour d&#233;terminer la polarit&#233;. 
</p>
<p>Le graphe obtenu &#224; l'&#233;tape d'initialisation se rapproche d'un graphe de CSP (Constraint Satisfaction 
</p>
<p>Problem), o&#249; les n&#339;uds &quot;mots&quot; seraient les contraintes &#224; satisfaire. On applique donc un algorithme de 
r&#233;solution assez proche de la coh&#233;rence d'arcs. &#192; chaque &#233;tape h, on affecte &#224; tous les n&#339;uds &quot;taxinomie&quot; 
coh&#233;rents, c'est-&#224;-dire reli&#233;s uniquement &#224; des mots de m&#234;me polarit&#233; p, la hauteur h et la polarit&#233; p. On 
</p>
<p>&#233;limine ensuite tous les n&#339;uds affect&#233;s, c'est-&#224;-dire les n&#339;uds &quot;taxinomie&quot; dont la valeur est connue, et 
les n&#339;uds &quot;mots&quot; reli&#233;s &#224; un n&#339;ud &quot;taxinomie&quot; affect&#233;. Dans l'&#233;ventualit&#233; o&#249; aucun n&#339;ud ne serait 
affect&#233;, on affecte un n&#339;ud quelconque &#224; une polarit&#233; arbitraire (dans l'id&#233;al minimisant le nombre de 
n&#339;uds &quot;mots&quot; mal affect&#233;s) et &#224; la hauteur h. 
</p>
<p>Construction de l'arbre de d&#233;cision / classifieur du lexique : On obtient ainsi une liste de n&#339;uds 
correspondant aux cat&#233;gories de la taxinomie, chacun poss&#233;dant une hauteur h et une polarit&#233; p. En 
</p>
<p>associant &#224; chaque n&#339;ud une branche de hauteur h menant sur une d&#233;cision d'affectation de la valeur p, 
on obtient un arbre de d&#233;cision permettant de classer les mots de la cat&#233;gorie. Cet arbre de d&#233;cision 
</p>
<p>permet de g&#233;n&#233;rer un lexique visualisable en projetant les d&#233;cisions sur tous les termes r&#233;pertori&#233;s dans 
</p>
<p>la cat&#233;gorie. En pratique, l'arbre seul suffit pour d&#233;terminer la polarit&#233; des adjectifs consid&#233;r&#233;s.  
</p>
<p>La figure 3 pr&#233;sente un exemple de r&#233;solution de graphe poss&#233;dant une ambigu&#239;t&#233; sur la cat&#233;gorie 12.5 
</p>
<p>(reli&#233;e &#224; un mot positif et un mot n&#233;gatif) : on ne peut r&#233;soudre ce conflit et affecter une polarit&#233; &#224; la 
</p>
<p>cat&#233;gorie qu'&#224; l'&#233;tape 2, aussi cette cat&#233;gorie se retrouve-t-elle dans une branche de l'arbre de hauteur 2. 
</p>
<p>                                   
</p>
<p>Figure 3 : Exemple de graphe simple et d'arbre de d&#233;cision associ&#233;. Les &#233;tiquettes des branches de l'arbre 
</p>
<p>s'interpr&#232;tent comme : &quot;si le terme rencontr&#233; appartient &#224; la cat&#233;gorie &#8230;&quot;. 
</p>
<p>3.3.2 Renforcement du lexique 
</p>
<p>Afin de permettre une extension plus importante du lexique dans le cas o&#249; peu de mots germes seraient 
</p>
<p>utilis&#233;s (c'est-&#224;-dire si peu de textes annot&#233;s sont disponibles), nous avons rajout&#233; une phase optionnelle </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAPTISTE CHARDON 
</p>
<p>dite de renforcement du lexique. Deux cat&#233;gories de la taxinomie sont jug&#233;es &quot;proches&quot; si elles 
</p>
<p>comportent au moins un mot d&#233;sambigu&#239;s&#233; en commun. Par exemple, sur la figure 2, prix/chert&#233; est 
</p>
<p>proche de commerce/transaction. &#192; l'aide de cette relation de proximit&#233;, on peut r&#233;percuter la polarit&#233; 
</p>
<p>des cat&#233;gories positives ou n&#233;gatives aux cat&#233;gories proches, si cela n'engendre pas de conflit. 
</p>
<p>Afin de pallier au risque de faux positifs, nous avons extrait, en m&#234;me temps que les mots germes, une 
</p>
<p>liste d'adjectifs n'&#233;tant pas des adjectifs d'opinion. Ceci a permis de constituer une liste d'arr&#234;t de 
</p>
<p>cat&#233;gories &#224; travers lesquelles le lexique n'est pas &#233;tendu. 
</p>
<p>Nous nous sommes limit&#233; &#224; une seule it&#233;ration de cette m&#233;thode. Plus d'it&#233;rations induisaient une 
</p>
<p>propagation de polarit&#233; &#224; un nombre tr&#232;s &#233;lev&#233; de cat&#233;gories, ce qui se serait traduit par une chute en 
</p>
<p>terme de pr&#233;cision non compens&#233;e par un gain substantiel en rappel. 
</p>
<p>4 &#201;valuations 
</p>
<p>Les &#233;valuations se sont d&#233;roul&#233;es en trois temps. Tout d'abord, la couverture du lexique g&#233;n&#233;r&#233;, ensuite, 
</p>
<p>l&#8217;&#233;valuation de sa g&#233;n&#233;ricit&#233; et enfin, son utilisabilit&#233; pour une t&#226;che extrins&#232;que ont &#233;t&#233; successivement 
trait&#233;es. 
</p>
<p>4.1 Couverture du lexique 
</p>
<p>Le corpus de critiques de restaurants et bars manuellement annot&#233; suivant le sch&#233;ma pr&#233;sent&#233; en section 
</p>
<p>2 a &#233;t&#233; utilis&#233; pour cette &#233;valuation. Ce corpus a &#233;t&#233; s&#233;par&#233; en deux groupes : un corpus d'entra&#238;nement 
</p>
<p>constitu&#233; de 5 commentaires positifs et 5 n&#233;gatifs, choisis pr&#233;alablement pour leurs polarit&#233;s tranch&#233;es, 
</p>
<p>et un corpus de test, constitu&#233; des 50 commentaires restants. La liste de mots germes &#233;tait constitu&#233;es de 
</p>
<p>15 mots positifs, et de 11 n&#233;gatifs. En comparant les adjectifs reconnus avec ceux annot&#233;s 
</p>
<p>manuellement, nous obtenons les r&#233;sultats suivants : 
</p>
<p> Rappel Pr&#233;cision F-mesure 
</p>
<p>Sans renforcement 39% 74% 51% 
</p>
<p>Avec renforcement 66% 53% 59% 
</p>
<p>Figure 4 : Couverture du lexique par rapport au lexique gold 
</p>
<p>Avant renforcement, 62% des mots reconnus n'existaient pas dans le lexique germe. Les r&#233;sultats sans 
</p>
<p>renforcement du lexique montrent une couverture relativement faible. En effet, les cat&#233;gories &#233;tant assez 
</p>
<p>fines, certains traits s&#233;mantiques approchants sont divis&#233;s en plusieurs cat&#233;gories ; par exemple, les 
</p>
<p>cat&#233;gories &quot;beaut&#233;&quot; et &quot;beaut&#233; humaine&quot; sont distinctes. Par cons&#233;quent, des mots proches peuvent ne 
</p>
<p>pas &#234;tre reconnus comme tel. La phase de renforcement du lexique permet de corriger ce d&#233;faut : les 
</p>
<p>deux cat&#233;gories pr&#233;c&#233;dentes poss&#232;dent au moins un terme en commun (&quot;joli&quot;), et le caract&#232;re positif des 
</p>
<p>adjectifs de l'une peut donc se propager &#224; l'autre. 
</p>
<p>La pr&#233;cision est assez bonne dans le premier cas. Les faux positifs relev&#233;s avant renforcement du lexique 
</p>
<p>sont principalement dus &#224; deux ph&#233;nom&#232;nes. Certains adjectifs sont ambigus hors contexte. Par exemple, 
</p>
<p>&quot;digne&quot; utilis&#233; seul est positif (&quot;les tapas sont dignes&quot;), mais utilis&#233; dans l'expression &quot;digne de X&quot;, 
</p>
<p>sa polarit&#233; d&#233;pend de celle de X (&quot;Le poulet est digne d'un mauvais fast-food.&quot;). D'autre part, 
</p>
<p>certains adjectifs peuvent &#234;tre employ&#233;s, suivant le contexte, comme op&#233;rateurs d'intensit&#233; ou comme 
</p>
<p>expressions d'opinion (&quot;un super resto&quot; vs. &quot;un resto super bon&quot;, dans le second exemple, super 
</p>
<p>est un op&#233;rateur intensifiant l'expression positive &quot;bon&quot;). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CATEGORISATION AUTOMATIQUE D'ADJECTIFS D'OPINION A PARTIR D'UNE RESSOURCE LING. GENERIQUE 
</p>
<p>4.2 G&#233;n&#233;ricit&#233; du lexique 
</p>
<p>Le lexique ainsi obtenu a &#233;t&#233; g&#233;n&#233;r&#233; &#224; partir de mots germes issus d'un corpus sp&#233;cialis&#233;, et &#233;tendu via 
</p>
<p>une ressource g&#233;n&#233;rique, ind&#233;pendante de tout domaine. On peut donc se demander dans quelle mesure 
</p>
<p>ce lexique est pertinent sur de nouveaux domaines sp&#233;cialis&#233;s. Pour cela, dix commentaires issus d'un 
</p>
<p>domaine diff&#233;rent ont &#233;t&#233; annot&#233;s afin de g&#233;n&#233;rer un second jeu de mots germes. Il s'agit de 
</p>
<p>commentaires d'internautes d&#233;pos&#233;s sur le site http://www.allocine.fr/, de taille similaire &#224; ceux de Qype. 
</p>
<p>Nous avons g&#233;n&#233;r&#233; un second lexique &#224; partir de ces mots germes, et compar&#233; ce nouveau lexique &#224; celui 
</p>
<p>g&#233;n&#233;r&#233; &#224; la section pr&#233;c&#233;dente. 
</p>
<p>Les deux lexiques se sont av&#233;r&#233;s assez diff&#233;rents. En effet, le lexique des films comportait beaucoup plus 
</p>
<p>de termes d'&#233;motions fortes positives (&quot;poignant&quot;) tandis que l'autre comportait des termes du registre 
</p>
<p>culinaire (&quot;d&#233;licieux&quot;) et des adjectifs n&#233;gatifs de prix (&quot;cher&quot;, &quot;&#233;lev&#233;&quot;). Statistiquement, ceci s'est traduit 
</p>
<p>par une chute de moiti&#233; du rappel lors de l'annotation d'un texte du corpus de restaurants avec ce lexique, 
</p>
<p>la plupart des termes du lexique germe menant sur des cat&#233;gories quasi absentes du corpus trait&#233;. Ceci 
</p>
<p>montre que le lexique g&#233;n&#233;r&#233; est plut&#244;t sp&#233;cifique au corpus, les cat&#233;gories identifi&#233;es comme positives 
</p>
<p>ou n&#233;gatives d&#233;pendant des mots germes identifi&#233;s. 
</p>
<p>4.3 Utilisabilit&#233; du lexique 
</p>
<p>Les commentaires du corpus de restaurants sont associ&#233;s &#224; des &#233;toiles (1 &#224; 5). On peut par cons&#233;quent 
</p>
<p>inf&#233;rer la polarit&#233; que souhaitait exprimer le r&#233;dacteur &#224; partir de celles-ci : positive (4 ou 5 &#233;toiles), 
</p>
<p>n&#233;gative (1 ou 2 &#233;toiles), mitig&#233;e (3 &#233;toiles). Nous avons tent&#233; de retrouver cette polarit&#233; pour les 
</p>
<p>documents de test, en comptant simplement les adjectifs d&#8217;opinion : une majorit&#233; de positifs (resp. 
n&#233;gatifs) signifiant un commentaire positif (resp. n&#233;gatif), et une absence de majorit&#233; un commentaire 
</p>
<p>neutre. Nous avons test&#233; la difficult&#233; de la t&#226;che en calculant les scores obtenus avec la liste de mots 
</p>
<p>germes seule, ainsi qu'avec la liste compl&#232;te des adjectifs annot&#233;s pour obtenir un score maximal 
</p>
<p>atteignable de 83%. 
</p>
<p> Proportion de polarit&#233; reconnue 
</p>
<p>Mots germes 45% 
</p>
<p>Liste &#233;tendue sans renforcement 65% 
</p>
<p>74% 
</p>
<p>51% 
</p>
<p>Liste compl&#232;te des adjectifs annot&#233;s 83% 
</p>
<p>53% 
</p>
<p>59% 
</p>
<p>Figure 5 : Proportion de polarit&#233; de documents reconnus 
</p>
<p>Les r&#233;sultats montrent une am&#233;lioration de 20% de bonne classification avec l'extension du lexique. &#192; 
</p>
<p>noter que le r&#233;sultat maximal atteignable en consid&#233;rant uniquement les adjectifs est relativement loin de 
</p>
<p>100%. Ceci est principalement d&#251; &#224; deux facteurs. Tout d'abord, certains internautes se servent du 
</p>
<p>commentaire uniquement pour compl&#233;ter l'opinion v&#233;hicul&#233;e par les &#233;toiles. De plus, notre algorithme de 
</p>
<p>classification ne prend en compte ni les n&#233;gations, ni le fait que le sujet de certains adjectifs d'opinion est 
</p>
<p>hors sujet par rapport au restaurant jug&#233;. 
</p>
<p>5 Conclusion et perspectives 
</p>
<p>Afin de mettre en place une extraction automatique d'opinions, nous avons propos&#233; un sch&#233;ma 
</p>
<p>d'annotation fin des expressions d'opinion, et une m&#233;thode pour &#233;laborer une ressource lexicale 
</p>
<p>d'adjectifs d'opinion &#224; partir de la taxinomie de concepts. Le mod&#232;le d'annotation propos&#233;, ind&#233;pendant 
</p>
<p>de la langue et du domaine, inclut tous les &#233;l&#233;ments qui nous ont parus intervenir dans le calcul de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAPTISTE CHARDON 
</p>
<p>l'opinion, aussi bien au niveau local (&#233;metteur, sujet, op&#233;rateurs) qu'au niveau du document (relations 
</p>
<p>discursives). L'algorithme d'extension de lexique propos&#233; repose sur une taxinomie fine des mots du 
</p>
<p>fran&#231;ais, une d&#233;sambigu&#239;sation s&#233;mantique et une lemmatisation effectu&#233;es par un analyseur syntaxique, 
</p>
<p>et un jeu de mots germes. &#201;valu&#233; en trois &#233;tapes, il pr&#233;sente une couverture assez faible, am&#233;liorable 
</p>
<p>dans une certaine mesure via une it&#233;ration d'extension par proximit&#233;, au d&#233;triment de la pr&#233;cision. Les 
</p>
<p>r&#233;sultats appellent cependant &#224; &#234;tre confirm&#233;s sur une plus grande quantit&#233; de donn&#233;es annot&#233;es. 
</p>
<p>Afin d'am&#233;liorer cet algorithme, l'utilisation d'un dictionnaire de synonymes et antonymes pond&#233;r&#233;s est 
</p>
<p>envisag&#233;e. Celui-ci pourrait venir en surcouche pour &#233;tendre la liste des adjectifs g&#233;n&#233;r&#233;s, ou en 
</p>
<p>pr&#233;traitement pour &#233;tendre la liste des mots germes. Il pourrait &#233;galement permettre d'introduire de 
</p>
<p>classifier automatiquement les adjectifs par intensit&#233;. Apr&#232;s les adjectifs, d'autres cat&#233;gories syntaxiques, 
</p>
<p>comme les noms et les verbes, seront trait&#233;es. Les liens entre cat&#233;gories syntaxiques (par exemple 
</p>
<p>d&#233;verbaux) seront &#233;galement envisag&#233;s suivant la m&#234;me approche. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>ANDREEVSKAIA A., BERGLER D., (2006). Mining WordNet for fuzzy sentiment: Sentiment tag extraction 
</p>
<p>from WordNet glosses. Actes de EACL 2006. 
</p>
<p>ASHER N., BENAMARA F., MATHIEU Y.Y. (2009). Apparaisal of Opinion Expressions in Discourse. 
</p>
<p>Lingvistic&#230; Investigationes, 32:2.  
</p>
<p>ASHER N., LASCARIDES A. (2003). Logics of Conversation. Cambridge University Press. 
</p>
<p>CHESLEY P., VINCENT B., XU L., SRIHARI R.K. (2006). Using verbs and adjectives to automatically 
</p>
<p>classify blog sentiment. Training 580. 
</p>
<p>ESULI A., SEBASTIANI F. (2006). Determining term subjectivity and term orientation for opinion mining. 
</p>
<p>Actes de EACL 2006, 193-200. 
</p>
<p>ESULI A., SEBASTIANI F. (2006). SentiWordNet: A publicly available lexical resource for opinion mining. 
</p>
<p>Actes de LREC 2006.  
</p>
<p>HARB A., DRAY G., PLANTIE M., PONCELET P., ROCHE M., TROUSSET F. (2008). Apprenons les bons 
</p>
<p>adjectifs!. Actes de Atelier FODOP 2008. 
</p>
<p>HATZIVASSILOGLOU V., MCKEOWN K.R. (1997). Predicting the semantic orientation of adjectives. Actes 
</p>
<p>de EACL 1997. 
</p>
<p>KAMPS J., MARX M., MOKKEN R.J., DE RIJKE M. (2004). Using WordNet to measure semantic orientation 
</p>
<p>of adjectives. Actes de LREC 2004, 1115-1118. 
</p>
<p>KIM S.-M., HOVY E. (2005). Automatic Detection of Opinion Bearing Words and Sentences. Proceedings 
</p>
<p>of IJCNLP 2005. 
</p>
<p>LAURENT D., NEGRE S., SEGUELA P. (2009). L'analyseur syntaxique Cordial dans Passage. TALN 2009. 
</p>
<p>MARTIN J.R., WHITE P.R.R. (2005). The Language of Evaluation: Appraisal in English. Basingstoke : 
</p>
<p>Palgrave Macmillan.  
</p>
<p>QUIRK R., GREENBAUM S., LEECH G., SVARTVIK J. (1985). A Comprehensive Grammar of the English 
</p>
<p>Language. Longman. 
</p>
<p>TURNEY P.D., LITTMAN M.L. (2002). Unsupervised learning of semantic orientation from a hundred-
</p>
<p>billion-word corpus. Arxiv preprint. 
</p>
<p>TURNEY P.D., LITTMAN M.L. (2003). Measuring praise and criticism: Inference of semantic orientation 
</p>
<p>from association. ACM Transactions on Information Systems 21, 315-346. 
</p>
<p>WIEBE J., WILSON T., CARDIE C. (2005). Annotating Expressions of Opinions and Emotions in Language. 
</p>
<p>Language Resources and Evaluation 39, 165-210. 
</p>
<p>WHITELAW C., GARG N., ARGAMON S. (2005). Using appraisal groups for sentiment analysis. Proc. of the 
</p>
<p>14th ACM international conference on Information and knowledge management, 625-631. </p>

</div></div>
</body></html>