<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Inf&#233;rences aspecto-temporelles analys&#233;es avec la Logique Combinatoire</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Inf&#233;rences aspecto-temporelles analys&#233;es avec la Logique Combinatoire 
</p>
<p>Hee-Jin RO1 
</p>
<p>(1) Laboratoire LaLIC (Langues, logiques, Informatique et Cognition), Universit&#233; 
Paris-Sorbonne, Maison de la Recherche, 28 rue Serpente, 75006 Paris   
</p>
<p>heejinro@yahoo.fr 
</p>
<p>R&#233;sum&#233; Ce travail s&#8217;inscrit dans une recherche centr&#233;e sur une approche de l&#8217;Intelligence Artificielle 
(IA) et de la linguistique computationnelle. Il permet d&#8217;int&#233;grer diff&#233;rentes techniques formelles de la 
Logique Combinatoire avec des types (Curry) et sa programmation fonctionnelle (Haskell) avec une 
th&#233;orie &#233;nonciative du temps et de l&#8217;aspect. Nous proposons des calculs formels de valeurs aspecto-
temporelles (processus inaccompli pr&#233;sent, processus inaccompli pass&#233;, &#233;v&#233;nement pass&#233; et &#233;tat-
r&#233;sultant pr&#233;sent) associ&#233;es &#224; des repr&#233;sentations de significations verbales sous forme de sch&#232;mes 
applicatifs. 
</p>
<p>Abstract This work is in line with the research centered on an approach of the Artificial Intelligence 
and the Computational linguistic. It allows integrating different formal technologies of the Combinatory 
Logic with types (Curry) and their functional programme (Haskell) with an enunciative theory of the 
tense and the aspect. We propose formal calculus of aspecto-temporal values (present unaccomplished 
process, past unaccomplished process, past event and present r&#233;sultative-state) associated with 
representations of verbal meanings in the form of applicative schemes.  
</p>
<p>Mots-cl&#233;s : Logique Combinatoire, R&#233;f&#233;rentiel &#233;nonciatif, Sch&#232;me s&#233;mantico-cognitif, Grammaire 
Applicative et Cognitive, Haskell  
Keywords: Combinatory Logic, Enunciative Frame of reference, Semantic-cognitive scheme, 
Applicative and Cognitive Grammar, Haskell 
</p>
<p>1 Introduction 
Le temps et l&#8217;aspect sont &#233;troitement li&#233;s dans une cat&#233;gorie grammaticale. Il est donc difficile de relever 
les marqueurs grammaticaux tels qu&#8217;ils soient uniquement temporels ou uniquement aspectuels. 
Cependant, selon Descl&#233;s (1990a), nous pouvons distinguer ces deux notions par commodit&#233; : d&#8217;une part 
l&#8217;aspect construit un proc&#232;s &#224; partir d&#8217;une relation pr&#233;dicative atemporelle ; d&#8217;autre part le temps renvoie 
plut&#244;t &#224; un rep&#233;rage du proc&#232;s par rapport &#224; l&#8217;&#233;nonciateur. Autrement dit, l&#8217;aspect renvoie &#224; une vis&#233;e de 
la relation pr&#233;dicative que se repr&#233;sente l&#8217;&#233;nonciateur, et le temps renvoie &#224; des relations qui situent le 
proc&#232;s soit dans le r&#233;f&#233;rentiel de l&#8217;&#233;nonciateur soit dans un autre syst&#232;me r&#233;f&#233;rentiel. Aucune langue n&#8217;a 
de marqueurs uniquement temporels ou uniquement aspectuels. Nous partons, donc, du principe qu&#8217;il 
n&#8217;existe pas de distinction nette entre les marqueurs grammaticaux aspectuels et les marqueurs 
grammaticaux temporels. Ce sont des valeurs aspecto-temporelles qui pr&#233;sentent &#224; la fois des 
caract&#233;ristiques aspectuelles et temporelles. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HEE-JIN RO 
Le cadre th&#233;orique dans lequel nous d&#233;veloppons nos analyses linguistiques est celui de la Grammaire 
Applicative et Cognitive (Descl&#233;s, 1990a ; Descl&#233;s et alii., 2010) - d&#233;sormais GA&amp;C. Ce mod&#232;le 
linguistico-computationnel est polystratal avec 7 niveaux de repr&#233;sentations, dont chaque niveau 
s&#8217;articule entre eux par des r&#244;les d&#8217;&#233;quivalences entre definiendum et definiens, pour des transformations 
de repr&#233;sentations.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1 : Sept niveau de l&#8217;architecture computationnelle de la GA&amp;C 
Ce mod&#232;le est analogue &#224; la compilation de programme et impl&#233;mentable sur des machines 
informatiques &#224; l&#8217;aide de langages de programmation fonctionnelle comme HASKELL, F#, Lisp, etc. 
Pour analyser certains ph&#233;nom&#232;nes aspecto-temporels et &#233;nonciatifs, ce mod&#232;le met en &#339;uvre des 
op&#233;rateurs aspecto-temporels qui portent sur une relation pr&#233;dicative propositionnelle donnant des 
valeurs aspectuelles (&#233;tat, &#233;v&#233;nement, processus, &#8230;), et des relations sur des intervalles topologiques 
(ouverts, ferm&#233;, &#8230;). Notre travail diff&#232;re de la DRT (Kamp et Reyle, 1993) qui traite aussi le temps et 
l&#8217;aspect; mais comme la DRT ne dispose pas d&#8217;op&#233;rateur topologique, il lui est difficile de repr&#233;senter la 
valeur de l&#8217;&#233;tat r&#233;sultant et du processus inaccompli. 
</p>
<p>Ce mod&#232;le fait appel &#224; un formalisme unique, la Logique Combinatoire (LC) de Curry (1958, 1972), ce 
qui am&#232;ne &#224; repr&#233;senter chaque &#233;nonc&#233; en une expression applicative o&#249; les op&#233;rateurs de diff&#233;rents 
types s&#8217;appliquent &#224; des op&#233;randes. La LC a &#233;t&#233; utilis&#233;e pour la premi&#232;re fois par Shaumyan (1987) pour 
d&#233;crire et analyser les ph&#233;nom&#232;nes linguistiques. Ce type d&#8217;approche s&#8217;est &#233;tendu au domaine de la 
s&#233;mantique cognitive dans la GA&amp;C. La caract&#233;ristique fondamentale de la LC est applicative : un 
op&#233;rateur s&#8217;applique &#224; un op&#233;rande pour fabriquer un r&#233;sultat. Les combinateurs sont des op&#233;rateurs 
abstraits qui s&#8217;appliquent &#224; des op&#233;randes pour les composer ou les transformer. Les expressions 
applicatives constituent des expressions combinatoires. Les combinateurs &#233;l&#233;mentaires se combinent 
entre eux et construisent des combinateurs plus complexes1. La signification de chaque combinateur est 
d&#233;finie par son action sous forme d&#8217;une &#946;&#8211;r&#233;duction (par des r&#232;gles d&#8217;introduction et d&#8217;&#233;limination). La 
&#946;&#8211;r&#233;duction v&#233;rifie la propri&#233;t&#233; de Church-Rosser, c&#8217;est-&#224;-dire la propri&#233;t&#233; de confluence : la forme 
                                                 
</p>
<p>1
  Les combinateurs d&#233;riv&#233;s (&#224; puissance et &#224; distance) sont d&#233;finis &#224; partir de ces combinateurs &#233;l&#233;mentaires qui &#233;tendent la 
</p>
<p>port&#233;e d&#8217;un combinateur ou agissent &#224; distance. (Curry, 1958, 1972) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INFERENCES ASPECTO-TEMPORELLES ANALYSEES AVEC LA LOGIQUE COMBINATOIRE 
r&#233;duite, si elle existe, est unique. Donnons quelques combinateurs avec leurs r&#232;gles d&#8217;action2 :   
   B (composition fonctionnelle) : B X Y Z &#8805;&#946; X (Y Z) 
</p>
<p> C (conversion des deux arguments d&#8217;un op&#233;rateur binaire) : C X Y Z &#8805;&#946; X Z Y 
</p>
<p>Notre analyse utilise les concepts de base de la th&#233;orie aspecto-temporelle d&#233;velopp&#233;e dans le courant 
europ&#233;en (Benveniste 1966, Comrie 1976, Culioli 1999, Descl&#233;s 1995, &#8230;). La distinction de base entre 
&#233;tat, &#233;v&#233;nement et processus (Descl&#233;s, 1990b) implique la prise en compte d&#8217;intervalles topologiques sur 
lesquels se r&#233;alise la relation pr&#233;dicative. Cette relation aspectualis&#233;e (sous la forme d&#8217;un &#233;tat r&#233;alis&#233; sur 
un intervalle ouvert, ou d&#8217;un &#233;v&#233;nement r&#233;alis&#233; sur un intervalle ferm&#233;, ou encore d&#8217;un processus r&#233;alis&#233; 
sur un intervalle ferm&#233; &#224; gauche et ouvert &#224; droite, car inaccompli) doit &#234;tre prise en charge par un 
&#233;nonciateur (&#8216;JE&#8217;) sous la forme d&#8217;un op&#233;rateur d&#8217;&#233;nonciation (ou op&#233;rateur de prise en charge) &#8216;JE-
DIS&#8217;, l&#8217;&#233;nonciation &#233;tant elle-m&#234;me un processus inaccompli r&#233;alis&#233; sur un intervalle &#8216;J0&#8217;, d&#8217;o&#249; 
l&#8217;op&#233;rateur aspectuel &#8216;PROCJ0&#8217; (processus r&#233;alis&#233; sur &#8216;J0&#8217;). Nous ferons appel aux repr&#233;sentations des 
significations lexicales sous forme de sch&#232;mes s&#233;mantico-cognitifs (d&#233;sormais SSC) qui sont organis&#233;s 
par des &#955;-expressions typ&#233;es. Un certain nombre de primitives cognitives g&#233;n&#233;rales utilis&#233;es dans la 
construction des sch&#232;mes (Descl&#233;s, 1990a) sont li&#233;es &#224; la perception (primitive relationnelle de 
mouvement &#8216;MOUVT&#8217;, primitive de rep&#233;rage &#8216;REP&#8217;, primitive d&#8217;accessibilit&#233; &#8216;ACCS&#8217;, &#8230;) et &#224; l&#8217;action 
(primitive d&#8217;effectuation &#8216;FAIRE&#8217;, primitive de contr&#244;le par un agent &#8216;CONTR&#8217;, primitive de vis&#233;e 
t&#233;l&#233;onomique &#8216;TELEO&#8217;). Dans cet article, nous allons montrer comment int&#233;grer dans une m&#234;me 
approche formelle : (i) les repr&#233;sentations aspecto-temporelles avec un calcul op&#233;rant sur les intervalles ; 
(ii) les repr&#233;sentations des significations lexicales en particulier verbales sous forme de SSC ; (iii) 
l&#8217;utilisation des op&#233;rateurs g&#233;n&#233;raux de la LC pour exprimer les repr&#233;sentations et les calculs effectu&#233;s. 
</p>
<p>2 Analyse formelle par repr&#233;sentation applicative 
Pour illustrer nos propos, partons des exemples suivants et de leurs formules de repr&#233;sentations 
m&#233;talinguistiques associ&#233;es que nous allons commenter: 
</p>
<p>(1) processus inaccompli actuel : [En ce moment,] Luc donne le livre &#224; Jean  
</p>
<p>(1&#8217;) PROCJ0 ((JE-DIS) (&amp; (PROCJ1 (donner T3 T2 T1)) ([&#948;(J1) = &#948;(J0)]))) 
</p>
<p>(2) processus inaccompli pass&#233; : Luc donnait le livre &#224; Jean [quand Marie est arriv&#233;e]  
</p>
<p>(2&#8217;) PROCJ0 ((JE-DIS) (&amp; (PROCJ1 (donner T3 T2 T1)) ([&#948;(J1) &lt; &#948;(J0)]))) 
</p>
<p>(3) &#233;v&#233;nement pass&#233; : Luc a donn&#233; le livre &#224; Jean  
</p>
<p>(3&#8217;) PROCJ0 ((JE-DIS) (&amp; (EVENF1 (donner T3 T2 T1)) ([&#948;(F1) &lt; &#948;(J0)]))) 
</p>
<p>(4) &#233;tat-r&#233;sultant : Luc a donn&#233; le livre &#224; Jean, [donc maintenant le livre est la possession de Jean]  
</p>
<p>                                                 
</p>
<p>2
  Un op&#233;rateur &#8216;X&#8217; qui s&#8217;applique &#224; un op&#233;rande &#8216;Y&#8217; construit un r&#233;sultat &#8216;Z&#8217;. Le programme de l&#8217;application de &#8216;X&#8217; &#224; &#8216;Y&#8217; 
</p>
<p>est not&#233; par une simple juxtaposition (non associative) qui pr&#233;fixe l&#8217;op&#233;rateur &#224; son op&#233;rande, d&#8217;o&#249; l&#8217;&#233;criture: &#8216;Z = X Y&#8217;. 
Pour simplifier les &#233;critures et en &#233;vitant ainsi des parenth&#232;ses superflues, nous posons : &#8216;X Y Z =d&#233;f (X Y) Z&#8217; ; il est alors 
clair que les deux expressions &#8216;X Y Z&#8217; et &#8216;X (Y Z)&#8217; ne sont pas &#233;quivalentes et ne signifient pas le m&#234;me programme 
applicatif. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HEE-JIN RO 
(4&#8217;) PROCJ0 ((JE-DIS) (&amp; (ETAT-RESULU1 (donner T3 T2 T1)) ([&#948;(U1) = &#948;(J0)]))) 
</p>
<p>Les jeux de coordonn&#233;es temporelles expriment des relations de concomitance (par exemple &#948;(J1) et 
&#948;(J0) sont les bornes droites ouvertes de &#8216;J1&#8217; et &#8216;J0&#8217;, [&#948;(J1) = &#948;(J0)])3 ou de non-concomitance (par 
exemple [&#948;(J1) &lt; &#948;(J0)]). Les repr&#233;sentations sont exprim&#233;es dans un langage applicatif ou fonctionnel o&#249; 
un op&#233;rateur &#8216;X&#8217; s&#8217;applique &#224; un op&#233;rande &#8216;Y&#8217; en notant cette application par &#8216;X Y&#8217;. A chaque exemple, 
nous associons un diagramme figuratif et formel et le nom de la valeur aspectuelle correspondante. 
</p>
<p>Tableau 1 : Diagrammes figuratifs et formels  
Les repr&#233;sentations figurales, sous forme de diagrammes expriment bien les relations temporelles entre 
les intervalles de r&#233;alisation des relations pr&#233;dicatives (processus inaccompli &#8216;J1&#8217; ou &#233;v&#233;nement &#8216;F1&#8217;) et 
l&#8217;intervalle de &#8216;J0&#8217; (processus &#233;nonciatif) de la prise en charge &#233;nonciative par l&#8217;&#233;nonciateur. L&#8217;intervalle 
&#8216;U1&#8217; dans l&#8217;&#233;nonc&#233; (4) est un intervalle de r&#233;alisation de valeur aspectuelle de l&#8217;&#233;tat-r&#233;sultant de 
l&#8217;&#233;v&#233;nement pass&#233; (r&#233;alis&#233; sur &#8216;F1&#8217;) ; &#8216;U1&#8217; est un intervalle ouvert qui est imm&#233;diatement contigu &#224; 
l&#8217;intervalle ferm&#233; &#8216;F1&#8217;; cet &#233;tat-r&#233;sultant r&#233;alis&#233; sur &#8216;U1&#8217; correspond &#224; l&#8217;&#233;tat acquis &#171; Luc a acquis une 
nouvelle propri&#233;t&#233; (avoir-donn&#233; le-livre &#224; Jean)&#187;, c&#8217;est-&#224;-dire que l&#8217;intervalle &#8216;U1&#8217; a sa borne droite qui 
co&#239;ncide avec la borne droite de &#8216;&#948;(J0)&#8217; [&#948;(U1)=&#948;(J0)] ; l&#8217;&#233;tat-r&#233;sultant est un &#171; pr&#233;sent &#187; (en anglais, 
present perfect) et non pas un pass&#233; (voir Benveniste 1966, Descl&#233;s et Guentch&#233;va 1995). 
La th&#233;orie repr&#233;sentative de Reichenbach (1947), reprise par plusieurs linguistes, op&#232;re avec des instants 
alors que notre approche op&#232;re avec des intervalles d&#8217;instants, ce qui permet de rendre compte des 
oppositions aspectuelles entre (i) les inaccomplis (&#233;tat ou processus) r&#233;alis&#233;s sur un intervalle ouvert ou 
semi-ouvert avec une borne droite ouverte (indiquant la non prise en compte d&#8217;un dernier instant de 
r&#233;alisation) et (ii) les &#233;v&#233;nements accomplis r&#233;alis&#233;s sur un intervalle ferm&#233; (pas n&#233;cessairement 
ponctuel) avec la prise en compte d&#8217;un dernier instant de r&#233;alisation. 
</p>
<p>                                                 
</p>
<p>3
  Nous noterons les bornes droite et gauche d&#8217;un intervalle quelconque &#8216;I&#8217; par respectivement &#8216;&#948;(I)&#8217; et &#8216;&#947;(I)&#8217;. Elles peuvent 
</p>
<p>&#234;tre ouvertes ou ferm&#233;es selon qu&#8217;elles n&#8217;appartiennent ou n&#8217;appartiennent pas &#224; l&#8217;intervalle &#8216;I&#8217;. 
</p>
<p>Diagrammes figuratifs de chaque &#233;nonc&#233;  Noms des valeurs aspectuelles  
</p>
<p> 
</p>
<p>Processus inaccompli actuel 
</p>
<p> 
</p>
<p> 
</p>
<p>Processus inaccompli translat&#233; 
</p>
<p>(ou processus inaccompli pass&#233;) 
</p>
<p> &#201;v&#233;nement pass&#233; 
(ou &#233;v&#233;nement accompli pass&#233;) 
</p>
<p> &#201;tat-r&#233;sultant 
(ou &#233;tat accompli pr&#233;sent) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INFERENCES ASPECTO-TEMPORELLES ANALYSEES AVEC LA LOGIQUE COMBINATOIRE 
2.1 Repr&#233;sentation de la signification du lexique verbal  
</p>
<p>La repr&#233;sentation de la signification de &#171; donner &#187; a &#233;t&#233; largement &#233;tudi&#233;e en science cognitive (par 
exemple, &#171; to give &#187; Langacker 1991, Pottier 2000), et dans le cas de la GA&amp;C, ce verbe a &#233;t&#233; analys&#233; en 
fran&#231;ais, en cor&#233;en et en russe (Son 2006, Ivanova-Tarasova 2009). La repr&#233;sentation de la signification 
relative &#224; notre exemple est donn&#233;e par la &#955;&#8211;expression applicative du SSC:  
</p>
<p>&#955;z. &#955;y. &#955;x. ( CONTR (FAIRE (MOUVTF12 (SIT1O1 [x,y,z]) (SIT2O2 [x,y,z])) x ) x )                                    
avec:   SIT1O1 [x,y,z] = ET (ACCS x y) (NOT (ACCS z y))  
</p>
<p>SIT2O2 [x,y,z] = ET (ACCS z y) (NOT (ACCS x y)) 
</p>
<p>L&#8217;expression au-dessus signifie (voir aussi la figure 2) : l&#8217;agent &#8216;x&#8217; exerce la capacit&#233; de mouvement 
d&#8217;une situation &#8216;SIT1O1&#8217; &#224; une autre situation &#8216;SIT2O2&#8217; ; ce mouvement est effectu&#233; et r&#233;alis&#233; pendant 
l&#8217;intervalle ferm&#233; &#8216;F12&#8217; des instants de l&#8217;&#233;v&#233;nement du mouvement (&#8216;MOUVTF12&#8217;) entre deux situations ; 
dans la premi&#232;re situation &#8216;SIT1O1&#8217;, l&#8217;entit&#233; &#8216;y&#8217; est accessible &#224; l&#8217;entit&#233; &#8216;x&#8217;(ACCS x y)4, et non pas &#224; 
l&#8217;entit&#233; &#8216;z&#8217; ; cette situation est r&#233;alis&#233;e (est vraie) durant l&#8217;intervalle de validation d&#8217;&#233;tat &#8216;O1&#8217; ; dans la 
deuxi&#232;me situation &#8216;SIT2O2&#8217;, l&#8217;entit&#233; &#8216;y&#8217; est accessible &#224; &#8216;z&#8217; mais cette fois, n&#8217;est pas accessible &#224; &#8216;x&#8217; ; 
cette situation correspond &#224; l&#8217;intervalle de validation d&#8217;un autre &#233;tat &#8216;O2&#8217;. Ainsi, le mouvement de 
l&#8217;accessibilit&#233; d&#8217;une entit&#233; &#8216;y&#8217; est effectu&#233; en passant d&#8217;une situation &#224; une autre, et tout ce passage n&#8217;est 
pas li&#233; &#224; l&#8217;&#233;nonciation. Le sch&#232;me d&#233;crit repr&#233;sente la signification du pr&#233;dicat &#171; donner &#187;5 hors de toute 
prise en charge par un &#233;nonciateur ; ce pr&#233;dicat &#233;tant &#233;v&#233;nementiel, nous pouvons poser6 :  
</p>
<p>donner A3 A2 A1 = (&#8707; intervalle F12) EVENF12 (donner A3 A2 A1) 
</p>
<p>Le probl&#232;me auquel nous sommes confront&#233;s est le suivant : Comment le sch&#232;me (sous forme de &#955;- 
expression) peut-il &#234;tre &#8220;r&#233;unitaris&#233;&#8221; en un pr&#233;dicat verbal avec trois places d&#8217;arguments ? En effet la 
pr&#233;dication verbale dans une langue n&#8217;op&#232;re pas avec le sch&#232;me mais avec les unit&#233;s linguistiques qui 
sont des pr&#233;dicats verbaux. La LC est convoqu&#233;e pour exprimer cette synth&#232;se int&#233;grative. Pour cela, 
nous partons du sch&#232;me et nous introduisons successivement un certain nombre de combinateurs de la 
LC de fa&#231;on &#224; d&#233;gager les places d&#8217;arguments et &#224; faire appara&#238;tre un op&#233;rateur fonctionnel, une certaine 
composition entre &#8216;X&#8217;, qui compose entre elles les primitives en un tout int&#233;gr&#233;. Nous ne donnons pas, 
ici, la forme exacte de &#8216;X&#8217; (car cela exigerait des d&#233;veloppements techniques de la LC).   
</p>
<p>2.2 Prise en charge d&#8217;une pr&#233;dication verbale  
</p>
<p>Il s&#8217;agit maintenant de montrer comment la relation pr&#233;dicative (donner A3 A2 A1) peut &#234;tre prise en 
charge par un processus &#233;nonciatif r&#233;alis&#233; sur &#8216;J0&#8217;. Peut-on exprimer cela &#224; l&#8217;aide d&#8217;un calcul formel 
faisant appara&#238;tre l&#8217;analyse s&#233;mantique des marqueurs morphologiques (marqueurs de temps au sens de 
&#171; tense &#187;) dans une d&#233;marche &#171; top-down &#187; (c&#8217;est-&#224;-dire descendante) ? L&#224; encore, la LC nous permet de 
                                                 
</p>
<p>4
  ACCS est un domaine des entit&#233;s accessibles &#224; une autre entit&#233;. &#8216;ACCS x y&#8217; : c&#8217;est le domaine des entit&#233;s &#8216;y&#8217; qui sont 
</p>
<p>accessibles &#224; l&#8217;entit&#233; &#8216;x&#8217;. 
</p>
<p>5
  Nous ne pr&#233;cisons pas, ici, les types fonctionnels des primitives MOUVT, CONTR, FAIRE, etc. et les types des 
</p>
<p>arguments (ici, &#8216;x&#8217;, &#8216;y&#8217;, et &#8216;z&#8217; ont le m&#234;me type de &#8216;J&#8217;, entit&#233; individuelle). 
6
  Pour simplifier les &#233;critures, introduisons le symbole &#8216;A&#8217;
</p>
<p> 
</p>
<p>qui d&#233;signe les termes nominaux (ou les actants) ; &#8216;A3&#8217;, &#8216;A2&#8217; et 
&#8216;A1&#8217; associ&#233;s aux trois syntagmes nominaux respectifs &#8220;le-livre &#8221;, &#8220;Jean&#8221; et &#8220;Luc&#8221;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HEE-JIN RO 
r&#233;aliser ces calculs sous forme d&#8217;une d&#233;duction formelle qui introduit successivement des combinateurs. 
Avec l&#8217;analyse de la signification du pr&#233;dicat &#171; donner &#187; par son sch&#232;me associ&#233; et suivant l&#8217;analyse 
d&#8217;op&#233;ration &#233;l&#233;mentaire d&#8217;insertion dans le r&#233;f&#233;rentiel &#233;nonciatif, nous sommes capables d&#8217;expliquer 
l&#8217;inf&#233;rence : Luc a donn&#233; le livre &#224; Jean &#8594; Maintenant, Jean a le livre et Luc n&#8217;a plus de livre 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>En &#233;non&#231;ant l&#8217;&#233;v&#233;nement &#171; Luc a donn&#233; le livre &#224; Jean &#187; nous effectuons les relations temporelles : [F1 
= F12] et [&#948;(F1) &lt; &#948;(J0)] ; l&#8217;&#233;tat-r&#233;sultant pr&#233;sent &#171; [Maintenant] Jean a le livre &#187; et le r&#233;sultatif &#171; Luc n&#8217;a 
plus de livre &#187; engendr&#233;s par la r&#233;alisation de l&#8217;&#233;v&#233;nement durant l&#8217;intervalle &#8216;F1&#8217; conduit aux relations 
temporelles : [&#948;(F1) = &#947;(U1)] et [&#948;(U1) = &#948;(J0)]7. Dans le m&#234;me esprit, nous devons complexifier le calcul 
pour repr&#233;senter l&#8217;ensemble des valeurs aspecto-temporelles du fran&#231;ais en utilisant la notion de 
r&#233;f&#233;rentiel temporel (r&#233;f&#233;rentiel &#233;nonciatif (REN), r&#233;f&#233;rentiel non-actualis&#233; (RNA), r&#233;f&#233;rentiel des 
possibles, &#8230;), et tenir compte des diff&#233;rents r&#233;f&#233;rentiels (Descl&#233;s et Guentch&#233;va, 2006) o&#249; la relation 
pr&#233;dicative peut venir s&#8217;ins&#233;rer8. En effet, l&#8217;imparfait comme le pass&#233; compos&#233; peuvent fonctionner dans 
des r&#233;f&#233;rentiels temporels qui ne sont pas n&#233;cessairement li&#233;s &#224; l&#8217;&#233;nonciation. Par exemple : &#171;Un jour, 
Luc a donn&#233; le livre de g&#233;ographie &#224; Paul et c&#8217;est cela qui a d&#233;clench&#233; la vocation de Paul : aller 
explorer les terres de la plan&#232;te&#187;. Le marqueur &#8216;un jour&#8217; est l&#8217;indication d&#8217;un changement de r&#233;f&#233;rentiel 
puisque la narration &#233;voqu&#233;e ne peut plus &#234;tre rep&#233;r&#233;e par rapport &#224; son &#233;nonciation. De m&#234;me, dans une 
narration : &#171; Ce jour-l&#224;, Paul &#233;tait en train de donner sa propri&#233;t&#233; &#224; son neveu lorsque son fils est 
intervenu pour &#8230; &#187; L&#224; encore le marqueur &#8216;ce jour-l&#224;&#8217; indique une narration autonome et ind&#233;pendante 
de son &#233;nonciation. Cette analyse peut &#234;tre repr&#233;sent&#233;e &#224; l&#8217;aide de la figure 3 : 
</p>
<p> 
</p>
<p>                                                 
</p>
<p>7
  Nous ne donnons pas ici le calcul explicite, ceci est analys&#233; en d&#233;tail (Descl&#233;s 2004, 2005, Ro 2008, Descl&#233;s et alii, 2010). 
</p>
<p>8
  Chaque r&#233;f&#233;rentiel s'organise par rapport &#224; l'&#233;nonciateur qui va rep&#233;rer les situations par rapport &#224; son &#233;nonciation. Les 
</p>
<p>relations pr&#233;dicatives qui s&#8217;y inscrivent sont aspectualis&#233;es et se r&#233;alisent sur un intervalle topologique &#8216;I&#8217;. Le r&#233;f&#233;rentiel 
de base est le r&#233;f&#233;rentiel &#233;nonciatif d&#233;sign&#233; par &#8216;REN&#8217;. Dans ce r&#233;f&#233;rentiel, l&#8217;acte de parole de l&#8217;&#233;nonciateur &#8216;JE-DIS&#8217;, 
sous forme de processus, rep&#232;re toutes les relations pr&#233;dicatives des &#233;nonc&#233;s. Certains marqueurs (Ce jour-l&#224;, Un jour, 
l&#8217;orage &#233;clata, si tu fais&#8230;) permettent de ne pas rep&#233;rer &#224; REN interne et cr&#233;ent un autre r&#233;f&#233;rentiel o&#249; les relations 
pr&#233;dicatives qui les contiennent y sont ins&#233;r&#233;es. 
</p>
<p>Figure 2 : SSC de &#171; donner &#187; avec projection sur le r&#233;f&#233;rentiel &#233;nonciatif (REN) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INFERENCES ASPECTO-TEMPORELLES ANALYSEES AVEC LA LOGIQUE COMBINATOIRE 
</p>
<p>Figure 3 : Relation entre r&#233;f&#233;rentiels temporels 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Dans ce diagramme 3, la relation &#8216;#&#8217; exprime un changement de r&#233;f&#233;rentiel entre REN et RNA. Dans le 
r&#233;f&#233;rentiel non-actualis&#233; (RNA), tous les &#233;tats, tous les &#233;v&#233;nements et tous les processus sont rep&#233;r&#233;s les 
uns par rapport aux autres et non par rapport &#224; &#8216;J0&#8217;. Le changement de r&#233;f&#233;rentiel permet de prendre en 
compte l&#8217;opposition de Benveniste entre &#171; discours &#187; et &#171; histoire &#187; bien que Benveniste n&#8217;introduise pas 
la notion de r&#233;f&#233;rentiel temporel. Il s&#8217;agit donc d&#8217;int&#233;grer cette derni&#232;re notion dans un syst&#232;me de 
changement de r&#233;f&#233;rentiel et les calculs formels qui s&#8217;y attachent. C&#8217;est l&#224; l&#8217;objet de notre travail.  
Le travail formel nous a amen&#233; &#224; introduire les relations temporelles dans la port&#233;e de l&#8217;op&#233;rateur de 
prise en charge &#8216;JE-DIS&#8217;, ce qui n&#8217;&#233;tait pas le cas dans les articles de Descl&#233;s (2004, 2005), qui analysait 
(1&#8217;) et (2&#8217;) par :       (1&#8221;) (PROCJ0  ((JE-DIS) (PROCJ1 (donner T3 T2 T1))))  &amp;  ([&#948;(J1) = &#948;(J0)]) 
</p>
<p>          (2&#8221;) (PROCJ0 ((JE-DIS) (PROCJ1 (donner T3 T2 T1))))  &amp;  ([&#948;(J1) &lt; &#948;(J0)])  
</p>
<p>La repr&#233;sentation que nous proposons est plus &#8220;naturelle&#8221; puisque la relation temporelle est bien un 
constituant de &#171; ce qui est dit &#187;.  
</p>
<p>3 Traitement informatique de l&#8217;analyse aspecto-temporelle 
Si l&#8217;&#234;tre humain a la capacit&#233; d&#8217;effectuer des inf&#233;rences aspecto-temporelles, une machine doit &#234;tre 
guid&#233;e par des r&#232;gles explicites pour obtenir des r&#233;sultats analogues. Il faut pour cela &#233;valuer &#224; chaque 
&#233;tape de calcul la structure de l&#8217;expression et ses composantes logiques et s&#233;mantiques. Du point de vue 
computationnel, il s&#8217;agit d&#8217;apporter la preuve que les analyses pr&#233;c&#233;dentes sont effectives et peuvent &#234;tre 
r&#233;alis&#233;es automatiquement, ce qui permettra des applications ult&#233;rieures. L&#8217;utilisation de l&#8217;informatique 
dans un mode exp&#233;rimental permettra de tester la force explicative et op&#233;ratoire de la th&#233;orie aspecto-
temporelle et de la GA&amp;C. La programmation fonctionnelle est un paradigme de programmation dans 
lequel les notions de fonction et de r&#233;cursivit&#233; tiennent une place essentielle, notamment &#224; travers 
l&#8217;importance de l&#8217;appel r&#233;cursif de fonctions dans le programme. En particulier, l&#8217;action des 
combinateurs, con&#231;us comme des op&#233;rateurs de composition, d&#8217;op&#233;rateur plus &#233;l&#233;mentaire, qui est 
facilement r&#233;alisable et g&#233;rable en programmation fonctionnelle. Pour faire des calculs automatiquement, 
nous devons fournir &#224; la machine toutes les informations n&#233;cessaires et ad&#233;quates afin de r&#233;duire les 
combinateurs par &#233;tapes. Pour cela, nous avons effectu&#233; une premi&#232;re r&#233;alisation informatique avec, 
entre autres, le langage fonctionnel F# (Ro, 2008), puis, avec Haskell. Le programme, impl&#233;ment&#233; &#224; 
l&#8217;aide de B.Djioua, prend en entr&#233;e une phrase comme &#171; Luc a donn&#233; le livre &#224; Jean &#187; et renvoie sa 
repr&#233;sentation s&#233;mantique sous la forme d&#8217;un sch&#232;me instanci&#233;. Le programme proc&#232;de &#224; une premi&#232;re 
analyse syntaxique dans le cadre des Grammaires Cat&#233;gorielles construisant ainsi une expression 
applicative associ&#233;e (Biskri et Descl&#233;s, 2005) ; ensuite le programme construit les conditions 
d&#8217;&#233;nonciation et parall&#232;lement engendre une repr&#233;sentation s&#233;mantico-cognitive &#224; partir de la 
d&#233;composition de pr&#233;dicat &#171; donner &#187; &#224; l&#8217;aide de l&#8217;op&#233;rateur &#8216;X&#8217;. Le programme termine par une 
int&#233;gration des conditions &#233;nonciatives et du sch&#232;me instanci&#233; donnant l&#8217;analyse s&#233;mantique de la phrase 
pr&#233;sent&#233;e en entr&#233;e. Ainsi, nous pouvons rendre compte automatiquement de certaines inf&#233;rences comme 
celle que nous avons vu au &#167;2.2. Le travail est en cours pour traiter un plus grand nombre d&#8217;exemples. 
Dans cet article, nous montrons uniquement une partie de l&#8217;impl&#233;mentation, relative aux op&#233;rations </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HEE-JIN RO 
aspecto-temporelles. Plus pr&#233;cis&#233;ment, nous avons r&#233;alis&#233; un programme de reconnaissance charg&#233; de 
reconstruire les conditions aspecto-temporelles &#224; partir des marqueurs morphologiques.   
</p>
<p>3.1 Combinateurs et op&#233;rateurs aspecto-temporels 
</p>
<p>La premi&#232;re partie de l&#8217;impl&#233;mentation consiste &#224; d&#233;finir les combinateurs &#233;l&#233;mentaires et d&#233;riv&#233;s 
(puissance et &#224; distance) de la LC dans le programme. La r&#233;duction que nous allons utiliser traite du 
combinateur effectuable le plus &#224; gauche dans l&#8217;expression applicative consid&#233;r&#233;e. Les sch&#233;mas de types 
combinateurs sont fonctions de types variables que nous d&#233;terminons par l&#8217;op&#233;ration d&#8217;unification (Les 
types &#8216;t1&#8217;, &#8216;t2&#8217; et &#8216;t3&#8217;&#8230; sont des types variables, ils sont identifi&#233;s par unification). Nous montrons ici 
les d&#233;finitions de quelques combinateurs et leurs sch&#233;mas de types (fen&#234;tre &#224; gauche &#8211; d&#233;finitions des 
combinateurs dans un &#233;diteur de code, fen&#234;tre &#224; droite &#8211; sch&#233;mas de types des combinateurs d&#233;finis en 
Haskell via l&#8217;interpr&#233;teur interactif &#8216;GHCi&#8217;):   
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Impl&#233;mentons maintenant quelques op&#233;rateurs aspecto-temporels9 ainsi que les relations temporelles, 
introduits au &#167;2.1., de l&#8217;&#233;v&#233;nement dans le pass&#233; (&#233;nonc&#233; (3)) en Haskell. Nous d&#233;finissons d&#8217;abord les 
types d&#8217;entit&#233;s individuelles (J), de pr&#233;dicat (Predicat), d&#8217;op&#233;rateurs aspecto-temporels (Operateurs), 
d&#8217;intervalle, d&#8217;instants, en utilisant Haskell data keyword (data constructors ou value constructors) et 
recursive types ; ensuite nous d&#233;finissons les fonctions (local functions) pour l&#8217;ex&#233;cution. Le r&#233;sultat, 
apr&#232;s ex&#233;cution, est l&#8217;expression applicative de la repr&#233;sentation formelle de l&#8217;analyse aspecto-
temporelle (voir la formule de repr&#233;sentation m&#233;talinguistique de l&#8217;&#233;nonc&#233; 3, alors 3&#8217;). Les d&#233;finitions et 
les r&#233;sultats du programme correspondent &#224; chaque &#233;tape du calcul formel. 
</p>
<p>                                                 
</p>
<p>9
  Pour l&#8217;impl&#233;mentation de toutes les &#233;tapes de niveau morphologique au SSC, voir Descl&#233;s &amp; al. (2010), pour 
</p>
<p>l&#8217;impl&#233;mentation des SSC, voir Djioua (2000), et pour l&#8217;analyse et son impl&#233;mentation en F#, voir Ro (2008). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INFERENCES ASPECTO-TEMPORELLES ANALYSEES AVEC LA LOGIQUE COMBINATOIRE 
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>4 Conclusion 
L&#8217;utilisation de la Logique Combinatoire que nous venons de montrer sur les quelques exemples permet, 
d&#8217;une part, d&#8217;articuler des niveaux de repr&#233;sentations de la GA&amp;C entre eux dans un processus de 
changement de niveau au sein d&#8217;une m&#234;me architecture computationnelle, et d&#8217;autre part, de synth&#233;tiser 
un pr&#233;dicat &#224; partir de l&#8217;analyse de sa repr&#233;sentation s&#233;mantique. Il existe de nombreuses analyses 
formelles automatiques de la morphologie et de la syntaxe, mais les constructions automatiques de 
repr&#233;sentation s&#233;mantique sont plus complexes &#224; d&#233;crire et &#224; formaliser. Les r&#233;alisations actuelles sont 
souvent des applications tr&#232;s limit&#233;es &#224; un domaine externe parfaitement circonscrit. De plus, peu de 
r&#233;alisations effectives portent sur la prise en compte de la s&#233;mantique du temps et de l&#8217;aspect, except&#233; les 
&#233;tudes d&#8217;Asher et alii. (1995) qui sont bas&#233;es sur une approche de l&#8217;aspectualisation et Kamp (1993). 
C&#8217;est ainsi que notre recherche permettrait la r&#233;alisation d&#8217;un programme d&#8217;automatisation de l&#8217;analyse 
aspecto-temporelle. Nous souhaiterions pr&#233;senter ult&#233;rieurement comment certaines inf&#233;rences aspecto-
temporelles, qui mettent en jeu des significations lexicales et les conditions aspecto-temporelles peuvent 
&#234;tre trait&#233;es par des calculs formels et r&#233;alis&#233;es par des programmes informatiques. 
</p>
<p>R&#233;f&#233;rences  
ASHER N., AURNAGUE M., BRAS M., SABLAYROLLES P., VIEU L. (1995). &#8220;De l&#8217;espace-temps dans 
l&#8217;analyse du discours&#8221;. Semiotique, 9:11&#8211;62. 
</p>
<p>BENVENISTE &#201;. (1966, 1974). Probl&#232;mes de linguistique g&#233;n&#233;rale 1 &amp; 2.  Paris: Gallimard. 
BISKRI I., DESCL&#201;S J-P. (2005). &#8220;Applicative and Combinatory Categorial Grammar and Subordinate 
Constructions in French&#8221;. International Journal on Artificial Intelligence Tools, v14. N&#176;1 &amp; 2, 125-136. 
COMRIE B. (1976). Aspect, an Introduction to the Study of Verbal Aspect and Related Problems. London: 
Cambridge University Press. 
</p>
<p>CULIOLI A. (1999). Pour une linguistique de l&#8217;&#233;nonciation, Formalisation et op&#233;rations de rep&#233;rage. 
Tome 2, Paris: Ophrys. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HEE-JIN RO 
CURRY H.B., (1958, 1972). Combinatory Logic. Volume 1 &amp; 2. Amsterdam: North-Holland Publishing. 
</p>
<p>DESCL&#201;S J.-P., (1990a). Langages applicatifs, langues naturelles et cognition. Paris: Herm&#232;s. 
DESCL&#201;S J.-P., (1990b). &#8220;State, Event, Process, and Topology&#8221;. in: General Linguistics, 29, 3:159-200. 
University Park and London: Pennsylvania State University Press.  
</p>
<p>DESCL&#201;S J.-P., GUENTCH&#201;VA Z. (1995). &#8220;Is the notion of Process necessary? A fundamental distinction 
process in progress and state activity&#8221;. in: Temporal Reference, Aspect and Actionality, P.-M Bertinetto; 
V. Bianchi; J. Higginbotham; M. Squartini (eds.), Torino: Rosenberg and Sellier, 1995, p55-70.   
</p>
<p>DESCL&#201;S J.-P. (2004). &#8220;Combinatory Logic, Language and Cognitive Representations&#8221;. in Weingarten P. 
(ed.), Alternative Logics. Do Sciences Need Them?, Springer, 115-148. 
</p>
<p>DESCL&#201;S J.-P. (2005). &#8220;Reasoning and Aspectual-Temporal Calculus&#8221;. in: Vanderveken D. (eds.), Logic, 
Thought and Action, Springer, pp. 217-244. 
</p>
<p>DESCL&#201;S J.-P., GUENTCH&#201;VA Z. (2006). &#8220;R&#233;f&#233;rentiels aspecto-temporels dans les textes&#8221;. in: Etudes 
Cognitives, 7. SOW, Warszawa. pp. 6-38. 
</p>
<p>DESCL&#201;S J.-P., DJIOUA B., RO H.-J. (2010). &#8220;Computational Approach of Cognitive Semantic by means 
of Combinatory Logic&#8221;. soumis &#224; publication. 
</p>
<p>DJIOUA B. (2000). Mod&#233;lisation Informatique d'une base de connaissances lexicales (DiSSC) : R&#233;seaux 
polys&#233;miques et Sch&#232;mes S&#233;mantico-Cognitifs, Th&#232;se de doctorat, Universit&#233; Paris-Sorbonne. 
</p>
<p>HINDLEY, J.R., SELDIN, J.P. (1986). Introduction to Combinators and &#955;-Calculus. Cambridge Univ. 
Press. 
</p>
<p>IVANOVA-TARASOVA E. (2009). Approche cognitive et formelle de la polys&#233;mie verbale : les verbes de 
transfert en fran&#231;ais et en russe, Th&#232;se de doctorat, Universit&#233; Paris-Sorbonne. 
KAMP H., REYLE U. (1993). From discourse to logic. Kluwer Academic Publisher. 
</p>
<p>LANGACKER  R.W. (1989, 1991). Foundations of cognitive grammar, volume 1, Theoretical 
prerequisites, volume 2, Description Application, Stanford University Press 
</p>
<p>O&#8217;SUILLIVAN B., GOERZEN J., STEWART D. (2008). Real world Haskell. Sebastopol : O&#8217;Reilly 
</p>
<p>POTTIER B. (2000). Repr&#233;sentations mentales et cat&#233;gorisations linguistiques, Louvain, Paris, Peeters. 
</p>
<p>REICHENBACH H. (1947). Elements of Symbolic Logic. New York, reprinted in J.M. Moravcsik (eds.), 
1974, :Logic and Philosophy for Linguists, A Book of radings, The Hague: Mouton, pp. 122-141. 
</p>
<p>RO, H.-J., (2008). Traitement automatique de l&#8217;analyse d&#8217;inf&#233;rences aspecto-temporelles : mod&#233;lisation 
logique et informatique. M&#233;moire de Master de Recherche. Universit&#233; Paris-Sorbonne. 
SHAUMYAN S.K. (1987). A Semiotic Theory of Natural Languages. Bloomington: Indiana Univ Press. 
SON H. (2006). Repr&#233;sentation s&#233;mantico-cognitive des verbes de transfert, Th&#232;se de doctorat, 
Universit&#233; Paris-Sorbonne. </p>

</div></div>
</body></html>