<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Outils de segmentation du chinois et textom&#233;trie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2010, Montr&#233;al, 19-23 juillet 2010
</p>
<p>Outils de segmentation du chinois et textom&#233;trie
</p>
<p>Li-Chi WU1
</p>
<p>(1) SYLED, Universit&#233; Sorbonne Nouvelle Paris III, 13 rue de Santeuil, 75005 Paris, 
France
</p>
<p>lucielichi@gmail.com
</p>
<p>R&#233;sum&#233; La segmentation en mots est une premi&#232;re &#233;tape possible dans le traitement automatique de la 
langue chinoise. Les syst&#232;mes de segmentation se sont beaucoup d&#233;velopp&#233;s depuis le premier apparu dans 
les ann&#233;es 1980. Il n&#8217;existe cependant aucun outil standard aujourd&#8217;hui. L&#8217;objectif de ce travail est de faire 
une comparaison des diff&#233;rents outils de segmentation en s&#8217;appuyant sur une analyse statistique. Le but est de
d&#233;finir pour quel type de texte chacun d&#8217;eux est le plus performant. Quatre outils de segmentation et deux 
corpus avec des th&#232;mes distincts ont &#233;t&#233; choisis pour cette &#233;tude. &#192; l&#8217;aide des outils textom&#233;triques Lexico3
et mkAlign, nous avons centr&#233; notre analyse sur le nombre de syllabes du chinois. Les donn&#233;es quantitatives 
ont permis d&#8217;objectiver des diff&#233;rences entre les outils. Le syst&#232;me Hylanda s&#8217;av&#232;re performant dans la
segmentation des termes sp&#233;cialis&#233;s et le syst&#232;me Stanford est plus indiqu&#233; pour les textes g&#233;n&#233;raux. L&#8217;&#233;tude 
de la comparaison des outils de segmentation montre le statut incontournable de l&#8217;analyse textom&#233;trique 
aujourd&#8217;hui, celle-ci permettant d&#8217;avoir acc&#232;s rapidement &#224; la recherche d&#8217;information.
</p>
<p>Abstract Chinese word segmentation is the first step in Chinese natural language processing. The system 
of segmentation has considerably developed since the first automatic system of segmentation of the 1980&#8217;s. 
However, till today there are no standard tools. The aim of this paper is to compare various tools of 
segmentation by through statistical analysis. Our goal is to identify the kind of texts for which these 
segmentation tools are the most effective. This study chose four segmentation tools and two corpora, marked 
by distinct themes. Using two textometric toolboxes, Lexico3 and mkAlign, we focused on the number of 
syllables in Chinese. The quantitative data allowed us to objectify disparities between tools. The Hylanda 
system turns out to be effective in the segmentation of specialized terms and the Stanford system is more 
appropriate for general texts. The comparative study of segmenters shows the undeniable status of 
textometrical analysis which is able to quickly access information retrieval.
</p>
<p>Mots-cl&#233;s :   Textom&#233;trie, comparaison des segmenteurs chinois, nombre de syllabes
Keywords:   Textometry, comparison of Chinese segmenters, number of syllables</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LI-CHI WU
</p>
<p>1 Introduction
Les m&#233;thodes d&#8217;analyse des textes sur ordinateur sont r&#233;pandues depuis longtemps dans les travaux sur les 
langues occidentales. Mais l&#8217;&#233;tude textom&#233;trique du chinois n&#8217;a commenc&#233; que dans les ann&#233;es 1980. Les 
premi&#232;res &#233;tudes quantitatives concernaient la lexicologie comme par exemple la production du 
Dictionnaire des fr&#233;quences des mots chinois contemporains (Modern Chinese Frequency Dictionary). De 
nombreux travaux sur des livres sp&#233;cifiques ont &#233;t&#233; publi&#233;s &#224; la m&#234;me &#233;poque, sp&#233;cialement des ouvrages 
sur le chinois classique. Dans la majorit&#233; des cas, les calculs de ces &#233;tudes ont &#233;t&#233; faits manuellement, les 
chiffres statistiques ne seraient donc pas garantis sans erreur. C&#8217;est ainsi qu&#8217;a &#233;merg&#233; la recherche sur les 
textes qui a men&#233; vers les &#233;tudes statistiques des textes chinois.
</p>
<p>Notre travail a pour objectif d&#8217;effectuer une comparaison de quatre outils de segmentation, &#233;galement 
appel&#233;s segmenteurs. L&#8217;&#233;tude est bas&#233;e sur une analyse textom&#233;trique et nous nous sommes concentr&#233;e sur 
le nombre de syllabes en chinois. La comparaison des segmenteurs a pour but de d&#233;finir les sp&#233;cificit&#233;s 
pour chaque segmenteur en analysant les types de textes les plus adapt&#233;s.
</p>
<p>L&#8217;&#233;tude textom&#233;trique en chinois s&#8217;est d&#233;velopp&#233;e tardivement, certainement &#224; cause de facteurs li&#233;s au 
syst&#232;me de l&#8217;&#233;criture traditionnelle chinoise. L&#8217;informatisation de cette langue s&#8217;est en effet r&#233;v&#233;l&#233;e 
beaucoup plus complexe que celle du syst&#232;me bas&#233; sur l&#8217;utilisation des alphabets latins. La mise en place 
de technologies permettant la saisie et l&#8217;affichage des caract&#232;res chinois a permis de d&#233;passer la complexit&#233; 
de ce syst&#232;me d&#8217;&#233;criture. La norme internationale du codage de caract&#232;re Unicode fournit d&#233;sormais la 
possibilit&#233; de repr&#233;senter des textes dans toutes les langues, ind&#233;pendamment du syst&#232;me informatique ou 
des plates-formes.
</p>
<p>Les progr&#232;s consid&#233;rables des &#233;quipements informatiques nous apportent une tr&#232;s grande libert&#233; d&#8217;acc&#232;s &#224; 
l&#8217;information. Les applications du traitement automatique des langues sont de plus en plus vari&#233;es : la 
traduction, le r&#233;sum&#233; de textes, la fouille de textes, l&#8217;extraction d&#8217;information, etc. Le chinois poss&#232;de une 
typographie diff&#233;rente des langues occidentales en raison de son syst&#232;me d&#8217;&#233;criture. Un texte chinois est 
repr&#233;sent&#233; par une cha&#238;ne de caract&#232;res continue, sans blanc typographique1. Pour qu&#8217;un ordinateur 
effectue une analyse correcte, la premi&#232;re &#233;tape primordiale est de segmenter les textes en unit&#233;s lexicales 
(&#171; tokenisation &#187;, d&#233;coupage d&#8217;un texte en mots). Or, il n&#8217;y a pas de consensus entre les Chinois et 
diff&#233;rentes segmentations sont accept&#233;es. Le premier syst&#232;me de segmentation automatique a &#233;t&#233; r&#233;alis&#233; en 
1983 par l&#8217;Institut a&#233;ronautique de P&#233;kin. Par la suite, beaucoup d&#8217;outils de segmentation du chinois ont 
&#233;t&#233; d&#233;velopp&#233;s, mais il n&#8217;y a pas d'outil standard. Une m&#234;me phrase peut &#234;tre d&#233;coup&#233;e de fa&#231;on diff&#233;rente 
selon l&#8217;outil utilis&#233;. Il est donc crucial de choisir un outil de segmentation ad&#233;quat permettant l&#8217;acc&#232;s direct 
&#224; l&#8217;information recherch&#233;e.
</p>
<p>2 Outils de segmentation et corpus
&#201;tant donn&#233; que l&#8217;&#233;criture chinoise cr&#233;e des difficult&#233;s dans le traitement automatique des langues, il est 
n&#233;cessaire d&#8217;avoir une norme de la segmentation des mots chinois. Une norme de segmentation du chinois
comporte en g&#233;n&#233;ral deux parties : segmentation des unit&#233;s lexicales et annotation des cat&#233;gories 
grammaticales. En 1993, la R&#233;publique populaire de Chine a con&#231;u la norme de la segmentation des mots 
                                                
1 L&#8217;absence d&#8217;espace entre les mots &#233;tait pratiqu&#233;e dans l&#8217;antiquit&#233; grecque et romaine ainsi qu&#8217;au d&#233;but du Moyen &#194;ge 
</p>
<p>europ&#233;en. Dans le cas des langues europ&#233;ennes, le lecteur devait d&#8217;abord rep&#233;rer les syllabes puis les mots. Dans le cas du 
chinois, les syllabes sont marqu&#233;es, un caract&#232;re correspondant &#224; une syllabe, et il ne reste qu&#8217;&#224; assembler les caract&#232;res en 
mots.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>OUTILS DE SEGMENTATION DU CHINOIS ET TEXTOMETRIE
chinois contemporains pour le traitement informatique (&#20449;&#24687;&#34389;&#29702;&#29992;&#29694;&#20195;&#28450;&#35486;&#20998;&#35422;&#35215;&#31684; xinxi chuli yong 
xiandai hanyu fenci guifan) pour le traitement automatique du chinois. Cette norme propose des principes 
et des r&#232;gles de segmentation des mots chinois, qui ne sont pas toujours op&#233;ratoire et parfois difficiles &#224; 
appliquer. Depuis, de nombreuses normes de segmentation du chinois ont &#233;t&#233; cr&#233;&#233;es par diff&#233;rents
organismes en Chine continentale ou en dehors du territoire, afin d&#8217;avoir des r&#232;gles de segmentation 
am&#233;lior&#233;es. Elles sont soit appuy&#233;es sur cette norme d&#8217;&#201;tat, soit cr&#233;&#233;es par l&#8217;organisme en question. Deux 
de ces segmenteurs que nous avons &#233;tudi&#233;s (ICTCLAS et SF_PKU, cf. 2.1) sont fond&#233;s sur la norme d&#8217;&#201;tat 
. Ils effectuent une segmentation similaire que notre analyse va mettre en &#233;vidence.
</p>
<p>2.1 Description des segmenteurs
Nous avons utilis&#233; dans notre &#233;tude les quatre segmenteurs les plus connus dans la segmentation du 
chinois.
</p>
<p>1. Hylanda Zhongwen zhineng fenci
</p>
<p>Le segmenteur Hylanda est une application commerciale. Il utilise des m&#233;thodes comme le 
nombre maximum ant&#233;rieur de segments (forward maximum matching, FMM), nombre maximum 
post&#233;rieur de segments (backward maximum matching, BMM), etc. (Liang, 1984). Son 
programme annote les cat&#233;gories grammaticales des mots segment&#233;s2. La caract&#233;ristique de 
Hylanda est de reconna&#238;tre des entit&#233;s nomm&#233;es : des noms propres de personnes, des noms de 
lieux g&#233;ographiques, des noms des organismes, etc., et sp&#233;cialement des noms propres dans le 
domaine de la m&#233;canique.
</p>
<p>2. Chinese Lexical Analysis System
</p>
<p>Le segmenteur ICTCLAS (Zhang et al., 2003) a &#233;t&#233; cr&#233;&#233; par la Chinese Academy of Science et a 
&#233;t&#233; mis &#224; jour plusieurs fois 3 . Il poss&#232;de des fonctions comme l&#8217;annotation lexicale, la 
reconnaissance d&#8217;entit&#233;s nomm&#233;es et de nouveaux mots et leur int&#233;gration dans un dictionnaire 
d&#233;fini par l&#8217;utilisateur. ICTCLAS s&#8217;appuie sur un grand lexique et utilise un mod&#232;le de Markov4. 
L&#8217;&#233;tiquetage grammatical se r&#233;f&#232;re principalement au corpus annot&#233; du Quotidien du peuple de 
l&#8217;Universit&#233; de P&#233;kin (Yu et al., 2000) car ce corpus est utilis&#233; comme corpus d&#8217;apprentissage de 
la segmentation.
</p>
<p>3. Stanford Chinese Word Segmenter
</p>
<p>                                                
2 L&#8217;entreprise Hylanda &#224; Tianjin fait des &#233;tudes sur le traitement automatique de la langue chinoise dans la fouille de textes. 
</p>
<p>Elle d&#233;veloppe &#233;galement des produits de nouvelles technologies. Son segmenteur a &#233;t&#233; mis en application par plusieurs 
moteurs de recherche. La version de l&#8217;outil que l&#8217;on a trouv&#233;e dans le site de l&#8217;entreprise est une version d&#8217;essai sans 
annotation des cat&#233;gories grammaticales la quantit&#233; de texte d&#8217;essai est donc limit&#233;e. http://www.hylanda.com/server/ (page 
consult&#233;e le 6 janvier 2010)
</p>
<p>3 Le segmenteur d&#8217;ICTCLAS (Institute of Computing Technology, Chinese Lexical Analysis System) a &#233;t&#233; mis au point par 
Kevin Zhang &#224; l&#8217;Institute of Computing Technology, Chinese Academy of Sciences. Il en existe plusieurs versions, nous 
avons utilis&#233; la version 2008 zhenghe ban (&#25972;&#21512;&#29256;) qui a &#233;t&#233; am&#233;lior&#233;e par rapport aux anciennes versions pour la recherche 
universitaire. Le t&#233;l&#233;chargement est disponible dans un forum de discussion sp&#233;cialis&#233; pour la linguistique de corpus. 
http://www.corpus4u.org/attachment.php?attachmentid=426&amp;d=1220683589 (page consult&#233;e le 8 janvier 2010)
</p>
<p>4 Le Mod&#232;le de Markov Cach&#233; Hi&#233;rarchique (Hierarchical Hidden Markov Model, HHMM) est un mod&#232;le statistique utilis&#233; 
dans le traitement automatique des langues. Il est appliqu&#233; &#224; l&#8217;extraction d&#8217;informations, la reconnaissance vocale, etc.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LI-CHI WU
Le segmenteur Stanford qui s&#8217;appuie sur la norme de l&#8217;Universit&#233; de Pennsylvania (Xia, 2000) a 
&#233;t&#233; produit par le groupe de sp&#233;cialistes du traitement des langues naturelles de l&#8217;Universit&#233; 
Stanford. Cet outil utilise le mod&#232;le des champs al&#233;atoires conditionnels pour &#233;tiqueter les 
donn&#233;es (Tseng et al., 2005). Il propose deux mod&#232;les de segmentation sans annotation des 
cat&#233;gories lexicales, l&#8217;une s&#8217;appuyant sur la norme du corpus annot&#233; de l&#8217;Universit&#233; de P&#233;kin, ou 
SF_PKU et l&#8217;autre s&#8217;appuyant sur celle de Penn Chinese Treebank5, ou SF_CTB.
</p>
<p>2.2 Pr&#233;paration du corpus
Afin d&#8217;initier cette &#233;tude de la segmentation en textom&#233;trie, deux &#233;chantillons de test contenant un petit
nombre d&#8217;unit&#233;s lexicales ont &#233;t&#233; choisis. Nous avons utilis&#233; deux corpus de diff&#233;rents domaines poss&#233;dant 
un nombre de caract&#232;res similaires correspondant &#224; 16 000 sinogrammes : le corpus de la Constitution de 
la R&#233;publique Populaire de Chine6, d&#233;sormais Constitution, et le corpus des conf&#233;rences de presse du 
Minist&#232;re des Affaires &#201;trang&#232;res de Chine7, d&#233;sormais Presse. La taille totale des deux corpus segment&#233;s 
par les outils &#233;tudi&#233;s est entre 8 300 et 9 800 occurrences, ce qui correspond &#224; approximativement entre 
1 000 et 1 600 formes diff&#233;rentes (cf. 3.2 pour plus de d&#233;tails). Pour chaque corpus, nous obtenons quatre 
segmentations diff&#233;rentes du m&#234;me texte au moyen des quatre segmenteurs. Les textes chinois ont &#233;t&#233; 
sauvegard&#233;s en format texte brut avec le jeu de caract&#232;res GB2312, qui est destin&#233; &#224; repr&#233;senter les 
caract&#232;res simplifi&#233;s8.
</p>
<p>Dans un premier temps, les segmentations obtenues pour les deux corpus ont &#233;t&#233; align&#233;es afin de faciliter 
l&#8217;analyse. Pour cela, nous avons eu recours &#224; l&#8217;outil d&#8217;alignement mkAlign9, ce qui nous a permis de
comparer en lexicom&#233;trie les deux textes. L&#8217;alignement a permis d&#8217;obtenir des textes o&#249; chaque groupe 
align&#233; est signal&#233; par le symbole di&#232;se &#171; # &#187; comme s&#233;parateur. Les quatre textes ont &#233;t&#233; regroup&#233;s dans un 
m&#234;me fichier et s&#233;par&#233;s par des balises.
</p>
<p>                                                
5 Le Penn Chinese Treebank contient des corpus segment&#233;s, &#233;tiquet&#233;s de POS de 500 milliers de mots chinois. Les ressources 
</p>
<p>des corpus proviennent de l&#8217;agence de presse Xinhua, Sinorama news magazine et Hong Kong News. 
http://www.cis.upenn.edu/~chinese/ctb.html (page consult&#233;e le 20 janvier 2010)
</p>
<p>6 Les textes &#233;lectroniques ont &#233;t&#233; recueillis sur le site de l&#8217;agence de presse chinoise Xinhua. 
http://news.xinhuanet.com/newscenter/2004-03/15/content_1367387.htm (page consult&#233;e le 6 janvier 2010)
</p>
<p>7 Nous avons rassembl&#233; les textes &#233;lectroniques des dialogues entre le porte-parole et des journalistes sur six conf&#233;rences de 
presse du 11 juin au 30 juin 2009 dans le site officiel du Minist&#232;re des Affaires &#201;trang&#232;res de la R&#233;publique populaire de 
Chine. http://www.fmprc.gov.cn/chn/gxh/wzb/fyrbt/jzhsl/default.htm (page consult&#233;e le 18 janvier 2010)
</p>
<p>8 GB2312 est un jeu de caract&#232;res utilis&#233; en Chine. Il attribue un code de 16 bits pour un sinogramme simplifi&#233;, soit deux 
octets. Mais certains caract&#232;res rares ne peuvent pas &#234;tre repr&#233;sent&#233;s avec ce syst&#232;me. GB18030 a donc &#233;t&#233; cr&#233;&#233; et il supporte 
les caract&#232;res tant du chinois simplifi&#233; que du chinois traditionnel. Big 5 est un jeu de carat&#232;res utilis&#233; &#224; Taiwan et &#224; Hong 
Kong pour les caract&#232;res traditionnels.
</p>
<p>9 Le programme mkAlign, cr&#233;&#233; par Serge Fleury de l&#8217;Universit&#233; Paris III, permet d&#8217;afficher et de corriger simultan&#233;ment un 
alignement de deux textes de m&#234;me langue ou de langues diff&#233;rentes. http://tal.univ-paris3.fr/mkAlign/ (page consult&#233;e le 17 
f&#233;vrier 2010)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>OUTILS DE SEGMENTATION DU CHINOIS ET TEXTOMETRIE
3 &#201;tude des outils
</p>
<p>3.1 Exploration pr&#233;liminaire
Le module variation10 de mkAlign (Fleury, Zimina, 2009) permet de rep&#233;rer toute variation d&#8217;un texte 
source par rapport &#224; un texte cible ou dans deux types de segmentations d&#8217;un m&#234;me texte, comme c&#8217;est le 
cas ici. Les diff&#233;rences de segmentation sont mises en &#233;vidence au moyen de la coloration. Les num&#233;ros 
des paragraphes, signal&#233;s par le s&#233;parateur # (figure 1) sont not&#233;s dans la premi&#232;re colonne. La
visualisation du corpus nous permet d&#8217;avoir un aper&#231;u des deux textes et d&#8217;examiner leurs diff&#233;rences et 
leurs similitudes.
</p>
<p>Figure 1 : Variations des textes de segmenteurs Hylanda et celles d&#8217;ICTCLAS
</p>
<p>Nous avons calcul&#233; le nombre de formes diff&#233;rentes selon les quatre segmentations. Six paires de 
comparaisons ont &#233;t&#233; faites en s&#8217;appuyant sur trois types de distinctions pr&#233;d&#233;finies : l&#8217;ajout (case verte), la 
modification (case bleue) et la suppression (case rouge). Le nombre le plus &#233;lev&#233; (case bleue) de formes 
diff&#233;rentes segment&#233;es pour chaque paire, est obtenu avec les segmenteurs Hylanda et SF_CTB pour 
Constitution. Pour Presse, il est obtenu par Hylanda et ICTCLAS. On en d&#233;duit qu&#8217;ils poss&#232;dent de 
nombreuses formes de segmentations diff&#233;rentes. Les segmenteurs ICTCLAS et SF_PKU poss&#232;dent, au 
contraire, le moins de formes de segmentations diff&#233;rentes. Nous faisons l&#8217;hypoth&#232;se que ICTCLAS et 
SF_PKU sont les plus similaires dans la segmentation pour des textes de droit et des textes de presse.
</p>
<p>3.2 Accroissement de vocabulaire
L&#8217;&#233;tude de l&#8217;apparition de nouvelles formes graphiques du corpus Constitution confirme les diff&#233;rences 
quantitatives entrevues entre les quatre types de segmentations. La courbe d&#8217;accroissement de vocabulaire 
calcul&#233;e simultan&#233;ment pour les quatre volets du corpus (figure 2) montre que la croissance du vocabulaire 
du segmenteur Hylanda augmente plus rapidement que celles des trois autres. L&#8217;interruption de la courbe 
de Hylanda avant les autres indique que le texte comporte moins d&#8217;occurrences. La courbe (rouge)
correspondant &#224; l&#8217;apparition de nouveaux mots chinois est situ&#233;e au-dessus de celles qui correspondent &#224; 
l&#8217;apparition des mots dans les textes segment&#233;s par ICTCLAS, SF_CTB et SF_PKU. Ceci confirme que le 
texte segment&#233; par Hylanda comprend le plus grand nombre de formes graphiques. La courbe (jaune) 
situ&#233;e au-dessous t&#233;moigne que le texte segment&#233; par SF_CTB poss&#232;de moins de formes graphiques. Les
courbes d&#8217;ICTCLAS (verte) et de SF_PKU (bleue) se superposent quasiment. Nous supposons que leurs 
segmentations sont similaires. Nous pourrions avancer l&#8217;argument que cela provient du fait que ICTCLAS 
et SF_PKU utilisent la m&#234;me norme, la norme de l&#8217;&#201;tat de Chine, &#224; savoir celle fonctionnant selon le 
corpus annot&#233; de l&#8217;Universit&#233; de P&#233;kin.
</p>
<p>                                                
10 Variation permet de rep&#233;rer les variations dans deux versions d&#8217;un m&#234;me texte ou dans deux textes diff&#233;rents en les 
</p>
<p>comparant avec l&#8217;outil d&#8217;alignement mkAlign.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LI-CHI WU
Des paliers cr&#233;&#233;s par le ralentissement de l&#8217;accroissement du vocabulaire au cours du r&#233;cit pourraient &#234;tre 
mis en rapport d&#8217;une courbe &#224; l&#8217;autre. Au ralentissement qui survient sur la courbe du segmenteur SF_CTB 
(abscisse 2 000) correspond un ralentissement sur celle du segmenteur ICTCLAS et SF_PKU (abscisse 
1 900) et sur celle de Hylanda (abscisse 1 800). &#192; celui qui survient pour le texte de SF_CTB (abscisse 
5 600) correspond &#233;galement un ralentissement dans le texte de ICTCLAS et de SF_PKU (abscisse 5 000) 
et celui de Hylanda (abscisse 4 500).
</p>
<p>Quant au corpus Presse (figure 3), les courbes de l&#8217;accroissement de vocabulaire se superposent quasiment 
dans les premi&#232;res cinq cents occurrences. L&#8217;interruption de la courbe de Hylanda avant les trois autres, 
comme pour le corpus Constitution, confirme que le texte comporte moins d&#8217;occurrences. C&#8217;est &#233;galement 
le texte segment&#233; par SF_CTB qui poss&#232;de le plus d&#8217;occurrences pour Presse. Comme le montre la figure 
2, le nombre d&#8217;occurrences entre les quatre segmenteurs pour Presse est tr&#232;s proche.
</p>
<p>La courbe d&#8217;ICTCLAS et celle de SF_PKU sont &#233;galement tr&#232;s proches comme nous l&#8217;avons d&#233;j&#224; vu dans 
Constitution. Sur la figure 3, nous pouvons voir que les quatre courbes suivent la m&#234;me progression avec 
peu de d&#233;calage entre elles par comparaison aux courbes de la figure 2. Cette similarit&#233; indique que les 
quatre textes de Presse sont segment&#233;s de fa&#231;on similaire au niveau des occurrences et au niveau des 
formes graphiques, &#224; l&#8217;inverse du corpus Constitution.
</p>
<p>Gr&#226;ce aux repr&#233;sentations graphiques, la distinction entre les segmenteurs appara&#238;t clairement. De plus, le 
genre du texte influence la segmentation. En effet, le texte de presse a &#233;t&#233; segment&#233; de fa&#231;on semblable par 
les quatre segmenteurs, alors que nous avons mis en &#233;vidence de grandes diff&#233;rences dans les versions 
segment&#233;es du corpus de droit.
</p>
<p>&#9473; Hylanda &#9473; ICTCLAS &#9473; SF_CTB &#9473; SF_PKU &#9473; Hylanda &#9473; ICTCLAS &#9473; SF_CTB &#9473; SF_PKU
</p>
<p>Figure 2 : Accroissement de vocabulaire dans les 
quatre volets de Constitution
</p>
<p>Figure 3 : Accroissement de vocabulaire dans les 
quatre volets de Presse
</p>
<p>3.3 Nombre de syllabes
Le chinois est une langue monosyllabique. Cela est vrai pour le chinois ancien ou archa&#239;que dans une 
forme traditionnelle de la langue &#233;crite du style noble (wenyan) avant l&#8217;apparition du chinois vernaculaire 
(baihua). Le chinois contemporain a tendance &#224; passer du monosyllabisme au dissyllabisme, voire 
polysyllabisme (Wang, 2000). Les deux corpus aux th&#232;mes diff&#233;rents (l&#8217;un provient d&#8217;un domaine 
sp&#233;cialis&#233;, l&#8217;autre d&#8217;un domaine g&#233;n&#233;ral) segment&#233;s par les quatre outils, nous ont pouss&#233;e &#224; faire une 
&#233;tude sur le nombre de syllabes. D&#8217;anciens travaux ont indiqu&#233; que le nombre de syllabes est influenc&#233; par 
plusieurs facteurs : ph&#233;nom&#232;nes phon&#233;tiques, s&#233;mantiques, la formation des mots, la communication de 
langue, d&#233;veloppement de la soci&#233;t&#233;, etc. (Alleton, 1994 ; Huang, Yang, 1990). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>OUTILS DE SEGMENTATION DU CHINOIS ET TEXTOMETRIE
3.3.1 Formes fr&#233;quentes
</p>
<p>Dans cette &#233;tude, nous nous sommes appuy&#233;e sur les cent premi&#232;res formes les plus fr&#233;quentes de chaque 
texte. Les monosyllabes et dissyllabes sont les plus nombreux au sein des deux corpus. Dans Constitution,
les dissyllabes sont plus nombreux que les monosyllabes (figure 4). Les polysyllabes (trois syllabes ou 
plus) sont beaucoup moins nombreux. On note tout de m&#234;me que les pentasyllabes sont particuli&#232;rement 
remarquables dans Hylanda. Le segmenteur ST_CTB poss&#232;de peu de quadrisyllabes et aucun pentasyllabe. 
</p>
<p>Dans le corpus Presse (figure 5), les monosyllabes sont plus nombreux que les dissyllabes par rapport au 
texte Constitution. Mais ils sont dominants dans le corpus. Au contraire, les quadrisyllabes sont beaucoup 
moins nombreux, un seul quadrisyllabe appara&#238;t dans le segmenteur ICTCLAS et aucun de pentasyllabes.
</p>
<p>0
10
20
30
40
50
60
70
</p>
<p>HL IC SF_CTB SF_PKU Segmenteurs
</p>
<p>Nb
 de
</p>
<p> fo
rm
</p>
<p>es
</p>
<p>1  syllabe
2  syllabes
3  syllabes
4  syllabes
5  syllabes et plus
</p>
<p>0
10
20
</p>
<p>30
40
50
60
</p>
<p>HL IC SF_CTB SF_PKU Segmenteurs
</p>
<p>Nb
 de
</p>
<p> fo
rm
</p>
<p>es
</p>
<p>1  syllabe
2  syllabes
3  syllabes
4  syllabes
5  syllabes et plus
</p>
<p>Figure 4 : R&#233;partition des formes par segmenteur 
sur les cent premi&#232;res formes les plus 
fr&#233;quentes de Constitution
</p>
<p>Figure 5 : R&#233;partition des formes par segmenteur 
sur les cent premi&#232;res formes les plus 
fr&#233;quentes de Presse
</p>
<p>3.3.2 Le nombre de syllabes
</p>
<p>Afin de calculer le nombre de syllabes dans l&#8217;ensemble des corpus dans chaque segmenteur, nous avons eu 
recours &#224; la fonction &#171; groupe de forme &#187; de Lexico311. Les groupes de formes sont des unit&#233;s textuelles 
d&#233;finies par l&#8217;utilisateur &#224; l&#8217;aide d&#8217;outils automatiques. Cela permet de regrouper les occurrences de formes 
graphiques diff&#233;rentes mais li&#233;es par une propri&#233;t&#233; commune dans le texte, comme la flexion, la d&#233;rivation, 
etc.
</p>
<p>L&#8217;analyse de la fr&#233;quence des mots comprenant plus de trois syllabes montre que plus le nombre de 
syllabes augmente plus la fr&#233;quence de ces mots-l&#224; diminue. Il existe donc un lien entre la fr&#233;quence d&#8217;un 
mot et son nombre de syllabes. Zipf (1949) parle de &#171; principe du moindre effort &#187; qui est que le nombre 
de syllabes tend &#224; &#234;tre inversement proportionnel &#224; la fr&#233;quence d&#8217;utilisation d&#8217;un mot. Autrement dit, que 
les mots les plus couramment utilis&#233;s sont les plus courts. Nous avons obtenu les deux graphes pr&#233;sent&#233;s 
par les figures 6 et 7 selon ce principe du moindre effort. Les graphes montrent que la r&#233;partition de la 
longueur des mots correspond au principe de Zipf en faisant abstraction des dissyllabes, de plus en plus 
fr&#233;quents en chinois contemporain. Les quatre courbes de Presse sont tr&#232;s semblables : elles se pr&#233;sentent 
comme un graphe harmonieux. Rappelons que les monosyllabes sont plus nombreux que les dissyllabes 
(cf. figure 5), ce qui n&#8217;est pas le cas ici dans l&#8217;ensemble du corpus, nous avons examin&#233; la liste des cents 
premi&#232;res formes les plus fr&#233;quentes, elles sont les mots grammaticaux &#171;&#30340; de (de)12 &#187;, &#171;&#20102; le (particule 
</p>
<p>                                                
11 Lexico3, outil d&#8217;analyse des donn&#233;es textuelles, est d&#233;velopp&#233; par l&#8217;&#233;quipe universitaire SYLED-CLA2T (Syst&#232;mes 
</p>
<p>Linguistiques Enonciation et Discours, Centre de Lexicom&#233;trie et d&#8217;Analyse Automatique des Textes). Le logiciel a &#233;t&#233; 
con&#231;u par Andr&#233; Salem, professeur de l&#8217;Universit&#233; Paris III. http://www.cavi.univ-paris3.fr/Ilpga/ilpga/tal/lexicoWWW/
(page consult&#233;e le 6 janvier 2010).
</p>
<p>12 Le caract&#232;re chinois est suivi de la transcription pinyin en italique et de la traduction en fran&#231;ais entre parenth&#232;ses.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LI-CHI WU
aspectuelle) &#187;13, les verbes monosyllabiques &#171;&#26159; shi (&#234;tre) &#187;, &#171;&#26377; you (avoir) &#187;, &#171;&#35201; yao (vouloir) &#187;, les 
conjonctions de coordination &#171;&#19982; yu (et) &#187;, &#171;&#21644; han (et) &#187;, les pr&#233;positions &#171;&#21521; xiang (&#224;, pour) &#187;, &#171;&#22312; zai
(&#224;) &#187;, &#171;&#23545; dui (pour) &#187;, les pronoms &#171;&#25105; wo (je) &#187;, &#171;&#20320; ni (tu) &#187;, la n&#233;gation adverbiale &#171;&#19981; bu (ne &#8230;
pas) &#187;, etc. Ce sont des mots courants dans un texte g&#233;n&#233;ral, mais plut&#244;t rares dans un texte du domaine 
sp&#233;cialis&#233; comme Constitution. Dans ce dernier, on trouve plut&#244;t des mots pleins (des dissyllabes sont 
majoritaires dans le chinois contemporain, cf. figure 4), au contraire, les mots vides y sont peu fr&#233;quents.
</p>
<p>Les courbes de Constitution sont dissemblables (figure 6). Les plus grandes diff&#233;rences sont relev&#233;es entre 
les monosyllabes et les dissyllabes ainsi qu&#8217;entre les trissyllabes et les pentasyllabes. Par contre, les 
courbes d&#8217;ICTCLAS (rose) et de SF_PKU (bleu turquoise) se superposent quasiment, les fr&#233;quences des 
mots pour un nombre de syllabes donn&#233; est quasi similaire.
</p>
<p>Le choix de deux domaines diff&#233;rents pour chacun des deux corpus a permis de mettre en &#233;vidence 
l&#8217;influence du type de texte d&#8217;une part sur la r&#233;partition des mots et d&#8217;autre part sur la variation du nombre 
de syllabes des mots. Les textes du domaine sp&#233;cifique sont plus remarquables en ce qui concerne la 
diff&#233;rence entre le nombre de syllabes par rapport aux textes g&#233;n&#233;raux comme Presse.
</p>
<p>0
1000
2000
3000
4000
5000
6000
</p>
<p>1 2 3 4 5 6 7 8 9 10 13 Syllabes
</p>
<p>Fr
eq
</p>
<p>ue
nc
</p>
<p>es Hylanda
Ictclas
SF_CTB
SF_PKU
</p>
<p>0
1000
2000
3000
4000
5000
6000
</p>
<p>1 2 3 4 5 6 7 8 9 10 11 Syllabes
</p>
<p>Fr
eq
</p>
<p>ue
nc
</p>
<p>es Hylanda
Ictclas
SF_CTB
SF_PKU
</p>
<p>Figure 6 : Effectif des mots en fonction du nombre 
de syllabes dans Constitution
</p>
<p>Figure 7 : Effectif des mots en fonction du nombre 
de syllabes dans Presse
</p>
<p>3.3.3 Analyse par syllabe
</p>
<p>Nous proposons maintenant une &#233;tude plus approfondie des sous-parties du corpus. La fonction groupe de 
formes de Lexico3 permet d&#8217;acqu&#233;rir une cha&#238;ne de caract&#232;res contenant le nombre de syllabes &#224; rechercher 
au moyen d&#8217;une expression rationnelle14. La figure 8 param&#233;tr&#233;e par termes de sp&#233;cificit&#233;s15 permet de 
faire une synth&#232;se de la ventilation du nombre de syllabes des mots d&#233;coup&#233;s du corpus Constitution. La 
sp&#233;cificit&#233; de telle ou telle syllabe en fonction d&#8217;un segmenteur donn&#233; appara&#238;t &#233;galement dans cette figure 
8. Les formes de plus de cinq syllabes sont en nombre relativement &#233;lev&#233; dans le texte segment&#233; par 
                                                
13 Comme les mots chinois sont invariables, les verbes n&#8217;ont aucune conjugaison. Pour exprimer le temps ou l&#8217;aspect en chinois, 
</p>
<p>on emploie des particules. Il existe trois particules &#171;&#36807; &#187;, &#171;&#20102; &#187;, et &#171;&#30528; &#187; qui marquent respectivement l&#8217;exp&#233;rience v&#233;cu, 
l&#8217;action accomplie et une action qui se prolonge dans la dur&#233;e. Les trois particules d&#8217;aspect sont toujours pr&#233;c&#233;d&#233;es de verbes.
</p>
<p>14 Le motif de l&#8217;expression rationnelle pour trouver une syllabe (ou un caract&#232;re chinois) dans une cha&#238;ne de caract&#232;res est 
&#171; ^.{2}$ &#187;, c'est-&#224;-dire que l&#8217;on cherche une cha&#238;ne de caract&#232;res qui d&#233;bute par n&#8217;importe quel caract&#232;re qui contient deux 
octets et qui termine cette cha&#238;ne. Un caract&#232;re chinois contient deux octets dans le codage de caract&#232;res que nous utilisons, 
pour chercher deux syllabes, le chiffre 2 est remplac&#233; par le chiffre 4, etc. Les deux corpus ne contiennent pas de caract&#232;res 
non chinois, de plus, les ponctuations chinoises ont &#233;t&#233; retir&#233;es lors de la recherche des syllabes.
</p>
<p>15 La m&#233;thode de &#171; sp&#233;cificit&#233; &#187; montre les mots les plus caract&#233;ristiques dans un corpus ou dans une partie du corpus. Cette 
m&#233;thode est propos&#233;e par Pierre Lafon (1980, 1984). Elle mesure &#171; les variations de la fr&#233;quence dans un corpus d&#233;coup&#233; en 
parties, en fonction d&#8217;un seuil choisi par l&#8217;analyste, il indique si la fr&#233;quence observ&#233;e dans telle ou telle partie peut-&#234;tre 
consid&#233;r&#233;e comme normale ou non. &#187;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>OUTILS DE SEGMENTATION DU CHINOIS ET TEXTOMETRIE
Hylanda alors que l&#8217;on en trouve tr&#232;s peu dans le texte de SF_CTB. Les quadrisyllabes apparus dans le 
texte de SF_PKU et d&#8217;ICTCLAS arrivent en second. Les dissyllabes sont en grand nombre dans le texte de 
SF_CTB, au contraire, il en existe un petit nombre dans le texte de Hylanda par rapport &#224; SF_CTB. Les 
monosyllabes sont relativement plus nombreux dans Hylanda.
</p>
<p>Quant &#224; Presse (figure 9), les formes poss&#233;dant plus de quatre syllabes sont relativement importantes dans 
Hylanda, sp&#233;cialement pour les quadrisyllabes. Le segmenteur ICTCLAS est plus apte &#224; d&#233;tecter les formes 
</p>
<p>de cinq syllabes et plus. Elles sont au contraire moins nombreuses dans SF_CTB. Les 
trisyllabes sont remarquables dans SF_CTB. Quant aux dissyllabes, ils sont plus 
nombreux dans SF_PKU, mais la proportion de monosyllabes est relativement moins 
importante.
</p>
<p>Figure 8 : Ventilation des mots d&#8217;une syllabe &#224; plus de 
cinq syllabes dans Constitution
</p>
<p>Figure 9 : Ventilation des mots d&#8217;une syllabe &#224; plus de 
cinq syllabes dans Presse
</p>
<p>3.3.4 Pentasyllabes
</p>
<p>Hylanda montre une proportion tr&#232;s importante de polysyllabes (cinq syllabes et plus) dans les figures 8 et 
9 class&#233;s par termes de sp&#233;cificit&#233;s. Cela nous pousse &#224; envisager une observation plus soigneuse. La 
concordance fournie par Lexico3 repr&#233;sente des termes sp&#233;cialis&#233;s polysyllabiques pour le texte Hylanda 
en grand nombre dans Constitution, p. ex. &#20013;&#21326;&#20154;&#27665;&#20849;&#21644;&#22269; zhonghua renmin gongheguo (R&#233;publique 
populaire de Chine) ; &#20840;&#22269;&#20154;&#27665;&#20195;&#34920;&#22823;&#20250; quanguo renmin daibiao dahui (assembl&#233;e nationale populaire)
&#26368;&#39640;&#20154;&#27665;&#27861;&#38498; zuigao renmin fayuan (cour supr&#234;me de justice) ; &#20840;&#22269;&#20154;&#27665;&#20195;&#34920;&#22823;&#20250;&#24120;&#21153;&#22996;&#21592;&#20250; quanguo 
renmin daibiao dahui changwu weiyuanhui (comit&#233; permanent de l&#8217;assembl&#233;e nationale populaire). 
Hylanda segmente de fa&#231;on appropri&#233;e les termes sp&#233;cialis&#233;s du corpus Constitution. Cela pourrait aider 
sp&#233;cifiquement &#224; la recherche de la terminologie : Hylanda para&#238;t donc plus performant dans ce domaine 
que les trois autres segmenteurs.
</p>
<p>Nous avons proc&#233;d&#233; selon la m&#234;me m&#233;thode pour le segmenteur SF_CTB, &#233;tant donn&#233; qu&#8217;il a un taux tr&#232;s 
bas de quadrisyllabes et de pentasyllabes en opposition &#224; un fort taux de dissyllabes. Les noms propres 
segment&#233;s correctement par Hylanda sont ici d&#233;coup&#233;s &#224; l&#8217;int&#233;rieur de la cha&#238;ne de caract&#232;res en plusieurs 
formes graphiques, p. ex. la forme&#20013;&#21326;&#20154;&#27665;&#20849;&#21644;&#22269; (R&#233;publique populaire de Chine) est d&#233;coup&#233;e en trois 
formes comme &#20013;&#21326;_&#20154;&#27665;_&#20849;&#21644;&#22269; (Chine_peuple_r&#233;publique16). Les formes de quatre ou cinq syllabes 
                                                
16 Le symbole tiret bas &#171; _ &#187; sert ici &#224; indiquer la fronti&#232;re d&#8217;une unit&#233; lexicale.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LI-CHI WU
sont simplement les expressions temporelles, p. ex. &#19968;&#20843;&#22235;&#65296;&#24180; yi ba si ling nian (l&#8217;ann&#233;e 1840, 
litt&#233;ralement, 1840 suivi du mot ann&#233;e) et les num&#233;rotations des articles de la Constitution, p. ex. &#31532;&#19968;&#30334;
&#38646;&#19968; di yi bai ling yi (article 101, litt&#233;ralement un pr&#233;fixe servant &#224; former les nombres ordinaux suivi du 
nombre 101). Ce ne sont pas des termes sp&#233;cifiques du corpus. Par ailleurs, parmi les polysyllabes 
segment&#233; par Hylanda, certains qui sont des termes non sp&#233;cifiques du domaine ont attir&#233; notre attention.
Ce sont des collocations, c'est-&#224;-dire la combinaison de deux termes ou plus qui sont fr&#233;quemment utilis&#233;s. 
Par exemple, &#19981;&#24184;&#36935;&#38590;&#32773; buxing yunanzhe (des victimes) est compos&#233; de &#19981;&#24184; buxing (malheur) et &#36935;&#38590;
&#32773; yunanzhe (victime). Ce ph&#233;nom&#232;ne pourrait &#234;tre abord&#233; dans une &#233;tude subs&#233;quente.
</p>
<p>D&#8217;apr&#232;s cette &#233;tude textom&#233;trique de deux corpus en quatre segmentations, Hylanda appara&#238;t comme un 
outil pertinent dans la segmentation des noms propres et plus particuli&#232;rement dans un domaine sp&#233;cifique. 
La segmentation de SF_CTB serait plut&#244;t fine, c'est-&#224;-dire que la longueur moyenne des segments est plus 
limit&#233;e. Les deux autres segmenteurs peuvent &#234;tre qualifi&#233;s d&#8217;interm&#233;diaires, aucune sp&#233;cificit&#233; n&#8217;ayant &#233;t&#233; 
mise en &#233;vidence.
</p>
<p>4 R&#233;sultats
</p>
<p>4.1 Processus d&#8217;&#233;valuation
Notre objectif est de d&#233;terminer quel type de texte est le plus adapt&#233; pour chaque segmenteur. Afin 
d&#8217;&#233;valuer nos analyses, nous avons segment&#233; manuellement (&#233;tant native chinoise) en se r&#233;f&#233;rant au 
Dictionnaire du Chinois Moderne (&#29616;&#20195;&#27721;&#35821;&#35789;&#20856; xiandai hanyu cidian), dictionnaire d&#8217;autorit&#233; dans la 
langue chinoise. Ensuite, nous avons compar&#233; cette segmentation manuelle avec les quatre segmentations 
sur les deux corpus. De plus, nous avons compar&#233; les noms propres, sp&#233;cialement les noms propres de 
personnes en chinois et la traduction litt&#233;rale des noms &#233;trangers et &#233;galement les termes sp&#233;cialis&#233;s du 
domaine du corpus. Les formes segment&#233;es par les outils qui sont pr&#233;sentes et identiques dans la version 
manuelle sont consid&#233;r&#233;es comme pertinentes alors que les autres sont soit une segmentation diff&#233;rente, 
effectu&#233;e selon les r&#232;gles de l&#8217;outil, soit une segmentation erron&#233;e. La segmentation manuelle est bas&#233;e sur 
l&#8217;introspection de la personne native et sur sa connaissance de la langue, et privil&#233;gie le sens complet d&#8217;une 
forme en tenant compte du domaine du texte. Par exemple, dans le corpus Constitution, &#20013;&#21326;&#20154;&#27665;&#20849;&#21644;&#22269;
(R&#233;publique populaire de Chine) est segment&#233; comme une forme lexicale au lieu d&#8217;&#234;tre d&#233;coup&#233;e en trois 
formes comme &#20013;&#21326;_&#20154;&#27665;_&#20849;&#21644;&#22269; (Chine_peuple_r&#233;publique).
</p>
<p>4.2 Pr&#233;sentation des r&#233;sultats
Le tableau 1 pr&#233;sente la pr&#233;cision des unit&#233;s lexicales segment&#233;es par les segmenteurs par rapport &#224; la 
segmentation manuelle. La bonne performance doit &#234;tre interpr&#233;t&#233;e en fonction du contexte et de la 
segmentation manuelle effectu&#233;e. La proportion de formes segment&#233;es pertinentes est plus importante dans 
le corpus g&#233;n&#233;ral que dans le corpus sp&#233;cialis&#233;. Dans les deux corpus, la segmentation de Hylanda est la 
plus proche de la segmentation manuelle. SF_CTB est le plus &#233;loign&#233; du d&#233;coupage manuel pour le corpus 
sp&#233;cialis&#233; Constitution. Au contraire, il atteint une performance assez bonne de segmentation pour le 
corpus g&#233;n&#233;ral Presse. ICTCLAS et SF_PKU sont interm&#233;diaires et n&#8217;ont pas de trait distinctif. Ils ont une 
pr&#233;cision assez proche pour les deux corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>OUTILS DE SEGMENTATION DU CHINOIS ET TEXTOMETRIE
Constitution Presse
</p>
<p>Hylanda 93,5 % 96,7 %
</p>
<p>ICTCLAS 92,4 % 93,1 %
</p>
<p>SF_CTB 87,5 % 95,1 %
</p>
<p>SF_PKU 91,9 % 93,6 %
</p>
<p>Tableau 1 : &#201;valuation de la segmentation des segmenteurs pour les deux corpus (pr&#233;cision)
</p>
<p>La segmentation des mots inconnus est toujours une t&#226;che difficile dans le TAL. Nous avons &#233;galement 
&#233;valu&#233; ces deux corpus en comptant les noms propres qui y sont pr&#233;sents (tableau 2). &#201;tant donn&#233; les textes 
de loi du pays comme Constitution, de nombreux termes d&#8217;institutions de l&#8217;&#201;tat ou d&#8217;organisations ayant 
des termes locaux sont apparus (88,3 % pour Hylanda, 42,2 % pour ICTCLAS, 0 % pour SF_CTB, 33 % 
pour SF_PKU). Notons que ces termes sp&#233;cialis&#233;s sont entre quatre et treize syllabes. Hylanda a une bonne 
performance, alors que ICTCLAS et SF_PKU ont des r&#233;sultats assez faibles. En revanche, SF_CTB n&#8217;est 
pas du tout sp&#233;cialis&#233; dans la segmentation des textes de loi. Par contre, SF_CTB et ICTCLAS montrent un 
tr&#232;s bon r&#233;sultat dans Presse, aussi bien pour les noms propres de personnes chinois que pour la 
translitt&#233;ration des noms &#233;trangers17. Au contraire, Hylanda est plut&#244;t faible dans la segmentation des noms 
propres de personne dans Presse. Cette &#233;valuation manuelle met en &#233;vidence l&#8217;utilit&#233; de l&#8217;&#233;tude de ces 
segmenteurs. Cette exp&#233;rience de petite taille sur deux corpus r&#233;v&#232;le un trait distinctif entre les 
segmenteurs. Il serait int&#233;ressant d&#8217;&#233;tendre notre &#233;tude &#224; d&#8217;autres ph&#233;nom&#232;nes linguistiques chinois en 
&#233;valuant ces segmenteurs sur des corpus plus volumineux.
</p>
<p>Segmenteurs Constitution Presse
</p>
<p>Noms propres du domaine Noms propres de personnes 
chinois
</p>
<p>Noms propres de personnes 
&#233;trangers
</p>
<p>Manuel 327 63 32
</p>
<p>Hylanda 289 14 19
</p>
<p>ICTCLAS 138 61 28
</p>
<p>SF_CTB 0 63 30
</p>
<p>SF_PKU 108 18 21
</p>
<p>Tableau 2 : Nombre de noms propres segment&#233;s dans les deux corpus
</p>
<p>                                                
17 Les noms propres de personne en chinois sont compos&#233;s en premier le patronyme monosyllabique en majorit&#233;, ou 
</p>
<p>dissyllabiques suivi du pr&#233;nom correspondant &#224; la longueur d&#8217;une ou de deux syllabes. Ils sont form&#233;s de longueur de deux &#224; 
quatre syllabes, g&#233;n&#233;ralement de trois syllabes. Par ailleurs, les femmes mari&#233;es portent le nom de famille de leurs maris 
suivi du nom de jeune fille puis du pr&#233;nom, quatre syllabes sont majoritaires. La translitt&#233;ration des noms &#233;trangers est 
interpr&#233;t&#233;e soit par un patronyme seulement, soit par un pr&#233;nom suivi du patronyme. Ce dernier est ins&#233;r&#233; un point m&#233;dian 
pour s&#233;parer un pr&#233;nom et un patronyme comme &#171; Jacques Ren&#233; Chirac &#187; est translitt&#233;r&#233;e en chinois &#171;&#38597;&#20811;&#183;&#21202;&#20869;&#183;&#24076;&#25289;&#20811; &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LI-CHI WU
5 Conclusion
Cette comparaison de segmenteurs sur deux corpus de th&#232;mes diff&#233;rents parvient &#224; une bonne qualit&#233; 
d&#8217;analyse. Notre &#233;tude bas&#233;e sur le nombre de syllabes du chinois a permis de distinguer un segmenteur
plus performant pour les textes sp&#233;cialis&#233;s, et un autre segmenteur plus pertinent pour les textes g&#233;n&#233;raux. 
Les deux autres segmenteurs sont apparus relativement similaires, ce qui est justifi&#233; &#233;tant donn&#233; qu&#8217;ils sont 
fond&#233;s sur la norme de l&#8217;&#201;tat de Chine. Leur performance est interm&#233;diaire par rapport aux deux premiers. 
L&#8217;&#233;valuation de la comparaison de ces quatre segmenteurs au moyen de la segmentation manuelle affirme 
que la m&#233;thodologie est pertinente dans le cadre de l&#8217;&#233;tude.
</p>
<p>L&#8217;&#233;tude sur le nombre de syllabes en chinois ouvre des portes dans la recherche en textom&#233;trie sur la 
comparaison des outils de segmentation. Une &#233;tude approfondie sur la variation du nombre de syllabes 
pourrait d&#233;terminer si celle-ci est li&#233;e &#224; la linguistique chinoise.
</p>
<p>L&#8217;exploration textom&#233;trique des textes chinois a d&#233;j&#224; franchi certains obstacles dus &#224; la complexit&#233; du 
syst&#232;me d&#8217;&#233;criture de la langue chinoise. Les r&#233;sultats favorables de cette &#233;tude nous am&#232;nent &#224; 
approfondir le ph&#233;nom&#232;ne de collocation et d&#8217;entit&#233;s nomm&#233;es dans la segmentation et &#224; nous demander si 
la cat&#233;gorie grammaticale est un trait pertinent dans la segmentation de la langue.
</p>
<p>R&#233;f&#233;rences
ALLETON, V. (1994). Le nombre de syllabes d&#8217;un mot est-il pertinent en chinois contemporain ? Cahiers de
linguistique - Asie orientale, 23(1), 5-11.
</p>
<p>FLEURY, S., ZIMINA, M. (2009). mkAlign, Manuel d&#8217;utilisation. EA2290 SYLED/CLA2T Universit&#233;
Sorbonne Nouvelle - Paris 3.
</p>
<p>HUANG, Z., YANG, J. (&#40643;&#24535;&#24375;, &#26954;&#21133;&#27211;) (1990). Lun hanyu shuangyinjiehua de yuanyin &#35542;&#28450;&#35486;&#35422;&#24409;&#38617;&#38899;
&#31680;&#21270;&#30340;&#21407;&#22240; (&#201;tude du dissyllabisme des mots chinois). &#24489;&#26086;&#23416;&#22577; (&#31038;&#26371;&#31185;&#23416;&#29256;) Fudan Journal (Social 
Sciences Edition), (1), 98-101.
</p>
<p>LAFON, P. (1980). Sur la variabilit&#233; de la fr&#233;quence des formes dans un corpus. Mots, (1), 127-165.
</p>
<p>LAFON, P. (1984). D&#233;pouillements et statistiques en lexicom&#233;trie. Travaux de linguistique quantitative. 
Gen&#232;ve : Slatkine.
</p>
<p>LIANG, N. (&#26753;&#21335;&#20803;) (1984). Shumian hanyu de zidong fenci yu yige zidong fenci xitong - CDWS &#26360;&#38754;&#28450;
&#35486;&#30340;&#33258;&#21205;&#20998;&#35422;&#33287;&#19968;&#20491;&#33258;&#21205;&#20998;&#35422;&#31995;&#32113; - CDWS (Written Chinese automatic distinguishing word &amp; a 
automatic distinguishing words system - CDWS). &#21271;&#20140;&#33322;&#31354;&#33322;&#22825;&#22823;&#23416;&#23416;&#22577; (Journal of Beijing University 
of Aeronautics and Astronautics), (4), 97-104.
</p>
<p>TSENG, H., CHANG, P., ANDREW, G., JURAFSKY, D., MANNING, C. (2005). A conditional random field word 
segmenter. In Proceedings of Fourth SIGHAN Workshop on Chinese Language Processing, 168-171.
</p>
<p>WANG, H. (&#29579;&#21270;&#40527;) (2000). Lun xiandai hanyuci de shuangyinjiehua ji qi fazhan guil&#252; &#35542;&#29694;&#20195;&#28450;&#35486;&#35422;&#30340;
&#38617;&#38899;&#31680;&#21270;&#21450;&#20854;&#30332;&#23637;&#35215;&#24459; (On the disyllabe superiority of modern Chinese and its developing laws). &#21271;&#26041;
&#35542;&#21474; (The Northern Forum), 164(6), 120-125.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>OUTILS DE SEGMENTATION DU CHINOIS ET TEXTOMETRIE
WANG, L. (&#29579;&#21147;) (1984). Zhongguo yufa &#20013;&#22283;&#35486;&#27861; (Grammaire chinoise). Shandong : Shandong 
chubanshe.
</p>
<p>XIA, F. (2000). The segmentation guidelines for the Penn Chinese Treebank (3.0) (Technical Report IRCS 
Report 00-06). University of Pennsylvania.
</p>
<p>YU, S., ZHU, X., DUAN, H. (&#20446;&#22763;&#27766;, &#26417;&#23416;&#37586;, &#27573;&#24935;&#26126;) (2000). Daguimo xiandai hanyu biaozhu yuliaoku de 
jiagong guifan &#22823;&#35215;&#27169;&#29694;&#20195;&#28450;&#35486;&#27161;&#27880;&#35486;&#26009;&#24235;&#30340;&#21152;&#24037;&#35215;&#31684; (The guideline for segmentation and part of 
speech tagging on very large scale corpus of contemporary Chinese). &#20013;&#25991;&#20449;&#24687;&#23416;&#22577; (Journal of Chinese 
Information Processing), (6), 58-64.
</p>
<p>ZHANG, H., LIU, Q., CHENG, X., ZHANG, H., YU, H. (2003). Chinese lexical analysis using hierarchical 
hidden markov model. In Proceeding of the Second SIGHAN Workshop on Chinese Language Processing,
63-70.
</p>
<p>ZHU, D. (&#26417;&#24503;&#29081;) (1982). Yufa jiangyi &#35486;&#27861;&#35611;&#32681; (Lectures on grammar). P&#233;kin : Shangwu yinshu guan.
ZIPF, G. K. (1949). Human behavior and the principle of least effort : an introduction to human ecology. 
Cambridge MA : Addison-Wesley.</p>

</div></div>
</body></html>