<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Architecture modulaire portable pour la g&#233;n&#233;ration du langage naturel en dialogue homme-machine</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Architecture modulaire portable pour la g&#233;n&#233;ration
du langage naturel en dialogue homme-machine
</p>
<p>Vladimir POPESCU1,2
1 Laboratoire d&#8217;Informatique de Grenoble, France
2 Universit&#233; &#171; Politehnica &#187; de Bucarest, Roumanie
</p>
<p>Vladimir.Popescu@imag.fr
</p>
<p>R&#233;sum&#233;. La g&#233;n&#233;ration du langage naturel pour le dialogue oral homme-machine pose des
contraintes sp&#233;cifiques, telles que la spontan&#233;it&#233; et le caract&#232;re fragment&#233; des &#233;nonc&#233;s, les types
des locuteurs ou les contraintes de temps de r&#233;ponse de la part du syst&#232;me. Dans ce contexte,
le probl&#232;me d&#8217;une architecture rigoureusement sp&#233;cifi&#233;e se pose, autant au niveau des &#233;tapes
de traitement et des modules impliqu&#233;s, qu&#8217;au niveau des interfaces entre ces modules. Afin de
permettre une libert&#233; quasi-totale &#224; l&#8217;&#233;gard des d&#233;marches th&#233;oriques, une telle architecture doit
&#234;tre &#224; la fois modulaire (c&#8217;est-&#224;-dire, permettre l&#8217;ind&#233;pendance des niveaux de traitement les uns
des autres) et portable (c&#8217;est-&#224;-dire, permettre l&#8217;interop&#233;rabilit&#233; avec des modules con&#231;us selon
des architectures standard en g&#233;n&#233;ration du langage naturel, telles que le mod&#232;le RAGS - &#171; Re-
ference Architecture for Generation Systems &#187;). Ainsi, dans cet article on pr&#233;sente de mani&#232;re
concise l&#8217;architecture propos&#233;e, la comparant ensuite au mod&#232;le RAGS, pour argumenter les
choix op&#233;r&#233;s en conception. Dans un second temps, la portabilit&#233; de l&#8217;architecture sera d&#233;crite
&#224; travers un exemple &#233;tendu, dont la g&#233;n&#233;ralit&#233; r&#233;side dans l&#8217;obtention d&#8217;un ensemble de r&#232;gles
permettant de plonger automatiquement les repr&#233;sentations des informations de notre architec-
ture vers le format du mod&#232;le RAGS et inversement. Finalement, un ensemble de conclusions
et perspectives cl&#244;turera l&#8217;article.
</p>
<p>Abstract. Natural language generation for human-computer dialogue imposes specific
constraints, such as the spontaneous and fragmented character of the utterances, speaker types
or constraints related to the system&#8217;s time of response. In this context, the issue of a thouroughly
specified architecture stems naturally, with respect to the processing stages in the modules in-
volved and to the interfaces between these modules as well. In order to allow for a quasi-total
freedom concerning the theoretical principles driving the processing stages, such an architecture
must be modular (i.e., allowing the independence of the modules of each other) and portable
(i.e., allowing a certain interoperability between modules designed following this architecture
and existing modules, designed following standard, reference architectures, such as the RAGS
model). Thus, in this paper firstly the proposed architecture will be presented in a concise man-
ner, comparing it then to the RAGS model and arguing for the design choices being made. Af-
terwards, the portability of the architecture will be described, via an extended example whose
general character resides in the fact that a set of rules are obtained, that allow automatic transla-
tions between representation formats in our architecture and in the RAGS model, in both ways.
Finally, a set of conclusions and pointers to further work end up the paper.
</p>
<p>Mots-cl&#233;s : g&#233;n&#233;ration, dialogue, architecture modulaire, portabilit&#233;, XML.
Keywords: generation, dialogue, modular architecture, portability, XML.
</p>
<p>407</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir POPESCU
</p>
<p>1 Introduction
</p>
<p>Nos recherches se situent dans le cadre de la g&#233;n&#233;ration du langage naturel pour le dialogue oral
homme-machine et concernent le d&#233;veloppement d&#8217;un module de g&#233;n&#233;ration du langage naturel
pour donner un caract&#232;re aussi &#171; naturel &#187; et expressif que possible aux r&#233;ponses langagi&#232;res
du syst&#232;me face aux requ&#234;tes des usagers. Ce travail poursuit ainsi des recherches commenc&#233;es
depuis plusieurs ann&#233;es (Imberdis &amp; Caelen, 1997). Le probl&#232;me n&#8217;est pas simple, car la plu-
part des g&#233;n&#233;rateurs textuels existants sont con&#231;us pour des situations de monologue, et il s&#8217;y
ajoutent le caract&#232;re spontan&#233; et fragment&#233; du dialogue, auquel des contraintes de pertinence,
expressivit&#233; et temps de r&#233;ponse se conjuguent (McTear, 2002).
</p>
<p>Ainsi, nous consid&#233;rons (Popescu et al., 2007) que la r&#233;ponse du syst&#232;me se situe &#224; cinq ni-
veaux auxquels le langage naturel peut &#234;tre &#171; produit &#187; par un syst&#232;me de dialogue : (i) le
niveau logique instanti&#233; dans un contr&#244;leur de dialogue et ne faisant pas partie du g&#233;n&#233;rateur,
mais fournissant l&#8217;intention communicationnelle &#224; mettre sous forme linguistique, (ii) le niveau
pragmatique g&#233;rant les aspects li&#233;s &#224; l&#8217;expressivit&#233; des &#233;nonc&#233;s et &#224; leur pertinence par rapport
au contexte dialogique, (iii) le niveau linguistique produisant le texte pour l&#8217;intention commu-
nicationnele, (iv) le niveau expressif calculant la forme finale de l&#8217;&#233;nonc&#233; et la prosodie, et (v)
le niveau acoustique r&#233;alisant la synth&#232;se de la parole proprement dite.
</p>
<p>L&#8217;architecture con&#231;ue pour la g&#233;n&#233;ration dans le cadre du dialogue homme-machine part d&#8217;un
ensemble de principes :
</p>
<p>1. prendre en compte les aspects pragmatiques (rh&#233;toriques - structuration discursive et ex-
pressifs - valences &#233;motionnelles) et la gestion des tours de parole (dialogue oral spon-
tan&#233;), ainsi que les particularit&#233;s des locuteurs ;
</p>
<p>2. consid&#233;rer surtout les performances des agents du dialogue (en d&#233;pit des normes de com-
p&#233;tence qui varient d&#8217;un contexte (social, situationnel, etc.) &#224; l&#8217;autre et ne sont donc pas
g&#233;n&#233;riques) ;
</p>
<p>3. s&#8217;appuyer sur un corpus de dialogues r&#233;els entre humains et entre homme et machine (en
d&#233;pit des prescriptions grammaticales fix&#233;es a priori) pour contr&#244;ler les aspects linguis-
tiques en g&#233;n&#233;ration ;
</p>
<p>4. rendre les traitements appropri&#233;s &#224; un fonctionnement en temps r&#233;el (et donc &#233;viter des
processus d&#8217;inf&#233;rence relativement co&#251;teux) ;
</p>
<p>5. diminuer autant que possible la d&#233;pendance &#224; la t&#226;che et &#224; la langue, en permettant des
param&#233;trages ais&#233;s ;
</p>
<p>6. rendre les niveaux de traitement de la parole aussi ind&#233;pendants que possible des traite-
ments purement textuels.
</p>
<p>Le premier point des d&#233;sid&#233;rata ci-dessus est r&#233;alis&#233; dans le g&#233;n&#233;rateur pragmatique, o&#249; les
aspects rh&#233;toriques-discursifs sont g&#233;r&#233;s par l&#8217;utilisation adapt&#233;e de la th&#233;orie SDRT (&#171; Seg-
mented Discourse Representation Theory &#187;) (Asher &amp; Lascarides, 2003), tandis que les aspects
expressifs au niveau de chaque &#233;nonc&#233; sont g&#233;r&#233;s par le contr&#244;le du &#171; degr&#233; de puissance de
la force illocutoire &#187;. De plus, on pr&#233;voit la prise en compte, dans le g&#233;n&#233;rateur pragmatique,
d&#8217;un doublet d&#8217;attributs caract&#233;risant chaque partenaire du dialogue (en termes de niveau de
familiarit&#233; par rapport au dialogue courant et de relation sociale de l&#8217;un avec l&#8217;autre).
</p>
<p>Le cinqui&#232;me point est r&#233;alis&#233; par le fait que, autant au niveau pragmatique que linguistique, les
m&#233;thodes utilis&#233;es sont ind&#233;pendantes de la t&#226;che et de la langue (supposant en fin de compte
</p>
<p>408</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Architecture modulaire portable pour la g&#233;n&#233;ration du LN en dialogue homme-machine
</p>
<p>conceptuel
Niveau
</p>
<p>    LOGIQUE
GENERATEUR
</p>
<p>PRAGMATIQUE
GENERATEUR
</p>
<p>D
O
</p>
<p>CU
M
</p>
<p>EN
T
</p>
<p> 
 
</p>
<p> 
 
</p>
<p> 
 
</p>
<p> 
 
</p>
<p> 
D
</p>
<p>U
PL
</p>
<p>A
N
</p>
<p>IF
IC
</p>
<p>A
TI
</p>
<p>O
N
</p>
<p>LINGUISTIQUE
GENERATEUR
</p>
<p>RE
A
</p>
<p>LI
SA
</p>
<p>TI
O
</p>
<p>N
SU
</p>
<p>PE
RF
</p>
<p>IC
IE
</p>
<p>LL
E
</p>
<p>M
IC
</p>
<p>RO
PL
</p>
<p>A
N
</p>
<p>IF
IC
</p>
<p>A
TI
</p>
<p>O
N
</p>
<p> E
T
</p>
<p>ACOUSTIQUE
GENERATEUR
</p>
<p>rhetorique
Niveau
</p>
<p>documentaire
Niveau
</p>
<p>semantique
Niveau
</p>
<p>syntaxique
Niveau
</p>
<p>citationnel
Niveau
</p>
<p>N
iv
</p>
<p>ea
u 
</p>
<p>Lo
gi
</p>
<p>qu
e
</p>
<p>{Formule logique}
</p>
<p>N
iv
</p>
<p>ea
u 
</p>
<p>pr
ag
</p>
<p>m
at
</p>
<p>iq
ue
</p>
<p>N
iv
</p>
<p>ea
u 
</p>
<p>lin
gu
</p>
<p>ist
iq
</p>
<p>ue
</p>
<p>{Parole}
</p>
<p>N
iv
</p>
<p>ea
u 
</p>
<p>ex
pr
</p>
<p>es
sif
</p>
<p>N
iv
</p>
<p>ea
u 
</p>
<p>ac
ou
</p>
<p>sti
qu
</p>
<p>e
</p>
<p>PROSODIQUE
GENERATEUR
</p>
<p>{Texte + Contour F0}
</p>
<p>{S.D.R.S.}
</p>
<p>{Texte}
</p>
<p>KBId
</p>
<p>RhetRep
</p>
<p>DocRep
</p>
<p>SemRep
</p>
<p>SynRep
</p>
<p>Quote
</p>
<p>NOTRE ARCHITECTURE RAGS
</p>
<p>FIG. 1 &#8211; Architecture modulaire de g&#233;n&#233;ration et correspondances avec le mod&#232;le RAGS
</p>
<p>des traitements du type appariement des graphes) et param&#233;trables dans une langue et pour une
t&#226;che donn&#233;es.
</p>
<p>Le sixi&#232;me point est r&#233;alis&#233; par l&#8217;utilisation d&#8217;un format standard pour la repr&#233;sentation des
connaissances (XML) et d&#8217;une th&#233;orie de repr&#233;sentation pragmatique-discursive dont le forma-
lisme &#171; interne &#187; n&#8217;est pas pris en compte (la SDRT - &#171; Segmented Discourse Representation
</p>
<p>409</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir POPESCU
</p>
<p>Theory &#187;, dont on ne prend en compte que les relations rh&#233;toriques et leurs s&#233;mantiques infor-
melles).
</p>
<p>L&#8217;id&#233;e de concevoir une architecture pour la g&#233;n&#233;ration du langage naturel a &#233;t&#233; d&#233;j&#224; &#233;nonc&#233;e
dans plusieurs &#233;tudes, comme celle de Reiter et Dale (Reiter &amp; Dale, 2000) et l&#8217;architecture
RAGS (Mellish et al., 2006). Mais aucun de ces deux mod&#232;les ne traite le dialogue homme-
machine. Il existe peu de travaux pour d&#233;finir une architecture adapt&#233;e pour la g&#233;n&#233;ration en
dialogue (Imberdis &amp; Caelen, 1997), (McTear, 2002).
</p>
<p>D&#8217;autres travaux ont abord&#233; la g&#233;n&#233;ration en dialogue de diverses fa&#231;ons, dont les plus notables
sont, &#224; notre sens, ceux d&#8217;Amanda Stent (Stent, 2001), de Mariet Theune (Theune, 2000) et
de Matthew Stone (Stone, 1998), puisqu&#8217;ils sont explicitement concern&#233;s par le dialogue oral
homme-machine, aboutissant en m&#234;me temps &#224; des syst&#232;mes fonctionnels. Ces d&#233;marches ne
sont pas g&#233;n&#233;riques, sont sans r&#233;f&#233;rence &#224; un &#171; standard &#187; en g&#233;n&#233;ration (tels que l&#8217;architecture
de Reiter et Dale ou le mod&#232;le RAGS). Cela implique le manque de portabilit&#233; et de r&#233;utilisation
de ces syst&#232;mes. Notre architecture propos&#233;e ici est fortement compatible &#224; la fois avec le propos
de Reiter et Dale et avec le mod&#232;le RAGS.
</p>
<p>Pour l&#8217;utilisation de la SDRT en g&#233;n&#233;ration en situations de monologues, les travaux de Lau-
rence Danlos et son &#233;quipe peuvent &#234;tre cit&#233;es (Danlos et al., 2001) ; pour des extensions de la
SDRT pour l&#8217;interpr&#233;tation des dialogues, les travaux de Laurent Pr&#233;vot (Maudet et al., 2004)
et son &#233;quipe sont int&#233;ressants, mais ne concernent pas la g&#233;n&#233;ration. Dans ce contexte, les
travaux assum&#233;s par notre projet essaient de renforcer les recherches en g&#233;n&#233;ration pour le dia-
logue homme-machine finalis&#233;.
</p>
<p>2 Architecture modulaire compatible avec les &#171; standards &#187;
en g&#233;n&#233;ration
</p>
<p>Le sch&#233;ma global de l&#8217;architecture est illustr&#233; dans la figure 1, o&#249; on met en &#233;vidence la relation
entre les niveaux de traitement, les modules (g&#233;n&#233;rateurs) et les connaissances &#233;chang&#233;es entre
les modules et implicitement entre les niveaux.
</p>
<p>Sur cette figure les modules de traitement sont repr&#233;sent&#233;s par des rectangles et les structures
de donn&#233;es par des ellipses. A droite, les fl&#232;ches doubles montrent les niveaux de traitement,
tandis qu&#8217;&#224; gauche, les fl&#232;ches situent l&#8217;architecture propos&#233;e ici par rapport &#224; l&#8217;architecture de
r&#233;f&#233;rence de Reiter et Dale (Reiter &amp; Dale, 2000), qui repr&#233;sente une premi&#232;re sp&#233;cification,
plut&#244;t th&#233;orique, d&#8217;une architecture pour la g&#233;n&#233;ration du langage naturel.
</p>
<p>Les interfaces entre les modules de g&#233;n&#233;ration sont sp&#233;cifi&#233;es en XML et les choix de concep-
tion pour notre architecture ont &#233;t&#233; d&#233;crites de mani&#232;re &#233;tendue dans (Popescu et al., 2007).
Le mod&#232;le RAGS est d&#233;crit dans (Mellish et al., 2006). Les entit&#233;s d&#233;nomm&#233;es &#171; primitives
abstraites &#187; &#224; un niveau de traitement dans la description du mod&#232;le RAGS ci-dessus sont en
fait des pointeurs renvoyant vers les repr&#233;sentations les plus complexes au niveau inf&#233;rieur ; par
exemple, la primitive RhetLeaf au niveau rh&#233;torique renvoie vers une structure s&#233;mantique,
SemRep.
</p>
<p>Le mod&#232;le RAGS sp&#233;cifie une architecture &#171; pipeline &#187;, permettant des raccourcis entre les
niveaux de repr&#233;sentation, via les fl&#232;ches non-locales (Mellish et al., 2006). Donc, la double
incidence du niveau expressif &#224; d&#8217;autres niveaux de traitement est compatible en th&#233;orie et en
</p>
<p>410</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Architecture modulaire portable pour la g&#233;n&#233;ration du LN en dialogue homme-machine
</p>
<p>pratique avec RAGS.
</p>
<p>Les correspondances entre RAGS et notre architecture sont montr&#233;es dans la figure 1, o&#249; les
connaissances transf&#233;r&#233;es dans le mod&#232;le RAGS sont des primitives (dans le cas de KBId et
Quote) o&#249; des repr&#233;sentations d&#233;riv&#233;es (pour le reste - cf. la discussion ci-dessous).
</p>
<p>Notre architecture
&#8211; Niveau Logique - Ce niveau de traitement ne fait pas partie &#224;
</p>
<p>vrai dire de la composante de g&#233;n&#233;ration d&#8217;un syst&#232;me de dia-
logue, mais on le pr&#233;cise ici en raison de compatibilit&#233; avec les
architectures existantes dans le domaine de la g&#233;n&#233;ration ; il four-
nit une forme logique correspondante &#224; l&#8217;intention communica-
tionnelle &#224; mettre sous forme linguistique, prenant en entr&#233;e une
formule logique correspondante &#224; l&#8217;intention communicationnelle
d&#8217;un &#233;nonc&#233; provenu de l&#8217;usager ;
</p>
<p>&#8211; Niveau pragmatique - Ce niveau de traitement est le premier &#224;
faire vraiment partie du syst&#232;me de g&#233;n&#233;ration ; il utilise la SDRT
et les actes de langage pour fournir une repr&#233;sentation discursive
du dialogue courant, prenant en entr&#233;e la formule logique pour
l&#8217;&#233;nonc&#233; &#224; engendrer ;
</p>
<p>&#8211; Niveau linguistique - Ce niveau de traitement op&#232;re la mise en
forme linguistique du message &#224; g&#233;n&#233;rer par le syst&#232;me et prend
en entr&#233;e la structure discursive pour le dialogue courant, fournis-
sant le texte correspondant &#224; l&#8217;&#233;nonc&#233; mat&#233;rialisant la r&#233;ponse du
syst&#232;me ;
</p>
<p>&#8211; Niveau expressif - Ce niveau de traitement ajoute un degr&#233; d&#8217;ex-
pressivit&#233; au texte engendr&#233; au niveau linguistique, prenant en en-
tr&#233;e la structure discursive pour fournir en sortie les param&#232;tres
prosodiques appropri&#233;s associ&#233;s au texte &#224; g&#233;n&#233;rer ; l&#8217;expressivit&#233;
est consid&#233;r&#233;e seulement &#224; l&#8217;&#233;gard de la qualit&#233; du signal vocal
synth&#233;tisable &#224; partir du texte ;
</p>
<p>&#8211; Niveau acoustique - Ce niveau r&#233;alise la synth&#232;se vocale propre-
ment dite, en prenant &#224; l&#8217;entr&#233;e un texte annot&#233; pour une gestion
fine de la prosodie pour fournir en sortie la parole synth&#233;tis&#233;e ;
</p>
<p>Le mod&#232;le RAGS
&#8211; Niveau conceptuel - Ce niveau de traitement fournit des repr&#233;-
</p>
<p>sentations non-linguistiques des informations &#224; communiquer (par
exemple des formules logiques) ; ces repr&#233;sentations conceptuelles
sont manipul&#233;es via des pointeurs vers des entit&#233;s primitives dans
une base de connaissances et appel&#233;es KBId (&#171; Knowledge Base
Identifier &#187;) ;
</p>
<p>&#8211; Niveau rh&#233;torique - Ce niveau de traitement d&#233;finit des relations
discursives entre les &#233;nonc&#233;s encha&#238;n&#233;s dans un discours ; la ma-
ni&#232;re dont les relations sont r&#233;alis&#233;es est sp&#233;cifi&#233;e via les primitives
abstraites RhetRel (pour la relation) et RhetLeaf (pour les argu-
ments de la relation) &#224; partir desquelles les structures composites
RhetRepSeq et RhetRep sont construites ;
</p>
<p>&#8211; Niveau documentaire - Ce niveau de traitement concerne la dis-
position physique des &#233;nonc&#233;s (voire typage du texte) &#224; produire
et les structures de donn&#233;es fournies sont DocAttr, DocLeaf, Do-
cRepSeq et DocRep, construites &#224; partir des primitives abstraites
DocFeat, DocAtom et DocLeaf ;
</p>
<p>&#8211; Niveau s&#233;mantique - Ce niveau de traitement peut &#234;tre combin&#233;
avec le niveau rh&#233;torique, ainsi qu&#8217;au niveau s&#233;mantique on code &#224;
la fois les propositions atomiques (cf. celles trouv&#233;es dans les struc-
tures rh&#233;toriques) et les organisations structur&#233;es de propositions,
pour l&#8217;entr&#233;e aux g&#233;n&#233;rateurs dits &#171; &#224; entr&#233;e s&#233;mantique &#187; ; les
structures de donn&#233;es fournies par ce niveau, SemRep, Scoped-
SemRep, SemType, SemAttr,Scoping et ScopeConstr sont
construites &#224; partir des primitives abstraites DR, SemConstant,
SemPred et ScopeRel ;
</p>
<p>&#8211; Niveau syntaxique - Ce niveau fournit une repr&#233;sentation syn-
taxique abstraite qui ne sp&#233;cifie pas l&#8217;ordre des mots &#224; l&#8217;int&#233;rieur
des &#233;nonc&#233;s ; par rapport &#224; la repr&#233;sentation s&#233;mantique, la struc-
ture syntaxique comprend les fonctions grammaticales des mots et
est repr&#233;sent&#233;e par les types SynRep, FVM (de &#171; Feature-value
matrix &#187;, matrice attribut-valeur), SynArg, et Adj, construites &#224;
partir des primitives nil, SynFun, SynFeat et SynAtom ;
</p>
<p>&#8211; Niveau citationnel - Ce niveau concerne surtout les fragments
fix&#233;s de texte (les structures fig&#233;es) incluses, sans modification,
dans la sortie du syst&#232;me de g&#233;n&#233;ration ; pour la repr&#233;sentation des
donn&#233;es &#224; ce niveau seule une primitive abstraite existe, Quote ;
</p>
<p>L&#8217;architecture propos&#233;e ici et son parall&#232;le, l&#8217;architecture RAGS sont compar&#233;s ci-dessous.
</p>
<p>Ainsi, le niveau logique de notre architecture correspond au niveau conceptuel du mod&#232;le RAGS
seulement du point de vue de la g&#233;n&#233;ration, car le g&#233;n&#233;rateur logique (en fait, le contr&#244;leur de
dialogue) a un r&#244;le plus &#233;tendu que le niveau conceptuel de RAGS. C&#8217;est pour cela que le niveau
logique ne fait pas &#224; vrai dire partie de notre architecture, mais repr&#233;sente seulement l&#8217;interface
du syst&#232;me de g&#233;n&#233;ration au contexte dialogique.
</p>
<p>Le niveau pragmatique de notre architecture correspond au niveau rh&#233;torique de RAGS et au
niveau documentaire de ce dernier, car notre g&#233;n&#233;rateur pragmatique assure la situation et la
coh&#233;rence rh&#233;torique de l&#8217;acte de langage &#224; engendrer, en fournissant en m&#234;me temps une re-
pr&#233;sentation qui constitue une structuration discursive.
</p>
<p>Le niveau linguistique de notre architecture correspond &#224; trois niveaux de RAGS : les niveaux
</p>
<p>411</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir POPESCU
</p>
<p>s&#233;mantique, syntaxique et citationnel.
</p>
<p>Quant aux niveaux expressif et acoustique de notre architecture, ceux-ci n&#8217;ont pas de correspon-
dants en RAGS car le c&#244;t&#233; prosodie et synth&#232;se de parole repr&#233;sente un aspect de la g&#233;n&#233;ration
dont RAGS ne rend pas compte. RAGS est concern&#233; seulement avec l&#8217;obtention du texte comme
r&#233;sultat final du processus de g&#233;n&#233;ration.
</p>
<p>En conclusion, on observe que l&#8217;architecture, bien qu&#8217;elle s&#8217;appuie sur d&#8217;autres architectures
de r&#233;f&#233;rence, soit plus th&#233;oriques comme celle de Reiter et Dale, soit plus orient&#233;es logiciel,
comme RAGS, reste particuli&#232;re dans les d&#233;tails fins.
</p>
<p>3 Architecture portable
</p>
<p>Nous discutons maintenant de l&#8217;isomorphisme entre les repr&#233;sentations de RAGS et les repr&#233;-
sentations de notre architecture, en nous appuyant sur un exemple de repr&#233;sentations dans le
mod&#232;le RAGS et dans notre architecture.
</p>
<p>Nous illustrons cela autour d&#8217;un exemple pour la repr&#233;sentation rh&#233;torique correspondante &#224; un
dialogue court entre deux locuteurs, ayant comme objet l&#8217;&#233;tablissement d&#8217;un rendez-vous :
</p>
<p>U : pi1 : Quand es-tu disponible aujourd&#8217;hui ?
</p>
<p>M : pi2 : Je suis disponible aujourd&#8217;hui d&#232;s 16h !
</p>
<p>Ainsi, en employant une formalisation rh&#233;torique &#224; la SDRT (Asher &amp; Lascarides, 2003), on
suppose que les g&#233;n&#233;rateurs doivent repr&#233;senter la structuration rh&#233;torique du dialogue indiqu&#233;
ci-dessus.
</p>
<p>Pour ce texte, la repr&#233;sentation rh&#233;toriqueRhetRep que le niveau rh&#233;torique de RAGS construit
dans son langage interne est montr&#233;e dans la figure 2, &#224; c&#244;t&#233; de la repr&#233;sentation issue de notre
architecture, dans le cadre de la SDRT. Les conventions de repr&#233;sentation pour le RAGS sont les
suivantes (Mellish et al., 2006) : (i) les noeuds sont des objets qui repr&#233;sentent des structures
et des sous-structures (types primitifs) ; &#224; chaque objet on associe un type RAGS (de ceux
d&#233;finis dans le mod&#232;le) ; de ces types, seulement les types primitifs sp&#233;cifient des informations
se reportant &#224; la th&#233;orie choisie pour concr&#233;tiser l&#8217;architecture abstraite de RAGS, et (ii) les
fl&#232;ches entre les objets repr&#233;sentent les relations entre ces derniers ; pour chaque fl&#232;che il existe
une et seulement une source et une cible ; en m&#234;me temps, chaque fl&#232;che est d&#233;sign&#233;e par une
&#233;tiquette unique. De plus, les fl&#232;ches sont typ&#233;es, dans le sens que pour chaque &#233;tiquette il y a
un unique type pour la source et un type toujours unique pour la cible ; ces types sont pr&#233;cis&#233;s
lors de la d&#233;finition de chaque fl&#232;che, donc, immuables. En revanche, pour la repr&#233;sentation de
notre architecture, la notation &#171; &gt; &#187; s&#233;pare deux &#233;l&#233;ments en structure arborescente, tandis que
&#171; : : &#187; s&#233;pare un &#233;l&#233;ment (&#224; gauche) d&#8217;un attribut des siens propres.
</p>
<p>On peut voir le texte ci-dessus reli&#233; par la relation discursive SDRT QAP (&#171; Question - Answer
Pair &#187;), dont la repr&#233;sentation RAGS est illustr&#233;e dans la figure 2.
</p>
<p>La repr&#233;sentation XML correspondant &#224; la repr&#233;sentation de la figure 2, pour cet exemple, est
donn&#233;e dans la figure 3.
</p>
<p>La figure 4 montre un ensemble de r&#232;gles permettant le passage de la repr&#233;sentation rh&#233;torique
de RAGS &#224; la repr&#233;sentation utilis&#233;e en sortie du module pragmatique de notre architecture ; on
utilise les m&#234;mes notations concernant &#171; &gt; &#187; et &#171; : : &#187;.
</p>
<p>412</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Architecture modulaire portable pour la g&#233;n&#233;ration du LN en dialogue homme-machine
</p>
<p>r5 : SemRep
</p>
<p>r3 : RhetLeaf r4 : RhetLeaf
</p>
<p>r6 : SemRep
</p>
<p>r2  : RhetRepSeq
</p>
<p>closed
</p>
<p>2 &#8722; el1 &#8722; el
</p>
<p>r0 : RhetRep
</p>
<p>r1 : RhetRel &#8722; QAP
</p>
<p>1 &#8722; el 2 &#8722; el
</p>
<p>UTTERANCE :: speaker, strategy, speech&#8722;act, 
                             illoc&#8722;force
FORMULA &gt; %Logic&#8722;formula
</p>
<p>UTTERANCE :: speaker, strategy, speech&#8722;act, 
                             illoc&#8722;force
FORMULA &gt; %Logic&#8722;formula
</p>
<p>pi1 : STATE &gt; 
</p>
<p>rho1 : RRELATION :: type=&quot;QAP&quot;, left=&quot;pi1&quot;, right=&quot;pi2&quot;
</p>
<p>pi2 : STATE &gt;
</p>
<p>pi0 : SDRS &gt; 
</p>
<p>LE MODELE RAGS NOTRE ARCHITECTURE
</p>
<p>FIG. 2 &#8211; Exemple de repr&#233;sentation rh&#233;torique dans RAGS et dans notre architecture pour une
instance de dialogue simple
</p>
<p>Cet ensemble de r&#232;gles montre que pour 23 des 34 r&#232;gles il existe une correspondance entre
les &#233;l&#233;ments et attributs dans la repr&#233;sentation RAGS et dans notre architecture, donc il y a
une superposition de 2/3 entre les repr&#233;sentations dans les deux architectures au sens o&#249; la
repr&#233;sentation dans notre architecture couvre 2/3 de la repr&#233;sentation &#233;quivalente en RAGS. Le
reste comprend surtout des informations d&#8217;identification interne des structures de donn&#233;es, ce
qui n&#8217;est pas n&#233;cessaire dans notre architecture, car elle est con&#231;ue pour le dialogue homme-
machine o&#249; le syst&#232;me doit g&#233;n&#233;rer un tour de parole &#224; un instant donn&#233; et non pas &#233;laborer des
discours monologiques &#233;tendus, o&#249; un plus fort rep&#233;rage des structures linguistiques partielles
est n&#233;cessaire dans le temps.
</p>
<p>Proc&#233;dant &#224; l&#8217;envers et construisant un ensemble de r&#232;gles permettant de &#171; traduire &#187; la sp&#233;-
cification XML des informations rh&#233;toriques &#233;chang&#233;es entre les modules de g&#233;n&#233;ration prag-
matique et linguistique en repr&#233;sentation selon le mod&#232;le RAGS on obtient une couverture de
5/6 selon un ensemble de r&#232;gles semblables &#224; ceux juste pr&#233;sent&#233;es ci-dessus. Le reste de 1/6
rel&#232;ve du manque de &#171; transport &#187; vers la repr&#233;sentation RAGS des marqueurs sp&#233;cifiques au
dialogue (l&#8217;identit&#233; des locuteurs et les marqueurs pragmatiques dialogiques - strat&#233;gie, acte de
langage et force illocutoire). Ces informations peuvent cependant &#234;tre r&#233;cup&#233;r&#233;es au niveau des
identifiants en RAGS, qu&#8217;une structure parall&#232;le r&#233;alisant les correspondances appropri&#233;es peut
accompagner, en tant que connaissances statiques sous forme de tableau de correspondances.
</p>
<p>4 Conclusion
</p>
<p>Dans cet article nous avons pr&#233;sent&#233; une vue d&#8217;ensemble d&#8217;architecture g&#233;n&#233;rique (dans le
sens que les modules de traitement sont ind&#233;pendants des interfaces entre eux), modulaire
(dans le sens que les traitements dans un module sont ind&#233;pendants des traitements dans les
autres modules) et portable (dans le sens que m&#234;me au niveau des interfaces les modules sont
ind&#233;pendants pourvu qu&#8217;on plonge les repr&#233;sentations des connaissances &#224; chaque niveau de
traitement dans une architecture standard en g&#233;n&#233;ration du langage naturel, telle que le mod&#232;le
RAGS).
</p>
<p>Plus pr&#233;cis&#233;ment, un exemple &#233;tendu o&#249; la repr&#233;sentation de l&#8217;interface entre les modules prag-
matique et linguistique dans notre architecture, comportant des informations rh&#233;toriques &#233;chan-
</p>
<p>413</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir POPESCU
</p>
<p>FIG. 3 &#8211; Repr&#233;sentations XML des informations rh&#233;toriques, dans le mod&#232;le RAGS et dans
notre architecture
</p>
<p>414</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Architecture modulaire portable pour la g&#233;n&#233;ration du LN en dialogue homme-machine
</p>
<p>1. RAGS &#8594; &#8709;
2. RAGS &gt; RhetRep &#8594; SDRS
3. RAGS &gt; RhetRep : : ident &#8594; SDRS : : label
4. RAGS &gt; RhetRep : : type &#8594; &#8709;
5. RAGS &gt; RhetRep : : length &#8594; SDRS : : nstates
6. RAGS &gt; RhetRep &gt; RhetRel &#8594; SDRS &gt; RRELATION
7. RAGS &gt; RhetRep &gt; RhetRel : : name &#8594; SDRS &gt; RRELATION : : type
8. RAGS &gt; RhetRep &gt; RhetRepSeq &#8594; SDRS &gt; RRELATION
9. RAGS &gt; RhetRep &gt; RhetRepSeq : : ident &#8594; SDRS &gt; RRELATION : : label
10. RAGS &gt; RhetRep &gt; RhetRepSeq : : type &#8594; &#8709;
11. RAGS &gt; RhetRep &gt; RhetRepSeq &gt; RhetLeaf &#8594; SDRS &gt; STATE
12. RAGS &gt; RhetRep &gt; RhetRepSeq &gt; RhetLeaf : : ident &#8594; SDRS &gt; STATE : : label |
</p>
<p>SDRS &gt; RRELATION : : left |
SDRS &gt; RRELATION : : right
</p>
<p>13. RAGS &gt; arrow &#8594; &#8709;
14. RAGS &gt; arrow : : name &#8594; &#8709;
15. RAGS &gt; arrow : : source &#8594; &#8709;
16. RAGS &gt; arrow : : destination &#8594; &#8709;
17. RAGS &gt; SemRep &#8594; SDRS &gt; STATE | SDRS &gt; STATE &gt; FORMULA
18. RAGS &gt; SemRep : : ident &#8594; SDRS &gt; STATE : : label
19. RAGS &gt; SemRep : : type &#8594; SDRS &gt; STATE : : type
20. RAGS &gt; SemRep : : length &#8594; &#8709;
21. RAGS &gt; SemRep &gt; DR &#8594; SDRS &gt; STATE
22. RAGS &gt; SemRep &gt; DR : : name &#8594; SDRS &gt; STATE : : label
23. RAGS &gt; SemRep &gt; SemType &#8594; SDRS &gt; STATE | SDRS &gt; STATE &gt; FORMULA
24. RAGS &gt; SemRep &gt; SemType : : type &#8594; SDRS &gt; STATE : : type
25. RAGS &gt; SemRep &gt; SemType &gt; SemPred &#8594; SDRS &gt; STATE &gt; FORMULA &gt; quant &gt; conn
</p>
<p>&gt; pred
26. RAGS &gt; SemRep &gt; SemType &gt; SemPred : : name &#8594; SDRS &gt; STATE &gt; FORMULA &gt; quant &gt; conn
</p>
<p>&gt; pred : : name
27. RAGS &gt; SemRep &gt; SemAttr &#8594; &#8709;
28. RAGS &gt; SemRep &gt; SemAttr : : type &#8594; &#8709;
29. RAGS &gt; SemRep &gt; SemAttr &gt; SemRoleRep &#8594; SDRS &gt; STATE &gt; FORMULA |
</p>
<p>SDRS &gt; STATE &gt; FORMULA &gt; quant |
SDRS &gt; STATE &gt; FORMULA &gt; quant &gt; conn
</p>
<p>30. RAGS &gt; SemRep &gt; SemAttr &gt; SemRoleRep &gt; SemRole &#8594; SDRS &gt; STATE &gt; FORMULA &gt; quant &gt; conn
&gt; pred &gt; term | SDRS &gt; STATE &gt; FORMULA
&gt; quant
</p>
<p>31. RAGS &gt; SemRep &gt; SemAttr &gt; SemRoleRep &gt; SemRole : : name &#8594; SDRS &gt; STATE &gt; FORMULA &gt; quant &gt; type
32. RAGS &gt; SemRep &gt; SemAttr &gt; SemRoleRep &gt; Constant &#8594; &#8709;
33. RAGS &gt; SemRep &gt; SemAttr &gt; SemRoleRep &gt; Constant : : ident &#8594; SDRS &gt; STATE &gt; FORMULA &gt; quant &gt; variable
34. RAGS &gt; SemRep &gt; SemAttr &gt; SemRoleRep &gt; Constant : : name &#8594; SDRS &gt; STATE &gt; FORMULA &gt; quant &gt; type
</p>
<p>FIG. 4 &#8211; R&#232;gles de transformation du format XML RAGS vers celui de notre architecture
</p>
<p>g&#233;es, a &#233;t&#233; plong&#233;e dans la repr&#233;sentation rh&#233;torique, situ&#233;e au niveau conceptuel de traitement,
dans le mod&#232;le RAGS. Lors de cet exercice, rendu possible via un ensemble de r&#232;gles transfor-
mationnelles, on a constat&#233; que la &#171; traduction &#187; dans les deux formats de repr&#233;sentation n&#8217;est
pas totale, mais conserve les &#233;l&#233;ments pertinents par rapport &#224; la nature de l&#8217;&#233;change, dans les
deux sens, de notre architecture vers RAGS et &#224; l&#8217;inverse. Ce r&#233;sultat nous am&#232;ne a d&#233;montrer
la portabilit&#233; annonc&#233;e : les modules dans notre architecture peuvent &#234;tre combin&#233;s ou &#171; en-
trelac&#233;s &#187; avec des modules con&#231;us suivant les sp&#233;cifications du mod&#232;le RAGS ; par exemple,
on pourrait construire un syst&#232;me de g&#233;n&#233;ration du langage naturel ayant les niveaux logique et
pragmatique de notre architecture, ayant aussi un niveau linguistique &#233;clat&#233; en niveaux s&#233;man-
tique, syntaxique et citationnel d&#8217;un module de g&#233;n&#233;ration suivant les sp&#233;cifications du mod&#232;le
RAGS.
</p>
<p>On a donc pr&#233;sent&#233; une architecture qui &#233;tend un mod&#232;le de g&#233;n&#233;ration automatique des textes
(RAGS) au dialogue oral homme-machine, en gardant, dans une mesure importante, la compa-
tibilit&#233; entre les deux.
</p>
<p>Nous envisageons de concevoir des algorithmes pour l&#8217;obtention automatique des r&#232;gles de
traduction entre notre architecture et le mod&#232;le RAGS ; ceci peut se r&#233;aliser en principe par
l&#8217;appariement d&#8217;arbres XML pour les repr&#233;sentations dans les deux architectures ; la suite des
</p>
<p>415</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir POPESCU
</p>
<p>transformations d&#8217;un arbre vers l&#8217;autre constitue l&#8217;ensemble des r&#232;gles. Evidemment, les d&#233;-
marches d&#233;crites dans cet article concernant l&#8217;interface entre les niveaux pragmatique et lin-
guistique dans notre architecture et, respectivement, l&#8217;interface entre les niveaux rh&#233;torique et
s&#233;mantique dans le mod&#232;le RAGS doivent &#234;tre &#233;tendues aux autres interfaces entre les modules
des deux architectures.
</p>
<p>Remerciement
</p>
<p>L&#8217;auteur remercie vivement Jean Caelen, du Laboratoire d&#8217;Informatique de Grenoble, pour ses
conseils attentifs et pour son apport aux travaux pr&#233;sent&#233;s dans cet article.
</p>
<p>R&#233;f&#233;rences
ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation. Cambridge University Press.
DANLOS L., GAIFFE B. &amp; ROUSSARIE L. (2001). Document structuring &#224; la sdrt. In ACL,
Ed., Proceedings of the 8th European Workshop on Natural Language Generation EWNLG
2001.
IMBERDIS L. &amp; CAELEN J. (1997). G&#233;n&#233;ration d&#8217;actes illocutoires pour le dialogue. In Actes
du Colloque G&#233;n&#233;ration automatique du texte GAT&#8217;97, Grenoble.
MAUDET N., MULLER P. &amp; PR&#201;VOT L. (2004). Tableaux conversationnels en sdrt. In
Workshop SDRT, TALN 2004.
MCTEAR M. F. (2002). Spoken language technology : Enabling the conversational user in-
terface. In ACM Computer Surveys 34 (1) : ACM.
MELLISH C., SCOTT D., CAHILL L., PAIVA D., EVANS R. &amp; REAPE M. (2006). A refe-
rence architecture for natural language generation systems. In Journal of Natural Language
Engineering 12 (1), p. 1&#8211;34 : Cambridge University Press.
POPESCU V., CAELEN J. &amp; BURILEANU C. (2007). Generic architecture for natural language
generation in spoken human-computer dialogue. In C. BURILEANU, Ed., The 4th Conference
on Speech Technology and Human-Computer Dialogue SpeD 2007 : Romanian Academy Pu-
blishing House.
REITER E. &amp; DALE R. (2000). Building Natural Language Generation Systems. Cambridge
University Press.
STENT A. (2001). Dialogue Systems as Conversational Partners : Applying Conversation Acts
Theory to Natural Language Generation for Task-Oriented Mixed-Initiative Spoken Dialogue.
Ph D Thesis, University of Rochester.
STONE M. (1998). Modality in Dialogue : Planning, Pragmatics and Computation. Ph D
Thesis, University of Pennsylvannia.
THEUNE M. (2000). From Data to Speech : Language Generation in Context. Ph D Thesis,
University of Eindhoven.
</p>
<p>416</p>

</div></div>
</body></html>