<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction endog&#232;ne d&#8217;une structure de document pour un alignement multilingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Extraction endog&#232;ne d&#8217;une structure de document
pour un alignement multilingue
</p>
<p>Romain BRIXTEL
Laboratoire GREYC, Universit&#233; de Caen-Basse-Normandie
</p>
<p>Campus II, 14032 Caen Cedex
rbrixtel@info.unicaen.fr
</p>
<p>R&#233;sum&#233;. Pour des raisons vari&#233;es, diverses communaut&#233;s se sont int&#233;ress&#233;es aux corpus
multilingues. Parmi ces corpus, les textes parall&#232;les sont utilis&#233;s aussi bien en terminologie,
lexicographie ou comme source d&#8217;informations pour les syst&#232;mes de traduction par l&#8217;exemple.
L&#8217;Union Europ&#233;enne, qui a entra&#238;n&#233; la production de document l&#233;gislatif dans vingtaine de
langues, est une des sources de ces textes parall&#232;les. Aussi, avec le Web comme vecteur princi-
pal de diffusion de ces textes parall&#232;les, cet objet d&#8217;&#233;tude est pass&#233; &#224; un nouveau statut : celui
de document. Cet article d&#233;crit un syst&#232;me d&#8217;alignement prenant en compte un grand nombre
de langues simultan&#233;ment (&gt; 2) et les caract&#233;ristiques structurelles des documents analys&#233;s.
</p>
<p>Abstract. For many reasons, the multilingual corporas have interested various communi-
ties. Among these corporas, the parallel texts are used as well in terminology, lexicography or
as a source of informations for example-based translations. The European Union, which invol-
ved the production of legislative documents, generates these parrallel texts in more than twenty
languages. Also, with the Web as a vector of diffusion, we can wonder if these parallel texts
can be treated as documents. This article describes a alignment system taking account a great
number of languages (&gt; 2) and the structural characteristics of the analyzed documents.
</p>
<p>Mots-cl&#233;s : alignement multilingue, corpus parrall&#232;les, multitextes, multidocuments,
extraction de structures, alignement endog&#232;ne.
</p>
<p>Keywords: multilingual alignment, parallel corpora, multitexts, multidocuments, ex-
traction of structures, endogenous alignment.
</p>
<p>1 Introduction
</p>
<p>L&#8217;alignement est une op&#233;ration qui consiste &#224; relier des unit&#233;s qui se correspondent dans des
textes parall&#232;les. Des &#233;l&#233;ments peuvent alors &#234;tre appari&#233;s suivant le grain d&#8217;analyse (para-
graphes, phrases ou d&#8217;autres unit&#233;s plus fines telles que les mots) sur lequel le syst&#232;me d&#8217;ali-
gnement s&#8217;appuie.
</p>
<p>L&#8217;int&#233;r&#234;t croissant port&#233; &#224; cet axe de recherche est li&#233; &#224; l&#8217;augmentation de la production des
corpus multilingues regroupant des textes et leurs traductions (textes parall&#232;les ou multitextes),
ainsi que leur accessibilit&#233; de plus en plus ais&#233;e.
</p>
<p>Dans cet article, nous pr&#233;sentons tout d&#8217;abord un &#233;tat de l&#8217;art d&#233;crivant des m&#233;thodes d&#8217;aligne-
</p>
<p>367</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Romain BRIXTEL
</p>
<p>ments &#224; diff&#233;rents niveaux de granularit&#233;. Ensuite, nous aborderons la m&#233;thode d&#8217;alignement
multilingue (pr&#232;s d&#8217;une vingtaine de langue) impl&#233;ment&#233;e en d&#233;taillant les hypoth&#232;ses utilis&#233;es
et en pr&#233;sentant les diff&#233;rents alignements g&#233;n&#233;r&#233;s
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Deux grains principaux nous int&#233;resse : l&#8217;alignement de phrases ainsi que l&#8217;alignement d&#8217;&#233;l&#233;-
ments sous-phrastiques tel que les mots, termes ou expressions.
</p>
<p>2.1 Alignement de phrases
</p>
<p>Pour l&#8217;alignement au grain phrase, deux m&#233;thodes principalement utilis&#233;es sont &#224; retenir.
</p>
<p>(Kay, 1988) part de l&#8217;hypoth&#232;se suivante : deux phrases sont alignables si les mots qui les
composent sont en correspondance. En supposant que certaines phrases sont align&#233;es au d&#233;but
du traitement (habituellement les premi&#232;res et derni&#232;res phrases des documents du multidocu-
ment), le processus propose des candidats de phrases &#224; aligner. Aussi, l&#8217;algorithme consid&#232;re
leurs places dans le document. On exclut la possibilit&#233; d&#8217;aligner une phrase se situant au d&#233;but
d&#8217;un document avec une autre &#224; une place tr&#232;s eloign&#233;e dans l&#8217;autre document. Le proces-
sus d&#8217;alignement est it&#233;ratif. L&#8217;algorithme valide les alignements phrastiques en satisfaisant au
maximum les &#233;quivalences d&#8217;ensembles de mots faites d&#232;s le d&#233;but et en cherchant des phrases
&#233;quivalentes avec un rang tr&#232;s proche. Chaque nouvelle paire de phrases align&#233;es restreint les
domaines d&#8217;&#233;quivalences entre les mots de langues diff&#233;rentes.
</p>
<p>(Gale &amp; Church, 1993) se basent sur la propri&#233;t&#233; suivante : des phrases sont align&#233;es si leurs
longueurs relatives sont &#233;quivalentes. La m&#233;thode part du principe qu&#8217;une phrase longue &#233;crite
dans une langue sera traduite par une phrase longue dans une autre langue. La longueur des
phrases est alors relative &#224; la longueur moyenne, en nombre de caract&#232;res, des phrases de la
langue dans laquelle elles sont &#233;crites. De la m&#234;me fa&#231;on que la m&#233;thode de (Kay, 1988), on
admet ici que les phrases align&#233;es ont un rang tr&#232;s proche dans les deux documents analys&#233;s.
Sont alors envisag&#233;s les alignements 1 : 2 (une phrase correspond &#224; deux autres), 2 : 1, 1 : 0
et 0 : 1. Ainsi, en l&#8217;absence de candidat &#224; l&#8217;alignement pour une phrase donn&#233;e, la m&#233;thode
propose de regarder si elle correspond &#224; plusieurs phrases suivant le m&#234;me crit&#232;re de longueur,
en se limitant aux possibilit&#233;s d&#8217;alignement d&#233;crits pr&#233;c&#233;demment. Les possibilit&#233;s de fusions
ou d&#8217; omissions de phrases sont inclues par raison pratique en terme de simplification de calcul ;
tout en suivant une certaine logique du processus de traduction.
</p>
<p>Des m&#233;thodes d&#8217;ancrages lexicaux pr&#233;alables sont utilis&#233;es en compl&#233;ment pour affiner les r&#233;-
sultats. Ainsi, (Debili &amp; Sammouda, 1992), (Simard et al., 1992), (Melamed, 1999) utilisent les
similarit&#233;s graphiques entre les langues (cognates) pour mettre des mots en correspondance. En
suivant l&#8217;hypoth&#232;se de (Kay, 1988), cette technique am&#233;liore les alignements phrastiques
</p>
<p>Les hypoth&#232;ses sous-jacentes aux m&#233;thodes d&#8217;alignement de type (Kay, 1988) et (Gale &amp;
Church, 1993), pour un alignement d&#8217;une paire de texte au grain phrase, peuvent &#234;tre r&#233;sum&#233;es
de la fa&#231;on suivante (V&#233;ronis, 2000) :
</p>
<p>&#8211; l&#8217;ordre des phrases dans les deux textes est identique ou tr&#232;s proche ;
&#8211; les textes contiennent peu de suppressions ou d&#8217;adjonctions ;
</p>
<p>368</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction endog&#232;ne d&#8217;une structure de document pour un alignement multilingue
</p>
<p>&#8211; les alignements 1 : 1 sont tr&#232;s largement majoritaires et les rares alignements m : n sont
limit&#233;s a de petites valeurs de m et n (&#8776; 2).
</p>
<p>M&#234;me si ces hypoth&#232;ses paraissent l&#233;gitimes, les syst&#232;mes d&#8217;alignement se basant dessus ren-
contrent de grandes difficult&#233;s si les documents comportent des diff&#233;rences structurelles (par
exemple : date figurant au d&#233;but d&#8217;un texte et &#224; la fin d&#8217;un autre).
</p>
<p>2.2 Alignement sous-phrastique
</p>
<p>Dans le cadre de l&#8217;alignement en phrases, la mise en correspondance de mots n&#8217;est pas le but
premier mais seulement un amor&#231;age : on se satisfait ici d&#8217;un alignement grossier de mots. Si
l&#8217;ordre des phrases de deux traductions est plus ou moins respect&#233;, il en est autrement d&#232;s que
l&#8217;on se situe au niveau de la phrase. L&#8217;insertion d&#8217;adverbes ou d&#8217;adjectifs dans une expression
ou encore la permutation entre deux propositions d&#8217;une phrase ne permet pas de faire les m&#234;mes
suppositions que pour l&#8217;alignement au niveau de la phrase. De plus, les ph&#233;nom&#232;nes d&#8217;aggluti-
nation et de flexions &#233;branlent les m&#233;thodes statistiques bas&#233;es sur la comparaison de cha&#238;nes
de caract&#232;res constantes
</p>
<p>L&#8217;alignement en &#233;l&#233;ments sous-phrastiques consiste &#224; d&#233;tecter ces &#233;l&#233;ments puis &#224; les mettre
en correspondance. Or, s&#233;parer ces deux &#233;tapes est d&#233;licat car d&#233;terminer la nature exacte des
&#233;l&#233;ments sous-phrastiques en jeu (par exemple : mots, expressions, chunk, propositions) d&#233;pend
aussi bien de la langue cible que de la langue source (par exemple : &quot;rideau de fer&quot; se traduit
par &quot;Eisenvorhang&quot; en allemand et &quot;iron curtain&quot; en anglais). L&#8217;utilisation d&#8217;outils statistiques
est donc extr&#234;mement d&#233;licat dans de telles conditions et choisir un de ces outils se r&#233;v&#232;le
&#234;tre du &quot;cas par cas&quot; en fonction des langues &#224; aligner. De plus, la plupart des expressions
sont seulement &quot;semi-fig&#233;es&quot; et peuvent &#234;tre alt&#233;r&#233;es par certaines op&#233;rations (flexion, insertion
d&#8217;adjectifs, passivation...).
</p>
<p>(Giguet, 2005) consid&#232;re le probl&#232;me d&#8217;alignement sous-phrastique comme &#233;tant celui de l&#8217;ap-
pariement de suites de mots ayant une r&#233;partition similaire &#224; travers les textes analys&#233;s. Ce
choix de traitement statistique influe sur les r&#233;sultats. La r&#233;partition de mots ayant une graphie
identique &#224; travers le document d&#233;pend des caract&#232;res flexionnel et agglutinant de la langue
consid&#233;r&#233;e. Une analyse morpho-endog&#233;ne des documents permet alors des alignements satis-
faisants entre des documents anglais et grecque ; mais ne r&#233;sout pas la comparaison entre deux
documents de langues ayant un caract&#232;re agglutinant diff&#233;rent, tel que l&#8217;anglais et le finnois.
</p>
<p>(Zimina, 2004) applique une approche textom&#233;trique sur des corpus multilingues. Sur un texte
parall&#232;le fran&#231;ais-anglais-russe, elle montre que lorsque qu&#8217;un mot est dot&#233; d&#8217;un large &#233;ventail
de sens dans le corpus, la comparaison des fr&#233;quences totales des formes graphiques ne consti-
tue pas toujours une bonne indication pour l&#8217;appariement (par exemple : la correspondance
d&#8217;un mot polys&#233;mique comme &quot;droit&quot;). L&#8217;&#233;tude des formes graphiques en contexte (avec leur
voisinage, les mots les entourant) permet alors de lever certaines des ambigu&#239;t&#233;s r&#233;siduelles. Au
contact d&#8217;autres mots associ&#233;s sur l&#8217;axe syntagmatique, diff&#233;rents composants du sens du mot
sont activ&#233;s et il devient possible d&#8217;en tenir compte lors de l&#8217;appariement. La r&#233;partition d&#8217;un
mot et la r&#233;partition des mots voisins sont utilis&#233;s comme &#233;l&#233;ments de comparaison.
</p>
<p>La difficult&#233; principale de l&#8217;alignement &#224; ce grain r&#233;side dans la difficult&#233; &#224; cerner les &#233;l&#233;ments
que l&#8217;on veut aligner, les ph&#233;nom&#232;nes linguistiques sont plus nombreux (sans pour autant que
l&#8217;un se d&#233;tache des autres) et sont diff&#233;rents suivant les langues. L&#8217;introduction de connaissances
linguistiques est alors relativement co&#251;teuse et l&#8217;on devient d&#233;pendant des langues trait&#233;es.
</p>
<p>369</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Romain BRIXTEL
</p>
<p>3 Quel grain pour un alignement multilingue ?
</p>
<p>Un des points qui &#233;merge de cette vision globale de l&#8217;alignement est que les traitements &#224; un
grain affectent ceux &#224; d&#8217;autres grains. D&#8217;une part (Kay, 1988) se base sur ce que l&#8217;on peut
appeler un alignement grossier au grain mot pour un alignement de phrases, d&#8217;autre part un
alignement &#224; un grain phrastique peut &#234;tre un pr&#233;alable &#224; l&#8217;alignement de mots ou de suite de
mots ((Zimina, 2004), (Giguet, 2005)).
</p>
<p>Les indices majoritairement utilis&#233;s 1 proviennent d&#8217;une vision de l&#8217;alignement comparable &#224;
celle abord&#233;e sur les probl&#232;mes de traitements de flux de caract&#232;res ou de s&#233;quence de mots.
D&#8217;autre part, l&#8217;alignement a &#233;t&#233; abord&#233; comme un probl&#232;me de d&#233;coupe de textes et de mise en
correspondance des morceaux d&#233;coup&#233;s (typiquement, d&#233;couper le texte en phrases puis trou-
ver les correspondances entre elles, ou trouver la couverture maximale entre les &#233;l&#233;ments issus
de la d&#233;coupe de deux phrases align&#233;es). La hi&#233;rarchie texte &#8594; paragraphe &#8594; phrase &#8594;
expression &#8594; mot est alors la plus utilis&#233;e pour d&#233;finir les grains qui seront trait&#233;s. L&#8217;origi-
nalit&#233; de la m&#233;thode propos&#233;e dans cette article est de se placer en parall&#232;le de cette hi&#233;rarchie
sans pour autant l&#8217;ignorer.
</p>
<p>Le Web est le plus grand vecteur de diffusion de ces textes, il les affecte alors naturellement.
Voir l&#8217;alignement autrement qu&#8217;en envisageant exclusivement les objets analys&#233;s comme des
flux de caract&#232;res va dans ce sens : l&#8217;utilisation de liens hypertextes, d&#8217;images, de tableaux ou
d&#8217;autres applications de mise en forme mat&#233;rielle (MFM) telles que des marques de graisse et
d&#8217;emphase, affecte le statut des traductions disponibles. En consid&#233;rant ces traductions comme
des documents, les multitextes d&#233;crits dans la litt&#233;rature peuvent &#234;tre abord&#233;s comme des &quot;mul-
tidocuments&quot;.
</p>
<p>Tr&#232;s peu de techniques prennent en compte l&#8217;aspect r&#233;ellement multilingue des multidocuments
(qui se r&#233;sument dans la litt&#233;rature majoritairement &#224; des multidocuments de deux documents,
ou bi-documents) qui est l&#8217;essence m&#234;me des multidocuments. On peut se demander si &#224; trop
s&#8217;attacher &#224; peu de langues, nous n&#8217;obtenons pas des m&#233;thodes de traitement ad hoc : le multi-
linguisme est une force qui permet l&#8217;abstraction alors que se cantonner &#224; un nombre de langues
r&#233;duit oriente les m&#233;thodes de traitement que l&#8217;on peut appliquer. (Simard, 2000) montre que
l&#8217;ajout de langues rends plus fiable les alignements g&#233;n&#233;r&#233;s automatiquement, mais sa m&#233;thode
se r&#233;sume plus &#224; l&#8217;utilisation conjointe de plusieurs bi-documents qu&#8217;un multidocument dans
son ensemble.
</p>
<p>Le nombre de langues peut agir comme un filtre suffisamment fort pour contraindre l&#8217;apparition
de r&#233;sultats. Aussi, m&#234;me si l&#8217;on veut tendre vers un id&#233;al multilingue maximal, il est toujours
possible d&#8217;exclure une langue d&#8217;un multidocument du traitement. Le fait de remarquer qu&#8217;une
langue ou qu&#8217;un type de document est &quot;r&#233;calcitrant&quot; &#224; une hypoth&#232;se que l&#8217;on a formul&#233; peut
nous apprendre beaucoup sur le document/la langue (ou le groupe de langues/documents) exclu
et la fa&#231;on d&#8217;aborder le multidocument.
</p>
<p>Collectant et diffusant des communiqu&#233;s de presse de l&#8217;Union Europ&#233;enne sous format &#233;lectro-
nique &#224; travers leur site Web, Europa 2 permet de r&#233;cup&#233;rer des multidocuments comprenant des
documents &#233;crits dans plus de vingt langues diff&#233;rentes. A partir d&#8217;un corpus d&#8217;&#233;tude 3 extrait de
</p>
<p>1Longueur des phrases, contenu des phrases (principalement : mots ou suite de mots), position des phrases ou
d&#8217;&#233;l&#233;ments sous-phrastiques (mots ou suite de mots), distance graphique d&#8217;&#233;l&#233;ments sous-phrastiques (cognates),
patron linguistique d&#8217;extraction propre &#224; une langue ou &#224; une famille de langue, etc.
</p>
<p>2http://europa.eu/
363 multidocuments de plus de 16 documents/langues chacun.
</p>
<p>370</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction endog&#232;ne d&#8217;une structure de document pour un alignement multilingue
</p>
<p>ce site, nous nous orientons vers un alignement prenant en compte simultan&#233;ment le maximum
de langues en parall&#232;le &#224; la hi&#233;rarchie texte&#8594; paragraphe&#8594; phrase&#8594; expression&#8594; mot.
Il faut alors trouver les invariants qui peuvent &#234;tre d&#233;tect&#233;s dans tous les documents pour d&#233;finir
les bases d&#8217;un treillis d&#8217;informations robuste.
</p>
<p>4 La MFM : un invariant de structure multilingue ?
</p>
<p>Les documents extraits d&#8217;Europa se pr&#233;sentent sous la forme de documents XHTML 4. De
nombreuses traces non-textuelles peuvent y &#234;tre rep&#233;r&#233;es via la MFM telles que les tableaux,
les s&#233;parations horizontales (sauts de ligne via la balise &lt;br/&gt; ou les traits horizontaux via la
balise &lt;hr/&gt;), l&#8217;application de graisse et d&#8217;italique, voir des liens hypertextes 5. L&#8217;avantage de
ces marques est qu&#8217;elles mettent en valeur des zones &#224; l&#8217;int&#233;rieur des documents. Une phrase
ayant une MFM particuli&#232;re, en plus d&#8217;&#234;tre mise en valeur dans son int&#233;gralit&#233;, met aussi en
avant chaque &#233;l&#233;ment dont elle est compos&#233;e (chunks, propositions, mots ou caract&#232;res). Une
approche consiste &#224; se demander si ces marques peuvent scinder le document en plusieurs par-
ties. Par exemple, en d&#233;tectant une ligne de s&#233;paration dans un document il est possible de
consid&#233;rer deux zones, celle avant la ligne et celle situ&#233;e apr&#232;s. Si cette s&#233;paration est pr&#233;sente
dans tous les documents du multidocument, alors nous pouvons mettre en relation les zones
ainsi d&#233;gag&#233;es.
</p>
<p>Il parait douteux d&#8217;effectuer une dichotomie sur un document suivant l&#8217;apparition d&#8217;un &#233;l&#233;ment
sous-phrastique mis en valeur (par exemple : un mot mis en gras). Au grain sous-phrastique,
sa position dans la phrase est affect&#233;e par les r&#232;gles de construction propre &#224; la langue du
document. A ce grain, ces indices sont des marques caract&#233;risant les grains dans lesquels ils
sont inclus. Comme les cognates, ils sont d&#233;tect&#233;s pour marquer ces grains (les phrases pour les
cognates) et les aligner ; ils ne sont pas utilis&#233;s pour diviser le document.
</p>
<p>Si le grain phrase n&#8217;est pas appropri&#233;, nous consid&#233;rons un grain sup&#233;rieur. Un alin&#233;a 6 peut
ainsi &#234;tre mis en gras afin qu&#8217;il soit assimil&#233; &#224; un titre de partie. La mise en &#233;vidence de passage
peut &#234;tre une finalit&#233; en soit ou un moyen d&#8217;organiser le discours. Par l&#8217;utilisation de titres,
de r&#233;sum&#233;s ou de passages ayant une MFM diff&#233;rente de celle appliqu&#233;e au corps de texte, le
document est d&#233;coup&#233; en diff&#233;rents segments.
</p>
<p>L&#8217;alignement peut &#234;tre vu comme l&#8217;extraction d&#8217;&#233;quivalences s&#233;mantiques. Consid&#233;rer cet usage
de la MFM comme un vecteur de sens pr&#233;serv&#233; dans le processus de traduction nous am&#232;ne &#224;
exploiter ces marques en tant qu&#8217;invariant entre les documents de diff&#233;rentes langues.
</p>
<p>Cette segmentation &#224; un grain plus &#233;lev&#233; que la phrase permet de restreindre les espaces de
recherche 7 dans le cadre de la recherche d&#8217;&#233;quivalences s&#233;mantiques entre les documents d&#8217;un
multidocument. Par exemple, l&#8217;alignement phrastique suppose que chaque phrase est alignable
avec une autre ayant une position tr&#232;s proche dans le texte. D&#233;gager des zones permettrait de
cibler nos recherches pour d&#233;gager les &#233;quivalences : une phrase appartenant &#224; une zone est
potentiellement alignable avec les phrases des autres documents appartenant &#224; la m&#234;me zone
du texte. Et si cette m&#233;thode parait viable dans le cadre de l&#8217;alignement phrastique, elle peut
</p>
<p>4eXtensible HyperText Markup Language, recommandation w3c http://www.w3.org/MarkUp/
#recommendations
</p>
<p>5Les liens hypertextes ne sont pas des marques de MFM mais leurs mises en relief en font parti.
6http://atilf.atilf.fr/&#8212; Texte compris entre deux retours &#224; la ligne.
7&#171; Diviser pour r&#233;gner &#187;.
</p>
<p>371</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Romain BRIXTEL
</p>
<p>aussi l&#8217;&#234;tre dans les grains contenus dans les zones de recherches d&#233;tect&#233;es (les grains contenus
peuvent &#234;tre des paragraphes, des mots, des expressions...).
</p>
<p>4.1 Caract&#233;risation des alin&#233;as par la MFM
</p>
<p>Nous partons d&#8217;un d&#233;coupage en alin&#233;as des documents. Sur des documents XHTML, ces ali-
n&#233;as peuvent &#234;tre d&#233;tect&#233;s gr&#226;ce aux balises de bloc (telles que &lt;p&gt;, &lt;h1&gt;, &lt;h2&gt;, &lt;div&gt;) en
opposition aux balises en ligne (comme &lt;span&gt;, &lt;strong&gt;, &lt;em&gt;). D&#8217;autres m&#233;thodes comme
celles utilisant les techniques de reconnaissances de texte 8 peuvent &#234;tre utilis&#233;es pour arriver
&#224; cet objectif. Seules les MFM appliqu&#233;es sur un alin&#233;a dans son ensemble nous serviront &#224;
diviser les documents en parties.
</p>
<p>La premi&#232;re &#233;tape consiste &#224; d&#233;tecter la MFM utilis&#233;e pour chaque alin&#233;a afin de permettre une
segmentation du document. Or, une MFM n&#8217;est pas syst&#233;matiquement appliqu&#233;e tout le long
d&#8217;un alin&#233;a, comme nous pouvons le remarquer sur l&#8217;exemple ci-dessous 9 :
</p>
<p>[. . .] Ir iekl,autas TRIPS un PVO prasi-bas, [. . .]
</p>
<p>Les acronymes &quot;TRIPS&quot; et &quot;PVO&quot; ont &#233;t&#233; mis en valeur dans cet alin&#233;a en modifiant la MFM
qui a &#233;t&#233; attribu&#233; en majorit&#233;. Si nous consid&#233;rons les MFM appliqu&#233;es &#224; un alin&#233;a seulement
si elles sont pr&#233;sentes &#224; tout endroit du texte, nous ne caract&#233;risons pas correctement cet alin&#233;a.
Pour pallier ces probl&#232;mes, nous consid&#233;rons la MFM d&#8217;un alin&#233;a de la fa&#231;on suivante :
</p>
<p>&#8211; soit mfmdeb l&#8217;ensemble des MFM appliqu&#233;es au premier mot de l&#8217;alin&#233;a ;
&#8211; soit mfmfin l&#8217;ensemble des MFM appliqu&#233;e au dernier mot de l&#8217;alin&#233;a ;
&#8211; la MFM caract&#233;risant l&#8217;alin&#233;a est d&#233;finie par mfmal = mfmdeb &#8746; mfmfin.
Nous &#233;vitons les probl&#232;mes cit&#233;s ci-dessus ainsi que ceux pouvant &#234;tre provoqu&#233;s par l&#8217;usage de
lettrine ou encore ceux provoqu&#233;s par un usage important d&#8217;une MFM dans un alin&#233;a, comme
par exemple dans le cas d&#8217;une citation en italique et occupant une grande partie de l&#8217;alin&#233;a dans
lequel elle est situ&#233;e.
</p>
<p>4.2 D&#233;coupage du document par la MFM
</p>
<p>La figure (FIG. 1) pr&#233;sente une visualisation des documents estonien (et), italien (it) et n&#233;erlan-
dais (nl) 10 segment&#233;s en alin&#233;as . La segmentation est faite sur 20 langues m&#234;me si nous n&#8217;en
montrons ici que 3. Un alin&#233;a est repr&#233;sent&#233; par l&#8217;identifiant de sa MFM.
</p>
<p>Chaque num&#233;rotation des identifiants est interne &#224; chaque langue. Par exemple, un document
peut &#234;tre &#233;crit en majorit&#233; en italique l&#224; o&#249; un autre est ecrit en romain : l&#8217;invariant consid&#233;r&#233;
n&#8217;est donc pas un invariant de forme mais de structure.
</p>
<p>De cette visualisation, nous pouvons pour un document donn&#233; d&#233;gager deux types d&#8217;alin&#233;as :
les alin&#233;as nombreux et contigus (contenant le corps du texte) et les autres (r&#233;v&#233;lateurs d&#8217;une
</p>
<p>8OCR
9Extrait du document letton IP\05\1659
</p>
<p>http://europa.eu/rapid/pressReleasesAction.do?reference=IP/05/1659&amp;format=
HTML&amp;aged=1&amp;language=LV&amp;guiLanguage=en
</p>
<p>10Extrait du multidocument IP\05\817. http://europa.eu/rapid/pressReleasesAction.do?
reference=IP/05/817&amp;format=HTML&amp;aged=1&amp;language=IT&amp;guiLanguage=en
</p>
<p>372</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction endog&#232;ne d&#8217;une structure de document pour un alignement multilingue
</p>
<p>id. extrait de l&#8217;alin&#233;a avec sa MFM
</p>
<p>a Bruxelles 30 giugno 2005
</p>
<p>b 2006 - [. . .] professionale
c La Commissione [. . .] lavoro.
</p>
<p>a Lavorare in un [. . .] di 10 anni.
</p>
<p>a Vladim&#237;r Spidla [. . .] lavorare&quot;.
</p>
<p>a Su un bilancio [. . .] professionale.
</p>
<p>a Nel 2006 [. . .] commissari.
</p>
<p>alignement au grain document
</p>
<p>et 1 1 2 3 1 1 1
</p>
<p>it a b c a a a a
</p>
<p>nl &#945; &#945; &#946; &#947; &#945; &#945; &#945; &#945; &#945;
</p>
<p>FIG. 1 &#8211; Alin&#233;as du document it et identifiants de MFM d&#8217;alin&#233;a pour les documents et, it et nl
</p>
<p>structure). En faisant cette distinction, nous regroupons automatiquement les suites contigues
d&#8217;alin&#233;as de m&#234;me MFM. Les alin&#233;as mis en valeur sont alors ceux qui brisent ces suites, que
nous alignons aussi entre eux (alin&#233;as &quot;b&quot; et &quot;c&quot; pour le document it - FIG. 2).
</p>
<p>id. extrait de l&#8217;alin&#233;a avec sa MFM
</p>
<p>a Bruxelles 30 giugno 2005
</p>
<p>b 2006 - [. . .] professionale
c La Commissione [. . .] lavoro.
</p>
<p>a Lavorare in un [. . .] di 10 anni.
</p>
<p>a Vladim&#237;r Spidla [. . .] lavorare&quot;.
</p>
<p>a Su un bilancio [. . .] professionale.
</p>
<p>a Nel 2006 [. . .] commissari.
</p>
<p>alignement 1
</p>
<p>et 1 1 2 3 1 1 1
</p>
<p>it a b c a a a a
</p>
<p>nl &#945; &#945; &#946; &#947; &#945; &#945; &#945; &#945; &#945;
</p>
<p>FIG. 2 &#8211; D&#233;coupage du document italien pour l&#8217;alignement 1
</p>
<p>Cependant, consid&#233;rer seulement les suites d&#8217;alin&#233;as comme pr&#233;c&#233;demment (FIG. 2) ne r&#233;v&#232;le
pas toutes les &#233;quivalences. Si nous alignons les titres entre eux et les sous-parties entre elles
de fa&#231;on ind&#233;pendante, nous obtenons un d&#233;coupage qui restreint simplement les espaces de
recherche. Nous pouvons proposer manuellement les &#233;quivalences suivantes (FIG. 3) qui ne
sont pas d&#233;voil&#233;es par l&#8217;alignement automatique op&#233;r&#233; pr&#233;c&#233;demment.
</p>
<p>id. extrait de l&#8217;alin&#233;a avec sa MFM
</p>
<p>a Bruxelles 30 giugno 2005
</p>
<p>b 2006 - [. . .] professionale
c La Commissione [. . .] lavoro.
</p>
<p>a Lavorare in un [. . .] di 10 anni.
</p>
<p>a Vladim&#237;r Spidla [. . .] lavorare&quot;.
</p>
<p>a Su un bilancio [. . .] professionale.
</p>
<p>a Nel 2006 [. . .] commissari.
</p>
<p>alignement 2
</p>
<p>et 1 1 2 3 1 1 1
</p>
<p>it a b c a a a a
</p>
<p>nl &#945; &#945; &#946; &#947; &#945; &#945; &#945; &#945; &#945;
</p>
<p>FIG. 3 &#8211; D&#233;coupage du document italien pour l&#8217;alignement 2
</p>
<p>2, b et &#946; repr&#233;sentent des titres dans les trois documents. L&#8217;&#233;quivalence montr&#233;e en (FIG. 3) d&#233;-
voile le fait que les parties qui suivent chaque titre peuvent &#234;tre aussi align&#233;es. Afin de multiplier
les alignements possibles sans pour autant perdre l&#8217;alignement simple vu pour l&#8217;alignement 1
</p>
<p>373</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Romain BRIXTEL
</p>
<p>(FIG. 2), nous nous orientons vers une m&#233;thode d&#8217;extraction de structure des documents du
multidocument.
</p>
<p>4.3 Structuration du document par la MFM
</p>
<p>Le but ici n&#8217;est pas de tenter la d&#233;tection de la structure logique des documents, mais de r&#233;ussir &#224;
calculer une repr&#233;sentation de structure. Nous ne cherchons pas &#224; savoir si un &#233;l&#233;ment d&#233;tect&#233; est
une signature ou un r&#233;sum&#233; m&#234;me si cette &#233;tape peut servir de base &#224; d&#8217;&#233;ventuelles applications
allant dans ce sens. Nous cherchons simplement &#224; rendre les documents comparables entre eux.
</p>
<p>Dans l&#8217;exemple pr&#233;c&#233;dant 1, a et &#945; repr&#233;sentent la MFM du corps de texte, les autres alin&#233;as
conditionnent alors la structure. Pour diff&#233;rencier ces alin&#233;as, nous utilisons l&#8217;ordre d&#8217;appari-
tion de ceux-ci dans le document. Dans le but de repr&#233;senter la structure sous forme d&#8217;arbre,
nous consid&#233;rons que descendre dans la hi&#233;rarchie arborescente du document s&#8217;effectue suivant
l&#8217;ordre de lecture du document en fonction des alin&#233;as ayant une MFM diff&#233;rente de celle re-
pr&#233;sentant le corps de texte. Aussi, deux alin&#233;as ne repr&#233;sentant pas le corps de texte et ayant la
m&#234;me MFM sont &#224; la m&#234;me profondeur de l&#8217;arbre, au m&#234;me niveau de hi&#233;rarchie. Suivant ces
remarques, nous &#233;tablissons que :
</p>
<p>&#8211; Chaque alin&#233;a ayant une MFM repr&#233;sentant le corps de texte
- poss&#232;de un niveau de hi&#233;rarchie d&#233;pendant des alin&#233;as pr&#233;c&#233;demment rencontr&#233;s ;
- n&#8217;augmente pas le niveau de hi&#233;rarchie des prochains alin&#233;as.
</p>
<p>&#8211; Chaque alin&#233;a ayant une MFM diff&#233;rente de celle repr&#233;sentant le corps de texte
- poss&#232;de un niveau de hi&#233;rarchie d&#233;pendant des alin&#233;as pr&#233;c&#233;demment rencontr&#233;s. Ce ni-
veau est alors fix&#233; pour tous les alin&#233;as ayant la m&#234;me MFM ;
</p>
<p>- augmente le niveau de hi&#233;rarchie des prochains alin&#233;as.
</p>
<p>Le tableau (FIG. 4) montre l&#8217;application de la m&#233;thode sur le document italien.
</p>
<p>modification de niveau de hierarchie +1 +1
</p>
<p>niveau de hierarchie 1 1 2 3 3 3 3
</p>
<p>alin&#233;as a b c a a a a
</p>
<p>FIG. 4 &#8211; Calcul des niveaux de hierarchie pour le document italien
</p>
<p>Afin d&#8217;illustrer la mise en correspondance des niveaux de hi&#233;rarchie de deux alin&#233;as ayant deux
MFM identiques, le tableau (FIG. 5) pr&#233;sente l&#8217;application de la m&#233;thode de hi&#233;rarchisation sur
un document ayant une structure plus complexe 11.
</p>
<p>modification de niveau de hierarchie +1 +1 +1 +1
</p>
<p>niveau de hierarchie ( ! :fixe les niveaux *, * :niveau fix&#233;) 1 1 2 3 3 3 3 ! 4 3* 4 4 4
</p>
<p>alin&#233;as A B C A A A D A D A A A
</p>
<p>FIG. 5 &#8211; Calcul des niveaux de hierarchie pour le document fran&#231;ais (IP\05\606)
</p>
<p>11Document fran&#231;ais du multidocument IP\05\606. http://europa.eu/rapid/
pressReleasesAction.do?reference=IP/05/606&amp;format=HTML&amp;aged=1&amp;language=
FR&amp;guiLanguage=en
</p>
<p>374</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction endog&#232;ne d&#8217;une structure de document pour un alignement multilingue
</p>
<p>Il est possible alors de g&#233;n&#233;rer les arborescences &#224; partir de la hi&#233;rarchisation qui a &#233;t&#233; calcul&#233;e.
La racine (niveau 0) repr&#233;sente pour chaque arbre le grain englobant les alin&#233;as : le document.
</p>
<p>FIG. 6 &#8211; Structures g&#233;n&#233;r&#233;es - documents estonien, italien et n&#233;erlandais
</p>
<p>Pour comparer les arbres entre eux, nous reprenons les crit&#232;res utilis&#233;s pour l&#8217;alignement 2
(FIG. 3). Les suites connexes de feuilles sont regroup&#233;es pour permettre une comparaison entre
les documents de structures &#233;quivalentes.
</p>
<p>FIG. 7 &#8211; Alignement des structures
</p>
<p>En regroupant ainsi les structures, nous obtenons une classe d&#8217;&#233;quivalence de structures (ou
structure align&#233;e). Chaque noeud et chaque feuille contiennent des suites d&#8217;alin&#233;as align&#233;es.
Les documents sont aussi regroup&#233;s dans le m&#234;me noeud (FIG. 8 alignement A). Ceci va avec
l&#8217;id&#233;e que cr&#233;er un multidocument &#233;quivaut &#224; aligner des documents entre eux (ou &#224; aligner
au grain document). D&#8217;autres alignements peuvent &#234;tre r&#233;v&#233;l&#233;s dans les relations fr&#232;re-fr&#232;re
(FIG. 8 alignement B) ou p&#232;re-fils (FIG. 8 alignement C).
</p>
<p>L&#8217;alignement 1 (FIG. 2) peut &#234;tre retrouv&#233;s en consid&#233;rant tous les alignements contenus dans
chaque noeud et chaque feuille de la structure align&#233;e. L&#8217;alignement 2 (FIG. 3) est r&#233;cup&#233;rable
via l&#8217;alignement C (FIG. 8) et les alignements issus des autres noeuds.
</p>
<p>5 Perspectives
</p>
<p>En traitant ainsi un multidocument, nous souhaitons obtenir qu&#8217;une seule classe d&#8217;&#233;quivalence
afin d&#8217;avoir un alignement sur toutes les langues du multidocument. Sur le corpus de 63 multi-
documents trait&#233;s, 27 multidocuments poss&#232;dent une seule classe d&#8217;&#233;quivalence, 16 sont divis&#233;s
en deux classes (dont une repr&#233;sente 1 ou 2 documents). Les autres multidocuments sont divi-
s&#233;s en plusieurs classes (&lt; 6) ; une classe d&#8217;&#233;quivalence regroupe une majorit&#233; absolue des
documents et les autres contiennent 1 ou 2 documents. Ces multidocuments sont compos&#233;s de
documents ayant des structures diff&#233;rentes : certains poss&#232;dent des annexes ou des titres l&#224; o&#249;
les documents de la classe majoritaire n&#8217;en ont pas.
</p>
<p>alignement A et it nl
</p>
<p>alignement B 1 1 2 a b &#945; &#945; &#946;
</p>
<p>alignement C 3 1 1 1 c a a a a &#947; &#945; &#945; &#945; &#945;
</p>
<p>FIG. 8 &#8211; Exemple d&#8217;alignements pouvant &#234;tre d&#233;tect&#233;s automatiquement
</p>
<p>375</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Romain BRIXTEL
</p>
<p>Dans cette continuit&#233;, nous nous attacherons &#224; &#233;tablir des politiques de comparaisons de classes
d&#8217;&#233;quivalence pour aligner les documents ayant des structures diff&#233;rentes. Une approche consiste
&#224; utiliser les cognates pour aligner les suites d&#8217;alin&#233;as les contenant. Il est possible d&#8217;utiliser les
langues proches (o&#249; la pr&#233;sence de cognates est forte) se situant dans des classes diff&#233;rentes
pour les comparer. Une autre voie consiste &#224; utiliser les longueurs des suites d&#8217;alin&#233;as (de fa&#231;on
analogue &#224; (Gale &amp; Church, 1993)) pour envisager des alignements m : n (o&#249; on pourra se
demander si m,n &#8805; 2) entre ces suites (par exemple si des annexes ou des titres sont ajout&#233;s).
Enfin, nous pouvons calculer les distances d&#8217;&#233;ditions des arbres de structure.
</p>
<p>Cette approche apporte des indices suppl&#233;mentaires pour affiner les m&#233;thodes d&#233;j&#224; existantes et
avoir une nouvelle vue sur l&#8217;alignement.
</p>
<p>R&#233;f&#233;rences
DEBILI F. &amp; SAMMOUDA E. (1992). Appariements de phrases de textes bilingues fran&#231;ais-
anglais et fran&#231;ais-arabes. In Actes de COLING-92, p. 528&#8211;524, Nantes : COLING-92.
GALE W. &amp; CHURCH K. (1993). Indentifying word correspondences in parallel text. In
Fourth DARPA Speech and Natural Language Workshop, p. 152&#8211;157.
GIGUET E. (2005). Multi-grained alignment of parallel texts with endogenous ressources.
Borovets, Bulgaria : Modern Approaches in Translation Technologies Workshop.
KAY M. (1988). Text-translation alignment. Rapport interne, Xerox Palo Alto Research
Center.
MELAMED D. (1999). Bitext maps and alignment via pattern recognition. Computational
Linguistics, p. 107&#8211;130.
SIMARD M. (2000). Three languages are better than two. In J. VERONIS, Ed., Parrallel Text
Processing.
SIMARD M., FOSTER G. &amp; ISABELLE P. (1992). Using cognates to align sentences in bilin-
gual corpora. In proceedings of TMI-92.
V&#201;RONIS J. (2000). Alignement de corpus parall&#232;le. In J.-M. PIERREL, Ed., Ingienerie des
langues, p. 151&#8211;171.
ZIMINA M. (2004). Topographie bitextuelle et approches quantitatives de l&#8217;extraction de
ressources traductionnelles &#224; partir de corpus parall&#232;les. Universit&#233; de la Sorbonne Nouvelle.
</p>
<p>376</p>

</div></div>
</body></html>