<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L&#8217;analyse morphologique des r&#233;ponses d&#8217;apprenants</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>L&#8217;analyse morphologique des r&#233;ponses d&#8217;apprenants 
</p>
<p>Alexia Blanchard 
LIDILEM &#8211; Universit&#233; Stendhal, Grenoble 
Alexia.Blanchard@u-grenoble3.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons une approche empirique de l&#8217;&#233;valuation automatique des 
r&#233;ponses d&#8217;apprenants au sein d&#8217;un syst&#232;me d&#8217;Apprentissage des Langues Assist&#233; par 
Ordinateur (ALAO). Nous proposons la mise en place d&#8217;un module d&#8217;analyse d&#8217;erreurs 
attest&#233;es sur corpus qui s&#8217;appuie sur des techniques robustes de Traitement Automatique des 
Langues (TAL). Cet article montre la r&#233;alisation d&#8217;un module d&#8217;analyse de morphologie 
flexionnelle, en situation hors-contexte, &#224; partir d&#8217;un mod&#232;le linguistique existant. 
</p>
<p>Abstract. We present an empirical approach to the automated evaluation of learner's 
answers in a CALL system (Computer Assisted Language Learning). We suggest the 
realization of an error parsing module using NLP techniques (Natural Language Processing). 
The errors stem from a language learners corpus. This article describes the implementation, 
from an existing linguistic model, of an inflectional context-free morphology parser. 
</p>
<p>Mots-cl&#233;s : TAL, ALAO, d&#233;tection d&#8217;erreurs, morphologie flexionnelle, r&#233;troaction(s). 
</p>
<p>Keywords: NLP, CALL, errors detection, inflectional morphology, feedback. 
</p>
<p>1 TAL et analyse des r&#233;ponses en ALAO 
L&#8217;Apprentissage des Langues Assist&#233; par Ordinateur (ALAO) a pour but le d&#233;veloppement 
d&#8217;outils et de ressources destin&#233;s &#224; l&#8217;apprentissage des langues. Parmi ces outils, nous 
trouvons les logiciels &#233;ducatifs qui proposent un aspect interactif (l&#8217;apprenant interagit avec 
le syst&#232;me), et &#233;galement, en th&#233;orie, un apprentissage individualis&#233;, personnalis&#233; et 
autonome. Deux apprenants peuvent acqu&#233;rir les m&#234;mes connaissances &#224; leur rythme, avec un 
parcours adapt&#233; au sein du logiciel. Il existe une typologie de ces logiciels (Lancien, 1997 ; 
Wyatt, 1988) : les logiciels d&#8217;exploration (l&#8217;apprenant simule une situation dans le but de 
rechercher des informations sur le r&#233;seau), les logiciels de r&#233;f&#233;rence (l&#8217;apprenant dispose 
d&#8217;outils pour l&#8217;aider dans sa recherche d&#8217;informations comme des encyclop&#233;dies) et les 
logiciels de structure (l&#8217;apprenant est soumis &#224; une auto&#233;valuation). Nous nous int&#233;ressons ici 
&#224; ce dernier type de logiciels, qui proposent des exercices, g&#233;n&#233;ralement structuraux, et plus 
particuli&#232;rement &#224; l&#8217;&#233;valuation automatique de ces exercices, qui constitue un des crit&#232;res de 
qualit&#233; du &#171; potentiel d&#8217;utilisation &#187; d&#8217;un logiciel d&#8217;apprentissage selon Nielsen (1993, p.20) : 
&#171; Errors messages should be expressed in plain language (no codes), precisely indicate the 
</p>
<p>437</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexia BLANCHARD
</p>
<p>problem, and constructively suggest a solution1 &#187;. 
Cette &#233;valuation implique la d&#233;tection des erreurs commises par l&#8217;apprenant et leur analyse 
afin de produire des r&#233;troactions adapt&#233;es (feed-back). Certains se sont demand&#233;s s&#8217;il &#233;tait 
possible d&#8217;utiliser des correcteurs orthographiques et grammaticaux existants pour corriger les 
erreurs de l&#8217;apprenant. Une &#233;tude (Cordier-Gauthier, Dion, 2002) a d&#233;montr&#233; que ces 
correcteurs ont tendance &#224; surd&#233;tecter par rapport &#224; la correction d&#8217;enseignants. De plus, 
l&#8217;analyse des erreurs propose plusieurs solutions pour une m&#234;me forme, ce qui limite leur 
utilisation dans un dispositif d&#8217;ALAO. 
</p>
<p>L&#8217;incapacit&#233; des syst&#232;mes d&#8217;ALAO &#224; prendre en compte les propri&#233;t&#233;s intrins&#232;ques &#224; une 
langue restreint leurs possibilit&#233;s. Les principales critiques de ces syst&#232;mes restent leur 
fermeture (contenus des exercices pr&#233;d&#233;finis et fig&#233;s), une d&#233;tection d&#8217;erreurs fond&#233;e sur de 
simples comparaisons de cha&#238;nes (pattern-matching), et par cons&#233;quent des r&#233;troactions / 
feed-back p&#233;dagogiquement peu adapt&#233;s &#224; l&#8217;apprenant, du type &#171; vrai/faux &#187;.  Ces aspects 
font d&#233;faut depuis toujours dans les travaux en ALAO (Antoniadis et al., 2005b).
Nous pensons que l&#8217;int&#233;gration d&#8217;outils de Traitement Automatique des Langues (TAL) peut 
permettre de d&#233;bloquer cette situation et d&#8217;am&#233;liorer l&#8217;analyse des r&#233;ponses (Antoniadis et al., 
2006). Le TAL (Traitement Automatique des Langues) est au carrefour entre linguistique et 
informatique, et ne consid&#232;re plus la langue comme une simple suite de caract&#232;res, mais 
comme un syst&#232;me &#224; deux niveaux (sens et forme) (Fuchs et al., 1993). 
</p>
<p>L&#8217;utilisation du TAL dans la conception de syst&#232;mes d&#8217;ALAO n&#8217;est certes pas une id&#233;e 
nouvelle. Certains projets comme Freetext, ont d&#233;velopp&#233; un logiciel d&#8217;ALAO pour des 
apprenants du fran&#231;ais (Granger et al., 2001). Pour ce faire, ils se sont fond&#233;s sur l&#8217;analyse du 
corpus FRIDA (French Interlanguage DAtabase), qui a abouti &#224; un &#233;tiquetage et une 
typologie des erreurs. Cette derni&#232;re a ensuite permis la cr&#233;ation d&#8217;un outil de d&#233;tection 
d&#8217;erreurs orthographiques, syntaxiques et s&#233;mantiques. Une &#233;valuation effectu&#233;e en 2003 sur 
120 phrases a permis de comparer le prototype de FreeText avec le correcteur de  Microsoft 
Word&#174; 2000 (L'Haire, Vandeventer, 2003). Les r&#233;sultats montrent que le syst&#232;me FreeText 
est relativement plus performant que Word&#174;. Toutefois, les auteurs s&#8217;accordent pour mettre 
en &#233;vidence la surd&#233;tection d&#8217;erreurs de la part du syst&#232;me Freetext, ph&#233;nom&#232;ne qui peut 
compl&#232;tement perturber l&#8217;apprenant en situation d&#8217;apprentissage. 
C&#8217;est pourquoi nous pr&#233;f&#233;rons privil&#233;gier une m&#233;thode empirique (1)  en utilisant des outils 
fiables du TAL (2) en r&#233;alisant un module d&#8217;analyse d&#8217;un certain type d&#8217;erreurs dans le but, &#224; 
long terme, de r&#233;aliser un syst&#232;me plus complet, int&#233;grable dans un syst&#232;me d&#8217;ALAO (3) en 
traitant des erreurs issues d&#8217;un corpus. 
Un premier travail a donc consist&#233; &#224; &#233;laborer un module d&#8217;analyse qui prend en entr&#233;e une 
forme simple (nom, adjectif ou verbe) et qui analyse ses traits morphologiques afin de 
d&#233;tecter une &#233;ventuelle erreur de morphologie flexionnelle. La sortie propose un ou plusieurs 
diagnostic(s) pour une m&#234;me forme, erron&#233;e ou non. Par exemple, la forme pla&#231;e est analys&#233;e 
comme une forme erron&#233;e du verbe placer &#224; la 1&#232;re personne du singulier de l&#8217;indicatif, du 
subjonctif et &#224; la 3&#232;me personne du singulier de l&#8217;indicatif, et du subjonctif (4 diagnostics). 
</p>
<p>Nous verrons dans un premier temps la m&#233;thodologie adopt&#233;e pour d&#233;finir les propri&#233;t&#233;s de 
cet analyseur, puis nous d&#233;crirons les travaux men&#233;s au CRISS pour l&#8217;analyse et la g&#233;n&#233;ration 
</p>
<p>1  &#171; Les messages d&#8217;erreurs doivent &#234;tre &#233;crits en langage naturel (pas de codes), ils doivent indiquer 
pr&#233;cis&#233;ment le probl&#232;me, et sugg&#233;rer une solution qui aidera l&#8217;apprenant &#224; rectifier son erreur &#187;. 
</p>
<p>438</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;analyse  morphologique des r&#233;ponses d&#8217;apprenants 
</p>
<p>morphologique dans un cadre autre que l&#8217;ALAO ; travaux que nous avons repris et adapt&#233;s &#224; 
notre sujet. Enfin, nous montrerons les premiers r&#233;sultats du prototype r&#233;alis&#233;. 
</p>
<p>2 Positionnement
Le domaine de l&#8217;ALAO est &#224; la crois&#233;e de plusieurs disciplines : didactique des langues, 
linguistique et TAL. La conception d&#8217;un syst&#232;me d&#8217;ALAO se doit, &#224; notre avis, de prendre en 
compte les aspects de ces diff&#233;rentes disciplines. 
En ce qui concerne l&#8217;&#233;valuation automatique des productions &#233;crites de l&#8217;apprenant, il est 
reconnu qu&#8217;un syst&#232;me d&#8217;ALAO ne peut &#234;tre didactiquement valide que s&#8217;il est capable 
d&#8217;analyser correctement ces productions afin de ne pas g&#233;n&#233;rer des r&#233;troactions erron&#233;es 
(R&#233;zeau, 2004). Une ma&#238;trise incompl&#232;te de l&#8217;analyse pourrait impliquer un apprentissage 
partiellement voire compl&#232;tement biais&#233;. 
Pour ce faire, nous avons pr&#233;f&#233;r&#233; brider dans un premier temps notre analyseur, en 
consid&#233;rant les contraintes des trois domaines concern&#233;s. Notre but n&#8217;est pas de proposer une 
analyse exhaustive des r&#233;ponses d&#8217;apprenants en production libre. Il faut &#234;tre conscient des 
fortes contraintes didactiques d&#8217;un syst&#232;me d&#8217;ALAO. En effet, une telle analyse doit 
permettre de g&#233;n&#233;rer automatiquement une, et une seule explication de chaque erreur pour 
que l&#8217;apprenant puisse comprendre et corriger ses lacunes. 
Se posent alors plusieurs probl&#232;mes : Quelles informations extraites de l&#8217;analyse permettent 
r&#233;ellement de pr&#233;dire une explication quant &#224; l&#8217;erreur ? Devons-nous traiter toutes les erreurs 
th&#233;oriquement possibles ou devons-nous cibler les erreurs les plus fr&#233;quentes chez un 
apprenant du fran&#231;ais ? 
Pour r&#233;pondre &#224; ces questions, nous avons choisi de nous appuyer sur l&#8217;outil TAL le plus 
fiable aujourd&#8217;hui, en l&#8217;occurrence l&#8217;analyse morphologique flexionnelle :  
&#171; La question des flexions grammaticales est, depuis longtemps clairement ma&#238;tris&#233;e [&#8230;] &#187;, 
(Fuchs et al., 1993, p. 102). 
Toutefois, l&#8217;analyse morphologique comme nous la concevons en TAL repose sur un texte 
correctement orthographi&#233;. Une telle analyse est donc diff&#233;rente d&#8217;une analyse 
morphologique des r&#233;ponses d&#8217;apprenants qui a pour but la g&#233;n&#233;ration d&#8217;une r&#233;troaction. Pour 
r&#233;aliser un tel analyseur, il nous a donc fallu effectuer un certain nombre de choix : 
</p>
<p>x Les types d&#8217;erreurs : Si nous nous penchons sur les &#233;tudes ant&#233;rieures en didactique 
des langues, des erreurs fr&#233;quentes de morphologie flexionnelle se d&#233;gagent : 
</p>
<p>x Erreurs de surg&#233;n&#233;ralisation (Fayol, 2001) : cette notion d&#233;note le fait que les 
apprenants ont tendance &#224; appliquer la r&#232;gle d&#8217;accord du pluriel sur une autre 
cat&#233;gorie (exemple : les attitudent).
</p>
<p>x Erreurs d&#8217;omission de flexions du nombre (Astolfi, 1997). 
</p>
<p>x Erreurs de g&#233;n&#233;ralisation (&#197;gren, 2005) : la g&#233;n&#233;ralisation concerne les erreurs 
d&#8217;utilisation d&#8217;une flexion d&#8217;un type de nom par exemple, sur un autre type de 
nom (exemple : les lieus).
</p>
<p>439</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexia BLANCHARD
</p>
<p>Notre mod&#233;lisation s&#8217;appuie sur ces tendances, mais &#233;galement sur des erreurs extraites du 
corpus FRIDA2 mis &#224; notre disposition dans le cadre du projet Idill3.
</p>
<p>x Le / les diagnostic(s) : Nous diff&#233;rencions les notions de diagnostic et de 
r&#233;troactions. Les r&#233;troactions sont les explications propos&#233;es &#224; l&#8217;apprenant pour lui expliquer 
son erreur, alors que les diagnostics sont l&#8217;ensemble des informations qui r&#233;sultent de 
l&#8217;analyse morphologique, sachant que plusieurs diagnostics peuvent &#234;tre associ&#233;es &#224; une 
m&#234;me forme. Nous pr&#233;f&#233;rons rester prudents en conservant toutes les interpr&#233;tations possibles 
pour une m&#234;me forme, afin de ne pas risquer de biaiser la qualit&#233; de la r&#233;troaction g&#233;n&#233;r&#233;e &#224; 
partir de ce / ces diagnostic(s). Chaque forme sera ainsi associ&#233;e &#224; son lemme, sa cat&#233;gorie 
syntaxique, ses traits morphologiques,  le type d&#8217;erreur morphologique (notre analyseur est 
capable d&#8217;analyser les formes correctes comme les formes erron&#233;es). Si n&#233;cessaire, la 
d&#233;sambigu&#239;sation pourra &#234;tre faite &#224; un niveau didactique (via le mod&#232;le de l&#8217;apprenant, le 
domaine d&#8217;apprentissage, etc.).  
</p>
<p>x L&#8217;algorithme d&#8217;analyse : A partir des deux premiers points &#233;nonc&#233;s ci-dessus (ce 
que prend en entr&#233;e l&#8217;analyseur et ce qu&#8217;il g&#233;n&#232;re en sortie), nous pouvons sch&#233;matiser le 
fonctionnement du module r&#233;alis&#233; de la fa&#231;on suivante : 
</p>
<p>   
</p>
<p>Exemple :
</p>
<p>Analyse
morphologique 
</p>
<p>D&#233;coupage(s) en 
base + flexion(s) 
</p>
<p>Codage du / des 
diagnostic(s) Feed-back
</p>
<p>Au pluriel, le nom milieu
ne prend pas un &#171; -s &#187; 
</p>
<p>milieu (Nom) + flexion
nombre
erreur : surg&#233;n&#233;ralisation 
</p>
<p>Etape future 
</p>
<p>Analyse
didactique
</p>
<p>Forme
</p>
<p>Diagnostic
</p>
<p>milieu + smilieus
</p>
<p>Sch&#233;ma 1 : Algorithme d&#8217;analyse du module et exemple
</p>
<p>3 Analyse morphologique des r&#233;ponses d&#8217;apprenants 
</p>
<p>3.1 L&#8217;analyse morphologique en TAL 
</p>
<p>En TAL, l&#8217;analyse morphologique s&#8217;appuie sur les r&#232;gles de formation des mots r&#233;v&#233;l&#233;s par 
les travaux en linguistique. Elle consiste, &#224; partir d&#8217;un texte source &#224; extraire des informations
pour chaque mot.
Nous trouvons trois &#233;coles principales d&#8217;analyse morphologique (Fuchs et al., 1993)  qui 
proposent diff&#233;rentes solutions pour un m&#234;me probl&#232;me : comment d&#233;couper une forme
fl&#233;chie en base et flexion(s) dans le but de g&#233;n&#233;rer un maximum d&#8217;informations:
</p>
<p>2 Tous les exemples de formes erron&#233;es cit&#233;s dans l&#8217;article sont issus de ce corpus. 
</p>
<p>3 Integrated Digital Language Learning (http ://www.idill.org). Ce projet a &#233;t&#233; d&#233;velopp&#233; dans le cadre du
r&#233;seau d&#8217;excellence europ&#233;en Kaleidoscope (http://www.noe-kaleidoscope.org).
</p>
<p>440</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;analyse  morphologique des r&#233;ponses d&#8217;apprenants 
</p>
<p>x Les dictionnaires de formes fl&#233;chies : Cette fa&#231;on de proc&#233;der a l&#8217;avantage de ne 
demander que peu de traitements informatiques. Elle consiste &#224; lister toutes les formes 
fl&#233;chies des mots du fran&#231;ais dans un dictionnaire. Il n&#8217;y a donc pas de d&#233;coupage de forme. 
</p>
<p>x Les automates &#224; &#233;tats finis : un ensemble d&#8217;automates d&#233;finit les combinaisons 
autoris&#233;es entre bases et affixes contenues dans un dictionnaire. Une forme est valid&#233;e si elle 
est accept&#233;e par un automate (e.g. veuve-&gt; veu +ve).
</p>
<p>x Le mod&#232;le &#224; deux niveaux : La grammaire du mod&#232;le &#224; deux niveaux permet le 
d&#233;coupage d&#8217;une forme en prenant en compte ces variations phonologiques. L&#8217;analyse du mot 
veuve est donc possible, et ce mot est reconnu comme une forme fl&#233;chie de la base veuf, &#224; 
laquelle sont rattach&#233;es des informations morphologiques (e.g. veuve-&gt;veuf + e).
</p>
<p>Pour notre probl&#233;matique, la m&#233;thode utilis&#233;e doit obligatoirement permettre une 
interpr&#233;tation fine et pertinente des informations morphologiques dans le but de proposer des 
r&#233;troactions de qualit&#233;. L&#8217;utilisation de dictionnaire ne semble pas appropri&#233;e car elle ne 
permet pas de d&#233;tecter une erreur. Par exemple, lieus ne peut &#234;tre analys&#233; car c&#8217;est une entr&#233;e 
inconnue. L&#8217;utilisation des automates &#224; &#233;tats finis limite l&#8217;interpr&#233;tation des erreurs. Si nous 
prenons l&#8217;exemple de carnavaux, cette technique d&#233;coupera cette forme en carnav + aux. Ce 
d&#233;coupage ne permet pas d&#8217;extraire d&#8217;informations pertinentes pour notre sujet. 
L&#8217;analyse &#224; deux niveaux semble donc la plus pertinente pour notre probl&#233;matique. Toutefois, 
cette m&#233;thode n&#8217;est valable que pour les formes correctement orthographi&#233;es. Une 
r&#233;adaptation de celle-ci est donc n&#233;cessaire pour l&#8217;analyse d&#8217;erreurs. 
Le mod&#232;le d&#233;velopp&#233; au CRISS (Lallich-Boidin et al., 1990) suit le principe du mod&#232;le &#224; 
deux niveaux et nous semble donc adapt&#233; et adaptable pour l&#8217;analyse d&#8217;erreurs 
morphologiques car il se fonde sur un d&#233;coupage des formes qui permet une interpr&#233;tation 
linguistique des bases et flexions extraites. Voici un exemple d&#8217;analyse avec la forme bones : 
</p>
<p>INTERPRETATION aucuneDECOUPAGE bon + e + sbones
</p>
<p>Il peut d&#233;couper la forme bones mais n&#8217;est certes pas capable d&#8217;interpr&#233;ter cette analyse du 
simple fait qu&#8217;il n&#8217;a pas &#233;t&#233; con&#231;u pour reconna&#238;tre des formes erron&#233;es. Toutefois, le 
d&#233;coupage propos&#233; nous permet de mod&#233;liser une interpr&#233;tation de forme erron&#233;e. 
</p>
<p>3.2 L&#8217;analyseur morphologique du CRISS 
</p>
<p>3.2.1 Description g&#233;n&#233;rale 
</p>
<p>Dans les ann&#233;es 90, une &#233;quipe du CRISS a d&#233;velopp&#233; un analyseur du fran&#231;ais en 
collaboration avec A. Berrendonner (1990). Il prend en entr&#233;e un texte &#233;crit, auquel il 
applique une analyse morphologique et syntaxique, pour en ressortir une repr&#233;sentation 
logique. Le syst&#232;me a une architecture modulaire, c&#8217;est-&#224;-dire qu&#8217;analyse morphologique et 
analyse syntaxique sont s&#233;par&#233;es. Ceci nous permet d&#8217;utiliser facilement les donn&#233;es et 
algorithmes relatifs &#224; l&#8217;analyse morphologique. 
Le mod&#232;le du CRISS r&#233;alise un d&#233;coupage interpr&#233;table de forme (en base et flexion(s)) dans 
le sens o&#249; il utilise les propri&#233;t&#233;s linguistiques intrins&#232;ques &#224; la langue pour ce qui concerne la 
formation flexionnelle des mots. Ces propri&#233;t&#233;s concernent entre autres la place d&#8217;apparition 
des flexions (e.g. base + flexion genre + flexion nombre)). 
Ce mod&#232;le original utilise un dictionnaire de bases, qui pour chaque base recense le lemme 
</p>
<p>441</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexia BLANCHARD
</p>
<p>correspondant, la cat&#233;gorie syntaxique de ce lemme, le nom du mod&#232;le auquel il est associ&#233; 
(dans le cas d&#8217;un lemme variable). Voici un exemple d&#8217;entr&#233;es lexicales :
  fr&#232;re (base), fr&#232;re (lemme), F (Cat&#233;gorie4), coup (Mod&#232;le de flexion)
</p>
<p>Les mod&#232;les de flexions permettent de d&#233;crire les ph&#233;nom&#232;nes de variations flexionnelles 
pour un lemme donn&#233;. Si nous reprenons l&#8217;exemple du lemme fr&#232;re, voici la description du 
mod&#232;le associ&#233; : 
</p>
<p>  coup [masculin, singulier] [&#216; ] [s] masculin, pluriel 
</p>
<p>Le nom du mod&#232;le associ&#233; &#224; fr&#232;re est coup. La premi&#232;re paire de crochets signifie que la base 
associ&#233;e au mod&#232;le coup est au masculin singulier, la seconde paire vide montre que cette 
base n&#8217;accepte pas de flexion du f&#233;minin et qu&#8217;aucune flexion n&#8217;est n&#233;cessaire pour former le 
masculin &#224; partir de la base, et la troisi&#232;me paire de crochets signifie que la base coup fait son 
pluriel en -s.
Dans le souci de privil&#233;gier les calculs aux donn&#233;es5, l&#8217;&#233;quipe du CRISS a d&#233;cid&#233; de ramener 
au maximum les exceptions aux cas g&#233;n&#233;raux. Cette op&#233;ration s'effectue &#224; l'aide de r&#232;gles 
dites de r&#233;gularisations. Ces derni&#232;res ont pour but de r&#233;duire le nombre de bases pour un 
m&#234;me mot, et donc le nombre d'entr&#233;es du dictionnaire. Elles permettent &#233;galement de 
diminuer le nombre de flexions et de mod&#232;les. 
Il existe deux types de r&#233;gularisations : 
</p>
<p>x les r&#233;gularisations portant sur la forme : elles consistent &#224; remplacer le suffixe d'une 
forme par un autre suffixe, avant le d&#233;coupage de celle-ci. 
</p>
<p>x les r&#233;gularisations portant sur la base : elles interviennent apr&#232;s le d&#233;coupage d'une 
forme en base(s) et flexion(s). Le suffixe de la base est substitu&#233; par un autre. 
</p>
<p>Par exemple, pour le mot travaux, l&#8217;analyseur cherche dans un premier temps la base travaux
dans le dictionnaire, qu&#8217;il ne va &#233;videmment pas trouver. Il ram&#232;ne alors cette forme au cas 
r&#233;gulier en substituant -ails &#224; la flexion -aux (i.e. travaux en travails). Une r&#233;gularisation de 
forme a &#233;t&#233; effectu&#233;e. 
A cela, il associe la base travail au mod&#232;le de flexion ad&#233;quate et peut g&#233;n&#233;rer les 
informations suivantes, apr&#232;s d&#233;coupage : 
</p>
<p>travail (nom) + s &#198; masculin, pluriel 
</p>
<p>Pour l&#8217;analyse de pla&#231;a, l&#8217;analyseur ne trouvant pas de base pla&#231; apr&#232;s d&#233;coupage en pla&#231; et -
a, il ajoute un -e  &#224; cette derni&#232;re (1&#232;re r&#233;gularisation de base). La base pla&#231;e n&#8217;&#233;tant toujours 
pas dans le dictionnaire, il substitue le &#231;e en ce (2&#232;me r&#233;gularisation de base) et obtient la 
base place. Les informations li&#233;es &#224; cette base permettent de g&#233;n&#233;rer les informations 
suivantes : 
</p>
<p> place (radical du verbe placer) + a &#198; 3&#232;me personne du singulier du pass&#233;-simple.
</p>
<p>4  La cat&#233;gorie F regroupe les noms et adjectifs, la cat&#233;gorie V les verbes. 
</p>
<p>5  Comme le souligne l&#8217;&#233;quipe du CRISS (Lallich-Boidin et al., 1990), les exceptions n&#233;cessitent souvent des 
donn&#233;es de grande taille par rapport aux cas dits &#171; g&#233;n&#233;raux &#187;. C&#8217;est pourquoi ces ph&#233;nom&#232;nes sont 
transform&#233;s des les premiers traitements, afin d&#8217;&#233;viter une surcharge de la taille des donn&#233;es de l&#8217;analyseur. 
</p>
<p>442</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;analyse  morphologique des r&#233;ponses d&#8217;apprenants 
</p>
<p>3.2.2 Les limites du syst&#232;me pour l&#8217;ALAO 
</p>
<p>Si nous tentons d&#8217;analyser des formes morphologiquement erron&#233;es avec le mod&#232;le tel quel, 
nous soulevons deux types de probl&#232;mes illustr&#233;s &#224; travers les exemples suivants : 
</p>
<p>nationals national + s national (adj.) + flexion national, masculin, pluriel, forme correcte de nombre 
</p>
<p>aucune analyse (la base journeal
n&#8217;existe pas dans le dictionnaire) 
</p>
<p>journeal + s r&#233;gularisation : journealsjourneaux
</p>
<p>Ces deux exemples montrent que l&#8217;analyseur du CRISS n&#8217;a pas &#233;t&#233; con&#231;u pour analyser des 
formes erron&#233;es. Toutefois, le premier exemple montre que le d&#233;coupage effectu&#233; est 
pertinent et facilement adaptable &#224; notre probl&#232;me. Le second exemple met en avant les cas 
o&#249; aucun d&#233;coupage n&#8217;aboutit &#224; une analyse. Nous avons donc modifi&#233; le mod&#232;le existant afin 
de pouvoir d&#233;couper toutes les formes erron&#233;es et ainsi les analyser. 
</p>
<p>3.3 Le module d&#8217;analyse morphologique des r&#233;ponses d&#8217;apprenants 
</p>
<p>Afin d&#8217;adapter le mod&#232;le du CRISS, il est important de savoir comment il se comporte face &#224; 
des erreurs, et s&#8217;il est capable de les d&#233;couper en base et flexions. Si ce d&#233;coupage est 
possible, alors l&#8217;erreur peut &#234;tre d&#233;tect&#233;e et analys&#233;e. Notre pr&#233;occupation est donc de 
modifier le mod&#232;le au minimum afin de permettre ce d&#233;coupage. 
Dans un premier temps, nous avons exp&#233;riment&#233; la  g&#233;n&#233;ralisation &#224; travers les donn&#233;es 
m&#234;mes du mod&#232;le, afin de mettre en &#233;vidence tous les cas de g&#233;n&#233;ralisation possibles au sein 
du mod&#232;le et de mesurer ses potentialit&#233;s. Les r&#233;sultats montrent que la totalit&#233; des formes 
obtenues sont d&#233;coupables. 
Nous avons ensuite r&#233;alis&#233; un test du syst&#232;me sur les erreurs du corpus FRIDA (57 pour les 
noms et adjectifs, 90 pour les verbes). Nous les avons tout d&#8217;abord class&#233;es selon qu&#8217;elles 
sont d&#233;coupables par les donn&#233;es d&#8217;origine du mod&#232;le ou non. Ce classement a r&#233;v&#233;l&#233; un taux 
important pour les erreurs de g&#233;n&#233;ralisation et surg&#233;n&#233;ralisation, autant pour les verbes que 
pour les noms et adjectifs. Nous avons &#233;largi les types d&#8217;erreurs &#224; traiter gr&#226;ce au corpus qui a 
mis en avant des cas de sous-g&#233;n&#233;ralisation o&#249; l&#8217;erreur est due &#224; un oubli de r&#233;gularisation 
(e.g. nationals).
</p>
<p>Le principal d&#233;faut du mod&#232;le du CRISS repose sur le fait qu&#8217;il n&#8217;associe pas les 
r&#233;gularisations avec les bases et flexions ad&#233;quates, ce qui entra&#238;ne une surg&#233;n&#233;ration 
d&#8217;erreurs analys&#233;es comme forme correcte. Par exemple, la forme carnavaux sera analys&#233;e 
comme la forme r&#233;gularis&#233;e au pluriel en &#8211;aux de la base carnaval.
Par cons&#233;quent, l&#8217;une des principales modifications de ce mod&#232;le va consister &#224; int&#233;grer les 
r&#233;gularisations de forme et de base &#224; l&#8217;int&#233;rieur m&#234;me des mod&#232;les de flexions. 
Ceci implique la modification des mod&#232;les existants, mais &#233;galement la cr&#233;ation de nouveaux 
mod&#232;les qui permettent d&#8217;int&#233;grer chaque r&#233;gularisation.  
Afin de traiter les cas d&#8217;utilisation de flexion et de r&#233;gularisations erron&#233;es6 (e.g. journeaux),
</p>
<p>6 Nous entendons par erron&#233;e le fait que l'emploi de ce type de flexions et de r&#233;gularisation fasse &#233;chouer 
l'analyse de ces fautes par l'analyseur non-modifi&#233;, car ni ces flexions, ni ces r&#233;gularisations n&#8217;existent dans la 
langue fran&#231;aise.
</p>
<p>443</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexia BLANCHARD
</p>
<p>nous avons ajout&#233; ces r&#233;gularisations et flexions erron&#233;es au mod&#232;le. (e.g. la r&#233;gularisation 
erron&#233;e &#8211;eaux en &#8211;als en plus de la r&#233;gularisation existante &#8211;aux en &#8211;als).
</p>
<p>Apr&#232;s la modification du mod&#232;le, nous obtenons 88 mod&#232;les de flexions, contre 61 &#224; 
l&#8217;origine, et 83 r&#232;gles de r&#233;gularisations contre 63. Quant au dictionnaire, nous avons modifi&#233; 
de fa&#231;on semi-automatique les 70 000 entr&#233;es afin d&#8217;associer les mod&#232;les de flexions &#224; 
chaque base. 
</p>
<p>Nous trouvions judicieux, en plus des informations &#171; classiques &#187; g&#233;n&#233;r&#233;es par l&#8217;analyse 
morphologique, de cr&#233;er une typologie des erreurs de morphologie flexionnelle, en nous 
appuyant sur le corpus FRIDA et sur le mod&#232;le (i.e. mauvaise manipulation des r&#232;gles de 
r&#233;gularisations). Cette typologie permet de proposer une premi&#232;re interpr&#233;tation, 
&#233;ventuellement utilisable pour la future g&#233;n&#233;ration du feed-back. Par exemple, nationals est
typ&#233; comme un oubli d&#8217;une r&#233;gularisation de forme (i.e. -aux en -als) via le code 
F1_REGF_O g&#233;n&#233;r&#233; lors de son analyse. Quant &#224; journeaux, son analyse produit le code 
F2_REGF, qui correspond &#224; une utilisation d&#8217;une r&#233;gularisation de forme inexistante en 
fran&#231;ais (i.e. &#8211;eaux en &#8211;als).
</p>
<p>Le module a &#233;t&#233; r&#233;alis&#233; en Prolog II+7, pour sa capacit&#233; &#224; s&#233;parer donn&#233;es et algorithmes 
(grammaire d&#233;clarative) et pour son principe de bactracking (qui permet une analyse 
combinatoire et multiple).Voici la sortie propos&#233;e par notre analyseur pour les deux formes 
vues pr&#233;c&#233;demment : 
</p>
<p>Figure 1 : Sorties de l&#8217;analyseur pour les formes nationals et journeaux.
</p>
<p>Lors de l&#8217;analyse de nationals, l&#8217;algorithme d&#233;coupe la forme en national- et &#8211;s. Il v&#233;rifie 
ensuite la pr&#233;sence de la base dans le dictionnaire. Gr&#226;ce &#224; cela, il r&#233;cup&#232;re le mod&#232;le associ&#233; 
au lemme et compare les flexions et les r&#233;gularisations effectu&#233;es lors du d&#233;coupage par 
rapport aux flexions et r&#233;gularisations autoris&#233;es (et obligatoires) du mod&#232;le. Il observe une 
incoh&#233;rence sur une r&#233;gularisation qui n&#8217;a pas &#233;t&#233; effectu&#233;e par l&#8217;apprenant pour former le 
masculin pluriel de national. Il g&#233;n&#232;re un diagnostic en cons&#233;quence, puis tente un nouveau 
d&#233;coupage (nationa + ls, etc.), sans succ&#232;s. 
Pour journeaux, aucun d&#233;coupage ne permet d&#8217;extraire une base appartenant au dictionnaire. 
Il effectue donc une r&#233;gularisation de forme (-eaux en &#8211;als), puis d&#233;coupe la forme en 
journal- et &#8211;s. Les donn&#233;es associ&#233;es au lemme ne correspondent pas aux donn&#233;es du 
</p>
<p>7 http://www.prologia.fr/
</p>
<p>444</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;analyse  morphologique des r&#233;ponses d&#8217;apprenants 
</p>
<p>d&#233;coupage, au niveau de la r&#233;gularisation qui est en fait une r&#233;gularisation erron&#233;e. Il d&#233;tecte 
ainsi une erreur et g&#233;n&#232;re la r&#233;troaction, comme montr&#233; ci-dessus (figure 1). 
</p>
<p>4 Conclusion et perspectives 
Nous avons d&#233;velopp&#233; un module permettant la d&#233;tection et l&#8217;analyse d&#8217;erreurs 
morphologiques en situation hors-contexte. Il donne des r&#233;sultats tout &#224; fait prometteurs quant 
&#224; l&#8217;analyse des erreurs issues du corpus FRIDA (toutes les erreurs sont correctement 
analys&#233;es). Il est &#233;vident qu&#8217;il est n&#233;cessaire de tester ce module sur un corpus plus important 
que ce dernier, afin de valider notre d&#233;marche, et de compl&#233;ter notre mod&#233;lisation linguistique 
des erreurs morphologiques existantes. 
</p>
<p>Il serait int&#233;ressant d&#8217;int&#233;grer ce module dans un syst&#232;me existant d&#8217;ALAO, afin de d&#233;finir sa 
plus-value et la robustesse qu&#8217;il peut apporter &#224; celui-ci. La prochaine &#233;tape de ce travail va 
ainsi consister &#224; impl&#233;menter cette analyse au sein de la plateforme MIRTO (Antoniadis et 
al., 2005a) qui &#224; l&#8217;heure actuelle se fonde sur une analyse &#224; 4 niveaux (Kraif, 2005). Cette 
derni&#232;re n&#8217;est pas capable de g&#233;n&#233;rer des r&#233;troactions sur des erreurs morphologiques. En 
effet, son analyse consid&#232;re chevals comme une erreur d&#8217;orthographe, en trouvant une 
ressemblance graphique entre chevals et cheval, et ne peut extraire aucune information 
expliquant l&#8217;erreur de l&#8217;apprenant. 
Ce module constitue une premi&#232;re pierre dans la r&#233;alisation d&#8217;un dispositif complet capable 
de d&#233;tecter et interpr&#233;ter les r&#233;ponses d&#8217;apprenants. Il convient &#224; pr&#233;sent d&#8217;&#233;largir le type des 
erreurs &#224; analyser. C&#8217;est dans cette optique que s&#8217;inscrivent mes travaux de th&#232;se. Une 
premi&#232;re &#233;tape consistera &#224; d&#233;finir les types d&#8217;activit&#233;s qui seront susceptibles d&#8217;&#234;tre &#233;valu&#233;es 
par des outils issus du TAL. Puis, nous &#233;tablirons un corpus de productions d&#8217;apprenants via 
les activit&#233;s retenues. Ces donn&#233;es permettront ensuite d&#8217;&#233;tablir une typologie attest&#233;e des 
erreurs rencontr&#233;es. A partir de ces recherches, la conception d&#8217;un syst&#232;me TAL d&#8217;&#233;valuation 
des productions et de g&#233;n&#233;ration de r&#233;troactions  pourra alors &#234;tre men&#233;e. 
</p>
<p>R&#233;f&#233;rences
&#197;GREN M. (2005). La morphologie du nombre dans le syst&#232;me verbal en fran&#231;ais L2 &#233;crit- 
L&#8217;accord de la 3&#232;me personne du pluriel. Acquisition et production de la morphologie 
flexionnelle. Actes du Festival de la morphologie. Jonas Granfeldt et Suzanne Schylter Eds, 
Lund (Su&#232;de). 
</p>
<p>ANTONIADIS G., ECHINARD S., KRAIF O., LEBARB&#201; T., PONTON C. (2005a). Mod&#233;lisation de 
l&#8217;int&#233;gration des ressources TAL pour l&#8217;apprentissage des langues : la plateforme MIRTO. 
Revue ALSIC, 8. 
</p>
<p>ANTONIADIS G., FAIRON C., GRANGER S., MEDORI J., ZAMPA V. (2006). Quelles machines 
pour enseigner la langue. TALN 2006, Leuven. 
</p>
<p>ANTONIADIS G., PONTON C., ECHINARD S. (2005B). Le TAL au servie de l&#8217;&#233;valuation 
automatique des fautes d&#8217;apprenants. Du vrai / faux &#224; l&#8217;&#233;valuation p&#233;dagogique. Actes du 
colloque UNTELE.
</p>
<p>ASTOLFI J.P. (1997). L&#8217;erreur, un outil pour enseigner. Paris : Editions ESF. 
</p>
<p>445</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexia BLANCHARD
</p>
<p>BERRENDONNER A. (1990). Grammaire pour un analyseur. Aspects morphologiques. France : 
Les Cahiers du CRISS. 
</p>
<p>BOUILLON P., VANDOOVEREN F., DA SYLVA L., JACQMIN L., LEHMANN S., RUSSEL G., VIEGAS
E. (1998). Traitement automatique des langues naturelles. Paris : Duculot. 
</p>
<p>CORDIER-GAUTHIER C., DION C. (2003). Correction et r&#233;vision de l&#8217;&#233;crit en fran&#231;ais langue 
seconde : m&#233;diation humaine, m&#233;diation informatique. Revue ALSIC, 24,29-43. 
</p>
<p>FAYOL M. (2001). Compte-rendu de la conf&#233;rence donn&#233;e par M. Fayol &#224; l&#8217;IUFM de Poitou-
Charentes, site des Deux-S&#232;vres &#224; Niort, dans le cadre des Conf&#233;rence de L&#8217;Ais : Apprendre &#224; 
utiliser l&#8217;orthographe.
</p>
<p>FUCHS C., DANLOS L., LACHERET-DUJOUR A., LUZATTI D., VICTORRI B. (1993). Linguistique
et Traitement Automatique des Langues. France : Hachette. 
</p>
<p>GRANGER S., VANDEVENTER A., HAMEL M.J. (2001). Analyse de corpus d&#8217;apprenants pour 
l&#8217;ELAO bas&#233; sur le TAL. Paris : Herm&#232;s. 
</p>
<p>KRAIF O. (2005). Evaluation automatique de productions lexicales : une analyse &#224; 4 niveaux. 
Actes du colloque UNTELE.
</p>
<p>LALLICH-BOIDIN G., HENNERON G., PALERMATI R. (1990). Analyse du fran&#231;ais. Ach&#232;vement 
et implantation de l&#8217;analyseur morpho-syntaxique. France : Les Cahiers du CRISS (Centre de 
Recherche en Informatique appliqu&#233;e au Sciences Sociales. 
</p>
<p>LANCIEN T. (1997). Le Multim&#233;dia (pp. 90-97). Cl&#233; International. T
</p>
<p>L&#8217;HAIRE S., VANDEVENTER A. (2003). Diagnostic d&#8217;erreurs dans le projet FreeText. Revue 
ALSIC, vol. 6, n&#176;2, 21-37. 
</p>
<p>NIELSEN J. (1993). Usability engyneering. New York: Academic Press. 
</p>
<p>R&#201;ZEAU J. (2004). M&#233;diatisation et m&#233;diation p&#233;dagogique dans un environnement 
multim&#233;dia. Le cas de l&#8217;apprentissage de l&#8217;anglais en Histoire de l&#8217;Art. Th&#232;se de doctorat de 
l&#8217;universit&#233; Bordeaux 2 (pp. 356-367). 
</p>
<p>SILBERZTEIN M. (1993). Dictionnaires &#233;lectroniques et analyse automatique de textes : le 
syst&#232;me INTEX. Paris : Masson. 
</p>
<p>WYATT D.H. (1988). Applying pedagogical principles to CALL courseware development, in 
Modem Media in Foreign Language Education : Theory and implementation. Illinois : 
National Textbook. 
</p>
<p>446</p>

</div></div>
</body></html>