<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annotation des disfluences dans les corpus oraux</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Annotation des disfluences dans les corpus oraux
</p>
<p>Marie PIU, R&#233;mi BOVE
&#201;quipe DELIC &#8211; Universit&#233; de Provence 
</p>
<p>29, Av. Robert Schuman, 13621 Aix-en-Provence Cedex 1 
remi.bove@up.univ-mrs.fr, piumarie@yahoo.fr
</p>
<p>R&#233;sum&#233;. Les disfluences (r&#233;p&#233;titions, amorces, autocorrections, constructions 
inachev&#233;es, etc.) inh&#233;rentes &#224; toute production orale spontan&#233;e constituent une r&#233;elle 
difficult&#233; en termes d&#8217;annotation. En effet, l&#8217;annotation de ces ph&#233;nom&#232;nes se r&#233;v&#232;le 
difficilement automatisable dans la mesure o&#249; leur &#233;tude r&#233;clame un jugement &#233;minemment 
interpr&#233;tatif. Dans cet article, nous pr&#233;sentons une m&#233;thodologie applicable &#224; l&#8217;annotation des 
disfluences (ou &#171; ph&#233;nom&#232;nes de production &#187;) que l&#8217;on rencontre fr&#233;quemment dans les 
corpus oraux. Le fait de constituer un tel corpus de donn&#233;es annot&#233;es, permet non seulement 
de repr&#233;senter certains aspects pertinents de l&#8217;oral (de mani&#232;re &#224; servir de base aux 
observations et aux comparaisons avec d&#8217;autres donn&#233;es) mais aussi d&#8217;am&#233;liorer in fine le 
traitement automatique de l&#8217;oral (notamment l&#8217;analyse syntaxique automatique). 
</p>
<p>Abstract. Disfluencies (repeats, word-fragments, self-repairs, aborted constructs, etc.) 
inherent in any spontaneous speech production constitute a real difficulty in terms of 
annotation. Indeed, the annotation of these phenomena seems not easily automatizable, 
because their study needs an interpretative judgement. In this paper, we present a 
methodology for the annotation of disfluencies (also named &#8220;production phenomena&#8221;) which 
frequently occur in speech corpora. Constituting such data allows not only to represent some 
relevant aspects of speech productions (so as to be a basis for observations and comparisons 
with other data), but also to improve automatic speech processing (particularly for parsing). 
</p>
<p>Mots-cl&#233;s : corpus oraux, annotation, disfluences, prosodie, XML.
</p>
<p>Keywords: speech corpora, annotation, disfluencies, prosody, XML. 
</p>
<p>1 Introduction
&#192; l&#8217;heure actuelle, les &#233;tudes linguistiques qui basent leurs descriptions sur de vastes corpus 
&#233;lectroniques gagnent sans cesse du terrain et les outils d&#8217;analyse automatique de plus en plus 
performants se multiplient. Malgr&#233; cela, l&#8217;analyse automatis&#233;e de l&#8217;oral reste marginale car on 
</p>
<p>397</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie PIU, R&#233;mi BOVE
</p>
<p>ne dispose que de tr&#232;s peu de corpus oraux1. La constitution et l&#8217;annotation de corpus oraux 
repr&#233;sentent un enjeu de premi&#232;re importance en vue d&#8217;applications telles que reconnaissance 
vocale, apprentissage des langues, etc.
</p>
<p>Par ce travail, nous proposons de constituer des donn&#233;es de r&#233;f&#233;rence annot&#233;es pour l&#8217;oral par 
le biais d&#8217;un sch&#233;ma d&#8217;annotation et d&#8217;un formalisme adapt&#233;s. L&#8217;objectif de ce travail est 
double : il permet d&#8217;une part, d&#8217;obtenir des donn&#233;es de r&#233;f&#233;rence sur l&#8217;oral et d&#8217;autre part, de 
faciliter l&#8217;exploitation informatique de ces m&#234;mes donn&#233;es. Pour mener &#224; bien ce projet, nous 
avons jug&#233; n&#233;cessaire de fonder notre analyse sur un cadre th&#233;orique existant qui traite des 
ph&#233;nom&#232;nes de l&#8217;oral. En effet, pour garantir sa coh&#233;rence, il est indispensable que ce sch&#233;ma 
d&#8217;annotation soit en ad&#233;quation avec un mod&#232;le d&#8217;analyse de l&#8217;oral pr&#233;alablement d&#233;fini. 
Nous nous sommes donc inspir&#233;s du mod&#232;le d&#8217;analyse  de &#171; la mise en grille &#187; propos&#233; par 
(Blanche-Benveniste, 1987), pour annoter les ph&#233;nom&#232;nes de production dans notre corpus.  
</p>
<p>&#192; notre sens, ce travail doit aussi lier analyse qualitative et quantitative pour rendre compte 
des multiples aspects du langage que l&#8217;on peut observer dans les situations d&#8217;oral. L&#8217;analyse 
qualitative se traduit par la mise en place d&#8217;un sch&#233;ma d&#8217;annotation et par l&#8217;enrichissement 
des donn&#233;es. Ensuite, les informations quantitatives recueillies permettent de mieux conna&#238;tre 
les m&#233;canismes de la langue orale par les informations ponctuelles qui s&#8217;en d&#233;gagent 
(fr&#233;quence, r&#233;partition des ph&#233;nom&#232;nes) mais aussi par les informations de structures (patrons 
r&#233;currents, contexte &#233;tudi&#233;). 
</p>
<p>2 Corpus d&#8217;&#233;tude et ph&#233;nom&#232;nes &#233;tudi&#233;s 
Le corpus &#224; partir duquel nous avons proc&#233;d&#233; &#224; l&#8217;annotation des disfluences est une sous-
partie du Corpus de R&#233;f&#233;rence du Fran&#231;ais Parl&#233; (CRFP) constitu&#233; par l&#8217;&#233;quipe DELIC 
(Description Linguistique Informatis&#233;e sur Corpus) et sp&#233;cialement choisie pour son caract&#232;re 
monologique et son h&#233;t&#233;rog&#233;n&#233;it&#233; situationnelle.  
</p>
<p>2.1 Corpus de R&#233;f&#233;rence du Fran&#231;ais Parl&#233; 
</p>
<p>Cette sous-partie du CRFP se compose de dix enregistrements (environ 53 minutes de parole, 
soit plus de 8000 mots) faisant intervenir cinq hommes et cinq femmes. La transcription 
orthographique a &#233;t&#233; effectu&#233;e enti&#232;rement &#224; la main par des experts linguistes avec un cycle 
de r&#233;&#233;coute/validation extr&#234;mement strict. Les conventions de transcription adopt&#233;es (cf.  
&#201;quipe DELIC, 2004) ne contiennent aucun trucage orthographique (du type p&#8217;tit, y&#8217;a, etc.) ni 
aucune ponctuation, suivant la tradition de l&#8217;&#233;quipe. Par ailleurs, un certain nombre de 
ph&#233;nom&#232;nes de production &#224; l&#8217;oral ont &#233;t&#233; transcrits (sans &#234;tre annot&#233;s sp&#233;cifiquement) : les 
r&#233;p&#233;titions, les amorces, les euh d&#8217;h&#233;sitation, les allongements, les pauses, les accents ainsi 
que les mouvements intonatifs majeurs.  
</p>
<p>1  On entend g&#233;n&#233;ralement par &#171; corpus oraux &#187; les annotations (sous forme de transcriptions orthographiques) 
et les enregistrements (fichiers sons et/ou vid&#233;o) 
</p>
<p>398</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des disfluences dans les corpus oraux 
</p>
<p>2.2 Ph&#233;nom&#232;nes &#233;tudi&#233;s 
</p>
<p>Nous avons choisi de nous int&#233;resser plus particuli&#232;rement &#224; l&#8217;annotation des ph&#233;nom&#232;nes de 
production &#224; l&#8217;oral. Voici les ph&#233;nom&#232;nes qui ont constitu&#233; notre objet d&#8217;&#233;tude et pour 
lesquels nous avons mis en place un sch&#233;ma d&#8217;annotation : 
</p>
<p>x Les r&#233;p&#233;titions : r&#233;p&#233;tition d&#8217;un ou plusieurs mots ou reprise &#224; l&#8217;identique d&#8217;une 
syllabe, d&#8217;un mot ou d&#8217;une amorce de mot, de plusieurs syllabes ou de plusieurs 
mots, sans aucune valeur s&#233;mantique (Cand&#233;a, 2000).  
</p>
<p>(1) on entreposait les: les: les huiles &#1132; (CRFP) 
x Les autocorrections : substitution d&#8217;un mot ou d&#8217;une s&#233;rie de mots &#224; d&#8217;autres afin de 
</p>
<p>modifier ou corriger une partie de l&#8217;&#233;nonc&#233; (Kurdi, 2003). 
</p>
<p>(2) &#224; cette &#233;poque j'avais j'&#233;tais en ma&#238;trise il me restait le m&#233;moire &#224; faire &#1132; (CRFP)
x Les amorces : interruption de morph&#232;me en cours d&#8217;&#233;nonciation (Pallaud, 2002) 
</p>
<p>(3) donc je suis rest&#233;e trois mois en c- en camping &#224; peu pr&#232;s hein (CRFP) 
</p>
<p>x Les inach&#232;vements : &#233;nonc&#233;s auxquels il manque un ou plusieurs &#233;l&#233;ments pour 
qu&#8217;ils soient grammaticalement bien form&#233; et interpr&#233;table s&#233;mantiquement (Kurdi, 
2003).
</p>
<p>(4) j'&#233;tais au bord de la mer c'&#233;tait super &#231;a &#233;t&#233; un moment de:
</p>
<p>x Les disfluences combin&#233;es : association simultan&#233;e d&#8217;au moins deux des 
ph&#233;nom&#232;nes pr&#233;sent&#233;s ci-dessus. 
</p>
<p>(5) je voyais p- il y av- j'avais pas d'autre so- enfin j'avais pas d'autre solution &#1133;
</p>
<p>3 Cadre d&#8217;analyse des disfluences 
Pour mener &#224; bien notre projet et pour garantir la coh&#233;rence de notre m&#233;thode d&#8217;annotation, 
nous avons jug&#233; n&#233;cessaire d&#8217;appuyer notre analyse sur un cadre th&#233;orique existant.
L&#8217;une des approches les plus r&#233;pandues concernant la mod&#233;lisation des disfluences est celle 
propos&#233;e par Shriberg (1994). L&#8217;auteur d&#233;crit l&#8217;organisation interne des disfluences en un 
ensemble d&#8217;espaces distincts d&#233;limitant les &#233;tapes de la production orale. Le reparandum
(RM) correspond &#224; la partie qui sera abandonn&#233;e au profit de la r&#233;paration (repair). Le point
d&#8217;interruption (PI) &#233;tablit la fronti&#232;re finale du reparandum et marque une rupture dans la 
fluidit&#233; du discours. L&#8217;interregnum (IM) d&#233;signe la r&#233;gion comprise entre la fronti&#232;re finale 
du reparandum et la fronti&#232;re initiale du repair. Enfin, le repair (RR) repr&#233;sente la partie 
corrig&#233;e du reparandum et marque le retour &#224; la &#171; fluence &#187; du discours. L&#8217;exemple suivant 
illustre ce cadre d&#8217;analyse : 
</p>
<p>il faut que . ben il faut que j'arrive &#224; dire
RM      PI     IM                      RR 
</p>
<p>Figure 1 : Structure de la disfluence (Shriberg, 1994) 
</p>
<p>399</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie PIU, R&#233;mi BOVE
</p>
<p>Cependant, ce mod&#232;le r&#233;v&#232;le un certain nombre de limites. Par exemple, la non-r&#233;cursivit&#233; de 
ce mod&#232;le (i.e l&#8217;impossibilit&#233; d&#8217;avoir un sch&#233;ma RM/PI/IM/RR &#224; l&#8217;int&#233;rieur d&#8217;un premier 
sch&#233;ma RM/PI/IM/RR) emp&#234;che de rendre compte de certaines configurations syntaxiques 
telle que l&#8217;imbrication de disfluences.  
</p>
<p>Il est tr&#232;s fr&#233;quent d&#8217;observer des imbrications de disfluences : une disfluence s&#8217;ins&#232;re dans 
une autre avant que la premi&#232;re soit termin&#233;e cr&#233;ant ainsi une interd&#233;pendance entre les 
segments disfluents. Il s&#8217;agit en fait de plusieurs &#233;l&#233;ments sur l&#8217;axe paradigmatique qui se 
succ&#232;dent et qui se trouvent ainsi sous la d&#233;pendance les uns des autres. L&#8217;imbrication 
s&#8217;effectue au niveau de la syntaxe o&#249; l&#8217;on observe les unit&#233;s syntaxiques fond&#233;es sur 
l&#8217;organisation des cat&#233;gories grammaticales et de leur rection. 
</p>
<p>[ on: on parlait souvent [ du: du fameux euh coq [ au: au Chambertin &#1132; ] ] ] 
</p>
<p>A l&#8217;inverse du mod&#232;le de Shriberg (1994) offrant une vision strictement lin&#233;aire de 
l&#8217;organisation des productions disfluentes, le mod&#232;le de la mise en grille propos&#233; par 
(Blanche-Benveniste, 1987) permet de visualiser les configurations du discours gr&#226;ce &#224; une 
repr&#233;sentation qui suit deux axes : l&#8217;axe syntagmatique (horizontal) et l&#8217;axe paradigmatique 
(vertical). Les ph&#233;nom&#232;nes de production sont ramen&#233;s &#224; des &#171; pi&#233;tinements &#187; sur une m&#234;me 
place syntaxique. 
</p>
<p>on:
on parlait souvent
</p>
<p>du:
du fameux euh coq  
</p>
<p>au:
au Chambertin &#1132;
</p>
<p>Figure 2 : Mise en grille de disfluence imbriqu&#233;e 
</p>
<p>Dans cet exemple, les &#233;l&#233;ments du fameux coq et au Chambertin comportent des pi&#233;tinements 
syntaxiques et sont rattach&#233;s en cascade au verbe recteur parler. Dans nos corpus, nous avons 
pu relever plusieurs imbrications plus ou moins compliqu&#233;es. L&#8217;imbrication de trois 
disfluences successives repr&#233;sente le cas le plus complexe. L&#8217;int&#233;r&#234;t r&#233;side ici en une 
repr&#233;sentation de l&#8217;architecture syntaxique des &#233;nonc&#233;s en suivant un cadre d&#8217;analyse unifi&#233;. 
La mise en grille compl&#232;te la transcription du discours en la rendant &#224; la fois plus lisible et 
plus compr&#233;hensible. Elle permet de traiter les disfluences avec une certaine neutralit&#233; (on ne 
&#171; gomme &#187; pas la disfluence). Gr&#226;ce &#224; cette repr&#233;sentation tous les essais de lexique sont 
conserv&#233;s m&#234;me s&#8217;ils ne font pas avancer le discours. 
</p>
<p>4 Sch&#233;ma d&#8217;annotation 
L&#8217;annotation des disfluences se r&#233;v&#232;le difficilement automatisable dans la mesure o&#249; l&#8217;&#233;tude 
de ces ph&#233;nom&#232;nes r&#233;clame un jugement &#233;minemment interpr&#233;tatif de la part de l&#8217;annotateur. 
Pour cette raison, l&#8217;annotation se veut enti&#232;rement manuelle et s&#8217;effectue &#224; l&#8217;aide du logiciel 
de transcription assist&#233;e par ordinateur Transcriber qui permet de lier les deux types de 
ressources n&#233;cessaires &#224; l&#8217;exploitation des corpus oraux : le fichier son et la transcription. 
</p>
<p>400</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des disfluences dans les corpus oraux 
</p>
<p>4.1 Principes
</p>
<p>Pour r&#233;aliser ce travail, il a fallu ensuite trouver une m&#233;thode suffisamment &#171; robuste &#187; pour 
d&#233;limiter et coder les disfluences de mani&#232;re homog&#232;ne, en limitant les ambigu&#239;t&#233;s relatives 
aux choix d&#8217;annotation. Nous nous sommes inspir&#233;s du formalisme XML pour la cr&#233;ation des 
balises d&#233;limitant les segments disfluents. Le choix d&#8217;un codage par balises pr&#233;sente plusieurs 
avantages : il facilite la hi&#233;rarchisation des informations et va dans le sens des normes 
actuelles qui privil&#233;gient ce type de codage dans les projets de normalisation et d&#8217;exploitation 
des corpus oraux (cf. Krul, 2002). De plus, ce type de codage repr&#233;sente un format d&#8217;&#233;change 
standard &#171; universel &#187; et peut &#234;tre ainsi int&#233;gr&#233; &#224; des corpus existants utilisant d&#233;j&#224; la norme 
XML.
</p>
<p>Dans un premier temps, nous avons donc cr&#233;&#233; une balise encadrante &lt;dis&gt;&#8230;&lt;/dis&gt; faisant 
office de d&#233;limiteur dans notre sch&#233;ma d&#8217;annotation. Les &#171; pi&#233;tinements &#187; syntaxiques 
propres au mod&#232;le de (Blanche-Benveniste, 1987) sont repr&#233;sent&#233;s par la balise &#171; &lt;start/&gt; &#187; 
plac&#233; devant chaque segment.  
</p>
<p>Exemple :   
</p>
<p>Segment disfluent initial :
</p>
<p>en hiver au Portugal il p- il p- il y a des moments de pluie assez importants des fois &#1132;
</p>
<p>Segment disfluent annot&#233; (1&#232;re passe) :
</p>
<p>en hiver au Portugal
 &lt;dis&gt; 
</p>
<p>&lt;start/&gt; il p-
&lt;start/&gt; il p-
&lt;start/&gt; il y a des moments de pluie assez importants des fois &#1132;
</p>
<p> &lt;/dis&gt; 
</p>
<p>Figure 3 : Premi&#232;re phase d'annotation  
</p>
<p>Dans un second temps, nous avons attribu&#233; &#224; chaque segment disfluent, une &#233;tiquette pour 
qualifier le type de disfluence. Le fait d&#8217;affecter un type pour chaque disfluence a pour but de 
faciliter l&#8217;extraction d&#8217;informations ponctuelles telle que la r&#233;partition des types de 
disfluences dans le corpus. L&#224; encore, nous nous sommes inspir&#233;e du formalisme XML pour 
d&#233;crire les propri&#233;t&#233;s des segments disfluents. Chaque disfluence poss&#232;de un attribut &#171; type &#187; 
qui est d&#233;fini &#224; l&#8217;int&#233;rieur de la balise et d&#8217;une valeur associ&#233;e. Nous d&#233;finissons quatre 
valeurs possibles pour le type de disfluence : &quot;rep&quot; pour les r&#233;p&#233;titions, &quot;ac&quot; pour les 
autocorrections, &quot;am&quot; pour les amorces et &quot;dc&quot; pour les disfluences combin&#233;es. 
</p>
<p>&lt;dis type=&quot;rep&quot;&gt;
&lt;start/&gt; il y a:  
&lt;start/&gt; il y a une re*mise en question 
</p>
<p>&lt;/dis&gt;
Figure 4 : Deuxi&#232;me phase d'annotation 
</p>
<p>401</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie PIU, R&#233;mi BOVE
</p>
<p>Nous avons &#233;galement annot&#233; les constructions inachev&#233;es au moyen d&#8217;une marque 
ponctuelle &#171; &lt;in/&gt; &#187;. L&#8217;utilisation d&#8217;une marque ponctuelle est un choix plus judicieux pour 
annoter ce type de disfluence car il est tr&#232;s d&#233;licat de circonscrire l&#8217;inach&#232;vement. 
</p>
<p>l&#224; c'&#233;tait tr&#232;s bien hein j'&#233;tais au bord de la mer c'&#233;tait super &#231;a &#233;t&#233; un moment de: &lt;in/&gt;
</p>
<p>Nous avons &#233;galement ajout&#233; les informations concernant les marqueurs discursifs (bon, ben,
voil&#224;, donc, etc. (Chanet, 2004)) sous la forme d&#8217;une balise encadrante &lt;md&gt;&#8230;&lt;/md&gt;. Les
marqueurs discursifs ne sont pas &#224; proprement parler des disfluences (bien qu&#8217;&#233;tant 
&#233;troitement li&#233;s &#224; celles-ci), mais leur fr&#233;quence &#233;lev&#233;e dans notre corpus nous oblige &#224; tenir 
compte de ces unit&#233;s en les incluant dans le sch&#233;ma d&#8217;annotation. D&#8217;un point de vue 
syntaxique, les marqueurs peuvent &#234;tre d&#233;finis comme des mots qui, dans le discours, 
n&#8217;entrent dans aucune construction syntaxique, tout en &#233;tant attach&#233;s prosodiquement au 
syntagme dans lequel ils prennent place.  
</p>
<p>&lt;md&gt;bon&lt;/md&gt; l&#224; c'&#233;tait tr&#232;s bien &lt;md&gt;hein&lt;/md&gt; j'&#233;tais au bord de la mer c'&#233;tait super 
</p>
<p>4.2 Probl&#232;mes rencontr&#233;s 
</p>
<p>M&#234;me en suivant un mod&#232;le th&#233;orique pr&#233;alablement d&#233;fini, l&#8217;annotation se heurte &#224; des cas 
probl&#233;matiques. La principale difficult&#233; lorsque l&#8217;on annote les disfluences r&#233;side dans le fait 
qu&#8217;il n&#8217;est pas toujours &#233;vident de circonscrire le segment disfluent. En effet, l&#8217;absence de 
ponctuation dans les transcriptions peut poser probl&#232;me pour d&#233;limiter le d&#233;but et la fin de la 
disfluence. Un autre probl&#232;me r&#233;current est celui des disfluences imbriqu&#233;es o&#249; la difficult&#233; 
principale r&#233;side dans l&#8217;application d&#8217;un balisage correct des disfluences les unes &#224; l&#8217;int&#233;rieur 
des autres. 
</p>
<p>4.2.1 D&#233;limitation du segment disfluent 
</p>
<p>Comme nous avons pu le voir dans les exemples pr&#233;c&#233;dents, la fronti&#232;re gauche de la 
disfluence d&#233;bute au premier &#171; pi&#233;tinement &#187; syntaxique, ce qui ne pose pas de difficult&#233;s 
puisque l&#8217;on applique la m&#234;me strat&#233;gie d&#8217;annotation pour chaque &#233;l&#233;ment disfluent. En 
revanche, la borne &#224; droite est beaucoup plus difficile &#224; identifier. En l&#8217;absence de toute 
ponctuation, il nous semble que le r&#244;le des indices prosodiques (mouvements intonatifs 
majeurs) et des autres marques comme les pauses et les allongements ainsi que les marqueurs 
discursifs est essentiel pour d&#233;terminer le d&#233;but et la fin du segment disfluent. Nous nous 
sommes donc appuy&#233;s sur un certain nombre d&#8217;indices pour d&#233;limiter la fronti&#232;re droite de la 
disfluence. Nous nous sommes bas&#233;e en premier lieu, sur les &#233;l&#233;ments prosodiques pr&#233;sents 
dans le CRFP. Plusieurs auteurs ont fait mention du lien entre l&#8217;intonation et l&#8217;organisation 
syntaxique de l&#8217;&#233;nonc&#233; : 
</p>
<p>&#171; La pr&#233;sence de tons finals dominants, avec effet de regroupement, aux fronti&#232;res 
syntaxiques majeures, indique une correspondance entre structure syntaxique et 
structure intonative. &#187; (Blanche-Benveniste, 1990 : 173)
</p>
<p>La figure ci-apr&#232;s montre l&#8217;utilisation des marques intonatives comme d&#233;limitation de 
fronti&#232;re droite de la disfluence. 
</p>
<p>402</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des disfluences dans les corpus oraux 
</p>
<p>&lt;dis type=&quot;ac&quot;&gt; 
&lt;start/&gt; mon  
&lt;start/&gt; un vieux coll&#232;gue de sciences naturelles m'avait dit sur*tout &#1132; + pas* d'histoire avec 
les filles &#1133;
</p>
<p> &lt;/dis&gt;
</p>
<p>on a
 &lt;dis type=&quot;rep&quot;&gt; 
  &lt;start/&gt; des:  
</p>
<p>&lt;start/&gt; des bons clients &#1132;
 &lt;/dis&gt;
</p>
<p>Figure 5 : D&#233;limitation de la fronti&#232;re droite &#224; partir de la prosodie
</p>
<p>Cependant, les corpus oraux existants ne b&#233;n&#233;ficient pas syst&#233;matiquement d&#8217;une annotation 
prosodique. Si l&#8217;on souhaite par exemple &#233;largir notre m&#233;thodologie &#224; d&#8217;autres corpus, il est 
donc n&#233;cessaire, &#224; notre sens, de nous appuyer en parall&#232;le sur d&#8217;autres indices plus largement 
cod&#233;s dans les corpus oraux &#224; savoir les pauses (silencieuses et remplies), les allongements et 
les marqueurs discursifs.  
</p>
<p>4.2.2 Disfluences imbriqu&#233;es 
</p>
<p>Il est tr&#232;s fr&#233;quent d&#8217;observer des imbrications de disfluences : une disfluence s&#8217;ins&#232;re dans 
une autre avant que la premi&#232;re soit termin&#233;e cr&#233;ant ainsi une interd&#233;pendance entre les 
segments disfluents. Il s&#8217;agit en fait de plusieurs &#233;l&#233;ments sur l&#8217;axe paradigmatique qui se 
succ&#232;dent et qui se trouvent ainsi sous la d&#233;pendance les uns des autres. L&#8217;imbrication 
s&#8217;effectue au niveau de la syntaxe o&#249; l&#8217;on observe les unit&#233;s syntaxiques fond&#233;es sur 
l&#8217;organisation des cat&#233;gories grammaticales et de leur rection. 
</p>
<p>&lt;dis&gt;
&lt;start/&gt; on:
&lt;start/&gt; on parlait souvent
</p>
<p>&lt;dis&gt;
&lt;start/&gt; du:
&lt;start/&gt; du fameux euh coq  
</p>
<p>&lt;dis&gt;
&lt;start/&gt; au:
&lt;start/&gt; au Chambertin &#1132;
&lt;/dis&gt;
</p>
<p>&lt;/dis&gt;
&lt;/dis&gt;
</p>
<p>Figure 6 : Imbrication de disfluences 
</p>
<p>Dans cet exemple, les &#233;l&#233;ments du fameux coq et au Chambertin comportent des pi&#233;tinements 
syntaxiques et sont rattach&#233;s en cascade au verbe recteur parler. Dans nos corpus, nous avons 
pu relever plusieurs imbrications plus ou moins compliqu&#233;es. L&#8217;imbrication de trois 
disfluences successives repr&#233;sente le cas le plus complexe. 
</p>
<p>4.2.3 Raccordement syntaxique impossible 
</p>
<p>Notre m&#233;thode d&#8217;annotation permet de rendre compte de la plupart des configurations de 
disfluences. Cependant, quelques &#233;nonc&#233;s disfluents ne peuvent pas &#234;tre annot&#233;s en utilisant 
</p>
<p>403</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie PIU, R&#233;mi BOVE
</p>
<p>cette m&#233;thode. En effet, les relations entre les &#233;l&#233;ments peuvent &#234;tre &#224; une distance tout &#224; fait 
notable et le raccordement syntaxique s&#8217;effectue trop loin dans l&#8217;&#233;nonc&#233; pour &#234;tre annot&#233; et 
mis en grille. C&#8217;est le cas notamment de l&#8217;exemple suivant pour lequel il n&#8217;a pas &#233;t&#233; possible 
de mettre en place notre sch&#233;ma d&#8217;annotation : 
</p>
<p>ben parce que le: Charlemagne euh + para&#238;t-il &#1132; ne buvait que des rouges &#1132; + parce qu' 
  &lt;dis type=&quot;dc&quot;&gt;  
   &lt;start/&gt; il voulait pas &#1132;
</p>
<p>&lt;start/&gt; il
&lt;start/&gt; il se t&#226;chait &#1132; + 
</p>
<p>&lt;dis type=&quot;dc&quot;&gt;  
&lt;start/&gt; sa:
&lt;start/&gt; sa: + &lt;/in&gt; 
</p>
<p> &lt;/dis&gt; 
&lt;/dis&gt; il ne buvait que* des Blancs pardon &#1132;
</p>
<p>Figure 7 : Autocorrection non annot&#233;e 
</p>
<p>La correction ne buvait que des Blancs remplace ne buvait que des rouges initialement 
produite par le locuteur. Cependant, cet &#233;nonc&#233; se situe &#224; une trop grande distance pour &#234;tre 
annot&#233; en tant qu&#8217;autocorrection. 
</p>
<p>5 Aspects quantitatifs 
Apr&#232;s avoir annot&#233; les corpus, nous avons r&#233;alis&#233; une &#233;tude quantitative dont l&#8217;objectif est 
d&#8217;illustrer la typologie des ph&#233;nom&#232;nes de l&#8217;oral. L&#8217;approche quantitative permet d&#8217;acc&#233;der 
plus facilement &#224; la description des ph&#233;nom&#232;nes qui pr&#233;sentent de l&#8217;int&#233;r&#234;t et dont il aurait &#233;t&#233; 
difficile de cerner les contours a priori. A l&#8217;aide de scripts permettant d&#8217;automatiser les 
d&#233;comptes (scripts en Perl et Bash), nous avons quantifi&#233; les types de disfluences, les 
constructions inachev&#233;es ainsi que les marqueurs discursifs.  
</p>
<p>A m o r c e s
1 2 %
</p>
<p>A u t o c o r r e c t i o n s
1 3 %
</p>
<p>D i s f l u e n c e s  
c o m b i n &#233; e s
</p>
<p>1 7 %
</p>
<p>I n a c h &#232; v e m e n t s
1 4 %
</p>
<p>R &#233; p &#233; t i t i o n s
4 4 %
</p>
<p>Figure 8 : R&#233;partition des types de disfluences 
</p>
<p>Nous avons relev&#233; 293 disfluences : les r&#233;p&#233;titions constituent le type le plus largement 
repr&#233;sent&#233; (44%). Les autres types sont repartis de mani&#232;re plus homog&#232;ne : leur pourcentage 
varie entre 17% pour les disfluences combin&#233;es et 12% pour les amorces. Les comptages 
</p>
<p>404</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des disfluences dans les corpus oraux 
</p>
<p>permettent &#233;galement d&#8217;effectuer quelques constats sur la fr&#233;quence des marqueurs discursifs, 
et permettent de d&#233;gager des hypoth&#232;ses sur le fonctionnement de ces unit&#233;s. 
</p>
<p>T&#202;TE DE LISTE : Fr&#233;quence des marqueurs discursifs 
</p>
<p>Rang Forme Fr&#233;quence Fr&#233;quence Relative 
1 donc 67 18,61%
2 hein 55 15,28%
3 bon 36 10%
4 quand m&#234;me 15 4,17%
5 enfin 15 4,17%
6 ben 13 3,61%
7 alors 13 3,61%
8 l&#224; 9 2,50%
9 quoi 8 2,22%
10 mais 8 2,22%
</p>
<p>Tableau 1: Fr&#233;quence des marqueurs discursifs (t&#234;te de liste) 
</p>
<p>6 Conclusion et perspectives 
L&#8217;&#233;tude de l&#8217;oral est aujourd&#8217;hui un th&#232;me de recherche tr&#232;s riche, m&#234;me s&#8217;il reste encore de 
nombreux progr&#232;s &#224; faire pour permettre d&#8217;automatiser compl&#232;tement son traitement. L&#8217;une 
des premi&#232;res phases dans l&#8217;optique du d&#233;veloppement d&#8217;applications en TAL dans ce 
domaine, peut passer, notamment, par la constitution et l&#8217;annotation de corpus oraux. 
</p>
<p>Cet article rend compte du travail d&#8217;annotation effectu&#233;s de ces ph&#233;nom&#232;nes &#224; partir de 
corpus oral (Corpus de R&#233;f&#233;rence du fran&#231;ais parl&#233;) en suivant un mod&#232;le d&#8217;analyse pr&#233;cis (la 
mise en grille) et en utilisant une norme g&#233;n&#233;rique d&#8217;annotation de textes (XML). De plus, 
l&#8217;&#233;tude quantitative et qualitative men&#233;es conjointement dans notre travail nous ont permis 
d&#8217;avoir une connaissance plus pr&#233;cise des caract&#233;ristiques des ph&#233;nom&#232;nes de l&#8217;oral m&#234;me 
s&#8217;il reste encore beaucoup de cas &#224; &#233;tudier, et ce, sur de plus grands volumes de donn&#233;es. 
Nous avons pu, gr&#226;ce aux observations sur corpus, d&#233;gager un certain nombre de r&#233;gularit&#233;s 
qui nous renseignent sur le fonctionnement des disfluences (qui peut &#234;tre enrichi par 
l&#8217;observation des diff&#233;rents patrons syntaxiques des segments disfluents (Piu, 2006)) et 
peuvent servir de base pour l&#8217;am&#233;lioration des outils de traitement automatique (par exemple 
l&#8217;analyse syntaxique automatique) qui butent encore sur les donn&#233;es orales. 
</p>
<p>R&#233;f&#233;rences
BLANCHE-BENVENISTE, C., &amp; JEANJEAN, C. (1987). Le fran&#231;ais parl&#233; &#8211; &#201;dition et 
transcription. Paris : Didier-&#201;rudition.
</p>
<p>BLANCHE-BENVENISTE, C. (1990). Le fran&#231;ais parl&#233; &#8211; &#201;tudes grammaticales. Paris : CNRS. 
</p>
<p>CAND&#201;A, M. (2000). Contribution &#224; l&#8217;&#233;tude des pauses silencieuses et des ph&#233;nom&#232;nes dits 
&#171; d&#8217;h&#233;sitation &#187; en fran&#231;ais oral spontan&#233;. Th&#232;se de doctorat. Universit&#233; Paris III. 
</p>
<p>CHANET, C. (2004). Fr&#233;quence des marqueurs discursifs en fran&#231;ais parl&#233; : quelques 
probl&#232;mes de m&#233;thodologie. Recherches sur le fran&#231;ais parl&#233;, 18, 83-105. 
</p>
<p>405</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie PIU, R&#233;mi BOVE
</p>
<p>&#201;QUIPE DELIC. (2004). Pr&#233;sentation du Corpus de r&#233;f&#233;rence du fran&#231;ais parl&#233;. Recherches sur 
le fran&#231;ais parl&#233; 18, 11-43.
</p>
<p>HENRY, S. (2002). &#201;tude des r&#233;p&#233;titions en fran&#231;ais parl&#233; spontan&#233; pour les technologies de la 
parole. Actes de la 6&#232;me Rencontre des &#201;tudiants Chercheurs en Informatique pour le 
Traitement Automatique des Langues, 467-476. Nancy (France). 
</p>
<p>KRUL, A. (2002). Annotation structurelle de corpus oraux avec XML. M&#233;moire de Ma&#238;trise. 
Universit&#233; Paris III Sorbonne Nouvelle. 
</p>
<p>KURDI, M. Z. (2003). Contribution &#224; l&#8217;analyse du langage oral spontan&#233;. Th&#232;se de doctorat. 
Universit&#233; de Grenoble I. 
</p>
<p>PALLAUD, B. (2002). Les amorces de mots comme faits autonymiques en langage oral. 
Recherches sur le Fran&#231;ais parl&#233;, 17, 79-102. 
</p>
<p>PIU, M. (2006). Annotation des disfluences dans les corpus oraux. M&#233;moire de Master. 
Universit&#233; de Provence, Aix-en-Provence. 
</p>
<p>V&#201;RONIS, J. (1998). Annotation automatique de corpus : &#233;tat de la technique. Colloque 
International &#171; Questions de m&#233;thode dans la linguistique de corpus &#187;. Perpignan (France).  
</p>
<p>406</p>

</div></div>
</body></html>