<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extension de l'encodage formel des fonctions lexicales dans le cadre de la Lexicologie Explicative et Combinatoire</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5-8 juin 2007 
</p>
<p>Extension de l'encodage formel des fonctions lexicales  
dans le cadre de la Lexicologie Explicative et Combinatoire 
</p>
<p>Anne-Laure JOUSSE
OLST &#8211; Universit&#233; de Montr&#233;al 
</p>
<p>Lattice &#8211; Universit&#233; Paris 7 
anne.laure.jousse@umontreal.ca
</p>
<p>R&#233;sum&#233;. Dans les ressources dictionnairiques d&#233;velopp&#233;es &#224; partir du cadre th&#233;orique de 
la Lexicologie Explicative et Combinatoire telles que le DiCo, les relations s&#233;mantico-
lexicales sont mod&#233;lis&#233;es au moyen de fonctions lexicales. Cependant, seulement la majorit&#233; 
d'entre elles (dites standard) r&#233;pondent v&#233;ritablement &#224; un encodage formel. Les autres (dites 
non standard), repr&#233;sentant des relations plus sp&#233;cifiques &#224; certaines unit&#233;s lexicales, sont 
&#233;crites sous la forme d'un encodage h&#233;t&#233;rog&#232;ne et tr&#232;s peu formalis&#233;. Par cons&#233;quent, 
certaines relations ne peuvent entrer en ligne de compte dans les traitements automatiques. 
Nous proposons dans cet article une m&#233;thodologie pour la normalisation des fonctions 
lexicales non standard afin de les rendre exploitables dans des applications telles que l'analyse 
et la g&#233;n&#233;ration de texte. Pour ce faire, nous discutons certains principes th&#233;oriques associ&#233;s &#224; 
ce formalisme de description et esquissons des propositions pour un traitement global et 
homog&#232;ne de l'ensemble des relations d&#233;crites dans le DiCo. 
</p>
<p>Abstract. In the lexicographical products developped within the framework of the 
Explicative and Combinatorial Lexicology such as the DiCo, the lexico-semantic links are 
modeled by means of lexical functions. However, only a part of them (called standard) 
happen to appear as a real formal encoding. The others (called non-standard), which represent 
links more specific to some lexical units, are written in a heterogeneous and barely formalized 
way. Therefore, some relations can't be taken into account in automatic processings. We 
propose, in this paper, a methodology for the normalization of non standard lexical functions 
in order to make them machine readable in applications such as text-analysis and generation. 
To complete this work, we discuss some theoretical assumptions drawn upon this formalism 
and sketch some propositions for a global and homogeneous processing of all the lexical links 
described in the DiCo. 
</p>
<p>Mots-cl&#233;s : Fonctions lexicales (non standard), mod&#233;lisation des relations s&#233;mantico-
lexicales, DiCo. 
</p>
<p>Keywords: (non standard) Lexical Function, modelling of lexico-semantic links, DiCo 
</p>
<p>1 Introduction
Dans diverses applications pour le traitement automatique des langues, il devient n&#233;cessaire 
de poss&#233;der un syst&#232;me formel pour d&#233;crire les relations s&#233;mantico-lexicales idiomatiques 
entre les unit&#233;s lexicales d'une langue. Par relations s&#233;mantico-lexicales, nous entendons plus 
pr&#233;cis&#233;ment, des relations syntagmatiques ou collocations (ex: pour abeille : piquer, butiner,
</p>
<p>469</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure JOUSSE
</p>
<p>polliniser, ...) ainsi que les relations d'ordre paradigmatique, identifi&#233;es dans la Lexicologie 
Explicative et Combinatoire sous le nom de d&#233;riv&#233;s s&#233;mantiques (ex : pour abeille : ruche,
essaim, apiculteur, ...). Un des objectifs de la mod&#233;lisation des relations lexicales en analyse 
est de permettre des inf&#233;rences &#224; partir d'une unit&#233; lexicale : par exemple, l'encodage de la 
relation entre un animal et son logis permettra d'inf&#233;rer &#224; partir de la lexie ruche, la lexie 
abeille, &#224; partir d'&#233;curie, la lexie cheval, etc. &#192; l'inverse, en g&#233;n&#233;ration, une bonne description 
des liens lexicaux dans une base de donn&#233;es lexicale fournie permet de doter les textes 
g&#233;n&#233;r&#233;s d'un caract&#232;re idiomatique. Aussi, pour employer la relation unissant une unit&#233; 
lexicale d&#233;notant un objet et la marque laiss&#233;e par cet objet, on pourra employer divers types 
de substantifs selon les unit&#233;s lexicales concern&#233;es : pour un navire, on parlera de sillage,
pour un pneu ou un pas de trace ou d'empreinte, pour une plaie, de cicatrice ou de balafre,
etc.
Les bases de donn&#233;es lexicales ne formalisent les relations lexicales souvent que de fa&#231;on 
partielle : Wordnet (Fellbaum 1998) ne prend pas en compte les collocations, MindNet 
(Richardson 1998) se limite aux relations les plus fr&#233;quentes. FrameNet (Fillmore et al. 2003) 
propose pour chaque &#171; cadre &#187; un ensemble de relations lexicales, cependant, celles-ci ne sont 
pas identifi&#233;es en elles-m&#234;mes mais par le biais des Frame Elements qui sont de nature 
conceptuelle et dont le nom peut varier en fonction du cadre dans lesquels ils s'inscrivent. La 
Th&#233;orie Sens-Texte et plus particuli&#232;rement la lexicologie explicative et combinatoire 
(Mel'&#254;uk et al. 1995) propose, quant &#224; elle, une mod&#233;lisation d'un tr&#232;s large &#233;ventail de 
relations s&#233;mantico-lexicales au moyen des fonctions lexicales. Celles-ci permettent d'encoder 
le sens et les caract&#233;ristiques syntaxiques d'une relation sous la forme d'une formule 
succincte, en prenant un mot-cl&#233; et en retournant une ou plusieurs valeurs (selon ce sch&#233;ma 
not&#233; ici : mot-cl&#233; FL valeur(s)), par exemple :  
  nom d'endroit typique :  abeille Sloc ruche
  verbe de r&#233;alisation typique :  ciseaux Fact0 couper
  qualificatif positif :   aspiration1 Bon noble
</p>
<p>Les fonctions lexicales (d&#233;sormais FL) ont d&#233;j&#224; &#233;t&#233; largement utilis&#233;es dans les applications 
en traitement automatique (Apresjan et al. 2000). Que ce soit pour des programmes de 
paraphrasage et g&#233;n&#233;ration de texte (Nasr 1996, Lareau 2002), de r&#233;sum&#233;s automatiques 
(Kittredge &amp; B&#233;langer 2005), de traduction automatique (Apresjan 2003), ou encore pour 
d&#233;velopper des outils d'apprentissage des langues (Diachenko, 2006, Boguslavsky et al.
2006). Cependant, les FL utilis&#233;es dans ces projets ne repr&#233;sentent qu'une partie des 
collocations et d&#233;riv&#233;s s&#233;mantiques propres aux lexies. En effet, l'encodage des FL n'est pas 
homog&#232;ne mais varie en fonction du degr&#233; de fr&#233;quence des relations lexicales : plus une 
relation s&#233;mantique est applicable &#224; un large ensemble d'unit&#233;s lexicales et plus elle est sera 
consid&#233;r&#233;e comme standard. Ainsi, alors que la relation mod&#233;lis&#233;e par Sloc s'applique &#224; 
beaucoup d'unit&#233;s lexicales, la relation entre criminel et se repentir que l'on peut d&#233;crire par  
'&#233;prouver du regret pour un m&#233;fait', ne concerne qu'un tr&#232;s petit nombre d'unit&#233;s lexicales 
(criminel, bandit, meurtrier, etc.). Ces relations sp&#233;cifiques &#224; certaines unit&#233;s lexicales vont 
&#234;tre d&#233;crites au moyen de FL dites non standard (ou FLNS). Elles sont encod&#233;es selon un 
m&#233;talangage naturel qui met l&#8217;accent sur la lisibilit&#233; et la clart&#233; de la formulation. Ceci a pour 
cons&#233;quence l&#8217;existence de variantes  synonymiques comme l'illustrent les trois exemples 
suivants :   
</p>
<p>1 Afin d'all&#233;ger le texte nous n'avons pas reproduit le formalisme de la num&#233;rotation des lexies du DiCo. 
</p>
<p>470</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension de l'encodage formel des fonctions lexicales dans le cadre de la LEC 
</p>
<p>m&#233;dicament Discipline qui &#233;tudie les M. pharmacologie
poisson Science qui &#233;tudie les P. ichtyologie
signe &#201;tude des S.   astrologie
</p>
<p>Tel quel, cet encodage est tr&#232;s h&#233;t&#233;rog&#232;ne et inexploitable pour des applications en TAL : il 
n'est ni rep&#233;rable ni analysable de fa&#231;on automatique. Il est donc n&#233;cessaire de le normaliser, 
c'est l&#224; l'objectif de notre travail. Nous illustrons, dans cet article, notre d&#233;marche en prenant 
en compte les relations nominales et adjectivales extraites du DiCo (Mel'&#254;uk et Polgu&#232;re 
2006). Nous consacrons la premi&#232;re partie &#224; une discussion th&#233;orique du statut et de la 
l&#233;gitimit&#233; d'une distinction entre relations s&#233;mantico-lexicales. La deuxi&#232;me partie rend 
compte du travail de normalisation r&#233;alis&#233; sur les FL nominales et adjectivales. 
</p>
<p>2 Enjeu th&#233;orique d'une normalisation des fonctions lexicales 
non standard (FLNS) 
</p>
<p>2.1 D&#233;finition et probl&#232;mes 
</p>
<p>L'objectif des FL est de d&#233;crire une relation s&#233;mantico-lexicale en un encodage synth&#233;tique 
rendant compte du sens et des caract&#233;ristiques syntaxiques d'une relation. Par exemple, la 
fonction Real1 s'applique &#224; des substantifs pour retourner des verbes ayant un sens de 
r&#233;alisation et prenant pour objet le mot-cl&#233; de la relation :   
</p>
<p>voiture Real1 conduire [une voiture].
Cependant, comme nous l'avons bri&#232;vement &#233;voqu&#233;, les FL ne sont pas homog&#232;nes, elles 
s'organisent autour de trois statuts : on passe ainsi d'une description tr&#232;s synth&#233;tique et 
g&#233;n&#233;rale (les FL standard) &#224; une description tr&#232;s pr&#233;cise (les FL non standard). Notons &#224; ce 
propos que ces statuts ne sont pas &#233;tanches mais se situent plut&#244;t sur un continum.  
a) Les FL standard sont construites &#224; partir d'un noyau de 60 FL simples (Mel'&#254;uk et al.
1995 : 125) ; elles doivent r&#233;pondre au principe d'universalit&#233;, c'est-&#224;-dire, exister dans toutes 
les langues. Elles peuvent &#234;tre compos&#233;es d'un seul &#233;l&#233;ment (cf. 1) ou combin&#233;es entre elles 
(cf. 2). 
 (1) joyeux Anti   triste  : 'antonymie' 
 (2) abc&#232;s IncepPredPlus m&#251;rir  : 'commencer &#224; devenir plus important' 
</p>
<p>b) Les FL semi-standard sont constitu&#233;es d'une FL standard et d'un &#233;l&#233;ment en fran&#231;ais 
venant ajouter une composante de sens non prise en charge par la FL standard. Par exemple, 
la description de la relation (3) ayant le sens 'causer le silence de qqn', se diff&#233;rencie de la 
relation (4) par la pr&#233;sence de l'&#233;l&#233;ment en &#233;change de qqch. qui vient apporter une 
composante de sens suppl&#233;mentaire &#224; la FL standard. 
 (3) silence CausOper1    r&#233;duire  [qqn. au silence]
 (4) silence en &#233;change de qqch. CausOper1 acheter [le silence de qqn.]
</p>
<p>c) Les FL non standard (FLNS), quant &#224; elles, sont &#233;crites int&#233;gralement dans la langue de 
description, ici le fran&#231;ais. 
 (5) faillite Qui est li&#233;e &#224; des irr&#233;gularit&#233;s commises par X frauduleuse
 (6) bi&#232;re Produite &#224; l&#8217;&#233;tranger     d&#8217;importation
</p>
<p>Polgu&#232;re (2003 : 4) propose d'assigner le statut standard aux FL satisfaisant les deux 
conditions suivantes : 
 - condition de cardinalit&#233; : La FL doit s'appliquer &#224; un nombre important d'unit&#233;s 
lexicales et non &#234;tre limit&#233;e aux unit&#233;s lexicales d'un seul champ s&#233;mantique. La relation 
</p>
<p>471</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure JOUSSE
</p>
<p>suivante, par exemple : canard Qui ne vit pas &#224; l&#8217;&#233;tat sauvage   d&#8217;&#233;levage, domestique,
ne peut s'appliquer qu'&#224; certains noms d'animaux et ne pourra donc pas pr&#233;tendre au statut 
standard.
 - condition de diversit&#233; : Les valeurs retourn&#233;es par les FL doivent &#234;tre diversifi&#233;es. 
Ainsi, les valeurs de la FL Bon 'qualificatif positif' sont diversifi&#233;es selon les mots-cl&#233; 
auxquels elle s'applique, par exemple :   
</p>
<p>aspiration Bon noble ; bijou Bon somptueux ; d&#233;jeuner Bon succulent, etc.
On peut, par cons&#233;quent la consid&#233;rer comme une FL standard. 
</p>
<p>Ces conditions offrent des crit&#232;res op&#233;ratoires pour la description des relations mais ne se 
r&#233;v&#232;lent pas toujours suffisants. Sans vouloir tout &#224; fait remettre en cause cette distinction, 
nous voudrions r&#233;fl&#233;chir &#224; sa l&#233;gitimit&#233; et sa pertinence par rapport aux objectifs inh&#233;rents &#224; 
l'existence des FL. Le probl&#232;me fondamental que nous soulevons ici est le suivant : il semble 
que la fa&#231;on d'encoder les relations non standard contribue &#224; rel&#233;guer un ensemble non 
n&#233;gligeable de relations en marge des descriptions formelles r&#233;alis&#233;es dans le DiCo et d'autres 
bases de donn&#233;es du m&#234;me type. Les FLNS comptent pour 16% des relations du DiCo (1931 
non standard sur 11912 relations), or, si l&#8217;on veut mod&#233;liser le lexique au moyen d&#8217;un 
encodage formel, pourquoi se r&#233;duire &#224; laisser de c&#244;t&#233; une partie relativement importante des 
relations lexico-s&#233;mantiques ? Nous souhaitons remettre en cause, d'une part, le postulat d'un 
ensemble pr&#233;tendument ferm&#233; de relations standard, d'autre part, la fa&#231;on dont sont encod&#233;es 
les FLNS. Alors que le nombre de FL standard simple est fix&#233; &#224; une soixantaine, les FLNS 
constituent un ensemble non ferm&#233; de relations s&#233;mantiques. D&#233;limiter un nombre de FL est 
n&#233;cessaire pour en conserver un ensemble coh&#233;rent et une maintenance raisonnable, 
cependant, une limitation trop p&#233;remptoire pourrait constituer une entrave au bon 
d&#233;veloppement du syst&#232;me des FL. Il nous semble que, si la cr&#233;ation de nouvelles FL 
standard peut amener &#224; supprimer un grand nombre de non standard, il est peut-&#234;tre l&#233;gitime 
d&#8217;en ajouter quelques-unes &#224; la liste.
</p>
<p>Par ailleurs, la distinction s&#233;v&#232;re entre FL standard et non standard a entra&#238;n&#233; une fa&#231;on 
radicalement diff&#233;rente de traiter les relations s&#233;mantico-lexicales. Nous pensons que limiter 
le nombre des FL standard ne devrait pas emp&#234;cher une formalisation stricte des autres 
relations. Dans l'&#233;tat actuel du DiCo, aucune normalisation des FLNS n'a encore &#233;t&#233; propos&#233;e 
malgr&#233; des r&#233;gularit&#233;s flagrantes. Pour palier ce probl&#232;me, Polgu&#232;re (2007 : 4) a propos&#233; une 
autre cat&#233;gorie de FL &#224; statut hybride entre le standard et le non standard pour les FLNS dont 
la nature universelle n&#8217;est pas d&#233;montr&#233;e mais qui peuvent &#234;tre appel&#233;es standard pour une 
langue naturelle donn&#233;e. Il s'agit des fonctions localement standard . Celles-ci sont &#233;crites &#224; 
l&#8217;aide de formules en fran&#231;ais plut&#244;t qu&#8217;en latin. Ainsi, la fonction non standard De_nouveau 
illustr&#233;e ci-dessous, 
</p>
<p>hostilit&#233; De_nouveauIncepFunc0 reprendre : 'commencer &#224; nouveau' 
go&#251;t   De_nouveauIncepOper12 reprendre [go&#251;t &#224; qqch.] : 'avoir de nouveau' 
</p>
<p>est tr&#232;s fr&#233;quente en fran&#231;ais mais n&#8217;est pas standardis&#233;e, car son universalit&#233; reste &#224; prouver. 
Toutefois, elle est consid&#233;r&#233;e comme une fonction lexicale standard locale du fran&#231;ais. Cette 
initiative nous semble &#234;tre une bonne solution pour r&#233;duire le nombre massif de FLNS. 
Malheureusement, ce principe n'a pas &#233;t&#233; v&#233;ritablement &#233;tendu ni appliqu&#233; &#224; d'autres FL que 
celles d&#233;crites dans l'article cit&#233;. 
</p>
<p>472</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension de l'encodage formel des fonctions lexicales dans le cadre de la LEC 
</p>
<p>2.2 Vers un niveau de description formel et &#233;quilibr&#233; : quelle granularit&#233; 
adopter ? 
</p>
<p>La question centrale lorsque l'on cherche &#224; d&#233;crire le sens d'une relation est d'opter pour un 
degr&#233; de pr&#233;cision id&#233;al. Nous voudrions introduire ici le concept de granularit&#233; dans la 
description d'une relation entre unit&#233;s lexicales. Comme Polgu&#232;re l'a &#233;nonc&#233; dans les 
conditions cit&#233;es plus haut, la granularit&#233; de la relation ne doit pas &#234;tre trop restreinte, c'est-&#224;-
dire que la description de la relation doit &#234;tre suffisamment large pour concerner un grand 
ensemble de lexies. Cependant, aucun crit&#232;re n'est pos&#233; pour le cas contraire, &#224; savoir, pour 
&#233;viter la description trop g&#233;n&#233;rale d'une relation. Le d&#233;fi est donc de trouver le bon &#233;quilibre 
entre un degr&#233; trop fin ou trop large de granularit&#233;. Si l'on opte pour des descriptions tr&#232;s 
pr&#233;cises, on verra le nombre de formules augmenter, en revanche, si l'on vise une 
g&#233;n&#233;ralisation maximale, la clart&#233; de la relation sera mise en p&#233;ril. Consid&#233;rons les exemples 
de la figure 1 ci-dessous. Ils repr&#233;sentent tous une relation entre une entit&#233; et un produit qui 
en est d&#233;riv&#233;. On pourrait choisir de regrouper les noms d'animaux et les plats pr&#233;par&#233;s avec 
leur chair. Dans ce cas, la FL choisie refl&#232;terait une granularit&#233; fine qui exclurait les relations 
entre &#233;l&#233;phant et ivoire, ou entre pain et tartine, etc. Au contraire, choisir une description plus 
large comme Produit d&#233;riv&#233;, par exemple, permet de les regrouper toutes sous une seule et 
m&#234;me formule. 
</p>
<p>Produit d&#233;riv&#233; 
</p>
<p>canard Foie de C. produit par gavage    foie gras 
pain  Tranche de P. enduite de N    beurr&#233;e, tartine 
sucre Friandise contenant beaucoup de S.   sucrerie 
agneau Plat &#224; base d&#8217;A.     blanquette, r&#244;ti, m&#233;choui 
cerise Boisson alcoolis&#233;e faite avec des C.   cherry,kirsch, guignolet 
coq Plat &#224; base de viande de C.     au vin 
&#233;l&#233;phant  Mat&#233;riau que l&#8217;on obtient &#224; partir des d&#233;fenses d&#8217;&#201;. ivoire 
lait Aliment pr&#233;par&#233; d&#233;riv&#233; du L.    fromage, laitage, beurre 
</p>
<p> Figure 1 : Regroupements de FLNS nominales sous la formule Produit d&#233;riv&#233; 
</p>
<p>Dans le DiCo, chaque FL est accompagn&#233;e d'une formule de vulgarisation qui explicite en 
d&#233;tail le sens de la relation, par exemple la relation suivante,  
</p>
<p>gare IncepReal1 arriver, entrer [en ~],
</p>
<p>mod&#233;lis&#233;e par IncepReal1 est vulgaris&#233;e par la formule [X] arriver dans une G.. Nous optons 
donc, en ce qui concerne les FLNS, pour une g&#233;n&#233;ralisation maximale de la relation tout en 
assignant &#224; chacune d'entre elle une vulgarisation sur le mod&#232;le des FL standard. Ainsi, il est 
possible d'obtenir &#224; la fois un encodage formel et une formule explicite et d&#233;taill&#233;e destin&#233;e 
aux utilisateurs.
</p>
<p>3 Propositions pour la normalisation des FLNS 
Plusieurs recherches ont &#233;t&#233; men&#233;es pour proposer de nouvelles fonctions lexicales et tenter 
de normaliser les FLNS. Erastov (1969, cit&#233; dans Polgu&#232;re 2007), Grimes (1990) et 
Fontenelle (1997) ont propos&#233; quelques nouvelles fonctions lexicales d&#8217;apr&#232;s des r&#233;gularit&#233;s 
parmi des relations lexicales observ&#233;es dans le lexique. Frawley (1998), L'Homme (2002), 
Jousse (2002), Jousse &amp; Bouveret (2003) et Bouveret (2006) ont postul&#233; quelques adaptations 
des fonctions lexicales aux relations terminologiques. Grizolle (2003) et Jousse (2003) ont 
r&#233;fl&#233;chi &#224; des moyens d&#8217;homog&#233;n&#233;iser l&#8217;encodage des FLNS, Popovic (2004) a travaill&#233; sur 
l'homog&#233;n&#233;isation des gloses de vulgarisation des FL standard. Cependant, la question de 
</p>
<p>473</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure JOUSSE
</p>
<p>l'encodage des FLNS dans sa globalit&#233; n'a pas encore &#233;t&#233; abord&#233;e. Notre objectif dans ce 
travail est de proposer une normalisation de l'encodage des FLNS. Il est important de 
distinguer la standardisation de la normalisation. La premi&#232;re consiste &#224; cr&#233;er de nouvelles FL 
standard, ce qui n&#233;cessite de confronter les candidates aux crit&#232;res &#233;nonc&#233;s plus haut ; la 
normalisation consiste, quant &#224; elle, &#224; observer des r&#233;gularit&#233;s parmi les relations lexicales et 
&#224;  proposer une homog&#233;n&#233;&#239;sation et une formalisation plus stricte de leur encodage sans pour 
autant les faire passer au statut standard. Elle constitue, en un sens, la premi&#232;re &#233;tape vers la 
standardisation, si cette derni&#232;re se r&#233;v&#232;le possible. Pour ce faire, nous distinguons les 
relations selon les parties du discours concern&#233;es : les relations adjectivales, nominales, 
verbales et adverbiales. Notons que, dans cet article, nous ne rendrons compte que des deux 
premiers types de relations. Notre corpus se mesure en terme de FL. Nous avons extrait les 
820 FLNS nominales ainsi que les 727 FLNS adjectivales du DiCo et proc&#233;d&#233; &#224; un traitement 
diff&#233;rent dans les deux cas. 
</p>
<p>3.1 Normalisation des FLNS nominales 
</p>
<p>Les relations encod&#233;es par les FLNS nominales sont majoritairement des d&#233;riv&#233;s s&#233;mantiques. 
Ce sont des unit&#233;s lexicales partageant une composante de sens avec le mot-cl&#233; (ainsi, 
apiculteur est un d&#233;riv&#233; s&#233;mantique de abeille car il est d&#233;fini comme un 'individu &#233;levant des 
abeilles'). Nous d&#233;taillons ci-dessous six relations lexico-s&#233;mantiques nominales extraites du 
corpus.
</p>
<p>a) Les relations Mat&#233;riau et Ingr&#233;dient
</p>
<p>Les relations 'mat&#233;riau typique' et 'ingr&#233;dient typique' sont parfois consid&#233;r&#233;es comme de la 
m&#233;ronymie. On retrouve dans WordNet (Fellbaum 1998), par exemple, trois types de 
m&#233;ronymie : &#171; member meronymy &#187; (association &#314; associate), &#171; substance meronymy &#187; 
(steel &#314; iron) et &#171; part meronymy &#187; (table &#314; leg). Dans le DiCo, la m&#233;ronymie classique 
(relation partie-tout) est repr&#233;sent&#233;e au moyen de la FL Mero. Nous proposons de normaliser 
les relations ci-dessous par les formules Mat&#233;riau et Ingr&#233;dient.
</p>
<p>Mat&#233;riau
assiette Mat&#233;riau typique dont sont faites les A.   porcelaine
bijou Mat&#233;riau dont on fait des B.    pierre, argent, or 
corde Mat&#233;riau pour C.     lin, coton, nylon 
pneu Mat&#233;riau dont sont faits les P.   caoutchouc 
vaisselle Mat&#233;riau pr&#233;cieux dont peut &#234;tre fait la V.   argent, porcelaine 
</p>
<p>Ingr&#233;dient
bi&#232;re Ingr&#233;dient utilis&#233; pour faire de la B.   bl&#233;, houblon, malt 
pain Substance alimentaire avec laquelle on fait le P. farine 
yahourt Ingr&#233;dient avec lequel on fait le Y.   lait ferment&#233; 
</p>
<p>Figure 2 : Les fonctions Mat&#233;riau et Ingr&#233;dient
</p>
<p>b) Les relations Masc, Fem et Infant
</p>
<p>Nous avons rep&#233;r&#233; trois relations 'm&#226;le ou &#233;quivalent masculin de X', 'femelle ou &#233;quivalent 
f&#233;minin de X' et 'petit de X ou jeune X' dont l'encodage semble inutilement h&#233;t&#233;rog&#232;ne (cf. 
figure 3). Nous proposons de les regrouper sous trois formules uniques : Masc pour les 
&#233;quivalents masculins ou m&#226;les, Fem pour les &#233;quivalents femelles ou f&#233;minins et Infant pour 
les noms de petits d'animaux ou de jeunes individus. 
</p>
<p>474</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension de l'encodage formel des fonctions lexicales dans le cadre de la LEC 
</p>
<p>Masc
abeille M&#226;le faux bourdon
mouton M. m&#226;le b&#233;lier
poule M&#226;le de la P. coq
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 3 : Les fonctions Masc, Fem et Infant
</p>
<p>Notons que ces fonctions peuvent se combiner entre elles pour repr&#233;senter des relations du 
type cheval / poulain ou cheval / pouliche : 
</p>
<p>cheval MascInfant poulain
cheval FemInfant pouliche
</p>
<p>c) La relation entre un fait ou une entit&#233; et la discipline scientifique qui l'&#233;tudie : Schol
</p>
<p>Des &#233;tudes sur le lien entre d&#233;riv&#233;s morphologiques et FL standard (Jousse 2002, Jousse et 
Bouveret 2003) ont montr&#233; que la plupart des d&#233;riv&#233;s morphologiques typiques du fran&#231;ais se 
trouvent d&#233;j&#224; mod&#233;lis&#233;s par des FL. Il nous semble pertinent, pour le traitement de certaines 
FLNS, de se r&#233;f&#233;rer aux lexies relevant des compositions gr&#233;co-latines les plus courantes pour 
normaliser certaines relations. Dans bien des cas, la relation entre un fait ou une entit&#233; et son 
&#233;tude scientifique est morphologiquement marqu&#233;e par le suffixe -logie, ce qui t&#233;moigne 
d'une r&#233;currence notoire de la relation (cf. figure 4). Nous proposons donc d'encoder cette 
relation par la formule Schol.
</p>
<p>Schol
crime  Science qui &#233;tudie ce qui &#224; rapport aux C. criminologie 
poisson  Science qui &#233;tudie les P.   ichtyologie 
langue  Discipline qui &#233;tudie les L.   linguistique 
astre &#201;tude des A.     astronomie 
</p>
<p>Figure 4 : La relation Schol
</p>
<p>Faute de place, nous ne pouvons faire un inventaire d&#233;taill&#233; de toutes les FLNS que nous 
avons normalis&#233;es. Dans l'&#233;tat actuel de nos travaux, nous avons r&#233;ussi &#224; traiter 720 FLNS 
nominales (sur les 820 de d&#233;part) que nous avons r&#233;parties en 30 FLNS normalis&#233;es. Nous 
devons convenir que les relations restantes sont difficilement g&#233;n&#233;ralisables. Il en est ainsi, 
par exemple, du lien entre chat et chati&#232;re, repr&#233;sent&#233; par la FLNS Petite ouverture pratiqu&#233;e 
en bas d&#8217;une porte qui permet &#224; un C. d&#8217;entrer et sortir. Toutefois, nous tenons &#224; signaler que 
le DiCo n'est encore que peu d&#233;velopp&#233; (1000 acceptions de lexies), ce qui ne permet pas 
toujours de faire &#233;merger des r&#233;gularit&#233;s. Ce travail est donc corr&#233;l&#233; &#224; l'avancement du DiCo, 
il ne peut &#234;tre fait a priori et il est &#233;vident que les donn&#233;es &#233;volueront au fur et &#224; mesure de la 
description de nouvelles relations lexicales. 
</p>
<p>3.2 Normalisation des FLNS adjectivales 
Pour traiter les FLNS adjectivales nous adoptons une d&#233;marche tr&#232;s diff&#233;rente dans la mesure 
o&#249; les relations en jeu ne sont pas du m&#234;me ordre. Les relations encod&#233;es par les FLNS 
adjectivales sont en tr&#232;s grande majorit&#233; de type syntagmatique (des collocations) prenant 
pour mots-cl&#233; des noms et retournant comme valeurs des adjectifs modificateurs des mots-cl&#233;. 
</p>
<p>Fem
avocat De sexe f&#233;minin avocate
canard Femelle du C. cane
chien Femelle chienne
mouton M. femelle brebis
</p>
<p>Infant
chat Petit du C. chaton
coq Jeune C. coquelet
grenouille Larve de la G. t&#234;tard 
</p>
<p>475</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure JOUSSE
</p>
<p>Par exemple :   victoire Dont la probabilit&#233; est faible douteuse
Afin de mener &#224; bien un traitement coh&#233;rent et global des FLNS adjectivales, nous faisons 
l'hypoth&#232;se que tout type d'entit&#233; ou de fait poss&#232;de des attributs, par exemple : 'fonction', 
'taille', 'forme', 'appr&#233;ciation', etc., susceptibles d'&#234;tre exprim&#233;s au moyen de collocatifs 
adjectivaux. Ces attributs peuvent &#234;tre compar&#233;s aux &#233;l&#233;ments de cadre (= Frame Elements) 
d&#233;crits dans FrameNet (Fillmore et al. 2003) qui sp&#233;cifient les &#233;l&#233;ments entrant en jeu dans un 
cadre conceptuel. Par exemple, sous le cadre Artifact, on retrouve les &#233;l&#233;ments : creator,
material, name, time of creation, type, use. Ces &#233;l&#233;ments d'ordre conceptuel sont ensuite 
susceptibles d'&#234;tre lexicalis&#233;s dans les phrases mettant en sc&#232;ne le concept d'artefact. 
</p>
<p>D'apr&#232;s l'analyse des diff&#233;rentes FLNS, nous avons d&#233;gag&#233; un certain nombre d'attributs 
(environ une vingtaine). Nous cherchons &#224; assigner un attribut &#224; chaque FLNS afin d'en 
proposer une premi&#232;re formalisation homog&#232;ne. Ce nouveau type d'encodage permet de 
recenser les diff&#233;rentes relations, de les organiser et d'y acc&#233;der plus facilement dans une base 
de donn&#233;es. La figure 5 pr&#233;sente (sous la forme ancienne FL &#314; FL normalis&#233;e) quelques-uns
de ces attributs et illustre la fa&#231;on dont ils s'int&#232;grent pour former ce nouvel encodage des 
FLNS adjectivales. 
</p>
<p>COULEUR
 barbe De couleur grise &#314; Couleur:gris   grisonnante, poivre et sel 
FORME
 barbe Qui a une forme &#233;vas&#233;e  &#314; Forme: &#233;vas&#233;e en &#233;ventail 
TAILLE
 drap Utilisable pour deux personnes &#314;  Taille : + double 
 drap Utilisable pour une personne     &#314;  Taille : -  simple 
MAT&#201;RIAU
 chapeau Qui est fait de feutre &#314;   Mat&#233;riau: feutre  de feutre 
 chapeau Qui est fait de paille &#314;   Mat&#233;riau: paille  de paille 
FONCTION
 wagon &#201;quip&#233; pour que les passagers y dorment &#314; Fonction: dormir        -lit 
 wagon &#201;quip&#233; pour que les passagers y mangent &#314; Fonction: manger      -restaurant 
FONCTIONNEMENT
 horloge Qui poss&#232;de un carillon &#314;   Fonctionnement: &#224; carillon  &#224; carillon 
 horloge Qui poss&#232;de un balancier &#314;   Fonctionnement: &#224; balancier &#224; balancier 
CAUSE
 c&#233;libat Qui a lieu malgr&#233; la volont&#233; de X&#314; Cause : non voulu  forc&#233;, oblig&#233; 
PARTICIPANT
          restaurant Qui est plut&#244;t fr&#233;quent&#233; par des familles &#314;Participants: familles familial 
STATUT
 wagon Dans lequel il est interdit de fumer&#314;Statut:interdit de fumer non-fumeurs 
CONS&#201;QUENCE
      coup de feu Qui tue l&#8217;&#234;tre Y&#314; Cons&#233;quence:mort de Y   mortel 
</p>
<p> Figure 5 : Exemple de FLNS adjectivales normalis&#233;es 
</p>
<p>Certains de ces attributs sont polarisables, par exemple : Taille: + ou Taille: - et constituent 
ainsi une mod&#233;lisation directement analysable ; d'autres, en revanche, appellent de fines 
descriptions pour &#234;tre compr&#233;hensibles, par exemple :  Statut:interdit de fumer. 
La liste pr&#233;sent&#233;e ci-dessus n'est pas exhaustive, elle vise simplement &#224; illustrer notre 
d&#233;marche. Nous avons r&#233;ussi &#224; classifier l'ensemble des FLNS adjectivales en une vingtaine 
d'attributs en essayant au maximum d'en restreindre le nombre. Toutefois, nous avons 
conscience que certains regroupements ont &#233;t&#233; un peu forc&#233;s. &#192; l'instar des FLNS nominales, 
nous rappelons que ce travail ne peut se pr&#233;tendre abouti puisqu'il fera l'objet d'une constante 
&#233;volution au fur et &#224; mesure du d&#233;veloppement du DiCo. 
</p>
<p>476</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension de l'encodage formel des fonctions lexicales dans le cadre de la LEC 
</p>
<p>4 Bilan et exemple d'application 
D'apr&#232;s l'analyse de r&#233;gularit&#233;s parmi les relations s&#233;mantico-lexicales d&#233;crites dans le DiCo, 
nous avons cherch&#233; &#224; normaliser les fonctions lexicales non standard. Nous avons remis en 
cause certains principes li&#233;s aux fonctions lexicales qui nous semblent fig&#233;s dans le but d'en 
envisager de nouvelles possibilit&#233;s d'encodage. Normaliser de la sorte permet d'obtenir une 
repr&#233;sentation formelle homog&#232;ne de l'ensemble des relations lexicales dans les programmes 
de traitement automatique. Prenons l'exemple d'une application pour la g&#233;n&#233;ration 
d'expressions r&#233;f&#233;rentielles (cf. Reiter et Dale 1992). Gr&#226;ce &#224; ces formules, il est possible de 
proposer des choix de modificateurs saillants et concis plut&#244;t que des p&#233;riphrases pour 
l'identification des objets. Par exemple, pour g&#233;n&#233;rer des phrases d&#233;crivant les diff&#233;rents 
objets de la figure 6, on dispose de propri&#233;t&#233;s discriminatoires telles que la forme, la position, 
la fonction, la qualit&#233; ou le statut.
</p>
<p>Figure 6 : Illustration d'un train
Ces propri&#233;t&#233;s pourront &#234;tre exprim&#233;es au moyen des expressions collocatives idiomatiques 
associ&#233;es &#224; la lexie wagon et encod&#233;es par des FLNS normalis&#233;es suivantes : 
Forme : avec parois et toit couvert 
Forme : avec deux niveaux  
pour les passagers  &#224; imp&#233;riale 
Forme : sans paroi ni toit &#224; plateforme,  
    d&#233;couvert, plat 
Position : fin   de queue 
Position : d&#233;but   de t&#234;te 
Position : suit ou pr&#233;c&#232;de un autre voisin-adj 
Fonction : manger  -restaurant 
</p>
<p>Fonction : dormir  -lit, -couchette 
Fonction : boire ou manger -bar 
Qualit&#233; : meilleur confort
 aux passagers   de premi&#232;re (classe) 
Qualit&#233; : plus &#233;conomique  
pour les passagers  de seconde (classe) 
Statut : interdit de fumer  non-fumeurs 
Statut : permis de fumer  fumeurs
</p>
<p>Notons que ce travail constitue une premi&#232;re &#233;tape dans le sens o&#249; nous n'avons pour l'instant 
pris en compte que les relations nominales et adjectivales. On doit &#233;galement pr&#233;ciser qu'il 
s'agit d'une t&#226;che &#233;volutive parall&#232;le au d&#233;veloppement du DiCo et que les r&#233;sultats seront 
amen&#233;s &#224; des changements certains. Il nous semble donc primordial de poser un cadre 
m&#233;thodologique pr&#233;cis pour le traitement des relations lexico-s&#233;mantiques non standard.  
</p>
<p>Remerciements
Je remercie chaleureusement Sylvain Kahane, Alain Polgu&#232;re et Fr&#233;d&#233;ric Landragin pour la 
relecture de cet article. 
</p>
<p>R&#233;f&#233;rences
APRESJAN J., BOGUSLAVSKY I. , IOMDIN L., TSINMAN L.(2000). Lexical Functions in NLP: 
Possible Uses. Computational Linguistics for the New Millenium: Divergence or Synergy.
Heidelberg, 2000, p. 1-11. 
APRESJAN J. D. et al. (2003). Lexical Functions as a Tool of ETAP-3, Actes de MTT 2003,
Paris, 16-18 juin 2003.
BOGUSLAVSKY I., BARRIOS RODR&#205;GUEZ M., DIACHENKO P. (2006). CALLEX-ESP: a software 
system for learning Spanish lexicon and collocations, Current Developments in Technology-
Assisted Education.
BOUVERET M. (2006). Fonctions lexicales pour le typage de relations syntagmatiques et 
</p>
<p>477</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne-Laure JOUSSE
</p>
<p>paradigmatiques en bioindustries, une approche lexicographique du terme, The Processing of 
Terms in Dictionaries : New models and techniques, special Issue of Terminology 12(2), John 
Benjamins Publishing Company, Amsterdam/Philadelphia.(&#224; para&#238;tre) 
DIACHENKO P. (2006). Lexical functions in learning the lexicon, Current Developments in 
Technology-Assisted Education.
&#200;RASTOV K. O. (1969). Primery slovarnyx opisanij [Some sample lexicographic descriptions]. 
Ma&#353;innyj perevod i prikladnaja lingvistika [Automatic Translation and Applied 
Linguistics],11, 36-59. 
FELLBAUM C. (Ed.). (1998). Wordnet: An Electronic Lexical Database. MIT Press. 
FILLMORE C., JOHNSON C. et PETRUCK M. (2003). Background to FrameNet, International
Journal of Lexicography, Vol. 16, n&#176;3 : 235-249. 
FONTENELLE T. (1997). Turning a bilingual dictionary into a lexical-semantic database,
T&#252;bingen : Niemeyer. 
FRAWLEY W. (1998). New forms of Specialized Dictionaries, International Journal of 
Lexicography, vol. 1, n&#176;3, 1988, p.89-213. 
GRIMES, J. (1990). Inverse Lexical Functions, in: J. Steele (ed.) (1990). Meaning-Text Theory: 
Linguistics, Lexicography and Implications, Ottawa: Ottawa University Press, pp. 350-364. 
GRIZOLLE B. (2003). Classification des fonctions lexicales non-standard du DiCo, rapport de 
stage de ma&#238;trise, OLST, Universit&#233; de Montr&#233;al. 
JOUSSE A.-L. (2002). D&#233;rivation morphologique de termes, analyse en corpus sp&#233;cialis&#233; et 
mod&#233;lisation au moyen des fonctions lexicales, M&#233;moire de ma&#238;trise, Universit&#233; du Maine. 
JOUSSE A.-L. (2003). Normalisation des fonctions lexicales, M&#233;moire de DEA, Paris 7. 
JOUSSE A.L., BOUVERET M. (2003). Lexical functions to represent derivational relations in 
specialized dictionaries, Terminology, 9(1), 71-98. 
KITTREDGE R., B&#201;LANGER P. (2005). Paraphrasing with Space Constraints: Linguistic 
Operations in Journal Abstracting, Actes de MTT 2005, Moscou, 23-25 juin 2005. 
LAREAU F. (2002). La synth&#232;se automatique de paraphrases comme outil de v&#233;rification des 
dictionnaires et grammaires de type Sens-Texte. M&#233;moire de ma&#238;trise,Universit&#233; de Montr&#233;al. 
L'HOMME M.-C. (2002). Fonctions lexicales pour repr&#233;senter les relations s&#233;mantiques entre 
termes, Traitement automatique de la langue, 43(1), pp. 19-41. 
MEL'&#253;UK I., CLAS A. et POLGU&#200;RE A. (1995). Introduction &#224; la lexicologie explicative et 
combinatoire, Louvain-la-Neuve (Belgique), Duculot. 
MEL'&#253;UK I. et POLGU&#200;RE A. (2006). D&#233;rivations s&#233;mantiques et collocations dans le 
DiCo/LAF. Langue fran&#231;aise, num&#233;ro sp&#233;cial sur la collocation &#171; Collocations, corpus, 
dictionnaires &#187;, sous la direction de P. Blumenthal et F. J. Hausmann, 150, juin 2006, 66-83.  
NASR A. (1996). Un mod&#232;le de reformulation automatique fond&#233; sur la Th&#233;orie Sens Texte: 
Application aux langues contr&#244;l&#233;es, Th&#232;se de doctorat en informatique, Universit&#233; Paris 7  
POLGU&#200;RE A. (2000). Towards a theoretically-motivated general public dictionary of 
semantic derivations and collocations for French, Proceedings of EURALEX , ....
POLGU&#200;RE A. (2007). Lexical function standardness, in Wanner L. (ed.). Selected Topics in 
Meaning Text Theory, In Honour of Igor Mel'&#254;uk. (&#224; para&#238;tre). 
POPOVIC S. (2003). M&#233;talangage de vulgarisation des liens de fonctions lexicales, Actes de la 
premi&#232;re conf&#233;rence internationale sur la Th&#233;orie Sens-Texte, Paris, juin 2003. 
REITER E. et DALE R. (1992). A fast algorithm for the generation of referring expressions.  
Proc. of the 14th Int. Conference on Computational Linguistics, 232-238, Nantes, France. 
RICHARDSON S., DOLAN W., et VANDERWENDE L. (1998). MindNet: Acquiring and 
Structuring Semantic Information from Text, COLING-ACL 1998: 1098-1102. 
</p>
<p>478</p>

</div></div>
</body></html>