<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Caract&#233;risation d&#8217;un corpus de requ&#234;tes d&#8217;assistance</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Caract&#233;risation d&#8217;un corpus de requ&#234;tes d&#8217;assistance
</p>
<p>Fran&#231;ois BOUCHET
LIMSI-CNRS, Universit&#233; Paris-Sud XI, BP 133, 91403 Orsay Cedex
</p>
<p>bouchet@limsi.fr
</p>
<p>R&#233;sum&#233;. Afin de concevoir un agent conversationnel logiciel capable d&#8217;assister des uti-
lisateurs novices d&#8217;applications informatiques, nous avons &#233;t&#233; amen&#233;s &#224; constituer un corpus
sp&#233;cifique de requ&#234;tes d&#8217;assistance en fran&#231;ais, et &#224; &#233;tudier ses caract&#233;ristiques. Nous montrons
ici que les requ&#234;tes d&#8217;assistance se distinguent nettement de requ&#234;tes issues d&#8217;autres corpus dis-
ponibles dans des domaines proches. Nous mettons &#233;galement en &#233;vidence le fait que ce corpus
n&#8217;est pas homog&#232;ne, mais contient au contraire plusieurs activit&#233;s conversationnelles distinctes,
dont l&#8217;assistance elle-m&#234;me. Ces observations nous permettent de discuter de l&#8217;opportunit&#233; de
consid&#233;rer l&#8217;assistance comme un registre particulier de la langue g&#233;n&#233;rale.
</p>
<p>Abstract. In order to conceive a conversational agent able to assist ordinary people using
softwares, we have built up a specific corpus of assistance requests in french, and studied its cha-
racteristics. We show here that assistance requests can be clearly distinguished from the ones
from other available corpora in related domains. We also show that this corpus isn&#8217;t homoge-
nous, but on the contrary reflects various conversational activities, among which the assistance
itself. Those observations allow us to discuss about the opportunity to consider assistance as a
general language particular registre.
</p>
<p>Mots-cl&#233;s : corpus de requ&#234;tes d&#8217;assistance, agent conversationnel, activit&#233; conversa-
tionnelle, actes de dialogue.
</p>
<p>Keywords: corpus of assistance requests, conversational agent, conversational activity,
speech acts.
</p>
<p>1 Introduction
</p>
<p>Le d&#233;veloppement de l&#8217;informatique pour le grand public a entra&#238;n&#233; une forte augmentation du
nombre d&#8217;usagers novices en informatique en contact r&#233;gulier avec celle-ci. Ces usagers novices
n&#8217;ont bien souvent ni le temps ni l&#8217;envie d&#8217;utiliser des manuels papiers ou des FAQ (Foires Aux
Questions) de logiciels de plus en plus complexes (en d&#233;pit des progr&#232;s ergonomiques) dont
par ailleurs ils ne ma&#238;trisent pas le vocabulaire sp&#233;cifique. Des syst&#232;mes d&#8217;aides contextuelles
(ou CHS en anglais, pour Contextual Help Systems (Jansen, 2005)) ont &#233;t&#233; d&#233;velopp&#233;es pour
mieux s&#8217;adapter aux besoins de ces nouveaux utilisateurs, mais ceux-ci semblent toujours pr&#233;-
f&#233;rer faire appel &#224; un ami expert lorsqu&#8217;ils souhaitent r&#233;aliser une t&#226;che particuli&#232;re dans une
application (Capobianco &amp; Carbonell, 2002).
Parall&#232;lement, les agents conversationnels anim&#233;s dot&#233;s de capacit&#233;s de dialogue et de raisonne-
ment de niveaux vari&#233;s (Sadek et al., 1997) d&#233;velopp&#233;s r&#233;cemment ont mis en &#233;vidence les nom-
</p>
<p>357</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois BOUCHET
</p>
<p>breux avantages potentiels d&#8217;une pr&#233;sence (m&#234;me virtuelle) pour faciliter l&#8217;interaction homme-
machine (Lester et al., 1997).
</p>
<p>Pour r&#233;pondre &#224; ce besoin d&#8217;assistance des usagers novices, le projet DAFT d&#233;velopp&#233; au
LIMSI-CNRS (Sansonnet et al., 2005) se propose donc de d&#233;velopper des Agents Conver-
sationnels Assistants (ACA), capables d&#8217;analyser des requ&#234;tes en langue naturelle &#233;crite non
contrainte provenant d&#8217;usagers novices en situation r&#233;elle d&#8217;utilisation d&#8217;applications de com-
plexit&#233;s diverses (applets simples, pages web, traitement de texte). Pour r&#233;pondre &#224; ce type de
requ&#234;tes, le syst&#232;me d&#8217;assistance raisonne sur la structure et le fonctionnement des applications
&#224; l&#8217;aide d&#8217;un mod&#232;le de celles-ci, construit de mani&#232;re semi-automatique. Cette m&#233;thodologie
a pour objectif de fournir une assistance pertinente en contexte &#224; la mani&#232;re des CHS, avec en
plus tous les b&#233;n&#233;fices li&#233;s &#224; la pr&#233;sence d&#8217;agents conversationnels anim&#233;s.
</p>
<p>Afin d&#8217;identifier pr&#233;cis&#233;ment les propri&#233;t&#233;s et les besoins propres &#224; la Fonction d&#8217;Assistance,
nous avons &#233;t&#233; amen&#233;s &#224; constituer un corpus de requ&#234;tes, auquel on se r&#233;f&#233;rera sous le nom
de corpus DAFT. Ce corpus illustre les actes de dialogues r&#233;alis&#233;s par des sujets en situation
d&#8217;assistance et a &#233;t&#233; &#233;tudi&#233; lors d&#8217;un stage de M2R (Bouchet, 2006) afin de pouvoir r&#233;aliser les
sp&#233;cifications d&#8217;un langage de requ&#234;tes formelles adapt&#233; au domaine d&#8217;&#233;tude1.
Dans cet article, nous d&#233;taillons dans un premier temps le processus de constitution du corpus
employ&#233;, en justifiant en particulier la n&#233;cessit&#233; des choix effectu&#233;s et en v&#233;rifiant que le corpus
ainsi obtenu est viable pour r&#233;pondre &#224; nos besoins. Dans un second temps, nous nous pro-
posons de comparer ce corpus avec d&#8217;autres corpus de domaines proches pour en d&#233;gager les
sp&#233;cificit&#233;s. Enfin, nous analysons les diff&#233;rentes activit&#233;s couvertes par les requ&#234;tes recueillies
et tentons de les caract&#233;riser par des param&#232;tres d&#8217;ordre linguistique.
</p>
<p>2 Collecte et construction du corpus
</p>
<p>2.1 M&#233;thodologie employ&#233;e
</p>
<p>Au moment de l&#8217;&#233;tude, le corpus DAFT se composait d&#8217;environ 5 000 requ&#234;tes isol&#233;es (cf.
&#167;2.3) recueillies entre juin 2004 et juin 2006. Pour le constituer, nous avons eu recours &#224; deux
m&#233;thodes compl&#233;mentaires garantissant &#224; la fois l&#8217;empirisme et la bonne couverture du corpus :
</p>
<p>1. Recueillir des requ&#234;tes r&#233;elles produites par des utilisateurs plac&#233;s devant des applications
int&#233;grant un ACA de type LEA2 (2/3 du corpus final).
</p>
<p>2. Utiliser des structures dialogiques g&#233;n&#233;riques issues de classifications de th&#233;saurus an-
glais (600 structures (Molinsky &amp; Bliss, 1994)) ou bilingues (300 structures (Atkins &amp;
Lewis, 1996)). Ces structures ont &#233;t&#233; adapt&#233;es pour les employer dans des requ&#234;tes d&#8217;as-
sistance formul&#233;es dans le contexte des applications mentionn&#233;es dans le point pr&#233;c&#233;dent,
afin d&#8217;assurer une certaine homog&#233;n&#233;it&#233; lexicale du corpus (1/3 du corpus final). Ainsi,
la structure &#8220;&#231;a te dirait de. . .&#8221; utilis&#233;e conjointement avec une phrase recueillie comme
&#8220;peux-tu jouer &#224; ma place ?&#8221; donne &#8220;&#231;a te dirait de jouer &#224; ma place ?&#8221;.
</p>
<p>1Une premi&#232;re version moins compl&#232;te de cette &#233;tude a &#233;t&#233; pr&#233;sent&#233;e lors de l&#8217;atelier WACA&#8217;02, n&#8217;ayant pas
donn&#233; lieu &#224; une parution d&#8217;actes.
</p>
<p>2LIMSI Embodied Agent, d&#233;velopp&#233; par J-C. Martin dans le cadre du projet NICE (Buisine &amp; Martin, 2005)
</p>
<p>358</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caract&#233;risation d&#8217;un corpus de requ&#234;tes d&#8217;assistance
</p>
<p>FIG. 1 &#8211; L&#8217;agent WebLea (Marco) plac&#233; sur une page du site web du GT ACA
</p>
<p>L&#8217;utilisation de la seconde m&#233;thode nous permet de compenser la difficult&#233; &#224; obtenir un corpus
de taille sup&#233;rieure avec le panel r&#233;duit de sujets dont nous disposions3. Il y a recouvrement
partiel avec les phrases recueillies par la premi&#232;re m&#233;thode, mais ce choix, discutable dans
l&#8217;absolu, doit &#234;tre mis en relation avec l&#8217;objectif de ce corpus qui est de fournir une base pour
la constitution d&#8217;un agent rationnel : la couverture prime donc sur l&#8217;exactitude de la fr&#233;quence
des ph&#233;nom&#232;nes linguistiques. Le corpus ainsi construit sature donc mieux le domaine d&#8217;&#233;tude,
m&#234;me si cela induit fatalement un biais en sur-repr&#233;sentant des ph&#233;nom&#232;nes linguistiques rares
(les structures employ&#233;es ne seraient apparues &#8220;naturellement&#8221; que sur un corpus plus grand).
</p>
<p>2.2 Recueil des requ&#234;tes d&#8217;assistance
</p>
<p>Les phrases recueillies l&#8217;ont &#233;t&#233; au sein de deux types d&#8217;applications :
</p>
<p>1. deux applications de type Java (Le Guern, 2004) : un simple compteur temps r&#233;el (thread
Java) dont l&#8217;utilisateur contr&#244;le le d&#233;marrage et la vitesse, et un jeu de tours de Hanoi
fonctionnant de mani&#232;re modale (ie n&#8217;&#233;voluant que si l&#8217;utilisateur agit).
</p>
<p>2. deux sites web : une version active du site du groupe AMI du LIMSI permettant l&#8217;&#233;dition
de contenu, et le site du GT ACA4(cf. figure 1) en libre acc&#232;s sur internet aux utilisateurs
effectifs du site.
</p>
<p>Dans la mesure o&#249; l&#8217;agent assistant que nous souhaitons r&#233;aliser doit disposer d&#8217;une certaine
g&#233;n&#233;ricit&#233; (ind&#233;pendance par rapport aux applications assist&#233;es), ces diff&#233;rentes origines ne
posent pas de probl&#232;me concernant l&#8217;homog&#233;n&#233;it&#233; de notre corpus. L&#8217;emploi d&#8217;un vocabulaire
tr&#232;s sp&#233;cifique &#224; une application particuli&#232;re permet parfois de retrouver a posteriori l&#8217;origine
de certaines requ&#234;tes, mais la formulation g&#233;n&#233;rale des requ&#234;tes n&#8217;est elle pas affect&#233;e (par
exemple, la phrase &quot;comment faire pour arr&#234;ter le compteur ?&quot; a une structure globale identique
&#224; &quot;comment faire pour s&#8217;inscrire au GT ACA?&quot;).
</p>
<p>3Environ 50 sujets ayant r&#233;alis&#233; une session repr&#233;sentant de 10 &#224; 50 requ&#234;tes en environnement contr&#244;l&#233; sur
les 3 premi&#232;res applications d&#233;crites, et 30 personnes ayant particip&#233; &#224; la campagne &quot;Marco&quot;, ouverte sur le web &#224;
tous les usagers du GT ACA entre janvier et mars 2006.
</p>
<p>4Groupe de Travail sur les Agents Conversationnels Anim&#233;s - http://www.limsi.fr/aca/
</p>
<p>359</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois BOUCHET
</p>
<p>N&#730; Phrases du corpus N&#730; Phrases du corpus
1 appuies sur le bouton quitter 8 j&#8217;ai &#233;t&#233; surpris qu&#8217;il manque une fonction d&#8217;annulation
2 clickersur le bouton back 9 &#231;a serait mieux si on pouvait aller directement au d&#233;but
3 bon, reviens &#224; l apage d&#8217;accueil 10 auf viedersen
4 a quoi sert cette fen&#234;tre, 11 ca marche :-)
5 c quoi le GT ACA 12 Quel genre de musique tu aimes ?
6 le bouton &quot;fermer&quot; et le bouton &quot;quitter&quot; 13 bon &#224; rien !
</p>
<p>ont le m&#234;me fonctionnement ?
7 je ne vosi aucune page de demso ! ! 14 j&#8217;aime tes cheveux L&#233;a
</p>
<p>TAB. 1 &#8211; Exemples de phrases du corpus DAFT avec diff&#233;rentes sortes d&#8217;erreurs en gras
</p>
<p>2.3 Vue du corpus
</p>
<p>La table 1 expose un extrait du corpus DAFT, faisant appara&#238;tre certaines de ses caract&#233;ristiques :
&#8211; beaucoup de phrases sont bruit&#233;es (expressions orales, fautes d&#8217;orthographe, de syntaxe et de
grammaire, langage SMS. . .), et certaines erreurs sont non triviales &#224; traiter avec des outils
classiques de TALN.
</p>
<p>&#8211; il ne se pr&#233;sente pas comme une succession de dialogues homme-machine, mais plut&#244;t
comme une liste de phrases employ&#233;es par les usagers (questions, ordres ou remarques &#224;
l&#8217;agent. . .). En effet, on constate que dans le cadre de la Fonction d&#8217;Assistance, les interac-
tions dialogiques se limitent essentiellement &#224; un seul et unique tour de parole (commande-
action, question-r&#233;ponse. . .), et peuvent donc &#234;tre trait&#233;es de mani&#232;re isol&#233;e5.
</p>
<p>2.4 De la n&#233;cessit&#233; du corpus
</p>
<p>Bien qu&#8217;il n&#8217;y ait pas de corpus d&#8217;assistance similaires ais&#233;ment disponibles en fran&#231;ais, on est
en droit de s&#8217;interroger sur la n&#233;cessit&#233; de constituer un nouveau corpus : est-ce qu&#8217;un corpus
dans un domaine connexe tel que le dialogue homme-machine orient&#233; t&#226;che n&#8217;aurait pas &#233;t&#233;
suffisamment proche pour nous convenir ?
</p>
<p>Pour r&#233;pondre &#224; cette question, et ainsi justifier la n&#233;cessit&#233; d&#8217;un corpus particulier, on peut
suivre la m&#233;thode de comparaison statistique de corpus pr&#233;sent&#233;e dans (Ripoche, 2006) pour
comparer le corpus DAFT &#224; plusieurs corpus de dialogues homme-homme orient&#233;s t&#226;che par
l&#8217;&#233;tude de leurs profils interactionnels.
On appelle profil interactionnel d&#8217;un corpus une repr&#233;sentation sous forme d&#8217;histogrammes de
la r&#233;partition des diff&#233;rents actes de dialogue (au sens de (Searle, 1969)) au sein de celui-ci
(cf. fig. 2). Les trois corpus de r&#233;f&#233;rence choisis pour effectuer cette comparaison sont Switch-
board (Jurafsky et al., 1998) (200 000 &#233;nonc&#233;s de conversations t&#233;l&#233;phoniques orient&#233;es t&#226;che
annot&#233;s manuellement), MapTask (Carletta et al., 1996) (128 dialogues visant &#224; reconstruire
une carte par placement de points de rep&#232;re) et Bugzilla (Ripoche, 2006) (1 200 000 commen-
taires issus de 128 000 rapports de d&#233;fauts &#233;tablis lors du d&#233;veloppement de la suite logicielle
de la Fondation Mozilla).6
</p>
<p>5Ce point essentiel de notre approche nous a &#233;t&#233; confirm&#233; par N. Carbonell, et sera discut&#233; en d&#233;tails en 2.5.
6Switchboard et MapTask, de part leur nature orale, sont naturellement plus riches en nombre de mots que des
</p>
<p>corpus &#233;crits (Kelly &amp; Chapanis, 1977), mais la proximit&#233; des activit&#233;s a prim&#233; sur cette diff&#233;rence de nature dans
notre choix de les employer pour cette comparaison (en l&#8217;absence de corpus &#233;crits &#233;quivalents connus).
</p>
<p>360</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caract&#233;risation d&#8217;un corpus de requ&#234;tes d&#8217;assistance
</p>
<p>FIG. 2 &#8211; Comparaison des profils interactionnels de corpus d&#8217;assistance dialogique
</p>
<p>Nous avons donc effectu&#233; une conversion des taxonomies d&#8217;actes de dialogue de ces diff&#233;-
rents corpus vers une taxonomie commune en 5 actes, tandis qu&#8217;un sous-ensemble au 1/5e du
corpus DAFT a &#233;t&#233; manuellement annot&#233; directement dans cette m&#234;me taxonomie. Certains
actes de dialogues tr&#232;s sp&#233;cifiques (par exemple les &quot;self-talk&quot; de Switchboard) sont difficiles &#224;
convertir ; les r&#233;sultats ne sont donc pas parfaits et leur interpr&#233;tation doit &#234;tre consid&#233;r&#233;e avec
certaines pr&#233;cautions. Toutefois, certaines caract&#233;ristiques suffisamment nettes distinguent le
corpus DAFT des trois autres :
&#8211; une pr&#233;sence majoritaire (57 %) de directifs, s&#8217;expliquant par un nombre &#233;lev&#233; d&#8217;ordres di-
</p>
<p>rects ou de questions &#224; l&#8217;agent. Bien qu&#8217;orient&#233;s t&#226;che, les autres corpus mettent en jeu uni-
quement des interlocuteurs humains, et il est vraisemblable que le fait de s&#8217;adresser &#224; la
machine (m&#234;me via un agent conversationnel) tend &#224; rendre les requ&#234;tes plus directes car les
usagers supposent que l&#8217;agent n&#8217;est pas capable des m&#234;mes inf&#233;rences qu&#8217;un &#234;tre humain.
</p>
<p>&#8211; un nombre assez faible d&#8217;assertifs (13 %), l&#8217;utilisateur exprimant bien plus son &#233;tat d&#8217;esprit
(29 %) par rapport &#224; des faits que ces m&#234;mes faits de mani&#232;re neutre et &#8220;objective&#8221; comme
c&#8217;est le cas par exemple dans le corpus Bugzilla ci-dessus.
</p>
<p>&#8211; quelques promissifs sont pr&#233;sents (1 %) mais marginaux, ce qui s&#8217;explique par la nature de la
relation agent-utilisateur, car si l&#8217;agent est par essence aux ordres de l&#8217;utilisateur, ce dernier
ne se sent que rarement engag&#233; envers son agent assistant (m&#234;me pour suivre ses conseils).
</p>
<p>Ces divergences entre corpus portant sur un m&#234;me th&#232;me (l&#8217;assistance dialogique &#224; une t&#226;che)
d&#233;montrent que notre hypoth&#232;se &#233;tait justifi&#233;e et que notre champ d&#8217;&#233;tude se distingue suffisam-
ment des champs connexes pour que nous ayons besoin de disposer d&#8217;un corpus propre.
</p>
<p>2.5 L&#8217;assistance : un registre de langue ?
</p>
<p>Le fait que la plupart des interactions ne n&#233;cessitent qu&#8217;un seul tour de parole rapproche finale-
ment davantage notre projet des interfaces d&#8217;Interaction en Langue Naturelle (NLI en anglais,
comme d&#233;fini par (Androutsopoulos &amp; Aretoulaki, 2003)) que des syst&#232;mes de dialogue &#224; pro-
prement parler, ce qui peut s&#8217;expliquer par le fait que le domaine de l&#8217;assistance est relative-
ment circonscrit. Il pourrait &#233;ventuellement &#234;tre consid&#233;r&#233; comme constituant un sous-langage
au sens de (Kittredge, 1982) (au m&#234;me titre que les bulletins m&#233;t&#233;orologiques ou la biologie)
ou tout du moins comme un registre particulier de langue (Biber, 1995), dans la mesure o&#249; si
l&#8217;on fait abstraction du clavardage entre l&#8217;utilisateur et l&#8217;agent qui n&#8217;est pas notre centre d&#8217;&#233;tude
principal, on constate globalement que :
&#8211; le vocabulaire employ&#233; est assez pauvre et fortement li&#233; &#224; l&#8217;application assist&#233;e (cf. phrases
</p>
<p>1-9 de la table 1).
&#8211; les classes lexicales les plus fr&#233;quentes sont peu nombreuses car essentiellement en rapport
</p>
<p>avec des &#233;l&#233;ments de l&#8217;interface graphique (boutons, champs texte. . .) et avec des actions
</p>
<p>361</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois BOUCHET
</p>
<p>standards (ajouter, modifier, d&#233;placer. . .).
&#8211; les structures de phrases, particuli&#232;rement dans les sous-corpus d&#8217;assistance, sont assez pro-
</p>
<p>totypiques et tr&#232;s diff&#233;rentes de ce que l&#8217;on trouve dans la langue naturelle g&#233;n&#233;rale7.
</p>
<p>3 Cat&#233;gorisation et caract&#233;risation du corpus DAFT
</p>
<p>3.1 Cat&#233;gorisation des activit&#233;s conversationnelles
</p>
<p>Lors de la phase de recueil du corpus, les sujets humains ont &#233;t&#233; inform&#233;s qu&#8217;ils devaient r&#233;a-
liser certaines t&#226;ches, en faisant appel si n&#233;cessaire &#224; un agent (non humain) pr&#233;sent dans l&#8217;ap-
plication pour les assister. Les sujets pouvaient n&#233;anmoins agir et s&#8217;exprimer de mani&#232;re non
contrainte, et divers comportements ont pu &#234;tre observ&#233;s, l&#8217;utilisateur se d&#233;tournant parfois
compl&#232;tement de sa t&#226;che initiale. Finalement, il appara&#238;t donc que de nombreuses phrases re-
cueillies ne rel&#232;vent pas vraiment du domaine de l&#8217;assistance (cf. table 1). Nous nous sommes
par cons&#233;quent int&#233;ress&#233;s &#224; identifier les diff&#233;rentes activit&#233;s conversationnelles r&#233;ellement pr&#233;-
sentes dans le corpus.
</p>
<p>FIG. 3 &#8211; R&#233;partition du corpus en sous-corpus par activit&#233;s
</p>
<p>Pour cela, nous avons extrait al&#233;atoirement des phrases du corpus de mani&#232;re &#224; former deux
sous-ensembles de taille &#233;gale au dixi&#232;me de la taille totale du corpus. Dans le premier sous-
ensemble, les phrases ont &#233;t&#233; regroup&#233;es manuellement par activit&#233;s similaires, en s&#8217;int&#233;ressant
notamment au th&#232;me des requ&#234;tes (application, agent, utilisateur. . .) et &#224; leur nature (ordre, ques-
tion, compliment. . .). On a finalement obtenu ainsi quatre grandes cat&#233;gories de tailles in&#233;gales
(cf. fig. 3). Ensuite, connaissant ces quatre activit&#233;s principales, on a trait&#233; le deuxi&#232;me sous-
ensemble en classifiant manuellement les phrases de celui-ci dans une des activit&#233;s d&#233;finies
pr&#233;c&#233;demment. La r&#233;partition ainsi d&#233;termin&#233;e &#233;tait tr&#232;s proche de celle trouv&#233;e sur le premier
sous-ensemble, ce qui nous laisse penser qu&#8217;on peut raisonnablement g&#233;n&#233;raliser ce r&#233;sultat &#224;
l&#8217;ensemble du corpus (la figure 3 pr&#233;sente les r&#233;sultats obtenus en faisant la moyenne des deux
r&#233;partitions trouv&#233;es).
On peut par cons&#233;quent consid&#233;rer que notre corpus est divisible en quatre &#8220;sous-corpus&#8221;, cor-
respondant chacun &#224; des types d&#8217;activit&#233;s distinctes (les phrases donn&#233;es en exemples sont celles
de la table 1) :
</p>
<p>1. activit&#233; de contr&#244;le : corpus constitu&#233; de commandes, afin que l&#8217;agent agisse lui-m&#234;me
sur l&#8217;application (phrases 1-3).
</p>
<p>2. activit&#233; d&#8217;assistance directe : regroupant des demandes d&#8217;aide explicitement formul&#233;es
comme telles par l&#8217;utilisateur (phrases 4-6).
</p>
<p>7Comme l&#8217;a montr&#233; une autre comparaison effectu&#233;e par rapport &#224; un extrait du corpus g&#233;n&#233;raliste Multitag,
fourni par P. Paroubek.
</p>
<p>362</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caract&#233;risation d&#8217;un corpus de requ&#234;tes d&#8217;assistance
</p>
<p>Sous-corpus Contr&#244;le Assist. directe Assist. indirecte Clavardage
Moyenne 5,44 8,01 9,90 6,01
&#201;cart-type 3,36 3,54 3,30 3,62
</p>
<p>TAB. 2 &#8211; R&#233;partition des phrases par longueur (mots) dans les sous-corpus
</p>
<p>3. activit&#233; d&#8217;assistance indirecte : corpus form&#233; d&#8217;opinions sur l&#8217;application qui constituent
des demandes d&#8217;aide sous-entendues, probablement perceptibles uniquement au niveau
pragmatique (phrases 7-9).
</p>
<p>4. activit&#233; de clavardage : r&#233;unissant le reste des interactions essentiellement centr&#233;es sur
l&#8217;agent ainsi que des expressions m&#233;talinguistiques, phatiques8 et de backchanneling9
(phrases 10-14).
</p>
<p>L&#8217;existence des sous-corpus de contr&#244;le et de clavardage d&#233;montre que l&#8217;utilisateur attend non
seulement d&#8217;un ACA qu&#8217;il l&#8217;aide &#224; utiliser une application, mais aussi qu&#8217;il soit capable d&#8217;agir
lui-m&#234;me sur celle-ci, ainsi que de r&#233;pondre &#224; des commentaires annexes ind&#233;pendants de la
t&#226;che &#224; accomplir o&#249; l&#8217;agent devient lui-m&#234;me le centre d&#8217;int&#233;r&#234;t de l&#8217;utilisateur (ce ph&#233;nom&#232;ne
s&#8217;expliquant essentiellement par la pr&#233;sence d&#8217;une repr&#233;sentation visuelle de l&#8217;agent).
</p>
<p>3.2 M&#233;thodes de caract&#233;risation des sous-corpus
</p>
<p>Les quatre sous-corpus ont &#233;t&#233; cat&#233;goris&#233;s pr&#233;c&#233;demment uniquement par une annotation ma-
nuelle, mais il serait souhaitable de pouvoir automatiser cette classification afin d&#8217;analyser sp&#233;-
cifiquement les activit&#233;s propres &#224; chaque sous-corpus. On envisage alors trois m&#233;thodes de
caract&#233;risation possibles de ceux-ci :
&#8211; une &#233;tude de la distribution de la longueur des phrases des sous-corpus.
&#8211; une &#233;tude des profils interactionnels des sous-corpus, tels que d&#233;finis en 2.4.
&#8211; une &#233;tude de la s&#233;mantique des phrases par analyse de leur retranscription sous forme de
</p>
<p>requ&#234;tes formelles.
</p>
<p>3.2.1 Caract&#233;risation par la longueur des phrases
</p>
<p>On observe une certaine disparit&#233; de longueur des requ&#234;tes, les requ&#234;tes de contr&#244;le semblant
globalement assez courtes compar&#233;es aux requ&#234;tes d&#8217;assistance (cf. table 2), et on peut ap-
proximer les r&#233;partitions des sous-corpus de contr&#244;le et d&#8217;assistance indirecte par une loi nor-
male (test de &#967;2 avec un seuil de tol&#233;rance de 1%). N&#233;anmoins, les &#233;cart-types trop importants
(&#963; &#8776; 3, 5) disqualifient en pratique cette m&#233;thode de classification.
</p>
<p>3.2.2 Caract&#233;risation par l&#8217;analyse des profils interactionnels
</p>
<p>On distingue sur la figure 4 certaines diff&#233;rences de profils interactionnels assez nettes entre
les sous-corpus et par rapport au profil g&#233;n&#233;rique du corpus DAFT (rappel&#233; en gris fonc&#233;),
notamment pour distinguer l&#8217;assistance directe (avec une forte majorit&#233; de directifs et quelques
expressifs) de l&#8217;assistance indirecte (une majorit&#233; d&#8217;assertifs et des expressifs). En revanche, les
</p>
<p>8Pour maintenir le contact communicatif avec l&#8217;agent : &#171; pas vrai lea ? &#187;, &#171; tu dors ou quoi ? &#187;. . .
9Pour marquer son accord aux propos du locuteur et l&#8217;inciter &#224; continuer : &#171; Bon. &#187;, &#171; ok ok &#187;. . .
</p>
<p>363</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois BOUCHET
</p>
<p>profils interactionnels des sous-corpus de contr&#244;le et d&#8217;assistance directe sont assez similaires.
Cette m&#233;thode pr&#233;sente donc un certain int&#233;r&#234;t mais ne peut &#234;tre utilis&#233;e de mani&#232;re unique. En
outre, automatiser la d&#233;tection de ces actes de dialogue n&#8217;est pas non plus trivial.
</p>
<p>FIG. 4 &#8211; Comparaison des profils interactionnels des sous-corpus du corpus DAFT
</p>
<p>3.2.3 Caract&#233;risation par analyse des requ&#234;tes formalis&#233;es
</p>
<p>Notre principale motivation pour constituer ce corpus &#233;tait de pouvoir s&#8217;en servir comme base
pour la d&#233;finition d&#8217;un langage formel adapt&#233; pour exprimer la s&#233;mantique des requ&#234;tes lan-
gagi&#232;res. La syntaxe de ce langage, pr&#233;sent&#233;e en d&#233;tails dans (Bouchet, 2006), distingue des
modalit&#233;s (la possibilit&#233;, l&#8217;obligation, le savoir. . .), des pr&#233;dicats d&#8217;actions (modifier, d&#233;placer,
actionner. . .) et des r&#233;f&#233;rences (le tableau, le petit bouton rouge. . .) qui peuvent s&#8217;imbriquer
entre elles sous la forme :
</p>
<p>M1(. . .Mn(c1 = P1(c&#8217;1 = R1, . . ., c&#8217;l = Rl), . . ., cm = Pm(. . .)) . . .)
</p>
<p>Expression dans laquelle : M1 - Mn sont des modalit&#233;s,
P1 - Pm sont des pr&#233;dicats,
c1 - cm &amp; c&#8217;1 - c&#8217;l sont des intitul&#233;s de champs typ&#233;s (par exemple : objet, personne, lieu. . .),
R1 - Rl sont des r&#233;f&#233;rences issues de la requ&#234;te langagi&#232;re.
</p>
<p>Exemple : La phrase 6 de la table 1 pourra ainsi s&#8217;&#233;crire sous la forme :
CHECK(NEG(DIFFERENCE(between=&quot;le bouton &#8217;fermer&#8217;&quot;, and=&quot;le bouton &#8217;quitter&#8217;&quot;,
is=&quot;fonctionnement&quot;)))
</p>
<p>Si l&#8217;on s&#8217;int&#233;resse alors au nombre de modalit&#233;s ou de pr&#233;dicats pr&#233;sents dans chacun des sous-
corpus, on constate des diff&#233;rences assez nettes (cf. figure 5) :
&#8211; le contr&#244;le poss&#232;de un nombre &#233;lev&#233; de pr&#233;dicats par phrase (0.97) et peu de modalit&#233;s (0.22).
&#8211; l&#8217;assistance directe contient beaucoup de modalit&#233;s (2.41) ainsi qu&#8217;un nombre moyen de
pr&#233;dicats (0.54).
</p>
<p>&#8211; l&#8217;assistance indirecte diff&#232;re peu de l&#8217;assistance directe avec 0.59 pr&#233;dicats par phrase et
l&#233;g&#232;rement moins de modalit&#233;s (2.22), avec toutefois une part plus forte de phrases &#224; modalit&#233;
unique (18% contre 5%).
</p>
<p>&#8211; le clavardage (limit&#233; aux phatiques pour cette &#233;tude) est extr&#234;mement pauvre en pr&#233;dicats
(0.08) et assez peu de modalit&#233;s (0.86).
</p>
<p>364</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caract&#233;risation d&#8217;un corpus de requ&#234;tes d&#8217;assistance
</p>
<p>FIG. 5 &#8211; Nombre de modalit&#233;s et pr&#233;dicats par phrase dans chacun des sous-corpus
</p>
<p>3.2.4 Conclusion de l&#8217;&#233;tude
</p>
<p>Parmi les trois m&#233;thodes test&#233;es, aucune ne permet d&#8217;identifier parfaitement l&#8217;activit&#233; corres-
pondant &#224; une requ&#234;te. On constate en effet que :
&#8211; la longueur des phrases n&#8217;apporte pas d&#8217;informations discriminantes,
&#8211; la comparaison des profils interactionnels permet une discrimination efficace des deux formes
</p>
<p>d&#8217;assistance (directe et indirecte) qui nous int&#233;ressent dans le cadre du projet DAFT,
&#8211; la comparaison des requ&#234;tes mises sous forme formelle permet de distinguer le contr&#244;le,
</p>
<p>l&#8217;assistance et le clavardage.
Pour classifier automatiquement les requ&#234;tes dans un des sous-corpus, on pourra donc envisager
de combiner ces deux derni&#232;res m&#233;thodes.
</p>
<p>4 Conclusion et perspectives
La Fonction d&#8217;Assistance, dans le cadre des CHS, constitue un registre de langue particulier, et
se distingue d&#8217;activit&#233;s connexes comme le dialogue homme-homme orient&#233; t&#226;che. Nous avons
constitu&#233; un corpus compos&#233; de requ&#234;tes d&#8217;assistance recueillies dans le cadre de diverses ap-
plications et d&#8217;autres requ&#234;tes construites en situation, ce qui nous a permis d&#8217;avoir un ensemble
globalement repr&#233;sentatif de l&#8217;assistance. Nous avons montr&#233; que ce corpus recouvre en r&#233;alit&#233;
quatre activit&#233;s distinctes, identifiables par une combinaison de m&#233;thodes statistiques classiques
et d&#8217;une analyse n&#233;cessitant la transcription des requ&#234;tes dans un langage formel.
</p>
<p>Depuis la r&#233;alisation de cette &#233;tude, le corpus DAFT a &#233;t&#233; compl&#233;t&#233;, notamment afin de renfor-
cer la proportion de requ&#234;tes d&#8217;assistance (qui ne repr&#233;sentait ici que 45% du corpus total) en
incluant des requ&#234;tes relev&#233;es face &#224; une application de nature plus complexe (Word). Il compte
</p>
<p>365</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fran&#231;ois BOUCHET
</p>
<p>ainsi d&#233;sormais un peu plus de 11 000 phrases, qui nous servent actuellement de base solide
pour la construction de la cha&#238;ne de traitement des requ&#234;tes langagi&#232;res (analyses grammati-
cale et s&#233;mantique). Un large extrait sous forme brute ainsi que des phrases analys&#233;es par notre
syst&#232;me sont disponibles en libre acc&#232;s10.
</p>
<p>R&#233;f&#233;rences
ANDROUTSOPOULOS I. &amp; ARETOULAKI M. (2003). The Oxford Handbook of Computational Lin-
guistics, chapter Natural Language Interfaces, p. 629&#8211;649. Oxford University Press.
ATKINS B. &amp; LEWIS H. (1996). The Collins-Robert French-English Dictionary, chapter Language in
Use. Harper Collins Publishers, 1st edition.
BIBER D. (1995). Dimensions of register variation : a cross-linguistic comparison. Cambridge Uni-
versity Press.
BOUCHET F. (2006). Conception d&#8217;un langage de requ&#234;tes pour un agent conversationnel assistant.
Master&#8217;s thesis, Univ. Paris XI.
BUISINE S. &amp; MARTIN J.-C. (2005). Children&#8217;s and adults&#8217; multimodal interaction with 2d conver-
sational agents. In Proceedings of the SIGCHI conference on Human factors in computing systems, p.
1240&#8211;1243, Portland, Oregon, USA : ACM Press.
CAPOBIANCO A. &amp; CARBONELL N. (2002). Conception d&#8217;aides en ligne pour le grand public : d&#233;fis
et propositions. In Actes de ERGO-IA&#8217;2002, p. 309&#8211;335.
CARLETTA J., ISARD A., ISARD S., KOWTKO J., DOHERTY-SNEDDON G. &amp; ANDERSON A. (1996).
HCRC dialogue structure coding manual. Rapport interne, Univ. of Edinburgh.
JANSEN B. J. (2005). Seeking and implementing automated assistance during the search process.
Information Processing and Management, 41(4), 909&#8211;928.
JURAFSKY D., BATES R., COCCARO N., MARTIN R., METEER M., RIES K., SHRIBERG E.,
STOLCKE A., TAYLOR P. &amp; VAN ESS-DYKEMA C. (1998). Switchboard Discourse Language Mode-
ling Project Final Report. Rapport interne, Center for Speech and Language Processing, Johns Hopkins
University, Baltimore, MD, USA.
KELLY M. J. &amp; CHAPANIS A. (1977). Limited vocabulary natural language dialogue. International
Journal of Man-Machine Studies, 9(4), 479&#8211;501.
KITTREDGE R. (1982). Variation and homogeneity of sublanguages. In Sublanguage : Studies of
Language in Restricted Semantic Domains, p. 107&#8211;137. De Gruyter.
LE GUERN K. (2004). D&#233;finition d&#8217;une architecture de m&#233;diateur pour des agents conversationnels
anim&#233;s. Master&#8217;s thesis, Univ. Paris XI.
LESTER J. C., CONVERSE S. A., KAHLER S. H., BARLOW S. T., STONE B. A. &amp; BHOGAL R. S.
(1997). The Persona Effect : Affective impact of animated pedagogical agents. In Proc. of CHI&#8217;97, p.
359&#8211;366, New York, NY, USA : ACM Press.
MOLINSKY S. J. &amp; BLISS B. (1994). Inventory of functions and conversation strategies, In Commu-
nicator : The Comprehensive course in functional English, p. 177&#8211;187. Prentice Hall.
RIPOCHE G. (2006). Sur les traces de Bugzilla. PhD thesis, Univ. Paris XI.
SADEK D., BRETIER P. &amp; PANAGET E. (1997). Artimis : Natural dialogue meets rational agency. In
IJCAI (2), p. 1030&#8211;1035.
SANSONNET J.-P., LE GUERN K. &amp; MARTIN J.-C. (2005). Une architecture m&#233;diateur pour des
agents conversationnels anim&#233;s. In Actes de WACA&#8217;01, p. 31&#8211;39.
SEARLE J. R. (1969). Speech Acts : An essay in the Philosophy of language. Cambridge, new edition.
</p>
<p>10http://www.limsi.fr/~jps/research/daft/index.html
</p>
<p>366</p>

</div></div>
</body></html>