<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une ressource pr&#233;dicative pour l&#8217;extraction d&#8217;information</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Vers une ressource pr&#233;dicative
pour l&#8217;extraction d&#8217;information
</p>
<p>Aur&#233;lien BOSSARD
LIPN &#8211; Universit&#233; Paris 13, 93200 Villetaneuse
</p>
<p>aurelien.bossard@lipn.univ-paris13.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente une m&#233;thode pour construire, &#224; partir d&#8217;une ressource lexi-
cale pr&#233;dicative existante, une ressource enrichie pouvant servir &#224; une t&#226;che d&#8217;extraction. Nous
montrons les points forts et les lacunes de deux ressources existantes pour le Fran&#231;ais : les
Tables du LADL et Volem. Apr&#232;s avoir montr&#233; pourquoi nous avons s&#233;lectionn&#233; Volem, nous
listons les donn&#233;es n&#233;cessaires &#224; la t&#226;che d&#8217;extraction d&#8217;information. Nous pr&#233;sentons le proces-
sus d&#8217;enrichissement de la ressource initiale et une &#233;valuation, &#224; travers une t&#226;che d&#8217;extraction
d&#8217;information concernant des textes de rachats d&#8217;entreprise.
</p>
<p>Abstract. In this article, we present a method aiming at building a resource for an infor-
mation extraction task, from an already existing French predicative lexical resource. We point
out the weaknesses and strengthnesses of two predicative resources we worked with : Les tables
du LADL and Volem. We present why we select Volem as the most interesting resource for the
task. Thereafter, we make a list of the needs an information extraction task implies, and how we
include missing information in the resource we selected. We evaluate the resource completed
by those missing informations, using it in an information extraction task.
</p>
<p>Mots-cl&#233;s : ressource pr&#233;dicative, extraction d&#8217;information, patrons lexico-syntaxiques.
Keywords: predicative resource, information extraction, lexico-syntactic patterns.
</p>
<p>1 Introduction
</p>
<p>Cet article vise &#224; montrer la fa&#231;on dont nous avons proc&#233;d&#233; pour contribuer &#224; une ressource lexi-
cale pour le fran&#231;ais, utile &#224; des fins d&#8217;extraction d&#8217;information, en nous servant de ressources
d&#233;j&#224; existantes. La cr&#233;ation d&#8217;une ressource pour le fran&#231;ais assez compl&#232;te pour couvrir de
larges champs d&#8217;application en TAL appara&#238;t aujourd&#8217;hui comme un enjeu majeur. En effet,
en raison du manque de ressources, seules deux approches sont aujourd&#8217;hui possibles afin de
r&#233;aliser des applications du type extraction d&#8217;information : l&#8217;apprentissage automatique et/ou la
cr&#233;ation de r&#232;gles &#224; la main.
</p>
<p>L&#8217;approche que nous d&#233;fendons ici est fond&#233;e sur la notion de sch&#233;ma pr&#233;dicatif. Les &#233;l&#233;ments
pertinents pour l&#8217;extraction sont ceux qui se situent autour d&#8217;une relation s&#233;mantique, port&#233;e par
un nom pr&#233;dicatif ou, plus souvent, par un verbe. L&#8217;&#233;tude des sch&#233;mas pr&#233;dicatifs permet d&#8217;at-
tribuer un r&#244;le &#224; chacun des arguments du pr&#233;dicat ; l&#8217;&#233;tude de la syntaxe de la phrase permet
en outre une mise en relation des arguments d&#8217;un pr&#233;dicat avec leur r&#244;le th&#233;matique. Nous tes-
tons notre approche dans le cadre d&#8217;une application d&#8217;extraction d&#8217;information portant sur des
</p>
<p>347</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien BOSSARD
</p>
<p>rachats d&#8217;entreprise. La t&#226;che consiste par exemple &#224; donner une repr&#233;sentation (s&#233;mantique)
identique pour les trois phrases suivantes :
</p>
<p>&#8211; CPI rach&#232;te Fulmar.
&#8211; CPI a rachet&#233; Fulmar &#224; son PDG pour 50 millions d&#8217;euros.
&#8211; CPI a indiqu&#233; avoir rachet&#233; Fulmar.
</p>
<p>Dans chacune de ces trois phrases, nous pouvons identifier un acheteur : CPI, une entreprise
achet&#233; : Fulmar, auxquelles peuvent s&#8217;ajouter des donn&#233;es sur le montant de la transaction, le
vendeur, la date de la transaction... Ce type d&#8217;applications a d&#233;j&#224; &#233;t&#233; d&#233;velopp&#233;, y compris pour
le fran&#231;ais (Poibeau, 2003). Notre but est ici de l&#8217;envisager avec un nouveau regard, en nous
focalisant sur des ressources s&#233;mantiquement riches. Plut&#244;t que de d&#233;velopper des ressources
de mani&#232;re ad hoc, nous cherchons &#224; caract&#233;riser l&#8217;int&#233;r&#234;t des donn&#233;es d&#233;j&#224; existantes pour le
fran&#231;ais.
</p>
<p>Les questions que nous nous sommes pos&#233; sont les suivantes :
&#8211; Quelles sont les informations qu&#8217;une ressource lexicale syntaxique doit encoder pour que
l&#8217;on puisse arriver &#224; un tel r&#233;sultat ?
</p>
<p>&#8211; Est-il possible, avec les ressources existantes, de cr&#233;er une telle ressource ?
&#8211; Quel r&#233;el int&#233;r&#234;t aurait une telle ressource (pr&#233;cision de l&#8217;extraction, rappel, automatisa-
tion...) ?
</p>
<p>Dans un premier temps, nous pr&#233;sentons un &#233;tat de l&#8217;art traitant des ressources lexicales syn-
taxique existantes. Dans une seconde partie, nous caract&#233;risons plus en d&#233;tail notre sujet d&#8217;&#233;tude
avant d&#8217;aborder, dans une troisi&#232;me partie, les exp&#233;riences r&#233;alis&#233;es. Nous pr&#233;sentons ensuite
les r&#233;sultats et leur analyse avant de poser, dans une derni&#232;re partie, les conclusions de notre
recherche.
</p>
<p>2 Choix d&#8217;une ressource
</p>
<p>L&#8217;anglais dispose aujourd&#8217;hui de trois ressources &#224; large couverture encodant d&#8217;une mani&#232;re
ou d&#8217;une autre la notion de sch&#233;ma pr&#233;dicatif : VerbNet, PropBank et FrameNet. Ces trois
ressources sont fond&#233;es sur des approches diff&#233;rentes : approche syntaxique pour VerbNet et
PropBank, et approche s&#233;mantique pour FrameNet (Pitel, 2006). De nombreuses applications
ont &#233;t&#233; d&#233;velopp&#233;es autour de FrameNet, comme la d&#233;sambigu&#239;sation s&#233;mantique (Fillmore &amp;
Baker, 2001), (Lowe et al., 1997), mais aussi l&#8217;extraction d&#8217;information. Des recherches ont &#233;t&#233;
men&#233;es pour utiliser conjointement ces trois ressources afin d&#8217;am&#233;liorer l&#8217;&#233;tiquetage s&#233;mantique
(Giuglea &amp; Moschitti, 2004).
</p>
<p>Il existe beaucoup moins de richesse pour le fran&#231;ais. Le Dictionnaire Explicatif et Combina-
toire (DEC, http://www.olst.umontreal.ca/decfr.html) d&#8217;I. Melc&#8217;u&#780;k a &#233;t&#233; ex-
clu car il n&#8217;offrait pas une couverture suffisante pour la t&#226;che. DicoValence
(http://bach.arts.kuleuven.be/dicovalence/) n&#8217;&#233;tait quant &#224; lui pas dispo-
nible au moment de l&#8217;&#233;tude mais m&#233;riterait sinon d&#8217;&#234;tre pris en consid&#233;ration. Nous nous
sommes alors focalis&#233;s sur deux ressources pour le fran&#231;ais : Volem et les tables du LADL.
Il s&#8217;agit dans cette partie d&#8217;expliquer le choix que nous avons fait concernant la ressource que
nous avons utilis&#233;e.
</p>
<p>348</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une ressource pr&#233;dicative pour l&#8217;extraction d&#8217;information
</p>
<p>2.1 Les Tables du LADL
</p>
<p>Les Tables du LADL, aussi connues sous le nom de lexique-grammaire, ont &#233;t&#233; &#233;tablies sous
la direction de Maurice Gross. Elles regroupent 6000 verbes r&#233;partis dans des tables construites
d&#8217;apr&#232;s des similitudes de comportement syntaxique. Chaque table du Lexique-Grammaire
contient un certain nombre de propri&#233;t&#233;s, qui sont valid&#233;es ou invalid&#233;es pour chacun des verbes
qui y figure (matrice de + et de -). Les propri&#233;t&#233;s encodent des informations sur (Gross, 1975) :
&#8211; Les r&#233;alisations possibles des arguments (restrictions de s&#233;lection : arguments &#224; trait &#171; hu-
</p>
<p>main &#187; ou &#171; non-humain &#187;, argument de type abstrait, objet...) ;
&#8211; Les propri&#233;t&#233;s syntaxiques du verbe ou de ses arguments (pronominalisation des verbes, in-
</p>
<p>troduction d&#8217;un argument par une pr&#233;position...)
&#8211; Les sous-cat&#233;gorisations alternatives ;
&#8211; Les possibilit&#233;s de redistributions (passif long, passif court...).
Les informations contenues dans les tables du LADL sont riches sur le plan syntaxique mais
relativement pauvres sur le plan s&#233;mantique. Les arguments ne sont typ&#233;s que par des restric-
tions de s&#233;lection (humain, non-humain, objet concret, abstrait...). Le format en
colonnes des tables et le fait que l&#8217;information soit r&#233;partie sur plusieurs colonnes rend les trai-
tements difficiles. Le fait que, selon les tables, les propri&#233;t&#233;s cod&#233;es dans les colonnes ne sont
pas toujours les m&#234;mes complique encore le traitement. Il est n&#233;cessaire d&#8217;effectuer un travail
important de transformation pour rendre ces tables exploitables directement par des applications
de TAL (Gardent et al., 2005).
</p>
<p>2.2 Volem
</p>
<p>Volem (Saint-Dizier et al., 2002) est une ressource multilingue (fran&#231;ais-espagnol-catalan). Les
entr&#233;es sont des verbes : la ressource d&#233;crit leur comportement syntaxique et s&#233;mantique &#224;
travers la description des arguments et des sch&#233;mas de sous-cat&#233;gorisation. Cette ressource
d&#233;crit &#224; l&#8217;heure actuelle 1700 verbes.
</p>
<p>FIG. 1 &#8211; L&#8217;entr&#233;e lexicale du verbe &#171; acheter &#187; dans Volem
</p>
<p>Cette ressource est fond&#233;e sur une liste de r&#244;les th&#233;matiques g&#233;n&#233;riques, mais assez pr&#233;cis. Les
diff&#233;rents r&#244;les th&#233;matiques peuvent &#234;tre combin&#233;s afin de d&#233;crire aux mieux les arguments
d&#8217;un verbe (cf. Figure 1).
</p>
<p>Les principaux inconv&#233;nients de cette ressource sont :
</p>
<p>349</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien BOSSARD
</p>
<p>&#8211; L&#8217;absence de gestion de la polys&#233;mie (les concepteurs de la ressource ont fait le choix de ne
coder qu&#8217;un sens par verbe, correspondant &#224; l&#8217;emploi le plus fr&#233;quent) ;
</p>
<p>&#8211; La faible couverture de la ressource (1700 verbes) ;
&#8211; L&#8217;absence de description pr&#233;cise des sch&#233;mas syntaxiques que repr&#233;sentent les diff&#233;rentes
</p>
<p>alternances utilis&#233;es dans Volem.
Volem a une couverture moindre que celle des tables du LADL. L&#8217;absence de gestion des r&#244;les
th&#233;matiques dans les tables du LADL constitue cependant un inconv&#233;nient de taille pour une
t&#226;che d&#8217;extraction d&#8217;information, qui demande plus pouss&#233;e sur la nature des arguments. Nous
avons donc choisi de concentrer notre &#233;tude sur la ressource lexicale Volem, qui para&#238;t avoir un
potentiel de description plus fort que les Tables du LADL pour notre application d&#8217;extraction.
</p>
<p>3 M&#233;thode d&#8217;enrichissement de la ressource
</p>
<p>Les informations contenues dans Volem n&#8217;&#233;taient pas suffisantes pour r&#233;aliser une t&#226;che d&#8217;ex-
traction d&#8217;information. Le format de Volem au format XML n&#8217;&#233;tait pas non plus directement
exploitable. Nous avons donc retravaill&#233; la ressource sur les points suivants afin de pouvoir
l&#8217;utiliser dans le cadre d&#8217;une t&#226;che d&#8217;extraction d&#8217;information :
</p>
<p>1. Codage de la ressource sous la forme d&#8217;une table de contraintes
</p>
<p>2. Ajout des informations manquantes
</p>
<p>3. Codage d&#8217;automates patrons
</p>
<p>3.1 Codage de la ressource sous la forme d&#8217;une table de contraintes
</p>
<p>Nous voulons, &#224; partir de Volem, cr&#233;er des automates d&#8217;extraction (format unitex : http://
www-igm.univ-mlv.fr/~unitex/). Pour cela, nous avons besoin d&#8217;une ressource cod&#233;e
&#224; l&#8217;aide d&#8217;un tableau. Nous avons donc cr&#233;&#233; un convertisseur pour passer du format de Volem
&#224; notre format. Nous utilisons une colonne par alternance de Volem, et validons l&#8217;alternance
pour un verbe en mettant un &#171; + &#187; dans la case correspondante, et un &#171; - &#187; sinon. Pour encoder
les informations sur les r&#244;les th&#233;matiques, nous &#233;crivons une colonne par argument du verbe (3
colonnes) et nous remplissons chacune d&#8217;elle avec la description enregistr&#233;e au sein de Volem du
r&#244;le th&#233;matique de l&#8217;argument. Ainsi, la ressource est directement exploitable par des graphes
unitex, qui exploitent les tables de contraintes.
</p>
<p>3.2 Ajout des informations manquantes
</p>
<p>Cependant, la ressource en l&#8217;&#233;tat n&#8217;encode toujours pas assez d&#8217;informations pour r&#233;aliser une
extraction d&#8217;information pr&#233;cise. En effet, il lui manque encore :
</p>
<p>1. les auxiliaires des verbes
</p>
<p>2. les diff&#233;rentes pr&#233;positions introduisant &#233;ventuellement un argument
</p>
<p>3. les noms associ&#233;s aux verbes (e.g. rachat pour racheter)
</p>
<p>4. les adjonctions essentielles &#224; une relation &#224; extraire.
</p>
<p>350</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une ressource pr&#233;dicative pour l&#8217;extraction d&#8217;information
</p>
<p>3.2.1 Les auxiliaires
</p>
<p>Deux possibilit&#233;s se sont offertes &#224; nous pour ajouter les auxiliaires d&#8217;un verbe &#224; la table de
donn&#233;es que nous avions construite. Soit r&#233;cup&#233;rer les auxiliaires depuis un dictionnaire, soit
identifier l&#8217;auxiliaire d&#8217;un verbe gr&#226;ce aux occurrences de celui-ci en corpus. Nous avons opt&#233;
pour la deuxi&#232;me solution. A partir de la table de donn&#233;es que nous avons cr&#233;&#233;e, un automate est
cr&#233;&#233; qui reconna&#238;t les diff&#233;rents verbes ainsi que les auxiliaires qui les accompagnent. Si l&#8217;auxi-
liaire &#171; avoir &#187; appara&#238;t au moins une fois dans le texte pour un verbe donn&#233;, un &#171; + &#187; est ajout&#233;
&#224; l&#8217;intersection de la ligne correspondant &#224; ce verbe et de la colonne correspondant &#224; l&#8217;auxiliaire
&#171; avoir &#187;. L&#8217;inconv&#233;nient de cette m&#233;thode est qu&#8217;elle demande des textes correctement &#233;crits.
Mais elle n&#8217;est pas d&#233;pendante d&#8217;une ressource comme l&#8217;aurait &#233;t&#233; la premi&#232;re : en effet, en
utilisant les tables du LADL comme r&#233;f&#233;rence, nous n&#8217;aurions pas pu ajouter automatiquement
certains verbes qui ne sont pas encod&#233;s dans la ressource. Nous avons proc&#233;d&#233; au rep&#233;rage des
auxiliaires avec la version &#171; brute &#187; des corpus que nous avons utilis&#233;s pour extraire les relations
de rachat d&#8217;entreprises (cf. &#167;4.1).
</p>
<p>3.2.2 L&#8217;ajout des pr&#233;positions
</p>
<p>Nous avons d&#233;j&#224; mentionn&#233; qu&#8217;une seule pr&#233;position est cod&#233;e par argument au sein de Volem,
alors que plusieurs pr&#233;positions peuvent appara&#238;tre pour certains verbes (acheter &#224; ou aupr&#232;s
de). Nous avons donc r&#233;alis&#233; un outil permettant d&#8217;ajouter &#224; la table de donn&#233;es les pr&#233;positions
qui introduisent les arguments d&#8217;un verbe. Cet outil n&#233;cessite une validation des r&#233;sultats par
l&#8217;utilisateur.
</p>
<p>Le syst&#232;me est fond&#233; sur une s&#233;rie d&#8217;automates &#171; &#224; trou &#187; : chaque &#171; trou &#187; correspond &#224; une
pr&#233;position possible introduisant un argument. Le syst&#232;me renvoie quelques erreurs (soit des
groupes de mots qui ne sont pas des pr&#233;positions, soit des pr&#233;positions rallong&#233;es de certains
mots qui les suivaient dans le texte). Apr&#232;s validation des r&#233;sultats par l&#8217;utilisateur, les pr&#233;po-
sitions valid&#233;es sont ajout&#233;es &#224; la table de donn&#233;es. Cet outil n&#233;cessite un corpus annot&#233; par
entit&#233;s nomm&#233;es. Nous avons travaill&#233; sur les corpus utilis&#233;s pour l&#8217;extraction de relations de
rachats d&#8217;entreprise (cf. &#167;4.1).
</p>
<p>3.2.3 Les adjonctions
</p>
<p>Volem ne g&#232;re que les arguments cl&#233; d&#8217;un verbe. Cependant, certains arguments qui ne sont
pas n&#233;cessaires d&#8217;un point de vue syntaxique jouent un r&#244;le extr&#234;mement important dans des
relations &#224; extraire. Par exemple, un achat selon Volem ne fait pas intervenir de montant : le
montant est quasiment toujours pr&#233;sent quand on se base sur l&#8217;analyse en corpus. C&#8217;est donc un
argument cl&#233;, s&#233;mantiquement parlant.
</p>
<p>L&#8217;approche d&#233;velopp&#233;e par les auteurs de FrameNet est du m&#234;me type (Fillmore &amp; Baker,
2001). La description des sch&#233;mas pr&#233;dicatifs au sein de cette ressource se fonde sur l&#8217;&#233;tude
en corpus des r&#233;alisation du verbe. Si un compl&#233;ment intervient fr&#233;quemment pour un verbe
donn&#233;, alors celui-ci sera assimil&#233; &#224; un argument, m&#234;me s&#8217;il est consid&#233;r&#233; comme un ajout dans
la grammaire traditionnelle.
</p>
<p>Nous avons alors tent&#233;, en d&#233;nombrant ces adjonctions au sein des corpus &#233;tudi&#233;s, de d&#233;terminer
quelles adjonctions essentielles pouvaient tenir lieu d&#8217;argument et dans quelle mesure celles-ci
</p>
<p>351</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien BOSSARD
</p>
<p>pouvaient &#234;tre rep&#233;r&#233;es par une analyse statistique. La m&#233;thode se fonde sur le rep&#233;rage et le
regroupement des compl&#233;ments circonstanciels (temps, lieu, montant...) pour chaque verbe au
sein du corpus.
</p>
<p>Apr&#232;s d&#233;nombrement des adjonctions, nous ne retenons que celles au-dessus d&#8217;un seuil de 10 %
(d&#233;fini manuellement). Cela signifie que nous ne s&#233;lectionnons que celles qui sont apparues
dans au moins 10 % des phrases contenant un verbe donn&#233;. Cette m&#233;thode nous a permis de
compl&#233;ter nos informations concernant les donn&#233;es &#224; extraire avec les adjonctions ad&#233;quates
pour 80 % des verbes s&#233;lectionn&#233;s (pour les 20 % restant, l&#8217;adjonction &#171;montant &#187; &#233;tait apparue
dans moins de 10 % des phrases &#224; extraire, contre 15 % pour l&#8217;adjonction &#171; date &#187;). Les r&#233;sultats
doivent toutefois &#234;tre valid&#233;s par un expert avant d&#8217;ajouter les adjonctions au sch&#233;ma argumental
des verbes concern&#233;s.
</p>
<p>3.3 Les automates patrons
</p>
<p>La derni&#232;re &#233;tape de l&#8217;enrichissement de la ressource a consist&#233; en la cr&#233;ation d&#8217;automates
patrons pour chacune des alternances list&#233;e dans Volem. Un automate patron est un automate
lexicalement vide, encodant une famille d&#8217;alternances ; il est instanci&#233; par l&#8217;ensemble des verbes
correspondant &#224; la famille d&#8217;alternances vis&#233;e. Pour cela, il a fallu dans un premier temps iden-
tifier les diff&#233;rentes formes de surface que pr&#233;sentent chacune des alternances de Volem, puis
r&#233;aliser pour chacune d&#8217;entre elles des graphes qui permettent de les reconna&#238;tre.
</p>
<p>La figure 2 (cf. derni&#232;re page de l&#8217;article) pr&#233;sente un extrait d&#8217;un graphe qui permet de recon-
na&#238;tre l&#8217;alternance caus_2np de Volem.
</p>
<p>Ces automates patrons prennent en entr&#233;e la ressource que nous avons cr&#233;&#233;e, et produisent en
sortie autant d&#8217;automates que d&#8217;alternances &#224; reconna&#238;tre pour chaque verbe. Les automates
ainsi cr&#233;&#233;s annotent un texte avec les informations que l&#8217;on veut extraire. En l&#8217;occurrence, pour
notre extraction sur les rachats d&#8217;entreprise, ils reconnaissent les fragments de textes correspon-
dant &#224; l&#8217;acheteur, au vendeur, &#224; l&#8217;&#233;l&#233;ment vendu, au montant et &#224; la date.
</p>
<p>4 Exp&#233;riences
</p>
<p>4.1 Donn&#233;es d&#8217;&#233;valuation
</p>
<p>Nous avons choisi de travailler sur une t&#226;che d&#8217;extraction pr&#233;cise : le rachat d&#8217;entreprises. Les
exp&#233;riences ont &#233;t&#233; men&#233;es sur plusieurs corpus :
&#8211; Un corpus tir&#233; d&#8217;un autre site sp&#233;cialis&#233; : FUSACQ (300ko, 25000 mots) (http://www.
fusacq.com)
</p>
<p>&#8211; Un corpus tir&#233; de diff&#233;rents journaux g&#233;n&#233;ralistes (400ko)
&#8211; Un corpus d&#8217;entra&#238;nement pour rep&#233;rer les entit&#233;s nomm&#233;es (200ko).
L&#8217;utilisation de plusieurs corpus permet d&#8217;&#233;valuer les performances en tenant compte (dans la
mesure du possible) du genre textuel. On ne trouve pas les m&#234;mes constructions ni les m&#234;mes
expressions suivant que l&#8217;on a affaire &#224; un corpus journalistique ou &#224; un site web. Nous ver-
rons dans la discussion que cette hypoth&#232;se se v&#233;rifie lors de l&#8217;&#233;tude des performances sur les
diff&#233;rents corpus.
</p>
<p>352</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une ressource pr&#233;dicative pour l&#8217;extraction d&#8217;information
</p>
<p>4.2 R&#233;sultats
</p>
<p>Nous avons mis en place deux protocoles d&#8217;&#233;valuation, afin d&#8217;isoler les &#233;ventuels probl&#232;mes ;
dans l&#8217;un, nous passons les r&#232;gles d&#8217;extraction sur un corpus dans lequel les entit&#233;s nomm&#233;es
ont &#233;t&#233; annot&#233;es gr&#226;ce &#224; un outil pour annoter d&#233;velopp&#233; au LIPN (TagEN,
http://www-lipn.univ-paris13.fr/~poibeau/tagen.html). Dans l&#8217;autre,
nous utilisons un corpus dans lequel nous avons annot&#233; toutes les entit&#233;s nomm&#233;es &#224; la main.
Nous pouvons ainsi proc&#233;der d&#8217;un c&#244;t&#233; &#224; une &#233;valuation &#171; en conditions r&#233;elles &#187;, et de l&#8217;autre,
de nous focaliser sur l&#8217;&#233;valuation des sch&#233;mas pr&#233;dicatifs, ind&#233;pendamment des erreurs dues &#224;
la mauvaise reconnaissance des entit&#233;s.
</p>
<p>Dans le tableau 1, nous entendons &#171; relations &#187; comme des structures grammaticales comportant
un verbe et ses arguments participant &#224; un rachat d&#8217;entreprise.
</p>
<p>Protocole 1 Protocole 2 Nombre total
de relations
</p>
<p>Nombre de relations 101 184 285
rep&#233;r&#233;es
% de relations 35 64 100
</p>
<p>TAB. 1 &#8211; Tableau des r&#233;sultats de l&#8217;extraction sur le corpus FUSACQ
</p>
<p>Un peu plus seulement de la moiti&#233; des entit&#233;s nomm&#233;es correspondant &#224; un acheteur potentiel
ou &#224; un vendeur potentiel ont &#233;t&#233; annot&#233;es. L&#8217;annotation des entit&#233;s nomm&#233;es n&#8217;a pas &#233;t&#233; men&#233;e
plus avant, &#233;tant donn&#233;e qu&#8217;elle n&#8217;est pas au centre de notre &#233;tude. Notre outil permet de rep&#233;rer
dans un texte dans lequel l&#8217;annotation des entit&#233;s nomm&#233;es est correcte, 65 % des relations
d&#8217;achat.
</p>
<p>35 % des relations restent tout de m&#234;me non rep&#233;r&#233;es. Ceci provient du fait que nous n&#8217;avons
pas g&#233;r&#233; certains sch&#233;mas syntaxiques :
&#8211; les subordonn&#233;es relatives
&#8211; les verbes introducteurs pr&#233;c&#233;d&#233;s d&#8217;un verbe marquant soit le pass&#233;, soit le futur (ambigu&#239;t&#233;
s&#233;mantique possible. Ex. : &#171; Bull vient d&#8217;annoncer le rachat de CP8 &#224; Schlumberger &#187;)
</p>
<p>&#8211; les structures complexes (ex. :&#171;COMPANY1 s&#8217;&#233;tait diversifi&#233; &#224; travers l&#8217;acquisition de COM-
PANY2 &#187;
</p>
<p>&#8211; L&#8217;alternance passive sans groupe pr&#233;positionnel (non encod&#233; dans Volem pour les verbes qui
nous int&#233;ressent. Ex. : &#171; COMPANY a &#233;t&#233; rachet&#233; &#187;)
</p>
<p>&#8211; Les structures faisant intervenir un pronom (pas de r&#233;solution d&#8217;anaphores).
L&#8217;outil de rep&#233;rage des pr&#233;positions renvoie des r&#233;sultats bruit&#233;s &#224; hauteur de 8 %.
</p>
<p>Les adjonctions n&#233;cessaires &#224; une t&#226;che d&#8217;extraction sont la date et le montant de la transaction.
Les corpus sur lesquels nous avons fait nos exp&#233;riences ont montr&#233; ce point, m&#234;me s&#8217;ils sont de
taille trop faible pour donner des chiffres significatifs statistiquement.
</p>
<p>4.3 Discussion
</p>
<p>Nous avons vu que Volem est incomplet du fait qu&#8217;il ne g&#232;re pas la polys&#233;mie et que toutes les
alternances n&#8217;y sont pas cod&#233;es.
</p>
<p>Est-il possible de rajouter aux entr&#233;es de Volem les alternances que cette ressource n&#8217;encode
</p>
<p>353</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien BOSSARD
</p>
<p>Verbe Alternances nombre d&#8217;occurrences nombre d&#8217;occurrences
de l&#8217;alternance de l&#8217;alternance
(FUSACQ) (Corpus g&#233;n&#233;ral)
</p>
<p>racheter caus_2np 37 16
caus_2np_pp 6 12
pas_etre_part_np_pp 6 12
</p>
<p>revendre caus_2np 1 0
acheter caus_refl_pr_np 2 0
</p>
<p>caus_2np 0 16
vendre pas_etre_part_np_2pp 2 0
</p>
<p>caus_2np 2 0
caus_2np_pp 2 0
</p>
<p>acqu&#233;rir caus_2np 44 0
caus_2np_pp 1 4
pas_etre_part_np_pp 0 16
</p>
<p>c&#233;der caus_2np_pp 24 4
caus_2np 9 0
pas_etre_part_np_2pp 2 8
</p>
<p>fusionner aucune occurrence 0 0
d&#233;tenir caus_2np 5 0
</p>
<p>pas_etre_part_np_pp 1 12
offrir caus_2np_pp 1 16
</p>
<p>caus_2np 1 0
reprendre pas_etre_part_np_pp 11 16
</p>
<p>caus_2np 12 8
</p>
<p>TAB. 2 &#8211; R&#233;partition des alternances selon les verbes dans les phrases extraites des corpus
(FUSACQ annot&#233; et extrait du corpus g&#233;n&#233;ral)
</p>
<p>pas ? L&#8217;ajout des alternances constitue un r&#233;el probl&#232;me. En effet, il est possible, par des m&#233;-
thodes statistiques, de s&#233;lectionner des sch&#233;mas de sous-cat&#233;gorisation acceptables pour un
verbe (Salmon-Alt &amp; Chesley, 2005),(Briscoe &amp; Carroll, 1997). Mais la s&#233;lection d&#8217;alternances
acceptables constitue un tout autre probl&#232;me ; il faut en effet pouvoir distinguer une phrase du
type : &#171; COMPANY1 a achet&#233; une usine &#224; LIEU. &#187; d&#8217;une phrase du type : &#171; COMPANY1 a
achet&#233; des terrains &#224; LIEU{la ville de LIEU}. Ce probl&#232;me m&#233;riterait une &#233;tude approfondie.
</p>
<p>Un point int&#233;ressant est la variation dans l&#8217;usage du verbe suivant le corpus. On s&#8217;aper&#231;oit,
m&#234;me sur des corpus de taille modeste, des variations d&#8217;usage, une alternance &#233;tant plut&#244;t em-
ploy&#233;e dans un corpus, une autre dans un autre corpus (cf. tableau2). Nous faisons l&#8217;hypoth&#232;se
qu&#8217;il s&#8217;agit de variations dans le style d&#8217;&#233;criture propre aux diff&#233;rents genres textuels. Ainsi,
l&#8217;alternance &#171; caus_2np &#187; du verbe &#171; d&#233;tenir &#187; constitue 78 % des variations syntaxiques pour le
verbe &#171; d&#233;tenir &#187; dans le corpus FirstInvest, et 80 % dans FUSACQ, mais n&#8217;appara&#238;t pas dans le
corpus tir&#233; de journaux non sp&#233;cialis&#233;s.
</p>
<p>Les r&#233;sultats obtenus sont satisfaisants. En effet, l&#8217;ajout des structures syntaxiques manquantes
(cf. &#167;4.2) permettrait d&#8217;obtenir environ 65 % de rappel sur une t&#226;che d&#8217;extraction des rachats
d&#8217;entreprise, soit 15 % de moins que le rappel obtenu par Thierry Poibeau, sur la m&#234;me t&#226;che
et le m&#234;me type de corpus (Poibeau, 2003), mais en utilisant une m&#233;thode &#224; base de ressources
qui se distingue des autres travaux par une certaine g&#233;n&#233;ricit&#233;.
</p>
<p>5 Conclusion et Perspectives
</p>
<p>Les ressources pour le fran&#231;ais sont beaucoup moins compl&#232;tes que celles pour l&#8217;anglais. La
ressource pour le fran&#231;ais qui nous a sembl&#233; la plus adapt&#233;e &#224; l&#8217;extraction d&#8217;information (Vo-
lem), pr&#233;sente des manques (non gestion de la polys&#233;mie, couverture faible, alternances non
encod&#233;es...) qu&#8217;il est cependant possible de combler par des m&#233;thodes semi-automatiques.
</p>
<p>354</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une ressource pr&#233;dicative pour l&#8217;extraction d&#8217;information
</p>
<p>Les r&#233;sultats obtenus pour une t&#226;che d&#8217;extraction pour l&#8217;anglais (Giuglea &amp; Moschitti, 2004)
montre que l&#8217;extraction &#224; base de ressources &#224; large couverture permet d&#8217;obtenir de bons r&#233;-
sultats et &#233;vite de red&#233;velopper de mani&#232;re ad hoc des connaissances pour chaque nouvelle
application.
</p>
<p>Il reste certes un travail &#224; r&#233;aliser d&#233;pendant de l&#8217;application (ajout d&#8217;adjonctions, pr&#233;posi-
tions), cependant la mise en place d&#8217;une m&#233;thode utilisant des ressources ext&#233;rieures permet
une r&#233;utilisabilit&#233; a contrario des m&#233;thodes purement ad hoc tout en garantissant malgr&#233; tout
une couverture et une certaine g&#233;n&#233;ricit&#233;.
</p>
<p>Cet article a cherch&#233; &#224; montrer comment compl&#233;ter Volem, notamment avec les pr&#233;positions et
le filtrage des alternances non pertinentes pour un sens donn&#233;. Il reste &#224; d&#233;finir une m&#233;thode
semi-automatique pour l&#8217;ajout des alternances non r&#233;f&#233;renc&#233;es par Volem.
</p>
<p>R&#233;f&#233;rences
BRISCOE T. &amp; CARROLL J. (1997). Automatic extraction of subcategorization from corpora.
FILLMORE C. &amp; BAKER C. (2001). Frame semantics for text understanding. InWordNet and
Other Lexical Resources Workshop, NAACL, Pittsburgh.
GARDENT C., GUILLAUME B., FALK I. &amp; PERRIER G. (2005). Le lexique-grammaire de m.
gross et le traitement automatique des langues.
GIUGLEA A.-M. &amp; MOSCHITTI A. (2004). Knowledge discovering using framenet, verbnet
and propbank. In International Workshop on Mining for and from the Semantic Web, Seattle,
USA.
GROSS M. (1975). M&#233;thodes en syntaxe. Paris : Hermann.
LOWE J., BAKER C. &amp; FILLMORE C. (1997). A frame-semantic approach to semantic anno-
tation.
PITEL G. (2006). Framenet, th&#233;orie, produit, processus, multilingualit&#233; et connexions. In
Autour de FrameNet et de la S&#233;mantique Lexicale Multilingue : projets en cours et points de
contacts entre les diff&#233;rentes approches. date de la conf&#233;rence : 28 F&#233;vrier 2006.
POIBEAU T. (2003). Extraction automatique d&#8217;information, du texte brut au web s&#233;mantique.
Paris : Hermes.
SAINT-DIZIER P., FERNANDEZ A., VAZQUEZ G., KAMEL M. &amp; BENAMARA F. (2002).
The Volem Project : a Framework for the Construction of Advanced Multilingual Lexicons .
In Language Technology 2002 , Hyderabad, , p. 123&#8211;142 : Springer Verlag, Lecture Notes.
Dates de conf&#233;rence : d&#233;cembre 2002.
SALMON-ALT S. &amp; CHESLEY P. (2005). Le filtrage probabiliste dans l&#8217;extraction automa-
tique de cadres de sous-cat&#233;gorisation. In Journ&#233;e ATTALA du 12/03/2005.
</p>
<p>355</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien BOSSARD
</p>
<p>FIG. 2 &#8211; Exemple d&#8217;un automate patron
</p>
<p>356</p>

</div></div>
</body></html>