<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>R&#233;solution anaphorique int&#233;gr&#233;e &#224; une analyse automatique de discours d&#8217;un corpus oral retranscrit</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>R&#233;solution anaphorique int&#233;gr&#233;e &#224; une analyse automatique
de discours d&#8217;un corpus oral retranscrit
</p>
<p>Alain R&#201;GNIER
LPL CNRS, Universit&#233; de Provence,
</p>
<p>29 Avenue R. Schuman 13621 Aix-en-Provence
alain.regnier@lpl.univ-aix.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons une r&#233;solution anaphorique int&#233;gr&#233;e &#224; une analyse automatique
de discours. Cette &#233;tude traite des anaphores pronominales et des anaphores z&#233;ro. Notre analyse
est bas&#233;e sur trois approches : une analyse bas&#233;e sur les contraintes, une analyse fonctionnelle et
une analyse dynamique. Pour &#233;valuer la faisabilit&#233; et la fiabilit&#233; de notre approche, nous l&#8217;avons
exp&#233;riment&#233;e sur un corpus de 97 histoires produites &#224; l&#8217;oral par des enfants. Nous pr&#233;sentons
le r&#233;sultat de cette &#233;valuation.
</p>
<p>Abstract. We present an anaphora resolution integrated in a discourse analysis. This study
deals with pronoun anaphora and zero anaphora. Our analysis is based on three approaches. A
constraint based rule analysis, a functional approach and a dynamic analysis. In order to evaluate
the feasibility of our approach and its reliability we have experimented with a corpus of 97
speech stories produced by children. We present here the results of our evaluation experiment.
</p>
<p>Mots-cl&#233;s : analyse de discours, r&#233;solution anaphorique, anaphore pronominales, ana-
phores z&#233;ro, grammaires de propri&#233;t&#233;s, grammaire fonctionnelle, analyse dynamique, discours
oral.
</p>
<p>Keywords: discourse analysis, anaphora resolution, pronoun anaphora, zero anaphora,
property grammars, functional grammar, dynamic analysis, speech discourse.
</p>
<p>1 Introduction
</p>
<p>Nous traitons d&#8217;une r&#233;solution anaphorique int&#233;gr&#233;e au sein des autres traitements linguistiques.
Plus g&#233;n&#233;ralement nous essayons d&#8217;int&#233;grer au mieux les diff&#233;rentes analyses linguistiques au
sein de l&#8217;analyse de discours. Cette r&#233;solution anaphorique s&#8217;inscrit dans un projet de r&#233;alisa-
tion d&#8217;un analyseur de discours pour classification automatique de textes (Nouali et al., 2005).
Pour r&#233;aliser cet analyseur, nous sommes confront&#233; &#224; la n&#233;cessit&#233; de r&#233;soudre certaines ana-
phores. Il s&#8217;agit des anaphores pronominales sujet et objet mais aussi des anaphores z&#233;ro. Notre
pr&#233;sentation du projet met en exergue l&#8217;application des m&#234;mes principes pour chaque niveau
de l&#8217;analyse linguistique. Ces principes sont l&#8217;application de contraintes, une approche dyna-
mique et la hi&#233;rarchisation de fonctions s&#233;mantiques, syntaxiques et pragmatiques. Dans un
premier temps nous pr&#233;sentons l&#8217;application de ces principes pour le d&#233;coupage en chunks et
leurs rattachements, ainsi que pour l&#8217;assignation des fonctions, ensuite nous aborderons l&#8217;ana-
lyse anaphorique et les r&#233;sultats obtenus.
</p>
<p>417</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain R&#201;GNIER
</p>
<p>Les sections vont s&#8217;articuler de la fa&#231;on suivante. La section 2 d&#233;gage les propositions sur
lesquelles nous avons ax&#233; notre analyse du discours. La section 3 d&#233;crit le fonctionnement de
l&#8217;analyseur en pr&#233;sentant les trois types de mise &#224; jour actuellement impl&#233;ment&#233;e. La section 4
pr&#233;sente l&#8217;analyse utilis&#233;e pour la r&#233;solution des anaphores pronominales et des anaphores z&#233;ro.
La section 5 pr&#233;sente les r&#233;sultats.
</p>
<p>2 Proposition
</p>
<p>L&#8217;analyse que nous proposons est &#224; la crois&#233;e de trois types d&#8217;approche. C&#8217;est une approche
par contraintes et nous utilisons le paradigme des Grammaires de Propri&#233;t&#233;s tel qu&#8217;il est d&#233;crit
dans (Blache, 2001). Nous utilisons aussi l&#8217;apport des constructions au sein des Grammaires
de Propri&#233;t&#233;s (Blache, 2005). C&#8217;est aussi une approche fonctionnelle pour la place importante
que nous accordons aux fonctions. Nous nous r&#233;f&#233;rons pour cela &#224; la Grammaire Fonctionnelle
de S. C. Dik (Dik, 1997). C&#8217;est une analyse de discours dynamique pour, &#224; terme, &#234;tre &#224; m&#234;me
d&#8217;int&#233;grer facilement des inf&#233;rences s&#233;mantiques comme la SDRT le propose (Asher, 1993).
</p>
<p>Nous appliquons les m&#234;mes principes de contraintes, les principes fonctionnels et les prin-
cipes de l&#8217;analyse dynamique pour tous les niveaux des traitements linguistiques. De ce fait, &#224;
chaque niveau, on applique des contraintes comme les contraintes de lin&#233;arit&#233; par exemple. On
observe aussi un ordre prioritaire de fonctions. Ces fonctions sont les fonctions s&#233;mantiques,
syntaxiques et pragmatiques d&#233;finies en Grammaire Fonctionnelle. L&#8217;analyse est incr&#233;mentale,
le contexte s&#233;lectionne les contraintes que l&#8217;on applique et chaque entit&#233; nouvelle tente de s&#8217;in-
t&#233;grer &#224; la structure pr&#233;c&#233;demment cr&#233;&#233;e.
</p>
<p>3 L&#8217;analyseur
</p>
<p>L&#8217;analyseur de discours a &#233;t&#233; impl&#233;ment&#233; en O&#8217;CAML par Gilles R&#233;gnier selon les sp&#233;cifica-
tions que nous avons &#233;tablies. Il construit une repr&#233;sentation du discours au moyen de trois types
de mise &#224; jour. La premi&#232;re mise &#224; jour construit les segments de texte qui correspondent aux
chunks d&#8217;un chunk parser. La deuxi&#232;me concerne les rattachements des chunks entre eux. Cette
mise &#224; jour leur attribue de fait un r&#244;le. La troisi&#232;me est une mise &#224; jour fonctionnelle. Elle met
&#224; jour les fonctions s&#233;mantiques, une fonction syntaxique et des fonctions pragmatiques. Apr&#232;s
ces mises &#224; jour une phase de filtrage appel&#233;e inhibition est activ&#233;e pour limiter les effets de
l&#8217;explosion combinatoire des interpr&#233;tations propos&#233;es.
</p>
<p>Le lexique utilis&#233; est le lexique du Laboratoire Parole et Langage d&#8217;Aix-en-Provence que l&#8217;on a
enrichi d&#8217;informations s&#233;mantiques comme la structure des pr&#233;dicats, des restrictions de s&#233;lec-
tion, et des indications sur la classe s&#233;mantique &#224; laquelle appartient l&#8217;item lexical.
</p>
<p>3.1 La mise &#224; jour des chunks
</p>
<p>La fronti&#232;re des constituants est d&#233;termin&#233;e par l&#8217;&#233;valuation de chaque fronti&#232;re de mot. Chaque
mot entrant est &#233;valu&#233; et attribue un score sur sa fronti&#232;re gauche et/ou sa fronti&#232;re droite. Il
peut aussi appara&#238;tre dans un contexte sp&#233;cifique et &#234;tre int&#233;gr&#233; &#224; une construction qui modifie
ces scores. La r&#232;gle 1 est un exemple extr&#234;mement simplifi&#233; de hi&#233;rarchie pour la fronti&#232;re
</p>
<p>418</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution anaphorique int&#233;gr&#233;e &#224; l&#8217;analyse de discours d&#8217;un corpus oral
</p>
<p>gauche d&#8217;un syntagme nominal donn&#233; &#224; titre d&#8217;illustration. Celui-ci indique que les &#233;l&#233;ments
les plus susceptibles d&#8217;ouvrir un syntagme nominal sur leur gauche, sont par ordre d&#233;croissant,
un d&#233;terminant puis un adjectif cardinal puis un adjectif ordinal puis un nom.
</p>
<p>(1) Det &gt; Card &gt; Ord &gt; N
</p>
<p>L&#8217;analyse est dynamique. La d&#233;termination des fronti&#232;res des chunks constitue des contextes.
Les contraintes sont appliqu&#233;es en fonction des contextes ainsi cr&#233;&#233;s. Par exemple les
contraintes de lin&#233;arit&#233; sont diff&#233;rentes en fonction du type de chunk sur lesquelles on les ap-
plique. Si l&#8217;on est au sein d&#8217;un syntagme nominal, les contraintes de lin&#233;arit&#233; sp&#233;cifiques au
syntagme nominal sont appliqu&#233;es.
</p>
<p>3.2 La mise &#224; jour des rattachements
</p>
<p>La mise &#224; jour des rattachements relie les diff&#233;rents chunks entre eux. Lorsqu&#8217;un chunk est
constitu&#233;, l&#8217;analyseur essaie de le rattacher &#224; la structure. L&#8217;attachement est &#233;tabli selon un ordre
de priorit&#233; bas&#233; sur les fonctions linguistiques qui accorde une pr&#233;f&#233;rence sur certaines struc-
tures. Pour la lin&#233;arit&#233; des fonctions des arguments du verbe par exemple, l&#8217;ordre de pr&#233;f&#233;rence
indique que le sujet pr&#233;c&#232;de (sauf cas particuliers) les compl&#233;ments du verbe.
</p>
<p>L&#8217;approche est dynamique. Chaque mise &#224; jour r&#233;&#233;value l&#8217;ensemble des rattachements de la
repr&#233;sentation du ou des pr&#233;dicats en cours. Cependant seules certaines positions de la structure
restent ouvertes au rattachement. Par exemple un pronom sujet qui pr&#233;c&#232;de un verbe verrouille
le point de rattachement de la position sujet de ce verbe. La r&#233;&#233;valuation des rattachements
s&#8217;op&#232;re donc sur une structure qui est partiellement constitu&#233;e.
</p>
<p>On observe des contraintes sur la structure comme par exemple la contrainte de projectivit&#233; (les
arcs des rattachements ne peuvent se croiser). On applique aussi des contraintes syntaxiques sur
la ou les pr&#233;positions qui peuvent introduire la sous-cat&#233;gorisation.
</p>
<p>3.3 La mise &#224; jour des fonctions
</p>
<p>La mise &#224; jour des fonctions assigne &#224; certains termes les fonctions de la Grammaire Fonction-
nelle. La fonction syntaxique sujet et les fonctions pragmatiques Th&#232;me, Topique et Focus sont
centrales pour notre r&#233;solution anaphorique comme nous le verrons en section 4.
</p>
<p>Les fonctions s&#233;mantiques assignent par exemple les r&#244;les d&#8217;agent, de patient aux arguments
des pr&#233;dicats.
</p>
<p>La mise &#224; jour des fonctions syntaxiques ne concerne pour le fran&#231;ais, conform&#233;ment &#224; la Gram-
maire Fonctionnelle de S. C. Dik, que la fonction sujet. Cette assignation est utilis&#233;e lors des
rattachements. La fonction Sujet est aussi mise &#224; contribution pour la r&#233;solution des anaphores
z&#233;ro et des anaphores pronominales.
</p>
<p>La mise &#224; jour des fonctions pragmatiques assigne les fonctions de Topique, de Focus et de
Th&#232;me de la Grammaire Fonctionnelle. La fonction pragmatique Th&#232;me est assign&#233;e au syn-
tagme nominal des extractions &#224; gauche. La fonction pragmatique Focus est assign&#233;e au syn-
tagme nominal ou pr&#233;positionnel d&#8217;une construction cliv&#233;e.
</p>
<p>419</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain R&#201;GNIER
</p>
<p>Pr&#233;sentatif Voici ...
Information
</p>
<p>PRAG
</p>
<p>&#63726;&#63728;OPERATEUR DECLFONCTIONS[TOPIQUE 1 ]
ACTE-P Presenter
</p>
<p>&#63737;&#63739;
SEM
</p>
<p>[
PREDE1
</p>
<p>[
VOICI
1
</p>
<p>]]
</p>
<p>SYNT
</p>
<p>[
P
</p>
<p>[
V Voici
SN 1
</p>
<p>]]
Propri&#233;t&#233;s Const = { V[voici], SN1 }
</p>
<p>Lin : V &#8826; SN1
Unic = {SN1}
V&#8658; SN1
</p>
<p>FIG. 1 &#8211; Construction du pr&#233;sentatif Voici ...
</p>
<p>La fonction pragmatique Topique est assign&#233;e de fa&#231;on tr&#232;s diverse. Elle peut &#234;tre d&#233;termin&#233;e au
moyen de constructions particuli&#232;res. La figure 1 repr&#233;sente la construction Voici qui s&#8217;applique
sur des phrases comme l&#8217;exemple 2.
</p>
<p>(2) Voici un ver.
</p>
<p>Lorsque les propri&#233;t&#233;s d&#233;finies dans l&#8217;ensemble des propri&#233;t&#233;s sont satisfaites, les informations
associ&#233;es de la construction sont propag&#233;es dans la structure. On peut observer que les infor-
mations pragmatiques de cette construction assignent la fonction de Topique &#224; un argument du
verbe Voici. Celui-ci est un syntagme nominal pr&#233;c&#233;d&#233; par Voici. La r&#233;solution anaphorique que
nous proposons utilise ce type d&#8217;information pragmatique.
</p>
<p>La fonction Topique peut aussi &#234;tre assign&#233;e au syntagme nominal t&#234;te d&#8217;une phrase nominale.
Dans la majeure partie des cas, en l&#8217;absence de construction particuli&#232;re, elle est assign&#233;e au
syntagme auquel est assign&#233;e la fonction syntaxique Sujet.
</p>
<p>3.4 La phase d&#8217;inhibition et la sortie de l&#8217;analyseur
</p>
<p>Au fur et &#224; mesure de la construction des &#233;l&#233;ments et de l&#8217;application des contraintes une &#233;va-
luation de la structure est faite. Deux types d&#8217;&#233;valuation sont utilis&#233;s. Le premier concerne la
lin&#233;arit&#233; et le deuxi&#232;me concerne le nombre de rattachements. Ces &#233;valuations sont ind&#233;pen-
dantes. Une interpr&#233;tation est &#233;limin&#233;e lorsque la diff&#233;rence entre son score et celui de l&#8217;inter-
pr&#233;tation la mieux &#233;valu&#233;e d&#233;passe un seuil fix&#233;. Cette &#233;valuation permet d&#8217;&#233;liminer en cours
d&#8217;analyse les interpr&#233;tations que l&#8217;on estime les moins coh&#233;rentes.
</p>
<p>Pour observer les r&#233;sultats de l&#8217;analyseur un ensemble d&#8217;informations est extrait des objets
construits et exprim&#233; dans un graphe orient&#233;. La figure 2 est une visualisation d&#8217;un graphe issu
d&#8217;un des segments de texte de notre corpus. Les num&#233;ros qui pr&#233;c&#232;dent chaque extrait de texte
indiquent l&#8217;ordre d&#8217;apparition dans le segment de texte. Les chunks verbaux sont repr&#233;sent&#233;s
par des rectangles. Les conjonctions de coordination sont repr&#233;sent&#233;es par des triangles. Les
ellipses repr&#233;sentent les syntagmes nominaux et les syntagmes pr&#233;positionnels. Le cercle re-
pr&#233;sente certains adverbes (comme ceux de lieu et temps) identifi&#233;s comme satellite (selon la
terminologie de la Grammaire Fonctionnelle). L&#8217;&#233;l&#233;ment t&#234;te de chaque chunk est repr&#233;sent&#233;
entre crochets.
</p>
<p>420</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution anaphorique int&#233;gr&#233;e &#224; l&#8217;analyse de discours d&#8217;un corpus oral
</p>
<p>0:  la [ dame ] 
</p>
<p>1:  [ enleva ] 
</p>
<p>arg1
</p>
<p>2:  l' [ escargot ] 
</p>
<p>arg2
</p>
<p>3:  [ et ] 
</p>
<p>4:  le [ jeta ] arg2
</p>
<p> suj_prec : dame
</p>
<p>arg1
</p>
<p>5:  [ dehors ] 
</p>
<p>espace
</p>
<p>FIG. 2 &#8211; Sortie d&#8217;une interpr&#233;tation de la phrase La dame enleva l&#8217;escargot et le jeta dehors
</p>
<p>4 La r&#233;solution anaphorique
</p>
<p>La r&#233;solution anaphorique concerne deux types d&#8217;anaphore : les anaphores pronominales et les
anaphores z&#233;ro. Des &#233;tudes (dont (Ide &amp; Cristea, 2000)) ont montr&#233; des relations entre la struc-
ture du discours (notamment RST, th&#233;orie des veines) et la r&#233;solution anaphorique. La structure
de discours contraint l&#8217;accessibilit&#233; des r&#233;f&#233;rents. Or l&#8217;analyseur ne fournit pas beaucoup d&#8217;in-
formations sur la structure rh&#233;torique du discours. (Tetreault &amp; Allen, 2004) ont men&#233; une ex-
p&#233;rience sur un corpus de dialogues dont la structure de discours a &#233;t&#233; annot&#233;e. Ils en concluent
que la prise en compte de la structure du discours n&#8217;apporte pas statistiquement d&#8217;am&#233;liorations
significatives. La structure de discours n&#8217;&#233;tant que partiellement r&#233;alis&#233;e par notre analyseur,
cela ne devrait pas g&#233;n&#233;rer un impact important sur nos r&#233;sultats.
</p>
<p>4.1 Les relations anaphoriques pronominales
</p>
<p>Les anaphores pronominales trait&#233;es sont restreintes aux pronoms clitiques de la troisi&#232;me per-
sonne ; il, elle, ils, elles en tant que pronom sujet et le, la, lui, les, leur en tant que pronom
pr&#233;verbal compl&#233;ment. La r&#233;solution ne concerne pas les anaphores abstraites (Amsili et al.,
2006).
</p>
<p>Pour r&#233;soudre ces anaphores, on a utilis&#233; les principes de la th&#233;orie du centrage (Grosz et al.,
1995). Cette th&#233;orie d&#233;crit le fonctionnement de la structure attentionnelle du discours qui
contribue &#224; la coh&#233;rence discursive. Il s&#8217;agit de la mise en correspondance de deux ordres de
centres attentionnels : les centres anticipateurs et les centres r&#233;trospectifs. Lorsque deux &#233;non-
c&#233;s se succ&#232;dent le premier &#233;nonc&#233; contient des centres attentionnels ordonn&#233;s du plus saillant
au moins saillant. Les centres r&#233;trospectifs vont se connecter sur les centres anticipateurs et
ce plus favorablement vers les plus saillants. Les centres r&#233;trospectifs les plus &#224; m&#234;me de se
connecter sur les centres anticipateurs sont les pronoms anaphoriques. La th&#233;orie du centrage
&#233;nonce des r&#232;gles pour ordonner les centres attentionnels de sorte &#224; pouvoir les apparier.
</p>
<p>Dans notre cas, la hi&#233;rarchie des ant&#233;c&#233;dents est bas&#233;e sur les fonctions pragmatiques de la
grammaire fonctionnelle (Dik, 1997) Part 1, Chap.13, pp309&#8211;338. L&#8217;ordre utilis&#233; est donn&#233;
dans l&#8217;exemple 3. Cette hi&#233;rarchie indique que l&#8217;&#233;l&#233;ment auquel on a assign&#233; la fonction Th&#232;me
est prioritaire sur un &#233;l&#233;ment auquel on a assign&#233; la fonction Focus. Ce dernier est prioritaire sur
un &#233;l&#233;ment auquel on a assign&#233; la fonction Topique. Les autres arguments sont ordonn&#233;s selon
</p>
<p>421</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain R&#201;GNIER
</p>
<p>leur ordre d&#8217;apparition dans la phrase.
</p>
<p>(3) Fonction Th&#232;me &gt; Fonction Focus &gt; Fonction Topique &gt; autres arguments
</p>
<p>Les diff&#233;rentes fonctions sont identifi&#233;es par les constructions sp&#233;cifiques comme indiqu&#233; dans
la partie 3.3. L&#8217;identification d&#8217;une construction sp&#233;cifique comme l&#8217;extraction &#224; gauche permet
d&#8217;assigner la fonction Th&#232;me. La fonction Focus est identifi&#233;e gr&#226;ce aux constructions cliv&#233;es.
La fonction Topique est identifi&#233;e par des constructions diverses comme Il &#233;tait une fois ..., il y
a ..., c&#8217;est un ....
</p>
<p>Les centres r&#233;trospectifs qui nous int&#233;ressent sont les pronoms. Nous traitons deux types de
pronoms. Les pronoms sujet et les pronoms objet. Ces deux types de pronoms sont ordonn&#233;s
dans le cas o&#249; les deux types sont en pr&#233;sence simultan&#233;ment dans le m&#234;me &#233;nonc&#233;. Comme la
r&#232;gle 4 l&#8217;indique, nous favorisons les pronoms sujet que nous affectons en priorit&#233; &#224; l&#8217;ant&#233;c&#233;dent
le plus saillant.
</p>
<p>(4) pronoms sujet &gt; pronoms compl&#233;ment
</p>
<p>Dans la th&#233;orie du centrage, la coh&#233;rence est locale et les r&#232;gles ne s&#8217;appliquent que sur deux
phrases cons&#233;cutives. (Alshawi, 1987) propose un ordre de saillance au moyen de pond&#233;rations.
Ceci permet d&#8217;&#233;tendre les rapports entre pronoms et ant&#233;c&#233;dents sur plusieurs phrases. Chaque
apparition d&#8217;un r&#233;f&#233;rent de discours ajoute un nombre de points qui varie selon la position de ce
r&#233;f&#233;rent dans la phrase. Ce capital de points associ&#233; au r&#233;f&#233;rent diminue au fur et &#224; mesure des
phrases s&#8217;il n&#8217;est pas cit&#233;. Une illustration de ce type de pond&#233;ration est pr&#233;sent&#233;e dans (Lappin
&amp; Leass, 1994) et pour le fran&#231;ais dans (Victorri, 2005).
</p>
<p>Nous appliquons une m&#233;thode mixte qui d&#8217;une part utilise une hi&#233;rarchie attentionnelle entre
les &#233;nonc&#233;s successifs et qui d&#8217;autre part pond&#232;re les r&#233;f&#233;rents du discours sur des empans plus
larges que deux phrases successives. Nous m&#233;morisons dans une pile les r&#233;f&#233;rents du discours
selon un ordre de saillance d&#233;pendant de leur occurrence dans le discours. Cependant notre
pond&#233;ration ne d&#233;pend pas de l&#8217;&#233;tiquette syntaxique des &#233;l&#233;ments comme pour (Lappin &amp; Leass,
1994). Elle d&#233;pend de l&#8217;ordre de saillance dans chaque &#233;nonc&#233;. L&#8217;&#233;l&#233;ment le plus saillant d&#8217;un
&#233;nonc&#233; re&#231;oit toujours la m&#234;me pond&#233;ration quelle que soit sa position syntaxique. De plus notre
pond&#233;ration comprend des exceptions. Comme nous allons le voir plus loin, la fonction Th&#232;me
manipule directement la hi&#233;rarchie des r&#233;f&#233;rents. De m&#234;me une analogie structurelle entre deux
&#233;nonc&#233;s successifs favorise la cor&#233;f&#233;rence. Enfin nous accordons une pond&#233;ration plus forte
pour les r&#233;f&#233;rents qui apparaissent sous forme de pronom car c&#8217;est l&#8217;indice d&#8217;un ancrage plus
fort dans le discours.
</p>
<p>Nous avons utilis&#233; la pond&#233;ration suivante. Pour chaque &#233;nonc&#233;, le premier &#233;l&#233;ment de l&#8217;ordre
des ant&#233;c&#233;dents re&#231;oit 100 points et 120 s&#8217;il s&#8217;agit d&#8217;un pronom. Le deuxi&#232;me &#233;l&#233;ment re&#231;oit 50
points et 60 s&#8217;il s&#8217;agit d&#8217;un pronom. Le passage d&#8217;un &#233;nonc&#233; au suivant a pour effet de multiplier
tous les scores par 0,6. Si les exemples 5, 6 et 7 se suivent alors en 5, Jean a le score de 100. En
6, Herbert a le score de 100 et Jean qui est li&#233; au pronom le a le score de 120 (soit 0,6x100+60).
De ce fait, selon notre pond&#233;ration, en 7, Il est attribu&#233; &#224; Jean.
</p>
<p>(5) Jean marche dans la rue.
(6) Herbert le salue.
(7) Il hoche la t&#234;te.
(8) Il l&#8217;interroge.
</p>
<p>422</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution anaphorique int&#233;gr&#233;e &#224; l&#8217;analyse de discours d&#8217;un corpus oral
</p>
<p>Cette affectation au moyen de pond&#233;ration comprend des exceptions. C&#8217;est le cas lorsqu&#8217;un
&#233;nonc&#233; dont le verbe a deux arguments instanci&#233;s est suivi d&#8217;un &#233;nonc&#233; de m&#234;me structure
dont les deux arguments sont pronominalis&#233;s. On attribue alors par analogie structurelle les
arguments dans leur ordre respectif quelle que soit leur pond&#233;ration. Par exemple si la phrase
8 succ&#233;dait &#224; 6, on attribue Herbert &#224; Il et Jean &#224; l&#8217; m&#234;me si Jean a une plus forte pond&#233;ration
que Herbert.
</p>
<p>Une autre exception concerne la fonction pragmatique de Th&#232;me. Cette fonction est prioritaire
sur la saillance. Nous l&#8217;interpr&#233;tons comme une modification de cette saillance. L&#8217;&#233;l&#233;ment au-
quel est assign&#233;e la fonction Th&#232;me obtient le score de l&#8217;&#233;l&#233;ment le plus &#233;lev&#233; de la pile et
se voit attribuer prioritairement le centre r&#233;trospectif le plus &#233;lev&#233;. Quel que soit le score des
ant&#233;c&#233;dents dans l&#8217;&#233;nonc&#233; qui pr&#233;c&#232;de l&#8217;exemple 9, nous apparions Le monsieur &#224; il.
</p>
<p>(9) Le monsieur, il le prend.
</p>
<p>D&#8217;autres r&#232;gles sp&#233;cifiques sont appliqu&#233;es comme l&#8217;assignation de la fonction topique au com-
pl&#233;ment du verbe, si le pronom &quot;on&quot; est sujet. On utilise des contraintes comme la contrainte
d&#8217;accord en genre et en nombre. Cette contrainte est tr&#232;s importante. (Beaver, 2004) qui utilise
la th&#233;orie de l&#8217;optimalit&#233; pour une r&#233;solution d&#8217;anaphore classe l&#8217;accord comme la contrainte
de rang le plus fort.
</p>
<p>Lorsque l&#8217;analyseur propose plusieurs analyses pour une m&#234;me s&#233;quence, il faut faire un choix
pour transmettre &#224; la s&#233;quence de texte suivante les ant&#233;c&#233;dents en cours. Afin de r&#233;soudre ce
probl&#232;me et permettre la transition, nous avons choisi de s&#233;lectionner la solution majoritaire
propos&#233;e dans l&#8217;ensemble des interpr&#233;tations. Nous avons utilis&#233; le m&#234;me proc&#233;d&#233; pour pr&#233;sen-
ter les r&#233;sultats. Au sein d&#8217;une s&#233;quence textuelle, si plusieurs interpr&#233;tations sont propos&#233;es
seul le r&#233;sultat majoritaire est retenu.
</p>
<p>4.2 Les relations anaphoriques z&#233;ro
</p>
<p>Les anaphores z&#233;ro ne concernent que les sujets omis substituables par des pronoms clitiques
sujet &#224; la troisi&#232;me personne. La r&#233;solution est simple et uniquement bas&#233;e sur la fonction
syntaxique Sujet. Lorsque le sujet est manquant dans un &#233;nonc&#233;, on lui attribue le sujet de
l&#8217;&#233;nonc&#233; pr&#233;c&#233;dent en v&#233;rifiant les contraintes d&#8217;accord. La figure 2 illustre la r&#233;solution d&#8217;une
anaphore z&#233;ro. L&#8217;analyseur attribue pour sujet du verbe jeta l&#8217;&#233;l&#233;ment t&#234;te du sujet de la phrase
qui pr&#233;c&#232;de dame.
</p>
<p>5 R&#233;sultats
</p>
<p>Le corpus utilis&#233; est une partie d&#8217;un corpus constitu&#233; par Monique Vion et Annie Colas (Vion
&amp; Colas, 2000). Pour produire ce corpus, des bandes dessin&#233;es ont &#233;t&#233; pr&#233;sent&#233;es &#224; des en-
fants. On a demand&#233; aux enfants de raconter l&#8217;histoire que pr&#233;sentent ces images. Ce corpus
est actuellement int&#233;gr&#233; au corpus CHILDES. Nous avons retenu pour l&#8217;&#233;valuation une s&#233;rie
de ces histoires appel&#233;e &quot;Ver et escargot&quot;. D&#8217;autres s&#233;ries nous ont servi de corpus d&#8217;observa-
tion et d&#8217;entra&#238;nement. Nous avons utilis&#233; les transcriptions des enfants de 7, 9 et 11 ans. Cela
repr&#233;sente un ensemble de 97 textes.
</p>
<p>423</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain R&#201;GNIER
</p>
<p>Une mise en forme des textes a &#233;t&#233; n&#233;cessaire. Les balises sp&#233;cifiques de CHILDES ont &#233;t&#233;
enlev&#233;es et certaines conventions de transcription ont &#233;t&#233; corrig&#233;es. Par exemple lorsque le
pronom il &#233;tait prononc&#233; i le transcripteur l&#8217;a &#233;crit i. Certaines disfluences ont &#233;t&#233; corrig&#233;es.
Il s&#8217;agit de r&#233;p&#233;titions, nous n&#8217;avons conserv&#233; que la partie droite de ces r&#233;p&#233;titions. Avant
d&#8217;effectuer l&#8217;analyse nous nous sommes assur&#233; que tous les mots de notre corpus renvoient &#224;
une ou plusieurs entr&#233;es de notre lexique. Les ajouts &#233;taient compos&#233;s d&#8217;interjections et de noms
propres.
</p>
<p>Au sein de ces histoires nous avons identifi&#233; 671 anaphores pronominales et 31 anaphores z&#233;ro.
Les textes ont &#233;t&#233; soumis &#224; une &#233;valuation de trois sujets. Pour chaque pronom et anaphore
z&#233;ro, ils ont indiqu&#233; le nom de l&#8217;ant&#233;c&#233;dent. Ils avaient le choix entre trois solutions. S&#8217;ils iden-
tifiaient l&#8217;ant&#233;c&#233;dent, ils indiquaient le nom de l&#8217;ant&#233;c&#233;dent. Dans le cas de pronoms pluriels
&#224; ant&#233;c&#233;dents multiples, ils pouvaient les lier au moyen d&#8217;un signe plus. Si aucun ant&#233;c&#233;dent
n&#8217;&#233;tait identifi&#233; ou si une ambigu&#239;t&#233; des ant&#233;c&#233;dents &#233;tait manifeste, ils notaient un point d&#8217;in-
terrogation. 10% des ant&#233;c&#233;dents n&#8217;ont pas obtenu d&#8217;accord total entre les sujets quelle que soit
la r&#233;ponse pour les anaphores pronominales. Et 3% n&#8217;ont pas obtenu d&#8217;accord unanime pour les
anaphores z&#233;ro.
</p>
<p>Anaphores pronominales Pr&#233;cision
Anaphores pronominales consensuelles 86 %
Anaphores pronominales non consensuelles 95%
</p>
<p>TAB. 1 &#8211; &#201;valuation des anaphores pronominales
</p>
<p>Sur les 671 anaphores pronominales, 18 n&#8217;ont pas &#233;t&#233; prises en compte puisqu&#8217;elles ne pr&#233;sen-
taient pas d&#8217;int&#233;r&#234;t pour la suite de nos travaux. Ce sont par exemple des anaphores incluses
dans une subordonn&#233;e relative. 35 anaphores suppl&#233;mentaires n&#8217;ont pas &#233;t&#233; prises en compte
puisqu&#8217;elles ont &#233;t&#233; jug&#233;es ambigu&#235;s ou sans ant&#233;c&#233;dent par les sujets. Les r&#233;sultats du tableau
1 indiquent la pr&#233;cision obtenue sur 616 anaphores. Les anaphores consensuelles sont celles
dont les sujets ont d&#233;sign&#233; un ant&#233;c&#233;dent &#224; l&#8217;unanimit&#233;. Les non consensuelles sont celles o&#249;
seule la majorit&#233; des sujets a d&#233;sign&#233; l&#8217;ant&#233;c&#233;dent attendu. L&#8217;essentiel des erreurs a lieu dans
des configurations o&#249; les relations entre les pronoms et leurs ant&#233;c&#233;dents ne sont pas ambigu&#235;s.
</p>
<p>Les r&#233;sultats du tableau 2 portent sur l&#8217;ensemble des anaphores pronominales (consensuelles et
non consensuelles confondues) et les anaphores z&#233;ro. Les r&#233;sultats semblent satisfaisants lors-
qu&#8217;on les compare &#224; d&#8217;autres travaux sur la r&#233;solution anaphorique comme (Trouilleux, 2002)
et (Tetreault, 2001). Peut-&#234;tre, la nature du corpus facilite-t-elle notre t&#226;che. Il s&#8217;agit pour nous
d&#8217;un corpus oral alors que les exemples cit&#233;s sont appliqu&#233;s sur des corpus &#233;crits. L&#8217;observa-
tion de ce corpus montre les textes oraux peuvent &#234;tre difficiles pour la r&#233;solution anaphorique
puisque 10% des textes pr&#233;sentent des difficult&#233;s de r&#233;solution pour les sujets interrog&#233;s. Il n&#8217;y
a par exemple pas d&#8217;ant&#233;c&#233;dent pour une partie des pronoms. Cependant lorsque la r&#233;solution
est possible, il semble que l&#8217;information est pr&#233;sent&#233;e de fa&#231;on plus conforme aux pr&#233;dictions
de la th&#233;orie du centrage que les textes &#233;crits. A ce titre nous avons favoris&#233; les anaphores in-
terphrastiques et la continuit&#233; th&#233;matique comme la th&#233;orie du centrage le pr&#233;conise. Cela nous
semble plus appropri&#233; aux corpus oraux. On peut remarquer aussi que la couverture des ana-
lyses cit&#233;es sur les textes &#233;crits est aussi plus large puisqu&#8217;elles int&#232;grent une r&#233;solution des
adjectifs possessifs.
</p>
<p>424</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution anaphorique int&#233;gr&#233;e &#224; l&#8217;analyse de discours d&#8217;un corpus oral
</p>
<p>Type d&#8217;anaphore Pr&#233;cision
Anaphores pronominales 87 %
Anaphores z&#233;ro 93%
</p>
<p>TAB. 2 &#8211; &#201;valuation g&#233;n&#233;rale
</p>
<p>6 Conclusion
</p>
<p>L&#8217;int&#233;gration de diff&#233;rents niveaux linguistiques au sein de l&#8217;analyse de discours permet de pro-
fiter des informations des diff&#233;rents traitements pour r&#233;soudre des probl&#232;mes discursifs. L&#8217;ana-
lyse de discours met &#224; disposition des informations fonctionnelles issues de constructions syn-
taxiques sp&#233;cifiques. Nous avons pu observer que ces informations, comme la fonction sujet,
peuvent remonter dans l&#8217;analyse et am&#233;liorer la r&#233;solution de probl&#232;mes discursifs comme la
r&#233;solution anaphorique.
</p>
<p>Les approches utilis&#233;es, les contraintes, les fonctions et l&#8217;approche dynamique se combinent au
sein de notre analyse. Elles sont applicables &#224; tous les niveaux d&#8217;analyse. Elles ne se confinent
pas &#224; un seul de ces niveaux.
</p>
<p>L&#8217;observation des erreurs nous am&#232;ne &#224; quelques pistes d&#8217;am&#233;lioration de l&#8217;existant. Par
exemple, la r&#233;solution des pronoms &#224; ant&#233;c&#233;dents multiples et la gestion de la cataphore
n&#8217;&#233;taient pas impl&#233;ment&#233;es. Elles ont produit des erreurs. On peut envisager des am&#233;liorations
en tenant compte de la diversit&#233; des fonctions pragmatiques. On pourrait affiner la pond&#233;ration
de la saillance des r&#233;f&#233;rents en exploitant mieux les diff&#233;rentes fonctions. On peut continuer &#224;
am&#233;liorer l&#8217;analyse de discours pour contraindre les &#233;nonc&#233;s afin de diminuer le nombre d&#8217;in-
terpr&#233;tation et simplifier la d&#233;termination des r&#233;sultats.
</p>
<p>D&#8217;autres erreurs demanderaient un investissement consid&#233;rable notamment pour les r&#233;solutions
qui font appel &#224; notre connaissance du monde. Dans la suite des &#233;nonc&#233;s 10 et 11 l&#8217;ant&#233;c&#233;dent
de Il en 11 nous semble &#234;tre plus favorablement reli&#233; au patient plut&#244;t qu&#8217;&#224; l&#8217;agent du verbe
jeter. Et cela quel que soit le poids de Il en 10. Cette intuition fait appel &#224; notre connaissance du
monde.
</p>
<p>(10) Il le jette.
</p>
<p>(11) Il tombe.
</p>
<p>D&#8217;autres probl&#232;mes li&#233;s &#224; la r&#233;solution anaphorique pourraient se poser si nous changions de
format ou de genre de texte. Par exemple les textes analys&#233;s ont en moyenne une douzaine de
s&#233;quences de texte. Si les textes &#233;taient plus longs, la pond&#233;ration d&#8217;un r&#233;f&#233;rent du discours
pourrait augmenter consid&#233;rablement et ne plus permettre de transition. Nous devrions pr&#233;voir
une valeur plafond que la pond&#233;ration ne pourrait pas d&#233;passer.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALSHAWI H. (1987). Memory and context for language interpretation. New York : Cambridge
University Press.
</p>
<p>425</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alain R&#201;GNIER
</p>
<p>AMSILI P., DENIS P. &amp; ROUSSARIE L. (2006). Anaphores abstraites en fran&#231;ais : repr&#233;sen-
tation formelle. Traitement Automatique des Langues, 46(1), 15&#8211;39.
ASHER N. (1993). Reference to abstract objects in discourse. Dordrecht : Kluwer Academic
Publishers.
BEAVER D. (2004). The optimization of discourse anaphora. Linguistics and philosophy,
27(1), 3&#8211;56.
BLACHE P. (2001). Les Grammaires de Propri&#233;t&#233;s : des contraintes pour le traitement auto-
matique des langues naturelles. Paris : Herm&#232;s Sciences.
BLACHE P. (2005). Property grammars : A fully constraint-based theory. In H. CHRISTIAN-
SEN &amp; AL., Eds., Constraint Solving and Language Processing. Springer.
DIK S. C. (1997). The theory of functional grammar. 2 Volumes. Part 1 : The Structure of the
Clause. Part 2 : Complex and Derived Constructions. Berlin : Mouton de Gruyter.
GROSZ B., JOSHI A. &amp; WEINSTEIN S. (1995). Centering : a framework for modelling the
local coherence of discourse. Computational Linguistics, 21(2), 203&#8211;226.
IDE N. &amp; CRISTEA D. (2000). A hierarchical account of referential accessibility. In Procee-
dings of the 38th Annual Meeting of the Association for Computational Linguistics, ACL 2000,
p. 416&#8211;424, Hong-Kong.
LAPPIN S. &amp; LEASS H. J. (1994). An algorithm for pronominal anaphora resolution. Com-
putational Linguistics, 20(4), 535&#8211;561.
NOUALI O., R&#201;GNIER A. &amp; BLACHE P. (2005). Classification de courriers &#233;lectroniques :
une approche par apprentissage bas&#233;e sur des mod&#232;les linguistiques. Revue d&#8217;intelligence
artificielle, 19(6), 885&#8211;912.
TETREAULT J. R. (2001). A corpus-based evaluation of centering and pronoun resolution.
Computational Linguistics, 27(4), 27&#8211;4.
TETREAULT J. R. &amp; ALLEN J. F. (2004). Dialogue structure and pronoun resolution. In
COLIBRI, Ed., Proceedings of DAARC 2004, p. 7&#8211;12, Lisbonne.
TROUILLEUX F. (2002). A rule based pronoun resolution system for french. In COLIBRI, Ed.,
Proceedings of DAARC 2002, Lisbonne.
VICTORRI B. (2005). Le calcul de la r&#233;f&#233;rence. In HERM&#200;S, Ed., S&#233;mantique et traitement
automatique du langage naturel, p. 133&#8211;172, Paris.
VION M. &amp; COLAS A. (2000). Mode de recueil et outil d&#8217;analyse d&#8217;un corpus de parole spon-
tan&#233;e &#233;tudi&#233; d&#8217;un point de vue psycholinguistique. Travaux Interdisciplinaires du Laboratoire
Parole et Langage d&#8217;Aix-en-Provence, 19, 155&#8211;167.
</p>
<p>426</p>

</div></div>
</body></html>