<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Combinaison de ressources linguistiques pour l&#8217;aide &#224; l&#8217;acc&#232;s lexical : &#233;tude de faisabilit&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Combinaison de ressources linguistiques pour l&#8217;aide
&#224; l&#8217;acc&#232;s lexical : &#233;tude de faisabilit&#233;
</p>
<p>Laurianne SITBON
Laboratoire d&#8217;Informatique d&#8217;Avignon - Universit&#233; d&#8217;Avignon
</p>
<p>Laboratoire Parole et Langage - Universit&#233; de Provence
laurianne.sitbon@univ-avignon.fr
</p>
<p>R&#233;sum&#233;. Cet article propose une &#233;valuation combin&#233;e et comparative de 5 ressources (des-
criptive, paradigmatique et syntagmatiques) pour l&#8217;aide &#224; l&#8217;acc&#232;s lexical en situation de &quot;mot
sur le bout de la langue&quot;, en vue de la cr&#233;ation d&#8217;un outil utilisant la combinaison de ces res-
sources. En situation de &quot;mot sur le bout de la langue&quot;, l&#8217;utilisateur n&#8217;acc&#232;de plus au mot qu&#8217;il
veut dire ou &#233;crire mais est capable d&#8217;en produire d&#8217;autres s&#233;mantiquement associ&#233;s. L&#8217;&#233;valua-
tion se base sur un corpus de 20 mots &quot;sur le bout de la langue&quot; pour lesquels on dispose de
50 groupes de 5 associations s&#233;mantiques effectu&#233;es par des utilisateurs. Les r&#233;sultats montrent
que les ressources sont compl&#233;mentaires et peu redondantes. De plus au moins une association
propos&#233;e parmi les 5 permettrait de retrouver le mot &quot;sur le bout de la langue&quot; dans 79% des
cas, &#224; condition de le s&#233;lectionner parmi les 2500 mot potentiels. Enfin, les r&#233;sultats montrent
des disparit&#233;s entre les utilisateurs, ce qui permettrait de d&#233;finir des profils d&#8217;utilisateur pour
une am&#233;lioration des performances.
</p>
<p>Abstract. This paper describes a joint and comparative evaluation of 5 lexical resources
(descriptive, paradigmatic and syntagmatic) from a lexical access angle, with the further pers-
pective of constructing a tool based on a combination of these resources to avoid the &quot;tip of
the tongue&quot; (TOT) phenomenon. This phenomenon characterises a person who has difficulty
in saying or writing an intended word but one who is able to produce semantically associated
words. The evaluation corpus is composed of 20 TOT examples each linked to 50 users&#8217; asso-
ciation sets of 5 semantically associated words. The results highlight that all the tested resources
are complementary. Moreover, 79% of proposed association sets contain at least one association
leading to the TOT through its relative words in at least one resource (in the worse case the TOT
has to be found among 2500 words). Finally the results show variations between users which
could increase performance thanks to user profiles.
</p>
<p>Mots-cl&#233;s : r&#233;seaux s&#233;mantiques, acc&#232;s lexical, profil d&#8217;utilisateur.
Keywords: semantic networks, lexical access, user profiling.
</p>
<p>1 Introduction
</p>
<p>Les outils du traitement automatique du langage ont d&#233;montr&#233; &#224; plusieurs reprises leur capacit&#233; &#224;
rem&#233;dier ou compenser des handicaps de langage. Le probl&#232;me du mot sur le bout de la langue,
plus g&#233;n&#233;ralement connu comme &#233;tant un d&#233;ficit d&#8217;acc&#232;s lexical en production de phrases (Tip
</p>
<p>489</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON
</p>
<p>Of the Tongue en anglais (TOT)), est l&#8217;une des manifestation de tels handicaps. Si le ph&#233;nom&#232;ne
a &#233;t&#233; &#233;tudi&#233; dans le cadre g&#233;n&#233;ral (des personnes sans d&#233;ficit particulier peuvent en souffrir par
moments), les observations diff&#232;rent en situation de handicap. En effet les travaux de (Brown &amp;
McNeill, 1966) ont montr&#233; que en situation de TOT les personnes connaissent des informations
sur le mot recherch&#233;, d&#8217;ordre phonologique aussi bien que s&#233;mantique. Les mod&#232;les actuels
de la production du langage proposent une vision connexioniste (Dell, 1986), o&#249; l&#8217;information
verbale serait stock&#233;e dans trois syst&#232;mes interconnect&#233;s (le syst&#232;me s&#233;mantique, le syst&#232;me
phonologique et le syst&#232;me orthographique). D&#8217;apr&#232;s les travaux de (Burke &amp; Shafto, 2004) sur
le d&#233;ficit d&#8217;acc&#232;s lexical chez les personnes &#226;g&#233;es, c&#8217;est essentiellement un d&#233;ficit d&#8217;acc&#232;s pho-
nologique qui est en cause, ce qui signifie que l&#8217;acc&#232;s s&#233;mantique est intact. Dans les mod&#232;les
connexionistes, l&#8217;interconnexion entre les unit&#233;s s&#233;mantiques est beaucoup plus importante que
la connexion unique entre un mot et sa phonologie ou un mot et sa graphie (qui sont en r&#233;alit&#233;
des connexions des phon&#232;mes vers les graph&#232;mes, plus une connexion du sens vers la graphie
qui porte les exceptions), ce qui explique que lorsque les connexions sont &quot;fragilis&#233;es&quot; elles sont
maintenues au sein du r&#233;seau s&#233;mantique mais pas pour l&#8217;acc&#232;s phonologique. Les travaux de
(Faust &amp; Sharfstein-Friedman, 2003) montrent un comportement similaire chez des adolescents
dyslexiques, qui s&#8217;explique dans ce cas par un d&#233;ficit de la conscience phonologique fr&#233;quent
chez les personnes souffrant de dyslexie.
</p>
<p>Un syst&#232;me qui reproduirait le r&#233;seau s&#233;mantique de chaque individu (et dot&#233; d&#8217;un convertisseur
phonologique robuste entre les sens et les mots) permettrait ainsi de proposer &#224; l&#8217;utilisateur en
situation de handicap et face &#224; un mot recherch&#233; une liste d&#8217;hypoth&#232;ses, obtenue &#224; partir de mots
proches dans son r&#233;seau s&#233;mantique. Ainsi automatiser l&#8217;aide &#224; l&#8217;acc&#232;s lexical n&#233;cessiterait une
repr&#233;sentation exhaustive et individuelle du lexique mental. Dans cet article nous faisons l&#8217;hy-
poth&#232;se que la construction d&#8217;une telle ressource peut &#234;tre approch&#233;e &#224; l&#8217;aide d&#8217;une combinaison
de ressources d&#233;j&#224; disponibles ou r&#233;alisables automatiquement, et qui pr&#233;sentent chacune des
aspects diff&#233;rents du cheminement de la pens&#233;e pour passer de l&#8217;id&#233;e au mot. Les ressources
lexicales auxquelles nous nous sommes int&#233;ress&#233; ont d&#233;j&#224; fait ind&#233;pendamment l&#8217;objet d&#8217;&#233;tudes
dans le cadre de l&#8217;aide &#224; l&#8217;acc&#232;s lexical (Reuer, 2004). Cependant tous les individus &#233;tant diff&#233;-
rents nous pensons que les ressources lexicales peuvent &#234;tre utiles &#224; des individus diff&#233;rents &#224;
diff&#233;rents degr&#233;s. On peut aussi penser que les voies emprunt&#233;es par le cerveau pour acc&#233;der &#224;
un mot d&#233;pendent de caract&#233;ristiques linguistiques ou s&#233;mantiques de ce mot. Encore une fois,
la ressource la plus appropri&#233;e dans un cas pr&#233;cis pourrait d&#233;pendre de la nature s&#233;mantique ou
syntaxique du mot recherch&#233;.
</p>
<p>L&#8217;id&#233;e &#224; long terme est d&#8217;impl&#233;menter ce syst&#232;me avec des associations audio, ce qui permettrait
une utilisation en situation quotidienne. Les bonnes performances des syst&#232;mes de reconnais-
sance automatique de la parole nous laissent penser que la prise en compte de peu d&#8217;hypoth&#232;ses
de reconnaissance serait suffisante pour converger vers le sens recherch&#233;. L&#8217;aide &#224; la formulation
ou l&#8217;enrichissement semi-automatique de requ&#234;tes en recherche d&#8217;information est &#233;galement un
domaine d&#8217;application qui pourra b&#233;n&#233;ficier de ce syst&#232;me.
</p>
<p>La conception d&#8217;un tel syst&#232;me soul&#232;ve plusieurs questions auxquelles nous tenterons de r&#233;-
pondre dans cet article. Dans un premier temps le choix des syst&#232;mes utilis&#233;s est justifi&#233; dans
la premi&#232;re section. Il doit permettre un recouvrement maximal des types de relations possibles
(paradigmatiques, syntagmatiques ou descriptives) ainsi que des domaines s&#233;mantiques (journa-
listique, litt&#233;raire, g&#233;n&#233;rique). Ensuite l&#8217;int&#233;r&#234;t d&#8217;une telle combinaison doit &#234;tre attest&#233; &#224; travers
une &#233;valuation combin&#233;e des syst&#232;mes unitaires s&#233;lectionn&#233;s. Pour cela la seconde section pr&#233;-
sente l&#8217;&#233;laboration d&#8217;un corpus d&#8217;&#233;valuation avec l&#8217;aide de 50 participants qui ont produit des
associations s&#233;mantiques sur des simulations de TOT sur 20 mots.
</p>
<p>490</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aide &#224; l&#8217;acc&#232;s lexical par combinaison de ressources linguistiques
</p>
<p>2 Les ressources linguistiques test&#233;es
</p>
<p>Les approches existantes dans le domaine du &quot;mot sur le bout de la langue&quot; ont souvent &#233;voqu&#233;
l&#8217;usage de ressources de natures diff&#233;rentes. (Lortal et al., 2004) proposent d&#8217;&#233;tendre les classes
s&#233;mantiques du r&#233;seau de relation s&#233;mantico-pragmatiques SVELTAN &#224; l&#8217;aide d&#8217;EuroWord-
Net1 et montrent l&#8217;int&#233;r&#234;t de les utiliser ensemble pour une t&#226;che consistant &#224; retrouver 10 mots
supprim&#233;s dans des documents. (Zock, 2002) &#233;voque trois acc&#232;s aux TOT via des ressources
diff&#233;rentes sans les &#233;valuer : un par la forme du mot, graphique ou phonologique, un autre par
son sens en termes de collocations dans le domaine s&#233;mantique auquel il appartient, et un acc&#232;s
par la fonction grammaticale. (Reuer, 2004) argumente en faveur de quatre types de ressources
linguistiques diff&#233;rentes : des r&#233;seaux s&#233;mantiques construits manuellement , des r&#233;seaux pa-
radigmatiques et syntagmatiques construits automatiquement, et des r&#233;seaux phonologiques et
morphologiques.
</p>
<p>Etant donn&#233; que l&#8217;acc&#232;s phonologique est justement la cause du TOT dans les situations de
handicap, il n&#8217;est pas pertinent dans notre cas d&#8217;utiliser des ressources pour l&#8217;acc&#232;s phono-
logique, et nous nous sommes donc concentr&#233; sur la repr&#233;sentativit&#233; des 3 premiers types de
ressources. Les relations paradigmatiques sont des liens s&#233;mantiques de type synonymiques ou
hi&#233;rarchiques qui peuvent d&#233;pendre du contexte. Les relations syntagmatiques sont des associa-
tions mn&#233;siques, issues d&#8217;un contexte stock&#233; dans la m&#233;moire &#224; long terme. Elles peuvent &#234;tre
en parties extraites &#224; l&#8217;aide de cooccurrences. Nous avons ajout&#233; &#224; ces ressources des relations
descriptives issues d&#8217;un dictionnaire.
</p>
<p>2.1 Les relations descriptives
</p>
<p>La mani&#232;re la plus naturelle d&#8217;expliquer &#224; une personne ou &#224; un syst&#232;me le mot que l&#8217;on re-
cherche est de le d&#233;crire avec d&#8217;autres mots, m&#234;me si il s&#8217;av&#232;re que cette description est par-
fois impossible car elle implique le m&#234;me amor&#231;age lexical que celui du mot recherch&#233;. Les
dictionnaires constituent de bons r&#233;f&#233;rentiels en ce qui concerne la description des mots et
disposent g&#233;n&#233;ralement d&#8217;une bonne couverture. Nous avons utilis&#233; un dictionnaire en ligne
(http://fr.answers.com propose gratuitement un dictionnaire du fran&#231;ais) pour nos ex-
p&#233;riences. Tous les mots d&#8217;une d&#233;finition n&#8217;&#233;tant pas n&#233;cessairement reli&#233;s s&#233;mantiquement au
mot d&#233;fini (on rencontre beaucoup de mots outils), des mots cl&#233;s sont extraits en fonction de
leur fr&#233;quence relative (tf/idf ) dans un corpus g&#233;n&#233;raliste (extraits du journal Le Monde). Les
relations s&#233;mantiques entre les mots induites dynamiquement par cette technique ne sont pas
des relations sym&#233;triques (par exemple le mot pied peut &#234;tre dans la d&#233;finition de chaussette
mais l&#8217;inverse est peu probable).
</p>
<p>2.2 Les relations paradigmatiques
</p>
<p>EuroWordNet est une base de donn&#233;es multilingue construite sur le mod&#232;le de Wordnet 2. A
chaque mot est associ&#233; un certain nombre de sens, qui sont hi&#233;rarchis&#233;s selon des relations
paradigmatiques : synonymie, m&#233;ronymie, hyponymie. La base de donn&#233;es EuroWordNet fran-
&#231;aise dont nous disposons contient ces informations pour les noms, les verbes et les adjectifs.
</p>
<p>1http://www.illc.uva.nl/EuroWordNet/
2http://wordnet.princeton.edu/
</p>
<p>491</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON
</p>
<p>Le principal inconv&#233;nient de cette ressource pour l&#8217;acc&#232;s lexical est que les relations ne sont
pas quantifiables, on ne peut pas leur associer de score. Le niveau dans la hi&#233;rarchie d&#8217;un m&#233;-
ronyme ou d&#8217;un hyponyme n&#8217;est pas non plus utilisable car selon les mots, le niveau de d&#233;tails
hi&#233;rarchique peut &#234;tre tr&#232;s variable. Par exemple une pomme sera un fruit alors qu&#8217;un citron sera
un agrume qui est aussi un fruit. Pourtant la relation pomme/fruit est aussi forte que la relation
citron/fruit.
</p>
<p>2.3 Les relations syntagmatiques apprises automatiquement
</p>
<p>Les relations syntagmatiques sont les moins d&#233;limit&#233;es, et il est impensable d&#8217;assurer leur re-
pr&#233;sentativit&#233;. Cependant nous nous sommes concentr&#233;s sur trois types de corpus de natures
diff&#233;rentes : des articles de presse, des romans, et le web. Des m&#233;thodes d&#8217;extraction de rela-
tions diff&#233;rentes sont appliqu&#233;es sur chacun des corpus, mais elles sont toutes bas&#233;es sur l&#8217;id&#233;e
de cooccurrences entre les mots associ&#233;s et le mot recherch&#233;.
</p>
<p>Un premier r&#233;seau de relations syntagmatiques appris automatiquement est une carte s&#233;man-
tique apprise &#224; l&#8217;aide de l&#8217;outil Infomap3 sur le corpus litt&#233;raire corpatext4. Infomap cr&#233;e des
cartes s&#233;mantiques en se fondant sur le principe de LSA (Latent Semantic Analysis) (Deerwes-
ter et al., 1990), c&#8217;est &#224; dire qu&#8217;il effectue une r&#233;duction de l&#8217;espace lexical compos&#233; des mots
du corpus afin de les regrouper en classes s&#233;mantiques, en se basant sur les cooccurrences des
mots. (Landauer et al., 1998) a montr&#233; la repr&#233;sentativit&#233; du lexique mental &#224; travers LSA, qui
est utilis&#233; pour cette propri&#233;t&#233; par des psycholinguistes. Cependant cette approche ne permet
pas d&#8217;explorer tous les sens d&#8217;un mot, au contraire elle le classe dans sa classe s&#233;mantique la
plus repr&#233;sent&#233;e. La cr&#233;ation de contextonymes propos&#233;e par (Ji et al., 2003) permet de distin-
guer les diff&#233;rents sens en cr&#233;ant des classes de termes associ&#233;s, mais nous ne les avons pas
exp&#233;riment&#233;s ici.
</p>
<p>Un second r&#233;seau de relations syntagmatiques est un r&#233;seau de cooccurrences. Il est utilis&#233; par
(Ferret &amp; Zock, 2006) pour des travaux similaires. Il est construit selon la m&#233;thode propos&#233;e
par (Church &amp; Hanks, 1990) qui calcule l&#8217;information mutuelle entre les termes d&#8217;une fen&#234;tre
glissante de 20 mots sur le corpus journalistique (extraits du journal Le Monde). On obtient ainsi
des scores de coh&#233;sion entre les paires de mots cooccurrents du corpus. Cependant, comme pour
les relations paradigmatiques apprises par LSA, les cooccurrences ne r&#233;solvent g&#233;n&#233;ralement
pas les ambigu&#239;t&#233;s de sens lorsqu&#8217;un sens est plus fr&#233;quent qu&#8217;un autre.
</p>
<p>La troisi&#232;me ressource cr&#233;&#233;e n&#8217;est pas un r&#233;seau de relations mais plut&#244;t un g&#233;n&#233;rateur dyna-
mique de relations syntagmatiques, selon le m&#234;me principe que la g&#233;n&#233;ration de relations des-
criptives. Elle permet d&#8217;obtenir les mots cl&#233;s des 10 premi&#232;res r&#233;ponses du moteur de recherche
Google 5 &#224; la requ&#234;te correspondant au mot que l&#8217;on cherche &#224; mettre en relation. On consid&#232;re
que les mots de plus grande fr&#233;quence relative (tf/idf ) dans les 10 sites les plus pertinents selon
Google sont des cooccurents importants et sont reli&#233; au mot par une relation syntagmatique.
</p>
<p>(Joyce, 2005) propose la construction d&#8217;un r&#233;seau de relations syntagmatiques &#224; partir d&#8217;un r&#233;-
seau d&#8217;associations qui reposerait sur l&#8217;exp&#233;rience personnelle des individus, en demandant &#224;
beaucoup de personnes de participer &#224; la cr&#233;ation de ce r&#233;seau. Il s&#8217;agit d&#8217;une partie d&#8217;un pro-
gramme de cr&#233;ation de ressources &#224; tr&#232;s grande &#233;chelle qui est pratiqu&#233; sur la langue japonaise.
</p>
<p>3http://infomap-nlp.sourceforge.net/
4http://www.lexique.org/public/corpatext.php
5http://www.google.fr
</p>
<p>492</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aide &#224; l&#8217;acc&#232;s lexical par combinaison de ressources linguistiques
</p>
<p>3 Constitution d&#8217;un corpus d&#8217;associations s&#233;mantiques
</p>
<p>Jusqu&#8217;&#224; ce jour les r&#233;seaux propos&#233;s ont &#233;t&#233; &#233;valu&#233;s dans des cadres d&#8217;autres applications,
comme la traduction ou l&#8217;aide &#224; la r&#233;daction. Nous proposons un cadre &#233;valuatif refl&#233;tant la
t&#226;che d&#8217;un syst&#232;me d&#8217;aide &#224; l&#8217;acc&#232;s lexical en situation quotidienne pour des personnes &#226;g&#233;es
ou dyslexiques, en composant un r&#233;seau d&#8217;associations r&#233;elles &#224; l&#8217;aide de participants.
</p>
<p>Pour 20 mots s&#233;lectionn&#233;s (TOT), 50 personnes ont donn&#233; les 5 premiers mots qui leur venaient
&#224; l&#8217;esprit en association avec le mot propos&#233;, en &#233;vitant toute forme de digression. Cette exp&#233;-
rience b&#233;n&#233;vole a &#233;t&#233; r&#233;alis&#233;e &#224; l&#8217;aide d&#8217;une interface web, de mani&#232;re &#224; laisser les utilisateurs
libres de leurs conditions d&#8217;exp&#233;rimentation. La consigne exacte &#233;tait : &quot;Cette exp&#233;rience s&#8217;in-
t&#233;resse aux associations d&#8217;id&#233;es. Il va vous &#234;tre propos&#233; une s&#233;rie de 20 mots auxquels vous
devrez associer &#224; chaque fois les 5 premier mots qui vous viennent &#224; l&#8217;esprit. par exemple :
OREILLER : plumes, taie, bataille, dormir, moelleux. Ces 5 mots ne doivent pas n&#233;cessaire-
ment &#234;tre reli&#233;s entre eux, mais doivent tous &#234;tre associ&#233;s au mot de d&#233;part. Ainsi, on n&#8217;attend
PAS pour oreiller : plumes, oiseau, arbre, feuille, papier ... (ici chaque mot est reli&#233; au pr&#233;ce-
demment cit&#233;).&quot;
</p>
<p>Les 20 TOT ont &#233;t&#233; s&#233;lectionn&#233;s de mani&#232;re &#224; ce qu&#8217;ils fassent tous partie des ressources lin-
guistiques statiques (EuroWordNet, la carte LSA sur Corpatext et le r&#233;seau de cooccurrences).
La liste des mots ainsi que leurs fr&#233;quences dans Lexique 3 6 (fr&#233;quence dans des dialogues
issus de films, fr&#233;quence dans un corpus de livres) est dans le tableau 1. La plupart sont des
noms communs, mais il y a aussi des adjectifs et des noms propres, ainsi que des noms d&#8217;ori-
gine &#233;trang&#232;re. Plusieurs de ces mots appartiennent &#224; plusieurs cat&#233;gories syntaxiques (java est
&#224; la fois un nom propre et un nom commun, massif est &#224; la fois un adjectif et un nom com-
mun), certains sont des noms communs repris par des marques commerciales (Casino, Lion), et
d&#8217;autres sont aussi fortement polys&#233;miques (facteur, baril, brioche, quiche). Tous les mots sont
de fr&#233;quence inf&#233;rieure &#224; 20, donc peu fr&#233;quents voir rares.
</p>
<p>TOT f. film f. livre mot f. film f. livre mot f. film f. livre
veau 6,20 16,96 baril 4,22 3,04 casino 17,41 10,81
</p>
<p>entretien 17,71 27,77 cambriolage 9,34 2,77 java 0,72 2,30
menhir 0,18 0,68 quiche 0,66 0,68 kleenex 2,11 2,91
lion 17,05 33,04 brioche 7,29 7,09 facteur 11,27 14,32
festin 5,12 5,68 chaussette 14,58 22,84 massif 8,13 22,30
virtuel 2,53 2,16 rugby 1,87 3,11 landau 1,20 4,59
</p>
<p>snowboard N/C N/C oie 5,90 9,32
</p>
<p>TAB. 1 &#8211; Mots s&#233;lectionn&#233;s pour la constitution du corpus : chaque utilisateur devait proposer
les 5 premiers mots ou expressions qui leur venaient &#224; l&#8217;esprit. Les fr&#233;quences de chaque mot
dans des dialogues de films (f. film) ou dans un corpus de livres (f. livre) montrent qu&#8217;il s&#8217;agit
de mots peu fr&#233;quents dans le langage oral comme dans le langage &#233;crit.
</p>
<p>Les 50 personnes sont des adultes d&#8217;&#226;ges, de professions et de niveaux d&#8217;&#233;tudes vari&#233;s, on part
ainsi sans a priori social sur l&#8217;&#233;chantillon de population qu&#8217;elles repr&#233;sentent. Elles ont toutes
propos&#233; les 5 associations demand&#233;es. On note que des participants (non retenus dans le corpus)
n&#8217;ont pas pu terminer l&#8217;exp&#233;rience pour qui il &#233;tait trop difficile de trouver plus d&#8217;un mot associ&#233;.
</p>
<p>Le corpus ainsi cr&#233;&#233; contient pour chacun des 20 TOT au total 250 associations. En moyenne,
on d&#233;nombre 76,8 associations diff&#233;rentes par TOT. 7
</p>
<p>6http://www.lexique.org
7Le corpus est disponible sur demande par mail &#224; l&#8217;auteur.
</p>
<p>493</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON
</p>
<p>4 Etude num&#233;rique
</p>
<p>On cherche &#224; r&#233;pondre &#224; l&#8217;aide du corpus &#224; trois grandes questions, &#224; savoir : est-il utile de
combiner plusieurs syst&#232;mes ? Y-a-t-il des mots pour lesquels certaines ressources sont plus
repr&#233;sentatives du lexique mental que d&#8217;autres ? Est-il possible de d&#233;terminer des profils d&#8217;uti-
lisateurs dans la prise en compte des ressources ?
</p>
<p>Pour tenter de r&#233;pondre &#224; ces questions, nous avons recherch&#233; le TOT dans les 5 environnements
s&#233;mantiques (listes de mots relatives &#224; chaque ressource) de chaque association propos&#233;e pour
ce TOT (soit 250 par TOT). La figure 1 illustre le principe de cette &#233;valuation. Pour chaque
association, on recherche les mots en relation dans chacune des 5 ressources, en limitant aux
100 premiers mots (au sens de scores lorsqu&#8217;ils sont disponibles). Le TOT est consid&#233;r&#233; retrouv&#233;
si fait partie d&#8217;une relation retrouv&#233;e par une ressource. En effet les relations sont des termes
ou des expressions nominales. Ainsi si le mot recherch&#233; est tarte, l&#8217;expression tarte &#224; la fraise
sera acceptable.
</p>
<p>TOT
ASSOCIATION
</p>
<p>ASSOCIATION
</p>
<p>ASSOCIATION
</p>
<p>ASSOCIATION
</p>
<p>ASSOCIATION
</p>
<p>E ?
...
</p>
<p>...
</p>
<p>...
</p>
<p>...
</p>
<p>FIG. 1 &#8211; Evaluation des ressources : on recherche le TOT dans les listes de mots issues des
relations de chacun des mots associ&#233; &#224; ce TOT par un utilisateur dans chacune des 5 ressources
disponibles.
</p>
<p>Ce mode d&#8217;&#233;valuation recherche le TOT dans 5 &#215; 5 listes de 100 mots, soit une liste de 2500
mots diff&#233;rents au maximum. Sachant qu&#8217;au final on souhaite retrouver le TOT dans une liste de
10 mots propos&#233;s &#224; l&#8217;utilisateur en fonction des associations qu&#8217;il propose, il ne parait pas per-
tinent d&#8217;augmenter le nombre de mots contenus dans les listes retourn&#233;es par chaque ressource.
On d&#233;finit les associations &quot;utiles&quot; (AU) comme les associations propos&#233;es par les utilisateurs
et pour lesquelles la liste de mots (obtenue &#224; partir de relations dans au moins l&#8217;une des 5
ressources (500 mots) ou bien dans une ressource en particulier (100 mots) contient le TOT.
</p>
<p>4.1 Couverture entre les ressources
</p>
<p>La couverture de l&#8217;ensemble des ressources est estim&#233;e &#224; partir du nombre d&#8217;associations com-
prenant le TOT dans les relations d&#8217;une seule des 5 ressources disponibles. On calcule le pour-
centage de ces associations par rapport au nombre total d&#8217;associations comprenant la cible dans
au moins une des 5 ressources.
</p>
<p>494</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aide &#224; l&#8217;acc&#232;s lexical par combinaison de ressources linguistiques
</p>
<p>relations descriptives paradigmatiques syntagmatiques
def ewn lsa coocc web
</p>
<p>%ressource 40% 33% 23% 47% 70%
%global 6% 6% 2% 16% 44%
</p>
<p>TAB. 2 &#8211; Pourcentages de rappel unique (nombres d&#8217;associations pour lesquelles la ressource
est la seule &#224; retrouver le TOT dans les mots reli&#233;s), soit par rapport au rappel global pour cette
ressource (nombre d&#8217;associations pour lesquelles la ressource retrouve le TOT dans les mots
reli&#233;s) (%ressource) , soit par rapport au nombre total d&#8217;AU (associations &quot;utiles&quot;) (%global).
</p>
<p>Les pourcentages de rappel unique de chaque ressource par rapport &#224; son rappel total, consign&#233;s
dans le tableau 2, sont compris entre 23% et 70%, ce qui signifie que chacune des ressources est
essentielle pour une bonne part des informations auxquelles elle permet d&#8217;acc&#233;der, &#233;tant donn&#233;
que dans ces cas l&#224; elle est la seule &#224; pouvoir proposer le TOT recherch&#233; &#224; l&#8217;aide de l&#8217;AU. Les
pourcentages de rappel unique par rapport &#224; la globalit&#233; des r&#233;ponses montrent n&#233;anmoins que
l&#8217;impact des ressources descriptives ou paradigmatiques est beaucoup moins important dans
l&#8217;ensemble que les relations syntagmatiques.
</p>
<p>4.2 R&#233;sultats par mots
</p>
<p>Nous nous sommes pench&#233;s sur la r&#233;partition des relations apport&#233;es par chacune des ressources
pour chaque TOT du corpus. Pour cela nous avons observ&#233; les cas o&#249; les associations propos&#233;es
par les utilisateurs contenaient le TOT dans chacune des ressources. Les r&#233;sultats dans le tableau
3 montrent tout d&#8217;abord que certains mots, comme veau, entretien ou rugby sont plus enclins &#224;
&#234;tre retrouv&#233;s par l&#8217;ensemble des ressources, alors que d&#8217;autres comme cambriolage ou menhir
n&#233;cessite la compl&#233;mentarit&#233; de deux ressources (en effet dans ces deux cas la somme des as-
sociations reliant au TOT pour chaque ressource est pratiquement &#233;gale au total d&#8217;associations
reliant au TOT, ce qui signifie que ce sont des associations diff&#233;rentes qui ont permis de retrou-
ver le TOT pour chaque ressource). Par ailleurs certains mot ne sont atteignables que par une
seule ressource, et pas la m&#234;me dans tous les cas. Ainsi, snowboard n&#8217;a &#233;t&#233; retrouv&#233; que par
des associations de relations dans la d&#233;finition, facteur n&#8217;a &#233;t&#233; atteint pratiquement que &#224; l&#8217;aide
du r&#233;seau de cooccurrences, festin majoritairement par la carte s&#233;mantique LSA sur le corpus
litt&#233;raire.
</p>
<p>Cependant la couverture globale reste assez faible (33 % des associations permettent de retrou-
ver le TOT pour lequel elles ont &#233;t&#233; cit&#233;es). Ainsi nous nous sommes interrog&#233;s sur les cas o&#249;
au moins une ou deux, o&#249; toutes les associations, et o&#249; la premi&#232;re association donn&#233;e par un
utilisateur est une AU. On d&#233;nombre ainsi les groupes d&#8217;associations (5 associations propos&#233;es
par un utilisateurs pour un TOT) o&#249; N associations sont &quot;utiles&quot;. Ainsi le tableau 3 contient les
pourcentages de ces cas pour chaque TOT. Le pourcentage de cas o&#249; les 5 associations sont des
AU est de 0% dans la plupart des cas, ce qui exclut toute possibilit&#233; d&#8217;intersection entre les dif-
f&#233;rents r&#233;seaux de l&#8217;ensemble des associations propos&#233;es pour une combinaison des ressources.
Par ailleurs pour 80 % des TOT plus de 70% des groupes d&#8217;associations contiennent au moins
une AU. Les pourcentages de cas o&#249; la premi&#232;re association est &quot;utile&quot; sont &#224; consid&#233;rer en
regard des cas o&#249; au moins une association est &quot;utile&quot;. On constate alors que si pour des mots
comme landau ou veau la premi&#232;re association est presque toujours une AU, pour des mots
comme lion ou java ou entretien l&#8217;&#233;cart est important ce qui signifie que les AU viennent plut&#244;t
apr&#232;s la premi&#232;re.
</p>
<p>495</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON
</p>
<p>Mot % d&#8217;AU % cibles : N AU % cibles :
cible def ewn lsa coocc web total N &gt; 0 N &gt; 1 N = 5 1ere AU
veau 23,6 43,2 27,2 46,8 54 80,8 100 98 32 96
baril 0,8 0 0 26,8 24 36 86 62 0 60
casino 0 0 0 32 13,6 44,8 100 76 0 70
entretien 10 10,4 10 0 23,2 23,6 84 30 0 36
</p>
<p>cambriolage 0,8 12 0 0,4 11,6 24 72 38 0 40
java 0,4 0,8 0 0,4 4 4,8 24 0 0 0
</p>
<p>menhir 13,6 0 0 0 33,2 46,8 96 82 4 62
quiche 0 0 0 0 34,4 34,4 90 64 0 74
kleenex 0 0 0 0 15,2 15,2 72 2 0 50
lion 14,8 4 3,2 0,8 16 30 88 50 0 36
</p>
<p>brioche 0,4 0,4 0 0 39,6 40 94 70 0 52
facteur 1,2 1,2 0 13,6 2,4 17,6 74 12 0 28
festin 2,8 0,8 12,4 0 5,6 21,6 68 34 0 48
</p>
<p>chaussette 1,6 4,8 0 0 6,8 10 40 8 0 4
massif 1,2 15,6 0 19,2 4,8 38,8 92 68 2 52
virtuel 0 0 0 17,2 24 28,8 82 46 0 30
rugby 17,2 10,4 0 46,8 20,8 63,6 98 90 14 84
landau 0,4 10,4 0 0 29,6 30 98 50 0 84
</p>
<p>snowboard 5,2 0 0 0 0 5,2 26 0 0 6
oie 10,4 16,4 18 31,6 48,4 68,4 100 98 8 78
</p>
<p>Moyenne 5,22 6,52 3,54 11,78 20,56 33,22 79,2 48,9 3 49,5
</p>
<p>TAB. 3 &#8211; Pourcentages d&#8217;associations &quot;utiles&quot; (AU), parmi les 250 propos&#233;es pour chaque mot.
Les ressources sont les mots cl&#233;s du web (web), les mots cl&#233;s des d&#233;finitions (def), les liens
dans EuroWordNet (ewn), les liens dans la carte s&#233;mantique (lsa), et les liens dans le r&#233;seau
de cooccurrences (coocc). Pourcentages de TOT avec au moins une AU, au moins 2 AU, ou
exactement 5 AU, et pour lesquels la premi&#232;re association propos&#233;e est &quot;utile&quot;.
</p>
<p>4.3 Profils d&#8217;utilisateurs
</p>
<p>Nous faisons l&#8217;hypoth&#232;se que chaque personne utilise des voies d&#8217;acc&#232;s privil&#233;gi&#233;es en fonction
d&#8217;un profil cognitif, et que chacune de ces voies correspond &#224; une des cinq ressources propos&#233;es.
Nous supposons que s&#8217;il est possible de cat&#233;goriser automatiquement les donn&#233;es de chaque
personne, c&#8217;est que d&#8217;une part il existe des profils reconnaissables et d&#8217;autre part on doit les
prendre en compte.
</p>
<p>Afin de d&#233;terminer si l&#8217;on pouvait d&#233;gager des profils d&#8217;utilisateurs, nous avons effectu&#233; une
cat&#233;gorisation automatique des r&#233;partitions d&#8217;AU pour chaque ressource par utilisateurs en un
nombre de classes variable &#224; l&#8217;aide de l&#8217;algorithme K-Means impl&#233;ment&#233; dans la plate-forme
WEKA. On a ainsi pu obtenir dans la meilleure configuration trois classes de r&#233;partitions, dont
deux majoritaires qui se diff&#233;rencient essentiellement par la capacit&#233; de la ressource de mots cl&#233;s
du web &#224; retourner le TOT &#224; partir des associations propos&#233;es. La r&#233;partition des AU pour les 20
TOT de chaque utilisateur montre qu&#8217;on peut les s&#233;parer en deux classes. En effet pour chaque
utilisateur une majorit&#233; de ses associations appartient &#224; une des deux classes (33 utilisateurs
dans la classe favorisant les mots cl&#233;s web, et 17 dans l&#8217;autre).
</p>
<p>Cependant, la vari&#233;t&#233; des associations et ressources &quot;utiles&quot; est &#233;galement fortement li&#233;e aux
TOT eux m&#234;mes, comme le montrent les r&#233;sultats du tableau 3. Nous avons donc explor&#233;
une autre m&#233;thode afin de d&#233;finir s&#8217;il existe ou non des profils d&#8217;utilisateurs. Pour cela, nous
avons appliqu&#233; l&#8217;algorithme EM (Expectation-Maximization) sur les donn&#233;es comprenant pour
chaque utilisateur et chaque ressource le nombre total d&#8217;associations &quot;utiles&quot; parmi les 100 pro-
pos&#233;es pour les 20 mots r&#233;unis. On d&#233;finit 5 param&#232;tres, qui correspondent aux 5 ressources. Le
tableau 4 d&#233;crit la composition des 3 clusters propos&#233;s par l&#8217;algorithme, &#224; travers les moyennes
</p>
<p>496</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aide &#224; l&#8217;acc&#232;s lexical par combinaison de ressources linguistiques
</p>
<p>ressource : Cluster 1 Cluster 2 Cluster 3
attribut Moy. E.C. Moy. E.C. Moy. E.C.
web 20,6 3,1 25,2 2,3 13,6 2,6
def 4,6 1,4 6,9 2,2 4,3 1,6
ewn 5,9 1,9 9,4 1,6 3,7 1,3
lsa 3,7 1,1 4,5 1,4 1,8 1
</p>
<p>coocc 11,6 1,8 13,4 2,9 9,7 2
instances 48% 32% 20%
</p>
<p>TAB. 4 &#8211; Clusters propos&#233;es par l&#8217;algorithme Expectation-Maximization : valeurs moyennes et
&#233;cart type pour chaque attribut (pourcentage d&#8217;associations utiles par individu pour l&#8217;ensemble
des 20 mots, pour chaque ressource), et nombre d&#8217;instances attribu&#233;es &#224; chaque cluster.
</p>
<p>pour chaque attribut. L&#8217;&#233;cart type indique la consistance des donn&#233;es autour de ces moyennes.
</p>
<p>Les clusters d&#233;crits dans le tableau 4 montrent trois aspects de la prise en compte des ressources
pour un profil d&#8217;utilisateur. Tout d&#8217;abord le cluster 2 se distingue par une place plus importante &#224;
apporter aux ressources descriptives et paradigmatiques telles que les d&#233;finitions et EuroWord-
Net, alors que les individus du cluster 1 seront majoritairement aid&#233;s par les mots cl&#233;s du web
et les cooccurrences. Les individus du cluster 3 se caract&#233;risent essentiellement par leur incom-
patibilit&#233; avec l&#8217;ensemble des ressources s&#233;lectionn&#233;es, c&#8217;est &#224; dire que les scores sont faibles
pour toutes les ressources. Cependant, il faut noter que de ce fait les ressources sont &#224; prendre
en compte pratiquement sur un pied d&#8217;&#233;galit&#233;. Dans tous les cas cependant, la part accord&#233;e aux
associations reli&#233;es par les mots cl&#233;s sur le web sont &#224; prendre en compte en large majorit&#233;.
</p>
<p>5 Conclusions et perspectives
</p>
<p>L&#8217;&#233;valuation combin&#233;e des ressources propos&#233;es pour l&#8217;aide &#224; l&#8217;acc&#232;s lexical dans le cadre de la
recherche du TOT dans des listes de mots obtenues &#224; partir d&#8217;associations montre qu&#8217;elles sont
fortement compl&#233;mentaires. Cependant le taux de rappel global (nombre d&#8217;AU par rapport au
nombre total d&#8217;associations propos&#233;es) n&#8217;est que de 33%, ce qui implique qu&#8217;une combinaison
des ressources devra &#234;tre capable de s&#233;lectionner les associations utiles, puis en extraire le TOT.
Dans 79% des exemples du corpus les TOT sont accessibles via au moins une AU, ce qui est la
limite maximum du rappel que pourra avoir un syst&#232;me combinant les ressources s&#233;lectionn&#233;es.
</p>
<p>Les relations syntagmatiques obtenues &#224; l&#8217;aide des premi&#232;res pages retourn&#233;es par Google sont
les plus riches en termes de rappel global (21%), ce qui ne signifie pas n&#233;cessairement que la
technique d&#8217;extraction est performante mais plut&#244;t que le corpus repr&#233;sent&#233; par les pages du
Web est peut &#234;tre plus pertinent. De la m&#234;me mani&#232;re, le faible rappel de la carte s&#233;mantique
apprise &#224; l&#8217;aide de LSA (3,54%) ne remet absolument pas en cause la qualit&#233; de la m&#233;thodologie,
mais doit &#234;tre imput&#233; &#224; la nature du corpus &#224; partir duquel la ressource est construite. Nous
n&#8217;avons pas encore &#233;valu&#233; les m&#233;thodologies d&#8217;extraction de relations syntagmatiques, et cela
pourra &#234;tre int&#233;ressant afin de s&#233;lectionner la repr&#233;sentation la plus adapt&#233;e &#224; chaque nature de
corpus, et ainsi am&#233;liorer le rappel global.
</p>
<p>D&#8217;autre part, les associations propos&#233;es n&#8217;ont pas &#233;t&#233; caract&#233;ris&#233;es d&#8217;un point de vue psycho-
logique, mais intuitivement on remarque des tendances. Par exemple, beaucoup d&#8217;associations
sont des noms de couleurs, ce qui sugg&#232;re des associations s&#233;mantiques visuelles plus que
verbales. De la m&#234;me mani&#232;re 18 personnes ont associ&#233; le mot chien au mot facteur, ce qui
correspond plus &#224; une image de carte postale ou de film (o&#249; le facteur se fait mordre) qu&#8217;&#224; un
</p>
<p>497</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurianne SITBON
</p>
<p>r&#233;el lien s&#233;mantique.
</p>
<p>Le principal probl&#232;me qui reste en suspens est comment peut-on pond&#233;rer les listes de mots
issues de chaque r&#233;seau pour parvenir &#224; une liste unique ordonn&#233;e, sachant qu&#8217;on ne peut pr&#233;-
senter qu&#8217;une dizaine de mots ou expressions &#224; l&#8217;utilisateur pour rester raisonnable en termes
d&#8217;ergonomie. Au del&#224; de scores de pertinence ou de caract&#233;risation des relations disponibles
dans les ressources, les mots concern&#233;s par le TOT &#233;tant essentiellement des mots peu fr&#233;quents,
on peut pond&#233;rer les mots propos&#233;s en fonction de leur fr&#233;quence. Etant donn&#233; la possibilit&#233; de
d&#233;finir des profils utilisateurs, il est peut &#234;tre &#233;galement possible de pond&#233;rer les mots propo-
s&#233;s en fonction de la ressource dont ils sont issus, et d&#8217;apprendre ces param&#232;tre de mani&#232;re
empirique. La pond&#233;ration doit aussi prendre en compte l&#8217;appartenance du mot propos&#233; &#224; la
s&#233;mantique globale d&#233;gag&#233;e par les associations propos&#233;es, ce qui reviendrait &#224; d&#233;sambigu&#239;ser
les associations.
</p>
<p>R&#233;f&#233;rences
BROWN R. &amp; MCNEILL D. (1966). The tip of the tongue phenomenon. Journal of verbal
learning and verbal behaviour, 5, 325&#8211;337.
BURKE D. M. &amp; SHAFTO M. A. (2004). Aging and language production. American psucho-
logical society, 13(1), 21&#8211;24.
CHURCH K. &amp; HANKS P. (1990). Word association norms, mutual information , and lexico-
graphy. Computational Linguistics, 16(1), 177&#8211;210.
DEERWESTER S., DUMAIS S. T., FURNAS G. W., LANDAUER T. K. &amp; HARSHMAN R.
(1990). Indexing by latent semantic analysis. Journal of the American Society for Information
Science, 41(6), 391&#8211;407.
DELL G. S. (1986). A spreading-activation theory of retrieval in sentence production. Psy-
chological review, 93, 283&#8211;321.
FAUST M. &amp; SHARFSTEIN-FRIEDMAN S. (2003). Naming difficulties in adolescents with
dyslexia : application of the tip-of-the-tongue paradigm. Brain and cognition, 53(2), 211&#8211;217.
FERRET O. &amp; ZOCK M. (2006). Enhancing electronic dictionaries with an index based on
associations. In Coling/ACL joint conference, Sydney, Australia.
JI H., PLOUX S. &amp; WEHRLI . E. (2003). Lexical knowledge representation with contexto-
nyms. In MT Summit IX, New Orleans, USA.
JOYCE T. (2005). Constructing a large-scale database of japanese word associations. Glotto-
metrics, 10, 82&#8211;98.
LANDAUER T., FOLTZ P. W. &amp; LAHAM . D. (1998). Introduction to latent semantic analysis.
Discourse Processes, 25, 259&#8211;284.
LORTAL G., GRAU B. &amp; ZOCK M. (2004). Syst&#232;me d&#8217;aide &#224; l&#8217;acc&#232;s lexical : trouver le mot
qu&#8217;on a sur le bout de la langue. In TALN&#8217;04, p. 259&#8211;268.
REUER V. (2004). Language resources for a network-based dictionary. In Workshop on En-
hancing and Using Electronic Dictionaries ; following COLING 2004, p. 81&#8211;84.
ZOCK M. (2002). Sorry, but what was your name again, or, how to overcome the tip-of-the
tongue problem with the help of a computer ? In COLING-Workshop on building and using
semantic networks, Taipei, Taiwan.
</p>
<p>498</p>

</div></div>
</body></html>