<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Rep&#233;rage automatique de g&#233;n&#233;riques dans les d&#233;finitions terminographiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>Rep&#233;rage automatique de g&#233;n&#233;riques 
 dans les d&#233;finitions terminographiques
</p>
<p>Selja SEPP&#196;L&#196;
Laboratoire de terminologie/TIM/ETI &#8211; Universit&#233; de Gen&#232;ve 
</p>
<p>Bd du Pont-d&#8217;Arve 40, 1211 Gen&#232;ve 4 
selja.seppala@eti.unige.ch
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente une proc&#233;dure de rep&#233;rage et de balisage de l&#8217;&#233;l&#233;ment 
g&#233;n&#233;rique de la d&#233;finition terminographique exploitant les caract&#233;ristiques formelles du 
sous-langage d&#233;finitoire. La proc&#233;dure, qui comporte quatre &#233;tapes, constitue l&#8217;une des 
sous-t&#226;ches d&#8217;un analyseur (semi-)automatique de la structure conceptuelle des d&#233;finitions 
terminographiques, destin&#233; &#224; faciliter l&#8217;annotation d&#8217;un corpus en vue de l&#8217;&#233;tude de 
r&#233;gularit&#233;s dans cette structure. La t&#226;che d&#233;crite consiste &#224; mettre au point un syst&#232;me 
d&#8217;annotation automatique bas&#233; sur le rep&#233;rage d&#8217;indices morphosyntaxiques, sans recourir &#224; 
d&#8217;autres ressources linguistiques informatis&#233;es. 
</p>
<p>Abstract. This article presents a procedure to locate and tag the generic elements of 
terminographic definitions, taking advantage of the formal characteristics of the definition 
sublanguage. This four step procedure is part of a larger (semi-)automatic parser of the 
conceptual structure of terminographic definitions, intended to ease the tagging of a corpus 
for studying conceptual regularities in definition structure. The method involves the 
development of an automatic tagging system, based on the identification of morphosyntactic 
boundary markers, which does not require the use of additional linguistic resources. 
</p>
<p>Mots-cl&#233;s : d&#233;finition terminographique, annotation automatique, rep&#233;rage de fronti&#232;re, 
indices morphosyntaxiques, sous-langage. 
</p>
<p>Keywords : terminographic definition, automatic tagging, boundary location, 
morphosyntactic markers, sublanguage. 
</p>
<p>1 Introduction
La pr&#233;sente communication s&#8217;inscrit dans le cadre d&#8217;une recherche en terminologie portant 
sur l&#8217;analyse de la structure conceptuelle de d&#233;finitions terminographiques &#224; travers l&#8217;&#233;tude 
d&#8217;un corpus de d&#233;finitions annot&#233; (Sepp&#228;l&#228;, 2004, 2005). L&#8217;un des objets de notre travail est 
la conception d&#8217;un analyseur (semi-)automatique de cette structure conceptuelle, qui facilite 
l&#8217;annotation du corpus en automatisant le plus grand nombre de t&#226;ches. Nous pr&#233;sentons ici 
l&#8217;une des &#233;tapes de l&#8217;annotation du corpus, &#224; savoir la mise en place d&#8217;une proc&#233;dure de 
</p>
<p>447</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Selja SEPP&#196;L&#196;
</p>
<p>rep&#233;rage et de balisage automatique des g&#233;n&#233;riques (GEN) des d&#233;finitions en compr&#233;hension, 
le g&#233;n&#233;rique &#233;tant l&#8217;&#233;l&#233;ment qui rattache le concept d&#233;fini &#224; un concept plus g&#233;n&#233;ral (souvent 
le genre prochain). La t&#226;che d&#233;crite dans cet article est bas&#233;e sur un traitement qui exploite 
les caract&#233;ristiques du sous-langage des d&#233;finitions (Barnbrook, 2002). L&#8217;impl&#233;mentation, en 
vue d&#8217;un balisage automatique des GEN des d&#233;finitions, est faite &#224; l&#8217;aide d&#8217;un programme 
Perl o&#249; les r&#232;gles de rep&#233;rage sont exprim&#233;es sous la forme d&#8217;expressions r&#233;guli&#232;res.  
</p>
<p>Apr&#232;s une br&#232;ve pr&#233;sentation de la d&#233;finition terminographique, de sa structure g&#233;n&#233;rale et de 
l&#8217;&#233;l&#233;ment g&#233;n&#233;rique (section 2), nous passons &#224; l&#8217;identification du probl&#232;me, afin de mieux 
cerner la t&#226;che &#224; accomplir (section 3). Nous abordons ensuite la description de l&#8217;exp&#233;rience &#224; 
proprement parler. Dans cette partie plus empirique, nous pr&#233;sentons tout d&#8217;abord les corpus 
utilis&#233;s (section 4), puis la m&#233;thode qui a &#233;t&#233; mise en place (section 5), pour terminer par une 
&#233;valuation des performances de la proc&#233;dure (section 6). En conclusion, nous &#233;voquons les 
limites de cette m&#233;thode et quelques perspectives futures. 
</p>
<p>2 La d&#233;finition terminographique 
En terminographie, les d&#233;finitions servent &#224; d&#233;crire et distinguer les concepts d&#8217;un domaine 
(ou syst&#232;me conceptuel) sp&#233;cialis&#233;, plus ou moins clos, o&#249; les concepts entretiennent des 
relations g&#233;n&#233;ralement hi&#233;rarchiques. Elles consistent, dans la tr&#232;s grande majorit&#233; des cas, en 
une d&#233;finition en compr&#233;hension1. Une d&#233;finition en compr&#233;hension est compos&#233;e, comme 
l&#8217;illustre l&#8217;exemple ci-dessous, d&#8217;une seule phrase o&#249; le GEN est suivi d&#8217;un ou de plusieurs 
sp&#233;cifiques (SPE). Le SPE a pour fonction de pr&#233;ciser la port&#233;e du GEN en &#233;num&#233;rant les 
traits ou propri&#233;t&#233;s du concept d&#233;fini, tout en distinguant ce dernier des autres concepts du 
domaine auquel il appartient. 
</p>
<p>Ex : peptidyl-transf&#233;rase = GENEnzyme SPE1situ&#233;e dans le ribosome, SPE2qui lie successivement un 
acide amin&#233; suppl&#233;mentaire &#224; la cha&#238;ne polypeptidique en cours d'&#233;longation.
</p>
<p>La forme de ce type de d&#233;finitions est relativement contrainte : elle se compose d&#8217;une seule 
phrase, o&#249; le GEN pr&#233;c&#232;de g&#233;n&#233;ralement le(s) SPE. Parfois, le GEN peut &#234;tre pr&#233;c&#233;d&#233; d&#8217;un 
adjectif &#8211; consid&#233;r&#233; ici comme SPE &#8211;, mais cela reste assez rare en fran&#231;ais. &#192; l&#8217;exception de 
ces cas de figure facilement identifiables, une d&#233;finition respectant les conventions de 
r&#233;daction terminographiques g&#233;n&#233;ralement admises (rappel&#233;es dans Sepp&#228;l&#228;, 2004, 2006) ne 
devrait pas &#234;tre pr&#233;c&#233;d&#233;e d&#8217;un SPE en fran&#231;ais. 
</p>
<p>Selon notre sch&#233;ma d&#8217;analyse2, chaque d&#233;finition est segment&#233;e en GEN et en SPE ; ces 
&#233;l&#233;ments sont ensuite annot&#233;s avec des &#233;tiquettes conceptuelles. La segmentation et 
l&#8217;annotation sont r&#233;alis&#233;es en XML, le but &#233;tant d&#8217;automatiser ces op&#233;rations au maximum. 
L&#8217;exemple suivant montre une version annot&#233;e de la fiche terminologique du concept 
peptidyl-transf&#233;rase.
</p>
<p>1  97 % d&#8217;un corpus &#233;tudi&#233; lors d&#8217;une pr&#233;c&#233;dente exp&#233;rience (Sepp&#228;l&#228;, 2004, 2005), le reste &#233;tant des 
d&#233;finitions en extension. &#201;tant donn&#233; notre t&#226;che, nous excluons de cette &#233;tude ces d&#233;finitions, qui se 
composent d&#8217;une &#233;num&#233;ration d&#8217;esp&#232;ces isonymes et n&#8217;ont donc pas de g&#233;n&#233;rique. 
</p>
<p>2  Plusieurs niveaux d&#8217;analyse sont possibles selon la granularit&#233; voulue (Barnbrook, 2002). Pour plus de 
d&#233;tails sur celui que nous avons adopt&#233;, voir (Sepp&#228;l&#228;, 2004). 
</p>
<p>448</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage automatique de g&#233;n&#233;riques dans les d&#233;finitions terminographiques 
</p>
<p>Ex : &lt;FICHE langue=&quot;FR&quot;&gt; 
&lt;NI&gt;25&lt;/NI&gt;
&lt;CM&gt;biosynth&#232;se des prot&#233;ines&lt;/CM&gt; 
&lt;VE&gt;peptidyl-transf&#233;rase&lt;/VE&gt;
&lt;DF&gt;&lt;GEN relation_VE=&quot;GENRE&quot; 
classe_conceptuelle=&quot;NATUREL&quot;&gt;Enzyme &lt;/GEN&gt; 
&lt;SPE relation_GEN=&quot;SPATIAL&quot;&gt;situ&#233;e dans le ribosome,&lt;/SPE&gt; 
&lt;SPE relation_GEN=&quot;FONCTION&quot;&gt;qui lie successivement un acide 
amin&#233; suppl&#233;mentaire &#224; la cha&#238;ne polypeptidique en cours 
d'&#233;longation.&lt;/SPE&gt;&lt;/DF&gt;
&lt;/FICHE&gt;3
</p>
<p>L&#8217;&#233;l&#233;ment g&#233;n&#233;rique de la d&#233;finition, &#233;galement appel&#233; incluant, a pour fonction de rattacher 
le concept d&#233;fini &#224; un concept plus g&#233;n&#233;ral. Sa forme pr&#233;sente un certain nombre de 
variations, n&#233;anmoins limit&#233;es et r&#233;guli&#232;res. Le plus souvent il est constitu&#233; d&#8217;un seul mot4.
Lorsque le GEN n&#8217;est pas un mot unique, il peut prendre la forme d&#8217;un terme complexe form&#233; 
de deux mots ou plus (Acide nucl&#233;ique ou Mesures ou ouvrages), d&#8217;un syntagme nominal 
(Triplet de nucl&#233;otides) ou encore d&#8217;un faux incluant5 commen&#231;ant par un marqueur 
relationnel (Partie de&#8230; ou Ensemble de&#8230;), dont la liste est relativement restreinte et qui 
permet d&#8217;annoter le GEN avec la relation conceptuelle (PARTIE, TOUT, GENRE ou GENRE 
PROCHAIN) qui l&#8217;unit au d&#233;fini. Dans ce cas, c&#8217;est l&#8217;ensemble &#171; marqueur + mot ou 
syntagme &#187; qui constitue le GEN. Dans les deux cas, le GEN peut comporter une autre entr&#233;e 
du domaine (environ 50 % du corpus d&#8217;entra&#238;nement). En effet, les concepts d&#233;finis en 
terminographie s&#8217;ins&#232;rent g&#233;n&#233;ralement dans un syst&#232;me conceptuel hi&#233;rarchis&#233;, o&#249; le concept 
superordonn&#233; peut servir de g&#233;n&#233;rique &#224; la d&#233;finition du concept subordonn&#233;. Ceci se traduit, 
linguistiquement parlant, par la reprise dans le GEN, de l&#8217;un des termes ou synonymes (l&#8217;une 
des vedettes) d&#233;signant ce concept, comme le montre l&#8217;exemple suivant, o&#249; la vedette (acide
nucl&#233;ique) du concept superordonn&#233; devient le GEN de la d&#233;finition du concept subordonn&#233; 
(acide ribonucl&#233;ique).
</p>
<p>Ex : acide nucl&#233;ique = Mol&#233;cule constitu&#233;e d&#8217;un encha&#238;nement de nucl&#233;otides dispos&#233; le 
long d&#8217;un brin ou deux. 
acide ribonucl&#233;ique = Acide nucl&#233;ique form&#233; d&#8217;un seul brin et participant &#224; toutes les 
&#233;tapes de la synth&#232;se des prot&#233;ines.
</p>
<p>Dans le cas des d&#233;finitions d&#8217;adjectifs, peu fr&#233;quentes, c&#8217;est l&#8217;expression du type Se dit de&#8230;
qui est consid&#233;r&#233;e comme &#233;tant le GEN de la d&#233;finition. Ainsi le GEN pr&#233;sente des r&#233;gularit&#233;s 
marqu&#233;es qui contribuent &#224; faire du discours d&#233;finitoire un sous-langage sp&#233;cifique 
(Barnbrook, 2002). 
</p>
<p>3  NI = num&#233;ro d&#8217;identification unique ; CM = domaine ; VE = vedette (terme ou synonyme) ; DF = d&#233;finition ; 
GEN = g&#233;n&#233;rique ; SPE = sp&#233;cifique ; relation_VE = relation conceptuelle entre le GEN et la VE ; 
relation_GEN = relation conceptuelle entre le SPE et le GEN. 
</p>
<p>4  Nous entendons par mot, une cha&#238;ne de caract&#232;res suivie d&#8217;un espace. 
5  On trouve le faux incluant dans cinq types de situation : lorsque la chose est d&#233;finie par ses parties ; lorsqu&#8217;il 
</p>
<p>y a d&#233;finition de la chose transform&#233;e ; lorsque la chose est d&#233;finie par sa cause ou sa cons&#233;quence ; lorsque 
l&#8217;incluant marque le rapport de la chose &#224; l&#8217;unit&#233; ; et lorsqu&#8217;il y a faux incluant d&#8217;existence 
(Rey-Debove, 1971).  
</p>
<p>449</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Selja SEPP&#196;L&#196;
</p>
<p>3 Identification de la t&#226;che 
Notre t&#226;che est de rep&#233;rer le g&#233;n&#233;rique de la d&#233;finition et de le marquer, de part et d&#8217;autre, 
avec les balises XML suivantes : &lt;GEN relation_VE=&quot;&#8230;&quot;&gt;xxxxx&lt;/GEN&gt;. Le contenu 
du GEN n&#8217;&#233;tant pas en cause, la question revient par cons&#233;quent &#224; d&#233;terminer la fronti&#232;re qui 
s&#233;pare le GEN du ou des SPE adjacent(s), selon qu&#8217;il est ou non pr&#233;c&#233;d&#233; de cet &#233;l&#233;ment. Dans 
la grande majorit&#233; des cas, le GEN se trouve en effet en d&#233;but de d&#233;finition 
terminographique ; il correspond m&#234;me souvent au premier mot de la phrase (env. 70 % des 
GEN de notre corpus d&#8217;entra&#238;nement ; 97 % du corpus d&#8217;&#233;valuation). On sait, par ailleurs, 
qu&#8217;un GEN est toujours suivi d&#8217;un SPE (en terminologie). Suivant le m&#234;me constat que 
(Barnbrook, 2002), nous pouvons dire que la principale difficult&#233; consiste donc &#224; rep&#233;rer sa 
limite &#224; droite, plus exactement la fronti&#232;re qui le s&#233;pare du premier SPE. Nous proposons 
d&#8217;exploiter les r&#233;gularit&#233;s du discours d&#233;finitoire en identifiant ces fronti&#232;res (d&#233;but et fin de 
GEN) &#224; l&#8217;aide de marqueurs morphosyntaxiques, lesquels peuvent ensuite &#234;tre traduits en 
r&#232;gles de rep&#233;rage sous la forme d&#8217;expressions r&#233;guli&#232;res. 
</p>
<p>La constitution d&#8217;une liste de marqueurs morphosyntaxiques n&#233;cessite une &#233;tude d&#233;taill&#233;e des 
principales caract&#233;ristiques des GEN et des SPE ant&#233;pos&#233;s, ainsi que du d&#233;but (limite &#224; 
gauche) des SPE qui viennent imm&#233;diatement apr&#232;s le GEN. Pour ce faire, nous avons eu 
recours, d&#8217;une part, &#224; la litt&#233;rature (Iris, et al., 1988, Iso, 2000, L'homme, 2003, 
Rebeyrolle, 2000, etc.) et, d&#8217;autre part, &#224; un corpus pr&#233;alablement annot&#233; &#224; la main (voir 
section 4), afin d&#8217;y rep&#233;rer les r&#233;gularit&#233;s susceptibles de servir d&#8217;indices de rep&#233;rage. 
L&#8217;identification des marqueurs peut &#234;tre r&#233;alis&#233;e manuellement et/ou automatiquement, par 
des m&#233;thodes d&#8217;apprentissage automatique. Dans la mesure o&#249; le discours d&#233;finitoire 
constitue un sous-langage relativement contraint, pr&#233;sentant peu de variations, notamment au 
niveau des &#233;l&#233;ments morphosyntaxiques marquant la fronti&#232;re entre les &#233;l&#233;ments de la 
d&#233;finition (Barnbrook, 2002), nous avons opt&#233; pour un rep&#233;rage manuel assist&#233; d&#8217;un 
concordancier. L&#8217;identification d&#8217;indices peut &#233;galement faire intervenir des traitements 
pr&#233;alables (Vossen, et al., 1989), comme un &#233;tiquetage morphosyntaxique ou une 
lemmatisation ; la grande r&#233;gularit&#233; du discours d&#233;finitoire nous a l&#224; encore permis de nous en 
tenir &#224; une m&#233;thode simple, bas&#233;e sur les seuls &#233;l&#233;ments de surface, c&#8217;est-&#224;-dire sur des 
cha&#238;nes de caract&#232;res. 
</p>
<p>Une fois les marqueurs identifi&#233;s et traduits en r&#232;gles de rep&#233;rage, il convient de mettre au 
point une proc&#233;dure d&#8217;&#233;tiquetage qui n&#8217;applique qu&#8217;une seule r&#232;gle par d&#233;finition, afin 
d&#8217;&#233;viter les erreurs d&#8217;annotation. Deux param&#232;tres sont pris en compte : 
</p>
<p>x la hi&#233;rarchisation des &#233;tapes et des r&#232;gles d&#8217;analyse de la plus sp&#233;cifique &#224; la plus 
g&#233;n&#233;rale, de fa&#231;on &#224; ce qu&#8217;elles entrent le moins possible en conflit entre elles, et 
</p>
<p>x la recherche syst&#233;matique des vedettes (VE) de la base terminologique en d&#233;but de 
d&#233;finition, afin de pouvoir les inclure le cas &#233;ch&#233;ant dans les GEN (&#233;tape appel&#233;e 
&#171; GEN=VE &#187;). 
</p>
<p>Selon ces constats, le rep&#233;rage des SPE ant&#233;pos&#233;s doit avoir pr&#233;s&#233;ance sur l&#8217;application des 
r&#232;gles de rep&#233;rage des GEN comprenant une VE, laquelle se doit de pr&#233;c&#233;der la recherche de 
la fin du GEN lorsqu&#8217;on ne conna&#238;t pas son contenu, c&#8217;est-&#224;-dire tous les autres cas. Pour 
terminer, il y a lieu d&#8217;&#233;valuer la performance de ce syst&#232;me et d&#8217;envisager des pistes 
d&#8217;am&#233;lioration. 
</p>
<p>450</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage automatique de g&#233;n&#233;riques dans les d&#233;finitions terminographiques 
</p>
<p>4 Pr&#233;sentation des corpus 
Les exp&#233;riences r&#233;alis&#233;es dans le cadre de cette &#233;tude portent sur deux corpus distincts : un 
corpus d&#8217;entra&#238;nement et un corpus d&#8217;&#233;valuation. Le premier a servi &#224; identifier les indices de 
rep&#233;rage des GEN et les marqueurs pour chaque relation conceptuelle, ainsi qu&#8217;&#224; tester, 
affiner et hi&#233;rarchiser les r&#232;gles de rep&#233;rage, de fa&#231;on &#224; obtenir la meilleure performance 
possible. Il s&#8217;agit d&#8217;un &#233;chantillon de 490 d&#233;finitions en compr&#233;hension tir&#233;es de la Banque 
de terminologie du canton de Berne (Lingua-PC), o&#249; chaque d&#233;finition a &#233;t&#233; pr&#233;alablement 
segment&#233;e et annot&#233;e &#224; la main en GEN et en SPE6. Le second corpus a &#233;t&#233; utilis&#233; pour tester 
la performance g&#233;n&#233;rale de la proc&#233;dure d&#8217;annotation propos&#233;e. Il s&#8217;agit d&#8217;un ensemble de 
92 d&#233;finitions extraites d&#8217;un glossaire sur la Terminologie de la biosynth&#232;se des prot&#233;ines 
chez les cellules eucaryotes (Bourjault, 2005). Les deux corpus respectent les conventions de 
r&#233;daction terminographiques et remplissant les crit&#232;res de bonne formation. 
</p>
<p>5 Description du syst&#232;me 
Dans cette partie, nous pr&#233;sentons l&#8217;architecture g&#233;n&#233;rale du syst&#232;me et une synth&#232;se de ses 
principales &#233;tapes, en nous concentrant plus sp&#233;cifiquement sur les difficult&#233;s qu&#8217;elles posent. 
Comme nous l&#8217;avons d&#233;j&#224; soulign&#233;, les diff&#233;rentes &#233;tapes du traitement doivent &#234;tre 
ordonn&#233;es pour &#233;viter les conflits de r&#232;gles. Nous distinguons quatre types de t&#226;ches &#224; r&#233;aliser 
dans l&#8217;ordre suivant : rep&#233;rage des SPE ant&#233;pos&#233;s et marquage des balises de d&#233;but de GEN 
(section 5.1) ; rep&#233;rage d&#8217;&#233;ventuelles vedettes dans les g&#233;n&#233;riques (GEN=VE) (section 5.2) ; 
rep&#233;rage des fin de GEN (section 5.3) ; et finalement, marquage du premier mot des 
d&#233;finitions non trait&#233;es au cours des &#233;tapes pr&#233;c&#233;dentes (section 5.4).
</p>
<p>5.1 Rep&#233;rage des sp&#233;cifiques ant&#233;pos&#233;s et marquage du d&#233;but du GEN 
</p>
<p>Le rep&#233;rage d&#8217;&#233;ventuels sp&#233;cifiques ant&#233;pos&#233;s et l&#8217;insertion des balises de d&#233;but de GEN 
doivent pr&#233;c&#233;der les autres &#233;tapes du traitement, au risque d&#8217;engendrer des probl&#232;mes de 
rep&#233;rage des GEN. Une vedette utilis&#233;e en tant que g&#233;n&#233;rique pourrait, par exemple, ne pas 
&#234;tre rep&#233;r&#233;e, simplement parce qu&#8217;elle est pr&#233;c&#233;d&#233;e d&#8217;un SPE. Cette t&#226;che consiste &#224; assigner 
aux SPE ant&#233;pos&#233;s les balises &lt;SPE&gt;xxxxx&lt;/SPE&gt;&lt;GEN&gt;. La derni&#232;re balise, qui est 
&#233;galement ajout&#233;e au d&#233;but de toutes les autres d&#233;finitions, marque le d&#233;but du GEN et est 
n&#233;cessaire pour que les r&#232;gles suivantes puissent &#234;tre uniform&#233;ment appliqu&#233;es &#224; l&#8217;ensemble 
des d&#233;finitions. Les SPE ant&#233;pos&#233;s peuvent &#234;tre de deux types &#8211; adjectifs et indication de 
domaine &#8211;, dont les caract&#233;ristiques formelles susceptibles de servir d&#8217;indice &#224; leur rep&#233;rage 
sont ais&#233;ment identifiables et peu nombreuses. 
</p>
<p>1. Adjectifs : La nature non indexicale, objective et factuelle des d&#233;finitions 
terminographiques implique qu&#8217;en fran&#231;ais, la liste des adjectifs ant&#233;posables pouvant 
servir de marqueur de SPE ant&#233;pos&#233; est relativement r&#233;duite. Le corpus d&#8217;entra&#238;nement, 
par exemple, ne fait &#233;tat que d&#8217;adjectifs num&#233;raux ordinaux (premi&#232;re, deuxi&#232;me, etc.) 
et de quelques adjectifs qualificatifs (grand, petit, etc.) ou de leurs superlatifs. 
Formellement parlant, ces adjectifs donnent lieu &#224; deux types de SPE ant&#233;pos&#233;s :  
</p>
<p>6  Pour une description plus d&#233;taill&#233;e du corpus et de l&#8217;annotation conceptuelle, voir (Sepp&#228;l&#228;, 2004, 2005). 
</p>
<p>451</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Selja SEPP&#196;L&#196;
</p>
<p>x Le premier consiste en un adjectif qui peut &#234;tre pr&#233;c&#233;d&#233; d&#8217;un superlatif absolu et qui 
est imm&#233;diatement suivi du GEN. 
Ex : &lt;SPE&gt; (superlatif absolu)7 + adj. &lt;/SPE&gt; + &lt;GEN&gt;
</p>
<p>&#159; tr&#232;s grand [vaisseau] ou premi&#232;re [phase]
</p>
<p>x Le second consiste en un adjectif, superlatif relatif ou num&#233;ral ordinal, pr&#233;c&#233;d&#233; d&#8217;un 
article d&#233;fini et &#233;ventuellement d&#8217;un comparatif, et suivi d&#8217;un article ind&#233;fini et 
&#233;ventuellement d&#8217;un nombre. 
Ex : &lt;SPE&gt; art. d&#233;fini + (comparatif) + adj. + art. ind&#233;fini + (nombre) &lt;/SPE&gt; + &lt;GEN&gt;
</p>
<p>&#159; le plus grand des [singes] ou la premi&#232;re des trois [&#233;tapes] 
</p>
<p>2. Indication de domaine : Dans les bases de donn&#233;es terminologiques, l&#8217;indication du 
domaine et des sous-domaines se fait dans un champ d&#8217;indexation propre. Or, ce type 
d&#8217;indication appara&#238;t parfois en d&#233;but de d&#233;finition, souvent pour restreindre la port&#233;e 
du concept d&#233;fini &#224; un sous-domaine plus sp&#233;cifique. Une d&#233;finition bien form&#233;e ne 
devrait pas inclure ce type d&#8217;&#233;l&#233;ment, mais un analyseur automatique de d&#233;finitions doit 
n&#233;anmoins pr&#233;voir ces cas de figure. La forme de cette indication est, elle aussi, tr&#232;s 
contrainte : elle commence par une pr&#233;position, suivie d&#8217;un ou de plusieurs mots, et se 
termine par une virgule. 
Ex : &lt;SPE&gt; En | Dans | Sur + mot (s) quelconque(s) + virgule &lt;/SPE&gt; + &lt;GEN&gt;
</p>
<p>&#159; En droit constitutionnel,&#8230; ou Sur une locomotive,&#8230;
</p>
<p>5.2 Rep&#233;rage des g&#233;n&#233;riques incluant une vedette 
</p>
<p>La deuxi&#232;me &#233;tape consiste &#224; v&#233;rifier si le GEN reprend l&#8217;un des termes du domaine. Pour ce 
faire, toutes les vedettes de la base sont extraites dans une liste (18080 termes dans le corpus 
d&#8217;entra&#238;nement), qui doit &#234;tre tri&#233;e par ordre alphab&#233;tique, du terme le plus long au plus court, 
afin d&#8217;&#233;viter que certains &#233;l&#233;ments des termes complexes ne soient exclus du GEN. 
L&#8217;exemple suivant montre la s&#233;quence &#224; respecter pour les termes complexes d&#233;riv&#233;s d&#8217;une 
m&#234;me base lexicale : traitement annuel d&#233;terminanto traitement annuelo traitement. Le 
programme v&#233;rifie ainsi pour chaque VE si elle appara&#238;t en d&#233;but de d&#233;finition ou &#224; la suite 
d&#8217;une expression relationnelle. Si c&#8217;est le cas, l&#8217;&#233;l&#233;ment correspondant est marqu&#233; comme 
GEN et se voit attribuer la relation GENRE PROCHAIN ou celle qui correspond au marqueur 
de relation qui le pr&#233;c&#232;de ; sinon, la d&#233;finition est remise dans le circuit pour &#234;tre trait&#233;e par 
l&#8217;une des r&#232;gles pr&#233;sent&#233;es dans la section suivante. Le d&#233;veloppement de cette t&#226;che pr&#233;sente 
deux types de difficult&#233;s. 
</p>
<p>1. Deux VE pour un m&#234;me GEN : Il arrive que le programme rep&#232;re une VE plus longue 
alors que la plus courte existe aussi dans la liste et que c&#8217;est celle-l&#224; qu&#8217;il aurait 
convenu de marquer : la liste contient par exemple les trois VE cr&#233;dit de paiement,
cr&#233;dit d&#8217;engagement et cr&#233;dit. Si la d&#233;finition commence par Cr&#233;dit de paiement ou 
d&#8217;engagement&#8230;, le programme rep&#232;re tout d&#8217;abord cr&#233;dit de paiement et le marque 
comme GEN. Or, il serait dans ce cas plus ad&#233;quat, soit de ne retenir que cr&#233;dit et de 
consid&#233;rer les deux &#233;l&#233;ments suivants comme un SPE pr&#233;cisant la nature de ce cr&#233;dit, 
soit de marquer les deux comme composant un seul GEN. 
</p>
<p>7  Les parenth&#232;ses marquent les &#233;l&#233;ments optionnels ; le &#171; | &#187; s&#233;pare diff&#233;rentes variantes ; et les crochets 
indiquent le GEN. 
</p>
<p>452</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage automatique de g&#233;n&#233;riques dans les d&#233;finitions terminographiques 
</p>
<p>2. Traitement des pluriels : Les termes en vedette sont g&#233;n&#233;ralement sous la forme 
canonique, donc au singulier. La liste des VE prise en entr&#233;e du programme comporte 
donc principalement cette forme. Dans un GEN, ces termes peuvent en revanche 
appara&#238;tre au pluriel, ce qui n&#8217;a pas d&#8217;incidence lorsque, pour des questions d&#8217;usage 
(certains termes ne s&#8217;utilisent qu&#8217;au pluriel), ils figurent d&#233;j&#224; au pluriel dans la base. 
C&#8217;est en revanche plus probl&#233;matique lorsqu&#8217;il faut rep&#233;rer la forme plurielle d&#8217;une VE 
au singulier, en particulier dans les cas de pluriels irr&#233;guliers, mais surtout dans ceux 
des mots compos&#233;s. Notons toutefois que le taux d&#8217;erreurs dues &#224; ce type de cas devrait 
rester tr&#232;s faible et qu&#8217;il peut &#234;tre ais&#233;ment r&#233;duit dans la mesure o&#249;, dans des 
d&#233;finitions bien form&#233;es, seuls les termes qui suivent une expression relationnelle 
tendent &#224; appara&#238;tre au pluriel, et que ces cas sont pris en charge par les r&#232;gles plus 
g&#233;n&#233;rales de la troisi&#232;me &#233;tape. 
Lors du d&#233;veloppement, nous avons tout de m&#234;me constat&#233; que le fait de pr&#233;voir le 
rep&#233;rage de VE suivies de la marque du pluriel la plus g&#233;n&#233;rale, &#224; savoir un &#171; s &#187;, 
permet d&#8217;am&#233;liorer la pr&#233;cision (VE = d&#233;pense d&#8217;investissemento GEN = d&#233;pense
d&#8217;investissements). Seule r&#233;serve, mais plut&#244;t relative au fond : il arrive que le GEN 
marqu&#233; et le pluriel de la VE reconnue dans la liste soient homographes, auquel cas ce 
n&#8217;est pas le v&#233;ritable terme de la base qui est rep&#233;r&#233;, mais un autre terme au singulier 
(par exemple, VE : sg. fondo pl. fonds et GEN : fonds, mais ce dernier n&#8217;est pas le 
pluriel de fond, il s&#8217;agit d&#8217;un autre terme au singulier). Cependant, l&#8217;&#233;l&#233;ment ainsi 
&#233;tiquet&#233; reste un vrai GEN et le r&#233;sultat est consid&#233;r&#233; comme acceptable, &#233;tant donn&#233; 
que la t&#226;che est ici de trouver la fronti&#232;re des GEN. 
</p>
<p>5.3 Rep&#233;rage des fins de g&#233;n&#233;rique 
</p>
<p>La troisi&#232;me &#233;tape consiste &#224; soumettre toutes les d&#233;finitions trait&#233;es lors de la premi&#232;re 
&#233;tape, mais ignor&#233;es lors de la deuxi&#232;me, aux r&#232;gles de rep&#233;rage des marqueurs de fronti&#232;re 
de fin de GEN. Nous avons vu que les d&#233;finitions terminographiques pr&#233;sentent beaucoup de 
r&#233;gularit&#233;s, notamment au niveau des fronti&#232;res autour desquelles s&#8217;articulent les GEN et les 
SPE. D&#8217;apr&#232;s (Barnbrook, 2002), un analyseur peut identifier ces limites en utilisant une 
combinaison de trois &#233;l&#233;ments : une r&#232;gle g&#233;n&#233;rale identifiant les participes pr&#233;sents et pass&#233;s 
r&#233;guliers ; une liste de moins de 100 mots comportant des membres des classes ferm&#233;es 
(selon, qui, dans, etc.) et des participes pass&#233;s irr&#233;guliers ; ainsi qu&#8217;une liste d&#8217;exclusion 
comprenant les mots susceptibles d&#8217;&#234;tre mal trait&#233;s par la r&#232;gle de rep&#233;rage g&#233;n&#233;rale. Bien 
que l&#8217;analyse que nous envisageons ne soit pas tout &#224; fait la m&#234;me, la pr&#233;sence des m&#234;mes 
types de r&#233;gularit&#233;s a n&#233;anmoins &#233;t&#233; v&#233;rifi&#233;e sur notre corpus d&#8217;entra&#238;nement. Suivant ce 
constat, nous avons &#233;tabli des r&#232;gles correspondant &#224; ces diff&#233;rents cas de figure, en prenant 
en compte toutes les r&#233;alisations possibles d&#8217;un marqueur. La marque du participe pr&#233;sent en 
&#8211;ant doit par exemple &#234;tre d&#233;clin&#233;e en &#8211;ante, &#8211;ants ou &#8211;antes.
</p>
<p>Les r&#232;gles visant &#224; contraindre le rep&#233;rage de la fin du GEN exploitent donc les 
caract&#233;ristiques des contextes droit et gauche du GEN, et gauche du SPE qui le suit, et 
tiennent compte du nombre de mots apparaissant g&#233;n&#233;ralement entre les deux. Nous 
distinguons deux types de r&#232;gles : des r&#232;gles de fin sp&#233;cifiques et des r&#232;gles de fin g&#233;n&#233;rales. 
</p>
<p>1. Les r&#232;gles sp&#233;cifiques concernent les cas de faux incluants et exploitent &#224; la fois les 
expressions relationnelles en d&#233;but de GEN (Type de&#8230;, Ensemble de&#8230;, Partie de&#8230;,
etc.), dont le nombre est restreint et qui permettent d&#8217;associer une relation sp&#233;cifique au 
GEN (GENRE, TOUT ou PARTIE), et la ponctuation &#224; la fin du GEN. (Dans les cas de 
GEN=VE, ce sont les VE qui constituent la limite &#224; droite du GEN.) 
</p>
<p>453</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Selja SEPP&#196;L&#196;
</p>
<p>2. Les r&#232;gles g&#233;n&#233;rales concernent tous les autres cas et se basent sur trois types de 
marqueurs : 
</p>
<p>x sur la terminaison du premier mot apr&#232;s le GEN (finMOTGEN+1), sachant qu&#8217;il s&#8217;agit 
g&#233;n&#233;ralement d&#8217;un participe pr&#233;sent ou pass&#233; ; 
</p>
<p>x sur le premier mot qui suit le GEN (MOTGEN+1). Dans ce cas, les r&#232;gles (lexicales) 
int&#232;grent un certain nombre de mots entiers, tels que des conjonctions (que, quand,
etc.), des pronoms relatifs (qui, tel, etc.) ou des pr&#233;positions (par, dans, etc.). 
</p>
<p>x Soit enfin sur la ponctuation qui suit le GEN, &#224; savoir la virgule ou la parenth&#232;se. 
</p>
<p>La principale difficult&#233; li&#233;e au d&#233;veloppement de ces r&#232;gles est de les hi&#233;rarchiser en sorte 
qu&#8217;une r&#232;gle plus g&#233;n&#233;rale ne marque pas des GEN qui devraient &#234;tre trait&#233;s par une r&#232;gle 
plus sp&#233;cifique. L&#8217;exemple suivant illustre un conflit de r&#232;gles o&#249; l&#8217;&#233;tiquetage est faux si la 
r&#232;gle lexicale pla&#231;ant le GEN avant par, pr&#233;c&#232;de la r&#232;gle qui place la fronti&#232;re avant un mot 
qui se termine par &#8211;&#233;. Si on inverse l&#8217;ordre, le r&#233;sultat est juste. 
</p>
<p>FAUX : Gain brut r&#233;alis&#233;&lt;/GEN&gt; par&#8230; 
VRAI : Gain brut&lt;/GEN&gt; r&#233;alis&#233; par&#8230;
</p>
<p>Une autre difficult&#233; est li&#233;e &#224; la pr&#233;position de. Ce marqueur appara&#238;t aussi bien dans les mots 
compos&#233;s &#224; l&#8217;int&#233;rieur du GEN, qu&#8217;apr&#232;s un GEN (en d&#233;but de SPE). La solution adopt&#233;e 
jusqu&#8217;&#224; pr&#233;sent est de consid&#233;rer que la pr&#233;position marque le d&#233;but d&#8217;un SPE et que le GEN 
est donc compos&#233; d&#8217;un seul mot. Cette solution est en effet la plus probable &#233;tant donn&#233; que 
pr&#232;s de 70 % des GEN du corpus d&#8217;entra&#238;nement et 60 % du corpus d&#8217;&#233;valuation sont des 
mots simples. Il semblerait aussi que les cas ambigus soient souvent mieux trait&#233;s par les 
autres r&#232;gles g&#233;n&#233;rales de type finMOTGEN+1. La r&#232;gle du marqueur de doit donc &#234;tre class&#233;e 
parmi les derni&#232;res. 
</p>
<p>Le classement des r&#232;gles est r&#233;alis&#233; manuellement, en fonction de la fr&#233;quence d&#8217;application 
et de la performance de chaque r&#232;gle prise individuellement, ainsi que des observations faites 
lors des tests et des ajustements successifs. L&#8217;ordre de classement g&#233;n&#233;ral est le suivant : 
</p>
<p>1. Les r&#232;gles sp&#233;cifiques sont appliqu&#233;es en premier (y compris dans l&#8217;&#233;tape GEN=VE), 
&#233;tant donn&#233; qu&#8217;elles sont contraintes par le d&#233;but du GEN. Comme elles n&#8217;entrent pas 
en conflit entre elles, leur ordre interne n&#8217;a pas d&#8217;importance. 
</p>
<p>2. Suivent les r&#232;gles lexicales permettant de rep&#233;rer des mots MOTGEN+1 (auquel, dont,
lors, o&#249;, etc.) qui pr&#233;c&#233;dent les participes. 
</p>
<p>3. Viennent ensuite les r&#232;gles finMOTGEN+1, qui pr&#233;cisent la fin du premier mot apr&#232;s le 
GEN. Celles-ci non plus n&#8217;entrent pas en conflit entre elles, dans la mesure o&#249; les 
formes des patrons recherch&#233;s sont bien distinctes. Il est donc possible des les placer 
sans ordre sp&#233;cifique dans un m&#234;me bloc pr&#233;c&#233;dant  
</p>
<p>4. une seconde r&#232;gle lexicale qui comporte des pr&#233;positions (dans, entre, par, pour, sur)
ne pouvant &#234;tre plac&#233;es avant les r&#232;gles recherchant des participes. 
</p>
<p>5. Viennent finalement les r&#232;gles les plus &#171; bruyantes &#187;, qui tendent &#224; provoquer beaucoup 
d&#8217;erreurs lorsqu&#8217;elles sont plac&#233;es avant les autres (pr&#233;position de et ponctuation).
</p>
<p>Dans tous les cas, il conviendrait de tester et d&#8217;ajuster l&#8217;ensemble des r&#232;gles sur un corpus 
plus large, et de les classer ensuite statistiquement de fa&#231;on &#224; obtenir la meilleure 
performance possible. 
</p>
<p>454</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage automatique de g&#233;n&#233;riques dans les d&#233;finitions terminographiques 
</p>
<p>5.4 &#201;tiquetage des d&#233;finitions non trait&#233;es 
</p>
<p>La quatri&#232;me et derni&#232;re &#233;tape consiste &#224; soumettre au m&#234;me traitement toutes les d&#233;finitions 
dont les GEN n&#8217;auraient pas encore &#233;t&#233; balis&#233;s. Il s&#8217;agit de leur appliquer la r&#232;gle la plus 
g&#233;n&#233;rale (r&#232;gle par d&#233;faut) qui marque syst&#233;matiquement le premier mot de la d&#233;finition 
comme &#233;tant le GEN. L&#8217;application de cette seule r&#232;gle &#224; la troisi&#232;me &#233;tape (une fois les 
GEN=VE exclus et en ignorant les autres r&#232;gles) montre que 72,7 % des d&#233;finitions du corpus 
d&#8217;entra&#238;nement auraient &#233;t&#233; &#233;tiquet&#233;es convenablement. L&#8217;ensemble des r&#232;gles de rep&#233;rage de 
fin de GEN (celles de la 3e &#233;tape) visent donc &#224; couvrir les 27,3 % de cas d&#8217;&#233;chec de la r&#232;gle 
par d&#233;faut (celle qui marque syst&#233;matiquement le 1er mot). Ce constat r&#233;duit en fait 
consid&#233;rablement le nombre d&#8217;exemples du corpus d&#8217;entra&#238;nement permettant d&#8217;appr&#233;cier 
toute la gamme des variations possibles de la forme du GEN, mais cela n&#8217;emp&#234;che en rien 
l&#8217;&#233;tude des marqueurs post-GEN qui indiquent la fronti&#232;re &#224; droite de l&#8217;&#233;l&#233;ment. 
</p>
<p>6 &#201;valuation de la proc&#233;dure 
L&#8217;&#233;valuation r&#233;alis&#233;e sur le second corpus montre que la performance g&#233;n&#233;rale de ce syst&#232;me 
est relativement bonne : 88 % des GEN sont correctement annot&#233;s, ce qui constitue une tr&#232;s 
nette am&#233;lioration par rapport &#224; une annotation par d&#233;faut du 1er mot (60 %) de chaque 
d&#233;finition. Cette am&#233;lioration de la performance est due &#224; la prise en compte des VE 
(57 % des GEN) et des expressions relationnelles (8 %), ainsi que, dans une moindre mesure, 
au rep&#233;rage des SPE ant&#233;pos&#233;s (quelque 3 %). La plupart des erreurs (7/11 erreurs) sont dues 
aux r&#232;gles g&#233;n&#233;rales, dont la performance pourrait &#234;tre am&#233;lior&#233;e en les affinant davantage ou 
en les hi&#233;rarchisant diff&#233;remment. Un apprentissage automatique de ces r&#232;gles pourrait 
&#233;galement &#234;tre envisag&#233;. Les autres erreurs (4/11) sont dues au non rep&#233;rage d&#8217;un faux 
incluant, qui s&#8217;explique g&#233;n&#233;ralement par l&#8217;absence d&#8217;un des &#233;l&#233;ments cl&#233;s du marqueur, 
comme les mots soulign&#233;s dans ces GEN : Branche de la biologie ou Constituant d&#8217;une 
cellule. Ces erreurs peuvent &#234;tre corrig&#233;es en ins&#233;rant le mot en question dans la r&#232;gle, au 
risque cependant de la rendre plus ambig&#252;e, notamment si elle est appliqu&#233;e &#224; un autre 
domaine. Ce serait sans doute le cas du mot r&#233;gion du GEN R&#233;gion de l'ADN. Pour voir dans 
quelle mesure les marqueurs sont sp&#233;cifiques &#224; un domaine et v&#233;rifier ces r&#233;sultats, il 
conviendrait de poursuivre l&#8217;&#233;valuation sur un plus grand nombre de donn&#233;es, provenant de 
domaines vari&#233;s. 
</p>
<p>7 Conclusion
Dans cet article, nous avons pr&#233;sent&#233; un proc&#233;d&#233; de rep&#233;rage et d&#8217;&#233;tiquetage des &#233;l&#233;ments 
g&#233;n&#233;riques des d&#233;finitions terminographiques, qui exploite les r&#233;gularit&#233;s formelles du 
sous-langage d&#233;finitoire, afin de cr&#233;er des r&#232;gles de rep&#233;rage les plus pr&#233;cises possibles de la 
fronti&#232;re entre le g&#233;n&#233;rique et le(s) sp&#233;cifique(s). Il ne n&#233;cessite aucun pr&#233;traitement 
morphosyntaxique ni recours &#224; des ressources de TALN sp&#233;cifiques, mais exige que les 
diff&#233;rentes &#233;tapes du traitement et les r&#232;gles, susceptibles d&#8217;entrer en conflit, soient 
hi&#233;rarchis&#233;es. Apr&#232;s une pr&#233;sentation des quatre &#233;tapes de traitement des d&#233;finitions et des 
difficult&#233;s inh&#233;rentes &#224; leur application, nous avons montr&#233; que le syst&#232;me permet d&#8217;obtenir 
de bonnes performances globales. Cette performance est principalement obtenue gr&#226;ce aux 
r&#232;gles qui rep&#232;rent les sp&#233;cifiques ant&#233;pos&#233;s, les termes du domaine et les expressions 
relationnelles. Les r&#233;sultats devraient cependant &#234;tre consolid&#233;s sur des corpus plus grands, 
couvrant diff&#233;rents domaines, et des am&#233;liorations pourraient &#234;tre &#233;tudi&#233;es en ayant recours &#224; 
</p>
<p>455</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Selja SEPP&#196;L&#196;
</p>
<p>des proc&#233;d&#233;s statistiques ou d&#8217;apprentissage automatique. Finalement, si l&#8217;architecture de ce 
syst&#232;me semble transposable &#224; d&#8217;autres langues, l&#8217;exploitation des variations 
morphosyntaxiques suppose toutefois que des r&#232;gles de rep&#233;rage sp&#233;cifiques soient cr&#233;&#233;es 
pour chaque langue, ce qui restreint consid&#233;rablement leur r&#233;utilisabilit&#233;. Des techniques 
d&#8217;analyse ind&#233;pendantes des langues bas&#233;es sur l&#8217;apprentissage automatique des r&#232;gles 
devraient permettre de pallier cette limite. Nous envisageons &#224; l&#8217;avenir d&#8217;explorer ces pistes 
statistiques afin d&#8217;optimiser les performances du syst&#232;me. Nous &#233;tudierons &#233;galement la 
possibilit&#233; d&#8217;&#233;tendre ce type de proc&#233;d&#233; &#224; l&#8217;annotation des sp&#233;cifiques, l&#8217;objectif final &#233;tant de 
disposer d&#8217;un analyseur qui facilite l&#8217;annotation de corpus de d&#233;finitions terminographiques, 
en vue d&#8217;en &#233;tudier les &#233;ventuelles r&#233;gularit&#233;s dans la structure conceptuelle. Ce type 
d&#8217;analyseur pourrait finalement s&#8217;av&#233;rer int&#233;ressant pour enrichir les options de recherche 
dans les bases de donn&#233;es terminologiques. 
</p>
<p>R&#233;f&#233;rences
BARNBROOK, G. (2002). Defining Language : A local grammar of definition sentences.
Amsterdam, Philadelphia: John Benjamins. 
BOURJAULT, A. (2005). Terminologie de la biosynth&#232;se des prot&#233;ines chez les cellules 
eucaryotes : anglais-fran&#231;ais. Universit&#233; de Gen&#232;ve, &#201;cole de traduction et d'interpr&#233;tation. 
IRIS, M. A., et al. (1988). Problems of the part-whole relation. Relational Models of the 
Lexicon: Representing Knowledge in Semantic Networks, 261-287. 
ISO (2000). Travaux terminologiques : principes et m&#233;thodes (ISO 704). Gen&#232;ve: ISO. 
L'HOMME, M.-C. (2003). Indices de relations conceptuelles dans les d&#233;finitions 
terminologiques. Application au domaine de l&#8217;informatique. Actes de I Jornada Internacional 
sobre la Investigaci&#243;n en Terminolog&#237;a y Conocimiento Especializado, 44-50. 
LINGUA-PC. Banque de terminologie du canton de Berne. Chancellerie d'&#201;tat du Canton de 
Berne.
REBEYROLLE, J. (2000). Utilisation de contextes d&#233;finitoires pour l&#8217;acquisition de 
connaissances &#224; partir de textes. Actes d&#8217;IC'2000.
REY-DEBOVE, J. (1971). &#201;tude linguistique et s&#233;miotique des dictionnaires fran&#231;ais 
contemporains. The Hague, Paris: Mouton. 
SEPP&#196;L&#196;, S. (2004). Composition et formalisation conceptuelles de la d&#233;finition 
terminographique. Universit&#233; de Gen&#232;ve, &#201;cole de traduction et d'interpr&#233;tation. 
SEPP&#196;L&#196;, S. (2005). Structure des d&#233;finitions terminographiques : une &#233;tude pr&#233;liminaire. 
Actes de Terminologie et Intelligence Artificielle, TIA'05, 19-29. 
SEPP&#196;L&#196;, S. (2006). Semi-Automatic Checking of Terminographic Definitions. Actes de 
TermEval Workshop - LREC 2006, 22-27. 
VOSSEN, P., et al. (1989). Meaning and structure in dictionary definitions. Computational
Lexicography for Natural Language Processing, 171-192. 
</p>
<p>456</p>

</div></div>
</body></html>