<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La segmentation th&#233;matique TextTiling comme indice pour le rep&#233;rage de segments d'information &#233;volutive dans un corpus de textes encyclop&#233;diques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007 
</p>
<p>La segmentation th&#233;matique TextTiling comme indice  
pour le rep&#233;rage de segments d'information &#233;volutive  
</p>
<p>dans un corpus de textes encyclop&#233;diques 
</p>
<p>Marion LAIGNELET1,2, Christophe PIMM3
1 CLLE-ERSS &#8211; Universit&#233; Toulouse 2 &#8211; Le Mirail, Toulouse
</p>
<p>2 Soci&#233;t&#233; INITIALES &#8211; Montpellier 
 3 CLLE-ERSS &#8211; Universit&#233; Toulouse 2 &#8211; Le Mirail, Toulouse 
{marion.laignelet,christophe.pimm}@univ-tlse2.fr
</p>
<p>R&#233;sum&#233;. Nous faisons l'hypoth&#232;se que les bornes d&#233;limit&#233;es par la m&#233;thode statistique 
TextTiling peuvent servir d'indices qui, cumul&#233;es &#224; des indices de nature linguistique, 
permettront de rep&#233;rer automatiquement des segments d'informations &#233;volutives. Ce travail 
est d&#233;velopp&#233; dans le cadre d'un projet industriel plus g&#233;n&#233;ral dont le but est le rep&#233;rage 
automatique de zones textuelles contenant de l'information potentiellement &#233;volutive. 
</p>
<p>Abstract. Our hypothesis is that the TextTiling's boundaries can be considered as clues 
we can use with other linguistic features to automatically detect evolving information 
segments. This work is developed as part of an industrial project aiming to automatically 
detect textual zones containing potentially evolving information. 
</p>
<p>Mots-cl&#233;s : segments d'information &#233;volutive, segmentation, algorithme TextTiling. 
</p>
<p>Keywords: evolving information, segmentation, TextTiling algorithm. 
</p>
<p>1 Introduction
Un segment d'information &#233;volutive (SEDIS-H) est une portion de texte de longueur variable 
contenant de l'information dont la particularit&#233; est d'&#234;tre susceptible d'&#233;voluer dans le temps. 
Cette notion d'&#233;volutivit&#233; de l'information a pris naissance dans un contexte industriel 
particulier, l'&#233;dition, et plus pr&#233;cis&#233;ment dans le cadre d'une probl&#233;matique de mise &#224; jour 
&#233;ditoriale de documents encyclop&#233;diques. L'&#233;tude pr&#233;sent&#233;e dans cet article est partie 
prenante d'un projet plus global1 dont le but applicatif final est de proposer &#224; des r&#233;dacteurs 
charg&#233;s de mettre &#224; jour les articles encyclop&#233;diques un outil facilitant cette t&#226;che de mise &#224; 
jour de l'information. Cet article vise &#224; montrer que l'association de m&#233;thodes linguistiques 
avec des m&#233;thodes statistiques peut repr&#233;senter un apport non n&#233;gligeable lorsqu'il s'agit de 
rendre compte de ph&#233;nom&#232;nes complexes. Plus pr&#233;cis&#233;ment, nous pr&#233;sentons une 
</p>
<p>1  Projet men&#233; dans le cadre d'une th&#232;se CIFRE, partenariat entre l'ERSS, Toulouse, et la soci&#233;t&#233; Initiales, 
Montpellier. 
</p>
<p>387</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion LAIGNELET, Christophe PIMM
</p>
<p>exp&#233;rimentation dans laquelle nous exploitons la notion de rupture th&#233;matique issue du 
TextTiling (Hearst, 1994) avec l'id&#233;e que cela peut contribuer &#224; l'identification des segments 
recherch&#233;s (les SEDIS-H). Nous proposons ainsi un point de vue particulier sur la notion de 
segmentation des textes en optant pour une vision &#224; gros grain de la segmentation, puisque 
d'un c&#244;t&#233; nous cherchons &#224; d&#233;crire les SEDIS-H, et puisque de l'autre, le TextTiling a pour but 
de segmenter les textes en fonction des th&#232;mes qui sont abord&#233;s dans leurs parties. Notre 
hypoth&#232;se est que les ruptures th&#233;matiques fournies par cet algorithme peuvent devenir des 
indices pour aider au rep&#233;rage des fronti&#232;res initiales et/ou finales de certains types de 
SEDIS-H. La premi&#232;re partie de cet article pr&#233;sente la notion de segmentation et son 
importance lorsqu'on travaille en linguistique du discours. Dans la seconde partie, nous 
pr&#233;sentons la notion de SEDIS-H ainsi que l'apport d'une m&#233;thode telle que le TextTiling pour 
la description et le rep&#233;rage de tels segments de discours. La troisi&#232;me partie fait &#233;tat du 
protocole exp&#233;rimental que nous avons suivis. Enfin, nous pr&#233;sentons les r&#233;sultats et 
proposons une discussion dans la derni&#232;re partie. 
</p>
<p>2 Segmentation
Ce projet peut &#234;tre (entre autres) situ&#233; &#224; la fois dans le sillon de la Recherche d'Information (et 
de la recherche intradocumentaire, par extension) parce que nous avons comme objectif de 
rechercher parmi la masse de textes encyclop&#233;diques ceux pour lesquels une mise &#224; jour est 
n&#233;cessaire, et dans celui de l'Extraction d'Information puisque nous souhaitons rechercher et 
extraire une information qui pr&#233;cis&#233;ment pr&#233;sente la caract&#233;ristique d'&#234;tre &#233;volutive. Une des 
techniques commune &#224; ces deux domaines est la segmentation2.
</p>
<p>2.1  Point de vue linguistique et cognitif 
</p>
<p>Nous suivons P&#233;ry-Woodley (2005) lorsqu'elle &#233;crit : &#171; Toute structuration passe en effet par 
une segmentation, segmenter impliquant &#224; la fois diviser et regrouper en fonction d'un crit&#232;re 
organisationnel. Que l'on envisage l'organisation discursive en termes de structure 
d'information, de structuration th&#233;matique ou de relations de coh&#233;rence, la notion de 
segmentation est pr&#233;sente : recherches de crit&#232;res de regroupement d'unit&#233;s (en segments), 
identification de marques de rupture ou de discontinuit&#233; (entre segments), &#233;tude des relations 
(entre segments) qui les hi&#233;rarchisent et forment des segments de niveau sup&#233;rieur. 
L'identification de segments &#224; m&#234;me de pr&#233;senter une homog&#233;n&#233;it&#233; s&#233;mantique et/ou de 
constituer des unit&#233;s fonctionnelles est &#233;galement au coeur des recherches en T.A.L. touchant 
au discours. &#187; (P&#233;ry-Woodley, 2005) 
</p>
<p>Il est important de souligner que, sous le terme de &#171; segmentation &#187;, nous ne nous limitons 
pas &#224; la notion de &#171; segmentation th&#233;matique &#187;, laquelle s'appuie sur la notion de coh&#233;sion 
lexicale (cf. Halliday et Hasan, 1976), c'est-&#224;-dire la r&#233;p&#233;tition des mots comme indicateur 
d'homog&#233;n&#233;it&#233; th&#233;matique. De nombreux travaux, qu'ils soient men&#233;s en linguistique ou en 
psycholinguistique, cherchent &#224; rendre compte de ces processus de construction de la 
coh&#233;rence que ce soit &#224; travers la d&#233;limitation de segments de discours ou de la description 
des relations entre ces segments (cf. RST, SDRT, segmentation th&#233;matique, etc.). La 
segmentation automatique appara&#238;t alors comme une technique incontournable d&#233;velopp&#233;e 
relativement &#224; divers objectifs applicatifs : pour certains l'objectif vis&#233; est celui du r&#233;sum&#233; 
automatique (cf. Minel (2002), Marcu (2000), etc.) ; pour d'autres il s'agit de d&#233;velopper des 
</p>
<p>2 La segmentation peut &#233;galement &#234;tre vue comme une t&#226;che &#224; part enti&#232;re, parti que nous n'adoptons pas dans 
ce cadre. Nous l'envisageons comme une &#233;tape n&#233;cessaire &#224; un grand nombre de traitements sur les textes. 
</p>
<p>388</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser le TextTiling pour le rep&#233;rage de SEDIS-H
</p>
<p>syst&#232;mes de recherche/s&#233;lection d'information importante (cf. Rossi et Bert-Erboul (1991), 
etc.) ou encore des outils d'aide &#224; la navigation (cf. Jackiewick et Minel (2003), etc.). Dans 
tous ces cas, la t&#226;che de segmentation est envisag&#233;e par rapport &#224; une application pr&#233;cise, un 
point de vue sur les textes (cf. Hernandez, 2004). C'est &#233;galement la position que nous 
adoptons : il nous para&#238;t essentiel et incontournable de d&#233;finir les segments que nous 
recherchons, les SEDIS-H, ainsi que les m&#233;thodes et techniques mises en &#339;uvre pour y aboutir 
relativement &#224; l'objectif applicatif de d&#233;part, &#224; savoir la mise en place d'un outil d'aide &#224; la 
mise &#224; jour de l'information dans des documents encyclop&#233;diques. 
</p>
<p>2.2 Segmentation th&#233;matique et TextTiling 
</p>
<p>La segmentation th&#233;matique est un domaine riche pour lequel il y a de plus en plus de 
travaux. G&#233;n&#233;ralement, sont d&#233;velopp&#233;es des approches statistiques m&#234;me si la tendance 
aujourd'hui consiste &#224; les combiner &#224; des analyses linguistiques souvent sommaires. Nous ne 
pr&#233;senterons ici qu'une approche, le TextTiling de Hearst (1997), qui reste encore aujourd'hui 
la m&#233;thode la plus utilis&#233;e pour ce type de segmentation. Selon Hearst (1997), cette t&#226;che de 
segmentation peut potentiellement s'int&#233;grer dans des applications d'extraction d'information 
ou de r&#233;sum&#233; automatique. Elle d&#233;crit un algorithme &#224; deux t&#226;ches principales : d'un c&#244;t&#233;, 
l'identification des subtopic segments et de l'autre le rep&#233;rage des subtopic shifts. Elle travaille 
sur les paragraphes ou sur des ensembles comprenant plusieurs paragraphes. Au final, le 
TextTiling Algorithm a pour objectif de segmenter le texte en plusieurs blocs contigus, qui ne 
se chevauchent pas et qui sont coh&#233;rent th&#233;matiquement. Des scores sont ensuite attribu&#233;s &#224; 
ces blocs de texte, et c'est l'attribution de ces scores qui participe &#224; la segmentation. Nous 
d&#233;velopperons dans la 3e partie les diverses &#233;tapes de la segmentation telle qu'elle est 
envisag&#233;e dans le cadre du TextTiling mais &#233;galement telle que nous l'utilisons.  
</p>
<p>3 Les SEDIS-H dans le cadre d'un projet industriel 
3.1  Pr&#233;sentation et D&#233;finitions 
</p>
<p>Nous d&#233;finissons un SEDIS-H comme un segment textuel susceptible de contenir une ou 
plusieurs informations pr&#233;sentant cette particularit&#233; de pouvoir &#233;voluer dans le temps et/ou 
qui relativement &#224; des besoins &#233;ditoriaux n&#233;cessiterai(en)t d'&#234;tre r&#233;actualis&#233;e(s) (cf. Laignelet, 
2006a, 2006b, 2006c). Une double distinction notionnelle nous permet de rendre compte 
partiellement de la complexit&#233; de la notion de &#171; mise &#224; jour &#187; qui peut &#234;tre envisag&#233;e tant du 
point de vue de la t&#226;che r&#233;elle &#224; laquelle elle fait r&#233;f&#233;rence que du point de vue du linguiste 
dont l'objectif est de d&#233;crire l'objet textuel auquel il r&#233;f&#232;re. Nous faisons donc une distinction 
sur deux plans. Le premier plan concerne la nature de l'information &#224; mettre &#224; jour, laquelle 
peut &#234;tre &#224; strictement parler une mise &#224; jour ou bien une r&#233;actualisation. Dans le cas de la 
mise &#224; jour, l'information n'est plus vraie ou ne s'est pas v&#233;rifi&#233;e (c'est souvent le cas lorsque 
l'auteur fait des pr&#233;dictions sur un fait ou un &#233;v&#233;nement). Dans l'exemple suivant, 
l'information &#171; Il n'existe pas &#224; l'heure actuelle de vaccin contre le sida. &#187; ainsi que ce qui 
suit n'est potentiellement plus vrai au moment de lecture/r&#233;&#233;dition ou alors, &#233;tant donn&#233; un 
possible caract&#232;re pr&#233;dictif, on est en droit de se demander si elle s'est ou non v&#233;rifi&#233;e. 
</p>
<p>389</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion LAIGNELET, Christophe PIMM
</p>
<p>La d&#233;couverte du virus a permis la mise au point d'une m&#233;thode de d&#233;pistage [...]. On peut 
ainsi savoir qu'une personne est infect&#233;e longtemps avant que la maladie ne se d&#233;clare. Il
n'existe pas &#224; l'heure actuelle de vaccin contre le sida. Si les th&#233;rapies actuelles permettent 
d'am&#233;liorer sensiblement la dur&#233;e et les conditions de vie du malade, aucune n'est capable 
d'&#233;liminer le virus. 
</p>
<p>Figure 1 : Exemple d'une mise &#224; jour 
</p>
<p>Dans le cas d'une r&#233;actualisation, les segments contiennent une information qui restera vraie 
dans l'absolu mais, en vue d'une r&#233;-&#233;dition et d'une diffusion, les &#233;v&#233;nements et dates associ&#233;s 
doivent &#234;tre modifi&#233;s pour faire r&#233;f&#233;rence &#224; un moment plus proche du moment de 
lecture/r&#233;&#233;dition. Dans l'exemple qui suit, la valeur chiffr&#233;e &#171; 160 millions &#187; associ&#233;e &#224; &#171; en 
2002 &#187; reste vraie, qu'on lise la fiche en 2003 ou en 2007. Cependant, il est fortement 
souhaitable de fournir de nouvelles informations et notamment de donner les chiffres pour 
l'ann&#233;e la plus proche de la date de r&#233;&#233;dition de la fiche. 
</p>
<p>L'organisation mondiale de la sant&#233; (OMS) estime, en effet, &#224; 160 millions le nombre annuel de 
nouveaux cas dans le monde en 2002.
</p>
<p>Figure 2 : Exemple d'une r&#233;actualisation 
</p>
<p>Le second plan fonde la distinction &#224; un niveau plus textuel et oppose le SEDIS-H minimal au 
segment d'interpr&#233;tation. Les SEDIS-H sont ainsi envisag&#233;s comme des segments textuels &#224; 
granularit&#233; variable, ce qui nous permet de r&#233;pondre au mieux aux exigences industrielles : en 
effet, il semble pr&#233;f&#233;rable pour le r&#233;dacteur charg&#233; de la mise &#224; jour d'avoir acc&#232;s &#224; la fois aux 
expressions locales &#224; mettre &#224; jour &#224; proprement parler, et en m&#234;me temps de b&#233;n&#233;ficier d'un 
contexte textuel suffisamment large et plus global pour &#234;tre en mesure d'interpr&#233;ter et de 
cibler rapidement ce qui n&#233;cessite une mise &#224; jour. Dans la figure 3, nous pouvons voir un 
certain nombre de SEDIS-H minimaux. Ils apparaissent dans cet exemple dans les petits 
cadres (ovales et rectangulaires). Leur taille varie du mot au syntagme et ils peuvent &#234;tre de 
diverses natures. Dans certains cas, ils se confondent avec la notion d'indice : c'est le cas 
notamment des dates et des valeurs chiffr&#233;es. L'ensemble de l'extrait correspond &#224; la notion de 
segment d'interpr&#233;tation : c'est un segment discursif plus long que les pr&#233;c&#233;dents ; il s'agit ici 
de l'exemple en entier. La taille minimale de ce type de segment est la phrase mais ils peuvent 
aussi couvrir un ou plusieurs paragraphes, voire la partie enti&#232;re. 
</p>
<p>Figure 3 : Exemple pr&#233;sentant un cadre temporel ouvrant un segment d'interpr&#233;tation 
</p>
<p>Dans cet exemple, le segment d'interpr&#233;tation s'ouvre sur un introducteur de cadre temporel 
(Charolles, 1997). L'int&#233;r&#234;t de consid&#233;rer l'IC temporel &#171; En 2003 &#187; (dans le premier encadr&#233;) 
est que le crit&#232;re s&#233;mantique (la r&#233;f&#233;rence temporelle &#171; 2003 &#187;) qu'il v&#233;hicule est valable pour 
</p>
<p>390</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser le TextTiling pour le rep&#233;rage de SEDIS-H
</p>
<p>l'ensemble du segment donn&#233;. Ainsi, les deux valeurs chiffr&#233;es dans les ovales ont une 
relation (temporelle) &#224; travers l'expression &#171; En 2003 &#187;. Les deux &#233;l&#233;ments dans les encadr&#233;s 
arrondis sont &#233;galement des informations &#224; mettre &#224; jour du fait de leur proximit&#233; temporelle. 
Dans ce segment, il est important de noter que toutes les informations contenues ne sont pas &#224; 
mettre &#224; jour, par exemple &#171; Une forte pouss&#233;e d&#233;mographique a eu lieu au cours du XXe 
si&#232;cle [...] &#187;, pour lesquelles une r&#233;f&#233;rence temporelle diff&#233;rente est explicitement signal&#233;e. 
Nous d&#233;finissons un segment d'interpr&#233;tation comme un segment textuel de longueur 
ind&#233;termin&#233;e, pr&#233;sentant une certaine homog&#233;n&#233;it&#233; s&#233;mantique (temporelle, spatiale, etc.), 
pouvant contenir des segments ne n&#233;cessitant pas de mise &#224; jour et qui contient des SEDIS-H
minimaux et/ou des indices. 
</p>
<p>3.2  Rep&#233;rage des SEDIS-H : l'apport d'une m&#233;thode telle que le 
TextTiling pour le rep&#233;rage des segments d'interpr&#233;tation 
</p>
<p>Des travaux ant&#233;rieurs men&#233;s dans une optique de segmentation ont cherch&#233; &#224; combiner les 
marques de natures diff&#233;rentes, soit statistique et linguistique. Dans le cadre du projet 
REGAL, les auteurs cherchent &#224; construire une structure th&#233;matique des textes afin de 
pouvoir soutenir une navigation intra-document dans le cadre de syst&#232;mes de r&#233;sum&#233; 
dynamique. Dans cette optique, Hernandez (2004) propose de combiner une analyse par 
segmentation lexicale avec un rep&#233;rage de marques linguistiques. Cette &#233;tude nous semble 
tr&#232;s int&#233;ressante, &#224; la fois de par la m&#233;thode utilis&#233;e mais &#233;galement &#224; travers les conclusions 
qu'elle apporte. Ainsi, selon Hernandez (2004 : 184), &#171; la coh&#233;sion lexicale apporte la 
robustesse au syst&#232;me en lui permettant de produire des r&#233;sultats relevant de tout 
domaine [...]. Les marques linguistiques quant &#224; elles apportent la finesse en permettant de 
rep&#233;rer avec pr&#233;cision les bornes de segments, plus souvent la borne initiale d'ailleurs, la 
d&#233;limitation de la borne finale &#233;tant souvent tr&#232;s difficile voire impossible &#187;. Hernandez 
conclut en disant que &#171; la combinaison d'une analyse automatique par coh&#233;sion lexicale et 
d'un rep&#233;rage des cadres appara&#238;t comme triplement profitable : elle permet dans certains 
cas d'affiner l'ajustement des marques de segmentation automatique, dans d'autres de fournir 
un indice suppl&#233;mentaire de fermeture de cadre ; enfin elle met en lumi&#232;re un point important 
concernant la dimension lexicale des cadres de discours : il semble en effet que ceux-ci 
pr&#233;sentent une coh&#233;sion lexicale forte chaque fois qu'ils jouent un r&#244;le proc&#233;dural dans la 
classification des donn&#233;es transmises au lecteur. &#187; Dans le cadre de notre projet, nous 
cherchons &#224; mettre en place une exp&#233;rimentation telle que celle qui a &#233;t&#233; faite par Hernandez 
tout en &#233;tant conscient que notre objectif applicatif est bien diff&#233;rent. Ainsi, nous supposons 
que le rep&#233;rage des SEDIS-H peut &#234;tre automatis&#233; &#224; travers la prise en compte d'indices 
linguistiques et discursifs, lesquels, bien qu'ils aient une fonction pr&#233;cise dans la langue, 
peuvent &#233;galement permettre l'interpr&#233;tation d'un segment comme &#233;tant de nature &#233;volutive. 
S'ils sont consid&#233;r&#233;s isol&#233;ment, ces indices ne sont cependant pas suffisants pour r&#233;pondre &#224; 
cet objectif de rep&#233;rage automatique des SEDIS-H (Laignelet, 2006a) ;  en revanche, 
envisag&#233;s en termes de configurations, i.e. en prenant en compte des combinaisons d'indices, 
il est tout &#224; fait pertinent de penser que cette t&#226;che peut &#234;tre automatis&#233;e. En plus de la 
combinaison d'indices linguistiques et discursifs &#8211; et c'est l'objet de cet article &#8211; nous 
souhaitons analyser l'impact d'une analyse statistique de type TextTiling. Dans notre cas, et au 
stade de notre &#233;tude, nous souhaitons observer si les ruptures th&#233;matiques engendr&#233;es par une 
telle segmentation peuvent elles-m&#234;mes devenir des indices pour le rep&#233;rage des fronti&#232;res 
initiales et/ou finales des SEDIS-H de type &#171; segments d'interpr&#233;tation &#187;. 
</p>
<p>391</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion LAIGNELET, Christophe PIMM
</p>
<p>4 Protocole exp&#233;rimental 
</p>
<p>4.1  Annotation manuelle 
</p>
<p>Nous travaillons actuellement sur un corpus constitu&#233; de 92 textes de type encyclop&#233;dique. Il 
s'agit de fiches encyclop&#233;diques &#233;dit&#233;es et accessibles sur le march&#233; de l'&#233;dition (propri&#233;t&#233; des 
Editions Atlas). A priori du point de vue du type de texte (cf. terminologie de Biber), ce 
corpus est homog&#232;ne. Le trait distinctif entre ces textes rel&#232;ve de la cat&#233;gorisation en genre et 
plus pr&#233;cis&#233;ment du domaine de connaissance auquel chacune des fiches appartient. Nous 
insistons sur ce point parce que nous supposons l'importance de cette distinction par domaine 
pour les r&#233;sultats3. Ce corpus constitue une base de 80 000 mots, au format XML. Sur le total 
des 92 fiches, nous avons proc&#233;d&#233; &#224; l'annotation manuelle de 38 d'entre elles. Cette t&#226;che 
d'annotation manuelle a consist&#233; &#224; marquer &#224; l'aide de balises XML les fronti&#232;res des 
segments qui sont potentiellement des segments contenant de l'information &#224; mettre &#224; jour.
Elle met en &#233;vidence la pr&#233;sence de 630 SEDIS-H dans les 38 fiches parcourues. Par choix 
m&#233;thodologique4, les SEDIS-H sont de longueur &#233;gale &#224; l'unit&#233; phrase (i.e. qui commence par 
une majuscule et se termine par une marque de ponctuation). 
</p>
<p>4.2  Outil : LinguaStream 
</p>
<p>M&#234;me si ce n'est pas l'objectif central vis&#233; par article, il est important de pr&#233;ciser que 
l'ensemble des marqueurs de surface5 sur lesquels nous travaillons sont rep&#233;r&#233;s de mani&#232;re 
automatique &#224; l'aide de la plateforme LinguaStream (cf. Widl&#246;cher et Bilhaut, 2005). 
LinguaStream est une plate-forme g&#233;n&#233;rique pour le traitement automatique des langues qui 
permet d'effectuer des traitements et des analyses de types et de niveaux linguistiques vari&#233;s 
(morphologique, syntaxique, s&#233;mantique, discursif ou encore statistique) sur des corpus en 
XML : il offre la possibilit&#233; d'utiliser diff&#233;rents langages en fonction de ce qu'on veut faire : 
des lexiques, des grammaires Prolog, des expressions r&#233;guli&#232;res, des macro-expressions 
r&#233;guli&#232;res, des programmes groovy, etc. . Travaillant sur des objets &#171; mouvants &#187; (qui 
peuvent aller de la taille d'une phrase &#224; la taille d'une partie enti&#232;re) cet outil est 
particuli&#232;rement pertinent de par les diverses possibilit&#233;s de visualisation qu'il offre. 
Concernant cette &#233;tude, LinguaStream nous permet de travailler directement sur notre corpus 
annot&#233; manuellement des SEDIS-H, d'y adjoindre un d&#233;coupage issu d'une segmentation 
TextTiling et de comparer, observer et analyser ais&#233;ment les deux types de segmentation 
obtenus.
</p>
<p>4.3 D&#233;tail des &#233;tapes de la segmentation par le TextTiling et adaptation &#224; 
notre &#233;tude 
</p>
<p>L'algorithme du TextTiling permet une segmentation des textes fond&#233;e sur la notion de 
changement th&#233;matique. L'hypoth&#232;se de Hearst (in Hernandez, 2004 : 191, note n&#176;86) est que 
&#171; un ensemble d'items lexicaux est utilis&#233; pendant la discussion d'un sous-th&#232;me, et quand le 
</p>
<p>3 Huit domaines diff&#233;rents sont repr&#233;sent&#233;s : g&#233;ographie (14), m&#233;decine &amp; sant&#233; (13), sciences &amp; techniques 
(10), soci&#233;t&#233; (8), sport (8), histoire (17), art &amp; litt&#233;rature (12) et faune &amp; flore (7). Nous ne traitons pour cette 
&#233;tude que les quatre premiers domaines cit&#233;s. 
</p>
<p>4 Cela nous permet notamment de pouvoir nous baser sur des unit&#233;s homog&#232;nes (la phrase) lors de l'&#233;valuation 
de nos programmes. 
</p>
<p>5 des adverbes de temps, des syntagmes nominaux de temps, des superlatifs, des noms propres, des sigles, des 
superlatifs (Laignelet, 2006a, 2006b, 2006c) 
</p>
<p>392</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser le TextTiling pour le rep&#233;rage de SEDIS-H
</p>
<p>sous-th&#232;me change, une proportion significative du vocabulaire change aussi &#187;. D'une 
mani&#232;re g&#233;n&#233;rale, cet algorithme consiste &#224; comparer des paires de passages successifs apr&#232;s 
pond&#233;ration des mots de chacun des passages en fonction de crit&#232;res de distribution et de co-
occurrence lexicale. Apr&#232;s une premi&#232;re &#233;tape de tokenisation et d'&#233;tiquetage pour supprimer 
les mots vides susceptibles de parasiter les traitements ult&#233;rieurs, Hearst pose une taille fixe et 
arbitraire des passages de texte &#224; comparer : elle d&#233;finit les notions de pseudo-phrase (token
sequence) et de pseudo-paragraphes (block). Ces deux &#233;l&#233;ments pr&#233;sentent la particularit&#233; 
d'&#234;tre de taille homog&#232;ne, les pseudo-paragraphes comptant un nombre donn&#233; de pseudo-
phrases. L'auteur explique qu'elle a choisi de ne pas utiliser les phrases comme unit&#233;s car la 
phrase est un segment dont la d&#233;finition pose probl&#232;me et de plus, le fait de comparer des 
segments de m&#234;me taille rend cette comparaison plus ais&#233;e. Une fois les blocs d&#233;finis, des  
scores de similarit&#233; vont &#234;tre calcul&#233;s entre chaque paire de blocs adjacents (cf. cosinus, 
coefficient de Dice, Jacquard, etc.) bas&#233;s sur la fr&#233;quence des tokens de chaque bloc. Dans 
une derni&#232;re phase, les fronti&#232;res des segments th&#233;matiques sont d&#233;tect&#233;es par comparaison 
des diff&#233;rences scores qui ont &#233;t&#233; attribu&#233;s &#224; chacun des segments lors de l'&#233;tape pr&#233;c&#233;dente. 
Dans le cadre de notre exp&#233;rimentation, nous avons fait le choix de travailler sur des 
segments dont la taille fait trois phrases &#171; r&#233;elles &#187;6. Nous verrons que ce choix n'est pas sans 
poser de probl&#232;me dans des textes o&#249; la mise en forme mat&#233;rielle est tr&#232;s riche. Nous avons 
exclu de consid&#233;rer l'unit&#233; paragraphe du fait de la particularit&#233; de notre corpus : en effet, 
s'agissant de fiches encyclop&#233;diques grand public et donc &#224; fort impact visuel, les personnes 
charg&#233;es de la mise en page de ces fiches ne respectent pas ou peu la signification du saut de 
ligne. Nous souhaitions donc une m&#233;thode nous permettant &#224; la fois de descendre en dessous 
du grain paragraphe, et de traiter des unit&#233;s plus ou moins homog&#232;ne en taille. Par ailleurs, 
nous ne prenons pas non plus en compte les titres dans les calculs de similarit&#233;. Nous avons 
utilis&#233; le coefficient de Dice tout en faisant varier le seuil en fonction des th&#233;matiques des 
textes : pour les fiches g&#233;ographie, le seuil est de 0,09 ; pour les fiches m&#233;decine &amp; sant&#233;, il 
est &#233;galement de 0,09 ; pour les fiches sciences &amp; techniques, il est de 0,15 ; enfin pour les 
fiches soci&#233;t&#233;, il est de 0,17. Cette variation a &#233;t&#233; mise en &#233;vidence apr&#232;s divers tests effectu&#233;s 
sur notre corpus ; ces diff&#233;rences refl&#232;tent ainsi les variations que l'on peut observer entre 
types et genre de textes. 
</p>
<p>5 Premiers r&#233;sultats 
Une fois que les diff&#233;rents traitements que nous venons de pr&#233;senter ont &#233;t&#233; effectu&#233;s sur 
notre corpus, nous avons observ&#233; et compt&#233; le nombre de fois o&#249;, d'un c&#244;t&#233; une balise 
ouvrante de SEDIS-H correspond &#224; une balise ouvrante de segment th&#233;matique TextTiling 
(&#171; ouverture stricte &#187;), et de l'autre une balise fermante de SEDIS-H correspond &#224; une balise 
fermante de segment th&#233;matique TextTiling (&#171; fermeture stricte &#187;). De plus, du fait que les 
blocs al&#233;atoires utilis&#233;s pour faire les calculs TextTiling peuvent avoir des fronti&#232;res un peu 
n'importe o&#249;, nous avons &#233;galement observ&#233; et compt&#233; les cas o&#249; il y avait une phrase de 
d&#233;calage entre les deux types de borne. Le tableau suivant r&#233;capitule ces donn&#233;es : 
</p>
<p>6 Par &#171; r&#233;elles &#187; nous entendons des phrases grammaticales qui commencent par une majuscule et se terminent 
par une ponctuation forte. Cela ne correspond donc pas &#224; la notion de pseudo-phrase d&#233;finie par Hearst. 
</p>
<p>393</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion LAIGNELET, Christophe PIMM
</p>
<p>valeurs r&#233;elles Pourcentage 
</p>
<p>nombre de SEDIS-H 630 100
nombre de &#171; fermetures strictes &#187; 141 22,38 % 
</p>
<p>nombre de fermetures +/-1 phrase 59
200
</p>
<p>9,36 % 
31,75 % 
</p>
<p>nombre de &#171; ouvertures strictes &#187; 114 18,09 % 
</p>
<p>nombre d&#8217;ouvertures +/-1 phrase 58
172
</p>
<p>9,20 % 
27,30 % 
</p>
<p>Tableau 1 : Comparaison des fronti&#232;res ouvrantes et fermantes des SEDIS-H et des segments 
th&#233;matiques 
</p>
<p>Ces r&#233;sultats nous encouragent fortement &#224; consid&#233;rer les ruptures th&#233;matiques issues d'une 
segmentation TextTiling comme des indices nous permettant d'automatiser le rep&#233;rage de 
SEDIS-H autant pour le rep&#233;rage de leur borne initiale que pour celui de leur borne finale : en 
effet, 31,75 % des fronti&#232;res finales de SEDIS-H apparaissent simultan&#233;ment avec une fin de 
segment th&#233;matique, et dans 27,30 % des cas, les fronti&#232;res ouvrantes de SEDIS-H et de 
segment th&#233;matique sont co-occurrents. La figure 4 montre un cas o&#249; l'on peut observer une 
co-occurrence &#224; la fois des bornes initiales des deux types de segments et de leurs bornes 
finales.
</p>
<p>&lt;SEDIS-H&gt; &lt;HEARST&gt; En 2000, la Chine avait une production de p&#234;che de capture  estim&#233;e &#224; 
17 millions de tonnes. La France occupe le quatri&#232;me rang en Europe avec une production 
annuelle d'environ 600000 tonnes, poissons, crustac&#233;es et mollusques r&#233;unis. Les sources 
rapport&#233;es par la FAO (Food Agricultural Organization) font &#233;tat d'une croissance du commerce 
halieutique international de 4 % par an, soit un montant &#233;valu&#233; 55,2 milliards de dollar en l'an 
2000. &lt;/HEARST&gt; &lt;SEDIS-H&gt;
</p>
<p>Figure 4 : Exemple de co-occurrence entre SEDIS-H et segment th&#233;matique 
</p>
<p>Ce qui est int&#233;ressant dans cet exemple 4, c'est qu'il montre &#233;galement que d'autres indices 
peuvent &#234;tre pris en compte comme les introducteurs de cadres temporels (ici &#171; En 2000 &#187;)
(Charolles, 1997). Cela rejoint les conclusions de Hernandez (2004 :194) sur la relation entre 
cadre de discours et coh&#233;sion lexicale. Il appara&#238;t donc indispensable de consid&#233;rer la 
segmentation TextTiling non pas de mani&#232;re isol&#233;e ou suffisante en elle-m&#234;me, mais comme 
partie prenante de configurations d'indices de natures diff&#233;rentes (linguistiques et 
discursives). Mais les r&#233;sultats que nous donnons dans le tableau 1 ne permettent pas de 
rendre compte d'un certain nombre de limites li&#233;es &#224; la fois &#224; notre m&#233;thode mais &#233;galement 
li&#233;es &#224; des difficult&#233;s inh&#233;rentes au type de corpus sur lequel nous travaillons. Nous venons de 
faire la remarque suivant laquelle il est n&#233;cessaire de consid&#233;rer indices linguistiques et indice 
statistiques de mani&#232;re compl&#233;mentaire. En fait, la prise en consid&#233;ration de certains indices 
discursifs devrait &#234;tre effective au moment de la d&#233;limitation des segments al&#233;atoires : ceci 
permettrait par exemple dans l'extrait de la figure 5 de faire d&#233;buter le segment au moment o&#249; 
un introducteur de cadre est &#233;galement pr&#233;sent. On peut alors supposer que la balise ouvrante 
&lt;HEARST&gt; se situerait simultan&#233;ment avec l'ouverture d'un cadre temporel et dans ce cas 
pr&#233;cis avec celle d'un SEDIS-H.
</p>
<p>394</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Utiliser le TextTiling pour le rep&#233;rage de SEDIS-H
</p>
<p>[...] Actuellement, la place tr&#232;s importante de la France au sein de l'ONU lui impose de r&#233;pondre 
aux menaces r&#233;gionales. &lt;/SEGMENT&gt; &lt;HEARST&gt; &lt;SEGMENT&gt; Elle participe aux op&#233;rations de 
maintien de la paix sous l'&#233;gide de l'ONU. Des casques bleus fran&#231;ais sont ou ont &#233;t&#233; pr&#233;sents en 
R&#233;publique Centrafricaine, en ex-Yougoslavie, &#224; J&#233;rusalem [...] &lt;/SEGMENT&gt; &lt;/HEARST&gt; [...] 
</p>
<p>Figure 5 : Limites de notre m&#233;thode : prendre en compte des indices discursifs comme les 
introducteurs de cadre de discours 
</p>
<p>Par ailleurs, nous avons d&#233;j&#224; soulign&#233; le fait que les textes sur lesquels nous travaillons sont 
des textes dans lesquels la performance visuelle est pr&#233;gnante. Ceci entra&#238;ne donc une mise en 
forme mat&#233;rielle tr&#232;s riche que la segmentation al&#233;atoire ne prend pas en consid&#233;ration. 
Concernant l'algorithme TextTiling, Hearst l'a &#233;valu&#233; sur des textes descriptifs (&#171; expository 
texts &#187;) ce qui est tr&#232;s diff&#233;rent du type encyclop&#233;dique sur lequel nous avons travaill&#233;. 
</p>
<p>&lt;SEGMENT&gt; En revanche, certaines sectes [...], que les Renseignements g&#233;n&#233;raux ont list&#233;es : 
- la d&#233;stabilisation mentale ;  - le caract&#232;re exorbitant des exigences financi&#232;res ; - la rupture 
induite avec l'environnement ; &lt;/SEGMENT&gt; &lt;SEGMENT&gt; - les atteintes &#224; l'int&#233;grit&#233; physique 
[...] ;  - l'embrigadement des enfants ; - le discours plus ou moins anti-social ; &lt;/SEGMENT&gt;
&lt;SEGMENT&gt; - les troubles &#224; l'ordre public ; - l'importance des d&#233;m&#234;l&#233;s judiciaires[...]
</p>
<p>Figure 6 : Limites de notre m&#233;thode : prendre en compte la mise en forme mat&#233;rielle 
</p>
<p>Dans cet exemple, nous pouvons voir que la segmentation al&#233;atoire se place n'importe 
comment au sein de l'&#233;num&#233;ration : nous proposons donc de modifier cette phase essentielle 
de segmentation du TextTiling en prenant en consid&#233;ration des indices relevant de la mise en 
forme mat&#233;rielle. Il est ainsi pour les &#233;num&#233;rations mais &#233;galement pour les parties titr&#233;es 
courtes (de niveau 3). 
</p>
<p>6 Conclusion
L'hypoth&#232;se selon laquelle les fronti&#232;res de segments th&#233;matiques peuvent servir d'indices 
contribuant au rep&#233;rage des segments d'information &#233;volutive semble se confirmer m&#234;me s'il 
s'av&#232;re n&#233;cessaire d'approfondir les exp&#233;rimentations pr&#233;sent&#233;es. L'objectif de ce travail n'est  
pas de montrer que les segments th&#233;matiques correspondent exactement aux SEDIS-H mais il 
consiste &#224; observer la possibilit&#233; d'exploiter les bornes initiales et/ou finales de tels segments 
conjointement &#224; d'autres indices de natures diverses (adverbiaux de temps, superlatifs, temps 
verbaux, etc.) pour le rep&#233;rage des SEDIS-H. Ainsi, nous envisageons notamment d'adapter 
l'algorithme TextTiling et plus pr&#233;cis&#233;ment la phase de d&#233;coupage en pseudo-blocs avec des 
techniques de segmentation de nature linguistique telles que l'encadrement du discours ou 
encore les titres pour am&#233;liorer nos r&#233;sultats et notre objectif g&#233;n&#233;ral. 
</p>
<p>R&#233;f&#233;rences
CHAROLLES M. (1997). L&#8217;Encadrement du Discours, Univers, Champs, Domaine et Espaces. 
Cahiers de Recherche linguistique. 
</p>
<p>HALLIDAY M., HASAN R. (1976). Cohesion in English. Longman Group Limited, London. 
</p>
<p>HEARST M. (1994). Multi-paragraph segmentation of expository texts. Proceedings of the
32th Annual Meeting of the Association for Computational Linguistics.
</p>
<p>395</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marion LAIGNELET, Christophe PIMM
</p>
<p>HERNANDEZ N. (2004). Description et D&#233;tection Automatique de Structures de Texte. Th&#232;se 
de doctorat, Universit&#233; de Paris XI. 
</p>
<p>JACKIEWICZ A., MINEL J.-L. (2003). L&#8217;identification des structures discursives engendr&#233;es par 
les cadres organisationnels. Actes de la 10&#232;me conf&#233;rence sur le traitement automatique des 
langues naturelles, TALN. Batz-sur-mer, France. 
</p>
<p>LAIGNELET M. (2006a). Rep&#233;rage de segments d&#8217;information &#233;volutive dans des documents 
de type encyclop&#233;dique. Actes de la 13&#232;me conf&#233;rence jeune chercheur sur le traitement 
automatique des langues naturelles, RECITAL. Presses Universitaires de Louvain, Louvain, 
Belgique.
</p>
<p>LAIGNELET M. (2006b). Analyse discursive pour le rep&#233;rage de segments d'information 
&#233;volutive. 74&#232;me Congr&#232;s de l'ACFAS, Description Linguistique pour le Traitemant 
Automatique du Fran&#231;ais (DLTAF-ACFAS). 16-18 mai 2006, Montr&#233;al, Canada. 
</p>
<p>LAIGNELET M. (2006c). Les titres et les introducteurs de cadre come indices pour le rep&#233;rage 
de segments d'information &#233;volutive. Actes du Colloque International Discours et Document 
(ISDD'06), Presses Universitaires de Caen, France. 
</p>
<p>MARCU D. (2000). The Theory and Practice of Discourse Parsing and Summarization, The 
MIT Press. 
</p>
<p>MINEL J.-L. (2002). Filtrage s&#233;mantique, du r&#233;sum&#233; automatique &#224; la fouille de textes,
Herm&#232;s. 
</p>
<p>PERY-WOODLEY M.-P. (2005). Discours, corpus, traitements automatiques. Herm&#232;s. 
</p>
<p>ROSSI J., BERT-ERBOUL A. (1991). S&#233;lection des informations importantes et compr&#233;hension 
de textes. Psychologie Fran&#231;aise.
</p>
<p>WIDL&#214;CHER A., BILHAUT F. (2005). La plate-forme LinguaStream : un outil d&#8217;exploration 
linguistique sur corpus, Actes de la 12e Conf&#233;rence Traitement Automatique du Langage 
Naturel (TALN). Dourdan, France. 
</p>
<p>396</p>

</div></div>
</body></html>