<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;valuation transparente de syst&#232;mes de questions-r&#233;ponses : application au focus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>&#201;valuation transparente de syst&#232;mes de questions-r&#233;ponses :
application au focus
</p>
<p>Sarra EL AYARI
LIMSI-CNRS, BP 133, F-91403 ORSAY
</p>
<p>Sarra.ElAyari@limsi.fr
</p>
<p>R&#233;sum&#233;. Les campagnes d&#8217;&#233;valuation ne tiennent compte que des r&#233;sultats finaux obtenus
par les syst&#232;mes de recherche d&#8217;informations (RI). Nous nous situons dans une perspective
d&#8217;&#233;valuation transparente d&#8217;un syst&#232;me de questions-r&#233;ponses, o&#249; le traitement d&#8217;une question
se fait gr&#226;ce &#224; plusieurs composants s&#233;quentiels. Dans cet article, nous nous int&#233;ressons &#224; l&#8217;&#233;tude
de l&#8217;&#233;l&#233;ment de la question qui porte l&#8217;information qui se trouvera dans la phrase r&#233;ponse &#224;
proximit&#233; de la r&#233;ponse elle-m&#234;me : le focus. Nous d&#233;finissons ce concept, l&#8217;appliquons au
syst&#232;me de questions-r&#233;ponses QALC, et d&#233;montrons l&#8217;utilit&#233; d&#8217;&#233;valuations des composants
afin d&#8217;augmenter la performance globale du syst&#232;me.
</p>
<p>Abstract. Evaluation campaigns take into account only the final results obtained by in-
formation retrieval systems. Our perspective is that of the glass box evaluation of a question-
answering system. The processing of a question is accomplished by a series of components. The
purpose of this article is to study the element in the sentence which holds the key information.
This element is to be found again in the sentence containing the answer next to the answer itself,
and is called the focus. We will begin by defining this concept. We will then applied it to the
QALC question answering system. Finally we will demonstrate the pertinence of using glass
box evaluations to enhance the global performance such systems.
</p>
<p>Mots-cl&#233;s : syst&#232;me de questions-r&#233;ponses, recherche d&#8217;information, &#233;valuation, focus.
Keywords: question answering system, information retrieval, evaluation, focus.
</p>
<p>1 Introduction
</p>
<p>Les syst&#232;mes de recherche d&#8217;information (RI) ont vu appara&#238;tre de nouveaux types d&#8217;outils ap-
pel&#233;s syst&#232;mes de questions-r&#233;ponses (SQR). C&#8217;est la prise en compte du besoin d&#8217;information
pr&#233;cise de l&#8217;utilisateur qui a motiv&#233; l&#8217;&#233;mergence de tels syst&#232;mes.
</p>
<p>Un SQR peut &#234;tre oppos&#233; &#224; un moteur de recherche sur Internet comme Google ou Yahoo ! sur
certains points bien pr&#233;cis. L&#8217;utilisateur saisit sa requ&#234;te en langue naturelle (LN) et non sous la
forme de mots cl&#233;s. En aval, le syst&#232;me propose la ou les r&#233;ponse(s) attendue(s) par l&#8217;utilisateur,
et ne lui renvoie pas quelques milliers de documents qu&#8217;il doit parcourir manuellement.
</p>
<p>Deux utilisations diff&#233;rentes s&#8217;esquissent clairement entre les deux types d&#8217;outils. Tandis que les
moteurs de recherche permettent de r&#233;cup&#233;rer des documents sur un th&#232;me g&#233;n&#233;ral, les syst&#232;mes
de questions-r&#233;ponses sont utilis&#233;s pour trouver une information pr&#233;cise, qui tient en quelques
</p>
<p>377</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sarra EL AYARI
</p>
<p>mots. Par exemple, la requ&#234;te, qui est donc une question, &#171; What is the FARC ? &#187;1 attend la
r&#233;ponse suivante : the Revolutionary Armed Forces of Colombia.
</p>
<p>Les conf&#233;rences organis&#233;es pour &#233;valuer les syst&#232;mes de questions-r&#233;ponses prennent unique-
ment en compte le r&#233;sultat final obtenu. Or des traitements, des hypoth&#232;ses sont instaur&#233;s &#224; dif-
f&#233;rentes &#233;tapes de la r&#233;solution des questions. Nous nous int&#233;ressons &#224; une &#233;valuation de type
bo&#238;te transparente, qui veut &#233;valuer les composants du syst&#232;me isol&#233;ment. Cette &#233;valuation est
appliqu&#233;e &#224; l&#8217;&#233;tude d&#8217;un &#233;l&#233;ment central pour l&#8217;extraction de la r&#233;ponse : le focus. Sa reconnais-
sance intervient au moment de l&#8217;analyse de la question ; il constitue l&#8217;&#233;l&#233;ment informationnel
pr&#233;sent dans la question situ&#233; &#224; proximit&#233; de la r&#233;ponse dans la phrase r&#233;ponse.
</p>
<p>Nous pr&#233;sentons ce qu&#8217;est un syst&#232;me de questions-r&#233;ponses (2), avant de nous focaliser sur
le syst&#232;me du LIMSI : QALC dans une perspective d&#8217;&#233;valuation de type &#171; glass box &#187; (bo&#238;te
transparente). Apr&#232;s avoir pr&#233;sent&#233; la dichotomie &#171; black box &#187; (bo&#238;te noire) / &#171; glass box &#187; (3),
nous appliquerons ces principes &#224; l&#8217;&#233;tude du focus (4).
</p>
<p>2 Syst&#232;mes de questions-r&#233;ponses
</p>
<p>2.1 Architecture d&#8217;un syst&#232;me de questions-r&#233;ponses
</p>
<p>Un syst&#232;me de questions-r&#233;ponses prend une question en entr&#233;e et doit fournir une r&#233;ponse
courte et pr&#233;cise &#224; cette question. Nous travaillons sur le syst&#232;me QALC d&#233;velopp&#233; au LIMSI.
QALC est con&#231;u pour &#171; traiter des questions factuelles ou encyclop&#233;diques portant sur n&#8217;im-
porte quel domaine &#187; (Ferret et al., 2001). En effet, ce syst&#232;me travaille en domaine ouvert,
ce qui implique une certaine robustesse des processus employ&#233;s. Pour ce faire, le syst&#232;me est
compos&#233; de diff&#233;rents modules que nous allons expliciter. La cha&#238;ne de traitement est pr&#233;sent&#233;e
sur le sch&#233;ma 12.
</p>
<p>FIG. 1 &#8211; Cha&#238;ne de traitement de QALC
</p>
<p>1Cette question est extraite du corpus CLEF 2005.
2Ce sch&#233;ma est extrait de (Grau, 2004a).
</p>
<p>378</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation transparente de syst&#232;mes de questions-r&#233;ponses
</p>
<p>Le traitement effectu&#233; par un SQR se fait en une s&#233;quence de trois &#233;tapes : l&#8217;analyse de la
question, le traitement des documents s&#233;lectionn&#233;s par le moteur de recherche et l&#8217;extraction de
la r&#233;ponse dans les documents r&#233;cup&#233;r&#233;s. Le traitement est ici plus fin que celui des moteurs
de recherche : des traitements suppl&#233;mentaires sont effectu&#233;s en amont et en aval du moteur de
recherche.
</p>
<p>Il devient n&#233;cessaire de r&#233;aliser un travail plus fin sur la langue, qui fait appel au traitement
automatique de la langue. Les informations principales dont on dispose se trouvent dans la
question. Il s&#8217;agit d&#8217;en tirer le plus d&#8217;&#233;l&#233;ments pertinents possibles.
</p>
<p>2.2 Le module d&#8217;analyse des questions
</p>
<p>Le module d&#8217;analyse des questions permet de r&#233;cup&#233;rer des informations essentielles pour iden-
tifier la r&#233;ponse correspondant &#224; la question. Nous pr&#233;sentons diff&#233;rents &#233;l&#233;ments qui importent
pour le rep&#233;rage de la r&#233;ponse pour lesquels des traitements linguistiques peuvent &#234;tre r&#233;alis&#233;s.
&#8211; Le type de r&#233;ponse attendu, dans le cas o&#249; la r&#233;ponse est une entit&#233; nomm&#233;e (c&#8217;est-&#224;-dire
</p>
<p>une unit&#233; d&#8217;un &#233;l&#233;ment discursif qui fait r&#233;f&#233;rence &#224; une personne, un lieu, une organisation,
etc.). Ces entit&#233;s sont rep&#233;r&#233;es comme telles dans les documents extraits par le moteur de
recherche. Elles sont d&#233;termin&#233;es par le pronom interrogatif utilis&#233; ainsi que par des crit&#232;res
syntaxiques et s&#233;mantiques : qui indique que la r&#233;ponse devra &#234;tre une personne, o&#249; indique
un lieu, quand indique une date, etc. S&#8217;il s&#8217;agit d&#8217;une question de typeQuel pr&#233;sident fran&#231;ais
a &#233;t&#233; &#233;lu deux fois ? le syst&#232;me rep&#232;re une entit&#233; nomm&#233;e de type personne.
</p>
<p>&#8211; Le type s&#233;mantique de la r&#233;ponse, lorsque celui-ci est explicite, est d&#233;termin&#233; par un terme
g&#233;n&#233;rique dans lequel est inclus le terme sur lequel la question porte. Pour Quelle est la
capitale du Togo ? le type s&#233;mantique de la r&#233;ponse sera lieu, par extension s&#233;mantique du
terme capitale.
</p>
<p>&#8211; L&#8217;objet de la question, &#224; savoir le focus, qui correspond au mot de la question le plus impor-
tant, d&#233;fini comme &#233;tant celui que l&#8217;on doit retrouver dans la phrase r&#233;ponse. Il s&#8217;agit du sujet
de la question en quelque sorte.
</p>
<p>&#8211; La cat&#233;gorie de la question, d&#233;duite de son analyse syntaxique.
&#8211; Une extension s&#233;mantique de la question, qui consiste en la recherche de synonymes ou/et
</p>
<p>d&#8217;hyperonymes.
Par exemple, le traitement de la question Qui a tu&#233; Henri IV ? devra obtenir les informations
suivantes :
&#8226; type attendu de la question : PERSONNE (entit&#233; nomm&#233;e)
&#8226; objet de la question : Henri IV
&#8226; cat&#233;gorie de la question : qui
&#8226; forme syntaxique de la question : PERSONNE VP3 Focus
&#8226; forme syntaxique de la r&#233;ponse :
</p>
<p>&#8211; REPONSE VP Focus pour &lt;R&#233;ponse attendue&gt; a tu&#233; Henri IV.
&#8211; FOCUS VP REPONSE pour Henri IV a &#233;t&#233; tu&#233; par &lt;R&#233;ponse attendue&gt;.
&#8211; REPONSE nominalisation du verbe FOCUS pour &lt;R&#233;ponse attendue&gt;, le tueur d&#8217;Henri IV.
</p>
<p>&#8226; extension s&#233;mantique : poignarder, assassiner, abattre
</p>
<p>3VP est l&#8217;abr&#233;viation de verbe principal.
</p>
<p>379</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sarra EL AYARI
</p>
<p>3 &#201;valuation fine des processus mis en place
</p>
<p>3.1 &#201;valuation de type &#171; black box &#187; (bo&#238;te noire)
</p>
<p>Les enjeux d&#8217;&#233;valuation des syst&#232;mes de recherche d&#8217;informations ont pris une importance plus
forte avec l&#8217;av&#232;nement du Web et le d&#233;veloppement industriel des traitements textuels avec
des infrastructures comme celle de la DARPA (Defense Advances Research Projects Agency),
le NIST (National Institute of Standards and Technology) ou encore LDC (Linguistic Data
Consortium) principalement aux Etats-Unis, et une pr&#233;dominance de la langue anglaise.
</p>
<p>En ce qui concerne les syst&#232;mes de questions-r&#233;ponses, on distingue essentiellement deux cam-
pagnes internationales que sont TREC4 (Text REtrieval Conference) et CLEF5 (Cross Language
Evaluation Forum), ainsi qu&#8217;une campagne fran&#231;aise : EQUER6 (&#201;valuation en Question R&#233;-
ponse). Nous pouvons &#233;galement citer NTCIR, o&#249; l&#8217;&#233;valuation porte uniquement sur des sys-
t&#232;mes qui traitent les langues japonaise et chinoise.
</p>
<p>La premi&#232;re campagne d&#8217;&#233;valuation en questions-r&#233;ponses a eu lieu en 1999 : il s&#8217;agit de la
huiti&#232;me &#233;dition de TREC, qui ne portait jusqu&#8217;alors que sur les syst&#232;mes de RI. Le d&#233;roulement
de la t&#226;che s&#8217;est complexifi&#233;e au fil des ann&#233;es. Si les premi&#232;res campagnes proposaient 200
questions, pour lesquelles les participants pouvaient proposer cinq r&#233;ponses par question sur
des questions uniquement factuelles, il s&#8217;agit d&#233;sormais de plus de 500 questions, qui peuvent
&#234;tre factuelles, mais qui peuvent &#233;galement porter sur des listes, des questions d&#233;finitionnelles et
des sc&#233;narios (questions li&#233;es aux pr&#233;c&#233;dentes). Enfin, certaines questions n&#8217;ont pas de r&#233;ponse
dans les documents du corpus, et le syst&#232;me doit pouvoir l&#8217;indiquer. Une seule r&#233;ponse courte
est exig&#233;e, et celle-ci doit &#234;tre accompagn&#233;e d&#8217;une justification (extrait de phrase permettant
de valider la r&#233;ponse propos&#233;e). De la m&#234;me fa&#231;on, la taille du corpus a augment&#233; de 528 000
documents en 1999 &#224; 1 033 000 en 2005.
</p>
<p>Ces campagnes permettent une &#233;valuation globale des syst&#232;mes entre eux. Il s&#8217;agit de structures
d&#8217;&#233;valuation qui permettent de stimuler la recherche avec de nouveaux enjeux chaque ann&#233;e.
Il devient alors possible de faire un constat mesur&#233; de l&#8217;avanc&#233; technologique de ces syst&#232;mes
chaque ann&#233;e. Un autre aspect important r&#233;side dans la mise au point d&#8217;&#233;talons de r&#233;f&#233;rence
pour &#233;valuer ces syst&#232;mes avec des processus bien d&#233;finis et des m&#233;thodes de comparaisons qui
se veulent objectives.
</p>
<p>N&#233;anmoins, si la n&#233;cessit&#233; de ces campagnes d&#8217;&#233;valuation n&#8217;est plus &#224; d&#233;montrer, on peut tout
de m&#234;me avancer quelques r&#233;serves quant &#224; leur &#233;valuation car seul le r&#233;sultat final obtenu
par chacun des syst&#232;mes est pris en compte (classement selon les r&#233;sultats obtenus). Elles ne
permettent pas d&#8217;&#233;valuer ce qui se passe &#224; l&#8217;int&#233;rieur des syst&#232;mes de fa&#231;on pr&#233;cise.
</p>
<p>3.2 &#201;valuation de type &#171; glass box &#187; (bo&#238;te transparente)
</p>
<p>Contrairement aux campagnes pr&#233;sent&#233;es, une &#233;valuation de type bo&#238;te transparente donne un
acc&#232;s plus fin aux r&#233;sultats produits par le syst&#232;me. Nous travaillons sur des syst&#232;mes compos&#233;s
de plusieurs modules qui s&#8217;encha&#238;nent les uns apr&#232;s les autres (traitement de la question, des
</p>
<p>4http ://trec.nist.gov/
5http ://clef.isti.cnr.it/
6http ://www.technolangue.net/article195.html/
</p>
<p>380</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation transparente de syst&#232;mes de questions-r&#233;ponses
</p>
<p>documents puis extraction de la r&#233;ponse). On voit alors la pertinence de telles &#233;valuations : le
r&#233;sultat d&#8217;un module est pris en entr&#233;e par celui qui suit, et le r&#233;sultat obtenu en aval d&#233;pend
alors de la qualit&#233; des traitements effectu&#233;s. Ces nouvelles formes d&#8217;&#233;valuation deviennent n&#233;-
cessaires (Sparck Jones, 2001).
</p>
<p>Il s&#8217;agit donc d&#8217;observer les r&#233;sultats produits par les diff&#233;rents modules isol&#233;ment, sans avoir
&#224; lancer le processus dans sa globalit&#233;, lequel ne sera pas forc&#233;ment r&#233;v&#233;lateur des probl&#232;mes
existants. Une &#233;valuation s&#233;lective et partitionn&#233;e permet de mesurer l&#8217;efficacit&#233; r&#233;elle de tel
ou tel processus, afin de maximiser l&#8217;&#233;quilibre entre temps de traitement et efficacit&#233;. En effet,
certains traitements peuvent &#234;tre longs &#224; s&#8217;ex&#233;cuter sans pour autant &#234;tre significatifs au niveau
des r&#233;sultats. C&#8217;est sur ce point qu&#8217;une &#233;valuation interne permet d&#8217;am&#233;liorer un syst&#232;me. &#201;va-
luer de fa&#231;on pointue permet de visualiser de fa&#231;on pr&#233;cise ce qui n&#8217;est pas correct, mais aussi
d&#8217;&#233;valuer la &#171; rentabilit&#233; &#187; de certains traitements.
</p>
<p>Plus pr&#233;cis&#233;ment, dans le cadre qui nous int&#233;resse, analyser les r&#233;sultats obtenus par le syst&#232;me
va permettre la red&#233;finition de certaines notions comme le focus, d&#233;finitions qui seraient trop
larges ou bien trop strictes par apport &#224; l&#8217;utilisation qui en est fait. De plus, une mise en place
d&#8217;un proc&#233;d&#233; d&#8217;&#233;valuation transparente permet de modifier certains traitements, d&#8217;en ajouter ou
bien d&#8217;en enlever et de tester la pertinence de ces modifications.
</p>
<p>Nous allons appliquer cette m&#233;thode &#233;valuative &#224; l&#8217;&#233;tude de la notion de focus dans le module
d&#8217;analyse de la phrase dans le syst&#232;me de question-r&#233;ponse QALC.
</p>
<p>4 Application &#224; l&#8217;&#233;tude de la notion de focus
</p>
<p>Le focus est un &#233;l&#233;ment informationnel fort dans un &#233;nonc&#233; (qu&#8217;il soit &#233;crit ou oral), qui est
utilis&#233; pour aider &#224; l&#8217;extraction de r&#233;ponses dans QALC.
</p>
<p>4.1 La notion de focus dans la litt&#233;rature
</p>
<p>La notion de focus prend ses origines dans la linguistique, et notamment en syntaxe et en pho-
nologie. On parle de focus et d&#8217;op&#233;ration de focalisation avec des niveaux d&#8217;analyse aussi vari&#233;s
que la syntaxe, la s&#233;mantique, la phonologie ou la phon&#233;tique. Ces disciplines consid&#232;rent que
le focus est un &#233;l&#233;ment informationnel important de la phrase. Il peut se manifester par une mise
en valeur intonative &#224; l&#8217;oral, et est l&#8217;objet mis en exergue dans les phrases cliv&#233;es (C&#8217;est cette
poup&#233;e que je veux).
</p>
<p>Partant de ce constat, Wendy Lehnert a &#233;t&#233; la premi&#232;re &#224; appliquer ce concept de focus &#224; l&#8217;&#233;tude
des questions pour les syst&#232;mes de questions-r&#233;ponses (Lehnert, 1978). Elle d&#233;finit alors le
focus comme le concept de la question qui repr&#233;sente le besoin d&#8217;information exprim&#233; par la
question.
</p>
<p>Plusieurs syst&#232;mes de questions-r&#233;ponses ont int&#233;gr&#233; la reconnaissance du focus &#224; leur traite-
ment de la question, et en ont donn&#233; une d&#233;finition.
&#8211; Pour (Ferret et al., 2002) :
</p>
<p>&#171; l&#8217;&#233;l&#233;ment important de la question, celui qui devra se trouver &#224; proximit&#233; de la r&#233;ponse &#187;.
&#8211; Pour (Plamondon et al., 2002) :
</p>
<p>&#171; une portion de la question qui doit obligatoirement figurer pr&#232;s du candidat-r&#233;ponse [...].
</p>
<p>381</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sarra EL AYARI
</p>
<p>Par exemple, le focus de la question What was the monetary value of the Nobel Peace Prize
in 1989 ? serait Nobel Peace Prize car l&#8217;hypoth&#232;se est faite que la r&#233;ponse correcte devrait se
trouver la proximit&#233; de l&#8217;expression Nobel Peace Prize ou d&#8217;une expression s&#233;mantiquement
apparent&#233;e &#187;. Leur syst&#232;me est XR3 7, premier syst&#232;me de question-r&#233;ponse d&#233;velopp&#233; &#224;
l&#8217;Universit&#233; de Montr&#233;al.
</p>
<p>&#8211; Pour (Mendes &amp; Moriceau, 2004) :
&#171; l&#8217;&#233;l&#233;ment le plus important de la question i.e. le focus &#187;.
</p>
<p>Ces trois d&#233;finitions, qui viennent de diff&#233;rentes &#233;quipes de recherche, mettent en relief l&#8217;int&#233;r&#234;t
de la reconnaissance d&#8217;un terme qui doit se trouver dans la r&#233;ponse : le focus. Elles montrent
le lien syntaxique qui peut exister au sein de la phrase r&#233;ponse entre le focus et la r&#233;ponse &#224; la
question.
</p>
<p>4.2 Une (re)d&#233;finition du focus
</p>
<p>4.2.1 Int&#233;r&#234;t du focus
</p>
<p>Le syst&#232;me QALC se situe dans une perspective d&#8217;approche robuste, o&#249; peu de connaissances
s&#233;mantiques sont utilis&#233;es. De ce fait, nous essayons de d&#233;duire de fa&#231;on automatique le plus de
caract&#233;ristiques de la question. Le focus appara&#238;t alors comme un &#233;l&#233;ment important &#224; rep&#233;rer,
n&#233;cessaire &#224; la s&#233;lection des documents ainsi que pour l&#8217;extraction de la r&#233;ponse, dont il se situe
&#224; proximit&#233;.
</p>
<p>4.2.2 D&#233;finition du terme
</p>
<p>Le focus est un terme pivot pour extraire la r&#233;ponse attendue, qui doit appara&#238;tre &#224; proximit&#233;
de la r&#233;ponse (Ferret et al., 2002). Le syst&#232;me recherche le focus dans la phrase r&#233;ponse, puis
applique des patrons d&#8217;extraction par rapport &#224; sa position dans la phrase r&#233;ponse. Ce terme
focus est un &#233;l&#233;ment important pour l&#8217;extraction de la r&#233;ponse courte attendue.
</p>
<p>Dans notre approche, il constitue le plus souvent le sujet de la question. En effet, pour When
was the treaty on Conventional Forces in Europe signed ? le focus est le sujet de la question :
treaty. Pour des questions de type Which EU conference adopted Agenda 2000 in Berlin ? il
s&#8217;agit alors du compl&#233;ment d&#8217;objet direct Agenda 2000. Consid&#233;rer le focus comme le sujet ou
l&#8217;objet d&#8217;un verbe sont des choix effectu&#233;s afin d&#8217;impl&#233;menter cette notion de focus.
</p>
<p>Dans notre exp&#233;rience, le focus correspond &#224; un groupe nominal pr&#233;sent dans la question, qui
doit appara&#238;tre &#224; proximit&#233; de la r&#233;ponse. Nous diff&#233;ren&#231;ons le focus du type g&#233;n&#233;ral, qui ren-
seigne sur le type de la r&#233;ponse attendue. Cette diff&#233;renciation est tr&#232;s claire si nous l&#8217;illustrons
d&#8217;exemples :
</p>
<p>&#8211; Which genes cause cancer ?
L&#8217;information recherch&#233;e est un type de g&#232;ne. Genes constitue le type g&#233;n&#233;ral de la question.
Par contre, le focus, c&#8217;est-&#224;-dire le terme autour duquel la r&#233;ponse &#224; la question s&#8217;articule, est
cancer.
</p>
<p>7Il s&#8217;agit de l&#8217;acronyme de eXtraction de R&#233;ponses Rapide et Robuste.
</p>
<p>382</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation transparente de syst&#232;mes de questions-r&#233;ponses
</p>
<p>&#8211; Which US Army Division provided the paratroopers who took part in the invasion of Haiti ?
Le focus rep&#233;r&#233; est paratroopers et US Army Division constitue ici le type g&#233;n&#233;ral.
Ce premier est un indice pour trouver la r&#233;ponse, l&#8217;autre permet de renseigner sur la nature
de l&#8217;information recherch&#233;e.
</p>
<p>Mais cette d&#233;finition du focus est-elle suffisante ? C&#8217;est ce que nous allons tenter de mesurer en
analysant les r&#233;sultats produits par notre syst&#232;me.
</p>
<p>4.3 Observation des donn&#233;es
</p>
<p>Nous effectuons dans cette &#233;tude une &#233;valuation transparente du module d&#8217;analyse des questions
en &#233;valuant la reconnaissance ou non du focus et en observant en aval le nombre de r&#233;ponses
correctes obtenues pour les 200 questions dont nous disposons. Nous travaillons sur le corpus de
CLEF 2005, campagne &#224; laquelle le LIMSI a particip&#233; avec le syst&#232;me QALC. Nous disposons
de 200 questions, r&#233;parties en 16 cat&#233;gories.
</p>
<p>Apr&#232;s avoir d&#233;fini ce que nous consid&#233;rons comme le focus, nous avons constitu&#233; une base de
donn&#233;es afin d&#8217;observer en d&#233;tail le traitement du focus effectu&#233; par le syst&#232;me de questions -
r&#233;ponses QALC.
</p>
<p>Pour l&#8217;instant, le syst&#232;me reconna&#238;t comme focus le premier groupe nominal rencontr&#233; qui est
diff&#233;rent du type g&#233;n&#233;ral. Il s&#8217;agit de faire une approximation de la notion de sujet.
</p>
<p>Voici un exemple de question qui contient un type g&#233;n&#233;ral et un focus : In which year did the
Islamic Revolution take place in Iran ? o&#249; year constitue le type g&#233;n&#233;ral et Islamic Revolution
le focus. L&#8217;analyse de la question aboutit bien &#224; la reconnaissance de ces deux &#233;l&#233;ments. La
r&#233;ponse extraite est correcte : since the 1979 Islamic Revolution. Cet exemple nous permet de
l&#233;gitimer la prise en compte de ces deux informations dans l&#8217;analyse des questions. Elles sont
distinctes et n&#233;cessaires &#224; la r&#233;solution des questions.
</p>
<p>Nous avons effectu&#233; une &#233;tude de corpus manuelle afin d&#8217;observer les cas o&#249; la reconnaissance
du focus pose probl&#232;me au syst&#232;me.
</p>
<p>4.3.1 Focus non rep&#233;r&#233;
</p>
<p>Dans certains cas, le syst&#232;me ne rep&#232;re pas le focus. Par exemple, Which institution initiated
the European youth campaign against racism ? est une question pour laquelle aucun focus n&#8217;est
sp&#233;cifi&#233;. En effet, comme le premier groupe nominal rep&#233;r&#233; est le type g&#233;n&#233;ral, le syst&#232;me ne
recherche pas de focus. Il n&#8217;y a pas de r&#233;ponse correcte trouv&#233;e pour cet exemple, alors que
l&#8217;identification de campaign (pour se limiter &#224; la t&#234;te du focus) aurait pu permettre au syst&#232;me
une analyse des r&#233;ponses plus compl&#232;te.
</p>
<p>4.3.2 Focus erron&#233;
</p>
<p>Certains focus identifi&#233;s ne correspondent pas &#224; notre d&#233;finition et g&#233;n&#232;rent des r&#233;ponses erro-
n&#233;es. C&#8217;est le cas pour Which EU conference adopted Agenda 2000 in Berlin ? o&#249; le syst&#232;me
identifie EU conference comme focus, alors qu&#8217;il s&#8217;agit du type g&#233;n&#233;ral. Or, le type g&#233;n&#233;ral ne
peut pas toujours &#234;tre utilis&#233; pour extraire des r&#233;ponses. Il s&#8217;agit d&#8217;un terme g&#233;n&#233;rique - le plus
</p>
<p>383</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sarra EL AYARI
</p>
<p>souvent un hyperonyme - sur lequel porte la question et qui n&#8217;est pas forc&#233;ment pr&#233;sent tel quel
dans la r&#233;ponse.
</p>
<p>Si le syst&#232;me attribue comme focus le type g&#233;n&#233;ral d&#8217;une question, il ne pourra logiquement pas
trouver de r&#233;ponse correcte. Dans Which Russian city is twinned with Glasgow ? nous voyons
bien que Russian city ne peut &#234;tre un terme pivot autour duquel rechercher la r&#233;ponse. La r&#233;-
ponse attendue est une ville russe, mais la phrase r&#233;ponse ne comportera pas forc&#233;ment cette
information.
</p>
<p>Quand le syst&#232;me se trompe de focus, en le confondant avec le type g&#233;n&#233;ral, il ne trouve pas de
r&#233;ponse.
</p>
<p>4.3.3 Focus difficile &#224; d&#233;terminer
</p>
<p>D&#8217;autres questions posent probl&#232;me quant &#224; la d&#233;finition m&#234;me d&#8217;un focus. En effet, si l&#8217;on
prend l&#8217;exemple What newspaper was found in Kiev in 1994 ? le type g&#233;n&#233;ral est newspaper
mais nous n&#8217;avons pas de terme focus. Certaines questions sont plus difficiles &#224; traiter comme
According to which government did radioactivity from Chernobyl stop at the Franco-German
border ? Doit-on se focaliser sur government, radioactivity ou encore Franco-German border ?
En fonction de la d&#233;finition donn&#233;e du focus, government d&#233;signe le type attendu de la r&#233;-
ponse : nous recherchons l&#8217;instance d&#8217;un gouvernement. Par contre, en ce qui concerne le fo-
cus, le terme doit &#234;tre li&#233; syntaxiquement &#224; la formulation de la r&#233;ponse. Radioactivity appara&#238;t
alors comme un bon candidat. Il s&#8217;agit l&#224; encore du sujet de la question, qui devra se trouver &#224;
proximit&#233; de la r&#233;ponse attendue.
</p>
<p>5 Conclusion
</p>
<p>La perspective de cette premi&#232;re analyse est de regarder plus finement la d&#233;finition du focus, de
fa&#231;on &#224; maximiser les r&#233;sultats obtenus. Il sera int&#233;ressant de voir comment formaliser le focus
pour r&#233;pondre aux difficult&#233;s soulev&#233;es dans cet article, afin que le syst&#232;me le retrouve automa-
tiquement. Cela suppose d&#8217;affiner la d&#233;finition du focus, et de modifier les patrons d&#8217;extraction
de la r&#233;ponse qui lui sont li&#233;s. A plus long terme, nous nous int&#233;ressons au d&#233;veloppement d&#8217;une
m&#233;thodologie d&#8217;&#233;valuation transparente des syst&#232;mes de questions-r&#233;ponses, de fa&#231;on &#224; affiner
les traitements, et essentiellement &#224; proposer des traitements diff&#233;rents selon les questions. Il
s&#8217;agira de revoir la typologie effective des questions en fonction d&#8217;&#233;l&#233;ments comme la structure
syntaxique de la r&#233;ponse ou encore le type de focus. Surtout, nous pensons &#233;galement qu&#8217;une
&#233;tude fine des r&#233;ponses obtenues ainsi que des r&#233;ponses qu&#8217;il aurait fallu obtenir pourra nous
permettre de valider ou encore une fois d&#8217;affiner notre d&#233;finition du focus, ainsi que de mesurer
la pertinence de cette information dans notre syst&#232;me.
</p>
<p>Nous nous proposons de plus d&#8217;affiner notre d&#233;finition du focus en fonction des r&#233;ponses obte-
nues. Il serait int&#233;ressant de pouvoir par la suite r&#233;aliser une &#233;tude comparative avec un autre
syst&#232;me de questions-r&#233;ponses : RITEL8 (Rosset et al., 2006) afin de tester la validit&#233; de nos
hypoth&#232;ses.
</p>
<p>En nous inscrivant dans une d&#233;marche d&#8217;&#233;valuation transparente de syst&#232;mes de questions-
</p>
<p>8Plus d&#8217;informations sur http ://ritel.limsi.fr/.
</p>
<p>384</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;valuation transparente de syst&#232;mes de questions-r&#233;ponses
</p>
<p>r&#233;ponses, nous nous sommes int&#233;ress&#233;e &#224; l&#8217;&#233;tude du focus, &#233;l&#233;ment essentiel pour l&#8217;extraction
de la r&#233;ponse attendue de la question. Cette premi&#232;re observation nous a permis de voir que la
red&#233;finition du concept utilis&#233; permet d&#8217;affiner les r&#233;sultats et de les am&#233;liorer. Cette d&#233;marche
n&#8217;est pas possible lors d&#8217;&#233;valuations de type bo&#238;te noire, or elle est plus que n&#233;cessaire pour
l&#8217;am&#233;lioration des syst&#232;mes, en particulier des questions-r&#233;ponses qui sont form&#233;s de plusieurs
composants qui interagissent entre eux de mani&#232;re s&#233;quentielle. Ce type d&#8217;&#233;valuation appa-
ra&#238;t bel et bien comme compl&#233;mentaire aux &#233;valuations de type bo&#238;te noire, afin d&#8217;am&#233;liorer
finement les traitements effectu&#233;s dans l&#8217;optique, par la suite, de l&#8217;obtention d&#8217;une meilleure
performance globale.
</p>
<p>Remerciements
</p>
<p>Un &#233;norme merci &#224; Anne-Laure Ligozat pour son aide, ses encouragements et ses bons conseils.
Grand merci aussi &#224; Brigitte Grau et Beno&#238;t Habert pour leur aide et leurs relectures.
</p>
<p>R&#233;f&#233;rences
BERTHELIN J.-B., GRAU B. &amp; HURAULT-PLANTET M. (2001). Two levels of evaluation in
a complex NL system. Workshop on Evaluation for Language and Dialogue Systems.
FERRET O., GRAU B., HURAULT-PLANTET M., ILLOUZ G. &amp; JACQUEMIN C. (2001). Uti-
lisation des entit&#233;s nomm&#233;es et des variantes terminologiques dans un syst&#232;me de question-
r&#233;ponse. Actes de TALN.
FERRET O., GRAU B., HURAULT-PLANTET M., ILLOUZ G., MONCEAUX L., ROBBA I.
&amp; VILNAT A. (2002). Recherche de la r&#233;ponse fond&#233;e sur la reconnaissance du focus de la
question. Actes de TALN.
GRAU B. (2004a). Evaluation des syst&#232;mes de question-r&#233;ponse. In &#201;valuation des syst&#232;mes
de traitement de l&#8217;information, chapter 3, p. 77&#8211;98. Herm&#232;s.
GRAU B. (2004b). Les syst&#232;mes de question-r&#233;ponse. InM&#233;thodes avanc&#233;es pour les syst&#232;mes
de recherche d&#8217;informations, chapter 10, p. 189&#8211;218. Herm&#232;s.
HARABIGIU S. &amp; MOLDOVAN D. (2003). Question Answering. Revue Computational Lin-
guistics.
HARABIGIU S., MOLDOVAN D., PASCA M. &amp; SURDEANU M. (2003). Performance Issues
and Error Analysis in an Open-Domain Question Answering System. ACM Transactions on
Informations Systems.
LEHNERT W. (1978). The Process of Question Answering : A Computer Simulation of Cogni-
tion. John Wiley &amp; Sons Inc.
MENDES S. &amp; MORICEAU V. (2004). L&#8217;analyse des questions : int&#233;r&#234;t pour la g&#233;n&#233;ration des
r&#233;ponses. Workshop Question-R&#233;ponse.
PLAMONDON L., KOSSEIM L. &amp; LAPALME G. (2002). The quantum question answering
system at trec-11. In E. M. VORHEES &amp; D. K. HARMAN, Eds., Proceedings of the Eleventh
Text Retrieval Conference (TREC-2002), p. 750&#8211;757, Gaithersburg, Maryland : NIST.
ROSSET S., GALIBERT O., GABRIEL I. &amp; MAX A. (2006). Interaction et recherche d&#8217;infor-
mation : le projet RITEL. Revue TAL.
</p>
<p>385</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sarra EL AYARI
</p>
<p>SPARCK JONES K. (2001). Automatic language and information processing : rethinking eva-
luation. In Natural Language Engineering, chapter 7, p. 1&#8211;18.
VOORHEES E. M. &amp; HARMAN D. K. (2005). TREC : Experiment and Evaluation in Infor-
mation Retrieval. MIT Press.
</p>
<p>386</p>

</div></div>
</body></html>