<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitement de d&#233;signations orales dans un contexte visuel</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Traitement de d&#233;signations orales dans un contexte visuel
</p>
<p>Ali CHOUMANE
IRISA/Cordial, Universit&#233; de Rennes1
</p>
<p>6 rue de Kerampont, BP80518, 22305 Lannion, France
choumane@irisa.fr
</p>
<p>R&#233;sum&#233;. Nous nous int&#233;ressons aux syst&#232;mes multimodaux qui utilisent les modes et mo-
dalit&#233;s suivantes : l&#8217;oral (et le langage naturel) en entr&#233;e et en sortie, le geste en entr&#233;e et le
visuel en sortie par affichage sur &#233;cran. L&#8217;usager &#233;change avec le syst&#232;me par un geste et/ou
un &#233;nonc&#233; oral en langue naturelle. Dans cet &#233;change, encod&#233; sur les diff&#233;rentes modalit&#233;s, se
trouvent l&#8217;expression du but de l&#8217;usager et la d&#233;signation des objets (r&#233;f&#233;rents) n&#233;cessaires &#224; la
r&#233;alisation de ce but. Le syst&#232;me doit identifier de mani&#232;re pr&#233;cise et non ambigu&#235; les objets
d&#233;sign&#233;s par l&#8217;usager. Nous traitons plus sp&#233;cialement dans cet article les d&#233;signations orales,
sans geste, des objets dans le contexte visuel. En effet, l&#8217;ensemble du contexte multimodal, dont
le mode visuel, influe sur la production de l&#8217;entr&#233;e de l&#8217;usager. Afin d&#8217;identifier une d&#233;signa-
tion produite en s&#8217;appuyant sur le contexte visuel, nous proposons un algorithme qui utilise des
connaissances &#171; classiques &#187; linguistiques, des connaissances sur les objets manipul&#233;s, et des
connaissances sur les aspects perceptifs (degr&#233; de saillance) associ&#233;s &#224; ces objets.
</p>
<p>Abstract. We are interested about multimodal systems that use the following modes and
modalities : speech (and natural language) as input as well as output, gesture as input and
visual as output through displaying on the screen. The user exchanges with the system by a
gesture and/or an oral statement in natural language. This exchange, encoded on the different
modalities, contains the goal of the user and also the designation of objects (referents) necessary
to the realization of this goal. The system must identify in a precise and non-ambiguous way the
objects designated by the user. In this paper, our main concern is the oral designations, without
gesture, of objects in the visual context. Indeed, the whole of the multimodale context including
visual mode, influences the production of the user input. In order to identify a designation based
on the visual context, we propose an algorithm which uses &#171; traditional &#187; linguistic knowledge,
knowledge about manipulated objects and perceptive aspects (degree of salience) associated to
these objects.
</p>
<p>Mots-cl&#233;s : communication homme machine multimodale, r&#233;f&#233;rence, saillance.
Keywords: multimodal human computer communication, reference, salience.
</p>
<p>1 Introduction
</p>
<p>Cette &#233;tude 1 se situe dans le contexte des syst&#232;mes de communication personne-machine mul-
timodaux. Le but de tels syst&#232;mes est de permettre aux utilisateurs d&#8217;obtenir la r&#233;alisation de
</p>
<p>1Ces travaux sont partiellement financ&#233;s par le contrat 211-B2-9/ARED 1800 du conseil r&#233;gional de Bretagne,
France.
</p>
<p>479</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ali CHOUMANE
</p>
<p>services. Par exemple actuellement des syst&#232;mes multimodaux sont con&#231;us pour fournir des
renseignements sur des horaires de vols a&#233;riens, pour &#233;laborer des itin&#233;raires ou encore pour
aider la r&#233;alisation de maquettes ou de plans.
</p>
<p>L&#8217;interaction entre l&#8217;utilisateur humain et le syst&#232;me pour la r&#233;alisation de service n&#233;cessite
d&#8217;atteindre un consensus sur le but &#224; r&#233;aliser. Cet accord concerne une compr&#233;hension mutuelle
des intentions qui peuvent appara&#238;tre (et qu&#8217;il faut satisfaire) durant les diff&#233;rentes phases de
l&#8217;interaction mais aussi une vue partag&#233;e sur toutes les entit&#233;s (param&#232;tres, objets, ...) manipu-
l&#233;es et n&#233;cessaires &#224; l&#8217;accomplissement de la t&#226;che.
</p>
<p>L&#8217;utilisateur d&#233;signe ces entit&#233;s en recourant aux modes et modalit&#233;s &#224; sa disposition : oral,
langue, geste... On parle d&#8217;activit&#233;s r&#233;f&#233;rentielles. Un r&#244;le important d&#8217;un syst&#232;me est de recon-
na&#238;tre et de comprendre ces activit&#233;s r&#233;f&#233;rentielles.
</p>
<p>Ce travail est ardu car le syst&#232;me est confront&#233; &#224; de nombreuses difficult&#233;s. La performance de
l&#8217;utilisateur dans l&#8217;activit&#233; de d&#233;signation n&#8217;est pas s&#251;re, elle peut &#234;tre entach&#233;e d&#8217;ambigu&#239;t&#233;s,
d&#8217;erreurs, d&#8217;h&#233;sitation et conduit &#224; des &#171; bruits &#187; ou des malentendus qui sont susceptibles
d&#8217;&#234;tre aggrav&#233;s par les dispositifs mat&#233;riels et les programmes du syst&#232;me. Enfin, bien que
la multimodalit&#233; soit normalement utilis&#233;e pour am&#233;liorer la communication et diminuer le
nombre d&#8217;ambigu&#239;t&#233;s, l&#8217;usage conjoint de plusieurs modes multiplie les probl&#232;mes techniques
et peut d&#233;grader les performances des usagers.
</p>
<p>Dans cet article nous nous int&#233;ressons aux entr&#233;es des syst&#232;mes multimodaux de communi-
cation personne-machine. Pour comprendre le but de l&#8217;usager, le syst&#232;me doit effectuer cor-
rectement la fusion des entr&#233;es qui parviennent des diff&#233;rentes modes. Un des points critiques
de cette fusion est la r&#233;solution des expressions r&#233;f&#233;rentielles (ER). Nous proposons un algo-
rithme de r&#233;solution de d&#233;signations orales aux objets du contexte visuel. Cet algorithme est
fond&#233; d&#8217;une part, sur des connaissances linguistiques li&#233;es &#224; l&#8217;expression r&#233;f&#233;rentielle utilis&#233;e
et d&#8217;autre part sur la saillance des objets du contexte visuel. Nous pensons que l&#8217;attention de
l&#8217;usager peut &#234;tre influenc&#233;e par la pr&#233;sentation des objets dans le contexte visuel (notion de
saillance) et nous prenons en compte cette notion dans le processus de r&#233;solution des r&#233;f&#233;rences.
</p>
<p>Apr&#232;s une section dans laquelle nous pr&#233;sentons notre contexte de travail et le probl&#232;me trait&#233;,
nous exposons les principaux &#233;l&#233;ments de la solution propos&#233;e. Nous commen&#231;ons par analyser
les diff&#233;rents cas possibles &#224; prendre en compte dans la solution puis nous montrons la r&#244;le
de la saillance dans le traitement des ERs. Enfin nous d&#233;taillons l&#8217;algorithme de traitement des
ces d&#233;signations que nous illustrons par un exemple d&#8217;application qui souligne l&#8217;int&#233;r&#234;t de cet
algorithme.
</p>
<p>2 Probl&#233;matique
</p>
<p>Notre cadre de travail est le syst&#232;me prototype G&#233;oral tactile (Siroux et al., 1997) qui est impl&#233;-
ment&#233; sur la plateforme multiagent DORIS (L&#8217;Hour et al., 2004). C&#8217;est un syst&#232;me multimodal
pour une application de renseignements g&#233;ographiques et touristiques. L&#8217;usager peut deman-
der des informations et la localisation de sites touristiques comme plage, &#233;glise, camping en
pr&#233;cisant un endroit, une zone (dessin&#233;e ou situ&#233;e par rapport &#224; un &#233;l&#233;ment g&#233;ographique ou
cartographique particulier : rivi&#232;re, route, c&#244;te) ; il peut &#233;galement demander la distance et l&#8217;iti-
n&#233;raire entre deux localit&#233;s.
</p>
<p>Les modes et modalit&#233;s mis &#224; la disposition de l&#8217;usager dans le syst&#232;me G&#233;oral sont les suivants :
</p>
<p>480</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement de d&#233;signations orales dans un contexte visuel
</p>
<p>&#8211; l&#8217;oral en entr&#233;e et en sortie du syst&#232;me. L&#8217;usager peut formuler ses demandes ou ses r&#233;ponses
aux questions du syst&#232;me par la voix et en langage naturel (LN) de mani&#232;re spontan&#233;e (pas
de consignes particuli&#232;res d&#8217;&#233;locution). Certaines r&#233;actions du syst&#232;me sont aussi transmises
oralement &#224; l&#8217;utilisateur.
</p>
<p>&#8211; le mode visuel : le syst&#232;me affiche sur un &#233;cran une carte de la r&#233;gion ; cette carte contient des
informations g&#233;ographiques et touristiques habituelles : routes, rivi&#232;res, fleuves. Des effets
de zoom, de surlignage, de clignotement permettent au syst&#232;me de focaliser l&#8217;attention de
l&#8217;usager.
</p>
<p>&#8211; le mode gestuel par l&#8217;interm&#233;diaire d&#8217;un &#233;cran tactile : l&#8217;usager peut d&#233;signer par diff&#233;rents
types de geste des &#233;l&#233;ments sur la pr&#233;sentation affich&#233;e &#224; l&#8217;&#233;cran.
</p>
<p>Un dialogue avec G&#233;oral est compos&#233; d&#8217;un ou plusieurs &#233;changes. Un &#233;change est constitu&#233; des
tours de communication de l&#8217;usager et du syst&#232;me (Bilange, 1992). Un tour de communication
de l&#8217;usager consiste en un &#233;nonc&#233; oral et/ou une entr&#233;e gestuelle et celui du syst&#232;me consiste
en une sortie orale (par la synth&#232;se de la parole) et un affichage sur l&#8217;&#233;cran. Par exemple, un
&#233;change simple contient deux tours de communication : un tour de l&#8217;usager (question) et un
tour du syst&#232;me (r&#233;ponse). Notons qu&#8217;un &#233;change peut &#234;tre imbriqu&#233; en contenant d&#8217;autres
&#233;changes (dans le cas des questions de clarification). Dans un tour de communication d&#8217;un
usager, le probl&#232;me pour le syst&#232;me est de r&#233;soudre les ERs, c&#8217;est-&#224;-dire, trouver le r&#233;f&#233;rent
d&#8217;un symbole dans une modalit&#233; en utilisant des informations pr&#233;sentes dans la m&#234;me ou dans
d&#8217;autre modalit&#233;.
</p>
<p>Dans ce cadre, nous avons propos&#233; une nouvelle d&#233;finition d&#8217;un mod&#232;le g&#233;n&#233;ral de traitement
des ERs (Choumane &amp; Siroux, 2006). Ce mod&#232;le est fond&#233; sur deux principes : la d&#233;finition
de langages associ&#233;s &#224; chaque modalit&#233; (LN, geste, visuel) plus un langage pivot et la cr&#233;ation
de fonctions reliant certains objets de chaque modalit&#233; permettant d&#8217;identifier les r&#233;f&#233;rents. A
chaque tour de communication, les langages encodent les objets issus des modalit&#233;s et m&#233;mo-
risent aussi certaines parties du contexte courant et de l&#8217;historique de l&#8217;interaction. Des traite-
ments seront associ&#233;s &#224; chaque modalit&#233; (par exemple : traitement des anaphores pour la LN)
et des traitements sp&#233;cifiques seront mis en place pour la d&#233;termination des r&#233;f&#233;rents d&#233;sign&#233;s
de mani&#232;re multimodale.
</p>
<p>L&#8217;objet de l&#8217;article est de pr&#233;senter une partie du traitement du mod&#232;le g&#233;n&#233;ral de r&#233;solution
des ERs. L&#8217;objectif est de trouver l&#8217;objet d&#233;sign&#233; dans le contexte visuel commun entre l&#8217;usager
et le syst&#232;me (l&#8217;&#233;cran), et qui repr&#233;sente le r&#233;f&#233;rent d&#8217;une ER. Ce traitement est li&#233; &#224; deux des
langages du mod&#232;le g&#233;n&#233;ral : le langage qui encode le mode oral et celui qui encode le mode
visuel.
</p>
<p>Il existe plusieurs types d&#8217;ER : ERs qui font r&#233;f&#233;rence &#224; des entit&#233;s de l&#8217;historique LN comme
l&#8217;anaphore (Mitkov, 2002), des ERs qui n&#8217;ont pas d&#8217;ant&#233;c&#233;dents linguistiques parce qu&#8217;elles
sont employ&#233;es en premi&#232;re mention (Vieira &amp; Poesio, 2000), (Manu&#233;lian, 2003) et/ou qui font
r&#233;f&#233;rence &#224; des objets dans une autre modalit&#233; qui correspond, par exemple, au contexte visuel
dans le syst&#232;me G&#233;oral. Ce dernier type d&#8217;ER est produit :
&#8211; conjointement avec un geste. Dans ce cas, ce sont des ERs &#224; usage d&#233;ictique dans lequel le
</p>
<p>r&#233;f&#233;rent est l&#8217;objet d&#233;sign&#233; par le geste.
&#8211; ou sans geste.
Dans cet article nous nous int&#233;ressons uniquement aux ERs en premi&#232;re mention qui sont pro-
duites sans geste. Nous discutons dans la suite les circonstances de production de telles ERs et
une m&#233;thodologie de traitement.
</p>
<p>481</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ali CHOUMANE
</p>
<p>3 Analyse et solution propos&#233;e
</p>
<p>Nous traitons ici plus particuli&#232;rement le cas d&#8217;une d&#233;signation par l&#8217;oral (sans geste) d&#8217;un ob-
jet du contexte visuel commun entre l&#8217;usager et le syst&#232;me (il s&#8217;agit de l&#8217;&#233;cran dans le syst&#232;me
Georal). Nous proposons une solution pour les entr&#233;es repr&#233;sent&#233;es g&#233;n&#233;riquement par un ex-
pression r&#233;guli&#232;re &#171; je veux X (le long | &#224; gauche | pr&#232;s de | &#224; l&#8217;embouchure |...) de Y &#187; o&#249; X
&#8712; {les campings, les h&#244;tels, ... } et Y &#8712; {la rivi&#232;re, la route, ...}. Cependant la port&#233;e de cette
solution est plus large, en effet, on trouve ce genre d&#8217;expressions r&#233;f&#233;rentielles dans d&#8217;autre
t&#226;ches multimodales comme dans (Landragin, 2005) et (Qu &amp; Chai, 2006) dans lesquelles on
peut d&#233;placer &#224; l&#8217;aide de la LN des objets situ&#233;s.
</p>
<p>3.1 Diff&#233;rents cas possibles
</p>
<p>Nous pouvons nous trouver face &#224; plusieurs possibilit&#233;s de r&#233;f&#233;rencement illustr&#233;es par les
exemples 1, 2, et 3.
</p>
<p>Exemple 1 je veux les campings le long de la rivi&#232;re
</p>
<p>Exemple 2 je veux les campings le long de la rivi&#232;re le L&#233;guer
</p>
<p>Exemple 3 je veux les campings le long des rivi&#232;res
</p>
<p>Pour l&#8217;exemple 1, trois cas de figure sont envisageables :
&#8211; il n&#8217;existe aucune rivi&#232;re dans le contexte visuel (pas de r&#233;solution). Dans ce cas la r&#233;ponse
&#224; l&#8217;usager est une d&#233;cision de dialogue. Un message d&#8217;information et une question de clarifi-
cation seront suffisants.
</p>
<p>&#8211; il existe une seule rivi&#232;re dans le contexte visuel. Dans ce cas le r&#233;f&#233;rent de &#171; la rivi&#232;re &#187; est
l&#8217;objet sur l&#8217;&#233;cran qui repr&#233;sente la seule rivi&#232;re existante.
</p>
<p>&#8211; il existe n rivi&#232;res (n &#8805; 2). Dans ce cas nous appliquons une strat&#233;gie fond&#233;e sur la saillance
pour trouver le r&#233;f&#233;rent (d&#233;tails ci-dessous).
</p>
<p>Dans l&#8217;exemple 2, qui est un cas particulier de l&#8217;exemple 1, l&#8217;objet d&#233;sign&#233; est explicitement
nomm&#233; dans l&#8217;&#233;nonc&#233;. C&#8217;est-&#224;-dire que l&#8217;objet d&#233;sign&#233; par &#171; la rivi&#232;re &#187; n&#8217;apporte pas d&#8217;ambi-
gu&#239;t&#233;, il s&#8217;agit d&#8217;une pr&#233;cision par le nom de l&#8217;objet affich&#233; sur l&#8217;&#233;cran qui est la rivi&#232;re appel&#233;e
&#171; le L&#233;guer &#187;.
</p>
<p>Dans l&#8217;exemple 3, l&#8217;ER &#171; des rivi&#232;res &#187; porte la marque du pluriel, elle d&#233;signe les objets du
contexte visuel de type &#171; rivi&#232;re &#187;. Il n&#8217;y a pas d&#8217;ambigu&#239;t&#233; et la r&#233;solution ne n&#233;cessite pas un
traitement sp&#233;cial autre que celui de la d&#233;tection de l&#8217;ER lors de l&#8217;analyse syntaxique.
</p>
<p>Les exemples 1, 2 et 3 2 illustrent des d&#233;buts de dialogue dans lesquels les ERs sont employ&#233;es
en premi&#232;re mention. Au cours de dialogue, toute ER doit &#234;tre &#233;valu&#233;e en terme de cor&#233;f&#233;rence
(reprise) ou de premi&#232;re mention. Pour cette d&#233;termination on utilise les liens lexicaux (syno-
nymie, hypernoymie, et m&#233;ronymie) ainsi que la liste des items lexicaux repr&#233;sentant les objets
sur l&#8217;&#233;cran. Notons que nous traitons les ERs dans un cadre applicatif pr&#233;cis qui permet de
restreindre certains traitements.
</p>
<p>La question qui se pose est pourquoi un usager est capable de demander des informations par
une entr&#233;e multimodale aussi &#171; vague &#187; (exemple 1) et sans geste ? Il faut d&#8217;abord not&#233; que
</p>
<p>2Exemples extraits d&#8217;une exp&#233;rimentation l&#233;g&#232;re avec Georal (Siroux et al., 1997).
</p>
<p>482</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement de d&#233;signations orales dans un contexte visuel
</p>
<p>malgr&#233; l&#8217;absence d&#8217;un geste conjointement &#224; la parole, nous classons cette entr&#233;e comme mul-
timodale. En effet, l&#8217;usager fait r&#233;f&#233;rence &#224; un objet dans une modalit&#233; (LN dans l&#8217;exemple 1)
en s&#8217;appuyant sur des informations pr&#233;sentes dans une autre modalit&#233; (les objets du contexte
visuel dans l&#8217;exemple 1). D&#8217;une part, dans la production d&#8217;une entr&#233;e multimodale comme dans
l&#8217;exemple 1, l&#8217;usager s&#8217;est appuy&#233; sur le contexte visuel pour d&#233;signer son objet parce que cet
objet est &#171; suffisamment saillant &#187;, pour l&#8217;usager, que ce dernier n&#8217;a pas compl&#233;t&#233; son entr&#233;e
par un geste (notons aussi que l&#8217;usager peut &#234;tre confront&#233; &#224; des probl&#232;mes de performance :
crainte de toucher l&#8217;&#233;cran, ...). D&#8217;autre part, le syst&#232;me pr&#233;pare et affiche le contexte visuel en
fonction de l&#8217;importance applicative des objets et calcule donc leur saillance pour cet affichage.
</p>
<p>3.2 Notations
</p>
<p>La formalisation dans les prochaines sections est fond&#233;e sur les notations suivantes :
</p>
<p>CV Cc = contexte visuel commun courant entre le syst&#232;me et l&#8217;usager.
e un &#233;change donn&#233; entre l&#8217;usager et le syst&#232;me.
t un tour de communication donn&#233;. t de l&#8217;usager comprend normalement un &#233;nonc&#233; oral et/ou
une entr&#233;e gestuelle. Dans cet article, il s&#8217;agit uniquement d&#8217;un &#233;nonc&#233; oral.
</p>
<p>R={rk, 1 &#8804; k &#8804; K/ ER(rk)}, le(s) ER(s) prononc&#233;e(s) par l&#8217;usager au tour de communication t.
Ok={oj , 1 &#8804; j &#8804; J}, l&#8217;ensemble des objets candidats r&#233;f&#233;rents de l&#8217;expression r&#233;f&#233;rentielle rk.
Sc(oj) est la saillance de l&#8217;objet oj dans le contexte visuel courant c (CV Cc).
</p>
<p>Pour simplifier la pr&#233;sentation de l&#8217;algorithme (cf. section 3.4), nous supposons que dans un
tour donn&#233; t d&#8217;un usager, |R| = 1 (K=1). C&#8217;est-&#224;-dire que t ne contient qu&#8217;une seule ER qui
d&#233;signe un objet dans CV Cc. Donc :
&#8211; r1 est la seule ER dans le tour de communication t. Dans l&#8217;exemple 1, r1 est &#171; la rivi&#232;re &#187;.
&#8211; O1 contient les objets candidats r&#233;f&#233;rents de l&#8217;expression r&#233;f&#233;rentielle r1.
</p>
<p>3.3 Saillance et son utilisation
</p>
<p>La saillance intervient fortement lors de l&#8217;interpr&#233;tation d&#8217;un &#233;nonc&#233; en situation de dialogue ou
lors de la compr&#233;hension d&#8217;un texte : en mettant en avant un &#233;l&#233;ment, elle dirige l&#8217;attention sur
cet &#233;l&#233;ment et rend sa prise en compte prioritaire dans le processus de r&#233;solution des r&#233;f&#233;rences
et des cor&#233;f&#233;rences (Landragin, 2005). Nous trouvons dans la litt&#233;rature deux types de saillance :
la saillance linguistique et la saillance visuelle.
</p>
<p>La saillance linguistique, qui d&#233;pend uniquement de la modalit&#233; LN, constitue, par exemple, une
aide &#224; la r&#233;solution des anaphores (Lappin &amp; Leass, 1994). Dans toute communication homme-
machine dont le mode visuel fait partie, la saillance visuelle constitue un crit&#232;re d&#8217;identification
de l&#8217;objet d&#233;sign&#233; et per&#231;u de mani&#232;re prioritaire (Landragin, 2005).
</p>
<p>Notre approche est fond&#233;e sur ce que nous appelons la &#171; saillance contextuelle &#187;. Nous visons
ainsi une notion plus large que celle de la saillance visuelle. En effet, la saillance contextuelle
d&#8217;un objet sera affect&#233;e durant l&#8217;interaction selon que l&#8217;objet est d&#233;sign&#233; ou non par l&#8217;usager
tout en prenons en compte les caract&#233;ristiques visuelles des objets qui peuvent capter son atten-
tion. D&#233;sormais, nous faisons r&#233;f&#233;rence &#224; la saillance contextuelle par le mot &#171; saillance &#187; uni-
quement. Nous allons montrer, dans la suite de cet article, comment cette saillance permet la
</p>
<p>483</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ali CHOUMANE
</p>
<p>r&#233;solution d&#8217;une ER sans ant&#233;c&#233;dent linguistique et sans geste accompagnant l&#8217;&#233;nonc&#233; oral.
</p>
<p>Nous distinguons deux moments d&#8217;utilisation de la saillance :
&#8211; au d&#233;but d&#8217;un dialogue nous attribuons des valeurs par d&#233;faut aux objets du CV C. Cette
attribution n&#8217;est pas n&#233;cessairement &#233;quiprobable, les valeurs peuvent &#234;tre en effet li&#233;es &#224;
l&#8217;application. La d&#233;termination d&#8217;une m&#233;thode de calcul num&#233;rique de la saillance (Landra-
gin, 2005) ne fait pas partie de cet article. Notons simplement l&#8217;existence de plusieurs facteurs
qui contribuent &#224; rendre saillant un objet et qui interviennent donc pour la quantification de
la saillance de cet objet. Ces facteurs pourront &#234;tre la couleur, la taille, la complexit&#233;, etc.
d&#8217;un objet. Cette phase d&#8217;initialisation sera appliqu&#233;e &#224; chaque d&#233;but de dialogue (au moins
un &#233;change).
</p>
<p>&#8211; durant l&#8217;interaction, on modifie les saillances des objets qui sont dansO1 &#224; la fin de chaque in-
terpr&#233;tation de l&#8217;&#233;nonc&#233; de l&#8217;usager. Ainsi la (les) saillance(s) de(s) r&#233;f&#233;rent(s) augmente(nt)
et la (les) saillance(s) de(s) autre(s) objet(s) de O1 diminue(nt). Nous rappelons que l&#8217;en-
semble O1 d&#8217;un tour de communication d&#8217;un usager contient l&#8217;objet (les objets) candidat(s)
r&#233;f&#233;rents de r1. Soit Sc(oj) la saillance de l&#8217;objet oj dans le CV Cc. A la fin de l&#8217;interpr&#233;tation
de l&#8217;&#233;nonc&#233; de l&#8217;usager, et apr&#232;s avoir utilis&#233; les saillances de CV Cc, nous allons modifier
les saillances des objets de O1. L&#8217;interpr&#233;tation par le syst&#232;me de tout &#233;nonc&#233; de l&#8217;usager va
prendre en compte l&#8217;ensemble des informations contextuelles (visuelles, linguistiques, ...).
</p>
<p>Voici l&#8217;algorithme simplifi&#233; de distribution de saillance (a et b sont des constantes &#224; r&#233;gler, avec
a &gt; 0 et b &#8804; 0) :
</p>
<p>si c&#8217;est un d&#233;but de dialogue alors
pour tout oj &#8712; CV Cc faire
Sc(oj)&#8592; S0(oj) (initialisation des saillances)
</p>
<p>fin pour
sinon {c&#8217;est la fin de l&#8217;interpr&#233;tation d&#8217;un &#233;nonc&#233; de l&#8217;usager et nous disposons d&#8217;un en-
semble O1. Nous allons modifier les saillances des objets de O1}
</p>
<p>pour tout oj &#8712; O1 faire
si oj est un r&#233;f&#233;rent alors
Sc(oj)&#8592; Sc(oj) + a
</p>
<p>sinon {c&#8217;est-&#224;-dire que c&#8217;est un objet &#224; p&#233;naliser}
Sc(oj)&#8592; Sc(oj) + b
</p>
<p>finsi
fin pour
</p>
<p>finsi
</p>
<p>Cet algorithme est appel&#233; par l&#8217;algorithme de recherche du r&#233;f&#233;rent ci-dessous (cf. section 3.4).
Si l&#8217;algorithme de distribution de saillance a un ensemble O1 en entr&#233;e, alors les saillances de
ces objets oj seront modifi&#233;es d&#8217;une valeur a ou b selon que l&#8217;objet est un r&#233;f&#233;rent ou non. Les
constantes a et b seront r&#233;gl&#233;es lors d&#8217;exp&#233;riences ult&#233;rieures &#224; mener.
</p>
<p>3.4 L&#8217;algorithme de recherche de r&#233;f&#233;rent
</p>
<p>L&#8217;algorithme que nous proposons (organigramme de la figure 1) est constitu&#233; de plusieurs phases :
</p>
<p>&#8211; La premi&#232;re phase est celle de d&#233;termination de l&#8217;ensemble O1 des objets candidats r&#233;f&#233;rents
de r1. Le crit&#232;re de candidature est le type de l&#8217;objet. Dans l&#8217;exemple 1, O1 est l&#8217;ensemble
</p>
<p>484</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement de d&#233;signations orales dans un contexte visuel
</p>
<p>Si non
</p>
<p>Si oui
</p>
<p>Si oui
</p>
<p>ER qui d&#233;signe un objet
dans le CVCc
EX: je voudrais X le long Y
</p>
<p>&#947;&#8805;)( *oS jc
</p>
<p>Si non
</p>
<p>[ ] { } &#949;&lt;&#8722; &#8722;&#8712; )(()( *,1* oSMaxoS kcjJkjc
</p>
<p>J
kj
</p>
<p>O =
&#925;&#8712;
</p>
<p>1
</p>
<p>,
</p>
<p>G&#233;n&#233;ration d&#8217;une 
question de clarification 
&#224; l&#8217;usager
</p>
<p>Trouver l&#8217;objet
[ ]
</p>
<p>)((maxarg/
,1
</p>
<p>*
* oSjo jc
</p>
<p>Jj
j
</p>
<p>&#8712;
</p>
<p>=
</p>
<p>oj*R&#233;f&#233;rent = {     }
Algo. de distribution 
des saillances aux
objets de
</p>
<p>lancer
</p>
<p>Calcule de l&#8217;ensemble 
= {oj / type(oj)}
</p>
<p>Filtre
</p>
<p>Si = 1
</p>
<p>Si 2&#8805;
</p>
<p>1* =j
</p>
<p>Message +
question de clarification 
&#224; l&#8217;usager
</p>
<p>Si = 0O'1
</p>
<p>( )O1
</p>
<p>O1
</p>
<p>Y &#8712; {de la rivi&#232;re,&#8230;}
</p>
<p>Y&#8712; {des rivi&#232;res,&#8230;} Si oui
</p>
<p>R&#233;f&#233;rent(s) = {     }oj
Ooj 1&#8712;Pour tout 
</p>
<p>Si non
</p>
<p>Y&#8712; {de la rivi&#232;re  ,&#8230;}
</p>
<p>Si oui
</p>
<p>R&#233;f&#233;rent = {   }y
</p>
<p>Si nony
</p>
<p>O1
</p>
<p>FIG. 1 &#8211; Algorithme de recherche de r&#233;f&#233;rent, dans le contexte visuel, d&#233;sign&#233; par l&#8217;oral
</p>
<p>des objets de type &#171; rivi&#232;re &#187; et de tous les objets dont leur type appartient &#224; la classe des
relations lexicales de &#171; rivi&#232;re &#187; comme les synonymes, les hypernoymes, et les m&#233;ronymes.
Ces connaissances de synonymie, d&#8217;hypernoymie, et de m&#233;ronymie peuvent &#234;tre trouv&#233;es
dans une base de donn&#233;es lexicales commeWordNet lors de l&#8217;analyse syntaxique de l&#8217;&#233;nonc&#233;.
Donc O1 contient les objets de types &#171; rivi&#232;re &#187;, &#171; fleuve &#187;, &#171; ruisseau &#187;, etc. Pour prendre en
compte des &#233;ventuels probl&#232;mes li&#233;s aux performances de l&#8217;usager (le cas d&#8217;un usager qui
prononce &#171; rivi&#232;re &#187; pour d&#233;signer un &#171; ruisseau &#187;, ...), nous avons choisi de d&#233;terminer O1
selon la classe lexicale enti&#232;re. Cependant d&#8217;autres choix sont possibles :
1. Dans le cas d&#8217;objets qui ne sont pas explicitement typ&#233;s sur l&#8217;&#233;cran 3, la d&#233;termination
</p>
<p>de l&#8217;ensemble O1 selon toutes les informations lexicales est n&#233;cessaire. Dans l&#8217;exemple
&#171; je veux les h&#244;tels le long de la route &#187;, l&#8217;ensemble O1 contient tous les objets oj de
CV C tel que le type de oj est &#233;gal &#224; &#171; route &#187;, &#171; voie &#187;, etc.
</p>
<p>2. Dans le cas des objets typ&#233;s explicitement sur l&#8217;&#233;cran (le cas des rivi&#232;res dans G&#233;oral)
d&#8217;une mani&#232;re efficace qui garantit une meilleur visibilit&#233; de ces types, la d&#233;termination
de l&#8217;ensemble O1 pourrait d&#233;pendre uniquement du type de l&#8217;ER, d&#8217;une partie de sa
classe lexicale, etc.
</p>
<p>&#8211; Dans la deuxi&#232;me phase nous testons si l&#8217;ER en question correspond &#224; un cas particulier tel
que ceux des exemples 2 et 3. Dans les deux cas, le(s) r&#233;f&#233;rent(s) est (sont) l&#8217; (les) objet(s)
directement nomm&#233;(s) dans l&#8217;&#233;nonc&#233; oral ou l&#8217;ensemble O1 entier (cf. section 3.1).
</p>
<p>&#8211; Si l&#8217;ER n&#8217;est pas un cas particulier (c&#8217;est alors l&#8217;un des cas de l&#8217;exemple 1), nous appliquons
un filtre sur O1. Le crit&#232;re de filtrage d&#233;pend du type des objets. Par exemple, &#171; la qualifica-
tion &#187; forme le crit&#232;re de filtrage pour les objets de type rivi&#232;re. Dans le cas de l&#8217;&#233;nonc&#233;, &#171; je
veux les campings le long de la grande rivi&#232;re &#187;, nous filtrons O1 en ne choisissant que &#171; les
grandes rivi&#232;res &#187;. Dans le syst&#232;me G&#233;oral, les caract&#233;ristiques des objets du CV C comme
la taille, la couleur, etc. sont cod&#233;es en repr&#233;sentation interne.
</p>
<p>&#8211; Ensuite, nous testons le nombre d&#8217;&#233;l&#233;ment deO1, et trois cas sont &#224; prendre en consid&#233;ration :
3Les routes dans le syst&#232;me G&#233;oral ne sont pas &#233;tiquet&#233;es par &#171; route &#187; sur l&#8217;&#233;cran, mais par D11, D21, etc.
</p>
<p>Mais, dans la repr&#233;sentation interne du syst&#232;me, D11, D21, etc. sont cod&#233;s comme route, voie, etc. Les choix des
repr&#233;sentations sur l&#8217;&#233;cran sont li&#233;s &#224; des probl&#232;mes de clart&#233;, d&#8217;efficacit&#233; d&#8217;affichage, et d&#8217;usage.
</p>
<p>485</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ali CHOUMANE
</p>
<p>1. Si |O1| = 0, alors le message d&#8217;information et la question de clarification seront lanc&#233;s.
Si la question est accompagn&#233;e d&#8217;affichage graphique sp&#233;cial (zoom, clignotement, etc)
les saillances des objets mis en cause par le syst&#232;me seront modifi&#233;es. Notons que dans
ce cas, il y aura imbrication d&#8217;&#233;change.
</p>
<p>2. Si |O1| = 1 alors le r&#233;f&#233;rent de r1 est l&#8217;objet repr&#233;sent&#233; par o1.
3. Si |O1| &#8805; 2 alors nous recherchons l&#8217;objet le plus saillant parmi les objets de O1, c&#8217;est
</p>
<p>l&#8217;objet oj&#8727; tel que :
j&#8727; = argmax
</p>
<p>j
Sc(oj)
</p>
<p>avec Sc(oj&#8727;) &#8805; &#947; et Sc(oj&#8727;)&#8722; max
k&#8712;[1,J ]&#8722;{j&#8727;}
</p>
<p>Sc(ok) &#8805; &quot;
&#947; est un indice de confiance, il est n&#233;cessaire pour &#233;viter le choix d&#8217;un objet peu saillant.
Il d&#233;pend de la moyenne des saillances de tous les objets de O1 et peut &#234;tre calcul&#233; par :
</p>
<p>&#947; =
&#955;
</p>
<p>J
</p>
<p>J&#8721;
j=1
</p>
<p>Sc(oj)
</p>
<p>avec &#955; est un r&#233;el. Nous comptons affiner le calcul de &#947; par des exp&#233;riences ult&#233;rieures
&#224; mener. &quot; est un r&#233;el suffisamment grand pour dire que r1 n&#8217;a d&#233;sign&#233; que l&#8217;objet qui a
la plus grande saillance oj&#8727; . C&#8217;est pour d&#233;tecter les cas d&#8217;ambigu&#239;t&#233;.
Si
</p>
<p>Sc(oj&#8727;) &lt; &#947; ou Sc(oj&#8727;)&#8722; max
k&#8712;[1,J ]&#8722;{j&#8727;}
</p>
<p>Sc(ok) &lt; &quot;
</p>
<p>Alors le syst&#232;me g&#233;n&#232;re une question &#224; poser &#224; l&#8217;usager pour choisir un des objets O1.
Et apr&#232;s la r&#233;solution de l&#8217;expression r&#233;f&#233;rentielle en question, on modifie les saillances
des objets de O1 en faisant appel &#224; l&#8217;algorithme de distribution de saillance montr&#233;
ci-dessus (cf. section 3.3).
</p>
<p>Notons qu&#8217;apr&#232;s avoir trouv&#233; l&#8217;objet d&#233;sign&#233;, nous devons prendre en compte la pr&#233;position
prononc&#233;e avant Y (Vandeloise, 1986) (&#171; le long de &#187; dans l&#8217;exemple 1) pour trouver la partie
exactement vis&#233;e par l&#8217;usager comme &#233;tant l&#8217;espace physique de recherche du th&#232;me (les cam-
pings dans l&#8217;exemple 1). L&#8217;influence de cette pr&#233;position pourrait &#234;tre plus int&#233;ressante dans le
cas de &#171; &#224; l&#8217;embouchure de &#187;, &#171; &#224; gauche de &#187;, etc.
</p>
<p>3.5 Sc&#233;nario d&#8217;application
</p>
<p>Nous pr&#233;sentons dans cette section un exemple de dialogue entre un usager (U ) et le syst&#232;me
Georal (S). Les &#233;nonc&#233;s de U et de S qui sont en italique, correspondent respectivement &#224; des
entr&#233;es orales et &#224; des sorties orales (par synth&#232;se de la parole). Notons que Ut (St) correspond
&#224; un &#233;nonc&#233; de U (S) au tour de communication num&#233;ro t.
&#201;change e = 1
U1 : Quel est le nom de &#231;a + geste de pointage sur l&#8217;&#233;cran
S1 : Bois de Lann ar Waremm
Dans cet &#233;change, qui se d&#233;roule dans un contexte visuel courant CV Cc, l&#8217;expression r&#233;f&#233;ren-
tielle &#171; &#231;a &#187;, &#224; usage d&#233;ictique, a comme r&#233;f&#233;rent l&#8217;objet d&#233;sign&#233; par le geste d&#233;monstratif qui
accompagne l&#8217;&#233;nonc&#233; oral. C&#8217;est l&#8217;objet de CV Cc qui repr&#233;sente le Bois de Lann ar Waremm.
&#201;change e = 2
U1 : Je veux les campings le long de la rivi&#232;re
</p>
<p>486</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement de d&#233;signations orales dans un contexte visuel
</p>
<p>Le CV Cc de ce tour de communication est issu du contexte visuel pr&#233;c&#233;dent apr&#232;s certaine
modification dans son contenu comme les saillances des objets. L&#8217;ER &#171; la rivi&#232;re &#187; ne peut pas
&#234;tre r&#233;solue linguistiquement, il s&#8217;agit d&#8217;une premi&#232;re mention qui n&#8217;a aucun ant&#233;c&#233;dent dans
le discours. Pour cela, nous appliquons l&#8217;algorithme propos&#233; ci-dessus pour trouver l&#8217;objet r&#233;-
f&#233;rent du CV Cc de l&#8217;ER &#171; la rivi&#232;re &#187;.
r1 = la rivi&#232;re.
L&#8217;ensemble des candidats r&#233;f&#233;rents de r1 est O1 = {o1, o2, o3, o4}, avec o1 = Le L&#233;guer, o2 =
Ruisseau de Gruguil, o3 = Ruisseau de Kerhuel, et o4 = Rivi&#232;re des Traou&#239;ero.
Nous remarquons qu&#8217;il n&#8217;y a pas de qualification de r1, donc O1 ne change pas apr&#232;s la phase
de filtrage.
Comme |O1| = 4, alors nous allons chercher l&#8217;objet oj&#8727; .
Supposons que dans CV Cc nous avons les donn&#233;es suivantes :&#63729;&#63730;&#63731; Sc(o1) = 2, Sc(o2) = 1, Sc(o3) = 1, et Sc(o4) = 1.5&#955; = 1
</p>
<p>&quot; = 0.3
</p>
<p>alors j&#8727; = 1 et &#947; = 1.375.
Nous passons maintenant &#224; la phase de validation de l&#8217;objet o1 comme r&#233;f&#233;rent. Comme
</p>
<p>Sc(oj&#8727;) = Sc(o1) = 2 &gt; &#947; et Sc(oj&#8727;)&#8722; max
k&#8712;{2,3,4}
</p>
<p>Sc(ok) = Sc(o1)&#8722; Sc(o4) = 0.5 &gt; &quot;
</p>
<p>alors le r&#233;f&#233;rent de &#171; la rivi&#232;re &#187; est l&#8217;objet o1 (le L&#233;guer).
S1 : voulez vous les campings le long de la rivi&#232;re le L&#233;guer ? Merci de confirmer. Si non,
veuillez pr&#233;ciser une autre rivi&#232;re.
U2 : oui
S2 : il y a un camping qui r&#233;pond &#224; votre requ&#234;te : camping de Beg L&#233;guer.
</p>
<p>Apr&#232;s la confirmation de l&#8217;usager, l&#8217;expression r&#233;f&#233;rentielle r1 est consid&#233;r&#233;e, par le syst&#232;me,
comme r&#233;solue. Ainsi la saillance de l&#8217;objet o1 sera augment&#233;e d&#8217;une valeur a. Les autres objets
deO1 (o2, o3, et o4) seront p&#233;nalis&#233;s en baissant leur saillance d&#8217;une valeur b puisqu&#8217;ils n&#8217;&#233;taient
pas d&#233;sign&#233;s.
</p>
<p>L&#8217;&#233;change num&#233;ro 2 n&#8217;est pas simple, il contient un sous-&#233;change (S1, U2) men&#233; par le syst&#232;me
qui pourrait affecter aussi les saillances de O1. Notons que les saillances des objets du CV Cc
seront r&#233;initialis&#233;es d&#232;s le premier &#233;change du prochain dialogue.
</p>
<p>4 Conclusion
</p>
<p>Nous avons propos&#233; une solution pour le traitement des d&#233;signations orales des objets dans le
contexte visuel commun entre l&#8217;usager et le syst&#232;me. Cette solution est fond&#233;e sur des connais-
sances sur la modalit&#233; langue naturelle, des connaissances sur les objets manipul&#233;s, et des
connaissances sur les aspects perceptifs (degr&#233; de saillance) associ&#233;s &#224; ces objets. Elle met
en valeur un algorithme constitu&#233; de plusieurs phases. La phase g&#233;n&#233;rale consiste &#224; chercher
le r&#233;f&#233;rent le plus saillant dans une liste des candidats r&#233;f&#233;rents (appel&#233;e O1) avec un indice de
confiance et une v&#233;rification de validit&#233; pour d&#233;tecter les cas d&#8217;ambigu&#239;t&#233;. La terminaison du
processus de r&#233;solution provoque, quelque soit le r&#233;sultat, la modification des saillances pour le
</p>
<p>487</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ali CHOUMANE
</p>
<p>tour de communication suivant. Nous pensons affiner certains param&#232;tres en menant des exp&#233;-
riences avec le syst&#232;me Georal. L&#8217;&#233;tat du module de reconnaissance de la parole de Georal ne
permet pas actuellement de mener des exp&#233;rimentations de validation.
</p>
<p>L&#8217;apport principal de notre proposition r&#233;side dans les possibilit&#233;s de strat&#233;gie de dialogue of-
ferte au syst&#232;me pour faire pr&#233;ciser les r&#233;f&#233;rents en cas de probl&#232;me. En effet, si la liste des
objets candidats r&#233;f&#233;rents est relativement importante, nous pensons qu&#8217;il est fastidieux de pro-
poser &#224; l&#8217;usager de choisir un des objets de la liste en lui pr&#233;sentant tous les objets. Le choix
de proposer l&#8217;objet le plus saillant &#224; l&#8217;usager est issu du fait que ce dernier s&#8217;est appuy&#233; sur le
contexte visuel dans son activit&#233; de d&#233;signation.
</p>
<p>Remerciements
</p>
<p>L&#8217;auteur remercie Jacques Siroux pour sa collaboration et son aide pr&#233;cieuse pour les travaux
expos&#233;s.
</p>
<p>R&#233;f&#233;rences
BILANGE E. (1992). Dialogue personne-machine. Mod&#233;lisation et r&#233;alisation informatique.
2-86601-324-7. Hermes.
CHOUMANE A. &amp; SIROUX J. (2006). Toward a generic model including knowledge and
treatments for multimodal reference resolution. In V. P. GUERRERO-BOTE, Ed., Proceedings
Inscit2006, volume 2, p. 298 &#8211; 302, M&#233;rida - Spain.
LANDRAGIN F. (2005). Traitement automatique de la saillance. In Douzi&#232;me conf&#233;rence sur
le traitement automatique des langues, p. 263 &#8211; 272.
LAPPIN S. &amp; LEASS H. J. (1994). An algorithm for pronominal anaphora resolution. Com-
putational Linguistics, 20, 535 &#8211; 561.
L&#8217;HOUR J., BO&#203;FFARD O., SIROUX J., MICLET L., CHARPENTIER F. &amp; MOUDENC T.
(2004). Doris, a multiagent/ip platform for multimodal dialogue applications. ICSLP.
MANU&#201;LIAN H. (2003). Descriptions d&#233;finies et d&#233;monstratives : analyses de corpus pour la
g&#233;n&#233;ration de textes. PhD thesis, Universit&#233; Nancy 2.
MITKOV R. (2002). Anaphora Resolution. 0-582-32505-6. Pearson Education.
QU S. &amp; CHAI J. Y. (2006). Salience modeling based on non-verbal modalities for spoken
language understanding. In ICMI &#8217;06 : Proceedings of the 8th International Conference on
Multimodal Interfaces, p. 193&#8211;200, New York, NY, USA : ACM Press.
SIROUX J., GUYOMARD M., MULTON F. &amp; R&#201;MONDEAU C. (1997). Multimodal references
in georal tactile. InWorkshop Referring Phenomena In a multimedia Context And Their Com-
putational Treatment, 35th Meeting Of the ACL, Madrid - Spain.
VANDELOISE C. (1986). L&#8217;espace en fran&#231;ais. Editions du Seuil, Paris.
VIEIRA R. &amp; POESIO M. (2000). An empirically-based system for processing definite des-
criptions. Computational Linguistics, 26 (4), 539&#8211;593.
</p>
<p>488</p>

</div></div>
</body></html>