<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une nouvelle structuration de l&#8217;information extraite automatiquement</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2007, Toulouse, 5&#8211;8 juin 2007
</p>
<p>Vers une nouvelle structuration de
l&#8217;information extraite automatiquement
</p>
<p>Alejandro ACOSTA
LATTICE-CNRS (UMR 8094)
</p>
<p>Universit&#233; Paris 7
alejandro.acosta@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. Les syst&#232;mes d&#8217;Extraction d&#8217;Information se contentent, le plus souvent, d&#8217;en-
richir des bases de donn&#233;es plates avec les informations qu&#8217;ils extraient. Nous d&#233;crivons dans
cet article un travail en cours sur l&#8217;utilisation de donn&#233;es extraites automatiquement pour la
construction d&#8217;une structure de repr&#233;sentation plus complexe. Cette structure mod&#233;lise un r&#233;-
seau social compos&#233; de relations entre les entit&#233;s d&#8217;un corpus de biographies.
</p>
<p>Abstract. Information Extraction systems are widely used to create flat databases of tem-
plates filled with the data they extract from text. In this article we describe an ongoing research
project that focuses on the use of automatically extracted data to create a more complex repre-
sentation structure. This structure is a model of the social network underlying the relations that
can be established between the entities of a corpus of biographies.
</p>
<p>Mots-cl&#233;s : extraction d&#8217;information, analyse de r&#233;seaux sociaux, biographies, entit&#233;s
nomm&#233;es, repr&#233;sentation de connaissances.
</p>
<p>Keywords: information extraction, social network analysis, named entities, biographies,
knowledge representation.
</p>
<p>1 Introduction
</p>
<p>Les syst&#232;mes de Traitement Automatique de Langues (TAL) sont n&#233;s, en grande partie, du d&#233;sir
de mod&#233;liser la compr&#233;hension du langage naturel et de cr&#233;er des syst&#232;mes capables de transfor-
mer un discours incompr&#233;hensible pour une machine en une repr&#233;sentation formelle explicite
de l&#8217;information v&#233;hicul&#233;e par le langage. Cette t&#226;che s&#8217;est av&#233;r&#233;e plus difficile que pr&#233;vu et en
cons&#233;quence les traducteurs automatiques, ainsi que les syst&#232;mes intelligents autonomes restent
du domaine de la science-fiction.
</p>
<p>Le domaine de la Repr&#233;sentation de Connaissances s&#8217;est concentr&#233; sur le probl&#232;me de la struc-
turation des contenus, et sur les op&#233;rations sur les structures de repr&#233;sentation. De son c&#244;t&#233;, la
Compr&#233;hension du Discours s&#8217;est heurt&#233;e &#224; la complexit&#233; de l&#8217;interpr&#233;tation du langage naturel
et a d&#251; chercher &#224; &#234;tre plus modeste dans ses objectifs.
</p>
<p>L&#8217;Extraction d&#8217;Information (EI) est n&#233;e du d&#233;sir de construire des syst&#232;mes capables de r&#233;-
pondre &#224; des t&#226;ches sp&#233;cifiques de compr&#233;hension. Son &#233;volution est fortement li&#233;e aux cam-
pagnes d&#8217;&#233;valuation de syst&#232;mes capables de rep&#233;rer des &#233;v&#233;nements ponctuels, ainsi que les
</p>
<p>337</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alejandro ACOSTA
</p>
<p>acteurs associ&#233;s &#224; ces &#233;v&#233;nements. Les &#233;valuations ont encourag&#233; les avanc&#233;es dans le domaine,
mais les techniques d&#8217;&#233;valuation ont aussi influenc&#233; la d&#233;finition d&#8217;un domaine qui, &#224; l&#8217;origine,
&#233;tait celui de la compr&#233;hension des textes. Cette influence a dirig&#233; l&#8217;EI vers des applications o&#249;
l&#8217;on cherche &#224; rep&#233;rer des faits sp&#233;cifiques dans les textes d&#8217;un domaine particulier. Ces sys-
t&#232;mes sont capables de collecter un ensemble d&#8217;informations, structur&#233;es dans des formulaires
qui remplissent des bases de donn&#233;es plates.
</p>
<p>Ces bases de donn&#233;es peuvent &#234;tre utilis&#233;es facilement pour l&#8217;&#233;valuation des syst&#232;mes en termes
de rappel et de pr&#233;cision (et de leurs mesures d&#233;riv&#233;es). Or, il est plus difficile d&#8217;&#233;valuer des
structures plus complexes, mettant en rapport les &#233;v&#233;nements entre eux, ou les acteurs qui se
r&#233;p&#232;tent dans les diff&#233;rents &#233;v&#233;nements (une repr&#233;sentation plus proche des bases de donn&#233;es
relationnelles qui sont devenues le standard). De ce fait, on s&#8217;est content&#233; de construire des
syst&#232;mes capables de faire ce qui &#233;tait n&#233;cessaire pour leur &#233;valuation et qui n&#8217;ont pas cherch&#233;
&#224; construire des structures de repr&#233;sentation plus riches.
</p>
<p>Nous pensons que les techniques d&#8217;EI peuvent &#234;tre utilis&#233;es pour construire des repr&#233;sentations
plus complexes, des structures relationnelles. La volont&#233; de structurer l&#8217;information dans des
formulaire isol&#233;es a jou&#233; un r&#244;le dans le choix des m&#233;thodes qui permettaient d&#8217;atteindre ce but.
De la m&#234;me mani&#232;re, l&#8217;objectif de constituer une repr&#233;sentation plus complexe va aussi avoir
une influence sur la d&#233;finition de la t&#226;che d&#8217;extraction.
</p>
<p>Nous pr&#233;sentons dans cet article un travail en cours qui propose d&#8217;utiliser autrement les r&#233;sultats
d&#8217;une t&#226;che d&#8217;extraction. Plus pr&#233;cis&#233;ment, nous proposons une structure de repr&#233;sentation plus
riche que celle qui est sugg&#233;r&#233;e dans les t&#226;ches conventionnelles. Pour ce faire, nous pr&#233;sentons
un travail men&#233; sur un corpus qui se pr&#234;te bien &#224; la conception d&#8217;une repr&#233;sentation structur&#233;e :
une vaste collection de notices biographiques.
</p>
<p>Le reste de ce document est organis&#233; de la mani&#232;re suivante : dans la section 2 nous pr&#233;sentons
le corpus de biographies, dans la section 3 nous discutons les motivations pour chercher une
repr&#233;sentation plus complexe de l&#8217;information extraite, nous d&#233;crivons les &#233;l&#233;ments qui com-
posent cette repr&#233;sentation (3.1 et 3.2) et nous parlons de l&#8217;&#233;tat de l&#8217;art (3.3). Dans la section
4 nous pr&#233;sentons les techniques d&#8217;EI utilis&#233;es. Finalement, nous pr&#233;sentons quelques perspec-
tives pour la continuation de ce travail dans la section 5.
</p>
<p>2 Le Maitron
</p>
<p>Le corpus utilis&#233; dans ce travail est une collection de notices biographiques. Ces biographies
peuvent &#234;tre &#233;tudi&#233;es s&#233;par&#233;ment mais il est aussi int&#233;ressant d&#8217;&#233;tudier l&#8217;objet plus large, et plus
complexe, dont elles font partie.
</p>
<p>Le Dictionnaire biographique du mouvement ouvrier francais1 (dor&#233;navant Le Maitron) est un
dictionnaire contenant des notices biographiques sur les vies de milliers de personnes ayant
particip&#233; activement aux luttes sociales de l&#8217;histoire fran&#231;aise depuis 1789. Le dictionnaire ori-
ginal est divis&#233; en quatre sections, correspondant &#224; quatre p&#233;riodes historiques qui vont de la
R&#233;volution Fran&#231;aise au d&#233;but de la Deuxi&#232;me Guerre mondiale. La publication a commenc&#233; &#224;
s&#8217;enrichir d&#8217;une nouvelle section en 2006 avec l&#8217;ajout d&#8217;une nouvelle p&#233;riode entre la Deuxi&#232;me
Guerre et 1968.
</p>
<p>1http://www.maitron.org
</p>
<p>338</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une nouvelle structuration de l&#8217;information extraite automatiquement
</p>
<p>Plus de 600 auteurs ont particip&#233; au projet depuis sa cr&#233;ation par Jean Maitron dans les ann&#233;es
cinquante. Les notices biographiques des 56 volumes du dictionnaire (plus de 100 000 articles)
sont constamment r&#233;vis&#233;es et retravaill&#233;es par une &#233;quipe d&#8217;historiens dirig&#233;e par Claude Pen-
netier au Centre d&#8217;histoire sociale du XXe si&#232;cle2. Le corpus du Maitron compte ainsi plus de
18 millions de mots, couvrant une p&#233;riode qui s&#8217;&#233;tend sur plus de deux si&#232;cles d&#8217;histoire.
</p>
<p>Notre objectif est de proposer une repr&#233;sentation qui rende compte de la complexit&#233; du contenu
du corpus (sans qu&#8217;elle soit exhaustive pour autant), et qui permette d&#8217;exploiter ces informations
sous une autre forme.
</p>
<p>3 Structuration des informations extraites
</p>
<p>Les diff&#233;rentes approches traitant de la repr&#233;sentation de connaissances ont propos&#233; un grand
nombre de mod&#232;les dans l&#8217;&#233;tude des structures qui peuvent repr&#233;senter symboliquement des in-
formations complexes. Par ailleurs ces approches ont &#233;galement propos&#233; des techniques visant
l&#8217;utilisation de ces structures pour le raisonnement automatique. Cependant, on est toujours in-
capable de traduire automatiquement le langage naturel en une repr&#233;sentation des connaissances
qu&#8217;il transmet. On est malheureusement encore loin d&#8217;atteindre le niveau de performance que
l&#8217;on esp&#233;rait dans le domaine de la compr&#233;hension des textes il y a quelques d&#233;cennies.
</p>
<p>Le domaine de l&#8217;EI, de son c&#244;t&#233;, s&#8217;est content&#233; de la t&#226;che qui consiste &#224; r&#233;colter l&#8217;information
dans des bases de donn&#233;es (Pazienza, 1999). LesMessage Understanding Conferences de la fin
des ann&#233;es 80 et des ann&#233;es 90 ont vu la transformation progressive de cette compr&#233;hension de
messages en remplissage de descriptions d&#8217;&#233;v&#233;nements (Poibeau, 2003).
</p>
<p>l&#8217;EI est n&#233;e pour affronter les difficult&#233;s rencontr&#233;es par les syst&#232;mes de compr&#233;hension des
textes et chercher un compromis entre les limitations des syst&#232;mes et la qualit&#233; des r&#233;sultats que
l&#8217;on pouvait obtenir. La compr&#233;hension s&#8217;est vue r&#233;interpr&#233;t&#233;e et divis&#233;e en t&#226;ches successives,
dont le but ultime &#233;tait le remplissage de formulaires. Dans cette optique, chaque formulaire
rempli correspond &#224; une assertion sur le monde (on extrait l&#8217;information qu&#8217;on suppose vraie) ;
l&#8217;ensemble de ces assertions constitue une base de donn&#233;es d&#8217;informations sur le domaine. Les
syst&#232;mes d&#8217;EI se sont depuis pench&#233;s sur l&#8217;exploitation et le traitement d&#8217;importantes quantit&#233;s
de textes d&#233;sormais disponibles en format num&#233;rique (et qui peuvent donc facilement &#234;tre trait&#233;s
automatiquement).
</p>
<p>Nous pensons que le compromis entre les limites des techniques et la complexit&#233; de la repr&#233;-
sentation peut encore &#234;tre n&#233;goci&#233;. Certes, l&#8217;interpr&#233;tation automatique du langage naturel, qui
nous permettrait de constituer des bases de connaissances expressives et robustes, est encore
hors de notre port&#233;e. Nous pensons cependant que les r&#233;sultats d&#8217;un processus d&#8217;EI pourraient
&#234;tre am&#233;lior&#233;s en cr&#233;ant une sortie structur&#233;e de mani&#232;re plus riche que la seule &#233;num&#233;ration
des informations dans une base de donn&#233;es.
</p>
<p>A notre avis, la structuration des informations pourrait &#234;tre con&#231;ue autour des relations entre
entit&#233;s (dans le sens, grosso modo, d&#8217;entit&#233;s nomm&#233;es). Nous cherchons &#224; &#233;tablir des relations
entre entit&#233;s, plut&#244;t qu&#8217;&#224; rep&#233;rer des &#233;v&#233;nements pour remplir des formulaires avec des d&#233;tails
sur ces &#233;v&#233;nements.
</p>
<p>Le mod&#232;le de repr&#233;sentation que nous avons choisi pour traiter les informations extraites du
</p>
<p>2CNRS / Universit&#233; Paris I
</p>
<p>339</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alejandro ACOSTA
</p>
<p>Maitron s&#8217;inspire d&#8217;une technique de mod&#233;lisation issue des sciences humaines : l&#8217;analyse des
r&#233;seaux sociaux.
</p>
<p>L&#8217;Analyse de R&#233;seaux Sociaux (ARS) est une technique utilis&#233;e dans plusieurs domaines de
recherche en sciences humaines pour &#233;tudier les relations entre individus. Ces individus sont
souvent en rapport du fait de leur appartenance &#224; un groupe ou une organisation. L&#8217;ARS s&#8217;est
d&#233;velopp&#233;e avec l&#8217;&#233;tude des rapports et interactions entre les individus de communaut&#233;s par-
ticuli&#232;res comme les habitants d&#8217;une &#238;le, les employ&#233;s d&#8217;une entreprise ou les membres d&#8217;une
bande d&#8217;adolescents d&#8217;un quartier, pour citer quelques exemples.
</p>
<p>Avec l&#8217;av&#232;nement de l&#8217;&#232;re de l&#8217;information et des communaut&#233;s dites virtuelles de l&#8217;Internet,
l&#8217;ARS attire l&#8217;attention d&#8217;une communaut&#233; scientifique de plus en plus large. Gr&#226;ce &#224; cette
&#233;volution du domaine, les chercheurs en sciences humaines, qui ont l&#8217;habitude de mener leurs
recherches sur des corpus de taille limit&#233;e, commencent &#224; profiter des exploits d&#8217;autres disci-
plines qui leur permettent d&#8217;&#233;tudier les relations entre individus &#224; un autre niveau.
</p>
<p>La th&#233;orie des graphes, pour citer un exemple, a d&#233;velopp&#233; des m&#233;thodes de repr&#233;sentation
de r&#233;seaux et des techniques d&#8217;exploration qui sont maintenant utilis&#233;es pour interpr&#233;ter les
donn&#233;es relationnelles.
</p>
<p>Le remplissage de formulaires avec des donn&#233;es biographiques n&#8217;est pas, en soi, une t&#226;che qui
permette d&#8217;enrichir l&#8217;information qui est d&#233;j&#224; organis&#233;e dans notre corpus. En revanche, nous
pouvons construire une structure &#224; partir des nombreux liens entre les personnages du Maitron,
une structure qui pourra &#234;tre exploit&#233;e par les chercheurs qui utilisent le dictionnaire comme
ressource de recherche.
</p>
<p>Les sections 3.1 et 3.2 sont consacr&#233;es &#224; la description des structures utilis&#233;es pour mod&#233;liser
l&#8217;information contenue dans le corpus du Maitron. Nous consid&#233;rons qu&#8217;une mod&#233;lisation ins-
pir&#233;e de l&#8217;ARS nous permet d&#8217;atteindre un niveau de structuration plus riche que celui inspir&#233;
du remplissage de formulaires d&#8217;extraction.
</p>
<p>3.1 Le r&#233;seau social du Maitron
</p>
<p>Si l&#8217;on voit le Maitron non pas comme une collection de notices biographiques mais comme
un corps structur&#233; d&#8217;informations &#224; propos d&#8217;un ensemble d&#8217;individus, sa structuration sous la
forme d&#8217;un r&#233;seau social appara&#238;t comme une organisation presque naturelle pour ces donn&#233;es.
En effet, le Maitron est compos&#233; d&#8217;histoires de vie d&#8217;individus qui &#233;taient souvent en rapport
les uns avec les autres, et c&#8217;est sur ces rapports que s&#8217;est b&#226;tie une partie importante de l&#8217;his-
toire sociale de France. On remarquera que l&#8217;on peut associer ces individus &#224; d&#8217;autres &#171; acteurs
de l&#8217;histoire &#187; (publications, partis politiques, etc.). Les vies de ces personnes se rencontrent &#224;
l&#8217;int&#233;rieur d&#8217;&#233;v&#233;nements sp&#233;cifiques, &#224; travers leur appartenance &#224; des groupes ou &#224; des associa-
tions. Les liens, une fois explicit&#233;s, deviennent une abstraction structur&#233;e de l&#8217;interaction entre
les objets du r&#233;seau.
</p>
<p>Une structuration de ce type imite aussi une partie de la d&#233;marche de l&#8217;historien chercheur
qui se sert de ce type de ressource documentaire : la premi&#232;re t&#226;che du chercheur consistant &#224;
suivre les liens entre individus, associations, &#233;v&#233;nements et autres entit&#233;s saillantes. Individuel-
lement, des donn&#233;es biographiques plus traditionnelles comme les dates de naissance, les lieux
de naissances et autres, sont toujours des attributs porteurs de sens mais secondaires dans la
structuration du corpus comme un tout.
</p>
<p>340</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une nouvelle structuration de l&#8217;information extraite automatiquement
</p>
<p>On peut orienter le processus d&#8217;extraction vers la cr&#233;ation d&#8217;une repr&#233;sentation qui aurait la
structure d&#8217;un r&#233;seau. Le r&#233;seau peut &#234;tre mod&#233;lis&#233; comme un graphe et la t&#226;che d&#8217;extraction
consiste &#224; r&#233;colter les donn&#233;es n&#233;cessaires pour construire cette repr&#233;sentation (les liens entre
les sommets du graphe). Tout comme le r&#233;sultat d&#8217;une t&#226;che classique d&#8217;EI le lien entre deux
sommets est porteur de sens en tant qu&#8217;assertion d&#8217;un fait de l&#8217;univers (l&#8217;univers du corpus).
En revanche, le sens du lien est plus riche car, dans le r&#233;seau, le m&#234;me lien peut &#234;tre interpr&#233;t&#233;
aussi en fonction de son appartenance &#224; une structure plus complexe.
</p>
<p>Sachant donc que nous cherchons &#224; construire une repr&#233;sentation sous la forme d&#8217;un r&#233;seau, il
nous reste &#224; d&#233;crire les objets qui le composent : les sommets et les arcs de cette structure.
</p>
<p>3.2 L&#8217;ontologie du Maitron
</p>
<p>Nous avons d&#233;cid&#233; de structurer les objets qui composent notre repr&#233;sentation, le r&#233;seau, dans
une ontologie. Tr&#232;s utilis&#233;es dans de nombreuses applications visant le passage du Web actuel
au Web S&#233;mantique, les ontologies permettent de mod&#233;liser les connaissances d&#8217;un domaine
et de sp&#233;cifier son vocabulaire de repr&#233;sentation (Gruber, 1993). Dans notre cas, le fait d&#8217;asso-
cier des &#233;l&#233;ments qui composent le r&#233;seau &#224; une ontologie nous permet d&#8217;organiser les objets
qui nous semblent pertinents pour la construction du r&#233;seau du Maitron. L&#8217;ontologie est une
organisation qui se pr&#234;te aussi &#224; l&#8217;&#233;volution de notre compr&#233;hension de ces objets car elle nous
permet de pr&#233;voir des niveaux de granularit&#233;. Finalement, cette mani&#232;re de d&#233;crire les objets
qui composent notre repr&#233;sentation est au c&#339;ur de sa portabilit&#233; (voir section 5).
</p>
<p>Dans un premier temps, nous nous int&#233;ressons principalement au niveau le plus g&#233;n&#233;rique d&#8217;in-
teraction entre les objets du r&#233;seau. Le point de d&#233;part, inspir&#233; de l&#8217;ARS, sont les individus et
leur relations. Dans le graphe qui repr&#233;sente le r&#233;seau, les individus correspondent donc aux
sommets, et les relations aux arcs. Nous consid&#233;rons cependant que le r&#233;seau du Maitron est
structur&#233; en bonne partie par l&#8217;interaction entre individus et d&#8217;autres types d&#8217;entit&#233;s.
</p>
<p>Au premier niveau de notre ontologie, nous pla&#231;ons donc deux types d&#8217;objets, les RELATIONS,
et les ENTIT&#201;S. Nous distinguons quatre types d&#8217;entit&#233;s : INDIVIDUS, ORGANISATIONS, PUBLI-
CATIONS et &#201;V&#201;NEMENTS. Quant aux relations, elles sont d&#233;finies en fonction des diff&#233;rents
rapports qu&#8217;entretiennent deux entit&#233;s. Chaque entit&#233; est susceptible d&#8217;&#234;tre en relation avec une
autre : les individus peuvent &#234;tre en relation avec d&#8217;autres individus, mais aussi avec des or-
ganisations, des publications ou des &#233;v&#233;nements. Dans la figure 1 nous trouvons la hi&#233;rarchie
d&#8217;objets (&#224; gauche) et la combinatoire des relations (&#224; droite).
</p>
<p>FIG. 1 &#8211; Ontologie des objets et combinatoire de relations entre entit&#233;s
</p>
<p>En langue naturel ces connections peuvent prendre des formes diff&#233;rentes. Par exemple, si l&#8217;on
pense aux liens possibles entre INDIVIDUS et les quatre autres types d&#8217;ENTIT&#201;S, on trouvera ra-
pidement des marqueurs (des &#233;l&#233;ments de la langue) qui expriment ces relations : ainsi, on dira
</p>
<p>341</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alejandro ACOSTA
</p>
<p>que les individus rencontrent des individus, participent &#224; des &#233;v&#233;nements, sont membres d&#8217;or-
ganisations, &#233;crivent pour des publications. Pour chaque type de relation il y a de nombreuses
mani&#232;res d&#8217;exprimer les liens entre les deux types d&#8217;entit&#233;s concern&#233;s.
</p>
<p>Pour construire le r&#233;seau de ces relations, les structures linguistiques qui sont utilis&#233;es pour les
exprimer doivent &#234;tre identifi&#233;es, mod&#233;lis&#233;es et enfin trouv&#233;es dans le corpus. En retrouvant les
instances sp&#233;cifiques on peut extraire les informations n&#233;cessaires pour d&#233;crire les liens. Nous
utilisons des techniques d&#8217;EI sur du texte pr&#233;trait&#233; &#224; l&#8217;aide d&#8217;outils de TAL pour faire cette
extraction.
</p>
<p>3.3 L&#8217;extraction d&#8217;entit&#233;s et de relations
</p>
<p>D&#8217;autres travaux d&#8217;EI se sont d&#233;j&#224; int&#233;ress&#233;s &#224; l&#8217;extraction automatique de relations et &#224; la re-
pr&#233;sentation d&#8217;informations biographiques extraites de mani&#232;re automatique. Nous pr&#233;senterons
bri&#232;vement quelques uns.
</p>
<p>Riloff (1996) propose un syst&#232;me capable de g&#233;n&#233;rer ce qu&#8217;il appelle des case frames (qui se-
raient grosso modo &#233;quivalents aux formulaires d&#8217;extraction) comportant plus de deux entit&#233;s
dans un sc&#233;nario d&#8217;extraction. Le rep&#233;rage des relations entre entit&#233;s est utilis&#233; dans ce sys-
t&#232;me dans le but de construire automatiquement des formulaires d&#8217;extraction plus complexes.
L&#8217;objectif de Riloff est de proposer un syst&#232;me qui s&#8217;adapte facilement &#224; un nouveau domaine
(et une nouvelle t&#226;che) d&#8217;extraction. L&#8217;extraction m&#234;me consiste, encore une fois, &#224; retrouver
l&#8217;information n&#233;cessaire pour remplir des formulaires isol&#233;s.
</p>
<p>Le point de d&#233;part du syst&#232;me REES (Aone &amp;Ramos-Santacruz, 2000) est deux ontologies. Une
premi&#232;re ontologie est compos&#233;e d&#8217;une typologie d&#8217;entit&#233;s et les relations qu&#8217;on leur associe,
la deuxi&#232;me ontologie est une classification de types d&#8217;&#233;v&#233;nements. Les relations sont d&#233;finies
entre les quatre types d&#8217;entit&#233;s g&#233;n&#233;riques et les attributs qu&#8217;on leur associe g&#233;n&#233;ralement. Pour
un type d&#8217;entit&#233; comme &#171; personne &#187;, par exemple, on d&#233;finit des relations avec un titre, une
nationalit&#233;, un num&#233;ro de t&#233;l&#233;phone, une affiliation, un type, un soustype, etc. Quant aux &#233;v&#233;-
nements, ils sont compos&#233;s d&#8217;un ensemble de participants (les entit&#233;s). L&#8217;approche cherche &#224;
donner de la g&#233;n&#233;ricit&#233; au syst&#232;me d&#8217;EI par une d&#233;finition a priori des &#233;v&#233;nements possibles ;
des &#233;v&#233;nements qui sont pr&#233;sent&#233;s comme plus g&#233;n&#233;riques. Il n&#8217;y a pas de liens entre les ins-
tances isol&#233;es d&#8217;&#233;v&#233;nements qui sont extraites.
</p>
<p>Le Priol (2001) utilise la m&#233;thode dite d&#8217;exploration contextuelle pour extraire automatique-
ment des relations s&#233;mantiques comme, par exemple, est partie de ou est inclu. A la diff&#233;rence
des syst&#232;mes d&#8217;extraction classiques, le syst&#232;me de Le Priol se concentre sur les liens s&#233;man-
tiques entre unit&#233;s lexicales, et ne s&#8217;int&#233;resse pas aux &#233;v&#233;nements. Du fait de mettre des unit&#233;s
lexicales en relation, le syst&#232;me vise, comme nous, de produire une repr&#233;sentation complexe. En
revanche, cette repr&#233;sentation est plus proche d&#8217;une ontologie extraite automatiquement pour re-
pr&#233;senter des connaissances g&#233;n&#233;riques que d&#8217;un r&#233;seau social qui repr&#233;sente des informations
li&#233;es &#224; des &#233;v&#233;nements et des acteurs.
</p>
<p>Shinyama and Sekine (2006) utilisent des techniques de clustering statistique pour d&#233;couvrir au-
tomatiquement des relations dans un corpus de d&#233;p&#234;ches de presse. Leur objectif est de consti-
tuer l&#8217;ensemble de relations qui peuvent &#234;tre utilis&#233;es plus tard pour construire des formulaires
d&#8217;extraction. Les formulaires r&#233;sultent des r&#233;gularit&#233;s dans les structures linguistiques du cor-
pus. Cette approche pourrait &#234;tre utilis&#233;e dans le cadre de notre travail. En effet, les ing&#233;nieurs
linguistes qui d&#233;veloppent des patrons d&#8217;extraction pourraient utiliser le clustering statistique
</p>
<p>342</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une nouvelle structuration de l&#8217;information extraite automatiquement
</p>
<p>pour d&#233;couvrir des structures r&#233;currentes.
</p>
<p>Finalement, Kevers (2006) s&#8217;int&#233;resse &#224; l&#8217;extraction automatique de donn&#233;es biographiques et
&#224; leur repr&#233;sentation. Son objectif est de d&#233;crire un mod&#232;le de repr&#233;sentation d&#8217;information
biographique fond&#233; sur des triplets (sujet, relation, objet). Son mod&#232;le s&#8217;applique donc &#224; la
description des attributs biographiques que l&#8217;on a mentionn&#233;s dans la section 3.1 comme &#233;tant
secondaires &#224; la structuration du r&#233;seau de relations entre entit&#233;s. Son travail peut donc &#234;tre vu
comme &#233;tant compl&#233;mentaire au n&#244;tre.
</p>
<p>4 Extraction de structures linguistiques
</p>
<p>Maintenant que nous avons une meilleure compr&#233;hension de la structure de la repr&#233;sentation que
l&#8217;on veut produire et des objets qui la composent, nous devons d&#233;crire les techniques utilis&#233;es
pour r&#233;colter et arranger ces objets dans cette structure.
</p>
<p>On distinguera deux &#233;tapes dans ce processus. La premi&#232;re consiste &#224; analyser le texte non
structur&#233;, c&#8217;est-&#224;-dire &#224; l&#8217;enrichir avec des annotations linguistiques. La deuxi&#232;me &#233;tape est
l&#8217;extraction elle-m&#234;me, qui op&#232;re sur les structures qui r&#233;sultent de la premi&#232;re &#233;tape.
</p>
<p>4.1 Annotation linguistique du corpus
</p>
<p>Nous utilisons des outils de l&#8217;architecture de d&#233;veloppement linguistique MACAON3 pour le pr&#233;-
traitement des textes du corpus. Ce pr&#233;traitement est ind&#233;pendant de l&#8217;extraction et pourrait se
faire avec des outils diff&#233;rents. C&#8217;est pour cette raison que nous n&#8217;entrons pas ici dans les d&#233;-
tails techniques de ces outils de TAL, et nous nous limitons &#224; la description des caract&#233;ristiques
pertinentes pour la suite.
</p>
<p>Les outils MACAON sont une collection de modules de TAL d&#233;v&#233;lopp&#233;s pour des t&#226;ches sp&#233;-
cifiques d&#8217;annotation de textes. Avant d&#8217;utiliser les patrons d&#8217;extraction associ&#233;s aux diff&#233;rents
types de relations entre entit&#233;s, le texte des biographies est analys&#233; avec des modules MACAON
qui s&#8217;occupent des t&#226;ches suivantes :
</p>
<p>1. Segmentation en phrases
2. Tokenisation
3. Reconnaissance d&#8217;entit&#233;s nomm&#233;es
4. Analyse lexicale
5. &#201;tiquettage morpho-syntaxique
6. Analyse morphologique
7. Analyse syntaxique partielle
</p>
<p>La reconnaissance d&#8217;entit&#233;s nomm&#233;es consiste &#224; rep&#233;rer des formes superficielles d&#8217;objets de
type ENTIT&#201; de l&#8217;ontologie pr&#233;sent&#233;e dans la section 3.2.
</p>
<p>L&#8217;analyseur partiel suit le mod&#232;le propos&#233; par Abney (1996) mais incorpore aussi le concept
de t&#234;te. Dans le mod&#232;le d&#8217;analyse partiel de Abney, des grammaires r&#233;guli&#232;res d&#233;crivant des
</p>
<p>3http://code.google.com/p/macaon/
</p>
<p>343</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alejandro ACOSTA
</p>
<p>constituants partiels (ou chunks) s&#8217;appliquent en cascade aux s&#233;quences de parties du discours
qui composent les phrases du texte &#224; analyser. Dans l&#8217;impl&#233;mentation de MACAON, les patrons
r&#233;guliers qui d&#233;crivent les chunks peuvent identifier l&#8217;un de ses composants comme &#233;tant la t&#234;te
de l&#8217;ensemble. Cette application, inspir&#233;e de certains formalismes linguistiques (eg. HPSG),
permet au module d&#8217;extraction d&#8217;acc&#233;der plus ais&#233;ment &#224; certains &#233;l&#233;ments de la phrase.
</p>
<p>Apr&#232;s le passage par cet ensemble de modules de TAL, les phrases du corpus sont interpr&#233;t&#233;es4,
au moment de l&#8217;extraction, comme des s&#233;quences de structures de traits. Les structures de traits
contiennent l&#8217;ensemble des annotations linguistiques ajout&#233;es par les diff&#233;rents modules.
</p>
<p>4.2 FSMs et structures de traits
</p>
<p>La reconnaissance des fragments de texte associ&#233;s aux liens qui composent le r&#233;seau, ainsi que
l&#8217;extraction des arguments dans chaque instance d&#8217;une relation sont tous les deux accomplis
avec des machines &#224; &#233;tats finis (FSMs) &#224; base de structures de traits (ou FS-FSMs5).
</p>
<p>Nous venons d&#8217;expliquer que la version analys&#233;e des phrases du corpus est compos&#233;e de struc-
tures de traits. Le module d&#8217;extraction utilise des machines &#224; &#233;tats finis pour reconna&#238;tre des
patrons non pas sur un alphabet de symboles mais sur un alphabet de structures de traits. A
la diff&#233;rence des automates traditionnels de reconnaissance, les FS-FSMs n&#8217;utilisent pas la re-
lation de l&#8217;&#233;galit&#233; lors de la reconnaissance. Cette relation entre les symboles de l&#8217;entr&#233;e de
l&#8217;automate est remplac&#233;e par la relation de subsomption entre structures de traits.
</p>
<p>Dans une machine &#224; &#233;tats finis habituelle, la reconnaissance se fait au fur et &#224; mesure que la
machine change d&#8217;&#233;tat, et ceci en fonction des symboles qu&#8217;elle trouve sur la bande d&#8217;entr&#233;e et
des symboles associ&#233;s &#224; ses transitions. Pour changer d&#8217;&#233;tat, une FS-FSM qui se trouve dans un
&#233;tat donn&#233; doit avoir une transition associ&#233;e &#224; une structure de traits qui subsume la structure
de traits de la bande d&#8217;entr&#233;e. Parall&#232;lement, les entit&#233;s sont extraites durant la reconnaissance.
Ce n&#8217;est que lorsque la FS-FSM atteint un &#233;tat d&#8217;acceptation (apr&#232;s avoir travers&#233; un certain
nombre de transitions) que l&#8217;instance de relation est reconnue et que l&#8217;information extraite est
valid&#233;e. Les instances incompl&#232;tes sont rejet&#233;es.
</p>
<p>Une machine d&#8217;extraction simple d&#233;crit un patron sp&#233;cifique utilis&#233; pour la reconnaissance
d&#8217;une relation. Ce patron pourrait &#234;tre, par exemple, le patron d&#233;crivant des phrases avec le
nom d&#8217;une personne (une entit&#233; de type INDIVIDU) suivi de &#171; &#233;tait membre de &#187;, suivi &#224; son
tour d&#8217;une entit&#233; nomm&#233;e reconnue comme le nom d&#8217;un parti politique (une entit&#233; de type
ORGANISATION). Des machines plus complexes peuvent &#234;tre d&#233;finies pour des patrons plus
expressifs ; par exemple, pour l&#8217;ensemble de patrons construits autour du d&#233;clencheur lexical
membre.
</p>
<p>L&#8217;utilisation d&#8217;une technique de traitement deriv&#233;e des machines &#224; &#233;tats finis nous permet de
tenir compte de leurs propri&#233;t&#233;s et d&#8217;utiliser les op&#233;rations d&#233;finies sur elles en tant que mod&#232;le
de calcul. Nous pensons plus pr&#233;cis&#233;ment &#224; l&#8217;union, la minimisation et la d&#233;terminisation. Le
module d&#8217;extraction peut &#234;tre vu comme l&#8217;union des FS-FSMs associ&#233;es aux relations entre les
diff&#233;rents types d&#8217;entit&#233;s. La minimisation et la d&#233;terminisation pourraient6 &#234;tre utilis&#233;es pour
</p>
<p>4Voir (Gazdar et al., 1988) pour une description de l&#8217;utilisation des structures de traits pour repr&#233;senter des
cat&#233;gories syntaxiques.
</p>
<p>5On pr&#233;f&#232;re l&#8217;acronyme de la version anglaise &#171; Feature Structure Finite State Machines &#187; du fait de l&#8217;usage
courant dans la litt&#233;rature de l&#8217;acronyme FSM pour les machines &#224; &#233;tats finis
</p>
<p>6Nous n&#8217;avons pas encore formalis&#233; l&#8217;application des strat&#233;gies de minimisation ni de d&#233;terminisation &#224; des
</p>
<p>344</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une nouvelle structuration de l&#8217;information extraite automatiquement
</p>
<p>am&#233;liorer la performance (en temps et en espace) du module d&#8217;extraction.
</p>
<p>Par ailleurs, le processus de la construction de la repr&#233;sentation peut aussi &#234;tre vu comme un pro-
cessus incr&#233;mental. Nous n&#8217;avons pas besoin de d&#233;finir toutes les relations (et tous les patrons
associ&#233;s &#224; ces relations) au pr&#233;alable et la totalit&#233; du r&#233;seau ne doit pas &#234;tre la sortie d&#8217;une seule
extraction. L&#8217;extraction, telle qu&#8217;elle est d&#233;crite ici, peut op&#233;rer comme une m&#233;thode permet-
tant l&#8217;acquisition incr&#233;mentale de connaissances. La taille de l&#8217;ensemble de relations augmente,
ainsi que la taille du r&#233;seau, au fur et &#224; mesure que les patrons des FS-FSMs sont affin&#233;s.
</p>
<p>A l&#8217;heure actuelle, nous nous concentrons sur la mise au point des outils d&#233;crits dans la section
4.1 et sur la mod&#233;lisations des patrons d&#8217;extraction, ce qui nous permettra de passer &#224; l&#8217;&#233;tape
d&#8217;&#233;valuation des r&#233;sultats. Bien que l&#8217;on ne puisse pas pr&#233;senter pour l&#8217;instant des r&#233;sultats
concrets, nous pouvons mentionner les perspectives qui guident notre travail.
</p>
<p>5 Perspectives
</p>
<p>Nous voyons, au moins, trois directions d&#8217;&#233;volution du travail que nous menons sur leMaitron :
l&#8217;&#233;tude du r&#233;seau qui r&#233;sulte de l&#8217;extraction, l&#8217;adaptation de la structure de repr&#233;sentation &#224;
d&#8217;autres domaines d&#8217;application et l&#8217;inclusion de connaissances extraites dans des syst&#232;mes
intelligents.
</p>
<p>Nous avons mentionn&#233; que l&#8217;ARS attire l&#8217;attention de plusieurs domaines de recherche. On
pourrait adapter les avanc&#233;es dans d&#8217;autres domaines &#224; notre utilisation du corpus. L&#8217;applica-
tion de m&#233;thodes de th&#233;orie des graphes, par exemple, pourrait aider &#224; exploiter la structure du
r&#233;seau. Avec les m&#233;thodes d&#8217;analyse de cette th&#233;orie, on peut envisager de retrouver les entit&#233;s
les plus saillantes, ou celles qui cr&#233;ent des ponts entre diff&#233;rents fragments du r&#233;seau. Nous
pouvons aussi exploiter la structure du r&#233;seau pour raffiner la classification des entit&#233;s du do-
maine dans le but, par exemple, d&#8217;adapter l&#8217;exploitation du r&#233;seau &#224; la construction automatique
d&#8217;ontologies.
</p>
<p>Nous nous int&#233;ressons dans notre travail aux relations entre diff&#233;rents types d&#8217;entit&#233;s. Bien que
ces relations semblent sp&#233;cifiques &#224; l&#8217;interpr&#233;tation de la structure du corpus du Maitron, elle
ne sont pas limit&#233;es au domaine des corpus biographiques. Tant que les m&#234;mes types d&#8217;entit&#233;s
sont concern&#233;es, les m&#234;mes relations et les m&#234;mes patrons peuvent &#234;tre utilis&#233;s pour des t&#226;ches
d&#8217;extraction et d&#8217;acquisition de connaissances dans d&#8217;autres domaines. L&#8217;Internet et ses com-
munaut&#233;s virtuelles, par exemple, sont un vaste domaine dans lequel on trouve les m&#234;mes types
d&#8217;entit&#233;s. Les textes (ou autres donn&#233;es) partag&#233;s par les membres de ces groupes peuvent &#234;tre
utilis&#233;s pour constituer un corpus qui permettrait de recr&#233;er le r&#233;seau de leurs relations.
</p>
<p>Nous avons choisi de repr&#233;senter le r&#233;seau avec des d&#233;clarations RDF7. Ces derni&#232;res peuvent
&#234;tre int&#233;gr&#233;es directement dans les syst&#232;mes experts qui sont &#233;labor&#233;s suivant les standards
XML propos&#233;s pour la repr&#233;sentation et l&#8217;exploitation des donn&#233;es en ligne. De plus, ces stan-
dards entretiennent un lien &#233;troit avec le domaine de la repr&#233;sentation de connaissances ; notons
que notre mod&#233;lisation du r&#233;seau peut &#234;tre traduite en termes de logique de description. Le
r&#233;seau du Maitron structure des connaissances tr&#232;s pr&#233;cises, mais ces connaissances peuvent
s&#8217;int&#233;grer dans des syst&#232;mes qui exploitent des bases de connaissances pour d&#8217;autres domaines
</p>
<p>machines qui utilisent la subsomption comme relation de reconnaissance. Leur union, en revanche, est triviale.
7La pr&#233;sentation de ces standard XML &#233;tant au-d&#233;l&#224; de la port&#233;e de cette article, nous dirigeons le lecteur vers
</p>
<p>la documentation qui peut se trouver en ligne.
</p>
<p>345</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alejandro ACOSTA
</p>
<p>d&#8217;application comme, par exemple, les syst&#232;mes de question-r&#233;ponse.
</p>
<p>6 Conclusion
</p>
<p>Nous avons propos&#233; d&#8217;utiliser des techniques d&#8217;EI dans le but de construire des structures de
repr&#233;sentation plus complexes que les bases de donn&#233;es plates qui sont souvent utilis&#233;es pour
l&#8217;&#233;valuation des syst&#232;mes d&#8217;extraction.
</p>
<p>Nous avons d&#233;crit une repr&#233;sentation organis&#233;e autour des relations entre types d&#8217;entit&#233;s g&#233;n&#233;-
riques. Le cas du travail en cours avec un corpus de biographies a &#233;t&#233; utilis&#233; pour d&#233;crire une
application concr&#232;te de cette mani&#232;re d&#8217;exploiter les r&#233;sultats d&#8217;un processus d&#8217;extraction dans
le but de constituer une base de connaissances avec une structure inspir&#233;e de l&#8217;ARS.
</p>
<p>Nous avons d&#233;crit la m&#233;thodologie et les outils utilis&#233;s dans le processus d&#8217;extraction, et nous
nous sommes particuli&#232;rement int&#233;ress&#233; &#224; la description des machines &#224; &#233;tats finis qui mod&#233;-
lisent des structures du langage naturel.
</p>
<p>Finalement, nous avons pr&#233;sent&#233; trois chemins distincts d&#8217;&#233;volution de ce projet de recherche.
</p>
<p>R&#233;f&#233;rences
ABNEY S. (1996). Partial Parsing via Finite-State Cascades. InWorkshop on Robust Parsing,
8th European Summer School in Logic, Language and Information, p. 8&#8211;15, Prague.
AONE C. &amp; RAMOS-SANTACRUZ M. (2000). REES: A Large-scale Relation and Event Ex-
traction System. In Proceedings of the 6th Applied Natural Language Processing Conference.
GAZDAR G., PULLUM G. K., CARPENTER R., KLEIN E., HUKARI T. E. &amp; LEVINE R. D.
(1988). Category Structures. Computational Linguistics, 14(1), 1&#8211;19.
GRUBER T. R. (1993). Towards Principles for the Design of Ontologies Used for Knowledge
Sharing. In N. GUARINO &amp; R. POLI, Eds., Formal Ontology in Conceptual Analysis and
Knowledge Representation, Deventer, The Netherlands: Kluwer Academic Publishers.
KEVERS L. (2006). L&#8217;information biographique: mod&#233;lisation, organisation et extraction en
base de connaissances. In Actes de TALN-RECITAL, p. 680&#8211;689, Leuven, Swisse.
LE PRIOL F. (2001). Identification, interpr&#233;tation et repr&#233;sentation de relations s&#233;mantiques
entre concepts. In Actes de TALN.
M. T. PAZIENZA, Ed. (1999). Information Extraction: Towards Scalable, Adaptable Systems,
volume 1714 of Lecture Notes in Artificial Intelligence. Berlin, Germany: Springer.
POIBEAU T. (2003). Extraction automatique d&#8217;information : du texte brut au web s&#233;mantique.
Paris, France: Herm&#232;s.
RILOFF E. (1996). Automatically Generating Extraction Patterns from Untagged Text. In
Proceedings of the 13th National Conference on Artificial Intelligence (AAAI-96), p. 1044&#8211;
1049.
SHINYAMA Y. &amp; SEKINE S. (2006). Preemptive Information Extraction using Unrestricted
Relation Discovery. In Proceedings of the Human Language Technology Conference of the
NAACL, Main Conference, p. 304&#8211;311, New York City, USA: Association for Computational
Linguistics.
</p>
<p>346</p>

</div></div>
</body></html>