<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Pour un autre traitement de la temporalit&#233; narrative</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;cital 2001, Tours, 2-5 juillet 2001
</p>
<p>Pour un autre traitement de la temporalit&#233; narrative
</p>
<p>St&#233;phanie Girault
</p>
<p>Laboratoire CRISCO
Universit&#233; de Caen
14032 Caen Cedex
</p>
<p>sgirault@crisco.unicaen.fr
</p>
<p>Abstract
</p>
<p>Continuous media &#8211; stories, movies, songs &#8211; all have a basic linear structure from which cognitive
processes are able to retrieve some temporal organization. How much semantic computation is
necessarily involved for a proper framing of events and their transition to one another ? Can this
computation be approximated with the help of simple formal clues from a shallow parsing of the story
stream, and how far can it go ?
</p>
<p>Our experiments with a prototype application implement a method for segmenting written stories and
splicing together &quot;referential situations&quot; that should belong to the same time-frame. This paper does
not aim to describe the implementation but rather discusses the linguistic approach to detecting
discontinuity in narrative texts, based on the principles of closure and rupture in temporal consistency.
</p>
<p>Keywords  : semantics ; discourse representation ; temporality ; narratives
</p>
<p>R&#233;sum&#233;
</p>
<p>Tous les m&#233;dias continus (parole, texte, musique, cin&#233;ma) ont, par d&#233;finition, une structure lin&#233;aire, &#224;
partir de laquelle un processus cognitif est capable de reconstituer une organisation temporelle
diff&#233;rente. Mais jusqu'&#224; quel point faut-il comprendre un texte pour le segmenter en situations et les
articuler entre elles ? Autrement dit : jusqu'&#224; quel point faut-il conna&#238;tre la musique pour diff&#233;rencier
couplet et refrain ?
Dans un grand nombre de cas, il est possible d'effectuer une telle segmentation automatiquement, et
cela uniquement &#224; partir d'indices morpho-syntaxiques. Notre prototype de programme identifie des
situations r&#233;f&#233;rentielles et analyse la fa&#231;on dont elles sont articul&#233;es pour reconstruire la structure
temporelle d'un r&#233;cit. L'objectif de cette communication n'est pas la description de ce programme,
mais plut&#244;t le point de vue du linguiste : comment d&#233;tecter les discontinuit&#233;s, c'est-&#224;-dire comment
d&#233;cider s'il y a compl&#233;tion ou rupture.
</p>
<p>Mots cl&#233;s : s&#233;mantique ; repr&#233;sentation du discours ; temporalit&#233; ; narration</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Girault
</p>
<p>1. Introduction
</p>
<p>1.1 Repr&#233;sentation de l&#8217;organisation temporelle
</p>
<p>Comment repr&#233;senter l&#8217;organisation temporelle &#233;voqu&#233;e dans un texte narratif ? La
repr&#233;sentation la plus &#233;vidente est la s&#233;quence lin&#233;aire, o&#249; les &#233;v&#233;nements sont align&#233;s en
fonction de leur ordre chronologique. Et comment reconstruit-on cet ordre &#224; partir du texte ?
En se fondant sur des marques formelles : locutions adverbiales fonctionnant comme
localisateurs temporels, et, bien s&#251;r, les verbes, leur temps, leur aspect, et leur s&#233;mantique &#8211;
&#233;tat, processus.
</p>
<p>Mais cette approche pose de s&#233;rieux probl&#232;mes : par exemple, comment repr&#233;senter les
hypoth&#233;tiques, ou les &#233;ventuels commentaires du narrateur ? Ceci remet radicalement en
question la repr&#233;sentation lin&#233;aire. Alors quelle repr&#233;sentation adopter ? L'arborescence ? Le
r&#233;seau ?
</p>
<p>Nous proposons ici l'&#233;bauche d'un mod&#232;le qui permet de segmenter un r&#233;cit en autant de
situations qu'il &#233;voque. Cette segmentation est fond&#233;e sur les principes de compl&#233;tion et de
rupture de la continuit&#233; temporelle. Elle est extr&#234;mement &#233;conomique parce qu&#8217;elle n&#8217;a pas
besoin de faire l&#8217;analyse s&#233;mantique du texte : elle fonctionne strictement &#224; partir d&#8217;indices
formels d&#233;tect&#233;s au niveau morpho-syntaxique.
</p>
<p>Les segments ainsi obtenus peuvent &#234;tre ensuite, selon le cas, ordonn&#233;s lin&#233;airement, ou
empil&#233;s dans une dimension virtuelle qui, elle aussi, supporte r&#233;cursivement la repr&#233;sentation
lin&#233;aire et arborescente. Et comme les &#233;v&#233;nements des niveaux virtuels peuvent aussi &#233;voquer
ceux de l&#8217;autre niveau [actuel ?], un tel mod&#232;le adopte finalement une repr&#233;sentation formelle
de r&#233;seau.
</p>
<p>Segmenter un r&#233;cit en situations, c&#8217;est un peu comme r&#233;&#233;crire le script d&#8217;un film pendant
qu&#8217;on le regarde. Comment sait-on que cette sc&#232;ne est un flash-back ? Et l&#224;, s&#8217;agit-il d&#8217;un
r&#234;ve, d&#8217;une projection dans l&#8217;avenir ? Ou s&#8217;agit-il tout simplement de la suite chronologique ?
L&#8217;originalit&#233; du mod&#232;le propos&#233; c&#8217;est qu&#8217;il s&#8217;appuie sur les articulations de l&#8217;&#233;nonciation,
autrement dit, sur les fronti&#232;res de situations, pour effectuer la segmentation.
</p>
<p>Ce point de vue nous a conduit &#224; caract&#233;riser les marques linguistiques du temps et de l'aspect
(temps verbaux, aspect lexical et grammatical, connecteurs temporels, &#8230;) selon le type
d'encha&#238;nement qu'ils privil&#233;gient. Il ne sera question ici que des temps verbaux. 1
</p>
<p>1.2 La compl&#233;tion &#8211; la d&#233;tection de coh&#233;rence et d&#8217;homog&#233;n&#233;it&#233;
</p>
<p>Du point de vue cognitif, l&#8217;interpr&#233;tation du texte narratif &#233;crit est un processus analogue &#224;
celui de l&#8217;&#233;coute d&#8217;une histoire ou d&#8217;une chanson, &#224; la lecture d&#8217;un film ou d&#8217;une bande
dessin&#233;e. Ces modes d&#8217;expression ont en effet en commun de d&#233;velopper dans le temps des
th&#232;mes &#8211; auditivement ou visuellement perceptibles. Dans tous les cas, il s&#8217;agit de segmenter
temporellement et d&#8217;articuler ces segments entre eux pour reconstituer des unit&#233;s de niveau
sup&#233;rieur.
</p>
<p>                                                
1 Pour un &#233;tat de l'art sur la probl&#233;matique temps, aspect et narration en linguistique, nous renvoyons &#224; Irandoust [1997] et
</p>
<p>Moeschler [1998]. Pour une mod&#233;lisation informatique des ph&#233;nom&#232;nes de discours, et en particulier, de la temporalit&#233;,
nous renvoyons &#224; Bras [1990] et Kamp &amp; Reyle  [1993] pour les s&#233;mantiques dynamiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour un autre traitement de la temporalit&#233; narrative
</p>
<p>Ceci est d&#8217;ailleurs &#233;galement vrai pour la reconnaissance du signal de parole : segmenter,
c&#8217;est d&#8217;abord reconna&#238;tre les mots, puis les articuler et reconna&#238;tre leur fonction syntaxique, ce
qui permet alors de reconstruire des propositions, et ainsi de suite. Remarquablement, on ne
peut segmenter le signal que lorsqu&#8217;on a l&#8217;indice qu&#8217;un nouveau mot vient de commencer :
par exemple, le premier mot de cette phrase, remarquablement, contient bien le mot remarque
(d&#8217;un point de vue acoustique) mais il n&#8217;est pas possible de segmenter parce que ablement ne
serait alors pas un segment valide.
</p>
<p>Cette d&#233;marche intuitive est notre guide premier : la d&#233;limitation des segments doit &#234;tre
fond&#233;e sur la validit&#233; du segment en cours de constitution (remar n&#8217;est pas un segment valide)
et sur la validit&#233; du segment suivant (quablement ?). Autrement dit, tant que le segment en
cours pr&#233;sente une certaine coh&#233;rence, il n&#8217;y a pas de raison de segmenter.
</p>
<p>Autre exemple, dans une bande dessin&#233;e, deux images cons&#233;cutives [Fig.1] peuvent repr&#233;senter
un nombre infini d&#8217;&#233;v&#233;nements : c&#8217;est le lecteur qui reconstitue la coh&#233;rence et d&#233;cide qu&#8217;on a
affaire &#224; une seule situation.
</p>
<p>Et c&#8217;est lui qui reconstitue ce qui se passe entre les deux images et reconstruit la coh&#233;rence.
Nous appellerons compl&#233;tion cette op&#233;ration de reconstruction du tout &#224; partir des fragments.
</p>
<p>Mais il est des cas o&#249; deux situations sont homog&#232;nes alors qu&#8217;elles ne sont pas coh&#233;rentes.2
</p>
<p>Le calcul de la coh&#233;rence &#8211; l&#8217;interpr&#233;tation &#8211; est alors cognitivement plus co&#251;teux, mais la
compl&#233;tion est possible : le segment reste globalement interpr&#233;table . Enfin, il faut pouvoir
d&#233;tecter les articulations non-homog&#232;nes mais coh&#233;rentes [Fig.2], et, dernier cas, non-
homog&#232;nes et non-coh&#233;rentes.
</p>
<p>                                                
2 Pour la notion de coh&#233;rence dans une probl&#233;matique textuelle, nous renvoyons au chapitre 4 de Van Dijk [1977]
</p>
<p>Fig.1.a : Il se servit un verre. Fig.1.b : Une heure apr&#232;s, la bouteille &#233;tait vide
</p>
<p>Fig.2.a : Il finit la bouteille. Fig.2.b : Il percuta un arbre.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Girault
</p>
<p>&#8226; Le premier cas (non homog&#232;ne mais coh&#233;rent) est &#233;videmment tr&#232;s d&#233;licat : il est probable
qu&#8217;il ne peut &#234;tre d&#233;tect&#233; qu&#8217;avec un mod&#232;le plus fin.
</p>
<p>&#8226; Le deuxi&#232;me est le cas de rupture : on change de sc&#232;ne, donc il s&#8217;agit d&#8217;un autre moment &#8211;
avant, apr&#232;s ? &#8211; et peut-&#234;tre d&#8217;un autre lieu, avec d&#8217;autres personnages. L&#224;, nous disposons
d&#8217;une large panoplie d&#8217;indices formels, qui orbitent autour du verbe : son sujet, son temps,
et ses compl&#233;ments circonstanciels de temps.
</p>
<p>Attachons nous maintenant &#224; caract&#233;riser les conditions qui d&#233;clenchent le changement de
sc&#232;ne et de d&#233;cor, autrement dit, la rupture.
</p>
<p>1.3 La rupture
</p>
<p>En premi&#232;re approximation, il y aurait trois types de ruptures :
</p>
<p>&#8226; rupture &#233;nonciative, le narrateur fait des commentaires sur la situation, mais aussi le
discours direct ;
</p>
<p>&#8226; rupture chronologique, le flash-back
</p>
<p>&#8226; rupture entre le plan actuel de l&#8217;&#233;nonciation et le plan virtuel : l&#8217;hypoth&#233;tique 
</p>
<p>Quels sont les indices qui permettent de d&#233;tecter qu'il y a rupture et de quel type il s'agit ?
Pour le flash-back, pas de probl&#232;me, on se fonde sur l&#8217;alternance temporelle : pour un r&#233;cit au
pr&#233;sent, le pass&#233; compos&#233;, pour un r&#233;cit au pass&#233; simple, le plus-que-parfait &#8211;&#8211; indices
indiscutables de ruptures dans la continuit&#233; temporelle. Idem pour l&#8217;hypoth&#233;tique : la marque
si &#8211; adverbe ou conjonction de subordination &#8211; et le conditionnel ou futur qui vont souvent
(mais pas forc&#233;ment) avec, sont des indices parfaitement fiables.
</p>
<p>Le discours direct est lui aussi identifiable formellement :
&#8211; Vous avez dit bizarre ?
&#8211; Moi ? J&#8217;ai dit bizarre ? Comme c&#8217;est bizarre !...
</p>
<p>Par contre, d&#233;tecter qu&#8217;il s&#8217;agit d&#8217;un commentaire du narrateur exige une analyse s&#233;mantique
beaucoup plus pouss&#233;e, que nous n&#8217;envisagerons pas dans le cadre de cet expos&#233;.
</p>
<p>2. La mise en &#339;uvre
</p>
<p>Nous d&#233;finirons la r&#233;f&#233;rence comme une op&#233;ration de construction du sens par l&#8217;interaction
d&#8217;une &#233;nonciation et de la repr&#233;sentation mentale en cours d'&#233;laboration . Nous appellerons
situations r&#233;f&#233;rentielles (d&#233;sormais SitR en abr&#233;g&#233;) les unit&#233;s constitutives de cette
repr&#233;sentation. Dans ce cadre, l&#8217;interpr&#233;tation d&#8217;un texte narratif serait une proc&#233;dure visant &#224;
identifier des SitR et les articuler entre elles.
</p>
<p>Nous travaillons sur un corpus de textes narratifs issus de la base FRANTEXT. Les textes sont
&#233;tudi&#233;s dans leur int&#233;gralit&#233; de mani&#232;re &#224; pr&#233;server leur coh&#233;rence interne. Les donn&#233;es que
nous traitons sont le r&#233;sultat de l&#8217;analyseur syntaxique de Jacques Vergne sur ces textes.
</p>
<p>Le programme est un prototype &#233;crit en Lisp (xLisp 2.3) qui n'avait, &#224; l'origine, que l'ambition
de valider nos hypoth&#232;ses de travail : nous l'avons d'abord appliqu&#233;, &#224; un corpus de test, la
nouvelle de Flaubert, Un c&#339;ur simple.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour un autre traitement de la temporalit&#233; narrative
</p>
<p>2.1 L&#8217;environnement, les donn&#233;es d&#8217;entr&#233;e, la repr&#233;sentation interne
</p>
<p>Notre environnement est orient&#233; objet. Les objets sont typ&#233;s et les types sont hi&#233;rarchis&#233;s. Ils
sont munis de propri&#233;t&#233;s statiques (couples attribut/valeur) et dynamiques (couples
s&#233;lecteurs/m&#233;thodes). Les propri&#233;t&#233;s des types constituent leur m&#233;moire priv&#233;e, mais sont
h&#233;ritables par leurs sous-types et leurs instances. Les objets communiquent entre eux par
envoi de messages.
</p>
<p>Dans le flux d&#8217;entr&#233;e, la sortie d'un &quot;shallow parser&quot; [celui de J. Vergne], les donn&#233;es ne sont
pas structur&#233;es. Mais des indicateurs (tags) permettent de d&#233;limiter des syntagmes (chunks) et
des &#233;nonc&#233;s. On reconstruit donc une repr&#233;sentation interne de chaque &#233;nonc&#233;, constitu&#233; de la
liste de ses chunks, eux-m&#234;mes repr&#233;sent&#233;s par la liste de leurs constituants &#233;tiquet&#233;s :
fonctions et cat&#233;gories grammaticales. A la description d&#8217;un &#233;nonc&#233; est &#233;galement adjointe la
liste des relations de d&#233;pendance entre les chunks de cet &#233;nonc&#233;.
</p>
<p>Fig.3 Structure des donn&#233;es
</p>
<p>Cette repr&#233;sentation permet de parcourir le texte &#224; trois niveaux de r&#233;solution : celui du token,
celui du chunk et celui de l&#8217;&#233;nonc&#233;. On reconstruit alors un quatri&#232;me niveau, en identifiant
les segments consid&#233;r&#233;s comme continus d&#8217;un point de vue temporel.
</p>
<p>2.2 Segmentation
</p>
<p>En rep&#233;rant les marques temporelles (pr&#233;positions, adverbes, conjonctions de subordination,
temps du verbe), on segmente le texte en unit&#233;s intrins&#232;quement homog&#232;nes d&#8217;un point de vue
temporel. Dans la repr&#233;sentation interne, ces segments correspondent &#224; des objets de type SitP
(Situation Pr&#233;dicative).
</p>
<p>Chaque SitP repr&#233;sente un segment pr&#233;dicatif : elle est construite en parcourant le texte et en
collectant des pointeurs sur les &#233;l&#233;ments (chunks) de l'&#233;nonc&#233; qui ont permis de la g&#233;n&#233;rer. On
a d&#233;sormais un acc&#232;s direct &#224; la liste des chunks qui constituent cette pr&#233;dication, ainsi qu'aux
indices pertinents pour d&#233;limiter ce segment pr&#233;dicatif : type de chunk, type des relateurs et
des rupteurs, temps du verbe. Ces indices sont eux-m&#234;mes des objets capables d'activer une
m&#233;thode &#224; la r&#233;ception d'un message.
</p>
<p>Fig.4  Repr&#233;sentation interne d&#8217;une SitP
</p>
<p>reldep ((%RD 1 3 w &gt; V) (%RD 3 2 K &lt; V) (%RD 4 3 V &lt; N) (%RD 5 4 N &lt; pN))
1 ((%G) (%E Ensuite w))
2 ((%S K fs3) (%C elle K fs3))
3 ((V /fs3 Vmis3s-) (%S V fs3) (%C inspecta V fs3))
4 ((%S N mp3) (%P tous t mp3) (%P les d mp3) (%C jardins S mp3))
</p>
<p>5 ((%S pN s3) (%I de p) (%C Pont-l&#180;&#201;v&#234;que S s3) (%G) (%E 0))
</p>
<p>SitP : SitP-890
  type : SitP
  &#233;nonc&#233; : 658
  chunk-1 :  (%G) (%E Ensuite w)
  chunk-2 :  (%S K fs3) (%C elle K fs3)
  chunk-3 : (V /fs3 Vmis3s-) (%S V fs3) (%C inspecta V fs3)
  chunk-4 : (%S N mp3) (%P tous t mp3) (%P les d mp3) (%C jardins S mp3)
  chunk-5 : (%S pN s3) (%I de p) (%C Pont-l&#180;&#201;v&#234;que S s3) (%G) (%E 0)
  connecteur-1 : (%E Ensuite w)
  verbe-3 : (V /fs3 Vmis3s-)
  temps : pass&#233; simple</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Girault
</p>
<p>Ainsi, dans l'exemple ci-dessus, l'attribut connecteur-1 pointe sur la marque 'ensuite'
appartenant &#224; la classe 'rupteur'.
Le message 'segmente' envoy&#233; &#224; ce connecteur va provoquer une rupture : il d&#233;clenche la
cr&#233;ation d'une nouvelle instance de type 'SitR' (situation r&#233;f&#233;rentielle) absorbant cette SitP, et
peut-&#234;tre les suivantes, jusqu'&#224; la prochaine rupture.
D'autres connecteurs n'auront pas cette r&#233;action : la SitP sera alors absorb&#233;e par la SitR
courante.
</p>
<p>Les SitR sont g&#233;r&#233;es par un m&#233;canisme de piles. Chaque nouvelle SitR est pond&#233;r&#233;e
(relativis&#233;e) par rapport &#224; la SitR courante :
</p>
<p>&#8226; la nouvelle SitR &#233;voque un d&#233;crochage temporel (verbe au plus-que-parfait ou situation
hypoth&#233;tique par exemple) : la SitR est ajout&#233;e sur la pile
</p>
<p>&#8226; la nouvelle SitR est en relation de cons&#233;cution avec la SitR courante : on reste au m&#234;me
niveau dans la pile.
</p>
<p>2.3 Le r&#233;seau r&#233;sultant et son interpr&#233;tation
</p>
<p>A la fin du traitement, on aboutit &#224; plusieurs plans de SitR :
&#8226; l&#8217;ensemble des SitR appartenant au plan de la narration, ordonn&#233;es en fonction de leur
</p>
<p>moment d&#8217;apparition au fil du texte
</p>
<p>&#8226; les SitR, relevant d&#8217;autres niveaux, chacune d&#8217;entre elle pointant sur la SitR qui a permis de
la construire.
</p>
<p>2. Application &#224; l&#8217;interpr&#233;tation des temps verbaux
</p>
<p>Dans cette section, nous n&#8217;&#233;voquerons que les temps morphologiques les plus fr&#233;quents dans
notre corpus, &#224; savoir : pass&#233; simple, imparfait et plus-que-parfait de l&#8217;indicatif.
</p>
<p>Dans ce mod&#232;le, les temps verbaux codent des directives relatives &#224; la construction des SitR et
leur mise en relation. Quelles sont ces directives ? A quel point sont-elles r&#233;ductrices ?
</p>
<p>2.1 Le pass&#233; simple
</p>
<p>Cas g&#233;n&#233;ral : le pass&#233; simple introduit une nouvelle SitR dans la repr&#233;sentation. En l&#8217;absence
de marques temporelles particuli&#232;res, la nouvelle situation est reli&#233;e &#224; la pr&#233;c&#233;dente par un
lien de type succession. Une fois instanci&#233;e la nouvelle SitR (appelons la SitRi) devient la
situation courante, et absorbe les SitP subs&#233;quentes jusqu&#8217;&#224; la prochaine occurrence de pass&#233;
simple. On cr&#233;e alors SitRi+1 qui devient la SitR courante et ainsi de suite.
</p>
<p>SitRi
</p>
<p>IMPFT
</p>
<p>PS SitRi+1
</p>
<p>IMPFT
</p>
<p>PSPS
</p>
<p>Fig. 5 Traitement g&#233;n&#233;ral du pass&#233; simple</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour un autre traitement de la temporalit&#233; narrative
</p>
<p>Cas particuliers : certaines configurations appellent un traitement particulier. Prenons
l&#8217;exemple d&#8217;un encha&#238;nement de pass&#233;s simples. D&#8217;apr&#232;s le principe &#233;voqu&#233; ci-dessus, on
devrait aboutir &#224; la sch&#233;matisation suivante, o&#249; chaque occurrence de pass&#233; simple introduit
une nouvelle SitR :
</p>
<p>Or, cette configuration supporte au moins deux interpr&#233;tations s&#233;mantiques :
</p>
<p>L&#8217;encha&#238;nement de pass&#233;s simples fait r&#233;f&#233;rence &#224; des proc&#232;s en relation de succession
imm&#233;diate, comme l&#8217;illustre l&#8217;exemple [1] :
</p>
<p>[1] Il d&#233;couvrit une bo&#238;te, la d&#233;fon&#231;a d'un coup de pied. Le portrait de Rodolphe lui sauta en
plein visage, au milieu des billets doux boulevers&#233;s.
</p>
<p>[Stendhal, Le Rouge et le Noir]
</p>
<p>Ici, les &#233;v&#233;nements semblent se d&#233;rouler dans un intervalle temporel homog&#232;ne, ce qui rend
invraisemblable la r&#233;partition des SitP dans des SitR distinctes.
</p>
<p>En outre, du point de vue de l&#8217;encha&#238;nement des temps verbaux, [1] est rigoureusement
identique &#224; [2] o&#249; manifestement, des &#233;v&#233;nements temporellement disjoints sont pr&#233;sent&#233;s
d&#8217;un point de vue continu.
</p>
<p>[2] Il s&#8217;ennuya, voyagea encore, puis restaura son ch&#226;teau de Villebosq.
[Maupassant, Contes et nouvelles]
</p>
<p>En fait, il s&#8217;agit d&#8217;une option narrative ; tant&#244;t, le narrateur met l&#8217;accent sur l'homog&#233;n&#233;it&#233;
temporelle [Fig.7],
</p>
<p>PS SitRi PS SiRi+1 PS
</p>
<p>SitP-1 SitP -2 SitP -3
</p>
<p>mSitR-
1
</p>
<p>mSitR-
2
</p>
<p>mSitR-
3
</p>
<p>SitR
</p>
<p>Fig. 6 Traitement d'un encha&#238;nement de pass&#233;s simples
</p>
<p>Fig.7 Relation d'homog&#233;n&#233;it&#233;
temporelle</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Girault
</p>
<p>tant&#244;t, il souligne une relation de coh&#233;rence (ou relation logique) entre les &#233;v&#233;nements [Fig.8]:
</p>
<p>Ici, on introduit un niveau suppl&#233;mentaire &#224; la repr&#233;sentation interne : les micro-situations
(mSitR en abr&#233;g&#233;). Et c&#8217;est la port&#233;e du connecteur temporel dans le contexte pr&#233;c&#233;dent qui
sera d&#233;cisive pour choisir entre les deux repr&#233;sentations.
</p>
<p>En ce qui concerne la configuration [PS+PS+PS] nous avons encore &#233;t&#233; confront&#233;s &#224; une autre
difficult&#233; : les cas de changement de th&#232;me.
</p>
<p>[3] Il fut avec elle invraisemblablement heureux. Elle gouverna sa maison avec une &#233;conomie
si adroite qu'ils semblaient vivre dans le luxe.
</p>
<p>[Maupassant, Les bijoux]
</p>
<p>Cette fois, les deux situations pr&#233;dicatives sont temporellement homog&#232;nes, c&#8217;est le point de
vue sur la situation qui change. Les deux SitP renvoient &#224; la m&#234;me SitR [Fig.9] :
</p>
<p>Un simple test de comparaison entre le sujet grammatical de la SitP-1 et celui de la SitP-2
permet de d&#233;cider si on est dans un cas de rupture temporelle (cas g&#233;n&#233;ral) ou dans un cas de
rupture th&#233;matique.
</p>
<p>2.2 Le plus-que-parfait
</p>
<p>Par d&#233;faut, le plus-que-parfait instancie une nouvelle SitR en rupture temporelle avec la SitR
courante puisqu&#8217;il &#233;voque forc&#233;ment un &#233;v&#233;nement ant&#233;rieur &#224; la SitR courante :
</p>
<p>[4] En sortant, Julien crut voir du sang pr&#232;s du b&#233;nitier, c&#8217;&#233;tait de l&#8217;eau b&#233;nite qu&#8217;on avait
r&#233;pandue.
</p>
<p>[Stendhal, Le Rouge et le Noir]
</p>
<p>On voit avec cet exemple que les deux situations &#233;voqu&#233;es sont en relation de coh&#233;rence ; le
plus-que-parfait construit une nouvelle SitR en rupture temporelle mais dont les s&#233;quelles
</p>
<p>SitP-1 SitP-2
</p>
<p>SitR
</p>
<p>SitP-1 SitP-2 SitP-3
</p>
<p>mSitR-
1
</p>
<p>mSitR-
2
</p>
<p>mSitR-
3
</p>
<p>Fig.8 Relation de coh&#233;rence
</p>
<p>Fig.9  Changement de point de vue
sur la situation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour un autre traitement de la temporalit&#233; narrative 
</p>
<p>seront perceptibles dans la SitR courante. Deux types de relations, donc :
</p>
<p>&#8226; une relation d&#8217;ant&#233;riorit&#233; temporelle
</p>
<p>&#8226; une relation de coh&#233;rence conceptuelle.
</p>
<p>Dans la repr&#233;sentation interne, la SitR instanci&#233;e par un plus-que-parfait maintient un pointeur
sur la situation qui a permis de la g&#233;n&#233;rer.
</p>
<p>Remarquons enfin qu&#8217;une SitR au plus-que-parfait peut tout &#224; fait &#234;tre instanci&#233;e comme SitR
courante ; dans le cas, par exemple, d&#8217;un flash-back narratif .
</p>
<p>[5] Au reste, Jacopo, qui, en le voyant tomber l&#8217;avait cru mort, s&#8217;&#233;tait pr&#233;cipit&#233;  sur lui, l&#8217;avait
relev&#233; et enfin, une fois relev&#233;, l&#8217;avait soign&#233; en excellent camarade.
</p>
<p>[Dumas, Le comte de Monte-Cristo]
</p>
<p>2.3 L&#8217;imparfait
</p>
<p>L&#8217;imparfait est un marqueur d&#8217;int&#233;gration. Comme l&#8217;illustre la premi&#232;re figure de la section 3,
les SitP &#224; l&#8217;imparfait sont par d&#233;faut, automatiquement absorb&#233;es par la SitR courante. Reste
que pour les cas o&#249; l&#8217;imparfait d&#233;signe une situation r&#233;currente &#8211; interpr&#233;tation it&#233;rative
(exemple 6) &#8211;  et pour les occurrences d&#8217;imparfait dit narratif (exemple 7), il faudra envisager
un traitement particulier.
</p>
<p>[6]  Elle se levait d&#232;s l'aube, pour ne pas manquer  la  messe, et travaillait jusqu'au soir sans
interruption ; puis, le d&#238;ner &#233;tant fini, la vaisselle en ordre et la porte bien close, elle
enfouissait la b&#251;che sous les cendres et s'endormait devant l'&#226;tre, son rosaire &#224; la main.
</p>
<p>[Flaubert, Un c&#339;ur simple]
</p>
<p>[7] Le jour se levait alors, et la sc&#232;ne &#233;tait effrayante : les c&#244;nes se tronquaient  ; les pics
chancelants disparaissaient comme si quelque trappe s&#8217;entr&#8217;ouvrait sous leur base. Par
suite d&#8217;un ph&#233;nom&#232;ne particulier aux Cordill&#232;res, un massif, large de plusieurs milles, se
d&#233;pla&#231;ait tout entier et glissait vers la plaine. &#171; Un tremblement de terre &#187;, s&#8217;&#233;cria Paganel.
</p>
<p>[Verne, Les enfants du capitaine Grant]
</p>
<p>3. Bilan et perspectives
</p>
<p>Nous avons d&#233;fendu ici l&#8217;id&#233;e que les notions de coh&#233;sion et de rupture &#233;taient pertinentes
dans le cadre d&#8217;une analyse s&#233;mantique de la temporalit&#233; narrative. Le mod&#232;le que nous
proposons, parce qu&#8217;il s&#8217;articule autour de la notion de transition entre les situations
temporelles pr&#233;sente l&#8217;avantage de rendre compte de la dynamique interpr&#233;tative. Nous
n&#8217;avons pu aborder ici que le probl&#232;me de la mise en &#339;uvre de l&#8217;interpr&#233;tation des temps
verbaux, il resterait &#224; examiner le r&#244;le de l&#8217;aspect, des connecteurs temporels et leurs
interactions avec les temps dans ce cadre th&#233;orique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phanie Girault
</p>
<p>R&#233;f&#233;rences
</p>
<p>Bras M. (1990), Calcul des structures temporelles du discours, Th&#232;se de doctorat, Universit&#233;
Paul Sabatier de Toulouse.
</p>
<p>Denhi&#232;re G. (1984), Il &#233;tait une fois&#8230; compr&#233;hension et souvenir de r&#233;cits, Lille, Presses
Universitaires de Lille.
</p>
<p>Fauconnier G. (1984), Espaces Mentaux, Paris, Minuit.
Irandoust H. (1997), Vers un mod&#232;le cognitif de la structure temporelle des textes narratifs.
</p>
<p>Th&#232;se de doctorat, Universit&#233; Paris XI, Orsay.
Kamp H., Reyle U. (1993), From Discourse to Logic, Dordrecht, Kluwer.
Moeschler J. et alii. (1998), Le temps des &#233;v&#233;nements, Pragmatique de la r&#233;f&#233;rence
</p>
<p>temporelle, Paris, Kim&#233;.
Vetters C. (1996), Temps, aspect et narration, Amsterdam, Rodopi.
Van Dijk T. (1977), Text and context. Explorations in the Semantics and Pragmatics of
</p>
<p>Discourse, New York, Longman.
Vergne J. (1999), Etude et mod&#233;lisation de la syntaxe des langues &#224; l&#8217;aide de l&#8217;ordinateur.
</p>
<p>Analyse syntaxique automatique non combinatoire. Habilitation &#224; Diriger des
Recherches, Universit&#233; de Caen.</p>

</div></div>
</body></html>