<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La recherche documentaire : une activit&#233; langagi&#232;re</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2001, Tours, 2-5 juillet 2001 
</p>
<p>La recherche documentaire : une activit&#233; langagi&#232;re 
</p>
<p>Vincent Perlerin  
 
</p>
<p>Laboratoire GREYC &#8211; Universit&#233; de Caen 
bd Mar&#233;chal Juin &#8211; F14032 Caen Cedex 
</p>
<p>perlerin@info.unicaen.fr
</p>
<p>R&#233;sum&#233;  
</p>
<p>Un nombre important de requ&#234;tes soumises aux moteurs de recherche du W3 ne 
satisfont pas pleinement les attentes des utilisateurs. La liste de documents propos&#233;e en retour 
est souvent trop longue : son exploration repr&#233;sente un travail exag&#233;r&#233;ment laborieux pour 
l&#8217;auteur de la requ&#234;te. Nous proposons d&#8217;apporter une valeur ajout&#233;e ux syst&#232;mes de 
recherche documentaire (RD) existants en y ajoutant un filtrage n&#8217;utilisant que des donn&#233;es 
fournies par l&#8217;utilisateur. L&#8217;objectif de notre &#233;tude est de confronter un mod&#232;le dynamique de 
la m&#233;moire s&#233;mantique des individus (ou des agents) d&#233;velopp&#233; par notre &#233;quipe &#224; une t&#226;che 
n&#233;cessitant une comp&#233;tence interpr&#233;tative de la part des machines. Nous souhaitons d&#233;passer 
la s&#233;mantique lexicale couramment utilis&#233;e dans ce champ d&#8217;application pour aboutir &#224; 
l&#8217;utilisation d&#8217;une s&#233;mantique des textes e  accro&#238;tre par ce biais, &#224; la fois la qualit&#233; des 
r&#233;sultats et la qualit&#233; de leur pr&#233;sentation aux usagers.  
</p>
<p> 
Mots-clefs : recherche documentaire, syst&#232;me anthropocentr&#233;, filtrage documentaire, 
s&#233;mantique diff&#233;rentielle et componentielle, isotopie. 
</p>
<p>Abstract 
</p>
<p>Lot of the searches submitted to the main search engines on the www do not bring about 
satisfactory results for users. The list of documents proposed in return is often too long: its 
handling constitutes an exceedingly strenuous task for the user. We propos  to improve 
existing document retrieval systems by adding a filter made from criteria determined by the 
user. The objective of our study is to contrast a dynamic model of individual&#8217;s (or agent&#8217;s) 
semantic memory created by our team with a task requiring an interpretative competence from 
the machines. By this means, we hope to go beyond the lexical semantics commonly used in 
this field of application and achieve the use of t xtual semantics. 
</p>
<p> 
Keywords : document retrieval, anthropocentred system, document filtering, differential and 
decomponential semantics, isotopy. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Perlerin 
 
</p>
<p>1 Une recherche documentaire personnalis&#233;e 
</p>
<p>1.1 Degr&#233;s de syst&#233;maticit&#233; de la s&#233;mantique unifi&#233;e 
</p>
<p>Il est important de noter ici que nous n&#8217;avons pas la pr&#233;tention de supplanter les 
techniques habituelles de RD qui pr&#233;sentent souvent des r&#233;sultats probants (Strzalkowski, 
1999) comme l&#8217;ont montr&#233; par exemple les conf&#233;rences TREC1. L&#8217;accroissement incessant 
des documents potentiellement accessibles aux utilisateurs rend cependant ces techniques 
toujours plus perfectibles et souvent toujours plus exigeantes en ressources et en traitement. Il 
est couramment admis que les outils de TAL (Traitement Automatique des Langues) pour la 
RD requi&#232;rent des connaissances linguistiques massives (Jacquemin, 2000). Pour otre part, 
nous tentons de replacer l&#8217;utilisateur au centre du mod&#232;le en adoptant une approche 
r&#233;solument anthropocentr&#233;e : &#171; (dans un syst&#232;me anthropocentr&#233;) &#8230;ce n&#8217;est pas l&#8217;homme qui 
essaie d&#8217;entrer dans un monde informatique quasi-autosuffisant, mais la machine qui se 
construit autour des besoins pr&#233;cis de l&#8217;homme pour mieux l&#8217;assister. &#187; (Thlivit , 1998). 
Nous imaginons ainsi les machines comme des m&#233;moires externes individuelles (L&#233;vy, 1990) 
pouvant, gr&#226;ce &#224; des techniques de TAL, filtrer les r&#233;sultats de syst&#232;mes plus g&#233;n&#233;raux en 
fonction des seules ressources fournies par l&#8217;utilisateur dans le cadre d&#8217;une t&#226;che donn&#233;e.  
</p>
<p> 
</p>
<p>Figure 1 : Utilisation d&#8217;une m&#233;moire s&#233;mantique pour la RD 
</p>
<p>Certains syst&#232;mes pr&#233;conisent l&#8217;utilisation d&#8217;ontologies (Pretschner et al., 1999) ou de 
th&#233;saurus (Yang et al., 1998) pour l&#8217;am&#233;lioration de l&#8217;indexation ou de la recherche des 
documents. Nous nous distinguons de ces techniques essentiellement sur la place donn&#233;e &#224; 
l&#8217;utilisateur pour exprimer ses besoins et s&#8217;impliquer dans le processus de recherche. Dans 
(Rastier et al., 1994), on d&#233;crit les degr&#233;s de syst&#233;maticit&#233; de la s&#233;mantique unifi&#233;e comme 
&#233;tant : le syst&#232;me fonctionnel de la langue (les normes de la langue), les normes sociales 
(consid&#233;rations essentiellement culturelles) et les normes idiolectales (l&#8217;ensemble des 
r&#233;gularit&#233;s personnelles dans les actes linguistiques). Notre approche anthropocentr&#233;e trouve 
une part de sa justification dans cette remarque. Nous pensons que la RD a de nombreux 
points communs avec une activit&#233; linguistique et que les crit&#232;res &#233;nonc&#233;s par Rastier doivent 
donc &#234;tre pris en compte dans le mod&#232;le que nous proposons.  
</p>
<p> 
</p>
<p>                                                
1 Text Retrieval Conference &#8211; http://trec.nist.gov </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La recherche documentaire : un  activit&#233; langagi&#232;re 
</p>
<p>Dans notre syst&#232;me, l&#8217;ensemble des descriptions s&#233;mantiques n&#233;cessaires &#224; la t&#226;che 
(Figure 1) est cr&#233;&#233; par l&#8217;utilisateur gr&#226;ce &#224; un logiciel2. Ces d scriptions en terme d&#8217;opposition 
(1.2) proviennent de l&#8217;exp&#233;rience de l&#8217;utilisateur dans son domaine d&#8217;int&#233;r&#234;t ou de son 
utilisation d&#8217;une aide bas&#233;e sur une &#233;tude de corpus (3.1). Des travaux communs entre les 
universit&#233;s de Caen et du Mans sont en cours pour permettre la construction semi-
automatique de ces relations &#224; partir d&#8217;un syst&#232;me de dialogue Homme/Machine.  
</p>
<p> 
Dans notre mod&#232;le de la m&#233;moire s&#233;mantique, l&#8217;utilisateur imprime donc ses normes 
</p>
<p>dialectales : il choisit la langue qu&#8217;il d&#233;sire voir utilis&#233;e dans les documents qu&#8217;il recherche, il 
restreint le sens de certains mots polys&#233;miques&#8230; Ce qui rel&#232;ve des normes idiolectales est 
implicite au mod&#232;le, car les relations s&#233;mantiques sont construites par un utilisateur pour un 
sujet de recherche donn&#233;. Les normes sociolectales font appel &#224; une activit&#233; particuli&#232;re de la 
part de l&#8217;utilisateur. Dans le cadre de la RD, celui-ci se trouve en effet dans une situation 
dialogique dont il est le seul acteur: il doit prendre en compte pour son objectif, un auteur 
qu&#8217;il ne conna&#238;t pas a priori (&#224; travers des documents dont il ne conna&#238;t pas a priori 
l&#8217;existence) mais avec qui il partage un centre d&#8217;int&#233;r&#234;t : le sujet de sa recherche. L&#8217;individu 
construisant des relations s&#233;mantiques doit tenir compte d&#8217;une utilisation possible de la langue 
par un auteur. Cette remarque rel&#232;ve de la d&#233;finition de la langue en tant que ph&#233;nom&#232;ne 
social (et donc partag&#233;). Lorsqu&#8217;on utilise des ontologies ou des th&#233;saurus pr&#233;-d&#233;finis, les 
normes idiolectales et sociolectales sont d&#233;laiss&#233;es: l&#8217;ut li ateur doit s&#8217;adapter aux d&#233;finitions 
pr&#233;existantes quelle que soit sa recherche et quel que soit son profil. Certaines m&#233;thodes de 
construction des ontologies tendent &#224; rendre plus importante la place de l&#8217;utilisateur &#224; travers 
l&#8217;analyse de son comportement ou la construction de plusieurs ontologies compar&#233;es lors 
d&#8217;une recherche (une ontologie du site construite par un agent, une ontologie personnelle de 
l&#8217;utilisateur) (Obiwan, 2000) (Chaffee, 2000). Nous verrons dans la suite de l&#8217;article en quoi 
nos propositions sont diff&#233;rentes. 
</p>
<p>1.2 Un mod&#232;le dynamique de la m&#233;moire individuelle 
</p>
<p>Notre mod&#232;le de la m&#233;moire s&#233;mantique des individus (appel&#233; ANADIA - (Coursil, 
2000)) trouve ses fondements dans l&#8217;observation des interactions sociales. Ce mod&#232;le est un 
analogue de la m&#233;moire humaine car il ne repose pas sur des consid&#233;rations biologiques mais 
s&#8217;inspire d&#8217;observations sur le fonctionnement humain et est adapt&#233; aux comp&#233;tences des 
machines (Auroux, 1998). Nous pensons que la m&#233;moire est une organisation des diff&#233;rences 
per&#231;ues dans l&#8217;interaction avec le monde et les autres (Tyv ert, 2000). Cette hypoth&#232;se a &#233;t&#233; 
renforc&#233;e par l&#8217;&#233;tude d&#8217;un corpus de dialogues &#8211; Projet PIC3 -  (Beust, 1998) qui a &#233;tabli que 
pour &#171; montrer les choses dont on veut parler, pour &#233;tablir leur v leur s&#233;miotique, on les 
d&#233;crit juste assez pour les diff&#233;rencier des choses avec lesquelles elles pourraient &#234;tre 
confondues dans la situation &#187; . Notre mod&#232;le se base ainsi sur l&#8217;observation de la 
construction d&#8217;un terrain commun dans un dialogue. C&#8217;est en fait, une organisation de choses 
diff&#233;renci&#233;es entre elles, trouvant leur place &#224; l&#8217;int&#233;rieur d&#8217;un dispositif de cat&#233;gorisation. Il 
est fond&#233; sur un principe de discrimination et non de description ensembliste en d&#233;finissant 
des types sous lesquels tombent ou non des objets du monde connu sans partir des chose
</p>
<p>                                                
2 Anadia, logiciel libre disponible &#224; l&#8217;adresse http://www.info.unicaen.fr/~perlerin/recherche/anadia_prog.htm 
</p>
<p>3 Le projet PIC propose une &#233;tude exp&#233;rimentale et une mod&#233;lisation des processus cognitifs et sociaux de 
conception distribu&#233;e &#224; travers les traces qu'ils laissent dans les dialogues. Pour plus d&#8217;informations c.f. 
http://www.info.unicaen.fr/~fgerard/pic/pic.html </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Perlerin 
</p>
<p>existantes pour les classer. Ainsi, ce mod&#232;le de repr&#233;sentation de la m&#233;moire n&#8217;est pas un 
syst&#232;me de repr&#233;sentations de connaissances au m&#234;me titre que les ontologies car les choses 
repr&#233;sent&#233;es ne sont pas pr&#233;suppos&#233;es connues et la repr&#233;sentation qui en est faite n&#8217;est ni 
compl&#232;te ni intrins&#232;que. ANADIA a fait l&#8217;objet en 2001 d&#8217;un article d&#8217;une quarantaine de 
pages (Nicolle et al., 2001). Nous y renvoyons le lecteur d&#233;sireux d&#8217;en conna&#238;tre les 
fondements informatiques, linguistiques et cognitifs. 
</p>
<p> 
Pour cat&#233;goriser les choses, on d&#233;finit un d spositif de discrimination (Figure 2). Au 
</p>
<p>premier stade de sa construction, nous trouvons les attributs i. . des propri&#233;t&#233;s que l&#8217;on peut 
ou non attribuer aux choses (ex : type mat&#233;riel ou logiciel pour diff&#233;rencier les //mat&#233;riaux de 
l&#8217;informatique//). Le regroupement d&#8217;a tributs pertinents pour un genre &#224; partitionner dans un 
certain contexte s&#8217;appelle registre (ex : mat&#233;riaux de l&#8217;informatique regroupe les attributs type 
et r&#244;le dans la table &#233;ponyme). Les tables r&#233;sultent de la combinatoire des places obtenues par 
croisement des valeurs des attributs d&#8217;un registre, elles sont un moyen de distinguer des 
cat&#233;gories dans un m&#234;me genre. La s&#233;l ction d&#8217;une table donn&#233;e est l&#8217; nsemble des places de 
cette table reconnues comme valides par l&#8217;auteur du dispositif qui a pu les nommer ou en 
donner des exemples. A certains niveaux de cat&#233;gorisation, des ph&#233;nom&#232;nes de synonymie 
locale peuvent intervenir comme dans la table //p&#233;riph&#233;riques// o&#249; la ligne mode 
d&#8217;utilisation :sortie et type de m&#233;dium :image et texte correspond &#224; la fois &#224; &#233;cran et 
imprimante. Finalement, les topiques (Figure 3) sont les graphes indiquant la proximit&#233; 
s&#233;mantique entre les places s&#233;lectionn&#233;es d&#8217;une table. Elles permettent dans le logiciel Anadia 
</p>
<p>(Nicolle et al., 2001) de pr&#233;senter des points de vue dont l&#8217;utilisateur n&#8217;a pas n&#233;cessairement 
conscience en montrant les diff&#233;rences retenues pour les discriminations. 
</p>
<p> 
</p>
<p> 
Figure 2 : Extrait d&#8217;un dispositif ANADIA en rapport avec l&#8217;Informatique 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 3 : Topique &#224; 1 diff&#233;rence pr&#232;s de la table //mat&#233;riaux de l&#8217;informatique// </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La recherche documentaire : un  activit&#233; langagi&#232;re 
</p>
<p>Dans le cadre de la RD, nous ne souhaitons pas utili er des ressources cens&#233;es repr&#233;senter 
le monde (comme les ontologies) mais des donn&#233;es repr&#233;sentant la fa&#231;on dont on en parle. 
L&#8217;utilisation d&#8217;ANADIA est appropri&#233;e &#224; cet objectif: utilis&#233; dans le cadre d&#8217;une s&#233;mantique 
componentielle dans une approche diff&#233;rentielle (2.1) et coupl&#233; avec le principe d&#8217;isotopie 
(2.3), il permet d&#8217;amorcer une comp&#233;tence interpr&#233;tative pour les machines, utile pour une 
t&#226;che de RD. 
</p>
<p>2 Vers une s&#233;mantique des textes. 
</p>
<p>Les effets de sens sont la seule manifestation des significations : la signification d&#8217;un mot 
d&#233;pend de sa contextualisation. Le calcul du sens dans cette contextualisation s&#8217;articule autour 
de deux axes : l&#8217;axe paradigmatique qui consiste &#224; repr&#233;senter les significations du point de 
vue de leur implication da s l&#8217;initiation ou dans le renforcement des effets de sens et l&#8217;axe 
syntagmatique qui doit mettre en &#233;vidence l&#8217;&#233;mergence d&#8217;effets de sens au sein des &#233;nonc&#233;s 
(ce fait a &#233;t&#233; exprim&#233; depuis de nombreuses ann&#233;es par Saussure, Hjelmslev ou encore 
Jakobson (Mel&#8217;cuk, 1998)). 
</p>
<p>2.1 Dimension structurelle : axe paradigmatique 
</p>
<p>ANADIA peut &#234;tre utilis&#233; comme mod&#232;le s&#233;mantique de l&#8217;axe paradigmatique i.e. 
comme un mod&#232;le de s&#233;mantique lexicale. La repr&#233;sentation du sens rel&#232;ve alors d&#8217;une 
s&#233;mantique componentielle diff&#233;rent elle. En s&#233;mantique componentielle (Greimas, 1966) 
(Pottier, 1964), les significations correspondent &#224; des combinaisons de s&#232;me u traits 
s&#233;mantiques (ex: BLEU 1. qualificatif, couleur&#8230; 2. qualificatif, &#234;tre humain, novice&#8230;). Ici, 
la notion de s&#232;me est red&#233;finie comme &#233;tant un couple &lt;domaine d&#8217;interpr&#233;tation, jeu 
d&#8217;oppositions&gt;. Les s&#232;mes sont alors les &#171; clefs des significations dans les relations qu&#8217;elles 
entretiennent entre elles plut&#244;t que dans les relations que chacune d&#8217;entre elles, consid&#233;r&#233;e 
isol&#233;ment, entretient avec le monde &#187; (Nyckees, 1998).   
</p>
<p> 
Par exemple (Figure 2) :  
</p>
<p>Domaine d&#8217;interpr&#233;tation   :  mat&#233;riaux de l&#8217;informatique 
Oppositions    : mat&#233;riel vs. ressources 
</p>
<p> 
Dans cette utilisation d&#8217;ANADIA, le domaine d&#8217;interpr&#233;tation d&#8217;un s&#232;me est repr&#233;sent&#233; 
</p>
<p>par la propri&#233;t&#233; d&#8217;un attribut et les traits qui constituent les oppositions forment les valeurs d  
l&#8217;attribut. Les s&#232;mes ne repr&#233;sentent ainsi plus un outillage descriptif de la langue. Ils sont 
rendus op&#233;rationnels au regard d&#8217;un syst&#232;me de repr&#233;sentation pour une machine par le 
renforcement du statut de diff&#233;rence qui leur conf&#232;re une valeur calculable au niveau 
syntagmatique gr&#226;ce au principe d&#8217;isotopie.  
</p>
<p>2.2 Dimension fonctionnelle : axe syntagmatique 
</p>
<p>Depuis les travaux de Greimas, l&#8217;isotopie st d&#233;finie comme la r&#233;currence d&#8217;un m&#234;me 
s&#232;me au sein d&#8217;une entit&#233; textuelle (&#233;nonc&#233;, phrase, paragraphe&#8230;). Le principe d&#8217;isotopie 
permet de d&#233;crire une articulation entre les ordres paradigmatique et syntagmatiquce, &#224; 
tous les niveaux de l&#8217;analyse s&#233;mantique. Avec le mod&#232;le du s&#232;me d&#233;fini ci-dessus, le 
principe d'isotopie s'applique aux oppositions, quelle que soit la valeur marqu&#233;e dans la lexie, 
au lieu de s'appliquer aux valeurs elles-m&#234;m . Au niveau des lexies, les isotopies s&#8217;inscrivent 
dans le choix des contenus retenus comme sens en contexte par aff&#233;rence. Au niveau de la </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Perlerin 
</p>
<p>phrase et au-del&#224;, elles rendent compte des effets de sens co-t xtuels. La Figure 4 montre les 
possibilit&#233;s du mod&#232;le sur deux niveaux touchant &#224; l&#8217;interpr&#233;tation : la lev&#233;e des ambigu&#239; t&#233;s 
s&#233;mantiques et la recherche d&#8217;impressions r&#233;f&#233;rentielles (l&#8217;effet de sens global). Ce sont ces 
deux aspects de la comp&#233;tence interpr&#233;tative qui permettent l&#8217;utilisation de ce mod&#232;le dans le 
cadre de la RD. 
</p>
<p>Figure 4 : Principe d&#8217;Isotopie &#8211; Les s&#232;mes utilis&#233;s correspondent &#224; ceux de la Figure 5.
</p>
<p>Figure 5 : Extrait d&#8217;un dispositif ANADIA en rapport avec l&#8217;Informatique 
</p>
<p>2.2.1 D&#233;sambigu&#239;sation s&#233;mantique 
</p>
<p>La Figure 4 pr&#233;sentent deux isotopies parall&#232;les (diff&#233;rentes formes d&#8217;isotopies 
peuvent &#234;tre rep&#233;r&#233;es (Beust p127-129, 1998)). La d&#233;sambigu&#239; sation s&#233;mantique porte ici sur 
manuel. L&#8217;analyse en terme de s&#232;mes permet, du fait de la pr&#233;sence de r&#233;f&#233;renti l, de ne pas 
retenir d&#8217;autres &#233;ventuelles descriptions s&#233;mantiques de man l pouvant correspondre par 
exemple &#224; l&#8217;adjectif substantiv&#233; : une personne qui travaille avec ses mains. En effet, la 
pr&#233;sence d&#8217;une isotopie faisant intervenir l&#8217;un des sens de manuel explicit&#233; par l&#8217;utilisateur 
permet &#224; notre syst&#232;me de ne pas retenir d&#8217;autres sens (donc d&#8217;autres s&#232;mes). 
</p>
<p> 
 Envisag&#233;e ind&#233;pendamment d&#8217;une t&#226;che pr&#233;cise (comme pour son &#233;valuation dans le 
</p>
<p>projet SENSEVAL (Kilgarriff et al., 1998)), la d&#233;sambigu&#239; sation s&#233;mantique (DS) n&#233;cessite 
de larges bases de donn&#233;es comme des dictionnaires ou des th&#233;saurus. Pour la RD, l&#8217;objectif 
de la recherche circons rit le domaine. Dans notre mod&#232;le, la DS consiste alors, dans le cas o&#249; 
une m&#234;me lexie serait d&#233;crite de fa&#231;on &#224; exprimer plusieurs sens diff&#233;rents, &#224; ne retenir qu&#8217;un 
seul de ces sens en fonction des isotopies d&#233;couvertes. Il ne s&#8217;agit pas d&#8217;aboutir &#224; une lev&#233;e 
exhaustive de tous les cas d&#8217;ambigu&#239; t&#233; s&#233;mantique, mais de ne retenir que les sens d&#233;crits par 
l&#8217;utilisateur et retenus par lui dans le cadre d&#8217;une recherche donn&#233;e pour d&#233;cider de la 
pertinence d&#8217;un document. Les ressources utiles &#224; cette t&#226;che son  donc r&#233;duites &#224; celles 
fournies par l&#8217;utilisateur.  
</p>
<p>2.2.2 Recherche d&#8217;impressions r&#233;f&#233;rentielles 
</p>
<p>Les isotopies relev&#233;es dans la Figure 4 permettent &#233;galement la d&#233;couverte des effets 
de sens au sein de l&#8217;&#233;nonc&#233; analys&#233;. Au vu des s&#232;mes mis en jeu dans les isotopies rep&#233;r&#233;es, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La recherche documentaire : un  activit&#233; langagi&#232;re 
</p>
<p>un module d&#8217;analyse peut conclure que l&#8217;on parle ici de //Documentation// et sur l&#8217;ensemble 
de la conversation, de //Documentation//, d&#8217;//Informatique// et de //Logiciels//. Pour les textes, 
l&#8217;analyse &#224; l&#8217;&#233;chelle de la phrase, du paragraphe, du document ou d&#8217;un ensemble de 
documents permet la d&#233;couverte de faisceauxd&#8217;isotopies. C&#8217;est en fonction de la pr&#233;sence et 
de la couverture de ces faisceaux que la pertinence d&#8217;un document par rapport aux attentes de 
l&#8217;utilisateur est d&#233;cid&#233;e. L&#8217;impression r&#233;f&#233;rentielle calcul&#233;e &#224; partir des isotopies d&#233;couvertes 
au sein des documents est donc au c&#339;ur du filtrage propos&#233;. La machine met ainsi en place 
une interpr&#233;tation s&#233;lective et supervis&#233;e car l&#8217;utilisateu a toujours la possibilit&#233; de modifier 
son dispositif pour affiner l&#8217;analyse s&#233;mantique et param&#233;trer au mieux l&#8217;outil logiciel par 
rapport &#224; ses exigences.  
</p>
<p>3 R&#233;alisations 
</p>
<p>3.1 Etude de corpus &#8211; Aide &#224; la cr&#233;ation des tables 
</p>
<p>Pour r&#233;aliser des logiciels rendant effectives nos propositions, nous avons d&#233;but&#233; nos 
travaux par l&#8217;&#233;tude d&#8217;un corpus homog&#232;ne de 1783 d&#233;p&#234;ches journalistiques de l&#8217;agence 
Reuter&#8482; traitant du monde de la finance (Perlerin, 2000). L&#8217;&#233;tude a tout d&#8217;abord port&#233; sur la 
recherche de mots r&#233;v&#233;lateurs du domaine gr&#226;ce &#224; la loi de Zipf dont l&#8217;application au mat&#233;riau 
linguistique a montr&#233; que la liste des mots d&#8217;un corpus de textes class&#233;s par ordre d&#233;croissants 
d&#8217;occurrence pr&#233;sente tout d&#8217;abord les mots grammaticaux, les mots du domaine puis les mots 
non significatifs du corpus. Les mots retenus ont ensuite fait l&#8217;objet d&#8217;un calcul de co-
occurrence au sein des textes (Figure 6).  
</p>
<p> 
</p>
<p>Figure 6 : Table n&#176;1 des co-occurrences des lexies retenues apr&#232;s &#233;tude du corpus. Le tableau 
se lit : &#171; Dans 77% des fichiers o&#249; soci&#233;t&#233; appara&#238;t, banque st pr&#233;sent &#233;galement. &#187; 
</p>
<p> Ce type de table a permis la mise en place d&#8217;une aide &#224; la cr&#233;ation des tables de 
cat&#233;gorisation. Par exemple, si un utilisateur a partiellement pu nommer les lignes d&#8217;une table 
avec les lexies soci&#233;t&#233;, entreprise t &#233;tablissement. L&#8217;aide lui fournie la liste des lexies 
pr&#233;sentant les plus fortes co-occurrences avec celles d&#233;j&#224; pr&#233;sentes dans la table. En 
l&#8217;occurrence : agence, r&#233;seau, compagnie, banque, groupe&#8230; N s xp&#233;riences it&#233;r&#233;es sur 
l&#8217;ensemble des tables construites par nos soins &#224; partir des mots du domaine ont montr&#233; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Perlerin 
</p>
<p>(Perlerin, 2000) qu&#8217;en supprimant une ligne d&#233;j&#224; nomm&#233;e, le mot initialement pr&#233;sent se 
trouvait &#224; chaque fois au moins dans les 10 premi&#232;res occurrences de la liste propos&#233;e par 
l&#8217;aide. Nous poursuivons actuellement des travaux dans ce sens. 
</p>
<p>3.1.1 Selana : un logiciel de filtrage &#224; base de dispositif de cat&#233;gorisation s&#233;mantique 
</p>
<p>Pour tester nos techniques de filtrage et les &#233;valuer par rapport aux techniques les plus 
basiques faisant appel au pattern matching, nous avons cr&#233;&#233; deux logiciels. Le premier, appel&#233;
ReDoClef, permet l&#8217;interrogation d&#8217;une base de documents (en local) &#224; partir d&#8217;une requ&#234;te de 
type bool&#233;en. Le crit&#232;re de base du positionnement d&#8217;un document retenu dans la liste des 
r&#233;sultats est le nombre d&#8217;occurrences des mots ou expressions de la requ&#234;te dans ce dernier.  
</p>
<p> 
Le second logiciel, appel&#233; S ana, permet l&#8217;exploration d&#8217;une base documentaire en 
</p>
<p>fonction d&#8217;un dispositif de cat&#233;gorisation s&#233;mantique pr&#233;alablement construit (du type de la 
(Figure 2)). Les dispositifs utilis&#233;s pour nos exp&#233;riences ont &#233;t&#233; cr&#233;es suite &#224; l&#8217;&#233;tude de corpus 
d&#233;crite ci-dessus. Bien que dans sa version actuelle, le logiciel ne propose pas toutes les 
fonctionnalit&#233;s que nous souhaitons lui adjoindre (prise en compte du degr&#233; de r co vr ment 
des isotopies &#224; l&#8217;int&#233;rieur des textes&#8230;), nous avons souhait&#233; effectuer une premi&#232;re 
&#233;valuation permettant la mise au jour des atouts probants de l&#8217;utilisation de notre mod&#232;le 
dynamique de la m&#233;moire s&#233;mantique de l&#8217;utilisateur dans le cadre e la RD. Pour cela, nous 
avons s&#233;lectionn&#233; une dizaine de documents dans notre corpus et des corpus traitants de sujets 
diff&#233;rents. Ne souhaitant pas biaiser nos r&#233;sultats au vu de l&#8217;&#233;tat actuel de nos programmes, 
nous n&#8217;avons pas mis en oeuvre un protocole exp&#233;rimental pouss&#233; du type calcul de r ppel et 
pr&#233;cision sur un corpus valid&#233; par des experts de type TREC. Les textes s&#233;lectionn&#233;s ont &#233;t&#233; 
not&#233;s de 0 &#224; 2 pour d&#233;cider de leur validit&#233; par rapport &#224; une requ&#234;te traitant du 
d&#233;veloppement de l&#8217;actionnariat. ReDoClef a &#233;t&#233; ainsi soumis &#224; la requ&#234;te &#171; d&#233;v loppement 
de l&#8217;actionnariat &#187; tandis que Selana &#233;tait dirig&#233; dans ses recherches par la s&#233;lection de 3 
tables en rapport avec le sujet : la table //actions financi&#232;res// qui regroupe les lexies 
&#8216;actionnariat&#8217;, &#8216;pr&#233;sidence&#8217; et &#8216;salariat&#8217;, //acteurs financiers// contenant les lexies 
&#8216;actionnaire&#8217;, &#8216;pr&#233;sident&#8217;, &#8216;salari&#233;&#8217; et &#8216;petit porteur&#8217; ainsi que //&#233;tablissements financiers// 
contenant les lexies &#8216;soci&#233;t&#233;&#8217;, &#8216;entreprise&#8217;, &#8216;compagnie&#8217; et &#8216;&#233;tablissement&#8217;.  
</p>
<p>Figure 7 : R&#233;sultats de la premi&#232;re exp&#233;rimentation de nos propositions.
</p>
<p>La Figure 7 pr&#233;sente les r&#233;sultats obtenus par cette exp&#233;rimentation (d&#233;taill&#233;e dans 
(Perlerin, 2000)). Les courbes expos&#233;es pr&#234;tent un int&#233;r&#234;t l&#233;g&#232;rement sup&#233;rieur &#224; Selana 
essentiellement parce que le nombre de lexies prises en compte lors de la recherche est plus 
important dans ce logiciel du fait de l&#8217;utilisation du dispositif de cat&#233;gorisation. Une version 
plus complexe de Selana est en cours de r&#233;alisation. 
</p>
<p> 
L&#8217;utilisation d&#8217;une s&#233;mantique textuelle permet d&#8217;apporter une valeur ajout&#233;e 
</p>
<p>cons&#233;quente &#224; la RD ou &#224; la veille technologique, en particulier quant &#224; l&#8217;exposition des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La recherche documentaire : un  activit&#233; langagi&#232;re 
</p>
<p>r&#233;sultats d&#8217;une recherche. Il en effet est courant dans les syst&#232;mes classiques de donner une 
place meilleure dans la liste des r&#233;sultats &#224; un document pr&#233;sentant un nombre important 
d&#8217;occurrences des mots de la requ&#234;te. L&#8217;analyse des isotopies coupl&#233;e &#224; la prise en compte de 
la morphologie des txtes permet de classer de fa&#231;on originale des  textes ne pr&#233;sentant 
aucune diff&#233;rence en terme de nombre d&#8217;occurrences d&#8217;un mot de la requ&#234;te :  
</p>
<p>Figure 8 : Faisceaux d&#8217;isotopie et repr&#233;sentation en TileBars. 
</p>
<p>Dans la Figure 8, le faisceau d&#8217;isotopies du Doc. A ne couvre essentiellement que le 
premier paragraphe. Dans le Doc. B, le recouvrement par le faisceau d&#8217;isotopies est plus 
important mais chaque paragraphe pris ind&#233;pendamment pr&#233;sente moins d&#8217;isotopies que le 
premier paragraphe du Doc. A. Deux solutions sont alors envisageables pour tenir compte de 
ce ph&#233;nom&#232;ne. Soit l&#8217;utilisateur privil&#233;gie l&#8217;un des crit&#232;res suivant : le taux de recouvrement 
des isotopies, le nombre d&#8217;isotopies (&#8230;), soit on lui pr&#233;sente les r&#233;sultats du filtrage 
personnalis&#233; &#224; l&#8217;aide d&#8217;objets graphiques de type Tilebars (Hearst, 1995) pour lui permettre de 
visualiser la distribution des paragraphes pertinents par rapport &#224; ses attentes. Dans notre 
exemple, la densit&#233; des traits obliques dans chaque TileBarest proportionnelle au nombre 
d&#8217;isotopies rep&#233;r&#233;es dans le paragraphe correspondant.  
</p>
<p>4 Conclusion 
</p>
<p>Nos travaux se placent dans un nouveau courant de l&#8217;informatique qui pr&#233;conise une 
meilleure prise en compte des utilisate rs &#224; tous les niveaux de la conception des mod&#232;les 
calculatoires. L&#8217;approche anthropocentr&#233;e permet de limiter les ressources pour des t&#226;ches 
jusque l&#224; consid&#233;r&#233;es comme n&#233;cessairement avides des donn&#233;es toujours plus exhaustives : 
ici, les donn&#233;es n&#233;cessaires sont limit&#233;es &#224; celles jug&#233;es utiles par l&#8217;utilisateur en fonction des 
r&#233;sultats obtenus du logiciel. Les rapports entre TAL et RD sont complexes (Jacquemin, 
2000) : les syst&#232;mes tombent souvent dans l&#8217;&#233;cueil de performances faibles pour un co&#251;t 
calculatoire &#233;lev&#233;. Par nos propositions, nous tentons de fournir &#224; la machine une capacit&#233; 
interpr&#233;tative n&#8217;allant pas au-del&#224; des attentes de l&#8217;utilisateur et d&#233;termin&#233;e par la t&#226;che &#224; 
r&#233;aliser.  
</p>
<p>Remerciements 
</p>
<p>L&#8217;auteur remercie Anne Nicolle et Pierre Beust pour leur soutien et leur aide pr&#233;cieuse pour 
les travaux expos&#233;s, et Thomas Lebarb&#233; pour l&#8217;encouragement &#224; la r&#233;daction de cet article.  
</p>
<p>R&#233;f&#233;rences  
</p>
<p>Auroux S. (1998), La raison, le langage, et les normes, Paris, PUF, 1998. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vincent Perlerin 
</p>
<p>Beust P. (1998), Contribution &#224; un mod&#232;le interactionniste du sens, Th&#232;se de doctorat 
d&#8217;informatique de l&#8217;universit&#233; de Caen. 
 
Chaffee J.(2000), Personal Ontologies for Web Navigation, Th&#232;se d&#8217;informatique de 
l&#8217;Universit&#233; du Kansas. 
 
Coursil J. (2000), La fonction muette du langage, Petit-Bourg, Ibis Rouge &#201;ditions, 2000. 
 
Greimas A.J. (1966), S&#233;mantique Structurale, Paris, Larousse. 
 
Kilgarriff A., Palmer M. (2000), Special issue on SENSEVAL : Evaluating word sense 
disambiguation programs, Computer and the Humanities.  
 
L&#233;vy P. (1990), Les Technologies de l&#8217;Intelligence, Paris, Editions La D&#233;couverte. 
 
Mel&#8217;cuk I. (1998), Vers une linguistique Sens-T xte, Chaire du Coll&#232;ge de France. 
 
Nicolle A., Beust P., Perlerin V. (2001), Un analogue de la m&#233;moire pour un agent interactif  
</p>
<p>(en cours de publication - http://www.info.unicaen.fr/~perlerin). 
 
Nyckees V. (1998), La S&#233;mantique, Paris, Belin, 1998. 
 
Obiwan (2000), Ontology Based Informing Web Agent Navigation, projet du National 
Science Foundation CARREER, Cooperative Agents for Conceptual Search and Browsing of 
World Wide Web resources, www.ittc.ukans.edu/obiwan/index.html. 
 
Perlerin V. (2000), S&#233;mantique lexicale pour la RD, Stage de DEA de l&#8217;universit&#233; de Caen 
(http://www.info.unicaen.fr/~perlerin). 
 
Pottier B. (1973), sous la direction de Pottier B., Le langage, Les encyclop&#233;dies du savoir 
moderne, Paris, Retz. 
 
Pretschner A., Gauch S. (1999), Ontology Based Personalized Search, Actes de Proc. 11th 
IEEE Intl. Conf. on Tools with Artificial Intelligence, pp. 391-398. 
 
Rastier F., Cavazza M., Abeill&#233; A. (1994), S&#233;mantique pour l'Analyse, Paris, Masson. 
 
Strzalkowski T. (1999), Natural Language Information Retrieval, Boston, MA, Kulwer. 
 
Jacquemin C. (2000), Pr&#233;sentation, T.A.L. Vol. 41, pp.327-332. 
 
Thlivitis T. (1998), S&#233;mantique interpr&#233;tative Intertextuelle : assistance anthropocentr&#233;e &#224; la 
compr&#233;hension des textes, Th&#232; e d&#8217;informatique de l&#8217;Universit&#233; de Rennes I. 
 
Tyvaert J.E. (2000), R&#233;flexions &#233;pist&#233;mologiques et programmatiques sur la place des langues 
dans la cognition humaine, InCognito, Vol. 18, pp.1- 0. 
 
Yang M.C., Wood W.H., Cutkosky M.R. (1998), Data Mining for Thesaurus Generation in 
Informal Design Informal Design Information Retrieval, Standford, Standford University. </p>

</div></div>
</body></html>