<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>LoX : outil polyvalent pour l'exploration de corpus annot&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2001, Tours, 2-5 juillet 2001 
</p>
<p>LoX1 : outil polyvalent pour l'exploration de corpus annot&#233;s 
</p>
<p>Laurent AUDIBERT 
</p>
<p>DELIC &#8211; Universit&#233; de Provence 
29 Avenue Robert SCHUMAN 
</p>
<p>13621 Aix-en-Provence Cedex 1 
laurent.audibert@up.univ-aix.fr  
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Cet article pr&#233;sente une application permettant d'&#233;crire des requ&#234;tes complexes sur des corpus 
&#233;tiquet&#233;s et de formater librement les r&#233;sultats de ces requ&#234;tes. Le formalisme des requ&#234;tes est 
bas&#233; sur le principe des expressions r&#233;guli&#232;res bien connu de la plupart des linguistes 
travaillant sur des corpus &#233;crits. Contrairement &#224; certains logiciels, qui ne permettent que 
l&#8217;extraction de concordances au format relativement fig&#233;, le formatage libre du r&#233;sultat des 
requ&#234;tes permet leur r&#233;utilisation par des programmes ult&#233;rieurs et autorise une grande 
diversit&#233; d'applications, s'&#233;cartant largement du cadre des simples concordanciers. 
</p>
<p>This paper describes a tool that enables complex queries on tagged corpora, and free 
formatting of the results. The formalism used is based on regular expressions, which are well-
known from most corpus linguists. As opposed to other software, the free formatting of the 
results enables re-use of the query results by additional tools, and proves useful for a wide 
range of applications well beyond that of simple concordance programs. 
</p>
<p>Mots cl&#233;s &#8211; Keywords 
</p>
<p>Corpus, Concordancier, TAL, Parser, Expression r&#233;guli&#232;re. 
</p>
<p>Corpora, Concordancer, NLP, Parser, Regular expression. 
</p>
<p>1 Introduction 
</p>
<p>Il existe maintenant des applications permettant d'&#233;tiqueter de mani&#232;re efficace des corpus 
&#233;crits (par exemple, le logiciel Cordial, d&#233;velopp&#233; par la soci&#233;t&#233; Synapse D&#233;veloppement,2 
</p>
<p>                                                 
1  LoX est disponible sur la page Web http://laurent.audibert.free.fr/lox.htm 
</p>
<p>2 Voir le site Web http://www.synapse-fr.com/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. AUDIBERT 
</p>
<p>offre une lemmatisation et un &#233;tiquetage morpho-syntaxique relativement fiable). Il est alors 
plus pertinent pour les utilisateurs (linguistes, lexicographes, terminologues, etc.), d'interroger 
un corpus en &#233;crivant des requ&#234;tes ne portant plus uniquement sur des mots mais aussi sur des 
lemmes ou des &#233;tiquettes morpho-syntaxiques. 
</p>
<p>Les linguistes travaillant sur des corpus &#233;crits sont g&#233;n&#233;ralement familiers avec le formalisme 
des expressions r&#233;guli&#232;res. Ces expressions se situent au niveau des caract&#232;res et permettent 
de d&#233;crire de mani&#232;re formelle des classes de cha&#238;nes de caract&#232;res. Le langage de requ&#234;te que 
nous pr&#233;sentons ici est bas&#233; sur des m&#233;ta-expressions r&#233;guli&#232;res. Ces expressions se situent au 
niveau des mots et permettent de d&#233;crire de mani&#232;re formelle des classes de suites de mots, 
donc des portions de texte. Ainsi, ce langage de requ&#234;te ne devrait pas d&#233;router le linguiste. 
</p>
<p>Le but premier d'un langage de requ&#234;te est de diminuer de mani&#232;re significative la quantit&#233; 
d'information &#224; traiter manuellement. Mais il peut aussi s'av&#233;rer int&#233;ressant d'effectuer des 
d&#233;nombrements ou encore de g&#233;n&#233;rer des r&#233;sultats adapt&#233;s &#224; des besoins particuliers. Aussi, 
au contraire de langages pr&#233;c&#233;demment propos&#233;s, par exemple par (Christ, 1994), le langage 
de requ&#234;te que nous proposons contient un micro-langage de formatage du r&#233;sultat qui permet 
de pr&#233;ciser librement la forme que prendra le r&#233;sultat des requ&#234;tes. 
</p>
<p>2 Types de corpus 
</p>
<p>L'application LoX reconna&#238;t actuellement deux types de corpus : les corpus de type texte brut 
et les corpus &#233;tiquet&#233;s de format tabulaire3. 
</p>
<p>2.1 Corpus de type texte brut 
</p>
<p>Un corpus de type texte brut est un corpus au format texte contenant le texte d&#233;pourvu de mise 
en forme typographique, et sans aucun ajout d'&#233;tiquette ou d'annotation. Voici un exemple de 
texte brut :  
La construction de centaines de digues et barrages entra&#238;nera le d&#233;tournement de plusieurs fleuves, la
disparition de plus de mille lacs naturels et l'abattage d'arbres centenaires.
</p>
<p>La segmentation en &#171; mots &#187; se fait suivant le principe de la segmentation maximale, 
respectant ainsi les principes &#233;dict&#233;s par le projet GRACE (Adda, Mariani, Paroubek, Rajman, 
&amp; Lecomte, 1999) (i.e. les ponctuations, l'apostrophe, etc. sont des mots distincts). 
</p>
<p>2.2 Corpus tabulaire 
</p>
<p>Ces corpus sont de forme tabulaire et au format texte. Chaque ligne correspondra &#224; un &#233;l&#233;ment 
(i.e. un mot) tandis que chaque colonne correspondra &#224; une propri&#233;t&#233; de l'&#233;l&#233;ment, c&#8217;est-&#224;-dire 
un &#233;tiquetage particulier (cat&#233;gorie morpho-syntaxique, lemmatisation,  ou autre). La fin d'une 
</p>
<p>                                                 
3  D&#8217;autres formats sont envisageables et peuvent &#234;tre facilement ajout&#233;s (gr&#226;ce aux m&#233;canismes d'abstraction 
</p>
<p>de la programmation orient&#233;e objet) dans des versions ult&#233;rieures, en particulier, le format SGML ou XML 
propos&#233; par la Text Encoding Initiative (Sperberg-McQueen &amp; Burnard, 1994). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LoX : outil polyvalent pour l'exploration de corpus annot&#233;s 
</p>
<p>ligne est identifi&#233;e par un d&#233;limiteur particulier (retour chariot). De m&#234;me, un autre d&#233;limiteur 
particulier s&#233;pare les colonnes (tabulation). 
</p>
<p>Ci-dessous est repr&#233;sent&#233; un extrait du journal Le Monde &#233;tiquet&#233; par le  logiciel Cordial. 
La ! le ! DETDFS ! Da-fs-d &quot;
construction ! construction ! NCFS ! Ncfs &quot;
de ! de ! PREP ! Sp &quot;
centaines ! centaine ! NCFP ! Ncfp &quot;
de ! de ! PREP ! Sp &quot;
digues ! digue ! NCFP ! Ncfp &quot;
et ! et ! COO ! Cc &quot;
barrages ! barrage ! NCMP ! Ncmp &quot;
entra&#238;nera ! entra&#238;ner ! VINDF3S ! Vmif3s &quot;
le ! le ! DETDMS ! Da-ms-d &quot;
d&#233;tournement ! d&#233;tournement ! NCMS ! Ncms &quot;
de ! de ! PREP ! Sp &quot;
plusieurs ! plusieurs ! ADJIND ! Dt-.p- &quot;
fleuves ! fleuve ! NCMP ! Ncmp &quot;
, ! , ! PCTFAIB ! Ypw &quot;
la ! le ! DETDFS ! Da-fs-d &quot;
</p>
<p>disparition ! disparition ! NCFS ! Ncfs &quot;
de ! de ! PREP ! Sp &quot;
plus ! plus ! ADV ! Rgn &quot;
de ! de ! PREP ! Sp &quot;
mille ! mille ! ADJNUM ! Mc.p &quot;
lacs ! lacs ! NCMIN ! Ncmp &quot;
naturels ! naturel ! ADJMP ! Afpmp &quot;
et ! et ! COO ! Cc &quot;
l ! le ! DETDMS ! Da-ms-d &quot;
' ! // ! // ! // &quot;
abattage ! abattage ! NCMS ! Ncms &quot;
d ! de ! PREP ! Sp &quot;
' ! // ! // ! // &quot;
arbres ! arbre ! NCMP ! Ncmp &quot;
centenaires ! centenaire ! ADJPIG ! Afpmp &quot;
. ! . ! PCTFORTE ! Yps &quot;
</p>
<p>2.3 Nom des propri&#233;t&#233;s 
</p>
<p>Les noms de propri&#233;t&#233;s sont des intitul&#233;s qui permettent de faire r&#233;f&#233;rence &#224; une colonne 
particuli&#232;re pour un mot donn&#233; (i.e. &#224; une propri&#233;t&#233; ou une &#233;tiquette de ce mot) dans une 
requ&#234;te ou dans le micro-langage de formatage du r&#233;sultat (masque). 
</p>
<p>Un fichier de type texte brut est consid&#233;r&#233; comme un fichier ne comportant qu'une colonne 
contenant le texte segment&#233; (un mot par ligne). On fera r&#233;f&#233;rence &#224; un mot avec le mot clef 
&#171; word &#187; (nom de l'unique propri&#233;t&#233; correspondant &#224; l'unique colonne). 
</p>
<p>Pour utiliser un corpus de type tabulaire il faudra nommer chacune des colonnes du fichier. 
Voici les noms de propri&#233;t&#233;s correspondant &#224; l&#8217;exemple pr&#233;c&#233;dent4 : 
mot ! lemme ! typegram ! codespe &quot;
</p>
<p>3 Syntaxe des requ&#234;tes 
</p>
<p>3.1 Requ&#234;te sur les mots isol&#233;s : meta-expression r&#233;guli&#232;re atomique 
</p>
<p>Une m&#233;ta-expression r&#233;guli&#232;re atomique (MERA) est une formule logique, sur les noms de 
propri&#233;t&#233;s, les cha&#238;nes de caract&#232;res et les expressions r&#233;guli&#232;res. Un mot est d&#233;crit par la 
MERA si l'expression logique associ&#233;e est &#171; vrai &#187; pour le mot en question. Un exemple de 
MERA est : [lemme=&quot;entra&#238;ner&quot; &amp; typegram~&quot;^VIND&quot;]. Cette MERA d&#233;crit tous les mots 
dont l'&#233;tiquette &#171; lemme &#187; est &#171; entra&#238;ner &#187; et l'&#233;tiquette &#171; typegram &#187; commence par 
&#171; VIND &#187;. Il s'agit donc d'une recherche du verbe &#171; entra&#238;ner &#187; conjugu&#233; &#224; l'indicatif. 
</p>
<p>[] est une MERA sp&#233;ciale d&#233;crivant n'importe quel mot. En fait [] est &#233;quivalent &#224; [true]. 
</p>
<p>                                                 
4  &#171; Typegram &#187; et &#171; codespe &#187; sont deux &#233;tiquetages morpho-syntaxiques diff&#233;rents produits par le logiciel 
</p>
<p>Cordial. Nous reprenons les d&#233;nominations de ce logiciel. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. AUDIBERT 
</p>
<p>3.2 R&#233;p&#233;titeur de MERA 
</p>
<p>Il est possible d'adjoindre un r&#233;p&#233;titeur pour r&#233;p&#233;ter la MERA un certain nombre de fois. Un 
r&#233;p&#233;titeur est de la forme {x, y}, avec x&#8804;y, o&#249; x est le nombre minimum de fois o&#249; la MERA 
doit &#234;tre r&#233;p&#233;t&#233;e et y le nombre maximum de fois. Ainsi [typegram~&quot;^NC&quot;]{1,3} d&#233;crira une 
suite de un &#224; trois noms communs cons&#233;cutifs. Si dans le corpus se trouvent deux noms 
communs cons&#233;cutifs, cette expression d&#233;crira trois portions : la premi&#232;re correspondant au 
premier nom commun, la seconde correspondant aux deux noms communs et la derni&#232;re 
correspondant au second nom commun. 
</p>
<p>Il existe aussi des r&#233;p&#233;titeurs pr&#233;d&#233;finis : 
&#8226; &#171; * &#187;, pour dire un nombre quelconque de fois, est &#233;quivalent &#224; {0, LONG_MAX5} ; 
&#8226; &#171; + &#187; , pour dire au moins une fois, est &#233;quivalent &#224; {1, LONG_MAX} ; 
&#8226; &#171; ? &#187; , pour dire z&#233;ro ou une fois, est &#233;quivalent &#224; {0, 1}. 
</p>
<p>Un r&#233;p&#233;titeur particulier est aussi disponible, sa forme est {x,y} avec x&gt;y. Ce r&#233;p&#233;titeur (que 
nous nommerons r&#233;p&#233;titeur pr&#233;f&#233;rentiel) peut &#234;tre lu comme : la MERA doit &#234;tre r&#233;p&#233;t&#233;e x 
fois si possible, sinon x-1 fois, sinon x-2 fois, &#8230; mais pas moins de y fois. Par exemple, 
supposons la s&#233;quence de mots &#171; x a b b b y &#187;. Sur cette s&#233;quence, la requ&#234;te [a][b]{1,4} 
retournera trois correspondances {ab, abb, abbb} tandis que la requ&#234;te [a][b]{4, 1} n'en 
retournera qu'une {abbb}. 
</p>
<p>Il est enfin possible de nommer une MERA pour faire r&#233;f&#233;rence ult&#233;rieurement au mot d&#233;crit 
par celle-ci : cible:[lemme= &quot;entra&#238;ner&quot; &amp; typegram~&quot;^VIND&quot;]. Dans cet exemple, on pourra 
ult&#233;rieurement (ie. dans la suite de la requ&#234;te ou dans un masque) faire r&#233;f&#233;rence au verbe 
d&#233;crit par la MERA en utilisant la variable &#171; cible &#187;.  
</p>
<p>L'ensemble constitu&#233; par la MERA, sa variable et son r&#233;p&#233;titeur associ&#233;s sera appel&#233; meta-
expression r&#233;guli&#232;re &#233;l&#233;mentaire (MERE). 
</p>
<p>3.3 Requ&#234;te sur des groupes de mots 
</p>
<p>Une requ&#234;te peut &#234;tre vue comme une expression r&#233;guli&#232;re sur les MERE. Il est donc possible 
de juxtaposer une ou plusieurs MERE pour d&#233;crire des suites de mots mais il est aussi 
possible d'utiliser les parenth&#232;ses &#171; ( &#187; et &#171; ) &#187; un op&#233;rateur de disjonction &#171; | &#187; un op&#233;rateur de 
conjonction &#171; &amp; &#187; ainsi que les r&#233;p&#233;titeurs d&#233;crits dans la section pr&#233;c&#233;dente (section 3.2). 
</p>
<p>De plus, une requ&#234;te peut se terminer par la sp&#233;cification d'une clause stop. Cette clause 
permet de pr&#233;ciser une condition qui interrompt la recherche et rejette la tentative de 
correspondance en cours. 
</p>
<p>Par exemple, la requ&#234;te identifiant les verbes conjugu&#233;s positionn&#233;s avant un verbe &#224; 
l'infinitif, au sein d'une m&#234;me phrase, pourra s'&#233;crire : 
</p>
<p>                                                 
5  LONG_MAX est &#233;gal au plus grand entier que la machine peut repr&#233;senter. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LoX : outil polyvalent pour l'exploration de corpus annot&#233;s 
</p>
<p>[type_gram~&quot;^V&quot; &amp; type_gram!~&quot;^VINF|^VPARP|^VPARPRES&quot;] [type_gram!~&quot;^V&quot;]* 
[type_gram~&quot;^VINF&quot;] stop (type_gram=&quot;PCTFORTE&quot;) 
</p>
<p>o&#249; la premi&#232;re MERA d&#233;signe un verbe qui n'est ni &#224; l'infinitif, ni au participe pr&#233;sent ni au 
participe pass&#233;, la seconde une suite de mots sans verbe, et la derni&#232;re un verbe &#224; l'infinitif. La 
clause stop pr&#233;cise que le r&#233;sultat ne doit pas contenir de ponctuation forte. 
</p>
<p>3.4 Evaluation et optimisation d'une requ&#234;te 
</p>
<p>La requ&#234;te suivante d&#233;crit des n-grammes, avec n&#8804;5, contenant le lemme &#171; chef &#187;, ne 
contenant pas de ponctuation et commen&#231;ant et finissant par un nom commun, un adverbe, un 
verbe ou un adjectif (cf. section 5.3 pour un exemple de r&#233;sultat).  
</p>
<p> ([type_gram~&quot;(^NC|^ADV|^V|^ADJ)&quot;][type_gram!~&quot;^PCT&quot;]{0,3})? 
[lemme=&quot;chef&quot;] 
([type_gram!~&quot;^PCT&quot;]{0,3}[type_gram~&quot;(^NC|^ADV|^V|^ADJ)&quot;])? 
stop((end.index-begin.index)&gt;4) 
</p>
<p>Cette requ&#234;te sera analys&#233;e de gauche &#224; droite. Le corpus sera &#233;galement parcouru de gauche &#224; 
droite. Ainsi, la requ&#234;te va tout d'abord tenter de d&#233;crire une portion du corpus commen&#231;ant 
par le premier mot du corpus, puis par le second, &#8230; La premi&#232;re MERE 
([type_gram~&quot;(^NC|^ADV|^V|^ADJ)&quot;]) de la requ&#234;te sera souvent v&#233;rifi&#233;e car de nombreux 
mots sont un nom commun, un adverbe, un verbe ou un adjectif. La seconde MERE 
([type_gram!~&quot;^PCT&quot;]{0,3}) d&#233;crira g&#233;n&#233;ralement quatre portions de corpus si les trois mots 
suivant le mot d&#233;crit par la premi&#232;re MERE ne sont pas des ponctuations (le cas est &#233;galement 
tr&#232;s fr&#233;quent). Ce n'est que sur la troisi&#232;me MERE de la requ&#234;te ([lemme=&quot;chef&quot;]) que 
l'application de la requ&#234;te va g&#233;n&#233;ralement &#233;chouer (un mot ayant pour lemme chef est un 
ph&#233;nom&#232;ne rare dans un corpus). Ainsi, appliqu&#233;e sur un corpus de taille importante, 
l'&#233;valuation de cette requ&#234;te sera lente. Il serait plus pertinent de rechercher les mots dont le 
lemme est &#171; chef &#187; puis de continuer l'application de la requ&#234;te autour de ces mots. Pour cela, 
il suffit d'encadrer par les d&#233;limiteurs &#171; &lt; &#187; et &#171; &gt; &#187; la partie de la requ&#234;te devant &#234;tre &#233;valu&#233;e 
en premier. La requ&#234;te devient donc : 
</p>
<p>([type_gram~&quot;(^NC|^ADV|^V|^ADJ)&quot;][type_gram!~&quot;^PCT&quot;]{0,3})? 
&lt;[lemme=&quot;chef&quot;]&gt; 
([type_gram!~&quot;^PCT&quot;]{0,3}[type_gram~&quot;(^NC|^ADV|^V|^ADJ)&quot;])? 
stop((end.index-begin.index)&gt;4) 
</p>
<p>Dans une telle requ&#234;te, la partie entre &#171; &lt;&gt; &#187; est &#233;valu&#233;e en premier. Si l'&#233;valuation r&#233;ussit, la 
partie suivante est &#233;valu&#233;e de mani&#232;re classique (de gauche &#224; droite) tandis que la partie 
pr&#233;c&#233;dente est &#233;valu&#233;e &#224; rebours (de droite &#224; gauche). Le sens de l'&#233;valuation est important 
dans le cas de l'utilisation du r&#233;p&#233;titeur pr&#233;f&#233;rentiel.  
</p>
<p>3.5 Cas particulier de l'utilisation du r&#233;p&#233;titeur pr&#233;f&#233;rentiel 
</p>
<p>Les deux requ&#234;tes que nous venons de voir ne s'&#233;valuent pas dans le m&#234;me intervalle de temps 
sur un corpus (la seconde est bien plus rapide) mais elles retournent cependant le m&#234;me 
r&#233;sultat. Il n'en va pas toujours de m&#234;me lorsque l'on ajoute les d&#233;limiteurs &#171; &lt; &#187; et &#171; &gt; &#187; dans 
une expression contenant un r&#233;p&#233;titeur pr&#233;f&#233;rentiel {x,y} avec x&gt;y. Par exemple, supposons la 
s&#233;quence de mots &#171; x b b b a b b y &#187;. Sur cette s&#233;quence, la requ&#234;te [b]{4,1} [a] [b]{4,1} </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. AUDIBERT 
</p>
<p>retournera trois correspondances {bbbabb, bbabb, babb} tandis que la requ&#234;te 
[b]{4,1} &lt;[a]&gt; [b]{4,1} n'en retournera qu'une {bbbabb} en raison de l'&#233;valuation &#224; rebours 
de la partie &#224; gauche du d&#233;limiteur &#171; &lt; &#187;.  
</p>
<p>4 Formatage des r&#233;sultats (masque) 
</p>
<p>Une requ&#234;te permet de d&#233;crire de mani&#232;re formelle un ph&#233;nom&#232;ne linguistique. Une instance 
de ce ph&#233;nom&#232;ne dans un corpus, c'est &#224; dire une portion de corpus d&#233;crite par la requ&#234;te sera 
appel&#233;e une correspondance. A une correspondance sont associ&#233;es deux positions dans le 
corpus (d&#233;but et fin de la correspondance)  ainsi qu&#8217;un certain nombre de r&#233;f&#233;rences &#224; des 
mots de la correspondance (cf. fin de la section 3.2). Les masques permettent &#224; l&#8217;utilisateur de 
pr&#233;ciser comment la correspondance doit &#234;tre utilis&#233;e pour g&#233;n&#233;rer une cha&#238;ne de caract&#232;res.  
</p>
<p>Dans un masque, pour produire un caract&#232;re, il suffit de taper ce caract&#232;re. On peut aussi 
produire un caract&#232;re en utilisant son code ASCII, pour cela, il faut saisir [C:&lt;code_ASCII&gt;]. 
On peut afficher un nombre gr&#226;ce &#224; [N:&lt;nombre&gt;]. On peut faire r&#233;f&#233;rence &#224; une propri&#233;t&#233; 
d'un mot en saisissant [P:&lt;variable&gt;]. La syntaxe des masques comporte &#233;galement une 
structure de boucle permettant de g&#233;n&#233;rer de mani&#232;re it&#233;rative un masque : 
[B:&lt;masque&gt;;&lt;debut_it&#233;ration&gt;;&lt;fin_it&#233;ration&gt;] et une structure de choix 
[?:&lt;expression_logique&gt;;&lt;masque&gt;;&lt;masque&gt;].  
</p>
<p>Par exemple le masque [B: [P:mot][C:32] ; begin.index ; end.index] permet de g&#233;n&#233;rer une 
cha&#238;ne contenant tous les mots de la correspondance s&#233;par&#233;s par un espace. &#171; begin &#187; et 
&#171; end &#187; sont deux variables pr&#233;d&#233;finies qui pointent respectivement sur le premier et le dernier 
mot de la correspondance. 
</p>
<p>5 Trois utilisations possibles 
</p>
<p>Le logiciel LoX permet trois types d&#8217;exploitation des requ&#234;tes et de leurs masques associ&#233;s. 
</p>
<p>5.1 Extraction de sous-corpus 
</p>
<p>La premi&#232;re utilisation ignore les masques et g&#233;n&#232;re un sous-corpus constitu&#233; de toutes les 
portions du corpus sources d&#233;crites par la requ&#234;te. Cette utilisation permet de produire un 
sous-corpus dans lequel le ph&#233;nom&#232;ne que l'on d&#233;sire observer sera dense. On ram&#232;ne ainsi le 
corpus de grande taille sur lequel on doit travailler &#224; un corpus de taille raisonnable. 
</p>
<p>5.2 Applications des masques 
</p>
<p>La deuxi&#232;me utilisation consiste &#224; g&#233;n&#233;rer un fichier constitu&#233; des cha&#238;nes g&#233;n&#233;r&#233;es par 
l'application des masques aux correspondances  issues de l'application de la requ&#234;te sur le 
corpus. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LoX : outil polyvalent pour l'exploration de corpus annot&#233;s 
</p>
<p>Exemple : fichier pour un &#233;tiquetage s&#233;mantique manuel 
</p>
<p>Le but est de g&#233;n&#233;rer un fichier permettant un &#233;tiquetage s&#233;mantique manuel ais&#233; des 
occurrences du lemme &#171; barrage &#187; dans un grand corpus. 
</p>
<p>La requ&#234;te sera donc : cible:[lemme=&quot;barrage&quot;] 
</p>
<p>Le masque associ&#233; sera : 
</p>
<p>[B:[P:mot][C:32];cible.index-50;cible.index-1][C:9] 
[P:cible.mot][C:9] 
[C:9] 
[B:[P:mot][C:32];cible.index+1;cible.index+50][C:9] 
[B:[P:mot][C:32];cible.index-1;cible.index-5][C:10] 
</p>
<p>Voici un extrait du fichier g&#233;n&#233;r&#233; (les contextes gauche et droit ont &#233;t&#233; tronqu&#233;s) : 
</p>
<p>Contexte gauche Mot Eti Contexte droit Clef Gauche
</p>
<p>communistes feront syst&#233;matiquement barrage aux candidats de droite. syst&#233;matiquement &quot; feront
</p>
<p>gardiens sont r&#233;partis en trois &quot; barrages &quot; distants d ' une centaine &quot; trois en r&#233;partis
</p>
<p>que les castors construisent des barrages ( exemple que nous empruntons des construisent castors
</p>
<p>s ' adresse aux gardiens des barrages , aux d&#233;l&#233;gu&#233;s locaux , aux des gardiens aux adresse
</p>
<p>inqui&#233;tantes courent de barrage en barrage : Il s ' adresse aux en barrage de courent
</p>
<p>&#171; Les castors construisent des barrages &#187; fait partie du st&#233;r&#233;otype des construisent castors
</p>
<p>voulu prendre le risque de faire barrage &#224; ceux des rares &#233;lus locaux faire de risque le
</p>
<p>Pour un exemple r&#233;el de ce type, voir (Reymond, 2001). 
</p>
<p>5.3 D&#233;nombrement des masques 
</p>
<p>L'application des masques aux correspondances, reconnues par les requ&#234;tes, produit un 
ensemble de cha&#238;nes. Il est possible de g&#233;n&#233;rer un tableau permettant de d&#233;nombrer le nombre 
d'occurrences de chaque cha&#238;ne dans l'ensemble des cha&#238;nes g&#233;n&#233;r&#233;es. De plus, lorsqu'un 
masque discriminant est g&#233;n&#233;r&#233;, il est possible de produire un tableau de d&#233;nombrement &#224; 
deux dimensions. 
</p>
<p>Exemple : recherche de figements 
</p>
<p>Le but est de d&#233;nombrer les n-grammes (n&lt;5) contenant le lemme &#171; chef &#187; dans un grand 
corpus. Nous utiliserons la requ&#234;te de la section 3.4, le masque associ&#233; sera : 
</p>
<p>[B:[P:mot]_;begin.index;end.index-1][P:end.mot] 
</p>
<p>Voici un extrait du fichier g&#233;n&#233;r&#233; : 
</p>
<p>chef_-_d_'_&#339;uvre 42
chefs_de_publicit&#233; 41
</p>
<p>chef_de_file 36
premier_chef 25
</p>
<p>chefs_d_'_entreprise 25
chef_du_gouvernement 24
</p>
<p>r&#233;dacteur_en_chef 21</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. AUDIBERT 
</p>
<p>Exemple : d&#233;nombrement avec discriminant 
</p>
<p>Il est possible de g&#233;n&#233;rer un deuxi&#232;me masque servant de discriminant, pour obtenir un 
d&#233;nombrement &#224; deux dimensions. Le tableau qui suit est extrait d'un fichier r&#233;sultant de 
l'application de plusieurs requ&#234;tes centr&#233;es sur le lemme &#171; barrage &#187; et appliqu&#233;es sur un 
corpus dont le lemme barrage a &#233;t&#233; &#233;tiquet&#233; s&#233;mantiquement. Le masque discriminant renvoie 
l'&#233;tiquette du sens du lemme &#171; barrage &#187;. Ce tableau permet d'observer la r&#233;partition des 
ph&#233;nom&#232;nes, formalis&#233;s par les r&#232;gles, qui sont en cooccurrence avec le lemme &#171; barrage &#187;  en 
fonction du sens de ce lemme. 
</p>
<p>1.1 1.2 2.1 2.2
Coo_Phr_castor 7
pos(-1)_DETDMS 1 9 1
coo_faire 12 1 1
Coo_Phr_construction 9
Coo_Phr_construire 15
Coo_Phr_exemple 14
pos(-1)_PREP 2 9
2-gramme(faire_barrage) 12
3-gramme(barrage_au_d&#233;veloppement) 7
3-gramme(construisent_des_barrages) 9
5-gramme(courent_de_barrage_en_barrage) 6
Coo_Phr_dommage 7
Coo_Phr_droite 6
Coo_Phr_d&#233;veloppement 7
</p>
<p>6 Perspectives 
</p>
<p>Les informations g&#233;n&#233;r&#233;es par un traitement ad&#233;quat, sur un corpus pr&#233;alablement &#233;tiquet&#233; 
s&#233;mantiquement, peuvent permettre de rechercher quels sont les ph&#233;nom&#232;nes, en cooccurrence 
avec un mot donn&#233;, les plus indicateurs du sens de ce mot. Un traitement statistique 
subs&#233;quent pourrait alors permettre une d&#233;sambigu&#239;sation s&#233;mantique automatique. C&#8217;est dans 
cette perspective que s'inscriront les d&#233;veloppements ult&#233;rieurs de l'application. Un 
d&#233;veloppement fort int&#233;ressant, notamment dans la perspective de d&#233;sambigu&#239;sation, serait de 
pouvoir utiliser des bases de connaissance externes. En effet des sources d'informations sont 
actuellement disponibles, comme WordNet (Miller, Beckwith, Fellbaum, Gross, &amp; Miller, 
1993), EuroWordNet (Vossen et al., 1998). Elles permettent d'augmenter consid&#233;rablement 
l'information disponible sur les mots. Il serait int&#233;ressant de pouvoir utiliser de telles sources 
d'informations dans les requ&#234;tes. 
</p>
<p>L'outil d&#233;velopp&#233; est extr&#234;mement ouvert et permet une grande diversit&#233; d'applications en 
raison du grand pouvoir expressif des requ&#234;tes et de leur libre interpr&#233;tation au travers des 
masques. Il est ainsi possible, dans le cadre de projets d'&#233;tudiants par exemple, de d&#233;velopper 
des frontaux graphiques permettant une utilisation plus simple, plus intuitive, mais aussi plus 
limit&#233;e des possibilit&#233;s de l'application (par exemple une utilisation de type concordancier, 
d&#233;nombrement de ph&#233;nom&#232;nes bien particuliers, &#8230;). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LoX : outil polyvalent pour l'exploration de corpus annot&#233;s 
</p>
<p>7 Conclusions 
</p>
<p>Nous avons pr&#233;sent&#233; une application permettant d'&#233;crire des requ&#234;tes complexes sur des 
corpus &#233;tiquet&#233;s et de formater librement les r&#233;sultats de ces requ&#234;tes. Le formalisme des 
requ&#234;tes est bas&#233; sur le principe des expressions r&#233;guli&#232;res bien connu de la plupart des 
linguistes travaillant sur des corpus &#233;crits. Contrairement &#224; certains logiciels, qui ne 
permettent que l&#8217;extraction de concordances au format relativement fig&#233;, le formatage libre du 
r&#233;sultat des requ&#234;tes permet leur r&#233;utilisation par des programmes ult&#233;rieurs et autorise une 
grande diversit&#233; d'applications, s'&#233;cartant largement du cadre des simples concordanciers. 
Cette application se rapproche du logiciel INTEX d&#233;velopp&#233; au LADL (Silberztein, 2000)  
mais est plus orient&#233; vers le traitement de corpus &#233;tiquet&#233;s (notamment morpho-
syntaxiquement d&#233;sambigu&#239;s&#233;). LoX existe dans une version ligne de commande pouvant &#234;tre 
compil&#233;e sur n'importe quelle plate-forme et dans une version disposant d'une interface 
graphique pour une utilisation plus souple sous Windows. 
</p>
<p>Du fait du grand pouvoir expressif des requ&#234;tes et de leur libre interpr&#233;tation au travers des 
masques LoX constitue un outil puissant et polyvalent pour tout linguiste ou lexicographe 
travaillant sur des corpus &#233;crits. Nous avons pris dans l&#8217;article l&#8217;exemple de l&#8217;&#233;tiquetage 
morpho-syntaxique, mais le logiciel n&#8217;est pas d&#233;pendant du type particulier d&#8217;&#233;tiquetage 
utilis&#233;, et peut &#234;tre utilis&#233; dans des domaines vari&#233;s de la recherche bas&#233;e sur les corpus.  
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Adda, G., Mariani, J., Paroubek, P., Rajman, M., &amp; Lecomte, J. (1999). L'action GRACE 
d'&#233;valuation de l'assignation des parties du discours pour le fran&#231;ais. Langues, 2(1), 
119-129. 
</p>
<p>Christ, O. (1994). A Modular and Flexible Architecture for an Integrated Corpus Query 
System. Proceedings of COMPLEX'94 3rd Conference on Computational 
Lexicography and Text Research, 23-32. 
</p>
<p>Miller, G. A., Beckwith, R., Fellbaum, C., Gross, D., &amp; Miller, K. (1993). Introduction to 
WordNet : An on-line lexical database (Technical Report). Princeton University: 
Cognitive Science Laboratory. 
</p>
<p>Reymond, D. (2001, 2-5 juillet). Dictionnaires distributionnels et &#233;tiquetage lexical de 
corpus. Paper presented at the RECITAL (TALN) 2001, Tours. 
</p>
<p>Silberztein, M. (2000). INTEX [Linguistic software]. Champs-sur-Marne: Association pour le 
traitement informatique des langues (ASSTRIL). 
</p>
<p>Sperberg-McQueen, C. M., &amp; Burnard, L. (1994). Guidelines for Electronic Text Encoding 
and Interchange. Text Encoding Initiative. 
</p>
<p>Vossen, P., Bloksma, L., Rodriguez, H., Climent, S., Calzolari, N., Roventini, A., Bertagna, 
F., Alonge, A., &amp; Peters, W. (1998). The EuroWordNet Base Concepts and Top 
Ontology (LE2-4003.): EuroWordNet project. </p>

</div></div>
</body></html>