<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Dictionnaires distributionnels et &#233;tiquetage lexical de corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2001, Tours, 2-5 juillet 2001 
</p>
<p>Dictionnaires distributionnels et &#233;tiquetage lexical de corpus 
</p>
<p>Delphine Reymond 
</p>
<p>Equipe DELIC &#8211; Universit&#233; de Provence 
19, avenue Robert Schuman  
</p>
<p>13621 Aix-en-Provence - France 
reymond@up.univ-aix.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Ce papier pr&#233;sente la premi&#232;re partie d&#8217;un travail de th&#232;se qui vise &#224; construire un 
&#171; dictionnaire distributionnel &#187; &#224; partir d&#8217;un corpus de r&#233;f&#233;rence. Le dictionnaire propos&#233; est 
bas&#233; sur un ensemble de crit&#232;res diff&#233;rentiels stricts qui constituent des indices exploitables 
par des machines pour discriminer le sens des mots en contexte. Pour l&#8217;instant, le travail a 
port&#233; sur 50 000 occurrences qui ont &#233;t&#233; &#233;tiquet&#233;es de fa&#231;on manuelle. Ce sous-corpus pourra 
servir de corpus d&#8217;amor&#231;age pour la constitution d'un corpus &#233;tiquet&#233; plus grand, qui pourrait 
servir &#224; diff&#233;rents tests et travaux sur la d&#233;sambigu&#239;sation automatique. 
</p>
<p>This paper presents the first part of a Ph. D. aimed at the construction of a &#8220;distributional 
dictionary&#8221; from a reference corpus. The dictionary proposed is based on a set of strict 
differential criteria that can be used as clues for the discrimination of word senses in context. 
So far, we have worked on 50,000 occurrences that have been manually tagged. This sub-
corpus can be used as a bootstrap corpus for the construction of a larger tagged corpus that 
could be used in various tests and studies on automatic disambiguation. 
</p>
<p>Mots-cl&#233;s &#8211; Keywords 
</p>
<p>Corpus, dictionnaire, &#233;tiquetage lexical, information distributionnelle 
Corpora, dictionaries, lexical tagging, distributional information 
</p>
<p>1 Introduction 
</p>
<p>On a vu appara&#238;tre au cours de la derni&#232;re d&#233;cennie des corpus &#233;tiquet&#233;s du point de vue 
morpho-syntaxique qui se sont av&#233;r&#233;s extr&#234;mement utiles pour de nombreuses applications du 
traitement automatique des langues. Il serait int&#233;ressant, afin d&#8217;am&#233;liorer encore les 
performances de ces applications, de pouvoir disposer d&#8217;informations suppl&#233;mentaires sur ces 
corpus, et notamment d&#8217;un &#233;tiquetage lexical donnant le sens de chaque mot. Toutefois, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p>malgr&#233; des recherches continues depuis une quarantaine d&#8217;ann&#233;es (voir l&#8217;&#233;tat de l&#8217;art de Ide &amp; 
V&#233;ronis, 1998), la d&#233;sambigu&#239;sation automatique du sens des mots, n&#233;cessaire &#224; tout 
&#233;tiquetage d&#8217;envergure, reste un th&#232;me de recherche plus qu&#8217;une technique op&#233;rationnelle. Les 
r&#233;sultats de l&#8217;&#233;valuation Senseval/Romanseval sur le fran&#231;ais1 ont de ce point de vue &#233;t&#233; 
extr&#234;mement modestes (Segond, 2000) : on est bien loin dans ce domaine des chiffres 
sup&#233;rieurs &#224; 95% d&#8217;efficacit&#233; couramment publi&#233;s pour l&#8217;&#233;tiquetage morpho-syntaxique. 
</p>
<p>Selon V&#233;ronis (2001), l&#8217;une des difficult&#233;s majeures de l&#8217;&#233;tiquetage lexical automatique, qui 
explique en grande partie la stagnation des performances des syst&#232;mes, r&#233;side dans 
l&#8217;inad&#233;quation des dictionnaires  traditionnels pour cette t&#226;che, et tout particuli&#232;rement dans le 
manque d&#8217;information distributionnelle permettant de relier les sens et les contextes en 
corpus2. Ainsi, par exemple, aucun des dictionnaires fran&#231;ais que nous avons pu consulter ne 
mentionne l&#8217;affinit&#233; d&#8217;un mot aussi simple que barrage avec deux pr&#233;positions diff&#233;rentes 
selon son sens : barrage sur &lt;une rivi&#232;re, un fleuve, etc.&gt;, barrage &#224; &lt;une id&#233;e, un projet, 
etc.&gt;. Une telle information fournit une base objective au d&#233;coupage des entr&#233;es en &#171; sens &#187;, 
et est de la premi&#232;re importance pour la d&#233;sambigu&#239;sation par des machines.  
</p>
<p>La difficult&#233; de discrimination entre les sens possibles d&#8217;un mot tels qu&#8217;ils sont list&#233;s dans un 
dictionnaire a &#233;t&#233; mise en &#233;vidence par une exp&#233;rience d&#8217;&#233;tiquetage manuel portant sur pr&#232;s de 
4000 occurrences de 60 mots diff&#233;rents dans un corpus. Six annotateurs, &#233;tudiants en 
linguistique, ont &#233;tiquet&#233; manuellement la totalit&#233; de ces occurrences &#224; l&#8217;aide des sens du Petit 
Larousse  (V&#233;ronis, 1998, 2000a). L&#8217;accord inter-annotateur moyen s&#8217;est av&#233;r&#233; tr&#232;s faible, de 
l&#8217;ordre de 40% une fois soustrait l&#8217;effet du hasard. Pour certains mots tels que correct, 
historique, lancement, mettre, le taux d&#8217;accord &#233;tait &#224; peu pr&#232;s &#233;gal &#224; celui qui aurait &#233;t&#233; 
obtenu si les annotateurs avaient r&#233;pondu de fa&#231;on al&#233;atoire.  
</p>
<p>Notre travail de th&#232;se  s&#8217;articule autour de la construction d&#8217;un dictionnaire &#171; distributionnel &#187;, 
sp&#233;cialement adapt&#233; au probl&#232;me de la d&#233;sambigu&#239;sation par des machines. L&#8217;information 
id&#233;alement contenue dans un tel dictionnaire n&#8217;a plus pour but premier la d&#233;finition du 
&#171; sens &#187; comme dans les dictionnaires traditionnels, mais vise &#224; organiser les vocables en 
lexies poss&#233;dant des propri&#233;t&#233;s distributionnelles coh&#233;rentes &#8211; propri&#233;t&#233;s qui peuvent 
constituer autant d&#8217;indices utilisables pour la d&#233;sambigu&#239;sation automatique. 
</p>
<p>Ce travail s&#8217;inspire largement des id&#233;es mises en oeuvre dans la construction du Dictionnaire 
Explicatif et Combinatoire (DEC) de Mel&#8217;cuk et son &#233;quipe (Mel&#8217;cuk, Clas &amp; Polgu&#232;re, 
1995). Toutefois &#224; la diff&#233;rence de Mel&#8217;cuk et al., qui utilisent le corpus comme outil de 
v&#233;rification a posteriori apr&#232;s une construction lexicale introspective, nous consid&#233;rons le 
corpus comme r&#233;servoir d&#8217;observations &#224; partir duquel les entr&#233;es doivent &#234;tre &#233;labor&#233;es, la 
d&#233;marche introspective &#233;tant r&#233;duite au minimum. L&#8217;entr&#233;e de dictionnaire, dans notre 
approche, est donc vue comme un mod&#232;le, qui doit rendre compte au mieux des observations, 
et doit &#234;tre pr&#233;dictif des observations futures (dans d&#8217;autres corpus ou un corpus plus large). 
Le travail d&#8217;&#233;laboration des entr&#233;es se fait de fa&#231;on totalement interactive avec l&#8217;&#233;tiquetage 
d&#8217;un corpus de r&#233;f&#233;rence (le plus large possible), selon une strat&#233;gie incr&#233;mentale : le corpus 
</p>
<p>                                                 
1  http://www.up.univ-mrs.fr/~veronis/romanseval 
</p>
<p>2  Les ressources plus orient&#233;es &#171; machine &#187; telles que WordNet n&#8217;&#233;chappent pas &#224; cette critique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dictionnaires distributionnels et &#233;tiquetage lexical de corpus 
</p>
<p>est &#233;tiquet&#233; (avec l&#8217;assistance d&#8217;outils informatiques vari&#233;s) au fur et &#224; mesure de la 
construction des entr&#233;es, et les entr&#233;es sont r&#233;vis&#233;es en fonction des nouveaux contextes 
rencontr&#233;es. A la fin de ce processus, on obtient un dictionnaire dont chacune des lexies est 
li&#233;e &#224; un ensemble de contextes dans le corpus. De m&#234;me, chaque occurrence dans le corpus 
est &#233;tiquet&#233;e par le num&#233;ro d&#8217;une lexie dans le dictionnaire. 
</p>
<p>Dans le cadre de notre travail de th&#232;se, il s&#8217;agit d&#8217;&#233;laborer une m&#233;thodologie, et non de 
construire un dictionnaire dans son int&#233;gralit&#233;, travail qui ne pourrait se concevoir qu&#8217;au sein 
d&#8217;une large &#233;quipe lexicographique. Nous avons donc s&#233;lectionn&#233; un corpus de taille 
manipulable (cinq millions de mots), et nous avons dans un premier  temps trait&#233; 60 vocables 
tr&#232;s polys&#233;miques (20 noms, 20 adjectifs et 20 verbes), qui semblent repr&#233;senter un large 
&#233;ventail des probl&#232;mes lexicographiques pour le traitement automatique des langues. Ces 60 
vocables apparaissent dans environ 50 000 contextes au total, qui ont tous &#233;t&#233; &#233;tiquet&#233;s selon 
la strat&#233;gie incr&#233;mentale d&#233;crite pr&#233;c&#233;demment, dans le cadre du projet Syntsem, financ&#233; par 
l&#8217;ELRA/ELDA. Dans la deuxi&#232;me partie de notre travail de th&#232;se, nous utiliserons ce sous-
corpus comme corpus d&#8217;amor&#231;age pour &#233;tiqueter semi-automatiquement de nouveaux 
vocables qui apparaissent au voisinage des vocables d&#233;j&#224; &#233;tiquet&#233;s (par exemple chute dans le 
contexte de barrage r&#233;f&#232;re tr&#232;s probablement au sens &#171; chute d&#8217;eau &#187;). 
</p>
<p>2 Corpus de r&#233;f&#233;rence 
</p>
<p>Le corpus de r&#233;f&#233;rence que nous utilisons est compos&#233; de cinq parties d&#8217;environ un million de 
mots chacune, de genres vari&#233;s (chaque partie est d&#233;sign&#233;e par un code d&#8217;une lettre) : 
</p>
<p>&#8226; A Litt&#233;rature (serveur ABU). 
&#8226; J Institutionnel  (Commission europ&#233;enne). 
&#8226; M Presse (Le Monde). 
&#8226; O Ouvrages de sciences humaines (Editions CNRS). 
&#8226; P P&#233;riodiques scientifiques (CNRS et Herm&#232;s). 
</p>
<p>Ce corpus a &#233;t&#233; choisi pour des raisons &#233;videntes de disponibilit&#233;, tout en respectant une 
diversit&#233; de genres int&#233;ressante et repr&#233;sentative de nombreuses applications de traitement 
automatique des langues. 
</p>
<p>Le corpus a &#233;t&#233; int&#233;gralement &#233;tiquet&#233; pour la morpho-syntaxe et lemmatis&#233; &#224; l&#8217;aide du 
logiciel Cordial 7 Analyseur, d&#233;velopp&#233; et distribu&#233; par la soci&#233;t&#233; Synapse D&#233;veloppement3. 
Ce logiciel, qui a l&#8217;avantage d&#8217;&#234;tre disponible &#224; un co&#251;t modique, constitue l&#8217;un des meilleurs 
&#233;tiqueteurs morpho-syntaxiques pour le fran&#231;ais : des tests effectu&#233;s dans notre &#233;quipe 
montrent des taux de performance de l&#8217;ordre de 98% (Valli &amp; V&#233;ronis, 1999).  
Le logiciel LoX4, outil cr&#233;&#233; au sein de l&#8217;&#233;quipe DELIC, dont une des principales fonctions est 
de permettre l&#8217;extraction de concordances (Audibert, 2001), nous a permis d&#8217;extraire 
facilement les fragments du corpus contenant les vocables concern&#233;s, sous toutes leurs formes 
fl&#233;chies, et en &#233;liminant les ambigu&#239;t&#233;s syntaxiques (par exemple, porte verbe vs porte nom). 
</p>
<p>                                                 
3  http://www.synapse-fr.com 
</p>
<p>4 LoX est disponible &#224; l'adresse suivante : http://laurent.audibert.free.fr/lox.htm </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p>60 sous-corpus ont &#233;t&#233; automatiquement cr&#233;&#233;s, chacun compos&#233; de la totalit&#233; des lignes de 
concordance d&#8217;un des vocables &#224; traiter, dans un format multicolonnes (voir Annexe 2) : 
</p>
<p>&#8226; code d&#233;signant la partie du corpus (A, J, M, O, P) ; 
&#8226; num&#233;ro de paragraphe de l&#8217;occurrence ; 
&#8226; num&#233;ro de caract&#232;re dans le paragraphe ; 
&#8226; contexte gauche (50 mots) ; 
&#8226; occurrence ; 
&#8226; colonne vide (destin&#233;e &#224; recevoir l&#8217;&#233;tiquette lexicale) ; 
&#8226; contexte droit (50 mots). 
</p>
<p>Les sous-corpus ainsi obtenus sont d&#8217;une taille beaucoup plus r&#233;duite que le corpus initial de 
cinq millions de mots, ce qui facilite l&#8217;ensemble des manipulations, et leur format tabulaire est 
parfaitement adapt&#233; &#224; la strat&#233;gie d&#8217;&#233;tiquetage &#171; vertical &#187; que nous avons adopt&#233;e. En effet, 
nous n&#8217;&#233;tiquetons pas chaque mot dans l&#8217;ordre lin&#233;aire du texte, mais par vocable : toutes les 
cooccurrences d&#8217;un vocable sont trait&#233;es simultan&#233;ment, &#224; l&#8217;aide d&#8217;une pr&#233;sentation sous 
forme de concordance (Annexe 2). Cette strat&#233;gie permet une meilleur coh&#233;rence des 
d&#233;cisions d&#8217;&#233;tiquetage sur l&#8217;ensemble du corpus, et facilite grandement la t&#226;che de 
l&#8217;annotateur, qui peut utiliser des fonctions de tri et de s&#233;lection diverse et &#233;tiqueter des 
paquets entiers d&#8217;occurrences qui ont des contextes gauche et/ou droit analogues. 
</p>
<p>3 Vocables trait&#233;s 
</p>
<p>Les 60 vocables que nous avons trait&#233;s sont ceux qui ont &#233;t&#233; utilis&#233;s dans l&#8217;exp&#233;rience 
d&#8217;&#233;tiquetage manuel mentionn&#233;e pr&#233;c&#233;demment (V&#233;ronis, 1998, 2000a). Ces m&#234;mes vocables 
ont &#233;galement &#233;t&#233; utilis&#233;s dans l&#8217;&#233;valuation de l&#8217;&#233;tiquetage lexical Senseval/Romanseval 
(Segond, 2000), ainsi que dans l&#8217;&#233;valuation de l&#8217;alignement de textes parall&#232;les fran&#231;ais-
anglais Arcade (V&#233;ronis, 2000b). Notre corpus permettra donc des comparaisons int&#233;ressantes 
avec d&#8217;autres travaux. En particulier, on pourra v&#233;rifier si notre &#171; dictionnaire distributionnel &#187; 
permet une am&#233;lioration de l&#8217;&#233;tiquetage, tant manuel qu&#8217;automatique. 
</p>
<p>Ces 60 vocables se r&#233;partissent en 20 noms, 20 adjectifs et 20 verbes, et ont &#233;t&#233; choisis d&#8217;une 
part sur la base de leur fr&#233;quence assez &#233;lev&#233;e, et d&#8217;autre part de leur forte polys&#233;mie (figure 
1). 
</p>
<p>Noms barrage, chef, communication, compagnie, concentration, constitution, degr&#233;, 
d&#233;tention, &#233;conomie formation, lancement, observation, organe, passage, pied, 
restauration, solution, station, suspension, vol 
</p>
<p>Verbes arr&#234;ter, comprendre, conclure, conduire, conna&#238;tre, couvrir, entrer, exercer, 
importer, mettre, ouvrir, parvenir, passer, porter, poursuivre, pr&#233;senter, 
rendre, r&#233;pondre, tirer, venir 
</p>
<p>Adjectifs biologique, clair, correct, courant, exceptionnel, frais, haut, historique, plein, 
populaire, r&#233;gulier, sain, secondaire, sensible, simple, strict, s&#251;r, traditionnel, 
utile, vaste 
</p>
<p>Figure 1 : liste des 60 vocables trait&#233;s </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dictionnaires distributionnels et &#233;tiquetage lexical de corpus 
</p>
<p>4 Crit&#232;res diff&#233;rentiels 
</p>
<p>Nous avons donc entrepris la construction des entr&#233;es du dictionnaire en utilisant 
syst&#233;matiquement des crit&#232;res distributionnels stricts, tels que (1) les contraintes syntaxiques 
observ&#233;es pour un sens donn&#233; (par exemple, type de pr&#233;position, comme dans barrage sur, 
barrage &#224;) ; (2) les restrictions de s&#233;lection (par exemple on construit un barrage sur un 
fleuve, on dresse un barrage sur une route, on fait barrage &#224; l&#8217;opposition) ; (3) des tests de 
commutation de synonymes stricts (on peut remplacer &#171; faire barrage &#224; l&#8217;opposition &#187; par 
&#171; faire obstacle &#224; l&#8217;opposition &#187;, mais on ne peut avoir de fa&#231;on naturelle &#171; construire un 
obstacle sur un fleuve &#187;), etc. Ces crit&#232;res sont des crit&#232;res diff&#233;rentiels, en ce sens qu&#8217;ils 
permettent d&#8217;opposer les diverses classes d&#8217;emplois du vocable, et donc de le d&#233;couper en 
lexies coh&#233;rentes. Nous ne pouvons dans le cadre de ce papier d&#233;tailler la totalit&#233; des crit&#232;res 
utilis&#233;s, et nous nous bornerons &#224; un certain nombre d&#8217;exemples significatifs : 
</p>
<p>&#8226; valence (type et nombre des compl&#233;ments) 
</p>
<p>comprendre que..., comprendre qqun 
barrage sur qqch, barrage &#224; qqch 
</p>
<p>&#8226; traits  
</p>
<p>o &#177;comptable 
</p>
<p>la communication (d&#8217;entreprise), la/les communications (t&#233;l&#233;phoniques) 
</p>
<p>o &#177;sexu&#233; 
</p>
<p>le chien/la chienne (qui aboie), le chien/*la chienne (de fusil) 
</p>
<p>o &#177;massif 
</p>
<p>du vin, un (grand) vin 
</p>
<p>o &#177;anim&#233; 
</p>
<p>arr&#234;ter une date, arr&#234;ter quelqu&#8217;un 
</p>
<p>o etc. 
</p>
<p>&#8226; auxiliaire &#234;tre / avoir 
</p>
<p>Je suis pass&#233; sous l&#8217;&#233;chelle, j&#8217;ai pass&#233; le baccalaur&#233;at 
</p>
<p>&#8226; emploi r&#233;fl&#233;chi 
</p>
<p>conduire/se conduire (bien), porter/se porter (candidat) 
</p>
<p>&#8226; d&#233;rivation active (peut &#234;tre utilis&#233;e de fa&#231;on productive pour reformuler l&#8217;&#233;nonc&#233;) 
</p>
<p>importer : l&#8217;importation de / avoir de l&#8217;importance 
&#233;lever : &#233;levage de cochons, *&#233;levage d&#8217;enfants </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p>&#8226; hyperonymes 
</p>
<p>barrage sur un fleuve :  ouvrage, barrage sur une route : *ouvrage 
</p>
<p>&#8226; synonymes 
</p>
<p>faire barrage/obstacle &#224; l&#8217;opposition, construire un barrage/*obstacle sur 
un fleuve 
</p>
<p>&#8226; antonymes, converses 
</p>
<p>boissons fra&#238;ches/chaudes, roses fra&#238;ches/fan&#233;es 
importer (des marchandises)/exporter, importer (&#234;tre important)/*exporter 
</p>
<p>&#8226; restrictions de s&#233;lection, classes d&#8217;objets 
</p>
<p>construire un barrage (sur un fleuve), dresser un barrage (sur une route), 
faire barrage &#224; (un projet, des id&#233;es) 
lancement de  &lt;fus&#233;e, missile...&gt;, lancement de &lt; &#233;v&#232;nement, projet...&gt; 
lire &lt;expression, sentiment...&gt; (sur un visage), lire &lt;livre, lettre, 
journal...&gt; 
</p>
<p>&#8226; figements, semi-figements 
</p>
<p>rendre l&#8217;&#226;me, chef d&#8217;&#339;uvre, haut en couleurs 
</p>
<p>&#8226; etc. 
</p>
<p>L&#8217;information ainsi d&#233;gag&#233;e est incorpor&#233;e dans chaque entr&#233;e lexicale. Nous pr&#233;sentons en 
Annexe 1 une entr&#233;e (simplifi&#233;e), concernant le vocable IMPORTER (on trouvera en Annexe 
2 l&#8217;&#233;tiquetage d&#8217;un fragment du corpus correspondant &#224; ce vocable). 
</p>
<p>5 Conclusion 
</p>
<p>Nous avons expos&#233; dans ce papier la premi&#232;re partie d&#8217;un travail de th&#232;se qui vise &#224; construire 
de fa&#231;on incr&#233;mentale un dictionnaire &#171; distributionnel &#187; &#224; partir d&#8217;un corpus de r&#233;f&#233;rence. Ce 
travail part d&#8217;un constat d&#8217;inad&#233;quation des dictionnaires classiques (et de ressources 
informatis&#233;es telles que WordNet) pour la d&#233;sambigu&#239;sation du sens des mots par des 
machines et l&#8217;&#233;tiquetage lexical automatique de corpus. Le dictionnaire propos&#233; est bas&#233; sur 
un ensemble de crit&#232;res diff&#233;rentiels stricts, qui permettent d&#8217;opposer les diff&#233;rentes classes 
d&#8217;emploi de chaque vocable (ou lexies). Ces crit&#232;res, cod&#233;es dans l&#8217;entr&#233;e lexicale, peuvent 
constituer ult&#233;rieurement autant d&#8217;indices exploitables par des machines pour discriminer le 
sens des mots en contexte. Pour l&#8217;instant, le travail a port&#233; sur 60 vocables tr&#232;s polys&#233;miques, 
repr&#233;sentant 50 000 occurrences dans un corpus de cinq millions de mots, qui ont &#233;t&#233; 
&#233;tiquet&#233;es de fa&#231;on manuelle. Nous esp&#233;rons que ce sous-corpus pourra servir de corpus 
d&#8217;amor&#231;age pour l&#8217;&#233;tiquetage semi-automatique des mots du voisinage de ceux d&#233;j&#224; &#233;tiquet&#233;s, 
permettant, de fa&#231;on relativement &#233;conomique, de constituer un corpus &#233;tiquet&#233; plus grand, 
qui pourrait servir &#224; diff&#233;rents tests et travaux sur la d&#233;sambigu&#239;sation automatique. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dictionnaires distributionnels et &#233;tiquetage lexical de corpus 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Audibert, L. (2001, 2-5 juillet). LoX : outil polyvalent pour l'exploration de corpus annot&#233;s. 
Actes de RECITAL'2001, Tours.[Pr&#233;sent volume]. 
</p>
<p>Ide, N., &amp; V&#233;ronis, J. (1998). Introduction to the special issue on word sense disambiguation: 
the state of the art. Computational Linguistics, 24(1), 1-40. http://www.up.univ-
mrs.fr/~veronis/pdf/1998wsd.pdf 
</p>
<p>Mel&#8217;cuk, I., Clas, A., &amp; Polgu&#232;re, A. (1995). Introduction &#224; la lexicologie explicative et 
combinatoire. Louvain-la-Neuve : Editions Duculot (Coll. Universit&#233;s Francophones). 
</p>
<p>Segond, F. (2000). Framework and results for French. Computers and the Humanities, 
34(1/2), 49-60  [special issue on Senseval]. 
</p>
<p>Valli, A., &amp; V&#233;ronis, J. (1999). Etiquetage grammatical de corpus oraux: probl&#232;mes et 
perspectives. Revue Fran&#231;aise de Linguistique Appliqu&#233;e, IV(2), 113-133. 
http://www.up.univ-mrs.fr/~veronis/pdf/1999rfla.pdf 
</p>
<p>V&#233;ronis, J. (1998). A study of polysemy judgements and inter-annotator agreement, 
Programme and advanced papers of the Senseval workshop (pp. 2-4). Herstmonceux Castle 
(England). http://www.up.univ-mrs.fr/~veronis/pdf/1998senseval.pdf 
</p>
<p>V&#233;ronis, J. (2000a). Sense tagging: Don't look for the meaning but for the use, Computational 
Lexicography and Multimedia Dictionaries (COMLEX'2000) (pp. 1-9). Kato Achia (Greece). 
http://www.up.univ-mrs.fr/~veronis/pdf/2000comlex.pdf 
</p>
<p>V&#233;ronis, J. (2000b). Evaluation of parallel text alignment systems: the ARCADE project. In J. 
V&#233;ronis (Ed.), Parallel text processing: Alignment and use of translation corpora (pp. 369-
388). Dordrecht: Kluwer Academic Publishers. 
</p>
<p>V&#233;ronis, J. (2001). Sense tagging: does it make sense? Corpus Linguistics'2001 (pp. in press). 
Lancaster, U.K. http://www.up.univ-mrs.fr/~veronis/pdf/2001-lancaster-sense.pdf 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p>Annexe 1 - Exemple d&#8217;entr&#233;e (simplifi&#233;e) 
</p>
<p>IMPORTER, v. 
</p>
<p>1. IMPORTER (sans objet) 
</p>
<p> 1.1 Qqch importe [&#224; qqun, pour qqun] 
</p>
<p>TNom :  x IMPORTE &#224;/pour y&#8658; x a de l&#8217;IMPORTANCE pour y 
TAdj :  x IMPORTE &#224;/pour y&#8658; x a est IMPORTANT pour y 
</p>
<p> 
Ex : le contenu importe plus que le contenant 
 la forme du gouvernement importe peu 
 Les actions qui importent pour eux 
 ce qui m&#8217;importe, c&#8217;est... 
</p>
<p> 
 1.2 Qu&#8217;/peu importe qqch/que P [&#224; qqun, pour qqun] 
</p>
<p>Ex : Peu importait le proc&#233;d&#233; &#224; Bouvard 
 Qu&#8217;importe la croyance 
 Que m&#8217;importe la temp&#234;te, si j&#8217;ai la boussole 
</p>
<p> 
 1.3 il importe  [&#224; qqun, pour qqun] de Vinf /que P (impersonnel) 
</p>
<p>Ex : Ils savent, d&#232;s avant d&#8217;ouvrir un livre, ce qu&#8217;il importe d&#8217;en penser 
 il nous importe donc de montrer 
</p>
<p> 
 1.4 N&#8217;/peu importe Pro 
</p>
<p>Ex : N'importe lequel, laquelle, quel(s), quelle(s), qui, quoi... 
 N'importe o&#249;, quand, comment.... 
</p>
<p> 
 1.5. N&#8217;/peu importe ! 
</p>
<p> 
2. IMPORTER QQCH [QQPART] 
</p>
<p>TNom :  x IMPORTE y&#8658; l&#8217;IMPORTATION de y par x 
Conv :  EXPORTER 
</p>
<p> 
2.1. Importer &lt;objets, marchandises...&gt; [dans/vers &lt;pays, r&#233;gion...&gt;] 
</p>
<p>Ex : Moscou a commenc&#233; &#224; importer ces produits... 
 des institutions qui importent des armes 
</p>
<p> 
2.2. Importer &lt;population, main d&#8217;&#339;uvre...&gt;  [dans/vers &lt;pays, r&#233;gion...&gt;] 
</p>
<p>Ex : on ne peut pas importer toute la population 
 
</p>
<p>2.3. Importer &lt;concepts, id&#233;es...&gt;  [dans/vers &lt;culture, discipline...&gt;] 
</p>
<p>Ex : il importe un vocabulaire et une m&#233;thode propres aux sciences naturelles vers les sciences 
sociales . 
</p>
<p> Georges Fr&#232;che d&#233;cide d&#8217;importer acteurs et structures culturelles qui font d&#233;faut &#224; la cit&#233; 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dictionnaires distributionnels et &#233;tiquetage lexical de corpus 
</p>
<p>Annexe 2 - Exemple d&#8217;&#233;tiquetage  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Fichier P POS Contexte_gauche Mot Etiquette Contexte_droit
 M 6620 41 . C ' est l ' avenir qui importe 1.1 , et cet avenir doit leur &#234;tre montr&#233; tel qu ' il est : 
 O 11509 45 . Ce qui importe 1.1 est le cheminement d&#233;crit , les obstacles rencontr&#233;s , les h&#233;sitations , les
</p>
<p> P 9233 180 . Ce qui importe 1.1 , c ' est de comprendre comment tous nos discours , m&#234;me les plus quoti
 P 5532 178 . Ce qui importe 1.1 ce n ' est pas l ' ad&#233;quation des &#233;nonc&#233;s politiques avec la r&#233;alit&#233; qu ' elle
 A 12580 58 . Ce qui importe 1.1 , c ' est le chef . 
 M 6339 51 . Le postulat de M . Pons est que ce foss&#233; importe 1.1 peu pourvu que l ' Etat manifeste assez d ' autorit&#233; pour imposer la politiq
 O 7541 149&#233;j&#224; r&#233;alis&#233; ou qu ' il se r&#233;alise dans le futur importe 1.1 peu , pourvu que sa survenue soit certaine . 
</p>
<p> A 9067 20 . &#171; La forme du gouvernement importe 1.1 peu ! 
 A 11684 20 . Le fond de l ' histoire importe 1.1 peu ; 
 A 8452 6 . - - &#171; Qu ' importe 1.2 ! 
 A 9490 34 . Que ce soit une apparence , qu ' importe 1.2 ! il s ' agit de la produire . 
 A 9660 8 . Elle ou un autre , qu ' importait 1.2 ! le principal &#233;tant de sortir d ' embarras . 
 O 1051 119 . Peu importe 1.2 , &#224; cet &#233;gard , que le rapport ne soit pas encore divulgu&#233; . 
 O 2126 34 . Peu importe 1.2 , apr&#232;s cela qu ' infid&#232;les &#224; leurs m&#233;thodes , qu ' infid&#232;les &#224; leurs doctrine
</p>
<p> A 1077 89 ; peu importe 1.2 , apr&#232;s tout , puisqu ' il a d&#251; livrer enfin le secret de ses sources ! 
 M 1773 22ut sur la sc&#232;ne , mais la soci&#233;t&#233; , bon , peu importe 1.2 , ce n ' est pas ici un discours de Fran&#231;ois Mitterrand . 
</p>
<p> A 4268 4 : &quot; Qu ' importe 1.2 , d ' ailleurs , un peu plus ou un peu moins de g&#233;nie , puisque tout doit fin
 A 17039 69vous - m&#234;me , agac&#233; peut - &#234;tre , mais peu importe 1.2 , et , par ce travail , vous accroissez , bon gr&#233; , mal gr&#233; , la vie de Poil de 
</p>
<p> P 4900 159 . Mais qu ' importe 1.2 , il faut que ce soit dans le domaine public . 
 M 10081 42 . Il lui importait 1.2 , malgr&#233; tout , de savoir encore si Mme Lea Katz avait remarqu&#233; , &#224; l ' UG
</p>
<p> M 701 78 . Qu ' importe 1.2 , r&#233;pondent les dirigeants de la Cinq , les techniciens italiens de M . Silvio
 P 7283 257 . Mais n ' importe 1.3 - t - il pas de reconna&#238;tre &#233;galement qu ' un chercheur met de l ' avant des
 O 2758 88 . Aussi importe 1.3 - t - il que ne soient pas gaspill&#233;s les moyens et les efforts consacr&#233;s &#224; l '
 P 3475 234 . De m&#234;me , il importe 1.3 &quot; d ' expliquer &quot; le journal &#187; . 
 O 1206 70 . Il importe 1.3 , &#224; cet &#233;gard , de relever que le CPI , entres autres consid&#233;rations , prend
 O 382 18ection des connaissances &#233;tant effectu&#233; , il importe 1.3 , &#224; pr&#233;sent , d ' examiner la question de la protection de la forme de l ' &#339;u
 A 4882 111soit descendu dans sa tombe , c ' est qu ' il importe 1.3 , apr&#232;s ce que vous m ' avez dit , que vous sachiez bien qui je suis , afin d
 A 2227 43 . Ce qu ' il importe 1.3 , c ' est de gagner du temps . 
 A 25247 43 . &quot; Il importe 1.3 , dit M . H . Poincar&#233; ( * ) , de ne pas multiplier les hypoth&#232;ses outre mesu
 M 2490 59 r&#234;t assassins &#233;tranglent l ' activit&#233; et qu ' il importe 1.3 avant tout de les faire baisser ? 
 O 2794 113 ? Il importe 1.3 bien de savoir si nous faisons de la sociologie . 
 P 8863 2 . Il importe 1.3 cependant de ne pas assimiler le souci de la mise en relation de la sensib
 P 7248 231 ues psycho - ou socio - linguistiques qu ' il importe 1.3 d ' analyser dans leur fonctionnement effectif ; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>  
</p>
<p> 
</p>
<p>  
</p>
<p>Figure 2. Exemple d&#8217;&#233;tiquetage &#171; vertical &#187; 
</p>
<p>Fichier P POS Contexte_gauche Mot Etiquette Contexte_droit
 P 3891 12ar ailleurs , dans le cas qui nous occupe , il importe 1.3 d ' apporter une distinction analytique suppl&#233;mentaire pour tenir compte d
</p>
<p> P 8237 52 . Mais il importe 1.3 d ' introduire une distinction . 
 M 5044 16eut bien &quot; &#234;tre une vedette . . . mais pas n ' importe 1.4 comment &quot; et surtout il ne veut pas &quot; en avoir bav&#233; pour que d ' autres en 
</p>
<p> A 18223 5 ? - - N ' importe 1.4 comment , par tout le monde , par le premier venu , par moi , tiens ! 
 A 5741 22 je vous rencontrerai . . . dans la rue . . . n ' importe 1.4 o&#249; . . . &#224; l ' heure que vous voudrez . . . pourvu que je vous voie . 
</p>
<p> P 4771 179 . On ne porte pas une robe n ' importe 1.4 o&#249; et n ' importe comment . 
 P 3788 252 lement vendus pas le monde associatif ( baimporte 1.4 quel catalogue de vente par correspondance : 
</p>
<p> P 5680 214 Un enfant pourrait en faire autant &#187; , &#171; N ' importe 1.4 qui pourrait en faire autant &#187; , qui &#233;maillent les livres d ' or de tant d ' expo
 M 10562 97  l ' ex - CERES n ' est pas pr&#234;t &#224; signer n ' importe 1.4 quoi ) . 
 A 7637 35 . La terre buvait l ' eau , n ' importe 1.5 ! 
 A 7435 27 ; n ' importe 1.5 ! 
 A 10084 3 . &#187; N ' importe 1.5 ! 
 A 8069 3 . N ' importe 1.5 ! cette fin du monde , si lointaine qu ' elle f&#251;t , les assombrit - - et c&#244;te &#224; c
 A 7915 6 . - - &#171; N ' importe 1.5 ! il en a besoin ! 
 A 8315 3 . N ' importe 1.5 ! ils devaient le rendre . 
 O 9677 23xigeaient un charbon de qualit&#233; qu ' il fallait importer 2.1 , alors que les centrales EDF acceptent tous les charbons ) , cette affirma
 O 8754 73 . En 1913 , il fallait d&#233;j&#224; importer 2.1 5 000 000 tonnes de premi&#232;re qualit&#233; ( cribl&#233;s 3 / 4 gras et tout - venant g
 O 8721 89rds sont consomm&#233;s alors que , dit - il , on importe 2.1 6 milliards de francs de charbon pour la traction &#224; vapeur . 
</p>
<p> O 8754 12 de charbon de premi&#232;re qualit&#233; qu ' il faut importer 2.1 &#224; prix fort , le chemin de fer fran&#231;ais a besoin de plus en plus d ' &#233;nergie p
 O 8730 27st toujours li&#233; au prix du charbon qu ' il faut importer 2.1 car les locomotives &#224; vapeur des r&#233;seaux fran&#231;ais exigent un charbon de
 O 3361 65calement est moins co&#251;teux que ce qui est import&#233; 2.1 d ' Europe . 
</p>
<p> O 3343 45 d ' Argentine qui souhaitait ne plus avoir &#224; importer 2.1 de pare - chocs en plastique . 
 O 3073 121cialistes de n ' importe o&#249; , on ne peut pas importer 2.2 toute la population . 
</p>
<p> P 8007 111e , maire socialiste &#233;lu en 1977 , d&#233;cide d ' importer 2.3 acteurs et structures culturels qui font d&#233;faut &#224; la cit&#233; . 
 M 3511 90 . C ' est l ' am&#233;ricain Dell qui a import&#233; 2.3 cette m&#233;thode en France . 
 O 1976 16m&#233;thodologie aux sciences naturelles et l ' importent 2.3 dans le domaine de la critique litt&#233;raire ou artistique voire dans leur techn
</p>
<p> P 4787 95 . Il est , certes , impossible d ' importer 2.3 directement la robe d&#233;contract&#233;e et d&#233;collet&#233;e mais il est possible , une f
 A 1214 14  - - Une fameuse mode , dit Joe , et que j ' importerai 2.3 en Angleterre ; 
 O 2279 222 la m&#233;thode et le vocabulaire de Darwin et importer 2.3 l ' id&#233;e d ' &#233;volution dans les sciences &#233;conomiques et historiques . 
</p>
<p> O 2191 25es organicistes , une sociobiologie , mais il importe 2.3 un vocabulaire et une m&#233;thode propres aux sciences naturelles vers les s</p>

</div></div>
</body></html>