<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Du texte vers le sens en analyse par contraintes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2001, Tours, 2-5 juillet 2001
</p>
<p>Du texte vers le sens en analyse par contraintes
</p>
<p>Francis Brunet-Manquat
</p>
<p>GETA-CLIPS-IMAG (UJF &amp; CNRS)
BP 53 - 38041 Grenoble Cedex 9, France
</p>
<p>Courriel : Francis.Brunet-Manquat@imag.fr
</p>
<p>R&#233;sum&#233; - Abstract
Les progr&#232;s r&#233;alis&#233;s ces derni&#232;res ann&#233;es dans le domaine du traitement automatique des langues
naturelles (TALN) ouvrent la voie &#224; des traitements encore plus sophistiqu&#233;s dans lesquels la
s&#233;mantique devrait tenir une place centrale. Notre objectif, &#224; long terme, est de r&#233;aliser un
analyseur texte vers sens s'appuyant sur la th&#233;orie Sens-Texte d'Igor Mel'cuk. Cette analyse
viserait une compr&#233;hension plus approfondie du texte, permettant donc d'atteindre une
repr&#233;sentation de niveau s&#233;mantique, et une grande robustesse face &#224; des entr&#233;es plus ou moins
bien form&#233;es telles que celles issues de dialogues oraux. Mais renverser la th&#233;orie Sens-Texte
passe par la d&#233;finition et la mise en &#339;uvre de structures de donn&#233;es et d'algorithmes sp&#233;cifiques
pour la repr&#233;sentation et la manipulation automatique des informations linguistiques, notamment
des entr&#233;es lexicales. Pour cela, nous proposons l'utilisation du paradigme de programmation par
contraintes qui offre un moyen efficace d'atteindre nos objectifs.
Recent advances in the field of natural language processing allow more sophisticated
treatments in which semantics should play a key role. Our long-term goal is to produce a text
towards meaning analyzer base on Igor Mel'cuk's Meaning-Text Theory (MTT). Such an
analyzer should aim at a deep understanding of the input, producing a semantic
representation. It should, also, be able to handled ill-formed inputs such as the ones produced
by a speech recognizer. To reverse the Meaning-Text Theory we have to define and use specific
data structures and algorithms to represent and handle the linguistic information, in particular
the lexical entries. We investigate the use of the constraint-programming paradigm, which
provides an efficient mean to reach our goals.
</p>
<p>Mots clefs - Keywords
Analyse par contraintes, th&#233;orie Sens-Texte &#8211; constraint parsing, Meaning-Text theory
</p>
<p>1 Introduction
Le domaine du traitement automatique des langues naturelles (TALN) a connu ces derni&#232;res
ann&#233;es un d&#233;veloppement important donnant lieu &#224; la r&#233;alisation d&#8217;applications industrielles et
commerciales solides. Cependant, l&#8217;&#233;tat de l&#8217;art en mati&#232;re de TALN, et notamment en mati&#232;re de
description linguistique, ouvre la voie &#224; des traitements encore plus sophistiqu&#233;s dans lesquels la
s&#233;mantique devrait tenir une place centrale. L'&#233;quipe GETA est notamment impliqu&#233;e dans deux
projets internationaux importants : CSTAR, avec le projet europ&#233;en associ&#233; NESPOLE!
(http://nespole.itc.it) pour la traduction simultan&#233;e de l&#8217;oral et UNL (http://www.unl.ias.unu.edu)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Francis Brunet-Manquat
</p>
<p>pour la traduction de l&#8217;&#233;crit. Ces deux projets se caract&#233;risent par la pr&#233;sence d&#8217;une
repr&#233;sentation pivot des &#233;nonc&#233;s orient&#233;e vers la s&#233;mantique. L'&#233;quipe GETA a toujours fait de la
traduction par transfert multiniveaux, et ces repr&#233;sentations pivots n&#233;cessitent une analyse plus
fine, notamment au niveau s&#233;mantique. Cette analyse viserait une compr&#233;hension approfondie de
l'entr&#233;e, permettant donc d'atteindre une repr&#233;sentation de niveau s&#233;mantique, et une grande
robustesse face &#224; des entr&#233;es plus ou moins bien form&#233;es telles que celles issues de dialogues
oraux. Notre but est dans un premier temps l'int&#233;gration de cet analyseur dans des syst&#232;mes de
dialogue oraux ou &#233;crits, int&#233;grant ou non une traduction (CSTAR), puis dans des syst&#232;mes de
plus large couverture, comme UNL. Pour r&#233;aliser cet analyseur, nous devons nous appuyer sur
une th&#233;orie linguistique solide et universelle (pour pouvoir traiter sinon toutes les langues en tout
cas le plus de langues possibles). La th&#233;orie Sens-Texte d'Igor Mel'cuk [Mel'cuk 1988] semble
ad&#233;quate pour jouer ce r&#244;le ; elle permet de d&#233;crire tous les niveaux linguistiques, de la
morphologie/phon&#233;tique &#224; la s&#233;mantique avec une m&#234;me structure de repr&#233;sentation : les graphes
de d&#233;pendances. De plus, elle accorde une forte importance au lexique et les descriptions
lexicales sont tr&#232;s pr&#233;cises et tr&#232;s structur&#233;es (Dictionnaire Explicatif et Combinatoire : DEC
[Mel'cuk &amp; al. 1981]) et semblent donc se pr&#234;ter &#224; une utilisation informatique. &#192; long terme,
l'objectif est de r&#233;aliser un analyseur Texte vers Sens utilisant cette th&#233;orie avec l'id&#233;e d'avoir un
seul algorithme pour tous les niveaux d'analyse &#233;voqu&#233;s ci-dessus.
</p>
<p>Un des probl&#232;mes essentiels &#224; r&#233;soudre est la m&#233;thode &#224; employer pour r&#233;aliser ce type
d'analyseur. Notre choix s'est port&#233; sur une m&#233;thode d'analyse par contraintes. En fait, tous les
formalismes linguistiques font usage de la notion de contrainte qui indique une propri&#233;t&#233; devant
&#234;tre satisfaite. Les contraintes sont extr&#234;mement utiles &#224; la fois pour repr&#233;senter l'information
linguistique, mais &#233;galement pour en contr&#244;ler le processus d'analyse. C'est la raison qui motive
notre orientation vers un analyseur bas&#233; essentiellement sur le m&#233;canisme de satisfaction de
contraintes.
</p>
<p>&#192; court terme, notre objectif est la conception et la mise en &#339;uvre d'une structure de donn&#233;es
adapt&#233;e au traitement automatique pour les entr&#233;es lexicales inspir&#233;e de la th&#233;orie Sens-Texte et
donc du dictionnaire explicatif et combinatoire (DEC). Cette structure de donn&#233;es doit permettre
&#224; la fois d'&#234;tre utilis&#233;e comme repr&#233;sentation interne &#224; l'analyse mais &#233;galement devra &#234;tre
suffisamment intuitive sur le plan linguistique pour que le linguiste charg&#233; du lexique puisse la
manipuler sans difficult&#233;. Bien entendu, une telle structure a besoin d'outils pour la manipuler,
des outils permettant par exemple la conversion des entr&#233;es du DEC et l'ajout ou la modification
des entr&#233;es lexicales par des linguistes.
</p>
<p>Cet article n'a pas d'autre ambition que de pr&#233;senter la probl&#233;matique de nos futurs travaux de
th&#232;se. Nous proposons dans un premier temps de pr&#233;senter les formalismes sur lesquels nous
nous appuyons pour concevoir un mod&#232;le bas&#233; sur les grammaires de d&#233;pendances. Dans la
seconde partie, nous d&#233;crirons l'analyse par contraintes : ses avantages, le m&#233;canisme sur lequel
elle est fond&#233;e et la repr&#233;sentation des donn&#233;es. Nous terminerons en faisant le point sur les
perspectives et la m&#233;thodologie &#224; employer pour mener ce projet &#224; terme.
</p>
<p>2 Aspects linguistiques
L'originalit&#233; du travail r&#233;side dans l'utilisation d'une th&#233;orie linguistique unique, le mod&#232;le Sens-
Texte sur lequel nous proposons de nous appuyer d'un bout &#224; l'autre de l'analyse. Le probl&#232;me
principal de ce mod&#232;le est qu'il a surtout &#233;t&#233; exploit&#233; jusqu'ici par des programmes de g&#233;n&#233;ration,
car elle est d&#233;lib&#233;r&#233;ment orient&#233;e du sens vers le texte.
</p>
<p>2.1 Fondements th&#233;oriques
L'approche Sens-&gt;Texte (Meaning-text Model), fut mise en &#233;vidence dans les ann&#233;es 1960 par
Alexander K. Zholkovsky et Igor Mel'cuk [Zholkovsky &amp; al. 1965]. Cette approche sert de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Du texte vers le sens en analyse par contraintes
</p>
<p>cadre linguistique aux grammaires de d&#233;pendances. Ce mod&#232;le linguistique met essentiellement
l'accent sur la s&#233;mantique, et plus pr&#233;cis&#233;ment sur le lex&#232;me ; la syntaxe est d&#233;termin&#233;e et
contr&#244;l&#233;e par la repr&#233;sentation s&#233;mantique et les entr&#233;es du dictionnaire. Elle repose sur des
principes g&#233;n&#233;raux applicables &#224; toutes les langues, ce qui la rend universelle, ainsi les
techniques descriptives et les formalismes propos&#233;s s'appliquent &#224; toutes les langues de la m&#234;me
fa&#231;on [Mel'cuk 1988].
Ce mod&#232;le semble &#234;tre un repr&#233;sentant important d'un mouvement qui consid&#232;re comme de plus
en plus importante l'influence du lexique sur la syntaxe et la s&#233;mantique. Outre la clart&#233; des
repr&#233;sentations qui r&#233;sulte des relations de d&#233;pendances, certains ph&#233;nom&#232;nes linguistiques,
comme l'unicit&#233; du sujet d'un verbe, sont exprim&#233;s beaucoup plus simplement. La th&#233;orie Sens-
Texte consid&#232;re le dictionnaire d'une langue comme le point central du mod&#232;le de cette langue, le
dictionnaire &#233;tant vu comme un r&#233;pertoire des significations de la langue [Mel'cuk &amp; al. 1981].
Le dictionnaire utilis&#233; par la th&#233;orie Sens-Texte se nomme le Dictionnaire Explicatif et
Combinatoire (DEC). Une version simplifi&#233;e du DEC est en cours de r&#233;alisation, le DiCo
d'Alain Polgu&#232;re en collaboration avec I. Mel'cuk [Polgu&#232;re 2000], ce dictionnaire &#233;lectronique
est compos&#233; des d&#233;rivations s&#233;mantiques et des collocations du fran&#231;ais. Mais ce projet a pour
objectif la r&#233;alisation d'un dictionnaire g&#233;n&#233;ral public enti&#232;rement g&#233;n&#233;r&#233; &#224; partir du DiCo alors
que notre souci premier est la manipulation interne pour l&#8217;analyse. Il nous faut trouver une
structure de donn&#233;es qui nous permette &#224; la fois d&#8217;obtenir une forme externe facilement mais
&#233;galement une forme interne suffisamment formelle pour autoriser l&#8217;utilisation des entr&#233;es
lexicales par des algorithmes. Les arbres de d&#233;pendance &#224; bulles propos&#233;es par Sylvain Kahane
constituent un bon point de d&#233;part &#224; cette &#233;tude. Ces arbres sont issus des arbres de d&#233;pendance
classiques, ils permettent une meilleure mod&#233;lisation des repr&#233;sentations en rempla&#231;ant les
n&#339;uds par des bulles qui peuvent contenir des sous-bulles li&#233;es &#224; d'autres bulles et ainsi de suite.
Cette structure permet de d&#233;passer certains inconv&#233;nients des grammaires de d&#233;pendance comme
la projectivit&#233;. [Kahane 2000] montre notamment comment ce formalisme peut-&#234;tre exploit&#233; pour
traiter l'extraction de mani&#232;re &#233;l&#233;gante.
</p>
<p>2.2 Vers une structure de donn&#233;es unique
Le premier objectif est donc de d&#233;finir un langage de description lexicale s&#8217;inspirant de la th&#233;orie
Sens-Texte et du formalisme &#224; bulles propos&#233; par Sylvain Kahane. Ce langage devra comporter :
</p>
<p>&#8226; Une forme externe dans un langage standard (type XML) exploitable par des outils
plus ou moins standard pour produire par exemple une forme papier ; cette forme
externe devra &#234;tre suffisamment intuitive sur le plan linguistique pour que le linguiste
charg&#233; de la cr&#233;ation du lexique puisse la manipuler sans difficult&#233;.
</p>
<p>&#8226; Une forme interne (structure de donn&#233;es) manipulable par programme ; elle devra &#234;tre
suffisamment formelle pour autoriser l&#8217;utilisation des entr&#233;es lexicales par un
algorithme d&#8217;analyse capable de faire un traitement du Texte vers le Sens.
</p>
<p>Cette structure de donn&#233;es devra pouvoir d&#233;crire une langue sans &#234;tre contraint par un aspect
proc&#233;dural quelconque. L&#8217;id&#233;e est de repr&#233;senter les informations linguistiques d&#8217;une langue par
un ensemble de contraintes. Tous les formalismes linguistiques font usage de la notion de
contrainte qui indique une propri&#233;t&#233; devant &#234;tre satisfaite. Les grammaires de d&#233;pendance &#224;
bulles se pr&#234;tent bien &#224; une expression sous forme de contraintes (figure 1). En effet, les th&#233;ories
non g&#233;n&#233;ratives, et en particulier les grammaires de d&#233;pendances bas&#233;es sur des r&#232;gles de
correspondance, peuvent s'appuyer sur des th&#233;ories bas&#233;es sur les contraintes en ce qui concerne
la repr&#233;sentation des donn&#233;es linguistiques, ce qui permet de consid&#233;rer l'information sous la
forme d'un ensemble d'&#233;quations [Blache 2000].</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Francis Brunet-Manquat
</p>
<p>D&#233;claration des constituants :
N1 := N(0);
V1 := V[indicatif](0);
laquelle1 := laquelle(1);
B1 := &#957;V; // nucl&#233;us verbal
B2 := &#957;N; // nucl&#233;us nominal
 
</p>
<p>D&#233;claration des relations :
V1 &#8712; B1;
laquelle1 &#8712; B2;
N1 &#8594;[relation] V1;
B1 &#8594;[-100] B2
</p>
<p>N
</p>
<p>Vind
</p>
<p>&#957;V
</p>
<p>laquelle
&#957;N
</p>
<p>rel
</p>
<p>-100
</p>
<p>Figure 1 : Exemple d'une repr&#233;sentation par contraintes1
de la structure &#233;l&#233;mentaire du pronom relatif laquelle
</p>
<p>Les contraintes sont extr&#234;mement utiles &#224; la fois pour repr&#233;senter l'information linguistique, mais
&#233;galement pour contr&#244;ler le processus d'analyse d&#8217;un &#233;nonc&#233;. Dans la suite, nous d&#233;crirons les
avantages et les principes d&#8217;une telle analyse.
</p>
<p>3 Analyse par contraintes
L'utilisation des contraintes dans les syst&#232;mes d'analyse permet de mod&#233;liser les diff&#233;rents
aspects du langage : syntaxe, s&#233;mantique, discours, etc. En plus, elles autorisent l'utilisation d'une
m&#233;thode d'analyse bas&#233;e sur un m&#233;canisme de satisfaction de contraintes. Nous appellerons
cette m&#233;thode l'analyse par contraintes.
</p>
<p>3.1 Caract&#233;ristiques
L'analyse par contraintes s'appuie sur une description de l'information linguistique uniquement
sous forme d'un ensemble de contraintes et sur des m&#233;canismes permettant de propager et
v&#233;rifier la coh&#233;rence d'un tel ensemble [Maruyama 1990] [Blache 2000] [Schr&#246;der &amp; al. 2000].
L'id&#233;e de voir l'analyse de langage naturel comme un m&#233;canisme de satisfaction de contraintes
am&#232;ne de nombreux avantages :
</p>
<p>&#8226; L'approche par contraintes permet une description compl&#232;te des diff&#233;rents niveaux
d'analyse (morphologique, syntaxique, s&#233;mantique, etc.) car la totalit&#233; de l'information
linguistique de l'&#233;nonc&#233; analys&#233; sera repr&#233;sent&#233;e sous la forme d'un ensemble de
contraintes.
</p>
<p>&#8226; Le m&#233;canisme de satisfaction de contraintes permet la manipulation de donn&#233;es
incompl&#232;tes, ce qui favorise l'analyse robuste. Il sera ainsi possible d'analyser
partiellement une phrase mal form&#233;e. Un tel m&#233;canisme semble tr&#232;s efficace pour le
traitement de la parole spontan&#233;e (projet CSTAR).
</p>
<p>&#8226; L'analyse par contraintes offre &#233;galement une tr&#232;s grande souplesse de traitement, car
elle permet de r&#233;gler la granularit&#233; de l'analyse en ne prenant en compte que certaines
contraintes. Il est alors possible de r&#233;aliser des analyses superficielles utilis&#233;es par
exemple par des applications d'extraction d'informations.
</p>
<p>                                                
</p>
<p>1
 Les informations entre crochets servent &#224; sp&#233;cifier la variable ou le type de d&#233;pendance, la valeur binaire entre
</p>
<p>parenth&#232;ses d&#233;termine si le n&#339;ud est de type blanc (0) ou noir (1),</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Du texte vers le sens en analyse par contraintes
</p>
<p>&#8226; La m&#233;thode par contraintes consiste &#224; construire une repr&#233;sentation unique pour
toutes les interpr&#233;tations d'une phrase &#224; analyser. Aucun arbre d'analyse explicite n'est
g&#233;n&#233;r&#233; tant que ce n'est pas n&#233;cessaire. Le processus de satisfaction de contraintes
r&#233;duit les ambigu&#239;t&#233;s structurales sans g&#233;n&#233;rer les arbres d'analyse interm&#233;diaires,
limitant ainsi la combinatoire de l'analyse.
</p>
<p>3.2 Structure de donn&#233;es
La m&#233;thode d'analyse par contraintes s'appuie sur une repr&#233;sentation des informations
linguistiques sous la forme d'un syst&#232;me de contraintes que nous nommerons r&#233;seau de
contraintes. Chaque solution qui satisfait toutes les contraintes simultan&#233;ment correspond a un
unique r&#233;seau de contraintes. L'analyse et les d&#233;sambigu&#239;sations successives s'op&#232;rent en
ajoutant de nouvelles contraintes au r&#233;seau. Notre structure s'inspirera de la th&#233;orie CDG,
Constraint Dependency Grammar, mise au point par Hiroshi Maruyama [Maruyama 1990].
Le r&#233;seau de contraintes doit contenir toutes les structures syntaxiques et s&#233;mantiques implicites.
Il peut &#234;tre repr&#233;sent&#233; comme un graphe de d&#233;pendances (th&#233;orie Sens-Texte). Ce graphe sera
constitu&#233; de plusieurs niveaux de d&#233;pendance en parall&#232;le (syntaxique, s&#233;mantique, auxiliaire,
etc.) [Schr&#246;der &amp; al. 2000]. Chaque niveau sera construit dans un m&#234;me temps, et sera reli&#233; aux
autres pour permettre une analyse plus pertinente. Donc la totalit&#233; de l'information extraite de
l'&#233;nonc&#233; &#224; analyser sera contenue dans une unique structure de donn&#233;e. Les n&#339;uds du graphe
sont appel&#233;s des r&#244;les. Un mot de l'&#233;nonc&#233; correspond &#224; un r&#244;le pour chaque niveau. Chacun
des r&#244;les sera associ&#233; &#224; un ensemble d'&#233;quations, appel&#233; domaine, correspondant aux contraintes
pouvant lui &#234;tre appliqu&#233;es. La structure ainsi obtenue correspondra &#224; un &#233;norme ensemble de
contraintes (figure 2). Il faudra ensuite propager et v&#233;rifier la coh&#233;rence d'un tel ensemble &#224; l'aide
d'un m&#233;canisme de satisfaction de contraintes.
</p>
<p>Rle Rchien
</p>
<p>Rcourt
</p>
<p>{ &#8226; D&#233;terminant &#8594; Rchien } { &#8226; Nom
   &#8226; Sujet &#8594; (Rcourt:Verbe)}
</p>
<p>{ &#8226; Verbe
   &#8226; Adjectif &#8594; (Rchien:Nom) }
</p>
<p>R&#244;le Domaine
Contraintes pouvant &#234;tre appliqu&#233;es au r&#244;le R
</p>
<p>chien
</p>
<p>Figure 2 : R&#233;seau de contraintes de la phrase &quot;le chien court&quot; au niveau syntaxique
</p>
<p>3.3 Satisfaction de contraintes
Le m&#233;canisme de satisfaction de contraintes consiste &#224; v&#233;rifier la satisfaisabilit&#233; (la consistance)
d'un ensemble de contraintes. Pour cela, aucun processus de d&#233;rivation n'est n&#233;cessaire pour
contr&#244;ler la structure d'un &#233;nonc&#233;. Ce m&#233;canisme est constitu&#233; de trois &#233;tapes : Former le r&#233;seau
de contraintes initial, propager les contraintes, c'est-&#224;-dire lier certains r&#244;les entre eux &#224; l'aide des
contraintes et v&#233;rifier la consistance. Si la consistance n'est pas v&#233;rifi&#233;e, enlever les
inconsistances locales, c'est-&#224;-dire les contraintes ne satisfaisant pas &#224; tous les r&#244;les, et
recommencer la propagation de contraintes jusqu'&#224; obtenir un r&#233;seau consistant. Au final, la
structure obtenue contiendra la description de l'&#233;nonc&#233; avec toutes les interpr&#233;tations possibles.
</p>
<p>La satisfaction de contraintes reste un processus tr&#232;s lourd en terme de complexit&#233;
algorithmique, nous devrons donc trouver des strat&#233;gies d&#8217;analyse dans les processus de
propagation de contraintes et de v&#233;rification de consistance pour rendre l&#8217;analyse efficace.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Francis Brunet-Manquat
</p>
<p>4 Perspectives
L&#8217;un des objectifs &#224; atteindre est la r&#233;utilisabilit&#233;, aussi bien en terme de lexique que d&#8217;analyse.
La r&#233;utilisabilit&#233; des donn&#233;es est un point essentiel, l&#8217;id&#233;e est de permettre l&#8217;utilisation, l&#8217;ajout
d&#8217;entr&#233;e et l&#8217;augmentation du lexique &#224; long terme. Il faut donc pr&#233;voir une structure capable
d&#8217;&#233;voluer dans le temps sans perte d&#8217;informations. Cette structure permettra la construction
incr&#233;mentale de lexiques, tendant vers des bases lexicales desquelles on peut extraire des
lexiques d&#8217;applications. L&#8217;analyseur pourrait &#234;tre &#233;galement r&#233;utilis&#233; pour diff&#233;rentes langues,
pour diff&#233;rents types d&#8217;analyse (extraction d&#8217;informations, analyse syntaxique, analyse
s&#233;mantique de texte).
Pour arriver &#224; nos fins, notre d&#233;marche de travail sera constitu&#233;e de trois &#233;tapes. La premi&#232;re
&#233;tape sera de terminer notre &#233;tude du DEC et du DiCo. Cette &#233;tude doit nous amener &#224; d&#233;finir
(ou simplement choisir parmi celle qui existe) une structure de repr&#233;sentation informatique du
DEC qui corresponde &#224; nos besoins. Nous utiliserons cette structure pour d&#233;velopper une
version informatique du DEC qui sera int&#233;gr&#233;e &#224; la base Papillon, une base lexicale pour le
fran&#231;ais et le japonais bas&#233; sur des dictionnaires monolingues et des liens interlingues [Mangeot
2000]. La seconde &#233;tape sera de r&#233;aliser des outils de manipulation pour cette structure, des
&#233;diteurs et des analyseurs. Nous devrons d&#233;velopper des algorithmes efficaces permettant la
propagation de contraintes dans des temps raisonnables sans trop restreindre le pouvoir
d'expression des contraintes. La derni&#232;re &#233;tape constituera &#224; tester ces outils dans le cadre
d&#8217;application pilote tels qu&#8217;UNL et CSTAR sur un lexique du fran&#231;ais.
</p>
<p>R&#233;f&#233;rences
[Blache 2000] Blache P. (2000), Le r&#244;le des contraintes dans la th&#233;ories linguistiques et leur
int&#233;r&#234;t pour l'analyse automatique : les Grammaires de propri&#233;t&#233;s, Proc. TALN-2000, pp. 41-
50.
[Brunet-Manquat 2000] Brunet-Manquat F. (2000), Programmation par contraintes pour
l'analyse de d&#233;pendances, Rapport de DEA, UJF et INPG, 13 juin 2000.
[Kahane 2000] Kahane S. (2000), Extractions dans une grammaire de d&#233;pendance &#224; bulles.
41/1, pp. 187-216.
[Mangeot 2000] Mangeot M. (2000), Papillon Lexical Database Project: Monolingual
Dictionaries &amp; Interlingual Links, Proc. WAINS'7, 7th Workshop on Advanced Information
Network and System, Bangkok, Thailand.
[Maruyama 1990] Maruyama H. (1990), Structural disambiguation with constraint
propagation. Annnual Meeting of the ACL, 28/pp. 31-38.
[Mel'cuk &amp; al. 1981] Mel'cuk I., Iordanskaja L. &amp; Arbatchewsky-Jumarie N. (1981), Un
nouveau type de dictionnaire: le dictionnaire explicatif et combinatoire du fran&#231;ais
comtemporain (six articles de dictionnaire). Cahiers de lexicographie, 38/1, pp. 3-34.
[Mel'cuk 1988] Mel'cuk I. (1988), Dependency syntax: theory and practice. State University
of New-York Press.
[Polgu&#232;re 2000] Polgu&#232;re A. (2000), Towards a theoretically-motived general public
dictionnary of semantic derivations and collocations for french, Proc. EURALEX'2000, pp.
517-527.
[Schr&#246;der &amp; al. 2000] Schr&#246;der I., Menzel W., Foth K. &amp; Schulz M. (2000), Modeling
Dependency Grammars with Restricted Constraints. Traitement Automatique des Langues,
41/1, pp. 97-126.
[Zholkovsky &amp; al. 1965] Zholkovsky A. &amp; Mel'cuk I. (1965), On a Possible Method and
instruments for Semantic Synthesis (of Texts). 6/pp. 23-28.</p>

</div></div>
</body></html>