<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse s&#233;mantique dans un syst&#232;me de question-r&#233;ponse</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2001, Tours, 2-5 juillet 2001
</p>
<p>Analyse s&#233;mantique
dans un syst&#232;me de question - r&#233;ponse.
</p>
<p>Laura Monceaux
</p>
<p>LIMSI-CNRS, BP 133, Bat 508, 91403 Orsay Cedex
Laura.Monceaux@limsi.fr
</p>
<p>R&#233;sum&#233;
Dans cet article, nous pr&#233;sentons le syst&#232;me QALC (Question Answering Langage Cognition)
qui a particip&#233; &#224; la t&#226;che Question R&#233;ponse de la conf&#233;rence d&#8217;&#233;valuation TREC. Ce syst&#232;me a
pour but d&#8217;extraire la r&#233;ponse &#224; une question d&#8217;une grande masse de documents. Afin
d&#8217;am&#233;liorer les r&#233;sultats de notre syst&#232;me, nous avons r&#233;fl&#233;chi &#224; la n&#233;cessit&#233; de d&#233;velopper,
dans le module d&#8217;analyse, le typage des questions mais aussi d&#8217;introduire des connaissances
syntaxico-s&#233;mantiques pour une meilleure recherche de la r&#233;ponse.
</p>
<p>Abstract
In this paper, we present the QALC system that participated to the Question Answering track of
the TREC evaluation conference. This system extracts the answer to the question from a large
amount of documents. In order to improve the result of our system, it is necessary to develop,
in the question analysis module, the search of question type and to introduce a semantic
knowledge.
</p>
<p>Mots Cl&#233;s : Analyse syntaxico-s&#233;mantique, syst&#232;me question &#8211; r&#233;ponse
Key Words : Semantic analysis, question &#8211; answering system
</p>
<p>1 Introduction
Dans le cadre de la conf&#233;rence d&#8217;&#233;valuation TREC (Text REtrieval Conference), le groupe LIR
(Langues, Information, Repr&#233;sentations) a pr&#233;sent&#233;, depuis deux ann&#233;es, un syst&#232;me pour la
t&#226;che Question Answering, QALC (Ferret et al, 2000). Ce syst&#232;me a pour but d&#8217;extraire la
r&#233;ponse &#224; une question d&#8217;une grande masse de documents. L&#224; o&#249; un syst&#232;me de recherche
d&#8217;informations renvoie une liste de documents pouvant contenir la r&#233;ponse, un syst&#232;me de
question &#8211; r&#233;ponse renverra une liste courte de r&#233;ponses d&#8217;une ou deux phrases. A la conf&#233;rence
TREC 2000, le syst&#232;me QALC a r&#233;alis&#233; les scores suivants :
</p>
<p>&#8226; TREC 2000 &#8211; r&#233;ponses en 250 caract&#232;res : 55 % des questions r&#233;solues &#8211; 6&#232;me syst&#232;me
sur 25
</p>
<p>&#8226; TREC 2000 &#8211; r&#233;ponses en 50 caract&#232;res : 26,7 % des questions r&#233;solues &#8211; 19&#232;me
syst&#232;me sur 24</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Monceaux Laura
</p>
<p>L&#8217;un des buts que nous proposons pour am&#233;liorer le syst&#232;me QALC pour des r&#233;ponses en 50
caract&#232;res est d&#8217;introduire une analyse des questions plus pouss&#233;e en utilisant des connaissances
s&#233;mantiques. L&#8217;analyse d&#8217;une question dans un syst&#232;me,  tel que QALC, doit fournir
classiquement deux types d&#8217;information :
</p>
<p>&#8226; le type attendu de la r&#233;ponse (un nom de personne, un nombre, par exemple)
</p>
<p>&#8226; les termes importants de la question &#224; retrouver dans la r&#233;ponse.
</p>
<p>En effet, comme on peut le voir dans l&#8217;architecture du syst&#232;me QALC (figure 1), les diff&#233;rents
termes extraits de l&#8217;analyse sont utiles pour la r&#233;-indexation et la s&#233;lection des documents
r&#233;alis&#233;es par FASTR (Jacquemin, 1999) et le type attendu de la r&#233;ponse ainsi que les termes
permettent de tester l&#8217;appariement entre la question et la r&#233;ponse afin de s&#233;lectionner la meilleure
r&#233;ponse.
</p>
<p>Analyse des
 questions
</p>
<p>Moteur de
recherche
</p>
<p>Reconnaissance des entit&#233;s nomm&#233;es
</p>
<p>Phrases annot&#233;es : types d&#8217;entit&#233; nomm&#233;e et
indexation par les termes et variantes Vocabulaire &amp;
</p>
<p>fr&#233;quences
</p>
<p>Appariement Question/Phrase
</p>
<p>S&#233;quence ordonn&#233;e de 250 et 50
caract&#232;res
</p>
<p>Types des questions : 
type d&#8217;entit&#233; nomm&#233;e
</p>
<p>CorpusQuestions
</p>
<p>R&#233;-indexation et s&#233;lection des documents (FASTR)
</p>
<p>Documents s&#233;lectionn&#233;sTermes
</p>
<p>Sous-ensemble de documents pond&#233;r&#233;s
</p>
<p>Figure 1 : Architecture du syst&#232;me QALC
Ainsi actuellement, pour la question &#171; What was the name of the first Russian astronaut to do a
spacewalk ? &#187;, la recherche de la r&#233;ponse est faite par appariement entre les termes de la
question (&#171; first &#187;, &#171; Russian &#187;, &#171; astronaut &#187;, &#171; spacewalk &#187;) et le type attendu de la
r&#233;ponse (une Personne) d&#8217;une part, et les phrases des documents d&#8217;autre part. Mais les liens
syntaxiques et s&#233;mantiques qui existent entre les diff&#233;rents termes ne sont pas du tout pris en
compte.
</p>
<p>Notre but est donc d&#8217;&#233;tendre l&#8217;analyse des questions d&#8217;une part en am&#233;liorant le module de
typage quand le type de r&#233;ponse attendu ne correspond pas &#224; une entit&#233; nomm&#233;e d&#233;celable et
d&#8217;autre part d&#8217;utiliser les liens entre les diff&#233;rents termes obtenus. Ainsi dans notre exemple,
savoir que l&#8217;on recherche le nom d&#8217;une personne de nationalit&#233; russe, qui a pour m&#233;tier d&#8217;&#234;tre
astronaute, et qui a &#233;t&#233; le premier &#224; faire une sortie dans l&#8217;espace, ne peut que nous aider &#224;
s&#233;lectionner plus facilement la meilleure r&#233;ponse dans les documents s&#233;lectionn&#233;s. On a pu
remarquer d&#8217;ailleurs que les meilleurs syst&#232;mes, d&#232;s la premi&#232;re &#233;valuation de TREC,
comportaient un module d&#8217;analyse des questions et que l&#8217;ann&#233;e pr&#233;c&#233;dente, ils ont introduit des
connaissances s&#233;mantiques &#224; celui ci.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse s&#233;mantique dans un syst&#232;me question- r&#233;ponse.
</p>
<p>2 Recherche de la r&#233;ponse
</p>
<p>2.1 Typage des questions
Le premier objectif de notre analyse des questions est de d&#233;finir le type attendu de la r&#233;ponse.
Selon la question, le type recherch&#233; sera plus ou moins facile &#224; d&#233;tecter.
</p>
<p>2.1.1 R&#233;ponses du type &#171; entit&#233; nomm&#233;e &#187;
</p>
<p>On essaye, dans un premier temps, d&#8217;attribuer &#224; la question une ou plusieurs &#233;tiquettes
(cat&#233;gories s&#233;mantiques) correspondant au type attendu de la r&#233;ponse gr&#226;ce &#224; la reconnaissance
d&#8217;un certain nombre d&#8217;indices pr&#233;sents dans la phrase. Une hi&#233;rarchie des cat&#233;gories
s&#233;mantiques des types de r&#233;ponses possibles a &#233;t&#233; construite manuellement (Figure 2).
</p>
<p>NomPropre Fonction ExpressionTemps Nombre
</p>
<p>Ville Endroit
</p>
<p>Entit&#233; nomm&#233;e Entit&#233; num&#233;rique
</p>
<p>Entit&#233;
</p>
<p>Personne Organisation Age Date P&#233;riode Heure Physique Longueur Poids Volume FinancierLieu
</p>
<p>Figure 2 : Hi&#233;rarchie des types de r&#233;ponses et cat&#233;gories s&#233;mantiques
</p>
<p>On essaye donc d&#8217;associer &#224; la question une ou plusieurs &#233;tiquettes s&#233;mantiques :
</p>
<p>&#8226; PERSONNE : Who is the richest person in the World ?
</p>
<p>&#8226; VILLE, ENDROIT : Where is Taj Mahal ?
Pour d&#233;terminer ces &#233;tiquettes, plusieurs r&#232;gles d&#233;crivant les diff&#233;rentes formes que peuvent
prendre les questions ont &#233;t&#233; &#233;crites, en voici quelques exemples :
</p>
<p>&#8226; le type de la r&#233;ponse ne d&#233;pend que du pronom interrogatif : where (VILLE,
ENDROIT), who / whom / whose (PERSONNE), when (DATE).
</p>
<p>Exemple : Who is Martin Luther King ? (PERSONNE)
</p>
<p>&#8226; le type de la r&#233;ponse est d&#233;termin&#233; gr&#226;ce &#224; la cat&#233;gorie s&#233;mantique du nom de t&#234;te du
groupe nominal pour les questions de la forme :
</p>
<p>- what / which &#8230; be GNSem
</p>
<p>- what / which GNSem</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Monceaux Laura
</p>
<p>- what / which is the name of GNSem
</p>
<p>- how much / many GNSem
</p>
<p>o&#249; GNSEM est de la forme : (Det) (Adj | N | Vbg | Vbc)* Nsem.
Exemple : What city in Florida is Sea World in ? (VILLE)
</p>
<p>&#8226; le choix de l&#8217;&#233;tiquette est d&#233;termin&#233; en fonction de la cat&#233;gorie auquel appartient
l&#8217;adjectif :  how AdjSem &#8230;
</p>
<p>Exemple : How old are you ? (DATE)
On essaye donc dans un premier d&#8217;appliquer l&#8217;une de ces r&#232;gles &#224; partir du d&#233;but de la question.
Ces diff&#233;rentes r&#232;gles ont &#233;t&#233; impl&#233;ment&#233;es dans QALC et permettent d&#8217;&#233;tiqueter environ 60 %
des 700 questions de TREC9. Cependant certains GNSem ne peuvent &#234;tre associ&#233;s &#224; une
cat&#233;gorie s&#233;mantique ; ainsi pour certaines questions, l&#8217;association d&#8217;une &#233;tiquette (entit&#233;
nomm&#233;e) est difficile.
</p>
<p>2.1.2 Autres types de r&#233;ponses
</p>
<p>Pour la phrase &#171; What flower did Vincent Van Gogh paint ? &#187;, aucune cat&#233;gorie s&#233;mantique
ne peut &#234;tre associ&#233;e au GNSem &#171; flower &#187; : ce n&#8217;est ni une personne, ni une date, ni un
nombre, ni un lieu&#8230; Dans ce cas, le type de r&#233;ponse attendu n&#8217;est plus une entit&#233; nomm&#233;e mais
plut&#244;t un nom commun voire une phrase. Ainsi le typage de cette r&#233;ponse est beaucoup plus
complexe. Pour palier ce probl&#232;me, on envisage d&#8217;introduire la notion de focus qui a &#233;t&#233;
propos&#233;e par Wendy Lenhert (1979) : elle d&#233;finit le focus de la question comme un concept qui
exprime les attentes exprim&#233;es dans la question. Pour notre exemple, notre focus correspondra
au concept &#171; flower &#187;. Dans notre syst&#232;me, on consid&#232;re que le focus peut &#234;tre soit un nom
soit un groupe de mots voire &#233;ventuellement un ensemble de mots que l&#8217;on devrait retrouver
dans la r&#233;ponse.  Plusieurs r&#232;gles pour d&#233;terminer ce focus seront &#233;crites comme pour les
questions attendant une entit&#233; nomm&#233;e :
</p>
<p>&#8226; pour les phrases : What GNSem &#8230;, le focus sera le concept t&#234;te du GNSem voir le
GNSem entier.
</p>
<p>Exemple : What video format was an alternative to VHS ? (VIDEO
FORMAT)
</p>
<p>&#8226; pour les questions de la forme : Who Aux GNSem ?, le focus correspondra au
concept associ&#233; au GNSem
</p>
<p>Exemple : Who is the prime minister of France ? ( PRIME MINISTER
OF FRANCE )
</p>
<p>&#8226; etc.
</p>
<p>On pourra par la suite pour l&#8217;appariement du type attendu et des r&#233;ponses candidates utiliser les
connaissances de WordNet notamment la hi&#233;rarchie des mots (hyponymes) mais aussi les
synonymes afin de voir si les r&#233;ponses candidates sont compatibles avec le focus et le type
attendu de la r&#233;ponse.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse s&#233;mantique dans un syst&#232;me question- r&#233;ponse.
</p>
<p>2.2 Appariement question / r&#233;ponse
Ce module permet de choisir parmi une liste de r&#233;ponses retenues par FASTR la meilleure
r&#233;ponse &#224; notre question. Actuellement, dans chacun des documents s&#233;lectionn&#233;s, les entit&#233;s
nomm&#233;es ainsi que les occurrences des termes de la question et leurs variations ont &#233;t&#233; rep&#233;r&#233;es
et marqu&#233;es. La comparaison entre la question et les r&#233;ponses candidates est r&#233;alis&#233;e gr&#226;ce &#224; un
vecteur poss&#233;dant 3 types d&#8217;&#233;l&#233;ments : les mots pleins, les termes de la question et les entit&#233;s
nomm&#233;es, chaque &#233;l&#233;ment &#233;tant pond&#233;r&#233;s en fonction de son importance par rapport aux autres
(Ferret et al., 2000).
</p>
<p>Exemple :
</p>
<p>Question : How many people watch network television ?(NUMBER)
R&#233;ponse : &lt;b_numex_type = NUMBER&gt; 2100 &lt;e_numex&gt; people
watch network television.
</p>
<p>La recherche de la meilleure r&#233;ponse est donc faite par appariement entre, d&#8217;une part les mots
des phrases candidates et d&#8217;autre part les termes de la question et le type attendu de la r&#233;ponse.
Nous envisageons, pour le syst&#232;me de cette ann&#233;e, de comparer notre question et nos phrases
candidates gr&#226;ce &#224; leur repr&#233;sentation s&#233;mantique, c&#8217;est &#224; dire prendre en compte les liens
s&#233;mantiques entre les diff&#233;rents termes. Ainsi pour la phrase &#171; What was the name of the first
Russian astronaut to do a spacewalk ? &#187;, nous d&#233;terminerons les termes importants (&#8220;first&#8221;,
&#8220;Russian&#8221;, &#8220;astronaut&#8221;, &#8221;spacewalk&#8221;) mais nous aurons aussi des liens entre ces termes pour
&#233;liminer les mauvaises r&#233;ponses : on devra trouver le nom d&#8217;un astronaute qui a pour
caract&#233;ristique d&#8217;&#234;tre russe et d&#8217;&#234;tre le premier &#224; avoir fait une sortie dans l&#8217;espace. Par exemple,
gr&#226;ce aux liens s&#233;mantiques, la r&#233;ponse &#171; l&#8217;astronaute am&#233;ricain X a particip&#233; &#224; la premi&#232;re
sortie russe spatiale de cette fus&#233;e &#187; sera &#233;limin&#233;e, car on ne parle pas d&#8217;une premi&#232;re sortie
russe mais d&#8217;un premier astronaute russe. En effet nous avons constat&#233; que pour certaines
questions l&#8217;appariement question &#8211; r&#233;ponse sur les liens auraient permis de r&#233;pondre
correctement &#224; la question et donc d&#8217;&#233;liminer les phrases candidates qui ne contiennent pas la
r&#233;ponse attendue. Pour prendre en compte les liens entre les termes des questions, nous avons
commenc&#233; &#224; d&#233;velopper un analyseur syntaxico-s&#233;mantique.  
</p>
<p>3 Notre analyseur syntaxico-s&#233;mantique
</p>
<p>3.1 Quel analyseur syntaxique ?
Avant de travailler sur la repr&#233;sentation s&#233;mantique d&#8217;une phrase, nous avons choisi d&#8217;en
&#233;tudier la syntaxe. Gr&#226;ce au recueil des questions des ann&#233;es pr&#233;c&#233;dentes, nous avons
commenc&#233; &#224; &#233;tudier les sorties obtenues par diff&#233;rents analyseurs syntaxiques
comme l&#8217;analyseur IFSP de Xerox (A&#239;t-Mokhtar S and Chanod J, 1997), l&#8217;analyseur Link
Grammar, l&#8217;analyseur Sylex, l&#8217;analyseur IPS de Gen&#232;ve (Wehrli, 1992), etc &#8230; Il s&#8217;agit ici
pour nous de regarder si la segmentation des phrases et les d&#233;pendances extraites peuvent nous
aider &#224; construire une repr&#233;sentation s&#233;mantique correcte. Cette &#233;valuation est en cours, mais
pour des raisons pratiques, nous avons d&#233;cid&#233; d&#8217;utiliser l&#8217;analyseur de Xerox. Cependant, nous
envisageons de r&#233;aliser un analyseur s&#233;mantique utilisable avec n&#8217;importe quel analyseur
syntaxique. Voici un exemple de sorties que nous aurons &#224; utiliser, il s&#8217;agit ici des sorties
obtenues par l&#8217;analyseur IFSP (A&#239;t-Mokhtar and Chanod, 1997) de Xerox :
</p>
<p>Exemple :
INVSUBJ (be, valley), NNPREP (valley, of, king) &#8230;
[SC Where :v is SC] [NP the valley NP] [PP of the king PP] ?</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Monceaux Laura
</p>
<p>Notre but ne sera pas forc&#233;ment de r&#233;aliser une analyse syntaxico-s&#233;mantique compl&#232;te de nos
phrases mais &#233;ventuellement de proposer des morceaux de repr&#233;sentation qui nous aideront tout
de m&#234;me &#224; rechercher la meilleure r&#233;ponse. Ainsi nous avons d&#233;cid&#233; d&#8217;utiliser un analyseur
syntaxique partiel qui a l&#8217;avantage, m&#234;me si la phrase est mal formul&#233;e, d&#8217;extraire des
informations syntaxiques, plut&#244;t qu&#8217;un analyseur complet qui, si la phrase est mal formul&#233;e ou
trop complexe, arr&#234;tera son analyse. Dans le cadre de notre participation &#224; la t&#226;che question -
r&#233;ponse de la conf&#233;rence TREC, nous allons travailler sur des questions &#8211; r&#233;ponses en anglais.
Le travail que j&#8217;ai effectu&#233; pr&#233;c&#233;demment sur l&#8217;&#233;laboration d&#8217;un analyseur syntaxico-s&#233;mantique
pour le fran&#231;ais, pour des phrases issues de dialogue int&#233;grant du langage et des gestes
(Monceaux, 2000), pourra &#234;tre r&#233;utilis&#233; pour atteindre notre objectif.  En effet certaines r&#232;gles
ont &#233;t&#233; &#233;crites &#224; partir des connaissances syntaxiques obtenues : par exemple, dans la plupart
des cas, le sujet de la phrase correspond &#224; l&#8217;agent du verbe. Nous avions d&#233;montr&#233; alors
l&#8217;avantage d&#8217;utiliser un analyseur partiel pour des phrases issues de dialogue, or l&#8217;une des
&#233;volutions envisag&#233;e pour la conf&#233;rence TREC est d&#8217;introduire la notion de dialogue.
</p>
<p>3.2 Quel formalisme de repr&#233;sentation s&#233;mantique ?
Lors de notre pr&#233;c&#233;dente &#233;tude, nous avions d&#233;cid&#233; de repr&#233;senter nos phrases, que ce soit des
questions, des r&#233;ponses ou tout autre phrase, au moyen du  formalisme des graphes conceptuels
(Sowa, 1983). Les graphes conceptuels sont des graphes bipartites, connexes, finis poss&#233;dant
deux sortes de n&#339;uds : des n&#339;uds concept et des n&#339;uds relation. Un n&#339;ud concept se
repr&#233;sente sous la forme suivante [type : r&#233;f&#233;rent] o&#249; le type est la classe caract&#233;risant les
individus et o&#249; le r&#233;f&#233;rent sp&#233;cifie les individus du monde de r&#233;f&#233;rence d&#233;sign&#233; par le concept.
Les n&#339;uds relations permettent quant &#224; eux de savoir comment les n&#339;uds concepts peuvent &#234;tre
inter-connect&#233;s. Ainsi pour une phrase comme &#171; What was the name of the first Russian
astronaut to do a spacewalk ? &#187;, on doit obtenir la repr&#233;sentation suivante :
</p>
<p>Figure 3 : Repr&#233;sentation s&#233;mantique id&#233;ale de la phrase :
&#171;  What was the name of the first Russian astronaut to do a spacewalk ? &#187;
</p>
<p>Pour obtenir une telle repr&#233;sentation, j&#8217;ai &#233;crit un algorithme qui utilise notamment les
diff&#233;rentes op&#233;rations qui peuvent &#234;tre r&#233;alis&#233;es sur les graphes conceptuels : copie, restriction,
simplification et jointure. Mais cet algorithme requiert un certain nombre de connaissances
comme des graphes canoniques (qui donne des contraintes sur les liens s&#233;mantiques entre deux
concepts), le treillis des concepts (qui propose une hi&#233;rarchie des concepts) ... Pour l&#8217;instant,
nous ne poss&#233;dons pas de base compl&#232;te de ces connaissances ni en fran&#231;ais ni en anglais :
cette &#233;tude des connaissances est longue et fastidieuse &#224; r&#233;aliser. D&#8217;ailleurs, de nombreuses
&#233;tudes permettant l&#8217;apprentissage automatique de ces connaissances sont en cours. Ainsi, pour
une application concernant un domaine limit&#233;, l&#8217;&#233;laboration des connaissances n&#233;cessaires est
possible mais pour une application telle que la t&#226;che question &#8211; r&#233;ponse propos&#233;e &#224; la conf&#233;rence
TREC, cela s&#8217;av&#232;re difficile car les questions propos&#233;es couvrent de nombreux domaines. Nous
</p>
<p>Astronaute Nom : ?caracNationalit&#233; 
: russe
</p>
<p>agnt
</p>
<p>Do Spacewalktheme
</p>
<p>  tpsDate
</p>
<p>Premier
</p>
<p>carac
</p>
<p>carac</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse s&#233;mantique dans un syst&#232;me question- r&#233;ponse.
</p>
<p>essayerons donc gr&#226;ce &#224; des connaissances limit&#233;es mais disponibles d&#8217;&#233;laborer une
repr&#233;sentation s&#233;mantique sous forme de graphes conceptuels et donc de modifier l&#8217;algorithme
&#233;crit pour les phrases en fran&#231;ais issues de dialogue.
</p>
<p>3.3 Quelles connaissances &#224; notre disposition ?
Pour int&#233;grer un analyseur syntaxico-s&#233;mantique dans le syst&#232;me propos&#233; cette ann&#233;e &#224; la
conf&#233;rence TREC, nous avons donc d&#233;cid&#233; d&#8217;utiliser des connaissances moins compl&#232;tes mais
accessibles. Pour l&#8217;anglais, une base de donn&#233;es lexicales a &#233;t&#233; &#233;labor&#233;e par un ensemble de
psycholinguistes et d&#8217;informaticiens &#224; l&#8217;Universit&#233; de Princeton : WordNet (Fellbaum, 1998)
(resp. EuroWordNEt pour le fran&#231;ais). Les relations d&#8217;hyponymie et de synonymie d&#233;velopp&#233;es
dans cette base permettront notamment de nous aider dans l&#8217;&#233;laboration de notre analyseur pour
par exemple &#233;tendre notre question gr&#226;ce aux synonymes des diff&#233;rents termes de la question,
de regarder si un terme appartient &#224; une des cat&#233;gories s&#233;mantiques de notre hi&#233;rarchie, etc.
</p>
<p>Exemple : What actress starred in &#171; The Lion in Winter &#187; ?
Type attendu : PERSONNE car la relation d&#8217;hyperonymie de WordNet
renvoie : Actress
</p>
<p>&#232; Actor, player, role player
&#232; Performer, Performing artist
&#232; Entertainer
&#232; Person, individual, someone &#8230;
</p>
<p>En utilisant les connaissances de WordNet et des connaissances que nous ajouterons, comme
par exemple les diff&#233;rentes r&#232;gles de typage des questions, mais aussi en utilisant les sorties de
l&#8217;analyseur syntaxique partiel choisi, nous &#233;laborerons une repr&#233;sentation ad&#233;quate de nos
phrases.
</p>
<p>4 Conclusion
Nous proposons donc dans cet article d&#8217;am&#233;liorer le syst&#232;me QALC propos&#233; l&#8217;ann&#233;e derni&#232;re &#224;
la conf&#233;rence d&#8217;&#233;valuation TREC en am&#233;liorant le module d&#8217;analyse par l&#8217;ajout de connaissances
s&#233;mantiques. D&#232;s maintenant, se pose la question suivante : jusqu&#8217;o&#249; doit on aller ? Quelles
sont les connaissances suffisantes et n&#233;cessaires pour pouvoir r&#233;pondre &#224; notre question ? Ainsi
un travail important devra &#234;tre r&#233;alis&#233; sur les informations que l&#8217;on doit fournir gr&#226;ce &#224; notre
analyseur pour une meilleure recherche de la r&#233;ponse. Dans cet objectif, on envisage de cr&#233;er un
analyseur s&#233;mantique en plusieurs phases : la premi&#232;re proposant une analyse s&#233;mantique
minimale et une deuxi&#232;me phase d&#233;clench&#233;e selon les besoins sp&#233;cifiques de l&#8217;application. Pour
la t&#226;che question - r&#233;ponse, des connaissances sp&#233;cifiques, comme la forme de la question,
pourront nous permettre d&#8217;orienter cette analyse dans la bonne direction. Par la suite, on
envisage d&#8217;&#233;tendre cette analyse non plus seulement &#224; un syst&#232;me de question - r&#233;ponse mais
&#233;galement &#224; un syst&#232;me de dialogue. Cela consistera en une autre phase o&#249; les connaissances
pragmatiques, c&#8217;est &#224; dire les connaissances sur le contexte dans lequel a lieu le dialogue,
pourront &#234;tre utiles pour la compr&#233;hension de la phrase.
</p>
<p>R&#233;f&#233;rences
A&#239;t-Mokhtar S. and Chanod J. (1997), Incremental Finite-State Parsing, In Proceedings of
ANLP-97, Washington.
</p>
<p>Fellbaum C. (1998) WordNet: An Electronic Lexical Database, Cambridge, MA, Mit Press
Ferret O., Grau B., Hurault-Plantet M., Illouz G., Jacquemin C., Lecuyer P., Masson N. (nov
2000), QALC- the Question-Answering program of the Language and Congnition group at
LIMSI-CNRS, Actes de la conf&#233;rence TREC-8, Gaithersburg MN, pp.465-474.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Monceaux Laura
</p>
<p>Jacquemin C. (1999) Syntagmatic and paradigmatic representations of term variation, Actes
d&#8217;ACL&#8217;99, 341-348.
</p>
<p>Monceaux L. (2000) Analyse syntaxico-s&#233;mantique de phrases en vue de dialogues int&#233;grant
geste et langage, Actes de la conf&#233;rence ERGO-IHM, Biarritz.
Lehnert W. (1979) The Process of Question Answering Lawrence Erlbaum Associates, 1979
Sowa J. F. (1983) Conceptual Structures: Information processing in mind and machine,
Edition Addison- Wesley Publishing Company, Inc.
</p>
<p>Wehrli E (1992) The IPS system. Actes du quinzi&#232;me colloque international en linguistique
informatique, COLING-92</p>

</div></div>
</body></html>