<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>DAnIEL : Veille &#233;pid&#233;miologique multilingue parcimonieuse</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>DAnIEL : Veille &#233;pid&#233;miologique multilingue parcimonieuse
</p>
<p>Ga&#235;l Lejeune, Romain Brixtel, Charlotte Lecluze, Antoine Doucet, Nadine Lucas
Normandie Universit&#233;; UNICAEN, GREYC, CNRS UMR 6072, F-14032 Caen
</p>
<p>pr&#233;nom.nom@unicaen.fr
</p>
<p>R&#201;SUM&#201;
DAnIEL est un syst&#232;me multilingue de veille &#233;pid&#233;miologique. DAnIEL permet de traiter un grand
nombre de langues &#224; faible co&#251;t gr&#226;ce &#224; une approche parcimonieuse en ressources.
</p>
<p>ABSTRACT
DAnIEL, parsimonious yet high-coverage multilingual epidemic surveillance
</p>
<p>DAnIEL is a multilingual epidemic surveillance system. DAnIEL relies on a parsimonious scheme
making it possible to process new languages at small cost.
</p>
<p>MOTS-CL&#201;S : extraction d&#8217;information, recherche d&#8217;information, veille, multilinguisme, genre
journalistique, grain caract&#232;re.
</p>
<p>KEYWORDS: information extraction, information retrieval, news surveillance, multilingualism,
news genre, character-level analysis.
</p>
<p>DAnIEL (Data Analysis for Information Extraction in any Language) est un syst&#232;me multilingue
de veille &#233;pid&#233;miologique d&#233;velopp&#233; au GREYC. Les syst&#232;mes de veille peinent &#224; couvrir un
grand nombre de langues du fait d&#8217;un co&#251;t &#233;lev&#233; en ressources (Steinberger, 2011) : lemmatiseur,
analyseur syntaxique ou encore ontologie du domaine. DAnIEL est au contraire con&#231;u pour
pouvoir traiter de nouvelles langues avec un co&#251;t marginal minimal (Lejeune et al., 2012).
Ainsi, il est possible de d&#233;tecter un &#233;v&#232;nement d&#232;s le premier article publi&#233;, ind&#233;pendamment de
la langue dans laquelle celui-ci est r&#233;dig&#233;.
</p>
<p>DAnIEL se base sur les propri&#233;t&#233;s du genre journalistique d&#8217;une part et sur une analyse au grain
caract&#232;re d&#8217;autre part. Un document d&#233;crit un &#233;v&#232;nement &#233;pid&#233;miologique si des cha&#238;nes de ca-
ract&#232;res particuli&#232;res sont r&#233;p&#233;t&#233;es &#224; des positions clefs. Ces cha&#238;nes de caract&#232;res sont choisies
via un algorithme de d&#233;tection de cha&#238;ne de caract&#232;res r&#233;p&#233;t&#233;es maximales conjointement &#224; un
lexique minimal. Cela permet &#224; DAnIEL d&#8217;&#234;tre ind&#233;pendant de toute description grammaticale
locale. DAnIEL s&#8217;affranchit ainsi de l&#8217;usage de grammaires et facilite le traitement des langues
&#224; morphologie riche ; langues pour lesquelles les ressources sont rares (finnois, grec, polonais,
tch&#232;que. . .).
</p>
<p>Le traitement d&#8217;une nouvelle langue par DAnIEL n&#233;cessite une quantit&#233; limit&#233;e de lexique de
mani&#232;re &#224; faciliter l&#8217;extension du syst&#232;me, que ce soit de mani&#232;re automatique (aspir&#233; sur
Wikipedia) ou par le biais d&#8217;un utilisateur (&#233;pid&#233;miologiste). Ces ressources sont ais&#233;ment
modifiables, ce sont environ 50 mots-cl&#233;s par langue.
</p>
<p>La Figure 1 pr&#233;sente un exemple d&#8217;extraction d&#8217;&#233;v&#232;nement en grec. DAnIEL a &#233;t&#233; &#233;valu&#233; sur 17
langues pour mesurer la plus-value offerte vis-&#224;-vis du syst&#232;me manuel de r&#233;f&#233;rence ProMED-
mail (Lejeune et al., 2013). Cette exp&#233;rience a montr&#233; que DAnIEL comble les lacunes de
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>787 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>couverture et acc&#233;l&#232;re consid&#233;rablement le d&#233;lai de d&#233;tection des &#233;v&#233;nements &#233;pid&#233;miologiques
dans des r&#233;gions du globe mal couvertes : Afrique et Asie du Sud-Est mais aussi Europe centrale.
Le co&#251;t marginal de traitement d&#8217;une nouvelle langue par le syst&#232;me est de deux heures-homme
(contre plusieurs mois ordinairement). Toutefois, quelques minutes suffisent pour obtenir des
premiers r&#233;sultats fiables. Les r&#233;sultats extraits par DAnIEL sont disponibles en ligne 1.
</p>
<p>Durant cette d&#233;monstration nous aurons l&#8217;occasion d&#8217;utiliser DAnIEL sur les cas suivants :
&#8211; traitement de langues morphologiquement riches ;
&#8211; test du syst&#232;me sur des documents propos&#233;s par des utilisateurs ;
&#8211; d&#233;tection d&#8217;&#233;v&#233;nements sur des fils de presse multilingues.
Nous souhaitons promouvoir l&#8217;utilisation de m&#233;thodes simples et reproductibles, adapt&#233;es au
traitement de donn&#233;es multilingues. La combinaison d&#8217;un mod&#232;le de document, d&#233;pendant du
genre de texte et non de la langue, et d&#8217;une analyse au grain caract&#232;re, permet d&#8217;envisager
d&#8217;autres applications.
</p>
<p>FIGURE 1 &#8211; Extraction de l&#8217;&#233;v&#232;nement grippe , Chine ( &#947;&#961;&#943;&#960;&#951; , &#922;&#943;&#957;&#945; ) dans un article en grec
</p>
<p>R&#233;f&#233;rences
</p>
<p>LEJEUNE, G., BRIXTEL, R., DOUCET, A. et LUCAS, N. (2012). DAnIEL : Language Independent
Character-Based News Surveillance. In Advances in Natural Language Processing, Springer LNAI
7614, pages 64&#8211;75.
</p>
<p>LEJEUNE, G., BRIXTEL, R., LECLUZE, C., DOUCET, A. et LUCAS, N. (2013). Added-value of automatic
multilingual text analysis for epidemic surveillance. 14th Conf. Artificial Intelligence in Medicine
AIME, Murcia, May.
</p>
<p>STEINBERGER, R. (2011). A survey of methods to ease the development of highly multilingual
text mining applications. Language Resources and Evaluation, pages 1&#8211;22.
</p>
<p>1. https://daniel.greyc.fr
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>788 c&#65535; ATALA</p>

</div></div>
</body></html>