<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Am&#233;liorer la traduction des langages morphologiquement riches</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Improving Translation to Morphologically Rich Languages
</p>
<p>Alexander Fraser
Center for Information and Language Processing, LMU, Munich
</p>
<p>fraser@cis.uni-muenchen.de
</p>
<p>R&#201;SUM&#201;
Si les techniques statistiques pour la traduction automatique ont fait des progr&#232;s significatifs au
cours des 20 derni&#232;res ann&#233;es, les r&#233;sultats pour la traduction de langues morphologiquement
riches sont toujours mitig&#233;s par rapport aux pr&#233;c&#233;dentes g&#233;n&#233;rations de syst&#232;mes &#224; base de
r&#232;gles. Les recherches actuelles en traduction statistique de langues morphologiquement riches
varient grandement en fonction de la quantit&#233; de connaissances linguistiques utilis&#233;es et de la
nature de ces connaissances. Cette variation est plus importante en langue cible (par exemple, les
ressources utilis&#233;es en traduction automatique statistique respectueuse de linguistique en arabe,
en fran&#231;ais et en allemand sont tr&#232;s diff&#233;rentes). La conf&#233;rence portera sur les techniques &#233;tat de
l&#8217;art d&#233;di&#233;es &#224; la t&#226;che de traduction statistique pour une langue cible qui est morphologiquement
plus riche que la langue source.
</p>
<p>ABSTRACT
Am&#233;liorer la traduction des langages morphologiquement riches
</p>
<p>While statistical techniques for machine translation have made significant progress in the last 20
years, results for translating to morphologically rich languages are still mixed versus previous
generation rule-based systems. Current research in statistical techniques for translating to
morphologically rich languages varies greatly in the amount of linguistic knowledge used and the
form of this linguistic knowledge. This varies most strongly by target language (e.g., the resources
used for linguistically-aware statistical machine translation to Arabic, French, German are very
different). The talk will discuss state-of-the-art techniques for statistical translation tasks in-
volving translating to a target language which is morphologically richer than the source language.
</p>
<p>MOTS-CL&#201;S : traduction statistique, langages morphologiquement riches, connaissances linguis-
tiques.
</p>
<p>KEYWORDS: statistical translation, morphologically rich languages, linguistic knowledge.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>1 c&#65535; ATALA</p>

</div></div>
</body></html>