<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Fouille de r&#232;gles d&#8217;annotation partielles pour la reconnaissance des entit&#233;s nomm&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Fouille de r&#232;gles d&#8217;annotation partielles
pour la reconnaissance des entit&#233;s nomm&#233;es
</p>
<p>Damien Nouvel 1, 2 Jean-Yves Antoine 1 Nathalie.Friburger 1
Arnaud.Soulet 1
</p>
<p>(1) LI, 3 place Jean Jaur&#232;s, 41000 Blois
(2) Alpage, INRIA &amp; Universit&#233; Paris-Diderot, 75013 Paris
</p>
<p>{prenom.nom}@univ-tours.fr
</p>
<p>R&#201;SUM&#201;
Ces derni&#232;res d&#233;cennies, l&#8217;accroissement des volumes de donn&#233;es a rendu disponible une diversit&#233;
toujours plus importante de types de contenus &#233;chang&#233;s (texte, image, audio, vid&#233;o, SMS, tweet,
donn&#233;es statistiques, spatiales, etc.). En cons&#233;quence, de nouvelles probl&#233;matiques ont vu le
jour, dont la recherche d&#8217;information au sein de donn&#233;es potentiellement bruit&#233;es. Dans cet
article, nous nous penchons sur la reconnaissance d&#8217;entit&#233;s nomm&#233;es au sein de transcriptions
(manuelles ou automatiques) d&#8217;&#233;missions radiodiffus&#233;es et t&#233;l&#233;visuelles. &#192; cet effet, nous mettons
en &#339;uvre une approche originale par fouille de donn&#233;es afin d&#8217;extraire des motifs, que nous
nommons r&#232;gles d&#8217;annotation. Au sein d&#8217;un mod&#232;le, ces r&#232;gles r&#233;alisent l&#8217;annotation automatique
de transcriptions. Dans le cadre de la campagne d&#8217;&#233;valuation Etape, nous mettons &#224; l&#8217;&#233;preuve
le syst&#232;me impl&#233;ment&#233;, mXS, &#233;tudions les r&#232;gles extraites et rapportons les performances du
syst&#232;me. Il obtient de bonnes performances, en particulier lorsque les transcriptions sont bruit&#233;es.
</p>
<p>ABSTRACT
Mining Partial Annotation Rules for Named Entity Recognition
</p>
<p>During the last decades, the unremitting increase of numeric data available has led to a more
and more urgent need for efficient solution of information retrieval (IR). This paper concerns a
problematic of first importance for the IR on linguistic data : the recognition of named entities
(NE) on speech transcripts issued from radio or TV broadcasts. We present an original approach for
named entity recognition which is based on data mining techniques. More precisely, we propose to
adapt hierarchical sequence mining techniques to extract automatically from annotated corpora
intelligible rules of NE detection. This research was carried out in the framework of the Etape NER
evaluation campaign, where mXS, our text-mining based system has shown good performances
challenging the best symbolic or data-driven systems
</p>
<p>MOTS-CL&#201;S : Entit&#233;s nomm&#233;es, Fouille de donn&#233;es, R&#232;gles d&#8217;annotation.
KEYWORDS: Named Entities, Data Mining, Annotation Rules.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>421 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Ces derni&#232;res d&#233;cennies, le d&#233;veloppement consid&#233;rable des technologies de l&#8217;information et de la
communication a modifi&#233; la mani&#232;re dont nous acc&#233;dons et manipulons les connaissances. Nous
constatons une diversit&#233; toujours plus importante des types de contenus &#233;chang&#233;s (texte, image,
audio, vid&#233;o, SMS, tweet, donn&#233;es statistiques, spatiales, etc.), ce qui n&#233;cessite de r&#233;soudre
de nombreuses probl&#233;matiques, parmi lesquelles la recherche d&#8217;information, qui a int&#233;ress&#233; la
communaut&#233; du TALN d&#232;s les ann&#233;es 90 avec les campagnes d&#8217;&#233;valuation MUC (Grishman et
Sundheim, 1996). Les travaux sur le sujet ont port&#233; une attention particuli&#232;re aux noms propres
de personnes, de lieux et d&#8217;organisations, appel&#233;s entit&#233;s nomm&#233;es (EN). Au gr&#233; des besoins,
celles-ci ont &#233;t&#233; &#233;tendues aux dates, aux expressions num&#233;riques, aux marques ou aux fonctions,
avant de recouvrir un large spectre d&#8217;expressions linguistiques.
</p>
<p>De nombreux syst&#232;mes ont &#233;t&#233; &#233;labor&#233;s pour r&#233;aliser la reconnaissance d&#8217;entit&#233;s nomm&#233;es (REN),
selon des approches orient&#233;es connaissances ou orient&#233;es donn&#233;es. Les premi&#232;res ont g&#233;n&#233;rale-
ment une grande pr&#233;cision mais n&#233;cessitent un coup humain de d&#233;veloppement important, ce
qui se traduit g&#233;n&#233;ralement par une couverture (et donc un rappel) perfectible. Les approches
orient&#233;es donn&#233;es, par ajustement automatique de param&#232;tres d&#8217;un mod&#232;le num&#233;rique, per-
mettent d&#8217;obtenir de bonnes performances, avec un coup d&#8217;entr&#233;e limit&#233;, du moment o&#249; l&#8217;on
dispose d&#8217;une base d&#8217;apprentissage de taille suffisante. Ils sont &#233;galement r&#233;put&#233;s pr&#233;senter une
d&#233;gradation graduelle de leurs performances sur des donn&#233;es bruit&#233;es. Cependant, l&#8217;aspect &#8220;bo&#238;te
noire&#8221; des algorithmes d&#8217;apprentissage rend difficile l&#8217;am&#233;lioration cibl&#233;e de leurs performances.
</p>
<p>Ces constats ont &#233;t&#233; v&#233;rifi&#233;s par de nombreuses campagnes d&#8217;&#233;valuation. &#192; titre d&#8217;exemple, lors
de la campagne d&#8217;&#233;valuation francophone Ester2 (Galliano et al., 2009), portant sur le traitement
de transcriptions de parole radio ou t&#233;l&#233;diffus&#233;e, les deux meilleurs syst&#232;mes travaillant sur
des transcriptions manuelles &#233;taient des syst&#232;mes &#224; base de connaissance, tandis que les tests
effectu&#233;s sur des sorties de reconnaissance de la parole ont &#233;t&#233; domin&#233;s par un syst&#232;me orient&#233;
donn&#233;es.
</p>
<p>Les travaux que nous pr&#233;sentons dans cet article ont &#233;t&#233; men&#233;s dans le cadre de la campagne
Etape (qui a fait suite &#224; Ester2) qui visait notamment &#224; &#233;valuer des syst&#232;mes de REN sur des flux
de parole conversationnelle. Nous y proposons une approche novatrice pour la REN : l&#8217;utilisation
de m&#233;thodes de fouille de donn&#233;es s&#233;quentielle hi&#233;rarchique. &#192; nos yeux, ces travaux pr&#233;sentent
plusieurs originalit&#233;s du point de vue du TALN :
(i) nous &#233;laborons un moyen-terme entre les approches orient&#233;es donn&#233;es et orient&#233;es connais-
</p>
<p>sances reposant sur la recherche, &#224; partir de donn&#233;es d&#8217;apprentissage, de motifs pour la REN :
cette technique centr&#233;e donn&#233;es permet l&#8217;extraction de connaissances interpr&#233;tables ;
</p>
<p>(ii) la strat&#233;gie de d&#233;tection des entit&#233;s nomm&#233;es est originale, par la recherche s&#233;par&#233;e du
d&#233;but et de la fin des entit&#233;s, en nous appuyant sur le contexte imm&#233;diat pour placer les balises
d&#8217;annotation : cela pr&#233;sente l&#8217;int&#233;r&#234;t de conserver une certaine robustesse en cas de disfluence
ou d&#8217;erreur de reconnaissance au sein de l&#8217;entit&#233; nomm&#233;e.
</p>
<p>Cet article porte sur l&#8217;&#233;laboration, l&#8217;impl&#233;mentation et l&#8217;&#233;valuation d&#8217;une telle approche. En partie
2, nous faisons un &#233;tat de l&#8217;art des approches pour la REN. La partie 3 pr&#233;sente le formalisme de
fouille pour l&#8217;extraction de r&#232;gles d&#8217;annotation et leur utilisation pour reconna&#238;tre des entit&#233;s
nomm&#233;es. En partie 4, nous d&#233;crivons le jeu de donn&#233;es utilis&#233; et les r&#233;sultats obtenus lors de
l&#8217;&#233;valuation dans le cadre de la campagne Etape.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>422 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Approches pour la reconnaissance d&#8217;EN structur&#233;es
</p>
<p>2.1 Approches orient&#233;es connaissances
</p>
<p>Les approches orient&#233;es connaissances sont bas&#233;es sur la description de r&#232;gles d&#233;crivant les
entit&#233;s nomm&#233;es et leur contexte &#224; l&#8217;aide d&#8217;indices linguistiques fournis par le texte lui-m&#234;me et
des ressources externes (dictionnaires). G&#233;n&#233;ralement, les textes sont &#233;tiquet&#233;s syntaxiquement
(&#233;ventuellement s&#233;mantiquement) gr&#226;ce aux dictionnaires, puis un ensemble de r&#232;gles, qui
prennent en compte les indices morphologiques (pr&#233;sence de majuscule, ponctuation), morpho-
syntaxiques et s&#233;mantique, permettent de rep&#233;rer les ENs. Les r&#232;gles utilisent ces &#233;l&#233;ments, soit
comme preuves internes de la pr&#233;sence d&#8217;une entit&#233; nomm&#233;e, soit par description de son contexte
d&#8217;apparition (McDonald, 1996; Friburger et Maurel, 2004). Une preuve interne sera, par exemple,
la pr&#233;sence d&#8217;un pr&#233;nom avant un mot commen&#231;ant par une majuscule ; ce pr&#233;nom indiquera un
nom de personne (ex : &#8217;Fran&#231;ois Hollande&#8217;). Nous voyons que c&#8217;est la &#8220;connaissance&#8221; qui guide
cette approche, celle de l&#8217;expert qui cr&#233;&#233; les r&#232;gles, selon les informations &#224; sa disposition (dont
les ressources externes).
</p>
<p>D&#232;s les ann&#233;es 1990, un certain nombre de syst&#232;mes (Stephens, 1993; Hobbs J. R. et Tyson, 1996)
mettent en &#339;uvre cette approche orient&#233;e connaissances. Les automates sont particuli&#232;rement
adapt&#233;s &#224; l&#8217;&#233;laboration et l&#8217;utilisation des r&#232;gles. De plus, l&#8217;utilisation de transducteurs 1 permet
de produire tr&#232;s intuitivement une annotation &#224; l&#8217;aide de balises (&#8216;&lt;pers&gt;&#8217;, &#8216;&lt;/pers&gt;&#8217;, &#8216;&lt;org&gt;&#8217;,
&#8216;&lt;/org&gt;&#8217;, etc.), ils sont donc largement utilis&#233;s pour ce type de t&#226;che (Friburger et Maurel, 2004;
Brun et Ehrmann, 2010; B&#233;chet et al., 2011). Enfin, les transducteurs peuvent &#234;tre organis&#233;s
sous forme de cascades, chaque transducteur permettant de lever des ambigu&#239;t&#233;s et de mettre &#224;
disposition des reconnaissances pour les transducteurs suivants (ce qui permet de reconna&#238;tre des
imbrications). L&#8217;ordre dans lequel sont appliqu&#233;s les transducteurs a alors une grande importance.
</p>
<p>&#201;tant donn&#233; les traitements qu&#8217;elles mettent en &#339;uvre, les approches orient&#233;es connaissances
ins&#232;rent au sein des s&#233;quences de mots ce que nous appelons des marqueurs, comme le montre la
figure 1 pour l&#8217;expression &#8216;fondation Cartier&#8217;.
</p>
<p>La Fondation Cartier pour l&#8217; art contemporain .
PERS
</p>
<p>ORG
</p>
<p>&lt;org&gt;
&lt;pers&gt; &lt;/pers&gt;
</p>
<p>&lt;/org&gt;
</p>
<p>FIGURE 1 &#8211; Annotation par balises
</p>
<p>Les approches orient&#233;es connaissances peuvent &#234;tre utilis&#233;es et adapt&#233;es &#224; des textes sans
apprentissage pr&#233;alable. Leur limitation est li&#233;e au fait que les ressources utilis&#233;es sont rarement
exhaustives (par exemple, les noms propres forment une classe &#8220;ouverte&#8221;) : il semble illusoire de
b&#226;tir ce type d&#8217;approche sur l&#8217;hypoth&#232;se d&#8217;un lexique complet des entit&#233;s nomm&#233;es existantes.
</p>
<p>1. Automates qui modifient le texte fourni en entr&#233;e par insertion de balises
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>423 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.2 Approches orient&#233;es donn&#233;es
</p>
<p>Les approches orient&#233;es donn&#233;es param&#232;trent un mod&#232;le automatiquement gr&#226;ce &#224; un apprentis-
sage sur un corpus d&#8217;entra&#238;nement. Ce corpus d&#8217;entrainement, cr&#233;&#233; par des experts, fournit de
nombreux exemples de donn&#233;es : le syst&#232;me apprend sur ces exemples puis pr&#233;dit l&#8217;&#233;tiquette
d&#8217;une nouvelle donn&#233;e, selon son mod&#232;le. Le corpus d&#8217;entrainement est constitu&#233; d&#8217;un ensemble
de textes annot&#233;s en entit&#233;s nomm&#233;es par des experts. L&#8217;apprentissage automatique sera charg&#233;
d&#8217;ajuster les param&#232;tres disponibles, cette proc&#233;dure &#233;tant guid&#233;e &#224; chaque it&#233;ration par les
erreurs que commet le syst&#232;me sur les jeux de donn&#233;es disponibles. Une fois l&#8217;apprentissage
r&#233;alis&#233;, le syst&#232;me est en mesure d&#8217;annoter de nouveaux textes en entit&#233;s nomm&#233;es selon les
param&#232;tres de son mod&#232;le. Traditionnellement, l&#8217;apprentissage automatique se rapproche plut&#244;t
d&#8217;une classification (attribution d&#8217;une classe &#224; un mot) que d&#8217;une annotation (d&#233;limitation d&#8217;une
expression linguistique).
</p>
<p>Pour la REN, le format BIO 2 s&#8217;est impos&#233;. La figure 2 pr&#233;sente la classification par mots r&#233;alis&#233;e
pour l&#8217;&#233;nonc&#233; &#8216;&lt;org&gt; fondation &lt;pers&gt; Cartier &lt;/pers&gt; &lt;/org&gt;&#8217;. Signalons qu&#8217;en partie
3, nous pr&#233;sentons une approche orient&#233;e donn&#233;e, mais qui est apparent&#233;e &#224; un m&#233;canisme de
transduction (&#224; l&#8217;aide d&#8217;indices locaux) plut&#244;t que de classification.
</p>
<p>La Fondation Cartier pour l&#8217; art contemporain .
PERS
</p>
<p>O
</p>
<p>B-ORG
</p>
<p>I-ORG I-ORG
</p>
<p>B-PERS
</p>
<p>I-ORG I-ORG I-ORG I-ORG O
</p>
<p>FIGURE 2 &#8211; Annotation par classification
</p>
<p>G&#233;n&#233;ralement, ces approches estiment la probabilit&#233; des classes selon les tokens et les informa-
tions qui y sont associ&#233;es. Parmi les mod&#232;les num&#233;riques adapt&#233;s, figurent les mod&#232;les bay&#233;siens,
la r&#233;gression logistique (ou maximum d&#8217;entropie), les machines &#224; vecteur de support (SVM) ,
etc. La r&#233;gression logistique a d&#233;montr&#233; son efficacit&#233; pour la reconnaissance d&#8217;entit&#233;s nomm&#233;es
(Mikheev et al., 1999; Ekbala et al., 2010), permettant de prendre en compte de multiples
traits discriminants (morphologiques, morpho-syntaxiques, lexicaux) interd&#233;pendants. D&#8217;autres
mod&#232;les tirent parti de la s&#233;quentialit&#233;, comme les HMM (Bikel et al., 1999), par mod&#233;lisation
des transitions entre &#233;tats (types d&#8217;entit&#233;s nomm&#233;es) et des g&#233;n&#233;rations d&#8217;observations (mots).
</p>
<p>Pour prendre en compte simultan&#233;ment la multiplicit&#233; des indices locaux et les aspects s&#233;quentiels
au sein d&#8217;un mod&#232;le unifi&#233;, les MEMM3 (McCallum et al., 2000) puis les CRF 4 (Raymond
et Fayolle, 2010; Zidouni et al., 2010) sont les mod&#232;les r&#233;put&#233;s les plus ad&#233;quats &#224; ce jour.
L&#8217;inconv&#233;nient est qu&#8217;ils restent difficiles &#224; interpr&#233;ter : les traits d&#233;couverts sont g&#233;n&#233;ralement
composites et exhibent des d&#233;pendances complexes dont il est difficile d&#8217;affirmer qu&#8217;elles sont
n&#233;cessaires ou suffisantes pour d&#233;terminer les entit&#233;s nomm&#233;es.
</p>
<p>A ce jour, les approches orient&#233;es donn&#233;es se basent majoritairement sur une repr&#233;sentation
&#8220;plate&#8221; des entit&#233;s nomm&#233;es. Comme nous le verrons en partie 4, nous cherchons &#224; r&#233;aliser la
</p>
<p>2. Begin, Inside, Outside
3. Mod&#232;les markoviens &#224; maximum d&#8217;entropie
4. Champs al&#233;atoires conditionnels
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>424 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>REN structur&#233;e (avec imbrications). Notons que quelques travaux (Finkel et Manning, 2005;
Dinarelli et Rosset, 2011) ont adapt&#233; avec un certain succ&#232;s des m&#233;thodes orient&#233;es donn&#233;es &#224; la
reconnaissance de structure.
</p>
<p>De mani&#232;re g&#233;n&#233;rale, nous remarquons que les approches automatiques n&#233;cessitent un travail
pr&#233;alable cons&#233;quent (pr&#233;paration des jeux de donn&#233;es, impl&#233;mentation du mod&#232;le, des proc&#233;-
dures d&#8217;apprentissage et d&#8217;estimation, s&#233;lection des traits et d&#233;pendances pertinents, etc.) avant
d&#8217;&#234;tre en mesure de param&#233;trer les mod&#232;les, et qu&#8217;il reste difficile de les utiliser pour extraire des
connaissances ou pour &#233;tudier des ph&#233;nom&#232;nes particuliers.
</p>
<p>2.3 Proposition : les marqueurs d&#8217;annotation
</p>
<p>Nous le voyons, les approches guid&#233;es par les donn&#233;es s&#8217;appuient sur des indices locaux vari&#233;s.
La nature &#8220;locale&#8221; de la structuration en entit&#233;s nomm&#233;es est alors un atout. Les syst&#232;mes
orient&#233;s connaissances ont l&#8217;avantage de mod&#233;liser la structure interne des entit&#233;s nomm&#233;es.
Ainsi un syst&#232;me &#224; base de connaissances aura plus de facilit&#233; &#224; analyser l&#8217;encapsulation d&#8217;entit&#233;s
nomm&#233;es comme dans l&#8217;exemple suivant (issu d&#8217;Etape) : &#8216;le d&#233;put&#233; UMP de Haute-Sa&#244;ne&#8217; o&#249;
l&#8217;entit&#233; nomm&#233;e globale est construite &#224; l&#8217;aide de l&#8217;entit&#233; &#8216;UMP&#8217;, de type organisation, et de l&#8217;entit&#233;
&#8216;Haute-Sa&#244;ne&#8217;, de type division g&#233;ographique administrative.
</p>
<p>Cependant, ces derni&#232;res approches utilisent une connaissance dont la construction est co&#251;teuse et
d&#233;licate. Aussi avons-nous souhait&#233; d&#233;velopper une approche permettant l&#8217;extraction automatique
sur corpus de motifs se rapprochant des r&#232;gles de reconnaissance mises en &#339;uvre par la REN
symbolique. La fouille hi&#233;rarchique s&#233;quentielle de donn&#233;es est ad&#233;quate &#224; cet effet.
</p>
<p>Par ailleurs, les syst&#232;mes orient&#233;s connaissances sont aujourd&#8217;hui contraints &#224; mod&#233;liser int&#233;-
gralement la structure des entit&#233;s, voire de ses contextes d&#8217;introduction. Ce choix est discutable
et met &#224; l&#8217;&#233;preuve la robustesse des syst&#232;mes lorsqu&#8217;ils traitent de la parole spontan&#233;e. Une
erreur de reconnaissance sur un seul mot de l&#8217;entit&#233; (d&#251;e par exemple &#224; une disfluence) emp&#234;che
l&#8217;application de la r&#232;gle de d&#233;tection.
</p>
<p>Afin de r&#233;pondre &#224; cette insuffisance, nous proposons de s&#233;parer la d&#233;tection du d&#233;but et de
la fin de l&#8217;entit&#233;, pour ensuite chercher &#224; associer une marque de d&#233;but et de fin d&#8217;entit&#233;. Notre
hypoth&#232;se est que l&#8217;on dispose de suffisamment d&#8217;indices locaux pour caract&#233;riser pr&#233;cis&#233;ment le
d&#233;but ou la fin d&#8217;une entit&#233;.
</p>
<p>Consid&#233;rons pas exemple l&#8217;&#233;nonc&#233; annot&#233; suivant &#8216;En &lt;date&gt; &lt;num&gt; 1969 &lt;/num&gt; &lt;/date&gt;
&lt;pers&gt; &lt;prenom&gt; Georges &lt;/prenom&gt; &lt;famille&gt; Pompidou &lt;/famille&gt; &lt;/pers&gt; dirige la
&lt;org&gt; &lt;loc&gt; France &lt;/loc&gt; &lt;/org&gt;&#8217;. Notre hypoth&#232;se est que chacune des marques d&#8217;annota-
tion (&#8216;&lt;pers&gt;&#8217;, &#8216;&lt;prenom&gt;&#8217;, &#8216;&lt;/prenom&gt;&#8217;, &#8216;&lt;/pers&gt;&#8217;, etc.) est d&#233;tectable s&#233;par&#233;ment. De plus,
la d&#233;tection d&#8217;une entit&#233; encapsul&#233;e telle que &#8216;&lt;prenom&gt;&#8217; peut guider la d&#233;tection de l&#8217;entit&#233;
englobante. Il s&#8217;agira, pour le syst&#232;me, d&#8217;extraire des r&#232;gles d&#8217;annotation, d&#8217;estimer localement
les marqueurs probables, puis de d&#233;terminer, par leurs combinaisons, l&#8217;annotation la plus vrai-
semblable. Nous impl&#233;mentons un syst&#232;me de reconnaissance d&#8217;entit&#233;s nomm&#233;es, mXS, selon
cette approche originale. Gr&#226;ce &#224; ce proc&#233;d&#233;, notre syst&#232;me reconna&#238;t par exemple le montant
&#8216;deux cent &#231;a compte mille&#8217; (erreur de transcription pour deux cent cinquante mille), alors qu&#8217;un
syst&#232;me symbolique sera mis en difficult&#233;.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>425 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Extraction de r&#232;gles d&#8217;annotation pour la REN
</p>
<p>3.1 Enrichissement ambigu des donn&#233;es
</p>
<p>Pierre a visit&#233; le Centre Pompidou Tokenisation
</p>
<p>Lemmatisationavoir visiter
</p>
<p>Morpho-syntaxe
NP VER VER DET NC NP
</p>
<p>S&#233;mantique
PRENOM BAT BAT CELEB
</p>
<p>axe paradigmatique
</p>
<p>axe structurel
</p>
<p>FIGURE 3 &#8211; Repr&#233;sentation des structures &#224; fouiller
</p>
<p>L&#8217;approche que nous mettons en &#339;uvre repose sur des analyses fr&#233;quemment conduites pour
traiter le langage naturel (morpho-syntaxe, lexiques). Pour la fouille, ces traitements sont
interpr&#233;t&#233;s comme autant d&#8217;enrichissements des donn&#233;es, &#224; utiliser pour rechercher des motifs
g&#233;n&#233;ralis&#233;s dans les donn&#233;es. La figure 3 pr&#233;sente de mani&#232;re sch&#233;matique, sur l&#8217;exemple &#8216;Pierre
a visit&#233; le Centre Georges Pompidou&#8217;, la mani&#232;re dont se superposent ces enrichissements.
</p>
<p>La fouille de donn&#233;es devra alors tenir compte de deux axes : paradigmatique, pour la superposi-
tion d&#8217;enrichissements, et structurel, pour l&#8217;examen des contig&#252;it&#233;s entre items. Comme nous le
verrons par la suite, ce processus est flexible : les enrichissements peuvent &#234;tre plus ou moins
profonds selon les &#233;l&#233;ments consid&#233;r&#233;s. Nous pouvons moduler &#224; volont&#233; l&#8217;axe paradigmatique
selon les &#233;l&#233;ments observ&#233;s et la t&#226;che d&#8217;annotation &#224; r&#233;aliser.
</p>
<p>3.1.1 Morpho-syntaxe
</p>
<p>Nous r&#233;alisons conjointement la tokenisation, la lemmatisation et l&#8217;&#233;tiquetage morpho-syntaxique
avec TreeTagger (Schmid, 1994). De surcro&#238;t, nous en adaptons la sortie comme suit :
</p>
<p>&#8211; D&#233;terminants : les d&#233;terminants d&#233;finis (&#8216;le&#8217;, &#8216;la&#8217;, &#8216;les&#8217;, &#8216;l&#8221;) sont sous-cat&#233;goris&#233;s en &#8216;DET/DEF&#8217;.
&#8211; Pr&#233;positions : la sous-cat&#233;gorie &#8216;PRP:det&#8217; (&#8216;au&#8217;, &#8216;du&#8217;, &#8216;des&#8217;) forme une cat&#233;gorie &#8216;PRPDET&#8217;.
&#8211; Nombres : les nombres sont sous-cat&#233;goris&#233;s selon leur nombre de chiffres 5.
&#8211; Noms propres et abr&#233;viations : ces deux cat&#233;gories se g&#233;n&#233;ralisent en &#8216;NAMABR&#8217;.
&#8211; Nom propres, abr&#233;viations, noms, verbes : ces &#233;l&#233;ments sont sous-cat&#233;goris&#233;s par le suffixe
des trois derniers caract&#232;res (&#8216;NOM/SUFF:ier&#8217;, &#8216;NAMABR/NAM/SUFF:ges&#8217;, &#8216;VER/SUFF:vre&#8217;).
</p>
<p>&#8211; Verbes : les sous-cat&#233;gories relatives au mode et temps du verbe sont supprim&#233;es.
</p>
<p>Pour le processus de fouille de donn&#233;es, nous omettons les variations surfaciques (majuscules)
et flexionnelles (d&#233;clinaisons et conjugaisons) : nous ne conservons pas les items lexicaux eux-
m&#234;mes et faisons reposer la recherche de motifs sur les lemmes propos&#233;s par TreeTagger. Par
exemple, le &#8216;En 1970 les socialistes [...]&#8217; donnera la s&#233;quence :
</p>
<p>&#8216;PRP/en NUM/DIGITS:4/PREF:19/1970 DET/DEF/le NOM/SUFF:ste/socialiste&#8217;.
</p>
<p>5. Ce nombre est pr&#233;cis&#233; s&#8217;il est inf&#233;rieur ou &#233;gal &#224; quatre le pr&#233;fixe est utilis&#233; dans ce dernier cas :
&#8216;NUM/DIGITS:MANY&#8217;, &#8216;NUM/DIGITS:4/PREF:20&#8217; . . ., &#8216;NUM/DIGITS:1&#8217;)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>426 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.1.2 Lexiques
</p>
<p>Les lexiques nous permettent d&#8217;ajouter un niveau s&#233;mantique aux hi&#233;rarchies. Nous exploitons
des ressources diverses, dont certaines sont import&#233;es &#224; partir des dictionnaires et motifs du
syst&#232;me CasEN 6. Nous y ajoutons quelques listes, constitu&#233;es manuellement, en particulier
pour les fonctions, lieux, organisations, quantit&#233;s et dates. Ces ressources contiennent 221
547 expressions distinctes qui produisent 443 112 cat&#233;gorisations s&#233;mantiques 7. Une large
part est d&#233;di&#233;e &#224; la reconnaissance des personnes et des lieux. Signalons qu&#8217;une partie de
ces ressources est g&#233;n&#233;r&#233;e &#224; partir d&#8217;automates (transducteurs CasEN) qui reconnaissent des
expressions linguistiques utiles &#224; la REN.
</p>
<p>Ces ressources sont utilis&#233;es telles quelles pour produire les enrichissements. Ceux-ci peuvent
alors &#234;tre s&#233;mantiquement ambigus, ce que nous notons comme une disjonction exclusive
&#8853;. Par exemple, au nom propre Washington seront affect&#233;es les cat&#233;gories s&#233;mantiques
&#8216;CELEB&#8853;TOPO&#8853;ORG-LOC-GOV&#8853;PREN&#8853;VILLE&#8217;. Notons ici que nous consid&#233;rons que les noms
propres forment une classe ouverte et qu&#8217;ils n&#8217;ont pas vocation &#224; &#234;tre utilis&#233;s lexicalis&#233;s au
sein des motifs extraits : lorsqu&#8217;ils ont donn&#233; lieu &#224; des enrichissements s&#233;mantiques, les items
lexicaux sont omis afin que la fouille de donn&#233;es ne repose que sur les cat&#233;gories s&#233;mantiques.
</p>
<p>3.2 Exploration de r&#232;gles d&#8217;annotation de segments
</p>
<p>Les donn&#233;es ainsi enrichies forment le langage &#65535; r et ont vocation a &#234;tre fouill&#233;es afin d&#8217;y
rechercher des motifs s&#233;quentiels d&#8217;int&#233;r&#234;t (Fischer et al., 2005; Cellier et Charnois, 2010) pour
la REN.
</p>
<p>Le langage des motifs &#65535;p+ comprend celui des donn&#233;es enrichies et toutes leurs g&#233;n&#233;ralisa-
tions. Un &#233;l&#233;ment de motif (item) couvre une donn&#233;e, not&#233;e &#8804;ci , lorsqu&#8217;il s&#8217;y trouve en tenant
compte des disjonctions &#8853;. Par exemple, l&#8217;item &#8216;TOPO/Washington&#8217; couvre la donn&#233;e enrichie
&#8216;CELEB/Washington&#8853;TOPO/Washington&#8217;. D&#232;s lors, nous nous inspirons de travaux int&#233;grant
des hi&#233;rarchies aux s&#233;quences (Srikant et Agrawal, 1996), en y ajoutant la notion de segment 8
</p>
<p>particuli&#232;rement adapt&#233;e au traitement de structures au sein desquelles des items se r&#233;p&#232;tent
(comme des syntagmes s&#233;mantiquement cat&#233;goris&#233;s).
</p>
<p>Couverture d&#8217;un motif de segments sur des donn&#233;es : soient un motif de segments P =
p1p2 . . . pn &#8712; &#65535;r et une s&#233;quence de la base de donn&#233;es enrichie I = i1i2 . . . ip &#8712; &#65535;p+ , alors P
couvre les segments de I , not&#233; P &#8804;c+ I , s&#8217;il existe une fonction discr&#232;te croissante S() d&#233;finie de
[1, p] vers [1,n] telle que, pour tout j &#8712; [1, p], alors pj &#8804;ci iS( j)
Ce m&#234;me m&#233;canisme sera pris en compte lorsqu&#8217;il s&#8217;agit de g&#233;n&#233;raliser selon l&#8217;axe paradigmatique :
l&#8217;objectif est que, par exemple, &#8216;CELEB&#8217; couvre indiff&#233;remment &#8216;Pompidou&#8217; et &#8216;Valery Giscard
d&#8217;Estaing&#8217;. Plus g&#233;n&#233;ralement, nous d&#233;finissons trois relations de g&#233;n&#233;ralisation entre motifs :
</p>
<p>&#8211; G&#233;n&#233;ralisation hi&#233;rarchique entre motifs de segments : soient deux motifs de segments
P = p1p2 . . . pn &#8712; &#65535;p+ et Q = q1q2 . . .qp &#8712; &#65535;p+ , alors P g&#233;n&#233;ralise hi&#233;rarchiquement les segments
de Q, not&#233; P &#8804;g Q, s&#8217;il existe une une fonction discr&#232;te croissante S() d&#233;finie de [1, p] vers
[1,n] telle que, pour tout j &#8712; [1, p], alors pj &#8804;ci qS( j).
6. http ://tln.li.univ-tours.fr/Tln_CasEN.html
7. Il est fr&#233;quent que plusieurs cat&#233;gories s&#233;mantiques soient associ&#233;es aux entr&#233;es
8. Pour respecter l&#8217;anti-monotonie, deux items contigus ne peuvent &#234;tre identiques ou parents l&#8217;un de l&#8217;autre
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>427 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; G&#233;n&#233;ralisation par affixation entre motifs : soient deux motifs P = p1p2 . . . pn &#8712; &#65535;p+ et
Q = q1q2 . . .qp &#8712; &#65535;p+ , alors P g&#233;n&#233;ralise par affixation Q, not&#233; P &#8804;g Q, si p &#8805; n et s&#8217;il existe au
moins un k &#8712; [0, p&#8722; n] tel que, pour tout j &#8712; [1,n], alors qj+k = pj .
</p>
<p>&#8211; G&#233;n&#233;ralisation sur marqueurs entre motifs : soient deux motifs P = p1p2 . . . pn &#8712; &#65535;p+ et
Q = q1q2 . . .qp &#8712; &#65535;p+ , alors P g&#233;n&#233;ralise sur marqueurs Q, not&#233; P &#8804;g Q, si p &#8805; n et s&#8217;il existe
une fonction discr&#232;te strictement croissante C() d&#233;finie de [1,n] vers [1, p] telle que, pour tout
j &#8712; [1,n], alors pj = qC( j) et, pour tout k &#8712; [1, p] tel que k &#65535;&#8712; {C( j), j &#8712; [1,n]}, alors qk &#8712; &#931;m.
</p>
<p>Ces g&#233;n&#233;ralisations nous permettent de rechercher des motifs dans lesquels apparaissent les
marqueurs d&#8217;entit&#233;s nomm&#233;es. Par exemple, au sein de l&#8217;&#233;nonc&#233; &#8216;Le &lt;fonc&gt; pr&#233;sident &lt;/fonc&gt;
&lt;pers&gt; Georges Pompidou &lt;/pers&gt; d&#233;battait souvent.&#8217;, nous relevons, par relations de couverture
et de g&#233;n&#233;ralisation, une occurrence pour les motifs &#8216;NOM/pr&#233;sident &lt;pers&gt; CELEB &lt;/pers&gt;&#8217;
ou &#8216;NOM/pr&#233;sident CELEB &lt;/pers&gt; VERB/d&#233;battre&#8217;, par exemple.
</p>
<p>Finalement, La notion de r&#232;gle d&#8217;annotation partielle d&#233;coule de celle de motif de segments :
</p>
<p>R&#232;gle d&#8217;annotation partielle une r&#232;gle d&#8217;annotation partielle est un motif de segments P &#8712; &#65535;p+
contenant au moins un &#233;l&#233;ment de &#931;r et un &#233;l&#233;ment de &#931;m.
</p>
<p>Notons qu&#8217;&#224; ce stade les r&#232;gles d&#8217;annotation contiennent un nombre ind&#233;termin&#233; de marqueurs.
Il conviendra de filtrer au besoin lors de l&#8217;extraction des motifs et de s&#8217;assurer que l&#8217;on utilise ces
r&#232;gles de mani&#232;re ad&#233;quate afin de produire une annotation.
</p>
<p>3.3 Filtrage et extraction de r&#232;gles d&#8217;annotations partielles
</p>
<p>La combinatoire du langage &#65535;p+ &#233;tant importante, il est n&#233;cessaire de filtrer les r&#232;gles. Pour cela,
nous d&#233;terminons la fr&#233;quence et la confiance des r&#232;gles, afin d&#8217;&#233;liminer celles qui n&#8217;ont que peu
d&#8217;int&#233;r&#234;t. &#192; l&#8217;aide de la couverture et des g&#233;n&#233;ralisations d&#233;finies ci-dessus, nous d&#233;terminons la
fr&#233;quence F req(P,&#65535;) d&#8217;une r&#232;gle P comme son nombre d&#8217;occurrences au sein du corpus &#65535;. La
confiance d&#8217;une r&#232;gle d&#8217;annotation P estime la proportion de phrases o&#249; la r&#232;gle est appliqu&#233;e
avec justesse :
</p>
<p>Conf (P,&#65535;) = F req(P,&#65535;)
F req(Retm(P),&#65535;) (la fonction Retm(P) retire les marqueurs de P)
</p>
<p>M&#234;me en fixant des seuils de support et confiance s&#233;lectifs, les r&#232;gles d&#8217;annotation peuvent &#234;tre
trop nombreuses &#224; cause des combinaisons possibles au travers de la hi&#233;rarchie. Afin de contenir
cette abondance de r&#232;gles, nous proposons de grouper les r&#232;gles, puis d&#8217;&#233;liminer celles qui ne sont
pas informatives, &#224; l&#8217;instar de (Pasquier et al., 1999). L&#8217;id&#233;e forte est que deux motifs qui couvrent
les m&#234;mes exemples sont redondants car ils appartiennent &#224; la m&#234;me classe d&#8217;&#233;quivalence :
</p>
<p>&#201;quivalence de motifs au regard d&#8217;une base de donn&#233;es : soient P et Q deux motifs et &#65535; une
base de donn&#233;es, alors P est &#233;quivalent &#224; Q au regard de &#65535;, not&#233;e P &#8801;&#65535; Q, si P &#8804;g Q ou Q &#8804;g P
et F req(P,&#65535;) = F req(Q,&#65535;)
Dans la suite, plut&#244;t que d&#8217;extraire toutes les r&#232;gles d&#8217;une m&#234;me classe d&#8217;&#233;quivalence, nous nous
contentrerons des motifs les plus sp&#233;cifiques car ils sont porteurs de plus de corr&#233;lations. Par
ailleurs, nous &#233;tendons cette &#233;quivalence par une marge de tol&#233;rance lors de la comparaison des
fr&#233;quences &#224; &#948;%, ce que nous appellons alors filtrage &#948;.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>428 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.4 Annotation automatique &#224; partir des r&#232;gles d&#8217;annotation
</p>
<p>Les r&#232;gles d&#8217;annotation sont utilis&#233;es par mXS pour r&#233;aliser l&#8217;annotation en entit&#233;s nomm&#233;es.
Pour une position j d&#8217;un texte, de nombreuses r&#232;gles peuvent proposer des marqueurs. Nous
estimons la probabilit&#233; d&#8217;ins&#233;rer des marqueurs en Mj (transductions) par r&#233;gression logistique,
ce qui nous permet de tenir compte de la multiplicit&#233; des r&#232;gles P &#8712; &#65535; j selon la formule :
</p>
<p>P(m &#8712; Mj |&#65535; j) = 1Z(&#65535; j) &#183; exp
&#65535;
</p>
<p>P&#8712;&#65535; j &#955;P,m
</p>
<p>Dans une annotation (et plus particuli&#232;rement si elle est structur&#233;e), plusieurs marqueurs peuvent
se trouver &#224; une position donn&#233;e. Il nous faut &#234;tre en mesure de faire le lien entre la probabilit&#233;
d&#8217;ins&#233;rer un marqueur individuel et celle d&#8217;ins&#233;rer une s&#233;quence de marqueurs. Pour cela, nous
tenons compte des statistiques issues du corpus sous forme de probabilit&#233;s conditionnelles 9 :
</p>
<p>P(Mj = m1m2 . . .mp) =
1
p
</p>
<p>&#183; p&#65535;
k=1
</p>
<p>P(mk &#8712; Mk|&#65535;k)P(m1 . . .mp|mk)
Lorsque les probabilit&#233;s de s&#233;quences de marqueurs P(Mi) sont estim&#233;es, nous les utilisons afin
de d&#233;terminer quelle est, pour un &#233;nonc&#233; donn&#233;, l&#8217;annotation la plus vraisemblable parmi les
annotations valides. Une hypoth&#232;se d&#8217;ind&#233;pendance entre marqueurs au sein d&#8217;un &#233;nonc&#233; nous
permet de r&#233;soudre la recherche de l&#8217;annotation par programmation dynamique.
</p>
<p>4 Exp&#233;riences sur le corpus Etape
</p>
<p>4.1 Donn&#233;es
</p>
<p>Corpus Sources(nombre de fichiers) Tokens &#201;nonc&#233;s EN
Etape-Train BFMTV (5), France Inter (16), LCP (23) 355 975 14 989 46 259
</p>
<p>Etape-Dev BFMTV (1), France Inter (6), LCP(6), TV8 (2) 115 530 5 724 14 112
Etape-Test BFMTV (1), France Inter (6), LCP (5), TV8 (2) 123 221 6 770 13 055
</p>
<p>Total 74 enregistrements 594 726 27 483 73 426
Etape-Quaero France Classique (1), France Culture (1), France
</p>
<p>Inter (62), France Info (13), RFI (14), RTM (97)
1 596 427 43 828 279 797
</p>
<p>TABLE 1 &#8211; Caract&#233;ristiques du corpus Etape
</p>
<p>Le travail a &#233;t&#233; r&#233;alis&#233; dans le contexte de la campagne d&#8217;&#233;valuation Etape 10, en interaction avec
le programme Quaero 11. Cette campagne a port&#233; sur le traitement d&#8217;&#233;missions radiodiffus&#233;es et
t&#233;l&#233;visuelles, donc orales et en partie spontan&#233;es. L&#8217;objectif est d&#8217;annoter les entit&#233;s nomm&#233;es
structur&#233;es, tant sur les transcriptions manuelles qu&#8217;en sortie de syst&#232;mes de reconnaissance
de la parole. La table 1 indique les parties &#224; disposition. Le corpus Etape-Test &#233;tant en
cours d&#8217;adjudication, nous ne l&#8217;utilisons pas pour mener nos exp&#233;riences. Etape-Quaero 12
est volumineux et reste difficile &#224; exploiter par la fouille. En cons&#233;quence, nous n&#8217;utilisons que
Etape-Train (extraction des r&#232;gles et param&#233;trage du mod&#232;le) et Etape-Dev (&#233;valuation).
</p>
<p>9. Ces probabilit&#233;s sont normalis&#233;es a posteriori
10. &#201;valuations en Traitement Automatique de la Parole (2011-2012)
11. http://www.quaero.org (2008-2013)
12. Adaptation du corpus Ester au format Etape
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>429 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les types principaux d&#8217;entit&#233;s nomm&#233;es sont les personnes (pers)), fonctions (fonc), organisa-
tions (org), lieux (loc), productions humaines (prod), points dans le temps (time), quantit&#233;s
(amount) et &#233;v&#232;nements (event). &#192; granularit&#233; fine (sur laquelle est r&#233;alis&#233;e l&#8217;&#233;valuation), ils
sont r&#233;partis en 34 sous-types. La figure 4 indique leur r&#233;partition au sein du corpus Etape.
Notons que les entit&#233;s nomm&#233;es sont &#233;tendues &#224; des expressions construites &#224; partir de noms
communs, ce qui am&#232;ne &#224; consid&#233;rer une large gamme d&#8217;expressions linguistiques.
</p>
<p>7%
</p>
<p>11%
13%
</p>
<p>11%
</p>
<p>15%
</p>
<p>30%
13%
</p>
<p>(a) Etape-Train
</p>
<p>7%
</p>
<p>11%
10%
</p>
<p>13%
</p>
<p>15%
</p>
<p>30%
14%
</p>
<p>(b) Etape-Dev
</p>
<p>8%
</p>
<p>12%
12%
</p>
<p>14%
</p>
<p>13%
</p>
<p>29%
12%
</p>
<p>prod
amount
fonc
loc
org
pers
time
</p>
<p>(c) Etape-Test
</p>
<p>FIGURE 4 &#8211; R&#233;partition des types principaux d&#8217;entit&#233;s
</p>
<p>En plus des entit&#233;s nomm&#233;es, leurs composants sont annot&#233;s, soit sp&#233;cifiques &#224; certains types
(jour, mois, etc. pour une date) ou transverses (valeur, unit&#233;, qualificateur, etc.). Ces &#233;l&#233;ments
permettent de mieux d&#233;crire les entit&#233;s lors de leur annotation (Rosset et al., 2011).
</p>
<p>Le nombre d&#8217;entit&#233;s nomm&#233;es rapport&#233; au nombre de tokens du corpus est de 12,3%, dont 4,8%
pour les entit&#233;s et 7,5% pour les composants. Globalement, ce corpus, quoiqu&#8217;assez volumineux,
est bien &#233;quilibr&#233; pour les types principaux d&#8217;entit&#233;s et de composants. Notons que nous r&#233;alisons
l&#8217;exploration des donn&#233;es sur un corpus qui contient des disfluences, r&#233;p&#233;titions, etc.
</p>
<p>4.2 Extraction de r&#232;gles d&#8217;annotation
</p>
<p>Pour impl&#233;menter la fouille de donn&#233;es, nous construisons un arbre des pr&#233;fixes communs
par niveaux, le processus est optimis&#233; en exploitant la propri&#233;t&#233; d&#8217;anti-monotonie (Agrawal et
Srikant, 1995) et les hi&#233;rarchies (Wang et Han, 2004). De plus, nous poussons deux contraintes
suppl&#233;mentaires pour l&#8217;extraction des r&#232;gles d&#8217;annotation :
</p>
<p>&#8211; Nombre de marqueurs : une r&#232;gle d&#8217;annotation partielle ne contient qu&#8217;un marqueur.
&#8211; Niveaux : le nombre d&#8217;it&#233;rations de l&#8217;algorithme par niveaux est limit&#233; &#224; 7.
</p>
<p>L&#8217;approche que nous adoptons nous permet d&#8217;explorer exhaustivement les motifs fr&#233;quents et
confiants. Les seuils minimaux sont fix&#233;s &#224; 3 en fr&#233;quence et 5% en confiance. Le syst&#232;me extrait
alors 143 205 r&#232;gles d&#8217;annotation partielles 13. La figure 5 montre que la longueur des r&#232;gles varie
autour de trois &#233;l&#233;ments, et leur profondeur d&#8217;items 14 se situe autour de quatre. Ces statistiques
confirment que les r&#232;gles d&#8217;annotation sont explor&#233;es sur les deux axes que nous avons d&#233;finis.
Nous voyons aussi que la r&#233;partition des r&#232;gles d&#8217;annotation par types d&#8217;EN est diversement
corr&#233;l&#233;e au corpus. Les types time et amount sont moins repr&#233;sent&#233;s : il y a moins de descripteurs
pour ces types, il pourrait alors &#234;tre assez homog&#232;ne dans les donn&#233;es. Inversement, le type
prod, est sur-repr&#233;sent&#233; et nous faisons l&#8217;hypoth&#232;se qu&#8217;il est assez h&#233;t&#233;rog&#232;ne.
</p>
<p>13. En 15 minutes, sur un seul c&#339;ur, en consommant 1,5Go de RAM
14. Somme sur les items des sp&#233;cialisations au del&#224; de la racine
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>430 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 4 6
</p>
<p>0
</p>
<p>2
</p>
<p>4
</p>
<p>6
</p>
<p>&#183;104
N
</p>
<p>B
</p>
<p>100&#8804; F
30&#8804; F &lt; 100
3&#8804; F &lt; 30
</p>
<p>(a) Longueur des r&#232;gles
</p>
<p>0 5 10 15
</p>
<p>0
</p>
<p>1
</p>
<p>2
</p>
<p>3
</p>
<p>4
&#183;104
</p>
<p>N
B
</p>
<p>100&#8804; F
30&#8804; F &lt; 100
3&#8804; F &lt; 30
</p>
<p>(b) Profondeur des r&#232;gles
</p>
<p>19%
</p>
<p>6%10%
</p>
<p>12%
</p>
<p>16%
</p>
<p>33%
</p>
<p>4%
</p>
<p>prod
amount
fonc
loc
org
pers
time
</p>
<p>(c) Types d&#8217;entit&#233;s des r&#232;gles
</p>
<p>FIGURE 5 &#8211; Caract&#233;ristiques des r&#232;gles d&#8217;annotation extraites
</p>
<p>4.3 Reconnaissance d&#8217;entit&#233;s nomm&#233;es
</p>
<p>Nous utilisons l&#8217;outil scikit-learn 15 (Pedregosa et al., 2011) pour r&#233;aliser la r&#233;gression logistique.
La figure 6 pr&#233;sente les r&#233;sultats obtenus en SER 16 et les taux par types d&#8217;erreurs (Galibert et al.,
2011). Ces graphiques confirment que le syst&#232;me r&#233;duit graduellement ses erreurs &#224; mesure que
les seuils de fr&#233;quence et de confiance sont abaiss&#233;s.
</p>
<p>20406080
0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>C
</p>
<p>SE
R
</p>
<p>F &#8805; 21
F &#8805; 42
F &#8805; 63
F &#8805; 84
</p>
<p>(a) Performances
</p>
<p>20406080
0
</p>
<p>20
</p>
<p>40
</p>
<p>60
</p>
<p>80
</p>
<p>100
</p>
<p>C
</p>
<p>Ta
ux
</p>
<p>d&#8217;
er
</p>
<p>re
ur
</p>
<p>s
</p>
<p>Insertions
D&#233;l&#233;tion
</p>
<p>Substitutions
</p>
<p>(b) Erreurs, F &#8805; 21
</p>
<p>FIGURE 6 &#8211; Performances (SER) et erreurs selon la Fr&#233;quence (F) et la Confiance (C)
</p>
<p>Nous menons des exp&#233;riences suppl&#233;mentaires , dont les r&#233;sultats sont report&#233;s dans le tableau 2
pour les configurations suivantes :
</p>
<p>&#8211; Logit : syst&#232;me par d&#233;faut
&#8211; Logit-Dicos : d&#233;sactivation des ressources lexicales
&#8211; Logit+Test : apprentissage en fusionnant les corpus Etape-Train et Etape-Dev
&#8211; Logit-D25 : filtrage &#948; &#224; 25%,
&#8211; Logit-D50 : filtrage &#948; &#224; 50%,
&#8211; Logit-D75 : filtrage &#948; &#224; 75%,
</p>
<p>15. http://scikit-learn.org
16. Slot Error Rate, taux d&#8217;erreur pond&#233;r&#233;
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>431 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le syst&#232;me donne des r&#233;sultats satisfaisants, &#233;tant donn&#233; la difficult&#233; de la t&#226;che. Sans surprise, la
d&#233;sactivation des dictionnaires d&#233;grade consid&#233;rablement les performances. Lorsque les donn&#233;es
comportent les donn&#233;es d&#8217;&#233;valuation (Logit+Test), le surapprentissage est mod&#233;r&#233;, ce qui est
li&#233; au fait que les r&#232;gles d&#8217;annotation ne sont pas lexicalis&#233;es. Les exp&#233;riences Logit-DXX nous
montrent clairement que le syst&#232;me obtient encore des performances tr&#232;s acceptables lorsque
l&#8217;on r&#233;duit significativement le nombre de r&#232;gles extraites &#224; l&#8217;aide du filtrage &#948;.
</p>
<p>Approche R&#232;gles SER I D S P R Fm
Logit 143 205 35,9 5,6 24,2 10,8 79,8 64,9 71,6
</p>
<p>Logit-Dicos 80 231 45,2 5,9 30,2 16,3 70,7 53,5 60,9
Logit+Test 141 550 26,3 3,2 18,6 8,1 86,6 73,3 79,4
Logit-D25 100 027 36,2 5,6 24,6 10,9 79,7 64,6 71,3
Logit-D50 73 332 36,7 5,4 25,2 11,0 79,5 63,8 70,8
Logit-D75 50 408 39,0 5,4 27,0 11,7 78,2 61,3 68,7
</p>
<p>TABLE 2 &#8211; Performances (SER), erreurs d&#8217;Insertion (I), de D&#233;l&#233;tion (D), de Substitution (S),
Pr&#233;cision (P), Rappel (R), F-mesure (Fm) des approches
</p>
<p>Nous menons des &#233;valuations s&#233;par&#233;es des types primaires (sans sous-types) d&#8217;entit&#233;s nomm&#233;es
et de composants. La figure 7 en donne les r&#233;sultats. Les entit&#233;s nomm&#233;es sont moins bien
reconnues que les composants et plusieurs types (en particulier les expressions de temps) posent
encore probl&#232;me. Ceci dit, le syst&#232;me &#233;quilibre relativement bien sa pr&#233;cision et son rappel et la
reconnaissance d&#8217;entit&#233;s nomm&#233;es selon l&#8217;approche pr&#233;sent&#233;e donne des r&#233;sultats.
</p>
<p>Types SER P R Fm
Entit&#233;s 38,9 76,4 62,3 68,6
</p>
<p>Composants 33,0 86,4 68,5 76,4
Tous 35,9 79,8 64,9 71,6
</p>
<p>prod
amount
</p>
<p>func
loc org pers time
</p>
<p>0
20
40
60
80
</p>
<p>100
</p>
<p>FIGURE 7 &#8211; SER, pr&#233;cision (gauche) et rappel (droite) par types primaires et composants
</p>
<p>La phase d&#8217;adjudication de la campagne d&#8217;&#233;valuation ETAPE n&#8217;est pas achev&#233;e &#224; l&#8217;heure de
la r&#233;daction de cet article. Nous avons cependant &#233;t&#233; autoris&#233;s &#224; reporter en table 3 les per-
formances anonymes des syst&#232;mes avant adjudication. Les SER pr&#233;sent&#233;s sont donn&#233;s sur les
transcriptions manuelles et sur les sorties de diff&#233;rents syst&#232;mes de reconnaissance, pour lesquels
sont mentionn&#233;s les WER 17.
</p>
<p>Parmi les autres syst&#232;mes participants, le syst&#232;me 3 utilise des CRF (binaris&#233;s, un par type), le
syst&#232;me 6/7/8 utilise un CRF pour les composants et un PCFG pour reconstituer les entit&#233;s,
CasEN utilise des transducteurs. De mani&#232;re g&#233;n&#233;rale, mXS affiche de bonnes performances (entre
la 1 &#232;re et la 3 &#232;me position). Les taux d&#8217;erreurs &#233;lev&#233;s sont li&#233;s &#224; la difficult&#233; de la t&#226;che (parole
spontan&#233;e, imbrications, typologie fine). Sans surprise, les performances sont d&#233;grad&#233;es sur
les donn&#233;es bruit&#233;es par la reconnaissance de parole. Nous voyons que mXS et r&#233;siste bien aux
erreurs de reconnaissance de la parole.
</p>
<p>17. Word Error Rate
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>432 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Part. Type Man Rover WER23 WER24 WER25 WER30 WER35
1 OC 84.8 98,1 100,7 94,2 98,9 98,4 100,9
2 OC 172.0 147,4 178,8 160,4 168,0 163,9 168,2
3 CRF 33.8 57,2 59,3 64,7 62,0 61,7 71,8
4 OC 55.6 88,0 98,8 76,8 92,8 94,9 99,6
5 CRF 43.6 69,7 73,8 72,1 73,7 74,8 86,0
6 CRF+PCFG na 79,2 79,5 66,8 80,8 80,0 87,0
7 CRF+PCFG na 67,8 68,4 67,6 70,9 69,9 85,2
8 CRF+PCFG 36.4 na na na na na na
9 CRF 62.8 75,8 79,2 76,9 79,8 80,5 90,5
10 OC 42.9 65,0 69,9 66,3 70,5 69,9 87,0
</p>
<p>CasEN OC 49.3 na na 68,4 na na na
mXS R&#232;gles 41.0 63,7 67,5 64,1 69,1 68,6 80,4
</p>
<p>TABLE 3 &#8211; SER de la campagne Etape par syst&#232;me (OC=Orient&#233; Connaissances) sur les transcrip-
tions avant adjudication (manuel : Man, transcription automatiques : Rover et WERXX, dont
WER24 avec majuscules)
</p>
<p>5 Conclusion
</p>
<p>La reconnaissance d&#8217;entit&#233;s nomm&#233;es structur&#233;es sur de la parole spontan&#233;e n&#233;cessite de mettre
au point des syst&#232;mes robustes. Dans cet article, nous pr&#233;sentons une approche originale &#224; base
de fouille de donn&#233;es, qui extrait des r&#232;gles d&#8217;annotation partielles et param&#232;tre un mod&#232;le
num&#233;rique les utilisant.
</p>
<p>Les r&#233;sultats obtenus dans le cadre de la campagne Etape indiquent que notre approche novatrice
fait jeu &#233;gal avec les syst&#232;mes &#233;tat de l&#8217;art. Pour &#233;viter tout biais m&#233;thodologique, nous restons
toutefois en attente d&#8217;une r&#233;f&#233;rence d&#233;barrass&#233;e de toute erreur d&#8217;annotation : c&#8217;est l&#8217;objectif de
la phase d&#8217;adjudication en cours. Notre objectif &#224; court terme est de mieux caract&#233;riser les points
forts et limitations du mod&#232;le (d&#233;tection s&#233;par&#233;e du d&#233;but et de la fin des annotations). Nous
comptons &#233;galement mettre &#224; l&#8217;&#233;preuve le syst&#232;me sur d&#8217;autres t&#226;ches qui pourraient b&#233;n&#233;ficier
de l&#8217;extraction de motifs de segments.
</p>
<p>Remerciements
</p>
<p>Ces travaux ont &#233;t&#233; r&#233;alis&#233;s dans le cadre du projet ANR Etape. Merci en particulier &#224; Olivier
Galibert (LNE), Matthieu Carr&#233; (ELDA) et Guillaume Gravier (IRISA).
</p>
<p>R&#233;f&#233;rences
</p>
<p>AGRAWAL, R. et SRIKANT, R. (1995). Mining sequential patterns. In International Conference on Data
Engineering (ICDE&#8217;95), pages 3&#8211;14.
BIKEL, D., SCHWARTZ, R. et WEISCHEDEL, R. M. (1999). An algorithm that learns what&#8217;s in a name. Machine
Learning, 34:211&#8211;231.
BRUN, C. et EHRMANN, M. (2010). Un syst&#232;me de d&#233;tection d&#8217;entit&#233;s nomm&#233;es adapt&#233; pour la campagne
d&#8217;&#233;valuation ester 2. In Traitement Automatique du Langage Naturel (TALN&#8217;10).
B&#201;CHET, F., SAGOT, B. et STERN, R. (2011). Coop&#233;ration de m&#233;thodes statistiques et symboliques pour
l&#8217;adaptation non-supervis&#233;e d&#8217;un syst&#232;me d&#8217;&#233;tiquetage en entit&#233;s nomm&#233;es. In Traitement Automatique des
Langues Naturelles (TALN&#8217;11).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>433 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CELLIER, P. et CHARNOIS, T. (2010). Fouille de donn&#233;es s&#233;quentielles d&#8217;itemsets pour l&#8217;apprentissage de
patrons linguistiques. In Traitement Automatique des Langues Naturelles (TALN&#8217;10).
DINARELLI, M. et ROSSET, S. (2011). Models cascade for tree-structured named entity detection. In
International Joint Conference on Natural Language Processing (IJCNLP&#8217;11).
EKBALA, A., SOURJIKOVA, E., FRANK, A. et PONZETTO, S. P. (2010). Assessing the challenge of fine-grained
named entity recognition and classification. In Annual Meeting of the Association for Computational
Linguistics (ACL&#8217;10) - Named Entities Workshop, pages 93&#8211;101, Uppsala, Sweden.
FINKEL, J. R. et MANNING, C. D. (2005). Nested named entity recognition. In Conference on Empirical
Methods in Natural Language Processing (EMNLP&#8217;09).
FISCHER, J., HEUN, V. et KRAMER, S. (2005). Fast frequent string mining using suffix arrays. In 5th IEEE
International Conference on Data Mining (ICDM&#8217;05), pages 609&#8211;612.
FRIBURGER, N. et MAUREL, D. (2004). Finite-state transducer cascades to extract named entities in texts.
Theoretical Computer Sciences (TCS), 313:93&#8211;104.
GALIBERT, O., ROSSET, S., GROUIN, C., ZWEIGENBAUM, P. et QUINTARD, L. (2011). Structured and extended
named entity evaluation in automatic speech transcriptions. In International Joint Conference on Natural
Language Processing (IJCNLP&#8217;11).
GALLIANO, S., GRAVIER, G. et CHAUBARD, L. (2009). The ester 2 evaluation campaign for the rich transcription
of french radio broadcasts. In International Speech Communication Association (INTERSPEECH&#8217;09).
GRISHMAN, R. et SUNDHEIM, B. (1996). Message undersrtanding conference - 6 : A brief history. In
International Conference on Computational Linguistics (COLING&#8217;96), pages 466&#8211;471, Copenhagen, Denmark.
HOBBS J. R., Appelt D., B. J. I. D. K. M. S. M. et TYSON, M. (1996). FASTUS : A Cascaded Finite-State
Transducer for Extracting Information from Natural-Language Text, pages 383&#8211;406.
MCCALLUM, A., FREITAG, D. et PEREIRA, F. (2000). Maximum entropy markov models for information
extraction and segmentation. In International Conference on Machine Learning (ICML&#8217;00), pages 591&#8211;598.
MCDONALD, D. D. (1996). Internal and External Evidence in the Identification and Semantic Categorisation
of Proper Names, pages 32&#8211;43.
MIKHEEV, A., MOENS, M. et GROVER, C. (1999). Named entity recognition without gazetteers. In Proc. of
the Ninth Conference of the European Chapter of the Association for Computational Linguistics, pages 1&#8211;8.
PASQUIER, N., BASTIDE, Y., TAOUIL, R. et LAKHAL, L. (1999). Efficient mining of association rules using closed
itemset lattices. INF. SYST., 24(1):25&#8211;46.
PEDREGOSA, F., VAROQUAUX, G., GRAMFORT, A., MICHEL, V., THIRION, B., GRISEL, O., BLONDEL, M., PRETTEN-
HOFER, P., WEISS, R., DUBOURG, V., VANDERPLAS, J., PASSOS, A., COURNAPEAU, D., BRUCHER, M., PERROT, M.
et &#201;douard DUCHESNAY (2011). Scikit-learn : Machine learning in python. Journal of Machine Learning
Research, 12:2825&#8211;2830.
RAYMOND, C. et FAYOLLE, J. (2010). Reconnaissance robuste d&#8217;entit&#233;s nomm&#233;es sur de la parole transcrite
automatiquement. In Traitement Automatique des Langues Naturelles (TALN&#8217;10).
ROSSET, S., GROUIN, C. et ZWEIGENBAUM, P. (2011). Entit&#233; nomm&#233;es structur&#233;es : guide d&#8217;annotation quaero.
Rapport technique, LIMSI (2011-04).
SCHMID, H. (1994). Probabilistic pos tagging using decision trees. In New Meth. in Lang. Proc. (NEMLP&#8217;94).
SRIKANT, R. et AGRAWAL, R. (1996). Mining sequential patterns : Generalizations and performance
improvements. In International Conference on Extending Database Technology (EDBT&#8217;96), pages 3&#8211;17.
STEPHENS, C. S. (1993). The analysis and acquisition of proper names for the understanding of free text.
Computers and the Humanities, 26:441&#8211;456.
WANG, J. et HAN, J. (2004). Bide : Efficient mining of frequent closed sequences. In International Conference
on Data Engineering (ICDE&#8217;04).
ZIDOUNI, A., ROSSET, S. et GLOTIN, H. (2010). Efficient combined approach for named entity recognition in
spoken language. In Conference of the International Speech Communication Association (INTERSPEECH&#8217;10).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>434 c&#65535; ATALA</p>

</div></div>
</body></html>