<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Adaptation de la plateforme corporale ScienQuest pour l'aide &#224; la r&#233;daction en langue seconde</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Adaptation de la plateforme corporale ScienQuest pour 
l'aide &#224; la r&#233;daction en langue seconde
</p>
<p>Achille Falaise
Universit&#233; Grenoble Alpes, LIG-GETALP, F-38040 Grenoble
</p>
<p>!&quot;#$%%&amp;'(!%!$)&amp;*$+!,'(-
</p>
<p>R&#201;SUM&#201; ________________________________________________________________________
</p>
<p>La  plateforme  ScienQuest  fut  initialement  cr&#233;&#233;e  pour  l'&#233;tude  linguistique  du 
positionnement  et  du  raisonnement  dans  le  corpus  Scientext.  Cette  d&#233;monstration 
pr&#233;sente  les  modifications  apport&#233;es  &#224;  cette  plateforme,  pour  en  faire  une  base 
phras&#233;ologique adapt&#233;e &#224; l'aide &#224; la r&#233;daction en langue seconde. Cette adaptation est 
utilis&#233;e dans le cadre de deux exp&#233;rimentations en cours : l'aide &#224; la r&#233;daction en anglais 
pour les scientifiques, et l'aide &#224; la r&#233;daction acad&#233;mique en fran&#231;ais pour les apprenants.
</p>
<p>ABSTRACT ______________________________________________________________________
</p>
<p>Adaptation of the corpus platform ScienQuest for assistance to  writing in a second 
language
</p>
<p>The ScienQuest platform was initially created for the linguistic study of positioning and 
reasoning in the Scientext  corpus.  This demonstration introduces modifications to this  
platform, transforming it into a phraseological database adapted for assistance to writing 
in a second language. This adaptation is used as part of two ongoing experiments:  an 
assistance to writing in English for scientists,  and an assistance to academic writing in 
French for learners.
</p>
<p>MOTS-CL&#201;S : Aide &#224; la r&#233;daction, langue seconde, ScienQuest, Scientext. 
KEYWORDS : Writing assistance, second language, ScienQuest, Scientext.
</p>
<p>1 Introduction
</p>
<p>De plus en plus de personnes sont amen&#233;es &#224; &#233;crire dans une langue seconde, c'est &#224; dire 
une langue qu'ils ma&#238;trisent partiellement, mais qui n'est pas leur langue maternelle. Ces 
personnes, qui disposent d&#233;j&#224; d'un bagage lexical, peuvent n&#233;anmoins avoir des difficult&#233;s 
&#224;  s'en servir,  du fait d'une connaissance imparfaite de l'usage de la langue. Un corpus 
(Boulton et al.,  2006), ou une base phras&#233;ologique,  aliment&#233;e d'exemples choisis pour 
&#233;clairer certaines notions cl&#233;s (introduire une id&#233;e, se positionner, etc.), peut les aider.
</p>
<p>2 La plateforme corporale ScienQuest
</p>
<p>La  plateforme  ScienQuest  (Falaise  et  al.,  2011)  fut  initialement  cr&#233;&#233;e  pour  l'&#233;tude 
linguistique du positionnement et du raisonnement dans le corpus de textes scientifiques 
Scientext (Tutin  et al., 2009). Cet outil permet de rechercher des concordances dans ce 
corpus, en fonction de crit&#232;res linguistiques. Il est destin&#233; &#224; des linguistes : les crit&#232;res sont 
formul&#233;s  en  termes  linguistiques,  les  concordances  peuvent  comporter  des  erreurs 
(notamment  dues  &#224;  des  erreurs  d'annotation  dans  le  corpus)  et  des  r&#233;sultats  peu 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>805 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pertinents (les r&#233;sultats peuvent &#234;tre filtr&#233;s mais ce filtrage ne peut pas &#234;tre sauvegard&#233;) ; 
enfin, certaines fonctionnalit&#233;s sont superflues pour des utilisateurs non-linguistes (par 
exemple, les statistiques lexicom&#233;triques). 
</p>
<p>3 Adaptation de la plateforme
</p>
<p>L'adaptation de ScienQuest a consist&#233; en l'ajout de trois fonctionnalit&#233;s &#224; la plateforme : 
</p>
<p>1. la  possibilit&#233;  d'exporter  et  de  sauvegarder  sur  le  serveur  des  concordances 
filtr&#233;es ;
</p>
<p>2. la possibilit&#233; d'importer ou de restaurer ces concordances filtr&#233;es ;
</p>
<p>3. la cr&#233;ation d'un nouveau mode de visualisation simplifi&#233;, limit&#233; &#224; la visualisation 
des concordances.
</p>
<p>4 Conclusion
</p>
<p>L'adaptation pr&#233;sent&#233;e dans cette d&#233;monstration sert de base &#224; deux exp&#233;rimentations en 
cours, concernant l'aide &#224; la r&#233;daction en anglais pour les scientifiques (Jacques  et al., 
2013)  et  l'aide  &#224;  la  r&#233;daction  acad&#233;mique  en  fran&#231;ais  pour  les  apprenants  (Tutin  et 
Falaise, 2013).
</p>
<p>References! !
</p>
<p>BOULTON, A., WILHELM, S. (2006). Habeant Corpus-they should have the body. Tools learners 
have the right to use. In ASp, 49-50, pages 155-170.
</p>
<p>FALAISE, A., TUTIN, A., KRAIF, O. (2011). Exploitation d&#8217;un corpus arbor&#233; pour non sp&#233;cialistes 
par des requ&#234;tes guid&#233;es et des requ&#234;tes s&#233;mantiques. In Actes de TALN 2011, Montpellier, 
pages 187-215.
</p>
<p>JACQUES, M.-P., HARTWELL L., FALAISE A. (2013). TAL et linguistique de corpus pour aider la 
r&#233;daction scientifique en anglais. In Actes de TALN 2013, Les Sables d'Olonne.
</p>
<p>TUTIN A., FALAISE A. (2013). Multiword expressions in scientific discourse: a corpus-driven 
database. In eLex 2013, Tallinn, Estonie.
</p>
<p>TUTIN A., GOSSMANN F., FALAISE A., KRAIF O. (2009). Autour du projet Scientext : &#233;tude des 
marques  linguistiques  du  positionnement  de  l&#8217;auteur  dans  les  &#233;crits  scientifiques.  In 
Journ&#233;es Linguistique de Corpus, Lorient.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>806 c&#65535; ATALA</p>

</div></div>
</body></html>