<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction des relations temporelles entre &#233;v&#233;nements m&#233;dicaux dans des comptes rendus hospitaliers</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction des relations temporelles entre &#233;v&#233;nements
m&#233;dicaux dans des comptes rendus hospitaliers
</p>
<p>Pierre Zweigenbaum1 Xavier TANNIER1,2
1 LIMSI&#8211;CNRS, Orsay 2Univ. Paris-Sud, Orsay
</p>
<p>R&#201;SUM&#201;
Le d&#233;fi i2b2/VA 2012 &#233;tait d&#233;di&#233; &#224; la d&#233;tection de relations temporelles entre &#233;v&#233;nements
et expressions temporelles dans des comptes rendus hospitaliers en anglais. Les situations
consid&#233;r&#233;es &#233;taient beaucoup plus vari&#233;es que dans les d&#233;fis TempEval. Nous avons donc ax&#233;
notre travail sur un examen syst&#233;matique de 57 situations diff&#233;rentes et de leur importance dans
le corpus d&#8217;apprentissage en utilisant un oracle, et avons d&#233;termin&#233; empiriquement le classifieur
qui se comportait le mieux dans chaque situation, atteignant ainsi une F-mesure globale de 0,623.
</p>
<p>ABSTRACT
Extraction of temporal relations between clinical events in clinical documents
</p>
<p>The 2012 i2b2/VA challenge focused on the detection of temporal relations between events and
temporal expressions in English clinical texts. The addressed situations were much more diverse
than in the TempEval challenges. We thus focused on the systematic study of 57 distinct situations
and their importance in the training corpus by using an oracle, and empirically determined the
best performing classifier for each situation, thereby achieving a 0.623 F-measure.
</p>
<p>MOTS-CL&#201;S : extraction d&#8217;information, &#233;v&#233;nements m&#233;dicaux, relations temporelles, m&#233;decine.
KEYWORDS: Information Extraction, Clinical Events, Temporal Relations, Medicine.
</p>
<p>1 Introduction
</p>
<p>La d&#233;tection des relations temporelles entre &#233;v&#233;nements dans un texte fournit des informations
pr&#233;cieuses pour l&#8217;extraction d&#8217;information, la recherche de r&#233;ponses &#224; des questions, voire la
traduction automatique. Les d&#233;fis TempEval (Verhagen et al., 2010) ont abord&#233; cette probl&#233;ma-
tique en &#171; domaine ouvert &#187;, en cherchant &#224; d&#233;tecter (dans TempEval2) cinq types de relations
temporelles (BEFORE, AFTER, OVERLAP, BEFORE-OR-OVERLAP, OVERLAP-OR-AFTER) ou l&#8217;absence de
relation d&#233;termin&#233;e (VAGUE). Ces relations &#233;taient &#224; trouver dans quatre situations : entre un
&#233;v&#233;nement et une date ou un autre &#233;v&#233;nement qu&#8217;il domine syntaxiquement dans une phrase,
entre un &#233;v&#233;nement et la date de cr&#233;ation du document, ou entre les deux &#233;v&#233;nements principaux
de deux phrases cons&#233;cutives.
</p>
<p>Identifier les informations temporelles d&#233;crivant la chronologie du s&#233;jour hospitalier d&#8217;un patient
devrait amener une am&#233;lioration de la qualit&#233; de la prise en charge des patients (Harkema et al.,
2005; Zhou et al., 2006; Savova et al., 2009). Une meilleure connaissance de l&#8217;encha&#238;nement
des probl&#232;mes m&#233;dicaux, des ant&#233;c&#233;dents, des traitements, des rendez-vous, des op&#233;rations,
permet en effet d&#8217;aider les analyses et les d&#233;cisions des m&#233;decins ou des syst&#232;mes de surveillance
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>643 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>automatique. Les t&#226;ches et corpus du d&#233;fi i2b2/VA 2012 (Sun et al., 2013) ont ainsi &#233;t&#233; cr&#233;&#233;s
dans la perspective d&#8217;&#233;valuer les m&#233;thodes d&#8217;extraction de ce type d&#8217;information &#224; partir de textes
cliniques. Nous nous int&#233;ressons ici &#224; la t&#226;che de d&#233;tection des relations temporelles de ce d&#233;fi.
</p>
<p>Cette t&#226;che diff&#232;re de la t&#226;che TempEval pr&#233;sent&#233;e ci-dessus de plusieurs fa&#231;ons. Premi&#232;rement,
elle ne consid&#232;re que les trois premi&#232;res relations (BEFORE, AFTER, OVERLAP) et l&#8217;absence de
relation (que nous noterons NIL), les autres ayant un trop faible accord interannotateur lors de
leur annotation humaine. Deuxi&#232;mement, elle ne restreint pas les situations o&#249; l&#8217;on peut trouver
ces relations : d&#233;pendance syntaxique ou pas, phrases cons&#233;cutives ou pas, etc. Troisi&#232;mement,
les documents analys&#233;s, des comptes rendus hospitaliers, ont une structure qui les apparente &#224; la
concat&#233;nation de deux documents pr&#233;sent&#233;s dans deux sections successives clairement marqu&#233;es :
l&#8217;histoire de la maladie (History of Present Illness &#8211; HPI), telle que not&#233;e &#224; l&#8217;entr&#233;e dans l&#8217;h&#244;pital,
et qui a comme date de r&#233;f&#233;rence la date d&#8217;entr&#233;e dans l&#8217;h&#244;pital (Admission Date &#8211; AD) ; et ce
qui s&#8217;est pass&#233; pendant le s&#233;jour hospitalier (Hospital Course &#8211; HC), tel que not&#233; lors de la sortie
de l&#8217;h&#244;pital, et qui a comme date de r&#233;f&#233;rence la date de sortie de l&#8217;h&#244;pital (Discharge Date &#8211;
DD). Un compte rendu typique est pr&#233;sent&#233; partiellement &#224; la figure 1. On y voit les quatre
sections toujours pr&#233;sentes ainsi que l&#8217;annotation fournie sur les &#233;v&#233;nements et les expressions
temporelles, et finalement les relations &#224; trouver. Il peut &#233;galement arriver qu&#8217;une relation relie
des &#233;v&#233;nements d&#8217;une section (HC) &#224; l&#8217;autre (HPI).
</p>
<p>ADMISSION DATE : &lt;TIMEX3 type=&quot;date&quot; id=&quot;t1&quot;&gt;10/17/95&lt;/TIMEX3&gt;
DISCHARGE DATE : &lt;TIMEX3 type=&quot;date&quot; id=&quot;t2&quot;&gt;10/20/95&lt;/TIMEX3&gt;
HISTORY OF PRESENT ILLNESS :
</p>
<p>This is a 73-year-old man with &lt;EVENT type=&quot;problem&quot; id=&quot;e1&quot;&gt;squamous
cell carcinoma of the lung&lt;/EVENT&gt;, status post &lt;EVENT type=&quot;treatment&quot;
id=&quot;e2&quot;&gt;lobectomy&lt;/EVENT&gt; and &lt;EVENT type=&quot;treatment&quot; id=&quot;e3&quot;&gt;resection&lt;/EVENT&gt; of
&lt;EVENT type=&quot;problem&quot; id=&quot;e4&quot;&gt;left cervical recurrence&lt;/EVENT&gt;, &lt;EVENT type=&quot;occurrence&quot;
id=&quot;e5&quot;&gt;admitted&lt;/EVENT&gt; here with &lt;EVENT type=&quot;problem&quot; id=&quot;e6&quot;&gt;fever&lt;/EVENT&gt; and
&lt;EVENT type=&quot;problem&quot; id=&quot;e7&quot;&gt;neutropenia&lt;/EVENT&gt;.
(...)
</p>
<p>HOSPITAL COURSE :
He was started on &lt;EVENT type=&quot;treatment&quot; id=&quot;e8&quot;&gt;Neupogen&lt;/EVENT&gt;, 400 mcg. subq. q.d.
(...)
He was &lt;EVENT type=&quot;occurrence&quot; id=&quot;e9&quot;&gt;discharged&lt;/EVENT&gt; home on
&lt;EVENT type=&quot;treatment&quot; id=&quot;e10&quot;&gt;Neupogen&lt;/EVENT&gt;.
</p>
<p>e3 OVERLAP e4 e1 OVERLAP t1 e2 BEFORE t1 e3 BEFORE t1
e4 BEFORE t1 e6 OVERLAP t1 e7 OVERLAP t1 e8 BEFORE t2
e9 OVERLAP t2 e10 OVERLAP t2
</p>
<p>FIGURE 1 &#8211; Extrait d&#8217;article (anonymis&#233;) du corpus i2b2/VA, montrant les &#233;v&#233;nements (EVENT),
les expressions temporelles (TIMEX3) ainsi que quelques relations temporelles. On remarque
que la notion d&#8217;&#233;v&#233;nement est diff&#233;rente de ce qu&#8217;elle est souvent dans le domaine g&#233;n&#233;ral : par
exemple, des verbes d&#8217;action peuvent ne pas &#234;tre des &#233;v&#233;nements mais des noms de m&#233;dicaments
sont des &#233;v&#233;nements, car ils d&#233;signent des traitements.
</p>
<p>Ces deux derni&#232;res diff&#233;rences cr&#233;ent un nombre bien plus grand de situations o&#249; l&#8217;on peut
rencontrer une relation temporelle que les quatre d&#233;finies dans TempEval. La plupart des
participants au d&#233;fi se sont cependant focalis&#233;s sur quelques types de situations : relations &#224;
l&#8217;int&#233;rieur d&#8217;une m&#234;me phrase, relations entre un &#233;v&#233;nement et la date d&#8217;entr&#233;e ou de sortie,
relations entre &#233;v&#233;nements co-r&#233;f&#233;rents.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>644 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#192; notre connaissance, la formalisation de chaque situation et l&#8217;importance de ces situations sur
le processus de d&#233;tection des relations temporelles n&#8217;ont pas jusqu&#8217;ici &#233;t&#233; &#233;tudi&#233;es de mani&#232;re
syst&#233;matique. Nous avons pouss&#233; cette logique &#224; l&#8217;extr&#234;me en segmentant l&#8217;espace de d&#233;tection
des liens temporels en 57 situations distinctes. Nous avons &#233;tudi&#233; l&#8217;importance de ces situations
sur notre corpus d&#8217;apprentissage en utilisant un oracle et avons d&#233;termin&#233; empiriquement le
classifieur qui correspondait le mieux &#224; chaque situation.
</p>
<p>Cet article &#233;tend celui pr&#233;sent&#233; &#224; l&#8217;atelier de cl&#244;ture du d&#233;fi i2b2/VA 2012 (Grouin et al., 2012)
par l&#8217;&#233;tude de ces situations oracle, r&#233;alis&#233;e depuis, et par les r&#233;sultats compl&#233;mentaires ainsi
obtenus. Pour des raisons d&#8217;espace, nous nous y focalisons sur la d&#233;couverte des relations
temporelles entre des &#233;v&#233;nements ou dates suppos&#233;s d&#233;j&#224; identifi&#233;s (nous d&#233;crivons la d&#233;tection
de ces &#233;v&#233;nements et dates dans (Grouin et al., 2012)). Nous pr&#233;sentons dans la suite notre
m&#233;thode d&#8217;identification et d&#8217;&#233;tiquetage des relations temporelles (section 2) puis l&#8217;&#233;valuation de
la pertinence des diff&#233;rentes variantes propos&#233;es (section 3).
</p>
<p>2 Identification des relations temporelles
</p>
<p>Comme indiqu&#233; ci-dessus, la t&#226;che consiste en premier lieu &#224; choisir les paires sujettes &#224; une
relation, puis &#224; typer celle-ci. Les quatre classes existantes sont donc BEFORE, AFTER, OVERLAP et
NIL, la derni&#232;re signifiant &#171; aucun lien &#187;. Par ailleurs, on note que des relations importantes sont
celles liant les dates d&#8217;admission (AD) et de sortie (DD) aux &#233;v&#233;nements des sections d&#8217;histoire
de la maladie (HPI) et de s&#233;jour hospitalier (HC).
</p>
<p>Situations. Pour deux &#233;v&#233;nements ou expressions temporelles donn&#233;es (collectivement not&#233;s
EVT) qui peuvent faire l&#8217;objet d&#8217;une relation temporelle, plusieurs situations &#233;mergent selon
leur section d&#8217;appartenance (AD, HPI, HC, AD), leur type (Event ou Timex3), leur pr&#233;sence
dans la m&#234;me phrase, la m&#234;me section, etc. Nous avons ainsi identifi&#233; 56 combinaisons (plus
&#171; OTHER &#187; pour les cas restants) des dimensions suivantes (nous utilisons le terme EVT pour
d&#233;signer indiff&#233;remment un EVENT ou Timex3) :
</p>
<p>&#8211; Section des EVT source et cible : AD, DD, HPI, HC ;
&#8211; Types d&#8217;&#233;l&#233;ments des EVT source et cible : Timex3 ou Event ;
&#8211; Distance entre EVT : m&#234;me phrase (SS), phrases adjacentes de la m&#234;me section (S1), phrases
</p>
<p>distantes ;
&#8211; Nombre de Timex3 entre deux &#233;v&#233;nements : aucune (NTB) ou au moins une.
</p>
<p>Pour chaque combinaison, une m&#233;thode appropri&#233;e sera appliqu&#233;e. Ainsi, TIMEX3-EVENT-DD-HC
formalise une situation avec une expression temporelle (Timex3) dans la section &#171; Discharge
Date &#187; (la date de sortie elle-m&#234;me) et un &#233;v&#233;nement (Event) dans la section &#171; Hospital Course &#187;
(Figure 2). Ces distinctions sont importantes dans la mesure o&#249;, par exemple dans cette situation,
la plupart des &#233;v&#233;nements cit&#233;s dans le s&#233;jour (HC) sont ant&#233;rieurs &#224; la date de sortie.
</p>
<p>Pour toutes les paires d&#8217;EVT du corpus d&#8217;apprentissage correspondant &#224; une situation, nous avons
test&#233; plusieurs classifieurs pour assigner &#224; chaque paire l&#8217;une des quatre classes. Cette approche
peut &#234;tre compar&#233;e &#224; un arbre de d&#233;cision initial dont les caract&#233;ristiques seraient fond&#233;es sur
ces quatre dimensions et pour lequel un autre classifieur serait appliqu&#233; &#224; chaque feuille. Ainsi,
une d&#233;cision par d&#233;faut pour TIMEX3-EVENT-DD-HC pourrait &#234;tre que l&#8217;&#233;v&#233;nement intervient
avant la date de sortie.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>645 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HPI
</p>
<p>AD
</p>
<p>HC
DD
</p>
<p>timex3
</p>
<p>evt
timex3
</p>
<p>evt
</p>
<p>evt
</p>
<p>evt
</p>
<p>TIM
EX3
</p>
<p>EVE
NT
</p>
<p>AD
HPI
</p>
<p>TIMEX3 EVENT DD HC
EV
</p>
<p>EN
T
EV
</p>
<p>EN
T
AD
</p>
<p>HP
I
</p>
<p>EVENT EVENT DD HC
</p>
<p>EVENT EVENT HPI HC Phrase 1
</p>
<p>Phrase 2
</p>
<p>timex3 evt1 evt2
</p>
<p>evt3
</p>
<p>SS EVENT EVENTSS EVENT TIMEX3
</p>
<p>S1 NTB
EVENT
</p>
<p>EVENT
</p>
<p>FIGURE 2 &#8211; Exemples de situations, li&#233;es &#224; la p&#233;riode de la section (gauche : *_AD_HPI, *_DD_HC),
dans la phrase courante ou dans la suivante (droite, SS*, S1*)
</p>
<p>La question qui se pose alors est d&#8217;identifier les situations les plus importantes &#224; traiter et les
m&#233;thodes &#224; utiliser. &#192; notre connaissance cette question n&#8217;a pas &#233;t&#233; trait&#233;e jusqu&#8217;ici, y compris
par les participants au d&#233;fi i2b2/VA 2012 &#8212; et dans TempEval les situations &#233;taient impos&#233;es.
Nous avons pour cela calcul&#233; un rappel &#171; oracle &#187; pour chaque situation, c&#8217;est-&#224;-dire la proportion
de relations dans l&#8217;ensemble du corpus de r&#233;f&#233;rence correspondant &#224; chaque situation. Ceci
constitue le rappel id&#233;al qui devrait &#234;tre atteint par un classifieur entra&#238;n&#233; pour cette situation.
Des exp&#233;riences nous ont montr&#233; qu&#8217;il est impossible d&#8217;obtenir un gain pour les situations avec
un rappel oracle inf&#233;rieur &#224; 1 % ; nous nous sommes donc focalis&#233;s sur les situations avec rappel
oracle sup&#233;rieur &#224; ce seuil.
</p>
<p>Caract&#233;ristiques d&#8217;apprentissage. Les caract&#233;ristiques choisies pour l&#8217;apprentissage sont &#224; la
fois internes et contextuelles :
</p>
<p>&#8211; Caract&#233;ristiques internes :
&#8211; Toutes les annotations de l&#8217;EVT (modalit&#233;, polarit&#233;, sous-types) ;
&#8211; Pour les &#233;v&#233;nements, une sous-cat&#233;gorisation d&#8217;apr&#232;s une &#233;tude du lexique dans le jeu
d&#8217;apprentissage (chirurgie, &#233;tat, &#233;v&#233;nement ponctuel, localisation, suivi d&#8217;&#233;v&#233;nement, autres) ;
</p>
<p>&#8211; Le texte de l&#8217;EVT (si parmi les 50 les plus fr&#233;quents) ;
&#8211; Les mots de l&#8217;EVT (si pr&#233;sents au moins 10 fois dans le corpus d&#8217;apprentissage) ;
&#8211; Nous avons &#233;galement test&#233; des classes distributionnelles (clusters de Brown) sur les mots
des EVT, combin&#233;es aux pr&#233;positions temporelles, mais cela n&#8217;a permis aucune am&#233;lioration.
</p>
<p>&#8211; Caract&#233;ristiques contextuelles :
&#8211; La distance entre les deux EVT de la relation ;
&#8211; La pr&#233;sence de pr&#233;positions temporelles ou non entre EVT ;
&#8211; Le nombre d&#8217;autres EVT entre les deux ;
&#8211; Pour les paires d&#8217;&#233;v&#233;nements dans une m&#234;me phrase, les d&#233;pendances syntaxiques obtenues
par l&#8217;analyseur syntaxique Charniak McClosky converties en d&#233;pendances de Stanford ;
</p>
<p>&#8211; Des combinaisons de ces traits, par exemple &lt;type-EVT-source, d&#233;pendance-syntaxique, type-
EVT-cible&gt;, o&#249; les types associ&#233;s &#224; source et cible sont les cat&#233;gories i2b2 (clinical department,
evidential, occurrence, problem, test, treatment ; date, duration, frequency, time).
</p>
<p>Absence de relation et fermeture transitive. La d&#233;finition de la t&#226;che implique que les annota-
tions manuelles sont incompl&#232;tes : certaines instances positives des relations temporelles peuvent
&#234;tre inf&#233;r&#233;es par une fermeture transitive depuis les annotations fournies par la r&#233;f&#233;rence, et ne
doivent donc pas &#234;tre consid&#233;r&#233;es comme des exemples n&#233;gatifs. Lors de l&#8217;apprentissage, nous
avons donc appliqu&#233;, comme Mani et al. (2006), une fermeture transitive de toutes les relations
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>646 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>temporelles avec l&#8217;outil Sputlink (Verhagen et Pustejovsky, 2008), les liens produits &#233;tant alors
utilis&#233;s comme des instances positives. Le produit crois&#233; des EVT de chaque document a servi &#224;
g&#233;n&#233;rer un ensemble complet de relations temporelles candidates, duquel les instances positives
ont &#233;t&#233; retir&#233;es de mani&#232;re &#224; g&#233;n&#233;rer un ensemble d&#8217;instances n&#233;gatives. La fermeture transitive
n&#8217;a en revanche pas &#233;t&#233; appliqu&#233;e lors de l&#8217;application sur les corpus d&#8217;apprentissage et de test
des mod&#232;les ainsi obtenus.
</p>
<p>Diff&#233;rents classifieurs. Les r&#233;sultats de Costa et Branco (2013) montrent que les meilleurs
r&#233;sultats dans chaque situation sont obtenus par diff&#233;rents classifieurs (dans leur cas, tables de
d&#233;cision, arbre de d&#233;cision, JRip, K &#233;toile, classifieur bay&#233;sien na&#239;f). Le classifieur &#224; arbres de
d&#233;cision J48, impl&#233;ment&#233; dans Weka &#224; partir de l&#8217;algorithme C4.5, a obtenu dans notre cas les
meilleurs r&#233;sultats. Nous avons &#233;galement &#233;valu&#233; les r&#233;sultats obtenus par d&#8217;autres classifieurs
(bay&#233;sien na&#239;f, s&#233;parateur &#224; vaste marge (LibSVM), k plus proches voisins, r&#233;gression logistique
(MaxEnt), for&#234;t d&#8217;abres d&#233;cisionnels) pour les principales situations 1. Nous avons retenu le
meilleur classifieur pour chaque situation et appliqu&#233; ce classifieur dans chaque instance de la
situation correspondante. Nous avons &#233;galement test&#233; une combinaison des classifieurs par un
vote, en utilisant la moyenne de leurs confiances respectives comme op&#233;rateur de combinaison.
</p>
<p>Sachant qu&#8217;une relation temporelle pr&#233;dite par un classifieur (ou inf&#233;r&#233;e par la fermeture
transitive) peut entrer en contradiction avec une relation pr&#233;c&#233;demment pr&#233;dite, nous avons
trait&#233; les situations par ordre d&#233;croissant de leur pr&#233;cision sur le jeu d&#8217;apprentissage. En cas
d&#8217;incoh&#233;rence, de mani&#232;re similaire &#224; (Mani et al., 2007), la nouvelle relation pr&#233;dite est &#233;cart&#233;e.
</p>
<p>D&#233;cisions &#224; base de r&#232;gles. Certaines relations peuvent &#234;tre identifi&#233;es &#224; partir de simples
r&#232;gles : l&#8217;admission est avant la sortie, la date et les &#233;v&#233;nements li&#233;s &#224; l&#8217;admission se chevauchent.
</p>
<p>3 &#201;valuation et discussion
</p>
<p>Le corpus d&#8217;apprentissage comprend 190 comptes rendus contre 120 dans le corpus de test.
Les objectifs du d&#233;fi (Sun et al., 2013) concernent l&#8217;identification de six types d&#8217;&#233;v&#233;nements
(d&#233;partement clinique, preuve, occurrence, probl&#232;me, examen, traitement), les expressions tem-
porelles (Timex3 : date, dur&#233;e, fr&#233;quence, heure) et les relations temporelles (Tlinks : de type
BEFORE, OVERLAP ou AFTER). Nous ne consid&#233;rons que les relations temporelles dans cet article.
Les mesures d&#8217;&#233;valuation utilis&#233;es sont d&#233;crites par Sun et al. (2013).
</p>
<p>La figure 3 (gauche) 2 repr&#233;sente le rappel oracle (RO) dans chaque situation du corpus d&#8217;ap-
prentissage, par ordre d&#233;croissant, sur une &#233;chelle semi-logarithmique. Les situations les plus
contributives (RO &gt; 0,01) concernent trois situations intra-phrase (SS-*, somme RO = 0,48),
quatre situations en lien avec les dates d&#8217;admission ou de sortie (*-AD-HPI, *-DD-HC, somme
RO = 0,31), une situation entre deux phrases successives (S1-NTB-EVENT-EVENT, RO = 0,04),
la co-r&#233;f&#233;rence (SAME-TEXT, RO = 0,02), et une relation &#224; plus longue distance entre &#233;v&#233;ne-
ments durant le s&#233;jour hospitalier (NTB-EVENT-EVENT-HC-HC, RO = 0,01). Nous nous sommes
int&#233;ress&#233;s aux huit premi&#232;res, abandonnant ainsi un rappel de 0,17 (dont les situations &#171; autres &#187;,
RO = 0,07). Nous avons par ailleurs constat&#233; que la situation EVENT-TIMEX3-AD-HPI pouvait
</p>
<p>1. Nous avons fait face &#224; une limitation technique dans l&#8217;usage de la r&#233;gression logistique de Weka, dont le nombre
d&#8217;attributs de type &#171; mots de l&#8217;EVT &#187; a d&#233;pass&#233; les capacit&#233;s. Nous l&#8217;avons donc utilis&#233;e sans cet attribut.
</p>
<p>2. La lecture de cette figure sur impression papier donne une id&#233;e g&#233;n&#233;rale de la distribution observ&#233;e, son examen
d&#233;taill&#233; est possible lors de sa lecture &#224; l&#8217;&#233;cran, o&#249; un facteur de grandissement peut &#234;tre appliqu&#233;.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>647 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>obtenir une bonne pr&#233;cision et l&#8217;avons ajout&#233;e &#224; l&#8217;ensemble des huit situations conserv&#233;es.
1e
</p>
<p>&#8722;0
4
</p>
<p>1e
&#8722;0
</p>
<p>3
1e
</p>
<p>&#8722;0
2
</p>
<p>1e
&#8722;0
</p>
<p>1
1e
</p>
<p>+0
0 full
</p>
<p>   
   
</p>
<p>   
   
</p>
<p>   
   
</p>
<p>   
SS
</p>
<p>&#8722;E
VE
</p>
<p>NT
&#8722;E
</p>
<p>VE
NT
</p>
<p>   
   
</p>
<p>   
  
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
DD
</p>
<p>&#8722;H
C 
</p>
<p>   
   
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
AD
</p>
<p>&#8722;H
PI
</p>
<p>   
   
</p>
<p>OT
HE
</p>
<p>R 
   
</p>
<p>   
   
</p>
<p>   
   
</p>
<p>   
 
</p>
<p>SS
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;T
IM
</p>
<p>EX
3 
</p>
<p>   
   
</p>
<p>   
S1
</p>
<p>&#8722;N
TB
</p>
<p>&#8722;E
VE
</p>
<p>NT
&#8722;E
</p>
<p>VE
NT
</p>
<p>   
   
</p>
<p> 
SS
</p>
<p>&#8722;T
IM
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T 
   
</p>
<p>   
   
</p>
<p>SA
M
</p>
<p>E&#8722;
TE
</p>
<p>XT
   
</p>
<p>   
   
</p>
<p>   
   
</p>
<p> 
EV
</p>
<p>EN
T&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
AD
</p>
<p>&#8722;H
PI
</p>
<p>   
   
</p>
<p> 
EV
</p>
<p>EN
T&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
DD
</p>
<p>&#8722;H
C 
</p>
<p>   
   
</p>
<p> 
NT
</p>
<p>B&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
HC
</p>
<p>&#8722;H
C 
</p>
<p>   
EV
</p>
<p>EN
T&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
AD
</p>
<p>&#8722;H
C 
</p>
<p>   
   
</p>
<p> 
EV
</p>
<p>EN
T&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
HC
</p>
<p>&#8722;H
C 
</p>
<p>   
   
</p>
<p> 
S1
</p>
<p>&#8722;E
VE
</p>
<p>NT
&#8722;E
</p>
<p>VE
NT
</p>
<p>   
   
</p>
<p>   
  
</p>
<p>S1
&#8722;N
</p>
<p>TB
&#8722;T
</p>
<p>IM
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T 
</p>
<p>   
  
</p>
<p>NT
B&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>HP
I&#8722;
</p>
<p>HP
I  
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
AD
</p>
<p>&#8722;H
PI
</p>
<p>   
   
</p>
<p>S1
&#8722;N
</p>
<p>TB
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;T
IM
</p>
<p>EX
3 
</p>
<p>   
  
</p>
<p>NT
B&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
HC
</p>
<p>&#8722;H
C 
</p>
<p>  
SS
</p>
<p>&#8722;T
IM
</p>
<p>EX
3&#8722;
</p>
<p>TI
M
</p>
<p>EX
3 
</p>
<p>   
   
</p>
<p>  
NT
</p>
<p>B&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
HP
</p>
<p>I&#8722;
HC
</p>
<p>   
S1
</p>
<p>&#8722;N
TB
</p>
<p>&#8722;T
IM
</p>
<p>EX
3&#8722;
</p>
<p>TI
M
</p>
<p>EX
3 
</p>
<p>   
 
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>HP
I&#8722;
</p>
<p>HP
I  
</p>
<p>   
 
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>HP
I&#8722;
</p>
<p>HC
   
</p>
<p>   
 
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
AD
</p>
<p>&#8722;H
C 
</p>
<p>   
   
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
DD
</p>
<p>&#8722;H
C 
</p>
<p>   
   
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>AD
&#8722;H
</p>
<p>PI
   
</p>
<p>  
EV
</p>
<p>EN
T&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>AD
&#8722;H
</p>
<p>C 
   
</p>
<p>   
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
HC
</p>
<p>&#8722;H
C 
</p>
<p>   
  
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
HC
</p>
<p>&#8722;H
C 
</p>
<p>   
   
</p>
<p>NT
B&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
HC
</p>
<p>&#8722;H
C 
</p>
<p>  
NT
</p>
<p>B&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>HP
I&#8722;
</p>
<p>HP
I 
</p>
<p>NT
B&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>HC
&#8722;H
</p>
<p>C 
 
</p>
<p>NT
B&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
HP
</p>
<p>I&#8722;
HP
</p>
<p>I 
EV
</p>
<p>EN
T&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
DD
</p>
<p>&#8722;H
PI
</p>
<p>   
   
</p>
<p> 
NT
</p>
<p>B&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
HP
</p>
<p>I&#8722;
HP
</p>
<p>I
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>HC
&#8722;H
</p>
<p>C 
   
</p>
<p>   
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
HP
</p>
<p>I&#8722;
HP
</p>
<p>I  
  
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>DD
&#8722;D
</p>
<p>D 
   
</p>
<p>   
 
</p>
<p>S1
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;T
IM
</p>
<p>EX
3 
</p>
<p>   
   
</p>
<p>   
EV
</p>
<p>EN
T&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>HP
I&#8722;
</p>
<p>HP
I  
</p>
<p>   
S1
</p>
<p>&#8722;T
IM
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T 
   
</p>
<p>   
   
</p>
<p>S1
&#8722;T
</p>
<p>IM
EX
</p>
<p>3&#8722;
TI
</p>
<p>M
EX
</p>
<p>3 
   
</p>
<p>   
  
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>HP
I&#8722;
</p>
<p>HC
   
</p>
<p>  
NT
</p>
<p>B&#8722;
SA
</p>
<p>M
E&#8722;
</p>
<p>TE
XT
</p>
<p>   
   
</p>
<p>   
   
</p>
<p>NT
B&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
HP
</p>
<p>I&#8722;
HC
</p>
<p>  
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>DD
&#8722;H
</p>
<p>PI
   
</p>
<p>   
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>HP
I&#8722;
</p>
<p>HP
I  
</p>
<p>   
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
AD
</p>
<p>&#8722;H
C 
</p>
<p>   
  
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>AD
&#8722;D
</p>
<p>D 
   
</p>
<p>   
 
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
DD
</p>
<p>&#8722;H
PI
</p>
<p>   
   
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
HP
</p>
<p>I&#8722;
HC
</p>
<p>   
   
</p>
<p>NT
B&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
HP
</p>
<p>I&#8722;
HC
</p>
<p>  
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>AD
&#8722;D
</p>
<p>D 
   
</p>
<p>   
EV
</p>
<p>EN
T&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>AD
&#8722;D
</p>
<p>D 
   
</p>
<p>   
EV
</p>
<p>EN
T&#8722;
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>DD
&#8722;D
</p>
<p>D 
   
</p>
<p>   
nil
</p>
<p>   
   
</p>
<p>   
   
</p>
<p>   
   
</p>
<p>   
 
</p>
<p>rb
   
</p>
<p>   
   
</p>
<p>   
   
</p>
<p>   
   
</p>
<p>  
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>HP
I&#8722;
</p>
<p>HC
   
</p>
<p>   
</p>
<p>J48 (entra&#238;nement, validation crois&#233;e 4 fois)
</p>
<p>0.
0
</p>
<p>0.
2
</p>
<p>0.
4
</p>
<p>0.
6
</p>
<p>0.
8
</p>
<p>1.
0
</p>
<p>fu
ll
</p>
<p>SS
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;E
VE
</p>
<p>NT
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
DD
</p>
<p>&#8722;H
C
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
AD
</p>
<p>&#8722;H
PI
</p>
<p>SS
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;T
IM
</p>
<p>EX
3
</p>
<p>S1
&#8722;N
</p>
<p>TB
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;E
VE
</p>
<p>NT
</p>
<p>SS
&#8722;T
</p>
<p>IM
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>AD
&#8722;H
</p>
<p>PI
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>DD
&#8722;H
</p>
<p>C
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
AD
</p>
<p>&#8722;H
PI rb
</p>
<p>1.
00
</p>
<p>00
0.
</p>
<p>59
23
</p>
<p>0.
70
</p>
<p>18
0.
</p>
<p>38
15
</p>
<p>0.
26
</p>
<p>18
0.
</p>
<p>53
54
</p>
<p>0.
15
</p>
<p>79
0.
</p>
<p>12
59
</p>
<p>0.
93
</p>
<p>56
0.
</p>
<p>12
33
</p>
<p>0.
06
</p>
<p>26
0.
</p>
<p>83
08
</p>
<p>0.
06
</p>
<p>07
0.
</p>
<p>03
73
</p>
<p>0.
63
</p>
<p>07
0.
</p>
<p>04
20
</p>
<p>0.
01
</p>
<p>54
0.
</p>
<p>35
37
</p>
<p>0.
03
</p>
<p>93
0.
</p>
<p>01
53
</p>
<p>0.
64
</p>
<p>99
0.
</p>
<p>01
75
</p>
<p>0.
00
</p>
<p>06
0.
</p>
<p>68
72
</p>
<p>0.
01
</p>
<p>18
0.
</p>
<p>00
04
</p>
<p>0.
78
</p>
<p>26
0.
</p>
<p>00
28
</p>
<p>0.
00
</p>
<p>26
0.
</p>
<p>79
31
</p>
<p>0.
00
</p>
<p>00 0.
03
</p>
<p>63
0.
</p>
<p>79
25
</p>
<p>Rappel oracle
Rappel
Pr&#233;cision
</p>
<p>Logistic (entra&#238;nement, validation crois&#233;e 4 fois)
</p>
<p>0.
0
</p>
<p>0.
2
</p>
<p>0.
4
</p>
<p>0.
6
</p>
<p>0.
8
</p>
<p>1.
0
</p>
<p>fu
ll
</p>
<p>SS
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;E
VE
</p>
<p>NT
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
DD
</p>
<p>&#8722;H
C
</p>
<p>TI
M
</p>
<p>EX
3&#8722;
</p>
<p>EV
EN
</p>
<p>T&#8722;
AD
</p>
<p>&#8722;H
PI
</p>
<p>SS
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;T
IM
</p>
<p>EX
3
</p>
<p>S1
&#8722;N
</p>
<p>TB
&#8722;E
</p>
<p>VE
NT
</p>
<p>&#8722;E
VE
</p>
<p>NT
</p>
<p>SS
&#8722;T
</p>
<p>IM
EX
</p>
<p>3&#8722;
EV
</p>
<p>EN
T
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>AD
&#8722;H
</p>
<p>PI
</p>
<p>EV
EN
</p>
<p>T&#8722;
EV
</p>
<p>EN
T&#8722;
</p>
<p>DD
&#8722;H
</p>
<p>C
</p>
<p>EV
EN
</p>
<p>T&#8722;
TI
</p>
<p>M
EX
</p>
<p>3&#8722;
AD
</p>
<p>&#8722;H
PI rb
</p>
<p>1.
00
</p>
<p>00
0.
</p>
<p>51
79
</p>
<p>0.
50
</p>
<p>89
0.
</p>
<p>38
15
</p>
<p>0.
28
</p>
<p>72
0.
</p>
<p>57
27
</p>
<p>0.
15
</p>
<p>79
0.
</p>
<p>03
45
</p>
<p>0.
51
</p>
<p>12
0.
</p>
<p>12
33
</p>
<p>0.
04
</p>
<p>41
0.
</p>
<p>36
49
</p>
<p>0.
06
</p>
<p>07
0.
</p>
<p>05
08
</p>
<p>0.
46
</p>
<p>09
0.
</p>
<p>04
20
</p>
<p>0.
02
</p>
<p>80
0.
</p>
<p>43
60
</p>
<p>0.
03
</p>
<p>93
0.
</p>
<p>05
55
</p>
<p>0.
43
</p>
<p>39
0.
</p>
<p>01
75
</p>
<p>0.
00
</p>
<p>04
0.
</p>
<p>75
74
</p>
<p>0.
01
</p>
<p>18
0.
</p>
<p>00
07
</p>
<p>0.
76
</p>
<p>87
0.
</p>
<p>00
28
</p>
<p>0.
00
</p>
<p>26
0.
</p>
<p>71
20
</p>
<p>0.
00
</p>
<p>00 0.
03
</p>
<p>63
0.
</p>
<p>79
25
</p>
<p>Rappel oracle
Rappel
Pr&#233;cision
</p>
<p>FIGURE 3 &#8211; Rappel oracle dans chaque situation du corpus d&#8217;apprentissage par ordre d&#233;crois-
sant (gauche), performance de J48 sur les 9 meilleures situations (centre), performance de la
r&#233;gression logistique sur les 9 meilleures situations (droite).
</p>
<p>La figure 3 montre &#233;galement les performances des classifieurs par arbres de d&#233;cision J48
(centre) et par r&#233;gression logistique (droite) dans chacune de ces neuf situations, auxquelles
nous avons ajout&#233; les d&#233;cisions &#224; base de r&#232;gles (rb, rule-based) et le total (full). La pr&#233;cision de
J48 est g&#233;n&#233;ralement bonne (moindre dans une m&#234;me phrase). Gr&#226;ce au rappel oracle, nous
constatons que son rappel est bon sur TIMEX3-EVENT-DD-HC et mod&#233;r&#233; sur SS-EVENT-EVENT et
TIMEX3-EVENT-AD-HPI. La distance avec le rappel oracle &#233;tant importante dans ces deux cas
(resp. 10 points pour Logistique et 6 points pour J48), une &#233;tude compl&#233;mentaire est indiqu&#233;e
dans ces deux situations. La r&#233;gression logistique obtient une pr&#233;cision plus basse et un meilleur
rappel que J48 pour les situations dans une m&#234;me phrase, mais est moins bon sur les liens entre
date d&#8217;admission ou de sortie (AD ou DD) et les &#233;v&#233;nements des autres sections (HPI ou HC).
</p>
<p>Une interpr&#233;tation de la bonne performance des arbres de d&#233;cision est qu&#8217;ils ont la capacit&#233; de
construire des conjonctions de caract&#233;ristiques, utiles pour ces situations, alors que la r&#233;gres-
sion logistique ne permet pas de le faire (elle permet seulement d&#8217;ajouter les scores obtenus
individuellement par chaque caract&#233;ristique, mais pas de produire d&#8217;elle-m&#234;me une conjonction
de caract&#233;ristiques qui obtiendrait un score plus important que cette somme). La construction
a priori de telles caract&#233;ristiques combin&#233;es a augment&#233; les scores de ces autres classifieurs.
Nous avons &#233;galement test&#233; un s&#233;parateur &#224; vaste marge (LibSVM), mais il n&#8217;a pas montr&#233; de
performances comp&#233;titives dans les situations test&#233;es. Les for&#234;ts d&#8217;arbres al&#233;atoires semblent plus
robustes pour les situations avec un faible nombre d&#8217;instances.
</p>
<p>Le tableau 1 contient les r&#233;sultats obtenus par l&#8217;&#233;tude syst&#233;matique de ces situations, examinant
initialement 20 situations (avant &#233;tude du rappel oracle) puis les 9 plus productives. Toutes nos
&#233;tudes ont &#233;t&#233; r&#233;alis&#233;es sur le corpus d&#8217;apprentissage avec une validation crois&#233;e (mais seulement
en quatre parties du fait du temps &#233;lev&#233; d&#8217;apprentissage). Gr&#226;ce &#224; ces pr&#233;cautions, toutes les
am&#233;liorations r&#233;alis&#233;es lors de l&#8217;optimisation sur le corpus d&#8217;apprentissage ont &#233;galement &#233;t&#233;
report&#233;es sur le corpus de test.
</p>
<p>Utiliser les mots de l&#8217;EVT comme caract&#233;ristiques (mention &#171; mots &#187; dans le tableau) a g&#233;n&#233;-
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>648 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage (v-c 4 fois) Corpus de test
#S Classifieur P R F P R F Delta
9 Sel[P] (mots) 0.711 0.628 0.667 0.655 0.594 0.623 -0.044
9 C 0.652 0.663 0.658 0.602 0.631 0.616 -0.042
9 j48 0.702 0.592 0.642 0.661 0.555 0.603 -0.039
9 rf (mots) 0.661 0.591 0.624 0.628 0.557 0.590 -0.034
9 rf 0.624 0.573 0.598 0.580 0.549 0.564 -0.034
9 nb (mots) 0.569 0.581 0.575 0.390 0.520 0.445 -0.129
9 logistic 0.509 0.518 0.513 0.345 0.470 0.398 -0.115
9 nb 0.478 0.537 0.506 0.331 0.454 0.383 -0.123
20 Sel[F] 0.601 0.615 0.608
20 vote 0.654 0.549 0.597
20 j48 0.644 0.532 0.583
20 LibSVM 0.659 0.511 0.576
20 rf 0.589 0.522 0.553
</p>
<p>L&#233;gende : v-c=validation crois&#233;e ; #S=nombre de situations, P=pr&#233;cision, R=rappel, F=F-mesure, Delta=diff&#233;rence
en F-mesure entre le corpus de test et celui d&#8217;apprentissage. Sel=S&#233;lection des diff&#233;rents classifieurs pour chaque
section, en optimisant la pr&#233;cision [P] ou la F-mesure [F]. rf=for&#234;t al&#233;atoire, nb=bay&#233;sien na&#239;f. Le vote (moyenne des
pr&#233;dictions) combine J48, LibSVM, for&#234;t al&#233;atoire, k plus proches voisins, et bay&#233;sien na&#239;f. Mots=incluant les mots de
l&#8217;EVT comme caract&#233;ristiques. Les 9 situations sont ordonn&#233;es par pr&#233;cision d&#233;croissante, les 20 situations sont ordonn&#233;es
approximativement. Les cellules vides renvoient &#224; des donn&#233;es non disponibles.
</p>
<p>TABLE 1 &#8211; R&#233;sultats globaux sur les relations temporelles.
</p>
<p>ralement am&#233;lior&#233; les r&#233;sultats des classifieurs (sauf pour J48) ; l&#8217;impossibilit&#233; d&#8217;utiliser ces
caract&#233;ristiques pour la r&#233;gression logistique dans Weka en a certainement limit&#233; les perfor-
mances. Nous comptons donc tester un autre classifieur &#224; maximum d&#8217;entropie.
</p>
<p>Nous avons commenc&#233; l&#8217;&#233;tude des situations qui ont un rappel oracle plus faible, mais jusqu&#8217;ici
les augmentations de rappel n&#8217;ont pas compens&#233; les pertes de pr&#233;cision associ&#233;es. La recherche
de nouvelles caract&#233;ristiques constitue une piste compl&#233;mentaire &#224; explorer.
</p>
<p>4 Conclusion
</p>
<p>Dans cet article, nous avons montr&#233; comment une &#233;tude syst&#233;matique des situations o&#249; l&#8217;on peut
rencontrer des relations temporelles dans des comptes rendus hospitaliers, incluant le calcul
du rappel oracle de ces situations et une comparaison de diff&#233;rents classifieurs, nous a permis
d&#8217;obtenir des r&#233;sultats sensiblement meilleurs que ceux obtenus sans effectuer cette &#233;tude.
</p>
<p>Plusieurs pistes d&#8217;am&#233;lioration existent. En particulier, formaliser des caract&#233;ristiques suppl&#233;men-
taires d&#233;di&#233;es &#224; chaque situation et utiliser des impl&#233;mentations de classifieurs qui passent &#224;
l&#8217;&#233;chelle devraient am&#233;liorer nos performances. Au lieu d&#8217;une proc&#233;dure de d&#233;cision gloutonne,
une proc&#233;dure de d&#233;cision globale pourrait &#234;tre impl&#233;ment&#233;e pour &#233;tudier le graphe de toutes
les relations temporelles pr&#233;dites, y compris les relations en conflit, en tenant compte de la
confiance de leur pr&#233;diction, et devrait permettre la s&#233;lection d&#8217;un sous-graphe coh&#233;rent avec un
score de pr&#233;diction global optimal. En ce sens, Costa et Branco (2013) proposent d&#8217;utiliser les
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>649 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>informations produites dans les situations d&#233;j&#224; trait&#233;es pour pr&#233;dire les relations temporelles
dans le reste des situations &#224; traiter. Enfin, la caract&#233;risation du rappel oracle nous a permis de
mettre en &#233;vidence les directions &#224; am&#233;liorer : les relations &#224; l&#8217;int&#233;rieur d&#8217;une phrase et la mise
en relation avec la date d&#8217;admission des &#233;v&#233;nements de l&#8217;histoire de la maladie.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; partiellement r&#233;alis&#233; dans le cadre du programme Quaero, financement Oseo
(agence nationale de valorisation de la recherche) et du projet Accordys (ANR-12-CORD-0007-
03). Les donn&#233;es m&#233;dicales proviennent du consortium Informatics for Integrating Biology to the
Bedside (i2b2) gr&#226;ce aux financements 2U54LM008748 du NIH/National Library of Medicine
(NLM), National Heart, Lung and Blood Institute (NHLBI), et 1R13LM01141101 du NIH/NLM.
</p>
<p>R&#233;f&#233;rences
</p>
<p>COSTA, F. et BRANCO, A. (2013). Temporal relation classification based on temporal reasoning.
In Proc International Workshop on Computational Semantics, Potsdam, Allemagne. ACL SIGSEM.
</p>
<p>GROUIN, C., GRABAR, N., HAMON, T., ROSSET, S., TANNIER, X. et ZWEIGENBAUM, P. (2012). A
tale of temporal relations between clinical concepts and temporal expressions : towards a
representation of the clinical patient&#8217;s timeline. In UZUNER, O., SUN, W. et RUMSHISKY, A.,
&#233;diteurs : i2b2/VA Workshop Proc, Chicago, IL. i2b2. 9 pages.
HARKEMA, H., SETZER, A., GAIZAUSKAS, R. et HEPPLE, M. (2005). Mining and modelling temporal
clinical data. In The UK e-Science All Hands Meeting Proc, pages 507&#8211;514.
</p>
<p>MANI, I., VERHAGEN, M., WELLNER, B., LEE, C. M. et PUSTEJOVSKY, J. (2006). Machine learning
of temporal relations. In Proceedings of the 21st International Conference on Computational
Linguistics and 44th Annual Meeting of the Association for Computational Linguistics, pages
753&#8211;760, Sydney, Australia. Association for Computational Linguistics.
</p>
<p>MANI, I., WELLNER, B., VERHAGEN, M. et PUSTEJOVSKY, J. (2007). Three approaches to learning
TLINKs in TimeML. Technical Report CS-07-268, Brandeis University.
</p>
<p>SAVOVA, G., BETHARD, S., STYLER, W., MARTIN, J., PALMER, M., MASANZ, J. et WARD, W. (2009).
Towards temporal relation discovery from the clinical narrative. In AMIA Annu Symp Proc, pages
568&#8211;572.
</p>
<p>SUN, W., RUMSHISKY, A. et UZUNER, O. (2013). Evaluating temporal relations in clinical text:
2012 i2b2 challenge overview. J Am Med Inform Assoc. Soumis.
</p>
<p>VERHAGEN, M. et PUSTEJOVSKY, J. (2008). Temporal processing with the TARSQI toolkit. In
Coling Proc, pages 189&#8211;192. D&#233;monstration.
</p>
<p>VERHAGEN, M., SAURI, R., CASELLI, T. et PUSTEJOVSKY, J. (2010). Semeval-2010 task 13 : Tempeval-
2. In Proceedings of the 5th International Workshop on Semantic Evaluation, pages 57&#8211;62, Uppsala,
Sweden. Association for Computational Linguistics.
</p>
<p>ZHOU, L., MELTON, G., PARSONS, S. et HRIPCSAK, G. (2006). A temporal constraint structure for
extracting temporal information from clinical narrative. J Biomed Inform, 39(4):424&#8211;439.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>650 c&#65535; ATALA</p>

</div></div>
</body></html>