<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Identification, alignement, et traductions des adjectifs relationnels en corpus comparables</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Identification, alignement,
et traductions des adjectifs relationnels en corpus comparables
</p>
<p>Rima Harastani1 Beatrice Daille1 Emmanuel Morin1
(1) LINA UMR CNRS 6241, 2 Chemin de la Houssini&#232;re 44300 Nantes
</p>
<p>{rima.harastani,beatrice.daille,emmanuel.morin}@univ-nantes.fr
</p>
<p>R&#201;SUM&#201;
Dans cet article, nous extrayons des adjectifs relationnels fran&#231;ais et nous les alignons automatiquement
avec les noms dont ils sont d&#233;riv&#233;s en utilisant un corpus monolingue. Les alignements adjectif-nom
seront ensuite utilis&#233;s dans la traduction compositionelle des termes complexes de la forme [N AdjR] &#224;
partir d&#8217;un corpus comparable fran&#231;ais-anglais. Un nouveau terme [N N&#65535;] (ex. cancer du poumon) sera
obtenu en rempla&#231;ant l&#8217;adjectif relationnel Ad jR (ex. pulmonaire) dans [N AdjR] (ex. cancer pulmonaire)
par le nom N &#65535; (ex. poumon) avec lequel il est align&#233;. Si aucune traduction n&#8217;est propos&#233;e pour [N
AdjR], nous consid&#233;rons que ses traduction(s) sont &#233;quivalentes &#224; celle(s) de sa paraphrase [N N&#65535;]. Nous
exp&#233;rimentons avec un corpus comparable dans le domaine de cancer du sein, et nous obtenons des
alignements adjectif-nom qui aident &#224; traduire des termes complexes de la forme [N AdjR] vers l&#8217;anglais
avec une pr&#233;cision de 86 %.
ABSTRACT
Identification, Alignment, and Tranlsation of Relational Adjectives from Comparable Corpora
</p>
<p>In this paper, we extract French relational adjectives and automatically align them with the nouns they are
derived from by using a monolingual corpus. The obtained adjective-noun alignments are then used in the
compositional translation of compound nouns of the form [N ADJR] with a French-English comparable
corpora. A new term [N N&#65535;] (eg, cancer du poumon) is obtained by replacing the relational adjective
Ad jR (eg, pulmonaire) in [N AdjR] (eg, cancer pulmonaire) by its corresponding N &#65535; (eg, poumon). If no
translation(s) are obtained for [N AdjR], we consider the one(s) obtained for its paraphrase [N N&#65535;]. We
experiment with a comparable corpora in the field of breast cancer, and we get adjective-noun alignments
that help in translating French compound nouns of the form [N AdjR] to English with a precision of 86%.
</p>
<p>MOTS-CL&#201;S : Adjectifs relationnels, Corpus comparables, M&#233;thode compositionnelle, Termes complexes.
KEYWORDS: Relational adjectives, Comparable corpora, Compositional method, Complex terms.
</p>
<p>1 Introduction
</p>
<p>Les termes complexes sont des termes qui se composent de plus d&#8217;un mot. La plupart de ces termes
poss&#232;dent une propri&#233;t&#233; compositionnelle, c&#8217;est-&#224;-dire que la signification de l&#8217;ensemble peut &#234;tre
appr&#233;hend&#233;e par la signification des parties. Ainsi, certaines approches ont &#233;t&#233; propos&#233;es pour traduire
des termes complexes en fonction de cette propri&#233;t&#233; (voir Baldwin et Tanaka (2004)). Elles consistent
&#224; traduire un terme complexe mot &#224; mot &#224; l&#8217;aide d&#8217;un dictionnaire bilingue. Ensuite, elles combinent
ces traductions individuelles selon des formes appropri&#233;es pour produire des traductions candidates du
terme complexe. Les traductions candidates sont ensuite cherch&#233;es dans un corpus comparable 1 avant
d&#8217;&#234;tre consid&#233;r&#233;es comme correctes. Les corpus comparables ont &#233;t&#233; utilis&#233;s avec succ&#232;s dans la t&#226;che de
l&#8217;alignement de termes par de nombreuses approches (Rapp, 1995; Baldwin et Tanaka, 2004) en raison de
leur plus grande disponibilit&#233; par rapport aux corpus parall&#232;les 2 (Bowker et Pearson, 2002). Ainsi, pour
traduire compositionnellement le terme fran&#231;ais &quot;gestion clinique&quot; en anglais, on peut traduire &quot;gestion&quot;
</p>
<p>1. des textes multilingues qui appartiennent au m&#234;me domaine
2. textes multilingues qui sont des traductions mutuelles
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>313 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>par &quot;management&quot; et &quot;clinique&quot; par &quot;clinical&quot;, puis rassembler ces traduction sous la forme [A N] (A et N
signifient respectivement adjectif et nom) afin d&#8217;obtenir une traduction candidate &quot;clinical management&quot;.
</p>
<p>Nous nous int&#233;ressons aux termes complexes de la forme [N AdjR] (Ad jR d&#233;signe un adjectif relationnel),
ex. cancer pulmonaire. En effet, ces termes peuvent &#234;tre traduits compositionnellement dans une autre
langue par des termes de la forme [N N] (ex. &quot;cancer pulmonaire&quot; est traduit en anglais par &quot;lung
cancer&quot;), voir figure 1. Si le substantif &quot;lung&quot; n&#8217;est pas une traduction de l&#8217;adjectif &quot;pulmonaire&quot; dans
le dictionnaire, le lien entre &quot;pulmonaire&quot; et &quot;lung&quot; peut &#234;tre &#233;tabli via le substantif &quot;poumon&quot; dont
&quot;pulmonaire&quot; est le d&#233;riv&#233; et &quot;lung&quot; est la traduction. Ainsi, nous pouvons traduire &quot;cancer pulmonaire&quot;
par &quot;lung cancer&quot; en passant par la paraphrase &quot;cancer du poumon&quot;. Cette piste a &#233;t&#233; d&#233;j&#224; explor&#233;e par
Morin et Daille (2010) &#224; l&#8217;aide des r&#232;gles d&#233;finies qui relient un adjectif relationnel avec son nom. Nous
avons pour objectif dans ce travail (a) d&#8217;extraire des adjectifs relationnels automatiquement du corpus ;
(b) d&#8217;&#233;tablir un lien entre un adjectif relationnel extrait et le nom dont il est d&#233;riv&#233; automatiquement ; (c)
d&#8217;&#233;tudier l&#8217;influence des propri&#233;t&#233;s des adjectifs extraits et les alignements adjectif-nom sur la traduction
compositionnelle des termes [N AdjR].
</p>
<p>Apr&#232;s une pr&#233;sentation de la classe d&#8217;adjectifs relationnels et les probl&#232;mes li&#233;s &#224; son identification en
section 2, nous d&#233;veloppons dans la section 3 une approche qui nous permet d&#8217;extraire automatiquement
des adjectifs relationnels d&#8217;un corpus fran&#231;ais. Ensuite, nous proposons une approche en section 4
afin de relier un adjectif relationnel (extrait pr&#233;c&#233;demment du corpus) &#224; un nom existant dans un
dictionnaire bilingue et dans le corpus. Si la plupart des adjectifs relationnels sont d&#233;riv&#233;s par suffixation
&#224; partir de noms populaires (ex. canc&#233;reux / cancer), il y en a d&#8217;autres qui sont construits &#224; partir de
racines suppl&#233;tives des noms (ex. m&#233;dullaire / moelle). Nous traitons ces deux cas s&#233;par&#233;ment : (a)
adjectif relationnel commun : nous supposons qu&#8217;un adjectif relationnel partage un certain nombre
de lettres avec son nom de base, et que l&#8217;ordre des lettres est conserv&#233;. Ainsi, un score entre un adjectif
relationnel et chaque nom dans un dictionnaire (et qui existe dans le corpus) sera obtenu en fonction
de la similarit&#233; de lettres par l&#8217;approche d&#233;crite en section 4.1, nous exploitons ensuite le contexte afin
que ce score soit plus repr&#233;sentatif en section 4.1.1 ; (b) adjectif relationnel savant : nous v&#233;rifions
si un adjectif relationnel peut &#234;tre reli&#233; avec un nom &#224; l&#8217;aide d&#8217;une racine suppl&#233;tive en appliquant
l&#8217;approche expliqu&#233;e en section 4.1.3. En section 5, nous utilisons les alignements obtenus par l&#8217;approche
d&#8217;alignement adjectif-nom dans la traduction compositionnelle par paraphrase des termes [N AdjR].
Enfin, nous &#233;valuons en section 6 les approches que nous proposons et nous concluons dans la section 7.
</p>
<p>FIGURE 1 &#8211; Traduction par paraphrase (o&#249; t-fr est le terme fran&#231;ais, T-en est l&#8217;ensemble des traductions anglaises et
Dico-bi est le dictionnaire bilingue fran&#231;ais-anglais).
</p>
<p>2 Adjectifs relationnels
</p>
<p>Dans cette section, nous pr&#233;sentons la classe des adjectifs relationnels et ses propri&#233;t&#233;s, ainsi que des
travaux qui se sont int&#233;ress&#233;s &#224; l&#8217;identification de cette classe et les probl&#232;mes li&#233;s &#224; cette identification.
</p>
<p>2.1 D&#233;finition et propri&#233;t&#233;s
</p>
<p>D&#8217;apr&#232;s Dubois et Dubois-Charlier (1999, p. 128), &quot;un adjectif relationnel est issu d&#8217;une relative, o&#249;
&lt;de N&gt; est caract&#233;ris&#233; par l&#8217;absence de d&#233;terminant ; cette relative se branche directement sur l&#8217;ant&#233;c&#233;dent
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>314 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>auquel elle se rapporte, et l&#8217;ensemble form&#233; du nom et de l&#8217;adjectif nominal suffix&#233; forme un nom compos&#233;&quot;.
Exemple : ce corps chimique est l&#8217;acide qui est &lt;de nitre&gt; ; ce corps chimique est l&#8217;acide nitrique.
</p>
<p>Les adjectifs relationnels sont des adjectifs d&#233;nominaux (adjectifs construits sur des bases nominales),
&#224; ne pas confondre avec les adjectifs d&#233;verbaux qui sont d&#233;riv&#233;s d&#8217;un verbe par des suffixes tels que
-able, -ible, -ile, -ant, etc, (ex. d&#233;gradable/ de d&#233;grader). Alors qu&#8217;un adjectif dit &quot;qualificatif&quot; (Ad jQ)
peut aussi &#234;tre construit sur une base nominale, la relation [N AdjQ] est diff&#233;rente de la relation [N
AdjR]. Par exemple, dans la phrase &quot;Fran&#231;ois a des jambes &#233;l&#233;phantesques&quot;, l&#8217;adjectif &quot;&#233;l&#233;phantesques&quot;
n&#8217;&#233;tablit pas une relation entre les jambes de Fran&#231;ois et la cat&#233;gorie &quot;&#233;l&#233;phant&quot;, il leur attribue une
qualit&#233; des individus de cette cat&#233;gorie : &#234;tre tr&#232;s gros, exemple extrait de Roch&#233; (2006).
</p>
<p>Dubois et Dubois-Charlier (1999, p. 129) et Goes (1999, p. 251) citent certaines propri&#233;t&#233;s de ces adjectifs
que nous r&#233;sumons sous le titre de propri&#233;t&#233;s linguistiques et pr&#233;sentons dans la table 1 (P1 &#224; P6). D&#8217;autres
propri&#233;t&#233; que nous appelons &quot;op&#233;rationnelles&quot; et qui se sont bas&#233;es sur les propri&#233;t&#233;s linguistiques sont
pr&#233;sent&#233;es &#233;galement dans la table 1. Les propri&#233;t&#233;s op&#233;rationnelles ne sont pas toujours exclusives aux
adjectifs relationnels mais elles nous permettent de rep&#233;rer des adjectifs automatiquement dans un corpus.
</p>
<p>Les adjectifs relationnels sont d&#233;riv&#233;s par suffixation d&#8217;un nom. Les suffixes des adjectifs relationnels
peuvent &#234;tre : -ien, -ois, -ique, etc. (P7 dans la table 1). Toutefois, la d&#233;tection automatique des noms de
base dont les adjectifs relationnels sont d&#233;riv&#233;s ne se fait pas par une simple comparaison entre la base
nominale et l&#8217;adjectif relationnel d&#233;-suffix&#233; &#224; cause de l&#8217;allomorphie des bases ; &quot;l&#8217;addition d&#8217;un suffixe peut
entra&#238;ner des modifications morphologiques de la base nominale, elles sont plus ou moins importantes selon
la nature de N ou selon la nature du suffixe&quot; (Dubois et Dubois-Charlier, 1999, p. 135). Par exemple, ces
modifications peuvent &#234;tre : la modification phonique ou graphique de N (tropique/tropical), l&#8217;addition
de voyelles ou de syllabes (nom/nominal), modification du radical &#224; partir du latin (b&#234;te/bestial),
etc. Par ailleurs, les adjectifs relationnels et les adjectifs d&#233;verbaux ont quelques suffixes en commun,
qui sont : -if, -aire, -eux, -oire, et -&#233;. La cat&#233;gorie d&#8217;un adjectif ne peut donc pas &#234;tre d&#233;termin&#233;e en
ne s&#8217;appuyant que sur son suffixe.
</p>
<p>2.2 Identification
</p>
<p>La t&#226;che d&#8217;identification des adjectifs relationnels dans un corpus n&#8217;est pas simple : d&#8217;une part la classe
des adjectifs relationnels est floue, et d&#8217;une autre, il n&#8217;y a pas de r&#232;gles v&#233;ritablement s&#251;res pour les
identifier automatiquement (Goes, 1999; Maniez, 2005). De plus, les adjectifs relationnels d&#233;rivent, avec
le temps, de fa&#231;on r&#233;guli&#232;re vers la qualification (Noailly, 1999, p. 24). Par exemple, certains adjectifs
peuvent jouer un r&#244;le relationnel ou qualificatif selon le contexte (ex. le syst&#232;me nerveux (Ad jR) vs.
Fran&#231;ois est nerveux (Ad jQ)). Un adjectif peut donc avoir dans un terme deux interpr&#233;tations, l&#8217;une
relationnelle et l&#8217;autre qualificative, par exemple, &quot;une chaise royale&quot; : est-elle la chaise du roi ou une
chaise luxueuse ? Si on identifie l&#8217;adjectif &quot;royale&quot; comme relationnel, et qu&#8217;on l&#8217;aligne avec le nom &quot;roi&quot;
quand il s&#8217;agit d&#8217;une utilisation qualificative de cet adjectif : &quot;chaise royale&quot; sera paraphras&#233; par &quot;chaise
du roi&quot; qui peut &#234;tre traduit en anglais par &quot;chair of the king&quot;. L&#8217;alignement d&#8217;un adjectif qualificatif avec
un nom peut donc introduire de mauvaises traductions pour la m&#233;thode compositionnelle. Cependant,
quand un adjectif peut avoir un emploi relationnel, l&#8217;alignement de cet adjectif avec son nom de base
peut aider &#224; la traduction des termes [N A] avec une haute pr&#233;cision (Morin et Daille, 2010).
</p>
<p>Plusieurs travaux se sont int&#233;ress&#233;s &#224; l&#8217;identification des adjectifs relationnels, nous pr&#233;sentons
bri&#232;vement ci-dessous les travaux de Daille (1999) et Maniez (2005) qui se penchent sur l&#8217;extraction
automatique ou semi-automatique des adjectifs relationnels &#224; partir des corpus monolingues, ainsi
que le travail de Cartoni (2008) sur les mots pr&#233;fix&#233;s.
</p>
<p>Daille (1999) exploite des r&#232;gles de d&#233;suffixation-recodage (d&#233;finies manuellement pour le fran&#231;ais
et l&#8217;anglais) pour relier un adjectif relationnel avec son nom de base (ex. la r&#232;gle (-esti&#232;re, -&#234;t) peut
relier &quot;foresti&#232;re&quot; &#224; &quot;for&#234;t&quot;). Un adjectif A extrait &#224; l&#8217;aide de ces r&#232;gles, et qui doit appara&#238;tre avec un
nom recteur X sous la forme [X A], sera consid&#233;r&#233; comme relationnel s&#8217;il peut &#234;tre paraphras&#233; par
un groupe [pr&#233;position substantif] sous la forme [X PREP DET? N&#65535;] ; o&#249; N &#65535; est le nom dont A est d&#233;riv&#233;
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>315 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(voir P8 dans la table 1). La recherche des paraphrases est faite &#224; partir du corpus. Cette m&#233;thode donne
une pr&#233;cision de 99 %, mais un faible rappel d&#251; au nombre limit&#233; de paraphrases dans le corpus.
</p>
<p>Maniez (2005) examine deux approches pour identifier les adjectifs relationnels dans un corpus
de sp&#233;cialit&#233; en anglais : (a) il se penche sur l&#8217;hypoth&#232;se que dans un corpus sp&#233;cialis&#233;, la plupart
des adjectifs sont relationnels. Ainsi, il exploite P1 et P4 (voir la table 1) afin de filtrer les adjectifs
non-relationnels dans le corpus (b) tous les adjectifs en deuxi&#232;me position extraits &#224; partir du motif
[ADJ1-ADJ2-N] sont s&#233;lectionn&#233;s en tant qu&#8217;adjectifs relationnels. Ce motif peut &#234;tre adapt&#233; en fran&#231;ais
par [N-ADJ1-ADJ2], et nous ajoutons le crit&#232;re suivant : si ADJ2 est relationnel, ADJ1 est &#233;galement
relationnel. La raison pour laquelle nous consid&#233;rons que l&#8217;adjectif en premi&#232;re position est relationnel,
c&#8217;est parce que l&#8217;adjectif relationnel suit imm&#233;diatement le nom (Pedreira, 2002), et qu&#8217;on d&#233;termine
avant de qualifier (ex. un discours pr&#233;sidentiel int&#233;ressant), nous conclurons donc qu&#8217;un adjectif
qualificatif ne peut pas pr&#233;c&#233;der un adjectif relationnel, cette propri&#233;t&#233; est d&#233;crite sous P9 dans la table 1.
</p>
<p>Cartoni (2008) travaille sur les mots pr&#233;fix&#233;s qui ont la forme : [pr&#233;fixe M] (ex. antitumoral). Il constate
qu&#8217;avec certains pr&#233;fixes (comme post-), si M est un adjectif, il s&#8217;agit d&#8217;un adjectif relationnel. Avec
un autre groupe de pr&#233;fixes (comme anti-), M est soit un adjectif relationnel, soit un adjectif d&#233;verbal
(Cartoni, 2008, p. 255 )(voir P11 et P12 dans la table 1).
</p>
<p>Nous allons en premier d&#233;velopper dans la section suivante une m&#233;thode pour extraire une liste des
adjectifs relationnels du corpus &#224; l&#8217;aide des propri&#233;t&#233;s pr&#233;sent&#233;es.
</p>
<p>Propri&#233;t&#233;s linguistiques
P1 &quot;ils n&#8217;acceptent pas d&#8217;adverbe de degr&#233;&quot; (acide tr&#232;s nitrique, sauf cas particulier) (Dubois
</p>
<p>et Dubois-Charlier, 1999). Les adjectifs relationnels &quot;refusent la gradation en g&#233;n&#233;ral, et
&quot;tr&#232;s&quot; en particulier&quot; (Goes, 1999)
</p>
<p>P2 &quot;ils ne peuvent pas &#234;tre ant&#233;pos&#233;s&quot; (le nitrique acide).
P3 &quot;ils ne sont pas susceptibles d&#8217;adverbialisation&quot; (nitriquement) &quot;ni de nominalisation&quot;
</p>
<p>(nitricit&#233;).
P4 &quot;ils ne s&#8217;emploient pas en fonction d&#8217;attribut&quot; (cet acide est nitrique, sauf cas particulier).
P5 &quot;la coordination d&#8217;un adjectif relationnel avec un adjectif qualificatif est impossible&quot;.
P6 &quot;ils ne forment g&#233;n&#233;ralement pas de s&#233;ries antonymes&quot;.
</p>
<p>Propri&#233;t&#233;s op&#233;rationnelles
P7 les suffixes des adjectifs relationnels : -ique, -aire, -eux, -ier, -ien, -ois, -ain, -al, -el, -estre,
</p>
<p>-il, -in, -esque, -&#233;, -if.
P8 il existe des paraphrases dans un corpus monolingue de la forme [X PREP DET? N&#65535;] : :
</p>
<p>[X AdjR] (ex. cancer du poumon : : cancer pulmonaire) ; o&#249; X est un nom, N&#65535; est le
nom de base de Ad jR. (PREP signifie pr&#233;position et DET signifie d&#233;terminant, ? signifie
que DET peut appara&#238;tre une ou z&#233;ro fois)
</p>
<p>P9 dans les syntagmes de la forme [N Adj1 Adj2] (ex. rupture capsulaire ganglionnaire),
si Ad j2 est un adjectif relationnel, Ad j1 est relationnel &#233;galement.
</p>
<p>P10 dans les syntagmes de la forme [N Adj1 et/ou Adj2] (ex. facteurs environnementaux
ou g&#233;n&#233;tiques), si Ad j2 est un adjectif relationnel, Ad j1 est relationnel &#233;galement.
</p>
<p>P11 ils peuvent &#234;tre pr&#233;fix&#233;s par les pr&#233;fixes : post-, trans-, uni-, tri-, anti-, tri-, pr&#233;-.
P12 ils peuvent &#234;tre pr&#233;fix&#233;s par des racines gr&#233;co-latines : micro-, s&#233;ro-, radio-, etc.
</p>
<p>TABLE 1 &#8211; Propri&#233;t&#233;s linguistiques et op&#233;rationnelles des adjectifs relationnels
</p>
<p>3 Extraction des adjectifs relationnels du corpus
</p>
<p>La reconnaissance automatique des Ad jR en corpus pose un certain nombre de probl&#232;mes comme nous
l&#8217;avons vu en section 2 : (a) ambigu&#239;t&#233; des suffixes ; (b) ambigu&#239;t&#233; de la classe relationnel/qualificatif ;
(c) indice de relation exprim&#233; par les propri&#233;t&#233;s non-pr&#233;sentes en corpus. Dans cette section, nous
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>316 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#233;veloppons une approche pour extraire des adjectifs relationnels automatiquement du corpus.
</p>
<p>3.1 Approche
</p>
<p>Afin d&#8217;extraire des adjectifs relationnels du corpus, nous exploitons quelques propri&#233;t&#233;s linguistiques
et op&#233;rationnelles pr&#233;sent&#233;es dans la table 1. Nous partons de l&#8217;hypoth&#232;se que les racines gr&#233;co-latines et
certains pr&#233;fixes fran&#231;ais pr&#233;fixent des adjectifs non-qualificatifs pour extraire une liste d&#8217;adjectifs initiale
(en utilisant les propri&#233;t&#233;s P11 et P12). Nous nous basons sur cette liste afin de l&#8217;&#233;tendre en utilisant
d&#8217;autres propri&#233;t&#233;s (P9 et P10). La m&#233;thode d&#8217;identification automatique des adjectifs relationnels du
corpus que nous proposons est pr&#233;sent&#233;e dans l&#8217;algorithme 1 (nous faisons r&#233;f&#233;rence dans cet algorithme
aux propri&#233;t&#233;s list&#233;es dans la table 1). L&#8217;ensemble des listes que nous extrayons sera utilis&#233; par l&#8217;approche
d&#8217;alignement adjectif-nom pr&#233;sent&#233;e en section 4.
</p>
<p>3.1.1 Remarques
</p>
<p>1. Il y a des racines (ex. &quot;bio-&quot;) qui peuvent pr&#233;fixer des adjectifs d&#233;verbaux (ex. biod&#233;gradable). Cepen-
dant, dans le cas des adjectifs pr&#233;fix&#233;s par ces racines et qui se terminent par un suffixe qui ne peut
pas &#234;tre d&#233;verbal (ex. -ique dans &quot;biochimique&quot;), nous consid&#233;rons que ces adjectifs sont relationnels.
</p>
<p>2. Afin de trouver les adverbes construits &#224; partir d&#8217;un adjectif dans le corpus : (a) nous ajoutons
le suffixe adverbial &quot;ment&quot; (et d&#8217;autres adaptations du suffixe) &#224; l&#8217;adjectif (b) nous cherchons ces
adverbes construits dans le corpus.
</p>
<p>3. L&#8217;extraction des adjectifs relationnels par le biais de la propri&#233;t&#233; P9 est plus fiable que l&#8217;extraction de
ces adjectifs par P10. En effet, P10 peut introduire du bruit quand il s&#8217;agit d&#8217;une utilisation qualificative
d&#8217;un adjectif. Pour cette raison, nous choisissons de ne l&#8217;appliquer que sur les adjectifs relationnels qui
sont trouv&#233;s &#224; l&#8217;aide de P11 et P12 (qui ont en effet peu de chances d&#8217;avoir un emploi qualificatif).
</p>
<p>4. Bien qu&#8217;on puisse aussi extraire des adjectifs d&#233;verbaux par cette m&#233;thode, on peut les relier la
plupart du temps &#224; des substantifs (ex. v&#233;g&#233;tatif ; Verbe : v&#233;g&#233;ter ; Nom : v&#233;g&#233;tation).
</p>
<p>3.2 Identification des racines gr&#233;co-latines
</p>
<p>Nous visons &#224; extraire une liste de racines Lracines automatiquement du corpus, ces racines sont utilis&#233;es
par l&#8217;algorithme d&#8217;identification automatique des adjectifs relationnels pr&#233;sent&#233; dans l&#8217;algorithme 1.
Nous supposons que les racines gr&#233;co-latines pr&#233;fixent les bases adjectivales non-qualificatives. Certaines
racines ne peuvent pr&#233;fixer que des adjectifs relationnels, alors que d&#8217;autres peuvent pr&#233;fixer des adjectifs
relationnels ou d&#233;verbaux. Nous pr&#233;sentons la m&#233;thode que nous d&#233;veloppons pour extraire des racines
dans l&#8217;algorithme 2.
4 Alignement d&#8217;un adjectif relationnel avec un nom
</p>
<p>Nous supposons qu&#8217;un adjectif relationnel partage des caract&#232;res dans le m&#234;me ordre avec son nom
de base. Afin de trouver le nom N dont un adjectif A est d&#233;riv&#233;, on peut comparer cet adjectif avec
tous les noms dans un dictionnaire (et qui existent dans un corpus source) en donnant des scores entre
un nom et un adjectif par des mesures de similarit&#233;. Le nom N qui a la similarit&#233; la plus &#233;lev&#233;e avec
A sera retenu. De nombreux algorithmes existants peuvent mesurer la similarit&#233; ou la distance entre
deux cha&#238;nes. En effet, une mesure int&#233;ressante pour notre t&#226;che pr&#233;servera l&#8217;ordre lin&#233;aire des lettres
lors de la comparaison de deux cha&#238;nes. Nous pr&#233;sentons ci-dessous deux mesures qui pr&#233;servent l&#8217;ordre,
ces mesures seront utilis&#233;es dans la suite :
</p>
<p>1. Lcs : cette mesure consiste &#224; trouver la sous-s&#233;quence la plus longue &quot;longest common subse-
quence 3&quot; entre deux cha&#238;nes, l&#8217;ordre des lettres est donc pr&#233;serv&#233;. Par exemple, Lcs(forestier,
</p>
<p>3. subsequence : les lettres de la sous-s&#233;quence sont dans le m&#234;me ordre que dans la chaine compl&#232;te, substring : les lettres
de la sous-cha&#238;ne sont cons&#233;cutives et dans le m&#234;me ordre que dans la chaine compl&#232;te.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>317 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Donn&#233;es : Lpre f ixes (pr&#233;fixes
fran&#231;ais qui n&#8217;acceptent qu&#8217;une base adjectivale relationnelle ou d&#233;verbale), Lsuf f Rel
(suffixes relationnels), Lracines (racines gr&#233;co-latines extraites automatiquement,
voir 3.2), Ccdsf r (corpus fran&#231;ais), L[NA] f r (termes [N A] extraits du corpus fran&#231;ais);
</p>
<p>R&#233;sultat : ListeAd jR-1
(contient les adjectifs qui commencent par une racine dans Lracines ou un pr&#233;fixe dans
Lpre f ixes), ListeAd jR-2 (contient les adjectifs qui peuvent &#234;tre pr&#233;fix&#233;s par des racines
dans Lracines ou des pr&#233;fixes dans Lpre f ixes), ListeAd jR-3 (contient les adjectifs extraits
&#224; l&#8217;aide de P9), ListeAd jR-4 (contient les adjectifs relationnels extraits &#224; l&#8217;aide de P10);
</p>
<p>d&#233;but
pour chaque A qui apparait dans
au moins un terme [N A] &#8712; L[NA] f r , et qui se termine par un suffixe &#8712;Lsuf f Rel (ex. tumoral) faire
</p>
<p>si il existe un autre A&#65535;&#65535; (ex. h&#233;matotumoral) dans Ccdsf r qui a la forme [racine A ] ou
[pr&#233;fixe A] (ex. racine=h&#233;mato, A=tumoral) (o&#249; pr&#233;fixe &#8712;Lpre f ixes, racine &#8712;Lracines) alors
</p>
<p>si le &quot;pr&#233;fixe&quot; ou la &quot;racine&quot; n&#8217;accepte que des bases relationnelles alors
Ajouter A&#65535;&#65535; &#224; ListeAd jR-1 et A &#224; ListeAd jR-2;
</p>
<p>sinon
si le suffixe de A est un suffixe non-commun entre les adjectifs
relationnels et les adjectifs d&#233;verbaux (ex. le suffixe &quot;ique&quot;, voir 1 dans 3.1.1) alors
</p>
<p>Ajouter A&#65535;&#65535; &#224; ListeAd jR-1 &#224; et A &#224; ListeAd jR-2;
tempAd jR &#8592;&#8722; { ListeAd jR-1 &#8746; ListeAd jR-2 };
r&#233;p&#233;ter
</p>
<p>pour chaque adjectif Ad jR dans tempAd jR qui v&#233;rifie P1 (avec &quot;tr&#232;s&quot;) faire
tempListA&#65535;&#65535; &#8592;&#8722; Trouver tous les adjectifs qui pr&#233;c&#232;dent Ad jR imm&#233;diatement
dans les motifs de la forme : [N A&#65535;&#65535; AdjR] (ex. profil prot&#233;ique tumoral, voir P9);
pour chaque A&#65535;&#65535; &#8712;tempListA&#65535;&#65535; faire
</p>
<p>si A&#65535;&#65535; respecte les propri&#233;t&#233;s P1 (avec tr&#232;s) et P3 (voir 2 dans 3.1.1) alors
Ajouter A&#65535;&#65535; &#224; ListeAd jR-3;
tempAd jR &#8592;&#8722; tempAd jR &#8746; ListeAd jR-3;
</p>
<p>jusqu&#8217;&#224; Pas de nouveaux adjectifs ajout&#233;s &#224; ListeAd jR-3;
pour chaque adjectif Ad jR dans ListeAd jR-1 faire
</p>
<p>tempListA&#65535;&#65535; &#8592;&#8722; Trouver
tous les adjectifs qui sont en coordination avec Ad jR (ex. mammaire et tumoral, voir P10);
pour chaque A&#65535;&#65535; &#8712;tempListA&#65535;&#65535; faire
</p>
<p>si A&#65535;&#65535; respecte les propri&#233;t&#233;s P1 (avec tr&#232;s) et P3 alors
Ajouter A&#65535;&#65535; &#224; ListeAd jR-4;
</p>
<p>Algorithme 1: Identification des adjectifs relationnels dans le corpus
</p>
<p>for&#234;t)=fort. On peut normaliser cette mesure comme suit (Ketkar et Youngblood, 2010) :
Lcsnormalise(A,B) = |Lcs(A,B)|2/(a&#215; b) &#8712; [0,1], o&#249; a est la longueur de A et b la longueur de B.
Plus ce score est &#233;lev&#233;, plus les cha&#238;nes sont similaires.
Exemple : Lcsnormalise(forestier, for&#234;t)=16/45=0,35.
</p>
<p>2. Levenshtein : cette distance est d&#233;finie comme le nombre minimum de modifications n&#233;cessaires
pour transformer une cha&#238;ne en une autre. Les op&#233;rations autoris&#233;es sont l&#8217;insertion, la suppression
et la substitution d&#8217;un seul caract&#232;re. Le co&#251;t de chaque op&#233;ration est &#233;gal &#224; 1. Par exemple,
Levenshtein(forestier, for&#234;t)=5. On peut normaliser cette distance (&#8712; [0,1]) si on la divise par la
cha&#238;ne la plus longue. Moins ce score est &#233;lev&#233;, plus les chaines sont similaires.
Exemple : Levnormalise(forestier, for&#234;t)=5/9=0,55.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>318 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Donn&#233;es : Ccdsf r (corpus
fran&#231;ais), L[NA] f r (termes fran&#231;ais de la forme [N A]), Lsuf f Rel (suffixes relationnels) ;
</p>
<p>R&#233;sultat : Lracines ;
d&#233;but
</p>
<p>pour chaque
adjectif A dans Ccdsf r qui compose un terme [N A] dans L[NA] f r (ex. barri&#232;re tumoral) faire
</p>
<p>si il se trouve un autre adjectif A&#65535; dans le corpus (ex. h&#233;matotumoral), o&#249; A&#65535; peut s&#8217;&#233;crire
de la forme suivante : [&#233;l&#233;ment A&#65535;] (ex. h&#233;matotumoral), et si cet &#233;l&#233;ment se termine par &quot;o&quot;,
et s&#8217;il n&#8217;est pas l&#8217;un des pr&#233;fixes fran&#231;ais qui se terminent par &quot;o&quot; : hypo-, r&#233;tro- ou pro- alors
</p>
<p>Ajouter &quot;&#233;l&#233;ment&quot; (ex. h&#233;mato) &#224; Lracines;
si &quot;&#233;l&#233;ment&quot; pr&#233;fixe
au moins un adjectif Ad j dans Ccdsf r o&#249; Ad j se termine par un suffixe &#65535;&#8712; Lsuf f Rel alors
</p>
<p>&quot;&#233;l&#233;ment&quot; est une racine qui peut pr&#233;fixer les adjectifs d&#233;verbaux (ex. bio-);
sinon
</p>
<p>&quot;&#233;l&#233;ment&quot; est une racine qui ne pr&#233;fixe que les adjectifs relationnels (ex. micro-);
</p>
<p>Algorithme 2: Identification des racines gr&#233;co-latines
</p>
<p>On peut prendre (1-Levnormalise) pour mesurer la similarit&#233; entre deux cha&#238;nes.
</p>
<p>Les mesures de similarit&#233; sont souvent utilis&#233;es dans la t&#226;che d&#8217;identification des cognats entre deux
langues (mots similaires orthographiquement et qui ont un sens similaire, ex. FR activiste / EN activist).
Par exemple, Hauer et Kondrak (2011) et Frunza et Inkpen (2010) utilisent ou combinent plusieurs
mesures de similarit&#233; telles que Levenshtein, Lcs, Soundex, Longest prefix, etc. Les scores obtenus entre
chaque couple de mots seront ensuite utilis&#233;s comme traits par un algorithme d&#8217;apprentissage qui les
classifient comme cognats ou non. Afin d&#8217;identifier les mots qui sont des faux cognats, Frunza et Inkpen
(2010) utilisent un corpus parall&#232;le qui sert &#224; d&#233;sambigu&#239;ser les sens des mots. Les mesures de similarit&#233;
ont &#233;t&#233; &#233;galement utilis&#233;es par Cartoni (2009) pour relier un adjectif relationnel avec son nom de
base. Cependant, Cartoni (2009) ne traite pas les adjectifs relationnels construits &#224; partir des formes
suppl&#233;tives des noms. En outre, il exige qu&#8217;un adjectif et un nom aient une similarit&#233; de lettres tr&#232;s
importante afin de les relier automatiquement.
</p>
<p>Dans la suite de cette section, nous d&#233;veloppons des approches pour aligner un adjectif avec un nom.
Nous nous appuyons d&#8217;abord sur la similarit&#233; de lettres entre un adjectif et un nom. Nous utilisons
ensuite la propri&#233;t&#233; P8 (voir la table 1) en nous inspirant du travail de Daille (2000) afin que les
scores obtenus par les mesures de similarit&#233; soient plus r&#233;presentatifs. Enfin, nous utilisons des racines
gr&#233;co-latines pour relier les adjectifs relationnels suppl&#233;tifs avec des noms.
</p>
<p>4.1 Alignement adjectif-nom par mesures de similarit&#233; de lettres
</p>
<p>D&#8217;abord, nous essayons de relier un adjectif avec un nom en n&#8217;utilisant que des mesures de similarit&#233;.
Nous combinons les deux similarit&#233;s : similarit yLcs(A,B) et similarit yLev(A,B) (voir ci-dessous), en
prenant leur moyenne g&#233;om&#233;trique afin d&#8217;avoir un seul score &#8712; [0,1] entre un adjectif et un nom :
</p>
<p>similarit ylet tres(A,B) = (similarit yLcs(A,B)+ similarit yLev(A,B))/2 (1)
</p>
<p>similarit yLcs(A,B) = |Lcs(A,B)|2/(a&#215; b) (2)
similarit yLev(A,B) =
</p>
<p>&#65535;
1&#8722; (Levenshtein(A,B)/a) si a&gt;= b
1&#8722; (Levenshtein(A,B)/b) autrement (3)
</p>
<p>O&#249; similarit yLcs(A,B) et similarit yLev(A,B) &#8712; [0,1], a et b sont les longueurs des cha&#238;nes A et
B respectivement. Dans le calcul du score de Levenshtein, chaque op&#233;ration a un co&#251;t &#233;gal &#224; 1.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>319 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cependant, nous donnons une p&#233;nalit&#233; moins &#233;lev&#233;e &#224; la substitution de deux lettres qui sont proches
phon&#233;tiquement. Par exemple, on fixe la p&#233;nalit&#233; de la substitution de &quot;f&quot; par &quot;v&quot; et &quot;&#233;&quot; par &quot;&#232;&quot; &#224; 0,5.
Nous nous inspirons de Dubois et Dubois-Charlier (1999) pour d&#233;finir ces substitutions, puisque des
adaptations g&#233;n&#233;rales de la langue fran&#231;aise y sont d&#233;finies.
</p>
<p>Si un adjectif peut avoir un emploi nominal (consid&#233;r&#233; comme un substantif dans le dictionnaire), nous
l&#8217;alignons avec lui-m&#234;me (ex. clinique, esth&#233;tique, etc). De plus, nous supposons qu&#8217;un adjectif relationnel
commence par la m&#234;me lettre que son nom de base. En effet, nous avons trouv&#233; en examinant une
liste de 200 adjectifs que cette hypoth&#232;se est vraie dans 97 % des cas.
</p>
<p>Nous consid&#233;rons qu&#8217;un adjectif est reli&#233; &#224; un nom si le score entre les deux est sup&#233;rieur ou &#233;gal &#224; un
certain seuil (on supprime le suffixe relationnel de l&#8217;adjectif lors de la comparaison). Plus on augmente
le seuil de similarit&#233; plus le rappel est faible. La mesure Lcs favorise les noms les plus longs quand
on compare un adjectif avec les noms du dictionnaire. Par exemple, selon Lcs, le nom &quot;notion&quot; est plus
proche de &quot;nominal&quot; que de &quot;nom&quot; : |Lcs(nomin, notion)|=4, |Lcs(nomin, nom)|=3. Alors que les
deux cha&#238;nes ont le m&#234;me score avec &quot;nominal&quot; selon Levenshtein : Levenshtein(nomin, notion)=2,
Levenshtein(nomin, nom)=2). De plus, si on exige une similarit&#233; tr&#232;s importante entre un adjectif
et un nom, on pourra perdre de nombreux alignements corrects (ex. axillaire/aisselle, germe/germinal,
etc). Pour cela, il faut choisir un seuil de similarit&#233; qui ne soit pas tr&#232;s important afin de permettre
&#224; d&#8217;autres m&#233;thodes de filtrage de mieux classifier les alignements obtenus par les mesures de similarit&#233;.
</p>
<p>4.1.1 Alignement adjectif-nom par mesure de similarit&#233; contextuelle
</p>
<p>Dans de nombreux cas, la similarit&#233; de lettres seule ne suffit pas pour trouver le nom avec lequel un
adjectif est reli&#233;. Par exemple, comment peut-on dire que l&#8217;adjectif &quot;s&#233;rique&quot; est d&#233;riv&#233; de &quot;s&#233;rum&quot; et
non pas de &quot;s&#233;rie&quot; ? Nous essayons donc de modifier le score entre un adjectif relationnel et un nom dans
un dictionnaire si la similarit&#233; entre le nom et l&#8217;adjectif est sup&#233;rieure &#224; un certain seuil, en cherchant
des paraphrases monolingues dans lesquelles les deux mots apparaissent. Pour un adjectif A et un nom
N , nous cherchons une paraphrase dans le corpus de la forme [X A : : X PREP DET? N] 4, o&#249; X est un
nom t&#234;te. Comme par exemple, cancer pulmonaire : : cancer du poumon. Afin de calculer un score entre
A et N , nous repr&#233;sentons chacun par un vecteur o&#249; les attributs sont les noms t&#234;tes qui apparaissent
avec A ou N (voir figures 2). Le score d&#8217;un attribut dans le vecteur d&#8217;un nom N est calcul&#233; &#224; l&#8217;aide
de la mesure d&#8217;association IM entre N et le nom t&#234;te X :
</p>
<p>IM(N ,X) = log2
a
</p>
<p>(a+ b)(a+ c)
(4)
</p>
<p>&#8211; a est le nombre d&#8217;occurrences de N et X ensemble
&#8211; b est le nombre d&#8217;occurrences de N avec tous les autres nom t&#234;tes &#65535;= X
&#8211; c est le nombre d&#8217;occurrences de X avec tous les autres noms &#65535;= N
Le score de chaque attribut dans un vecteur d&#8217;adjectif A est calcul&#233; de la m&#234;me mani&#232;re :
</p>
<p>IM &#65535;(A,X) = log2
a&#65535;
</p>
<p>(a&#65535; + b&#65535;)(a&#65535; + c&#65535;) (5)
</p>
<p>&#8211; a&#65535; est le nombre d&#8217;occurrences de A et X ensemble
&#8211; b&#65535; est le nombre d&#8217;occurrences de A avec tous les autres nom t&#234;tes &#65535;= X
&#8211; c&#65535; est le nombre d&#8217;occurrences de X avec tous les autres adjectifs &#65535;= A
Ensuite, nous calculons un score entre les deux vecteurs (nom et adjectif) en utilisant le cosinus.
</p>
<p>similarit yparaphrases(A,N) = cos(A,N) =
</p>
<p>&#65535;n
i=1 IM.IM
</p>
<p>&#65535;&#65535;n
i=1 IM
</p>
<p>2.
&#65535;n
</p>
<p>i=1 IM
&#65535;2 (6)
</p>
<p>4. On peut aussi inclure d&#8217;autres variantes, comme par exemple les formes [X A1 A] (ex. r&#233;gion ganglionnaire axillaire) et
[X A1 PREP DET N] (ex. balayage lent de l&#8217;aisselle).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>320 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 2 &#8211; Vecteurs des adjectifs relationnels et des noms
</p>
<p>O&#249; n est le nombre de noms t&#234;tes communs entre A et N .
</p>
<p>4.1.2 Combinaisons des mesures de similarit&#233; de lettres et de paraphrases
</p>
<p>Pour un adjectif A et un nom N , nous calculons leur score final en combinant leur similarit&#233; de lettres
selon la formule 1 et la similarit&#233; contextuelle selon la formule 6, comme suit :
</p>
<p>score(A,N) = &#945; &#8727; similarit ylet tres(A,N)+&#946; &#8727; similarit yparaphrases(A,N) (7)
En effet, le choix des valeurs de &#945; et &#946; d&#233;pend des seuils minimaux choisis pour la similarit&#233; de lettres.
Par exemple, si on permet une diff&#233;rence de lettres importante, il faut donc choisir &#945;&gt; &#946;.
</p>
<p>Un adjectif A sera reli&#233; au nom avec lequel il a le score le plus &#233;lev&#233;.
</p>
<p>4.1.3 Alignement adjectif-nom en utilisant des racines suppl&#233;tives
</p>
<p>Certains adjectifs contiennent des racines suppl&#233;tives, et dans certains cas il n&#8217;est pas possible de les
relier &#224; leurs noms en s&#8217;appuyant sur la similarit&#233; de lettres quand la modification du nom de base
par la racine suppl&#233;tive est importante (ex. m&#233;dullaire/moelle).
</p>
<p>Nous consid&#233;rons qu&#8217;un adjectif A qui commence par une s&#233;quence de lettres identique &#224; une racine
suppl&#233;tive est relationnel s&#8217;il remplit une des conditions suivantes :
</p>
<p>&#8211; sa forme peut &#234;tre identifi&#233;e comme &#233;tant : [racine suffixe] (o&#249; racine est une des racines suppl&#233;tives
dans une liste des racines align&#233;es avec des noms (Lracines&#8722;noms) (ex. pulmon/poumon, m&#233;dull/moelle,
etc), et suffixe est un des suffixes relationnels dans une liste de suffixes relationnels). Par exemple,
l&#8217;adjectif &quot;pulmonaire&quot; peut &#234;tre d&#233;compos&#233; en &quot;pulmon&quot; (une racine) et &quot;aire&quot; (un suffixe).
</p>
<p>&#8211; il construit avec le nom N associ&#233; &#224; la racine suppl&#233;tive (selon Lracines&#8722;noms) au moins une paraphrase
de la forme [X A : : X PREP DET? N], o&#249; X est un nom t&#234;te. Par exemple, biopsie de moelle : : biopsie
m&#233;dullaire.
</p>
<p>4.1.4 Combinaison des m&#233;thodes d&#8217;alignement
</p>
<p>Nous combinons l&#8217;approche d&#233;crite en section 4.1.3 et celle pr&#233;sent&#233;e dans la section 4.1.2 comme
suit : pour un adjectif A, nous v&#233;rifions s&#8217;il peut &#234;tre reli&#233; avec un nom &#224; l&#8217;aide des racines suppl&#233;tives,
sinon, on applique la formule 7 entre A et chaque nom dans le dictionnaire qui existe dans le corpus.
</p>
<p>De plus, si A (ex. oncog&#233;nique) commence par un pr&#233;fixe ou une ou plusieurs racines suppl&#233;tives, et s&#8217;il
peut s&#8217;&#233;crire de la forme : [(racine | pr&#233;fixe)+ A&#65535;] 5(ex. oncog&#233;nique), o&#249; A&#65535; (ex. g&#233;nique) est un adjectif
dans le corpus : on relie A&#65535; &#224; un nom N &#65535; (ex. g&#232;ne), ensuite, on cherche le nom n = [(racine | pr&#233;fixe)+
N&#65535;] (ex. oncog&#232;ne) dans le corpus, si ceci est trouv&#233;, le nom de base avec lequel A est align&#233; sera n.
Nous supposons aussi que deux adjectifs qui partagent la m&#234;me base (ex. s&#233;rique/s&#233;reux (s&#233;r),
soigneux/soign&#233; (soign), cellulaire/celluleux (cellul), etc.), doivent &#234;tre align&#233;s avec le m&#234;me nom
de base, sinon on consid&#232;re que les alignements sont mauvais et on les supprime de la liste.
</p>
<p>5. | signifie &quot;ou&quot;, + signifie &quot;1 &#224; plusieurs&quot;
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>321 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 Traduction des termes [N AdjR] en utilisant des alignements adjectif-nom
</p>
<p>Nous utilisons les alignements adjectif-nom que nous obtenons par l&#8217;approche d&#8217;alignement adjectif-nom
dans la t&#226;che de traduction compositionnelle de termes complexes de la forme [X AdjR].
</p>
<p>5.1 Approche
</p>
<p>Pour chaque tc=[N AdjR], nous remplacons Ad jR par le nom N &#65535; avec lequel il a &#233;t&#233; align&#233;. Ce
remplacement donne un nouveau terme complexe tc &#65535;=[N PREP DET? N&#65535;], nous supposons que sa
traduction est &#233;quivalente &#224; celle de tc. Nous suivons l&#8217;algorithme pr&#233;sent&#233; sous algorithme 3.
</p>
<p>Donn&#233;es : L[NA] f r (termes fran&#231;ais de la forme [N A]), L[AN]en (termes
anglais de la forme [A N]), L[NN]en (termes anglais de la forme [N N]), Lalignements
(alignements adjectif-nom), Dicof r&#8722;en (dictionnaire bilingue fran&#231;ais-anglais) ;
</p>
<p>R&#233;sultat : Liste de traductions;
d&#233;but
</p>
<p>pour chaque expression de forme [N A] &#8712; L[NA] f r (ex. FR concentration plasmatique) faire
Nen &#8592;&#8722; traduire N par Dicof r&#8722;en (ex. Nen &#8592;&#8722; EN concentration);
Aen &#8592;&#8722; traduire A par Dicof r&#8722;en (ex. Aen &#8592;&#8722; EN plasmatic);
si [Aen Nen] (ex. plasmatic concentration)) existe dans L[AN]en alors
</p>
<p>[Aen Nen] est la traduction de [N A];
sinon
</p>
<p>Prendre le nom N &#65535;
(ex. FR plasma) avec lequel l&#8217;adjectif A (ex. FR plasmatique) est align&#233; de Lalignements ;
N &#65535;en &#8592;&#8722; traduire N &#65535; par Dicof r&#8722;en (ex. Nen &#8592;&#8722; EN plasma);
si [N&#65535;en Nen] (ex. EN plasma concentration) existe dans L[NN]en alors
</p>
<p>[N&#65535;en Nen] est la traduction de [N A];
Algorithme 3: Traduction des termes en utilisant les alignements adjectif-nom
</p>
<p>6 Evaluation
</p>
<p>Dans cette section, nous &#233;valuons les approches que nous proposons pour (a) extraire des adjectifs
relationnels (voir section 3), (b) aligner un adjectif extrait avec son nom de base (voir section 4), (c)
traduire un adjectif relationnel dans les termes [N AdjR] en le rempla&#231;ant par le nom avec lequel il
est align&#233; (voir section 5).
</p>
<p>6.1 Ressources
</p>
<p>Nous disposons des ressources suivantes :
&#8211; corpus comparable fran&#231;ais-anglais dans le domaine du cancer du sein (Ccdsf r et Ccdsen). Nous utilisons
</p>
<p>l&#8217;outil d&#8217;extraction et d&#8217;alignement des termes &#224; partir des corpus Term Suite 6 (Rocheteau et Daille,
2011), afin d&#8217;&#233;tiqueter le corpus et d&#8217;extraire des termes. Ccdsf r contient 14680 mots distincts, alors
que Ccdsen contient 8492 mots distincts. Nous extrayons des phrases selon des motifs, comme suit :
&#8211; 12991 phrases fran&#231;aises (L[NA] f r) extraites par [N A], et 11941 phrases anglaises (L[AN]en)
</p>
<p>extraites par [A N].
&#8211; 12954 phrases fran&#231;aises (L[NN] f r) extraites par [N DET? PREP N], et 10069 phrases anglaises
(L[NN]en) extraites par [N N].
</p>
<p>6. http ://code.google.com/p/ttc-project/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>322 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; liste de pr&#233;fixes Lpre f ixes en fran&#231;ais qui n&#8217;acceptent qu&#8217;une base adjectivale relationnelle ou d&#233;verbale,
cette liste a &#233;t&#233; &#233;tablie par (Cartoni, 2008).
</p>
<p>&#8211; liste de 15 suffixes relationnels en fran&#231;ais Lsuf f Rel (voir P7 dans la table 1).
&#8211; deux listes d&#8217;adjectifs fran&#231;ais extraites automatiquement du corpus :
&#8211; LAd jRClasses : cette liste comprend 361 adjectifs extraits automatiquement du corpus. Elle
</p>
<p>correspond &#224; l&#8217;ensemble des listes extraites du Ccdsf r en suivant l&#8217;algorithme 1.
&#8211; LAd jRBase : contient tous les adjectifs extraits &#224; partir de la propri&#233;t&#233; P7 (c&#8217;est-&#224;-dire &#224; partir des
</p>
<p>suffixes relationnels) et qui composent au moins un terme [N A]&#8712;L[NA] f r . Cette liste contient 1346
adjectifs, elle est consid&#233;r&#233;e comme la liste de base et les r&#233;sultats de l&#8217;alignement adjectif-nom
sur cette liste seront compar&#233;s avec ceux obtenus sur la liste LAd jRClasses.
</p>
<p>&#8211; dictionnaire bilingue fran&#231;ais-anglais (Dicof r&#8722;an) de 145542 entr&#233;es de mots simples.
&#8211; liste de 66 racines suppl&#233;tives fran&#231;aises (Lracines&#8722;noms) align&#233;es avec des noms communs (ex. h&#233;pat
</p>
<p>/ fois, pulmon / poumon, ... etc) (Cottez, 1982).
&#8211; liste de 100 racines Lracines extraite automatiquement du Ccdsf r en appliquant l&#8217;algorithme 2 pr&#233;sent&#233;
</p>
<p>en section 3.2.
</p>
<p>6.2 R&#233;sultats de l&#8217;extraction automatique des adjectifs relationnels
</p>
<p>En appliquant l&#8217;algorithme d&#8217;extraction des adjectifs pr&#233;sent&#233; en section 3 sur Ccdsf r , nous obtenons
quatre listes d&#8217;adjectifs. Un adjectif extrait appartient &#224; une ou plusieurs classes d&#8217;adjectifs : qualificative,
relationnelle, compos&#233;e. Par exemple, l&#8217;adjectif &quot;s&#233;rologique&quot; est compos&#233; et relationnel, car il peut
&#234;tre reli&#233; &#224; &quot;s&#233;rologie&quot; et il se compose de deux &#233;l&#233;ments : &quot;s&#233;ro&quot; et &quot;logique&quot;. Les adjectifs de la classe
&quot;compos&#233;e&quot; ont des emplois non-qualificatifs, mais dans certains cas, on ne peut pas les relier avec
un seul substantif, mais avec un syntagme, par exemple, &quot;unilat&#233;ral&quot; (un seul c&#244;t&#233;) ou &quot;infraclinique&quot;
(&quot;un trouble ou d&#8217;une maladie qui ne provoque pas de manifestation d&#233;celable &#224; l&#8217;examen&quot;) n&#8217;ont pas
&#233;t&#233; form&#233;s par d&#233;rivation d&#8217;un nom mais par pr&#233;fixation.
</p>
<p>Les listes extraites sont pr&#233;sent&#233;es dans la table 2. Nous appelons l&#8217;ensemble de ces listes LAd jRClasses
qui comprend donc 361 adjectifs. Les adjectifs ont &#233;t&#233; class&#233;s manuellement et &#224; l&#8217;aide du syst&#232;me
D&#233;rif (Namer, 2003). Nous remarquons que 198 adjectifs dans LAd jRClasses peuvent &#234;tre classifi&#233;s
comme relationnels, et qu&#8217;il y a beaucoup d&#8217;adjectifs compos&#233;s qui ne sont ni relationnels ni qualificatifs.
</p>
<p>La liste LAd jRClasses contient plus de 54 % d&#8217;adjectifs relationnels et la liste ListeAd jR-2 se compose
de 93 % d&#8217;adjectifs relationnels. Pour avoir une id&#233;e du rappel, nous utilisons D&#233;rif pour aligner les
adjectifs de la liste LAd jRBase avec des noms. D&#233;rif est capable d&#8217;aligner 554 adjectifs avec des noms
par la relation &quot;en rapport avec&quot;. Nous appelons cette liste par ListeDeri f . Nous trouvons que la liste
LAd jRClasses couvre 141 adjectifs de ListeDeri f . Cependant, 57 des adjectifs que nous avons classifi&#233;s
comme relationnels dans LAd jRClasses n&#8217;ont pas pu &#234;tre align&#233;s par D&#233;rif. De plus, il existe des adjectifs
d&#233;nominaux mais non relationnels dans ListeDeri f (ex. original/origine, critique/crise, etc.).
</p>
<p>liste nbr. d&#8217;adjectifs nbr. de classe
qualificative
</p>
<p>nbr. de classe
relationelle
</p>
<p>nbr. classe
compos&#233;e
</p>
<p>ListeAd jR-1 154 0 28 153
ListeAd jR-2 103 8 96 19
ListeAd jR-3 47 3 34 18
ListeAd jR-4 57 6 40 27
Total 361 17 198 217
</p>
<p>TABLE 2 &#8211; Les classes des adjectifs dans les listes extraites
</p>
<p>Les listes d&#8217;adjectifs extraites seront utilis&#233;es par la m&#233;thode de l&#8217;alignement d&#8217;un adjectif relationnel
avec un nom.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>323 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>6.3 R&#233;sultats de l&#8217;alignement adjectif-nom sur les listes d&#8217;adjectifs
</p>
<p>Nous appliquons la m&#233;thode d&#8217;alignement que nous avons propos&#233;e en section 4.1.4 sur les listes des
adjectifs extraits automatiquement (LAd jRClasses et LAd jRBase). Nous fixons empiriquement les poids
des deux similarit&#233;s dans l&#8217;&#233;quation 7 : &#945;=0,70 et &#946;=0,30. Un adjectif et un nom doivent avoir une
similarit&#233; minimale de similarit yLev &#224; 0,6 et une similarit&#233; minimale de similarit yLcs &#224; 0,7 (les deux
similarit&#233;s qui composent similarit ylet tres dans l&#8217;&#233;quation 7).
</p>
<p>Ainsi, 157 adjectifs de la liste LAd jRClasses (parmi 361) ont &#233;t&#233; align&#233;s avec une pr&#233;cision de 89,8 %.
De la liste LAd jRBase, 582 adjectifs (parmi 1346) ont &#233;t&#233; align&#233;s avec une pr&#233;cision de 84,53 %. Nous
avons &#233;valu&#233; les alignements manuellement et &#224; l&#8217;aide de l&#8217;outil D&#233;rif Namer (2003). Nous consid&#233;rons
qu&#8217;un alignement est correct si l&#8217;adjectif a &#233;t&#233; align&#233; avec lui-m&#234;me ou avec son nom de base. En
effet, LAd jRBase contient plus des adjectifs non-relationnels et du bruit (des mots non-fran&#231;ais) que
LAd jRClasses, ce qui explique le taux plus &#233;lev&#233; des mauvais alignements. De plus, nous exigeons que le
nom de base d&#8217;un adjectif soit pr&#233;sent dans le corpus, alors que ce n&#8217;est pas toujours le cas. Le rappel est
le nombre d&#8217;adjectifs align&#233;s divis&#233; par le nombre d&#8217;adjectifs dans la liste. Cependant, il faut noter qu&#8217;il
y a de nombreux adjectifs dans LAd jRBase et LAd jRClasses qui ne peuvent pas &#234;tre reli&#233;s &#224; des noms.
Par exemple, les adjectifs compos&#233;s sont parfois reli&#233;s &#224; des phrases comme on l&#8217;avait d&#233;j&#224; mentionn&#233;
dans la section 6.2. Nous r&#233;sumons les r&#233;sultats de l&#8217;alignement dans la table 3.
</p>
<p>liste nbr. d&#8217;alignements
adj-nom
</p>
<p>pr&#233;cision rappel
</p>
<p>LAdjRClasses 157 89,8 % 43,49 %
LAdjRBases 582 84,53% 43,23 %
</p>
<p>TABLE 3 &#8211; R&#233;sultats des m&#233;thodes d&#8217;alignement adjectif-nom sur LAdjRClasses et LAdjRBase
</p>
<p>Nous pr&#233;sentons les r&#233;sultats de la traduction des termes [N AdjR], en utilisant les alignements
adjectif-nom obtenus, dans la section suivante.
</p>
<p>6.4 R&#233;sultats de la traduction des termes [N AdjR]
</p>
<p>La m&#233;thode compositionnelle qui consiste &#224; traduire des termes fran&#231;ais de la forme [N A] en termes
anglais de la forme [A N] nous a permis de traduire 2039 termes dont les adjectifs sont issus de la
liste LAd jRBase, et 574 termes dont les adjectifs sont issus de la liste LAd jRClasses. Cette m&#233;thode a
donn&#233; une pr&#233;cision de 79,5 % sur une liste de 200 termes traduits qui a &#233;t&#233; examin&#233;e manuellement.
Nous essayons maintenant de traduire les termes fran&#231;ais [N A] non-traduits par la m&#233;thode pr&#233;c&#233;dente
en passant par les noms de base des adjectifs relationnels.
</p>
<p>Nous suivons l&#8217;algorithme 3 afin d&#8217;&#233;valuer l&#8217;impact des alignements adjectif-nom sur la traduction
des termes [N A], voir la table 4. Nous utilisons les 157 alignements adjectif-nom obtenus de la
liste LAd jRClasses et nous trouvons que 42 alignements adjectif-nom de cette liste ont aid&#233; &#224; traduire
172 termes [N A] distincts avec une pr&#233;cision de 91,86 %. En appliquant l&#8217;algorithme 3 sur les 582
alignements adjectif-nom obtenus de LAd jRBase, nous trouvons que 92 de ces alignements ont particip&#233;
&#224; traduire 250 termes distincts avec une pr&#233;cision de 86 %. Les traductions ont &#233;t&#233; v&#233;rifi&#233;es &#224; l&#8217;aide
du dictionnaire r&#233;dactionnel Linguee 7 et la banque de donn&#233;es Termium8. La pr&#233;cision des traductions
est &#233;gale au nombre de termes distincts qui ont au moins une traduction correcte parmi les 5 premi&#232;res
traductions propos&#233;es divis&#233; par le nombre de termes distincts qui ont &#233;t&#233; traduits. Les traductions
propos&#233;es ont &#233;t&#233; class&#233;es par leurs fr&#233;quences dans le corpus cible.
</p>
<p>Les alignements des adjectifs d&#233;nominaux qui ont des emplois qualificatifs (ex. originale/origine,
</p>
<p>7. http ://www.linguee.fr/
8. http ://www.termiumplus.gc.ca/tpv2alpha/alpha-fra.html ?lang=fra
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>324 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>formel/forme) avec des noms ont donn&#233; des mauvaises traductions. Des adjectifs d&#233;verbaux qui peuvent
&#234;tre reli&#233;s &#224; un nom, ont donn&#233; des bonnes et/ou des mauvaises traductions. Par exemple, l&#8217;adjectif
&quot;&#233;tudi&#233;&quot; est d&#233;riv&#233; du verbe &quot;&#233;tudier&quot;, il a &#233;t&#233; reli&#233; avec le nom &quot;&#233;tude&quot; par la m&#233;thode d&#8217;alignement
adjectif-nom. Cet alignement a donn&#233; de bonnes traductions (ex. &quot;population &#233;tudi&#233;e&quot; a &#233;t&#233; traduit par
&quot;study population&quot;), ainsi que de mauvaises traductions (ex. &quot;cellule &#233;tudi&#233;e&quot; a &#233;t&#233; traduit par &quot;study unit&quot;).
</p>
<p>Parfois on trouve des mauvaises traductions malgr&#233; l&#8217;utilisation d&#8217;un alignement correct d&#8217;un adjectif
relationnel avec un nom. Ces mauvaises traductions sont plut&#244;t obtenues &#224; cause des probl&#232;mes li&#233;s &#224; la
m&#233;thode compositionnelle et au corpus comparable. Par exemple, l&#8217;adjectif relationnel &quot;g&#233;n&#233;tique&quot; a &#233;t&#233;
reli&#233; avec &quot;g&#232;ne&quot;, cet alignement a particip&#233; &#224; la traduction de &quot;mutation g&#233;n&#233;tique&quot; par &quot;gene transfer&quot;
(&quot;g&#232;ne&quot; traduit par &quot;gene&quot;) tandis que la bonne traduction est &quot;gene mutation&quot;. Ainsi, la mauvaise
traduction n&#8217;a pas &#233;t&#233; obtenue &#224; cause de l&#8217;alignement de &quot;g&#233;n&#233;tique&quot; avec &quot;g&#232;ne&quot;, mais parce que soit
&quot;mutation&quot; n&#8217;a pas &#233;t&#233; traduit par &quot;mutation&quot; dans le dictionnaire bilingue, soit &quot;gene mutation&quot; n&#8217;existe
pas dans le corpus anglais.
</p>
<p>liste nbr. d&#8217;aligne-
ments adj-nom
</p>
<p>nbr. de termes
[N A] traduits
</p>
<p>pr&#233;cision
</p>
<p>LAdjRClasses 157 172 91,86 %
LAdjRBases 582 250 86,00 %
</p>
<p>TABLE 4 &#8211; R&#233;sultats de la traduction en utilisant les alignements adjectif-nom
</p>
<p>7 Discussion et conclusion
</p>
<p>Dans cet article, nous nous sommes int&#233;ress&#233;s &#224; l&#8217;identification des adjectif relationnels et &#224; l&#8217;alignement
de ces adjectifs avec leurs noms de base. Nous avons &#233;galement essay&#233; de traduire des termes qui se
composent d&#8217;un nom et d&#8217;un adjectif relationnel [N AdjR] en rempla&#231;ant Ad jR par son nom de base.
</p>
<p>Nous avons d&#233;velopp&#233; une m&#233;thode qui exploite plusieurs propri&#233;t&#233;s des adjectifs relationnels pour
les identifier en se basant sur un corpus monolingue. Nous avons extrait par cette m&#233;thode une liste
d&#8217;adjectifs LAd jRClasses. Une autre liste d&#8217;adjectifs LAd jRBase a &#233;t&#233; extraite en utilisant une liste de
suffixes relationnels. Nous avons trouv&#233; que la liste LAd jRClasses contient tr&#232;s peu d&#8217;adjectifs qualificatifs
et moins de bruit que la liste LAd jRBase.
</p>
<p>Ensuite, nous avons d&#233;velopp&#233; une m&#233;thode afin d&#8217;aligner les adjectifs relationnels extraits avec leurs
noms de base &#224; partir d&#8217;un corpus monolingue. Nous nous sommes appuy&#233;s sur la similarit&#233; de lettres,
la similarit&#233; contextuelle et des racines gr&#233;co-latines afin de relier un adjectif &#224; un nom. Nous avons
appliqu&#233; la m&#233;thode d&#8217;alignement sur les deux listes LAd jRBase et LAd jRClasses, et nous avons acquis
des couples d&#8217;adjectif-nom avec une pr&#233;cision sup&#233;rieure &#224; 84 %.
</p>
<p>Enfin, nous avons exploit&#233; les alignements adjectif-nom obtenus pour traduire compositionnellement des
termes de la forme [N AdjR]. La pr&#233;cision des alignements adjectif-nom obtenus &#224; partir de LAd jRClasses,
ainsi que la traduction des termes [N AdjR] obtenus en utilisant ces alignements ont &#233;t&#233; plus &#233;lev&#233;es
que celles des alignements et des traductions obtenues avec LAd jRBase. Par contre, nous obtenons plus
d&#8217;alignements avec LAd jRBase et donc plus de traductions par rapport &#224; l&#8217;utilisation de LAd jRClasses. Il
semble donc que la m&#233;thode d&#8217;alignement adjectif-nom sur une liste d&#8217;adjectifs purement relationnels
peut donner des alignements avec une haute pr&#233;cision et ainsi une haute pr&#233;cision pour la traduction
compositionnelle des termes [N AdjR]. Les mauvais alignements adjectif-nom n&#8217;ont pas beaucoup
influenc&#233; la pr&#233;cision des traductions de ces termes qui est de 86 % en utilisant LAd jRBase. La traduction
compositionnelle permet donc de filtrer les mauvais alignements adjectif-nom.
</p>
<p>Dans ce travail, nous nous sommes concentr&#233;s sur la traduction des termes [N AdjR] pour le couple
de langues fran&#231;ais-anglais. Le principe de traduction par paraphrase de ces termes pour d&#8217;autres couples
de langues devra &#234;tre &#233;tudi&#233; pour en d&#233;montrer la g&#233;n&#233;ricit&#233;.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>325 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Remerciements
</p>
<p>Ce travail a b&#233;n&#233;fici&#233; de l&#8217;aide du septi&#232;me programme cadre de la Commission europ&#233;enne
(FP7/2007-2013) (Grant Agreement no 248005).
</p>
<p>R&#233;f&#233;rences
</p>
<p>BALDWIN, T. et TANAKA, T. (2004). Translation by machine of complex nominals : Getting it right. In
ACL Workshop on Multiword Expressions : Integrating Processing, pages 24&#8211;31.
BOWKER, L. et PEARSON, J. (2002). Working with specialized language : a practical guide to using corpora.
London, Routledge.
CARTONI, B. (2008). De l&#8217;incompl&#233;tude lexicale en traduction automatique : vers une approche morphos&#233;-
mantique multilingue. Universit&#233; de Gen&#232;ve.
CARTONI, B. (2009). Lexical morphology in machine translation : A feasibility study. In 12th Conference
of the European Chapter of the Association for Computational Linguistics (EACL), Athens, pages 130&#8211;138.
COTTEZ, H. (1982). Dictionnaire des structures du vocabulaire savant. Les usuels du Robert, Paris.
DAILLE, B. (1999). Identification des adjectifs relationnels en corpus. In Actes de la Conf&#233;rence de
Traitement Automatique du Langage Naturel (TALN &#8217;99).
DAILLE, B. (2000). Morphological rule induction for terminology acquisition. In 18th International
Conference on Computational Linguistics (COLING), pages 215&#8211;221.
DUBOIS, J. et DUBOIS-CHARLIER, F. (1999). La d&#233;rivation suffixale en fran&#231;ais. Nathan Universit&#233;.
FRUNZA, O. et INKPEN, D. (2010). Word variant identification in old french. International Journal of
Linguistics, 130:481&#8211;510.
GOES, J. (1999). L&#8217;adjectif entre nom et verbe. De Boeck and Larcier D&#233;partement Duculot.
HAUER, B. et KONDRAK, G. (2011). Clustering semantically equivalent words into cognate sets in multi-
lingual lists. In The 5th International Joint Conference on Natural Language Processing (IJCNLP),Chiang
Mai, pages 865&#8211;873.
KETKAR, N. S. et YOUNGBLOOD, G. M. (2010). A largest common subsequence-based distance measure
for classifying player motion traces in virtual worlds. In FLAIRS Conference.
MANIEZ, F. (2005). Identification automatique des adjectifs relationnels : une &#233;tude sur corpus. In De la
mesure dans les terme : Presses Universitaires de Lyon.
MORIN, E. et DAILLE, B. (2010). Compositionality and lexical alignment of multi-word terms. Language
Resources and Evaluation, 44(1-2):79&#8211;95.
NAMER, F. (2003). Automatiser l&#8217;analyse morphos&#233;mantique non affixale : le syst&#232;me D&#233;riF. Cahiers de
Grammaire, 28:31&#8211;48.
NOAILLY, M. (1999). L&#8217;adjectif en fran&#231;ais. Editions Ophrys.
PEDREIRA, N. R. (2002). De la grammaire traditionnelle &#224; la morphologie d&#233;rivationnelle : retour sur
l&#8217;adjectif de relation. In VERBA, pages 421&#8211;434.
RAPP, R. (1995). Identifying word translations in non-parallel texts. In Proceedings of the 33rd annual
meeting on Association for Computational Linguistics (ACL &#8217;95), Cambridge, Massachusetts, pages 320&#8211;322.
ROCHETEAU, J. et DAILLE, B. (2011). TTC TermSuite : A UIMA Application for Multilingual Terminology
extraction from Comparable Corpora. In the 5th International Joint Conference on Natural Language
Processing (IJCNLP),Chiang Mai, pages 9&#8211;12.
ROCH&#201;, M. (2006). Comment les adjectifs sont s&#233;mantiquement construits. Cahier de Grammaire 30.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>326 c&#65535; ATALA</p>

</div></div>
</body></html>