<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annotation automatique d'un corpus d'apprenants d'anglais avec un jeu d'&#233;tiquettes modifi&#233; du Penn Treebank</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation automatique d'un corpus d'apprenants d'anglais 
avec un jeu d'&#233;tiquettes modifi&#233; du Penn Treebank
</p>
<p>Thomas Gaillat1 
(1) Universit&#233; Paris-Diderot &#8211; CLILLAC-ARP (3967) &amp; Universit&#233; de Rennes 1
</p>
<p>!&quot;#$%&amp;'(%)**%!+,-)./01--1&amp;2'30
</p>
<p>R&#201;SUM&#201;________________________________________________________________________
</p>
<p>Cet article aborde la probl&#233;matique de l'annotation automatique d'un corpus d'apprenants 
d'anglais.  L'objectif  est  de  montrer  qu'il  est  possible  d'utiliser  un  &#233;tiqueteur  PoS  pour 
annoter  un  corpus  d'apprenants  afin  d'analyser  les  erreurs  faites  par  les  apprenants. 
Cependant, pour permettre une analyse suffisamment fine, des &#233;tiquettes fonctionnelles 
sp&#233;cifiques  aux  ph&#233;nom&#232;nes  linguistiques  &#224;  &#233;tudier  sont  ins&#233;r&#233;es  parmi  celles  de 
l'&#233;tiqueteur. Celui-ci est entra&#238;n&#233; avec ce jeu d'&#233;tiquettes &#233;tendu sur un corpus de natifs 
avant d'&#234;tre appliqu&#233; sur le corpus d'apprenants. Dans cette exp&#233;rience, on s'int&#233;resse aux 
usages erron&#233;s de this et that par les apprenants. On montre comment l'ajout d'une couche 
fonctionnelle  sous  forme  de nouvelles  &#233;tiquettes  pour ces  deux  formes,  permet  de 
discriminer des usages variables chez les natifs et non-natifs et, partant, d&#8217;identifier des 
sch&#233;mas  incorrects  d'utilisation.  Les  &#233;tiquettes  fonctionnelles  &#233;clairent  sur  le 
fonctionnement discursif.
</p>
<p>ABSTRACT_______________________________________________________________________
</p>
<p>Automatic tagging of a learner corpus of English with a modified version of the Penn 
Treebank tagset
</p>
<p>This article covers the issue of automatic annotation of a learner corpus of English. The 
objective is to show that it is possible to PoS-tag the corpus with a tagger to prepare the 
ground for learner error analysis. However, in order to have a fine-grain analysis, some 
functional tags for the study of specific linguistic points are inserted within the tagger's 
tagset. This tagger is trained on a native-English corpus with an extended tagset and the 
tagging is done on the learner corpus. This experiment focuses on the incorrect use of this 
and that by learners. We show how the insertion of a functional layer by way of new tags 
for the forms allows us to discriminate varying uses among natives and non-natives. This 
opens the path to the identification of incorrect patterns of use. The functional tags cast a 
light on the way the discourse functions.
</p>
<p>MOTS-CL&#201;S : Apprentissage  L2,  corpus  d'apprenants,  analyse  linguistique  d'erreurs, 
&#233;tiquetage automatique, this, that
</p>
<p>KEYWORDS : Second  Language  Acquisition,  learner  corpus,  linguistic  error  analysis, 
automated tagging, this, that
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>271 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Le travail pr&#233;sent&#233; ici se rapporte au domaine de l'acquisition d'une seconde langue, en 
l'occurrence de l'anglais. Il se fonde sur l'&#233;tude de corpus d'apprenants qui sont devenus 
des outils indispensables pour l'analyse des productions dans le domaine de l'acquisition 
d'une seconde langue (Dagneaux, Denness &amp; Granger, 1998). Leur utilisation permet, par 
exemple, d'analyser les erreurs commises afin de proposer des strat&#233;gies de rem&#233;diations 
mises en &#339;uvres dans des didacticiels. La constitution de corpus d'apprenants rencontre 
un d&#233;fi de plus par rapport aux corpus de natifs du fait qu'elle s'accompagne de la mise en 
place d'un syst&#232;me d'annotation dans lequel les erreurs commises par les apprenants sont 
caract&#233;ris&#233;es.  Dans le  domaine  de la  morphosyntaxe,  une  premi&#232;re  voie  emprunt&#233;e  a 
consist&#233; &#224; annoter les erreurs manuellement (Granger, 1993)(Diaz-Negrillo &amp; Fernandez-
Domingez, 2006). Si ce travail offre une richesse pour la description des erreurs, il n'en 
reste  pas  moins  fastidieux  et  co&#251;teux.  Par  ailleurs,  ces  m&#233;thodes  m&#233;langent  la 
caract&#233;risation des erreurs et la description des cat&#233;gories grammaticales dans une m&#234;me 
annotation de type partie du discours (PoS), car les erreurs d'apprenants portent sur un 
mot  dont  le  mauvais  usage  est  d&#233;crit  en  fonction  de  leur  position  grammaticale.  La 
deuxi&#232;me voie consiste &#224; automatiser le processus d'annotation, en distinguant les types 
d'annotation. L'annotation PoS sur corpus d'apprenants a fait l'objet d'exp&#233;rimentations 
multiples (Van Rooy &amp; Schafer, 2003)(De Haan, 2000) dont l'une des solutions a consist&#233; &#224; 
post-&#233;diter certaines &#233;tiquettes afin d'am&#233;liorer la pr&#233;cision globale des &#233;tiquetages, ou 
afin d'y int&#233;grer des informations relatives aux erreurs d'apprenants. Une autre approche 
propos&#233;e  par  (Diaz-Negrillo,  Meurers,  Valera  &amp;  Wunsch,  2010) consiste  &#224;  prendre  en 
compte  l'erreur  dans  un second  temps  seulement.  Les  auteurs  d&#233;veloppent  le  concept 
d'annotation PoS tripartite selon l'id&#233;e que la distribution, la morphologie et le lexique 
constituent le socle &#224; partir duquel les erreurs peuvent &#234;tre syst&#233;matiquement d&#233;duites. 
Selon  eux,  il  faut  &#233;laborer  une  annotation  triple  reprenant  chaque  cat&#233;gorie  sans  y 
adjoindre d'interpr&#233;tation. Nous nous inscrivons dans cette perspective en consid&#233;rant que 
l'&#233;tiquetage automatique PoS effectu&#233; &#224; partir d'un jeu d'&#233;tiquettes d'anglais natif permet 
d'apporter un premier niveau d'information concernant la distribution effective des mots 
refl&#233;tant un usage erron&#233; ou non. Gr&#226;ce &#224; ces informations distributionnelles, le travail 
d'analyse d'erreurs  peut  &#234;tre  abord&#233;  puisque les  questions de compatibilit&#233;  syntaxique 
entre  les  constituants  de  la  phrase  sont  au  centre  d'une  grande  part  des  erreurs 
d'apprenants. Il s'agit donc d'annoter les textes, y compris les erreurs, du point de vue de 
leur distribution pour permettre ensuite une caract&#233;risation fine de ces erreurs. 
</p>
<p>L'objectif de cet article est de montrer qu'il est possible d'utiliser un &#233;tiqueteur (PoS) pour 
annoter  automatiquement  un  corpus  d'apprenants. Cependant,  pour  que  l'analyse  des 
erreurs faites par les apprenants soit suffisamment fines, des &#233;tiquettes sp&#233;cifiques aux 
ph&#233;nom&#232;nes  linguistiques  &#224;  &#233;tudier  doivent  &#234;tre  ins&#233;r&#233;es  parmi  les  &#233;tiquettes  de 
l'&#233;tiqueteur (ce qui distingue cette exp&#233;rience de celle de Van Rooy et al) et celui-ci doit 
&#234;tre entra&#238;n&#233; avec ce jeu d'&#233;tiquettes &#233;tendu sur un corpus natif avant d'&#234;tre appliqu&#233; sur 
le  corpus d'apprenants.  Cette  approche est  d&#233;velopp&#233;e dans cet article  en abordant la 
probl&#233;matique des usages de this et that. En effet, une &#233;tude ant&#233;rieure (Gaillat, 2013) a 
montr&#233; que les apprenants &#233;prouvent des difficult&#233;s concernant l'usage des d&#233;monstratifs. 
Les marqueurs avec lesquels this et that sont en concurrence dans les erreurs ne sont pas 
les m&#234;mes selon leur r&#233;alisation fonctionnelle : the pour les emplois en d&#233;ictiques, it pour 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>272 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>les emplois pronominaux. Afin de pouvoir effectuer un relev&#233; pr&#233;cis et exhaustif de toutes 
ces formes, il est n&#233;cessaire de s'appuyer sur l'annotation PoS du corpus pour extraire les 
this  et  that selon les diff&#233;rentes cat&#233;gories grammaticales auxquelles ils appartiennent. 
Ainsi, les this et that en usage pro-forme, par exemple, peuvent &#234;tre isol&#233;s et mis en regard 
avec les pronoms  it.  Notre &#233;tude montre que l'&#233;tiquetage permet de mettre &#224;  jour des 
sch&#233;mas incorrects d'utilisation de this et that par les apprenants. &#192; partir de l&#224;, un travail 
d'analyse des erreurs peut &#234;tre effectu&#233;. 
</p>
<p>L'article est organis&#233; de la fa&#231;on suivante. La section 2 aborde la m&#233;thodologie suivie pour 
mener notre exp&#233;rience &#224; partir de deux corpus. Apr&#232;s les avoir d&#233;crits, nous abordons la 
probl&#233;matique  du jeu  d'&#233;tiquettes  et  sa  modification  en  utilisant  TreeTagger  (Schmid, 
1994). La section 3 pr&#233;sente l'annotation automatique faite avec TreeTagger. Les r&#233;sultats 
obtenus  permettent  une  analyse  de  la  qualit&#233;  de  l'&#233;tiquetage  mais  aussi  une  analyse 
d'erreurs d'apprenants. 
</p>
<p>2 M&#233;thodologie
</p>
<p>Dans cette section, la nature des deux corpus utilis&#233;s dans cette &#233;tude est d&#233;crite. Ensuite, 
le probl&#232;me des &#233;tiquettes utilis&#233;es par TreeTagger pour  this  et  that est abord&#233; et leur 
modification est d&#233;crite. 
</p>
<p>2.1 Les corpus 
</p>
<p>Le  corpus  utilis&#233;  pour  la  phase  d'apprentissage  de  TreeTagger  est  le  Penn  Treebank 
(Marcus et al, 1993). Il s'agit d'un corpus d'anglais natif compos&#233; de 4,5 millions de mots 
en anglais am&#233;ricain et correspondant aux articles parus dans le  Wall Street Journal. Ce 
corpus a fait l'objet d'une annotation syntaxique, c'est-&#224;-dire un syst&#232;me d'arbre d&#233;crivant 
les  d&#233;pendances  syntaxiques,  et  d'une  annotation  PoS.  Le  jeu  d'&#233;tiquettes  PoS,  qui 
comporte 36 &#233;tiquettes PoS et 12 pour la ponctuation et les symboles mon&#233;taires, a &#233;t&#233; 
appliqu&#233; automatiquement sur le corpus avant qu'une proc&#233;dure de correction manuelle 
ne  soit  mise  en  &#339;uvre  pour  permettre  &#224;  des  annotateurs  humains  de  modifier  les 
&#233;tiquettes erron&#233;es. Dans le cadre de notre &#233;tude, deux &#233;chantillons sont form&#233;s &#224; partir 
du corpus. Le premier constitue un &#233;chantillon servant &#224; la phase d'apprentissage qui est 
d&#233;crite  ult&#233;rieurement  dans  cet  article.  Il  comprend  1 824 168  mots  et  &#233;tiquettes.  Le 
second &#233;chantillon en contient 63 092 et est utilis&#233; pour tester la qualit&#233; de l'&#233;tiquetage. 
Le  type  de  production  (&#233;crite)  diff&#232;re  du  corpus  d'apprenants  (oral),  mais  le  Penn 
Treebank est utilis&#233; en raison de sa grande fiabilit&#233; (Gold standard). 
</p>
<p>L'&#233;chantillon utilis&#233; pour la phase d'annotation du corpus d'apprenants provient du corpus 
Diderot-LONGDALE1 et plus sp&#233;cifiquement de la partie orale constitu&#233;e &#224; l'universit&#233; de 
Paris-Diderot  sous  le  nom de  Charliphonia.  Le  Diderot-LONGDALE est  un  corpus  oral 
d'apprenants d'anglais. Des &#233;tudiants des niveaux L1 &#224; L3 ont &#233;t&#233; suivis sur trois ann&#233;es, et 
ont particip&#233;  &#224; des entretiens libres avec des lecteurs natifs.  Les enregistrements audio 
recueillis ont &#233;t&#233; retranscrits par des &#233;tudiants d'anglais de niveau M2 pour ensuite &#234;tre 
</p>
<p>1 Cf. http://www.uclouvain.be/en-cecl-longdale.html 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>273 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>v&#233;rifi&#233;s  par  des  enseignants-chercheurs.  Chaque  enregistrement  correspond  &#224;  des 
questions portant sur des exp&#233;riences personnelles et l'&#233;tudiant est invit&#233;  &#224; y r&#233;pondre 
librement.  Cet  &#233;chantillon  est  compos&#233;  de  3 243  mots  ou  ponctuations  et  d'autant 
d'&#233;tiquettes v&#233;rifi&#233;es manuellement. 
</p>
<p>2.2 Les probl&#232;mes des &#233;tiquettes de TreeTagger pour this et that
</p>
<p>Les erreurs  d'apprenants  concernant  l'usage  de  this  et  that se  caract&#233;risent  par  le  fait 
qu'elles  se  situent  sur  l'axe  paradigmatique  plut&#244;t  que  sur  l'axe  syntagmatique.  Les 
difficult&#233;s ne sont en effet pas dues &#224; des probl&#232;mes de position syntaxique mais plut&#244;t &#224; 
des  m&#233;canismes  de  substitution  entre  des  formes  de  fonction  syntaxique  identique.  Il 
existe deux branches principales de substitutions. La premi&#232;re touche au syst&#232;me d&#233;ictique 
et  au  type  de  r&#233;f&#233;rence  endophorique  ou  exophorique2.  Deux  groupes  d'erreurs  se 
distinguent. Un certain nombre d'erreurs d&#233;note des confusions entre l'un et l'autre des 
types  de  r&#233;f&#233;rence.  Les  apprenants  utilisent  une  forme exophorique  dans  un  contexte 
endophorique. Cela se traduit par des substitutions de l'une des formes par l'autre. L'autre 
groupe d'erreurs se situe au sein m&#234;me des processus de r&#233;f&#233;rence endophorique. Dans ce 
cas, c'est la valeur r&#233;f&#233;rentielle de la forme qui est mal ma&#238;tris&#233;e et l'apprenant op&#232;re aussi 
une substitution entre les deux formes. 
</p>
<p>La deuxi&#232;me branche de substitutions concerne des interactions du syst&#232;me d&#233;ictique avec 
les deux micro-syst&#232;mes pronominal et d&#233;terminatif.  This et  that peuvent endosser deux 
fonctions syntaxiques dans la phrase en anglais. On peut les retrouver devant un syntagme 
nominal ou en position de syntagme nominal. Quirk et al (1985) les distinguent en usage 
d&#233;terminant ou nominal. Pour notre part, nous reprenons les termes de d&#233;terminant et de 
pro-forme  (Lapaire  et  Rotg&#233;,  1998 :  50-51) qui  traduit  une r&#233;f&#233;rence s&#233;mantique plus 
&#233;tendue qu'un groupe nominal isol&#233;. Pour les apprenants, les interactions se traduisent par 
des difficult&#233;s de choix entre un this / that et un it ou the, selon la fonction syntaxique. Les 
erreurs  li&#233;es  &#224;  la  fonction  d&#233;terminative  renvoient  au  statut  morphosyntaxique  des 
&#233;l&#233;ments et leur position dans la cha&#238;ne syntagmatique. Les erreurs li&#233;es &#224; la fonction pro-
forme se caract&#233;risent du point de vue s&#233;mantique des r&#233;f&#233;rents qui sont mal identifi&#233;s par 
les  apprenants.  Cette  distinction  entre  les  deux  types  d'erreurs  repose  donc  sur  une 
distinction  fonctionnelle  qui  doit  appara&#238;tre  dans  l'&#233;tiquetage.  Afin  de  comprendre  la 
mani&#232;re dont les &#233;tiquettes propres &#224; this et that sont trait&#233;es par l'&#233;tiqueteur automatique 
TreeTagger, il est utile de s'appuyer sur les exemples suivants :
</p>
<p>(1) &lt;A&gt; would you consider pizza an Italian food &lt;/A&gt;&lt;B&gt; (em) yes but it&#8217;s not 
it&#8217;s not really f= it&#8217;s typic but it&#8217;s not (em) we can eat  that everyday everywhere 
now and . but (em) my grandma does this by herself.
</p>
<p>(2) I don&#8217;t know between New Zealand and (er) Latin America I can&#8217;t choose so I 
think I will do both &lt;laughs&gt; (em) because it&#8217;s so different from (er) from France 
(er) . I would like to discover the= all these new cultures and (er) if I had  this 
</p>
<p>2  La r&#233;f&#233;rence est endophorique quand le r&#233;f&#233;rent se trouve dans le discours du locuteur. Elle est exophorique 
quand il se trouve dans la situation dans laquelle se trouve le locuteur physiquement. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>274 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>opportunity  to  visit  these  countries  I  would live  in  a  very  typical  family  of  the 
country. 
</p>
<p>En (1), le locuteur natif (marqu&#233; &lt;A&gt;) pose une question sur l'entit&#233; pizza &#224; l'apprenant 
(marqu&#233; &lt;B&gt;). Celle-ci produit une r&#233;ponse dans laquelle elle fait r&#233;f&#233;rence plusieurs fois 
&#224;  cette  entit&#233;,  y  compris  avec  les  pro-formes  this et  that.  Dans  les  deux cas,  il  s'agit 
respectivement  d'usages  inattendus  et  erron&#233;s,  non  pas  du  point  de  vue  de  leur 
distribution, mais du point de vue de leur valeur r&#233;f&#233;rentielle. En (2) le locuteur commet 
une autre erreur de substitution mais elle diff&#232;re de (1) par l'&#233;l&#233;ment avec lequel le this se 
substitue,  c'est-&#224;-dire  the.  Des v&#233;rifications aupr&#232;s de natifs  anglophones montrent que 
l'usage du pronom  it aurait  &#233;t&#233;  privil&#233;gi&#233;  en (1) et  le d&#233;terminant  the  en (2).  Ce qui 
diff&#233;rencie ces erreurs provient de la cat&#233;gorie grammaticale des formes : soit elles jouent 
le r&#244;le de d&#233;terminant en t&#234;te de syntagme nominal, soit elles jouent le r&#244;le de pro-forme 
en rempla&#231;ant un syntagme nominal.  Pour identifier ces types d'erreur,  il  faut pouvoir 
isoler les usages pro-formes des usages d&#233;terminants. Or, le jeu d'&#233;tiquettes de TreeTagger 
attribue une seule &#233;tiquette dans les deux cas. Concr&#232;tement, dans les deux exemples, 
l'&#233;tiquette DT (qui renvoie &#224; d&#233;terminant) est attribu&#233;e &#224; chaque occurrence, ce qui rend 
impossible une requ&#234;te ult&#233;rieure pour extraire les cas de this en pro-forme uniquement. 
L'analyse de l'erreur de substitution avec it n'est donc pas possible. Il en va de m&#234;me pour 
les substitutions avec the. 
</p>
<p>2.3 Modification des &#233;tiquettes PoS de this et that dans le Penn Treebank
</p>
<p>Pour &#233;tiqueter, le logiciel TreeTagger n&#233;cessite un fichier format&#233; sp&#233;cifiquement, produit 
lors  de  la  phase  d'apprentissage,  qui  se  nourrit  d'un  corpus  correctement  &#233;tiquet&#233;. 
L'apprentissage implique donc l'usage d'un corpus de natifs &#8211; le Penn Treebank - incluant 
les &#233;tiquettes modifi&#233;es. Il convient par cons&#233;quent de proc&#233;der &#224; l'identification de toutes 
les  occurrences  de  this et  that dans le  corpus de natifs  et  de les  modifier.  On pourra 
ensuite proc&#233;der au formatage des donn&#233;es d&#233;crit en 2.4. La premi&#232;re t&#226;che consiste &#224; 
rep&#233;rer l'ensemble des formes selon la position syntaxique qu'elles occupent. Pour ce faire, 
l'outil Tregex (Levy &amp; Andrew, 2006) est utilis&#233;. Gr&#226;ce &#224; des expressions r&#233;guli&#232;res, celui-ci 
permet de visualiser les arbres syntaxiques composant le corpus et d'effectuer des requ&#234;tes 
sur les arbres syntaxiques. Cela permet de combiner des contraintes constitu&#233;es de mots et 
d'&#233;l&#233;ment syntaxiques tels que les syntagmes verbaux ou les propositions subordonn&#233;es. 
De cette mani&#232;re il est possible d'explorer les arbres syntaxiques.
</p>
<p>Un inventaire des formes this et that est donc effectu&#233;. Pour ce qui concerne la distinction 
pro-forme / d&#233;terminant des formes, il s'agit d'abord d'identifier toutes les formes de that 
et this &#233;tiquet&#233;es DT. La requ&#234;te suivante, exprim&#233;e en expression r&#233;guli&#232;re : 
</p>
<p>/^DT$/ &lt; that &gt; /^NP.*/
</p>
<p>permet d'identifier les formes  that  &#233;tiquet&#233;es DT en partie du discours et faisant partie 
d'un syntagme nominal. Cependant, en proc&#233;dant par recoupements entre les calculs &#224; 
partir  des  &#233;tiquettes  et  &#224;  partir  des arbres syntaxiques,  des erreurs  sont trouv&#233;es.  Par 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>275 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>exemple la requ&#234;te : /^IN.*/ &lt; that &gt; /^NP.*/3
</p>
<p>correspond aux that &#233;tiquet&#233;s IN et domin&#233;s directement par un syntagme nominal. Une 
illustration en contexte donne l'exemple suivant :
</p>
<p>wsj_0277.mrg-26  The  Mitsubishi  family  company 
acquired that  property from the government some 100 
years ago [...]
</p>
<p>Dans ce  type  de  cas,  le  that ne peut  &#234;tre  &#224;  la  fois  subordonnant  et  jouer  le  r&#244;le  de 
d&#233;terminant pour le nom property. Cela r&#233;v&#232;le donc une erreur d'&#233;tiquetage. Cependant, 
du fait de la position de that juste apr&#232;s un verbe, on comprend que cette configuration ait 
men&#233; &#224; l'erreur car, dans bien des cas, le verbe suivi d'un that introduit une subordonn&#233;e 
compl&#233;tive. En proc&#233;dant de la sorte et en diversifiant les requ&#234;tes pour identifier toutes 
les fonctions possibles de that, 871 erreurs d'&#233;tiquetage de that sont trouv&#233;es. 
</p>
<p>Du fait  de ces erreurs,  deux t&#226;ches de modification d'&#233;tiquettes sont n&#233;cessaires.  Tout 
d'abord,  il  convient  de  corriger  les  erreurs  d'&#233;tiquetage  PoS  dans  le  Penn  Treebank. 
Ensuite, il s'agit de modifier les &#233;tiquettes DT en permettant la distinction d&#233;terminant et 
pro-forme. Dans les deux cas, l'utilisation du module TSurgeon du logiciel Tregex permet 
d'effectuer les changements n&#233;cessaires.
</p>
<p>3 Annotation automatique avec TreeTagger et r&#233;sultats
</p>
<p>Cette  section  se  focalise  sur  l'annotation automatique  du logiciel  TreeTagger  (Schmid, 
1994).  La  m&#233;thode  d'annotation  et  le  fonctionnement  de  TreeTagger  sont  pr&#233;sent&#233;s. 
Ensuite,  la  phase  d'apprentissage,  sur  un  corpus  de  natifs  et  avec  un  jeu  d'&#233;tiquettes 
modifi&#233;, est pass&#233;e en revue. Le processus d'annotation est d&#233;taill&#233; et les r&#233;sultats obtenus 
sont analys&#233;s du point de vue des performances dans un premier temps. Dans un second 
temps,  l'analyse consid&#232;re,  d'un point de vue qualitatif,  l'apport de l'annotation et des 
&#233;tiquettes modifi&#233;es, dans le cadre d'une analyse linguistique d'erreurs portant sur this et 
that. 
</p>
<p>3.1 M&#233;thode d'annotation, fonctionnement et apprentissage
</p>
<p>TreeTagger est un outil d'annotation bas&#233; sur une m&#233;thode probabiliste. &#192; partir de la 
repr&#233;sentation  d'un  arbre  d&#233;cisionnel  binaire,  le  programme  estime  la  probabilit&#233;  de 
trigrammes PoS. Par exemple, la probabilit&#233; d'une pro-forme, pr&#233;c&#233;d&#233;e d'un verbe et d'un 
pronom, est calcul&#233;e et stock&#233;e en m&#233;moire, et constitue une branche de l'arbre (PP, VB, 
TPRON). L'arbre de d&#233;cision permet la classification de toutes les instances de PoS dans 
diff&#233;rentes  branches  lorsqu'elles  sont  pr&#233;sent&#233;es  au  programme  dans  sa  phase 
d'apprentissage. Lors de la phase d'annotation, TreeTagger s'appuie sur l'arbre construit et 
</p>
<p>3 IN correspond &#224; une pr&#233;position ou une conjonction de subordination et NP correspond &#224; un syntagme 
nominal. Le symbole &gt; signifie que l'argument de gauche est domin&#233; dans l'arborescence par l'argument de 
droite. Le symbole &lt; signifie l'inverse.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>276 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>la  probabilit&#233;  d'un  trigramme  donn&#233;  pour  attribuer  une  &#233;tiquette  &#224;  chaque  mot. 
L'&#233;valuation des performances de l'annotateur se fait par calcul de la pr&#233;cision globale 
(&#171; accuracy &#187;) pour l'ensemble des &#233;tiquettes,  et du rappel et de la pr&#233;cision pour des 
&#233;tiquettes sp&#233;cifiques. 
</p>
<p>Le fonctionnement de TreeTagger se fait en deux temps : un apprentissage sur un corpus 
&#233;tiquet&#233; puis le processus d'attribution des &#233;tiquettes sur un corpus vierge. Il est important 
de noter que TreeTagger est en fait constitu&#233; de deux programmes :  train-tree-tagger et 
tree-tagger.  Le  travail  d&#233;crit  en  section2a  pour  objectif  de  pr&#233;parer  les  donn&#233;es 
d'apprentissage  trait&#233;es  par  le  module  train-tree-tagger.  Apr&#232;s  la  modification  des 
&#233;tiquettes,  la  pr&#233;paration  du fichier  d'apprentissage  n&#233;cessaire  &#224;  ce  module  peut  &#234;tre 
op&#233;r&#233;e afin d'extraire les paires de mots ou ponctuation et d'&#233;tiquettes PoS. L'extraction 
des paires &#233;tiquettes / mots s'effectue depuis les fichiers bruts contenant les structures 
syntaxiques sous forme de jeu de parenth&#232;ses, les PoS et les mots / ponctuation et les 
paires sont plac&#233;es sur des lignes uniques d'un fichier texte. L'illustration 1 sch&#233;matise ce 
processus en montrant un extrait du Penn Treebank et le r&#233;sultat obtenu, c'est-&#224;-dire le 
fichier utilis&#233; par le module train-tree-tagger. 
</p>
<p>FIGURE 1 - Extraction des paires de mot / PoS depuis les arbres syntaxiques du Penn 
Treebank
</p>
<p>Lors de son ex&#233;cution4, le module construit un fichier de param&#233;trages (output file) qui 
sera  ensuite  utilis&#233;  par  le  module d'annotation.  Sa construction se fait  sur la  base de 
plusieurs fichiers dont l'un correspond au lexique extrait du corpus d'apprentissage. Celui-
ci inclut notamment, les entr&#233;es correspondant &#224;  this et  that et pr&#233;sent&#233;es ci-dessous au 
format attendu par TreeTagger :
</p>
<p>that DT that TPRON that TCOM that RB that TREL that
this DT this TPRON this RB this
</p>
<p>4 En respectant la syntaxe suivante : train-tree-tagger {options} &lt;lexicon&gt; &lt;open class file&gt; &lt;input file&gt; 
&lt;output file&gt;
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>277 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bien que l'article se focalise sur les pro-formes et d&#233;terminants, on voit que d'autres usages 
sont  aussi  distingu&#233;s  par  l'&#233;tiquetage.  Le  jeu  d'&#233;tiquettes  d'origine  du  Penn  Treebank 
distingue plusieurs cat&#233;gories. DT et RB peuvent correspondre &#224; des occurrences de this et 
that, l'&#233;tiquette  DT  pouvant  &#234;tre  assign&#233;e  &#224;  des  pro-formes  ou  d&#233;terminants  sans 
distinction. A ces &#233;tiquettes s'ajoutent WDT pour les d&#233;terminants en WH et IN pour les 
conjonctions de subordination et les pr&#233;positions. Le nouveau jeu d'&#233;tiquettes adopt&#233; vise 
&#224; clarifier les r&#233;alisation fonctionnelles possibles de this et that. On peut retrouver les deux 
formes dans la composition d'un syntagme nominal comme exprim&#233; en  2.2. Pour ce qui 
concerne la forme  that, Biber  et al (1999 : 85 ; 195) pointent les deux autres fonctions 
possibles dans la construction de l'hypotaxe en tant que pronom relatif  et en tant que 
compl&#233;tif.  Les  entr&#233;es  this et  that du  lexique  refl&#232;tent  donc  la  modification  du  jeu 
d'&#233;tiquettes apport&#233;e ce qui donne DT pour les d&#233;terminants, TPRON pour les pro-formes, 
TCOM pour les compl&#233;tifs, RB pour les adverbiaux et TREL pour les pronoms relatifs. 
</p>
<p>Au  final,  le  fichier  de  param&#233;trage  inclut  une  s&#233;rie  d'informations  telles  que  l'arbre 
d&#233;cisionnel,  les  &#233;tiquettes  possibles  pour  chaque  mot  du  corpus  et  l'&#233;chantillon 
d'apprentissage corrig&#233; et &#233;tiquet&#233; tel que d&#233;crit en 2.3. 
</p>
<p>3.2 Processus d'annotation 
</p>
<p>Le processus d'annotation se fait avec le module  tree-tagger. L&#8217;ex&#233;cution du programme 
n&#233;cessite les arguments &#224; indiquer dans l'ordre suivant : le fichier de param&#233;trage cr&#233;&#233; lors 
de l&#8217;ex&#233;cution du programme  train-tree-tagger,  le  fichier  correspondant  au corpus non 
&#233;tiquet&#233;, et le nom de fichier de ce m&#234;me corpus une fois &#233;tiquet&#233;. Dans le cadre de cette 
&#233;tude, deux annotations sont lanc&#233;es. Une premi&#232;re consiste &#224; reproduire l'exp&#233;rience de 
Schmid en annotant l'&#233;chantillon test du Penn Treebank mais avec les nouvelles &#233;tiquettes 
propres &#224;  this  et  that.  La seconde est appliqu&#233;e &#224; un &#233;chantillon test du corpus Diderot-
LONGDALE d&#233;crit en 2.1. Dans les deux cas d'annotation le m&#234;me fichier d'apprentissage, 
cr&#233;&#233; &#224; partir du Penn Treebank, est utilis&#233;. 
</p>
<p>L'objectif de la premi&#232;re annotation est de pouvoir comparer la qualit&#233; de l'&#233;tiquetage et 
de  la  mettre  en  regard  avec  les  r&#233;sultats  obtenus  et  d&#233;crits  par  Helmut  Schmid. 
L'&#233;chantillon test du Penn Treebank, comprenant des &#233;tiquettes modifi&#233;es, permet en outre 
de v&#233;rifier la qualit&#233;  de la prise en charge des nouvelles &#233;tiquettes introduites pour la 
distinction des  this  et  that.  L'objectif de la seconde annotation est de pouvoir &#233;valuer sa 
qualit&#233;  pour  ce  qui  concerne  l'ensemble  des  &#233;tiquettes,  mais  aussi  de  v&#233;rifier  si  les 
nouvelles &#233;tiquettes introduites sont correctement g&#233;r&#233;es par TreeTagger sur de l'anglais 
non-natif. 
</p>
<p>3.3 R&#233;sultats
</p>
<p>Les  r&#233;sultats  sont  exprim&#233;s  &#224;  partir  des  calculs  de  pr&#233;cision  globale  (&#171; accuracy &#187;  en 
anglais)  et  de  rappel  pour  ce  qui  concerne  les  this  et  that.  Pour  ce  qui  concerne 
l'annotation de l'&#233;chantillon test du Penn Treebank, la pr&#233;cision globale est de 95,79 %. 
Sur 31 546 &#233;tiquettes, 30 220 ont &#233;t&#233; correctement attribu&#233;es. Ce r&#233;sultat est tout &#224; fait 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>278 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>similaire aux 96 % rapport&#233;s dans l'exp&#233;rience de Schmid. Les modifications d'&#233;tiquettes 
ne semblent donc pas avoir eu d'impact global sur la qualit&#233; de l'&#233;tiquetage. Si on prend 
les this dans leur globalit&#233;, c'est-&#224;-dire toutes &#233;tiquettes confondues attribu&#233;es &#224; la forme, 
la pr&#233;cision globale est de 92,10 %. Les  that sont correctement &#233;tiquet&#233;s dans 84 % des 
cas. La baisse de performance concernant les that provient certainement de la vari&#233;t&#233; plus 
grande  des  &#233;tiquettes  qu'il  peut  recevoir,  ce  qui  introduit  plus  d'incertitude  dans  le 
processus d&#233;cisionnel de TreeTagger.
</p>
<p>Si les observations globales informent sur la qualit&#233; de l'&#233;tiquetage des mots, il convient 
d'&#233;tudier plus en d&#233;tail la situation &#233;tiquette par &#233;tiquette, pour chacune des formes, afin 
d'explorer  la  qualit&#233;  de traitement des  cat&#233;gories  grammaticales.  Le comportement  de 
TreeTagger  pour  les  &#233;tiquettes  DT  et  TPRON  est  d'autant  plus  int&#233;ressant  qu'elles 
permettent une distinction nouvelle dans le Penn Treebank (cf. Tableau 1). 
</p>
<p>Rappel % Pr&#233;cision % F-Score % Nombre 
d'occurrences 
vraies attendues 
</p>
<p>This DT 100 91,04 95,31 61
</p>
<p>This TPRON 60 100 75 15
</p>
<p>That DT 75 78,94 76,94 20
</p>
<p>That TPRON 55 88,23 68,18 27
</p>
<p>TABLEAU 1 - R&#233;sultats de l'&#233;tiquetage des this et that avec les &#233;tiquettes d&#233;terminant et pro-
forme pour le Penn Treebank.
</p>
<p>En mettant  en regard les  diff&#233;rentes  &#233;tiquettes,  on s'aper&#231;oit  que les  rappels  DT sont 
syst&#233;matiquement plus &#233;lev&#233;s que les rappels TPRON au sein d'une forme donn&#233;e. Lors du 
processus d'annotation, TreeTagger manque donc moins d'&#233;tiquettes DT que de TPRON. 
Ceci  est  peut-&#234;tre  d&#251;  au  fait  que  DT  est  une  &#233;tiquette  fonctionnelle  qui  se  laisse 
caract&#233;riser  en  trigramme  car  elle  est  positionnelle  (pr&#233;-nominale).  &#192;  l'inverse,  les 
r&#233;sultats  en pr&#233;cision r&#233;v&#232;lent  des valeurs  TPRON syst&#233;matiquement sup&#233;rieures  &#224;  DT 
pour  une  forme  donn&#233;e.  Cela  traduit  le  fait  que  TreeTagger  commet  moins  d'erreurs 
d'&#233;tiquetage  lorsqu'une  &#233;tiquette  TPRON  est  attribu&#233;e.  L'&#233;tiquette  TPRON  n'est  pas 
uniquement tributaire de la position du mot,  elle se caract&#233;rise aussi de mani&#232;re plus 
s&#233;mantique ce qui rend sa d&#233;tection plus al&#233;atoire. Mais une fois d&#233;tect&#233;e, ceci est fait 
avec plus d'assurance. Le d&#233;tails des erreurs d'&#233;tiquetage par &#233;tiquette appara&#238;t dans les 
deux matrices de confusion (cf. Tableaux 2 et 3).
</p>
<p>!&quot;#$ !&quot; &quot;#$%&amp; $'
</p>
<p>&quot;())*+,!&quot; -. - /
</p>
<p>&quot;())*+,&quot;#$%&amp; / 0 /
</p>
<p>&quot;())*+,$' / / /
</p>
<p>TABLEAU 2 - Matrice de confusion pour this dans le Penn Treebank.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>279 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>!&quot;#! !&quot; &quot;#$%&amp; &quot;'%( &quot;$)* $+,
</p>
<p>&quot;-../0,!&quot; 12 3 4 1 3
</p>
<p>&quot;-../0,&quot;#$%&amp; 3 12 1 1 3,
</p>
<p>&quot;-../0,&quot;'%( 2 11 156 7 3,
</p>
<p>&quot;-../0,&quot;$)* 3 1 14 28 3,
</p>
<p>&quot;-../0,$+ 3 3 3 3 3
</p>
<p>TABLEAU 3 - Matrice de confusion pour that dans le Penn Treebank.
</p>
<p>Pour ce qui concerne l'annotation de l'&#233;chantillon du corpus d'apprenants, on obtient une 
pr&#233;cision  globale  de  91 %.  Ce  chiffre  est  &#224;  comparer  avec  les  96 %  obtenus  lors  de 
l'annotation du corpus de natifs Penn Treebank. La diff&#233;rence semble donc traduire une 
difficult&#233;  de TreeTagger &#224;  g&#233;rer  certaines  &#233;tiquettes.  Cette  difficult&#233;  peut trouver deux 
origines.  D'une part,  ce  corpus contient  des erreurs  commises  par  les  apprenants.  Ces 
erreurs constituent des configurations syntaxiques qui ne sont pas r&#233;pertori&#233;es dans l'arbre 
d&#233;cisionnel cr&#233;&#233; lors de la phase d'apprentissage sur le corpus de natifs. D'autre part, il 
s'agit d'un corpus oral caract&#233;ris&#233; par un grand nombre d'h&#233;sitations, de r&#233;p&#233;titions, et de 
phrases non termin&#233;es. L&#224; encore, cela se traduit par des configurations syntaxiques non 
trait&#233;es  lors  de  l'apprentissage.  Lorsque  TreeTagger  parcourt  le  corpus  &#224;  annoter,  il 
rencontre donc des suites syntaxiques non apprises. Il a alors recours &#224; des strat&#233;gies par 
d&#233;faut qui ne suffisent pas &#224; permettre la s&#233;lection de l'&#233;tiquette correcte dans tous les cas. 
</p>
<p>Comme pour le Penn Treebank, il est int&#233;ressant d'observer l'&#233;tiquetage des  this  et  that 
toutes &#233;tiquettes confondues. Pour ce qui concerne les  this,  les 22 occurrences de vrais 
positifs  sont  toutes  &#233;tiquet&#233;es  d'une  des  &#233;tiquettes  possibles,  et  seulement  17  le  sont 
correctement. Cela donne un rappel et une pr&#233;cision de 77,27 % puisque tous les this sont 
&#233;tiquet&#233;s avec une des &#233;tiquettes possibles. Pour ce qui concerne les that, le rappel est de 
51,02 % et la pr&#233;cision de 50 %. Ces r&#233;sultats montrent donc une diff&#233;rence de qualit&#233; 
d'annotation entre les deux corpus. L&#224;  encore, les caract&#233;ristiques oral et non-natif du 
corpus d'apprenants peuvent expliquer cette diff&#233;rence. 
</p>
<p>Afin d'affiner l'observation de ces r&#233;sultats, les calculs peuvent &#234;tre effectu&#233;s en prenant 
chaque &#233;tiquette  DT ou TPRON pour chaque forme (cf.  Tableau  4).  Les r&#233;sultats  sont 
mitig&#233;s. Pour ce qui concerne les  this, les valeurs obtenues pour l'&#233;tiquette DT sont du 
m&#234;me ordre que celles du Penn Treebank m&#234;me si  elles  sont plus faibles (93,75% en 
rappel et 78,94% en pr&#233;cision). Les matrices de confusion renseignent sur les confusions 
de Treetagger (cf. Tableaux 4 et 5) et la distinction du this TPRON est probl&#233;matique. Le 
traitement de that avec les &#233;tiquettes DT et TPRON est compl&#232;tement erron&#233;. Cependant, 
il  faut  noter  que  l'&#233;chantillon  utilis&#233;  et  pr&#233;par&#233;  manuellement  ne  contient  que  peu 
d'occurrences  des  formes  avec  les  &#233;tiquettes  recherch&#233;es.  Ce faible  nombre peut donc 
donner  une  repr&#233;sentation  extr&#234;me qui  ne  refl&#232;te  pas  n&#233;cessairement  la  r&#233;alit&#233;.  Pour 
pouvoir tirer des conclusions sur l'attribution de ces &#233;tiquettes, il conviendrait d'accro&#238;tre 
la taille  de l'&#233;chantillon afin d'obtenir  un plus grand nombre d&#8217;occurrences de chaque 
&#233;tiquette. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>280 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>this DT TPRON RB
</p>
<p>Tagged DT 15 4 0
</p>
<p>Tagged TPRON 1 2 0
</p>
<p>Tagged RB 0 0 0
</p>
<p>TABLEAU 4 - Matrice de confusion pour this dans le corpus Diderot-Longdale.
</p>
<p>that DT TPRON TCOM TREL RB
</p>
<p>Tagged DT 0 1 0 0 0
</p>
<p>Tagged TPRON 0 0 0 0 0
</p>
<p>Tagged TCOM 2 9 21 1 3
</p>
<p>Tagged TREL 0 1 7 4 0
</p>
<p>Tagged RB 0 0 0 0 0
</p>
<p>TABLEAU 5 - Matrice de confusion pour that dans le corpus Diderot-Longdale
</p>
<p>3.4 Analyse d'erreurs d'apprenants avec les &#233;tiquettes modifi&#233;es
</p>
<p>Si du point de vue des performances de traitement des &#233;tiquettes modifi&#233;es, la qualit&#233; de 
l'&#233;tiquetage est faible pour le Longdale, les matrices de confusion r&#233;v&#232;lent n&#233;anmoins les 
cat&#233;gories  grammaticales  qui  g&#233;n&#232;rent  des  erreurs  d'&#233;tiquetage.  Si  ces  erreurs  ne 
permettent  pas  de  diagnostiquer  les  erreurs  d'apprenants,  leur  pr&#233;sence  peut  servir 
d'indice pour la signalisation de certains types d'erreur. L'apprentissage s'&#233;tant fait sur de 
l'anglais natif,  on peut &#233;mettre l'hypoth&#232;se que les diff&#233;rences syntaxiques propres aux 
apprenants sont mal trait&#233;es par  TreeTagger.  C'est en ceci  que les erreurs  d'&#233;tiquetage 
peuvent  &#234;tre  le  r&#233;v&#233;lateur  de  fonctions  syntaxiques  utilis&#233;es  par  les  apprenants,  qui 
diff&#232;rent de l'anglais natif. En effet, si par exemple TreeTagger confond des &#233;tiquettes that  
TPRON en les &#233;tiquetant TCOM, cela pourrait signifier que des configurations syntaxiques 
d'apprenants  dans  lesquelles  se  trouve  le  that TPRON s'approchent  de  celles  du  that 
TCOM. L'apprentissage de TreeTagger ayant eu lieu sur de l'anglais natif, certains usages 
de  that  en pro-forme par les  apprenants  pourraient  donc  ressembler  &#224;  des  usages  en 
compl&#233;tif (verbe suivi de that) tel que l'exemple suivant extrait du corpus COCA5 l'illustre : 
&#171; It happens  that the Constitution didn't  create the dollar. &#187; Un retour sur les donn&#233;es 
permet d'extraire une occurrence de that pro-forme &#233;tiquet&#233;e TCOM apr&#232;s le verbe happen 
(cf. exemple ci-dessous). Ce type d'encha&#238;nement correspond souvent &#224; un usage compl&#233;tif 
en anglais natif. 
</p>
<p>DID0199-S002 - I read it so many times that even if I don't start from the beginning 
I know where I am and I say &lt;begin laughter&gt; oh yes er er er &lt;end laughter&gt; I  
remember  these  times  I  remember  yeah  it  will  happen  that [TCOM]  and  that 
[TCOM] so yes I will read it again and again 
</p>
<p>Dans  cet  exemple,  l'apprenant  ne  souhaite  pas  utiliser  that pour  introduire  une 
</p>
<p>5 Corpus of Contemporary American English de l'universit&#233; de Brigham Young (USA). 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>281 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>compl&#233;tive. Il s'agit en fait d'un transfert de la L1 avec une transposition de l'expression en 
fran&#231;ais : &#171; il arrivera &#231;a et &#231;a &#187;. L'erreur de l&#8217;apprenant se situe au niveau du s&#233;mantisme 
de happen qui ne peut &#234;tre utilis&#233; comme le verbe arriver en fran&#231;ais. L&#224; o&#249; l'anglais place 
l'agent  en  position  de  sujet,  le  verbe  arriver peut  prendre  l'agent  en  position  de 
compl&#233;ment. Cette m&#233;connaissance de la part de l'apprenant le pousse &#224; recourir &#224; l'usage 
d'une pro-forme pour faire r&#233;f&#233;rence &#224; l'agent. Ce sch&#233;ma ne se retrouve pas en anglais et 
par cons&#233;quent TreeTagger n'a pas rencontr&#233; cette possibilit&#233; lors de son apprentissage, 
d'o&#249;  l'erreur  d'&#233;tiquetage.  Ainsi,  l'erreur  d'&#233;tiquetage  ne  permet  pas  de  diagnostiquer 
l'erreur, elle permet de la signaler. 
</p>
<p>Du point de vue qualitatif, TreeTagger et son jeu d'&#233;tiquettes modifi&#233;, doivent permettre le 
traitement  d'un  certain  nombre  de  segments  tels  que  les  exemples  (1)  et  (2)  de  la 
section2.2avec l'attribution de deux &#233;tiquettes distinctes. En (1), le that et le this re&#231;oivent 
l'&#233;tiquette TPRON. Il est alors possible d'extraire toutes les occurrences de ce type &#224; des 
fins d'analyse. En (1), le that &#233;tiquet&#233; TPRON reprend l'entit&#233; pizza en ajoutant une valeur 
de distanciation et de monstration peu probables dans ce contexte. D'autre part, le this, s'il 
permet une reprise de l'entit&#233;, introduit l'id&#233;e d'une information nouvelle le concernant, ce 
qui n'est pas le cas ici. Cet &#233;tiquetage permet donc d'explorer le corpus afin d'identifier les 
erreurs signalant que le processus de r&#233;f&#233;rence par substitution au syntagme nominal est 
mal assur&#233; par les apprenants. 
</p>
<p>L'exemple (2) b&#233;n&#233;ficie aussi de l'introduction de la distinction puisque seuls les cas av&#233;r&#233;s 
d'utilisation en d&#233;terminant du this sont &#233;tiquet&#233;s DT. L'extraction des occurrences du type 
this d&#233;terminant permet une analyse cibl&#233;e des erreurs s'y rapportant.  En (2),  avec la 
d&#233;termination  nominale  this  opportunity,  le  locuteur  fait  r&#233;f&#233;rence  &#224;  l'entit&#233;  discursive 
visite de la Nouvelle Z&#233;lande ou Am&#233;rique Latine. Dans ce cas, l'article d&#233;fini the suffit, alors 
que  this, en  usage  d&#233;terminant,  ajoute  une  notion  de  monstration  qui  ne  pourrait 
fonctionner qu'en cas de reprise de l'entit&#233;. Or, celle-ci est en cours de construction, ce qui 
rend le this caduque. En (1) et (2), les erreurs sont du m&#234;me type et se caract&#233;risent par 
une substitution sur l'axe paradigmatique. L'introduction de la distinction fonctionnelle 
d'&#233;tiquetage DT ou TPRON permet donc l'extraction cibl&#233;e des formes potentiellement 
erron&#233;es et permet un travail d'analyse d'erreurs cibl&#233;. Cela montre l'int&#233;r&#234;t heuristique 
d'une  annotation  fonctionnelle  dans  le  cas  o&#249;  des  micro-syst&#232;mes  d'erreurs  sont 
explicables sur des bases fonctionnelles. 
</p>
<p>4 Conclusion
</p>
<p>Dans  cette  recherche  abordant  la  probl&#233;matique  de  l'annotation  PoS  sur  un  corpus 
d'apprenants d'anglais, nous avons pos&#233; la question de savoir s'il &#233;tait possible d'&#233;tiqueter 
un corpus sur la base d'un corpus de natifs avec des &#233;tiquettes modifi&#233;es pour satisfaire &#224; 
des  besoins  d'analyse  d'erreurs.  La  m&#233;thodologie  employ&#233;e  montre  qu'il  est  possible 
d'utiliser le corpus d'anglais natif Penn Treebank pour modifier les &#233;tiquettes propres &#224; this 
et  that afin de servir  de base &#224;  l'apprentissage de TreeTagger.  Au passage,  un certain 
nombre d'erreurs d'&#233;tiquetage des deux formes dans le Penn Treebank sont d&#233;tect&#233;es et 
corrig&#233;es. L'apprentissage fonctionne puisque lors de la phase d'annotation, les donn&#233;es 
montrent que les  deux &#233;tiquettes  distinguant les  usages  pro-forme et  d&#233;terminant des 
deux formes sont bien prises en compte. Sur le corpus Penn Treebank, TreeTagger attribue 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>282 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>les  &#233;tiquettes  modifi&#233;es  avec  une  relative  efficacit&#233;,  notamment  pour  l'&#233;tiquette 
d&#233;terminant de this. L'&#233;tiquetage des that pose plus de probl&#232;mes du fait de la vari&#233;t&#233; de 
ses usages syntaxiques tant au niveau de l'hypotaxe que de la d&#233;termination. Sur le corpus 
d'apprenants d'anglais, les r&#233;sultats globaux montrent une certaine robustesse. Cependant 
une approche d&#233;taill&#233;e r&#233;v&#232;le que les &#233;tiquettes propres &#224; this et that sont m&#233;diocrement 
prises en charge &#224; l&#8217;exception du  this  d&#233;terminant. Afin de corroborer ou d'infirmer ces 
r&#233;sultats, il conviendrait d'accro&#238;tre la taille de l'&#233;chantillon du corpus d'apprenants. Du 
point  de  vue  qualitatif,  on  peut  dire  que l'&#233;tiquetage  rend  possible  l'analyse  d'erreurs 
d'apprenants  de deux mani&#232;res.  D'une  part,  la  distinction  d'&#233;tiquettes  conduit  vers  un 
ciblage des occurrences pour l'analyse des erreurs pouvant s'y rapporter. D'autre part, les 
erreurs d'&#233;tiquetage permettent de mettre &#224; jour des sch&#233;mas incorrects d'utilisation de 
this  et  that par les apprenants, par rapport &#224; des usages de natifs. L'&#233;tiquetage modifi&#233; 
permet donc de discriminer des usages variables chez les natifs et non-natifs.
</p>
<p>L'&#233;tude montre donc que s'il est possible d'&#233;tiqueter le corpus d'apprenants d'anglais, il 
reste n&#233;anmoins &#224; affiner la m&#233;thode d'apprentissage de mani&#232;re &#224; favoriser la prise en 
charge effective des &#233;tiquettes cr&#233;&#233;es pour permettre l'analyse d'erreur. Lors de la phase 
d'apprentissage,  il  serait  peut-&#234;tre  n&#233;cessaire  de  mixer  le  corpus  en  y  int&#233;grant  des 
occurrences  du corpus d'apprenants.  Cela  permettrait  l'apprentissage  de configurations 
syntaxiques  propres  aux  apprenants  et  &#224;  la  nature  orale  de  ce  corpus.  Gr&#226;ce  &#224;  une 
am&#233;lioration de la distinction d&#233;terminant / pro-forme, il sera alors possible d'analyser 
plus en d&#233;tails les difficult&#233;s &#233;prouv&#233;es par les apprenants sur les questions de r&#233;f&#233;rence 
sous-jacentes &#224; this et that. Le jeu d'&#233;tiquettes DT / TPRON balise les deux micro-syst&#232;mes 
d'erreurs possibles dans le champs des emplois r&#233;f&#233;rentiels de this  et  that. Dans le cadre 
d'une analyse automatique des erreurs d'apprenants, on voit l'int&#233;r&#234;t d'un r&#233;-&#233;tiquetage 
PoS plus fin qui distingue les r&#233;alisations fonctionnelles distinctes annot&#233;es de mani&#232;re 
ambig&#252;e du point de vue de l'analyse d'erreurs.
</p>
<p>L'usage d'outils TAL dans le processus permet l'application du jeu d'&#233;tiquettes &#171; &#224; la vol&#233;e &#187; 
sur tout autre corpus. Il devient possible de d&#233;velopper des outils de requ&#234;tes s'appuyant 
sur  une  annotation  identique  entre  corpus,  les  rendant  ainsi  interop&#233;rables.  Cette 
interop&#233;rabilit&#233; rend envisageable un travail d'analyse d'erreurs contrastive entre plusieurs 
corpus d'anglais  de  locuteurs  de langues  maternelle  diff&#233;rentes,  ce  qui  permettrait  de 
mieux r&#233;pertorier les erreurs et de comparer les micro-syst&#232;mes d'erreurs selon les L1 des 
apprenants.
</p>
<p>Remerciements
</p>
<p>Nous remercions Detmar Meurers de l'Universit&#233; de T&#252;bingen pour ses recommendations 
m&#233;thodologiques  pr&#233;cieuses.  Nos  remerciements  s'adressent  aussi  &#224;  Nicolas  Ballier  de 
l'universit&#233;  de  Paris-Diderot  et  Pascale  S&#233;billot  de  l'IRISA  pour  leur  relecture  et 
suggestions. Que Camille Guinaudeau de INRIA soit remerci&#233;e pour son aide au d&#233;bogage 
de scripts. Enfin, nous adressons nos remerciements &#224; Helmut Schmid pour le partage de 
certains scripts.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>283 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 R&#233;f&#233;rences
</p>
<p>BIBER, D., JOHANSON, S., LEECH, G., CONRAD, S., &amp; FINEGAN, E. (1999).  Longman Grammar of  
Spoken and Written English. Harlow: Longman.
</p>
<p>DAGNEAUX, E.,  DENNESS,  S.,  &amp; GRANGER, S. (1998). Computer-aided Error Analysis.  System, 
(26), pages 163&#8211;174.
</p>
<p>DE HAAN, P. (2000). Tagging Non-native English with the TOSCA-ICLE Tagger.  In Corpus  
Linguistics And Linguistic Theory, pages 69&#8211;80. 
</p>
<p>DIAZ-NEGRILLO,  A.,  &amp;  FERNANDEZ-DOMINGEZ,  J.  (2006).  Error  Tagging  Systems  for  Learner 
Corpora In Spanish Journal of Applied Linguistics (RESLA) RESLA, (19), pages 83&#8211;102.
</p>
<p>DIAZ NEGRILLO, A., MEURERS, D., VALERA, S., &amp; WUNSCH, H. (2010). Towards Interlanguage POS 
Annotation for Effective Learner Corpora in SLA and FLT.  In Language Forum,  36(1-2), 
pages 139&#8211;154.
</p>
<p>GAILLAT, T. (2013). This and That in Native and Learner English: From Typology of Use to 
Tagset Characterisation.  In Corpora and Language in Use.  Louvain : Louvain University 
Press. &#192; para&#238;tre.
</p>
<p>GRANGER, S. (1993). International Corpus of Learner English. In J. Aarts, P. de Haan, &amp; N. 
Ostdijk (Eds.), Papers from the Thirteenth International Conference on Language Research on  
Computerized Corpora, pages 57&#8211;72.
</p>
<p>LAPAIRE,  J.-R.,  &amp;  ROTG&#201;,  W.  (1998).  Linguistique  et  grammaire  de  l&#8217;anglais (3e  &#233;dition.). 
Toulouse: Presses Universitaires du Mirail.
</p>
<p>LEVY, R., &amp; ANDREW, G. (2006). Tregex and Tsurgeon: Tools for Querying and Manipulating 
Tree Data Structures.  In Proceeedings of the  5th International  Conference on Language  
Resources and Evaluation (LREC 2006), Genoa, Italy. 
</p>
<p>MARCUS,  M.  P.,  MARCINKIEWICZ,  M. A.,  &amp; SANTORINI,  B. (1993).  Building a  Large Annotated 
Corpus of English: The Penn Treebank.  In Computational Linguistics,  19(2), pages 313&#8211;
330.
</p>
<p>QUIRK, R., LEECH, G., &amp; SVARTVIK, J. (1985).  A Grammar of Contemporary English. London, 
Beccles and Colchester: Longman.
</p>
<p>SCHMID,  H. (1994).  Probabilistic  Part-of-Speech  Tagging  Using  Decision  Trees.  In 
Proceedings of the International Conference on New Methods in Language Processing,  pages 
14&#8211;16.
</p>
<p>VAN ROOY, B., &amp; SCHAFER, L. (2003). An Evaluation of Three POS Taggers for the Tagging of 
the Tswana Learner English Corpus.  In  D.  Archer,  P. Rayson, A.  Wilson, &amp; T. McEnery 
(Eds.), Proceedings of the Corpus Linguistics 2003 Conference (Vol. 16), pages 835&#8211;844. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>284 c&#65535; ATALA</p>

</div></div>
</body></html>