<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Inf&#233;rences d&#233;ductives et r&#233;conciliation dans un r&#233;seau lexico-s&#233;mantique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Inf&#233;rences d&#233;ductives et r&#233;conciliation
dans un r&#233;seau lexico-s&#233;mantique
</p>
<p>Manel Zarrouk Mathieu Lafourcade Alain Joubert
LIRMM, 161, rue ADA 34095 Montpellier Cedex 5
</p>
<p>R&#201;SUM&#201;
La construction et la validation des r&#233;seaux lexico-s&#233;mantiques est un enjeu majeur en
TAL. Ind&#233;pendamment des strat&#233;gies de construction utilis&#233;es, inf&#233;rer automatiquement de
nouvelles relations &#224; partir de celles d&#233;j&#224; existantes est une approche possible pour am&#233;liorer
la couverture et la qualit&#233; globale de la ressource. Dans ce contexte, le moteur d&#8217;inf&#233;rences a
pour but de formuler de nouvelles conclusions (c&#8217;est-&#224;-dire des relations entre les termes) &#224;
partir de pr&#233;misses (des relations pr&#233;existantes). L&#8217;approche que nous proposons est bas&#233;e sur
une m&#233;thode de triangulation impliquant la transitivit&#233; s&#233;mantique avec un m&#233;canisme de
blocage pour &#233;viter de proposer des relations douteuses. Les relations inf&#233;r&#233;es sont propos&#233;es
aux contributeurs pour &#234;tre valid&#233;es. Dans le cas d&#8217;invalidation, une strat&#233;gie de r&#233;conciliation
est engag&#233;e pour identifier la cause de l&#8217;inf&#233;rence erron&#233;e : une exception, une erreur dans
les pr&#233;misses, ou une confusion d&#8217;usage caus&#233;e par la polys&#233;mie.
</p>
<p>ABSTRACT
Inductive and deductive inferences in a Crowdsourced Lexical-Semantic Network
</p>
<p>In Computational Linguistics, validated lexical-semantic networks are crucial resources.
Regardless the construction strategies used, automatically inferring new relations from already
existing ones may improve coverage and global quality of the resource. In this context, an
inference engine aims at producing new conclusions (i.e. potential relations) from premises
(pre-existing relations). The approach we propose is based on a triangulation method involving
the semantic transitivity with a blocking mechanism to avoid proposing dubious relations.
Inferred relations are then proposed to contributors to be validated or rejected. In cas of
invalidation, a reconciliation strategy is implemented to identify the cause of the erroneous
inference : an exception, an error in the premises, or a confusion caused by polysemy.
</p>
<p>MOTS-CL&#201;S : inf&#233;rence de relations, r&#233;conciliation, enrichissement, r&#233;seau lexical, peuplo-
nomie.
</p>
<p>KEYWORDS: relation inferences, reconcialiation, enrichment, lexical network, crowdsour-
cing.
</p>
<p>1 Introduction
D&#233;velopper un r&#233;seau lexico-s&#233;mantique pour le TAL est l&#8217;un des enjeux majeurs du domaine.
La plupart des ressources existantes ont &#233;t&#233; construites &#224; la main, comme dans le cas de
WordNet (Miller et al., 1990). Bien entendu, quelques outils sont g&#233;n&#233;ralement utilis&#233;s pour la
v&#233;rification de la coh&#233;rence, mais cependant la t&#226;che reste co&#251;teuse en temps et en prix. Des
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>339 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>approches enti&#232;rement automatis&#233;es sont g&#233;n&#233;ralement limit&#233;es &#224; la co-occurrence des termes
car l&#8217;extraction des relations s&#233;mantiques pr&#233;cises entre termes &#224; partir d&#8217;un texte reste difficile.
De nouvelles approches impliquant l&#8217;externalisation ouverte (crowdsourcing) &#233;mergent dans
le TAL sp&#233;cialement avec l&#8217;av&#232;nement de Amazon Mechanical Turk ou plus largement avec
Wikip&#233;dia et le Wiktionnaire pour ne citer que les plus connus. Wordnet ((Miller et al.,
1990) et (Fellbaum et Miller, 1998)) est un r&#233;seau lexical bas&#233; sur des synsets qui peuvent
&#234;tre globalement consid&#233;r&#233;s comme des concepts. (Vossen, 1998) avec EuroWordnet, une
version multi-langues de Wordnet et (Sagot et Fier, 2008) avec WOLF, une version fran&#231;aise
de Wordnet, ont utilis&#233; des croisements automatiques de Wordnet avec d&#8217;autres ressources
lexicales suivi d&#8217;une v&#233;rification manuelle partielle. (Navigli et Ponzetto, 2012) a construit
BabelNet, un grand r&#233;seau lexical multilingue &#224; partir de l&#8217;encyclop&#233;die Wikip&#233;dia mais en
se basant sur les co-occurences entre termes. Dans le domaine de l&#8217;intelligence artificielle,
Cyc (Lenat, 1995) est un exemple de base de connaissances tr&#232;s redondante ayant demand&#233;
un effort manuel particuli&#232;rement important. Hownet (Dong et Dong, 2006) est un autre
exemple d&#8217;une grande base de connaissances bilingue (anglais et chinois) contenant des
relations s&#233;mantiques entre les formes de mots, les concepts et les attributs. Dans Hownet, il
existe d&#8217;avantage de types de relations diff&#233;rents que dans Wordnet bien que les deux projets
aient d&#233;marr&#233; pendant les ann&#233;es 80 et aient &#233;t&#233; manuellement construits par des linguistes
et des psychologues.
Un r&#233;seau lexico-s&#233;mantique tr&#232;s lexicalis&#233; peut contenir des concepts, mais aussi des termes,
des formes de mots ainsi que des expressions compos&#233;es comme points d&#8217;entr&#233;e vers des
sens ou des usages. L&#8217;id&#233;e elle-m&#234;me de sens du mot issue de la tradition lexicographique,
peut &#234;tre discutable dans le cas de ressources pour le TAL et l&#8217;analyse s&#233;mantique, et on
pr&#233;f&#232;rera g&#233;n&#233;ralement consid&#233;rer les mots dans leurs usages. Par usage des mots, on entend
que le raffinement d&#8217;un mot donn&#233; est clairement identifiable par les locuteurs mais qu&#8217;il
peut ne pas &#234;tre s&#233;par&#233; totalement des autres usages de la m&#234;me entr&#233;e. Un usage de mot
met l&#8217;accent sur le contexte d&#8217;utilisation utilis&#233; par les locuteurs. Un terme polys&#233;mique peut
avoir beaucoup d&#8217;usages substantiellement diff&#233;rents des d&#233;finitions classiquement trouv&#233;es
dans un dictionnaire. Un usage donn&#233; peut aussi avoir plusieurs raffinements. Par exemple,
fr&#233;gate peut &#234;tre un oiseau ou un bateau. Une fr&#233;gate&gt;bateau peut &#234;tre distingu&#233;e comme un
bateau moderne ou un navire &#224; voiles ancien. Dans le contexte d&#8217;une approche collaborative,
une telle ressource lexicale peut &#234;tre consid&#233;r&#233;e comme &#233;tant constamment en cours de
construction. Pour un terme polys&#233;mique, certains raffinements peuvent manquer et une
r&#232;gle g&#233;n&#233;rale est de n&#8217;avoir aucune certitude autour de l&#8217;&#233;tat d&#8217;une entr&#233;e. Il est presque
impossible (sauf par inspection manuelle) de savoir si l&#8217;ensemble des raffinements d&#8217;une
entr&#233;e est exhaustif, voire m&#234;me si cette question a vraiment du sens dans le contexte d&#8217;une
ressource dynamique.
La construction d&#8217;un r&#233;seau lexical collaboratif (ou de n&#8217;importe quelle ressource similaire)
peut &#234;tre cat&#233;goris&#233;e selon deux strat&#233;gies. Premi&#232;rement, comme un syst&#232;me contributif
du type Wikip&#233;dia o&#249; des volontaires compl&#232;tent les entr&#233;es (cas du Wiktionnaire). Dans
un second cas, les contributions sont faites indirectement par l&#8217;entremise de jeux, connus
sous le nom de GWAP (Game With A Purpose) (von Ahn et Dabbish, 2008). Dans ce cas,
les joueurs n&#8217;ont pas sp&#233;cialement besoin d&#8217;&#234;tre conscients qu&#8217;ils sont en train de participer
&#224; la construction d&#8217;une ressource lexicale. En aucun cas il ne faudrait croire que le r&#233;seau
construit serait d&#233;pourvu d&#8217;erreurs, erreurs qui sont corrig&#233;es au fur et &#224; mesure de leur
d&#233;couverte. L&#8217;exp&#233;rience montre que les joueurs/contributeurs compl&#232;tent le r&#233;seau sur ce
qui leur parait int&#233;ressant. Ce faisant, un grand nombre de relations triviales ne sont pas
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>340 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pr&#233;sentes bien qu&#8217;elles demeurent pourtant n&#233;cessaires &#224; un r&#233;seau de qualit&#233; devant &#234;tre
utilis&#233; dans diverses applications du TAL dont notamment l&#8217;analyse s&#233;mantique. Par exemple,
les joueurs n&#8217;indiquent que rarement pour un type d&#8217;oiseau particulier que celui-ci peut voler
tant cela parait une g&#233;n&#233;ralit&#233; &#233;vidente. Seuls les faits notables et peu facilement d&#233;ductibles
sont renseign&#233;s par les contributeurs. Les exceptions sont &#233;galement renseign&#233;es par les
</p>
<p>contributeurs, et prennent la forme d&#8217;une relation ayant un poids n&#233;gatif (voler
agent:&#8722;100&#8722;&#8722;&#8722;&#8722;&#8722;&#8722;&#8594;
</p>
<p>autruche).
Afin de consolider le r&#233;seau lexical issu du projet JeuxDeMots, nous utilisons une approche
par inf&#233;rence qui permet de d&#233;duire de nouvelles relations &#224; partir de celles existantes.
L&#8217;approche est uniquement endog&#232;ne en ce qu&#8217;elle ne s&#8217;appuie sur aucune ressource externe.
Les relations inf&#233;r&#233;es sont soumises aux contributeurs pour vote et par la suite soumises &#224;
une validation ou invalidation par un expert. Une grande majorit&#233; des inf&#233;rences se r&#233;v&#232;le
correcte. Toutefois, une part non n&#233;gligeable se r&#233;v&#232;le fausse et il convient de d&#233;terminer
pourquoi. Ce processus d&#8217;explication constitue la r&#233;conciliation entre le moteur d&#8217;inf&#233;rences
et le validateur, men&#233; &#224; l&#8217;aide d&#8217;un dialogue lui permettant d&#8217;expliciter en quoi la relation
consid&#233;r&#233;e est incorrecte. Les causes possibles sont de trois ordres : erreur dans une des
pr&#233;misses, exception, ou confusion li&#233;e &#224; la polys&#233;mie.
Dans cet article, nous pr&#233;sentons tout d&#8217;abord les principes de construction du r&#233;seau lexical
par externalisation ouverte et GWAP (games with a purpose ou human-based computation
game) et nous les illustrons gr&#226;ce au projet JeuxDeMots. Ensuite, nous d&#233;taillons un mo-
teur d&#8217;&#233;licitation compos&#233; d&#8217;un moteur d&#8217;inf&#233;rences et d&#8217;un moteur de r&#233;conciliation. Une
exp&#233;rimentation sur les performances du syst&#232;me est ensuite rapport&#233;e.
</p>
<p>2 R&#233;seau lexical et externalisation ouverte
Il existe beaucoup de m&#233;thodes pour construire un r&#233;seau lexical en tenant compte des
facteurs principaux tels que la qualit&#233; des donn&#233;es, le co&#251;t et le temps de d&#233;veloppement.
En marge des strat&#233;gies manuelles et automatiques, les approches contributives connaissent
une popularit&#233; croissante en ce qu&#8217;elles se r&#233;v&#232;lent &#224; la fois peu co&#251;teuses et efficaces en
qualit&#233;. Plus pr&#233;cis&#233;ment, l&#8217;int&#233;r&#234;t donn&#233; aux GWAP (Thaler et al., 2011) comme m&#233;thode
d&#8217;acquisition de tels r&#233;seaux augmente consid&#233;rablement. Le r&#233;seau de JeuxDeMots (JDM) est
un r&#233;seau lexical construit &#224; partir d&#8217;un ensemble de jeux en ligne. Dans ces jeux, les joueurs
sont invit&#233;s &#224; faire des associations entre termes qui se traduisent en relations lexicales et
s&#233;mantiques entre les n&#339;uds d&#8217;un graphe. Les informations dans le r&#233;seau JDM sont r&#233;colt&#233;es
via un accord non n&#233;goci&#233; entre les joueurs qui sont les acteurs d&#8217;une externalisation ouverte 1.
</p>
<p>2.1 JeuxDeMots : un GWAP pour la construction d&#8217;un r&#233;seau lexical
Lanc&#233; en septembre 2007, JeuxDeMots 2 (Lafourcade, 2007) est un GWAP 3 associant les
joueurs par paires, et visant &#224; construire un grand r&#233;seau lexico-s&#233;mantique. Le r&#233;seau lexical
contruit est compos&#233; de termes (noeuds) et de relations typ&#233;es (arcs). Il contient des termes
potentiellement raffin&#233;s de mani&#232;re analogue aux synsets de WordNet. Il y a plus de 50 types
de relations et chaque occurrence de relation est pond&#233;r&#233;e indiquant une force d&#8217;association.
Une occurrence de relation peut &#233;ventuellement avoir un poids n&#233;gatif indiquant dans ce cas
que la relation est fausse bien que pertinente (ex : une autruche ne vole pas).
</p>
<p>1. http ://fr.wikipedia.org/wiki/Crowdsourcing
2. http ://www.jeuxdemots.org/
3. http ://en.wikipedia.org/wiki/Human-based_computation_game
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>341 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quand un joueur A commence une partie, une consigne concernant le type de la relation
lexicale (synonymie, antonymie, domaine, etc.) est affich&#233;e, ainsi qu&#8217;un terme cible T choisi
dans le r&#233;seau lexical. Ce joueur A a un temps limit&#233; pour saisir des termes qui, selon
lui, correspondent au terme T et &#224; la relation lexicale qu&#8217;indique la consigne. Le nombre
maximum des termes que le joueur peut saisir lors d&#8217;une partie est limit&#233;, ce qui l&#8217;incite
&#224; r&#233;fl&#233;chir soigneusement &#224; ses choix. Le m&#234;me terme T, avec les m&#234;mes instructions, est
donn&#233; ult&#233;rieurement &#224; un autre joueur B, pour qui le processus est identique. Pour rendre le
jeu plus amusant, les deux joueurs obtiennent des points pour les mots qu&#8217;ils ont donn&#233; en
commun. Le calcul du score est expliqu&#233; dans (Joubert et Lafourcade, 2008) et est con&#231;u pour
augmenter &#224; la fois la pr&#233;cision et le rappel lors de la construction du r&#233;seau. Les r&#233;ponses
pr&#233;sent&#233;es par les deux joueurs sont affich&#233;es, celles en commun sont mises en &#233;vidence ainsi
que leur score.
Pour un terme cible T, les r&#233;ponses communes entre les deux joueurs sont ins&#233;r&#233;es dans
la base de donn&#233;es. Celles donn&#233;es seulement par un seul des deux joueurs ne le sont pas
ce qui r&#233;duit consid&#233;rablement le bruit et les chances de d&#233;gradation du r&#233;seau. Le r&#233;seau
s&#233;mantique est donc construit par des termes connect&#233;s par des relations typ&#233;es et pond&#233;r&#233;es
valid&#233;es par paires de joueurs. Ces relations sont &#233;tiquet&#233;es selon les instructions donn&#233;es
aux joueurs et sont pond&#233;r&#233;es selon le nombre de paires de joueurs ayant choisi ces relations.
Initialement et avant la mise du jeu en ligne, la base de donn&#233;es a &#233;t&#233; remplie avec des termes,
cependant si une paire de joueurs sugg&#232;re un terme non-existant, le n&#339;ud correspondant &#224;
ce dernier est ajout&#233; &#224; la base de donn&#233;es.
Afin de pr&#233;server la qualit&#233; et la consistance du r&#233;seau lexical, il a &#233;t&#233; d&#233;cid&#233; que le processus
de la validation implique des joueurs anonymes jouant ensemble. Une relation est consid&#233;r&#233;e
valide si et seulement si elle est propos&#233;e par au moins une paire de joueurs. Ce processus de
validation est similaire &#224; celui utilis&#233; par (von Ahn et Dabbish, 2008) pour l&#8217;indexation des
images et par (Lieberman et al., 2007) pour la collecte de la connaissance du &quot;sens commun&quot;
et (Siorpaes et Hepp, 2008) pour l&#8217;extraction de connaissance. A notre connaissance, cette
technique n&#8217;a jamais &#233;t&#233; utilis&#233;e lors de la construction des r&#233;seaux s&#233;mantiques. Dans le
TAL, d&#8217;autres jeux accessibles via le web existent, comme Open Mind Word Expert (Mihalcea
et Chklovski, 2003) qui vise a cr&#233;er un grand corpus &#233;tiquet&#233; s&#233;mantiquement avec l&#8217;aide
des utilisateurs du Web ou comme SemKey (Marchetti et al., 2007) qui utilise WordNet et
Wikip&#233;dia pour d&#233;sambigu&#239;ser les formes lexicales se r&#233;f&#233;rant &#224; des concepts, ainsi identifiant
les mots-cl&#233;s s&#233;mantiques. Plus de 1300000 parties ont &#233;t&#233; jou&#233;es depuis le lancement pour
environ 25000 heures de temps cumul&#233; de jeu.
</p>
<p>2.2 Diko : un outil contributif pour le r&#233;seau JDM
Diko est un outil bas&#233; sur le web permettant d&#8217;afficher les informations contenues dans le
r&#233;seau lexical JDM ainsi qu&#8217;un outil contributif. La n&#233;cessit&#233; de ne pas d&#233;pendre seulement
de jeux pour construire le r&#233;seau lexical vient du fait qu&#8217;une part non n&#233;gligeable des types
de relations de JDM soit sont difficiles &#224; saisir pour un joueur non expert ou soit sont peu
contributifs (il n&#8217;existe pas beaucoup de termes qui peuvent lui &#234;tre associ&#233;s). En outre,
le besoin d&#8217;un outil contributif vient historiquement des joueurs eux-m&#234;mes qui ont voulu
devenir des contributeurs du r&#233;seau JDM.
Le principe du processus de la contribution est qu&#8217;une proposition faite par un joueur sera
soumise aux votes des autres joueurs. Une fois un certain nombre de votes donn&#233;s, un expert
validateur est averti et finit par inclure (ou &#233;ventuellement exclure) la relation propos&#233;e dans
le r&#233;seau. L&#8217;expert peut rejeter totalement une proposition de relation ou l&#8217;inclure dans le
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>342 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>r&#233;seau avec un poids n&#233;gatif s&#8217;il trouve cela pertinent. Un syst&#232;me de points et de classement
encourage les contributeurs non seulement &#224; proposer de nouvelles relations mais &#233;galement
&#224; voter pour (ou contre) celles des autres. Les contributeurs les plus prolifiques d&#233;passent les
150000 relations propos&#233;es ou vot&#233;es (depuis septembre 2010). Les contributions peuvent
aussi &#234;tre propos&#233;es par un processus automatique pour &#234;tre v&#233;rifi&#233;es et vot&#233;es ult&#233;rieurement
par des utilisateurs. Ce que nous proposons dans cet article se range sous cette cat&#233;gorie de
sc&#233;nario.
</p>
<p>2.3 Quelques caract&#233;ristiques du r&#233;seau JDM
En janvier 2013, le r&#233;seau de JDM contient environ 250000 termes et plus de 1500000
relations (dont environ 15000 qui sont n&#233;gatives). Plus de 4500 termes ont quelques
raffinements (usages vari&#233;s) pour un total d&#8217;environ 15000 usages. Bien que JDM
ait des relations ontologiques, il ne constitue pas une ontologie proprement dite
avec des concepts ou des termes soigneusement hi&#233;rarchiques. Un terme donn&#233; peut
avoir une collection substantielle d&#8217;hyperonymes qui couvre une large partie de la
cha&#238;ne ontologique jusqu&#8217;aux concepts sup&#233;rieurs. Par exemple : hyperonyme(chat) =
{f&#233;lin,mammif&#232;re, &#234;tre vivant, animal de compagnie, vert&#233;br&#233;, ...}. Dans la liste d&#8217;hyper-
onymes pr&#233;c&#233;dente, nous avons omis les poids pour simplifier, mais en toute g&#233;n&#233;ralit&#233;,
les termes les plus lourds sont ceux consid&#233;r&#233;s par les utilisateurs comme les plus pertinents.
</p>
<p>3 Inf&#233;rence et r&#233;conciliation dans un moteur d&#8217;&#233;licitation
Les travaux sur l&#8217;inf&#233;rence dans les r&#233;seaux lexicaux sont curieusement assez peu r&#233;pandus,
en particulier si on les compare aux approches concernant diverses formes de d&#233;duction
logique dans les textes (pour la d&#233;termination du r&#233;f&#233;rent dans les groupes circonstanciels,
ou la r&#233;solution d&#8217;anaphores, par exemple). Dans (Blanco et Moldovan, 2011), des relations
s&#233;mantiques entre concepts pr&#233;sents dans des textes sont inf&#233;r&#233;es. Les termes du texte sont
consid&#233;r&#233;s de facto comme des concepts en ignorant de fa&#231;on quelque peu artificielle tout
probl&#232;me li&#233; &#224; la polys&#233;mie lexicale. Dans (Harabagiu et Moldovan, 1998) du raisonnement
par inf&#233;rence est effectu&#233; sur le WordNet &#233;tendu o&#249; non seulement les synsets mais &#233;galement
les termes des d&#233;finitions associ&#233;s sont des concepts d&#233;lexicalis&#233;s.
</p>
<p>Pour augmenter le nombre de relations dans le r&#233;seau lexical JDM, nous avons con&#231;u un
syst&#232;me d&#8217;&#233;licitation 4 ayant deux principales composantes : (1) un moteur d&#8217;inf&#233;rences et (2)
un r&#233;conciliateur. Le moteur d&#8217;inf&#233;rences propose des relations, tout comme un contributeur,
qui vont &#234;tre &#233;valu&#233;es par la suite par un autre contributeur humain. Dans le cas d&#8217;invalidation
d&#8217;une relation inf&#233;r&#233;e, le r&#233;conciliateur est appel&#233; pour essayer d&#8217;&#233;valuer pourquoi la relation a
&#233;t&#233; trouv&#233;e fausse. L&#8217;&#233;licitation est ici le processus de formalisation de connaissances implicites
de l&#8217;utilisateur en relations explicites dans le r&#233;seau lexical.
</p>
<p>3.1 Moteur d&#8217;inf&#233;rences
Les id&#233;es principales sous-tendant le moteur d&#8217;inf&#233;rences sont les suivantes. Inf&#233;rer pour le
moteur c&#8217;est d&#233;river des conclusions logiques sous la forme de relations entre les termes &#224;
partir de pr&#233;misses (les relations existantes dans le r&#233;seau). Les inf&#233;rences candidates peuvent
</p>
<p>4. L&#8217;&#233;licitation en Gestion des Connaissances est l&#8217;action d&#8217;aider un expert &#224; formaliser ses connaissances pour
permettre de les sauvegarder et/ou les partager. Celui ou celle qui &#233;licite va donc inviter l&#8217;expert &#224; rendre ses
connaissances tacites en connaissances aussi explicites que possible.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>343 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#234;tre logiquement bloqu&#233;es en se basant sur la pr&#233;sence ou l&#8217;absence de quelques autres
relations. Les inf&#233;rences candidates peuvent &#233;galement &#234;tre filtr&#233;es et rejet&#233;es de prime abord
en se basant sur le niveau de force de l&#8217;&#233;valuation. Les conclusions faites par le moteur sont
suppos&#233;es &#234;tre correctes, mais une fois propos&#233;es &#224; un validateur humain peuvent s&#8217;av&#233;rer
tout aussi bien incorrectes, correctes avec un degr&#233; de pr&#233;cision (polys&#233;mie), correctes dans
certains cas (exception) ou correctes mais pas pertinentes. Dans cet article, le type d&#8217;inf&#233;rence
qui nous int&#233;resse est bas&#233; sur la transitivit&#233; de la relation ontologique is-a (hyperonyme). Si
un terme A est un type de B et B a une relation R avec le terme C, alors on peut esp&#233;rer que
A entretienne la m&#234;me relation avec C. Le sch&#233;ma de l&#8217;inf&#233;rence est le suivant :
</p>
<p>FIGURE 1 &#8211; Sch&#233;ma d&#8217;inf&#233;rence triangulaire simple appliqu&#233; &#224; la transitivit&#233; de l&#8217;hyperonymie
(la relation is-a). Les relations (1) et (2) sont les pr&#233;misses et la relation (3) est la conclusion
</p>
<p>logique propos&#233;e dans le r&#233;seau lexical en attendant d&#8217;&#234;tre valid&#233;e.
</p>
<p>Plus formellement on peut &#233;crire : &#8707; A is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B &#8743; &#8707; B R&#8722;&#8722;&#8594; C &#8658; A R&#8722;&#8722;&#8594; C
Par exemple, chat
</p>
<p>is&#8722;a&#8722;&#8722;&#8594; f&#233;lin &#8743; f&#233;lin has&#8722;par t&#8722;&#8722;&#8722;&#8722;&#8594; griffe &#8658; chat has&#8722;par t&#8722;&#8722;&#8722;&#8722;&#8594; griffe
3.1.1 Traitement global
</p>
<p>Le moteur d&#8217;inf&#233;rences est appliqu&#233; sur les termes ayant au minimum un hyperonyme (si-
non le sch&#233;ma ne peut pas &#234;tre appliqu&#233;). Consid&#233;rons un terme T avec un assortiment
d&#8217;hyperonymes pond&#233;r&#233;s. A partir de chaque hyperonyme, le moteur d&#8217;inf&#233;rences d&#233;duit un
ensemble d&#8217;inf&#233;rences. G&#233;n&#233;ralement ces inf&#233;rences ne sont pas disjointes et le poids d&#8217;une
inf&#233;rence propos&#233;e dans plusieurs ensembles est la moyenne g&#233;om&#233;trique incr&#233;mentale de
chaque occurrence (c&#8217;est-&#224;-dire que la pr&#233;sence d&#8217;un poids n&#233;gatif suffit &#224; rendre la moyenne
invalide).
</p>
<p>Par exemple, nous avons l&#8217;ensemble pond&#233;r&#233; d&#8217;hyperonymes suivants pour chat : f&#233;lin - animal -
&#234;tre vivant - mammif&#232;re - animal de compagnie - f&#233;lid&#233; - animal domestique - vert&#233;br&#233;. L&#8217;inf&#233;rence
</p>
<p>chat
has&#8722;par t&#8722;&#8722;&#8722;&#8722;&#8594; squelette peut provenir de plusieurs hyperonymes mais fort probablement de
</p>
<p>vert&#233;br&#233;. L&#8217;inf&#233;rence chat
location&#8722;&#8722;&#8722;&#8722;&#8594; maison ne peut provenir que de l&#8217;hyperonyme animal de
</p>
<p>compagnie.
3.1.2 Filtrage logique
</p>
<p>Bien s&#251;r, le sch&#233;ma ci-dessus est tr&#232;s na&#239;f, sp&#233;cialement si nous tenons compte de la ressource
que nous traitons. En effet, B est possiblement un terme polys&#233;mique et des m&#233;thodes pour
bloquer les inf&#233;rences certainement fausses peuvent et doivent &#234;tre con&#231;ues. Si le terme B
reli&#233; &#224; la premi&#232;re et la deuxi&#232;me relation a deux sens distincts, alors probablement l&#8217;inf&#233;rence
est fausse. La condition pour proposer l&#8217;inf&#233;rence peut &#234;tre formalis&#233;e comme suit (la relation
raff-of correspondant &#224; celle de raffinement/usage pour un terme) :
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>344 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8707; A is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B &#8743; &#8707; B R&#8722;&#8722;&#8722;&#8722;&#8594; C&#65535; &#8707; Bi ra f f &#8722;o f&#8722;&#8722;&#8722;&#8722;&#8594; B &#8743; &#8707; Bj ra f f &#8722;o f&#8722;&#8722;&#8722;&#8722;&#8594; B&#65535;
( &#65535; &#8707; A is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; Bi &#8744; &#65535; &#8707; Bj R&#8722;&#8722;&#8722;&#8722;&#8594; C )
</p>
<p>&#8658; A R&#8722;&#8722;&#8722;&#8722;&#8594; C
En d&#8217;autres termes, l&#8217;inf&#233;rence est bloqu&#233;e si le terme central B poss&#233;de deux raffinements
</p>
<p>distincts Bi et Bj tels que A
is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; Bi et Bj R&#8722;&#8722;&#8722;&#8722;&#8594; C (sch&#233;ma pr&#233;sent&#233; &#224; la figure 2).
</p>
<p>w 1
</p>
<p>w3
</p>
<p>w
2
</p>
<p>FIGURE 2 &#8211; Sch&#233;ma d&#8217;inf&#233;rence d&#233;ductive triangulaire avec un bloquage logique se basant sur
la polys&#233;mie du terme B du milieu. Les termes Bi et Bj sont des raffinements/usages de B.
</p>
<p>Par ailleurs, si l&#8217;une des pr&#233;misses est annot&#233;e comme &quot;correcte mais pas pertinente&quot;, l&#8217;inf&#233;-
rence est bloqu&#233;e, &#233;vitant ainsi de propager des inf&#233;rences certes vraies mais ne pr&#233;sentant a
priori que peu d&#8217;int&#233;r&#234;t en pratique.
</p>
<p>3.1.3 Filtrage statistique
Il est possible d&#8217;&#233;valuer un niveau de confiance (ou d&#8217;intensit&#233;) pour les inf&#233;rences produites,
de fa&#231;on &#224; ce que les inf&#233;rences douteuses puissent &#234;tre filtr&#233;es et rejet&#233;es. Le poids P
d&#8217;une relation inf&#233;r&#233;e est la moyenne g&#233;om&#233;trique des poids des pr&#233;misses (relations (1)
et (2) dans figure 1). Si ce poids est trop faible, l&#8217;inf&#233;rence est rejet&#233;e. Si la deuxi&#232;me
relation a une valeur n&#233;gative, le poids n&#8217;est pas calculable et la proposition est rejet&#233;e.
Puisque la moyenne g&#233;om&#233;trique est moins tol&#233;rante aux petites valeurs que la moyenne
arithm&#233;tique, les inf&#233;rences qui ne sont pas bas&#233;es sur deux relations de poids raisonnables
ne vont probablement pas passer ce type de filtrage.
</p>
<p>P(A
R&#8722;&#8722;&#8594; C) = (P(A is&#8722;a&#8722;&#8722;&#8594; B) * P(B R&#8722;&#8722;&#8594; C))1/2
</p>
<p>&#8658; w3 = (w1 * w2)1/2
3.2 Moteur de r&#233;conciliation
Le raisonneur propose des inf&#233;rences d&#233;duites et ces relations inf&#233;r&#233;es sont pr&#233;sent&#233;es au
validateur pour d&#233;cider si elles sont &quot;plut&#244;t vraies&quot; , &quot;plut&#244;t fausses&quot;, &quot;possibles&quot; ou &quot; vraies
mais pas pertinentes&quot;. Dans le cas d&#8217;invalidation, le r&#233;conciliateur essaie de diagnostiquer les
raisons : erreur (une des relations d&#233;j&#224; existantes sur lesquelles le moteur s&#8217;est bas&#233; pour
inf&#233;rer est fausse), exception (un cas rare), polys&#233;mie (l&#8217;inf&#233;rence est faite en se basant sur
un terme de milieu polys&#233;mique) ou un &quot;cas g&#233;n&#233;ral&quot; qui va &#234;tre rencontr&#233; principalement
lors des premi&#232;res validations. Cela est r&#233;alis&#233; par un dialogue avec l&#8217;utilisateur dont le
but ici est de d&#233;couvrir les raisons de l&#8217;invalidation et essayer de r&#233;concilier le r&#233;seau avec
des informations issues de l&#8217;utilisateur en rapport avec une relation inf&#233;r&#233;e invalid&#233;e. Ce
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>345 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>dialogue doit &#234;tre aussi minimal que possible (le moins possible de questions/le plus possible
d&#8217;informations tir&#233;es). Pour savoir dans quel ordre proc&#233;der, le r&#233;conciliateur d&#233;termine si les
poids des relations (1) et (2) sont relativement forts ou faibles et ce en comparant chaque
poids au seuil de confiance correspondant &#224; son terme (Figure 3). Par exemple, le terme A
</p>
<p>&#233;colier ; B humain ; C visage ; relation 1 : &#233;colier
is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; humain
</p>
<p>La figure 3 est la courbe de poids/distributions pour toutes les relations sortantes ayant
comme terme source A (qui est dans notre cas &#233;colier) avec un pic s&#233;parant en deux parts
&#233;gales la surface sous la courbe. Le seuil de confiance est l&#8217;intersection entre la courbe de
distribution et ce pic (valant ici &#65535; 70).
</p>
<p>FIGURE 3 &#8211; Courbe poids/distribution des relations sortantes du terme A
</p>
<p>&#8211; Si P(A
is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B )&gt;= seuil-confiance(A) &#8658; A is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B est une relation vraisemblable.
</p>
<p>&#8211; Si P(A
is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B ) &lt; seuil-confiance(A) &#8658; A is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B est une relation douteuse.
</p>
<p>3.2.1 Exception&#8594; Polys&#233;mie&#8594; Erreur
Dans le cas o&#249; les deux relations de base (1) et (2) sont des relations vraisemblables, le
r&#233;conciliateur essaie en premier lieu, en entamant un dialogue avec les validateurs/utilisateurs,
de v&#233;rifier si la relation R inf&#233;r&#233;e est une exception. Si ce n&#8217;est pas le cas, il v&#233;rifie si le terme
B (terme central) est polys&#233;mique. Finalement si aucun des deux cas pr&#233;c&#233;dents ne s&#8217;av&#232;re
vrai, il demande si c&#8217;est un cas d&#8217;erreur. Ce cas d&#8217;erreur est v&#233;rifi&#233; en dernier lors de cette
d&#233;marche car les niveaux de confiance des deux relations les rendent plut&#244;t vraisemblables.
Soit l&#8217;exemple suivant : A :autruche ; B :oiseau ; C :voler ; R :carac
</p>
<p>(1) : autruche
is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; oiseau (2) : oiseau carac&#8722;&#8722;&#8722;&#8722;&#8594; voler &#8658; (3) : autruche carac&#8722;&#8722;&#8722;&#8722;&#8594; voler
</p>
<p>Dans cet exemple, il est plut&#244;t vrai que (1) &quot;l&#8217;autruche est un oiseau&quot; et que (2) &quot;un oiseau
peut voler&quot; d&#8217;o&#249; les deux relations ont probablement des niveaux de confiance d&#233;passant le
seuil. Or la relation inf&#233;r&#233;e (3)&quot; l&#8217;autruche peut voler &quot; est fausse et constitue une exception.
</p>
<p>3.2.2 Erreur&#8594; Exception&#8594; Polys&#233;mie
Dans le cas o&#249; l&#8217;une des relations (1) et (2) est douteuse, le r&#233;conciliateur suspecte que
c&#8217;est un cas d&#8217;erreur et que cette relation avec le faible niveau de confiance est l&#8217;origine de
l&#8217;invalidation de la relation inf&#233;r&#233;e. Alors il demande &#224; l&#8217;utilisateur de la confirmer ou de
l&#8217;invalider. Dans le cas de l&#8217;invalidation de l&#8217;une des relations, un cas d&#8217;erreur se pr&#233;sente.
Sinon, on proc&#232;de &#224; la v&#233;rification des deux autres cas : cas d&#8217;exception ou de polys&#233;mie. Soit
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>346 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>l&#8217;exemple suivant : A :enfant ; B :humain ; C :aile ; R :has-part
</p>
<p>(1) : enfant
is&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; humain (2) : humain has&#8722;par t&#8722;&#8722;&#8722;&#8722;&#8594; aile &#8658; (3) : enfant has&#8722;par t&#8722;&#8722;&#8722;&#8722;&#8722;&#8722;&#8594; aile
</p>
<p>Evidemment, la relation enfant
has&#8722;par t&#8722;&#8722;&#8722;&#8722;&#8722;&#8722;&#8594; aile est fausse et la relation
</p>
<p>humain
has&#8722;par t&#8722;&#8722;&#8722;&#8722;&#8722;&#8722;&#8594; aile en est la cause.
</p>
<p>la relation A
R&#8722;&#8722;&#8722;&#8722;&#8594; C
</p>
<p>est elle vraie ?
</p>
<p>Stocker la relation
A
</p>
<p>R&#8722;&#8722;&#8722;&#8722;&#8594; C avec P&gt;0
</p>
<p>Fin
</p>
<p>Le fait que la
</p>
<p>relation A
R&#8722;&#8722;&#8722;&#8722;&#8594; C
</p>
<p>soit fausse est une
exception ?
</p>
<p>Stocker A
R&#8722;&#8722;&#8722;&#8722;&#8594; C
</p>
<p>avec P&lt;0 et annot&#233;e
&quot;exception&quot;
</p>
<p>Pour A
i s&#8722;a&#8722;&#8722;&#8722;&#8722;&#8722;&#8722;&#8594; B and
</p>
<p>B
R&#8722;&#8722;&#8722;&#8722;&#8594; C choisissez
le &quot;B&quot; le plus
</p>
<p>appropri&#233; selon vous
pour disambigu&#239;ser ou
entrez un nouveau en
</p>
<p>cas de besoin.
</p>
<p>V&#233;rifier si dans le
r&#233;seau B
</p>
<p>prop&#8722;&#8722;&#8722;&#8594;
Polysemous
</p>
<p>Le terme B est-il
polys&#233;mique?
</p>
<p>La relation A
i s&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B
</p>
<p>est-elle vraie?
</p>
<p>Etablir les nouvelles
relations renseign&#233;es
</p>
<p>A
i s&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; Bi , B j i s&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594;
</p>
<p>C et les stocker dans le
r&#233;seau.
</p>
<p>P(A
i s&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B) =
</p>
<p>-P(A
i s&#8722;a&#8722;&#8722;&#8722;&#8722;&#8594; B) et la
</p>
<p>relation est
stock&#233;e.
</p>
<p>La relation B
R&#8722;&#8722;&#8722;&#8722;&#8594; C
</p>
<p>est-elle vraie ?
</p>
<p>P(B
R&#8722;&#8722;&#8722;&#8722;&#8594; C)= -P(B R&#8722;&#8722;&#8722;&#8722;&#8594; C)
</p>
<p>et la relation est stock&#233;e.
</p>
<p>La relationA
R&#8722;&#8722;&#8722;&#8722;&#8594; C
</p>
<p>est-elle une
r&#232;gle g&#233;n&#233;rale
</p>
<p>?
</p>
<p>A
R&#8722;&#8722;&#8722;&#8722;&#8594; C est stock&#233;e
</p>
<p>avec P&lt;0 et annot&#233;e
&quot;r&#232;gle g&#233;n&#233;rale&quot;
</p>
<p>Avez vous une
remarque ou
un indice?
</p>
<p>V/P/NVP
</p>
<p>Ne Sait Pas
</p>
<p>F
</p>
<p>V/P/NVP
</p>
<p>V/P/NVP
</p>
<p>F
</p>
<p>V
F
</p>
<p>Non
</p>
<p>Non
</p>
<p>F
</p>
<p>F
</p>
<p>Oui
</p>
<p>Oui
</p>
<p>V/P
</p>
<p>FIGURE 4 &#8211; Sch&#233;ma de la proc&#233;dure de validation/r&#233;conciliation. L&#233;gende : plut&#244;t Vrai,
Possible, Vrai Non Pertinent, plut&#244;t Faux.
</p>
<p>Cas d&#8217;erreur dans les pr&#233;misses
Supposons que la relation (1) (figure 1) a un faible poids. Alors le r&#233;conciliateur demande au
validateur si la relation (1) est vraie. Si la r&#233;ponse est n&#233;gative, l&#8217;oppos&#233; du poids actuel
de la relation (1) lui est attribu&#233; (soit P = -1*(P)) et la r&#233;conciliation se termine. Si la
r&#233;ponse est positive, le r&#233;conciliateur demande si la relation (2) est vraie et il proc&#232;de comme
pr&#233;c&#233;demment en cas de r&#233;ponse n&#233;gative. Sinon enfin, il v&#233;rifie les autres cas (exception,
polys&#233;mie). (Figure 4) Cas d&#8217;exception
Dans le cas de deux relations vraisemblables, le r&#233;conciliateur demande au validateur si la
relation inf&#233;r&#233;e A
</p>
<p>R&#8722;&#8722;&#8594; C constituerait une exception. Si c&#8217;est le cas, la relation est stock&#233;e
dans le r&#233;seau avec un poids n&#233;gatif mais annot&#233;e avec une m&#233;ta-information qui indique
que c&#8217;est une exception. (Figure 4)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>347 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cas de polys&#233;mie
Dans ce cas, le terme B est soit marqu&#233; dans le r&#233;seau comme polys&#233;mique ou indiqu&#233; comme
tel par le validateur. Il s&#8217;agit alors de lister dans le dialogue les raffinements B1, B2, ...,Bn en
les ordonnant selon une fonction de similarit&#233; et ainsi de permettre au validateur de choisir le
</p>
<p>plus appropri&#233; selon lui pour les deux relations A
is&#8722;a&#8722;&#8722;&#8594; Bi et Bj R&#8722;&#8722;&#8594; C. Il est possible &#224; l&#8217;uti-
</p>
<p>lisateur de pr&#233;ciser un nouveau raffinement en cas d&#8217;insatisfaction vis-&#224;-vis de ceux pr&#233;sent&#233;s.
</p>
<p>Apr&#232;s cette proc&#233;dure, le r&#233;seau sera r&#233;concili&#233; par deux nouvelles relations A
is&#8722;a&#8722;&#8722;&#8594; Bi et
</p>
<p>Bj
R&#8722;&#8722;&#8594; C qui pourront &#234;tre utilis&#233;es ult&#233;rieurement par le moteur d&#8217;inf&#233;rences. (Figure 4)
</p>
<p>4 Exp&#233;rimentation
Nous avons men&#233; une exp&#233;rience consistant &#224; produire en masse et en une seule fois le
nombre maximum d&#8217;inf&#233;rences possible par application du moteur sur le r&#233;seau lexical JDM.
L&#8217;objectif est d&#8217;&#233;valuer les productions du moteur ainsi que les m&#233;canismes de blocage logique
et de filtrage. A partir de cet ensemble d&#8217;inf&#233;rences propos&#233;es, nous en avons s&#233;lectionn&#233;
al&#233;atoirement 400 pour chacun des types de relations et nous les avons soumises au processus
de validition/r&#233;conciliation. Cette exp&#233;rience a &#233;t&#233; men&#233;e dans un but d&#8217;&#233;valuation car en pra-
tique le moteur d&#8217;&#233;licitation fonctionne conjointement avec les jeux et l&#8217;approche contributive
de fa&#231;on incr&#233;mentale. Dans cette exp&#233;rience, une proposition a &#233;t&#233; valid&#233;e soit manuellement
par un contributeur de confiance (un validateur), soit par des joueurs/contributeurs si au
moins 4 votes ont &#233;t&#233; effectu&#233;s avec au minimum 75% de concordance. Les m&#234;mes seuils ont
&#233;t&#233; appliqu&#233;s pour la r&#233;conciliation.
4.1 Productions du moteur d&#8217;inf&#233;rences
Nous avons appliqu&#233; le moteur d&#8217;inf&#233;rences sur environ 23000 termes al&#233;atoirement choisis
parmi ceux ayant au minimum un hyperonyme. Environ 1500000 inf&#233;rences ont &#233;t&#233; produites
et 77000 autres ont &#233;t&#233; bloqu&#233;es. Le seuil de filtrage a &#233;t&#233; fix&#233; &#224; un poids de 25 (seules les
inf&#233;rences avec un poids &#233;gal ou sup&#233;rieur &#224; 25 ont &#233;t&#233; prises en consid&#233;ration). Dans la
figure 5 la distribution a tendance &#224; suivre une loi de puissance, ce qui n&#8217;est pas surprenant
car la distribution dans le r&#233;seau lexical des relations est elle-m&#234;me gouvern&#233;e par une loi de
puissance.
</p>
<p>!&quot;#
</p>
<p>#
</p>
<p>#!
</p>
<p>#!!
</p>
<p>#!!!
</p>
<p>#!!!!
</p>
<p>#!!!!!
</p>
<p>#!!!!!!
</p>
<p>! #!! $!! %!! &amp;!! '!! (!! )!! *!!
</p>
<p>+
,-
</p>
<p>./
012
</p>
<p>312
44
</p>
<p>,0
/5
</p>
<p>4/
6
</p>
<p>753/0/54/18/9:;&lt;
</p>
<p>5.
</p>
<p>=,966&gt;54/1?5.@
</p>
<p>FIGURE 5 &#8211; Distribution des inf&#233;rences propos&#233;es selon leur poids. La distribution semble une
loi de puissance contravariante au poids. En pratique, les relations candidates de tr&#232;s fort
</p>
<p>poids sont valid&#233;es les premi&#232;res.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>348 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les tables 1 et 2 pr&#233;sentent le nombre de relations propos&#233;es par le moteur d&#8217;inf&#233;rences.
Les diff&#233;rents types de relations pour la seconde pr&#233;misse (la relation g&#233;n&#233;rique R dans le
sch&#233;ma d&#8217;inf&#233;rence triangulaire) sont productifs &#224; des degr&#233;s divers. Bien entendu, cette
variation est en partie due au nombre de relations d&#233;j&#224; existantes pour chaque type dans le
r&#233;seau.
La productivit&#233; d&#8217;un type de relation est le ratio entre le nombre d&#8217;inf&#233;rences propos&#233;es et le
nombre d&#8217;occurences de ce type de relations dans le r&#233;seau.
</p>
<p>Type de relation nb propos&#233;s nb existants productivit&#233;
est-un 91 037 91 799 99,16%
parties 372 688 21 886 1702,86%
holonyme 108 191 13 124 824,37%
lieu 271 717 26 346 1031,34%
carac 203 095 24 180 839,92%
agent-1 198 359 6 820 2908,48%
instr-1 24 957 4 797 520,26%
patient-1 14 658 3 930 372,97%
lieu-1 145 159 8 835 1642,99%
lieu-action 50 035 4 559 1097,49%
mati&#232;re 4 313 3 097 139,26%
</p>
<p>TABLE 1 &#8211; Productivit&#233; des types de relations selon le moteur d&#8217;inf&#233;rences.
</p>
<p>L&#8217;inf&#233;rence transitive pour is-a est la moins productive ce qui peut sembler surprenant en
premi&#232;re analyse. En fait, la relation is-a est d&#8217;ors et d&#233;j&#224; fortement renseign&#233;e dans le r&#233;seau
lexical JDM, et ce faisant, relativement peu de nouvelles inf&#233;rences peuvent &#234;tre propos&#233;es.
Les donn&#233;es sont quelques peu invers&#233;es pour les autres types de relation qui ne sont pas
suffisamment repr&#233;sent&#233;s mais qui sont pourtant potentiellement valides.
</p>
<p>Le r&#244;le s&#233;mantique d&#8217;agent (la relation agent-1) est de loin le type le plus productif,
avec 30 fois plus de propositions que ce qui existe actuellement dans le r&#233;seau JDM.
</p>
<p>La productivit&#233; d&#8217;une relation est covariante avec deux facteurs : (1) la taille de la
population pour ce type de relation dans le r&#233;seau et, (2) le nombre d&#8217;hyponymes dont
disposent les termes renseign&#233;s pour cette relation.
</p>
<p>En termes de filtrages, nous constatons une grande disparit&#233; entre les types de rela-
tions, qui provient essentiellement de la force de transitivit&#233; du type de relation, et pour les
termes concern&#233;s du taux de polys&#233;mie et du poids des relations.
</p>
<p>Par exemple, is-a est fortement transitive et se retrouve peu bloqu&#233;e par rapport &#224;
parties ou holo. Les r&#244;les s&#233;mantiques (agent-1, instr-1, etc.), peu productifs par ailleurs car
toutes proportions gard&#233;es peu renseign&#233;es, semblent peu sensibles aux deux filtrages.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>349 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Type de relation nb propos&#233;es % nb bloqu&#233;es % nb filtr&#233;es %
est-un (is-a/hperonyme
de x)
</p>
<p>91 037 6,13 4 034 5,23 53 586 26,32
</p>
<p>parties (constitutives de
x)
</p>
<p>372 688 25,11 31 421 40,76 100 297 49,26
</p>
<p>holo (tout de x) 108 191 7,28 17 944 23,27 26 818 13,17
lieu (typique pour x) 271 717 18,30 11 502 14,92 14 174 6,96
carac(t&#233;ristiques de x) 203 095 13,68 2 647 3,43 6 576 3,23
agent-1 (que peut faire
x ?)
</p>
<p>198 359 13,36 9052 11,74 1122 0,55
</p>
<p>instr-1 (que peut-on
faire avec x ?)
</p>
<p>24 957 1,68 127 0,16 391 0,19
</p>
<p>patient-1 (que peut-on
faire &#224; x ?)
</p>
<p>14 658 0,98 7 0,01 13 0,00
</p>
<p>lieu-1 (que peut-on trou-
ver sur/dans x ?)
</p>
<p>145 159 9,78 129 0,17 206 0,10
</p>
<p>lieu-action (que peut-on
faire sur/dans x ?)
</p>
<p>50 035 3,379 91 0,12 132 0,06
</p>
<p>mati&#232;re (de quelle ma-
ti&#232;re/substance est fait
x ?)
</p>
<p>4 313 0,29 135 0,17 262 0,12
</p>
<p>Total 1 484 209 100 77 089 100 203 577 100
</p>
<p>TABLE 2 &#8211; Statut des inf&#233;rences propos&#233;es par type de relation. Bloqu&#233; fait r&#233;f&#233;rence au filtrage
logique et filtr&#233; au filtrage statistique.
</p>
<p>4.2 Quelques donn&#233;es sur la r&#233;conciliation
Le dialogue avec les joueurs permet de d&#233;terminer le type d&#8217;erreur (dans les pr&#233;misses,
exceptions ou &#224; cause de la polys&#233;mie). La table 3 pr&#233;sente une &#233;valuation du statut des
inf&#233;rences propos&#233;es par le moteur d&#8217;inf&#233;rences. Les inf&#233;rences sont valides pour environ
80-90% d&#8217;entres elles avec aux alentours de 10% d&#8217;inf&#233;rences valides mais non pertinentes
</p>
<p>(comme par exemple, chien
has&#8722;par ts&#8722;&#8722;&#8594; proton). Nous observons que les erreurs dans les pr&#233;misses
</p>
<p>sont relativement peu nombreuses, et quoiqu&#8217;il en soit ces erreurs peuvent &#234;tre ais&#233;ment
corrig&#233;es. Bien s&#251;r, tous les types d&#8217;erreur ne sont pas d&#233;tectables par ce processus. De fa&#231;on
plus int&#233;ressante, la r&#233;conciliation permet dans 5% des cas d&#8217;identifier les termes polys&#233;miques
et de s&#233;lectionner ou proposer des raffinements. Globalement, les inf&#233;rences fausses n&#233;gatives
(celles vot&#233;es fausses mais valides) et les inf&#233;rences fausses positives (celles vot&#233;es vraies mais
invalides) sont &#233;valu&#233;es &#224; moins de 0,5% du total. Mener le dialogue &#224; son terme n&#8217;&#233;tant pas
une obligation, les utilisateurs ne sont pas encluns &#224; donner des r&#233;ponses au hasard en cas de
difficult&#233;. Nous avons &#233;galement men&#233; une exp&#233;rience in vivo et donc moins artificielle o&#249; les
inf&#233;rences sont produites &#224; la vol&#233;e sur les termes jou&#233;s ou contribu&#233;s par les joueurs, afin de
leur pr&#233;senter des relations pour lesquelles ils peuvent se prononcer. L&#8217;exp&#233;rience a d&#233;marr&#233;
en d&#233;cembre 2012 et se poursuit encore au moment de l&#8217;&#233;criture de cet article (soit une dur&#233;e
de 2 mois). Environ 10000 propositions ont &#233;t&#233; valid&#233;es et 250 invalid&#233;es et r&#233;concil&#233;es par
les contributeurs. Les propositions ayant fait l&#8217;objet de votes contradictoires de la part des
contributeurs ne portent que sur 8 termes (la d&#233;cision finale &#224; leur rejet a &#233;t&#233; donn&#233;e par
l&#8217;expert). Le nombre de votes total correspondant aux relations inf&#233;r&#233;es a &#233;t&#233; sup&#233;rieur &#224;
32000. Ces donn&#233;es semblent confirmer la viabilit&#233; de la d&#233;marche consistant &#224; solliciter les
contributeurs pour valider ou r&#233;conciler les propositions faites automatiquemment.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>350 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>% valides % d&#8217;erreur
Types de relation pertinent non pertinent pr&#233;misses exception polys&#233;mie
est-un 76% 13% 2% 0% 9%
parties 65% 8% 4% 13% 10%
holonyme 57% 16% 2% 20% 5%
lieu 78% 12% 1% 4% 5%
carac 82% 4% 2% 8% 4%
agent-1 81% 11% 1% 4% 3%
instr-1 62% 21% 1% 10% 6%
patient-1 47% 32% 3% 7% 11%
lieu-1 72% 12% 2% 10% 6%
lieu-action 67% 25% 1% 4% 3%
mati&#232;re 60% 3% 7% 18% 12%
TABLE 3 &#8211; R&#233;sultats de la validation/r&#233;conciliation selon le type de relation inf&#233;r&#233;e.
</p>
<p>5 Conclusion
Dans cet article, nous avons pr&#233;sent&#233; quelques enjeux concernant la construction des r&#233;seaux
lexico-s&#233;mantiques &#224; l&#8217;aide de jeux et de contributions. Un tel r&#233;seau est fortement lexica-
lis&#233; et les usages des termes sont d&#233;couverts incr&#233;mentalement au fur et &#224; mesure de sa
construction. Des erreurs sont &#233;videmment pr&#233;sentes dans ce type de ressources puisqu&#8217;elles
peuvent provenir des parties jou&#233;es sur des relations difficiles, mais elles sont g&#233;n&#233;ralement
d&#233;couvertes par les contributeurs, seulement cependant pour les termes qui les int&#233;ressent.
Pour &#234;tre capable d&#8217;augmenter la qualit&#233; et la couverture du r&#233;seau lexical, nous avons
propos&#233; un syst&#232;me d&#8217;&#233;licitation bas&#233; sur des inf&#233;rences de relations et des r&#233;conciliations en
cas d&#8217;invalidation. Les inf&#233;rences ici sont construites sur la base d&#8217;une triangulation simple
bas&#233;e sur la transitivit&#233; de l&#8217;hyperonymie associ&#233;e &#224; des m&#233;canismes de blocage logique et
de filtrage statistique. La r&#233;conciliation est appliqu&#233;e dans le cas o&#249; la relation inf&#233;r&#233;e est
prouv&#233;e fausse et ce dans le but d&#8217;en identifier la cause. Globalement, nous pouvons conclure
que les relations inf&#233;r&#233;es sont correctes et pertinentes dans 78% des cas et correctes mais non
pertinentes dans 10% des cas. En g&#233;n&#233;ral, les inf&#233;rences fausses suite &#224; une faute dans les
pr&#233;misses repr&#233;sentent 2% des cas, les exceptions autour de 5% des cas et les confusions &#224;
cause d&#8217;une polys&#233;mie environ 5%. La philosophie de notre approche est de ne jamais valider
automatiquement des propositions m&#234;me si bon nombre d&#8217;entre-elles semblent certaines,
car les exceptions ne sont pas pr&#233;dictibles. Toutefois, la validation en corpus pour une inclu-
sion dans le r&#233;seau lexical semble une approche possible &#224; l&#8217;automatisation. De m&#234;me, la
validation temporaire d&#8217;inf&#233;rences &#224; niveau de confiance &#233;lev&#233; serait tout &#224; fait pertinente
lors d&#8217;une analyse automatique de textes afin d&#8217;aider &#224; la mener &#224; terme. En plus d&#8217;&#234;tre un
outil d&#8217;augmentation du nombre de relations dans un r&#233;seau lexical, le syst&#232;me d&#8217;&#233;licitation
est un d&#233;tecteur efficace d&#8217;erreurs et de polys&#233;mie. Les mesures prises durant la phase de
r&#233;conciliation emp&#234;chent une inf&#233;rence fausse d&#8217;&#234;tre r&#233;inf&#233;r&#233;e en boucle. Une telle approche
doit &#234;tre d&#233;velopp&#233;e plus avant avec d&#8217;autres types de sch&#233;mas d&#8217;inf&#233;rences et possiblement
avec une &#233;valuation de la distribution des classes s&#233;mantiques des termes sur lesquels les
inf&#233;rences sont &#233;labor&#233;es. En effet, certaines classes comme les objets concrets ou les &#234;tres
anim&#233;s peuvent &#234;tre consid&#233;rablement plus productives sur certains types de relations que,
par exemple, les noms d&#8217;objets abstraits ou les termes d&#8217;&#233;v&#233;nements/processus. Quoi qu&#8217;il
en soit de telles variations dans la productivit&#233; d&#8217;inf&#233;rences m&#233;ritent certainement d&#8217;&#234;tre
explor&#233;es.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>351 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
BLANCO, E. et MOLDOVAN, D. (2011). A model for composing semantic relations. Ninth International
Conference on Computational Semantics (IWCS&#8217;11), Oxford, United Kingdom, pages 45&#8211;54.
CHAMBERLAIN, J., POESIO, M. et KRUSCHWITZ, U. (2008). Phrase detectives : A web-based collaborative
annotation game. In Proceedings of the International Conference on Semantic Systems (I-Semantics&#8217;08).
DONG, Z. et DONG, Q. (2006). HowNet and the Computation of Meaning. WorldScientific, London.
FELLBAUM, C. et MILLER, G. (1998). (eds) WordNet. The MIT Press.
FENG, D., BESANA, S. et ZAJAC, R. (2009). Acquiring high quality non-expert knowledge from on-
demand workforce. In Proceedings of the 2009 Workshop on The People&#8217;s Web Meets NLP : Collaboratively
Constructed Semantic Resources, People&#8217;s Web &#8217;09, Morristown, NJ, USA. Association for Computational
Linguistics., pages 51&#8211;56.
HARABAGIU, S. et MOLDOVAN, D. (1998). Knowledge processing on an extended wordnet. WordNet :
An Electronic Lexical Database, MIT Press., pages 381&#8211;405.
JOUBERT, A. et LAFOURCADE, M. (2008). Jeuxdemots : un prototype ludique pour l&#8217;&#233;mergence de
relations entre termes. In proc of JADT&#8217;2008, Ecole normale sup&#233;rieure Lettres et sciences humaines ,
Lyon, France, 12-14 mars 2008, page 8 p.
LAFOURCADE, M. (2007). Making people play for lexical acquisition. In Proc. SNLP 2007, 7th Symposium
on Natural Language Processing. Pattaya, Thailande, 13-15 December 2007, page 8 p.
LAFOURCADE, M. et JOUBERT, A. (2012). Increasing long tail in weighted lexical networks. In proc of
Cognitive Aspects of the Lexicon (CogAlex-III), COLING, Mumbai, India, December 2012, page 16 p.
LAFOURCADE, M., JOUBERT, A., SCHWAB, D. et ZOCK, M. (2011). Evaluation et consolidation d&#8217;un
r&#233;seau lexical gr&#226;ce &#224; un assistant ludique pour le mot sur le bout de la langue. In proc of TALN&#8217;11,
Montpellier, France, 27 juin-1er juillet 2011, pages 295&#8211;306.
LENAT, D. (1995). Cyc : A large-scale investment in knowledge infrastructure. Communications of the
ACM, 38(11):33&#8211;38.
LIEBERMAN, H., SMITH, D. A. et TEETERS, A. (2007). Common consensus : a web-based game for
collecting commonsense goals. In Proc. of IUI, Hawaii., page 12 p.
MARCHETTI, A., TESCONI, M., RONZANO, F., MOSELLA, M. et MINUTOLI, S. (2007). Semkey : A semantic
collaborative tagging system. in Procs of WWW2007, Banff, Canada, page 9 p.
MIHALCEA, R. et CHKLOVSKI, T. (2003). Open mindword expert : Creating large annotated data
collections with web users help. In Proceedings of the EACL 2003, Workshop on Linguistically Annotated
Corpora (LINC 2003), page 10 p.
MILLER, G., BECKWITH, R., FELLBAUM, C., GROSS, D. et MILLER, K. (1990). Introduction to wordnet :
an on-line lexical database. International Journal of Lexicography, 3(4):235&#8211;244.
NAVIGLI, R. et PONZETTO, S. (2012). Babelnet : Building a very large multilingual semantic network.
In Proceedings of the 48th Annual Meeting of the Association for Computational Linguistics, Uppsala,
Sweden, 11-16 July 2010, pages 216&#8211;225.
SAGOT, B. et FIER, D. (2008). Construction d&#8217;un wordnet libre du fran&#231;ais &#224; partir de ressources
multilingues. TALN 2008, Avignon, France, 2008., page 12.
SIORPAES, K. et HEPP, M. (2008). Games with a purpose for the semantic web. In IEEE Intelligent
Systems, 23(3):50&#8211;60.
THALER, S., SIORPAES, K., SIMPERL, E. et HOFER, C. (2011). A survey on games for knowledge
acquisition. STI Technical Report., page 19.
von AHN, L. et DABBISH, L. (2008). Designing games with a purpose. Communications of the ACM,
51(8):58&#8211;67.
VOSSEN, P. (1998). Eurowordnet : a multilingual database with lexical semantic networks. Kluwer
Academic Publishers, Norwell, MA, USA, page 200.
ZESCH, T. et GUREVYCH, I. (2009). Wisdom of crowds versus wisdom of linguists measuring the
semantic relatedness of words. Natural Language Engineering, Cambridge University Press., pages
25&#8211;59.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>352 c&#65535; ATALA</p>

</div></div>
</body></html>