<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers un treebank du fran&#231;ais parl&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers un treebank du fran&#231;ais parl&#233;
</p>
<p>Anne Abeill&#233;1, 2 Benoit Crabb&#233;1, 3
(1) LLF, CNRS-Universit&#233; Paris Diderot, 75013 Paris, PRES Sorbonne Paris Cit&#233;, IUF
(2) Alpage, INRIA, Universit&#233; Paris Diderot, 75013 Paris, PRES Sorbonne Paris Cit&#233;
abeille@univ-paris-diderot.fr, bcrabbe@univ-paris-diderot.fr
</p>
<p>R&#201;SUM&#201;
Nous pr&#233;sentons les premiers r&#233;sultats d&#8217;un corpus arbor&#233; pour le fran&#231;ais parl&#233;. Il a &#233;t&#233; r&#233;alis&#233;
dans le cadre du projet ANR Etape (resp. G. Gravier) en 2011 et 2012. Contrairement &#224; d&#8217;autres
langues comme l&#8217;anglais (voir le Switchboard treebank de (Meteer, 1995)), il n&#8217;existe pas de
grand corpus oral du francais annot&#233; et valid&#233; pour les constituants et les fonctions syntaxiques.
Nous souhaitons construire une ressource comparable, qui serait une extension naturelle du
Corpus arbor&#233; de Paris 7 (FTB : (Abeill&#233; et al., 2003))) bas&#233; sur des textes du journal Le Monde.
Nous serons ainsi en mesure de comparer, avec des annotations comparables, l&#8217;&#233;crit et l&#8217;oral. Les
premiers r&#233;sultats, qui consistent &#224; r&#233;utiliser l&#8217;analyseur de (Petrov et al., 2006) entra&#238;n&#233; sur
l&#8217;&#233;crit, avec une phase de correction manuelle, sont encourageants.
</p>
<p>ABSTRACT
Towards a treebank of spoken French
</p>
<p>We present the first results of an attempt to build a spoken treebank for French. It has been
conducted as part of the ANR project Etape (resp. G. Gravier). Contrary to other languages such
as English (see the Switchboard treebank (Meteer, 1995)), there is no sizable spoken corpus for
French annotated for syntactic constituents and grammatical functions. Our project is to build
such a resource which will be a natural extension of the Paris 7 treebank (FTB : (Abeill&#233; et al.,
2003))) for written French, in order to be able to compare with similar annotations written and
spoken French. We have reused and adapted the parser (Petrov et al., 2006) which has been
trained on the written treebank, with manual correction and validation. The first results are
promising.
</p>
<p>MOTS-CL&#201;S : Corpus arbor&#233;, fran&#231;ais parl&#233;, corpus oral, analyse syntaxique automatique.
KEYWORDS: Treebank, spoken French, spoken corpus, parsing.
</p>
<p>1 Introduction
</p>
<p>Nous pr&#233;sentons les premiers r&#233;sultats d&#8217;un corpus arbor&#233; pour le fran&#231;ais parl&#233;. Il a &#233;t&#233; r&#233;alis&#233;
dans le cadre du projet ANR Etape (resp. G. Gravier) entre 2010 et 2012. Les corpus arbor&#233;s
(Treebank) pour les autres langues ont une partie &#233;crite et une partie orale : Penn Treebank
(Switchboard (Meteer, 1995)), Verbmobil pour l&#8217;allemand, Prague Dependency Treebank pour le
tch&#232;que (Mikulova, 2008). A notre connaissance, il n&#8217;existe pas de grand corpus oral du fran&#231;ais
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>174 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>annot&#233; et valid&#233; pour les constituants et les fonctions syntaxiques. Les corpus oraux annot&#233;s
existants pour le fran&#231;ais suivent des sch&#233;mas sp&#233;cifiques : annotation en micro et macro syntaxe
pour le corpus Rhapsodie (cite Deulofeu 2011), annotation en d&#233;pendances de (Cerisara et al.,
2010), annotation en chunks du corpus Otim (Blache et al., 2010) Nous souhaitons construire
une ressource qui soit une extension naturelle du Corpus arbor&#233; de Paris 7 (FTB (Abeill&#233; et al.,
2003)) bas&#233; sur des textes du journal Le Monde. Nous serons ainsi en mesure de comparer, avec
des annotations comparables, l&#8217;&#233;crit et l&#8217;oral. Nous proc&#233;dons en trois temps : une phase de
pr&#233;traitement avec ponctuation et balisage des dysfluences, une phase d&#8217;analyse automatique,
une phase de correction manuelle. Pour la seconde phase, nous avons adapt&#233; le parseur de
(Petrov et al., 2006) entra&#238;n&#233; sur le FTB ; pour la troisi&#232;me phase, nous avons adapt&#233; et enrichi
les consignes du Corpus arbor&#233; de Paris 7 (Abeille et al., 2013).
</p>
<p>2 De l&#8217;&#233;crit &#224; l&#8217;oral
</p>
<p>Contrairement &#224; d&#8217;autres langues comme l&#8217;anglais (Switchboard (Meteer, 1995)) il n&#8217;existe pas de
grand corpus oral du fran&#231;ais annot&#233; et valid&#233; pour les constituants et les fonctions syntaxiques.
Nous souhaitons construire une ressource comparable, qui serait une extension naturelle du
Corpus arbor&#233; de Paris 7 (FTB (Abeill&#233; et al., 2003)) bas&#233; sur des textes du journal Le Monde. Une
extension &#224; l&#8217;oral devrait permettre &#224; terme de mener des &#233;tudes comparatives sur des donn&#233;es
comparables de la syntaxe du fran&#231;ais &#233;crit et du fran&#231;ais oral.
</p>
<p>Le corpus &#233;crit est annot&#233; lexicalement (lemme, cat&#233;gories et sous-cat&#233;gories lexicales, morpho-
logie flexionnelle, mots compos&#233;s), en constituants et en fonctions et a &#233;t&#233; valid&#233; manuellement.
Il est distribu&#233; depuis 2001 et est accompagn&#233; d&#8217;un guide d&#8217;annotation (135pp). Le jeu d&#8217;&#233;ti-
quettes morphologiques est relativement riche (218 cat&#233;gories) alors qu&#8217;on compte 12 &#233;tiquettes
de syntagmes et 8 &#233;tiquettes de fonctions. Les choix g&#233;n&#233;raux d&#8217;annotation reposent sur un
sch&#233;ma surfaciste d&#8217;annotation de constituants majeurs qui se veut compatible avec plusieurs
th&#233;ories syntaxiques. Contrairement au Penn Treebank (Marcus et al., 1993) le corpus fran&#231;ais
ne comporte pas de cat&#233;gories vides ni de constituants discontinus.
</p>
<p>Contrairement &#224; d&#8217;autres initiatives d&#8217;annotation pour le fran&#231;ais (Deulofeu et al., 2010), et
suivant en cela les initiatives pour d&#8217;autres langues (Meteer, 1995; Mikulova, 2008) la repr&#233;sen-
tation de donn&#233;es orales propos&#233;e ici repose sur l&#8217;hypoth&#232;se que la syntaxe de la phrase orale
ne n&#233;cessite pas un r&#233;am&#233;nagement en profondeur du sch&#233;ma d&#8217;annotation de l&#8217;&#233;crit, m&#234;me si
des am&#233;nagements l&#233;gers sont n&#233;cessaires. Ce choix a pour cons&#233;quence de rendre disponible
l&#8217;outillage d&#233;j&#224; existant (analyseurs, outils d&#8217;&#233;dition de treebank) pour faciliter et acc&#233;l&#233;rer le
travail d&#8217;annotation.
</p>
<p>Plusieurs versions du French Treebank sont actuellement utilis&#233;es (Schluter et van Genabith,
2007; Blache et Rauzy, 2012). Nous nous appuyons sur la repr&#233;sentation simplifi&#233;e d&#233;crite
notamment par (Crabb&#233; et Candito, 2008) qui permet l&#8217;analyse automatique avec les algorithmes
d&#8217;analyse en constituants &#224; l&#8217;&#233;tat de l&#8217;art. En particulier nous nous appuyons sur un jeu de cat&#233;go-
ries lexicales r&#233;duit (28 cat&#233;gories) et une liste de mots compos&#233;s r&#233;duite aux mots compos&#233;s
grammaticaux. Cette version r&#233;duite a l&#8217;avantage de se convertir de mani&#232;re d&#233;terministe vers
une repr&#233;sentation en d&#233;pendances syntaxiques projectives (Candito et al., 2009) qui est de
plus en plus utilis&#233;e. Annoter en constituants permet donc de b&#233;n&#233;ficier des deux types de
repr&#233;sentations.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>175 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Les donn&#233;es orales
</p>
<p>Les donn&#233;es orales que nous utilisons sont des donn&#233;es du corpus ESTER 3 issues du projet ETAPE
(Gravier et al., 2012) d&#233;di&#233; &#224; l&#8217;&#233;valuation de syst&#232;mes de reconnaissance automatique de la
parole. Les donn&#233;es sont constitu&#233;es d&#8217;extraits de d&#233;bats de t&#233;l&#233;vision et de radio fran&#231;aises.
</p>
<p>Les donn&#233;es annot&#233;es ici constituent un sous-ensemble de ce corpus constitu&#233; des &#233;missions
radiophoniques de France Inter de l&#8217;ann&#233;e 2010 : cinq &#233;missions de un temps de pauchon et une
&#233;mission du Masque et la plume, ce qui repr&#233;sente pr&#232;s d&#8217;une heure trente de temps de parole.
Dans le premier cas il s&#8217;agit d&#8217;interviews non pr&#233;par&#233;es donnant la parole &#224; des inconnus. Dans
le second, il s&#8217;agit d&#8217;un d&#233;bat public tr&#232;s anim&#233; avec au moins dix journalistes sur le plateau,
plus des commentaires de spectateurs. Nous avons &#233;galement un extrait du corpus fran&#231;ais
de CORAL-ROM (Cresti et al., 2004). L&#8217;extrait annot&#233; est L&#8217;allumage (Poitiers 2001). CORAL-ROM
pr&#233;sente un type de conversation informel et spontan&#233; entre deux amies : qui repr&#233;sente 14
minutes de parole. Les donn&#233;es de r&#233;f&#233;rence ESTER 3 sont transcrites orthographiquement,
ponctu&#233;es et enrichies avec un balisage des diffluences, selon le format transcriber (Barras
et al., 1998). De mani&#232;re &#224; uniformiser nos donn&#233;es de travail, nous avons &#233;galement refor-
mat&#233; les donn&#233;es CORAL-ROM dans ce m&#234;me format. Au vu de l&#8217; extrait donn&#233; en Figure 1, on
constate que les donn&#233;es de d&#233;part sont d&#233;j&#224; structur&#233;es, en particulier on observe que l&#8217;on a un
balisage pour la musique &lt;Event desc=&quot;musique&quot; type=&quot;noise&quot; extent=&quot;begin&quot;/&gt;
et les bruits parasites, un balisage pour les disfluences comme pour les marqueurs de dis-
cours &lt;Event desc=&quot;dm&quot; type=&quot;lexical&quot; ... /&gt; mais aussi les r&#233;p&#233;titions, les r&#233;visions
&lt;Event desc=&quot;rev&quot; type=&quot;lexical&quot; ... &gt; et les h&#233;sitations ainsi qu&#8217;une segmentation
en tours de parole. On distingue trois types de caract&#233;ristiques des donn&#233;es orales qui touchent &#224;
la segmentation, la pr&#233;sence de chevauchements et &#224; la pr&#233;sence de disfluences.
</p>
<p>Segmentation Nous partons ici d&#8217;une transcription enrichie, c&#8217;est-&#224;-dire avec des ponctuations
fortes, mais avec peu de ponctuations faibles, et pas de mots compos&#233;s. On voit sur l&#8217;exemple
qu&#8217;un tour de parole ESTER peut comporter plusieurs phrases ou aucune. On a &#233;galement observ&#233;
que certaines phrases recouvrent plusieurs tours de parole. On note finalement que la ponctuation
renseign&#233;e dans les transcriptions de d&#233;part n&#8217;a pas un statut clair : les annotateurs la renseignent
plut&#244;t pour indiquer des pauses dans le flux de parole que comme marque syntaxique. C&#8217;est
pourquoi nous avons revu la segmentation manuellement avant l&#8217;analyse automatique.
</p>
<p>Les chevauchements On trouve en particulier dans les transcriptions du Masque et la plume
un nombre non n&#233;gligeable de chevauchements. Ceux-ci sont annot&#233;s dans le format ESTER en
suivant un sch&#233;ma comme illustr&#233; en Figure 1 : o&#249; la balise XML &lt;Overlap&gt; encode la port&#233;e
d&#8217;un chevauchement. L&#8217;attribut type indique le locuteur qui domine l&#8217;&#233;change par la valeur
primary et celui que l&#8217;on entend moins est renseign&#233; par la valeur backchannel.
</p>
<p>Les disfluences Outre les questions de segmentation et de chevauchements, les disfluences sont
typiques de l&#8217;oral. La transcription ESTER les renseigne sous forme de balises XML, on recense
ainsi quatre types de disfluences :
&#8211; H&#233;sitations : euh
&#8211; R&#233;p&#233;titions qui concernent la r&#233;p&#233;tition &#224; l&#8217;identique : qui a retard&#233; un peu &lt;nos&gt; nos commen-
</p>
<p>taires, qui avait &#233;t&#233; s&#233;rieusement amoch&#233; &lt;au&gt; au masque et la Plume, a &#233;t&#233; bluff&#233; par le jeu
&lt;de&gt; de Morgan Freeman. . . )
</p>
<p>&#8211; R&#233;visions qui concernent des r&#233;visions de forme : &lt;le&gt;la grandiloquence, beaucoup &lt;de&gt;
d&#8217;auditeurs, autre chose &lt;qu&#8217;un&gt; qu&#8217;une guerre
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>176 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&lt;Turn speaker=&quot;spk2&quot; startTime=&quot;428.447&quot; endTime=&quot;430.539&quot;&gt;
&lt;Sync time=&quot;428.447&quot;/&gt;
&lt;Event desc=&quot;rev&quot; type=&quot;lexical&quot; extent=&quot;begin&quot;/&gt;
</p>
<p>si
&lt;Event desc=&quot;rev&quot; type=&quot;lexical&quot; extent=&quot;end&quot;/&gt;
</p>
<p>il y avait pas une route
&lt;Sync time=&quot;429.187&quot;/&gt;
&lt;Overlap type=&quot;primary&quot; extent=&quot;begin&quot;/&gt;
</p>
<p>qui desservait ce terrain
&lt;Event desc=&quot;dm&quot; type=&quot;lexical&quot; extent=&quot;begin&quot;/&gt;
</p>
<p>quoi
&lt;Event desc=&quot;dm&quot; type=&quot;lexical&quot; extent=&quot;end&quot;/&gt;
</p>
<p>?
&lt;Overlap type=&quot;primary&quot; extent=&quot;end&quot;/&gt;
&lt;Overlap type=&quot;backchannel&quot; extent=&quot;begin&quot; speaker=&quot;spk3&quot; subtype=&quot;out-field&quot;/&gt;
</p>
<p>non il y avait pas une route .
&lt;Overlap type=&quot;backchannel&quot; extent=&quot;end&quot;/&gt;
</p>
<p>&lt;/Turn&gt;
</p>
<p>FIGURE 1 &#8211; Extrait d&#8217;un fichier Le Masque et la plume au format Transcriber
</p>
<p>&#8211; Marqueurs de discours qui sont des mots ou des locutions qui ont une valeur illocutoire sans
avoir de fonction syntaxique dans l&#8217;&#233;nonc&#233; comme par exemple ah,bref, mais bon voil&#224;, non
non non, na na na. . .
</p>
<p>L&#8217;annotation des marqueurs de discours n&#8217;&#233;tant pas toujours coh&#233;rente, nous l&#8217;avons reprise,
avec une liste de 115 marqueurs (simples ou compos&#233;s). En particulier les connecteurs, les
conjonctions de coordination en d&#233;but de phrase, ou les pronoms disloqu&#233;s, ne sont pas trait&#233;s
comme des marqueurs de discours. De fa&#231;on g&#233;n&#233;rale, nous traitons les balises de diffluences
comme des &#233;tiquettes de syntagmes, qui peuvent avoir une structure interne.
</p>
<p>4 Le sch&#233;ma d&#8217;annotation
</p>
<p>Nous indiquons dans cette section les lignes directrices et les conventions adopt&#233;es pour l&#8217;annota-
tion en syntaxe des donn&#233;es de l&#8217;oral. Le sch&#233;ma d&#8217;annotation est d&#233;riv&#233; du sch&#233;ma d&#8217;annotation
pour le treebank &#233;crit (Abeill&#233; et al., 2003).
</p>
<p>On supprime les informations ayant trait au bruit et &#224; la musique consid&#233;r&#233;es comme extra-
linguistiques. Par contre on pr&#233;serve les balises de synchronisation avec la piste sonore, not&#233;es
&lt;Sync&gt; dans ESTER 3 (Figure 1) encod&#233;es par des sous-arbres de racine Sync attach&#233;s avec les
m&#234;mes conventions que les disfluences. Nous pr&#233;sentons plus en d&#233;tails dans la suite de cette
section les choix quant &#224; la segmentation et &#224; la gestion des dysfluences.
</p>
<p>4.1 Lin&#233;arisation et segmentation des donn&#233;es orales
</p>
<p>Comme pour l&#8217;&#233;crit, une des premi&#232;res d&#233;cisions &#224; prendre lorsqu&#8217;on annote un corpus en syntaxe
porte sur la segmentation en mots. Contrairement au corpus &#233;crit, la segmentation pour le corpus
oral minimise le nombre de mots compos&#233;s. Nous nous sommes pour cela appuy&#233;s sur les travaux
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>177 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ant&#233;rieurs de (Crabb&#233; et Candito, 2008) en ne retenant qu&#8217;un nombre minimal de mots compos&#233;s,
en particulier des mots compos&#233;s grammaticaux comme des conjonctions de subordination, de
coordinations, des d&#233;terminants, pr&#233;positions . . . et quelques mots compos&#233;s propres &#224; l&#8217;oral
n&#8217;est-ce pas, s&#8217;il vous pla&#238;t, tant pis. . . qui ont un impact sur la syntaxe et l&#8217;analyse de la phrase.
La liste exacte des mots compos&#233;s est d&#233;finie et document&#233;e dans (Abeille et al., 2013).
</p>
<p>Nous nous appuyons &#233;galement sur une segmentation en phrases, m&#234;me si le choix de tel ou
tel d&#233;coupage ne va pas de soi. Plusieurs notions sont possibles : une notion phon&#233;tique ou la
phrase est d&#233;limit&#233;e par la dur&#233;e des pauses, ce qui est le cas de la transcription ESTER 3, une
notion dialogique o&#249; la phrase correspond &#224; un tour de parole, une notion discursive o&#249; la phrase
correspond &#224; un acte de langage, et une notion syntaxique o&#249; la phrase correspond &#224; une plus
grande unit&#233; syntaxique compl&#232;te (avec ench&#226;ssement possible). Ici nous avons consid&#233;r&#233; qu&#8217;un
tour de parole non constitu&#233; uniquement de bruit ou de musique correspond au moins &#224; une
phrase, m&#234;me fragmentaire. Un tour de parole peut lui-m&#234;me &#234;tre d&#233;coup&#233; en plusieurs phrases
racines. Nous nous appuyons pour cela sur des crit&#232;res syntaxiques, discursifs et prosodiques. Une
s&#233;quence autonome associ&#233;e &#224; un acte de langage forme une phrase racine. En revanche, nous ne
consid&#233;rons pas qu&#8217;une phrase recouvre des tours de paroles diff&#233;rents, c&#8217;est-&#224;-dire qu&#8217;une m&#234;me
phrase commenc&#233;e par un locuteur soit termin&#233;e par un autre locuteur 1. En cas d&#8217;interruption et
pour rep&#233;rer les syntagmes inachev&#233;s nous utilisons plut&#244;t une annotation d&#8217;inach&#232;vement (-INA)
comme &#233;tiquette suppl&#233;mentaire sur les noeuds racine des syntagmes jug&#233;s inachev&#233;s.
</p>
<p>Ces crit&#232;res &#233;tant donn&#233;s, voyons comment sont trait&#233;s les cas de chevauchements. Les structures
&#224; chevauchements ESTER 3 suivent un sch&#233;ma tel qu&#8217;illustr&#233; en figure 2 &#224; gauche (o&#249; le balisage
XML est simplifi&#233;). Pour g&#233;rer les cas de chevauchement dans l&#8217;annotation syntaxique, le principe
a &#233;t&#233; de fusionner les parties en backchannel associ&#233;es &#224; un locuteur X au tour de parole
suivant (resp. pr&#233;c&#233;dent selon les cas) de ce locuteur X dans les donn&#233;es transcrites, ce qui
permet d&#8217;&#233;viter de d&#233;couper artificiellement une phrase compl&#232;te &#233;nonc&#233;e par ce locuteur X .
Par contre, pour pr&#233;server l&#8217;information, nous avons &#233;galement introduit des marques dans
les arbres sous forme de noeuds feuilles pour indiquer la port&#233;e du chevauchement suivant le
sch&#233;ma donn&#233; en figure 2. Chacun des quatre noeuds feuilles ainsi introduit dans les arbres est
</p>
<p>&lt;Turn speaker=&quot;Y&quot;&gt;
w[y,1] ... w[y,b-1]
</p>
<p>&lt;Overlap&gt;
w[y,b+1] ... w[y,e-1]
</p>
<p>&lt;/Overlap&gt;
w[y,e+1] ... w[y,n]
</p>
<p>&lt;Backchannel speaker=&quot;X&quot;&gt;
w[x,1] ... w[x,e-1]
</p>
<p>&lt;/Backchannel&gt;
&lt;/Turn&gt;
&lt;Turn speaker = &quot;X&quot;&gt;
</p>
<p>w[x,e+1] ... w[x,n]
&lt;/Turn&gt;
</p>
<p>Y
</p>
<p>SENT
</p>
<p>wy,l . . .wy,e&#8722;1OverlapE idwy,e+1 . . .wy,n
</p>
<p>. . .SENT
</p>
<p>wy,1 . . .wy,b&#8722;1OverlapB-idwy,b+1 . . .wy,k
</p>
<p>X
</p>
<p>SENT
</p>
<p>wx ,l . . .wx ,e&#8722;1BackchannelE-idwx ,e+1 . . .wx ,n
</p>
<p>. . .SENT
</p>
<p>BackchannelB-idwx ,2 . . .wx ,k
</p>
<p>FIGURE 2 &#8211; Encodage des chevauchements dans les arbres
</p>
<p>1. Les annotations ESTER 3 comportent parfois plusieurs tours de paroles cons&#233;cutifs pour un m&#234;me locuteur. Nous
avons refusionn&#233; ces s&#233;quences de mani&#232;re &#224; &#233;viter qu&#8217;une phrase prononc&#233;e par un m&#234;me locuteur ne soit artificiellement
d&#233;coup&#233;e.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>178 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de plus annot&#233; par un identifiant unique (not&#233; id dans le sch&#233;ma) permettant d&#8217;identifier &#224; quel
chevauchement ce noeud fait r&#233;f&#233;rence. Ce qui permet de g&#233;rer des chevauchements multiples
dans un m&#234;me document et dans un m&#234;me tour de parole. Notons que coder le chevauchement
sous forme d&#8217;un noeud non terminal dans les arbres ne serait pas suffisamment g&#233;n&#233;ral, car cela
emp&#234;che de coder des chevauchements qui portent sur plusieurs phrases ou des chevauchements
qui pr&#233;sentent des structures &#224; croisement 2
</p>
<p>4.2 La gestion des disfluences
</p>
<p>SENT
</p>
<p>we . . .wn
</p>
<p>D
</p>
<p>wb . . .we&#8722;1w1 . . .wb&#8722;1
</p>
<p>FIGURE 3 &#8211; Disfluences
</p>
<p>Les disfluences sont annot&#233;es dans les donn&#233;es ETAPE
par des balises XML qui groupent une s&#233;quence de
mots comme &#233;tant disfluente. Sch&#233;matiquement pour une
phrase w1 . . .wn, une disfluence &#224; la forme suivante :
w1 . . .wb&#8722;1&#9001;D&#9002;wb . . .we&#8722;1&#9001;/D&#9002;we . . .wn. O&#249; D repr&#233;sente un
code XML pour h&#233;sitation, r&#233;vision, r&#233;p&#233;tition ou marqueur
de discours. Les disfluences sont intra-phrastiques, peuvent
avoir une structure interne (dans le cas de r&#233;p&#233;tions ou de
r&#233;visions par exemple) mais ne pr&#233;sentent pas de sch&#233;mas
de croisement non projectifs. Nous les repr&#233;sentons comme des noeuds syntagmatiques dans les
arbres, comme illustr&#233; en Figure 3.
</p>
<p>L&#8217;attachement des disfluences dans les arbres de constituants n&#8217;&#233;tant pas naturellement d&#233;termi-
niste, nous choisissons d&#8217;attacher les r&#233;p&#233;titions au premier syntagme qui contient le mat&#233;riel
r&#233;p&#233;t&#233;, et les r&#233;visions au premier syntagme qui contient le mat&#233;riel r&#233;vis&#233;. En cas d&#8217;h&#233;sitation
sur le noeud auquel attacher la disfluence, on tranche pour l&#8217;attachement au noeud le plus haut
dans l&#8217;arbre.
</p>
<p>4.3 Les cat&#233;gories utilis&#233;es
</p>
<p>Cat&#233;gories syntagmatiques AdP, AP, COORD, NP, PP, VN, VPinf, VPpart
Sint (parenth&#233;tique ou incise), Srel (relative), Ssub (subordonn&#233;e), SENT (racine)
</p>
<p>Cat&#233;gories lexicales ADJ, ADJINT (adjectif interrogatif), ADV, ADVINT (adverbe interrogatif),
ADVEX (adverbe exclamatif), (V (indicatif qui inclut conditionnel), VINF (infinitif)
VIMP (imp&#233;ratif), VPP (part pass&#233;), VPR (part pr&#233;sent), VS (subjonctif)
NC (nom commun), NPP (nom propre), CC (conj coord), CS (conj sub)
CLS (clitique sujet), CLO (clitique objet ou compl&#233;ment), CLR (clitique r&#233;fl&#233;chi)
P (pr&#233;position), P+D (au, du, des), P+PRO (auquel, duquel, desquels) PRO
PROINT (pronom interrogatif), PROREL (pronom relatif)
DET, DETINT (d&#233;terminant interrogatif), DETEX (d&#233;terminant exclamatif),
ET (mot &#233;tranger), I (interjection), UK (mots inachev&#233;s/non reconnus)
HES, REP, REV,DM
</p>
<p>Symboles Fonctionnels SUJ,OBJ,A-OBJ,DE-OBJ,P-OBJ,MOD,ATS,ATO,DIS,VOC
Marque d&#8217;inach&#232;vement INA
</p>
<p>TABLE 1 &#8211; Jeu d&#8217;&#233;tiquettes utilis&#233; dans le treebank oral
</p>
<p>Le sch&#233;ma d&#8217;annotation est un format en constituants et en fonctions dont les arbres sont anno-
t&#233;es par un jeu d&#8217;&#233;tiquette utilis&#233; par (Crabb&#233; et Candito, 2008) et qui simplifie le jeu d&#8217;&#233;tiquette
</p>
<p>2. Formellement, les balises de chevauchement n&#8217;encodent pas n&#233;cessairement des structures d&#8217;arbres projectifs.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>179 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>du treebank &#233;crit quant aux jeux de symboles pr&#233;terminaux (&#233;tiquettes morphosyntaxiques). On
ajoute &#224; ce jeu d&#8217;&#233;tiquettes les symboles non terminaux HES, REV, REP, DM qui encodent respecti-
vement les disfluences (h&#233;sitation, r&#233;vision, r&#233;p&#233;tition, marqueur de discours), et des symboles
suppl&#233;mentaires SYNC, OVERLAPB, OVERLAPE,BACKCHANNELB,BACKCHANNELE qui encodent dans
les arbres les annotations de synchronisation son et de chevauchement extraites du format des
annotations ETAPE.
</p>
<p>De plus, certains noeuds comportent des annotations structur&#233;es par plus d&#8217;un attribut. Ainsi en
plus de la cat&#233;gorie syntaxique, on renseigne pour les noeuds arguments du verbe, c&#8217;est-&#224;-dire
les noeuds fr&#232;res du noeud VN et les clitiques arguments leur fonction syntaxique prise parmi le
jeu d&#233;crit par (Abeill&#233; et Barrier, 2004) auquel on ajoute deux nouvelles fonctions de vocatif et
de disloqu&#233;es (not&#233;es VOC, DIS). Un troisi&#232;me attribut bool&#233;en (not&#233; INA) peut &#234;tre renseign&#233; sur
un noeud non terminal pour indiquer qu&#8217;il encode un syntagme inachev&#233;.
</p>
<p>4.4 Quelques observations
</p>
<p>Statistiques descriptives Suivant ce sch&#233;ma d&#8217;annotation nous avons annot&#233; 2118 phrases des
corpus ESTER 3 et CORAL-ROM. En d&#233;taillant les diff&#233;rents sous-corpus, le treebank annot&#233; se
r&#233;sume par la table suivante :
</p>
<p>Le masque et la plume Un temps de Pauchon CORAL-ROM(L&#8217;allumage) Total
Occurrences 15260 11932 5050 32242
Phrases 795 882 441 2118
Lg. moy. phrases 19.1 13.5 11.5 15.2
</p>
<p>TABLE 2 &#8211; Statistiques descriptives
</p>
<p>Observations qualitatives On observe un certain nombre de particularit&#233;s d&#233;j&#224; mentionn&#233;es
pour l&#8217;oral (Blanche-Benveniste, 1997). On observe une abondance de discours rapport&#233; et
d&#8217;incises (incise not&#233;e Sint :MOD en 1), un nombre important de syntagmes inachev&#233;s et
d&#8217;&#233;nonc&#233;s fragmentaires. Un nombre important de phrases commencent par un marqueur discursif
(2) ou une conjonction de coordination ( phrase annot&#233;e comme COORD en 4) :
</p>
<p>(1) (VN ils faisaient) (NP :OBJ (REV des :Det) (Sint :MOD je sais pas moi) des :Det trucs) (c-oral-rom)
</p>
<p>(2) (DM bon-A alors-ADV) (VN raconte-moi) ( NP :OBJ ton week-end) ) (c-oral-rom)
</p>
<p>On observe aussi de nombreuses juxtapositions (comme en (3) ou on duplique la fonction ATS) et
on peut parfois h&#233;siter entre une annotation comme disfluence (r&#233;vision ou r&#233;p&#233;tition) ou comme
juxtaposition. A partir du moment o&#249; les disfluences ont la m&#234;me structure interne que les autres
syntagmes, comme la r&#233;p&#233;tition en (4) qui inclut deux syntagmes, un utilisateur qui serait en
d&#233;saccord peut choisir d&#8217;ignorer certaines balises de disfluences. Les r&#233;p&#233;titions intensives (5)
ne sont pas not&#233;es comme des disfluences. De m&#234;me les mots annot&#233;s comme marqueurs de
discours ont leur &#233;tiquette habituelle (par exemple A, V ou ADV) domin&#233;e par la balise DM,
comme en (2), qui peut aussi &#234;tre ignor&#233;e en cas de besoin :
</p>
<p>(3) C&#8217;est (NP :ATS un grand couteau), (NP :ATS une sorte de hachoir) (un temps de pauchon)
</p>
<p>(4) (COORD mais (REP (VN il y a) (NP :OBJ m&#234;l&#233;e)), (VN il y a ) ( NP :OBJ m&#234;l&#233;e) (masque et la plume)
</p>
<p>(5) Ils sont (AP :ATS tr&#232;s-ADV tr&#232;s-ADV laids-A) (masque et la plume)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>180 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SENT
</p>
<p>PONCT
</p>
<p>.
</p>
<p>COORD
</p>
<p>COORD
</p>
<p>Sint
</p>
<p>AP-ATS
</p>
<p>ADJ
</p>
<p>solides
</p>
<p>VN
</p>
<p>V
</p>
<p>sont
</p>
<p>Sync
</p>
<p>662.004
</p>
<p>PP-MOD
</p>
<p>NP
</p>
<p>NPP
</p>
<p>Murat
</p>
<p>NPP
</p>
<p>Pierre
</p>
<p>HES
</p>
<p>I
</p>
<p>euh
</p>
<p>P
</p>
<p>comme
</p>
<p>NP-SUJ
</p>
<p>PP
</p>
<p>NP
</p>
<p>NPP
</p>
<p>Invictus
</p>
<p>P
</p>
<p>&#224;
</p>
<p>NC
</p>
<p>opposants
</p>
<p>DET
</p>
<p>les
</p>
<p>CC
</p>
<p>et
</p>
<p>HES
</p>
<p>I
</p>
<p>euh
</p>
<p>NP-OBJ
</p>
<p>NC
</p>
<p>m&#234;l&#233;e
</p>
<p>VN
</p>
<p>V
</p>
<p>a
</p>
<p>CLO
</p>
<p>y
</p>
<p>CLS-SUJ
</p>
<p>il
</p>
<p>REP
</p>
<p>NP-OBJ
</p>
<p>NC
</p>
<p>m&#234;l&#233;e
</p>
<p>VN
</p>
<p>V
</p>
<p>a
</p>
<p>CLO
</p>
<p>y
</p>
<p>CLS-SUJ
</p>
<p>il
</p>
<p>CC
</p>
<p>Mais
</p>
<p>HES
</p>
<p>I
</p>
<p>Euh
</p>
<p>Sync
</p>
<p>655.949
</p>
<p>FIGURE 4 &#8211; Exemple d&#8217;arbre du Masque et la plume (apr&#232;s correction)
</p>
<p>SENT
</p>
<p>PONCT
</p>
<p>.
</p>
<p>PP-P_OBJ
</p>
<p>NP
</p>
<p>PRO
</p>
<p>moi
</p>
<p>P
</p>
<p>chez
</p>
<p>VN
</p>
<p>VPP
</p>
<p>rentr&#233;e
</p>
<p>V
</p>
<p>suis
</p>
<p>CLS-SUJ
</p>
<p>je
</p>
<p>PONCT
</p>
<p>,
</p>
<p>HES
</p>
<p>I
</p>
<p>euh
</p>
<p>NP-MOD
</p>
<p>NC
</p>
<p>week-end
</p>
<p>DET
</p>
<p>Le
</p>
<p>DM
</p>
<p>I
</p>
<p>non
</p>
<p>PONCT
</p>
<p>,
</p>
<p>ADV
</p>
<p>alors
</p>
<p>ADJ
</p>
<p>bon
</p>
<p>FIGURE 5 &#8211; Exemple d&#8217;arbre de CORAL-ROM (apr&#232;s correction)
</p>
<p>5 Proc&#233;d&#233; d&#8217;annotation
</p>
<p>Dans cette section nous d&#233;crivons plus pr&#233;cis&#233;ment la m&#233;thode d&#8217;annotation qui a &#233;t&#233; d&#233;ploy&#233;e.
Celle-ci se divise en trois &#233;tapes s&#233;quentielles.
</p>
<p>Segmentation et lin&#233;arisation des donn&#233;es Lors de cette premi&#232;re &#233;tape, nous avons segment&#233;
semi-automatiquement les donn&#233;es en phrases en nous appuyant sur la ponctuation donn&#233;e
par les donn&#233;es au format ESTER 3. La segmentation en phrases a &#233;t&#233; syst&#233;matiquement valid&#233;e
manuellement. Lors de cette &#233;tape le travail d&#8217;annotation a consist&#233; tout d&#8217;abord &#224; corriger la
ponctuation ESTER 3. Celle-ci ayant &#233;t&#233; r&#233;alis&#233;e principalement sur crit&#232;res phon&#233;tiques, elle a
&#233;t&#233; corrig&#233;e pour refl&#233;ter davantage une ponctuation grammaticale.
</p>
<p>Lors de cette &#233;tape nous avons parfois r&#233;lin&#233;aris&#233; les donn&#233;es. En effet l&#8217;annotation ESTER 3
n&#8217;impose pas de contrainte stricte quant &#224; l&#8217;ordre de la transcription lorsque plusieurs locuteurs
parlent simultan&#233;ment. Nous avons identifi&#233; quelques cas de structures syntaxiques bien form&#233;es
qui &#233;taient interrompues par le tour de parole d&#8217;un autre locuteur. Pour ces quelques cas,
nous nous sommes permis de r&#233;ordonner l&#8217;annotation pour restituer une coh&#233;rence quant &#224; la
structuration du texte en phrases.
</p>
<p>Finalement, nous avons normalis&#233; la segmentation en mots. La segmentation en mots a &#233;t&#233;
r&#233;alis&#233;e de mani&#232;re &#224; minimiser la quantit&#233; de mots compos&#233;s en nous basant sur la liste &#233;tablie
par (Crabb&#233; et Candito, 2008). Sont retenus en priorit&#233; comme mots compos&#233;s les mots compos&#233;s
grammaticaux (notoirement les d&#233;terminants, conjonctions de subordination et de coordination).
La liste de (Crabb&#233; et Candito, 2008) a &#233;t&#233; mise &#224; jour et est document&#233;e dans (Abeille et al.,
2013).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>181 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;annotation syntaxique automatique la m&#233;thode d&#8217;analyse syntaxique repose sur l&#8217;hypoth&#232;se
que la structure des phrases &#224; l&#8217;oral n&#8217;est pas fondamentalement diff&#233;rente de celles de l&#8217;&#233;crit.
C&#8217;est plut&#244;t la distribution de probabilit&#233; de la grammaire qui varie. Les donn&#233;es &#233;tant segment&#233;es,
l&#8217;&#233;tape d&#8217;analyse syntaxique couvre les t&#226;ches traditionnelles d&#8217;&#233;tiquetage morphosyntaxique,
de parsing et d&#8217;&#233;tiquetage fonctionnel. Nous n&#8217;avons pas utilis&#233; explicitement d&#8217;&#233;tiqueteur
morphosyntaxique dans la mesure o&#249; l&#8217;analyseur syntaxique utilis&#233; (Petrov et al., 2006) est un
mod&#232;le conjoint qui r&#233;alise d&#233;j&#224; le tagging.
</p>
<p>Plus sp&#233;cifiquement, la m&#233;thode d&#8217;analyse utilis&#233;e tire parti des annotations en disfluences
donn&#233;es par ESTER 3. L&#8217;analyse en constituants proprement dite est pr&#233;c&#233;d&#233;e d&#8217;un pr&#233;traitement
qui supprime de l&#8217;entr&#233;e les disfluences, les marques de chevauchement et les balises de synchro-
nisation avec la bande son. Celles-ci sont r&#233;int&#233;gr&#233;es dans les analyses en post-traitement. Les
arbres de dysfluences sont cr&#233;&#233;s de mani&#232;re heuristique : la racine est la cat&#233;gorie donn&#233;e par
ESTER 3, celle-ci domine syst&#233;matiquement les noeud pr&#233;terminaux (tags) &#233;tiquet&#233;s par un 2-CRF
lin&#233;aire (mod&#232;le appris sur le treebank &#233;crit).
</p>
<p>Les arbres sont finalement annot&#233;s en fonctions par un 2-CRF lin&#233;aire appris sur les donn&#233;es
&#233;crites suivant la description donn&#233;e dans (Candito et al., 2009) : seuls les noeuds arguments du
verbe re&#231;oivent une &#233;tiquette fonctionnelle : il s&#8217;agit des noeuds en position fr&#232;re des noeuds VN
et des noeuds clitiques (en position fr&#232;res du noeud V).
</p>
<p>La correction manuelle L&#8217;&#233;tape de correction manuelle a consist&#233; &#224; corriger les annotations en
constituant et en fonctions. Notons que nous avons travaill&#233; avec des repr&#233;sentations type Penn
Treebank ce qui a permis de r&#233;utiliser les interfaces graphique WordFreak destin&#233;e &#224; l&#8217;&#233;dition
d&#8217;arbres en constituants et Tregex (Levy et Andrew, 2006) pour la visualisation et la recherche
de motifs, ce qui facilite consid&#233;rablement le travail d&#8217;annotation. Cette partie du processus a
consist&#233; en une premi&#232;re &#233;tape d&#8217;annotation suivie d&#8217;une &#233;tape de discussion/adjudication entre
annotateurs.
</p>
<p>Concernant les disfluences, la correction concerne leur structure interne pour les r&#233;visions ou les
r&#233;p&#233;titions comme en (6) ou leur rattachement. En (7) on a une phrase en discours rapport&#233;
(compl&#233;ment du verbe faire) r&#233;duite &#224; un marqueur discursif. :
</p>
<p>(6) moi, (REP (NP :SUJ &#231;a-PRO) (VN-INA me-CLO) ) &#231;a me dit rien, moi (c-oral-rom)
</p>
<p>(7) Il me fait : (Sint :OBJ (DM ben si )).
</p>
<p>Pour les cat&#233;gories lexicales, on observe le m&#234;me type de corrections que pour l&#8217;&#233;crit, concernant
le mauvaise &#233;tiquetage de mots grammaticaux fr&#233;quents et ambigus comme pour de (pr&#233;position
au lieu de d&#233;terminant) ou que (conjonction de subordination au lieu de pronom relatif). Les
autres erreurs concernent les mots non appris sur l&#8217;&#233;crit comme les interjections, ou plus rares
comme les interrogatifs et les imp&#233;ratifs. Les formes verbales syncr&#233;tiques, fr&#233;quentes avec les
verbes du premier groupe au pr&#233;sent, sont ainsi syst&#233;matiquement &#233;tiquet&#233;es indicatif alors
qu&#8217;il faut les corriger en imp&#233;ratif voire subjonctif. Pour les constituants aussi, on observe le
m&#234;me type de corrections que pour l&#8217;&#233;crit concernant les mauvais rattachements de syntagmes
pr&#233;positionnels ou de relative. Les autres corrections concernent l&#8217;ajout de l&#8217; &#233;tiquette INA quand
le syntagme inachev&#233; est mal form&#233; et le rattachement des disfluences (REP, REV). Pour les
fonctions, les corrections sp&#233;cifiques concernent l&#8217;ajout des fonctions vocatif (8) et disloqu&#233; (9),
et la r&#233;duplication des fonctions pour les juxtapositions (10). Une partie des corrections est la
m&#234;me que pour l&#8217;&#233;crit concernant les sujets invers&#233;s ou la distinction entre compl&#233;ment et ajout
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>182 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pour les syntagmes pr&#233;positionnels.
</p>
<p>(8) (DM Allez-V) (NP-VOC Catherine) (NP encore un tour) ! (le masque et la plume)
</p>
<p>(9) (NP :DIS moi-PRO), (NP :DIS ce qui me frappe), (VN c&#8217;-CLS-SUJ est ) (NP-ATS la fin). (le masque et la plume)
</p>
<p>(10) (NP-SUJ des chanteurs) ,(NP-SUJ des musiciens) (VN sont pass&#233;s) dans ce th&#233;&#226;tre (un temps de pauchon)
</p>
<p>On compte 8 &#224; 10 heures pour 100 phrases environ (en double correction). Au total, pour la
correction des transcriptions et la segmentation (avant parsing) et la correction des analyses
(apr&#232;s parsing), nous avons employ&#233; 4 annotateurs pour un total de 12 hommes-mois : 3 &#233;tudiants
de Paris 7 en linguistique (M2) ou en linguistique informatique (M1), et une ancienne &#233;tudiante,
sp&#233;cialiste du FTB (Vanessa Combet).
</p>
<p>6 &#201;valuation
</p>
<p>Cette section propose une &#233;valuation et une mise en perspective de la m&#233;thode de pr&#233;annotation
syntaxique (&#233;tape 2 du processus d&#8217;annotation), qui est l&#8217;&#233;tape cl&#233; du processus. La question que
l&#8217;on se pose lorsqu&#8217;on veut annoter un corpus hors domaine consiste &#224; d&#233;terminer la meilleure
mani&#232;re d&#8217;amorcer la pr&#233;annotation des donn&#233;es de mani&#232;re &#224; faciliter la t&#226;che des annotateurs
sachant qu&#8217;on dipose d&#8217;un mod&#232;le d&#8217;analyse pour le domaine source.
</p>
<p>En termes d&#8217;analyse syntaxique, l&#8217;annotation d&#8217;un corpus oral tombe dans la classe des probl&#232;mes
d&#8217;adaptation de domaine. Celui-ci comporte deux aspects. Premi&#232;rement il s&#8217;agit d&#8217;adapter la
structure : en effet nous avons vu que le sch&#233;ma d&#8217;annotation de l&#8217;oral introduit de nouvelles
structures et de nouvelles cat&#233;gories li&#233;es aux disfluences. En second lieu il faut adapter la distri-
bution de probabilit&#233; de la grammaire. Il s&#8217;agit du probl&#232;me classique d&#8217;adapter la distribution de
probabilit&#233; d&#8217;un mod&#232;le probabiliste entrain&#233; sur un &#233;chantillon de donn&#233;es biais&#233; (un corpus
&#233;crit) &#224; un &#233;chantillon poss&#233;dant des propri&#233;t&#233;s diff&#233;rentes (corpus oral).
</p>
<p>De mani&#232;re &#224; apporter une premi&#232;re id&#233;e de la correction de m&#233;thodes d&#8217;adaptation simples,
nous comparons ici quatre m&#233;thodes qui tirent parti des donn&#233;es &#224; la fois &#233;crites et orales pour
faciliter le processus de pr&#233;annotation :
&#8211; Utilisation des donn&#233;es &#233;crites uniquement (E) : Cette m&#233;thode de base consiste &#224; analyser
les donn&#233;es orales en utilisant uniquement un mod&#232;le d&#8217;analyse appris sur l&#8217;int&#233;gralit&#233; des
donn&#233;es &#233;crites (21268 phrases). Utiliser cette m&#233;thode de base ne permet pas d&#8217;envisager
analyser correctement les structures propres &#224; l&#8217;oral (dysfluences). Il s&#8217;agira essentiellement de
notre baseline.
</p>
<p>&#8211; Approche par transformation/d&#233;transformation des donn&#233;es (T/D) : Cette m&#233;thode
consiste &#224; pr&#233;traiter les donn&#233;es orales en supprimant les disfluences (balis&#233;es dans les donn&#233;es
ESTER 3) de l&#8217;entr&#233;e donn&#233;e &#224; l&#8217;analyseur syntaxique. Ce dernier, entra&#238;n&#233; sur l&#8217;ensemble des
donn&#233;es &#233;crites (21268 phrases), doit alors pr&#233;dire pour l&#8217;oral des structures qui ressemblent &#224;
celles de l&#8217;&#233;crit. Une &#233;tape de post traitement r&#233;ins&#232;re finalement dans les arbres d&#8217;analyse les
dysfluences supprim&#233;es en pr&#233;traitement.
Chaque disfluence de k mots ainsi r&#233;ins&#233;r&#233;e est un arbre dont la racine est la cat&#233;gorie de la
dysfluence (donn&#233;e par ESTER 3). La racine domine imm&#233;diatement une s&#233;quence de k-tags
&#233;tiquet&#233;es par un 2CRF lin&#233;aire appris sur le treebank &#233;crit, chacun de ces k&#8722;tags domine le
mot correpondant.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>183 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; Approche par utilisation exclusive des donn&#233;es orales (O) Dans ce troisi&#232;me sc&#233;nario, on
suppose qu&#8217;on dispose d&#8217;un fragment de donn&#233;es d&#233;j&#224; annot&#233;es pour le domaine cible. Le
mod&#232;le d&#8217;analyse est entrain&#233; uniquement sur ce fragment de donn&#233;es orales et n&#8217;utilise pas
les donn&#233;es &#233;crites.
</p>
<p>&#8211; Approche par utilisation combin&#233;e des donn&#233;es &#233;crites et des donn&#233;es orales (O/E) :
Dans ce dernier sc&#233;nario, le mod&#232;le est appris sur l&#8217;int&#233;gralit&#233; des donn&#233;es &#233;crites et sur un
fragment des donn&#233;es orales.
</p>
<p>Comparaison des diff&#233;rentes m&#233;thodes Dans ce qui suit nous &#233;valuons chacune de ces m&#233;-
thodes en fonction de la quantit&#233; de donn&#233;es orales utilis&#233;es pour entrainer le mod&#232;le. Dans
le cas des m&#233;thodes (E) et (T/D), le fragment de donn&#233;es orales de r&#233;f&#233;rence disponible n&#8217;est
pas utilis&#233; pour l&#8217;entrainement. Les m&#233;thodes (E) (T/D) et (E/O) utilisent syst&#233;matiquement
l&#8217;int&#233;gralit&#233; des donn&#233;es &#233;crites pour l&#8217;entrainement. Les fragments de donn&#233;es orales utilis&#233;s &#224;
l&#8217;entrainement du mod&#232;le par les m&#233;thodes (O) et (E/O) sont issus de donn&#233;es de r&#233;f&#233;rence d&#233;j&#224;
valid&#233;es par les annotateurs.
</p>
<p>L&#8217;analyseur utilis&#233; est l&#8217;analyseur de Berkeley (Petrov et al., 2006) tel que distribu&#233; &#224; ce jour. Cet
algorithme faiblement lexicalis&#233; est connu pour &#234;tre relativement robuste au changement de
domaine. L&#8217;ensemble des tests r&#233;alis&#233;s repose sur la comparaison des pr&#233;dictions de cet analyseur
sur un corpus de test comportant 528 phrases. Le calcul du F-Score est r&#233;alis&#233; avec le logiciel
evalb (param&#233;trage standard, phrase de moins de 40 mots).
</p>
<p>Nous avons &#233;valu&#233; la correction de chacune des quatre m&#233;thodes en fonction de la taille du
fragment de donn&#233;es orales utilis&#233;es &#224; l&#8217;entrainement. Les r&#233;sultats sont r&#233;sum&#233;s dans la table 3
(Pr&#233;cision,Rappel, F-score, Tagging accurracy) 3. Les lignes repr&#233;sentent chacune des quatre
m&#233;thodes d&#8217;analyse. Les colonnes repr&#233;sentent la taille des donn&#233;es orales (en nombre de
phrases) utilis&#233;es par l&#8217;analyseur lors de l&#8217;entrainement. Les chiffres indiquent le F-score de
l&#8217;analyseur sur le jeu de test de 528 phrases.
</p>
<p>M&#233;thode 530 1060 1590
P R F Tag P R F Tag P R F Tag
</p>
<p>Ecrit (E) 62.2 66.4 64.3 61.7 62.2 66.4 64.3 61.7 62.2 66.4 64.3 61.7
Ecrit (T/D) 72.8 79.6 76.0 62.4 72.8 79.6 76.0 62.4 72.8 79.6 76.0 62.4
Oral (O) 64.8 64.8 64.8 66.4 68.9 69.2 69.0 70.7 70.6 71.3 71.0 72.3
</p>
<p>Oral+Ecrit (O/E) 63.6 66.1 64.9 62.0 63.6 67.0 65.3 64.8 67.4 70.9 69.11 67.0
</p>
<p>TABLE 3 &#8211; Evaluation des m&#233;thodes d&#8217;adaptation
</p>
<p>Vu que les deux premi&#232;res lignes repr&#233;sentent des protocoles qui ignorent totalement les don-
n&#233;es orales &#224; l&#8217;entrainement, le score d&#8217;&#233;valuation est constant. En premi&#232;re observation, on
constate que la m&#233;thode de transformation/d&#233;transformation des donn&#233;es est celle qui donne les
meilleurs r&#233;sultats. L&#8217;explication la plus vraisemblable pour expliquer ce meilleur r&#233;sultat tient
probablement &#224; (1) les donn&#233;es &#224; pr&#233;dire correspondent structurellement aux donn&#233;es apprises
et (2) une partie de la solution est simplement d&#233;j&#224; donn&#233;e : les dysfluences sont en effet copi&#233;es
de l&#8217;entr&#233;e vers la sortie sans possibilit&#233; de se tromper dans leurs pr&#233;dictions.
</p>
<p>On constate &#233;galement que le mod&#232;le mixte (O/E) fonctionne comparativement moins bien qu&#8217;un
mod&#232;le entra&#238;n&#233; uniquement sur les donn&#233;es orales (O). La raison est certainement &#224; chercher
dans le fait que les proportions de donn&#233;es orales et &#233;crites de ce mod&#232;le sont in&#233;gales : 21268
</p>
<p>3. Notons toutefois que les performances de l&#8217;analyseur varient d&#8217;un type de corpus &#224; l&#8217;autre : ainsi on obtient un
F-score de 69.5 sur les donn&#233;es CORAL-ROM et de 61.8 sur les donn&#233;es France Inter avec le mod&#232;le (E).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>184 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>phrases pour l&#8217;&#233;crit contre k &#8727;530 phrases pour l&#8217;oral (1&#8804; k &#8804; 3). Autrement dit, ce mod&#232;le reste
fondamentalement semblable &#224; un mod&#232;le de l&#8217;&#233;crit.
</p>
<p>Exploration du comportement des mod&#232;les mixtes (O/E) De mani&#232;re &#224; v&#233;rifier plus en d&#233;tail
si un mod&#232;le de type (O/E) permet d&#8217;obtenir un mod&#232;le satisfaisant en assurant une pond&#233;ration
plus appropri&#233;e des deux groupes de donn&#233;es (oral,&#233;crit) nous avons proc&#233;d&#233; &#224; une seconde
exp&#233;rience par r&#233;&#233;chantillonage contr&#244;l&#233; des donn&#233;es. Dans cette seconde exp&#233;rience nous
avons test&#233; dans quelle mesure un la m&#233;thode de type (O/E) se comporte en fonction de deux
param&#232;tres : (1) la proportion de donn&#233;es &#233;crites dans le corpus d&#8217;entrainement et (2) la taille
des donn&#233;es d&#8217;entrainement.
</p>
<p>Le protocole de quantification des r&#233;sultats est identique au cas pr&#233;c&#233;dent, nous utilisons syst&#233;-
matiquement le m&#234;me corpus de test. Ce qui change c&#8217;est la cr&#233;ation du corpus d&#8217;entra&#238;nement.
Ainsi pour chaque mesure r&#233;alis&#233;e, on a cr&#233;&#233; un corpus d&#8217;entrainement par &#233;chantillonage avec
remise dans les donn&#233;es (angl. bootstrapping with replacement). Les groupes de donn&#233;es source
(dans lesquelles on tire) sont un &#233;chantillon &#233;crit E constitu&#233; des 21268 phrases du French
treebank &#233;crit, et d&#8217;un &#233;chantillon O constitu&#233; de 1530 phrases annot&#233;es pour l&#8217;oral. Notons
k la proportion de texte &#233;crit souhait&#233;e dans le corpus g&#233;n&#233;r&#233;. Chaque phrase ci du corpus
bootstrapp&#233; C = c1 . . . cn est tir&#233;e avec une probabilit&#233; k dans le groupe E et (1&#8722; k) dans le
groupe O. Le tirage dans un groupe (E ou O) est fait de mani&#232;re uniforme et avec remplacement
(on peut tirer plusieurs fois le m&#234;me exemple). C&#8217;est ce corpus g&#233;n&#233;r&#233; al&#233;atoirement C qui
sert comme donn&#233;es d&#8217;apprentissage du mod&#232;le d&#8217;analyse syntaxique. Il est donc possible que
certaines phrases de E ou de O ne soient pas repr&#233;sent&#233;es dans C &#233;chantillonn&#233; et que certaines
phrase de E ou de O y soient repr&#233;sent&#233;es plusieurs fois.
</p>
<p>Notons que le processus de bootstrapping nous permet de cr&#233;er des corpus de tailles queclonques.
Ainsi nous avons crois&#233; chaque valeur retenue pour k (0,0.25,0.5,0.75) avec une taille de corpus
n variant de 1000 &#224; 7000 phrases. Les r&#233;sultats d&#8217;anlyse sur les 528 phrases de test sont report&#233;es
dans le tableau 4. Les r&#233;sultats montrent globalement qu&#8217;une pond&#233;ration plus appropri&#233;e des
</p>
<p>Donn&#233;es d&#8217;entrainement 1000 2000 3000 4000 5000 6000 7000
Mix(Oral,Ecrit,k = 0) 65.57 68.09 69.15 68.2 69.1 67.4 68.0
</p>
<p>Mix(Oral,Ecrit,k = 0.25) 68.2 69.6 71.0 72.1 70.9 71.9 72.1
Mix(Oral,Ecrit,k = 0.5) 67.8 69.6 71.0 72.0 69.1 67.4 67.9
Mix(Oral,Ecrit,k = 0.75) 65.7 69.9 70.7 71.2 71.7 72.0 72.4
</p>
<p>TABLE 4 &#8211; Evaluation par bootstrapping
</p>
<p>deux groupes de donn&#233;es permet d&#8217;am&#233;liorer subtantiellement les performances de l&#8217;analyseur.
Ainsi on atteint un F-Score de 72.4 pour un corpus d&#8217;entrainement de 7000 phrases comportant
75% de donn&#233;es &#233;crites &#224; comparer avec 69.1 obtenu par le m&#233;lange na&#239;f de la premi&#232;re
exp&#233;rience. Toutefois, l&#8217;observation la plus &#233;tonnante reste la comparaison avec la m&#233;thode
artisanale (T/D) F-score= 76% qui reste tr&#232;s nettement meilleure que la m&#233;thodes de m&#233;lange
(O/E) m&#234;me en contr&#244;lant les proportions pour cette derni&#232;re. Pour confirmer la pertinence
de notre m&#233;thode artisanale, il faudrait &#233;galement la comparer &#224; des m&#233;thodes d&#8217;adaptation
de domaine plus &#233;labor&#233;es que le bootstrapping, comme par exemple des m&#233;thodes d&#8217;active
learning qui visent &#224; pond&#233;rer d&#8217;avantage les exemples cl&#233;s pour l&#8217;apprentissage ou encore &#224; des
m&#233;thodes d&#8217;apprentissage semi-supervis&#233;es. Il serait int&#233;ressant &#233;galement de reformuler notre
m&#233;thode artisanale sous forme d&#8217;analyse syntaxique de graphes acycliques orient&#233;s (DAG) o&#249;
les dysfluences sont donn&#233;es en entr&#233;e &#224; l&#8217;analyseur comme segments pr&#233;parenth&#233;s&#233;s. Il faut
toutefois noter que cette approche n&#8217;est pas parfaitement &#233;quivalente &#224; la m&#233;thode (T/D) dans
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>185 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>la mesure o&#249; les segments pr&#233;parenth&#233;s&#233;s seraient &#233;tiquet&#233;s par des symboles de dysfluences
qui sont absents de la grammaire de l&#8217;&#233;crit. Il faut toutefois rappeler que la m&#233;thode (T/D)
s&#8217;applique &#224; un sc&#233;nario d&#8217;annotation dans lequel les disfluences sont d&#233;j&#224; annot&#233;es. Les bonnes
performances de cette m&#233;thode semblent en effet provenir du fait qu&#8217;une partie du parenth&#233;sage
&#224; pr&#233;dire est donn&#233;. Dans un sc&#233;nario d&#8217;analyse syntaxique de l&#8217;oral &#8211; &#224; partir d&#8217;une source brute &#8211;
d&#233;ployer cette m&#233;thode demanderait en particulier de r&#233;aliser un tagger en disfluences pour
l&#8217;oral dont les r&#233;sultats sont suppos&#233;s parfaits. Or l&#8217;&#233;tiquetage automatique de disfluences comme
les r&#233;p&#233;titions ou les r&#233;visions ne repr&#233;sente apparemment pas un probl&#232;me trivial.
</p>
<p>7 Conclusion
</p>
<p>Nous avons valid&#233; sur deux heures de transcription de d&#233;bats radiophoniques et de dialoque
informel, une m&#233;thode d&#8217;analyse syntaxique du fran&#231;ais parl&#233;, en constituants et en fonctions,
inspir&#233; de ce qui se fait pour d&#8217;autres langues, et qui est une extension naturelle du FTB
pour le fran&#231;ais journalistique. Nous avons enrichi le guide d&#8217;annotation du FTB, adapt&#233; et
r&#233;entra&#238;n&#233; l&#8217;analyseur de (Crabb&#233; et Candito, 2008) et adapt&#233; une plate-forme d&#8217;annotation pour
la validation manuelle. Les premiers r&#233;sultats sont encourageants, &#224; la fois en ce qui concerne
les performances du parseur et les temps de correction. Les corpus radiophoniques annot&#233;s
(une heure trente de temps de parole, environ 27 000 mots) seront distribu&#233;s dans le cadre du
consortium du projet Etape. Les annotations du dialogue c-oral-rom (Cresti et al., 2004) sont
disponibles et le corpus distribu&#233; par Elra. La suite du travail consistera &#224; annoter des corpus
oraux librement accessibles comme le corpus CID (Bertrand et al., 2008) ou CFPP (Branca-Rosoff
et al., 2012).
</p>
<p>Remerciements
</p>
<p>Les auteurs tiennent &#224; remercier les annotateurs qui ont contribu&#233; &#224; corriger les annotations :
Vanessa Combet, Floriane Guida, Antoine Lacambre et Mathilde Mari&#233;. Ceux-ci ont &#233;t&#233; financ&#233;s
par le projet ANR ETAPE (resp. G. gravier). Ce projet a aussi b&#233;n&#233;fici&#233; du financement du PEPS
Syfrap (reps. C. Gardent) (CNRS INSHS INSII). Nous remercions Elisabeth Delais-Roussarie
qui a corrig&#233; certaines transcriptions, Mathilde Dargnat avec qui nous avons &#233;tabli la liste des
marqueurs de discours, Djam&#233; Seddah pour l&#8217;aide au d&#233;ploiement des outils de correction
ainsi que Claire Gardent et Christophe Cerisara pour les discussions permettant de comparer
annotations en constituants et annotations en d&#233;pendances.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILLE, A., COMBET, V. et CRABB&#201;, B. (2013). Conventions pour annotation syntaxique du
fran&#231;ais parl&#233;. Rapport technique, Universit&#233; Paris 7.
</p>
<p>ABEILL&#201;, A. et BARRIER, N. (2004). Enriching a french treebank. In Proceedings of LREC.
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et TOUSSENEL, F. (2003). Building a treebank for french. In ABEILL&#201;, A.,
&#233;diteur : Treebanks. Kluwer, Dordrecht.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>186 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BARRAS, C., GEOFFROIS, E., WU, Z. et LIBERMAN, M. (1998). Transcriber : a free tool for
segmenting, labeling and transcribing speech. In First International Conference on Language
Resources and Evaluation (LREC).
BERTRAND, R., BLACHE, P., ESPESSER, R., FERR&#201;, G., MEUNIER, C., PRIEGO-VALVERDE, B. et RAUZY, S.
(2008). Le cid - corpus of interactional data - annotation et exploitation multimodale de parole
conversationnelle. TAL, 49(3).
BLACHE, P., BERTRAND, R., GUARDIOLA, M., GU&#201;NOT, M.-L., C.MEUNIER, NESTERENKO, I., PALLAUD,
B., PR&#201;V&#212;T, L., PRIEGO-VALVERDE, B. et RAUZY, S. (2010). The OTIM formal annotation model : a
preliminary step before annotation scheme. In Proceedings LREC.
BLACHE, P. et RAUZY, S. (2012). Enrichissement du ftb : un treebank hybride consti-
tuants/propri&#233;t&#233;s. In Actes TALN, Grenoble.
BLANCHE-BENVENISTE, C. (1997). Approches de la langues parl&#233;e en fran&#231;ais. Ophrys, Paris.
BRANCA-ROSOFF, S., FLEURY, S., LEFEUVRE, F. et PIRES, M. (2012). Discours sur la ville. corpus de
fran&#231;ais parl&#233; parisien des ann&#233;es 2000. Rapport technique, Universit&#233; Paris 3.
CANDITO, M., CRABB&#201;, B., DENIS, P. et GU&#201;RIN, F. (2009). Analyse syntaxique du fran&#231;ais : des
constituants aux d&#233;pendances. In TALN.
CERISARA, C., GARDENT, C. et ANDERSON, C. (2010). Building and exploiting a dependency
treebank for french radio broadcast. In Proc. TLT9, Tartu, Estonia.
CRABB&#201;, B. et CANDITO, M. (2008). Exp&#233;riences d&#8217;analyse syntaxique du fran&#231;ais. In TALN.
CRESTI, E., do NASCIMENTO, F. B., MORENO-SANDOVAL, A., V&#201;RONIS, J., MARTIN, P. et CHOUKRI, K.
(2004). The c-oral-rom corpus. a multilingual resource of spontaneous speech for romance
languages. In LREC.
DEULOFEU, J., DUFORT, L., GERDES, K., KAHANE, S. et PIETRANDREA, P. (2010). Depends on what
the french say : Spoken corpus annotation with and beyond syntactic function. In Linguistic
Annotation Workshop (LAW IV).
GRAVIER, G., ADDA, G., PAULSSON, N., CARR&#201;, M., GIRAUDEL, A. et GALIBERT, O. (2012). The etape
corpus for the evaluation of speech-based tv content processing in the french language. In Proc
LREC.
HOEKSTRA, A., MOORTGAT, M., SCHUURMAN, I. et van der WOUDEN, A. (2000). Syntactic annotation
for the spoken dutch corpus project (cgn). In Computational Linguistics in the Netherlands (CLIN).
LEVY, R. et ANDREW, G. (2006). Tregex and tsurgeon : tools for querying and manipulating tree
data structures. In Proc. LREC.
MARCUS, M. P., SANTORINI, B. et MARCINKIEWICZ, M. A. (1993). Building a large annotated corpus
of english : The penn treebank. Computational Linguistics, 19(2):313&#8211;330.
METEER, M. (1995). Dysfluency annotation stylebook for the switchboard corpus. Rapport
technique, Upenn.
MIKULOVA, M. (2008). Rekonstrukce standardizovan&#233;ho textu z mluven&#233; r&#780;ec&#780;i v pra&#382;sks&#233;m
z&#225;vislostn&#237;m korpusu mluven&#233; c&#780;e&#353;tiny. manu&#225;l pro anot&#225;tory. Rapport technique 38, UFAL.
PETROV, S., BARRETT, L., THIBAUX, R. et KLEIN, D. (2006). Learning accurate, compact, and
interpretable tree annotation. In Proceedings of the 21st International Conference on Computatio-
nal Linguistics and 44th Annual Meeting of the Association for Computational Linguistics, pages
433&#8211;440, Sydney, Australia. Association for Computational Linguistics.
SCHLUTER, N. et van GENABITH, J. (2007). Preparing, restructuring and augmenting a french
treebank : lexicalized parsers or coherent treebanks ? In Proceedings Pacling 2007, Melbourne.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>187 c&#65535; ATALA</p>

</div></div>
</body></html>