<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un analyseur morphologique &#233;tendu de l'allemand traitant les formes verbales &#224; particule s&#233;par&#233;e</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Un analyseur morphologique &#233;tendu de l'allemand traitant 
les formes verbales &#224; particule s&#233;par&#233;e 
</p>
<p>Jean-Philippe Guilbaud1    Christian Boitet2    Vincent Berment2 
(1) CNRS, LIG-campus, 38041 Grenoble Cedex 09 
</p>
<p>(2) UJF, Universit&#233; de Grenoble, LIG-campus, 38041 Grenoble Cedex 09 
{Jean-Philippe.Guilbaud,Christian.Boitet,Vincent.Berment}@imag.fr 
</p>
<p>R&#201;SUM&#201; ________________________________________________________________________  
Nous d&#233;crivons l&#8217;organisation et l'&#233;tat courant de l&#8217;analyseur morphologique de l&#8217;allemand 
AMALD de grande taille couvrant (pr&#232;s de 103000 lemmes et 500000 formes fl&#233;chies simples, en 
croissance) d&#233;velopp&#233; dans le cadre du projet ANR-&#201;mergence Traouiero. C&#8217;est le premier 
lemmatiseur de l&#8217;allemand capable de traiter non seulement les mots simples et les mots 
compos&#233;s, mais aussi les verbes &#224; particules s&#233;parables quand elles sont s&#233;par&#233;es, m&#234;me par un 
grand nombre de mots (ex : Hier schlagen wir eine neue Methode f&#252;r die morphologische Analyse vor).  
ABSTRACT ______________________________________________________________________  
An extended morphological analyzer of German handling verbal forms with separated 
separable particles 
We describe the organisation and the current state of the large-scale (nearly 103000 lemmas and 
500000 simple inflected forms, growing) morphological analyzer AMALD developed in the 
framework of the ANR-&#201;mergence Traouiero project. It is the first lemmatizer of German able to 
handle not only simple and compound words, but also verbs with separable particles when they 
are separated, even by many words (e.g. Hier schlagen wir eine neue Methode f&#252;r die morphologische 
Analyse vor.).  
MOTS-CL&#201;S : analyse morphologique, lemmatisation, allemand, verbes &#224; particule s&#233;parable  
KEYWORDS : morphological analysis, lemmatization, German, verbs with separable particles. 
</p>
<p>1 Introduction 
En 2008, dans le cadre du projet ANR OMNIA, nous nous sommes r&#233;int&#233;ress&#233;s &#224; l&#8217;analyse 
morphologique (AM) de l&#8217;allemand, pour pouvoir faire de la RI (recherche d&#8217;information) 
translingue sur des collections d&#8217;images (comme FlickR, Belga News, Picassa ou PanImages) 
accompagn&#233;es chacune d&#8217;un petit texte compagnon &#233;crit de fa&#231;on spontan&#233;e dans la langue 
de l&#8217;auteur. Constatant qu&#8217;il n&#8217;y avait pas d&#8217;AM de l&#8217;allemand de bonne qualit&#233;, libre de 
droits et assez couvrante, le premier auteur a alors entrepris d&#8217;en construire une, en partant 
du prototype construit pour sa th&#232;se. Le besoin d&#8217;une telle AM est apparent dans de 
nombreuses applications qui exigent plus que de la lemmatisation ou de l&#8217;&#233;tiquetage 
morphosyntaxique, et l&#8217;allemand est une langue particuli&#232;rement importante. De plus, sa 
morphologie est particuli&#232;rement int&#233;ressante : syst&#232;me de flexions et de d&#233;rivations assez 
riche et fort ambigu, constructions compositionnelles non born&#233;es, et abondance de formes 
verbales discontinues (comme er kommt nach&#8230; an, pour il arrive apr&#232;s&#8230;).  
Nous discutons d&#8217;abord des r&#233;sultats qu&#8217;on attend d&#8217;une AM, et des m&#233;thodes qu&#8217;on peut 
utiliser pour les produire, sachant qu&#8217;il n&#8217;y a pas consensus sur ces deux points. Nous faisons 
ensuite le point sur les AM de l&#8217;allemand existantes. Nous pr&#233;sentons ensuite tr&#232;s 
bri&#232;vement les LSPL1 utilis&#233;s pour construire les trois phases de notre nouvelle AM de 
l&#8217;allemand (AMALD), puis d&#233;crivons les aspects et les composants principaux de cet 
analyseur, avant de l&#8217;&#233;valuer et de conclure.  
                                                   
1 LSPL = Langage Sp&#233;cialis&#233; pour la Programmation Linguistique. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>755 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Buts d&#8217;une analyse morphologique et m&#233;thodes possibles 
Un lemme est une forme de citation dans les dictionnaires, repr&#233;sentant un ensemble de 
formes constituant sa flexion. Pour les verbes, c&#8217;est l&#8217;infinitif dans beaucoup de langues, mais 
c&#8217;est la 3&#176; personne du singulier de la conjugaison subjective en hongrois. La lemmatisation 
est l&#8217;op&#233;ration qui, &#224; chaque occurrence (mot typographique simple ou compos&#233;) d&#8217;un texte, 
associe le ou les lemmes possibles, &#233;ventuellement en utilisant le contexte. Cela suffit pour 
faire de l&#8217;annotation s&#233;mantique, mais pas pour traduire ou faire de la correction 
grammaticale. L&#8217;&#233;tiquetage morphosyntaxique associe &#224; chaque mot (ou partie de mot 
compos&#233;) une ou plusieurs parties du discours (POS) dites aussi cat&#233;gories morphosyntaxiques 
(nom, verbe&#8230;), choisies dans un ensemble plus ou moins riche et &#233;ventuellement structur&#233;. 
Une analyse morphologique (AM) compl&#232;te doit produire non seulement les lemmes et les 
parties du discours, mais aussi les autres variables grammaticales (genre, nombre, cas, mode, 
temps, personne, degr&#233;, etc.), et souvent, en particulier quand on veut pouvoir traiter la 
n&#233;ologie d&#233;rivationnelle 2 , ou reconna&#238;tre des &#233;quivalences paraphrastiques 3 , une unit&#233; 
lexicale (UL) plus abstraite, la famille d&#233;rivationnelle. Elle doit aussi pouvoir produire toutes 
les solutions possibles, par un treillis de possibilit&#233;s, comme le font NooJ et Chasen (NAIST, 
Nara), ou par un arbre avec disjonctions, comme le fait notre outil ATEF, de fa&#231;on &#224; pouvoir 
repr&#233;senter les ambigu&#239;t&#233;s et &#224; laisser les traitements suivants tenter de les r&#233;duire. Un 
syst&#232;me de TAO experte a besoin d&#8217;une AM compl&#232;te. 
La toute premi&#232;re AM de l'allemand par r&#232;gles semble avoir &#233;t&#233; &#233;crite par Klaus Brockhaus &#224; 
Heidelberg (Brockhaus 1971, 1976), en utilisant des grammaires hors-contexte. Les AM du 
syst&#232;me de TA METAL commandit&#233; par Siemens &#224; J. Slocum (Austin, Texas) en 1981 
utilisent le m&#234;me LSPL bas&#233; sur les grammaires hors-contexte augment&#233;es que celui utilis&#233; 
pour l&#8217;analyse syntaxique (multiple). Le traitement de l&#8217;allemand en METAL a progress&#233; 
depuis 30 ans4, mais on n&#8217;en connait pas les d&#233;tails (syst&#232;me propri&#233;taire). Le mod&#232;le hors-
contexte a aussi &#233;t&#233; utilis&#233; pour l&#8217;AM du japonais par Tomita &#224; CMU (GLR, 1986). 
L&#8217;utilisation du mod&#232;le de TEF (transducteur d&#8217;&#233;tats finis) remonte &#224; ATEF, cr&#233;&#233; &#224; Grenoble 
par Jacques Chauch&#233; en 1971-72. D&#8217;autres LSPL fond&#233;s sur les TEF ont suivi, comme INTEX 
et son clone UNITEX, NooJ, Kimmo, XFST, etc. Mais il faut des mod&#232;les au moins hors-
contexte pour analyser de nombreuses langues. C&#8217;est le cas de l&#8217;allemand, &#224; cause de la 
composition r&#233;cursive des mots compos&#233;s. Pour les langues o&#249; le pluriel se marque par la 
r&#233;p&#233;tition, comme les langues malaises, le mod&#232;le hors-contexte n&#8217;est pas non plus assez 
puissant5. Notons aussi que toutes les AM cherchent &#224; r&#233;duire les ambigu&#239;t&#233;s en utilisant le 
contexte, ce qui les fait in&#233;vitablement &quot;d&#233;border vers la syntaxe&quot;. Il s&#8217;agit bien s&#251;r de 
syntaxe tr&#232;s &quot;surfacique&quot;, mais &#231;a en est. D&#233;sambigu&#239;ser des parties du discours sur la base 
de fr&#233;quences de n-grammes est bien de la syntaxe6, m&#234;me si le r&#233;sultat est morphologique. 
Demander &#224; une AM de reconna&#238;tre les verbes &#224; particules s&#233;parables m&#234;me quand leur 
particule est s&#233;par&#233;e et &#224; longue distance est bien un des buts souhaitables d&#8217;une AM. Il ne 
s&#8217;agit en effet pas de produire en r&#233;sultat des constituants, m&#234;me &#233;l&#233;mentaires (chunks), ni 
des relations de d&#233;pendance syntaxique. Il s&#8217;agit seulement de reconna&#238;tre que deux mots 
typographiques distants ne forment qu&#8217;un lemme, et de dire lequel. En fran&#231;ais, cela revient 
&#224; identifier ne&#8230; pas comme un tout. On pourrait m&#234;me dire que c&#8217;est n&#233;cessaire en 
allemand, car la syntaxe et la s&#233;mantique des compos&#233;s Verbe+Particule ne sont la plupart 
                                                   
2 en utilisant des fonctions lexico-s&#233;mantiques &#224; la Mel&#8217;tchuk, dites d&#233;rivations productives. 
3 ex. : phase transitoire ! phase de transition : l&#8217;UL est transiter-V, t&#234;te de la famille d&#233;rivationnelle. 
4 METAL a connu une histoire compliqu&#233;e et est maintenant l&#8217;outil de TA de LucySoftware (Allemagne). 
5 Le langage des mots doubl&#233;s sur un vocabulaire !, D = { ww | w &quot; !* }, n&#8217;est pas hors-contexte&#8230; et donc pas non plus les 
langages de programmation exigeant que les variables soient d&#233;clar&#233;s avant d&#8217;&#234;tre utilis&#233;es. XML ne l&#8217;est pas non plus. 
6 Syntaxe = &#171; [la] mise ensemble &#187;. Ici c&#8217;est seulement de la parataxe (coordination), pas de l&#8217;hypotaxe (subordination).  
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>756 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>du temps pas compositionnelles. Simplement, jusqu&#8217;ici, personne n&#8217;avait apparemment 
pens&#233; qu&#8217;on pourrait le faire dans une application autonome. Comment le faire ? Assez 
simplement dans notre cas : on encha&#238;ne trois phases, la premi&#232;re en ATEF7, la seconde en 
EXPANS (dictionnaires transformant des arbres par expansion de chaque n&#339;ud), qui produit 
pour tout verbe simple un arbre pr&#233;disant tous ses compos&#233;s &#224; particule possibles, et la 
troisi&#232;me, en ROBRA (un outil tr&#232;s puissant de grammaires transformationnelles), qui utilise 
le contexte pour d&#233;terminer si une occurrence est une particule verbale (il y a souvent 
ambigu&#239;t&#233;), et si oui avec quelle occurrence verbale simple elle peut ou doit &#234;tre regroup&#233;e.  
En 2008, nous n&#8217;avions pas trouv&#233; d&#8217;AM de l&#8217;allemand utilisable dans le cadre du projet 
OMNIA et avions donc entrepris de d&#233;velopper la n&#244;tre, &#224; partir de la maquette de 
(Guilbaud 1981). Au moment d&#8217;intensifier cet effort et de viser le passage &#224; l&#8217;&#233;chelle, dans le 
cadre du projet ANR Traouiero, nous avons r&#233;examin&#233; la situation. Elle n&#8217;a apparemment 
pas progress&#233;8. On trouve d&#8217;abord des r&#233;f&#233;rences d&#233;j&#224; anciennes &#224; Morphy (Lezius &amp; al. 
1998, 2000 ; Rapp &amp; Lezius 2001). Morphy est installable sous Windows, et il y a sur le Web 
un fichier (http://www.danielnaber.de/morphologie/morphy-export-20110722.tar.gz) de 368175 formes 
(pas 431000 comme &#233;crit sur la page Web), soit environ 76000 lemmes, qui donne les 
lemmes r&#233;sultant de l&#8217;analyse des formes (et aucun autre attribut). Malheureusement, pr&#232;s 
de 90% des lemmes propos&#233;s sont faux. Voici un exemple. 
!&quot;#$%&amp; '%$$%&amp; !&quot;#$%&amp; '%$$%&amp;
()*+,-.-/0-12-332-4&amp; ()*+,-.-/0-12-332&amp; ()*+,-.-/0-12-332-+&amp; ()*+,-.-/0-12-332&amp;
()*+,-.-/0-12-332-/&amp; ()*+,-.-/0-12-332&amp; ()*+,-.-/0-12-332-12-4&amp; ()*+,-.-/0-12-332&amp;
5)*+,-.-/0-12-332-/&amp; 5)*+,-.-/0-12-332-&amp; ()*+,-.-/0-12-332-12-/&amp; ()*+,-.-/0-12-332&amp;
()*+,-.-/0-12-332-+-4&amp; ()*+,-.-/0-12-332&amp; ()*+,-.-/0-12-332-12-+&amp; ()*+,-.-/0-12-332&amp;
()*+,-.-/0-12-332-+-/&amp; ()*+,-.-/0-12-332&amp; ()*+,-.-/0-12-332-12-1&amp; ()*+,-.-/0-12-332&amp;
5)*+,-.-/0-12-332-+-/&amp; 5)*+,-.-/0-12-332-+-&amp; ()*+,-.-/0-12-332-12-&amp; ()*+,-.-/0-12-332&amp;
()*+,-.-/0-12-332-+-+&amp; ()*+,-.-/0-12-332&amp; ()*+,-.-/0-12-332-1&amp; ()*+,-.-/0-12-332&amp;
()*+,-.-/0-12-332-+-1&amp; ()*+,-.-/0-12-332&amp; ()*+,-.-/0-12-332-&amp; ()*+,-.-/0-12-332&amp;
()*+,-.-/0-12-332-+-&amp; ()*+,-.-/0-12-332&amp; ()*+,-.-/0-12-332&amp; ()*+,-.-/12-33-/&amp;&amp;&amp;&amp;&amp;67&amp;1-)3&amp;+81)3292&amp;:;++-:2&amp;
</p>
<p>Le lemme de toutes ces formes devrait &#234;tre le verbe &quot;zufriedenstellen&quot; (satisfaire), et 
certainement pas le participe pass&#233; passif (&quot;zufriedengestellt&quot; et sa flexion). Il faudrait aussi 
indiquer que la &quot;particule&quot; est ici &quot;zufrieden-&quot; et pas &quot;zu-&quot; dans la notation du lemme, faute de 
quoi on pourrait reconna&#238;tre la forme impossible zugefriedenstellt. Avec &quot;Zufriedengestellte&quot;, 
c'est comme si on disait en fran&#231;ais que &quot;Comprise&quot; est un nom9 et que c&#8217;est le lemme de 
&quot;comprises&quot; (alors que c'est &quot;comprendre-V&quot; ou &quot;compris-Adj&quot;). Enfin, &quot;Zufriedengestelltere&quot; 
donn&#233; comme lemme pour la forme &quot;Zufriedengestellteren&quot;, est doublement impossible, 
car (1) &#231;a veut dire &quot;plus satisfait&quot;, au f&#233;minin singulier, ou, en forme &quot;forte&quot; au nominatif et 
&#224; l'accusatif pluriel aux 3 genres, alors qu&#8217;un lemme adjectival est au nominatif masculin 
singulier, et surtout, (2) la majuscule &#224; l'initiale est impossible dans la d&#233;notation d'un 
lemme non nominal. Sans doute ce mot est-il apparu dans le corpus en d&#233;but de phrase. Il y 
a une AM &#233;crite en Kimmo (http://www2.lingsoft.fi/doc/gercg/NODALIDA-poster.html). Elle aussi 
n'est vraiment pas satisfaisante. De plus, il est dit qu&#8217;elle traite bien les mots compos&#233;s, mais 
c&#8217;est inexact. Voici le r&#233;sultat pour &quot;*wortformerkennung&quot; = &quot;reconnaissance de la forme d'un 
mot&quot;. L&#8217;&#233;toile &#8216;*&#8217;  est une bascule minuscule!majuscule, comme dans notre transcription. 
</p>
<p>&lt;=&gt;?;+2*;+4-+@-//)/07&lt;&amp; &amp; &amp; &amp;
&amp;&amp;&amp;A&gt;?;+2B*;+4B-+C@-//D)/0&lt;&amp; E&amp;!%$&amp;EF&amp;G&quot;$&amp; &amp;&amp;&amp;A&gt;?;+2B*;+4D-+B@-//D)/0&lt;&amp; E&amp;!%$&amp;EF&amp;G&quot;$&amp;
&amp;&amp;&amp;A&gt;?;+2B*;+4B-+C@-//D)/0&lt;&amp; E&amp;!%$&amp;EF&amp;HII&amp; &amp;&amp;&amp;A&gt;?;+2B*;+4D-+B@-//D)/0&lt;&amp; E&amp;!%$&amp;EF&amp;HII&amp;
&amp;&amp;&amp;A&gt;?;+2B*;+4B-+C@-//D)/0&lt;&amp; E&amp;!%$&amp;EF&amp;JHK&amp; &amp;&amp;&amp;A&gt;?;+2B*;+4D-+B@-//D)/0&lt;&amp; E&amp;!%$&amp;EF&amp;JHK&amp;
&amp;&amp;&amp;A&gt;?;+2B*;+4B-+C@-//D)/0&lt;&amp; E&amp;!%$&amp;EF&amp;F%G&amp; &amp;&amp;&amp;A&gt;?;+2B*;+4D-+B@-//D)/0&lt;&amp; E&amp;!%$&amp;EF&amp;F%G&amp;
</p>
<p>                                                   
7 ATEF traite une suite d&#8217;occurrences, avec un contexte de 4 occurrences avant et 1 apr&#232;s, et sa sortie est un arbre d&#233;cor&#233;. 
8 Sauf peut-&#234;tre avec NooJ, mais nous n&#8217;avons pas pu avoir de d&#233;tails. 
9 En allemand, les noms communs ont une majuscule &#224; l&#8217;initiale. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>757 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cette AM ne produit rien sur les parties du mot compos&#233;, m&#234;me pas le lemme du dernier 
morceau (c'est &quot;Erkennung&quot; = reconnaissance ou &quot;erkennen&quot; = reconna&#238;tre, selon qu'on veut 
comme UL un lemme ou une famille d&#233;rivationnelle). La couverture annonc&#233;e de 60000 
formes parait tr&#232;s petite (pas plus de 20000 lemmes)10. Il y a aussi SMOR, propos&#233; par 
l&#8217;universit&#233; de Stuttgart et construit sur Stuttgart fst lib (www.ims.uni-stuttgart.de/projekte 
/gramotron/PAPERS/LREC04/smor.pdf). Mais sa limitation &#224; un seul pr&#233;fixe est r&#233;dhibitoire : il 
faut en permettre plusieurs pour analyser correctement l'allemand. De plus, son traitement 
des mots compos&#233;s est pr&#233;sent&#233; par ses auteurs comme non satisfaisant.  
Si l&#8217;on regarde l&#8217;existant &#171; acad&#233;mique &#187;, on ne trouve donc rien qui r&#233;ponde &#224; nos attentes, 
tant au niveau des r&#233;sultats produits que des r&#233;sultats productibles. Il existe certainement de 
bonnes AM de l&#8217;allemand dans les syst&#232;mes commerciaux de TA, mais ils ne sont pas 
utilisables librement comme des modules s&#233;par&#233;s. On ne peut estimer leur qualit&#233; 
qu&#8217;indirectement, par traduction, et seulement sur les mots compos&#233;s. Ainsi, ProMT traduit 
&quot;Hauptbahnhofgep&#228;ckaufbewahrung&quot; par &quot;Central station checkroom&quot;, et pour &#231;a il a fallu ne pas 
segmenter en les plus petits atomes, soit &quot;Haupt-bahn-hof-gep&#228;ck-auf-bewahrung&quot; (sans s&#233;parer 
les pr&#233;fixes). Il a fallu consid&#233;rer des morceaux plus longs, comme &quot;bahnhof&quot;, sans consid&#233;rer 
le possible &quot;Hauptbahn&quot; (voie principale), et &quot;gep&#228;ckaufbewahrung&quot; (consigne &#224; bagages). 
&quot;Bahnhofgep&#228;ck&quot;  serait aussi possible&#8230; Pour bien traiter les mots compos&#233;s allemands, il 
faut au moins pouvoir produire plusieurs solutions, et &#233;liminer des sous-d&#233;coupages, et/ou 
calculer des scores pour ne produire que les solutions assez bien not&#233;es. 
3 Br&#232;ve pr&#233;sentation des outils utilis&#233;s 
Faute de place, il n&#8217;est pas possible de d&#233;crire pr&#233;cis&#233;ment le fonctionnement des LSPL 
utilis&#233;s (ATEF, EXPANS, ROBRA). D&#233;crivons seulement ce que sont les composants des 
linguiciels qu&#8217;ils permettent d&#8217;&#233;crire. Les variables sont les attributs d&#233;clar&#233;s par le linguiste. 
Une combinaison de valeurs des variables d&#233;clar&#233;es est une d&#233;coration. Les formats sont des 
d&#233;corations constantes, souvent utilis&#233;es comme des classes morphologiques ou syntaxiques. 
Les tournures sont des suites d&#8217;occurrences, le seul s&#233;parateur d&#8217;occurrences &#233;tant le blanc. 
Un article d&#8217;un dictionnaire de bases ou de tournures contient 2 formats dits morphologique 
(FTM) et syntaxique (FTS), ces termes n&#8217;&#233;tant que mn&#233;moniques), et une UL. Un article d&#8217;un 
dictionnaire d&#8217;affixes ne contient pas d&#8217;UL. Un article d&#8217;un dictionnaire d&#8217;expansion lexicale 
(EXPANS) permet de transformer un n&#339;ud de l&#8217;arbre en entr&#233;e en un sous-arbre de l&#8217;arbre 
produit en sortie. Enfin, les r&#232;gles transformationnelles de ROBRA permettent de reconna&#238;tre 
des sch&#233;mas de sous-arbres et de transformer leurs occurrences.  
L&#8217;AM de l&#8217;allemand de d&#233;part, &#233;crite en ATEF seul, &#233;tait parfaite &#224; 100% sur sa couverture. 
AMALD utilise 3 phases d&#8217;Ariane-G5 abr&#233;g&#233;es en AM (AM1/atef), AX (AM2/expans), et AS 
(AM3/robra). AM produit des lemmes &#224; partir des formes fl&#233;chies, et leur attache les 
informations morphosyntaxiques. AX produit les UL classiques (familles d&#233;rivationnelles), et 
leur attache les informations syntaxo-s&#233;mantiques. En AS, on &#233;crit des r&#232;gles qui ont acc&#232;s 
au contexte de toute la phrase (et m&#234;me de tout le texte trait&#233; comme une unit&#233; de 
traduction), et on peut ainsi regrouper les mots ou expressions compos&#233;s non connexes. 
</p>
<p>4 Principes linguistiques de l&#8217;analyseur morphologique AMALD 
Nous convenons que toute occurrence (mot typographique) d'un texte est une forme fl&#233;chie 
d'un lemme (ce qui impose l&#8217;existence d&#8217;une d&#233;sinence nulle). Une occurrence est constitu&#233;e 
                                                   
10 Mais il y a peut-&#234;tre une erreur de terminologie dans la description, puisque par ailleurs il est dit qu'il y a &quot;tous les mots du 
Collins&quot; (das komplette Sprachmaterial des Deutsch-Englischen W&#246;rterbuchs von Collins (The Collins German Dictionary, 
Neubearbeitung 1991, Copyright HarperCollins Publishers)). Or le Collins a au moins 50000 &#224; 70000 entr&#233;es. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>758 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d'une suite ordonn&#233;e d'affixes ou infixes (morphes11 grammaticaux) et d'une ou, dans le cas 
des mots compos&#233;s, de plusieurs bases lexicales (ou radicaux). Le moteur d&#8217;ATEF cherche &#224; les 
reconna&#238;tre en consultant des dictionnaires qui contiennent toutes les bases lexicales et tous 
les morphes grammaticaux de la langue. La consultation des dictionnaires, r&#233;gie par une 
grammaire (compil&#233;e vers un transducteur fini &#233;tendu), permet de d&#233;couper les mots du 
texte et de les interpr&#233;ter en leur affectant des valeurs de classe, cas, genre, nombre, 
personne, etc. Les affixes sont des pr&#233;fixes, des suffixes de d&#233;rivation ou des d&#233;sinences de 
flexion ; les infixes sont des morphes qui relient l'une &#224; l'autre les bases lexicales d'un mot 
compos&#233; (ex. Handlungsfreiheit, libert&#233; d&#8217;action). Un lemme a un ou plusieurs radicaux. S'il en 
a plusieurs, il s'agit d'allomorphes qui sont en variation libre ou en distribution 
compl&#233;mentaire. Chaque radical rel&#232;ve d'un paradigme flexionnel (morph&#232;me). L'extension du 
paradigme est la liste des d&#233;sinences possibles pour le radical. Chaque d&#233;sinence est un 
morphe qui renvoie &#224; un ou plusieurs morph&#232;mes, selon la strat&#233;gie d'analyse choisie. 
Exemple : lemme &quot;singen&quot;, chanter 
</p>
<p>Radicaux :  sing-, sang-, s&#228;ng-, gesungen- ;  
Paradigmes flexionnels :  FCPPA (gesungen-), WGAEB (s&#228;ng-), WGAB (sang-), WSING (sing-) 
Les d&#233;sinences de WGAEB et 
leurs morph&#232;mes associ&#233;s sont :  
</p>
<p>-e (1WAERE), -en (1WAEREN), -est (1WAERST), -et (1WAERET),  
-st (1WAERST)  
</p>
<p>Morph&#232;me 1WAERE :  1&#232;re ou 3&#232;me personne du singulier du subjonctif II ; 
Morph&#232;me 1WAEREN :  1&#232;re ou 3&#232;me personne du pluriel du subjonctif II ; 
Morph&#232;me 1WAERET :  2&#232;me personne du pluriel du subjonctif II ; 
Morph&#232;me 1WAERST :  2&#232;me personne du singulier du subjonctif II. 
</p>
<p>Dans la th&#233;orie &#224; la base de ce syst&#232;me, tout lemme appartient &#224; une famille d&#233;rivationnelle 
appel&#233;e UL (unit&#233; lexicale), not&#233;e le plus souvent en combinant la cha&#238;ne du lemme source de 
cette famille et sa cat&#233;gorie. Un lemme est ainsi caract&#233;ris&#233; par une valeur d'UL, sa classe 
morphosyntaxique (nom, verbe, etc.), et aussi par une valeur de d&#233;rivation s'il est d&#233;riv&#233; 
d'un autre ou consid&#233;r&#233; comme tel.      Une des caract&#233;ristiques essentielles de l&#8217;allemand est 
de pouvoir cr&#233;er tr&#232;s facilement de nouveaux mots par agglutination de lemmes simples ou 
d&#233;j&#224; compos&#233;s. Chaque locuteur peut ainsi cr&#233;er librement de nouveaux mots. Dans un mot 
compos&#233;, le d&#233;terminant pr&#233;c&#232;de toujours le d&#233;termin&#233; (ordre centrip&#232;te des &#233;l&#233;ments de 
signification). Il peut y avoir parfois un infixe sp&#233;cial ('s', 'e', 'en') entre les composants. Dans 
notre analyseur, un mot compos&#233;, quand il n'est pas trouv&#233; dans les dictionnaires comme 
tel, parce qu'il n'est pas consid&#233;r&#233; comme un terme ou qu'il n'a pas encore &#233;t&#233; index&#233;12, est 
d&#233;coup&#233; en ses &#233;l&#233;ments constitutifs simples trouv&#233;s dans les dictionnaires. AMALD travaille 
sur une transcription minimale13, utilisant seulement les lettres majuscules, et des s&#233;quences 
sp&#233;ciales pour la mise en majuscule (&#8216;*&#8217; pour la lettre suivante, &#8216;**&#8217; pour la suite du mot 
jusqu&#8217;&#224; un autre &#8216;**&#8217;) et pour les diacritiques (!1 : &#180;, !2 : `, !3 : ^, !4 : &#168;, !5 : c&#233;dille).  
En allemand, comme en fran&#231;ais, les verbes peuvent avoir des pr&#233;fixes ins&#233;parables (ex. 
allemand : empfangen ! fangen (recevoir ! attraper) ; fran&#231;ais : d&#233;tourner ! tourner). Mais, &#224; la 
diff&#233;rence du fran&#231;ais, ils peuvent aussi avoir des particules s&#233;parables. Ces pr&#233;fixes, dans 
certains contextes, peuvent &#234;tre soit s&#233;par&#233;s de la base par des infixes tout en restant 
agglutin&#233;s, soit &#234;tre d&#233;plac&#233;s en fin de proposition ou de phrase (ex: auffangen, aufgefangen, 
aufzufangen, f&#228;ngt....auf, [r]attraper). On ne peut alors plus identifier correctement en AM le 
compos&#233; verbal, et c&#8217;est la phase (pr&#233;-syntaxique) AS (AM3/robra) ult&#233;rieure qui le fait. 
                                                   
11 Un morphe est une cha&#238;ne de caract&#232;res pertinente pour l&#8217;analyse de la langue consid&#233;r&#233;e. 
12 Les premiers chercheurs en TA ont utilis&#233; &#171; indexer &#187; pour signifier &#171; inclure dans un dictionnaire d&#8217;un module de TALN &#187;. 
13 Cela permet de diviser par 3 ou 4 la taille des dictionnaires de bases et pr&#233;fixes, et de traiter le Umlaut en tant que tel. Un 
transcripteur permet de partir d&#8217;un texte &#233;crit normalement, de fa&#231;on transparente. Des transcriptions similaires, r&#233;versibles et 
pronon&#231;ables, ont &#233;t&#233; d&#233;finies et utilis&#233;es pour le russe, l&#8217;arabe, le chinois, le tha&#239;, le vietnamien&#8230;, et m&#234;me pour le japonais.  
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>759 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exemple de r&#233;sultat :  
mot compos&#233; index&#233; mot compos&#233; non index&#233; 
</p>
<p>  
</p>
<p>4 '*ENGELMACHERIN': 
UL('*ENGELMACHERIN'), KMS(NM), 
SUBN(IP), PSG(3), 
CSFB(NOM,ACC,DAT,GEN), TYPO(MJ1), 
GNR(F) 
(faiseuse d&#8217;anges) 
</p>
<p>5 '*BEDEUTUNGS': UL('BEDEUTEN-V'), KMS(NM), 
SUBN(IP), PSG(3), VERB(GE,UN), CSFB(GEN), TYPO(MJ1), 
GNR(F), DRV (VN2), SUBV (HAB), VAL1(ACC), VAL2A(ACC), 
VAL2B(FUER) 
6 'UNTERSCHIED': UL('*UNTERSCHIED'), KMS(NM), 
SUBN(IP), PSG(3), CSMB(NOM,ACC,DAT), TYPO(MJ1), 
GNR(M)  (diff&#233;rence de signification) 
</p>
<p>FIGURE 1 : sous-arbres produits pour des mots compos&#233;s 
La particule s&#233;parable est toujours agglutin&#233;e au verbe lorsqu&#8217;il est gouverneur d'une 
subordonn&#233;e, et seulement &#224; l'infinitif, au participe pass&#233; ou au participe pr&#233;sent dans les 
autres cas. Nous traitons toutes les formes verbales agglutin&#233;es en leur affectant 
imm&#233;diatement l'UL d&#233;finitive, celle du compos&#233;. Nous indexons donc dans les dictionnaires 
de bases lexicales toutes les bases pr&#233;fix&#233;es.  
Exemple zutr&#228;gst :  
</p>
<p>Dictionnaire R&#233;sultat d'analyse 
base lexicale FTM FTS UL 
</p>
<p> 
</p>
<p>ZUGETRAGEN ==FCPPA   (HA3    ,ZUTRAGEN-V ). 
ZUTRA!4G ==YGRAEB  (HA3    ,ZUTRAGEN-V ). 
ZUTRAG ==YGRAB   (HA3    ,ZUTRAGEN-V ). 
ZUTRU!4G ==YGAEB   (HA3    ,ZUTRAGEN-V ). 
ZUTRUG ==YGAB   (HA3    ,ZUTRAGEN-V ). 
ZUZUTRAG ==FCINFZU  (HA3    ,ZUTRAGEN-V ). 
</p>
<p>FIGURE 2 : sous-arbre pour un verbe &#224; particule s&#233;parable &#224; formes pr&#233;fix&#233;es index&#233;es dans le dictionnaire 
</p>
<p>Dans les exemples ci-dessus et ci-dessous, les formes pr&#233;fix&#233;es du lemme zutragen (se faire, 
arriver) sont index&#233;es, mais pas celles du lemme emportragen (&#233;lever, porter en haut), pour 
lesquelles l'AM fabrique donc un mot compos&#233;. 
Exemple emportr&#228;gst :  
</p>
<p>Dictionnaire R&#233;sultat d'analyse 
base lexicale FTM FTS UL 
</p>
<p> 
</p>
<p>EMPOR ==PARTSEP (VID ,EMPOR   ). 
EMPOR ==FERD7E (BNIP    ,*EMPORE ). 
TRA!4G ==WGRAEB (HABA    ,TRAGEN-V ). 
TRAG ==WGRAB (HABA    ,TRAGEN-V ). 
TRU!4G ==WGAEB (HABA    ,TRAGEN-V ). 
TRUG ==WGAB (HABA    ,TRAGEN-V ). 
</p>
<p>FIGURE 3 : sous-arbre pour un verbe &#224; particule s&#233;parable &#224; formes pr&#233;fix&#233;es non index&#233;es dans le dictionnaire 
Lorsque la particule n'est pas agglutin&#233;e au verbe (par exemple &quot;auf&quot; du verbe &quot;aufstehen&quot; 
dans la phrase &quot;Er steht jeden Morgen um f&#252;nf Uhr auf&quot;), une r&#232;gle (&#233;crite en AS=AM3/robra) 
permet d&#8217;aller la chercher en fin de proposition, comme dernier mot de celle-ci, avant une 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>760 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#233;ventuelle subordonn&#233;e, ou bien devant un syntagme g&#233;n&#233;ralement introduit par les 
conjonctions &quot;wie&quot; ou &quot;als&quot; ou encore par une pr&#233;position.  
Pour la regrouper avec le verbe simple, on passe d&#8217;abord par un dictionnaire (&#233;crit en 
AX=AM2/expans), dans lequel on accumule les UL des verbes simples qui acceptent une 
particule s&#233;parable. &#192; chacune de ces UL, le dictionnaire associe, en partie droite, un sous-
arbre ayant autant de feuilles qu'il y a de combinaisons possibles de type particule + verbe 
simple. Chaque feuille a dans sa d&#233;coration la valeur d'UL qui correspond &#224; la combinaison, 
et une valeur de variable codant la particule. En AS, l&#8217;ex&#233;cution d&#8217;une r&#232;gle trouvant une 
particule s&#233;parable met le sous-arbre correspondant &#224; la place du verbe simple et efface les 
n&#339;uds correspondant aux autres particules candidates. 
Exemple d'entr&#233;e de dictionnaire EXPANS (en AX = AM2/expans) : 
'TRAGEN-V' ==/0(01,02,03,05,06,07,08,09)/ 
 01 : 'ABTRAGEN-V', +AB; 02 : 'AUFTRAGEN-V', +AUF; 
 03 : 'AUSTRAGEN-V', +AUS; 04 : 'EINTRAGEN-V', +EIN; 
 05 : 'EMPORTRAGEN-V', +EMPOR; 06 : 'NACHTRAGEN-V', +NACH; 
 07 : 'VORTRAGEN-V', +VOR; 08 : 'ZUTRAGEN-V', +ZU; 
 09 : 'ZUSAMMENTRAGEN-V', +ZUSAMMEN.  
FIGURE 4 : entr&#233;e d&#8217;un dictionnaire EXPANS (en AX) pour le verbe &#8216;tragen&#8217; (porter) et ses verbes compos&#233;s 
</p>
<p>Exemple de r&#232;gle ROBRA (en AS = AM3/robra) : 
R1PSEP: (FRA,&amp;NIV=1) FRA(VC($L1,PSEP1(NEWVC),$L2),$L,PSEP2,*,PONC,*) 
    / FRA: $ULFRA; VC: $VCONJ; PONC: $PONC; PSEP1: $PSEP; PSEP2: $PSEP  
    / $IDUL(PSEP1,PSEP2) ** Particule pr&#233;dite = trouv&#233;e: garder le compos&#233;. 
 == FRA(VC,$L,PONC)  /*&lt;--PSEP1,PSEP2,NEWVC/ VC:NEWVC. ** Effacer le reste. 
</p>
<p>FIGURE 5 : r&#232;gle ROBRA (en AS) pour la recherche de particule et l&#8217;association au verbe 
</p>
<p>5 Couverture et qualit&#233; 
AMALD a &#233;t&#233; port&#233;e sur H&#233;lo&#239;se (version en C/C++ des LSPL d&#8217;Ariane-G5 et moniteur 
Web, cr&#233;&#233;s par Vincent Berment). Elle comprenait (au 17/5/2013) 149155 lignes de 
composants linguiciels (variables, formats, dictionnaires, grammaires), avec 102243 unit&#233;s 
lexicales (des lemmes dans ce syst&#232;me), dont 11147 verbes, 85038 noms, 5368 adjectifs, 
156 mots-outils, 235 particules s&#233;parables, et 29 tournures fig&#233;es connexes. Cela correspond 
&#224; environ  480000 formes fl&#233;chies simples14.  
Le traitement des mots simples et compos&#233;s est presque parfait, par rapport aux objectifs 
classiques15. Notre nouvel objectif, au niveau linguistique, est maintenant de r&#233;aliser une 
analyse syntaxique interne des mots compos&#233;s, en ajoutant un traitement (en ROBRA) sur 
les sous-arbres de racine &#8216;ULMCP&#8217;. On atteindrait alors la limite d&#8217;une AM de l&#8217;allemand. 
Le traitement des formes &#224; particule s&#233;par&#233;e des verbes &#224; particules s&#233;parables est correct 
sur les nombreux exemples que nous avons trait&#233;s, m&#234;me quand la distance entre le verbe et 
la particule est grande, et m&#234;me si la particule est homographe d&#8217;une pr&#233;position et si la 
phrase comporte une ou des occurrences de cette pr&#233;position, avant et/ou apr&#232;s la particule.  
Voici un exemple artificiel (il arrive avec les cartes coll&#233;es au mur pour se venger de nous), o&#249; il 
y a trois occurrences du mot an. La seconde est correctement reconnue comme la particule 
s&#233;parable du verbe kommen. Pour cela, on n&#8217;a pas d&#251; construire de groupes ni de relations 
syntaxiques, il a suffi d&#8217;examiner le contexte form&#233; par les n&#339;uds fr&#232;res et leurs fils).  
                                                   
14 Il y a en moyenne 7 formes par verbe, 4 par nom, 12 par adjectif. L&#8217;ensemble des mots compos&#233;s reconnus est ouvert. 
15 On &#233;value la qualit&#233; sur la couverture courante par &#233;chantillonnage pour la mise au point, puis exhaustivement. On l&#8217;a aussi 
test&#233;e sur de grandes parties de la liste des formes du dictionnaire Morphy, et on travaille &#224; une &#233;valuation exhaustive. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>761 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 
FIGURE 6 : AS : Er kommt mit den an den W&#228;nden angeklebten Karten an,  
</p>
<p>um sich an uns zu r&#228;chen. 
Un service Web utilisable librement a &#233;t&#233; cr&#233;&#233; par V. Berment &#224; l&#8217;url: http://www.taranis-
software.com/Heloise/ALD/Heloise.htm. Un exemple d&#8217;&#233;cran de ce serveur est donn&#233; en annexe. 
On voit que kommt&#8230;an a &#233;t&#233; regroup&#233; dans un n&#339;ud, avec le lemme ANKOMMEN-V. 
</p>
<p>6 Conclusion et perspectives  
Nous avons donc atteint deux des trois buts fix&#233;s au d&#233;part (qualit&#233;, et traitement des 
particules s&#233;parables s&#233;par&#233;es). Quant &#224; la couverture, il nous reste &#224; passer de pr&#232;s de 
103000 &#224; 200000 entr&#233;es (celles du Duden, cf. http://www.duden.de/). Ce travail devrait &#234;tre 
achev&#233; fin 2013. En parall&#232;le, (1) l&#8217;am&#233;lioration de la grammaire d&#8217;AM continue, surtout 
pour le traitement des substantifs et des verbes, et (2) le service Web AMALD est disponible. 
Nous esp&#233;rons qu&#8217;il sera utilis&#233; par les chercheurs et par d&#8217;autres, comme base 
d&#8217;exp&#233;rimentation permettant de passer &#224; l&#8217;&#233;chelle. Nous avons aussi commenc&#233; &#224; travailler 
sur la production d&#8217;une structure arborescente interne des mots compos&#233;s.  
Remerciements 
Nos remerciements vont &#224; l&#8217;ANR, pour son soutien au projet &#201;mergence Traouiero qui a 
motiv&#233; la reprise et l&#8217;op&#233;rationnalisation de notre analyseur morphologique de l&#8217;allemand.  
R&#233;f&#233;rences 
BROCKHAUS K. (1971) Automatische &#220;bersetzung. Untersuchungen am Beispiel des Sprachen 
Englisch und Deutsch. Ed. Braunschweig. 
BROCKHAUS K. (1976) Das &#220;bersetzungssystem SALAT. Teilprojekt A 2 Automatische &#220;bersetzung 
(Universit&#228;t Heidelberg). Forschungsbericht 1. 11.1973&#8212;31.3.1976. I. und II. SFB 99 Linguistik, 
Universit&#228;t Konstanz, 1976. 
DUDEN (2012) Duden online, http://www.duden.de/ 
GUILBAUD J.-P. (1981) Analyse morphologique de l'allemand en vue de la traduction par ordinateur de textes 
techniques sp&#233;cialis&#233;s. Th&#232;se de 3&#232;me cycle, Universit&#233; de Paris III, juin 1981, 240 p. (recherche men&#233;e 
au GETA, Grenoble). 
GUILBAUD J.-P. (1984) Principles and results of a German-French MT system. In &quot;Machine Translation 
today: the state of the art&#8221; (Proc. third Lugano Tutorial, 2&#8211;7 April 1984), M. King, ed., Edinburgh 
University Press (1987).  
GUILBAUD J.-P. (1986) Variables et cat&#233;gories grammaticales dans un mod&#232;le ARIANE. Proc. COLING-86, 
Bonn, ao&#251;t 1986, IKS, ACL, ed., pp. 405&#8212;407.  
RAPP, Reinhard; Lezius, Wolfgang (2001) Statistische Wortartenannotierung f&#252;r das Deutsche. Sprache 
und Datenverarbeitung 25(2):5-21. 
LEZIUS, Wolfgang (2000) Morphy - German Morphology, Part-of-Speech Tagging and Applications, in Ulrich 
Heid; Stefan Evert; Egbert Lehmann and Christian Rohrer, editors, Proc. 9th EURALEX International 
Congress, pp. 619-623, Stuttgart, Germany.   
LEZIUS, Wolfgang; Rapp, Reinhard; Wettler, Manfred (1998) A Freely Available Morphological Analyzer, 
Disambiguator, and Context Sensitive Lemmatizer for German, in Proc. COLING-ACL 1998, pp. 743-747.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>762 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>   
ANNEXE : SITE D&#8217;EXP&#201;RIMENTATION http://www.taranis-software.com/Heloise/ALD/Heloise.htm 
</p>
<p> 
FIGURE 7 : Plate-forme de d&#233;monstration de l'analyseur AMALD de l'allemand 
</p>
<p>!&quot;#$%&amp; '%$$%&amp; !&quot;#$%&amp; '%$$%&amp;
()*+,-.-/0-12-332-4&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332-+&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
()*+,-.-/0-12-332-/&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332-12-4&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
5)*+,-.-/0-12-332-/&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332-12-/&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
()*+,-.-/0-12-332-+-4&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332-12-+&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
()*+,-.-/0-12-332-+-/&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332-12-1&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
5)*+,-.-/0-12-332-+-/&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332-12-&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
()*+,-.-/0-12-332-+-+&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332-1&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
()*+,-.-/0-12-332-+-1&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332-&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
()*+,-.-/0-12-332-+-&amp; 56!#7%8%9:;&lt;%''%9:=&amp; ()*+,-.-/0-12-332&amp; 56!#7%8%9:;&lt;%''%9:=&amp;
</p>
<p>FIGURE 8 : lemmes produits par l'analyseur AMALD sur les exemples donn&#233;s pour Morphy 
!&quot;#$%&amp; '()&quot;#*+,&quot;-&amp;
()*+,-.-/0-12-332-4&amp; 6'&gt;?56!#7%8%9:;&lt;%''%9:=?@A&amp;8#=&amp;&gt;=BC@A&amp;;6D=&amp;&gt;EBD@A&amp;F$;&gt;=DAB8G@A&amp;;6DB8G&gt;#;&lt;B@A&amp;$&lt;&gt;HHB@A&amp;I;$&lt;&gt;8B&lt;@A&amp;
</p>
<p>I;9&lt;&gt;8B&lt;@A&amp;7I&gt;J@A&amp;=B'K&gt;BII@&amp;
()*+,-.-/0-12-332-/&amp; 6'&gt;?56!#7%8%9:;&lt;%''%9:=?@A&amp;8#=&amp;&gt;=BC@A&amp;;6D=&amp;&gt;EBD@A&amp;F$;&gt;=DAB8G@A&amp;;6DB8G&gt;#;&lt;B@A&amp;$&lt;&gt;HHB@A&amp;
</p>
<p>I;$&lt;&gt;BIIAL%9@A&amp;I;9&lt;&gt;L%9@A&amp;IH&lt;&gt;8B&lt;@A&amp;I;$D&gt;BIIA8B&lt;AL%9@A&amp;I;!D&gt;8B&lt;AL%9@A&amp;I;9D&gt;8B&lt;AL%9@A&amp;
IHD&gt;9&quot;$ABIIA8B&lt;AL%9@A&amp;7I&gt;J@A&amp;=B'K&gt;BII@&amp;
</p>
<p>5)*+,-.-/0-12-332-/&amp; 6'&gt;?56!#7%8%9:;&lt;%''%9:=?@A&amp;8#=&amp;&gt;=BC@A&amp;F$;&gt;B8G@A&amp;;6DB8G&gt;9$%M@A&amp;I;$&lt;&gt;BIIAL%9@A&amp;I;9&lt;&gt;L%9@A&amp;IH&lt;&gt;8B&lt;@A&amp;
I;$D&gt;BIIA8B&lt;AL%9@A&amp;I;!D&gt;8B&lt;AL%9@A&amp;I;9D&gt;8B&lt;AL%9@A&amp;IHD&gt;9&quot;$ABIIA8B&lt;AL%9@A&amp;7I&gt;J@A&amp;&lt;NH&quot;&gt;$GK@&amp;
</p>
<p>()*+,-.-/0-12-332-+&amp; 6'&gt;?56!#7%8%9:;&lt;%''%9:=?@A&amp;8#=&amp;&gt;=BC@A&amp;;6D=&amp;&gt;EBD@A&amp;F$;&gt;=DAB8G@A&amp;;6DB8G&gt;#;&lt;B@A&amp;$&lt;&gt;HHB@A&amp;I;$&lt;&gt;9&quot;$@A&amp;
I;!&lt;&gt;8B&lt;AL%9@A&amp;IH&lt;&gt;L%9@A&amp;7I&gt;KAJ@A&amp;8%L&gt;IH@A&amp;=B'K&gt;BII@&amp;
</p>
<p>()*+,-.-/0-12-332-12-1&amp; 6'&gt;?56!#7%8%9:;&lt;%''%9:=?@A&amp;8#=&amp;&gt;=BC@A&amp;;6D=&amp;&gt;EBD@A&amp;F$;&gt;=DAB8G@A&amp;;6DB8G&gt;#;&lt;B@A&amp;$&lt;&gt;HHB@A&amp;
I;9&lt;&gt;9&quot;$ABII@A&amp;7I&gt;J@A&amp;8%L&gt;;H@A&amp;=B'K&gt;BII@&amp;
</p>
<p>FIGURE 9 : Valeurs de tous les attributs produits par l'analyseur AMALD sur 5 de ces m&#234;mes exemples 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>763 c&#65535; ATALA</p>

</div></div>
</body></html>