<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Utilisation de la similarit&#233; s&#233;mantique pour l&#8217;extraction de lexiques bilingues &#224; partir de corpus comparables</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Utilisation de la similarit&#233; s&#233;mantique pour l&#8217;extraction de
lexiques bilingues &#224; partir de corpus comparables
</p>
<p>Dhouha Bouamor 1,2,3 Nasredine Semmar1 Pierre Zweigenbaum2
(1) CEA-LIST, LVIC, F91191 Gif sur Yvette Cedex, France
</p>
<p>(2) LIMSI-CNRS, F-91403 Orsay, France
(3) Univ. Paris Sud, Orsay, France
</p>
<p>dhouha.bouamor@cea.fr, nasredine.semmar@cea.fr, pz@limsi.fr
</p>
<p>R&#201;SUM&#201;
Cet article pr&#233;sente une nouvelle m&#233;thode visant &#224; am&#233;liorer les r&#233;sultats de l&#8217;approche standard
utilis&#233;e pour l&#8217;extraction de lexiques bilingues &#224; partir de corpus comparables sp&#233;cialis&#233;s. Nous
tentons de r&#233;soudre le probl&#232;me de la polys&#233;mie des mots dans les vecteurs de contexte par
l&#8217;introduction d&#8217;un processus de d&#233;sambigu&#239;sation s&#233;mantique bas&#233; sur WordNet. Pour traduire
les vecteurs de contexte, au lieu de consid&#233;rer toutes les traductions propos&#233;es par le dictionnaire
bilingue, nous n&#8217;utilisons que les mots caract&#233;risant au mieux les contextes en langue cible.
Les exp&#233;riences men&#233;es sur deux corpus comparables sp&#233;cialis&#233;s fran&#231;ais-anglais (financier
et m&#233;dical) montrent que notre m&#233;thode am&#233;liore les r&#233;sultats de l&#8217;approche standard plus
particuli&#232;rement lorsque plusieurs mots du contexte sont ambigus.
</p>
<p>ABSTRACT
</p>
<p>This paper presents a new method that aims to improve the results of the standard approach
used for bilingual lexicon extraction from specialized comparable corpora. We attempt to solve
the problem of context vector word polysemy. Instead of using all the entries of the dictionary to
translate a context vector, we only use the words of the lexicon that are more likely to give the
best characterization of context vectors in the target language. On two specialised French-English
comparable corpora, empirical experimental results show that our method improves the results
obtained by the standard approach especially when many words are ambiguous.
</p>
<p>MOTS-CL&#201;S : lexique bilingue, corpus comparable sp&#233;cialis&#233;, d&#233;sambigu&#239;sation s&#233;mantique,
WordNet.
</p>
<p>KEYWORDS: bilingual lexicon, specialized comparable corpora, semantic disambiguation, Word-
Net.
</p>
<p>1 Introduction
</p>
<p>Les lexiques bilingues sont des ressources particuli&#232;rement utiles pour la Traduction Automatique
et la Recherche d&#8217;Information Interlingue. Les recherches en extraction lexicale &#224; partir de corpus
multilingues se sont largement concentr&#233;es sur les corpus parall&#232;les. En effet, la raret&#233; de ces
corpus, en particulier pour les domaines sp&#233;cialis&#233;s et pour les couples de langues ne faisant pas
intervenir l&#8217;anglais, conduit en outre &#224; orienter les recherches en extraction de lexiques bilingues
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>327 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>vers l&#8217;utilisation de corpus comparables (Fung, 1995; Rapp, 1995; Chiao et Zweigenbaum,
2003; Gamallo Otero, 2007; Prochasson et al., 2009; Kun et Tsujii, 2009). La plupart de ces
travaux h&#233;ritent de la s&#233;mantique distributionnelle (Harris, 1954) et reposent sur la simple
observation que si dans une langue source deux mots cooccurrent plus souvent que par hasard,
alors dans un texte de langue cible, leurs traductions doivent &#233;galement cooccurrer plus souvent.
Cette approche dite standard se base sur la caract&#233;risation et la comparaison d&#8217;environnements
lexicaux des termes sources et cibles, repr&#233;sent&#233;s par des vecteurs de contexte. Ces vecteurs
stockent un ensemble d&#8217;unit&#233;s lexicales repr&#233;sentatif de leur voisinage. Dans la pratique, afin
de pouvoir comparer les vecteurs de contexte de langues diff&#233;rentes, le passage d&#8217;une langue &#224;
une autre est n&#233;cessaire et s&#8217;effectue g&#233;n&#233;ralement par l&#8217;interm&#233;diaire d&#8217;un dictionnaire bilingue
amorce.
</p>
<p>Le dictionnaire bilingue est au coeur de l&#8217;approche standard. Son utilisation pose des probl&#232;mes
lorsqu&#8217;un mot poss&#232;de plusieurs traductions, qu&#8217;il s&#8217;agisse de traductions synonymes ou d&#8217;un
terme source polys&#233;mique. Par exemple, le terme Fran&#231;ais &#8220;action&#8221; se traduit en Anglais par les
termes &#8220;share, stock, lawsuit&#8221; et &#8220;deed&#8221;. Dans ce cas, il est difficile d&#8217;&#233;valuer dans des ressources
plates comme les dictionnaires bilingues quelles traductions sont les plus pertinentes, vu qu&#8217;elle
sont le plus souvent non ordonn&#233;es. L&#8217;approche standard prend en compte toutes les traductions
disponibles et les conserve avec la m&#234;me priorit&#233; dans le vecteur traduit ind&#233;pendamment du
domaine sur lequel porte l&#8217;&#233;tude. Ainsi, en domaine de la Finance, la prise en compte des termes
&#8220;lawsuit&#8221; et &#8220;deed&#8221; ne feront probablement qu&#8217;ajouter du bruit dans les vecteurs de contexte.
</p>
<p>Dans ce pr&#233;sent travail, nous pr&#233;sentons une nouvelle approche qui tente de r&#233;soudre le probl&#232;me
de polys&#233;mie des mots non trait&#233; par l&#8217;approche standard. Un mot polys&#233;mique est une unit&#233;
lexicale ayant plusieurs sens dans une langue ou une fois traduite dans une autre langue. Nous
introduisons un processus de d&#233;sambigu&#239;sation s&#233;mantique des vecteurs de contexte construits
par l&#8217;approche standard. L&#8217;intuition qui sous-tend cette m&#233;thode est que, pour chaque mot poly-
s&#233;mique du vecteur de contexte, au lieu de consid&#233;rer toutes les traductions propos&#233;es par le
dictionnaire bilingue, nous n&#8217;utilisons que les traductions susceptibles de donner la meilleure re-
pr&#233;sentation du vecteur de contexte en langue cible. Le processus de d&#233;sambigu&#239;sation repose sur
une mesure de similarit&#233; s&#233;mantique calcul&#233;e en se basant sur le th&#233;saurus WordNet (Fellbaum,
1998). Nous testons cette m&#233;thode sur deux corpus comparables sp&#233;cialis&#233;s pour le couple des
langues fran&#231;ais-anglais. Une am&#233;lioration des r&#233;sultats de l&#8217;approche standard est report&#233;e plus
particuli&#232;rement lorsque plusieurs mot du corpus sont ambigus.
</p>
<p>La suite de l&#8217;article est organis&#233;e comme suit : dans la section 2, nous pr&#233;sentons l&#8217;approche
standard et passons en revue les principaux travaux connexes &#224; la t&#226;che d&#8217;extraction de lexiques
bilingues &#224; partir de corpus comparables. Puis, nous d&#233;crivons, dans la section 3, le processus
de d&#233;sambigu&#239;sation s&#233;mantique propos&#233;. La section 4 sera consacr&#233;e aux exp&#233;riences men&#233;es
ainsi qu&#8217;&#224; la pr&#233;sentation des r&#233;sultats obtenus. Notre article se conclura par une pr&#233;sentation
des principales perspectives (section 5).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>328 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Extraction de lexiques bilingues
</p>
<p>2.1 Approche standard
</p>
<p>La plupart des travaux traitant la t&#226;che d&#8217;extraction de lexiques bilingues &#224; partir de corpus
comparables se basent sur l&#8217;approche standard (Fung, 1998; Chiao et Zweigenbaum, 2002;
Laroche et Langlais, 2010). Cette approche se d&#233;compose en trois &#233;tapes :
</p>
<p>&#8211; Constitution des vecteurs de contexte : Ces vecteurs sont d&#8217;abord extraits en rep&#233;rant les
mots qui apparaissent autour d&#8217;un terme &#224; traduire S dans une fen&#234;tre contextuelle de n mots.
Habituellement, des mesures d&#8217;associations comme l&#8217;information mutuelle (Morin et Daille,
2006), le taux de vraisemblance (Morin et Prochasson, 2011) ou encore le rapport des chances
(odds-Ratio) (Laroche et Langlais, 2010) sont utilis&#233;es pour d&#233;finir les entr&#233;es du vecteur de
contexte.
</p>
<p>&#8211; Transfert des vecteurs de contexte : Afin de rendre possible la comparaison des vecteurs
sources et cibles, les vecteurs des termes sources sont traduits par le biais d&#8217;un dictionnaire
bilingue amorce. Si le dictionnaire propose plusieurs traductions pour un &#233;l&#233;ment, nous
ajoutons l&#8217;ensemble des traductions propos&#233;es. Les mots ne figurant pas dans le dictionnaire
sont tout simplement ignor&#233;s.
</p>
<p>&#8211; Comparaison des vecteurs sources et cibles : Les vecteurs traduits sont ensuite compar&#233;s
&#224; l&#8217;ensemble des vecteurs de contexte en langue cible &#224; l&#8217;aide d&#8217;une mesure de similarit&#233;
vectorielle. La plus populaire &#233;tant le cosinus, mais de nombreux auteurs ont &#233;tudi&#233;s des
m&#233;triques alternatives comme la distance du Jaccard pond&#233;r&#233;e ou encore le city-block. En
fonction des valeurs de similarit&#233;, nous obtenons une liste ordonn&#233;e de traductions candidates
pour le terme S.
</p>
<p>2.2 Travaux reli&#233;s
</p>
<p>La couverture du dictionnaire bilingue assurant le transfert des vecteurs de contexte en langue
cible demeure le noyau de l&#8217;approche standard. Si trop peu de mots sont traduits, la comparai-
son de vecteurs traduits et de vecteurs cibles ne sera pas significative puisque r&#233;alis&#233;e sur un
&#233;chantillon trop faible de vocabulaire. Pour limiter cet effet, des techniques visant &#224; am&#233;liorer
les r&#233;sultats de l&#8217;approche standard ont vu le jour et ce par l&#8217;adjonction de ressources diction-
nariques sp&#233;cialis&#233;es suppl&#233;mentaires pr&#233;&#233;tablies (D&#233;jean et al., 2002; Chiao et Zweigenbaum,
2003), extraites de corpus parall&#232;les (Morin et Prochasson, 2011) ou encore du m&#234;me corpus
d&#8217;&#233;tude (Vulic&#769; et Moens, 2012).
</p>
<p>R&#233;cemment, des recherches fond&#233;es sur l&#8217;hypoth&#232;se que plus les vecteurs de contexte sont
repr&#233;sentatifs, meilleure est la mise en correspondance bilingue ont &#233;t&#233; men&#233;es. (Prochasson
et al., 2009) utilisent les translitt&#233;rations et mots savants comme &#8217;points d&#8217;ancrage&#8217;. L&#8217;objectif est
que la comparaison des vecteurs se fonde en priorit&#233; sur les points d&#8217;ancrage, puis sur le reste
d&#8217;&#233;l&#233;ments. Outre les translitt&#233;rations, (Rubino et Linar&#232;s, 2011) combinent la repr&#233;sentation
contextuelle avec une repr&#233;sentation th&#233;matique de termes m&#233;dicaux, en &#233;mettant l&#8217;hypoth&#232;se
qu&#8217;un terme et sa traduction partagent des similarit&#233;s d&#8217;un point de vue th&#233;matique. (Hazem
et Morin, 2012a) proposent deux crit&#232;res de filtrage du dictionnaire bilingue dans le but de
ne garder que les mots qui donnent la meilleure repr&#233;sentation du vecteur de contexte dans la
langue cible. Le premier crit&#232;re se base sur les cat&#233;gories grammaticales des mots du contexte
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>329 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>mais aucune am&#233;lioration n&#8217;a &#233;t&#233; d&#233;montr&#233;e. Le deuxi&#232;me crit&#232;re &#233;tant bas&#233; sur une mesure de
pertinence d&#8217;un mot pour un domaine donn&#233;. Contrairement au premier crit&#232;re, celui ci apporte
une petite am&#233;lioration (4% en pr&#233;cision) par rapport &#224; la m&#233;thode standard.
</p>
<p>(Gaussier et al., 2004) tentent de r&#233;soudre le probl&#232;me d&#8217;ambigu&#239;t&#233; de mots des vecteurs
de contexte en langues source et cible. Ils utilisent une vue g&#233;om&#233;trique et d&#233;composent le
vecteur d&#8217;un mot en fonction de ses sens par l&#8217;utilisation de plusieurs m&#233;thodes comme l&#8217;analyse
canonique de corr&#233;lation et l&#8217;analyse s&#233;mantique latente. Les meilleurs r&#233;sultats sont obtenus
par l&#8217;utilisation d&#8217;une approche mixte avec une am&#233;lioration de la F-Mesure au Top20 de +2%
par rapport &#224; l&#8217;approche standard. Dans cet article, nous pr&#233;sentons une approche traitant le
probl&#232;me d&#8217;ambigu&#239;t&#233; des mots des vecteurs de contexte mais qui diff&#232;re de celle propos&#233;e par
(Gaussier et al., 2004). Alors qu&#8217;ils mettent l&#8217;accent sur l&#8217;ambigu&#239;t&#233; des mots en langues source
et cible, nous jugeons qu&#8217;il serait suffisant de lever l&#8217;ambigu&#239;t&#233; des &#233;l&#233;ments des vecteurs de
contexte en langue source vu que l&#8217;ambigu&#239;t&#233; parvient lors du transfert des vecteurs de contexte
sources
</p>
<p>3 D&#233;sambigu&#239;sation lexicale des vecteurs de contexte
</p>
<p>Nous proposons dans cet article une approche qui tente d&#8217;am&#233;liorer les r&#233;sultats de l&#8217;approche
standard. Nous abordons le probl&#232;me associ&#233; aux mots polys&#233;miques r&#233;v&#233;l&#233;s par le dictionnaire
bilingue amorce lors du transfert des vecteurs de contexte sources. Comme il a &#233;t&#233; mentionn&#233;
dans la section 1, lorsque l&#8217;extraction lexicale porte sur un domaine sp&#233;cialis&#233;, les traductions
propos&#233;es par le dictionnaire bilingue ne sont pas toutes pertinentes pour la repr&#233;sentation des
vecteurs de contexte en langue cibles. Par exemple, dans le domaine juridique, la traduction
du mot action (Fr) par share ou stock (An) ne fera qu&#8217;introduire du bruit dans les vecteurs
traduits. L&#8217;intuition derri&#232;re notre approche est qu&#8217;il conviendrait d&#8217;introduire un processus de
d&#233;sambigu&#239;sation s&#233;mantique lexicale visant &#224; am&#233;liorer l&#8217;ad&#233;quation des vecteurs de contexte
traduits et par cons&#233;quent am&#233;liorer les r&#233;sultats de l&#8217;approche standard. Dans cette section, nous
commen&#231;ons par d&#233;crire la ressource s&#233;mantique sur laquelle se base notre approche. Ensuite,
nous pr&#233;sentons en d&#233;tail notre m&#233;thode de d&#233;sambigu&#239;sation des vecteurs de contexte.
</p>
<p>3.1 Ressource s&#233;mantique
</p>
<p>Un grand nombre de techniques de d&#233;sambigu&#239;sation lexicale ont &#233;t&#233; pr&#233;sent&#233;es dans la litt&#233;-
rature. Les plus populaires sont celles mesurant une similarit&#233; s&#233;mantique en se basant sur le
th&#233;saurus WordNet. Cette ressource est structur&#233;e autour de la notion de synsets, c&#8217;est-&#224;-dire en
quelque sorte un ensemble de synonymes qui forment un concept. Chaque synset repr&#233;sente un
sens de mot. Les synsets sont reli&#233;s entre eux par des relations, soit lexicales (antonymie par
exemple) ou taxonomiques (hyperonymie, m&#233;ronymie, etc). Ce th&#233;saurus est largement utilis&#233;
dans des applications reposant sur le calcul de similarit&#233; des mots telles que la recherche de
documents (Hwang et al., 2011) ou d&#8217;images (Cho et al., 2007; Choi et al., 2012). Dans ce travail,
nous l&#8217;utilisons pour d&#233;river une similarit&#233; s&#233;mantique entre les &#233;l&#233;ments de chaque vecteur de
contexte permettant de s&#233;lectionner les sens des mots les plus saillants &#224; la repr&#233;sentation des
termes &#224; traduire. &#192; notre connaissance, c&#8217;est une premi&#232;re application de WordNet en extraction
de lexiques bilingues &#224; partir de corpus comparables.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>330 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vecteur de contexte {action}, {dividende}, {liquidit&#233;}, . . .
Dictionnaire bilingue {act, stock, action, deed, lawsuit, fact, operation, plot, share} , {divi-
</p>
<p>dend} , {liquidity}
SemSim {dividend, act} ; {dividend,stock} ; . . . ; {liquidity, act} ; {liqui-
</p>
<p>dity,stock} ; . . .
Ave_Wup(action) share :0.5236, stock :0.5236, action :0.4256, act :0.2139, opera-
</p>
<p>tion :0.2045, plot :0.2011, fact :0.1934, deed :0.1594, lawsuit :0.1212
</p>
<p>TABLE 1 &#8211; D&#233;sambigu&#239;sation s&#233;mantique du vecteur de contexte du terme b&#233;n&#233;fice
</p>
<p>Parmi les mesures de similarit&#233; s&#233;mantique utilisant WordNet, nous retrouvons les mesures
bas&#233;es sur la distance taxonomique. Le principe g&#233;n&#233;ral de ces mesures est de compter le nombre
d&#8217;arcs qui s&#233;parent deux sens dans WordNet. Dans ce cadre, nous choisissons la mesure d&#233;finie
par (Wu et Palmer, 1994). La similarit&#233; est d&#233;finie selon la distance qui s&#233;pare deux concepts par
rapport &#224; leur sens commun le plus sp&#233;cifique (LCS) que la racine de la taxonomie. La similarit&#233;
entre deux sens s1 et s2 est :
</p>
<p>Simwup(s1, s2) =
2&#215; depth(LCS)
</p>
<p>depth(s1) + depth(s2)
(1)
</p>
<p>O&#249; depth(LCS) est le nombre d&#8217;arcs qui s&#233;parent LCS de la racine et depth(si) avec i le nombre
d&#8217;arcs qui s&#233;parent si de la racine en passant par LCS. Cette mesure a l&#8217;avantage d&#8217;avoir de
meilleures performances par rapport aux autres mesures de similarit&#233; (Lin, 1998).
</p>
<p>3.2 Processus de d&#233;sambigu&#239;sation
</p>
<p>Une fois transf&#233;r&#233; en langue cible, le processus de d&#233;sambigu&#239;sation des vecteurs de contexte
intervient. Ce processus tente de trouver pour chacune des entr&#233;es polys&#233;miques dans les
vecteurs traduits le sens le plus ad&#233;quat. Pour ce faire, nous utilisons les unit&#233;s non polys&#233;miques
pour d&#233;duire les sens de celles polys&#233;miques. Nous &#233;mettons l&#8217;hypoth&#232;se qu&#8217;un mot est non
polys&#233;mique s&#8217;il ne poss&#232;de qu&#8217;une seule traduction dans le dictionnaire bilingue. Cette hypoth&#232;se
est v&#233;rifi&#233;e dans 95% des cas dans WordNet (i.e mots associ&#233;s &#224; un seul synset).
</p>
<p>Pr&#233;cis&#233;ment, pour chaque entr&#233;e polys&#233;mique de chaque vecteur, nous mesurons la similarit&#233;
s&#233;mantique entre toutes les traductions qui lui sont associ&#233;es et toutes les unit&#233;s non polys&#233;miques
du m&#234;me vecteur. En fonction des valeurs de similarit&#233;, nous obtenons une liste ordonn&#233;e de
sens ou traductions pour chaque mot polys&#233;mique.
</p>
<p>Plus formellement, puisqu&#8217;un mot peut appartenir &#224; plus d&#8217;un sens ou synset dans WordNet, nous
d&#233;terminons la similarit&#233; s&#233;mantique entre deux mots m1 et m2 comme le maximum de Simwup
entre le ou les synsets qui incluent les s ynsets(m1) et les s ynsets(m2) selon la formule suivante :
</p>
<p>SemSim(m1,m2) =max{Simwup(s1, s2); (s1, s2) &#8712; s ynsets(m1)&#215; s ynsets(m2)} (2)
Ensuite, pour identifier le sens le plus appropri&#233; pour chaque mot polys&#233;mique k dans les
vecteurs de contexte, nous mesurons une moyenne de similarit&#233; (Formule 3) pour chacune des
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>331 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>traductions propos&#233;es k j.
</p>
<p>Ave_Wup(kj) =
</p>
<p>&#65535;N
i=1 SemSim(mi , kj)
</p>
<p>N
(3)
</p>
<p>o&#249; N est le nombre total des mots non polys&#233;mique du vecteur traduit et SemSim est la valeur
de similarit&#233; entre kj et le mot non polys&#233;mique mi . Dans le cas o&#249; tous les mots du vecteur
de contexte sont polys&#233;miques, il est possible de calculer la similarit&#233; s&#233;mantique entre toutes
les combinaisons de mots. Dans de tels cas, nous choisissons de ne pas toucher au vecteurs de
contexte puisque avec le calcul de ce type de similarit&#233; une augmentation de la complexit&#233; algo-
rithmique et d&#233;t&#233;rioration des r&#233;sultats d&#8217;extraction ont &#233;t&#233; constat&#233;s dans des exp&#233;rimentations
pr&#233;liminaires.
</p>
<p>Un exemple de d&#233;sambigu&#239;sation de vecteur de contexte du terme &#8220;b&#233;n&#233;fice&#8221; est d&#233;crit dans la
table 1. Ce vecteur est construit &#224; partir de corpus comparable sp&#233;cialis&#233; et contient les mots
action, dividende, liquidit&#233; et d&#8217;autres unit&#233;s. Lors du transfert de ce vecteur de la langue source
(Fran&#231;ais) &#224; celle cible (Anglais), le dictionnaire bilingues propose les traductions suivantes &#171; act,
stock, action, deed, lawsuit, fact, operation, plot, share &#187;, &#171; dividend &#187; et &#171; liquidity &#187; pour traduire
respectivement les mots &#171; action &#187;, &#171; dividende &#187; et &#171; liquidit&#233; &#187;. Nous utilisons les unit&#233;s lexicales
non polys&#233;miques &#171; dividende &#187; et &#171; liquidit&#233; &#187; pour d&#233;sambiguiser le mot &#171; action &#187;. En observant
la valeur de Ave_Wup, nous remarquons que dans ce contexte, les mots share et stock sont les
traductions les plus appropri&#233;es au mot action. Nous remarquons aussi que les mots issus du
domaine g&#233;n&#233;ral se placent apr&#232;s pour retrouver &#224; la fin les unit&#233;s les moins proches (deed et
lawsuit).
</p>
<p>4 Exp&#233;rimentations et r&#233;sultats
</p>
<p>4.1 Ressources linguistiques
</p>
<p>Dans le cadre de cette &#233;tude, nous avons construit deux corpus comparables sp&#233;cialis&#233;s fran&#231;ais-
anglais &#224; partir de l&#8217;encyclop&#233;die libre Wikip&#233;dia1. Nous exploitons l&#8217;aspect multilingue cette
ressource pour en extraire de la terminologie sp&#233;cialis&#233;e qui pourra cr&#233;er ou enrichir des
ressources linguistiques existantes. Nous nous int&#233;ressons particuli&#232;rement au domaine de la
&#171; finance des entreprises &#187; et &#224; la th&#233;matique du &#171; cancer du sein &#187; relevant du domaine m&#233;dical.
Notre approche repose en premier lieu sur l&#8217;extraction de pages de Wikip&#233;dia en langue source.
Ensuite, les liens interlingues sont utilis&#233;s afin de chercher l&#8217;information translinguistique et donc
construire la partie du corpus en langue cible (Sadat et Terrasa, 2010).
</p>
<p>Nous consid&#233;rons que le domaine d&#8217;&#233;tude constitue une cat&#233;gorie dans Wikip&#233;dia. Les cat&#233;gories
sont un syst&#232;me de classement th&#233;matique des articles de Wikip&#233;dia. Une requ&#234;te compos&#233;e du
domaine d&#8217;&#233;tude en langue source (par exemple finance des entreprises) est donc construite pour
extraire une arborescence de cat&#233;gories ou de th&#232;mes ayant pour cat&#233;gorie m&#232;re le domaine de
sp&#233;cialit&#233;. Un exemple d&#8217;arborescence est pr&#233;sent&#233; dans la figure 1.
</p>
<p>Ensuite, Nous collectons tous les articles associ&#233;s &#224; chacune des cat&#233;gories de l&#8217;arborescence
pour construire un corpus sp&#233;cialis&#233; monolingue (en langue source). Afin de collecter les articles
</p>
<p>1http://dumps.wikimedia.org/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>332 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>! !
</p>
<p>Finance des entreprise
</p>
<p>Analyse Financi&#232;re Comptabilit&#233; g&#233;n&#233;rale Indicateur Financier
</p>
<p>Risque
Cr&#233;dit
</p>
<p>Actifs
</p>
<p>Bilan Salaire
</p>
<p>Solde
</p>
<p>B&#233;n&#233;fice Revenu 
</p>
<p>... 
</p>
<p>FIGURE 1 &#8211; Arborescence de cat&#233;gories de la th&#233;matique Finance des entreprises
</p>
<p>en langue cible, les liens interlingues au sein de chaque article du corpus monolingue sont
utilis&#233;s. Un &#233;tiquetage morpho-syntaxtique et une lemmatisation ont &#233;t&#233; appliqu&#233;s sur les articles
collect&#233;s. Nous avons aussi retir&#233; les mots fonctionnels et ceux apparaissant moins de deux fois
dans les deux parties du corpus comparable. Nous avons ainsi construit deux corpus comparables
de taille r&#233;duite. La taille en nombre de mots des corpus r&#233;sultants est dans la table 2
</p>
<p>Corpus Fran&#231;ais Anglais
Finance des entreprises 402.486 756.840
Cancer du sein 396.524 524.805
</p>
<p>TABLE 2 &#8211; Taille des corpus comparables. La taille est exprim&#233;e en nombre de mots
</p>
<p>Le dictionnaire bilingue Fran&#231;ais-Anglais assurant le transfert des vecteurs de contexte comporte
environ 120000 entr&#233;es avec en moyenne 7 traductions par entr&#233;e. Il s&#8217;agit d&#8217;un dictionnaire du
domaine g&#233;n&#233;ral comportant quelques mots en rapport avec le domaine financier et m&#233;dical.
</p>
<p>Pour &#233;valuer la qualit&#233; de l&#8217;approche standard et celle introduisant la d&#233;sambigu&#239;sation lexicale
des vecteurs de contexte, nous avons construit une liste de traductions de r&#233;f&#233;rence pour chaque
domaine. Habituellement, la taille de ces listes est autour de 100 mots (Hazem et Morin, 2012a;
Chiao et Zweigenbaum, 2002). Pr&#233;cisons que nous nous int&#233;ressons dans cet article uniquement
&#224; l&#8217;extraction bilingue de termes simples. D&#8217;autres recherches se sont port&#233;es sur l&#8217;extraction
de termes complexes (Morin et Daille, 2004; Laroche et Langlais, 2010). Pour le domaine de
la finance des entreprises, une liste compos&#233;e de 125 mots simples est extraite du glossaire
bilingue de la micro-finance 2. En ce qui concerne le domaine du cancer du sein, 79 termes
issus du m&#233;ta-th&#233;saurus UMLS3 et du MESH4 sont extraits. Ces deux listes sont compos&#233;es de
paires de termes fran&#231;ais-anglais apparaissant au moins cinq fois dans chaque partie des corpus
comparables.
</p>
<p>2http://www.microfinance.lu/la-microfinance-cest-quoi/glossaire.html
3http://www.nlm.nih.gov/research/umls/
4http://mesh.inserm.fr/mesh/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>333 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.2 Exp&#233;rimentations
</p>
<p>Afin de mener &#224; bien nos exp&#233;riences, nous avons besoin de r&#233;gler trois principaux param&#232;tres :
(1) la taille de la fen&#234;tre contextuelle, (2) la mesure d&#8217;association et (3) la mesure de similarit&#233;.
Comme dans la plupart des travaux ant&#233;rieurs (Hazem et Morin, 2012b; Chiao et Zweigenbaum,
2002), nous fixons la taille de la fen&#234;tre contextuelle &#224; 7, partant de l&#8217;id&#233;e qu&#8217;elle approxime les
d&#233;pendances syntaxiques. Une &#233;tude de diff&#233;rentes combinaisons entre les mesures d&#8217;association
et les m&#233;triques de similarit&#233; a &#233;t&#233; pr&#233;sent&#233;e dans (Laroche et Langlais, 2010). Pour le domaine
m&#233;dical, la configuration la plus efficace &#233;tant de combiner le rapport des chances [Odds-Ratio]
avec le cosinus. Nous avons suivi ces travaux pour la d&#233;finition de ces param&#232;tres. La formule du
rapport des chances est d&#233;finie dans l&#8217;&#233;quation ci-dessous :
</p>
<p>OddsRatiodisc = log
(O11 +
</p>
<p>1
2
)(O22 +
</p>
<p>1
2
)
</p>
<p>(O12 +
1
2
)(O21 +
</p>
<p>1
2
)
</p>
<p>(4)
</p>
<p>O&#249; Oi j sont les cellules d&#8217;une table de contingence 2&#215; 2 regroupant les fr&#233;quences d&#8217;observation
de deux termes dans une fen&#234;tre donn&#233;e. Le cosinus de l&#8217;angle form&#233; par deux vecteurs source vs
et cible vc est d&#233;fini dans l&#8217;&#233;quation 5.
</p>
<p>Cos(vs, vc) =
</p>
<p>&#65535;
j OddsRatio
</p>
<p>s
j &#215;OddsRatiocj&#65535;&#65535;
</p>
<p>j OddsRatio
s
j
2 &#215;
&#65535;&#65535;
</p>
<p>j OddsRatio
c
j
2
</p>
<p>(5)
</p>
<p>4.3 R&#233;sultats et discussion
</p>
<p>Il est difficile de comparer les r&#233;sultats de diff&#233;rents travaux en extraction de lexiques bilingues &#224;
partir de corpus comparables, en raison de diff&#233;rences entre les corpus, les domaines d&#8217;&#233;tudes
ou encore les ressources linguistiques utilis&#233;es (Prochasson et Morin, 2009). &#192; ce jour, aucun
jeu de donn&#233;es pouvant servir de r&#233;f&#233;rence n&#8217;a &#233;t&#233; mis en place. C&#8217;est pour cette raison que
nous utilisons les r&#233;sultats de l&#8217;approche standard (AS) comme r&#233;f&#233;rence. Nous &#233;valuons les
performances de cette approche et de celle pr&#233;sent&#233;e en section 3 en utilisant les m&#233;triques
de pr&#233;cision (PN ), rappel (RN ) au TopN et de MAP (Mean Average Precision) (Manning et al.,
2008). La pr&#233;cision est le nombre de traductions correctes divis&#233; par le nombre de termes pour
lesquels le syst&#232;me propose au moins une traduction. Le rappel est &#233;gal au rapport entre les
traductions correctes et le nombre total des termes. La MAP repr&#233;sente la qualit&#233; d&#8217;un syst&#232;me
en fonction de diff&#233;rents niveaux de rappel :
</p>
<p>MAP(Q) =
1
Q
</p>
<p>j=1&#65535;
|Q|
</p>
<p>1
mj
</p>
<p>k=1&#65535;
mj
</p>
<p>Pr e&#769;cision(Rjk) (6)
</p>
<p>O&#249; Q constitue le nombre de termes &#224; traduire, mj est le nombre de traductions de r&#233;f&#233;rence pour
le j e&#768;me terme et Pre&#769;cision(Rjk) est &#233;gale &#224; 0 si la traduction de r&#233;f&#233;rence n&#8217;est pas trouv&#233;e pour
le j e&#768;me terme ou 1
</p>
<p>r
s&#8217;il y figure (r est le rang de la traduction de r&#233;f&#233;rence dans les traductions
</p>
<p>candidates).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>334 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thode P1 P10 P20 R1 R10 R20 MAP
AS 4.6 14 18.6 4 12 16 6.4
</p>
<p>WN-S1 6.5 19.6 26.1 5.6 16.8 22.4 8.9
WN-S2 10.2 25.2 30.8 8 21.6 26.4 12.2
WN-S3 10.2 24.2 32.7 8.8 20.8 28 12.2
WN-S4 11.2 22.4 29.9 9 19 25 12.4
WN-S5 9.3 20.5 28 8 17.6 24 11
WN-S6 8.4 20.5 23.3 7.2 17.6 20 9.41
WN-S7 7.4 17.7 24.2 6.4 15.2 20.8 9
</p>
<p>TABLE 3 &#8211; Corpus de &#171; finance des entreprises &#187; : Pr&#233;cision et Rappel au TopN (N = 1,10,20) et
MAP (%)
</p>
<p>Rappelons que l&#8217;AS utilise toutes les traductions propos&#233;es par le dictionnaire bilingue pour le
transfert des vecteurs de contexte. Notre m&#233;thode de d&#233;sambigu&#239;sation des contextes fournit
pour chaque unit&#233; polys&#233;mique, un vecteur de sens ordonn&#233; en fonction des valeurs de similarit&#233;.
A cet &#233;gard, il convient de s&#8217;interroger sur le nombre de sens &#224; consid&#233;rer pour chaque mot
polys&#233;mique. Devrions nous consid&#233;rer que l&#8217;&#233;l&#233;ment maximisant la similarit&#233; s&#233;mantique dans
le vecteur de contexte ou envisager un plus grand nombre de sens notamment quand un vecteur
de sens contient des synonymes (share (An) et stock (An) dans la table 1). C&#8217;est pr&#233;cis&#233;ment
pour cette raison que nous prenons en consid&#233;ration pour chaque unit&#233; polys&#233;mique diff&#233;rents
nombre de sens dans nos exp&#233;rimentations allant du sens le plus similaire jusqu&#8217;au septi&#232;me
sens. L&#8217;arr&#234;t au septi&#232;me sens ou traduction s&#8217;explique par le fait qu&#8217;en moyenne, un mot du
corpus comparable poss&#232;de 7 traductions dans le lexique bilingue. Ces m&#233;thodes sont not&#233;es
WN-Si o&#249; i est le nombre de sens associ&#233; &#224; chaque unit&#233; polys&#233;mique. La table 3 pr&#233;sente les
r&#233;sultats obtenus pour le corpus de la finance des entreprises.
</p>
<p>Nous constatons que notre m&#233;thode qui consiste en une d&#233;sambigu&#239;sation des vecteurs de
contexte d&#233;passe les performances de la m&#233;thode de r&#233;f&#233;rence AS pour toutes les configurations.
La meilleure MAP est atteinte par (WN-S4), lorsque pour chaque mot polys&#233;mique, nous gardons
les quatre traductions les plus similaires aux &#233;l&#233;ments non polys&#233;miques des vecteurs de contexte.
La pr&#233;cision au Top20 la plus &#233;lev&#233;e est obtenue par WN-S3. L&#8217;utilisation des trois premiers sens
de mots dans le vecteur fait passer la pr&#233;cision au Top20 de 18.6% &#224; 32.7%. Une d&#233;gradation de
la MAP, pr&#233;cision et rappel est constat&#233;e &#224; partir de WN-S5. L&#8217;ajout progressif des traductions
rapproche les r&#233;sultats obtenus de ceux de l&#8217;AS. Nous estimons par cons&#233;quent que &#224; partir de
WN-S5, les traductions ajout&#233;es ne font qu&#8217;introduire du bruit dans les vecteurs de contextes.
</p>
<p>En ce qui concerne le corpus traitant la th&#233;matique du cancer du sein, des r&#233;sultats diff&#233;rents
ont &#233;t&#233; obtenus. Comme le montre la table 4, lorsque les vecteurs de contexte sont totalement
non ambigus (i.e. chaque unit&#233; source est traduite par au plus un mot), une diminution de la
pr&#233;cision, rappel et MAP est not&#233;e par rapport &#224; l&#8217;AS. N&#233;anmoins, dans la plupart des autres cas,
des am&#233;liorations plus au moins petites sont obtenues. Dans la m&#233;thode WN-S5, nous reportons
le meilleur score avec un gain de +3.4% en MAP par rapport &#224; AS. Par contre les meilleurs rappel
et pr&#233;cision au Top 10 et 20 sont atteints par WN-S2 et WN-S3.
</p>
<p>En observant les r&#233;sultats (table 3 et 4) des domaines de la finance des entreprises et celui du
cancer du sein, nous remarquons que dans la plupart des cas l&#8217;approche de d&#233;sambigu&#239;sation des
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>335 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thode P1 P10 P20 R1 R10 R20 MAP
AS 34.2 54.2 58.5 25 39.5 42.7 31.4
</p>
<p>WN-S1 25.7 50 57.1 18.7 36.4 41.6 25.7
WN-S2 31.4 61.4 67.1 22.9 44.7 48.9 31.3
WN-S3 34.2 62.8 67.1 25 45.8 48.9 34.2
WN-S4 34.2 57.1 64.2 25 41.6 46.8 33.2
WN-S5 35.7 57.1 65.7 26 41.6 47.9 34.8
WN-S6 35.7 57.1 65.2 26 41.6 46.8 34.7
WN-S7 35.7 58.5 65.7 26 42.7 47.9 33.9
</p>
<p>TABLE 4 &#8211; Corpus du &#171; cancer du sein &#187; : Pr&#233;cision et Rappel au TopN (N = 1,10,20) et MAP (%)
</p>
<p>vecteurs de contexte par l&#8217;utilisation de la similarit&#233; s&#233;mantique de WordNet donne de meilleurs
r&#233;sultats que l&#8217;approche de r&#233;f&#233;rence AS mais &#224; des degr&#233;s diff&#233;rents. Les am&#233;liorations report&#233;es
en domaine de la finance des entreprises d&#233;passent de loin celles du cancer du sein. Ceci peut-&#234;tre
d&#251; au fait que le vocabulaire utilis&#233; dans le domaine du cancer du sein est plus sp&#233;cifique et
donc moins ambigu que celui utilis&#233; dans les textes de la finance des entreprises. Dans ce cas,
les am&#233;liorations restent trouv&#233; dans de larges valeurs de N au TopN (la d&#233;sambigu&#239;sation des
contextes aide &#224; apporter des traductions plus &#233;loign&#233;es au Top20).
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; dans cet article une nouvelle m&#233;thode qui tente d&#8217;am&#233;liorer les r&#233;sultats de
l&#8217;approche standard utilis&#233;e en extraction lexicale bilingue. Cette m&#233;thode a pour but de lever
l&#8217;ambigu&#239;t&#233; des mots polys&#233;miques dans les vecteurs de contexte en s&#233;lectionnant uniquement
les traductions susceptibles de repr&#233;senter au mieux les termes &#224; traduire. La technique propos&#233;e
repose sur le calcul d&#8217;une similarit&#233; s&#233;mantique faisant appel au r&#233;seau s&#233;mantique WordNet.
Les exp&#233;riences men&#233;es sur deux corpus comparables sp&#233;cialis&#233;s montrent que les performances
de cette technique sont dans la plupart des cas sup&#233;rieures &#224; celles obtenues par l&#8217;approche
standard.
</p>
<p>Nous consid&#233;rons que nos exp&#233;riences initiales sont positives et peuvent &#234;tre am&#233;lior&#233;es de
diverses fa&#231;ons. Nous avons d&#8217;abord l&#8217;intention d&#8217;agrandir la taille des corpus comparables
utilis&#233;s. De plus, dans ce travail, nous consid&#233;rons que les corpus construit sont de bonne qualit&#233;,
nous tenterons donc d&#8217;agir sur leur qualit&#233; en utilisant par exemple la mesure propos&#233;e par (Li et
Gaussier, 2010). Outre la m&#233;trique d&#233;finie par (Wu et Palmer, 1994), nous comptons utiliser
d&#8217;autres mesures de similarit&#233; s&#233;mantique et comparer leurs performances. Nous pr&#233;voyons
&#233;galement d&#8217;appliquer notre m&#233;thode &#224; l&#8217;extraction de lexiques bilingues &#224; partir d&#8217;autre corpus
tr&#232;s sp&#233;cialis&#233;s pour valider nos hypoth&#232;ses.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CHIAO, Y.-C. et ZWEIGENBAUM, P. (2002). Looking for candidate translational equivalents in specia-
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>336 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>lized, comparable corpora. In Proceedings of the 19th international conference on Computational
linguistics - Volume 2, COLING &#8217;02, pages 1&#8211;5. Association for Computational Linguistics.
</p>
<p>CHIAO, Y.-C. et ZWEIGENBAUM, P. (2003). The effect of a general lexicon in corpus-based
identification of French-English medical word translations. In Proceedings Medical Informatics
Europe, volume 95 of Studies in Health Technology and Informatics, pages 397&#8211;402, Amsterdam.
</p>
<p>CHO, M., CHOI, C., KIM, H., SHIN, J. et KIM, P. (2007). Efficient image retrieval using conceptuali-
zation of annotated images. Lecture Notes in Computer Science, pages 426&#8211;433. Springer.
</p>
<p>CHOI, D., KIM, J., KIM, H., HWANG, M. et KIM, P. (2012). A method for enhancing image
retrieval based on annotation using modified wup similarity in wordnet. In Proceedings of the
11th WSEAS international conference on Artificial Intelligence, Knowledge Engineering and Data
Bases, AIKED&#8217;12, pages 83&#8211;87, Stevens Point, Wisconsin, USA. World Scientific and Engineering
Academy and Society (WSEAS).
</p>
<p>D&#201;JEAN, H., GAUSSIER, E. et SADAT, F. (2002). An approach based on multilingual thesauri and
model combination for bilingual lexicon extraction. In Proceedings of the 19th international
conference on Computational linguistics - Volume 1, COLING &#8217;02, pages 1&#8211;7. Association for
Computational Linguistics.
</p>
<p>FELLBAUM, C. (1998). WordNet : An Electronic Lexical Database. Bradford Books.
</p>
<p>FUNG, P. (1995). A pattern matching method for finding noun and proper noun translations from
noisy parallel corpora. In Proceedings of the 33rd annual meeting on Association for Computational
Linguistics, pages 236&#8211;243. Association for Computational Linguistics.
</p>
<p>FUNG, P. (1998). A statistical view on bilingual lexicon extraction : From parallel corpora to
non-parallel corpora. In Parallel Text Processing, pages 1&#8211;17. Springer.
</p>
<p>GAMALLO OTERO, P. (2007). Learning bilingual lexicons from comparable English and Spanish
corpora. In Proceedings of MT SUMMIT, pages 191&#8211;198.
</p>
<p>GAUSSIER, &#201;., RENDERS, J.-M., MATVEEVA, I., GOUTTE, C. et D&#201;JEAN, H. (2004). A geometric view
on bilingual lexicon extraction from comparable corpora. In ACL, pages 526&#8211;533.
</p>
<p>HARRIS, Z. (1954). Distributional structure. Word, pages 146&#8211;162.
</p>
<p>HAZEM, A. et MORIN, E. (2012a). Adaptive dictionary for bilingual lexicon extraction from
comparable corpora. In Proceedings, 8th international conference on Language Resources and
Evaluation (LREC), Istanbul, Turkey.
</p>
<p>HAZEM, A. et MORIN, E. (2012b). Qalign :a new method for bilingual lexicon extraction from
comparable corpora. In Proceedings of CICLING, India.
</p>
<p>HWANG, M., CHOI, C. et KIM, P. (2011). Automatic enrichment of semantic relation network
and its application to word sense disambiguation. IEEE Transactions on Knowledge and Data
Engineering, 23:845&#8211;858.
</p>
<p>KUN, Y. et TSUJII, J. (2009). Bilingual dictionary extraction from Wikipedia. In Proceedings of
MT SUMMIT.
</p>
<p>LAROCHE, A. et LANGLAIS, P. (2010). Revisiting context-based projection methods for term-
translation spotting in comparable corpora. In 23rd International Conference on Computational
Linguistics (Coling 2010), pages 617&#8211;625, Beijing, China.
</p>
<p>LI, B. et GAUSSIER, &#203;. (2010). Improving corpus comparability for bilingual lexicon extraction
from comparable corpora. In 23rd International Conference on Computational Linguistics (Coling
2010), Beijing, China.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>337 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LIN, D. (1998). An information-theoretic definition of similarity. In Proceedings of the Fifteenth
International Conference on Machine Learning, ICML &#8217;98, pages 296&#8211;304, San Francisco, CA,
USA. Morgan Kaufmann Publishers Inc.
</p>
<p>MANNING, C. D., RAGHAVAN, P. et SCHTZE, H. (2008). Introduction to Information Retrieval.
Cambridge University Press, New York, NY, USA.
</p>
<p>MORIN, E. et DAILLE, B. (2004). Extraction terminologique bilingue &#224; partir de corpus compa-
rables d&#8217;un domaine sp&#233;cialis&#233;. In Traitement Automatique des Langues (TAL).
</p>
<p>MORIN, E. et DAILLE, B. (2006). Comparabilit&#233; de corpus et fouille terminologique multilingue.
In Traitement Automatique des Langues (TAL).
</p>
<p>MORIN, E. et PROCHASSON, E. (2011). Bilingual lexicon extraction from comparable corpora
enhanced with parallel corpora. In Proceedings, 4th Workshop on Building and Using Comparable
Corpora (BUCC), page 27&#8211;34, Portland, Oregon, USA.
</p>
<p>PROCHASSON, E. et MORIN, E. (2009). Points d&#8217;ancrage pour l&#8217;extraction lexicale bilingue &#224; partir
de petits corpus comparables sp&#233;cialis&#233;s. Traitement Automatique des Langues, page 22.
</p>
<p>PROCHASSON, E., MORIN, E. et KAGEURA, K. (2009). Anchor points for bilingual lexicon extraction
from small comparable corpora. In Proceedings, 12th Conference on Machine Translation Summit
(MT Summit XII), page 284&#8211;291, Ottawa, Ontario, Canada.
</p>
<p>RAPP, R. (1995). Identifying word translations in non-parallel texts. In Proceedings of the
33rd annual meeting on Association for Computational Linguistics, ACL &#8217;95, pages 320&#8211;322.
Association for Computational Linguistics.
</p>
<p>RUBINO, R. et LINAR&#200;S, G. (2011). Une approche multi-vue pour l&#8217;extraction terminologique
bilingue. In CORIA, pages 97&#8211;111.
</p>
<p>SADAT, F. et TERRASA, A. (2010). Exploitation de wikip&#233;dia pour l&#8217;enrichissement et la construc-
tion des ressources linguistiques. In Proceedings of TALN, Montr&#233;al, Canada.
</p>
<p>VULIC&#769;, I. et MOENS, M.-F. (2012). Detecting highly confident word translations from comparable
corpora without any prior knowledge. In Proceedings of the 13th Conference of the European
Chapter of the Association for Computational Linguistics, pages 449&#8211;459, Avignon, France.
Association for Computational Linguistics.
</p>
<p>WU, Z. et PALMER, M. (1994). Verbs semantics and lexical selection. In Proceedings of the
32nd annual meeting on Association for Computational Linguistics, ACL &#8217;94, pages 133&#8211;138.
Association for Computational Linguistics.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>338 c&#65535; ATALA</p>

</div></div>
</body></html>