<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;dition interactive d&#8217;&#233;nonc&#233;s en langue des signes fran&#231;aise d&#233;di&#233;e aux avatars signeurs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;dition interactive d&#8217;&#233;nonc&#233;s en langue des signes
fran&#231;aise d&#233;di&#233;e aux avatars signeurs
</p>
<p>Ludovic Hamon1 Sylvie Gibet1 Sabah Boustila2
(1) IRISA, Universit&#233; Bretagne Sud, Campus de Tohannic, Rue Yves Mainguy, 56000 Vannes
</p>
<p>(2) ICUBE, Universit&#233; de Strasbourg, 300 bd S&#233;bastien Brant, BP 10413, 67412 IIIkirch Cedex, France
</p>
<p>R&#201;SUM&#201;
Les avatars signeurs en Langue des Signes Fran&#231;aise (LSF) sont de plus en plus utilis&#233;s en
tant qu&#8217;interface de communication &#224; destination de la communaut&#233; sourde. L&#8217;un des crit&#232;res
d&#8217;acceptation de ces avatars est l&#8217;aspect naturel et r&#233;aliste des gestes produits. Par cons&#233;quent,
des m&#233;thodes de synth&#232;se de gestes ont &#233;t&#233; &#233;labor&#233;es &#224; l&#8217;aide de corpus de mouvements
captur&#233;s et annot&#233;s provenant d&#8217;un signeur r&#233;el. N&#233;anmoins, l&#8217;enrichissement d&#8217;un tel corpus,
en faisant fi des s&#233;ances de captures suppl&#233;mentaires, demeure une probl&#233;matique certaine.
De plus, l&#8217;application automatique d&#8217;op&#233;rations sur ces mouvements (e.g. concat&#233;nation,
m&#233;lange, etc.) ne garantit pas la consistance s&#233;mantique du geste r&#233;sultant. Une alternative
est d&#8217;ins&#233;rer l&#8217;op&#233;rateur humain dans la boucle de construction des &#233;nonc&#233;s en LSF. Dans
cette optique, cet article propose un premier syst&#232;me interactif d&#8217;&#233;dition de gestes en LSF,
bas&#233; &quot;donn&#233;es captur&#233;es&quot; et d&#233;di&#233; aux avatars signeurs.
</p>
<p>ABSTRACT
Interactive editing of utterances in French sign language dedicated to signing avatars
</p>
<p>Signing avatars dedicated to French Sign Language (LSF) are more and more used as a
communication interface for the deaf community. One of the acceptation criteria of these
avatars is the natural and realistic aspect of the constructed gestures. Consequently, gestures
synthesis methods have been designed thanks to some corpus of captured and annotated
motions, performed by a real signer. However, the enlarging of such a corpus, without
requiring of some additional capture sessions, is a major issue. Furthermore, the automatic
application of motion transformations (e.g. concatenation, blending, etc.) does not guarantee
the semantic consistency of the resulting gesture. Another option is to insert the human
operator in the utterance building loop. In this context, this paper provides a first interactive
editing system of FSL gestures, based on captured motions and dedicated to signing avatars.
</p>
<p>MOTS-CL&#201;S : Langue des Signes Fran&#231;aise, &#233;dition, geste, base de donn&#233;es s&#233;mantiques,
signeur virtuel, interaction.
</p>
<p>KEYWORDS: French sign language, editing, gesture, semantic data base, virtual signer,
interaction.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>547 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>La Langue des Signes Fran&#231;aise (LSF) est une langue &#224; part enti&#232;re et constitue l&#8217;un des piliers
de l&#8217;identit&#233; et de la culture sourdes. La loi 2005-102 du 11 f&#233;vrier 2005 &#171; pour l&#8217;&#233;galit&#233;
des droits et des chances, la participation et la citoyennet&#233; des personnes handicap&#233;es &#187; a
favoris&#233; l&#8217;&#233;mergence d&#8217;applications d&#233;di&#233;es &#224; la promotion des moyens de communication et
de diffusion de l&#8217;information en LSF. Dans le cadre de ces applications, l&#8217;utilisation de Signeurs
Virtuels (SV) pour produire des messages en LSF semble &#234;tre une alternative int&#233;ressante &#224; la
production de vid&#233;os, dans la mesure o&#249; elle pr&#233;serve l&#8217;anonymat des personnes sourdes et
permet de manipuler, transf&#233;rer et visualiser de nouveaux &#233;nonc&#233;s.
</p>
<p>Dans ce contexte, les SV d&#233;di&#233;s aux langues des signes font l&#8217;objet de recherches et d&#8217;&#233;tudes
avanc&#233;es, alliant l&#8217;analyse linguistique &#224; la synth&#232;se de gestes &#224; partir de langages de construc-
tion d&#233;di&#233;s. Quelle que soient la pr&#233;cision et l&#8217;expressivit&#233; du syst&#232;me d&#8217;&#233;dition, la construction
d&#8217;un SV soul&#232;ve des probl&#233;matiques nombreuses dont l&#8217;une est commune &#224; tous les SV : la
recherche d&#8217;une coh&#233;rence linguistique des mouvements produits.
</p>
<p>Parmi les techniques de synth&#232;se de gestes en LSF, celles bas&#233;es sur des mouvements captur&#233;s
par un signeur r&#233;el, offrent l&#8217;avantage, d&#8217;un point de vue subjectif, d&#8217;obtenir des mouvements
plus naturels et acceptables pour la communaut&#233; sourde (Gibet et al., 2011), (H&#233;loir, 2008),
(Parisot et al., 2010). N&#233;anmoins, ce type de synth&#232;se n&#233;cessite la d&#233;finition d&#8217;un corpus
pr&#233;alable, obtenu apr&#232;s plusieurs s&#233;ances de captures demouvements co&#251;teuses et fastidieuses.
Par cons&#233;quent, le corpus initial est g&#233;n&#233;ralement r&#233;duit. Son enrichissement conduit &#224; des
solutions discutables telles que des s&#233;ances de captures suppl&#233;mentaires ou l&#8217;application de
transformations complexes sur des mouvements pr&#233;-enregistr&#233;s, entra&#238;nant des modifications
s&#233;mantiques incertaines.
</p>
<p>Cet article pr&#233;sente une m&#233;thode alternative sous la forme d&#8217;un premier &quot;framework&quot; d&#8217;&#233;dition
de la LSF &#224; partir de corpus de gestes captur&#233;s. &#192; l&#8217;aide de ce syst&#232;me, l&#8217;utilisateur peut cr&#233;er
de nouveaux &#233;nonc&#233;s en LSF et identifier/&#233;valuer la s&#233;mantique r&#233;sultant des gestes cr&#233;&#233;s
durant la simulation virtuelle. La deuxi&#232;me partie de ce document pr&#233;sente un &#233;tat de l&#8217;art
relatif aux langages de description et de sp&#233;cification des gestes dans le contexte des SV. La
troisi&#232;me section pr&#233;sente une analyse sur les principaux d&#233;fis et contraintes d&#8217;un syst&#232;me
d&#8217;&#233;dition de mouvements de la LSF. Le syst&#232;me d&#8217;&#233;dition est d&#233;crit dans la quatri&#232;me section
avec des exemples illustrant ses possibilit&#233;s et limites. Enfin, des perspectives sur les travaux
futurs concluent ce document.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Cette section pr&#233;sente, de mani&#232;re non exhaustive, les langages de description et de sp&#233;cifica-
tion des gestes en LSF relatifs aux SV, ainsi que les syst&#232;mes d&#8217;animation &#224; partir de donn&#233;es
captur&#233;es, du point de vue de l&#8217;&#233;dition de gestes en LSF.
</p>
<p>Les syst&#232;mes de description ou de notation des gestes en LSF ont g&#233;n&#233;ralement pour but de
d&#233;crire des mouvements plus ou moins structur&#233;s et codifi&#233;s. Des &#233;l&#233;ments constituant des
signes sont g&#233;n&#233;ralement identifi&#233;s ainsi que, si possible, des r&#232;gles syntaxiques et s&#233;man-
tiques r&#233;gissant leur agencement. On distingue ainsi les unit&#233;s atomiques appel&#233;es gest&#232;mes
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>548 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(Gibet et al., 2001; Vogler, 2003) (phon&#232;mes dans les langues parl&#233;es), les morph&#232;mes (plus
petites unit&#233;s porteuses de sens, encore appel&#233;es unit&#233;s phonologiques), les signes ou gloses
(combinaisons de signes), les phrases (s&#233;quence de signes), les discours. Plusieurs syst&#232;mes
de notation existent, l&#8217;un des plus utilis&#233;s aujourd&#8217;hui &#233;tant HamNoSys (Prillwitz et al., 1989).
D&#8217;autres syst&#232;mes de description suivent diff&#233;rentes approches telles que la description para-
m&#233;trique (Stokoe, 2005), l&#8217;approche structurelle phon&#233;tique (Liddell, 1989), la vis&#233;e iconique
(Cuxac, 2000) ou la repr&#233;sentation g&#233;om&#233;trique (Filhol, 2008).
</p>
<p>Les langages de sp&#233;cification permettent de d&#233;crire le comportement d&#8217;un SV &#224; l&#8217;aide d&#8217;un
formalisme de description de commandes gestuelles. Les donn&#233;es (e.g. signes, phrases, suites
de symboles, fonctions, etc.) issues de ces formalismes sont g&#233;n&#233;ralement interpr&#233;t&#233;es en
une s&#233;quence de param&#232;tres de bas niveau, qui sont directement utilis&#233;s pour produire
l&#8217;animation du SV. Un langage de sp&#233;cification peut &#234;tre vu comme une premi&#232;re Interface
Homme-Machine (IHM) o&#249; l&#8217;utilisateur peut &#233;diter, avant le lancement de l&#8217;animation, les
mouvements g&#233;n&#233;r&#233;s par le SV. Les formalismes de sp&#233;cification des gestes peuvent aller du
script bas&#233; sur la structure des &#233;l&#233;ments phon&#233;tiques ou morph&#233;miques (Gibet et al., 2001;
Elliott et al., 2008) jusqu&#8217;&#224; des langages prenant en compte d&#8217;autres aspects linguistiques
des langues des signes, tels que les classifieurs traduisant l&#8217;iconicit&#233; des signes (Huenerfauth,
2006), la description de l&#8217;espace de signation (Lenseigne et Dalle, 2006) ou la construction
syntaxique de phrases en LSF (Losson, 2000; Kervajan, 2011) par exemple.
</p>
<p>Les contributions apport&#233;es par ces langages sont multiples et vont de la description non
ambigu&#235; des signes en termes de structures s&#233;quentielles, uni-modales et &#233;voluant dans le
temps, jusqu&#8217;&#224; la prise en compte de leurs aspects modulatoires. Cependant, les langues des
signes transmettent un message exprim&#233; simultan&#233;ment via diff&#233;rents canaux i.e. plusieurs
parties du corps (e.g. mains, expression faciale, regard, etc.) (Huenerfauth, 2006; Vogler,
2003). Cette organisation parall&#233;lis&#233;e des gestes associ&#233;e &#224; la signification linguistique de
leurs composants est rarement prise en compte par ces langages. De plus, l&#8217;&#233;dition des
phrases en LSF reste complexe et fastidieuse, peu intuitive, elle n&#233;cessite de conna&#238;tre le
langage informatique et son param&#233;trage ainsi que de ma&#238;triser la structure phon&#233;tique et
morphologique des signes. Il en r&#233;sulte que les langages de sp&#233;cification ne permettent pas,
dans la majorit&#233; des cas, de d&#233;finir en un temps de sp&#233;cification satisfaisant le comportement
du SV, ni de g&#233;n&#233;rer des animations r&#233;alistes.
</p>
<p>La synth&#232;se de phrases en LSF requiert la mise en place de m&#233;thodes traduisant un sc&#233;nario
sp&#233;cifi&#233; dans l&#8217;un des formalismes d&#233;crit pr&#233;c&#233;demment, en une s&#233;quence de commandes
gestuelles interpr&#233;table par le moteur d&#8217;animation. Les m&#233;thodes bas&#233;es sur des mouvements
enregistr&#233;s lors d&#8217;une s&#233;ance de captures avec un acteur r&#233;el, permettent g&#233;n&#233;ralement
de rendre l&#8217;avatar virtuel plus &quot;expressif&quot; et &quot;naturel&quot; que les m&#233;thodes proc&#233;durales et
descriptives (Gibet et al., 2011). N&#233;anmoins, dans le cadre d&#8217;un signeur virtuel, deux difficult&#233;s
apparaissent : (i) la combinaison et le parall&#233;lisme de plusieurs canaux, i.e. la production de
gestes ex&#233;cut&#233;s simultan&#233;ment par plusieurs parties du corps incluant le torse, les &#233;paules,
les mains et le visage et (ii), la concat&#233;nation d&#8217;unit&#233;s de mouvements qui ne garantit pas
la consistance s&#233;mantique du mouvement r&#233;sultant. Dans ce contexte, aucune &#233;quipe de
recherche ne s&#8217;est int&#233;ress&#233;e &#224; cette double probl&#233;matique.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>549 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Besoins et contraintes d&#8217;un syst&#232;me d&#8217;&#233;dition de gestes
</p>
<p>L&#8217;un des points centraux d&#8217;un syst&#232;me d&#8217;&#233;dition interactive de gestes en LSF est d&#8217;utiliser,
pour la synth&#232;se des mouvements de l&#8217;avatar, des donn&#233;es captur&#233;es sur un signeur r&#233;el.
Nous proposons le sch&#233;ma conceptuel suivant, centr&#233; autour de la gestion de donn&#233;es de
la LSF pour construire de nouveaux &#233;nonc&#233;s et g&#233;n&#233;rer en sortie une animation d&#8217;un SV
(Figure 1). Nous d&#233;taillons ci-apr&#232;s les diff&#233;rents modules de cette architecture, en pr&#233;cisant
les d&#233;fis &#224; relever ainsi que les principales contraintes et limites d&#8217;un tel syst&#232;me d&#8217;&#233;dition. Ils
comprennent (i) l&#8217;annotation s&#233;mantique des donn&#233;es, (ii) la base de donn&#233;es h&#233;t&#233;rog&#232;nes
associ&#233;e au moteur de requ&#234;tes, (iii) l&#8217;IHM permettant la construction d&#8217;&#233;nonc&#233;s en LSF, (iv)
le moteur d&#8217;animation et de visualisation 3D.
</p>
<p>FIGURE 1 &#8211; Sch&#233;ma conceptuel d&#8217;un syst&#232;me d&#8217;&#233;dition de gestes en LSF
</p>
<p>Annotation s&#233;mantique des donn&#233;es : L&#8217;annotation des donn&#233;es captur&#233;es &#224; partir des
vid&#233;os r&#233;elles est une &#233;tape situ&#233;e au coeur du processus d&#8217;&#233;dition. En effet, c&#8217;est &#224; ce
niveau que s&#8217;effectue r&#233;ellement le lien entre la structuration linguistique des donn&#233;es et la
caract&#233;risation fine des &#233;l&#233;ments servant &#224; contr&#244;ler l&#8217;animation de l&#8217;avatar. Afin de r&#233;aliser
ce couplage, il est n&#233;cessaire de consid&#233;rer plusieurs pistes d&#8217;annotation ou canaux tels que
la configuration et l&#8217;emplacement des mains, l&#8217;expression faciale, la direction du regard, etc.
La segmentation temporelle permet de d&#233;finir les fragments temporels sur chacune des pistes
correspondant aux gloses, signes, &#233;l&#233;ments phonologiques et morph&#233;miques. Chaque fragment
comporte une &#233;tiquette propre aux valeurs/attributs s&#233;mantiques d&#233;finis suivant un sch&#233;ma
de sp&#233;cification phon&#233;tique/phonologique/syntaxique (Duarte, 2012). Cette annotation, &#224;
la fois spatiale et temporelle, r&#233;alis&#233;e &#224; partir des vid&#233;os enregistr&#233;es lors de la s&#233;ance de
captures de mouvements avec le logiciel ELANTM , a notamment &#233;t&#233; exploit&#233;e dans le cadre
du projet SignCom (Gibet et al., 2011).
</p>
<p>Base de donn&#233;es h&#233;t&#233;rog&#232;nes : Afin de g&#233;n&#233;rer des animations &#224; partir des donn&#233;es pr&#233;a-
lablement enregistr&#233;es, il est n&#233;cessaire de construire une base de donn&#233;es, par nature
h&#233;t&#233;rog&#232;nes, constitu&#233;e de deux parties : (i) une base de donn&#233;es de mouvements, contenant
les mouvements bruts, (ii) une base de donn&#233;es s&#233;mantiques, permettant d&#8217;indexer chaque
fragment de mouvement selon une cat&#233;gorisation linguistique. Le principal d&#233;fi technique
revient ici &#224; d&#233;finir les meilleures structures d&#8217;indexation &#224; la fois pour le texte (donn&#233;es
d&#8217;annotation) et pour le signal (donn&#233;es issues de la capture), tout en maintenant la coh&#233;-
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>550 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>rence et la consistance entre ces deux niveaux d&#8217;information. Il est important &#224; ce niveau de
consid&#233;rer l&#8217;efficacit&#233; de l&#8217;acc&#232;s aux donn&#233;es et la capacit&#233; du langage d&#8217;interrogation de la
base de donn&#233;es &#224; extraire des informations pr&#233;cises et pertinentes. Un dictionnaire met en
correspondance les annotations et les fragments de mouvements repr&#233;sent&#233;s par un ensemble
de param&#232;tres formels incluant l&#8217;identifiant du mouvement, la partie du corps concern&#233;e,
les postures de d&#233;but et de fin, etc. Pour extraire/charger un fragment de mouvement, il est
possible d&#8217;interroger directement la base de donn&#233;es brutes avec les param&#232;tres formels ou
d&#8217;interroger la base de donn&#233;es s&#233;mantiques avec une glose, qui d&#233;livrera les param&#232;tres
formels, correspondant &#224; un fragment de mouvement de la base de donn&#233;es brutes.
</p>
<p>Interface et construction d&#8217;&#233;nonc&#233;s en LSF : La manipulation d&#8217;&#233;nonc&#233;s en LSF n&#233;cessite
la mise en oeuvre de m&#233;canismes interactifs &#224; la fois intuitifs et efficaces pour caract&#233;riser les
diff&#233;rents niveaux du langage : choix des signes/gloses, ordonnancement des gloses induisant
la syntaxe des &#233;nonc&#233;s, aspects clausaux (n&#233;gation, interrogation, etc.) souvent li&#233;s aux
expressions faciales, informations &#233;motionnelles (li&#233;es &#224; la prosodie), etc. Il est n&#233;cessaire
&#233;galement de d&#233;finir la fa&#231;on de rechercher les mouvements dans le contexte de l&#8217;&#233;nonc&#233;,
ainsi que les param&#232;tres de l&#8217;animation caract&#233;risant la fluidit&#233; du mouvement. Enfin, on
pr&#233;cise &#224; ce niveau les choix d&#8217;apparence de l&#8217;avatar et les param&#232;tres li&#233;s &#224; la visualisation
3D (mod&#233;lisation 3D, habillage, sc&#232;ne, &#233;clairage, etc.).
</p>
<p>FIGURE 2 &#8211; Syst&#232;me de contr&#244;leurs dans le projet SignCom (Gibet et al., 2011). (a) arborescence
des contr&#244;leurs, (b) structures spatiale et temporelle des contr&#244;leurs. CM : contr&#244;leur de type
rejeu i.e. &quot;Motion player&quot;, CB : contr&#244;leur de type &quot;m&#233;langeur&quot; i.e. &quot;Blender&quot;.
</p>
<p>Animation du signeur virtuel : La cr&#233;ation de nouveaux mouvements peut &#234;tre r&#233;alis&#233;e par
un assemblage de deux types de composants d&#8217;animation nomm&#233;s &quot;contr&#244;leurs&quot; (Figure 2).
Le contr&#244;leur de type &quot;rejeu&quot; (CM), associ&#233; &#224; une partie du corps, r&#233;cup&#232;re un fragment de
mouvement de la base de donn&#233;es. Le contr&#244;leur de type &quot;m&#233;langeur&quot; (CB) m&#233;lange les CM
temporellement, par interpolation ou concat&#233;nation et spatialement, en donnant une priorit&#233;
dans l&#8217;ordre d&#8217;ex&#233;cution du mouvement, selon la partie du corps concern&#233;e (Figure 2(b)).
Dans le cadre du projet SignCom, des contr&#244;leurs ont &#233;t&#233; d&#233;finis &#224; l&#8217;aide d&#8217;une arborescence
(Figure 2(a)) sp&#233;cifi&#233;e dans un script textuel simple. Du point de vue de l&#8217;&#233;dition, chaque
CM repr&#233;sentant un geste, un &#233;nonc&#233; est ici d&#233;fini comme une organisation s&#233;quentielle et
parall&#232;le des gestes en LSF par cette arborescence.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>551 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Mise en oeuvre d&#8217;un syst&#232;me d&#8217;&#233;dition de gestes
</p>
<p>FIGURE 3 &#8211; Architecture du syst&#232;me d&#8217;&#233;dition de gestes
</p>
<p>Les capacit&#233;s du projet SignCom, en termes d&#8217;&#233;dition de gestes, poss&#232;dent certaines limites
telles que la non-&#233;dition des contr&#244;leurs lors de la simulation, l&#8217;utilisation de param&#232;tres
formels peu intuitifs et la non-exploitation de la base de donn&#233;es s&#233;mantiques (Gibet et al.,
2011).
</p>
<p>Pour palier ces limites, un nouveau syst&#232;me d&#8217;&#233;dition a &#233;t&#233; cr&#233;&#233; (Figure 3). Ce syst&#232;me
repose sur l&#8217;&#233;volution de l&#8217;architecture du projet SignCom et sur un couple &quot;module d&#8217;&#233;di-
tion&quot;/&quot;interface graphique&quot;. Ce couple offre les moyens de cr&#233;er et de sp&#233;cifier les contr&#244;leurs
ainsi que d&#8217;observer une repr&#233;sentation de leur arborescence (Figure 5). Ce syst&#232;me permet,
de plus, d&#8217;interroger la base de donn&#233;es avec une glose (i.e. interrogation de la base de
donn&#233;es s&#233;mantiques) ou avec l&#8217;ensemble des param&#232;tres formels (i.e. interrogation de la
base de donn&#233;es brutes) dans le but d&#8217;extraire un fragment de mouvement et de le charger
dans un CM.
</p>
<p>FIGURE 4 &#8211; (a) Visualisation de l&#8217;avatar signeur (b) Construction d&#8217;&#233;nonc&#233;s &#224; partir de la
sp&#233;cification de la s&#233;quence de signes / gloses et des contr&#244;leurs associ&#233;s sur les diff&#233;rents
canaux gestuels
</p>
<p>Par cons&#233;quent, cr&#233;er et &#233;diter de nouveaux &#233;nonc&#233;s revient &#224; sp&#233;cifier et &#224; &#233;diter, de mani&#232;re
compl&#232;te, la s&#233;quence de signes, &#224; identifier les contr&#244;leurs correspondants sur chaque
partie du corps et leur hi&#233;rarchie par l&#8217;interm&#233;diaire de l&#8217;interface graphique ; la qualit&#233; de
l&#8217;animation r&#233;sultante peut &#234;tre &#233;valu&#233;e en temps r&#233;el (Figure 4).
</p>
<p>L&#8217;interface graphique est illustr&#233;e par la partie gauche de la figure 5(a). La partie &quot;Bvh File
search&quot; permet de sp&#233;cifier le type de contr&#244;leurs ainsi que ses param&#232;tres formels pour les
CM et son type d&#8217;algorithme de m&#233;lange pour les CB. La cr&#233;ation d&#8217;un CM, par une recherche
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>552 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(a) (b)
</p>
<p>FIGURE 5 &#8211; (a) Aper&#231;u de l&#8217;interface graphique (b) Extrait d&#8217;un sc&#233;nario construit o&#249; l&#8217;avatar
d&#233;crit la pr&#233;paration d&#8217;un cocktail
</p>
<p>selon une ou plusieurs glose(s) dans la base de donn&#233;es, peut &#234;tre effectu&#233;e par la section
&quot;Search by keywords&quot;. La partie &quot;Up to date&quot; est d&#233;di&#233;e &#224; l&#8217;&#233;dition de chaque type de param&#232;tre
d&#8217;un contr&#244;leur, avec une sous-section propre &#224; chaque type. La hi&#233;rarchie des contr&#244;leurs est
affich&#233;e &quot;textuellement&quot; (Figure 5(a) haut gauche). Enfin, la figure 5(b) montre un extrait
d&#8217;un sc&#233;nario construit sur le th&#232;me de la description de l&#8217;&#233;laboration d&#8217;un cocktail.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Cet article pr&#233;sente un premier syst&#232;me original d&#8217;&#233;dition interactive de gestes de la Langue
des Signes Fran&#231;aise (LSF) d&#233;di&#233; aux Signeurs Virtuels (SV). Reposant sur une base de donn&#233;es
h&#233;t&#233;rog&#232;nes de mouvements captur&#233;s et annot&#233;s, ce syst&#232;me permet la concat&#233;nation et le
m&#233;lange de gestes temporellement et spatialement &#224; l&#8217;aide d&#8217;une interface graphique.
</p>
<p>L&#8217;enrichissement d&#8217;un corpus de mouvements captur&#233;s de la LSF pour les SV demeure un
probl&#232;me complexe. Les solutions existantes peuvent &#234;tre co&#251;teuses et laborieuses (e.g.
s&#233;ances de captures de mouvements suppl&#233;mentaires) ou incertaines (e.g. application de
transformations sur des fragments de mouvements modifiant leur s&#233;mantique). L&#224; o&#249; le
mouvement est &#233;troitement li&#233; &#224; une s&#233;mantique, les syst&#232;mes d&#8217;&#233;dition de gestes en LSF
d&#233;di&#233;s aux SV semblent &#234;tre de plus en plus n&#233;cessaires pour construire, &#233;diter et enrichir de
tels corpus.
</p>
<p>Les perspectives de ces travaux reposent sur l&#8217;enregistrement, dans la base de donn&#233;es
h&#233;t&#233;rog&#232;nes, des nouveaux mouvements cr&#233;&#233;s ainsi que de leurs s&#233;mantiques associ&#233;es de
mani&#232;re optimale. Pour cela, la recherche d&#8217;une interface d&#8217;&#233;dition plus compl&#232;te et plus
intuitive (e.g. &#233;dition graphique de la hi&#233;rarchie des contr&#244;leurs) sera poursuivie selon deux
directions : (i) l&#8217;abstraction de tout param&#232;tre num&#233;rique pour les non-experts du domaine de
l&#8217;animation et (ii) l&#8217;&#233;dition aux niveaux spatial et temporel de la s&#233;mantique des mouvements
cr&#233;&#233;s &#224; l&#8217;image des syst&#232;mes d&#8217;annotation vid&#233;o actuels (e.g. logiciel ELAN). Des algorithmes
d&#8217;apprentissage seront, par la suite, &#233;tudi&#233;s pour construire un syst&#232;me de &quot;suggestions
s&#233;mantiques&quot; des mouvements cr&#233;&#233;s par l&#8217;utilisateur, en fonction des op&#233;rations d&#8217;&#233;dition
effectu&#233;es.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>553 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>CUXAC, C. (2000). La langue des signes fran&#231;aise (lsf) : les voies de l&#8217;iconocit&#233;. In Faits de
langues, num&#233;ro 15&#8211;16. Ophrys.
DUARTE, K. (2012). Motion capture and avatars as portals for analyzing the linguistic
structure of signed languages. In PhD thesis, Universit&#233; de Bretagne Sud.
ELLIOTT, R., GLAUERT, J. R. W., KENNAWAY, J. R., MARSHALL, I. et SAFAR, E. (2008). Linguistic
modelling and language-processing technologies for avatar-based sign language presentation.
In Universal Access in the Information Society, volume 6, pages 375&#8211;391.
FILHOL, M. (2008). Mod&#232;le descriptif des signes pour un traitement automatique des langues
des signes. In Th&#232;se de doctorat, Universit&#233; Paris-Sud.
GIBET, S., COURTY, N., DUARTE, K. et NAOUR, T. L. (2011). The signcom system for data-
driven animation of interactive virtual signers : Methodology and evaluation.
</p>
<p>.
GIBET, S., LEBOURQUE, T. et MARTEAU, P. (2001). High level specification and animation of
communicative gestures. In Journal of Visual Languages and Computing, volume 12, pages
657&#8211;687.
H&#201;LOIR, A. (2008). Syst&#232;me de communication par agent virtuel, aide &#224; la communication
des personnes sourdes. In Th&#232;se de doctorat, Universit&#233; de Bretagne Sud, pages 168&#8211;171.
HUENERFAUTH, M. (2006). Generating american sign language classifier predicates for
english-to-asl machine translation. In Th&#232;se de doctorat, University of Pennsylvania.
KERVAJAN, L. (2011). Contribution &#224; la traduction automatique francais / langue des signes
fran&#231;aise (lsf) au moyen de personnages virtuels. In PhD thesis, Universit&#233; d&#8217;Aix/Marseille.
LENSEIGNE, B. et DALLE, P. (2006). Using signing space as a representation for sign language
processing. In GIBET, S. et al., &#233;diteurs : Gesture in Human-Computer Interaction and
Simulation, GW, Lecture Notes in Computer Science, volume 3881, pages 256&#8211;260. Kluwer
Academic.
LIDDELL, S K et Johnson, R. E. (1989). American sign language : The phonological base. In
Studies in the Linguistic Sciences, volume 64, pages 197&#8211;277.
LOSSON, O. (2000). Mod&#233;lisation du geste communicatif et r&#233;alisation d&#8217;un signeur virtuel
de phrases en langue des signes fran&#231;aise. In PhD thesis, Universit&#233; de Lille.
PARISOT, A. M., S, R., S, V. et A, V. (2010). Construire et d&#233;construire l&#8217;espace dans une langue
des signes : d&#233;monstration d&#8217;un protocole d&#8217;enregistrement simultan&#233; des mouvements des
membres sup&#232;rieurs et du globe oculaire. In Atelier TALS 2010 dans le cadre du congr&#232;s TALN
2010.
PRILLWITZ, S., LEVEN, R., ZIENERT, H., HANKE, T. et HENNING, J. (1989). Hamburg Notation
System for Sign Languages - An Introductory Guide. University of Hamburg Press.
STOKOE, W. C. (2005). Sign language structure : an outline of the communication systems
of the american deaf. In Linguistics, Occasional Papers 8 (1960), Journal of Deaf Studies and
Deaf Education, volume 10, pages 3&#8211;37.
VOGLER, C. (2003). American sign language recognition : Reducing the complexity of the
task with phoneme-based modeling and parallel hidden markov models. In PhD Thesis,
University of Pennsylvania.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>554 c&#65535; ATALA</p>

</div></div>
</body></html>