<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apprentissage supervis&#233; pour l&#8217;identification de relations s&#233;mantiques au sein de structures &#233;num&#233;ratives parall&#232;les</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage supervis&#233; pour l&#8217;identification de relations
s&#233;mantiques au sein de structures &#233;num&#233;ratives parall&#232;les
</p>
<p>Jean-Philippe Fauconnier1 Mouna Kamel1 Bernard Rothenburger1
Nathalie Aussenac-Gilles1
</p>
<p>(1) IRIT, 118 route de Narbonne 31060 Toulouse Cedex 5
{pr&#233;nom}.{nom}@irit.fr
</p>
<p>R&#201;SUM&#201;
Ce travail s&#8217;inscrit dans le cadre de la construction et l&#8217;enrichissement d&#8217;ontologies &#224; partir
de textes de type encyclop&#233;dique ou scientifique. L&#8217;originalit&#233; de notre travail r&#233;side dans
l&#8217;extraction de relations s&#233;mantiques exprim&#233;es au-del&#224; de la lin&#233;arit&#233; du texte. Pour cela, nous
nous appuyons sur la s&#233;mantique v&#233;hicul&#233;e par les caract&#232;res typo-dispositionels qui ont pour
fonction de suppl&#233;er des formulations strictement linguistiques qui seraient plus difficilement
exploitables. L&#8217;&#233;tude que nous proposons concerne les relations s&#233;mantiques port&#233;es par les
structures &#233;num&#233;ratives parall&#232;les qui, bien qu&#8217;affichant des discontinuit&#233;s entre ses diff&#233;rents
composants, pr&#233;sentent un tout sur le plan s&#233;mantique. Ce sont des structures textuelles qui sont
propices aux relations hi&#233;rarchiques. Apr&#232;s avoir d&#233;fini une typologie des relations port&#233;es par ce
type de structure, nous proposons une approche par apprentissage visant &#224; leur identification.
Sur la base de traits incorporant informations lexico-syntaxiques et typo-dispositionnelles, les
premiers r&#233;sultats aboutissent &#224; une exactitude de 61,1%.
</p>
<p>ABSTRACT
A Supervised learning for the identification of semantic relations in parallel enumerative
structures
</p>
<p>This work falls within the framework of ontology engineering and learning from encyclopedic or
scientific texts. Our original contribution lies within the extraction of semantic relations expressed
beyond the text linearity. To this end, we relied on the semantics behind the typo-dispositional
characters whose function is to supplement the strictly linguistic formulations that could be
more difficult to exploit. The work reported here is dealing with the semantic relations carried
by the parallel enumerative structures. Although they display discontinuities between their
various components, these enumerative structures form a whole at the semantic level. They
are textual structures that are prone to hierarchic relations. After defining a typology of the
relationships carried by this type of structure, we are proposing a learning approach aimed at their
identification. Based on features including lexico-syntactic and typo-dispositional informations,
the first results led an accuracy of 61.1%.
</p>
<p>MOTS-CL&#201;S : extraction de relations, structures &#233;num&#233;ratives parall&#232;les, mise en forme mat&#233;-
rielle, apprentissage supervis&#233;, construction d&#8217;ontologies.
</p>
<p>KEYWORDS: relationship extraction, parallel enumerative structures, material shaping, supervi-
sed learning, ontology learning.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>132 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>La construction d&#8217;ontologies est un processus fastidieux qui n&#233;cessite la contribution d&#8217;experts
d&#8217;un domaine. Une mani&#232;re de rendre ce processus moins co&#251;teux consiste &#224; exploiter automati-
quement certains types de textes, comme les textes de nature encyclop&#233;dique ou scientifique,
afin d&#8217;en extraire les connaissances. G&#233;n&#233;ralement, cette exploitation de textes s&#8217;appuie sur des
analyses statistiques et/ou des analyses linguistiques essentiellement focalis&#233;es sur les niveaux
lexicaux et syntaxiques. Citons notamment l&#8217;approche par apprentissage automatique (N&#233;dellec
et al., 2009), l&#8217;utilisation de patrons (Giuliano et al., 2006) ou encore une approche hybride
combinant les deux (Giovannetti et al., 2008).
</p>
<p>Cependant, ces approches souffrent de deux limites : (1) l&#8217;analyse se situe en g&#233;n&#233;ral &#224; un niveau
intraphrastique ou, du moins, textuellement lin&#233;aire et (2) l&#8217;extraction de connaissances se base
sur des indices syntaxiques sans prendre en compte les caract&#233;ristiques de mise en forme du
texte. Or, il existe des relations qui se mat&#233;rialisent au travers de marqueurs paralinguistiques
(marqueurs typographiques et/ou dispositionnels). Ces derniers, d&#233;passant leur r&#244;le de mise en
forme, sont des &#233;l&#233;ments structurants porteurs de s&#233;mantique. (Virbel et al., 2005) th&#233;orise ces
marqueurs et leur utilisation au sein de la notion de mise en forme mat&#233;rielle (MFM). Des analyses
linguistiques fines ont mis en &#233;vidence le r&#244;le fondamental de celle-ci dans l&#8217;interpr&#233;tation d&#8217;un
texte et dans la caract&#233;risation de certains objets textuels tels que les titres (Rebeyrolle et al.,
2009), les d&#233;finitions (Pascual et P&#233;ry-Woodley, 1995) et les structures &#233;num&#233;ratives (Luc, 2001).
</p>
<p>Pour am&#233;liorer la construction d&#8217;ontologies, nous nous int&#233;ressons aux structures &#233;num&#233;ratives
(SE) parall&#232;les avec MFM. En tant que SE, elles sont porteuses de connaissances hi&#233;rarchiques.
Leur caract&#232;re parall&#232;le implique une composition homog&#232;ne d&#8217;un point de vue grammatical,
typo-dispositionnel et fonctionnel. Elles disposent souvent des propri&#233;t&#233;s textuelles qui les rendent
visuellement perceptibles et ces propri&#233;t&#233;s sont suffisamment stables pour que leur rep&#233;rage
automatique puisse &#234;tre envisag&#233; (Ho-Dac et al., 2012). Enfin, leur fr&#233;quence au sein des textes
scientifiques, proc&#233;duraux ou encyclop&#233;diques reste &#233;lev&#233;e.
</p>
<p>Les approches pr&#233;c&#233;dentes (Kamel et Rothenburger, 2011; Kamel et al., 2012) ont montr&#233;
les limites d&#8217;une approche symbolique pour l&#8217;extraction des relations s&#233;mantiques au sein des
SE. Dans cet article, nous proposons deux m&#233;thodes par apprentissage supervis&#233;. La premi&#232;re
combine des traits linguistiques et paralinguistiques et la seconde repose sur des trigrammes. Ce
travail est une premi&#232;re &#233;tape vers l&#8217;exploitation de SE pour la construction d&#8217;ontologies.
La section 2 introduit les SE. La section 3 pr&#233;sente les classes de relations, le corpus ainsi que
le mode d&#8217;&#233;valuation. La section 4 d&#233;crit le classifieur d&#8217;entropie maximale (MaxEnt) ainsi que
les deux approches. La section 5 pr&#233;sente les r&#233;sultats obtenus par validation crois&#233;e. Enfin, la
conclusion revient sur l&#8217;int&#233;r&#234;t de ce travail et esquisse quelques perspectives.
</p>
<p>2 Les structures &#233;num&#233;ratives
</p>
<p>L&#8217;acte d&#8217;&#233;num&#233;ration consiste &#224; regrouper des &#233;l&#233;ments ind&#233;pendants sous un m&#234;me crit&#232;re
d&#8217;homog&#233;n&#233;it&#233; (Pery-Woodley, 2001). La forme g&#233;n&#233;rale d&#8217;une structure &#233;num&#233;rative (SE) est
caract&#233;ris&#233;e par une amorce, une &#233;num&#233;ration compos&#233;e d&#8217;au moins deux items et &#233;ventuellement
une cl&#244;ture (ou conclusion). Cette structure logique g&#233;n&#233;rique peut se d&#233;cliner concr&#232;tement
par des dispositifs linguistiques ou textuels diff&#233;rents. Elle peut &#234;tre &#233;nonc&#233;e au fil du texte en
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>133 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>dehors de toute mise en forme mat&#233;rielle (MFM) et dans ce cas les items sont introduits par des
marqueurs lexicaux qui sont souvent des groupes adverbiaux (par exemple &#171; premi&#232;rement &#187;,
&#171; deuxi&#232;mement &#187;, &#171; troisi&#232;mement &#187; dans (1)), ou au contraire &#234;tre mise en &#233;vidence par l&#8217;usage
de marqueurs typographiques et dispositionnels sp&#233;cifiques (comme les caract&#232;res de ponctuation,
les retraits, les tirets dans (2)).
</p>
<p>(1) Comment faire pour &#233;conomiser 68% d&#8217;&#233;lectricit&#233; par rapport &#224; une d&#233;pense habituelle ?
Premi&#232;rement, en &#233;teignant la lumi&#232;re d&#232;s votre sortie d&#8217;une pi&#232;ce. Cela peut para&#238;tre
banal, mais &#231;a ne l&#8217;est absolument pas. Deuxi&#232;mement, &#233;vitez les lampes halog&#232;nes, car
une lampe halog&#232;ne de 500 watts consomme l&#8217;&#233;quivalent de 23 lampes. Troisi&#232;mement,
essayez de remplacer les lampes traditionnelles par des lampes basse consommation.
</p>
<p>(2) Les formes de communication non parl&#233;es sont :
&#8211; le langage &#233;crit,
&#8211; le langage des signes,
&#8211; le langage siffl&#233;.
</p>
<p>Il existe plusieurs d&#233;finitions de l&#8217;&#233;num&#233;ration. La d&#233;finition qui nous semble le mieux prendre
en compte &#224; la fois les ph&#233;nom&#232;nes architecturaux du texte et l&#8217;intention de l&#8217;auteur est celle
propos&#233;e par (Virbel, 1999) : &#171; &#233;num&#233;rer mobilise deux actes : un acte mental d&#8217;identification
des &#233;l&#233;ments d&#8217;une r&#233;alit&#233; du monde dont on vise un recensement, et o&#249; on &#233;tablit une relation
d&#8217;&#233;galit&#233; d&#8217;importance par rapport au motif de recensement ; et un acte textuel qui consiste &#224;
transposer textuellement la co&#233;num&#233;rabilit&#233; des entit&#233;s recens&#233;es, par la co&#233;num&#233;rabilit&#233; des
segments linguistiques qui les d&#233;crivent. &#187;.
</p>
<p>(Luc, 2001) a &#233;tabli une typologie des SE permettant de distinguer les structures homog&#232;nes
vs. h&#233;t&#233;rog&#232;nes, les structures syntagmatiques vs. paradigmatiques, et les structures isol&#233;es vs.
non isol&#233;es. Les structures h&#233;t&#233;rog&#232;nes pr&#233;sentent des items ayant des propri&#233;t&#233;s visuelles non
&#233;quivalentes et sont plus difficilement rep&#233;rables automatiquement en corpus. Les structures
syntagmatiques entretiennent des liens de d&#233;pendance entre les items, et les structures non
isol&#233;es entretiennent des relations avec des unit&#233;s textuelles localis&#233;es en dehors de la structure
&#233;num&#233;rative. Les SE paradigmatiques, homog&#232;nes et isol&#233;es sont dites parall&#232;les.
</p>
<p>FIGURE 1 &#8211; Repr&#233;sentations s&#233;mantiques de la structure &#233;num&#233;rative
</p>
<p>Notre &#233;tude se focalise ici sur la SE parall&#232;le car son analyse rh&#233;torique (bas&#233;e, par exemple, sur
les principes de la RST (Carlson et al., 2001)) permet d&#8217;&#233;tablir une relation noyau-satellite qui relie
l&#8217;amorce (unit&#233; d&#8217;information la plus saillante) &#224; l&#8217;&#233;num&#233;ration (unit&#233; d&#8217;information qui supporte
l&#8217;information d&#8217;arri&#232;re-plan), et une relation multi-nucl&#233;aire qui relie les items (arguments de
m&#234;me importance). La relation noyau-satellite sera g&#233;n&#233;ralement de type elaboration et la
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>134 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>relation multi-nucl&#233;aire de type list. Une relation hi&#233;rarchique entre l&#8217;amorce et chacun des items
est ainsi mise en &#233;vidence. Dans ce cadre, nous envisageons de traduire cette structure rh&#233;torique
en une structure hi&#233;rarchique o&#249; les entit&#233;s conceptuelles d&#233;not&#233;es par des termes pr&#233;sents dans
les segments textuels seraient extraites et reli&#233;es par la relation de type noyau-satellite identifi&#233;e
en discours (Figure 1).
</p>
<p>Identifier les relations port&#233;es par les SE parall&#232;les avec MFM est l&#8217;objet de ce travail, car elles ont
les propri&#233;t&#233;s (1) d&#8217;&#234;tre homog&#232;nes et de b&#233;n&#233;ficier de traits de formatage assez r&#233;guliers pour
que d&#8217;une part leur identification automatique en corpus puisse &#234;tre envisag&#233;e, et que d&#8217;autre
part les aspects typo-dispositionnels permettent de spatialiser le discours, et donc d&#8217;aider &#224; la
d&#233;sambigu&#239;sation, et (2) d&#8217;&#234;tre paradigmatiques et isol&#233;es, ce qui assure l&#8217;unicit&#233; de la relation
port&#233;e par la structure. Les processus d&#8217;identification des SE en texte ainsi que des concepts et
instances au sein de ces derni&#232;res font l&#8217;objet de travaux compl&#233;mentaires non discut&#233;s dans
cet article. L&#8217;approche que nous d&#233;veloppons ici est endog&#232;ne dans le sens o&#249; les indices qui
permettent d&#8217;identifier la relation sont recherch&#233;s au sein de la SE.
</p>
<p>3 Classes, corpus et mode d&#8217;&#233;valuation
</p>
<p>3.1 Classes
</p>
<p>L&#8217;arbre issu de l&#8217;analyse rh&#233;torique (Figure 1) r&#233;v&#232;le souvent l&#8217;existence de connaissances ontolo-
giques ou lexicales port&#233;es par la SE parall&#232;le. Le but de ce travail est de d&#233;tecter automatique-
ment la nature de la relation unique entre l&#8217;amorce et les items, lorsque cela est possible.
</p>
<p>Classes Description
isA Relation hi&#233;rarchique d&#8217;hyperonymie.
partOf Relation hi&#233;rarchique de m&#233;ronymie.
instanceOf Relation entre un concept et les instances de ce
</p>
<p>concept.
autreOntologique Relations non-taxonomiques (e.g : isCauseOf, re-
</p>
<p>quires, etc.).
lexical Relation lexicale entre termes (homonymie, syno-
</p>
<p>nymie, etc.).
autres Cas ambigus et relations que l&#8217;on ne peut r&#233;soudre.
</p>
<p>TABLE 1 &#8211; Annotation du corpus en 6 classes par 4 annotateurs
</p>
<p>Pour transformer notre probl&#232;me d&#8217;identification de relations en un probl&#232;me de classification
multi-classes, nous avons d&#233;fini des classes correspondant aux relations recherch&#233;es. Nous distin-
guons 6 classes (Table 1) : isA, partOf, instanceOf, autreOntologique, lexical et autres.
&#192; proprement parler, toutes les relations que nous d&#233;sirons identifier sont lexicales, en ce sens
qu&#8217;elles lient des termes au sein du texte. Cependant, dans leur d&#233;nomination, nous diff&#233;rencions
les relations par le r&#244;le qu&#8217;elles peuvent jouer, a posteriori, au sein d&#8217;une ressource s&#233;mantique.
Par exemple, bien que les classes isA (exemple (2)) et partOf d&#233;signent les relations d&#8217;hyperony-
mie et de m&#233;ronymie dans le domaine terminologique, nous nous r&#233;f&#233;rons &#224; ces derni&#232;res sous
l&#8217;appellation usit&#233;e dans le domaine des ontologies.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>135 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La classe autreOntologique comprend les relations non-taxonomiques entre concepts
(exemple (3)). La classe lexical reprend les relations lexicales (synonymie, homonymie, etc.) et,
&#233;ventuellement, les cas d&#8217;inclusion lexicale.
</p>
<p>(3) Tous les barrages class&#233;s (A, B, C et D) doivent disposer :
&#8211; d&#8217;une consigne de crue ;
&#8211; d&#8217;un dispositif d&#8217;auscultation adapt&#233;.
</p>
<p>La classe autres regroupe les cas ambigus, tels que ceux pr&#233;sent&#233;s par les SE navigationnelles et
de titraille, et les relations que l&#8217;on ne peut r&#233;soudre. L&#8217;exemple (4) donne une SE de titraille qui
structure un propos, un document. L&#8217;exemple (5) reprend une SE &#224; vis&#233;e navigationnelle, cas
courant dans les ressources informatis&#233;es qui utilisent des liens hypertextes (indiqu&#233;s ici par la
mise en gras). Les liens hypertextes nous indiquent qu&#8217;il y a une plus grande probabilit&#233; que la
relation port&#233;e par la SE lie des documents et non pas des termes. Enfin, l&#8217;exemple (6) pr&#233;sente
un cas o&#249; il s&#8217;agit d&#8217;une &#233;laboration argumentative et non ontologique.
</p>
<p>(4) Pr&#233;sentation
1 Fonctionnement
2 Terminologie
</p>
<p>(5) Transports en commun
&#8211; Portail des transports en commun
&#8211; Portail du chemin de fer
</p>
<p>(6) Le transformateur d&#8217;isolement comporte deux enroulements presque identiques au
primaire et au secondaire :
&#8211; le nombre de spires du secondaire est souvent tr&#232;s l&#233;g&#232;rement sup&#233;rieur au nombre de
</p>
<p>spires du primaire afin de compenser la faible chute de tension en fonctionnement ;
&#8211; en th&#233;orie, les sections de fil au primaire et au secondaire sont identiques, car
</p>
<p>l&#8217;intensit&#233; des courants est la m&#234;me.
</p>
<p>3.2 Corpus
</p>
<p>Les donn&#233;es utilis&#233;es dans notre travail sont issues des travaux de (Kamel et Rothenburger, 2011)
visant l&#8217;enrichissement de l&#8217;ontologie OntoTopo, construite dans le cadre de l&#8217;ANR GEONTO 1.
Cette ontologie mod&#233;lise les domaines de l&#8217;am&#233;nagement urbain, l&#8217;environnement et l&#8217;organi-
sation territoriale. (Kamel et Rothenburger, 2011) ont construit leur corpus en projetant les
concepts de l&#8217;ontologie OntoTopo sur les pages de Wikip&#233;dia et en extrayant, dans les pages ainsi
retenues, les SE parall&#232;les rencontr&#233;es. Par leur caract&#232;re encyclop&#233;dique, les pages Wikip&#233;dia
ordonnent de nombreuses d&#233;finitions et propri&#233;t&#233;s au moyen de marqueurs typo-dispositionnels.
Le nombre relativement &#233;lev&#233; de SE parall&#232;les par page s&#8217;explique notamment par la recomman-
dation du &#171; Manuel of Style &#187; de Wikip&#233;dia 2 qui pr&#233;conise une forme grammaticale identique
pour tous les items d&#8217;une SE. Au final, 2317 SE furent extraites de 276 pages.
</p>
<p>&#192; partir de ce travail, nous avons construit deux corpus respectivement nomm&#233;s CORPUS_SE
et CORPUS_DISTRIB. Ces derniers reprennent 1000 SE annot&#233;es par quatre annotateurs : deux
ing&#233;nieurs de la connaissance, un ergonome et une &#233;tudiante. La t&#226;che d&#8217;annotation a consist&#233;
&#224; classer parmi les six classes d&#233;finies en section 3.1 la relation s&#233;mantique port&#233;e par la SE
parall&#232;le. Un &#954; de Fleiss (Fleiss et al., 1979), sous l&#8217;hypoth&#232;se nulle de jugements ind&#233;pendants,
</p>
<p>1. Collaboration entre le COGIT, le LRI, le LIUPPA et l&#8217;IRIT - http://geonto.lri.fr/
2. http://en.wikipedia.org/wiki/Wikipedia:Manual_of_Style
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>136 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pr&#233;sente un accord inter-annotateurs, relativement correct pour six classes 3, de 0,559 (Table
2). Notons que la corr&#233;lation entre les deux ing&#233;nieurs de la connaissance est nettement plus
grande (0,686). Seule la classe autreOntologique pr&#233;sente un accord relativement bas (0,299) qui
s&#8217;explique par ses caract&#233;ristiques formelles peu stables. En cas de d&#233;saccord dans l&#8217;annotation,
la classe finale d&#8217;une SE est d&#233;cid&#233;e par consensus entre les diff&#233;rents annotateurs.
</p>
<p>Classe Kappa Var Z-score p-score IC 95%
isA 0,509 0,001033 15,859 &lt; 1E-09 [0,446 ;0,572]
partOf 0,493 0,001275 13,808 &lt; 1E-09 [0,423 ;0,563]
autreOntologique 0,299 0,000945 09,735 &lt; 1E-09 [0,238 ;0,359]
instanceOf 0,652 0,000975 20,895 &lt; 1E-09 [0,591 ;0,713]
lexical 0,636 0,000974 20,392 &lt; 1E-09 [0,575 ;0,697]
autres 0,641 0,001369 17,323 &lt; 1E-09 [0,568 ;0,713]
Corpus 0,559 3,112E-05 100,269 &lt;1E-09 [0,548 ;0,570]
</p>
<p>TABLE 2 &#8211; Annotation du corpus en 6 classes par 4 annotateurs
</p>
<p>Les deux corpus ont &#233;t&#233; &#233;tiquet&#233;s grammaticalement et morpho-syntaxiquement par l&#8217;outil
Talismane (Urieli et Fauconnier, 2012) entra&#238;n&#233; sur le French TreeBank (Abeill&#233; et al., 2003)
dans sa version en d&#233;pendances (Candito et al., 2009). CORPUS_SE totalise 1000 SE et comprend
80 774 tokens. Ces 1000 SE pr&#233;sentent en moyenne 4,31 items par individu. Afin d&#8217;&#233;valuer notre
m&#233;thode sur sa capacit&#233; &#224; identifier la relation entre une amorce et un item, nous avons construit
le corpus CORPUS_DISTRIB en distribuant, pour chaque SE de CORPUS_SE, son amorce sur les n
items qu&#8217;elle contient afin de construire n paires amorce-item. CORPUS_DISTRIB totalise 4317
paires amorce-item et comprend 119 272 tokens.
</p>
<p>Dans CORPUS_SE, la r&#233;partition des SE d&#233;note un d&#233;s&#233;quilibre entre la classe autres et le reste des
classes (Figure 2). Un autre d&#233;s&#233;quilibre appara&#238;t au niveau du nombre d&#8217;items de chaque SE
(Table 3). La classe instanceOf contient des SE avec un nombre d&#8217;items sup&#233;rieur &#224; 20, dont l&#8217;une
&#233;num&#232;re plus de soixante types de sports collectifs. Avec une moyenne de 6,95 items par SE, la
classe instanceOf est celle qui pr&#233;sente les valeurs les plus extr&#234;mes, suivie par la classe isA avec
une moyenne de 4,25 items par SE. Ce d&#233;s&#233;quilibre entre les items influence la r&#233;partition des
paires amorce-item au sein de CORPUS_DISTRIB (Figure 2).
</p>
<p>FIGURE 2 &#8211; R&#233;partition des SE dans CORPUS_SE et des paires amorce-item dans CORPUS_DISTRIB
</p>
<p>3. Le &#954; de Fleiss est sensible aux nombres de cat&#233;gories.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>137 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Classe SE Nb. items min-max Moyenne &#963; IC 95%
isA 229 973 2 - 20 4,25 2,71 [3,90 ;4,60]
partOf 42 173 2 - 11 4,12 1,89 [3,53 ;4,71]
autreOntologique 76 299 2- 10 3,93 1,84 [3,51 ;4,36]
instanceOf 177 1231 2 - 63 6,95 6,99 [5,92 ;7,99]
lexical 96 377 2 - 14 3,93 2,03 [3,52 ;4,34]
autres 380 1264 2 - 13 3,33 1,76 [3,15 ;3,50]
Total 1000 4317 2 - 63 4,31 3,72 [4,07 ;4,54]
</p>
<p>TABLE 3 &#8211; Nombre d&#8217;items par classes
</p>
<p>3.3 Mode d&#8217;&#233;valuation
</p>
<p>Rappelons que les SE parall&#232;les pr&#233;sentent la particularit&#233; que chaque item est reli&#233; &#224; l&#8217;amorce
par une m&#234;me relation (Section 2). Par cons&#233;quent, il est possible d&#8217;identifier la relation enti&#232;re
port&#233;e par une SE si la relation entre son amorce et l&#8217;un de ses items est identifi&#233;e.
Dans cet objectif, nous proposons deux m&#233;thodes de classification par apprentissage supervis&#233;.
La premi&#232;re m&#233;thode utilise des traits linguistiques et paralinguistiques. La seconde repose sur
des trigrammes de tokens. En outre, nous posons une baseline na&#239;ve qui classe tous les individus
dans la classe majoritaire autres.
</p>
<p>Les deux m&#233;thodes ainsi que la baseline ont &#233;t&#233; &#233;valu&#233;es dans trois t&#226;ches :
&#8211; La t&#226;che 1 vise &#224; la classification des SE issues de CORPUS_SE (1000 SE &#224; classer). Dans la
figure 1, il s&#8217;agit de classer la SE en identifiant la relation entre l&#8217;amorce et l&#8217;item1.
</p>
<p>&#8211; La t&#226;che 2 vise la classification des paires amorce-item de CORPUS_DISTRIB (4317 paires &#224;
classer). Dans la figure 1, il s&#8217;agit de classer les relations unissant amorce-item1, amorce-item2
et amorce-item3.
</p>
<p>&#8211; La t&#226;che 3 vise la classification des SE de CORPUS_SE &#224; partir de la moyenne des pr&#233;dictions de
leurs paires amorce-item issues de CORPUS_DISTRIB (1000 SE &#224; classer &#224; partir des pr&#233;dictions de
4317 paires). Dans la figure 1, il s&#8217;agit de classer la SE en calculant la moyenne des pr&#233;dictions
de amorce-item1, amorce-item2 et amorce-item3.
</p>
<p>Pour les trois t&#226;ches (et les 9 &#233;valuations correspondantes), nous proc&#233;dons &#224; une validation
crois&#233;e &#224; 10 &#233;chantillons et mesurons l&#8217;exactitude (micro-average) pour la classification toutes
classes confondues ainsi que rappel, pr&#233;cision et F-mesure pour chacune des classes :
</p>
<p>exactitude=
</p>
<p>&#65535;C
i
</p>
<p>&#65535;
V Pi + VNi
</p>
<p>&#65535;&#65535;C
i
</p>
<p>&#65535;
V Pi + VNi + FPi + FNi
</p>
<p>&#65535;
pre&#769;cisioni =
</p>
<p>V Pi
V Pi + FPi
</p>
<p>rappeli =
V Pi
</p>
<p>V Pi + FNi
F1i = 2
</p>
<p>pre&#769;cisioni rappeli
pre&#769;cisioni + rappeli
</p>
<p>o&#249; V Pi , VNi , FPi et FNi sont respectivement le nombre de Vrais Positifs, Vrais N&#233;gatifs, Faux
Positifs et Faux N&#233;gatifs de classes i &#224; C o&#249; C est le nombre de classes. L&#8217;exactitude permet
d&#8217;&#233;valuer la capacit&#233; pr&#233;dictive d&#8217;un mod&#232;le en donnant un poids proportionnel &#224; chaque classe.
Nous donnons aussi un &#233;cart type qui, selon (Kohavi et al., 1995), peut &#234;tre estim&#233; (o&#249; N est le
nombre d&#8217;individus) :
</p>
<p>&#963; =
</p>
<p>&#65535;
exactitude (1&#8722; exactitude)
</p>
<p>N
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>138 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 Le mod&#232;le d&#8217;apprentissage
</p>
<p>4.1 Maximum d&#8217;entropie
</p>
<p>Pour notre t&#226;che de classification, nous avons adopt&#233; un mod&#232;le conditionnel d&#8217;entropie maxi-
male, dit aussi MaxEnt (Berger et al., 1996). Ce mod&#232;le, qui a d&#233;j&#224; fait ses preuves en TAL, permet
de g&#233;rer de mani&#232;re flexible un grand nombre de traits et repose sur le principe de maximisation
d&#8217;entropie. Ce dernier vise &#224; d&#233;finir une contrainte pour chaque information observ&#233;e et choisir
la distribution qui maximise l&#8217;entropie tout en restant consistante vis-&#224;-vis de l&#8217;ensemble de ces
contraintes (Jaynes, 1957). Dans ce cadre d&#8217;optimisation sous contraintes, il est math&#233;matique-
ment prouv&#233; qu&#8217;une solution unique existe et un algorithme it&#233;ratif garantit la convergence vers
cette derni&#232;re (Ratnaparkhi, 1996). La forme classique du MaxEnt est la suivante :
</p>
<p>P(y|x) = 1
Z(x)
</p>
<p>exp
</p>
<p>&#65535;
n&#65535;
</p>
<p>i=1
</p>
<p>wi fi(x , y)
</p>
<p>&#65535;
o&#249; P(y|x) d&#233;signe la probabilit&#233; que l&#8217;individu x , ici une SE ou une paire amorce-item, appar-
tienne &#224; la classe y (e.g : isA, partOf, etc.). La fonction fi est une fonction binaire appel&#233;e trait
qui permet de d&#233;finir les contraintes du mod&#232;le. Z(x) est une constante de normalisation qui
assure que la somme des probabilit&#233;s retourn&#233;es pour un individu soit &#233;quivalente &#224; 1. Chaque
individu x est encod&#233; comme un vecteur avec n traits fi . Le param&#232;tre wi , dit aussi poids, de
chaque trait associe &#224; chaque individu une probabilit&#233; d&#8217;appartenance &#224; une classe.
En pratique, le calcul de cette maximisation s&#8217;effectue au travers de diff&#233;rents algorithmes tels
que le Generalized Iterative Scaling (GIS) (Darroch et Ratcliff, 1972) ou l&#8217;Improved Iterative Scaling
(IIS) (Berger et al., 1996). Dans notre travail, nous utilisons l&#8217;impl&#233;mentation Apache OpenNLP
MaxEnt 4 qui applique un GIS sans correction feature tel que recommand&#233; par (Curran et Clark,
2003).
</p>
<p>4.2 Approche par traits
</p>
<p>Comme pr&#233;sent&#233; dans la section 2, les SE parall&#232;les sont des objets textuels qui conjuguent
marqueurs de MFM et propri&#233;t&#233;s lexico-syntaxiques partiellement stables. La premi&#232;re approche
propos&#233;e tente de capturer leurs r&#233;gularit&#233;s au moyen de deux familles de traits : (1) la premi&#232;re
emploie les informations lexico-syntaxiques extraites de l&#8217;analyse des tokens et de leur r&#244;le au sein
de l&#8217;arbre de d&#233;pendances et (2) la deuxi&#232;me famille reprend des informations paralinguistiques,
dans ce cas-ci typographiques. La table 4 pr&#233;sente, de mani&#232;re synth&#233;tique, les diff&#233;rents traits.
La distinction entre les deux familles de traits est graduelle et certains traits reprennent des
informations combinant les deux sources. Par exemple, avec un seuil de s&#233;lection de traits
param&#233;tr&#233; &#224; 5 apparitions dans le corpus 5, le trait LastTokenPos renvoie dans la majorit&#233; des cas
l&#8217;&#233;tiquette PONCT, car amorces et items ont tendance &#224; &#234;tre cl&#244;tur&#233;s par une ponctuation.
</p>
<p>Les traits HasClassifier, HasMeronym et HasCircumstant sont calcul&#233;s en projetant des patrons sur
les SE. Ces derniers, comme l&#8217;ensemble des traits, sont issus d&#8217;intuitions linguistiques. Une &#233;tude
approfondie de leurs poids respectifs fera l&#8217;objet de travaux ult&#233;rieurs.
</p>
<p>4. http://opennlp.apache.org/
5. Ce seuil de s&#233;lection des traits est appel&#233; cut-off dans la litt&#233;rature relative au MaxEnt.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>139 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;l&#233;ments Traits Ph&#233;nom&#232;nes capt&#233;s
</p>
<p>Amorce
</p>
<p>(First|Last)Token
(Pos|Lem)
</p>
<p>Retourne respectivement la cat&#233;gorie grammaticale et le
lemme du dernier/premier token de l&#8217;amorce.
</p>
<p>HasClassifier Pr&#233;sence d&#8217;un classifieur (&#171; sortes de &#187;, &#171; types de &#187;, etc.)
HasMeronym Pr&#233;sence d&#8217;un marqueur de m&#233;ronymie (&#171; parties de &#187;, etc.)
HasVerb Pr&#233;sence d&#8217;un verbe conjugu&#233; ou un verbe au participe pass&#233;
</p>
<p>&#224; la racine de l&#8217;arbre de d&#233;pendances.
HasProperNoun Pr&#233;sence d&#8217;un nom propre.
HasPlurarlNoun Pr&#233;sence d&#8217;un nom commun au pluriel.
MultiplSentence Pr&#233;sence de plusieurs phrases dans l&#8217;amorce.
</p>
<p>Item
</p>
<p>(First|Last)Token
(Pos|Lem)
</p>
<p>Retourne respectivement la cat. gram. et lemme du der-
nier/premier token de l&#8217;item.
</p>
<p>HasVerb Pr&#233;sence d&#8217;un verbe conjugu&#233; ou un verbe au participe pass&#233;
&#224; la racine de l&#8217;arbre de d&#233;pendances.
</p>
<p>HasProperNoun Pr&#233;sence d&#8217;un nom propre.
HasDate Pr&#233;sence d&#8217;une date en ann&#233;es et consid&#233;r&#233;e comme NC
</p>
<p>(&#171; 1996 &#187;, etc.)
HasCircumstant Pr&#233;sence d&#8217;un circonstant (&#171; En Belgique &#187;, etc.)
StartsWithINF Pr&#233;sence d&#8217;un infinitif en d&#233;but de phrase.
StartsWithNUM Pr&#233;sence d&#8217;un num&#233;ro en d&#233;but d&#8217;item.
StartsWithMaj Pr&#233;sence d&#8217;une majuscule en d&#233;but d&#8217;item.
ContainsPonct Pr&#233;sence d&#8217;une ponctuation inhabituelle au sein de l&#8217;item.
MultiplSentence Pr&#233;sence de plusieurs phrases dans l&#8217;item.
</p>
<p>TABLE 4 &#8211; Tableau synth&#233;tique des traits utilis&#233;s
</p>
<p>La SE en (7) de classe isA exemplifie l&#8217;application de traits. Les tokens entre crochets sont
ceux auxquels s&#8217;appliquent les traits (First|Last)Token(Pos|Lem). Les &#233;l&#233;ments en gras sont le
classifieur et le verbe soulign&#233; r&#233;pond au trait HasVerb. L&#8217;absence d&#8217;autres ph&#233;nom&#232;nes (nom
propre dans l&#8217;amorce, etc.) est tout autant informative pour la classification de la SE.
</p>
<p>(7) [Pour] un transformateur triphas&#233;, il existe 3 types de couplage d&#8217;enroulement [ :]
&#8211; [le] couplage &#233;toile, d&#233;fini par la lettre Y [ ;]
&#8211; [le] couplage triangle, d&#233;fini par la lettre D ou &#8710;[ ;]
&#8211; [le] couplage zig-zag, d&#233;fini par la lettre Z[.]
</p>
<p>L&#8217;exemple (8) pr&#233;sente un cas issu de la classe autres o&#249; l&#8217;on voit que la pr&#233;sence d&#8217;un infinitif en
d&#233;but d&#8217;item (indiqu&#233;s ici par la mise en gras) est un indice des SE proc&#233;durales.
</p>
<p>(8) Le d&#233;roulement
1 [M&#233;langer] la farine, le sucre, le sucre vanill&#233;, les &#339;ufs, l&#8217;huile et le lait [.]
2 [Verser] la p&#226;te dans la po&#234;le et retourner la cr&#234;pe avec une spatule [.]
</p>
<p>4.3 Approche par trigrammes
</p>
<p>La deuxi&#232;me approche propos&#233;e vise &#224; identifier les relations s&#233;mantiques au sein des SE
parall&#232;les au moyen de trigrammes. Chaque token est &#233;tiquet&#233; soit par sa cat&#233;gorie grammaticale
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>140 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>seule, soit par sa forme lemmatis&#233;e associ&#233;e &#224; sa cat&#233;gorie grammaticale. L&#8217;ajout de la cat&#233;gorie
grammaticale au lemme permet de diminuer les cas d&#8217;ambigu&#239;t&#233;. Par ce choix, nous pouvons
distinguer, par exemple, plat-ADJ vs. plat-NC. Pour chaque s&#233;quence de trois tokens, nous avons
23 trigrammes diff&#233;rents. Par exemple, pour la s&#233;quence &#171; Le chat noir &#187;, les trigrammes suivants
sont calcul&#233;s : &#171; le-DET chat-NC noir-ADJ &#187;, &#171; DET chat-NC noir-ADJ &#187;, . . ., &#171; DET NC ADJ &#187;. Ces
trigrammes sont appliqu&#233;s de mani&#232;re identique sur l&#8217;amorce et les items.
</p>
<p>5 R&#233;sultats
</p>
<p>Pour les trois t&#226;ches, nous avons proc&#233;d&#233; &#224; une validation crois&#233;e (k=10) et pr&#233;sentons les
r&#233;sultats en termes d&#8217;exactitude (Table 5).
</p>
<p>Approches Exactitude &#963; IC 95%
</p>
<p>T&#226;che 1 Traits ling. 61,10% 0,0154 [58,08 ;64,11]Trigrammes 59,80% 0,0155 [56,76 ;62,83]
Baseline autres 38,00% 0,0153 [35,00 ;40,99]
</p>
<p>T&#226;che 2 Traits ling. 58,70% 0,0074 [57,25 ;60,15]Trigrammes 59,50% 0,0074 [58,04 ;60,95]
Baseline autres 29,30% 0,0069 [27,94 ;30,65]
</p>
<p>T&#226;che 3 Traits ling. 58,50% 0,0155 [55,46 ;61,53]Trigrammes 59,00% 0,0155 [55,96 ;62,03]
Baseline autres 38,00% 0,0153 [35,00 ;40,99]
</p>
<p>TABLE 5 &#8211; &#201;valuation pour les trois t&#226;ches
</p>
<p>Au regard de cette derni&#232;re, nous constatons que, pour les trois t&#226;ches, l&#8217;approche par traits et
l&#8217;approche par trigrammes aboutissent significativement &#224; de meilleurs r&#233;sultats face &#224; la baseline
autres. Par contre, la comparaison des deux approches est &#224; nuancer. Contrairement aux t&#226;ches
2 et 3, l&#8217;approche par traits d&#233;passe de peu les trigrammes dans la t&#226;che 1, mais les intervalles
de confiance nous montrent qu&#8217;il y a un possible recouvrement entre ces r&#233;sultats. Cependant,
l&#8217;exactitude, qui donne un poids proportionnel &#224; chaque classe (section 3.3), ne r&#233;v&#232;le pas les
difficult&#233;s &#233;prouv&#233;es par les trigrammes pour classer les individus des classes minoritaires partOf
et autreOntologique dans les trois t&#226;ches. Ces derniers sont souvent class&#233;s &#224; tort dans les classes
autres, instanceOf ou isA qui, dans les deux corpus, sont les classes majoritaires. La comparaison
des matrices de confusion issues des deux approches pour la t&#226;che 1 l&#8217;exemplifie (Tables 6 et 7).
</p>
<p>autrOnto autres instOf isA lexical partOf Pr&#233;cision Rappel F1
autrOnto 13 16 5 41 1 0 0,54 0,17 0,26
autres 6 298 29 46 0 1 0,63 0,78 0,70
instOf 0 42 120 9 6 0 0,66 0,68 0,67
isA 5 88 8 120 5 3 0,46 0,52 0,49
lexical 0 12 13 23 47 1 0,80 0,49 0,61
partOf 0 14 8 20 0 0 0,00 0,00 0,00
</p>
<p>TABLE 6 &#8211; Matrice de confusion pour la T&#226;che 1 : Trigrammes
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>141 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>autrOnto autres instOf isA lexical partOf Pr&#233;cision Rappel F1
autrOnto 25 11 3 29 6 2 0,40 0,33 0,36
autres 10 300 18 37 15 0 0,70 0,79 0,74
instOf 6 20 113 29 5 4 0,70 0,64 0,67
isA 11 66 13 127 12 0 0,50 0,55 0,53
lexical 6 23 12 15 40 0 0,50 0,42 0,45
partOf 4 10 3 17 2 6 0,50 0,14 0,22
</p>
<p>TABLE 7 &#8211; Matrice de confusion pour la T&#226;che 1 : Traits linguistiques
</p>
<p>Ainsi, de mani&#232;re transversale, l&#8217;approche par traits linguistiques reste toujours pr&#233;f&#233;rable &#224;
l&#8217;approche par trigrammes car elle discrimine mieux les classes minoritaires partOf et autreOnto-
logique, utiles &#224; la construction de ressources s&#233;mantiques.
</p>
<p>Les r&#233;sultats obtenus avec l&#8217;approche par traits linguistiques dans les t&#226;ches 2 et 3 aboutissent &#224;
une identification correcte des classes utiles &#224; la construction d&#8217;ontologies, c&#8217;est-&#224;-dire toutes les
classes sauf autres (Tables 8 et 9). Seules les F-mesures des classes instanceOf et isA diminuent
entre la deuxi&#232;me et la troisi&#232;me t&#226;che. Une difficult&#233; &#224; classer correctement les nombreux items
de ces deux classes (Section 3.2) expliquerait cette diminution des scores.
</p>
<p>autrOnto autres instOf isA lexical partOf Pr&#233;cision Rappel F1
autrOnto 94 37 12 111 37 8 0,36 0,31 0,34
autres 35 859 100 195 61 14 0,61 0,68 0,65
instOf 49 140 819 96 104 23 0,76 0,67 0,71
isA 59 244 77 543 31 19 0,52 0,56 0,54
lexical 15 81 50 41 173 17 0,41 0,46 0,43
partOf 8 37 13 54 14 47 0,37 0,27 0,31
</p>
<p>TABLE 8 &#8211; Matrice de confusion pour la T&#226;che 2 : Traits linguistiques
</p>
<p>autrOnto autres instOf isA lexical partOf Pr&#233;cision Rappel F1
autrOnto 22 10 4 31 8 1 0,36 0,29 0,32
autres 11 289 16 50 12 2 0,68 0,76 0,72
instOf 6 29 100 25 15 2 0,70 0,56 0,63
isA 16 65 9 118 13 8 0,47 0,52 0,49
lexical 5 23 11 9 44 4 0,46 0,46 0,46
partOf 1 8 2 16 3 12 0,41 0,29 0,34
</p>
<p>TABLE 9 &#8211; Matrice de confusion pour la T&#226;che 3 : Traits linguistiques
</p>
<p>En comparant la t&#226;che 1 et la t&#226;che 3 dans l&#8217;approche par traits linguistiques, les r&#233;sultats
sugg&#232;rent que l&#8217;identification de la relation entre l&#8217;amorce et le premier item est &#224; ce jour la
meilleure approche, surtout lorsque les SE pr&#233;sentent un grand nombre d&#8217;items (cf. instanceOf
et isA). Seule la F-mesure de la classe partOf est significativement plus haute dans la t&#226;che 3.
Ce ph&#233;nom&#232;ne pourrait s&#8217;expliquer par le fait que certaines SE de cette classe pr&#233;sentent un
premier item avec du texte r&#233;dig&#233; et non un simple syntagme nominal (exemple (9)). Ce type de
variation r&#233;duit les performances lorsque l&#8217;approche se limite au premier item (T&#226;che 1).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>142 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(9) Les installations de la centrale &#233;lectrique comprennent :
&#8211; un ou plusieurs postes &#233;lectriques permettant la connexion au r&#233;seau &#233;lectrique par
</p>
<p>l&#8217;interm&#233;diaire d&#8217;une ou plusieurs lignes &#224; haute tension ainsi qu&#8217;une interconnexion
limit&#233;e entre tranches,
</p>
<p>&#8211; les b&#226;timents administratifs,
&#8211; les b&#226;timents techniques,
&#8211; le magasin g&#233;n&#233;ral.
</p>
<p>D&#8217;un point de vue qualitatif, les r&#233;sultats ont aussi montr&#233; que, malgr&#233; une approche qui se veut
fine et linguistique, il reste difficile de classer les individus o&#249; il y a ellipse de constituants au
sein de leur amorce. Ces amorces incompl&#232;tes, tant syntaxiquement que lexicalement, sont un
ph&#233;nom&#232;ne courant dans les documents num&#233;riques o&#249; la mise en page et les traits de formatage
suppl&#233;ent l&#8217;aspect lexico-syntaxique (Bush, 2003). Par exemple, la SE en (10) de classe partOf est,
dans toutes les t&#226;ches, class&#233;e &#224; tort dans la classe autres. L&#8217;absence de marqueurs de m&#233;ronymie
et de ponctuations ainsi que la pr&#233;sence de num&#233;ros en d&#233;but d&#8217;item rendent difficile &#224; distinguer
cet individu d&#8217;une SE de titraille.
</p>
<p>(10) Syst&#232;me de la cordill&#232;re am&#233;ricaine
1 Montagnes rocheuses
2 Cha&#238;nes c&#244;ti&#232;res du Pacifique
3 Cordill&#232;re des Andes
</p>
<p>Plusieurs strat&#233;gies sont envisageables pour contourner ce type de difficult&#233; : (1) entreprendre
une approche exog&#232;ne du probl&#232;me afin de capter des indices qui se trouvent en-dehors des
SE, (2) &#233;tudier davantage l&#8217;utilisation de traits paralinguistiques (e.g : changement de police,
pr&#233;sence de liens hypertextes dans les items, etc.) ou (3) identifier les concepts et instances d&#233;j&#224;
repr&#233;sent&#233;s dans l&#8217;ontologie en cours de construction et les utiliser comme de nouveaux indices
pour mieux discriminer les classes de relations.
</p>
<p>6 Conclusion
</p>
<p>Dans cet article, nous avons d&#233;fini un premier ensemble de classes des relations s&#233;mantiques
port&#233;es par les SE et avons soulign&#233; leur int&#233;r&#234;t dans la construction de ressources s&#233;mantiques.
Dans ce cadre, nous avons propos&#233; deux approches par apprentissage supervis&#233; afin d&#8217;identifier
ces relations. La premi&#232;re utilise des traits lexico-syntaxiques et paralinguistiques et la seconde
aborde la classification au moyen de trigrammes. Les r&#233;sultats montrent l&#8217;insuffisance de cette
derni&#232;re pour capter des r&#233;gularit&#233;s pertinentes au sein des SE, notamment pour les classes
minoritaires partOf et autreOntologique. La comparaison entre la t&#226;che 1 et la t&#226;che 3 sugg&#232;re
une meilleure classification des SE en se limitant &#224; l&#8217;identification de la relation entre l&#8217;amorce et
le premier item. Notons que, lors de nos exp&#233;rimentations, l&#8217;augmentation du seuil de s&#233;lection
des traits dans les t&#226;ches 2 et 3 a abouti &#224; des scores plus &#233;lev&#233;s. Les causes de cette am&#233;lioration
feront l&#8217;objet de travaux ult&#233;rieurs.
&#192; terme, l&#8217;identification des relations au sein des SE s&#8217;inscrit dans un projet plus large visant, en
amont, leur rep&#233;rage automatique, comme cela a d&#233;j&#224; &#233;t&#233; entrepris par (Morin, 1999), et, en
aval, la construction d&#8217;une ontologie. Adjointe &#224; un syst&#232;me d&#8217;extraction de relations au niveau
intraphrastique, notre approche permettrait d&#8217;augmenter le rappel pour la t&#226;che d&#8217;identification
des relations en texte.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>143 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Par ailleurs, nos travaux ont aussi soulev&#233; des pistes de r&#233;flexion au niveau du probl&#232;me
de classification en lui-m&#234;me. Premi&#232;rement, il serait int&#233;ressant d&#8217;utiliser d&#8217;autres mod&#232;les
d&#8217;apprentissage, tels que les CRF ou SVM, afin de mesurer l&#8217;influence, &#224; traits &#233;gaux, du classifieur
utilis&#233;. Deuxi&#232;mement, il nous est apparu que la classe autres repr&#233;sentait avant tout une classe
&#171; par d&#233;faut &#187; plut&#244;t qu&#8217;un r&#233;el regroupement de relations et que peu de traits parvenaient
&#224; la discriminer correctement. Certaines m&#233;thodes de classification multi-classes pr&#233;conisent
l&#8217;utilisation de multiples mod&#232;les binaires et/ou la mise en place d&#8217;un seuil statique ou dynamique
sur les probabilit&#233;s d&#8217;appartenance. Une perspective &#224; ce travail consisterait &#224; &#233;tablir un certain
seuil en de&#231;&#224; duquel les individus seraient class&#233;s dans une cat&#233;gorie sansRelation. Enfin, il serait
utile de proc&#233;der &#224; un sur-&#233;chantillonnage des classes minoritaires afin de comparer l&#8217;influence
de la distribution des individus au sein de notre corpus.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et TOUSSENEL, F. (2003). Building a treebank for french. Treebanks,
pages 165&#8211;187.
</p>
<p>BERGER, A., PIETRA, V. et PIETRA, S. (1996). A maximum entropy approach to natural language
processing. Computational linguistics, 22(1):39&#8211;71.
</p>
<p>BUSH, C. (2003). Des d&#233;clencheurs des &#233;num&#233;rations d&#8217;entit&#233;s nomm&#233;es sur le web. Revue
qu&#233;b&#233;coise de linguistique, 32(2):47&#8211;81.
</p>
<p>CANDITO, M., CRABB&#201;, B., DENIS, P. et GU&#201;RIN, F. (2009). Analyse syntaxique du fran&#231;ais : des
constituants aux d&#233;pendances. In Actes de la 16e Conf&#233;rence sur le Traitement Automatique des
Langues Naturelles (TALN 2009), Senlis, France.
</p>
<p>CARLSON, L., MARCU, D. et OKUROWSKI, M. (2001). Building a discourse-tagged corpus in the
framework of rhetorical structure theory. In Proceedings of the Second SIGdial Workshop on
Discourse and Dialogue-Volume 16, pages 1&#8211;10. Association for Computational Linguistics.
</p>
<p>CURRAN, J. et CLARK, S. (2003). Investigating gis and smoothing for maximum entropy taggers.
In Proceedings of the tenth conference on European chapter of the Association for Computational
Linguistics-Volume 1, pages 91&#8211;98. Association for Computational Linguistics.
</p>
<p>DARROCH, J. et RATCLIFF, D. (1972). Generalized iterative scaling for log-linear models. The
annals of mathematical statistics, 43(5):1470&#8211;1480.
</p>
<p>FLEISS, J., NEE, J. et LANDIS, J. (1979). Large sample variance of kappa in the case of different
sets of raters. Psychological Bulletin, 86(5):974&#8211;977.
</p>
<p>GIOVANNETTI, E., MARCHI, S. et MONTEMAGNI, S. (2008). Combining statistical techniques and
lexico-syntactic patterns for semantic relations extraction from text. In Proc. of the 5th Workshop
on Semantic Web Applications and Perspectives. Citeseer.
</p>
<p>GIULIANO, C., LAVELLI, A. et ROMANO, L. (2006). Exploiting shallow linguistic information for
relation extraction from biomedical literature. In Proceedings of the eleventh conference of the
European chapter of the association for computational linguistics (EACL-2006), pages 5&#8211;7.
</p>
<p>HO-DAC, L., FABRE, C., P&#201;RY-WOODLEY, M., REBEYROLLE, J. et TANGUY, L. (2012). An empi-
rical approach to the signalling of enumerative structures. Discours. Revue de linguistique,
psycholinguistique et informatique, (10).
</p>
<p>JAYNES, E. (1957). Information theory and statistical mechanics. Physical review, 106(4):620.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>144 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>KAMEL, M., MOJAHID, M. et ROTHENBURGER, B. (2012). &quot;quand r&#233;diger c&#8217;est d&#233;crire&quot; mise en
forme mat&#233;rielle des textes et construction d&#8217;ontologies &#224; partir de textes. Journ&#233;es Francophones
d&#8217;Ing&#233;nierie des Connaissances (IC 2012).
</p>
<p>KAMEL, M. et ROTHENBURGER, B. (2011). Elicitation de structures hi&#233;rarchiques &#224; partir de
structures enum&#233;ratives pour la construction d&#8217;ontologie. In Journ&#233;es Francophones d&#8217;Ing&#233;nierie
des Connaissances (IC 2011), Annecy.
</p>
<p>KOHAVI, R. et al. (1995). A study of cross-validation and bootstrap for accuracy estimation and
model selection. In International joint Conference on artificial intelligence, volume 14, pages
1137&#8211;1145. Lawrence Erlbaum Associates Ltd.
</p>
<p>LUC, C. (2001). Une typologie des &#233;num&#233;rations bas&#233;e sur les structures rh&#233;toriques et architec-
turales du texte. In Actes de la 8e Conf&#233;rence sur le Traitement Automatique des Langues Naturelles
(TALN 2001), pages 263&#8211;272.
</p>
<p>MORIN, E. (1999). Extraction de liens s&#233;mantiques entre termes &#224; partir de corpus de textes
techniques. Th&#232;se de doctorat, Universit&#233; de Nantes.
</p>
<p>N&#201;DELLEC, C., NAZARENKO, A. et BOSSY, R. (2009). Information extraction. Handbook on
Ontologies, pages 663&#8211;685.
</p>
<p>PASCUAL, E. et P&#201;RY-WOODLEY, M. (1995). La d&#233;finition dans le texte. Textes de type consigne&#8211;
Perception, action, cognition, pages 65&#8211;88.
</p>
<p>PERY-WOODLEY, M. (2001). Modes d&#8217;organisation et de signalisation dans des textes proc&#233;duraux.
Langages, 35(141):28&#8211;46.
</p>
<p>RATNAPARKHI, A. (1996). A maximum entropy model for part-of-speech tagging. In Proceedings
of the conference on empirical methods in natural language processing, volume 1, pages 133&#8211;142.
Philadelphia, PA.
</p>
<p>REBEYROLLE, J., JACQUES, M., P&#201;RY-WOODLEY, M. et al. (2009). Titres et intertitres dans l&#8217;organi-
sation du discours 1. Journal of French Language Studies, 19(2):269.
</p>
<p>URIELI, A. et FAUCONNIER, J. (2012). Talismane user manual. CLLE-ERSS, Toulouse.
</p>
<p>VIRBEL, J. (1999). Structures textuelles, planches fascicule 1 : Enum&#233;rations, version 1,. Rapport
technique, IRIT.
</p>
<p>VIRBEL, J., LUC, C., SCHMID, S., CARRIO, L., DOMINGUEZ, C., PERY-WOODLEY, M., JACQUEMIN, C.,
MOJAHID, M., BACCINO, T. et GARCIADEBANC, C. (2005). Approche cognitive de la spatialisation
du langage. de la mod&#233;lisation de structures spatio-linguistiques des textes &#224; l&#8217;exp&#233;rimentation
psycholinguistique : le cas d&#8217;un objet textuel, l&#8217;&#233;num&#233;ration. Agir dans l&#8217;espace. Paris : &#201;ditions
de la Maison des sciences de l&#8217;homme.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>145 c&#65535; ATALA</p>

</div></div>
</body></html>