<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Similarit&#233; de second ordre pour l&#8217;exploration de bases textuelles multilingues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Similarit&#233; de second ordre pour l&#8217;exploration de bases
textuelles multilingues
</p>
<p>Tulechki Nikola1,2 Tanguy Ludovic1
(1) CLLE-ERSS : CNRS et Universit&#233; de Toulouse 2, 5 all&#233;es Antonio Machado, 31058 Toulouse CEDEX 9
</p>
<p>(2) Conseil en Facteurs Humains, 4 impasse Montcabrier, 31500 Toulouse
{tanguy,tulechki}@univ-tlse2.fr
</p>
<p>R&#201;SUM&#201;
Cet article d&#233;crit l&#8217;utilisation de la technique de similarit&#233; de second ordre pour l&#8217;identification
de textes semblables au sein d&#8217;une base de rapports d&#8217;incidents a&#233;ronautiques m&#233;langeant les
langues fran&#231;aise et anglaise. L&#8217;objectif du syst&#232;me est, pour un document donn&#233;, de retrouver
des documents au contenu similaire quelle que soit leur langue. Nous utilisons un corpus bilingue
align&#233; de rapports d&#8217;accidents a&#233;ronautiques pour construire des paires de pivots et indexons les
documents avec des vecteurs de similarit&#233;s, tels que chaque coordonn&#233;e correspond au score de
similarit&#233; entre un document dans une langue donn&#233;e et la partie du pivot de la m&#234;me langue.
Nous &#233;valuons les performances du syst&#232;me sur un volumineux corpus de rapports d&#8217;incidents
a&#233;ronautiques pour lesquels nous disposons de traductions. Les r&#233;sultats sont prometteurs et
valident la technique.
</p>
<p>ABSTRACT
Second order similarity for exploring multilingual textual databases
</p>
<p>This paper describes the use of second order similarities for identifying similar texts inside a
corpus of aviation incident reports written in both French and English. We use a second bilingual
corpus to construct pairs of reference documents and map each target document to a vector so
each coordinate represents a similarity score between this document and the part of the reference
corpus written in the same language. We evaluate the system using a large corpus of translated
incident reports. The results are promising and validate the approach.
</p>
<p>MOTS-CL&#201;S : similarit&#233; de second ordre, multilingue, ESA.
KEYWORDS: second order similarity, multilingual, ESA.
</p>
<p>1 Introduction et contexte applicatif
</p>
<p>Dans toute industrie &#224; risque, le retour d&#8217;exp&#233;rience (REX) occupe une place capitale dans les
m&#233;canismes de gestion de la s&#251;ret&#233;. Des politiques de recueil, d&#8217;analyse et de stockage sont mises
en place afin de garder une trace de tout &#233;v&#233;nement qui s&#8217;&#233;carte de la norme, de tout incident ou
accident qui survient lors des op&#233;rations. Les informations ainsi recueillies servent ensuite de
support aux experts de s&#251;ret&#233; pour mettre &#224; jour les r&#232;gles et les proc&#233;dures d&#8217;exploitation en les
adaptant &#224; un contexte en perp&#233;tuelle &#233;volution.
</p>
<p>L&#8217;aviation civile est sans doute le secteur dans lequel les politiques de recueil sont les plus avanc&#233;es
et il n&#8217;est pas rare que les bases de REX regroupent plusieurs centaines de milliers de rapports.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>651 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les strat&#233;gies d&#8217;exploitation actuelles, bas&#233;es sur la codification manuelle de chaque rapport
s&#8217;av&#232;rent insuffisantes, &#224; cause d&#8217;un codage souvent incomplet et h&#233;t&#233;rog&#232;ne (Tulechki et Tanguy,
2012). De ce fait, proposer aux experts des outils facilitant l&#8217;acc&#232;s &#224; l&#8217;information contenue dans
la partie textuelle des rapports est devenu capitale (Tulechki, 2011). Plus pr&#233;cis&#233;ment encore,
l&#8217;un des moyens privil&#233;gi&#233;s d&#8217;exploitation de ce type de base par des experts consiste &#224; partir
d&#8217;un &#233;v&#233;nement particulier et &#224; rechercher des cas similaires afin de faire &#233;merger de nouveaux
risques non encore identifi&#233;s (et cod&#233;s).
</p>
<p>Cependant, compte tenu du caract&#232;re intrins&#232;quement international de l&#8217;activit&#233;, les informations
dans les bases sont souvent &#233;crites dans des langues diff&#233;rentes, ce qui complique consid&#233;ra-
blement leur exploitation de mani&#232;re outill&#233;e. Notre objectif est donc de concevoir un syst&#232;me
capable de calculer la similarit&#233; textuelle entre deux textes, quelle que soit la langue dans laquelle
ils sont &#233;crits. Afin que le traitement de plusieurs langues soit possible les textes doivent d&#8217;abord
&#234;tre ramen&#233;s &#224; une repr&#233;sentation commune. Traditionnellement ceci implique l&#8217;utilisation de
techniques de traduction automatique (TA). Dans notre cas la TA n&#8217;est pas envisageable puisque
que les syst&#232;mes de TA disponibles ne sont pas adapt&#233;s aux particularit&#233;s stylistiques du langage
technique de l&#8217;aviation. Pour ces raisons nous nous sommes tourn&#233;s vers la similarit&#233; de second
ordre, qui pour une impl&#233;mentation multilingue ne n&#233;cessite pas d&#8217;autres ressources qu&#8217;un corpus
align&#233; servant d&#8217;interm&#233;diaire (Claveau, 2012).
</p>
<p>Dans un premier temps nous pr&#233;senterons les principes g&#233;n&#233;raux d&#8217;approche par similarit&#233; de
second ordre monolingue ainsi que son application dans des contextes multilingues. Ensuite nous
d&#233;taillerons notre exp&#233;rience sur un corpus sp&#233;cialis&#233; multilingue.
</p>
<p>2 Similarit&#233; textuelle
</p>
<p>2.1 Similarit&#233; de premier ordre
</p>
<p>Calculer la similarit&#233; textuelle revient &#224; attribuer un score repr&#233;sentant le degr&#233; de ressemblance
entre deux textes en se basant sur leur taux de recouvrement lexical. Aujourd&#8217;hui encore le
mod&#232;le vectoriel (Salton et al., 1975) est le plus couramment utilis&#233;. Le score de similarit&#233; est
obtenu en calculant le recouvrement (g&#233;n&#233;ralement par une mesure de type cosinus) entre deux
vecteurs dans un espace &#224; n dimensions correspondant aux termes pr&#233;sents dans la collection.
Compte tenu du fait que les documents sont rapproch&#233;s gr&#226;ce aux termes qu&#8217;il partagent, cette
approche est particuli&#232;rement sensible &#224; la variation lexicale. Deux documents qui traitent du
m&#234;me sujet, mais y r&#233;f&#232;rent avec des synonymes ne seront pas rapproch&#233;s par le calcul et les
techniques existantes bien connues, visant &#224; en assurer le rapprochement, reposent classiquement
sur des ressources lexicales co&#251;teuses &#224; d&#233;velopper et &#224; maintenir dans le cadre d&#8217;un domaine
tr&#232;s sp&#233;cialis&#233;. Cette similarit&#233; est dite de premier ordre dans la suite de cet article.
</p>
<p>2.2 Similarit&#233; de second ordre
</p>
<p>2.2.1 Principe de base
</p>
<p>De multiples techniques cherchant &#224; repr&#233;senter plus fid&#232;lement les textes en fonction de leur
contenu et &#224; ma&#238;triser les incoh&#233;rences dues &#224; la variation lexicale ont vu le jour. Une en
particulier, mise au point par Gabrilovich et Markovitch (2007) consiste &#224; calculer une similarit&#233;
de premier ordre entre chaque document de la collection et un ensemble de n documents
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>652 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pivots arbitraires ext&#233;rieures &#224; cette collection. Les scores forment par la suite un vecteur de n
dimensions qui est utilis&#233; pour repr&#233;senter le document. La similarit&#233; est ensuite calcul&#233;e de
mani&#232;re standard en comparant les vecteurs des documents dans ce nouvel espace (voir figure 1).
</p>
<p>L&#8217;impl&#233;mentation originelle, appel&#233;e ESA 1 a &#233;t&#233; &#233;valu&#233;e sur un corpus de paires de textes sur
lesquels un jugement de similarit&#233; avait &#233;t&#233; donn&#233; par des annotateurs humains. Le syst&#232;me
atteint des performances sup&#233;rieures &#224; la fois &#224; la similarit&#233; de premier ordre et aux techniques
de r&#233;duction de dimensions comme la LSA/LSI.
</p>
<p>FIGURE 1 &#8211; Principe de la similarit&#233; de second ordre
</p>
<p>On voit bien que le contenu des deux documents n&#8217;est pas index&#233; directement. Cette technique
permet donc de traiter des documents en &#233;vitant de se baser sur le partage de termes.
</p>
<p>2.2.2 Le choix des pivots
</p>
<p>Originellement l&#8217;ESA utilise des articles de Wikip&#233;dia comme documents pivots. Ses auteurs
insistent sur l&#8217;apport en terme de connaissances de leur choix et l&#8217;importance du fait que l&#8217;espace
ainsi construit est d&#233;termin&#233; par rapport aux &quot;concepts naturels&quot; d&#233;finis par les r&#233;dacteurs
de l&#8217;encyclop&#233;die. Le caract&#232;re &quot;explicite&quot; 2 permet en effet que chacune des dimensions soit
directement interpr&#233;table. Il s&#8217;en est suivi qu&#8217;une partie consid&#233;rable de la recherche dans ce
domaine s&#8217;est centr&#233;e sur les strat&#233;gies d&#8217;exploitation de la cat&#233;gorisation de Wikip&#233;dia afin de
construire des pivots en concat&#233;nant des articles en fonction de leur place dans la hi&#233;rarchie.
</p>
<p>Cependant Claveau (2012) a d&#233;montr&#233; que la similarit&#233; de second ordre peut &#234;tre efficace sans
obligatoirement se baser sur une ressource structur&#233;e. En utilisant des textes tout-venants comme
</p>
<p>1. Explicit Semantic Analysis
2. Les auteurs ont sans doute choisi cette d&#233;nomination pour se diff&#233;rencier des &quot;concepts implicites&quot; form&#233;s par les
</p>
<p>m&#233;thodes de r&#233;duction de dimensions.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>653 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pivots, il a &#233;valu&#233; la technique sur des t&#226;ches de RI et de fouille de texte en obtenant &#224; chaque
fois des r&#233;sultats encourageants.
</p>
<p>La question du choix des pivots pour le traitement des textes d&#8217;un domaine sp&#233;cialis&#233; ne s&#8217;est
pas encore pos&#233;e dans la litt&#233;rature. N&#233;anmoins, il semble &#233;vident que compte tenu du fonc-
tionnement de la similarit&#233; de second ordre, utiliser des pivots issus du m&#234;me domaine est
pr&#233;f&#233;rable. Des pivots inadapt&#233;s aux documents trait&#233;s peuvent &#224; la fois engendrer du bruit et
du silence ; indexer un rapport d&#8217;accident a&#233;ronautique en utilisant sa similarit&#233; (ou plut&#244;t sa
diff&#233;rence) avec l&#8217;article Wikip&#233;dia sur Walt Disney ne semble gu&#232;re distinctif. Pire encore, un
terme sp&#233;cifique contenu dans les documents mais absent des pivots sera perdu &#224; jamais du point
de vue du calcul.
</p>
<p>2.3 Application inter-langue
</p>
<p>L&#8217;adaptation de la similarit&#233; de second ordre &#224; un contexte multilingue est relativement simple.
L&#8217;espace dans lequel sont repr&#233;sent&#233;s les documents &#233;tant ind&#233;pendant 3 de la langue, tout docu-
ment peut y &#234;tre repr&#233;sent&#233;. Pour cela il suffit d&#8217;utiliser comme pivots des paires de documents
traduits dans plusieurs langues afin de pouvoir calculer les similarit&#233;s de premier ordre avec la
partie de la collection &#233;crite dans la m&#234;me langue que le document (voir figure 2).
</p>
<p>FIGURE 2 &#8211; Similarit&#233; de second ordre inter-langue
</p>
<p>Sorg et Cimiano (2012) ont appliqu&#233; l&#8217;ESA &#224; plusieurs langues. Pour cela ils construisent des
ensembles de pivots en exploitant les liens de traduction pr&#233;sents dans Wikip&#233;dia. Si le n-&#232;me
pivot correspond au concept H&#244;pital, la n-&#232;me coordonn&#233;e des vecteurs des documents en anglais
</p>
<p>3. Par comparaison &#224; l&#8217;espace des termes pour la similarit&#233; de premier ordre.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>654 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>correspondra &#224; la similarit&#233; entre le document et l&#8217;article Hospital de la version anglaise de
l&#8217;encyclop&#233;die ainsi que la m&#234;me coordonn&#233;e d&#8217;un document en allemand correspondra &#224; la
similarit&#233; entre le document et l&#8217;article Krankenhaus de la version allemande. Les documents
sont ainsi repr&#233;sent&#233;s dans le m&#234;me espace et une similarit&#233; peut &#234;tre calcul&#233;e &#224; la fois entre
documents d&#8217;une m&#234;me langue et de langues diff&#233;rentes.
</p>
<p>Afin d&#8217;&#233;valuer le syst&#232;me les auteurs utilisent un corpus parall&#232;le de documents l&#233;gislatifs traduits
dans plusieurs langues et la t&#226;che de recherche de partenaire 4. &#201;tant donn&#233; un document dans une
langue donn&#233;e, la t&#226;che consiste &#224; retrouver ses traductions (partenaires) parmi les documents de
la base. Comme mesure, les auteurs utilisent le rappel au rang k (R@k), qui consiste &#224; chercher
le partenaire parmi les k documents les plus similaires retourn&#233;s par le syst&#232;me. Un R@10 de
1 signifie que pour tout document, sa traduction se trouve dans les 10 premiers documents.
Ce score repose sur l&#8217;hypoth&#232;se qu&#8217;un syst&#232;me performant doit maximiser la similarit&#233; entre
un document et sa traduction. Lors de l&#8217;&#233;valuation de leur syst&#232;me, Sorg et Cimiano (2012)
atteignent un R@10 variant entre 0,27 et 0,51.
</p>
<p>Une m&#233;thode similaire &#224; &#233;t&#233; &#233;galement utilis&#233;e pour la clusterisation de documents multilingues
(Kiran Kumar et al., 2011), toujours en utilisant la Wikip&#233;dia comme corpus pivot.
</p>
<p>3 Application &#224; un domaine sp&#233;cialis&#233;
</p>
<p>Notre syst&#232;me s&#8217;inspire des travaux cit&#233;s pr&#233;c&#233;demment afin d&#8217;adapter la technique &#224; un corpus
de rapports d&#8217;incidents a&#233;ronautiques &#233;crits en fran&#231;ais et en anglais. Nous utilisons deux corpus
distincts :
</p>
<p>Pour les pivots, nous utilisons un corpus de rapports d&#8217;accidents du Bureau de la S&#233;curit&#233; des
Transports du Canada 5. Ces documents longs de plusieurs pages existent syst&#233;matiquement en
anglais et en fran&#231;ais et d&#233;crivent de fa&#231;on exhaustive l&#8217;analyse d&#8217;un accident a&#233;ronautique. Afin
d&#8217;obtenir un nombre suffisant de pivots, nous les d&#233;coupons en paragraphes 6 que nous alignons
entre les deux langues en nous basant sur l&#8217;isomorphie de leurs structures HTML. Ce d&#233;coupage
permet d&#8217;obtenir 10032 paires de pivots &#224; partir de 390 paires de documents.
</p>
<p>A des fins d&#8217;&#233;valuation, nous utilisons un second corpus de rapports d&#8217;incidents issu de la base
CADORS 7 qui contient des rapports volontairement soumis aux autorit&#233;s de r&#233;gulation de
l&#8217;aviation canadienne. Ces documents d&#8217;une centaine de mots en moyenne r&#233;sument un incident
a&#233;ronautique. Ils sont tr&#232;s semblables aux textes des autorit&#233;s de contr&#244;le fran&#231;aises auxquelles
notre syst&#232;me est destin&#233;. Compte tenu de la r&#233;glementation canadienne, comme pour le corpus
des pivots, les rapports qu&#233;b&#233;cois sont syst&#233;matiquement traduits et nous pouvons donc proc&#233;der
&#224; une &#233;valuation par la t&#226;che de recherche de partenaire. Au total le corpus d&#8217;&#233;valuation comporte
9217 documents bilingues comme ceux pr&#233;sent&#233;s en exemple en table 1.
</p>
<p>4. mate retrieval
5. http://www.bst-tsb.gc.ca/fra/rapports-reports/aviation/index.asp
6. Nous avons choisi ce niveau de grain, afin d&#8217;obtenir suffisamment de pivots pour un bon fonctionnement du
</p>
<p>syst&#232;me.
7. Civil Aviation Daily Occurrence Reporting System. http://wwwapps.tc.gc.ca/Saf-Sec-Sur/2/
</p>
<p>cadors-screaq/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>655 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CRQ590M, a Beech A100 operated by Air Cree-
bec as flight number CRQ590, was on an IFR
MEDEVAC flight from Chibougamau/Chapais
(CYMT) to Montr&#233;al/Trudeau (CYUL). At 1535Z,
the crew was instructed to conduct a missed ap-
proach for Runway 06R due to the presence of C
FFWJ, an Airbus A-320 operated by Air Canada
as flight number ACA407, which was lined up for
departure and which had a mechanical problem.
CRQ590 eventually landed without incident at
1546Z.
</p>
<p>CRQ590M, un Beech A100 exploit&#233; par Air Cree-
bec sous l&#8217;indicatif de vol CRQ590, effectuait un vol
d&#8217;&#233;vacuation m&#233;dicale selon les r&#232;gles de vol aux
instruments (IFR) depuis Chibougamau / Chapais
(CYMT) &#224; destination de Montr&#233;al/Trudeau (CYUL).
&#192; 1535Z, l&#8217;&#233;quipage a re&#231;u l&#8217;instruction d&#8217;interrompre
son approche pour la piste 06 droite en raison de la
pr&#233;sence de C-FFWJ, un Airbus A-320 exploit&#233; par
Air Canada sous l&#8217;indicatif de vol ACA407 qui &#233;tait
align&#233; au d&#233;part et qui avait un probl&#232;me m&#233;canique.
CRQ590 a finalement atterri sans encombre &#224; 1546Z.
</p>
<p>TABLE 1 &#8211; Exemple de rapport d&#8217;incident et sa traduction
</p>
<p>4 Architecture du syst&#232;me
</p>
<p>Pr&#233;traitements et normalisation
</p>
<p>Nous utilisons pour le pr&#233;traitement des corpus (documents-pivots et corpus d&#8217;&#233;valuation) des
outils g&#233;n&#233;riques disponibles pour le langage Perl. La segmentation est ainsi faite par un simple
tokeniseur 8 bas&#233; sur des expressions r&#233;guli&#232;res. Nous appliquons ensuite le raciniseur Snowball 9
</p>
<p>et un anti-dictionnaire standard. Vu que les corpus sur lesquels nous travaillons sont souvent de
mauvaise qualit&#233;, comportant de nombreux documents &#233;crits enti&#232;rement en majuscules, nous
normalisons la casse et supprimons les accents pour le fran&#231;ais.
</p>
<p>Pond&#233;ration et calcul de similarit&#233;
</p>
<p>Afin de prendre en compte l&#8217;importance relative des termes dans les documents nous utilisons
un sch&#233;ma de pond&#233;ration propos&#233; par Turney et Pantel (2010) : la Positive Pointwise Mutual
Information pour la similarit&#233; entre les documents et les pivots. Les vecteurs de second ordre
ne sont pas pond&#233;r&#233;s : tous les documents-pivots ont un poids identique pour le calcul de la
similarit&#233; (bas&#233; sur une mesure cosinus).
</p>
<p>&#201;lagage
</p>
<p>Contrairement aux vecteurs de premier ordre, tr&#232;s creux par d&#233;finition, les vecteurs de second
ordre sont syst&#233;matiquement pleins. Ceci alourdit consid&#233;rablement le calcul et pour cette raison
nous appliquons un seuil minimum arbitraire de 0,05 et ramenons tout score inf&#233;rieur &#224; ce seuil
&#224; z&#233;ro. Cette op&#233;ration laisse des vecteurs de second ordre relativement creux avec en moyenne
45 valeurs non-nulles (sur 10000) par document.
</p>
<p>5 &#201;valuation
</p>
<p>Afin d&#8217;&#233;valuer le syst&#232;me, nous avons appliqu&#233; la t&#226;che de recherche de partenaire au corpus issu
de la base CADORS cit&#233; ci-dessus.
</p>
<p>8. http://search.cpan.org/~dami/Search-Tokenizer-1.01/lib/Search/Tokenizer.pm
9. http://search.cpan.org/~creamyg/Lingua-Stem-Snowball-0.952/lib/Lingua/Stem/
</p>
<p>Snowball.pm
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>656 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Lors de nos premiers tests, nous avons trouv&#233; que pour certains rapports, le partenaire (i.e. sa
traduction) se trouvait tr&#232;s loin dans la liste des r&#233;sultats, dans certains cas &#224; un rang sup&#233;rieur &#224;
500. Nous avons regard&#233; les rapports en question et nous nous sommes aper&#231;us que le corpus
contenait des s&#233;ries de rapports tr&#232;s similaires, au point de poser la question des limites de
l&#8217;int&#233;r&#234;t de l&#8217;analyse de similarit&#233; pour certains textes. En effet, &#224; cause de la nature r&#233;glementaire
du signalement d&#8217;incidents a&#233;ronautiques, certains probl&#232;mes courants sont syst&#233;matiquement
rapport&#233;s via des textes standardis&#233;s selon un sch&#233;ma commun 10. Il appara&#238;t clairement que les
seules diff&#233;rences entre les documents de ces s&#233;ries sont des codes, des nombres et &#233;ventuellement
des noms de villes &#224; priori absents des pivots et dont l&#8217;impact sur la similarit&#233; est nul. Retrouver
la traduction au sein de la s&#233;rie repose par contre uniquement sur ces &#233;l&#233;ments, ce qui explique
le probl&#232;me rencontr&#233;. Si notre m&#233;thode est inadapt&#233;e &#224; ces cas particuliers, ils peuvent &#234;tre
trait&#233;s par des m&#233;thodes de surface simples.
</p>
<p>Nous avons d&#233;cid&#233; de ne pas les prendre en consid&#233;ration en les identifiant en calculant pour
chaque document la similarit&#233; moyenne des 100 premiers rapports similaires. Si cette moyenne
d&#233;passait 0,95, nous consid&#233;rons que le rapport en question est un texte pr&#233;format&#233; et l&#8217;excluons
du corpus d&#8217;&#233;valuation. Au total 823 paires de documents ont &#233;t&#233; exclues.
</p>
<p>Le corpus final d&#8217;&#233;valuation comporte donc 16788 documents monolingues, de fa&#231;on &#224; ce que
la traduction de chacun soit aussi pr&#233;sente dans la base. Nous avons proc&#233;d&#233; &#224; la t&#226;che de
recherche du partenaire pour la totalit&#233; du corpus et calcul&#233; le R@k pour les rangs 1, 10 et
100, s&#233;par&#233;ment pour les documents en fran&#231;ais et en anglais en ne prenant en compte que les
documents retourn&#233;s qui ne sont pas de la m&#234;me langue que le document source. Les r&#233;sultats
sont r&#233;sum&#233;s dans la table 2.
</p>
<p>FR EN
R@1 0,43 0,45
R@10 0,71 0,74
R@100 0,90 0,94
</p>
<p>TABLE 2 &#8211; R&#233;sultats de la recherche de partenaire
</p>
<p>Comme nous pouvons le voir, les r&#233;sultats sont encourageants et valident cette approche, au
m&#234;me niveau pour les deux langues. Dans plus de 40% des cas, la traduction est bien le document
le plus similaire retourn&#233; par le syst&#232;me. Dans plus de 70% des cas, la traduction se situe dans
les 10 documents les plus similaires.
</p>
<p>6 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; une approche permettant de calculer la similarit&#233; entre documents de
langues diff&#233;rentes issues d&#8217;un domaine sp&#233;cialis&#233; que nous avons &#233;valu&#233;e sur un grand corpus
de documents r&#233;els, semblables aux documents auxquels le syst&#232;me est destin&#233;. Cette exp&#233;rience
permet de valider la m&#233;thode et nous encourage &#224; nous int&#233;resser davantage aux particularit&#233;s
de ce type de calcul.
</p>
<p>10. Les deux courts rapports ci-dessous exemplifient ce fait :
A :&quot;La station radio d&#8217;a&#233;roport communautaire (CARS) de Waskaganish (CYKQ) n&#8217;a pas assur&#233; les services de m&#233;t&#233;o et de
radio d&#8217;a&#233;rodrome entre 1300Z et 2100Z.&quot;
B :&quot;La station radio d&#8217;a&#233;roport communautaire (CARS) d&#8217;Inukjuak (CYPH) n&#8217;a pas assur&#233; les services de m&#233;t&#233;o et de radio
d&#8217;a&#233;rodrome entre 1130Z et 2130Z.&quot;
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>657 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Puisque la m&#233;thode est bas&#233;e sur une similarit&#233; classique de premier ordre (entre les documents-
cibles et les pivots), il est logique que le param&#233;trage de cette derni&#232;re influence les performances.
L&#8217;exp&#233;rience pr&#233;sent&#233;e dans cet article utilise une cha&#238;ne de similarit&#233; basique, mais nous
explorerons &#224; l&#8217;avenir l&#8217;apport de traitements linguistiques plus sophistiqu&#233;s en amont.
</p>
<p>Le c&#244;t&#233; explicite de la m&#233;thode nous am&#232;nera surtout &#224; nous int&#233;resser de pr&#232;s aux documents
pivots et &#224; analyser plus pr&#233;cis&#233;ment leur r&#244;le dans le calcul final du score de similarit&#233;. Le fait que
nous y avons facilement acc&#232;s et que les pivots sont interpr&#233;tables nous permettra de facilement
tracer et comprendre les variations du comportement du syst&#232;me avec diff&#233;rents ensembles de
documents pivots. Dans cette logique nous poursuivrons les recherches entam&#233;es dans Tulechki
et Tanguy (2012) visant &#224; identifier les dimensions de similarit&#233; entre des documents. Si, comme
c&#8217;est le cas dans les donn&#233;es utilis&#233;es, les documents-pivots disposent d&#8217;un codage sp&#233;cifique
(m&#233;ta-donn&#233;es, cat&#233;gorisation externe, etc.), nous pourrons l&#8217;exploiter &#224; la fois pour identifier ces
dimensions, mais aussi pour restreindre les pivots en fonction de leurs caract&#233;ristiques, et ainsi
orienter de fa&#231;on interactive l&#8217;investigation en fonction des facettes exprim&#233;es par l&#8217;utilisateur.
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224; remercier Assaf Urieli de CLLE-ERSS d&#8217;avoir adapt&#233; son calculateur de similarit&#233;
aux exigences particuli&#232;res de cette exp&#233;rience.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CLAVEAU, V. (2012). Vectorisation, Okapi et calcul de similarit&#233; pour le TAL : pour oublier enfin
le TF-IDF. In Actes de TALN, pages 85&#8211;98, Grenoble.
</p>
<p>GABRILOVICH, E. et MARKOVITCH, S. (2007). Computing semantic relatedness using Wikipedia-
based explicit semantic analysis. In Proceedings of IJCAI, pages 1606&#8211;1611, Hyderabad, India.
</p>
<p>KIRAN KUMAR, N., SANTOSH, K. G. S. et VARMA, V. (2011). Multilingual document clustering using
wikipedia as external knowledge. In Proceedings of IRFC, pages 108&#8211;117.
</p>
<p>SALTON, G., WONG, A. et YANG, C.-S. (1975). A vector space model for automatic indexing.
Communications of the ACM, 18(11):613&#8211;&#8211;620.
</p>
<p>SORG, P. et CIMIANO, P. (2012). Exploiting wikipedia for cross-lingual and multilingual informa-
tion retrieval. Data &amp; Knowledge Engineering, 74(0):26 &#8211; 45.
</p>
<p>TULECHKI, N. (2011). Des outils de TAL en support aux experts de s&#251;ret&#233; industrielle pour
l&#8217;exploitation de bases de donn&#233;es de retour d&#8217;exp&#233;rience. In Actes de RECITAL, Montpellier.
</p>
<p>TULECHKI, N. et TANGUY, L. (2012). Effacement de dimensions de similarit&#233; textuelle pour
l&#8217;exploration de collections de rapports d&#8217;incidents a&#233;ronautiques. In Actes de TALN, Grenoble.
</p>
<p>TURNEY, P. D. et PANTEL, P. (2010). From frequency to meaning : Vector space models of semantics.
J. Artif. Intell. Res. (JAIR), 37:141&#8211;188.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>658 c&#65535; ATALA</p>

</div></div>
</body></html>