<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Gestion des terminologies riches : l'exemple des acronymes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Gestion des terminologies riches : l'exemple des acronymes 
</p>
<p>Ying ZHANG1 et Mathieu MANGEOT1 
 (1) GETALP-LIG, 41, rue des Math&#233;matiques BP53 38041 Grenoble Cedex 9 
</p>
<p>ying.zhang@imag.fr, mathieu.mangeot@imag.fr 
R&#201;SUM&#201;  _______________________________________________________________________   
</p>
<p>La gestion des terminologies pose encore des probl&#232;mes, en particulier pour des constructions 
complexes comme les acronymes. Dans cet article, nous proposons une solution en reliant 
plusieurs termes diff&#233;rents &#224; un seul r&#233;f&#233;rent via les notions de pivot et de prolex&#232;me. Ces notions 
permettent par exemple de faire le lien entre plusieurs termes qui d&#233;signent un m&#234;me et unique 
r&#233;f&#233;rent : Nations Unies, ONU, Organisation des Nations Unies et onusien. Il existe Jibiki, une 
plate-forme g&#233;n&#233;rique de gestion de bases lexicales permettant de g&#233;rer n'importe quel type de 
structure (macro et microstructure). Nous avons impl&#233;ment&#233; une nouvelle macrostructure de 
ProAxie dans la plate-forme Jibiki pour r&#233;aliser la gestion des acronymes. 
</p>
<p>ABSTRACT _____________________________________________________________________  
</p>
<p>Complex terminologies management &#8211; the case of acronyms 
</p>
<p>Terminology management is still problematic, especially for complex constructions such as 
acronyms. In this paper, we propose a solution to connect several different terms with a single 
referent through using the concepts of pivot and prolexeme. These concepts allow for example to 
link several terms for the same referent: Nations Unies, ONU, Organisation des Nations Unies 
and onusien. Jibiki is a generic platform for lexical database management, allowing the 
representation of any type of structure (macro and microstructure). We have implemented a new 
macrostructure ProAxie in the Jibiki platform to achieve acronym management. 
</p>
<p>MOTS-CL&#201;S : base lexicale multilingue, macrostructure, Jibiki, Common Dictionary Markup, 
Proaxie, Prol&#232;xeme 
KEYWORDS : multilingual lexical database, macrostructure, Jibiki, Common Dictionary Markup, 
Proaxie, Prolexeme 
</p>
<p>1 Introduction 
</p>
<p>Cet article concerne la gestion de terminologies multilingues. Le probl&#232;me abord&#233; dans cet article 
est celui de l'association de plusieurs termes d'une m&#234;me langue &#224; un m&#234;me r&#233;f&#233;rent : &#171; Jean-Paul 
II &#187; et &#171; Karol Jozef Wojtyla &#187; en fran&#231;ais, ou en anglais &#171; John Paul II &#187; et &#171; Karol Jozef 
Wojtyla &#187;. De m&#234;me, certains liens &#233;voluent avec le temps : le pape d&#233;signait &#171; Jean-Paul II &#187; en 
2004 et &#171; Beno&#238;t XVI &#187; en 2012. Des pays parlant la m&#234;me langue (p. ex : France et Suisse 
romande) peuvent &#233;galement utiliser des mots diff&#233;rents pour le m&#234;me concept. Par exemple, 
&#171; chien renifleur &#187; et &#171; chien drogue &#187;. Inversement, le m&#234;me terme peut d&#233;signer des concepts 
diff&#233;rents : dans la province de langue allemande de Bolzano en Italie, le &#171; Landeshauptmann &#187; 
est le pr&#233;sident du conseil provincial, avec des comp&#233;tences beaucoup plus limit&#233;es que le 
&#171; Landeshauptmann &#187; autrichien, qui est &#224; la t&#234;te de l'un des &#201;tats (Land) de la f&#233;d&#233;ration 
autrichienne. Pour la gestion des acronymes, un terme et son acronyme peuvent par exemple 
d&#233;signer le m&#234;me r&#233;f&#233;rent. Dans un contexte multilingue, la difficult&#233; est d'&#233;tablir une 
correspondance entre ces termes. L'article introduisant la notion de prolex&#232;me (Tran, 2006) 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>572 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pr&#233;sente le probl&#232;me des termes ayant des acronymes dans certaines langues, mais pas dans 
d'autres. Dans le projet Prolexbase, Tran (Tran, 2006) consid&#232;re le prolex&#232;me comme le 
regroupement de lemmes associ&#233;s aux diff&#233;rentes formes d'un nom propre qui apparaissent dans 
les diff&#233;rents textes d'une langue donn&#233;e. Par exemple, en fran&#231;ais, Prolexbase regroupe dans le 
m&#234;me prolex&#232;me &#171; organisation des nations unies &#187;1, &#171; Nations unies &#187;, &#171; ONU &#187; et &#171; onusien &#187;2. 
En anglais, Prolexbase regroupe &#171; United Nations &#187; et son acronyme &#171; UN &#187;.  
</p>
<p>Quelles solutions mettre en place de fa&#231;on &#224; choisir, pour un terme donn&#233; dans une langue 
donn&#233;e, le meilleur &#233;quivalent dans une langue cible ? Cette recherche est motiv&#233;e par un besoin 
r&#233;el d'une entreprise dans la gestion de sa terminologie multilingue. 
</p>
<p>Le but principal de notre travail a &#233;t&#233; de d&#233;finir un cadre th&#233;orique compos&#233; d'une nouvelle 
macrostructure bas&#233;e sur des concepts existants et sur la d&#233;finition de nouveaux concepts. Ce 
cadre a ensuite &#233;t&#233; valid&#233; par une exp&#233;rimentation pratique &#224; l'aide d'un outil g&#233;n&#233;rique de 
gestion de bases lexicales. 
</p>
<p>Cet article est organis&#233; de la fa&#231;on suivante. Dans la section 2, nous pr&#233;sentons les 
macrostructures pr&#233;conis&#233;es pour les donn&#233;es. La section 3 pr&#233;sente les outils utilis&#233;s et 
l'impl&#233;mentation de la macrostructure. La section 4 pr&#233;sente les r&#233;sultats de l'impl&#233;mentation et 
de l'utilisation. Enfin, nous concluons et donnons quelques perspectives pour la gestion de 
terminologies riches. 
</p>
<p>2 Donn&#233;es : choix de la macrostructure 
</p>
<p>Lors de toute discussion scientifique, il est primordial de bien s'entendre sur les termes utilis&#233;s. 
C'est pourquoi nous commencerons par d&#233;finir les termes et concepts principaux que nous 
utiliserons par la suite. 
</p>
<p>Un dictionnaire est compos&#233; d'un ou plusieurs volumes reli&#233;s entre eux par des liens qui sont le 
plus souvent des liens de traduction. Un volume est un ensemble d'articles comportant des mots-
vedettes de la m&#234;me langue. Un article comporte au moins un mot-vedette et le plus souvent 
d'autres informations (prononciation, classe grammaticale, d&#233;finition, exemples, etc.). La 
structure des articles est appel&#233;e microstructure. L'organisation des volumes qui composent la 
structure d'un dictionnaire est appel&#233;e macrostructure. La macrostructure la plus simple est celle 
d'un dictionnaire monolingue ne comportant qu'un seul volume. Pour les dictionnaires bilingues 
langue A (LgA) &#10231; langue B (LgB), on trouve souvent des macrostructures avec deux volumes : 
un volume LgA &#10230; LgB et un volume miroir LgB &#10230; LgA. Ces macrostructures constituent 
l'essentiel des dictionnaires imprim&#233;s. L'av&#232;nement de l'outil &#233;lectronique permet de s'abstraire 
des contraintes li&#233;es &#224; l'impression, notamment la repr&#233;sentation restreinte &#224; deux dimensions. On 
peut maintenant concevoir des macrostructures plus complexes utilisant par exemple des volumes 
pivot. Le dictionnaire devient alors une base lexicale &#224; plusieurs dimensions d'o&#249; il est possible 
d'extraire des vues sp&#233;cifiques permettant de retrouver le format initial des dictionnaires 
imprim&#233;s. 
</p>
<p>Nous d&#233;taillerons dans la suite deux macrostructures de ce type. 
</p>
<p>                                                            
1 Nous avons repris exactement la terminologie fran&#231;aise de Prolexbase et les concepts. 
2 Mettre &#171; onusien &#187; dans ce groupe est sans doute une erreur. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>573 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.1 Macrostructure pivot 
</p>
<p>Le projet Papillon, lanc&#233; en 2000 (Tomokiyom et al., 2001), a eu pour but de construire une 
ressource lexicale pour plusieurs langues dont au moins l'anglais, le fran&#231;ais et le japonais. Les 
macrostructures bilingues traditionnelles obligeant &#224; construire un dictionnaire par couple de 
langues, le nombre de dictionnaires cro&#238;t de mani&#232;re triangulaire par rapport au nombre de 
langues en pr&#233;sence. Cette solution devient rapidement ing&#233;rable. Il fallait donc en trouver une 
nouvelle, un dictionnaire multilingue &#224; structure pivot : un volume monolingue pour chaque 
langue et un volume pivot (ou volume interlingue) au centre regroupant les liens entre les articles 
(S&#233;rasset et Mangeot, 2001). La microstructure des articles monolingues est bas&#233;e sur le concept 
de lexie d&#233;fini dans la lexicographie explicative et combinatoire (Mel'cuk et al., 1995) issue de la 
th&#233;orie sens-texte. Chaque article d&#233;crit une lexie. Une lexie est une unit&#233; lexicale (sens de mot) 
qui est repr&#233;sent&#233;e soit par un lex&#232;me (regroupement de mots-forme), soit par une locution 
nominale. 
</p>
<p>Chaque lexie est reli&#233;e par un lien interlingue &#224; une axie (ou acception interlingue). Les axies 
sont contenues dans le volume pivot. Chaque axie regroupe les &#233;quivalents dans plusieurs 
langues d'une m&#234;me lexie (ou sens de mot). 
</p>
<p>Les concepts d'axie et de structure pivot ont &#233;t&#233; d&#233;finis pour le projet Papillon et ensuite repris 
dans la norme Lexical Markup Framework (Francopoulo et al., 2009). 
</p>
<p>2.2 Macrostructure ProAxie 
</p>
<p>Cette macrostructure a pour but de r&#233;soudre le probl&#232;me de relier plusieurs termes qui d&#233;signent 
un m&#234;me et unique r&#233;f&#233;rent. Pour la gestion des acronymes, les liens riches sont plus r&#233;pandus et 
plus complexes. Pour impl&#233;menter la gestion des acronymes, nous proposons une nouvelle 
macrostructure avec deux notions: proaxie3 et prolex&#232;me (Tran, 2006). Nous avons &#233;galement 
besoin des concepts d'axie et de lexie, qui ont &#233;t&#233; pr&#233;sent&#233;s au &#167;2.1. Voir la figure 1.  
</p>
<p>2.2.1 Prolex&#232;me 
</p>
<p>Il y a un seul volume de prolex&#232;mes pour chaque langue. Dans ce volume, les prolex&#232;mes 
regroupent les lexies qui repr&#233;sentent le m&#234;me sens s&#233;mantique mais dont la r&#233;alisation 
syntaxique est diff&#233;rente (forme de surface, classe grammaticale, etc.). Les liens bidirectionnels 
entre les lexies et leurs prolex&#232;mes sont marqu&#233;s avec une &#233;tiquette (alias, acronyme, d&#233;rivation, 
d&#233;finition, etc.). Par exemple, l'entr&#233;e de type prolex&#232;me 
&#171; fra.organisation_des_nations_unies.1 &#187; est reli&#233;e &#224; l'entr&#233;e de type lexie &#171; ONU &#187; par un lien 
&#233;tiquet&#233; &#171; acronyme &#187;, &#224; &#171; nations unies &#187; par un lien &#233;tiquet&#233; &#171; alias &#187;, &#224; &#171; onusien &#187; par un lien 
&#233;tiquet&#233; &#171; d&#233;rivation &#187;, et &#224; &#171; organisation des nations unies &#187; par un lien &#233;tiquet&#233; &#171; d&#233;finition &#187;. 
Ce lien n'est pas la d&#233;finition lexicographique du prolex&#232;me, mais caract&#233;rise seulement le terme 
pr&#233;f&#233;r&#233; pour le d&#233;crire. 
</p>
<p>2.2.2 Proaxie 
</p>
<p>Il y a un seul volume de proaxies dans un dictionnaire. Les proaxies relient les prolex&#232;mes de 
langues diff&#233;rentes qui ont le m&#234;me sens. Prenons l'exemple d'un dictionnaire trilingue : fran&#231;ais, 
anglais et chinois. L'entr&#233;e de type proaxie &#171; proaxie.united_nations.1 &#187; relie l'entr&#233;e 
                                                            
3 ProAxie (A en majuscule) est le nom de macrostructure. Proaxie (a en minuscule) est le nom de concept. 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>574 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#171; fra.organisation_des_nations_unies.1 &#187; du volume des prolex&#232;mes fran&#231;ais, l'entr&#233;e 
&#171; eng.united_nations.1 &#187; du volume des prolex&#232;mes anglais, et l'entr&#233;e &#171; zho.&#13956;&#3996;&#4444;.1 &#187; du 
volume des prolex&#232;mes chinois. Les liens entre l'entr&#233;e de proaxie et les entr&#233;es de prolex&#232;mes 
sont bidirectionnels. 
</p>
<p>2.2.3 Conception globale 
</p>
<p>Dans cette macrostructure, nous avons deux couches : une couche de base et une couche &#171; Pro &#187;. 
Dans la couche de base, nous avons deux types de volume : volume des lexies et volume des 
axies. Dans la couche &#171; Pro &#187;, nous avons &#233;galement deux types de volume : volume des 
prolex&#232;mes et volume des proaxies. 
</p>
<p>Gr&#226;ce au volume d'axies, nous pouvons relier les lexies qui se correspondent exactement, comme 
l'acronyme fran&#231;ais &#171; ONU &#187; reli&#233; avec l'acronyme anglais &#171; UN &#187;. Gr&#226;ce &#224; la couche &#171; Pro &#187;, 
nous pouvons proposer en traduction des lexies des langues cibles de m&#234;me sens, comme indiqu&#233; 
dans la figure 1.  
</p>
<p>FIGURE 1 - Exemple de ProAxie 
</p>
<p>Les &#233;tiquettes port&#233;es par les liens ont pour but de permettre de proposer les meilleures 
traductions. Par exemple, le japonais &#171; &#4444;&#14207;&#13315;&#3996; &#187; est la lexie de m&#234;me sens que &#171; Organisation 
des Nations Unies &#187;, son acronyme est &#171; &#4444;&#13315; &#187;. Cet acronyme utilise le premier et le troisi&#232;me 
kanji, ce qui est diff&#233;rent des initiales de la lexie de d&#233;finition. Il existe peut-&#234;tre une langue qui a 
deux acronymes, l'un correspondant &#224; l'acronyme des initiales, l'autre correspondant &#224; une 
s&#233;lection de caract&#232;res ou de mots. Donc, nous avons d&#233;cid&#233; de ne pas lier ces deux types 
d'acronymes avec une m&#234;me axie, voir la figure 2. 
Consid&#233;rons les liens de la lexie &#171; ONU &#187; du fran&#231;ais vers l'anglais, vers le japonais et vers le 
chinois. Nous proposons trois niveaux de traduction class&#233;s selon la pr&#233;cision obtenue : 
</p>
<p>&#8226; Vers l'anglais : &#171; ONU &#187; &#10230; &#171; UN &#187;. Le syst&#232;me trouve une lexie directe par le volume 
des axies. C'est le premier niveau de traduction et le plus pr&#233;cis. 
</p>
<p>&#8226; Vers le japonais : &#171; ONU &#187; &#10230; &#171; &#4444;&#13315; &#187;. Le syst&#232;me cherche le lien dans le volume des 
prolex&#232;mes fran&#231;ais avec l'&#233;tiquette &#171; Acro &#187;. Puis il trouve le lien dans les proaxies, 
ensuite il suit le lien de prolex&#232;me japonais, et enfin il arrive au volume des lexies 
japonaises, et trouve une lexie en suivant un lien &#233;tiquet&#233; &#171; Acro &#187;. Donc la lexie 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>575 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>propos&#233;e au deuxi&#232;me niveau de la langue cible est cet acronyme. Le deuxi&#232;me niveau 
de traduction comprend toujours le premier niveau de traduction. C'est-&#224;-dire que 
&#171; ONU &#187; et &#171; UN &#187; sont acc&#233;d&#233;s avec la m&#234;me &#233;tiquette &#171; Acro &#187;, donc le lien &#171; ONU &#187; 
&#10230; &#171; UN &#187; correspond &#233;galement au deuxi&#232;me niveau de traduction. 
</p>
<p>&#8226; Vers le chinois : &#171; ONU &#187; &#10230; &#171; &#13956;&#3996;&#4444; &#187;. Le syst&#232;me trouve les lexies par prolex&#232;me 
et proaxie sans &#233;tiquette correspondante. Ces lexies propos&#233;es constituent le troisi&#232;me 
niveau, le moins pr&#233;cis. Le troisi&#232;me niveau de traduction comprend les niveaux 
pr&#233;c&#233;dents. 
</p>
<p>La quantit&#233; de lexies de r&#233;sultat augmente suivant les niveaux de traduction, du premier vers le 
troisi&#232;me. Par exemple, on traduit le terme &#171; ONU &#187; vers l'anglais, le chinois et le japonais. Le 
premier niveau de traduction est la lexie anglaise &#171; UN &#187;. Le deuxi&#232;me niveau de traduction est  
la lexie anglaise &#171; UN &#187; et la lexie japonaise &#171; &#4444;&#13315; &#187;. Le troisi&#232;me niveau de traduction 
comprend les lexies anglaises &#171; UN &#187; et &#171; United Nations &#187;, les lexies japonaises &#171; &#4444;&#13315; &#187; et 
&#171; &#4444;&#14207;&#13315;&#3996; &#187;, et la lexie chinoise &#171; &#13956;&#3996;&#4444; &#187;.   
</p>
<p>   FIGURE 2 - Liens entre les lexies et les axies           FIGURE 3 - Macrostructure de ProAxie 
Dans certaines situations, une base lexicale (un dictionnaire) a plusieurs volumes pour une seule 
langue. Par exemple, lorsqu'il y a plusieurs versions d'&#233;dition ou que la ressource lexicale est 
cr&#233;&#233;e par un syst&#232;me de traduction automatique, on trouvera un volume provenant de Systran, un 
volume de Google, un volume d'IATE, etc. Notre macrostructure permet de g&#233;rer plusieurs 
volumes dans une m&#234;me langue, (voir la figure 3). &#201;tant donn&#233;e une langue, il existe un ou 
plusieurs volumes de lexies, mais un seul volume de prolex&#232;mes. Pour un dictionnaire, il y a un 
seul volume de proaxies et un seul volume d'axies. Les entr&#233;es des lexies sont reli&#233;es aux entr&#233;es 
de type prolex&#232;me et de type axie. De plus, les prolex&#232;mes sont reli&#233;es aux proaxies, et vice-
versa.!
3 Outils n&#233;cessaires : plates-formes de manipulation 
</p>
<p>3.1 Plate-forme Jibiki version 1 
</p>
<p>Pour impl&#233;menter la macrostructure de ProAxie, nous avons utilis&#233; la plate-forme Jibiki. Elle 
permet la construction de sites Web contributifs d&#233;di&#233;s &#224; la construction de bases lexicales 
multilingues. Cette plate-forme a &#233;t&#233; d&#233;velopp&#233;e principalement par Mathieu Mangeot (Mangeot 
et Chalvin, 2006) et Gilles S&#233;rasset (S&#233;rasset et Mangeot, 2001). Elle a &#233;t&#233; utilis&#233;e dans divers 
projets (projet LexALP, projet Papillon, projet GDEF, etc.). Le code est disponible en source 
ouvert et t&#233;l&#233;chargeable gratuitement par SVN sur ligforge.imag.fr. Avec cette plate-forme, on 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>576 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>peut faire les manipulations d'import, export, &#233;dition, modification et recherche dans des bases 
lexicales. On peut aussi g&#233;rer les contributions. 
</p>
<p>Jibiki est une plate-forme g&#233;n&#233;rique, elle permet de traiter presque toutes les ressources lexicales 
de type XML en utilisant diff&#233;rentes microstructures et macrostructures. On utilise des pointeurs 
CDM (Common Dictionary Markup) (Mangeot, 2002) pour g&#233;rer n'importe quel type de 
microstructure sans la modifier. Les pointeurs sont utilis&#233;s &#233;galement pour indexer des parties 
d'information sp&#233;cifiques et permettre ensuite une recherche multi-crit&#232;res. Cette structure est 
stock&#233;e dans un fichier de m&#233;tadonn&#233;es sous forme XML. Pour chaque pointeur CDM, on 
indique le chemin XPath vers l'&#233;l&#233;ment correspondant dans la microstructure XML. Les liens de 
traduction sont &#224; ce stade trait&#233;s comme des pointeurs CDM classiques. 
</p>
<p>La version 1 de Jibiki pr&#233;sentait plusieurs limitations. Les liens de traduction &#233;taient trait&#233;s avec 
des pointeurs CDM, comme des &#233;l&#233;ments d'information classiques. Ces liens &#233;taient simples. Il 
n'y avait pas de possibilit&#233; de d&#233;crire des liens entre plusieurs volumes diff&#233;rents. Il n'&#233;tait pas 
non plus possible d'ajouter des attributs (poids, &#233;tiquette, volume cible, etc.) sur les liens. Nous 
avons remedi&#233; &#224; ces defauts dans Jibiki-2. Jibiki est utilis&#233; pour plusieurs macrostructures. Pour 
chaque macrostructure, il a &#233;t&#233; n&#233;cessaire de recoder une partie du programme pour r&#233;aliser les 
diff&#233;rents types de liens.   
</p>
<p>3.2 Gestion des liens riches : Jibiki-2/Pivax 
</p>
<p>La gestion des liens riches correspond aux liens avec des attributs, comme volume cible,  poids, 
type, langue, &#233;tiquette libre, etc. Pour r&#233;aliser l'impl&#233;mentation de liens riches, nous avons s&#233;par&#233; 
le module de traitement des liens de celui des autres pointeurs CDM.  
</p>
<p>La r&#233;alisation informatique est bas&#233;e sur deux algorithmes. Le premier collecte les liens, le 
deuxi&#232;me construit le r&#233;sultat. Plus pr&#233;cis&#233;ment, le premier recherche tous les liens possibles 
dans l'ensemble des liens riches de tous les volumes pour une entr&#233;e recherch&#233;e. Le deuxi&#232;me 
algorithme r&#233;alise les &#233;tapes suivantes : (1) chercher les liens vers les axies puis vers les lexies 
cibles ; (2) chercher les liens vers les prolex&#232;mes de la langue source puis vers les proaxies, vers 
les prolex&#232;mes des langues cible, et &#224; la fin vers les lexies cibles ; (3) traiter l'&#233;tiquette ; (4) trier 
et afficher. 
</p>
<p>4 R&#233;sultats pr&#233;liminaires 
</p>
<p>Nous avons s&#233;par&#233; les trois niveaux de traduction pour afficher les r&#233;sultats de recherche dans 
Jibiki : (1) traduction directe par axie, (2) traduction par prolex&#232;me et proaxie avec la m&#234;me 
&#233;tiquette, (3) traduction par prolex&#232;me et proaxie sans &#233;tiquette.  
</p>
<p>Pour faciliter la lecture, nous affichons l'&#233;tiquette, la langue et le mot-vedette au 1er et au 2e 
niveau. Nous affichons tous les d&#233;tails (phrases exemples, d&#233;finitions, partie du discours, etc.) au 
3e niveau, y compris les lexies du m&#234;me prolex&#232;me de la langue source. Enfin, nous n'affichons 
pas la traduction au 2e niveau si elle a d&#233;j&#224; &#233;t&#233; trouv&#233;e et est d&#233;j&#224; affich&#233;e au 1er niveau. 
</p>
<p>4.1 Sc&#233;nario 1 : terme &#171; UN &#187; de l'anglais vers toutes les langues 
</p>
<p>Lexies trouv&#233;s en th&#233;orie : le premier niveau de traduction est la lexie fran&#231;aise &#171; ONU &#187;. Le 
deuxi&#232;me niveau de traduction comprend la lexie fran&#231;aise &#171; ONU &#187; et la lexie japonaise &#171; &#4444;
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>577 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#13315; &#187;. Le troisi&#232;me niveau de traduction comprend les lexies fran&#231;aises &#171; ONU &#187;, &#171; Nations 
Unies &#187;, &#171; onusien &#187; et &#171; Organisation des Nations Unies &#187;, la lexie chinoise &#171; &#13956;&#2616;&#3373; &#187; et les 
lexies japonaise &#171; &#4444;&#14207;&#13315;&#3996; &#187; et &#171; &#4444;&#13315; &#187;.   
Lexies affich&#233;es par l'interface : Le premier niveau de traduction est la lexie fran&#231;aise &#171; ONU &#187;. 
Le deuxi&#232;me niveau de traduction est la lexie japonaise &#171; &#4444;&#13315; &#187;. Le troisi&#232;me niveau de 
traduction comprend toutes les lexies : les lexies fran&#231;aises &#171; ONU &#187;, &#171; Nations unies &#187;, 
&#171; onusien &#187; et &#171; Organisation des Nations Unies &#187;, la lexie chinoise &#171; &#13956;&#3996;&#4444; &#187;, les lexies 
japonaises &#171; &#4444;&#14207;&#13315;&#3996; &#187; et &#171; &#4444;&#13315; &#187;, et les lexies anglaises &#171; UN &#187; et &#171; United nations &#187;. 
</p>
<p>FIGURE 4 - terme &#171; UN &#187; de l'anglais vers toutes les langues 
</p>
<p>4.2 Sc&#233;nario 2 : terme &#171; onusien &#187; du fran&#231;ais vers toutes les langues 
</p>
<p>Lexies trouv&#233;s en th&#233;orie : le premier et le deuxi&#232;me niveau de traduction sont vides. Le 
troisi&#232;me niveau comprend les lexies anglaises &#171; UN &#187; et &#171; United nations &#187;, la lexie chinoise 
&#171; &#13956;&#2616;&#3373; &#187; et les lexies japonaises &#171; &#4444;&#14207;&#13315;&#3996; &#187; et &#171; &#4444;&#13315; &#187;.  
Lexies affich&#233;es par l'interface : le premier et le deuxi&#232;me niveau de traduction sont vides. Le 
troisi&#232;me niveau comprend toutes les lexies. 
</p>
<p>FIGURE 5 - terme &#171; onusien &#187; du fran&#231;ais vers toutes les langues 
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>578 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 Conclusion et perspectives 
</p>
<p>Nous avons pr&#233;sent&#233; la gestion des terminologies avec liens riches en utilisant un exemple 
d'acronyme (ONU) de nom propre. Nous avons repris les concepts de lexie, d'axie, de prolex&#232;me, 
et introduit le concept de proaxie pour produire la macrostructure de ProAxie. Dans cette 
macrostructure, une &#233;tiquette est utilis&#233;e pour relier les lexies et leurs variantes. Nous avons 
impl&#233;ment&#233; la solution de la macrostructure ProAxie dans la plateforme Jibiki en utilisant la 
nouvelle Jibiki-2/Pivax, et cr&#233;&#233; trois niveaux de traduction en th&#233;orie et en affichage.  
</p>
<p>Concernant les donn&#233;es, la base actuelle est une preuve de concept qui comporte quelques 
exemples issus de ProlexBase. Nous souhaitons tester cette solution en passant &#224; l'&#233;chelle sur de 
grosses bases telles que la CJK (chinois, japonais, cor&#233;en, arabe) avec 24 millions d'entr&#233;es ou 
l'Unified Medical Language System4 avec 5 millions de termes. 
Dans l'avenir, nous souhaitons faire &#233;voluer la macrostructure de ProAxie pour prendre en 
compte d'autres types de synonymie, et transposer le concept de prolex&#232;me pour que cette 
solution puisse &#234;tre utilis&#233;e dans un autre domaine linguistique. Par exemple, pour une ressource 
lexicale comprenant des textos, en fran&#231;ais &#171; A+ &#187; correspond &#224; &#171; &#192; plus &#187; avec une &#233;tiquette 
&#171; texto &#187;, et en anglais &#171; L8R &#187; correspond &#224; &#171; later &#187; avec l'&#233;tiquette &#171; texto &#187;. 
Nous pr&#233;voyons de prendre en compte &#233;galement les quatre variations du diasyst&#232;me bas&#233; 
essentiellement sur ce que Eugenio Coseriu propose (Tran, 2006) : diachronique (vari&#233;t&#233; dans le 
temps), diaphasique (vari&#233;t&#233; concernant les finalit&#233;s de l'emploi), diatopique (vari&#233;t&#233; dans 
l'espace) et diastratique (vari&#233;t&#233; relative &#224; la stratification socio-culturelle). Nous voudrions 
enrichir la notion d'&#233;tiquette selon cette th&#233;orie. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>TRAN, M. (2006). Prolexbase : Un dictionnaire relationnel multilingue de noms propres : 
conception, impl&#233;mentation et gestion en ligne. Th&#232;se de doctorat, Tours, pages 54-57. 
</p>
<p>S&#201;RASSET, G. et MANGEOT, M. (2001). Papillon Lexical Database Project: Monolingual 
Dictionaries and Interlingual Links. In Proc. Of NLPRS 2011, Tokyo, pages 119-125. 
</p>
<p>TOMOKIYOM, M., MANGEOT, M. et PLANAS, E., (2001). Papillon: a Project of Lexical Database 
for English, French and Japanese, using Interlingual Links. In Actes de JST 2001, Tokyo, 3 p. 
</p>
<p>MEL'!UK, I., CLAS, A. et POLGU&#200;RE, A. (1995). Introduction &#224; la lexicologie explicative et 
combinatoire. Livre, 256 p. 
</p>
<p>FRANCOPOULO, G., BEL, N., GEORGE, M., CALZOLARI, N., MONACHINI. M., PET, M. et  SORIA, C. 
(2009). Multilingual resources for NLP in the lexical markup framework (LMF). In journal de 
Language Resources and Evaluation, March 2009, Volume 43, pages 55-57. 
</p>
<p>MANGEOT, M., et CHALVIN, A.  (2006). Dictionary Building with the Jibiki Platform : the GDEF 
case. In Actes de LREC 2006, Genoa, pages 1666-1669. 
</p>
<p>MANGEOT, M. (2002). An XML Markup Language Framework for Lexical Databases 
Environments: the Dictionary Markup Language. In Actes de LREC 2002, pages 37-44. 
</p>
<p>                                                            
4 http://www.cjk.org; http://www.nlm.nih.gov/research/umls/  
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>579 c&#65535; ATALA</p>

</div></div>
</body></html>