<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>S&#233;mantique des d&#233;terminants dans un cadre richement typ&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>S&#233;mantique des d&#233;terminants dans un cadre richement typ&#233;
</p>
<p>Christian Retor&#233;
IRIT (CNRS, Toulouse) &amp; Universit&#233; de Bordeaux (LaBRI)
</p>
<p>Christian.Retore@irit.fr
</p>
<p>R&#201;SUM&#201;
La variation du sens des mots en contexte nous a conduit &#224; enrichir le syst&#232;me de types utilis&#233;s
dans notre analyse syntaxico-s&#233;mantique du fran&#231;ais bas&#233; sur les grammaires cat&#233;gorielles et
la s&#233;mantique de Montague (ou la lambda-DRT). L&#8217;avantage majeur d&#8217;une telle s&#233;mantique
profonde est de repr&#233;senter le sens par des formules logiques ais&#233;ment exploitables, par exemple
par un moteur d&#8217;inf&#233;rence. D&#233;terminants et quantificateurs jouent un r&#244;le fondamental dans
la construction de ces formules, et il nous a fallu leur trouver des termes s&#233;mantiques adapt&#233;s
&#224; ce nouveau cadre. Nous proposons une solution inspir&#233;e des op&#233;rateurs epsilon et tau de
Hilbert, &#233;l&#233;ments g&#233;n&#233;riques qui s&#8217;apparentent &#224; des fonctions de choix. Cette mod&#233;lisation
unifie le traitement des diff&#233;rents types de d&#233;terminants et de quantificateurs et autorise le
liage dynamique des pronoms. Surtout, cette description calculable des d&#233;terminants s&#8217;int&#232;gre
parfaitement &#224; l&#8217;analyseur &#224; large &#233;chelle du fran&#231;ais Grail, tant en th&#233;orie qu&#8217;en pratique.
</p>
<p>ABSTRACT
On the semantics of determiners in a rich type-theoretical framework
</p>
<p>The variation of word meaning according to the context led us to enrich the type system of
our syntactical and semantic analyser of French based on categorial grammars and Montague
semantics (or lambda-DRT). The main advantage of a deep semantic analyse is too represent
meaning by logical formulae that can be easily used e.g. for inferences. Determiners and
quantifiers play a fundamental role in the construction of those formulae and we needed to
provide them with semantic terms adapted to this new framework. We propose a solution
inspired by the tau and epsilon operators of Hilbert, generic elements that resemble choice
functions. This approach unifies the treatment of the different determiners and quantifiers and
allows a dynamic binding of pronouns. Above all, this fully computational view of determiners
fits in well within the wide coverage parser Grail, both from a theoretical and a practical
viewpoint.
</p>
<p>MOTS-CL&#201;S : Analyse s&#233;mantique automatique, S&#233;mantique formelle, Compositionnalit&#233;.
KEYWORDS: Automated semantic analysis, Formal Semantics, Compositional Semantics.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>367 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Pr&#233;sentation
</p>
<p>Dans le cadre du traitement automatique des langues, on entend plus souvent parler de s&#233;-
mantique distributionnelle, de vecteurs de mots et de fr&#233;quences que de s&#233;mantique formelle
ou compositionnelle. Certes, les approches quantitatives sont plus ais&#233;es &#224; mettre en oeuvre et
fournissent des outils efficaces mais elles ne r&#233;pondent pas aux m&#234;mes questions. Les approches
quantitatives sont fort utiles en recherche d&#8217;information et en classification car elles permettent
de dire de quoi parle une phrase, une page web, un texte. En revanche elles ne disent pas
ce qu&#8217;affirme le texte analys&#233;, qui fait quoi. Une phrase peut tr&#232;s bien nier quelque chose, et
ainsi causer une erreur &#224; un syst&#232;me de recherche d&#8217;information (cf. exemple 1). Il faut aussi
savoir reconna&#238;tre les pronoms, pour r&#233;pondre &#224; des questions comme Geach &#233;tait-il l&#8217;&#233;l&#232;ve de
Wittgenstein ? &#224; partir du web o&#249; on ne trouve que l&#8217;exemple (2). 1
</p>
<p>(1) Mais v&#233;rification faite, ce n&#8217;&#233;tait PAS un OURAGAN qui &#233;tait pass&#233; par l&#224;.
</p>
<p>(2) Bien qu&#8217;IL N&#8217;ait JAMAIS suivi l&#8217;enseignement acad&#233;mique de CE DERNIER, cependant IL EN
&#233;prouva fortement l&#8217;influence.
</p>
<p>Ainsi, l&#8217;analyse s&#233;mantique compl&#232;te et profonde d&#8217;une ou plusieurs phrases reste une t&#226;che
pertinente dans le traitement automatique des langues. Ce processus est utilement compl&#233;t&#233; par
des techniques statistiques, par exemple pour trouver les paragraphes pertinents ou pour d&#233;finir
des pr&#233;f&#233;rences contextuelles lorsque plusieurs sens sont possibles. Une fois les formules logiques
construites &#224; partir du texte, un moteur d&#8217;inf&#233;rence est capable de dire si une formule ou un
&#233;nonc&#233; d&#233;coule de ce qui a &#233;t&#233; analys&#233; &#8212; plus facilement qu&#8217;avec des graphes s&#233;mantiques.
</p>
<p>Les d&#233;terminants (voir par exemple (Corblin et al., 2004)) sont un ingr&#233;dient important de
l&#8217;analyse logique d&#8217;une phrase. Les d&#233;terminants ind&#233;finis correspondent g&#233;n&#233;ralement &#224; une
quantification existentielle ou, ce qui s&#8217;en approche, &#224; l&#8217;introduction d&#8217;un r&#233;f&#233;rent de discours &#8212;
il peuvent aussi exprimer une propri&#233;t&#233; notamment en position d&#8217;attribut, mais nous ne parlerons
pas de ce dernier sens. Les d&#233;terminants d&#233;finis correspondent plut&#244;t &#224; la d&#233;signation d&#8217;un
&#233;l&#233;ment saillant du contexte, mais il arrive qu&#8217;ils introduisent un &#233;l&#233;ment de discours. Assez
souvent, ils expriment la quantification vague comme &quot;beaucoup, la plupart&quot;. La quantification
universelle est assez rare, et elle peut s&#8217;exprimer par un usage g&#233;n&#233;rique de &quot;un, le, la, les&quot;.
</p>
<p>D&#8217;un point de vue pratique, ce travail se situe dans le cadre des grammaires cat&#233;gorielles qui
sont une approche de la syntaxe tr&#232;s orient&#233;e vers la s&#233;mantique compositionnelle. En effet, il
est assez ais&#233; de d&#233;duire de la structure syntaxique propos&#233;e par une grammaire cat&#233;gorielle
une repr&#233;sentation du sens sous forme logique. D&#8217;ailleurs, &#224; notre connaissance, les deux seuls
syst&#232;mes produisant une analyse s&#233;mantique compl&#232;te comme une formule logique (une DRS,
en fait) sont bas&#233;s sur les grammaires cat&#233;gorielles : Boxer de Bos (2008) analyse de l&#8217;anglais
par des Categorial Combinatory Grammars tandis que nous utilisons Grail de Moot (2010a,b)
bas&#233; sur les Multimodal Categorial Grammars. Dans un cas comme dans l&#8217;autre, la grammaire est
acquise automatiquement sur corpus annot&#233;. L&#8217;acquisition automatique de la grammaire produit
un grand nombre de cat&#233;gories par mot, et un minimum de traitement probabiliste est n&#233;cessaire
pour ne consid&#233;rer que les assignations les plus probables lors de l&#8217;analyse. Du point de vue
s&#233;mantique, ces syst&#232;mes utilisent la correspondance entre syntaxe et s&#233;mantique telle qu&#8217;initi&#233;e
</p>
<p>1. Sauf mention contraire, nos exemples proviennent d&#8217;Internet.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>368 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mot type s&#233;mantique u&#8727;
terme semantique : &#955;-terme de type u&#8727;
x v la variable ou la constante x est de type v
</p>
<p>un (e&#8594; t)&#8594; ((e&#8594; t)&#8594; t)
&#955;Pe&#8594;t &#955;Qe&#8594;t (&#8707;(e&#8594;t)&#8594;t (&#955;xe(&#8743;t&#8594;(t&#8594;t)(P x)(Q x))))
</p>
<p>club e&#8594; t
&#955;xe(clube&#8594;t x)
</p>
<p>a_battu e&#8594; (e&#8594; t)
&#955;ye &#955;xe ((a_battue&#8594;(e&#8594;t) x)y)
</p>
<p>Leeds e
Leeds
</p>
<p>FIGURE 1 &#8211; Un lexique s&#233;mantique &#233;l&#233;mentaire
</p>
<p>par Montague c.f. (Moot et Retor&#233;, 2012, chapitre 3). Rappelons la bri&#232;vement sur un exemple,
car c&#8217;est le point de d&#233;part de nos travaux.
</p>
<p>Supposons que l&#8217;analyse syntaxique de &quot;un club a_battu Leeds.&quot; produise &quot;(un (club)) (a_battu
Leeds)&quot; expression dans laquelle la fonction est syst&#233;matiquement &#233;crite &#224; gauche. Si les termes
s&#233;mantiques sont ceux du lexique de la figure 1, alors en rempla&#231;ant les mots par les termes
s&#233;mantiques associ&#233;s on obtient un grand &#955;-terme, que l&#8217;on peut r&#233;duire :
</p>
<p>&#65535;&#65535;
&#955;Pe&#8594;t &#955;Qe&#8594;t (&#8707;(e&#8594;t)&#8594;t (&#955;xe(&#8743;(P x)(Q x))))&#65535;&#65535;&#955;xe(clube&#8594;t x)&#65535;&#65535;&#65535;&#65535;
</p>
<p>&#955;ye &#955;xe ((a_battue&#8594;(e&#8594;t) x)y)
&#65535;
</p>
<p>Leedse
&#65535;
</p>
<p>&#8595; &#946;&#65535;
&#955;Qe&#8594;t (&#8707;(e&#8594;t)&#8594;t (&#955;xe(&#8743;t&#8594;(t&#8594;t)(clube&#8594;t x)(Q x))))&#65535;&#65535;
</p>
<p>&#955;xe ((a_battue&#8594;(e&#8594;t) x)Leedse)
&#65535;
</p>
<p>&#8595; &#946;&#65535;&#8707;(e&#8594;t)&#8594;t (&#955;xe(&#8743;(clube&#8594;t x)((a_battue&#8594;(e&#8594;t) x)Leedse)))&#65535;
Ce &#955;-terme de type t peut &#234;tre appel&#233; la forme logique de la phrase ; il est plus agr&#233;able sous
un format standard : &#8707;x : e (club(x) &#8743; a_battu(x , Leeds)). Nous verrons ci-apr&#232;s que ce
traitement standard de la quantification pose probl&#232;me, notamment avec la s&#233;mantique lexicale.
</p>
<p>On observera qu&#8217;il y a deux logiques &#224; l&#8217;oeuvre. La premi&#232;re est le calcul propositionnel intui-
tionniste dont on n&#8217;utilise que les preuves ou &#955;-termes : elle assemble des formules partielles. La
seconde est une logique dont on n&#8217;utilise que les formules. Le &#955;-terme de type t obtenu in fine
est effectivement une formulation logique du sens en &#955;-calcul.
</p>
<p>2 D&#233;terminants et quantificateurs
</p>
<p>Sans surprise, les d&#233;terminants consid&#233;r&#233;s sont de deux sortes, d&#233;finis et ind&#233;finis &#8212; nous
essaierons d&#8217;&#233;viter les pluriels : ils posent d&#8217;autres probl&#232;mes abord&#233;s dans ce cadre par Moot
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>369 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>et Retor&#233; (2011). Logiquement, les d&#233;terminants ind&#233;finis s&#8217;apparentent &#224; une quantification
existentielle dite g&#233;n&#233;ralis&#233;e lorsqu&#8217;il agissent sur une classe ou lorsqu&#8217;ils introduisent un nouveau
r&#233;f&#233;rent de discours &#8212; nous n&#8217;aborderons pas le cas o&#249; ils introduisent une propri&#233;t&#233;, par
exemple dans un groupe nominal attribut. Pr&#233;cisons de suite qu&#8217;un travail de formalisation et
d&#8217;automatisation comme le n&#244;tre ne peut pr&#233;tendre atteindre la finesse de travaux plus descriptifs
comme ceux de Corblin et al. (2004), et que nous sommes donc contraints de sch&#233;matiser, voire
d&#8217;ignorer, certaines constructions. Consid&#233;rons quelques exemples :
</p>
<p>(3) a. J&#8217;ai senti un animal ME TOUCHER LE PIED.
</p>
<p>b. Un parent d&#8217;&#233;l&#232;ve de maternelle VIENT CHERCHER SON ENFANT en &#233;tat d&#8217;&#233;bri&#233;t&#233;, 2
</p>
<p>l&#8217;enseignant commet-il une faute en remettant l&#8217;enfant &#224; ce parent ?
</p>
<p>(4) a. Aujourd&#8217;hui, je me suis r&#233;veill&#233; en sursaut parce que j&#8217;ai senti quelque chose ME
TOUCHER LE PIED. Il s&#8217;est av&#233;r&#233; que c&#8217;&#233;tait mon autre pied.
</p>
<p>b. Pr&#233;cisez si quelqu&#8217;un VIENT CHERCHER L&#8217;ENFANT.
</p>
<p>(5) a. Il y avait une panth&#232;re sortie de la cage. Elle &#233;tait attach&#233;e. L&#8217;animal a saut&#233; sur
moi.
</p>
<p>b. Un homme avait menac&#233; la principale du coll&#232;ge de Monts o&#249; son fils &#233;tait scolaris&#233;.
Le parent d&#8217;&#233;l&#232;ve a &#233;t&#233; condamn&#233; hier.
</p>
<p>(6) A la SPA si ont d&#233;sire adopter un animal il faut donner 500F, et on a 24 Heures pour
r&#233;fl&#233;chir si l&#8217;on d&#233;sire l&#8217;animal ou non.
</p>
<p>Les deux premiers exemples (3) sont &#224; mettre en parall&#232;le avec les deux suivants (4) qui
correspondent eux-aussi &#224; une quantification existentielle. Dans cette deuxi&#232;me version, il n&#8217;y a
que le pr&#233;dicat principal, que nous avons choisi pour &#234;tre le m&#234;me, et il n&#8217;y a plus de restriction &#224;
une classe d&#8217;objets par un nom commun, avec ou sans compl&#233;ments (N syntaxiquement ou e&#8594; t
s&#233;mantiquement). Observons que le traitement usuel de la quantification dans une logique non
typ&#233;e &#224; la Frege ne fait aucun distinction entre le nom quantifi&#233; et le pr&#233;dicat principal.
</p>
<p>Les d&#233;terminants d&#233;finis ont un rapport avec les d&#233;terminants ind&#233;finis, qui souvent les intro-
duisent, comme le montre les exemples (5) Les expressions se correspondent, et id&#233;alement on
aimerait que &quot;le X&quot; soit pr&#233;c&#233;d&#233; de &quot;un X&quot;, comme dans l&#8217;exemple (6). En fait, c&#8217;est plut&#244;t rare, et
les exemples en corpus sont plut&#244;t comme (5) : l&#8217;ant&#233;c&#233;dent de l&#8217;anaphore associative n&#8217;est pas
celui qu&#8217;on esp&#232;rerait pour un traitement automatique, quelques inf&#233;rences sont n&#233;cessaires.
</p>
<p>2.1 Traitement usuel et critique
</p>
<p>L&#8217;analyse traditionnelle attribue &#224; l&#8217;article ind&#233;fini un terme s&#233;mantique exprimant une quantifi-
cation existentielle.
</p>
<p>(7) un : &#955;Pe&#8594;t&#955;Qe&#8594;t(&#8707;&#955;x t.&amp;(P x)(Q x)) : (e&#8594; t)&#8594; (e&#8594; t)&#8594; t
(8) quelque chose : &#8707; : (e&#8594; t)&#8594; t
2. Il s&#8217;agit sans doute du parent :-)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>370 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les articles d&#233;finis sont trait&#233;s diff&#233;remment : les groupes nominaux qu&#8217;ils introduisent sont plut&#244;t
vus comme des anaphores, dites associatives, dont on cherche les r&#233;f&#233;rents. 3 Cette mod&#233;lisation
classique en s&#233;mantique formelle ou dans les grammaires cat&#233;gorielles pose divers probl&#232;mes.
</p>
<p>Syntaxe et s&#233;mantique Les d&#233;terminants trait&#233;s comme des quantificateurs g&#233;n&#233;ralis&#233;s
mettent &#224; mal la correspondance entre syntaxe et s&#233;mantique. La structure s&#233;mantique (9c) et la
structure syntaxique (9b) ne co&#239;ncident pas. Les grammaires cat&#233;gorielles obtiennent une struc-
ture syntaxique (9c), laquelle n&#8217;a rien de naturel, au prix d&#8217;une cat&#233;gorie syntaxique diff&#233;rente
pour chaque position syntaxique du groupe nominal quantifi&#233; : cela n&#8217;est gu&#232;re satisfaisant.
</p>
<p>(9) a. elle &#233;coutait une chanson de lassana hawa
b. SYNT. USUELLE : (elle (&#233;coutait (une (chanson (de lassana hawa)))))
c. SEM. &amp; CG : ((une (chanson (de lassana hawa))) (&#955;x elle &#233;coutait x))
</p>
<p>R&#233;f&#233;rence du groupe nominal quantifi&#233; Comme le fait remarquer (Geach, 1962), on peut
se forger une interpr&#233;tation du groupe nominal d&#233;fini ou ind&#233;fini, avant m&#234;me que le pr&#233;dicat
principal soit &#233;nonc&#233;... et dans l&#8217;exemple (10c) il n&#8217;arrive jamais.
</p>
<p>(10) a. Ensuite, LES &#201;L&#200;VES sont all&#233;s en salle info, pour r&#233;aliser un caryotype class&#233;.
b. Ensuite, DES &#201;L&#200;VES sont venus voir ce que l&#8217;on faisait.
c. Un luth, une mandore, une viole, que Michel-Ange [...]. [phrase nominale]. 4
</p>
<p>Asym&#233;trie entre th&#232;me et rh&#232;me L&#8217;approche standard impose une sym&#233;trie entre le pr&#233;dicat
principal et la restriction &#224; une classe d&#8217;objets, sym&#233;trie que la langue ne fait pas.
</p>
<p>(11) a. Certains politiciens sont des menteurs car ce qui les int&#233;resse (...)
b. * Certains menteurs sont des politiciens car ce qui les int&#233;resse (...) 5
</p>
<p>D&#233;finis et ind&#233;finis Comme remarqu&#233; dans (Egli et von Heusinger, 1995; von Heusinger,
1997, 2004), l&#8217;unicit&#233; est loin d&#8217;&#234;tre requise lorsque l&#8217;on utilise un d&#233;terminant d&#233;fini. Un locuteur
peut dire &quot;l&#8217;&#238;le&quot; du lac de Constance, alors qu&#8217;il y en a trois, comme ici sur Internet :
</p>
<p>(12) Recueilli (...) par les moines de l&#8217;abbaye de Reichenau, sur l&#8217;ile du lac de Constance,
</p>
<p>De plus, &quot;un&quot; et &quot;le&quot; se rapprochent aussi car le contexte extra linguistique permet parfaitement
d&#8217;utiliser l&#8217;article d&#233;fini sans que le r&#233;f&#233;rent n&#8217;ait jamais &#233;t&#233; introduit.
</p>
<p>(13) J&#8217;avais pris l&#8217;assurance &#8217;automatiquement&#8217; avec le pr&#234;t immobilier lors de l&#8217;achat de la
maison. 6
</p>
<p>Les d&#233;terminants &quot;un&quot; et &quot;le&quot; se ressemblent, alors que la s&#233;mantique formelle usuelle les opposent.
Selon von Heusinger il s&#8217;agit d&#8217;une diff&#233;rence d&#8217;interpr&#233;tation et non de forme logique : &quot;un&quot;
choisit un nouvel &#233;l&#233;ment, tandis que &quot;le&quot; choisit le plus saillant des r&#233;f&#233;rents possibles.
</p>
<p>3. Une autre approche utilise une fonction de choix, mais nous allons justement pr&#233;senter une solution de cet ordre.
4. Mathias Enard, Parle-leur de batailles, de rois et d&#8217;&#233;l&#233;phants Actes-Sud, 2010.
5. Cet exemple est de nous, pour faire contraste avec le pr&#233;c&#233;dent.
6. Dans ce r&#233;cit trouv&#233; sur une FAQ il n&#8217;a jamais &#233;t&#233; question de &quot;maison&quot; auparavant
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>371 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les pronoms de type E ne sont pas des pronoms particuliers, mais une interpr&#233;tation possible
et tr&#232;s naturelle des pronoms due &#224; Evans (1977). Cette interpr&#233;tation consiste &#224; associer au
pronom le terme s&#233;mantique de son ant&#233;c&#233;dent. On peut aussi traiter de la sorte les groupes
nominaux introduits par l&#8217;article d&#233;fini (Egli et von Heusinger, 1995; von Heusinger, 1997, 2004).
Cela permet d&#8217;&#233;tendre la port&#233;e du quantificateur existentiel souvent introduit par &quot;un&quot; comme le
font la DRT et la dynamic predicate logic. Ce type d&#8217;interpr&#233;tation n&#8217;est pas possible avec le terme
s&#233;mantique standard associ&#233; &#224; &quot;un&quot; en (7).
</p>
<p>(14) a. Soudain, un homme est entr&#233;.
</p>
<p>b. IL / CET HOMME / L&#8217;HOMME a hurl&#233; &#171; Donne-moi la caisse ! &#187;.
</p>
<p>3 Op&#233;rateurs de Hilbert, quantificateurs et d&#233;terminants
</p>
<p>Les op&#233;rateurs de Hilbert, surtout &#953; et &#949;, ont &#233;t&#233; utilis&#233;s pour mod&#233;liser les d&#233;terminants et la
quantification existentielle, en particulier par von Heusinger (Egli et von Heusinger, 1995; von
Heusinger, 1997, 2004). Ces op&#233;rateurs, bien d&#233;crits par Hilbert et Bernays (1939), s&#8217;apparentent
aux fonctions de choix (2nd ordre) qui elles m&#234;mes se rapprochent des fonctions de Skolem (1er
ordre, la quantification sur ces fonctions &#233;tant report&#233;e au moment de leur interpr&#233;tation) &#8212; voir
par exemple Steedman (2012). Mais les op&#233;rateurs de Hilbert ne sont pas comparables avec ces
autres formes de quantification : ils incluent les quantificateurs usuels, mais permettent en outre
une forme de liage dynamique (comme dans dynamic predicate logic) ainsi que des d&#233;pendances
complexes &#224; la mani&#232;re des quantificateurs branchants de Henkin. Pour davantage de pr&#233;cision
sur les op&#233;rateurs de Hilbert, on pourra consulter Slater (2005) ou Avigad et Zach (2008).
</p>
<p>Russell (1905) eut le premier l&#8217;id&#233;e d&#8217;introduire un terme &#8212; un individu &#8212; not&#233; &#953;x P(x) comme
interpr&#233;tation logique d&#8217;une description d&#233;finie &quot;le P&quot; o&#249; &quot;P&quot; est une propri&#233;t&#233;, une formule &#224; une
variable libre. Que d&#233;note ce terme ? Rien s&#8217;il n&#8217;existe pas un unique individu tel que P(x), et
sinon cet unique individu. Mais chacun sait que le quantificateur &quot;il existe un unique x tel que
P(x)&quot; (&#8707;!xP(x)) n&#8217;a pas de bonnes propri&#233;t&#233;s, notamment parce que sa n&#233;gation, aucun ou au
moins deux n&#8217;a rien de naturel : &#172;&#8707;!x . P(x)&#8801; (&#8704;x&#172;P(x))&#8744; (&#8707;y&#8707;z(y &#65535;= z)&amp;P(y)&#8743; P(z)).
Hilbert a donc reformul&#233; ces termes g&#233;n&#233;riques en laissant de c&#244;t&#233; la condition d&#8217;unicit&#233;. Il associe
un terme &#949;x F(x) &#224; toute formule F(x), qui permet d&#8217;exprimer la quantification existentielle
puisque F(&#949;x F(x)) &#8801; &#8707;x F(x). Il introduit aussi son dual &#964;x F(x) qui permet d&#8217;exprimer la
quantification universelle par F(&#964;x F(x)) &#8801; &#8704;x F(x). Les op&#233;rateurs &#949;x et &#964;x lient la variable
x dans F(x). Bien s&#251;r, au vu de cette dualit&#233;, un seul des deux op&#233;rateurs &#964; et &#949; suffit, si on
dispose de la n&#233;gation. Il est tr&#232;s compliqu&#233; d&#8217;interpr&#233;ter ces termes en toute g&#233;n&#233;ralit&#233; puisqu&#8217;on
sort de la logique du premier ordre. Les mod&#232;les correspondant sont tr&#232;s complexes, voire mal
d&#233;finis (Asser, 1957). En revanche, pour les formules du calcul de Hilbert qui correspondent
&#224; des formules habituelles, les mod&#232;les usuels fonctionnent et le th&#233;or&#232;me de compl&#233;tude est
v&#233;rifi&#233;. En l&#8217;absence de mod&#232;les simples, d&#233;finissons la &#8220;v&#233;rit&#233;&quot; de ces formules en termes de
d&#233;duction, d&#8217;autant que les r&#232;gles de d&#233;duction d&#233;finissant ces op&#233;rateurs sont les r&#232;gles usuelles
de la quantification :
&#8211; De F(t) o&#249; t est n&#8217;importe quel terme, on peut d&#233;duire F(&#949;x F(x)) c&#8217;est-&#224;-dire &#8707;x F(x).
&#8211; Si l&#8217;on a &#233;tabli F(x) sans rien supposer sur x , on peut en d&#233;duire F(&#964;x F(x)) c&#8217;est-&#224;-dire&#8704;x F(x)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>372 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour les applications linguistiques, seul &#949; a &#233;t&#233; utilis&#233; : la quantification existentielle joue un
r&#244;le central dans la langue, par exemple la DRT organise le discours autour des quantifications
existentielles. L&#8217;id&#233;e v&#233;hicul&#233;e par cet &#949; est simplement de construire un terme g&#233;n&#233;rique
associ&#233; au groupe nominal quantifi&#233;. Par exemple, pour &quot;un enfant sage&quot; on forme le terme
&#949;x .(en f ant(x)&amp;sage(x)). Selon von Heusinger, pour &quot;l&#8217;enfant sage&quot; le terme est quasi identique :
&#949;1x .(en f ant(x)&amp;sage(x)).
</p>
<p>7 La diff&#233;rence entre &#949;1 et &#949; n&#8217;est qu&#8217;une diff&#233;rence d&#8217;interpr&#233;tation : &#949;1
</p>
<p>choisit le plus saillant en contexte tandis que &#949; en choisit un nouveau. Le typage &#224; la Montague de
ces op&#233;rateurs n&#8217;est pas donn&#233;. Cependant, &#949; et &#949;1 sont de type (e&#8594; t)&#8594; e : &#949; et &#949;1 produisent
un individu (un terme) &#224; partir d&#8217;une propri&#233;t&#233; (ici : en f ant(x)&amp;sage(x)), comme le ferait une
fonction de choix.
</p>
<p>4 Rappels sur le lexique g&#233;n&#233;ratif montagovien
</p>
<p>Dans (Bassac et al., 2010), nous avons propos&#233; un lexique syntaxique et s&#233;mantique qui &#233;tend
consid&#233;rablement la s&#233;mantique de Montague pour rendre compte de l&#8217;adaptation du sens d&#8217;un
mot au contexte. Ce mod&#232;le s&#8217;est av&#233;r&#233; pertinent pour des questions de s&#233;mantique lexicale ou
compositionnelle : copr&#233;dications possibles ou non, ambiguit&#233; des d&#233;verbaux (Real-Coelho et
Retor&#233;, 2013), le voyageur fictif (Moot et al., 2011), pluriels (Moot et Retor&#233;, 2011), termes
g&#233;n&#233;riques (Retor&#233;, 2012)). Notre mod&#232;le est assez proche de (Asher, 2011; Luo, 2011, 2012),
mais nous sommes les premiers &#224; aborder la quantification et des d&#233;terminants dans un cadre
adapt&#233; &#224; la s&#233;mantique lexicale.
</p>
<p>La question initiale qui nous a conduit &#224; utiliser une th&#233;orie des types plus sophistiqu&#233;e que
celle de Montague est fort simple : comment rendre compte des restrictions de s&#233;lection ? Plus
concr&#232;tement, comment rejeter les deux premiers exemples et accepter les suivants ?
</p>
<p>(15) * leur dix est BON [cf. ex. (19)]
</p>
<p>(16) a. * Une chaise ABOIE souvent. [ex. invent&#233;]
b. Mon chiot ABOIE souvent pour m&#8217;inciter &#224; jouer avec.
</p>
<p>(17) a. Barcelone A BATTU Benfica 2-0. [club]
b. Barcelone (/*et) A CHOISI DE STRUCTURER LE R&#201;SEAU ROUTIER de mani&#232;re &#224; pr&#233;server
</p>
<p>un centre ville pi&#233;tonnier. [institution]
</p>
<p>(18) a. Mon premier livre de cuisine . . . Mon livre F&#201;TICHE &#224; cette &#233;poque !
b. Je l&#8217;ai RETROUV&#201;, il y a peu, chez ma maman [mon premier livre de cuisine]
</p>
<p>En utilisant diff&#233;rents types d&#8217;entit&#233;s et en sp&#233;cifiant le type d&#8217;objet attendu par les pr&#233;dicats, les
compositions s&#233;mantiquement impossibles produisent des conflits de types. Le sujet du verbe
&quot;aboyer&quot; doit &#234;tre un chien, ou tout au moins un animal, (16a) un nombre ne saurait &#234;tre &quot;leur&quot;
ni &#234;tre &quot;bon&quot; (15) etc. L&#8217;impossibilit&#233; s&#233;mantique est mat&#233;rialis&#233;e par l&#8217;application d&#8217;un pr&#233;dicat
P&#958;&#8594;t pr&#233;supposant un argument de type &#958; (par exemple &quot;animal&quot;) &#224; un argument a&#945; d&#8217;un autre
type &#945; (par exemple, &quot;meuble&quot;) avec &#945; &#65535;= &#958; : P&#958;&#8594;ta&#945;
</p>
<p>7. Les notations de von Heusinger sont source de confusion. Il note &#951; notre &#949; qui correspond au &quot;un&quot; existentiel et
qui s&#8217;interpr&#232;te toujours par un nouvel individu, tandis qu&#8217;il note &#949; notre &#949;1 qui correspond &#224; l&#8217;article d&#233;fini &quot;le,la&quot; sans
contrainte d&#8217;unicit&#233; et qui est interpr&#233;t&#233; par l&#8217;&#233;l&#233;ment le plus saillant.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>373 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>On notera qu&#8217;il faut parfois relaxer ces contraintes. Dans une discussion sur Internet au sujet d&#8217;un
prochain match de rugby, l&#8217;exemple (15) ci-dessus se trouve :
</p>
<p>(19) si leur dix est BON ils nous torchent &#231;a c&#8217;est s&#251;r
</p>
<p>Il faut aussi pr&#233;voir que certaines copr&#233;dications sont heureuses &#8212; (18a et 18b) &#8212; et d&#8217;autres
moins &#8212; (17a) et (17b) avec &quot;et&quot; &#224; la place de Barcelone.
</p>
<p>Pour traiter tous ces ph&#233;nom&#232;nes, nous avons propos&#233; un lexique s&#233;mantique cat&#233;goriel o&#249; chaque
mot se voit associer un &#955;-terme principal, qui ressemble beaucoup &#224; celui de la s&#233;mantique de
Montague rappel&#233;e ci-dessus, ainsi que des &#955;-termes optionnels qui permettent de transformer
un mot dans l&#8217;aspect souhait&#233;, par exemple un num&#233;ro en joueur de rugby. En raison du grand
nombre de types, il convient de factoriser les op&#233;rations sur des termes de types diff&#233;rents et
d&#8217;avoir des op&#233;rations sur des familles de types, et nous nous sommes donc plac&#233;s dans le &#955;-calcul
du second ordre appel&#233; syst&#232;me F&#8212; mais d&#8217;autres th&#233;ories des types comme celle de (Luo, 2012)
seraient &#233;galement possibles. En revanche, notre syst&#232;me se distingue surtout par le caract&#232;re
lexical et non ontologique des transformations lexicales : celles-ci sont d&#233;clench&#233;es par les mots
et non par le type des mots. Cela nous semble pleinement justifi&#233; par des exemples comme
&quot;promotion&quot; et &quot;classe&quot; : les deux d&#233;signent des groupes d&#8217;&#233;l&#232;ves, mais seul &quot;classe&quot;, peut d&#233;signer
un lieu (la salle de classe), tandis que &quot;promotion&quot; ne le peut pas. Les copr&#233;dications possibles
ou impossibles, dans ce syst&#232;me o&#249; les mots portent les transformations, sont mod&#233;lis&#233;es en
distinguant deux sortes de transformations : les transformations rigides, qui imposent de ne
r&#233;f&#233;rer qu&#8217;&#224; cet aspect de l&#8217;objet, et les transformations flexibles qui permettent de renvoyer &#224; un
aspect de l&#8217;objet sans exclure les autres aspects dudit objet.
</p>
<p>Notre cadre formel, le syst&#232;me F se distingue du lambda calcul simplement typ&#233; par l&#8217;ajout d&#8217;une
op&#233;ration de quantification sur les types dans les termes et les types &#8212; cette quantification sur
les types joue un r&#244;le d&#233;terminant ( !) dans notre traitement des d&#233;terminants.
</p>
<p>Les types sont d&#233;finis inductivement &#224; partir de types de base :
&#8211; Types de base :
</p>
<p>&#8211; t les valeurs de v&#233;rit&#233;, v les &#233;v&#233;nements,
&#8211; des types constants ei en grand nombre correspondant aux diff&#233;rentes sortes d&#8217;individus,
&#8211; des variables de type, not&#233;es par des lettres grecques (issues d&#8217;un ensemble d&#233;nombrable P)
</p>
<p>&#8211; Lorsque T est un type et &#945; une variable de type, qui peut ou non appara&#238;tre dans T , &#928;&#945;. T est
un type (dit polymorphe).
</p>
<p>&#8211; Lorsque T1 et T2 sont des types, T1 &#8594; T2 est aussi un type.
Pour d&#233;finir les termes, on se donne une infinit&#233; d&#233;nombrable de variables de chaque type, ainsi
que, pour chaque type, des constantes en nombre fini (possiblement aucune) :
&#8211; Une variable de type T c&#8217;est-&#224;-dire x : T (ce qu&#8217;on &#233;crit aussi xT ) est un terme de type T .
&#8211; Une constante de type T c&#8217;est-&#224;-dire c : T (ce qu&#8217;on &#233;crit aussi cT ) est un terme de type T .
&#8211; ( f &#964;) est un terme de type U quant &#964; est de type T et f de type T &#8594; U .
&#8211; &#955;xT. &#964; est un terme de type T &#8594; U si x est une variable de type T , et &#964; un terme de type U .
&#8211; &#964;{U} est un terme de type T[U/&#945;] quand &#964; : &#928;&#945;. T , et U est un type.
&#8211; &#923;&#945;.&#964; est un terme de type &#928;&#945;.T quand &#945; est une variable de type &#964; : T sans occurrence de &#945;
</p>
<p>dans le type d&#8217;une variable libre.
Lorsque les constantes sont celles d&#8217;une logique multisorte (connecteurs usuels t &#8594; t &#8594; t,
quantificateurs &#8707;,&#8704; : (ei &#8594; t)&#8594; t, . . ., constantes F ido : ani, regarde : ani&#8594; e&#8594; t) ce syst&#232;me
est appel&#233; &#923;Tyn.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>374 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>mot &#955;-terme principal &#955;-termes optionnels rigide/flexible
Liverpool l iverpoolT IdT : T &#8594; T (F)
</p>
<p>t1 : T &#8594; F (R)
t2 : T &#8594; P (F)
t3 : T &#8594; Pl (F)
</p>
<p>vaste vaste : Pl &#8594; t
a_vot e&#769; a_vot e&#769; : P &#8594; t
a_gagne&#769; a_gagne&#769; : F &#8594; t
</p>
<p>o&#249; les types de base sont d&#233;finis comme suit T (ville), Pl (lieu), P (gens), F (club).
</p>
<p>FIGURE 2 &#8211; Un exemple de lexique
</p>
<p>Les r&#233;ductions pour &#955; et &#923; sont d&#233;finies de mani&#232;re similaire.
&#8211; (&#923;&#945;.&#964;){U} se r&#233;duit en &#964;[U/&#945;] (rappelons que &#945; et U sont des types).
&#8211; ((&#955;xU .&#964;T )U&#8594;TuU) : T se r&#233;duit en &#964;[u/x] (r&#233;duction habituelle, u est une terme de m&#234;me
type U que la variable x).
</p>
<p>La normalisation du syst&#232;me F a une cons&#233;quence heureuse pour notre mod&#232;le s&#233;mantique :
si les constantes (du &#955;-calcul) correspondent au langage L multisorte d&#8217;une logique d&#8217;ordre n
(op&#233;rations logiques, pr&#233;dicats, fonctions et constantes), tout terme normal de type t correspond
&#224; une formule de L.
</p>
<p>Donnons l&#8217;organisation g&#233;n&#233;rale de notre mod&#232;le de la s&#233;mantique compositionnelle :
</p>
<p>le &#955;-calcul du second ordre, le syst&#232;me F sert &#224; assembler les formules logiques partielles
contenues dans le lexique (il remplace le &#955;-calcul simplement typ&#233; utilis&#233; par Montague)
</p>
<p>la logique d&#8217;ordre sup&#233;rieur multisorte dans laquelle s&#8217;expriment les repr&#233;sentations s&#233;man-
tiques (elle remplace la logique d&#8217;ordre sup&#233;rieur utilis&#233;e par Montague, ainsi que ses
variantes r&#233;ifi&#233;es du premier ordre : les nombreuses sortes ei sont les types de base qui
g&#232;rent les restrictions de s&#233;lection).
</p>
<p>Afin d&#8217;illustrer l&#8217;utilit&#233; de la quantification sur les types, donnons un exemple avec une copr&#233;dica-
tion qui fait intervenir une conjonction polymorphe, donn&#233;e en (20c). Cette unique conjonction
permet, chaque fois que l&#8217;on a deux pr&#233;dicats P&#945;&#8594;t, Q&#946;&#8594;t portant sur des entit&#233;s de sortes
respectives &#945; et &#946; , ainsi que des transformations f &#958;&#8594;&#945; et g&#958;&#8594;&#946; du type &#958; dans &#945; et dans &#946; de
dire que les images d&#8217;un objet x&#958; de type &#958; ont les propri&#233;t&#233;s P&#945;&#8594;t et Q&#946;&#8594;t.
</p>
<p>(20) a. Liverpool est VASTE et A_VOT&#201;.
b. &amp;&#928;{Pl}{P}(est_vaste)Pl&#8594;t(a_vot e&#769;))P&#8594;t{T}LiverpoolT (t T&#8594;Pl3 )(t T&#8594;P2 )
c. &amp;&#928; = &#923;&#945;&#923;&#946;&#955;P&#945;&#8594;t&#955;Q&#946;&#8594;t&#923;&#958;&#955;x&#958;&#955; f &#958;&#8594;&#945;&#955;g&#958;&#8594;&#946; . (andt&#8594;t&#8594;t (P ( f x))(Q (g x)))
d. (and (est_vastePl &#8594; t (t T&#8594;Pl3 LiverpoolT ))(a_vot e&#769;Pl&#8594;t (t T&#8594;P2 LiverpoolT )))
</p>
<p>Cet exemple s&#8217;analyse au moyen des deux transformations (t T&#8594;Pl3 ) et (t T&#8594;P2 ) celle d&#8217;une ville
T en un lieu Pl et celle d&#8217;une ville en habitants P. Aucune des deux n&#8217;&#233;tant rigide, on peut les
utiliser toutes les deux, et le &#955;-terme s&#233;mantique de la phrase est donn&#233; en (20b). On remarquera
les sp&#233;cialisations de types : &#945; := Pl, &#946; := P et &#958; := T . Apr&#232;s r&#233;duction on obtient comme esp&#233;r&#233;
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>375 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(20d). La m&#234;me situation avec a_vot e&#769; et a_gagne&#769; serait impossible car la transformation d&#8217;une
ville en club est rigide, elle exclut celle de la ville en tant qu&#8217;habitants.
</p>
<p>5 Des termes typ&#233;s pour pr&#233;dicats et d&#233;terminants
</p>
<p>5.1 Pr&#233;dicats et types
</p>
<p>Un d&#233;terminant &#8220;classique&quot; s&#8217;applique &#224; un pr&#233;dicat, voire &#224; deux lorsqu&#8217;il s&#8217;agit d&#8217;un quantifi-
cateur g&#233;n&#233;ralis&#233;, pour donner une proposition. Un op&#233;rateur de Hilbert se combine avec un
pr&#233;dicat pour donner un terme. La mod&#233;lisation du d&#233;terminant, avec ou sans op&#233;rateurs de
Hilbert, est donc intimement li&#233;e &#224; celle du pr&#233;dicat. Dans un syst&#232;me multisorte et typ&#233; comme
&#923;Tyn, il nous faut d&#233;cider quels sont les types des pr&#233;dicats : usuellement, un pr&#233;dicat a pour type
e&#8594; t, mais en pr&#233;sence des innombrables types ei qui se partagent le r&#244;le traditionnellement
d&#233;volu &#224; e , que faire ? Faut-il autoriser des pr&#233;dicats &#224; avoir un domaine autre que e ? Un
pr&#233;dicat comme le nom commun &quot;chat&quot; est il une propri&#233;t&#233; du type des &quot;animaux&quot; s&#8217;il y en a un,
ou est-il une propri&#233;t&#233; de toutes les entit&#233;s, propri&#233;t&#233; qui serait fausse en dehors des &quot;animaux&quot; ?
</p>
<p>Cette question est moins embarrassante qu&#8217;il n&#8217;y para&#238;t car on peut passer d&#8217;un choix &#224; un autre.
En effet, un pr&#233;dicat d&#233;fini sur un type ei diff&#233;rent de e (le type de toutes les entit&#233;s), comme
Pei&#8594;t s&#8217;&#233;tend en un Pe&#8594;t sans difficult&#233;, en disant qu&#8217;il est faux en dehors de &#945;. R&#233;ciproquement,
un pr&#233;dicat comme chat d&#233;fini sur un type d&#8217;entit&#233;s ei (par exemple au type ani des &quot;animaux&quot;)
peut &#234;tre restreint &#224; tout sous type de ei . Evidemment, un pr&#233;dicat comme chat restreint &#224; un
sous ensemble strict de l&#8217;ensemble o&#249; il est vrai (par exemple au type siamois) et ensuite &#233;tendu &#224;
e puis restreint aux animaux (ani) ne redonnera pas le pr&#233;dicat initial, car l&#8217;extension est d&#233;finie
uniform&#233;ment sur tous les types et les pr&#233;dicats comme &#233;tant fausse &#224; l&#8217;ext&#233;rieur du domaine
consid&#233;r&#233;. Ainsi, lorsque &#946; ne contient pas tous les x : &#945; satisfaisant P on a (P&#945;&#8594;t|&#946; )|&#945; &#65535;= P.
Les comportements de la restriction et de l&#8217;extension du domaine d&#8217;un pr&#233;dicat se d&#233;finissent
ais&#233;ment dans un mod&#232;le ensembliste.
</p>
<p>On peut aussi se demander si un type d&#233;finit un pr&#233;dicat. Si ani est le type des animaux, y a-t-il
un pr&#233;dicat &quot;&#234;tre un animal&quot; ? Et si oui, quel est son domaine ? Etant donn&#233; un type &#945; il est
difficile de dire quel type &#946; contenant &#945; est un bon candidat pour le domaine du pr&#233;dicat &#234;tre de
type &#945; : aussi prendrons nous pour pr&#233;dicat associ&#233; au type &#945; le pr&#233;dicat &#65535;&#945; de type e&#8594; t
On voit que le type des pr&#233;dicats, est tr&#232;s li&#233; aux types de base disponibles, qu&#8217;aucun chercheur
du domaine ne pr&#233;tend avoir d&#233;finitivement identifi&#233;s. Voici quelques r&#233;ponse possibles :
</p>
<p>&#8211; Un seul type e pour toutes les entit&#233;s, ce qui exclut toute consid&#233;ration lexicale.
&#8211; &#192; l&#8217;oppos&#233; de la solution minimale que nous venons d&#8217;&#233;voquer, il y a une solution maximale
</p>
<p>selon laquelle toute formule &#224; une variable libre d&#233;finit un type. Il n&#8217;est pas s&#251;r qu&#8217;un tel
syst&#232;me soit bien fond&#233; puisque les formules sont d&#233;finies au moyen des types.
</p>
<p>&#8211; Asher (2011) propose d&#8217;utiliser un petit nombre de type de base qui correspondraient &#224; des
classes ontologiques simples &quot;&#233;v&#233;nement, objet physique, contenu informationnel, humain,...&quot;
correspondant aux restrictions de s&#233;lection que l&#8217;on rencontre dans la langue.
</p>
<p>&#8211; Luo (2012) propose d&#8217;utiliser tous les noms communs.
&#8211; Nous n&#8217;avons pas d&#8217;avis tranch&#233; sur la question, mais nous faisons remarquer &#224; la solution
</p>
<p>pr&#233;c&#233;dente, qu&#8217;il faut sans doute ajouter aux noms communs des types pour les propositions et
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>376 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>pour les verbes d&#8217;action, puisqu&#8217;on quantifie aussi sur ce type d&#8217;objet :
</p>
<p>(21) a. Elle voudrait qu&#8217;il croit en TOUT CE QU&#8217;ELLE LUI DIT.
b. Il a fait TOUT CE QU&#8217;IL A PU et il n&#8217;a m&#234;me pas voulu &#234;tre pay&#233;.
</p>
<p>5.2 Des termes typ&#233;s pour les d&#233;terminants
</p>
<p>Nous proposons que les d&#233;terminants ind&#233;finis soit mod&#233;lis&#233;s par une constante &#949; de type
&#928;&#945;. (&#945;&#8594; t)&#8594; &#945;&#8212; le &#949; de Hilbert adapt&#233; au cadre typ&#233; et multisorte. Nous voyons donc l&#8217;article
ind&#233;fini comme un &#949; polymorphe, qui se sp&#233;cialise au type {ei} pour s&#8217;appliquer &#224; un pr&#233;dicat
P de type ei &#8594; t : il produit un objet du type ei . Consid&#233;rons l&#8217;exemple suivant, tr&#232;s simple et
invent&#233;, afin d&#8217;illustrer notre traitement des d&#233;terminants (ani d&#233;signe le types des animaux) :
</p>
<p>(22) a. Un chat dort (sous ta voiture).
b. terme pour &quot;un&quot; : &#949; : &#928;&#945;. ((&#945;&#8594; t)&#8594; &#945;)
c. syntaxe : ((un&#8594; chat)&#8592; dor t)
d. s&#233;mantique : dor t(un chat)
e. (&#955;x . dor tani&#8594;t(x))(&#949;&#928;&#945;. ((&#945;&#8594;t)&#8594;&#945;)chatani&#8594;t)
f. (&#955;x . dor t(x))(&#949;&#928;&#945;. ((&#945;&#8594;t)&#8594;&#945;){ani}chatani&#8594;t)
g. dor tani&#8594;t(&#949;&#928;&#945;. ((&#945;&#8594;t)&#8594;&#945;){ani}chatani&#8594;t) : t
h. chat(&#949;&#928;&#945;. ((&#945;&#8594;t)&#8594;&#945;){ani}chatani&#8594;t) : t
</p>
<p>La syntaxe fournit un arbre binaire qui indique quel constituant s&#8217;applique &#224; l&#8217;autre (22c). Comme
la s&#233;mantique de &quot;chat&quot; est un pr&#233;dicat qui s&#8217;applique aux entit&#233;s de type &quot;animal&quot;, on obtient
le &#955;-terme s&#233;mantique (22e). Comme le type du &#955;-terme s&#233;mantique associ&#233; &#224; &quot;un&quot; commence
par &#928;&#945; (22b), la variable de type &#945; doit s&#8217;instancier en ani, pour que le terme soit bien typ&#233;. On
le voit en (22f) avec l&#8217;application du terme de &quot;un&quot; au type ani : &#949;&#928;&#945;. ((&#945;&#8594;t)&#8594;&#945;){ani}. Ce terme
de type (ani &#8594; t)&#8594; ani, est appliqu&#233; &#224; chat de type ani &#8594; t, donnant la s&#233;mantique de &quot;un
chat&quot; qui est de type ani. Ce groupe nominal est le sujet du groupe verbal &quot;dort (sous ta voiture)&quot;,
pr&#233;dicat qui s&#8217;applique &#224; une entit&#233; de type &quot;animal&quot;. Le terme complet (22f) est bien typ&#233; de
type t et il se r&#233;duit en (22g) &#8212; ce qui, sous des conditions de non vacuit&#233; tr&#232;s naturelles, peut
se comprendre comme &#8707;x : ani dor t(x).
C&#8217;est plut&#244;t satisfaisant, mais rien ne dit que &quot;un chat&quot; ait la propri&#233;t&#233; d&#8217;&#234;tre un chat ! Le calcul de
la s&#233;mantique de &quot;un chat&quot; ne produit pas cela. Cependant nous savons P(&#949;x .P(x))&#8801; &#8707;x P(x).
Aussi l&#8217;&#233;nonciation de &quot;un&quot; chat dans le sens d&#8217;un chat particulier (et non d&#8217;un chat g&#233;n&#233;rique)
nous conduit-elle &#224; ajouter la pr&#233;supposition chat(un chat) (c&#8217;est-&#224;-dire chat(&#949;x .chat(x))) &#8212;
le &#955;-terme correspondant est donn&#233; en 22h. On notera que un chat &#233;tant de type &quot;animal&quot; le
pr&#233;dicat &quot;chat&quot; peut effectivement s&#8217;y appliquer. Si la pr&#233;supposition F(&#949;x .F(x)) est introduite a
priori sans avoir rencontr&#233; &quot;un F&quot; cela revient &#224; affirmer que la propri&#233;t&#233; F est satisfaite par au
moins un individu. On peut discuter des F pour lesquelles cette pr&#233;supposition est fond&#233;e.
</p>
<p>Si &quot;chat&quot; est un type et non une propri&#233;t&#233;, comme dans Luo (2012), comment faire ? On change
le type &quot;chat&quot; en la propri&#233;t&#233; correspondante&#65535;chat comme expliqu&#233; au paragraphe (5.1), puis on
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>377 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>proc&#232;de comme ci-dessus. 8
</p>
<p>On peut traiter de la m&#234;me mani&#232;re les articles d&#233;finis, comme le fait von Heusinger : seul le
calcul de la r&#233;f&#233;rence sera diff&#233;rent. Tandis que l&#8217;article ind&#233;fini requiert un nouvel &#233;l&#233;ment,
l&#8217;article d&#233;fini choisit au contraire un &#233;l&#233;ment d&#233;j&#224; pr&#233;sent en contexte. L&#8217;approche permet aussi
de traiter l&#8217;interpr&#233;tation des pronoms de type E de Evans. Le fait que les termes g&#233;n&#233;riques
soient typ&#233;s n&#8217;y change rien. Pour interpr&#233;ter les anaphores comme le &quot;il&quot; de l&#8217;exemple (14) il
suffit de recopier le terme s&#233;mantique associ&#233; &#224; l&#8217;ant&#233;c&#233;dent de &quot;il&quot;.
</p>
<p>La quantification universelle, peu &#233;tudi&#233;e dans un cadre typ&#233;, est extraordinairement simple : elle
correspond au terme g&#233;n&#233;rique &#964;x .P(x) (c.f. section 3) bien plus facile &#224; interpr&#233;ter que &#949;x .P(x).
L&#8217;&#233;l&#233;ment &#964;x .P(x) est celui des d&#233;monstrations math&#233;matiques : un objet qui, par rapport &#224; F
n&#8217;a pas de propri&#233;t&#233; particuli&#232;re. Ainsi, lorsque &#964;x . P(x) a la propri&#233;t&#233; P tous les objets l&#8217;ont.
</p>
<p>6 Impl&#233;mentation
</p>
<p>Le traitement que nous proposons des d&#233;terminants et des quantificateurs ne n&#233;cessite pas de
modifier l&#8217;organisation de l&#8217;analyseur syntaxique et s&#233;mantique du fran&#231;ais Grail. L&#8217;extension au
syst&#232;me F requise par la s&#233;mantique lexicale a d&#233;j&#224; &#233;t&#233; test&#233;e, du moins sur les parties du lexique
dot&#233;es d&#8217;un typage avec plusieurs sortes, afin de v&#233;rifier que &#949; s&#8217;instancie convenablement et que
la r&#233;duction produit les formules quantifi&#233;es attendues. La grammaire a &#233;t&#233; acquise sur corpus,
mais &#224; l&#8217;heure actuelle nul ne sait comment acqu&#233;rir automatiquement les lexiques s&#233;mantiques
convenablement typ&#233;s que nous utilisons. (Moot, 2010b,a)
</p>
<p>Du point de vue syntaxique, les d&#233;terminants et quantificateurs ont ici une cat&#233;gorie plus simple
que d&#8217;habitude, et surtout ils n&#8217;en n&#8217;ont qu&#8217;une : gn/n suffit alors qu&#8217;habituellement il en faut
une par position syntaxique. C&#8217;est &#224; rapprocher de nos travaux sur l&#8217;interpr&#233;tation s&#233;mantique de
la grammaire g&#233;n&#233;rative (Amblard et al., 2010)
</p>
<p>L&#8217;impl&#233;mentation de Moot (2010b) utilise la &#955;-DRT plut&#244;t que le &#955;-calcul pour calculer les
repr&#233;sentations s&#233;mantiques, afin de de mieux suivre la structure discursive et aussi de mettre
en oeuvre le lien entre op&#233;rateurs de Hilbert et liage dynamique des variables existentielles en
DRT (von Heusinger, 2004). Techniquement la &#955;-DRT change peu de choses &#224; notre propos mais
aurait n&#233;cessit&#233; beaucoup de rappels.
</p>
<p>7 Conclusion
</p>
<p>Ce travail pose &#224; la fois des questions d&#8217;analyse s&#233;mantique automatique et de logique.
</p>
<p>La port&#233;e des quantificateurs &#224; la Hilbert doit &#234;tre discut&#233;e ainsi que le lien avec le calcul
des pr&#233;dicats dynamiques. Les op&#233;rateurs de Hilbert autorisent des formules sous sp&#233;cifi&#233;es et
incluent un liage dynamique : correspondent-ils &#224; ceux couramment utilis&#233; en s&#233;mantique ?
</p>
<p>8. Une variante : si &quot;chat&quot; est un type et non une propri&#233;t&#233;, on peut aussi utiliser pour &quot;un&quot; le terme &#949;&#65535; : &#928;&#945;. &#945; (une
constante de type &#8869; ne peut nuire &#224; la coh&#233;rence du syst&#232;me). Si on applique cette constante au type &quot;chat&quot; obtient
alors &quot;un chat&quot; de type &quot;chat&quot; sans ajouter de pr&#233;supposition. Comme le fait pertinemment remarquer (Asher, 2011) une
d&#233;claration de type x : T est une forme de pr&#233;supposition, car il est quasi impossible de la nier. On peut appliquer le
pr&#233;dicat &quot;dort&quot; &#224; ce chat, puisque l&#8217;inclusion chat &#8834; ani est une transformation lexicale.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>378 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les pluriels ont aussi un lien avec la quantification, et nous n&#8217;en avons pas parl&#233;, en d&#233;pit d&#8217;un
premier travail de Moot et Retor&#233; (2011) dans ce m&#234;me cadre. Cette question de s&#233;mantique est
assur&#233;ment int&#233;ressante, elle rejoint des id&#233;es anciennes sur les pluriels avec des op&#233;rateurs qui
g&#232;rent les lectures distributives ou collectives.
</p>
<p>D&#233;terminer les types de base est une question importante, surtout en pratique. Peut-&#234;tre n&#8217;y a-t-il
pas de r&#233;ponse en g&#233;n&#233;ral : leur choix d&#233;pend des restrictions de s&#233;lection dont on souhaite
rendre compte, c&#8217;est-&#224;-dire du type d&#8217;informations attendues. Par exemple, pour extraire les
itin&#233;raires d&#8217;un corpus de r&#233;cits de voyages du XIXe, des types d&#8217;entit&#233;s spatiales et temporelles
se d&#233;gagent naturellement. (Lefeuvre et al., 2012)
</p>
<p>Notre travail pose &#233;galement des questions d&#8217;acquisition, d&#8217;une part des types de base, mais aussi
des &#955;-termes s&#233;mantiques, non pour les d&#233;terminants qui sont connus ainsi que leur types et
termes s&#233;mantiques mais pour les autres mots, noms, verbes, adjectifs. Quels sont leurs termes
s&#233;mantiques ? Avec quels types de base sont-ils &#233;crits ? L&#8217;analyseur a besoin de ces informations
pour calculer les repr&#233;sentations s&#233;mantiques assez fines utilis&#233;es ici.
</p>
<p>L&#8217;interpr&#233;tation des formules avec &#949; qui ne sont pas &#233;quivalentes &#224; des formules usuelles reste
myst&#233;rieuse. (Slater, 2005; Avigad et Zach, 2008) &#192; ce jour, seule une interpr&#233;tation tr&#232;s complexe
et possiblement erron&#233;e a &#233;t&#233; propos&#233; par Asser (1957) tandis que von Heusinger (2004) a d&#233;fini
une interpr&#233;tation assez intuitive qui d&#233;pend du contexte discursif, mais qui perd l&#8217;&#233;quivalence
avec la quantification usuelle. Peut-on proposer mieux ?
</p>
<p>Tant pour la compr&#233;hension de la logique sous-jacente que pour l&#8217;organisation du mod&#232;le
d&#8217;analyse s&#233;mantique automatique, nous souhaiterions mieux comprendre l&#8217;interaction entre les
types utilis&#233;s pour la composition des sens et les pr&#233;dicats de la logique multi-sorte o&#249; s&#8217;exprime
le sens.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AMBLARD, M., LECOMTE, A. et RETOR&#201;, C. (2010). Categorial minimalist grammars : From
generative grammar to logical form. Linguistic Analysis, 36(1&#8211;4):273&#8211;306.
ASHER, N. (2011). Lexical Meaning in context &#8211; a web of words. Cambridge University press.
ASSER, G. (1957). Theorie der logischen auswahlfunktionen. Zeitschrift f&#252;r Mathematische Logik
und Grundlagen der Mathematik.
AVIGAD, J. et ZACH, R. (2008). The epsilon calculus. In ZALTA, E. N., &#233;diteur : The Stanford
Encyclopedia of Philosophy. Center for the Study of Language and Information. http://plato.
stanford.edu/.
BASSAC, C., MERY, B. et RETOR&#201;, C. (2010). Towards a Type-Theoretical Account of Lexical
Semantics. Journal of Logic Language and Information, 19(2):229&#8211;245. http://hal.inria.
fr/inria-00408308/.
BOS, J. (2008). Wide-coverage semantic analysis with boxer. In BOS, J. et DELMONTE, R., &#233;diteurs :
Semantics in Text Processing. STEP 2008 Conference Proceedings, Research in Computational
Semantics, pages 277&#8211;286. College Publications.
CORBLIN, F., COMOROVSKI, I., LACA, B. et BEYSSADE, C. (2004). Generalized quantifiers, dynamic
semantics, and french determiners. In CORBLIN, F. et de SWART, H., &#233;diteurs : Handbook of French
Semantic, chapitre 1, pages 3&#8211;22. CSLI Publications.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>379 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EGLI, U. et von HEUSINGER, K. (1995). The epsilon operator and E-type pronouns. In EGLI, U.,
PAUSE, P. E., SCHWARZE, C., von STECHOW, A. et WIENOLD, G., &#233;diteurs : Lexical Knowledge in the
Organization of Language, pages 121&#8211;141. Benjamins.
EVANS, G. (1977). Pronouns, quantifiers, and relative clauses (i). Canadian Journal of Philosophy,
7(3):467&#8211;536.
GEACH, P. T. (1962). Reference and generality : an examination of some medieval and modern
theories. Contemporary philosophy. Cornell University Press.
HILBERT, D. et BERNAYS, P. (1939). Grundlagen der Mathematik. Bd. 2. Springer. Traduction
fran&#231;aise de F. Gaillard, E. Guillaume et M. Guillaume, L&#8217;Harmattan, 2001.
LEFEUVRE, A., MOOT, R., RETOR&#201;, C. et SANDILLON-REZER, N.-F. (2012). Traitement automatique
sur corpus de r&#233;cits de voyages pyr&#233;n&#233;ens : Une analyse syntaxique, s&#233;mantique et temporelle.
In Traitement Automatique du Langage Naturel, TALN&#8217;2012, volume 2, pages 43&#8211;56.
LUO, Z. (2011). Contextual analysis of word meanings in type-theoretical semantics. In
POGODALLA, S. et PROST, J.-P., &#233;diteurs : LACL, volume 6736 de LNCS, pages 159&#8211;174. Springer.
LUO, Z. (2012). Common nouns as types. In B&#201;CHET, D. et DIKOVSKY, A. J., &#233;diteurs : LACL,
volume 7351 de Lecture Notes in Computer Science, pages 173&#8211;185. Springer.
MOOT, R. (2010a). Semi-automated extraction of a wide-coverage type-logical grammar for
French. In Proceedings of Traitement Automatique des Langues Naturelles (TALN), Montreal.
MOOT, R. (2010b). Wide-coverage French syntax and semantics using Grail. In Proceedings of
Traitement Automatique des Langues Naturelles (TALN), Montreal.
MOOT, R., PR&#201;VOT, L. et RETOR&#201;, C. (2011). Un calcul de termes typ&#233;s pour la pragmatique
lexicale &#8212; chemins et voyageurs fictifs dans un corpus de r&#233;cits de voyages. In Traitement
Automatique du Langage Naturel, TALN 2011, pages 161&#8211;166, Montpellier, France.
MOOT, R. et RETOR&#201;, C. (2011). Second order lambda calculus for meaning assembly : on the
logical syntax of plurals. In MUSKENS, R., &#233;diteur : Coconat : Conference on Computing Natural
Reasoning. University of Tilburg. http://hal.inria.fr/hal-00650644.
MOOT, R. et RETOR&#201;, C. (2012). The logic of categorial grammars : a deductive account of natural
language syntax and semantics, volume 6850 de LNCS. Springer. http://www.springer.
com/computer/theoretical+computer+science/book/978-3-642-31554-1.
REAL-COELHO, L.-M. et RETOR&#201;, C. (2013). A generative montagovian lexicon for polysemous
deverbal nouns. In 4th World Congress and School on Universal Logic &#8211; Workshop on Logic and
linguistics., Rio de Janeiro.
RETOR&#201;, C. (2012). Variable types for meaning assembly : a logical syntax for generic noun
phrases introduced by &quot;most&quot;. Recherches Linguistiques de Vincennes, 41:83&#8211;102. http://hal.
archives-ouvertes.fr/hal-00677312.
RUSSELL, B. (1905). On denoting. Mind, 56(14):479&#8211;493.
SLATER, B. H. (2005). Epsilon calculi. The Internet Encyclopedia of Philosophy. http://www.
iep.utm.edu.
STEEDMAN, M. (2012). Taking Scope : The Natural Semantics of Quantifiers. MIT Press.
von HEUSINGER, K. (1997). Definite descriptions and choice functions. In AKAMA, S., &#233;diteur :
Logic, Language and Computation, pages 61&#8211;91. Kluwer.
von HEUSINGER, K. (2004). Choice functions and the anaphoric semantics of definite nps.
Research on Language and Computation, 2:309&#8211;329.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>380 c&#65535; ATALA</p>

</div></div>
</body></html>