<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Similarit&#233;s induites par mesure de comparabilit&#233; : signification et utilit&#233; pour le clustering et l&#8217;alignement de textes comparables</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Similarit&#233;s induites par mesure de comparabilit&#233; :
signification et utilit&#233; pour le clustering et l&#8217;alignement de
</p>
<p>textes comparables
</p>
<p>Pierre-Francois Marteau1, 2 Gildas M&#233;nier1, 2
(1) IRISA, UMR 6074
</p>
<p>(2) Universit&#233; de Bretagne Sud, 56000 Vannes
</p>
<p>R&#201;SUM&#201;
En pr&#233;sence de corpus comparables bilingues, nous sommes confront&#233;s &#224; des donn&#233;es qu&#8217;il est
naturel de plonger dans deux espaces de repr&#233;sentation linguistique distincts, chacun &#233;ventuelle-
ment muni d&#8217;une mesure quantifiable de similarit&#233; (ou d&#8217;une distance). D&#232;s lors que ces donn&#233;es
bilingues sont comparables au sens d&#8217;une mesure de comparabilit&#233; &#233;galement calculable (Li et
Gaussier, 2010), nous pouvons &#233;tablir une connexion entre ces deux espaces de repr&#233;sentation
linguistique en exploitant une carte d&#8217;association pond&#233;r&#233;e (&quot;mapping&quot;) appr&#233;hend&#233;e sous
la forme d&#8217;un graphe bi-directionnel dit de comparabilit&#233;. Nous abordons dans cet article
les cons&#233;quences conceptuelles et pratique d&#8217;une telle connexion similarit&#233;-comparabilit&#233; en
d&#233;veloppant un algorithme (Hit-ComSim) bas&#233; sur sur le principe de similarit&#233; induite par la
topologie du graphe de comparabilit&#233;. Nous essayons de qualifier qualitativement l&#8217;int&#233;r&#234;t de
cet algorithme en consid&#233;rant quelques exp&#233;riences pr&#233;liminaires de clustering de documents
comparables bilingues (Fran&#231;ais/Anglais) collect&#233;s sur des flux RSS.
</p>
<p>ABSTRACT
Similarities induced by a comparability mapping : meaning and utility in the context of
the clustering of comparable texts.
</p>
<p>In the presence of bilingual comparable corpora it is natural to embed the data in two distinct
linguistic representation spaces in which a &quot;computational&quot; notion of similarity is potentially
defined. As far as these bilingual data are comparable in the sense of a measure of comparability
also computable (Li et Gaussier, 2010), we can establish a connection between these two areas
of linguistic representation by exploiting a weighted mapping that can be represented in the
form of a weighted bidirectional graph of comparability. We study in this paper the conceptual
and practical consequences of such a similarity-comparability connection, while developing an
algorithm (Hit-ComSim) based on the concept of similarities induced by the topology of the graph
of comparability. We try to evaluate the benefit of this algorithm considering some preliminary ca-
tegorization or clustering tasks of bilingual (English/French) documents collected from RSS feeds.
</p>
<p>MOTS-CL&#201;S : Graphe de comparabilit&#233;, Similarit&#233;s induites, Documents comparables, Clustering.
KEYWORDS: Comparability graph, Induced similarities, Comparable documents, Clustering.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>515 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>La construction de corpus bilingues comparables (D&#233;jean et Gaussier, 2002), notamment sp&#233;-
cialis&#233;s ou th&#233;matiques, fait l&#8217;objet de travaux de recherche relativement intensifs depuis plus
d&#8217;une dizaine d&#8217;ann&#233;es dans le but de pallier en partie la p&#233;nurie de corpus parall&#232;les, co&#251;teux
&#224; d&#233;velopper et &#224; maintenir. Les applications sont multiples mais concernent principalement
l&#8217;aide &#224; la traduction, l&#8217;extraction de terminologie, la recherche d&#8217;information multilingue. Un
corpus comparable est constitu&#233; de textes &quot;similaires&quot; exprim&#233;s dans au moins deux langues
distinctes (EAGLES, 1996). Bien qu&#8217;il n&#8217;existe pas de d&#233;finition claire et partag&#233;e de la notion de
comparabilit&#233;, une mesure (quantifiable) de comparabilit&#233; a &#233;t&#233; propos&#233;e par (Li et Gaussier,
2010). Cette mesure d&#233;pendante d&#8217;un lexique bilingue de traduction, &#233;value la comparabilit&#233;
entre deux documents de langues diff&#233;rentes en fonction du prorata de termes du premier
document poss&#233;dant au moins une traduction dans le deuxi&#232;me document et vice-versa. Cette
notion quantifi&#233;e de comparabilit&#233; permet de construire une relation pond&#233;r&#233;e entre deux corpus
de langues distinctes que nous proposons d&#8217;&#233;tudier ici dans le contexte du clustering de textes
comparables. L&#8217;un des enjeux est de pr&#233;parer l&#8217;alignement des clusters comparables afin de
faciliter la production de sous-corpus th&#233;matiques comparables (Li et al., 2011).
</p>
<p>2 Motivation
</p>
<p>FIGURE 1 &#8211; Couplage de deux espaces de similarit&#233; par graphe de comparabilit&#233;
</p>
<p>La figure 1 pr&#233;sente deux ensembles de documents EN (anglais) et FR (fran&#231;ais) munis res-
pectivement des fonctions de similarit&#233; Sen(., .) et Sf r(., .) et mis en relation par un graphe de
comparabilit&#233; d&#233;fini par la fonction de comparabilit&#233; C(., .). Les arcs de ce graphe sont bidirec-
tionnels et pond&#233;r&#233;s par une valeur de comparabilit&#233; comprise dans l&#8217;intervalle [0,1]. L&#8217;id&#233;e
principale que nous d&#233;veloppons dans cet article est celle du renforcement de la similarit&#233;
par la comparabilit&#233; : autrement dit, si deux documents du corpus EN sont comparables &#224; un
sous-ensemble de documents du corpus FR fortement similaires, alors leur similarit&#233; devrait &#234;tre
renforc&#233;e (et r&#233;ciproquement). A contrario, si deux documents du corpus EN sont comparables &#224;
un sous-ensemble de documents du corpus FR faiblement similaires, alors leur similarit&#233; devrait
d&#233;cro&#238;tre (et r&#233;ciproquement). Ainsi, sur la figure 1, du point de vue de la similarit&#233; appr&#233;hend&#233;e
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>516 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>sous l&#8217;angle de la comparabilit&#233;, le document EN3 devrait s&#8217;&#233;loigner du document EN2 pour
se rapprocher des documents EN4 et EN5. De m&#234;me, le document FR6 devrait s&#8217;&#233;loigner des
documents FR5,FR4 et FR3. L&#8217;utilit&#233; escompt&#233;e d&#8217;un tel renforcement/affaiblissement est une
forme de filtrage du bruit inh&#233;rent aux mod&#232;les de repr&#233;sentation des documents caract&#233;ris&#233;s
par un manque de connaissance (linguistique ou terminologique entre autres).
</p>
<p>3 Mod&#233;lisation : l&#8217;algorithme Hit-ComSim
</p>
<p>Le mod&#232;le bi-espace (ici bilingue EN et FR) d&#8217;induction de la similarit&#233; par la comparabilit&#233; propos&#233;
repose sur un algorithme it&#233;ratif d&#233;crit par les deux &#233;quations suivantes :
</p>
<p>Sten(k, l) = &#963;(k, l) &#183;
|FR|&#65535;
i=1
</p>
<p>|FR|&#65535;
j=1
</p>
<p>C(k, i)C(k, j)St&#8722;1f r (i, j)C(l, i)C(l, j)
</p>
<p>Stf r(i, j) = &#963;(i, j) &#183;
|EN |&#65535;
k=1
</p>
<p>|EN |&#65535;
l=1
</p>
<p>C(k, i)C(l, i)St&#8722;1en (k, l)C(k, j)C(l, j)
(1)
</p>
<p>&#8211; C(k, i) est la comparabilit&#233; entre le ki&#232;me objet du corpus EN et le ii&#232;me objet du corpus FR
&#8211; Sten(k, l) est la similarit&#233; entre les ki&#232;me et l i&#232;me objets du corpus EN &#224; l&#8217;it&#233;ration t
&#8211; Stf r(i, j) est la similarit&#233; entre les ii&#232;me et ji&#232;me objets du corpus FR &#224; l&#8217;it&#233;ration t
&#8211; &#963;(., .) est une fonction de normalisation d&#233;finie comme suit :
</p>
<p>&#963;(k, l) =
&#65535;
(
&#65535;
&#957;en(k).&#957;en(l)
</p>
<p>&#65535;&#8722;1
, &#963;(i, j) =
</p>
<p>&#65535;
(
&#65535;
&#957; f r(i).&#957; f r( j)
</p>
<p>&#65535;&#8722;1
&#957;en(k) =
</p>
<p>&#65535;
i, j(C(k, i) &#183; C(k, j))2 &#183; St&#8722;1f r (i, j), &#957; f r(i) =
</p>
<p>&#65535;
k,l(C(k, i) &#183; C(l, i))2 &#183; St&#8722;1en (k, l)
</p>
<p>L&#8217;initialisation de l&#8217;&#233;quation (3) pour t = 0 est effectu&#233;e par exemple &#224; partir des matrices de
similarit&#233;s initiales S0en et S
</p>
<p>0
f r calcul&#233;es dans les ensembles EN et FR respectivement.
</p>
<p>3.1 Convergence
</p>
<p>La preuve de convergence (sous conditions en pratique satisfaisables) de l&#8217;algorithme pr&#233;sente
peu d&#8217;int&#233;r&#234;t et nous ne la d&#233;taillerons pas. Celle-ci est une cons&#233;quence du th&#233;or&#232;me de Perron-
Frobenius (Perron, 1907) (Frobenius, 1912). Il en d&#233;coule l&#8217;existence d&#8217;un point fixe unique pour
cet algorithme ainsi qu&#8217;une vitesse de convergence exponentielle, particuli&#232;rement utile compte
tenu de la complexit&#233; de l&#8217;algorithme (cf. paragraphe 3.3). Enfin, la convergence de l&#8217;algorithme
est ind&#233;pendante des conditions initiales (i.e. des matrices de similarit&#233;s initiales).
</p>
<p>3.2 Interpr&#233;tation
</p>
<p>Le graphe de comparabilit&#233; est repr&#233;sent&#233; par la matrice de comparabilit&#233; C dont l&#8217;&#233;l&#233;ment C(k, i)
repr&#233;sente la comparabilit&#233; entre le ki&#232;me document du corpus EN (anglais) et le ii&#232;me document du
corpus FR (fran&#231;ais). Cette matrice d&#233;finit un graphe dont les n&#339;uds repr&#233;sentent les documents
et dont les arcs bidirectionnels sont pond&#233;r&#233;s par les &#233;l&#233;ments C(k, i). A t = 0 les matrices de
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>517 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>similarit&#233;s Sten et S
t
f r sont initialis&#233;es (conform&#233;ment aux mesures de similarit&#233;s propres aux
</p>
<p>espaces de repr&#233;sentation dans lesquels sont plong&#233;s les documents, si celles-ci existent, &#224; d&#233;faut
toute matrice positive sym&#233;trique de dimension ad&#233;quate convient). La notion de sous-ensemble
de documents comparables communs (intersection) est appr&#233;hend&#233;e de mani&#232;re &quot;floue&quot; par le
biais des produits C(k, i).C(l, i). Ainsi, pour t &gt; 0, Sten (resp. S
</p>
<p>t
f r) est mise &#224; jour &#224; partir de S
</p>
<p>t&#8722;1
f r
</p>
<p>(resp. St&#8722;1en ). La convergence et l&#8217;existence d&#8217;un point fixe unique ind&#233;pendant des conditions
initiales donne une valeur particuli&#232;re aux limites limt&#8594;+&#8734; Sten et limt&#8594;+&#8734; Stf r qui ne d&#233;pendent
que du graphe de comparabilit&#233; caract&#233;ris&#233; par la matrice C . On peut ainsi qualifier ces limites
de similarit&#233;s induites par une mesure de comparabilit&#233;.
</p>
<p>3.3 Complexit&#233; et simplification algorithmique
</p>
<p>L&#8217;algorithme exploit&#233; directement dans la formulation propos&#233;e par l&#8217;&#233;quation (3) est en com-
plexit&#233; O(|EN |2 &#183; |FR|2) ce qui limite son exploitabilit&#233; aux petits corpus. Une simplification
imm&#233;diate consiste &#224; diminuer la complexit&#233; du graphe de comparabilit&#233; en limitant le nombre
de connexions issues d&#8217;un document dans une langue donn&#233;e en ne consid&#233;rant que le sous
ensemble de documents qui lui sont les plus comparables dans le corpus de l&#8217;autre langue. La
cardinalit&#233; des sous-ensembles de documents les plus comparables devient ainsi un param&#232;tre
de l&#8217;algorithme. Un deuxi&#232;me param&#232;tre r&#233;gulant la connectivit&#233; du graphe est un seuil de
comparabilit&#233; permettant d&#8217;&#233;laguer les arcs du graphe associ&#233;s &#224; une comparabilit&#233; en dessous
de ce seuil.
</p>
<p>Sten(k, l) = &#963;(k, l) &#183;
&#65535;
</p>
<p>i, j&#8712;NPCf r (k)&#8745;NPCf r (l)
C(k, i)C(k, j)St&#8722;1f r (i, j)C(l, i)C(l, j)
</p>
<p>Stf r(i, j) = &#963;(i, j) &#183;
&#65535;
</p>
<p>k,l&#8712;NPCen(i)&#8745;NPCen( j)
C(k, i)C(l, i)St&#8722;1en (k, l)C(k, j)C(l, j)
</p>
<p>(2)
</p>
<p>o&#249; NPCf r(k) (resp. NPCen(i)) est l&#8217;ensemble des indices des documents du corpus FR (resp. EN)
les plus comparables au document k (resp. i)du corpus EN (resp. FR). Les coefficients de norma-
lisation &#957; f r et &#957; f r sont ajust&#233;s en cons&#233;quence. En pratique, on peut limiter le nombre maximum
de documents les plus comparables &#224; une constante Npc . L&#8217;algorithme simplifi&#233; caract&#233;ris&#233; par
l&#8217;&#233;quation (2) est en complexit&#233; inf&#233;rieure &#224; O(max(|EN |, |FR|)2 &#183; N2pc). Cette simplification
n&#8217;affecte que la complexit&#233; du graphe de comparabilit&#233; et n&#8217;a donc aucune incidence sur la
convergence de l&#8217;algorithme, mais peut en avoir sur sa vitesse de convergence.
</p>
<p>4 Exp&#233;rimentations
</p>
<p>Nos exp&#233;rimentations (mis &#224; part le cas d&#8217;&#233;cole) portent sur des documents en langues anglaise
et fran&#231;aise collect&#233;s sur le web &#224; partir de flux RSS mis &#224; disposition par des quotidiens ou des
cha&#238;nes de t&#233;l&#233;vision. Nous avons exploit&#233; 12 sources pour le corpus EN pour un total de 1702
documents en langue anglaise et 11 sources pour le corpus FR, pour un total de 2466 documents
en langue fran&#231;aise.
</p>
<p>Les documents collect&#233;s sont constitu&#233;s en principe des champs titre, description (r&#233;sum&#233;), date
et texte, ce dernier correspondant &#224; la source cit&#233;e par l&#8217;item RSS collect&#233;. Les champs textuels
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>518 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>sont ensuite &quot;stemm&#233;s&quot;, filtr&#233;s par l&#8217;utilisation d&#8217;une stoplist pour produire pour chaque document
collect&#233; un mod&#232;le de type sac-de-mots exploitant l&#8217;heuristique tf-idf (Sp&#228;rck Jones, 1972) (bien
entendu d&#8217;autres heuristiques de pond&#233;rations des mots r&#233;put&#233;es plus robustes sont possibles, par
exemple l&#8217;heuristique BM25 (Robertson et Sp&#228;rck Jones, 1976)). La similarit&#233; cosinus est utilis&#233;e
dans les espaces EN et FR et le graphe de comparabilit&#233; est construit en exploitant la mesure de
comparabilit&#233; d&#233;finie par (Li et Gaussier, 2010) ainsi que le dictionnaire ELRA contenant 238742
couples de termes fran&#231;ais/anglais. La comparabilit&#233; des corpus est faible puisque la mesure ne
d&#233;passe pas .35 pour toute paire de documents EN/FR. Nous avons utilis&#233; un seuil d&#8217;&#233;lagage fix&#233;
&#224; .2 en dessous duquel les liens de comparabilit&#233; sont consid&#233;r&#233;s comme non existants.
</p>
<p>La mesure de comparabilit&#233; exploit&#233;e fait intervenir un comptage du nombre des entr&#233;es lexicales
passerelles permettant de coupler deux documents de langues distinctes via un lexique de traduc-
tion. Notons den un document en langue anglaise et df r un document en langue fran&#231;aise. La
mesure de similarit&#233; d&#233;finie par (Li et Gaussier, 2010) se pr&#233;sente formellement sous la forme :
</p>
<p>CmpLG(den, df r) =
</p>
<p>&#65535;
w1&#8712;Wden&#8745;WDen
</p>
<p>&#963;(w1) +
&#65535;
</p>
<p>w2&#8712;Wdf r&#8745;WDf r
&#963;(w2)
</p>
<p>|Wden &#8745;WDen|+ |Wdf r &#8745;WDf r | (3)
</p>
<p>o&#249; :Wdi , i &#8712; {en, f r} est le vocabulaire en langue&#65535;i associ&#233; au document di ;WDi est l&#8217;ensemble
des entr&#233;es en langue &#65535;i du dictionnaire bilingue utilis&#233; pr&#233;sentes dans Wdi ; &#963;(wi) est une
fonction indicatrice qui prend la valeur 1 si au moins une traduction de l&#8217;entr&#233;e lexicale wi &#8712;Wdi
en langue &#65535;i existe dans le vocabulaire associ&#233; au corpus de l&#8217;autre langue, 0 sinon.
</p>
<p>4.1 Cas d&#8217;&#233;cole construit &#224; la main
</p>
<p>Nous reprenons ici l&#8217;exemple propos&#233; en Figure 1 avec les donn&#233;es initiales (C(k, i), S0en,S
0
f r) et
</p>
<p>finales obtenues &#224; l&#8217;issue de 4 it&#233;rations de l&#8217;algorithme d&#233;crit par l&#8217;&#233;quation (3) (S4en, S
4
f r) :
</p>
<p>C =
</p>
<p>&#63723;&#63724;&#63724;&#63724;&#63724;&#63724;&#63725;
1 1 0 0 0 0
1 1 0 0 0 0
0 0 1 1 1 1
0 0 1 1 1 0
0 0 0 1 1 1
</p>
<p>&#63734;&#63735;&#63735;&#63735;&#63735;&#63735;&#63736; ,S0en =
&#63723;&#63724;&#63724;&#63724;&#63724;&#63724;&#63725;
1. .8 .6 .2 0.
.8 1. .8 .4 .2
.6 .8 1. .6 .4
.2 .4 .6 1. .8
0. .2 .4 .8 1.
</p>
<p>&#63734;&#63735;&#63735;&#63735;&#63735;&#63735;&#63736; ,S4en =
&#63723;&#63724;&#63724;&#63724;&#63724;&#63724;&#63725;
1. 1. 0. 0. .0
1. 1. 0. 0. .0
0. 0. 1. .8 .6
0. 0. .8 1. .8
0. 0. .6 .8 1.
</p>
<p>&#63734;&#63735;&#63735;&#63735;&#63735;&#63735;&#63736; ,
</p>
<p>S0f r =
</p>
<p>&#63723;&#63724;&#63724;&#63724;&#63724;&#63724;&#63724;&#63725;
1. .8 .3 .3 .2 0.
.8 1. .5 .5 .3 .2
.3 .5 1. .8 .8 .7
.3 .5 .8 1. .8 .8
.2 .3 .8 .8 1. .8
0. .2 .7 .8 .8 1.
</p>
<p>&#63734;&#63735;&#63735;&#63735;&#63735;&#63735;&#63735;&#63736;S4f r =
&#63723;&#63724;&#63724;&#63724;&#63724;&#63724;&#63724;&#63725;
1. 1. 0. 0. 0. 0.
1. 1. 0. 0. 0. 0.
0. 0. 1. .8 .9 .6
0. 0. .8 1. 1. .5
0. 0. .9 1. 1. .5
0. 0. .6 .5 .5 1.
</p>
<p>&#63734;&#63735;&#63735;&#63735;&#63735;&#63735;&#63735;&#63736;
Les attentes initiales synth&#233;tis&#233;es en Figure 1 sont a priori bien satisfaites &#224; l&#8217;issue des 4 premi&#232;res
it&#233;rations de l&#8217;algorithme, puisque le document FR6 de l&#8217;ensemble FR s&#8217;&#233;loigne en terme de
similarit&#233; des documents FR3, FR4 et FR5. De m&#234;me, le document EN3 de l&#8217;ensemble EN s&#8217;&#233;loigne
des documents EN1 et EN2 pour rejoindre le cluster constitu&#233; des documents EN4 et EN5.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>519 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4.2 Exp&#233;rimentations sur un petit corpus de 4 classes
</p>
<p>Classe EN FR code
Mali 10 10 o
Syria/Syrie 9 9 &#65535;
gay 7 11 &#65535;
Beckham 4 3 &#65535;
</p>
<p>TABLE 1 &#8211; Petits Corpus EN (30 documents) et FR (33 documents) cat&#233;gorisables en quatre classes
</p>
<p>0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9
&#8722;0.4
</p>
<p>&#8722;0.2
</p>
<p>0
</p>
<p>0.2
</p>
<p>0.4
</p>
<p>0.6
</p>
<p>0.8
</p>
<p>1
</p>
<p>1.2
ACP Sen0
</p>
<p>&#8722;0.5 0 0.5 1 1.5 2 2.5 3 3.5
&#8722;1.5
</p>
<p>&#8722;1
</p>
<p>&#8722;0.5
</p>
<p>0
</p>
<p>0.5
</p>
<p>1
</p>
<p>1.5
ACP Sen4
</p>
<p>0 0.1 0.2 0.3 0.4 0.5 0.6 0.7
&#8722;0.8
</p>
<p>&#8722;0.6
</p>
<p>&#8722;0.4
</p>
<p>&#8722;0.2
</p>
<p>0
</p>
<p>0.2
</p>
<p>0.4
</p>
<p>0.6
ACP Sfr0
</p>
<p>&#8722;3.5 &#8722;3 &#8722;2.5 &#8722;2 &#8722;1.5 &#8722;1 &#8722;0.5 0 0.5
&#8722;1
</p>
<p>&#8722;0.5
</p>
<p>0
</p>
<p>0.5
</p>
<p>1
</p>
<p>1.5
ACP Sfr4
</p>
<p>FIGURE 2 &#8211; ACP des matrices de similarit&#233;s S0en, S
4
en (haut) et S
</p>
<p>0
f r , S
</p>
<p>4
f r (bas) sur le petit corpus
</p>
<p>Cette exp&#233;rimentation sur un nombre r&#233;duit de donn&#233;es a pour but d&#8217;illustrer le comportement
de l&#8217;algorithme et ses potentialit&#233;s, notamment sur des t&#226;ches de clustering et/ou d&#8217;alignement de
clusters. Les corpus EN et FR sont constitu&#233;s de documents extraits de flux RSS et sont cat&#233;goris&#233;s
en quatre classes comme indiqu&#233; en table 1. Chaque classe est associ&#233;e &#224; un mot cl&#233; unique
(Mali, Syrie/Syria, gay, Beckham) et chaque document poss&#233;dant au moins une occurrence de
mot cl&#233; correspondant &#224; une classe est rattach&#233; &#224; cette classe. Un post-traitement a permis de
v&#233;rifier que chaque document retenu du corpus n&#8217;appartient qu&#8217;&#224; une seule classe. A partir des
matrices de similarit&#233; initiales S0en et S
</p>
<p>0
f r , quatre it&#233;rations de l&#8217;algorithme d&#233;crit par l&#8217;&#233;quation
</p>
<p>(3) sont appliqu&#233;es pour obtenir les matrices de similarit&#233;s consolid&#233;es par la comparabilit&#233; S4en
et S4f r . Une analyse en composantes principales (ACP) pour chacune des quatre matrices est
ensuite propos&#233;e pour visualiser les projections des documents sur les deux axes principaux.
Un code de couleur est propos&#233; pour quantifier la comparabilit&#233; moyenne des documents :
rouge/forte, bleu/faible. Les r&#233;sultats obtenus sont pr&#233;sent&#233;s en figure 2. L&#8217;effet sur le clustering
est un &#233;loignement des documents faiblement comparables et un rapprochement des documents
comparables, tout en maintenant une proximit&#233; th&#233;matique. La comparabilit&#233; (articles de guerre)
des clusters Mali et Syria/Syrie ressort dans les ACP des matrices produites par Hit-ComSim.
Les axes principaux produits sur ces matrices semblent plus &#8217;stables&#8217; que ceux produits sur les
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>520 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>matrices initiales, caract&#233;ristique qui, si cela est reproductible, pourrait s&#8217;av&#233;rer utile pour aligner
des clusters ou des documents et isoler les donn&#233;es peu comparables.
</p>
<p>4.3 Exp&#233;rimentations sur un corpus plus large
</p>
<p>1 2 3 4
10&#8722;8
</p>
<p>10&#8722;6
</p>
<p>10&#8722;4
</p>
<p>10&#8722;2
</p>
<p>100
</p>
<p>102
</p>
<p>104
</p>
<p>106
</p>
<p># iteration t
</p>
<p>||S
t &#8722;
</p>
<p>St
&#8722;
</p>
<p>1 ||
</p>
<p>0 0.5 1 1.5 2 2.5 3 3.5 4 4.5
&#8722;5
</p>
<p>&#8722;4
</p>
<p>&#8722;3
</p>
<p>&#8722;2
</p>
<p>&#8722;1
</p>
<p>0
</p>
<p>1
</p>
<p>2
ACP Sen0
</p>
<p>0 5 10 15 20 25 30 35
&#8722;15
</p>
<p>&#8722;10
</p>
<p>&#8722;5
</p>
<p>0
</p>
<p>5
</p>
<p>10
ACP Sen4
</p>
<p>0 1 2 3 4 5 6 7 8
&#8722;8
</p>
<p>&#8722;7
</p>
<p>&#8722;6
</p>
<p>&#8722;5
</p>
<p>&#8722;4
</p>
<p>&#8722;3
</p>
<p>&#8722;2
</p>
<p>&#8722;1
</p>
<p>0
</p>
<p>1
</p>
<p>2
ACP Sfr0
</p>
<p>0 5 10 15 20 25 30 35 40 45
&#8722;10
</p>
<p>&#8722;5
</p>
<p>0
</p>
<p>5
</p>
<p>10
</p>
<p>15
ACP Sfr4
</p>
<p>FIGURE 3 &#8211; Vitesse de convergence de l&#8217;algorithme (en haut &#224; gauche) en &#233;chelle semi-log (en
abscisse le nombre d&#8217;it&#233;rations et en ordonn&#233;e la norme des diff&#233;rences ||Sten &#8722; St&#8722;1en || en bleu
continu et ||Stf r &#8722; St&#8722;1f r || en noir pointill&#233;), et ACP pour le corpus plus large des matrices de
similarit&#233;s S0en, S
</p>
<p>4
en (en haut) et S
</p>
<p>0
f r , S
</p>
<p>4
f r (en bas).
</p>
<p>Cette exp&#233;rience concerne l&#8217;ensemble des corpus EN (1702 documents) et FR (2466 documents)
collect&#233;s. L&#8217;algorithme dans sa version simplifi&#233;e d&#233;finie par l&#8217;&#233;quation (2) a &#233;t&#233; exploit&#233; sur
4 it&#233;rations avec une taille de voisinage de 32 (seuls les 32 plus proches voisins d&#233;finissent la
connectivit&#233; du graphe de comparabilit&#233;). La vitesse de convergence (exponentielle) de l&#8217;algo-
rithme simplifi&#233; est pr&#233;sent&#233;e en figure 3 en haut &#224; gauche sur une &#233;chelle semi-logarithmique.
Les ACP effectu&#233;es sur les 4 matrices de similarit&#233; S0en, S
</p>
<p>4
en, S
</p>
<p>0
f r et S
</p>
<p>4
f r sont &#233;galement pr&#233;sent&#233;es
</p>
<p>en figure 3 en utilisant un code de couleur pour repr&#233;senter la comparabilit&#233; moyenne associ&#233;e &#224;
chaque document projet&#233; sur les deux axes principaux (rouge/forte comparabilit&#233;, bleu/faible
comparabilit&#233;). Cette mesure de comparabilit&#233; moyenne a du sens lorsque l&#8217;on envisage construire
des corpus comparables. L&#8217;effet d&#8217;Hit-ComSim est ici encore une distribution des documents en
fonction de leur comparabilit&#233; moyenne. Ainsi, les clusters isol&#233;s &#224; comparabilit&#233; moyenne faible
sont regroup&#233;s (autour de (0,0)) et s&#233;par&#233;s des documents &#224; plus forte comparabilit&#233; moyenne
distribu&#233;s sur un arc de cercle centr&#233; en (0,0). Pour les matrices de similarit&#233; initiales, l&#8217;axe
principal des ACP sont fortement corr&#233;l&#233;s &#224; la comparabilit&#233; moyenne, mais des clusters &#224; faible
comparabilit&#233; moyenne sont isol&#233;s et justifient du 2&#232;me axe principal.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>521 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 Conclusion et perspectives
</p>
<p>Nous avons propos&#233; un algorithme (Hit-ComSim) pour &#233;tudier le couplage simila-
rit&#233;/comparabilit&#233;, la comparabilit&#233; &#233;tant consid&#233;r&#233;e sous la forme d&#8217;un graphe pond&#233;r&#233; liant
deux espaces de repr&#233;sentation d&#8217;objets distincts. Cet algorithme permet d&#8217;aboutir &#224; la notion
de similarit&#233;s induites par mesure de comparabilit&#233; qui peuvent &#234;tre ais&#233;ment fusionn&#233;es aux
similarit&#233;s natives des espaces li&#233;s par comparabilit&#233; si celles-ci existent. La complexit&#233; &#233;lev&#233;e
(O(N4)) de l&#8217;algorithme peut &#234;tre significativement simplifi&#233; en r&#233;duisant la connectivit&#233; du
graphe de comparabilit&#233;. Par ailleurs, il est tr&#232;s possible que les matrices de similarit&#233; (les
limites) produites par l&#8217;algorithme puissent &#234;tre approch&#233;es de mani&#232;re directe et calculatoire en
O(N2). Au del&#224; d&#8217;une curiosit&#233; algorithmique, les premi&#232;res exp&#233;riences relatives au clustering
de donn&#233;es bilingues comparables montrent des potentialit&#233;s utiles pour aligner des groupes de
documents comparables et th&#233;matiquement coh&#233;rents. La confirmation de ces r&#233;sultats pr&#233;limi-
naires reste &#224; &#233;tablir par le biais d&#8217;exp&#233;rimentations plus pouss&#233;es et quantifi&#233;es, notamment
pour mieux &#233;tudier l&#8217;impact des param&#232;tres de l&#8217;algorithme, en particulier ceux qui d&#233;terminent
la connectivit&#233; du graphe de comparabilit&#233;. L&#8217;enrichissement des mesures de comparabilit&#233; en
tenant compte des fr&#233;quences d&#8217;occurrence et de traduction ou encore des relations s&#233;mantiques
(synonymie, hyponymie et hyperonymie) induites (c.f. (Apidianaki et He, 2010) par exemple)
est naturellement possible. D&#8217;autres t&#226;ches comme la bi-classification de documents bilingues
sont &#233;galement envisag&#233;s. Enfin, une approche compl&#233;mentaire relative au renforcement de la
comparabilit&#233; par les similarit&#233;s peut &#234;tre consid&#233;r&#233;e.
</p>
<p>R&#233;f&#233;rences
</p>
<p>APIDIANAKI, M. et HE, Y. (2010). An algorithm for cross-lingual sense clustering tested in a
mt evaluation setting. In Proceedings of the 7th International Workshop on Spoken Language
Translation (IWSLT 2010), pages 219&#8211;226.
</p>
<p>D&#201;JEAN, H. et GAUSSIER, E. (2002). Une nouvelle approche a l&#8217;extraction de lexiques bilingues &#224;
partir de corpus comparables. Lexicometrica, Num&#233;ro sp&#233;cial, corpus align&#233;s:1&#8211;22.
</p>
<p>EAGLES (1996). Expert advisory group on language engineering standards guidelines :
http ://www.ilc.pi.cnr.it/eagles96/browse.html. Rapport technique.
FROBENIUS, G. (1912). &#220;ber Matrizen aus nicht negativen Elementen. Reimer.
</p>
<p>LI, B. et GAUSSIER, E. (2010). Improving corpus comparability for bilingual lexicon extraction
from comparable corpora. In COLING, pages 644&#8211;652.
</p>
<p>LI, B., GAUSSIER, E. et AIZAWA, A. (2011). Clustering comparable corpora for bilingual lexicon
extraction. In Proceedings of the 49th Annual Meeting of the Association for Computational
Linguistics : Human Language Technologies : short papers - Volume 2, HLT &#8217;11, pages 473&#8211;478,
Stroudsburg, PA, USA. Association for Computational Linguistics.
</p>
<p>PERRON, O. (1907). Zur theorie der matrices. Mathematische Annalen, 64:248&#8211;263.
</p>
<p>ROBERTSON, S. E. et SP&#196;RCK JONES, K. (1976). Relevance weighting of search terms. Journal of
the American Society for Information Science, 27, n.3:129&#8212;-146.
</p>
<p>SP&#196;RCK JONES, K. (1972). A statistical interpretation of term specificity and its application in
retrieval. Journal of Documentation, 28:11&#8211;21.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>522 c&#65535; ATALA</p>

</div></div>
</body></html>