<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me de traduction de verbes entre arabe standard et arabe dialectal par analyse morphologique profonde</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Un syst&#232;me de traduction de verbes entre arabe standard et
arabe dialectal par analyse morphologique profonde
</p>
<p>Ahmed Hamdi1 Rahma Boujelbane1,2 Nizar Habash3 Alexis Nasr1
(1) Laboratoire d&#8217;Informatique Fondamentale de Marseille- CNRS - UMR 7279 Universit&#233; Aix-Marseille
</p>
<p>(2) Multimedia, InfoRmation Systems and Advanced Computing Laboratory, Sfax 3021, TUNISIE.
(3) Center for Computational Learning Systems Columbia University New York, NY 10115, USA
</p>
<p>{ahmed.hamdi,rahma.boujelbane,alexis.nasr}@lif.univ-mrs.fr
habash@ccls.columbia.edu
</p>
<p>R&#201;SUM&#201;
Le d&#233;veloppement d&#8217;outils de TAL pour les dialectes de l&#8217;arabe se heurte &#224; l&#8217;absence de ressources
pour ces derniers. Comme cons&#233;quence d&#8217;une situation de diglossie, il existe une variante de
l&#8217;arabe, l&#8217;arabe moderne standard, pour laquelle de nombreuses ressources ont &#233;t&#233; d&#233;velopp&#233;es
et ont permis de construire des outils de traitement automatique de la langue. Etant donn&#233; la
proximit&#233; des dialectes de l&#8217;arabe, le tunisien dans notre cas, avec l&#8217;arabe moderne standard, une
voie consiste &#224; r&#233;aliser une traduction surfacique du dialecte vers l&#8217;arabe moderne standard afin
de pouvoir utiliser les outils existants pour l&#8217;arabe standard. Nous d&#233;crivons dans cet article une
architecture pour une telle traduction et nous l&#8217;&#233;valuons sur les verbes.
</p>
<p>ABSTRACT
Translating verbs between MSA and arabic dialects through deep morphological analysis
</p>
<p>The developpment of NLP tools for dialects faces the severe problem of lack of resources for
such dialects. In the case of diglossia, as in arabic, a variant of arabic, Modern Standard Arabic,
exists, for which many resources have been developped which can be used to build NLP tools.
Taking advantage of the closeness of MSA and dialects, one way to solve the problem consist in
performing a surfacic translation of the dialect into MSA in order to use the tools developped for
MSA. We describe in this paper an achitecture for such a translation and we evaluate it on arabic
verbs.
</p>
<p>MOTS-CL&#201;S : dialectes, langues peu dot&#233;es, analyse morphologique, traitement automatique de
l&#8217;arabe.
</p>
<p>KEYWORDS: dialects, Arabic NLP, morphological analysis.
</p>
<p>1 Introduction
</p>
<p>Le monde arabophone conna&#238;t une situation de diglossie (Ferguson, 1959). Une forme d&#8217;arabe,
l&#8217;arabe moderne standard (MSA) est partag&#233;e par tout le monde arabe, mais ne constitue la
langue maternelle d&#8217;aucun arabophone. Le MSA est, en particulier, la langue de la presse &#233;crite
et parl&#233;e. D&#8217;autre part, il existe une grande vari&#233;t&#233; de dialectes qui constituent les langues
maternelles des arabophones. Les dialectes ne sont g&#233;n&#233;ralement pas &#233;crits et ne poss&#232;dent par
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>395 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>cons&#233;quent pas de conventions orthographiques standard.
</p>
<p>Cette situation particuli&#232;re est probl&#233;matique pour le traitement automatique des dialectes
de l&#8217;arabe dans la mesure o&#249; les ressources pour ces langues sont quasiment inexistantes. En
revanche, il existe des ressources importantes pour le MSA. L&#8217;id&#233;e que nous explorons dans cet
article consiste &#224; &#171; traduire &#187; un dialecte de l&#8217;arabe vers le MSA afin de pouvoir y appliquer des
outils con&#231;us pour le MSA. Le verbe traduire a &#233;t&#233; ici mis entre guillemets car l&#8217;objectif n&#8217;est
pas d&#8217;obtenir une traduction parfaite mais une traduction de qualit&#233; suffisante pour appliquer
des outils con&#231;us pour le MSA. De fa&#231;on plus pr&#233;cise, la traduction que nous proposons repose
largement sur la morphologie et le lexique. C&#8217;est en effet &#224; ces deux niveaux que se manifestent la
majorit&#233; des diff&#233;rences entre les vari&#233;t&#233;s de l&#8217;arabe. Le syst&#232;me propos&#233; rel&#232;ve d&#8217;une architecture
&#224; transfert. Un mot en langue source est analys&#233; sous la forme d&#8217;une racine, d&#8217;un sch&#232;me 1 et
de traits morphologiques. Un lexique bilingue permet alors de traduire la racine et le sch&#232;me
source vers une racine et un sch&#232;me cible. Dans le cas, fr&#233;quent, o&#249; la racine est identique dans
la langue source et la langue cible, la traduction se limite aux sch&#232;mes. La racine et le sch&#232;me
cible, ainsi que les traits morphologiques vont alors permettre de g&#233;n&#233;rer un ou plusieurs mots
cibles. Nous nous limiterons, dans cet article, au traitement des verbes.
</p>
<p>Une particularit&#233; de notre approche est de proc&#233;der &#224; une analyse morphologique profonde, de
mani&#232;re &#224; identifier la racine du mot cible alors que l&#8217;on aurait pu se contenter d&#8217;une analyse plus
surfacique, sous la forme d&#8217;un lemme. La raison de ce choix est double. D&#8217;une part, la morphologie
d&#233;rivationnelle de l&#8217;arabe est tr&#232;s r&#233;guli&#232;re, l&#8217;identification de la racine peut &#234;tre r&#233;alis&#233;e, de
mani&#232;re fiable et &#233;conomique, &#224; l&#8217;aide de r&#232;gles. D&#8217;autre part, le fait de r&#233;aliser le transfert au
niveau des racines permet de minimiser la taille du dictionnaire bilingue. On estime en effet
&#224; 7502 le nombre total de racines de l&#8217;arabe et 2903 racines fr&#233;quement utilis&#233;es (Altabbaa
et al., 2010), ce qui permet de d&#233;finir une borne sup&#233;rieure de notre dictionnaire. D&#8217;autre part,
le syst&#232;me que nous proposons est bi-directionnel : tous les modules qui le composent sont
r&#233;versibles, ce qui permet de r&#233;aliser la traduction depuis un dialecte vers le MSA et vice-versa 2.
</p>
<p>Ce travail s&#8217;inscrit dans le contexte du traitement automatique des langues peu dot&#233;es, tel que
les travaux de (Seng, 2010) sur le khmer et le laotien, ou les travaux de (Abdillahi et al., 2006)
sur le somali. Cependant, comme nous l&#8217;avons mentionn&#233; ci-dessus, la situation de l&#8217;arabe est
particuli&#232;re dans la mesure o&#249; les diff&#233;rentes vari&#233;t&#233;s de l&#8217;arabe entretiennent une relation
privil&#233;gi&#233;e avec le MSA pour lequel nous disposons de ressources importantes. En ce sens, notre
travail se rapproche des travaux de (Scherrer et al., 2009) sur les dialectes suisses allemands.
L&#8217;auteur propose un syst&#232;me de traduction depuis l&#8217;allemand vers diff&#233;rents dialectes. Ce syst&#232;me
repose sur une analyse syntaxique de l&#8217;allemand et c&#8217;est &#224; l&#8217;issue de l&#8217;analyse syntaxique qu&#8217;un
m&#233;canisme de transfert permet de g&#233;n&#233;rer une traduction en dialecte. Notre approche se distingue
de ces travaux par deux aspects importants. D&#8217;une part, le transfert dans notre cas est r&#233;alis&#233; au
niveau morphologique. Ce choix repose, comme nous l&#8217;avons vu, sur une hypoth&#232;se th&#233;orique (le
niveau morphologique est un niveau de transfert acceptable dans notre cas) mais aussi sur une
consid&#233;ration pratique qui est que l&#8217;on ne dispose pas d&#8217;un syst&#232;me d&#8217;analyse syntaxique pour
le tunisien. Le second aspect qui distingue notre travail de (Scherrer et al., 2009) est que notre
syst&#232;me est bi-directionnel, il permet aussi bien de traduire du tunisien vers le MSA que l&#8217;inverse.
Plus proche de nous linguistiquement, (Shaalan et al., 2007) d&#233;crit un syst&#232;me de transfert de
</p>
<p>1. Rappelons que l&#8217;arabe est une langue gabaritique. Les mots pleins de l&#8217;arabe peuvent &#234;tre analys&#233;s sous la forme
d&#8217;un gabarit ou sch&#232;me et d&#8217;une racine.
</p>
<p>2. La traduction du MSA vers un dialecte peut &#234;tre int&#233;ressante dans une application de transcription automatique de
la parole : on traduit en dialecte un corpus MSA afin de construire un mod&#232;le de langage pour le dialecte.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>396 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>l&#8217;&#233;gyptien vers le MSA. Dans ce cas, le transfert est effectu&#233; au niveau des lemmes alors que nous
l&#8217;effectuons au niveau des racines pour des raisons d&#233;j&#224; &#233;voqu&#233;es ci-dessus.
</p>
<p>La structure de l&#8217;article est la suivante : nous commencerons, section 2, par une tr&#232;s br&#232;ve
description de la morphologie verbale de l&#8217;arabe. La section 3 se penche sur la morphologie
verbale du tunisien, en mettant en avant les aspects qui la distinguent de la morphologie verbale
du MSA. La section 4 d&#233;crit l&#8217;outil MAGEAD dont nous nous sommes servis pour l&#8217;analyse et
la g&#233;n&#233;ration morphologique. Nous d&#233;crivons ensuite, dans la section 5 notre lexique. Une
&#233;valuation du syst&#232;me est d&#233;crite en section 6 et la section 7 cl&#244;t l&#8217;article.
</p>
<p>2 Morphologie verbale de l&#8217;arabe
</p>
<p>Le syst&#232;me morphologique verbal de l&#8217;arabe est complexe : il met en jeu des ph&#233;nom&#232;nes
d&#8217;agglutination, de flexion et de d&#233;rivation. En revanche, il est tr&#232;s r&#233;gulier, ce qui permet de le
d&#233;crire de mani&#232;re fiable et &#233;conomique &#224; l&#8217;aide de r&#232;gles. L&#8217;objectif de cette section est de d&#233;crire
bri&#232;vement les diff&#233;rents aspects de la morphologie verbale de l&#8217;arabe, en particulier les notions
de clitiques, d&#8217;affixes, de lemmes, de racines et de sch&#232;mes. Ces notions nous permettront, en 3,
de d&#233;crire de mani&#232;re pr&#233;cise les diff&#233;rences entre la morphologie verbale du MSA et du tunisien
et, en 4, d&#8217;introduire le syst&#232;me d&#8217;analyse et de g&#233;n&#233;ration morphologique que nous utilisons.
</p>
<p>Dans la suite de cet article, nous pr&#233;senterons nos exemples en alphabet arabe et sous une
forme translit&#233;r&#233;e mise entre crochets. Pour cela, nous utilisons la translit&#233;ration propos&#233;e par
(Buckwalter, 2004).
</p>
<p>2.1 Agglutination
</p>
<p>La langue arabe est fortement agglutinante : des articles, des conjonctions, des pr&#233;positions,
mat&#233;rialis&#233;s par des clitiques, se rattachent aux formes fl&#233;chies. On distingue g&#233;n&#233;ralement
les proclitiques qui se situent avant la forme fl&#233;chie et les enclitiques qui se situent apr&#232;s.
Les clitiques sont optionnels et invariables (leur forme ne varie pas selon le verbe auquel ils se
rattachent).
</p>
<p>Le verbe arabe admet un seul enclitique, le pronom compl&#233;ment d&#8217;objet direct (PRN_D), qui
varie en genre et en nombre et les proclitiques suivants pr&#233;sent&#233;s selon leurs positions, du plus
&#233;loign&#233; au plus proche du verbe :
</p>
<p>&#8211; QST : la particule d&#8217;interrogation &#65535; [&gt;a] &quot;est-ce que&quot;
&#8211; CNJ : les conjonctions &#65535; [wa] &quot;et&quot; et &#65535; [fa] &quot;alors&quot;
&#8211; PRP : la pr&#233;position &#65535;&#65535; [li] &quot;pour&quot; et la particule d&#8217;accentuation &#65535;&#65535; [la].
&#8211; PRT : la particule de futur &#65535;&#65535; [sa] et les particules de n&#233;gations &#65535; [lA] et &#65535;&#65535; [mA]
</p>
<p>La structure d&#8217;un verbe arabe peut &#234;tre d&#233;crite par l&#8217;expression r&#233;guli&#232;re suivante :
</p>
<p>QST ? CNJ ? PRP ? PRT ? forme fl&#233;chie PRN_D?
</p>
<p>Illustrons cela sur le verbe &#65535;&#65535; &#65535; &#65535;&#65535; &#65535; &#65535;&#65535; &#65535; &#65535; [&gt;asataktubuwnahA], qui se traduit en fran&#231;ais par &quot;est-ce
que vous l&#8217;&#233;crirez&quot;. Ce verbe est compos&#233; de deux proclitiques, l&#8217;article d&#8217;interrogation &#65535; [&gt;a] et
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>397 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>la particule de futur &#65535;&#65535; [sa], une forme fl&#233;chie &#65535; &#65535;&#65535; &#65535; &#65535;&#65535; [taktubuwna] et un enclitique pronom
d&#8217;objet direct &#65535;&#65535; [hA].
</p>
<p>L&#8217;op&#233;ration qui consiste &#224; s&#233;parer les clitiques du verbe est g&#233;n&#233;ralement appel&#233;e segmentation.
Celle-ci pose des probl&#232;mes d&#8217;ambigu&#239;t&#233; dans une perspective de traitement automatique. En
effet, dans certains cas, plusieurs segmentations sont possibles, comme dans le cas du verbe
&#65535;&#65535;&#65535;&#65535; [wEdh] qui peut &#234;tre d&#233;compos&#233; en wEd+h &quot;il l&#8217;a promis&quot; ou bien comme w+Ed+h &quot;et
il l&#8217;a compt&#233;&quot;. L&#8217;ambigu&#239;t&#233; est plus importante lorsque les diacritiques ne sont pas repr&#233;sent&#233;s,
comme c&#8217;est g&#233;n&#233;ralement le cas dans les corpus arabes.
</p>
<p>2.2 Flexion
</p>
<p>La flexion verbale de l&#8217;arabe est tr&#232;s r&#233;guli&#232;re. Elle est fond&#233;e sur la concat&#233;nation d&#8217;affixes aux
lemmes verbaux. La d&#233;termination des affixes repose sur les valeurs des traits morphologiques
suivants :
</p>
<p>&#8211; Aspect : l&#8217;arabe distingue trois aspects : le perfectif utilis&#233; quand l&#8217;action est accomplie. C&#8217;est
l&#8217;aspect le plus simple d&#8217;un point de vue morphologique. Utilis&#233; avec la troisi&#232;me personne
du singulier, il repr&#233;sente la forme canonique d&#8217;un verbe, &#224; l&#8217;instar de l&#8217;infinitif en fran&#231;ais.
L&#8217;imperfectif indique que l&#8217;action est en train de se r&#233;aliser, sans &#234;tre achev&#233;e. Il exprime le
pr&#233;sent, et permet d&#8217;exprimer le pass&#233; et le futur &#224; l&#8217;aide des particules. L&#8217;imp&#233;ratif indique
l&#8217;injonction. Il ne peut &#234;tre conjugu&#233; qu&#8217;&#224; la deuxi&#232;me personne.
</p>
<p>&#8211; Mode : l&#8217;indicatif employ&#233; dans une proposition principale. Le subjonctif employ&#233; dans une
proposition subordonn&#233;e. Le jussif ou l&#8217;apocop&#233; exprime la n&#233;gation, l&#8217;interdiction ou le
conditionnel. Le mode s&#8217;applique uniquement &#224; l&#8217;aspect imperfectif.
</p>
<p>&#8211; Personne, genre et nombre du sujet : comme en fran&#231;ais, on distingue trois personnes, deux
genres, le masculin et le f&#233;minin. En revanche, l&#8217;arabe distingue trois valeurs pour le nombre
le singulier, le duel et le pluriel.
</p>
<p>Le tableau 1, d&#233;crit les affixes de la premi&#232;re personne selon le nombre, l&#8217;aspect et le mode du
verbe. Le duel, l&#8217;imp&#233;ratif et le genre n&#8217;interviennent pas quand il s&#8217;agit de la premi&#232;re personne.
</p>
<p>personne nombre Aspect Mode pr&#233;fixe suffixe Exemple [katab]
</p>
<p>1
</p>
<p>singulier
</p>
<p>perfectif - - tu katabtu
</p>
<p>imperfectif
indicatif &gt; u &gt;aktubu
subjonctif &gt; a &gt;aktuba
</p>
<p>jussif &gt; o &gt;aktubo
</p>
<p>pluriel
</p>
<p>perfectif - - nA katabnA
</p>
<p>imperfectif
indicatif n u naktubu
subjonctif n a naktuba
</p>
<p>jussif n o naktubo
</p>
<p>TABLE 1: Affixes de flexion des verbes arabes pour la premi&#232;re personne
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>398 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.3 Racines et sch&#232;mes
</p>
<p>Les lemmes verbaux arabes sont d&#233;riv&#233;s &#224; patir d&#8217;une racine et d&#8217;un sch&#232;me. La racine est une
s&#233;quence de trois ou quatre lettres qui d&#233;finit une notion abstraite. La racine &#65535;&#65535;&#65535; [ktb], par
exemple, est associ&#233;e &#224; la notion d&#8217;&#233;criture alors que la racine&#65535;&#65535;&#65535; [drs] est li&#233;e &#224; la notion
d&#8217;&#233;tude. Un sch&#232;me, appel&#233; aussi gabarit ou patron, est une s&#233;quence compos&#233;e de chiffres
et de lettres qui d&#233;finit le format du lemme. Le processus de g&#233;n&#233;ration d&#8217;un lemme consiste
&#224; remplacer chaque chiffre du sch&#232;me par la lettre correspondante dans la racine. Reprenons
l&#8217;exemple du lemme verbal &#65535;&#65535; &#65535; [katab], il est obtenu &#224; partir de la racine &#65535; &#65535; &#65535; ktb et le
sch&#232;me 1a2a3 en rempla&#231;ant, les chiffres 1, 2 et 3, par les lettres correspondantes de la racine.
</p>
<p>Un sch&#232;me est porteur d&#8217;un sens g&#233;n&#233;ral, tel que le factitif, le nom prototypique de la personne
qui effectue l&#8217;action, le r&#233;sultat de l&#8217;action. . .le sch&#232;me marque aussi la voix (on distinge l&#8217;actif et
le passif sans agent) et l&#8217;aspect.
</p>
<p>Le tableau 2 repr&#233;sente quelques sch&#232;mes des verbes arabes pour l&#8217;aspect perfectif ou imperfectif
ainsi que leurs significations. Nous avons indiqu&#233; entre parenth&#232;se le sch&#232;me de la voix passive.
</p>
<p>perfectif imperfectif signification
1a2a3 (1u2i3) a12a3 (u12a3) sens de base
</p>
<p>1a22a3 (1u22i3) u1a22i3 (u1a22a3) causalit&#233;
1A2a3 (1uw2i3) u1A2i3 (u1A2a3) r&#233;ciprocit&#233; implicite
</p>
<p>ta1A2a3 (tu1uw2i3) ata1A2a3 (uta1A2a3) r&#233;ciprocit&#233; explicite
1a23a4 (1u23i4) u1a23i4 (u1a23a4) sens de base
</p>
<p>ta1a23a4 (tu1u23i4) ata1a23i4 (uta1a23a4) forme r&#233;fl&#233;chie de 1a23a4
</p>
<p>TABLE 2: Exemples de sch&#232;mes verbaux arabes
</p>
<p>3 Morphologie verbale du tunisien
</p>
<p>Plusieurs travaux r&#233;cents s&#8217;int&#233;ressent au dialecte tunisien : (Mejri et al., 2009) a pr&#233;sent&#233;
la situation linguistique en Tunisie en d&#233;crivant les syst&#232;mes phonologiques, morphologiques
et syntaxiques du tunisien. (Ouerhani, 2009) a &#233;tudi&#233; les ph&#233;nom&#232;nes d&#8217;interf&#233;rence entre la
morphologie verbale du tunisien et celle de l&#8217;arabe standard d&#8217;une part, et la relation entre
les verbes tunisiens et fran&#231;ais (le cas de l&#8217;emprunt) d&#8217;autre part. Dans ce travail, nous nous
int&#233;ressons tout comme (Ouerhani, 2009) &#224; la morphologie verbale du dialecte tunisien mais
contrairement &#224; lui, qui ne s&#8217;interresse qu&#8217;&#224; un &#233;chantillon de verbes, nous &#233;tudions tout le
paradigme verbal tunsien. Ce dernier s&#8217;inspire fortement du MSA, on retrouve en effet les
ph&#233;nom&#232;nes d&#8217;agglutination de flexion et de d&#233;rivation d&#233;crits dans la section 2 mais avec
quelques diff&#233;rences que nous d&#233;crivons ci-dessous.
</p>
<p>3.1 Agglutination
</p>
<p>Au niveau de l&#8217;agglutination, deux ph&#233;nom&#232;nes distinguent le tunisien du MSA. D&#8217;une part,
certains clitiques MSA sont r&#233;alis&#233;s sous la forme de particules ind&#233;pendantes en tunisien et
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>399 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>vice-versa. D&#8217;autre part, la forme de certains clitiques change. Ces ph&#233;nom&#232;nes sont d&#233;crits plus
en d&#233;tails ci-dessous :
</p>
<p>&#8211; le proclitique d&#8217;interrogation MSA &#65535; [&gt;a] &quot;est-ce que&quot; devient en tunisien l&#8217;enclitique &#65535; [$]
La forme verbale MSA &#65535; &#65535; &#65535; &#65535; &#65535; [&gt;akatabta] &quot;est-ce que tu as &#233;crit&quot;, par exemple, se traduit en
tunisien par&#65535;&#65535; &#65535;&#65535;&#65535; [ktibti$].
</p>
<p>&#8211; la pr&#233;position &#65535;&#65535; [li] &quot;pour&quot; et le proclitique du futur ne sont plus rattach&#233;s aux verbes. Tous
les deux se traduisent par la particule ind&#233;pendante&#65535;&#65535;&#65535; [bA$] qui se situe avant le verbe : les
formes &#65535;&#65535; &#65535;&#65535; &#65535; [litaktub] &quot;pour que tu &#233;crives&quot; et &#65535;&#65535; &#65535;&#65535;&#65535; [sataktub] &quot;tu &#233;criras&quot; sont exprim&#233;s en
tunisien par &#65535;&#65535; &#65535;&#65535; &#65535;&#65535;&#65535; [bA$ tiktib].
</p>
<p>&#8211; le pronom compl&#233;ment d&#8217;objet indirect (PRN_I) qui est d&#233;tach&#233; du verbe en MSA se r&#233;alise
sous la forme d&#8217;un enclitique en tunisien, par exemple les deux formes &#65535; &#65535; &#65535; &#65535;&#65535; &#65535; [katabtu laka]
en MSA sont rattach&#233;es en tunisien&#65535;&#65535;&#65535;&#65535;&#65535;&#65535; [ktibtlik] &quot;je t&#8217;ai &#233;crit&quot;.
</p>
<p>La structure d&#8217;un verbe tunisien peut &#234;tre d&#233;crite par l&#8217;expression r&#233;guli&#232;re suivante :
</p>
<p>CNJ ? PRT ? forme fl&#233;chie PRN_D? PRN_I ? (NEG|QST) ?
</p>
<p>3.2 Flexion
</p>
<p>De mani&#232;re g&#233;n&#233;rale, la flexion des verbes tunisiens est plus pauvre que celle des verbes MSA.
En particulier, le mode n&#8217;est plus marqu&#233;, les valeurs du nombre qui &#233;taient au nombre de trois
en MSA (singulier, duel et pluriel) sont r&#233;duits &#224; deux (singulier et pluriel). Quant au genre, il
n&#8217;est sp&#233;cifi&#233; que lorsqu&#8217;il s&#8217;agit de la troisi&#232;me personne du singulier. La liste des affixes sujet de
la premi&#232;re personne sont repr&#233;sent&#233;s dans le tableau 3. Ce dernier peut &#234;tre mis en regard du
tableau 1.
</p>
<p>personne nombre Aspect pr&#233;fixe suffixe Exemple : ktib &quot;&#233;crire&quot;
</p>
<p>1
singulier perfectif - t ktibtimperfectif n o niktibo
</p>
<p>pluriel perfectif - nA ktibnAimperfectif n uwA niktbuwA
</p>
<p>TABLE 3: Affixes de flexions des verbes tunisiens pour la premi&#232;re personne
</p>
<p>D&#8217;autre part, contrairement au MSA qui marque la voix dans le sch&#232;me verbal, le tunisien marque
la voix passive sous la forme du pr&#233;fixe &#65535; [t] 3. La forme MSA passive &#65535; &#65535; &#65535; [kutiba] &quot;il est &#233;crit&quot;
devient en tunisien &#65535;&#65535;&#65535;&#65535; [tiktib].
</p>
<p>3.3 Racines et sch&#232;mes
</p>
<p>Hormis les emprunts, les lemmes verbaux tunisiens d&#233;rivent d&#8217;une racine et un sch&#232;me, comme
pour le MSA. Il y a en g&#233;n&#233;ral correspondance bi-univoque entre un sch&#232;me MSA et un sch&#232;me
tunisien sauf dans certains cas o&#249; un sch&#232;me MSA peut correspondre &#224; deux sch&#232;mes tunisiens
</p>
<p>3. Nous aurions aussi pu d&#233;finir le passif avec les sch&#232;mes, en ajoutant un /t/ au d&#233;but de chaque sch&#232;me de la voix
active.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>400 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ou bien &#224; aucun sch&#232;me tunisien. La correspondance entre les sch&#232;mes MSA pr&#233;sent&#233;s dans la
section 2 et les sch&#232;mes tunisiens est donn&#233;e dans le tableau 4.
</p>
<p>perfectif imperfectif
sch&#232;me_MSA sch&#232;me_TUN sch&#232;me_MSA sch&#232;me_TUN
</p>
<p>1a2a3 12a3 a12a3 a12a3
1a22a3 1a22a3 u1a22i3 1a22a3
1A2a3 1A2a3 u1A2i3 1A2a3
ta1A2a3 t1A2a3 ata1A2a3 it1A2a3
1a23a4 1a23i4 u1a23i4 1a23i4
ta1a23a4 ta1a23i4 ata1a23i4 ta1a23i4
</p>
<p>TABLE 4: Correspondance des sch&#232;mes MSA et tunisiens
</p>
<p>4 Analyse et g&#233;n&#233;ration morphologiques
</p>
<p>L&#8217;analyse et la g&#233;n&#233;ration morphologiques de notre syst&#232;me sont r&#233;alis&#233;es par l&#8217;outil MAGEAD
(Habash et Rambow, 2006; Habash et al., 2005). Ce dernier est un syst&#232;me &#224; base de r&#232;gles qui
permet de d&#233;crire les syst&#232;mes morphologiques des diff&#233;rentes vari&#233;t&#233;s de l&#8217;arabe (dialectes et
MSA) et de les compiler sous la forme d&#8217;un transducteur fini.
</p>
<p>Une des id&#233;es ma&#238;tresses qui sous-tendent le syst&#232;me MAGEAD est le partage des connaissances
linguistiques communes &#224; plusieurs vari&#233;t&#233;s de l&#8217;arabe. En effet, comme nous l&#8217;avons vu ci-dessus,
les vari&#233;t&#233;s de l&#8217;arabe se distinguent par certains aspects lexicaux et morphologiques mais en
partagent d&#8217;autres. L&#8217;architecture de MAGEAD permet de ne repr&#233;senter qu&#8217;une fois ce qui est
commun &#224; plusieurs vari&#233;t&#233;s de l&#8217;arabe.
</p>
<p>MAGEAD effectue une analyse morphologique profonde. Partant d&#8217;une forme verbale ou nominale
de l&#8217;arabe, il en fait l&#8217;analyse sous la forme d&#8217;une racine, d&#8217;une classe et de traits morphologiques.
Ces derniers sont au nombre de 9 : PER, GEN, NUM, ASP, VOICE, QST, CNJ, PRT, PRN. Les cinq
premiers traits d&#233;finissent respectivement la personne, le genre, le nombre, l&#8217;aspect et la voix.
Alors que les quatre derniers traits indiquent les clitiques (question, conjonction, particule et
pronom d&#8217;objet direct). La combinaison de ces traits va permettre de s&#233;lectionner un sch&#232;me, des
affixes, des clitiques et de les combiner afin de produire une forme verbale.
</p>
<p>MAGEAD distingue quatre niveaux de repr&#233;sentation. Nous les d&#233;crirons ci-dessous en nous
appuyant sur un exemple, qui est la forme &#65535;&#65535;&#65535;&#65535;&#65535;&#65535; [Aizdaharat], &quot;elle a prosp&#233;r&#233;&quot;.
</p>
<p>&#8211; la repr&#233;sentation profonde.
A ce niveau de repr&#233;sentation, une forme est repr&#233;sent&#233;e, comme nous l&#8217;avons mentionn&#233;
ci-dessus, sous la forme d&#8217;une racine, d&#8217;une classe, appel&#233;e MBC (pour Morphologic Behavioural
Class) et de traits morphologiques. Ce niveau est commun &#224; toutes les variantes de l&#8217;arabe.
A ce niveau, notre exemple est repr&#233;sent&#233; sous la forme suivante :
[ROOT:zhr] [MBC:verb-VIII] [POS:V] [PER:3] [GEN:f] [NUM:s] [ASP:p]
</p>
<p>&#8211; la repr&#233;sentation en morph&#232;mes abstraits.
Les morph&#232;mes abstraits sont des morph&#232;mes qui pourront se r&#233;aliser diff&#233;remment dans des
vari&#233;t&#233;s diff&#233;rentes de l&#8217;arabe.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>401 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Notre exemple est repr&#233;sent&#233; &#224; ce niveau de la fa&#231;on suivante :
[ROOT:zhr][PAT_PV:VIII][VOC_PV:VIII-act]+[SUBJSUF_PV:3FS]
Les trois premiers morph&#232;mes d&#233;crivent la racine, le sch&#232;me (patron) et le vocalisme 4. L&#8217;en-
semble de ces trois morph&#232;mes d&#233;finissent un lemme. Le dernier morph&#232;me d&#233;crit un suffixe
indiquant le genre, le nombre et la personne du verbe. Un tel suffixe pourra se r&#233;aliser
diff&#233;remment selon la vari&#233;t&#233; d&#8217;arabe consid&#233;r&#233;e.
Le passage du niveau profond au niveau morphologique abstrait est r&#233;alis&#233; &#224; l&#8217;aide des MBC.
Ces derniers permettent d&#8217;associer des traits morphologiques &#224; des morph&#232;mes abstraits. Cette
association est r&#233;alis&#233;e &#224; l&#8217;aide de r&#232;gles dont la partie gauche est constitu&#233;e d&#8217;un ou plusieurs
traits et la partie droite est constitu&#233;e d&#8217;un morph&#232;me profond. C&#8217;est en particulier la r&#232;gle
suivante qui donnera naissance au morph&#232;me [SUBJSUF_PV:3FS] :
[ASP:p][PER:3][GEN:f][NUM:s] -&gt; [SUBJSUF_PV:3FS]
Les MBC sont repr&#233;sent&#233;s sous la forme d&#8217;une hi&#233;rarchie, les MBC h&#233;ritent de leurs MBC
anc&#234;tres un certain nombre de propri&#233;t&#233;s. C&#8217;est cette repr&#233;sentation hi&#233;rarchique qui permet
de factoriser des r&#232;gles communes &#224; plusieurs MBC.
</p>
<p>&#8211; la repr&#233;sentation en morph&#232;mes concrets.
A ce niveau de repr&#233;sentation, les morph&#232;mes abstraits sont r&#233;alis&#233;s sous la forme de mor-
ph&#232;mes concrets. Notre exemple se repr&#233;sente maintenant de la fa&#231;on suivante :
&lt;zhr, AV1tV2V3, iaa&gt; + at
le suffixe +at indique la personne, le genre et le nombre du sujet. Le triplet &lt;zhr, AV1tV2V3,
iaa&gt; regroupe les trois composantes du lemme : la racine, le sch&#232;me et le vocalisme. Ces trois
composantes vont permettre de g&#233;n&#233;rer le lemme proprement dit. Le principe de g&#233;n&#233;ration
rel&#232;ve de la morphologie non concat&#233;native, elle consiste &#224; remplacer les symboles 1,2 et 3 du
sch&#232;me par le permier, second et troisi&#232;me symbole de la racine. Les symboles V sont quant &#224;
eux remplac&#233;s par les symboles qui consituent le vocalisme. Le r&#233;sultat de cette op&#233;ration est
la cha&#238;ne Aiztahra. Cette op&#233;ration est r&#233;alis&#233;e &#224; l&#8217;aide d&#8217;un automate multibande, &#224; l&#8217;image
de (Kiraz, 2000).
</p>
<p>&#8211; la repr&#233;sentation de surface.
Il s&#8217;agit de la repr&#233;sentation orthographique. Notre exemple se repr&#233;sente maintenant sous
la forme Aizdaharat, qui est une translit&#233;ration de la forme arabe &#65535;&#65535; &#65535; &#65535; &#65535;&#65535;. Le passage de
la repr&#233;sentation en morph&#232;mes concrets &#224; la repr&#233;sentation de surface met en jeu deux
types d&#8217;op&#233;rations. D&#8217;une part la concat&#233;nation des affixes et d&#8217;autre part des r&#232;gles morpho-
phon&#233;miques qui vont, par exemple, provoquer le voisement du son /t/ pour donner le son
/d/.
</p>
<p>L&#8217;adaptation de MAGEAD &#224; une nouvelle vari&#233;t&#233; de l&#8217;arabe se d&#233;compose en trois &#233;tapes.
</p>
<p>La premi&#232;re consiste &#224; cr&#233;er la nouvelle hi&#233;rarchie des MBC sp&#233;cifiques au dialecte d&#233;crit. Dans
notre cas, nous avons d&#233;fini, pour chaque sch&#232;me tunisien, un nouvel MBC dans la hi&#233;rarchie.
</p>
<p>La deuxi&#232;me &#233;tape consiste &#224; d&#233;finir de nouveaux morph&#232;mes abstraits tels que, dans notre cas,
l&#8217;enclitique de n&#233;gation, ainsi que les morph&#232;mes concrets leur correspondant. Dans le cas du
tunisien la majorit&#233; des morph&#232;mes concrets sont diff&#233;rents de ceux du MSA.
</p>
<p>La troisi&#232;me &#233;tape concerne les r&#232;gles phonologiques et orthographiques propres au dialecte
d&#233;crit. Il existe en particulier une r&#232;gle sp&#233;cifique au tunisien qui remplace la troisi&#232;me lettre
</p>
<p>4. MAGEAD ne manipule pas directement des sch&#232;mes, il les d&#233;compose en deux parties, d&#8217;une part une forme non
diacrit&#233;e du sch&#232;me et d&#8217;autre part les diacritiques qui vont permettre de vocaliser cette forme afin d&#8217;obtenir un sch&#232;me
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>402 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de la racine, si cette derni&#232;re est d&#233;fectueuse 5, ainsi que la voyelle qui la pr&#233;c&#232;de par la voyelle
longue &#65535; [A] lorsque le suffixe sujet commence par la voyelle ferm&#233;e [u] ou [i] (ce qui est le cas
pour la troisi&#232;me personne du singulier f&#233;minin et la troisi&#232;me personne du pluriel). Le verbe
&#65535;&#65535;&#65535; [m$aY] conjugu&#233; &#224; la troisi&#232;me personne du singulier f&#233;minin donne &#65535;&#65535;&#65535;&#65535; [m$At] alors
qu&#8217;&#224; la troisi&#232;me personne du pluriel il donne &#65535;&#65535;&#65535;&#65535;&#65535; [m$AwA].
</p>
<p>5 Lexique
</p>
<p>Comme nous l&#8217;avons d&#233;crit dans l&#8217;introduction, notre lexique apparie des couples (racine, MBC)
en MSA avec des couples (racine, MBC) en tunisien. Le lexique est compos&#233; de 1638 entr&#233;es.
Il a &#233;t&#233; r&#233;alis&#233; &#224; partir du corpus de l&#8217;Arabic Tree Bank (ATB) (Maamouri et al., 2004) qui est
compos&#233; de 120 transcriptions d&#8217;&#233;missions d&#8217;actualit&#233; en MSA diffus&#233;es par diff&#233;rentes cha&#238;nes
arabes.
</p>
<p>Ce corpus comporte 29911 occurences verbales. Afin d&#8217;extraire les lemmes et les racines de ces
verbes, nous avons eu recours &#224; l&#8217;analyseur morphologique ELIXIRFM (Smr&#382;, 2007) qui permet,
&#233;tant donn&#233; une forme fl&#233;chie en MSA, d&#8217;en extraire le lemme et la racine.
</p>
<p>Chaque occurrence de lemme MSA a &#233;t&#233; ensuite traduite, en contexte, par un locuteur natif, en
tunisien. A ce stade, les entr&#233;es du lexique sont compos&#233;es, c&#244;t&#233; MSA d&#8217;un lemme et d&#8217;une racine
et, c&#244;t&#233; tunisien, d&#8217;un lemme.
</p>
<p>Nous avons alors associ&#233; &#224; chaque entr&#233;e, du c&#244;t&#233; MSA, un MBC et pour chaque lemme,
c&#244;t&#233; tunisien, un MBC et une racine. Comme nous l&#8217;avons d&#233;crit dans la section 4, lorsque le
comportenement d&#8217;un verbe tunisien n&#8217;&#233;tait pas d&#233;crit par un MBC MSA, un nouvel MBC a &#233;t&#233;
cr&#233;&#233;.
</p>
<p>En ce qui concerne les racines, dans 81,49 % des cas, nous avons identifi&#233; une racine arabe
existante. Lorsqu&#8217;il n&#8217;existait pas de racine pour un lemme donn&#233;, nous avons eu recours &#224; une
m&#233;thode d&#233;ductive pour en cr&#233;er une nouvelle.
</p>
<p>En effet, &#233;tant donn&#233; l&#8217;&#233;quation racine + sch&#232;me = lemme, lorsque nous disposons d&#8217;un lemme
et d&#8217;un sch&#232;me, il est possible d&#8217;en d&#233;duire une racine. A l&#8217;aide de ce processus, nous avons d&#233;fini
une centaine de nouvelles racines sp&#233;cifiques au tunisien.
</p>
<p>Dans sa forme actuelle, le lexique est compos&#233; de 1638 entr&#233;es. Du c&#244;t&#233; tunisien l&#8217;ensemble des
racines s&#8217;&#233;l&#232;ve &#224; 646 et du c&#244;t&#233; MSA &#224; 1050.
</p>
<p>L&#8217;ambigu&#239;t&#233; est donc plus importante dans le sens tunisien &#8594; MSA que dans le sens MSA &#8594;
tunisien. De mani&#232;re plus pr&#233;cise, dans 587 cas, &#224; un couple (racine, MBC) tunisien correspond
un couple (racine, MBC) MSA et dans 333 cas, il lui en correspond plusieurs.
</p>
<p>Nous reviendrons plus en d&#233;tails sur l&#8217;ambigu&#239;t&#233; dans la partie 6.
</p>
<p>5. Les lettres d&#233;fectueuses dans l&#8217;arabe sont &#65535; [w] et &#65535; [y]
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>403 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>6 Evaluation
</p>
<p>Le processus de traduction d&#8217;une forme verbale en tunisien en une forme verbale MSA se
d&#233;compose en trois &#233;tapes : l&#8217;analyse morphologique &#224; l&#8217;aide de l&#8217;outil MAGEAD adapt&#233; au tunisien,
le transfert lexical r&#233;alis&#233; au niveau des racines gr&#226;ce &#224; un lexique MSA-tunisien et la g&#233;n&#233;ration
de la forme verbale MSA grace &#224; l&#8217;outil MAGEAD pour le MSA. Rappelons que chacune de ces
&#233;tapes est r&#233;versible et que l&#8217;on peut sym&#233;triquement traduire une forme verbale MSA en une
forme verbale en tunisien.
</p>
<p>De mani&#232;re plus pr&#233;cise, &#224; partir d&#8217;un verbe source, MAGEAD produit toutes ses analyses possibles,
chacune d&#8217;elles est compos&#233;e d&#8217;une racine-source, d&#8217;un MBC-source et de diff&#233;rents traits mor-
phologiques. Le couple (racine-source, MBC-source) permet de faire un acc&#232;s au dictionnaire
pour extraire un ou plusieurs couples (racine-cible, MBC-cible). Les traits morphologiques sont
quant &#224; eux conserv&#233;s tels quels. Le processus est d&#233;crit dans la figure 1.
</p>
<p>racine source
</p>
<p>MBC source
</p>
<p>traits morpho.
</p>
<p>traits morpho.
</p>
<p>MBC cible
</p>
<p>racine cible
</p>
<p>lexique
</p>
<p>MAGEAD_GEN
</p>
<p>MAGEAD_ANA
</p>
<p>verbe cible 
</p>
<p>    verbe source
</p>
<p>FIGURE 1: Traduction d&#8217;une forme verbale d&#8217;une langue source vers une langue cible
</p>
<p>Cette architecture rec&#232;le deux sources d&#8217;ambigu&#239;t&#233;. D&#8217;une part, l&#8217;analyse peut cr&#233;er plusieurs
couples (racine-source, MBC-source) et, d&#8217;autre part, le lexique peut proposer pour un couple
(racine-source, MBC-source) plus d&#8217;un couple (racine-cible, MBC-cible).
</p>
<p>Comme nous l&#8217;avons mentionn&#233; dans l&#8217;introduction, l&#8217;objectif g&#233;n&#233;ral de ce travail n&#8217;est pas de
produire un syst&#232;me de traduction du tunisien vers le MSA mais de g&#233;n&#233;rer &#224; partir d&#8217;un texte
tunisien une version de ce dernier sous une forme se rapprochant du MSA, de sorte que des
outils de traitement automatique du MSA, tel que des &#233;tiqueteurs morpho-syntaxiques ou des
analyseurs syntaxiques puissent &#234;tre utilis&#233;s sur cette nouvelle forme du texte avec des r&#233;sultats
satisfaisants. La r&#233;elle &#233;valuation sera donc r&#233;alis&#233;e sur la sortie de ces outils.
</p>
<p>Les exp&#233;riences d&#233;crites ici ne fournissent qu&#8217;une &#233;valuation partielle, elles permettent de mesurer
dans quelle mesure, pour une forme verbale tunisienne en entr&#233;e, la forme verbale MSA correcte
est g&#233;n&#233;r&#233;e en sortie.
</p>
<p>L&#8217;&#233;valuation de ce processus est confront&#233; au probl&#232;me de l&#8217;absence de ressources &#233;crites pour les
dialectes. Afin de pallier ce probl&#232;me, nous avons eu recours au livre (Dhouib, 2007) qui est une
pi&#232;ce de th&#233;atre &#233;crite en tunisien. Les 1500 occurrences de formes verbales ont &#233;t&#233; identifi&#233;es
et traduites en contexte, en tunisen, par deux locuteurs natifs. A l&#8217;issue de ce processus, 1500
couples (forme tunisienne, forme MSA) ont &#233;t&#233; produits et cet ensemble a &#233;t&#233; divis&#233; en deux
parties &#233;gales. La premi&#232;re constituant un ensemble de d&#233;veloppement et la seconde un ensemble
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>404 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de test. Deux m&#233;triques standard ont &#233;t&#233; utilis&#233;es pour &#233;valuer le processus : la pr&#233;cision, qui
indique la proportion de cas pour lesquels la forme cible correcte a &#233;t&#233; produite et l&#8217;ambigu&#239;t&#233;,
qui indique le nombre de formes cible produites en moyenne, pour une forme source.
</p>
<p>Les exp&#233;riences ont &#233;t&#233; r&#233;alis&#233;es dans le sens tunisien vers MSA et dans le sens MSA vers tunisien.
Nous avons distingu&#233; les r&#233;sultats sur les types et sur les occurrences. L&#8217;ensemble de d&#233;velop-
pement a permis de combler quelques lacunes de l&#8217;analyseur et du g&#233;n&#233;rateur morphologique
et d&#8217;enrichir notre lexique. Les r&#233;sultats des exp&#233;riences sur le corpus de d&#233;veloppement sont
donn&#233;s dans le tableau 5.
</p>
<p>pr&#233;cision ambigu&#239;t&#233;
occurences types occurences types
</p>
<p>TUN&#8658; MSA 87.65 86.68 25.42 23.33
MSA&#8658; TUN 89.56 88.74 1.25 2.87
</p>
<p>TABLE 5: Pr&#233;cision et ambigu&#239;t&#233; de la traduction des verbes de l&#8217;ensemble de d&#233;veloppement
</p>
<p>Ces exp&#233;riences ont &#233;t&#233;, ensuite, lanc&#233;es sur l&#8217;ensemble de test (cf. tableau 6). La grande
diff&#233;rence entre l&#8217;ensemble de d&#233;veloppement et celui du test est le lexique. En effet, dans les
exp&#233;riences sur les donn&#233;es de d&#233;veloppement, toutes les paires (racine, MBC) qui ne se trouvent
pas dans le lexique ont &#233;t&#233; rajout&#233;es.
</p>
<p>pr&#233;cision ambigu&#239;t&#233;
occurences types occurences types
</p>
<p>TUN&#8658; MSA 76.43 74.52 26.82 25.57
MSA&#8658; TUN 79.24 75.1 1.47 3.1
</p>
<p>TABLE 6: Pr&#233;cision et ambigu&#239;t&#233; de la traduction des verbes de l&#8217;ensemble de test
</p>
<p>Une analyse d&#8217;erreurs dans le sens tunisien vers MSA a montr&#233; que 34.6% des erreurs proviennent
du lexique, alors que 14.5% d&#8217;erreurs proviennent de MAGEAD MSA et 51.9% de MAGEAD tunisien.
La plupart des erreurs commises par MAGEAD sont d&#251;es aux ph&#233;nom&#232;nes morphologiques qui
n&#8217;ont pas encore &#233;t&#233; impl&#233;ment&#233;s, en particulier les verbes quadrilit&#232;res et l&#8217;imp&#233;ratif des verbes
d&#233;fectueux. D&#8217;autres erreurs sp&#233;cifiques &#224; MAGEAD tunisien proviennent des verbes pour lesquels
la premi&#232;re ou la troisi&#232;me lettre de la racine est &quot;hamza&quot; &#65535; [&#8217;] qui n&#233;c&#233;ssitent un traitement
sp&#233;cifique. D&#8217;autre part, cette analyse d&#8217;erreurs a r&#233;v&#233;l&#233; deux types d&#8217;ambigu&#239;t&#233;s : l&#8217;ambigu&#239;t&#233;
lexicale, dans 30% des cas et l&#8217;ambigu&#239;t&#233; morphologique dans 70% des cas.
</p>
<p>7 Conclusion
</p>
<p>Nous avons propos&#233; dans cet article un syst&#232;me de traduction de formes verbales depuis le
tunisien vers le MSA et vice-versa. Ce travail s&#8217;inscrit dans un projet plus g&#233;n&#233;ral de traduction
des dialectes de l&#8217;arabe vers des approximations du MSA. Les r&#233;sultats donn&#233;s par ce syst&#232;me
sont environ 76% pour le passage du dialecte tunisien &#224; l&#8217;arabe standard et 79% de performances
dans l&#8217;autre sens.
</p>
<p>L&#8217;architecture d&#233;velopp&#233;e va &#234;tre utilis&#233;e pour traduire les noms. Nous n&#8217;avons pas trait&#233; ici
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>405 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>le probl&#232;me de l&#8217;ambigu&#239;t&#233; : comment choisir une traduction lorsque plusieurs sont propos&#233;es
par le syst&#232;me ? Il sera trait&#233; dans une &#233;tape ult&#233;rieure par l&#8217;utilisation d&#8217;un mod&#232;le de langage,
appris sur des corpus MSA. Un tel mod&#232;le de langage permettra de s&#233;lectionner la s&#233;quence de
meilleure probabilit&#233;.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABDILLAHI, N., NOCERA, P. et TORRES-MORENO, J. (2006). Bo&#238;tes &#224; outils tal pour les langues peu
informatis&#233;es : le cas du somali. Actes de JADT, 6:697&#8211;705.
</p>
<p>ALTABBAA, M., AL-ZARAEE, A. et SHUKAIRY, M. (2010). An arabic morphological analyser and
part-of-speech tagger. Actes de JADT, page 50.
</p>
<p>BUCKWALTER, T. (2004). Buckwalter arabic morphological analyser version 2.0. In Linguistic Data
Consortium, University of Pennsylvania. LDC Cat alog No. :LDC2004L02, ISBN 1-58563-324-0.
</p>
<p>DHOUIB, E. (2007). El makki w zakiyya. Maison d&#8217;&#233;dition manshuwrat manara, Tunis.
</p>
<p>FERGUSON, C. (1959). Diglossia. Word, 15(2).
</p>
<p>HABASH, N. et RAMBOW, O. (2006). Magead : a morphological analyzer and generator for the
arabic dialects. In Proceedings of the 21st International Conference on Computational Linguistics
and the 44th annual meeting of the Association for Computational Linguistics, pages 681&#8211;688.
Association for Computational Linguistics.
</p>
<p>HABASH, N., RAMBOW, O. et KIRAZ, G. (2005). Morphological analysis and generation for arabic
dialects. In Proceedings of the ACL Workshop on Computational Approaches to Semitic Languages,
pages 17&#8211;24. Association for Computational Linguistics.
</p>
<p>KIRAZ, G. (2000). Multitiered nonlinear morphology using multitape finite automata : a case
study on syriac and arabic. Computational Linguistics, 26(1):77&#8211;105.
</p>
<p>MAAMOURI, M., BIES, A., BUCKWALTER, T. et MEKKI, W. (2004). The penn arabic treebank :
Building a large-scale annotated arabic corpus. In NEMLAR Conference on Arabic Language
Resources and Tools, pages 102&#8211;109.
</p>
<p>MEJRI, S., MOSBAH, S. et SFAR, I. (2009). Pluringuisme et diglossie en tunisie. Synergies Tunisie
n 1, pages 53&#8211;74.
</p>
<p>OUERHANI, B. (2009). Interf&#233;rence entre le dialectal et le litt&#233;ral en tunisie : Le cas de la
morphologie verbale. Synergies Tunisie n 1, pages 75&#8211;84.
</p>
<p>SCHERRER, Y. et al. (2009). Un syst&#232;me de traduction automatique param&#233;tr&#233; par des atlas
dialectologiques. Actes de TALN.
</p>
<p>SENG, S. (2010). Vers une mod&#233;lisation statistique multi-niveau du langage, application aux
langues peu dot&#233;es. Th&#232;se de doctorat, Universit&#233; de Grenoble.
</p>
<p>SHAALAN, K., BAKR, H. et ZIEDAN, I. (2007). Transferring egyptian colloquial dialect into modern
standard arabic. In International Conference on Recent Advances in Natural Language Processing
(RANLP&#8211;2007), Borovets, Bulgaria, pages 525&#8211;529.
</p>
<p>SMR&#381;, O. (2007). Elixirfm : implementation of functional arabic morphology. In Proceedings
of the 2007 Workshop on Computational Approaches to Semitic Languages : Common Issues and
Resources, pages 1&#8211;8. Association for Computational Linguistics.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>406 c&#65535; ATALA</p>

</div></div>
</body></html>