<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;tection de zones parall&#232;les &#224; l&#8217;int&#233;rieur de multi-documents pour l&#8217;alignement multilingue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;tection de zones parall&#232;les &#224; l&#8217;int&#233;rieur de
multi-documents pour l&#8217;alignement multilingue
</p>
<p>Charlotte Lecluze1, Romain Brixtel1, Lo&#239;s Rigouste, Emmanuel Giguet1,
R&#233;gis Clouard1,3, Ga&#235;l Lejeune1 et Patrick Constant2
</p>
<p>(1) GREYC - CNRS UMR 6072 - Universit&#233; de Caen Basse-Normandie, Caen, France
(2) Pertimm, Asni&#232;res-sur-Seine, France
</p>
<p>(3) EnsiCaen, Ecole Nationale Sup&#233;rieure d&#8217;Ing&#233;nieurs de Caen, France
prenom.nom@unicaen.fr, prenom.nom@pertimm.com,
</p>
<p>prenom.nom@ensicaen.fr
</p>
<p>R&#201;SUM&#201;
Cet article aborde une question centrale de l&#8217;alignement automatique, celle du diagnostic
de parall&#233;lisme des documents &#224; aligner. Les recherches en la mati&#232;re se sont jusqu&#8217;alors
concentr&#233;es sur l&#8217;analyse de documents parall&#232;les par nature : corpus de textes r&#233;glementaires,
documents techniques ou phrases isol&#233;es. Les ph&#233;nom&#232;nes d&#8217;inversions et de suppressions/ajouts
pouvant exister entre les diff&#233;rentes versions d&#8217;un document sont ainsi souvent ignor&#233;es. Nous
proposons donc une m&#233;thode pour diagnostiquer en contexte des zones parall&#232;les &#224; l&#8217;int&#233;rieur
des documents. Cette m&#233;thode permet la d&#233;tection d&#8217;inversions ou de suppressions entre les
documents &#224; aligner. Elle repose sur l&#8217;affranchissement de la notion de mot et de phrase, ainsi
que sur la prise en compte de la Mise en Forme Mat&#233;rielle du texte (MFM). Sa mise en &#339;uvre est
bas&#233;e sur des similitudes de r&#233;partition de cha&#238;nes de caract&#232;res r&#233;p&#233;t&#233;es dans les diff&#233;rents
documents. Ces r&#233;partitions sont repr&#233;sent&#233;es sous forme de matrices et l&#8217;identification des
zones parall&#232;les est effectu&#233;e &#224; l&#8217;aide de m&#233;thodes de traitement d&#8217;image.
</p>
<p>ABSTRACT
Parallel areas detection in multi-documents for multilingual alignment
</p>
<p>This article broaches a central issue of the automatic alignment : diagnosing the parallelism of
documents. Previous research was concentrated on the analysis of documents which are parallel
by nature such as corpus of regulations, technical documents or simple sentences. Inversions and
deletions/additions phenomena that may exist between different versions of a document has
often been overlooked. To the contrary, we propose a method to diagnose in context the parallel
areas allowing the detection of deletions or inversions between documents to align. This original
method is based on the freeing from word and sentence as well as the consideration of the text
formatting. The implementation is based on the detection of repeated character strings and the
identification of parallel segments by image processing.
</p>
<p>MOTS-CL&#201;S : d&#233;tection et alignement de zones, appariement de N-grammes de caract&#232;res,
corpus de multidocuments.
</p>
<p>KEYWORDS: area detection and alignment, character N-grams matching, multidocuments
corpora.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>381 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Notre travail se situe dans le domaine de l&#8217;alignement, c&#8217;est-&#224;-dire de la mise en correspondance
d&#8217;&#233;l&#233;ments textuels s&#233;mantiquement &#233;quivalents entre des documents en relation de traduction.
Nous appelons cet ensemble de documents un multidocument et chacun des documents qui
le composent des volets 1. L&#8217;op&#233;ration traduisante r&#233;alis&#233;e par le traducteur humain vise &#224;
interpr&#233;ter le sens d&#8217;un document donn&#233; dans la langue source et &#224; produire un document
s&#233;mantiquement &#233;quivalent dans une ou plusieurs langues cibles. Cette op&#233;ration peut donner
lieu &#224; des modifications dans l&#8217;organisation interne des diff&#233;rents volets d&#8217;un multidocument. Dans
l&#8217;&#233;tat de l&#8217;art, cette question a &#233;t&#233; principalement trait&#233;e au niveau microscopique : ordre des mots
dans la phrase, permutation ou suppression de phrases. Dans cet article, nous nous int&#233;ressons
au contraire aux diff&#233;rences au niveau macroscopique. Nous &#233;tudions plus particuli&#232;rement les
ph&#233;nom&#232;nes d&#8217;inversion et de suppression/ajout qui rendent asynchrones certains documents
traduits. Ces documents ne sont pas alignables par des techniques classiques. La figure 1 pr&#233;sente
deux cas de traductions dans le m&#234;me multidocument 2.
</p>
<p>Volet fran&#231;ais
Allemagne - six projets
[...]
Belgique - deux projets
[...]
Danemark - six projets
[...]
Espagne - seize projets
[...]
Estonie - un projet
[...]
Finlande - deux projets
[...]
Royaume-unis - dix projets
[...]
</p>
<p>Volet anglais
Belgium - 2 projects
[...]
Denmark - 6 projects
[...]
Estonia - 1 project
[...]
Finland - 2 projects
[...]
Germany - 6 projects
[...]
Spain - 16 projects
[...]
United Kingdom - 10 projets
[...]
</p>
<p>Volet allemand
Belgien - zwei Projekte
[...]
D&#228;nemark - sechs Projekte
[...]
Estland - ein Projekte
[...]
Finnland - swei Projekte
[...]
Deutschland - sechs Projekte
[...]
Spanien - 16 Projekte
[...]
Vereinigtes K&#246;nigreich - zehn Projekte
[...]
</p>
<p>&#65535;
&#10056;
&#10056;
&#10056;
&#10056;
&#10056;
&#10056;
&#10056;
&#10056;
&#10056;&#10056;
</p>
<p>&#65535; &#65535;
&#65535; &#65535;
&#65535;
&#10054;
&#10054;
&#10054;
&#10054;&#10054;
</p>
<p>&#65535;&#9985;&#9985;&#9985;
&#9985;&#9985;
</p>
<p>&#65535;&#9985;&#9985;&#9985;
&#9985;&#9985;
</p>
<p>&#65535;
</p>
<p>&#65535;
&#65535;
&#65535;
&#65535;
&#65535;
&#65535;
&#65535;
</p>
<p>&#65535; &#65535;
&#65535; &#65535;
&#65535; &#65535;
&#65535; &#65535;
&#65535; &#65535;
&#65535; &#65535;
&#65535; &#65535;
</p>
<p>FIGURE 1 &#8211; Inversion et maintien de l&#8217;ordre entre les diff&#233;rents volets d&#8217;un multidocument
</p>
<p>&#192; gauche, la figure 1 pr&#233;sente un bi-document asynchrone avec inversion massive de plusieurs
zones de textes entre les volets fran&#231;ais et anglais (et par cons&#233;quent allemand) du m&#234;me
multidocument. &#192; droite, l&#8217;alignement entre les volets allemand et anglais t&#233;moigne d&#8217;une
traduction synchrone, tout est l&#224; et dans le m&#234;me ordre. Dans le premier cas, nous consid&#233;rons
qu&#8217;il existe deux zones parall&#232;les, correspondant dans chaque langue au volet dans son ensemble.
Dans le second cas, le contenu s&#233;mantique est le m&#234;me, mais l&#8217;ordre des diff&#233;rentes zones
de texte n&#8217;est pas conserv&#233;, la traduction est asynchrone Nous consid&#233;rons alors qu&#8217;il existe
plusieurs zones entre lesquelles on recherche le parall&#233;lisme. Dans la figure 1, les paragraphes
sont tri&#233;s par ordre alphab&#233;tique ce qui provoque des diff&#233;rences d&#8217;ordre selon les langues. Des
cas de suppression de zones de textes entre deux volets peuvent &#233;galement &#234;tre observ&#233;s. Ces
</p>
<p>1. Un bi-document est ainsi un cas particulier de multidocument contenant deux volets.
2. Communiqu&#233; de presse IP/05/1157 de l&#8217;Union Europ&#233;enne. Les paragraphes sont tri&#233;s par ordre alphab&#233;tique.
</p>
<p>Nous utilisons les [. . .] pour symboliser le contenu d&#8217;un paragraphe dont nous conservons ici seulement le d&#233;but.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>382 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ph&#233;nom&#232;nes d&#8217;inversion et de suppression constituent les principaux obstacles aux m&#233;thodes
d&#8217;alignement qui reposent sur une hypoth&#232;se de parall&#233;lisme. Notre m&#233;thode s&#8217;attaque au
probl&#232;me de la d&#233;tection en contexte du parall&#233;lisme, suivant la hi&#233;rarchie de grain : document
&#8594; zone&#8594; segment&#8594; N-grammes de caract&#232;res 3. Notre objectif est de rechercher et d&#8217;aligner
les zones qui maximisent le parall&#233;lisme &#224; l&#8217;int&#233;rieur de chaque bi-document : les multizones.
Pour ce faire, nous proposons des outils de diagnostic de parall&#233;lisme afin de d&#233;terminer si un
bi-document est synchrone, asynchrone avec suppression ou inversion. Notre m&#233;thode comprend
quatre &#233;tapes :
</p>
<p>Appariement : recherche des correspondances multilingues de N-grammes de caract&#232;res &#224; partir
d&#8217;une collection de multidocuments.
</p>
<p>Calcul de similarit&#233; : comparaison des segments de textes de niveaux sup&#233;rieurs et repr&#233;senta-
tion sous forme de matrices de points (dotplots).
</p>
<p>Analyse : d&#233;tection des zones similaires entre deux volets, les bizones.
Diagnostic : qualification de la nature du parall&#233;lisme entre deux documents.
</p>
<p>Plusieurs courants existent dans le domaine de l&#8217;alignement. Ils se distinguent notamment par le
grain qu&#8217;ils proposent d&#8217;aligner : mots, phrases, paragraphes ou sections. Nous consacrons donc
la section 2 &#224; un rappel des principales m&#233;thodes d&#8217;alignement propos&#233;es &#224; ce jour, avant de
pr&#233;senter le positionnement de nos travaux dans la section 3. Dans la section 4, nous d&#233;crivons
les quatre &#233;tapes de notre m&#233;thode. Enfin, dans la section 5, nous pr&#233;sentons nos r&#233;sultats en
mati&#232;re de diagnostic de parall&#233;lisme et d&#8217;alignement automatique de zones &#224; partir de ces
matrices.
</p>
<p>2 Contexte
</p>
<p>Les m&#233;thodes d&#8217;alignement sous-phrastique appliqu&#233;es &#224; des phrases align&#233;es, si diverses soient-
elles, trouvent toutes leur limite dans le fait qu&#8217;elles pr&#233;supposent la disponibilit&#233; de corpus
pr&#233;alablement align&#233;s en phrases (HANSARD, BTEC. . .). De tels corpus sont cependant peu nom-
breux et couvrent peu de langues. Des corpus o&#249; le grain align&#233; est plus gros (souvent le
document) sont en revanche disponibles pour un tr&#232;s grand nombre de langues. Ils laissent
r&#233;ellement envisager la pratique d&#8217;op&#233;rations de r&#233;tro-ing&#233;nierie massives et peu supervis&#233;es sur
ces documents issus du travail du traducteur humain. Ces pratiques permettent d&#8217;extraire des
informations linguistiques et des ressources lexicales pouvant &#234;tre utiles tant aux traducteurs,
qu&#8217;aux lexicographes, aux linguistes ou aux terminologues.
</p>
<p>Plusieurs m&#233;thodes d&#8217;alignement sous-phrastique &#224; partir de documents non pr&#233;alablement
align&#233;s en phrases ont &#233;t&#233; propos&#233;es (Simard et al., 1993; Church, 1993; Dagan et al., 1993). Les
auteurs &#233;tablissent un lien entre la similitude de graphie et la similitude de sens (cognats). Ces
cognats servent de point d&#8217;ancrage pour un alignement de texte. N&#233;anmoins, si ces similitudes
sont fr&#233;quentes au sein d&#8217;une m&#234;me famille de langues, elles s&#8217;av&#232;rent plus rares entre les langues
de familles diff&#233;rentes. Le probl&#232;me existe &#233;galement pour des langues ne partageant pas le m&#234;me
syst&#232;me d&#8217;&#233;criture. En outre, ces m&#233;thodes reposent sur l&#8217;hypoth&#232;se centrale de parall&#233;lisme
(Melamed, 1997; Simard &amp; Plamondon, 1996). Or, cette hypoth&#232;se r&#233;duit consid&#233;rablement le
champ d&#8217;application des m&#233;thodes d&#8217;alignement sous-phrastique.
</p>
<p>3. Nous utilisons N de fa&#231;on g&#233;n&#233;rique, sa valeur n&#8217;&#233;tant pas pr&#233;d&#233;finie.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>383 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#192; travers le syst&#232;me K-vec, Fung &amp; Church (1994) ont propos&#233; une m&#233;thode d&#8217;alignement de
documents bas&#233;e sur une similarit&#233; de r&#233;partition de mots. L&#8217;id&#233;e de K-vec est de d&#233;couper chacun
des deux volets en portions &#233;gales (K-segments) et d&#8217;affecter &#224; chaque mot de chaque texte, un
vecteur avec K dimensions (K-vec). K-vec fait l&#8217;hypoth&#232;se que si deux mots sont traductions l&#8217;un
de l&#8217;autre, ils apparaissent dans les m&#234;mes segments que deux mots qui ne le sont pas. K-vec
semble &#234;tre le premier syst&#232;me sans pr&#233;suppos&#233; sur la pr&#233;sence de cognats ou les limites de
phrases. Cependant, les syst&#232;mes reposant sur la similitude de r&#233;partition de mots se heurtent &#224; la
nature flexionnelle de certaines langues, un m&#234;me mot pouvant alors recouvrir plusieurs formes
selon sa fonction dans la phrase. En outre, K-vec suppose la lin&#233;arit&#233; de la traduction entre les
volets, ce qui n&#8217;est pas toujours le cas, notamment sur les paires de textes en langues asiatiques
ou en langues de la famille indo-europ&#233;enne trait&#233;es par les auteurs. Enfin, des ph&#233;nom&#232;nes
d&#8217;ajouts/suppressions peuvent &#233;galement interf&#233;rer. Pour de meilleurs r&#233;sultats, Fung &amp; Mckeown
(1994) ont impl&#233;ment&#233; Dynamique de K-vec (DK-vec) qui produit un petit dictionnaire dont les
entr&#233;es sont utilis&#233;es comme des ancres pour l&#8217;alignement.
</p>
<p>(Bourdaillet &amp; Ganascia, 2007) abordent la question de l&#8217;alignement monolingue de textes com-
prenant des d&#233;placements. Plus pr&#233;cis&#233;ment l&#8217;&#233;tude porte sur les diff&#233;rentes versions laiss&#233;es par
un &#233;crivain d&#8217;une de ses &#339;uvres, c&#8217;est-&#224;-dire les brouillons successifs. Aligner en monolingue ces
r&#233;&#233;critures revient &#224; calculer une distance d&#8217;&#233;dition avec d&#233;placements. En effet, les trois op&#233;rateurs
de la distance de Levenshtein (insertions, suppressions et remplacements) ne suffisent alors pas
&#224; d&#233;crire les ph&#233;nom&#232;nes potentiellement observables. Ces travaux constituent une amorce de
recherche sur la question d&#8217;une m&#233;thode d&#8217;alignement prenant en charge les d&#233;placements de
portions de texte entre deux volets d&#8217;un bi-document. Cependant, la t&#226;che se trouve grandement
simplifi&#233;e par son contexte monolingue. L&#8217;hypoth&#232;se qu&#8217;une m&#234;me graphie recouvre le m&#234;me
sens dans les deux versions est directement exploitable et la multiplication des hapax simplifie la
t&#226;che.
</p>
<p>Enfin, plusieurs de ces auteurs ont propos&#233; de reporter sur des matrices de points (dotplots)
les appariements ainsi r&#233;v&#233;l&#233;s (Church &amp; Helfman, 1993). Le probl&#232;me de l&#8217;alignement est
ainsi transform&#233; en un probl&#232;me de traitement d&#8217;image (Chang &amp; Chen, 1997). Notons que des
hypoth&#232;ses similaires ont &#233;t&#233; exploit&#233;es pour la d&#233;tection de plagiat (Brixtel et al., 2010).
</p>
<p>3 Positionnement
</p>
<p>Les travaux que nous pr&#233;sentons se situent dans la lign&#233;e des travaux d&#8217;alignement de documents
pr&#233;c&#233;demment cit&#233;s. Nous utilisons &#233;galement des dotplots pour diagnostiquer si la traduction est
globalement litt&#233;rale entre deux volets. Nos travaux se distinguent n&#233;anmoins par la granularit&#233;
choisie pour amorcer le traitement des documents. Comme Cromi&#232;res (2006) et Mcnamee &amp;
Mayfield (2004), nous nous int&#233;ressons aux N-grammes de caract&#232;res r&#233;p&#233;t&#233;s, mieux &#224; m&#234;me
de r&#233;v&#233;ler des similitudes &#224; la fois monolingues et multilingues (Lecluze, 2011). Nous &#233;tendons
cependant la port&#233;e de la m&#233;thode en l&#8217;appliquant aussi bien au contenu textuel qu&#8217;&#224; la Mise
en Forme Mat&#233;rielle (MFM) (Brixtel, 2011).
</p>
<p>Le corpus que nous utilisons est constitu&#233; de communiqu&#233;s de presse de l&#8217;Union Europ&#233;enne 4 au
format HTML. Nous pr&#233;sentons des r&#233;sultats sur 6 couples de langues : fran&#231;ais-espagnol (fr,es),
fran&#231;ais-grec (fr,el), fran&#231;ais-finnois (fr,fi), fran&#231;ais-anglais (fr,en), fran&#231;ais-allemand (fr,de) et
</p>
<p>4. Ces communiqu&#233;s sont disponibles sur le site Europa, le portail de l&#8217;Union Europ&#233;enne : http://europa.eu/.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>384 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>fran&#231;ais-danois (fr,da). Ces couples repr&#233;sentent un &#233;chantillon de familles de langues proches et
&#233;loign&#233;es. Nous supposons en effet que plus les langues sont g&#233;n&#233;tiquement &#233;loign&#233;es, plus il
sera difficile de les rapprocher d&#8217;un point de vue strictement lexical. Nous introduisons &#233;galement
le grec pour attester que notre m&#233;thode est robuste &#224; l&#8217;absence de similitudes de graphie.
</p>
<p>4 M&#233;thodes d&#8217;appariement et de d&#233;tection de parall&#233;lisme
</p>
<p>4.1 Appariement multilingue de N-grammes de caract&#232;res
</p>
<p>Notre travail se situe dans la lign&#233;e de ceux de Cromi&#232;res (2006), nous proc&#233;dons &#224; une recherche
de N-grammes de caract&#232;res r&#233;p&#233;t&#233;s en contexte, des populations. Les populations sont d&#233;duites
d&#8217;un tableau de suffixes. Elles sont obtenues en calculant des motifs sans trou tels que d&#233;crits
par (Ukkonen, 2009) 5. Ces cha&#238;nes poss&#232;dent les caract&#233;ristiques suivantes :
</p>
<p>r&#233;p&#233;t&#233;es : les cha&#238;nes ont un effectif de 2 ou plus ;
</p>
<p>maximales : les cha&#238;nes ne peuvent &#234;tre &#233;tendues &#224; gauche ou &#224; droite sans perdre
une occurrence.
</p>
<p>L&#8217;int&#233;r&#234;t de ces cha&#238;nes est double : r&#233;v&#233;ler des facteurs communs monolingues au del&#224; des mots
graphiques et mettre en &#233;vidence des correspondances multilingues.
</p>
<p>LANGUE MOTS GRAPHIQUES SIGNIFIANT &#171; TRANSPORT &#187;
ET LEUR EFFECTIF
</p>
<p>fr transports (3), transport (3)
es transporte (5), transportes (1)
el &#65535;&#949;&#964;&#945;&#966;&#959;&#961;&#974;&#957; (3), &#65535;&#949;&#964;&#945;&#966;&#959;&#961;&#941;&#945;&#962; (1), &#65535;&#949;&#964;&#945;&#966;&#959;&#961;&#941;&#962; (1), &#65535;&#949;&#964;&#945;&#966;&#959;&#961;&#941;&#945; (1)
</p>
<p>TABLE 1 &#8211; Liste des mots graphiques signifiant &#171; transport &#187; dans un &#233;chantillon de textes en
fran&#231;ais, espagnol et grec ainsi que leurs effectifs entre parenth&#232;ses.
</p>
<p>Ici, comme en t&#233;moigne le tableau 1, les &#233;carts d&#8217;effectifs entre des mots align&#233;s dans un
&#233;chantillon sont d&#233;j&#224; consid&#233;rables. Or si l&#8217;on s&#8217;int&#233;resse d&#233;sormais aux r&#233;p&#233;titions de cha&#238;nes de
caract&#232;res, il existe dans chaque langue une sous-cha&#238;ne commune &#224; l&#8217;ensemble des &#233;quivalents
s&#233;mantiques de &#171; transport &#187;.
</p>
<p>LANGUE CHA&#206;NES DE CARACT&#200;RES R&#201;P&#201;T&#201;ES EFFECTIF
SIGNIFIANT &#171; TRANSPORT &#187;
</p>
<p>fr transport- (3+3) 6
es transporte- (5+1) 6
el &#65535;&#949;&#964;&#945;&#966;&#959;&#961;- (3+1+1+1) 6
</p>
<p>TABLE 2 &#8211; Cha&#238;nes de caract&#232;res r&#233;p&#233;t&#233;es maximales communes aux mots signifiant &#171; transport &#187;
dans le m&#234;me &#233;chantillon de textes (fr, es et el) et leur effectif respectif.
</p>
<p>Notre m&#233;thode consiste &#224; obtenir de fa&#231;on endog&#232;ne et ind&#233;pendante des langues une s&#233;rie de
points d&#8217;ancrage entre deux volets : des appariements. Un appariement est une correspondance
s&#233;mantique fortement g&#233;n&#233;ralis&#233;e telle qu&#8217;on en trouve par exemple dans un dictionnaire. Par
</p>
<p>5. Les outils permettant le calcul de ces cha&#238;nes sont disponibles ici : https://code.google.com/p/
py-rstr-max/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>385 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>extension, l&#8217;appariement en tant que m&#233;thode est la mise en correspondance de cha&#238;nes de
caract&#232;res r&#233;p&#233;t&#233;es entre des multidocuments : des populations. Nous utilisons la similitude de
r&#233;partition de ces cha&#238;nes (effectifs et positions dans la collection).
</p>
<p>Ainsi, nous calculons les appariements entre cha&#238;nes de caract&#232;res de langues diff&#233;rentes, en
prenant en compte des similitudes de r&#233;partitions sur l&#8217;ensemble des bi-documents de la collection.
Les collections que nous constituons sont compos&#233;es de 40 multidocuments chacune. Un exemple
de r&#233;partition pour deux N-grammes de caract&#232;res est donn&#233; sur le tableau 3.
</p>
<p>langue N-gramme effectif corpus effectif par multidocument
doc0 doc1 [. . .] doc199
</p>
<p>el &#8217;_&#945;&#949;&#961;&#959;&#955;&#953;&#65535;&#941;&#957;&#8217; (23) 4 2 [. . .] 3
fr &#8217;a&#233;roports&#8217; (21) 4 2 [. . .] 2
</p>
<p>TABLE 3 &#8211; Exemple de r&#233;partitions de deux N-grammes de caract&#232;res grec et fran&#231;ais. Les espaces
blancs sont repr&#233;sent&#233;s par le caract&#232;re &#171; _ &#187;.
</p>
<p>Afin de limiter l&#8217;explosion combinatoire induite par une comparaison exhaustive de toutes les
cha&#238;nes r&#233;p&#233;t&#233;es maximales, nous comparons simplement les cha&#238;nes d&#8217;effectifs proches. Nous
utilisons une distance L1 normalis&#233;e. Cela consiste &#224; faire pour deux N-grammes de caract&#232;res
(s1 et s2) de deux langues diff&#233;rentes, le rapport entre la somme des diff&#233;rences d&#8217;effectifs par
document et la somme des effectifs des deux N-grammes dans la collection de bi-documents dans
ces langues soit :
</p>
<p>distance(s1,s2) =
&#65535;
</p>
<p>doc |e f f ec t i f (s1,doc)&#8722;e f f ec t i f (s2,doc)|
e f f ec t i f _corpus(s1)+e f f ec t i f _corpus(s2)
</p>
<p>Ce calcul de distance permet de produire des appariements de populations de N-grammes de
caract&#232;res avec une distance situ&#233;e dans [0,1]. Une distance de 0 signifie que deux N-grammes
ont des r&#233;partitions identiques dans le corpus. C&#8217;est &#224; partir des distances entre N-grammes
que nous calculons des similarit&#233;s entre les segments les contenant. Cette distance permet de
calculer des correspondances fortement g&#233;n&#233;ralis&#233;es dans une collection de multidocuments
ou multizones. Elle rend le traitement insensible aux diff&#233;rences d&#8217;ordres entre les volets et aux
suppressions locales de zones de textes. Nous donnons quelques exemples d&#8217;appariements ainsi
calcul&#233;s dans la figure 2.
</p>
<p>Les appariements obtenus lors de la premi&#232;re &#233;tape du processus servent &#224; calculer la similarit&#233;
entre des paires de segments d&#8217;une taille arbitraire fix&#233;e &#224; 1% de la taille des volets d&#8217;origine.
Dans notre hi&#233;rarchie de grain, ces segments correspondent au grain inf&#233;rieur aux zones que
nous cherchons &#224; construire.
</p>
<p>4.2 Calcul de la similarit&#233; entre les segments d&#8217;un bi-document
</p>
<p>Tout d&#8217;abord, nous introduisons quelques d&#233;finitions sur les segments que nous traitons. Soit &#931;
un alphabet. Un document est un &#233;l&#233;ment de &#931;&#8727;. Un segment est une sous-partie d&#8217;un document
que nous exprimons relativement &#224; la taille du document. Ainsi, le segment (d,(3,4),(0,1))
est l&#8217;ensemble des caract&#232;res d&#233;butant &#224; la position 3,4 et de longueur 0,1. Ces positions sont
exprim&#233;es en pourcentage par rapport &#224; la taille |d| du document. La segmentation obtenue pour
un document d1 est not&#233;e S1 = (s11,. . . ,s
</p>
<p>1
n). Nous segmentons nos documents en 200 segments
</p>
<p>correspondant &#224; 1% de texte. Ces segments se chevauchent donc, et pour la m&#234;me segmentation
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>386 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>distance : 0.000
fr &#8217; l&#8217;enseignement&#8217; (4) : 4, 4, 31, 31
en &#8217; teaching&#8217; (4) : 4, 4, 31, 31
</p>
<p>distance : 0.000
fr &#8217;ette ann&#233;e, la &#8217; (4) : 4, 7, 21, 34
en &#8217; year, th&#8217; (4) : 4, 7, 21, 34
</p>
<p>distance : 0.000
fr &#8217;es chiffres &#8217; (4) : 3, 15, 24, 26
en &#8217; figures &#8217; (4) : 3, 15, 24, 26
</p>
<p>distance : 0.000
de &#8217; the obligation &#8217; (2) : 53, 53
es &#8217; Member States to &#8217; (2) : 53, 53
</p>
<p>distance : 0.000
de &#8217;&gt; &lt;p&gt; &lt;/p&gt; &lt;p&gt; C&#8217; (2) : 53, 53
es &#8217; de las compa&#241;&#237;as &#8217; (2) : 53, 53
</p>
<p>distance : 0.053
el &#8217; &quot;&gt;&lt;/a&gt;&lt;b&gt;H E &#8217; (9) : 48, 45, 50, 68, 71, 72, 73,77, 79
fr &#8217; &quot;&gt;&lt;/a&gt;&lt;b&gt;L &#8217; (10) : 48, 45, 50, 68, 71, 72, 73, 77, 78, 79
</p>
<p>distance : 0.053
el &#8217; &#960;&#945;&#967;&#965;&#963;&#945;&#961;&#954;&#943;&#945;&#962;&#8217; (9) : 56, 56, 56, 56, 56, 56, 56, 56, 56
fr &#8221;ob&#233;sit&#233; &#8217; (10) :56, 56, 56, 56, 56, 56, 56, 56, 56, 56
</p>
<p>distance : 0.064
fr &#8217; Parlement &#8217; (25) : 1, 2, 2, 2, 2, 5, 6, 7, 7, 7, 7, 7, 7, 12, 16, 16, 17, 17, 17, 19, 19, 19, 21, 27, 34
en &#8217; European Parliament&#8217; (22) : 1, 2, 2, 5, 6, 7, 7, 7, 7, 7, 7, 12, 16, 16, 17, 17, 17, 19, 19, 19, 21, 27
</p>
<p>distance : 0.080
fr &#8217;s a&#233;r&#8217; (26) : 2, 7, 7, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 17
en &#8217; airp&#8217; (24) : 7, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10
</p>
<p>FIGURE 2 &#8211; Appariements de populations de cha&#238;nes de caract&#232;res r&#233;p&#233;t&#233;es dans la collection.
Chaque groupe de 3 lignes pr&#233;sente : ligne 1, la distance qui a &#233;t&#233; calcul&#233;e entre deux cha&#238;nes
de caract&#232;res sur la collection, lignes 2 et 3, respectivement pour la cha&#238;ne 1 et la cha&#238;ne 2 : la
langue, la &#8217;cha&#238;ne&#8217;, son (effectif dans la collection) et la liste des identifiants de multidocument
dans lesquels elle appara&#238;t.
</p>
<p>appliqu&#233;e sur deux documents d1 et d2 d&#8217;un bi-document, S1 = (s11,. . . ,s
1
n) et S2 = (s
</p>
<p>2
1,. . . ,s
</p>
<p>2
n) nous
</p>
<p>obtenons une matrice de similarit&#233;&#65535; (d1,d2) de taille n&#215;n.
C&#8217;est en fonction de la r&#233;partition des segments similaires sur toute la matrice &#65535; (d1,d2) que
nous jugeons du parall&#233;lisme entre deux documents d1 et d2. Pour ce faire, nous d&#233;finissons la
similarit&#233; entre deux segments i &#8712; S1 et j &#8712; S2 via la fonction suivante :&#65535; (d1,d2)(i, j) = nb_l iens(i, j)max_l iens(i)
nb_l iens(i, j) repr&#233;sente le nombre d&#8217;appariements ayant une distance inf&#233;rieure &#224; 0,1 mettant
en jeu des N-grammes de caract&#232;res inclus dans les segments i et j. max_l iens(i) repr&#233;sente le
nombre de liens maximum entre le segment i et tous les segments de S2 (Tableau 4).
</p>
<p>Segments(S2) [0] [0.05] [0.1] [0.15] [0.2] [. . .] [0.75] [0.8] [0.85] [0.90] [0.95]
Nombre de liens 14 3 0 0 0 . . . 0 0 2 0 0
</p>
<p>TABLE 4 &#8211; Illustration de max_l iens(i), max_l iens vaut ici 14, le maximum sur la ligne
</p>
<p>Dans la mesure o&#249; nous ne supposons pas de parall&#233;lisme initial, nous consid&#233;rons l&#8217;ensemble
des liens possibles entre les occurrences des N-grammes appari&#233;s sans nous focaliser sur un
espace de recherche pr&#233;cis.
</p>
<p>4.3 Repr&#233;sentation en deux dimensions de la similarit&#233; de deux volets
</p>
<p>Les figures 3, 4 et 5 donnent des exemples de matrices &#65535; (d1,d2)(i, j) repr&#233;sent&#233;es en image en
niveau de gris. Une similarit&#233; maximale est repr&#233;sent&#233;e par un pixel noir. Plus un pixel est clair,
plus les segments associ&#233;s sont diff&#233;rents selon notre fonction de similarit&#233;. Ainsi, quand deux
documents sont traduits de fa&#231;on globalement litt&#233;rale, une diagonale se dessine de l&#8217;angle
sup&#233;rieur gauche &#224; l&#8217;angle inf&#233;rieur droit de la matrice (figure 3). Une diagonale cass&#233;e signifie
l&#8217;existence d&#8217;inversions dans l&#8217;ordre de la traduction (figure 4).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>387 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>es-fr en-fr da-de
</p>
<p>de-fr el-fr fi-fr
</p>
<p>FIGURE 3 &#8211; Cas de volets synchrones (communiqu&#233; de presse IP/05/1156). L&#8217;ordre de traduction
est globalement conserv&#233;, on observe une diagonale au centre de la matrice.
</p>
<p>es-fr en-fr de-fr
</p>
<p>el-fr fi-fr
</p>
<p>FIGURE 4 &#8211; Cas de volets avec inversion (communiqu&#233; IP/05/1157). L&#8217;ordre de la traduction
est massivement invers&#233;. La diagonale est &#171; &#233;clat&#233;e &#187; en plusieurs segments de droites. (Pas de
matrice da-fr, puisque le bi-document da-fr est synchrone).
</p>
<p>en-fr es-fr
</p>
<p>FIGURE 5 &#8211; Volets avec suppression (communiqu&#233;s de presse IP/05/473 et IP/05/1558). On
observe plusieurs segments de droites &#224; l&#8217;int&#233;rieur de la matrice ayant des angles diff&#233;rents de
celui de la premi&#232;re diagonale.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>388 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>es-fr en-fr de-fr
</p>
<p>el-fr fi-fr
</p>
<p>FIGURE 6 &#8211; D&#233;tection de segments de droites sur des cas de volets avec inversion. Il n&#8217;y a pas de
matrice da-fr puisque le bi-document da-fr est synchrone.
</p>
<p>Nous pouvons constater que pour un m&#234;me jeu de param&#232;tres pour tous les couples de langues,
les r&#233;sultats se d&#233;gradent &#224; mesure de l&#8217;&#233;loignement g&#233;n&#233;tique des langues. La visibilit&#233; des
droites et des segments de droite dans les figures 3 et 4 se d&#233;grade entre la ligne 1 et la ligne 2. Le
couple fran&#231;ais-grec montre que la m&#233;thode s&#8217;accommode de diff&#233;rences morphologiques (pas de
n&#233;cessit&#233; d&#8217;avoir des cognats). Les r&#233;sultats sur ce couple sont proches de ceux du couple fran&#231;ais-
espagnol. En revanche, les r&#233;sultats sur le couple fran&#231;ais-finnois sont moins nets. L&#8217;analyse au
niveau des caract&#232;res n&#8217;a pas permis de pallier totalement les diff&#233;rences sur le concept de mot
entre ces deux langues. La diff&#233;rence de richesse lexicale entre ces langues joue pour beaucoup
dans nos r&#233;sultats. Le finnois fait un faible usage de la synonymie, comparativement au fran&#231;ais
par exemple, ce qui donne lieu &#224; des diff&#233;rences de distributions cons&#233;quentes entre des unit&#233;s
pourtant s&#233;mantiquement &#233;quivalents. Celles-ci sont difficiles &#224; appr&#233;hender au grain document
et &#224; calculer &#224; partir d&#8217;une collection. Cette hypoth&#232;se devra &#234;tre v&#233;rifi&#233;e en comparant des
langues plus proches ou de fa&#231;on plus g&#233;n&#233;rale en comparant davantage de couples. Ainsi, les
diff&#233;rents ph&#233;nom&#232;nes linguistiques interf&#233;rant dans les r&#233;sultats pourront &#234;tre appr&#233;cier plus
finement. La recherche des bons param&#232;tres pour chaque couple de langue pourra mettre en
&#233;vidence des similarit&#233;s/dissimilarit&#233;s entre famille de langue. &#192; partir de ces r&#233;sultats, nous
nous focalisons sur l&#8217;analyse de l&#8217;image compl&#232;te repr&#233;sentant ces matrices afin de d&#233;tecter si
deux documents sont parall&#232;les ou s&#8217;ils contiennent d&#8217;&#233;ventuelles inversions ou suppressions de
zones de textes.
</p>
<p>4.4 D&#233;tection automatique des segments de droites
</p>
<p>L&#8217;objectif de cette &#233;tape est double : mettre graphiquement en &#233;vidence les segments de droites et
r&#233;cup&#233;rer les informations propres &#224; ces segments (positions, longueurs. . .). Nous calculons ces
segments au moyen de la transform&#233;e de Hough. Ces informations seront utilis&#233;es pour l&#8217;&#233;tape
de diagnostic suivante. Nous pr&#233;sentons dans les figures 6 et 7 des exemples de d&#233;tection sur les
cas de bi-documents asynchrones pr&#233;c&#233;demment expos&#233;s.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>389 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>en-fr es-fr
</p>
<p>FIGURE 7 &#8211; D&#233;tection de segments de droites sur des cas de volets avec suppression.
</p>
<p>4.5 Diagnostic de parall&#233;lisme entre des documents traduits
</p>
<p>Les informations recueillies gr&#226;ce au traitement d&#8217;image sont utilis&#233;es pour &#233;tablir automatique-
ment un diagnostic de parall&#233;lisme. Nous d&#233;finissons quatre diagnostics :
</p>
<p>volets synchrones : pas d&#8217;inversion, ni de suppression de d&#233;tect&#233;e (figure 3).
</p>
<p>matrices ind&#233;finies : l tld &lt;0,2 o&#249; l t est la longueur totale des segments de droite et ld la
longueur de la diagonale.
</p>
<p>volets asynchrones avec inversion : les coordonn&#233;es des segments (en rouge) dans une des
deux dimensions ne se suivent pas (figures 4 et 6).
</p>
<p>volets asynchrones avec suppression : la diff&#233;rence de longueur des projections sur les axes
(en bleu) est sup&#233;rieure &#224; 2,5% (figures 5 et 7).
</p>
<p>4.6 Alignement de zones : retour aux textes
</p>
<p>Les informations recueillies gr&#226;ce au traitement d&#8217;image sont &#233;galement utilis&#233;es pour permettre
le retour aux textes. Nous pr&#233;sentons ici deux exemples : le premier correspond &#224; la matrice en-fr
de la figure 7, le second &#224; la matrice en-fr de la figure 6, ainsi qu&#8217;&#224; la figure 1.
</p>
<p>Alignement de zones sur un bi-document asynchrone avec suppression. Le tableau 5 illustre
un cas de suppression dans un des deux volets, le volet en fran&#231;ais, correspondant &#224; environ un
tiers de la taille du volet en anglais (2120 caract&#232;res). Si la suppression a bien &#233;t&#233; diagnostiqu&#233;e,
l&#8217;alignement de zones n&#8217;est lui que partiellement correct. La multizone 2 correspond exactement
&#224; l&#8217;attendu. Le c&#339;ur des multizones 1 et 3 sont corrects mais les contours restent mal d&#233;finis.
</p>
<p>Alignement de zones sur un bi-document asynchrone avec inversion. Le tableau 6 illustre
un cas de diff&#233;rences d&#8217;ordre entre les zones de textes de deux volets. L&#8217;ordre des pr&#233;sentations
des projets list&#233;s par pays respecte l&#8217;ordre alphab&#233;tique des noms des pays concern&#233;s. Tous les
segments de droites de la matrice ont &#233;t&#233; mis en &#233;vidence, l&#8217;alignement de zones d&#233;coulant des
segments est globalement correct.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>390 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IP/05/473
</p>
<p>fr en
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
1 rtations de textiles chinois &lt;/b&gt; &lt;/h1&gt; &lt;p&gt; &lt;b&gt; &lt;i&gt;
</p>
<p>M. Peter Mandelson, commissaire responsable du commerce,
a annonc&#233; ce jour qu&#8217;il avait d&#233;cid&#233; de demander &#224; la Commi
</p>
<p>&lt;document celex=&quot;IP-05-473&quot; lang=&quot;en&quot;&gt;
&lt;palign=&quot;right&quot;&gt;&lt;b&gt; IP/05/473 &lt;/b&gt; &lt;/p&gt;
&lt;p align=&quot;right&quot;&gt; Brussels, 24 April 2005
</p>
<p>&lt;/p&gt; &lt;h1&gt; &lt;a name=&quot;Heading4&quot;&gt;&lt;/a&gt; &lt;b&gt;
European Commission launch
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
2
</p>
<p>les de sauvegarde. Elle entamera parall&#232;lement des consulta-
tions imm&#233;diates avec la Chine pour tenter de d&#233;gager une
solution satisfaisante. &lt;/i&gt; &lt;/b&gt; &lt;/p&gt; &lt;p&gt; Peter Man-
delson a d&#233;clar&#233; : &#171;Nous venons de recevoir les statistiques
d&#8217;importation des &#201;tats membres pour le premier trimestre
2005. Elles sont tr&#232;s pr&#233;occupantes pour plusieurs cat&#233;gories
de produits textiles et d&#8217;habillement. Face &#224; cette situation,
l&#8217;Europe ne peut rester les bras crois&#233;s et assister &#224; la dispari-
tion de son industrie. Notre enqu&#234;te me permettra de d&#233;cider
s&#8217;il convient que l&#8217;UE adopte des mesures de sauvegarde. Il
faudrait certes laisser les exportations chinoises cro&#238;tre &#224; un
rythme normal &#224; la suite
</p>
<p>the EU should impose special safeguard measures. In
parallel, it will launch immediate consultations with
China in an attempt to find a satisfactory solution.
&lt;/i&gt; &lt;/b&gt; &lt;/p&gt; &lt;p&gt; Peter Mandelson said : &#8220;Member
States have finally made available the import statistics for the
first quarter of 2005. In several categories of textile and clo-
thing imports they do give cause for serious concern. Based
on these facts, Europe cannot stand by and watch its industry
disappear. Our investigation will enable me to decide whether
the EU should introduce safeguard measures. Chinese exports
should, of course, be allowed to grow at a normal speed follo-
wing the removal of quotas. But we must also extend protec-
tion to European industry if it is faced with a rui
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
3 ssi une action. Les donn&#233;es d&#8217;importation concernant un
</p>
<p>certain nombre d&#8217;autres cat&#233;gories semblent pr&#233;occupantes,
mais exigent une analyse plus approfondie, actuellem
</p>
<p>he global trade in textiles on 1 January 2005. This clause al-
lows for short-term protective measures until the end of 2008.
&lt;/p&gt; &lt;p&gt; &lt;b&gt; Next Steps &lt;/b&gt; &lt;/p&gt; &lt;p&gt; These in-
vestigations will last for a maximum of 60 days, of which the
first 21 will be used to take submissions from parties. The
Commission will make a thorough assessment of market im-
pact in the affected product categories. During this period, the
Commission will also hold informal consultat
</p>
<p>TABLE 5 &#8211; Alignement de zones entre les volets fr et en du communiqu&#233; IP/05/473 avec suppres-
sion d&#233;tect&#233;e &#224; l&#8217;aide de notre m&#233;thode.
</p>
<p>5 &#201;valuation
</p>
<p>5.1 &#201;valuation 1
</p>
<p>Le corpus que nous utilisons est constitu&#233; de 213 multidocuments. Pour chacun de ces multidocu-
ments nous &#233;tudions 6 couples de langues (fr,es), (fr,el), (fr,fi), (fr,en), (fr,de) et (da,de). &#201;valuer
le diagnostic des bi-documents (ind&#233;fini, synchrone, asynchrone avec inversion ou asynchrone
avec suppression) n&#8217;est pas une t&#226;che triviale, en effet il n&#8217;existe pas de r&#233;f&#233;rences pour &#233;valuer
la d&#233;tection de multizones. Nous pr&#233;sentons les r&#233;sultats obtenus &#224; partir d&#8217;une r&#233;f&#233;rence &#233;tablie
pour trois collections &#171; tout venant &#187; d&#8217;une part et trois collections th&#233;matiques d&#8217;autre part
constitu&#233;es &#224; partir de notre corpus (Tableau 7). Les exp&#233;riences r&#233;alis&#233;es sur ce premier corpus
ont confirm&#233; que :
</p>
<p>&#8211; l&#8217;utilisation de la MFM am&#233;liore le taux de d&#233;cision de +15% (+10% sur les couples de langues
proches et +20% sur les couples de langues &#233;loign&#233;es) ;
</p>
<p>&#8211; les similitudes de r&#233;partition de cha&#238;nes de caract&#232;res r&#233;p&#233;t&#233;es permettent d&#8217;aligner des
documents, y compris dans des langues &#233;loign&#233;es avec un taux de d&#233;cision toutefois plus faible
sur les langues &#233;loign&#233;es : -11% ;
</p>
<p>&#8211; exploiter une collection de multidocuments th&#233;matiquement proches contribue faiblement &#224;
l&#8217;am&#233;lioration : +3% de pr&#233;cision sur les documents synchrones.
</p>
<p>&#192; titre comparatif, on peut pr&#233;ciser que nos r&#233;sultats sont de 2 &#224; 7% meilleurs qu&#8217;une baseline
prenant comme hypoth&#232;se que tous les documents parall&#232;les sont synchrones. Ainsi, le syst&#232;me
s&#8217;av&#232;re tr&#232;s pr&#233;cis et assez pertinent pour les documents synchrones. Nos r&#233;sultats sur les
documents asynchrones (10% du corpus) sont moins satisfaisants.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>391 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IP/05/1157
</p>
<p>fr en
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
1
</p>
<p>Bruxelles, le 19 septembre 2005 &lt;/p&gt; &lt;h1&gt; &lt;a name=&quot;Heading4&quot; id=
&quot;Heading4&quot;&gt;&lt;/a&gt;&lt;b&gt; Environnement : la Commission subventionne
89 projets d&#8217;innovation dans 17 pays pour un montant de 71 millions
d&#8217;euros &lt;/b&gt; &lt;/h1&gt; &lt;p&gt; &lt;b&gt;&lt;i&gt;La Commission europ&#233;enne a ap-
prouv&#233; le financement de 89 projets innovants dans le domaine de l&#8217;en-
vironnement dans 17 pays, au titre du programme LIFE-Environnement
2005. [. . .] Pour plus de d&#233;tails concernant chaque projet, consul-
ter le site suivant :&lt;br /&gt; &lt;a href=&quot;http://europa.eu.int
/comm/environment/life/project/index.htm&quot;&gt;http://europa
.eu.int/comm/environment/life/project/index.htm&lt;/a&gt; &lt;/p&gt;
&lt;p align=&quot;right&quot;&gt; &lt;b&gt;ANNEXE&lt;/b&gt; &lt;/p&gt; &lt;p&gt; &lt;b&gt; R&#233;sum&#233; des pro-
jets
</p>
<p>/a&gt;&lt;b&gt; Environment : Commission supports 89 innovation projects in 17 coun-
tries with &#8364;71 million &lt;/b&gt; &lt;/h1&gt; &lt;p&gt; &lt;b&gt;&lt;i&gt; The European Commission
has approved funding for 89 environmental innovation projects in 17 countries un-
der the LIFE-Environment programme 2005. [. . .] More information&lt;/b&gt;&lt;br /&gt;
See the annex for a summary of the 88 projects funded under LIFE-
Environment. More detailed information on each project is available at :
&lt;/p&gt; &lt;p&gt; &lt;a href=&quot;http://europa.e
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
2 r appliquera une strat&#233;gie int&#233;gr&#233;e pour r&#233;duire la pollution agricole diffuse, dans
</p>
<p>le sens de la directive cadre sur l&#8217;eau &lt;a href= &quot;i05_1157.frr.html
#_Ref111348773&quot;&gt;1&lt;/a&gt;. &lt;/p&gt; &lt;p&gt; Le second [. . .] Le second projet
concerne le pr&#233;traitement de la laine dans la production de fil. L&#8217;objectif principal
est de supprimer les &#233;missions de compos&#233;s organohalog&#233;n&#233;s absorbables (AOX) et
de r&#233;duire sensiblement l&#8217;utilisation de produits chimiques dans le processus de net-
toyage, gr&#226;ce un proc&#233;d&#233; durable de pr&#233;traitement par plasma. &lt;/p&gt; &lt;p&gt; Un projet
porte sur la &lt;b&gt;gestion des d&#233;chets&lt;/b&gt; e
</p>
<p>ht&quot;&gt; &lt;b&gt;ANNEX&lt;/b&gt; &lt;/p&gt; &lt;p&gt; &lt;b&gt; Overview of LIFE-Environment pro-
jects 2005 by country &lt;/b&gt; &lt;/p&gt; &lt;p&gt; &lt;b&gt; Belgium &#8211; 2 projects [. . .] Denmark
&#8211; 6 projects [. . .] Estonia &#8211; 1 project [. . .] the fermentation of manure, processing of
bio-gas into
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
3 er les t&#244;les lamin&#233;es &#224; froid. Un nouveau proc&#233;d&#233; bas&#233; sur la technologie sous
</p>
<p>vide &#224; haute pression et n&#8217;utilisant pas de produits chimiques sera employ&#233;.
&lt;/p&gt; &lt;p&gt; &lt;b&gt; Belgique &#8211; deux projets [. . .] Danemark &#8211; six projets [. . .] Espagne
&#8211; seize projets &lt;/b&gt; &lt;/p&gt; &lt;p&gt; Trois projets portent sur la &lt;b&gt; gestion des eaux
&lt;/b&gt;. Le premier permettra de d&#233;finir un mod&#232;le d
</p>
<p>tronic equipment, in line with EU legislation &lt;sup&gt;&lt;b&gt;&lt;a name=&quot;fnB2&quot; href=
&quot;fn2&quot; id=&quot;fnB2&quot;&gt;[2]) &lt;/a&gt;&lt;/b&gt;&lt;/sup&gt;, with a particular emphasis on
rural areas. &lt;/p&gt; &lt;p&gt; The second targets households, schools and day-care centres
in Helsinki, with a view to increasing awareness and ensuring the amount of waste
produced does not exceed 2003 levels. &lt;/p&gt; &lt;p&gt; &lt;b&gt;France &#8211; 11 projects [. . .]
The sixth will substitute lead with o
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
4 s vari&#233;t&#233;s d&#8217;amandiers capables de r&#233;sister &#224; de telles conditions. &lt;/p&gt; &lt;p&gt; Le
</p>
<p>troisi&#232;me projet vise &#224; d&#233;finir un syst&#232;me de gestion durable de la viticulture de
montagne, en vue de r&#233;duire les incidences de cette activit&#233; sur le paysage, les sols
et les ressources en eau. &lt;/p&gt; &lt;p&gt; Quatre projets traitent des &lt;b&gt;technologies
propres.&lt;/b&gt; [. . .] Le sixi&#232;me projet d&#233;montrera qu&#8217;il est techniquement et &#233;conomi-
quement possible d&#8217;appliquer un nouveau proc&#233;d&#233; &#224; haute capacit&#233; pour s&#233;parer les
alliages m&#233;talliques &#224; puret&#233; &#233;lev&#233;e (plus de 90%). Utilis&#233; pour extraire le fer, l&#8217;alumi-
nium et les m&#233;taux lourds contenus dans les v&#233;hicules hors d
</p>
<p>to reduce diffuse pollution from agriculture, in support of the
Water Framework Directive&lt;a href= &quot;i05_1157.enr.html
#_Ref111348773&quot;&gt;1&lt;/a&gt;. &lt;/p&gt; &lt;p&gt; The second [. . .] The second
concerns the pre-treatment of wool in yarn production. The main goal is the elimina-
tion of emissions of absorbable organic halides (AOX) and a significant decrease in the
use of chemicals in the cleaning process, through a sustainable plasma pre-treatment
process. &lt;/p&gt; &lt;p&gt; One project addresses &lt;b&gt;waste management&lt;/
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
5 nouvelle technologie recourant &#224; la fermentation du lisier, &#224; la transformation du bio-
</p>
<p>gaz en &#233;nergie et en chaleur &#171; &#233;cologiques &#187; et &#224; la s&#233;paration int&#233;grale des composants
recyclables et non recyclables. &lt;/p&gt; &lt;p&gt; &lt;b&gt;Finlande &#8211; deux projets [. . .] France
&#8211; onze projets [. . .] Le quatri&#232;me projet vise &#224; d&#233;montrer qu&#8217;il est techniquement pos-
sible de recourir &#224; la technologie des ultrasons pour r&#233;duire la production de boues
r&#233;siduaires dans les stations d&#8217;&#233;puration des eaux us&#233;
</p>
<p>ng of cold rolled plates. A new chemical-free process will be used, based on high-
pressure vacuum technology. &lt;/p&gt; &lt;p&gt; &lt;b&gt; Greece &#8211; 4 projects [. . .] Hungary
&#8211; 1 project &lt;/b&gt; &lt;/p&gt; &lt;p&gt; The project, covering &lt;b&gt;water management&lt;/b&gt;,
assesses the scale of arsenic contamination in groundwater in the southern part of
Hungary. It will develop a pilot management plan, incorporating a new arsenic remo-
val technology. &lt;/p&gt; &lt;p&gt; &lt;b&gt;Ireland &#8211; 2 projects [. . .] Italy &#8211; 15 projects [. . .]
Netherlands &#8211; 7 projects [. . .] Portugal &#8211; 2 projects [. . .] Romania &#8211; 1 project [. . .]
Spain &#8211; 16 projects [. . .] The third aims at defining
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
6
</p>
<p>ernier projet fran&#231;ais concerne la &lt;b&gt;gestion de la qualit&#233; de l&#8217;air&lt;/b&gt;. Il vise
&#224; mettre au point un &#233;chantillonneur d&#8217;air bas&#233; sur une nouvelle m&#233;thode de
surveillance des pollens dans l&#8217;air. Au lieu de quantifier les grains de pollens se-
lon leur morphologie, cette m&#233;thode reposera sur la mesure en ligne de l&#8217;antig&#233;-
n&#233;it&#233;/l&#8217;allerg&#233;n&#233;it&#233;. &lt;/p&gt; &lt;p&gt; &lt;b&gt;Gr&#232;ce &#8211; quatre projets [. . .] Hongrie &#8211; un projet
[. . .] Irlande &#8211; deux projets [. . .] Italie &#8211; quinze projets [. . .] Luxembourg &#8211; un projet
[. . .] Pays-Bas &#8211; sept projets [. . .] Portugal &#8211; deux projets [. . .] Roumanie &#8211; un projet
[. . .] Royaume-Uni &#8211; dix projets [. . .] Le quatri&#232;me projet vise &#224; r&#233;duire l&#8217;&#233;limination
des d&#233;chets hospitaliers non st&#233;riles dans les
</p>
<p>g a mountain viticulture sustainable management system in order to reduce the envi-
ronmental impacts of this activity on landscape, soil and water resources. &lt;/p&gt; &lt;p&gt;
Four projects deal with &lt;b&gt;clean technologies&lt;/b&gt;. [. . .] The last project will de-
monstrate the technical and economic feasibility of a new high-capacity process to
separate high purity metal alloys (&amp;gt ;90%). Used for the separation of iron, alumi-
nium and heavy metals from
</p>
<p>M
ul
</p>
<p>tiz
on
</p>
<p>e
7
</p>
<p>s incidences environnementales des activit&#233;s &#233;conomiques&lt;/b&gt;. Le premier vise &#224;
d&#233;montrer l&#8217;efficacit&#233; du recyclage de l&#8217;eau au moyen d&#8217;un nouveau r&#233;acteur de di-
gestion a&#233;robie des eaux us&#233;es. &lt;/p&gt; &lt;p&gt; Le second projet concerne l&#8217;exploitation
des friches industrielles pour la culture de biomasse &#224; des fins &#233;nerg&#233;tiques, la r&#233;-
habilitation des terres endommag&#233;es et la production de chaleur et d&#8217;&#233;nergie &#224; par-
tir de sources d&#8217;&#233;nergie renouvelables. [. . .] Su&#232;de &#8211; deux projets [. . .] Directive
2002/95/CE du Parlement europ&#233;en et du Conseil du 27 janvier 2003 relative &#224; la
limitation de l&#8217;utilisation de certaines substances dangereuses dans
</p>
<p>re-use. &lt;/p&gt; &lt;p&gt; A fourth project aims to reduce the disposal of non-sterile clini-
cal waste in landfill sites and promote its use as a raw material for recycled products.
&lt;/p&gt; &lt;p&gt; Two projects seek to mitigate the &lt;b&gt;environmental impact of econo-
mic activities&lt;/b&gt;. One will demonstrate the effectiveness of water recycling using a
new reactor for aerobic digestion of wastewater. &lt;/p&gt; &lt;p&gt; A second aims to re-use
brownfield sites to grow biomass energy crops, restore damaged land, and generate
heat and power from renewable energy sources.[. . .] Council Directive 1999/13/EC
of 11 March 1999 on the limitation of em
</p>
<p>TABLE 6 &#8211; Alignement de zones entre les volets fr et en du communiqu&#233; IP/05/1157 pr&#233;sentant
une diff&#233;rence d&#8217;ordre des zones d&#233;tect&#233;es &#224; l&#8217;aide de notre m&#233;thode.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>392 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>#(Moyenne) da de el en es fi fr
#caract&#232;res (103) 8,8&#177;15,6 9,1&#177;14,2 9,7&#177;15,7 8,5&#177;15,4 9,4&#177;1,5 8,9&#177;15,5 9,6&#177;15,6
#mots 979&#177;1213 960&#177;1124 1105&#177;1245 997&#177;1213 1148&#177;1257 791&#177;1167 1138&#177;1262
#paragraphes 16,4&#177;14,5 16,7&#177;14,7 16,4&#177;14,9 16,5&#177;14,9 16,5&#177;14,8 16,1&#177;14,7 17,1&#177;15,2
</p>
<p>TABLE 7 &#8211; Description des 1491 documents du corpus (nombre de caract&#232;res, de mots et de
paragraphes moyen &#177; &#233;cart-type)
</p>
<p>5.2 &#201;valuation 2
</p>
<p>Afin de proposer une autre &#233;valuation, nous avons fabriqu&#233; deux jeux de test, chacun contenant
240 bi-documents dans les 6 couples de notre corpus. Apr&#232;s modifications, le premier jeu contient
60 bi-documents asynchrones avec inversion et le second 60 bi-documents asynchrones avec
suppression.
</p>
<p>Sur le premier jeu, nous avons obtenu un rappel de 25,4% et une pr&#233;cision de 41,6% (F1&#8722;
mesure= 31,6). Sur le second, les r&#233;sultats &#233;taient meilleurs puisque nous avons obtenu un
rappel de 57,1% avec une pr&#233;cision de 43,4% (F1&#8722;mesure= 49,3).
</p>
<p>6 Conclusion
</p>
<p>Les travaux que nous avons pr&#233;sent&#233;s dans cet article t&#233;moignent de la possibilit&#233; d&#8217;&#233;tablir un
alignement brut de documents traduits, gr&#226;ce &#224; un appariement de N-grammes de caract&#232;res
r&#233;p&#233;t&#233;s dans une collection de multidocuments. Ces unit&#233;s sont r&#233;v&#233;l&#233;es sans utilisation de
ressources externes et de fa&#231;on ind&#233;pendante des langues en pr&#233;sence. Cela permet d&#8217;amorcer
sans pr&#233;suppos&#233; de parall&#233;lisme un alignement lexical de mots. L&#8217;&#233;tape de d&#233;tection automatique
des zones parall&#232;les qui revient &#224; un probl&#232;me de traitement d&#8217;image s&#8217;av&#232;re au m&#234;me titre
que l&#8217;alignement plus difficile &#224; mesure que les langues mises en confrontation s&#8217;&#233;loignent. Ces
travaux t&#233;moignent d&#8217;une part que l&#8217;alignement de corpus parall&#232;les n&#8217;est pas un sujet clos et
d&#8217;autre part que la combinaison d&#8217;indices utilis&#233;e permet bien de les exploiter sans pr&#233;suppos&#233;
de parall&#233;lisme. Ces travaux rec&#232;lent des perspectives tant op&#233;ratoires que de recherche. Des
perspectives op&#233;ratoires en ce qui concerne l&#8217;&#233;tablissement automatique des param&#232;tres de
cr&#233;ation des matrices et de diagnostic des bi-documents, ainsi qu&#8217;au niveau de la d&#233;tection des
segments de droites des images qu&#8217;il faut affiner. En terme de recherche, ces travaux offrent des
perspectives pour le contr&#244;le a posteriori de traduction mais &#233;galement pour le traitement de
corpus comparables.
</p>
<p>Remerciements
</p>
<p>Merci aux relecteurs, particuli&#232;rement pour la suggestion de fabriquer un nouveau jeu de
donn&#233;es.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>393 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>BOURDAILLET J. &amp; GANASCIA J. (2007). Alignment of noisy unstructured data. In IJCAI-2007
Workshop on Analytics for Noisy Unstructured Text Data, January 6-12, Hyderabad, India.
</p>
<p>BRIXTEL R. (2011). Alignement endog&#232;ne de documents, une approche multilingue et multi-&#233;chelle.
PhD thesis, Universit&#233; de Caen/Basse-Normandie.
BRIXTEL R., FONTAINE M., LESNER B., BAZIN C. &amp; ROBBES R. (2010). Language-Independent Clone
Detection Applied to Plagiarism Detection. In SCAM 2010 : IEEE Computer Society.
</p>
<p>CHANG J. S. &amp; CHEN M. H. (1997). An alignment method for noisy parallel corpora based on
image processing techniques. In Proceedings of the eighth conference on European chapter of the
ACL, p. 297&#8211;304, Spain.
</p>
<p>CHURCH K. W. (1993). Char_align : a program for aligning parallel texts at the character level.
In Proceedings of the ACL 93, p. 1&#8211;8, Ohio.
</p>
<p>CHURCH K. W. &amp; HELFMAN J. I. (1993). Dotplot : A program for exploring Self-Similarity in
millions of lines of text and code. Journal of Computational and Graphical Statistics, 2(2),
153&#8211;174.
</p>
<p>CROMI&#200;RES F. (2006). Sub-sentential alignment using substring co-occurrence counts. In
Proceedings of the 21st International Conference on Computational Linguistics and 44th Annual
Meeting of the ACL, p. 13&#8211;18, Australia.
</p>
<p>DAGAN I., CHURCH K. W. &amp; GALE W. A. (1993). Robust bilingual word alignment for machine
aided translation. In proceedings of the workshop on very large corpora, 1, 1&#8212;-8.
</p>
<p>FUNG P. &amp; CHURCH K. W. (1994). K-vec : a new approach for aligning parallel texts. In Proceedings
of the 15th conference on Computational linguistics - Volume 2, p. 1096&#8211;1102, Japan.
</p>
<p>FUNG P. &amp; MCKEOWN K. (1994). Aligning noisy parallel corpora across language groups : Word
pair feature matching by dynamic time warping. In Proceedings of the first conference of the
AMTA, p. 81&#8211;88.
</p>
<p>LECLUZE C. (2011). Recherche d&#8217;une granularit&#233; optimale pour l&#8217;alignement multilingue :
N-grammes de caract&#232;res ou n-grammes de mots ? In JeTou, Journ&#233;es d&#8217;&#233;tudes Toulousaines,
France.
</p>
<p>MCNAMEE P. &amp; MAYFIELD J. (2004). Character N-Gram tokenization for european language text
retrieval. Information Retrieval, 7, 73&#8211;97. ACM ID : 961313.
</p>
<p>MELAMED I. D. (1997). A portable algorithm for mapping bitext correspondence. In Proceedings
of the 35th Annual Meeting of the ACL and 8th Conference of the European Chapter of the ACL, p.
305&#8211;312, Spain : Association for Computational Linguistics.
</p>
<p>SIMARD M., FOSTER G. F. &amp; ISABELLE P. (1993). Using cognates to align sentences in bilingual
corpora. In Proceedings of the 1993 conference of the Centre for Advanced Studies on Collaborative
research : distributed computing - Volume 2, p. 1071&#8211;1082, Canada.
</p>
<p>SIMARD M. &amp; PLAMONDON P. (1996). Bilingual sentence alignment : Balancing robustness and
accuracy. In proceedings of the 2nd conference of the AMTA, 13, 59&#8211;80.
</p>
<p>UKKONEN E. (2009). Maximal and minimal representations of gapped and non-gapped motifs of
a string. Theorie in Computer Science, 410(43), 4341&#8211;4349.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>394 c&#65535; ATALA</p>

</div></div>
</body></html>