<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une interface pour la validation et l&#8217;&#233;valuation de chronologies th&#233;matiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Une interface pour la validation et l&#8217;&#233;valuation de
chronologies th&#233;matiques
</p>
<p>Xavier Tannier1,2 V&#233;ronique Moriceau1,2 Erwan Le Flem1,3
(1) LIMSI-CNRS
</p>
<p>(2) Universit&#233; Paris-Sud, 91403 Orsay, France
(3) IUT de Vannes
</p>
<p>prenom.nom@limsi.fr
</p>
<p>R&#201;SUM&#201;
Cet article d&#233;crit une interface graphique de visualisation de chronologies &#233;v&#233;nementielles
construites automatiquement &#224; partir de requ&#234;tes th&#233;matiques en utilisant un corpus de d&#233;p&#234;ches
fourni par l&#8217;Agence France Pressse (AFP). Cette interface permet &#233;galement la validation des
chronologies par des journalistes qui peuvent ainsi les &#233;diter et les modifier.
</p>
<p>ABSTRACT
An Interface for Validating and Evaluating Thematic Timelines
</p>
<p>This demo paper presents a graphical interface for the visualization and evaluation of event
timelines built automatically from a search query on a newswire article corpus provided by the
Agence France Pressse (AFP). This interface also enables journalists to validate chronologies by
editing and modifying them.
</p>
<p>MOTS-CL&#201;S : chronologie &#233;v&#233;nementielle, &#233;valuation, validation.
KEYWORDS: event timeline, evaluation, validation.
</p>
<p>1 Construction des chronologies &#233;v&#233;nementielles
</p>
<p>Actuellement, les journalistes de l&#8217;Agence France Presse (AFP) construisent manuellement des
chronologies &#233;v&#233;nementielles textuelles dans le but de contextualiser des &#233;v&#233;nements m&#233;dia-
tiques. Elles sont sous forme d&#8217;une liste de dates (g&#233;n&#233;ralement entre 10 et 20) associ&#233;es &#224; un
texte d&#233;crivant l&#8217;&#233;v&#233;nement ayant eu lieu &#224; cette date.
Nous avons d&#233;velopp&#233; un syst&#232;me capable de construire ce genre de chronologies &#233;v&#233;nementielles
th&#233;matiques &#224; partir d&#8217;une requ&#234;te utilisateur en utilisant un corpus de d&#233;p&#234;ches en fran&#231;ais et
en anglais fourni par l&#8217;AFP 1. Nous consid&#233;rons que les &#233;v&#233;nements importants, ceux que nous
souhaitons retrouver dans les chronologies, ont lieu &#224; des dates importantes (du point de vue
du th&#232;me impos&#233; par la requ&#234;te de l&#8217;utilisateur). Pour extraire les dates qui m&#233;ritent de figurer
dans une chronologie &#233;v&#233;nementielle, les expressions temporelles dans les textes sont dans un
premier temps reconnues et normalis&#233;es. Nous utilisons ensuite une approche par apprentissage
pour extraire les dates saillantes pour un th&#232;me donn&#233; (Kessler et al., 2012). En sortie, notre
</p>
<p>1. Ce travail a &#233;t&#233; partiellement financ&#233; par l&#8217;ANR dans le cadre du projet Chronolines (ANR-10-CORD-010). Nous
remercions l&#8217;AFP pour la mise &#224; disposition du corpus et son concours pour la d&#233;finition de l&#8217;interface.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>797 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>syst&#232;me fournit une liste de dates (entre 20 et 300) class&#233;es de la plus &#224; la moins importante par
rapport au th&#232;me de la requ&#234;te. Chaque date est accompagn&#233;e d&#8217;une description d&#8217;une phrase
ainsi que d&#8217;un ensemble de phrases pertinentes pour l&#8217;&#233;v&#233;nement d&#233;crit.
</p>
<p>2 Interface de validation des chronologies
</p>
<p>L&#8217;interface graphique comporte 3 vues (voir figure 1). La partie &#9312; pr&#233;sente la chronologie
construite automatiquement en fonction de la requ&#234;te de l&#8217;utilisateur. L&#8217;importance de l&#8217;&#233;v&#233;nement
est indiqu&#233;e par un code couleur. La partie &#9313; permet &#224; l&#8217;utilisateur de valider manuellement la
chronologie. Il peut s&#233;lectionner dans &#9312;, par glisser-d&#233;placer, les &#233;v&#233;nements qui lui semblent
pertinents. Ceux-ci sont modifiables si besoin (date et description textuelle de l&#8217;&#233;v&#233;nement).
L&#8217;utilisateur peut &#233;galement cr&#233;er de nouveaux &#233;v&#233;nements qui ne seraient pas pr&#233;sents dans
les propositions de la chronologie automatique. Enfin, la partie &#9314; donne une visualisation de
la chronologie valid&#233;e sous forme de chronologie navigable. Elle est impl&#233;ment&#233;e avec l&#8217;outil
web SIMILE TimeLine, une API JavaScript permettant de g&#233;n&#233;rer des chronologies visuelles sur
une page HTML. Cette interface permet non seulement de faciliter le travail des journalistes
dans la construction de chronologies mais aussi d&#8217;&#233;valuer la qualit&#233; des chronologies produites
automatiquement en les comparant &#224; celles produites par les journalistes.
</p>
<p>FIGURE 1 &#8211; Interface de visualisation et de validation des chronologies.
</p>
<p>R&#233;f&#233;rences
</p>
<p>KESSLER, R., TANNIER, X., HAG&#200;GE, C., MORICEAU, V. et BITTAR, A. (2012). Finding Salient Dates
for Building Thematic Timelines. In 50th Annual Meeting of the ACL, R&#233;publique de Cor&#233;e.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>798 c&#65535; ATALA</p>

</div></div>
</body></html>