<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Segmentation Multilingue des Mots Compos&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation Multilingue des Mots Compos&#233;s
</p>
<p>Elizaveta Loginova-Clouet1 B&#233;atrice Daille1
(1) LINA, 2, rue de la Houssini&#232;re 44322 Nantes Cedex 03
</p>
<p>elizaveta.loginova@univ-nantes.fr, beatrice.daille@univ-nantes.fr
</p>
<p>R&#233;sum&#233;
La composition est un ph&#233;nom&#232;ne fr&#233;quent dans plusieurs langues, surtout dans des langues
ayant une morphologie riche. Le traitement des mots compos&#233;s est un d&#233;fi pour les syst&#232;mes
de TAL car pour la plupart, ils ne sont pas pr&#233;sents dans les lexiques. Dans cet article, nous
pr&#233;sentons une m&#233;thode de segmentation des compos&#233;s qui combine des caract&#233;ristiques
ind&#233;pendantes de la langue (mesure de similarit&#233;, donn&#233;es du corpus) avec des r&#232;gles de
transformation sur les fronti&#232;res des composants sp&#233;cifiques &#224; une langue. Nos exp&#233;riences de
segmentation de termes compos&#233;s allemands et russes montrent une exactitude jusqu&#8217;&#224; 95 %
pour l&#8217;allemand et jusqu&#8217;&#224; 91 % pour le russe. Nous constatons que l&#8217;utilisation de corpus
sp&#233;cialis&#233;s relevant du m&#234;me domaine que les compos&#233;s am&#233;liore la qualit&#233; de segmentation.
Abstract
Multilingual Compound Splitting
Compounding is a common phenomenon for many languages, especially those with a rich
morphology. Dealing with compounds is a challenge for natural language processing systems
since all compounds can not be included in lexicons. In this paper, we present a compound
splitting method combining language independent features (similarity measure, corpus data)
and language dependent features (component transformation rules). We report on our
experiments in splitting of German and Russian compound terms giving accuracy up to 95%
for German and up to 91% for Russian language. We observe that the usage of a corpus of
the same domain as compounds improves splitting quality.
Mots-cl&#233;s : segmentation des mots compos&#233;s, outil multilingue, mesure de similarit&#233;,
r&#232;gles de transformation des composants, corpus sp&#233;cialis&#233;s.
Keywords: compound splitting, multilingual tool, similarity measure, component trans-
formation rules, specialized corpora.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>564 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>La composition est un m&#233;canisme de formation des mots qui consiste &#224; combiner deux (ou
plusieurs) &#233;l&#233;ments lexicaux autonomes pour former une unit&#233; de sens. Ce ph&#233;nom&#232;ne est
notamment pr&#233;sent dans les langues allemande, n&#233;erlandaise, grecque, su&#233;doise, danoise,
finlandaise et russe. Le traitement des mots compos&#233;s est une difficult&#233; pour les syst&#232;mes
de traitement automatique des langues parce que la plupart des compos&#233;s ne sont pas
recens&#233;s dans les ressources lexicales. Ainsi leur reconnaissance et leur segmentation seraient
b&#233;n&#233;fiques pour des t&#226;ches vari&#233;es du TAL : traduction automatique (Macherey et al. (2011),
Weller et Heid (2012)), recherche d&#8217;information (Braschler et Ripplinger, 2004), recherche
d&#8217;information multilingue (Chen et Gey, 2001), etc.
Les m&#233;canismes de composition sont plus ou moins complexes en fonction des langues. Dans
les langues tr&#232;s analytiques comme les langues fran&#231;aise et anglaise les composants sont
simplement concat&#233;n&#233;s : FR kilowatt-heure, EN parrotfish 1, &#171; poisson perroquet &#187;.
Dans les langues ayant une morphologie riche, des transformations sont possibles aux fronti&#232;res
des parties composantes. La terminaison du mot peut &#234;tre omise, et/ou des morph&#232;mes
&#171; fronti&#232;res &#187; rajout&#233;s, par exemple en allemand :
</p>
<p>Staatsfeind (&#171; ennemie d&#8217;&#233;tat &#187;) = Staat (&#171; &#233;tat &#187;) + Feind (&#171; ennemie &#187;) ;
Pour certaines langues, les r&#232;gles sont peu nombreuses et exhaustives. Pour d&#8217;autres, des
ph&#233;nom&#232;nes plus complexes interviennent comme la modification du radical en russe :
</p>
<p>&#1074;&#1077;&#1090;&#1088;&#1086;&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; (&#171; g&#233;n&#233;rateur &#233;olien &#187;)
vetrogenerator 2 = veter (&#171; vent &#187;) + generator (&#171; g&#233;n&#233;rateur &#187;) ;
</p>
<p>Les &#171; compos&#233;s n&#233;oclassiques &#187;, c&#8217;est-&#224;-dire des compos&#233;s ayant un ou plusieurs &#233;l&#233;ments
d&#8217;origine latine ou grecque (Namer, 2009), sont un cas particulier de composition o&#249; les
&#233;l&#233;ments lexicaux ne sont pas autonomes : FR multim&#233;dia, DE Turbomaschine (&#171; turboma-
chine &#187;), etc. Ces &#233;l&#233;ments n&#233;oclassiques sont g&#233;n&#233;ralement absents des dictionnaires ou des
bases de donn&#233;es lexicales.
Certains syst&#232;mes de TAL optent pour le stockage de tous les composants connus dans
le lexique (&#224; notre connaissance, c&#8217;est g&#233;n&#233;ralement le cas des syst&#232;mes pour le russe).
Cette solution nous semble insatisfaisante pour des t&#226;ches multilingues car ceci augmente
consid&#233;rablement la couverture du dictionnaire.
Dans cet article, nous faisons le tour d&#8217;horizon des m&#233;thodes de segmentation automatique
des mots compos&#233;s. Ensuite, nous proposons une m&#233;thode combinant des traits d&#233;pendants
et ind&#233;pendants de la langue. Enfin, nous pr&#233;sentons nos exp&#233;riences de segmentation des
compos&#233;s allemands et russes.
</p>
<p>2 M&#233;thodes de segmentation des mots compos&#233;s
</p>
<p>Parmi les m&#233;thodes de segmentation des compos&#233;s, on peut distinguer les m&#233;thodes utilisant
des r&#232;gles formul&#233;es manuellement et des m&#233;thodes compl&#232;tement statistiques.
</p>
<p>1. EN - langue anglaise, DE - langue allemande, RU - langue russe
2. Les exemples russes sont translitt&#233;r&#233;s.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>565 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le premier type de m&#233;thodes d&#233;finit des r&#232;gles de segmentation telles que celles de trans-
formations aux fronti&#232;res des composants en allemand. G&#233;n&#233;ralement celles-ci utilisent des
r&#232;gles de formation des compos&#233;s d&#233;crites par Langer (1998).
Pour choisir parmi plusieurs segmentations, les composants ainsi identifi&#233;s sont ensuite
recherch&#233;s soit dans un dictionnaire (segmenteur Banana Split 3), soit dans un corpus
monolingue (Koehn et Knight (2003), IMS Splitter 4). Les approches bas&#233;es sur le corpus
affectent &#233;galement une probabilit&#233; &#224; chaque segmentation, estim&#233;e sur la base de la fr&#233;quence
des composants dans le corpus. Un corpus parall&#232;le allemand-anglais peut &#234;tre exploit&#233; afin
d&#8217;y v&#233;rifier les correspondances des parties d&#233;compos&#233;es (Koehn et Knight, 2003).
Les approches du deuxi&#232;me groupe ne requi&#232;rent pas de r&#232;gles sp&#233;cifiques pour chaque
langue donn&#233;e. Macherey et al. (2011) proposent d&#8217;extraire automatiquement des op&#233;rations
morphologiques sur les fronti&#232;res de composants. L&#8217;entra&#238;nement du mod&#232;le pour une nouvelle
langue n&#233;cessite un corpus parall&#232;le contenant une partie anglaise. Hewlett et Cohen (2011)
d&#233;tectent automatiquement la place des fronti&#232;res de composants. L&#8217;algorithme est bas&#233; sur
la probabilit&#233; des s&#233;quences de caract&#232;res dans une langue.
Actuellement, les mod&#232;les purement statistiques ne sont pas aussi pr&#233;cis que des mod&#232;les
utilisant des r&#232;gles, leur avantage r&#233;side toutefois dans la possibilit&#233; de r&#233;utilisation pour des
langues vari&#233;es.
</p>
<p>3 Algorithme de segmentation
</p>
<p>Notre objectif est de cr&#233;er un outil de segmentation des mots compos&#233;s g&#233;n&#233;rique et multilingue
qui pourrait &#234;tre appliqu&#233; &#224; des diff&#233;rentes langues gr&#226;ce aux traits ind&#233;pendants de la langue
sans n&#233;cessiter de connaissances pr&#233;alables. N&#233;anmoins si des r&#232;gles existent, cet outil doit
&#234;tre capable de les int&#233;grer. Les caract&#233;ristiques ind&#233;pendantes de la langue exploit&#233;es sont
la fr&#233;quence des mots dans un corpus monolingue, et la similarit&#233; entre une sous-cha&#238;ne du
mot et les lemmes candidats.
Pour segmenter un compos&#233;, nous commen&#231;ons par g&#233;n&#233;rer toutes ses segmentations possibles
en deux parties, de taille sup&#233;rieure ou &#233;gale &#224; la longueur minimale accept&#233;e pour un
composant. Par exemple DE Traktionsbatterie (&#171; batterie de traction &#187;) :
</p>
<p>traktionsbatterie &#8594; tr + aktionsbatterie
traktionsbatterie &#8594; tra + ktionsbatterie
</p>
<p>...
traktionsbatterie &#8594; traktionsbatter + ie
</p>
<p>Si des r&#232;gles de transformation des composants en lex&#232;mes ind&#233;pendants sont disponibles
pour la langue donn&#233;e, elles sont appliqu&#233;es aux composants candidats. Ce sont des r&#232;gles de
type : &#171; s &#187; &#8594; &#171; &#187;, (cf. DE exemple Staatsfeind), &#171; en &#187; &#8594; &#171; um &#187;, etc.
Pour chaque segmentation candidate, les deux parties sont recherch&#233;es dans un dictionnaire
monolingue, et optionnellement dans un corpus monolingue. Le corpus permet de calculer
les fr&#233;quences des mots, ce qui aide &#224; choisir les composants candidats les plus plausibles
lorsque plusieurs variantes sont possibles.
</p>
<p>3. http://niels.drni.de/s9y/pages/bananasplit.html
4. http://www.ims.uni-stuttgart.de/~wellermn/tools.html
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>566 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nous calculons ensuite la similarit&#233; entre chacune des deux parties de segmentation et les
lemmes du dictionnaire/corpus afin de choisir les lemmes &#171; les plus proches &#187;. Nous utilisons
&#171; la distance d&#8217;&#233;dition normalis&#233;e &#187; bas&#233;e sur la distance de Levenshtein comme mesure de
similarit&#233; (pour la description d&#233;taill&#233;e des mesures existantes cf. (Frunza et Inkpen, 2009)) :
</p>
<p>sim(X,Y ) = 1&#8722; nbEditOper
max(length(X), length(Y ))
</p>
<p>o&#249; nbEditOper est le nombre minimal d&#8217;op&#233;rations d&#8217;&#233;dition (substitution, suppression,
insertion) n&#233;cessaires pour transformer un composant X en un lemme Y.
Si certains lemmes sont acceptables (i.e. avec une similarit&#233; sup&#233;rieure ou &#233;gale &#224; un seuil
d&#233;fini) pour la partie gauche de la segmentation courante, mais non pour la partie droite,
nous r&#233;it&#233;rons la segmentation jusqu&#8217;&#224; trouver des composants attest&#233;s ou jusqu&#8217;&#224; un nombre
maximal de composants.
</p>
<p>RU &#1082;&#1080;&#1083;&#1086;&#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1074;&#1086;&#1083;&#1100;&#1090; (&#171; kilo&#233;lectronvolt &#187;) :
kiloelektronvolt &#8594; kilo + elektronvolt
elektronvolt &#8594; elektron + volt
</p>
<p>Dans le cas o&#249; des lemmes candidats sont acceptables pour chaque composant, nous calculons
le score de cette segmentation &#224; chaque niveau de d&#233;composition :
</p>
<p>S(segm) =
&#65535;
</p>
<p>S(compA)+S(compB)
2 si correspondance exacte
</p>
<p>S(compA)+S(compB)
nbComp sinon
</p>
<p>o&#249; nbComp est le nombre de composants dans le mot, et &#171; correspondance exacte &#187; signifie
que tous les composants ont &#233;t&#233; trouv&#233;s en l&#8217;&#233;tat dans le dictionnaire/corpus. Le score d&#8217;un
composant est calcul&#233; de la mani&#232;re suivante :
</p>
<p>S(comp) = sim(comp, lemma)nbComp &#215; (inDico+ inCorpus+ freqCorpus)
o&#249; inDico et inCorpus sont des valeurs attestant la pr&#233;sence ou l&#8217;absence du lemme dans le
dictionnaire et le corpus, et freqCorpus est &#233;gale &#224; la fr&#233;quence relative du lemme dans le
corpus. La mesure de similarit&#233; est &#233;lev&#233;e &#224; la puissance nbComp pour augmenter son impact
lorsque le niveau de d&#233;composition cro&#238;t : plus il y a de composants dans la segmentation
candidate, plus il est accord&#233; d&#8217;importance au fait que les composants soient proches des
lemmes trouv&#233;s (le cas le plus favorable &#233;tant celui d&#8217;une mesure de similarit&#233; &#233;gale &#224; 1).
Enfin, l&#8217;algorithme retourne le Top N des meilleures segmentations class&#233;es par score d&#233;crois-
sant. Par exemple, pour DE Traktionsbatterie (&#171; batterie de traction &#187;) le r&#233;sultat affich&#233; est
le suivant :
</p>
<p>traktion + batterie 1.50
trakt + ion + batterie 1.25
</p>
<p>La segmentation correcte est Traktion + Batterie, et celle-ci obtient le meilleur score d&#8217;apr&#232;s
le programme.
</p>
<p>4 Exp&#233;riences et donn&#233;es
</p>
<p>Dans cette section, nous d&#233;crivons nos exp&#233;riences en utilisant le pr&#233;c&#233;dent algorithme.
Jusqu&#8217;&#224; pr&#233;sent il a &#233;t&#233; appliqu&#233; &#224; deux langues : l&#8217;allemande et le russe. La composition en
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>567 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>allemand est tr&#232;s productive et bien d&#233;crite. La composition en russe l&#8217;est moins, m&#234;me si
elle est plus fr&#233;quente dans les domaines de sp&#233;cialit&#233; que dans la langue g&#233;n&#233;rale.
Pour les deux langues, nous avons analys&#233; des mots compos&#233;s appartenant au domaine de
l&#8217;&#233;nergie &#233;olienne. Pour la langue allemande, nous avons pris comme jeu de tests 445 compos&#233;s
extraits des exp&#233;riences de Weller et Heid (2012) 5. Pour la langue russe, nous avons compil&#233;
le jeu de tests &#224; partir d&#8217;un corpus de l&#8217;&#233;nergie &#233;olienne 6. Parmi les 7 000 lex&#232;mes les plus
fr&#233;quents du corpus, 348 sont des compos&#233;s.
Nous avons fait varier les param&#232;tres pour observer l&#8217;impact de l&#8217;utilisation du corpus et des
r&#232;gles de transformation sur la qualit&#233; de segmentation. Comme la segmentation de base,
nous avons retenu la segmentation avec le dictionnaire, ce qui correspond &#224; la technique
utilis&#233;e dans les syst&#232;mes n&#8217;ayant pas de module &#233;labor&#233; de segmentation. Nous avons enrichi
cette segmentation de base premi&#232;rement avec la prise en compte de r&#232;gles de transformation
et l&#8217;utilisation de la mesure de similarit&#233;, et deuxi&#232;mement avec le filtrage dans le corpus.
Pour l&#8217;allemand, nous avons utilis&#233; la partie allemande du dictionnaire libre allemand-anglais
Dict.cc 7. Pour le russe, nous avons exploit&#233; la version &#233;lectronique du dictionnaire de
Ozhegov 8, compl&#233;t&#233;e par une liste d&#8217;&#233;l&#233;ments n&#233;oclassiques extraits du travail de B&#233;chade
(1992) et traduits en russe. Les &#233;l&#233;ments n&#233;oclassiques sont tr&#232;s fr&#233;quents dans les compos&#233;s
russes et leur rep&#233;rage s&#8217;av&#232;re n&#233;cessaire pour une segmentation correcte. Comme nous
travaillons avec des compos&#233;s sp&#233;cialis&#233;s, nous avons exploit&#233; des corpus th&#233;matiques du
domaine de l&#8217;&#233;nergie &#233;olienne compil&#233;s &#224; partir du web 9 (environ 300 000 mots pour le russe
et 1.7 million mots pour l&#8217;allemand) et lemmatis&#233;s par TreeTagger 10.
Les r&#232;gles pour l&#8217;allemand sont bas&#233;es sur (Langer, 1998). Pour la langue russe nous avons test&#233;
deux jeux de r&#232;gles. Le premier jeu contient deux r&#232;gles exprimant une connaissance basique
du russe selon laquelle les morph&#232;mes &#171; o &#187; and &#171; e &#187; servent de morph&#232;mes &#171; fronti&#232;res &#187; pour
des compos&#233;s. Le jeu de r&#232;gles &#233;largi (13 r&#232;gles) int&#232;gre des connaissances morphologiques
approfondies extraites de (Zaliznjak, 1977).
Un param&#232;tre important pour notre algorithme est le seuil de similarit&#233; qui d&#233;signe la
valeur minimale acceptable de similarit&#233; entre un composant candidat et un lemme du
dictionnaire/corpus. Pour trouver la valeur optimale, nous avons test&#233; l&#8217;algorithme avec des
seuils diff&#233;rents sur le m&#234;me corpus de l&#8217;&#233;nergie &#233;olienne (cf. Figure 1). Sur nos donn&#233;es la
valeur de 0.7 s&#8217;av&#232;re la plus satisfaisante pour les deux langues.
Pour &#233;valuer les r&#233;sultats, nous avons calcul&#233; l&#8217;exactitude (EN &#171; accuracy &#187;) de d&#233;composition
en position 1 (&#171; Top 1 &#187;) et en position 5 (&#171; Top 5 &#187;) dans la liste de segmentations candidates
class&#233;es par l&#8217;algorithme. L&#8217;exactitude est obtenue en divisant le nombre de compos&#233;s qui
ont une segmentation correcte dans Top N produit par l&#8217;algorithme par le nombre total de
compos&#233;s. Jusqu&#8217;&#224; pr&#233;sent, nous avons effectu&#233; l&#8217;&#233;valuation seulement sur des mots compos&#233;s,
et nous n&#8217;avons pas &#233;valu&#233; le bruit introduit par les faux positifs (non-compos&#233;s qui sont
segment&#233;s par l&#8217;algorithme par erreur). L&#8217;identification des compos&#233;s potentiels d&#8217;une langue
rel&#232;ve d&#8217;une autre probl&#233;matique.
</p>
<p>5. http://www.ims.uni-stuttgart.de/~wellermn/tools.html
6. http://www.lina.univ-nantes.fr/?Linguistic-Resources-from-the.html
7. http://www.dict.cc
8. http://speakrus.ru/dict/ozhegovw.zip
9. http://www.lina.univ-nantes.fr/?Linguistic-Resources-from-the.html
</p>
<p>10. http://www.cis.uni-muenchen.de/~schmid/tools/TreeTagger/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>568 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>30
40
50
60
70
80
90
100
</p>
<p>0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1
Ex
</p>
<p>ac
tit
</p>
<p>ud
e
</p>
<p>To
p
</p>
<p>5
</p>
<p>Seuil de Similarit&#233;
</p>
<p>RU avec corpus
RU sans corpus
DE avec corpus
DE sans corpus
</p>
<p>Figure 1 &#8211; Exactitude de la segmentation des mots compos&#233;s (Top 5) en fonction du seuil
de similarit&#233;
</p>
<p>Dictionnaire Dictionnaire
+ R&#232;gles +
Similarit&#233;
</p>
<p>Dictionnaire
+ R&#232;gles +
Similarit&#233; +
Corpus
</p>
<p>Banana
Split
</p>
<p>IMS Splitter
</p>
<p>Top 1 57 % 91 % 91 % 86 % 87 %
Top 5 57 % 94 % 95 % - 92 %
</p>
<p>Table 1 &#8211; Exactitude de segmentation pour l&#8217;allemand
</p>
<p>5 R&#233;sultats
</p>
<p>Les r&#233;sultats de la segmentation pour les langues allemande et russe sont pr&#233;sent&#233;s dans les
tableaux 1 et 2.
</p>
<p>5.1 Compos&#233;s allemands
</p>
<p>Les r&#233;sultats en ajoutant les r&#232;gles de transformation et la mesure de similarit&#233; sont nettement
meilleurs que ceux obtenus dans l&#8217;exp&#233;rience de base (seulement avec le dictionnaire).
L&#8217;utilisation du corpus am&#233;liore l&#233;g&#232;rement l&#8217;exactitude pour le Top 5. Cela permet la
segmentation correcte d&#8217;un nombre sup&#233;rieur de mots dont les composants ne sont pas pr&#233;sents
dans le dictionnaire (Netzanschlu&#223;, &#171; connexion r&#233;seau &#187;). Dans certains cas, cela am&#233;liore
aussi le classement : Traktionsbatterie sans corpus retourne deux segmentations class&#233;es &#224;
&#233;galit&#233; traktion+batterie 1.0 et trakt+ion+batterie 1.0. L&#8217;utilisation de corpus fait appara&#238;tre
la segmentation correcte avant celle incorrecte : traktion+batterie 1.50, trakt+ion+batterie
1.25.
Dans d&#8217;autres cas le corpus nuit au classement parce qu&#8217;il favorise les segmentations constitu&#233;es
de composants plus courts et plus fr&#233;quents : Aussichtsplattform, &#171; observation deck &#187;, est
correctement segment&#233; sans corpus en aussicht+plattform, alors qu&#8217;avec le corpus la meilleure
segmentation est aus+sicht+plattform. Ce probl&#232;me peut &#234;tre r&#233;solu en rempla&#231;ant la
fr&#233;quence simple du corpus par la sp&#233;cificit&#233; qui rend compte du caract&#232;re terminologique
des compos&#233;s. La sp&#233;cificit&#233; est obtenue en divisant la fr&#233;quence dans le corpus sp&#233;cialis&#233;
par la fr&#233;quence dans un corpus g&#233;n&#233;ral (Ahmad et al., 1992).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>569 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Dictionnaire Dictionnaire + R&#232;gles + Similarit&#233; Dictionnaire + R&#232;gles + Simila-rit&#233; + Corpus
R&#232;gles restreintes R&#232;gles &#233;largies R&#232;gles restreintes R&#232;gles &#233;largies
</p>
<p>Top 1 35 % 62 % 78 % 72 % 82 %
Top 5 35 % 68 % 80 % 81 % 91 %
</p>
<p>Table 2 &#8211; Exactitude de segmentation pour le russe
</p>
<p>Nous avons compar&#233; notre outil &#224; deux outils libres disponibles pour l&#8217;allemand : Banana
Split 11 et IMS Splitter 12. Sur les m&#234;mes 445 compos&#233;s, le segmenteur Banana Split donne
une exactitude de 86 % pour le Top 1 ; IMS Splitter aboutit &#224; une exactitude de 87 % pour
le Top 1 et 92 % pour le Top 5.
</p>
<p>5.2 Compos&#233;s russes
</p>
<p>Nous avons observ&#233; une diff&#233;rence significative entre les r&#233;sultats de l&#8217;exp&#233;rience de base
et ceux avec les r&#232;gles et la mesure de similarit&#233; (cf. tableau. 2). L&#8217;utilisation de corpus a
&#233;t&#233; &#233;galement b&#233;n&#233;fique. Notons que les r&#233;sultats avec l&#8217;utilisation des r&#232;gles &#233;largies sans
corpus sont proches de ceux avec les r&#232;gles restreintes mais avec corpus. En fait pour certains
compos&#233;s le corpus compense l&#8217;absence de r&#232;gles. Ainsi l&#8217;adjectif &#171; &#233;lectromagn&#233;tique &#187;
&#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1084;&#1072;&#1075;&#1085;&#1080;&#1090;&#1085;&#1099;&#1081; (elektromagnitnyi) ne pouvait pas &#234;tre segment&#233; correctement avec la
m&#233;thode de base, parce que son composant de droite magnitnyi (&#171; magn&#233;tique &#187;) n&#8217;est pas
pr&#233;sent dans le dictionnaire. Il peut &#234;tre segment&#233; soit en utilisant le corpus (o&#249; &#171;magn&#233;tique &#187;
est pr&#233;sent), soit gr&#226;ce &#224; une r&#232;gle qui permet de retrouver le nom associ&#233; magnit (&#171; aimant &#187;).
</p>
<p>6 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; un algorithme de segmentation des mots compos&#233;s combinant des
caract&#233;ristiques ind&#233;pendantes de la langue (mesure de similarit&#233;, fr&#233;quence des mots) avec
des caract&#233;ristiques d&#233;pendantes de la langue (r&#232;gles de transformation des composants).
Cette m&#233;thode est beaucoup plus performante que celle de base consistant &#224; v&#233;rifier la
pr&#233;sence des composants dans un dictionnaire. Elle donne des r&#233;sultats comparables aux
m&#233;thodes de segmentation monolingues : pour le Top 5, exactitude jusqu&#8217;&#224; 95 % pour
l&#8217;allemand et jusqu&#8217;&#224; 91 % pour le russe.
L&#8217;utilisation d&#8217;un corpus est globalement b&#233;n&#233;fique. Un corpus sp&#233;cialis&#233; permet de segmenter
correctement plus de mots dont les composants sont inconnus du dictionnaire et de filtrer
des mauvaises segmentations. Le corpus permet dans une certaine mesure de compenser des
r&#232;gles morphologiques. Il peut cependant d&#233;grader le classement des candidats dans certains
cas.
Le code source avec une description d&#233;taill&#233;e de l&#8217;algorithme sont accessibles en ligne 13. Le
programme peut &#234;tre appliqu&#233; &#224; des langues diff&#233;rentes en changeant les sources lexicales
11. http://niels.drni.de/s9y/pages/bananasplit.html
12. http://www.ims.uni-stuttgart.de/~wellermn/tools.html
13. http://www.lina.univ-nantes.fr/?Compound-Splitting-Tool.html
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>570 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>et en ajoutant &#233;ventuellement des r&#232;gles de transformation. N&#233;anmoins un param&#233;trage
pr&#233;liminaire est pr&#233;f&#233;rable pour obtenir de meilleurs r&#233;sultats pour une nouvelle langue.
Nous pr&#233;voyons de tester l&#8217;algorithme pour d&#8217;autres langues et domaines ainsi que d&#8217;&#233;valuer
l&#8217;impact de la segmentation sur la qualit&#233; de la traduction automatique.
</p>
<p>Remerciements
</p>
<p>Les travaux ayant men&#233; &#224; ces r&#233;sultats ont re&#231;u le financement du programme European
Community&#8217;s Seventh Framework (FP7/2007-2013), sous l&#8217;agr&#233;ment de bourse no. 248005.
</p>
<p>R&#233;f&#233;rences
Ahmad, K., Davies, A., Fulford, H. et Rogers, M. (1992). What is a term ? the
semi-automatic extraction of terms from text. In Translation Studies : An Interdiscipline,
pages 267&#8211;278, Amsterdam/Philadelphia. John Benjamins.
Braschler, M. et Ripplinger, B. (2004). How effective is stemming and decompounding
for german text retrieval. In Information Retrieval, volume 7, pages 291&#8211;316.
B&#233;chade, H.-D. (1992). Phon&#233;tique et morphologie du fran&#231;ais moderne et contemporain.
Presses Universitaires de France, Paris.
Chen, A. et Gey, F. (2001). Translation term weighting and combining translation resources
in cross-language retrieval. In Proceedings of TREC Conference.
Frunza, O. et Inkpen, D. (2009). Identification and disambiguation of cognates, false
friends, and partial cognates using machine learning techniques. In International Journal
of Linguistics, volume 1.
Hewlett, D. et Cohen, P. (2011). Fully unsupervised word segmentation with bve and
mdl. In Proceedings of ACL 2011, pages 540&#8211;545, Portland, Oregon.
Koehn, P. et Knight, K. (2003). Empirical methods for compound splitting. In Proceedings
of EAC 2003, Budapest, Hungary.
Langer, S. (1998). Zur Morphologie und Semantik von Nominalkomposita. In Proceedings
of KONVENS 1998, pages 83&#8211;97, Bonn.
Macherey, K., Dai, A., Talbot, D., Popat, A. et Och, F. (2011). Language-independent
compound splitting with morphological operations. In Proceedings of ACL 2011, pages
1395&#8211;1404, Portland, Oregon.
Namer, F. (2009). Morphologie, lexique et traitement automatique des langues. Lavoisier,
Paris.
Ott, N. (2005). Measuring semantic relatedness of german compounds using germanet. http:
//niels.drni.de/n3files/bananasplit/Compound-GermaNet-Slides.pdf. [consult&#233; le
20/03/2013].
Weller, M. et Heid, U. (2012). Analyzing and aligning german compound nouns. In
Proceedings of LREC 2012, Istanbul.
Zaliznjak, A. A. (1977). Grammaticheskij Slovar&#8217; Russkogo Jazyka [Grammatical Dictio-
nary of the Russian Language]. Russkij jazyk, Moscow.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>571 c&#65535; ATALA</p>

</div></div>
</body></html>