<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Groupement de termes bas&#233; sur des r&#233;gularit&#233;s linguistiques et s&#233;mantiques dans un contexte cross-langue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Groupement de termes bas&#233; sur des r&#233;gularit&#233;s linguistiques
et s&#233;mantiques dans un contexte cross-langue
</p>
<p>Marie Dupuch1,2 Thierry Hamon3 Natalia Grabar1
(1) CNRS UMR 8163 STL, Universit&#233; Lille 3, 59653 Villeneuve d&#8217;Ascq, France
</p>
<p>(2) Viseo-Objet Direct, 4, avenue Doyen Louis Weil, 38000 Grenoble
(3) LIM&amp;BIO (EA3969), Universit&#233; Paris 13, Sorbonne Paris Cit&#233;,
</p>
<p>74, rue Marcel Cachin, 93017 Bobigny Cedex France
</p>
<p>R&#201;SUM&#201;
Nous proposons d&#8217;exploiter des m&#233;thodes du Traitement Automatique de Langues d&#233;di&#233;es &#224;
la structuration de terminologie ind&#233;pendamment dans deux langues (anglais et fran&#231;ais) et
de fusionner ensuite les r&#233;sultats obtenus dans chaque langue. Les termes sont group&#233;s en
clusters gr&#226;ce aux relations g&#233;n&#233;r&#233;es. L&#8217;&#233;valuation de ces relations est effectu&#233;e au travers
de la comparaison des clusters avec des donn&#233;es de r&#233;f&#233;rence et la baseline, tandis que la
compl&#233;mentarit&#233; des relations est analys&#233;e au travers de leur implication dans la cr&#233;ation de
clusters de termes. Les r&#233;sultats obtenus indiquent que : chaque langue contribue de mani&#232;re
&#233;quilibr&#233;e aux r&#233;sultats, le nombre de relations hi&#233;rarchiques communes est plus grand que le
nombre de relations synonymiques communes. Globalement, les r&#233;sultats montrent que, dans
un contexte cross-langue, chaque langue permet de d&#233;tecter des r&#233;gularit&#233;s linguistiques et
s&#233;mantiques compl&#233;mentaires. L&#8217;union des r&#233;sultats obtenus dans les deux langues am&#233;liore la
qualit&#233; globale des clusters.
</p>
<p>ABSTRACT
Grouping of terms based on linguistic and semantic regularities in a cross-lingual context
</p>
<p>We propose to exploit the Natural Language Processing methods dedicated to terminology
structuring independently in two languages (English and French) and then to merge the results
obtained in each language. The terms are grouped into clusters thanks to the generated relations.
The evaluation of the relations is done via the comparison of the clusters with the reference
data and the baseline, while the complementarity of the relations is analyzed through their
involvement in the clusters of terms. Our results indicate that : each language contributes almost
equally to the generated results ; the number of common hierarchical relations is greater than
the number of common synonym relations. On the whole, the obtained results point out that in a
cross-language context, each language brings additional linguistic and semantic regularities. The
union of the results obtained in each language improves the overall quality of the clusters.
</p>
<p>MOTS-CL&#201;S : Relations s&#233;mantiques, termes, domaine de sp&#233;cialit&#233;, m&#233;decine, contexte cross-
langue.
</p>
<p>KEYWORDS: Semantic relations, terms, specialized areas, medicine, cross-lingual context.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>62 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Plusieurs travaux de recherche ont d&#233;montr&#233; qu&#8217;au travers des langues, il est possible de trouver
des r&#233;gularit&#233;s linguistiques et s&#233;mantiques. De plus, ces r&#233;gularit&#233;s peuvent &#234;tre renforc&#233;es
dans un contexte cross-langue. Ce point peut &#234;tre int&#233;ressant pour diff&#233;rentes applications du
Traitement Automatique de Langues (TAL). L&#8217;analyse de travaux existants en TAL et en linguistique
montre que le contexte cross-langue peut en effet &#234;tre exploit&#233; de diff&#233;rentes mani&#232;res :
&#8211; &#233;tudes comparatives, qui permettent de trouver des r&#233;gularit&#233;s et universaux interlangues. Ce
type d&#8217;approche a &#233;t&#233; par exemple exploit&#233;e pour l&#8217;&#233;tude de la grammaticalisation (Willett,
1988), de la modalit&#233; (Diewald et Smirnova, 2010), des structures argumentatives (Li, 2011)
ou stylistiques (Vinay et Darbelnet, 1958) ;
</p>
<p>&#8211; &#233;tudes cross-langues contrastives, qui visent &#224; faire des analyses comparatives entre les langues
afin de relever des constantes aux langues compar&#233;es et des diff&#233;rences propres &#224; chaque
langue (Cartoni et Namer, 2012; Lefer et Grabar, 2013) ;
</p>
<p>&#8211; transposition et adaptation de m&#233;thodes et ressources d&#8217;une langue vers une autre, qui visent
&#224; faire profiter une langue gr&#226;ce aux travaux, m&#233;thodes et ressources d&#233;j&#224; r&#233;alis&#233;s et &#233;prouv&#233;s
dans une autre langue (Farreres et al., 1998; Huang et al., 2002; Rodrigues et al., 2006) ;
</p>
<p>&#8211; collaboration entre les langues, qui vise &#224; appliquer des m&#233;thodes ou ressources dans des
langues diff&#233;rentes pour ensuite combiner les r&#233;sultats. Ce type d&#8217;approches a &#233;t&#233; par exemple
exploit&#233;e pour la d&#233;sambigu&#239;sation s&#233;mantique (Ceusters et al., 2003; Banea et al., 2011),
l&#8217;indexation et recherche d&#8217;information (Schulz et Hahn, 2000; Malais&#233; et al., 2007; Steinberger,
2011), et l&#8217;extraction d&#8217;information (Collier, 2011). Par ailleurs, la combinaison des r&#233;sultats
obtenus dans les langues diff&#233;rentes peut prendre diff&#233;rentes formes : un enrichissement
mutuel afin d&#8217;obtenir des r&#233;sultats plus exhaustifs, un syst&#232;me de vote ou de validation
mutuelle afin d&#8217;obtenir des r&#233;sultats plus pr&#233;cis, etc.
</p>
<p>Nous proposons de travailler en mode collaboratif entre les langues et visons essentiellement
l&#8217;am&#233;lioration de la compl&#233;tude des r&#233;sultats. L&#8217;hypoth&#232;se de notre travail est la suivante : le
traitement du m&#234;me mat&#233;riel avec les m&#234;mes m&#233;thodes dans deux langues (anglais et fran&#231;ais),
peut fournir des r&#233;sultats diff&#233;rents et compl&#233;mentaires, tandis que la combinaison de ces
r&#233;sultats peut am&#233;liorer les performances globales du syst&#232;me automatique.
</p>
<p>Nous d&#233;tectons les termes qui sont li&#233;s s&#233;mantiquement et les clusterisons. Nous travaillons
avec les termes m&#233;dicaux qui d&#233;crivent les effets ind&#233;sirables dus &#224; la prise de m&#233;dicaments.
La t&#226;che vis&#233;e dans notre travail est difficile, car il s&#8217;agit souvent de termes qui n&#8217;ont pas de
similarit&#233; lexicale entre eux, comme leuc&#233;mie (pathologie) et ponction de moelle osseuse anormale
(r&#233;sultats d&#8217;examen qui permet de la d&#233;tecter) (Fleischman, 2001). Cependant, l&#8217;&#233;tablissement
de relations est tr&#232;s utile pour plusieurs applications, comme (1) la recherche et l&#8217;extraction
d&#8217;information (Baeza-Yates et Ribeiro-Neto, 1999; Hahn et al., 2001; Alfonseca et al., 2002; Anizi
et Dichy, 2009), o&#249; il est tr&#232;s utile de pouvoir d&#233;tecter des contenus similaires afin d&#8217;augmenter
le rappel des syst&#232;mes automatiques, (2) l&#8217;alignement de terminologies (Fridman Noy et Musen,
2000; Marko et al., 2006), nombreuses dans le domaine m&#233;dical et dont l&#8217;interop&#233;rabilit&#233;
s&#233;mantique constitue un objectif tr&#232;s pris&#233; dans le contexte clinique, (3) la fouille de bases
de donn&#233;es de pharmacovigilance (Fescharek et al., 2004; Hauben et Bate, 2009) pour la
surveillance des m&#233;dicaments et la g&#233;n&#233;ration des alertes lorsqu&#8217;un m&#233;dicament pr&#233;sente un
danger statistiquement significatif pour la population. Notre travail concerne la surveillance des
m&#233;dicaments.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>63 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pour la d&#233;tection de relations s&#233;mantiques, nous proposons d&#8217;exploiter des m&#233;thodes de struc-
turation de termes ind&#233;pendamment sur deux langues (fran&#231;ais et anglais), puis de regrouper
les r&#233;sultats afin de consolider l&#8217;ensemble et en augmenter la qualit&#233;. Nous visons la d&#233;tection
de trois types de relations : variantes morpho-syntaxiques {st&#233;nose de l&#8217;aorte, st&#233;nose aortique},
synonymie {tumeur gastrique, cancer gastrique} et relations de subsomption hi&#233;rarchique {d&#233;-
faillance r&#233;nale, d&#233;faillance r&#233;nale post-op&#233;ratoire}. Nous pr&#233;sentons d&#8217;abord le mat&#233;riel (section
2) et d&#233;crivons la m&#233;thodologie (section 3). Nous pr&#233;sentons et discutons les r&#233;sultats obtenus
(section 4) et concluons avec des perspectives (section 5).
</p>
<p>2 Mat&#233;riel
</p>
<p>Type de mat&#233;riel anglais fran&#231;ais
1. Termes m&#233;dicaux 18 209 18 786
2. Donn&#233;es de r&#233;f&#233;rence 84 84
3. Ressources linguistiques
UMLS : Synonymes d&#8217;UMLS 227 887 126 892
3t : Synonymes biom&#233;dicaux acquis 28 691 1 314
Gen : Synonymes de la langue g&#233;n&#233;rale 50 970 115 720
</p>
<p>TABLE 1 &#8211; Mat&#233;riel trait&#233; et exploit&#233; dans les deux langues (anglais et fran&#231;ais).
</p>
<p>Nous exploitons trois types de mat&#233;riel (table 1). Chaque mat&#233;riel existe en anglais et en fran&#231;ais :
il s&#8217;agit de ressources qui ont des contenus comparables dans les deux langues.
</p>
<p>2.1 Termes de pharmacovigilance
</p>
<p>Les termes exploit&#233;s proviennent de la terminologie MedDRA (Medical Dictionary for Regulatory
Activities) (Brown et al., 1999), cr&#233;&#233;e pour l&#8217;indexation, l&#8217;analyse et la surveillance des effets
ind&#233;sirables de m&#233;dicaments. C&#8217;est une terminologie internationale cr&#233;&#233;e et maintenue en anglais,
et traduite en fran&#231;ais et espagnol. Nous exploitons les termes pr&#233;f&#233;r&#233;s PT de cette terminologie
en anglais et en fran&#231;ais, 18 209 et 18 786 respectivement. Il s&#8217;agit donc globalement du m&#234;me
ensemble de termes, mais dont les libell&#233;s sont en langues diff&#233;rentes (anglais et fran&#231;ais) :
leukaemia et leuc&#233;mie, B-cell type acute leukaemia et Leuc&#233;mie B aigu&#235;, atypical depressive disorder
et trouble d&#233;pressif atypique, etc. Chaque terme re&#231;oit un identifiant unique, qui reste le m&#234;me
quelle que soit la langue de la terminologie. Les termes de MedDRA sont structur&#233;s en cinq
niveaux hi&#233;rarchiques. Au-dessus des termes PT , que nous exploitons, les termes de niveau HLT
(High Level Terms) subsument hi&#233;rarchiquement les termes PT .
</p>
<p>2.2 Donn&#233;es de r&#233;f&#233;rence
</p>
<p>Les donn&#233;es de r&#233;f&#233;rence se pr&#233;sentent sous forme de clusters de termes li&#233;s &#224; une condition
m&#233;dicale donn&#233;e. Ces donn&#233;es sont ind&#233;pendantes de notre travail et elles ont &#233;t&#233; constitu&#233;es
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>64 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>manuellement par des groupes d&#8217;experts. Il existe actuellement 84 clusters (CIOMS, 2004).
Les conditions m&#233;dicales sont par exemple : Affections h&#233;patiques, Rhabdomyolyse/Myopathie,
Infarctus myocardique, Convulsions. Il s&#8217;agit des conditions m&#233;dicales graves qui peuvent causer
des atteintes de sant&#233; et des hospitalisations, voire un d&#233;c&#232;s. Les donn&#233;es de r&#233;f&#233;rence contiennent
des relations s&#233;mantiques implicites entre les termes : on sait que tous les termes au sein des
clusters de r&#233;f&#233;rence sont li&#233;s &#224; une condition m&#233;dicale mais la logique ou bien la nature de
relations entre les termes ne sont pas connues.
</p>
<p>2.3 Ressources linguistiques
</p>
<p>Les ressources linguistiques externes que nous utilisons apportent des connaissances linguistiques
et s&#233;mantiques sur les mots des termes. Ces ressources sont aussi en deux langues, fran&#231;ais et
anglais. Typiquement, ces ressources contiennent des relations de synonymie entre les mots ou
les termes, comme par exemple {accord, concordance}, {aceperone, acetabutone} ou {bleeding,
hemorrhage}. Trois types de synonymes sont utilis&#233;s :
UMLS : synonymes de la langue m&#233;dicale extraits directement de la ressource terminologique
</p>
<p>UMLS (Unified Medical Language System) (NLM, 2011). Ces synonymes correspondent aux
termes qui appartiennent &#224; un m&#234;me concept d&#8217;UMLS ;
</p>
<p>3t : ressources de synonymie construites lors des travaux pr&#233;c&#233;dents pour le fran&#231;ais (Grabar
et al., 2009) et l&#8217;anglais (Grabar et Hamon, 2010). Elles sont &#233;galement adapt&#233;es &#224; la
langue m&#233;dicale car elles ont &#233;t&#233; acquises &#224; partir de trois terminologies biom&#233;dicales
gr&#226;ce &#224; l&#8217;exploitation du principe de compositionnalit&#233; ;
</p>
<p>Gen : synonymes de la langue g&#233;n&#233;rale fournis par le WordNet (Fellbaum, 1998) en anglais et
par le Petit Robert (Robert, 1990) en fran&#231;ais.
</p>
<p>3 M&#233;thodologie pour la d&#233;tection de relations s&#233;mantiques
</p>
<p>Etiquetage MS
Analyse syntaxique
</p>
<p>Plateforme Ogmios
Genia/Tree tagger
YaTeAde termes
</p>
<p>MedDRA
Liste
</p>
<p>D&#233;tection de
hi&#233;rarchiques
</p>
<p>relations
</p>
<p>synonymes
D&#233;tection de
</p>
<p>Inclusion lexicale
Faster
</p>
<p>Faster
SynotermRessources
</p>
<p>lexicales
</p>
<p>dans les deux
langues
</p>
<p>Union de
clusters
</p>
<p>Evaluation
Comparaison
Analyse
</p>
<p>de r&#233;f&#233;rence
Donn&#233;es
Baseline
</p>
<p>Traitement des termes en anglais et en fran&#231;ais
Pr&#233;&#8722;traitement Structuration de termes
</p>
<p>Composantes fortement connexes
</p>
<p>Clusterisation dans
des graphes orient&#233;s
</p>
<p>FIGURE 1 &#8211; Sch&#233;ma g&#233;n&#233;ral de la m&#233;thode.
</p>
<p>&#192; la figure 1, nous pr&#233;sentons le sch&#233;ma g&#233;n&#233;ral de notre approche. Si la d&#233;tection de relations
s&#233;mantiques est l&#8217;&#233;tape principale, notre approche comporte quatre autres &#233;tapes : le pr&#233;-
traitement des termes, la clusterisation des relations g&#233;n&#233;r&#233;es, l&#8217;union des clusters g&#233;n&#233;r&#233;s
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>65 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>dans chaque langue, et l&#8217;&#233;valuation des clusters (dans chaque langue et apr&#232;s leur union). La
clusterisation est n&#233;cessaire pour effectuer l&#8217;&#233;valuation. Comme nous l&#8217;avons indiqu&#233; (section
2.2), les donn&#233;es de r&#233;f&#233;rence sont des clusters de termes relatifs &#224; une condition m&#233;dicale
donn&#233;e. Au sein de ces clusters, les termes ont des relations s&#233;mantiques (et m&#233;dicales) entre
eux, mais ces relations ne sont pas explicites. L&#8217;&#233;valuation, que nous pouvons effectuer avec
ces donn&#233;es de r&#233;f&#233;rence, porte donc sur l&#8217;appartenance des termes &#224; un cluster de termes
ind&#233;pendamment des types de relations qui ont permis de relier ces termes.
</p>
<p>La m&#233;thodologie que nous proposons est guid&#233;e par les donn&#233;es langagi&#232;res et leurs propri&#233;t&#233;s
telles que d&#233;tect&#233;es dans le corpus de termes exploit&#233;s dans les deux langues. Notre m&#233;thodologie
ne requiert donc pas une &#233;tape d&#8217;apprentissage, elle ne requiert pas non plus de ressources
s&#233;mantiques sp&#233;cifiques. Dans la suite de cette section, nous pr&#233;sentons les cinq &#233;tapes de
l&#8217;approche : (1) op&#233;rations effectu&#233;es pour le pr&#233;-traitement des termes (section 3.1), (2) &#233;tape
de d&#233;tection de relations s&#233;mantiques entre les termes (section 3.2), (3) clusterisation des termes
gr&#226;ce aux relations g&#233;n&#233;r&#233;es (section 3.3), (4) union de clusters g&#233;n&#233;r&#233;s dans chacune des deux
langues (section 3.4), et (5) &#233;valuation (section 3.5). Il est important de souligner que, de la
m&#234;me mani&#232;re que le mat&#233;riel, nous effectuons les m&#234;mes traitements dans les deux langues :
les m&#233;thodes et ressources exploit&#233;es sont en effet adapt&#233;es aux deux langues trait&#233;es.
</p>
<p>3.1 Pr&#233;-traitement des termes
</p>
<p>Le pr&#233;-traitement est effectu&#233; avec la plate-forme Ogmios (Hamon et Nazarenko, 2008). Apr&#232;s la
segmentation en mots, les termes sont &#233;tiquet&#233;s morpho-syntaxiquement avec l&#8217;&#233;tiqueteur Genia
(Tsuruoka et al., 2005) en anglais et TreeTagger (Schmid, 1994) en fran&#231;ais. Comme les termes
sont des structures syntaxiques particuli&#232;res (souvent des groupes nominaux et non pas des
phrases bien form&#233;es) et pour garantir une meilleure qualit&#233; de l&#8217;&#233;tiquetage, nous transformons
les termes en pseudo-phrases bien form&#233;es. Par exemple, le terme fibrome du sein est transform&#233;
en C&#8217;est un fibrome du sein. Par la suite, seuls les mots originaux des termes (fibrome du sein)
sont consid&#233;r&#233;s. Les termes sont aussi trait&#233;s par l&#8217;analyseur syntaxique YATEA (Aubin et Hamon,
2006), qui permet de d&#233;tecter les d&#233;pendances syntaxiques au sein des termes.
</p>
<p>3.2 M&#233;thodes de structuration de termes
</p>
<p>Nous appliquons trois m&#233;thodes de l&#8217;&#233;tat de l&#8217;art pour l&#8217;acquisition de relations s&#233;mantiques
entre termes. Les relations vis&#233;es sont la synonymie, la variation morpho-syntaxique et les
relations hi&#233;rarchiques. Nous nous attendons &#224; ce que ces relations relient des termes qui sont
des &#233;quivalents s&#233;mantiques dans le contexte de notre travail. L&#8217;originalit&#233; et l&#8217;apport de notre
travail concerne : (1) l&#8217;application de ces m&#233;thodes dans le contexte biom&#233;dical et aux donn&#233;es
en deux langues, et (2) l&#8217;exploitation du contexte cross-langue pour exploiter les r&#233;gularit&#233;s
s&#233;mantiques des termes dans deux langues et pour obtenir ainsi des r&#233;sultats plus performants.
</p>
<p>Variantes morpho-syntaxiques. L&#8217;identification de variantes morpho-syntaxique est effectu&#233;e
avec Faster (Jacquemin, 1996). Trois r&#232;gles de transformation sont appliqu&#233;es : insertion (cardiac
disease/cardiac valve disease), d&#233;rivation morphologique (artery restenosis/arterial restenosis) et
permutation (aorta coarctation/coarctation of the aorta). Nous &#233;tablissons une correspondance
entre ces r&#232;gles et les types de relations s&#233;mantiques :
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>66 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#8211; l&#8217;insertion introduit les relations hi&#233;rarchiques : cardiac valve disease est plus sp&#233;cifique que
cardiac disease,
</p>
<p>&#8211; la permutation introduit les relations de synonymie : aorta coarctation et coarctation of the
aorta sont en effet tr&#232;s proches s&#233;mantiquement,
</p>
<p>&#8211; la d&#233;rivation morphologique introduit aussi des relations de synonymie : artery
restenosis/arterial restenosis,
</p>
<p>&#8211; par contre, lorsque plusieurs r&#232;gles sont impliqu&#233;es et lorsqu&#8217;il s&#8217;agit de r&#232;gles correspondant
aux relations hi&#233;rarchiques et de synonymie, ce sont les relations hi&#233;rarchiques qui pr&#233;valent
(parce qu&#8217;elles sont plus sp&#233;cifiques). Ainsi, pour la paire gland abscess et abscess of salivary
gland, qui montre une insertion et une permutation, nous retenons la relation hi&#233;rarchique.
</p>
<p>Compositionnalit&#233; et synonymie. Les relations de synonymie sont acquises de deux mani&#232;res :
&#8211; la relation de synonymie est &#233;tablie entre deux termes simples si cette relation existe dans les
</p>
<p>ressources linguistiques ;
&#8211; la relation de synonymie est &#233;tablie entre deux termes complexes si la compositionnalit&#233;
s&#233;mantique (Partee, 1984) est v&#233;rifi&#233;e pour ces termes. Ainsi, deux termes complexes sont
consid&#233;r&#233;s comme synonymes si au moins un de leurs composants &#224; une position syntaxique
donn&#233;e est synonyme et l&#8217;autre composant est identique (Hamon et Nazarenko, 2001). Par
exemple, &#233;tant donn&#233; la relation de synonymie entre deux mots, tumeur et cancer, les termes
tumeur gastrique et cancer gastrique sont identifi&#233;s comme synonymes.
</p>
<p>Inclusion lexicale et hi&#233;rarchie. Selon l&#8217;hypoth&#232;se de l&#8217;inclusion lexicale (Kleiber et Tamba,
1990), il existe une relation de subsomption hi&#233;rarchique entre deux termes lorsqu&#8217;un terme
est lexicalement inclus, &#224; une position syntaxique donn&#233;e, dans un autre terme. Par exemple, le
terme court cancer est le p&#232;re hi&#233;rarchique, tandis que le terme long cancer gastrique est le fils
hi&#233;rarchique parce que cancer est la t&#234;te syntaxique de cancer gastrique.
</p>
<p>3.3 Clusterisation de termes
</p>
<p>Les termes et les relations hi&#233;rarchiques sont repr&#233;sent&#233;s sous forme de graphes orient&#233;s : les
termes sont les noeuds et les liens hi&#233;rarchiques les arcs orient&#233;s. Ces graphes sont partitionn&#233;s en
composantes fortement connexes : dans un graphe orient&#233; G, nous identifions des sous-graphes
maximaux H de G, o&#249; pour chaque paire {x , y} de noeuds de H, il existe un chemin compos&#233;
d&#8217;arcs orient&#233;s de x &#224; y. Avec ce type de composantes, un terme peut appartenir &#224; plus d&#8217;un
cluster, ce qui est aussi le cas des donn&#233;es de r&#233;f&#233;rence. Les clusters peuvent correspondre aux
ensembles ou aux sous-ensembles des donn&#233;es de r&#233;f&#233;rence. Pour am&#233;liorer la couverture, nous
ajoutons les synonymes : si un terme a une relation de synonymie avec un terme du cluster, ce
terme est ajout&#233; au cluster. Le terme central d&#8217;un cluster lui donne son libell&#233;.
</p>
<p>3.4 Union de clusters g&#233;n&#233;r&#233;s dans les deux langues
</p>
<p>L&#8217;union de clusters, g&#233;n&#233;r&#233;s dans chaque langue, repose sur le libell&#233; de ces clusters. Comme nous
l&#8217;avons indiqu&#233; dans la section 2, chaque terme MedDRA re&#231;oit un identifiant unique, qui reste le
m&#234;me quelle que soit la langue de ses termes. Ces deux informations (les libell&#233;s des clusters et
les identifiant de ces libell&#233;s) permettent d&#8217;&#233;tablir le lien entre les clusters correspondants dans
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>67 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>chacune des langues. Ainsi, lorsqu&#8217;il existe des clusters avec les m&#234;mes libell&#233;s dans les deux
langues, ils sont fusionn&#233;s, sinon l&#8217;union ne peut pas avoir lieu.
</p>
<p>3.5 &#201;valuation et analyse de la compl&#233;mentarit&#233;
</p>
<p>Pour pouvoir exploiter ces donn&#233;es de r&#233;f&#233;rence, nous consid&#233;rons l&#8217;ensemble des termes au sein
des clusters et non pas chaque relation prise individuellement.
</p>
<p>Le lien entre les clusters g&#233;n&#233;r&#233;s et les clusters de r&#233;f&#233;rence est effectu&#233; gr&#226;ce au nombre de
termes qu&#8217;ils partagent : pour un cluster de r&#233;f&#233;rence donn&#233;, nous s&#233;lectionnons celui des clusters
g&#233;n&#233;r&#233;s qui partage le plus de termes communs avec lui. Une fois que les clusters de r&#233;f&#233;rence
sont associ&#233;s avec les clusters g&#233;n&#233;r&#233;s, les relations s&#233;mantiques g&#233;n&#233;r&#233;es sont &#233;valu&#233;es contre
les donn&#233;es de r&#233;f&#233;rence avec trois mesures :
&#8211; pr&#233;cision P (nombre de termes pertinents au sein d&#8217;un cluster divis&#233; par le nombre total de
</p>
<p>termes au sein de ce cluster),
&#8211; rappel R (nombre de termes pertinents au sein d&#8217;un cluster divis&#233; par le nombre total de termes
</p>
<p>dans le cluster de r&#233;f&#233;rence correspondant),
&#8211; F-mesure F1 (la moyenne harmonique de P et de R).
</p>
<p>Pour l&#8217;analyse de la compl&#233;mentarit&#233;, nous analysons par exemple les points suivants :
&#8211; existence de relations uniques et communes entre les deux langues,
&#8211; am&#233;lioration de la couverture et/ou de la pr&#233;cision des r&#233;sultats &#224; l&#8217;aide des informations
</p>
<p>issues de deux langues.
</p>
<p>Pour la baseline, nous exploitons l&#8217;approche la plus commun&#233;ment utilis&#233;e pour ce type de t&#226;che :
les relations s&#233;mantiques qui correspondent aux relations hi&#233;rarchiques de MedDRA (Mozzicato,
2007; Pearson et al., 2009; Yuen et al., 2008). Plus particuli&#232;rement, il s&#8217;agit de l&#8217;exploitation
de la subsomption hi&#233;rarchique des termes PT au travers de leurs termes HLT de MedDRA.
Parmis les 1 688 HLT et 84 groupements de r&#233;f&#233;rence, 46 ont une correspondance directe
(Thrombocytopenias et Thrombocytopenia (HLT)) ou une correspondance non ambigu&#235; (Renal
failure and impairment et Acute renal failure (HLT)). Nous utilisons ces 46 clusters de r&#233;f&#233;rence
pour l&#8217;&#233;valuation des r&#233;sultats obtenus avec la baseline. Ces 46 clusters sont un sous-ensemble
de toutes les donn&#233;es de r&#233;f&#233;rence (84 clusters).
</p>
<p>4 R&#233;sultats et Discussion
</p>
<p>4.1 D&#233;tection de relations s&#233;mantiques
</p>
<p>Dans la table 2, nous indiquons le nombre de relations acquises dans les deux langues. Nous
pouvons faire les observations suivantes :
&#8211; il existe plus de relations g&#233;n&#233;r&#233;es en anglais qu&#8217;en fran&#231;ais,
&#8211; chaque ressource linguistique exploit&#233;e en anglais contribue &#224; l&#8217;acquisition de relations entre
</p>
<p>les termes, tandis qu&#8217;en fran&#231;ais les synonymes d&#8217;UMLS ne fournissent pas de r&#233;sultats,
&#8211; l&#8217;ensemble de relations hi&#233;rarchiques induites avec la subsomption lexicale en fran&#231;ais (3 980)
</p>
<p>est plus grand qu&#8217;en anglais (3 366).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>68 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Relations et m&#233;thodes # relations
anglais fran&#231;ais
</p>
<p>Hi&#233;rarchique (inclusion lexicale) 3 366 3 980
Hi&#233;rarchique (variantes morpho-synt.) 316 178
Synonymie (UMLS) 54 -
Synonymie (relations acquises) 1 110 31
Synonymie (termes simples) 214 -
Synonymie (langue g&#233;n&#233;rale) 28 142
Nombre total de synonymes 1 459 164
</p>
<p>TABLE 2 &#8211; Relations g&#233;n&#233;r&#233;es dans chaque langue.
</p>
<p>Une remarque int&#233;ressante peut aussi &#234;tre faite sur l&#8217;apport de ressources linguistiques. Nous
voyons par exemple que les synonymes d&#8217;UMLS, qui sont directement accessibles dans cette
ressource, fournissent un apport faible en anglais et un apport nul en fran&#231;ais. Nos r&#233;sultats
indiquent ainsi clairement l&#8217;int&#233;r&#234;t de construire et d&#8217;utiliser d&#8217;autres ressources linguistiques.
</p>
<p>4.2 G&#233;n&#233;ration de clusters
</p>
<p>anglais fran&#231;ais union
Nombre de clusters 965 1 133 1 571
Taille des clusters (intervalle) [2 ; 257] [2 ; 205] [2 ; 301]
Taille des clusters (moyenne) 6,39 4,97 6
</p>
<p>TABLE 3 &#8211; Clusters g&#233;n&#233;r&#233;s dans chaque langue (anglais, fran&#231;ais) et avec leur union.
</p>
<p>La table 3 contient les donn&#233;es sur les clusters g&#233;n&#233;r&#233;s. Nous pouvons observer que le nombre de
clusters, aussi bien que leurs tailles, sont plus grands lorsque les donn&#233;es des deux langues sont
consid&#233;r&#233;es. Ainsi, les deux langues sont compl&#233;mentaires de diff&#233;rents points de vue : au niveau
des relations et au niveau des clusters.
</p>
<p>Relations et m&#233;thodes % dans les clusters
anglais fran&#231;ais union
</p>
<p>Hi&#233;rarchique (inclusion lexicale) 79,57 96,66 89,2
Hi&#233;rarchique (variantes morpho-synt.) 8,62 2,56 4,36
Synonymes 11,81 0,78 6,44
</p>
<p>TABLE 4 &#8211; Participation des relations dans la cr&#233;ation de clusters.
</p>
<p>Dans la table 4, nous indiquons &#224; quelle hauteur les relations acquises participent dans la popula-
tion des clusters. Ces valeurs sont indiqu&#233;es en pourcentage par type de relations (hi&#233;rarchique,
synonymie). Nous pouvons voir que les relations acquises par la subsomption hi&#233;rarchique
apportent la majorit&#233; de termes dans les clusters (79,57 % en anglais et jusqu&#8217;&#224; 96,66 % en
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>69 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>fran&#231;ais), tandis que les relations de synonymie montrent seulement un impact tr&#232;s faible sur les
clusters (moins de 1 % en fran&#231;ais, mais jusqu&#8217;&#224; 11,81 % en anglais).
</p>
<p>4.3 Compl&#233;mentarit&#233; des deux langues
</p>
<p>Relations anglais fran&#231;ais intersection
Hi&#233;rarchique 1 919 2 395 1 763
Synonymie 1 332 137 27
Total 3 251 2 532 1 790
</p>
<p>TABLE 5 &#8211; Nombre de relations sp&#233;cifiques et communes (intersection) aux langues.
</p>
<p>La table 5 indique la compl&#233;mentarit&#233; entre les deux langues pour chaque type de relations :
seulement 27 relations de synonymie, mais jusqu&#8217;&#224; 1 763 relations hi&#233;rarchiques sont communes
aux deux langues. Nous pouvons ainsi observer que la g&#233;n&#233;ration de relations hi&#233;rarchiques
permet de d&#233;tecter plus de r&#233;gularit&#233;s communes dans les deux langues. Mais plusieurs relations
sont uniques &#224; une langue (i.e., {abdominal rebound tenderness, abdominal tenderness} en anglais,
{fibrome du sein, tumeur du sein} en fran&#231;ais). De mani&#232;re g&#233;n&#233;rale, l&#8217;union indique que les
langues contribuent de mani&#232;re quasiment &#233;gale : 39,69 % de termes uniques en anglais, 34,03 %
uniques en fran&#231;ais, et 26,27 % de termes communs aux deux langues.
</p>
<p>Leuc&#233;mie aigu&#235;
 biph&#233;notypique
</p>
<p>Leuc&#233;mie aigu&#235;
 lymphoblastique monocytaire aigu&#235;
</p>
<p>Lymphome B
</p>
<p> aigu&#235; r&#233;currente
</p>
<p>Leuc&#233;mie
</p>
<p>Lymphome
</p>
<p>Leuc&#233;mie
 chronique
</p>
<p> my&#233;lo&#239;de
Leuc&#233;mie
</p>
<p> aigu&#235;
</p>
<p>Leuc&#233;mie aigu&#235;
 my&#233;lomonocytaire
</p>
<p>Leuc&#233;mie aigu&#235;
&#224; promy&#233;locytes
</p>
<p>Leuc&#233;mie B aigu&#235;
</p>
<p>Leuc&#233;mie aigu&#235;
 m&#233;gacaryoblastique
</p>
<p>Leuc&#233;mie
</p>
<p>Leuc&#233;mie
 my&#233;lo&#239;de aigu&#235;
</p>
<p>Lymphome
lymphocytique
</p>
<p>Leuc&#233;mie
 aleuc&#233;mique
</p>
<p>Leuc&#233;mie
 lymphocytaire
</p>
<p>Leuc&#233;mie my&#233;lo&#239;de
</p>
<p>Leuc&#233;mie
</p>
<p>inclu en/fr
</p>
<p>inclu en/fr
inclu en/fr
</p>
<p>inclu en/fr
</p>
<p>inclu en/fr
</p>
<p>fst en
</p>
<p>fst en
</p>
<p>st 3t/gen en
</p>
<p>inclu en/fr inclu fr
</p>
<p>st 3t/gen en
st 3t/gen en
</p>
<p>st 3t/gen en
st 3t/gen en
</p>
<p>st 3t/gen en
</p>
<p>inclu en
</p>
<p>ss en
</p>
<p>fst en
</p>
<p>fst en
</p>
<p>inclu fr
</p>
<p>inclu fr
</p>
<p>inclu en/fr
</p>
<p>fst en
</p>
<p>FIGURE 2 &#8211; Exemple de graphe (extrait du cluster leuc&#233;mie).
</p>
<p>&#192; la figure 2, nous pr&#233;sentons un extrait de graphe sur l&#8217;exemple du cluster leuc&#233;mie. Diff&#233;rentes
couleurs de fl&#232;ches correspondent aux diff&#233;rentes m&#233;thodes qui relient les termes (inclusion
lexicale en bleu, Faster en vert, synonymie en rouge). Les fl&#232;ches unidirectionnelles sont des
relations hi&#233;rarchiques, les fl&#232;ches bidirectionnelles sont des relations de synonymie. Nous
indiquons &#233;galement la et les langues o&#249; une relation donn&#233;e a &#233;t&#233; d&#233;tect&#233;e. Souvent les
inclusions lexicales sont d&#233;tect&#233;es dans les deux langues. Mais il arrive aussi que le libell&#233; d&#8217;un
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>70 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>terme ne permet de d&#233;tecter une relation que dans une seule langue : les termes acute leukaemia
et b-cell type acute leukaemia n&#8217;ont pas pu &#234;tre reli&#233;s en anglais car les libell&#233;s sont trop &#233;loign&#233;s
lexicalement, par contre cette relation a &#233;t&#233; &#233;tablie en fran&#231;ais entre les termes correspondants
leuc&#233;mie aigu&#235; et leuc&#233;mie B aigu&#235;. Nous pouvons aussi voir que la synonymie est surtout d&#233;tect&#233;e
en anglais (ressources de synonymie plus compl&#232;tes). La synonymie directe entre les termes
simples relie une seule paire de termes (leukaemia et lymphoma) dans cet exemple. Rappelons
que les termes trait&#233;s proviennent du m&#234;me niveau hi&#233;rarchique dans MedDRA, alors que nous
voyons que plusieurs niveaux de relations hi&#233;rarchiques peuvent &#234;tre d&#233;tect&#233;s : la structure
actuelle de la terminologie MedDRA pourrait &#234;tre affin&#233;e.
</p>
<p>4.4 &#201;valuation
</p>
<p>(a) Pr&#233;cision (moyenne) : anglais
64,7%, fran&#231;ais 70%, union 69,5%
</p>
<p>(b) Rappel (moyenne) : anglais 9,5%,
fran&#231;ais 8,5%, union 12%
</p>
<p>(c) F-mesure (moyenne) : anglais
16,5, fran&#231;ais 15, union 20,4
</p>
<p>FIGURE 3 &#8211; &#201;valuation des clusters g&#233;n&#233;r&#233;s par rapport aux donn&#233;es de r&#233;f&#233;rence (84 clusters).
</p>
<p>Les r&#233;sultats de l&#8217;&#233;valuation par rapport aux donn&#233;es de r&#233;f&#233;rence sont indiqu&#233;s &#224; la figure 3.
Pour leur pr&#233;sentation, nous ne les projetons pas sur les axes x et y , mais sur un plan circulaire.
Chaque rayon correspond &#224; un cluster de r&#233;f&#233;rence (un total de 84 clusters de r&#233;f&#233;rence). L&#8217;&#233;chelle
du rayon, r&#233;gl&#233;e en mode logarithmique, va de 0 &#224; 100 et permet de positionner les valeurs
d&#8217;&#233;valuation (pr&#233;cision, rappel et F-mesure). Dans cette pr&#233;sentation, plus une ligne (et une
m&#233;thode) est proche du bord ext&#233;rieur, meilleurs sont les r&#233;sultats correspondants. Nous pouvons
faire plusieurs observations sur les r&#233;sultats obtenus :
&#8211; Tr&#232;s souvent, la pr&#233;cision est &#233;lev&#233;e tandis que le rappel est faible. La raison g&#233;n&#233;rale est que
</p>
<p>les clusters g&#233;n&#233;r&#233;s sont plus petits que les clusters de r&#233;f&#233;rence et peuvent de ce fait montrer
leurs diff&#233;rents aspects. Du point de vue de la m&#233;thodologie, cela veut dire que les approches
exploit&#233;es ne permettent pas de d&#233;tecter toutes les relations qui seraient n&#233;cessaires pour
grouper les termes des clusters de r&#233;f&#233;rence de mani&#232;re automatique. Par exemple, nous ne
d&#233;tectons pas de relations entre les termes ponction de moelle osseuse anormale (aspiration bone
marrow abnormal), an&#233;mie r&#233;fractaire (anemia refractory) et leuc&#233;mie (leukaemia) qui sont
pourtant tous li&#233;s aux anomalies du sang : ponction de moelle osseuse anormale est le r&#233;sultat
d&#8217;examen m&#233;dical qui permet de d&#233;pister de telles anomalies, an&#233;mie r&#233;fractaire est une des
cons&#233;quences possibles des leuc&#233;mies.
</p>
<p>&#8211; L&#8217;union des deux langues montre un effet positif sur le rappel et la F-mesure surtout. Notons
que, contrairement &#224; notre attente, la pr&#233;cision ne souffre pas beaucoup de l&#8217;union : elle est
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>71 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>am&#233;lior&#233;e par rapport &#224; la valeur obtenue sur l&#8217;anglais (+4,8 %), mais elle perd 0,5 % par
rapport &#224; la valeur obtenue sur le fran&#231;ais.
</p>
<p>&#8211; Il existe une variabilit&#233; importante entre les performances de diff&#233;rents clusters g&#233;n&#233;r&#233;s. Cela
est observable sur la forme des trac&#233;s : par exemple, pour la pr&#233;cision, presque la moiti&#233; des
clusters g&#233;n&#233;r&#233;s montre des valeurs maximales (100 %) ou proches, mais pour les clusters
restants, ces valeurs diminuent jusqu&#8217;&#224; 10 %.
</p>
<p>(a) Pr&#233;cision (moyenne) : anglais
71,1 %, fran&#231;ais 70,5 %, union 74 %,
baseline 69,3 %
</p>
<p>(b) Rappel (moyenne) : anglais
11,8 %, fran&#231;ais 8,4 %, union 12,1 %,
baseline 9,2 %
</p>
<p>(c) F-mesure (moyenne) : anglais
18,9, fran&#231;ais 14, union 18,3, base-
line 14,6
</p>
<p>FIGURE 4 &#8211; &#201;valuation des clusters g&#233;n&#233;r&#233;s par rapport &#224; la baseline et aux donn&#233;es de r&#233;f&#233;rence.
</p>
<p>L&#8217;&#233;valuation par rapport &#224; la baseline (figure 4) indique que les r&#233;sultats obtenus sur l&#8217;anglais sont
meilleurs que la baseline, les r&#233;sultats obtenus sur le fran&#231;ais sont comparables et parfois moins
bons que la baseline. Nous pouvons voir aussi que la qualit&#233; des clusters de la baseline d&#233;cro&#238;t
plus rapidement que dans les autres exp&#233;riences, et ceci pour les trois mesures d&#8217;&#233;valuation. En
ce qui concerne les r&#233;sultats de l&#8217;union, ils sont &#224; la fois meilleurs que la baseline et meilleurs
que chaque langue prise s&#233;par&#233;ment (sauf une perte de 0,6 % pour la F-mesure).
</p>
<p>Les performances d&#8217;autres m&#233;thodes automatiques exploit&#233;es pour cette t&#226;che (similarit&#233; s&#233;man-
tique (Iavindrasana et al., 2006; Dupuch et al., 2012), requ&#234;tes OWL (Declerck et al., 2012)
ou subsomption hi&#233;rarchique (Jaulent et Alecu, 2009)) conduisent aux m&#234;mes observations,
lorsque une &#233;valuation est effectu&#233;e : une des mesures d&#8217;&#233;valuation est privil&#233;gi&#233;e. Notons que
ces m&#233;thodes exploitent souvent des ressources d&#233;di&#233;es &#224; leur fonctionnement et qu&#8217;il est alors
n&#233;cessaire d&#8217;y encoder les connaissances n&#233;cessaires &#224; leur fonctionnement. Les avantages de
notre approche sont : (1) elle ne requiert pas la cr&#233;ation d&#8217;une ressource s&#233;mantique (terminolo-
gie ou ontologie) d&#233;di&#233;e ; (2) elle n&#8217;est pas consommatrice en temps et effort pour constituer
cette ressource, car elle fonctionne dans un contexte s&#233;mantique relativement pauvre ; (3) elle
peut &#234;tre exploit&#233;e avec une simple liste de termes et des ressources linguistiques disponibles ; (4)
elle n&#8217;est pas sp&#233;cifique aux donn&#233;es et &#224; la t&#226;che trait&#233;e ici et peut &#234;tre exploit&#233;e dans d&#8217;autres
contextes (acquisition de relations terminologiques, terminologies &#224; facettes...).
</p>
<p>5 Conclusion et perspectives
</p>
<p>Nous avons propos&#233; et r&#233;alis&#233; des exp&#233;riences consistant &#224; exploiter des donn&#233;es linguistiques
provenant de deux langues, anglais et fran&#231;ais, pour obtenir des r&#233;sultats plus complets et
performants en d&#233;tection de relations s&#233;mantiques entre les termes m&#233;dicaux. L&#8217;objectif principal
a consist&#233; en v&#233;rification de la compl&#233;mentarit&#233; entre les langues. En effet, lorsque les m&#234;mes
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>72 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>m&#233;thodes sont appliqu&#233;es aux m&#234;mes ensembles de termes dans des langues diff&#233;rentes, la
diff&#233;rence dans les r&#233;sultats provient essentiellement du fait que les libell&#233;s de ces termes sont
diff&#233;rents et qu&#8217;ils permettent de d&#233;tecter des r&#233;gularit&#233;s linguistiques et s&#233;mantiques diff&#233;rentes
et compl&#233;mentaires. De mani&#232;re g&#233;n&#233;rale, cette approche a permis d&#8217;am&#233;liorer les r&#233;sultats
obtenus en termes de pr&#233;cision, de rappel et de la F-mesure. Nous avons par exemple observ&#233;
que chaque langue contribue de mani&#232;re quasiment &#233;quivalente, m&#234;me si l&#8217;apport par types de
relations n&#8217;est pas comparable (les relations hi&#233;rarchiques sont beaucoup plus nombreuses que
les relations de synonymie). La t&#226;che vis&#233;e dans notre travail (d&#233;tection de relations s&#233;mantiques
et m&#233;dicales entre termes) est difficile, car il s&#8217;agit souvent de termes qui n&#8217;ont pas de similarit&#233;
lexicale entre eux. La difficult&#233; de la t&#226;che est due aussi au fait que la surveillance des effets
ind&#233;sirables est effectu&#233;e dans un contexte r&#233;glementaire tr&#232;s strict. Cependant, avec la m&#233;thode
propos&#233;e nous obtenons de meilleurs r&#233;sultats que ceux fournis par la baseline. De plus, notre
m&#233;thode fonctionne avec des m&#233;thodes et ressources assez &#8220;pauvres&#8221;, qui ne requi&#232;rent pas de
ressources terminologiques ou ontologiques d&#233;di&#233;es.
</p>
<p>Nous avons plusieurs perspectives &#224; ce travail : (1) enrichissement des ressources linguistiques
avec des ressources de type associatif qui pourraient &#234;tre acquises avec des m&#233;thodes distribution-
nelles &#224; partir de corpus et/ou de terminologies ; (2) exploitation de la m&#233;thode compositionnelle
non seulement pour construire des ressources linguistiques de synonymie mais aussi pour ac-
qu&#233;rir des relations hi&#233;rarchiques ou associatives ; (3) exploration de corpus et application
d&#8217;autres m&#233;thodes pour la d&#233;tection automatique de relations s&#233;mantiques entre les termes ; (4)
combinaison des r&#233;sultats pr&#233;sent&#233;es dans ce travail avec ceux obtenus avec d&#8217;autres m&#233;thodes
automatiques (Dupuch et al., 2012) ; (5) clusterisation des termes avec d&#8217;autres approches, mais
aussi au sein d&#8217;un graphe commun de toutes les relations g&#233;n&#233;r&#233;es, tandis qu&#8217;actuellement les
clusters sont g&#233;n&#233;r&#233;s dans chaque langue s&#233;par&#233;ment et fusionn&#233;s par la suite ; (6) affinement de
la structure hi&#233;rarchique actuelle de la terminologie MedDRA gr&#226;ce &#224; la d&#233;tection de niveaux
hi&#233;rarchiques interm&#233;diaires ; (7) adaptation des m&#233;thodes et ressources exploit&#233;es &#224; la langue
espagnole pour am&#233;liorer encore les performances des r&#233;sultats.
</p>
<p>Remerciements. Ce travail a &#233;t&#233; en partie soutenu par l&#8217;Agence Nationale de la Recherche (ANR)
et la DGA, sous le num&#233;ro Tecsan ANR-11-TECS-012.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALFONSECA, E., de BONI, M., JARA-VALENCIA, H.-L. et MANANDHAR, S. (2002). A prototype question
answering system using syntactic and semantic information for answer retrieval. In TREC 10.
</p>
<p>ANIZI, M. et DICHY, J. (2009). Assessing word-form based search for information retrieval in
Arabic : towards a new type of lexical resource. In MEDAR, pages 12&#8211;19.
</p>
<p>AUBIN, S. et HAMON, T. (2006). Improving term extraction with terminological resources. In
FinTAL 2006, num&#233;ro 4139 de LNAI, pages 380&#8211;387. Springer.
</p>
<p>BAEZA-YATES, R. et RIBEIRO-NETO, B. (1999). Modern Information Retrieval. Addison-Wesley, New
York.
</p>
<p>BANEA, C., MIHALCEA, R. et WIEBE, J. (2011). Multilingual sentiment and subjectivity. In
Multilingual Natural Language Processing, Prentice Hall.
</p>
<p>BROWN, E., WOOD, L. et WOOD, S. (1999). The medical dictionary for regulatory activities
(MedDRA). Drug Saf., 20(2):109&#8211;117.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>73 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CARTONI, B. et NAMER, F. (2012). Linguistique contrastive et morphologie : les noms en -iste
dans une approche onomasiologique. In CMLF, pages 1245&#8211;1259.
</p>
<p>CEUSTERS, W., DESIMPEL, I., SMITH, B. et SCHULZ, S. (2003). Using cross-lingual information to
cope with underspecification in formal ontologies. In MIE, pages 391&#8211;396.
</p>
<p>CIOMS (2004). Development and rational use of standardised MedDRA queries (SMQs) :
Retrieving adverse drug reactions with MedDRA. Rapport technique, CIOMS.
</p>
<p>COLLIER, N. (2011). Towards cross-lingual alerting for bursty epidemic events. J Biomed
Semantics, 2(5):S10.
</p>
<p>DECLERCK, G., BOUSQUET, C. et JAULENT, M. (2012). Automatic generation of MedDRA terms
groupings using an ontology. In MIE, pages 73&#8211;77.
</p>
<p>DIEWALD, G. et SMIRNOVA, E. (2010). Evidentiality in European languages : the lexical-grammatical
distinction, chapitre Introduction, pages 1&#8211;14. Walter de Gruyter Mouton.
</p>
<p>DUPUCH, M., BOUSQUET, C. et GRABAR, N. (2012). Automatic creation and refinement of the
clusters of pharmacovigilance terms. In ACM IHI, pages 181&#8211;190.
</p>
<p>FARRERES, X., RIGAU, G. et RODRIGUEZ, H. (1998). Using WordNet for building WordNets. In
COLING/ACL Workshop on Usage of WordNet in Natural Language Processing Systems.
FELLBAUM, C. (1998). A semantic network of english : the mother of all WordNets. Computers
and Humanities. EuroWordNet : a multilingual database with lexical semantic network, 32(2-
3):209&#8211;220.
</p>
<p>FESCHAREK, R., K&#220;BLER, J., ELSASSER, U., FRANK, M. et G&#220;THLEIN, P. (2004). Medical dictionary for
regulatory activities (MedDRA) : Data retrieval and presentation. Int J Pharm Med, 18(5):259&#8211;
269.
</p>
<p>FLEISCHMAN, S. (2001). Language and Medicine, pages 470&#8211;502. Blackwell.
</p>
<p>FRIDMAN NOY, N. et MUSEN, M. (2000). Prompt : Algorithm and tool for automated ontology
merging and alignment. In AAAI, pages 450&#8211;455.
</p>
<p>GRABAR, N. et HAMON, T. (2010). Exploitation of linguistic indicators for automatic weighting of
synonyms induced within three biomedical terminologies. In MEDINFO 2010, pages 1015&#8211;9.
</p>
<p>GRABAR, N., VAROUTAS, P., RIZAND, P., LIVARTOWSKI, A. et HAMON, T. (2009). Automatic acquisition
of synonym ressources and assessment of their impact on the enhanced search in EHRs. Methods
of Information in Medicine, 48(2):149&#8211;154. PMID 19283312.
</p>
<p>HAHN, U., HONECK, M., PIOTROWSKY, M. et SCHULZ, S. (2001). Subword segmentation - leveling
out morphological variations for medical document retrieval. In AMIA.
</p>
<p>HAMON, T. et NAZARENKO, A. (2001). Detection of synonymy links between terms : experiment
and results. In Recent Advances in Computational Terminology, pages 185&#8211;208. John Benjamins.
</p>
<p>HAMON, T. et NAZARENKO, A. (2008). Le d&#233;veloppement d&#8217;une plate-forme pour l&#8217;annotation
sp&#233;cialis&#233;e de documents web : retour d&#8217;exp&#233;rience. TAL, 49(2):127&#8211;154.
</p>
<p>HAUBEN, M. et BATE, A. (2009). Decision support methods for the detection of adverse events in
post-marketing data. Drug Discov Today, 14(7-8):343&#8211;357.
</p>
<p>HUANG, C.-R., TSENG, I. J. E. et TSAI, D. (2002). Translating lexical semantic relations : The first
step towards multilingual WordNets. In COLING Workshop SemaNet&#8217;02.
</p>
<p>IAVINDRASANA, J., BOUSQUET, C., DEGOULET, P. et JAULENT, M. (2006). Clustering WHO-ART
terms using semantic distance and machine algorithms. In AMIA, pages 369&#8211;373.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>74 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JACQUEMIN, C. (1996). A symbolic and surgical acquisition of terms through variation. In
WERMTER, S., RILOFF, E. et SCHELER, G., &#233;diteurs : Connectionist, Statistical and Symbolic Ap-
proaches to Learning for Natural Language Processing, pages 425&#8211;438, Springer.
JAULENT, M. et ALECU, I. (2009). Evaluation of an ontological resource for pharmacovigilance.
In MIE, pages 522&#8211;526.
KLEIBER, G. et TAMBA, I. (1990). L&#8217;hyperonymie revisit&#233;e : inclusion et hi&#233;rarchie. Langages,
98:7&#8211;32.
</p>
<p>LEFER, M. et GRABAR, N. (2013). French evaluative prefixes in translation : from automatic
alignment to semantic categorization. In CIL TACMO workshop. To appear.
LI, A. (2011). A comparative study of argument structure and lexicon. In International Conference
on Bilingualism and Comparative Linguistics.
MALAIS&#201;, V., ISAAC, A., GAZENDAM, L. et BRUGMAN, H. (2007). Anchoring Dutch cultural heritage
thesauri to WordNet : two case studies. In Workshop on Language Technology for Cultural
Heritage Data (LaTeCH, pages 57&#8211;64.
MARKO, K., BAUD, R., ZWEIGENBAUM, P., BORIN, L., MERKEL, M. et SCHULZ, S. (2006). Towards a
multilingual medical lexicon. In AMIA, pages 534&#8211;538.
MOZZICATO, P. (2007). Standardised MedDRA queries : their role in signal detection. Drug Saf,
30(7):617&#8211;619.
</p>
<p>NLM (2011). UMLS Knowledge Sources Manual. National Library of Medicine, Bethesda,
Maryland. www.nlm.nih.gov/research/umls/.
PARTEE, B. (1984). Compositionality. F Landman and F Veltman.
PEARSON, R., HAUBEN, M., GOLDSMITH, D., GOULD, A., MADIGAN, D., O&#8217;HARA, D., REISINGER, S. et
HOCHBERG, A. (2009). Influence of the MedDRA hierarchy on pharmacovigilance data mining
results. Int J Med Inform, 78(12):97&#8211;103.
ROBERT, L. (1990). Le petit Robert. Le Robert, Paris.
RODRIGUES, J., RECTOR, A., ZANSTRA, P., BAUD, R., INNES, K., ROGERS, J., RASSINOUX, A., SCHULZ,
S., PAVIOT, B. T., TEN NAPEL, H., CLAVEL, L., VAN DER HARING, E. et MATEUS, C. (2006). An ontology
driven collaborative development for biomedical terminologies : from the french CCAM to the
australian ICHI coding system. In MIE, pages 863&#8211;868.
SCHMID, H. (1994). Probabilistic part-of-speech tagging using decision trees. In ICNMLP, pages
44&#8211;49, Manchester, UK.
</p>
<p>SCHULZ, S. et HAHN, U. (2000). Morpheme-based, cross-lingual indexing for medical document
retrieval. Int J Med Inform, 58-59:87&#8211;99.
STEINBERGER, R. (2011). Cross-lingual keyword assignment. Procesamiento del Lenguaje Natural,
27:273&#8211;280.
</p>
<p>TSURUOKA, Y., TATEISHI, Y., KIM, J., OHTA, T., MCNAUGHT, J., ANANIADOU, S. et TSUJII, J. (2005).
Developing a robust part-of-speech tagger for biomedical text. LNCS, 3746:382&#8211;392.
VINAY, J. et DARBELNET, J. (1958). Stylistique Compar&#233;e du Fran&#231;ais et de l&#8217;Anglais. Didier-Harrap.
WILLETT, T. (1988). A cross-linguistic survey of the grammaticalization of evidentiality. Studies
in Language, 12:51&#8211;97.
YUEN, N., FRAM, D., VANDERWALL, D. et ALMENOFF, J. (2008). Do standardized MedDRA queries
add value to safety data mining ? In ICPE 2008, pages 1&#8211;2.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>75 c&#65535; ATALA</p>

</div></div>
</body></html>