<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>GL&#192;FF, un Gros Lexique &#192; tout Faire du Fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>GL&#192;FF, un Gros Lexique &#192; tout Faire du Fran&#231;ais
</p>
<p>Franck Sajous, Nabil Hathout et Basilio Calderone
CLLE-ERSS &#8211; CNRS et Universit&#233; de Toulouse 2 Le Mirail
</p>
<p>R&#201;SUM&#201;
Cet article pr&#233;sente GL&#192;FF, un lexique du fran&#231;ais &#224; large couverture extrait du Wiktionnaire,
le dictionnaire collaboratif en ligne. GL&#192;FF contient pour chaque entr&#233;e une description mor-
phosyntaxique et une transcription phon&#233;mique. Il se distingue des autres lexiques existants
principalement par sa taille, sa licence libre et la possibilit&#233; de le faire &#233;voluer de fa&#231;on con-
stante. Nous d&#233;crivons ici comment nous l&#8217;avons construit, puis caract&#233;ris&#233; en le comparant &#224;
diff&#233;rentes ressources connues. Cette comparaison montre que sa taille et sa qualit&#233; font de
GL&#192;FF un candidat s&#233;rieux comme nouvelle ressource standard pour le TAL, la linguistique et la
psycholinguistique.
</p>
<p>ABSTRACT
GL&#192;FF, a Large Versatile French Lexicon
</p>
<p>This paper introduces GL&#192;FF, a large-scale versatile French lexicon extracted from Wiktionary,
the collaborative online dictionary. GL&#192;FF contains, for each entry, a morphosyntactic description
and a phonetic transcription. It distinguishes itself from the other available lexicons mainly by its
size, its potential for constant updating and its copylefted license that makes it available for use,
modification and redistribution. We explain how we have built GL&#192;FF and compare it to other
known resources. We show that its size and quality are strong assets that could allow GL&#192;FF to
become a reference lexicon for NLP, linguistics and psycholinguistics.
</p>
<p>MOTS-CL&#201;S : Lexique morpho-phonologique, ressources lexicales libres, Wiktionnaire.
KEYWORDS: Morpho-phonological lexicon, free lexical resources, French Wiktionary.
</p>
<p>1 Introduction
</p>
<p>Pour &#234;tre complet, il aurait fallu indiquer dans le nom de notre lexique qu&#8217;il est issu du Wiktion-
naire, un tr&#232;s gros dictionnaire en ligne qui comporte plus de 2 millions d&#8217;entr&#233;es. &#192; titre de
comparaison, la nomenclature du Tr&#233;sor de la Langue Fran&#231;aise (TLF) contient environ 65 000
vedettes et 100 000 entr&#233;es (principales ou secondaires). &#192; la taille du Wiktionnaire s&#8217;ajoute
la grande vari&#233;t&#233; de ses descriptions avec, outre les d&#233;finitions, des informations relatives &#224; la
prononciation, aux formes fl&#233;chies, aux d&#233;riv&#233;s et aux membres de la famille morphologique,
aux traductions, aux synonymes, antonymes, hyponymes, hyperonymes, etc. Ces informations
paraissent r&#233;pondre &#224; une grande vari&#233;t&#233; de besoins et &#234;tre d&#8217;une qualit&#233; notable pour l&#8217;&#233;dition
fran&#231;aise. Notre projet est de permettre au TAL et plus g&#233;n&#233;ralement aux linguistes exp&#233;rimentaux
d&#8217;exploiter facilement cette ressource multi-usages, d&#8217;une richesse remarquable.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>285 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une premi&#232;re exploitation du Wiktionnaire avait conduit &#224; WiktionaryX 1 (Sajous et al., 2010,
2011), un lexique structur&#233; donnant acc&#232;s, pour chaque entr&#233;e, &#224; des informations de nature
s&#233;mantique : d&#233;finitions, synonymes, hyponymes, traductions dans d&#8217;autres langues, etc.
Avec GL&#192;FF 2, nous proposons une &#233;tape suppl&#233;mentaire dont le but est de permettre l&#8217;exploita-
tion des informations phonologiques et morphosyntaxiques. Outre sa taille et sa polyvalence,
GL&#192;FF se caract&#233;rise par sa licence libre (Creative Commons By-SA). L&#8217;un des objectifs de ce
travail est d&#8217;estimer la qualit&#233; de la ressource, sa couverture et son ad&#233;quation aux besoins des
linguistes qui r&#233;alisent des exp&#233;rimentations et/ou des mod&#233;lisations, mais aussi des chercheurs
et des d&#233;veloppeurs de syst&#232;mes de TAL.
</p>
<p>La suite de l&#8217;article s&#8217;organise comme suit : nous pr&#233;sentons dans la section 2 quelques-unes
des ressources auxquelles GL&#192;FF peut &#234;tre compar&#233;. La section 3 pr&#233;sente le Wiktionnaire et
diff&#233;rents travaux visant &#224; construire &#224; partir de ce dictionnaire des ressources pour le TAL. La
construction de GL&#192;FF proprement dite fait l&#8217;objet de la section 4. Nous pr&#233;sentons en section 5
une s&#233;rie de comparaisons de GL&#192;FF avec des ressources de r&#233;f&#233;rence afin de quantifier les points
forts et les apports de ce lexique. Plus pr&#233;cis&#233;ment, nous nous int&#233;ressons &#224; la couverture de
GL&#192;FF en le comparant d&#8217;une part &#224; quatre autres lexiques morphosyntaxiques disponibles du
fran&#231;ais, et en le projetant d&#8217;autre part sur diff&#233;rents corpus afin, notamment, de d&#233;terminer
la proportion d&#8217;entr&#233;es attest&#233;es et non attest&#233;es. Nous comparons ensuite les descriptions
phon&#233;miques de GL&#192;FF avec celles de deux ressources qui en fournissent. Enfin, la section 6
conclut l&#8217;article et pr&#233;sente les &#233;tapes &#224; venir dans le d&#233;veloppement et l&#8217;exploitation de GL&#192;FF.
</p>
<p>2 Ressources et travaux connexes
</p>
<p>Des ressources lexicales pour le fran&#231;ais commencent &#224; &#234;tre disponibles, m&#234;me s&#8217;il reste beaucoup
&#224; faire pour nous rapprocher de la situation de l&#8217;anglais, tant en volume qu&#8217;en qualit&#233;. Le constat
est similaire pour les outils g&#233;n&#233;ralistes comme les analyseurs morphosyntaxiques, syntaxiques,
morphologiques et les outils de phon&#233;tisation, qui d&#233;pendent directement de ces ressources.
Depuis la fin des ann&#233;es 1990, quelques ressources destin&#233;es au traitement automatique du
fran&#231;ais sont distribu&#233;es gratuitement : le lexique de l&#8217;ABU 3 date de 1999, la premi&#232;re version
de Lefff (Cl&#233;ment et al., 2004) de 2003 et Morphalou (Romary et al., 2004) de 2004. Auparavant,
seules des ressources payantes, principalement distribu&#233;es par ELRA, &#233;taient disponibles.
</p>
<p>La constitution de lexiques pour le TAL et pour l&#8217;&#233;tude outill&#233;e du fran&#231;ais trouve son origine
dans les travaux men&#233;s au LADL autour de Maurice Gross (Courtois, 1990; Silberztein, 1990).
Les premiers &#233;taient destin&#233;s &#224; l&#8217;exploration de corpus et l&#8217;annotation lexicale. Les lexiques
morphosyntaxiques du fran&#231;ais fournissent tous un ensemble d&#8217;informations communes : la forme
orthographique du mot, son lemme, la partie du discours et les propri&#233;t&#233;s morphosyntaxiques
(traits flexionnels). Notons que si ces ressources ont &#233;t&#233; d&#8217;abord utilis&#233;es pour le TAL, elles le
sont aussi pour la description linguistique, notamment en morphologie (Hathout et al., 2009).
</p>
<p>ABU, le plus ancien des lexiques morphosyntaxiques distribu&#233; librement sur le Web, comporte
environ 60000 lemmes et 300000 formes. Les tailles de Lefff et de Morphalou sont plus im-
portantes : respectivement 500 000 et 525 000 entr&#233;es. Notons que Lefff fournit &#233;galement une
description des cadres de sous-cat&#233;gorisation des lex&#232;mes.
</p>
<p>1. Wiktionary XMLis&#233;, disponible &#224; l&#8217;adresse :
2. GL&#192;FF est disponible &#224; l&#8217;adresse :
3. ABU : la Biblioth&#232;que Universelle.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>286 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#192; c&#244;t&#233; des ressources d&#233;velopp&#233;es par des linguistes informaticiens (Lefff sert notamment &#224; la
mise au point d&#8217;analyseurs syntaxiques bas&#233;s sur la th&#233;orie LFG) et des lexicographes (Morphalou
est la version XML du lexique TLFnome, issu de la nomenclature du TLF), on trouve Lexique (New,
2006), qui s&#8217;inscrit dans la lign&#233;e de Brulex, une ressource d&#233;velopp&#233;e &#224; la fin des ann&#233;es 1980
(Content et al., 1990). Comme Brulex, Lexique a &#233;t&#233; cr&#233;&#233; par et pour les psycholinguistes. Ces
ressources se distinguent des lexiques morphosyntaxiques g&#233;n&#233;ralistes par la plus grande richesse
des informations fournies : outre la morphosyntaxe, leur description lexicale comporte une
transcription phon&#233;mique, une segmentation en syllabes, des informations sur les homophones,
les homographes, les voisins phonologiques et orthographiques, la fr&#233;quence des formes dans des
corpus &#233;crits, etc. En contrepartie, l&#8217;absence d&#8217;un grand nombre des formes fl&#233;chies de Lexique,
tout comme Brulex (seules les formes les plus usuelles y sont d&#233;crites) et les fr&#233;quences fournies,
calcul&#233;es &#224; partir des graphies (qui ne tiennent donc pas compte des attributs morphosyntaxiques)
constituent une limite &#224; leur utilisation dans des outils de TAL. Lexique et Brulex sont actuellement
les seules ressources gratuites qui fournissent des transcriptions phon&#233;miques et un d&#233;coupage
syllabique. Il existe d&#8217;autres ressources plus compl&#232;tes qui contiennent ces informations, cr&#233;&#233;es
dans des laboratoires de recherche publique. . . mais elles sont payantes 4. L&#8217;une des plus
anciennes et la plus connue est BDLex (P&#233;rennou et de Calm&#232;s, 1987), dont la taille est similaire
&#224; celle de Lefff. Citons &#233;galement ILPho (Boula De Mareuil et al., 2000), plus r&#233;cente, cr&#233;&#233;e
en compl&#233;tant les entr&#233;es du lexique morphosyntaxique Multext (Ide et V&#233;ronis, 1994) par des
transcriptions phon&#233;miques. Dans tous ces lexiques, les transcriptions phon&#233;miques sont cod&#233;es
au moyen de caract&#232;res ASCII, en SAMPA ou dans un format similaire.
</p>
<p>3 Wiktionnaire
Wiktionary, le &#171; compagnon lexical de Wikip&#233;dia &#187;, est un dictionnaire multilingue libre et acces-
sible en ligne. Lanc&#233; en 2003, ce projet lexicographique fait &#233;tat, 10 ans plus tard, de plus de
deux millions d&#8217;articles pour son &#233;dition fran&#231;aise, le Wiktionnaire. Si son remplissage a b&#233;n&#233;fici&#233;
de l&#8217;import d&#8217;articles du Dictionnaire de l&#8217;Acad&#233;mie Fran&#231;aise et, dans une moindre mesure, du
Littr&#233;, le Wiktionnaire conna&#238;t aujourd&#8217;hui une croissance constante gr&#226;ce &#224; l&#8217;&#233;dition manuelle
des contributeurs. Chaque article peut contenir des informations &#233;tymologiques, d&#233;finitions,
exemples, relations s&#233;mantiques, traductions, transcriptions phon&#233;miques, etc. Si l&#8217;on consid&#232;re
la couverture moindre des ressources lexicales existantes et les licences contraignantes sous
lesquelles sont plac&#233;es certaines d&#8217;entre elles, la vari&#233;t&#233; des informations contenues dans le
Wiktionnaire, la taille de sa nomenclature et sa mise &#224; disposition sous licence libre en font un
candidat extr&#234;mement prometteur pour la construction d&#8217;un lexique &#233;lectronique du fran&#231;ais.
N&#233;anmoins, depuis l&#8217;&#233;mergence du crowdsourcing, se pose la question de la qualit&#233; des informa-
tions contenues dans les wikis. L&#8217;absence de comit&#233; &#233;ditorial et le fait que les modifications de
tout contributeur, quelle que soit sa comp&#233;tence, soient publi&#233;es imm&#233;diatement g&#233;n&#232;rent une
certaine m&#233;fiance. &#192; l&#8217;oppos&#233;, l&#8217;effet de mode li&#233; &#224; la naissance de nouveaux paradigmes peut
g&#233;n&#233;rer un enthousiasme par trop optimiste (cf. la pol&#233;mique portant sur la qualit&#233; de Wikip&#233;dia,
opposant (Giles, 2005) &#224; l&#8217;encyclop&#233;die Britannica (Encyclopaedia Britannica, 2006)).
</p>
<p>Si Wikip&#233;dia a fait l&#8217;objet d&#8217;analyses dans plusieurs disciplines et a servi en TAL de source de
donn&#233;es pour constituer notamment des corpus et des listes d&#8217;entit&#233;s nomm&#233;es, ainsi que de base
de calcul de similarit&#233; s&#233;mantique entre documents (Gabrilovich et Markovitch, 2007), Wiktionary
n&#8217;a commenc&#233; &#224; retenir l&#8217;attention des chercheurs, &#224; notre connaissance, qu&#8217;en 2008. Il a d&#8217;abord
</p>
<p>4. Outre le prix &#233;lev&#233; de ces ressources, le fait de ne pouvoir en redistribuer des &#171; &#339;uvres d&#233;riv&#233;es &#187; constitue une
limite &#224; la port&#233;e des travaux de recherche qui les utilisent, notamment en emp&#234;chant la reproductibilit&#233; des exp&#233;riences.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>287 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#233;t&#233; utilis&#233; par (Zesch et al., 2008), comme Wikip&#233;dia, comme point de d&#233;part pour effectuer
des calculs de similarit&#233; s&#233;mantique. La qualit&#233; des ressources construites collaborativement
&#171; par les foules &#187; et celles construites par les experts a &#233;t&#233; compar&#233;e par (Zesch et Gurevych,
2010), toujours &#224; travers une t&#226;che de mesure de similarit&#233; s&#233;mantique fond&#233;e sur Wikip&#233;dia et
Wiktionary. Cette &#233;tude, plus mod&#233;r&#233;e que celle de Giles, a montr&#233; que les ressources fond&#233;es sur
&#171; la sagesse des foules &#187; ne sont pas meilleures que celles fond&#233;es sur &#171; la sagesse des linguistes &#187;,
mais sont s&#233;rieusement comp&#233;titives. Elles d&#233;passent m&#234;me les ressources construites par les
experts dans certains cas, notamment en terme de couverture. Cependant, l&#8217;&#233;tude portait sur
l&#8217;utilisation de donn&#233;es d&#233;riv&#233;es de Wiktionary et non sur son contenu primaire.
</p>
<p>Le potentiel du Wiktionnaire en tant que lexique &#233;lectronique n&#8217;a &#233;t&#233; &#233;tudi&#233; qu&#8217;&#224; partir de 2009
par (Navarro et al., 2009) pour le fran&#231;ais et l&#8217;anglais.L&#8217;int&#233;gration de l&#8217;&#233;dition portugaise de
Wiktionary dans l&#8217;ontologie Onto.PT (Gon&#231;alo Oliveira et Gomes, 2010) est d&#233;crite dans (Anton
P&#233;rez et al., 2011). Citons &#233;galement Dbnary (S&#233;rasset, 2012), une ressource et un extracteur
open source visant &#224; extraire de Wiktionary un r&#233;seau multilingue. L&#8217;auteur pr&#233;cise que ce travail
ne vise pas l&#8217;exhaustivit&#233; mais la conception d&#8217;un mod&#232;le simple permettant de repr&#233;senter autant
de donn&#233;es qu&#8217;il est possible d&#8217;extraire correctement, laissant de c&#244;t&#233; certaines structures pour
faciliter cette extraction. Le graphe extrait poss&#232;de 260 467 entr&#233;es pour le fran&#231;ais. Le laboratoire
UKP distribue deux ressources issues de Wiktionary : OntoWiktionary (Meyer et Gurevych, 2012),
une ontologie construite semi-automatiquement et UBY (Gurevych et al., 2012), un alignement
de 7 ressources lexicales incluant notamment WordNet, disponible pour l&#8217;allemand et l&#8217;anglais.
Si la version allemande de Wiktionary semble &#234;tre celle qui b&#233;n&#233;ficie de l&#8217;encodage le plus
rigoureux et le plus syst&#233;matique (par exemple, l&#8217;alignement avec d&#8217;autres ressources est permis
par l&#8217;ancrage des relations s&#233;mantiques au niveau des sens, ce qui n&#8217;est pas le cas dans les &#233;ditions
fran&#231;aise et anglaise), la version fran&#231;aise, moins ais&#233;ment exploitable, se distingue par une plus
grande nomenclature, ainsi que la pr&#233;sence quasi-syst&#233;matique d&#8217;informations flexionnelles et
phon&#233;miques. Nous avons mis &#224; disposition pour le fran&#231;ais et l&#8217;anglais une version structur&#233;e au
format XML de ce lexique. Nous pr&#233;sentons dans la section suivante l&#8217;extraction des informations
phon&#233;miques et morphosyntaxiques absentes de cette premi&#232;re version.
</p>
<p>4 Construction
Pour chaque &#233;dition de langue, une mise &#224; disposition r&#233;guli&#232;re de l&#8217;ensemble des articles de
Wiktionary est effectu&#233;e dans des fichiers appel&#233;s XML dumps 5. Il ne faut pas interpr&#233;ter la
mention &#171; XML &#187; comme la structuration du contenu des articles par des balises qui d&#233;limiteraient
les sections relatives aux cat&#233;gories syntaxiques, relations s&#233;mantiques, traductions, etc. Les
balises XML ne servent qu&#8217;&#224; d&#233;limiter les articles et leur titre. Le reste du contenu est encod&#233;
dans un format appel&#233; wikicode, inh&#233;rent au syst&#232;me de gestion de contenu MediaWiki. La
syntaxe de ce format n&#8217;a jamais &#233;t&#233; d&#233;finie formellement et, de plus, &#233;volue dans le temps,
avec coexistence de plusieurs conventions d&#8217;encodage pour un m&#234;me type d&#8217;information. Il faut
&#233;galement mentionner que ni les conventions d&#8217;organisation des articles, ni leur encodage en
wikicode n&#8217;est stable d&#8217;une &#233;dition de langue &#224; l&#8217;autre. Nous montrons dans (Navarro et al.,
2009; Sajous et al., 2010, 2011) comment ce format l&#226;che rend ardue et constamment inachev&#233;e
l&#8217;&#233;criture d&#8217;un parseur pour extraire de mani&#232;re automatique et exhaustive les informations
de Wiktionary : entre la mise &#224; disposition de deux dumps, le wikicode &#233;volue sans que le
changement ne soit n&#233;cessairement document&#233; et seule l&#8217;observation (semi-)manuelle du format
d&#8217;encodage permet d&#8217;adapter le parseur en cons&#233;quence. Nous avons concentr&#233; notre effort dans
</p>
<p>5. Voir : . Le dump utilis&#233; pour ce travail est celui du 27/08/2012.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>288 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>le travail pr&#233;sent&#233; ici sur l&#8217;extraction des informations absentes de WiktionaryX : les informations
flexionnelles et les transcriptions phon&#233;miques.
</p>
<p>La figure 1 montre un extrait de l&#8217;article &#171; affluent &#187;, tel qu&#8217;on peut le consulter dans le Wik-
tionnaire, deux de ses formes fl&#233;chies et le wikicode correspondant 6. Le tableau qui recense les
formes fl&#233;chies de l&#8217;adjectif, par exemple (en haut &#224; droite de la figure 1a), n&#8217;est pas explicitement
pr&#233;sent dans le wikicode, mais il est g&#233;n&#233;r&#233; par le patron A&#771; . Il existe
ainsi des dizaines de patrons similaires dans le wikicode. L&#8217;extraction des formes fl&#233;chies et des
prononciations correspondantes se fait soit par recensement et &#171; &#233;mulation &#187; de ces patrons (ici,
g&#233;n&#233;ration des formes fl&#233;chies &#224; partir d&#8217;un sch&#233;ma sp&#233;cifi&#233;), soit par l&#8217;analyse des articles des
formes fl&#233;chies lorsqu&#8217;ils existent (cf. fig. 1c et 1d). L&#224; encore, aucun formatage n&#8217;est syst&#233;ma-
tique : le patron (fig. 1c) indique que la forme est de genre f&#233;minin ; le nombre doit &#234;tre
extrait du texte de la ligne suivante &#171; F&#233;minin singulier &#187;. Si la prononciation de affluente est
donn&#233;e dans la &#171; ligne de forme &#187;, celle de affluentes est donn&#233;e dans une section Prononciation
d&#233;di&#233;e. Des erreurs induites par l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; du wikicode peuvent de ce fait s&#8217;ajouter aux
erreurs contenues dans les articles du Wiktionnaire et ainsi impacter la ressource finale.
</p>
<p>Notre parseur extrait du dump du Wiktionnaire les formes graphiques et leurs lemmes, convertit
leurs cat&#233;gories morphosyntaxiques au format GRACE (Rajman et al., 1997) et extrait leurs
transcriptions phon&#233;miques, d&#233;j&#224; en API. Notons qu&#8217;une m&#234;me entr&#233;e peut avoir plusieurs
transcriptions, comme abricots, dont on trouve une prononciation avec un &#171; o &#187; ouvert et une
autre avec un &#171; o &#187; ferm&#233; : /a.bKi.kO/ et /a.bKi.ko/. Dans ce cas, toutes sont conserv&#233;es.
Les informations flexionnelles pr&#233;sentes dans le Wiktionnaire sont parfois partielles. Il est en
effet courant que seul le genre ou le nombre soit indiqu&#233; pour les noms et les adjectifs. De m&#234;me,
le temps ou le mode d&#8217;une forme verbale fl&#233;chie peut &#234;tre omis. Nous appliquons des r&#232;gles
pour tenter de compl&#233;ter ces informations : une forme nominale ou adjectivale ne portant pas
de terminaison -s ou -x, par exemple, sera consid&#233;r&#233;e comme &#233;tant au singulier ; le genre et le
nombre d&#8217;un participe pass&#233; peuvent &#234;tre inf&#233;r&#233;s par sa terminaison ; une forme fl&#233;chie nominale
ou adjectivale masculine, dont on a d&#233;j&#224; rencontr&#233; le lemme masculin singulier, est plurielle ; etc.
Les 9,5% d&#8217;entr&#233;es dont l&#8217;information flexionnelle reste partielle sont &#233;cart&#233;es de la ressource.
Dans cette premi&#232;re version de GL&#192;FF, dont un extrait est donn&#233; figure 2, ne sont inclus
que les noms communs, verbes, adjectifs et adverbes (lemmes et formes fl&#233;chies). Les mots
grammaticaux et locutions y seront int&#233;gr&#233;s dans les versions ult&#233;rieures. En compl&#233;ment du
dump dont elles sont absentes, nous avons &#171; aspir&#233; &#187; du site du Wiktionnaire, puis analys&#233;, les
tables de conjugaison de 18076 verbes. Ces tables g&#233;n&#233;r&#233;es &#224; partir d&#8217;un simple mod&#232;le (e.g.
</p>
<p>maK S pour le verbe marcher 7) permettent d&#8217;obtenir les 48 flexions
d&#8217;un verbe (nous n&#8217;int&#233;grons pas les temps compos&#233;s dans GL&#192;FF).
</p>
<p>5 Caract&#233;risation quantitative
La suite de l&#8217;article est consacr&#233;e &#224; la caract&#233;risation essentiellement quantitative de GL&#192;FF. Elle
vise &#224; apporter des &#233;l&#233;ments de r&#233;ponse aux questions suivantes : que contient GL&#192;FF ? Quel est
l&#8217;apport de GL&#192;FF relativement aux ressources similaires existantes ? GL&#192;FF est-il une ressource
susceptible de remplacer les lexiques morphosyntaxiques et phonologiques courants ?
Cette caract&#233;risation porte sur diff&#233;rents attributs : nombre de lemmes et de formes, couverture
relativement &#224; diff&#233;rents corpus et transcriptions phon&#233;miques. Nous comparons GL&#192;FF &#224; quatre
</p>
<p>6. Un &#171; guide pratique de parsing du wikicode &#187; accompagnera prochainement la ressource GL&#192;FF.
7. Voir
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>289 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(a) Mise en page de l&#8217;article &#171; affluent &#187;
</p>
<p>A&#771;
</p>
<p>A&#771;
</p>
<p>E&#771; .n&#65535; a.fly.A&#771;
</p>
<p>il.z&#65535; a.fly vE&#771;K lO&#771;.tKe dy ma.ga.zE&#771;
</p>
<p>(b) Wikicode de l&#8217;article &#171; affluent &#187;
</p>
<p>A&#771;
</p>
<p>(c) Article &#171; affluente &#187; et wikicode correspondant
</p>
<p>A&#771;
</p>
<p>(d) Article &#171; affluentes &#187; et wikicode correspondant
</p>
<p>FIGURE 1 &#8211; Article &#171; affluent &#187; et formes fl&#233;chies dans le Wiktionnaire.
</p>
<p>a.fly.a&#771; gle.nO&#771; ta.la&#771;.t4&#248;z
a.fly.a&#771; gla.nyK ta.la&#771;.t4&#248;z.ma&#771;
</p>
<p>a.fly.a&#771; gla.nyK ta.la&#771;.ty.&#248;z
a.fly gla.wi tal
a.fly gla.pim tal
</p>
<p>a.fly.KE gla.pit ta.l@.KE
</p>
<p>FIGURE 2 &#8211; Extraits de GL&#192;FF
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>290 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>lexiques utilis&#233;s dans de nombreuses recherches : Lexique, BDLex, Morphalou et Lefff. Tous
fournissent des descriptions morphosyntaxiques compl&#232;tes pour leurs entr&#233;es, les deux premiers
fournissant en plus des transcriptions phon&#233;miques et une segmentation en syllabes.
</p>
<p>Couverture. GL&#192;FF se distingue des lexiques actuellement utilis&#233;s en TAL et en psycholinguis-
tique par sa taille exceptionnelle. La table 1 pr&#233;sente le nombre de lemmes et de formes fl&#233;chies,
simples (s&#233;quence de lettres exclusivement) et non simples (i.e. comprenant espace, tiret et/ou
chiffre). On peut y observer que GL&#192;FF contient 3 &#224; 4 fois plus de lex&#232;mes (2 fois plus pour les
lemmes qui comportent une transcription phon&#233;mique) et 3 &#224; 9 fois plus de formes (2 &#224; 8 fois
pour les formes transcrites). Cette taille est un atout important dans le cas d&#8217;une utilisation, par
exemple, pour des recherches en morphologie flexionnelle ou d&#233;rivationnelle. Elle est &#233;galement
int&#233;ressante pour le d&#233;veloppement d&#8217;outils de TAL comme des &#233;tiqueteurs morphosyntaxiques
ou des analyseurs syntaxiques. On observe &#233;galement que GL&#192;FF comporte un nombre &#233;lev&#233; de
formes compos&#233;es. Ces derni&#232;res servent essentiellement &#224; la segmentation des textes en &#171; to-
kens &#187; dont la qualit&#233; impacte l&#8217;ensemble des annotations cat&#233;gorielles et syntaxiques ult&#233;rieures.
</p>
<p>Formes fl&#233;chies cat&#233;goris&#233;es Lemmes cat&#233;goris&#233;s
Simples Non simples Total Simples Non simples Total
</p>
<p>Lexique 147 912 4 696 152 608 46 649 3 770 50 419
BDLex 431 992 4 360 436 352 47 314 1 792 49 106
Lefff 466 668 3 829 470 497 54 214 2 303 56 517
Morphalou 524 179 49 524 228 65 170 7 65 177
</p>
<p>GL&#192;FF
Avec transcription 1 258217 11 209 1 269426 105 646 6 091 111 737
Sans transcription 143 361 13 061 156 422 66 970 7 375 74 345
Total 1 401 578 24 270 1 425848 172 616 13 466 186 082
</p>
<p>TABLE 1 &#8211; Taille des lexiques (restreints aux cat&#233;gories : nom commun, verbe, adjectif, adverbe).
</p>
<p>Les comparaisons ci-apr&#232;s concernent uniquement les cat&#233;gories majeures nom commun, verbe,
adjectif et adverbe. Elles ont &#233;t&#233; r&#233;alis&#233;es sur les formes graphiques ou lemmes &#171; simples &#187; afin
de nous affranchir des diff&#233;rents choix de graphie des unit&#233;s polylexicales dans les lexiques et
de segmentation des corpus. Nous &#233;tudions tout d&#8217;abord l&#8217;intersection de GL&#192;FF avec les autres
lexiques. La table 2 pr&#233;sente pour chacun des cinq lexiques test&#233;s la proportion d&#8217;entr&#233;es (i.e. de
triplets &lt;forme ; lemme ; description morphosyntaxique&gt;) que l&#8217;on retrouve &#224; l&#8217;identique dans les autres.
On observe que la taille des intersections est directement li&#233;e &#224; celle des lexiques : plus un lexique
est gros, plus son intersection avec les autres l&#8217;est. On observe ensuite une r&#233;partition des cinq
lexiques en trois groupes : Lexique a une couverture moindre, avec 9% de GL&#192;FF et 22 &#224; 26%
des lexiques BDLex, Lefff et Morphalou. Ces trois derniers couvrent 76% &#224; 80% de Lexique et
30% de GL&#192;FF en moyenne, tout en ayant un couverture commune de 70% &#224; 86%. GL&#192;FF est
nettement au-dessus avec un couverture de 85% &#224; 93%. Sa couverture est sup&#233;rieure de 5% &#224;
13% &#224; celle des autres lexiques. De plus, le fait qu&#8217;il n&#8217;inclue que partiellement les autres lexiques
est normal au vu des intersections de ces derniers.
</p>
<p>Lexique BDLex Lefff Morphalou GL&#192;FF
Lexique 26,03 25,20 22,46 8,95
BDLex 76.02 79,87 70,40 28,75
Lefff 79,50 86,28 72,32 30,04
Morphalou 79,58 85,43 81,24 32,03
GL&#192;FF 84,83 93,26 90,23 85,66
</p>
<p>TABLE 2 &#8211; Couverture inter-lexiques (en % de formes fl&#233;chies cat&#233;goris&#233;es).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>291 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GL&#192;FF a donc une taille nettement sup&#233;rieure &#224; celle des autres lexiques, ce qui constitue un
atout potentiel. Afin de s&#8217;assurer que cet avantage est effectif (i.e. que le plus grand nombre
de lex&#232;mes et de formes peut r&#233;ellement s&#8217;av&#233;rer utile), nous avons compar&#233; les cinq lexiques
au vocabulaire de quatre corpus de nature diff&#233;rente (genre, taille, &#233;poque, etc.). Le premier,
compos&#233; de 515 romans du XXe si&#232;cle issus de la base Frantext 8, contient 30 millions de mots.
LM10, corpus journalistique qui rassemble les archives de 1991 &#224; 2000 du quotidien Le Monde,
contient 200 millions de mots. Le troisi&#232;me corpus compos&#233; des 664 982 articles de la Wikip&#233;dia
fran&#231;aise 9, contient 260 millions de mots. Enfin, FrWaC (Baroni et al., 2009) est un corpus
de pages Web en fran&#231;ais contenant 1,6 milliard de mots. Ces quatre corpus ont &#233;t&#233; &#233;tiquet&#233;s
par la version standard de TreeTagger 10, qui nous sert ici &#224; segmenter les corpus et filtrer leur
vocabulaire sur la base des cat&#233;gories syntaxiques (qui sont ensuite ignor&#233;es). Les mots inconnus
de TreeTagger (dont la cat&#233;gorie est pertinente) sont conserv&#233;s. La table 3 pr&#233;sente la couverture
des cinq lexiques par rapport &#224; ces quatre corpus, en distinguant au sein de leur vocabulaire les
formes de fr&#233;quence sup&#233;rieure ou &#233;gale &#224; 1 (i.e. tout le vocabulaire), 2, 5, 10, 100 et 1000.
</p>
<p>Seuil : fr&#233;quence &#8805; 1 2 5 10 100 1000
Nb formes 1 45 437 95 189 61 813 43 919 10 767 1 376
Lexique 66,76 84,35 94,00 96,91 99,15 99,27
</p>
<p>Frantext BDLex 70,86 84,69 92,47 95,74 99,12 99,20Lefff 71,89 85,63 93,21 96,21 99,08 98,90
Morphalou 73,93 86,66 93,29 96,00 98,48 97,09
GL&#192;FF 76,92 88,57 94,54 96,72 98,77 98,76
Nb formes 300 606 172 036 106 470 77 936 29 388 7 838
Lexique 29,59 47,28 65,23 76,31 93,81 98,58
</p>
<p>LM10 BDLex 37,77 55,79 71,76 80,93 95,53 98,69Lefff 39,64 58,22 74,33 83,20 95,99 98,90
Morphalou 39,06 56,82 71,92 80,32 93,27 97,48
GL&#192;FF 45,24 63,83 78,63 86,23 96,46 98,68
Nb formes 953 920 435 031 216 210 136 531 35 621 7 956
Lexique 9,13 18,27 31,52 43,03 78,58 95,72
</p>
<p>Wikip&#233;dia BDLex 12,29 22,89 36,80 48,04 79,39 95,33Lefff 12,88 23,94 38,26 49,65 80,57 95,71
Morphalou 13,05 23,96 37,87 48,87 78,74 94,16
GL&#192;FF 16,42 29,00 44,13 55,45 83,21 96,10
Nb formes 1 624620 846 019 410 382 255 718 74 745 22 100
Lexique 5,83 10,85 20,84 30,81 66,00 89,47
</p>
<p>FrWaC BDLex 9,36 15,85 27,28 37,48 69,61 90,03Lefff 9,85 16,67 28,57 39,16 71,61 91,16
Morphalou 10,09 16,89 28,53 38,68 69,36 88,51
GL&#192;FF 13,13 21,13 34,29 45,35 76,39 92,76
</p>
<p>TABLE 3 &#8211; Couverture lexiques/corpus (en % de formes fl&#233;chies non cat&#233;goris&#233;es).
</p>
<p>Le classement des corpus par couverture d&#233;croissante est le m&#234;me pour les cinq lexiques. Bien
que la taille des corpus influe sur cet ordre (plus un corpus est &#233;tendu, plus le nombre potentiel
de formes diff&#233;rentes est grand), leur nature est &#233;galement d&#233;terminante : FrWaC, par exemple,
est une collection de pages web et (donc) contient nombre de formes &#171; bruit&#233;es &#187; (mots &#233;trangers,
espaces manquants ou exc&#233;dentaires, orthographe al&#233;atoire, absence de diacritiques, etc.). On
retrouve la r&#233;partition des lexiques en trois groupes : BDLex, Lefff et Morphalou pr&#233;sentent une
couverture assez proche. Hormis pour Frantext, Lexique affiche une couverture moindre jusqu&#8217;au
</p>
<p>8.
9. Version du 18 juin 2008 disponible &#224; l&#8217;adresse :
</p>
<p>10.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>292 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>seuil 100, o&#249; il rejoint Morphalou. GL&#192;FF a une couverture sup&#233;rieure pour les trois plus gros
corpus, sauf pour LM10 au seuil 1000 o&#249; il est d&#233;pass&#233; par Lefff de 0,2%. La meilleure couverture
de Lexique pour Frantext, alors qu&#8217;elle est inf&#233;rieure de 10 &#224; 15% &#224; celle de GL&#192;FF pour les trois
autre corpus, s&#8217;explique probablement par le fait que son vocabulaire a &#233;t&#233; constitu&#233; &#224; partir
d&#8217;&#339;uvres de cette m&#234;me base. Pour les autres corpus et jusqu&#8217;au seuil 100, la taille de GL&#192;FF
lui permet d&#8217;avoir une couverture du vocabulaire bien sup&#233;rieure &#224; celle des autres lexiques (au
seuil 1, de 14% &#224; 53% de plus pour LM10 et de 30% &#224; 125% pour FrWaC ; au seuil 10, de 4%
&#224; 16% pour LM10 et de 15% &#224; 47% pour FrWaC). Des outils de TAL qui int&#233;greraient GL&#192;FF
devraient donc am&#233;liorer leurs performances dans le traitement de ces corpus.
</p>
<p>La figure 3 compare la couverture des cinq lexiques sous un autre &#233;clairage : elle repr&#233;sente pour
chaque lexique le nombre de formes dont la fr&#233;quence en corpus appartient &#224; un intervalle donn&#233;.
On y voit clairement que les diff&#233;rences sont plus marqu&#233;es pour le corpus FrWaC qu&#8217;elle ne le
sont pour Frantext, probablement du fait des diff&#233;rences li&#233;es &#224; la nature des corpus, comme
expliqu&#233; plus haut. La r&#233;partition des lexiques en trois groupes appara&#238;t clairement dans le
diagramme de droite (FrWaC). On voit &#233;galement sur ce dernier que m&#234;me pour les mots tr&#232;s
fr&#233;quents et donc tr&#232;s bien attest&#233;s, qui ont par exemple une fr&#233;quence comprise entre 101 et
1000, la couverture de GL&#192;FF reste meilleure. La table 3 et la figure 3 montrent que la sup&#233;riorit&#233;
de GL&#192;FF est plus marqu&#233;e lorsque l&#8217;on travaille sur des corpus h&#233;t&#233;rog&#232;nes et pour des mots de
faibles et moyennes fr&#233;quences.
</p>
<p>1
</p>
<p>2
</p>
<p>3
</p>
<p>4
</p>
<p>5
</p>
<p>6
</p>
<p>7
</p>
<p>8
</p>
<p>9
</p>
<p>10 x 10
4
</p>
<p>No
m
</p>
<p>br
e 
</p>
<p>de
 fo
</p>
<p>rm
es
</p>
<p>Frantext
</p>
<p> 
</p>
<p> 
</p>
<p>1
</p>
<p>2
</p>
<p>3
</p>
<p>4
</p>
<p>5
</p>
<p>6
</p>
<p>7
</p>
<p>8
</p>
<p>9
</p>
<p>10 x 10
4
</p>
<p>No
m
</p>
<p>br
e 
</p>
<p>de
 fo
</p>
<p>rm
es
</p>
<p>FrWac
</p>
<p> 
</p>
<p> 
                                        
</p>
<p>Frant t rWac
</p>
<p>1-10 11-102 101-103 1001-104 10001-106 1-10 11-102 101-103 1001-104 10001-105 100001-106
</p>
<p>GL&#192;FF
Morphalou
</p>
<p>Lefff
BDLex
</p>
<p>Lexique
</p>
<p>GL&#192;FF
Morphalou
</p>
<p>Lefff
BDLex
</p>
<p>Lexique
</p>
<p>No
m
</p>
<p>br
e 
</p>
<p>de
 fo
</p>
<p>rm
es
</p>
<p>No
m
</p>
<p>br
e 
</p>
<p>de
 fo
</p>
<p>rm
es
</p>
<p>Intervalles de fr&#233;quence des formes en corpus Intervalles de fr&#233;quence des formes en corpus
</p>
<p>FIGURE 3 &#8211; R&#233;partition des formes des lexiques relativement &#224; leur fr&#233;quence en corpus.
</p>
<p>Pour conclure notre caract&#233;risation de la couverture de GL&#192;FF, nous nous sommes int&#233;ress&#233;s &#224; la
partie du vocabulaire sp&#233;cifique &#224; ce dernier, i.e. aux formes appartenant &#224; GL&#192;FF et absentes
des quatre autres lexiques. Ce sous-ensemble de 665 290 formes repr&#233;sente 47% de la ressource.
Nous avons &#233;galement consid&#233;r&#233; le vocabulaire sp&#233;cifique de chaque autre lexique. La table 4
montre pour chaque sous-vocabulaire le nombre de formes attest&#233;es en corpus. Conform&#233;ment
&#224; l&#8217;intuition, le nombre de formes attest&#233;es est d&#8217;autant plus grand que les corpus sont gros.
La taille des corpus n&#8217;explique cependant pas tout : si une large part du vocabulaire sp&#233;cifique
&#224; GL&#192;FF n&#8217;est attest&#233;e dans aucun corpus (il s&#8217;agit majoritairement de verbes pour lesquelles
toutes les flexions possibles sont g&#233;n&#233;r&#233;es), sa taille permet une meilleure couverture de corpus
h&#233;t&#233;rog&#232;nes tel que FrWaC incluant un fran&#231;ais potentiellement moins norm&#233; et plus r&#233;cent.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>293 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#234;me pour un corpus journalistique dont l&#8217;ann&#233;e la plus r&#233;cente est 2000, la jeunesse, mais
&#233;galement la mise &#224; jour constante du Wiktionnaire permettent &#224; GL&#192;FF de couvrir des mots
tout &#224; fait usuels comme : transversalit&#233;, attractivit&#233;, brevetabilit&#233;, diabolisation, employabilit&#233;,
anticorruption, homophobie, institutionnellement, h&#233;bergeur, fatwa, ind&#233;tr&#244;nable, etc., toujours
absents des autres lexiques apr&#232;s 13 ann&#233;es.
</p>
<p>Taille du Nombre de formes attest&#233;es
vocabulaire sp&#233;cifique Frantext LM10 Wikip&#233;dia FrWaC
</p>
<p>Lexique 1 509 866 863 1 073 1 320
BDLex 3 981 86 521 1 004 1 496
Lefff 11 050 232 1 479 2 214 3 288
Morphalou 26 881 1 171 1 912 3 995 6 425
GL&#192;FF 665 290 2 811 13 525 29 230 47 549
</p>
<p>TABLE 4 &#8211; Attestation en corpus du vocabulaire sp&#233;cifique de chaque lexique
</p>
<p>Transcriptions phon&#233;miques. GL&#192;FF contient, pour 90% de ses entr&#233;es, une transcription
phon&#233;mique. Ces transcriptions contiennent parfois (8% des cas) plusieurs variantes. Afin d&#8217;&#233;-
valuer leur qualit&#233;, nous les avons compar&#233;es &#224; celles de BDLex et Lexique, que nous avons
converties en API. Nous avons compar&#233; d&#8217;une part les transcriptions sans tenir compte de la
syllabation, puis nous avons compar&#233; la syllabation pour les transcriptions dont les suites de
phon&#232;mes sont strictement identiques. Nous avons relev&#233;, pour les transcriptions qui ne diff&#232;rent
que par un phon&#232;me, les oppositions en cause. La table 5 montre pour chaque couple de lexiques
les 10 oppositions les plus fr&#233;quentes et la table 6 donne des exemples illustrant ces oppositions.
Cette table est compl&#233;t&#233;e, dans la derni&#232;re colonne, par les transcriptions du Dictionnaire de la
Prononciation Fran&#231;aise dans son Usage R&#233;el (Martinet et Walter, 1973), not&#233; DPF ci-apr&#232;s. Les
auteurs de ce dictionnaire papier &#233;labor&#233; entre 1968 et 1973, partant du principe que &#171; l&#8217;unit&#233; de
la prononciation fran&#231;aise est une vue de l&#8217;esprit et ne correspond &#224; rien de r&#233;el &#187; ont men&#233;, avec
leurs collaborateurs, un travail de recensement aupr&#232;s de 17 informateurs pour collecter les
diff&#233;rentes variantes de prononciation d&#8217;un m&#234;me mot (20% des prononciations divergent).
Les diff&#233;rences de transcription entre GL&#192;FF et chacun des deux autres lexiques sont comparables
aux diff&#233;rences que l&#8217;on trouve entre BDlex et Lexique. Elles sont principalement dues &#224; l&#8217;opposi-
tion entre les voyelles moyennes, comme les ant&#233;rieures : [e] (mi-ferm&#233;e) vs. [E] (mi-ouverte),
et les post&#233;rieures : [o] (mi-ferm&#233;e) vs. [O] (mi-ouverte). Entre BDLex et Lexique, elles sont
responsables de 91% des divergences. Ces diff&#233;rences &#233;taient attendues : l&#8217;opposition entre
voyelles mi-ferme&#233;s et mi-ouvertes en fran&#231;ais est soumise &#224; des restrictions distributionnelles
d&#233;finies par la loi de position selon laquelle les voyelles mi-ouvertes apparaissent de pr&#233;f&#233;rence
en syllabe ferm&#233;e, alors que les voyelles mi-ferm&#233;es apparaissent de pr&#233;f&#233;rence en syllabe ou-
verte. Bien qu&#8217;une investigation d&#233;taill&#233;e sur les structures syllabiques reste &#224; faire, la variabilit&#233;
d&#8217;application de cette loi n&#8217;est pas uniforme en France : elle est plus syst&#233;matique pour le Midi,
moins pour le Nord (Detey et al., 2010). Les autres oppositions relev&#233;es dans la table 5, comme
l&#8217;opposition [s]/[z], venant principalement du suffixe -isme, sont d&#233;crites dans le DPF. Le codage
probl&#233;matique du schwa y est &#233;galement longuement comment&#233;. La table 7 montre la proportion
de transcriptions strictement identiques (hors syllabation), et &#171; comparables &#187; apr&#232;s annulation
des diff&#233;rences entre voyelles moyennes. Notre d&#233;finition de comparable est arbitraire mais mon-
tre que la majorit&#233; des diff&#233;rences (97 &#224; 98%) sont dues &#224; ces seules oppositions et ne viennent
pas de codages aberrants. GL&#192;FF et Lexique proposent des prononciations strictement identiques
pour 79,5% des entr&#233;es. Cet accord strict est de 61,7% entre GL&#192;FF est BDLex. On peut donc
estimer que les transcriptions phon&#233;miques de GL&#192;FF sont de bonne qualit&#233; (l&#8217;accord entre
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>294 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BDLex et Lexique est de 58,3%). Notons &#233;galement que les emprunts sont souvent g&#233;n&#233;rateurs
de divergences (e.g. shaker : /SEi.k@K/, /SEj.k&#339;K/, /SE.k&#339;K/ ; chili : /Si.li/, /tSi.li/ ; ginseng :
/Zin.sA&#771;g/, /Zin.sA&#771;N/, /Zin.sEN/). Par ailleurs, ni Lexique ni BDLex ne saurait constituer un &#233;talon
absolu. Si l&#8217;opposition [o]/[O] peut s&#8217;expliquer, certaines entr&#233;es transcrites avec un [o] (o ferm&#233;)
dans BDLex sont surprenantes : /po,m/ pour pomme, /poKt/ pour porte, /oK/ pour or et hors,
etc. Concernant Lexique, que penser de ch&#226;ti&#233;, transcrit /Sa.sje/, ou de cambriol&#233;/cambriol&#233;s
transcrits respectivement /ka&#771;.bKi.jo.le/ et /ka&#771;.bKi.o.le/ ? On s&#8217;&#233;tonne &#233;galement de lire dans sa
documentation 11 que le caract&#232;re code le &#171; e-ouvert [comme dans] &#339;uf, peur &#187; et de trouver
dans le lexique peur transcrit , &#233;tant selon la documentation le code pour le &#171; e-ferm&#233;
[comme dans] deux &#187;. Une autre curiosit&#233; concerne le &#171; schwa non &#233;lidable [comme dans] par-
venu &#187;, cod&#233;e selon la documentation par le symbole . Or ce symbole est totalement absent de
Lexique. Parvenu, utilis&#233; comme exemple, est transcrit , o&#249; &#730; code le schwa &#233;lidable.
</p>
<p>Op. Phon&#232;mes % % cumul&#233;
r E/e 48,18 48,18
r O/o 32,17 80,36
r o/O 11,02 91,37
r y/4 1,83 93,21
r @/&#248; 1,44 94,64
r @/&#339; 1,39 96,03
r u/w 0,84 96,87
r b/p 0,73 97,61
r s/z 0,51 98,12
d j 0,25 98,37
</p>
<p>(a) BDLex/Lexique
</p>
<p>Op. Phon&#232;mes % % cumul&#233;
r O/o 60,03 60,03
i @ 14,18 74,21
r e/E 6,90 81,11
r E/e 4,98 86,09
r A/a 4,92 91,01
r s/z 1,25 92,26
r @/&#248; 0,91 93,17
r &#339;/&#248; 0,47 93,64
i i 0,42 94,06
r o/O 0,38 94,44
</p>
<p>(b) GL&#192;FF/Lexique
</p>
<p>Op. Phon&#232;mes % % cumul&#233;
r e/E 66,46 66,46
r O/o 10,58 77,05
i @ 5,90 82,96
r o/O 4,36 87,32
r A/a 3,84 91,17
r 4/y 1,61 92,78
r &#339;/@ 1,09 93,88
r &#248;/@ 0,86 94,74
i i 0,84 95,58
r w/u 0,79 96,38
</p>
<p>(c) GL&#192;FF/BDLex
</p>
<p>TABLE 5 &#8211; Les 10 diff&#233;rences de transcription les plus fr&#233;quentes.
Op&#233;rations (Op.) : r = substitution ; i = insertion ; d = suppression.
</p>
<p>Transcriptions
Op&#233;ration Forme BDLex Lexique GL&#192;FF DPF
r : E/e &#233;t&#233; /E.te/ /e.te/ /e.te/ /ete/
r : s/z stalinisme /sta.li.nis,m/ /sta.li.nizm/ /sta.li.nism/ /stalinism/, /stalinizm/
r : b/p obturer /Ob.ty.Ke/ /Op.ty.Ke/ /Op.ty.Ke/ /Optyre/, /Obtyre/
r : o/O pomme /po,m/ /pOm/ /pOm/ /pOm/
r : @/&#248;/&#339; heureux /@.K&#248;/ /&#248;.K&#248;/ /&#339;.K&#248;/ /&#248;r&#248;, &#339;r&#248;/
r : y/4 gradu&#233; /gKa.dy.e/ /gKa.d4e/ /gKa.d4e/ /grad4e/, /grAd4e/, /gradye/
r : u/w jouer /Zu.e/ /Zwe/ /Zwe/ /Zwe/, /Zue/
</p>
<p>inou&#239; /i.nu.i/ /i.nwi/ /i.nwi/ /inwi/, /inui/
r : a/A p&#226;te /pa,t/ /pat/ /pAt/ /pat/ , /pAt/
i,d : i,j riiez /Ki.i.je/ /Ki.je/ /Kij.je/ -
i,d : @ contenu /kO&#771;,t@.ny/ /kO&#771;.t@.ny/ /kO&#771;t.ny/ /kO&#771;t(@)ny/
</p>
<p>TABLE 6 &#8211; Exemples de diff&#233;rence de transcription entre lexiques.
</p>
<p>La comparaison de la syllabation op&#233;r&#233;e sur les transcriptions identiques (cf. table 7) montre que
les trois lexiques sont tr&#232;s proches (98%). Notons &#224; ce propos que si la construction &#171; collaborative
par les foules &#187; du Wiktionnaire peut dans certains cas, admettons-le, &#234;tre source d&#8217;amateurisme,
elle peut &#233;galement &#234;tre int&#233;ressante car elle refl&#232;te une perception non canonique de la langue,
selon un point de vue qui est de facto celui du locuteur (en l&#8217;occurrence, le contributeur) et non
</p>
<p>11.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>295 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de jure celui du linguiste. &#192; titre d&#8217;exemple, on peut citer le cas de la syllabation du groupe
consonantique /s/+C en position interne de mot. Dans GL&#192;FF ce groupe appara&#238;t alternative-
ment comme h&#233;t&#233;rosyllabique, i.e. le /s/ et la consonne qui suit appartiennent &#224; deux syllabes
diff&#233;rentes (c&#8217;est la version canonique en fran&#231;ais) comme dans minist&#232;re /mi.nis.tEK/ et comme
tautosyllabique (les deux phon&#232;mes appartiennent &#224; la m&#234;me syllabe) comme dans monistique
/mO.ni.stik/. Cette alternance, avec d&#8217;autres ph&#233;nom&#232;nes non stables dans le Wiktionnaire,
peuvent &#234;tre per&#231;us comme les signaux du comportement parfois non d&#233;terministe de la langue,
et, partant, comme des objets potentiels d&#8217;investigation linguistique et psycholinguistique.
</p>
<p>Transcriptions phon&#233;miques Syllabation
Lexiques Intersection Identiques Comparables Identiques
</p>
<p>BDLex Lexique 112 439 58,31 96,88 98,92
GL&#192;FF Lexique 123 630 79,50 97,81 98,48
GL&#192;FF BDLex 396 114 61,72 96,88 98,30
</p>
<p>TABLE 7 &#8211; Accord inter-lexiques : transcriptions phon&#233;miques et syllabation
(Transcriptions comparables : non prise en compte des oppositions [o]/[O], [e]/[E] et [&#339;]/[@]/[&#248;].
</p>
<p>Syllabation : comparaison sur les transcriptions phon&#233;miques identiques)
</p>
<p>6 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; dans cet article la premi&#232;re version d&#8217;un nouveau lexique, GL&#192;FF, construit
de fa&#231;on automatique &#224; partir du Wiktionnaire. Ce lexique fournit des descriptions morphosyntax-
iques d&#233;taill&#233;es pour 1,4 millions d&#8217;entr&#233;es et des transcriptions phon&#233;miques pour 1,3 millions
d&#8217;entre elles. Nous avons apport&#233; dans cet article un certain nombre d&#8217;&#233;l&#233;ments qui indiquent
que GL&#192;FF est un lexique de bonne qualit&#233; compar&#233; aux ressources existantes comme Lexique,
BDLex, Lefff ou Morphalou. Le fait qu&#8217;il dispose d&#8217;une taille 3 &#224; 9 fois sup&#233;rieure &#224; celle des
autres lexiques ne s&#8217;accompagne pas d&#8217;une d&#233;gradation des descriptions morphosyntaxiques et
des transcriptions phon&#233;miques. GL&#192;FF devrait s&#8217;av&#233;rer utile tant pour des recherches en TAL, en
psycholinguistique, que pour la description linguistique.
</p>
<p>La cr&#233;ation de GL&#192;FF, motiv&#233;e notamment par les besoins des recherches que nous menons
sur l&#8217;organisation morphologique du lexique (Hathout, 2011) et sur la mod&#233;lisation de la
phonotactique et de son acquisition (Calderone et Celata, 2012), se poursuivra par un travail sur
la d&#233;couverte automatique des espaces th&#233;matiques utilis&#233;s pour la flexion (Boy&#233;, 2011). Les
autres perspectives sont nombreuses. &#192; tr&#232;s court terme, nous enrichirons GL&#192;FF des cat&#233;gories
syntaxiques initialement &#233;cart&#233;es (mots grammaticaux et locutions). Puis nous int&#233;grerons dans
une m&#234;me ressource les informations contenues dans GL&#192;FF et WiktionaryX. Cette ressource
unifi&#233;e pourra dans un second temps recevoir des bases de donn&#233;es de descriptions lexicales
provenant par exemple du Dictionnaire des Mots Construits de Michel Roch&#233; 12.
</p>
<p>Nous pr&#233;voyons &#233;galement la cr&#233;ation d&#8217;une version r&#233;vis&#233;e de GL&#192;FF qui constituera un sous-
lexique totalement fiable. Plusieurs strat&#233;gies sont envisag&#233;es. La premi&#232;re sera de d&#233;tecter
automatiquement les entr&#233;es susceptibles de comporter des erreurs dans leur description mor-
phosyntaxique ou leur transcription phon&#233;mique et de les &#233;liminer. La seconde sera une r&#233;vision
semi-automatique dans laquelle nous proposerons &#224; des op&#233;rateurs humains des corrections
possibles qu&#8217;ils devront valider. Nous pourrons enfin augmenter ces sous-lexiques par une collec-
tion &#233;tendue d&#8217;informations sur la fr&#233;quence des formes et des lex&#232;mes dans diff&#233;rents corpus
</p>
<p>12.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>296 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de r&#233;f&#233;rence (Frantext, FrWaC, Wikip&#233;dia, LM10, etc.), le nombre de caract&#232;res, de phon&#232;mes,
de syllabes, la taille de la famille d&#233;rivationnelle, le voisinage graph&#233;mique, phonologique, etc.
Cette version devrait r&#233;pondre aux besoins des psycholinguistes, et &#234;tre &#233;galement utile pour la
description linguistique, notamment en morphologie, les &#233;tudes quantitatives en linguistique et
la mod&#233;lisation du lexique et de son acquisition.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ANTON P&#201;REZ, L., GON&#199;ALO OLIVEIRA, H. et GOMES, P. (2011). Extracting Lexical-Semantic
Knowledge from the Portuguese Wiktionary. In Proceedings of the 15th Portuguese Conference on
Artificial Intelligence, EPIA 2011, pages 703&#8211;717. APPIA.
BARONI, M., BERNARDINI, S., FERRARESI, A. et ZANCHETTA, E. (2009). The WaCky wide web : a
collection of very large linguistically processed web-crawled corpora. Language Resources and
Evaluation, 43(3):209&#8211;226.
BOULA DE MAREUIL, P., YVON, F., D&#8217;ALESSANDRO, C., AUBERG&#201;, V., VAISSI&#200;RE, J. et AMELOT, A.
(2000). A French Phonetic Lexicon with variants for Speech and Language Processing. In Proc.
of the 2nd Intl Conference on Language Resources and Evaluation (LREC), pages 273&#8211;276.
BOY&#201;, G. (2011). R&#233;gularit&#233; et classes flexionnelles dans la conjugaison du fran&#231;ais. In (Roch&#233;
et al., 2011), pages 41&#8211;68.
CALDERONE, B. et CELATA, C. (2012). PHACTS about activation-based word similarity effects. In
Proceedings of the EACL 2012 Workshop on Computational Models of Language Acquisition and
Loss, pages 33&#8211;37, Avignon. ACL.
CL&#201;MENT, L., LANG, B. et SAGOT, B. (2004). Morphology based automatic acquisition of large-
coverage lexica. In Proceedings of the Fourth International Conference on Language Resources and
Evaluation (LREC 2004), pages 1841&#8211;1844, Lisboa, Portugal.
CONTENT, A., MOUSTY, P. et RADEAU, M. (1990). BRULEX : Une base de donn&#233;es lexicales
informatis&#233;e pour le fran&#231;ais &#233;crit et parl&#233;. L&#8217;Ann&#233;e Psychologique, 90:551&#8211;566.
COURTOIS, B. (1990). Un syst&#232;me de dictionnaires &#233;lectroniques pour les mots simples du
fran&#231;ais. Langue fran&#231;aise, 87(1):11&#8211;22.
DETEY, S., DURAND, J., LAKS, B. et LYCHE, C. (2010). Les vari&#233;t&#233;s du fran&#231;ais parl&#233; dans l&#8217;espace
francophone. L&#8217;essentiel francais. Ophrys.
ENCYCLOPAEDIA BRITANNICA (2006). Fatally Flawed : Refuting the Recent Study on Encyclopedic
Accuracy by the Journal Nature.
GABRILOVICH, E. et MARKOVITCH, S. (2007). Computing semantic relatedness using Wikipedia-
based explicit semantic analysis. In Proceedings of the 20th International Joint Conference on
Artificial Intelligence, pages 1606&#8211;1611.
GILES, J. (2005). Internet Encyclopaedias go Head to Head. Nature, 438:900&#8211;901.
GON&#199;ALO OLIVEIRA, H. et GOMES, P. (2010). Onto.PT : Automatic Construction of a Lexical
Ontology for Portuguese. In Proceedings of 5th European Starting AI Researcher Symposium,
pages 199&#8211;211. IOS Press.
GUREVYCH, I., ECKLE-KOHLER, J., HARTMANN, S., MATUSCHEK, M., MEYER, C. M. et WIRTH, C.
(2012). UBY - A Large-Scale Unified Lexical-Semantic Resource Based on LMF. In Proceedings
of the 13th Conference of the European Chapter of the Association for Computational Linguistics
(EACL 2012), pages 580&#8211;590.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>297 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HATHOUT, N. (2011). Une approche topologique de la construction des mots : propositions
th&#233;oriques et application &#224; la pr&#233;fixation en anti-. In (Roch&#233; et al., 2011), pages 251&#8211;318.
HATHOUT, N., NAMER, F., PL&#201;NAT, M. et TANGUY, L. (2009). La collecte et l&#8217;utilisation des donn&#233;es
en morphologie. In FRADIN, B., KERLEROUX, F. et PL&#201;NAT, M., &#233;diteurs : Aper&#231;us de morphologie
du fran&#231;ais, pages 267&#8211;287. Presses universitaires de Vincennes, Saint-Denis.
IDE, N. et V&#201;RONIS, J. (1994). MULTEXT : Multilingual text tools and corpora. In Proceedings of
the 15th conference on Computational linguistics (COLING94), pages 588&#8211;592, Kyoto, Japan.
MARTINET, A. et WALTER, H. (1973). Dictionnaire de la Prononciation Fran&#231;aise dans son Usage
R&#233;el. France Expansion.
MEYER, C. M. et GUREVYCH, I. (2012). OntoWiktionary &#8211; Constructing an Ontology from the
Collaborative Online Dictionary Wiktionary. In PAZIENZA, M. T. et STELLATO, A., &#233;diteurs :
Semi-Automatic Ontology Development : Processes and Resources, chapitre 6, pages 131&#8211;161. IGI
Global, Hershey, PA, USA.
NAVARRO, E., SAJOUS, F., GAUME, B., PR&#201;VOT, L., HSIEH, S., KUO, I., MAGISTRY, P. et HUANG, C.-R.
(2009). Wiktionary and NLP : Improving synonymy networks. In Proceedings of the 2009
ACL-IJCNLP Workshop on The People&#8217;s Web Meets NLP : Collaboratively Constructed Semantic
Resources, pages 19&#8211;27, Suntec, Singapore. Association for Computational Linguistics.
NEW, B. (2006). Lexique 3 : Une nouvelle base de donn&#233;es lexicales. In Verbum ex machina.
Actes de la 13e conf&#233;rence sur le Traitement automatique des langues naturelles, Louvain-la-Neuve.
P&#201;RENNOU, G. et de CALM&#200;S, M. (1987). BDLEX lexical data and knowledge base of spoken and
written French. In Proceedings of the European Conference on Speech Technology, ECST 1987,
pages 1393&#8211;1396, Edinburgh, Scotland, UK.
RAJMAN, M., LECOMTE, J. et PAROUBEK, P. (1997). Format de description lexicale pour le fran&#231;ais.
Partie 2 : Description morpho-syntaxique. Rapport technique, EPFL &amp; INaLF. GRACE GTR-3-2.1.
ROCH&#201;, M., BOY&#201;, G., HATHOUT, N., LIGNON, S. et PL&#201;NAT, M. (2011). Des unit&#233;s morphologiques
au lexique. Herm&#232;s Science-Lavoisier, Paris.
ROMARY, L., SALMON-ALT, S. et FRANCOPOULO, G. (2004). Standards going concrete : from LMF
to Morphalou. In ZOCK, M. et SAINT-DIZIER, P., &#233;diteurs : COLING 2004 Enhancing and using
electronic dictionaries, pages 22&#8211;28, Geneva. COLING.
SAJOUS, F., NAVARRO, E. et GAUME, B. (2011). Enrichissement de lexiques s&#233;mantiques approvi-
sionn&#233;s par les foules : le syst&#232;me WISIGOTH appliqu&#233; &#224; Wiktionary. TAL, 52(1):11&#8211;35.
SAJOUS, F., NAVARRO, E., GAUME, B., PR&#201;VOT, L. et CHUDY, Y. (2010). Semi-automatic Endogenous
Enrichment of Collaboratively Constructed Lexical Resources : Piggybacking onto Wiktionary.
In LOFTSSON, H., R&#214;GNVALDSSON, E. et HELGAD&#211;TTIR, S., &#233;diteurs : Advances in Natural Language
Processing, volume 6233 de LNCS, pages 332&#8211;344. Springer Berlin / Heidelberg.
SILBERZTEIN, M. (1990). Le dictionnaire &#233;lectronique des mots compos&#233;s. Langue fran&#231;aise,
87(1):71&#8211;83.
S&#201;RASSET, G. (2012). Dbnary : Wiktionary as a LMF based Multilingual RDF network. In Proc.
of the 8th International Conference on Language Resources and Evaluation (LREC), Istanbul.
ZESCH, T. et GUREVYCH, I. (2010). Wisdom of Crowds versus Wisdom of Linguists - Measuring
the Semantic Relatedness of Words. Journal of Natural Language Engineering., 16(01):25&#8211;59.
ZESCH, T., M&#220;LLER, C. et GUREVYCH, I. (2008). Extracting Lexical Semantic Knowledge from
Wikipedia and Wiktionary. In Proceedings of the Sixth International Conference on Language
Resources and Evaluation (LREC 2008), Marrakech.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>298 c&#65535; ATALA</p>

</div></div>
</body></html>