<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>TALN Archives : une archive num&#233;rique francophone des articles de recherche en Traitement Automatique de la Langue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN Archives : une archive num&#233;rique francophone des
articles de recherche en Traitement Automatique de la Langue
</p>
<p>Florian Boudin
LINA - UMR CNRS 6241, Universit&#233; de Nantes, France
</p>
<p>florian.boudin@univ-nantes.fr
</p>
<p>R&#201;SUM&#201;
La recherche scientifique est un processus incr&#233;mental. La premi&#232;re &#233;tape &#224; effectuer avant de
d&#233;buter des travaux consiste &#224; r&#233;aliser un &#233;tat de l&#8217;art des m&#233;thodes existantes. La communaut&#233;
francophone du Traitement Automatique de la Langue (TAL) produit de nombreuses publications
scientifiques qui sont malheureusement dispers&#233;es sur diff&#233;rents sites et pour lesquelles aucune
m&#233;ta-donn&#233;e n&#8217;est disponible. Cet article pr&#233;sente la construction de TALN Archives, une archive
num&#233;rique francophone des articles de recherche en TAL dont le but est d&#8217;offrir un acc&#232;s simplifi&#233;
aux diff&#233;rents travaux effectu&#233;s dans notre domaine. Nous pr&#233;sentons &#233;galement une analyse
du r&#233;seau de collaboration construit &#224; partir des m&#233;ta-donn&#233;es que nous avons extraites et
d&#233;voilons l&#8217;identit&#233; du Kevin Bacon de TALN Archives, i.e. l&#8217;auteur le plus central dans le r&#233;seau
de collaboration.
</p>
<p>ABSTRACT
TALN Archives : a digital archive of French research articles in Natural Language Proces-
sing
</p>
<p>Scientific research is an incremental process. Reviewing the literature is the first step to do before
starting a new research project. The French Natural Language Processing (NLP) community
produces numerous scientific publications which are scattered across different sources and for
which no metadata is available. This paper presents the construction of TALN Archives, a digital
archive of French research articles whose aim is to provide efficient access to articles in the NLP
field. We also present an analysis of the collaboration network constructed from the metadata
and disclose the identity of the Kevin Bacon of the TALN Archives, i.e. the most central author in
the collaboration network.
</p>
<p>MOTS-CL&#201;S : TALN Archives, archive num&#233;rique, articles scientifiques.
KEYWORDS: TALN Archives, digital archive, scientific articles.
</p>
<p>1 Introduction
</p>
<p>Mener des travaux de recherche scientifique de mani&#232;re efficace suppose une analyse au pr&#233;alable
des travaux pr&#233;c&#233;dents du domaine. Cette &#233;tape d&#8217;analyse de la litt&#233;rature existante permet
d&#8217;&#233;valuer la validit&#233; des id&#233;es propos&#233;es et d&#8217;identifier les contributions par rapport au domaine.
L&#8217;av&#232;nement des moteurs de recherche a rendu cette t&#226;che un peu plus simple, sans pour autant la
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>507 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>r&#233;soudre totalement. Parmi les difficult&#233;s qui subsistent et qui compliquent la t&#226;che des moteurs
de recherche, nous pouvons citer la dispersion des articles scientifiques sur les diff&#233;rents d&#233;p&#244;ts et
biblioth&#232;ques num&#233;riques (e.g. HAL 1, Google Scholar 2, CiteSeer 3), les erreurs de num&#233;risation
des versions papier des articles ou encore l&#8217;absence de m&#233;ta-donn&#233;es associ&#233;es pour l&#8217;indexation.
</p>
<p>L&#8217;Association pour le Traitement Automatique des Langues (ATALA) organise annuellement les
conf&#233;rences TALN et sa session &#233;tudiante R&#201;CITAL. Ces derni&#232;res sont des &#233;v&#233;nements majeurs
pour la communaut&#233; francophone du Traitement Automatique de la Langue (TAL) et donnent
lieu &#224; de nombreuses publications scientifiques. L&#8217;ensemble des actes de chaque conf&#233;rence est
habituellement remis sur support physique aux participants et disponible sur le site web cr&#233;&#233;
pour l&#8217;occasion. Ce mode de fonctionnement pose cependant plusieurs probl&#232;mes. Comment
p&#233;renniser l&#8217;acc&#232;s aux actes ? Comment rechercher, parmi les diff&#233;rentes &#233;ditions de la conf&#233;rence,
les articles qui traitent d&#8217;une th&#233;matique particuli&#232;re ? ceux &#233;crits par un auteur particulier ?
Le travail pr&#233;sent&#233; dans cet article tente de r&#233;pondre &#224; ces questions en proposant la cr&#233;ation
d&#8217;une archive num&#233;rique francophone des articles scientifiques dans le domaine du TAL : TALN
Archives.
</p>
<p>Nos travaux s&#8217;inspirent de l&#8217;initiative men&#233;e par l&#8217;Association for Computational Linguistics (ACL)
pour la construction de l&#8217;archive num&#233;rique ACL Anthology 4. Cr&#233;&#233;e en 2002, cette archive
contient actuellement pr&#232;s de 22 000 articles scientifiques, pour la plupart r&#233;dig&#233;s en anglais,
provenant de diff&#233;rents journaux, ateliers et conf&#233;rences dans le domaine du TAL. Cette ressource
offre un acc&#232;s simple et rapide aux diff&#233;rents travaux de recherche men&#233;s depuis les quarante
derni&#232;res ann&#233;es. L&#8217;ACL Anthology est en perp&#233;tuelle &#233;volution et de nouvelles fonctionnalit&#233;s y
sont ajout&#233;es r&#233;guli&#232;rement, comme r&#233;cemment la recherche &#224; facettes (Sch&#228;fer et al., 2011)
qui donne la possibilit&#233; aux utilisateurs de filtrer les articles selon diff&#233;rents crit&#232;res tels que les
&#233;nonc&#233;s (e.g. am&#233;liorer la qualit&#233; des traductions) ou les sujets abord&#233;s. Pour la construction de
TALN Archives, nous souhaitons aller dans la m&#234;me direction en portant toutefois une attention
particuli&#232;re aux m&#233;ta-donn&#233;es qui seront utilis&#233;es pour l&#8217;indexation des articles.
</p>
<p>Bien que l&#8217;utilisation premi&#232;re de l&#8217;ACL Anthology soit la recherche d&#8217;articles scientifiques, de
nombreuses &#233;tudes l&#8217;ont utilis&#233;e comme corpus pour des t&#226;ches aussi vari&#233;es que l&#8217;analyse
de citations (Radev et al., 2009), l&#8217;extraction d&#8217;information (Councill et al., 2008), l&#8217;aide &#224;
l&#8217;&#233;criture (Dale et Kilgarriff, 2010) ou l&#8217;analyse de sentiments (Athar, 2011). Dans cet article,
nous pr&#233;sentons une analyse du r&#233;seau de collaboration construit &#224; partir des m&#233;ta-donn&#233;es et
d&#233;voilons l&#8217;identit&#233; du Kevin Bacon de TALN Archives, i.e. l&#8217;auteur le plus central dans le r&#233;seau
de collaboration 5.
</p>
<p>Dans la section 2, nous pr&#233;sentons la m&#233;thodologie de construction de l&#8217;archive num&#233;rique
TALN Archives. En particulier, nous pr&#233;sentons les choix que nous avons fait concernant la
structure de l&#8217;archive, le format de repr&#233;sentation des donn&#233;es et les m&#233;ta-donn&#233;es associ&#233;es
aux articles. Dans la section 3, nous d&#233;crivons les exp&#233;riences men&#233;es sur l&#8217;analyse du r&#233;seau de
collaboration construit &#224; partir des m&#233;ta-donn&#233;es. Nous terminons cet article par une discussion
sur les possibilit&#233;s qu&#8217;offre TALN Archives et les travaux restants &#224; effectuer.
</p>
<p>1. http://hal.archives-ouvertes.fr
2. http://scholar.google.com
3. http://citeseerx.ist.psu.edu
4. http://aclweb.org/anthology-new/
5. http://fr.wikipedia.org/wiki/Six_Degrees_of_Kevin_Bacon
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>508 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Construction de TALN Archives
</p>
<p>TALN Archives est une archive num&#233;rique dont le but &#224; terme est de regrouper les articles
scientifiques publi&#233;s dans le domaine du TAL par la communaut&#233; francophone. Notre objectif est
d&#8217;offrir un portail unique permettant un acc&#232;s p&#233;renne et performant aux travaux effectu&#233;s dans
le domaine du TAL. Dans cet article, nous d&#233;crivons la premi&#232;re &#233;tape de ce travail, &#224; savoir la
construction des fichiers de m&#233;ta-donn&#233;es &#224; partir des articles scientifiques.
</p>
<p>Chaque article scientifique dans TALN Archives poss&#232;de un identifiant unique et un ensemble
de m&#233;ta-donn&#233;es (e.g. titre, auteurs, mots cl&#233;s) que nous avons extrait &#224; partir de son contenu.
Ces derni&#232;res sont indispensables puisqu&#8217;elles sont utilis&#233;es, entre autres, par les moteurs de
recherche pour indexer les articles. La visibilit&#233; et la diffusion des travaux de recherche sont
donc fortement d&#233;pendantes de la qualit&#233; des m&#233;ta-donn&#233;es. Elles sont &#233;galement utilis&#233;es &#224;
des fins bibliographiques, avec par exemple la g&#233;n&#233;ration automatique de fichiers de r&#233;f&#233;rences
(e.g. BIBTEX, EndNote), et pour l&#8217;interconnexion entre les diff&#233;rents d&#233;p&#244;ts et biblioth&#232;ques
num&#233;riques.
</p>
<p>Nous avons retenu le format XML pour le stockage des m&#233;ta-donn&#233;es. La version de TALN Archives
d&#233;crite dans cet article regroupe l&#8217;int&#233;gralit&#233; des actes des conf&#233;rences TALN et R&#201;CITAL de 2007
&#224; 2012, et contient 570 articles. L&#8217;ajout des actes des &#233;ditions plus anciennes (pr&#233;-2007), des
articles de journaux (e.g. revue TAL 6) et des actes publi&#233;s dans les diff&#233;rents ateliers associ&#233;s
aux conf&#233;rences fait pour le moment partie des perspectives de ce travail.
</p>
<p>2.1 Extraction des m&#233;ta-donn&#233;es
</p>
<p>Nous nous int&#233;ressons ici aux informations qu&#8217;il est possible d&#8217;extraire &#224; partir des actes des
conf&#233;rences TALN et R&#201;CITAL. Deux types d&#8217;informations sont pr&#233;sents : celles associ&#233;es aux
&#233;ditions des conf&#233;rences (e.g. dates, ville) et celles associ&#233;es aux articles publi&#233;s (e.g. auteurs,
titre, r&#233;sum&#233;). Pour TALN Archives, toutes les informations disponibles ont &#233;t&#233; extraites, avec le
parti pris de ne pas se limiter aux m&#233;ta-donn&#233;es issues du contenu des articles. Plusieurs autres
informations, comme le nombre d&#8217;articles soumis ou les noms des pr&#233;sidents des comit&#233;s de
programme, ont &#233;t&#233; r&#233;cup&#233;r&#233;es sur le site web de l&#8217;ATALA 7.
</p>
<p>Les actes des conf&#233;rences au format PDF ont &#233;t&#233; r&#233;cup&#233;r&#233;s sur les sites web des conf&#233;rences,
ou &#224; partir de support physique pour celles dont le site web n&#8217;est plus accessible 8. Les articles
ont ensuite &#233;t&#233; convertis au format texte &#224; l&#8217;aide de l&#8217;outil PDFBox 9, puis nous avons &#233;tudi&#233; la
possibilit&#233; de d&#233;velopper une m&#233;thode automatique pour l&#8217;extraction des m&#233;ta-donn&#233;es.
</p>
<p>Une des premi&#232;res difficult&#233;s &#224; laquelle nous nous sommes retrouv&#233;s confront&#233;s concerne
l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; des formats des articles. Les styles de soumission ont &#233;t&#233; largement modifi&#233;s au
fil des ann&#233;es et un nombre important d&#8217;articles ne respectent pas les contraintes de style et
de structuration pourtant impos&#233;es. L&#8217;application d&#8217;une m&#233;thode na&#239;ve, e.g. &#224; base de patrons
d&#8217;extraction, n&#8217;est donc pas envisageable. La conversion des fichiers PDF au format texte est
&#233;galement source de difficult&#233;s puisqu&#8217;elle supprime la structure du texte et introduit des erreurs
</p>
<p>6. http://www.atala.org/-Revue-TAL-
7. http://www.atala.org/
8. Le site web de l&#8217;&#233;dition 2008 de TALN et de R&#201;CITAL n&#8217;est malheureusement plus accessible.
9. http://pdfbox.apache.org/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>509 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>de c&#233;sure et de segmentation. L&#8217;extraction automatique des m&#233;ta-donn&#233;es n&#8217;est donc pas possible
sans un travail important d&#8217;adaptation aux donn&#233;es et une certaine tol&#233;rance aux erreurs.
</p>
<p>Comme nous souhaitions construire une ressource fiable, nous avons effectu&#233; l&#8217;extraction des
m&#233;ta-donn&#233;es de mani&#232;re semi-automatique, avec une premi&#232;re &#233;tape automatique de pr&#233;-
remplissage suivie d&#8217;une &#233;tape de correction et de compl&#233;tion manuelle. Les donn&#233;es que nous
avons construites ont &#233;t&#233; valid&#233;es manuellement et pourront &#234;tre utilis&#233;es dans le futur pour
entra&#238;ner des outils d&#8217;extraction supervis&#233;es. La liste compl&#232;te des m&#233;ta-donn&#233;es que nous avons
extraites est pr&#233;sent&#233;e ci-dessous. Les informations marqu&#233;es d&#8217;un symbole &#8727; ont &#233;t&#233; r&#233;cup&#233;r&#233;es
&#224; partir du site web de la conf&#233;rence ou de celui de l&#8217;ATALA.
</p>
<p>1. M&#233;ta-donn&#233;es de la conf&#233;rence
&#8211; Titre de la conf&#233;rence, acronyme, ville, pays
&#8211; Dates de d&#233;but et de fin de la conf&#233;rence&#8727;
&#8211; Noms des pr&#233;sidents du comit&#233; de programme&#8727;
&#8211; Formats des articles publi&#233;s (e.g. court, long)
&#8211; Nombre d&#8217;articles soumis et nombre d&#8217;articles accept&#233;s&#8727;
&#8211; URL du site web de la conf&#233;rence&#8727;
&#8211; Identifiant(s) du(des) meilleur(s) article(s)&#8727;
</p>
<p>2. M&#233;ta-donn&#233;es pour chaque article
&#8211; Identifiant unique (e.g. taln-2008-long-001)
&#8211; Noms des auteurs, emails, affiliations
&#8211; Titre, r&#233;sum&#233; et mots cl&#233;s (fran&#231;ais et anglais si disponible)
&#8211; Format de l&#8217;article
&#8211; Num&#233;ros des pages
&#8211; Nom de la session dans le programme
</p>
<p>Contrairement &#224; l&#8217;ACL Anthology, nous disposons, pour chaque article, d&#8217;un ensemble de mots-cl&#233;s
assign&#233;s par son(ses) auteur(s). La recherche des travaux portant sur une th&#233;matique particuli&#232;re
est donc grandement simplifi&#233;e. Il est en effet possible d&#8217;identifier des ensembles d&#8217;articles &#224;
partir d&#8217;un mot cl&#233; et ce m&#234;me s&#8217;il n&#8217;appara&#238;t pas dans le corps du document.
</p>
<p>Nous notons &#233;galement que 530 articles, parmi les 570 articles que compte l&#8217;archive, poss&#232;dent
un r&#233;sum&#233; et des mots cl&#233;s en fran&#231;ais et en anglais. Cet ensemble de textes parall&#232;les constitue
une ressource int&#233;ressante pour des t&#226;ches comme la construction automatique de dictionnaires
bilingues sp&#233;cialis&#233;s (Fung, 1998) ou l&#8217;extraction de paraphrases (Barzilay et McKeown, 2001).
</p>
<p>2.2 Statistiques de TALN Archives
</p>
<p>La version de TALN Archives pr&#233;sent&#233;e dans cette &#233;tude est compos&#233;e des actes des conf&#233;rences
TALN et R&#201;CITAL de 2007 &#224; 2012. Au total, elle contient 570 articles scientifiques, 743 auteurs
et 1 457 mots cl&#233;s. Plus de 60 heures de travail ont &#233;t&#233; n&#233;cessaires pour v&#233;rifier et compl&#233;ter les
m&#233;ta-donn&#233;es des articles. Les nombres d&#8217;articles publi&#233;s, d&#8217;auteurs ainsi que de mots cl&#233;s pour
chacune des &#233;ditions sont pr&#233;sent&#233;s dans la table 1.
</p>
<p>Hormis pour les &#233;ditions 2008 et 2012, le nombre d&#8217;articles publi&#233;s est en constante augmentation,
ce qui d&#233;note une dynamique positive de la communaut&#233; francophone du TAL. Ces deux &#233;ditions
co&#239;ncidaient avec l&#8217;organisation conjointe de TALN et des Journ&#233;es d&#8217;&#201;tudes sur la Parole (JEP).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>510 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2007 2008 2009 2010 2011 2012 TALN Archives
</p>
<p># articles 88 66 104 106 117 89 570
# auteurs 163 128 246 220 231 186 743
</p>
<p># mots cl&#233;s 335 242 329 341 335 316 1457
</p>
<p>TABLE 1: Nombres d&#8217;articles publi&#233;s, d&#8217;auteurs et de mots cl&#233;s pour les conf&#233;rences TALN et
R&#201;CITAL de 2007 &#224; 2012.
</p>
<p>Comme les travaux se situant &#224; l&#8217;intersection des deux domaines ne peuvent &#234;tre publi&#233;s dans les
deux conf&#233;rences, le nombre d&#8217;articles soumis &#224; TALN a naturellement &#233;t&#233; plus faible (e.g. 104
soumissions pour TALN 2012, compar&#233; aux 188 et 158 soumissions des &#233;ditions 2011 et 2010).
Ce ph&#233;nom&#232;ne est d&#8217;ailleurs confirm&#233; par un nombre plus restreint de mots cl&#233;s, indiquant que
les th&#233;matiques abord&#233;es dans les travaux sont moins nombreuses.
</p>
<p>3 Analyse du r&#233;seau de collaboration
</p>
<p>Les m&#233;ta-donn&#233;es de TALN Archives, extraites &#224; partir de chaque article scientifique, ont &#233;t&#233;
utilis&#233;es pour construire un r&#233;seau de collaboration. Ce dernier est repr&#233;sent&#233; sous la forme
d&#8217;un graphe non dirig&#233; G = (V, E), o&#249; V est l&#8217;ensemble des n&#339;uds et E l&#8217;ensemble des ar&#234;tes. Un
n&#339;ud est ajout&#233; au graphe pour chaque auteur dans TALN Archives. Lorsque deux auteurs ont
collabor&#233; sur un article, une ar&#234;te est ajout&#233;e entre leurs deux n&#339;uds dans le graphe. Les poids
des ar&#234;tes sont fix&#233;s en fonction du nombre d&#8217;articles auxquels les auteurs ont collabor&#233;. Par
exemple, l&#8217;ar&#234;te entre les n&#339;uds de deux auteurs ayant co-&#233;crits trois articles aura un poids de
trois.
</p>
<p>La premi&#232;re exp&#233;rience que nous avons men&#233;e porte sur l&#8217;identification des auteurs les plus cen-
traux dans TALN Archives. Il s&#8217;agit d&#8217;identifier les auteurs qui ont un r&#244;le majeur dans l&#8217;animation
de la communaut&#233; francophone du TAL depuis les six derni&#232;res ann&#233;es. De nombreuses mesures
ont &#233;t&#233; propos&#233;es pour calculer le degr&#233; de centralit&#233; d&#8217;un n&#339;ud dans un graphe 10. Ici, nous
utilisons la mesure de centralit&#233; harmonique (Harmonic Centrality) que nous calculons &#224; l&#8217;aide
de l&#8217;&#233;quation d&#233;crite ci-dessous :
</p>
<p>CHarm(Vi) =
&#65535;
</p>
<p>Vj&#8712;V, Vj &#65535;=Vi
</p>
<p>1
distance(Vi ,Vj)
</p>
<p>(1)
</p>
<p>La table 2 pr&#233;sente la liste des dix auteurs les plus centraux dans TALN Archives selon la mesure
de centralit&#233; harmonique. Pour chacun d&#8217;entre eux, nous reportons le nombre de collaborations
(degr&#233; du n&#339;ud dans le graphe), le nombre d&#8217;articles ainsi que les mots cl&#233;s apparaissant dans
au moins deux de leurs articles. Il est int&#233;ressant de constater que cinq des dix auteurs les plus
centraux travaillent sur la th&#233;matique de la traduction automatique statistique. Cet engouement
pour la traduction automatique est &#233;galement observable sur la totalit&#233; des actes contenus dans
TALN Archives puisqu&#8217;il s&#8217;agit du mot cl&#233; le plus fr&#233;quent.
</p>
<p>10. Une &#233;tude comparative des mesures de centralit&#233; dans un graphe est pr&#233;sent&#233;e dans http://ecir2012.upf.
edu/ecir_paolo_boldi.pdf
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>511 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Auteur CHarm Deg. Art. Mots cl&#233;s
</p>
<p>Beno&#238;t Sagot 118.8 25 16 lexique-grammaire, r&#233;solution d&#8217;entit&#233;s nomm&#233;es,
d&#233;tection d&#8217;entit&#233;s nomm&#233;es, &#233;tiquetage morpho-
syntaxique, lexique syntaxique, persan
</p>
<p>Fr&#233;d&#233;ric B&#233;chet 115.8 15 7 reconnaissance automatique de la parole
Aur&#233;lien Max 111.8 12 11 paraphrase, wikip&#233;dia, aide &#224; la r&#233;daction, traduc-
</p>
<p>tion automatique statistique
Delphine Bernhard 111.3 18 7 analyse syntaxique
Fran&#231;ois Yvon 110.9 14 8 traduction automatique statistique, alignement sous-
</p>
<p>phrastique
Kar&#235;n Fort 107.3 11 7 accord inter-annotateurs, annotation manuelle,
</p>
<p>lexique
Philippe Langlais 106.7 9 10 traduction automatique statistique, analogie for-
</p>
<p>melle, alignement de mots
Fabrice Lef&#232;vre 106.0 9 5 compr&#233;hension de la parole, traduction automatique
</p>
<p>statistique, frames s&#233;mantiques, syst&#232;me de dialogue
oral
</p>
<p>Pierre Zweigenbaum 105.1 11 5 extraction d&#8217;information
St&#233;phane Huet 104.8 11 7 traduction automatique statistique, alignement de
</p>
<p>mots
</p>
<p>TABLE 2: Liste des auteurs les plus centraux dans TALN Archives. Le nombre de collaborations
(Deg.), le nombre d&#8217;articles (Art.) ainsi que les mots cl&#233;s de fr&#233;quence sup&#233;rieure &#224; un sont
&#233;galement report&#233;s.
</p>
<p>La seconde exp&#233;rience que nous pr&#233;sentons concerne l&#8217;identification du Kevin Bacon de TALN
Archives, i.e. l&#8217;auteur le plus central dans le r&#233;seau de collaboration. Il s&#8217;agit d&#8217;identifier l&#8217;auteur
qui poss&#232;de la distance moyenne la plus faible avec les autres auteurs du r&#233;seau. Soit H le plus
grand sous-graphe connect&#233; de G, |H | le nombre de n&#339;uds dans le graphe H et distance(Vi ,Vj)
le plus court chemin entre les n&#339;uds Vi et Vj , le n&#339;ud le plus central dans H est d&#233;finit par :
</p>
<p>Centralit&#233;(H) = argmin
Vi&#8712;H
</p>
<p>&#63726;&#63728;&#65535;Vj&#8712;H, Vj &#65535;=Vi distance(Vi ,Vj)
|H |&#8722; 1
</p>
<p>&#63737;&#63739; (2)
Dans TALN Archives, cet honneur revient &#224; Fr&#233;d&#233;ric B&#233;chet qui poss&#232;de une distance moyenne de
5,07 avec le reste des auteurs.
</p>
<p>4 Discussion
</p>
<p>Nous avons pr&#233;sent&#233; la construction de TALN Archives, une archive num&#233;rique des articles
scientifiques publi&#233;s dans le domaine du TAL par la communaut&#233; francophone. La version d&#233;crite
dans cette &#233;tude est compos&#233;e des actes des conf&#233;rences TALN et R&#201;CITAL de 2007 &#224; 2012. TALN
Archives est d&#232;s &#224; pr&#233;sent t&#233;l&#233;chargeable 11. Une interface web permettant l&#8217;exploration et la
</p>
<p>11. https ://github.com/boudinfl/taln-archives
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>512 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>recherche d&#8217;articles scientifiques dans TALN Archives est &#233;galement disponible en ligne 12.
</p>
<p>La premi&#232;re perspective &#224; ce travail est bien entendu l&#8217;extension de l&#8217;archive aux actes des
conf&#233;rences TALN et R&#201;CITAL publi&#233;s avant 2007. Pour cela, les m&#233;ta-donn&#233;es d&#233;j&#224; contenues
dans TALN Archives pourront &#234;tre utilis&#233;es pour entra&#238;ner des m&#233;thodes d&#8217;extraction supervis&#233;es.
La mise &#224; jour de l&#8217;archive avec les actes des conf&#233;rences futures est beaucoup plus simple puisque
les outils de gestion de conf&#233;rence couramment utilis&#233;s (e.g. easychair) permettent d&#8217;exporter les
m&#233;ta-donn&#233;es des articles accept&#233;s.
</p>
<p>Dans un second temps, nous souhaitons construire et analyser le r&#233;seau de citations de TALN
Archives. Grace &#224; ce dernier, il sera par exemple possible d&#8217;identifier les articles les plus influents
pour une th&#233;matique donn&#233;e pour ensuite y extraire automatiquement les contributions princi-
pales. Des travaux r&#233;cents ont &#233;galement d&#233;montr&#233; l&#8217;utilit&#233; du r&#233;seau de citations pour am&#233;liorer
la recherche d&#8217;articles scientifiques dans la litt&#233;rature (Bethard et Jurafsky, 2010).
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224; remercier nos relecteurs anonymes pour leurs commentaires ainsi que les membres
de l&#8217;&#233;quipe TALN du LINA pour leurs conseils avis&#233;s.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ATHAR, A. (2011). Sentiment Analysis of Citations using Sentence Structure-Based Features. In
Proceedings of the ACL 2011 Student Session, pages 81&#8211;87, Portland, OR, USA. Association for
Computational Linguistics.
BARZILAY, R. et MCKEOWN, K. R. (2001). Extracting Paraphrases from a Parallel Corpus. In
Proceedings of 39th Annual Meeting of the Association for Computational Linguistics, pages 50&#8211;57,
Toulouse, France. Association for Computational Linguistics.
BETHARD, S. et JURAFSKY, D. (2010). Who should I cite : learning literature search models from
citation behavior. In Proceedings of the 19th ACM international conference on Information and
knowledge management, CIKM &#8217;10, pages 609&#8211;618, New York, NY, USA. ACM.
COUNCILL, I., GILES, C. et KAN, M. (2008). ParsCit : An open-source CRF reference string parsing
package. In Proceedings of LREC, volume 2008, pages 661&#8211;667. European Language Resources
Association (ELRA).
DALE, R. et KILGARRIFF, A. (2010). Helping our own : text massaging for computational linguistics
as a new shared task. In Proceedings of the 6th International Natural Language Generation
Conference, INLG &#8217;10, pages 263&#8211;267, Stroudsburg, PA, USA. Association for Computational
Linguistics.
FUNG, P. (1998). A statistical view on bilingual lexicon extraction : from parallel corpora to
non-parallel corpora. Machine Translation and the Information Soup, pages 1&#8211;17.
RADEV, D., JOSEPH, M., GIBSON, B. et MUTHUKRISHNAN, P. (2009). A Bibliometric and Network
Analysis of the field of Computational Linguistics. Journal of the American Society for Information
Science and Technology, 1001:48109&#8211;1092.
</p>
<p>12. http://www.florianboudin.org/taln_archives/
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>513 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SCH&#196;FER, U., KIEFER, B., SPURK, C., STEFFEN, J. et WANG, R. (2011). The ACL Anthology
Searchbench. In Proceedings of the ACL-HLT 2011 System Demonstrations, pages 7&#8211;13, Portland,
Oregon. Association for Computational Linguistics.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>514 c&#65535; ATALA</p>

</div></div>
</body></html>