<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Aide &#224; l&#8217;enrichissement d&#8217;un r&#233;f&#233;rentiel terminologique : propositions et exp&#233;rimentations</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Aide &#224; l&#8217;enrichissement d&#8217;un r&#233;f&#233;rentiel terminologique :
propositions et exp&#233;rimentations
</p>
<p>Thibault Mondary1 Adeline Nazarenko1
Ha&#239;fa Zargayouna1 Sabine Barreaux2
</p>
<p>(1) Universit&#233; Paris 13, Sorbonne Paris Cit&#233;, LIPN (UMR 7030), F-93430 Villetaneuse, France
(2) INIST-CNRS, Vand&#339;uvre-l&#232;s-Nancy, France
</p>
<p>(1) prenom.nom@lipn.univ-paris13.fr, (2) prenom.nom@inist.fr
</p>
<p>R&#201;SUM&#201;
En s&#8217;appuyant sur une exp&#233;rience d&#8217;enrichissement terminologique, cet article montre comment
assister le travail d&#8217;acquisition terminologique et surmonter concr&#232;tement les deux difficult&#233;s qu&#8217;il
pr&#233;sente : la masse de candidats-termes &#224; consid&#233;rer et la subjectivit&#233; des jugements terminolo-
giques qui varient notamment en fonction du type de terminologie &#224; produire. Nous proposons
des strat&#233;gies simples pour filtrer a priori une partie du bruit des r&#233;sultats des extracteurs et
rendre ainsi la validation praticable pour des terminologues et nous d&#233;montrons leur efficacit&#233;
sur un &#233;chantillon de candidats-termes propos&#233;s &#224; la validation de deux sp&#233;cialistes du domaine.
Nous montrons &#233;galement qu&#8217;en appliquant &#224; une campagne de validation terminologique les
m&#234;mes principes m&#233;thodologiques que pour une campagne d&#8217;annotation, on peut contr&#244;ler la
qualit&#233; des jugements de validation pos&#233;s et de la terminologie qui en r&#233;sulte.
</p>
<p>ABSTRACT
Help enrich a terminological repository : proposals and experiments
</p>
<p>Based on an experience of terminological enrichment, this paper shows how to support the
work of terminological acquisition and overcome practical difficulties it presents, i.e. the mass of
candidate terms to consider and the subjectivity of terminological judgments which depends on
the type of terminology to produce. We propose simple strategies to filter a priori part of the noise
from the results of term extractors so as to make the validation practicable for terminologists. We
demonstrate their effectiveness on a sample of candidate terms proposed for the validation of
two experts. We also show that by applying to term validation campaigns the methodological
principles that have been proposed for corpus annotation campaigns, we can control the quality
of validation judgments and of the resulting terminologies.
</p>
<p>MOTS-CL&#201;S : Acquisition terminologique, validation de candidats-termes, filtrage de termes,
distance terminologique, vote, accord inter-juges.
</p>
<p>KEYWORDS: Terminology acquisition, term candidate validation, term filtering, terminological
distance, vote, inter-judge agreement.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>779 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>Les ressources terminologiques, qu&#8217;elles soient monolingues, bilingues ou autres, sont utilis&#233;es
dans de nombreux outils de gestion de contenus sp&#233;cialis&#233;s mais leur &#233;laboration pr&#233;sente
souvent un co&#251;t r&#233;dhibitoire. La mise &#224; disposition de ressources 1 ne r&#233;sout que partiellement le
probl&#232;me car l&#8217;&#233;volution des domaines et des besoins applicatifs rend n&#233;cessaires de fr&#233;quentes
mises &#224; jour.
</p>
<p>Des outils d&#8217;extraction terminologiques ont &#233;t&#233; d&#233;velopp&#233;s depuis une vingtaine d&#8217;ann&#233;es (Jac-
quemin et Bourigault, 2003) pour automatiser les processus d&#8217;acquisition terminologique mais on
sait que les extracteurs de termes ne peuvent fournir au mieux que des &#171; candidats termes &#187;, que
des mots ou groupes de mots qui, sur la base de propri&#233;t&#233;s syntaxiques, lexicales et statistiques,
semblent avoir un comportement terminologique, c&#8217;est-&#224;-dire avoir un sens pr&#233;cis et relativement
stable au sein d&#8217;un domaine de sp&#233;cialit&#233;.
</p>
<p>L&#8217;acquisition d&#8217;une terminologie pour un domaine particulier &#224; l&#8217;aide d&#8217;outils d&#8217;analyse terminolo-
gique se heurte en fait &#224; une double difficult&#233;. La premi&#232;re concerne le filtrage et le retraitement
des sorties d&#8217;analyseurs qui demandent &#224; &#234;tre valid&#233;es par un terminologue si on vise une termi-
nologie de qualit&#233; et consultable 2. Ce travail de validation peut s&#8217;av&#233;rer tr&#232;s fastidieux quand
on utilise de gros corpus d&#8217;acquisition et que les extracteurs utilis&#233;s sont prolixes. La seconde
difficult&#233; est li&#233;e &#224; la diversit&#233; des styles terminologiques : il existe des terminologies de taille tr&#232;s
variable, m&#234;me pour un m&#234;me domaine ; la granularit&#233; de la description terminologique varie ;
certaines terminologies recensent toutes les variantes des termes alors que d&#8217;autres ne listent
que les termes canoniques ou &#171; recommand&#233;s &#187; ; dans une perspective d&#8217;annotation s&#233;mantique,
on privil&#233;gie les termes longs, alors qu&#8217;on pr&#233;f&#233;rera des termes plus courts pour les t&#226;ches
d&#8217;indexation. Le choix d&#8217;un style de terminologie n&#8217;est g&#233;n&#233;ralement pas guid&#233; par les outils
d&#8217;extraction terminologique mais il faut n&#233;anmoins en tenir compte dans le travail de validation.
</p>
<p>En s&#8217;appuyant sur une exp&#233;rience d&#8217;enrichissement terminologique men&#233;e en collaboration entre
l&#8217;INIST et le LIPN 3, cet article montre comment on peut concr&#232;tement surmonter ces deux
difficult&#233;s et assister le travail d&#8217;acquisition terminologique. La section 2 pr&#233;sente le contexte
dans lequel cette exp&#233;rience a &#233;t&#233; men&#233;e puis nous montrons comment on peut filtrer a priori
une partie du bruit des r&#233;sultats des extracteurs pour rendre la t&#226;che de validation accessible &#224;
des sp&#233;cialistes du domaine (section 3) tout en contr&#244;lant la qualit&#233;, ou du moins l&#8217;homog&#233;n&#233;it&#233;,
de ce travail (section 4).
</p>
<p>2 Contexte exp&#233;rimental
</p>
<p>La question de l&#8217;&#233;volution des r&#233;f&#233;rentiels d&#8217;indexation est une question importante pour tout
organisme qui g&#232;re et maintient de tels r&#233;f&#233;rentiels. C&#8217;est en particulier le cas de l&#8217;INIST. A partir
d&#8217;un th&#233;saurus de pharmacologie utilis&#233; comme r&#233;f&#233;rentiel d&#8217;indexation, deux questions se sont
</p>
<p>1. Par exemple par l&#8217;Office qu&#233;b&#233;cois de la langue fran&#231;aise (http ://gdt.oqlf.gouv.qc.ca/) ou la D&#233;l&#233;gation g&#233;n&#233;rale &#224;
la langue fran&#231;aise et aux langues de France (http ://www.culture.fr/Ressources/FranceTerme).
</p>
<p>2. Les sorties des extracteurs peuvent parfois &#234;tre utilis&#233;es telles que quand elles sont directement int&#233;gr&#233;es dans des
syst&#232;mes qui sont robustes au bruit, par exemple certaines application de classification de documents.
</p>
<p>3. Ce travail s&#8217;inscrit dans le prolongement des campagnes d&#8217;&#233;valuation des outils d&#8217;extraction terminologique men&#233;es
dans le cadre du programme Quaero (projets CTC et Corpus). Il a &#233;t&#233; en partie financ&#233; par ce programme.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>780 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5-HT3 Serotonine receptor
5-HT4 Serotonine receptor
5S-RNA
5s rrna
. . .
</p>
<p>Bacillus subtilis ribonuclease
Bacterial lipopolysaccharide receptors
Connective tissue activating factor
. . .
</p>
<p>Recombinant microorganism
Recombinant protein
Recombinant virus
</p>
<p>FIGURE 1 &#8211; Extrait du r&#233;f&#233;rentiel terminologique
</p>
<p>pos&#233;es. Est-il possible d&#8217;assister la mise &#224; jour de ce r&#233;f&#233;rentiel qui se faisait jusque l&#224; de mani&#232;re
purement manuelle ? Est-il possible de construire &#224; partir de ce th&#233;saurus une terminologie
adapt&#233;e &#224; des t&#226;ches d&#8217;annotation s&#233;mantique ? Avec ces objectifs en t&#234;te, nous avons cherch&#233; &#224;
d&#233;finir un protocole d&#8217;enrichissement terminologique qui tire le meilleur parti de l&#8217;expertise des
terminologues et assure un travail de qualit&#233;.
</p>
<p>Le r&#233;f&#233;rentiel terminologique Le r&#233;f&#233;rentiel est un th&#233;saurus construit par l&#8217;INIST &#224; des fins
d&#8217;indexation de la partie pharmacologique de la base de donn&#233;es bibliographiques PASCAL 4. Il
contient 76 466 termes en anglais avec certaines variations et certaines relations hi&#233;rarchiques,
et est accessible via TermSciences 5, le portail terminologique multidisciplinaire mis en place
par l&#8217;INIST. Nous l&#8217;utilisons ici comme simple terminologie, sans tenir compte des relations
terminologiques qu&#8217;il comporte. Un extrait est pr&#233;sent&#233; sur la figure 1. Ce r&#233;f&#233;rentiel d&#8217;indexation
privil&#233;gie les termes g&#233;n&#233;raux du domaine de la pharmacologie au d&#233;triment des termes tr&#232;s
sp&#233;cifiques.
</p>
<p>Les corpus d&#8217;acquisition Le processus d&#8217;extraction de termes repose sur l&#8217;existence de corpus
d&#8217;acquisition. Dans le cadre de cette exp&#233;rience, deux corpus anglais ont &#233;t&#233; utilis&#233;s. Le premier
(corpus CR) est constitu&#233; de r&#233;sum&#233;s d&#8217;articles de pharmacologie de la base PASCAL, le genre
de textes couramment utilis&#233; par l&#8217;INIST pour l&#8217;indexation des articles scientifiques. Il comporte
1 500 000 mots. Le second corpus (CB) porte aussi sur la pharmacologie mais il est compos&#233; de
textes diff&#233;rents. Il s&#8217;agit de brevets europ&#233;ens qu&#8217;il est pr&#233;vu d&#8217;annoter s&#233;mantiquement dans le
cadre du programme Quaero. Il comporte 2 500 000 mots.
</p>
<p>Les extracteurs de termes Les extracteurs de termes utilisent diff&#233;rentes strat&#233;gies pour
extraire des candidats-termes. Certains comme YaTeA (Aubin et Hamon, 2006) ou Acabit (Daille,
2003) utilisent des patrons linguistiques, tandis que d&#8217;autres comme Termostat (Drouin, 2006)
reposent sur l&#8217;analyse des contrastes entre un corpus de domaine g&#233;n&#233;ral et un corpus de
sp&#233;cialit&#233;. Quasiment tous utilisent des filtrages statistiques avec des seuils plus ou moins
tol&#233;rants afin de filtrer le bruit en fonction de l&#8217;objectif vis&#233; par l&#8217;extracteur (par exemple un petit
nombre de candidats-termes potentiellement repr&#233;sentatifs, ou alors une couverture maximale).
Nous avons observ&#233; une grande h&#233;t&#233;rog&#233;n&#233;it&#233; dans le nombre de termes extraits sur un m&#234;me
corpus, certains extracteurs produisant 200 fois plus de termes que d&#8217;autres.
</p>
<p>Dans cette exp&#233;rience, nous avons utilis&#233; les sorties des extracteurs test&#233;s lors de la campagne
Qu&#230;ro (Mondary et al., 2012) 6. Les diff&#233;rentes strat&#233;gies d&#8217;extraction sont repr&#233;sent&#233;es. Dans
</p>
<p>4. http://inist.fr/spip.php?article170
5. http://www.termsciences.fr
6. Notamment Acabit, Termostat et YaTeA, ainsi que des prototypes de recherche des partenaires Qu&#230;ro.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>781 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>l&#8217;ensemble, les extracteurs sont verbeux. Les corpus de r&#233;sum&#233;s (CR) et de brevets (CB) ont
permis respectivement d&#8217;extraire 321 124 et 303 648 candidats-termes. L&#8217;union des sorties des
extracteurs sur les deux corpus donne un total de 570 608 candidats-termes diff&#233;rents. Certains
de ces candidats-termes existaient d&#233;j&#224; dans le r&#233;f&#233;rentiel de l&#8217;INIST mais un nombre significatif
de nouveaux termes ont &#233;t&#233; propos&#233;s : 298 593 et 271 472 candidats-termes resp. pour CR et CB.
</p>
<p>L&#8217;interface de validation L&#8217;objectif &#233;tant de valider les nouveaux termes extraits, une interface
de validation a &#233;t&#233; fournie aux experts de l&#8217;INIST. C&#8217;est une application web, qui est disponible sur
Sourceforge. ValiTerms 7 permet aux terminologues de visualiser les occurrences des candidats-
termes &#224; valider dans leur contexte (les phrases du corpus) et offre la possibilit&#233; de choisir pour
chaque terme s&#8217;il est correct, incorrect ou douteux 8. Une zone de texte en face de chaque terme
permet &#233;ventuellement d&#8217;indiquer la forme correcte attendue.
</p>
<p>3 Filtrer a priori une partie du bruit
</p>
<p>Il n&#8217;est pas raisonnable de demander &#224; des experts de valider plusieurs centaines de milliers
de candidats-termes. Nous devons trouver des strat&#233;gies pour proposer &#224; l&#8217;expert les candidats-
termes les plus &#224; m&#234;me de l&#8217;int&#233;resser.
</p>
<p>3.1 Deux hypoth&#232;ses &#224; valider
</p>
<p>Filtrer par le vote des syst&#232;mes Dans la mesure o&#249; nous disposions des sorties de plusieurs
extracteurs, nous avons propos&#233; une premi&#232;re strat&#233;gie de filtrage consistant &#224; donner en priorit&#233;
&#224; valider aux terminologues les termes retrouv&#233;s par plus de syst&#232;mes. C&#8217;est une technique
de vote classique (Choi, 1999). L&#8217;intuition est que les candidats-termes retrouv&#233;s par plusieurs
syst&#232;mes ont plus de chance d&#8217;&#234;tre repr&#233;sentatifs que les candidats-termes retourn&#233;s par un seul
extracteur, m&#234;me si un biais de cette approche conduit &#224; &#233;liminer les propositions faites par un
extracteur qui serait plus original que les autres.
</p>
<p>Nous avons r&#233;cup&#233;r&#233; la liste des candidats-termes absents de la r&#233;f&#233;rence et retrouv&#233;s sur chaque
corpus par exactement n extracteurs (n varie de 2 &#224; 7 pour le corpus de brevets et de 2 &#224; 4 pour
le corpus des r&#233;sum&#233;s qui n&#8217;a &#233;t&#233; trait&#233; que par quatre extracteurs). La distribution est pr&#233;sent&#233;e
dans le tableau 1.
</p>
<p>Filtrer par la distance au r&#233;f&#233;rentiel Nous faisons &#233;galement l&#8217;hypoth&#232;se que les candidats-
termes propos&#233;s ont plus de chance d&#8217;&#234;tre valides s&#8217;ils sont proches des termes du r&#233;f&#233;rentiel
source. Nous avons test&#233; cette hypoth&#232;se en utilisant la distance terminologique pr&#233;sent&#233;e
dans (Zargayouna et Nazarenko, 2010) et impl&#233;ment&#233;e dans l&#8217;outil Termometer 9. C&#8217;est une
distance ind&#233;pendante de la langue, qui se mesure sans faire appel &#224; une quelconque ressource
</p>
<p>7. ValiTerms ne n&#233;cessite pas d&#8217;installation sur le poste client mais permet d&#8217;enregistrer les validations interm&#233;diaires
en local (http ://sourceforge.net/projects/valiterms).
</p>
<p>8. Le choix &#171; douteux &#187; est un ajout r&#233;cent qui n&#8217;a pas &#233;t&#233; utilis&#233; dans l&#8217;exp&#233;rience relat&#233;e dans cet article.
9. http ://sourceforge.net/projects/termometerxd
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>782 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Retrouv&#233;s par exactement CB CR
7 syst&#232;mes 89
6 syst&#232;mes 363
5 syst&#232;mes 1 700
4 syst&#232;mes 12 164 3 439
3 syst&#232;mes 42 296 25 445
2 syst&#232;mes 137 114 74 576
</p>
<p>TABLE 1 &#8211; Distribution des candidats termes absents de la r&#233;f&#233;rence
</p>
<p>linguistique et qui prend en compte la compositionnalit&#233; des termes en combinant une distance
sur les cha&#238;nes de caract&#232;res et une distance sur les mots.
</p>
<p>3.2 &#201;chantillon et r&#233;sultats
</p>
<p>Pour valider ces hypoth&#232;ses, nous avons constitu&#233; un jeu de test de 3 000 candidats-termes &#224;
valider (1 500 par corpus), en &#233;quilibrant les termes retrouv&#233;s par n syst&#232;mes exactement (avec
n &#8805; 2), en assurant la repr&#233;sentation des diff&#233;rents extracteurs et prenant des termes &#224; la fois
proches et &#233;loign&#233;s de la r&#233;f&#233;rence selon la mesure de distance utilis&#233;e.
</p>
<p>Nous avons donn&#233; ces 3 000 candidats-termes &#224; valider &#224; deux experts de l&#8217;INIST 10. Les r&#233;sultats
globaux sont pr&#233;sent&#233;s dans le tableau 2. La premi&#232;re partie de ce tableau pr&#233;sente la proportion
de termes jug&#233;s pertinents par les experts parmi les termes qu&#8217;ils ont eu &#224; valider. La deuxi&#232;me
partie &#233;tudie les commentaires. Il a &#233;t&#233; demand&#233; aux experts d&#8217;indiquer en commentaire la forme
correcte des termes rejet&#233;s comme non pertinents. Les termes rejet&#233;s peuvent &#234;tre mal form&#233;s ou
mal orthographi&#233;s. D&#8217;autres sont des termes longs qui coordonnent plusieurs notions, dans ce cas
l&#8217;expert devait indiquer le ou les sous-termes &#224; retenir. Enfin, certains n&#8217;appartiennent pas au
domaine. On constate qu&#8217;un terme, m&#234;me s&#8217;il est jug&#233; &#171; non-pertinent &#187;, peut &#234;tre int&#233;ressant
&#224; proposer &#224; la validation parce qu&#8217;il sugg&#232;re d&#8217;autres termes aux sp&#233;cialistes du domaine.
La derni&#232;re partie du tableau pr&#233;sente les termes &#224; ajouter dans la terminologie destin&#233;e &#224;
l&#8217;annotation s&#233;mantique 11, cela correspond &#224; l&#8217;union des termes pertinents et des termes des
commentaires ne figurant pas dans le r&#233;f&#233;rentiel de d&#233;part.
</p>
<p>3.3 Analyse
</p>
<p>L&#8217;analyse de ces r&#233;sultats permet de confirmer nos deux hypoth&#232;se initiales.
</p>
<p>Le vote des syst&#232;mes et le jugement des experts sont corr&#233;l&#233;s. L&#8217;histogramme de gauche sur la
figure 2 pr&#233;sente la proportion de termes pertinents parmi ceux qui sont retrouv&#233;s par exactement
n syst&#232;mes pour les corpus de brevets (en bleu) et de r&#233;sum&#233;s (en rouge). On observe que cette
proportion d&#233;cro&#238;t avec le nombre de syst&#232;mes 12.
</p>
<p>10. Nous tenons &#224; remercier Anne Busin et Marie-Pierre Verdier, sp&#233;cialistes du domaine de la pharmacologie et
charg&#233;es de l&#8217;indexation des articles scientifiques, pour leur travail de validation des terminologies.
11. Nous n&#8217;avons pas encore le bilan des termes &#224; ajouter au r&#233;f&#233;rentiel d&#8217;indexation qui a vocation &#224; &#234;tre plus r&#233;duit
</p>
<p>que la terminologie.
12. L&#8217;histogramme bleu comporte une valeur aberrante pour 4 syst&#232;mes, qui est probablement due &#224; une irr&#233;gularit&#233;
</p>
<p>dans la constitution du jeu de test.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>783 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CB CR
Termes &#224; valider 1 500 1 500
Termes pertinents 263 (17,5%) 312 (20,8%)
Termes non pertinents 1 237 (82,5%) 1 188 (79,2%)
Termes avec un commentaire 664 (53,7%) 829 (69,8%)
Termes propos&#233;s dans les commentaires 706 941
&#8211;&gt; qui existent d&#233;j&#224; dans la r&#233;f&#233;rence 422 547
&#8211;&gt; qui n&#8217;existent pas dans la r&#233;f&#233;rence 284 394
Termes &#224; ajouter au r&#233;f&#233;rentiel 547 (36,5%) 706 (47,1%)
</p>
<p>TABLE 2 &#8211; R&#233;sultats de la campagne d&#8217;enrichissement
</p>
<p>! &quot; # $ %
</p>
<p>&amp;'
</p>
<p>&quot;'
</p>
<p>(&amp;'
</p>
<p>(&quot;'
</p>
<p>%&amp;'
</p>
<p>%&quot;'
</p>
<p>$&amp;'
</p>
<p>$&quot;'
</p>
<p>#&amp;'
</p>
<p>#&quot;'
</p>
<p>')*+,-+.)/+,012+20.)34,/5.)6,+7+0. ')*+,-+.)/+,012+20.)34,/5.),8.5-8.
</p>
<p>9:.0;-+.
</p>
<p>!&quot;# !&quot;$ !&quot;% !&quot;&amp; !&quot;' !&quot;( !&quot;)
</p>
<p>!*
</p>
<p>#!*
</p>
<p>$!*
</p>
<p>%!*
</p>
<p>&amp;!*
</p>
<p>'!*
</p>
<p>(!*
</p>
<p>)!*
</p>
<p>+,-.,/01,-234,42/
</p>
<p>53/2647,
</p>
<p>FIGURE 2 &#8211; Corr&#233;lation du nombre de syst&#232;mes (&#224; gauche) ou de la distance (&#224; droite) avec les
jugements de pertinence
</p>
<p>La distance terminologique et le jugement des experts sont &#233;galement corr&#233;l&#233;s. Le graphique
de droite sur la figure 2 montre que la proportion de termes pertinents (en ordonn&#233;e) d&#233;cro&#238;t
&#233;galement quand la distance des termes avec ceux de la r&#233;f&#233;rence (abscisse) augmente. Plus les
termes sont proches du r&#233;f&#233;rentiel (au sens de la distance terminologique), plus ils tendent &#224; &#234;tre
jug&#233;s pertinents par les experts. Sur cet &#233;chantillon, si on n&#8217;avait retenu que les candidats-termes
dont la distance est inf&#233;rieure &#224; 0,4, nous aurions retrouv&#233; pr&#232;s de 75% de l&#8217;ensemble des termes
pertinents et les experts auraient retenu pr&#232;s de la moiti&#233; des termes &#224; valider comme pertinents.
</p>
<p>Les observations faites dans le cadre de cette exp&#233;rience montrent que l&#8217;on peut filtrer efficace-
ment les candidats-termes qui sont donn&#233;s &#224; valider &#224; des terminologues en exploitant les sorties
de diff&#233;rents extracteurs et/ou en s&#8217;appuyant sur une terminologie source. Le but est de donner
des listes suffisamment filtr&#233;es pour que le travail de validation ne soit pas trop fastidieux et
que les termes pertinents ne soient pas noy&#233;s sous le bruit. Nous consid&#233;rons que juger 1 terme
pertinent sur 3 constitue une t&#226;che de validation raisonnable, d&#8217;autant que les termes rejet&#233;s en
sugg&#232;rent souvent d&#8217;autres plus pertinents.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>784 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Phase 1 Phase 2 Phase 1 Phase 2
Percent Agreement 80% 88,4% N Accords 200 221
Pi de Scott 0,531 0,751 N D&#233;saccords 50 29
Kappa de Cohen 0,532 0,752
</p>
<p>TABLE 3 &#8211; &#201;volution des accords inter-annotateurs
</p>
<p>4 Contr&#244;ler la qualit&#233; de la validation
</p>
<p>Une fois que la liste de candidats-termes &#224; valider par les experts est constitu&#233;e (&#224; l&#8217;aide des
strat&#233;gies de filtrage pr&#233;sent&#233;es dans la section pr&#233;c&#233;dente) peut d&#233;buter la phase de validation
manuelle. La principale difficult&#233; que soul&#232;ve cette phase tient &#224; la subjectivit&#233; des jugements de
pertinence des experts du domaine qui est elle-m&#234;me li&#233;e &#224; leur compr&#233;hension de l&#8217;application
vis&#233;e et du type de terminologie que l&#8217;on cherche &#224; construire. Par exemple un terme long comme
aerosol of stable radioactive nanoparticle semble bien form&#233; mais est-il pertinent pour enrichir le
r&#233;f&#233;rentiel d&#8217;indexation, et si ce n&#8217;est pas le cas quel sous-terme privil&#233;gier ? aerosol, radioactive
nanoparticle ou stable nanoparticle ?
</p>
<p>Pour contr&#244;ler la subjectivit&#233; des jugements, nous proposons, en nous inspirant de la m&#233;thodo-
logie propos&#233;e par (Fort, 2012) pour l&#8217;annotation de corpus, de mettre en place une phase de
pr&#233;-campagne de validation et de calculer les accords inter-juges tout au long du processus de
validation. La phase de pr&#233;-campagne permet de mettre &#224; jour un guide de validation qui fixe
les consignes de validation et l&#8217;esprit dans lequel cette validation doit &#234;tre faite, jusqu&#8217;&#224; ce que
les accords deviennent satisfaisants. Une fois le niveau de qualit&#233; requis atteint, la validation
&#224; grande &#233;chelle peut se faire. Pour les campagnes de grande envergure, il est probablement
souhaitable de re-mesurer &#233;galement &#224; intervalle r&#233;gulier les accords intra et inter-juges pour
s&#8217;assurer que le processus de validation ne d&#233;vie pas.
</p>
<p>Nous avons propos&#233; aux deux experts de l&#8217;INIST de valider en double aveugle 250 candidats-
termes choisis al&#233;atoirement dans notre &#233;chantillon de 3 000. Nous avons ensuite calcul&#233; les
accords entre leurs jugements (premi&#232;re colonne du tableau 3). Comme ces valeurs &#233;taient basses,
nous avons analys&#233; en d&#233;tail les cas de d&#233;saccords dans les jugements et les commentaires. Les
probl&#232;mes rencontr&#233;s &#233;taient majoritairement dus &#224; des questions de d&#233;coupage des termes longs
(par exemple corosolic acid content of banaba extract doit &#234;tre d&#233;coup&#233; en corosolic acid, banaba
et extract), mais aussi de g&#233;n&#233;ricit&#233; des termes (review paper est incorrect car trop g&#233;n&#233;rique
tandis que retrospective study est correct car important en &#233;pid&#233;miologie) et de termes hors
du domaine du r&#233;f&#233;rentiel (hydroxyglitazone). Certains cas &#233;taient vraiment probl&#233;matiques
comme streptozotocin qui est non pertinent (compos&#233; chimique servant &#224; induire une pathologie
exp&#233;rimentale), tandis que streptozotocin induced diabetes est pertinent (pathologie exp&#233;rimentale
induite par le compos&#233; chimique). Cette analyse a permis de sp&#233;cifier clairement les consignes
dans le guide de validation, en dissociant notamment les objectifs d&#8217;enrichissement du r&#233;f&#233;rentiel
d&#8217;indexation et de cr&#233;ation d&#8217;une terminologie pour l&#8217;annotation de corpus. Cette clarification
a permis d&#8217;am&#233;liorer les accords sur un nouveau jeu de 250 termes valid&#233;s en double aveugle
(deuxi&#232;me colonne du tableau 3). A partir de l&#224;, les experts ont pu valider des 2 500 candidats
termes restants. Cette exp&#233;rience montre qu&#8217;en proc&#233;dant avec m&#233;thode, on peut contr&#244;ler la
subjectivit&#233; des jugements de validation et ainsi obtenir une terminologie de bonne qualit&#233; &#224;
partir des extracteurs de termes.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>785 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5 Conclusion et perspectives
</p>
<p>Cet article propose une m&#233;thodologie permettant d&#8217;exploiter les sorties d&#8217;extracteurs de termes
pour construire ou enrichir des terminologies &#224; un co&#251;t et avec une qualit&#233; raisonnables. On
ne peut pas se contenter de donner des listes de candidats-termes &#224; valider aux terminologues.
Cela s&#8217;apparente &#224; chercher un terme pertinent un peu &#224; l&#8217;aveuglette dans un amas de termes
bruit&#233;s : le travail de validation ne peut &#234;tre de bonne qualit&#233;, l&#8217;attention se rel&#226;che, les crit&#232;res
deviennent flous, les objectifs sont perdus de vue.
</p>
<p>Nous avons montr&#233; qu&#8217;on peut cependant adopter des strat&#233;gies simples pour filtrer a priori le
gros du bruit dans les listes de candidats-termes en faisant voter plusieurs extracteurs de termes
et/ou en mesurant la distance des termes propos&#233;s &#224; ceux d&#8217;une terminologie de r&#233;f&#233;rence prise
comme point de d&#233;part. Il reste &#224; voir comment ces deux crit&#232;res peuvent &#234;tre combin&#233;s pour
exploiter au mieux l&#8217;expertise humaine lors de la validation.
</p>
<p>Nous avons montr&#233; par ailleurs qu&#8217;un protocole de validation clair, avec un guide de validation
et le contr&#244;le des accords inter-juges, permet d&#8217;atteindre une bonne stabilit&#233; de validation, seule
garantie de la qualit&#233; des jugements humains qui sont ainsi pos&#233;s.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AUBIN, S. et HAMON, T. (2006). Improving term extraction with terminological resources. In
SALAKOSKI, T., GINTER, F., PYYSALO, S. et PAHIKKALA, T., &#233;diteurs : Advances in Natural Language
Processing 5th International Conference on NLP, FinTAL 2006, pages 380&#8211;387, Turku, Finland.
Springer.
CHOI, F. Y. Y. (1999). A flexible distributed architecture for nlp system development and use.
In Proceedings of the 37th annual meeting of the Association for Computational Linguistics on
Computational Linguistics, ACL &#8217;99, pages 615&#8211;618, Stroudsburg, PA, USA. Association for
Computational Linguistics.
DAILLE, B. (2003). Conceptual structuring through term variations. In BOND, F., KORHONEN, A.,
MACCARTHY, D. et VILLACICENCIO, A., &#233;diteurs : Proceedings of ACL 2003 Workshop on Multiword
Expressions : Analysis, Acquisition and Treatment, pages 9&#8211;16.
DROUIN, P. (2006). Termhood experiments : quantifying the relevance of candidate terms.
Modern Approaches to Terminological Theories and Applications, 36:375&#8211;391.
FORT, K. (2012). Les ressources annot&#233;es, un enjeu pour l&#8217;analyse de contenu : vers une m&#233;thodologie
de l&#8217;annotation manuelle de corpus. Th&#232;se, Universit&#233; Paris-Nord &#8211; Paris XIII.
JACQUEMIN, C. et BOURIGAULT, D. (2003). Term extraction and automatic indexing. InMITKOV, R.,
&#233;diteur : Handbook of Computational Linguistics, chapitre 19, pages 599&#8211;615. Oxford University
press, Oxford, GB.
MONDARY, T., NAZARENKO, A., ZARGAYOUNA, H. et BARREAUX, S. (2012). The Quaero Evaluation
Campaign on Term Extraction. In The eighth international conference on Language Resources and
Evaluation (LREC), pages 663&#8211;669, Istanbul, Turkey.
ZARGAYOUNA, H. et NAZARENKO, A. (2010). Evaluation of Textual Knowledge Acquisition Tools :
a Challenging Task. In Proceedings of the International Conference on Language Resources and
Evaluation (LREC 2010), pages 435&#8211;440, Valletta, Malte.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>786 c&#65535; ATALA</p>

</div></div>
</body></html>