<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extension dynamique de lexiques morphologiques pour le fran&#231;ais &#224; partir d&#8217;un flux textuel</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Extension dynamique de lexiques morphologiques
pour le fran&#231;ais &#224; partir d&#8217;un flux textuel
</p>
<p>Beno&#238;t Sagot1 Damien Nouvel1 Virginie Mouilleron1 Marion Baranes2,1
(1) Alpage, INRIA &amp; Universit&#233; Paris-Diderot, 75013 Paris
</p>
<p>(2) viavoo, 92100 Boulogne Billancourt
{prenom.nom}@inria.fr
</p>
<p>R&#201;SUM&#201;
L&#8217;incompl&#233;tude lexicale est un probl&#232;me r&#233;current lorsque l&#8217;on cherche &#224; traiter le langage
naturel dans sa variabilit&#233;. Effectivement, il semble aujourd&#8217;hui n&#233;cessaire de v&#233;rifier et compl&#233;ter
r&#233;guli&#232;rement les lexiques utilis&#233;s par les applications qui analysent d&#8217;importants volumes de
textes. Ceci est plus particuli&#232;rement vrai pour les flux textuels en temps r&#233;el. Dans ce contexte,
notre article pr&#233;sente des solutions d&#233;di&#233;es au traitement des mots inconnus d&#8217;un lexique. Nous
faisons une &#233;tude des n&#233;ologismes (linguistique et sur corpus) et d&#233;taillons la mise en &#339;uvre
de modules d&#8217;analyse d&#233;di&#233;s &#224; leur d&#233;tection et &#224; l&#8217;inf&#233;rence d&#8217;informations (forme de citation,
cat&#233;gorie et classe flexionnelle) &#224; leur sujet. Nous y montrons que nous sommes en mesure, gr&#226;ce
notamment &#224; des modules d&#8217;analyse des d&#233;riv&#233;s et des compos&#233;s, de proposer en temps r&#233;el des
entr&#233;es pour ajout aux lexiques avec une bonne pr&#233;cision.
</p>
<p>ABSTRACT
Dynamic extension of a French morphological lexicon based a text stream
</p>
<p>Lexical incompleteness is a recurring problem when dealing with natural language and its
variability. It seems indeed necessary today to regularly validate and extend lexica used by tools
processing large amounts of textual data. This is even more true when processing real-time text
flows. In this context, our paper introduces techniques aimed at addressing words unknown to a
lexicon. We first study neology (from a theoretic and corpus-based point of view) and describe the
modules we have developed for detecting them and inferring information about them (lemma,
category, inflectional class). We show that we are able, using among others modules for analyzing
derived and compound neologisms, to generate lexical entries candidates in real-time and with a
good precision.
</p>
<p>MOTS-CL&#201;S : N&#233;ologismes, analyse morphologique, lexiques dynamiques.
KEYWORDS: Neologisms, Morphological Analysis, Dynamic Lexica.
</p>
<p>1 L&#8217;incompl&#233;tude lexicale et les n&#233;ologismes
</p>
<p>Tout comme les dictionnaires de langues, par d&#233;finition lacunaires, les lexiques utilis&#233;s pour des
applications en Traitement Automatique du langage (TAL) doivent &#234;tre r&#233;guli&#232;rement compl&#233;t&#233;s
afin de refl&#233;ter au plus pr&#232;s les r&#233;alit&#233;s linguistiques et limiter ainsi l&#8217;incompl&#233;tude lexicale.
Cependant ce processus continu de mise &#224; jour ne peut suffire &#224; lui seul, ne serait-ce que par
le co&#251;t humain d&#8217;une telle t&#226;che. Il est donc utile de disposer de modules d&#8217;analyse permettant
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>407 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;extraire automatiquement de nouvelles entr&#233;es lexicales et les ajouter, apr&#232;s validation ma-
nuelle ou automatique, dans des ressources lexicales. La mise au point de tels outils est plus
particuli&#232;rement int&#233;ressante pour le traitement des donn&#233;es textuelles r&#233;centes, voire des corpus
dynamiques comme un flux de d&#233;p&#234;ches d&#8217;agence, produites en temps quasi-r&#233;el.
</p>
<p>&#201;tant donn&#233; un outil de TAL et un texte &#224; traiter, certains tokens 1 sont inconnus : &#224; partir du
lexique, l&#8217;outil ne parvient pas &#224; les analyser comme mots-formes simples ou combinaisons
r&#233;guli&#232;res de tels mots-formes (par exemple, donne-moi est inconnu en tant que tel des lexiques
de r&#233;f&#233;rence mais analysable comme combinaison typographique des mots-formes donne et -moi).
Dans cet article, nous utilisons comme r&#233;f&#233;rence le Lefff (Sagot, 2010) et l&#8217;ensemble des mentions
d&#8217;entit&#233;s nomm&#233;es r&#233;pertori&#233;es dans la base Aleda (Sagot et Stern, 2012) 2.
</p>
<p>M&#234;me en se restreignant au niveau morphologique (o&#249; une entr&#233;e, ou lemme, peut &#234;tre r&#233;duite &#224;
une forme de citation, une cat&#233;gorie et une classe flexionnelle), construire automatiquement de
nouvelles entr&#233;es lexicales candidates n&#8217;est pas une t&#226;che simple. Outre la non-correspondance
syst&#233;matique entre tokens et formes, traiter des tokens inconnus est rendu complexe par leur
grande variabilit&#233;, comme d&#233;crit par de nombreux auteurs. Adaptant ainsi la typologie des
inconnus propos&#233;e par Blancafort San Jos&#233; et al. (2010), nous pouvons distinguer :
&#8211; les tokens invalides, induits notamment par des erreurs de tokenisation ;
&#8211; les inconnus orthographiques, produits de fa&#231;on consciente (&#233;conomie scripturale), par
erreur (mauvaise connaissance de l&#8217;orthographe), ou en raison d&#8217;instabilit&#233;s orthographiques
(notamment pour les emprunts, les constructions pr&#233;fixales ou les associations : co-fondateur,
coproducteur, microalgues, micro-ondes, &#233;lectro-m&#233;canique, &#233;lectroenc&#233;phalogramme) ;
</p>
<p>&#8211; les inconnus typographiques (absence de tirets ou de blancs typographiques obligatoires) ;
&#8211; les nombres, sigles et autres unit&#233;s de ce type (A380, L-334-1) ;
&#8211; les emprunts non-adapt&#233;s, qui ne sont pas encore rentr&#233;s dans le syst&#232;me morphologique de
la langue et ne disposent pas encore de paradigmes morphologiques complets
</p>
<p>&#8211; les inconnus lexicaux, formes correctes absentes des ressources de r&#233;f&#233;rence (emprunts
adapt&#233;s, cr&#233;ations lexicales, entit&#233;s nomm&#233;es nouvelles ou rares, mentions inconnues d&#8217;entit&#233;s
connues, etc.) ; parmi eux, il convient de distinguer les mentions d&#8217;entit&#233;s nomm&#233;es d&#8217;une part
et le reste d&#8217;autre part, que nous qualifierons de n&#233;ologismes dans la suite de cet article 3.
</p>
<p>En fonction de leur nature, les n&#233;ologismes peuvent &#234;tre consid&#233;r&#233;s comme analysables (au moins
une partie de l&#8217;inconnu est reconnaissable &#224; travers sa morphologie) ou non analysables (leur
forme n&#8217;est pas reconnaissable &#224; travers leur morphologie ou leur orthographe). Dans les faits,
presque tous les n&#233;ologismes devraient pouvoir &#234;tre analysables hors contexte, en s&#8217;appuyant sur
des dictionnaires, ou en contexte, en s&#8217;appuyant sur les d&#233;pendances syntaxiques auxquelles il
prend part (Han et Baldwin, 2011).
</p>
<p>En TAL, les n&#233;ologismes analysables hors-contexte &#224; travers leur morphologie peuvent &#234;tre trait&#233;s
&#224; partir d&#8217;algorithmes de racinisation (Lovins, 1968). Ceci permet de rattacher un n&#233;ologisme &#224;
d&#8217;autres unit&#233;s lexicales connues des ressources de r&#233;f&#233;rence (par exemple, zippable &#224; zipper). Il
</p>
<p>1. Un token est d&#233;fini comme une unit&#233; typographique constitu&#233;e d&#8217;un caract&#232;re de ponctuation ou d&#8217;une s&#233;quence
d&#8217;au moins un caract&#232;re ne comportant pas d&#8217;espace et d&#233;limit&#233;e par des espaces et/ou des caract&#232;res de ponctuation.
</p>
<p>2. Dans ce travail, nous laissons de c&#244;t&#233; les inconnus contextuels, c&#8217;est-&#224;-dire les tokens qui ne sont connus de la
r&#233;f&#233;rence que comme composants de compos&#233;s mais qui apparaissent dans d&#8217;autres contextes que ces compos&#233;s (par
exemple, instar si on le trouvait ailleurs que dans le compos&#233; &#224; l&#8217;instar de/du.
</p>
<p>3. Nous consid&#233;rons donc comme &#233;tant un n&#233;ologisme toute unit&#233; lexicale valide qui est nouvelle par rapport aux
lexiques de r&#233;f&#233;rence, et non, comme c&#8217;est souvent le cas, par rapport &#224; un usage suppos&#233; connu et v&#233;rifiable. Puisqu&#8217;il
ne s&#8217;agit pas d&#8217;inconnus, nous ne traitons pas non plus des cas o&#249; une forme graphique connue est employ&#233;e avec une
cat&#233;gorie inconnue du lexique (conversion) ou avec un sens nouveau (n&#233;ologie s&#233;mantique).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>408 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>est &#233;galement possible de d&#233;duire les cat&#233;gories morphosyntaxiques des n&#233;ologismes &#224; partir
de propri&#233;t&#233;s de ses affixes morphologiques, si l&#8217;on parvient &#224; les identifier. Dans le cas de
zippable, par exemple, le suffixe &#8211;able est un bon indicateur de la cat&#233;gorie adjectif et de
la classe flexionnelle marquant le pluriel par un suffixe &#8211;s. Enfin, le lemme d&#8217;un n&#233;ologisme
peut &#234;tre obtenu par analogie avec les entr&#233;es de la r&#233;f&#233;rence, par consultation de ressources
compl&#233;mentaires, ou &#224; l&#8217;aide de lemmatiseurs (Schmid, 1994; Chrupa&#322;a et al., 2008).
</p>
<p>Ces m&#233;thodes d&#8217;identification et d&#8217;analyse peuvent &#234;tre combin&#233;es &#224; d&#8217;autres syst&#232;mes de filtrage
ou de traitement qui prennent en compte ou non le contexte. En linguistique de corpus, il s&#8217;agit
g&#233;n&#233;ralement de descriptions formalis&#233;es sous forme de dictionnaires, et de transducteurs &#224;
&#233;tats finis (Maurel et Piton, 1998; Dister et Fairon, 2004). Ces formalismes sont plus ou moins
puissants en fonction de l&#8217;organisation des transducteurs, des types de dictionnaires associ&#233;s et
de la vari&#233;t&#233; des traits qu&#8217;il est possible d&#8217;utiliser &#224; travers eux.
</p>
<p>Mais de telles approches supposent que l&#8217;on ait su identifier les n&#233;ologismes parmi l&#8217;ensemble
des inconnus. Si dans certains cas il s&#8217;agit d&#8217;une t&#226;che ais&#233;e (sigles, nombres), distinguer un
n&#233;ologisme d&#8217;un inconnu orthographique ou d&#8217;un emprunt non-adapt&#233; est moins imm&#233;diat. Dans
cet article, notre objectif est triple : (1) mettre en &#233;vidence les ph&#233;nom&#232;nes constructionnels
dont proc&#232;dent les n&#233;ologismes, (2) montrer qu&#8217;il est possible d&#8217;identifier et d&#8217;analyser automati-
quement ces n&#233;ologismes, et (3) &#233;tendre ainsi automatiquement le lexique morphologique de
r&#233;f&#233;rence, ici le Lefff .
</p>
<p>Nous pr&#233;sentons en partie 2 l&#8217;architecture que nous adoptons pour &#233;tudier les tokens inconnus.
Parmi ces derniers, la partie 3 &#233;tudie les m&#233;canismes morphologiques de construction des
n&#233;ologismes que nous relevons. Nous d&#233;crivons en partie 4, apr&#232;s un &#233;tat de l&#8217;art, les modules
TAL qui nous permettent de traiter ces &#233;l&#233;ments. Enfin, nous conduisons une &#233;valuation dont les
r&#233;sultats sont pr&#233;sent&#233;s en partie 5.
</p>
<p>2 Traitement des inconnus dans le corpus
</p>
<p>2.1 Architecture d&#8217;identification et d&#8217;analyse des inconnus
</p>
<p>Traiter automatiquement les tokens inconnus afin d&#8217;enrichir le lexique n&#233;cessite au pr&#233;alable la
mise en place d&#8217;une architecture logicielle robuste. La figure 1 pr&#233;sente l&#8217;organisation g&#233;n&#233;rale
des traitements utilis&#233;s et, pour certains, d&#233;velopp&#233;s sp&#233;cifiquement au sein de la cha&#238;ne de
traitement SxPipe (Sagot et Boullier, 2008). Nous r&#233;alisons en pr&#233;liminaire une &#233;tape de filtrage
(Filtres), que nous &#233;voquerons &#224; la section suivante lors de la description du corpus.
</p>
<p>Nous appliquons ensuite certains modules de pr&#233;traitement de SxPipe 4 (Sagot et Boullier, 2008).
Nous nous restreignons ici &#224; la tokenisation du texte, &#224; la d&#233;tection de motifs par automates
(nombres, dates, sigles) et &#224; la reconnaissance d&#8217;entit&#233;s nomm&#233;es &#224; l&#8217;aide de la base Aleda (Sagot
et Stern, 2012) et de quelques motifs contextuels. Nous obtenons finalement des treillis de formes
&#224; partir desquels les modules impl&#233;ment&#233;s pour le traitement des inconnus peuvent op&#233;rer. On
peut noter que les ambigu&#239;t&#233;s d&#8217;analyse ainsi cr&#233;&#233;es ne concernent jamais les tokens inconnus
qui font l&#8217;objet des traitements ult&#233;rieurs.
</p>
<p>4. Parmi les options disponibles, nous d&#233;sactivons celles qui cherchent &#224; corriger les fautes d&#8217;orthographe ou qui
d&#233;composent la reconnaissance des tokens (par d&#233;rivation ou par composition).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>409 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Corpus
</p>
<p>Filtres
</p>
<p>SxPipe-pre
</p>
<p>Inconnus
</p>
<p>Emprunts
</p>
<p>Lexiques
</p>
<p>- Wikipedia
</p>
<p>- Morphalou
</p>
<p>- Prolex
</p>
<p>D&#233;rivation
</p>
<p>- analogie
</p>
<p>- motifs
</p>
<p>Composition
</p>
<p>- semi-soud&#233;es
</p>
<p>- alt&#233;r&#233;es
</p>
<p>Analyses et proposition d&#8217;entr&#233;es lexicales
</p>
<p>FIGURE 1 &#8211; Cha&#238;ne de traitement des inconnus
</p>
<p>Le module Inconnus identifie les tokens inconnus et les &#233;tiquette comme tels. Comme nous
l&#8217;avons &#233;voqu&#233;, ces derniers peuvent relever de nombreuses cat&#233;gories. Le module Emprunts (Ba-
ranes, 2012) permet d&#8217;&#233;carter les tokens emprunt&#233;s &#224; l&#8217;anglais non-adapt&#233;s 5. Parmi les inconnus
restants, nous cherchons &#224; rep&#233;rer les formes qui auraient int&#233;r&#234;t &#224; &#234;tre ajout&#233;es au lexique, soit
parce que ce dernier n&#8217;est pas suffisamment complet (Lexiques), soit parce que ce sont des
cr&#233;ations lexicales (en particulier ceux cr&#233;&#233;s par D&#233;rivation, ou par Composition).
</p>
<p>2.2 Donn&#233;es : le flux de d&#233;p&#234;ches AFP
</p>
<p>Nous conduisons nos &#233;tudes, exp&#233;riences et &#233;valuations sur un volumineux corpus de d&#233;p&#234;ches
AFP (francophones), collect&#233;es entre 2007 et 2013. Nous en s&#233;lectionnons trois sous-parties
afin de mener nos exp&#233;riences : des d&#233;p&#234;ches entre le 24 juin et le 3 juillet 2009 (AFP-annot),
l&#8217;int&#233;gralit&#233; des d&#233;p&#234;ches de l&#8217;ann&#233;e 2009 (AFP-2009) et 200 d&#233;p&#234;ches tir&#233;es au hasard entre le
1er et le 14 janvier 2013 (AFP-eval). L&#8217;op&#233;ration de filtrage consiste &#224; &#233;carter les &#233;nonc&#233;s ne
comportant pas assez de caract&#232;res en minuscules ou pas assez de mots. Cela permet d&#8217;&#233;liminer
les tableaux de r&#233;sultats sportifs, sommaires, agendas, signatures et autres &#233;l&#233;ments qui ne sont
pas &#224; proprement parler du contenu linguistique.
</p>
<p>Le tableau 1 donne les caract&#233;ristiques g&#233;n&#233;rales de ces corpus. On peut constater que les
occurrences d&#8217;inconnus sont d&#8217;autant plus redondantes que le sous-corpus est grand. Les corpus
AFP-annot et AFP-2009 sont utilis&#233;s &#224; fins d&#8217;&#233;tudes. En particulier, AFP-annot est annot&#233;
manuellement en inconnus selon la classification de Blancafort San Jos&#233; et al. (2010) 6. Nous
&#233;cartons certaines classes d&#8217;inconnus de cette &#233;tude (mots commen&#231;ant par des chiffres ou des
majuscules) afin de se focaliser sur les cr&#233;ations lexicales. Le tableau 2 indique la r&#233;partition des
inconnus selon ces classes. Nous y v&#233;rifions l&#8217;importance du ph&#233;nom&#232;ne de cr&#233;ations lexicales,
que nous assimilons aux n&#233;ologismes et sur laquelle nous concentrons nos efforts.
</p>
<p>La figure 2 nous renseigne sur l&#8217;&#233;volution des inconnus distincts (rep&#233;r&#233;s par la cha&#238;ne de
</p>
<p>5. Des n&#233;ologismes emprunt&#233;s &#224; des formes anglophones peuvent alors ne pas &#234;tre rep&#233;r&#233;s (cardio-training, box-office,
etc.), mais ces erreurs repr&#233;sentent moins de 1% des tokens inconnus.
</p>
<p>6. Le travail d&#8217;annotation manuelle a &#233;t&#233; r&#233;alis&#233; sous la responsabilit&#233; et avec les outils de l&#8217;entreprise Syllabs, dans le
cadre du projet ANR EDyLex.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>410 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Corpus D&#233;p&#234;ches Tokens Inconnus Distincts
AFP-annot 2 535 1 060 378 6 208 2 782
AFP-2009 311 981 94 967 771 907 570 107 496
AFP-eval 200 73 353 729 489
</p>
<p>TABLE 1 &#8211; Volumes
</p>
<p>2009-01
</p>
<p>2009-03
</p>
<p>2009-05
</p>
<p>2009-07
</p>
<p>2009-09
</p>
<p>2009-11
</p>
<p>0
</p>
<p>2 &#183; 10&#8722;3
</p>
<p>4 &#183; 10&#8722;3
</p>
<p>Fr
&#233;q
</p>
<p>ue
nc
</p>
<p>e
re
</p>
<p>la
tiv
</p>
<p>e
</p>
<p>Inconnus Nouveaux Anciens Intersection
</p>
<p>FIGURE 2 &#8211; Temporalit&#233;s des inconnus distincts
</p>
<p>Type Inconnus Distincts
Cr&#233;ations lexicales 3556 1301
</p>
<p>Erreurs typographiques 902 622
Formes lexicalis&#233;es 531 272
Emprunts adapt&#233;s 480 174
Forme avec clitique 302 222
Entit&#233;s nomm&#233;es 227 114
Mots &#233;trangers 177 108
</p>
<p>Formes non-autonomes 141 43
Variantes graphiques 55 27
</p>
<p>Tokens alphanum&#233;riques 42 18
Inclassables 10 7
</p>
<p>TABLE 2 &#8211; Inconnus de AFP-annot
</p>
<p>traitement) par mois au sein du corpus AFP-2009 en fr&#233;quence relative 7. Au fil de l&#8217;ann&#233;e,
les accumuler permet d&#8217;indiquer pour chaque mois le nombre de nouveaux inconnus &#224; traiter
(Nouveaux), et leur intersection depuis le d&#233;but de l&#8217;ann&#233;e (Intersection). Malgr&#233; les volumes de
donn&#233;es que nous manipulons, il semble que le nombre de nouveaux inconnus apparaissant tous
les mois diminue relativement peu. Cette apparition continuelle de nouvelles entr&#233;es, dans un
corpus aussi contr&#244;l&#233; que des d&#233;p&#234;ches AFP, nous confirme la n&#233;cessit&#233; de mettre en place des
m&#233;canismes dynamiques pour traiter ces &#233;l&#233;ments.
</p>
<p>3 Analyse linguistique des n&#233;ologismes
</p>
<p>Il existe de nombreuses formes de n&#233;ologismes qui ne sont pas toutes aussi faciles &#224; identifier
comme telles. Sablayrolles (1997) recense une centaine de typologies plus ou moins profondes
des n&#233;ologismes. Sablayrolles et al. (2011) proposent un classement g&#233;n&#233;ral des n&#233;ologismes
en trois classes qui correspondent aux ph&#233;nom&#232;nes de glissement de sens, aux ph&#233;nom&#232;nes
d&#8217;affixation et de composition ainsi qu&#8217;aux ph&#233;nom&#232;nes d&#8217;&#233;conomie du langage. Il propose
&#233;galement un classement plus fins en 24 classes.
</p>
<p>De nombreux travaux ont permis d&#8217;&#233;laborer des outils afin d&#8217;&#233;tudier et de d&#233;crire la n&#233;ologie.
Le logiciel SEXTAN (Cabr&#233; et al., 2003) permet d&#8217;identifier automatiquement les inconnus et de
les pr&#233;senter &#224; un lexicographe. Le laboratoire LDI dispose d&#8217;une plateforme de traitement des
n&#233;ologismes, NEOLOGIA (Cartier, 2011), qui permet de collecter et rechercher des n&#233;ologismes
dans la base de donn&#233;es, d&#8217;en observer l&#8217;&#233;volution (depuis l&#8217;&#233;tat n&#233;ologique jusqu&#8217;&#224; celui de mot
int&#233;gr&#233; dans les dictionnaires) et, dans certains cas, la disparition.
</p>
<p>Les n&#233;ologismes issus d&#8217;emprunts sont &#233;tudi&#233;s depuis une quarantaine d&#8217;ann&#233;es, notamment &#224;
travers les travaux de L. Guilbert dans les ann&#233;es 70 puis J. Rey-Debove et M. Yaguello dans
les ann&#233;es 80. Aujourd&#8217;hui, de nombreuses recherches s&#8217;int&#233;ressent plus particuli&#232;rement &#224;
l&#8217;adaptation des formes emprunt&#233;es (Anastassiadis-Sym&#233;onidis et Nikolaou, 2011). Walther et
</p>
<p>7. La fr&#233;quence est rapport&#233;e aux nombre de tokens par mois.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>411 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sagot (2011) abordent ainsi la question de l&#8217;adaptation de verbes n&#233;ologiques issus de l&#8217;anglais.
</p>
<p>Dans le cadre de la d&#233;finition des n&#233;ologismes donn&#233;e plus haut, nous nous int&#233;ressons dans
cette partie aux inconnus morphologiquement analysables, et notamment aux cr&#233;ations lexicales
form&#233;es par d&#233;rivation ou par composition (et &#233;ventuellement alt&#233;ration) de mots connus.
</p>
<p>3.1 M&#233;canismes de cr&#233;ation lexicale
</p>
<p>3.1.1 Formes cr&#233;&#233;es par d&#233;rivation
</p>
<p>Par d&#233;rivation nous faisons r&#233;f&#233;rence aux ph&#233;nom&#232;nes d&#8217;affixation. L&#8217;affixation correspond &#224;
l&#8217;ajout de morph&#232;mes &#224; gauche (pr&#233;fixation) ou &#224; droite (suffixation) d&#8217;un mot connu. Ces
m&#233;canismes permettent la construction de n&#233;ologismes dont la signification est, g&#233;n&#233;ralement,
imm&#233;diatement compr&#233;hensible. En cas de suffixation, la cat&#233;gorie peut &#234;tre modifi&#233;e (&#233;norme
&#8594; &#233;normitude) 8. Nous classons parmi les pr&#233;fixes, les formes &#171; e &#187;, &#171; i &#187;, &#171; web &#187; et &#171; cyber &#187;.
Notons que ces derni&#232;res sont parfois d&#233;crites, selon les auteurs comme &#171; combining forms &#187;
(Ahronian et B&#233;joint, 2008) ou formes hybrides (Sablayrolles et al., 2011).
</p>
<p>Nb. d&#8217;occ. (+tiret) Nb. de formes distinctes Exemples
</p>
<p>Pr&#233;fixes
anti(-) 3371(+5986) 171 (+435) anticrise anti-fraude
co(-) 892 (+2809) 54 (+183) corapporteur co-skippeurs
re(-) 2424 (+36) 128 (+14) rescolaris&#233;s remariage
</p>
<p>Suffixes
</p>
<p>isation(s) 1992 110 talibanisation masterisation
iste(s) 3265 223 jihadiste lefebvristes
eur(s) 10192 353 skippeurs performeur
</p>
<p>naute(s) 35 7 nutrinaute mobinautes
itude(s) 19 4 bravitude merditude
</p>
<p>TABLE 3 &#8211; Affixes les plus fr&#233;quents dans les d&#233;p&#234;ches AFP
</p>
<p>La table 3 donne, pour quelques exemples, les occurrences que nous relevons dans le corpus
AFP-2009. L&#8217;&#233;tude syst&#233;matique de pr&#233;fixes et de suffixes nous permet d&#8217;en constituer une liste
utilis&#233;e comme motifs pour l&#8217;analyses des n&#233;ologismes.
</p>
<p>3.1.2 Formes cr&#233;&#233;es par composition
</p>
<p>Comme nous le verrons en section 4, les m&#233;canismes de composition repr&#233;sentent une part
importante de n&#233;ologismes que nous rep&#233;rons. Tout d&#8217;abord, un compos&#233; peut &#234;tre simplement
cr&#233;&#233; par association de constituants. Dans ce cas, les mots sont concat&#233;n&#233;s (g&#233;n&#233;ralement par
trait d&#8217;union) afin de n&#8217;en former plus qu&#8217;un. Nous relevons en particulier : (i) les compositions
ADJ+N, N+ADJ et ADJ+ADJ = ADJ ou N, (ii) les compositions N+N = N, (iii) les compositions
V+N = N. Certains adjectifs sont tr&#232;s productifs pour composer les formes comme en (i). C&#8217;est le
cas par exemple des adjectifs super (ex. super-h&#233;ros) ou mini (ex. mini-cha&#238;ne). Les compositions
&#224; partir de noms communs (ii) permettent de g&#233;n&#233;rer d&#8217;autres noms compos&#233;s. Les compositions
issues de verbes et de noms communs (iii) permettent de cr&#233;er des noms communs qui font
</p>
<p>8. Certains mots suffix&#233;s peuvent &#233;galement &#234;tre class&#233;s dans les constructions par apocopes qui eux-m&#234;mes peuvent
&#234;tre associ&#233;s &#224; des mots-valises.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>412 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>r&#233;f&#233;rence, par exemple (Villoing, 2003) &#224; des instruments (ouvre-lettre), des lieux (coupe-gorge),
des agents (gratte-papier), des proc&#232;s (l&#232;che-vitrine), etc.
</p>
<p>Dans les compos&#233;s cr&#233;&#233;s &#224; partir de deux adjectifs ou plus (chiraco-villepinistes), les premiers
composants manifestent la perte de leur autonomie au profit du dernier adjectif par un m&#233;canisme
d&#8217;alt&#233;ration en &#8211;o. Ce m&#233;canisme permet notamment la construction de termes dans des domaines
de sp&#233;cialit&#233;s (socialo-communiste), ou d&#8217;adjectifs form&#233;s avec des gentil&#233;s (franco-allemand).
</p>
<p>On peut enfin relever le cas particulier des compositions dans lesquelles le premier adjectif est
en r&#233;alit&#233; une base latine ou grecque munie de ce morphe &#8211;o 9. Ces compos&#233;s sont souvent des
termes savants du domaine m&#233;dical (cardio-vasculaire).
</p>
<p>Cr&#233;ations lexicales Nb d&#8217;occ. Formes distinctes Exemples
compos&#233; d&#8217;un gentil&#233; 7797 616 am&#233;ricano-taiwanais
</p>
<p>par association avec alt&#233;ration autres 2956 239 politico-judiciaire
total 10753 855 chiraco-villepinistes
</p>
<p>par association sans alt&#233;ration &#8211; 284 109 satiristes-pol&#233;mistes
</p>
<p>TABLE 4 &#8211; Formes inconnues cr&#233;&#233;es par association dans les d&#233;p&#234;ches AFP
</p>
<p>Le tableau 4, qui r&#233;sume les &#233;tudes sur corpus sur la composition, montre la forte productivit&#233;
des compos&#233;s, notamment des formes en &#8211;o , qui demandent un traitement sp&#233;cifique.
</p>
<p>4 Analyse morphologique automatique des n&#233;ologismes
</p>
<p>4.1 &#201;tat de l&#8217;art
</p>
<p>Plusieurs approches peuvent permettre d&#8217;analyser les n&#233;ologismes par d&#233;rivation ou par compo-
sition. Nous nous appuyons sur les travaux en morphologie qui s&#8217;int&#233;ressent au regroupement
de mots en familles morphologiques 10. C&#8217;est le cas de Bernhard (2010) qui a mis en place deux
syst&#232;mes d&#8217;apprentissage non supervis&#233;s (MorphoClust et MorphoNet) ou de Hathout (2010)
dont le syst&#232;me (Morphonette) m&#234;le analogie et informations s&#233;mantiques. Dans certains cas, les
travaux portent sur la pr&#233;diction de formes potentielles de la langue (Neuvel et Fulop, 2002) ou
afin de compl&#233;ter un quadruplet d&#8217;analogie (Lepage, 1998).
</p>
<p>La plupart des syst&#232;mes d&#233;crits dans la litt&#233;rature mettent l&#8217;accent sur l&#8217;analyse de la construction
d&#8217;un mot. Le syst&#232;me &#224; base de r&#232;gles (cr&#233;&#233;es manuellement) D&#233;rif (Hathout et Namer, 2011)
d&#233;termine les &#233;l&#233;ments &#224; partir desquels sont construits des unit&#233;s lexicales, par d&#233;rivation ou
par composition. D&#8217;autres syst&#232;mes r&#233;alisent cette t&#226;che de mani&#232;re non supervis&#233;e, par exemple
par analogie formelle (Lavall&#233;e et Langlais, 2011) ou par segmentation (Goldsmith, 2001; Creutz
et Lagus, 2005). En ce qui concerne les m&#233;canismes compositionnels, si Mathieu-Colas (2010)
se penche sur la cr&#233;ation lexicale par trait d&#8217;union, nous n&#8217;avons pas connaissance de syst&#232;mes
impl&#233;ment&#233;s sp&#233;cifiquement &#224; leur sujet.
</p>
<p>Certains travaux montrent qu&#8217;il est possible d&#8217;ajouter &#224; l&#8217;analyse de la construction d&#8217;un mot
la pr&#233;diction de son lemme et de ses traits morphologiques en s&#8217;appuyant sur un syst&#232;me
</p>
<p>9. Ces &#171; compositions n&#233;oclassiques &#187; existent en fran&#231;ais mais ne correspondent plus aux formes d&#8217;origines.
10. Une famille morphologique est compos&#233;e de mots partageant une base lexicale commune (&#233;crit, &#233;crire, &#233;crivain,...).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>413 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>d&#8217;apprentissage supervis&#233; coupl&#233; &#224; de l&#8217;analogie (Stroppa et Yvon, 2006). Disposer de ces
informations suppl&#233;mentaires ont, par exemple, permis &#224; Dal et Namer (2000) (avec G&#233;D&#233;Rif),
ainsi qu&#8217;&#224; (Tanguy et Hathout, 2002) (avec Webaffix), de proposer un syst&#232;me qui, pour chaque
forme nouvelle, calcule ses d&#233;riv&#233;s et v&#233;rifie leur validit&#233; sur internet.
</p>
<p>Cependant, mis &#224; part Mikheev (1997), peu de travaux &#233;tudient sp&#233;cifiquement l&#8217;&#233;laboration et
l&#8217;&#233;valuation de syst&#232;mes de compl&#233;tion d&#8217;un lexique. Dans notre travail, nous mettons en place
des outils destin&#233;s &#224; traiter des documents susceptibles de contenir de nombreux n&#233;ologismes, tels
que d&#233;finis en introduction. Il nous faut donc distinguer ces derniers parmi les tokens inconnus,
d&#233;terminer et &#233;valuer les m&#233;canismes qui permettent de les analyser automatiquement.
</p>
<p>4.2 Recherche dans des lexiques externes
</p>
<p>Les notions d&#8217;inconnu et de n&#233;ologisme &#233;tant d&#233;finies ici par rapport &#224; un lexique de r&#233;f&#233;rence,
le Lefff , la fa&#231;on la plus simple de les traiter consiste &#224; les rechercher dans d&#8217;autres ressources
lexicales librement disponibles. Nous avons fait appel au Wiktionnaire (fr.wiktionary.com/),
dictionnaire collaboratif, &#224; Morphalou (Romary et al., 2004), lexique morphologique extrait du
TLFi, et &#224; ProLexBase (Maurel, 2008), base de noms propres incluant de nombreux gentil&#233;s.
</p>
<p>Toutefois, l&#8217;enrichissement du Lefff avec des entr&#233;es lexicales manquantes extraites de ces res-
sources n&#233;cessite de rendre ces derni&#232;res compatibles avec le Lefff , en les transformant en un
inventaire d&#8217;entr&#233;es lexicales associant une forme de citation &#224; une des classes flexionnelles du
Lefff . Pour chacune de ces trois ressources, nous avons donc construit des outils de conversion
automatique vers le formalisme Alexina, puis avons projet&#233; les classes flexionnelles obtenues vers
celles utilis&#233;es par le Lefff . Ce processus, bien que n&#233;cessairement imparfait, a permis de d&#233;tecter
des erreurs dans les trois ressources d&#8217;origine 11. Le Wiktionnaire, Morphalou et ProLexBase ont
&#233;t&#233; ainsi transform&#233;s en des lexiques Alexina de m&#234;me grammaire morphologique que le Lefff et
comprenant respectivement environ 1 million, 400 000 et 125 000 entr&#233;es produisant au total
1 100 000 formes fl&#233;chies distinctes, parmi lesquelles 700 000 ne sont pas couvertes par le Lefff .
</p>
<p>Ainsi, un module d&#233;di&#233; recherche les n&#233;ologismes dans ces ressources, et propose autant d&#8217;ana-
lyses qu&#8217;il y trouve d&#8217;entr&#233;es. Au sein du corpus AFP-2009, 18,6% des inconnus analys&#233;s distincts
le sont gr&#226;ce &#224; ce module, parmi lesquels 71,5% sont trouv&#233;s dans le Wiktionnaire, 32,0% dans
Morphalou et 14,9% dans ProLexBase (une entr&#233;e pouvant se trouver dans plusieurs lexiques en
m&#234;me temps). Notons que, m&#234;me s&#8217;ils ne sont pas utilis&#233;s par les modules pr&#233;sent&#233;s ci-apr&#232;s, ces
lexiques sont disponibles pour l&#8217;ensemble de la cha&#238;ne de traitement SxPipe.
</p>
<p>4.3 N&#233;ologismes construits par d&#233;rivation
</p>
<p>4.3.1 Analyse par analogie
</p>
<p>Comme indiqu&#233; en partie 3.1, nous analysons les n&#233;ologismes construits par d&#233;rivation comme
l&#8217;application de r&#232;gles d&#8217;affixation sur une entr&#233;e existante du Lefff (ex : divulgable&#8211;divulgation) 12.
</p>
<p>11. Par exemple parce qu&#8217;une entr&#233;e lexicale se retrouve &#224; associer une forme de citation avec une classe flexionnelle
que la grammaire morphologique du Lefff consid&#232;re comme incompatible
12. Le Lefff ne comportant pas de noms propres, notre cha&#238;ne ne permet pas l&#8217;analyse de d&#233;riv&#233;s dont la base est un
</p>
<p>nom propre, tels que zlataner ou sarkozysme.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>414 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le module d&#233;crit ici s&#8217;inspire de travaux sur l&#8217;analogie appliqu&#233;e &#224; la morphologie. Cette notion,
d&#233;crite dans les travaux cit&#233;s en section 4.1, permet d&#8217;&#233;tablir un rapport entre deux paires
d&#8217;&#233;l&#233;ments : x est &#224; y ce que z est &#224; t, not&#233; x : y :: z : t. Pour la n&#233;ologie, nous recherchons des
r&#232;gles d&#8217;affixation communes &#224; des paires d&#8217;entr&#233;es du Lefff , qui nous permettent de d&#233;duire
des informations pour des n&#233;ologismes donn&#233;s. Dans le cas de divulgable, nous pouvons d&#233;duire
qu&#8217;il s&#8217;agit d&#8217;un d&#233;riv&#233; si nous trouvons conjointement (i) divulgation dans le Lefff et (ii) une
r&#232;gle de substitution du suffixe &#8211;able en &#8211;ation (extraite d&#8217;entr&#233;es du Lefff comme acceptable-
acceptation). Ce type d&#8217;analyse n&#233;cessite donc un apprentissage des r&#232;gles morphologiques. Le
n&#244;tre, faiblement supervis&#233;, se fait en trois &#233;tapes :
</p>
<p>1. Nous apprenons les r&#232;gles de construction &#224; partir des formes fl&#233;chies du Lefff en &#233;tudiant
tous les couples (forme de citation, forme fl&#233;chie &#8212; reli&#233;e ou non &#224; la forme de citation &#8212;)
qui ont une partie commune d&#8217;au moins 5 caract&#232;res et qui ne diff&#232;rent que par un suffixe
ou par un pr&#233;fixe (en s&#233;lectionnant les r&#232;gles de fr&#233;quence &#8805; 40).
</p>
<p>2. Les r&#232;gles sont utilis&#233;es pour grouper les entr&#233;es du Lefff (suppos&#233;es partager une m&#234;me
base lexicale) afin de constituer des paires de formes accompagn&#233;es de r&#232;gles de transfor-
mation pour passer de l&#8217;une &#224; l&#8217;autre.
</p>
<p>3. Cette seconde &#233;tape permet d&#8217;&#233;tablir des paires de formes x , y (forme de citation, forme
fl&#233;chie reli&#233;e par flexion ou d&#233;rivation), qui vont nous servir &#224; construire des relations
analogiques impliquant un inconnu t, relations de la forme x : y :: t : z. Pour ce faire,
nous rempla&#231;ons chaque paire de formes par une r&#232;gle de r&#233;&#233;criture reliant un couple
pr&#233;fixe/suffixe d&#8217;input &#224; un couple pr&#233;fixe/suffixe d&#8217;output, ce qui permet de traiter les
pr&#233;fixations, les suffixations, et les d&#233;riv&#233;s parasynth&#233;tiques (cf. table 5). Chacune de
ces r&#232;gles indique la cat&#233;gorie et les traits morphologiques (genre, nombre) obtenus.
De surcro&#238;t, en &#233;tudiant les couples de mots leur donnant naissance, nous cat&#233;gorisons
chaque r&#232;gle comme flexionnelle ou d&#233;rivationnelle. Nous ne conservons que les r&#232;gles
morphologiques qui ont plus de 80 occurrences (32 508 r&#232;gles distinctes) dont quelques
exemples sont montr&#233;s en table 5.
</p>
<p>Cat. Pr&#233;fixe Suffixe Occ Type Exemple
adj_Kfp&#8594; v_W _ &#233;es&#8594; er 6483 D&#233;rivation donn&#233;es&#8594; donner
v_I12s&#8594; nc_fs _&#8594; d&#233; is&#8594; tion 116 D&#233;rivation valorisais&#8594; d&#233;valorisation
v_P2p&#8594; v_W _ z&#8594; r 7074 Flexion dansez&#8594; danser
</p>
<p>TABLE 5 &#8211; Exemples de r&#232;gles affixales apprises
</p>
<p>Nous sommes ainsi en mesure de d&#233;terminer si un inconnu, analysable par ces r&#232;gles, est une
cr&#233;ation lexicale. En effet, si nous parvenons &#224; le relier ainsi &#224; une entr&#233;e du Lefff gr&#226;ce &#224; une
r&#232;gle d&#233;rivationnelle 13. Le lemme (forme de citation + classe flexionnelle) est obtenu en appli-
quant l&#8217;outil int&#233;gr&#233; au Lefff permettant de calculer pour un triplet (forme, cat&#233;gorie, &#233;tiquette
morphologique) l&#8217;ensemble des lemmes morphologiquement compatibles avec la grammaire
morphologique du Lefff d&#8217;une part et avec le triplet d&#8217;autre part. L&#8217;application, en parall&#232;le, de
l&#8217;&#233;tiqueteur morphosyntaxique MElt (Denis et Sagot, 2012) permet alors de ne conserver que
les lemmes dont la cat&#233;gorie est la m&#234;me que celle propos&#233;e par MElt pour l&#8217;inconnu (s&#8217;il y en
a plusieurs, on choisit le mieux pond&#233;r&#233;, s&#8217;il n&#8217;y en a aucun, on d&#233;clare l&#8217;inconnu inanalysable
par ce module). La sortie de notre module, pr&#233;sent&#233;e en table 6 nous permet de proposer de
</p>
<p>13. Si la r&#232;gle est flexionnelle, nous consid&#233;rons qu&#8217;il s&#8217;agit d&#8217;une faute d&#8217;orthographe et non d&#8217;un n&#233;ologisme : le
Lefff &#233;tant suppos&#233; comporter toutes les flexions possibles, le mot est fl&#233;chi selon une classe flexionnelle erron&#233;e (travails
comme pluriel de travail).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>415 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Compos&#233; R&#232;gles appliqu&#233;e Famille morphologique Cat., flexion F. de citation
blablatons -ons&#8594;-age blablatage V_P1p, v-er ; V_Y1p, v-er blablater
d&#233;crocheurs -eurs&#8594;-er, -eurs&#8594;-age d&#233;crocher, d&#233;crochage... NC_mp, nc-2m d&#233;crocheur
</p>
<p>TABLE 6 &#8211; Analyse des d&#233;riv&#233;s
</p>
<p>nouvelles entr&#233;es lexicales et permet d&#8217;analyser 11,9% des inconnus distincts pr&#233;sents dans le
corpus AFP-2009.
</p>
<p>4.3.2 Mise au point de motifs d&#233;di&#233;s
</p>
<p>L&#8217;&#233;tude men&#233;e en section 3.1 nous a permis d&#8217;isoler et de d&#233;crire certains ph&#233;nom&#232;nes de
cr&#233;ation lexicale pour lesquels nous mettons au point des m&#233;canismes d&#8217;analyse d&#233;di&#233;s. En
particulier, parmi les pr&#233;fixes consid&#233;r&#233;s, une proportion importante correspond &#224; un m&#233;canisme
de d&#233;rivation qui ne modifie pas la cat&#233;gorie morphosyntaxique et la classe flexionnelle du lemme
de base. Ainsi, nous mettons en place un module qui, pour un inconnu donn&#233;, recherche un
des pr&#233;fixes standard 14 et v&#233;rifie si le composant &#224; droite (concat&#233;n&#233;, &#233;ventuellement par trait
d&#8217;union) de ce pr&#233;fixe est un mot connu du Lefff . Si tel est le cas, une analyse est propos&#233;e qui
construit le lemme complet &#224; partir de l&#8217;entr&#233;e trouv&#233;e. Dans le corpus AFP-2009, 16,6% des
inconnus analys&#233;s distincts le sont gr&#226;ce &#224; ce module. Un m&#233;canisme similaire est impl&#233;ment&#233;
pour les suffixes iste, isme et isation mais ne traite qu&#8217;un tr&#232;s faible nombre d&#8217;inconnus (0,2%).
</p>
<p>4.4 Analyse des n&#233;ologismes construits par composition
</p>
<p>Afin de traiter les expressions construites par composition, nous nous focalisons en premi&#232;re
approche sur la composition marqu&#233;e par un ou plusieurs tiret(s) &#8216;-&#8217; dont nous cherchons &#224;
d&#233;crire la morphologie. Nous sommes alors en mesure d&#8217;en identifier simplement les composants
et d&#8217;interroger le Lefff pour y rechercher, par ordre de pr&#233;f&#233;rence :
(i) l&#8217;expression dans laquelle les tirets sont remplac&#233;s par un blanc (expression multi-mots),
(ii) chaque composant s&#233;par&#233;ment (composition),
(iii) s&#8217;il n&#8217;y a que deux composants, le dernier composant et les formes de citation ayant un
</p>
<p>pr&#233;fixe commun 15 avec le premier composant (composition avec alt&#233;ration).
Comme l&#8217;&#233;tude linguistique en partie 3.1 l&#8217;a sugg&#233;r&#233;, dans une grande majorit&#233; de cas, le dernier
composant impose sa cat&#233;gorie et sa classe flexionnelle au n&#233;ologisme construit. S&#8217;il y a ambigu&#239;t&#233;,
nous utilisons la cat&#233;gorie propos&#233;e par l&#8217;&#233;tiqueteur morphosyntaxique MElt appliqu&#233; en parall&#232;le,
pour ne conserver que les analyses qui sont compatibles avec cette cat&#233;gorie (contrairement &#224;
la section pr&#233;c&#233;dente, nous conservons ici toutes les analyses produites si MElt n&#8217;en a propos&#233;
aucune compatible avec les entr&#233;es sugg&#233;r&#233;es). Nous conservons ainsi ces informations pour
proposer la cat&#233;gorie et la classe flexionnelle de la nouvelle entr&#233;e lexicale. Enfin, la forme de
citation est construite &#224; partir de tous les composants d&#8217;origine, sauf le dernier qui est remplac&#233;
par la forme de citation de l&#8217;entr&#233;e lexicale du Lefff trouv&#233;.
</p>
<p>14. agri, anti, apr&#232;s, archi, contre, cyber, d&#233;, demi, d&#233;s, e, ex, extra, grand, hyper, im, in, inter, intra, mal, maxi, m&#233;ga,
m&#233;ta, mi, mini, multi, non, outre, para, p&#233;ri, pluri, poly, post, pr&#233;, quart, quasi, re, r&#233;, sans, semi, sous, sub, super, supra,
sur, t&#233;l&#233;, tiers, trans, ultra, uni, vice, co.
15. Ce pr&#233;fixe doit contenir au moins la moiti&#233; du composant.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>416 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Compos&#233; Analyse(s) en composants Cat., flexion Forme de citation
centre-ville (a) centre ville (NC_mp, nc-2m) NC_mp, nc-2m centre ville
d&#233;put&#233;-maire (b) d&#233;put&#233; (NC_ms, nc-4) + maire (NC_ms,nc-4sse) NC_ms,nc-4sse d&#233;put&#233;-maire
lumino-technique (c) lumino(lumineux) (ADJ_s,adj-ique2)
</p>
<p>+ technique (NC_fs,nc-2f)
NC_fs,nc-2f lumino-technique
</p>
<p>TABLE 7 &#8211; Analyse de compos&#233;s
</p>
<p>Nous remarquons qu&#8217;en (iii), l&#8217;analyse peut fournir de nombreuses hypoth&#232;ses distinctes (forme de
citation, cat&#233;gorie, classe flexionnelle), notamment lors de la recherche par pr&#233;fixe commun. Pour
pallier cela, nous ajoutons des contraintes dans ce cas : nous nous restreignons aux expressions
form&#233;e selon le motif &#8211;o qui d&#233;crit correctement, notamment, la composition adjectivale. La
table 7 donne quelques exemples de d&#233;compositions r&#233;alis&#233;es selon ces principes.
</p>
<p>Dans le cas g&#233;n&#233;ral, nous remarquons la difficult&#233; de traiter de telles expressions lorsqu&#8217;ils sont
amalgam&#233;s sans marqueurs de s&#233;paration (ni espace), puisque l&#8217;on tombe dans le cas difficile
des mots compos&#233;s standards (Sag et al., 2002), mais notre &#233;tude sur corpus a montr&#233; que ce
ph&#233;nom&#232;ne &#233;tait marginal.
</p>
<p>Parmi les inconnus distincts trait&#233;s par nos modules, celui-ci en analyse 57,7% dans le corpus
AFP-2009. Ce chiffre important est li&#233; &#224; la productivit&#233; des m&#233;canismes de cr&#233;ation lexicale.
Ceci nous confirme que l&#8217;incompl&#233;tude lexicale rel&#232;ve de m&#233;canismes au-del&#224; de la morphologie
d&#233;rivationnelle et que des moyens peuvent &#234;tre mis en &#339;uvre pour permettre leur analyse.
</p>
<p>5 Construction et &#233;valuation d&#8217;entr&#233;es lexicales n&#233;ologiques
</p>
<p>Tous les modules que nous avons d&#233;crits, lorsqu&#8217;ils parviennent &#224; analyser un inconnu, fournissent
pour chaque &#233;l&#233;ment son lemme, c&#8217;est-&#224;-dire sa forme de citation, sa cat&#233;gorie et sa classe
flexionnelle. En cons&#233;quence, nous sommes en mesure de r&#233;cup&#233;rer les analyses produites afin
de proposer de nouvelles entr&#233;es &#224; ajouter au lexique. L&#8217;ordre de ces modules importe : le
premier qui parvient &#224; analyser un inconnu interrompra le processus d&#8217;analyse. Comme nous le
verrons ci-dessous, la pr&#233;cision des modules d&#8217;analyse nous permet d&#8217;examiner les analyses d&#232;s
la premi&#232;re occurrence.
</p>
<p>Comme indiqu&#233; plus haut, l&#8217;objectif de ce travail est double : construire des entr&#233;es lexicales
flexionnelles &#224; ajouter au Lefff afin d&#8217;en augmenter la couverture sur les d&#233;p&#234;ches AFP de
fa&#231;on dynamique, mais &#233;galement extraire des informations constructionnelles concernant ces
nouvelles entr&#233;es, afin de permettre des traitements ult&#233;rieurs (s&#233;mantique lexicale y compris
pour des applications en TAL, &#233;tude quantitative des m&#233;canismes de cr&#233;ation lexicale, etc.).
Nous avons donc proc&#233;d&#233; &#224; une &#233;valuation en trois &#233;tapes, qui vise &#224; r&#233;pondre aux questions
suivantes pour chaque occurrence d&#8217;inconnu : a-t-elle &#233;t&#233; correctement identifi&#233;e comme &#233;tant ou
n&#8217;&#233;tant pas un n&#233;ologisme ? si oui, l&#8217;entr&#233;e lexicale propos&#233;e est-elle correcte, y compris sa classe
flexionnelle afin de pouvoir produire correctement ses formes fl&#233;chies ? si oui, les informations
constructionnelles associ&#233;es sont-elles correctes ?
</p>
<p>Pour cela, nous traitons les inconnus contenus dans le corpus AFP-eval tel que d&#233;crit en partie
2. Parmi les 489 inconnus distincts, 449 (soit 92%) ont &#233;t&#233; correctement class&#233;s, dont 357 qui
ne sont pas des n&#233;ologismes et 92 n&#233;ologismes. Les 40 inconnus restant (8% du total) ont
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>417 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#233;t&#233; mal class&#233;s, dont 34 n&#233;ologismes : seulement 6 inconnus ont &#233;t&#233; analys&#233;s &#224; tort comme
des n&#233;ologismes (et ont donc donn&#233; lieu &#224; des entr&#233;es lexicales candidates erron&#233;es). Nous
obtenons donc pour la t&#226;che de d&#233;tection des n&#233;ologismes une pr&#233;cision de 94% (92/(92+6)) et
un rappel de 73% (92/(92+34)), et pour la t&#226;che compl&#233;mentaire de d&#233;tection des inconnus
non-n&#233;ologiques une pr&#233;cision de 91% (357/(357+34)) et un rappel de 98% (357/(357+6)).
</p>
<p>Les 98 inconnus d&#233;tect&#233;s comme n&#233;ologismes, y compris les 6 class&#233;s par erreur, ont conduit &#224; la
cr&#233;ation de 93 entr&#233;es lexicales candidates, c&#8217;est-&#224;-dire d&#8217;entr&#233;es (forme de citation, cat&#233;gorie,
classe flexionnelle) qui permettent de construire automatiquement toutes les formes fl&#233;chies
correspondantes. Nous avons &#233;valu&#233; cette liste manuellement avec les r&#233;sultats suivants : 73 sur
93, soit environ 80%, sont totalement correctes, 5 ont la bonne cat&#233;gorie mais pas la bonne classe
flexionnelle (ainsi point-presse, consid&#233;r&#233; comme f&#233;minin et prenant un s au pluriel), 13 n&#8217;ont
pas la bonne cat&#233;gorie (mais souvent les bonnes formes fl&#233;chies, car il s&#8217;agit fr&#233;quemment de
confusions nom/adjectif, par exemple multi-facette), 1 est douteuse et 1 est totalement erron&#233;e
(le verbe multi-voir pour l&#8217;adjectif multi-vues).
</p>
<p>Parmi les 73 entr&#233;es lexicales correctes, 52 ont &#233;t&#233; construites par l&#8217;un de nos modules d&#8217;analyse,
et non au moyen de lexiques externes. Pour ces 52 entr&#233;es nous disposons donc d&#8217;informations
constructionnelles, de nature &#224; permettre le calcul d&#8217;informations suppl&#233;mentaires telles que
la valence ou la s&#233;mantique lexicale 16. Ainsi, ayant correctement analys&#233; co-attribuer comme
issu d&#8217;une d&#233;rivation pr&#233;fixale &#224; partir du verbe attribuer, nous pouvons d&#8217;une part associer
&#224; co-attribuer les m&#234;mes informations de valence que celles dont on peut disposer dans un
lexique comme le Lefff , et d&#8217;autre part savoir que le sens de co-attribuer peut se construire
compositionnellement &#224; partir de celui du pr&#233;fixe co- et de celui d&#8217;attribuer 17. Nous avons &#233;tudi&#233;
manuellement les informations constructionnelles obtenues au cours du processus d&#8217;analyse. Pour
cette &#233;valuation, celles-ci se sont toujours av&#233;r&#233;es correctes. Par exemple, le module d&#8217;analyse des
d&#233;riv&#233;s par analogie a correctement reli&#233; le verbe n&#233;ologique galvaniser au nom galvanisation. Le
module d&#8217;analyse des compos&#233;s a su analyser politico-judiciaire comme form&#233; par la composition
des adjectifs politique (avec alt&#233;ration) et judiciaire.
</p>
<p>6 Conclusion
</p>
<p>Le traitement de flux continu de d&#233;p&#234;ches d&#8217;actualit&#233; n&#233;cessite de maintenir un lexique &#224; jour
aussi dynamiquement que possible. Face &#224; cette probl&#233;matique, nous avons mis au point une
cha&#238;ne de traitement qui isole les &#233;l&#233;ments relevant de l&#8217;incompl&#233;tude lexicale, nous &#233;tudions
les m&#233;canismes n&#233;ologiques li&#233;s &#224; leur cr&#233;ation et impl&#233;mentons des modules d&#233;di&#233;s pour
leur analyse morphologique. Ce processus nous permet de r&#233;colter des informations (morpho-
syntaxiques et flexionnelles), selon la morphologie des n&#233;ologismes analys&#233;s. Nous sommes ainsi
en mesure de proposer des entr&#233;es lexicales &#224; ajouter au lexique, d&#232;s leur premi&#232;re occurrence et
avec une tr&#232;s bonne pr&#233;cision.
</p>
<p>En perspectives, ce travail pourra donner lieu &#224; des &#233;tudes, &#224; plus grande &#233;chelle et en temporalit&#233;,
des n&#233;ologismes, ainsi qu&#8217;&#224; l&#8217;inf&#233;rence d&#8217;autres informations (cadres de sous-cat&#233;gorisation,
classes s&#233;mantiques) concernant des entr&#233;es inconnues des lexiques. De tels travaux devront
</p>
<p>16. Ces informations pourraient &#233;galement &#234;tre construites pour les n&#233;ologismes trouv&#233;s dans les lexiques externes.
17. M&#234;me si ce dernier point est plus d&#233;licat, une des caract&#233;ristiques de la morphologie constructionnelle &#233;tant
</p>
<p>pr&#233;cis&#233;ment le caract&#232;re non compl&#232;tement pr&#233;dictible de la s&#233;mantique r&#233;sultante.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>418 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>par ailleurs &#234;tre &#233;valu&#233;s dans une configuration orient&#233;e-t&#226;che, pour montrer par exemple leur
utilit&#233; en analyse morphosyntaxique, syntaxique ou s&#233;mantique, ainsi par exemple que pour
l&#8217;indexation de documents.
</p>
<p>Remerciements Ce travail a &#233;t&#233; financ&#233; par le projet ANR EDyLex (ANR-09-CORD-008) et par
l&#8217;entreprise viavoo.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AHRONIAN, C. et B&#201;JOINT, H. (2008). Les noms compos&#233;s anglais et fran&#231;ais du domaine
d&#8217;internet : une radiographie bilingue. Meta : journal des traducteurs, 53(3):648&#8211;666.
</p>
<p>ANASTASSIADIS-SYM&#201;ONIDIS, A. et NIKOLAOU, G. (2011). L&#8217;adaptation morphologique des em-
prunts n&#233;ologiques : en quoi est-elle pr&#233;cieuse ? Langages 3.
</p>
<p>BARANES, M. (2012). Vers la correction automatique de textes bruit&#233;s : Architecture g&#233;n&#233;rale et
d&#233;termination de la langue d&#8217;un mot inconnu. In Actes de Recital 2012, Grenoble, France.
</p>
<p>BERNHARD, D. (2010). Apprentissage non supervis&#233; de familles morphologisques : Comparaison
de m&#233;thodes et aspects multilingues. TAL, 51(2):11&#8211;39.
</p>
<p>BLANCAFORT SAN JOS&#201;, H., RECOURC&#201;, G., COUTO, J., SAGOT, B., STERN, R. et TEYSSOU, D. (2010).
Traitement des inconnus : une approche syst&#233;matique de l&#8217;incompl&#233;tude lexicale. In Actes de
TALN 2010, Montr&#233;al, Canada.
</p>
<p>CABR&#201;, M., DOM&#200;NECH, M., ESTOP&#192;, R., FREIXA, J. et SOL&#201;, E. (2003). L&#8217;observatoire de n&#233;ologie :
conception, m&#233;thodologie, r&#233;sultats et nouveaux travaux. L&#8217;innovation lexicale, pages 125&#8211;147.
</p>
<p>CARTIER, E. (2011). N&#233;ologie et description linguistique pour le tal. Langages, 183:105&#8211;117.
</p>
<p>CHRUPA&#321;A, G., DINU, G. et van GENABITH, J. (2008). Learning morphology with morfette. In
Proceedings of LREC 2008, Marrakech, Morocco. ELDA/ELRA.
CREUTZ, M. et LAGUS, K. (2005). Inducing the morphological lexicon of a natural language from
unannotated text. In Proceedings of the International and Interdisciplinary Conference on Adaptive
Knowledge Representation and Reasoning (AKRR&#8217;05), pages 106&#8211;113.
</p>
<p>DAL, G. et NAMER, F. (2000). G&#233;n&#233;ration et analyse automatiques de ressources lexicales
construites utilisables en recherche d&#8217;informations. TAL, 41(2):423&#8211;446.
</p>
<p>DENIS, P. et SAGOT, B. (2012). Coupling an annotated corpus and a lexicon for state-of-the-art
pos tagging. Language Resources and Evaluation, 46(4):721&#8211;736.
</p>
<p>DISTER, A. et FAIRON, C. (2004). Extension des ressources lexicales gr&#226;ce &#224; un corpus dynamique.
Lexicometrica, Thema 7.
</p>
<p>GOLDSMITH, J. (2001). Unsupervised learning of the morphology of a natural language. Compu-
tational Linguistics, 27(2):153&#8211;198.
</p>
<p>HAN, B. et BALDWIN, T. (2011). Lexical normalisation of short text messages : Makn sens a#
twitter. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics :
Human Language Technologies, volume 1, pages 368&#8211;378.
</p>
<p>HATHOUT, N. (2010). Morphonette : a morphological network of french. CoRR, abs/1005.3902.
HATHOUT, N. et NAMER, F. (2011). R&#232;gles et paradigmes en morphologie informatique lex&#233;ma-
tique. In Actes de TALN 2011, Montpellier, France.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>419 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAVALL&#201;E, J.-F. et LANGLAIS, P. (2011). Moranapho : un syst&#232;me multilingue d&#8217;analyse morpholo-
gique fond&#233; sur l&#8217;analogie formelle. TAL, 52(2):17&#8211;44.
LEPAGE, Y. (1998). Solving analogies on words : An algorithm. In Proceedings of COLING-ACL
1998, pages 728&#8211;735.
LOVINS, J. (1968). Development of a stemming algorithm. MIT Information Processing Group,
Electronic Systems Laboratory.
MATHIEU-COLAS, M. (2010). Flexion des noms et des adjectifs compos&#233;s : principes de codage.
Lexiques, Dictionnaires, Informatique (LDI).
MAUREL, D. (2008). Prolexbase : a multilingual relational lexical database of proper names. In
Proceedings of LREC&#8217;08, pages 334&#8211;338, Marrakech, Morocco.
MAUREL, D. et PITON, O. (1998). Un dictionnaire de noms propres pour intex : les noms propres
g&#233;ographiques. Lingvisticae Investigationes, 22:279&#8211;289.
MIKHEEV, A. (1997). Automatic rule induction for unknown-word guessing. Computational
Linguistics, 23:405&#8211;423.
NEUVEL, S. et FULOP, S. A. (2002). Unsupervised learning of morphology without morphemes.
CoRR, cs.CL/0205072.
ROMARY, L., SALMON-ALT, S. et FRANCOPOULO, G. (2004). Standards going concrete : from lmf
to morphalou. In Proceedings of the Workshop on Enhancing and Using Electronic Dictionaries,
pages 22&#8211;28.
SABLAYROLLES, J. (1997). N&#233;ologismes : Une typologie des typologies. Cahier du CIEL, 1996-
1997:11&#8211;48.
SABLAYROLLES, J., JACQUET-PFAU, C. et HUMBLEY, J. (2011). Emprunts, cr&#233;ations &#8217;sous influence&#8217;
et &#233;quivalents. In Actes des Huiti&#232;mes Journ&#233;es scientifiques du R&#233;seau de chercheurs Lexicologie,
terminologie, traduction.
SAG, I., BALDWIN, T., BOND, F., COPESTAKE, A. et FLICKINGER, D. (2002). Multi-word expressions :
A pain in the neck for NLP. In proceedings of Conferences on Computational Linguistics and
Natural Language Processing.
SAGOT, B. (2010). The Lefff , a freely available and large-coverage morphological and syntactic
lexicon for French. In Proceedings of LREC 2010, La Valette, Malte.
SAGOT, B. et BOULLIER, P. (2008). SxPipe 2 : architecture pour le traitement pr&#233;-syntaxique de
corpus bruts. TAL, 49(2):155&#8211;188.
SAGOT, B. et STERN, R. (2012). Aleda, a free large-scale entity database for French. In Proceedings
of LREC 2012, pages 1273&#8211;1276, Istanbul, Turquie.
SCHMID, H. (1994). Treetagger. TC project at the Institute for Computational Linguistics of the
University of Stuttgart.
STROPPA, N. et YVON, F. (2006). Du quatri&#232;me de proportion comme principe inductif : une
proposition et son application &#224; l&#8217;apprentissage de la morphologie. TAL, 47(1):33&#8211;59.
TANGUY, L. et HATHOUT, N. (2002). Webaffix : un outil d&#8217;acquisition morphologique d&#233;rivation-
nelle &#224; partir du Web. In Actes de TALN 2002, pages 245&#8211;254, Nancy, France.
VILLOING, F. (2003). Les mots compos&#233;s VN du fran&#231;ais : arguments en faveur d&#8217;une construction
morphologique. Cahiers de Grammaire, 28:183&#8211;196.
WALTHER, G. et SAGOT, B. (2011). Probl&#232;mes d&#8217;int&#233;gration morphologique d&#8217;emprunts d&#8217;origine
anglaise en fran&#231;ais. In 30th International Conference on Lexis and Grammar.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>420 c&#65535; ATALA</p>

</div></div>
</body></html>