<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Exp&#233;riences de formalisation d&#8217;un guide d&#8217;annotation : vers l&#8217;annotation agile assist&#233;e</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Exp&#233;riences de formalisation d&#8217;un guide d&#8217;annotation :
vers l&#8217;annotation agile assist&#233;e
</p>
<p>Bruno Guillaume1,2 Kar&#235;n Fort1,3
(1) LORIA 54500 Vand&#339;uvre-l&#232;s-Nancy
</p>
<p>(2) Inria Nancy Grand-Est
(3) Universit&#233; de Lorraine
</p>
<p>bruno.guillaume@loria.fr, karen.fort@loria.fr
</p>
<p>R&#201;SUM&#201;
Nous proposons dans cet article une m&#233;thodologie, qui s&#8217;inspire du d&#233;veloppement agile et
qui permettrait d&#8217;assister la pr&#233;paration d&#8217;une campagne d&#8217;annotation . Le principe consiste &#224;
formaliser au maximum les instructions contenues dans le guide d&#8217;annotation afin de v&#233;rifier
automatiquement si le corpus en construction est coh&#233;rent avec le guide en cours d&#8217;&#233;criture.
Pour exprimer la partie formelle du guide, nous utilisons la r&#233;&#233;criture de graphes, qui permet
de d&#233;crire par des motifs les constructions d&#233;finies. Cette formalisation permet de rep&#233;rer les
constructions pr&#233;vues par le guide et, par contraste, celles qui ne sont pas coh&#233;rentes avec le
guide. En cas d&#8217;incoh&#233;rence, un expert peut soit corriger l&#8217;annotation, soit mettre &#224; jour le guide
et relancer le processus.
</p>
<p>ABSTRACT
Formalizing an annotation guide : some experiments towards assisted agile annotation
</p>
<p>This article presents a methodology, inspired from the agile development paradigm, that helps
preparing an annotation campaign. The idea behind the methodology is to formalize as much as
possible the instructions given in the guidelines, in order to automatically check the consistency
of the corpus being annotated with the guidelines, as they are being written. To formalize the
guidelines, we use a graph rewriting tool, that allows us to use a rich language to describe the
instructions. This formalization allows us to spot the rightfully annotated constructions and, by
contrast, those that are not consistent with the guidelines. In case of inconsistency, an expert can
either correct the annotation or update the guidelines and rerun the process.
</p>
<p>MOTS-CL&#201;S : annotation, guide d&#8217;annotation, annotation agile, r&#233;&#233;criture de graphes.
KEYWORDS: annotation, annotation guide, agile annotation, graph rewriting.
</p>
<p>1 Introduction
</p>
<p>Il est aujourd&#8217;hui un consensus clair, non seulement que les corpus annot&#233;s sont indispensables
aux outils de traitement automatique des langues (TAL) pour leur entra&#238;nement et leur &#233;va-
luation, mais &#233;galement que l&#8217;annotation doit &#234;tre consistante pour &#234;tre profitable (voir, par
exemple (Reidsma et Carletta, 2008)). Or, l&#8217;obtention d&#8217;une annotation manuelle de qualit&#233;
requiert l&#8217;utilisation d&#8217;un guide d&#8217;annotation suffisamment complet et coh&#233;rent (N&#233;dellec et al.,
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>628 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2006). La mise au point d&#8217;un tel guide est cependant, comme le soulignent Sampson (2000)
et (Scott et al., 2012), loin d&#8217;&#234;tre triviale.
</p>
<p>En outre, il est rare, une fois une campagne d&#8217;annotation termin&#233;e, que le guide d&#8217;annotation et
le corpus annot&#233; soient compl&#232;tement coh&#233;rents, ce qui n&#8217;est pas sans poser probl&#232;me pour les
syst&#232;mes ou les linguistes utilisant le corpus (voir par exemple (Candito et Seddah, 2012), en ce
qui concerne le corpus arbor&#233; du fran&#231;ais).
</p>
<p>Une solution pour rem&#233;dier &#224; ces deux difficult&#233;s consiste &#224; d&#233;velopper le guide et &#224; annoter
le corpus selon des cycles courts de prototypage. Cette m&#233;thodologie est appel&#233;e Agile Annota-
tion (Voormann et Gut, 2008) &#224; l&#8217;image de l&#8217;Agile Development (voir figure 1). Elle n&#8217;a, &#224; notre
connaissance, &#233;t&#233; appliqu&#233;e que dans un seul cas d&#8217;annotation r&#233;el (Alex et al., 2010).
</p>
<p>FIGURE 1 &#8211; Phases de l&#8217;annotation traditionnelle (&#224; gauche) et cycles de l&#8217;annotation agile (&#224;
droite). Reproduction de la figure 2 de (Voormann et Gut, 2008)
</p>
<p>Ind&#233;pendamment de la notion d&#8217;annotation agile, nous avions utilis&#233; la r&#233;&#233;criture de graphes
pour rechercher des erreurs r&#233;currentes dans le corpus Sequoia 1 (Candito et Seddah, 2012).
Cette application directe de la r&#233;&#233;criture &#224; la d&#233;tection d&#8217;erreurs a permis d&#8217;identifier une centaine
d&#8217;erreurs d&#8217;annotation et a conduit &#224; la publication d&#8217;une nouvelle version (3.3) du corpus en
juillet 2012.
</p>
<p>Nous pr&#233;sentons ici les exp&#233;riences que nous avons men&#233;es plus r&#233;cemment dans le cadre de
la correction d&#8217;annotations syntaxiques, pour laquelle nous avons transform&#233; les instructions
d&#8217;un guide d&#8217;annotation existant en r&#232;gles de r&#233;&#233;criture appliqu&#233;es sur le corpus annot&#233;. Ces
exp&#233;riences ont montr&#233; l&#8217;int&#233;r&#234;t d&#8217;une telle formalisation et nous proposons donc son int&#233;gration
dans le processus d&#8217;annotation manuelle, ce qui conduirait &#224; la mise en place d&#8217;une annotation
agile assist&#233;e.
</p>
<p>2 Formaliser un guide d&#8217;annotation
</p>
<p>La m&#233;thode que nous proposons consiste &#224; travailler de fa&#231;on syst&#233;matique &#224; partir du guide
d&#8217;annotation. En effet, pour chaque type d&#8217;annotation (pour chaque relation de d&#233;pendance
syntaxique dans l&#8217;exemple utilis&#233; plus loin) le guide &#233;num&#232;re les cas o&#249; cette annotation doit &#234;tre
r&#233;alis&#233;e. On utilise alors la r&#233;&#233;criture de graphes pour rep&#233;rer les occurrences des annotations
correspondant &#224; chacun des cas &#233;num&#233;r&#233;s dans le guide. Dans un deuxi&#232;me temps, on liste
</p>
<p>1. https://www.rocq.inria.fr/alpage-wiki/tiki-index.php?page=CorpusSequoia
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>629 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>les annotations qui n&#8217;ont pas &#233;t&#233; rep&#233;r&#233;es lors de la premi&#232;re phase. En th&#233;orie, pour chaque
annotation identifi&#233;e par cette m&#233;thode, se pr&#233;sente l&#8217;un des deux cas suivants :
&#8211; l&#8217;annotation est incorrecte, on doit alors corriger le corpus ;
&#8211; l&#8217;annotation est correcte et elle correspond &#224; un cas d&#8217;usage qui n&#8217;a pas &#233;t&#233; identifi&#233; par le
</p>
<p>r&#233;dacteur du guide, on doit alors mettre le guide &#224; jour.
&#201;videmment, dans le cas o&#249; le guide est mis &#224; jour, il faut relancer le processus pour mettre en
&#233;vidence d&#8217;&#233;ventuelles nouvelles incoh&#233;rences entre le guide et le corpus. La principale difficult&#233;
dans la mise en place de cette m&#233;thode r&#233;side dans le passage de la version usuelle du guide &#224; sa
version formalis&#233;e en terme de r&#233;&#233;criture de graphes.
</p>
<p>2.1 Guide d&#8217;annotation et implicite
</p>
<p>Un guide d&#8217;annotation est r&#233;dig&#233; par des humains pour des lecteurs humains. Plus pr&#233;cis&#233;ment,
il est r&#233;dig&#233; par des experts pour des lecteurs plus ou moins sp&#233;cialistes en fonction de la t&#226;che
d&#8217;annotation. Le guide repose donc souvent sur des informations implicites. L&#8217;introduction d&#233;crit
g&#233;n&#233;ralement le cadre th&#233;orique dans lequel l&#8217;annotation est r&#233;alis&#233;e. Ce cadre permet de donner
les principes g&#233;n&#233;raux qui s&#8217;appliquent &#224; l&#8217;ensemble du guide. Il faut, dans la suite du document,
qui d&#233;crit des parties plus sp&#233;cifiques de l&#8217;annotation, conna&#238;tre ces &#233;l&#233;ments g&#233;n&#233;raux pour
interpr&#233;ter les informations correctement.
</p>
<p>Dans le guide (Candito et al., 2009), il est expliqu&#233;, d&#8217;une part que la fonction A-OBJ (figure 2)
concerne des objets indirects en &#171; &#224; &#187; et, d&#8217;autre part que cette fonction peut &#234;tre r&#233;alis&#233;e par
un pronom clitique. Tout lecteur francophone sait que, dans le cas de la r&#233;alisation clitique,
la pr&#233;position n&#8217;est pas pr&#233;sente. Cette information n&#8217;est pas dans le guide mais elle doit &#234;tre
rendue explicite dans la r&#232;gle. Dans cet exemple, il est facile de construire la bonne r&#232;gle, mais
en g&#233;n&#233;ral l&#8217;information implicite est plus compliqu&#233;e &#224; formaliser.
</p>
<p>2.2 Limites de la formalisation
</p>
<p>Il est bien &#233;videmment impossible de formaliser compl&#232;tement le guide sous forme de r&#232;gles. En
effet, dans le cas contraire, cela signifierait que l&#8217;annotation peut-&#234;tre faite de fa&#231;on compl&#232;tement
automatique sans avoir recours &#224; un jugement humain. Par exemple, dans le cas de la fonction
A-OBJ (cf. figure 2), le guide indique qu&#8217;un objet indirect introduit par la pr&#233;position &#171; &#224; &#187; peut-
&#234;tre annot&#233; par une relation A-OBJ entre le verbe et la pr&#233;position, mais peut aussi dans certains
cas &#234;tre annot&#233; comme un locatif (avec la relation P-OBJ_LOC). Le choix entre l&#8217;une des deux
annotations se fait &#224; l&#8217;aide d&#8217;un test bas&#233; sur la cliticisation ou sur la forme interrogative. On
ne peut donc pas automatiquement d&#233;tecter une erreur d&#8217;annotation qui consiste &#224; utiliser la
relation A-OBJ au lieu de P-OBJ_LOC ou l&#8217;inverse.
</p>
<p>3 Exp&#233;riences
</p>
<p>Nous d&#233;crivons ici une premi&#232;re exp&#233;rience d&#8217;application de notre m&#233;thodologie sur un corpus et
le guide associ&#233;.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>630 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.1 Corpus Sequoia
</p>
<p>Il existe peu de ressources annot&#233;es syntaxiquement pour le fran&#231;ais. Le corpus arbor&#233; du
fran&#231;ais (Abeill&#233; et al., 2003), ou French Treebank (FTB), existe depuis une dizaine d&#8217;ann&#233;es
mais il n&#8217;est pas librement accessible et redistribuable. L&#8217;an dernier, un corpus comparable au FTB
mais librement accessible a &#233;t&#233; propos&#233;, le corpus Sequoia (Candito et Seddah, 2012). Celui-ci
contient environ 3 000 phrases provenant de quatre sources diff&#233;rentes (Wikip&#233;dia, Parlement
europ&#233;en, Est R&#233;publicain et Emea). Ces phrases ont &#233;t&#233; annot&#233;es en constituants. L&#8217;annotation
en constituants a ensuite &#233;t&#233; convertie en une annotation en d&#233;pendances. L&#8217;annotation en
d&#233;pendances vis&#233;e est d&#233;crite dans le guide 2 (Candito et al., 2009).
</p>
<p>3.2 R&#233;&#233;criture de graphes
</p>
<p>Pour formaliser les informations du guide, nous utilisons GREW (Guillaume et al., 2012), un
outil de r&#233;&#233;criture de graphes sp&#233;cialis&#233; pour les applications en TAL. En effet, GREW propose
un langage de description riche qui permet de rep&#233;rer automatiquement un motif de graphe
dans un ensemble de phrases. Dans un motif, on peut exprimer des combinaisons complexes de
contraintes sur les n&#339;uds, sur les traits et sur les relations de d&#233;pendances. De plus, un motif
peut &#234;tre sous-sp&#233;cifi&#233; et peut &#233;galement exprimer des contraintes n&#233;gatives sur le contexte.
</p>
<p>La r&#233;&#233;criture de graphes permet, une fois qu&#8217;un motif est rep&#233;r&#233;, de modifier la structure du
graphe. Ici, on n&#8217;utilisera cette fonctionnalit&#233; que pour marquer chaque occurrence reconnue (&#224;
l&#8217;aide de suffixes ok ou fail sur les &#233;tiquettes de d&#233;pendances).
</p>
<p>GREW dispose &#233;galement d&#8217;un m&#233;canisme de modules qui permet d&#8217;appliquer successivement
plusieurs ensembles de r&#232;gles de r&#233;&#233;criture. Dans notre application, on utilisera deux modules :
le premier pour rep&#233;rer les occurrences correctes des d&#233;pendances et un second pour mettre en
&#233;vidence les d&#233;pendances restantes et donc consid&#233;r&#233;es comme incorrectes.
</p>
<p>3.3 Un exemple de formalisation : la fonction A-OBJ
</p>
<p>La section du guide sp&#233;cifique &#224; la relation A-OBJ est reproduite dans la figure 2, ci-dessous.
</p>
<p>En g&#233;n&#233;ral, quelques it&#233;rations sont n&#233;cessaires pour coder correctement les parties implicites ou
les parties d&#233;crites ailleurs dans le guide.
</p>
<p>1. Une traduction na&#239;ve des informations du guide nous am&#232;ne &#224; d&#233;finir 4 r&#232;gles : une pour
chacune des r&#233;alisations possibles de l&#8217;objet indirect : un nom, un pronom clitique, un
pronom non-clitique ou une proposition infinitive.
</p>
<p>2. Si l&#8217;objet indirect est un clitique, la pr&#233;position n&#8217;est pas pr&#233;sente (&#171; Il lui parle. &#187;) ; il faut
donc modifier la r&#232;gle correspondante.
</p>
<p>3. En cas d&#8217;&#233;lision &#171; au &#187;, le lemme reste bien &#171; &#224; &#187; mais la cat&#233;gorie est P+D et non pas P ; il
faut g&#233;n&#233;raliser les r&#232;gles.
</p>
<p>4. Par contre, en cas d&#8217;&#233;lision &#171; auquel &#187; ; le lemme n&#8217;est &#171; &#224; &#187; mais &#171; auquel &#187; et la cat&#233;gorie
P+PRO ; il faut une cinqui&#232;me r&#232;gle.
</p>
<p>2. http://alpage.inria.fr/statgram/frdep/Publications/FTB-GuideDepSurface.pdf
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>631 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3.5 La fonction A-OBJ 
</p>
<p>Les objets indirects en &#224; , not&#233;s A-OBJ, sont des compl&#233;ments obligatoires soit nominaux ou 
pronominaux (cat&#233;gorie PP), soit clitiques (CLO), soit des infinitives phrastiques (VPinf) 
introduites par &#224;. 
 
Le test pour identifier les A-OBJ est la cliticisation par lui, leur. 
</p>
<p>(56) Il ressemble &#224; Martin  =&gt;  A-OBJ(ressemble-1,&#224;), OBJ(&#224;,Martin-3) 
</p>
<p>(57) J&#8217;encourage Marie &#224; venir  =&gt;  A-OBJ(encourage-1, &#224;), OBJ(&#224;,venir-4) 
</p>
<p> 
 
La cliticisation en y indique g&#233;n&#233;ralement un locatif sauf dans certains cas o&#249; on notera A-
OBJ : 
</p>
<p>(58) Jean pense &#224; Marie  =&gt;  A-OBJ(pense-1,&#224;), OBJ(&#224;,Marie-3) 
</p>
<p>(59) Jean va &#224; Paris  =&gt;  P-OBJ_LOC(va-1,&#224;), OBJ(&#224;,Paris-3) 
</p>
<p> 
Car on a pas O&#249; pense Jean ? mais bien O&#249; va Jean ? 
</p>
<p>FIGURE 2 &#8211; Extrait du guide d&#8217;annotation : la fonction A-OBJ
</p>
<p>5. Pour les clitiques, le guide demande la cat&#233;gorie clitique objet (avec le trait s=obj), mais
le corpus contient des relations A-OBJ dont le d&#233;pendant est un clitique r&#233;fl&#233;chi (avec
le trait s=refl) : &#171; je me pose des questions &#187; ; cette annotation est correcte ; il faut donc
mettre &#224; jour le guide et ajouter une r&#232;gle pour ce cas.
</p>
<p>Au final, on obtient donc les six motifs suivants :
</p>
<p>nominal pronominal &#171; &#224; &#187; ou &#171; au &#187; pronominal &#171; auquel &#187;
</p>
<p>!&quot;#$% !&quot;#$&amp;'&amp;()
*+,,&quot;$-
</p>
<p>!&quot;#$.
</p>
<p>/0123 123
</p>
<p>!&quot;#$% !&quot;#$&amp;'&amp;()
*+,,&quot;$-
</p>
<p>!&quot;#$&amp;./
</p>
<p>01/23 /23
</p>
<p>!&quot;#$% !&quot;#$&amp;'&amp;()
*+,,&quot;$&quot;-.-+*
</p>
<p>/0)12
</p>
<p>clitique objet clitique r&#233;flexif infinitif
</p>
<p>!&quot;#$% !&quot;#$&amp;'
($)*+
</p>
<p>,-./0
</p>
<p>!&quot;#$% !&quot;#$&amp;'
($)*+,
</p>
<p>-./01
</p>
<p>!&quot;#$% !&quot;#$&amp;'&amp;()
*+,,&quot;$-
</p>
<p>!&quot;#$%
,$./0
</p>
<p>12345 345
</p>
<p>L&#8217;application de ces motifs sur les 3 203 phrases de Sequoia donne les r&#233;sultats ci-dessous 3 :
</p>
<p>nominal pronominal pronominal clitique clitique infinitif
&#171; &#224; &#187; ou &#171; au &#187; &#171; auquel &#187; objet r&#233;flexif
</p>
<p>nb d&#8217;occurrences 476 17 3 84 16 87
</p>
<p>Il reste alors cinq occurrences de la relation A-OBJ qui ne correspondent &#224; aucune des r&#232;gles
ci-dessus. Trois de ces occurrences correspondent &#224; une erreur d&#8217;annotation :
&#8211; une erreur de POS : &#171; [. . .] on ne condamne pas &#224; mort [. . .] &#187; avec &#171; mort &#187; adjectif ;
&#8211; dans la construction &#171; r&#233;pondre &#224; c&#244;t&#233; de la question &#187;, le groupe pr&#233;positionnel &#171; &#224; c&#244;t&#233; de la
</p>
<p>question &#187; est un compl&#233;ment circonstanciel de mani&#232;re, on doit donc avoir la relation MOD ;
&#8211; utilisation de la pr&#233;position &#171; aupr&#232;s du &#187; dans la construction &#171; se renseigner aupr&#232;s du comit&#233; &#187; :
</p>
<p>l&#8217;argument du verbe est un P-OBJ introduit par le pr&#233;position &#171; aupr&#232;s de &#187; ;
</p>
<p>3. Tous les r&#233;sultats sont disponibles sur : http://wikilligramme.loria.fr/doku.php?id=taln_2013
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>632 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les deux autres occurrences sont correctes mais m&#233;riteraient de figurer d&#8217;une fa&#231;on ou d&#8217;une
autre dans le guide :
&#8211; le d&#233;pendant de la pr&#233;position a un POS inattendu : par exemple ET (POS pour &#233;tiqueter les
</p>
<p>mots d&#8217;origine &#233;trang&#232;re) dans &#171; [. . .] d&#233;livr&#233; &#224; The Medecine Company [. . .] &#187; ;
&#8211; le gouverneur de la relation A-OBJ est une coordination ;
On peut facilement imaginer le type de pr&#233;cisions qu&#8217;il est n&#233;cessaire d&#8217;apporter &#224; cette partie du
guide et donc le type de modifications qu&#8217;il faudra apporter aux r&#232;gles &#224; la prochaine &#233;tape pour
tenir compte des deux derniers points.
</p>
<p>4 M&#233;thodologie propos&#233;e
</p>
<p>L&#8217;exp&#233;rience d&#233;crite ci-dessus a &#233;t&#233; r&#233;alis&#233;e sur un corpus et son guide fig&#233; : le guide n&#8217;a pas &#233;t&#233;
mis &#224; jour depuis plusieurs ann&#233;es et l&#8217;annotation du corpus Sequoia est termin&#233;e depuis plus d&#8217;un
an. Par ailleurs, le guide n&#8217;est pas complet et il reste des sections qui ne sont pas compl&#232;tement
r&#233;dig&#233;es, notamment &#224; propos de la coordination. Le corpus n&#8217;est donc pas toujours annot&#233;
de mani&#232;re consistante, notamment en ce qui concerne les ph&#233;nom&#232;nes non finalis&#233;s dans le
guide. Le corpus Sequoia, auquel nous nous int&#233;ressons, est annot&#233; en d&#233;pendances syntaxiques,
mais l&#8217;annotation de d&#233;part et celle sur laquelle les d&#233;veloppeurs du corpus travaillent est une
annotation en constituants, et la conversion des constituants vers les d&#233;pendances est r&#233;alis&#233;e de
mani&#232;re automatique. Cela ajoute une difficult&#233; dans la t&#226;che de corrections du corpus : quand
une erreur d&#8217;annotation est d&#233;tect&#233;e dans les d&#233;pendances, il faut retrouver l&#8217;origine de l&#8217;erreur
dans les constituants ou dans la conversion.
</p>
<p>4.1 Int&#233;gration dans le processus d&#8217;annotation manuelle
</p>
<p>Les exp&#233;riences que nous avons men&#233;es nous ont convaincus que notre outil de r&#233;&#233;criture de
graphes peut &#234;tre un alli&#233; pr&#233;cieux dans la recherche de coh&#233;rence entre le guide et le corpus.
S&#8217;il est int&#233;ressant de l&#8217;utiliser sur des donn&#233;es statiques, nous pensons qu&#8217;il a un r&#244;le encore plus
important &#224; jouer sur des donn&#233;es en construction. Nous proposons donc d&#8217;utiliser ce type d&#8217;outil
tr&#232;s t&#244;t dans le processus d&#8217;annotation, notamment au moment de la cr&#233;ation du guide.
</p>
<p>Dans l&#8217;id&#233;al, chaque application de la r&#233;&#233;criture de graphes permet de rep&#233;rer des erreurs
d&#8217;annotation et des erreurs, des manques ou des impr&#233;cisions dans le guide. On peut donc
imaginer un processus comme celui d&#233;crit dans le sch&#233;ma de la figure 3 qui repr&#233;sente un pas
du cycle de d&#233;veloppement menant de la version i du guide et du corpus &#224; la version i+ 1 de
ceux-ci. Par souci de simplicit&#233;, le sch&#233;ma ci-dessous ne fait pas intervenir de fa&#231;on explicite
le travail de conversion du guide en r&#232;gle de r&#233;&#233;criture. Ce travail n&#8217;est pour autant pas trivial,
comme nous l&#8217;avons vu sur notre exemple d&#8217;annotation syntaxique.
</p>
<p>4.2 Mise en &#339;uvre
</p>
<p>La m&#233;thodologie d&#8217;annotation agile d&#233;crite ci-dessus co&#251;te cher et ne peut probablement pas
&#234;tre appliqu&#233;e tout au long d&#8217;une campagne de grande envergure. Cependant, il est possible (et
souhaitable) de la mettre en &#339;uvre lors de la phase de pr&#233;paration de la campagne, en particulier
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>633 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>! !
</p>
<p>!&quot;#$%
#
</p>
<p>&amp;'()&quot;*
+,,'-.
</p>
<p>/
</p>
<p>!(%0 1((%&quot;(*
</p>
<p>12)%(-
1((%&quot;(*
3&quot;#$%
</p>
<p>1((%&quot;(*
4'()&quot;*
</p>
<p>&amp;'()&quot;*
+,,'-.
</p>
<p>/56
</p>
<p>!&quot;#$%
#56
</p>
<p>7#*%898/'&quot;(
</p>
<p>7#*%898/'&quot;(
</p>
<p>:(#
</p>
<p>;&lt;3=%*
# ;&lt;3=%*
</p>
<p>#56
</p>
<p>FIGURE 3 &#8211; Une it&#233;ration du processus d&#8217;annotation agile
</p>
<p>lors de la mise au point du guide, r&#233;alis&#233;e en parall&#232;le de l&#8217;annotation d&#8217;une mini-r&#233;f&#233;rence (Fort,
2012). Si la mini-r&#233;f&#233;rence se doit d&#8217;&#234;tre repr&#233;sentative du corpus, sa taille va largement d&#233;pendre
des contraintes pratiques de la campagne (co&#251;t, disponibilit&#233; des experts). Il en va de m&#234;me pour
le nombre d&#8217;it&#233;rations du cycle d&#8217;annotation agile.
</p>
<p>Pendant la phase de production, durant laquelle les annotateurs travaillent sur l&#8217;ensemble du
corpus, cette m&#233;thodologie peut sans doute continuer &#224; &#234;tre utilis&#233;e, mais avec une dur&#233;e de
cycle beaucoup plus longue. Le rep&#233;rage d&#8217;erreurs par r&#233;&#233;criture de graphes est alors un outil
suppl&#233;mentaire (en compl&#233;ment d&#8217;une &#233;valuation r&#233;guli&#232;re, voir, l&#224; encore, (Fort, 2012)) pour le
gestionnaire de la campagne, qui lui permet d&#8217;&#234;tre alert&#233; au plus t&#244;t en cas de probl&#232;me dans
l&#8217;annotation.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Nous avons propos&#233; une m&#233;thodologie permettant d&#8217;assister l&#8217;annotation agile lors d&#8217;une cam-
pagne d&#8217;annotation, &#224; l&#8217;aide d&#8217;un outil de r&#233;&#233;criture de graphes. Si nous avons obtenu des r&#233;sultats
int&#233;ressants lors des exp&#233;riences pr&#233;sent&#233;es ici, il reste &#224; v&#233;rifier l&#8217;utilisabilit&#233; du syst&#232;me dans le
cadre d&#8217;une campagne d&#8217;annotation r&#233;elle, c&#8217;est-&#224;-dire de l&#8217;int&#233;grer dans un cycle d&#8217;annotation.
</p>
<p>Nous comptons donc appliquer cette m&#233;thodologie dans les mois qui viennent, pour la cr&#233;ation
de la mini-r&#233;f&#233;rence et la mise au point du guide, dans le cadre d&#8217;une campagne d&#8217;annotation en
d&#233;pendances syntaxiques profondes du corpus Sequoia.
</p>
<p>Pour d&#8217;autres types de campagnes d&#8217;annotation (par exemple, s&#233;mantique ou discursive), la
r&#233;&#233;criture de graphes n&#8217;est sans doute pas l&#8217;outil le plus adapt&#233;. Pour autant, une assistance &#224;
l&#8217;aide d&#8217;outils TAL, m&#234;me frustres, pourrait profiter &#224; l&#8217;annotation agile, dont le principal &#233;cueil
est le co&#251;t.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>634 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Remerciements
</p>
<p>Nous tenons &#224; remercier Florian Besnard, &#233;tudiant &#224; l&#8217;&#201;cole des Mines de Nancy, qui a particip&#233;
lors de son stage &#224; la conversion d&#8217;une partie du guide en r&#232;gles de r&#233;&#233;criture.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et TOUSSENEL, F. (2003). Building a treebank for French. In ABEILL&#201;, A.,
&#233;diteur : Treebanks, pages 165 &#8211;187. Kluwer, Dordrecht.
</p>
<p>ALEX, B., GROVER, C., SHEN, R. et KABADJOV, M. (2010). Agile corpus annotation in practice : An
overview of manual and automatic annotation of CVs. In Proceedings of the Fourth Linguistic
Annotation Workshop (LAW), pages 29&#8211;37, Uppsala, Su&#232;de. Association for Computational
Linguistics.
</p>
<p>CANDITO, M., CRABB&#201;, B. et FALCO, M. (2009). D&#233;pendances syntaxiques de surface pour le
fran&#231;ais. Rapport technique, Universit&#233; Paris 7.
</p>
<p>CANDITO, M. et SEDDAH, D. (2012). Le corpus Sequoia : annotation syntaxique et exploitation
pour l&#8217;adaptation d&#8217;analyseur par pont lexical. In Actes de Traitement Automatique des Langues
Naturelles (TALN), Grenoble, France.
</p>
<p>FORT, K. (2012). Les ressources annot&#233;es, un enjeu pour l&#8217;analyse de contenu : vers une m&#233;thodologie
de l&#8217;annotation manuelle de corpus. Th&#232;se de doctorat, Universit&#233; Paris XIII, LIPN, INIST-CNRS.
</p>
<p>GUILLAUME, B., BONFANTE, G., MASSON, P., MOREY, M. et PERRIER, G. (2012). Grew : un outil de
r&#233;&#233;criture de graphes pour le TAL. In Actes de Conf&#233;rence annuelle sur le Traitement Automatique
des Langues (TALN), Grenoble, France.
</p>
<p>N&#201;DELLEC, C., BESSI&#200;RES, P., BOSSY, R., KOTOUJANSKY, A. et MANINE, A.-P. (2006). Annotation gui-
delines for machine learning-based named entity recognition in microbiology. In et C. N&#201;DELLEC,
M. H., &#233;diteur : Proceedings of the Data and text mining in integrative biology workshop, pages
40&#8211;54, Berlin, Allemagne.
</p>
<p>REIDSMA, D. et CARLETTA, J. (2008). Reliability measurement without limits. Computational
Linguistics, 34(3):319&#8211;326.
</p>
<p>SAMPSON, G. (2000). The role of taxonomy in language engineering. Philosophical Transactions of
the Royal Society of London. Series A :Mathematical, Physical and Engineering Sciences, 358(1769):
1339&#8211;1355.
</p>
<p>SCOTT, D., BARONE, R. et KOELING, R. (2012). Corpus annotation as a scientific task. In
International Conference on Language Resources and Evaluation, Istanbul, Turquie.
</p>
<p>VOORMANN, H. et GUT, U. (2008). Agile corpus creation. Corpus Linguistics and Linguistic Theory,
4(2):235&#8211;251.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>635 c&#65535; ATALA</p>

</div></div>
</body></html>