<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Convertir des analyses syntaxiques en d&#233;pendances vers les relations fonctionnelles PASSAGE</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Convertir des analyses syntaxiques en d&#233;pendances vers les
relations fonctionnelles PASSAGE
</p>
<p>Patrick Paroubek Munshi Asadullah Anne Vilnat
LIMSI-CNRS B&#226;t. 508 Universit&#233; Paris-Sud
</p>
<p>91403 Orsay Cedex France
</p>
<p>R&#201;SUM&#201;
Nous pr&#233;sentons ici les premiers travaux concernant l&#8217;&#233;tablissement d&#8217;une passerelle bidirection-
nelle entre d&#8217;une, part les sch&#233;mas d&#8217;annotation syntaxique en d&#233;pendances qui ont &#233;t&#233; d&#233;finis
pour convertir les annotations du French Treebank en arbres de d&#233;pendances de surface pour
l&#8217;analyseur syntaxique Bonsai, et d&#8217;autre part le formalisme d&#8217;annotation PASSAGE d&#233;velopp&#233;
initialement pour servir de support &#224; des campagnes d&#8217;&#233;valuation ouvertes en mode objectif
quantitatif bo&#238;te-noire pour l&#8217;analyse syntaxique du fran&#231;ais.
ABSTRACT
Converting dependencies for syntactic analysis of French into PASSAGE functional rela-
tions
</p>
<p>We present here a first attempt at building a bidrictionnal converter between, on the one hand
the dependency based syntaxtic formalism which has been defined to map the French Treebank
annotation onto surface dependency trees used by the Bonsai parser, on the other hand the
PASSAGE formalism developped intially for French parsing quantitative black-box objective open
evaluation campaigns.
</p>
<p>MOTS-CL&#201;S : Analyse Syntaxique - Corpus arbor&#233; - Dependances -DepFTB - ConLL - PASSAGE.
KEYWORDS: Parsing - Treebank - Dependencies - DepFTB -ConLL - PASSAGE.
</p>
<p>1 Introduction
</p>
<p>Le travail que nous pr&#233;sentons ici repose sur deux constats : d&#8217;une part, si l&#8217;on s&#8217;int&#233;resse aux
analyseurs syntaxiques du fran&#231;ais librement disponibles et pr&#234;ts &#224; l&#8217;emploi, on trouve essentiel-
lement des analyseurs qui produisent une repr&#233;sentation utilisant le format ConLL(Buchholz et
Marsi, 2006), et suivant les normes du French TreeBank (FTB) (Abeill&#233; et al., 2000), &#224; l&#8217;image
des parsers adapt&#233;s au fran&#231;ais d&#233;crits dans (Candito et al., 2010). D&#8217;autre part, quand on veut
&#233;valuer les performances de ces analyseurs peu de corpus existent avec des annotations du
m&#234;me format, &#224; part Sequoia obtenu par conversion du FTB (Candito et Seddah, 2012) qui
compte environ 3200 &#233;nonc&#233;s, alors qu&#8217;il existe le corpus des campagnes PASSAGE (Vilnat et al.,
2010; de la Clergerie et al., 2008) qui a donn&#233; lieu &#224; l&#8217;annotation manuelle d&#8217;au moins 14000
&#233;nonc&#233;s dont 8200 libres de droits 1, dont une partie comprenant divers genres issue de la
</p>
<p>1. Ce corpus est accessible sur les serveur d&#8217;&#233;valuation http ://passageval.limsi.fr et en cours de d&#233;ploiement sur
http ://www.elda.org, o&#249; l&#8217;on peut aussi obtenir la partie sous-droits du corpus.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>675 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>campagne EASY (Paroubek et al., 2006). Cependant, le corpus PASSAGE utilise un formalisme
d&#8217;annotation comprenant un niveau de groupes syntaxiques et des fonctions grammaticales
propres au projet. On voudrait donc pouvoir passer d&#8217;un sch&#233;ma d&#8217;annotation &#224; l&#8217;autre pour
permettre l&#8217;usage de ces analyseurs et &#233;valuer leur performances par rapport au corpus PASSAGE,
ou bien pour certaines t&#226;ches d&#8217;analyse du langage, pr&#233;f&#233;rer utiliser le formalisme PASSAGE qui
relache certaines contraintes des repr&#233;sentations syntaxiques classiques, ou encore disposer d&#8217;un
convertisseur bidirectionnel pour effectuer des comparaisons entre les formalismes d&#8217;annotation.
Les analyseurs syntaxiques des derni&#232;res ann&#233;es ont tr&#232;s souvent suivi des variantes du mod&#232;le
de d&#233;pendances de l&#8217;analyseur de Stanford : SD, d&#233;crit dans (M.-C. de Marneffe et C D Manning,
2008), o&#249; les auteurs ont &#233;tablis des comparaisons de formalismes entre SD, GR (Grammatical
Relation) (Carroll et al., 1999), d&#233;velopp&#233; pour faire des &#233;valuations et PARC (Tracy Holloway
King et al., 2003), utilis&#233; pour &#233;valuer des analyseurs LFG (Kaplan et al., 2004). Dans (Sagae et al.,
2008), les auteurs montrent comment convertir des repr&#233;sentation syntaxiques pour &#233;valuer des
analyseurs syntaxiques (fond&#233;s sur des formalismes diff&#233;rents) avec le Penn Tree Bank (PTB)
et des textes de la litt&#233;rature biom&#233;dicale acad&#233;mique, en utilisant des convertisseurs entre SD,
GR, un analyseur syntaxique profond (une impl&#233;mentation de HPSG (Miyao et al., 2004)) et
l&#8217;analyse de surface du PTB. Tous ces travaux ont &#233;t&#233; faits sur l&#8217;anglais, en faisant un large usage
du PTB. On retrouve dans la majorit&#233; des travaux les m&#234;mes familles de formalismes utilis&#233;s
dans les diff&#233;rentes comparaisons que ceux pris ici comme exemple.
</p>
<p>L&#8217;article pr&#233;sent&#233; ici va donc d&#8217;abord pr&#233;senter les formats de Bonsai, suivant ConLL, et PASSAGE.
Pour v&#233;rifier l&#8217;hypoth&#232;se de compatibilit&#233; de ces deux formats, nous pr&#233;senterons le corpus issu
du FTB que nous avons constitu&#233;, et son annotation manuelle au format Passage. Les principes
que nous avons suivis pour pemettre les conversions dans les deux sens (Passage vers ConLL, ou
ConLL vers Passage) feront l&#8217;objet de la suite de cette pr&#233;sentation, et nous &#233;valuerons enfin les
r&#233;sultats obtenus par ces deux convertisseurs, avant de conclure sur les suites de ce travail, et en
particulier sur son application dans le projet PROJESTIMATE 2.
</p>
<p>2 Dep-FTB pour le fran&#231;ais
</p>
<p>Nous nous int&#233;ressons aux sch&#233;mas d&#8217;annotation d&#233;crits dans (Candito et al., 2011) 3 qui d&#233;crivent
les annotations produites par les analyseurs syntaxiques Bonsai 4. Ces analyseur syntaxiques
produisent des annotations dans le format de donn&#233;es ConLL, initialement d&#233;velopp&#233; pour des
campagnes d&#8217;&#233;valuation d&#8217;analyse syntaxique en d&#233;pendances (Buchholz et Marsi, 2006). Cette
repr&#233;sentation utilise une repr&#233;sentation matricielle dont la premi&#232;re colonne contient les formes
de l&#8217;&#233;nonc&#233;, puis les autre colonnes suivantes leurs &#233;tiquettes morpho-syntaxiques, et ensuite
les d&#233;pendances syntaxiques. C&#8217;est un format extensible, auquel on peut ajouter de nouvelles
couches d&#8217;analyse par simple ajout de colonnes &#224; la matrice de repr&#233;sentation. Les d&#233;pendances
sont repr&#233;sent&#233;es aux moyen de deux colonnes, l&#8217;une pour le type de la d&#233;pendance, l&#8217;autre pour
l&#8217;adresse de sa cible, qui r&#233;f&#233;rence une ligne de la matrice, la source de la d&#233;pendance &#233;tant la
forme courante. La Table 1 illustre cette repr&#233;sentation.
</p>
<p>Notons que nous aurons essentiellement deux types d&#8217;information, des &#233;tiquettes (morpho-
</p>
<p>2. PROJESTIMATE est un projet FUI - CAP DIGITAL (2012-2015) sur l&#8217;analyse automatique de sp&#233;cifications logicielles
pour l&#8217;estimation de co&#251;ts, qui finance ces travaux
</p>
<p>3. Guide d&#8217;annotation ConLL FTB : http ://alpage.inria.fr/statgram/frdep/Publications/FTB-GuideDepSurface.pdf
4.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>676 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Je cln CL CLS s=suj 2 suj 2 suj
2 remercie remercier V V m=ind|n=s|p=3 0 root 0 root
3 le le D DET g=m|n=s|s=def 4 det 4 det
4 pr&#233;sident pr&#233;sident N NC g=m|n=s|s=c 2 obj 2 obj
5 en en P P p=3 4 dep 4 dep
6 exercice exercice N NC g=m|n=s|s=c 5 obj 5 obj
7 pour pour P P _ 2 mod 2 mod
8 sa son D DET g=f|n=s|s=poss 9 det 9 det
9 r&#233;ponse r&#233;ponse N NC g=f|n=s|s=c 7 obj 7 obj
10 . . PONCT PONCT s=s 2 ponct 2 ponct
</p>
<p>TABLE 1 &#8211; Extrait d&#8217;annotation ConLL issu du corpus Sequoia v4.0
</p>
<p>FIGURE 1 &#8211; Repr&#233;sentation graphique des d&#233;pendances de l&#8217;extrait d&#8217;annotation ConLL issu du
corpus Sequoia v4.0
</p>
<p>syntaxique, s&#233;mantique, se rapportant &#224; un syst&#232;me de classification particulier, etc.) associ&#233;es
&#224; une forme particuli&#232;re, et des d&#233;pendances &#233;tiquet&#233;es qui vont relier des formes ensembles,
avec la condition qu&#8217;une forme ne peut engendrer qu&#8217;une d&#233;pendance, mais par contre plusieurs
dependances peuvent aboutir sur une m&#234;me forme. Le guide d&#8217;annotation Bonsai recense 12
d&#233;pendances pour les gouverneurs verbaux : suj (Sujet), obj (objet), de_obj (SP argumental en de,
non locatif), a_obj (SP argumental en &#224;, non locatif), p_obj (autre SP argumental), ats (Attribut
du sujet), ato (Attribut de l&#8217;objet), mod (Modifieur), aux_tps (auxiliaires de temps), aux_pass
(auxiliaires du passif), aux_caus (verbe causatif, en cas de complexe causatif + inf), aff (clitiques
fig&#233;s) et 8 d&#233;pendances pour gouverneurs non verbaux : mod (Modifieurs rep&#233;r&#233;s structuralement,
comme par exemple les adjectifs &#233;pith&#232;tes, autres que les relatives), mod_rel (Relatives adnominales),
coord (Relation port&#233;e par un coordonnant, avec comme gouverneur le coordonn&#233; imm&#233;diatement
pr&#233;c&#233;dent), arg (utilis&#233; dans le cas de pr&#233;positions &#171; li&#233;es &#187;, ex. &#171; Charybde en Scylla &#187;, dep_coord
(Relation port&#233;e par un coordonn&#233; diff&#233;rent du premier, avec comme gouverneur le coordonnant
imm&#233;diatement pr&#233;c&#233;dent), det (Relation port&#233;e par les d&#233;terminants), ponct (Relation port&#233;e par
tout d&#233;pendant typographique, sauf pour les virgules jouant le r&#244;le de coordonnant), dep (Relation
sous-sp&#233;cifi&#233;e, pour les d&#233;pendants pr&#233;positionnels (pas de gestion de la distinction argument / ajout
pour les gouverneurs non verbaux). Il s&#8217;agit l&#224; des repr&#233;sentations utilis&#233;es pour l&#8217;annotations au-
tomatique. L&#8217;annotation manuelle propos&#233;e dans (Candito et al., 2011) ajoute les 8 d&#233;pendances
suivantes : mod_loc (Modifieurs s&#233;mantiquement locatifs, au propre ou au figur&#233;), mod_cleft (Pour
la subordonn&#233;e dans le cas d&#8217;une cliv&#233;e), p_obj_agt (Pour les compl&#233;ments d&#8217;agent, passif ou causatif),
p_obj_loc (D&#233;pendants argumentaux locatifs, source, destination, ou localisation), suj_impers (Pour
le sujet expl&#233;tif il), aff_moyen (Pour le clitique se en cas de moyen), arg_comp (Utilis&#233; pour relier
une comparative et son gouverneur), et finalement arg_cons (Utilis&#233; pour relier une cons&#233;cutive et
son gouverneur adverbial. La Figure 1 illustre certaines de ces d&#233;pendances.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>677 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Le formalisme d&#8217;annotation PASSAGE
</p>
<p>PASSAGE(Vilnat et al., 2010; de la Clergerie et al., 2008) annote &#224; la fois des groupes et des
relations de d&#233;pendance 5. Les groupes sont des constituants minimaux non r&#233;cursifs. Il y en
a 6 : le groupe nominal (GN), pr&#233;positionnel (GP), adjectival (GA), adverbial (GR), le noyau
verbal (NV) et verbal pr&#233;positionnel (PV). Les 14 relations sont &#233;tablies entre ces groupes ou
entre les formes au sein de ces groupes. Il s&#8217;agit de lier le sujet au verbe (SUJ-V), le verbe
&#224; son auxiliaire (AUX-V), l&#8217;objet direct (COD-V), ou le compl&#233;ment 6 (CPL-V) , ou tous les
autres modifieurs optionnels (MOD-V) au verbe. On annote aussi tous les autres types de
modifieurs : du nom (MOD-N), de l&#8217;adjectif (MOD-A), de l&#8217;adverbe (MOD-R) ou de la pr&#233;position
(MOD-P). On identifie aussi l&#8217;attribut du sujet ou de l&#8217;objet (ATT-SO), ainsi que le lien entre
l&#8217;introducteur d&#8217;une subordonn&#233;e et son noyau verbal (COMP). Les trois derni&#232;res relations sont
la coordiantion (COORD), la juxtaposition (JUXT) et l&#8217;apposition (APP). La Figure 2 illustre ce
sch&#233;ma d&#8217;annotation.
</p>
<p>FIGURE 2 &#8211; Exemple d&#8217;annotation au format PASSAGE
</p>
<p>Une comparaison entre les annotations PASSAGE transpos&#233;es sur l&#8217;anglais et celles de SD et de
PARC est pr&#233;sent&#233;e dans (Paroubek et al., 2009).
</p>
<p>4 Dep-FTB vers PASSAGE
</p>
<p>Par rapport au sch&#233;ma d&#8217;annotation Dep-FTB, les annotations PASSAGE sont moins sp&#233;cifiques,
la conversion vers les annotations PASSAGE ne pose pas de probl&#232;me majeur et peut-&#234;tre
effectu&#233;e avec un syst&#232;me &#224; base de r&#232;gles hi&#233;rarchis&#233;es, d&#233;clench&#233;es par des patrons m&#233;langeant
annotations et formes. L&#8217;ordre de d&#233;clenchement des r&#232;gles va du plus sp&#233;cifique au moins
sp&#233;cifique. Actuellement 45 r&#232;gles ont &#233;t&#233; n&#233;cessaires pour traiter l&#8217;int&#233;gralit&#233; des ph&#233;nom&#232;nes
linguistiques pr&#233;sents. La Figure 3 donne un exemple de r&#232;gles de projection des annotations.
</p>
<p>Les &#233;ventuels probl&#232;mes que l&#8217;on va rencontrer lors de la conversion, vont concerner d&#8217;une
part les diff&#233;rences de segmentation en mots entre les deux formalismes et d&#8217;autre part le
positionnement pr&#233;cis des fronti&#232;res des groupes syntaxiques PASSAGE cibles (pour les r&#232;gles qui
en d&#233;finissent). Nous avons contourn&#233; les diff&#233;rences de segmentation au moyen d&#8217;un algorithme
de programmation dynamique (Makhoul et al., 1999) pour le r&#233;alignement de formes et la
d&#233;termination pr&#233;cises des fronti&#232;res de groupes syntaxiques cibles est un probl&#232;me secondaire,
</p>
<p>5. Guide d&#8217;annotation en fran&#231;ais : http ://www.limsi.fr/Individu/pap/PEAS_reference_annotations_v2.2.html
6. qu&#8217;il s&#8217;agisse d&#8217;un adjoint ou d&#8217;un indirect (qu&#8217;on ne cherchera pas &#224; distinguer)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>678 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIGURE 3 &#8211; Trois exemples de r&#232;gles de projection de Dep-FTB vers PASSAGE : auxiliaire de temps
(AUX-TPS), coordination (COORD) et factitif (AUX-CAUS).
</p>
<p>car ils sont pr&#233;sents dans peu de r&#232;gles et les annotations PASSAGE offrent la possibilit&#233; de n&#8217;avoir
qu&#8217;une annotation en relations grammaticales. N&#233;anmoins, nous avons consid&#233;r&#233;, quand cela
&#233;tait possible, la g&#233;n&#233;ration des groupes syntaxiques dans nos r&#232;gles de conversion, avec l&#8217;espoir
de pouvoir utiliser la couche d&#8217;annotations morpho-syntaxiques pour aider au placement correct
de leurs fronti&#232;res. Nous avons &#233;valu&#233; les r&#233;sultats obtenues par l&#8217;analyseur Berkeley Parser v1.0
adapt&#233; au fran&#231;ais 7 et le convertisseur Dep-FTB sur un extrait du corpus PASSAGE (texte du
parlement Europ&#233;een EP &amp; JRC) de 1584 &#233;nonc&#233;s 8. La Figure 4 donne une vue synoptique des
diff&#233;rents composants de ce convertisseur, avec en clair le convertisseur Dep-FTB vers PASSAGE.
Le texte est extrait de la r&#233;f&#233;rence de PASSAGE, analys&#233; par Sequoia, puis converti au format
PASSAGE, et align&#233; pour &#234;tre ensuite &#233;valu&#233; par les outils d&#233;velopp&#233;s dans PASSAGE.
</p>
<p>FIGURE 4 &#8211; Vue synoptique des convertisseurs DepFTB-PASSAGE.
</p>
<p>La Figure 5 donne les mesures de performance pour les relations obtenues avec cet analyseur sur
un extrait du corpus PASSAGE (texte du parlement Europ&#233;een EP &amp; JRC) de 1584 &#233;nonc&#233;s.
</p>
<p>7.
8. Les corpus et les outils pr&#233;sent&#233;s dans cet article sont librement accessibles &#224; l&#8217;URL
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>679 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Relation p r f
ALL 0.544 0.343 0.421
SUJ-V 0.681 0.498 0.575
AUX-V 0.885 0.752 0.813
COD-V 0.633 0.450 0.526
CPL-V 0.421 0.060 0.106
MOD-V 0.225 0.534 0.317
COMP 0.882 0.116 0.205
ATB-SO 0.256 0.426 0.320
MOD-N 0.725 0.298 0.423
MOD-A 0.756 0.277 0.406
MOD-R 0.694 0.259 0.377
MOD-P 0 0 0
COORD 0.572 0.406 0.475
APPOS 0 0 0
JUXT 0 0 0
</p>
<p>FIGURE 5 &#8211; Mesures de pr&#233;cision et rappel pour les relations (comparaison en &#233;galit&#233; stricte)
obtenues avec l&#8217;analyseur Berkeley Parser v1.0 adapt&#233; au fran&#231;ais et le convertisseur Dep-FTB
sur un extrait du corpus PASSAGE (texte du parlement Europ&#233;een EP &amp; JRC) de 1584 &#233;nonc&#233;s.
</p>
<p>5 De PASSAGE &#224; Dep-FTB
</p>
<p>La conversion de PASSAGE vers Dep-FTB est plus probl&#233;matique, car elle va n&#233;cessiter de
r&#233;soudre des ambigu&#239;t&#233;s pour lesquelles il faut disposer d&#8217;informations s&#233;mantiques afin de
passer &#224; des annotations plus sp&#233;cifiques. L&#8217;ancrage des d&#233;pendances va aussi &#234;tre probl&#233;matique,
car sous-sp&#233;cifi&#233; dans PASSAGE au niveau des groupes syntaxiques, il est actuellement r&#233;alis&#233;
en choisissant la derni&#232;re forme du groupe dont les annotations morpho-syntaxiques sont
compatibles avec la relation pour laquelle on cherche un ancrage.
</p>
<p>Le convertisseur de PASSAGE vers Dep-FTB reprend les r&#232;gles d&#233;crites pr&#233;c&#233;demment ainsi que le
contenu de la bo&#238;te &#224; outils PASSAGE pour une grande part (C++). Une r&#232;gle de correspondance
est repr&#233;sent&#233;e par un ensemble d&#8217;&#233;nonc&#233;s PASSAGE dont les mots sont des formes explicites,
des listes de patrons morpho-syntaxiques ou des variables. Si nous prenons comme exemple
la traduction de la relation compl&#233;ment du verbe de PASSAGE CPL-V en Dep-FTB, elle peut
produire des d&#233;pendances A_OBJ, DE_OBJ, POBJ_LOC, MOD et AFF (Candito et al., 2011). Si
la traduction peut utiliser les types des groupes relations et des groupes syntaxiques impliqu&#233;s
lorsque la relation relie plusieurs groupes syntaxiques (MOD versus COMP, ou bien la pr&#233;sence
d&#8217;un groupe PV), dans le cas des relations CPL-V interne &#224; un groupe syntaxique (cas des pronoms
clitiques), il faudra distinger les diff&#233;rents cas de traduction en fonction de formes sp&#233;cifiques
ou de la classe s&#233;mantique des verbes (encod&#233;e dans le syst&#232;me actuel sous forme de listes de
patron morpho-syntaxiques 9.) pour distinguer la production d&#8217;une d&#233;pendance : A_OBJ (Paul
</p>
<p>9. Dans le cas o&#249; les annoations PASSAGE ne contiennent pas d&#8217;annotation morpho-syntaxiques, le convertisseur fait
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>680 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>y pense.), P_OBJ_LOC (Paul y va.), MOD (Le chomage y est grand) ou bien encore AFF (Il y a 3
ans.). &#192; ce jour le convertisseur de PASSAGE vers Dep-FTB &#233;tant encore en phase de test, ses
performances ne sont pas &#233;valuables.
</p>
<p>6 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; la premi&#232;re version d&#8217;un convertisseur bidirectionnel pour les formalismes
d&#8217;annotation Dep-FTB et PASSAGE. Ce convertisseur permet de projeter la part des annotations
syntaxiques qui ont un correspondant dans le formalisme cible.
</p>
<p>La conversion de PASSAGE vers Dep-FTB est r&#233;alis&#233;e et les premi&#232;res &#233;valuations sont donn&#233;es. La
conversion dans l&#8217;autre sens n&#8217;est pas compl&#232;tement achev&#233;e, mais une premi&#232;re impl&#233;mentation
est en cours.
</p>
<p>Le code du convertisseur ainsi que les diff&#233;rents corpus ayant servi aux exp&#233;riences pr&#233;sent&#233;es
dans cet article sont librement diponibles &#224; l&#8217;url
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201;, A., CL&#201;MENT, L. et KINYON, A. (2000). Building a treebank for french. In Proceedings of
the 2nd International Conference on Language Ressources and Evaluation (LREC), pages 1251&#8211;
1254, Ath&#232;nes, Gr&#232;ce.
</p>
<p>BENARMARA, F., HATOUT, N., MULLER, P. et OZDOWSKA, S., &#233;diteurs (2007). Actes de TALN 2007
(Traitement automatique des langues naturelles), Toulouse. ATALA, IRIT.
</p>
<p>BUCHHOLZ, S. et MARSI, E. (2006). Conll-x shared task on multilingual dependency par-
sing. In Proceedings of the 10th Conference on Computational Natural Language Lear-
ning (CoNLL-X), pages 149&#8211;164, New York City. Association for Computational Linguistics.
http ://acl.ldc.upenn.edu/W/W06/W06-2920.pdf.
CANDITO, M., CRABB&#201;, B. et FALCO, M. (2011). D&#233;pendances syntaxiques de surface pour le fran&#231;ais
- Sch&#233;ma d&#8217;annotation pour un corpus en d&#233;pendances obtenu par conversion du FrenchTreebank.
http ://alpage.inria.fr/statgram/frdep/fr_stat_dep_parsing.html.
CANDITO, M., NIVRE, J., DENIS, P. et ANGUIANO, E. H. (2010). Benchmarking of statistical
dependency parsers for french. In Proceedings of the 23rd International Conference on Computa-
tional Linguistics : Posters, COLING &#8217;10, pages 108&#8211;116, Stroudsburg, PA, USA. Association for
Computational Linguistics.
</p>
<p>CANDITO, M. et SEDDAH, D. (2012). Le corpus sequoia : annotation syntaxique et exploitation
pour l&#8217;adaptation d&#8217;analyseur par pont lexical. In Actes de TALN&#8217;2012, Grenoble, France.
</p>
<p>CARROLL, J., MINNEN, G. et BRISCOE, T. (1999). Corpus annotation for parser evaluation. In In
Proceedings of the EACL workshop on Linguistically Interpreted Corpora (LINC).
</p>
<p>KAPLAN, R., RIEZLER, S., Tracy Holloway KING, John T MAXWELL, VASSERMAN, A. et CROUCH, R.
(2004). Speed and accuracy in shallow and deep stochastic parsing. In SUSAN DUMAIS, D. M. et
</p>
<p>appel au TreeTagger et au lemmatiseur Flemm
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>681 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ROUKOS, S., &#233;diteurs : HLT-NAACL 2004 : Main Proceedings, pages 97&#8211;104, Boston, Massachusetts,
USA. Association for Computational Linguistics.
</p>
<p>MAKHOUL, J., KUBALA, F., SCHWARTZ, R. et WEISCHEDEL, R. (1999). Performance measures for
information extraction. In Proceedings of DARPA Broadcast News Workshop, Herndnon VA.
</p>
<p>DE LA CLERGERIE, E., HAMON, O., MOSTEFA, D., AYACHE, C., PAROUBEK, P. et VILNAT, A. (2008).
PASSAGE : from French Parser Evaluation to Large Sized Treebank. In ELRA, &#233;diteur : In
proceedings of the sixth international conference on Language Resources and Evaluation (LREC),
Marrakech, Morroco.
</p>
<p>M.-C. de MARNEFFE et C D MANNING (2008). The Stanford typed dependencies representation.
In Proceedings of the Workshop on Cross-Framework and Cross-Domain Parser Evaluation at
COLING 2008, pages 1&#8211;8, Manchester. Association for Computational Linguistics.
</p>
<p>Tracy Holloway KING, CROUCH, R., RIEZLER, S., DALRYMPLE, M. et Ronald M KAPLAN (2003).
The parc 700 dependency bank. In Proceedings of 4th International Workshop on Linguistically
Interpreted Corpora (LINC-03) at EACL 2003.
</p>
<p>MIYAO, Y., NINOMIYA, T., et TSUJII, J. (2004). Corpus-oriented grammar development for
acquiring a head-driven phrase structure grammar from the penn treebank. In Proceedings of
the First International Joint Conference on Natural Language Processing (IJCNLP-04), num&#233;ro
3248 de Lecture Notes in Computer Science, Hainan Island, China. Asia Federation of Natural
Language Processing, Springer.
</p>
<p>PAROUBEK, P., DE LA CLERGERIE, E., LOISEAU, S., VILNAT, A. et FRANCOPOULO, G. (2009). The
PASSAGE Syntactic Representation. In Proceedings of the 7th International Workshop on Treebanks
and Linguistic Theories, pages 91&#8211;102, Gr&#246;ningen. Netherlands Graduate Schools of Linguistics
(LOT).
</p>
<p>PAROUBEK, P., ROBBA, I., VILNAT, A. et AYACHE, C. (2006). Data, Annotations and Measures in
EASY - the Evaluation Campaign for Parsers of French. In proceedings of the fifth international
conference on Language Resources and Evaluation (LREC 2006), pages 315&#8211;320, Genoa, Italy.
ELRA.
</p>
<p>SAGAE, K., MIYAO, Y., MATSUZAKI, T., et TSUJII, J. (2008). Challenges in mapping of syntactic
representations for framework-independent parser evaluation. In Proceedings of the Workshop
on Automated Syntatic Annotations for Interoperable Language Resources at the First International
Conference on Global Interoperability for Language Resources (ICGL&#8217;08), Hong-Kong.
</p>
<p>VILNAT, A., PAROUBEK, P., de la CLERGERIE, E. V., FRANCOPOULO, G. et GU&#201;NOT, M.-L. (2010).
PASSAGE Syntactic Representation : a Minimal Common Ground for Evaluation. In CHAIR), N.
C. C., CHOUKRI, K., MAEGAARD, B., MARIANI, J., ODIJK, J., PIPERIDIS, S., ROSNER, M. et TAPIAS,
D., &#233;diteurs : Proceedings of the Seventh conference on International Language Resources and
Evaluation (LREC&#8217;10), Valletta, Malta. European Language Resources Association (ELRA).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>682 c&#65535; ATALA</p>

</div></div>
</body></html>