<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La Charte &#201;thique et Big Data : pour des ressources pour le TAL (enfin !) tra&#231;ables et p&#233;rennes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>La Charte &#201;thique et Big Data :
pour des ressources pour le TAL (enfin !)
</p>
<p>tra&#231;ables et p&#233;rennes
</p>
<p>Kar&#235;n Fort1,2,3 Alain Couillault4,5
(1) Universit&#233; de Lorraine
</p>
<p>(2) LORIA 54500 Vand&#339;uvre-l&#232;s-Nancy
(3) ATALA
</p>
<p>(4) Universit&#233; de La Rochelle
(5) APROGED
</p>
<p>karen.fort@loria.fr,alain.couillault@univ-lr.fr
</p>
<p>R&#201;SUM&#201;
La charte Ethique &amp; Big Data a &#233;t&#233; con&#231;ue &#224; l&#8217;initiative de l&#8217;ATALA 1, de l&#8217;AFCP 2, de l&#8217;APROGED 3
</p>
<p>et de CAP DIGITAL 4, au sein d&#8217;un groupe de travail mixte r&#233;unissant d&#8217;autres partenaires
acad&#233;miques et industriels (tels que le CERSA-CNRS, Digital Ethics, Eptica-Lingway, le cabinet
It&#233;anu ou ELRA/ELDA). Elle se donne comme objectif de fournir des garanties concernant la
tra&#231;abilit&#233; des donn&#233;es (notamment des ressources langagi&#232;res), leur qualit&#233; et leur impact
sur l&#8217;emploi. Cette charte a &#233;t&#233; adopt&#233;e par Cap Digital (co-r&#233;dacteur). Nous avons &#233;galement
propos&#233; &#224; la DGLFLF et &#224; l&#8217;ANR de l&#8217;utiliser. Elle est aujourd&#8217;hui disponible sous forme de wiki 5,
de fichier pdf et il en existe une version en anglais. La charte est d&#233;crite en d&#233;tails dans (Couillault
et Fort, 2013).
</p>
<p>ABSTRACT
The Ethics &amp; Big Data Charter : for tractable and lasting NLP resources
</p>
<p>The Ethics &amp; Big Data Charter was designed by ATALA, AFCP, APROGED and CAP DIGITAL, in a
working group including other academic and industrial partners (such as CERSA-CNRS, Digital
Ethics, Eptica-Lingway, It&#233;anu office or ELRA/ELDA). Its aims at ensuring the traceability and
quality of the data (including language resources), how they are produced and their impact on
working conditions. This charter has been adopted by Cap Digital (co-writer). We also proposed
it to DGLFLF and ANR. As of today, it is available as a wiki, a pdf file and an English version 6.
The charter is detailled in (Couillault et Fort, 2013).
</p>
<p>MOTS-CL&#201;S : &#233;thique, big data, ressources langagi&#232;res.
KEYWORDS: ethics, big data, language resources.
</p>
<p>1. http://www.atala.org/
2. http://www.afcp-parole.org/
3. http://www.aproged.org/
4. http://www.capdigital.com/
5. http://wiki.ethique-big-data.org
6. http://wiki.ethique-big-data.org/index.php?title=Accueil#English_Version
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>3 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>COUILLAULT, A. et FORT, K. (2013). Charte &#233;thique et big data : parce que mon corpus le vaut
bien ! In Actes de colloque international Corpus et Outils en Linguistique, Langues et Parole :
Statuts, Usages et M&#233;susages, Strasbourg, France.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>4 c&#65535; ATALA</p>

</div></div>
</body></html>