<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitements d&#8217;ellipses : deux approches par les grammaires cat&#233;gorielles abstraites</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitements d&#8217;ellipses : deux approches par les grammaires
cat&#233;gorielles abstraites
</p>
<p>Pierre Bourreau1 &#8727;
(1) SFB 991
</p>
<p>Institut f&#252;r Sprache und Information
Universit&#233; Heinrich-Heine, 40225 D&#252;sseldorf
</p>
<p>R&#201;SUM&#201;
L&#8217;&#233;tude de ph&#233;nom&#232;nes d&#8217;ellipses dans les mod&#232;les de l&#8217;interface syntaxe-s&#233;mantique pose
certains probl&#232;mes du fait que le mat&#233;riel linguistique effac&#233; au niveau phonologique est
n&#233;anmoins pr&#233;sent au niveau s&#233;mantique. Tel est le cas d&#8217;une ellipse verbale ou d&#8217;une &#233;lision
du sujet, par exemple, ph&#233;nom&#232;nes qui interviennent lorsque deux phrases reli&#233;es par une
conjonction partagent le m&#234;me verbe, ou le m&#234;me sujet. Nous proposons un traitement de
ces ph&#233;nom&#232;nes dans le formalisme des grammaires cat&#233;gorielles abstraites selon un patron
que nous intitulons extraction/instanciation et que nous impl&#233;mentons de deux mani&#232;res
diff&#233;rentes dans les ACGs.
</p>
<p>ABSTRACT
Treating ellipsis : two abstract categorial grammar perspectives
</p>
<p>The treatment of ellipsis in models of the syntax-semantics interface is troublesome as
the linguistic material removed in the phonologic interpretation is still necessary in the
semantics. Examples are particular cases of coordination, especially the ones involving verbal
phrase ellipsis or subject elision. We show a way to use abstract categorial grammars so as to
implement a pattern we call extraction/instantiation in order to deal with some of these
phenomena ; we exhibit two different constructions of this principle into ACGs.
</p>
<p>MOTS-CL&#201;S : ellipse, coordination, interface syntaxe-s&#233;mantique, grammaires cat&#233;gorielles
abstraites, grammaires d&#8217;arbres adjoints, grammaires IO d&#8217;arbres.
</p>
<p>KEYWORDS: ellipsis, coordination, syntax-semantics interface, abstract categorial grammars,
tree-adjoining grammars, IO tree-grammars.
</p>
<p>&#8727;. Ce travail a &#233;t&#233; financ&#233; par la DFG, dans le cadre du projet SFB 991 &#8220;Die Struktur von Repr&#228;sentationen in
Sprache, Kognition und Wissenschaft&#8221;.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>215 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Introduction
</p>
<p>La description de la syntaxe du langage naturel par le biais de formalismes symboliques a
donn&#233; lieu &#224; la cr&#233;ation de nombreux mod&#232;les tels que les grammaires non-contextuelles,
comme premi&#232;re approximation, et plus r&#233;cemment les grammaires cat&#233;gorielles combina-
toires (CCGs pour combinatory categorial grammars) (Steedman, 1987) ou les grammaires
d&#8217;arbres adjoints (Joshi et al., 1975; Joshi, 1985) (TAGs pour tree-adjoining grammars).
Tous ces formalismes partagent la propri&#233;t&#233; de ne pas effacer, et de ne pas copier de ma-
t&#233;riel syntaxique ou phonologique : nous parlerons de propri&#233;t&#233; de lin&#233;arit&#233;. Cependant,
certains ph&#233;nom&#232;nes syntaxiques usuels semblent n&#233;cessiter des m&#233;canismes de copie et/ou
d&#8217;effacement :
</p>
<p>(1) Marie mange une pizza, et Pierre &#949; des p&#226;tes.
(2) Jean fait un footing et &#949; rattrape Marie.
(3) Jean pr&#233;pare &#949; et Marie vend des cr&#234;pes.
</p>
<p>Sur les exemples ci-dessus, des &#233;l&#233;ments phonologiques sont absents par &#233;conomie de lan-
gage : le verbe &#8220;mange&#8221; en (1), et les syntagmes &#8220;Jean&#8221; en (2) et &#8220;des cr&#234;pes&#8221; en (3). Tous
ces &#233;l&#233;ments sont n&#233;anmoins pr&#233;sents au niveau de l&#8217;arbre syntaxique (pour la correction
grammaticale) ou de la s&#233;mantique. Par ailleurs, ces trois exemples partagent la pr&#233;sence de
la conjonction de coordination &#8220;et&#8221; reliant deux phrases. Nous nous int&#233;ressons au traitement
de ces ph&#233;nom&#232;nes d&#8217;ellipse sous la pr&#233;sence de marqueurs de coordination.
</p>
<p>Plusieurs solutions &#224; ce probl&#232;me ont &#233;t&#233; propos&#233;es afin d&#8217;&#233;tendre les formalismes grammati-
caux cit&#233;s ci-dessus. Ainsi, (Steedman, 1990) montre comment traiter de telles coordinations
dans les CCGs ; ces id&#233;es ont ensuite &#233;t&#233; impl&#233;ment&#233;es par (Sarkar et Joshi, 1996) dans les
TAGs, en &#233;tendant le formalisme initial afin d&#8217;enrichir les arbres de d&#233;rivation par une notion
de partage de noeuds, id&#233;e ensuite reprise dans (Seddah, 2008; Seddah et al., 2010). Enfin,
(Kobele, 2007) propose l&#8217;utilisation de grammaires non-contextuelles d&#8217;arbres avec copie IO
(not&#233;es IO-CFTGs pour IO context-free tree grammars).
</p>
<p>Nous proposons d&#8217;utiliser un formalisme plus expressif que les pr&#233;c&#233;dents, &#224; savoir les
grammaires cat&#233;gorielles abstraites (ACGs pour abstract categorial grammars) (de Groote,
2001; Muskens, 2001). Il est en effet possible d&#8217;encoder des grammaires de cha&#238;nes ou des
grammaires d&#8217;arbres dans les ACGs. Qui plus est, la notion de d&#233;rivation y est &#233;galement
relativement flexible puisqu&#8217;il est possible de consid&#233;rer non seulement des arbres mais aussi
des &#955;-termes comme structures de d&#233;rivation. En utilisant ces avantages, nous impl&#233;mentons
le principe suivant : une phrase o&#249; une ellipse intervient est d&#8217;abord partiellement construite,
en omettant le constituant commun, qui est rajout&#233; lors de l&#8217;&#233;tape suivante. Ce principe peut
&#234;tre naturellement r&#233;alis&#233; dans le &#955;-calcul par le biais de la substitution de termes. En suivant
ce principe, nous pr&#233;sentons deux m&#233;thodes, la premi&#232;re faisant intervenir la substitution au
niveau des structures de d&#233;rivation (ou tectogrammaire), la seconde au niveau de la syntaxe
(ou ph&#233;nogrammaire). Nous discutons des avantages de chacune des deux m&#233;thodes, et
en particulier de l&#8217;existence d&#8217;algorithmes d&#8217;analyse s&#8217;ex&#233;cutant en temps polynomial pour
chacune d&#8217;elles.
</p>
<p>Le reste de cet article est structur&#233; comme suit : en section 2, nous pr&#233;sentons les ACGs. En
section 3, les deux approches que nous proposons seront d&#233;taill&#233;es et discut&#233;es. Enfin, en
section 4, nous comparerons notre solution &#224; celles existantes dans la litt&#233;rature.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>216 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2 Grammaires Cat&#233;gorielles Abstraites
</p>
<p>Les grammaires cat&#233;gorielles abstraites peuvent &#234;tre vues comme des grammaires de &#955;-
termes simplement typ&#233;s. &#201;tant donn&#233; un ensemble de types atomiques&#65535; , nous d&#233;finissons
l&#8217;ensemble &#65535; (&#65535; ) des types simples sur&#65535; par
</p>
<p>&#65535; (&#65535; ) ::=&#65535; |(&#65535; (&#65535; )&#8594;&#65535; (&#65535; ))
Nous adopterons la notation usuelle permettant d&#8217;omettre certaines parenth&#232;ses : un type
(&#945;1 &#8594; (&#945;2 &#8594; &#945;3)) sera not&#233; &#945;1 &#8594; &#945;2 &#8594; &#945;3.
Une signature d&#8217;ordre sup&#233;rieur est un tuple &#931; = (&#65535; ,C ,&#964;) o&#249; :
&#8211; &#65535; est un ensemble fini de types atomiques.
&#8211; C est un ensemble fini de constantes.
&#8211; &#964; est une fonction d&#8217;assignation de types de C dans &#65535; (&#65535; ).
Afin de construire des termes sur une telle signature, nous nous donnons un ensemble de
variables typ&#233;es : la notation x&#945; d&#233;signera une variable x de type &#945;. &#201;tant donn&#233;s une
signature &#931; = (&#65535; ,C ,&#964;) et un type &#945; &#8712; &#65535; (&#65535; ), l&#8217;ensemble &#923;&#945;(&#931;) des &#955;-termes de type &#945;
dans &#931; se d&#233;finit par induction :
</p>
<p>1. une variable x&#945; appartient &#224; &#923;&#945;(&#931;).
2. une constante c de C appartient &#224; &#923;&#945;(&#931;) si &#964;(c) = &#945;.
3. si M est un terme de &#923;&#945;2(&#931;) et si &#945;= &#945;1 &#8594; &#945;2, alors &#955;x&#945;1 .M est un terme de &#923;&#945;(&#931;).
4. si M1 appartient &#224; &#923;&#946;(&#931;) et M2 &#224; &#923;&#946;&#8594;&#945;(&#931;), alors (M1M2) appartient &#224; &#923;&#945;(&#931;).
</p>
<p>L&#8217;ensemble des termes simplement typ&#233;s de &#931; est donn&#233; par &#923;(&#931;) = (&#923;&#945;(&#931;))&#945;&#8712;&#65535; (&#65535; ). Nous
adopterons la convention usuelle suivante : un terme (. . . ((M1M2)M3) . . .Mn) sera &#233;crit
M1M2M3 . . .Mn. De plus, nous omettrons d&#8217;&#233;crire les types des variables lorsqu&#8217;ils ne sont pas
indispensables &#224; la compr&#233;hension. Nous supposerons que les notions de variables libres et de
&#946; -r&#233;duction sont connues ; nous noterons FV (M) l&#8217;ensemble des variables libres d&#8217;un terme
M ; M1&#8594;&#8727;&#946;M2 la &#946; -r&#233;duction d&#8217;un terme M1 en M2 en un nombre arbitraire de &#946; -contractions,
et |M |&#946; la forme &#946; -normale d&#8217;un terme simplement typ&#233;. Pour plus de d&#233;tails sur le &#955;-calcul
simplement typ&#233;, le lecteur peut se r&#233;f&#233;rer &#224; (Hindley, 1997).
</p>
<p>L&#8217;ensemble Lin&#945;(&#931;) des termes lin&#233;aires de type &#945; dans &#931; est d&#233;fini par induction sur les
r&#232;gles 1. et 2. ci-dessus (en rempla&#231;ant &#923;&#945;(&#931;) par Lin&#945;(&#931;)) et :
3&#8217;. si M est un terme de Lin&#945;2(&#931;), si &#945; = &#945;1 &#8594; &#945;2 et si x&#945;1 &#8712; FV (M), alors &#955;x&#945;1 .M est un
</p>
<p>terme de Lin&#945;(&#931;).
4&#8217;. si M1 appartient &#224; Lin&#946; (&#931;), M2 &#224; Lin&#946;&#8594;&#945;(&#931;) et que FV (M1)&#8745;FV (M2) = &#65535;, alors (M1M2)
</p>
<p>appartient &#224; Lin&#945;(&#931;).
L&#8217;ensemble QAff &#945;(&#931;) des termes quasi-affines de type &#945; dans &#931; est construit par induction
sur les r&#232;gles 1., 2., 3. et la r&#232;gle suivante :
</p>
<p>4&#8221;. siM1 appartient &#224; QAff &#946; (&#931;),M2 &#224; QAff &#946;&#8594;&#945;(&#931;) et que pour toute variable x&#946; &#8712; FV (M1)&#8745;
FV (M2), &#946; &#8712;&#65535; , alors (M1M2) appartient &#224; QAff &#945;(&#931;).
</p>
<p>L&#8217;ordre (&#945;) d&#8217;un type &#945; se d&#233;finit par induction sur &#945; : si &#945; &#8712;&#65535; alors (&#945;) = 1 ; sinon,
&#945; = &#945;1 &#8594; &#945;2 et (&#945;) = max( (&#945;1) +1, (&#945;2)). Par extension, l&#8217;ordre d&#8217;une signature
&#931; = (&#65535; ,C ,&#964;) se d&#233;finit comme : (&#931;) = maxc&#8712;C( (&#964;(c))).
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>217 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Remarquons qu&#8217;il est possible de voir une signature d&#8217;arbre comme une signature d&#8217;ordre
2 : dans une telle signature, tout terme M de type atomique et tel que FV (M) = &#65535; peut
effectivement &#234;tre interpr&#233;t&#233; comme un arbre. Par exemple, l&#8217;arbre f (a, b, g(c)) peut &#234;tre
repr&#233;sent&#233; par le terme f o&#8594;o&#8594;o&#8594;oao bo(go&#8594;oco), o&#249; o est un type atomique. De plus, si toutes
les constantes d&#8217;une signature d&#8217;ordre 2 sont de type o&#8594; o (o&#249; o est un type atomique), les
termes de la signature peuvent &#234;tre interpr&#233;t&#233;s comme des cha&#238;nes : la cha&#238;ne &#8220;Jean mange
une pomme&#8221; est ainsi repr&#233;sent&#233;e par le terme &#955;xo.Jean(mange(une(pomme x))).
</p>
<p>&#201;tant donn&#233;es deux signatures &#931;1 = (&#65535;1,C1,&#964;1) et &#931;2 = (&#65535;2,C2,&#964;2), un morphisme&#65535; de
&#931;1 vers &#931;2 est d&#233;fini &#224; partir d&#8217;un couple de fonctions [&#65535;1;&#65535;2] v&#233;rifiant :
&#8211; &#233;tant donn&#233; un type &#945; &#8712; &#65535; (&#65535;1) :
</p>
<p>&#8211; &#65535; (&#945;) =&#65535;2(&#945;) &#8712; &#65535; (&#65535;2) si &#945; appartient &#224;&#65535;1.
&#8211; &#65535; (&#945;) =&#65535; (&#945;1)&#8594;&#65535; (&#945;2) si &#945;= &#945;1 &#8594; &#945;2.
</p>
<p>&#8211; &#233;tant donn&#233; un terme M de &#923;(&#931;1) :
&#8211; si M = x&#945;,&#65535; (M) = x&#65535; (&#945;) ;
&#8211; si M = c &#8712; C1 et &#964;1(c) = &#945;,&#65535; (M) &#8712; &#923;&#65535; (&#945;)(&#931;2) ;
&#8211; si M = &#955;x&#945;.N ,&#65535; (M) = &#955;&#65535; (x&#945;).&#65535; (N).
&#8211; si M = M1M2, alors&#65535; (M) =&#65535; (M1)&#65535; (M2).
</p>
<p>Finalement, une ACG G est d&#233;finie comme un tuple (&#931;1,&#931;2,&#65535; , s) o&#249; &#931;1 et &#931;2 sont deux
signatures d&#8217;ordre sup&#233;rieur (appel&#233;es respectivement signature abstraite et objet de G),&#65535;
est un morphisme de &#931;1 vers &#931;2, et s est un type atomique de &#931;1. Une telle grammaire d&#233;finit
deux langages : un langage abstrait A(G) = {M &#8712; Lin s(&#931;1) | FV (M) = &#65535;} ; un langage objet
O(G) = {M &#8712; &#923;(&#931;2) | &#8707;N &#8712; A(G), |&#65535; (N)|&#946; = M}. De mani&#232;re informelle, le langage abstrait
correspond &#224; l&#8217;ensemble des d&#233;rivations du langage O(G) g&#233;n&#233;r&#233; par la grammaire.
</p>
<p>Une ACG G est d&#8217;ordre n &#8712; &#65535; si la signature abstraite de G est d&#8217;ordre n (nous &#233;crirons que
G est une n-ACG) ; de plus, une n-ACG est dite lin&#233;aire (resp. quasi-affine) si pour toute
constante c de la signature abstraite de G,&#65535; (c) est un terme lin&#233;aire (resp. quasi-affine).
</p>
<p>&#931;DERIV
</p>
<p>&#931;SYN
</p>
<p>&#931;SURF
</p>
<p>&#931;SEM
</p>
<p>FIGURE 1 &#8211; Exemple de mod&#233;lisation de l&#8217;interface syntaxe-s&#233;mantique par des ACGs
</p>
<p>Gr&#226;ce au pouvoir expressif du &#955;-calcul, (de Groote, 2002) et (de Groote et Pogodalla, 2004)
ont montr&#233; qu&#8217;il est possible d&#8217;encoder de nombreux formalismes grammaticaux, dont les TAGs,
comme des 2-ACG lin&#233;aires. Par ailleurs, lorsqu&#8217;on adopte l&#8217;hypoth&#232;se de compositionnalit&#233;,
il est possible de repr&#233;senter l&#8217;interface syntaxe-s&#233;mantique par l&#8217;interm&#233;diaire de deux
ACGs G1 = (&#931;DERIV ,&#931;SYN,&#65535;SYN, s) et G2 = (&#931;DERIV ,&#931;SEM,&#65535;SEM, s) (voire (de Groote, 2001;
Pogodalla, 2004, 2007) pour plus de d&#233;tails). Un des avantages de ce mod&#232;le est donc de
repr&#233;senter syntaxique et s&#233;mantique en parall&#232;le, tout en traitant certains probl&#232;mes &#224; des
niveaux diff&#233;rents (par exemple, l&#8217;ordonnancement des mots peut &#234;tre trait&#233; au niveau de la
syntaxe, voire de la r&#233;alisation de surface, et non pas au niveau des d&#233;rivations). De plus, il
est facile d&#8217;isoler les diff&#233;rentes repr&#233;sentations d&#8217;une phrase, tel que montr&#233; sur la figure 1.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>218 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>3 Extraction et instanciation
</p>
<p>Comme &#233;nonc&#233; en introduction, nous souhaitons s&#233;parer la construction de phrases avec
ellipses en deux &#233;tapes : la premi&#232;re consiste &#224; construire une repr&#233;sentation incompl&#232;te ;
la seconde &#224; instancier cette repr&#233;sentation &#224; l&#8217;aide de l&#8217;&#233;l&#233;ment partag&#233;. Au niveau de
la repr&#233;sentation de surface seule une de ces occurrences sera r&#233;alis&#233;e. Ainsi, pour la
phrase &#8220;Jean mange une pizza et Pierre, des p&#226;tes&#8221;, nous pouvons consid&#233;rer que nous
avons deux constituants incomplets, &#8220;Jean &#949; une pizza&#8221; et &#8220;Pierre &#949; des p&#226;tes&#8221; qui sont re-
li&#233;s par la conjonction &#8220;et&#8221;. Le verbe &#8220;mange&#8221; est ensuite rajout&#233; &#224; chacun de ces deux
constituants, bien que non-r&#233;alis&#233; phon&#233;tiquement pour le second. Le fait de garder une
copie du constituant commun est n&#233;cessaire dans les ACGs puisque les d&#233;rivations des re-
pr&#233;sentations syntaxiques et s&#233;mantiques sont sym&#233;triques, et qu&#8217;une copie de la forme
s&#233;mantique du constituant commun est n&#233;cessaire, comme illustr&#233; dans la formule logique
(&#8707;x .Pizza(x)&#8743;Mange(x ,Jean)&#8743; (&#8707;y.PlatPates(y)&#8743;Mange(y,Pierre)) repr&#233;sentant la s&#233;-
mantique de la phrase ci-dessus. La mod&#233;lisation du principe extraction/instanciation est
r&#233;alis&#233;e de mani&#232;re relativement naturel dans le &#955;-calcul simplement typ&#233;. En effet, un objet
incomplet peut &#234;tre repr&#233;sent&#233; par un terme de la forme &#955;x .M , o&#249; x est une variable dont les
occurrences libres dans M repr&#233;sentent des emplacements vides de l&#8217;objet M . L&#8217;instanciation
de ces emplacements par un objet N est ensuite simplement r&#233;alis&#233;e par application dans le
&#955;-calcul et le terme (&#955;x .M)N est donc l&#8217;objet M o&#249; les occurrences (libres) de x (dans M)
sont substitu&#233;s par N .
</p>
<p>3.1 Enrichir les structures d&#233;rivationelles
</p>
<p>Dans ce premier mod&#232;le, nous montrons comment la construction de constituants incomplets
peut se r&#233;aliser au niveau de la signature des d&#233;rivations. Cette approche nous am&#232;ne &#224; &#233;crire
des ACGs dont l&#8217;ordre est sup&#233;rieur &#224; 2 ; en effet, &#224; une phrase &#224; laquelle il manque un verbe
transitif sera associ&#233;e une d&#233;rivation de la forme &#955;x .M , de type (np &#8594; np &#8594; s) &#8594; s ; la
conjonction de deux phrases incompl&#232;tes implique de prendre deux termes de ce type en
argument, et donc de manipuler des constantes d&#8217;ordre 4.
</p>
<p>En guise d&#8217;exemple, nous consid&#233;rons la grammaire suivante GSURF = (&#931;DERIV ,&#931;SURF,&#65535;SURF, s),
afin d&#8217;illustrer la mod&#233;lisation d&#8217;ellipses verbales :
</p>
<p>&#8211; &#931;DERIV =
</p>
<p>&#63729;&#63730;&#63731;
&#65535;DERIV = {np, s}
cJean, cLuc, cPierre, cMohamed : np caime : np&#8594; np&#8594; s
cet&#8722;TVel : &#945;&#8594; &#945;&#8594; &#945; (o&#249; &#945;= (np&#8594; np&#8594; s)&#8594; s)
</p>
<p>&#8211; &#931;SURF =
&#65535;&#65535;SURF = {&#963;} Jean,Luc,Pierre,Mohamed,aime,et : &#963;&#8594; &#963;
</p>
<p>&#8211; &#65535;SURF =
</p>
<p>&#63729;&#63732;&#63732;&#63732;&#63732;&#63732;&#63730;&#63732;&#63732;&#63732;&#63732;&#63732;&#63731;
np, s := &#963;&#8594; &#963; (not&#233; &#963;2)
cJean := &#955;x&#963;.Jeanx cLuc := &#955;x&#963;.Lucx
cMohamed := &#955;x&#963;.Mohamedx cPierre := &#955;x&#963;.Pierrex
caime := &#955;P&#963;
</p>
<p>2
Q&#963;
</p>
<p>2
x&#963;.Q(aime(Px))
</p>
<p>cet&#8722;TVel := &#955;P&#946;&#8594;&#963;
2
Q&#946;&#8594;&#963;2R&#946; x&#963;.PR(et(Q(&#955;S&#963;21 S&#963;
</p>
<p>2
</p>
<p>2 y
&#963;.S2(S1 y))x))
</p>
<p>(o&#249; &#946; d&#233;signe le type &#963;2&#8594; &#963;2&#8594; &#963;2)
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>219 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le terme MDERIV = cet&#8722;TVel(&#955;Pnp&#8594;np&#8594;s.PcLuccJean)(&#955;Pnp&#8594;np&#8594;s.PcMohamedcPierre)caime appar-
tient &#224; &#923;s(&#931;DERIV). De plus, il est possible de v&#233;rifier que &#65535;SURF(MDERIV) se &#946;-r&#233;duit en
&#955;x .Jean(aime(Luc(et(Pierre(Mohamedx))))). L&#8217;ACG ainsi obtenue est une 4-ACG lin&#233;aire.
</p>
<p>Cette construction peut s&#8217;&#233;tendre &#224; d&#8217;autres types d&#8217;ellipses, tels que les ellipses du sujet ou
de l&#8217;objet : il suffit alors de rajouter des constantes cet&#8722;Sel et cet&#8722;Oel de type (np&#8594; s)&#8594; (np&#8594;
s)&#8594; np&#8594; s dans &#931;DERIV . Comme alternative, nous pouvons envisager la g&#233;n&#233;ralisation de
cette constante &#224; un type X &#8594; X &#8594; X tel que proposer dans (Steedman, 1990).
Afin de construire la repr&#233;sentation s&#233;mantique de cet exemple, il nous suffit de cr&#233;er une
seconde ACG GSEM = (&#931;DERIV ,&#931;SEM,&#65535;SEM, s) comme suit :
&#8211; &#931;SEM =
</p>
<p>&#63729;&#63730;&#63731;
&#65535;SEM = {e, t}
J,L,P,M : e A : e&#8594; e&#8594; t
&#8743; : t &#8594; t &#8594; t
</p>
<p>&#8211; &#65535;SEM =
</p>
<p>&#63729;&#63732;&#63732;&#63732;&#63732;&#63732;&#63730;&#63732;&#63732;&#63732;&#63732;&#63732;&#63731;
np := (e&#8594; t)&#8594; t (not&#233; &#947;) s := t
cJean := &#955;Pe&#8594;t .PJ cLuc := &#955;Pe&#8594;t .PL
cMohamed := &#955;Pe&#8594;t .PM cPierre := &#955;Pe&#8594;t .PP
caime := &#955;P(e&#8594;t)&#8594;tQ(e&#8594;t)&#8594;t .P(&#955;xe.Q(&#955;ye.Ax y)
cet&#8722;TVel := &#955;P(&#947;&#8594;&#947;&#8594;t)&#8594;t1 P
</p>
<p>(&#947;&#8594;&#947;&#8594;t)&#8594;t
2 R
</p>
<p>&#947;&#8594;&#947;&#8594;t .&#8743; (P1R)(P2R)
Cette construction nous permet d&#8217;obtenir une 4-ACG (&#931;DERIV ,&#931;SEM,&#65535;SEM, s). Nous remarque-
rons, n&#233;anmoins, que cette derni&#232;re n&#8217;est ni lin&#233;aire, ni quasi-affine : en effet, la variable R a
deux occurrences libres dans un sous-terme de&#65535;SEM(cet&#8722;TVel).
Commentaires :
</p>
<p>Les deux ACGs ainsi construites sont donc des n-ACGs o&#249; n&gt; 2 ; ceci soul&#232;ve un des inconv&#233;-
nients de cette m&#233;thode, puisque nous savons que, dans ce cas, le probl&#232;me de l&#8217;appartenance
est un probl&#232;me NP-complet (Kanazawa et Yoshinaka, 2005a), lorsque l&#8217;ACG est lin&#233;aire.
</p>
<p>Du point de vue de la mod&#233;lisation linguistique, notons qu&#8217;il est possible de traiter des
cas d&#8217;ellipses multiples d&#8217;un m&#234;me constituant sans modifier notre mod&#232;le. Ainsi, afin de
pouvoir d&#233;river la phrase : &#8220;Jean aime Luc, Pierre, Mohamed et Paul, Val&#233;rie.&#8221;, nous rajoutons
la constante c,TV&#8722;el de type &#945; &#8594; &#945; &#8594; &#945; (o&#249; &#945; = (np &#8594; np &#8594; s) &#8594; s) &#224; &#931;DERIV et telle
que &#65535;SURF(c,Tv&#8722;el) = &#955;P&#946;&#8594;&#963;2Q&#946;&#8594;&#963;2R&#946; x&#963;.PR(,(Q(&#955;S&#963;21 S&#963;22 y&#963;.S2(S1 y))x)) (en consid&#233;rant
les notations de types ci-dessus). Il est int&#233;ressant de remarquer que nous obtenons alors
deux termes M1 et M2 dans &#923;s(&#931;DERIV) tels que |&#65535;SURF(M1)|&#946; et |&#65535;SURF(M2)|&#946; sont &#233;gaux &#224;
&#955;x .Jean(aime(Luc(,(Pierre(Mohamed(et(Paul(Val&#233;riex)))))))). Ces deux termes sont :
</p>
<p>1. M1 = c,TV&#8722;el(&#955;P.PcLuccJean)(&#955;Q.cet&#8722;TVel(&#955;R.RcMohamedcPierre)(&#955;R.RcValeriecPaul)Q)caime cor-
respondant &#224; la d&#233;rivation de la phrase pour le parenth&#233;sage &#8220;[Jean aime Luc, [Pierre,
Mohamed et Paul, Val&#233;rie]]&#8221; ;
</p>
<p>2. M2 = cet&#8722;TVel(&#955;Q.c,TV&#8722;el(&#955;P.PcLuccJean)(&#955;P.PcMohamedcPierre)Q)(&#955;R.RcValeriecPaul)caime cor-
respondant &#224; la d&#233;rivation de notre exemple pour le parenth&#233;sage &#8220;[[Jean aime Luc,
Pierre, Mohamed] et Paul, Val&#233;rie]&#8221; ;
</p>
<p>Par ailleurs, remarquons que le verbe n&#8217;est r&#233;alis&#233; au niveau de la surface que dans le premier
constituant gauche domin&#233; par la coordination ; dans le second cas, il est remont&#233; jusqu&#8217;au
constituant correct de mani&#232;re transitive. La grammaire reste alors une 4-ACG lin&#233;aire.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>220 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Cette construction peut s&#8217;&#233;tendre &#224; l&#8217;analyse de ph&#233;nom&#232;nes d&#8217;ellipses ench&#226;ss&#233;es comme
dans la phrase suivante en Anglais :
(4) After seeing John running a marathon, Paul planned to &#949;1, but Mary didn&#8217;t &#949;2.
</p>
<p>Apr&#232;s avoir vu John courir un marathon, Paul a pr&#233;vu de le faire, mais pas Marie.
En simplifiant quelque peu la d&#233;rivation syntaxique, cette phrase est trait&#233;e dans notre
mod&#232;le par l&#8217;interm&#233;diaire d&#8217;un terme cafterM1(&#955;P.cbutM &#65535;1M &#65535;2(cplanned&#8722;toP))crun ; le morphisme
est ensuite construit en suivant l&#8217;exemple pr&#233;c&#233;dent.
</p>
<p>Il est important de remarquer la similitude entre cette construction et certains travaux
ant&#233;rieurs sur les ACGs. En effet, cette m&#233;thode repose sur le fait de retarder la concat&#233;nation
de cha&#238;nes, de la m&#234;me mani&#232;re que (Pogodalla, 2007) utilise des ACGs d&#8217;ordre sup&#233;rieur au
niveau des d&#233;rivations afin de retarder l&#8217;ajout de mat&#233;riel linguistique, permettant ainsi de
mod&#233;liser les diff&#233;rentes port&#233;es des quantificateurs dans la repr&#233;sentation s&#233;mantique.
</p>
<p>Remarquons enfin, que nous avons mod&#233;lis&#233; la r&#233;alisation de surface sans d&#233;crire la r&#233;alisation
de l&#8217;arbre syntaxique ; cette construction ne nous apporte effectivement aucune information
suppl&#233;mentaire sur l&#8217;analyse de cette premi&#232;re mod&#233;lisation.
</p>
<p>Par ces divers exemples, nous montrons qu&#8217;il est possible de mod&#233;liser divers ph&#233;nom&#232;nes
d&#8217;ellipses de mani&#232;re simple et &#233;l&#233;gante dans les ACGs, sans modifier le formalisme. Notre
construction repose uniquement sur le fait de consid&#233;rer des termes d&#8217;ordre sup&#233;rieur au ni-
veau des d&#233;rivations. N&#233;anmoins, l&#8217;inconv&#233;nient d&#8217;une telle construction est que le traitement
de ces ph&#233;nom&#232;nes ne peut plus &#234;tre r&#233;alis&#233; en temps polynomial. Nous montrons &#224; pr&#233;sent
qu&#8217;une solution possible &#224; ce probl&#232;me consiste &#224; consid&#233;rer des ACGs d&#8217;ordre 2, et &#224; enrichir
le typage de la signature des d&#233;rivations, plut&#244;t que la structure des termes.
</p>
<p>3.2 Enrichir les types des d&#233;rivations
</p>
<p>Dans cette seconde approche, nous construisons des mod&#232;les de repr&#233;sentation de la structure
de surface &#224; partir des structures de d&#233;rivation de mani&#232;re indirecte, par l&#8217;interm&#233;diaire des
structures syntaxiques arborescentes. Ceci nous permettra, en particulier, de mettre en avant
la complexit&#233; des morphismes utilis&#233;s, cette propri&#233;t&#233; ayant un impact sur la complexit&#233; de
l&#8217;analyse dans les ACGs 1.
</p>
<p>Pour ce faire, nous introduisons un op&#233;rateur DEL d&#8217;effacement au niveau des arbres syn-
taxiques, &#224; la mani&#232;re de (Kobele, 2007) ou de l&#8217;op&#233;rateur de &#8220;deanchoring&#8221; sur les structures
de d&#233;rivation dans (Lichte et Kallmeyer, 2010). Dans notre cas, un sous-arbre domin&#233; par cet
op&#233;rateur sera interpr&#233;t&#233; comme la cha&#238;ne vide &#949; au niveau de la repr&#233;sentation de surface.
Cet op&#233;rateur n&#8217;est donc pas indispensable &#224; notre mod&#232;le, mais nous permet n&#233;anmoins de
faire appara&#238;tre l&#8217;&#233;l&#233;ment effac&#233; dans l&#8217;arbre syntaxique.
</p>
<p>Nous donnons un exemple d&#8217;un tel arbre en Figure 2, d&#233;riv&#233; par la grammaire GSURF =
(&#931;SYN,&#931;SURF,&#65535;SURF, o) d&#233;finie par :
</p>
<p>1. Nous aurions pu proc&#233;der de la m&#234;me mani&#232;re &#224; l&#8217;&#233;tape pr&#233;c&#233;dente, mais les ACGs &#233;tant alors d&#8217;ordre 3,
l&#8217;analyse n&#8217;est, a priori, d&#233;j&#224; plus r&#233;alisable en temps polynomial
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>221 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>S</p>
<p>S
</p>
<p>NP
</p>
<p>JEAN
</p>
<p>VP
</p>
<p>TV
</p>
<p>MANGE
</p>
<p>NP
</p>
<p>Det
</p>
<p>UNE
</p>
<p>N
</p>
<p>PIZZA
</p>
<p>Coord
</p>
<p>ET
</p>
<p>S
</p>
<p>NP
</p>
<p>PIERRE
</p>
<p>VP
</p>
<p>DEL
</p>
<p>TV
</p>
<p>MANGE
</p>
<p>NP
</p>
<p>Det
</p>
<p>DES
</p>
<p>N
</p>
<p>P&#194;TES
</p>
<p>FIGURE 2 &#8211; Arbre d&#233;riv&#233; pour la phrase &#8220;Jean mange une pizza et Pierre, des p&#226;tes.&#8221;
</p>
<p>&#8211; &#931;SYN =
</p>
<p>&#63729;&#63730;&#63731;
&#65535;SYN = {o}
SConj : o&#8594; o&#8594; o&#8594; o NP1,N ,Det,Coord,TV,DEL : o&#8594; o
S,NP2,V P : o&#8594; o&#8594; o JEAN, MANGE, PIERRE, UNE, DES, PIZZA, P&#194;TES, ET : o
</p>
<p>&#8211; &#931;SURF =
&#65535;&#65535;SURF = {&#963;} Jean,mange,une,des,pizza,p&#226;tes,et : &#963;&#8594; &#963;
</p>
<p>&#8211; &#65535;SURF =
</p>
<p>&#63729;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63730;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63731;
</p>
<p>o := &#963;&#8594; &#963;
SConj := &#955;P&#963;&#8594;&#963;1 P&#963;&#8594;&#963;2 P&#963;&#8594;&#963;3 x&#963;.P1(P2(P3x))
S,NP2,VP := &#955;P&#963;&#8594;&#963;1 P&#963;&#8594;&#963;2 x&#963;.P1(P2x)
N ,NP1,Det,Coord,TV := &#955;P&#963;&#8594;&#963;x&#963;.Px DEL : &#955;P&#963;&#8594;&#963;x&#963;.x
JEAN := &#955;x&#963;.Jeanx , PIERRE := &#955;x&#963;.Pierrex MANGE := &#955;x&#963;.mangex
UNE := &#955;x&#963;.unex , DES := &#955;x&#963;.desx PIZZA := &#955;x&#963;.pizzax
P&#194;TES := &#955;x&#963;.p&#226;tesx ET := &#955;x&#963;.etx
</p>
<p>Nous remarquerons que l&#8217;op&#233;rateur DEL r&#233;alise l&#8217;effacement au niveau de la cha&#238;ne de carac-
t&#232;res ; en effet, l&#8217;image de ce terme par le morphisme&#65535;SURF est un terme quasi-affine, effa&#231;ant
sur son premier argument. Ainsi, pour tout terme M , nous avons &#65535;SURF (DELM)&#8594;&#8727;&#946;&#955;x .x .
Nous pouvons alors v&#233;rifier que le terme MSYN correspondant &#224; l&#8217;arbre de la figure 2 v&#233;ri-
fie&#65535;SURF (MSYN )&#8594;&#8727;&#946;&#955;x .Jean(mange(une(pizza(et(Pierre(des(p&#226;tesx))))))) 2. Par ailleurs,
l&#8217;ACG ainsi pr&#233;sent&#233;e n&#8217;est pas lexicalis&#233;e : l&#8217;image de certaines constantes de &#931;SYN par&#65535;SURF
ne contient pas de constantes. N&#233;anmoins, nous savons qu&#8217;il est possible de construire une
2-ACG lexicalis&#233;e g&#233;n&#233;rant le m&#234;me langage (Kanazawa et Yoshinaka, 2005b).
</p>
<p>Nous d&#233;crivons &#224; pr&#233;sent, une seconde impl&#233;mentation du principe d&#8217;extraction/instanciation,
en cr&#233;ant de nouveaux types dans la signature des d&#233;rivations : le fait qu&#8217;un constituant
d&#8217;une certaine cat&#233;gorie syntaxique soit incomplet pour une autre cat&#233;gorie syntaxique sera
effectivement d&#233;not&#233; par un type distinct.
</p>
<p>En reprenant l&#8217;exemple de la figure 2, nous souhaitons donc pouvoir d&#233;river un terme de
la forme &#955;xo.M1 et un terme &#955;xo.M2 repr&#233;sentant chacun les contextes d&#8217;arbre pour &#8220;Jean
x une pizza&#8221; et pour &#8220;Pierre x des p&#226;tes&#8221;, sachant que pour ce dernier, l&#8217;occurrence de x
est domin&#233;e par une occurrence de l&#8217;op&#233;rateur DEL. Nous cr&#233;ons donc un type (not&#233; sTVel)
pour d&#233;signer les contextes d&#8217;arbre sur un verbe transitif, au niveau des d&#233;rivations. De plus,
</p>
<p>2. Il est possible de lexicaliser&#65535;SURF (DEL), en &#955;Px ., x par exemple, de mani&#232;re &#224; faire appara&#238;tre le signe de
ponctuation &#8220;,&#8221;.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>222 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#65535;SYN(sTVel) = o&#8594; o, afin de rendre compte du fait que la d&#233;rivation d&#8217;un terme de type sTVel
est un contexte d&#8217;arbre, tel que nous le codons dans le &#955;-calcul.
</p>
<p>Une constante cet est ensuite n&#233;cessaire &#224; &#931;DERIV afin de r&#233;aliser l&#8217;&#233;tape d&#8217;instanciation, mais
cette fois au niveau des termes des arbres syntaxiques ; il suffit donc de typer cette constante
par sTVel&#8594; sTVel&#8594; t v&#8594; s, un type d&#8217;ordre 2. On notera que pour ce faire, nous modifions le
type associ&#233; aux verbes transitifs de np&#8594; np&#8594; s en t v. Intuitivement, ceci revient &#224; associer
&#224; un verbe le plus grand sous-arbre dont l&#8217;unique racine est la r&#233;alisation phonologique
associ&#233;e au verbe.
</p>
<p>Afin d&#8217;illustrer notre proposition, nous donnons la grammaire GSYN = (&#931;DERIV ,&#931;SYN,&#65535;SYN, s)
d&#233;finie ci-dessous. Afin de mieux dissocier les deux &#233;tapes de notre m&#233;thode, nous isolons
l&#8217;&#233;tape d&#8217;instanciation par l&#8217;interm&#233;diaire d&#8217;une constante distincte, cSUB, le type de la variable
cet s&#8217;en trouvant alors modifi&#233; :
</p>
<p>&#8211; &#931;DERIV =
</p>
<p>&#63729;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63730;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63731;
</p>
<p>&#65535;DERIV = {s, sTVel, vpTVel,n,np, v}
cet : sTVel&#8594; sTVel&#8594; sTVel cSUB : sTVel&#8594; t v&#8594; s
c1 : np&#8594; vpTVel&#8594; sTVel c2 : np&#8594; vpTVel
c3 : n&#8594; det &#8594; np
cJean, cPierre : np cmange : t v
cune, cdes : det cpizza, cpates : n
</p>
<p>&#8211; &#65535;SYN =
</p>
<p>&#63729;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63730;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63732;&#63731;
</p>
<p>s, t v,n,np, det := o sTVel, vpTVel := o&#8594; o
cSUB := &#955;Po&#8594;o xo.Px
cet := &#955;Po&#8594;o1 Po&#8594;o2 xo.S(P1x)(Coord ET)(P2(DELx))
c1 := &#955;toPo&#8594;o xo.St(Px) c2 := &#955;to xo.VPx t
c3 := &#955;to1 t
</p>
<p>o
2.NP2t2 t1
</p>
<p>cJean := NP1JEAN, cPierre := NP1PIERRE cmange : VMANGE
cune := DetUNE, cdes := DetDES
cpizza : N PIZZA, cpates : N P&#194;TES
</p>
<p>En consid&#233;rant la signature abstraite &#931;DERIV , nous obtenons un terme Mderiv appartenant au
langage abstrait et tel que Mderiv = cSUBM1M2 o&#249;
</p>
<p>1. M1 = cet(c1cJean(c2(c3cunecpizza)))(c1cPierre(c2(c3cdescpates))) et
</p>
<p>2. M2 = cmange.
</p>
<p>Nous remarquerons que&#65535;SYN(M1) s&#8217;interpr&#232;te alors comme un contexte d&#8217;arbre, de la forme
&#955;xo.T , T &#233;tant l&#8217;arbre de la figure 2 o&#249; les occurrences du sous-arbre VMANGE sont remplac&#233;es
par x .
</p>
<p>Commentaires
</p>
<p>Tout d&#8217;abord, remarquons que l&#8217;ACG G = (&#931;DERIV ,&#931;SYN,&#65535;SYN, s) est une 2-ACG quasi-affine.
D&#8217;apr&#232;s (Bourreau et Salvati, 2011; Bourreau, 2011) ou (Kanazawa, 2007; Yoshinaka, 2006),
nous savons que le probl&#232;me de l&#8217;analyse, dans ce cas, peut &#234;tre r&#233;solu en temps polynomial.
Ce point diff&#233;rencie donc les deux approches pr&#233;sent&#233;es. Ensuite, nous remarquerons qu&#8217;il est
&#224; nouveau possible de g&#233;n&#233;raliser le type associ&#233; &#224; la conjonction cet au niveau des d&#233;rivations
en &#945;&#8594; &#945;&#8594; &#945;, avec, &#945; &#8712;&#65535;DERIV .
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>223 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N&#233;anmoins, comme nous l&#8217;avons remarqu&#233;, l&#8217;ACG (&#931;SYN,&#931;SURF,&#65535;SURF, o) n&#8217;est pas lexicalis&#233;e.
Le fait de consid&#233;rer l&#8217;ACG lexicalis&#233;e &#233;quivalente (&#931;&#65535;SYN,&#931;SURF,&#65535; &#65535;SURF, o) de (Kanazawa
et Yoshinaka, 2005b) peut a priori avoir un certain impact sur la construction de l&#8217;ACG
(&#931;DERIV ,&#931;&#65535;SYN,&#65535; &#65535;SYN, s), cette question demandant &#224; &#234;tre &#233;tudi&#233;e plus en d&#233;tails.
Par ailleurs, le choix d&#8217;introduire l&#8217;op&#233;rateur DEL n&#8217;est destin&#233; qu&#8217;&#224; faire appara&#238;tre l&#8217;occur-
rence de constituant effac&#233;e dans l&#8217;arbre syntaxique. En effet, il est possible de modifier
notre mod&#232;le de sorte que&#65535;SYN(cet) = &#955;Po&#8594;o1 Po&#8594;o2 xo.S(P1x)(Con j ET)(P2&#949;), o&#249; &#949; est alors
une constante de &#931;SYN, de type o et telle que &#65535;SURF(&#949;) = &#955;x&#963;.x&#963;. Dans cette proposition
alternative, l&#8217;ACG obtenue reste une 2-ACG lin&#233;aire.
</p>
<p>La gestion de l&#8217;effacement par enrichissement des types peut &#233;galement s&#8217;&#233;tendre &#224; l&#8217;analyse
de ph&#233;nom&#232;nes d&#8217;ellipses ench&#226;ss&#233;es comme dans la phrase (4) de la section pr&#233;c&#233;dente.
Un tel cas peut-&#234;tre trait&#233; dans notre proposition en rajoutant une &#233;tape suppl&#233;mentaire
d&#8217;extraction/instanciation, par l&#8217;interm&#233;diaire d&#8217;une constante c&#65535;SUB de type sV &#8594; vpVPinf &#8594; sV ,
et telle que &#65535;SYN(c&#65535;SUB) = &#955;Po&#8594;o1 Po&#8594;o2 to.P1(P2 t). L&#8217;utilisation d&#8217;une telle constante r&#233;alise
alors l&#8217;instanciation d&#8217;emplacements vides dans un arbre de type sV par un contexte d&#8217;arbre
de type vpVPinf . La d&#233;rivation de cet exemple est donc r&#233;alis&#233;e en construisant d&#8217;abord deux
contextes d&#8217;arbre : Le terme&#65535;SYN(c&#65535;SUB) permet alors de substituer les occurrences de x dans
</p>
<p>S
</p>
<p>S
</p>
<p>NP
</p>
<p>Paul
</p>
<p>x :VP
</p>
<p>Coord
</p>
<p>but
</p>
<p>S
</p>
<p>NP
</p>
<p>Mary
</p>
<p>VP
</p>
<p>Neg
</p>
<p>V
</p>
<p>does
</p>
<p>not
</p>
<p>DEL
</p>
<p>x :VP
</p>
<p>VP
</p>
<p>V
</p>
<p>planned to
</p>
<p>y :VPinf
</p>
<p>FIGURE 3 &#8211; Repr&#233;sentation de la d&#233;rivation pour &#8220;John planned to but Mary does not&#8221;
</p>
<p>le premier arbre par le second ; il suffit ensuite de suivre la proc&#233;dure sur notre exemple
initiale pour obtenir l&#8217;arbre souhait&#233;. Nous pouvons alors voir que l&#8217;inconv&#233;nient principal de
cette m&#233;thode est de devoir cr&#233;er de nombreux types afin de prendre en compte les diff&#233;rents
cas d&#8217;ellipses possibles, selon le constituant effac&#233;. Notons &#233;galement qu&#8217;il est possible de
construire la s&#233;mantique associ&#233;e &#224; une phrase o&#249; une ellipse a &#233;t&#233; r&#233;alis&#233;e, de mani&#232;re
similaire &#224; la construction pr&#233;c&#233;dente. Finalement, il appara&#238;t que les deux constructions
pr&#233;sent&#233;es sont li&#233;es : notre deuxi&#232;me proposition repose sur le fait de d&#233;composer les arbres
syntaxiques en unit&#233; plus petite, ce qui aboutit &#224; consid&#233;rer une ACG non-lexicalis&#233;e, et &#224;
consid&#233;rer un nombre de types plus grand. Cependant, il nous faudra &#233;tudier ce lien, et la
possibilit&#233; d&#8217;abaisser l&#8217;ordre d&#8217;une ACG tout en pr&#233;servant le langage g&#233;n&#233;r&#233;.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>224 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>4 M&#233;thodes existantes
</p>
<p>Une premi&#232;re possibilit&#233; de traitement de certains ph&#233;nom&#232;nes d&#8217;ellipse consiste &#224; reprendre
les id&#233;es de (Steedman, 1990) pour les grammaires cat&#233;gorielles combinatoires, et &#224; impl&#233;men-
ter ces id&#233;es dans les ACGs. Steedman sugg&#232;re, en particulier, l&#8217;utilisation d&#8217;un combinateur
T de &#8220;type raising&#8221; afin de traiter des ph&#233;nom&#232;nes d&#8217;&#233;lision du sujet ou de l&#8217;objet ; de plus, les
ellipses verbales n&#233;cessitent l&#8217;introduction d&#8217;un combinateur suppl&#233;mentaire Bx qui permet de
rompre avec la directionnalit&#233; du calcul logique sous-jacent, et un op&#233;rateur de d&#233;composition
de type, permettant d&#8217;extraire le verbe d&#8217;une phrase.
</p>
<p>Dans le cadre des ACGs, l&#8217;op&#233;rateur Bx n&#8217;est pas n&#233;cessaires, puisque les types ne sont pas
dirig&#233;s. l&#8217;utilisation du combinateur T revient &#224; modifier les types assign&#233;s aux constantes
de la signature des structures de d&#233;rivation. Sur un exemple, nous pouvons d&#233;crire une
signature des d&#233;rivations faite des constantes cJean, cMarie : (np &#8594; s) &#8594; s, ccour t : np &#8594; s,
crat t rape : np &#8594; np &#8594; s et cet : (np &#8594; s)&#8594; (np &#8594; s)&#8594; (np &#8594; s). Cette signature permet
de d&#233;river un terme cMarie(&#955;ynp.cJean(cet ccour t(crat t rape y))). Gr&#226;ce au morphisme &#65535;sem ci-
dessous, il est ensuite possible d&#8217;associer la forme s&#233;mantique souhait&#233;e pour la phrase &#8220;Jean
court et rattrape Marie&#8221; :
</p>
<p>&#8211; &#65535;sem =
</p>
<p>&#63729;&#63732;&#63732;&#63730;&#63732;&#63732;&#63731;
np := e s := t
cJean := &#955;Pe&#8594;t .PJ cMarie := &#955;Pe&#8594;t .PM
crat t rape := &#955;xe ye.Rx y ccour t := &#955;xe.Cx
cet := &#955;Pe&#8594;t1 Pe&#8594;t2 xe.&#8743; (P1x)(P2x)
</p>
<p>Nous remarquerons n&#233;anmoins que, la signature des d&#233;rivations que nous d&#233;crivons ci-dessus
est d&#8217;ordre sup&#233;rieur &#224; 2. Par ailleurs, il ne semble pas souhaitable, dans le cas des ACGs, de
typer tous les syntagmes nominaux par un type (np &#8594; s)&#8594; s, ce qui revient &#224; consid&#233;rer
des ACGs d&#8217;ordre sup&#233;rieur &#224; 2 pour des cas tr&#232;s simples, sans ph&#233;nom&#232;nes d&#8217;ellipses. Enfin,
l&#8217;op&#233;rateur de d&#233;composition est n&#233;cessaire dans le cas d&#8217;ellipses verbales pour les langues de
type SVO, car il permet d&#8217;extraire le verbe de la phrase en partie gauche de la conjonction.
Cet op&#233;rateur permet en fait d&#8217;effectuer le m&#234;me traitement que nous r&#233;alisons, c.a.d. de
construire des constituants incomplets puis de les composer avec le constituant commun.
Qui plus est, cet op&#233;rateur de d&#233;composition semble poser un probl&#232;me du point de vue
calculatoire car il introduit deux nouvelles formules, ce qui va &#224; l&#8217;encontre de la propri&#233;t&#233; de
la sous-formule. Enfin, notons que les ACGs permettent l&#8217;impl&#233;mentation du m&#234;me principe
de mani&#232;re plus &#233;l&#233;gante puisque, de par l&#8217;ind&#233;pendance entre d&#233;rivations et ordre des mots,
nous n&#8217;avons pas eu besoin d&#8217;enrichir le formalisme initial de nouveaux op&#233;rateurs.
</p>
<p>Des extensions des TAGs ont &#233;galement &#233;t&#233; propos&#233;es, tout d&#8217;abord dans (Sarkar et Joshi,
1996) qui proposent une impl&#233;mentation des id&#233;es de (Steedman, 1990) dans les grammaires
d&#8217;arbres adjoints, en y rajoutant une op&#233;ration de conjonction. Par ailleurs, l&#8217;objectif des
auteurs est de construire des structures d&#233;riv&#233;es qui sont des arbres avec partage de noeud.
Qui plus est, ils rendent compte de ce partage de mat&#233;riel syntaxique au niveau des d&#233;rivations,
les structures de d&#233;rivation &#233;tant &#233;galement des arbres avec partage de noeuds. Ceci est d&#251; au
fait que les structures de d&#233;rivation dans les TAGs sont cens&#233;s &#234;tre plus proches de la structure
pr&#233;dicat/argument de repr&#233;sentation s&#233;mantique d&#8217;une phrase. D&#8217;autres propositions sont
celles de (Seddah, 2008) ou (Seddah et al., 2010), qui consid&#232;rent des grammaires de tuples
d&#8217;arbres et requi&#232;rent des op&#233;rations plus complexes ; par exemple, le traitement d&#8217;ellipses
multiples se fait en ajoutant un nombre arbitraire d&#8217;arbres non-lexicalis&#233;s (appel&#233;s &#8220;ghost trees&#8221;
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>225 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>par les auteurs). L&#8217;originalit&#233; de notre m&#233;thode, par rapport &#224; celles-ci, est de pouvoir traiter
les ph&#233;nom&#232;nes d&#8217;ellipses que nous avons &#233;tudi&#233;s sans modifier le formalisme des grammaires
cat&#233;gorielles abstraites. Par ailleurs, le mod&#232;le de l&#8217;interface syntaxe s&#233;mantique dans les ACGs
permet de s&#233;parer explicitement les structures de d&#233;rivation, de la repr&#233;sentation s&#233;mantique.
Le partage d&#8217;information n&#233;cessaire au niveau des d&#233;rivations dans les TAGs, est donn&#233; au
niveau de la signature &#931;sem dans notre cas.
</p>
<p>Enfin, (Kobele, 2007) d&#233;crit plusieurs m&#233;thodes possibles dont les deux suivantes : la pre-
mi&#232;re consiste &#224; construire des contextes d&#8217;arbres, car du mat&#233;riel syntaxique est absent aux
emplacements o&#249; une ellipse a &#233;t&#233; r&#233;alis&#233;e ; l&#8217;information manquante doit alors &#234;tre retrouv&#233;e
dans l&#8217;arbre (dans le cas d&#8217;une ellipse verbale, dans le premier constituant domin&#233; par une
conjonction de coordination). La deuxi&#232;me approche de (Kobele, 2007) consiste &#224; utiliser
des grammaires non-contextuelles d&#8217;arbres avec copie IO.
</p>
<p>Les deux approches que nous proposons semblent assez proches des propositions de Kobele,
&#224; la diff&#233;rence que, plut&#244;t que de rechercher le mat&#233;riel effac&#233; dans l&#8217;arbre, nous mettons en
place un m&#233;canisme permettant de le copier. Par ailleurs, les ACGs de notre seconde approche
peuvent &#234;tre r&#233;duites &#224; des grammaires IO-CFTGs. Bien que le patron de d&#233;rivation ne soit
pas le m&#234;me que celui utilis&#233; par Kobele, il semblerait que nous ne puissions pas traiter plus
de ph&#233;nom&#232;nes que dans son approche. En particulier, Kobele montre qu&#8217;une des limites de
l&#8217;approche par des IO-CFTGs est de ne pas pouvoir traiter des ph&#233;nom&#232;nes tels que :
(5). &#8220;John wants to climb Mt. Kilimanjaro and Mary to sail around the world, and while I
know that John will &#949;1 and Mary won&#8217;t &#949;2, Bill doesn&#8217;t &#949;3&#8221;
John veut grimper le Kilimanjaro et Marie naviguer autour du monde, et alors que je sais
</p>
<p>que John le fera et pas Marie, Bill ne le sait pas
D&#8217;apr&#232;s cette construction, il serait n&#233;cessaire de garder l&#8217;ensemble des verbes utilis&#233;s dans le
constituant &#224; gauche d&#8217;une conjonction afin de pouvoir le r&#233;utiliser dans les constituants en
partie droite ; qui plus est, ce nombre de verbes est potentiellement infini, ce qui, dans notre
premi&#232;re approche nous am&#232;ne &#224; consid&#233;rer un nombre de constantes infinies cnet , n &#8712; &#65535; ;
dans notre seconde approche, il nous faudrait consid&#233;rer un nombre de types infini dans
la signature des d&#233;rivations. Ces cas d&#8217;ellipses mettent en avant la limite des traitements
propos&#233;es. Par ailleurs, ce type d&#8217;ellipses para&#238;t maladroit en Fran&#231;ais, o&#249; les pronoms sont
utilis&#233;s afin de se r&#233;f&#233;rer &#224; un syntagme pr&#233;c&#233;demment utilis&#233;. Une solution &#224; envisager est
donc d&#8217;adapter des techniques de r&#233;solution d&#8217;anaphores, &#224; partir de continuations dans le
&#955;-calcul, par exemple (de Groote, 2006), afin de r&#233;soudre les ph&#233;nom&#232;nes d&#8217;ellipse.
</p>
<p>5 Conclusion
</p>
<p>Les ph&#233;nom&#232;nes d&#8217;ellipses sont fr&#233;quents dans le langage naturel et sont des exemples de
ph&#233;nom&#232;nes non-lin&#233;aires au niveau de l&#8217;interface syntaxe-s&#233;mantique. Nous avons propos&#233;
deux approches pour le traitement d&#8217;ellipses sous coordination dans les ACGs, en utilisant le
principe d&#8217;extraction pour la construction d&#8217;une phrase incompl&#232;te, suivi d&#8217;un m&#233;canisme
d&#8217;instanciation, mod&#233;lis&#233; par la substitution dans le &#955;-calcul. Dans la premi&#232;re approche,
ce principe est directement cod&#233; au niveau des termes des structures de d&#233;rivation ; de
mani&#232;re &#233;l&#233;gante, nous pouvons alors traiter de nombreux cas d&#8217;ellipses, mais la signature
des d&#233;rivations &#233;tant d&#8217;ordre sup&#233;rieur &#224; 2, le probl&#232;me de l&#8217;analyse est, au meilleur des
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>226 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>cas, NP-complet. Dans la deuxi&#232;me approche, nous conservons une ACG d&#8217;ordre 2, mais les
m&#233;canismes d&#8217;extraction sont encod&#233;s au niveau des types utilis&#233;s dans la signature. Ceci nous
am&#232;ne alors &#224; consid&#233;rer un ensemble de types tr&#232;s grand, mais nous permet de r&#233;utiliser
des algorithmes d&#8217;analyse connus pour s&#8217;ex&#233;cuter en temps polynomial.
</p>
<p>Les deux approches ainsi propos&#233;es ne n&#233;cessitent pas d&#8217;&#233;tendre le formalisme des ACGs,
contrairement aux solutions propos&#233;es dans la litt&#233;rature, pour les TAGs ou les CCGs. N&#233;an-
moins, les mod&#233;lisations que nous proposons ne pr&#233;tendent pas r&#233;soudre des ph&#233;nom&#232;nes
d&#8217;ellipses complexes, tels que les ellipses de verbes prenant diff&#233;rentes cat&#233;gories en argument
(dans &#8220;Jean est un r&#233;publicain, et fier de l&#8217;&#234;tre&#8221;), ou encore celles faisant intervenir un zeugma
(dans &#8220;Napol&#233;on a pris du poids et beaucoup de pays&#8221;, discut&#233; dans (Seddah, 2008)). Dans ce
dernier cas, une piste est de tenter de distinguer deux signatures des d&#233;rivations &#931;DERIV&#8722;EX PR
et &#931;DERIV&#8722;STR contr&#244;lant les d&#233;rivations de l&#8217;arbre syntaxique, la premi&#232;re s&#8217;assurant de la
construction d&#8217;expressions fig&#233;es.
</p>
<p>Par ailleurs, les mod&#232;les que nous proposons reposent essentiellement sur la pr&#233;sence d&#8217;une
coordination dominant l&#8217;occurrence du syntagme effac&#233;, et ne saurait r&#233;soudre des cas
d&#8217;ellipses ou ce principe n&#8217;est pas v&#233;rifi&#233;. Enfin, et comme discut&#233; dans (Kobele, 2007), les
deux approches semblent trop limit&#233;s afin de r&#233;soudre certains cas d&#8217;ellipses faisant intervenir
de multiples verbes, et des m&#233;thodes de r&#233;solution d&#8217;anaphores pourrait se montrer plus
efficaces.
</p>
<p>Finalement, cette &#233;tude demande &#224; &#234;tre approfondie afin d&#8217;&#233;tudier plus en d&#233;tails le lien entre
les deux propositions pr&#233;sent&#233;es. En particulier, il serait int&#233;ressant de savoir quand, et &#224; quel
co&#251;t, il est possible de diminuer l&#8217;ordre d&#8217;une ACG tout en pr&#233;servant le langage g&#233;n&#233;r&#233;.
</p>
<p>Remerciements : Je remercie les rapporteurs anonymes qui ont grandement aid&#233; &#224; l&#8217;am&#233;lio-
ration de ce travail. Je tiens &#233;galement &#224; remercier Laura Kallmeyer et Timm Lichte pour les
discussions qui m&#8217;ont amen&#233;es &#224; m&#8217;int&#233;resser &#224; ce probl&#232;me.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOURREAU, P. (2011). Jeux de typage et analyse de &#955;-grammaires non-contextuelles. Th&#232;se de
doctorat, Laboratoire Bordelais d&#8217;Informatique.
BOURREAU, P. et SALVATI, S. (2011). A Datalog recognizer for almost affine &#955;-CFGs. In
(Kanazawa et al., 2011), pages 21&#8211;38.
de GROOTE, P. (2001). Towards abstract categorial grammars. In Association for Computatio-
nal Linguistics, 39th Annual Meeting and 10th Conference of the European Chapter, Proceedings
of the Conference, pages 148&#8211;155.
de GROOTE, P. (2002). Tree-adjoining grammar as abstract categorial grammar. In TAG+6,
Proceedings of the sixth International Workshop on Tree Adjoining Grammars and Related
Frameworks, pages 145&#8211;150. Universit&#224; di Venezia.
de GROOTE, P. (2006). Towards a montagovian account of dynamics. In Proceedings of
Semantics and Linguistic Theory XVI.
de GROOTE, P. et POGODALLA, S. (2004). On the expressive power of abstract categorial
grammars : Representing context-free formalisms. Journal of Logic, Language and Information,
13(4):421&#8211;438.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>227 c&#65535; ATALA</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HINDLEY, R. J. (1997). Basic Simple Type Theory. Cambridge Press University.
JOSHI, A. K. (1985). Tree-adjoining grammars : How much context-sensitivity is required
to provide reasonable strucutral descriptions ? Natural Language Parsing : Psychological,
Computational and Theoretical Perspectives, pages 206&#8211;250.
JOSHI, A. K., LEVY, L. S. et TAKAHASHI, M. (1975). Tree adjunct grammars. Journal of
Comput. Syst. Sci., 10(1):136&#8211;163.
KANAZAWA, M. (2007). Parsing and generation as Datalog queries. In Proceedings of the
45th Annual Meeting of the Association for Computational Linguistics, pages 176&#8211;183, Prague.
Association for Computational Linguistics.
KANAZAWA, M., KORNAI, A., KRACHT, M. et SEKI, H., &#233;diteurs (2011). The Mathematics of
Language - 12th Biennal Conference, MOL 12, Nara, Japan, September 2011. Proceedings,
volume 6878 de Lecture Notes in Artificial Intelligence. Springer.
KANAZAWA, M. et YOSHINAKA, R. (2005a). The complexity and generative capacity of
lexicalised abstract categorial grammars. In (Kanazawa et al., 2011), pages 330&#8211;346.
KANAZAWA, M. et YOSHINAKA, R. (2005b). Lexicalization of second-order ACGs. Rapport
technique NII-2005-012E, NII, National Institute of Informatics, Tokyo.
KOBELE, G. M. (2007). Parsing ellipsis. Unpublished Manuscript.
LICHTE, T. et KALLMEYER, L. (2010). Gapping through TAG derivations. In Procedings of the
10th International Workshop on Tree-Adjoining Grammar and Related Formalisms.
MUSKENS, R. (2001). Lambda Grammars and the Syntax-Semantics Interface. In van ROOY,
R. et STOKHOF, M., &#233;diteurs : Proceedings of the Thirteenth Amsterdam Colloquium, pages
150&#8211;155, Amsterdam.
POGODALLA, S. (2004). Computing semantic representation : Towards ACG abstract terms
as derivation trees. In Proceedings of the Seventh International Workshop on Tree Adjoining
Grammar and Related Formalisms (TAG+7), pages 64&#8211;71.
POGODALLA, S. (2007). Generalizing a proof-theoretic account of scope ambiguity. In
proceedings of IWCS-7.
SARKAR, A. et JOSHI, A. (1996). Coordination in tree adjoining grammars : formalization
and implementation. In Proceedings of the 16th conference on Computational linguistics -
Volume 2, COLING &#8217;96, pages 610&#8211;615, Stroudsburg, PA, USA. Association for Computational
Linguistics.
SEDDAH, D. (2008). The use of MCTAG to process elliptic coordination. In Proceedings of the
Ninth International Workshop on Tree Adjoining Grammars and Related Formalisms, TAG+9.
SEDDAH, D., SAGOT, B. et DANLOS, L. (2010). Control verb, argument cluster coordination
and multi component TAG. In Proceedings of the 10th International Conference on Tree
Adjoining Grammars and Related Formalisms, TAG+10.
STEEDMAN, M. (1987). Combinatory grammars and parasitic gaps. Natural Language &amp;
Linguistic Theory, 5:403&#8211;439.
STEEDMAN, M. (1990). Gapping as constituent coordination. Linguistics and Philosophy,
13:207&#8211;264.
YOSHINAKA, R. (2006). Linearization of affine abstract categorial grammars. In Proceedings
of the 11th Conference on Formal Grammar, pages 185&#8211;199, Malaga, Spain.
</p>
<p>TALN-R&#201;CITAL 2013, 17-21 Juin, Les Sables d&#8217;Olonne
</p>
<p>228 c&#65535; ATALA</p>

</div></div>
</body></html>