<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction et classification automatique de mat&#233;riaux textuels pour la cr&#233;ation de tests de langue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2002, Nancy, 24-27 juin 2002 
</p>
<p>Extraction et classification automatique de mat&#233;riaux textuels 
pour la cr&#233;ation de tests de langue 
</p>
<p> 
 Murielle Marchand 
</p>
<p>Centre de traitement &#233;lectronique des documents - CETEDOC 
 Universit&#233; catholique de Louvain 
</p>
<p>Place Blaise Pascal, 1 
1348 Louvain-la-Neuve 
</p>
<p>marchand@tedm.ucl.ac.be  
Date de la th&#232;se (&#224; d&#233;terminer) 
</p>
<p>Mots-clefs &#8211; Keywords 
</p>
<p>Automates &#224; &#233;tats finis - analyse de corpus - extraction automatique de phrases - classification 
automatique de phrases - INTEX 
</p>
<p>Finite-state automaton - corpus analysis - automatic sentence extraction -  automatic sentence 
classification - INTEX 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Nous pr&#233;sentons l&#8217;&#233;tat de d&#233;veloppement d&#8217;un outil d&#8217;extraction et de classification 
automatique de phrases pour la cr&#233;ation de tests de langue. Cet outil de TAL est con&#231;u pour, 
dans un premier temps, localiser et extraire de larges corpus en ligne du mat&#233;riel textuel 
(phrases) poss&#233;dant des propri&#233;t&#233;s linguistiques bien sp&#233;cifiques. Il permet, dans un deuxi&#232;me 
temps, de classifier automatiquement ces phrases-candidates d&#8217;apr&#232;s le type d&#8217;erreurs qu&#8217;elles 
sont en mesure de contenir. Le d&#233;veloppement de cet outil s&#8217;inscrit dans un contexte 
d&#8217;optimalisation du processus de production d&#8217;items pour les tests d&#8217;&#233;valuation. 
</p>
<p>Pour r&#233;pondre aux exigences croissantes de production, les industries de d&#233;veloppement de 
tests de comp&#233;tences doivent &#234;tre capable de d&#233;velopper rapidement de grandes quantit&#233;s de 
tests. De plus, pour des raisons de s&#233;curit&#233;, les items doivent &#234;tre continuellement remplac&#233;s, 
ce qui cr&#233;e un besoin d&#8217;approvisionnement constant. Ces exigences de production et r&#233;vision 
sont, pour ces organisations, co&#251;teuses en temps et en personnel. Les b&#233;n&#233;fices &#224; retirer du 
d&#233;veloppement et de l&#8217;implantation d&#8217;un outil capable d&#8217;automatiser la majeure partie du 
processus de production de ces items sont par cons&#233;quents consid&#233;rables.  
</p>
<p>We present here the state of development of an automatic sentence extractor and classificator 
for use in the creation of language tests. This NLP tool has been designed to, in a first 
instance, automatically locate and extract from designated on-line databases candidate source 
sentences meeting specific linguistic criteria and, in a second instance, to classify those 
sentences according to the specific types of errors they are capable of supporting. The </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Murielle Marchand 
</p>
<p>development of this NLP tool is couched in the context and goals of automated item models 
instantiating for educational assessment.  
</p>
<p>To meet increasing testing demands, assessment industries must be able to quickly produce 
large number of tests and regularly replace the items to prevent lapses in test security. The 
high number of items that must be continuously &#8216;retired&#8217; and replaced creates a great need for 
continuous item supply. Those high production and revision demands, apart from being time-
consuming, are also costly. The development and implementation of a NLP tool capable of 
automating the bulk of the processing involved in instantiating the test item models is thus of 
considerable benefit to educational testing organisations. 
</p>
<p>1 Introduction 
ETS (Educational Testing Service1) est une organisation am&#233;ricaine qui d&#233;veloppe et 
administre chaque ann&#233;e plus de 12 millions de tests de comp&#233;tences. Ces tests ont pour but 
d&#8217;&#233;valuer les aptitudes des &#233;tudiants &#224; divers moments de leur parcours scolaire et 
acad&#233;mique (le SAT, par exemple, doit &#234;tre pass&#233; par les &#233;tudiants pour entrer &#224; l&#8217;universit&#233; ; 
parmi les autres tests les plus connus on trouve le GRE, le GMAT et le TOEFL2). Pour 
r&#233;pondre aux exigences croissantes de production et de renouvellement de ses tests, ETS s&#8217;est 
tourn&#233; vers la recherche en traitement automatique du langage dans le but de cr&#233;er des 
techniques permettant, d&#8217;une part, d&#8217;aider &#224; la fabrication des tests, et d&#8217;autre part, 
d&#8217;automatiser les t&#226;ches de correction de tests. Dans ce domaine par exemple, ETS a 
d&#233;velopp&#233; E-rater, un syst&#232;me de TAL qui permet d&#8217;&#233;valuer automatiquement la qualit&#233; d&#8217;un 
essai (Burstein, 1999 ; Powers, 2000). 
</p>
<p>Le PPST (Pre-Professional Skills Tests), l&#8217;un des nombreux programmes de tests d&#233;velopp&#233; 
par ETS, vise &#224; &#233;valuer au niveau national les comp&#233;tences des futurs enseignants. Il se 
compose de trois parties destin&#233;es &#224; &#233;valuer, respectivement, les aptitudes de l&#8217; &#233;tudiant en 
math&#233;matique, en lecture et en &#233;criture. Le pr&#233;sent papier porte sur cette derni&#232;re partie du 
PPST et plus pr&#233;cis&#233;ment sur des tests &#224; choix multiples : les multiple-choice writing items. 
Ces tests ont pour but de mesurer les comp&#233;tences linguistiques &#224; l&#8217;&#233;crit d&#8217;un examin&#233; en 
termes d&#8217;accord pronom-ant&#233;c&#233;dent, d&#8217;accord sujet-verbe, de coordination, de subordination, 
de constructions comparatives et d&#8217;autres conventions de l&#8217;anglais &#233;crit3.  
</p>
<p>Automatiser la cr&#233;ation et le renouvellement des tests d&#8217;&#233;valuation offre des b&#233;n&#233;fices 
consid&#233;rables tels que l&#8217;augmentation de la capacit&#233; de production, la r&#233;duction du co&#251;t de 
d&#233;veloppement par item et &#224; terme la r&#233;duction des exigences de pr&#233;-tests4. Cette 
automatisation devrait donc permettre de mieux r&#233;pondre &#224; certaines exigences li&#233;es &#224; la 
s&#233;curit&#233; des tests.  En effet, le fait que les tests puissent &#234;tre m&#233;moris&#233;s et distribu&#233;s &#224; d&#8217;autres 
examin&#233;s dans un laps de temps relativement court limite le nombre d&#8217;utilisation que l&#8217;on 
</p>
<p>                                                 
1 http://www.ets.org 
2 http://www.ets.org/tests.html 
3 Pour des raisons de confidentialit&#233;, nous ne pouvons donner ici la liste exhaustive des crit&#232;res linguistiques 
</p>
<p>utilis&#233;s. 
4 Le phase de pr&#233;-test consiste en l&#8217;&#233;valuation de la difficult&#233; des tests cr&#233;es avant la distribution officielle de 
ceux-ci. Un groupe de personnes passent les tests apr&#232;s leur cr&#233;ation et l&#8217;on &#233;value la difficult&#233; de chaque item 
d&#8217;apr&#232;s les r&#233;sultats de ce groupe t&#233;moin.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction et classification automatique de mat&#233;riaux textuels pour la cr&#233;ation de tests de 
langue 
</p>
<p>peut en faire avant de les d&#233;clarer &#8216;inutilisables&#8217; (retired). Ainsi, pour les tests diffus&#233;s &#224; une 
&#233;chelle internationale, comme le GRE que des milliers d&#8217;examin&#233;s passent chaque ann&#233;e, 
l&#8217;exposition se doit d&#8217;&#234;tre limit&#233;e dans le temps, et cela implique une production constante de 
nouveau mat&#233;riel. Afin de r&#233;pondre &#224; cette demande de production &#224; grande &#233;chelle, ETS 
emploie un grand nombre de personnes charg&#233;es de concevoir et valider les items. Ces 
processus de validation ne sont pas seulement co&#251;teux, ils sont &#233;galement peu rentables. En 
g&#233;n&#233;ral, 1/3 seulement des tests produits passent avec succ&#232;s la phase de r&#233;vision et sont jug&#233;s 
aptes &#224; l&#8217;utilisation.  
</p>
<p>Nous pr&#233;sentons ici l&#8217;&#233;tat de d&#233;veloppement d&#8217;un outil d&#8217;extraction et de classification 
automatique de phrases dont le but est d&#8217;automatiser la majeure partie du processus de  
cr&#233;ation des multiple-choice writing items du PPST. Il s&#8217;agit plus pr&#233;cis&#233;ment de l&#8217;&#233;laboration 
d&#8217;un outil de TAL permettant, dans un premier temps, d&#8217;extraire automatiquement des 
phrases sur la base de crit&#232;res linguistiques, num&#233;riques (nombre de mots) et th&#233;matiques ; et 
dans un deuxi&#232;me temps, de classer ces phrases d&#8217;apr&#232;s les cat&#233;gories cit&#233;es plus haut (ex. 
construction comparative) et d&#8217;apr&#232;s le type d&#8217;erreur qu&#8217;elles sont en mesure de contenir, 
c'est-&#224;-dire leurs sous-cat&#233;gories (ex : construction comparative - sous-cat&#233;gorie : &#171; less A 
than B &#187;, &#171; more A than B &#187;, etc.). Une prochaine phase du projet visera &#224; int&#233;grer au syst&#232;me 
un &#171; mod&#232;le de difficult&#233; &#187; permettant de pr&#233;dire la difficult&#233; d&#8217;un item sans avoir &#224; le pr&#233;-
tester sur un groupe t&#233;moin. Ce &#171; mod&#232;le de difficult&#233; &#187; se basera sur certaines 
caract&#233;ristiques linguistiques des phrases utilis&#233;es dans les tests5.  
</p>
<p>1.1.1 Les PPST Multiple-choice writing items 
</p>
<p>Dans le PPST, les items sont des phrases d&#8217;une longueur d&#8217;environ 20 &#224; 45 mots dans 
lesquelles 4 mots ou syntagmes sont soulign&#233;s. L&#8217;examin&#233; doit choisir entre 5 options ; soit 
d&#233;busquer l&#8217;erreur et opter pour l&#8217;option A &#224; D, soit juger que la phrase est correcte et opter 
pour l&#8217;option E &#8216;no error&#8217;. Dans la figure 1 ci-dessous, l&#8217;erreur se situe au niveau A et vise &#224; 
&#233;valuer l&#8217;utilisation correcte par l&#8217;examin&#233; de la construction &#171; Between A and B &#187;.   
</p>
<p>Between 1947 to 1973, the average worker&#8217;s earnings, 
                         A 
when adjusted for inflation,  rose 61 percent, 
                                                B 
reflecting a rise in productivity. No error 
       C            D                               E 
</p>
<p>Figure 1 : Exemple de item pour le PPST 
</p>
<p>Les phrases-items dont est constitu&#233; le PPST sont g&#233;n&#233;ralement inspir&#233;es de phrases extraites 
de larges corpus, en g&#233;n&#233;ral des articles de magazines ou des articles de journaux en ligne. 
Ces corpus doivent &#234;tre continuellement renouvel&#233;s afin de r&#233;pondre &#224; la demande constante 
de production de phrases-items.  Pour r&#233;pondre &#224; ce besoin continuel de nouveaux textes, 
</p>
<p>                                                 
5 ETS a d&#233;velopp&#233; une &#233;chelle de difficult&#233; des items allant de -3.0 &#224; +3.0. Par exemple, une erreur de majuscule 
dans une phrase est consid&#233;r&#233;e comme tr&#232;s facile &#224; d&#233;tecter et est cat&#233;goris&#233;e -3.13 sur l&#8217;&#233;chelle de difficult&#233;, 
tandis qu&#8217;une erreur de ponctuation (virgule) a une difficult&#233; de -1.41.  Ces estimations statistiques sont 
obtenues par l&#8217;analyse des r&#233;sultats des &#233;tudiants dans les archives de plusieurs ann&#233;es de tests. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Murielle Marchand 
</p>
<p>nous avons connect&#233; notre syst&#232;me d&#8217;extraction &#224; un syst&#232;me qui r&#233;cup&#232;re continuellement de 
nouveaux textes sur internet (GlossaNet - Fairon, 1999).  
</p>
<p>2 Conception d&#8217;un outil d&#8217;extraction et de classification 
automatique de phrases 
</p>
<p>L&#8217;outil sur lequel porte le pr&#233;sent papier a pour but d&#8217;automatiser la s&#233;lection de phrases-
items qui approvisionnent le PPST. Il est con&#231;u &#224; partir du syst&#232;me INTEX6 pour localiser 
dans des bases de donn&#233;es en ligne (principalement des journaux) des phrases r&#233;pondant &#224; 
certains crit&#232;res linguistiques et donc susceptibles de contenir certains types d&#8217;erreurs 
sp&#233;cifiques. Le syst&#232;me extrait et classifie ces phrases d&#8217;apr&#232;s ces crit&#232;res linguistiques pour 
ensuite les proposer comme phrases-candidates &#224; un d&#233;veloppeur de test qui y introduira 
manuellement l&#8217;erreur d&#233;sir&#233;e (un projet ult&#233;rieur envisagera la g&#233;n&#233;ration automatique 
d&#8217;erreurs calibr&#233;es). 
</p>
<p>Une fois termin&#233;e la r&#233;cup&#233;ration de corpus par GlossaNet commence le processus 
d&#8217;extraction et de classification automatique des phrases. Celui-ci se d&#233;roule en 3 temps, 
comme illustr&#233; ci-dessous (&#233;tapes 2 &#224; 4) : 
</p>
<p> 
</p>
<p>Figure 2 : Extraction et de classification de phrases &#224; partir de corpus de donn&#233;es en ligne : 
m&#233;thodologie 
</p>
<p>L&#8217;analyse comprend : 
</p>
<p>                                                 
6 INTEX est un analyseur de corpus d&#233;v&#233;lopp&#233; par Max Silberztein. Pour une pr&#233;sentation des diff&#233;rentes 
</p>
<p>applications INTEX, voir Fairon 1999 et Silberztein 2000.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction et classification automatique de mat&#233;riaux textuels pour la cr&#233;ation de tests de 
langue 
</p>
<p>- une phase d&#8217;analyse de ce corpus de donn&#233;es textuelles (c&#8217;est-&#224;-dire la normalisation du 
texte par le syst&#232;me INTEX et l&#8217;application de dictionnaires &#233;lectroniques &#224; large 
couverture) ;  
- une phase d&#8217;extraction et de filtrage des phrases-candidates ; 
- une phase de classification et d&#8217;affichage de ces phrases par cat&#233;gories.  
</p>
<p>2.1 R&#233;cup&#233;ration de mat&#233;riel textuel en ligne 
</p>
<p>La m&#233;thodologie utilis&#233;e lors de la r&#233;cup&#233;ration de mat&#233;riel textuel &#224; partir de bases de 
donn&#233;es en ligne est inspir&#233;e du syst&#232;me GlossaNet (Fairon, 1999). Dans ce syst&#232;me, un 
module de t&#233;l&#233;chargement sophistiqu&#233; alimente continuellement le syst&#232;me avec de nouveaux 
textes pr&#233;lev&#233;s sur internet. Ces textes sont rassembl&#233;s et filtr&#233;s pour pouvoir &#234;tre ensuite 
utilis&#233;s par un logiciel de traitement de corpus. 
</p>
<p>2.2 L&#8217;analyse du corpus 
</p>
<p>Pour qu&#8217;un fichier-texte puisse &#234;tre trait&#233; par le syst&#232;me INTEX, il doit passer d&#8217;abord par 
une phase de normalisation (pre-processing). Il s&#8217;agit ici d&#8217;une analyse linguistique qui 
segmente le texte en unit&#233;s, les phrases, et applique ensuite sur le texte des dictionnaires de 
mots simples et de mots compos&#233;s ainsi que des transducteurs lexicaux.  
</p>
<p>2.3 L&#8217;extraction de phrases avec le syst&#232;me INTEX  
</p>
<p>La phase d&#8217;extraction des phrases-candidates consiste en l&#8217;application d&#8217;automates &#224; &#233;tats 
finis (cf. Figure 3 ci-dessous) qui localisent et extraient du corpus normalis&#233; des phrases 
r&#233;pondant &#224; certaines propri&#233;t&#233;s linguistiques.  
</p>
<p>2.3.1 Cr&#233;ation et application de graphes : 
</p>
<p>Toutes les caract&#233;ristiques linguistiques recherch&#233;es sont d&#233;crites dans des graphes ou 
&#8216;grammaires locales&#8217; (Gross, 1997). Par exemple, dans la phrase-item pr&#233;sent&#233;e plus haut 
(figure1), l&#8217;erreur introduite visait &#224; &#233;valuer la capacit&#233; de l&#8217;examin&#233; &#224; utiliser correctement la 
construction &#171; between A and B &#187;. Afin de rechercher dans une base de donn&#233;es textuelles 
d&#8217;autres phrases capables de supporter ce m&#234;me genre d&#8217;erreur (between A to B), nous avons 
d&#233;crit ce ph&#233;nom&#232;ne linguistique dans le graphe pr&#233;sent&#233; &#224; la Figure 3. 
</p>
<p>L&#8217;application de ce graphe sur le fichier-texte qui constitue notre corpus nous donne toutes les 
s&#233;quences de mots correspondant &#224; &#171; between A and B &#187; sous forme de concordance (voir 
Figure 4). Chacune des phrases ainsi extraites constitue une phrase-candidate dans laquelle on 
pourra introduire une erreur de type &#171; between A to B &#187; ou &#171; between A with B &#187;. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Murielle Marchand 
</p>
<p> 
</p>
<p>Figure 3 : Grammaire locale d&#233;crivant la s&#233;quence de mots &#171; between A and B &#187; 
</p>
<p> 
</p>
<p>Figure 4 : Concordance de type &#171; between A and B &#187; 
</p>
<p>Les phrases dans lesquelles se retrouvent les s&#233;quences de mots recherch&#233;es sont extraites du 
corpus et sauvegard&#233;es dans un fichier ind&#233;pendant. Ce m&#234;me proc&#233;d&#233; de localisation et 
d&#8217;extraction est appliqu&#233; pour chacune des erreurs-types qu&#8217;ETS cherche &#224; tester dans son 
programme PPST. 
</p>
<p>Il est important d&#8217;ajouter qu&#8217;&#224; ce niveau-ci, nous appliquons sur le corpus de base tous les 
graphes simultan&#233;ment. Cela afin de cr&#233;er un nouveau corpus de mat&#233;riel textuel qui ne </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction et classification automatique de mat&#233;riaux textuels pour la cr&#233;ation de tests de 
langue 
</p>
<p>contienne que des phrases potentiellement porteuses d&#8217;une ou de plusieurs des propri&#233;t&#233;s 
linguistiques recherch&#233;es.  
</p>
<p>2.4 Le filtrage des phrases 
</p>
<p>L&#8217;&#233;tape suivante consiste en l&#8217;application sur ce nouveau corpus d&#8217;un filtre permettant de 
limiter encore le nombre de phrases-candidates sur base de crit&#232;res num&#233;riques  et 
th&#233;matiques cette fois-ci.  
</p>
<p>Le filtre num&#233;rique (qui traite de la longueur des phrases) dispose d&#8217;une option 
permettant au d&#233;veloppeur de test de choisir le nombre de mots minimum et maximum que les 
phrases-candidates doivent contenir.  
</p>
<p>Le filtre th&#233;matique (d&#233;velopp&#233; en Perl) tient compte d&#8217;une liste de &#8216;mots interdits&#8217; 
portant sur des sujets sensibles ou discriminateurs (en terme de sexe, culture, etc.). Ce filtre 
rejette &#233;galement automatiquement les phrases contenant des anaphores, des conjonctions de 
subordination ou des pronoms faisant r&#233;f&#233;rence &#224; un ant&#233;c&#233;dent dans une phrase pr&#233;c&#233;dente.  
Les phrases doivent en effet &#234;tre compr&#233;hensibles hors contexte.  
</p>
<p>Apr&#232;s le passage de ce double filtre, nous obtenons le corpus de phrases-candidates final, 
celui sur lequel nous allons maintenant pouvoir r&#233;-appliquer chaque graphe s&#233;par&#233;ment afin 
de classer chaque phrase par cat&#233;gorie. C&#8217;est ce que nous expliquons au paragraphe suivant.  
</p>
<p>2.5 La classification des phrases  
</p>
<p>La phase de cat&#233;gorisation et de classification des phrases consiste en l&#8217;application 
individuelle de chaque graphe sur tout le corpus. Apr&#232;s application d&#8217;un graphe, les phrases 
s&#233;lectionn&#233;es par celui-ci sont automatiquement &#233;tiquet&#233;es comme appartenant &#224; la cat&#233;gorie 
linguistique d&#233;crite par le graphe. Il va de soi qu&#8217;une phrase peut repr&#233;senter plus d&#8217;une 
cat&#233;gorie linguistique. Elle peut, par exemple, contenir une construction comparative, une 
coordination ainsi qu&#8217;un accord sujet-verbe int&#233;ressant pour le d&#233;veloppeur de test. Ces 
donn&#233;es sont affich&#233;es et class&#233;es dans un fichier Access. En sortie, le d&#233;veloppeur choisira la 
cat&#233;gorie sur laquelle il veut travailler. Une liste de phrases appartenant &#224; cette cat&#233;gorie 
s&#8217;affichera avec, &#224; c&#244;t&#233; de chaque phrase, le nombre de mots ainsi que les autres cat&#233;gories 
linguistiques &#224; laquelle appartient cette phrase. Le d&#233;veloppeur pourra d&#8217;abord choisir de 
garder ou supprimer chaque phrase-candidate pour y introduire par la suite l&#8217;erreur d&#233;sir&#233;e.  
</p>
<p>3 Conclusion 
Nous avons pr&#233;sent&#233; ici l&#8217;&#233;tat de d&#233;veloppement d&#8217;un outil d&#8217;extraction et de classification 
automatique de phrases dont le but est d&#8217;optimaliser la production de tests de langue pour 
ETS. Les aspects originaux du syst&#232;me d&#233;velopp&#233; sont, d&#8217;une part, la r&#233;-utilisation et 
l&#8217;adaptation d&#8217;outils et de ressources g&#233;n&#233;riques pr&#233;existants, et d&#8217;autre part, la cr&#233;ation d&#8217;un 
syst&#232;me d&#8217;extraction autonome. De plus, nous avons expliqu&#233; en quoi un tel outil de TAL 
s&#8217;av&#233;rait maintenant indispensable pour les industries de production de tests d&#8217;&#233;valuation. Un 
syst&#232;me d&#8217;extraction et de classification automatique de mat&#233;riel textuel permet, en effet, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Murielle Marchand 
</p>
<p>parce qu&#8217;il automatise la majeure partie du processus de construction de ces tests, un gain de 
temps et de personnel consid&#233;rable.  
 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>Bejar, I. I., Stabler, E. P., &amp; Camp, R. (1987), Syntactic complexity and psychometric 
difficulty: A preliminary investigation, ETS Research Report, No. RR-87-25, Princeton, NJ, 
Educational Testing Service. 
</p>
<p>Burstein J., Chodorow M. (1999), Automated Essay Scoring for Nonnative English Speakers, 
Joint Symposium of the Association of Computational Linguistics and the International 
Association of Language Learning Technologies, Workshop on Computer-Mediated 
Language Assessment and Evaluation of Natural Language Processing. 
</p>
<p>DeMauro, G. E., Merritt, A., &amp; Adams, R. (1994), Delimiting the verbal domain, ETS 
Research Report, No. RR-94-34, Princeton, NJ, Educational Testing Service. 
</p>
<p>Fairon C. (1999) ed., Analyse lexicale et syntaxique: Le syst&#232;me INTEX, Lingvisticae 
Investigationes, Tome XXII (volume sp&#233;cial), Amsterdam/Philaldelphia, John Benjamins. 
</p>
<p>Fairon, C. (1999), Parsing a Web site as a corpus, in C. Fairon (ed.) Analyse lexicale et 
syntaxique: Le syst&#232;me INTEX, Lingvisticae Investigationes Tome XXII (volume sp&#233;cial), 
Amsterdam/Philaldelphia, John Benjamins.   
</p>
<p>Gross M. (1997), The Construction of local grammars, in E. Roche et Y. Schabes (eds), Finite 
State Language Processing, The MIT Press, Cambridge MA. 
</p>
<p>Powers D.E., Burstein J.C., Fowles M.E., Kukich K. (2000), Comparing the validity of 
automated and human essay scoring, GRE, Vol. 98-08a. 
</p>
<p>Renouf A. (1988), Corpus Development, in J.M. Sinclair (ed.), Looking up. An account of the 
COBUILD Project in lexical computing, Londres-Glasgow, Collins ELT.   
</p>
<p>Silberztein M. (1993), Dictionnaires &#233;lectroniques et analyse automatique de textes. Le 
syst&#232;me INTEX, Paris, Masson. 
</p>
<p>Silberztein M. (1998), Transducteurs pour le traitement automatique de textes, in B. Lamiroy 
(ed.), Le Lexique-grammaire, Travaux de Linguistique 37, Bruxelles, Duculot, pp. 127-142.  
</p>
<p>Silberztein M. (2000), Manuel INTEX. http://users.bestweb.net/~intex/downloads/Manuel.pdf 
</p>
<p>Sheehan, K. M. &amp; Mislevy, R. J.(2001), An inquiry into the nature of the sentence-completion 
task: Implications for item generation, ETS Research Report, No. RR-01-13. Princeton, NJ, 
Educational Testing Service. 
 
  
 
 
  </p>

</div></div>
</body></html>