<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>M&#233;thodologie pour la cr&#233;ation d&#8217;un dictionnaire distributionnel dans une perspective d&#8217;&#233;tiquetage lexical semi-automatique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2002, Nancy, 24-27 juin 2002 
</p>
<p>M&#233;thodologie pour la cr&#233;ation d&#8217;un dictionnaire distributionnel 
dans une perspective d&#8217;&#233;tiquetage lexical semi-automatique 
</p>
<p>Delphine Reymond 
</p>
<p>&#201;quipe DELIC &#8211; Universit&#233; de Provence 
29, Av. Robert Schuman, 13621 Aix-en-Provence 
</p>
<p>Delphine.Reymond@up.univ-aix.fr 
 
</p>
<p>Mots-clefs &#8211; Keywords 
</p>
<p>D&#233;sambigu&#239;sation lexicale, dictionnaire, propri&#233;t&#233;s distributionnelles, collocations, classes 
d&#8217;objets 
</p>
<p>WSD, dictionary, distributional properties, collocations, classes of objects 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Des groupes de recherche de plus en plus nombreux s'int&#233;ressent &#224; l&#8217;&#233;tiquetage lexical ou la 
d&#233;sambigu&#239;sation du sens. La tendance actuelle est &#224; l&#8217;exploitation de tr&#232;s grands corpus de 
textes qui, gr&#226;ce &#224; l'utilisation d&#8217;outils lexicographiques appropri&#233;s, peuvent fournir un 
ensemble de donn&#233;es initiales aux syst&#232;mes. A leur tour ces syst&#232;mes peuvent &#234;tre utilis&#233;s 
pour extraire plus d'informations des corpus, qui peuvent ensuite &#234;tre r&#233;inject&#233;es dans les 
syst&#232;mes, dans un processus r&#233;cursif. Dans cet article, nous pr&#233;sentons une m&#233;thodologie qui 
aborde la r&#233;solution de l&#8217;ambigu&#239;t&#233; lexicale comme le r&#233;sultat de l&#8217;interaction de divers 
indices rep&#233;rables de mani&#232;re semi-automatique au niveau syntaxique (valence), s&#233;mantique 
(collocations, classes d&#8217;objets) avec la mise en &#339;uvre de tests manuels. 
</p>
<p>More and more research groups are involved in sense tagging or sense disambiguation. The 
current trend is to use very large text corpora which, with the help of appropriate 
lexicographical tools, can provide initial data to the disambiguation systems. In turn, these 
systems can be used to extract more data from corpora, which can be fed again to the systems, 
in a bootstrapping process. In this paper, we tackle lexical disambiguation through the 
interaction of various cues which can be detected semi-automatically at the syntactic and 
semantic levels (valency, collocations, object classes), along with manual tests. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p> 
</p>
<p>1 Introduction 
</p>
<p>Ce travail de th&#232;se part d&#8217;une r&#233;flexion sur le probl&#232;me de la d&#233;sambigu&#239;sation lexicale, 
probl&#232;me fondamental dans le domaine de la linguistique computationnelle (Ide &amp; V&#233;ronis, 
1998). Le traitement de la polys&#233;mie &#233;tant particuli&#232;rement d&#233;licat, on constate 
malheureusement qu&#8217;&#224; l&#8217;inverse des syst&#232;mes d&#8217;&#233;tiquetage morpho-syntaxique qui ne cessent 
de s&#8217;am&#233;liorer, les syst&#232;mes d&#8217;&#233;tiquetage lexical ne progressent gu&#232;re. La d&#233;sambigu&#239;sation 
consiste &#224; d&#233;terminer la signification qu&#8217;un mot peut avoir dans un contexte particulier par 
rapport &#224; la liste des sens d&#8217;un dictionnaire. Certains travaux  (V&#233;ronis, 2001) ont d&#233;montr&#233; 
que les dictionnaires usuels tels le Petit Larousse sont inad&#233;quats quand il s&#8217;agit d&#8217;&#233;tiqueter le 
sens des mots. En effet, la performance &#171; humaine &#187; sur l&#8217;identification des &#171; sens &#187; est 
particuli&#232;rement m&#233;diocre. Le bilan n&#8217;est gu&#232;re encourageant car il est difficile d&#8217;esp&#233;rer de 
meilleurs r&#233;sultats par un traitement automatique, si la performance humaine n&#8217;est que peu 
concluante pour ce genre de t&#226;che. 
</p>
<p>Notre attention s&#8217;est port&#233;e vers le d&#233;veloppement de connaissances lexicales &#224; partir de 
grands corpus textuels pour la constitution d&#8217;un dictionnaire distributionnel. Dans cette 
perspective, nous pensons qu&#8217;il est plus int&#233;ressant de lister un mot et ses usages possibles en 
contexte plut&#244;t que ses diff&#233;rentes acceptions. Cette approche n&#8217;est pas nouvelle puisque d&#232;s 
les ann&#233;es 20, Meillet affirmait que &#171; le sens d'un mot ne se laisse d&#233;finir que par une 
moyenne entre [ses] emplois linguistiques &#187;. Wittgenstein prenait en 1953 une position 
analogue (&#171; Do not look for the meaning, but for the use &#187;). Cette vision distributionnaliste n'a 
pourtant &#233;t&#233; impl&#233;ment&#233;e que de fa&#231;on tr&#232;s partielle en lexicographie. 
</p>
<p>La lexicologie anglaise a &#233;t&#233; la premi&#232;re &#224; fournir des ressources linguistiques offrant une 
approche distributionnelle de la langue &#224; partir de l'examen syst&#233;matique de corpus 
informatis&#233;s : le LDOCE1 et l'OALD2, par exemple, incluent des codes syntaxiques et 
s&#233;mantiques d&#233;crivant de fa&#231;on grossi&#232;re le fonctionnement des lexies, et leurs versions 
&#233;lectroniques ont largement &#233;t&#233; utilis&#233;es pour le T.A.L.. Pour le fran&#231;ais, les ressources 
lexicales informatis&#233;es relevant l'usage des mots dans les corpus sont &#224; peu pr&#232;s inexistantes, 
m&#234;me si la r&#233;cente informatisation du Tr&#233;sor de la Langue Fran&#231;aise laisse entrevoir des 
perspectives d'exploitation. Les dictionnaires de sp&#233;cialit&#233;s d&#233;crivant l'usage en corpus 
commencent &#224; &#234;tre publi&#233;s, comme le DAFA3 (Binon &amp; al, 1999), bas&#233; sur un corpus de 25 
millions de mots, qui pr&#233;sente quelques 3200 mots avec leurs contextes d&#8217;emploi, collocations 
et o&#249; chaque article d&#233;crit un champ s&#233;mantique (synonymes, antonymes, hyperonymes, etc). 
</p>
<p>Notre m&#233;thodologie s&#8217;inspire en partie du dictionnaire explicatif et combinatoire de Mel&#8217;Cuk 
(1995) o&#249; les propri&#233;t&#233;s distributionnelles permettent de formaliser la distribution d'un 
pr&#233;dicat (ou lexie) dans une phrase consid&#233;r&#233;e comme repr&#233;sentative de l&#8217;usage en contexte. 
La d&#233;marche est cependant diff&#233;rente puisque le corpus est utilis&#233; comme base empirique et 
non comme outil de v&#233;rification. De plus, notre approche est purement discriminante et non 
d&#233;finitoire.  Le corpus et le dictionnaire interagissent : le premier est l&#8217;outil de r&#233;f&#233;rence pour 
</p>
<p>                                                 
1 Longman Dictionary of Contemporary English 
</p>
<p>2 Oxford Advanced Learner&#8217;s Dictionary 
</p>
<p>3 Dictionnaire d'Apprentissage du Fran&#231;ais des Affaires </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodologie pour la constitution de dictionnaire distributionnel dans une perspective 
d&#8217;&#233;tiquetage lexical semi-automatique 
</p>
<p> 
</p>
<p>l&#8217;&#233;laboration du dictionnaire qui a son tour va devenir l&#8217;outil de r&#233;f&#233;rence pour l&#8217;&#233;laboration 
de corpus annot&#233;s. Nous essayons de constituer un dictionnaire bas&#233; sur un ensemble de 
crit&#232;res diff&#233;rentiels les plus stricts possibles, cod&#233;s dans l'entr&#233;e lexicale et pouvant 
constituer ult&#233;rieurement autant d'indices exploitables par des machines pour discriminer le 
sens des mots en contexte (Reymond, 2001). A ce stade, notre travail se pr&#233;sente sous la 
forme d&#8217;un dictionnaire distributionnel de 60 vocables polys&#233;miques (20 noms, 20 verbes et 
20 adjectifs) o&#249; chaque occurrence (environ 60 000 au total) a &#233;t&#233; &#233;tiquet&#233;e manuellement 
dans un corpus d&#8217;un million de mots. 
</p>
<p>2 Typologie des indices 
</p>
<p>2.1 Valence 
</p>
<p>La notion de valence est primordiale puisqu&#8217;elle est fond&#233;e sur les restrictions s&#233;lectionnelles 
entre un pr&#233;dicat et ses d&#233;pendants. De nombreux travaux se sont pench&#233;s sur l&#8217;&#233;tude de la 
valence verbale comme le projet Proton (Van den Eynde &amp; Mertens, 2001) qui utilise les 
propri&#233;t&#233;s discriminatoires des paradigmes de pronoms. Dans notre approche, nous limitons la 
description du r&#233;gime syntaxique d&#8217;une lexie au nombre d&#8217; &#171; actants &#187; qu&#8217;elle accepte sans 
distinction pr&#233;cise entre actants, circonstants ou adjonctions (ex : Xqqn donne Yqqch &#224; Zqqn). 
</p>
<p>Les indices syntaxiques sont porteurs d&#8217;informations lexicales et ils sont en partie 
automatiquement d&#233;tectables par une analyse partielle (&#171; shallow parsing &#187;). A l&#8217;aide d&#8217;un 
outil &#233;labor&#233; de concordance (CooLox4) sur corpus &#233;tiquet&#233; morpho-syntaxiquement, nous 
pouvons d&#233;crire une cible et ses contextes par une m&#233;ta-expression r&#233;guli&#232;re o&#249; les propri&#233;t&#233;s 
morpho-syntaxiques des mots du corpus peuvent &#234;tre int&#233;gr&#233;es dans la requ&#234;te (Audibert, 
2001). 
</p>
<p>Prenons l&#8217;exemple des constructions [verbe + pr&#233;position] pour lesquelles le corpus de 
r&#233;f&#233;rence5 pr&#233;alablement &#233;tiquet&#233; par Cordial 7 Analyseur6, offre un grand nombre de 
contextes d&#8217;emplois diff&#233;rents (r&#233;pondre de qqch/qqn, passer par, en venir &#224;, etc.). La figure 
1 illustre la requ&#234;te qui permet d&#8217;extraire toutes les lignes de concordance dont la cible est une 
occurrence dont l&#8217;&#233;tiquette morpho-syntaxique (EMS) commence par &#171; V &#187; (verbe), suivie 
d'une occurrence dont l&#8217;&#233;tiquette commence par &#171; PREP &#187; (pr&#233;position). On obtient 
l&#8217;affichage de la figure 2. 
</p>
<p> 
Figure 1 : Requ&#234;te sur les propri&#233;t&#233;s morpho-syntaxiques des mots [V+PREP]  
</p>
<p>                                                 
4 CooLox disponible sur http://laurent.audibert.free.fr/Pages/Recherche/Lox/Lox.htm 
5 Corpus SyntSem, d&#8217;environ 5 millions de mots, constitu&#233; d&#8217;&#339;uvres litt&#233;raires (A), de textes journalistiques (M), 
</p>
<p>de p&#233;riodiques (P) et d&#8217;ouvrages scientifiques (O). 
</p>
<p>6 Cordial 7 Analyseur. &#169; 2000 Synapse D&#233;veloppement. http://www.synapse-fr.com/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p> 
</p>
<p> 
</p>
<p> Figure 2 : Lignes de concordances extraites 
</p>
<p>La recherche peut &#234;tre affin&#233;e par l&#8217;&#233;criture d&#8217;une m&#233;ta-expression r&#233;guli&#232;re combinant 
plusieurs propri&#233;t&#233;s des mots (mot, lemme, EMS, etc.) comme dans l&#8217;exemple de la figure 3 : 
on affiche les lignes de concordances dont la cible est une occurrence du lemme passer suivie 
d&#8217;une occurrence du lemme pour suivie d&#8217;un nom qui appara&#238;t dans un contexte de 0 &#224; 3 mots 
maximum apr&#232;s la pr&#233;position. 
</p>
<p> 
</p>
<p>Figure 3 : Requ&#234;te sur les lemmes et les propri&#233;t&#233;s morpho-syntaxiques des mots 
</p>
<p>L&#8217;utilisation de ce type d&#8217;outil lexicographique permet d&#8217;extraire par la simple description de 
patrons distributionnels toutes les occurrences d&#8217;une lexie &#171; candidate &#187; figurant dans le 
dictionnaire. Apr&#232;s une v&#233;rification manuelle, chaque occurrence peut recevoir l&#8217;&#233;tiquette 
s&#233;mantique appropri&#233;e de mani&#232;re automatique en la rajoutant dans la colonne ins&#233;r&#233;e apr&#232;s 
l'occurrence cible (figure 4). Le corpus est donc progressivement enrichi selon un m&#233;canisme 
it&#233;ratif. 
</p>
<p> 
</p>
<p>Figure 4 : Exemple d&#8217;&#233;tiquetage lexical manuel 
</p>
<p> 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodologie pour la constitution de dictionnaire distributionnel dans une perspective 
d&#8217;&#233;tiquetage lexical semi-automatique 
</p>
<p> 
</p>
<p>2.2 Combinaisons de mots 
</p>
<p>2.2.1 Cooccurrence, collocation et figement 
</p>
<p>Paradoxalement, la langue est &#171; r&#233;guli&#232;rement &#187; complexe. La complexit&#233; s&#8217;apparente au fait 
que les mots peuvent se combiner entre eux de fa&#231;on tr&#232;s libre, ce qui rend difficile toute 
syst&#233;matisation descriptive. A l&#8217;inverse, on note pourtant des affinit&#233;s de mots les uns pour les 
autres qui rendent pr&#233;dictibles certains sch&#233;mas de construction. Ces affinit&#233;s ont re&#231;u 
diverses d&#233;nominations. Igor Mel&#8217;Cuk parle de phras&#232;me ou semi-phras&#232;me que Bernard 
Pottier d&#233;crirait plut&#244;t comme lexie complexe ; on note &#233;galement les appellations expression 
idiomatique, locution et bien entendu collocation. Chez Gaston Gross (1996), le ph&#233;nom&#232;ne 
est appel&#233; figement. Les collocations figurent dans la plupart des dictionnaires traditionnels 
mais on les retrouve g&#233;n&#233;ralement dans les exemples qui sont peu nombreux. D&#8217;un autre c&#244;t&#233;, 
les dictionnaires de collocations se d&#233;veloppent, tel le Dictionary of English Word 
Combinations (18 000 entr&#233;es et 90 000 collocations) qui offre une excellente description du 
fonctionnement de la langue anglaise. 
</p>
<p>La fronti&#232;re entre restriction, collocation et (semi-)figement est extr&#234;mement difficile &#224; 
&#233;tablir. Une combinaison semi-fig&#233;e de mots n&#8217;est-elle pas une collocation ? Parfois, un 
groupe de mots en collocation forme une locution plus ou moins fig&#233;e. Katz et Fodor (1964) 
se r&#233;f&#232;rent &#224; des restrictions de s&#233;lection de type bool&#233;en pour contraindre l&#8217;interpr&#233;tation 
s&#233;mantique. Par exemple, le mot &#171; bordeaux &#187; d&#233;signe aussi bien une couleur que du vin. 
Dans le contexte &#171; Marie boit du bordeaux &#187; le sens de vin est par &#233;limination le seul 
disponible car le verbe boire implique une restriction sur l&#8217;objet direct d&#233;crite par la classe des 
&lt;liquides&gt;. Les exemples suivants tir&#233;s du corpus, montrent que le choix du sens appropri&#233; 
d&#8217;un mot en contexte peut &#234;tre s&#233;mantiquement restreint par les &#233;l&#233;ments en cooccurrence : 
</p>
<p>1) r&#233;parer, remettre &#224; neuf les organes (d&#8217;un v&#233;hicule) mais *r&#233;parer, 
remettre &#224; neuf les organes sexuels 
</p>
<p>2) transplantation, don d&#8217;organes mais *transplantation, don, trafic 
d&#8217;organes de traction / de roulement 
</p>
<p>Notre attention s'est donc principalement tourn&#233;e vers l&#8217;&#233;tude des cooccurrences. Le corpus de 
r&#233;f&#233;rence &#233;tant &#233;tiquet&#233; morpho-syntaxiquement, nous avons pu d&#233;nombrer dans un contexte 
maximum de trois mots &#224; gauche et &#224; droite, quelles sont les cooccurrences de mots les plus 
fr&#233;quentes entre les principales parties du discours. Par exemple, le vocable concentration 
poss&#232;de environ 246 occurrences dans le corpus. La combinaison N1 de N2 la plus fr&#233;quente 
est camp de concentration (11 occurrences soit 4%), qui est &#233;galement le premier niveau de 
sens pour l'entr&#233;e. 
</p>
<p>Ce premier rep&#233;rage de &#171; surface &#187; peut alors &#234;tre compl&#233;t&#233; par un travail manuel de filtrage 
visant &#224; distinguer parmi les combinaisons les plus fr&#233;quentes celles qui sont purement 
&#171; accidentelles &#187;, collocationnelles ou fig&#233;es. Quand il s'agit de collocations, nous avons veill&#233; 
&#224; ce qu'elles soient &#233;galement tri&#233;es en fonction de la cat&#233;gorie grammaticale et de la place des 
&#233;l&#233;ments r&#233;gis ou recteurs. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p> 
</p>
<p>T Adj Concentration verticale 
Formation continue 
</p>
<p> SPrep D&#233;tention d&#8217;armes 
Compagnie des eaux, de chemin de fer 
</p>
<p>S N Op&#233;ration de concentration 
Condition, lieu, centre de d&#233;tention 
</p>
<p> V(O) Amender, r&#233;viser, modifier, adopter, r&#233;diger la 
constitution 
</p>
<p>Tableau 1 : tableau des collocations avec les &#233;l&#233;ments r&#233;gis (T) et recteurs (S) 
Nous estimons que la cooccurrence est un degr&#233; plus ou moins fort de restriction et qu&#8217;elle se 
situe &#224; plusieurs niveaux (lexical ou syntaxique), le plus bas &#233;tant la collocation et le plus 
&#233;lev&#233; &#233;tant le figement. Nous distinguerons et &#233;tudierons les ph&#233;nom&#232;nes suivants : 
</p>
<p>1. Les figements ou semi-figements d&#232;s lors que l&#8217;on observe un blocage syntactico-
s&#233;mantique (ex : au pied de la lettre, conduire le cotillon, etc). 
</p>
<p>2. Les collocations grammaticales pour lesquelles on observe un lien entre un mot et une 
pr&#233;position (r&#233;pondre de qqch, se mettre &#224; qqch) ou une construction grammaticale (il 
ne se passe pas x temps sans que, il est courant de). 
</p>
<p>3. Les collocations lexicales en majorit&#233; repr&#233;sent&#233;es par des combinaisons binaires entre 
les principales parties du discours et dont voici quelques exemples tir&#233;s du corpus : 
</p>
<p>V-N : Couvrir une zone, arr&#234;ter une date, conduire une voiture, 
exercer des pressions 
ADJ-N : horloge biologique, effets secondaires, communication 
politique, concentration verticale, eau courante, air frais, haute 
antiquit&#233; 
N1-N2 ou N1 de N2 : Chef-adjoint, gouverneur-chef, barrage-
r&#233;servoir, station-service, chef de famille / de file, formation du 
personnel 
ADV-ADJ : fort utile 
ADV-V ou V-ADV : bien se conna&#238;tre, se mettre debout 
V-ADJ : passer inaper&#231;u 
</p>
<p>L&#8217;analyse quantitative des mots du voisinage est une m&#233;thode statistique couramment utilis&#233;e. 
Daille (1994) s&#8217;est int&#233;ress&#233;e entre autres aux relev&#233;s des fr&#233;quences pour les constructions N1 
de N2. Sur ce mod&#232;le, nous pouvons fournir les fr&#233;quences d&#8217;association pour les couples 
[verbe-objet]. L&#8217;exemple suivant illustre une extraction des cooccurrences nominales 
apparaissant dans une fen&#234;tre de 3 mots &#224; droite du lemme ouvrir tri&#233;es sur la fr&#233;quence. 
Toutes les donn&#233;es ne figurent pas dans le tableau. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodologie pour la constitution de dictionnaire distributionnel dans une perspective 
d&#8217;&#233;tiquetage lexical semi-automatique 
</p>
<p> 
</p>
<p>Lemmes Fr&#233;quence absolue 
ouvrir - porte 36 
ouvrir - oeil 20 
</p>
<p>ouvrir - bouche 11 
ouvrir - fen&#234;tre 11 
</p>
<p>ouvrir - bras 5 
ouvrir de grand oeil 4 
</p>
<p>ouvrir - porti&#232;re 4 
ouvrir - porte 4 
</p>
<p>&#8230; &#8230; 
ouvrir  - boutique 1 
ouvrir  -  passage 1 
</p>
<p>Tableau 2 : d&#233;nombrement des constructions V(ouvrir)-N dans le corpus SyntSem 
</p>
<p>Certaines paires de mots (ouvrir un passage) ne sont pas tr&#232;s fr&#233;quentes bien que tr&#232;s 
famili&#232;res, ce qui soul&#232;ve le probl&#232;me de la taille et de la repr&#233;sentativit&#233; du corpus, que nous 
n&#8217;aborderons pas ici. 
</p>
<p>2.2.2 Traits et classes d&#8217;objets 
</p>
<p>Selon la plupart des grammairiens, les phrases sont constitu&#233;es d&#8217;op&#233;rateurs qui se 
d&#233;terminent par la nature des arguments qu&#8217;il peuvent recevoir. Certaines de nos lexies sont 
subdivis&#233;es en traits syntactico-s&#233;mantiques qui permettent de pr&#233;ciser les qualit&#233;s de 
l&#8217;op&#233;rateur. Les traits les plus utilis&#233;s sont : anim&#233;, non anim&#233;, concret, abstrait, etc. On peut 
par exemple, opposer un organe politique &#224; un organe femelle o&#249; le premier emploi d&#233;crit la 
cible comme &#233;tant anim&#233; humain et le second comme &#233;tant concret. Cette classification en 
trait est acceptable mais dans certains cas, elle s&#8217;av&#232;re insuffisante surtout en vue d&#8217;un 
encodage ou d&#8217;un d&#233;codage automatique. Consid&#233;rons les deux exemples suivants :  
</p>
<p>(M) La police arr&#234;te plusieurs Thai &#224; Anvers, dont Santi. 
</p>
<p> (A) Sa majest&#233; lui arracha des mains le citron [&#8230;] quand 
l&#8217;archev&#234;que l&#8217;arr&#234;tant lui dit &#224; l&#8217;oreille :&#8230; 
</p>
<p>o&#249; les sujets et objets re&#231;oivent la caract&#233;ristique anim&#233; humain mais o&#249; les lexies semblent 
distinctes. L&#8217;application d&#8217;un simple test manuel comme la d&#233;rivation du verbe en nom 
confirme cette supposition : l&#8217;arrestation de qqn par qqn mais l&#8217;arr&#234;t de qqn par qqn. 
</p>
<p>L&#8217;alternative que nous avons choisie est celle propos&#233;e par Gaston Gross (1997) et le LLI7 qui 
pr&#233;conise l&#8217;emploi de classes d&#8217;objets (Le Pesant &amp; Mathieu-colas, 1998) dont les divers 
&#233;l&#233;ments sont caract&#233;ris&#233;s par les pr&#233;dicats appropri&#233;s. La t&#226;che consiste alors &#224; dresser la 
liste de tous les membres d&#8217;une classe d&#8217;objets en position sujet ou objet et par la m&#234;me 
occasion d&#8217;en d&#233;crire le comportement syntaxique. 
</p>
<p>                                                 
7 Laboratoire de Linguistique Informatique </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p> 
</p>
<p>Porter, V Exemple du corpus 
</p>
<p>&lt;marque informative&gt; Porter une signature, la mention, une inscription 
</p>
<p>&lt;d&#233;nomination&gt; Porter le nom, le surnom, le titre (de) 
</p>
<p>&lt;v&#234;tement, accessoire&gt; Porter un chapeau, des lunettes, un manteau, une robe, un uniforme 
</p>
<p>&lt;foetus&gt; La femelle porte les petits, elle porte un enfant 
</p>
<p>&lt;partie du corps&gt; + Adv Porter haut la t&#234;te, la t&#234;te basse, le chef branlant 
</p>
<p>&lt;Instrument, arme&gt; qui porte Clairon, trompe qui porte haut / loin 
</p>
<p>&lt;compliment, sentiment&gt; qui porte Argument qui porte mais *argument qui porte haut / loin 
</p>
<p>&lt;ph&#233;nom&#232;ne climatique&gt; qui porte Vent, force, courant qui porte quelque part 
</p>
<p>Station, N Exemple du corpus 
</p>
<p>Station &lt;poste &#233;metteur&gt; Station radiophonique, de t&#233;l&#233;vision, d&#8217;&#233;mission 
</p>
<p>Station &lt;de recherches, d&#8217;observations&gt; Station g&#233;ophysique, spatiale, sismologique 
</p>
<p>Station &lt;lieu d&#8217;activit&#233; touristique&gt; Station baln&#233;aire, de ski, de campagne 
</p>
<p>Station &lt;lieu d&#8217;arr&#234;t pour transport&gt; Station de m&#233;tro, de train 
</p>
<p>Station &lt;ressources, services&gt; Station service, d&#8217;&#233;puration, de pompage 
</p>
<p>Station &lt;position du corps&gt; La station debout 
</p>
<p> Tableau 3 : utilisation des classes d&#8217;objets pour la description de lexies 
</p>
<p>3 Autres crit&#232;res diff&#233;rentiels et tests manuels 
</p>
<p>Les limites de l'automatisation des indices de surface marquent le champ de travail qu'il reste 
&#224; effectuer manuellement pour mener &#224; bien la repr&#233;sentation et le classement des unit&#233;s 
lexicales.  
</p>
<p>a) Sur les 20 adjectifs trait&#233;s, tr&#232;s peu d&#8217;emplois sont identifiables par un comportement 
syntaxique plus ou moins fig&#233; (ex : &#234;tre utile &#224;, il est courant de). Le tableau 4 
pr&#233;sente l&#8217;entr&#233;e simplifi&#233;e de l &#8216;adjectif frais pour lequel les lexies sont d&#233;crites en 
fonction des synonymes et antonymes substituables sur l&#8217;axe paradigmatique. 
</p>
<p>Frais, Adj. Exemple du corpus 
&#8776; froid Vent frais, zone fra&#238;che 
&#26;  pollu&#233; Air frais  
&#26;  vieux Traces fra&#238;ches, herbe fra&#238;che 
&#8776; pur Voies fra&#238;ches 
&#26;  En conserve, rassis, avari&#233; Viande fra&#238;che, poisson, l&#233;gume, &#339;uf, produit frais 
&#8776; Repos&#233;, en forme&#26;  fatigu&#233; &#202;tre frais et dispos 
</p>
<p>Tableau 4 : synonyme approximatif (&#8776;) et antonyme approximatif (&#26; ) 
b) La position de l&#8217;&#233;pith&#232;te (ant&#233;pos&#233; ou postpos&#233; au nom) nous semblait &#234;tre 
</p>
<p>potentiellement significative, mais nous n&#8217;avons pas relev&#233; de cas suffisamment 
convaincants qui pourrait attester de la pertinence de la distribution de l&#8217;adjectif autour 
du noyau nominal. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>M&#233;thodologie pour la constitution de dictionnaire distributionnel dans une perspective 
d&#8217;&#233;tiquetage lexical semi-automatique 
</p>
<p>Une salle, poche, voix pleine (? une pleine salle, poche, voix) 
Population, cellule saine (? une saine cellule, population) 
Une simple co&#239;ncidence, constatation, fait (? une co&#239;ncidence simple, 
un fait simple), une pleine lune ( ? une lune pleine) 
</p>
<p>c) Les tests portant sur la d&#233;rivation diff&#233;rentielle avec conservation de la valence, 
nominalisation quand il s&#8217;agit d&#8217;un verbe ou verbalisation dans le cas d&#8217;un nom, sont 
relativement efficaces. 
</p>
<p>(M) Il fallut tirer &#224; la mitraillette lourdeDle tir &#224; la mitraillette 
lourde  mais *le tirage &#224; la mitraillette lourde 
(A) Je vous apporterai un livre et vous le tirerez &#224; 5000. Dle tirage &#224; 
5000  mais *le tir &#224; 5000  
</p>
<p>d) Nous avons introduit la notion de classes d&#8217;objets pour l&#8217;identification des usages et le 
classement des cooccurrences. Parall&#232;lement, nous avons observ&#233; que lorsque 
plu ceptent un m&#234;me hyperonyme c&#8217; ppartiennent &#224; 
une loi (figure 5). A l&#8217;inverse, l&#8217;absen nyme peut &#234;tre 
&#233;ga mme diff&#233;rentielle (figure 6). 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>4 Conc
</p>
<p>Notre appr
rencontr&#233;es
pour l'anno
indices de 
des patrons
morpho-sy
processus d
sont &#233;tique
peut &#234;tre 
l'automatis
importante
performanc
nos entr&#233;es
des mots q</p>

</div><div><p>sieurs occurrences ac
 m&#234;me classe d&#8217;emp
lement consid&#233;r&#233;e co</p>

</div><div><p> 
</p>
<p> 
</p>
<p>Figure 5 : D&#233;coupage et description du vocable organe p
</p>
<p>Figure 6 
</p>
<p>lusion 
</p>
<p>oche vise &#224; rep&#233;rer des informations distributionnel
 sur corpus en vue de la constitution interactive de dic
tation s&#233;mantique de grands corpus textuels. Nous avon
&#171; surface &#187; pouvaient &#234;tre utilis&#233;s de fa&#231;on semi-auto
 distributionnels des lexies. A l'aide d'un outil &#233;labor&#233;
</p>
<p>ntaxiquement &#233;tiquet&#233;, nous utilisons ces indices par c
&#8217;&#233;tiquetage manuel &#171; vertical &#187;, o&#249; toutes les occurren
</p>
<p>t&#233;es en bloc. Le processus est it&#233;ratif, puisque l'informa
&#224; nouveau utilis&#233;e pour l'&#233;tiquetage des autres l
</p>
<p>ation d'un tel processus ne peut &#234;tre que partielle, et q
 est n&#233;cessaire. Nous r&#233;coltons actuellement les r&#233;sul
e d'un syst&#232;me de d&#233;sambigu&#239;sation automatique utilis
 (Audibert, 2002). Nous pensons que celles-ci semblen
ue les dictionnaires classiques dans une perspective de T
</p>
<p>Organe
</p>
<p>&#8657; porte-parole 
Organe de presse 
</p>
<p>&#8657; partie du corps 
Organe sain 
</p>
<p>&#8657; &#233;l&#233;me
Org
</p>
<p>Degr&#233;
&#8657; Unit&#233; de mesure 
</p>
<p>degr&#233; centigrade degr&#233; </p>

</div><div><p>est qu&#8217;elles a
ce d&#8217;hypero</p>

</div><div><p>ar l&#8217;hyperonyme 
</p>
<p>les &#224; partir de r&#233;alisations 
tionnaires pour le T.A.L. et 
s observ&#233; que de nombreux 
</p>
<p>matique pour la description 
 de concordance sur corpus 
ouches successives dans un 
ces de distribution analogue 
tion ainsi rajout&#233;e au corpus 
exies. Il est &#233;vident que 
u'une intervention manuelle 
tats d&#8217;une s&#233;rie de tests de 
ant l'information cod&#233;e dans 
t d&#233;crire mieux l'usage r&#233;el 
.A.L. 
</p>
<p>nt d&#8217;une machine 
ane de traction 
</p>
<p>&#8657; &#8709; 
d&#8217;un escalier </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Reymond 
</p>
<p> 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Audibert, L. (2002). &#201;tude des crit&#232;res de d&#233;sambigu&#239;sation s&#233;mantique automatique : 
pr&#233;sentation et premiers r&#233;sultats sur les cooccurrences. Actes de la Conf&#233;rence Traitement 
Automatique des Langues (RECITAL&#8217;2002). Nancy (France). A para&#238;tre. 
</p>
<p>Audibert, L. (2001). LoX : Un outil polyvalent pour l'exploration de corpus annot&#233;s. Actes de 
la Conf&#233;rence Traitement Automatique des Langues (RECITAL&#8217;2001) (pp. 411-419). Tours 
(France): ATALA. http://www.up.univ-mrs.fr/delic/papiers/Audibert-2001recital.pdf 
 
Binon, J., Verlinde, S., Van Dyck, J., &amp; Bertels, A. (1999). Dictionnaire d'apprentissage du 
fran&#231;ais des affaires. Paris: Didier. 650 pp. 
</p>
<p>Daille, B. (1994). Approche mixte pour l'extraction automatique de terminologie : statistiques 
lexicales et filtres linguistiques. Th&#232;se de Doctorat en Informatique Fondamentale. Universit&#233; 
Paris 7. 1994. daille_these94.ps.gz 
 
Gross, G. &amp; Clas, A. 1997. &#171;Synonymie, polys&#233;mie et classes d'objets&#187;, Meta, 42(1) Presses 
de l'Universit&#233; de Montr&#233;al, pp. 147-155. 
</p>
<p>Gross, Gaston. 1996. Les expressions fig&#233;es en fran&#231;ais : noms compos&#233;s et autres locutions. 
Paris : Ophrys. 161 p. 
</p>
<p>Ide, N., &amp; V&#233;ronis, J. (1998). Introduction to the special issue on word sense disambiguation: 
the state of the art. Computational Linguistics, 24(1), 1-40. http://www.up.univ-
mrs.fr/~veronis/pdf/1998wsd.pdf 
 
Katz, J. J. &amp; Fodor, J. A.. (1964). The structure of a semantic theory. In J. A. Fodor and J. J. 
Katz, editors, The Structure of Language, chapter 19, pages 479--518. Prentice Hall. 
</p>
<p>Le Pesant, D., Mathieu-Colas, M. (eds.). 1998. Les classes d'objets. Langages, 131. Paris : 
Larousse. 
</p>
<p>Mel&#8217;cuk, I., Clas, A., &amp; Polgu&#232;re, A. (1995). Introduction &#224; la lexicologie explicative et 
combinatoire. Louvain-la-Neuve : Editions Duculot (Coll. Universit&#233;s Francophones). 
</p>
<p>Reymond, D. (2001, 2-5 juillet). Dictionnaires distributionnels et &#233;tiquetage lexical de corpus, 
Actes de la Conf&#233;rence Traitement Automatique des Langues (RECITAL'2001) (pp. 479-
488). Tours (France): ATALA. http://www.up.univ-mrs.fr/delic/papiers/Reymond-
2001recital.pdf 
 
Van den Eynde, K. &amp; Mertens, P. (2001, submitted for publication)  
La syntaxe du verbe, l'approche pronominale et le lexique de valence PROTON  
Preprint 174, Departement of Linguistics, K.U.Leuven, pp. 36. 
</p>
<p>V&#233;ronis, J. (2001). Sense tagging: does it make sense? Paper presented at the Corpus 
Linguistics'2001 Conference, Lancaster, U.K. http://www.up.univ-mrs.fr/~veronis/pdf/2001-
lancaster-sense.pdf </p>

</div></div>
</body></html>