<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Probl&#232;mes pos&#233;s par la reconnaissance de gestes en Langue des Signes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Probl&#232;mes pos&#233;s par la reconnaissance de gestes en Langue
des Signes
</p>
<p>Bossard Bruno
LIMSI-CNRS - Universit&#233; Paris XI, Orsay
</p>
<p>B&#226;t 508 BP133 91403 Orsay CEDEX
Bruno.Bossard@limsi.fr
</p>
<p>date de soutenance pr&#233;vue : automne 2004
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Reconnaisance de gestes, Langue des Signes
Gesture recognition, Sign Language
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Le but de cet article est d&#8217;expliciter certains des probl&#232;mes rencontr&#233;s lorsque l&#8217;on cherche
&#224; concevoir un syst&#232;me de reconnaissance de gestes de la Langue des Signes et de proposer
des solutions adapt&#233;es. Les trois aspects trait&#233;s ici concernent la simultan&#233;&#239;t&#233; d&#8217;informations
v&#233;hicul&#233;es par les gestes des mains, la synchronisation &#233;ventuelle entre les deux mains et le fait
que diff&#233;rentes classes de signes peuvent se rencontrer dans une phrase en Langue des Signes.
</p>
<p>The aim of this paper is to specify some of the problems raised when one wants to design a
gesture recognition system dedicated to Sign Language, and to propose suited solutions. The
three topics considered here concern the simultaneity of information conveyed by hand gestures,
the possible synchronicity between the two hands, and the different classes of signs that may be
encountered in a Sign Language sentence.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bossard Bruno
</p>
<p>1 Introduction
</p>
<p>Lorsque la parole ne suffit plus ou n&#8217;est pas adapt&#233;e &#224; la situation, l&#8217;homme utilise le geste
comme moyen de communication alternatif ou compl&#233;mentaire. Il existe diff&#233;rentes communi-
cations gestuelles suivant les besoins d&#8217;expressivit&#233;. Les plus simples sont les gestes de com-
mande qui ne se combinent pas entre eux ou avec un autre canal de communication (par exemple
les gestes des plongeurs). Les gestes co-verbaux ou les mimiques sont un peu plus complexes
et sont compl&#233;mentaires vis &#224; vis de la parole. Au plus haut degr&#233; de complexit&#233; se situent les
gestes des Langues des Signes qui se combinent pour former des phrases
Dans cet article, c&#8217;est l&#8217;interpr&#233;tation de certains gestes de la Langue des Signes (LS) qui nous
interesse. Le but n&#8217;est pas d&#8217;&#234;tre capable d&#8217;interpr&#233;ter n&#8217;importe quelle phrase de la LS mais
de traiter certains probl&#232;mes de synchronisation. En effet, les deux mains sont deux canaux
de communication qui peuvent &#234;tre aussi bien combin&#233;s que totalement ind&#233;pendants. Pour
effectuer correctement l&#8217;interpr&#233;tation de phrases gestuelles en LS, on doit alors &#234;tre capable de
d&#233;terminer si les deux mains op&#232;rent de mani&#232;re synchrone, ou si chacune effectue des gestes
de mani&#232;re plus ind&#233;pendante. A l&#8217;heure actuelle il n&#8217;y a quasiment aucune &#233;tude d&#8217;effectu&#233;e
sur les cas o&#249; les mains alternent des &#233;tapes de synchronisation avec des &#233;tapes o&#249; elles sont
partiellement ou totalement asynchrones, car la plupart des travaux portent sur d&#8217;autres aspects
de la LS.
Dans cet article la premi&#232;re partie d&#233;crit diff&#233;rents signes que l&#8217;on peut rencontrer en LS et leurs
caract&#233;ristiques. La seconde partie expose les diff&#233;rents probl&#232;mes d&#8217;interpr&#233;tation induits par
ces signes et le probl&#232;me de la synchronisation des mains y sera plus particuli&#232;rement devel-
opp&#233;. Enfin la troisi&#232;me partie expose l&#8217;architecture propos&#233;e pour traiter ces probl&#232;mes de
synchronisation.
</p>
<p>2 Quelques caract&#233;ristiques de la Langue des Signes
La Langue des Signes est le moyen d&#8217;expression utilis&#233; par les communaut&#233;s de sourds ou
malentendants pour communiquer entre eux. La Langue des Signes est une v&#233;ritable langue &#224;
part enti&#232;re (avec un lexique, une syntaxe...) et constitue de ce fait la forme la plus &#233;volu&#233;e en
communication gestuelle (Cuxac, 2000; McNeil, 1992).
L&#8217;expression de phrases en LS ne se r&#233;duit pas aux gestes produits par les deux mains, c&#8217;est le
corps tout entier qui peut &#234;tre mis &#224; contribution pour exprimer une phrase. On peut distinger
trois principales parties qui interviennent : les mains, la t&#234;te (mimique et regard) et le buste.
Dans cette &#233;tude on se restreint uniquement aux mains, c&#8217;est pourquoi les autres parties du
corps ne seront pas abord&#233;es par la suite.
Chaque phrase est constitu&#233;e d&#8217;une suite de gestes des mains que l&#8217;on appelle signes et qui sont
agenc&#233;s suivant une syntaxe r&#233;gie par une logique spatiale et temporelle. C&#8217;est principalement
l&#8217;interpr&#233;tation des signes et des relations qui s&#8217;&#233;tablissent entre eux qui nous int&#233;ressent, et qui
vont &#234;tre d&#233;crits avec pr&#233;cision dans les parties qui suivent.
</p>
<p>2.1 Composition d&#8217;un signe
</p>
<p>Chaque geste d&#8217;une main peut &#234;tre d&#233;compos&#233; en quatre param&#232;tres qui sont ind&#233;pendants et
peuvent &#234;tre aussi bien dynamiques qu&#8217;invariants durant l&#8217;&#233;mission du signe.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#232;mes pos&#233;s par la reconnaissance de gestes en Langue des Signes
</p>
<p>&#0; La configuration correspond &#224; la forme de la main d&#233;finie par les doigts et la paume
(exemples figure 1). Les signes ont souvent des aspect iconiques (Cuxac, 2000). En
particulier la configuration est souvent en rapport avec la forme de ce que le signe d&#233;crit.
</p>
<p>&#0; L&#8217; orientation de la main est d&#233;finie par deux axes de la main indiqu&#233;s dans la figure 1.
</p>
<p>&#0; Le mouvement correspond &#224; la trajectoire d&#233;crite par la main (ligne, arc de cercle...)(voir
figure 1).
</p>
<p>Figure 1: Exemples de configurations, d&#8217;orientation et de mouvement.
</p>
<p>&#0; L&#8217;emplacement est la position de la main par rapport au corps. Selon les besoins, il va
avoir une granularit&#233; plus ou moins fine. Dans la figure 2, l&#8217;emplacement du premier
signe [GAR&#199;ON] est le front. Le second signe indique que le gar&#231;on se situe &#224; droite,
devant le signeur. En effet, en LS le signeur utilise un espace de narration au sein duquel
l&#8217;emplacement o&#249; il effectue le signe va &#234;tre utilis&#233; pour indiquer une relation spatiale (ou
temporelle) entre entit&#233;s.
</p>
<p>Figure 2: La phrase &#8220;Un gar&#231;on &#224; droite&#8221; constitu&#233;e des signes [GAR&#199;ON] et [ICI]
</p>
<p>Chacun de ces param&#232;tres est porteur d&#8217;information et contribue au sens d&#8217;un signe.
</p>
<p>2.2 Interaction entre les deux mains
</p>
<p>Un signe peut aussi bien faire intervenir une main que deux mains et les deux mains ont dif-
f&#233;rentes fa&#231;ons d&#8217;interagir. Lorsque les deux mains sont impliqu&#233;es dans un signe, deux cas se
pr&#233;sentent.
Dans le premier cas on voit appara&#238;tre un r&#244;le pour chaque main. Une main est dite dominante
et a pour r&#244;le de d&#233;crire &#8220;l&#8217;action&#8221;, tandis que l&#8217;autre main qui est appel&#233;e main domin&#233;e sert de
r&#233;f&#233;rence &#224; cette action (Cuxac, 2000). Par exemple, avec le signe [TOMBER DE] (figure 3),
on peut voir la main dominante (main droite dans la figure) qui mime l&#8217;action de tomber d&#8217;un
support (r&#233;f&#233;rence donn&#233;e par la main domin&#233;e). En g&#233;n&#233;ral la main dominante se d&#233;place au
cours du geste tandis que la main domin&#233;e reste statique.
Dans le deuxi&#232;me cas, les deux mains sont compl&#232;tement synchronis&#233;es : leurs param&#232;tres sont</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bossard Bruno
</p>
<p>identiques ou sym&#233;triques. Par exemple, avec le signe [TABLE] (figure 3), les deux mains ont
une configuration et une orientation identiques et des mouvements de m&#234;me trajectoire mais de
sens oppos&#233;s.
</p>
<p>Figure 3: Les signes [TABLE] et [TOMBER DE].
</p>
<p>Lorsque qu&#8217;un signe ne fait intervenir qu&#8217;une seule main il y a &#233;galement deux cas qui se
pr&#233;sentent : soit la deuxi&#232;me main est inactive (comme dans la figure 2), soit elle effectue un
autre signe (voir plus loin les trois derni&#232;res images dans la figure 5) et dans ce cas on peut
parfois retrouver une interaction main dominante-main domin&#233;e entre les deux signes (cas de la
derni&#232;re image dans la figure 5).
On voit donc que les flux de donn&#233;es v&#233;hicul&#233;s par chaque main peuvent aussi bien &#234;tre syn-
chrones que compl&#232;tement asynchrones.
</p>
<p>2.3 Diff&#233;rentes classes de signes
</p>
<p>En LS on peut distinguer diff&#233;rentes classes de signes, chacune correspondant &#224; un usage par-
ticulier. L&#8217;ensemble des signes dits &#8220;standards&#8221; correspond &#224; des mots (nom, verbe, adjectif...)
ayant un sens bien &#233;tabli. On peut leur associer une correspondance relativement pr&#233;cise dans
les langues orales. Du fait qu&#8217;il y a une correspondance &#8220;directe&#8221;, ce sont les signes qui ont
&#233;t&#233; le plus &#233;tudi&#233;s en reconnaissance de gestes et il existe des syst&#232;mes permettant d&#8217;effectuer
la reconnaissance de mani&#232;re fiable sur des vocabulaires de taille limit&#233;e. Par exemple dans
(Hienz et Bauer, 2000) le taux de reconnaisssance atteint un peu plus de 90% pour un vocabu-
laire d&#8217;une centaine de signes.
Il existe deux autres classes de signes qui eux ne permettent aucune correspondance directe avec
des mots du langage oral. Il s&#8217;agit des sp&#233;cificateurs de forme et de taille, et des classificateurs.
Ces signes ont des aspects fortement iconiques et font partie de ce que l&#8217;on appelle la grande
iconicit&#233; (Cuxac, 2000). Les sp&#233;cificateurs permettent de d&#233;crire un objet, un animal, une sc&#232;ne.
C&#8217;est &#224; l&#8217;aide de la forme des mains, de leur orientation et de leur mouvement que le signeur
d&#233;crit une forme et les dimensions d&#8217;un objet. Les classificateurs sont similaires aux sp&#233;cifi-
cateurs dans le sens o&#249; ils repr&#233;sentent &#233;galement un objet (ou personne, animal...) et donc la
forme de la main est en rapport avec celle de l&#8217;objet ou de sa fonction. Mais ils ont un tout autre
r&#244;le car ils servent en quelque sorte de pronom. Lorsqu&#8217;un objet a &#233;t&#233; cit&#233; dans une phrase &#224;
l&#8217;aide d&#8217;un signe du vocabulaire standard (ou de sp&#233;cificateurs), un classificateur peut ensuite
&#234;tre utilis&#233; pour repr&#233;senter cet objet dans le reste de la phrase. On peut avec ce classificateur
pr&#233;ciser la position de l&#8217;objet ou d&#233;crire une trajectoire qu&#8217;il a emprunt&#233;.
Dans la figure 4, on peut voir une phrase qui regroupe les trois classes de signe. Le premier
signe est un sp&#233;cificateur de forme et de taille, il d&#233;crit une caisse en symbolisant ses c&#244;t&#233;s.
Le signe suivant est le signe standard [POMME]. Enfin, la troisi&#232;me &#233;tape montre des signes
qui sont des classificateurs symbolisant des pommes que l&#8217;on place &#224; diff&#233;rents endroits pour
repr&#233;senter le tas de pomme que contient la caisse.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#232;mes pos&#233;s par la reconnaissance de gestes en Langue des Signes
</p>
<p>Figure 4: La phrase &#8220;Une caisse pleine de pommes&#8221;.
</p>
<p>On se doute alors que tous ces aspects (diversit&#233; des signes, interaction des mains...) vont
soulever des probl&#232;mes au niveau de la reconnaissance de ces diff&#233;rents gestes. Cela va &#234;tre
abord&#233; dans la partie qui suit.
</p>
<p>3 Probl&#232;mes sp&#233;cifiques &#224; l&#8217;interpr&#233;tation de signes
</p>
<p>Dans un syst&#232;me de reconnaissance de forme classique, les donn&#233;es sont g&#233;n&#233;ralement trait&#233;es
en un seul bloc. Dans notre cas, cela voudrait dire que les deux mains seraient consid&#233;r&#233;es
comme une seule entit&#233;. Nous allons maintenant voir que ce type de syst&#232;me n&#8217;est pas adapt&#233;
aux caract&#233;ristiques de la LS.
</p>
<p>3.1 Complexit&#233; du vocabulaire
</p>
<p>Un des principaux probl&#232;mes que l&#8217;on trouve en reconnaissance de forme est la complexit&#233;.
En effet, du fait qu&#8217;un signe est compos&#233; de plusieurs &#233;l&#233;ments co-occurents, le vocabulaire
peut &#234;tre compos&#233; a priori d&#8217;un tr&#232;s grand nombre de signes (Vogler et Metaxas, 1999). Pour
une main, si on a &#0; configurations possibles, &#1; types de mouvements, &#2; emplacements et &#3;
orientations, on a &#0; &#1;&#1; &#1; &#2; &#1;&#3; signes possibles1. Sachant que l&#8217;on peut avoir des signes qui
combinent les deux mains, on voit tout de suite que cr&#233;er un syst&#232;me de reconnaissance peut se
r&#233;v&#233;ler complexe et n&#233;cessiter un long apprentissage.
En r&#233;alit&#233;, toutes les combinaisons possibles de param&#232;tres ne sont pas utilis&#233;es par les signeurs.
Car ils ne sont pas combin&#233;s au hasard mais en fonction de crit&#232;res syntaxiques et s&#233;mantiques.
Toutefois le nombre de signes reste important. Pour rem&#233;dier &#224; ce probl&#232;me, il existe une
solution qui consite &#224; traiter s&#233;par&#233;ment les divers composants d&#8217;un signe au lieu de traiter le
signe dans sa globalit&#233; (Liang et Ming, 1996; Vogler et Metaxas, 1999). On peut &#233;tablir un
parall&#232;le avec la reconnaissance de la parole o&#249; l&#8217;on cherche &#224; reconna&#238;tre des phon&#232;mes et non
pas directement des mots. Nous allons t&#226;cher de pr&#233;server cette approche dans l&#8217;architecture
que nous allons proposer dans la partie 4.
</p>
<p>1Il n&#8217;y a th&#233;oriquement pas de limite possible (mis &#224; part les contraintes articulatoires) quand au nombre de
variantes pour chaque param&#232;tre. Cela est particuli&#232;rement valable pour les sp&#233;cificateurs de forme et de taille
dont les param&#232;tres sont li&#233;s &#224; ce qu&#8217;ils d&#233;crivent. Pour les signes standards on recense l&#8217;utilisation d&#8217;environ 140
configuration, 300 orientations et 50 emplacements (Braffort, 1996).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bossard Bruno
</p>
<p>3.2 Relations entre les deux mains
</p>
<p>On a vu pr&#233;c&#233;demment (partie 2.2) que l&#8217;on peut rencontrer trois types d&#8217;interaction entre les
deux mains. Soit les deux mains produisent ensemble un signe, soit une main effectue un signe
et l&#8217;autre est au repos, soit les deux mains effectuent s&#233;par&#233;ment deux signes de mani&#232;re plus
ou moins ind&#233;pendante.
Le probl&#232;me va donc &#234;tre de savoir distinguer ces diff&#233;rents cas pour ne pas reconna&#238;tre un
signe &#224; deux mains alors qu&#8217;il s&#8217;agissait de deux signes distincts effectu&#233;s au m&#234;me moment
(ou vice-versa). Pour distinguer ces deux cas, on ne peut pas se contenter d&#8217;une quelconque
similitude des param&#232;tres des deux mains, car on a vu dans la premi&#232;re partie que lorsque les
deux mains sont utilis&#233;es pour former un signe, elles peuvent &#234;tre aussi bien compl&#232;tement syn-
chrones (signe [TABLE] dans la figure 3), qu&#8217;&#234;tre juste corr&#233;l&#233;es et n&#8217;avoir aucune similitude
au niveau des param&#232;tres (signe [TOMBER DE] dans la figure 3).
Il existe une autre relation entre les mains, que l&#8217;on va devoir d&#233;tecter. Lorsque les deux mains
effectuent s&#233;par&#233;ment des signes et qu&#8217;il existe une relation main dominante-main domin&#233;e,
il existe des points de synchronisation pour mettre en rapport les signes. Pendant un instant
les deux mains vont &#234;tre agenc&#233;es spatialement de mani&#232;re &#224; v&#233;hiculer une certaine informa-
tion. Par exemple dans la phrase &#8220;Le chat est dans la voiture&#8221; (figure 5), le signe [VOITURE]
est d&#8217;abord ennonc&#233; (premi&#232;re image) puis remplac&#233; par le classificateur &#8220;C&#8221; qui repr&#233;sente
la voiture en tant que &#8220;contenant&#8221; et la positionne dans la sc&#232;ne (deuxi&#232;me image). Ensuite on
voit la main gauche qui &#233;nonce le signe [CHAT] (troisi&#232;me image), le remplace par le classifica-
teur &#8220;X&#8221; (repr&#233;sentant les pattes du chat) et positionne ce dernier relativement au classificateur
repr&#233;sentant la voiture (derni&#232;re image)(description effectu&#233;e dans (Lejeune et al., 2002)).
</p>
<p>Figure 5: &#8220;Le chat est dans la voiture&#8221;
</p>
<p>On remarque dans les trois derni&#232;res images que la main dominante &#8220;maintient&#8221; le classifica-
teur &#8220;C&#8221; alors que la main domin&#233;e effectue trois signes successifs. On peut donc penser que
les deux mains sont ind&#233;pendantes. Cependant, il va donc y avoir pendant un certain laps de
temps une disposition particuli&#232;re des mains pour exprimer la relation spatiale &#8220;dans&#8221; (qua-
tri&#232;me image, figure 7). Il va donc falloir &#234;tre capable de d&#233;tecter cet instant pour interpr&#233;ter
cette relation. Aucune solution n&#8217;a &#233;t&#233; propos&#233;e &#224; ce jour pour r&#233;soudre ce probl&#232;me.
</p>
<p>3.3 Interpr&#233;tation des signes non standards
</p>
<p>Un troisi&#232;me probl&#232;me encore plus difficile &#224; r&#233;soudre concerne l&#8217;interpr&#233;tation des signes non
standards. A ce jour, seule une cat&#233;gorie de ces signes (les verbes directionnels) a &#233;t&#233; abor-
d&#233;e dans le cadre d&#8217;un syst&#232;me de reconnaissance (Braffort, 1998; Sagawa et Takeuchi, 1999).
Parmis les cat&#233;gories qui n&#8217;ont pas &#233;t&#233; abord&#233;es en reconnaissance de la LS, on trouve les clas-
sificateurs et les sp&#233;cificateurs. On a vu dans la partie 2.3 que ces derniers n&#8217;ont pas de sens
propre, c&#8217;est la phrase et son contexte qui permettent de le d&#233;terminer.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#232;mes pos&#233;s par la reconnaissance de gestes en Langue des Signes
</p>
<p>Les classificateurs se rapportent souvent &#224; un signe standard qui a &#233;t&#233; sign&#233; pr&#233;c&#233;demment mais
ce n&#8217;est pas toujours le cas. On peut cependant d&#233;terminer pour chaque signe la liste des classifi-
cateurs potentiels. Les sp&#233;cificateurs posent un probl&#232;me beaucoup plus complexe du fait qu&#8217;ils
sont propres &#224; la description et peuvent varier &#233;norm&#233;ment. Contrairement aux langues orales
qui poss&#232;dent un vocabulaire d&#233;limit&#233;, en LS on peut tr&#232;s bien &#8220;inventer&#8221; un signe de toutes
pi&#232;ces. Par d&#233;finition, les param&#232;tres d&#8217;un sp&#233;cificateur sont associ&#233;s &#224; ce qu&#8217;ils d&#233;crivent et
donc &#224; chaque nouvelle description peut correspondre de nouveaux signes. De plus, la mani&#232;re
de faire une description peut d&#233;pendre du contexte social et culturel du signeur (Cuxac et al.,
1998)
Il va falloir chercher le sens de ces signes dans le contexte de la phrase et en analysant les
formes qu&#8217;ils d&#233;crivent. Ceci est un probl&#232;me tr&#232;s complexe et il n&#8217;y a actuellement aucune so-
lution qui y rem&#233;die. Il faut &#224; notre niveau que l&#8217;architecture propos&#233;e permette une interaction
bidirectionnelle entre le processus de reconnaissance de forme et le processus d&#8217;interpr&#233;tation
prenant en compte les aspect syntaxiques et s&#233;mantiques.
</p>
<p>Pour pouvoir traiter des phrases de la LS les plus riches possibles il faut donc que le syst&#232;me de
reconnaissance prenne en compte les diff&#233;rents probl&#232;mes soulev&#233;s ici.
</p>
<p>4 R&#233;alisation d&#8217;un syst&#232;me de reconnaissance
</p>
<p>4.1 Architecture propos&#233;e
</p>
<p>Ce qui suit va exposer diff&#233;rentes propositions visant &#224; r&#233;soudre le probl&#232;me de la complexit&#233; et
celui des relations entre mains, mais aussi &#224; pr&#233;voir l&#8217;interaction entre les niveaux de reconnais-
sance de forme et d&#8217;interpr&#233;tation. L&#8217;architecture propos&#233;e vise &#233;galement la g&#233;n&#233;ricit&#233; pour
permettre l&#8217;utilisation de divers mod&#232;les de reconnaissance.
</p>
<p>&#0; Proposition 1 : reconnaissance des param&#232;tres
</p>
<p>La reconnaissance d&#8217;un signe va &#234;tre d&#233;compos&#233;e en quatre partie correspondant aux diff&#233;rents
param&#232;tres. Cela afin de r&#233;duire la complexit&#233; (comme vu en 3.1), mais aussi pour &#234;tre capable
de mod&#233;liser n&#8217;importe quel type de signe. En effet pour les signes comme les classificateurs
et les sp&#233;cificateurs, on va &#234;tre capable de reconnaitre leurs diff&#233;rents param&#232;tres et &#224; partir de
ceux-ci faire une interpr&#233;tation de ces signes &#224; des &#233;tapes ult&#233;rieures.
La figure 6 nous montre ces quatre modules qui fonctionnent en parall&#232;le (pour les signes &#224; deux
mains on aura &#233;videmment huit modules) . Le cinqui&#232;me module (en pointill&#233;s sur la figure) qui
re&#231;oit les r&#233;sultats de la reconnaissance des param&#232;tres va devoir effectuer diverses t&#226;ches : il va
tout d&#8217;abord construire des quadruplets &#224; partir des symboles re&#231;us depuis les quatre modules,
il va ensuite chercher &#224; associer chaque quadruplet &#224; un signe (cela peut &#234;tre effectu&#233; soit en
cherchant une correspondance dans une base de donn&#233;e de quadruplets, soit par des m&#233;thodes
stochastiques), enfin il va transmettre le signe reconnu avec un score de reconnaissance bas&#233; sur
celui des param&#232;tre et la qualit&#233; de la correspondance signe-quadruplet. Dans le cas ou aucune
correspondance n&#8217;est trouv&#233;e (on est probablement face &#224; un classificateur ou un sp&#233;cificateur),
c&#8217;est le quadruplet qui est transmis (avec un score bas&#233; sur celui des param&#232;tres) pour une anal-
yse ult&#233;rieure en relation avec les niveaux d&#8217;interpr&#233;tation. En plus du score de reconnaissance
associ&#233; &#224; l&#8217;&#233;l&#233;ment retourn&#233; par le module, la dur&#233;e de cet &#233;l&#233;ment est fournie (&#224; quel instant il
a commenc&#233; et &#224; quel instant il a fini).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bossard Bruno
</p>
<p>Figure 6: Module de reconnaissance des gestes d&#8217;une main
</p>
<p>La composition m&#234;me des modules de reconnaissance des param&#232;tres peut-&#234;tre variable suivant
la complexit&#233; du vocabulaire que l&#8217;on veut reconna&#238;tre. On peut aussi bien utiliser un simple
syst&#232;me de classification statistique (Rubine, 1991), que des mod&#232;les stochastiques tel que les
cha&#238;nes de Markov cach&#233;es (Vogler et Metaxas, 1999).
</p>
<p>&#0; Proposition 2 : reconnaissance &#224; la fois synchrone et asynchrone
</p>
<p>Si l&#8217;on consid&#232;re la probl&#233;matique li&#233;e &#224; l&#8217;utilisation d&#8217;une ou deux mains, on peut identifier
trois types de signes possibles : ceux effectu&#233;s avec les deux mains, ceux effectu&#233;s par la main
droite et ceux effectu&#233;s par la main gauche. Pour interpr&#233;ter correctement un signe il va donc
falloir d&#233;terminer &#224; laquelle de ces trois cat&#233;gories il est associ&#233;. Pour cela, la solution propos&#233;e
est la suivante : pour chaque geste &#233;mis, trois modules correspondant aux trois types possibles
vont essayer de le reconna&#238;tre (figure 7). Le module qui parvient &#224; obtenir le &#8220;meilleur&#8221; score
de reconnaissance d&#233;termine alors le type du signe. Chacun des modules a une architecture
</p>
<p>Figure 7: Les trois modules permettant de reconna&#238;tre les trois types de gestes
</p>
<p>correspondant &#224; celle du module de reconnaissance d&#233;crit pr&#233;cedemment dans la proposition 1.
Les trois modules vont travailler en parall&#232;le &#224; partir des donn&#233;es &#233;mises par la main droite et
la main gauche. Mais chacun sera associ&#233; &#224; un vocabulaire propre, c&#8217;est &#224; dire que chacun aura
fait un apprentissage avec des signes que n&#8217;auront pas appris les deux autres modules.
Il va falloir ensuite choisir un des &#233;l&#233;ments reconnus par les trois modules. C&#8217;est un module de
comparaison qui va se charger de cela en utilisant une fonction d&#8217;&#233;valuation qui peut &#234;tre plus
ou moins sophistiqu&#233;e. Au niveau le plus simple correspond une fonction qui fait une &#233;valuation
&#8220;na&#239;ve&#8221; : le choix d&#8217;un signe sera fait en fonction de son score de reconnaissance et sans tenir
compte du contexte. Pour des niveaux plus &#233;volu&#233;s, il faudra concevoir une fonction qui se base
sur les signes pr&#233;c&#233;demment reconnus dans la phrase (en se basant sur des r&#232;gles de syntaxe et
de s&#233;mantique, on peut &#233;mettre des hypoth&#232;ses sur le signe &#224; reconna&#238;tre).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Probl&#232;mes pos&#233;s par la reconnaissance de gestes en Langue des Signes
</p>
<p>&#0; Proposition 3 : &#233;tablissement des relations entre signes
</p>
<p>Suivant le r&#233;sultat obtenu &#224; l&#8217;&#233;tape de comparaison (proposition 2), on va &#233;ventuellement rechercher
d&#8217;&#233;ventuels relations entre les signes : ainsi si l&#8217;on a reconnu deux signes &#224; une main, il va falloir
chercher s&#8217;il n&#8217;y a pas une relation spatiale qui est exprim&#233;e par la disposition des mains. On
va donc devoir rechercher parmi les signes reconnus s&#8217;il n&#8217;y a pas un point de synchronisation
entre eux.
Pour d&#233;tecter cet instant bien particulier, la solution propos&#233;e est la suivante. Une premi&#232;re
&#233;tape va consister &#224; synchroniser les signes de la main gauche avec ceux de la main droite, car
deux signes n&#8217;ont pas forc&#233;ment la m&#234;me dur&#233;e et ne sont donc pas reconnus au m&#234;me instant
par les modules de la main droite et de la main gauche. Cette synchronisation va s&#8217;effectuer
en assemblant les signes main gauche main droite par couple selon l&#8217;instant auquel ils ont
d&#233;but&#233; et l&#8217;instant auquel ils ont fini. Par exemple si la main gauche effectue un signe A pen-
dant que la main droite effectue les signes B,C et D, on va construire les couples suivants :
(A,B),(A,C),(A,D).
Les &#233;tapes suivantes consisteront &#224; utiliser ces couples de signes durant les phases de traitement
syntaxique et s&#233;mantique pour d&#233;tecter les &#233;ventuelles relations entre mains. La d&#233;cision de
l&#8217;existence d&#8217;une relation se fera en fonction de la disposition des mains mais aussi des infor-
mations d&#233;duites sur les signes durant les analyses syntaxique et s&#233;mantique. Ces traitements
ne seront pas abord&#233;s dans cet article.
</p>
<p>4.2 R&#233;alisation et exp&#233;rimentation
</p>
<p>Pour tester cette architecture, le choix s&#8217;est port&#233; sur des phrases m&#233;lant des classificateurs et
des signes standards, et d&#233;crivant des positions d&#8217;objets (ou animaux) par rapport &#224; d&#8217;autres :
par exemple &#8220;Le chat est dans la voiture&#8221; (figure 5). La phrase est compos&#233;e successivement
du signe standard [VOITURE], du classificateur &#8220;C&#8221; (qui dure jusqu&#8217;&#224; la fin de la phrase), du
signe standard [CHAT] et enfin du classificateur &#8220;X&#8221;. L&#8217;avantage de ce type de phrase est qu&#8217;il
permet de tester les diff&#233;rents cas qui peuvent soulever des probl&#232;mes : signe &#224; une ou deux
mains, synchronisation variable, classificateurs ...
Afin de faciliter la phase de capture des gestes, l&#8217;acquisition de ces phrases se fait &#224; partir de
gants num&#233;riques et de capteurs de position 3D. Les donn&#233;es sont r&#233;cup&#233;r&#233;es de mani&#232;re syn-
chrone &#224; partir des quatre p&#233;riph&#233;riques, cela afin que les modules de reconnaissance puissent
travailler correctement.
La r&#233;alisation de l&#8217;architecture est actuellement en cours. A ce jour l&#8217;impl&#233;mentation des propo-
sitions 1 et 2 est achev&#233;e. Pour l&#8217;instant les modules de reconnaissance sont bas&#233;s sur un sys-
t&#232;me de classification de type statistique (Rubine, 1991) pour pouvoir tester la comparaison des
sorties des trois modules. Mais l&#8217;objectif &#224; moyen terme est de tester une approche stochastique
qui est beaucoup plus adapt&#233;e aux phrases gestuelles car elle permet de mod&#233;liser la coarticula-
tion entre deux gestes encha&#238;n&#233;s. L&#8217;objectif &#224; court terme est de tester diff&#233;rentes m&#233;thodes de
comparaison avant de progresser plus en avant dans la r&#233;alisation de l&#8217;architecture.
</p>
<p>5 Conclusion
</p>
<p>Le fait que les mains sont deux moyens de communications ind&#233;pendants permet en LS d&#8217;exprimer
diverses relations entre les signes. On ne peut ignorer l&#8217;information que ces relations apportent</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bossard Bruno
</p>
<p>car avec certains signes comme les classificateurs, c&#8217;est tout le sens de la phrase qui en d&#233;-
coule. D&#8217;autre part, du fait que les mains peuvent &#234;tre ind&#233;pendantes, on rencontre aussi bien
des signes &#224; une main que des signes &#224; deux mains, il faut &#234;tre alors capable de distinguer ces
diff&#233;rents cas.
C&#8217;est ce &#224; quoi tente de donner r&#233;ponse l&#8217;architecture qui a &#233;t&#233; pr&#233;sent&#233;e ici. D&#8217;autre part elle
n&#8217;ignore pas les autres probl&#232;mes existants, &#224; savoir la complexit&#233; et la difficult&#233; &#224; interpr&#233;ter
certains signes. Elle utilise certaines solutions propos&#233;es pour g&#233;rer la complexit&#233; du vocabu-
laire et laisse la possibilit&#233; d&#8217;interpr&#233;ter les signes non reconnus en propageant les param&#232;tres
du signe vers les phases d&#8217;analyse syntaxique et s&#233;mantique. Actuellement la premi&#232;re partie
de l&#8217;architecture a &#233;t&#233; r&#233;alis&#233;e et commence &#224; &#234;tre test&#233;e. La r&#233;alisation des parties concer-
nant l&#8217;interpr&#233;tation des relations lors de l&#8217;analyse syntaxique et s&#233;mantique ne sera effectu&#233;e
qu&#8217;apr&#232;s avoir obtenu un module de comparaison suffisament fiable.
</p>
<p>Du fait de certains points communs entre certains gestes de la LS et d&#8217;autres moyens de commu-
nication gestuelle, il est envisag&#233; d&#8217;&#233;tendre le travail effectu&#233; &#224; d&#8217;autres domaines. Par exemple,
on trouve de fortes analogies entre la description de sc&#232;nes utilisant des classificateurs et des
sp&#233;cificateurs et l&#8217;interaction gestuelle en R&#233;alit&#233; Virtuelle. D&#8217;autre part le travail qui sera ef-
fectu&#233; sur la detection de points de synchronisation entre les mains pourra &#234;tre adapt&#233; &#224; d&#8217;autres
domaines o&#249; l&#8217;on a des synchronisations ponctuelles entre des flux d&#8217;information.
</p>
<p>R&#233;f&#233;rences
Braffort A. (1996), Reconnaissance et compr&#233;hension de gestes, application &#224; la langue des signes,
th&#232;se, Universit&#233; Paris XI - Orsay.
Braffort A., (1998), Traitement automatique des langues des signes : interpr&#233;tation des informations
spatiales, dans Revue d&#8217;Interaction Homme-Machine, Vol. 1, Num. 1, 65-87.
Cuxac C. (2000), La langue des Signes Fran&#231;aise (LSF), les voies de l&#8217;iconicit&#233;, Faits de Langues 15-16,
Editions OPHRYS.
Cuxac C., Fusellier-Souza I., Sallandre M.A., (1998), Iconicit&#233; des Langues des Signes et Cat&#233;gorisation,
dans SEMIOTIQUES, Num. 16, 181.
Hienz H., Bauer B. (2000), Video-Based Continuous Sign Language Recognition Using Statistical Meth-
ods, Actes de IEEE International Conference on Automatic Face and Gesture Recognition, 440-445.
Lejeune F., Braffort A., Descl&#233;s J.P. (2002), Study on Semantic Representations of French Sign Language
Sentences, Actes de Gesture Workshop&#8217;01, Springer, LNAI 2298 (&#224; paraitre), 440-445.
Liang R.H., Ming O., (1996), A Sign Language Recognition System Using Hidden Markov Model and
Context Sensitive Search, Actes de ACM Symposium on Virtual Reality Software and Technology&#8217;96,
59-66.
McNeil D. (1992), Hand and Mind : What gestures reveal about thought, University of Chicago Press.
Rubine D. (1991), The Automatic Recognition of Gestures, Ph-D thesis, Carnegie-Mellon.
Sagawa H., Takeuchi M. (1999), A Method for Analyzing Spatial Relationships Between Words in Sign
Language Recognition, Actes de Gesture Workshop&#8217;99, Springer, LNAI 1739, 197-210.
Vogler C., Metaxas D.N. (1999), Toward Scalability in ASL Recognition: Breaking Down Signs into
Phonemes, Actes de GEsture Workshop&#8217;99, Springer, LNAI 1739, 211-224.
Vogler C., Metaxas D.N. (1999), Parallel Hiden Markov Models for American Sign Language Recogni-
tion, Actes de IEEE International Conference on Computer Vision, 116-122.</p>

</div></div>
</body></html>