<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Conceptualisation d&#8217;un syst&#232;me d&#8217;informations lexicales, une interface param&#233;trable pour le T.A.L</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Conceptualisation d&#8217;un syst&#232;me d&#8217;informations lexicales, une
interface param&#233;trable pour le T.A.L
</p>
<p>Djam&#233; Seddah, Evelyne Jacquey&#0;
Laboratoire LORIA, Equipe Langue et Dialogue,
</p>
<p>Campus Scientifique, BP 239
F-54506 Vand&#339;uvre-l&#232;s-Nancy Cedex
</p>
<p>jacquey@loria.fr, seddah@loria.fr
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Bases de donn&#233;es, ressources lexicales
Data Bases, Lexical Ressources
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>La n&#233;cessit&#233; de ressources lexicales normalis&#233;es et publiques est av&#233;r&#233;e dans le domaine du
TAL. Cet article vise &#224; montrer comment, sur la base d&#8217;une partie du lexique MULTEXT
disponible sur le serveur ABU, il serait possible de construire une architecture permettant tout
&#224; la fois l&#8217;acc&#232;s aux ressources avec des attentes diff&#233;rentes (lemmatiseur, parseur, extraction
d&#8217;informations, pr&#233;diction, etc.) et la mise &#224; jour par un groupe restreint de ces ressources.
Cette mise &#224; jour consistant en l&#8217;int&#233;gration et la modification, automatique ou manuelle, de
donn&#233;es existantes. Pour ce faire, nous cherchons &#224; prendre en compte &#224; la fois les besoins
et les donn&#233;es accessibles. Ce mod&#232;le est &#233;valu&#233; conceptuellement dans un premier temps en
fonction des syst&#232;mes utilis&#233;s dans notre &#233;quipe : un analyseur TAG, un constructeur de gram-
maires TAGs, un extracteur d&#8217;information.
</p>
<p>Lexical ressources which would be normalized and freely accessible is a major issue in the NLP
research area. This article aims to show how to built an information system which allow (1) a
freely access for distinct NLP systems (tagging, parsing, information extraction, etc.) and (2) an
easy update of data by a restricted team of researchers, this update being manual or computed.
Starting with a a subset of the MULTEXT lexicon which is accessible from the server ABU,
we aim to take into account the various needs and the variability of accessible lexical data. Our
modelisation is evaluated with three existing systems of our team : EGAL (parsing), a builder
of Tag grammars and VULCAIN (information extraction).
</p>
<p>&#0;Cet article a &#233;t&#233; r&#233;dig&#233; &#224; parts &#233;gales par les deux auteurs. Djam&#233; Seddah est actuellement doctorant et Evelyne
Jacquey a soutenu sa th&#232;se en d&#233;cembre 2001.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Djam&#233; Seddah et Evelyne Jacquey
</p>
<p>1 Introduction et probl&#233;matique
</p>
<p>Les travaux th&#233;oriques des linguistes sont le plus souvent fond&#233;s sur un lexique, suppos&#233; pr&#233;ex-
istant et pertinent pour le ou les ph&#233;nom&#232;nes &#233;tudi&#233;s. Les faits ne valident cependant pas ce
pr&#233;suppos&#233;. Dans le traitement automatique des langues, l&#8217;un des probl&#232;mes r&#233;currents est la
non-r&#233;utilisabilit&#233; des lexiques : ils sont le plus souvent construits empiriquement et li&#233;s ir-
r&#233;mmediablement &#224; l&#8217;application vis&#233;e, ils ne sont que tr&#232;s rarement disponibles gratuitement
et suffisamment standardis&#233;s. Le Lexique-Grammaire (LADL), n&#8217;est accessible gratuitement
qu&#8217;en consultation. Il existe un certain nombre de lexiques morpho-syntaxiques publics, tel
MULTEXT1, mais aucun ne contient des informations de valence ou de pronominalisation, des
informations s&#233;mantiques comme les restrictions s&#233;lectionnelles, les r&#244;les s&#233;mantiques, des in-
formations conceptuelles interfac&#233;es avec des hi&#233;rarchies conceptuelles comme EuroWordnet
ou avec des thesauri.
</p>
<p>Une solution possible serait de disposer d&#8217;une base de connaissances lexicales normalis&#233;es avec
trois objectifs principaux : (1) synth&#233;tiser les ressources lexicales disponibles, les faire colla-
borer et les enrichir, (2) &#233;viter de construire un nouveau lexique d&#233;di&#233; chaque fois qu&#8217;un nou-
veau syst&#232;me est construit, et (3), permettre &#224; des applications diff&#233;rentes mais compl&#233;mentaires
de collaborer pour mettre en &#339;uvre une t&#226;che multimodulaire.
</p>
<p>Nous nous proposons d&#8217;amorcer ici les sp&#233;cifications d&#8217;un syst&#232;me d&#8217;informations lexicales en
pr&#233;cisant les axes qui ont permis sa mod&#233;lisation tout en veillant &#224; sous-sp&#233;cifier ce syst&#232;me
pour qu&#8217;un processus d&#8217;&#233;change avec la communaut&#233; puisse l&#8217;enrichir sans en bouleverser les
fondements. Notre contribution se situe donc sur le premier axe de la r&#233;flexion, celui de la d&#233;fi-
nition d&#8217;un format abstrait et d&#8217;une organisation g&#233;n&#233;rique des donn&#233;es lexicales correspondant
aux besoins d&#233;cel&#233;s dans la section (2). La m&#233;thodologie developp&#233;e (section 3) est celle de la
conception de bases de donn&#233;es relationnelle (Merise) qui sera ensuite &#233;tendue &#224; une famille de
sch&#233;mas XML compatibles dans nos futurs travaux (Romary, 2001). La validation conceptuelle
du syst&#232;me propos&#233; se fera en la confrontant &#224; trois types d&#8217;applications (un analyseur TAG,
une m&#233;ta-grammaire et un syst&#232;me d&#8217;extraction d&#8217;information) en section (4).
</p>
<p>2 Des besoins multiples
</p>
<p>Avant d&#8217;envisager une mod&#233;lisation, nous r&#233;sumons, en l&#8217;illustrant par quelques exemples, notre
analyse des besoins.
</p>
<p>L&#8217;analyseur de grammaire d&#8217;arbres adjoints : La m&#233;thode usuelle d&#8217;analyse des parseurs
TAG2 consiste &#224; pr&#233;selectionner les arbres de la grammaire dont les ancres correspondent aux
</p>
<p>1MULTEXT (Ide &amp; V&#233;ronis, 1994), (V&#233;ronis &amp; Khouri, 1995), est le plus gros projet d&#8217;envergure europ&#233;enne
visant &#224; l&#8217;av&#232;nement d&#8217;une base linguistique commune. Le succ&#232;s de ce projet est venu de la simplicit&#233; des objectifs
affich&#233;s : standardiser des ressources textuelles et des donn&#233;es linguistiques, cr&#233;er des ressources linguistiques
informatis&#233;es, monolingues et multilingues, et, cr&#233;er des outils g&#233;n&#233;riques pour l&#8217;annotation et l&#8217;exploitation de
corpus. La mise au point des &#233;tiquettes s&#8217;est fait dans une optique de simplicit&#233; et de compromis visant &#224; leur
r&#233;utilisabilit&#233; &#233;vidente &#224; travers une d&#233;nomination linguistique quasiment universelle au sein des langues indo-
europ&#233;ennes (Nom, Adverbe, Verbes...). L&#8217;un des aspects les plus int&#233;ressant est la sous-sp&#233;cification de chaque
langue par rapport au lexique initial qu&#8217;elle int&#232;gre.
</p>
<p>2Les grammaires d&#8217;arbres Adjoints (Joshi et al., 1975) sont un formalisme syntaxique o&#249; l&#8217;on associe, &#224; la
substitution classique des grammaires hors contexte, une op&#233;ration appell&#233;e adjonction consistant en l&#8217;insertion</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Conceptualisation d&#8217;un syst&#232;me d&#8217;informations lexicales pour le T.A.L
</p>
<p>items lexicaux pr&#233;sents dans la phrase &#224; analyser, (Vijay-Shanker &amp; Joshi, 1985). Un des prob-
l&#232;mes connus du formalisme LTAG est l&#8217;explosion combinatoire de la quantit&#233; d&#8217;arbre d&#251;e &#224; la
lexicalisation de la grammaire3. Une solution repose sur l&#8217;&#233;laboration d&#8217;une m&#233;ta-grammaire
TAG (Candito, 1999) qui, &#224; partir d&#8217;un syst&#232;me de r&#232;gles, g&#233;n&#232;re des sch&#232;mes (arbres non in-
stanci&#233;s) ancr&#233;s par le lexique via une proc&#233;dure bas&#233;e sur le filtrage de structures de traits. Bien
que cette approche simplifie le processus, une modification des structures de traits lexicaux ne
se propage pas sur la m&#233;ta-grammaire sans une intervention humaine cons&#233;quente.
</p>
<p>L&#8217;id&#233;al serait de pouvoir modifier les entr&#233;es lexicales sans pour autant devoir modifier l&#8217;interface
d&#8217;acc&#232;s &#224; ces m&#234;mes donn&#233;es. Un syst&#232;me r&#233;pondant dynamiquement aux requ&#234;tes d&#8217;une m&#233;ta-
grammaire &#224; travers un m&#233;talangage de descripteur serait une solution envisageable.
</p>
<p>L&#8217;&#233;tiqueteur de E.Brill : Cet outil, servant &#224; attribuer une &#233;tiquette morpho-syntaxique &#224; un
mot d&#8217;un corpus, est l&#8217;une des applications les plus courantes dans le domaine du TAL. Un
processus relativement simple mais fastidieux permet de cr&#233;er le lexique permettant le traite-
ment d&#8217;un corpus (Seddah, 1998). N&#233;anmoins le lexique ainsi cr&#233;&#233; n&#8217;est que tr&#232;s difficilement
r&#233;utilisable, c&#8217;est pourquoi l&#8217;&#233;tiquetage, et les op&#233;rations qu&#8217;il englobe, seraient &#233;minemment
simplifi&#233;s si on disposait en amont d&#8217;un lexique suffisamment cons&#233;quent pour couvrir la plupart
des mots du corpus tout en permettant de faire varier la granularit&#233; des informations pr&#233;sentes
dans les &#233;tiquettes morpho-syntaxiques.
</p>
<p>Notre syst&#232;me, pour &#234;tre r&#233;ellement utilisable, doit pouvoir g&#233;n&#233;rer le plus grand lexique pos-
sible et &#233;ventuellement permettre de changer le jeu d&#8217;&#233;tiquette dynamiquement (en rempla&#231;ant
&#233;ventuellement les &#233;tiquettes morpho-syntaxiques par des arbres TAG) sans modifier le syst&#232;me
d&#8217;inf&#233;rence du tagger (Brill, 1992; Deloupy, 1995).
</p>
<p>Les syst&#232;mes de g&#233;n&#233;ration de textes : Le principe de la g&#233;n&#233;ration de textes est l&#8217;inverse
de celui de l&#8217;analyse : partir d&#8217;une repr&#233;sentation conceptuelle pour aboutir au texte contenant
l&#8217;information &#224; communiquer, (Reiter &amp; Dale, 2000), (Gardent, 2002). Les besoins vis-&#224;-vis
d&#8217;un lexique sont invers&#233;s : ils vont des concepts aux lex&#232;mes.
</p>
<p>En prenant pour &#233;l&#233;ment central, une repr&#233;sentation conceptuelle du pr&#233;dicat, le lexique doit
permettre d&#8217;acc&#233;der &#224; plusieurs informations : (1) les d&#233;finitions s&#233;mantiques correspondant
aux repr&#233;sentations conceptuelles du pr&#233;dicat et des autres concepts mis-en-jeu, et (2), pour
chaque d&#233;finition s&#233;mantique, les r&#244;les associ&#233;s aux participants ; r&#244;les th&#233;matiques, positions
dans les LCS (Lexical Conceptual Structures) de Jackendoff (Jackendoff, 1990). Muni de ces
informations, le syst&#232;me d&#8217;informations lexicales doit enfin fournir la ou les liste(s) de lex&#232;mes
&#224; utiliser avec, de pr&#233;f&#233;rence, des informations statistiques de pertinence.
</p>
<p>L&#8217;extraction d&#8217;informations : Le syst&#232;me VULCAIN (Todirascu &amp; Romary, parution en mai
2002) a pour objectif d&#8217;extraire de l&#8217;information sur un domaine limit&#233;, celui de textes sur la
s&#233;curit&#233; des syst&#232;mes informatiques. Les donn&#233;es d&#8217;entr&#233;e sont des textes. A partir des r&#233;sul-
tats partiels d&#8217;un analyseur LTAG, des listes de groupes significatifs sont extraits, principale-
ment des groupes nominaux simples de la forme Nom-Nom, Nom-Adjectif, GroupeNominal-
Pr&#233;position-GroupeNominal. En sortie de ce syst&#232;me d&#8217;extraction d&#8217;information, doivent appa-
</p>
<p>d&#8217;un sous-arbre dans une branche d&#8217;un autre arbre.
3La grammaire FTAG (Abeill&#233;, 1991), retranscrite en XML, devient trop lourde pour des syst&#232;mes classiques :
</p>
<p>dans sa version actuelle, elle correspond &#224; une dizaine de milliers de sch&#232;mes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Djam&#233; Seddah et Evelyne Jacquey
</p>
<p>ra&#238;tre des listes d&#8217;entit&#233;s identifi&#233;es (instances et cat&#233;gories) et valid&#233;es sur l&#8217;ontologie.
Les informations n&#233;cessaires au bon fonctionnement de ce syst&#232;me sont, outre l&#8217;analyseur
LTAG, un lexique TAG au format TAGML et des liens entre les entr&#233;es lexicales de celui-ci
et l&#8217;ontologie du domaine. La particularit&#233; du lexique TAG attendu repose sur les liens entre
lexique et ontologie, qui sont repr&#233;sent&#233;s par des correspondances entre les arbres &#233;l&#233;mentaires
et les structures conceptuelles associ&#233;es aux concepts de l&#8217;ontologie du domaine. De plus, ces
structures conceptuelles sont &#233;crites dans le formalisme des logiques de description.
</p>
<p>L&#8217;interface syntaxe - s&#233;mantique : Les travaux actuellement en cours dans notre &#233;quipe de
recherche consistent, &#224; partir des donn&#233;es s&#233;mantiques de la grammaire et de l&#8217;analyse syntax-
ique d&#8217;une phrase donn&#233;e, &#224; enrichir l&#8217;analyse syntaxique issue d&#8217;un parseur LTAG (op cit&#233;)
d&#8217;un calcul de la forme logique correspondant &#224; la for&#234;t partag&#233;e r&#233;sultat. Les donn&#233;es n&#233;ces-
saires se synth&#233;tisent principalement par l&#8217;intersection de plusieurs domaines : les informations
s&#233;mantiques propres &#224; l&#8217;ancre lexicale et la structure argumentale du sch&#232;me que l&#8217;entr&#233;e lex-
icale instancie. Or pour r&#233;cup&#233;rer ces donn&#233;es il est n&#233;cessaire de travailler sur la r&#233;alisation
de ces intersections paradigmatiques, le lexique. Notre syst&#232;me d&#8217;information va donc pro-
poser un filtrage des informations issues de la m&#233;ta-grammaire et va enrichir cette description
d&#8217;un lexique logique tout en inf&#233;rant une sous-sp&#233;cifications de ces types via le cadre de sous-
cat&#233;gorisation de l&#8217;entr&#233;e lexicale.
</p>
<p>Synth&#232;se des types de donn&#233;es : Les exemples que nous venons d&#8217;illustrer bri&#232;vement mon-
trent l&#8217;&#233;tendue et la diversit&#233; des types de donn&#233;es attendus suivant les applications. Au vu de
ces quelques exemples, un syst&#232;me d&#8217;informations lexicales normalis&#233;es et partag&#233;es doit se
caract&#233;riser par plusieurs propri&#233;t&#233;s majeures :
</p>
<p>&#0; La modularit&#233; de l&#8217;information : les diff&#233;rents types d&#8217;informations lexicales ne peuvent
plus &#234;tre simplement organis&#233;s autour de la classification reposant sur les niveaux linguis-
tiques de description (phon&#233;tique, morphologie, syntaxe, s&#233;mantique). Les m&#233;thodes de
conception des bases de donn&#233;es, qu&#8217;elles soient relationnelles ou objet, nous semblent
appropri&#233;es dans ce cas pour plusieurs raisons :
</p>
<p>&#8211; Via leurs diff&#233;rents niveaux de repr&#233;sentations sch&#233;matiques, elles permettent d&#8217;avoir
une vue globale du syst&#232;me ainsi que des vues plus partielles selon les besoins,
</p>
<p>&#8211; Les repr&#233;sentations sch&#233;matiques, si elles sont rigoureusement document&#233;es, per-
mettent des &#233;changes avec des chercheurs de toute culture scientifique, ce qui per-
met une meilleure ad&#233;quation avec les besoins de la communaut&#233; et une mise &#224; jour
r&#233;guli&#232;re de ceux-ci,
</p>
<p>&#8211; Elles reposent sur des meta-langages formels dont les propri&#233;t&#233;s ont &#233;t&#233; d&#233;montr&#233;es.
</p>
<p>&#0; La diversit&#233; des formats de sortie des diff&#233;rents types de donn&#233;es attendus. L&#8217;information
s&#233;mantico-conceptuelle est attendue sous la forme de &#0;-termes typ&#233;s ou de DRS (Dis-
course Representation Structure), sous la forme de structures de traits typ&#233;es partic-
uli&#232;res (elles sont destin&#233;es au filtrage des sch&#232;mes pertinents) avec les m&#233;ta-grammaires,
sous la forme d&#8217;expressions en logique de description avec les syst&#232;mes d&#8217;extraction
d&#8217;information comme VULCAIN, et enfin, sous la forme de structures conceptuelles con-
formes au formalisme de Jackendoff dans le cadre d&#8217;un processus de g&#233;n&#233;ration comme
celui qui sera d&#233;fendu par le projet GENI.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Conceptualisation d&#8217;un syst&#232;me d&#8217;informations lexicales pour le T.A.L
</p>
<p>Il nous semble donc important d&#8217;envisager le processus de r&#233;ponses aux attentes des ap-
plications en deux temps : retour du r&#233;sultat sous une forme standard d&#233;finie dans le
syst&#232;me d&#8217;informations lexicales lui-m&#234;me, puis, traduction de ce format dans celui de-
mand&#233; par l&#8217;application client.
</p>
<p>3 Conception d&#8217;un syst&#232;me d&#8217;informations lexicales
</p>
<p>Le syst&#232;me d&#8217;informations lexicales dont nous proposons une mod&#233;lisation dans le formal-
isme des bases de donn&#233;es relationnelles comporte, comme nous l&#8217;avons vu plus haut, un nom-
bre cons&#233;quent de types d&#8217;informations. L&#8217;acc&#232;s &#224; l&#8217;information devant &#234;tre modulaire, dans
l&#8217;ensemble des types d&#8217;informations, nous avons diff&#233;renci&#233; sept sortes principales : les re-
strictions s&#233;lectionnelles, les repr&#233;sentations conceptuelles, les repr&#233;sentations s&#233;mantiques, les
r&#233;alisations syntaxiques par argument, les informations flexionnelles, les informations concer-
nant les familles de constructions syntaxiques, et par la suite, les informations d&#233;rivationnelles.
Nous donnerons dans un premier temps le sch&#233;ma entit&#233;-association des donn&#233;es du syst&#232;me
envisag&#233; ainsi que le sch&#233;ma relationnel correspondant en 3FN (troisi&#232;me forme normale).
Dans un deuxi&#232;me temps, nous aborderons les actions subies par le syst&#232;me ou produites par
lui. Pour synth&#233;tiser les choses, nous proposerons un sch&#233;ma conceptuel des traitements pour
les actions principales.
</p>
<p>3.1 Sch&#233;ma conceptuel et relationnel des donn&#233;es
</p>
<p>Le sch&#233;ma conceptuel des donn&#233;es du syst&#232;me d&#8217;informations lexicales propos&#233; est repr&#233;sent&#233;
dans la figure (1)4. Ce sch&#233;ma comporte une entit&#233; par type d&#8217;informations identifi&#233; ci-dessus.
</p>
<p>Lexeme
</p>
<p>Lemme
</p>
<p>Informations
flexionnelles
</p>
<p>ARG3
</p>
<p>semantique syntaxiques
</p>
<p>Restrictions
</p>
<p>Constructions
</p>
<p>Selectionnelles
</p>
<p>syntaxique
</p>
<p>Representation
</p>
<p>ARG2
Realisation
</p>
<p>ARG1
</p>
<p>conceptuelle
Representation
</p>
<p>ARGn
</p>
<p>(0&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(0&#8722;n)
(0&#8722;n)
</p>
<p>(0&#8722;n)
(0&#8722;n)
(0&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(1&#8722;n)
(1&#8722;n)
</p>
<p>(1&#8722;n)
(1&#8722;n)
(1&#8722;n)
</p>
<p>(1&#8722;n)
(1&#8722;n)
</p>
<p>(1&#8722;n)
</p>
<p>(1&#8722;n)
</p>
<p>(1&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(1&#8722;n)
</p>
<p>(1&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(1&#8722;n)
(0&#8722;n)
</p>
<p>(1&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(0&#8722;n)
</p>
<p>(1&#8722;n)(0&#8722;n) (0&#8722;1)
(0&#8722;1)
</p>
<p>(1&#8722;n)
</p>
<p>(1&#8722;1)
</p>
<p>(1&#8722;n)
</p>
<p>(1&#8722;n)
</p>
<p>(1&#8722;n)
</p>
<p>Figure 1: Le sch&#233;ma entit&#233; association des donn&#233;es du syst&#232;me
4Dans ce sch&#233;ma, toutes les entit&#233;s entour&#233;es de rectangles en pointill&#233;s repr&#233;sentent des donn&#233;es non encore
</p>
<p>accessibles.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Djam&#233; Seddah et Evelyne Jacquey
</p>
<p>Par ailleurs, en termes d&#8217;organisation des informations lexicales classiques, nous avons in-
sist&#233; sur plusieurs points : La variabilit&#233; s&#233;mantique et conceptuelle d&#8217;un m&#234;me lemme5
est repr&#233;sent&#233;e par les cardinalit&#233;s (N-M) des associations entre ces deux types d&#8217;informations
et l&#8217;entit&#233; LEMME.
</p>
<p>La variabilit&#233; des r&#233;alisations syntaxiques des arguments est repr&#233;sent&#233;e par des associations
de type (N-M) entre les entit&#233;s ARGUMENT et l&#8217;entit&#233; R&#201;ALISATION SYNTAXIQUE.
L&#8217;acc&#232;s direct aux informations propres &#224; chaque argument d&#8217;un lemme pr&#233;dicatif est rendu
possible via la d&#233;composition passant par les entit&#233;s ARGUMENT.
</p>
<p>Chaque forme fl&#233;chie, c&#8217;est-&#224;-dire chaque instance de l&#8217;entit&#233; LEX&#200;ME est suppos&#233;e corre-
spondre &#224; au plus une paire construite &#224; partir d&#8217;un lemme et d&#8217;une forme de flexion.
</p>
<p>Le reste des associations du sch&#233;ma peut &#234;tre class&#233; selon le type de cardinalit&#233;.
</p>
<p>Les associations ((0-n) - (1-n)) caract&#233;risent tout d&#8217;abord les liens entre les restrictions s&#233;lec-
tionnelles, les repr&#233;sentations conceptuelles, les repr&#233;sentations s&#233;mantiques, les r&#233;alisations
syntaxiques, et les arguments. Cela signifie que, pour tout argument, il y a au moins une infor-
mation de chacun des types cit&#233;s ci-dessus et il peut y en avoir plusieurs. En revanche, certaines
instances des types d&#8217;informations cit&#233;es peuvent ne pas caract&#233;riser une instance d&#8217;un argu-
ment donn&#233;, ou peuvent en caract&#233;riser plusieurs.
</p>
<p>La m&#234;me type d&#8217;association caract&#233;rise le lien entre une instance de lemme et une instance de
CONSTRUCTIONS SYNTAXIQUES.
</p>
<p>Les associations ((0-n) - (0-1)) caract&#233;risent le lien entre une instance de lemme et des instances
d&#8217;arguments. Cela signifie que pour une instance de lemme, il peut y avoir au plus une instance
de chaque type d&#8217;argument interne.
</p>
<p>L&#8217;association ((0-n) - (1-1)) caract&#233;rise uniquement le lien entre une instance de lemme et une
instance d&#8217;argument externe.
</p>
<p>Enfin, chacun des types d&#8217;entit&#233;s du sch&#233;ma en (1) comporte au moins un attribut IDENTIFI-
ANT et un attribut CONTENU dont la valeur est une cha&#238;ne de caract&#232;res. Pour tous les types
d&#8217;informations &#224; valeur non atomique, nous cr&#233;ons un attribut RESSOURCES dont la valeur est
le chemin du fichier contenant l&#8217;information, par exemple une description XML d&#8217;un sch&#232;me.
A terme, ces fichiers contiendront l&#8217;information dans un format commun &#224; l&#8217;ensemble du sys-
t&#232;me, mais qui reste &#224; d&#233;finir. Le format de cette information sera ensuite traduit par un ou
plusieurs module(s) particuliers dans le format requis par l&#8217;application client.
Le sch&#233;ma entit&#233;-association ci-dessus peut &#234;tre transform&#233; en sch&#233;ma relationnel en 3FN
(troisi&#232;me forme normale). Etant donn&#233;es les cardinalit&#233;s des associations, le sch&#233;ma rela-
tionnel comporte treize tables correspondant aux entit&#233;s et vingt tables correspondant aux asso-
ciations de type (N-M).
</p>
<p>5Dans le cas de mots homonymes, nous supposerons deux lemmes diff&#233;rents, par exemple fraise1 pour le fruit
et fraise2 pour l&#8217;outil. Dans le cas de mots lexicalement ambigu, un m&#234;me lemme correspondra &#224; deux n-uplets
distincts de l&#8217;entit&#233; REPR&#201;SENTATION S&#201;MANTIQUE, ce sera le cas de plateau par exemple.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Conceptualisation d&#8217;un syst&#232;me d&#8217;informations lexicales pour le T.A.L
</p>
<p>3.2 Les diff&#233;rentes actions possibles
</p>
<p>Comme le montre la figure (2), l&#8217;ensemble des traitements des donn&#233;es peut &#234;tre sch&#233;matis&#233; de
mani&#232;re globale. Ce sch&#233;ma est repr&#233;sent&#233; selon la m&#233;thode de conception MERISE6.
</p>
<p>System
Exit
</p>
<p>System
Exit
</p>
<p>card &lt; =2
Error Msg(c)
</p>
<p>User (type, rights)
Data
False
</p>
<p>Connection process
</p>
<p>Correct
Data
</p>
<p>Admin
</p>
<p>User&#8217;s data (b)
</p>
<p>a AND b AND c&lt;3
</p>
<p>Request (g)
</p>
<p>Results (i)Error Msg (l)Actions
Panel (d)
</p>
<p>SuccesChess
</p>
<p>Request Treatment
</p>
<p>d AND g AND h AND k
</p>
<p>Results (h)Error Msg (k)
</p>
<p>Deconnection
Msg (j)
</p>
<p>Chess
</p>
<p>Operation Treatment
</p>
<p>Succes
</p>
<p>e AND f AND i AND l
</p>
<p>Each kind of
operation (f)Connection required (a)
</p>
<p>Opening
Dialog (e)
</p>
<p>Figure 2: Le sch&#233;ma conceptuel des traitements du syst&#232;me
</p>
<p>On notera plusieurs points particuliers. Tout d&#8217;abord, lors de la proc&#233;dure de connexion, le
syst&#232;me est suppos&#233; reconna&#238;tre l&#8217;utilisateur d&#233;sirant se connecter, et en particulier son type :
&#8220;utilisateur&#8221; ou &#8220;administrateur&#8221;. S&#8217;il est du type &#8220;utilisateur&#8221;, le syst&#232;me est suppos&#233; d&#233;tenir
les informations d&#233;crivant ses droits. Cela signifie donc que le syst&#232;me dispose d&#8217;une base
contenant ces donn&#233;es. Nous ne l&#8217;avons pas repr&#233;sent&#233;e dans la mesure o&#249; elle ne nous semble
pas centrale pour notre sujet, l&#8217;organisation des informations lexicales.
Ensuite, l&#8217;ensemble des traitements du syst&#232;me est subdivis&#233; en deux sous-ensembles en fonc-
tion du type d&#8217;utilisateur : &#8220;utilisateur&#8221; ou &#8220;administrateur&#8221;. En particulier, les r&#233;ponses du
syst&#232;me varient d&#8217;un type &#224; l&#8217;autre : plus conviviales et plus limit&#233;es (r&#233;sultats d&#8217;interrogation
ou messages d&#8217;erreurs aussi explicites et informatifs que possible) avec le type &#8220;utilisateur&#8221;,
pas n&#233;cessairement conviviales et plus &#233;tendues avec le type &#8220;administrateur&#8221; dans la mesure
o&#249; celui-ci peut proc&#233;der &#224; tout type d&#8217;op&#233;rations sur le syst&#232;me (interrogation, mise &#224; jour,
insertion, suppression). On pourrait encore imaginer un troisi&#232;me type, le type &#8220;contributeur&#8221;.
Les contributions seraient v&#233;rifi&#233;es et int&#233;gr&#233;es ensuite par un administrateur.
</p>
<p>Enfin, la proc&#233;dure de connexion est autoris&#233;e &#224; &#233;chouer deux fois seulement, ce qui est repr&#233;sent&#233;
dans la condition de synchronisation &#8220;s1&#8221; par la condition &#8220;c&lt;3&#8221;.
</p>
<p>6Les ronds repr&#233;sentent des donn&#233;es ou &#8220;&#233;v&#233;nements&#8221;, les rectangles repr&#233;sentent des op&#233;rations avec des
donn&#233;es d&#8217;entr&#233;e et des donn&#233;es de sortie, et les triangles repr&#233;sentent des conditions de synchronisation entre les
donn&#233;es d&#8217;entr&#233;e pour le d&#233;clenchement d&#8217;une op&#233;ration.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Djam&#233; Seddah et Evelyne Jacquey
</p>
<p>4 Validation conceptuelle de la mod&#233;lisation propos&#233;e
</p>
<p>Analyse syntaxique : L&#8217;analyseur dont nous avons &#233;tudi&#233; les besoins est un analyseur TAG
(Lopez, 1999). Comme nous l&#8217;avons vu en (2), l&#8217;une des difficult&#233;s avec ce type d&#8217;analyseur
est l&#8217;explosion du nombre d&#8217;arbres formant le lexique, explosion qui rend leur gestion difficile.
Le syst&#232;me d&#8217;informations lexicales propos&#233; peut fournir une aide importante via l&#8217;organisation
des donn&#233;es qu&#8217;il suppose. Ainsi, pour instancier les arbres d&#233;crivant la construction passive
avec sujet nominal, une solution serait de s&#233;lectionner tous les lex&#232;mes &#233;tant au participe pass&#233;
avec l&#8217;auxiliaire &#234;tre et ayant un objet direct nominal. Une fois cette s&#233;lection faite, il suf-
fit d&#8217;associer &#224; chaque instance un arbre d&#233;crivant la construction passive en question. Pour
ce faire, une requ&#234;te appropri&#233;e en alg&#232;bre relationnelle sera appliqu&#233;e &#224; l&#8217;ensemble des rela-
tions LEMME(id_lem, contenu, id_arg1, id_arg2, id_arg3, ..., id_argn), ARG2-RSYNT(id_arg2,
id_rsynt), RSYNT(id_rsynt, contenu), LEXEME(id_lex, contenu, id_lem, id_flex) et FLEX-
IONS(id_flex, contenu). L&#8217;ensemble des lemmes ayant un objet direct nominal est &#233;gal au r&#233;-
sultat de la requ&#234;te
&#1;&#0; &#1; &#2;
</p>
<p>&#0;&#1;_&#2;&#3;&#4;
</p>
<p>&#3;&#2;&#3;
</p>
<p>&#0;&#1;_&#5;&#6;&#7;&#0;
</p>
<p>&#3;&#2;&#3;
</p>
<p>&#0;&#1;_&#6;&#8;&#9;&#10;&#11;
</p>
<p>&#3;&#3;&#4;
</p>
<p>&#1;&#12;&#13;&#10;&#11;&#3;&#10;&#14;&#2;
</p>
<p>&#0;
</p>
<p>&#10;&#15;
</p>
<p>&#0;
</p>
<p>&#3;
</p>
<p>&#3;RSYNT&#4;&#4;&#5; ARG2-RSYNT&#4;&#5; LEMME&#4;&#4;.
L&#8217;ensemble des lemmes ayant une forme passive et un objet direct nominal est &#233;gal au r&#233;sultat
de la requ&#234;te
&#1;&#5; &#1; &#2;
</p>
<p>&#0;&#1;_&#2;&#3;&#16;
</p>
<p>&#3;&#2;&#3;
</p>
<p>&#0;&#1;_&#17;&#2;&#3;&#16;
</p>
<p>&#3;&#4;
</p>
<p>&#1;&#12;&#13;&#10;&#11;&#3;&#10;&#14;&#2;
</p>
<p>&#0;
</p>
<p>&#15;&#15;&#5;&#8;&#8;&#4;&#3;&#0;&#15;&#5;&#8;&#8;&#0;&#17;
</p>
<p>&#0;
</p>
<p>&#3;
</p>
<p>&#3;FLEXIONS&#4;&#5; &#2;&#3;
&#0;&#1;_&#2;&#3;&#4;
</p>
<p>&#3;&#1;&#0;&#5; LEXEME&#4;&#4;&#4;.
Il suffit alors de modifier la table LEX&#200;ME - CONSTRUCTIONS SYNTAXIQUES pour toutes
les instances diff&#233;rentes de l&#8217;attribut id_lex et de modifier la table CONSTRUCTIONS SYN-
TAXIQUES en y ins&#233;rant un nouvel n-uplet de la forme (csynt_0001, &#8217;constr. passive en par&#8217;,
file=ArbrePassifPar).
</p>
<p>M&#233;ta-grammaires : Telle qu&#8217;elle est construite actuellement, la m&#233;ta-grammaire de B. Gaiffe
et de B. Crabb&#233;7, bas&#233;e sur (Candito, 1999), produit des sch&#232;mes non instanci&#233;s d&#233;crits par des
structures de traits (cf. section 2.1). Ces structures de traits d&#233;crivent les propri&#233;t&#233;s des sch&#232;mes,
ces propri&#233;t&#233;s n&#8217;&#233;tant pas forc&#233;ment structur&#233;es comme le sont les informations lexicales. Les
sch&#232;mes d&#233;crivant les diff&#233;rentes structures passives par exemple vont au moins contenir la
paire attribut-valeur [PASSIF = +].
Cette information n&#8217;&#233;tant pas directement accessible dans le syst&#232;me d&#8217;informations d&#233;crit
en section 3, deux solutions sont possibles. La premi&#232;re consiste &#224; demander &#224; l&#8217;utilisateur
de traduire les sch&#232;mes en question sous la forme de requ&#234;tes interpr&#233;tables par le syst&#232;me
d&#8217;informations. Cette premi&#232;re solution n&#8217;est cependant pas conforme &#224; nos objectifs, ni m&#234;me
avec le sch&#233;ma conceptuel de traitement (section 3.2), car l&#8217;utilisateur n&#8217;est pas suppos&#233; con-
na&#238;tre la structure des donn&#233;es du syst&#232;me. Une seconde solution consiste donc &#224; construire
un traducteur pour les structures de traits d&#233;crivant les sch&#232;mes. Ce traducteur sera int&#233;gr&#233;
au syst&#232;me d&#8217;informations sous la forme d&#8217;un module ind&#233;pendant, activ&#233; uniquement lorsque
l&#8217;application client sera une m&#233;ta-grammaire.
</p>
<p>La conception d&#8217;un tel traducteur demande n&#233;anmoins la synth&#232;se entre les informations lex-
icales, plus ou moins accessibles comme la valence, la r&#233;alisation des arguments, l&#8217;existence
d&#8217;une forme participe pass&#233; avec auxiliaire &#234;tre par exemple, et le comportement syntaxique
des lex&#232;mes.
</p>
<p>7Travail de doctorat en cours et non encore publi&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Conceptualisation d&#8217;un syst&#232;me d&#8217;informations lexicales pour le T.A.L
</p>
<p>Extraction d&#8217;informations : Le syst&#232;me qui nous sert actuellement de &#8220;laboratoire d&#8217;exp&#233;riences&#8221;
est le syst&#232;me VULCAIN (cf. section 2.4). L&#8217;une de ses particularit&#233;s est le lien existant entre
les entr&#233;es lexicales et les concepts de l&#8217;ontologie du domaine.
</p>
<p>Une fois ces liens d&#233;finis dans (Todirascu &amp; Romary, parution en mai 2002), il sera possi-
ble de les int&#233;grer sous la forme d&#8217;instances de la table LEX&#200;ME - REPR&#201;SENTATION CON-
CEPTUELLE. Le syst&#232;me VULCAIN pourra ainsi se d&#233;charger de cette information qui lui sera
rendue dynamiquement par le syst&#232;me d&#8217;informations lexicales.
</p>
<p>Une telle perspective demande cependant l&#224; encore un co&#251;t de traduction, et cela pour deux
raisons. Tout d&#8217;abord, le lexique de VULCAIN est d&#233;crit en TAGML. L&#8217;extraction du lex&#232;me de
chaque entr&#233;e lexicale demande donc une premi&#232;re traduction. Ensuite, VULCAIN attend une
repr&#233;sentation conceptuelle exprim&#233;e en logique de description, ce qui demande une seconde
traduction.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Au vu du besoin croissant dans le domaine du TAL de ressources lexicales normalis&#233;es et li-
brement accessibles, et dans la suite du lexique MULTEXT, nous avons jet&#233; les bases d&#8217;un
syst&#232;me d&#8217;informations lexicales destin&#233; &#224; r&#233;pondre aux besoins des applications, diff&#233;rents par
leur nature et par le format des donn&#233;es attendues.
</p>
<p>Les sch&#233;mas conceptuels des donn&#233;es et des traitements peuvent &#234;tre vus comme une traduction,
dans le cadre des bases de donn&#233;es relationnelles, d&#8217;un format abstrait et d&#8217;une organisation des
donn&#233;es lexicales. Ces sch&#233;mas, quoique non suffisants, ont permis d&#8217;approcher plus pr&#233;cis&#233;-
ment le probl&#232;me complexe que constitue un tel projet. En particulier, les quelques exemples
d&#8217;applications pris en compte ont montr&#233; la diversit&#233; des donn&#233;es attendues, tant pour ce qui de
leur organisation que pour ce qui est de leur format.
</p>
<p>Plusieurs directions de recherche nous semblent dont importantes. Tout d&#8217;abord, red&#233;finir un
format abstrait des donn&#233;es qui permettent une traduction aussi peu co&#251;teuse que possible
dans les diff&#233;rents formats de donn&#233;es attendus (structures de traits, arbres TAG et TAGML,
logique de description, logique des pr&#233;dicats, &#0;-calcul). D&#8217;autre part, d&#233;finir plusieurs formats
d&#8217;&#233;changes entre le syst&#232;me d&#8217;informations lexicales d&#8217;un c&#244;t&#233;, et certaines applications carac-
t&#233;ristiques du TAL. Enfin, mais cela restera une t&#226;che permanente, il nous semble indispensable
d&#8217;int&#233;grer les r&#233;sultats d&#8217;&#233;tudes lexicales existantes et exploitables pour enrichir les donn&#233;es
actuelles.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A. (1991). Une grammaire lexicalis&#233;e d&#8217;arbres adjoints pour le fran&#231;ais. PhD thesis, Paris 7.
BRILL E. (1992). A simple rule-based part of speech tagger. In Proc. of the Third Conference on Applied
Natural Language Processing, p. 152&#8211;155, Trento, Italy.
</p>
<p>CANDITO M.-H. (1999). Organisation modulaire et param&#233;trable de grammaires &#233;lectroniques lexical-
is&#233;es, Application au fran&#231;ais et &#224; l&#8217;italien. PhD thesis, Universit&#233; de Paris 7.
DELOUPY C. (1995). La m&#233;thode d&#8217;&#233;tiquetage d&#8217;&#201;ric brill. Traitement Automatique des Langues.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Djam&#233; Seddah et Evelyne Jacquey
</p>
<p>GARDENT C. (2002). Proposition d&#8217;Action Concert&#233;e de Recherche INRIA pour le projet GENI. Rap-
port interne, INRIA.
</p>
<p>IDE N. &amp; V&#201;RONIS J. (1994). Multext (multilingual tools and corpora). In 14th Conference on Com-
putational Linguistics (COLING&#8217;94), Kyoto, Japan.
JACKENDOFF R. (1990). Semantic Structures. MIT Press, Cambridge, MA.
JOSHI A., LEVI L. &amp; TAKAHASHI M. (1975). Tree adjunct grammars. Journal of the Computer and
System Sciences.
</p>
<p>LOPEZ P. (1999). Analyse d&#8217;&#233;nonc&#233;s oraux pour le dialogue homme machine &#224; l&#8217;aide de Grammaires
Lexicalis&#233;es d&#8217;arbres. PhD thesis, Universit&#233; Henry Poincar&#233; Nancy 1.
</p>
<p>REITER E. &amp; DALE R. (2000). Building Natural Language Generation Systems. Cambridge University
Press.
</p>
<p>ROMARY L. (2001). Towards an abstract representation of terminological data collections - the tmf
model. In TAMA 2001, Terminology in Advanced Microcomputer Application.
</p>
<p>SEDDAH D. (1998). Mesure des poids et distances pour l&#8217;inf&#233;rence de grammaires stochastiques. Mas-
ter&#8217;s thesis, Universit&#233; Paris 7.
</p>
<p>TODIRASCU A. &amp; ROMARY L. (parution en mai 2002). Le projet VULCAIN, rapport final. Rapport
interne, LORIA.
</p>
<p>VIJAY-SHANKER K. &amp; JOSHI A. K. (1985). Some computational properties of tree adjoinig grammars.
In COLING, Chicago, USA.
</p>
<p>V&#201;RONIS J. &amp; KHOURI L. (1995). Etiquetage grammatical multilingue: le projet multext. Traitement
Automatique des Langues.</p>

</div></div>
</body></html>