<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Classification Automatique de messages : une approche hybride</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2002, Nancy, 24-27 juin 2002 
</p>
<p>Classification Automatique de messages : 
une approche hybride 
</p>
<p>O. Nouali 
</p>
<p>(1) Laboratoire des Logiciels de base, CE.R.I.S.T,  
Rue des 3 fr&#232;res A&#239;ssiou, Ben Aknoun, Alger, Alg&#233;rie 
</p>
<p>Fax : 213 21 912126 - T&#233;l. : 213 21 916211 
(2)  LPL- Universit&#233; de Provence 
</p>
<p>29, Av. Robert Schuman, F-13621 Aix-en-Provence, France. 
Fax: +33 (0).42.59.50.96- T&#233;l.: +33 (0) 42.95.36.23 
</p>
<p>E-mail : onouali@mail.cerist.dz 
</p>
<p> 
Mots-clefs &#8211; Keywords 
Filtrage d&#8217;information, e-mail, classification de messages, propri&#233;t&#233;s linguistiques, r&#233;seaux de 
neurones, filtrage d&#8217;email. 
</p>
<p>Information filtering, e-mail, information classification, linguistic proprieties, neural network, 
Filters, e-mail filtering. 
</p>
<p>R&#233;sum&#233; - Abstract  
Les syst&#232;mes actuels de filtrage de l&#8217;information sont bas&#233;s d&#8217;une fa&#231;on directe ou indirecte 
sur les techniques traditionnelles de recherche d&#8217;information (Malone, Kenneth, 1987), 
(Kilander, Takkinen, 1996). Notre approche consiste &#224; s&#233;parer le processus de classification 
du filtrage proprement dit. Il s&#8217;agit d&#8217;effectuer un traitement reposant sur une compr&#233;hension 
primitive du message permettant d&#8217;effectuer des op&#233;rations de classement. Cet article d&#233;crit 
une solution pour classer des messages en se basant sur les propri&#233;t&#233;s linguistiques v&#233;hicul&#233;es 
par ces messages. Les propri&#233;t&#233;s linguistiques sont mod&#233;lis&#233;es par un r&#233;seau de neurone. A 
l'aide d'un module d'apprentissage, le r&#233;seau est am&#233;lior&#233; progressivement au fur et &#224; mesure 
de son utilisation. Nous pr&#233;sentons &#224; la fin les r&#233;sultats d&#8217;une exp&#233;rience d&#8217;&#233;valuation. 
</p>
<p>The current approaches in information filtering are based directly or indirectly on the 
traditional methods of information retrieval (Malone, Kenneth, 1987), (Kilander, Takkinen, 
1996). Our approach to email filtering is to separate classification from filtering. Once the 
classification process is complete, the filtering takes place. This paper presents an approach to 
classify e-mail, based on linguistic features model. The main feature of the model is its 
representation by a neural network and its learning capability. At the end, to measure the 
approach performances, we illustrate and discuss the results obtained by experimental 
evaluations. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>O. Nouali 
</p>
<p>1 Introduction  
Le courrier &#233;lectronique est le mode de communication grandissant le plus rapidement 
</p>
<p>aujourd&#8217;hui. Cependant, les utilisateurs d&#8217;Internet se retrouvent assez vite submerg&#233;s de 
quantit&#233;s astronomiques de messages dont le traitement n&#233;cessite un temps consid&#233;rable.  
Dans la pratique, la plupart des syst&#232;mes de filtrage du courrier &#233;lectronique existants 
enregistrent des lacunes ou faiblesses sur l&#8217;efficacit&#233; du filtrage. Certains syst&#232;mes sont bas&#233;s 
seulement sur le traitement de la partie structur&#233;e (un ensemble de r&#232;gles sur l&#8217;ent&#234;te du 
message), et d&#8217;autres sont bas&#233;s sur un balayage superficiel de la partie texte du message 
(occurrence d&#8217;un ensemble de mots cl&#233;s d&#233;crivant les int&#233;r&#234;ts de l&#8217;utilisateur). 
 
 Cet article d&#233;crit une approche pour filtrer le courrier &#233;lectronique. Elle suppose que 
l&#8217;automatisation du processus de filtrage n&#233;cessite une phase importante de classification, qui 
constitue en quelque sorte un pr&#233;-filtrage.  
Apr&#232;s une pr&#233;sentation de l'architecture et du fonctionnement g&#233;n&#233;ral du syst&#232;me de 
classification, une description du r&#233;seau de neurones adopt&#233; pour notre application est 
donn&#233;e. Nous pr&#233;sentons &#224; la fin les r&#233;sultats d&#8217;une exp&#233;rience d&#8217;&#233;valuation. 
</p>
<p>2 Approche propos&#233;e 
 Une id&#233;e pour classer les messages, est de cr&#233;er des espaces de messages (un espace 
pour chaque type). Et chaque nouveau message se trouvant &#234;tre proche des messages de l&#8217;un 
des espaces d&#233;finis, est alors consid&#233;r&#233; comme pertinent pour cet espace. 
Apr&#232;s &#233;tude des diff&#233;rentes approches possibles pour le domaine du filtrage, ainsi que les 
diff&#233;rentes propri&#233;t&#233;s linguistiques des courriers &#233;lectroniques (Kilander, Takkinen, 1996), 
(Nouali 2000), (Kosseim, Lapalme 2001), nous proposons une approche qui consiste &#224; s&#233;parer 
la classification du filtrage. En effet, afin de mieux classer un message, notre syst&#232;me  
impl&#233;mente un mod&#232;le linguistique qui repr&#233;sente et mod&#233;lise une typologie de messages, 
dont la connaissance est construite initialement sur la base d&#8217;analyse de traits linguistiques 
associ&#233;s &#224; chaque espace de messages. Ce mod&#232;le sera enrichi progressivement au fur et &#224; 
mesure de son utilisation. De plus, pour le processus de filtrage, les int&#233;r&#234;ts de l'utilisateur 
sont d&#233;crits par des profils et ils sont introduits dans le syst&#232;me sous forme de mots cl&#233;s et/ou 
sous forme de texte.  
</p>
<p>3 Architecture et Fonctionnement global du Syst&#232;me 
 
</p>
<p>                      Pr&#233;-            Repr&#233;sentation 
                Traitement                  Analyse                Linguistique                     classification            
</p>
<p>                    
   Message                                             Cat&#233;gorie 
</p>
<p>               du message 
 
              
                                Feed-back 
</p>
<p>              Stop-liste          
 
 
</p>
<p>Figure 1 : une architecture globale du syst&#232;me 
</p>
<p>Apr&#232;s r&#233;cup&#233;ration de chaque message, un module de pr&#233;-traitement est lanc&#233; pour isoler les 
diff&#233;rents champs et le pr&#233;parer aux diff&#233;rentes &#233;tapes ult&#233;rieures. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Classification Automatique de messages : une approche hybride 
</p>
<p>Apr&#232;s l&#8217;&#233;tape de pr&#233;-traitement, le message subit une analyse linguistique, qui est 
ind&#233;pendante des int&#233;r&#234;ts de l&#8217;utilisateur. Il s&#8217;agit d&#8217;effectuer un traitement reposant sur une 
compr&#233;hension primitive du message. Le but de l&#8217;analyse est de d&#233;terminer les informations 
pertinentes &#224; repr&#233;senter, c'est &#224; dire d&#233;terminer les informations v&#233;hicul&#233;es par ce message. Il 
s&#8217;agit d&#8217;analyser et d&#8217;extraire les traits linguistiques le caract&#233;risant. La sortie de l&#8217;analyse 
passe par un arbre de classification qui affecte automatiquement une cat&#233;gorie au message 
trait&#233; constituant en quelque sorte un pr&#233;-filtrage. Apr&#232;s l&#8217;&#233;tape de classification, le message 
passe par un module de filtrage qui permet d&#8217;&#233;valuer son degr&#233; d&#8217;importance selon les 
sp&#233;cificit&#233;s de l&#8217;utilisateur et de prendre, en cons&#233;quence, des actions de filtrage, tel que 
supprimer, sauvegarder, signaler,&#8230; 
 
 Le facteur intelligent du syst&#232;me est sa facult&#233; d&#8217;apprendre et d&#8217;am&#233;liorer l&#8217;efficacit&#233; 
du processus de classification. Le syst&#232;me dispose d&#8217;un apprentissage assist&#233;  appel&#233; feed-
back o&#249; l&#8217;utilisateur est invit&#233; &#224; donner son avis, et par cons&#233;quent modifier le comportement 
du syst&#232;me.  
</p>
<p>4 Mod&#232;le linguistico-neuronal 
Le mod&#232;le repr&#233;sentant la typologie des messages est construit &#224; partir  d&#8217;un ensemble 
</p>
<p>de corpus de messages (messages personnels, professionnels,&#8230;). Apr&#232;s une analyse manuelle 
de chaque corpus, une liste de propri&#233;t&#233;s le caract&#233;risant, est &#233;labor&#233;e.  
Une approche int&#233;ressante pour mod&#233;liser cette typologie est le mod&#232;le connexionniste qui a 
pour but d&#8217;imiter certaines fonctions du cerveau humain. Il consiste &#224; repr&#233;senter les 
informations sous forme d&#8217;un r&#233;seau et &#224; permettre au syst&#232;me de faire &#233;voluer ce r&#233;seau par 
la fonction d&#8217;apprentissage. Les n&#339;uds du r&#233;seau repr&#233;sentent les concepts et les arcs 
repr&#233;sentent les associations entre les concepts (Denis, Gilleron, 2000), (Davalo, Naim, 
1993).  
Le r&#233;seau de neurones, adopt&#233; pour notre syst&#232;me, est repr&#233;sent&#233; comme suit (figure 2): 
</p>
<p>Ce r&#233;seau est compos&#233; de trois couches: 
&#131; La couche Mk repr&#233;sentant l&#8217;entr&#233;e du r&#233;seau, est cr&#233;&#233;e dynamiquement &#224; chaque 
</p>
<p>r&#233;cup&#233;ration d&#8217;un nouveau courrier. L&#8217;existence du neurone i sur cette couche implique la 
pr&#233;sence du trait linguistique ti dans le texte du message re&#231;u. Il existe un lien synaptique qik 
reliant chaque neurone du courrier &#224; un terme de la couche T refl&#233;tant le poids de ce terme 
dans  le message Mk. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>O. Nouali 
</p>
<p>&#131; La couche T repr&#233;sente l&#8217;ensemble des propri&#233;t&#233;s linguistiques existantes dans la base des 
messages. Ces propri&#233;t&#233;s sont reli&#233;es entre elles par des liens wij repr&#233;sentant la cooccurrence 
de deux termes ti et tj. Chaque terme de cette couche est reli&#233; &#224; la couche P par des liens pim 
valu&#233;s, tel que m appartient &#224; l&#8217;ensemble des traits linguistiques repr&#233;sentant le type du 
message.  
</p>
<p>&#131; La couche P ou sortie du r&#233;seau, repr&#233;sente les diff&#233;rents types de messages  regroup&#233;s en 
domaines g&#233;n&#233;riques (type personnel, type professionnel, &#8230;). 
</p>
<p> 
Le r&#233;seau re&#231;oit en entr&#233;e un seuil de similarit&#233; S (calcul&#233; &#224; partir du corpus initial 
d&#8217;exemples) et un vecteur de termes V (repr&#233;sentant le message &#224; analyser). Il tente de 
trouver au moins un type dont la valeur de similarit&#233; avec le vecteur V d&#233;passe le seuil S. En 
effet, le vecteur V (couche du message Mk) active  les termes du message sur la couche T. 
Ces termes activ&#233;s sur T vont propager ensuite leurs activations &#224; leurs proches voisins. Enfin 
les termes activ&#233;s directement &#224; partir de la couche Mk et ceux activ&#233;s par propagation, vont 
envoyer leurs signaux d&#8217;activation vers la couche P. Les termes de la couche P recevant des 
signaux suffisants, s&#8217;activent &#224; leur tour et constituent les types correspondants au message 
re&#231;u. Le type le plus repr&#233;sentatif du message constitue la r&#233;ponse du r&#233;seau.  
La fonction d&#8217;activation choisie pour toutes les couches est la fonction sigmo&#239;de d&#233;finie par 
(Davalo, Naim, 1993), (Nouali, 2000): 
</p>
<p>                           
1
1)( +
</p>
<p>&#8722;= x
x
</p>
<p>e
exf                                                             (1) 
</p>
<p>5 Types de classification 
</p>
<p>5.1 Classification sans propagation (C.S.P.) 
</p>
<p> Le vecteur du message Mk repr&#233;sentant le signal d&#8217;entr&#233;e sera propag&#233; &#224; la couche T, 
o&#249; chaque neurone de cette couche calcule son entr&#233;e selon la formule suivante : 
                                                     ii
</p>
<p>T qtE =)(                                                 (2) 
O&#249; ti repr&#233;sente un trait linguistique et qi ={1 si ti est trouv&#233; dans le texte du message et 0 
sinon} 
Chacun des termes de T sera ensuite activ&#233; selon l&#8217;&#233;quation :  
                                                   ))(()( i
</p>
<p>T
i
</p>
<p>T tEftS =                                      (3) 
O&#249;  f  est la fonction  Sigmo&#239;de. 
 
Chaque n&#339;ud activ&#233; de la couche T propage sa sortie &#224; travers les liens pij vers la couche P. 
Les termes de cette couche vont &#224; leur tour &#233;valuer leurs entr&#233;es pond&#233;r&#233;es selon la formule 
suivante (Davalo, Naim, 1993), (Nouali, 2000): 
</p>
<p>                                                        iji
T
</p>
<p>i
</p>
<p>T
j
</p>
<p>P ptSPE ).()(
1
&#8721;
=
</p>
<p>=                            (4) 
Puis s&#8217;activeront selon la formule: 
</p>
<p>                                                    ))(()( jj
P PEfPS
</p>
<p>P=                                  (5) 
Les termes activ&#233;s dont la sortie )( j
</p>
<p>P PS  est sup&#233;rieure au seuil S sont consid&#233;r&#233;s comme 
repr&#233;sentatifs du message et sont tri&#233;s par ordre d&#233;croissant. La valeur la plus grande est 
renvoy&#233;e en sortie. Dans le cas o&#249; aucun terme n&#8217;a atteint le seuil S la valeur 0 est renvoy&#233;e. 
 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Classification Automatique de messages : une approche hybride 
</p>
<p>5.2 Classification avec propagation (C.A.P.) 
</p>
<p> La propagation se fait gr&#226;ce &#224; l&#8217;extension des signaux d&#8217;entr&#233;e &#224; travers les liens de 
cooccurrence entre les traits linguistiques. Dans ce mode de classification, apr&#232;s qu&#8217;un n&#339;ud 
&#233;value son activation, il va la transmettre aux proches voisins, &#224; travers les liens de 
cooccurrence, ce qui implique la reformulation du vecteur d&#8217;entr&#233;e V. 
Les n&#339;uds termes activ&#233;s par propagation calculent leurs entr&#233;es par (Davalo, Naim, 1993), 
(Nouali, 2000): 
</p>
<p>                                               iji
T
</p>
<p>i
</p>
<p>T
i
</p>
<p>T wtStE ).()(
1
&#8721;
=
</p>
<p>=                                 (6) 
Et seront activ&#233;s selon la formule (3). 
</p>
<p>6 Evaluation 
 Pour r&#233;aliser notre exp&#233;rience, nous avons d&#233;but&#233; par l&#8217;&#233;tude d&#8217;un corpus de 150 
messages. Il regroupe une vari&#233;t&#233; de types de messages : Personnels (55), professionnels (70), 
ind&#233;sirables (15),... Apr&#232;s une analyse manuelle du corpus, nous avons &#233;labor&#233; une liste de 
propri&#233;t&#233;s linguistiques caract&#233;risant chaque type de messages. Nous nous sommes limit&#233;s &#224; 
quatre types g&#233;n&#233;riques de messages pour construire notre mod&#232;le (personnel, appels aux 
communications, Spam et autres). 
  
L&#8217;exp&#233;rience consiste &#224;  pr&#233;senter au syst&#232;me en deux cas diff&#233;rents, un ensemble de courriers 
&#224; filtrer en plusieurs sessions. Puis mesurer &#224; chaque fois la pr&#233;cision et le rappel et effectuer 
un apprentissage assist&#233; pour mesurer son efficacit&#233; et son influence sur les deux facteurs.  
 
   Pr&#233;cision       Pr&#233;cision 
 
 
 
 
 
 
 
 
                       Rappel               Rappel 
 
 
  
 
 
 
 
 
</p>
<p>Apr&#232;s plusieurs sessions d&#8217;apprentissage assist&#233;s, nous constatons que la convergence du 
mod&#232;le de C.A.P. vers un mod&#232;le de classification satisfaisant est plus rapide que celle du 
mod&#232;le de C.S.P (figure 3). En effet, dans le mod&#232;le C.A.P., la cooccurrence des traits 
linguistiques est prise en consid&#233;ration, ce qui permet d&#8217;augmenter le taux de rappel tout en 
gardant une bonne pr&#233;cision. Par exemple, en ce qui concerne les messages de type personnel, 
on obtient un taux de filtrage avec 92% de pr&#233;cision pour un rappel de 70%.  
</p>
<p>0,1 0,2 0,3 0,4 0,5 0,6 0,7 0,8 0,9
</p>
<p>0 
0,1 
0,2 
0,3 
0,4 
0,5 
0,6 
0,7 
0,8 
0,9 
</p>
<p> 1er Session
 2&#232;me Session
3&#232;me Session
</p>
<p>0,1 0,2 0,3 0,4 0,5 0,6 0,7 0,8 0,9 
</p>
<p>0
0,1
0,2
0,3
0,4
0,5
0,6
0,7
0,8
0,9
</p>
<p>1
</p>
<p>Mod&#232;le C.S.P Mod&#232;le C.A.P 
</p>
<p>Figure 3: Taux de rappel et de pr&#233;cision </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>O. Nouali 
</p>
<p>7 Conclusion  
 Le syst&#232;me d&#233;velopp&#233; permet d&#8217;analyser et d&#8217;attribuer une cat&#233;gorie aux messages en 
se basant sur les propri&#233;t&#233;s linguistiques v&#233;hicul&#233;es par ces messages. Ces propri&#233;t&#233;s sont 
mod&#233;lis&#233;es par un r&#233;seau de neurone. Chaque n&#339;ud du r&#233;seau correspond &#224; un trait 
linguistique. Chaque trait linguistique est pond&#233;r&#233; par un poids qui repr&#233;sente son degr&#233; 
d'importance. Le r&#233;seau est construit initialement &#224; partir d'un petit corpus de messages et qui 
est enrichi progressivement au fur et &#224; mesure de l'utilisation du mod&#232;le. Et ceci, &#224; l'aide d'un 
module d'apprentissage qui permet de modifier la pond&#233;ration des propri&#233;t&#233;s linguistiques 
selon les jugements de l&#8217;utilisateur. L'apprentissage assist&#233; (feed-back) permet au syst&#232;me 
d&#8217;approcher la pertinence de l&#8217;utilisateur et de s&#8217;adapter ainsi &#224; ses besoins en lui permettant 
la modification, l&#8217;ajout et la suppression de propri&#233;t&#233;s. 
Les r&#233;sultats de tests obtenus sur notre petit corpus semblent satisfaisants. N&#233;anmoins, pour 
tester l&#8217;adaptabilit&#233; de l&#8217;approche, il serait int&#233;ressant d&#8217;&#233;tendre les tests sur un &#233;chantillon de 
messages plus important (par exemple, les forums de discussion qui g&#233;n&#232;rent des flux 
consid&#233;rables de messages et qui sont relativement typ&#233;s du point de vue th&#233;matique).  
D&#8217;autres part, l&#8217;&#233;valuation a &#233;t&#233; faite par un calcul des mesures Pr&#233;cision/Rappel. Nous 
comptons utiliser la nouvelle m&#233;trique, appel&#233;e fonction d&#8217;utilit&#233;, fonction d&#8217;efficacit&#233; ou 
fonction de gain (Hull, 1998), pour positionner notre syst&#232;me par rapport aux autres syst&#232;mes 
de l&#8217;&#233;tude TREC-7 en comparant les scores. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Copeck T., Barker K., Delisle S., Szpakowicz S. (2000), Automating the Measurement of 
Linguistic Features to Help Classify Texts as Technical, Conference TALN2000, Lausanne. 
</p>
<p>Davalo E., Naim P. (1993), Des R&#233;seaux de Neurones, Edition Eyrolles. 
</p>
<p>Denis F., Gilleron R. (2000), Apprentissage &#224; partir d&#8217;exemples, Notes de cours, Universit&#233; 
Charles de Gaulle, Lille3. 
</p>
<p>Hull D. (1998), &#8220;The TREC-7 Filtering Track: Description and Analysis&#8221;, dans les actes de 
Text Retrieval Conference (TREC), University of Maryland. 
</p>
<p>Kilander F., Takkinen J. (1996), Information ritrieval and information filtering (IRIF), spring 
96: Classification &amp; Filtering of Internet messages.  
http://www.ida.liu.se/labs/iislab/courses/irif/irif_filtering_sw.html 
</p>
<p>Kosseim L., Lapalme G. (2001), Crit&#232;res de selection d&#8217;une approche pour le suivi 
automatique du courriel, RALI, DIRO, Universit&#233; de Montr&#233;al. 
</p>
<p>Michel C. (1999), Evaluation de syst&#232;mes de recherche d&#8217;information, comportant une 
fonctionnalit&#233; de filtrage, par des mesures endog&#232;nes, th&#232;se de doctorat en sciences de 
l&#8217;information et de la communication, Universit&#233; Lumi&#232;re LyonII. 
</p>
<p>Malone T. W., Kenneth R. (1987), &quot;Intelligent information sharing systems&quot;, Computing 
practices, Communications at ACM, volume 30, N&#176;5. 
</p>
<p>Nouali O., Belghoul F., Abdelaziz Y.R. (2000), Syst&#232;me de filtrage du courrier &#233;lectronique: 
E-FILTER, M&#233;moire d&#8217;ing&#233;nieurs, INI, Alger. </p>

</div></div>
</body></html>