<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annotation des descriptions d&#233;finies : le cas des reprises par les r&#244;les th&#233;matiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2002, Nancy, 24-27 juin 2002
</p>
<p>Annotation des descriptions d&#233;finies : le cas des reprises par les
r&#244;les th&#233;matiques
</p>
<p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>LORIA
Campus Scientifique
</p>
<p>BP 239
54 506 Vandoeuvre L&#232;s Nancy
</p>
<p>helene.manuelian@loria.fr
Fin de th&#232;se : d&#233;cembre 2003
</p>
<p>Mots-clefs &#8211; Keywords
G&#233;n&#233;ration automatique de textes, annotation, cor&#233;f&#233;rence, r&#244;les th&#233;matiques
</p>
<p>Natural language generation, annotation, coreference, thematic role
</p>
<p>R&#233;sum&#233; &#8211; Abstract
Nous pr&#233;sentons dans cet article un cas particulier de description d&#233;finie o&#249; la description
reprend le r&#244;le th&#233;matique d&#8217;un argument (implicite ou explicite) d&#8217;un &#233;v&#233;nement mentionn&#233;
dans le contexte linguistique. Nous commen&#231;ons par montrer que les sch&#233;mas d&#8217;annotation
propos&#233;s (MATE) et utilis&#233;s (Poesio et Vieira 2000) ne permettent pas une caract&#233;risation
uniforme ni, partant, un rep&#233;rage facile de ces reprises. Nous proposons une extension du
sch&#233;ma MATE qui pallie cette difficult&#233;.
</p>
<p>We present in this paper a particular kind of definite description which mentions the thematic
role of an (implicit or explicit) argument of an event mentioned in the context. We show that the
annotation schemes which are either proposed (MATE) or used (Poesio and Vieira 2000) permit
neither a uniform characterisation of the phenomenon nor an easy identification of these
anaphors. We propose an extension of the MATE schemes which remedy this difficulty.
</p>
<p>1 Introduction
Le travail pr&#233;sent&#233; dans cet article se situe dans le cadre de la g&#233;n&#233;ration automatique
d&#8217;expressions r&#233;f&#233;rentielles. Nous cherchons &#224; g&#233;n&#233;rer des textes contenant des reprises
anaphoriques par la verbalisation de r&#244;les th&#233;matiques :
</p>
<p>Cinq millions d&#8217;Euros ont &#233;t&#233; vers&#233;s &#224; Amnesty International. Le g&#233;n&#233;reux
donateur pr&#233;f&#232;re garder l&#8217;anonymat.
</p>
<p>Notre but est d&#8217;arriver &#224; une extension de l&#8217;algorithme de Dale et Reiter (1995) par une prise en
compte plus importante du contexte linguistique. En effet, l&#8217;algorithme de g&#233;n&#233;ration</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>d&#8217;expressions r&#233;f&#233;rentielles mis au point par Dale et Reiter permet de r&#233;f&#233;rer &#224; un objet gr&#226;ce &#224;
ses propri&#233;t&#233;s distinctives dans le contexte de r&#233;f&#233;rence mais ne tient pas compte de la totalit&#233; du
contexte linguistique. Il exige l&#8217;unicit&#233; du r&#233;f&#233;rent dans le contexte mais nous verrons (section 2)
que si cette condition est n&#233;cessaire, elle n&#8217;est pas toujours suffisante pour la g&#233;n&#233;ration d&#8217;une
description d&#233;finie. L&#8217;algorithme pourra donc g&#233;n&#233;rer indiff&#233;remment les textes suivants :
</p>
<p>L&#8217;ETA a de nouveau tu&#233; hier. La victime est un d&#233;put&#233; conservateur.
</p>
<p>? L&#8217;ETA a de nouveau tu&#233; hier. L&#8217;homme politique est un d&#233;put&#233;
conservateur.1
</p>
<p>M&#234;me si le groupe nominal permet d&#8217;identifier le personnage dans le contexte, le second texte
est beaucoup moins coh&#233;rent que le premier. Parvenir &#224; g&#233;n&#233;rer une reprise par le r&#244;le
th&#233;matique est donc un bon moyen d&#8217;assurer la coh&#233;rence du texte.
</p>
<p>Avant de proposer une extension d&#8217;algorithme pour ce ph&#233;nom&#232;ne, nous avons fait des
recherches sur des corpus annot&#233;s afin d&#8217;en &#233;tudier la fr&#233;quence et la distribution, et d&#8217;&#233;tablir
des contraintes sur sa g&#233;n&#233;ration. Ces recherches nous ont amen&#233;e &#224; dire que les sch&#233;mas
d&#8217;annotation existant ne sont pas suffisants pour l&#8217;isoler, et &#224; proposer une extension de ces
sch&#233;mas. Dans les sections 2 et 3, nous pr&#233;sentons le ph&#233;nom&#232;ne &#233;tudi&#233; et nous nous
positionnons par rapport aux travaux sur le sujet en linguistique. Dans la section 4, nous
pr&#233;sentons notre &#233;tude du corpus annot&#233; au niveau r&#233;f&#233;rentiel par Poesio et Vieira (2000). Nous
montrons en quoi les classifications des utilisations des descriptions d&#233;finies et les sch&#233;mas
d&#8217;annotation qui y sont propos&#233;s sont insuffisants. Enfin, dans la section 5, nous pr&#233;sentons le
sch&#233;ma d&#8217;annotation propos&#233; par le projet MATE2 pour ce ph&#233;nom&#232;ne, ses insuffisances et
notre proposition d&#8217;extension de ce sch&#233;ma.
</p>
<p>2 Utilisations des descriptions d&#233;finies
On consid&#232;re traditionnellement que le d&#233;terminant d&#233;fini donne deux indications sur l&#8217;entit&#233;
d&#233;not&#233;e par le syntagme nominal : elle est unique dans le contexte (Russell 1905, Corblin, 1987)
et elle est connue (Heim 1982). Il existe un ensemble de nuances &#224; cette observation, qui
am&#232;nent Vieira (1998) &#224; construire en quatre grandes cat&#233;gories d&#8217;utilisation du d&#233;fini que nous
d&#233;crivons bri&#232;vement ici :
</p>
<p>&#8226; Utilisation anaphorique. Le groupe nominal entretient une relation de cor&#233;f&#233;rence
avec un autre &#233;l&#233;ment linguistique pr&#233;sent dans le contexte linguistique ant&#233;rieur. Les
deux segments linguistiques r&#233;f&#232;rent &#224; la m&#234;me entit&#233;, peuvent &#234;tre identiques ou
diff&#233;rents. (deux noms identiques, deux noms diff&#233;rents...)
</p>
<p>&#8226; Utilisation associative. Le groupe nominal entretient une relation avec une
expression qui ne r&#233;f&#232;re pas exactement &#224; la m&#234;me entit&#233;, mais les connaissances du
monde permettent de faire un lien tr&#232;s facilement entre les deux entit&#233;s d&#233;not&#233;es par les
deux expressions, tant leur relation est forte. (Ces relations sont la plupart du temps des
relations m&#233;r&#233;ologiques &#8211; d&#8217;une partie vers un tout ou d&#8217;un &#233;l&#233;ment &#224; un ensemble.) La
pr&#233;sence de la premi&#232;re entit&#233; dans le contexte implique presque automatiquement la
pr&#233;sence de la seconde. Lorsqu&#8217;il s&#8217;agit de deux groupes nominaux, les t&#234;tes de
syntagmes sont automatiquement diff&#233;rentes, mais il peut parfois s&#8217;agir d&#8217;une relation
</p>
<p>                                                
</p>
<p>1
  Nous utiliserons la notation suivante : les textes dont la compr&#233;hension nous semble douteuse seront pr&#233;c&#233;d&#233;s
</p>
<p>de ? et ceux qui nous semblent agrammaticaux seront pr&#233;c&#233;d&#233;s de *.
</p>
<p>2
 Multilevel Annotation Tools Engineering, Telematics Project LE4-8370.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des reprises anaphoriques  par les noms de r&#244;le th&#233;matique
</p>
<p>entre un groupe verbal et un groupe nominal, le groupe nominal r&#233;f&#233;rant &#224; l&#8217;un des
participants de l&#8217;action qui n&#8217;est pas mentionn&#233; explicitement.
</p>
<p>&#8226; Utilisation situationnelle. Les utilisations situationnelles sont possibles parce que
l&#8217;entit&#233; &#224; laquelle elles r&#233;f&#232;rent est pr&#233;sente  dans le contexte g&#233;n&#233;ral du discours ou
dans la situation des interlocuteurs au moment de la production de l&#8217;&#233;nonc&#233;.
</p>
<p>&#8226; Utilisation non famili&#232;re. Ces utilisations sont quasiment toujours des premi&#232;res
mentions. Elles r&#233;f&#232;rent &#224; des entit&#233;s uniques, qui ne sont pas forc&#233;ment connues de
l&#8217;interlocuteur. En g&#233;n&#233;ral, le nom et ses modifieurs forment une d&#233;finition suffisante
de l&#8217;objet pour qu&#8217;il soit identifi&#233; comme unique dans le contexte, bien qu&#8217;il n&#8217;ait pas
&#233;t&#233; mentionn&#233; ant&#233;rieurement.
</p>
<p>3 Reprises par le nom du r&#244;le th&#233;matique
Nous nous basons sur les travaux de Jackendoff (1990), qui repr&#233;sente le sens des mots par des
repr&#233;sentations mentales appel&#233;es structures lexicales conceptuelles (LCS). Dans la LCS, sont
d&#233;finies des positions pour les arguments s&#233;mantiques du verbe qui correspondent la plupart du
temps aux r&#244;les th&#233;matiques qu&#8217;il s&#233;lectionne. Ainsi, le verbe aller s&#233;lectionne une destination
(position TO), un point de d&#233;part (position FROM), et un &#233;l&#233;ment effectuant le d&#233;placement
(THEME). L&#8217;ensemble de ces deux positions forme un troisi&#232;me argument de type chemin
(position VIA). Aussi, quand nous parlerons de r&#244;les th&#233;matiques ici, il s&#8217;agira pr&#233;cis&#233;ment de
ces positions d&#233;finies dans la LCS. Les positions sont consid&#233;r&#233;es comme des fonctions, et
re&#231;oivent des types issus d&#8217;une ontologie relativement simple. Le verbe aller (GO, sans type) au
sens &#171; aller d&#8217;un lieu &#224; un autre &#187; aura la m&#234;me structure que le verbe donner &#171; aller d&#8217;un
possesseur &#224; un autre &#187; (GO avec le type poss), mais les positions recevront un type ontologique
diff&#233;rent, ce qui permettra de distinguer ces verbes :
</p>
<p>              FROM [place ]      FROM [thing ]
GO   THEME[thing ], VIA    GOposs   THEME[thing ], VIA
      TO [place] TO [thing]
</p>
<p>                        path         path
</p>
<p>Nous voyons donc que les r&#244;les th&#233;matiques sont en fait l&#8217;application de fonctions sur des
positions dans la structure argumentale des verbes. Les types des positions, permettent d&#8217;avoir
des structures tr&#232;s g&#233;n&#233;rales, tout en conservant le maximum d&#8217;information concernant les
restrictions s&#233;lectionnelles. La lexicalisation de ces positions est le r&#233;sultat de l&#8217;application d&#8217;une
fonction sur un type ontologique. Ainsi, la position TO dans la LCS de aller sera lexicalis&#233;e par
le terme destination, tandis que dans la LCS du verbe donner elle sera lexicalis&#233;e par
b&#233;n&#233;ficiaire. Nous montrons dans cette section comment les lexicalisations de ces positions dans
la LCS peuvent permettre de r&#233;f&#233;rer au participant d&#8217;un &#233;v&#233;nement dans une description d&#233;finie.
</p>
<p>3.1 Reprises par le nom du r&#244;le th&#233;matique d&#8217;un argument implicite
Parmi les utilisations associatives list&#233;es par Vieira (1998), on trouve des emplois o&#249; le syntagme
nominal d&#233;fini r&#233;f&#232;re &#224; un argument du verbe de la phrase pr&#233;c&#233;dente, sans qu&#8217;il ait &#233;t&#233;
mentionn&#233;. Le nom t&#234;te du syntagme sera alors la verbalisation du r&#244;le th&#233;matique jou&#233; par
l&#8217;entit&#233; dans l&#8217;&#233;v&#233;nement pr&#233;c&#233;demment mentionn&#233;. Il s&#8217;agit de la cat&#233;gorie que Clark (1977)
nomme &#171; r&#233;f&#233;rence indirecte par caract&#233;risation &#187;, dont voici deux exemples :
</p>
<p>1) Cinq millions d&#8217;Euros ont &#233;t&#233; vers&#233;s &#224; Amnesty International. Le g&#233;n&#233;reux
donateur pr&#233;f&#232;re garder l&#8217;anonymat.
</p>
<p>2) Bob est all&#233; &#224; Venise. La route a &#233;t&#233; p&#233;nible.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>Dans l&#8217;exemple 1, bien que l&#8217;agent effectuant le don ne soit pas mentionn&#233; dans la premi&#232;re
phrase, on y fait r&#233;f&#233;rence dans la seconde, gr&#226;ce &#224; une description d&#233;finie verbalisant son r&#244;le
dans l&#8217;action (position FROM avec donner). Dans l&#8217;exemple 2, on r&#233;f&#232;re &#224; la totalit&#233; du
d&#233;placement par la route, alors que seul le point d&#8217;arriv&#233;e est mentionn&#233; dans la premi&#232;re phrase.
On peut dire qu&#8217;il s&#8217;agit de la verbalisation de l&#8217;application de la fonction VIA &#224; ses deux
arguments dans les LCS de Jackendoff. Dans la classification de Clark, ces deux exemples
appartiennent &#224; la cat&#233;gorie des r&#233;f&#233;rences indirectes par caract&#233;risation d&#8217;un argument
obligatoire. (On ne peut pas envisager l&#8217;&#233;v&#233;nement correspondant &#224; verser de l&#8217;argent sans un
agent effectuant cette action, ni un d&#233;placement sans chemin.)
L&#8217;exemple qui suit est class&#233; par Clark dans la cat&#233;gorie de la r&#233;f&#233;rence indirecte par
caract&#233;risation d&#8217;un argument optionnel, un attentat ne faisant pas forc&#233;ment de victime :
</p>
<p>3) L&#8217;ETA a commis un attentat hier soir. La victime est un d&#233;put&#233;
conservateur.
</p>
<p>Nous consid&#233;rons ici commettre un attentat comme une collocation, ayant pour arguments
s&#233;mantiques un agent, une cible, et un instrument. Un des arguments s&#233;mantiques de commettre-
un-attentat n&#8217;est pas r&#233;alis&#233; dans la premi&#232;re phrase. Un attentat peut impliquer une victime,
c&#8217;est pourquoi on peut se permettre d&#8217;utiliser un groupe nominal d&#233;fini dans la seconde phrase
du texte, bien que le personnage ne soit pas mentionn&#233; pr&#233;c&#233;demment.
</p>
<p>Enfin, nous pouvons trouver le m&#234;me type de ph&#233;nom&#232;ne entre deux groupes nominaux, lorsque
le premier nom fait r&#233;f&#233;rence &#224; un &#233;v&#233;nement :
</p>
<p>4) L&#8217;ETA revendique un nouvel attentat. La victime est un journaliste d&#8217;El
Pa&#236;s.
</p>
<p>Ici, la victime r&#233;f&#232;re &#224; un argument du pr&#233;dicat attentat (on peut d&#8217;ailleurs &#233;crire la victime de
l&#8217;attentat), de la m&#234;me mani&#232;re que dans l&#8217;exemple 3. Il s&#8217;agit d&#8217;un cas sp&#233;cifique d&#8217;anaphore
associative o&#249; la reprise se fait par le r&#244;le th&#233;matique. (La plupart du temps on parle d&#8217;anaphore
associative quand elle a lieu par le biais d&#8217;une relation m&#233;r&#233;ologique)
</p>
<p>3.2 Reprise par le nom du r&#244;le th&#233;matique d&#8217;un argument mentionn&#233;
5) Le PDG de Total-Fina-Elf a &#233;t&#233; assassin&#233; hier soir. La victime se rendait
</p>
<p>au tribunal quand deux motards ont surgi et lui ont tir&#233; dessus.
</p>
<p>Dans cet exemple, l&#8217;entit&#233; &#224; laquelle on r&#233;f&#232;re par un nom de r&#244;le th&#233;matique a d&#233;j&#224; &#233;t&#233;
mentionn&#233;e. Cependant, la propri&#233;t&#233; &#171; victime &#187; du &#171; PDG de Total-Fina-Elf &#187; n&#8217;est pas
intrins&#232;que au personnage, mais introduite par le verbe assassiner. Si on changeait de contexte,
m&#234;me apr&#232;s le d&#233;c&#232;s du personnage, on ne pourrait pas le d&#233;crire ainsi :
</p>
<p>6) *Le PDG a mal dormi cette nuit. La victime s&#8217;est rendue &#224; son bureau tr&#232;s
t&#244;t ce matin.
</p>
<p>L&#8217;interpr&#233;tation et la g&#233;n&#233;ration de la victime n&#233;cessitent un appui sur le premier SN et sur le
verbe.
</p>
<p>Dans tous les cas, on constate la lexicalisation d&#8217;un r&#244;le th&#233;matique dans la deuxi&#232;me phrase.
Dans les exemples 1 &#224; 4, il s&#8217;agit de la lexicalisation d&#8217;une entit&#233; non mentionn&#233;e explicitement
dans la description de l&#8217;&#233;v&#233;nement, mais pr&#233;sente dans sa structure s&#233;mantique. Dans le
cinqui&#232;me exemple, l&#8217;entit&#233; a d&#233;j&#224; &#233;t&#233; mentionn&#233;e dans la premi&#232;re phrase, mais la reprise se fait
par le nom correspondant au patient de l&#8217;&#233;v&#233;nement &#171; assassinat &#187;. Dans tous les cas,
l&#8217;ant&#233;c&#233;dent est soit un verbe, soit un nom d&#233;verbal.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des reprises anaphoriques  par les noms de r&#244;le th&#233;matique
</p>
<p>3.3 Les reprises par les noms de r&#244;les th&#233;matiques vues comme des cas
particuliers d&#8217;anaphore associative
</p>
<p>Nous consid&#233;rons comme Clark (1977) que les cas d&#233;crit en section 3.1 est sont des anaphores
associatives dont les ant&#233;c&#233;dents sont des verbes ou des noms d&#233;verbaux et nous le d&#233;montrons
par rapport &#224; la classification &#233;tablie dans la section pr&#233;c&#233;dente :
(i) Il ne s&#8217;agit pas d&#8217;une utilisation anaphorique (section 2.1) puisque l&#8217;entit&#233; &#224; laquelle on
r&#233;f&#232;re n&#8217;est pas mentionn&#233;e pr&#233;c&#233;demment dans le texte.
(ii) Il ne s&#8217;agit pas non plus d&#8217;une nouvelle entit&#233; dans le discours (utilisations non famili&#232;res,
section 2.4), puisque l&#8217;interpr&#233;tation du syntagme ne serait pas possible dans un autre contexte
linguistique (cf. exemple 6). En effet, lors d&#8217;une premi&#232;re mention, on utilise une propri&#233;t&#233;
intrins&#232;que de l&#8217;entit&#233; qui la diff&#233;rencie de toutes les autres entit&#233;s du contexte.
(iii) Enfin, il ne s&#8217;agit pas d&#8217;une anaphore situationnelle (section 2.3), comme dans &#171; le Soleil &#187;
ou &#171; le Premier Ministre &#187;, puisqu&#8217;il ne s&#8217;agit pas de faire r&#233;f&#233;rence &#224; un objet pr&#233;sent dans la
situation d&#8217;&#233;nonciation, mais bien dans le contexte discursif.
</p>
<p>En revanche, toutes les caract&#233;ristiques de l&#8217;anaphore associative s&#8217;appliquent &#224; nos exemples :
l&#8217;entit&#233; est implicitement pr&#233;sente dans le contexte gr&#226;ce &#224; la mention d&#8217;un autre &#233;l&#233;ment dans le
contexte ant&#233;rieur, et on ne peut interpr&#233;ter le syntagme qu&#8217;en lien avec cet &#233;l&#233;ment linguistique.
Les cas que nous &#233;tudions diff&#232;rent des cas les plus fr&#233;quemment &#233;tudi&#233;s dans la litt&#233;rature par
le fait que la relation entre l&#8217;ant&#233;c&#233;dent et l&#8217;anaphore est th&#233;matique et non pas m&#233;r&#233;ologique.
</p>
<p>4 Etude de corpus
Dans cette section, nous pr&#233;sentons notre travail sur corpus. Dans un premier temps nous avons
men&#233; des recherches informelles sur un corpus fran&#231;ais pour v&#233;rifier l&#8217;existence du ph&#233;nom&#232;ne.
Nous avons ensuite fait des recherches plus formelles sur un important corpus annot&#233; pour les
descriptions d&#233;finies, dans le but de v&#233;rifier la pertinence du sch&#233;ma d&#8217;annotation utilis&#233; dans la
pratique pour les descriptions d&#233;finies.
</p>
<p>4.1 Exploitation informelle du corpus du Monde Diplomatique
Nous utilisons un corpus rassemblant les articles parus dans Le Monde Diplomatique en 1996
et 19983, choisi car le style journalistique emploie fr&#233;quemment le type de reprise anaphorique
que nous recherchons. Ce corpus n&#8217;est pas annot&#233;, nous avons donc d&#251; d&#233;finir une strat&#233;gie de
recherche  informelle d&#8217;exemples de reprise par le nom d&#8217;un r&#244;le th&#233;matique.
</p>
<p>En nous basant sur Jackendoff (1990), nous avons recherch&#233; une liste de verbes instanciant un
sch&#233;ma du type GO &#8211; FROM &#8211; TO &#8211; VIA, c&#8217;est &#224; dire des verbes qui d&#233;crivent le passage d&#8217;un
objet d&#8217;un lieu &#224; un autre, d&#8217;un possesseur &#224; un autre ou d&#8217;un &#233;tat &#224; un autre. Nous avons choisi
les verbes aller, acqu&#233;rir et mourir ainsi que des verbes synonymes, (arriver, se diriger (vers),
voyager, visiter, recevoir, gagner), des verbes ayant un sens converse (quitter, partir, prendre,
acheter), et leurs &#233;quivalents avec un sens causatif (conduire, emmener, donner, vendre, tuer,
assassiner)
Nous avons ensuite cherch&#233; comment on pouvait lexicaliser les r&#244;les correspondant aux
arguments s&#233;mantiques FROM, TO, VIA et THEME que ces verbes s&#233;lectionnent (destination,
provenance, voyageur, trajet, destinataire, b&#233;n&#233;ficiaire, don, donneur, donateur, victime, etc.) et
</p>
<p>                                                
</p>
<p>3
 Corpus SILFIDE, Equipe Langue et Dialogue du LORIA,    http://www.loria.fr/projets/Silfide/  . Le corpus Monde
</p>
<p>diplomatique 96 contient 939 489 mots et le Monde diplomatique 98 en contient 565 900.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>cherch&#233; leurs synonymes dans le dictionnaire de synonymes en ligne de l&#8217;InaLF compl&#233;t&#233; par le
CRISCO (Caen) (http://elsap1.unicaen.fr/dicosyn.html).
Nous avons enfin effectu&#233; des recherches sur ces noms de r&#244;le dans les deux ann&#233;es du Monde
Diplomatique, et rep&#233;r&#233; des exemples attestant de l&#8217;existence de ce ph&#233;nom&#232;ne4.
</p>
<p>Depuis, le clan de Donetsk a &#233;t&#233; d&#233;cim&#233; par une s&#233;rie de meurtres, dont le
plus marquant a &#233;t&#233; commis le 3 novembre 1996 : la victime, Yevhen
Shcherban, &#233;tait un homme d'affaires important et chef pr&#233;sum&#233; du clan.
(File &quot;Lemonde98.sgml&quot;; Line 30449)
Des fondations reposant sur de grandes et anciennes fortunes industrielles
am&#233;ricaines(...), financent aussi des chaires dans les universit&#233;s les plus
prestigieuses des Etats-Unis(...) la Fondation Olin qui consacrait d&#233;j&#224;, en
1988, 55 millions de dollars &#224; cet objectif. Il va de soi qu'avec des sommes
pareilles le g&#233;n&#233;reux donateur a le droit de nommer les professeurs qui vont
occuper les chaires et diriger les centres d'&#233;tudes (14).
(File &quot;Lemonde96.sgml&quot;; Line 57154)
Les voisins dormaient d&#233;j&#224; lorsqu'ils arriv&#232;rent. Elle r&#233;veilla son enfant qui
avait dormi &#224; poings ferm&#233;s pendant tout le voyage.
(File &quot;Lemonde96.sgml&quot;; Line 1103)
</p>
<p>4.2 Exploitation formelle du corpus de Poesio et Vieira (2000)
A la suite de nos recherches sur le Monde Diplomatique, nous souhaitions v&#233;rifier nos r&#233;sultats
en faisant une recherche plus syst&#233;matique et approfondie des occurrences de ce ph&#233;nom&#232;ne.
Nous avons donc consult&#233; un corpus annot&#233; : celui dont nous disposons est le corpus annot&#233; par
Poesio et Vieira (2000). Il s&#8217;agit d&#8217;un sous ensemble du corpus Penn Treebank I, qui est l&#8217;un
des corpus les plus importants annot&#233; au niveau r&#233;f&#233;rentiel (1000 descriptions d&#233;finies
annot&#233;es).
</p>
<p>4.2.1 Sch&#233;ma d&#8217;annotation utilis&#233;
</p>
<p>Dans ce corpus, quatre cat&#233;gories de description d&#233;finies ont &#233;t&#233; annot&#233;es :
</p>
<p>&#8226; Anaphore directe : Il s&#8217;agit des r&#233;f&#233;rences subs&#233;quentes &#224; un objet utilisant la m&#234;me
t&#234;te nominale dans les deux syntagmes : Le petit chat noir est entr&#233; dans la maison&#8230;
le chat&#8230;
</p>
<p>&#8226; Associations : Il s&#8217;agit de deux types de relation : (a) mention d&#8217;une nouvelle entit&#233; en
lien avec une entit&#233; mentionn&#233;e pr&#233;c&#233;demment dans le discours (anaphore associative) :
Au loin, on aper&#231;oit une maison. La porte est entrouverte. (b) mention de la m&#234;me
entit&#233; avec un nom diff&#233;rent comme t&#234;te du syntagme (cor&#233;f&#233;rence) :  Au loin, on
aper&#231;oit une maison. Le b&#226;timent&#8230;
</p>
<p>&#8226; Premi&#232;re mention : Il s&#8217;agit des descriptions r&#233;f&#233;rant &#224; un objet sans lien avec le
contexte linguistique ou g&#233;n&#233;ral.
</p>
<p>&#8226; Non r&#233;solu : Cette cat&#233;gorie regroupe toutes les descriptions n&#8217;entrant pas dans les
autres cat&#233;gories.
</p>
<p>                                                
</p>
<p>4
  Sans pour autant pouvoir faire des statistiques fiables, dans la mesure o&#249; la recherche n&#8217;&#233;tait pas automatique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des reprises anaphoriques  par les noms de r&#244;le th&#233;matique
</p>
<p>Etant donn&#233; ce sch&#233;ma d&#8217;annotation, on aurait pu s&#8217;attendre &#224; trouver des exemples de reprises
par un r&#244;le th&#233;matique implicite dans la cat&#233;gorie des premi&#232;res mentions, et les reprises par un
r&#244;le th&#233;matique explicite dans la cat&#233;gorie associations, annot&#233;es en cor&#233;f&#233;rence avec le premier
syntagme nominal r&#233;f&#233;rant &#224; l&#8217;objet dans le texte. Nous avons donc &#233;tudi&#233; ces cat&#233;gories en
recherchant tous les noms correspondant &#224; des r&#244;les dans des &#233;v&#233;nements. Nous n&#8217;avons trouv&#233;
aucune occurrence de ce ph&#233;nom&#232;ne class&#233; dans ces deux cat&#233;gories. En revanche nous en avons
trouv&#233; dans la cat&#233;gorie Non-r&#233;solu :
</p>
<p>7) So the IRS has drawn a rationale from the sale of a home site split in two
and sold in different years to ** the same buyer **.
&lt;&lt; the same buyer &gt;&gt; *** UNRESOLVED *** (File &quot;Sample&quot;; Line 8707)
</p>
<p>8) The changes were proposed in an effort to streamline federal bureaucracy
and boost compliance by the executives who are really calling the shots, said
Brian Lane, special counsel at the SEC&#8217;s office of disclosure policy, which
proposed the changes. Investors , money managers and corporate officials
had until today to comment on ** the proposals ** , and the issue has
produced more mail than almost any other issue in memory , Mr. Lane
said.
&lt;&lt; the proposals &gt;&gt; *** UNRESOLVED ***(File &quot;Sample&quot;; Line 294)
</p>
<p>Dans l&#8217;exemple 7, le groupe nominal the same buyer est consid&#233;r&#233; comme non r&#233;solu, alors
qu&#8217;il s&#8217;agit de la lexicalisation de la position TO dans la structure lexicale conceptuelle de sale
dans le groupe nominal the sale of a home split in two (cf. exemple 5). Dans l&#8217;exemple 8, la
production du syntagme the proposals dans la deuxi&#232;me phrase n&#8217;est possible que gr&#226;ce au
verbe proposed dans la premi&#232;re phrase. Il s&#8217;agit d&#8217;une reprise du th&#232;me du verbe to propose,
r&#233;alis&#233; explicitement dans la premi&#232;re phrase par the changes (cf. exemple 4).
Nous pensons que les reprises anaphoriques recherch&#233;es n&#8217;ont pas &#233;t&#233; identifi&#233;es par le syst&#232;me
pour deux raisons :
</p>
<p>Premi&#232;rement, les d&#233;finitions des cat&#233;gories d&#8217;emploi des d&#233;finis ne sont pas assez pr&#233;cises.
D&#8217;une part, il n&#8217;est pas explicite que l&#8217;ant&#233;c&#233;dent d&#8217;une anaphore puisse aussi &#234;tre verbal, et
d&#8217;autre part, il n&#8217;y a pas d&#8217;indication dans la cat&#233;gorie associations expliquant que la reprise
peut se faire par un nom de r&#244;le th&#233;matique. On h&#233;site alors &#224; faire cor&#233;f&#233;rer deux noms dont les
r&#233;f&#233;rents n&#8217;entretiennent pas de relation m&#233;r&#233;ologique, dans la mesure o&#249; aucun exemple d&#8217;un
autre type n&#8217;est donn&#233; dans les instructions aux annotateurs.
</p>
<p>Par ailleurs, si des heuristiques ont &#233;t&#233; construites pour retrouver certains cas d&#8217;anaphore
associative, aucune n&#8217;a &#233;t&#233; mise au point pour le type de reprise que nous cherchons, ce qui
classe automatiquement les exemples que nous recherchons dans la cat&#233;gorie non-r&#233;solu.
</p>
<p>En pratique et en th&#233;orie, le sch&#233;ma d&#8217;annotation semble mal adapt&#233; &#224; une caract&#233;risation des
reprises par le r&#244;le th&#233;matique. Sur le plan pratique, on a vu qu&#8217;il n&#8217;est pas suffisamment pr&#233;cis
pour permettre une annotation ad&#233;quate (les reprises que nous cherchons sont dans la cat&#233;gorie
non-r&#233;solu). Sur le plan th&#233;orique, le sch&#233;ma ne permet pas une caract&#233;risation uniforme et par
cons&#233;quent un rep&#233;rage facile des reprises th&#233;matiques (le fait que le nom reprend un r&#244;le
th&#233;matique n&#8217;est pas annot&#233;).
</p>
<p>5 Annotation propos&#233;e
Les recommandations MATE (Davies et al. 1998) ont &#233;t&#233; &#233;crites de fa&#231;on &#224; aller vers un sch&#233;ma
d&#8217;annotation de la cor&#233;f&#233;rence uniforme pour tous les corpus. Les reprises anaphoriques sont
annot&#233;es par une balise &lt;link&gt; qui sera typ&#233;e. Les recommandations distinguent &#8211; entre autres &#8211;
trois types de liens anaphoriques. Tout d&#8217;abord les groupes nominaux cor&#233;f&#233;rents &#224; un</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>argument mentionn&#233; explicitement seront annot&#233;s par un type ident. Dans les cas d&#8217;anaphore
associative, le lien sera de type element. Enfin dans les cas de reprise par un nom de r&#244;le
th&#233;matique, le type de la balise &lt;link&gt; sera e-rel. On trouve une autre balise importante dans la
balise &lt;link &gt;: la balise arg, dont la valeur est une paire compos&#233;e de l&#8217;identifiant de l&#8217;ant&#233;c&#233;dent
et de l&#8217;identifiant du groupe nominal annot&#233;. Dans les deux premiers cas (ident et element),
l&#8217;ant&#233;c&#233;dent sera un groupe nominal, et dans le troisi&#232;me cas, l&#8217;ant&#233;c&#233;dent sera la proposition
compl&#232;te &#224; partir de laquelle la reprise sur le r&#244;le th&#233;matique a lieu.
</p>
<p>Le sch&#233;ma pose les difficult&#233;s suivantes : d&#8217;une part, comment un annotateur va-t-il choisir entre
une cor&#233;f&#233;rence avec un syntagme nominal ou une cor&#233;f&#233;rence avec la totalit&#233; de la proposition
dans le cas de l&#8217;exemple 4 ? La cons&#233;quence de cette ambigu&#239;t&#233; peut conduire &#224; des d&#233;saccords
entre annotateurs et donc &#224; un indice kappa5 faible et &#224; des difficult&#233;s dans l&#8217;automatisation du
syst&#232;me. D&#8217;autre part, cette annotation ne permet pas un rep&#233;rage syst&#233;matique du ph&#233;nom&#232;ne
qui nous int&#233;resse dans la mesure o&#249; (i) les reprises par le r&#244;le th&#233;matique ne figurent pas
syst&#233;matiquement dans la m&#234;me cat&#233;gorie, (ii) on n&#8217;aura pas d&#8217;indication sur le r&#244;le th&#233;matique
si la description est class&#233;e dans la cat&#233;gorie des cor&#233;f&#233;rences, (iii) on n&#8217;aura pas non plus cette
indication si elle est class&#233;e dans la cat&#233;gorie des anaphores associatives.
</p>
<p>Pour pallier ces insuffisances, nous proposons le sch&#233;ma d&#8217;annotation suivant :
</p>
<p>                                                
</p>
<p>5
 indice d&#8217;accord entre les annotateurs. Le test kappa permet de calculer un coefficient mesurant la coh&#233;rence des
</p>
<p>annotations lorsqu&#8217;elles sont r&#233;alis&#233;es par plusieurs personnes, Carletta (1996).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation des reprises anaphoriques  par les noms de r&#244;le th&#233;matique
</p>
<p>Type de reprise Balises &lt; link &gt; Exemple
</p>
<p>SN entretenant une
relation anaphorique
</p>
<p>avec un argument
implicite du verbe de la
</p>
<p>phrase pr&#233;c&#233;dente 
</p>
<p>&lt; link
type = &#8220;e-rel&#8221;
role = &#8220;R&#8221;
args = &#8220;X, Y&#8221;&gt;
</p>
<p>L&#8217;ETA &lt;de ID = 1&gt; a commis un attentat &lt;/de&gt;.
&lt;de ID = 2&gt; La victime &lt;/de&gt; est un d&#233;put&#233;
conservateur.
&lt; link type = &#8220;e-rel&#8221; role = &#8220;Patient&#8221; args = &#8220;1,
2&#8221;&gt;
</p>
<p>SN entretenant une
relation anaphorique
</p>
<p>avec une position
s&#233;mantique de la LCS
</p>
<p>et une relation
cor&#233;f&#233;rentielle avec un
</p>
<p>argument du verbe.
</p>
<p>&lt; link
type = &#8220;e-rel&#8221;
role = &#8220;R&#8221;
args = &#8220;X, Y&#8221;&gt;
&lt; link
type = &#8220;ident&#8221;
args = &#8220;X, Z&#8221;&gt;
</p>
<p>&lt;de ID = 1&gt; Le PDG &lt;/de&gt; &lt;de ID = 2&gt; a &#233;t&#233;
assassin&#233; &lt;/de&gt;. &lt;de ID = 3&gt; La victime &lt;/de&gt; se
rendait &#224; son bureau lorsqu&#8217;on lui a tir&#233; dessus.
&lt; link type = &#8220;e-rel&#8221; role = &#8220;patient&#8221; args = &#8220;2,
3&#8221;&gt;
&lt; link type = &#8220;ident&#8221; args = &#8220;1, 3&#8221;&gt;
</p>
<p>SN entretenant une
relation anaphorique
</p>
<p>avec l&#8217;argument
s&#233;mantique non r&#233;alis&#233;
d&#8217;une nominalisation
</p>
<p>d&#8217;&#233;v&#233;nement
</p>
<p>&lt; link
type = &#8220;element&#8221;
role = &#8220;R&#8221;
args = &#8220;X, Y&#8221;&gt;
</p>
<p>L&#8217;ETA revendique &lt;de ID = 1&gt; un nouvel attentat
&lt;/de&gt;.&lt;de ID = 2&gt; La victime &lt;/de&gt; est un
journaliste d&#8217;El Pa&#236;s.
 &lt; link type = &#8220;element&#8221; role = &#8220;patient&#8221; args =
&#8220;1, 2&#8221;&gt;
</p>
<p>SN cor&#233;f&#233;rent &#224;
l&#8217;argument explicite
d&#8217;une nominalisation
</p>
<p>d&#8217;&#233;v&#233;nement, et
anaphorique avec sa
</p>
<p>position dans la LCS.
</p>
<p>&lt; link
type = &#8220;element&#8221;
role = &#8220;R&#8221;
args = &#8220;X, Y&#8221;&gt;
&lt; link
type = &#8220;ident&#8221;
args = &#8220;X, Z&#8221;&gt;
</p>
<p>&lt;de ID = 1&gt; Le meurtre &lt;/de&gt; de &lt;de ID = 2&gt;
Lennon &lt;/de&gt; a &#233;mu tout le pays.&lt;de ID =3&gt; La
victime &lt;/de&gt; &#233;tait tr&#232;s populaire.
&lt; link type = &#8220;element&#8221; role = &#8220;patient&#8221; args =
&#8220;1, 3&#8221;&gt;
&lt; link type = &#8220;ident&#8221; args = &#8220;1, 2&#8221;&gt;
</p>
<p>Les diff&#233;rences entre nos propositions et le sch&#233;ma MATE sont les suivantes :
Pour tous les cas de reprise par le r&#244;le th&#233;matique, le r&#244;le repris fait partie de l&#8217;annotation de la
description d&#233;finie gr&#226;ce &#224; la balise role = &#8220;R&#8221;. (La liste des r&#244;les &#224; utiliser reste &#224; d&#233;finir.)
Dans le cas des reprises d&#8217;un argument implicite de verbe ou de nom d&#233;verbal, la description
pointe sur le nom/verbe ant&#233;c&#233;dent.
Enfin, dans les cas de reprise d&#8217;un argument explicite, la description d&#233;finie pointe sur le
nom/verbe ant&#233;c&#233;dent, ainsi que sur le groupe nominal cor&#233;f&#233;rent.
</p>
<p>6 Conclusion et perspectives
Partant des sch&#233;mas d&#8217;annotation propos&#233;s (MATE) ou utilis&#233;s (Poesio et Vieira 2000), nous
avons propos&#233; une extension de MATE qui permet une caract&#233;risation uniforme du ph&#233;nom&#232;ne
de reprise par le r&#244;le th&#233;matique. Pour permettre une analyse des contraintes linguistiques
r&#233;gissant ces reprises, nous voulons maintenant utiliser ce sch&#233;ma pour une annotation
syst&#233;matique du corpus PAROLE6,  annot&#233;s au niveau morpho-syntaxique.
</p>
<p>Nous souhaitons par ailleurs &#233;tendre notre &#233;tude au m&#234;me ph&#233;nom&#232;ne, mais dans le cadre des
descriptions d&#233;monstratives. Nous avons en effet trouv&#233; des cas o&#249; il est n&#233;cessaire d&#8217;employer
                                                
</p>
<p>6
 Corpus annot&#233; au niveau morpho-syntaxique par l&#8217;ATILF. L&#8217;annotation se fait gr&#226;ce &#224; la collaboration de
</p>
<p>l&#8217;ATILF et du LORIA dans le cadre du plan Etat-R&#233;gion. Nous supposons que ce corpus contiendra autant de
reprises par le r&#244;le th&#233;matique que le corpus SILFIDE, les textes &#233;tant de la m&#234;me nature.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>H&#233;l&#232;ne Manu&#233;lian
</p>
<p>le d&#233;monstratif si on d&#233;signe l&#8217;entit&#233; par son r&#244;le dans l&#8217;action, et il nous semble important de
pouvoir d&#233;terminer des contraintes sur cet emploi du d&#233;monstratif et d&#8217;expliquer la diff&#233;rence
entre les deux textes suivants :
</p>
<p>*Bob est all&#233; &#224; Rome. La destination lui pla&#238;t beaucoup.
</p>
<p>Bob est all&#233; &#224; Rome. Cette destination lui pla&#238;t beaucoup.
</p>
<p>Nous allons par ailleurs d&#233;finir, en collaboration avec l&#8217;Universit&#233; de Sarrebruck, un sch&#233;ma
d&#8217;annotation plus large des anaphores associatives en fran&#231;ais et en anglais. Il nous semble
n&#233;cessaire de quantifier le ph&#233;nom&#232;ne parmi les descriptions d&#233;finies, et d&#8217;affiner notre sch&#233;ma
afin d&#8217;annoter le type de relation lexicale entretenues par l&#8217;ant&#233;c&#233;dent et l&#8217;anaphore, en corr&#233;lant
ces r&#233;sultats avec le r&#244;le th&#233;matique de l&#8217;entit&#233; et son type ontologique, ainsi que la fonction
grammaticale du syntagme nominal. En effet, tous ces param&#232;tre semblent se conjuguer pour
parvenir au choix du d&#233;terminant, ou pour rendre possible l&#8217;anaphore associative. Partant, nous
esp&#233;rons parvenir &#224; une analyse rigoureuse des corpus annot&#233;s et donner des bases empiriques
et th&#233;oriques solides &#224; l&#8217;extension des algorithmes de g&#233;n&#233;ration d&#8217;expressions r&#233;f&#233;rentielles, de
mani&#232;re &#224; augmenter encore le caract&#232;re naturel des reprises anaphoriques dans les textes
g&#233;n&#233;r&#233;s automatiquement.
</p>
<p>Remerciements
Mille mercis &#224; Claire Gardent pour son soutien et ses encouragements, ainsi qu&#8217;&#224; Jean-Marie
Pierrel. Merci &#224; Renata Vieira, qui m&#8217;a fourni le corpus Penn Treebank I annot&#233;, &#224; Susanne
Salmon-Alt et Josette Lecomte. Merci aussi &#224; Evelyne, Fred et Djam&#233;.
</p>
<p>R&#233;f&#233;rences
Carletta J. (1996) Assessing Agreement on classification tasks : the kappa statistic,
Computational Linguistics, 22(2) : 249-254
Clark H. H. (1977) Bridging. In P.N. Johnson-Laird and P.C. Wason, editors, Thinking:
Readings in Cognitive Science. Cambridge University Press, London and New York.
</p>
<p>Corblin F. (1987), Ind&#233;fini, D&#233;fini et D&#233;monstratif, Droz, Gen&#232;ve &#8211; Paris.
Dale R., Reiter E. (1995) Computational Interpretation of the Gricean Maxims in the Generation
of Referring Expressions, Cognitive Science, 19 : 233-263.
</p>
<p>Davies S., Poesio M., Brunesaux F., Romary L., (1998) Annotating Coreference in Dialogues :
Proposal for a Scheme for MATE, Report.
Heim I. (1982) The Semantics of Definite and Indefinite Noun Phrases in English. PhD Thesis,
University of Massachusetts, Ahmerst.
</p>
<p>Jackendoff R. (1990) Semantic Structures, MIT Press, Cambridge, Massachusetts, London,
England.
</p>
<p>Russell B. (1905) On denoting, Mind, 14 : 479-493.
Vieira R. (1998) A review of the Linguistic litterature on definite descriptions, Acta Semiotica et
Lingvistica, Vol. 7 : 219-258.
</p>
<p>Vieira R., Poesio M. (2000) An Empirically-Based System for Processing Definite
Descriptions, Computational Linguistics, v. 26, n.4. 525-579.</p>

</div></div>
</body></html>