<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>LIZARD, un assistant pour le d&#233;veloppement de ressources linguistiques &#224; base de cascades de transducteurs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2002, Nancy, 24-27 juin 2002 
</p>
<p>LIZARD, un assistant pour le d&#233;veloppement de ressources 
linguistiques &#224; base de cascades de transducteurs 
</p>
<p>Antonio Balvet 
</p>
<p>Universit&#233; Paris X Nanterre / UMR MoDyCo 
200, Avenue de la R&#233;publique 92 001 Nanterre 
</p>
<p>antonio.balvet@u-paris10.fr 
</p>
<p>Mots-clefs &#8211; Keywords 
</p>
<p>TALN, assistant linguistique, ressources linguistiques, agents autonomes, &#233;tudes sur corpus 
</p>
<p>NLP, linguistic wizard, linguistic resources, autonomous agents, corpus-based studies 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Nous pr&#233;sentons un outil visant &#224; assister les d&#233;veloppeurs de ressources linguistiques en 
automatisant la fouille de corpus. Cet outil, est guid&#233; par les principes de l&#8217;analyse distributionnelle 
sur corpus sp&#233;cialis&#233;s, &#233;tendue gr&#226;ce &#224; des ressources lexicales g&#233;n&#233;riques. Nous pr&#233;sentons une 
&#233;valuation du gain de performances d&#251; &#224; l&#8217;int&#233;gration de notre outil &#224; une application de filtrage 
d&#8217;information et nous &#233;largissons le champ d&#8217;application de l&#8217;assistant aux &#233;tudes sur corpus men&#233;es 
&#224; l&#8217;aide de cascades de transducteurs &#224; &#233;tats finis. 
</p>
<p>We present a tool providing linguistic resources developers with automated corpus analysis features. 
Our tool implements specialized corpora distributional analysis principles, extended by the integration 
of external generic lexical resources. We present an evaluation of the gain in performance attributable 
to our tool, for a text filtering task. We also widen our tool&#8217;s scope of applications to transducer 
cascades-based corpus processing activities. 
</p>
<p>1 Introduction 
</p>
<p>Les approches bas&#233;es sur les analyses partielles ont fait la preuve de leur efficacit&#233; en TALN, y 
compris pour des applications en vraie grandeur1. Il en va ainsi de t&#226;ches aussi diverses que 
</p>
<p>                                                 
</p>
<p>1  Voir, par exemple, (Mohri, 2001) pour un expos&#233; d&#8217;une techniques d&#8217;analyse partielle, appliqu&#233;e &#224; la 
reconnaissance vocale, ou encore (Abney, 1996) pour l&#8217;analyse syntaxique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antonio Balvet 
</p>
<p>l&#8217;&#233;tiquetage syntaxique, les &#233;tudes sur corpus, la terminologie et la lexicologie, mais &#233;galement 
d&#8217;applications de techniques de TALN &#224; des champs connexes tels que la recherche d&#8217;information. 
Toutefois, toutes les analyses partielles n&#8217;offrent pas les m&#234;mes potentiels de r&#233;utilisabilit&#233; et 
d&#8217;extension, ni la m&#234;me transparence. Ainsi, les ressources d&#233;velopp&#233;es pour une application sont 
rarement directement exploitables pour d&#8217;autres applications, voire d&#8217;autres types de corpus 
(documentation technique, e-mail etc&#8230;). Par ailleurs, chaque outil demande un apprentissage de la 
part des utilisateurs.  
</p>
<p>Comment faciliter la t&#226;che des utilisateurs, &#233;ventuellement non linguistes et non informaticiens, de 
syst&#232;mes &#224; vis&#233;e industrielle ? Autrement dit, comment garantir des performances int&#233;ressantes tout 
en d&#233;lestant les utilisateurs d&#8217;une partie de la charge de d&#233;veloppement ? Nous pensons apporter 
une r&#233;ponse &#224; cette question en assurant l&#8217;int&#233;gration de connaissances sp&#233;cifiques (tir&#233;es du corpus) 
et g&#233;n&#233;riques (hors-corpus) de fa&#231;on automatique, par le biais d&#8217;un assistant linguistique : LIZARD 
(LInguistic wiZARD). Cet assistant est guid&#233; par les principes de l&#8217;analyse distributionnelle, 
appliqu&#233;e aux corpus de sp&#233;cialit&#233;. Nous pr&#233;senterons tout d&#8217;abord les fonctionnalit&#233;s principales de 
LIZARD, puis nous examinerons un exemple d&#8217;application &#224; la recherche d&#8217;information. Nous 
pr&#233;senterons, une &#233;valuation chiffr&#233;e de l&#8217;apport de LIZARD pour une t&#226;che de filtrage 
d&#8217;information par cascades de transducteurs. 
</p>
<p>2 LIZARD, fonctionnalit&#233;s principales 
</p>
<p>2.1 Une architecture modulaire 
</p>
<p>La Figure 1 donne un aper&#231;u de l&#8217;architecture de l&#8217;assistant linguistique, dans laquelle les 
composants sont repr&#233;sent&#233;s sous la forme de bo&#238;tes rectangulaires.  
</p>
<p> 
</p>
<p>Figure 1 : vue globale de l&#8217;architecture de LIZARD 
</p>
<p>Les composants retenus sont : Intex, pour les op&#233;rations li&#233;es aux corpus2, effectu&#233;es gr&#226;ce &#224; des 
cascades de transducteurs &#224; &#233;tats finis, Memodata3, pour les op&#233;rations s&#233;mantiques telles que le 
                                                 
</p>
<p>2  Voir (Silberztein et al., 2001) pour plus de pr&#233;cisions sur la plate-forme Intex. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LIZARD, un assistant linguistique pour le d&#233;veloppement de ressources linguistiques &#224; base de 
transducteurs 
</p>
<p>calcul de la distance s&#233;mantique entre deux expressions, la comparaison de mots, expressions et 
phrases. Par ailleurs, un &#233;tiqueteur syntaxique g&#233;n&#233;rique, en l&#8217;occurrence QTag de O. Mason de 
l&#8217;universit&#233; de Sheffield est int&#233;gr&#233; au syst&#232;me, ainsi qu&#8217;une interface utilisateur fournissant &#224; 
l&#8217;utilisateur un acc&#232;s distant (applet Java). Les &#233;changes entre composants sont repr&#233;sent&#233;s par des 
fl&#232;ches bris&#233;es uni- ou bidirectionnelles en fonction des propri&#233;t&#233;s de chaque objet. La ligne gris&#233;e 
repr&#233;sente la fronti&#232;re du syst&#232;me ; seule l&#8217;interface est accessible &#224; l&#8217;utilisateur. L&#8217;entr&#233;e du syst&#232;me 
est constitu&#233;e par les corpus de textes bruts, la sortie est une base de donn&#233;es lexico-grammaticales, 
codant quelques propri&#233;t&#233;s syntaxiques de surface ainsi que quelques propri&#233;t&#233;s lexicales (liens 
s&#233;mantiques) de verbes extraits des corpus : nombre et type de compl&#233;ments habituels de chaque 
verbe, transformations possibles, termes s&#233;mantiquement reli&#233;s. Cette base est le r&#233;sultat d&#8217;une 
expansion s&#233;mantique r&#233;alis&#233;e par le composant Memodata &#224; partir de sch&#233;mas de sous-
cat&#233;gorisation rudimentaires extraits des corpus. 
</p>
<p>Dans cette conception modulaire, chaque composant peut &#234;tre remplac&#233; si l&#8217;application le demande : 
ainsi, on peut envisager de remplacer Memodata par Wordnet, Intex par d&#8217;autres outils 
d&#8217;exploration des textes, ou encore d&#8217;inclure un nouveau module. Chaque module peut &#234;tre ais&#233;ment 
transform&#233; en agent autonome en suivant les sp&#233;cifications de la plate-forme Open Agent 
Architecture, d&#233;velopp&#233;e au Stanford Research Institute4. En effet, la d&#233;claration d&#8217;un agent OAA 
passe sch&#233;matiquement par la sp&#233;cification des services qu&#8217;il assure en termes de requ&#234;tes et de 
r&#233;ponses, les &#233;changes normalis&#233;s entre agents OAA &#233;tant contr&#244;l&#233;s par un agent superviseur. 
L&#8217;int&#233;r&#234;t majeur de la plate-forme OAA est la possibilit&#233; de faire cohabiter des agents h&#233;t&#233;rog&#232;nes, 
en l&#8217;occurrence, pour LIZARD, les agents Memodata, Interface et &#201;tiqueteur sont &#233;crits en Java, 
alors que l&#8217;agent Intex est d&#233;velopp&#233; en C/C++. L&#8217;ensemble des &#233;changes entre agents ont lieu sous 
la forme de requ&#234;tes adress&#233;es au superviseur, qui les aiguille vers le bon service. LIZARD est, de 
fait, un syst&#232;me multiagents distribu&#233; : les modules gourmands en ressources (tels que Memodata et 
Intex) peuvent &#234;tre localis&#233;s sur des serveurs d&#233;di&#233;s, pour ne laisser que l&#8217;interface sur le poste 
client. 
</p>
<p>2.2 Extraction de signatures th&#233;matiques 
</p>
<p>La fonctionnalit&#233; principale de LIZARD est l&#8217;extraction d&#8217;expressions typiques d&#8217;un domaine, que 
nous appelons signatures th&#233;matiques. Cette extraction repose sur les modules Intex et Memodata et 
vise &#224; produire des bases de donn&#233;es lexicales proches, dans leur format, des tables du lexique-
grammaire. Les signatures th&#233;matiques recherch&#233;es5 se distinguent des termes (Bourigault, 1993), 
des unit&#233;s lexicales complexes (Habert et al., 1997), ou encore des collocations en ce qu&#8217;elles ne 
valent que pour un domaine, un corpus de sp&#233;cialit&#233; et une application donn&#233;e. Ces signatures sont 
essentiellement construites autour de pr&#233;dicats, r&#233;alis&#233;s soit par des verbes pleins &#224; l&#8217;actif et au passif 
</p>
<p>                                                                                                                                                        
</p>
<p>3  Les op&#233;rations s&#233;mantiques sont assur&#233;es par le Dictionnaire Int&#233;gral (DI), d&#233;crit dans (Dutoit, 2000). 
</p>
<p>4  Voir (Martin et al., 1999). 
</p>
<p>5  Par exemple : Thales rach&#232;te la filiale EADS de Dassault. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antonio Balvet 
</p>
<p>(ex : racheter la filiale XY), soit par des formes nominalis&#233;es &#233;ventuellement associ&#233;es &#224; des 
verbes-support (ex : se porter acqu&#233;reur de la filiale XY). 
</p>
<p>2.2.1 Application de cascades de transducteurs pour l&#8217;extraction de sch&#233;mas de sous-
cat&#233;gorisation 
</p>
<p>LIZARD, par le biais de l&#8217;agent Intex, permet de pr&#233;traiter, &#233;tiqueter puis explorer des corpus de 
textes de fa&#231;on efficace. En effet, Intex repose sur la technique des cascades de transducteurs &#224; &#233;tats 
finis, qui assurent des temps de traitement compatibles avec des applications en vraie grandeur. Par 
ailleurs, Intex a adopt&#233; une repr&#233;sentation graphique pour les transducteurs utilis&#233;s tant dans les 
&#233;tapes de pr&#233;traitement que dans celles de fouille des textes &#224; partir de requ&#234;tes des utilisateurs, qui 
assurent une meilleure lisibilit&#233; aux grammaires d&#233;crites sous cette forme par rapport &#224; des 
expressions r&#233;guli&#232;res classiques (voir Figure 2) ou des r&#232;gles de type clauses Prolog. De plus, 
chaque transducteur graphique peut faire appel &#224; d&#8217;autres transducteurs, ce qui conf&#232;re &#224; Intex des 
qualit&#233;s int&#233;ressantes en termes de r&#233;utilisabilit&#233; et de modularit&#233;. Le transducteur graphique de la 
Figure 2 ci-dessous d&#233;crit une grammaire locale tr&#232;s simple reconnaissant un groupe verbal dont la 
t&#234;te est conjugu&#233;e au pass&#233; compos&#233;, &#224; la voix passive6 (la reconnaissance d&#8217;une insertion non 
born&#233;e entre l&#8217;auxiliaire et le verbe plein est rendue possible gr&#226;ce &#224; l&#8217;&#233;tat &lt;MOT&gt;*). 
</p>
<p> 
</p>
<p>Figure 2 : transducteur graphique Intex codant une grammaire locale simplifi&#233;e 
</p>
<p>Les transducteurs graphiques Intex repr&#233;sentent visuellement les alternatives par autant de chemins 
divergents, les &#233;l&#233;ments &#224; rep&#233;rer sont d&#233;crits dans les bo&#238;tes, la sortie de chaque transducteur est 
mat&#233;rialis&#233;e en dessous de l&#8217;&#233;tat qui la produit. Intex permet de rechercher des s&#233;quences de 
caract&#232;re particuli&#232;res, mais &#233;galement des constructions syntaxiques particuli&#232;res : le syst&#232;me 
reconna&#238;t une quarantaine d&#8217;&#233;tiquettes syntaxiques telles que N, Det, V etc&#8230; 
</p>
<p>LIZARD fonctionne comme une surcouche au-dessus des composants particuliers int&#233;gr&#233;s, destin&#233;e 
autant &#224; faciliter la t&#226;che de d&#233;veloppeurs experts dans l&#8217;&#233;laboration de ressources linguistiques, que 
d&#8217;utilisateurs non experts. Dans l&#8217;&#233;tat actuel, LIZARD n&#8217;offre que les services orient&#233;s vers les 
experts : la fonctionnalit&#233; principale de l&#8217;assistant est l&#8217;extraction de patrons de sous-cat&#233;gorisation 
rudimentaires &#224; partir de textes &#233;tiquet&#233;s et d&#233;sambigu&#239; s&#233;s. Cette extraction repose sur plusieurs 
phases dites de &#171; g&#233;n&#233;ralisation &#187;, elle vise &#224; fournir un ensemble d&#8217;expressions typiques et non 
ambigu&#235;s d&#8217;un domaine de sp&#233;cialit&#233;, en fonction d&#8217;un corpus et d&#8217;une application particuli&#232;re vis&#233;e : 
</p>
<p>                                                 
</p>
<p>6  Cette grammaire locale reconna&#238;t les formes suivantes : ont &#233;t&#233; vraiment tr&#232;s choqu&#233;s, a &#233;t&#233; atteint etc&#8230; Elle 
permet de marquer dans le texte analys&#233; le d&#233;but et la fin de la s&#233;quence reconnue, gr&#226;ce aux balises 
&lt;V_FORM :PASSIF&gt;&lt;/V_FORM :PASSIF&gt; introduites en sortie de transducteur. Ce marquage est susceptible 
d&#8217;&#234;tre utilis&#233; lors de phases d&#8217;analyse ult&#233;rieures, selon le principe des cascades de transducteurs (Abney, 
1996). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LIZARD, un assistant linguistique pour le d&#233;veloppement de ressources linguistiques &#224; base de 
transducteurs 
</p>
<p>les signatures th&#233;matiques. Ces phases ont pour but de ne s&#233;lectionner que les unit&#233;s potentiellement 
int&#233;ressantes au regard de l&#8217;application vis&#233;e, de fa&#231;on param&#233;trable. Ainsi, la Figure 3 donne un 
aper&#231;u d&#8217;une phase de g&#233;n&#233;ralisation visant &#224; ne conserver que la forme lemmatis&#233;e des entr&#233;es 
verbales, suivie d&#8217;un certain nombre de compl&#233;ments essentiels7. Par ailleurs, les mots mal &#233;tiquet&#233;s 
sont conserv&#233;s tels quels. 
</p>
<p> 
</p>
<p>Figure 3 : fouille de corpus avec LIZARD, premi&#232;re phase 
</p>
<p>&#192; ce stade, un certain nombre d&#8217;observations sur les pr&#233;f&#233;rences de s&#233;lection des verbes extraits 
sont possibles : on voit que pour le corpus consid&#233;r&#233; (un corpus financier), au moins deux 
constructions sont possibles pour le verbe acqu&#233;rir : acqu&#233;rir + Nom Propre (un nom de soci&#233;t&#233;), et 
acqu&#233;rir + groupe nominal (Det + (usine, soci&#233;t&#233;, groupe, nom propre)). Cette premi&#232;re phase de 
g&#233;n&#233;ralisation est suivie d&#8217;une deuxi&#232;me phase, qui vise &#224; ne produire que des sch&#233;mas de sous-
cat&#233;gorisation tels que : V + Det + N, V + Prep + Det + N etc &#8230; Cette deuxi&#232;me phase sert 
essentiellement &#224; proposer des candidats-signatures th&#233;matiques, qui seront stock&#233;es dans la base de 
donn&#233;es lexico-grammaticales sous une forme proche des tables du lexique-grammaire8. La Figure 4 
donne un aper&#231;u de la seconde phase. Cette figure pr&#233;sente deux tables correspondant aux deux 
sch&#233;mas suivants : V + Prep + NPropre et V + Det + N. La phase de validation des candidats-
signatures th&#233;matiques permet de ne s&#233;lectionner que les entr&#233;es pertinentes. En l&#8217;&#233;tat actuel, cette 
</p>
<p>                                                 
</p>
<p>7  Principalement des Noms, des D&#233;terminants, des Pr&#233;positions, quelques Adverbes. 
</p>
<p>8  Une entr&#233;e lexicale suivie de traits binaires codant un certain nombre de propri&#233;t&#233;s syntaxiques et 
s&#233;mantiques, telles que le type des compl&#233;ments possibles, les transformations valides etc&#8230; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antonio Balvet 
</p>
<p>validation est r&#233;alis&#233;e manuellement, toutefois nous envisageons de l&#8217;automatiser en utilisant les 
fonctions de calcul de distance s&#233;mantique de Memodata9. 
</p>
<p> 
</p>
<p>Figure 4 : fouille de corpus avec LIZARD, validation des candidats-signature th&#233;matique 
</p>
<p>2.2.2 Interrogation d&#8217;un r&#233;seau s&#233;mantique 
</p>
<p>Une fois les candidats-signatures extraits, une phase d&#8217;expansion permet de compl&#233;ter les sch&#233;mas 
de sous-cat&#233;gorisation par l&#8217;apport de connaissances hors-corpus. Le DI constitue un r&#233;seau o&#249; 
chaque entr&#233;e est accessible par le biais d&#8217;une relation s&#233;mantique. Les entr&#233;es du dictionnaire sont 
des mots simples ou compos&#233;s, mais &#233;galement des locutions plus complexes. L&#8217;expansion du noyau 
de signatures th&#233;matiques est r&#233;alis&#233;e de fa&#231;on interactive, en proposant &#224; l&#8217;utilisateur des termes 
s&#233;mantiquement proches de ceux trouv&#233;s dans la base : synonymes, g&#233;n&#233;riques, sp&#233;cifiques, ainsi 
que locutions proches et formes transform&#233;es (ex : formes nominalis&#233;es d&#8217;une entr&#233;e verbale10). 
</p>
<p>                                                 
</p>
<p>9  Le DI int&#232;gre des algorithmes de calcul de distance s&#233;mantique qui permettent de trouver, par exemple, que 
acheter une soci&#233;t&#233; et acheter une entreprise sont plus proches l&#8217;un de l&#8217;autre que de acheter des fleurs. 
Nous envisageons de mettre en &#339;uvre ces algorithmes afin de proposer &#224; l&#8217;utilisateur un regroupement des 
candidats-signatures, en fonction de leur profil s&#233;mantique (ex., un classement tel que : racheter DET filiale 
NPropre &gt; racheter DET soci&#233;t&#233; NPropre &gt; PRO racheter DET conduite). 
</p>
<p>10  Ex : le DI permet de calculer acheteur et achat &#224; partir de acheter, par les relations &#171; personne qui V &#187; et 
&#171; action de V &#187;. L&#8217;algorithme de parcours du r&#233;seau lui-m&#234;me est d&#233;crit de fa&#231;on extensive dans (Dutoit, 2000). 
(Poibeau, 2002) donne un exemple de param&#233;trage de cet algorithme pour une t&#226;che d&#8217;acquisition de patrons 
lexicaux utilis&#233;s pour l&#8217;extraction d&#8217;information. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LIZARD, un assistant linguistique pour le d&#233;veloppement de ressources linguistiques &#224; base de 
transducteurs 
</p>
<p>2.2.3 Une base de donn&#233;es lexico-grammaticales 
</p>
<p>Le r&#233;sultat des op&#233;rations de fouille de texte et d&#8217;expansion des candidats-signatures th&#233;matiques est 
une base de donn&#233;es lexicales, codant le comportement syntaxique de chaque entr&#233;e, ainsi qu&#8217;un 
certain nombre d&#8217;informations s&#233;mantiques (ex : termes proches). La Figure 5 donne un aper&#231;u 
d&#8217;une base de signatures th&#233;matiques extraites d&#8217;un corpus financier, destin&#233;es &#224; &#234;tre utilis&#233;es par un 
syst&#232;me de filtrage d&#8217;information par cascades de transducteurs &#224; &#233;tats finis : CORAIL11. 
</p>
<p> 
</p>
<p>Figure 5 : base de signatures th&#233;matiques extraites d&#8217;un corpus financier 
</p>
<p>Cette base est le r&#233;sultat d&#8217;une quinzaine d&#8217;heures de travail par l&#8217;auteur du syst&#232;me, elle regroupe 
une vingtaine d&#8217;entr&#233;es lexicales, et repr&#233;sente une partie des contraintes de s&#233;lection et de 
construction associ&#233;es &#224; chaque entr&#233;e (ex : nombre, type de compl&#233;ments, transformations 
autoris&#233;es, formes nominalis&#233;es). Les candidats-signatures ont &#233;t&#233; valid&#233;s &#224; la main, int&#233;gr&#233;s et 
compl&#233;t&#233;s par consultation du DI. Le format de la base elle-m&#234;me est libre, bien que les informations 
contenues doivent &#234;tre, en l&#8217;&#233;tat actuel, compatibles avec Intex. On peut envisager une 
repr&#233;sentation XML de ces donn&#233;es, traduites par la suite dans les formats compatibles avec 
d&#8217;autres plateformes. 
</p>
<p>3 Application au filtrage d&#8217;information 
</p>
<p>Nous &#233;voquons ici une application du syst&#232;me LIZARD dans le domaine de la recherche 
d&#8217;information, en mettant l&#8217;accent sur le filtrage d&#8217;information par cascades de transducteurs. 
</p>
<p>                                                 
</p>
<p>11  Voir (Balvet et al., 2001). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antonio Balvet 
</p>
<p>3.1 Description de l&#8217;exp&#233;rience 
</p>
<p>Le filtrage d&#8217;information consiste &#224; &#233;couter un flux de documents et &#224; attribuer automatiquement 
chaque nouveau document au bon utilisateur, en fonction de son besoin en information, ce de fa&#231;on 
binaire12. Un prototype de filtrage d&#8217;information par cascades de transducteurs simples est d&#233;crit 
dans (Balvet et al., 2001) ; on peut envisager l&#8217;extension de ce syst&#232;me aux signatures th&#233;matiques 
telles que d&#233;crites plus haut. La Erreur ! Source du renvoi introuvable. pr&#233;sente une mesure du 
gain observ&#233; lors d&#8217;une migration vers l&#8217;approche par signatures th&#233;matiques, par rapport &#224; une 
approche manuelle et une expansion s&#233;mantique non syst&#233;matique.  
</p>
<p>Figure 6 : comparaison de trois approches pour le filtrage d&#8217;information par cascades de 
transducteurs 
</p>
<p>Le syst&#232;me &#171; random &#187; nous sert &#224; fixer la borne inf&#233;rieure de qualit&#233; pour l&#8217;&#233;valuation, il permet, 
selon nous, de relativiser les performances des syst&#232;mes &#233;valu&#233;s, eu &#233;gard &#224; la t&#226;che consid&#233;r&#233;e 
(classification binaire) : une grande partie du probl&#232;me (environ 50% en rappel) est couverte par 
cette approche al&#233;atoire, sans aucune intelligence. Le syst&#232;me dit &#171; manuel &#187; est le r&#233;sultat d&#8217;une 
&#233;tude classique sur corpus, effectu&#233;e par S. Bizouard en vue d&#8217;une exp&#233;rience d&#8217;&#233;valuation sur une 
t&#226;che d&#8217;extraction d&#8217;information. Les grammaires locales d&#233;velopp&#233;es au cours de cette exp&#233;rience 
visaient &#224; alimenter une base de donn&#233;es de sc&#233;narios de cessions et acquisitions de soci&#233;t&#233;s13 
(acheteur, entreprise achet&#233;e, montant de la transaction etc&#8230;). Ces grammaires peuvent &#233;galement 
servir &#224; une t&#226;che de filtrage : elles rep&#232;rent, de fait, des documents traitant du th&#232;me &#171; cessions et 
acquisitions &#187;.   
</p>
<p>Le corpus employ&#233; pour cette &#233;valuation consiste en un ensemble de d&#233;p&#234;ches du domaine financier, 
il nous a &#233;t&#233; communiqu&#233; par la soci&#233;t&#233; Firstinvest, propri&#233;taire d&#8217;un portail de services financiers sur 
Internet. Il est constitu&#233; de 2,6 Mo de d&#233;p&#234;ches faiblement balis&#233;es14, r&#233;dig&#233;es par des experts 
                                                 
</p>
<p>12  Chaque document entr&#233; est class&#233; comme pertinent/non pertinent en fonction de chaque profil. 
</p>
<p>13  Voir (Bizouard, 2001). 
</p>
<p>14  Les documents sont d&#233;coup&#233;s en unit&#233;s textuelles majeurs telles que : titre, corps de d&#233;p&#234;che, date etc&#8230; Les 
noms propres et les noms de soci&#233;t&#233; sont respectivement rep&#233;r&#233;s par les balises : &lt;i&gt;&lt;/i&gt; et &lt;b&gt;&lt;/b&gt;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LIZARD, un assistant linguistique pour le d&#233;veloppement de ressources linguistiques &#224; base de 
transducteurs 
</p>
<p>financiers en fran&#231;ais, traitant 19 th&#232;mes (de &#171; rumeurs &#187; &#224; &#171; profit-warning &#187; en passant par 
&#171; cessions/acquisitions de soci&#233;t&#233;s &#187;). Les documents dont nous disposons ne constituent que des 
exemples positifs, en termes d&#8217;apprentissage, &#233;tant donn&#233; que l&#8217;ensemble du fonds documentaire 
nous est parvenu index&#233; en fonction des th&#232;mes &#233;voqu&#233;s plus haut. Nous avons donc d&#251; &#233;laborer 
manuellement un corpus d&#8217;exemples n&#233;gatifs (50 d&#233;p&#234;ches), constitu&#233; de documents attribu&#233;s &#224; 
d&#8217;autres th&#232;mes que les cessions/acquisitions de soci&#233;t&#233;s. Pour notre &#233;valuation, nous nous limiterons 
au th&#232;me 19 : cessions/acquisitions de soci&#233;t&#233;s, qui regroupe 303 documents, r&#233;partis en 2/3 pour le 
corpus de param&#233;trage et 1/3 pour le corpus de test. 
</p>
<p>L&#8217;apport essentiel d&#8217;une approche telle qu&#8217;impl&#233;ment&#233;e par LIZARD semble r&#233;sider dans une 
meilleure couverture du domaine (100% de taux de rappel) tout en gardant une pr&#233;cision 
comparable &#224; l&#8217;approche manuelle. Par ailleurs, le recours &#224; un assistant linguistique permet de 
r&#233;duire le temps de d&#233;veloppement : d&#8217;environ 3 hommes-mois, pour l&#8217;approche manuelle, &#224; une 
quinzaine d&#8217;heures pour l&#8217;approche semi-automatique. 
</p>
<p>4 Conclusion et perspectives 
</p>
<p>Nous avons pr&#233;sent&#233; un outil destin&#233; &#224; all&#233;ger la t&#226;che des d&#233;veloppeurs de ressources linguistiques 
bas&#233;es sur les analyses partielles et les cascades de transducteurs &#224; &#233;tats finis. Cet outil, LIZARD, 
est con&#231;u comme un syst&#232;me modulaire, param&#233;trable, construit autour de composants linguistiques 
g&#233;n&#233;riques, ayant fait la preuve de leur efficacit&#233;. Nous avons soulign&#233; l&#8217;int&#233;r&#234;t d&#8217;un tel dispositif, au 
regard de la diffusion des approches dites partielles et de celles bas&#233;es sur des cascades de 
transducteurs. Nous avons montr&#233; quel gain le recours &#224; un tel assistant pouvait apporter sur une 
t&#226;che de recherche d&#8217;information : le filtrage d&#8217;information. Cet outil permet &#233;galement de valider 
l&#8217;hypoth&#232;se sous-jacente &#224; notre travail expos&#233; : les textes de sp&#233;cialit&#233; renferment des r&#233;gularit&#233;s 
linguistiques susceptibles d&#8217;&#234;tre mises &#224; jour par une analyse des propri&#233;t&#233;s distributionnelles des 
objets linguistiques consid&#233;r&#233;s (i.e. les signatures th&#233;matiques). Les objets ainsi mis en &#233;vidence 
fournissent une sorte de profil th&#233;matique des textes, dont la pr&#233;cision permet d&#8217;envisager des 
applications en vraie grandeur, telles que le filtrage d&#8217;information. Par ailleurs, des applications &#224; des 
domaines tels que l&#8217;enseignement des langues, la terminologie et la lexicographie nous paraissent 
pouvoir &#233;galement b&#233;n&#233;ficier de l&#8217;approche d&#233;crite ici. 
</p>
<p>Le travail pr&#233;sent&#233; ici suscite toutefois des interrogations quant &#224; l&#8217;extension d&#8217;une approche 
distributionnelle reposant sur une analyse partielle (grammaires locales), compl&#233;t&#233;e par des 
ressources externes, &#224; d&#8217;autres domaines, d&#8217;autres corpus ou encore d&#8217;autres applications. Par 
ailleurs, nous comptons compl&#233;ter l&#8217;approche d&#233;crite ici, reposant uniquement sur des ressources 
explicites (r&#232;gles symboliques), par la prise en compte des liens entre distribution et probabilit&#233; 
d&#8217;occurrence, tels qu&#8217;explor&#233;s dans (Daille, 1994). 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Abney S. (1996), Partial parsing via finite-state cascades, Actes de ESSLLI'96 Robust Parsing 
Workshop. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Antonio Balvet 
</p>
<p>Balvet A., Meunier F., Poibeau T., Viard D., Vichot F., Wolinski F. (2001), Filtrage de documents 
et grammaires locales : le projet CORAIL, Actes du Troisi&#232;me Congr&#232;s du Chapitre Fran&#231;ais de 
l&#8217;ISKO (International Society for Knowledge Organisation) : Filtrage et r&#233;sum&#233; automatique 
de l&#8217;information sur les r&#233;seaux, 5-6 juillet 2001, Universit&#233; de Nanterre-Paris X. 
</p>
<p>Bizouard S. (2001), &#201;valuation d&#8217;outils d&#8217;acquisition de ressources linguistiques pour 
l&#8217;extraction, M&#233;moire de DESS en Ing&#233;nierie Multilingue, CRIM, INALCO. 
</p>
<p>Bourigault D. (1993), Analyse syntaxique locale pour le rep&#233;rage de termes complexes dans un 
texte, TAL n&#176;34(2). 
</p>
<p>Daille B. (1994), Approche mixte pour l&#8217;extraction automatique de terminologie : statistiques 
lexicales et filtres linguistiques, Th&#232;se de doctorat, Universit&#233; Paris VII. 
</p>
<p>Dutoit D. (2000), Quelques op&#233;rations Texte &#174; Sens et Sens &#174; Texte utilisant une s&#233;mantique 
linguistique universaliste apriorique, Th&#232;se de doctorat, Universit&#233; de Caen. 
</p>
<p>Habert B., Nazarenko A., Salem A. (1997), Les linguistiques de corpus, Armand Colin. 
</p>
<p>Martin D., Cheyer A.J., Moran D.B., (1999), The Open Agent Architecture: a framework for 
building distributed software systems, Applied Artificial Intelligence, vol. 13, p 91-128. 
</p>
<p>Mohri M., (2001), Language processing with weighted transducers, Actes de la huiti&#232;me 
conf&#233;rence sur le Traitement Automatique des Langues Naturelles, 2-5 juillet 2001, pp.5-14, 
Tours. 
</p>
<p>Poibeau T. (2002), Extraction d&#8217;information &#224; base de connaissances hybrides, Th&#232;se de 
doctorat, Universit&#233; Paris XIII. 
</p>
<p>Riloff E. (1994), Information Extraction as a Basis for Portable Text Classification Systems, 
Th&#232;se de doctorat, Universit&#233; du Massachussets Amherst. 
</p>
<p>Silberztein M., Poibeau T., Balvet A., (2001). Tutoriel : Intex et ses applications informatiques, 
Actes de la huiti&#232;me conf&#233;rence sur le Traitement Automatique des Langues Naturelles, 2-5 
juillet 2001, pp.145-174, Tours. </p>

</div></div>
</body></html>