<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Etude des r&#233;p&#233;titions en fran&#231;ais parl&#233; spontan&#233; pour les technologies de la parole</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2002, Nancy, 24-27 juin 2002 
</p>
<p>Etude des r&#233;p&#233;titions en fran&#231;ais parl&#233; spontan&#233; pour les 
technologies de la parole 
</p>
<p>Sandrine Henry 
</p>
<p>&#201;quipe DELIC &#8211; Universit&#233; de Provence 
29, Av. Robert Schuman, 13621 Aix-en-Provence Cedex 1 
</p>
<p>sandrine_henry@hotmail.com 
</p>
<p>Mots-clefs &#8211; Keywords 
</p>
<p>R&#233;p&#233;titions, fran&#231;ais parl&#233; spontan&#233;, &#171; disfluences &#187;, ph&#233;nom&#232;nes de performance, &#233;tude 
quantitative, reconnaissance de la parole, &#233;tiquetage morpho-syntaxique. 
</p>
<p>Repetitions, spontaneous French speech, disfluencies, performance phenomena, quantitative 
study, speech recognition, part-of-speech tagging. 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Cet article rapporte les r&#233;sultats d&#8217;une &#233;tude quantitative des r&#233;p&#233;titions men&#233;e &#224; partir d&#8217;un 
corpus de fran&#231;ais parl&#233; spontan&#233; d&#8217;un million de mots, &#233;tude r&#233;alis&#233;e dans le cadre de notre 
premi&#232;re ann&#233;e de th&#232;se. L&#8217;&#233;tude linguistique pourra aider &#224; l&#8217;am&#233;lioration des syst&#232;mes de 
reconnaissance de la parole et de l'&#233;tiquetage grammatical automatique de corpus oraux. Ces 
technologies impliquent la prise en compte et l&#8217;&#233;tude des r&#233;p&#233;titions de performance (en 
opposition aux r&#233;p&#233;titions de comp&#233;tence, telles que nous nous sujet + compl&#233;ment) afin de 
pouvoir, par la suite, les &#171; gommer &#187; avant des traitements ult&#233;rieurs. Nos r&#233;sultats montrent 
que les r&#233;p&#233;titions de performance concernent principalement les mots-outils et apparaissent &#224; 
des fronti&#232;res syntaxiques majeures. 
</p>
<p>This article is a report of a quantitative study of repetitions based on a corpus of a one-
million-word spontaneous spoken French, conducted during the first year of our PhD thesis. 
This linguistic study can contribute to the improvement of speech recognition and spoken 
French part-of-speech tagging. Improvement of these technologies requires taking into 
account and studying performance repetitions (such as complement + complement nous nous) 
in order to be able to &quot;erase&quot; them before further processing. Our results show that repetitions 
mainly involve function words and take place at major syntactic boundaries. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Sandrine Henry 
</p>
<p>1 Introduction 
</p>
<p>Les technologies du T.A.L. sont difficiles &#224; transposer directement &#224; l'oral spontan&#233;, non 
pr&#233;par&#233;. Ainsi, par exemple, l'&#233;tiquetage morpho-syntaxique est relativement bien ma&#238;tris&#233; sur 
l'&#233;crit pour des langues telles que l'anglais ou le fran&#231;ais, puisque des r&#233;sultats sup&#233;rieurs &#224; 
95% d'&#233;tiquettes correctes sont couramment publi&#233;s. Cependant, l'&#233;tiquetage de corpus oraux 
pose des probl&#232;mes bien plus &#233;pineux, et l'on ne dispose &#224; l'heure actuelle de pratiquement 
aucun corpus oral de taille significative morpho-syntaxiquement &#233;tiquet&#233; pour le fran&#231;ais. En 
effet, tout &#233;nonc&#233; oral spontan&#233;, conserve les traces de son &#233;laboration &#224; travers des 
ph&#233;nom&#232;nes de performance, tels que la r&#233;p&#233;tition, l&#8217;autocorrection, l&#8217;allongement de la 
finale, etc., qui constituent de pr&#233;cieux indices susceptibles d&#8217;&#233;clairer le fonctionnement de la 
langue, mais constituent autant de points d'achoppement pour les technologies d&#233;riv&#233;es de 
l'&#233;crit (cf. Valli, V&#233;ronis, 1999). Par ailleurs, les technologies de reconnaissance de la parole 
(dict&#233;e vocale, etc.) ont essay&#233; de fa&#231;on constante au fil des ann&#233;es de permettre de plus en 
plus de naturel et de souplesse aux locuteurs. On est ainsi pass&#233; progressivement de la 
reconnaissance de mots isol&#233;s mono-locuteur &#224; la reconnaissance de parole continue multi-
locuteurs (avec pour l'instant des contraintes : ambiance non-bruit&#233;e, etc.). Pour autant, les 
syst&#232;mes de reconnaissance de la parole sont encore bien loin de la reconnaissance d'un flot 
continu de parole faisant intervenir des ph&#233;nom&#232;nes de performance nombreux, 
caract&#233;ristiques de l'oral non contraint et non pr&#233;par&#233;. Pourtant, l'acc&#232;s &#224; ce type d'&#233;locution 
serait une valeur ajout&#233;e non n&#233;gligeable pour les technologies concern&#233;es, avec, &#224; la cl&#233;, un 
march&#233; potentiel extr&#234;mement important. 
</p>
<p>Pendant nombre d&#8217;ann&#233;es, la tradition grammairienne, ainsi que celle du T.A.L., semblent 
avoir d&#233;laiss&#233;, voire d&#233;valoris&#233; au profit de l&#8217;&#233;crit normatif, l&#8217;&#233;tude des ph&#233;nom&#232;nes propres &#224; 
l&#8217;oral, ne d&#233;veloppant aucun cadre syntaxique pour les analyser. Les travaux les plus anciens 
sur l&#8217;oral appartiennent donc aux psycholinguistes ((Maclay, Osgood, 1959), (Levelt, 1983), 
(Shriberg, 1994), etc.) qui ont envisag&#233; ces &#171; disfluences &#187; comme un moyen privil&#233;gi&#233; pour 
d&#233;limiter les &#233;tapes de la production langagi&#232;re, dans le but d&#8217;&#233;tablir des mod&#232;les de 
performance dans la probl&#233;matique de l&#8217;encodage/d&#233;codage. 
</p>
<p>Dans le cadre de notre th&#232;se, nous nous int&#233;ressons plus particuli&#232;rement &#224; l'&#233;tude et &#224; la 
d&#233;tection automatique d'un ph&#233;nom&#232;ne de performance particulier, celui de la r&#233;p&#233;tition. 
(Blankenship &amp; Kay, 1964) ont d&#233;montr&#233; que certains types de reprises tendent &#224; red&#233;marrer 
(du moins en anglais) &#224; partir de l&#8217;initiale du syntagme, validant ainsi la pertinence des unit&#233;s 
abstraites de la linguistique dans le processus d&#8217;encodage. Des travaux plus r&#233;cents (Cand&#233;a, 
2000) semblent d&#233;montrer que (sur le fran&#231;ais) la fr&#233;quence de r&#233;p&#233;tition est directement 
corr&#233;l&#233;e au type d&#8217;unit&#233; impliqu&#233;e : il arrive presque six fois plus souvent qu&#8217;un mot-outil 
(MO) soit r&#233;p&#233;t&#233; qu&#8217;un mot plein (MP). Ces r&#233;sultats sont toutefois obtenus &#224; partir d&#8217;un 
corpus restreint (environ 10 000 mots) et d&#8217;un type particulier : celui des corpus d&#8217;enfants. 
</p>
<p>Il nous a donc sembl&#233; int&#233;ressant de r&#233;aliser une &#233;tude quantitative des r&#233;p&#233;titions en prenant 
appui sur un corpus oral de plus grande taille (environ 1 million de mots) faisant intervenir de 
tr&#232;s nombreux locuteurs (environ 1200), ce qui nous a permis de d&#233;gager des tendances 
g&#233;n&#233;rales, c&#8217;est-&#224;-dire d&#8217;&#233;chapper aux sp&#233;cificit&#233;s langagi&#232;res individuelles. 
</p>
<p>Notre but est de r&#233;pondre aux interrogations suivantes : 
</p>
<p>1. La r&#233;p&#233;tition touche-t-elle indiff&#233;remment les mots-outils et les mots pleins ? </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude des r&#233;p&#233;titions en fran&#231;ais parl&#233; spontan&#233; pour les technologies de la parole. 
</p>
<p>2. En explorant plus avant chacune de ces deux cat&#233;gories, comment sont alors r&#233;parties 
les r&#233;p&#233;titions ? Sont-elles distribu&#233;es de mani&#232;re al&#233;atoire ? 
</p>
<p>3. Est-ce qu&#8217;un examen plus minutieux sur certaines formes ambigu&#235;s, pouvant 
appartenir &#224; deux classes syntaxiques diff&#233;rentes, permet de d&#233;gager une quelconque 
tendance ? 
</p>
<p>4. Sachant que les r&#233;p&#233;titions peuvent aussi bien renvoyer &#224; des cas &#224; r&#233;p&#233;t&#233; unique (le le 
lapin) qu&#8217;&#224; des cas &#224; r&#233;p&#233;t&#233;s multiples (la la la la fleuriste), comment ces r&#233;p&#233;titions 
directes sont-elles r&#233;parties en fonction du nombre de r&#233;p&#233;t&#233;s ? 
</p>
<p>5. Dans quelle proportion les r&#233;p&#233;titions associ&#233;es, c&#8217;est-&#224;-dire celles qui int&#232;grent entre 
le r&#233;p&#233;table et le r&#233;p&#233;t&#233; d&#8217;autres marques du &#171; travail de formulation &#187; 1, ou encore 
n&#8217;importe quel mot, apparaissent-elles ? 
</p>
<p>2 Pr&#233;cisions terminologiques 
</p>
<p>2.1 Les r&#233;p&#233;titions de performance : vers une d&#233;finition 
</p>
<p>Du point de vue de la stricte s&#233;quence de surface des unit&#233;s linguistiques, on peut observer des 
mots ou des s&#233;quences identiques qui se succ&#232;dent, mais leur statut linguistique peut &#234;tre 
diff&#233;rent. La r&#233;p&#233;tition r&#233;sulte parfois des r&#232;gles propres &#224; la langue (rencontres syntaxiques, 
reprise pronominale, emphase, etc.), comme le montrent les exemples suivants :  
</p>
<p>ensuite je vous dis nous nous sommes vus le jour de la visite de l'&#233;cole [BUSabcd]2 
 
</p>
<p>il a fallu passer la ligne de d&#233;marcation -3 et on l'a pass&#233;e euh ma m&#232;re est pass&#233;e toute seule avec un 
de mes fr&#232;res - et nous nous avons pris le train [EVACUAT] 
</p>
<p>Nous parlerons dans ce cas de r&#233;p&#233;tition de comp&#233;tence. Dans d'autres cas, et ce sont 
justement ceux que nous cherchons &#224; discriminer, la r&#233;p&#233;tition est une marque du &#171; travail de 
formulation &#187; : 
</p>
<p>tout &#224; l'heure tu disais que la syntaxe n'&#233;tait pas la m&#234;me &#224; l'oral qu'&#224; l'&#233;crit et donc cela peut nous 
nous poser un probl&#232;me pour les expos&#233;s parce que on s'en tient &#224; l'&#233;crit euh &#224; nos notes quoi 
[33VOIL] 
</p>
<p>Nous nommerons cette derni&#232;re r&#233;p&#233;tition de performance4. La discrimination entre les 
</p>
<p>                                                 
1  Terme emprunt&#233; &#224; (Morel, Danon-Boileau, 1998). 
2  L&#8217;ensemble des exemples fournis sont extraits de Corpaix. Nous avons pr&#233;cis&#233; le nom du corpus dont est issu 
</p>
<p>l&#8217;exemple entre crochets. 
3  Les conventions de transcription &#233;tablies par le G.A.R.S. pr&#233;voient le tiret pour marquer la pr&#233;sence d&#8217;une 
</p>
<p>pause silencieuse.  
4  Pour simplifier, lorsque nous utilisons dans la suite le terme &#171; r&#233;p&#233;tition &#187; seul, nous entendons par l&#224; 
</p>
<p>&#171; r&#233;p&#233;tition de performance &#187;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Sandrine Henry 
</p>
<p>deux types de r&#233;p&#233;titions est d&#233;licate d'un point de vue automatique. Il suffit par exemple pour 
s'en convaincre d'avoir utilis&#233; des correcteurs orthographiques qui ont une tendance 
caract&#233;ris&#233;e &#224; pr&#233;senter comme erron&#233;es des s&#233;quences r&#233;p&#233;t&#233;es quelles qu'elles soient. Le 
probl&#232;me est rendu encore plus complexe par le fait que la r&#233;p&#233;tition n'est pas toujours 
verbatim, et concerne parfois plusieurs unit&#233;s cons&#233;cutives : 
</p>
<p>il faut arriver &#224; r&#233;aliser une harmonie entre les deux euh sans cela le la le dialogue ne peut exister 
[INTERWY] 
 
</p>
<p>on payait d&#233;j&#224; assez donc euh je vois pas pourquoi ils nous ils nous demandaient encore &#231;a [GENVE] 
</p>
<p>Les psycholinguistes ((Levelt, 1983), etc.) ont propos&#233; un cadre d'analyse qui est celui d'un 
&#171; gommage &#187; d'un ph&#233;nom&#232;ne de performance, qui permettrait de r&#233;duire les &#233;nonc&#233;s &#224; un 
oral &#171; propre &#187;, proche de l'&#233;crit5. Nous reprenons ici la terminologie propos&#233;e par (Shriberg, 
1994) afin de pr&#233;senter ici un cas de r&#233;p&#233;tition de performance (Erreur ! Source du renvoi 
introuvable.). 
</p>
<p>&#8226; Le reparandum (RM) :d&#233;signe une partie ou la totalit&#233; de la s&#233;quence qui sera 
abandonn&#233;e au profit du repair. 
</p>
<p>&#8226; L&#8217;interruption point (IP) :&#233;tablit la fronti&#232;re finale du reparandum. 
&#8226; L&#8217;interregnum (IM) : d&#233;signe la r&#233;gion comprise entre la fronti&#232;re finale du 
</p>
<p>reparandum et la fronti&#232;re initiale du repair. L&#8217;interregnum peut contenir un 
terme d&#8217;&#233;dition (editing term) qui peut &#234;tre r&#233;alis&#233; par une pause remplie ou 
encore un commentaire &#233;pilinguistique. 
</p>
<p>&#8226; Le repair (RR) :repr&#233;sente la partie r&#233;par&#233;e/corrig&#233;e du reparandum. 
</p>
<p> 
c'est pour &#231;a que je vois pas l'int&#233;r&#234;t d'ailleurs de la  &#8226;  &lt; &gt;  de la r&#233;forme orthographique 
(31TYT, 3, 3-4)    RM  IM RR 
</p>
<p>       IP 
</p>
<p>Figure 1 : Exemple de r&#233;p&#233;tition de performance 
</p>
<p>La r&#233;p&#233;tition correspond au cas o&#249; la &#171; zone achev&#233;e &#187; de l&#8217;&#233;nonc&#233; (le repair) ne pr&#233;sente 
aucune correction par rapport &#224; la &#171; zone en devenir &#187; qu&#8217;est le reparandum. 
</p>
<p>Un autre mod&#232;le de repr&#233;sentation du ph&#233;nom&#232;ne, bien connu des syntacticiens mais encore 
peu exploit&#233; dans le domaine du T.A.L., est la &#171; mise en grille &#187; d&#233;velopp&#233;e par (Claire 
Blanche-Benveniste, 1987). Contrairement au mod&#232;le pr&#233;c&#233;dent qui implique une prise de 
d&#233;cision (gommage du ph&#233;nom&#232;ne jug&#233; &#171; disfluent &#187;), la repr&#233;sentation en grilles pr&#233;sente 
l&#8217;avantage d&#8217;&#234;tre plus neutre en ce sens qu&#8217;elle permet de visualiser &#224; la fois les r&#233;p&#233;titions de 
performance (Figure 2) mais &#233;galement celles qui semblent d&#233;lib&#233;r&#233;es : r&#233;p&#233;titions intensives, 
etc. (Figure 3). L&#8217;int&#233;r&#234;t r&#233;side ici en une repr&#233;sentation de l&#8217;architecture syntaxique des 
&#233;nonc&#233;s en suivant un cadre d&#8217;analyse unifi&#233;. 
</p>
<p>                                                 
5  Ce cadre, qui ram&#232;ne finalement l'oral &#224; une norme (&#233;crite) hypoth&#233;tique est tr&#232;s discutable, et sa critique 
</p>
<p>(preuves empiriques &#224; l'appui) fait l'objet du travail futur dans le cadre de notre th&#232;se. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude des r&#233;p&#233;titions en fran&#231;ais parl&#233; spontan&#233; pour les technologies de la parole. 
</p>
<p>Les figures 2 et 3 montrent bien que la r&#233;p&#233;tition, par opposition &#224; d&#8217;autres marques du 
&#171; travail de formulation &#187;, brise l&#8217;avanc&#233;e syntagmatique, cr&#233;ant ainsi un &#171; pi&#233;tinement &#187; sur 
un m&#234;me emplacement syntaxique, au profit d&#8217;une ouverture de l&#8217;axe paradigmatique. 
</p>
<p>mais euh l&#224; je me suis inscrite  &#224; 
     &#224; l'&#233;cole de voile  de 
        de mon entreprise [CLAIRE] 
</p>
<p>Figure 2 : &#171; Mise en grille &#187; de r&#233;p&#233;titions de performance 
</p>
<p> 
</p>
<p>alors il y a des oliviers qui sont  tr&#232;s 
      tr&#232;s 
      tr&#232;s vieux [JERUSALEM] 
</p>
<p>Figure 3 : &#171; Mise en grille &#187; d&#8217;une r&#233;p&#233;tition &#171; stylistique &#187;6 
</p>
<p>2.2 La classification des unit&#233;s lexicales 
</p>
<p>Un autre aspect m&#233;thodologique qu&#8217;il nous faut &#233;galement pr&#233;ciser avant d&#8217;aller plus loin 
dans notre r&#233;flexion est la classification des unit&#233;s lexicales. Il nous faut distinguer en effet les 
mots qui ont une charge lexicale pleine (les mots pleins) de ceux qui participent simplement 
de la structuration de la langue (les mots-outils). Cette distinction mot-plein/mot-outil est 
largement utilis&#233;e en T.A.L. (recherche d'information, etc.), mais il est important de noter que 
les cat&#233;gories propos&#233;es pour les mots-outils de l'&#233;crit ne recouvrent que tr&#232;s imparfaitement 
les unit&#233;s de l'oral. Nous avons retenu la m&#233;thode de classification initialement forg&#233;e par 
(Morel, Danon-Boileau, 1998), mais nous ne l&#8217;avons reprise que partiellement en excluant la 
classe des ligateurs. Nous ne sommes malheureusement pas en mesure, &#233;tant donn&#233; la taille de 
notre corpus, de traiter individuellement tous les connecteurs et conjonctions. Pr&#233;cisons aussi 
que nous avons exclu les interjections de type euh, b&#233;, mm, etc., qui correspondent &#224; des 
marques du &#171; travail de formulation &#187;. La Figure 4 pr&#233;sente notre classification. 
</p>
<p>MO  MP 
</p>
<p> D&#233;terminants   noms 
</p>
<p> pr&#233;positions et locutions pr&#233;positionnelles   adjectifs 
</p>
<p> verbes auxiliaires, attributifs, op&#233;rateurs, 
supports et copulatifs 
</p>
<p>  verbes 
</p>
<p> pronoms personnels, d&#233;monstratifs, possessifs, 
relatifs et ind&#233;finis 
</p>
<p>  adverbes et locutions adverbiales 
</p>
<p> conjonctions et locutions conjonctives   onomatop&#233;es et interjections 
</p>
<p> adverbes de n&#233;gation ne et pas   syntagmes et d&#233;buts de syntagmes nominaux 
ou verbaux 
</p>
<p> introducteur de rh&#232;me c&#8217;est   
</p>
<p>Figure 4 : Classification des unit&#233;s 
</p>
<p>                                                 
6  Concernant cet exemple, seul l&#8217;acc&#232;s au son nous permet d&#8217;affirmer qu&#8217;il s&#8217;agit d&#8217;une r&#233;p&#233;tition 
</p>
<p>&#171; stylistique &#187;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Sandrine Henry 
</p>
<p>2.3 Vers la r&#233;alisation d&#8217;une typologie des r&#233;p&#233;titions de performance 
</p>
<p>Afin d&#8217;&#233;tablir une classification des r&#233;p&#233;titions, nous proposons de distinguer, d&#8217;une part, la 
r&#233;p&#233;tition dite &#171; simple &#187; de la r&#233;p&#233;tition &#171; multiple &#187;, et d&#8217;autre part, la r&#233;p&#233;tition &#171; directe &#187; 
de la r&#233;p&#233;tition &#171; associ&#233;e &#187; &#224; la pause silencieuse ou remplie, ou encore &#224; un mot quelconque. 
La r&#233;p&#233;tition &#171; simple &#187; correspond au bloc form&#233; du r&#233;p&#233;table suivi d&#8217;un seul et unique 
r&#233;p&#233;t&#233;. A contrario, toute r&#233;p&#233;tition dont le r&#233;p&#233;table est repris au moins deux fois sera 
qualifi&#233;e de &#171; multiple &#187;. Lorsque le r&#233;p&#233;table est suivi imm&#233;diatement par son r&#233;p&#233;t&#233; sans 
aucune autre marque du &#171; travail de formulation &#187; ou de tout autre &#233;l&#233;ment, la r&#233;p&#233;tition est 
dite &#171; directe &#187;, sinon elle est dite &#171; associ&#233;e &#187;. Dans la sch&#233;matisation que nous proposons 
(Figure 5), R0 repr&#233;sente le r&#233;p&#233;table et R1 R2 &#8230; Rn les r&#233;p&#233;t&#233;s. Les parenth&#232;ses, optionnelles, 
indiquent que la pause peut appara&#238;tre indiff&#233;remment entre le r&#233;p&#233;table et le r&#233;p&#233;t&#233; ou entre 
les r&#233;p&#233;t&#233;s. Nous envisageons, dans notre th&#232;se, d&#8217;int&#233;grer &#233;galement une &#233;tude des contextes 
gauche et droit des r&#233;p&#233;titions. 
</p>
<p> 
</p>
<p> Directe Associ&#233;e 
</p>
<p>  pause silencieuse pause remplie mot 
</p>
<p>Simple R0 R1 R0 + R1 R0 euh R1 R0 m R1 
</p>
<p>Multiple R0 R1 R2 &#8230; Rn R0 (+ ou euh ou m) R1 (+ ou euh ou m) R2 &#8230; (+ ou euh ou m) Rn 
</p>
<p>Figure 5 : Sch&#233;matisation des diff&#233;rents types de r&#233;p&#233;titions 
</p>
<p>3 M&#233;thode de travail 
</p>
<p>3.1 Pr&#233;sentation de notre corpus de travail 
</p>
<p>Notre corpus de travail comporte 1 000 382 mots. Nous l&#8217;avons constitu&#233; &#224; l&#8217;aide de Corpaix, 
un corpus &#233;tabli au cours de ces vingt-cinq derni&#232;res ann&#233;es par le G.A.R.S.7 (actuellement 
&#233;quipe D.E.L.I.C.8), qui correspond &#224; un recueil de paroles spontan&#233;es, auquel nous avons 
ajout&#233; de nouveaux enregistrements personnels. Contrairement &#224; certains corpus &#171; orient&#233;s &#187; 
tels que AMEX, SWBD, British National Corpus, etc., o&#249; la situation de communication avait 
&#233;t&#233; d&#233;termin&#233;e au pr&#233;alable (&#233;changes t&#233;l&#233;phoniques avec le personnel de compagnies 
a&#233;riennes pour obtenir des renseignements, ou encore ex&#233;cution par le locuteur de certaines 
consignes pr&#233;alablement fournies), nous proposons des situations d&#8217;enregistrement 
extr&#234;mement vari&#233;es o&#249; le locuteur adulte produit un oral totalement spontan&#233;. 
</p>
<p>Les enregistrements ont &#233;t&#233; transcrits, pour la plupart, par des &#233;tudiants en linguistique, puis 
v&#233;rifi&#233;s par des transcripteurs exp&#233;riment&#233;s. Ces transcriptions ont &#233;t&#233; r&#233;alis&#233;es en suivant les 
conventions de transcription initialement &#233;tablies par le G.A.R.S., puis reprises par le groupe 
D.E.L.I.C. Pour l&#8217;instant, notre corpus ne pr&#233;sente pas un alignement texte/son. 
</p>
<p>                                                 
7  Groupe Aixois de Recherche en Syntaxe. 
8  DEscription Linguistique Informatis&#233;e sur Corpus. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude des r&#233;p&#233;titions en fran&#231;ais parl&#233; spontan&#233; pour les technologies de la parole. 
</p>
<p>3.2 D&#233;tection automatique du ph&#233;nom&#232;ne 
</p>
<p>Dans un premier temps, nous avons &#233;crit un programme en langage Perl qui d&#233;tecte les 
ph&#233;nom&#232;nes de r&#233;p&#233;tition &#171; brute &#187;, de &#171; surface &#187;, ce qui correspond, du point de vue de la 
programmation, &#224; tout mot9 suivi imm&#233;diatement par lui-m&#234;me ou bien s&#233;par&#233; de sa r&#233;p&#233;tition 
par un autre mot. Nous avons ensuite appliqu&#233; ce programme &#224; notre corpus de travail &#224; 
l&#8217;int&#233;rieur duquel nous avons supprim&#233; tous les s&#233;parateurs de corpus, les notes de bas de 
page, les signes typographiques marquant les allongements vocaliques ainsi que toutes les 
notations indiquant les tours de parole entre les diff&#233;rents locuteurs (not&#233;es L1, L2, etc.). 
</p>
<p>Le r&#233;sultat constitue un r&#233;servoir de 29 948 r&#233;p&#233;titions brutes contenant &#224; la fois des 
r&#233;p&#233;titions qui apparaissent comme des faits de langue (par exemple, peu &#224; peu, ou encore 
nous nous sommes baign&#233;s) dans lesquelles nous incluons les r&#233;p&#233;titions &#171; stylistiques &#187;, mais 
&#233;galement des r&#233;p&#233;titions de performance, aussi a-t-il &#233;t&#233; n&#233;cessaire de trier les donn&#233;es 
obtenues afin de ne garder que ces derni&#232;res. 
</p>
<p>3.3 Filtrage manuel des donn&#233;es 
</p>
<p>Etant entendu que le traitement informatique des donn&#233;es n&#8217;a r&#233;alis&#233; qu&#8217;une d&#233;tection de 
surface du ph&#233;nom&#232;ne ici &#233;tudi&#233;, il nous a donc fallu proc&#233;der &#224; une analyse plus fine de ces 
29 948 cas. Nous ne pouvons bien &#233;videmment pas d&#233;tailler ici l&#8217;ensemble des cas de figure 
rencontr&#233;s (Henry, 2001), mais simplement pointer quelques difficult&#233;s. 
</p>
<p>A la lecture des &#233;nonc&#233;s suivants, il appara&#238;t clairement qu&#8217;on ne peut retenir de telles 
r&#233;p&#233;titions comme ph&#233;nom&#232;nes de performance puisqu&#8217;il s&#8217;agit ici de dislocations : 
</p>
<p>la population tr&#232;s certainement va se rendre euh pfff euh nombreuse lors des grandes f&#234;tes qui vont-
avoir lieu &#224; Marseille comme dans toutes les villes pour le bi-centenaire bien entendu mais nous 
Marseillais nous resterons attach&#233;s particuli&#232;rement &#224; nos marins-pompiers [BIRNIE] 
 
</p>
<p>moi je pr&#233;f&#232;re les gar&#231;ons et elle elle pr&#233;f&#232;re les filles [CIRILL1] 
</p>
<p>ou de la reprise obligatoire du pronom dans les constructions pronominales : 
</p>
<p>ah ben nous nous sommes baign&#233;s dans la mer Morte [JERUSALEM] 
</p>
<p>ou encore de la succession de deux unit&#233;s syntaxiques diff&#233;rentes : 
</p>
<p>alors la danse fait beaucoup pour nous nous aimons danser [APOSTROPHE] 
</p>
<p>Dans ces cas, le d&#233;roulement syntagmatique n&#8217;est aucunement interrompu. 
</p>
<p>                                                 
9  Dans notre programme, un mot est d&#233;fini comme un caract&#232;re (une lettre, un chiffre ou un soulign&#233;) ou une 
</p>
<p>suite de caract&#232;res s&#233;par&#233;(s) par un espace. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Sandrine Henry 
</p>
<p>4 R&#233;sultats 
</p>
<p>Premier point, nous avons pu ainsi d&#233;gager de notre corpus de travail 15 786 r&#233;p&#233;titions de 
performance. Pr&#233;cisons qu&#8217;afin d&#8217;&#233;viter de traiter les hapax et les cas quasiment isol&#233;s, nous 
avons &#233;cart&#233;, dans notre &#233;tude, les formes dont le nombre total d&#8217;occurrences est inf&#233;rieur ou 
&#233;gal &#224; 100 ; notre seuil d&#8217;int&#233;gration est donc fix&#233; &#224; 10-4. Le tableau de la Figure 6 rapporte les 
fr&#233;quences relatives des diff&#233;rentes unit&#233;s lexicales (MO, MP, MO/MP) entrant dans une 
r&#233;p&#233;tition de performance. Ajoutons qu&#8217;&#233;tant donn&#233; la taille de notre corpus, il ne nous a pas 
&#233;t&#233; possible de d&#233;finir la cat&#233;gorie d&#8217;appartenance pour certaines formes qui, alternativement, 
en fonction du contexte, se comportent comme des MO ou des MP. Il s&#8217;agit principalement de 
verbes copules (avoir, &#234;tre&#8230;) et de certaines conjonctions qui peuvent aussi parfois &#234;tre des 
noms ou des adverbes. 
</p>
<p> % Fr&#233;quence 
Absolue 
</p>
<p>Nombre total 
d&#8217;occurrences 
</p>
<p>MO 3,26 14 534 446 378 
</p>
<p>MP 0,72 430 59 914 
</p>
<p>MO/MP 1,24 822 66 375 
</p>
<p>Figure 6 : Fr&#233;quences relatives des unit&#233;s lexicales faisant l&#8217;objet d&#8217;une r&#233;p&#233;tition de 
performance 
</p>
<p>Nos r&#233;sultats corroborent dans l&#8217;ensemble ceux donn&#233;s par Cand&#233;a (2000) qui a montr&#233; que 
les MO font plus fr&#233;quemment l&#8217;objet d&#8217;une r&#233;p&#233;tition (2,94%) que les MP (0,56%). 
Effectivement, on remarque, d&#8217;apr&#232;s nos fr&#233;quences, qu&#8217;il arrive presque 5 fois plus souvent 
qu&#8217;un MO soit r&#233;p&#233;t&#233; par rapport &#224; un MP et Cand&#233;a a trouv&#233;, quant &#224; elle, un rapport de 6. 
</p>
<p>Deuxi&#232;me point, les r&#233;p&#233;titions ne touchent pas indiff&#233;remment les diff&#233;rentes classes de 
mots. La r&#233;partition (en %) par classe des 14 534 r&#233;p&#233;titions impliquant des MO et des 430 
r&#233;p&#233;titions impliquant des MP est pr&#233;sent&#233;e dans le tableau suivant (Figure 7). 
</p>
<p>Figure 7 : R&#233;partition par classe des r&#233;p&#233;titions 
</p>
<p>Nous pouvons v&#233;rifier &#224; la lumi&#232;re de ces r&#233;sultats que l&#8217;ouverture de l&#8217;axe paradigmatique 
n&#8217;a pas lieu sur n&#8217;importe quelle place de la structure syntaxique puisqu&#8217;on observe que ce 
sont les mots-outils se trouvant &#224; l&#8217;initiale de syntagmes qui sont majoritairement r&#233;p&#233;t&#233;s. Il 
</p>
<p> Classe %  Classe % 
</p>
<p>MO d&#233;terminants 41,5 MP adverbes et loc. adv. 52,0 
</p>
<p> pronoms 26,0  adjectifs 25,0 
</p>
<p> pr&#233;positions et loc. pr&#233;p. 13,0  Verbes 9,0 
</p>
<p> introducteur de rh&#232;me 9,5  Noms 8,5 
</p>
<p> conjonctions et loc. conj. 7,0  syntagmes nominaux 3,5 
</p>
<p> blocs de MO 2,0  syntagmes verbaux 2,0 
</p>
<p> verbes auxiliaires, copulatifs, etc. 1,0    </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude des r&#233;p&#233;titions en fran&#231;ais parl&#233; spontan&#233; pour les technologies de la parole. 
</p>
<p>s&#8217;agit des d&#233;terminants (41,5%), pronoms (26%), pr&#233;positions (13%). Dans le cadre de notre 
&#233;tude, l&#8217;introduction d&#8217;une fonction syntaxique et l&#8217;apparition de la r&#233;p&#233;tition de performance 
semblent donc &#234;tre &#233;troitement li&#233;es. 
</p>
<p>Troisi&#232;me point, pour certaines formes, il nous a sembl&#233; int&#233;ressant de fournir une estimation 
plus fine. Ainsi, nous proposons ci-dessous (Figure 8) une nouvelle r&#233;partition des taux de 
r&#233;p&#233;tition pour les formes ambigu&#235;s le, la, les et leur selon qu&#8217;elles renvoient &#224; des 
d&#233;terminants ou &#224; des pronoms personnels compl&#233;ments. 
</p>
<p>Formes D&#233;terminants Pronoms 
Personnels 
</p>
<p>les 6,34 1,16 
</p>
<p>le 5,64 1,33 
</p>
<p>leur 4,62 0,88 
</p>
<p>la 2,76 0,75 
</p>
<p>Figure 8 : Taux de r&#233;p&#233;tition des formes les, le, leur, la en fonction de leur classe 
</p>
<p>En comparant ces taux de r&#233;p&#233;tition, il appara&#238;t tr&#232;s nettement que les d&#233;terminants font 
beaucoup plus fr&#233;quemment l&#8217;objet d&#8217;une r&#233;p&#233;tition que les pronoms clitiques compl&#233;ments. 
Quelle hypoth&#232;se avancer ? La psycholinguistique pourrait certainement nous aider. Il faudrait 
admettre que la r&#233;p&#233;tition est un moyen de suspendre son discours jusqu&#8217;&#224; ce que l&#8217;on soit 
capable de le poursuivre, ou encore de ne pas rompre l&#8217;acte de communication. Dans le cas de 
la r&#233;p&#233;tition du d&#233;terminant, c&#8217;est l&#8217;acc&#232;s &#224; l&#8217;information lexicale qui semble poser probl&#232;me. 
On ne peut pas rencontrer cette difficult&#233; pour les clitiques compl&#233;ments, mis en place tr&#232;s t&#244;t 
dans la programmation du syntagme verbal. Quatri&#232;me point, il nous a &#233;galement sembl&#233; 
pertinent de proposer une r&#233;partition des r&#233;p&#233;titions en prenant en compte le nombre de 
r&#233;p&#233;t&#233;s (Figure 9). 
</p>
<p>55,22%
</p>
<p>5,35%
</p>
<p>0,69%
</p>
<p>0,16%
</p>
<p>0,01%
0,04%
</p>
<p>0,01%
</p>
<p>0,10%
</p>
<p>1,00%
</p>
<p>10,00%
</p>
<p>100,00%
</p>
<p>1 2 3 4 5 6
</p>
<p>Nombre de r&#233;p&#233;t&#233;s
</p>
<p>Lo
g 
</p>
<p>10
 (t
</p>
<p>au
x 
</p>
<p>de
 r&#233;
</p>
<p>p&#233;
tit
</p>
<p>io
n)
</p>
<p> 
</p>
<p>Figure 9 : R&#233;partition des r&#233;p&#233;titions en fonction du nombre de r&#233;p&#233;t&#233;s 
</p>
<p>On constate d&#8217;apr&#232;s ce graphique que les r&#233;p&#233;titions simples (r&#233;p&#233;t&#233; unique) et directes sont 
largement pr&#233;pond&#233;rantes et que la probabilit&#233; d&#8217;avoir une r&#233;p&#233;tition diminue pour un nombre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Sandrine Henry 
</p>
<p>de r&#233;p&#233;t&#233;s &#233;lev&#233;. On peut donc affirmer qu&#8217;il existe en d&#233;finitive tr&#232;s peu de r&#233;p&#233;titions 
incluant plus de deux r&#233;p&#233;t&#233;s. Ces r&#233;sultats acqui&#232;rent une totale validit&#233; dans le cadre de 
notre &#233;tude. Cinqui&#232;me point, si l&#8217;on s&#8217;int&#233;resse maintenant &#224; la r&#233;partition des r&#233;p&#233;titions 
associ&#233;es (Figure 10), l&#224; encore, une tendance particuli&#232;re se d&#233;gage : les r&#233;p&#233;titions contenant 
n&#8217;importe quel mot entre le r&#233;p&#233;table et le r&#233;p&#233;t&#233; sont plus fr&#233;quentes que celles incluant une 
pause silencieuse ou remplie. 
</p>
<p> RmR R + R R euh R
</p>
<p>% 28,35 6,56 3,61 
</p>
<p>Figure 10 : R&#233;partition des r&#233;p&#233;titions associ&#233;es 
</p>
<p>5 Perspectives 
</p>
<p>Dans le contexte technologique actuel, nous ne pouvons proc&#233;der qu&#8217;&#224; une d&#233;tection de 
surface des ph&#233;nom&#232;nes de r&#233;p&#233;tition de performance, dont on ne peut &#233;videmment pas se 
satisfaire. L&#8217;&#233;laboration d&#8217;outils informatiques, qui permettraient une d&#233;tection plus fine 
int&#233;grant une composante syntaxique, fait partie de notre plan de travail futur, ainsi que l'&#233;tude 
de l'interaction avec les autres param&#232;tres de la parole, pauses, pauses remplies, mouvements 
m&#233;lodiques, qui, dans certains cas, sont n&#233;cessaires &#224; la d&#233;termination du type de r&#233;p&#233;tition. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Blanche-Benveniste C. (1987), Syntaxe, choix du lexique et lieux de bafouillage. DRLAV, 36-
37, 123-157. 
</p>
<p>Blankenship J., Kay C. (1964), Hesitation phenomena in English speech : a study in 
distribution, Word, Vol. 20, pp.360-372. 
</p>
<p>Cand&#233;a M. (2000), Contribution &#224; l&#8217;&#233;tude des pauses silencieuses et des ph&#233;nom&#232;nes dits 
&#171; d&#8217;h&#233;sitation &#187; en fran&#231;ais oral spontan&#233;. Etude sur un corpus de r&#233;cits en classe de fran&#231;ais, 
Th&#232;se d&#8217;Etat, Universit&#233; Paris III (Sorbonne Nouvelle). 
</p>
<p>Henry S. (2001), Etude quantitative des r&#233;p&#233;titions marques du travail de formulation en 
fran&#231;ais oral spontan&#233;, D.E.A., Universit&#233; de Provence (Aix-Marseille 1). 
</p>
<p>Levelt W.J.M. (1983), Monitoring and self-repair in speech. Cognition, Vol. 14, pp.41-104. 
</p>
<p>Maclay H., Osgood C.E. (1959), Hesitation phenomena in spontaneous English speech, Word, 
Vol. 15, pp.19-44. 
</p>
<p>Morel M.-A., Danon-Boileau L. (1998), Grammaire de l&#8217;intonation : l&#8217;exemple du fran&#231;ais, 
Paris, Ophrys. 
</p>
<p>Shriberg E.E. (1994), Preliminaries to a Theory of Speech Disfluencies, Unpublished Ph.D. 
Thesis, Department of Psychology, University of California, Berkeley. 
</p>
<p>Valli A., V&#233;ronis J. (1999), Etiquetage grammatical de corpus oraux : probl&#232;mes et 
perspectives, Revue Fran&#231;aise de Linguistique Appliqu&#233;e, Vol. IV(2), pp. 113-133. </p>

</div></div>
</body></html>