<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un Mod&#232;le Distribu&#233; d&#8217;Interpr&#233;tation de Requ&#234;tes fond&#233; sur la notion d&#8217;Observateur</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2002, Nancy, 24&#8211;27 juin 2002
</p>
<p>Un Mod&#232;le Distribu&#233; d&#8217;Interpr&#233;tation de Requ&#234;tes fond&#233; sur
la notion d&#8217;Observateur
</p>
<p>Guillaume Pitel
LIMSI-CNRS F-91403 Orsay CEDEX
</p>
<p>pitel@limsi.fr
date de soutenance pr&#233;vue : fin 2003
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Nous proposons un mod&#232;le de conception d&#8217;agent conversationnel pour l&#8217;assistance d&#8217;interface.
Notre but est d&#8217;obtenir un syst&#232;me d&#8217;interpr&#233;tation de requ&#234;tes en contexte, g&#233;n&#233;rique pour l&#8217;in-
d&#233;pendance vis-&#224;-vis de la t&#226;che, extensible pour sa capacit&#233; &#224; int&#233;grer des connaissances sur
un nouveau domaine sans remettre en cause les connaissances ant&#233;rieures et unifi&#233; dans le sens
o&#249; tous les aspects du traitement de la langue naturelle, syntaxe, s&#233;mantique, ou pragmatique
doivent s&#8217;exprimer dans un m&#234;me formalisme. L&#8217;originalit&#233; de notre syst&#232;me est de permettre de
repr&#233;senter des connaissances d&#8217;interpr&#233;tation de niveaux de granularit&#233; divers sous une m&#234;me
forme, r&#233;duisant la probl&#233;matique de communication entre sources de connaissances qui existe
dans les syst&#232;mes modulaires. Nous adoptons l&#8217;approche des micro-syst&#232;mes suivant laquelle
l&#8217;interpr&#233;tation de la langue se fait selon un processus non stratifi&#233;, et o&#249; absolument tous les
niveaux peuvent interagir entre eux. Pour cela, nous introduisons et d&#233;finissons un type d&#8217;entit&#233;
que nous avons nomm&#233; observateur.
</p>
<p>This paper describes a conversationnal agent design model for interface assistance. The model
is meant to be generic, i.e. task independant extensible for the ability of integrating know-
ledge about a new task without revising previous knowledge, and unified because every level
of Natural Language, from syntax, semantics, pragmatics and dialogue to production should be
described within the same formalism. The main originality of the proposed system is its abi-
lity to represent in the same way various granularity levels of interpretation knowledge sources.
This avoids communication problems between heterogeneous knowledge sources, as they occur
in modular systems. Thus we adopt a micro-systemics approach, stating that the Natural Lan-
guage Interpretation, rather than being made of multi-layered processes, a process where all the
components levels can interact with each others. This is achieved by introducing the notion of
observer.
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Agents Conversationnels, Analyse Distribu&#233;e, Micro-Syst&#232;mes, S&#233;mantique Proc&#233;durale
Conversationnal Agents, Distributed Analysis, Micro-Systems, Procedural Semantics</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>1 Cadre et probl&#233;matique
</p>
<p>Le projet InterViews (Sansonnet, 1999) se donne pour objectif de concevoir un syst&#232;me de dia-
logue en langue naturelle pour supporter l&#8217;ex&#233;cution d&#8217;agents assistants d&#8217;interface. Nous nous
situons dans le cadre des applications interactives disponibles sur la toile. Le projet regroupe
des travaux sur le raisonnement sur le fonctionnement des composants (Sabouret &amp; Sansonnet,
2001), l&#8217;analyse de textes par motifs et proximit&#233; s&#233;mantique (G&#233;rard &amp; Sansonnet, 2000), et
sur un mod&#232;le d&#8217;interpr&#233;tation des questions sur la structure des composants. A long terme,
l&#8217;objectif de ce projet est de pouvoir proposer un environnement de conception d&#8217;interfaces en
langue naturelle, &#224; partir du syst&#232;me de dialogue propos&#233; et des diff&#233;rentes recherches cit&#233;es
pr&#233;c&#233;demment. Concernant la langue naturelle, nous devrons v&#233;rifier par l&#8217;exp&#233;rimentation les
probl&#233;matiques d&#8217;analyse et d&#8217;interpr&#233;tation qui seront ainsi support&#233;es. Notre travail en &#233;tant
au stade pr&#233;liminaire, nous n&#8217;avons cependant pas encore abord&#233; le cas pratique de l&#8217;utilisateur
final, primordial dans le domaine de l&#8217;interface homme-machine.
</p>
<p>1.1 Probl&#232;me de la g&#233;n&#233;ricit&#233; dans l&#8217;interaction en langue naturelle
</p>
<p>La ma&#238;trise de l&#8217;Interaction en Langue Naturelle (ILN) entre un utilisateur et une interface d&#8217;ap-
plication grand public a pour but de permettre &#224; une personne non initi&#233;e d&#8217;acc&#233;der rapidement
aux fonctionnalit&#233;s d&#8217;un logiciel. Il existe des r&#233;alisations permettant de commander certains
types d&#8217;applications (Goddeau et al., 1994; Allen et al., 1996; Bennacef et al., 1996; Lamel
et al., 1998) par la voie de la langue naturelle, mais il n&#8217;y a pas actuellement de mod&#232;le de des-
cription g&#233;n&#233;rique permettant de d&#233;finir pour n&#8217;importe quelle t&#226;che son interface en langue
naturelle. D&#8217;une part, les syst&#232;mes existants sont en grande partie con&#231;us de mani&#232;re ad hoc,
et d&#8217;autre part, on ne sait toujours pas dire pour une application donn&#233;e si on est capable de
produire son interface de langue naturelle. C&#8217;est pourquoi des chercheurs comme (Allen et al.,
2001a) ont pos&#233; clairement la probl&#233;matique de produire des outils g&#233;n&#233;riques pour l&#8217;ILN :
</p>
<p>(apr&#232;s avoir pos&#233; l&#8217;hypoth&#232;se de l&#8217;ind&#233;pendance vis-&#224;-vis du domaine dans le
cadre des dialogues pratiques) &#171; Si cette hypoth&#232;se est vraie, il est rentable de s&#8217;in-
vestir massivement dans la conception d&#8217;un syst&#232;me de dialogue g&#233;n&#233;rique, qui
sera alors assez facilement adaptable &#224; chaque nouvelle t&#226;che. &#187;1
</p>
<p>1.2 Vers un syst&#232;me d&#8217;ILN g&#233;n&#233;rique, extensible et unifi&#233;
</p>
<p>Les premi&#232;res tentatives pour produire des syst&#232;mes d&#8217;ILN ont suivi des approches monoli-
thiques, fortement d&#233;pendantes de la t&#226;che de dialogue sp&#233;cifique &#224; laquelle on les destinait.
Depuis, des mod&#232;les issus des syst&#232;mes multi-agents (Carvalho et al., 1998; Stefanini &amp; De-
mazeau, 1995), et s&#8217;appuyant sur la communication entre modules de traitement ind&#233;pendants
ont fait l&#8217;objet de recherches approfondies (Sabah, 1990; Boitet &amp; Seligman, 1994; Stefanini &amp;
Demazeau, 1995), et certains produisent d&#233;j&#224; des r&#233;sultats encourageants (Allen et al., 2001b).
L&#8217;adaptation de ces syst&#232;mes &#224; une nouvelle t&#226;che est plus ais&#233;e que dans les syst&#232;mes monoli-
thiques, puisque seuls quelques modules doivent &#234;tre modifi&#233;s. Cependant il reste pour l&#8217;instant
</p>
<p>1&#171; If this hypothesis is true, it is worthwhile to spend a considerable effort building a generic dialogue system
that can then be adapted to each new task relatively easily &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un Mod&#232;le d&#8217;Interpr&#233;tation de Requ&#234;tes G. Pitel
</p>
<p>impossible de concevoir un syst&#232;me de dialogue permettant de d&#233;crire simplement n&#8217;importe
quelle t&#226;che.
</p>
<p>Ces limitations nous ont conduit &#224; proposer trois axes majeurs autour desquels les syst&#232;mes de
dialogue modernes devraient &#234;tre con&#231;us : la g&#233;n&#233;ricit&#233;, l&#8217;extensibilit&#233;, et l&#8217;unit&#233; de la descrip-
tion. La g&#233;n&#233;ricit&#233; pour l&#8217;ind&#233;pendance vis-&#224;-vis de la t&#226;che, l&#8217;extensibilit&#233; pour sa capacit&#233; &#224;
int&#233;grer des connaissances sur un nouveau domaine sans remettre en cause les connaissances
ant&#233;rieures, et l&#8217;unit&#233; dans le sens o&#249; tous les aspects du traitement de la langue naturelle,
syntaxe, s&#233;mantique, pragmatique, dialogue ou r&#233;ponse par production linguistique ou action,
doivent s&#8217;exprimer dans un m&#234;me formalisme, et donc tous communiquer entre eux de la m&#234;me
mani&#232;re, ce qui facilite l&#8217;ajout de nouvelles sources de connaissances.
Notre vision d&#8217;un syst&#232;me d&#8217;ILN adopte une approche fortement distribu&#233;e et &#224; granularit&#233; va-
riable de l&#8217;interpr&#233;tation. Notre syst&#232;me de dialogue poss&#232;de trois caract&#233;ristiques principales :
</p>
<p>Environnement L&#8217;interpr&#233;tation est id&#233;alement appliqu&#233;e &#224; tout l&#8217;environnement, c&#8217;est-&#224;-dire
que l&#8217;analyse ne porte pas seulement sur la phrase que vient de prononcer l&#8217;utilisateur,
mais sur l&#8217;ensemble du dialogue pass&#233; ainsi que les informations concernant l&#8217;application
ou les applications auxquelles le syst&#232;me sert d&#8217;interface.
</p>
<p>M&#233;diateur Le syst&#232;me d&#8217;ILN suit l&#8217;approche m&#233;diateur, qui implique que l&#8217;analyse doit non
pas amener &#224; un formalisme de repr&#233;sentation centralis&#233; (langage pivot) pour &#234;tre ensuite
interpr&#233;t&#233; de mani&#232;re ad hoc, mais aller de l&#8217;observation &#224; l&#8217;action gr&#226;ce a un syst&#232;me
unifi&#233;.
</p>
<p>Observateurs L&#8217;interpr&#233;tation est repr&#233;sent&#233;e par des observateurs, entit&#233;s rempla&#231;ant les r&#232;gles
de r&#233;&#233;criture d&#8217;un syst&#232;me d&#8217;analyse classique. Ils sont capables de donner un point de
vue sur l&#8217;environnement (ou la partie de l&#8217;environnement) qu&#8217;ils observent, ce point de
vue pouvant se traduire par une action.
</p>
<p>2 Orientations th&#233;oriques
</p>
<p>2.1 Th&#233;orie des Affordances
</p>
<p>La th&#233;orie des affordances (de to afford : fournir en anglais) de l&#8217;environnement sur les individus
telle qu&#8217;elle est d&#233;finie par (Gibson, 1977; Gibson, 1979), propose que la perception ne consiste
pas &#224; capter les dimensions et les propri&#233;t&#233;s absolues des objets de l&#8217;environnement, mais &#224; cap-
ter les caract&#233;ristiques que ces objets fournissent, exposent aux observateurs. (Norman, 1988;
Norman, 1990) en fait l&#8217;interpr&#233;tation suivante : &#171; la r&#233;f&#233;rence aux objets et concepts se fait tels
qu&#8217;ils sont vus (per&#231;us, cat&#233;goris&#233;s) par l&#8217;observateur &#187;, c&#8217;est-&#224;-dire en fonction du ph&#233;nom&#232;ne
de ces objets et concepts, et non pas en fonction de leurs caract&#233;ristiques impl&#233;mentatoires.
Nous appellons ph&#233;nom&#232;ne d&#8217;un objet son expression &#224; travers le point de vue d&#8217;un observa-
teur donn&#233;, ce qu&#8217;il donne &#224; voir de lui &#224; celui-ci. En cela, le ph&#233;nom&#232;ne n&#8217;a pas de r&#233;alit&#233; en
l&#8217;absence d&#8217;un observateur, et pour chaque observateur, il existe un ph&#233;nom&#232;ne diff&#233;rent.
</p>
<p>A partir de cette th&#233;orie, nous avons choisi de concevoir notre syst&#232;me de dialogue comme un
m&#233;diateur, c&#8217;est-&#224;-dire un syst&#232;me capable de faire le lien entre deux visions diff&#233;rentes du
monde : celle de l&#8217;utilisateur et celle de l&#8217;application. Notre syst&#232;me sera articul&#233; autour de
l&#8217;id&#233;e sous-jacente de changement de point de vue, afin d&#8217;amener le point de vue de l&#8217;utilisa-
teur vers le point de vue de l&#8217;application par traitements successifs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>2.2 S&#233;mantique Proc&#233;durale
</p>
<p>La th&#233;orie de la s&#233;mantique proc&#233;durale introduite par (Wittgenstein, 1953) et reformul&#233;e par
(Johnson-Laird, 1977; Woods, 1981) pour les applications informatiques, a pos&#233; les bases d&#8217;une
vision fonctionnelle de la signification. En effet, ses initiateurs proposent de consid&#233;rer le sens
d&#8217;un symbole (puis par extension, de toute observation) comme sa r&#233;alisation ou encore son
application dans le monde r&#233;el par l&#8217;action de l&#8217;observateur. La s&#233;mantique n&#8217;a donc pas d&#8217;exis-
tence autre que celle de son expression dans un environnement, ce qui implique qu&#8217;il ne peut
&#234;tre remplac&#233; que par un processus r&#233;alisant son interpr&#233;tation. (Woods, 1981) exprime cette
id&#233;e de la fa&#231;on suivante :
</p>
<p>&#171; [. . .] la signification d&#8217;un symbole r&#233;side dans une proc&#233;dure abstraite, pas
n&#233;cessairement ex&#233;cutable, qui fait le lien entre l&#8217;expression symbolique et le monde
r&#233;el par l&#8217;interm&#233;diaire des op&#233;rations (de calcul, d&#8217;inf&#233;rence) d&#8217;un interpr&#232;te
physique agissant &#224; la fois sur des repr&#233;sentations internes et sur ses connexions
sensori-motrices avec le monde. &#187;2
</p>
<p>L&#8217;un des travaux appliquant cette th&#233;orie est le classique SHRDLU de (Winograd, 1973). La
difficult&#233; d&#8217;&#233;tendre son application hors du micro-monde o&#249; elle &#233;tait cantonn&#233;e a bloqu&#233; le
d&#233;veloppement de son id&#233;e pourtant tr&#232;s prometteuse. C&#8217;est donc tr&#232;s probablement dans cette
extension qu&#8217;il faut travailler pour proposer des syst&#232;mes de dialogue ayant des caract&#233;ristiques
de g&#233;n&#233;ricit&#233; am&#233;lior&#233;es.
</p>
<p>2.3 Analyse guid&#233;e
</p>
<p>Le Word Expert Parsing (Small, 1980; Adriaens &amp; Devos, 1994) est une th&#233;orie de la com-
pr&#233;hension du langage naturel, fond&#233;e sur l&#8217;hypoth&#232;se que les objets du langage (les mots et
leur morphologie) sont individuellement autant porteurs d&#8217;information sur leur propre analyse
que d&#8217;information s&#233;mantique. Un syst&#232;me de compr&#233;hension du langage naturel devrait donc,
selon cette id&#233;e, diriger son analyse en fonction de la connaissance (pragmatique, s&#233;mantique,
lexicale, morphologique) apport&#233;e par chaque mot.
Cette repr&#233;sentation d&#233;centralis&#233;e du processus d&#8217;analyse conduit le syst&#232;me &#224; se reposer sur
les actes de communication entre experts pour l&#8217;&#233;change d&#8217;informations et les choix &#224; faire
concernant la signification globale vers laquelle le syst&#232;me doit se diriger. Pour contr&#244;ler cette
population d&#8217;experts, chacun d&#8217;entre eux doit &#234;tre d&#233;crit de mani&#232;re &#224; se mettre en pause lors-
qu&#8217;il a besoin d&#8217;information provenant d&#8217;un autre expert, et &#224; reprendre son activit&#233; lorsque
cette information arrive.
</p>
<p>2&#171; [. . .] the meaning of a symbol resides in an abstract procedure, not necessarily executable, linking the sym-
bolic expression to the physical world through the (computational / inferential) operations of a physical interpreter
operating on a combination of internal representations and sensory/motor connections to the world. &#187;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un Mod&#232;le d&#8217;Interpr&#233;tation de Requ&#234;tes G. Pitel
</p>
<p>3 Proposition d&#8217;un mod&#232;le d&#8217;ILN
</p>
<p>3.1 Notion de granularit&#233;
</p>
<p>Dans l&#8217;ILN, le probl&#232;me de la granularit&#233; de l&#8217;interpr&#233;tation se pose &#224; deux niveaux :
</p>
<p>&#8211; au niveau abstrait, la granularit&#233; de l&#8217;objet de l&#8217;interpr&#233;tation. Ce sur quoi porte l&#8217;inter-
pr&#233;tation (le mot, la phrase, le dialogue, ou la morphologie, la syntaxe, la s&#233;mantique, la
pragmatique, etc.).
</p>
<p>&#8211; au niveau concret, la granularit&#233; de l&#8217;objet d&#8217;interpr&#233;tation. Ce avec quoi on conduit celle-ci
(la forme prise par le logiciel d&#8217;analyse).
</p>
<p>Dans les syst&#232;mes de dialogue comme (Sabah, 1990; Allen et al., 2001b), l&#8217;interpr&#233;tation porte
sur la syntaxe, la s&#233;mantique, la pragmatique, la planification de t&#226;che et d&#8217;autres niveaux, et
chaque niveau est impl&#233;ment&#233; par un module. L&#8217;objet de l&#8217;interpr&#233;tation et l&#8217;objet d&#8217;interpr&#233;ta-
tion ont donc la m&#234;me granularit&#233; moyenne3.
</p>
<p>Dans les syst&#232;mes comme (Small, 1980), l&#8217;interpr&#233;tation est conduite &#224; partir de et par les mots,
l&#8217;objet de l&#8217;interpr&#233;tation a donc une granularit&#233; tr&#232;s grosse (restreinte au mot). En revanche,
comme chaque mot doit &#234;tre interpr&#233;t&#233;, la granularit&#233; de l&#8217;objet d&#8217;interpr&#233;tation est fine.
Notre objectif en proposant ce mod&#232;le est d&#8217;offrir dans les deux cas une granularit&#233; variable &#224;
champ large (couvrant un maximum de niveaux), r&#233;pondant aux besoins de l&#8217;interpr&#233;tation des
diff&#233;rents niveaux de la langue, y compris en autorisant des interpr&#233;tations n&#233;cessitant la prise
en compte simultan&#233;e de plusieurs niveaux.
</p>
<p>3.2 Notation de l&#8217;environnement
</p>
<p>L&#8217;application et le dialogue avec l&#8217;utilisateur sont d&#233;crits en texte et annot&#233;s avec des balises
dans un formalisme proche de XML, mais se diff&#233;renciant de ce dernier par plusieurs aspects.
En effet, il nous faut, gr&#226;ce &#224; ces balises, marquer des zones &#233;ventuellement discontinues, en
leur donnant un contenu et une identification unique. Pour cela, nous avons choisi le formalisme
de balisage suivant :
</p>
<p>&lt;T id = &#8217;%IDUN%&#8217; attribut1 = &#8217;valeur1&#8217; ... attributN = &#8217;valeurN&#8217;&gt;...&lt;/T id =
&#8217;%IDUN%&#8217;&gt;...&lt;T id = &#8217;%IDUN%&#8217;&gt;...&lt;/T id = &#8217;%IDUN%&#8217;&gt;
</p>
<p>O&#249; T est le type utilis&#233; pour la reconnaissance, %IDUN% est une clef unique dans l&#8217;environ-
nement permettant d&#8217;identifier la zone, attribut et valeur sont des informations utilisables par
les observateurs, qui correspondent au type T donn&#233; dans la balise. Les portions de l&#8217;environne-
ment d&#233;limit&#233;es par une balise de type &lt;T id=&#8217;xxx&#8217; v1=&#8217;...&#8217; v2=&#8217;...&#8217;&gt;...&lt;/T id=&#8217;xxx&#8217;&gt; sont ainsi
marqu&#233;es comme pouvant &#234;tre interpr&#233;t&#233;es comme des entit&#233;s T avec les attributs v1 et v2 ayant
leurs valeurs donn&#233;es. On aura donc par exemple (incomplet) :
</p>
<p>&lt;effacer id=&#8217;1&#8217;&gt;Efface-moi&lt;/effacer id=&#8217;1&#8217;&gt; &lt;liste-mels id=&#8217;4&#8217; contenu=&#8217;mel1,
mel23, ..., mel54&#8217;&gt;&lt;liste-mels id=&#8217;2&#8217; contenu=&#8217;mel1, mel2, ..., melN&#8217;&gt;tous les
m&#233;ls&lt;/liste-mels id=&#8217;2&#8217;&gt; &lt;date-restr id=&#8217;3&#8217; condition = &#8217;annees( aujourdhui() -
date(*) ) &gt; 4&#8217;&gt;de plus de quatre ans&lt;/date-restr id=&#8217;3&#8217;&gt;&lt;/liste-mels id=&#8217;4&#8217;&gt;
</p>
<p>3Entre 10 et 50 modules environ, chacun travaillant sur un niveau de la langue naturelle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>De plus, nous cherchons &#224; v&#233;rifier la coh&#233;rence entre deux balises, c&#8217;est-&#224;-dire le fait que les
deux interpr&#233;tations donn&#233;es par deux balises ne soit pas contradictoires. En effet, si un obser-
vateur reconnait une certaine combinaison de balises, et que celles-ci sont pr&#233;sentes dans l&#8217;envi-
ronnement, mais en provenance d&#8217;observations contradictoires (se recouvrant l&#8217;une l&#8217;autre, par
exemple), il ne faut pas que son point de vue soit pris en compte. Afin de savoir si une balise est
coh&#233;rente avec une autre, chaque balise cr&#233;&#233;e devra ainsi conserver les identifiants des balises
qu&#8217;elle a reconnu faire partie du motif de sa r&#232;gle d&#8217;activation.
</p>
<p>3.3 Repr&#233;sentation du processus d&#8217;interpr&#233;tation
</p>
<p>La th&#233;orie de la s&#233;mantique proc&#233;durale implique que, quelque soit le niveau de granularit&#233;
de l&#8217;observation auquel on se place (le mot, la phrase ou un &#233;change verbal complet) l&#8217;entit&#233;
observ&#233;e peut &#234;tre consid&#233;r&#233;e comme le d&#233;clencheur d&#8217;une fonction dont le r&#233;sultat va &#234;tre
la r&#233;action de l&#8217;observateur. Or si nous partons du postulat que cette th&#233;orie est applicable &#224;
tous les niveaux, cela signifie que la fonction totale est le produit de l&#8217;interaction de fonctions
d&#8217;observation &#224; des niveaux inf&#233;rieurs.
</p>
<p>Selon la th&#233;orie de la s&#233;mantique proc&#233;durale, quelque soit le niveau de granularit&#233; de l&#8217;objet
de l&#8217;interpr&#233;tation auquel on se situe, il existe une proc&#233;dure interpr&#233;tant la signification des
symboles observ&#233;s. Nous choisissons pour cette raison de repr&#233;senter le processus d&#8217;interpr&#233;ta-
tion avec de nombreux processus sp&#233;cifiques plut&#244;t qu&#8217;avec quelques modules g&#233;n&#233;riques, ceci
afin d&#8217;obtenir justement la g&#233;n&#233;ricit&#233; de l&#8217;interpr&#233;tation.
</p>
<p>3.4 Mise en &#339;uvre
</p>
<p>3.4.1 Observateurs
</p>
<p>Conceptuellement, un observateur exprime un point de vue sur ce qu&#8217;il &#171; voit &#187;. Son champ
d&#8217;observation est principalement tourn&#233; autour du langage, mais il inclut aussi les perceptions
auxquelles il a acc&#232;s, c&#8217;est-&#224;-dire la repr&#233;sentation de l&#8217;application et l&#8217;historique du dialogue.
Un observateur va donc &#171; voir &#187; certaines balises &#224; certaines positions les unes par rapport
aux autres, et &#233;crire une interpr&#233;tation de cette vision &#224; partir de sa connaissance propre (sa
proc&#233;dure de r&#233;&#233;criture).
Formellement, un observateur est compos&#233; de trois &#233;l&#233;ments : une r&#232;gle d&#8217;activation &#0;, un
mode d&#8217;activation &#1; , et un proc&#233;dure de r&#233;&#233;criture &#2;
</p>
<p>&#0;
</p>
<p>o&#249; &#3; est le type de la balise produite par
la proc&#233;dure.
</p>
<p>&#8211; La r&#232;gle d&#8217;activation est impl&#233;ment&#233;e par une fonction d&#8217;appariement appliqu&#233;e sur l&#8217;en-
vironnement. Elle va d&#233;terminer s&#8217;il existe des &#233;l&#233;ments dans l&#8217;environnement susceptibles
d&#8217;&#234;tre interpr&#233;t&#233;s par la proc&#233;dure de r&#233;&#233;criture &#2;
</p>
<p>&#0;
</p>
<p>.
</p>
<p>&#8211; Le mode d&#8217;activation &#1; permet de d&#233;terminer le comportement de l&#8217;observateur pour le
m&#233;canisme de pr&#233;diction expliqu&#233; plus loin. Le concepteur de l&#8217;observateur fait le choix du
mode d&#8217;activation (par d&#233;faut, on consid&#232;re qu&#8217;un observateur est r&#233;actif et proactif &#224; la fois) :
r&#233;actif s&#8217;il r&#233;agit &#224; la pr&#233;sence de certaines balises dans l&#8217;environnement.
proactif s&#8217;il r&#233;agit au fait que d&#8217;autres observateurs attendent la balise qu&#8217;il sait produire.
</p>
<p>&#8211; La proc&#233;dure de r&#233;&#233;criture &#2;
&#0;
</p>
<p>peut avoir trois actions diff&#233;rentes, au choix du concepteur :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un Mod&#232;le d&#8217;Interpr&#233;tation de Requ&#234;tes G. Pitel
</p>
<p>&#8211; si l&#8217;observateur produit seulement une information pour d&#8217;autres observateurs, &#2;
&#0;
</p>
<p>modifie
l&#8217;environnement en rajoutant des balises &#3;, par exemple (&lt;adjectif &gt;&lt;nom&gt;bleu&lt;/adjectif &gt;-
&lt;/nom&gt; deviendra &lt;couleur rvb=#0000FF&gt;&lt;adjectif &gt;&lt;nom&gt;bleu&lt;/adjectif &gt;&lt;/couleur&gt;-
&lt;/nom&gt;)
</p>
<p>&#8211; si l&#8217;observateur doit agir sur l&#8217;environnement, &#2;
&#0;
</p>
<p>effectue une op&#233;ration sur l&#8217;application,
en appelant une fonction, ou en modifiant des donn&#233;es
</p>
<p>&#8211; si l&#8217;observateur doit agir sur l&#8217;utilisateur, &#2;
&#0;
</p>
<p>produit un message pour celui-ci.
</p>
<p>3.4.2 M&#233;canisme de pr&#233;diction
</p>
<p>Pour diminuer la complexit&#233; du traitement, mais aussi pour assurer la convergence de notre
syst&#232;me, la th&#233;orie du Word Expert Parsing, et plus g&#233;n&#233;ralement les travaux sur les m&#233;thodes
d&#8217;analyse guid&#233;es par pr&#233;diction nous ont conduit &#224; int&#233;grer dans notre processus d&#8217;interpr&#233;ta-
tion le fait qu&#8217;un observateur va avoir besoin pour &#234;tre d&#233;clench&#233; de la pr&#233;sence de certaines
balises dans l&#8217;environnement sur lequel il est appliqu&#233;. Par exemple, consid&#233;rons un observa-
teur qui reconnait ce motif :
</p>
<p>&lt;ordre&gt;&lt;transferer&gt;...&lt;/transferer&gt;&lt;designation_message&gt;...
&lt;/designation_message&gt;&lt;designation_destinataire&gt;...&lt;/designation_destinataire&gt;
&lt;/ordre&gt;
</p>
<p>Cet observateur aura besoin des balises ordre, transferer, designation_message, designation_desti-
nataire. Si les balises ordre et transferer ont d&#233;j&#224; &#233;t&#233; produites par l&#8217;ex&#233;cution de proc&#233;dures
d&#8217;autres observateurs, il y a une chance importante que la suite de la phrase corresponde au
motif reconnu par cet observateur.
</p>
<p>Le fait qu&#8217;un observateur ait presque tous les objets dont il a besoin va ainsi &#234;tre interpr&#233;t&#233;
comme le fait qu&#8217;il attend certains objets encore absents. Le d&#233;clenchement de l&#8217;action d&#8217;un
observateur va donc &#234;tre dirig&#233;e aussi bien par la pr&#233;sence ou non de certaines balises dans
l&#8217;environnement que par le fait que la balise qu&#8217;il produit soit attendue ou non par d&#8217;autres
observateurs.
</p>
<p>Nous mettons ce m&#233;canisme en &#339;uvre en calculant le graphe de connexion implicite4 de la
population d&#8217;observateurs (cf. fig 1).
</p>
<p>3.4.3 Algorithme d&#8217;interpr&#233;tation
</p>
<p>L&#8217;algorithme d&#8217;interpr&#233;tation de l&#8217;environnement est une boucle qui s&#8217;ex&#233;cute sans fin, et &#224;
chaque tour, on suit le cheminement suivant :
</p>
<p>4La r&#232;gle d&#8217;activation des observateurs est une fonction d&#8217;appariement portant sur les balises dont les types
sont ceux des proc&#233;dures de r&#233;&#233;criture. Nous consid&#233;rons que le type de balise produit par un observateur est
connu &#224; l&#8217;avance par le m&#233;canisme d&#8217;interpr&#233;tation. De fait, il se forme donc un graphe statique de propagation
de l&#8217;analyse dans la population des observateurs, les noeuds du graphe &#233;tant les observateurs, les entr&#233;es du noeud
sont les concepts attendus dans la r&#232;gle d&#8217;activation, la sortie est le type de la proc&#233;dure de r&#233;&#233;criture.
</p>
<p>L&#8217;existence de ce graphe va nous permettre de guider l&#8217;analyse par une recherche acc&#233;l&#233;r&#233;e des chemins pos-
sibles pour la satisfaction des pr&#233;dictions. Il permettra non seulement de r&#233;duire le nombre de r&#232;gles essay&#233;es pour
trouver les observateurs &#224; d&#233;clencher, mais aussi de trouver les chemins les plus probables pour arriver &#224; obtenir
un certain type de balise dans une certaine zone.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>...
</p>
<p>...&lt;de&gt;&lt;liste&#8722;envoyeurs&gt;...&lt;/liste&#8722;
envoyeurs&gt;)
M = (proactif)
Pliste&#8722;mels = (mels=select * from mels etc.)
</p>
<p>&lt;transmettre&#8722;message&gt;&lt;ordre&gt;
transmet ce message &#224; Jean&#8722;Paul
&lt;/ordre&gt;&lt;/transmettre&#8722;message&gt;
....
</p>
<p>....
</p>
<p>&lt;phrase&gt;Est&#8722;ce que j&#8217;ai re&#231;u des
m&#233;ls de mes amis r&#233;cemment ?
&lt;/phrase&gt;
</p>
<p>&lt;liste&#8722;dest nom=&quot;amis&quot;&gt;&lt;ami&gt;
&lt;nom&gt;hermier&lt;/nom&gt;&lt;pr&#233;nom&gt;.....
</p>
<p>&quot;LIMSI&quot;&gt;...&lt;/mel&#8722;grp&gt;&lt;mel&#8722;grp
nom=&quot;copains&quot;&gt;&lt;mel&gt;&lt;auteur nom=
&quot;\nico&quot;&gt;&lt;sujet&gt;Je suis l&#224;&lt;/sujet&gt;
&lt;contenu&gt;...&lt;/contenu&gt;
</p>
<p>....&lt;/liste&#8722;dest&gt;&lt;mels&gt;&lt;mel&#8722;grp nom=
</p>
<p>....
</p>
<p>&lt;dialogue&gt;
</p>
<p>&lt;/dialogue&gt;
&lt;/application&gt;
</p>
<p>&lt;application&gt;
</p>
<p>ENVIRONNEMENT
</p>
<p>OBSERVATEURS
</p>
<p>&#8722;sage&gt;....&lt;message&gt;M...&lt;destina&#8722;
&#8722;taire&gt;D&lt;/destinataire&gt;&lt;/ordre&gt;)
M=(r&#233;actif)
Paction = (forward_mail(M,D))}
</p>
<p>Graphe implicite
de connexions
</p>
<p>Utilisateur
</p>
<p>Requ&#234;te
</p>
<p>R&#233;ponse
</p>
<p>O1:={R=(&lt;ordre&gt;&lt;transmettre&#8722;mes&#8722;
</p>
<p>...
</p>
<p>O8:={R = (&lt;mel num=pluriel&gt;...&lt;/mel&gt;&lt;de&gt;
</p>
<p>FIG. 1 &#8211; Fonctionnement g&#233;n&#233;ral du syst&#232;me d&#8217;analyse d&#8217;InterViews. Exemple de traitement
sur des objets de haut niveau, ici des listes de m&#233;ls.
</p>
<p>1. l&#8217;algorithme &#233;tudie les concepts nouvellement entr&#233;s dans l&#8217;environnement d&#8217;observation,
&#8211; soit par l&#8217;action des observateurs,
&#8211; soit par l&#8217;action de l&#8217;utilisateur (lorsqu&#8217;il produit une phrase),
&#8211; soit par l&#8217;action de l&#8217;application.
</p>
<p>2. En priorit&#233;, on tente de satisfaire les demandes des observateurs en attente de balises,
gr&#226;ce &#224; un algorithme de planification, permettant de trouver les chemins possibles dans
le graphe de connexion des observateurs. Cette premi&#232;re &#233;tape permet de classer les obser-
vateurs &#224; activer plus tard, et surtout &#224; autoriser l&#8217;activation des observateurs uniquement
proactifs.
</p>
<p>3. Ensuite, &#224; partir des balises nouvellement arriv&#233;es, on va chercher dans le graphe de
connexion des observateurs r&#233;actifs et des observateurs proactifs rendus activables &#224;
l&#8217;&#233;tape 2, ceux qui ont une de ces balises dans leur r&#232;gle d&#8217;activation.
</p>
<p>4. En ex&#233;cutant la r&#232;gle d&#8217;activation, on v&#233;rifie si les observateurs ainsi recens&#233;s deviennent
ou non activables.
</p>
<p>5. Si leur r&#232;gle d&#8217;activation n&#8217;est que partiellement reconnue, alors l&#8217;algorithme met en m&#233;-
moire les balises qui manquent pour v&#233;rifier la r&#232;gle, et elles sont recherch&#233;es en priorit&#233;
&#224; la prochaine it&#233;ration.
</p>
<p>6. Si la r&#232;gle est totalement v&#233;rifi&#233;e, la proc&#233;dure de r&#233;&#233;criture est d&#233;clench&#233;e, provoquant
&#233;ventuellement l&#8217;arriv&#233;e de nouvelles balises dans l&#8217;environnement.
</p>
<p>L&#8217;algorithme converge vers des interpr&#233;tations locales, mais ne termine jamais, des interpr&#233;ta-
tions faites par les observateurs pouvant toujours &#234;tre utilis&#233;es par la suite.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un Mod&#232;le d&#8217;Interpr&#233;tation de Requ&#234;tes G. Pitel
</p>
<p>4 Conclusion
</p>
<p>Afin de permettre une plus grande g&#233;n&#233;ricit&#233; dans la conception des syst&#232;mes d&#8217;ILN, comme
propos&#233; par (Allen et al., 2001a), nous avons construit un mod&#232;le d&#8217;interpr&#233;tation &#224; partir des
th&#233;ories cognitives des Affordances et de la s&#233;mantique proc&#233;durale. Ce mod&#232;le, mis en &#339;uvre
par la construction d&#8217;un grand nombre d&#8217;entit&#233;s que nous appelons observateurs, permet selon
nous de prendre en compte de larges aspects de la langue naturelle, gr&#226;ce &#224; sa conception qui lui
permet d&#8217;avoir une granularit&#233; variable. Nous pouvons dans le m&#234;me formalisme exprimer des
r&#232;gles syntaxiques que des r&#232;gles du discours. Plusieurs raisons nous font penser que ce mod&#232;le
est capable d&#8217;atteindre les trois objectifs que nous nous &#233;tions fix&#233;s :
&#8211; G&#233;n&#233;ricit&#233;, car sa granularit&#233; variable fait que plusieurs niveaux de la langue peuvent &#234;tre
</p>
<p>trait&#233;s en m&#234;me temps, et que de plus sa d&#233;finition ne restreint pas son utilisation au langage,
puisque tout ph&#233;nom&#232;ne observable peut &#233;ventuellement &#234;tre pris en compte ;
</p>
<p>&#8211; Extensibilit&#233;, car sa conception fortement modulaire permet de rajouter des observateurs pour
traiter tout nouveau cas particulier. Des h&#233;t&#233;rog&#233;n&#233;it&#233;s peuvent toutefois appara&#238;tre lorsque
des observateurs de haut niveau d&#8217;abstraction devront &#234;tre modifi&#233;s ;
</p>
<p>&#8211; Unit&#233;, car tous les observateurs sont d&#233;crits dans un m&#234;me formalisme, supprimant le pro-
bl&#232;me de la communication entre modules qui appara&#238;t avec les syst&#232;mes h&#233;t&#233;rog&#232;nes.
</p>
<p>L&#8217;impl&#233;mentation de ce mod&#232;le en Objective-Caml et Mathematica est en cours, et sera int&#233;gr&#233;e
&#224; InterViews. Cela nous permettra de valider son potentiel, de l&#8217;am&#233;liorer, ou de le rejetter le
cas &#233;ch&#233;ant. De nombreux travaux vont d&#233;couler de sa mise en pratique effective, car si cette
approche s&#8217;av&#232;re valide, il restera &#224; exprimer dans ce formalisme un grand nombre d&#8217;aspects de
l&#8217;ILN.
</p>
<p>R&#233;f&#233;rences
ADRIAENS G. &amp; DEVOS M. (1994). The Parallel Expert Parser. In G. ADRIAENS &amp; U. HAHN, Eds.,
Natural Language Processing, p. 350&#8211;375. Norwood, New Jersey : Ablex Publishing Corporation.
ALLEN J., BYRON D., DZIKOVSKA M., FERGUSON G., GALESCU L. &amp; STENT A. (2001a). Towards
conversational human-computer interaction. AI Magazine.
ALLEN J., FERGUSON G. &amp; STENT A. (2001b). An architecture for more realistic conversational
systems. In Proceedings of Intelligent User Interfaces 2001 (IUI-01), p. 1&#8211;8, Santa Fe, NM.
ALLEN J., MILLER B., RINGGER E. &amp; SIKORSKI T. (1996). A Robust System for Natural Spoken
Dialogue. In Proc. 34th Meeting of the Assoc. for Computational Linguistics.
BENNACEF S. K., DEVILLERS L., ROSSET S. &amp; LAMEL L. (1996). Dialog in the RAILTEL
Telephone-Based System. In Proceedings of the International Conference on Speech and Language
Processing, p. 550&#8211;553, Philadelphia.
BOITET C. &amp; SELIGMAN M. (1994). The &#8220;whiteboard&#8221; Architecture : A Way to Integrate Heteroge-
neous Components of NLP Systems. In Proceedings of COLING&#8217;94, volume 1.
CARVALHO A., D.S. P., SICHMAN J., SILVA J., WAZLAWICK R. &amp; STRUBE DE LIMA V. (1998).
Multi-Agent Systems for Natural Language Processing. In Proceedings of the Second Iberoamerican
Workshop on Distributed Artificial Intelligence and Multi-agent Systems, Toledo, Spain.
GIBSON J. J. (1977). The theory of affordances. In R. SHAW &amp; J. BRANSFORD, Eds., Perceiving,
Acting and Knowing, p. 67&#8211;82. New York : Wiley.
GIBSON J. J. (1979). The Ecological Approach to Visual Perception. Boston : Houghton Mifflin.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GODDEAU D., BRILL E., GLASS J., PAO C., PHILLIPS M., POLIFRONI J., SENEFF S. &amp; ZUE V.
(1994). GALAXY : A Human-Language Interface to On-Line Travel Information. In Proceedings
of the International Conference on Spoken Language Processing, p. 707&#8211;710, Yokohama, Japan : The
Acoustical Society of Japan.
G&#201;RARD S. &amp; SANSONNET J.-P. (2000). A Spatio-Temporal Model for the Representation of Situa-
tions Described in Narrative Texts. In Proc. NLP2000, Patras.
JOHNSON-LAIRD P. (1977). Procedural Semantics. Cognition, (5), 189&#8211;214.
LAMEL L., ROSSET S., GAUVIN J., BENNACEF S. &amp; PROUTS G. (1998). The LIMSI ARISE sys-
tem. In Proceedings of IEEE 4th Workshop on Interactive Voice Technology for Telecommunications
Applications, p. 209&#8211;214, Torino, Italy.
NORMAN D. A. (1988). The psychology of everyday things. New York : Basic Books.
NORMAN D. A. (1990). The design of everyday things. New York : Doubleday.
SABAH G. (1990). CARAMEL : A Computational Model of Natural Language Understanding Using a
Parallel Implementation. In Proceedings of the Ninth ECAI, p. 563&#8211;565, Stockholm.
SABOURET N. &amp; SANSONNET J.-P. (2001). Automated Answers to Questions about a Running Process.
In Proc. CommonSense 2001, p. 217&#8211;227.
SANSONNET J.-P. (1999). Pr&#233;sentation de VDL 0.1. Rapport interne 99-10, LIMSI-CNRS.
SMALL S. (1980). Word Expert Parsing : a Theory of Distributed Word-based Natural Language Un-
derstanding. PhD thesis, University of Maryland.
STEFANINI M.-H. &amp; DEMAZEAU Y. (1995). TALISMAN : A Multi-Agent System for Natural Lan-
guage Processing. In J. WAINER &amp; A. CARVALHO, Eds., Lecture Notes in Artificial Intelligence 991,
Springer-Verlag.
WINOGRAD T. (1973). A procedural model of language understanding. In R. SCHANK &amp; K. COLBY,
Eds., Computer Models of Thought and Language, p. 152&#8211;186. W. H. Freeman.
WITTGENSTEIN L. (1953). The Philosophical Investigations. New York : Macmillan.
WOODS W. (1981). Procedural Semantics as a theory of meaning. In A. JOSHI, B. WEBBER &amp; I. SAG,
Eds., Elements of Discourse Understanding. Cambridge, MA : MIT Press.</p>

</div></div>
</body></html>