<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mod&#232;le d&#8217;exploration contextuelle pour l&#8217;analyse s&#233;mantique de textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2001, Tours, 2-5 juillet 2001
</p>
<p>Mod&#232;le d&#8217;exploration contextuelle
pour l&#8217;analyse s&#233;mantique de textes
</p>
<p>Slim Ben Hazez, Jean-Pierre Descl&#233;s, Jean-Luc Minel
</p>
<p>CAMS-LaLIC, UMR 8557 du CNRS, EHESS, Universit&#233; de Paris-Sorbonne
96 boulevard Raspail
75 006 Paris &#8211; France
</p>
<p>{Slim.Ben-Hazez}@paris4.sorbonne.fr
</p>
<p>R&#233;sum&#233; &#8211; Abstract
Nous pr&#233;sentons dans cet article un mod&#232;le d&#8217;exploration contextuelle et une plate-forme
logicielle qui permet d&#8217;acc&#233;der au contenu s&#233;mantique des textes et d&#8217;en extraire des
s&#233;quences particuli&#232;rement pertinentes. L'objectif est de d&#233;velopper et d&#8217;exploiter des
ressources linguistiques pour identifier dans les textes, ind&#233;pendamment des domaines trait&#233;s,
certaines des relations organisatrices des connaissances ainsi que les organisations discursives
mises en places par l'auteur. L'analyse s&#233;mantique du texte est guid&#233;e par le rep&#233;rage d'indices
linguistiques d&#233;clencheurs dont l'emploi est repr&#233;sentatif des notions &#233;tudi&#233;es.
</p>
<p>In this paper, we present a model of contextual exploration and a workstation dedicated to
semantic filtering and relevant sentence extracting. The purpose is to develop and to exploit
linguistics resources in order to identify in texts, independently of processed domains, some
specific relations which organize knowledge and author discourse. Semantic analysis is driven
by the identification of linguistic indicators which are relevant clues for the studied notions.
</p>
<p>1 Introduction
Les techniques actuelles d&#8217;analyse s&#233;mantique de textes tendent de plus en plus &#224; mettre en
&#339;uvre une analyse locale fond&#233;e sur le rep&#233;rage d'indices textuels de certaines informations
s&#233;mantiques pr&#233;sentes dans les textes. La strat&#233;gie g&#233;n&#233;ralement adopt&#233;e par les syst&#232;mes
d&#8217;extraction d&#8217;information (Pazienza, 1997) repose sur une analyse locale qui utilise des
techniques de pattern-matching (Grishman, 1997). En pratique, les indices textuels sont des
patrons d&#8217;extraction tr&#232;s sp&#233;cialis&#233;s qui d&#233;pendent &#233;troitement du domaine trait&#233;. Ces
syst&#232;mes ont r&#233;v&#233;l&#233; leur limites en termes de portabilit&#233; et d&#8217;&#233;volution par rapport aux besoins
des utilisateurs (Poibeau et Nazarenko, 1999). Pour chaque application et pour chaque
nouveau domaine, il faut &#233;laborer de nouveaux patrons sp&#233;cifiques, les tester et construire les
automates
</p>
<p>Les &#233;valuations r&#233;alis&#233;es sur certains syst&#232;mes de r&#233;sum&#233; automatique (Minel et al., 1997 ;
Jing et al., 1998) ainsi que les travaux men&#233;s en collaboration avec les r&#233;sumeurs
professionnels (Enddes-Niggemeyr, 1993) ou en comparaison avec les r&#233;sum&#233;s produits par</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Slim Ben Hazez, Jean-Pierre Descl&#233;s et Jean-Luc Minel
</p>
<p>ces professionnels (Saggion et Lapalme, 1998) ont n&#233;anmoins montr&#233; la difficult&#233; &#224; r&#233;aliser
des r&#233;sum&#233;s standard, c&#8217;est-&#224;-dire construits sans tenir compte des besoins des utilisateurs.
</p>
<p>En d&#233;pit des performances obtenues dans les syst&#232;mes de r&#233;sum&#233; automatique et d&#8217;extraction
d&#8217;information, l'&#233;tude des strat&#233;gies utilis&#233;es soul&#232;ve un certains nombre de questions:
Comment d&#233;finir des t&#226;ches r&#233;utilisables dont les ressources et les traitements peuvent
s'adapter aux besoins de l'utilisateur ? Comment mod&#233;liser les ressources linguistiques et les
rendre accessibles ? Comment exploiter l&#8217;organisation du texte et explorer le contexte
linguistique pour lever l&#8217;ind&#233;termination s&#233;mantique des indices linguistiques recherch&#233;s ?
</p>
<p>L'objectif de nos travaux est de construire une plate-forme de filtrage s&#233;mantique de textes qui
vise &#224; donner quelques &#233;l&#233;ments op&#233;rationnels pour r&#233;pondre &#224; ces questions. L'originalit&#233; de
notre approche (Descl&#233;s et al., 1997, Minel et al., 2001) revient &#224; se donner les moyens
d&#8217;acc&#233;der au contenu s&#233;mantique des textes, pour mieux les cibler et en extraire des s&#233;quences
particuli&#232;rement pertinentes. D&#8217;une part, nous cherchons &#224; exploiter directement
l&#8217;organisation textuelle des propos de l&#8217;auteur. D&#8217;autre part, nous nous int&#233;ressons aux
manifestations textuelles de certaines relations organisatrices de connaissances (relations
d&#233;finitoires, causales, spatiales&#8230;). Notre but est de cibler, &#224; l&#8217;aide de marqueurs linguistiques
et de certaines connaissances grammaticales, des s&#233;quences textuelles qui peuvent exprimer
un certain savoir sur le monde. Ce savoir ne se r&#233;duit pas &#224; une nomenclature (objets,
propri&#233;t&#233;s, &#233;v&#233;nements, etc.). Il est notamment structur&#233; par un certain nombre de relations
entre concepts, &#233;v&#233;nements, etc.
</p>
<p>Le mod&#232;le adopt&#233; pour r&#233;pondre aux besoins du filtrage s&#233;mantique de textes consiste &#224;
identifier, ind&#233;pendamment d'un domaine particulier, certaines informations s&#233;mantiques
adaptables en fonction des besoins des utilisateurs. Ce mod&#232;le est fond&#233; d'une part, sur
l'identification dans les textes de marqueurs linguistiques d'une cat&#233;gorie (grammaticale ou
discursive) ou d'une notion &#233;tudi&#233;e, et d'autre part sur une exploration du contexte1 des
marqueurs identifi&#233;s. Cette exploration permet: d'interpr&#233;ter le contexte d'un marqueur
linguistique; d'analyser la position d'un marqueur dans le texte (d&#233;but de phrase, premier
paragraphe, etc.); de manipuler les &#233;l&#233;ments structurels du texte (titres, paragraphes,...);
d'identifier la structure th&#233;matique, etc. Pour mettre en &#339;uvre ce mod&#232;le et fournir des outils
qui permettent de d&#233;velopper et de d&#233;ployer des ressources linguistiques orient&#233;es vers le
filtrage s&#233;mantique de textes, nous avons d&#233;velopp&#233; la plate-forme Filtext en utilisant le
mod&#232;le d&#8217;exploration contextuelle. Nous allons pr&#233;senter, &#224; travers des exemples de
ressources et de t&#226;ches r&#233;alis&#233;es, la mod&#232;le d'exploration contextuelle et de donn&#233;es
linguistiques et l'architecture de la plate-forme.
</p>
<p>2 Mod&#233;lisation des donn&#233;es linguistiques
</p>
<p>2.1 Acquisition des donn&#233;es linguistiques
La m&#233;thode d&#8217;exploration contextuelle est issue d&#8217;une r&#233;flexion initiale sur le traitement
informatique des valeurs aspecto-temporelles SECAT (Descl&#233;s et al., 1991). La m&#233;thode a &#233;t&#233;
</p>
<p>                                                
1 Cette analyse du contexte d'un marqueur linguistique ne se limite pas aux notions de &quot;concat&#233;nation&quot; ou de
</p>
<p>&quot;contexte contigu&#235;&quot;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#232;le d&#8217;exploration contextuelle pour l&#8217;analyse s&#233;mantique de textes
</p>
<p>ensuite g&#233;n&#233;ralis&#233;e en tenant compte des indications pr&#233;sentes dans le contexte pour un calcul
des valeurs s&#233;mantiques relevant de diff&#233;rentes t&#226;ches (Jouis, 1993, Berri, 1996, Descl&#233;s et
al., 1997a, 1997b).
</p>
<p>D'apr&#232;s le mod&#232;le d&#8217;exploration contextuelle, l&#8217;&#233;tude linguistique consiste &#224; d&#233;terminer les
valeurs s&#233;mantiques des marqueurs linguistiques d'une cat&#233;gorie grammaticale ou d&#8217;une
notion discursive. Selon les cas, une carte s&#233;mantique (par exemple, le r&#233;seau des relateurs de
rep&#233;rage) (Descl&#233;s, 1987) peut &#234;tre construite pour une cat&#233;gorie ou une notion &#233;tudi&#233;e. Le
processus d&#8217;acquisition (figure 1) pour chaque t&#226;che est fond&#233; sur une &#233;tude syst&#233;matique de
corpus de textes pour y rechercher des indicateurs discursifs explicites dont l&#8217;emploi est
repr&#233;sentatif de la valeur s&#233;mantique consid&#233;r&#233;e ou de la notion &#233;tudi&#233;e. C&#8217;est en ce sens que
ces indicateurs deviennent des marqueurs de valeurs s&#233;mantiques. Comme exemple de champ
grammatical, donnons celui qui couvre l&#8217;identification des valeurs aspecto-temporelles
associ&#233;es aux morph&#232;mes des temps grammaticaux du fran&#231;ais. Pour le champ du discours,
mentionnons par exemple les indicateurs discursifs des annonces th&#233;matiques, des
expressions d&#233;finitoires, des relations entre concepts, des relations de causalit&#233;, des relations
temporelles entre &#233;v&#233;nements, etc.
</p>
<p>L&#8217;identification d&#8217;un marqueur (grammatical ou discursif) n&#8217;est cependant pas suffisante pour
d&#233;terminer compl&#232;tement la valeur s&#233;mantique du marqueur. En effet, un indicateur
linguistique (indice d&#233;clencheur) est rarement un marqueur univoque d&#8217;une valeur s&#233;mantique
unique. Ayant identifi&#233; une occurrence de marqueur sous la forme d&#8217;un indicateur r&#233;pertori&#233;,
il faut, dans un deuxi&#232;me temps, explorer le contexte de cette occurrence pour rechercher
d&#8217;autres indices linguistiques, sous la forme d&#8217;occurrences d&#8217;indices compl&#233;mentaires. Ceux-
ci permettront dans un cas favorable de lever l&#8217;ind&#233;termination s&#233;mantique attach&#233;e a priori
au marqueur analys&#233;. Dans ce cas une &#233;tiquette s&#233;mantique pourra &#234;tre attribu&#233;e &#224; un segment
linguistique (syntagme, phrase, paragraphe selon les cas). Les indices permettront &#233;galement
d&#8217;invalider les hypoth&#232;ses s&#233;mantiques qui pouvaient &#234;tre envisag&#233;es &#224; propos du marqueur
analys&#233; dans son contexte. L&#8217;exploration contextuelle est gouvern&#233;e par un ensemble de
r&#232;gles (dite d&#8217;exploration) qui, pour un indicateur donn&#233; et une d&#233;cision &#224; prendre,
recherchent d&#8217;autres indices explicites dans un espace de recherche (phrase, paragraphe,&#8230;).
Par exemple, pour la proposition j&#8217;ai pris mon cachet, la marque du pass&#233; compos&#233; ne suffit
pas elle seule pour d&#233;cider de la valeur aspecto-temporelle attach&#233;e &#224; la proposition (on parle
d&#8217;ind&#233;termination s&#233;mantique). Les deux classes d'indices contextuels (ouf, enfin, &#231;a y est,&#8230;)
et (ce matin,&#8230;) contribueront &#224; lever l'ind&#233;termination s&#233;mantique et orienteront
respectivement vers la valeur &quot;d'&#233;tat r&#233;sultant&quot; et &quot;d'&#233;v&#233;nement&quot; (Descl&#233;s et al., 1997a).
</p>
<p>Figure 1 : Processus d'acquisition des donn&#233;es linguistiques
</p>
<p>Identifier les indices
d&#233;clencheurs
</p>
<p>Tests et validationCorpus de tests
</p>
<p>Corpus d'&#233;tude
linguistique
</p>
<p>Identifier les indices et
les r&#232;gles contextuels
</p>
<p>carte s&#233;mantique</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Slim Ben Hazez, Jean-Pierre Descl&#233;s et Jean-Luc Minel
</p>
<p>L&#8217;acquisition de ces donn&#233;es linguistiques n&#233;cessite le choix d'un corpus de travail qui d&#233;pend
g&#233;n&#233;ralement de la t&#226;che &#224; r&#233;aliser et une fouille syst&#233;matique des textes en vue d'accumuler
les indicateurs, les indices contextuelles et les r&#232;gles qui les combinent ; cette fouille est
compl&#233;t&#233;e par un travail de r&#233;flexion linguistique, afin de d&#233;gager des r&#233;gularit&#233;s textuelles.
</p>
<p>2.2 Mod&#232;le de donn&#233;es linguistiques
Le travail de mod&#233;lisation a pour objectif de capitaliser et de rendre accessibles les ressources
linguistiques. Pour r&#233;pondre &#224; l&#8217;objectif d&#8217;une acquisition incr&#233;mentale et capitalisable des
donn&#233;es linguistiques, nous avons d&#233;fini un mod&#232;le et des outils qui permettent au linguiste
de construire et de maintenir des bases de donn&#233;es linguistiques sp&#233;cifiques &#224; des t&#226;ches
d&#8217;identification d&#8217;informations s&#233;mantiques (Ben Hazez et Minel, 2000). Ce mod&#232;le r&#233;pond
aux sp&#233;cifications suivantes:
</p>
<p>&#8722; Les donn&#233;es linguistiques sont organis&#233;s par t&#226;che. Chaque t&#226;che se voit associ&#233;e une base
de donn&#233;es de marqueurs linguistiques et de r&#232;gles d'exploration contextuelle. La notion
de t&#226;che est un moyen qui permet au linguiste d'organiser ces connaissances  de mani&#232;re
ind&#233;pendante. Le mod&#232;le permet de g&#233;rer plusieurs bases linguistiques et de les organiser
sous forme d'arbre. Par exemple, la base de donn&#233;es linguistique associ&#233;e &#224; la t&#226;che de
r&#233;sum&#233; automatique est compos&#233;e de plusieurs sous-t&#226;ches de rep&#233;rage: des annonces
th&#233;matiques, des conclusions/r&#233;capitulations, des r&#233;sultats, des hypoth&#232;ses, etc.
</p>
<p>&#8722; La strat&#233;gie d&#8217;exploration de texte est guid&#233;e par des indices d&#233;clencheurs (indicateurs).
Contrairement &#224; une strat&#233;gie guid&#233;e par les r&#232;gles, la description et la reconnaissance de
ces indicateurs ne sont pas donc cod&#233;es dans les r&#232;gles.
</p>
<p>L'interface homme machine (IHM) pr&#233;sent&#233;e dans la figure 2 illustre un extrait des tables de
cr&#233;ation et de manipulation des donn&#233;es linguistiques. Cette interface permet au linguiste de
constituer sa base de donn&#233;es linguistiques en sp&#233;cifiant, les t&#226;ches, les classes d'indicateurs et
les r&#232;gles d&#8217;exploration contextuelle associ&#233;es:
</p>
<p>&#8722; La table &quot;TACHE_fr&quot; permet de d&#233;clarer ou de s&#233;lectionner une t&#226;che. Comme le montre
l'exemple de la figure 2, les donn&#233;es affich&#233;es repr&#233;sentent une vue de la base globale
relative &#224; la t&#226;che s&#233;lectionn&#233;e &#171; R&#233;sum&#233; &#187;.
</p>
<p>&#8722; La table &quot;CLASSES_MARQUEURS_fr&quot; contient les d&#233;clarations des classes
d'indicateurs (indices d&#233;clencheurs) et les indices contextuels. Par exemple, la classe
&quot;&amp;Crecap1.10&quot; s&#233;lectionn&#233;e contient des indicateurs d'&#233;nonc&#233;s de r&#233;capitulation.
</p>
<p>&#8722; La table &quot;MARQUEURS_fr&quot; contient la description des marqueurs (motifs linguistiques)
pour chaque classe de la t&#226;che courante. Par exemple, les expressions linguistiques
s&#233;lectionn&#233;es (&quot;en conclusion&quot;, &quot;pour finir&quot;, &quot;en r&#233;sum&#233;&quot;,&#8230;) repr&#233;sentent des indicateurs
de r&#233;capitulation de la classe &quot;&amp;Crecap1.10
</p>
<p>&#8722; La table &quot;REGLES_fr&quot; permet de d&#233;clarer pour chaque r&#232;gle, le nom de la r&#232;gle,
l'&#233;tiquette s&#233;mantique associ&#233;e, la classe des indicateurs qui d&#233;clenche la r&#232;gle et le
segment textuel &#224; &#233;tiquet&#233;. Par exemple, la ligne s&#233;lectionn&#233;e de la table sp&#233;cifie le nom
de la r&#232;gle d&#233;clench&#233;e par les indicateurs de la classe &quot;&amp;Crecap1.10&quot;. L'action de cette
r&#232;gle consiste &#224; attribuer l'&#233;tiquette s&#233;mantique &quot;R&#233;capitulation&quot; &#224; chaque phrase
contenant un indicateur de la classe &quot;&amp;Crecap1.10&quot; v&#233;rifiant les contraintes de la r&#232;gle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#232;le d&#8217;exploration contextuelle pour l&#8217;analyse s&#233;mantique de textes
</p>
<p>Ces tables sont organis&#233;es selon un sch&#233;ma conceptuel implant&#233; dans un syst&#232;me de gestion
de base de donn&#233;es relationnelle. Pour faciliter la gestion des bases linguistiques nous avons
int&#233;gr&#233; dans l'IHM des fonctions de tri, de recherche, de filtrage ainsi que des outils
d'interrogation et de v&#233;rification des contraintes d'int&#233;grit&#233;s des donn&#233;es linguistiques.
</p>
<p>Figure 2 : Tables de d&#233;finition et de manipulation des donn&#233;es linguistiques
</p>
<p>2.2.1 Langage de description des marqueurs linguistiques
</p>
<p>Les marqueurs linguistiques sont des unit&#233;s lexicales simples ou compos&#233;es (morph&#232;mes,
mots, expressions et locutions, &#8230;) form&#233;es &#224; partir d'unit&#233;s atomiques (&quot;tokens&quot;) et des
op&#233;rateurs de concat&#233;nation, de disjonction et de r&#233;p&#233;tition. Chaque motif linguistique d&#233;crit
un ensemble de r&#233;alisations possibles de s&#233;quences textuelles continues ou &#233;ventuellement
discontinues. Ces marqueurs linguistiques sont regroup&#233;s dans des classes en fonction de
crit&#232;res syntaxiques ou s&#233;mantiques2. Une classe est identifi&#233;e par un nom pr&#233;c&#233;d&#233; par le
symbole &quot;&amp;&quot;. Par exemple, l'expression il est + &amp;importance permet de rep&#233;rer des lexies du
type: il est primordial ; il est particuli&#232;rement important ; il est,&#8230;, essentiel ; etc. Pour une
t&#226;che donn&#233;e seules certaines flexions d&#8217;un verbe sont significatives. Ainsi, si le but est de
                                                
2 A partir d'une premi&#232;re expression il est possible de construire une classe d'expressions par des op&#233;rations de
</p>
<p>synonymie, de nominalisation ou de paraphrase. L'utilisateur doit par la suite valider les expressions
engendr&#233;es  et &#233;liminer les expressions incorrectes ou non &#233;quivalentes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Slim Ben Hazez, Jean-Pierre Descl&#233;s et Jean-Luc Minel
</p>
<p>rechercher les annonces th&#233;matiques d'un article scientifique, le verbe pr&#233;senter est
significatif seulement lorsqu'il est employ&#233; &#224; l'indicatif pr&#233;sent ou au futur, &#224; la premi&#232;re
personne du singulier ou du pluriel. Le langage int&#232;gre un ensemble de classes d'expressions
pr&#233;d&#233;finies (dates, &#233;num&#233;rations, abr&#233;viations, nombres, etc.) identifi&#233;es par un &quot;tokenizeur&quot;.
L'int&#233;gration d'un &#233;tiqueteur morpho-syntaxique permet d'am&#233;liorer la qualit&#233; de la
reconnaissance en effectuant des recherches par lemmes, par cat&#233;gories grammaticales et par
utilisation des informations flexionnelles.
</p>
<p>2.2.2 Langage de description des r&#232;gles
</p>
<p>Les r&#232;gles d&#8217;exploration contextuelle sont exprim&#233;es dans un langage formel de type
d&#233;claratif comme le montre l&#8217;exemple de la figure 3. Ce langage est centr&#233; sur la notion d'un
espace de recherche, c'est-&#224;-dire un segment textuel d&#233;termin&#233; &#224; partir de l'indicateur, espace
dans lequel les indices compl&#233;mentaires doivent &#234;tre recherch&#233;s. Il est important de pouvoir
exprimer des contraintes qui prennent en compte la dimension textuelle. La partie condition
de la r&#232;gle  explicite les conditions que doivent v&#233;rifier les indicateurs et les indices
compl&#233;mentaires. Le langage permet d&#8217;exprimer diff&#233;rentes conditions, comme l'existence, la
position dans le texte et l'agencement des indices. La partie action consiste &#224; attribuer une
&#233;tiquette &#224; un segment textuel ou &#224; d&#233;clencher une autre r&#232;gle.
/* T&#226;che d&#233;clenchante : th&#233;matique ;
capte un sch&#233;ma du type : il semble .. crucial
Indicateur : &amp;modal3; */
E1 := Cr&#233;er_espace(PhraseParent_de Indicateur);
L1:= &amp;verbe-etat3 ; L2 := &amp;adjectif-necessit&#233;
Condition: Il_existe_un_indice y appartenant_&#224; E1 tel_que
classe_de y appartient_a (L1 ) ;
Condition : Il_existe_un_indice z appartenant_&#224; E1 tel_que
classe_de z appartient_a (L2) ;
Actions : Attribuer_Etiquette (&quot;Soulignement_Auteur &quot;)
</p>
<p>Figure 3 : Exemple d&#8217;une r&#232;gle pour rep&#233;rer des &#233;nonces de soulignement par l&#8217;auteur
</p>
<p>3 Architecture de la plate-forme
La plate-forme FilText s'appuie sur le mod&#232;le conceptuel des donn&#233;es linguistiques et le
mod&#232;le d&#8217;exploration contextuelle pr&#233;sent&#233;es pr&#233;c&#233;demment. L'une des particularit&#233;s du
syst&#232;me est son ouverture: les utilisateurs peuvent cr&#233;er de nouvelles bases linguistiques pour
d'autres t&#226;ches et r&#233;utiliser des donn&#233;es ou des composants logiciels. Les traitements sont
encapsul&#233;s dans des API3 Java et produisent des sorties selon un format d'&#233;change standard
XML, ce qui favorise un d&#233;ploiement plus facile des ressources linguistiques. Comme le
montre la figure 4, la plate-forme est compos&#233; de trois sous-syst&#232;mes qui coop&#232;rent : i) un
gestionnaire des donn&#233;es linguistiques dot&#233; d'une IHM; ii) un  moteur d&#8217;exploration
contextuelle qui exploite les donn&#233;es linguistiques pour une ou plusieurs t&#226;ches choisies par
l&#8217;utilisateur et produit une structure hi&#233;rarchique du texte avec des &quot;d&#233;corations s&#233;mantiques&quot;;
iii) un ensemble d'agents sp&#233;cialis&#233;s dot&#233;s d'IHM et de connaissances qui exploitent les
d&#233;corations s&#233;mantiques g&#233;n&#233;r&#233;es par le moteur d'exploration contextuel.
</p>
<p>                                                
3 Application Programming Interface.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#232;le d&#8217;exploration contextuelle pour l&#8217;analyse s&#233;mantique de textes
</p>
<p>Figure 4 : Architecture g&#233;n&#233;rale de la plate-forme
</p>
<p>3.1 Gestionnaire des donn&#233;es linguistiques
Les donn&#233;es linguistiques sont capitalis&#233;es dans un syst&#232;me de gestion de bases de donn&#233;es
relationnelles (SGBDR). Le gestionnaire des donn&#233;es linguistiques est impl&#233;ment&#233; sous
forme d'une API Java qui communiquent avec le SGBDR via la passerelle JDBC (Java
Database Connectivity). Cette API offre une vue objet de la base de donn&#233;es permettant le
d&#233;veloppement d'une IHM et de r&#233;pondre &#224; des requ&#234;tes lanc&#233;es par les autres sous-syst&#232;mes
de la plate-forme. Ce module impl&#233;mente un simple langage de requ&#234;te qui permet diff&#233;rentes
op&#233;rations sur la base de donn&#233;es linguistiques: importation de donn&#233;es, s&#233;lection,
modification, etc. Il int&#232;gre aussi un module de reconnaissance de motifs linguistiques
(pattern-matching) utilis&#233; par les autres composants de la plate-forme. Ce dernier est un
automate qui permet de chercher dans un segment textuel (s&#233;quence de tokens, phrase, etc.)
toutes les occurrences d'un motif linguistique donn&#233;. Le r&#233;sultat de recherche d'un marqueur
linguistique dans un segment S est repr&#233;sent&#233; sous forme d'un ensemble de paires de valeurs
not&#233;es S(u, v); u et v repr&#233;sentent respectivement les positions du premier et dernier &#233;l&#233;ments
de chaque occurrence du motif.
</p>
<p>3.2 Moteur d&#8217;exploration contextuelle
Le moteur d&#8217;exploration contextuelle permet l&#8217;&#233;tiquetage s&#233;mantique des segments textuels ;
il est compos&#233; de trois modules qui coop&#232;rent :
</p>
<p>&#9830; L&#8217;analyseur de textes qui construit une premi&#232;re repr&#233;sentation qui refl&#232;te l&#8217;organisation
structurelle du texte. La construction de cette structure hi&#233;rarchique s'appuie sur le texte
</p>
<p>texte
</p>
<p>Moteur d&#8217;exploration
contextuelle
</p>
<p>extrait /  r&#233;sum&#233; / graphe
</p>
<p>Requ&#234;te
</p>
<p>indicateurs
indices
r&#232;gles
</p>
<p>&#233;tiquettes
</p>
<p>Analyseur
</p>
<p>Structure
hi&#233;rarchique du texte
</p>
<p>Agent
sp&#233;cialis&#233;
</p>
<p>Structure d&#233;cor&#233;e
du texte
</p>
<p>nom de t&#226;ches
</p>
<p>Reconnaissance
des indices
</p>
<p>d&#233;clencheurs
</p>
<p>Ex&#233;cuteur de
R&#232;gles
</p>
<p>occurrences
d&#8217;indicateurs
</p>
<p>r&#232;gles
d&#233;clenchables
</p>
<p>Agent
sp&#233;cialis&#233;
</p>
<p>bases
linguistiques
</p>
<p>Gestionnaire
des donn&#233;es
linguistiques</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Slim Ben Hazez, Jean-Pierre Descl&#233;s et Jean-Luc Minel
</p>
<p>segment&#233; en unit&#233;s structurelles: sections, paragraphes, phrases. L&#8217;analyseur fait appel &#224;
trois modules ind&#233;pendants: un segmenteur en unit&#233;s structurelles; un tokeniseur qui
effectue le d&#233;coupage en tokens et permet d&#8217;identifier la cat&#233;gorie de chaque token (date,
&#233;num&#233;ration,&#8230;); un constructeur du mod&#232;le objet du texte qui repr&#233;sente la structure
hi&#233;rarchique du texte.
</p>
<p>&#9830; Le module de reconnaissance des indicateurs qui a pour t&#226;che de compiler les indicateurs
(indices d&#233;clencheurs) pour l'ensemble des t&#226;ches d&#233;clench&#233;es et de les appliquer sur le
texte. Cette &#233;tape permet de rechercher toutes les occurrences des indicateurs et de
d&#233;terminer quelles sont les r&#232;gles &#224; d&#233;clencher.
</p>
<p>&#9830; Ex&#233;cuteur de r&#232;gles qui permet d'ex&#233;cuter les r&#232;gles associ&#233;es &#224; chaque occurrence d'un
indicateur trouv&#233;e. Les r&#232;gles sont consid&#233;r&#233;es comme ind&#233;pendantes. Ce mode de
fonctionnement correspond &#224; l&#8217;hypoth&#232;se que, pour une t&#226;che donn&#233;e, certains marqueurs
s&#233;mantiques ne sont pas exclusifs entre eux. Par exemple, la pr&#233;sence d&#8217;une n&#233;gation dans
une phrase conclusive n&#8217;implique pas que cette phrase ne soit pas par ailleurs une
&#171; conclusion &#187;. D&#8217;autre part, une phrase &#233;tiquet&#233;e comme &#171; d&#233;finitoire &#187; peut aussi &#234;tre
&#233;tiquet&#233;e comme &#171; conclusion &#187;. Toutes les d&#233;ductions effectu&#233;es par les r&#232;gles sont
attribu&#233;es aux &#233;l&#233;ments qui composent la hi&#233;rarchie du texte et produisent ainsi une
structure hi&#233;rarchique &#171; d&#233;cor&#233;e &#187; par des informations s&#233;mantiques.
</p>
<p>L'algorithme ci-dessous illustre le fonctionnement du moteur d'exploration contextuelle. La
premi&#232;re &#233;tape consiste &#224; compiler les donn&#233;es linguistiques pour une ou plusieurs t&#226;ches &#224;
d&#233;clencher, puis &#224; d&#233;terminer la liste des indicateurs &#224; appliquer sur le texte. Dans cette
exemple le moteur applique une analyse du texte par phrase. L'&#233;tape suivante du moteur
consiste d'abord &#224; chercher dans chaque phrase du texte toutes les occurrences de la liste des
indicateurs, puis &#224; ex&#233;cuter les r&#232;gles associ&#233;es &#224; chaque occurrence trouv&#233;e.
Fonctions fournies par l&#8217;interface (API) du syst&#232;me de gestion des donn&#233;es linguistiques:
</p>
<p>T &#402; compile(nom t&#226;ches) : compiler l'ensemble de donn&#233;es linguistiques des t&#226;ches d&#233;clench&#233;es dans une vue T.
M &#402; selectIndicateurs(T)  : renvoie l'ensemble M des classes d'indicateurs de T.
R &#402; selectRegles(T, Mj)    : renvoie l'ensemble des r&#232;gles d'exploration R associ&#233;es a un indicateur Mj de M.
OCC &#402; identifier_Indicateurs(Si, Mj)  : identifie dans un segment Si toutes les occurrences de l'indicateur Mj.
</p>
<p>Algorithme du moteur:
DEBUT
  T  compile(nom de t&#226;ches);
  M  selectIndicateurs(T) ;
  POUR TOUT  phrase Si  FAIRE
</p>
<p>POUR TOUT  indicateur Mj de M FAIRE
OCC  identifier_Indicateurs(Si, Mj);
SI  (OCC &lt;&gt; vide)  ALORS  R  selectRegles(T, Mj);
</p>
<p>POUR TOUT  occurrence Si(u, v)  de OCC FAIRE
Executer_Regle(R, Si(u, v));
</p>
<p>FINPOUR
FINSI
</p>
<p>FINPOUR
  FINPOUR
FIN
</p>
<p>3.3 Agents sp&#233;cialis&#233;s
Les agents sp&#233;cialis&#233;s ont pour t&#226;che d&#8217;exploiter les &#171; d&#233;corations s&#233;mantiques&#187; du texte en
fonction des objectifs d&#233;finis par l&#8217;utilisateur. Chaque agent poss&#232;de ces propres
connaissances et une IHM de pr&#233;sentation des r&#233;sultats.
</p>
<p>//appliquer l'ensemble des r&#232;gles R  sur
//chaque occurrence de l&#8217;indicateur Mj  et
//&#233;tiqueter le segment Si</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#232;le d&#8217;exploration contextuelle pour l&#8217;analyse s&#233;mantique de textes
</p>
<p>Ainsi, l&#8217;agent r&#233;sumeur-filtreur4 exploite des connaissances linguistiques qui permettent de
rep&#233;rer des &#233;nonc&#233;s structurants, des d&#233;finitions, des relations causales, etc. Par exemple,
l&#8217;&#233;tiquette &quot;annonce th&#233;matique&quot; est attribu&#233;e aux phrases exprimant le sujet, le th&#232;me d&#8217;un
segment textuel quelconque. L&#8217;&#233;tiquette &quot;r&#233;capitulation/conclusion th&#233;matique&quot; est attribu&#233;e
aux phrases explicitant les conclusions et enseignements g&#233;n&#233;raux du texte. Certaines phrases
&#233;tant &#233;tiquet&#233;es, il devient possible de construire des extraits qui r&#233;pondent aux besoins
sp&#233;cifiques d&#8217;un utilisateur en appliquant diff&#233;rentes strat&#233;gies de s&#233;lection. Cependant, cette
extraction brise la coh&#233;rence du texte source et peut m&#234;me introduire des contresens. Des
heuristiques simples ont &#233;t&#233; d&#233;finies pour d&#233;tecter potentiellement certains liens
anaphoriques, manipuler les marqueurs d'int&#233;gration lin&#233;aire (comme en premier lieu, en
second lieu, etc), exploiter la structure et les &#233;num&#233;rations du texte, etc. En outre le
d&#233;veloppement d'IHM qui permettent d'afficher l'arborescence du texte et d&#8217;offrir &#224;
l'utilisateur des moyens pour naviguer entre l'extrait et le texte source constitue une des
r&#233;ponses offerte par Filtext. Plut&#244;t que de chercher &#224; produire un r&#233;sum&#233; autonome,
ind&#233;pendant du texte source, en appliquant une analyse profonde pour r&#233;soudre les probl&#232;mes
d'anaphore, et rep&#233;rer les liens de coh&#233;sion et de coh&#233;rence, l'objectif se d&#233;place vers la
production d'un texte r&#233;duit aux informations jug&#233;es saillantes pour le lecteur, et la
construction de liens qui permettent au lecteur, au vu des informations partielles qui lui sont
pr&#233;sent&#233;es, de fouiller, &#224; la demande, le texte source.
</p>
<p>D'autres agents sont int&#233;gr&#233;s dans la plate-forme : identification des citations dans les textes
(Mourad, 2000) et d&#8217;extraire des relations s&#233;mantiques (localisation, composition, partie-tout,
attribution,&#8230;) entre concepts (Le Priol, 2000). Les r&#233;sultats de ce dernier syst&#232;me sont
repr&#233;sent&#233;s sous forme de graphes ou de tables relationnelles.
</p>
<p>4 Conclusion
Nous avons pr&#233;sent&#233; un mod&#232;le d'exploration de texte et une plate-forme logicielle permettant
de d&#233;velopper des ressources linguistiques pour extraire certaines informations s&#233;mantiques.
Les ressources linguistiques peuvent prendre la forme de base de donn&#233;es de marqueurs et de
r&#232;gles, ou de textes avec des &quot;d&#233;corations&quot; s&#233;mantiques. L'une des particularit&#233;s du syst&#232;me
est son ouverture : il permet aux utilisateurs de d&#233;velopper et manipuler des bases de donn&#233;es
linguistiques pour de nouvelles t&#226;ches d'identification, l'enrichir en fonction des informations
qu'ils recherchent, r&#233;utiliser des donn&#233;es et des fonctionnalit&#233;s du syst&#232;me, etc.
</p>
<p>Le mod&#232;le envisag&#233; doit &#234;tre adapt&#233; aux besoins des utilisateurs et applicable &#224; tout type de
texte. Nous travaillons actuellement &#224; l'int&#233;gration d'une analyse th&#233;matique fond&#233;e d'une part
sur des crit&#232;res statistiques et d'autre part sur le rep&#233;rage des introducteurs th&#233;matiques (Ferret
et al., 2001).
</p>
<p>L'analyse mise en &#339;uvre et l'acquisition des donn&#233;es linguistiques d&#233;pendent &#233;troitement de la
nature du corpus et de l'information recherch&#233;e. La couverture du corpus, le choix des bons
indices textuels et la r&#233;alisation de t&#226;ches r&#233;utilisables constitue une probl&#233;matique
fondamentale de l'analyse textuelle qui n&#233;cessite une &#233;tude linguistique plus fouill&#233;e.
                                                
4 Le lecteur trouvera dans (Minel et al., 1997) une &#233;valuation d&#233;taill&#233;e et dans (Minel et al., 2001) un exemple de
</p>
<p>r&#233;sum&#233; produit par cet agent.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Slim Ben Hazez, Jean-Pierre Descl&#233;s et Jean-Luc Minel
</p>
<p>R&#233;f&#233;rences
Ben Hazez, S., Minel J-L. (2000). Designing Tasks of Identification of Complex Patterns Used for Text
Filtering. RIAO&#8217;2000, Paris, 1558-1567.
</p>
<p>Berri, J. (1996). Contribution &#224; la m&#233;thode d'exploration contextuelle. Applications au r&#233;sum&#233; automatique et
aux repr&#233;sentations temporelles. R&#233;alisation informatique du syst&#232;me SERAPHIN. Th&#232;se de doctorat, Universit&#233;
Paris-Sorbonne, Paris.
</p>
<p>Descl&#233;s, J-P. (1987). R&#233;seaux s&#233;mantiques : la nature logique et linguistique des relateurs, langages,
S&#233;mantiques et Intelligence Artificielle, n&#176; 87, p. 55-78.
</p>
<p>Descl&#233;s, J-P., Jouis, C., Oh, H-G., Reppert, D. M. (1991). Exploration Contextuelle et s&#233;mantique : un syst&#232;me
expert qui trouve les valeurs s&#233;mantiques des temps de l'indicatif dans un texte. In Knowledge modeling and
expertise transfer, pp.371-400, D. Herin-Aime, R. Dieng, J-P. Regourd, J.P. Angoujard (&#233;ds), Amsterdam.
</p>
<p>Descl&#233;s, J-P. (1997a). Syst&#232;mes d'exploration contextuelle. Co-texte et calcul du sens. (ed Claude Guimier),
Presses Universitaires de Caen, 215-232.
</p>
<p>Descl&#233;s, J-P., Cartier, E., Jackiewicz, A., Minel, J-L. (1997b). Textual Processing and Contextual Exploration
Method. In CONTEXT&#8217;97, Rio de Janeiro, Br&#233;sil.
</p>
<p>Endres-Niggemeyer, B. (1993). An empirical process model of abstracting. In Workshop on Summarizing Text
for Intelligent Communication, Dagsthul, Germany.
</p>
<p>Ferret, O., Grau, B., Minel, J.-L., Porhiel, S. (2001). Rep&#233;rage de structures th&#233;matiques dans les textes. TALN
2001, Tours.
</p>
<p>Grishman, R. (1997) . Information extraction : techniques and challenges. In : Pazienza, M.T. &#233;d. Information
extraction. Berlin : Springer verlag, 10-27.
</p>
<p>Jing, Hongyan, Regina Barzilay et Kathleen McKeown. (1998). Summarization evaluation methods :
Experiments and analysis. In Symposium on Intelligent Text Summarization, Stanford, CA.
</p>
<p>Jouis, C. (1993). Contribution &#224; la conceptualisation et &#224; la mod&#233;lisation des connaissances &#224; partir d'une analyse
linguistique de textes. Th&#232;se de doctorat, EHESS, Paris.
</p>
<p>Le Priol, F. (2000). Extraction et capitalisation de connaissances &#224; partir de documents textuels. SEEK-JAVA :
Identification et interpr&#233;tation de relation entre concepts. Th&#232;se de doctorat, Universit&#233; Paris-Sorbonne, Paris.
</p>
<p>Minel , J-L., Nugier, S., Piat, G. (1997). How to appreciate the Quality of Automatic Text Summarization.
Workshop Intelligent Scalable Text Summarization, EACL 97, Madrid, 25-30.
</p>
<p>Minel J-L., Cartier, E , Crispino, G., Descl&#233;s J-P, Ben Hazez S, Jackiewicz, A. (2001) R&#233;sum&#233; automatique par
filtrage s&#233;mantique d&#8217;informations dans des textes. Technique et Science Informatiques, Paris, n&#176; 3.
</p>
<p>Mourad, G. (2000).  Pr&#233;sentation de connaissances linguistiques pour le rep&#233;rage et l&#8217;extraction de citations.
TALN (RECITAL&#8217;2000), Lausanne, p 495-501.
</p>
<p>Pazienza, M.T. (1997) (&#233;d.). Information extraction (a multidisciplinary approach to an emerging information
technology), International Summer School, SCIE&#8217;97, Springer Verlag (Lectures Notes in Computer Science).
</p>
<p>Poibeau, T., Nazarenko, A.(1999). L&#8217;extraction d&#8217;information, une nouvelle conception de la compr&#233;hension de
texte ?, T.A.L. vol 40.,  n&#176;2, p 87-115.
</p>
<p>Saggion, H., Lapalme, G. (1998). Where does information come from ? Corpus Analysis for Automatic
Abstracting. RIFRA&#8217;98, Rencontre Internationale sur l&#8217;Extraction le Filtrage et le R&#233;sum&#233; automatiques, Sfax,
Tunisie.</p>

</div></div>
</body></html>