<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L&#8217;apport de connaissances morphologiques pour la projection de requ&#234;tes sur une terminologie normalis&#233;e</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2001, Tours, 2-5 juillet 2001
</p>
<p>L&#8217;apport de connaissances morphologiques pour la projection
de requ&#234;tes sur une terminologie normalis&#233;e
</p>
<p>Pierre Zweigenbaum
&#0;
</p>
<p>, Natalia Grabar
&#0;
</p>
<p>, Stefan Darmoni
&#1;
</p>
<p>&#0;
</p>
<p>DIAM &#8212; SIM/DSI, Assistance Publique &#8211; H&#244;pitaux de Paris &amp;
D&#233;partement de Biomath&#233;matiques, Universit&#233; Paris 6
</p>
<p>{pz,ngr}@biomath.jussieu.fr
&#1;
</p>
<p>D&#233;partement Informatique et R&#233;seaux, CHU de Rouen &amp;
Laboratoire Perception, Information et Syst&#232;mes, INSA, Rouen
</p>
<p>stefan.darmoni@chu-rouen.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>L&#8217;apport de connaissances linguistiques &#224; la recherche d&#8217;information reste un sujet de d&#233;bat.
Nous examinons ici l&#8217;influence de connaissances morphologiques (flexion, d&#233;rivation) sur les
r&#233;sultats d&#8217;une t&#226;che sp&#233;cifique de recherche d&#8217;information dans un domaine sp&#233;cialis&#233;. Cette
influence est &#233;tudi&#233;e &#224; l&#8217;aide d&#8217;une liste de requ&#234;tes r&#233;elles recueillies sur un serveur op&#233;ra-
tionnel ne disposant pas de connaissances linguistiques. Nous observons que pour cette t&#226;che,
flexion et d&#233;rivation apportent un gain mod&#233;r&#233; mais r&#233;el.
</p>
<p>Mots Clefs - Keywords Morphologie, recherche d&#8217;information, variantes de termes, m&#233;de-
cine, terminologie, Doc&#8217;CISMeF, MeSH.
</p>
<p>1 Appariement entre requ&#234;tes et termes sp&#233;cialis&#233;s
</p>
<p>Une op&#233;ration cl&#233; en recherche d&#8217;information est l&#8217;appariement entre une requ&#234;te et un docu-
ment. Comme une requ&#234;te peut employer des mots proches mais non n&#233;cessairement identiques
&#224; ceux des documents, on peut esp&#233;rer que la prise en compte de proximit&#233;s morphologiques
entre mots aide &#224; obtenir de meilleurs r&#233;sultats. Cela peut se faire par simplification pr&#233;alable
des requ&#234;tes et des documents (lemmatisation, &#171; racinisation &#187;) ou par extension de requ&#234;te
(ajout de formes fl&#233;chies ou d&#233;riv&#233;es aux mots de la requ&#234;te). Lemmatisation et racinisation ne
semblent cependant pas apporter syst&#233;matiquement l&#8217;am&#233;lioration attendue ; des &#233;tudes com-
pl&#233;mentaires sont donc n&#233;cessaires (voir (Gaussier et al., 2000) pour une synth&#232;se et une exp&#233;-
rimentation). Nous proposons ici une nouvelle exp&#233;rimentation dans un domaine sp&#233;cifique.
Son contexte est le suivant. L&#8217;annuaire des sites m&#233;dicaux francophones, Doc&#8217;CISMeF (Dar-
moni et al., 2000), indexe ces sites par des mots cl&#233;s pris dans un thesaurus de r&#233;f&#233;rence, le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Natalia Grabar, Stefan Darmoni
</p>
<p>MeSH (INSERM, 2000). L&#8217;utilisateur, pour chercher ces sites, peut saisir une requ&#234;te pour s&#233;-
lectionner les termes MeSH pertinents, qui donneront ensuite acc&#232;s aux sites correspondants.
La question pos&#233;e est alors la suivante : l&#8217;emploi de connaissances morphologiques dans le pro-
cessus d&#8217;appariement entre requ&#234;te et termes cible am&#233;liore-t-il la qualit&#233; des termes trouv&#233;s?
</p>
<p>Cette t&#226;che est proche de la t&#226;che classique de recherche d&#8217;information : on part d&#8217;une requ&#234;te
en langue naturelle, qu&#8217;il faut apparier avec un &#171;document &#187; en langue naturelle. Elle poss&#232;de
cependant plusieurs particularit&#233;s. La cible est extr&#234;mement courte : c&#8217;est une expression com-
prenant de un &#224; quelques mots. Elle n&#8217;est pas n&#233;cessairement syntaxiquement bien form&#233;e : de
nombreux termes suivent un sch&#233;ma du type myocarde, infarctus dans lequel le terme d&#8217;origine
(infarctus du myocarde) est r&#233;duit &#224; ses mots significatifs, le nom &#233;tant plac&#233; en t&#234;te. Une dif-
f&#233;rence suppl&#233;mentaire ici est que certaines requ&#234;tes sont exprim&#233;es dans une langue diff&#233;rente
de la terminologie cible (anglais pour interroger du fran&#231;ais). Cela vient du fait que certains
utilisateurs peuvent &#234;tre plus familiers avec la version originale (am&#233;ricaine) du MeSH qu&#8217;avec
sa version fran&#231;aise.
</p>
<p>Cette t&#226;che peut &#234;tre rapproch&#233;e des travaux sur la variation terminologique. Cette variation a
&#233;t&#233; &#233;tudi&#233;e d&#8217;un point de vue morphologique (Jacquemin &amp; Tzoukermann, 1999), syntaxique
(Jacquemin, 1997) et lexical (ou &#171;s&#233;mantique&#187;) (Hamon et al., 1998). Ici, le fait que les &#171;termes&#187;
cible aussi bien que les requ&#234;tes ne soient pas n&#233;cessairement syntaxiquement bien form&#233;s
r&#233;duit a priori l&#8217;int&#233;r&#234;t d&#8217;approches syntaxiques.
</p>
<p>L&#8217;appariement vis&#233; repose sur la disponibilit&#233; de ressources morphologiques. Si les travaux
sur la flexion sont maintenant r&#233;pandus pour le fran&#231;ais (par exemple, (Namer, 2000)), les res-
sources d&#233;rivationnelles sont plus rares ; elles commencent cependant &#224; &#234;tre constitu&#233;es (Gaus-
sier, 1999; Grabar &amp; Zweigenbaum, 2000; Daille, 1999; Hathout, 2001; Hathout et al., 2001).
Nous partons ici des ressources obtenues automatiquement dans (Grabar &amp; Zweigenbaum,
2000).
Nous pr&#233;sentons successivement la pr&#233;paration des ressources morphologiques et des requ&#234;tes,
le processus d&#8217;appariement, les exp&#233;riences effectu&#233;es et leurs r&#233;sultats.
</p>
<p>2 Ressources morphologiques et appariement de termes
</p>
<p>Dans (Grabar &amp; Zweigenbaum, 2000) et d&#8217;autres travaux connexes, nous avons extrait auto-
matiquement de deux terminologies m&#233;dicales (SNOMED et Classification internationale des
maladies) des couples de mots en relation morphologique : flexion ({abdominal, abdominale}),
d&#233;rivation ({abdomen, abdominal}), composition ({ad&#233;nome, ad&#233;nofibrome}), et des combinai-
sons de ces relations ({membranes, membranaire} combine la flexion {membrane, membranes}
et la d&#233;rivation {membrane, membranaire}). Le principe de cette extraction automatique repose
sur la disponibilit&#233; d&#8217;une terminologie poss&#233;dant des relations s&#233;mantiques entre termes (syno-
nymie, hi&#233;rarchie, etc.). Lorsque deux termes s&#233;mantiquement reli&#233;s poss&#232;dent deux mots dont
la forme est proche, il y a de grandes chances que ces mots soient en relation morphologique.
Par exemple, la nomenclature SNOMED indique que sinusite, SAI 1 est une sorte de maladie du
sinus paranasal, SAI. On fait alors l&#8217;hypoth&#232;se que les mots {sinus, sinusite} sont en relation
morphologique. On en induit aussi qu&#8217;une r&#232;gle de substitution de suffixes &#0; &#1; ite est &#224; l&#8217;&#339;uvre et
peut s&#8217;appliquer sur d&#8217;autres couples de mots attest&#233;s du domaine. Appliqu&#233;e &#224; ces terminolo-
</p>
<p>1. SAI signifie sans autre indication.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;apport de connaissances morphologiques pour l&#8217;appariement de requ&#234;tes
</p>
<p>gies, cette m&#233;thode g&#233;n&#232;re tr&#232;s peu de bruit (3 &#224; 5 %) : la quasi-totalit&#233; des couples ainsi obtenus
concerne des mots effectivement en relation morphologique. Nous avons &#233;galement obtenu le
m&#234;me type de donn&#233;es sous forme lemmatis&#233;e (par FLEMM (Namer, 2000)) et &#233;tiquet&#233;e (avec
l&#8217;aide de l&#8217;&#233;tiqueteur de Brill ; par exemple, {phlegmon/N, phlegmoneux/A}).
Comme ressources flexionnelles pour le pr&#233;sent travail, nous avons collect&#233; les couples {forme,
lemme} produits par FLEMM pour les formes fl&#233;chies des deux terminologies ci-dessus : 2906
couples correspondant &#224; 1224 lemmes diff&#233;rents, soit 4125 formes en tout. Nous avons aussi
utilis&#233; les trois r&#232;gles les plus fr&#233;quentes de lemmatisation : r&#233;duction d&#8217;un -s, -e ou -es. Pour
les ressources d&#233;rivationnelles, nous avons tri&#233; et filtr&#233; 1910 couples lemmatis&#233;s et &#233;tiquet&#233;s
minimaux obtenus dans (Zweigenbaum &amp; Grabar, 2000) et contenant 2988 lemmes diff&#233;rents.
Le filtrage concernait d&#8217;une part les quelques pourcents d&#8217;erreurs, d&#8217;autre part les combinai-
sons de relations morphologiques, mais aussi des couples de mots qui, bien que li&#233;s d&#233;rivation-
nellement, ne doivent pas &#234;tre consid&#233;r&#233;s comme &#233;quivalents en extension de requ&#234;te dans le
domaine (par exemple, {affection/N, affectif/A}). Pour s&#233;parer d&#233;rivation et composition, nous
avons commenc&#233; par diviser ces couples en deux ensembles selon les deux cat&#233;gories syn-
taxiques en pr&#233;sence : cat&#233;gories diff&#233;rentes (plut&#244;t d&#233;rivation) vs cat&#233;gories identiques (plut&#244;t
composition savante). Nous avons ensuite ajust&#233; manuellement cette division, et collect&#233; 1024
couples d&#233;rivationnels (794 familles diff&#233;rentes, par exemple aorte, aortique, aorto) concer-
nant 1759 lemmes. L&#8217;union des couples flexionnels et d&#233;rivationnels constitue 1600 familles et
5462 formes. Nous supposerons que deux formes d&#8217;un de ces couples sont substituables en re-
cherche d&#8217;information. Notons que ces bases de connaissances lexicales n&#8217;ont pas &#233;t&#233; ajust&#233;es
particuli&#232;rement au thesaurus cible de Doc&#8217;CISMeF (le MeSH) ; ce sera fait dans une exp&#233;-
rience ult&#233;rieure. Nous avons aussi utilis&#233; ces ressources pour d&#233;clarer les &#171; mots vides &#187; de
l&#8217;appariement : les d&#233;terminants, pr&#233;positions, adverbes, verbes, pronoms et conjonctions.
Doc&#8217;CISMeF (http://doccismef.chu-rouen.fr) a d&#233;marr&#233; en juin 2000 ; en janvier 2001, il a re&#231;u
en moyenne plus de 1200 requ&#234;tes par jour de 400 usagers distincts. Nous avons extrait du
&#171; log &#187; des requ&#234;tes toutes celles qui correspondaient &#224; une recherche de termes (en supprimant
celles de l&#8217;&#233;quipe CISMeF). L&#8217;exp&#233;rimentation pr&#233;sent&#233;e ici concerne les 6469 requ&#234;tes diff&#233;-
rentes recueillies pour septembre 2000. La moiti&#233; (50 %) de ces requ&#234;tes comporte un seul mot,
29 % 2 mots, 14 % 3 mots, 5 % 4 mots et 2 % (143) comptent plus de 4 mots. Les termes cible
sont ceux du MeSH fran&#231;ais (19 971 termes, leurs synonymes et 83 qualificatifs) augment&#233;s de
38 &#171; m&#233;tatermes &#187; et 101 &#171; types de ressources &#187;, soit 28 922 termes en tout (32 % comptent 1
mot, 40 % 2 mots, 18 % 3 mots, 6 % 4 mots et 3 % &#0; 4 mots).
Le processus maximal d&#8217;appariement entre requ&#234;te et termes cible que nous allons tester est
le suivant. Les termes cible sont pr&#233;-index&#233;s : chaque terme est mis en minuscules, segment&#233;
en mots (formes) et consid&#233;r&#233; comme un ensemble de mots (l&#8217;ordre n&#8217;y est plus pertinent).
La forme d&#233;saccentu&#233;e de ces termes est elle aussi segment&#233;e et index&#233;e. Chaque requ&#234;te est
mise en minuscules et segment&#233;e en mots, et les mots vides sont supprim&#233;s. Le principe de
base de l&#8217;appariement est de proposer les termes qui contiennent le maximum de mots de la
requ&#234;te, sans tenir compte de leur position (m&#233;thode [ordre]). Plusieurs termes cible peuvent
&#234;tre n&#233;cessaires pour &#171; couvrir &#187; les diff&#233;rents mots d&#8217;une requ&#234;te. Nous s&#233;lectionnons tour &#224;
tour (algorithme glouton) le terme cible couvrant le maximum des mots restants de la requ&#234;te.
L&#8217;appariement est test&#233; sur les mots, &#233;ventuellement augment&#233;s (extension de requ&#234;te) de : &#1; &#2; &#3;
leur forme d&#233;saccentu&#233;e [accent] ; &#1; &#2; &#2; &#3; leurs formes fl&#233;chies [flex] ; &#1; &#2; &#2; &#2; &#3; leurs mots d&#233;riv&#233;s (et
leurs formes fl&#233;chies) [deriv]. Les exp&#233;riences pratiqu&#233;es, comme dans (Gaussier et al., 2000),
consistent &#224; ne brancher qu&#8217;une partie des &#233;tapes ([ordre] puis [accent] puis [flex] puis [deriv])
pour &#233;tudier les diff&#233;rences de r&#233;sultats.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Natalia Grabar, Stefan Darmoni
</p>
<p>3 Exp&#233;riences d&#8217;appariement
</p>
<p>Nous avons effectu&#233; deux types d&#8217;observations. D&#8217;une part, l&#8217;influence quantitative de l&#8217;ap-
port des diff&#233;rents param&#232;tres d&#8217;appariement (variantes d&#8217;accentuation, flexion, d&#233;rivation) sur
les r&#233;sultats renvoy&#233;s : combien de r&#233;ponses sont diff&#233;rentes lorsque telle ou telle m&#233;thode est
ajout&#233;e. D&#8217;autre part, l&#8217;effet de ces m&#233;thodes, lorsqu&#8217;elles changent la r&#233;ponse obtenue, sur la
correction de cette r&#233;ponse. Sur les 6469 requ&#234;tes, 182 sont exactement des termes cible ; 1315
sont identiques &#224; des termes cible une fois mises en minuscules et segment&#233;es ; 1364 lorsqu&#8217;on
les consid&#232;re comme des sacs de mots [ordre] ; et 1679 une fois d&#233;saccentu&#233;es [accent] (26 %).
Du fait que la terminologie cible est non accentu&#233;e, cette d&#233;saccentuation joue un r&#244;le tr&#232;s im-
portant : 971 requ&#234;tes sur 6469 (15,0 %) ont des r&#233;sultats diff&#233;rents une fois d&#233;saccentu&#233;es.
Nous nous sommes focalis&#233;s ici sur l&#8217;influence de la flexion et de la d&#233;rivation.
</p>
<p>R&#233;sultats. On observe que la flexion ([accent] &#0; [flex]) influe sur un nombre cons&#233;quent de
requ&#234;tes : 429 sur 6469 (6,6 %) voient leur r&#233;sultat changer. 199 s&#233;ries diff&#233;rentes de formes fl&#233;-
chies ont &#233;t&#233; employ&#233;es. Il faut remarquer cependant que la quasi-totalit&#233; de l&#8217;intervention de la
flexion provient des r&#232;gles (403 occurrences ; 123 applications diff&#233;rentes du suffixe -s, et 48 du
-e). Les quelques autres cas de flexion appliqu&#233;s concernent des f&#233;minins : if &#1; ive (6 occ.), el &#1; elle
(3 occ.), ien &#1; ienne (2 occ.), on &#1; onne (1 occ.), blanc &#1; blanche (1 occ.), eux &#1; euse (1 occ.). L&#8217;apport
suppl&#233;mentaire de la d&#233;rivation concerne un nombre plus faible, mais non n&#233;gligeable, de re-
qu&#234;tes : 128 (2,0 %). Rappelons que les mots d&#233;riv&#233;s propos&#233;s sont uniquement ceux pr&#233;sents
dans la base lexicale constitu&#233;e ci-dessus ; nous n&#8217;avons pas ici utilis&#233; de r&#232;gles pour d&#233;tecter
dynamiquement d&#8217;autres d&#233;rivations. On peut donc supposer que davantage de d&#233;rivations se-
raient potentiellement applicables. Par ailleurs, nous avons effectu&#233; les m&#234;mes mesures sur les
autres mois du log (octobre 2000 &#8211; janvier 2001), avec le m&#234;me type de r&#233;sultat.
&#201;valuation. L&#8217;&#233;valuation manuelle a &#233;t&#233; faite par un informaticien m&#233;dical et deux biblio-
th&#233;caires m&#233;dicaux de l&#8217;&#233;quipe CISMeF. Les requ&#234;tes comportant des fautes de frappe ont &#233;t&#233;
&#233;cart&#233;es de cet examen. Pour avoir une id&#233;e de la qualit&#233; g&#233;n&#233;rale de l&#8217;appariement et de la
difficult&#233; de la t&#226;che, les r&#233;sultats de 58 requ&#234;tes contenant au moins 2 mots, qui n&#8217;&#233;taient pas
exactement des termes cible et ne comportaient pas de faute d&#8217;orthographe, ont &#233;t&#233; examin&#233;s.
Chaque r&#233;sultat a &#233;t&#233; not&#233; de 0 (tr&#232;s mauvais) &#224; 3 (tr&#232;s bon). La note moyenne a &#233;t&#233; de 1,7,
avec un &#233;cart-type de 1,2. Les requ&#234;tes dont les r&#233;sultats ont chang&#233; avec l&#8217;apport de connais-
sances morphologiques ont &#233;t&#233; examin&#233;es. Une &#233;valuation a port&#233; sur un petit &#233;chantillon de 20
requ&#234;tes sur les 429 modifi&#233;es par la flexion. Leur note moyenne a augment&#233; de 0,53 &#224; 1,07.
Pour la d&#233;rivation, l&#8217;&#233;valuation a port&#233; sur 64 des 128 requ&#234;tes concern&#233;es. La note moyenne
obtenue a augment&#233; de 1,14 &#224; 1,91 sur 3, une am&#233;lioration substantielle.
</p>
<p>Le tableau 1 donne quelques exemples d&#8217;apport de connaissances d&#233;rivationnelles. Les am&#233;lio-
rations peuvent porter aussi bien sur la pr&#233;cision que sur le rappel (nous s&#233;parons les r&#233;ponses
multiples par une barre oblique). Nous revenons sur ces r&#233;sultats dans la discussion.
</p>
<p>4 Discussion
</p>
<p>En r&#233;sum&#233;, ces premi&#232;res &#233;valuations montrent un apport faible mais r&#233;el de la flexion (lem-
matisation) et de la d&#233;rivation (racinisation) dans une t&#226;che d&#8217;appariement de requ&#234;tes &#224; des
termes normalis&#233;s. L&#8217;une comme l&#8217;autre, lorsqu&#8217;elle agit, am&#233;liore en moyenne les r&#233;ponses
aux requ&#234;tes. Dans nos conditions d&#8217;exp&#233;rience, la flexion agit dans 6,6 % des cas avec une</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;apport de connaissances morphologiques pour l&#8217;appariement de requ&#234;tes
</p>
<p>Requ&#234;te R&#233;ponse sans d&#233;rivation R&#233;ponse avec d&#233;rivation
hematome pelvien hematome / membre pelvien hematome / pelvis
tumeur du glomus glomus carotidien, tumeur glomique, tumeur
recto colite colite colite / rectum
kyste du rein rein / kyste arachnoide rein kystique
stenose valve aorte stenose isthmique aorte congenitale
</p>
<p>/ prolapsus valve aortique
stenose aortique valvulaire
</p>
<p>tumeur bronchique face, tumeur / fistule bronchique tumeur bronche
interactions entre m&#233;di-
caments et alimentation
</p>
<p>interactions aliment-medicament /
alimentation adolescent
</p>
<p>interactions aliment-medicament
</p>
<p>TAB. 1 &#8211; Exemples de l&#8217;apport de connaissances d&#233;rivationnelles
</p>
<p>am&#233;lioration mod&#233;r&#233;e, et la d&#233;rivation dans 2,0 % des cas avec une am&#233;lioration plus nette.
Cette diff&#233;rence pourrait &#234;tre li&#233;e aux choix diff&#233;rents effectu&#233;s pour ces deux types de connais-
sances morphologiques. En effet, l&#8217;emploi de r&#232;gles (non valid&#233;es : -s et -e) en lemmatisation
produit davantage de r&#233;sultats, mais aussi davantage de bruit (par exemple, Dublin core &#0; cor
triatriatum). Pour la d&#233;rivation, nous avons uniquement employ&#233; des couples de mots valid&#233;s
(nous avons gard&#233; en r&#233;serve les r&#232;gles li&#233;es &#224; ces couples de mots), pour lesquels les erreurs
d&#8217;application sont plus rares (notes personnelles &#0; personne agee).
Les r&#233;sultats pr&#233;sent&#233;s ici sont difficiles &#224; comparer &#224; ceux de (Gaussier et al., 2000), car les
t&#226;ches abord&#233;es sont diff&#233;rentes. (Gaussier et al., 2000) travaillent sur une t&#226;che classique de
recherche d&#8217;information : une requ&#234;te &#233;tant donn&#233;e, on ordonne les documents de la base en
fonction de leur pertinence esp&#233;r&#233;e pour cette requ&#234;te. On peut alors mesurer la pr&#233;cision &#224;
divers taux de rappel selon le nombre de documents que l&#8217;on conserve dans la r&#233;ponse du
syst&#232;me. Dans la t&#226;che que nous avons examin&#233;e, les &#171; documents &#187; sont les termes cible ; cette
t&#226;che vise &#224; produire un ensemble minimal de termes contr&#244;l&#233;s &#171; couvrant &#187; les mots de la
requ&#234;te fournie. Une seule r&#233;ponse est donc ramen&#233;e : en termes de recherche documentaire,
elle constituerait un ensemble de documents dont chacun contient une partie de la r&#233;ponse. Au-
del&#224; de son &#233;valuation intrins&#232;que en tant que projection d&#8217;expressions libres sur un thesaurus
contr&#244;l&#233;, cette t&#226;che est utile dans une cha&#238;ne plus large de recherche d&#8217;information dont le but
est de trouver les sites Web de l&#8217;annuaire CISMeF qui sont pertinents pour la requ&#234;te initiale.
La projection sur le thesaurus MeSH n&#8217;est alors que l&#8217;un des aspects qui doivent contribuer &#224;
identifier ces sites : &#224; cet acc&#232;s par indexation contr&#244;l&#233;e peut s&#8217;ajouter entre autres la prise en
compte d&#8217;une indexation plus traditionnelle en texte int&#233;gral.
</p>
<p>Au-del&#224; de ces premiers r&#233;sultats, nous estimons que l&#8217;application de ces connaissances mor-
phologiques peut encore &#234;tre affin&#233;e. L&#8217;examen d&#233;taill&#233; des situations d&#8217;erreur montre qu&#8217;une
partie importante du bruit est caus&#233; par des termes complexes dont un seul mot &#233;tait pr&#233;sent
dans la requ&#234;te : tumeur bronchique &#0; face, tumeur, ou encore grands br&#251;l&#233;s &#0; grands singes,
maladies (ou, avec flexion, grands br&#251;l&#233;s &#0; grande bretagne !). Nous avons donc mis en place
un crit&#232;re compl&#233;mentaire de s&#233;lection des termes cible qui &#233;limine ceux qui contiennent des
mots non vides qui ne figurent pas dans la requ&#234;te. Lorsque ce crit&#232;re est activ&#233;, la flexion n&#8217;in-
flue plus que sur 256 requ&#234;tes sur 6469 (4,0 %) ; nous en avons examin&#233; la moiti&#233; : dans 85 %
des cas, la flexion am&#233;liore les r&#233;sultats, en d&#233;tectant un terme suppl&#233;mentaire (74 %) ou en
rempla&#231;ant un terme par un autre plus pr&#233;cis (11 %). Les autres cas (15 %) correspondent &#224;
l&#8217;ajout d&#8217;un terme erron&#233;. La d&#233;rivation influe pour 106 requ&#234;tes (1,6 %), que nous avons toutes
examin&#233;es ; 83 % ont de meilleurs r&#233;sultats, dont 8 % par pr&#233;cision d&#8217;un terme. Au total donc,
5,6 % des requ&#234;tes sont concern&#233;es par flexion ou d&#233;rivation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pierre Zweigenbaum, Natalia Grabar, Stefan Darmoni
</p>
<p>Le filtrage suppl&#233;mentaire mis en place ici rend plus clair l&#8217;apport de la morphologie : l&#8217;aug-
mentation de rappel obtenue pour 4,7 % des requ&#234;tes s&#8217;accompagne de peu d&#8217;augmentation de
bruit (0,9 % des requ&#234;tes). Cette exp&#233;rience compl&#233;mentaire illustre comment la sp&#233;cification
de la t&#226;che et l&#8217;intervention d&#8217;autres crit&#232;res de s&#233;lection des r&#233;ponses peuvent modifier l&#8217;apport
diff&#233;rentiel des connaissances morphologiques en recherche d&#8217;information.
</p>
<p>Une d&#233;monstration de l&#8217;outil d&#8217;appariement de requ&#234;tes pr&#233;sent&#233; ici est en ligne &#224; l&#8217;adresse
http://www.biomath.jussieu.fr/cismef/.
</p>
<p>R&#233;f&#233;rences
DAILLE B. (1999). Identification des adjectifs relationnels en corpus. In P. AMSILI, Ed., Actes de TALN
1999 (Traitement automatique des langues naturelles), p. 105&#8211;114, Carg&#232;se: ATALA.
DARMONI S. J., LEROY J.-P., THIRION B., BAUDIC F., DOUYERE M. &amp; PIOT J. (2000). CISMeF: a
structured health resource guide. Methods of Information in Medicine, 39(1), 30&#8211;35.
GAUSSIER E. (1999). Unsupervised learning of derivational morphology from inflectional lexicons.
In A. KEHLER &amp; A. STOLCKE, Eds., ACL workshop on Unsupervised Methods in Natural Language
Learning, College Park, Md.
GAUSSIER E., GREFENSTETTE G., HULL D. &amp; ROUX C. (2000). Recherche d&#8217;information en fran&#231;ais
et traitement automatique des langues. Traitement automatique des langues, 41(2), 473&#8211;493.
GRABAR N. &amp; ZWEIGENBAUM P. (2000). Automatic acquisition of domain-specific morphological
resources from thesauri. In Proceedings of RIAO 2000: Content-Based Multimedia Information Access,
p. 765&#8211;784, Paris, France: C.I.D.
HAMON T., NAZARENKO A. &amp; GROS C. (1998). A step towards the detection of semantic variants
of terms in technical documents. In C. BOITET, Ed., Proceedings of the 17 &#0; &#1; COLING, p. 498&#8211;504,
Montr&#233;al, Canada.
</p>
<p>HATHOUT N. (2001). Analogies morpho-synonymiques. In D. MAUREL, Ed., Actes de TALN 2001
(Traitement automatique des langues naturelles), Tours: ATALA et Universit&#233; de Tours.
HATHOUT N., NAMER F. &amp; DAL G. (2001). An experimental constructional database: the MorTAL
project. In P. BOUCHER, Ed., Morphology book. Cambridge, Mass.: Cascadilla Press. &#192; para&#238;tre.
INSERM (2000). Th&#233;saurus Biom&#233;dical Fran&#231;ais/Anglais. Institut National de la Sant&#233; et de la Re-
cherche M&#233;dicale, Paris.
</p>
<p>JACQUEMIN C. (1997). Variation terminologique : Reconnaissance et acquisition automatique de
termes et de leurs variantes en corpus. M&#233;moire d&#8217;habilitation &#224; diriger des recherches, Universit&#233;
de Nantes.
JACQUEMIN C. &amp; TZOUKERMANN E. (1999). NLP for term variant extraction: A synergy of morpho-
logy, lexicon, and syntax. In T. STRZALKOWSKI, Ed., Natural Language Processing and Information
Retrieval, p. 25&#8211;74. Boston, Mass: Kluwer.
NAMER F. (2000). FLEMM : un analyseur flexionnel du fran&#231;ais &#224; base de r&#232;gles. Traitement Automa-
tique des Langues, 41(2), 523&#8211;547.
ZWEIGENBAUM P. &amp; GRABAR N. (2000). Liens morphologiques et structuration de terminologie. In
IC 2000 : Ing&#233;nierie des connaissances, p. 325&#8211;334.</p>

</div></div>
</body></html>