<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Repr&#233;senter le temps en langue dans le formalisme des graphes conceptuels une approche bas&#233;e sur les sch&#232;mes s&#233;mantico-cognitifs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2001, Tours, 2-5 juillet 2001
</p>
<p>Repr&#233;senter le temps en langue dans le formalisme des
graphes conceptuels
</p>
<p>une approche bas&#233;e sur les sch&#232;mes s&#233;mantico-cognitifs
</p>
<p>Tassadit Amghar(1), Delphine Battistelli(2) et Thierry Charnois(3)
(1) LERIA, Universit&#233; d&#8217;Angers, 2 bd Lavoisier, 49045 Angers Cedex 01
</p>
<p>Tassadit.Amghar@univ-angers.fr
(2) Equipe LaLic, Universit&#233; Paris-Sorbonne, 96 bd Raspail, 75006 Paris
</p>
<p>Delphine.Battistelli@paris4.sorbonne.fr
(3) LIPN, Universit&#233; Paris 13, Av. J.-B. Cl&#233;ment, 93430 Villetaneuse
</p>
<p>Thierry.Charnois@lipn.univ-paris13.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>L&#8217;objectif de notre travail est de construire une repr&#233;sentation s&#233;mantique d&#8217;un corpus de textes
fran&#231;ais au sein des graphes conceptuels simples. Notre conceptualisation est fond&#233;e sur les
Sch&#232;mes S&#233;mantico-Cognitifs et la th&#233;orie aspecto-temporelle introduits par J. P. Descl&#233;s. Un
texte est repr&#233;sent&#233; par deux structures. La premi&#232;re mod&#233;lise la repr&#233;sention semantico-
cognitive des propositions du texte, et la seconde le diagramme temporel exprimant les con-
traintes temporelles entre les diff&#233;rentes situations d&#233;crites dans le texte. La prise en compte
de ces deux structures et des liens qu&#8217;elles entretiennent nous a amen&#233;s &#224; modifier le mod-
&#232;le des graphes conceptuels simples et &#224; envisager les modes d&#8217;interaction entre temps, aspect
(grammatical) et significations des lex&#232;mes verbaux.
We propose here a system which deals with time, aspect and verbal meanings in natural lan-
guage processing within Simple Conceptual Graphs on the basis of the Semantico-Cognitive
Schemes and the aspecto-temporal theory both introduced by J-P. Descl&#233;s. Our work bears on
French texts. A text is represented by two different structures both represented within the SCG
model. The first one models the semantico-cognitive representation while the second one is the
temporal diagram representing the temporal constraints between the situations described in the
text. Linking these structures leads us to slightly extend the original SCG model.
</p>
<p>Mots cl&#233;s - Keywords
</p>
<p>Temps linguistique - Valeurs Aspectuelles - Sch&#232;mes S&#233;mantico-Cognitifs - Graphes Con-
ceptuels
</p>
<p>Linguistic time - Aspectual values - Semantico-Cognitive Schemes - Conceptual graphs</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tassadit Amghar, Delphine Battistelli et Thierry Charnois
</p>
<p>1 Introduction
</p>
<p>L&#8217;objectif g&#233;n&#233;ral de notre travail est de traiter du temps linguistique dans le cadre de raison-
nements automatiques &#224; partir de repr&#233;sentations associ&#233;es &#224; des textes narratifs extraits d&#8217;un
corpus de constats d&#8217;accidents. Le texte (A) compos&#233; de six propositions est extrait de notre
corpus.
Texte (A). (1)Etant arr&#234;t&#233; momentan&#233;ment sur la file droite du Bd des Italiens, (2)j&#8217;avais mis mon clig-
notant, (3)j&#8217;&#233;tais &#224; l&#8217;arr&#234;t. (4)Le v&#233;hicule B arrivant sur ma gauche (5)m&#8217;a serr&#233; de trop pr&#232;s et (6)m&#8217;a
ab&#238;m&#233; tout le c&#244;t&#233; avant gauche.
La mise en oeuvre de tels raisonnements n&#233;cessite de r&#233;aliser des inf&#233;rences &#224; partir de l&#8217;informa-
tion aspecto-temporelle (Bestougeff, Ligozat, 1989). Il semble alors essentiel de disposer d&#8217;un
niveau de description lexicale et grammaticale suffisamment fin, d&#8217;une part, et d&#8217;un langage de
repr&#233;sentation adapt&#233; et permettant de r&#233;aliser des inf&#233;rences de sens commun, d&#8217;autre part. Les
Sch&#232;mes Semantico-Cognitifs (Descl&#233;s, 1990) et la th&#233;orie aspectuelle (Descl&#233;s, 1989) permet-
tent de r&#233;pondre au premier point et constituent les fondements linguistiques de notre travail.
Une premi&#232;re approche permettant de construire la repr&#233;sentation s&#233;mantico-cognitive d&#8217;un
texte en tenant compte des significations lexicales et de la temporalit&#233; narrative a &#233;t&#233; propos&#233;e
dans (Battistelli, Vazov, 1997) ; elle a &#233;t&#233; d&#233;velopp&#233;e par la suite dans (Battistelli, 2000) en vue
d&#8217;associer &#224; un texte une s&#233;quence d&#8217;images en illustrant la signification. Pour r&#233;pondre &#224; la n&#233;-
cessit&#233; de r&#233;aliser des inf&#233;rences de sens commun nous avons choisi le formalisme des graphes
conceptuels [(Sowa, 1984) (Chein, Mugnier, 1992)]. Il fournit en effet un bon compromis entre
capacit&#233;s inf&#233;rentielles et pouvoir expressif tout en pr&#233;servant des propri&#233;t&#233;s formelles de com-
pl&#233;tude et de coh&#233;rence. Nous proposons donc un syst&#232;me r&#233;alisant la transformation d&#8217;une
Repr&#233;sentation S&#233;mantico-Cognitive d&#8217;un texte en sa repr&#233;sentation sous forme d&#8217;un graphe
conceptuel simple. La section 2 pr&#233;sente les fondements linguistiques de notre travail. La sec-
tion 3 pr&#233;sente les principes de construction de ces structures exhib&#233;es dans la section 2 dans
le formalisme des graphes conceptuels. Enfin la section 4 conclut sur les perspectives de notre
travail.
</p>
<p>2 Fondements linguistiques
</p>
<p>Pour rendre compte des informations spatio-temporelles pr&#233;sentes dans les constats d&#8217;accidents,
nous nous appuyons sur les travaux d&#233;velopp&#233;s par J.-P. Descl&#233;s sur la mod&#233;lisation des signifi-
cations des verbes de mouvement et d&#8217;activit&#233; (Descl&#233;s, 1990) d&#8217;une part, et sur la mod&#233;lisation
du temps linguistique (Descl&#233;s, 1989) d&#8217;autre part.
</p>
<p>2.1 Repr&#233;sentation S&#233;mantico-Cognitive (RSC) d&#8217;une proposition
La s&#233;mantique des verbes est exprim&#233;e &#224; l&#8217;aide de structures abstraites, compos&#233;es et organis&#233;es
&#224; partir de primitives s&#233;mantico-cognitives1 ; ces structures sont appel&#233;es Sch&#232;mes S&#233;mantico-
Cognitifs (SSC). La signification du verbe &quot;arriver&quot; par exemple est repr&#233;sent&#233;e par une &#0; -
expression &#224; l&#8217;aide du SSC suivant :
&#1;
</p>
<p>SSC du verbe &quot;arriver&quot;&#2;&#4;&#3;&#6;&#5;&#8;&#7; &#3;&#10;&#9; &#11; &#12; &#7; &#13;&#15;&#14;&#17;&#16;&#19;&#18;&#21;&#20;&#23;&#22; &#24;&#25;&#14;&#15;&#26;&#15;ff&#17;&#18;&#21;&#11; fifl&#22; ffi &#31; &#22;  &#5;!&#9; &#11; &#12; &quot;#&#5;&#4;&quot;$&#22; ffi &#31; &#22; %&amp;fi&#21;&#9; &#11; &#12; &quot;&#4;&#5;&#4;&quot; &quot;#&#5;
1Ces primitives sont issues d&#8217;une analyse des cat&#233;gories lexicales et grammaticales et ne sont pas lexicalis&#233;es.
</p>
<p>Elles repr&#233;sentent des &quot;ind&#233;composables&quot;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;senter le temps en langue dans le formalisme des graphes conceptuels
</p>
<p>Cette structure exprime qu&#8217;une entit&#233; x contr&#244;le (CONTR) un mouvement orient&#233; (MOUVTor)
entre deux situations statiques (Sit1 et Sit2). Dans la premi&#232;re (Sit1), &#0; est rep&#233;r&#233;e ( &#1; &#2; ) par
rapport &#224; l&#8217;ext&#233;rieur ( &#3; &#0; ) d&#8217;un lieu &#4; &#5;&#7;&#6; ; dans la seconde (Sit2), &#0; est rep&#233;r&#233;e ( &#1; &#2; ) par rapport
&#224; la fronti&#232;re ( &#8;&#10;&#9; ) du m&#234;me lieu &#4; &#5; &#6; . En contexte, les variables d&#8217;un SSC sont instanci&#233;es par
les arguments d&#8217;une relation pr&#233;dicative donn&#233;e (compos&#233;e d&#8217;un pr&#233;dicat verbal et de ses argu-
ments) ; la structure obtenue est appel&#233;e la Repr&#233;sentation S&#233;mantico-Cognitive (RSC). Dans
un texte, &#224; chaque proposition identifi&#233;e correspond alors une RSC. Soient les deux proposi-
tions:
</p>
<p>(1) la voiture arrivait dans le virage
(2) j&#8217;avais mis mon clignotant
</p>
<p>La RSC de (1) est construite &#224; partir de la relation pr&#233;dicative (RP) qui lui est sous-jacente &#224;
savoir &lt;arriver_dans, le_virage, la_voiture&gt; et du SSC de &quot;arriver&quot; en instanciant les variables
de celui-ci par les arguments de la RP, &#224; savoir /le_virage/ et /la_voiture/. Le r&#233;sultat est donn&#233;
par (1&#8217;). Le m&#234;me processus permet de construire la RSC (2&#8217;) associ&#233;e &#224; (2).
( &#11; &#12; &#13; &#14;&#16;&#15;&#18;&#17;&#20;&#19;&#22;&#21;&#24;&#23; &#25;&#26;&#15;&#16;ff&#16;fi&#22;&#19;&#22;fl ffi&#18;&#23; &#31; &#2; &#23;  !&#16;&quot;  _ # $ ffi % &amp;&#7; &#13; &quot; % _ #'fl $ ( )*ffi  &#13;+&#23; &#31; &#2; &#23; $ ,&#24;&quot;  _ # $ ffi % &amp;&#7; &#13; &quot; % _ #'fl $ ( )*ffi  &#13; &#13;&#16;&quot; % _ #'fl $ ( )*ffi  
( - &#12; &#13; &#14;&#16;&#15;&#18;&#17;&#20;&#19;&#22;&#21;.&#23; &#14;&#18;/&#20;0&#22;&#17;21&#22;&#19;&#22;fl ffi3&#23; &#31; 4 5 67&#23;  !&#24; , _ 8&#10;fl ,&#10;9 ( $ fl ,:,+ ;&#20; ,:( &#13;:&quot;  _ 9 &quot; $ &amp; ,+fl ( % ,&#10;( &#13;
</p>
<p>&#23; &#31; 4 5 6&lt;&#23; $ ,= , _ 8:fl ,+9 ( $ fl ,&#10;,&#10; ;&#20; ,&#10;( &#13;&#10;&quot;  _ 9 &quot; $ &amp; ,+fl ( % ,&#10;( &#13; &#13;*&gt;  
</p>
<p>(2&#8217;) exprime que l&#8217;entit&#233; je contr&#244;le (CONTR) un changement orient&#233; (CHANGTor) entre deux
situations statiques (Sit1 et Sit2) concernant l&#8217;entit&#233; le_clignotant, rep&#233;r&#233;e successivement ( &#1;
</p>
<p>4 5 6
</p>
<p>)
par rapport au lieu d&#8217;activit&#233; en_fonctionnement visualis&#233; dans son ext&#233;rieur (ex) en Sit1 et dans
son int&#233;rieur (in) en Sit22.
Dans (1&#8217;) et (2&#8217;), les entit&#233;s (rep&#233;r&#233;es ou servant de rep&#232;re dans une relation de rep&#233;rage) sont
typ&#233;es : la_voiture, le_clignotant et je ont le type s&#233;mantico-cognitif INDIVIDU et les entit&#233;s
le_virage et en_fonctionnement ont le type s&#233;mantico-cognitif LIEU (lieu spatial pour le pre-
mier, lieu d&#8217;activit&#233; pour le second). D&#8217;une mani&#232;re g&#233;n&#233;rale (figure 1), un SSC peut &#234;tre de
type statique (dans le cas d&#8217;une seule situation de rep&#233;rage (Sit)), cin&#233;matique (dans le cas o&#249; il
y a transition (TRANS) entre deux situations statiques(Sit1 et Sit2)) ou dynamique (dans le cas
o&#249; il s&#8217;agit d&#8217;une situation cin&#233;matique elle-m&#234;me sous le contr&#244;le d&#8217;une entit&#233;, comme dans
les exemples (1) et (2)). La figure 2 donne les 6 RSC3 associ&#233;es aux 6 propositions du texte(A).
</p>
<p>Static SSC Cinematic SSC Dynamic SSC
</p>
<p>S it
</p>
<p> ex.: j&#8217;&#233;tais dans le virage
(I was in the bend)
</p>
<p>ex.: j&#8217;arrivais dans le virage
  (I was arriving in the bend
</p>
<p>ex.: le vent soufflait
(the wind was blowing)
</p>
<p>Sit 2 S it 1
</p>
<p>x
</p>
<p>Sit 2
</p>
<p>S it 1
</p>
<p>T RA NS
</p>
<p>C ON T R
</p>
<p>T R AN S
</p>
<p>Figure 1: Typologie des SSC
</p>
<p>Afin d&#8217;exhiber les relations temporell s entre les diff&#233;rentes SC associ&#233;es aux propositions
</p>
<p>d&#8217;u texte, nous construisons le diagramme t mpor l du texte. Par illeurs nous faisons appel
</p>
<p>aux val urs asp tu les des propositions pour pren re en compte l&#8217;interaction entre as ect
</p>
<p>lexical a p ct grammatical.
</p>
<p>2
</p>
<p>un pression com e mettre son clignot nt n&#8217; xprime pas un d&#233;plac ment spatial d l&#8217;entit&#233; clignotant, mai
</p>
<p>&#8217;entr&#233;e en ctiv t&#233; du sy &#232; que d&#233;crit un clig otant. Par analogie ave les lieux pa aux n peut al r d&#233;crire
</p>
<p>s &#233;ta s d&#8217;activit&#233; d&#8217; n syst&#232;me, con&#231;us c mme d s li x, en utilisan primitive d sp&#233;cification t logiqu .
</p>
<p>3
</p>
<p>d ns lesquelle
</p>
<p>? @
</p>
<p>et
</p>
<p>? A B C
</p>
<p>r pr&#233;sentent resp ctivement
</p>
<p>D @
</p>
<p>t
</p>
<p>D A B C
</p>
<p>.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tassadit Amghar, Delphine Battistelli et Thierry Charnois
</p>
<p>RS C1 &amp;2 (eact A _L&#8217;ARRET A) (e 0 FR(la_file_dr_du_bd_des_It)  A )
</p>
<p>RS C2 CO NTR (CH AN GTor
(e act  EX (E N_FO NCTION NE ME NT)clig(A )) (e act  IN (EN _FO NCT ION NE M ENT)clig(A ))  A
</p>
<p>RS C3 (e act A_L&#8217;ARRET A )
</p>
<p>RS C4 CO NTR (M O UV Tor  (e0 E X(GAU CH E(A ) B)  (e 0 FR(G AU CHE (A ) B) )  B
</p>
<p>RS C5 CO NTR (M O UV Tor (e o (LO C A ) B)  (eo F R(LO C A) B) ) B
</p>
<p>RS C6 &amp;2 (E1&gt; E2) (CO N TR (CH AN GTor
(e 0 IN (E1) tout_le_c&#244;t&#233;_avt_gauche (A)) (e0 IN(E2) tout_le_c&#244;t&#233;_avt_gauche (A ))   B)
</p>
<p>[
</p>
<p>[
</p>
<p>[ [
</p>
<p>[
[P3
</p>
<p>P1
P2
</p>
<p>P5
P6
</p>
<p>]
]
</p>
<p>]
]
]
</p>
<p>P4
</p>
<p>[
</p>
<p>Figure 2: 2.1 RSC du texte (A) &#8212; 2.2 Diagramme temporel de (A)
</p>
<p>2.2 Valeurs aspectuelles et diagramme temporel d&#8217;un texte
</p>
<p>L&#8217;organisation conceptuelle du domaine aspecto-temporel repose sur la trichotomie &#233;tat, pro-
cessus et &#233;v&#233;nement ; cette trichotomie trouve une interpr&#233;tation dans le mod&#232;le topologique
(Descl&#233;s, 1989). La valeur aspectuelle d&#8217;une proposition est calcul&#233;e &#224; partir d&#8217;indices (gram-
maticaux et lexicaux) pr&#233;sents dans le contexte, selon une strat&#233;gie d&#8217;exploration contextuelle
pr&#233;sent&#233;e dans (Descl&#233;s et al. 91). Chaque valeur aspectuelle correspond alors &#224; une zone de
validation repr&#233;sent&#233;e par un intervalle topologique d&#8217;un certain type, situ&#233; sur un axe repr&#233;sen-
tant le r&#233;f&#233;rentiel temporel de l&#8217;&#233;nonciateur4. Une valeur d&#8217;&#233;tat est repr&#233;sent&#233;e par un intervalle
ouvert ; une valeur d&#8217;&#233;v&#233;nement par un intervalle ferm&#233; ; une valeur de processus par un in-
tervalle semi-ouvert &#224; droite5. Les relations temporelles entre intervalles sont calcul&#233;es &#224; partir
de la prise en compte de la s&#233;mantique des connecteurs temporels et d&#8217;un ensemble de r&#232;gles
appliqu&#233;es par d&#233;faut6. La figure 3 pr&#233;sente l&#8217;interaction entre les diff&#233;rentes cat&#233;gories de RSC
en fonction des diff&#233;rents types de vis&#233;e aspectuelle (de type &#233;tat, &#233;v&#233;nement ou processus) qui
peuvent &#234;tre envisag&#233;s7. Dans les rectangles gris&#233;s sont indiqu&#233;es les situations encod&#233;es lexi-
calement ; les rectangles blancs d&#233;signent les situations qui sont focalis&#233;es selon le type de la
valeur aspectuelle. Un rectangle compl&#232;tement vide indique que la situation n&#8217;est pas encod&#233;e
lexicalement i.e. qu&#8217;aucune description de cette situation n&#8217;est fournie par la signification du
pr&#233;dicat verbal et de ses arguments. La figure 2.2 fournit le diagramme temporel du texte (A).
</p>
<p>3 Information temporelle et Graphes Conceptuels Simples
</p>
<p>Nous repr&#233;sentons un texte par deux types de Graphes Conceptuels Simples (GCS). Le pre-
mier mod&#233;lise la repr&#233;sentation s&#233;mantico-cognitif du texte et le second le diagramme tem-
porel exprimant les contraintes temporelles entre les diff&#233;rentes situations d&#233;crites dans le texte.
</p>
<p>4La th&#233;orie aspecto-temporelle propos&#233;e par J.-P. Descl&#233;s se distingue &#224; la fois des travaux de (Kamp, 1979) et
de (Reichenbach, 1947). Dans le premier cas, du fait qu&#8217;elle distingue trois grands types de proc&#232;s (&#233;tat, processus
et &#233;v&#233;nement) au lieu de deux (&#233;tat et &#233;v&#233;nement chez Kamp) mais aussi du fait qu&#8217;elle propose une strat&#233;gie
explicite de calcul de ces valeurs primitives prenant en compte diff&#233;rents types de marqueurs temporels (Descl&#233;s
et al. 1991). Dans le deuxi&#232;me cas, du fait qu&#8217;elle propose d&#8217;exprimer les entit&#233;s temporelles primitives &#224; l&#8217;aide
d&#8217;intervalles (topologiques) et non de points.
</p>
<p>5Par exemple, les propositions (1) et (2) auront respectivement pour valeur aspectuelle processus et &#233;tat r&#233;sul-
tant.
</p>
<p>6r&#232;gles appliqu&#233;es en l&#8217;absence de marqueurs temporels explicites tels que les connecteurs temporels ; (Battis-
telli, 2000) pr&#233;sente en d&#233;tail l&#8217;ensemble de ces r&#232;gles ainsi que le processus de construction des RSC.
</p>
<p>7C&#8217;est &#224; ce niveau que nous abordons le probl&#232;me de l&#8217;interaction entre aspect lexical et aspect grammatical.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;senter le temps en langue dans le formalisme des graphes conceptuels
</p>
<p>CINEM
/DYNA
</p>
<p>PROCESSUS
</p>
<p>S it 1  S i t 2
</p>
<p>ex.:  j e r oul ais  vers  Mar s ei lle
</p>
<p>E VENEMENT
</p>
<p>S i t 1  S i t 2
</p>
<p>ex.: j' ai r oul &#233; j us qu'&#224;  
Mar s eil le
</p>
<p>ETAT
 (r&#233;sultatif)
</p>
<p>S i t 1  S it 2
</p>
<p>ex.:  j 'avai s  r oul &#233; j us qu'&#224; 
 Mar s eil le
</p>
<p>ETAT
 (d'activit&#233;)
</p>
<p>S it 1  S i t 2
ex.: j'&#233;tai s  e n route pour  
Ma r s eil le
</p>
<p>S TAT &#216;
E VENEMENT
</p>
<p>Sit
ex.: j' ai habit&#233;  ce tte  m aison
</p>
<p>ETAT
 (descriptif)
</p>
<p>Si t
ex .:  j'hab itais ce tte  ma ison
</p>
<p>ETAT
 (cons&#233;quent)
</p>
<p>Si t
ex .: j'avai s habit&#233;  ce tte m aison
</p>
<p>Figure 3: RSC et vis&#233;es aspectuelles
</p>
<p>Afin de repr&#233;senter et traiter l&#8217;information temporelle nous avons &#233;tendu le mod&#232;le des GCS.
L&#8217;ensemble des inf&#233;rences (i) permettant d&#8217;obtenir la repr&#233;sentation s&#233;mantique du texte &#224; partir
des RSC associ&#233;es aux propositions du texte et (ii) de sens commun s&#8217;expriment ais&#233;ment par
des op&#233;rations sur les GCS.
</p>
<p>3.1 Pr&#233;sentation du mod&#232;le des GCS
</p>
<p>Le mod&#232;le des GCS d&#233;crits ici est d&#233;fini par (Chein, Mugnier, 1992). Intuitivement, un Graphe
conceptuel simple est un graphe poss&#232;dant deux types de sommets : les sommets concepts et
les sommets relations pour repr&#233;senter le lien unissant deux concepts. Les concepts et les rela-
tions conceptuelles sont organis&#233;s en une structure de treillis formant l&#8217;ontologie du domaine.
Formellement :
</p>
<p>Definition 3.1 Un graphe conceptuel simple
&#0;&#2;&#1;&#2;&#3; &#4;&#6;&#5; &#7;&#8;&#5; &#9;&#10;&#5; &#11;&#8;&#12; &#13; &#14;&#16;&#15;
</p>
<p>est un graphe biparti, &#233;ti-
quet&#233; et non n&#233;cessairement connexe.
</p>
<p>&#4;
</p>
<p>est l&#8217;ensemble des sommets relations (r-sommets) et
&#7;
</p>
<p>est l&#8217;ensemble des sommets concepts (c-sommets). Tout sommet &#17;&#19;&#18; &#4;&#19;&#20;&#21;&#7; poss&#232;de une
&#233;tiquette
</p>
<p>&#11;&#8;&#12; &#13; &#14;&#22;&#3;
</p>
<p>&#17;
</p>
<p>&#15;
</p>
<p>. L&#8217;&#233;tiquette d&#8217;un c-sommet est un couple
&#3; &#12; &#23; &#24;&#26;&#25;&#16;&#3; ff &#15; &#5; fiffifl&#16;&#31; &#14; !&#26;&#25; !&#26;&#31;&quot;&#3; ff &#15; &#15;
</p>
<p>: type(c)
&#18;$#&amp;% o&#249; #'% est un treillis de types de concepts, et
</p>
<p>fi(fl&quot;&#31; &#14; !&#26;&#25; !&#26;&#31;&#22;&#3; ff &#15;
</p>
<p>&#18;&#21;)
</p>
<p>&#20;$* +&quot;,
</p>
<p>o&#249; I est l&#8217;ensemble
des marqueurs individuels et * le marqueur g&#233;n&#233;rique. Les marqueurs individuels sont deux
&#224; deux incomparables et * est plus grand que tous les marqueurs individuels. L&#8217;ensemble des
&#233;tiquettes de C est donc ordonn&#233; par un treillis
</p>
<p>&#3;
</p>
<p>#'%
</p>
<p>&#5; -.&#15;
</p>
<p>. Si
&#31;
</p>
<p>&#18;
</p>
<p>&#4;
</p>
<p>alors
&#11;&#8;&#12; &#13; &#14;&quot;&#3; &#31;&#16;&#15;
</p>
<p>&#18;/#'0 o&#249; #&amp;0 est
un ensemble partitionn&#233; en ensembles de types de relations de m&#234;me arit&#233; : #10
</p>
<p>&#1;
</p>
<p>#&amp;0&#26;2&amp;3 3 3 #'0&#16;4
</p>
<p>o&#249; #&amp;0&#16;5 est l&#8217;ensemble partiellement ordonn&#233; des relations d&#8217;arit&#233; 6 , 6/7
&#1;98
</p>
<p>. Deux relations com-
parables doivent avoir la m&#234;me arit&#233;. Une signature est associ&#233;e &#224; chaque type de relation ;
elle sp&#233;cifie l&#8217;arit&#233; et les types maximaux que la relation peut lier. U est l&#8217;ensemble des ar&#234;tes.
L&#8217;ensemble des ar&#234;tes adjacentes &#224; chaque r-sommet r est num&#233;rot&#233; de 1 &#224; degr&#233;(r).
</p>
<p>Ce mod&#232;le est utilis&#233; pour repr&#233;senter le diagramme temporel du texte (DT). Il est &#233;tendu pour
int&#233;grer l&#8217;information temporelle extraite des propositions du texte.
</p>
<p>3.2 Les marqueurs temporels
</p>
<p>Nous repr&#233;sentons l&#8217;information temporelle par un marqueur sp&#233;cifique. Un sommet concept
est ainsi &#233;tiquet&#233; par un triplet &lt;type,marqueur1,marqueur2&gt; o&#249; type et marqueur1 correspon-
dent respectivement au type et au marqueur de la d&#233;finition ci-dessus, et marqueur2 est un
marqueur aspecto-temporel. Il faut noter que ce deuxi&#232;me marqueur est un marqueur individuel</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tassadit Amghar, Delphine Battistelli et Thierry Charnois
</p>
<p>Lattice of concept types
</p>
<p>Univ
</p>
<p>Entite Operateur-Topol PredicatPrimitif Attribut Modif Sit
</p>
<p>Lieu Individu Collectif IN EX FR FE a_l_arret ChangTor MouvTor MouvNor
</p>
<p>Treillis des types de relations
</p>
<p>Univ
</p>
<p>Transition Topo RelateurStatique RelateurDynamique Ingredient Determination
</p>
<p>Epsi0 EpsiAct Contr Faire
</p>
<p>Figure 4: Extrait des treillis de concepts et de relations (le plus petit &#233;l&#233;ment - le type absurde -
est omis pour all&#233;ger les figures)
</p>
<p>de l&#8217;ensemble des marqueurs de DT. Dans notre application, ce marqueur joue le r&#244;le de lien
co-r&#233;f&#233;rent entre l&#8217;intervalle temporel associ&#233; &#224; la proposition du texte dans DT et les valeurs
aspecto-temporelles de la RSC correspondante. Formellement, la d&#233;finition 3.1 est modifi&#233;e
comme suit :
</p>
<p>Definition 3.2 L&#8217;&#233;tiquette d&#8217;un c-sommet est un triplet (type(c), marqueur1(c), marqueur2(c))
o&#249; &#0;&#2;&#1;&#4;&#3;&#6;&#5; &#7;&#9;&#8; &#7;&#9;&#3;&#4;&#10;&#12;&#11; &#13; &#14;&#16;&#15;&#18;&#17;&#6;&#19;&#21;&#20;&#23;&#22;&#6;&#24;&#12;&#25; et &#0;&#2;&#1;&#4;&#3;&#6;&#5; &#7;&#9;&#8; &#7;&#9;&#3;&#6;&#26;&#21;&#11; &#13; &#14;&#16;&#15;&#18;&#17;&#4;&#19; &#19; . &#17;&#4;&#19; est l&#8217;ensemble des marqueurs indi-
viduels et &#17;&#4;&#19; &#19; est l&#8217;ensemble des marqueurs individuels de DT et &#17;&#12;&#19;&#6;ff&#2;&#17;&#4;&#19; &#19;&#9;fifl&#22;&#4;&#25; .
</p>
<p>&#0;ffi&#1;&#4;&#3;&#6;&#5; &#7;&#9;&#8; &#7;&#9;&#3;&#6;&#26; ne peut pas &#234;tre le marqueur g&#233;n&#233;rique. Il repr&#233;sente un marqueur temporel :
lorsque pour un c-sommet donn&#233; cette information n&#8217;est pas instanci&#233;e, le marqueur &#31; &#15; &#17;&#21;&#19; &#19; est
utilis&#233; par convention afin d&#8217;emp&#234;cher la fusion de deux sommets ayant m&#234;me type et m&#234;me
marqueur1, mais ayant des marqueur2 diff&#233;rents : nous faisons l&#8217;hypoth&#232;se que le &quot;m&#234;me&quot;
objet consid&#233;r&#233; &#224; des &#8220;moments diff&#233;rents&#8221; doit correspondre &#224; diff&#233;rentes repr&#233;sentations. La
comparaison entre deux c-sommets est ainsi d&#233;finie :
</p>
<p>Definition 3.3 !#&quot;&#6;$ &#8; %&#9;&amp;'&#8;(fi)&#11; &amp; * &#0;,+ * &#0;ffi- &#14;#&#8; &amp;'&#8; &#19;&#9;fi)&#11; &amp; &#19; * &#0;.&#19; + * &#0;ffi&#19;- &#14; deux &#233;tiquettes de deux c-sommets,
&#8;(/&#18;&#8; &#19; si et seulement si &amp;0/1&amp; &#19; et &#11; &#0;ffi&#19; + fi&#18;&#24; &quot; &#7;2&#0;,+3fi4&#0;ffi&#19;+ &#14;5&#8; &amp;6&#0;ffi-0fi&#18;&#0;.&#19;-
</p>
<p>Definition 3.4 Fusion. Deux sommets d&#8217;&#233;tiquettes &#8; and &#8; &#19; sont fusionnables s&#8217;il existe un
sommet diff&#233;rent du type absurde et d&#8217;&#233;tiquette &#8; &#19; &#19; tel que &#8; &#19; &#19;7/4&#8; et &#8; &#19; &#19;&#9;/&#18;&#8; &#19; .
La fusion de deux sommets consiste &#224; les identifier en l&#8217;unique sommet qui est la borne in-
f&#233;rieure de leurs &#233;tiquettes.
</p>
<p>Les d&#233;finitions 3.3 et 3.4 permettent de conserver les d&#233;finitions de (Chein, Mugnier, 1992) et
(Charnois, 2000) concernant les op&#233;rations d&#8217;isojointure maximale et de projection d&#233;finies sur
les GCS. Calculer une isojointure maximale entre deux GCS, 8 et 9 , consiste &#224; trouver une
bijection : entre deux sous-GCS maximaux 8 &#10;&lt;; 8 et 9 &#10;,; 9 telle que les graphes sous-
jacents de 8 &#10; and 9 &#10; sont isomorphiques et pour tout = &#15; 8 &#10; , : &#11; = &#14;&gt;&#15; 9 &#10; , et = et : &#11; = &#14; sont
fusionnables. Le GC r&#233;sultant est obtenu en fusionnant chaque sommet = de G1 avec : &#11; = &#14; .</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;senter le temps en langue dans le formalisme des graphes conceptuels
</p>
<p>3.3 La repr&#233;sentation des intervalles
</p>
<p>Nous utilisons des intervalles typ&#233;s par des bornes ouvertes ou ferm&#233;es afin de repr&#233;senter
l&#8217;information aspectuelle (&#233;tat, &#233;v&#233;nement, processus). Les relations entre intervalles que nous
avons impl&#233;ment&#233;es sont celles propos&#233;es par (Allen, 1983).
</p>
<p>ETAT : ]----[
type ETAT(x) is [point]-&gt;(])-&gt;[intervalle: *x] -&gt;([)-&gt;[point]
</p>
<p>EVENEMENT : [----]
type EVENEMENT(x) is [point]-&gt;([)-&gt;[intervalle: *x] -&gt;(])-&gt;[point]
</p>
<p>PROCESSUS : [----[
type PROCESSUS(x) is [point]-&gt;([)-&gt;[intervalle: *x]-&gt;([)-&gt;[point]
</p>
<p>Nous exprimons les relations d&#8217;Allen sous forme de d&#233;finitions de relations, par exemple : 8
</p>
<p>relation BEFORE(x,y) is [point:*p1]-&gt;(|)-&gt;[proc&#232;s: *x]-&gt;(|)-&gt;
[point:*p2]-&gt;(&lt;)-&gt;[point:*p3]-&gt;(|)-&gt;[proc&#232;s: *y]-&gt;(|)-&gt;[point:*p4]
</p>
<p>relation MEETS(x,y) is [point:*p1]-&gt;(|)-&gt;[proc&#232;s: *x]-&gt;(|)-&gt;
[point*p2]-&gt;(|)-&gt;[proc&#232;s: *y]-&gt;(|)-&gt;[point:*p3]
</p>
<p>Ces primitives permettent de repr&#233;senter le diagramme temporel du texte.
</p>
<p>3.4 Notre syst&#232;me
</p>
<p>La repr&#233;sentation finale du texte est r&#233;alis&#233;e par trois modules qui, &#224; partir de la RSC de chaque
proposition textuelle et du DT, g&#233;n&#232;rent deux GCS. Ils repr&#233;sentent respectivement les infor-
mations s&#233;mantiques et temporelles. L&#8217;ontologie utilis&#233;e (figure 4) est celle propos&#233;e par J-P.
Descl&#233;s. Nous avons impl&#233;ment&#233; en Prolog un analyseur DCG. Il traduit une RSC en un GCS
selon la grammaire donn&#233;e par la figure 5. Les GCS ainsi obtenus ne contiennent que des infor-
mations d&#8217;ordre lexical. L&#8217;information aspecto-temporelle est propag&#233;e par le second module.
</p>
<p>RSC0 -&gt; RSCDynamique | RSCCinematique | RSCStatique
RSC0 -&gt; &amp;2 RSC0 RSC0
RSCDynamique -&gt; AGTV(MODIF(SIT SIT)) INDIVIDU
RSCCinematique-&gt;MODIF(SIT SIT)
RSCStatique-&gt;SIT
SIT-&gt;(RelateurStatique Y X)
X -&gt; ENTITE3
Y -&gt; Op&#233;rateurTopologique(ENTITE2) | ENTITE1
ENTITE1-&gt;ATTRIBUT(INDIVIDU) | INDIVIDU | Pr&#233;dicatPrimitif
</p>
<p>| Pr&#233;dicatPrimitif(INDIVIDU)
ENTITE2-&gt;Pr&#233;dicatPrimitif | Pr&#233;dicatPrimitif(INDIVIDU)
ENTITE3-&gt;ATTRIBUT(INDIVIDU)|INDIVIDU
</p>
<p>Figure 5: Grammaire des RSC &#8211; RSC0 est l&#8217;axiome
</p>
<p>8le type de concept proc&#232;s est un super type des types &#233;tat,&#233;v&#233;nement et processus et le type de relation
&#0; &#1; &#0;
</p>
<p>un
</p>
<p>super type de
&#0; &#2; &#0;
</p>
<p>et
&#0; &#3; &#0;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tassadit Amghar, Delphine Battistelli et Thierry Charnois
</p>
<p>fonctionnement: m24
epsi_act
</p>
<p>1
</p>
<p>topo1
</p>
<p>clig: m25
2
</p>
<p>in: m232
</p>
<p>individu: A ingr1
2
</p>
<p>SIT 2:
</p>
<p>fonctionnement: m24
</p>
<p>epsi_act
1
</p>
<p>topo1
</p>
<p>clig: m25
</p>
<p>2
</p>
<p>ex: m222
</p>
<p>individu: A ingr1
2
</p>
<p>SIT 1:
</p>
<p>changtor: m21
</p>
<p>contr1
</p>
<p>transition
1
</p>
<p>individu: A2
</p>
<p>sit: sit12
</p>
<p>sit: sit2
</p>
<p>3
</p>
<p>Figure 6: Repr&#233;sentation de la proposition textuelle J&#8217;avais mis mon clignotant
</p>
<p>3.4.1 La propagation de marqueurs temporels
</p>
<p>Ce module propage le marqueur de l&#8217;intervalle temporel correspondant &#224; la proposition consid&#233;-
r&#233;e dans la partie ad&#233;quate du GCS en fonction de la valeur aspectuelle de l&#8217;action d&#233;crite. Par
exemple, si la valeur aspectuelle d&#8217;une proposition est EVENEMENT, l&#8217;ensemble des concepts
du composant nomm&#233; &#0; &#1; &#2; &#3; est marqu&#233; temporellement par le marqueur du c-sommet correspon-
dant au proc&#232;s du DT. Cette impl&#233;mentation est conforme &#224; l&#8217;ensemble des r&#232;gles donn&#233;es par
la figure 3.
</p>
<p>3.4.2 Une m&#233;thode incr&#233;mentale
</p>
<p>En suivant un principe de compositionnalit&#233;, la repr&#233;sentation s&#233;mantique int&#233;grant les infor-
mations aspecto-temporelles est obtenue en combinant les RSC par l&#8217;op&#233;ration d&#8217;isojoint maxi-
mal9. Dans le cas de RSC de type cin&#233;matique ou dynamique, l&#8217;&#233;tape succ&#233;dant &#224; la propagation
des marqueurs temporels consiste &#224; remplacer, par isojoint maximal, les sommets &#0; &#1; &#2; &#4; et &#0; &#1; &#2; &#3;
par les GCS correspondants. L&#8217;op&#233;ration est r&#233;p&#233;t&#233;e pour tous les GCS associ&#233;s aux RSC. Enfin,
la combinaison - par isojoints maximaux successifs - de tous ces GCS produit la repr&#233;sentation
du texte. Les figures 6 et 7 donnent respectivement le graphe associ&#233; &#224; la proposition 2 du
texte (A) et le graphe associ&#233; &#224; l&#8217;int&#233;gralit&#233; du texte (A). Dans cette repr&#233;sentation, le troisi&#232;me
champ des sommets concepts (lorsqu&#8217;il existe10) est le marqueur temporel. C&#8217;est aussi le mar-
queur individuel d&#8217;un concept de type intervalle du graphe DT (cf section 3.2) ; il permet ainsi
de retrouver l&#8217;intervalle temporel associ&#233; et ses relations aux autres intervalles dans DT.
</p>
<p>4 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; un travail dont l&#8217;objectif est la repr&#233;sentation et la manipulation des in-
formations (aspecto) temporelles extraites de textes narratifs. Nous travaillons avec le mod&#232;le
des graphes conceptuels simples que nous avons &#233;tendu afin de repr&#233;senter en accord avec une
</p>
<p>9l&#8217;algorithme d&#8217;isojoint impl&#233;ment&#233; est d&#233;crit dans (Charnois, 2000)
10sinon le concept n&#8217;est pas marqu&#233; temporellement</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;senter le temps en langue dans le formalisme des graphes conceptuels
</p>
<p>gauche: m41
</p>
<p>topo1
</p>
<p>det
</p>
<p>2
</p>
<p>topo
1
</p>
<p>epsi0
</p>
<p>2
</p>
<p>fr: m43
</p>
<p>2
</p>
<p>transition3
</p>
<p>individu: A
</p>
<p>1
</p>
<p>ingr
</p>
<p>1
</p>
<p>contr
2
</p>
<p>det1
</p>
<p>ingr
</p>
<p>1
</p>
<p>ex: m42
</p>
<p>2
2
</p>
<p>individu: B
</p>
<p>1
</p>
<p>contr
</p>
<p>2
</p>
<p>epsi0
1 contr
</p>
<p>2
</p>
<p>contr
</p>
<p>2
</p>
<p>mouvtor: c2 ; u4
</p>
<p>1
</p>
<p>1
</p>
<p>individu: A ; u2 ingr1 clig: m25 ; u22
</p>
<p>epsi_act
2
</p>
<p>fonctionnement: m24 ; u2
</p>
<p>topo1
</p>
<p>1
</p>
<p>in: m23 ; u2
2
</p>
<p>transition
3
</p>
<p>clig: m25
</p>
<p>2
</p>
<p>epsi_act
2
</p>
<p>fonctionnement: m24 topo1
</p>
<p>1 ex: m22
</p>
<p>2
</p>
<p>2
</p>
<p>changtor: m21
</p>
<p>1
</p>
<p>1
</p>
<p>individu: A ; u5 det1 loc: m52 ; u52
</p>
<p>topo
1
</p>
<p>epsi02
</p>
<p>fr: m53 ; u52 transition
3
</p>
<p>individu: B ; u5 1
</p>
<p>loc: m522
</p>
<p>2
</p>
<p>2
</p>
<p>mouvtor: m51
</p>
<p>1
</p>
<p>1
</p>
<p>individu: A ; u6 ingr1 tt_le_cote_avG: m63 ; u62
epsi02
</p>
<p>e2: E2 ; u6
1
</p>
<p>transition
3
</p>
<p>topo 1in: m62 ; u6 2
</p>
<p>tt_le_cote_avG: m63
</p>
<p>2
</p>
<p>epsi0
2
</p>
<p>e1: E1
</p>
<p>1
</p>
<p>2
topo
</p>
<p>1
</p>
<p>in: m62
2
</p>
<p>changtor: m61
</p>
<p>1
</p>
<p>1
</p>
<p>individu: A ; u1
</p>
<p>epsi_act1
</p>
<p>epsi_act
1
</p>
<p>a_l_arret: m11 ; u12
</p>
<p>la_file_D: m12 ; u12
</p>
<p>individu: A ; u3 epsi_act1 a_l_arret: m31 ; u32
</p>
<p>Figure 7: Repr&#233;sentation s&#233;mantique du texte (A)
</p>
<p>th&#233;orie linguistique fine, le temps linguistique. Nous avons choisi de travailler sur un corpus
de constats d&#8217;accidents, dans lequel le traitement des informations aspecto-temporelles rev&#234;t
un aspect crucial. Notre syst&#232;me prend en entr&#233;e la Repr&#233;sentation Semantico-Cognitive d&#8217;un
texte et la transforme en un graphe conceptuel simple. Cette cha&#238;ne de traitement compl&#232;te
menant d&#8217;un texte &#224; un graphe conceptuel offre la possibilit&#233; de raisonner &#224; partir des infor-
mations temporelles. Utiliser les capacit&#233;s inf&#233;rentielles des graphes conceptuels pour r&#233;aliser
des d&#233;ductions sur le degr&#233; de compl&#233;tion des actions d&#233;crites dans un texte, est une de nos
perspectives. Par ailleurs, nous envisageons d&#8217;utiliser cette repr&#233;sentation dans le but de tester
la coh&#233;rence entre deux textes &#233;crits par les deux protagonistes d&#8217;un m&#234;me accident. En effet,
chacune des parties exprimant son point de vue, il peut alors &#234;tre int&#233;ressant de d&#233;tecter les
incoh&#233;rences et de mettre ainsi en avant les diff&#233;rents points de vue. Nous envisageons pour ce
dernier point de nous appuyer sur une m&#233;thodologie d&#233;crite par (Charnois, 1997).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tassadit Amghar, Delphine Battistelli et Thierry Charnois
</p>
<p>R&#233;f&#233;rences
J.F. Allen. (1983), Maintaining knowledge about temporal intervals. Communication of the ACM, Vol.
26(11), 832&#8211;843.
D. Battistelli, N. Vazov. (1997), Building of semantico-cognitive representation of different types of
narratives in french. In RANLP&#8217;97.
</p>
<p>D. Battistelli. (2000), Passer du texte &#224; une s&#233;quence d&#8217;images: analyse spatio-temporelle de textes,
mod&#233;lisation et r&#233;alisation informatique (syst&#232;me SPAT). Ph.D. thesis, Universit&#233; Paris IV Sorbonne.
H. Bestougeff, G. Ligozat. (1989), Outils logiques pour le traitement du temps, de la linguistique &#224;
l&#8217;intelligence artificielle. Masson.
T. Charnois. (1997), A natural language processing approach for avoidance of feature interactions.
Feature Interactions in Telecommunication Networks IV, pp. 347&#8211;363, IOS Press.
</p>
<p>T. Charnois. (2000), Maximal isojoin for representing software textual specifications and detecting
semantic anomalies, In Working with Conceptual Structures (ICCS&#8217;2000), pp. 189&#8211;200, Shaker Verlag.
M. Chein, M.L. Mugnier. (1992), Conceptual graphs: fundamental notions. Revue d&#8217;Intelligence
Artificielle, Vol. 6(4), 365&#8211;406.
J.P. Descl&#233;s. (1989), State, events, process and topology. General Linguistics, Vol. 29(3), 159&#8211;200.
J.P. Descl&#233;s. (1990), Langages applicatifs, Langues naturelles et Cognition, Herm&#232;s.
J.P. Descl&#233;s, C. Jouis, H.G. OH, D. Maire&#8211;Reppert. (1991), Exploration contextuelle et s&#233;mantique : un
syst&#232;me expert qui trouve les valeurs s&#233;mantiques des temps de l&#8217;indicatif dans un texte. In Knowledge
modeling and expertise transfer, pp. 371&#8211;400.
H. Kamp. (1979), Events, Instants, and Temporal Reference. In Semantics from different points of view,
pp. 373&#8211;417, Springer Verlag.
</p>
<p>H. Reichenbach. (1947), Elements of symbolic logic. McMillan.
J.F. Sowa. (1984), Conceptual Structures: Information Processing in Mind and Machine. Addison
Wesley.</p>

</div></div>
</body></html>