<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction automatique de motifs syntaxiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2001, Tours, 2-5 juillet 2001
</p>
<p>Extraction automatique de motifs syntaxiques
</p>
<p>Jean-Gabriel Ganascia
</p>
<p>LIP6 - Universit&#233; Pierre et Marie Curie
8, rue du Capitaine Scott, 75015 Paris France
</p>
<p>Jean-Gabriel.Ganascia@lip6.fr
</p>
<p>R&#233;sum&#233; &#8211; Abstract
Cet article pr&#233;sente un nouvel algorithme de d&#233;tection de motifs syntaxiques r&#233;currents dans les
textes &#233;crits en langage naturel. Il d&#233;crit d&#8217;abord l&#8217;algorithme d&#8217;extraction fond&#233; sur un mod&#232;le
d&#8217;&#233;dition g&#233;n&#233;ralis&#233; &#224; des arbres stratifi&#233;s ordonn&#233;s (ASO). Il d&#233;crit ensuite les exp&#233;rimentations
qui valident l&#8217;approche pr&#233;conis&#233;e sur des textes de la litt&#233;rature fran&#231;aise classique des XVIIIe
et XIXe si&#232;cle. Une sous-partie est consacr&#233;e &#224; l&#8217;&#233;valuation empirique de la complexit&#233;
algorithmique. La derni&#232;re sous-partie donnera quelques exemples de motifs r&#233;currents typiques
d&#8217;un auteur du XVIIIe si&#232;cle, Madame de Lafayette.
</p>
<p>Mots clefs : Extraction de motifs, arbres stratifi&#233;s ordonn&#233;s, distances d'&#233;dition, s&#233;quences.
</p>
<p>This paper presents a new algorithm designed to detect recurrent syntactical patterns in natural
language texts. It first describes the pattern extraction algorithm which is based on an edit model
generalized to Stratified Ordered Trees (SOT). Then it focuses on experiments with french
classical literature of the 18th and 19th century. One section is dedicated to the efficiency
evaluation. The last provides some examples of such recurrent patterns that are typical of an 18th
century author, Madame de Lafayette.
</p>
<p>Keywords : Pattern extraction, stratified ordered trees, edit distance, sequences.
</p>
<p>1 Extraction automatique de motifs syntaxiques
Nous pr&#233;sentons ici un algorithme d&#8217;extraction automatique de motifs textuels r&#233;p&#233;titifs. Notre
but est de d&#233;tecter des motifs syntaxiques r&#233;currents. Trois motivations guident cette recherche.
</p>
<p>La premi&#232;re est de caract&#233;riser la personnalit&#233; des &#233;crivains, car nous pensons que, ce que l&#8217;on
appelle couramment, et un peu pompeusement le style est partiellement d&#233;termin&#233; par les
structures syntaxiques employ&#233;es et partiellement par le lexique. Dans le pass&#233;, les approches de
la &#171; stylom&#233;trie &#187; se sont essentiellement fond&#233;es sur une analyse statistique des occurrences
de mots. Nous souhaiterions d&#233;velopper une approche syntaxique. Dans le futur proche, nous
testerons cette hypoth&#232;se de travail sur les imitations : il existe toute une litt&#233;rature de parodie o&#249;
des auteurs caricaturent de grands &#233;crivains en r&#233;p&#233;tant les traits saillants de leurs styles
personnels. Si notre hypoth&#232;se se v&#233;rifie, quelques unes des mani&#232;res des &#233;crivains se
retrouveront dans les motifs syntaxiques employ&#233;s par leurs imitateurs.
</p>
<p>La seconde motivation est &#233;ducative. Notre but serait d&#8217;aider les &#233;coliers, les &#233;tudiants ou les
jeunes &#233;crivains &#224; &#233;valuer la richesse et la diversit&#233; de leur style propre. Il serait ainsi possible
d&#8217;identifier les fautes classiques et de proposer des corrections. Qui plus est, les personnes</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Gabriel Ganascia
</p>
<p>apprenant des langues &#233;trang&#232;res pourraient profiter d&#8217;une telle analyse pour d&#233;tecter leurs
expressions idiomatiques. Plus pr&#233;cis&#233;ment, il arrive que certaines constructions soient
correctes d&#8217;un point de vue grammatical, mais inhabituelles, ce qui rend leur usage fr&#233;quent
&#233;trange et g&#234;nant pour un lecteur dont c&#8217;est la langue maternelle.
</p>
<p>La troisi&#232;me motivation est universitaire. La linguistique informatique pourrait utiliser un tel
outil pour distinguer diff&#233;rents registres de langue et les caract&#233;riser. Les progr&#232;s dans l&#8217;analyse
du langage naturel coupl&#233;s &#224; ceux des techniques d&#8217;intelligence artificielle et de fouille des
donn&#233;es, aideront &#224; d&#233;tecter de tels motifs syntaxiques, fournissant ainsi une nouvelle fa&#231;on
d&#8217;&#233;tudier les usages du langage. Ainsi, il serait possible d&#8217;engendrer des figures d&#8217;expression et
d&#8217;automatiser les proc&#233;dures de la rh&#233;torique classique.
</p>
<p>Dans l&#8217;architecture pr&#233;conis&#233;e pour d&#233;couvrir de tels motifs, un apprentissage non supervis&#233;
regroupe ensemble des motifs similaires. La premi&#232;re partie de l&#8217;article d&#233;crit l&#8217;algorithme
d&#8217;apprentissage. Apr&#232;s une pr&#233;sentation de l&#8217;ensemble de la cha&#238;ne de traitement, l&#8217;article porte
sur la distance d&#8217;&#233;dition, puis sur l&#8217;algorithme de g&#233;n&#233;ration qui construit le graphe de
similarit&#233;. Ensuite, l&#8217;article introduit l&#8217;algorithme &#171; centre &#233;toile &#187; con&#231;u pour extraire des
sous-graphe fortement connect&#233;s du graphe de similarit&#233;, et qui correspondent &#224; des classes de
motifs similaires. Enfin, la derni&#232;re partie de l&#8217;article d&#233;crit quelques exp&#233;rimentations. Nous y
&#233;valuerons l&#8217;approche propos&#233;e &#224; la fois d&#8217;un point de vue algorithmique et quantitatif, et d&#8217;un
point de vue linguistique et qualitatif.
</p>
<p>2 Cha&#238;ne de traitement
Pour r&#233;sumer, nous avons dessin&#233; (voir figure 1) l&#8217;ensemble de la cha&#238;ne de traitement qui
prend, en entr&#233;e, un texte en langage naturel et qui engendre, en sortie, un ensemble de motifs
r&#233;currents.
</p>
<p>Figure 1 : cha&#238;ne de traitement
</p>
<p>Dans la premi&#232;re sous-partie, les entr&#233;es du processus ainsi que l&#8217;&#233;tape d&#8217;analyse sont
pr&#233;sent&#233;es, tandis que, dans la seconde, ce sont les ASO (Arbres Structur&#233;s Ordonn&#233;s) qui sont
d&#233;taill&#233;s, car l&#8217;algorithme d'extraction repose en grande partie sur l&#8217;utilisation de ces structures
de donn&#233;es.
</p>
<p>2.1 Phase d&#8217;analyse du texte en langage naturel
L&#8217;entr&#233;e principale du syst&#232;me consiste en un texte &#233;crit en langage naturel qui est r&#233;ductible &#224;
une s&#233;quence de phrases chacune &#233;tant affirmative, interrogative, exclamative ou n&#233;gative. Un
traitement automatique de ce texte r&#233;alis&#233; par un analyseur syntaxique ou un cat&#233;goriseur,
associe des &#233;tiquettes &#224; chaque mot (nom, verbe, etc.), ou &#224; chaque groupe de mots (groupe
nominal, syntagme verbal, etc.). Cet article ne portant pas, &#224; proprement parler, sur les
analyseurs ou les cat&#233;goriseurs, nous ne d&#233;taillerons pas ces processus. Nous insistons
seulement sur la g&#233;n&#233;ralit&#233; de l&#8217;approche qui prend comme entr&#233;e un arbre d&#8217;analyse engendr&#233;
par diff&#233;rentes grammaires avec diff&#233;rents ensembles d&#8217;&#233;tiquettes. La plupart du temps, les
arbres sont stratifi&#233;s, autrement dit, les &#233;tiquettes forment une partition dont les classes
d&#233;pendent de la profondeur du n&#339;ud dans l&#8217;arbre d&#8217;analyse. Par exemple, un niveau
correspond &#224; des syntagmes non-r&#233;cursifs, un second &#224; des cat&#233;gories de mots, un troisi&#232;me &#224;
des attributs comme le genre ou le nombre, un dernier &#224; des lemmes, c&#8217;est-&#224;-dire &#224; des formes
canoniques de noms ou de verbes. Soulignons toutefois que notre approche n&#8217;est pas restreinte
</p>
<p>Analyseur
g
</p>
<p>Entr&#233;e:
</p>
<p>Texte en
langage naturel
</p>
<p>G&#233;n&#233;ration
du graphe de
</p>
<p>similarit&#233;
For&#234;ts
</p>
<p>=
</p>
<p>s&#233;quence d'arbres
</p>
<p>Sortie:
</p>
<p>Motifs
r&#233;currents
</p>
<p>Graphe de
similarit&#233;
</p>
<p>Classification</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique de motifs syntaxiques
</p>
<p>&#224; une d&#233;composition syntaxique en groupe non r&#233;cursifs. La seule limitation porte sur le r&#233;sultat
de la phase initiale d&#8217;analyse qui doit s&#8217;exprimer sous forme d&#8217;un ASO (Arbre Structur&#233;
Ordonn&#233;) (voir sous-partie suivante). Les exp&#233;rimentations conduites avec cette architecture ont
fait appel &#224; deux traitements diff&#233;rents. Le premier utilise le cat&#233;goriseur Winbrill-0.3, dont la
base de connaissance a &#233;t&#233; enrichie par l&#8217;INALF-CNRS (Lecomte 1998). Cet outil &#233;tiquette
simplement les mots, sans extraire de groupes. Le second fait appel &#224; l&#8217;analyseur Vergne-98
&#233;crit par Jacques Vergnes (voir    http://www.info.unicaen.fr/~jvergnes   et (Vergnes 1999)) au
GREYC (Groupe de Recherche en Informatique, Image, Instrumentation de Caen). Pour des
raisons de place, nous n&#8217;&#233;voquerons ici que la seconde exp&#233;rimentation avec l&#8217;analyseur de
Jacques Vergnes.
</p>
<p>2.2 Arbre Stratifi&#233;s Ordonn&#233;s (ASO)
Selon une d&#233;finition classique, un arbre ordonn&#233; est un arbre dans lequel les relations de gauche
&#224; droite, entre fils d&#8217;un m&#234;me n&#339;ud, sont porteuses d&#8217;information. En d&#8217;autres termes, cela
signifie qu&#8217;un arbre ordonn&#233; peut &#234;tre r&#233;cursivement d&#233;fini comme un n&#339;ud &#233;tiquet&#233; suivi d&#8217;une
for&#234;t, c&#8217;est-&#224;-dire d&#8217;une s&#233;quence d&#8217;arbres.
</p>
<p>Toutes les donn&#233;es s&#233;quentielles peuvent &#233;videmment se repr&#233;senter &#224; l&#8217;aide d&#8217;arbres ordonn&#233;s
de profondeur 1. En ajoutant des niveaux aux arbres ordonn&#233;s, il est possible d&#8217;organiser les
donn&#233;es de fa&#231;on &#224; repr&#233;senter une connaissance implicite. Par exemple, un texte, c&#8217;est-&#224;-dire
une s&#233;quence de caract&#232;res, est un liste de phrases, chacune d&#8217;entre elles &#233;tant compos&#233;e de
mots et de symboles de ponctuation. Ceci peut &#234;tre repr&#233;sent&#233; &#224; l&#8217;aide d&#8217;un arbre de profondeur
3 qui explicite cette structure. Consid&#233;rons maintenant les arbres r&#233;sultant de l&#8217;analyse
syntaxique, il faut introduire au moins deux niveaux suppl&#233;mentaires correspondant aux
groupes syntaxiques et aux cat&#233;gories de mots.
</p>
<p>Comme nous l&#8217;avons pr&#233;c&#233;demment montr&#233;, les arbres ordonn&#233;s accroissent la puissance de
repr&#233;sentation en sorte qu&#8217;il est possible de d&#233;tecter des sous-arbres semblables, eu &#233;gard &#224; cette
structuration des donn&#233;es. Il est aussi possible d&#8217;extraire des motifs g&#233;n&#233;raux qui ont de
multiples occurrences approximatives. Par exemple, n&#8217;importe quelle s&#233;quence de groupes
syntaxiques qui appara&#238;t plusieurs fois dans les donn&#233;es peut &#234;tre d&#233;tect&#233;e, sans consid&#233;rer les
mots couverts par ces structures syntaxiques, ni leur cat&#233;gorie.
</p>
<p>Toutefois, en pratique, la d&#233;tection est rendue impossible du fait du tr&#232;s grand nombre de paires
potentielles de sous-arbres. Afin de r&#233;duire la complexit&#233;, les n&#339;uds sont regroup&#233;s en classes
de sorte que deux n&#339;uds ne s&#8217;apparient avec succ&#232;s que s&#8217;ils rel&#232;vent de la m&#234;me classe. En
d&#8217;autres termes, un appariement entre deux arbres est valide si et seulement si les n&#339;uds
correspondants dans l&#8217;appariement rel&#232;vent tous de la m&#234;me classe.
</p>
<p>En outre, on suppose qu&#8217;il existe un ordre total sur l'ensemble des classes et que, en
consid&#233;rant cet ordre, la classe des fils d&#8217;un n&#339;ud est &#233;gale ou imm&#233;diatement sup&#233;rieure &#224; la
classe de ce n&#339;ud. Cette contrainte d&#233;finit la notion de stratification et la structure d&#8217;ASO (Arbre
Stratifi&#233; Ordonn&#233;). Plus formellement, en d&#233;finissant un ensemble ordonn&#233; S (ensemble de
&quot;sortes&quot;) et une fonction sorte(x) qui associe un &#233;l&#233;ment de S &#224; chaque n&#339;ud de l'arbre, on peut
sp&#233;cifier un ASO comme &#233;tant un arbre ordonn&#233; dont la classe de chaque n&#339;ud N (sorte(N)) est
le successeur imm&#233;diat dans S de la classe de son p&#232;re, sauf pour la racine qui n'a pas de p&#232;re.
Dans le cas d'arbres syntaxiques r&#233;sultant de l'analyse d'un texte en langue naturel, ceci signifie
que l'ensemble ordonn&#233; S peut contenir cinq classes, {texte, phrase, groupe, cat&#233;gorie, mot}
avec texte &lt; phrase &lt; groupe &lt; cat&#233;gorie &lt; mot.
</p>
<p>Etant donn&#233; la structure d&#8217;ASO, nous pouvons facilement d&#233;finir une mesure de similarit&#233; qui
quantifie l&#8217;appariement approximatif entre deux ASO (voir partie 3). Gr&#226;ce &#224; cette mesure, il est
possible d&#8217;engendrer efficacement un graphe de similarit&#233; (voir partie 4) qui stocke les sous-
arbres les plus proches dans le texte analys&#233;. Et, c&#8217;est ce graphe de similarit&#233; qui sert d&#8217;entr&#233; au
module de construction des classes de motifs semblables (voir partie 5).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Gabriel Ganascia
</p>
<p>&#192; titre d'illustration, voici l'ASO construit &#224; partir de l'analyse syntaxique d'une proposition
tir&#233;e de &quot;La comtesse de Tende&quot; de Madame de Lafayette : Elle ex&#233;cuta ce qu'elle avait
projet&#233; :1
</p>
<p>mot
&quot; ellle &quot;
</p>
<p>Centre
cat: K
</p>
<p>Groupe
cat: K
</p>
<p>fs3
</p>
<p>mot
&quot;ex&#233;cuta&quot;
</p>
<p>Centre
cat: V
</p>
<p>Groupe
cat: V
</p>
<p>fs3
</p>
<p>mot
&quot;ce&quot;
</p>
<p>Centre
cat: N
</p>
<p>Groupe
cat: N
ms3
</p>
<p>mot
&quot; qu' &quot;
</p>
<p>Centre
cat: O
</p>
<p>Groupe
cat: O
ms3
</p>
<p>mot
&quot; elle &quot;
</p>
<p>Centre
cat: K
</p>
<p>Groupe
cat: K
fs3
</p>
<p>mot
&quot;avait&quot;
</p>
<p>Centre
cat: W
</p>
<p>mot
&quot;projet&#233;&quot;
</p>
<p>P&#233;riph&#233;rique
cat: z
ms.
</p>
<p>Groupe
cat: V
fs3
</p>
<p>mot
&quot; : &quot;
</p>
<p>Connecteur
cat: E
</p>
<p>Groupe
cat: G
</p>
<p>Phrase
</p>
<p> Figure 2 : ASO construit &#224; partir de l'analyse syntaxique d'une proposition simple
</p>
<p>3 Distance d&#8217;&#233;dition
Les distances d&#8217;&#233;dition ont &#233;t&#233; beaucoup utilis&#233;es pour d&#233;tecter des appariements approximatifs
sur des cha&#238;nes de caract&#232;res (Sankoff &amp; Kruskal 1983), tout particuli&#232;rement en biologie
mol&#233;culaire (Sagot et al. 1996) et en musique (Rolland et Ganascia 1999). Le lecteur int&#233;ress&#233;
trouvera un panorama complet de ces techniques dans (Crochemore &amp; Rytter 1994). Nous
rappellerons simplement quelques principes de base.
</p>
<p>D&#233;finition : une &#233;dition est une transformation &#233;l&#233;mentaire qui remplace un caract&#232;re dans une
cha&#238;ne ou plus g&#233;n&#233;ralement un n&#339;ud dans un arbre, par un autre, &#233;ventuellement vide. Par
exemple, une substitution est une &#233;dition qui transforme un caract&#232;re d&#8217;une cha&#238;ne en un autre &#224;
la m&#234;me position. Une insertion (respectivement une destruction) qui ins&#232;re (respectivement
d&#233;truit) un caract&#232;re dans une cha&#238;ne est aussi une &#233;dition.
D&#233;finition : une distance d&#8217;&#233;dition entre deux cha&#238;nes ou deux arbres correspond au nombre
minimal d&#8217;&#233;ditions qui transforme une cha&#238;ne dans une autre, ou un arbre dans un autre.
</p>
<p>3.1 Distance d&#8217;&#233;dition entre cha&#238;nes
Consid&#233;rons maintenant deux cha&#238;nes x et y donn&#233;es sous forme de deux tableaux de taille
respective n et m, c&#8217;est-&#224;-dire comme x[1..n] et y[1..m]. Il est alors possible de construire une
matrice de dimension (n+1)&#215;(m+1) appel&#233;e EDIT, o&#249; EDIT(i, j) contient la valeur de
edit(x[1..i], y[1..j]) pour tout couple (i, j) tel que i&#8712; [1, n] et j &#8712; [1, m], tandis que EDIT(0, j)
correspond &#224; l&#8217;insertion de y[j] et EDIT(i, 0), &#224; la destruction de x[i]. Sachant que
destruction(x[i]), insertion(y[j]) et substitution(x[i], y[j]) correspondent respectivement au co&#251;t
de la destruction de x[i], de l&#8217;insertion de y[j] et de la substitution de x[i] par y[j], une formule
simple r&#233;sume la fa&#231;on dont les &#233;l&#233;ments de la matrice sont calcul&#233;s :
</p>
<p>                                                
</p>
<p>1
  Voici le r&#233;sultat donn&#233; par l'analyseur Vergnes-98 : {* 1 1 *}%S K fs3 %C Elle K fs3 {* 2 2 *} %S V fs3
</p>
<p>%C ex&#233;cuta V fs3 {* 3 3 *} %S N ms3 %C ce N ms3 {* 4 4 *} %S O ms3 %C qu' O ms3 {* 5 5 *} %S K
fs3 %C elle K fs3 {* 6 6 *} %S V fs3 %C avait W fs3 %P projet&#233; z ms. %G %E : . {* KVNOKV *} {*
123456 6 *} %RD 2 1 K &lt; V %RD 3 2 V &lt; N %RD 4 6 O &gt; V %RA 4 3 N / O %RD 5 3 N &lt; &#224;K %RD 6
5 K &lt; V %Fin. On notera que nous ne retenons ici que l'arbre d'analyse sans les relations entre syntagmes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique de motifs syntaxiques
</p>
<p>  
</p>
<p>edit (x[1..i], y[1..j]) = min
edit (x[1..i &#8722;1],y[1..j]) + destruction(x[i])
edit (x[1..i &#8722;1],y[1..j &#8722;1]) + substitution (x[i], y[j])
edit (x[1..i], y[1..j&#8722;1]) + insertion(y[ j])
</p>
<p>&#63729; 
&#63730; 
&#63732; 
</p>
<p>&#63731; &#63732; 
</p>
<p>3.2 Extension du mod&#232;le d&#8217;&#233;dition aux arbres
Le mod&#232;le d&#8217;&#233;dition peut &#234;tre ais&#233;ment &#233;tendu aux arbres et aux for&#234;ts, mais dans le cas g&#233;n&#233;ral
la complexit&#233; inh&#233;rente au calcul, rend impossible son utilisation dans des algorithmes
d&#8217;extraction de motifs. Il a &#233;t&#233; d&#233;montr&#233; (Zhang K 1993) que certaines proc&#233;dures efficaces
existent, sous des conditions tr&#232;s strictes, mais les restrictions qu&#8217;elles imposent interdisent leur
emploi pour des probl&#232;mes pratiques. Nous avons montr&#233; dans (Ganascia 2001) qu&#8217;en limitant
les entr&#233;es structur&#233;es &#224; des ASO, il est possible de construire un nouvel algorithme efficace
d&#8217;extraction de motifs. Cet algorithme prend pour entr&#233;e un immense ASO et engendre des
classes de ASO semblables qui ont plusieurs occurrences d&#8217;apparitions dans l&#8217;ASO d&#8217;entr&#233;e.
</p>
<p>Puisque l&#8217;article n&#8217;est pas destin&#233; &#224; pr&#233;senter le d&#233;tail des algorithmes, nous donnerons juste
une id&#233;e intuitive de la fa&#231;on dont la distance d&#8217;&#233;dition est &#233;tendue aux ASO. Toutefois, avant
cela, notons que, les arbres &#233;tant stratifi&#233;s, la classe de chaque n&#339;ud se r&#233;f&#232;re directement au
niveau de ce n&#339;ud dans l&#8217;arbre. De ce fait, la comparaison de deux s&#233;quences de n&#339;uds
provenant de l&#8217;exploration &#224; main gauche de deux arbres est &#233;quivalente &#224; la comparaison de ces
deux arbres. Tenant compte de cette remarque, la distance d&#8217;&#233;dition entre deux ASO se r&#233;duit &#224;
la distance d&#8217;&#233;dition entre les deux s&#233;quences de n&#339;uds produites par l&#8217;exploration &#224; main
gauche de ces deux ASO.
</p>
<p>De fa&#231;on plus formelle, en d&#233;notant pmg(T) l&#8217;exploration &#224; main gauche de l&#8217;ASO, c&#8217;est-&#224;-dire
la s&#233;quence des n&#339;uds visit&#233;s par une exploration en profondeur d&#8217;abord, la distance d&#8217;&#233;dition
editaso(T, T&#8217;) entre deux ASO T et T&#8217; peut s&#8217;exprimer par edit(pmg(T), pmg(T&#8217;)).
</p>
<p>4 Construction du graphe de similarit&#233;
Utilisant la distance d&#8217;&#233;dition, un graphe &#233;tiquet&#233; appel&#233; le graphe de similarit&#233; est construit. Ce
graphe enregistre la similarit&#233; entre les motifs quand ceux-ci ne sont pas trop &#233;loign&#233;s,
autrement dit quand leur distance est inf&#233;rieure &#224; une certain seuil. Plus exactement, on d&#233;rive
une mesure de similarit&#233; entre motifs &#224; partir de la distance d&#8217;&#233;dition. Rappelons qu&#8217;une mesure
de similarit&#233; est une fonction binaire positive et sym&#233;trique qui atteint son maximum lorsque ses
deux arguments sont identiques (voir par exemple Saporta 1990). De fa&#231;on &#224; ce que les
approximations tol&#233;r&#233;es soient plus ou moins proportionnelles &#224; la longueur du motif, pour ne
pas avantager trop fortement les petits motifs, cette longueur a &#233;t&#233; introduite dans le calcul de la
similarit&#233; pour pond&#233;rer la distance d'&#233;dition. Parmi toutes les formules de calcul de similarit&#233;
envisageables, la suivante s&#8217;est av&#233;r&#233;e tout &#224; fait satisfaisante :
</p>
<p>  
</p>
<p>s&#945; (i, j) =
1
</p>
<p>1+&#945; &#215; (edit(i, j)/ min(length(i),length(j)))4
</p>
<p>Remarque : &#945; est un nombre positif qui sert de param&#232;tre. La valeur usuelle employ&#233;e est 0,01.
</p>
<p>Le graphe de similarit&#233; est d&#8217;une importance cruciale ; c&#8217;est l&#8217;entr&#233;e principale du module de
classification. De plus, il contient tous les motifs qui g&#233;n&#233;ralisent les sous-arbres de l'ASO
donn&#233; en entr&#233;e. Notons que cette g&#233;n&#233;ralisation implicite est un point clef dans l&#8217;ensemble de
l&#8217;algorithme, car les motifs engendr&#233;s incluent les arbres ordonn&#233;s non &#233;quilibr&#233;s. Dans le cas</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Gabriel Ganascia
</p>
<p>des arbres d&#8217;analyse syntaxique, ceci signifie que les motifs engendr&#233;s peuvent ressembler au
suivant (voir figure 3)
</p>
<p>mot
&quot; ellle &quot;
</p>
<p>Centre
cat: K
</p>
<p>Groupe
cat: K
</p>
<p>Groupe
cat: V
</p>
<p>Groupe
cat: N
</p>
<p>mot
&quot; qu' &quot;
</p>
<p>Centre
cat: O
</p>
<p>Groupe
cat: O
</p>
<p>mot
&quot; elle &quot;
</p>
<p>Centre
cat: K
</p>
<p>Groupe
cat: K
</p>
<p>Groupe
cat: V
</p>
<p>Connecteur
cat: E
</p>
<p>Groupe
cat: G
</p>
<p>Phrase
</p>
<p>Figure 3 : motif non &#233;quilibr&#233;
</p>
<p>Plus pr&#233;cis&#233;ment, le graphe de similarit&#233; d&#8217;un arbre T contient toutes les paires de sous-motifs
de T semblables eu &#233;gard &#224; la distance d&#8217;&#233;dition, ou plus exactement &#224; la mesure de similarit&#233;,
de sorte que cette mesure soit sup&#233;rieure &#224; un certain seuil. En d&#8217;autres termes, ses n&#339;uds
correspondent aux sous-arbres de T et ses arcs aux paires de sous-arbres &#233;tiquet&#233;es par la
mesure de similarit&#233;. Toutefois, le graphe de similarit&#233; ne contient pas toutes les paires de
motifs, mais seulement celles de motifs similaires. En prenant en compte les propri&#233;t&#233;s
math&#233;matiques de la mesure de similarit&#233; (voir Ganascia 2001), il est possible de r&#233;duire
consid&#233;rablement la complexit&#233; algorithmique de la proc&#233;dure de construction du graphe de
similarit&#233;.
</p>
<p>5 Algorithme de classification
La derni&#232;re &#233;tape correspond &#224; l&#8217;extraction de motifs, op&#233;ration qui se subdivise en deux &#233;tapes
logiques, la cat&#233;gorisation au cours de laquelle des classes de motifs similaires sont construites,
et la description qui attribut un nom, si possible significatif, &#224; chacune des classes.
</p>
<p>5.1 Cat&#233;gorisation
Au cours de la cat&#233;gorisation, les motifs semblables sont regroup&#233;s. Puisque le graphe de
similarit&#233; enregistre toutes les similarit&#233;s entre motifs, il est naturel d&#8217;extraire les classes de
motifs semblables &#224; partir de ce graphe. Toutefois il existe beaucoup de m&#233;thodes diff&#233;rentes
pour construire de telles classes.
</p>
<p>Les approches classiques d&#233;tectent des sous-graphes fortement connect&#233;s (voir Karp et al.
1972). Quelques personnes ont propos&#233; des algorithmes pour d&#233;tecter des k-cliques appartenant
au graphe de similarit&#233;, c&#8217;est-&#224;-dire des sous-graphe totalement interconnect&#233;s comprenant k
n&#339;uds. La plupart de ces algorithmes sont employ&#233;s dans le cas de r&#233;p&#233;titions exactes entre
objets. Il sont g&#233;n&#233;ralisables &#224; n&#8217;importe quelle relation d&#8217;&#233;quivalence. Il est aussi possible de
les g&#233;n&#233;raliser &#224; des relations non transitives (Soldano et al. 1995), mais c&#8217;est au prix d&#8217;une tr&#232;s
forte complexit&#233;.
</p>
<p>Nous avons choisi ici une approche beaucoup plus efficace qui fait appel &#224; l&#8217;algorithme dit
&#171; centre &#233;toile &#187; d&#233;velopp&#233; par Gusfield (Gusfield 1993) pour d&#233;tecter des homologies dans
des s&#233;quences biologiques et reprise par Rolland et Ganascia (Rolland et Ganascia 1999) pour
rep&#233;rer des motifs musicaux r&#233;currents. Le principe de base est facile &#224; comprendre. Il suffit de
d&#233;finir la notion d&#8217;&#233;toile centr&#233;e sur un n&#339;ud.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique de motifs syntaxiques
</p>
<p>D&#233;finition : une &#233;toile centr&#233;e sur le n&#339;ud N  est un graphe dont les arr&#234;tes contiennent le
n&#339;ud N. Autrement dit, une &#233;toile centr&#233;e sur N est compos&#233;e de tous les n&#339;uds P tels que la
paire {P, N} soit une arr&#234;te (voir figure 4).
</p>
<p>Figure 4 : graphe et &#233;toile centr&#233;e sur un n&#339;ud N
</p>
<p>En faisant appel &#224; une mesure de similarit&#233;, l&#8217;algorithme &#171; centre &#233;toile &#187; &#233;value d&#8217;abord toutes
les &#233;toiles centr&#233;es sur tous les diff&#233;rents n&#339;uds N du graphe de similarit&#233; en sommant les
valeurs des similarit&#233;s des n&#339;uds de chaque &#233;toile au centre N, puis il prend la meilleure, c&#8217;est-
&#224;-dire celle dont l&#8217;&#233;valuation est la plus &#233;lev&#233;e. Ensuite les n&#339;uds appartenant &#224; cette &#233;toile sont
marqu&#233;s, et l&#8217;algorithme est it&#233;r&#233; sur les n&#339;uds non marqu&#233;s du graphe de similarit&#233;, jusqu&#8217;&#224;
&#233;puisement des n&#339;uds non marqu&#233;s.
</p>
<p>5.2 Description
L&#8217;&#233;tape finale dans l&#8217;algorithme de classification porte sur la description de chacune des classes
induites. Notre algorithme choisit simplement le motif qui maximise la similarit&#233; avec les autres
membres de la classe et qui minimise la similarit&#233; avec les membres des autres classes. Pour
faciliter l&#8217;interpr&#233;tation il est possible d&#8217;adjoindre au r&#233;sultat le fragment original du texte qui est
couvert par le motif consid&#233;r&#233;. Pour illustrer ce point, consid&#233;rons &#224; nouveau le motif de la
figure 3 (dans la partie 4) ; il a &#233;t&#233; extrait en ex&#233;cutant notre programme sur un texte fran&#231;ais du
XVIIIe si&#232;cle &#233;crit par Madame de Lafayette et intitul&#233; &#171; La comtesse de Tende &#187;. Ce motif
g&#233;n&#233;ralise l'arbre syntaxique donn&#233; dans la figure 2 (partie 2.2) qui est issu de l'analyse de la
proposition &#171; Elle ex&#233;cuta ce qu&#8217;elle avait projet&#233; : &#187;. Il couvre aussi deux autres propositions
issues du texte de Madame de Lafayette, &#171; Il se joignit un nouveau tourment &#224; ceux qu&#8217;elle avait
d&#233;j&#224; : &#187; et &#171; Elle vit toute les raisons qu&#8217;il avait de l&#8217;aimer ; &#187;. Ceci signifie que la mesure de
similarit&#233; entre ce motif et l&#8217;un des arbres d&#233;riv&#233;s des arbres syntaxiques de chacune de ces deux
propositions est sup&#233;rieure &#224; un certain seuil. Sous cette condition, ce motif peut &#234;tre consid&#233;r&#233;
comme une description de la classe regroupant les trois propositions ci-dessus.
</p>
<p>6 Exp&#233;rimentations
Le syst&#232;me a &#233;t&#233; test&#233; sur plus de 100 nouvelles et romans tir&#233;s de la litt&#233;rature classique du
XVIIIe ou du XIXe si&#232;cle, et dont les auteurs sont, entre autres, Madame de Lafayette, Guy de
Maupassant, Alphonse Allais, Marcel Schwob, Alphonse Daudet, Eug&#232;ne Mouton, H&#233;g&#233;sippe
Moreau, Georges Sand etc. Les textes obtenus sur le site de la biblioth&#232;que &#233;lectronique de
Lisieux (   http://www.bmlisieux.com    ) furent d&#8217;abord soumis &#224; l&#8217;analyseur morpho-syntaxique
de Jacques Vergnes, puis les s&#233;quences r&#233;sultantes d&#8217;arbres syntaxiques furent transform&#233;es en
un ASO.
</p>
<p>6.1 Efficacit&#233;
D&#8217;un point de vue pratique, nous avons &#233;tudi&#233; la complexit&#233; empirique de notre algorithme en
reliant le temps d&#8217;ex&#233;cution, exprim&#233; en seconde, &#224; la taille du texte d&#8217;entr&#233;e, exprim&#233;e en
milliers de mots. En reportant sur une &#233;chelle logarithmique, et en appliquant une r&#233;gression
lin&#233;aire, il appara&#238;t clairement (voir figure 5) que le coefficient de r&#233;gression, c&#8217;est-&#224;-dire la
pente de la droite de r&#233;gression, est &#233;gal &#224; 2. Ceci prouve, empiriquement, que la complexit&#233;
temporelle est quadratique.
</p>
<p>N&#339;ud N N&#339;ud N</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Gabriel Ganascia
</p>
<p>Ce premier r&#233;sultat empirique est tr&#232;s satisfaisant car la complexit&#233; th&#233;orique de notre algorithme
est au minimum quadratique avec la taille des entr&#233;es. En effet, le calcul du graphe de similarit&#233;
passe par l&#8217;exploration de toutes les paires de motifs. Comme les textes sont repr&#233;sent&#233;s par une
structure arborescente, le nombre de sous-arbres et donc le nombre de motifs est lin&#233;aire avec le
nombre de phrases. De la sorte, la complexit&#233; globale ne peut pas &#234;tre inf&#233;rieure &#224; ce qu&#8217;elle est.
</p>
<p>Figure 5 : temps d&#8217;ex&#233;cution (en secondes) en fonction de la taille des textes (en 103 mots).
Pour &#233;viter les malentendus, pr&#233;cisons que dans le cas de r&#233;p&#233;titions exactes (Karp et al. 1972),
la proc&#233;dure est bien plus efficace, mais que lorsqu'on recherche des r&#233;p&#233;titions
approximatives, il en va tout autrement.
</p>
<p>Le syst&#232;me a &#233;t&#233; impl&#233;ment&#233; en C++ et test&#233; sur un ordinateur Macintosh G3 avec un
processeur &#224; 300 MHz. Le temps d&#8217;ex&#233;cution est compris entre quelques secondes pour extraire
des motifs syntaxiques d&#8217;une nouvelle tandis que dans le cas d&#8217;un roman complet il prend une
heure ou plus. Ceci signifie qu&#8217;il est possible d&#8217;appliquer notre algorithme sur des livres entiers,
mais pas sur l&#8217;&#339;uvre int&#233;grale d&#8217;un auteur. Toutefois, comme nous allons le montrer dans la
prochaine sous-partie, les r&#233;sultats sont d&#233;j&#224; suffisamment riches pour &#234;tre tr&#232;s utiles.
</p>
<p>6.2 Exemples de motifs extraits
Le programme d&#8217;extraction de motifs est compl&#233;t&#233; par une proc&#233;dure de discrimination. &#201;tant
donn&#233; deux textes, cette proc&#233;dure d&#233;tecte les motifs r&#233;currents couvrant de multiples
occurrences d&#8217;une structure syntaxique dans le premier texte sans d&#233;tecter aucune occurrence de
cette structure dans le second. Cette proc&#233;dure a &#233;t&#233; employ&#233;e pour d&#233;tecter des structures
syntaxiques caract&#233;ristiques d&#8217;un auteur, c&#8217;est-&#224;-dire qui le distinguent d&#8217;autres. L&#8217;auteur choisi
est Madame de Lafayette avec deux textes, une nouvelle intitul&#233;e &#171; La comtesse de Tende &#187; et
un roman connu, &#171; La princesse de Cl&#232;ves &#187;. Trois auteurs du XIXe furent utilis&#233;s dans la
proc&#233;dure de discrimination : Guy de Maupassant, Georges Sand et Marcel Schwob. Plus
pr&#233;cis&#233;ment le corpus employ&#233; contient les nouvelles suivantes : de Guy de Maupassant, La
peur (1882), La peur (1884), La veill&#233;e, La rempailleuse, Pierrot, En mer, Un normand, Ce
cochon de Morin et Les sabots, de Georges Sand, La f&#233;e poussi&#232;re, Le gnome des hu&#238;tres, Le
marteau rouge, L'orgue du titan et La f&#233;e aux gros yeux, de Marcel Schwob, Arachn&#233;, B&#233;atrice,
Sur les dents, Le Dom, L'homme double, Le fort, Gabelous, Parabole, Lilith, Conte des &#339;ufs
et Les portes de l'opium.
</p>
<p>Temps d'ex&#233;cution (diagramme LOG LOG)
</p>
<p>0
</p>
<p>0,5
</p>
<p>1
</p>
<p>1,5
</p>
<p>2
</p>
<p>2,5
</p>
<p>3
</p>
<p>3,5
</p>
<p>4
</p>
<p>-0,2 0 0,2 0,4 0,6 0,8 1 1,2 1,4
</p>
<p>Taille des textes en milliers de mots (&#233;ch. logarithmique)
</p>
<p>Total time Linear (Total time)
</p>
<p>Interpolation lin&#233;aire (temps total)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique de motifs syntaxiques
</p>
<p>Les trois motifs suivants (voir figure 6) sont pr&#233;sents dans les textes de Madame de Lafayette,
sans l&#8217;&#234;tre dans les autres.
</p>
<p>mot
&quot;de&quot;
</p>
<p>Connect. I
cat: q
</p>
<p>mot
&quot;le&quot;
</p>
<p>P&#233;riph.
cat: M
</p>
<p>s
</p>
<p>Centre
cat: I
ms3
</p>
<p>Groupe
cat: qI
ms3
</p>
<p>  
</p>
<p>mot
&quot;d' &quot;
</p>
<p>Connect. I
cat: p
</p>
<p>mot
&quot;en&quot;
</p>
<p>Connect. I
cat: p
</p>
<p>Centre
cat: S
</p>
<p>s3
</p>
<p>Groupe
cat: ppN
</p>
<p>s3
</p>
<p>  
</p>
<p>P&#233;riph.
cat: j
</p>
<p>mot
&quot;bien&quot;
</p>
<p>P&#233;riph.
cat: j
</p>
<p>mot
&quot;faits&quot;
</p>
<p>Centre
cat: z
</p>
<p>mp
</p>
<p>Groupe
cat: z
</p>
<p>mp
</p>
<p>Figure 6 : trois motifs caract&#233;ristiques de Madame de Lafayette
</p>
<p>Le premier motif couvre, entre autres, les expressions r&#233;currentes suivantes : &quot;&#224; le servir&quot;, &quot;de
le supplier&quot;, &quot;de l'&#233;viter&quot;, &quot;de l'aimer&quot;&#8230; Le second, &quot;sans en avoir&quot;, &quot;d'en avoir&quot;, &quot;d'en
attendre&quot;, &quot;d'en garantir&quot;, &quot;d'en faire&quot;... Quant au troisi&#232;me, il couvre trois fragments :
&quot;admirablement bien faits&quot;, &quot;parfaitement bien faits&quot;, &quot;tr&#232;s bien fait&quot;
Il y a bien d&#8217;autres sp&#233;cificit&#233;s syntaxiques caract&#233;ristiques de l&#8217;&#339;uvre de Madame de Lafayette
qui se d&#233;gagent de notre analyse. Parmi celles-ci, voici une structure tr&#232;s fr&#233;quemment r&#233;p&#233;t&#233;e
(voir figure 7)
</p>
<p>Groupe
cat: N
</p>
<p>Groupe
cat: pN
</p>
<p>Groupe
cat: V
</p>
<p>Groupe
cat: N
</p>
<p>Connecteur
cat: E
</p>
<p>Groupe
cat: G
</p>
<p>Phrase
</p>
<p>Figure 7 : une figure tr&#232;s fr&#233;quente dans l&#8217;&#339;uvre de Madame de Lafayette
</p>
<p>Cette figure couvre tous les fragments suivants de Madame de Lafayette (et bien d&#8217;autres du
m&#234;me auteur) tandis qu&#8217;elle est pratiquement absente des textes des trois autres auteurs
consid&#233;r&#233;s : &quot;Le prince de Navarre prit la parole :&quot;, &quot;La reine de Navarre avait ses favorites&quot;,
&quot;Madame de Cl&#232;ves ne r&#233;pondit rien&quot;, &quot;Monsieur de Nemours prit la reine dauphine&quot;,&#8230;
</p>
<p>Il existe aussi beaucoup de fragments moins proches qui sont couverts par ce motifs. En voil&#224;
quelques uns : &quot;Madame de Chartres avait une opinion oppos&#233;e ;&quot;, &quot;Le comte de Tende aimait
d&#233;j&#224; le chevalier de Navarre ;&quot;, &quot;Le comte de Tende sentit son proc&#233;d&#233; dans toute sa duret&#233; ;&quot;,
&quot;La comtesse re&#231;ut ce billet avec joie&quot;, &#8230;
&#192; cet &#233;gard, notons que les mots &#171; comte &#187;, &#171; prince &#187;, &#171; madame &#187;, &#171; reine &#187;,
&#171; comtesse &#187;, &#171; monsieur &#187; sont bien souvent appari&#233;s dans ces motifs. Aucune s&#233;mantique
n&#8217;ayant &#233;t&#233; donn&#233;e &#224; notre algorithme, cet exemple montre comment la syntaxe v&#233;hicule parfois
la s&#233;mantique. Cette &#233;tude m&#233;rite bien &#233;videmment d&#8217;&#234;tre poursuivie plus longuement.
</p>
<p>Et, comme le lecteur peut l&#8217;imaginer, il y a bien d&#8217;autres hypoth&#232;ses que l&#8217;on souhaiterait
explorer &#224; partir des r&#233;sultats fournis par cet outil.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jean-Gabriel Ganascia
</p>
<p>7 Conclusion
Une nouvelle proc&#233;dure de fouille de texte a &#233;t&#233; d&#233;crite dans cet article. Nous avons prouv&#233;
qu&#8217;elle &#233;tait efficiente et f&#233;conde. La critique litt&#233;raire pourrait bien &#233;videmment b&#233;n&#233;ficier d&#8217;un
tel outil. Ainsi, il pourrait &#234;tre ins&#233;r&#233; dans un environnement de lecture &#233;lectronique pour aider
les chercheurs ou les &#233;tudiants. De m&#234;me, les didacticiens pourraient le mettre &#224; profit dans
l&#8217;enseignement des langues. Enfin, les motifs extraits pourraient &#234;tre r&#233;utilis&#233;s dans une
proc&#233;dure de synth&#232;se du langage naturel. Ainsi, le traitement du langage naturel pourrait
b&#233;n&#233;ficier des r&#233;sultats de cette recherche.
</p>
<p>R&#233;f&#233;rences
Crochemore M, Rytter W (1994), Text Algorithms, &#8220;Approximate pattern matching&#8221;, pp. 237-
251.
</p>
<p>Ganascia J-G (2001) Extraction of Recurrent Patterns from Stratified Ordered Trees, LIP6
internal report.
</p>
<p>Gusfield D. (1993) Efficient methods for multiple sequence Alignment with Guaranteed Error
Bounds , Bull. Math. Biol., 55:141-154.
</p>
<p>Karp R M., Miller R E., Rosenberg A L. (1972), Rapid Identification of Repeated Patterns in
Strings, Trees and Arrays, in Proc. 4th Annu. ACM Symp. Theory of Computing, pp. 125-
136.
</p>
<p>Landraud A M., Avril J-F, Chr&#233;tienne P (1989) An algorithm for Finding a Common Structure
Shared by a Family of Strings, IEEE transactions on Pattern Analysis and Machine Intelligence,
11 (8), pp. 890-895.
Lecomte J, (1998) BRILL14-JL5 / WINBRILL-0.3, user's manual available at INALF.
Rolland, P-Y, Ganascia J-G, (1999). Musical Pattern Extraction and Similarity Assessment. In
Miranda, E. (ed.). Readings in Music and Artificial Intelligence. Contemporary Music Studies -
Vol 20. Harwood Academic Publishers.
</p>
<p>Sagot, Viari A. (1996) A Double Combinatorial Approach to Discovering Patterns in Biological
Sequences, Combinatorial Pattern Matching, Springer Verlag, LNCS 1075, 168-208
</p>
<p>Sankoff D., Kruskal J.B. (1983), Time Warps, String Edits and Macromolecules: The Theory
and Practice of Sequence Comparison, Addison-Wesley, Reading, Mass..
Saporta G. (1990), Probabilit&#233;s, analyse des donn&#233;es et statistique, TECHNIP Publishing
Company, Paris.
</p>
<p>Soldano H., Viari A. Champesme M. (1995), Searching for Flexible Repeated Patterns Using a
new Transitive Similarity Relation&quot;, Pattern Recognition Letters, 16:233-246.
</p>
<p>Vergne J., (1999) Analyseur lin&#233;aire avec dictionnaire partiel, d&#233;cembre 1999, convention
d&#8217;utilisation de l&#8217;analyseur de Jacques Vergne.
</p>
<p>Zhang K. (1993) Fast algorithms for the constrained editing distance between ordered labeled
trees and related problems, report N&#176;361, Department of computer science, University of
Western Ontario, London, Ontario, Canada.</p>

</div></div>
</body></html>