<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Rep&#233;rage de structures th&#233;matiques dans des textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2001, Tours, 2-5 juillet 2001
</p>
<p>Rep&#233;rage de structures th&#233;matiques dans des textes
</p>
<p>Olivier Ferret (1,4), Brigitte Grau (1), Jean-Luc Minel (2) et Sylvie Porhiel (1,3)
</p>
<p>(1) LIMSI &#8211; CNRS
BP 13391403 Orsay Cedex
</p>
<p>Brigitte.Grau@limsi.fr
(2) CAMS, &#233;quipe LaLIC &#8211; CNRS, EHESS, Universit&#233; Paris-Sorbonne
</p>
<p>96 Boulevard Raspail 75 006 Paris
minel@msh-paris.fr
</p>
<p>(3) LATTICE &#8211; CNRS
ENS, 1 rue Maurice Arnoux &#8211; 92120 Montrouge
</p>
<p>sylvieporhiel@hotmail.com
(4) CEA DTI/SITI
</p>
<p>91191 Gif-sur-Yvette Cedex
olivier.ferret@cea.fr
</p>
<p>R&#233;sum&#233; &#8211; Abstract
Afin d&#8217;am&#233;liorer les performances des syst&#232;mes de r&#233;sum&#233; automatique ou de filtrage
s&#233;mantique concernant la prise en charge de la coh&#233;rence th&#233;matique, nous proposons un
mod&#232;le faisant collaborer une m&#233;thode d'analyse statistique qui identifie les ruptures
th&#233;matiques avec un syst&#232;me d'analyse linguistique qui identifie les cadres de discours.
</p>
<p>To improve the results of automatic summarization or semantic filtering systems concerning
thematic coherence, we propose a model which combines a statistic analysis system
identifying thematic breaks and a linguistic analysis system identifying discourse frames.
</p>
<p>Mots Clefs : Cadre th&#233;matique, coh&#233;rence th&#233;matique, exploration contextuelle.
</p>
<p>1 Introduction
La coh&#233;rence joue un r&#244;le essentiel au niveau de l&#8217;argumentation et de la progression
th&#233;matique. Toutefois, si la notion de coh&#233;rence a &#233;t&#233; abondamment comment&#233;e (Halliday et
al., 1976, Charolles, 1995, 1997), elle a &#233;t&#233; peu prise en compte dans les syst&#232;mes de r&#233;sum&#233;
automatique ou d&#8217;analyse th&#233;matique. En fait, lorsqu&#8217;il s&#8217;agit de rep&#233;rer automatiquement les
th&#233;matiques d&#8217;un texte et de prendre en charge la coh&#233;rence th&#233;matique, les syst&#232;mes de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Ferret, Brigitte Grau, Jean-Luc Minel et Sylvie Porhiel
</p>
<p>r&#233;sum&#233; automatique se heurtent &#224; toutes sortes de difficult&#233;s. Premi&#232;rement, les mod&#232;les qui
int&#232;grent et exploitent des connaissances ou des ressources linguistiques (Berri et al., 1996,
Mitra et al., 1997) ne s&#8217;appuient pas sur une vision globale du texte et des th&#232;mes abord&#233;s : ils
se fondent sur la notion de saillance d&#8217;une unit&#233; textuelle, d&#8217;une phrase ou d&#8217;un paragraphe, et
cette saillance est calcul&#233;e ind&#233;pendamment de la structure th&#233;matique du texte.
Deuxi&#232;mement, ces syst&#232;mes ne r&#233;pondent que partiellement aux besoins des utilisateurs : ce
qui est pertinent pour les uns ne l&#8217;est pas pour les autres (Sparck Jones, 1993, Minel et al.
1997), notamment parce qu&#8217;un utilisateur peut &#234;tre int&#233;ress&#233; par une th&#233;matique qui n&#8217;est pas
prise en charge directement par l&#8217;auteur.
</p>
<p>Afin d&#8217;am&#233;liorer la performance des syst&#232;mes de r&#233;sum&#233; automatique ou de filtrage
s&#233;mantique, nous proposons un mod&#232;le qui met en jeu deux id&#233;es essentielles1. D&#8217;une part, ce
syst&#232;me, pour r&#233;pondre aux attentes du maximum d'utilisateurs, doit reposer sur des
indicateurs linguistiques ind&#233;pendants des sujets abord&#233;s dans les textes trait&#233;s, l'int&#233;gration
de connaissances du domaine demeurant cependant possible. D&#8217;autre part, le syst&#232;me de
fouille et de filtrage doit pouvoir fournir des extraits de texte en rapport avec la th&#233;matique
int&#233;ressant l&#8217;utilisateur et donc tenir compte de la structure th&#233;matique du texte original.
</p>
<p>Les am&#233;liorations d&#233;crites dans cet article portent sur deux points qui sont &#233;troitement li&#233;s, &#224;
savoir : le rep&#233;rage des unit&#233;s th&#233;matiques (i.e. des segments fortement coh&#233;sifs) et la
segmentation des donn&#233;es textuelles (i.e. le d&#233;coupage des textes en unit&#233;s de nature textuelle
faisant r&#233;f&#233;rence &#224; un seul th&#232;me). Nous pr&#233;senterons tout d&#8217;abord deux approches qui
rep&#232;rent des th&#233;matiques, puis nous d&#233;crirons comment nous mod&#233;lisons les marqueurs
linguistiques dans la plate-forme Filtext (d&#233;velopp&#233;e au CAMS) au moyen du logiciel
ContextO. Enfin, nous illustrerons sur un article du Monde Diplomatique les premiers
r&#233;sultats obtenus.
</p>
<p>2 Deux approches pour rep&#233;rer les th&#233;matiques
</p>
<p>2.1 Une approche linguistique
</p>
<p>Nous proposons de rep&#233;rer les th&#233;matiques d&#8217;un texte dans la perspective textuelle de M.
Charolles (1997). Nous utiliserons la notion de cadres pour d&#233;signer les circonstances dans
lesquelles il faut envisager un certain &#233;tat ou une s&#233;rie d&#8217;&#233;v&#233;nements. Parmi les deux grandes
cat&#233;gories qui instancient des cadres :
</p>
<p>1. v&#233;rifonctionnels (univers de discours) qui pr&#233;cisent les circonstances dans lesquelles
une ou plusieurs propositions peuvent &#234;tre valid&#233;es (cadre spatial : En Cor&#233;e du Sud ;
cadre temporel : En 1990 ; cadre &#233;nonciatif : Selon le pr&#233;sident des &#201;tats-Unis ; cadre
de repr&#233;sentation : Dans le dernier film de Lelouch ; cadre de connaissances : Dans
la perspective de la physique quantique) ;
</p>
<p>                                                
</p>
<p>1
 Dans le cadre d&#8217;un projet de recherche auquel collabore le CEA, l&#8217;&#233;quipe LaLIC du CAMS, le LATTICE et
</p>
<p>le LIMSI. Ce projet est financ&#233; par l&#8217;Action Concert&#233;e Incitative Cognitique 2000.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de structures th&#233;matiques dans des textes
</p>
<p>2. th&#233;matiques qui pr&#233;cisent le th&#232;me de la ou des propositions qui suivent (En ce qui
concerne la Cor&#233;e du Sud).
</p>
<p>Nous ne traiterons que les expressions linguistiques qui instancient des cadres th&#233;matiques
comme : au sujet de, &#224; propos de, en ce qui concerne, au chapitre (de), concernant, sur, quant
&#224;, etc. Parmi leurs propri&#233;t&#233;s, on retiendra que les introducteurs th&#233;matiques sont
syntaxiquement peu soud&#233;s, qu&#8217;ils pr&#233;fixent une ou plusieurs propositions et qu&#8217;ils
partitionnent l&#8217;information. Ces expressions sont int&#233;ressantes dans la production d&#8217;un r&#233;sum&#233;
car ce sont des marqueurs linguistiques ind&#233;pendants du contenu s&#233;mantique des textes qui
peuvent donc &#234;tre r&#233;utilis&#233;s pour tout type de discours. En outre, l&#8217;auteur les emploie pour
signaler aux lecteurs comment il organise les informations ; les expressions introductrices de
cadres permettent aussi de mettre en valeur ce qui est important pour le r&#233;dacteur. Du point de
vue du lecteur, ces introducteurs de cadres sont des balises, des guides qui soulignent une
intention informationnelle de l&#8217;auteur du texte (Porhiel, 1998). Ils instaurent par cons&#233;quent
un lien de coh&#233;rence, produit par le r&#233;dacteur et reconstruit par le lecteur, dont les
introducteurs sont l&#8217;expression formelle.
</p>
<p>Selon la nature s&#233;mantique des cadres qui apparaissent &#224; la surface des textes, il est possible
de reconstruire plusieurs strat&#233;gies textuelles, chacune d&#8217;entre elles refl&#233;tant, en partie, les
int&#233;r&#234;ts du lecteur. Un texte peut ainsi &#234;tre organis&#233; en fonction de cadres temporels, spatiaux,
th&#233;matiques. Chacun des cadres rassemblent des informations qui sont li&#233;es &#224; un introducteur
et qui donc pr&#233;sentent une certaine unit&#233; ou continuit&#233;. La mise en place de ces cadres r&#233;pond
&#224; une strat&#233;gie du r&#233;dacteur qui r&#233;partit les informations dont il fait &#233;tat dans des rubriques
homog&#232;nes par rapport &#224; un certain trait (Virtanen, 1992 parle de strategic continuities).
L&#8217;&#233;tude de T. Virtanen sur les adverbiaux de lieu et de temps souligne que les continuit&#233;s dans
la strat&#233;gie textuelle &#171; cr&#233;ent coh&#233;sion et coh&#233;rence et [qu&#8217;] en m&#234;me temps, elles segmentent
le texte en signalant des fronti&#232;res textuelles de nature diff&#233;rente &#187; (Virtanen 1992 : 129 ;
notre traduction). Ces remarques peuvent s&#8217;appliquer &#224; l&#8217;ensemble des cadres.
</p>
<p>On comprend d&#232;s lors l&#8217;importance et la pertinence d&#8217;un d&#233;coupage en cadres dans une
analyse textuelle automatique. Ce d&#233;coupage s&#8217;av&#232;re essentiel pour le filtrage car un segment
extrait peut parfaitement &#234;tre int&#233;gr&#233; dans un cadre introduit par une expression qui ne figure
pas dans ce segment. Il y a donc tout int&#233;r&#234;t &#224; colliger et &#224; classer les expressions
potentiellement introductrices de cadres de discours.
</p>
<p>2.2 Une approche fond&#233;e sur des crit&#232;res statistiques
</p>
<p>La deuxi&#232;me approche se fonde sur deux m&#233;thodes d&#8217;analyse th&#233;matique de texte et vise &#224;
d&#233;terminer les endroits du texte o&#249; le sujet trait&#233; (le th&#232;me) change.
La premi&#232;re m&#233;thode d&#8217;analyse, fond&#233;e uniquement sur des crit&#232;res statistiques ou
num&#233;riques, part du constat que le d&#233;veloppement d&#8217;un th&#232;me entra&#238;ne la reprise de termes
sp&#233;cifiques, notamment lorsqu&#8217;il s&#8217;agit de textes techniques ou scientifiques. La
reconnaissance de parties de texte li&#233;es &#224; un m&#234;me sujet est alors fond&#233;e sur la distribution des
mots et leur r&#233;currence. Si un mot appara&#238;t souvent dans l&#8217;ensemble du texte, il est peu
significatif, alors que sa r&#233;p&#233;tition dans une zone limit&#233;e est tr&#232;s significative pour caract&#233;riser
le th&#232;me de cette partie de texte. Le principe g&#233;n&#233;ral appliqu&#233; par les diff&#233;rents syst&#232;mes
(Masson, 1995, Hearst, 1997) consiste &#224; associer un vecteur de descripteurs &#224; une zone de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Ferret, Brigitte Grau, Jean-Luc Minel et Sylvie Porhiel
</p>
<p>texte, o&#249; les descripteurs sont typiquement les mots lemmatis&#233;s du texte et leurs valeurs, le
nombre d&#8217;occurrences de ces termes dans la zone. Le produit scalaire de ces vecteurs permet
ensuite de regrouper ou de s&#233;parer les zones qu&#8217;ils d&#233;crivent s&#8217;ils sont proches ou non.
</p>
<p>La deuxi&#232;me m&#233;thode d&#8217;analyse, quant &#224; elle, utilise des sources de connaissances externes
non d&#233;di&#233;es. En g&#233;n&#233;ralisant la notion de r&#233;p&#233;tition de termes, la coh&#233;sion th&#233;matique d&#8217;un
texte se traduit par l&#8217;utilisation de termes faisant r&#233;f&#233;rence &#224; une m&#234;me entit&#233; par l&#8217;emploi de
synonymes, d&#8217;hyponymes, de mots li&#233;s s&#233;mantiquement ou appartenant au m&#234;me domaine.
Afin d&#8217;introduire ces caract&#233;ristiques dans une analyse vectorielle d&#8217;un texte, les travaux
d&#233;crits dans (Ferret et al., 1998) utilisent un r&#233;seau de collocations construit automatiquement
sur un corpus d&#8217;articles de journaux afin d&#8217;enrichir les vecteurs d&#233;crivant un paragraphe. Le
principe utilis&#233; consiste &#224; augmenter la valeur de descripteurs lorsqu&#8217;ils sont li&#233;s de mani&#232;re
significative dans le r&#233;seau &#224; un descripteur du paragraphe. Cette modification des vecteurs
tend ainsi &#224; rapprocher des paragraphes comportant des mots li&#233;s.
</p>
<p>Notre projet vise &#224; exploiter la compl&#233;mentarit&#233; des approches statistiques et de l&#8217;approche
linguistique. Les deux m&#233;thodes statistiques offrent le moyen de segmenter th&#233;matiquement
des textes de diff&#233;rents types en s&#8217;appuyant sur un crit&#232;re de distribution lexicale. Afin
d&#8217;affiner la d&#233;cision de lier ou de s&#233;parer des segments, nous proposons d&#8217;utiliser la pr&#233;sence
de marqueurs linguistiques conjointement &#224; ce crit&#232;re. Nous mettons ainsi en &#339;uvre une
analyse globale, qui consid&#232;re la r&#233;partition du lexique sur l&#8217;ensemble du texte, et nous la
compl&#233;tons par une analyse locale, qui met en &#233;vidence des marques de segmentation et de
structuration argumentative (points de liaisons et ruptures potentielles). En ce qui concerne le
rep&#233;rage des unit&#233;s th&#233;matiques, il s'agira de faire collaborer des proc&#233;dures de calcul prenant
en compte des indicateurs lexicaux (les introducteurs th&#233;matiques), &#224; m&#234;me de fournir tr&#232;s
rapidement des indications sur le th&#232;me d'un segment de texte (i.e. une unit&#233; textuelle
renvoyant &#224; un seul th&#232;me) et les changements th&#233;matiques d'un segment &#224; un autre, avec des
marqueurs linguistiques porteurs d&#8217;informations quant au r&#244;le des segments du point de vue
argumentatif ou discursif.
</p>
<p>3 Mod&#233;lisation des marqueurs linguistiques
</p>
<p>3.1 La m&#233;thode d&#8217;exploration contextuelle
</p>
<p>Pour d&#233;tecter les introducteurs th&#233;matiques, nous utilisons la m&#233;thode d&#8217;exploration
contextuelle (Descl&#233;s et al., 1997, Minel et al., 2001) qui identifie des connaissances
linguistiques en les restituant dans leurs contextes et en les organisant en fonction de t&#226;ches
sp&#233;cialis&#233;es. Tout comme la th&#233;orie des cadres, cette m&#233;thode d&#8217;analyse s&#8217;inscrit dans une
optique textuelle : elle utilise une notion de contexte textuel qui s&#8217;exprime dans une r&#232;gle
d&#8217;exploration contextuelle. Une r&#232;gle d&#8217;exploration contextuelle d&#233;finit un espace de
recherche : il s&#8217;agit d&#8217;un segment textuel2 toujours d&#233;termin&#233; &#224; partir de la pr&#233;sence d&#8217;un
marqueur d&#233;clencheur, appel&#233; indicateur (par ex. les introducteurs th&#233;matiques) ; des indices
                                                
</p>
<p>2
 Un segment textuel est consid&#233;r&#233; comme une suite wi ou l&#8217;indicei repr&#233;sente le rang de l&#8217;unit&#233; lexicale dans le
</p>
<p>segment. La position d&#8217;un marqueur est alors rep&#233;r&#233;e comme un couple (k, l) repr&#233;sentant respectivement le
rang de d&#233;but et le rang final de ce marqueur dans le segment textuel.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de structures th&#233;matiques dans des textes
</p>
<p>compl&#233;mentaires doivent en g&#233;n&#233;ral &#234;tre recherch&#233;s dans l&#8217;espace de recherche en vue de
confirmer ou d&#8217;infirmer la valeur s&#233;mantique de l&#8217;indicateur rep&#233;r&#233; (par ex. position dans la
phrase, d&#233;clencheur non suivi de certains noms, adjectifs, etc.). L&#8217;ensemble de ces
connaissances linguistiques sont organis&#233;es dans un mod&#232;le conceptuel (Ben Hazez et Minel,
2000, Minel et al., 2001) et exploit&#233;es par la plate-forme logicielle ContextO.
</p>
<p>3.2 L&#8217;analyse linguistique des introducteurs th&#233;matiques dans le cadre de
la m&#233;thode d&#8217;exploration contextuelle
</p>
<p>Nous avons organis&#233; les connaissances linguistiques issues de l&#8217;analyse linguistique en tenant
compte des contraintes de ce cadre d&#8217;analyse et des contraintes de la mod&#233;lisation. Deux types
d&#8217;information sont pertinents : les informations formelles et les indices compl&#233;mentaires.
</p>
<p>Les informations formelles relatives aux introducteurs th&#233;matiques ne sont pas applicables &#224;
l&#8217;ensemble des &#233;l&#233;ments de ce groupe, &#224; l&#8217;exception de la casse. Chaque marqueur doit &#234;tre
consid&#233;r&#233; s&#233;par&#233;ment : certains sont simples (concernant), d&#8217;autres sont compos&#233;s (en ce qui
concerne) ; certains acceptent des variations en nombre (au chapitre (de), aux chapitres (de))
ou des variations aspectuelles (pour ce qui est/&#233;tait), d&#8217;autres ont un paradigme de
pr&#233;positions et de d&#233;terminants (en/pour ce qui concerne), d&#8217;autres encore acceptent des
insertions et sont donc des lexies discontinues (en ce qui concerne particuli&#232;rement cette loi).
</p>
<p>Les indices compl&#233;mentaires, quant &#224; eux, permettent de ne pas extraire des lexies ou, au
contraire, permettent de renforcer leur reconnaissance dans les textes. Ce sont ou bien des
indices g&#233;n&#233;raux qui s&#8217;appliquent &#224; tous les introducteurs th&#233;matiques ou bien des indices
sp&#233;cifiques qui ne s&#8217;appliquent qu&#8217;&#224; un ou n indicateur(s) particulier(s). Les introducteurs
th&#233;matiques sont syntaxiquement d&#233;tach&#233;s et plac&#233;s &#224; l&#8217;initiale. Toutefois, ils peuvent aussi
&#234;tre pr&#233;c&#233;d&#233;s d&#8217;autres constituants (adverbes &#233;num&#233;ratifs, des cadres spatiaux, etc) (2) ou de
signes typographiques (1), ce qui prouve que la caract&#233;ristique positionnelle est trop forte.
Pour pouvoir &#234;tre correctement rep&#233;r&#233;es par le syst&#232;me, les lexies doivent &#234;tre combin&#233;es avec
des indices qui renforcent ou infirment leur reconnaissance, et ce pour &#233;viter de rep&#233;rer des
lexies formellement identiques, d&#233;pendant d&#8217;un autre constituant (3) :
</p>
<p>1) Des sc&#233;narios de politique-fiction s'&#233;laborent: &#224; propos de Montr&#233;al,
on &#233;voque ouvertement Belfast, Sarajevo ou J&#233;rusalem.
</p>
<p>2) Enfin, en ce qui concerne ce catalogue de mesures pour garantir le
d&#233;veloppement durable, (...) les 178 d&#233;l&#233;gations (...)
</p>
<p>3) Je souhaite apporter des pr&#233;cisions en ce qui concerne l&#8217;article.
</p>
<p>Mais ces indices g&#233;n&#233;raux ne suffisent pas toujours &#224; reconna&#238;tre les lexies qui sont des
introducteurs. Des indices sp&#233;cifiques doivent s&#8217;ajouter aux indices g&#233;n&#233;raux pour lever des
ambigu&#239;t&#233;s syntaxiques ou lexicales particuli&#232;res &#224; un petit nombre d&#8217;introducteurs.
L&#8217;introducteur au chapitre illustre le cas des ambigu&#239;t&#233;s lexicales. Pour &#234;tre un introducteur
th&#233;matique (Au chapitre soci&#233;t&#233;, le pr&#233;sident propose), ce marqueur ne doit pas &#234;tre suivi de
certains adjectifs (Au chapitre suivant, l&#8217;auteur affirme que), de chiffres (Et, au chapitre XX
on peut lire ) ou de guillemets (Au chapitre &#171; Technologie &#187;, l&#8217;&#233;tude de l&#8217;OCDE affirme).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Ferret, Brigitte Grau, Jean-Luc Minel et Sylvie Porhiel
</p>
<p>3.3 Expression des r&#232;gles d&#8217;exploration contextuelle
</p>
<p>Les r&#232;gles d&#8217;exploration contextuelle, ind&#233;pendantes les unes des autres et organis&#233;es en
t&#226;ches (Ben Hazez et Minel, 2000), sont d&#8217;abord exprim&#233;es dans un langage formel de type
d&#233;claratif puis traduites en Java. Pour la t&#226;che de rep&#233;rage des structures th&#233;matiques, nous
avons construit sept r&#232;gles qui rep&#232;rent les configurations textuelles suivantes : a) l&#8217;indicateur
se trouve en position initiale ; b) l&#8217;indicateur se trouve dans un item d&#8217;&#233;num&#233;ration ; c)
l&#8217;indicateur se trouve apr&#232;s un ou plusieurs groupe(s) de mots qu&#8217;il est possible de recenser
exhaustivement ; d) l&#8217;indicateur introduit un &#233;nonc&#233; th&#233;matique apr&#232;s un adverbe s&#233;lectif. Un
premier test, effectu&#233; sur un &#233;chantillon de textes journalistiques (du Monde Diplomatique) de
trois &#224; six pages, nous a permis de d&#233;gager les r&#233;sultats suivants :
</p>
<p>&#8226; Le rep&#233;rage des introducteurs (&#224; partir de 70 occurrences de marqueurs) plac&#233;s &#224;
l'initiale ou apr&#232;s un autre groupe de mots est satisfaisant. Les r&#232;gles permettent
&#233;galement de ne pas rep&#233;rer les phrases tronqu&#233;es pr&#233;c&#233;d&#233;es d&#8217;un adverbe s&#233;lectif.
</p>
<p>&#8226; Il est n&#233;cessaire de compl&#233;ter les connaissances linguistiques acquises et les r&#232;gles
concernant le d&#233;tachement des introducteurs doivent &#234;tre affin&#233;es.
</p>
<p>&#8226; Le syst&#232;me peut &#234;tre confront&#233; &#224; des probl&#232;mes de typographie quand, dans les
textes, les mots de d&#233;but de paragraphe sont &#233;crits en majuscules. La plate-forme
ContextO est sensible &#224; la casse et ce jeu de majuscules et de minuscules joue un r&#244;le
important. Le texte trait&#233; n&#8217;est pas syst&#233;matiquement converti en minuscules car cette
transformation inhiberait la reconnaissance des entit&#233;s nomm&#233;es.
</p>
<p>&#8226; Enfin, dans sa version actuelle, ContextO n&#8217;int&#232;gre pas d&#8217;analyseur morpho-
syntaxique, ce qui oblige parfois &#224; accepter certaines ind&#233;terminations. Toutefois, de
nombreux exemples montrent que l&#8217;expression de patrons morpho-syntaxiques
comme par exemple &#171; Introducteur + ADJ &#187; sont beaucoup trop g&#233;n&#233;raux.
</p>
<p>4 Premiers r&#233;sultats
L&#8217;extrait analys&#233; est tir&#233; d&#8217;un texte de quatre pages du Monde Diplomatique (voir annexe) et
d&#233;veloppe un des points qui ont favoris&#233; la r&#233;ussite &#233;conomique de la C&#244;te d&#8217;Ivoire et de la
Cor&#233;e du sud. Dans cet extrait, les cadres soulignent la coh&#233;rence et la coh&#233;sion du passage, et
segmentent le texte en unit&#233;s th&#233;matiques.
</p>
<p>4.1 Analyse linguistique
</p>
<p>Comme nous l&#8217;avons d&#233;j&#224; soulign&#233;, les cadres sont des guides qui permettent une interaction
entre coh&#233;rence et coh&#233;sion et qui participent &#224; la dynamique du texte. Deux sortes de cadres,
qui correspondent &#224; deux strat&#233;gies textuelles, sont instanci&#233;s dans ce passage : des cadres
th&#233;matiques (en ce qui concerne (...), quant au (...), pour ce qui concerne (...)) et des cadres
spatiaux (en C&#244;te-d&#8217;Ivoire, en Cor&#233;e du Sud). Les premiers soulignent le passage d&#8217;une
th&#233;matique &#224; une autre, les seconds le passage d&#8217;un point particulier &#224; un autre (ici pays). Les
introducteurs th&#233;matiques assurent la coh&#233;rence et la coh&#233;sion g&#233;n&#233;rale du passage. Les trois
th&#233;matiques qu&#8217;ils r&#233;-introduisent ont &#233;t&#233; pr&#233;c&#233;demment &#233;num&#233;r&#233;es en termes identiques et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de structures th&#233;matiques dans des textes
</p>
<p>dans le m&#234;me ordre. Les cadres spatiaux, eux, servent &#224; illustrer localement les th&#233;matiques
introduites par les introducteurs th&#233;matiques. Conform&#233;ment &#224; ce qui a &#233;t&#233; annonc&#233; d&#232;s le
d&#233;but, il y en a toujours deux, ce qui assure la &#171; coh&#233;rence illustrative &#187; de l&#8217;ensemble du
texte.
</p>
<p>En ce qui concerne la segmentation, les expressions introductrices de cadre sont d&#233;tach&#233;es en
d&#233;but de phrase. Les trois cadres th&#233;matiques apparaissent en d&#233;but de paragraphe ce qui
facilite la lecture car l&#8217;alin&#233;a &#171; signale au lecteur qu&#8217;il vient de traiter une unit&#233; de sens et,
qu&#8217;il va passer &#224; une unit&#233; ult&#233;rieure &#187; (Bessonnat, 1988). Chaque introducteur th&#233;matique
introduit ici une nouvelle unit&#233; th&#233;matique (et par l&#224; m&#234;me ferme la pr&#233;c&#233;dente) qui
correspond au paragraphe, ce principe n&#8217;&#233;tant cependant pas absolu car un cadre th&#233;matique
peut en subordonner un ou plusieurs autres. Chaque point introduit par un introducteur
th&#233;matique est ensuite d&#233;velopp&#233; au regard de deux exemples la C&#244;te-d&#8217;Ivoire et la Cor&#233;e du
Sud introduits par des en qui instancient des cadres spatiaux. Ces derniers se d&#233;limitent l&#8217;un
l&#8217;autre et sont subordonn&#233;s aux cadres th&#233;matiques du d&#233;but de chaque paragraphe.
</p>
<p>En cons&#233;quence, dans cet extrait, on a une double structuration et une double coh&#233;rence.
Chacune correspond &#224; une strat&#233;gie textuelle et est instanci&#233;e par des expressions
linguistiques diff&#233;rentes exer&#231;ant un contr&#244;le interpr&#233;tatif sp&#233;cifique : les expressions qui
instancient des cadres sont des marques linguistiques de surface qui fournissent des
indications s&#233;rieuses de marques de coh&#233;rence et de segmentation.
</p>
<p>4.2 Analyse statistique
</p>
<p>La figure 1 illustre les r&#233;sultats de la m&#233;thode de segmentation d&#233;crite dans (Masson 1995)3
sur le texte pris comme exemple. L&#8217;abscisse de chaque point identifie une fronti&#232;re entre deux
paragraphes et son ordonn&#233;e donne la valeur de coh&#233;sion entre les deux paragraphes. Plus
cette valeur est &#233;lev&#233;e et plus les deux paragraphes sont susceptibles d&#8217;&#234;tre li&#233;s sur le plan
th&#233;matique. Nous avons fait figurer sur la courbe le seuil SL, valeur de coh&#233;sion au dessus de
laquelle deux paragraphes sont jug&#233;s th&#233;matiquement li&#233;s, et le seuil SC, valeur de coh&#233;sion
en dessous de laquelle deux paragraphes sont jug&#233;s th&#233;matiquement distincts. Ces seuils sont
d&#233;termin&#233;s en fonction de la distribution des valeurs de coh&#233;sion (Cf. (Masson 1998) pour une
pr&#233;sentation d&#233;taill&#233;e de leur calcul). Entre ces deux valeurs, la coh&#233;sion calcul&#233;e est jug&#233;e
plus faiblement significative et l&#8217;information r&#233;sultant de la pr&#233;sence d&#8217;&#233;ventuels indices
linguistiques est alors consid&#233;r&#233;e comme pr&#233;pond&#233;rante.
</p>
<p>C&#8217;est le cas par exemple pour les paragraphes 12 &#224; 14, qui illustrent l&#8217;int&#233;r&#234;t des seuils fix&#233;s et
la compl&#233;mentarit&#233; avec l&#8217;analyse linguistique. Ces paragraphes abordent chacun un th&#232;me
sp&#233;cifique mais en &#233;voquant les m&#234;mes acteurs (C&#244;te d&#8217;Ivoire, Cor&#233;e du Sud, firmes), ce qui
rejoint la &#171; coh&#233;rence illustrative &#187; du texte. L&#8217;analyse statistique trouve donc des liens entre
ces paragraphes &#8211; en particulier entre le &#167;13 et le &#167;14 &#8211; mais en nombre restreint, d&#8217;o&#249; des
valeurs de coh&#233;sion entre les seuils SC et SL. Les introducteurs de cadre situ&#233;s au d&#233;but de ces
paragraphes (en ce qui concerne, quant au, pour ce qui concerne) permettent alors de d&#233;passer
</p>
<p>                                                
</p>
<p>3
 Les m&#233;thodes d&#233;crites dans (Ferret et al., 1998) et dans (Hearst, 1997) donnent des r&#233;sultats globalement
</p>
<p>similaires.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Ferret, Brigitte Grau, Jean-Luc Minel et Sylvie Porhiel
</p>
<p>l&#8217;incertitude de l&#8217;analyse statistique et d&#8217;identifier les changements de th&#232;mes.
</p>
<p>6-7
</p>
<p>8-93-4
</p>
<p>5-6
</p>
<p>9-10
</p>
<p>7-8
</p>
<p>4-5
</p>
<p>10-111-2
</p>
<p>2-3
</p>
<p>14-15
</p>
<p>11-12
</p>
<p>12-13
</p>
<p>13-14
</p>
<p>0
0,1
0,2
0,3
0,4
0,5
0,6
0,7
0,8
</p>
<p>0 5 10 15Y = coh&#233;sion inter-paragraphe
X = paragraphes
</p>
<p>SC
</p>
<p>SL
</p>
<p>Figure 1 : Rep&#233;rage de la structure th&#233;matique par l&#8217;analyse statistique
</p>
<p>Plus globalement, la figure 1 montre que l&#8217;analyse statistique d&#233;coupe le texte en grandes
sections. Elle identifie les ruptures majeures, comme celle autour du paragraphe 8. Pour des
coupures moins nettes, les informations fournies peuvent &#234;tre confirm&#233;es par la pr&#233;sence de
marqueurs. Nous travaillons actuellement &#224; l&#8217;&#233;laboration des algorithmes et des mod&#232;les qui
nous permettront de g&#233;n&#233;raliser l&#8217;int&#233;gration des deux approches.
</p>
<p>5 Conclusion
Ces premiers r&#233;sultats soulignent que la coh&#233;rence intervient &#224; plusieurs niveaux et que les
moyens linguistiques qui les expriment sont diff&#233;rents. Pour ce qui est de la prise en charge de
la coh&#233;rence th&#233;matique, trois points nous semblent int&#233;ressants &#224; d&#233;velopper ult&#233;rieurement.
Premi&#232;rement, les conditions dans lesquelles les introducteurs th&#233;matiques renforcent les
r&#233;sultats de la segmentation th&#233;matique. Deuxi&#232;mement, les conditions dans lesquelles les
introducteurs corrigent les r&#233;sultats de la segmentation th&#233;matique. Des indices annoncent des
th&#233;matiques et s&#8217;il &#233;tait possible de rep&#233;rer des phrases introductrices de th&#232;mes (Cf. derni&#232;re
phrase du &#167; 11), la coh&#233;rence th&#233;matique des r&#233;sum&#233;s en serait grandement am&#233;lior&#233;e. Enfin,
il faudrait prendre en compte les diff&#233;rents niveaux de segmentation, en utilisant les
expressions linguistiques instanciant des cadres &#224; l&#8217;int&#233;rieur m&#234;me des paragraphes.
</p>
<p>Remerciements
Les auteurs remercient l&#8217;ensemble des participants qui collaborent &#224; ce projet et qui ont
aliment&#233; par leurs diff&#233;rents travaux notre r&#233;flexion. La plate-forme ContextO est le fruit de la
collaboration entre l&#8217;Universit&#233; Paris-Sorbonne et l&#8217;Universit&#233; de la R&#233;publique (Uruguay) et
a re&#231;u le soutien du programme Ecos-Sud.
</p>
<p>R&#233;f&#233;rences
Ben Hazez, S., Minel J-L. (2000). Designing Tasks of Identification of Complex Patterns
Used for Text Filtering. RIAO&#8217;2000, Paris, 1558-1567.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de structures th&#233;matiques dans des textes
</p>
<p>Berri, J, Cartier, E., Descl&#232;s, J-P., Jackiewicz, A., Minel, J-L. (1996). SAFIR, syst&#232;me
automatique de filtrage de textes, Actes du colloque TALN&#8217;96, Marseille.
</p>
<p>Bessonnat, D. (1988). Le d&#233;coupage en paragraphes et ses fonctions. Pratiques 57, 81-105.
</p>
<p>Charolles, M. (1997). L&#8217;encadrement du discours - Univers, champs, domaines et espace.
Cahier de recherche linguistique, 6.
</p>
<p>Charolles, M. (1995). Coh&#233;sion, coh&#233;rence et pertinence du discours. Travaux de linguistique,
29, 125-151.
</p>
<p>Descl&#233;s, J-P., Cartier E., Jackiewicz, A., Minel J-L. (1997). Textual Processing and
Contextual Exploration Method In CONTEXT 97. Universidade Federal do Rio de Janeiro,
Br&#233;sil : 189-197.
</p>
<p>Ferret, O., Grau, B., Masson, N. (1998). Thematic segmentation of texts: two methods for two
kinds of texts, Actes ACL-COLING&#8217;98, Montr&#233;al, Canada, volume 1 : 392-396.
</p>
<p>Halliday, M.A.K., Hasan, R. (1976). Cohesion in English., London, Longman.
</p>
<p>Hearst, M. A. (1997). TextTiling: Segmenting Text into Multi-paragraph Subtopic Passages,
Computational Linguistics, 23, 1, 33-64.
</p>
<p>Masson, N. (1998). M&#233;thodes pour une g&#233;n&#233;ration variable de r&#233;sum&#233; automatique : vers un
syst&#232;me de r&#233;duction de texte. Th&#232;se de doctorat, Universit&#233; Paris XI.
</p>
<p>Masson, N. (1995). An automatic method for document structuring , Actes 18th International
Conference on Research and Development in Information Retrieval, ACM-SIGIR , Seattle,
USA, 372-373.
</p>
<p>Mitra, M., Singhal, A., Buckely C. (1997). Automatic Summarization by Paragraph
Extraction, Proceedings of a Workshop : Intelligent Scalable Text Summarization, EACL 97,
Madrid, 39-46.
</p>
<p>Minel , J-L., Nugier, S., Piat, G.  (1997). How to appreciate the Quality of Automatic Text
Summarization. Workshop Intelligent Scalable Text Summarization, EACL 97, Madrid, 25-
30.
</p>
<p>Minel J-L., Cartier, E , Crispino, G., Descl&#233;s J-P, Ben Hazez S, Jackiewicz, A. (2001) R&#233;sum&#233;
automatique par filtrage s&#233;mantique d&#8217;informations dans des textes. Technique et Science
Informatiques, Paris, n&#176; 3.
Porhiel, S. (1998). Les introducteurs d&#8217;int&#233;r&#234;t. Th&#232;se, Paris XIII. Diffusion, Presses du
Septentrion.
</p>
<p>Sparck Jones, K. (1993). What might be in a summary ?, in Knorz, Krause and Wormser-
Hacker (eds.). Information Retrieval 93, 9-26, Universitates verlag Konstanz.
Virtanen, T. (1992). Discourse Functions of Adverbial Placement in English. Abo, Abo
Akademi University Press.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Olivier Ferret, Brigitte Grau, Jean-Luc Minel et Sylvie Porhiel
</p>
<p>Annexe
Les lexies en gras sont des introducteurs th&#233;matiques, celles en italique, des introducteurs
spatiaux.
</p>
<p>[&#167;11] L'importance quantitative de l'investissement &#233;tranger est cependant moins significative de
l'impact des firmes multinationales que le type de secteurs o&#249; elles se localisent. En C&#244;te-d'Ivoire,
les firmes contr&#244;lent pratiquement l'ensemble de l'industrie produisant pour le march&#233; interne. Au
contraire, l'acc&#232;s &#224; ce dernier leur est interdit dans la plupart des branches en Cor&#233;e du Sud. Cette
situation a des cons&#233;quences d&#233;cisives, particuli&#232;rement sur trois variables strat&#233;giques du
processus de d&#233;veloppement : l'allocation des ressources, le mod&#232;le de consommation et
l'int&#233;gration en amont de l'activit&#233; industrielle.
</p>
<p>[&#167;12] En ce qui concerne l'allocation des ressources, en C&#244;te-d'Ivoire, l'exc&#233;dent pr&#233;lev&#233; par
l'Etat et consacr&#233; &#224; l'expansion du march&#233; int&#233;rieur transite n&#233;cessairement par les firmes
multinationales, finan&#231;ant en grande partie leur implantation ou l'&#233;largissement de leur capacit&#233;
productive. En Cor&#233;e du Sud, les firmes multinationales sont exclusivement concentr&#233;es dans les
branches exportatrices, ce qui permet &#224; l'Etat de pr&#233;lever des ressources externes additionnelles
que les entreprises publiques ou priv&#233;es cor&#233;ennes utilisent selon les orientations pr&#233;cises du plan
dans le cadre d'une strat&#233;gie d'int&#233;gration industrielle orient&#233;e vers le march&#233; int&#233;rieur.
</p>
<p>[&#167;13] QUANT au mod&#232;le de consommation, en C&#244;te-d'Ivoire, la production de biens rel&#232;ve de la
strat&#233;gie propre &#224; la firme multinationale, sans rapport avec le niveau moyen des revenus et les
habitudes traditionnelles de consommation. Ce ph&#233;nom&#232;ne suscite ou accentue &#224; son tour la
distribution in&#233;galitaire du revenu. En Cor&#233;e du Sud, la diversification des biens offerts aux
consommateurs est un processus progressif et contr&#244;l&#233; en relation &#233;troite avec la capacit&#233; d'achat
de la population. Cette correspondance entre niveau de revenu et offre de biens contribue
fortement &#224; att&#233;nuer les tendances &#224; la r&#233;partition in&#233;galitaire des revenus. La politique du
pouvoir, dans ce domaine, a &#233;t&#233; tr&#232;s ferme. Les biens de consommation les plus modernes -
&#233;lectrom&#233;nager, appareils optiques, &#233;lectronique grand public, - fabriqu&#233;s en grande partie par les
firmes multinationales, ont &#233;t&#233; longtemps exclusivement destin&#233;s &#224; l'exportation. La population
cor&#233;enne n'a eu acc&#232;s &#224; ces biens qu'une fois satisfaits les besoins essentiels en mati&#232;re de
nourriture et de v&#234;tement. Mais le d&#233;veloppement du march&#233; interne n'a pas profit&#233; aux firmes
multinationales qui en ont &#233;t&#233; pratiquement exclues au profit des firmes locales. Dans la branche
&#233;lectronique grand public, par exemple, les ventes sur le march&#233; interne sont r&#233;alis&#233;s pour 95,4 %
par les entreprises cor&#233;ennes et pour 4,4 % par des entreprises en joint venture.
</p>
<p>[&#167;14] Enfin, pour ce qui concerne l'int&#233;gration en amont de l'activit&#233; industrielle, dans un pays
comme la C&#244;te-d'Ivoire, o&#249; le secteur industriel est contr&#244;l&#233; par les firmes &#233;trang&#232;res, la taille du
march&#233; a constitu&#233; l'obstacle insurmontable &#224; la diversification de la structure productive. En
cons&#233;quence, le processus reste bloqu&#233; au niveau des branches l&#233;g&#232;res. En Cor&#233;e du Sud, la
ma&#238;trise absolue de l'Etat sur la d&#233;cision &#233;conomique au niveau du march&#233; interne a permis ce
que l'on appelle la &quot;remont&#233;e des fili&#232;res&quot; vers les industries lourdes - sid&#233;rurgie, chimie et
industries de biens d'&#233;quipement - et assur&#233; une autonomie notable du processus
d'industrialisation, m&#234;me si, dans certains secteurs, la dimension du march&#233; &#233;tait manifestement
insuffisante.
</p>
<p>[&#167;15] Cette rapide comparaison montre que le diagnostic &#233;tabli par les analystes des probl&#232;mes du
d&#233;veloppement n'est pas aussi faux que cela et que la th&#233;rapie propos&#233;e, qui est une &quot;th&#233;rapie
douce&quot;, loin de conduire &#224; des situations apocalyptiques, peut se r&#233;v&#233;ler efficace.</p>

</div></div>
</body></html>