<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un corpus fran&#231;ais arbor&#233; : quelques interrogations</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2001, Tours, 2-5 juillet 2001
</p>
<p>Un corpus fran&#231;ais arbor&#233; : quelques interrogations
</p>
<p>Anne Abeill&#233; (1), Lionel Cl&#233;ment (1), Alexandra Kinyon (1)(2), Fran&#231;ois
Toussenel (1)
</p>
<p>(1) UFRL, Universit&#233; Paris 7
(2) IRCS - Upenn
</p>
<p>{abeille, clement, kinyon, ftoussen}@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233; - Abstract
Dans cet article nous pr&#233;sentons les premiers r&#233;sultats de l&#8217;exploitation d&#8217;un Corpus fran&#231;ais
arbor&#233; (Abeill&#233; et al., 2001). Le corpus comprend 1 million de mots enti&#232;rement annot&#233;s
et valid&#233; pour les parties du discours, la morphologie, les mots compos&#233;s et les lemmes, et
partiellement annot&#233;s pour les constituants syntaxiques. Il comprend des extraits de journaux
parus entre 1989 et 1993 et &#233;crits par divers auteurs, et couvre diff&#233;rents th&#232;mes (&#233;conomie,
litt&#233;rature, politique, etc.). Apr&#232;s avoir expliqu&#233; comment ce corpus a &#233;t&#233; construit, et comment
l&#8217;exploiter &#224; l&#8217;aide d&#8217;un outil de recherche sp&#233;cifique, nous exposerons quelques r&#233;sultats
linguistiques concernant les fr&#233;quences et les pr&#233;f&#233;rences lexicales et syntaxiques. Nous
expliquerons pourquoi nous pensons que certains de ces r&#233;sultats sont pertinents en linguistique
th&#233;orique et en psycholinguistique.
</p>
<p>This paper presents the first linguistic results exploiting a new treebank for French (Abeill&#233;
et al., 2001). The corpus comprises 1 million words fully annotated and disambiguated for
parts of speech, inflectional morphology, compounds and lemmas, and partially annotated with
syntactic constituents. It is made of extracts from newspapers ranging from 1989 to 1993 and
written by different authors, and covers a variety of subjects (economy, literature, politics, etc.).
After explaining how this corpus was built, and how it can be used with a specific search tool,
we present some linguistic results obtained when searching the corpus for lexical or syntactic
frequencies and preferences, and explain why we think some of these results are relevant both
for theoretical linguistics and psycholinguistics.
</p>
<p>Mots-clefs &#8211; Keywords : Corpus arbor&#233;, corpus journalistique, fran&#231;ais, syntaxe. Treebank,
French, Newspaper corpora, syntax.
</p>
<p>1 La construction du corpus annot&#233;
</p>
<p>1.1 Motivation
</p>
<p>Comme le notent (Habert et al., 1997), aucun corpus arbor&#233; n&#8217;est actuellement disponible pour
le fran&#231;ais. Dans le cadre des r&#233;cents projets fran&#231;ais (GRACE, CLIF) et europ&#233;ens (Mul-
text, Parole), des corpus litt&#233;raires (Frantext) et journalistiques (Le Monde) commencent &#224;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Abeill&#233;, Cl&#233;ment, Kinyon, Toussenel
</p>
<p>&#234;tre disponibles. Mais ceux qui sont annot&#233;s le sont seulement pour les cat&#233;gories morpho-
syntaxiques, et sans validation humaine syst&#233;matique.
Le corpus journalistique d&#8217;environ 1 million de mots annot&#233; syst&#233;matiquement pour la morpho-
syntaxe et la syntaxe (avec contr&#244;le de qualit&#233;) doit pouvoir servir aussi bien aux linguistes
informaticiens qu&#8217;aux linguistes traditionnels comme aux psycholinguistes.
Le but de l&#8217;annotation morpho-syntaxique est de fournir une ressource pour entra&#238;ner un seg-
menteur ou un &#233;tiqueteur automatique, extraire de fa&#231;on automatique des dictionnaires de
formes, d&#8217;&#233;valuer des &#233;tiqueteurs existants.
Le but de l&#8217;annotation syntaxique est de pouvoir entra&#238;ner des analyseurs automatiques, extraire
de fa&#231;on automatique des grammaires et des dictionnaires de contexte, d&#8217;&#233;valuer des analyseurs
existants, mais aussi d&#8217;affiner nos connaissances sur des constructions souvent peu d&#233;crites, et
&#233;galement de mesurer l&#8217;&#233;cart entre le possible et l&#8217;attest&#233; (par exemple, quels adverbes trouve-
t-on en t&#234;te de phrase ou en t&#234;te de groupe nominal ? Quels verbes trouve-t-on au passif ? Les
sujets phrastiques sont-ils toujours extrapos&#233;s ?).
Nous souhaitons pr&#233;senter un type d&#8217;annotations param&#233;trable, permettant &#224; l&#8217;utilisateur de
prendre en compte ou d&#8217;ignorer nos mots compos&#233;s, de visualiser tout ou partie des informations
annot&#233;es.
</p>
<p>1.2 Choix du corpus
Les textes que nous avons choisi d&#8217;&#233;tiqueter sont extraits d&#8217;un ensemble d&#8217;articles du journal
Le Monde de 1989 &#224; 1993 compil&#233;s par Linguistic Data Consortium (LDC). Nous avons s&#233;lec-
tionn&#233; 1 million de mots (875 000 mots sans ponctuation, 920 000 mots avec les mots com-
pos&#233;s regroup&#233;s, 17 000 lemmes diff&#233;rents, 33 000 phrases) en puisant de fa&#231;on al&#233;atoire dans
l&#8217;ensemble de la base pour faire varier les dates de parution des articles, leurs auteurs et leurs
th&#232;mes. Sans &#234;tre repr&#233;sentatif des diff&#233;rentes vari&#233;t&#233;s de fran&#231;ais, le corpus couvre diff&#233;rents
domaines puisque les pages culturelles, &#233;conomiques ou sportives n&#8217;ont pas &#233;t&#233; exclues.
</p>
<p>1.3 Les choix d&#8217;annotation
Nous souhaitons que le corpus annot&#233; puisse servir aussi bien aux informaticiens (&#224; des fins
d&#8217;&#233;valuation ou d&#8217;entra&#238;nement de parseur, d&#8217;extraction de lexique ou de grammaire) qu&#8217;aux lin-
guistes ou aux psycholinguistes (pour conna&#238;tre les distributions fines de certains mots ou de cer-
taines cat&#233;gories, ou conna&#238;tre la fr&#233;quence relative de certaines constructions, etc.). Contraire-
ment &#224; d&#8217;autres projets (Prague Dependency Treebank, Penn Treebank), nous ne souhaitons
pas appliquer fid&#232;lement telle ou telle th&#233;orie syntaxique, forc&#233;ment &#233;ph&#233;m&#232;re, mais contribuer
&#224; l&#8217;&#233;mergence d&#8217;un standard de d&#233;coupage en constituants, sans doute un peu grossier mais
suffisamment consensuel, et traduisible dans diff&#233;rents cadres th&#233;oriques.
Nous distinguons les choix d&#8217;&#233;tiquetage (des mots ou des syntagmes) des choix de d&#233;coupage
(des mots ou des syntagmes).
</p>
<p>1.3.1 Les choix d&#8217;&#233;tiquetage
</p>
<p>Nous avons 14 cat&#233;gories lexicales pr&#233;sentes dans le corpus, pour les mots simples ou com-
pos&#233;s :
A (adjectif), Adv (adverbe), D (d&#233;terminant), CC (conj de coordination), CL (pronom personnel
clitique= forme faible), CS (conj de subordination), NC (nom commun), NP (nom propre), P</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un corpus fran&#231;ais arbor&#233; : quelques interrogations
</p>
<p>(pr&#233;position), PRO (pronom non clitique), V (verbe), I (interjection), ET (mot &#233;tranger dont on
ne peut deviner la cat&#233;gorie en contexte), PONCT (ponctuation).
Nous avons retenu 12 types de syntagmes : syntagmes adjectival (AP), adverbial (AdP), co-
ordonn&#233; (COORD), nominal (NP), pr&#233;positionnel (PP) ; propositions participiale (VPpart), in-
finitive (VPinf), relative (Srel), subordonn&#233;e (Ssub), conjugu&#233;e interne (Sint) ; noyau verbal
(verbes avec les clitiques, auxiliaires, faire : VN) ; et phrase ind&#233;pendante (SENT).
Les pronoms clitiques, les d&#233;terminants, les ponctuations, les mots &#233;trangers, ne projettent pas
de syntagmes.
Nous n&#8217;avons pas de syntagme verbal (VP), car en fran&#231;ais, la s&#233;quence postverbale inclut aussi
bien des compl&#233;ments que des circonstants (1) ou des sujets invers&#233;s (2) :
(1) Les actionnaires d&#233;cideront certainement une augmentation de capital.
(2) Les actions qu&#8217;a mises IBM sur le march&#233;.
Donc, soit VP englobe tout et il est inutile, soit il n&#8217;inclut que les compl&#233;ments et il est discon-
tinu. Pour distinguer compl&#233;ments et circonstants, on notera des fonctions, dans une seconde
phase d&#8217;annotation (non pertinente ici).
Nous n&#8217;avons pas de syntagme d&#233;terminatif (DP) non plus. Les pr&#233;d&#233;terminants (adverbes :
environ, presque etc. ou pr&#233;positions compos&#233;es : pr&#232;s de...) ne sont pas ench&#226;ss&#233;s, les d&#233;ter-
minants coordonn&#233;s donnent lieu &#224; un sous-constituant COORD :
&lt;NP&gt; presque:Adv tous:A les:D enfants:NC &lt;/NP&gt;
&lt;NP&gt; pr&#232;s-de:P trois-cents:D personnes &lt;/NP&gt;
&lt;NP&gt; deux:D &lt;COORD&gt; ou:CC trois:D &lt;/COORD&gt; enfants:NC &lt;/NP&gt;
Le jeu d&#8217;&#233;tiquettes1 est assez fin pour marquer la cat&#233;gorie, la sous-cat&#233;gorie et la morphologie
flexionnelle. Il est principalement inspir&#233; des projets Multext et GRACE (Lecomte &amp; Paroubek,
1996) et suit les recommandations du projet EAGLES (von Rekowski, 1996).
</p>
<p>1.3.2 Les choix de d&#233;coupage
</p>
<p>Pour le d&#233;coupage en mots, nous utilisons un dictionnaire de mots compos&#233;s, qui est maximal
pour les mots compos&#233;s grammaticaux (les moins controvers&#233;s) et minimal pour les mots com-
pos&#233;s lexicaux (qui sont les plus flous). Nous suivons en g&#233;n&#233;ral les crit&#232;res de G. Gross (voir
(Gross, 1996)).
Le marquage en constituants majeurs est la premi&#232;re &#233;tape d&#8217;un marquage syntaxique qui com-
prendra ensuite le marquage des principales fonctions grammaticales.
Certains choix que nous avons d&#251; prendre concernent un certain nombre de cas r&#233;put&#233;s
difficiles, celui des constituants discontinus, des &#233;l&#233;ments vides, des syntagmes exocentriques
(sans t&#234;te) ou unaires, des ambiguit&#233;s r&#233;siduelles.
</p>
<p>Pas de constituants discontinus On fait l&#8217;hypoth&#232;se qu&#8217;on n&#8217;a pas de constituants disconti-
nus ni de syntagmes crois&#233;s. Toutefois, l&#8217;annotation des fonctions grammaticales permettra de
marquer liens de d&#233;pendance entre des &#233;l&#233;ments &#224; distance.
On ne note pas non plus de cat&#233;gorie vide pour les constituants absents ou d&#233;plac&#233;s. C&#8217;est &#224; un
autre niveau qu&#8217;on pourra noter une fonction &#224; distance (dans : que veux-tu voir ? que est objet
de voir et non de veux) ou une double fonction (dans : je le laisse entrer, le est &#224; la fois objet
de laisser et sujet d&#8217;entrer).
</p>
<p>1La liste contient 202 &#233;tiquettes diff&#233;rentes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Abeill&#233;, Cl&#233;ment, Kinyon, Toussenel
</p>
<p>Les syntagmes exocentriques On ne note pas de cat&#233;gorie vide pour les syntagmes elliptiques
ou &quot;sans t&#234;tes&quot;.
Pour l&#8217;&#233;tiquetage lexical, on a &#233;vit&#233; de recat&#233;goriser les mots qui n&#8217;avaient pas leur fonction
canonique car il en serait r&#233;sult&#233; un grand arbitraire au niveau lexical. Tous les adjectifs peuvent
&#234;tre employ&#233;s comme t&#234;tes de groupe nominal et il serait artificiel de noter comme ambigus (N
ou Adj) seulement ceux rencontr&#233;s dans cet emploi dans le corpus. Les noms peuvent aussi &#234;tre
employ&#233;s comme &#233;pith&#232;tes ou attributs (un ing&#233;nieur maison, il est tr&#232;s famille).
On a donc des NP sans Nom, et on n&#8217;ajoute pas un N vide qui serait artificiel. On a des phrases
sans verbe (relatives ou subordonn&#233;es) pour les tours elliptiques (que toi, ou dont trois idiots).
On ne cr&#233;&#233; pas de syntagmes adjectivaux &#224; t&#234;te nominale (sans adjectif), car on autorise les
groupes nominaux &#224; avoir la fonction &#233;pith&#232;te ou attribut. On ne cr&#233;e pas d&#8217;adverbiales &#224; t&#234;te
adjectivale non plus, car on autorise les adjectivales &#224; &#234;tre mobiles dans la phrase (c&#8217;est &#224; dire
qu&#8217;on d&#233;coupe: laver plus blanc, comme partir content, ou voter utile).
</p>
<p>Pas d&#8217;ambigu&#239;t&#233; r&#233;siduelle On a fait l&#8217;exp&#233;rience qu&#8217;une lecture suffisamment attentive per-
mettait g&#233;n&#233;ralement de d&#233;sambiguer les phrases du corpus. Dans certains cas, il ne faut pas
h&#233;siter &#224; faire appel &#224; des connaissances encyclop&#233;diques.
Dans certains cas, l&#8217;interpr&#233;tation est exactement la m&#234;me et on a le choix entre deux d&#233;-
coupages. Si les tests syntaxiques marchent aussi bien pour les deux (pronominalisation, cliv&#233;e
et c&#8217;est . . . que, etc.), on opte pour celui qui comporte le moins d&#8217;ench&#226;ssements (principe du
rattachement minimum).
C&#8217;est le cas par exemple pour la plupart des constructions &#224; verbe support, dans Jean &lt;VN&gt;
a commis &lt;/VN&gt; &lt;NP&gt; une agression &lt;/NP&gt; &lt;PP&gt; contre &lt;NP&gt; Marie &lt;/NP&gt; &lt;/PP&gt;
on peut inclure ou non le PP (contre Marie) dans le NP (une agression), sans diff&#233;rence
d&#8217;interpr&#233;tation, on choisit donc de ne pas l&#8217;inclure.
</p>
<p>Les syntagmes unaires A des fins de simplification et de lisibilit&#233;, on essaie de limiter les
syntagmes unaires.
On consid&#232;re que certaines cat&#233;gories peuvent projeter des syntagmes &#224; elles toutes seules. On
dit qu&#8217;on a affaire &#224; des syntagmes unaires. C&#8217;est le cas des noms propres, des pronoms (non
clitiques), des verbes (sauf participe pass&#233;), des adjectifs, mais ce n&#8217;est pas syst&#233;matique.
A chaque fois on doit se demander si on peut remplacer le mot seul par une s&#233;quence de mots
tout en gardant le m&#234;me d&#233;coupage syntagmatique. Les noms employ&#233;s en apposition corre-
spondent &#224; des NP, mais pas les noms employ&#233;s comme &#233;pith&#232;te.
</p>
<p>1.4 M&#233;thodologie
Nous proc&#233;dons en deux &#233;tapes :
</p>
<p>&#0; une &#233;tape d&#8217;annotation morpho-syntaxique, qui comprend segmentation en mots et en
phrase, d&#233;sambiguation cat&#233;gorielle et morphologique (tagging), regroupement des mots
compos&#233;s et lemmatisation,
</p>
<p>&#0; une &#233;tape d&#8217;annotation syntaxique (qui comprend le marquage en constituants et
l&#8217;assignation de fonctions grammaticales &#224; ces constituants).
</p>
<p>A chaque &#233;tape, nous distinguons un marquage automatique et une validation/correction hu-
maine syst&#233;matique, afin de minimiser le risque d&#8217;erreurs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un corpus fran&#231;ais arbor&#233; : quelques interrogations
</p>
<p>La premi&#232;re &#233;tape est aujourd&#8217;hui achev&#233;e. Seule la premi&#232;re phase de la seconde &#233;tape (mar-
quage en constituants) est actuellement op&#233;rationnelle.
</p>
<p>1.4.1 Validation du corpus &#233;tiquet&#233;
</p>
<p>Un guide d&#8217;annotation tr&#232;s pr&#233;cis a &#233;t&#233; &#233;crit et compl&#233;t&#233; durant la correction manuelle du
corpus (Abeill&#233; &amp; Cl&#233;ment, 1997). L&#8217;int&#233;gralit&#233; du corpus &#224; &#233;t&#233; relu et valid&#233; deux fois par
deux personnes diff&#233;rentes. Et des petits programmes ont &#233;t&#233; utilis&#233;s pour corriger semi-
automatiquement les erreurs r&#233;siduelles.
Pour les mots compos&#233;s, nous avons utilis&#233; le syst&#232;me INTEX (Silberztein, 1993), en &#244;tant
nombre de mots compos&#233;s lexicaux et en ajoutant nombre de mots compos&#233;s grammaticaux.
Le corpus ne contient aucune ambigu&#239;t&#233; morphologique r&#233;siduelle.
</p>
<p>1.4.2 Validation du corpus pars&#233;
</p>
<p>Le corpus &#233;tiquet&#233; corrig&#233; a &#233;t&#233; analys&#233; automatiquement par l&#8217;analyseur de surface d&#233;velopp&#233;
par A. Kinyon (adapt&#233; pour le format et les choix d&#8217;annotation par F. Toussenel) et corrig&#233; &#224; la
main par des annotateurs.
L&#8217;analyseur de surface est incr&#233;mental, d&#233;terministe, &#224; base de r&#232;gles2 et inspir&#233; de celui
d&#8217;Abney 1992 pour l&#8217;importance qu&#8217;il accorde aux mots fonctionnels (introducteurs de syn-
tagmes) mais cependant diff&#233;rent de ce dernier en ce qu&#8217;il autorise certains ench&#226;ssements.
Le taux de r&#233;ussite de l&#8217;analyseur de surface est estim&#233; &#224; 92% de fronti&#232;res ouvrantes correctes,
et 62% de fronti&#232;res fermantes correctes. Ce qui est coh&#233;rent avec notre parti-pris d&#8217;attachement
minimal des syntagmes.
</p>
<p>2 Quelques r&#233;sultats
Nous montrons d&#8217;abord, sur quelques statistiques globales, comment les diff&#233;rents niveaux
d&#8217;annotations, permettent d&#8217;enrichir les calculs de fr&#233;quences sur corpus.
Puis, en comparant certaines fr&#233;quences relatives pour des formes possiblement ambigu&#235;s, nous
d&#233;gageons quelques principes de pr&#233;f&#233;rence, qui sont nouveaux ou confirment des principes
observ&#233;s par ailleurs en linguistique g&#233;n&#233;rale ou en psycholinguistique.
</p>
<p>2.1 Fr&#233;quences
Les fr&#233;quences lexicales du fran&#231;ais ont souvent &#233;t&#233; calcul&#233;es &#224; partir de donn&#233;es brutes (Cat-
ach 84, Julliand 70). Comme le montre l&#8217;exemple de Silberztein 1993, de tels calculs sont
n&#233;cessairement erron&#233;s du fait de la proportion &#233;lev&#233;e de formes ambigu&#235;s.
Voyons comment la d&#233;sambiguation des parties du discours op&#233;r&#233;e sur notre corpus am&#233;liore
ces calculs.
Si nous trions ces formes par ordre de fr&#233;quence, nous obtenons la liste de la seconde colonne
(tableau 1) comme les formes les plus courantes, qui comprennent seulement des mots fonction-
nels (pr&#233;positions, d&#233;terminants, conjonctions) et qui sont comparables avec ce que d&#8217;autres
auteurs trouvent dans diff&#233;rents corpus fran&#231;ais. Mais la plupart de ces formes sont en fait
</p>
<p>2L&#8217;analyseur de surface est bas&#233; sur un automate d&#233;terministe &#224; pile.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Abeill&#233;, Cl&#233;ment, Kinyon, Toussenel
</p>
<p>ambigu&#235;s : de peut &#234;tre une pr&#233;position ou un d&#233;terminant, le peut &#234;tre un d&#233;terminant ou un
pronom, en peut &#234;tre une pr&#233;position ou un pronom clitique. Si on s&#8217;int&#233;resse aux mots les plus
courants dans le corpus, il est donc n&#233;cessaire, d&#8217;une part de distinguer ces formes ambigu&#235;s et,
d&#8217;autre part de rassembler diff&#233;rentes flexions du m&#234;me mot (d&#8217; et de pour la pr&#233;position DE,
le, la, les, l&#8217; pour le d&#233;terminant LE, etc.).
En faisant cela et en triant les formes par lemmes (d&#233;sambigu&#239;s&#233;s), nous obtenons la liste dans
la troisi&#232;me colonne qui est tout &#224; fait diff&#233;rente. Le mot le plus courant est le d&#233;terminant LE
et quelques verbes (&#234;tre, avoir) se trouvent parmi les 10 mots les plus fr&#233;quents.
</p>
<p>Ordre de Par forme Par lemme Par partie du discours
fr&#233;quence
</p>
<p>1er de (Pr&#233;p ou D&#233;t) LE (le,la,les,l&#8217;) Det Noms 24,5% (20% NC, 4,5% NP)
2e le (D&#233;t or CL) de (de,d&#8217;) Prep D&#233;terminants 16,8%
3e les (D&#233;t or CL) &#224; Prep Pr&#233;positions 14,6%
4e la (D&#233;t or CL) un (un, une, des, de, d&#8217;) Det Ponctuations 13%
5e &#224; &#234;tre (suis, est etc) V Verbes 11,4%
6e l&#8217; (D&#233;t or CL) et CC Adjectifs 6,5%
7e et avoir (ai, a etc) V Adverbes 4%
8e en (Pr&#233;p or CL) il (il, ils, elle, elles) CL Conjonctions 3,3% (2,3% CC, 1% CS)
9e un en Prep Clitiques (pronoms faibles) 2,8%
</p>
<p>10e Autres pronoms 1,8%
</p>
<p>Table 1: Fr&#233;quences lexicales par forme, par lemme et par cat&#233;gorie (partie du discours)
</p>
<p>Si maintenant nous trions les cat&#233;gories elles-m&#234;me (quatri&#232;me colonne du tableau), la r&#233;par-
tition des cat&#233;gories montre que la cat&#233;gorie la plus repr&#233;sent&#233;e est le nom (24,5% soit pr&#232;s
du quart des occurrences), les verbes sont moiti&#233; moins nombreux et les adjectifs eux-m&#234;mes
moiti&#233; moins nombreux que les verbes. Contrairement &#224; ce que laissent croire les calculs sur
les fr&#233;quences lexicales (o&#249; de et le arrivent toujours en t&#234;te), les mots grammaticaux ne sont
pas les plus fr&#233;quents du corpus.
</p>
<p>2.2 La pr&#233;f&#233;rence lexicale pour les mots compos&#233;s
Lors de la phase de segmentation en mots, nous avons d&#8217;abord v&#233;rifi&#233; les pr&#233;f&#233;rences pour
les mots compos&#233;s bien connues (des psycholinguistes, cf (Gibs, 1985)). Nous avons pris les
s&#233;quences qui sont &#233;ventuellement ambigu&#235;s entre les mots compos&#233;s et les s&#233;quences en mots
simples et avons calcul&#233; leur nombre d&#8217;occurrences respectifs. Voici des exemples de telles
paires :
en fait : adverbe compos&#233; ou pronom clitique en suivi du verbe faire d&#8217;ailleurs : adverbe
compos&#233; ou pr&#233;position d&#8217; suivie du nom ailleurs
Quelques r&#233;sultats sont montr&#233;s dans le tableau 2.
</p>
<p>Forme Nombre d&#8217;occurrences Nombre d&#8217;occurrences
en mots compos&#233;s en mots simples
</p>
<p>d&#8217;abord 154 (97 %) Adv 5 (3%) : Prep NC
alors que 231 (96%): CS 8 (4% ): Adv CS
plus de 305 (60%) Prep (40%) Adv Prep or Det
il y a 221 (57%) : Prep (43%) : CL CL V
</p>
<p>le plus 123 (39%) Adv (61%) Det Adv
sur ce 0 (Adv) 65 (100%) Prep Det
</p>
<p>Table 2: Proportion relative des cat&#233;gories des mots simples et compos&#233;s</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un corpus fran&#231;ais arbor&#233; : quelques interrogations
</p>
<p>La pr&#233;f&#233;rence est attest&#233;e (plus de 93% des occurrences sont un mot compos&#233; en moyenne)
mais d&#233;pend des cat&#233;gories impliqu&#233;es. Pour les mots compos&#233;s nominaux et verbaux (com-
prenant g&#233;n&#233;ralement des noms, des verbes et des adjectifs), l&#8217;interpr&#233;tation en mots compos&#233;s
concerne presque 100% des occurrences. Pour les mots compos&#233;s adverbiaux, la pr&#233;f&#233;rence
est moindre, et il y a des exceptions comme &quot;sur ce&quot; ou &quot;le plus&quot; dans le tableau 2. Cette
diff&#233;rence peut &#234;tre expliqu&#233;e par une pr&#233;f&#233;rence pour les cat&#233;gories grammaticales (clitique,
d&#233;terminant, pr&#233;position... voir plus bas) associ&#233;es avec les mots impliqu&#233;s dans l&#8217;interpr&#233;tation
d&#233;compos&#233;e.
Nous v&#233;rifions que la pr&#233;f&#233;rence pour l&#8217;interpr&#233;tation en mot compos&#233; est une pr&#233;f&#233;rence lexi-
cale parce que le nombre total d&#8217;occurrences de mots compos&#233;s dans le corpus est bien plus bas
que celui des mots simples (50614=6,2% versus 765953=93,8%, sans compter la ponctuation).
</p>
<p>2.3 La pr&#233;f&#233;rence lexicale pour les cat&#233;gories grammaticales
</p>
<p>Quand on consid&#232;re les formes ambigu&#235;s syntaxiquement, les probabilit&#233;s des diff&#233;rentes par-
ties du discours sont g&#233;n&#233;ralement tr&#232;s in&#233;gales (cf (Church, 1988)).
Ind&#233;pendamment des pr&#233;f&#233;rences syntaxiques qui peuvent &#234;tre associ&#233;es &#224; telle ou telle unit&#233;
lexicale (par exemple ferme est plut&#244;t verbe que nom ou adjectif en contexte de langue
g&#233;n&#233;rale), nous avons cherch&#233; des principes de pr&#233;f&#233;rence plus g&#233;n&#233;raux, qui peuvent &#234;tre utiles
pour d&#233;velopper des &#233;tiqueteurs en partie du discours automatiques mais qui peuvent aussi met-
tre en lumi&#232;re des strat&#233;gies humaines d&#8217;analyse.
Au niveau de l&#8217;&#233;tiquetage (ou de la d&#233;sambiguation des parties du discours), nous avons trouv&#233;
une forte pr&#233;f&#233;rence pour les cat&#233;gories grammaticales par rapport aux cat&#233;gories lexicales.
Nous entendons par cat&#233;gories grammaticales les listes ferm&#233;es de mots fonctionnels (d&#233;termi-
nants, pr&#233;positions, pronoms clitiques et autres pronoms, conjonctions de subordination et de
coordination), et par cat&#233;gories lexicales les verbes, noms, adverbes et adjectifs. Nous avons
pris l&#8217;ensemble des formes ambigu&#235;s entre ces deux classes et avons &#233;tudi&#233; les fr&#233;quences
respectives de leurs occurrences. Voici quelques exemples :
</p>
<p>CAR : Conjonction de coordination ou nom commun masculin singulier
OUTRE : Pr&#233;position ou nom commun f&#233;minin singulier
ENTRE : Pr&#233;position ou verbe entrer
</p>
<p>En tout, nous avons trouv&#233; une proportion &#233;crasante d&#8217;emplois de cat&#233;gories grammaticales
(plus que 95% en moyenne, parfois 100%). Quelques uns font exception ; leur forme lexicalis&#233;e
est particuli&#232;rement rare ou r&#233;serv&#233;e &#224; une langue de sp&#233;cialit&#233; (dans pluriel de dan, par nom
commun &#8211; terme de golf, sur adjectif synonyme d&#8217;acide, etc.)
</p>
<p>Cette pr&#233;f&#233;rence est confirm&#233;e par des interrogations d&#8217;autres corpus, en particulier de corpus
transcrits (Claire Blanche-Benveniste, communication personnelle). Dans la mesure o&#249; elle
est stable, elle peut &#234;tre consid&#233;r&#233;e comme repr&#233;sentative des strat&#233;gies de d&#233;sambiguation
humaine.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Abeill&#233;, Cl&#233;ment, Kinyon, Toussenel
</p>
<p>Formes
ambigu&#235;s
</p>
<p>Nombre
total d&#8217;occ. Nombre d&#8217;occurrences
</p>
<p>lexicale grammaticale
car 235 5 (2,1%) Nom 230 (97,8%) C coord
cela 284 1 (0,3%) Verbe 283 (99,7%) Pronom
dans 5341 0 (0%) Nom 5341 (100%) Preposition
</p>
<p>devant 285 33 (11,5%) Verbe 252 (88,4%) Preposition
entre 1195 23 (1,9%) Verbe 1172 (98%) Preposition
</p>
<p>envers 25 3 (12%) Nom 22 (88%) Preposition
la 24471 1 (0.0%) Nom 24470 (100.0%)
lui 763 0 (0%) part. de luire 763 (100%) pronom clitique et pronom fort.
or 189 30 (15.9%) Nom masc 159 (84.1%) Conjonction de coordination
si 989 0 (0%) Nom masc 989 (100%) Conjonction de subordination,
</p>
<p>Adverbe
son 2427 10 (0.4%) Nom masc 2417 (99.6%) D&#233;terminant
sous 359 25 (6.9%) nom masc pluriel 334 (93.1%) pr&#233;position
ton 31 22 (70.9) nom masc sing 9 (29.1%) d&#233;terminant
</p>
<p>Table 3: Fr&#233;quence relative par cat&#233;gorie de quelques formes ambigu&#235;s
</p>
<p>2.4 Pr&#233;f&#233;rences fonctionnelles et structurales
2.4.1 La hi&#233;rarchie d&#8217;accessibilit&#233; des fonctions
</p>
<p>Si on regarde la fr&#233;quence relative des pronoms relatifs, dont la fonction est marqu&#233;e par la
morphologie, on obtient les r&#233;sultats suivants (sur le corpus entier) :
Pronoms relatifs :
Sujet (qui sans pr&#233;position) 6291 61%
Objet direct (que ou qu&#8217;) 1565 15,2%
G&#233;nitif (dont) 1076 10,4%
Locatif (o&#249;) 782 7,6%
Objet indirect (pr&#233;p+qui, quoi, lequel) 539 5,2%
autres 0,3%
</p>
<p>Cette r&#233;partition rappelle celle trouv&#233;e par (Keenan &amp; Hawkins, 1987) sur des textes journalis-
tiques anglais (sujet 46%, objet direct 24%, objet indirect 15%, g&#233;nitif 5%, autres 10%), ce que
confirme la hi&#233;rarchie d&#8217;accessibilit&#233; relative universelle de Keenan et Comrie. En fran&#231;ais, la
pr&#233;f&#233;rence pour les relatifs sujet est bien plus forte que pour l&#8217;anglais, et la fr&#233;quence relative
du g&#233;nitif (dont) est &#233;galement plus grande, peut-&#234;tre &#224; cause de l&#8217;emploi fr&#233;quent de subordon-
n&#233;es relatives en dont avec un pronom r&#233;somptif dans les journaux fran&#231;ais (Un probl&#232;me dont
on sait qu&#8217;il est difficile).
Ces fr&#233;quences relatives confirment les resultats obtenus par ailleurs en psycholinguistique par
(Holmes &amp; O&#8217;Regan, 1981) comparant les relatives en qui et en que (taux de compr&#233;hension et
mouvement oculaire).
</p>
<p>2.4.2 Pr&#233;f&#233;rences pour l&#8217;attachement des propositions relatives
</p>
<p>Nous avons recherch&#233; les occurrences de propositions relatives dans le contexte suivant :
N1 (adj) prep (det) (adj) N2 (adj) relative. Sur 370 relatives trouv&#233;es, 52,2% sont attach&#233;es au
premier nom, et on trouve la pr&#233;f&#233;rence inverse (44%) pour les relatives courtes (&lt; 6 mots).
Ces r&#233;sultats confirment les travaux de (Zagar et al., 1997) et de (Pynte, 1998) sur la pr&#233;f&#233;rence
pour l&#8217;attachement haut en fran&#231;ais (&#224; la diff&#233;rence de l&#8217;anglais) et le r&#244;le de la longueur de la
relative.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un corpus fran&#231;ais arbor&#233; : quelques interrogations
</p>
<p>Bien qu&#8217;il faille &#234;tre prudent sur la reproductibilit&#233; de ce type de r&#233;sultats, ceux-ci sont promet-
teurs pour la contribution de la linguistique de corpus &#224; la psycholinguistique (contra (Gibson
&amp; Sch&#252;tze, 1999)).
</p>
<p>Conclusion
Nous avons pr&#233;sent&#233; un corpus annot&#233; syntaxiquement pour le fran&#231;ais, pleinement d&#233;sambigu&#233;
et valid&#233; manuellement, et quelques investigations pr&#233;liminaires. Certaines de ces investigations
ont confirm&#233; des fr&#233;quences et des pr&#233;f&#233;rences lexicales bien connues, d&#8217;autres ont apport&#233; la
lumi&#232;re sur de nouvelles fr&#233;quences et de nouvelles pr&#233;f&#233;rences qui devraient &#234;tre confirm&#233;es
sur d&#8217;autres corpus.
D&#8217;autres enqu&#234;tes pourront &#234;tre men&#233;es, en collaboration avec des linguistes ou des psycholin-
guistes. Des comparaisons devront aussi &#234;tre faites avec d&#8217;autres corpus arbor&#233;s pour d&#8217;autres
langues.
Des annotations futures impliquent l&#8217;assignation d&#8217;une fonction grammaticale pour chaque syn-
tagme majeur. Ceci permettra davantage d&#8217;investigations, par exemple sur l&#8217;inversion du sujet.
Le corpus est distribu&#233; en tant que ressource linguistique et est d&#233;j&#224; utilis&#233; par quelques &#233;quipes
en France et ailleurs.
</p>
<p>A &#201;chantillon du corpus arbor&#233;
&lt;SENT&gt;
</p>
<p>&lt;VN&gt; &lt;w lemma=&quot;il&quot; ei=&quot;CL3ms&quot; ee=&quot;CL-suj-3ms&quot; cat=&quot;CL&quot; subcat=&quot;suj&quot; mph=&quot;3ms&quot;&gt;Il&lt;/w&gt;
&lt;w lemma=&quot;&#234;tre&quot; ei=&quot;VP3s&quot; ee=&quot;V&#8211;P3s&quot; cat=&quot;V&quot; subcat=&quot;&quot; mph=&quot;P3s&quot;&gt;est&lt;/w&gt;
&lt;w lemma=&quot;entendre&quot; ei=&quot;VKms&quot; ee=&quot;V&#8211;Kms&quot; cat=&quot;V&quot; subcat=&quot;&quot; mph=&quot;Kms&quot;&gt;entendu&lt;/w&gt;
</p>
<p>&lt;/VN&gt;
&lt;Ssub&gt;
</p>
<p>&lt;w lemma=&quot;que&quot; ei=&quot;CS&quot; ee=&quot;C-S&quot; cat=&quot;C&quot; subcat=&quot;S&quot;&gt;que&lt;/w&gt;
&lt;NP&gt; &lt;w lemma=&quot;le&quot; ei=&quot;Dfp&quot; ee=&quot;D-def-fp&quot; cat=&quot;D&quot; subcat=&quot;def&quot; mph=&quot;fp&quot;&gt;les&lt;/w&gt;
</p>
<p>&lt;w lemma=&quot;fonction publique&quot; ei=&quot;NCfp&quot; ee=&quot;N-C-fp&quot; cat=&quot;N&quot; subcat=&quot;C&quot; mph=&quot;fp&quot;&gt;
&lt;w catint=&quot;N&quot;&gt;fonctions&lt;/w&gt; &lt;w catint=&quot;A&quot;&gt;publiques&lt;/w&gt; &lt;/w&gt;
</p>
<p>&lt;/NP&gt;
&lt;VN&gt; &lt;w lemma=&quot;rester&quot; ei=&quot;VP3p&quot; ee=&quot;V&#8211;P3p&quot; cat=&quot;V&quot; subcat=&quot;&quot; mph=&quot;P3p&quot;&gt;restent&lt;/w&gt; &lt;/VN&gt;
&lt;AP&gt; &lt;w lemma=&quot;ouvert&quot; ei=&quot;Afp&quot; ee=&quot;A-qual-fp&quot; cat=&quot;A&quot; subcat=&quot;qual&quot; mph=&quot;fp&quot;&gt;ouvertes&lt;/w&gt;
</p>
<p>&lt;PP&gt; &lt;w lemma=&quot;&#224;&quot; ei=&quot;P&quot; ee=&quot;P&quot; cat=&quot;P&quot;&gt;&#224;&lt;/w&gt;
&lt;NP&gt; &lt;w lemma=&quot;tout&quot; ei=&quot;Amp&quot; ee=&quot;A-ind-mp&quot; cat=&quot;A&quot; subcat=&quot;ind&quot; mph=&quot;mp&quot;&gt;tous&lt;/w&gt;
</p>
<p>&lt;w lemma=&quot;le&quot; ei=&quot;Dmp&quot; ee=&quot;D-def-mp&quot; cat=&quot;D&quot; subcat=&quot;def&quot; mph=&quot;mp&quot;&gt;les&lt;/w&gt;
&lt;w lemma=&quot;citoyen&quot; ei=&quot;NCmp&quot; ee=&quot;N-C-mp&quot; cat=&quot;N&quot; subcat=&quot;C&quot; mph=&quot;mp&quot;&gt;citoyens&lt;/w&gt;
</p>
<p>&lt;/NP&gt;&lt;/PP&gt;&lt;/AP&gt;
&lt;/Ssub&gt;
&lt;w lemma=&quot;.&quot; ei=&quot;PONCTS&quot; ee=&quot;PONCT-S&quot; cat=&quot;PONCT&quot; subcat=&quot;S&quot;&gt;.&lt;/w&gt;
</p>
<p>&lt;/SENT&gt;
</p>
<p>Il est entendu
</p>
<p>VN
</p>
<p>que
</p>
<p>les fonctions publiques
</p>
<p>NP
</p>
<p>restent
</p>
<p>VN
</p>
<p>ouvertes
</p>
<p>&#224;
</p>
<p>tous les citoyens
</p>
<p>NP
</p>
<p>PP
</p>
<p>AP
</p>
<p>Ssub
</p>
<p>SENT</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Abeill&#233;, Cl&#233;ment, Kinyon, Toussenel
</p>
<p>R&#233;f&#233;rences
ABEILL&#201; A., CANDITO M.-H. &amp; KINYON A. (1999). Ftag : current status and parsing scheme. In
VEXTAL&#8217;99, Venise.
</p>
<p>ABEILL&#201; A. &amp; CL&#201;MENT L. (1997). D&#233;sambiguation morphosyntaxique; 1 Les mots simples; 2 Les
mots compos&#233;s. TALANA, Universit&#233; Paris 7.
</p>
<p>ABEILL&#201; A., CL&#201;MENT L. &amp; KINYON A. (2001). Building a Treebank for French, In Building and
using syntactically annotated corpora. Kluwer Academic Publishers.
ABNEY S. (1990). Parsing by Chunks, volume Principle-based Parsing. Kluwer, berwick et al. edition.
CHURCH K. (1988). A stochastic parts program and noun phrase parser for unrestricted text. In 2nd
ANLP Conference, p. 136&#8211;143, Austin.
CL&#201;MENT L. &amp; KINYON A. (2000). Chunking, marking and searching a morpho-syntactically anno-
tated corpus for french. In ACIDCA, Monastir, Tunisia.
</p>
<p>GIBS R. (1985). On the process of understanding idioms. Journal of Psycholingistic Research, 14.
GIBSON E. &amp; SCH&#220;TZE C. (1999). Disambiguation preferences in noun phrase conjunction do not
mirror corpus frequency. Journal of Memory and Language, 40, 263&#8211;279.
GROSS G. (1996). Les expressions fig&#233;es en fran&#231;ais. Ophrys.
HABERT B., NAZARENKO A. &amp; SALEM A. (1997). Les linguistiques de corpus. Armand Colin.
HOLMES V. &amp; O&#8217;REGAN J. (1981). Eye fixation patterns during the reading of relative clause sentences.
Journal of Verbal Learning and Verbal Behaviour, 20, 417&#8211;430.
KEENAN &amp; HAWKINS (1987). The psychological validity of the accessibility hierarchy. In KEENAN,
Ed., Universal Grammar. Routledge London.
</p>
<p>LECOMTE J. &amp; PAROUBEK P. (1996). Le cat&#233;goriseur d&#8217;E Brill : mise en oeuvre d&#8217;une version en-
tra&#238;n&#233;e pour le fran&#231;ais. Rapport interne, INaLF, Nancy.
PYNTE J. (1998). The time-course of attachment decisions: Evidence from french. Syntax and Seman-
tics, 31, 227&#8211;245.
SILBERZTEIN M. (1993). Dictionnaires &#233;lectroniques et analyse automatique de textes: le syst&#232;me
INTEX. Paris: Masson.
</p>
<p>VON REKOWSKI U. (1996). Elm-fr : Specifications for french morphosyntax, lexicon specification and
classification guidelines. EAGLES document.
</p>
<p>ZAGAR D., PYNTE J. &amp; RATIVEAU S. (1997). Evidence for early-closure attachment on first-pass
reading times in french. The Quarterly Journal of Experimental Psychology, 50, 421&#8211;438.</p>

</div></div>
</body></html>