<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analogies morpho-synonymiques. Une m&#233;thode d&#8217;acquisition automatique de liens morphologiques &#224; partir d&#8217;un dictionnaire de synonymes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2001, Tours, 2-5 juillet 2001
</p>
<p>Analogies morpho-synonymiques.
Une m&#233;thode d&#8217;acquisition automatique de liens
</p>
<p>morphologiques &#224; partir d&#8217;un dictionnaire de synonymes
</p>
<p>Nabil Hathout
ERSS &#8211; CNRS &amp; Universit&#233; de Toulouse Le Mirail
</p>
<p>Maison de la Recherche. F-31058 Toulouse cedex 1. France
Nabil.Hathout@univ-tlse2.fr
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Cet article pr&#233;sente une m&#233;thode de construction automatique de liens morphologiques &#224; partir
d&#8217;un dictionnaire de synonymes. Une analyse de ces liens met en lumi&#232;re certains aspects de
la structure morphologique du lexique dont on peut tirer partie pour identifier les variations
allomorphiques des suffixations extraites.
</p>
<p>We present a method to extract morphological links from a synonym dictionary without super-
vision. The analysis of these links brings somes aspects of the morphological structure of the
lexicon to light. We have then taken advantage of this structure to identify allomorphic varia-
tions of the extracted suffixations.
</p>
<p>Mots-cl&#233;s : morphologie d&#233;rivationnelle ; analogie ; structure du lexique.
Key words: derivational morphology; analogy; structure of the lexicon.
</p>
<p>1 Ressources de langue g&#233;n&#233;rale pour le TALN
</p>
<p>C&#8217;est un fait bien &#233;tabli mais qu&#8217;il est toujours bon de rappeler : les ressources de langue g&#233;n&#233;-
rale sont utiles pour le TALN et valent la peine d&#8217;&#234;tre construites. Par exemple, la disponibilit&#233;
d&#8217;un dictionnaire comme WordNet a donn&#233; lieu &#224; des travaux sur la construction de concor-
dances s&#233;mantiques, sur l&#8217;identification des sens ou sur le rattachement des arguments, etc.
dont plusieurs sont pr&#233;sent&#233;s dans (Fellbaum 1999). De m&#234;me, la base de donn&#233;es morpho-
logiques CELEX a &#233;t&#233; utilis&#233;e avec succ&#232;s en recherche d&#8217;information (Jing et Tzoukerman
1999) et pour la constitution de ressources terminologiques (Daille et Jacquemin 1998). Pour
le fran&#231;ais, les recherches men&#233;es par (Hamon et al. 1999) ont montr&#233; l&#8217;int&#233;r&#234;t que pr&#233;sente un
dictionnaire de synonymes pour la structuration des terminologies. Malheureusement, les res-
sources de langue g&#233;n&#233;rale restent peu nombreuses pour le fran&#231;ais et difficiles &#224; acqu&#233;rir (non
disponibles ou relativement on&#233;reuses). Signalons cependant la disponibilit&#233; du dictionnaire Eu-
roWordNet qui comporte 18 777 lemmes r&#233;partis en 22 745 synsets (ensembles de synonymes).
En revanche il n&#8217;existe pas encore d&#8217;&#233;quivalent de la base de donn&#233;es morphologiques CELEX.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>Ce travail, r&#233;alis&#233; dans le cadre du projet MorTAL (Hathout et al. 2002), s&#8217;inscrit dans le cadre
de la constitution d&#8217;une telle ressource.
</p>
<p>Il existe en fait au moins quatre ressources pour le fran&#231;ais qui comportent des descriptions
constructionnelles1. Il s&#8217;agit (1) du Dictionnaire des radicaux DELAR constitu&#233; par le LADL
(Courtois 1990) et dont une version est distribu&#233;e par ELRA/ELDA : Dictionnaire des verbes
fran&#231;ais. Ce dictionnaire comporte 25 610 verbes pour lesquels il d&#233;crit les lex&#232;mes adjecti-
vaux construits en -able, -ant et -&#233;, et les lex&#232;mes nominaux construits en -age, -ment, -tion,
-oir et -ure. Par ailleurs, certaines tables du Lexique-Grammaire (Gross 1975) comportent des
informations sur les affixes nominaux et adjectivaux qui peuvent op&#233;rer sur les verbes qu&#8217;elles
d&#233;crivent, mais cette ressource n&#8217;est malheureusement pas (plus) disponible. (2) La soci&#233;t&#233;
M&#233;modata distribue elle aussi un Dictionnaire d&#233;rivationnel sous forme d&#8217;une biblioth&#232;que lo-
gicielle int&#233;grable dans des applications commerciales. (3) C. Gruaz a pour sa part construit le
Dictionnaire synchronique de familles morphologiques de mots fran&#231;ais (DISFA) (Gruaz 1997)
mais nous ignorons sa disponibilit&#233;. (4) Nous avons nous-m&#234;me construit, &#224; partir de TLFnome
(lexique de formes construit &#224; partir de la nomenclature du Tr&#233;sor de la Langue Fran&#231;aise)
Verbaction, un lexique de noms d&#8217;actions d&#233;verbaux qui comporte 6 472 entr&#233;es.
</p>
<p>2 Morphologie constructionnelle
</p>
<p>Dans des travaux pr&#233;c&#233;dents, nous avons utilis&#233; TLFnome pour produire des entr&#233;es d&#8217;une base
de donn&#233;es constructionnelles (Hathout 2000). Nous travaillons &#233;galement sur la classification
en familles constructionnelles. La technique mise en &#339;uvre consiste &#224; apprendre, &#224; partir du
lexique, un ensemble de sch&#233;mas de pr&#233;fixation et/ou de suffixation puis &#224; les appliquer pour
apparier des lex&#232;mes bases et des lex&#232;mes suppos&#233;s construits. (La m&#234;me technique est utilis&#233;e
par (Grabar et Zweigenbaum 1999).) Ces associations sont ensuite filtr&#233;es en s&#8217;appuyant sur les
nombres d&#8217;instances des sch&#233;mas. Les r&#233;sultats que nous avons obtenus sont de qualit&#233; variable,
tr&#232;s bons pour le suffixe -able (pr&#233;cision de l&#8217;ordre de 95%), tr&#232;s insuffisants pour le suffixe -is-
(-iser ; la pr&#233;cision est inf&#233;rieure &#224; 50%). Cette diff&#233;rence s&#8217;explique essentiellement par la plus
grande homog&#233;n&#233;it&#233; de l&#8217;ensemble des bases de -able (presque toutes des verbes) par rapport &#224;
celui des bases de -is- (les substantifs et les adjectifs y sont en nombre comparable).
Ces probl&#232;mes de pr&#233;cision ont pour origine la nature du lexique utilis&#233; : un lexique de formes
graph&#233;matiques qui ne comporte pas de description phon&#233;tique ni s&#233;mantique. Or la construc-
tion morphologique est pr&#233;cis&#233;ment une relation r&#233;guli&#232;re entre des lex&#232;mes qui partagent si-
multan&#233;ment des propri&#233;t&#233;s phon&#233;tiques et s&#233;mantiques. Les formes graph&#233;miques sont des
approximations raisonnables des formes sonores et permettent de calculer avec une pr&#233;cision
acceptable les partages de propri&#233;t&#233;s phon&#233;tiques. Elles ne sont en revanche pas suffisamment
pr&#233;cises pour d&#233;cider s&#8217;il y a partage de propri&#233;t&#233;s s&#233;mantiques. L&#8217;am&#233;lioration des perfor-
mances globales de l&#8217;appariement et de la classification en familles passe n&#233;cessairement par
l&#8217;augmentation de la pr&#233;cision de cette seconde approximation. Une solution sure et facile &#224;
mettre en &#339;uvre consiste &#224; utiliser un dictionnaire de synonymes qui, pr&#233;cis&#233;ment, d&#233;crit des
relations de partage de propri&#233;t&#233;s s&#233;mantiques, m&#234;me si ces derni&#232;res ne co&#239;ncident pas avec les
relations constructionnelles. Par ailleurs, cette ressource est d&#233;j&#224; valid&#233;e et donc relativement
</p>
<p>1Nous avons choisi de suivre D. Corbin en pr&#233;f&#233;rant le terme constructionnel &#224; d&#233;rivationnel parce qu&#8217;il est
plus explicite que le second et qu&#8217;il est relativement neutre du point de vue th&#233;orique (d&#233;rivation sous-entend
l&#8217;existence de r&#232;gles, de niveaux de repr&#233;sentation...).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analogies morpho-synonymiques
</p>
<p>fiable.
</p>
<p>La suite de l&#8217;article s&#8217;organise comme suit : nous pr&#233;sentons en &#167;3 la technique utilis&#233;e pour
identifier les relations constructionnelles dans le dictionnaire de synonymes. Les r&#233;sultats ob-
tenus, analys&#233;s en &#167;4, font clairement appara&#238;tre une structure morphologique du lexique. &#167;5
est consacr&#233; au probl&#232;me de la variation morphologique, &#224; savoir l&#8217;allomorphie. Nous compa-
rons ensuite, en &#167;6, ce travail avec d&#8217;autres recherches proches par leurs objectifs ou par les
techniques qu&#8217;elles proposent.
</p>
<p>3 Identification des analogies morpho-synonymiques
</p>
<p>L&#8217;identification des relations constructionnelles2 utilis&#233;e ici est bas&#233;e sur la technique que nous
proposons dans (Hathout et al. 2002). Elle est cependant plus pr&#233;cise que cette derni&#232;re car elle
exploite les informations relatives au partage de propri&#233;t&#233;s s&#233;mantiques pour filtrer les relations
morphologiques apprises automatiquement. Le filtrage se fait en extrayant du dictionnaire des
&#171; analogies morpho-synonymiques &#187;, &#224; savoir des quadruplets de lemmes
</p>
<p>&#0; &#1;&#3;&#2; &#4; &#1;&#6;&#5; &#4; &#7;&#8;&#2; &#4; &#7;&#9;&#5; &#10;
</p>
<p>qui
forment des s&#233;ries proportionnelles (Cruse 1986) comme celle qui est pr&#233;sent&#233;e en figure 1.
Les relations de cette figure marqu&#233;es par des lignes pleines doivent se lire de la mani&#232;re sui-
</p>
<p>affirmer
</p>
<p>affirmation
</p>
<p>exprimer
</p>
<p>expression
</p>
<p>FIG. 1 &#8211; Analogie morpho-synonymique concernant le couple affirmer:affirmation. Les lignes
pleines correspondent &#224; des relations constructionnelles et les fl&#232;ches en pointill&#233; &#224; des relations
de synonymie, en fait de proximit&#233; s&#233;mantique forte.
</p>
<p>vante :
&#1;
</p>
<p>&#2;&#12;&#11;
</p>
<p>affirmation est &#224; &#1; &#5;&#12;&#11; affirmer ce que &#7; &#2;&#13;&#11; expression est &#224; &#7; &#5;&#14;&#11; exprimer. Plus
g&#233;n&#233;ralement, une analogie
</p>
<p>&#0; &#1;&#15;&#2; &#4; &#1;&#16;&#5; &#4; &#7;&#8;&#2; &#4; &#7;&#9;&#5; &#10;
</p>
<p>est correcte :
</p>
<p>(1) a. si &#0; &#1;&#16;&#2; &#4; &#1;&#16;&#5; &#10; et &#0; &#7;&#8;&#2; &#4; &#7;&#9;&#5; &#10; sont morphologiquement apparent&#233;s et
b. s&#8217;il existe une relation s&#233;mantique qui unit &#224; la fois
</p>
<p>&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#4; &#1;
</p>
<p>&#5;
</p>
<p>&#10;
</p>
<p>et
&#0; &#7;
</p>
<p>&#2;
</p>
<p>&#4; &#7;
</p>
<p>&#5;
</p>
<p>&#10;
</p>
<p>.
</p>
<p>La polys&#233;mie &#233;ventuelle des lex&#232;mes de l&#8217;analogie fait qu&#8217;il peut exister plusieurs relations
s&#233;mantiques &#17; telles que &#17;
</p>
<p>&#0; &#18;
</p>
<p>&#2;
</p>
<p>&#4; &#18;
</p>
<p>&#5;
</p>
<p>&#10;
</p>
<p>et &#17;
&#0; &#19;
</p>
<p>&#2;
</p>
<p>&#4; &#19;
</p>
<p>&#5;
</p>
<p>&#10;
</p>
<p>.
</p>
<p>Nous avons utilis&#233; le dictionnaire de synonymes constitu&#233; par Jean-Yves Hamon (CNRS-
INaLF, USR 705). Il s&#8217;agit en fait de la compilation de 7 dictionnaires d&#8217;&#233;poques et de tailles
diff&#233;rentes. L&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; de ces dictionnaires permet de gommer les sp&#233;cificit&#233;s de chacun et
garantit une certaine g&#233;n&#233;ralit&#233; &#224; notre &#233;tude et aux r&#233;sultats obtenus. L&#8217;extraction des analogies
morpho-synonymiques est r&#233;alis&#233;e en trois &#233;tapes : (1) formatage des entr&#233;es ; (2) construction
d&#8217;un graphe constructionnel ; (3) extraction des analogies. Les &#233;tapes 1 et 3 sont destin&#233;es au
filtrage des relations constructionnelles identifi&#233;es par l&#8217;&#233;tape 2. La ligne directrice pour les
premi&#232;res est donc de privil&#233;gier la pr&#233;cision &#224; la couverture ; inversement, l&#8217;&#233;tape 2 vise &#224;
construire un graphe dont la couverture est maximale.
</p>
<p>2Nous ne consid&#233;rons dans cet article que la construction suffixale.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>Formatage.&lt; Le formatage des entr&#233;es consiste essentiellement en la cat&#233;gorisation des en-
tr&#233;es et des synonymes. La cat&#233;gorisation est r&#233;alis&#233;e &#224; l&#8217;aide du lexique TLFnome+index en ex-
ploitant le fait que la synonymie s&#8217;&#233;tablit entre des lemmes de m&#234;me cat&#233;gorie. Cette contrainte
implique une s&#233;paration pr&#233;alable des diff&#233;rents sens et acceptions de l&#8217;entr&#233;e. Une technique
robuste bas&#233;e sur l&#8217;appariement suffixal est utilis&#233;e pour les lemmes qui n&#8217;appartiennent pas &#224;
ce lexique de r&#233;f&#233;rence. La s&#233;paration des sens maximise le nombre des propri&#233;t&#233;s s&#233;mantiques
partag&#233;es par l&#8217;entr&#233;e et chacun de ses synonymes ainsi que par ces derniers entre eux. Cela n&#8217;a
cependant pas d&#8217;incidence sur la pr&#233;cision des analogies car le formatage pr&#233;serve l&#8217;orientation
des descriptions synonymiques.
</p>
<p>Graphe constructionnel. La deuxi&#232;me &#233;tape consiste en une simple application de la tech-
nique pr&#233;sent&#233;e dans (Hathout et al. 2002) &#224; l&#8217;ensemble des lemmes qui figurent en entr&#233;e ou
comme synonymes. Dans un premier temps, un ensemble de sch&#233;mas d&#8217;appariement est appris
en comparant deux &#224; deux l&#8217;ensemble des lemmes. (Comme indiqu&#233; supra, seuls les suffixes
sont consid&#233;r&#233;s.) On conserve les sch&#233;mas &#0; &#1;&#3;&#2; &#4; &#1; &#5; &#6; tels qu&#8217;il existe au moins trois couples de
lemmes
</p>
<p>&#0; &#7;&#8;&#2; &#4; &#7;&#9;&#5; &#6;
</p>
<p>tels que
&#7;&#10;&#2;&#12;&#11;&#14;&#13;&#16;&#15;&#17;&#1; &#2;
</p>
<p>et
&#7;&#10;&#5;&#12;&#11;&#14;&#13;&#9;&#15;&#17;&#1; &#5;
</p>
<p>partagent un pr&#233;fixe
&#13;
</p>
<p>d&#8217;au moins
trois caract&#232;res.
</p>
<p>&#1;
</p>
<p>&#2;
</p>
<p>,
</p>
<p>&#1;
</p>
<p>&#5;
</p>
<p>,
</p>
<p>&#7;
</p>
<p>&#2;
</p>
<p>,
</p>
<p>&#7;
</p>
<p>&#5;
</p>
<p>sont des cha&#238;nes de caract&#232;res munies de cat&#233;gories grammati-
cales ;
</p>
<p>&#13;
</p>
<p>est seulement une cha&#238;ne de caract&#232;res.
&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#4; &#1;
</p>
<p>&#5;
</p>
<p>&#6;
</p>
<p>est la signature constructionnelle des
couples
</p>
<p>&#0; &#7;
</p>
<p>&#2;
</p>
<p>&#4; &#7;
</p>
<p>&#5;
</p>
<p>&#6; 3
. Les sch&#233;mas appris sont ensuite appliqu&#233;s aux lemmes pour reconstruire
</p>
<p>des couples.
</p>
<p>Analogies morpho-synonymiques. L&#8217;extraction des analogies morpho-synonymiques
consiste en une simple exploration du graphe correspondant aux appariements suffixaux
pour trouver l&#8217;ensemble des quadruplets
</p>
<p>&#0; &#18;&#19;&#2; &#4; &#18;&#20;&#5; &#4; &#21;&#22;&#2; &#4; &#21;&#3;&#5; &#6;
</p>
<p>tels que
&#0; &#18;&#17;&#2; &#4; &#18;&#17;&#5; &#6;
</p>
<p>et
&#0; &#21;&#22;&#2; &#4; &#21;&#3;&#5; &#6;
</p>
<p>sont
dans le graphe et que
</p>
<p>&#21;&#23;&#2; (resp. &#21;&#3;&#5; ) figure dans une entr&#233;e de &#18;&#24;&#2; (resp. &#18;&#17;&#5; ). Dans ce
qui suit, on appelle signature d&#8217;une analogie
</p>
<p>&#0; &#18;&#24;&#2; &#4; &#18;&#20;&#5; &#4; &#21;&#22;&#2; &#4; &#21;&#3;&#5; &#6;
</p>
<p>le couple des signatures de
&#0; &#18;
</p>
<p>&#2;
</p>
<p>&#4; &#18;
</p>
<p>&#5;
</p>
<p>&#6;
</p>
<p>et de
&#0; &#21;
</p>
<p>&#2;
</p>
<p>&#4; &#21;
</p>
<p>&#5;
</p>
<p>&#6;
</p>
<p>. Signalons que trois filtres suppl&#233;mentaires ont &#233;t&#233; utilis&#233;s afin d&#8217;&#233;li-
miner (i) les analogies dont deux &#233;l&#233;ments ou plus sont identiques ; (ii) les analogies
dont l&#8217;un des couples peut &#234;tre construit en pr&#233;fixant le second, comme appeler/Vmn----
:approcher/Vmn----&gt;rappeler/Vmn----:rapprocher/Vmn----4 (cet exemple illustre bien le type de
probl&#232;me rencontr&#233;) ; (iii) les analogies dont les couples &#0; &#18;&#24;&#2; &#4; &#18;&#20;&#5; &#6; et &#0; &#21;&#22;&#2; &#4; &#21;&#3;&#5; &#6; appartiennent &#224;
la m&#234;me famille ou plus exactement partagent un m&#234;me radical graph&#233;mique comme bas-
sin/Ncms:bassinage/Ncms&gt;bassinoire/Ncfs:bassinement/Ncms (dans la grande majorit&#233; de ces
analogies,
</p>
<p>&#0; &#18;
</p>
<p>&#2;
</p>
<p>&#4; &#18;
</p>
<p>&#5;
</p>
<p>&#6;
</p>
<p>et
&#0; &#21;
</p>
<p>&#2;
</p>
<p>&#4; &#21;
</p>
<p>&#5;
</p>
<p>&#6;
</p>
<p>sont dans des relations s&#233;mantiques diff&#233;rentes).
Les r&#233;sultats obtenus sont tr&#232;s satisfaisants : la pr&#233;cision &#233;valu&#233;e en utilisant un &#233;chantillon
&#25;
</p>
<p>de 200 analogies choisies au hasard parmi les 73 018 produites est de 94%. Parmi les
12 analogies erron&#233;es, 7 ne respectent pas la contrainte (1a) comme trait/Ncms:traiter/Vmn-
---&gt; expression/Ncfs:exposer/Vmn---- et 5 ne respectent pas (1b) comme rigoler/Vmn----
:rigolade/Ncfs&gt; blaguer/Vmn----:blague/Ncfs. L&#8217;&#233;chantillon comporte 386 couples de lex&#232;mes
diff&#233;rents dont 376 sont corrects, soit une pr&#233;cision de 97%5.
</p>
<p>3Pour une pr&#233;sentation formelle de ce type d&#8217;analogies, voir (Pirrelli et Yvon 1999).
4Les &#233;tiquettes morpho-syntaxiques sont celles de l&#8217;action GRACE (Rajman et al. 1997).
5&#192; titre de comparaison, un filtrage des appariements bas&#233; sur une classification en familles constructionnelles,
</p>
<p>sans recours &#224; aucune information s&#233;mantique, permet d&#8217;obtenir une pr&#233;cision comprise entre 75% et 85%.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analogies morpho-synonymiques
</p>
<p>4 Analogies morpho-synonymiques et structuration du
lexique
</p>
<p>Les analogies obtenues peuvent &#234;tre r&#233;parties en deux groupes : les analogies strictes sont telles
que les sch&#233;mas constructionnels qui unissent les couples de droite et de gauche sont identiques
(c&#8217;est le cas de adoration/Ncfs:adorer/Vmn---- et v&#233;n&#233;ration/Ncfs:v&#233;n&#233;rer/Vmn---- qui partagent
le sch&#233;ma ation/Ncfs:er/Vmn) ; et les analogies l&#226;ches sont celles dont les sch&#233;mas sont diff&#233;-
rents. Ces derni&#232;res peuvent &#234;tre divis&#233;es en trois sous-groupes : celles dont les deux sch&#233;mas
apparaissent dans une analogie stricte (l&#226;che-1) comme changer/Vmn----:changement/Ncms
et permuter/Vmn----:permutation/Ncfs, dont les sch&#233;masr/Vmn----:ment/Ncms et er/Vmn----
:ation/Ncfs sont tous deux stricts ; celles dont un seul sch&#233;ma y appara&#238;t (l&#226;che-2) comme
r&#233;union/Ncfs:r&#233;unir/Vmn---- etm&#233;lange/Ncms:m&#233;langer/Vmn---- dont seul /Ncms:r/Vmn---- est
strict ; celles dont aucun des deux sch&#233;mas n&#8217;y appara&#238;t (l&#226;che-3) comme bon/Ncms:bont&#233;/Ncfs
et fort/Ncms:force/Ncfs. Le tableau en (2) montre clairement que ces 4 types d&#8217;analogies n&#8217;ont
pas la m&#234;me importance. La 4e colonne pr&#233;sente le nombre moyen d&#8217;analogies par signature du
type correspondant. Cette classification doit n&#233;anmoins &#234;tre affin&#233;e en prenant en compte les
allomorphies (cf. &#167;5).
</p>
<p>(2) type # sign. # analogies moyenne
stricte 978 15 632 15,98
l&#226;che-1 6 794 22 664 3,34
l&#226;che-2 15 018 21 800 1,45
l&#226;che-3 5 780 5 922 1,02
</p>
<p>Les sp&#233;cificit&#233;s s&#233;mantiques et phonologiques des affixes expliquent l&#8217;importance particuli&#232;re
des analogies strictes. (Elles ont un nombre d&#8217;instances moyen nettement plus &#233;lev&#233; que les
analogies l&#226;ches.) Ces derni&#232;res s&#8217;imposent ainsi comme les analogies canoniques (en fait pro-
totypiques) et comme le principal axe de structuration paradigmatique du lexique par la morpho-
logie constructionnelle. Les diff&#233;rences qui existent entre les analogies l&#226;ches sont en revanche
moins attendues : les analogies qui s&#8217;&#233;tablissent entre des sch&#233;mas stricts sont plus fortes que
celles qui s&#8217;&#233;tablissent entre un sch&#233;ma strict et un sch&#233;ma l&#226;che ou entre deux sch&#233;mas l&#226;ches6.
Le tableau en (3) pr&#233;sente la r&#233;partition des sch&#233;mas pour chaque type d&#8217;analogie ainsi que le
nombre de couples de lemmes qu&#8217;ils connectent.
</p>
<p>(3) type # sch&#233;mas # const. moyenne
d&#8217;analogies stricts l&#226;ches-2 l&#226;ches-3 total
stricte 978 0 0 978 13 976 14,29
l&#226;che-1 782 0 0 782 17 200 22,99
l&#226;che-2 768 4 012 0 4 780 18 118 3,79
l&#226;che-3 0 2 154 2 206 4 360 6 744 1,55
</p>
<p>Ces r&#233;sultats confirment les hypoth&#232;ses du Mod&#232;le en R&#233;seau propos&#233; par J. Bybee (Bybee
1988) &#224; savoir que les sch&#233;mas constructionnels n&#8217;ont pas tous la m&#234;me force. Les sch&#233;mas
stricts constituent des points (en fait des sous-graphes) de r&#233;f&#233;rence par rapport auxquels se
d&#233;finit le sens de la plupart des sch&#233;mas. Ainsi les analogies l&#226;ches-1 d&#233;finissent le sens des
sch&#233;mas stricts. On constate que cette d&#233;finition est tr&#232;s compl&#232;te puisque chaque sch&#233;ma strict
</p>
<p>6Un sch&#233;ma constructionnel est dit strict s&#8217;il appara&#238;t dans une analogie stricte et l&#226;che sinon. Parmi ces der-
niers, ceux qui apparaissent dans une analogie l&#226;che-2 sont dit l&#226;ches-2. Les autres sont l&#226;ches-3.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>appara&#238;t en moyenne dans 8,68 signatures d&#8217;analogies l&#226;ches-1. Ceci renforce d&#8217;avantage la ca-
pacit&#233; des sch&#233;mas stricts &#224; servir de r&#233;f&#233;rence. Les analogies l&#226;ches-2 servent &#224; d&#233;crire le sens
des sch&#233;mas l&#226;ches en fonction de sch&#233;mas stricts. On constate que ce mode de d&#233;finition est
plus utilis&#233; que la d&#233;finition du sens des sch&#233;mas l&#226;ches par rapport &#224; eux-m&#234;mes. En particu-
lier, il y a deux fois plus de sch&#233;mas l&#226;ches-2 que de sch&#233;mas l&#226;ches-3 (3e et 4e lignes du tableau
en (3)).
</p>
<p>stricter/menter/ationstricte stricteer/age
l&#226;che-1 l&#226;che-1
</p>
<p>FIG. 2 &#8211; Structuration du lexique par les analogies strictes et de type l&#226;ches-1.
</p>
<p>Il ressort des chiffres des tableaux (2) et (3) qu&#8217;il existe une distinction nette entre les analogies
l&#226;ches du 1er type qui participent fortement &#224; la structuration du lexique (cf. figure 2) et celles
des types 2 et 3 sont plus p&#233;riph&#233;riques. On constate &#233;galement que, dans l&#8217;&#233;chantillon
</p>
<p>&#0;
</p>
<p>, sur
</p>
<p>les 7 erreurs constructionnelles rep&#233;r&#233;es, quatre analogies sont du type l&#226;che-3 et trois du type
l&#226;che-2. On peut donc, dans la perspective de la constitution d&#8217;une ressource de langue g&#233;n&#233;rale
fiable, se limiter aux seules analogies strictes et l&#226;ches-1, soit 7 772 analogies sur 28 570 et
24 464 couples de lex&#232;mes sur 39 008.
</p>
<p>5 Allomorphies
</p>
<p>Le typage des analogies et des sch&#233;mas est d&#233;terminant pour la constitution d&#8217;un lexique
constructionnel, mais aussi pour son utilisation. Or, les r&#233;sultats pr&#233;sent&#233;s en &#167;4 sont in-
complets parce qu&#8217;ils ne prennent pas en compte les allomorphies. Par exemple, l&#8217;analo-
gie p&#233;ril/Ncms:p&#233;rilleux/Afpms&gt;danger/Ncms:dangereux/Afpms est de type l&#226;che-2 alors qu&#8217;il
s&#8217;agit, du point de vue constructionnel, d&#8217;une variante de hasard/Ncms:hasardeux/Afpms&gt; dan-
ger/Ncms:dangereux/Afpms qui, elle, est stricte. L&#8217;identification de cette allomorphie permet-
trait d&#8217;une part de r&#233;cup&#233;rer la 1re analogie comme stricte et sure, mais aussi de r&#233;&#233;valuer l&#8217;im-
portance du sch&#233;ma /eux/Ncms/Afpms.
</p>
<p>La bonne qualit&#233; g&#233;n&#233;rale des analogies morpho-synonymiques permet de traiter efficacement
ces variations. Comme nous venons de le voir, les analogies s&#8217;&#233;tablissent prioritairement entre
des couples de lex&#232;mes connect&#233;s par le m&#234;me sch&#233;ma constructionnel. Elles constituent de ce
fait un contexte privil&#233;gi&#233; pour identifier les allomorphies.
</p>
<p>(4) a. approbation/Ncfs:approuver/Vmn----&gt;adh&#233;sion/Ncfs:adh&#233;rer/Vmn----
b. st&#233;rile/Afpms:st&#233;rilisation/Ncfs&gt;aseptique/Afpms:aseptisation/Ncfs
c. brutalement/Rgp:brutalit&#233;/Ncfs&gt;durement/Rgp:duret&#233;/Ncfs
d. vision/Ncfs:visiblement/Rgp&gt;sensation/Ncfs:sensiblement/Rgp7
</p>
<p>Les analogies allomorphiques peuvent &#234;tre r&#233;parties en quatre types selon que les sch&#233;mas
qui les composent sont simples ou compos&#233;s et qu&#8217;ils correspondent &#224; une ou deux relations de
</p>
<p>7Exemple forg&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analogies morpho-synonymiques
</p>
<p>construction (cf. (4)). Par exemple l&#8217;analogie (4a) comporte une allomorphie pour les substantifs
tandis que (4c) en pr&#233;sente deux, l&#8217;une pour les substantifs et l&#8217;autre pour les adverbes. Les
allomorphies 1-simples sont naturellement les plus int&#233;ressantes dans la mesure o&#249; ce sont les
plus &#233;l&#233;mentaires et o&#249; celles qui correspondent aux trois autres types peuvent &#234;tre retrouv&#233;es &#224;
partir de ces derni&#232;res.
</p>
<p>L&#8217;identification des analogies allomorphiques est bas&#233;e sur quatre crit&#232;res. Le premier (crit&#232;re
A) permet de distinguer les allomorphies constructionnelles des allomorphies flexionnelles (qui
concernent par exemple les participes pass&#233;s et pr&#233;sents convertis en adjectifs) et des analogies
compos&#233;es de sch&#233;mas non allomorphes. Ce crit&#232;re reprend en partie celui que propose (Jac-
quemin 1997) qui d&#233;crit les allomorphies entre deux suffixes &#0;&#2;&#1; et &#0; &#3; , de tailles &#4; &#1; et &#4; &#3; , &#224; l&#8217;aide
d&#8217;un triplet d&#8217;entiers
</p>
<p>&#5;
</p>
<p>&#4;&#7;&#6; &#4;&#9;&#8; &#6; &#4;&#9;&#8; &#8; &#10; o&#249; &#4; est la taille la partie finale commune &#224; &#0;&#2;&#1; et &#0; &#3; ; soit &#0; cette
partie ; &#4;&#9;&#8;&#12;&#11;&#14;&#13;&#16;&#15; &#17;
</p>
<p>&#5;
</p>
<p>&#4;
</p>
<p>&#1;
</p>
<p>&#6; &#4;
</p>
<p>&#3;
</p>
<p>&#10;&#12;&#18;&#19;&#4; est le nombre de caract&#232;res dans le plus petit des deux suffixes
qui se trouvent avant &#0; ; &#4;&#9;&#8; &#8;&#20;&#11;&#21;&#13;&#16;&#22; &#23;
</p>
<p>&#5;
</p>
<p>&#4;
</p>
<p>&#1;
</p>
<p>&#6; &#4;
</p>
<p>&#3;
</p>
<p>&#10;&#24;&#18;&#25;&#4; est le nombre de caract&#232;res dans le plus grand
des deux suffixes qui se trouvent avant &#0; . Ce d&#233;coupage est illustr&#233; en figure 3 pour le couple
</p>
<p>ab t i o n
nois
</p>
<p>n&#8221;
</p>
<p>n&#8217; n
</p>
<p>FIG. 3 &#8211; D&#233;coupage des suffixes allomorphiques bation:sion.
</p>
<p>bation:sion auquel il associe le triplet
&#5; &#26;
</p>
<p>&#6; fffi&#6;
</p>
<p>&#26;
</p>
<p>&#10; . La signature uver:rer est pour sa part caract&#233;ris&#233;e
par le triplet
</p>
<p>&#5; fl
</p>
<p>&#6; fffi&#6;
</p>
<p>fl
</p>
<p>&#10; . &#192; chaque signature d&#8217;analogie correspond ainsi un couple de triplets qui
permet de d&#233;terminer si elle est susceptible d&#8217;&#234;tre allomorphique. Notre objectif &#233;tant diff&#233;rent
de celui de (Jacquemin 1997), nous avons d&#233;fini le crit&#232;re A directement &#224; partir de ces 6 valeurs
et non pas sous la forme d&#8217;une distance et d&#8217;un seuil. Une signature d&#8217;analogie caract&#233;ris&#233;e par
les triplets ffi
</p>
<p>&#5;
</p>
<p>&#4;
</p>
<p>&#1;
</p>
<p>&#6; &#4;
</p>
<p>&#8;
</p>
<p>&#1;
</p>
<p>&#6; &#4;
</p>
<p>&#8; &#8;
</p>
<p>&#1;
</p>
<p>&#10; &#6;
</p>
<p>&#5;
</p>
<p>&#4;
</p>
<p>&#3;
</p>
<p>&#6; &#4;
</p>
<p>&#8;
</p>
<p>&#3;
</p>
<p>&#6; &#4;
</p>
<p>&#8; &#8;
</p>
<p>&#3;
</p>
<p>&#10; &#31; v&#233;rifie le crit&#232;re A si :
</p>
<p>(5) a. &#13;&#16;&#22;&#2;&#23; &#5; &#4; &#1; &#6; &#4; &#3; &#10;! &#26; ,
b. &quot; &#4;&#9;&#8; &#1; &#18;#&#4;&#9;&#8;&#3; &quot;fi$
</p>
<p>fl
</p>
<p>, &quot; &#4;&#9;&#8; &#8;
&#1;
</p>
<p>&#18;#&#4;&#9;&#8; &#8;
</p>
<p>&#3;
</p>
<p>&quot;fi$
</p>
<p>fl
</p>
<p>et
</p>
<p>c. &quot; &#4;&#9;&#8; &#1; &#18;#&#4;&#9;&#8;&#3; &quot; %&amp;&quot; &#4;&#9;&#8; &#8;&#1; &#18;#&#4;&#9;&#8; &#8;&#3; &quot;'$
&#26;
</p>
<p>.
</p>
<p>Les conditions (5a) et (5c) sont destin&#233;es &#224; &#233;liminer les analogies non allomorphiques ainsi
que les allomorphies flexionnelles comme fan&#233;e/Ncfs:faner/Vmn----&gt;fl&#233;trie/Ncfs:fl&#233;trir/Vmn----.
Notre crit&#232;re se distingue de celui de Ch. Jacquemin par la condition (5b) qui exprime le fait
qu&#8217;une allomorphie doit concerner les deux sch&#233;mas constructionnels de mani&#232;re &#171; compa-
rable &#187;. En effet, les allomorphies sont des variations induites par des contraintes morpho-
phonologiques sur la forme construite (output) qui concernent certaines configurations des
couples base + suffixe (input). La condition (5b) exprime le fait que les variations de l&#8217;out-
put sont induites par les sp&#233;cificit&#233;s formelles de l&#8217;input. Le crit&#232;re A est relativement s&#233;lectif
puisqu&#8217;il n&#8217;est v&#233;rifi&#233; que par 3 354 signatures d&#8217;analogies, soit 18% de celles qui sont l&#226;ches
et isocat&#233;gorielles. Sa pr&#233;cision, estim&#233;e &#224; partir d&#8217;un &#233;chantillon de 100 signatures satisfai-
sant ce crit&#232;re et choisies au hasard est de 62%8. Les erreurs se r&#233;partissent comme pr&#233;sent&#233;
dans la partie droite du tableau en (6). La partie gauche pr&#233;sente une estimation de la propor-
tion des signatures d&#8217;analogies allomorphiques pour chacun des trois types. On constate que
</p>
<p>8Dans la suite de l&#8217;article, les pr&#233;cisions des crit&#232;res sont toutes estim&#233;es &#224; partir d&#8217;&#233;chantillons de 100 signa-
tures choisies au hasard.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>la v&#233;rification du crit&#232;re A semble ind&#233;pendante du type des analogies et que son efficacit&#233; est
satisfaisante, surtout pour le type l&#226;ches-1.
</p>
<p>(6) t&#233;moin crit&#232;re A
type # sign. # allom. prop. # sign. # allom. pr&#233;cision
l&#226;che-1 25 8 32% 22 17 78%
l&#226;che-2 63 14 22% 62 39 63%
l&#226;che-3 12 0 0% 16 6 38%
total 100 22 22% 100 62 62%
</p>
<p>L&#8217;efficacit&#233; du crit&#232;re A peut &#234;tre am&#233;lior&#233;e en lui adjoignant un autre crit&#232;re permettant d&#8217;&#233;limi-
ner certaines des signatures qui posent le plus de probl&#232;mes : les 2-simples et les 2-complexes.
Ces signatures sont caract&#233;ris&#233;es par le fait qu&#8217;elles entrent g&#233;n&#233;ralement dans des configura-
tions &#171; transitives &#187;. Le crit&#232;re B exploite cette propri&#233;t&#233;. Il stipule qu&#8217;une signature d&#8217;analogie
&#0; &#1;&#3;&#2; &#4; &#1;&#3;&#5; &#4; &#6;&#7;&#2; &#4; &#6; &#5; &#8;
</p>
<p>ou
&#0; &#6;&#7;&#2; &#4; &#6;&#7;&#5; &#4; &#1;&#9;&#2; &#4; &#1;&#3;&#5; &#8;
</p>
<p>doit &#234;tre &#233;limin&#233;e s&#8217;il existe un suffixe
&#1;&#9;&#10;
</p>
<p>et deux sch&#233;mas
constructionnels
</p>
<p>&#0; &#1;&#12;&#11;
</p>
<p>&#2;
</p>
<p>&#4; &#1;&#12;&#11;
</p>
<p>&#10;
</p>
<p>&#8;
</p>
<p>et
&#0; &#1;&#12;&#11;
</p>
<p>&#10;
</p>
<p>&#4; &#1;&#12;&#11;
</p>
<p>&#5;
</p>
<p>&#8;
</p>
<p>qui apparaissent dans deux signatures tels que :
</p>
<p>(7) a. &#0; &#1; &#2; &#4; &#1; &#10; &#8;&#14;&#13;&#15;&#0; &#1;&#12;&#11; &#2; &#4; &#1;&#12;&#11;&#10; &#8; et &#0; &#1; &#5; &#4; &#1; &#10; &#8;&#14;&#13;&#15;&#0; &#1;&#12;&#11;&#5; &#4; &#1;&#12;&#11;&#10; &#8;
</p>
<p>b. freq
&#0; &#1;&#9;&#2; &#4; &#1;&#3;&#5; &#8;&#14;&#16;
</p>
<p>freq
&#0; &#1;&#12;&#11;
</p>
<p>&#2;
</p>
<p>&#4; &#1;&#12;&#11;
</p>
<p>&#10;
</p>
<p>&#8;
</p>
<p>et freq
&#0; &#1;&#9;&#2; &#4; &#1;&#3;&#5; &#8;&#14;&#16;
</p>
<p>freq
&#0; &#1;&#12;&#11;
</p>
<p>&#10;
</p>
<p>&#4; &#1;&#12;&#11;
</p>
<p>&#5;
</p>
<p>&#8;
</p>
<p>o&#249;
&#13;
</p>
<p>d&#233;note une relation de subsomption entre deux sch&#233;mas constructionnels tels que le pre-
mier est une sp&#233;cialisation du second. Formellement,
</p>
<p>&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#4; &#1;
</p>
<p>&#10;
</p>
<p>&#8;&#14;&#13;&#17;&#0; &#1;&#12;&#11;
</p>
<p>&#2;
</p>
<p>&#4; &#1;&#12;&#11;
</p>
<p>&#10;
</p>
<p>&#8;
</p>
<p>si
&#1;&#12;&#11;
</p>
<p>&#2;
</p>
<p>est un suffixe de
&#1;
</p>
<p>&#2;
</p>
<p>,
</p>
<p>&#1;&#12;&#11;
</p>
<p>&#10;
</p>
<p>est un suffixe de
&#1;
</p>
<p>&#10;
</p>
<p>et &#18;
&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#8; &#19;
</p>
<p>&#18;
</p>
<p>&#0; &#1;&#12;&#11;
</p>
<p>&#2;
</p>
<p>&#8;&#21;&#20;
</p>
<p>&#18;
</p>
<p>&#0; &#1;
</p>
<p>&#10;
</p>
<p>&#8; &#19;
</p>
<p>&#18;
</p>
<p>&#0; &#1;&#12;&#11;
</p>
<p>&#10;
</p>
<p>&#8;
</p>
<p>, o&#249; &#18;
&#0; &#1;&#9;&#8;
</p>
<p>est le nombre de caract&#232;res du
suffixe
</p>
<p>&#1;
</p>
<p>. freq
&#0; &#1;&#22;&#4; &#1;&#12;&#11; &#8;
</p>
<p>est la fr&#233;quence associ&#233;e au sch&#233;ma
&#0; &#1;&#22;&#4; &#1;&#3;&#11; &#8;
</p>
<p>calcul&#233;e lors de l&#8217;apprentissage
des sch&#233;mas &#224; partir du lexique des formes.
</p>
<p>Par exemple, le fait qu&#8217;il existe un sch&#233;ma arit&#233;/ier/Ncfs/Afpms et un sch&#233;ma
er/&#232;rement/Afpms/Rgp qui subsume ier/i&#232;rement/Afpms/Rgp permet d&#8217;&#233;liminer le sch&#233;ma
2-simple arit&#233;/i&#232;rement/Ncfs/Rgp. La partie gauche du tableau en (8) pr&#233;sente une &#233;valuation
de la pr&#233;cision des crit&#232;res A et B lorsqu&#8217;ils sont appliqu&#233;s s&#233;par&#233;ment sur l&#8217;ensemble des
analogies et que seules les signatures qui v&#233;rifient les deux sont conserv&#233;es.
</p>
<p>(8) crit&#232;res A et B crit&#232;res A, B, C et D
type # sign. # allom. pr&#233;c. # sign. # allom. pr&#233;c.
l&#226;che-1 38 34 89% 40 39 97%
l&#226;che-2 52 45 84% 53 45 84%
l&#226;che-3 10 6 60% 7 6 85%
total 100 85 85% 100 90 90%
</p>
<p>Deux conditions suppl&#233;mentaires ont &#233;t&#233; utilis&#233;es pour am&#233;liorer ces r&#233;sultats. La premi&#232;re
(crit&#232;re C) consiste &#224; &#233;liminer les signatures dans lesquels apparaissent des sch&#233;mas construc-
tionnels sym&#233;trisables. Un sch&#233;ma
</p>
<p>&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#4; &#1;
</p>
<p>&#5;
</p>
<p>&#8;
</p>
<p>est sym&#233;trisable s&#8217;il existe un sch&#233;ma
&#0; &#6;
</p>
<p>&#2;
</p>
<p>&#4; &#6;
</p>
<p>&#5;
</p>
<p>&#8;
</p>
<p>tel
que ces quatre suffixes apparaissent dans deux signatures
</p>
<p>&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#4; &#1;
</p>
<p>&#5;
</p>
<p>&#4; &#6;
</p>
<p>&#2;
</p>
<p>&#4; &#6;
</p>
<p>&#5;
</p>
<p>&#8;
</p>
<p>et
&#0; &#1;
</p>
<p>&#5;
</p>
<p>&#4; &#1;
</p>
<p>&#2;
</p>
<p>&#4; &#6;
</p>
<p>&#2;
</p>
<p>&#4; &#6;
</p>
<p>&#5;
</p>
<p>&#8;
</p>
<p>ou
&#0; &#6;
</p>
<p>&#2;
</p>
<p>&#4; &#6;
</p>
<p>&#5;
</p>
<p>&#4; &#1;
</p>
<p>&#2;
</p>
<p>&#4; &#1;
</p>
<p>&#5;
</p>
<p>&#8;
</p>
<p>et
&#0; &#6;
</p>
<p>&#2;
</p>
<p>&#4; &#6;
</p>
<p>&#5;
</p>
<p>&#4; &#1;
</p>
<p>&#5;
</p>
<p>&#4; &#1;
</p>
<p>&#2;
</p>
<p>&#8;
</p>
<p>. De tels sch&#233;mas correspondent &#224; une relation s&#233;mantique l&#226;che
ou difficile &#224; exprimer dans un dictionnaire de synonymes, et sont donc susceptibles de provo-
quer des erreurs. La seconde (crit&#232;re D) est une contrainte sur la taille maximale que peut avoir
&#18;
</p>
<p>&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#8;&#24;&#23;
</p>
<p>&#18;
</p>
<p>&#0; &#1;
</p>
<p>&#5;
</p>
<p>&#8;
</p>
<p>, en l&#8217;occurrence &#18;
&#0; &#1;
</p>
<p>&#2;
</p>
<p>&#8;&#24;&#23;
</p>
<p>&#18;
</p>
<p>&#0; &#1;
</p>
<p>&#5;
</p>
<p>&#8;&#25;&#16;ff&#26; fi
</p>
<p>. Les signatures &#233;limin&#233;es par ce crit&#232;re, g&#233;-
n&#233;ralement 1-complexes, 2-simples ou 2-complexes sont impliqu&#233;es dans la plupart des erreurs
qui &#233;chappent aux crit&#232;res A et B. La partie droite du tableau en (8) pr&#233;sente une estimation de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analogies morpho-synonymiques
</p>
<p>la pr&#233;cision lorsque les quatre crit&#232;res sont appliqu&#233;s (le filtrage par C et D pr&#233;c&#232;de celui par B).
On constate que les crit&#232;res C et D sont globalement efficaces et qu&#8217;ils am&#233;liorent la pr&#233;cision
pour les signatures l&#226;ches-1 au point o&#249; il devient envisageable de les utiliser directement.
</p>
<p>6 Travaux connexes
</p>
<p>Deux articles, (Grabar et Zweigenbaum 1999) et (Jacquemin 1997), sont &#224; l&#8217;origine du travail
pr&#233;sent&#233; ici. Le premier, tr&#232;s proche du n&#244;tre, exploite les liens de synonymie pr&#233;sents dans
le Microglossaire SNOMED pour identifier les relations de parent&#233; morphologique entre les
termes de la terminologie CIM-10. La d&#233;marche de ces auteurs diff&#232;re cependant de la n&#244;tre
par le fait que ces relations ne sont pas filtr&#233;es par la contrainte d&#8217;analogie du fait de la taille
r&#233;duite du th&#233;saurus initial (5 801 termes). Le traitement des allomorphies pr&#233;sent&#233; en &#167;5 est
directement inspir&#233; du second article. Dans ce travail, Ch. Jacquemin s&#8217;int&#233;resse aux variations
morpho-syntaxiques de bi-termes. Ces derni&#232;res sont similaires &#224; nos analogies &#224; ceci pr&#232;s que
la relation entre les deux termes est syntagmatique tandis que celle qui unit les synonymes est
paradigmatique.
</p>
<p>Signalons par ailleurs qu&#8217;au moins deux autres projets de recherche utilisent comme ressource
des dictionnaires de synonymes. (Hamon et al. 1999) se servent des renvois synonymiques
du Robert pour enrichir la structure d&#8217;un th&#233;saurus. Leur travail montre clairement que les
ressources de langue g&#233;n&#233;rale et de langues de sp&#233;cialit&#233; sont compl&#233;mentaires. La premi&#232;re
s&#8217;av&#232;re m&#234;me sup&#233;rieure aux secondes en terme de rappel. En contrepartie, la pr&#233;cision des
liens inf&#233;r&#233;s est faible. Pour leur part, (Ploux et Victorri 1998) utilisent le m&#234;me dictionnaire
de synonymes que nous et s&#8217;int&#233;ressent eux aussi &#224; la structure du lexique. Leur travail se
distingue n&#233;anmoins du n&#244;tre sur plusieurs points : il ne vise pas &#224; construire ou &#224; enrichir une
ressource pour le TALN ; l&#8217;&#233;tude porte uniquement sur la polys&#233;mie dans le cadre d&#8217;une th&#233;orie
&#171; continuiste &#187; du sens ; les synonymes ne sont pas &#233;tiquet&#233;s ; les relations synonymiques sont
sym&#233;tris&#233;es ; les donn&#233;es sont utilis&#233;es telles qu&#8217;elles, sans aucun filtrage.
</p>
<p>7 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; une m&#233;thode permettant d&#8217;extraire automatiquement un lexique construc-
tionnel &#224; partir d&#8217;un dictionnaire de synonymes. Cette m&#233;thode est ind&#233;pendante des langues
particuli&#232;res puisqu&#8217;elle ne met en &#339;uvre aucune connaissance linguistique. Elle est &#233;galement
ind&#233;pendante des dictionnaires particuliers et devrait &#234;tre utilisable directement avec d&#8217;autres
ressources comme les dictionnaires WordNet et EuroWordNet. Ce travail a &#233;galement permis
de mettre au jour certains aspects de la structure morphologique du lexique et de proposer un
ensemble de crit&#232;res qui permettent d&#8217;identifier les variations allomorphiques de mani&#232;re tr&#232;s
pr&#233;cise.
</p>
<p>Remerciements
</p>
<p>Ce travail a b&#233;n&#233;fici&#233; d&#8217;un financement du Minist&#232;re de l&#8217;&#201;ducation Nationale, de la Recherche
et de la Technologie dans le cadre de l&#8217;Action concert&#233;e incitative &#171; jeunes chercheurs &#187; (1999-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Nabil Hathout
</p>
<p>2002). Je voudrais remercier, &#224; titre posthume, Jean-Yves Hamon pour le dictionnaire qu&#8217;il
a mis &#224; ma disposition. Je remercie &#233;galement Ludovic Tanguy ainsi que les deux relecteurs
anonymes pour leurs commentaires constructifs.
</p>
<p>R&#233;f&#233;rences
Bybee, J. L. (1988). Morphology as Lexical Organization. In Hammond, M. et Noonan, M., &#233;diteurs,
Theoretical Morphology. Approaches in Modern Linguistics, chapitre 7, pp. 119&#8211;141. Academic Press,
San Diego, CA.
Courtois, B. (1990). Un syst&#232;me de dictionnaires &#233;lectroniques pour les mots simples du fran&#231;ais.
Langue fran&#231;aise, 87:11&#8211;22.
Cruse, D. A. (1986). Lexical Semantics. Cambridge University Press, Cambridge, UK.
Daille, B. et Jacquemin, C. (1998). Lexical Database and Information Access: A Fruitful Association. In
Proceedings of the First International Conference on Language Resources and Evaluation, pp. 669&#8211;673,
Granada, Espagne. ELRA.
Fellbaum, C., &#233;diteur (1999). WordNet: an Electronic Lexical Database. MIT Press, Cambridge, Mass.
Grabar, N. et Zweigenbaum, P. (1999). Acquisition automatique de connaissances morphologiques sur le
vocabulaire m&#233;dical. In Actes de la 6eConf&#233;rence Annuelle sur le Traitement Automatique des Langues
Naturelles (TALN-98), pp. 175&#8211;184, Carg&#232;se.
Gross, M. (1975). M&#233;thodes en syntaxe : R&#233;gime des constructions compl&#233;tives. Hermann, Paris.
Gruaz, C. (1997). La stratification d&#233;rivationnelle dans les familles synchroniques des mots fran&#231;ais
comtemporain. In III Coloquio Internacional de Ling&#252;&#237;stica Francesa, Salamanca, Espagne.
Hamon, T., Garcia, D., et Nazarenko, A. (1999). D&#233;tection de liens de synonymie : compl&#233;mentarit&#233;
des ressources g&#233;n&#233;rales et sp&#233;cialis&#233;es. In Actes de Terminologie et Intelligence Artificielle, pp. 45&#8211;58,
Nantes, France.
Hathout, N. (2000). Morphological Pairing based on the Network Model. In Proceedings of the Work-
shop on Computational Lexicography and Multimedia Dictionaries (COMLEX 2000), pp. 35&#8211;38, Pyrgos,
Gr&#232;ce.
Hathout, N., Namer, F., et Dal, G. (2002). An Experimental Constructional Database : The MorTAL
Project. In Boucher, P., &#233;diteur, Many Morphologies. Cascadilla, Cambridge, Mass. &#192; para&#238;tre.
Jacquemin, C. (1997). Guessing Morphology from Terms and Corpora. In Proceedings of 20th An-
nual International ACM SIGIR Conference on Research and Development in Information Retrieval (SI-
GIR&#8217;97), pp. 156&#8211;167, Philadelphia, PA. ACM.
Jing, H. et Tzoukerman, E. (1999). Information Retrieval based on Context Distance and Morphology.
In Proceedings of 22th Annual International ACM SIGIR Conference on Research and Development in
Information Retrieval (SIGIR&#8217;99), pp. 90&#8211;96, Berkeley, CA. ACM.
Pirrelli, V. et Yvon, F. (1999). The hidden dimension: a paradigmatic view of data-driven NLP. Journal
of Experimental &amp; Theoretical Artificial Intelligence, 1999(11):391&#8211;408.
Ploux, S. et Victorri, B. (1998). Constructions d&#8217;espaces s&#233;mantiques &#224; l&#8217;aide de dictionnaires de syno-
nymes. T.A.L., 39(1):161&#8211;182.
Rajman, M., Lecomte, J., et Paroubek, P. (1997). Format de description lexicale pour le fran&#231;ais. Partie
2 : Description morpho-syntaxique. Rapport GRACE GTR-3-2.1, EPFL &amp; INaLF.</p>

</div></div>
</body></html>