<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Repr&#233;sentation &#233;v&#232;nementielle des d&#233;placements dans des d&#233;p&#234;ches &#233;pid&#233;miologiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Repr&#233;sentation &#233;v&#232;nementielle des d&#233;placements dans des
d&#233;p&#234;ches &#233;pid&#233;miologiques
</p>
<p>Manal El Zant1, Jean Royaut&#233;1, Michel Roux1
(1) LIF / Universit&#233; de la M&#233;diterran&#233;e, 27 Bd Jean Moulin, 13005 Marseille
</p>
<p>el.zant@medecine.univ-mrs.fr, jean.royaute@lif.univ-mrs.fr,
michel.roux@medecine.univ-mrs.fr
</p>
<p>R&#233;sum&#233;. La repr&#233;sentation &#233;v&#232;nementielle des d&#233;placements de personnes dans des d&#233;-
p&#234;ches &#233;pid&#233;miologiques est d&#8217;une grande importance pour une compr&#233;hension d&#233;taill&#233;e du
sens de ces d&#233;p&#234;ches. La diss&#233;mination des composants d&#8217;une telle repr&#233;sentation dans les d&#233;-
p&#234;ches rend difficile l&#8217;acc&#232;s &#224; leurs contenus. Ce papier d&#233;crit un syst&#232;me d&#8217;extraction d&#8217;infor-
mation utilisant des cascades de transducteurs &#224; nombre d&#8217;&#233;tats fini qui ont permis la r&#233;alisation
de trois t&#226;ches : la reconnaissance des entit&#233;s nomm&#233;es, l&#8217;annotation et la repr&#233;sentation des
composants ainsi que la repr&#233;sentation des structures &#233;v&#232;nementielles. Nous avons obtenu une
moyenne de rappel de 80, 93% pour la reconnaissance des entit&#233;s nomm&#233;es et de 97, 88% pour
la repr&#233;sentation des composants. Ensuite, nous avons effectu&#233; un travail de normalisation de
cette repr&#233;sentation par la r&#233;solution de certaines anaphores pronominales. Nous avons obtenu
une valeur moyenne de pr&#233;cision de 81, 72% pour cette r&#233;solution.
</p>
<p>Abstract. The representation of motion events is important for an automatic comprehen-
sion of disease outbreak reports. The dispersion of components in this type of reports makes
it difficult to have such a representation. This paper describes an automatic extraction of event
structures representation of these texts. We built an information extraction system by using cas-
caded finite state transducers which allowed the realization of three tasks : the named entity re-
cognition, the component annotation and representation and the event structure representation.
We obtained a recall of 80, 93% for the named entity recognition task and a recall of 97, 88% for
argument representation task. Thereafter, we worked in anaphoric pronouns resolution where
we obtained a precision of 81.83%.
</p>
<p>Mots-cl&#233;s : Sous-langage, repr&#233;sentation &#233;v&#232;nementielle, extraction d&#8217;information, struc-
ture pr&#233;dicative, structure predicate-arguments.
</p>
<p>Keywords: Sublanguage, event structure representation, information extraction, predi-
cative structure, predicate-arguments structure.
</p>
<p>1 Introduction
</p>
<p>Dans le cadre de la veille sanitaire, le projet Epid&#233;mIA a pour but de b&#226;tir un syst&#232;me d&#8217;aide &#224; la
d&#233;cision en utilisant les caract&#233;ristiques des &#233;pid&#233;mies d&#233;crites dans les d&#233;p&#234;ches &#233;pid&#233;miolo-
giques. Ce projet comporte deux principaux modules : (i) un module de traitement automatique
de la langue naturelle (notre contribution dans ce papier) pour obtenir une repr&#233;sentation &#233;v&#232;-
nementielle des textes. Cette repr&#233;sentation doit tenir compte de l&#8217;agr&#233;gation des &#233;v&#232;nements et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Manal El Zant, Jean Royaut&#233;, Michel Roux
</p>
<p>de leur localisation spatio-temporelle ; (ii) un outil exploitant un langage formel de repr&#233;senta-
tion des connaissances (STEEL) adapt&#233; &#224; la probl&#233;matique des informations &#233;pid&#233;miologiques
et tenant compte de la propagation des &#233;v&#232;nements dans le r&#233;cit (Chaudet, 2004).
Notre objectif a &#233;t&#233; le d&#233;veloppement d&#8217;un syst&#232;me d&#8217;extraction d&#8217;information permettant la re-
pr&#233;sentation &#233;v&#232;nementielle du contenu de ces d&#233;p&#234;ches. Cette repr&#233;sentation doit tenir compte
des diff&#233;rentes formes d&#8217;informations qui composent les &#233;v&#232;nements ainsi que de leur localisa-
tion spatiale et temporelle. Pour que nos sorties puissent &#234;tre utilis&#233;es par la suite par le module
STEEL, nous adoptons pour ses sorties une repr&#233;sentation pr&#233;dicative logique dans laquelle la
quantification existentielle est implicite.
</p>
<p>FIG. 1 &#8211; Repr&#233;sentation &#233;v&#232;nementielle des donn&#233;es &#233;pid&#233;miologiques.
La complexit&#233; du contenu des d&#233;p&#234;ches rend difficile une telle repr&#233;sentation. Cette complexit&#233;
est li&#233;e aux relations d&#8217;inclusion entre les diff&#233;rents &#233;v&#232;nements et &#224; la dispersion des com-
posants d&#8217;un &#233;v&#232;nement dans plusieurs autres &#233;v&#232;nements (Huttunen et al., 2002a; Huttunen
et al., 2002b). La figure 1 montre les informations d&#233;taill&#233;es des diff&#233;rents &#233;v&#232;nements d&#8217;un
exemple de d&#233;p&#234;ches. Le contenu des n&#339;uds repr&#233;sentent les formes de surface des composants
de cette d&#233;p&#234;che (personne concern&#233;e, cause, lieu et temps). Les fl&#232;ches en traits pleins repr&#233;-
sentent les relations entre verbes et composants, les fl&#232;ches en pointill&#233;s permettent de r&#233;cup&#233;rer
les composants omis. La t&#226;che de normalisation est con&#231;ue pour trouver les composants omis
ou incomplet (autrement dit, r&#233;pondre aux questions de la figure 1 : when ?, where ?, who ? et
why ?). Notons ici que les deux questions when ? et where ? ont deux niveaux de traitement : (i)
le cas o&#249; une localisation est totalement absente et pour laquelle la question porte sur une rela-
tion directe avec le verbe (ici, la question when ? pour le verbe transfer et la question where ?
pour le verbe die) ; (ii) le cas o&#249; une localisation existe mais est incompl&#232;te : la question n&#233;-
cessite alors un enrichissement d&#8217;information sur cette localisation (ici, la question when ? pour
l&#8217;expression today pour laquelle nous pr&#233;cisons la date et la question where ? pour les deux
localisation EQH et isolation ward at TTH).
Dans la section 2, nous pr&#233;sentons la structure globale de notre syst&#232;me. Puis la section 3 d&#233;-
taille les diff&#233;rentes &#233;tapes de l&#8217;analyse locale qui consiste en une reconnaissance, annotation et
repr&#233;sentation pr&#233;dicative logique des composants du sous langage des d&#233;p&#234;ches. Nous utilisons
&#224; cette &#233;tape une typologie des verbes afin d&#8217;avoir une repr&#233;sentation des structures &#233;v&#232;nemen-
tielles. Finalement, la section 4 est consacr&#233;e &#224; r&#233;soudre certaines anaphores pronominales, ce
qui permet, gr&#226;ce &#224; un ensemble de r&#232;gles de normalisation, de compl&#233;ter des informations
incompl&#232;tes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation &#233;v&#232;nementielle des d&#233;placements dans des d&#233;p&#234;ches &#233;pid&#233;miologiques
</p>
<p>2 Description du syst&#232;me
</p>
<p>Une architecture g&#233;n&#233;rale des syst&#232;mes d&#8217;extraction d&#8217;information (SEI) est propos&#233;e par (Grish-
man, 1997). Un SEI traitant la surveillance des &#233;pid&#233;mies a en plus pour objectif de d&#233;crire
l&#8217;&#233;volution de la population infect&#233;e. Les syst&#232;mes de ce domaine font partie des syst&#232;mes de
Bio-s&#233;curit&#233; (IFE-Bio1) (Hirschman et al., 2001; Sears &amp; Cross, 2001). Dans cette perspective,
deux syst&#232;mes permettent d&#8217;analyser les d&#233;p&#234;ches &#233;pid&#233;miologiques : le syst&#232;me Proteus-BIO
(Grishman et al., 2002a; Grishman et al., 2002b) et le syst&#232;me MiTAP2 (Damianos et al., 2002;
Damianos et al., 2003; Damianos et al., 2004). L&#8217;objectif de l&#8217;extraction est de pouvoir identi-
fier pour chaque d&#233;p&#234;che le lieu et le temps de l&#8217;&#233;pid&#233;mie, le nom de l&#8217;&#233;pid&#233;mie, le nombre et
le type de personnes concern&#233;es en pr&#233;cisant s&#8217;il s&#8217;agit de personnes mortes ou malades. Les
projets Proteus-Bio et MiTAP utilisent respectivement le syst&#232;me d&#8217;extraction d&#8217;information
NYU (Grishman, 1995) et le syst&#232;me Alembic (Aberdeen et al., 1995). Avec une adaptation aux
exigences du domaine &#233;pid&#233;miologique, ces deux syst&#232;mes ont apport&#233; des r&#233;ponses aux pro-
bl&#232;mes d&#8217;extraction des sc&#233;narios d&#8217;&#233;v&#232;nements de surveillance en respectant les attentes des
projets IFE-Bio.
</p>
<p>FIG. 2 &#8211; Architecture de notre Module
Notre approche est similaire aux projet Proteus et MiTAP par l&#8217;utilisation de ces d&#233;p&#234;ches pour
analyser la situation &#233;pid&#233;miologique. Par contre, notre but n&#8217;est pas la surveillance de l&#8217;&#233;volu-
tion du nombre de cas d&#8217;une &#233;pid&#233;mie. Nous avons orient&#233; notre recherche sur le ph&#233;nom&#232;ne
du d&#233;placement humain qui est tr&#232;s important en &#233;pid&#233;miologie et fondamental pour une bonne
repr&#233;sentation de l&#8217;ensemble des d&#233;p&#234;ches. Nous avons analys&#233; les &#233;v&#232;nements des d&#233;p&#234;ches
en se focalisant sur les d&#233;tails de d&#233;placement de la population en question. Notre objectif est
de construire des historiques des diff&#233;rents cas d&#8217;&#233;pid&#233;mie gr&#226;ce &#224; une repr&#233;sentation ad&#233;quate
des ph&#233;nom&#232;nes de d&#233;placement. Pour avoir une telle repr&#233;sentation, notre d&#233;marche, telle que
le montre la figure 2, repose sur les deux points suivants :
</p>
<p>1. une analyse locale : cette partie s&#8217;int&#233;resse &#224; enrichir le lexique (Reconnaissance des
Entit&#233;s Nomm&#233;es) en identifiant automatiquement des entit&#233;s nomm&#233;es utilis&#233;es dans le
langage des d&#233;p&#234;ches &#233;pid&#233;miologiques (h&#244;pital, organisation, g&#233;ographie et pathologie).
</p>
<p>1Integrated Feasibility Experiment for Bio-Security
2MITRE Text and Audio Processing</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Manal El Zant, Jean Royaut&#233;, Michel Roux
</p>
<p>Ensuite, l&#8217;analyse des composants des structures d&#8217;&#233;v&#232;nements (personne concern&#233;e, lieu,
temps et cause) est r&#233;alis&#233;e gr&#226;ce &#224; une identification, un &#233;tiquetage et une sortie sous
forme d&#8217;une repr&#233;sentation pr&#233;dicative logique (Annotation et repr&#233;sentation des compo-
sants) des composants. Finalement, l&#8217;attribution de classes aux verbes du texte (Typologie
des Pr&#233;dicats) permet d&#8217;avoir une repr&#233;sentation &#233;v&#232;nementielle sous forme pr&#233;dicat-
arguments o&#249; le verbe est le pr&#233;dicat et les composants sont ses arguments. Il s&#8217;agit de
reprendre la typologie de Levin utilis&#233;e dans VerbNet pour les diff&#233;rents pr&#233;dicats de notre
corpus (Levin, 1993) pour cette repr&#233;sentation &#233;v&#232;nementielle. Cette &#233;tape d&#8217;analyse est
r&#233;alis&#233;e avec des cascades de transducteurs &#224; nombre d&#8217;&#233;tats fini cr&#233;&#233;es avec le logiciel
Nooj3.
</p>
<p>2. une normalisation : cette &#233;tape a pour r&#244;le d&#8217;enrichir certains composants des diff&#233;rentes
structures. Nous avons con&#231;u des algorithmes programm&#233;s en langage MetaCard pour un
ensemble de r&#232;gles de r&#233;solution des pronoms anaphoriques.
</p>
<p>Notre corpus est constitu&#233; par des d&#233;p&#234;ches de l&#8217;&#233;pid&#233;mie du SRAS (Syndrome Respiratoire
Aigu S&#233;v&#232;re), comportant la description des diff&#233;rents moments de la progression de l&#8217;&#233;pid&#233;mie.
Pour d&#233;gager une m&#233;thode d&#8217;analyse et de repr&#233;sentation de ces d&#233;p&#234;ches &#233;crites en langue
naturelle, nous avons s&#233;l&#233;ctionn&#233; un corpus de 200 d&#233;p&#234;ches du SRAS. Nous nous sommes
int&#233;ress&#233;s plus sp&#233;cifiquement &#224; repr&#233;senter le ph&#233;nom&#232;ne de d&#233;placement des individus dans le
but d&#8217;obtenir une vision de la propagation de l&#8217;&#233;pid&#233;mie. Ce qui nous a amen&#233; &#224; s&#233;lectionner un
sous-corpus d&#8217;&#233;tude de 100 d&#233;p&#234;ches, en tenant compte du crit&#232;re qu&#8217;au moins un &#233;v&#232;nement
de d&#233;placement des individus soit pr&#233;sent. Le corpus d&#8217;&#233;valuation (21 d&#233;p&#234;ches) a &#233;t&#233; choisi
selon le m&#234;me crit&#232;re &#224; partir des 100 autres d&#233;p&#234;ches.
</p>
<p>3 Analyse locale des d&#233;p&#234;ches &#233;pid&#233;miologiques
</p>
<p>Un sous-langage pour les textes scientifiques se caract&#233;rise par : un th&#232;me scientifique pr&#233;cis,
des restrictions lexicales, syntaxiques et s&#233;mantiques, des r&#232;gles de d&#233;viance grammaticale (Bi-
ber, 1993). Harris consid&#232;re qu&#8217;il est possible de mettre en &#233;vidence des classes de mots pour
tout sous-langage. Une classe de mots est d&#233;finie comme un ensemble de mots qui sont ac-
ceptables dans les m&#234;mes contextes (Harris, 1968). De telles classes, g&#233;n&#233;ralement d&#233;finies &#224;
partir de m&#233;thodes distributionnelles, correspondent &#233;troitement aux classes s&#233;mantiques qui
peuvent &#234;tre identifi&#233;es par un expert du domaine (Grishman et al., 1986). L&#8217;analyse des struc-
tures &#233;v&#232;nementielles du sous-langage des d&#233;p&#234;ches et de ses composants repose sur les m&#233;-
thodes et les th&#233;ories linguistiques de Harris ainsi que des autres auteurs qui s&#8217;en sont inspir&#233;s.
Nous nous sommes focalis&#233;s plus particuli&#232;rement sur l&#8217;environnement des verbes pour la re-
pr&#233;sentation &#233;v&#232;nementielle. Avec l&#8217;aide des m&#233;decins &#233;pid&#233;miologistes, nous avons &#233;tudi&#233; les
connaissances associ&#233;es &#224; chacune des d&#233;p&#234;ches. Cette &#233;tude r&#233;v&#232;le la pr&#233;sence constante des
quatre composants suivants (cf. section 1) autour des actions (verbes) :
&#8211; la personne concern&#233;e : l&#8217;entit&#233; complexe qui fait l&#8217;objet d&#8217;une observation,
&#8211; le temps : les diff&#233;rentes expressions temporelles,
&#8211; le lieu : les expressions qui font r&#233;f&#233;rence &#224; une localisation g&#233;ographique,
&#8211; la cause : les expressions repr&#233;sentant une anomalie m&#233;dicale, par exemple, un agent patho-
</p>
<p>g&#232;ne, un virus, une fi&#232;vre, une &#233;pid&#233;mie, etc.. De plus, nous nous int&#233;ressons aux caract&#233;-
3Nooj est un syst&#232;me de traitement automatique de la langue naturelle fond&#233; sur la technologie des transducteurs
</p>
<p>&#224; nombre d&#8217;&#233;tats fini pouvant &#234;tre utilis&#233;s en cascades.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation &#233;v&#232;nementielle des d&#233;placements dans des d&#233;p&#234;ches &#233;pid&#233;miologiques
</p>
<p>ristiques tel que le fait d&#8217;avoir une maladie contagieuse, d&#8217;&#234;tre en contact avec un malade
contagieux et de pouvoir transmettre une maladie contagieuse.
</p>
<p>Ces composants refl&#232;tent les r&#233;gularit&#233;s du sous-langage des d&#233;p&#234;ches. Ils traduisent ainsi les
propri&#233;t&#233;s conceptuelles du corpus. Leur rep&#233;rage est utilis&#233; en sortie pour la repr&#233;sentation
sous forme de pr&#233;dicats logiques des diff&#233;rents composants des d&#233;p&#234;ches. Ces composants se
regroupent autour des pr&#233;dicats verbaux pour former les structures &#233;v&#232;nementielles. Ce rep&#233;-
rage commence par une &#233;tape de reconnaissance des principales entit&#233;s nomm&#233;es du corpus.
La reconnaissance des entit&#233;s nomm&#233;es (REN) est consid&#233;r&#233;e comme une t&#226;che primaire pour
un SEI. De nombreux syst&#232;mes ont &#233;t&#233; d&#233;velopp&#233;s dans plusieurs langues et dans plusieurs
domaines pour reconna&#238;tre et cat&#233;goriser de telles entit&#233;s apparaissant dans les textes (Collier
et al., 2000; Humphreys et al., 2000; Poibeau, 2003). Ces syst&#232;mes se r&#233;partissent, selon leurs
approches d&#8217;analyse, en trois cat&#233;gories : les syst&#232;mes &#224; base de r&#232;gles &#233;crites &#224; la main, les
syst&#232;mes &#224; base d&#8217;apprentissage et les syst&#232;mes mixtes (Sekine &amp; Eriguchi, 2000). Selon ces
auteurs, ces trois cat&#233;gories de syst&#232;mes sont &#233;quivalentes au niveau de leur performance.
Notre syst&#232;me de REN, pour les d&#233;p&#234;ches &#233;pid&#233;miologiques, est un syst&#232;me &#224; base de r&#232;gles
&#233;crites &#224; la main sous forme de transducteurs appliqu&#233;s en cascades sur le texte (El-Zant et al.,
2006). Les entit&#233;s identifi&#233;es par ces transducteurs sont ajout&#233;es au lexique du syst&#232;me et consti-
tuent les entr&#233;es de nouveaux dictionnaires apr&#232;s v&#233;rification manuelle. Ces dictionnaires ont
des priorit&#233;s plus &#233;lev&#233;es que celles des dictionnaires standards afin de limiter les ambigu&#239;t&#233;s.
Nous avons cr&#233;&#233; quatre grammaires pour le rep&#233;rage des noms des h&#244;pitaux, des organisations,
des pathologies et des localisations g&#233;ographiques.
</p>
<p>FIG. 3 &#8211; Reconnaissance des noms des H&#244;pitaux.
</p>
<p>La figure 3 pr&#233;sente le transducteur de reconnaissance des entit&#233;s des noms des h&#244;pitaux ou des
parties des h&#244;pitaux. Dans ce transducteur, le n&#339;ud &lt;CAP-DET&gt; signifie que le mot &#224; identifier
commence par une lettre en majuscule sans &#234;tre un d&#233;terminant. Le n&#339;ud &lt;UPP+MP=&quot;.H$&quot;&gt;
signifie que le mot &#224; identifier est enti&#232;rement form&#233; de lettres majuscules se terminant par la
lettre H (sigle d&#8217;un nom d&#8217;h&#244;pital). La sortie de cette grammaire permet d&#8217;&#233;tiqueter les noms
des h&#244;pitaux, leurs sigles ainsi que divers services d&#8217;h&#244;pitaux. Le chemin de transducteur pour
l&#8217;&#233;tiquetage de l&#8217;expression National University Hospital (NUH) par exemple, est :
&lt;CAP-DET&gt; &lt;CAP-DET&gt; + &lt;hospital&gt; + &lt;P&gt; + &lt;UPP+MP=&quot;.H&quot;$&gt; + &lt;P&gt;.
Chaque d&#233;p&#234;che du corpus d&#8217;&#233;valuation est examin&#233;e par un &#233;pid&#233;miologiste qui donne pour
chaque entit&#233; le nombre d&#8217;occurrence (NL). Nous appliquons ensuite les grammaires de REN
sur ses d&#233;p&#234;ches afin de r&#233;cup&#233;rer le nombre d&#8217;entit&#233;s reconnues automatiquement (NA). Ce
nombre est compos&#233; d&#8217;un nombre de reconnaissances automatiques correctes (NAC) et d&#8217;un
nombre de reconnaissances automatiques incorrectes ou partielles des entit&#233;s (NAI). L&#8217;&#233;valua-
tion globale de notre syst&#232;me pour la reconnaissance des entit&#233;s nomm&#233;es est de 97,55% pour
la pr&#233;cision (P = NAC
</p>
<p>NAC+NAI
) et 80,93% (R = NAC
</p>
<p>NL
) pour le rappel. Nous attribuons ce taux
</p>
<p>&#233;lev&#233; au fait que notre &#233;valuation porte sur un sous-corpus de d&#233;p&#234;ches (21 d&#233;p&#234;ches) de l&#8217;&#233;pi-
d&#233;mie SARS et que notre corpus d&#8217;&#233;tude &#233;tait beaucoup plus vaste (100 d&#233;p&#234;ches) et portait sur
la m&#234;me &#233;pid&#233;mie.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Manal El Zant, Jean Royaut&#233;, Michel Roux
</p>
<p>3.1 Annotation et repr&#233;sentation des composants
</p>
<p>Le sous-language des d&#233;p&#234;ches &#233;pid&#233;miologiques appartient aux connaissances du domaine
d&#233;crivant l&#8217;&#233;volution des maladies infectieuses. Son lexique, tel qu&#8217;il appara&#238;t dans le corpus,
regroupe l&#8217;ensemble des composants (personne concern&#233;e, temps, lieux et cause, cf. section 3).
Pour illustrer cette m&#233;thodologie, nous d&#233;taillons l&#8217;&#233;tude et la structure du composant personne
concern&#233;e (cf. figure 4). Une &#233;tude syntaxico-s&#233;mantique des structures des sous-composants
&#226;ge, description, nombre et personne a &#233;t&#233; n&#233;cessaire. Les unit&#233;s repr&#233;sentant l&#8217;&#226;ge sont for-
m&#233;es s&#233;mantiquement des deux entit&#233;s suivantes : un nombre (Age) et une unit&#233; d&#8217;&#226;ge (AgeU-
nit). Ce composant est repr&#233;sent&#233; syntaxiquement soit par un groupe nominal, soit par une s&#233;-
quence verbale construite autour du verbe age. La figure 5 illustre l&#8217;annotation du composant de
l&#8217;&#226;ge. Pour l&#8217;expression might be aged between 32 and 40 years old le chemin d&#8217;annotation du
transducteur est : PreAge(might + be+ &lt;age,V&gt;) + AgeBetween(&lt;between,PREP&gt;)
+ AgeNb(&lt;NB&gt;) + &lt;CONJ&gt; + AgeNb(&lt;NB&gt;) + Unit(&lt;year&gt;) + old.
</p>
<p>FIG. 4 &#8211; Annotation du composant Personne.
</p>
<p>FIG. 5 &#8211; L&#8217;&#226;ge de la personne concern&#233;e (composant Age de la figure 4).
Le sous-composant Description est form&#233; des quatre unit&#233;s suivantes : pathologie, cas, localisa-
tion et autres descriptions. La mise en &#233;vidence de la pathologie est obtenue par la pr&#233;sence d&#8217;un
adjectif, d&#8217;un nom de pathologie ou de virus qui pr&#233;c&#232;de la personne concern&#233;e (a SARS patient,
an ill passenger, etc.). La description locative est le plus souvent un lieu de soins, un pays ou
une ville (two QEH patients, a nurse from Hong Kong, etc.). La description des diff&#233;rents cas
est form&#233;e avec des adjectifs repr&#233;sentant le cas ou des num&#233;ros d&#233;crivant le classement de ces
cas par rapport &#224; la population atteinte d&#8217;une &#233;pid&#233;mie (new case, the 4th case, etc.).
Apr&#232;s avoir annot&#233; le composant personne concern&#233;e avec ces diff&#233;rents sous-composants, un
autre ensemble de transducteurs cr&#233;e en sortie la repr&#233;sentation finale sous forme d&#8217;une repr&#233;-
sentation pr&#233;dicative logique de ce composant. Ce transducteur poss&#232;de un niveau sup&#233;rieur &#224;
celui de l&#8217;ensemble des transducteurs d&#8217;annotation. Son r&#244;le est l&#8217;agr&#233;gation des composants
&#233;l&#233;mentaires annot&#233;s concernant les personnes. La sortie de ce transducteur est un ensemble de
pr&#233;dicats logiques reprenant la sortie de la grammaire d&#8217;annotation. Pour l&#8217;expression A 47 year</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation &#233;v&#232;nementielle des d&#233;placements dans des d&#233;p&#234;ches &#233;pid&#233;miologiques
</p>
<p>old Malaysian who, la sortie d&#8217;annotation est : &lt;PERSONCONC NumPerson=&quot;1&quot; Age=&quot;47&quot;
Unit=&quot;year&quot; Description=&quot;Malaysian&quot;&gt; A 47 year old Malaysian who
&lt;/PERSONCONC&gt; et la repr&#233;sentation logique est donn&#233;e par : &lt;PERSON&gt; NumPerson(p,1)
DescripPerson(p,Malaysian) Age(p,47) AgeUnit(p,year) &lt;/PERSON&gt;.
L&#8217;&#233;valuation de la repr&#233;sentation des composants est de 97,88% pour la pr&#233;cision et le rap-
pel. Ainsi, pour la repr&#233;sentation des composants, nous avons des valeurs de pr&#233;cision &#233;lev&#233;es
(entre 95,55% et 99,54%). Cette &#233;valuation donne un rappel qui varient entre 97,18% et 99,54%.
Notre syst&#232;me obtient un meilleur r&#233;sultat pour le composant temps (97,50% pour la pr&#233;cision
et 97,85% pour le rappel). Ceci est d&#251; au fait que ce composant appara&#238;t sous des vari&#233;t&#233;s de
forme plus r&#233;duites.
</p>
<p>3.2 Repr&#233;sentation &#233;v&#232;nementielle
</p>
<p>Une structure &#233;v&#232;nementielle se compose d&#8217;un verbe (pr&#233;dicat) et de ses composants (argu-
ments). Chaque argument a un r&#244;le s&#233;mantique (ou r&#244;le th&#233;matique) qui d&#233;crit la signification
de l&#8217;&#233;v&#233;nement indiqu&#233; par le verbe (Jackendoff, 1976; Fillmore, 1968). Les r&#244;les s&#233;mantiques
jou&#233;s par l&#8217;ensemble des arguments par rapport &#224; un verbe particulier entrent dans la structure
Pr&#233;dicat-Arguments de ce verbe. Pour avoir une telle repr&#233;sentation, nous avons adopt&#233; pour
notre application la typologie de Levin utilis&#233;e dans VerbNet (Levin, 1993; Kipper et al., 2000).
Cette cat&#233;gorisation se fait avec l&#8217;ajout d&#8217;un dictionnaire o&#249; les verbes les plus significatifs des
d&#233;p&#234;ches se pr&#233;sentent avec un attribut identifiant leurs classes. L&#8217;exemple de l&#8217;entr&#233;e lexicale :
reveal,V+INF+Class=Indicate indique que le verbe reveal est un verbe de la cat&#233;gorie
Indicate qui regroupe les verbes fournissant une information indicative (e.g. explain, prove,
reveal, confirm, etc.). De plus, la repr&#233;sentation de la s&#233;quence verbale se fait par l&#8217;identification
de trois entit&#233;s : l&#8217;auxiliaire Aux et/ou l&#8217;adverbe DescripEventTime s&#8217;ils sont pr&#233;sents, le
verbe principal Verb ainsi que la cat&#233;gorie s&#233;mantique Class, la forme affirmative ou n&#233;ga-
tive Form et la voix active ou passive Voice de ce verbe. La s&#233;quence verbale have been pre-
viously examined, est repr&#233;sent&#233;e par la forme logique suivante : Class(e,Investigate)
Verb(e,examine) Aux(e,have been) Form(e,Affirmative) Voice(e,Passive)
DescripEventTime(e,previously).
</p>
<p>FIG. 6 &#8211; Repr&#233;sentation &#233;v&#232;nementielle (sortie de la phase de l&#8217;analyse locale).
</p>
<p>Ensuite, la repr&#233;sentation &#233;v&#232;nementielle se fait gr&#226;ce &#224; des transducteurs de regroupement des
pr&#233;dicats verbaux et des diff&#233;rents composants qui se pr&#233;sentent dans une m&#234;me phrase. Ainsi,
pour l&#8217;exemple suivant : 3 health care workers presented to hospitals with febrile illness. 2 of
them revealed signs of pneumonia., la repr&#233;sentation &#233;v&#232;nementielle est donn&#233;e par la figure 6
o&#249; tout les composants et pr&#233;dicats sont repr&#233;sent&#233;s sous forme pr&#233;dicative logique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Manal El Zant, Jean Royaut&#233;, Michel Roux
</p>
<p>4 Normalisation
</p>
<p>Apr&#232;s avoir extrait les structures &#233;v&#232;nementielles, le processus de normalisation permet de r&#233;-
soudre certains pronoms anaphoriques afin d&#8217;obtenir une repr&#233;sentation &#233;v&#232;nementielle stan-
dardis&#233;e. Nous avons mis en &#339;uvre des r&#232;gles de r&#233;solution pour les anaphores pronominales
he, she, they et them. La r&#232;gle relative aux pronoms sujet (He, She et They) utilise un algorithme
similaire pour remplacer l&#8217;argument Personne repr&#233;sent&#233; par le pr&#233;dicat logique Person ayant
la valeur d&#8217;un pronom (Person(p,Pronom)) par le premier argument Personne qui le pr&#233;c&#232;de.
Ainsi, la r&#232;gle relative au pronom personnel compl&#233;ment them consiste &#224; remplacer le pr&#233;di-
cat logique qui contient le pronom them DescripPerson(p,them) par le pr&#233;dicat logique
Person(p,_) de l&#8217;argument personne concern&#233;e qui le pr&#233;c&#232;de. Pour l&#8217;exemple de la figure
6, l&#8217;algorithme de r&#233;solution du pronom them consiste &#224; remplacer la partie repr&#233;sentant le
pronom anaphorique de la figure 6 (DescripPerson(p,them)) par Person(p,health
care workers).
</p>
<p>Pronom He She They Them Total
Pr&#233;cision 79,59% 70,83% 100% 100% 81,72%
</p>
<p>TAB. 1 &#8211; Evaluation de la t&#226;che de r&#233;solution des pronoms anaphoriques.
</p>
<p>L&#8217;&#233;valuation de ces r&#232;gles de r&#233;solution des pronoms anaphoriques (tableau 1) est faite en com-
parant les sorties du programme avec celles fournies par un &#233;valuateur. Les r&#233;sultats de ce
tableau signifient que les pronoms sujet He, She, they ont &#233;t&#233; bien remplac&#233;s par l&#8217;argument
Personne Concern&#233;e qui les pr&#233;c&#232;de et que le pronom compl&#233;ment Them a &#233;t&#233; remplac&#233; par
le pr&#233;dicat logique Person de l&#8217;argument Personne Concern&#233;e qui le pr&#233;c&#232;de. Notre syst&#232;me
donne une pr&#233;cision de 81,72% pour cette r&#233;solution que nous estimons comme faible. Ainsi,
les valeurs les plus faibles de pr&#233;cision constat&#233;es pour les pronoms He (P=79,59%) et She
(P=70,83%) s&#8217;expliquent, comme nous le montrons dans l&#8217;exemple qui suit, par le fait qu&#8217;ils
co-r&#233;f&#232;rent dans ces cas &#224; des groupe nominaux eux-m&#234;me anaphoriques. Prenons l&#8217;exemple
suivant :
</p>
<p>a 48-year-old welder from Kelantan, who works in Singapore. He had returned to Kelan-
tan on 24 Apr 2003. After falling ill on 26 Apr 2003, he was warded at the Kota Baru
hospital. Our investigations revealed that the man did not have any fever when he crossed
the Woodlands checkpoint on 24 Apr 2003. Based on our contact tracing, he did not have
contact with any SARS patient in Singapore.
</p>
<p>les deux premiers pronoms he sont remplac&#233;s par l&#8217;argument personne dont la valeur est 48-
year-old welder et les deux derniers pronoms he sont remplac&#233;s par l&#8217;argument the man. Aucune
information suppl&#233;mentaire n&#8217;est ajout&#233;e dans ce deuxi&#232;me remplacement. Pour qu&#8217;une telle
r&#232;gle de r&#233;solution des cas anaphoriques soit efficace, il faudrait r&#233;soudre les cas des groupes
nominaux anaphoriques (the man par exemple doit &#234;tre remplac&#233; par 48-year-old welder pour
une bonne r&#233;solution des anaphores pronominales).
</p>
<p>5 Conclusion
</p>
<p>Nous avons mis en &#233;vidence le fait que les d&#233;p&#234;ches que nous traitons sont form&#233;es d&#8217;un en-
cha&#238;nement de structures &#233;v&#232;nementielles. Nous d&#233;crivons ces structures sous forme d&#8217;une re-
pr&#233;sentation argumentale pour laquelle les diff&#233;rents composants lieu, temps, cause et personne</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation &#233;v&#232;nementielle des d&#233;placements dans des d&#233;p&#234;ches &#233;pid&#233;miologiques
</p>
<p>que nous avons d&#233;crit sont agr&#233;g&#233;s autour des pr&#233;dicats verbaux. Dans ce papier, nous avons
pr&#233;sent&#233; un syst&#232;me d&#8217;extraction d&#8217;information permettant d&#8217;avoir une repr&#233;sentation &#233;v&#232;ne-
mentielle des d&#233;p&#234;ches. La normalisation de cette repr&#233;sentation est faite avec des r&#232;gles de
r&#233;solution des cor&#233;f&#233;rences. Celles-ci permettent de r&#233;soudre les anaphores pronominales (he,
she, they et them). L&#8217;&#233;valuation de notre module a &#233;t&#233; r&#233;alis&#233;e avec 21 nouvelles d&#233;p&#234;ches de
l&#8217;&#233;pid&#233;mie du SARS. Dans l&#8217;avenir, il sera utile de tester notre syst&#232;me d&#8217;extraction d&#8217;infor-
mation sur des d&#233;p&#234;ches concernant d&#8217;autres &#233;pid&#233;mie pour savoir quelle adaptation &#224; apporter
aux diff&#233;rentes t&#226;ches de ce syst&#232;me afin de renforcer la robustesse de notre SEI.
</p>
<p>R&#233;f&#233;rences
ABERDEEN J., BURGER J., DAY D., HIRSCHMAN L., ROBINSON P. &amp; VILAIN M. (1995).
MITRE : description of the Alembic system used for MUC-6. In MUC6 &#8217;95, p. 141&#8211;155,
Morristown, NJ, USA : Association for Computational Linguistics.
BIBER D. (1993). Using register-diversified corpora for general language studies. Comput.
Linguist., 19(2), 219&#8211;241.
CHAUDET H. (2004). STEEL : A spatio-temporal extended event language for tracking epi-
demic spread from outbreak reports. In KR-MED, p. 21&#8211;30.
COLLIER N., NOBATA C. &amp; TSUJII J. (2000). Extracting the names of genes and gene pro-
ducts with a hidden Markov model. In Proceedings of the 18th conference on Computational
linguistics, p. 201&#8211;207.
DAMIANOS L., WOHLEVER S., PONTE J., WILSON G., REEDER F., MCENTEE T., KOZIE-
ROK R., HIRSCHMAN L. &amp; DAY D. (2002). Real users, real data, real problems : the MiTAP
system for monitoring bio events. In HLT&#8217;02, p. 357&#8211;362, San Francisco, CA, USA : Morgan
Kaufmann Publishers Inc.
DAMIANOS L. E., WOHLEVER S., KOZIEROK R. &amp; PONTE J. M. (2003). MiTAP : A Case
Study of Integrated Knowledge Discovery Tools. In HICSS &#8217;03, p.&#732;69, Washington, DC, USA :
IEEE Computer Society.
DAMIANOS L. E., ZARRELLA G. &amp; HIRSCHMAN L. (2004). The MiTAP System for Moni-
toring Reports of Disease Outbreak. The MITRE Corporation.
EL-ZANT M., ROUX M. &amp; ROYAUT&#201; J. (2006). Units&#8217; elements of some event structures of
outbreaks report. In InSciT2006, p. 393&#8211;397.
FILLMORE C. J. (1968). The case for case. In E.BACH &amp; R. HARMS, Eds., Universals in
Linguistric Theory, p. 1&#8211;88.
GRISHMAN R. (1995). The NYU system for MUC-6 or where&#8217;s the syntax ? In MUC6 &#8217;95,
p. 167&#8211;175, Morristown, NJ, USA : Association for Computational Linguistics.
GRISHMAN R. (1997). Information Extraction : Techniques and Challenges. In SCIE &#8217;97, p.
10&#8211;27, London, UK : Springer-Verlag.
GRISHMAN R., HIRSCHMAN L. &amp; NHAN N. T. (1986). Discovery procedures for sublan-
guage selectional patterns : initial experiments. Comput. Linguist., 12(3), 205&#8211;215.
GRISHMAN R., HUTTUNEN S. &amp; YANGARBER R. (2002a). Information extraction for en-
hanced access to disease outbreak reports. Journal of Biomedical Informatics, 35(4), 236&#8211;246.
GRISHMAN R., HUTTUNEN S. &amp; YANGARBER R. (2002b). Real-time event extraction for
infectious disease outbreaks. In HLT &#8217;02, p. 366&#8211;369, San Francisco, CA, USA : Morgan
Kaufmann Publishers Inc.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Manal El Zant, Jean Royaut&#233;, Michel Roux
</p>
<p>HARRIS Z. (1968). Mathmatical Structures of Language. John Wiley Interscience Publishers.
HIRSCHMAN L., CONCEPCION K., DAMIANOS L., DAY D., DELMORE J., FERRO L.,
GRIFFITH J., HENDERSON J., KURTZ J., MANI I., MARDIS S., MCENTEE T., MILLER
K., NUNAN B., PONTE J., REEDER F., WELLNER B., WILSON G. &amp; YEH A. (2001). In-
tegrated Feasibility Experiment for Bio-Security : IFE-Bio a TIDES demonstration. In HLT
&#8217;01, p. 1&#8211;5, Morristown, NJ, USA : Association for Computational Linguistics.
HUMPHREYS K., GAIZAUSKAS R. &amp; CUNNINGHAM H. (2000). LaSIE Technical Specifica-
tions. Rapport interne, Department of Computer Science. University of Sheffield.
HUTTUNEN S., YANGARBER R. &amp; GRISHMAN R. (2002a). Complexity of Event Structure
in IE Scenarios. In Proceedings of the 19th international conference on Computational lin-
guistics, p. 1&#8211;7, Morristown, NJ, USA : Association for Computational Linguistics.
HUTTUNEN S., YANGARBER R. &amp; GRISHMAN R. (2002b). Diversity of Scenarios in Infor-
mation Extraction. In Third International Conference On Language Resources And Evalua-
tion, p. 1443&#8211;1450.
JACKENDOFF R. (1976). Toward an Explanatory Semantic Representation. Linguistic Inquiry,
7, 89&#8211;150.
KIPPER K., DANG H. T. &amp; PALMER M. (2000). Class-Based Construction of a Verb Lexicon.
In Proceedings of the Seventeenth National Conference on Artificial Intelligence and Twelfth
Conference on Innovative Applications of Artificial Intelligence, p. 691&#8211;696 : AAAI Press /
The MIT Press.
LEVIN B. (1993). English Verb Classes and Alternations. University of Chicago Press.
POIBEAU T. (2003). Extraction automatique d&#8217;information du texte brut au web s&#233;mantique.
Herm&#232;s.
SEARS J. A. &amp; CROSS S. E. (2001). The Integrated Feasibility Experiment (IFE) process. In
HLT &#8217;01, p. 1&#8211;5, Morristown, NJ, USA : Association for Computational Linguistics.
SEKINE S. &amp; ERIGUCHI Y. (2000). Japanese named entity extraction evaluation - analysis of
results. In COLING, p. 1106&#8211;1110.</p>

</div></div>
</body></html>