<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un sens logique pour les graphes s&#233;mantiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Un sens logique pour les graphes s&#233;mantiques
</p>
<p>Renaud Marlet
LaBRI / INRIA Bordeaux &#8211; Sud-Ouest
</p>
<p>renaud.marlet@inria.fr
</p>
<p>R&#233;sum&#233;. Nous discutons du sens des graphes s&#233;mantiques, notamment de ceux utilis&#233;s en
Th&#233;orie Sens-Texte. Nous leur donnons un sens pr&#233;cis, &#233;ventuellement sous-sp&#233;cifi&#233;, gr&#226;ce &#224;
une traduction simple vers une formule de Minimal Recursion Semantics qui couvre les cas de
pr&#233;dications multiples sur plusieurs entit&#233;s, de pr&#233;dication d&#8217;ordre sup&#233;rieur et de modalit&#233;s.
</p>
<p>Abstract. We discuss the meaning of semantic graphs, in particular of those used in
Meaning-Text Theory. We provide a precise, possibly underspecified, meaning to such graphs
through a simple translation into a Minimal Recursion Semantics formula. This translation co-
vers cases of multiple predications over several entities, higher order predication and modalities.
</p>
<p>Mots-cl&#233;s : Graphe s&#233;mantique, logique, quantification, Th&#233;orie Sens-Texte (TST).
Keywords: Semantic graph, logic, quantification, Meaning-Text Theory (MTT).
</p>
<p>1 Introduction
</p>
<p>Les processus d&#8217;analyse (du texte vers le sens) et de g&#233;n&#233;ration (du sens vers le texte), bien qu&#8217;a
priori &#171; simplement &#187; inverses l&#8217;un de l&#8217;autre, reposent g&#233;n&#233;ralement sur deux types diff&#233;rents
de repr&#233;sentation du sens, respectivement les formules logiques et les graphes s&#233;mantiques. Ces
deux visions dissemblables de la s&#233;mantique ont chacune des avantages et des inconv&#233;nients, et
plut&#244;t que de les opposer comme on le fait souvent, nous proposons de les articuler.
</p>
<p>Formules logiques. Dans la perspective de l&#8217;analyse de texte, la s&#233;mantique est l&#8217;informa-
tion que v&#233;hicule l&#8217;&#233;nonciation d&#8217;une phrase. Apr&#232;s cette &#233;nonciation, et abstraction faite des
diff&#233;rentes interpr&#233;tations possibles, on doit pouvoir distinguer deux sortes de mondes, ceux
qui sont compatibles avec la situation d&#233;crite, et ceux qui ne le sont pas. C&#8217;est la vision v&#233;ri-
conditionnelle de la s&#233;mantique, qui conduit &#224; en proposer des repr&#233;sentations sous forme de
formules logiques. Historiquement, un des moteurs du d&#233;veloppement de la logique a d&#8217;ailleurs
&#233;t&#233; de donner du sens au langage. Il n&#8217;est donc pas surprenant qu&#8217;elle soit aujourd&#8217;hui une cible
privil&#233;gi&#233;e pour l&#8217;analyse, dans la lign&#233;e notamment des travaux de Montague (1974).
Outre la &#171; force de frappe &#187; issue cette tradition s&#233;culaire, une s&#233;mantique repr&#233;sent&#233;e sous
forme logique a plusieurs avantages. En premier lieu, le sens est totalement formalis&#233; : toute
logique qui se respecte a une interpr&#233;tation en terme de th&#233;orie des mod&#232;les, qui d&#233;crit sans &#233;qui-
voque les conditions de v&#233;rit&#233; d&#8217;une formule. En outre, une logique permet de raisonner sur le
sens d&#8217;un &#233;nonc&#233;, notamment en faisant des inf&#233;rences, t&#226;che plus ou moins automatisable sui-
vant la logique. Pour rendre compte d&#8217;une certaine gamme d&#8217;ambigu&#239;t&#233;s de la langue naturelle,
certains formalismes permettent &#233;galement d&#8217;&#233;crire des structures logiques sous-sp&#233;cifi&#233;es, qui
repr&#233;sentent plusieurs formules de sens diff&#233;rent par un m&#234;me terme, compact, factoris&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Renaud Marlet
</p>
<p>Mais les formules logiques, et leur emploi habituel, ont &#233;galement des inconv&#233;nients. Tout
d&#8217;abord, il est relativement difficile d&#8217;en construire des paraphrases simples, naturelles. L&#8217;inver-
sion des algorithmes d&#8217;analyses conduit souvent &#224; des probl&#232;mes complexes ou ind&#233;cidables,
ce qui r&#233;duit notablement l&#8217;usage d&#8217;une telle repr&#233;sentation comme base pour la g&#233;n&#233;ration de
texte1. Les formules logiques ne se pr&#234;tent pas bien non plus &#224; l&#8217;ajout d&#8217;informations concer-
nant une intention communicative, comme par exemple la th&#233;maticit&#233;. D&#8217;autre part, l&#8217;invariant
privil&#233;gi&#233; d&#8217;une repr&#233;sentation logique est sa valeur de v&#233;rit&#233; : deux formules sont &#233;quivalentes
si elles &#233;tablissent une m&#234;me partition du monde. Ce traitement extensionnel contribue &#224; gom-
mer toute connotation dans la repr&#233;sentation sens, ce qui est un handicap par exemple pour
des applications de traduction. Il est ainsi &#233;quivalent de dire &#171; hier c&#8217;&#233;tait samedi &#187; ou &#171; demain
&#231;a sera lundi &#187;. La logique s&#8217;inscrit plus g&#233;n&#233;ralement dans une tradition &#224; vis&#233;e relativement
universaliste2, qui ne cohabite pas toujours bien avec les nuances de la langue. Par ailleurs,
une formule logique ne permet pas de repr&#233;senter une phrase qui renferme une contradiction3,
ce qui est une limitation f&#226;cheuse pour les humains que nous sommes. Enfin, il n&#8217;est pas pos-
sible de reconna&#238;tre dans une formule logique les fragments qui correspondent aux &#233;ventuelles
pr&#233;suppositions de la phrase analys&#233;e, pour les distinguer de la proposition principale.
</p>
<p>Graphes s&#233;mantiques. Pour la g&#233;n&#233;ration de texte, la s&#233;mantique est donn&#233;e et l&#8217;on cherche &#224;
l&#8217;exprimer avec la langue, par une de ses paraphrases possibles (quasi-synonymes). La repr&#233;sen-
tation choisie comme point de d&#233;part de ce processus est souvent celle d&#8217;un graphe pr&#233;dicatif,
qui exprime des relations s&#233;mantiques entre entit&#233;s. C&#8217;est notamment dans le cadre de la Th&#233;o-
rie Sens-Texte (TST) que s&#8217;est d&#233;velopp&#233; cet usage des graphes s&#233;mantiques (Polgu&#232;re, 1990).
On comprend bien qu&#8217;ils soient donc consid&#233;r&#233;s comme bien adapt&#233;s pour la g&#233;n&#233;ration.
</p>
<p>Les graphes s&#233;mantiques, ainsi que la tradition qui les accompagne, ont &#233;galement un certain
nombre d&#8217;avantages. Tout d&#8217;abord, leur invariant privil&#233;gi&#233; est la paraphrase, pas la valeur de
v&#233;rit&#233;. De ce fait, ils se pr&#234;tent moins &#224; la substitution qu&#8217;en logique ; on fait naturellement la
diff&#233;rence entre &#171; hier c&#8217;&#233;tait samedi &#187; et &#171; demain &#231;a sera lundi &#187;.4 De surcro&#238;t, les graphes s&#233;-
mantiques supportent ais&#233;ment des &#233;nonc&#233;s contradictoires parce qu&#8217;ils ne se pr&#233;occupent pas
de l&#8217;existence effective de mondes correspondants. Par ailleurs, un graphe s&#233;mantique est un
bon substrat pour ajouter des informations suppl&#233;mentaires concernant les intentions commu-
nicatives. Bien que peu trait&#233;e, la question du partage et de la sous-sp&#233;cification se r&#233;sout bien
aussi sur les graphes. Enfin, on peut reconna&#238;tre des pr&#233;suppositions sur un graphe s&#233;mantique.
</p>
<p>Cette repr&#233;sentation de la s&#233;mantique a &#233;galement des d&#233;savantages. En particulier, elle ne
se pr&#234;te pas bien au raisonnement.5 Mais l&#8217;inconv&#233;nient le plus regrettable selon nous, c&#8217;est
l&#8217;absence de d&#233;finition formelle du sens d&#8217;un graphe s&#233;mantique. Au mieux, son sens est d&#233;crit
par l&#8217;ensemble des paraphrases qu&#8217;un syst&#232;me de g&#233;n&#233;ration de texte donn&#233; est capable de
produire. C&#8217;est un des objectifs de cet article que de tenter de rem&#233;dier &#224; cette lacune.
R&#233;conciliation. Nous voulons r&#233;concilier ces deux visions, et notamment tenter de dire en
quoi un graphe s&#233;mantique repr&#233;sente aussi une (ou plusieurs) situation du monde. Plus pr&#233;cis&#233;-
ment, nous voulons construire une passerelle des graphes s&#233;mantiques vers des repr&#233;sentations
</p>
<p>1Les r&#233;sultats r&#233;cents de Kanazawa (2007) pourraient n&#233;anmoins am&#233;liorer cette situation.
2Peut-&#234;tre est-elle incit&#233;e &#224; cela par l&#8217;existence de connecteurs et quantificateurs ind&#233;pendants de toute langue.
3Les logiques d&#233;faisables admettent toutefois des inf&#233;rences non monotones qui contredisent les pr&#233;c&#233;dentes.
4Cette attention pour la connotation se r&#233;v&#232;le aussi dans les th&#233;ories et les pratiques, qui con&#231;oivent souvent la
</p>
<p>repr&#233;sentation s&#233;mantique comme sp&#233;cifique &#224; une langue, port&#233;e par les seuls pr&#233;dicats et leurs mises en relation.
5&#192; notre connaissance, les seules d&#233;ductions &#171; disponibles &#187; sont les op&#233;rations de d&#233;composition (par ex.,
</p>
<p>remplacer la relation simple &#8216;X tuer Y&#8217; par la relation complexe, non atomique, &#8216;X cause la mort de Y&#8217;) et les
r&#233;&#233;critures locales sur la base de propri&#233;t&#233;s d&#8217;hyperonymie et d&#8217;hyponymie (comme on en trouve dans WordNet).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un sens logique pour les graphes s&#233;mantiques
</p>
<p>logiques. En effet, plut&#244;t que d&#8217;&#233;quiper une logique avec les informations qui lui font d&#233;faut,
op&#233;ration lourde et peu &#233;l&#233;gante, il nous semble plus appropri&#233; de partir de l&#8217;information la plus
riche et la plus souple car en quelque sorte sous-interpr&#233;t&#233;e (les graphes s&#233;mantiques), et de la
projeter sur une information plus pauvre et plus rigide car plus tranch&#233;e (les formules logiques),
mais plus &#224; m&#234;me de faire toute une gamme de traitements, notamment de l&#8217;inf&#233;rence.
</p>
<p>Muni de cette correspondance, on peut ensuite d&#233;cider d&#8217;utiliser les graphes s&#233;mantiques &#224; la
fois pour la g&#233;n&#233;ration et l&#8217;analyse de texte ; et s&#8217;il est n&#233;cessaire de raisonner sur le sens, alors
le graphe peut &#234;tre au pr&#233;alable transform&#233; en une formule logique. En pratique, l&#8217;ambigu&#239;t&#233; de
la langue appelle en outre &#224; travailler sur des graphes et des structures logiques sous-sp&#233;cifi&#233;es.
</p>
<p>Application au TAL. Cette perspective d&#8217;une m&#234;me repr&#233;sentation du sens pour les op&#233;rations
inverses d&#8217;analyse et de g&#233;n&#233;ration est plus satisfaisante sur un plan, disons, th&#233;orique. Mais elle
apporte &#233;galement un certain nombre d&#8217;avantages pratiques pour le TAL.
</p>
<p>En effet, il devient alors plus facile d&#8217;appairer un syst&#232;me d&#8217;analyse et un syst&#232;me de g&#233;n&#233;ration
afin de v&#233;rifier que leur composition (modulo interpr&#233;tations et paraphrases multiples) contient
l&#8217;identit&#233;. Cela permet par exemple de rechercher des d&#233;ficiences dans l&#8217;un ou l&#8217;autre syst&#232;me,
et de mettre en place plus simplement des tests de non r&#233;gression.
</p>
<p>Mais surtout, cela facilite le processus ordinaire de l&#8217;analyse (texte vers logique) : le graphe
s&#233;mantique joue alors le simple r&#244;le de structure de donn&#233;es interm&#233;diaire entre texte et sens,
au m&#234;me titre que la structure syntaxique. Cela permet d&#8217;&#233;tager la prise en compte de certains
ph&#233;nom&#232;nes de langue qui, sinon, doivent &#234;tre trait&#233;s &#171; au vol &#187; au cours de la traduction entre
structure syntaxique et formule logique. Les graphes s&#233;mantiques font par exemple abstraction
de diff&#233;rentes formes de diath&#232;se et d&#8217;alternance dative (dative shifts). Ils rendent &#233;galement ex-
plicites l&#8217;ellipse, la structure argumentale des constructions avec verbes &#224; contr&#244;le ou &#224; mont&#233;e,
et donnent une vision de la phrase o&#249; les anaphores ont &#233;t&#233; r&#233;solues. Ils peuvent de plus &#234;tre
&#233;quip&#233;s d&#8217;une information compl&#233;mentaire de restriction et de port&#233;e pour les quantificateurs,
qui simplifie aussi le passage &#224; une formule logique. De m&#234;me, l&#8217;extraction de pr&#233;suppositions
est plus facile sur un graphe s&#233;mantique que sur une structure syntaxique, de plus bas niveau.
</p>
<p>L&#8217;id&#233;e d&#8217;utiliser une information plus riche que la seule constituance ou d&#233;pendance syntaxique
pour construire une formule logique n&#8217;est pas neuve. On la retrouve par exemple dans plusieurs
travaux bas&#233;s sur LFG (Dalrymple, 2001) 6. Debusmann, Duchier et al. (2004) font de m&#234;me
au dessus de XDG, avec un d&#233;coupage plus vertical de l&#8217;information. Mais c&#8217;est peut-&#234;tre dans
les travaux de Lesmo, Robaldo et al. (2007) qu&#8217;un graphe s&#233;mantique est le plus vu comme une
simple structure interm&#233;diaire pour la construction d&#8217;une repr&#233;sentation logique.
</p>
<p>De plus, bon nombre de syst&#232;mes de traduction automatique utilisent un graphe s&#233;mantique
comme pivot ou point de passage le plus &#233;lev&#233; vers une autre langue. Si l&#8217;on peut r&#233;utiliser la
composante d&#8217;analyse s&#233;mantique d&#8217;un de ces syst&#232;mes, on peut alors construire un analyseur
logique &#224; peu de frais, par combinaison avec une projection vers des formules logiques.
Contributions.
&#8211; Nous caract&#233;risons les impr&#233;cisions de repr&#233;sentation du sens avec des graphes s&#233;mantiques.
&#8211; Nous d&#233;crivons comment appareiller un graphe s&#233;mantique pour qu&#8217;il repr&#233;sente des op&#233;ra-
</p>
<p>teurs avec port&#233;e, et notamment des quantificateurs.
&#8211; Nous d&#233;finissons une transformation simple d&#8217;un graphe s&#233;mantique ainsi appareill&#233; vers une
</p>
<p>6Une des motivations derri&#232;re les travaux d&#233;crits ici est d&#8217;ailleurs la construction d&#8217;un analyseur s&#233;mantique
pour le fran&#231;ais bas&#233; sur une analyse syntaxique &#224; la LFG suivie d&#8217;une transformation vers un graphe s&#233;mantique
&#224; la TST (travaux en cours avec Lionel Cl&#233;ment et Kim Gerdes).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Renaud Marlet
</p>
<p>structure logique de Minimal Recursion Semantics (MRS) (Copestake et al., 2005), ce qui
d&#233;finit formellement le sens du graphe. Les interpr&#233;tations sont moins nombreuses que dans
les travaux de Robaldo (2007) car nous ne mod&#233;lisons pas de quantificateurs ramifi&#233;s, mais
en revanche elles peuvent &#234;tre utilis&#233;es dans de simples solveurs de logique du premier ordre.
</p>
<p>&#8211; Notre traduction couvre les cas de pr&#233;dications multiples sur plusieurs entit&#233;s, de pr&#233;dication
d&#8217;ordre sup&#233;rieur et de modalit&#233;s, qui, &#224; notre connaissance, n&#8217;avaient pas encore &#233;t&#233; trait&#233;s.
</p>
<p>Nous pr&#233;cisons &#224; la section 2 ce que nous entendons par graphe s&#233;mantique. La section 3 discute
informellement de leur sens situationnel. La section 4 en formalise la traduction vers la MRS.
</p>
<p>2 Graphes pr&#233;dicatifs
</p>
<p>Le terme de &#171; graphe s&#233;mantique &#187; peut d&#233;signer des objets tr&#232;s divers (graphes conceptuels,
r&#233;seaux s&#233;mantiques, etc.) sans liens avec notre propos. Pour &#234;tre plus pr&#233;cis dans la suite, nous
pr&#233;f&#233;rons employer le terme de graphe pr&#233;dicatif. Nous en donnons une d&#233;finition (syntaxique)
dans cette section. Si notre terminologie s&#8217;appuie en grande partie sur celle de la TST, notre
proposition n&#8217;impose toutefois pas d&#8217;en admettre les hypoth&#232;ses th&#233;oriques.
</p>
<p>Nous consid&#233;rons des graphes s&#233;mantiques qui mettent en relation pr&#233;dicative un ensemble
d&#8217;entit&#233;s. Ces graphes sont construits sur le vocabulaire suivant :
&#8211; un ensemble de symboles appel&#233;s pr&#233;dicats. Un pr&#233;dicat p repr&#233;sente une relation d&#8217;arit&#233;
</p>
<p>finie, &#233;ventuellement nulle. Les arguments de cette relation sont ses actants.
&#8211; un ensemble de symboles de relations actantielles. Sans perte de g&#233;n&#233;ralit&#233;, nous identifions
</p>
<p>les relations actantielles d&#8217;un pr&#233;dicat par leur position argumentale dans la relation associ&#233;e
(le premier argument ayant la position 1).
</p>
<p>Un graphe pr&#233;dicatif est un graphe dirig&#233; constitu&#233; de :
&#8211; un ensemble non vide de n&#339;uds tel que chaque n&#339;ud u est &#233;tiquet&#233; par un pr&#233;dicat p.
&#8211; un ensemble d&#8217;arcs orient&#233;s tel que tout n&#339;ud u, &#233;tiquet&#233; par un pr&#233;dicat p d&#8217;arit&#233; n, a exac-
</p>
<p>tement n arcs sortants, &#233;tiquet&#233;s de 1 &#224; n, dirig&#233;s vers chacun des actants de p.
Autrement dit, un graphe pr&#233;dicatif est un r&#233;seau d&#8217;applications totales de relations. En l&#8217;ab-
sence de cycle, il peut &#234;tre d&#233;fini inductivement par applications successives de pr&#233;dicats.
</p>
<p>Dans un Mod&#232;le Sens-Texte (MST), un graphe pr&#233;dicatif est appel&#233; structure pr&#233;dicative ou
structure s&#233;mantique (not&#233;e SemS). Il repr&#233;sente le sens d&#8217;une famille d&#8217;&#233;nonc&#233;s plus ou moins
synonymes. Dans la mesure o&#249; une structure pr&#233;dicative est destin&#233;e &#224; &#234;tre verbalis&#233;e en une
unique phrase, le graphe est g&#233;n&#233;ralement connect&#233;7. Il est aussi souvent acyclique (DAG), mais
ce n&#8217;est pas n&#233;cessairement le cas8. Les pr&#233;dicats utilis&#233;s dans un MST sont appel&#233;s pr&#233;dicats
s&#233;mantiques ou s&#233;mant&#232;mes. Les arguments des s&#233;mant&#232;mes sont appel&#233;s actants s&#233;mantiques.
Les s&#233;mant&#232;mes sans argument sont appel&#233;s noms s&#233;mantiques ou objets s&#233;mantiques. Les
s&#233;mant&#232;mes sont plus pr&#233;cis&#233;ment des unit&#233;s s&#233;mantiques9 sp&#233;cifiques &#224; une langue qui cor-
respondent &#224; un sens particulier, d&#233;sambigu&#239;s&#233;, d&#8217;une unit&#233; lexicale (lex&#232;me ou phras&#232;me)10.
Les s&#233;mant&#232;mes sont not&#233;s entre apostrophes11. Par exemple, &#8216;loup&#8217; est un s&#233;mant&#232;me sans ar-
gument (un objet s&#233;mantique) ; &#8216;dormir&#8217; est un s&#233;mant&#232;me &#224; un argument (l&#8217;&#234;tre qui dort). Un
exemple de structure pr&#233;dicative est donn&#233; &#224; la figure 1.
</p>
<p>7On pourrait n&#233;anmoins imaginer un graphe d&#233;connect&#233; correspondant &#224; &#171; Pierre dort, Marie chante &#187;.
8Le graphe peut &#234;tre cyclique &#224; cause de pronoms, comme dans &#171; Pierre regarde Marie, qui le regarde &#187;.
9Les s&#233;mant&#232;mes que nous consid&#233;rons n&#8217;ont pas &#224; &#234;tre des unit&#233;s irr&#233;ductibles (primitives) ou universelles.
</p>
<p>10Certains s&#233;mant&#232;mes peuvent aussi repr&#233;senter des sens de gramm&#232;mes (Polgu&#232;re, 1990).
11Nous omettons ici les marques additionnelles qui identifient le choix de sens d&#8217;une unit&#233; lexicale ambigu&#235;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un sens logique pour les graphes s&#233;mantiques
</p>
<p>3 Sens situationnel
</p>
<p>Selon Mel&#8217;c&#780;uk (2001), une structure pr&#233;dicative a pour but de repr&#233;senter exclusivement le sens
propositionnel, ou situationnel, d&#8217;une famille d&#8217;&#233;nonc&#233;s plus ou moins synonymes. Elle est le
miroir d&#8217;une situation, d&#8217;un &#233;tat des choses dans un monde r&#233;el ou imaginaire (qui peut inclure
le locuteur). En pratique, en TST, ce sens ne se r&#233;v&#232;le qu&#8217;&#224; travers les paraphrases qu&#8217;il autorise.
Nous prenons ce programme &#224; la lettre, mais dans une vision &#171; th&#233;orie des mod&#232;les &#187; des
choses : &#224; toute situation doit correspondre une fonction de valuation qui assigne une valeur
de v&#233;rit&#233; &#224; toute structure pr&#233;dicative. R&#233;ciproquement, &#224; toute structure pr&#233;dicative doit cor-
respondre une fonction de valuation qui assigne une valeur de v&#233;rit&#233; &#224; toute situation, distin-
guant ainsi les situations compatibles avec la structure pr&#233;dicative, de celles qui ne le sont pas.
C&#8217;est cette derni&#232;re fonction de valuation que nous appelons sens situationnel d&#8217;une structure
pr&#233;dicative. Nous examinons dans cette section des cas o&#249; ce sens situationnel est mal d&#233;fini.
</p>
<p>Restriction et apposition. La structure pr&#233;dicative ne distingue pas restriction (caract&#233;risation
d&#8217;une entit&#233;) et apposition (commentaire sur une entit&#233;). Cette lacune est illustr&#233;e par le graphe
</p>
<p>1
</p>
<p>&#8216;loup&#8217; &#8216;Pierre&#8217;
</p>
<p>1
1 2
</p>
<p>&#8216;regarder&#8217;&#8216;le&#8217;&#8216;m&#233;chant&#8217;
</p>
<p>FIG. 1 &#8211; Pierre et le loup
</p>
<p>de la figure 1, dont certaines paraphrases correspondent &#224; des situations diff&#233;rentes :
</p>
<p>(1) a. (pas le gentil loup)Le m&#233;chant loup regarde Pierre.
b. (pas celui qui regarde Marie)Le loup qui regarde Pierre est m&#233;chant.
c. (pas le renard)Le loup, qui est m&#233;chant, regarde Pierre.
</p>
<p>Le d&#233;terminant appelle l&#8217;identification d&#8217;un loup particulier dans le contexte, mais cette iden-
tification est impr&#233;cise si l&#8217;on ne sp&#233;cifie pas une lecture particuli&#232;re du graphe : on ne sait si
les fl&#232;ches sont &#224; comprendre comme des relations conjointes (au sens de la restriction, comme
dans les cas 1a et 1b), ou bien s&#233;par&#233;es (apposition non restrictive, comme dans le cas 1c).
Pour distinguer ces sens, Kahane et Mel&#8217;c&#780;uk (1999) utilisent une information additionnelle
de th&#233;maticit&#233;, information compl&#233;mentaire au graphe s&#233;mantique et stock&#233;e dans la structure
communicative (Mel&#8217;c&#780;uk, 2001). Nous pensons que cela pose deux probl&#232;mes. D&#8217;une part, cela
utilise la structure communicative, qui est cens&#233;e refl&#233;ter la mani&#232;re d&#8217;exprimer une chose plut&#244;t
que le fond de la chose elle-m&#234;me. D&#8217;autre part, cela n&#233;cessite l&#8217;embo&#238;tement de structures
th&#232;me/rh&#232;me. Or une th&#233;matisation secondaire embo&#238;t&#233;e &#224; l&#8217;int&#233;rieur d&#8217;un th&#232;me primaire ne
correspond pas aux significations et crit&#232;res ordinaires associ&#233;s aux notions de th&#232;me et rh&#232;me.
Notre proposition pour r&#233;soudre ce probl&#232;me est li&#233;e &#224; celui de la quantification, qui suit.
</p>
<p>Quantification. Les quantificateurs et leur port&#233;e sont une autre information qui fait d&#233;faut
dans la structure pr&#233;dicative. Cette question est illustr&#233;e par le graphe de la figure 2. Ce graphe
admet, entre autres, les paraphrases suivantes, chacune suivie de son sens en termes logiques.
</p>
<p>(2) a. Chaque m&#233;chant loup regarde un quelconque chaperon rouge.
b. &#8704;x (loup(x) &#8743;me&#769;chant(x)) &#8594; (&#8707;y chaperon(y) &#8743; rouge(y) &#8743; regarder(x, y))</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Renaud Marlet
</p>
<p>2
</p>
<p>&#8216;chaque&#8217;
</p>
<p>&#8216;loup&#8217;
</p>
<p>&#8216;regarde&#8217;
</p>
<p>1
</p>
<p>&#8216;chaperon&#8217;
</p>
<p>&#8216;un&#8217;
</p>
<p>&#8216;m&#233;chant&#8217; &#8216;rouge&#8217;
1
</p>
<p>1 1
1
</p>
<p>FIG. 2 &#8211; Une histoire de m&#233;chants loups et de chaperon(s) rouge(s)
</p>
<p>c. Un certain chaperon rouge est regard&#233; par chaque m&#233;chant loup.
d. &#8707;y chaperon(y) &#8743; rouge(y) &#8743; (&#8704;x (loup(x) &#8743;me&#769;chant(x)) &#8594; regarder(x, y))
</p>
<p>Les paraphrases (2a) et (2c) renvoient &#224; des situations diff&#233;rentes. Cela correspond &#224; un cas
classique d&#8217;ambigu&#239;t&#233; de port&#233;e de quantificateurs, comme pour interpr&#233;ter la phrase suivante.
</p>
<p>(2) e. Chaque m&#233;chant loup regarde un chaperon rouge.
Des formulations dont l&#8217;ambigu&#239;t&#233; est ma&#238;tris&#233;e sont n&#233;anmoins souhaitables pour construire
des repr&#233;sentations sous-sp&#233;cifi&#233;es. Mais le cas des graphes s&#233;mantiques a moins &#233;t&#233; &#233;tudi&#233;.
</p>
<p>Dymetman et Copperman (1996) ont des repr&#233;sentations s&#233;mantiques qui sont des arbres, cas
particuliers de graphes. La structure d&#8217;arbre encode naturellement la restriction d&#8217;un quantifi-
cateur. Un sens pr&#233;cis est donn&#233; &#224; une repr&#233;sentation s&#233;mantique (via un calcul compositionnel
&#224; la Montague), mais qui ne permet pas de traiter les cas de &#171; circuits &#187;, comme par exemple :
</p>
<p>(3) a. Le loup qui regarde le chaperon dont il a mang&#233; la grand-m&#232;re est m&#233;chant.
b. Le loup qui a mang&#233; la grand-m&#232;re du chaperon qu&#8217;il regarde est m&#233;chant.
</p>
<p>Polgu&#232;re (1997) propose que les quantificateurs soient repr&#233;sent&#233;s par des foncteurs binaires,
le premier argument renvoyant au s&#233;mant&#232;me de l&#8217;entit&#233; quantifi&#233;e, le second &#224; un sous-r&#233;seau
(incluant ce s&#233;mant&#232;me) qui repr&#233;sente toute la port&#233;e du quantificateur. L&#8217;embo&#238;tement des
port&#233;es des quantificateurs traduit l&#8217;ordre choisi. Mais cette proposition ne convient pas dans le
cas o&#249; l&#8217;entit&#233; quantifi&#233; est qualifi&#233;e (comme &#8216;loup&#8217; par &#8216;m&#233;chant&#8217; dans la figure 2) car l&#8217;infor-
mation de restriction fait d&#233;faut. Cela pourrait conduire par exemple &#224; l&#8217;interpr&#233;tation suivante.
</p>
<p>(4) a. Chaque loup est m&#233;chant et regarde un quelconque chaperon, qui est rouge.
b. &#8704;x loup(x) &#8594; me&#769;chant(x) &#8743; (&#8707;y chaperon(y) &#8743; rouge(y) &#8743; regarder(x, y))
</p>
<p>Kahane (2005) propose quant &#224; lui de superposer aux relations pr&#233;dicatives, qui repr&#233;sentent
des d&#233;pendances s&#233;mantiques, un second r&#233;seau qui repr&#233;sente les d&#233;pendances logiques. Il ne
formalise toutefois pas l&#8217;interpr&#233;tation d&#8217;un tel r&#233;seau et sa traduction en une formule logique.
</p>
<p>Robaldo (2007) fournit une solution satisfaisante au probl&#232;me en choisissant de repr&#233;senter
d&#8217;une part la restriction (et non la port&#233;e) associ&#233;e &#224; un quantificateur, et d&#8217;autre part les d&#233;-
pendances de port&#233;e entre les seuls quantificateurs. Sa proposition est relativement compl&#232;te :
elle permet la sous-sp&#233;cification (il suffit de ne pas mentionner certaines d&#233;pendances), le trai-
tement de la quantification ramifi&#233;e12, et les quantificateurs g&#233;n&#233;ralis&#233;s mostowskiens &#224; deux
places (pour repr&#233;senter des quantificateurs comme &#8216;la plupart de&#8217; ou &#8217;peu de&#8217;). N&#233;anmoins,
</p>
<p>12Sans quantification ramifi&#233;e, on est oblig&#233; de fixer un ordre lin&#233;aire entre les quantificateurs lorsqu&#8217;on &#233;num&#232;re
les sens. Par exemple, en ce cas, la phrase &#171; trois loups regardent deux chaperons &#187; n&#8217;a que deux sens : (a) il existe
exactement 3 loups et chacun regarde 2 chaperons quelconques ou (b) il existe exactement 2 chaperons et chacun
peut &#234;tre regard&#233;s par 3 loups quelconques. Avec quantification ramifi&#233;e, l&#8217;ordre entre les quantificateurs n&#8217;est pas
impos&#233; et il y a un autre lecture : (c) il existe exactement 2 chaperons et exactement 3 loups qui les regardent.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un sens logique pour les graphes s&#233;mantiques
</p>
<p>cette proposition met en &#339;uvre une logique relativement complexe et des algorithmes &#233;gale-
ment complexes de traduction d&#8217;un graphe pr&#233;dicatif quantifi&#233; dans cette logique. De plus, le
raisonnement automatique avec les formules logiques produites n&#233;cessite un solveur pour la
logique du second ordre. Robaldo ne d&#233;crit pas non plus le traitement cas de pr&#233;dications mul-
tiples sur plusieurs entit&#233;s, de pr&#233;dication d&#8217;ordre sup&#233;rieur et de modalit&#233;s.
</p>
<p>4 Traduction en Minimal Recursion Semantic
</p>
<p>Dans la suite de ce document, nous reprenons les id&#233;es de Robaldo pour repr&#233;senter la restriction
et les d&#233;pendances de port&#233;e entre quantificateurs. Mais nous donnons une traduction simple et
directe vers un formalisme logique, celui de la MRS. Notre traduction est plus riche que celle
de Robaldo en ce qui concerne le type de graphes trait&#233;. Elle perd les lectures de quantification
ramifi&#233;e mais conserve la repr&#233;sentation de formes sous-sp&#233;cifi&#233;es et permet un raisonnement
sur le sens situationnel avec un simple solveur pour la logique du premier ordre.
</p>
<p>Graphe pr&#233;dicatif quantifi&#233;. Une restriction pour un graphe pr&#233;dicatif est une fonction par-
tielle r sur les n&#339;uds du graphe qui, &#224; un n&#339;ud u, fait correspondre les n&#339;uds des pr&#233;dicats
qui qualifient l&#8217;entit&#233; repr&#233;sent&#233;e par u. Plus pr&#233;cis&#233;ment, pour tout n&#339;ud u du domaine de r,
la restriction r(u) est un sous-ensemble des n&#339;uds du graphe &#233;gaux &#224; u ou qui ont u comme
actant. On note aussi ru = r(u). Une restriction est bien form&#233;e ssi son domaine inclut tous les
actants du graphe et si les restrictions individuelles de chaque n&#339;ud sont disjointes deux &#224; deux.
Un graphe pr&#233;dicatif est quantifi&#233; si certaines &#233;tiquettes de n&#339;uds sont des quantificateurs, pr&#233;-
dicats unaires particuliers. Un n&#339;ud u de quantificateur quantifie un n&#339;ud v ssi v est un actant
de u (en fait, l&#8217;unique, puisque le pr&#233;dicat est unaire). Un graphe pr&#233;dicatif quantifi&#233; est bien
form&#233; ssi tout n&#339;ud est l&#8217;actant d&#8217;au plus un quantificateur et si les quantificateurs ne sont pas
eux-m&#234;mes quantifi&#233;s. De plus, &#224; tout n&#339;ud u d&#8217;un graphe pr&#233;dicatif, on associe une variable
de pr&#233;dication xu. On note aussi rxu = ru. On appelle variable de quantification la variable de
pr&#233;dication de l&#8217;actant d&#8217;un n&#339;ud de quantificateur. Comme chez Robaldo (2007), un pr&#233;ordre
partiel&#8826; suppl&#233;mentaire peut &#234;tre en outre fourni sur les quantificateurs, ou de mani&#232;re &#233;quiva-
lente, sur les variables de quantification, pour exprimer les d&#233;pendances de quantification.
</p>
<p>Dans un esprit davidsonien, nous allons construire des pr&#233;dications dont l&#8217;arit&#233; peut &#234;tre un
de plus que celle du pr&#233;dicat correspondant. Cela permet de construire des pr&#233;dications d&#8217;ordre
sup&#233;rieur tout en restant au premier ordre. L&#8217;argument suppl&#233;mentaire est une variable de pr&#233;di-
cation, quantifi&#233;e existentiellement par d&#233;faut. N&#233;anmoins, afin d&#8217;all&#233;ger les formules produites,
nous n&#8217;introduisons cet argument suppl&#233;mentaire que lorsque le pr&#233;dicat est lui-m&#234;me actant.
Alternativement, on peut pr&#233;f&#233;rer ne pas introduire de quantificateurs par d&#233;faut et ne lier les
variables correspondantes que par des quantifications existentielles suppl&#233;mentaires, externes.
</p>
<p>Structure MRS. Une structure de MRS est un triplet (G, R, C) tel que :
&#8211; G est une variable de port&#233;e, qualifi&#233;e de sommet global (global top) de la structure.
&#8211; R est un ensemble fini de pr&#233;dications &#233;l&#233;mentaires, de la forme h : p(x1, . . . , xn) dans le
</p>
<p>cas de pr&#233;dicats s&#233;mantiques (o&#249; h est une variable de port&#233;e), et de la forme h : q(x, h&#8242;, h&#8242;&#8242;)
pour des quantificateurs (o&#249; h&#8242; est d&#233;signe la restriction et h&#8242;&#8242; le corps de la quantification).
</p>
<p>&#8211; C est un ensemble fini de contraintes de port&#233;e de la forme h1 =q h2, ce qui signifie soit
que h1 est &#233;gal &#224; h2, soit que h1 est &#233;gal &#224; l&#8217;&#233;tiquette h d&#8217;une pr&#233;dication &#233;l&#233;mentaire h :
q(x, h&#8242;, h&#8242;&#8242;) et que h&#8242;&#8242; =q h2. L&#8217;existence de plusieurs solutions &#224; ce syst&#232;me de contraintes
permet l&#8217;expression de formules sous-sp&#233;cifi&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Renaud Marlet
</p>
<p>Voir Copestake et al. (2005) pour une d&#233;finition compl&#232;te, notamment pour les contraintes de
bonne formation (liage des variables, etc.).
Traduction d&#8217;un graphe pr&#233;dicatif quantifi&#233;. La transformation d&#8217;un graphe pr&#233;dicatif quan-
tifi&#233; bien form&#233; en une structure MRS est d&#233;finie ainsi :
&#8211; Pour tout n&#339;ud u de pr&#233;dicat s&#233;mantique p sans port&#233;e et dont les actants sont v1, . . . , vn,
</p>
<p>&#8211; si u n&#8217;est l&#8217;actant d&#8217;aucun autre n&#339;ud, on construit une variable de port&#233;e hu ainsi que la
pr&#233;dication &#233;l&#233;mentaire hu : p(xv1 , . . . , xvn),
</p>
<p>&#8211; si u est l&#8217;actant d&#8217;au moins un autre n&#339;ud, on construit une variable de port&#233;e hu ainsi que
la pr&#233;dication &#233;l&#233;mentaire hu : p(xu, xv1 , . . . , xvn).
</p>
<p>&#8211; Pour tout n&#339;ud u qui repr&#233;sente un quantificateur q et qui a pour actant le n&#339;ud v, on construit
la pr&#233;dication &#233;l&#233;mentaire hu : q(xv, h&#8242;u, h&#8242;&#8242;u) ainsi que la contrainte h&#8242;u =q hv .
</p>
<p>&#8211; Pour tout n&#339;ud u quantifi&#233; par un n&#339;ud v et tout n&#339;ud w dans la restriction r(u) associ&#233;e
&#224; xu, on construit la contrainte hu =q hw.
</p>
<p>&#8211; Pour tout n&#339;ud u hors de la restriction de toute variable, on construit la contrainte G =q hu.
</p>
<p>ry
</p>
<p>&#8216;m&#233;chant&#8217; &#8216;rouge&#8217;
</p>
<p>1 1
</p>
<p>1 1
1 2
</p>
<p>x : &#8216;loup&#8217; y : &#8216;chaperon&#8217;
</p>
<p>&#8216;regarder&#8217;&#8216;chaque&#8217; &#8216;un&#8217;
</p>
<p>rx
</p>
<p>FIG. 3 &#8211; Tout loup qui regarde un chaperon rouge est m&#233;chant
</p>
<p>&#192; titre d&#8217;exemple, la structure pr&#233;dicative de la figure 3 se traduit ainsi en MRS :
</p>
<p>G,
</p>
<p>&#63729;&#63732;&#63732;&#63730;
&#63732;&#63732;&#63731;
</p>
<p>h1 : chaque(x, h2, h3), h6 : un(y, h7, h8),
h4 : loup(x), h9 : chaperon(y),
h5 : regarder(x, y), h10 : rouge(y),
</p>
<p>h11 : me&#769;chant(x)
</p>
<p>&#63740;&#63732;&#63732;&#63741;
&#63732;&#63732;&#63742;
</p>
<p>,
</p>
<p>&#63729;&#63730;
&#63731;
</p>
<p>h2 =q h4, h2 =q h5,
h7 =q h9, h7 =q h10,
G =q h11
</p>
<p>&#63740;&#63741;
&#63742;
</p>
<p>Cette structure MRS sous-sp&#233;cifi&#233;e admet deux structures &#224; port&#233;e r&#233;solue correspondant &#224; :
</p>
<p>(5) a. chaque(x, loup(x) &#8743; un(y, chaperon(y) &#8743; rouge(y), regarder(x, y)),me&#769;chant(x))
b. Tout loup qui regarde un quelconque chaperon rouge est m&#233;chant.
c. un(y, chaperon(y) &#8743; rouge(y), chaque(x, loup(x) &#8743; regarder(x, y),me&#769;chant(x)))
d. Tout loup qui regarde un certain chaperon rouge est m&#233;chant.
</p>
<p>Structure quantifi&#233;e pr&#233;ordonn&#233;e. Si les quantificateurs du graphe sont de plus partiellement
pr&#233;ordonn&#233;s par une relation de d&#233;pendance de quantification &#8826;, on applique la r&#232;gle suivante.
&#8211; Pour toute d&#233;pendance de quantification xu &#8826; xv (c.-&#224;-d. xv d&#233;pend de xu) entre les variables
</p>
<p>associ&#233;es &#224; des n&#339;uds quantifi&#233;s u et v, on construit la contrainte hu =q hv .
Par exemple, si l&#8217;on ajoute une relation de d&#233;pendance x &#8826; y au graphe pr&#233;dicatif de la figure 3,
on a la contrainte suppl&#233;mentaire suivante pour la structure MRS.
</p>
<p>G,
{
</p>
<p>. . .
}
</p>
<p>,
{
</p>
<p>. . . , h1 =q h6
}
</p>
<p>Seule la structure (5a) subsiste alors, c&#8217;est-&#224;-dire la lecture (5b) .
Modalit&#233;s. Pour traiter les modalit&#233;s, on proc&#232;de comme suit :
&#8211; Pour tout n&#339;ud u qui repr&#233;sente une modalit&#233; m avec port&#233;e, dont le fils est le n&#339;ud v, on
</p>
<p>construit la pr&#233;dication &#233;l&#233;mentaire hu : m(hv) et la contrainte hu =q hv.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un sens logique pour les graphes s&#233;mantiques
</p>
<p>Ainsi, si l&#8217;on ajoute &#224; la figure 3 le n&#339;ud &#8216;probablement&#8217; 1&#8722;&#8594; &#8216;m&#233;chant&#8217;, on a alors (en n&#8217;indi-
quant que les termes nouveaux) :
</p>
<p>G,
{
</p>
<p>. . . , h12 : probablement(h11)
}
</p>
<p>,
{
</p>
<p>. . . , h12 =q h11, G =q h12
}
</p>
<p>Dans le cas x &#8826; y, comme pr&#233;c&#233;demment, cette structure MRS reste sous-sp&#233;cifi&#233;e et admet
deux structures MRS &#224; port&#233;e r&#233;solue, repr&#233;sentables ainsi (o&#249; pbl abr&#232;ge probablement) :
</p>
<p>(6) a. pbl(chaque(x, loup(x) &#8743; un(y, chaperon(y) &#8743; rouge(y), regarder(x, y)),me&#769;chant(x)))
b. Il est probable que tout loup qui regarde un quelconque chaperon rouge est m&#233;chant.
c. chaque(x, loup(x) &#8743; un(y, chaperon(y) &#8743; rouge(y), regarder(x, y)), pbl(me&#769;chant(x)))
d. Tout loup qui regarde un quelconque chaperon rouge est probablement m&#233;chant.
</p>
<p>Pr&#233;dications multiples sur plusieurs entit&#233;s. Si l&#8217;on ajoute &#224; la figure 3 un n&#339;ud &#8216;fuir&#8217; tel
que &#8216;loup&#8217; 2&#8592;&#8722; &#8216;fuir&#8217; 1&#8722;&#8594; &#8216;chaperon&#8217;, et si ce n&#339;ud est plac&#233; dans la restriction rx, on a alors
(en n&#8217;indiquant que les termes nouveaux) :
</p>
<p>G,
{
</p>
<p>. . . , h12 : fuir(y, x)
}
</p>
<p>,
{
</p>
<p>. . . , h2 =q h12
}
</p>
<p>Les lectures sont celles des formules (5a) et (5c) en rempla&#231;ant regarder(x, y) par regarder(x, y)
&#8743; fuir(y, x). En revanche, si &#8216;fuir&#8217; est plac&#233; dans la restriction ry, on a :
</p>
<p>G,
{
</p>
<p>. . . , h12 : fuir(y, x)
}
</p>
<p>,
{
</p>
<p>. . . , h7 =q h12
}
</p>
<p>Et il n&#8217;y a qu&#8217;une lecture possible :
</p>
<p>(7) a. chaque(x, loup(x)&#8743;un(y, chaperon(y)&#8743;rouge(y)&#8743;fuir(y, x), regarder(x, y)),me&#769;chant(x))
b. Tout loup qui regarde un chaperon rouge qui le fuit est m&#233;chant.
</p>
<p>Pr&#233;dication d&#8217;ordre sup&#233;rieur. Consid&#233;rons le cas de la figure 4, qui comporte deux pr&#233;-
dications du second ordre, &#8216;tr&#232;s&#8217; et &#8216;inqui&#233;ter&#8217;, qui conduisent &#224; la cr&#233;ation de variables de
quantification suppl&#233;mentaires pour &#8216;m&#233;chant&#8217; et &#8216;regarder&#8217;. On a alors la traduction suivante
(avec quantification existentielle par d&#233;faut omise).
</p>
<p>ry
</p>
<p>&#8216;rouge&#8217;
</p>
<p>1
</p>
<p>1 1
1 2
</p>
<p>x : &#8216;loup&#8217; y : &#8216;chaperon&#8217;
</p>
<p>&#8216;chaque&#8217; &#8216;un&#8217;
</p>
<p>&#8216;inqui&#233;ter&#8217; 2
1
</p>
<p>1
</p>
<p>&#8216;tr&#232;s&#8217;
1
</p>
<p>e : &#8216;regarder&#8217;
</p>
<p>z : &#8216;m&#233;chant&#8217;
</p>
<p>m : &#8216;M&#232;re-grand&#8217;
</p>
<p>rx
</p>
<p>FIG. 4 &#8211; &#199;a inqui&#232;te M&#232;re-grand que chaque loup tr&#232;s m&#233;chant regarde un chaperon rouge
</p>
<p>G,
</p>
<p>&#63729;&#63732;&#63732;&#63732;&#63730;
&#63732;&#63732;&#63732;&#63732;&#63731;
</p>
<p>h1 : chaque(x, h2, h3), h6 : un(y, h7, h8),
h4 : loup(x), h9 : chaperon(y),
h5 : regarder(e, x, y), h10 : rouge(y),
h11 : me&#769;chant(z, x) h13 : inquie&#769;ter(e, m)
h12 : tre&#768;s(z) h14 : Me&#768;re-grand(m)
</p>
<p>&#63740;&#63732;&#63732;&#63732;&#63741;
&#63732;&#63732;&#63732;&#63732;&#63742;
</p>
<p>,
</p>
<p>&#63729;&#63732;&#63732;&#63730;
&#63732;&#63732;&#63731;
</p>
<p>h2 =q h4, h2 =q h5,
h2 =q h11, h2 =q h12,
h7 =q h9, h7 =q h10,
G =q h13, G =q h14
</p>
<p>&#63740;&#63732;&#63732;&#63741;
&#63732;&#63732;&#63742;
</p>
<p>Si l&#8217;on explicite une quantification existentielle sur e, on peut distinguer une inqui&#233;tude unique
li&#233;e &#224; un ensemble de regards, d&#8217;une multitude d&#8217;inqui&#233;tudes dues chacune &#224; un regard diff&#233;rent.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Renaud Marlet
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; un moyen simple de donner un sens &#224; des graphes s&#233;mantiques relative-
ment complexes. Ce sens n&#8217;inclut pas les cas de quantificateurs ramifi&#233;s, mais en contrepartie,
la formule logique produite (ou les formules, en cas de sous-sp&#233;cification) est &#224; m&#234;me d&#8217;&#234;tre
utilis&#233;e dans un solveur de la logique du premier ordre.
</p>
<p>Les perspectives de ce travail incluent notamment une analyse des hypoth&#232;ses de bonne forma-
tion d&#8217;un graphe pr&#233;dicatif quantifi&#233;, une &#233;tude plus pouss&#233;e de la construction des informations
de restriction &#224; partir de la syntaxe, ainsi qu&#8217;un traitement des d&#233;terminants complexes. &#192; plus
long terme, il serait int&#233;ressant d&#8217;&#233;tudier dans quelle mesure des inf&#233;rences logiques standards
pourraient &#234;tre effectu&#233;es directement sur la structure de graphe s&#233;mantique.
</p>
<p>R&#233;f&#233;rences
COPESTAKE A., FLICKINGER D., POLLARD C. &amp; SAG I. A. (2005). Minimal Recursion
Semantics : An introduction. Research on Language &amp; Computation, 3(4), 281&#8211;332.
DALRYMPLE M. (2001). Lexical Functional Grammar, volume 34 of Syntax and Semantics.
New York : Academic Press.
DEBUSMANN R., DUCHIER D., KOLLER A., KUHLMANN M., SMOLKA G. &amp; THATER S.
(2004). A relational syntax-semantics interface based on dependency grammar. In Proc. of the
20th International Conference on Computational Linguistics (COLING 2004).
DYMETMAN M. &amp; COPPERMAN M. (1996). Extended dependency structures and their formal
interpretation. In Proc. of the 16th International Conference on Computational Linguistics
(COLING 1996), p. 255&#8211;261.
KAHANE S. (2005). Structure des repr&#233;sentations logiques, polarisation et sous-sp&#233;cification.
In Conf&#233;rence sur le Traitement Automatique des Langues Naturelles (TALN 2005), p. 23&#8211;32.
KAHANE S. &amp; MEL&#8217; &#711;CUK I. (1999). La synth&#232;se s&#233;mantique ou la correspondance entre
graphes s&#233;mantiques et arbres syntaxiques &#8211; le cas des phrases &#224; extraction en fran&#231;ais contem-
porain. Traitement Automatique des Langues (TAL), 40(2), 25&#8211;85.
KANAZAWA M. (2007). Parsing and generation as datalog queries. In Proc. of the 45th Annual
Meeting of the Association of Computational Linguistics (ACL 2007), p. 176&#8211;183 : Association
for Computational Linguistics.
LESMO L., ROBALDO L. &amp; VILLATA S. (2007). Meaning-text theory and dependency tree
semantics : an account of underspecification. In Proc. of the 3rd International Conference on
Meaning-Text Theory (MTT 2007).
MEL&#8217; &#711;CUK I. (2001). Communicative Organization in Natural Language : The semantic-
communicative structure of sentences. Amsterdam / Philadelphia : John Benjamins.
MONTAGUE R. (1974). Formal Philosophy. Selected Papers of Richard Montague. Yale
University Press. Edited and with an introduction by Richmond H. Thomason.
POLGU&#200;RE A. (1990). Structuration et mise en jeu proc&#233;durale d&#8217;un mod&#232;le linguistique
d&#233;claratif dans un cadre de g&#233;n&#233;ration de texte. Th&#232;se de doctorat, Universit&#233; de Montr&#233;al.
POLGU&#200;RE A. (1997). Meaning-Text semantic networks as a formal language. In L. WAN-
NER, Ed., Recent Trends in Meaning-Text Theory, p. 1&#8211;24. Amsterdam : John Benjamins.
ROBALDO L. (2007). Dependency Tree Semantics. Th&#232;se de doctorat, Universit&#233; de Turin.</p>

</div></div>
</body></html>