<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Etude de la corr&#233;lation entre morphosyntaxe et s&#233;mantique dans une perspective d&#8217;&#233;tiquetage automatique de textes m&#233;dicaux arabes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude de la corr&#233;lation entre morphosyntaxe et s&#233;mantique 
</p>
<p>Etude de la corr&#233;lation entre morphosyntaxe et s&#233;mantique 
dans une perspective d&#8217;&#233;tiquetage automatique  
</p>
<p>de textes m&#233;dicaux arabes 
</p>
<p>Tatiana El-Khoury 
</p>
<p>Laboratoire TIMC&#8211;IMAG - Universit&#233; Joseph Fourier-Grenoble 1,  
BP 53-38041 Grenoble 
</p>
<p>tatiana.elkhoury@imag.fr 
</p>
<p>R&#233;sum&#233; Cet article se propose d&#8217;&#233;tudier les relations s&#233;mantiques reliant base et expansion 
au sein des termes m&#233;dicaux arabes de type &#171; N+N &#187;, particuli&#232;rement ceux dont la base est 
un d&#233;verbal. En &#233;tudiant les relations s&#233;mantiques &#233;tablies par une base d&#233;verbale, ce travail 
tente d&#8217;attirer l&#8217;attention sur l&#8217;interp&#233;n&#233;tration du s&#233;mantique et du morphosyntaxique ; il 
montre que, dans une large mesure, la structure morphosyntaxique de la base d&#233;termine 
l&#8217;&#233;ventail des possibilit&#233;s relationnelles. La d&#233;couverte de r&#233;gularit&#233;s dans le comportement 
de la base d&#233;verbale permet de pr&#233;dire le type de relations que peut &#233;tablir cette base avec son 
expansion pavant ainsi la voie &#224; un traitement automatique et un travail d&#8217;&#233;tiquetage 
s&#233;mantique des textes m&#233;dicaux arabes. 
</p>
<p>Abstract This paper examines the semantic relations existing in Arabic medical texts 
between the head and its extension in a two-noun compound, particularly when the head is a 
deverbal noun or a nominalization. By studying semantic relations encoded by 
nominalizations, this research work aims at underlining the correlation between 
morphosyntax and semantics notably the influence of the head noun structure on the set of 
semantic relations that can be established. The discovery of regularities in the functioning of 
the head noun allows thus to predict the type of relation that will be encoded. Such data are a 
pre-requisite for natural language processing and automatic part-to-speech tagging of medical 
Arabic texts. 
</p>
<p>Mots-cl&#233;s : &#233;tiquetage automatique, terminologie m&#233;dicale arabe, morphosyntaxe, 
s&#233;mantique. 
Keywords: Part-of-speech tagging, Arabic medical terminology, morphosyntax, 
semantics. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tatiana El-Khoury 
</p>
<p>La repr&#233;sentation des connaissances terminologiques a longtemps &#233;t&#233; envisag&#233;e &#224; 
travers le prisme des liens taxonomiques et s&#233;mantiques reliant diff&#233;rents termes d&#8217;un m&#234;me 
domaine. Des relations s&#233;mantiques ont ainsi &#233;t&#233; encod&#233;es entre des termes pour diverses 
raisons : classement documentaire, recherche d&#8217;informations (liens entre synonymes, 
variantes, hyperonymes et hyponymes&#8230;), organisation des connaissances dans un domaine 
sp&#233;cialis&#233;, etc. Cet encodage a &#233;galement &#233;t&#233; largement utilis&#233; dans le domaine de la 
terminographie et du traitement automatique des langues (TAL). Toutefois, la particularit&#233; du 
travail que nous pr&#233;sentons aujourd&#8217;hui consiste &#224; encoder des relations s&#233;mantiques, non pas 
entre des termes donn&#233;s, mais au sein m&#234;me de chaque terme, entre la base du syntagme 
terminologique et son expansion. Nous nous inscrivons, ce faisant, dans le prolongement des 
&#233;tudes men&#233;es depuis quelques ann&#233;es, notamment aux Etats-Unis1, et qui visent l&#8217;exploration 
des relations s&#233;mantiques, au sein de syntagmes terminologiques form&#233;s de deux lex&#232;mes, &#224; 
des fins d&#8217;&#233;tiquetage s&#233;mantique, d&#8217;am&#233;lioration des syst&#232;mes de recherche &#171; question-
r&#233;ponse &#187;, de g&#233;n&#233;ration automatique de r&#233;sum&#233;s, de construction d&#8217;ontologies et d&#8217;autres 
applications du TAL. Ainsi, en pr&#233;lude &#224; un &#233;tiquetage s&#233;mantique de textes m&#233;dicaux arabes, 
nous nous proposons d&#8217;&#233;tudier, dans le pr&#233;sent travail, les relations s&#233;mantiques au sein des 
termes de type &#171; N+N &#187;, soient les termes &#224; expansion annective2. Parmi les diff&#233;rents types 
d&#8217;expansions - annective, qualificative, compl&#233;tive ou modale (A. Roman, 1999) - qui 
participent &#224; la construction de syntagmes terminologiques en arabe, nous analysons plus 
pr&#233;cis&#233;ment l&#8217;expansion annective des syntagmes dont la base est form&#233;e d&#8217;un d&#233;verbal. 
En &#233;tudiant les relations s&#233;mantiques &#233;tablies par une base d&#233;verbale, nous d&#233;sirons attirer 
l&#8217;attention sur l&#8217;interp&#233;n&#233;tration du s&#233;mantique et du morphosyntaxique. Nous estimons que, 
dans une large mesure, la structure morphosyntaxique de la base d&#233;termine l&#8217;&#233;ventail des 
possibilit&#233;s relationnelles. Ainsi, si nous arrivons &#224; d&#233;celer des r&#233;gularit&#233;s dans le 
comportement de la base, nous serons &#224; m&#234;me de pr&#233;dire le type de relations que peut &#233;tablir 
une base d&#233;verbale avec son expansion. C&#8217;est l&#224; un pr&#233;alable &#224; tout traitement automatique et 
&#224; un travail d&#8217;&#233;tiquetage s&#233;mantique. 
Une base d&#233;verbale est d&#233;riv&#233;e d&#8217;un verbe ; son expansion est donc interpr&#233;t&#233;e comme un 
argument de ce verbe. Pour cette raison, la quasi-totalit&#233; des relations entretenues par une 
base d&#233;verbale et son expansion sont des relations actantielles (relations d&#8217;agent, de patient, 
d&#8217;instrument ou de b&#233;n&#233;ficiaire). Les &#233;tudes portant sur les relations actantielles au sein des 
termes &#224; construction annective (N+N) tentent d&#8217;y rep&#233;rer un comportement syst&#233;matique et 
des r&#233;gularit&#233;s r&#233;cursives afin de pouvoir mod&#233;liser ces relations. Partant de l&#224;, nous avan&#231;ons 
l&#8217;hypoth&#232;se selon laquelle en arabe m&#233;dical, il est possible de d&#233;terminer automatiquement la 
relation s&#233;mantique reliant la base d&#233;verbale &#224; son expansion annective &#224; condition de tenir 
compte de certains param&#232;tres morphosyntaxiques.  
Pour confirmer cette hypoth&#232;se, nous pr&#233;sentons dans une premi&#232;re partie les relations 
actantielles dans le discours m&#233;dical arabe &#233;tudi&#233; puis d&#233;taillons dans une seconde partie les 
param&#232;tres qui doivent &#234;tre pris en compte dans l&#8217;identification automatique de ces relations. 
Nous nous aidons dans cette entreprise d&#8217;un corpus &#233;lectronique de textes m&#233;dicaux arabes 
d&#8217;environ 600 000 mots et &#233;tudions plus pr&#233;cis&#233;ment un &#233;chantillon de 860 termes de 
structure annective pr&#233;lev&#233;s sur ce m&#234;me corpus et dont la base est un d&#233;verbal. 
</p>
<p>                                                 
1 Cf. Les travaux de Gildea et Jurafsky (2002), Rosario, Hearst et Fillmore (2002), Moldovan et al. (2004). 
</p>
<p>2 L&#8217;expansion annective correspond au &#171; compl&#233;ment de nom &#187; de la tradition arabe qui &#233;tablit avec son nom un 
rapport de subordination direct sans pr&#233;position. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude de la corr&#233;lation entre morphosyntaxe et s&#233;mantique 
</p>
<p>Les relations actantielles 
</p>
<p>Les types de relations actantielles 
</p>
<p>L&#8217;examen de l&#8217;ensemble des expansions annectives &#233;tudi&#233;es fait ressortir un fait notable : 
toutes les relations s&#233;mantiques au sein des termes de type &#171; N+N &#187; dont N1 est un d&#233;verbal 
de type masdar sont des relations actantielles d&#8217;agent ou de patient. L&#8217;actance est d&#233;finie par 
Lazard (1994) comme &#171; les faits relatifs aux relations grammaticales qui s&#8217;&#233;tablissent entre le 
pr&#233;dicat verbal et les termes nominaux qui en d&#233;pendent &#187;3. Les actants sont les termes 
connexes au pr&#233;dicat par opposition aux termes annexes que sont les circonstants. Par actants, 
on englobe donc les constituants syntaxiques entra&#238;n&#233;s par la valence de certaines classes 
lexicales (notamment le verbe) qui n&#233;cessitent d&#8217;&#234;tre satur&#233;es. Ces constituants suivent ce 
qu&#8217;on appelle un sch&#233;ma actantiel. Mais &#171; le sch&#233;ma actantiel, n&#8217;est pas une exclusivit&#233; du 
verbe, mais bien une caract&#233;ristique de tout processus impliquant un faire transformateur au 
sens le plus large du terme &#187; comme le pr&#233;cise Laurendeau (2004). En fait, certains mots 
mobilisent l&#8217;actantialit&#233; de plain-pied sans &#234;tre pour autant des verbes. Deux parties 
diff&#233;rentes du discours (par exemple &#171; rejeter &#187; et &#171; rejet &#187;) peuvent entra&#238;ner le m&#234;me 
sch&#233;ma actantiel. Pour d&#233;crire le ph&#233;nom&#232;ne linguistique liant ces deux parties du discours 
nous empruntons &#224; Mel&#8217;&#269;uk et al. (1995) le terme de  d&#233;rivation syntaxique. Parmi les types 
de d&#233;rivations syntaxiques, la nominalisation du verbe nous importe tout particuli&#232;rement 
dans ce travail. En arabe, la nominalisation du verbe correspond au &#171; masdar &#187; appel&#233; aussi 
&#171; nom verbal &#187; ou &#171; nom de proc&#232;s &#187;. Le masdar est un d&#233;verbal qui comporte des traits 
nominaux (il admet l&#8217;article et les marques casuelles) mais aussi des traits verbaux. Ainsi, au 
niveau s&#233;mantique, le masdar, d&#233;crit un proc&#232;s comme le font les verbes tandis qu&#8217;au niveau 
syntaxique, il peut r&#233;gir un compl&#233;ment. C&#8217;est cette actantialit&#233; command&#233;e par le statut de la 
base-masdar que nous allons tenter d&#8217;illustrer dans ce qui suit. 
</p>
<p>&#8226; Dans la relation actantielle d&#8217;agent, l&#8217;expansion annective renvoie &#224; un actant &#224; 
l&#8217;origine de l&#8217;action exprim&#233;e par la base ou l&#8217;actant responsable de l&#8217;existence de la 
base syntagmatique. L&#8217;expansion annective a donc le r&#244;le de l&#8217;acteur ou de 
l&#8217;instigateur de l&#8217;action sous-tendue par la base nominale. 
</p>
<p>Terme arabe Nom de base &#8211;  
Nom d&#8217;expansion 
</p>
<p>Equivalent fran&#231;ais 
</p>
<p>&#1605;&#1583;&#1604;&#1575; &#1606;&#1575;&#1610;&#1585;&#1587;  Circulation &#8211; sang La circulation du 
sang 
</p>
<p>&#1577;&#1579;&#1604;&#1604;&#1575; &#1610;&#1605;&#1575;&#1606;&#1578;  D&#233;veloppement &#8211; 
gencive 
</p>
<p>L&#8217;hyperplasie 
gingivale 
</p>
<p> &#1593;&#1575;&#1582;&#1606;&#1604;&#1575; &#1575;&#1610;&#1604;&#1575;&#1582; &#1605;&#1608;&#1580;&#1726;
&#1593;&#1608;&#1585;&#1586;&#1605;&#1604;&#1575;  
</p>
<p>Attaque &#8211; cellules [de 
la moelle osseuse] 
</p>
<p>La r&#233;action de greffe 
contre h&#244;te4 
</p>
<p>                                                 
3  Tesni&#232;re (1959) fut le premier &#224; introduire la notion d&#8217;actant. Il l&#8217;a d&#233;finie comme suit &#171; &#234;tres ou choses qui, 
</p>
<p>&#224; un titre quelconque, et de quelque fa&#231;on que ce soit, m&#234;me au titre de simples figurants et de la fa&#231;on la 
plus passive, participent au proc&#232;s &#187; (Tesni&#232;re, 1959 : 102). 
</p>
<p>4  Ce terme est l&#8217;&#233;quivalent du terme anglais &#171; Graft-versus-host disease &#187; employ&#233; parfois sous sa graphie 
originale anglaise dans les textes fran&#231;ais. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tatiana El-Khoury 
</p>
<p>Dans les exemples susmentionn&#233;s, c&#8217;est le sang qui circule, la gencive qui se d&#233;veloppe et les 
cellules de la moelle osseuse qui attaquent les tissus du receveur. 
</p>
<p>&#8226; Dans la relation actantielle de patient, l&#8217;expansion annective renvoie &#224; un actant 
qui subit l&#8217;action de la base ou sur lequel l&#8217;action a lieu. Comme le laisse deviner son 
&#233;tymologie, &#171; patient &#187; du latin patiens, participe pr&#233;sent du verbe patior (souffrir, 
supporter), repr&#233;sente celui sur qui on agit, par opposition &#224; agent, celui qui agit (du 
verbe latin ago, &#171; agir &#187;). La relation actantielle de patient s&#8217;&#233;tablit donc entre une 
base qui agit ou qui traduit une action et une expansion qui subit. 
</p>
<p>Terme arabe Nom de base &#8211;  
Nom d&#8217;expansion 
</p>
<p>Equivalent fran&#231;ais 
</p>
<p>&#1575;&#1610;&#1604;&#1575;&#1582;&#1604;&#1575; &#1593;&#1575;&#1585;&#1586;&#1578;&#1587;&#1575;  Culture &#8211; cellules La culture de cellules 
</p>
<p> &#1577;&#1610;&#1601;&#1589;&#1578;&#1604;&#1575;&#1605;&#1583;  Filtration &#8211; sang La dialyse 
</p>
<p>&#1577;&#1574;&#1585;&#1604;&#1575; &#1577;&#1593;&#1575;&#1585;&#1586;  Greffe &#8211; poumon La greffe du poumon 
Dans les termes ci-dessus, l&#8217;expansion subit l&#8217;action d&#233;not&#233;e par la base. Ainsi, les 
&#171; cellules &#187; sont &#171; cultiv&#233;es &#187;, le &#171; sang &#187; filtr&#233; et le &#171; poumon &#187; greff&#233;. 
</p>
<p>La mod&#233;lisation des relations actantielles 
</p>
<p>Les r&#233;centes &#233;tudes portant sur les relations actantielles au sein des termes &#224; construction 
annective tentent d&#8217;y rep&#233;rer des r&#233;gularit&#233;s r&#233;cursives de sorte qu&#8217;un sous-ensemble de faits 
puisse rendre compte de l&#8217;ensemble. La d&#233;couverte d&#8217;une telle r&#233;cursivit&#233; est une condition 
sine qua non pr&#233;alable &#224; tout traitement informatique. Mais la mod&#233;lisation des relations 
actantielles au sein de termes &#224; base d&#233;verbale ne fait pas l&#8217;unanimit&#233;. Si des auteurs (Lapata 
2002) affirment qu&#8217;elles sont susceptibles de faire l&#8217;objet d&#8217;une caract&#233;risation linguistique, 
d&#8217;autres (Hobbs et al. 1993) estiment qu&#8217;elles n&#233;cessitent pour leurs interpr&#233;tations des 
param&#232;tres pragmatiques et contextuels qui rechignent &#224; toute mod&#233;lisation. En arabe 
m&#233;dical, nous estimons qu&#8217;il est possible de voir des r&#233;gularit&#233;s concernant le comportement 
des bases d&#233;verbales car seuls des emplois atypiques semblent d&#233;roger &#224; la &#171; r&#232;gle &#187; et 
n&#233;cessitent par cons&#233;quent des &#233;l&#233;ments pragmatiques pour l&#8217;interpr&#233;tation de la relation 
s&#233;mantique qui unit base et expansion. Quant aux r&#233;gularit&#233;s, elles peuvent &#234;tre capt&#233;es gr&#226;ce 
&#224; trois param&#232;tres : la valence de la base d&#233;verbale, le degr&#233; d&#8217;agentivit&#233; du verbe dont elle 
est d&#233;riv&#233;e et l&#8217;implication de son sch&#232;me. Nous d&#233;veloppons ces trois param&#232;tres dans ce qui 
suit. 
</p>
<p>Les param&#232;tres pour l&#8217;identification automatique 
</p>
<p>La valence de la base d&#233;verbale 
</p>
<p>La valence du verbe est le nombre de compl&#233;ments &#224; lui donner pour construire un 
&#233;nonc&#233; simple et complet. Elle est tributaire, en arabe, de son appartenance &#224; l&#8217;un des trois 
groupes suivants : transitif direct, transitif indirect et intransitif. Le verbe peut &#234;tre transitif 
direct et r&#233;gir un compl&#233;ment d&#8217;objet sans interm&#233;diaire, transitif indirect et admettre un 
compl&#233;ment d&#8217;objet pr&#233;c&#233;d&#233; d&#8217;une pr&#233;position ou encore intransitif ; dans ce cas il n&#8217;admet 
pas de compl&#233;ment d&#8217;objet. 
Cette diff&#233;rence de r&#233;gime se r&#233;percute sur les masdars issus de chacun de ces types de 
verbes. Ainsi, la base-masdar d&#8217;un verbe intransitif ou transitif indirect, n&#8217;accepte, en th&#233;orie, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude de la corr&#233;lation entre morphosyntaxe et s&#233;mantique 
</p>
<p>qu&#8217;une relation d&#8217;agent avec son expansion. A titre d&#8217;exemple, si le verbe de l&#8217;&#233;nonc&#233; 
/tadjallata ad-damm/5 (glos&#233; &#171; a coagul&#233; le sang&#187;) est nominalis&#233;, son sujet original /ad-
damm/ transform&#233; en compl&#233;ment de nom du masdar /tadjallut/ &#171; coagulation &#187; occupera le 
r&#244;le d&#8217;agent dans /tadjallut ad-damm/ (la coagulation du sang). Par contre, dans le cas d&#8217;une 
base qui est masdar d&#8217;un verbe transitif direct, celle-ci peut commander soit une relation 
d&#8217;agent soit une relation de patient avec son expansion. Ainsi, lorsque le verbe de l&#8217;&#233;nonc&#233; 
&#171; shakhkhasa at-tabibu al-marada  &#187; (glos&#233; &#171; a diagnostiqu&#233; le m&#233;decin la maladie &#187;) est 
nominalis&#233;, le masdar peut entretenir deux types de relation avec son expansion. On peut soit 
obtenir &#171; le diagnostic du m&#233;decin &#187;, la relation base-expansion est alors une relation d&#8217;agent, 
soit &#171; le diagnostic de la maladie &#187;, la relation base-expansion est, dans ce cas, une relation de 
patient.  
Dans les termes m&#233;dicaux &#224; expansion annective, la valence des masdars formant les bases 
terminologiques semble avoir donc une incidence sur le type de relation s&#233;mantique reliant 
bases et expansions. En d&#8217;autres termes, l&#8217;intransitivit&#233; ainsi que la transitivit&#233; directe et 
indirecte commandent la relation s&#233;mantique et l&#8217;orientent dans un sens donn&#233; (agent ou 
patient). Mais lorsque la valence du masdar permet diff&#233;rentes relations comme dans le cas 
d&#8217;un masdar issu d&#8217;un verbe transitif direct, existe-il une relation prioritaire ? et si oui, 
laquelle ? Pour r&#233;pondre &#224; ces questions, nous confrontons les donn&#233;es recueillies et 
interpr&#233;tons les r&#233;sultats. 
Sur les 860 syntagmes terminologiques de structure annective dont la base est un masdar, 603 
bases sont d&#233;riv&#233;es de verbes transitifs directs. Quoique ces masdars admettent les deux 
relations d&#8217;agent et de patient, il semblerait que, dans le corpus &#233;tudi&#233;, les masdars de verbes 
transitifs directs n&#8217;acceptent qu&#8217;une relation de patient ; les relations actantielles d&#8217;agent &#233;tant 
confin&#233;es &#224; quelques rares exemples de phras&#233;ologismes terminologiques ou d&#8217;emplois 
atypiques. Plus de 99% des bases-masdars d&#233;riv&#233;es de verbes transitifs directs &#233;tablissent, en 
effet, avec leur expansion une relation de patient. Voici quelques exemples illustrant ce type 
de relation : 
</p>
<p>Terme arabe Nom de base &#8211;  
Nom d&#8217;expansion 
</p>
<p>Equivalent fran&#231;ais 
</p>
<p>&#1577;&#1593;&#1575;&#1606;&#1605;&#1604;&#1575; &#1591;&#1610;&#1576;&#1579;&#1578;  D&#233;pression &#8211;
immunit&#233; 
</p>
<p>L&#8217;immunod&#233;pression 
</p>
<p>&#1576;&#1604;&#1602;&#1604;&#1575; &#1593;&#1585;&#1586;  Greffe &#8211;  c&#339;ur La greffe du c&#339;ur 
</p>
<p>&#1569;&#1575;&#1590;&#1593;&#1604;&#1571;&#1575; &#1593;&#1610;&#1576;  Vente &#8211; organes Le trafic d&#8217;organes 
</p>
<p>Dans ces exemples, l&#8217;&#171; immunit&#233; &#187; est &#171; d&#233;prim&#233;e &#187;, le &#171; c&#339;ur &#187; greff&#233;, et les &#171; organes &#187; 
vendus. Les expansions des syntagmes susmentionn&#233;s entretiennent donc avec leurs bases une 
relation actantielle de patient. C&#8217;est le cas de la quasi-totalit&#233; des bases-masdars d&#233;riv&#233;es d&#8217;un 
verbe transitif direct. La relation masdar-patient semble donc prioritaire par rapport &#224; la 
relation masdar-agent dans la formation terminologique arabe. La pr&#233;s&#233;ance de cette relation 
pourrait s&#8217;expliquer par la raison suivante : Lorsque la base est un masdar d&#233;riv&#233; d&#8217;un verbe 
transitif direct, il semblerait que la charge sp&#233;cificatrice v&#233;hicul&#233;e par les deux actants 
</p>
<p>                                                 
5  Les symboles de transcription utilis&#233;s dans cet article sont ceux de l&#8217;Encyclop&#233;die de l&#8217;Islam. La 
</p>
<p>transcription de certains caract&#232;res de l&#8217;arabe n&#8217;&#233;tant pas possible avec nos logiciels de traitement de texte, 
les phon&#232;mes emphatiques sont mis en gras : h, s, d, t, z et k. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tatiana El-Khoury 
</p>
<p>possibles, l&#8217;agent et le patient, ne soit pas dot&#233;e de la m&#234;me importance; le patient aurait, en 
terminologie m&#233;dicale arabe, une charge sp&#233;cificatrice plus pertinente, plus r&#233;v&#233;latrice sur le 
plan s&#233;mantique que celle de l&#8217;agent. Il s&#8217;agit donc d&#8217;optimiser les traits conceptuels du 
syntagme terminologique en choisissant la charge sp&#233;cificatrice la plus &#224; m&#234;me d&#8217;affiner la 
place du syntagme dans une sous-cat&#233;gorie. 
Seuls quelques rares cas de bases-masdars d&#233;riv&#233;es de verbes transitifs directs d&#233;rogent &#224; 
cette tendance en &#233;tablissant une relation d&#8217;agent avec leur expansion. Il s&#8217;agit 
essentiellement de phras&#233;ologismes terminologiques ainsi que d&#8217;usages atypiques ou ambigus 
susceptibles de se pr&#234;ter aux deux relations d&#8217;agent et de patient. 
Les 257 bases-masdars restantes sont d&#233;riv&#233;es de verbes intransitifs et transitifs indirects et 
entretiennent, en principe, avec leur expansion une relation actantielle d&#8217;agent comme dans 
les exemples suivants : 
</p>
<p>Terme arabe Nom de base &#8211;  
Nom d&#8217;expansion 
</p>
<p>Equivalent fran&#231;ais 
</p>
<p>&#1577;&#1578;&#1608;&#1578;&#1604;&#1575; &#1605;&#1580;&#1581; &#1588;&#1575;&#1605;&#1603;&#1606;&#1575;  R&#233;sorption &#8211; taille du 
thymus 
</p>
<p>L&#8217;involution du 
thymus 
</p>
<p>&#1605;&#1583;&#1604;&#1575; &#1606;&#1586;&#1604;&#1575;&#1578;  Agglutination - sang L&#8217;agglutination du 
sang 
</p>
<p>&#1578;&#1604;&#1575;&#1590;&#1593;&#1604;&#1575; &#1569;&#1575;&#1582;&#1585;&#1578;&#1587;&#1575;  rel&#226;chement &#8211; 
muscles 
</p>
<p>Le rel&#226;chement 
musculaire 
</p>
<p>Dans les syntagmes terminologiques susmentionn&#233;s, c&#8217;est la &#171; taille du thymus &#187; qui se 
r&#233;sorbe, les &#171; cellules sanguines &#187; qui s&#8217;agglutinent et les &#171; muscles &#187; qui se rel&#226;chent. Les 
r&#233;f&#233;rents des expansions sont donc les agents des actions d&#233;not&#233;es par les d&#233;nominations des 
bases. 
A priori, lorsque la base est un masdar d&#233;riv&#233; d&#8217;un verbe intransitif ou transitif indirect, toute 
la charge sp&#233;cificatrice doit &#234;tre concentr&#233;e dans l&#8217;agent en l&#8217;absence de tout autre actant. 
Mais l&#8217;encodage des relations s&#233;mantiques actantielles n&#8217;ob&#233;it pas &#224; cette syst&#233;maticit&#233; 
simplificatrice car les r&#244;les s&#233;mantiques (agent, patient&#8230;) ne se superposent pas forc&#233;ment 
aux r&#244;les grammaticaux (sujet, compl&#233;ment d&#8217;objet direct&#8230;). Pour cette raison, un masdar 
issu d&#8217;un verbe intransitif est susceptible d&#8217;accepter, dans certains cas, un patient quand bien 
m&#234;me son verbe ne pourrait pas accepter un compl&#233;ment d&#8217;objet direct. Pour mieux 
comprendre ce point &#233;pineux, force est de prendre en compte le second param&#232;tre, celui de 
l&#8217;agentivit&#233; du verbe dont est issue la base-masdar.  
</p>
<p>L&#8217;agentivit&#233; du verbe de la base d&#233;verbale 
</p>
<p>L&#8217;agentivit&#233; est d&#233;finie comme la participation de l&#8217;agent au proc&#232;s d&#233;not&#233; par le verbe. 
Le crit&#232;re de cette &#171; participation &#187; est le contr&#244;le ou du moins le degr&#233; de contr&#244;le de l&#8217;agent 
sur le proc&#232;s. Selon Roman (1990), il y a en arabe trois degr&#233;s d&#8217;agentivit&#233; : dans l&#8217;agentivit&#233; 
pleine, l&#8217;agent contr&#244;le effectivement le proc&#232;s ; dans l&#8217;agentivit&#233; partielle, l&#8217;agent ne 
contr&#244;le le proc&#232;s qu&#8217;en partie ; dans l&#8217;agentivit&#233; z&#233;ro, l&#8217;agent ne contr&#244;le pas le proc&#232;s. Les 
verbes d&#8217;action sont ainsi des verbes pleinement agentifs, les verbes d&#8217;&#233;motion et de r&#233;action 
des verbes partiellement agentifs et les verbes d&#8217;&#233;tat des verbes non-agentifs. 
L&#8217;agentivit&#233; des verbes se r&#233;percute sur leur masdar. Ainsi, les verbes intransitifs ayant une 
agentivit&#233; pleine ou m&#234;me partielle acceptent un agent comme actant mais pour les verbes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude de la corr&#233;lation entre morphosyntaxe et s&#233;mantique 
</p>
<p>non-agentifs, les agents ou plut&#244;t les &#171; pseudo-agents &#187; qui n&#8217;ont aucun contr&#244;le sur le proc&#232;s 
du verbe sont assimil&#233;s &#224; des patients.  
La question de &#171; pseudo-agent &#187; ou de &#171; patient &#187; pour des verbes intransitifs remet au centre 
des discussions la distinction traditionnelle faite en arabe entre &#171; sujet r&#233;el &#187; et &#171; sujet 
grammatical &#187;. Comme le fait remarquer Hamz&#233; (1999), &#171; les grammairiens arabes 
distinguent nettement dans leur th&#233;orisation sur le /f&#226;cil/ (litt&#233;ralement : celui qui fait) entre les 
plans syntaxique et s&#233;mantique &#187;. Sur le plan syntaxique, le /f&#226;cil/ est le sujet du verbe ; on 
l&#8217;appelle le /f&#226;cil nahwiyy/ (le sujet grammatical) alors que sur le plan s&#233;mantique, il est soit 
l&#8217;agent qui fait v&#233;ritablement le proc&#232;s (il est alors appel&#233; /f&#226;cil haq&#238;qiyy/) soit il ne l&#8217;est pas ; 
dans ce cas, il reste cantonn&#233; &#224; son r&#244;le de sujet grammatical /f&#226;cil nahwiyy/. Ce sujet, qui ne 
fait pas le proc&#232;s, accompagne les verbes dits non-agentifs6. Ainsi, Al-Makhz&#251;m&#238; (1986 : 47) 
estime qu&#8217;il y a une diff&#233;rence sensible entre un sujet qui choisit de faire l&#8217;action du verbe 
comme /s&#226;fara Khalid/ &#171; Khaled est parti en voyage &#187; et un autre qui subit cette action comme 
dans /&#8217;inkasara az-zudj&#226;dju/ &#171; le verre s&#8217;est cass&#233; &#187; (construit avec un verbe sur le sch&#232;me 
/infacala/) qui se rapproche s&#233;mantiquement de /kusira az-zudj&#226;dju/ &#171; le verre a &#233;t&#233; cass&#233; &#187; 
(construit avec la forme simple du verbe /kasara/ &#224; la voix passive). 
</p>
<p>Toutefois, pour pouvoir rep&#233;rer automatiquement les relations actantielles &#233;tablies par une 
base d&#233;verbale, il faut trouver un crit&#232;re formel pour distinguer d&#8217;une part les verbes 
intransitifs &#224; agentivit&#233; pleine et partielle qui acceptent un agent et d&#8217;autre part les verbes 
intransitifs &#224; agentivit&#233; nulle qui ne peuvent accepter s&#233;mantiquement qu&#8217;un patient. Or, les 
sch&#232;mes produisant des verbes &#224; agentivit&#233; nulle ou z&#233;ro tels que /facila/ (ex. /marida/ 
&#171; tomber malade &#187;) ne peuvent pas constituer un crit&#232;re fiable car ils produisent &#233;galement 
des verbes &#224; agentivit&#233; partielle (ex. /dahika/ &#171; rire &#187;). Pour les fins d&#8217;un traitement 
automatique, nous estimons que le crit&#232;re le plus fiable est l&#8217;existence ou pas, pour un verbe 
intransitif, d&#8217;un participe actif7. Le sens des verbes &#224; agentivit&#233; z&#233;ro, tels que les verbes d&#8217;&#233;tat, 
exclut en fait le participe actif car les valeurs d&#8217;ach&#232;vement et de progressivit&#233; de ce dernier 
sont incompatibles avec la qualit&#233; ou l&#8217;&#233;tat durable et constant caract&#233;risant les verbes d&#8217;&#233;tat. 
Dans ces verbes, le sujet n&#8217;a aucune prise sur le proc&#232;s. La formation d&#8217;un participe actif (qui 
a le sens de &#171; celui qui fait &#187;) est donc impossible. Faute d&#8217;avoir un participe actif, la 
morphologie de la langue arabe leur associe ce qu&#8217;il y a de plus analogue : &#171; l&#8217;adjectif 
analogue &#187; /as-sifa(t) al-mu&#353;abbaha(t)/. Cet adjectif est une forme d&#233;riv&#233;e d&#8217;un verbe 
intransitif et dont le fonctionnement est &#171; analogue &#187; &#224; celui du participe actif. Il exprime, 
cependant, des qualit&#233;s durables contrairement au participe actif et ne peut &#234;tre d&#233;riv&#233; que 
d&#8217;un verbe trilit&#232;re intransitif. Dans ce qui suit, nous confrontons les donn&#233;es obtenues sur les 
verbes intransitifs, appliquons le crit&#232;re participe actif vs. adjectif analogue et interpr&#233;tons les 
r&#233;sultats. 
</p>
<p>Avant d&#8217;exposer les donn&#233;es, un r&#233;capitulatif s&#8217;impose. Sur les 860 syntagmes 
terminologiques de structure annective form&#233;s avec des bases d&#233;verbales, 603 bases-masdars 
sont d&#233;riv&#233;es de verbes transitifs directs. Ces bases, nous l&#8217;avons vu, acceptent dans la quasi-
totalit&#233; des cas (pr&#233;cis&#233;ment 99,3%) un patient. Les quelques rares cas d&#8217;agent sont des 
usages largement atypiques ou phras&#233;ologiques. Dans ce qui suit, nous nous int&#233;ressons donc 
</p>
<p>                                                 
6  De nombreux auteurs abordent cette notion de fa&#231;on relativement succincte, parmi lesquels nous citons Al-
</p>
<p>&#8217;Astar&#226;b&#226;d&#238; (m. 686/1287) qui cite dans &#352;arh a&#353;-&#352;&#226;fiya une cat&#233;gorie de verbes dont le sujet r&#233;el n&#8217;est pas 
mentionn&#233; et dont la majeur partie de verbes exprime des pathologies tels que /djunna/ (devenir fou), 
/zukima/ (attraper un rhume), /humma/ (avoir de la fi&#232;vre), etc. Al-&#8217;Astar&#226;b&#226;d&#238; ajoute que s&#8217;il n&#8217;est pas fait 
mention du sujet r&#233;el, c&#8217;est parce qu&#8217;il est commun&#233;ment admis que c&#8217;est Dieu lui-m&#234;me. Le sujet fut donc 
supprim&#233; parce que redondant 
</p>
<p>7  Nous n&#8217;&#233;voquons pas le participe passif puisqu&#8217;il est sp&#233;cifique aux verbes transitifs. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tatiana El-Khoury 
</p>
<p>aux 257 bases-masdars restantes et d&#233;riv&#233;es de verbes intransitifs ou transitifs indirects. 
M&#234;me si a priori ces bases ne peuvent accepter qu&#8217;un agent, l&#8217;agentivit&#233; nulle de certains 
verbes intransitifs complique la t&#226;che. Voici les donn&#233;es relatives aux 257 masdars issus de 
verbes intransitifs8 : 
Premi&#232;rement, sur les 257 masdars, moins d&#8217;une vingtaine sont issus de verbes non-agentifs 
soit 6,6%. 
Deuxi&#232;mement, les masdars issus de verbes non-agentifs construisent tous un adjectif 
analogue et n&#8217;acceptent pas de participe actif. 
Troisi&#232;mement, tous ces masdars entretiennent avec leurs expansions une relation actantielle 
de patient comme en t&#233;moignent les exemples suivants : 
</p>
<p>Terme arabe Nom de base &#8211; 
Nom d&#8217;expansion 
</p>
<p>Equivalent fran&#231;ais Adjectif analogue du 
</p>
<p>verbe correspondant
</p>
<p>&#1605;&#1583;&#1604;&#1575; &#1585;&#1602;&#1601;  Appauvrissement &#8211; 
sang 
</p>
<p>L&#8217;an&#233;mie &#1585;&#1610;&#1602;&#1601; 
</p>
<p>&#1594;&#1575;&#1605;&#1583;&#1604;&#1575; &#1578;&#1608;&#1605;  Mort &#8211; cerveau La mort c&#233;r&#233;brale &#1578;&#1610;&#1605; 
</p>
<p>Dans ces exemples, le sang subit un appauvrissement en globules rouges et le cerveau est 
sujet &#224; la mort9. Les actants impliqu&#233;s dans ces relations s&#233;mantiques sont donc des patients. 
Or les verbes dont sont issues les bases-masdars sont intransitifs. Nous pouvons donc avancer 
qu&#8217;une base issue d&#8217;un verbe intransitif entretient une relation d&#8217;agent lorsque son verbe est 
pleinement ou partiellement agentif et une relation de patient lorsque son verbe a une 
agentivit&#233; nulle. 
Les remarques que nous venons de formuler sur l&#8217;agentivit&#233; mettent en &#233;vidence un troisi&#232;me 
param&#232;tre, celui des sch&#232;mes des masdars dont les implications sur le type de relation 
actantielle sont nettes dans les r&#233;sultats de cette &#233;tude. 
</p>
<p>Les sch&#232;mes de la base d&#233;verbale 
</p>
<p>Le tableau suivant r&#233;capitule les r&#233;sultats expos&#233;s plus haut et obtenus sur le corpus de 
l&#8217;&#233;tude. Les pourcentages tr&#232;s &#233;lev&#233;s de relations d&#8217;agent pour les bases-masdars issues de 
verbes intransitifs et de relations de patient pour les bases-masdars issues de verbes transitifs 
posent la question de savoir dans quelle mesure les sch&#232;mes participent &#224; cette r&#233;partition et 
s&#8217;ils peuvent constituer un crit&#232;re fiable capable d&#8217;&#234;tre utilis&#233; &#224; des fins de traitement 
automatique. 
 
 
</p>
<p>                                                 
8  Par souci de commodit&#233;, nous incluons dans la suite de cet expos&#233; sous l&#8217;appellation &#171; intransitifs &#187; les 
</p>
<p>verbes qui ne sont pas transitifs directs soit les verbes v&#233;ritablement intransitifs et les verbes transitifs 
indirects ; ces deux cat&#233;gories ont en commun de ne pas accepter de compl&#233;ment d&#8217;objet direct /mafc&#251;l bihi/. 
</p>
<p>9 Le fait de consid&#233;rer le &#171; cerveau &#187; comme patient est intimement li&#233; &#224; la perception de la mort dans la culture 
arabe qui estime que l&#8217;on n&#8217;est pas actif dans sa propre mort mais que c&#8217;est au Tout-Puissant que revient la 
d&#233;cision d&#8217;&#244;ter la vie &#224; l&#8217;humain. Un verbe synonyme de &#171; m&#226;t &#187; - qui est &#224; l&#8217;origine de l&#8217;exemple 
susmentionn&#233; - celui de &#171; tawaff&#226; &#187; est plus explicite puisque la personne d&#233;c&#233;d&#233;e occupe toujours la position 
de COD ; le sujet &#233;tant syst&#233;matiquement Dieu. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Etude de la corr&#233;lation entre morphosyntaxe et s&#233;mantique 
</p>
<p> Nb. d&#8217;exemples Relations d&#8217;agent Relations de patient 
</p>
<p>Bases-masdars issues 
de verbes intransitifs 
</p>
<p>257 93,4% 6,6% 
</p>
<p>Bases-masdars  issues 
de verbes transitifs 
</p>
<p>603 0,7% 99,3% 
</p>
<p>Le sch&#232;me est le &#171; moule &#187; syllabique qui sert &#224; la formation des mots en arabe. Selon 
le sch&#232;me combin&#233; avec la racine du verbe, nous pouvons obtenir le nom verbal (ou masdar), 
le participe actif, le participe passif, le nom de lieu, le nom d&#8217;instrument, le nom d&#8217;abondance, 
le nom de m&#233;tier, etc. 
Certains sch&#232;mes, de par leur construction morphologique, se pr&#234;tent majoritairement (et 
parfois m&#234;me exclusivement) soit &#224; une relation d&#8217;agent, soit &#224; une relation de patient car ils 
favorisent la construction de verbes transitifs ou intransitifs. Ainsi, une &#233;tude morphologique 
de la distribution des sch&#232;mes dans un discours donn&#233; peut tracer des tendances claires quant 
aux relations s&#233;mantiques masdars-expansions susceptibles d&#8217;&#234;tre &#233;tablies. Pour s&#8217;en 
convaincre, il suffit de regarder le tableau ci-dessous qui indique si les diff&#233;rents sch&#232;mes 
mentionn&#233;s contribuent, dans la terminologie m&#233;dicale arabe, &#224; construire des masdars 
d&#233;riv&#233;s de verbes intransitifs (donc avec une tr&#232;s forte probabilit&#233; d&#8217;entretenir une relation 
d&#8217;agent avec leur expansion) ou des masdars d&#233;riv&#233;s de verbes transitifs (donc &#233;tablissant 
dans la quasi-totalit&#233; des cas une relation de patient avec leur expansion). Afin de conforter 
l&#8217;hypoth&#232;se &#233;voquant le lien entre sch&#232;me et relation actantielle, nous choisissons de pr&#233;senter 
dans ce tableau des sch&#232;mes attest&#233;s par au moins 15 masdars dans le corpus &#233;tudi&#233;. Voici 
leur distribution : 
</p>
<p>Sch&#232;mes Transitifs Intransitifs Tendance 
</p>
<p>istifc&#226;l 92.5% 7.5% Transitifs 
</p>
<p>infic&#226;l 0% 100% Intransitifs 
</p>
<p>taf&#226;cul 5% 95% Intransitifs 
</p>
<p>tafaccul 6.4% 93.6% Intransitifs 
</p>
<p>tafcila(t) 100% 0% Transitifs 
</p>
<p>tafc&#238;l 98.5% 1.5% Transitifs 
</p>
<p>fic&#226;la(t) 94% 6% Transitifs 
</p>
<p>fuc&#251;l/fuc&#251;la(t) 95.6% 4.4% Transitifs 
</p>
<p>En conclusion, nous pouvons avancer que dans les termes arabes &#224; expansion 
annective, il existe une corr&#233;lation entre les param&#232;tres morphosyntaxiques (valence, 
agentivit&#233; et sch&#232;mes des bases-masdars) et les relations s&#233;mantiques base-expansion 
(relation d&#8217;agent ou de patient) pouvant &#234;tre &#233;tablies. Ainsi, les masdars issus de verbes 
intransitifs ne peuvent entretenir qu&#8217;une relation d&#8217;agent avec leurs expansions sauf si 
l&#8217;agentivit&#233; des verbes dont sont issues les bases-masdars est nulle. Les r&#233;sultats de cette 
&#233;tude r&#233;v&#232;lent un autre ph&#233;nom&#232;ne surprenant. L&#8217;expansion annective d&#8217;un masdar issu d&#8217;un 
verbe transitif qui, a priori, peut &#233;tablir avec sa base une relation d&#8217;agent ou de patient est, 
dans le corpus &#233;tudi&#233;, une relation presque exclusivement de patient ce qui laisse supposer </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Tatiana El-Khoury 
</p>
<p>que cette relation est prioritaire dans la formation terminologique. Ainsi, au-del&#224; des 
consid&#233;rations purement syntactico-s&#233;mantiques, les r&#233;sultats obtenus &#233;tablissent une jonction 
entre grammaire et terminologie et pavent la voie &#224; un travail d&#8217;&#233;tiquetage s&#233;mantique des 
textes m&#233;dicaux arabes qui reste encore &#224; faire. 
</p>
<p>R&#233;f&#233;rences 
AL-MAKHZ&#219;M&#206; M. (1986). F&#238; An-nah&#251; al-carabiyy. Naqdun wa tawj&#238;h. Beyrouth : D&#226;r Ar-
R&#226;&#8217;id al-carabiyy. 
</p>
<p>COTTE P. (1999). Langage et lin&#233;arit&#233;. Villeneuve d&#8217;Ascq : Presses universitaires du 
Septentrion. 
</p>
<p>FRAN&#199;OIS J. (2004). L&#8217;adjectif en fran&#231;ais et &#224; travers les langues. Caen : Presses 
universitaires de Caen. 
</p>
<p>GILDEA D., JURAFSKY D. (2002). Automatic Labeling of Semantic Roles. Computational 
Linguistics 28, Vol.3. 
</p>
<p>HAMZE H. (1999). La position du sujet du verbe dans la pens&#233;e des grammairiens arabes. In 
(Cotte, 1999), 127-149. 
</p>
<p>HOBBS J., STICKEL M., APPELT D., MARTIN P.M. (1993). Interpretation as Abduction. Journal 
of Artificial Intelligence 1-2, Vol.63. 
</p>
<p>LAPATA M. (2002). The Disambiguation of Nominalizations. Computational Linguistics 28, 
Vol.3. 
</p>
<p>LAURENDEAU M. (2004). L&#8217;actancialit&#233; de l&#8217;adjectif verbal d&#8217;origine g&#233;rondive dans deux 
vernaculaires du fran&#231;ais. In (Fran&#231;ois, 2004), 53-70. 
</p>
<p>LAZARD G. (1994). L&#8217;actance. Paris : Presses Universitaires de France. 
</p>
<p>MEL&#8217;CUK I., POLGUERE A. CLAS A. (1995). Introduction &#224; la lexicologie explicative et 
combinatoire. Louvain-la-Neuve : Duculot. 
 
MOLDOVAN D., BADULESCU A., TATU M., ANTOHE D., GIRJU R., (2004). Models for the 
Semantic Classification of Noun Phrases. Proceedings of the Computational Lexical 
Semantics Workshop at HLT-NAACL, 60-67. 
</p>
<p>ROMAN A. (1990). Grammaire de l&#8217;Arabe. Paris : Presses Universitaires de France. 
</p>
<p>ROMAN A. (1999). La cr&#233;ativit&#233; lexicale en arabe, Lyon : Presses Universitaires de Lyon. 
</p>
<p>ROSARIO B., HEARST M., FILLMORE C. (2000). The Descent of Hierarchy, and Selection in 
Relational Semantics. Proceedings of the 40th Annual Meeting of the Association for 
Computational Linguistics (ACL-02), 247-254. 
</p>
<p>TESNIERE L. (1959). El&#233;ments de syntaxe structurale. Paris : Klincksieck. </p>

</div></div>
</body></html>