<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>POLYMOTS : une base de donn&#233;es de constructions d&#233;rivationnelles en fran&#231;ais &#224; partir de radicaux phonologiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p>POLYMOTS : une base de donn&#233;es de constructions 
d&#233;rivationnelles en fran&#231;ais &#224; partir de radicaux phonologiques 
</p>
<p>Nuria Gala (1), V&#233;ronique Rey (2) 
 
</p>
<p>(1) LIF &#8211; CNRS, Aix &#8211; Marseille Univ., 163 av. de Luminy, 13288 Marseille 
nuria.gala@univ-provence.fr 
</p>
<p>(2) SHADYC &#8211; CNRS, Aix &#8211; Marseille Univ., 29 av. R. Schuman, 13100 Aix 
veronique.rey@univ-provence.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233; Cet article pr&#233;sente POLYMOTS, une base de donn&#233;es lexicale contenant huit 
mille mots communs en fran&#231;ais. L&#8217;originalit&#233; de l&#8217;approche propos&#233;e tient &#224; l'analyse des 
mots. En effet, &#224; la diff&#233;rence d&#8217;autres bases lexicales repr&#233;sentant la morphologie 
d&#233;rivationnelle des mots &#224; partir d&#8217;affixes, ici l&#8217;id&#233;e a &#233;t&#233; d&#8217;isoler un radical commun &#224; un 
ensemble de mots d&#8217;une m&#234;me famille. Nous avons donc analys&#233; les formes des mots et, par 
comparaison phonologique (forme phonique comparable) et morphologique (continuit&#233; de 
sens), nous avons regroup&#233; les mots par familles, selon le type de radical phonologique. 
L&#8217;article pr&#233;sente les fonctionnalit&#233;s de la base et inclut une discussion sur les applications et 
les perspectives d&#8217;une telle ressource. 
</p>
<p>Abstract In this paper we present POLYMOTS, a lexical database containing eight 
thousand common nouns in French. Whereas most of the existing lexicons for derivational 
morphology take affixes as starting point for producing paradigms of words, we defend here 
the idea that it is possible to isolate a morpho-phonological stem and produce a paradigm of 
words belonging to the same family. This point leads us to describe three types of stems 
according to their phonological and morphological form. The article presents the different 
features of such a lexical database and discusses the applications and future work using and 
enriching this resource. 
</p>
<p>Mots-cl&#233;s :   ressource lexicale, morphologie d&#233;rivationnelle, traitement automatique des 
familles de mots. 
</p>
<p>Keywords:   lexical resource, derivational morphology, word families processing. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Gala et V. Rey 
</p>
<p>1 Introduction 
Le travail, d&#233;crit dans cet article, s&#8217;inscrit dans la probl&#233;matique de la construction et de 
l&#8217;utilisation de ressources lexicales. L&#8217;approche propos&#233;e, bien que li&#233;e &#224; la morphologie 
d&#233;rivationnelle, s&#8217;en &#233;loigne dans la mesure o&#249; les formes de base, que nous appelons 
&#171; radicaux phonologiques &#187;, ne sont pas forc&#233;ment des lemmes correspondant &#224; des mots de la 
langue, mais plut&#244;t des formes phonologiques communes &#224; un ensemble de mots de la m&#234;me 
famille, ayant ou non un sens &#233;tabli. 
</p>
<p>Nous pensons que la productivit&#233; morphologique dans la construction lexicale d&#233;pend non 
seulement de la structure de surface des mots (forme sonore imm&#233;diate des mots) mais aussi 
de la structure profonde (r&#232;gle sous jacente rendant compte des constructions irr&#233;guli&#232;res). 
Nous rejoignons ainsi les travaux de Corbin (1987) sur la morphologie d&#233;rivationnelle. Elle 
dit ainsi : 
</p>
<p>&#171; Toute personne qui a acquis la connaissance d&#8217;une langue a int&#233;rioris&#233; un syst&#232;me de 
r&#232;gles qui d&#233;termine des connexions son-sens pour une infinit&#233; de mots construits. (&#8230;) C&#8217;est 
ce syst&#232;me de r&#232;gles qui le rend capable de produire et d&#8217;interpr&#233;ter des mots construits qu&#8217;il 
n&#8217;a jamais rencontr&#233; auparavant.(&#8230;) Chacun comprend et produit des mots construits 
nouveaux sans aucune conscience de leur nouveaut&#233; (&#8230;) &#187; p. 47-48 
</p>
<p>Par ailleurs, Rey-Debove (1982 et 2004) propose un dictionnaire o&#249; les mots seraient class&#233;s 
selon l&#8217;analyse morphologique. En 1982, l&#8217;approche est r&#233;solument synchronique ; en 2004, 
histoire de la langue et analyse synchronique sont pr&#233;sent&#233;es simultan&#233;ment. Selon Rey-
Debove (2004 : 193), &#171; la composante lexicale a r&#233;sist&#233; &#224; l&#8217;&#233;tude synchronique et la 
lexicologie th&#233;orique est surtout historique &#187;. 
</p>
<p>Il s&#8217;agit de l&#8217;analyse des mots en synchronie en radicaux, pr&#233;fixes et suffixes. L&#8217;analyse 
morphologique est de type concat&#233;natoire et ne prend pas en compte les ph&#233;nom&#232;nes 
structuraux, ces derniers &#233;tant d&#233;crits selon une approche diachronique. 
</p>
<p>Cependant, Corbin (1987) montre que l&#8217;analyse morphologique ne doit pas s&#233;parer les deux 
dimensions : des informations historiques peuvent fournir certains renseignements parfois 
n&#233;cessaires et/ou compl&#233;ter une d&#233;faillance dans la comp&#233;tence du morphologue. De plus, les 
mots n&#8217;ont pas le m&#234;me &#226;ge dans le lexique d&#8217;aujourd&#8217;hui : certains, comme &#171; p&#232;re &#187;, sont tr&#232;s 
anciens, d&#8217;autres, comme &#171; informatique &#187;, sont plus r&#233;cents. 
</p>
<p>Notre d&#233;marche teste l&#8217;hypoth&#232;se suivante : &#224; partir d&#8217;un corpus de mots extraits d&#8217;un 
dictionnaire, peut-on construire des familles de mots reposant uniquement sur leur analyse 
structurelle, en tenant compte des contraintes morpho-phonologiques ? L'histoire des mots de 
la langue n'est pas donc &#224; l'origine de leur segmentation en radicaux et affixes, et certains 
rapprochements pourront surprendre le lecteur. Huit mille mots ont &#233;t&#233; ainsi &#233;tudi&#233;s.  
</p>
<p>L&#8217;article est organis&#233; en trois parties : dans la premi&#232;re (section 2) nous montrons quelques 
syst&#232;mes existants en TAL pour la morphologie d&#233;rivationnelle et nous en d&#233;gageons leurs 
sp&#233;cificit&#233;s ; par la suite (section 3) nous d&#233;crivons notre approche, en nous focalisant sur les 
choix linguistiques adopt&#233;s. Enfin, la section 4 est consacr&#233;e &#224; la description des 
fonctionnalit&#233;s de la base et &#224; son &#233;valuation, tout en mettant en perspective les applications 
vis&#233;es &#224; terme : outil p&#233;dagogique pour les enseignants de l'&#233;cole primaire (famille de mots et 
didactique de l'orthographe) ; outil pour construire des bases lexicales pour des &#233;tudes en </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>POLYMOTS :une base de donn&#233;es de constructions d&#233;rivationnelles 
</p>
<p>psycholinguistique et outil pour construire des exercices de rem&#233;diation aupr&#232;s 
d&#8217;orthophonistes. 
</p>
<p>2 Construction de ressources pour la morphologie et TAL 
Dans le domaine de la morphologie d&#233;rivationnelle en TAL, la litt&#233;rature est riche d&#8217;exemples 
d&#8217;outils et de m&#233;thodes. On peut distinguer les approches visant &#224; construire (semi)-
automatiquement une liste de mots d&#233;riv&#233;s &#224; partir d&#8217;une racine, et les approches permettant 
d&#8217;obtenir le lemme racine &#224; partir d&#8217;un mot d&#233;riv&#233;. Quelle que soit l&#8217;optique adopt&#233;e, il existe 
des m&#233;thodes &#224; base de connaissances et des m&#233;thodes &#224; base d&#8217;analogies &#224; partir de corpus.  
</p>
<p>2.1 M&#233;thodes utilisant des listes de r&#233;f&#233;rence 
</p>
<p>Dans cette approche, on utilise des dictionnaires (Savoy, 93) ou des bases lexicales de 
r&#233;f&#233;rence (listes de mots) &#224; partir desquelles, moyennant des r&#232;gles de correspondance, on 
d&#233;coupe les mots candidats selon un lemme de base et une suite d&#8217;affixes. Ainsi par exemple, 
D&#233;riF (Dal et al., 99) est un analyseur morphologique qui effectue l&#8217;analyse d&#233;rivationnelle 
d&#8217;un mot &#233;tiquet&#233; avec des r&#232;gles &#233;labor&#233;es &#224; partir d&#8217;hypoth&#232;ses linguistiques. Ces r&#232;gles 
d&#233;coupent le mot selon des suffixes et/ou pr&#233;fixes et produisent une s&#233;quence &#233;galement 
&#233;tiquet&#233;e avec le mot base (suffix&#233;) et le(s) affixe(s). Par exemple pour &#171; inexplicable &#187; 
l&#8217;analyseur donnera [in [[expliquer VERBE] able ADJ] ADJ]. 
</p>
<p>Dans Cordial (Synapse), logiciel proposant diff&#233;rents traitement linguistiques (correction 
orthographique, grammaticale), une option &#171; Famille de Mots &#187; est propos&#233;e parmi l&#8217;ensemble 
de ressources accessibles (dictionnaires de synonymes, de citations, de locutions de contextes 
d&#8217;apparition de mots, etc.). Pour un mot donn&#233;, base de la famille, ce dictionnaire donne le 
d&#233;tail des constituants des familles (ou liste de termes d&#233;riv&#233;s). La recherche se fait &#224; partir 
d&#8217;un mot base existant dans la langue. Cette ressource est constitu&#233;e  de 15.000 noms propres 
(exemple, &#171; Victor Hugo &#187; produit &#171; hugolien &#187;) et 85.000 noms communs (exemple, 
&#171; parent &#187; est li&#233; &#224; &#171; apparentage &#187;, &#171; apparent&#233; &#187;, etc.). A chaque terme d&#233;riv&#233; lui est associ&#233;e 
sa cat&#233;gorie morphosyntaxique. 
</p>
<p>2.2 M&#233;thodes utilisant des corpus 
</p>
<p>Les m&#233;thodes &#224; base d&#8217;analogies cherchent &#224; v&#233;rifier sur un corpus l&#8217;existence de formes 
d&#233;riv&#233;es cr&#233;es semi-automatiquement &#224; partir d&#8217;une combinaison de mots base et de suffixes 
donn&#233;s. Par exemple, D&#233;Cor (Dal et al., 99) est un outil de construction d&#8217;un lexique 
d&#233;rivationnel qui permet de calculer des bases possibles (d&#8217;un point de vue statistique) &#224; partir 
de formes lexicales contenant des suffixes. Il permet de relier de fa&#231;on syst&#233;matique des 
d&#233;riv&#233;s avec un terme de base existant dans la langue. Par exemple, &#171; imperturbable &#187; sera 
reli&#233; &#224; &#171; perturber &#187; car &#171; perturbable &#187; n&#8217;est pas attest&#233;. 
</p>
<p>Un deuxi&#232;me exemple de ce type de m&#233;thodes &#224; base de corpus est Webaffix (Tanguy et 
Hathout, 02), un outil d&#8217;acquisition de couples de lex&#232;mes morphologiquement li&#233;s. Ici on 
utilise une liste de r&#233;f&#233;rence de termes et on cherche sur le Web des formes lexicales 
nouvelles (absentes de cette liste initiale) en fonction de leur terminaison (suffixes permettant 
de construire des noms d&#8217;action). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Gala et V. Rey 
</p>
<p>Dans cette approche on situe, enfin, les travaux de morphologie orient&#233;s vers la recherche 
d&#8217;information. En tenant compte de cette application pr&#233;cise, le but est l&#8217;obtention de mots 
d&#233;riv&#233;s &#224; partir d&#8217;une racine de fa&#231;on a &#234;tre utilis&#233;s, par exemple, pour &#233;tendre les requ&#234;tes 
(Jacquemin, 97). 
</p>
<p>Ces diff&#233;rentes approches rendent compte de ph&#233;nom&#232;nes linguistiques de surface, &#224; savoir la 
structure imm&#233;diate du lex&#232;me. Cependant, la structure profonde des mots n'est pas 
probl&#233;matis&#233;e. Par exemple, est-il possible de rapprocher dans une m&#234;me famille 
morphologique, des mots comme &#171; filature &#187; et &#171; d&#233;fil&#233; &#187; ? Si l'on s'en tient au sens 
contemporain des mots, non. De plus, on a tendance &#224; consid&#233;rer qu'un rapprochement 
rel&#232;verait davantage de la diachronie, de l'histoire de la langue. Nous avons fait l'hypoth&#232;se 
qu'il serait possible d'appr&#233;hender la structure profonde des mots tout en restant dans la langue 
contemporaine. 
</p>
<p>3 Choix linguistiques 
</p>
<p>Le travail r&#233;alis&#233; jusqu&#8217;&#224; pr&#233;sent, repose sur une liste de vingt mille mots communs extraits 
des 59 000 entr&#233;es du dictionnaire Larousse (2000). Ces mots d&#233;signent soit un objet (concret 
ou abstrait), soit une activit&#233;, soit une qualit&#233; (Rey &amp; Stoffel, 2006). Il s&#8217;agit donc d&#8217;unit&#233;s de 
d&#233;signation. Les noms scientifiques et les noms propres n'ont pas &#233;t&#233; int&#233;gr&#233;s dans cette base. 
En revanche, dans les familles de mots, il est possible de retrouver des d&#233;riv&#233;s de noms 
communs de type adjectif (&#171; anachronique &#187;, &#171; charbonneux &#187;, etc.), verbe (&#171; converser &#187;, 
&#171; soustraire &#187;, etc.) et adverbe (&#171; unanimement &#187;, &#171; accessoirement &#187;, etc.). 
A partir de cette liste initiale de vingt mille mots communs, nous avons analys&#233; manuellement 
huit mille entr&#233;es, de fa&#231;on &#224; les d&#233;composer et &#224; en extraire leur forme de base, au niveau 
structurel. L&#8217;objectif &#233;tait d&#8217;isoler une forme sonore commune aux membres d&#8217;une m&#234;me 
famille et de lister les affixes composant une entr&#233;e donn&#233;e.  Cette approche nous a permis 
d&#8217;obtenir, &#224; ce jour, six cents familles de mots (voir tableau 1, &#167; 3.2). 
Jusqu&#8217;&#224; pr&#233;sent, de nombreux travaux en d&#233;rivation ont essentiellement trait&#233; des affixes et de 
leur g&#233;n&#233;ration automatis&#233;e. Ainsi, Moeschler et Auchlin (2000) rel&#232;vent 60 pr&#233;fixes et 150 
suffixes en langue fran&#231;aise. Cependant, si l'analyse repose sur une nouvelle segmentation des 
mots (analyse structurelle), il est tout &#224; fait possible que l'inventaire et le nombre d'affixes 
soient diff&#233;rents. L&#8217;approche que nous proposons serait alors originale de par le fait que nous 
travaillions sur des &#171; radicaux phonologiques &#187; et que ces derniers donnent un &#233;clairage 
nouveau sur la notion d&#8217;affixe. 
</p>
<p>3.1 Les radicaux phonologiques 
</p>
<p>Le principe de base de la comparaison repose sur le principe de comparaison de forme et de 
sens (quand ce dernier cas est possible). Soit une forme sonore &#171; brume &#187;. Par d&#233;rivation, on 
obtient les mots suivants &#171; embrumer, brumeux, embrun &#187;. Ce dernier mot, &#171; embrun &#187;, a un 
radical phonologique &#171; brun &#187; que l&#8217;on entend dans la s&#233;rie &#171; brune, brunette, bruni, 
brun&#226;tre &#187;. Mais il y a rupture de sens entre la brume et la couleur : la brume n&#8217;est pas brune. 
Nous proposons alors de consid&#233;rer le mot &#171; embrun &#187; uniquement dans la premi&#232;re s&#233;rie. Cet 
exemple est simple. Dans le cas du mot &#171; fin &#187;, entre la fin d&#8217;une histoire et la tranche fine de 
pain, nous proposons une continuit&#233; de sens (il y a de fait une continuit&#233; de forme) et d&#8217;apr&#232;s 
nous, une continuit&#233; s&#233;mantique. Parler de polys&#233;mie serait une solution trop rapide : une </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>POLYMOTS :une base de donn&#233;es de constructions d&#233;rivationnelles 
</p>
<p>&#171; d&#233;finition &#187; est quelque chose d&#8217;achev&#233;, de fini et &#233;galement de pr&#233;cis, de fin. Mais ceci, 
dans le cadre de cette premi&#232;re exploration, d&#233;pend de la subjectivit&#233; linguistique du linguiste. 
Nous souhaiterions &#224; l&#8217;avenir &#233;tablir des traits s&#233;mantiques permettant un travail plus 
syst&#233;matique. 
</p>
<p>Par comparaison phonologique (forme phonique comparable) et morphologique (continuit&#233; de 
sens), nous avons regroup&#233; les mots par familles, sous un &#171; radical phonologique &#187; commun. 
Nous d&#233;finissons ce terme comme une unit&#233; r&#233;currente dans une m&#234;me famille de mots qui 
peut avoir -ou pas- un sens dans la langue.  
</p>
<p>Fradin (2003) montre que le concept de morph&#232;me n'&#233;puise pas les unit&#233;s minimales de 
construction. En effet, des mots peuvent se construire en d&#233;rivation avec des bases sans 
morph&#232;me (si l'on consid&#232;re que le morph&#232;me a toujours une unit&#233; de sens). Par exemple, le 
mot &#171; bikini &#187; a permis la construction du d&#233;riv&#233; &#171; monokini &#187; et pourtant &quot;-kini&quot; n'est pas un 
morph&#232;me et ne fait r&#233;f&#233;rence &#224; aucune base linguistique historique (latine ou grecque). Dans 
ce cas pr&#233;cis, ce sont les affixes qui produisent le sens du mot. Il est donc pertinent de rep&#233;rer 
les bases phonologiques qui permettent de cr&#233;er des familles de mots. Ces derni&#232;res partagent, 
dans un continuum, un sens, mais le radical n'a pas n&#233;cessairement une signification.  
</p>
<p>3.2 Typologie  
</p>
<p>L&#8217;analyse morphologique des huit mille entr&#233;es (rep&#233;rage manuel des radicaux phonologiques 
et des diff&#233;rents affixes) nous a conduit &#224; distinguer trois types de mots : les transparents, les 
alternants et les opaques. 
</p>
<p>Les entr&#233;es dont la forme de base est transparente (TSP) constituent le premier groupe. Pour 
ces mots, le radical a une r&#233;alisation phonique et un sens. Par exemple, la forme de base &#171; fil &#187; 
a un sens et permet de construire soixante-treize d&#233;riv&#233;s (&#171; effiler &#187;, &#171; filature &#187;, &#171; filon &#187;, 
&#171; surfilage &#187;, etc.) 
</p>
<p>Dans le deuxi&#232;me groupe on retrouve les mots dont la forme de base est phonologiquement 
alternante (ALT). Le radical a une variation phonique lors des constructions en d&#233;rivation 
mais maintient le sens. Par exemple, le /f/ de la forme &#171; actif &#187; peut &#234;tre transform&#233;e en /v / en 
d&#233;rivation (&#171; activit&#233; &#187;, &#171; active &#187;, &#171; r&#233;activit&#233; &#187;, etc.) ; le /a/ alterne avec /e/ dans des mots 
comme &#171; pacification &#187; et &#171; paix &#187; ; le /&#8747;/ et le /k/ alternent dans &#171; monarch/monarc &#187; 
(&#171; monarchie &#187;, &#171; monarque &#187;), etc. La liste des alternances vocaliques et consonantiques est 
disponible dans Sabater et Rey (2005).  
</p>
<p>Les mots TSP et ALT ont donc des radicaux morpho-phonologiques puisque ces radicaux ont 
toujours un sens. 
Enfin, on distingue les mots dont la forme de base est opaque (OPAK). Pour ce groupe le 
radical a une r&#233;alisation phonique mais n&#8217;a pas de sens aujourd&#8217;hui. Par exemple, &#171; voc &#187; ne 
signifie rien mais cette forme se retrouve dans &#171; vocal &#187;, &#171; vocaliser &#187;, &#171; &#233;voquer &#187;, 
&#171; invoquer &#187;, &#171; r&#233;voquer &#187;, &#171; vocation &#187;, &#171; provoquer &#187;, etc. Il en va de m&#234;me pour &#171; panta &#187; 
dans &#171; pantalon &#187; et &#171; pantacourt &#187; ; pour &#171; cid &#187; dans &#171; co&#239;ncidence &#187;, &#171; d&#233;cision &#187;, etc.  
</p>
<p>Les huit mille mots trait&#233;s jusqu&#8217;&#224; pr&#233;sent sont distribu&#233;s de la fa&#231;on suivante entre les trois 
cat&#233;gories : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Gala et V. Rey 
</p>
<p>  
</p>
<p>TSP ALT OPAK total 
</p>
<p>Mots d&#233;riv&#233;s 2940 3062 2044 8046 
</p>
<p>Distribution 36,54% 38,06% 25,40%   
</p>
<p>Radicaux 
phonologiques 288 155 158 601 
</p>
<p>Distribution 47,92% 25,79% 26,29%   
</p>
<p> TAB 1. Distribution des types de radicaux morphologiques 
</p>
<p>On constate qu&#8217;il n'y a pas de diff&#233;rence significative entre les trois groupes (test de Fisher 
TSP vs ALT, p = .58 ; TSP vs OPAK p=.78 ; ALT vs OPAK p= .40). Cela signifie donc que 
le nombre de mots est &#233;galement r&#233;parti dans les trois groupes. 
</p>
<p>La cat&#233;gorie de mots la plus repr&#233;sent&#233;e est la cat&#233;gorie ALT : les formes de base sont tr&#232;s 
productives puisque 150 mots produisent 3062 mots, ce qui veut dire qu&#8217;une forme de base 
peut produire environ 19 d&#233;riv&#233;s. Viennent ensuite les mots OPAK, o&#249; une forme de base 
produit environ 13 mots d&#233;riv&#233;s (2044 pour 158 radicaux).  
</p>
<p>Enfin, les moins productifs sont les TSP avec 288 bases pour 2940, c&#8217;est-&#224;-dire qu&#8217;un radical 
produit environ 10 mots d&#233;riv&#233;s. Comme l&#8217;&#233;criture des formes de base est souvent maintenue 
dans toute la famille de mots, cette productivit&#233; est non seulement int&#233;ressante en langue 
orale, mais &#233;galement pour l&#8217;apprentissage de l&#8217;orthographe lexicale.  
</p>
<p>Dans tous les cas, on observe  que la proc&#233;dure de d&#233;rivation est &#233;galement pertinente dans les 
trois groupes. Les noyaux TSP g&#233;n&#232;rent moins de constructions d&#233;rivationnelles et confirment 
par ce fait l'int&#233;r&#234;t d'aborder la structure profonde des mots pour rendre compte de la 
d&#233;rivation. 
</p>
<p>3.3 Informations associ&#233;es aux entr&#233;es lexicales 
</p>
<p>La base ne donne pas, pour l&#8217;instant, d&#8217;autres informations sur les mots de type strictement 
linguistique. Les verbes ne pr&#233;sentent pas une construction d&#233;rivationnelle particuli&#232;re. Les 
rares cas de verbes conjugu&#233;s devenus des mots (comme &#171; rendez-vous &#187;) ne donnent pas de 
d&#233;rivation. De m&#234;me, le pluriel ne g&#233;n&#232;re pas une organisation sp&#233;cifique (par exemple, 
&#171; cheval &#187; et &#171; chevaux &#187; donnent respectivement &#171; chevaucher &#187; et &#171; chevalier &#187;). De plus, les 
r&#232;gles syntaxiques ne s&#8217;appliquent pas sur les principes de la construction lexicale : comme le 
soulignait d&#233;j&#224; Benveniste (1974), le mot &#171; maintenir &#187; place l&#8217;objet &#171; main &#187; avant le verbe 
&#171; tenir &#187;, construction qui est impossible dans le cadre phrastique. Le travail portant 
uniquement sur la construction du lexique, les informations cat&#233;gorielles (nom, verbe, 
adjectif) ou grammaticales (nombre, genre, &#8230;) ne sont donc pas mentionn&#233;es. 
Par ailleurs, ne s&#8217;agissant pas d&#8217;un dictionnaire au sens &#171; classique &#187;, la base ne contient pas 
de d&#233;finitions ou de liens lexicaux entre les entr&#233;es (hyperonymes, synonymes, etc.). Les 
seules informations pertinentes associ&#233;es aux entr&#233;es correspondent aux jeux de construction, 
c&#8217;est-&#224;-dire &#224; la formation morpho-phonologique de chaque entr&#233;e, ainsi qu&#8217;aux liens entre les 
formes d&#8217;une m&#234;me famille. Quelques indices quantitatifs (nombre de mots appartenant &#224; une 
m&#234;me famille, fr&#233;quence d&#8217;apparition d&#8217;un affixe donn&#233;, etc.) sont aussi propos&#233;s.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>POLYMOTS :une base de donn&#233;es de constructions d&#233;rivationnelles 
</p>
<p>4 Fonctionnalit&#233;s de recherche dans la base POLYMOTS 
POLYMOTS propose deux types de fonctionnalit&#233;s : la recherche par mots et la recherche par 
affixes. 
</p>
<p>4.1 Recherche par mots 
</p>
<p>Il est possible de rentrer une forme lexicale et d&#8217;en obtenir plusieurs informations, &#224; savoir, 
son radical phonologique, le type de radical et la liste de mots partageant ce radical de base, 
c&#8217;est-&#224;-dire l&#8217;ensemble des mots de la famille. Nous avons fait le choix d'&#233;crire le radical 
phonologique et les mots d&#233;riv&#233;s selon l'orthographe conventionnelle. Deux raisons motivent 
ce choix: d'une part la lecture est plus ais&#233;e en &#233;criture orthographique et d'autre part, il s'av&#232;re 
qu'il y a souvent un lien entre le radical phonologique et son &#233;criture orthographique. Dans la 
grande majorit&#233; des cas, l'&#233;criture est maintenue dans la construction d&#233;rivationnelle. 
L&#8217;&#233;criture du fran&#231;ais comprend en effet selon Doneux (2001), une part al&#233;atoire et une part 
pr&#233;dictible : l&#8217;&#233;criture des mots &#171; brun &#187; et &#171; cousin &#187; est pr&#233;dictible car le &#171; u &#187; s&#8217;entend dans 
&#171; brune &#187;, et le &#171; i &#187; dans &#171; cousine &#187;. L&#8217;&#233;criture du mot &#171; second &#187; est al&#233;atoire car le &#171; c &#187; ne 
correspond pas &#224; la sortie phonique attendue et ne peut &#234;tre entendue en d&#233;rivation. 
</p>
<p>En l&#8217;&#233;tat des travaux, les affixes ont &#233;t&#233; &#233;crits selon l&#8217;orthographe. Par exemple, le pr&#233;fixe 
inversif &#171; in- &#187; aura ainsi plusieurs graphies : im (impossible), in (inlavable), il (illisible). Un 
travail &#224; venir devra &#233;galement proposer des formes structurelles profondes pour les affixes.  
</p>
<p>Pour chaque mot d&#233;riv&#233;, il est possible de visualiser sa structure morphologique, d&#233;compos&#233;e 
en pr&#233;fixes et suffixes. 
</p>
<p> 
</p>
<p>FIG 1. R&#233;sultats de la recherche pour le mot &#171; confiture &#187;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Gala et V. Rey 
</p>
<p>La figure 1 montre le r&#233;sultat pour les dix premiers mots1 de la famille ayant comme radical 
phonologique &#171; fai/fi &#187; (pour une recherche avec &#171; confiture &#187;). L&#8217;alternant fait/fit est attest&#233; 
dans le paradigme de la conjugaison. La graphie &#171; C &#187; dans le pr&#233;fixe &#171; aC &#187; correspond &#224; une 
consonne qu&#8217;on ne peut pas d&#233;terminer car elle d&#233;pend de la consonne du radical ; il s&#8217;agit du 
m&#234;me pr&#233;fixe avec une assimilation r&#233;gressive, on n&#8217;est donc pas en mesure de sp&#233;cifier la 
forme phonologique de &#171; C &#187; (exemple, &#171; aC &#187; avant la base &#171; fai/fi &#187; fera doubler le &#171; f &#187; ; 
dans &#171; accusateur &#187;, avec la base &#171; cause/cus &#187;, ce sera le &#171; c &#187; etc.).  
</p>
<p>4.2 Recherche par affixes 
</p>
<p>A partir d&#8217;un affixe donn&#233;, la base permet d&#8217;obtenir des renseignements sur sa productivit&#233;, 
c&#8217;est-&#224;-dire, la liste de mots le contenant. Il est aussi possible de lancer une requ&#234;te avec deux 
affixes ; par exemple pour &#8220;ana&#8221; et &#8220;ique&#8221; simultan&#233;ment, on obtiendra &#171; anarchique &#187;, 
&#171; anatomique &#187;, &#171; anamorphique &#187;, etc.  
</p>
<p>Le r&#233;sultat donne, pour chaque entr&#233;e, son radical phonologique, le type de mot et le nombre 
de d&#233;riv&#233;s dans sa famille. 
</p>
<p> 
</p>
<p>FIG 2. R&#233;sultats de la recherche pour l&#8217;affixe &#171; -ence &#187;. 
</p>
<p>La figure 2 montre les 15 premiers r&#233;sultats de la requ&#234;te avec le suffixe &#171; -ence &#187;. 
</p>
<p>A l&#8217;heure actuelle, la base contient plus de six cents affixes r&#233;pertori&#233;s (environ un quart de 
pr&#233;fixes et trois quarts de pr&#233;fixes), les plus productifs &#233;tant repr&#233;sent&#233;s dans le tableau 
suivant :  
</p>
<p>                                                 
</p>
<p>1
 L&#8217;ordre des mots est pour l&#8217;instant al&#233;atoire. Dans la version &#224; venir, les mots appara&#238;tront par ordre 
</p>
<p>alphab&#233;tique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>POLYMOTS :une base de donn&#233;es de constructions d&#233;rivationnelles 
</p>
<p>Pr&#233;fixes   Suffixes   
</p>
<p>d&#233;- 468 -er 1460 
</p>
<p>aC- 450 -ion 622 
</p>
<p>con- 206 -at 618 
</p>
<p>in- 198 -ement 594 
</p>
<p>a- 188 -age 291 
</p>
<p>TAB 2. Productivit&#233; des affixes plus fr&#233;quents. 
</p>
<p>4.3 Evaluation et perspectives 
</p>
<p>A partir du mois de mars 08, cette base sera &#233;valu&#233;e &#224; partir d'une plate-forme de travail 
d&#8217;orthophonistes, afin de valider la pertinence de ces nouvelles familles de mots dans le cadre 
d&#8217;exercies de rem&#233;diation.  
</p>
<p>Par ailleurs, comme les radicaux TSP et OPAK ont une orthographe identique dans toute la 
famille de mots concern&#233;s par ce radical, nous souhaiterions valider cet outil comme un outil 
pour apprendre l'orthographe des mots. Pour les radicaux ALT, un apprentissage explicite 
(didactique) devra &#234;tre r&#233;alis&#233; en milieu scolaire (principe de la lettre de rappel pour indiquer 
le marquage phonologique : &#8220;e&#8221; dans &#171; europ&#233;en &#187; car &#171; europ&#233;enne &#187; ; &#8220;u&#8221; dans &#171; brun &#187; car 
&#171; brune &#187; ; &#8220;a&#8221; dans &#171; paix &#187; car &#171; pacification &#187;&#8230;). Ceci se ferait en lien avec l'apprentissage 
du vocabulaire qui est inscrit dans les recommendations du BO (12 avril 2007, hors-s&#233;rie 
n&#176;5): &quot;certaines approches sont particuli&#232;rement f&#233;condes pour structurer et augmenter le 
vocabulaire disponible. Ainsi en est-il de l'attention &#224; la construction des mots qui permet 
d'accro&#238;tre plus rapidement le vocabulaire disponible. L'enfant d&#233;couvre le sens et la graphie 
des mots d'usage quotidien [&#8230;]&quot;. 
</p>
<p>5 Conclusion 
Dans cet article, nous avons present&#233; une base lexicale de huit mille mots fran&#231;ais qui montre 
des regroupements par familles et permet de visualiser la d&#233;composition des entr&#233;es lexicales 
en diachronie structurelle. Les entr&#233;es ont &#233;t&#233; manuellement analys&#233;es &#224; partir de vingt mille 
mots communs extraits d&#8217;un dictionnaire de langue g&#233;n&#233;rale. L&#8217;approche adopt&#233;e nous a 
permis de proposer trois cat&#233;gories de radicaux phonologiques, en tenant compte des 
caract&#233;ristiques morpho-phonologiques du radical. La distribution entre ces trois cat&#233;gories 
donne trois classes &#233;quilibr&#233;es, bien que ce sont les mots de type alternant et opaque qui ont 
une productivit&#233; plus &#233;l&#233;v&#233;e (respectivement, 19 et 13, alors que les transparents en produisent 
une moyenne de 10).  
</p>
<p>Cela confirme que lors de la construction morphologique, le radical peut avoir ou non une 
signification. Dans le cas des radicaux OPAK, les affixes sont donc vecteurs de signification 
du mot. Ce constat contribue &#224; une refl&#233;xion plus g&#233;n&#233;rale sur l&#8217;analyse morphologique et en 
particulier sur la notion d&#8217;affixe.  Dans le cas des deux autres types de radicaux (TSP et ALT), 
le sens et la forme du radical assurent un continuum &#224; travers tous les mots construits. Par 
exemple, un trait s&#233;mantique du radical &#8220;fil&#8221; s&#8217;entend bien dans le mouvement de rue nomm&#233; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>N. Gala et V. Rey 
</p>
<p>&#8220;d&#233;fil&#233;&#8221;. Ce concept de continuit&#233; s&#233;mantique est une perspective que nous souhaiterions 
poursuivre. La m&#233;thode est donc, d'apr&#232;s nous, valid&#233;e ; reste &#224; savoir si elle constitue un outil 
didactique (enseignant) et clinique (orthophoniste) pour l'apprentissage du vocabulaire et de 
l'orthographe. Des &#233;valuations futures dans ce sens sont sur le point d&#8217;&#234;tre mises en oeuvre. 
Quant &#224; la base elle-m&#234;me, nous avons pr&#233;vu d&#8217;y inclure douze mille mots suppl&#233;mentaires 
analys&#233;s, ainsi que d&#8217;autres fonctionalit&#233;s de recherche (par type de mot, etc.). Une 
automatisation compl&#232;te d&#8217;une telle analyse morphologique ne nous semble pas possible car 
chaque mot est une histoire sociale unique. 
</p>
<p>R&#233;f&#233;rences 
BENVENISTE E. (1974). Comment s&#8217;est form&#233;e une diff&#233;rentiation lexicale en fran&#231;ais. (258-271) in 
Probl&#232;mes de linguistique g&#233;n&#233;rale. Tome 2. Paris: Gallimard. 286 p. 
</p>
<p>CORBIN D. (1987). Morphologie d&#233;rivationnelle et structuration du lexique. Vol. 1. &amp; 2, Coll. Linguistische 
Arbeiten, 193. T&#252;bingen : Max Niemeyer. 
</p>
<p>DAL G., HATHOUT N., NAMMER F. (1999). Construire un lexique d&#233;rivationnel : th&#233;orie et r&#233;alisations. 
Actes de la Conf&#233;rence Traitement Automatique des Langues (TALN 1999), 115-124. Carg&#232;se, France. 
</p>
<p>JACQUEMIN C. (1997). Variation terminologique : reconnaissance et acquisition automatique de termes et de 
leurs variantes en corpus. M&#233;moire d&#8217;habilitation &#224; diriger des recherches, Universit&#233; de Nantes. 
</p>
<p>DONEUX J. L. (2001). L&#8217;&#233;criture du fran&#231;ais : Pr&#233;dictibilit&#233; et Al&#233;a. Texte pr&#233;sent&#233; par V&#233;ronique Rey. 
Publications de l&#8217;Universit&#233; de Provence, 200 p. 
</p>
<p>FRADIN B. (2003). Nouvelles approches en morphologie. Paris : PUF. 347 p. 
</p>
<p>GRUAZ C., HONVAULT R. (2007). Dictionnaire Synchronique des Familles d&#233;rivationnelles de mots fran&#231;ais. 
Limoges : &#233;ditions Lambert-Lucas. 1300 p. 
</p>
<p>MOESCHLER  J., AUCHLIN A. (2000) &#8211; Introduction &#224; la linguistique contemporaine &#8211; Paris : Cursus, 
Armand Colin. 
</p>
<p>REY A. (1998). Dictionnaire historique de la langue fran&#231;aise. Paris : Le Robert. 
</p>
<p>REY V., STOFFEL H. (2006). Propos sur la d&#233;finition du mot : sp&#233;cificit&#233; ou universalit&#233; ?, Actes de SLE 2006, 
Bremen (Allemagne). 
</p>
<p>REY-DEBOVE J. (1982) &#8211; Le Robert M&#233;thodique : Dictionnaire m&#233;thodique du fran&#231;ais actuel &#8211; Paris, 
Dictionnaires Le Robert. 
</p>
<p>REY-DEBOVE J. (2004) &#8211; Le Robert Brio, Dictionnaire g&#233;n&#233;ral et morphologique : analyse m&#233;thodique des 
mots &#8211; Paris, Dictionnaires Le Robert. 
</p>
<p>SABATER C., REY V. (2005). De l&#8217;ortho-phonie &#224; l&#8217;ortho-graphe : le cas de la dict&#233;e L2MA. Glossa, 92, 4-21. 
</p>
<p>SAVOY J. (1993). Stemming of French words based on grammatical categories. Journal of American Society for 
Information Science. 44 (1), 1-9. 
</p>
<p>TANGUY L., HATHOUT N. (2002). Webaffix : un outil d&#8217;acquisition morphologique d&#233;rivationnelle &#224; partir du 
Web. Actes de la Conf&#233;rence Traitement Automatique des Langues (TALN 2002), Nancy, France. 
</p>
<p>ZIEGLER J. C., JACOBS A. M., STONE G. O. (1996). Statistical analysis of the bidirectional inconsistency of 
spelling and sound in French. Behavior research Methods, Instruments and Computers, 28 (4), 504-515. 
Psychonomic Society Inc. </p>

</div></div>
</body></html>