<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;termination des sens d&#8217;usage dans un r&#233;seau lexical construit &#224; l&#8217;aide d&#8217;un jeu en ligne</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p> 
</p>
<p>D&#233;termination des sens d&#8217;usage dans un r&#233;seau lexical 
construit &#224; l&#8217;aide d&#8217;un jeu en ligne 
</p>
<p>Mathieu Lafourcade, Alain Joubert                                                                     
{lafourcade, joubert}@lirmm.fr 
</p>
<p> 
</p>
<p>LIRMM &#8211; Univ. Montpellier 2 - CNRS 
Laboratoire d&#8217;Informatique, de Robotique 
</p>
<p>et de Micro&#233;lectronique de Montpellier 
161, rue Ada &#8211; 34392 Montpellier C&#233;dex 5 &#8211; France 
</p>
<p> 
</p>
<p>Abstract 
Lexical information is indispensable for the tasks realized in NLP, but collecting lexical information is a difficult 
work. Indeed, when done manually, it requires the competence of experts and the duration can be prohibitive. 
When done automatically, the results can be biased by the corpus of texts. The approach we present here consists 
in having people take part in a collective project by offering them a playful application accessible on the web. 
From an already existing base of terms, the players themselves thus build the lexical network, by supplying 
associations which are validated only if they are suggested by a pair of users. Furthermore, these typed relations 
are weighted according to the number of pairs of users who provide them. Finally, we approach the question of 
the word usage determination for a term, by searching relations between this term and its neighbours in the 
network, before briefly presenting the realization and the first obtained results. 
</p>
<p>Keywords :  Natural Language Processing, lexical network, typed and weighted relations, word usage, web-
based game 
</p>
<p>R&#233;sum&#233; 
Les informations lexicales, indispensables pour les t&#226;ches r&#233;alis&#233;es en TALN, sont difficiles &#224; collecter. En effet, 
effectu&#233;e manuellement, cette t&#226;che n&#233;cessite la comp&#233;tence d&#8217;experts et la dur&#233;e n&#233;cessaire peut &#234;tre 
prohibitive, alors que r&#233;alis&#233;e automatiquement, les r&#233;sultats peuvent &#234;tre biais&#233;s par les corpus de textes retenus. 
L&#8217;approche pr&#233;sent&#233;e ici consiste &#224; faire participer un grand nombre de personnes &#224; un projet contributif en leur 
proposant une application ludique accessible sur le web. A partir d&#8217;une base de termes pr&#233;existante, ce sont ainsi 
les joueurs qui vont construire le r&#233;seau lexical, en fournissant des associations qui ne sont valid&#233;es que si elles 
sont propos&#233;es par au moins une paire d&#8217;utilisateurs. De plus, ces relations typ&#233;es sont pond&#233;r&#233;es en fonction du 
nombre de paires d&#8217;utilisateurs qui les ont propos&#233;es. Enfin, nous abordons la question de la d&#233;termination des 
diff&#233;rents sens d&#8217;usage d&#8217;un terme, en analysant les relations entre ce terme et ses voisins imm&#233;diats dans le 
r&#233;seau lexical, avant de pr&#233;senter bri&#232;vement la r&#233;alisation et les premiers r&#233;sultats obtenus. 
</p>
<p>Mots-cl&#233;s :  Traitement Automatique du Langage Naturel, r&#233;seau lexical, relations typ&#233;es pond&#233;r&#233;es, sens 
d&#8217;usage d&#8217;un terme, jeu en ligne 
</p>
<p>1. Introduction 
La connaissance de relations lexicales ou fonctionnelles entre termes est n&#233;cessaire pour 
l&#8217;ex&#233;cution d&#8217;un tr&#232;s grand nombre de t&#226;ches en Traitement Automatique des Langues (TAL). 
Ces relations que l&#8217;on trouve g&#233;n&#233;ralement dans des th&#233;saurus ou des ontologies peuvent &#234;tre 
mises en &#233;vidence de fa&#231;on manuelle ; par exemple, l&#8217;un des plus anciens th&#233;saurus est le 
Roget, sa version actuelle &#233;tant (Kipfer 2001), ou le r&#233;seau lexical le plus c&#233;l&#232;bre est Wordnet 
(Miller 1990). De telles relations peuvent aussi &#234;tre d&#233;termin&#233;es automatiquement &#224; partir de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT 
</p>
<p> 
</p>
<p>corpus de textes, par exemple  (Robertson et Spark Jones 1976) ou (Lapata et Keller 2005), 
dans lesquels sont effectu&#233;es des &#233;tudes statistiques sur les distributions de mots. En outre, 
certaines applications de TAL requi&#232;rent des informations de diff&#233;rentes natures, comme la 
synonymie ou l&#8217;antonymie, mais &#233;galement des relations d&#8217;hyperonymie/hyponymie, 
holonymie/m&#233;ronymie, &#8230; L&#8217;&#233;tablissement de telles relations, s&#8217;il est effectu&#233; manuellement 
par un ensemble d&#8217;experts, n&#233;cessite des ressources (en dur&#233;e et en personnel) qui peuvent 
&#234;tre prohibitives, alors que leur extraction automatique sur un corpus de textes est beaucoup 
trop d&#233;pendante des textes choisis. 
La m&#233;thode d&#233;velopp&#233;e ici s&#8217;appuie sur un syst&#232;me contributif, o&#249; ce sont les utilisateurs qui 
font &#233;voluer la base, au travers d&#8217;une interface pr&#233;sent&#233;e sous forme d&#8217;un jeu. De plus, 
contrairement aux m&#233;thodes classiques qui permettent d&#8217;acqu&#233;rir des informations lexicales 
g&#233;n&#233;ralement statiques, le prototype introduit ici r&#233;alise l&#8217;acquisition d&#8217;informations lexicales 
&#233;volutives. 
Dans cet article, nous pr&#233;sentons les principes d&#8217;un jeu (JeuxDeMots1) visant &#224; construire la 
base de relations. L&#8217;objectif poursuivi ici concerne avant tout la fiabilit&#233; et la qualit&#233; des 
informations recueillies aupr&#232;s des utilisateurs, l&#8217;un des &#233;l&#233;ments-cl&#233; &#233;tant qu&#8217;une relation ne 
peut &#234;tre valid&#233;e que si elle est propos&#233;e par au moins deux utilisateurs. Dans une deuxi&#232;me 
partie, utilisant le r&#233;seau ainsi obtenu, nous abordons la probl&#233;matique de la d&#233;termination de 
la polys&#233;mie d&#8217;usage. 
</p>
<p>2. Construction du r&#233;seau lexical 
2.1. Principe du logiciel 
Afin d&#8217;&#233;viter les &#233;cueils d&#8217;un syst&#232;me o&#249; n&#8217;importe quel utilisateur pourrait &#233;crire n&#8217;importe 
quoi, et donc pour assurer la qualit&#233; et la s&#233;curit&#233; de la base, il a &#233;t&#233; d&#233;cid&#233; que les validations 
des relations propos&#233;es anonymement par un joueur seraient effectu&#233;es par d&#8217;autres joueurs, 
tout autant anonymement. Pratiquement, les validations sont faites par concordance des 
propositions entre paires de joueurs. Ce processus de validation rappelle celui utilis&#233; par (von 
Ahn et Dabbish, 2004) pour l&#8217;indexation d&#8217;images ou plus r&#233;cemment par (Lieberman et al., 
2007) pour la collecte de &#8243;connaissances de bon sens&#8243;. A notre connaissance, il n&#8217;a jamais &#233;t&#233; 
mis en &#339;uvre dans le domaine des r&#233;seaux lexicaux. 
Une partie se d&#233;roule entre deux joueurs, en asynchrone, bas&#233;e sur la concordance de leurs 
propositions. Lorsqu&#8217;un premier joueur que nous appellerons (A) d&#233;bute une partie, une 
consigne concernant un type de comp&#233;tence (synonymes, contraires, domaines &#8230;) est 
affich&#233;e, ainsi qu&#8217;un mot2 M tir&#233; al&#233;atoirement dans une base de mots. Ce joueur (A) a alors 
un temps limit&#233; pour r&#233;pondre en donnant des propositions correspondant, selon lui, &#224; la 
consigne appliqu&#233;e au mot M. Le nombre de propositions qu&#8217;il peut faire est limit&#233; pour 
&#233;viter que des joueurs ne frappent n&#8217;importe quoi le plus rapidement possible : nous 
souhaitons que les joueurs r&#233;fl&#233;chissent &#8243;un minimum&#8243;. Ce m&#234;me mot, avec cette m&#234;me 
consigne, est propos&#233; par la suite &#224; un autre joueur que nous appellerons (B) ; le processus est 
identique. Afin d&#8217;accro&#238;tre l&#8217;aspect ludique, pour toute r&#233;ponse commune dans les 
propositions de (A) et (B), ces deux joueurs gagnent un certain nombre de points. Le calcul de 
ce nombre de points est explicit&#233; en section 2.2. 
</p>
<p>                                                 
</p>
<p>1
 JeuxDeMots est accessible &#224; l&#8217;adresse http://www.lirmm.fr/jeuxdemots. Depuis peu, il existe aussi une version 
</p>
<p>anglaise, ainsi qu&#8217;une version tha&#239; et une version japonaise (toutes deux en cours de d&#233;veloppement), &#224; l&#8217;adresse 
http://www.lirmm.fr/jeuxdemots/world-of-jeuxdemots.php  
2
 Pour la suite de cet article, mot et terme sont consid&#233;r&#233;s comme synonymes, bien qu&#8217;un terme puisse &#234;tre 
</p>
<p>constitu&#233; de plusieurs mots (exemple : pomme de terre ou jeux olympiques). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;termination des sens d&#8217;usage dans un r&#233;seau lexical 
</p>
<p> 
</p>
<p>Pour le mot cible M, nous m&#233;morisons les r&#233;ponses communes aux joueurs (A) et (B). Nous 
ne m&#233;morisons pas les r&#233;ponses propos&#233;es uniquement par l&#8217;un des deux joueurs. Cela permet 
la construction d&#8217;un r&#233;seau lexical reliant les termes par des relations typ&#233;es et pond&#233;r&#233;es, 
valid&#233;es par paires de joueurs. Ces relations sont typ&#233;es par la consigne impos&#233;e aux joueurs ; 
elles sont pond&#233;r&#233;es en fonction du nombre de paires de joueurs qui les ont propos&#233;es, comme 
explicit&#233; en section 2.2. La structure du r&#233;seau lexical que nous cherchons ainsi &#224; obtenir 
s&#8217;appuie sur les notions de n&#339;uds et de relations entre n&#339;uds, telles que rappel&#233;es par 
(Polgu&#232;re, 2006). Chaque n&#339;ud du r&#233;seau est constitu&#233; d&#8217;une unit&#233; lexicale (terme ou 
expression) regroupant toutes ses lexies et les relations entre n&#339;uds traduisent des fonctions 
lexicales, telles que pr&#233;sent&#233;es par (Mel&#8217;&#269;uk et al., 1995). Initialement, les n&#339;uds sont 
constitu&#233;s des termes de notre base de d&#233;part, mais celle-ci peut s&#8217;accro&#238;tre ; effectivement, si 
les deux joueurs (A) et (B) d&#8217;une m&#234;me partie proposent un terme initialement inconnu, alors 
ce terme est ajout&#233; &#224; notre base. La figure 1 pr&#233;sente les relations acquises pour le terme aile.  
 
</p>
<p> relations ==&gt;  
aile ---r_associated:360--&gt; voler 
aile ---r_associated:360--&gt; oiseau 
aile ---r_associated:330--&gt; avion 
aile ---r_associated:240--&gt; plume 
aile ---r_associated:120--&gt; poulet 
aile ---r_associated:110--&gt; vol 
aile ---r_associated:100--&gt; ange 
aile ---r_associated:100--&gt; cuisse 
aile ---r_lieu:80--&gt; oiseau 
aile ---r_holo:80--&gt; oiseau 
aile ---r_holo:80--&gt; avion 
aile ---r_lieu:70--&gt; avion 
aile ---r_associated:70--&gt; planer 
aile ---r_lieu:60--&gt; ange 
aile ---r_holo:60--&gt; aigle 
aile ---r_associated:60--&gt; deltaplane 
aile ---r_syn:60--&gt; aileron 
aile ---r_has_part:60--&gt; plume 
aile ---r_syn:60--&gt; bras 
aile ---r_has_part:60--&gt; os 
aile ---r_associated:60--&gt; pigeon 
aile ---r_holo:50--&gt; voiture 
aile ---r_syn:50--&gt; &#233;lytre 
aile ---r_carac:50--&gt; petite 
aile ---r_lieu:50--&gt; aigle 
aile ---r_associated:50--&gt; bras 
aile ---r_holo:50--&gt; ULM 
aile ---r_associated:50--&gt; moineau 
aile ---r_carac:50--&gt; grande 
aile ---r_associated:50--&gt; ail&#233; 
aile ---r_associated:50--&gt; plumes 
aile ---r_associated:50--&gt; b&#226;timent 
aile ---r_lieu:50--&gt; ciel 
aile ---r_lieu:50--&gt; a&#233;roport 
aile ---r_associated:50--&gt; planeur 
aile ---r_holo:50--&gt; pigeon 
</p>
<p>aile ---r_lieu:50--&gt; pigeon 
aile ---r_associated:50--&gt; voiture 
aile ---r_associated:50--&gt; battre 
aile ---r_has_part:50--&gt; muscle 
aile ---r_associated:50--&gt; insecte 
aile ---r_carac:50--&gt; cass&#233;e 
aile ---r_lieu:50--&gt; vautour 
aile ---r_syn:50--&gt; voilure 
relations &lt;==  
oiseau ---r_associated:170--&gt; aile 
oiseau ---r_has_part:160--&gt; aile 
plume ---r_associated:160--&gt; aile 
rapace ---r_has_part:140--&gt; aile 
papillon ---r_associated:130--&gt; aile 
poulet ---r_associated:110--&gt; aile 
avion ---r_has_part:100--&gt; aile 
insecte ---r_has_part:90--&gt; aile 
volaille ---r_has_part:90--&gt; aile 
nez ---r_has_part:80--&gt; aile 
cuisse ---r_associated:70--&gt; aile 
voler ---r_instr:70--&gt; aile 
plume ---r_holo:60--&gt; aile 
avion ---r_associated:60--&gt; aile 
Ailette ---r_associated:60--&gt; aile 
fr&#233;gate ---r_associated:60--&gt; aile 
Icare ---r_associated:50--&gt; aile 
hu&#238;trier-pie ---r_associated:50--&gt; aile 
toucan ---r_associated:50--&gt; aile 
voilure ---r_syn:50--&gt; aile 
voler ---r_associated:50--&gt; aile 
poule ---r_associated:50--&gt; aile 
battement ---r_associated:50--&gt; aile 
poule ---r_has_part:50--&gt; aile 
deltaplane ---r_has_part:50--&gt; aile 
</p>
<p> 
</p>
<p>Figure 1 : Ensemble des relations acquises pour le terme aile. Sont  pr&#233;sent&#233;es tout d&#8217;abord les 
relations dont le terme aile est origine, puis celles pour lesquelles le terme aile est destinataire. Pour 
chacune de ces relations, on a en outre son type (&quot;id&#233;e associ&#233;e&quot;, &quot;a pour partie&quot; &#8230;) ainsi que son 
poids. Le calcul de cette pond&#233;ration est expliqu&#233; &#224; la section 2.2. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT 
</p>
<p> 
</p>
<p>Il aurait pu &#234;tre envisag&#233; de m&#233;moriser toutes les r&#233;ponses, depuis le d&#233;but du jeu, avec leurs 
fr&#233;quences. Notre base se serait accrue beaucoup plus rapidement, mais cela aurait &#233;t&#233; au 
d&#233;triment de sa qualit&#233;. L&#8217;int&#233;r&#234;t de la solution retenue est de limiter de fa&#231;on beaucoup plus 
drastique les r&#233;ponses &#171; fantaisistes &#187; ou les erreurs dues &#224; une mauvaise compr&#233;hension de la 
consigne, voire du mot M lui-m&#234;me. L&#8217;&#233;mergence des solutions &#171; originales &#187; sera plus lente, 
mais elle se fera tout de m&#234;me, apr&#232;s &#233;limination des solutions les plus courantes, gr&#226;ce au 
processus des termes &#171; tabous &#187;. Effectivement, lorsqu&#8217;une relation mot M &#8594; terme propos&#233; a 
&#233;t&#233; faite par un grand nombre de couples de joueurs, elle devient banale ou taboue ; elle est 
affich&#233;e en m&#234;me temps que le mot M, afin que les joueurs ne la proposent plus. Ainsi, les 
joueurs sont amen&#233;s &#224; faire d&#8217;autres propositions, g&#233;n&#233;ralement plus originales. Ceci favorise 
l&#8217;&#233;mergence de relations plus rares, mais non l&#8217;&#233;mergence d&#8217;erreurs. 
</p>
<p>2.2. Emergence et pond&#233;ration des relations entre termes 
C&#244;t&#233; jeu, il s&#8217;agit de d&#233;finir le nombre de points gagn&#233;s par les joueurs (A) et (B), avec la 
m&#234;me consigne sur un m&#234;me mot M. C&#244;t&#233; r&#233;seau lexical, il s&#8217;agit d&#8217;&#233;tablir des relations entre 
termes, gr&#226;ce aux propositions faites par (A) et (B). Pour cette partie, notons : 
 propositions de (A) : x1, x2, &#8230; xi &#8230; , xn 
 propositions de (B) : y1, y2, &#8230; yj &#8230; , ym 
Pour tous les couples (i,j) tels que xi = yj , nous m&#233;morisons la relation R : M &#8594; xi. 
L&#8217;un des avantages de notre m&#233;thode r&#233;side dans gestion de la pond&#233;ration des relations entre 
termes. En effet, il est possible d&#8217;affecter un poids &#224; la relation R : plus elle a &#233;t&#233; propos&#233;e de 
fois, plus son poids est important. Dans cette premi&#232;re version de notre prototype, nous avons 
envisag&#233; un poids de 50 pour sa premi&#232;re occurrence, puis nous augmentons ce poids de 10 
pour chaque occurrence suivante. Rappelons qu&#8217;une occurrence de R correspond &#224; une 
proposition de R par le joueur (A) ainsi que le joueur (B) lors d&#8217;une m&#234;me partie. A partir 
d&#8217;un certain nombre d&#8217;occurrences, une relation R est bien &#233;tablie : elle devient alors banale, 
ou &#171; taboue &#187;, et elle est indiqu&#233;e en m&#234;me temps que le mot M, afin que les joueurs ne la 
proposent plus. Ce processus permet de faire &#233;merger plus facilement de nouvelles relations ; 
sa cons&#233;quence sur la base est donc une augmentation du taux de rappel3. 
Le nombre de points obtenus par (A) et (B) d&#233;pend du poids de la relation R. Ce nombre de 
points vaut actuellement : 10% (1000 - poids(R)). Plus la relation est r&#233;cente, plus elle a de 
valeur : cela revient &#224; &#171; payer la primaut&#233; &#187;. Cette fonction est d&#233;croissante : une relation 
rapporte de moins en moins de points. A partir d&#8217;un certain seuil, fix&#233; actuellement &#224; 300 pour 
la valeur du poids, la relation devient taboue ; elle est alors indiqu&#233;e en m&#234;me temps que la 
consigne et le mot M  (c&#8217;est une solution donn&#233;e, exemple : aile &#8594; oiseau ou aile &#8594; avion). 
Jouer un mot tabou continue &#224; rapporter des points, mais beaucoup moins : cette proposition 
n&#8217;est plus int&#233;ressante pour les joueurs qui donc sont invit&#233;s &#224; faire d&#8217;autres propositions. 
Avec les valeurs indiqu&#233;es ci-dessus, une relation devient taboue quand elle a &#233;t&#233; propos&#233;e 
par 25 couples de joueurs.  
M&#234;me lorsqu&#8217;une relation devient taboue, son poids n&#8217;est pas fig&#233;, mais il &#233;volue beaucoup 
moins vite car cette relation est propos&#233;e moins souvent par les joueurs. Il est tout de m&#234;me 
int&#233;ressant que le poids de la relation continue d&#8217;&#233;voluer. En effet, au bout d&#8217;un certain temps, 
pour un m&#234;me terme plusieurs relations peuvent &#234;tre taboues. Si elles avaient le m&#234;me poids, 
</p>
<p>                                                 
</p>
<p>3
 D&#8217;apr&#232;s (Salton 1968), le taux de rappel peut &#234;tre d&#233;fini par le rapport du nombre de relations pertinentes 
</p>
<p>trouv&#233;es sur le nombre de relations pertinentes, la pr&#233;cision correspondant au rapport du nombre de relations 
pertinentes trouv&#233;es sur le nombre de relations propos&#233;es. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;termination des sens d&#8217;usage dans un r&#233;seau lexical 
</p>
<p> 
</p>
<p>on ne saurait pas laquelle a atteint cet &#233;tat en premier et donc on ignorerait celle qui est la plus 
&#171; forte &#187;.  
Il a &#233;galement &#233;t&#233; pr&#233;vu un ph&#233;nom&#232;ne d&#8217;&#233;rosion des relations. Effectivement, une relation a 
pu &#234;tre cr&#233;&#233;e &#224; la suite d&#8217;une erreur commune &#224; deux joueurs, ou bien une relation a pu &#234;tre 
conjoncturelle et &#234;tre beaucoup moins forte, donc moins propos&#233;e, par la suite (exemple : 
Paris &#8594; Jeux olympiques). A chaque partie sur un mot M, le poids des relations existantes 
dans notre base &#224; partir de ce mot M qui ne sont propos&#233;es par aucun des deux joueurs est tr&#232;s 
l&#233;g&#232;rement diminu&#233; (actuellement -1). Cela diminuera inexorablement le poids des relations 
accidentelles, mais nous esp&#233;rons que cette &#233;rosion n&#8217;aura qu&#8217;un effet n&#233;gligeable sur les 
relations fortes4. 
</p>
<p>3. D&#233;termination des sens d&#8217;usage 
3.1. Principe g&#233;n&#233;ral 
En premi&#232;re approximation, il est possible de consid&#233;rer que si un terme T est polys&#233;mique, 
les termes qui lui sont reli&#233;s forment plusieurs groupes distincts, chacun de ces groupes 
constituant un sens d&#8217;usage de T. Nous faisons ici la distinction entre les notions de sens 
d&#8217;usage et de sens. La notion de sens d&#8217;usage (appel&#233;e plus commun&#233;ment usage) est 
beaucoup plus fine que celle de sens qui, comme l&#8217;a montr&#233; (V&#233;ronis 2001), est relativement 
pauvre lorsqu&#8217;on se r&#233;f&#232;re aux dictionnaires traditionnels ou &#224; des ressources comme 
WordNet. L&#8217;usage est donc en TALN une notion plus importante que le sens. Pour citer 
l&#8217;exemple que nous prendrons &#224; la section 3.3, aile-plume-oiseau et aile-poulet-cuisse 
constituent deux usages distincts du terme aile, alors qu&#8217;il s&#8217;agit manifestement du m&#234;me sens 
de ce terme. 
</p>
<p>3.2. D&#233;termination des cliques 
Comment d&#233;terminer une clique ? C&#8217;est un ensemble de termes &#171; fortement &#187; reli&#233;s entre eux 
constituant un sous-graphe induit complet (ou clique) dans le r&#233;seau lexical. Les liens qui sont 
consid&#233;r&#233;s ici sont uniquement des relations de type &quot;id&#233;e associ&#233;e&quot; sym&#233;trique. Nous faisons 
abstraction des autres types de relation (&quot;tout de&quot;, &quot;partie de&quot;, &#8230;) en raison de leur caract&#232;re 
non sym&#233;trique. L&#8217;objectif est la construction d&#8217;un r&#233;seau lexical dans lequel chaque n&#339;ud est 
constitu&#233; par un usage d&#8217;un terme, et non plus un terme regroupant ses &#233;ventuels diff&#233;rents 
usages. 
Dans le r&#233;seau lexical, un terme T est directement reli&#233; &#224; n termes : T1,&#8230;,Ti,&#8230;,Tj,&#8230;,Tn. Les 
termes Ti et Tj appartiennent &#224; deux usages diff&#233;rents de T si : 
</p>
<p>poids(Ti-Tj)  &lt;  k * min (poids(T-Ti), poids(T-Tj)) o&#249; k est un coefficient de seuil. 
Nous nous attachons ici aux diff&#233;rents usages du terme T ; le but est donc de regrouper ces n 
termes en un ou plusieurs groupes, chacun constituant un usage de T. 
Les termes Ti1, &#8230; ,Tim constituent le i&#232;me usage de T si les (m+1)*m/2 relations entre ces 
(m+1) termes existent. Ainsi, un terme Tj n&#8217;appartiendra pas &#224; ce i&#232;me usage de T si au moins 
une des relations entre ce terme Tj et l&#8217;un des termes Ti1, &#8230; ,Tim n&#8217;existe pas. 
Il aurait &#233;t&#233; possible de consid&#233;rer, non pas l&#8217;existence ou l&#8217;absence des relations, mais les 
poids relatifs de celles-ci. Dans ce cas, les termes Ti1, &#8230; ,Tim auraient constitu&#233; le i&#232;me usage 
</p>
<p>                                                 
</p>
<p>4
 Ce processus d&#8217;&#233;rosion est encore au stade exp&#233;rimental : nous n&#8217;avons pas assez de recul pour voir ces effets 
</p>
<p>dans la dur&#233;e. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT 
</p>
<p> 
</p>
<p>de T si le poids de chacune des m*(m-1)/2 relations entre deux termes Ti1, &#8230; ,Tim 
quelconques &#233;tait sup&#233;rieur ou &#233;gal &#224; : 
</p>
<p>k * min (poids(T-Ti1), &#8230; ,poids(T-Tim))  
o&#249; la valeur du coefficient k, probablement proche de 1, ne peut &#234;tre donn&#233;e que par 
l&#8217;exp&#233;rience. 
</p>
<p>3.3. Exemple du terme aile 
Les figures 2 et 3 illustrent, sur un exemple simple, les r&#233;sultats obtenus permettant de 
d&#233;terminer les diff&#233;rents usages d&#8217;un m&#234;me terme, ainsi que la pertinence de chacun de ces 
usages (le principe de calcul de cette pond&#233;ration est explicit&#233; &#224; la section 3.4). Il est possible 
de remarquer sur cet exemple qu&#8217;un usage &#233;tant constitu&#233; d&#8217;une clique de termes, et non 
simplement d&#8217;une composante connexe, un m&#234;me terme Ti reli&#233; &#224; T peut appartenir &#224; 
plusieurs cliques et donc un m&#234;me terme Ti peut servir &#224; d&#233;finir plusieurs usages de T. 
 
</p>
<p> 
</p>
<p>Figure 2 : Cette figure montre, autour du terme aile, le r&#233;seau lexical en ne consid&#233;rant que les 
relations de type &quot;id&#233;es associ&#233;es&quot; sym&#233;trique. Ainsi reli&#233;s au terme aile se trouvent six termes qui 
correspondent selon les crit&#232;res d&#233;finis dans cet article &#224; quatre usages. 
</p>
<p>Clique 0: 'aile' 'oiseau' 'plume'  (P = 1970 / nl = 6 / moy = 328 / REL = 361)  
</p>
<p>Clique 1: 'aile' 'oiseau' 'voler'  (P = 1380 / nl = 6 / moy = 230 / REL = 253)  
</p>
<p>Clique 2: 'aile' 'voler' 'avion'  (P = 1030 / nl = 6 / moy = 172 / REL = 189)  
</p>
<p>Clique 3: 'aile' 'poulet' 'cuisse'  (P = 780 / nl = 6 / moy = 130 / REL = 143)  
</p>
<p>Figure 3 : Cette figure montre les quatre usages du terme aile effectivement d&#233;cel&#233;s : 
&#8226; aile-oiseau-plume =&gt; aile : &#233;l&#233;ment de l&#8217;anatomie d&#8217;un oiseau 
&#8226; aile-oiseau-voler =&gt; aile : instrument du vol d&#8217;un oiseau 
&#8226; aile-voler-avion =&gt; aile : partie d&#8217;un avion lui permettant de voler 
&#8226; aile-poulet-cuisse =&gt; aspect gastronomique de l&#8217;aile 
</p>
<p>Pour chacun de ces usages du terme aile figure &#233;galement une &#233;valuation de sa pertinence (valeur 
REL). Le terme aile est polys&#233;mique, les quatre usages ci-dessus correspondent &#224; deux sens distincts : 
aile d&#8217;oiseau et aile d&#8217;avion. On remarquera que notre r&#233;seau n&#8217;est pas encore complet, les sens aile 
de moulin ou aile d&#8217;un b&#226;timent par exemple, n&#8217;y figurent pas. Dans notre r&#233;seau, la relation aile --&gt; 
b&#226;timent existe (voir fig.1), mais elle n&#8217;est pas sym&#233;trique, la relation b&#226;timent --&gt; aile n&#8217;existant pas. 
3.4. Pertinence d&#8217;un usage 
Evaluer la pertinence d&#8217;un usage consiste &#224; obtenir une mesure de son importance &#224; la fois en 
fr&#233;quence mais aussi en couverture lexicale. On &#233;mettra l&#8217;hypoth&#232;se que pour un terme donn&#233; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;termination des sens d&#8217;usage dans un r&#233;seau lexical 
</p>
<p> 
</p>
<p>et en dehors de tout contexte sp&#233;cifique, l&#8217;usage le plus pertinent est celui auquel on pense en 
premier en g&#233;n&#233;ral. Ainsi donc, lors d&#8217;une analyse s&#233;mantique de texte, les usages peuvent 
&#234;tre pond&#233;r&#233;s par d&#233;faut en fonction de leur pertinence a priori. Compte tenu du principe de la 
pond&#233;ration des relations dans notre r&#233;seau lexical, le poids d&#8217;un usage est corr&#233;l&#233; aux poids 
des relations entre les termes de la clique qui caract&#233;rise cet usage. Ainsi, pour une clique C 
de m termes et comprenant le terme T, le poids de l&#8217;usage correspondant sera &#233;gal &#224; : 
 P(C) =  &#8721;i,j poids(Ti,Tj) 
 Rel(C) = Ln(m) * P(C) / [m*(m -1)] 
Le terme poids(Ti,Tj) est le poids de la relation entre Ti etTj. La pertinence est la moyenne des 
poids des relations existant entre les termes, valeur qui exprime la coh&#233;rence de la clique, que 
multiplie le logarithme du nombre de termes impliqu&#233; dans la clique. 
</p>
<p>4. Mise en &#339;uvre et r&#233;sultats 
4.1. R&#233;alisation 
Le logiciel JeuxDeMots a &#233;t&#233; d&#233;velopp&#233; en PHP/MySQL; et certains programmes annexes ont 
&#233;t&#233; r&#233;alis&#233;s en langage JAVA et C++. L&#8217;interface, la comptabilisation de points, mais 
&#233;galement des notions de niveau, honneur, captures de mots, proc&#232;s entre joueurs &#8230; ainsi que 
l&#8217;affichage du classement des joueurs, ont &#233;t&#233; mis en &#339;uvre afin d&#8217;accro&#238;tre l&#8217;aspect attrayant 
du jeu. Le but recherch&#233; est d&#8217;inciter les joueurs &#224; revenir r&#233;guli&#232;rement sur le site, et donc 
d&#8217;augmenter d&#8217;autant le nombre de relations acquises : c&#8217;est l&#8217;int&#233;r&#234;t majeur de cette 
dimension jeu par rapport &#224; un logiciel qui se contenterait de demander des relations &#224; des 
utilisateurs qui, certes, auraient plus conscience de leur r&#244;le d&#8217;&#171;experts &#187;, mais qui, 
probablement, y consacreraient moins de temps. 
</p>
<p>4.2. D&#233;roulement d&#8217;une partie 
Chaque fois qu&#8217;un joueur se connecte au site et d&#233;marre une partie, une consigne est alors 
affich&#233;e pendant quelques secondes (par exemple : &#8243;Donner des id&#233;es associ&#233;es au terme 
suivant&#8243;), avant que le terme sur lequel il doit appliquer cette consigne n&#8217;apparaisse &#224; l&#8217;&#233;cran. 
Ce terme est tir&#233; al&#233;atoirement dans une base d&#8217;environ 150.000 termes. Il a alors une minute 
pour donner ses r&#233;ponses. Si le joueur est (B), il est proc&#233;d&#233; &#224; l&#8217;affichage imm&#233;diat du r&#233;sultat 
de la partie : propositions qu&#8217;avait faites le joueur (A) et nombre de points gagn&#233;s. S&#8217;il est 
joueur (A), ces informations lui seront envoy&#233;es par mail apr&#232;s que (B) ait jou&#233;. Les parties 
propos&#233;es au joueur sont soit des parties en cr&#233;ation o&#249; il est joueur (A), soit des parties &#224; finir 
pour lesquelles il est joueur (B). Il y a donc en permanence un ensemble de parties &#224; finir. 
Si, &#224; l&#8217;affichage d&#8217;un mot et de la consigne, un joueur estime n&#8217;avoir aucune id&#233;e, il a la 
possibilit&#233; de &#171; passer &#187; : la partie se termine alors pr&#233;matur&#233;ment. L&#8217;absence de r&#233;ponse du 
joueur peut avoir deux causes principales : soit le terme n&#8217;est pas un terme courant (par 
exemple : &#8243;gnomon&#8243;), soit la consigne appliqu&#233;e &#224; ce terme n&#8217;a pas une grande signification 
(par exemple : &#8243;contraires de pigeon ?&#8243;). Le syst&#232;me m&#233;morise alors le fait que ce terme est 
peu productif, en particulier par rapport &#224; cette consigne ; ce terme appliqu&#233; &#224; cette consigne 
sera moins souvent propos&#233;. 
Toute partie cr&#233;&#233;e avec un joueur (A) g&#233;n&#232;re deux parties &#224; finir avec des joueurs (B). En 
effet, si tel n&#8217;&#233;tait pas le cas, il suffirait que le joueur (B) passe le mot sans faire de 
proposition pour initier un sentiment de frustration chez le joueur (A), ce qui le d&#233;motiverait &#224; 
revenir participer. Il est donc propos&#233; &#224; tout joueur qui se connecte un plus grand nombre de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT 
</p>
<p> 
</p>
<p>parties &#224; finir que de parties en cr&#233;ation ; cela est plus motivant pour le joueur qui donc voit 
plus souvent le r&#233;sultat imm&#233;diat de ses propositions. 
Afin de permettre &#224; tout joueur de se comparer aux autres membres de la communaut&#233;, il est 
possible d&#8217;afficher un tableau r&#233;capitulatif des joueurs enregistr&#233;s, avec leurs performances, 
par ordre de classement selon les points d&#8217;honneur, ainsi que les meilleurs scores obtenus sur 
une partie. 
</p>
<p>4.3. R&#233;sultats 
Cette premi&#232;re version de JeuxDeMots est relativement r&#233;cente : son lancement a eu lieu en 
juillet 2007. En environ six mois, plus de 500 joueurs se sont enregistr&#233;s et la plupart d&#8217;entre 
eux se connectent plusieurs fois par semaine. 50.000 parties ont &#233;t&#233; jou&#233;es : elles ont fait 
&#233;merger pr&#232;s de 70.000 relations, dont 32.000 de type &quot;id&#233;es associ&#233;es&quot;. Actuellement, plus 
de 600 relations sont taboues, soit pr&#232;s de 1% du nombre total de relations. Il y a une 
&#233;mergence rapide des relations et on constate que les plus fortes sont statistiquement cr&#233;&#233;es en 
premier. L&#8217;&#233;volution de la base de termes est n&#233;cessairement plus lente : elle compte &#224; ce jour 
environ 154.000 termes ; les joueurs y ont d&#233;j&#224; ajout&#233; plus de 2.000 nouveaux termes, 
principalement conjoncturels ou li&#233;s &#224; l&#8217;actualit&#233;. La figure 4 pr&#233;sente un exemple partiel du 
r&#233;seau lexical obtenu. 
 
</p>
<p> 
</p>
<p>Figure 4 : Exemple partiel  du r&#233;seau lexical avec une distance de 2, c&#8217;est-&#224;-dire que l&#8217;on pr&#233;sente un 
terme central (ici : deltaplane), tous les termes directement reli&#233;s &#224; ce terme central, ainsi que tous les 
termes qui leur sont reli&#233;s. On constate que l&#8217;une des relations principales est deltaplane &#8594; aile, d&#8217;o&#249; 
l&#8217;affichage des relations au d&#233;part de aile. Les n&#339;uds correspondant &#224; des termes tr&#232;s g&#233;n&#233;raux (ici : 
aile ou toile) sont des &#171; hubs &#187; dans le r&#233;seau, destinataires d&#8217;un grand nombre de relations. Le 
graphe pr&#233;sent&#233; ici ne tient pas compte de la direction des relations.  
</p>
<p>Nous avons compar&#233; les r&#233;sultats obtenus &#224; ce jour gr&#226;ce &#224; JeuxDeMots (JDM) avec les 
donn&#233;es d&#8217;Euro Wordnet Fran&#231;ais (EWF). JDM poss&#232;de environ 6 fois plus de termes 
qu&#8217;EWF qui en comporte environ 23.000. Par contre, EWF est l&#233;g&#232;rement plus riche au 
niveau des relations : il en compte actuellement un peu plus de 100.000 ; mais le nombre de 
relations dans JDM est en progression d&#8217;environ 10.000 relations suppl&#233;mentaires par mois. 
JDM devrait donc prochainement atteindre le m&#234;me nombre de relations qu&#8217;EWF.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;termination des sens d&#8217;usage dans un r&#233;seau lexical 
</p>
<p> 
</p>
<p>En ce qui concerne la d&#233;termination des usages d&#8217;un terme, la figure 3, ainsi que les annexes 
ci-apr&#232;s, montrent des exemples de cliques d&#233;tect&#233;es dans le r&#233;seau lexical, avec leurs poids 
respectifs (poids total de la clique et moyenne des poids de ses relations). Nous indiquons 
&#233;galement le nombre de relations &quot;id&#233;e associ&#233;e&quot; dont ce terme est origine, avant de lister 
parmi ces relations celles qui sont sym&#233;triques, avec leur poids. 
Nous avons effectu&#233; des mesures sur les 1000 termes les plus fr&#233;quemment propos&#233;s par les 
joueurs. Nous avons divis&#233; les termes en quatre quartiles en fonction de leur fr&#233;quence 
d&#8217;utilisation dans le jeu par les joueurs. Nous avons obtenu les r&#233;sultats reproduits sur le 
tableau de la figure 5 (extraits &#224; mi f&#233;vrier 2008) : 
 
</p>
<p>quartile NB termes NB moy cliques &lt;100 100-199 200-299 &gt;300 
</p>
<p>Q1 66 8.5 2.4 3.8 1.7 0.6 
</p>
<p>Q2 169 4.9 1.9 1.9 0.88 0.26 
</p>
<p>Q3 299 3.4 1.4 1.2 0.6 0.2 
</p>
<p>Q4 466 1.8 1 0.6 0.2 &lt;0.1 
</p>
<p>Figure 5 : Les donn&#233;es de ce tableau correspondent aux 1000 termes les plus fr&#233;quemment rencontr&#233;s 
dans JDM. Leurs fr&#233;quences d&#8217;utilisation ont &#233;t&#233; divis&#233;es en quatre quartiles sur la fr&#233;quence, Q1 
correspondant aux termes dont la fr&#233;quence d&#8217;utilisation est la plus &#233;lev&#233;e. Pour chaque quartile, 
nous avons indiqu&#233; le nombre de termes, le nombre moyen de cliques (donc d&#8217;usages) de chaque 
terme, ainsi que la r&#233;partition des pertinences de ces cliques.  
</p>
<p>On observe donc qu&#8217;en moyenne  plus un terme est utilis&#233; fr&#233;quemment, plus il a d&#8217;usages 
diff&#233;rents. Ce n&#8217;est certes pas une d&#233;couverte lexicale, mais que cela soit observ&#233; dans les 
donn&#233;es issues de JeuxDeMots est un indice positif sur la validit&#233; linguistique de celles-ci. Ce 
r&#233;sultat s&#8217;explique aussi par le taux plus faible de parties jou&#233;es sur les termes rares que pour 
les termes fr&#233;quents. Les cliques dont la pertinence est tr&#232;s faible (&lt; 100) rel&#232;vent de sens peu 
d&#233;couvert ou d&#8217;hapax. Seules les cliques raisonnablement form&#233;es (&gt; 200) peuvent  &#234;tre 
consid&#233;r&#233;es comme correspondant &#224; des usages pertinents. 
</p>
<p>5. Conclusion 
Le prototype JeuxDeMots est un jeu en ligne sur le web dont l&#8217;objectif est la construction 
d&#8217;un r&#233;seau lexical. L&#8217;&#233;mergence de relations typ&#233;es et pond&#233;r&#233;es entre termes s&#8217;effectue 
gr&#226;ce au concours d&#8217;un grand nombre d&#8217;utilisateurs dont l&#8217;activit&#233; a pour effet de bord la 
construction de ce r&#233;seau. Ces utilisateurs ne sont certes pas des linguistes, mais nous pensons 
que leur nombre permettra d&#8217;obtenir un r&#233;seau &#233;volutif de bonne qualit&#233;, avec une couverture 
satisfaisante de l&#8217;ensemble des connaissances g&#233;n&#233;rales. Notre but n&#8217;est pas la constitution 
d&#8217;une base d&#8217;experts, mais d&#8217;une base de connaissances &#8243;moyennes&#8243;, repr&#233;sentant une culture 
g&#233;n&#233;rale commune. 
De plus, au vu des r&#233;sultats actuels, bien que r&#233;cents et n&#233;cessairement partiels, nous pensons 
arriver &#224; s&#233;parer les diff&#233;rents sens d&#8217;usage parmi ceux repr&#233;sent&#233;s pour chaque terme du 
r&#233;seau. Ce dernier travail n&#8217;en est qu&#8217;&#224; ses d&#233;buts : il serait possible de consid&#233;rer en plus de 
la relation &quot;id&#233;e associ&#233;e&quot;  d&#8217;autres relations sym&#233;triques  dans la d&#233;termination des cliques5, 
ou pourquoi ne pas aussi consid&#233;rer les quasi-cliques (sous-graphe induit presque complet) 
                                                 
</p>
<p>5
 Nous avons r&#233;cemment impl&#233;ment&#233; une version de notre logiciel dans laquelle nous consid&#233;rons les relations 
</p>
<p>de tout type pour d&#233;terminer les cliques, mais nous n&#8217;avons pu encore faire d&#8217;&#233;valuation &#224; ce sujet. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mathieu LAFOURCADE, Alain JOUBERT 
</p>
<p> 
</p>
<p>dans la d&#233;termination des usages d&#8217;un terme. Pour un m&#234;me terme, deux cliques qui ont une 
forte proportion de termes en commun correspondent-elles r&#233;ellement &#224; deux usages distincts 
de ce terme ? Cette question reste actuellement ouverte : il est possible que, malgr&#233; 
l&#8217;&#233;volution de notre r&#233;seau, des cliques actuellement s&#233;par&#233;es ne fusionneront pas, alors qu&#8217;on 
peut manifestement les consid&#233;rer comme un m&#234;me usage. Par exemple, pour le terme ciel, 
parmi les cliques existantes on trouve ciel-nuage-gris et ciel-nuage-soleil qui ne fusionneront 
probablement pas, car la relation soleil-gris a peu de chances d&#8217;&#233;merger. Ce biais est-il induit 
par notre m&#233;thodologie ou est-il d&#251; &#224; la repr&#233;sentation en r&#233;seau lexical ? 
</p>
<p>R&#233;f&#233;rences 
vonAhn L. et Dabbish L. (2004) Labelling Images with a Computer Game. In ACM Conference on 
</p>
<p>Human Factors in Computing Systems (CHI), pp. 319-326. 
Kipfer B.A. (2001).  Roget&#8217;s International Thesaurus, sixth edition, Harper Resource (First Edition : 
</p>
<p>1852) 
Lapata M. et Keller F. (2005) Web-based Models for Natural Language Processing. In ACM 
</p>
<p>Transactions on Speech and Language Processing, vol.2, n&#176;1, pp. 1-30. 
Lieberman H., Smith D.A. and Teeters A. (2007) Common Consensus: a web-based game for 
</p>
<p>collecting commonsense goals, International Conference on Intelligent User Interfaces (IUI&#8217;07), 
Hawaii, USA 
</p>
<p>Mel&#8217;&#269;uk I.A., Clas A., Polgu&#232;re A. (1995) Introduction &#224; la lexicologie explicative et combinatoire, 
Editions Duculot AUPELF-UREF 
</p>
<p>Miller G.A., Beckwith R., Fellbaum C., Gross D. and Miller K.J. (1990) Introduction to WordNet: an 
on-line lexical database. In: International Journal of Lexicography 3 (4), pp. 235-244. 
</p>
<p>Polgu&#232;re A. (2006) Structural properties of Lexical Systems: Monolingual and Multilingual 
Perspectives. Proceedings of the Workshop on Multilingual Language Resources and 
Interoperability (COLING/ACL 2006), Sydney, pp. 50-59. 
</p>
<p>Robertson S. et Spark Jones K. (1976) Relevance weighting of search terms, Journal of the American 
Society for Information Science, n&#176; 27, pp. 129-146. 
</p>
<p>Salton G. (1968) Automatic Information Organization and Retrieval, Mac Graw Hill, NY. 
V&#233;ronis J. (2001) Sense tagging: does it make sense? Corpus linguistics&#8217; 2001 Conference, Lancaster, 
</p>
<p>U.K. 
</p>
<p>Annexes 
Ci-apr&#232;s, les diff&#233;rents usages actuellement d&#233;cel&#233;s dans notre r&#233;seau lexical pour le terme 
ciel. Il parait peu probable que les cliques 1:ciel-nuage-gris et 2:ciel-nuage-soleil puissent 
fusionner, alors que les cliques 5:ciel-soleil-astronomie et 6:ciel-soleil-&#233;toile fusionneront 
probablement prochainement. 
</p>
<p>ciel ---r_associated#0:280--&gt; nuage 
ciel ---r_associated#0:270--&gt; bleu 
ciel ---r_associated#0:200--&gt; soleil 
ciel ---r_associated#0:130--&gt; avion 
ciel ---r_associated#0:130--&gt; oiseau 
ciel ---r_associated#0:110--&gt; &#233;toile 
ciel ---r_associated#0:60--&gt; gris 
ciel ---r_associated#0:50--&gt; astronomie 
</p>
<p>0: 'ciel' 'bleu'  
(P = 780 / nl = 2 / moy = 390 / REL =270)  
</p>
<p>1: 'ciel' 'nuage' 'gris'  
(P = 680 / nl = 6 / moy = 113 / REL =125)  
2: 'ciel' 'nuage' 'soleil'  
(P = 860 / nl = 6 / moy = 143 / REL =157)  
3: 'ciel' 'avion'  
(P = 200 / nl = 2 / moy = 100 / REL =69)  
4: 'ciel' 'oiseau'  
(P = 180 / nl = 2 / moy = 90 / REL =62)  
5: 'ciel' 'soleil' 'astronomie'  
(P = 510 / nl = 6 / moy = 85 / REL =93)  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;termination des sens d&#8217;usage dans un r&#233;seau lexical 
</p>
<p> 
</p>
<p>6: 'ciel' 'soleil' '&#233;toile'  
(P = 860 / nl = 6 / moy = 143 / REL =157)  
</p>
<p> 
</p>
<p>Ci-dessous, sont donn&#233;s quelques exemples montrant les diff&#233;rents usages d&#233;cel&#233;s. 
 
</p>
<p>verre ---r_associated#0:100--&gt; boire 
verre ---r_associated#0:70--&gt; vin 
verre ---r_associated#0:70--&gt; vitre 
verre ---r_associated#0:60--&gt; boisson 
verre ---r_associated#0:50--&gt; fen&#234;tre 
</p>
<p>0: 'verre' 'boire' 'vin' 'boisson'  
(P = 950 / nl = 12 / moy = 79 / REL =110)  
</p>
<p>1: 'verre' 'vitre' 'fen&#234;tre'  
(P = 880 / nl = 6 / moy = 147 / REL =161)  
</p>
<p> 
</p>
<p>barreau ---r_associated#0:140--&gt; avocat 
barreau ---r_associated#0:120--&gt; prison 
barreau ---r_associated#0:80--&gt; chaise 
barreau ---r_associated#0:60--&gt; prisonnier 
</p>
<p>0: 'barreau' 'avocat'  
(P = 200 / nl = 2 / moy = 100 / REL = 69)  
</p>
<p>1: 'barreau' 'prison' 'prisonnier'  
(P = 820 / nl = 6 / moy = 137 / REL = 150)  
</p>
<p>2: 'barreau' 'chaise'  
(P = 140 / nl = 2 / moy = 70 / REL = 49)  
</p>
<p> 
</p>
<p>cuisse ---r_associated#0:140--&gt; jambe 
cuisse ---r_associated#0:130--&gt; poulet 
cuisse ---r_associated#0:100--&gt; aile 
</p>
<p>0: 'cuisse' 'poulet' 'aile'  
(P = 780 / nl = 6 / moy = 130 / REL = 143)  
</p>
<p>1: 'cuisse' 'jambe'  
(P= 190 / nl = 2 / moy = 95 / REL = 66)  
</p>
<p> 
</p>
<p>plume ---r_associated#0:750--&gt; oiseau 
plume ---r_associated#0:210--&gt; l&#233;ger 
plume ---r_associated#0:160--&gt; aile 
plume ---r_associated#0:150--&gt; stylo 
plume ---r_associated#0:150--&gt; &#233;crire 
plume ---r_associated#0:140--&gt; encre 
plume ---r_associated#0:100--&gt; oreiller 
plume ---r_associated#0:60--&gt; poids 
plume ---r_associated#0:50--&gt; chatouiller 
</p>
<p>0: 'plume' 'oiseau' 'aile'  
(P = 1970 / nl = 6 / moy = 328 / REL =361)  
</p>
<p>1: 'plume' 'l&#233;ger' 'poids'  
(P = 620 / nl = 6 / moy = 103 / REL =114)  
</p>
<p>2: 'plume' 'stylo' '&#233;crire' 'encre'  
(P = 1320 / nl = 12 / moy = 110 / REL =152)  
</p>
<p>3: 'plume' 'oreiller'  
(P = 170 / nl = 2 / moy = 85 / REL =59)  
</p>
<p>4: 'plume' 'chatouiller'  
(P = 100 / nl = 2 / moy = 50 / REL =35) 
</p>
<p> 
</p>
<p>parfum ---r_associated#0:430--&gt; odeur 
parfum ---r_associated#0:210--&gt; senteur 
parfum ---r_associated#0:100--&gt; odorat 
parfum ---r_associated#0:90--&gt; fleur 
parfum ---r_associated#0:90--&gt; nez 
parfum ---r_associated#0:90--&gt; sentir 
parfum ---r_associated#0:60--&gt; essence 
</p>
<p>0: 'parfum' 'odeur' 'senteur' 'odorat' 'nez' 'sentir'  
(P = 3980 / nl = 30 / moy = 133 / REL = 238)  
</p>
<p>1: 'parfum' 'fleur'  
(P = 140 / nl = 2 / moy = 70 / REL = 49)  
</p>
<p>2: 'parfum' 'essence'  
(P = 130 / nl = 2 / moy = 65 / REL = 45)  
</p>
<p> 
</p>
<p> 
</p>
<p> </p>

</div></div>
</body></html>