<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Construction d&#8217;un wordnet libre du fran&#231;ais &#224; partir de ressources multilingues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Construction d&#8217;un wordnet libre du fran&#231;ais
&#224; partir de ressources multilingues
</p>
<p>Beno&#238;t Sagot1 Darja Fi&#353;er2
</p>
<p>(1) Alpage, INRIA / Paris 7, 30 rue du Ch. des rentiers, 75013 Paris, France
(2) Fac. des Lettres, Univ. de Ljubljana, A&#353;kerc&#780;eva 2, 1000 Ljubljana, Slov&#233;nie
</p>
<p>benoit.sagot@inria.fr, darja.fiser@guest.arnes.si
</p>
<p>R&#233;sum&#233;. Cet article d&#233;crit la construction d&#8217;un Wordnet Libre du Fran&#231;ais (WOLF) &#224;
partir du Princeton WordNet et de diverses ressources multilingues. Les lex&#232;mes polys&#233;miques
ont &#233;t&#233; trait&#233;s au moyen d&#8217;une approche reposant sur l&#8217;alignement en mots d&#8217;un corpus parall&#232;le
en cinq langues. Le lexique multilingue extrait a &#233;t&#233; d&#233;sambigu&#239;s&#233; s&#233;mantiquement &#224; l&#8217;aide
des wordnets des langues concern&#233;es. Par ailleurs, une approche bilingue a &#233;t&#233; suffisante pour
construire de nouvelles entr&#233;es &#224; partir des lex&#232;mes monos&#233;miques. Nous avons pour cela extrait
des lexiques bilingues &#224; partir de Wikip&#233;dia et de th&#233;saurus. Le wordnet obtenu a &#233;t&#233; &#233;valu&#233; par
rapport au wordnet fran&#231;ais issu du projet EuroWordNet. Les r&#233;sultats sont encourageants, et
des applications sont d&#8217;ores et d&#233;j&#224; envisag&#233;es.
</p>
<p>Abstract. This paper describes the construction of a freely-available wordnet for French
(WOLF) based on Princeton WordNet by using various multilingual resources. Polysemous
words were dealt with an approach in which a parallel corpus for five languages was word-
aligned and the extracted multilingual lexicon was disambiguated with the existing wordnets
for these languages. On the other hand, a bilingual approach sufficed to acquire equivalents
for monosemous words. Bilingual lexicons were extracted from Wikipedia and thesauri. The
merged wordnet was evaluated against the French WordNet. The results are promising, and
applications are already intended.
</p>
<p>Mots-cl&#233;s : Wordnet, corpus align&#233;s, Wikip&#233;dia, s&#233;mantique lexicale.
</p>
<p>Keywords: Wordnet, aligned corpora, Wikipedia, lexical semantics.
</p>
<p>1 Introduction
</p>
<p>Wordnet (Fellbaum, 1998) est une base de donn&#233;es lexicale &#224; large couverture, dans laquelle
les mots sont r&#233;partis en cat&#233;gories et organis&#233;s en une hi&#233;rarchie de n&#339;uds. Chaque n&#339;ud a un
identifiant unique, et repr&#233;sente un concept, ou synset (ensemble de synonymes). Il regroupe un
certain nombre de lex&#232;mes synonymes d&#233;notant ce concept. Ainsi, dans le Princeton WordNet
(voir ci-dessous), le synset ENG20-02853224-n comprend les lex&#232;mes {car, auto, automobile,
machine, motorcar}. Les synsets sont pr&#233;cis&#233;s par une br&#232;ve d&#233;finition et sont li&#233;s &#224; d&#8217;autres
synsets (ainsi, ce synset est li&#233; au synset {motor vehicle, automotive vehicle} par un lien d&#8217;hyp&#233;-
ronymie, et au synset {cab, hack, taxi, taxicab} par un lien d&#8217;hyponymie). Les lex&#232;mes peuvent
&#234;tre simples ou compos&#233;s. Les usages m&#233;taphoriques et idiomatiques sont pris en compte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Darja Fi&#353;er
</p>
<p>Historiquement, le premier wordnet est le Princeton WordNet (PWN), d&#233;velopp&#233; pour l&#8217;anglais
&#224; la Princeton University. Au fil du temps, il est devenu une des ressources les plus utiles pour de
nombreuses applications de compr&#233;hension et d&#8217;interpr&#233;tation automatique des langues, telles
que la d&#233;sambigu&#239;sation s&#233;mantique, l&#8217;extraction d&#8217;informations, la traduction automatique, la
classification de documents et le r&#233;sum&#233; de textes. Ceci a provoqu&#233; le d&#233;veloppement de word-
nets pour de nombreuses autres langues (Vossen, P., 1999; Tufis&#807;, 2000).
</p>
<p>&#192; l&#8217;heure actuelle, la Global WordNet Association1 r&#233;pertorie des wordnets pour plus de 50
langues. Bien que la construction manuelle d&#8217;un wordnet produise les meilleurs r&#233;sultats en
termes de pertinence et de pr&#233;cision linguistiques, une telle entreprise est tr&#232;s co&#251;teuse en temps
et en ressources. C&#8217;est pourquoi des approches semi-automatiques ou totalement automatiques
ont &#233;t&#233; propos&#233;es, qui tirent parti des ressources existantes. Mis &#224; part le &#171; goulot d&#8217;&#233;tranglement
de l&#8217;acquisition de connaissance &#187; (knowledge acquisition bottleneck), un probl&#232;me majeur au
sein de la communaut&#233; wordnet est la disponibilit&#233; des wordnets d&#233;velopp&#233;s. Actuellement,
seuls quelques-uns d&#8217;entre eux sont librement disponibles (le PWN, mais &#233;galement les word-
nets de l&#8217;arabe, de l&#8217;h&#233;breu et de l&#8217;irlandais). Bien qu&#8217;un wordnet pour le fran&#231;ais ait &#233;t&#233; d&#233;ve-
lopp&#233; dans le cadre du projet EuroWordNet (EWN), il ne comporte que des lex&#232;mes verbaux et
nominaux, mais ni adjectif ni adverbe. De plus, il n&#8217;a pas &#233;t&#233; largement utilis&#233;, principalement
en raison de probl&#232;mes de licence. Enfin, aucun projet n&#8217;a pris le relais pour poursuivre l&#8217;ex-
tension et l&#8217;am&#233;lioration de cet EWN fran&#231;ais (Jacquin et al., 2007). Ce sont l&#224; les motivations
du travail pr&#233;sent&#233; dans cet article : exploiter les ressources multilingues librement disponibles
pour construire automatiquement un wordnet &#224; large couverture et librement disponible pour le
fran&#231;ais, nomm&#233; WOLF (Wordnet Libre du Fran&#231;ais)2.
</p>
<p>Cet article est organis&#233; comme suit : une br&#232;ve description des travaux ant&#233;rieurs est fournie &#224;
la section suivante. La section 3 d&#233;crit la m&#233;thodologie utilis&#233;e. La section 4 d&#233;crit et &#233;value la
ressource obtenue. La derni&#232;re section pr&#233;sente les conclusions et les perspectives envisag&#233;es.
</p>
<p>2 Travaux ant&#233;rieurs
</p>
<p>On peut r&#233;partir les techniques automatiques de d&#233;veloppement ou d&#8217;aide au d&#233;veloppement
de wordnets en deux familles : les approches par fusion (merge approach) et les approches par
extension (extend approach). Les approches par fusion, o&#249; l&#8217;on construit un wordnet &#224; partir de
ressources monolingues avant de le mettre en relation avec d&#8217;autres wordnets, sont tr&#232;s com-
plexes et co&#251;teuses en ressources. Nous avons donc opt&#233; pour l&#8217;approche par extension (Vossen,
P., 1999). Cette approche prend en entr&#233;e un ensemble donn&#233; de synsets du Princeton WordNet
(PWN) et les traduit dans la langue cible, en pr&#233;servant la structure du PWN. L&#8217;inconv&#233;nient de
l&#8217;approche par extension est que les wordnets obtenus sont biais&#233;s par rapport au PWN, ce qui
est moins probl&#233;matique lorsque les langues source et cible ne sont pas trop &#233;loign&#233;es l&#8217;une de
l&#8217;autre, comme c&#8217;est le cas pour l&#8217;anglais et le fran&#231;ais. C&#8217;est en raison de sa grande simplicit&#233;
que l&#8217;approche par extension a &#233;t&#233; utilis&#233;e dans nombre de projets, tels que BalkaNet (Tufis&#807;,
2000) et MultiWordNet (Pianta et al., 2002).
</p>
<p>Les &#233;quipes de recherche d&#233;veloppant des wordnets de cette fa&#231;on tirent parti de toutes les
ressources &#224; leur disposition, qu&#8217;il s&#8217;agisse de dictionnaires &#233;lectroniques bilingues ou mono-
lingues utilis&#233;s pour la d&#233;sambigu&#239;sation et la structuration du lexique ou bien de taxonomies
</p>
<p>1http://www.globalwordnet.org/
2LeWOLF est disponible sous licence Cecill-C (compatible LGPL), &#224; http://wolf.gforge.inria.fr</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Construction d&#8217;un wordnet libre du fran&#231;ais &#224; partir de ressources multilingues
</p>
<p>et d&#8217;ontologies qui fournissent en g&#233;n&#233;ral une description plus d&#233;taill&#233;e et plus formalis&#233;e des
termes. Le wordnet fran&#231;ais d&#233;velopp&#233; dans le cadre du projet EuroWordNet a &#233;t&#233; construit
ainsi : un sous-ensemble des synsets du PWN a &#233;t&#233; automatiquement traduit au moyen d&#8217;une
base de donn&#233;es s&#233;mantique multilingue propri&#233;taire, puis valid&#233; manuellement.
</p>
<p>Pour la construction du WOLF, nous avons exploit&#233; trois types de ressources librement dispo-
nibles : le corpus parall&#232;le multilingue JRC-Acquis, Wikip&#233;dia et d&#8217;autres ressources wiki, ainsi
que les descripteurs EUROVOC (utilis&#233; dans le th&#233;saurus europ&#233;en EUROVOC). Des traduc-
tions pour les lex&#232;mes monos&#233;miques, qui ne requi&#232;rent pas de d&#233;sambigu&#239;sation s&#233;mantique,
ont &#233;t&#233; extraites des ressources wiki et EUROVOC. Le corpus parall&#232;le a &#233;t&#233; utilis&#233; pour obtenir
des informations s&#233;mantiquement pertinentes &#224; partir de la relation multilingue de traduction,
afin de traiter &#233;galement les lex&#232;mes polys&#233;miques. L&#8217;id&#233;e que des informations s&#233;mantiques
peuvent &#234;tre extraites de la relation de traduction a &#233;t&#233; d&#233;j&#224; explor&#233;e par (Resnik &amp; Yarowsky,
1997; Ide et al., 2002; Diab, 2004). Elle a &#233;galement d&#233;j&#224; donn&#233; des r&#233;sultats prometteurs pour
la construction de synsets pour le wordnet slov&#232;ne (Fi&#353;er, 2007).
</p>
<p>3 M&#233;thodologie
</p>
<p>3.1 Pr&#233;sentation g&#233;n&#233;rale
</p>
<p>La difficult&#233; principale lors de la construction d&#8217;un wordnet est la polys&#233;mie du vocabulaire de
base. Dans ce travail, nous avons trait&#233; cette question par l&#8217;approche par alignement. L&#8217;id&#233;e re-
pose sur l&#8217;hypoth&#232;se que les diff&#233;rents sens des mots ambigus dans une langue donn&#233;e donnent
souvent lieu &#224; des traductions diff&#233;rentes dans une autre langue. &#192; l&#8217;inverse, nous supposons
que si deux mots ou plus sont traduits par le m&#234;me mot dans une autre langue, ils partagent
souvent un &#233;l&#233;ment de sens. En outre, ces ph&#233;nom&#232;nes sont renforc&#233;s par l&#8217;utilisation de plus
de deux langues, d&#8217;o&#249; l&#8217;int&#233;r&#234;t d&#8217;une approche par alignement multilingue. La m&#233;thode repose
sur le lexique multilingue extrait &#224; partir d&#8217;un corpus align&#233; automatiquement en mots, et uti-
lise les wordnets des autres langues pour d&#233;sambigu&#239;ser les entr&#233;es lexicales et leur assigner
un identifiant de sens. Les relations s&#233;mantiques entre synsets sont directement r&#233;cup&#233;r&#233;es du
PWN (version 2.0, celle utilis&#233; par BalkaNet).
</p>
<p>Cependant, cette approche est limit&#233;e au vocabulaire du corpus, et il n&#8217;est pas r&#233;aliste d&#8217;esp&#233;rer
la disponibilit&#233; de corpus align&#233;s pour un large &#233;ventail de domaines dans le but d&#8217;accro&#238;tre
la couverture. Heureusement, tous les lex&#232;mes du PWN ne sont pas polys&#233;miques : parmi les
145 627 lex&#232;mes du PWN, 82% n&#8217;apparaissent que dans un seul synset. Ces lex&#232;mes ne n&#233;ces-
sitent pas une technique aussi &#233;labor&#233;e que celle d&#233;crite pr&#233;c&#233;demment : ils peuvent &#234;tre traduits
directement &#224; l&#8217;aide de ressources bilingues, construisant ainsi par correspondance directe de
nouveaux synsets sans que des erreurs de sens ne soient &#224; craindre.
</p>
<p>3.2 Approche par alignement
</p>
<p>Pour l&#8217;approche par alignement, nous avons utilis&#233; le corpus SEE-ERA.NET3, sous-corpus du
corpus JRC-Acquis (Ralf et al., 2006) align&#233; en phrases. Parmi les 8 langues du corpus, et mis
</p>
<p>3Corpus cr&#233;&#233; au sein du projet SEE-ERA.NET ICT 10503 RP (2007-2008), Building Language Resources and
Translation Models for Machine Translation focused on South Slavic and Balkan Languages.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Darja Fi&#353;er
</p>
<p>&#224; part le fran&#231;ais, nous avons utilis&#233; les langues pour lesquelles nous disposions de toutes les
ressources n&#233;cessaires : l&#8217;anglais, le roumain, le tch&#232;que et le bulgare. Ce corpus fait environ 1
million et demi de mots, le chiffre exact variant d&#8217;une langue &#224; l&#8217;autre. Lors des travaux d&#233;crits
dans cet article, ce corpus n&#8217;avait pas encore &#233;t&#233; annot&#233; morphosyntaxiquement dans le cadre
du projet SEE-ERA.NET. Nous avons donc utilis&#233; TreeTagger4 pour &#233;tiqueter et lemmatiser le
corpus. Les fichiers de param&#232;tres par d&#233;faut ont &#233;t&#233; utilis&#233;s pour l&#8217;anglais et le fran&#231;ais, alors
que les fichiers pour le roumain et le bulgare ont &#233;t&#233; entra&#238;n&#233;s sur le corpus MULTEXT-East5.
Pour le tch&#232;que, nous avons utilis&#233; l&#8217;analyseur morphologique FMorph pour annoter le corpus
de fa&#231;on ambigu&#235;, puis l&#8217;&#233;tiqueteur Morc&#780;e pour d&#233;sambigu&#239;ser cette annotation (Hajic&#780;, 2008).
</p>
<p>Le corpus a &#233;t&#233; align&#233; en mots par Uplug (Tiedemann, 2003), qui repose sur l&#8217;outil standard
GIZA++. Pour augmenter la qualit&#233; de l&#8217;alignement, l&#8217;anglais n&#8217;a pas &#233;t&#233; utilis&#233; comme langue
pivot : nous avons align&#233; des paires de langues appartenant &#224; la m&#234;me famille (fran&#231;ais-roumain
et tch&#232;que-bulgare), puis nous avons utilis&#233; l&#8217;anglais comme pont (fran&#231;ais-anglais et tch&#232;que-
anglais). Le r&#233;sultat de l&#8217;alignement est un ensemble de liens entre mots qui, dans une phrase
donn&#233;e, sont en relation de traduction. Chacun de ces liens est compl&#233;t&#233; d&#8217;identifiants uniques
(num&#233;ro de phrase, num&#233;ro de mots) et d&#8217;un indicateur du degr&#233; de confiance qui lui est attribu&#233;.
</p>
<p>Les identifiants des mots ont permis de remplacer, dans ces liens, les formes fl&#233;chies par les
lemmes tels que fournis par les lemmatiseurs. Afin de r&#233;duire le bruit dans les lexiques obtenus,
seuls les liens entre lex&#232;mes de m&#234;me partie du discours ont &#233;t&#233; pris en compte, et toutes les
entr&#233;es contenant des caract&#232;res autres que des lettres ont &#233;t&#233; &#233;limin&#233;es. Les lexiques bilingues
obtenus contiennent toutes les variantes de traduction d&#8217;un lex&#232;me source dans le corpus, assor-
ties d&#8217;informations de fr&#233;quence, de partie du discours, ainsi que des identifiants des phrases et
mots concern&#233;s. La taille de ces lexiques va de 43 024 entr&#233;es pour le lexique tch&#232;que-anglais
&#224; 50 289 entr&#233;es pour le lexique tch&#232;que-bulgare.
</p>
<p>Les lexiques bilingues extraits ont &#233;t&#233; alors combin&#233;es pour cr&#233;er cinq lexiques multilingues
comportant de trois &#224; cinq langues. Les lex&#232;mes anglais et leurs identifiants de mots ont &#233;t&#233;
utilis&#233;s comme pivots. La taille des lexiques multilingues va de 49 356 entr&#233;es pour le lexique
regroupant toutes les langues (fran&#231;ais-roumain-tch&#232;que-bulgare-anglais) &#224; 59 019 entr&#233;es pour
le lexique fran&#231;ais-tch&#232;que-bulgare-anglais6.
</p>
<p>Une fois les lexiques obtenus, il reste &#224; associer un synset &#224; chacune de leurs entr&#233;es. Pour cela,
nous recherchons pour chaque composant d&#8217;une entr&#233;e donn&#233;e, &#224; l&#8217;exception du lex&#232;me en
fran&#231;ais, l&#8217;ensemble des identifiants des synsets auxquels il appartient. Nous avons utilis&#233; pour
cela le PWN 2.0 et les wordnets d&#233;velopp&#233;s dans le cadre du projet BalkaNet (Tufis&#807;, 2000), qui
utilisent les m&#234;mes identifiants de synsets que le PWN 2.0. On calcule alors, pour chaque entr&#233;e
de lexique multilingue, l&#8217;intersection des ensembles d&#8217;identifiants de synsets associ&#233;s aux dif-
f&#233;rents composants de l&#8217;entr&#233;e. Si l&#8217;intersection est non vide, les synsets qu&#8217;elle contient sont
attribu&#233;s au lex&#232;me fran&#231;ais de l&#8217;entr&#233;e. L&#8217;utilisation de plusieurs langues permet de d&#233;sambi-
gu&#239;ser les lex&#232;mes polys&#233;miques et &#233;limine la plupart des erreurs d&#8217;alignement. Il est en effet
peu probable qu&#8217;une m&#234;me polys&#233;mie se retrouve dans de nombreuses langues diff&#233;rentes, ou
qu&#8217;une erreur d&#8217;alignement induise une intersection non vide.
</p>
<p>4http://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger/
5http://nl.ijs.si/ME/
6Nous utilisons une option du logiciel d&#8217;alignement Uplug qui ne produit que les liens les plus vraisemblables.
</p>
<p>C&#8217;est pour cette raison que le nombre d&#8217;entr&#233;es varie peu lorsque le nombre de langues augmente : l&#8217;augmentation
&#224; laquelle on pourrait s&#8217;attendre est compens&#233;e par la diminution du nombre d&#8217;entr&#233;es qui incluent un lex&#232;me pour
chacune des langues.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Construction d&#8217;un wordnet libre du fran&#231;ais &#224; partir de ressources multilingues
</p>
<p>frq pos Fr Cs Bg En
18 n droit pr&#225;vo &#231;&#224;&#234;&#238;&#237;&#238;&#228;&#224;&#242;&#229;&#235;&#241;&#242;&#226;&#238; law
56 n droit pr&#225;vo &#239;&#240;&#224;&#226;&#238; law
4 n loi pr&#225;vo &#231;&#224;&#234;&#238;&#237; law
4 n loi pr&#225;vo &#231;&#224;&#234;&#238;&#237;&#238;&#228;&#224;&#242;&#229;&#235;&#241;&#242;&#226;&#238; law
6 n loi pr&#225;vo &#239;&#240;&#224;&#226;&#238; law
33 n loi z&#225;kon &#231;&#224;&#234;&#238;&#237; law
8 n loi z&#225;kon &#231;&#224;&#234;&#238;&#237;&#224; * law
19 n l&#233;gislation pr&#225;vo &#231;&#224;&#234;&#238;&#237;&#238;&#228;&#224;&#242;&#229;&#235;&#241;&#242;&#226;&#238; law
7 n l&#233;gislation pr&#225;vo &#239;&#240;&#224;&#226;&#238; law
4 n l&#233;gislation pr&#780;edpis &#231;&#224;&#234;&#238;&#237;&#238;&#228;&#224;&#242;&#229;&#235;&#241;&#242;&#226;&#238; law
</p>
<p>Fr : droit Cs : pr&#225;vo Bg : &#239;&#240;&#224;&#226;&#238; En : law
droit 06129345-n 04893549-n 00577416-n
</p>
<p>05559593-n 04888072-n 05529208-n
05791721-n 07928837-n 05531141-n
04617988-n 00577416-n 05791721-n
07928837-n 05791721-n 06129345-n
</p>
<p>01000872-n 07712371-n
04881053-n 07928837-n
04617988-n
</p>
<p>TAB. 1 &#8211; Exemple d&#8217;entr&#233;es lexicales et de d&#233;sambigu&#239;sation pour le nom droit (le lex&#232;me bul-
gare identifi&#233; par une &#233;toile r&#233;sulte d&#8217;une erreur de lemmatisation ; la partie commune ENG20
a &#233;t&#233; omise dans les identifiants de synsets).
</p>
<p>Illustrons ce processus sur un exemple. Soit le nom fran&#231;ais droit, qui est polys&#233;mique (il
peut ainsi &#234;tre traduit en anglais, entre autres, par right, law, droit, royalty, entitlement, claim).
Comme le montre la table 1(a), 56 de ses occurrences ont &#233;t&#233; align&#233;es avec pr&#225;vo en tch&#232;que,
&#239;&#240;&#224;&#226;&#238; en bulgare et law en anglais. L&#8217;intersection des ensembles d&#8217;identifiants de synsets
contenant chacun de ces mots dans le wordnet correspondant ne contient qu&#8217;un seul identifiant
de synset, ENG20-05791721-n. Il est donc attribu&#233; aux occurrences correspondantes du mot
droit (cf. table 1(b)). Ce synset, d&#233;fini dans le PWN comme d&#233;finissant the branch of philoso-
phy concerned with the law and the principles that lead courts to make the decisions they do,
correspond bien &#224; un des sens de droit.
</p>
<p>Appliqu&#233;e aux lexiques multilingues d&#233;crits pr&#233;c&#233;demment, cette technique nous a permis de
construire cinq ensembles diff&#233;rents de synsets comportant au moins un lex&#232;me fran&#231;ais. Ils
contiennent entre 1 338 (fran&#231;ais-roumain-tch&#232;que-bulgare-anglais) et 5 073 synsets (fran&#231;ais-
roumain-anglais). En raison des erreurs induites par les phases de pr&#233;-traitement (&#233;tiquetage,
lemmatisation) et d&#8217;alignement, on s&#8217;attend &#224; ce que ces synsets comportent certaines erreurs.
Cependant, cette approche permet de traiter les lex&#232;mes polys&#233;miques, fr&#233;quents dans le voca-
bulaire de base, ce que l&#8217;approche par traduction, d&#233;crite ci-dessous, ne permet pas.
</p>
<p>3.3 Approche par traduction
</p>
<p>Wikip&#233;dia (http://www.wikipedia.org) est une encyclop&#233;die collaborative et multi-
lingue. Elle contient actuellement plus de deux millions d&#8217;articles en anglais, et plus de 600 000
en fran&#231;ais. Les articles &#233;crits dans diff&#233;rentes langues sont reli&#233;s entre eux &#224; l&#8217;aide de liens
inter-langues, qui permettent l&#8217;extraction d&#8217;informations multilingues. L&#8217;id&#233;e de faire corres-
pondre des articles de Wikip&#233;dia aux synsets d&#8217;un wordnet n&#8217;est pas nouvelle, et a &#233;t&#233; utilis&#233;e &#224;
diverses fins (Declerck et al., 2006; Ruiz-Casado et al., 2005). Nous l&#8217;avons appliqu&#233;e au PWN
pour la cr&#233;ation de nouveaux synsets dans le WOLF.
</p>
<p>Comme dans toute encyclop&#233;die, les titres des articles de Wikip&#233;dia sont principalement des
noms (communs et propres), simples ou compos&#233;s. Leur casse a &#233;t&#233; normalis&#233;e automatique-
ment &#224; partir du corps des articles. Nous avons alors extrait un lexique bilingue &#224; partir des
titres anglais et de leurs &#233;quivalents fran&#231;ais en suivant les liens inter-langues. Le lexique ob-
tenu comporte 314 713 entr&#233;es. Nous l&#8217;avons enrichi par des synonymes et des d&#233;finitions &#224;
l&#8217;aide de la premi&#232;re phrase de chaque article7.
</p>
<p>7Par exemple, l&#8217;article intitul&#233; Langue construite d&#233;bute par la phrase suivante : Une langue construite ou</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Darja Fi&#353;er
</p>
<p>Une autre ressource que nous avons utilis&#233;e pour extraire des &#233;quivalents de traduction pour les
lex&#232;mes monos&#233;miques du PWN est Wiktionary (http://www.wiktionary.org). Com-
pl&#233;ment lexical de Wikip&#233;dia, Wiktionary existe aussi pour diff&#233;rentes langues. Chaque Wik-
tionary contient pour chaque mot r&#233;pertori&#233; une d&#233;finition ainsi que diff&#233;rentes informations
compl&#233;mentaires, telles que son &#233;tymologie, sa prononciation, des exemples, des synonymes
et antonymes, et, plus important pour nous, des traductions dans d&#8217;autres langues. Les Wik-
tionaries anglais et fran&#231;ais (&#171; le Wiktionnaire &#187;, http://www.wiktionary.org) nous
ont permis d&#8217;extraire deux lexiques bilingues de 24 464 et 24 873 entr&#233;es respectivement. Ces
lexiques couvrent toutes les parties du discours, contrairement &#224; Wikip&#233;dia.
</p>
<p>Nous avons &#233;galement exploit&#233; Wikispecies, taxonomie des esp&#232;ces vivantes qui inclut &#224; la fois
les noms des esp&#232;ces en latin, que l&#8217;on retrouve dans le PWN, et (pour les plus communes) en
anglais ou en fran&#231;ais. Ceci nous a permis d&#8217;identifier 129 509 termes latins ind&#233;pendants de la
langue ainsi qu&#8217;un &#233;quivalent fran&#231;ais pour 2 648 d&#8217;entre eux.
</p>
<p>Enfin, les descripteurs EUROVOC (http://europa.eu/eurovoc) font partie d&#8217;un th&#233;-
saurus multilingue qui couvrent les champs d&#8217;activit&#233; de l&#8217;Union Europ&#233;enne. Ils sont dispo-
nibles dans les 21 langues officielles de l&#8217;Union. La version 4.2 du th&#233;saurus contient une liste
de 6 802 descripteurs et de leurs &#233;quivalents dans les autres langues. En revanche, ils recouvrent
une large vari&#233;t&#233; de th&#232;mes, et incluent de nombreuses expressions multi-mots.
</p>
<p>Puisque nous avons utilis&#233; ces ressources pour traduire les lex&#232;mes monos&#233;miques du PWN,
l&#8217;identification du sens (c&#8217;est-&#224;-dire de l&#8217;identifiant du synset) de leur &#233;quivalent fran&#231;ais est
triviale. Wikip&#233;dia a permis la construction de 18 721 synsets, Wikispecies de 6 848 synsets, le
Wiktionnaire fran&#231;ais de 6 215 synsets, leWiktionary anglais de 4 363 synsets et les descripteurs
EUROVOC de 1 319 synsets.
</p>
<p>3.4 Fusion des r&#233;sultats
</p>
<p>L&#8217;ensemble des synsets obtenus par les deux approches ont &#233;t&#233; fusionn&#233;s. Si un m&#234;me synset a
&#233;t&#233; cr&#233;&#233; via plusieurs approches, ou au moyen de plusieurs sources (ensemble de langues pour
l&#8217;approche par alignement, ressource lexicale pour l&#8217;approche par traduction), les ensembles
de lex&#232;mes sont unifi&#233;s. L&#8217;information sur les sources d&#8217;o&#249; provient chacun des lex&#232;mes est
conserv&#233;e, pour permettre un filtrage en fonction de leur nombre de la fiabilit&#233; de chacune
d&#8217;entre elles. En effet, les diff&#233;rentes sources de lex&#232;mes ne donnent pas des r&#233;sultats homo-
g&#232;nes en termes de pr&#233;cision (cf. section 4). Si un lex&#232;me est associ&#233; &#224; un identifiant de synset
par tous les lexiques multilingues, et que la fr&#233;quence des entr&#233;es correspondantes dans ces
lexiques est &#233;lev&#233;e, le r&#233;sultat est fiable. Si &#224; l&#8217;inverse un lex&#232;me n&#8217;est affect&#233; &#224; un synset que
par un seul des lexiques multilingues (probablement par un lexique trilingue) et que l&#8217;entr&#233;e
correspondante a une fr&#233;quence faible, alors le r&#233;sultat est douteux. Nous avons donc mis en
place un filtre pour &#233;liminer les lex&#232;mes les plus douteux, en nous fondant sur le nombre de
sources, la nature des sources, et la fr&#233;quence des entr&#233;es correspondantes. Enfin, d&#8217;autres in-
formations ind&#233;pendantes de la langue (domaine, relations s&#233;mantiques) ont &#233;t&#233; h&#233;rit&#233;es des
synsets du PWN.
</p>
<p>langue artificielle (&#233;tymologiquement &#171; faite par l&#8217;art &#187;) est une langue cr&#233;&#233;e par une ou plusieurs personnes
dans un temps relativement bref, contrairement aux langues naturelles dont l&#8217;&#233;laboration est largement incons-
ciente. Ce texte, y compris les informations typographiques, nous on permis de consid&#233;rer langue construite, mais
&#233;galement langue artificielle, comme des lex&#232;mes associ&#233;s au concept d&#233;crit par l&#8217;article, et d&#8217;extraire la d&#233;finition
correspondante, destin&#233;e &#224; compl&#233;ter le futur synset : langue cr&#233;&#233;e (. . .) largement inconsciente.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Construction d&#8217;un wordnet libre du fran&#231;ais &#224; partir de ressources multilingues
</p>
<p>La construction automatique de synsets conduit in&#233;vitablement &#224; des trous dans la hi&#233;rarchie, un
certain nombre de synsets n&#8217;ayant &#233;t&#233; attribu&#233;s &#224; aucun lex&#232;me fran&#231;ais par manque de couver-
ture des ressources de d&#233;part. En raison de l&#8217;importance des principes de densit&#233; conceptuelle
et de pr&#233;servation de la hi&#233;rarchie pour les applications des wordnets (Tufis&#807;, 2000), nous avons
r&#233;cup&#233;r&#233; les synsets manquants du PWN, en en &#233;liminant les lex&#232;mes anglais, mais en conser-
vant toutes les relations structurelles et les autres informations ind&#233;pendantes de la langue. Ces
synsets vides seront remplis par des travaux futurs, mais l&#8217;int&#233;r&#234;t est que l&#8217;ontologie obtenue est
dense, en ce sens qu&#8217;elle ne contient aucun trou structurel. Si une application utilisant WOLF
&#233;tait amen&#233;e &#224; rencontrer un de ces synsets vides, elle pourrait malgr&#233; tout utiliser les informa-
tions relationnelles pour acc&#233;der &#224; un concept plus g&#233;n&#233;ral ou plus sp&#233;cifique.
</p>
<p>4 R&#233;sultats et &#233;valuation
</p>
<p>4.1 R&#233;sultats
</p>
<p>Nous avons &#233;tudi&#233; les caract&#233;ristiques de la ressource obtenue, le WOLF, par rapport au PWN
et &#224; l&#8217;EWN fran&#231;ais. L&#8217;&#233;valuation a &#233;t&#233; effectu&#233;e par rapport &#224; l&#8217;EWN fran&#231;ais8.
</p>
<p>Le WOLF contient actuellement 32 351 synsets non vides regroupant 38 001 lex&#232;mes distincts.
Ce nombre est bien plus &#233;lev&#233; que le nombre de synsets de l&#8217;EWN fran&#231;ais (22 1219), en raison
des r&#233;sultats de l&#8217;approche par traduction : rappelons que le PWN contient 115 424 synsets
pour 145 627 lex&#232;mes, dont 82% sont monos&#233;miques, soit 119 528 lex&#232;mes que nous avons pu
essayer de traduire directement. Toutefois, ces synsets ne sont pas toujours les plus int&#233;ressants.
</p>
<p>Pour &#233;valuer la couverture du WOLF sur les concepts de base, nous nous sommes appuy&#233;s sur
les BCS (Basic Concept Sets, Ensembles de Concepts de Base) d&#233;finis par le projet BalkaNet
(Tufis&#807;, 2000). Les synsets de base sont r&#233;partis en trois niveaux de BCS : BCS1 rassemble les
1 218 concepts les plus importants, BCS2 regroupe 3 471 autres concepts importants, et BCS3
inventorie 3 827 autres concepts relativement importants. Tous les autres concepts sont hors
BCS. Outre la couverture du WOLF, les r&#233;sultats pr&#233;sent&#233;s &#224; la table 2, ces chiffres valident a
posteriori la d&#233;finition de ces 3 BCS, les synsets BCS1 &#233;tant les mieux couverts (71,4%). Le
d&#233;tail par approche montre sans surprise que l&#8217;approche par alignement a permis la construction
des synsets les plus fondamentaux, alors que l&#8217;approche par traduction, restreinte aux lex&#232;mes
monos&#233;miques, a fait mieux pour BCS3 et hors BCS que pour BCS1 et BCS2.
</p>
<p>Contrairement &#224; WOLF, l&#8217;EWN fran&#231;ais ne comporte ni adjectifs ni adverbes. Les r&#233;sultats
par partie du discours sont donn&#233;s &#224; la table 2. La polys&#233;mie moyenne est de 1,23% synsets
par lex&#232;me (10,5% des lex&#232;mes sont polys&#233;miques, dont 1,2% des lex&#232;mes compos&#233;s10). Ces
</p>
<p>8L&#8217;EWN fran&#231;ais n&#8217;est utilis&#233; que pour l&#8217;&#233;valuation. Aucune information issue de cette ressource n&#8217;a &#233;t&#233; utilis&#233;e
dans le WOLF, ni pour y &#234;tre int&#233;gr&#233;e, ni pour &#233;liminer des lex&#232;mes erron&#233;s du WOLF. Du reste, tous les scripts
ayant servi &#224; construire le WOLF sont librement disponibles sur son site. Les ressources d&#8217;entr&#233;e &#233;tant &#233;galement
librement disponibles, tout un chacun peut reconstruire le WOLF tel qu&#8217;il est aujourd&#8217;hui. Nous envisageons bien
s&#251;r un travail manuel de validation et de compl&#233;tion dans l&#8217;avenir, mais la mise &#224; disposition de fichiers d&#233;crivant
chaque modification manuelle permettra de perp&#233;tuer la reproductibilit&#233; de la construction du WOLF.
</p>
<p>9L&#8217;EWN fran&#231;ais comporte en r&#233;alit&#233; 22 857 synsets, mais ils ne sont pas en correspondance biunivoque avec
les synsets du PWN 2.0 (contrairement au WOLF ou aux wordnets du projet BalkaNet). Une fois mis en corres-
pondance via un mapping entre PWN 1.5 et PWN 2.0, il arrive que plusieurs synsets d&#8217;EWN correspondent &#224; un
seul synset du PWN 2.0. Les chiffres que nous donnons sont pour l&#8217;EWN fran&#231;ais apr&#232;s ce mapping.
</p>
<p>10Les lex&#232;mes compos&#233;s sont tous obtenus par traduction de lex&#232;mes anglais monos&#233;miques. Mais parfois, deux</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Darja Fi&#353;er
</p>
<p>wordnet PWN WOLF EWN fran&#231;ais
BCS1 1 218 870 71,4% 1 211 99,4%
BCS2 3 471 1 668 48,0% 3 022 87,1%
BCS3 3 827 1 801 47,1% 2 304 60,2%
hors BCS 106 908 28 012 26,2% 15 584 14,6%
synset nominal 79 689 25 559 35,8% 17 381 21,8%
synset verbal 13 508 1 544 11,5% 4 740 35,1%
synset adjectival 18 563 1 562 8,4% 0 0,0%
synset adverbial 3 664 676 18,4% 0 0,0%
total 115,424 32,351 28.0% 22,121 19.2%
</p>
<p>TAB. 2 &#8211; Comparaison du nombre de synsets du WOLF et de l&#8217;EWN fran&#231;ais par rapport au
PWN, par BCS et par partie du discours.
</p>
<p>WOLF/align WOLF/transl WOLF
Pr&#233;cision Rappel Pr&#233;cision Rappel Pr&#233;cision Rappel
</p>
<p>noms 77,2% 68,7% 82,6% 74,9% 80,4% 74,5%
verbes 65,8% 54,7% 54,8% 35,8% 63,2% 52,5%
total 74,6% 65,4% 78,8% 69,6% 77,1% 70,3%
</p>
<p>TAB. 3 &#8211; &#201;valuation par rapport &#224; l&#8217;EWN fran&#231;ais.
</p>
<p>chiffres sont &#224; comparer aux 1,74 synsets par lex&#232;me de l&#8217;EWN fran&#231;ais (1,39 dans le PWN).
</p>
<p>4.2 &#201;valuation par rapport &#224; l&#8217;EWN fran&#231;ais
</p>
<p>Nous avons effectu&#233; deux types d&#8217;&#233;valuation. Tout d&#8217;abord, nous avons compar&#233; automatique-
ment, pour chaque lex&#232;me pr&#233;sent dans WOLF et dans l&#8217;EWN fran&#231;ais, les synsets qui lui
sont attribu&#233;s. Cette &#233;valuation n&#8217;a pu se faire que sur les noms et les verbes, seules parties du
discours pr&#233;sentes dans l&#8217;EWN fran&#231;ais. De plus, les synsets absents de l&#8217;EWN fran&#231;ais mais
pr&#233;sents dans WOLF sont in&#233;vitablement laiss&#233;s de c&#244;t&#233;. Puis nous avons &#233;tudi&#233; manuellement
quelques cas, pour identifier les sources de non-correspondance entreWOLF et l&#8217;EWN fran&#231;ais.
</p>
<p>Le tableau 3 pr&#233;sente les r&#233;sultats de l&#8217;&#233;valuation automatique. La pr&#233;cision est le pourcentage
moyen de synsets attribu&#233;s parWOLF &#224; un lex&#232;me et que l&#8217;EWN fran&#231;ais lui attribue &#233;galement.
Le rappel est le pourcentage moyen des synsets attribu&#233;s &#224; un lex&#232;me par l&#8217;EWN fran&#231;ais et que
WOLF lui attribue &#233;galement. On constate que les verbes ont conduit &#224; des r&#233;sultats moins bons
que les noms, en raison de leur forte polys&#233;mie11.
</p>
<p>Cependant, une pr&#233;cision inf&#233;rieure &#224; 100% pour un lex&#232;me donn&#233; ne signifie pas n&#233;cessaire-
ment une erreur : WOLF peut attribuer &#224; juste titre un synset &#224; un lex&#232;me, l&#224; o&#249; l&#8217;EWN fran&#231;ais
ne le fait pas. En revanche, un rappel inf&#233;rieur a de bonnes chances d&#8217;&#234;tre d&#251; &#224; une incompl&#233;-
tude du WOLF. C&#8217;est ce que montre l&#8217;&#233;valuation manuelle que nous avons effectu&#233;e sur 100
lex&#232;mes choisis al&#233;atoirement pour lesquels le WOLF et l&#8217;EWN fran&#231;ais sont en d&#233;saccord. Ils
</p>
<p>lex&#232;mes anglais monos&#233;miques se traduisent en un m&#234;me lex&#232;me, qui est donc polys&#233;mique. Exemple : fatty liver
et foie gras, tous deux monos&#233;miques en anglais, se traduisent en le terme fran&#231;ais polys&#233;mique foie gras.
</p>
<p>11Cette &#233;valuation laisse de c&#244;t&#233; les synsets non vides duWOLF absents de l&#8217;EWN fran&#231;ais. Pourtant, la majorit&#233;
de ces synsets sont remplis gr&#226;ce &#224; Wikip&#233;dia, et sont donc de bonne qualit&#233;, comme le montrent la pr&#233;cision de
94,6% obtenue par cette seule source par rapport &#224; l&#8217;EWN fran&#231;ais et son rappel de 87,8%.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Construction d&#8217;un wordnet libre du fran&#231;ais &#224; partir de ressources multilingues
</p>
<p>Cat&#233;gorie nom verbe adjectif adverbe all
dans l&#8217;EWN fran&#231;ais 76 (88%) 33 (46%) 0 (0%) 0 (0%) 109 (60%)
hors de l&#8217;EWN fran&#231;ais
correct 16 18 4 0 38
sem. proche 10 6 0 0 17
sem. reli&#233; 2 6 0 0 7
morph. reli&#233; 2 0 0 0 2
non reli&#233; 5 5 0 0 10
total 111 68 183
total correct (pr&#233;cision r&#233;elle du WOLF) 92 (83%) 51 (75%) 4 0 147 (80%)
</p>
<p>TAB. 4 &#8211; &#201;valuation manuelle duWOLF (les nombres en italique sont &#224; prendre avec pr&#233;caution
compte tenu du nombre insuffisant de couples lex&#232;me-synset concern&#233;s).
</p>
<p>correspondent &#224; 183 couples lex&#232;me-synset. Nous avons v&#233;rifi&#233;, pour chacun de ceux qui ne
sont pas pr&#233;sents dans les deux ressources, s&#8217;ils sont bel et bien corrects ou non. Les erreurs du
WOLF ont &#233;t&#233; class&#233;es en quatre cat&#233;gories :
&#8211; le lex&#232;me est s&#233;mantiquement proche du synset (hyperonyme, hyponyme, quasi-synonyme ;
p.ex. absence dans le synset dont l&#8217;identifiant est celui de {lack, deficiency, want} du PWN),
</p>
<p>&#8211; il est reli&#233; s&#233;mantiquement (autre relation s&#233;mantique ; p.ex. abri dans le synset dont l&#8217;iden-
tifiant est celui du synset {penthouse} du PWN),
</p>
<p>&#8211; il est reli&#233; morphologiquement (il fait partie d&#8217;un compos&#233; qui aurait &#233;t&#233; correct dans le
synset, ou il s&#8217;agit d&#8217;une variante morphologique d&#8217;un mot qui aurait &#233;t&#233; correct ; p.ex. affaire
dans le synset correspondant &#224; {things}, alors que le pluriel affaires serait correct ; aisance
dans le synset correspondant &#224; {toilet, lavatory, lav, can, john, privy, bathroom} alors que le
compos&#233; cabinet d&#8217;aisances serait correct),
</p>
<p>&#8211; il n&#8217;est pas reli&#233; du tout (ceci peut venir d&#8217;une erreur d&#8217;alignement ou de d&#233;sambigu&#239;sation,
p.ex. abattre dans le synset correspondant &#224; {excavate, dig up, turn up}).
</p>
<p>Les r&#233;sultats pour les diff&#233;rentes cat&#233;gories sont donn&#233;s &#224; la table 4. Environ la moiti&#233; des d&#233;sac-
cords sont des couples synset-lex&#232;me qui manquent dans l&#8217;EWN fran&#231;ais, et non des erreurs de
WOLF. Sans surprise, les synsets les moins probl&#233;matiques sont les concepts les plus sp&#233;ci-
fiques, et les plus difficiles sont ceux qui contiennent des lex&#232;mes tr&#232;s polys&#233;miques d&#233;crivant
des concepts vagues. Pour une &#233;valuation plus d&#233;taill&#233;e, y compris une &#233;valuation source par
source, on pourra se reporter &#224; (Fi&#353;er et Sagot, 2008, soumis).
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; la m&#233;thodologie employ&#233;e pour construire la premi&#232;re version d&#8217;un nou-
veau wordnet pour le fran&#231;ais, le WOLF (Wordnet Libre du Fran&#231;ais). Deux approches ont &#233;t&#233;
utilis&#233;es de fa&#231;on compl&#233;mentaire : une approche par alignement de corpus multilingues, pour
extraire des informations lexicales s&#233;mantiques pertinentes sur tous les types de lex&#232;mes, y com-
pris polys&#233;miques ; une approche par traduction, utilisant des ressources telles que Wikip&#233;dia
ou le Wiktionnaire, a permis la traduction directe d&#8217;un grand nombre de lex&#232;mes polys&#233;miques.
Nous avons alors &#233;valu&#233; le WOLF ainsi construit par rapport &#224; l&#8217;EWN fran&#231;ais.
</p>
<p>Outre la validation et la correction manuelle (d&#233;j&#224; en cours sur les BCS1), nous envisageons
plusieurs pistes pour am&#233;liorer la m&#233;thodologie et la ressource construite. Naturellement, l&#8217;ap-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Beno&#238;t Sagot, Darja Fi&#353;er
</p>
<p>proche par alignement pourrait tirer parti de l&#8217;utilisation de corpus plus importants (JRC-Acquis
dans son ensemble), bien que l&#8217;impact r&#233;el de la taille du corpus utilis&#233;, lorsqu&#8217;il est aussi sp&#233;ci-
fique, n&#8217;est pas clair. Par ailleurs, nous avons d&#233;j&#224; commenc&#233; des exp&#233;riences pr&#233;liminaires pour
g&#233;n&#233;raliser aux lex&#232;mes polys&#233;miques l&#8217;approche par traduction, par assignation automatique
de synsets du PWN &#224; des entr&#233;es de Wikip&#233;dia (Ruiz-Casado et al., 2005). De plus, l&#8217;utilisation
de telles ressources a un avantage au fil du temps : puisqu&#8217;elles sont en permanente &#233;volution,
utiliser notre m&#233;thodologie sur une future version de Wikip&#233;dia ou des Wiktionnaires devrait
&#233;galement permettre de construire de nouveaux synsets.
</p>
<p>Enfin, nous souhaitons valoriser la ressource, notamment en d&#233;sambigu&#239;sation syntaxique et
s&#233;mantique et en extraction et recherche d&#8217;informations. Outre une validation de l&#8217;int&#233;r&#234;t de la
ressource, nous attendons de ces travaux des retours permettant d&#8217;en am&#233;liorer la qualit&#233;.
</p>
<p>R&#233;f&#233;rences
</p>
<p>DECLERCK T., P&#201;REZ A. G., VELA O., GANTNER Z. &amp; MANZANO-MACHO D. (2006).
Multilingual lexical semantic resources for ontology translation. In Proc. of LREC&#8217;06, G&#234;nes,
Italie.
DIAB M. (2004). The feasibility of bootstrapping an arabic wordnet leveraging parallel cor-
pora and an english wordnet. In Proc. of the Arabic Lang. Tech. and Res., Le Caire, &#201;gypte.
FELLBAUM C. (1998). WordNet : An Electronic Lexical Database. MIT Press.
FI&#352;ER D. (2007). Leveraging parallel corpora and existing wordnets for automatic construc-
tion of the slovene wordnet. In Proc. of L&amp;TC&#8217;07, Poznan&#769;, Pologne.
HAJIC&#780; J. (2008). Disambiguation of Rich Inflection &#8211; Computational Morphology of Czech.
Charles University Press &#8211; Karolinum. &#192; para&#238;tre.
IDE N., ERJAVEC T. &amp; TUFIS&#807; D. (2002). Sense discrimination with parallel corpora. In Proc.
of ACL&#8217;02 Workshop on Word Sense Disambiguation, Philadelphia, PA, USA.
JACQUIN C., DESMONTILS E., &amp; MONCEAUX L. (2007). French eurowordnet lexical data-
base improvements. In Proc. of CICLing&#8217;07 (LNCS 4394), Mexico City, Mexico.
PIANTA E., BENTIVOGLI L. &amp; GIRARDI C. (2002). Multiwordnet : developing an aligned
multilingual database. In Proc. of the First Global WordNet Conference, Mysore, Inde.
RALF S., POULIQUEN B., WIDIGER A., IGNAT C., ERJAVEC T., TUFIS&#807; D. &amp; VARGA D.
(2006). The JRC Acquis : A multilingual aligned parallel corpus with 20+ languages. In Proc.
of LREC&#8217;06, G&#234;nes, Italie.
RESNIK P. &amp; YAROWSKY D. (1997). A perspective on word sense disambiguation methods
and their evaluation. In ACL SIGLEX Workshop Tagging Text with Lexical Semantics : Why,
What, and How ?, Washington, D.C., &#201;tats-Unis.
RUIZ-CASADO M., ALFONSECA E. &amp; CASTELLS P. (2005). Automatic assignment of wiki-
pedia encyclopedic entries to wordnet synsets. In Proc. of Advances in Web Intelligence.
TIEDEMANN J. (2003). Combining clues for word alignment. In Proc. of EACL&#8217;03, Budapest,
Hongrie.
TUFIS&#807; D. (2000). Balkanet design and development of a multilingual balkan wordnet. Roma-
nian Journal of Information Science and Technology, 7(1&#8211;2).
VOSSEN, P. (1999). EuroWordNet : a multilingual database with lexical semantic networks
for European Languages. Kluwer, Dordrecht.</p>

</div></div>
</body></html>