<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Repr&#233;sentation alg&#233;brique des expressions calendaires et vue calendaire d&#8217;un texte</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p>Repr&#233;sentation alg&#233;brique des expressions calendaires et vue 
calendaire d&#8217;un texte 
</p>
<p> 
</p>
<p>Battistelli D. (1), Couto J. (2), Minel J.-L. (3), Schwer S.R. (4) 
  
</p>
<p>(1) Lalic &#8211; Universit&#233; Paris-Sorbonne &#8211; 28 rue Serpente 75006 Paris   
delphine.battistelli@paris-sorbonne.fr  
</p>
<p>(2) INCO &#8211; Universidad de la Republica &#8211; 565 Herrera y Reissig 11300 Montevideo &#8211; 
Uruguay 
</p>
<p>jcouto@fing.edu.uy 
(3) MoDyCo &#8211; Universit&#233; Paris X, CNRS UMR 7114 &#8211; 200 avenue de la R&#233;publique 
</p>
<p>92001 Nanterre Cedex 
jminel@u-paris10.fr  
</p>
<p>(4) LIPN &#8211; Universit&#233; Paris XIII, CNRS UMR 7030 &#8211; 99 Bd Jean-Baptiste Cl&#233;ment 
93240 Villetaneuse 
</p>
<p>schwer@lipn.univ-paris13.fr 
  
 
</p>
<p>R&#233;sum&#233; Cet article aborde l&#8217;&#233;tude des expressions temporelles qui font r&#233;f&#233;rence 
directement &#224; des unit&#233;s de temps relatives aux divisions courantes des calendriers, que nous 
qualifions d&#8217;expressions calendaires (EC). Nous proposons une mod&#233;lisation de ces 
expressions en d&#233;finissant une alg&#232;bre d&#8217;op&#233;rateurs qui sont li&#233;s aux classes de marqueurs 
linguistiques qui apparaissent dans les EC. A partir de notre mod&#233;lisation, une vue calendaire 
est construite dans la plate-forme de visualisation et navigation textuelle NaviTexte, visant le 
support &#224; la lecture de textes. Enfin, nous concluons sur les perspectives offertes par le 
d&#233;veloppement d&#8217;une premi&#232;re application de navigation temporelle. 
</p>
<p>Abstract In this paper we address the study of temporal expressions that refer directly to 
text units concerning common calendar divisions, that we name &#8220;calendar expressions&#8221; (EC). 
We propose to model these expressions by defining an operator algebra, the operators being 
related to different linguistics marker classes that occur in the EC. Based on our model, a 
calendar view is built up into the text visualization and navigation framework NaviTexte, 
aiming the support of text reading. Finally, we discuss the perspectives offered by the 
development of a first temporal navigation application. 
</p>
<p>Mots-cl&#233;s : expressions temporelles calendaires, mod&#233;lisation alg&#233;brique, visualisation 
</p>
<p>Keywords: temporal calendar expressions, algebraic modelization, vizualisation 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Battistelli, Javier Couto, Jean-Luc Minel, Sylviane Schwer 
</p>
<p>1 Introduction 
</p>
<p>La prise en compte de la temporalit&#233; exprim&#233;e dans les textes appara&#238;t comme fondamentale 
non seulement dans une perspective de traitement global de documents mais &#233;galement dans 
l&#8217;analyse de la structure m&#234;me d&#8217;un document, tout particuli&#232;rement quand ce dernier est 
long. Les expressions temporelles consid&#233;r&#233;es ici sont des adverbiaux de localisation 
temporelle, dits aussi de datation (Guimier, 1996). Ce type d&#8217;expression a fait l&#8217;objet de 
nombreux travaux, tant sur le plan de leur analyse en tant que modes d&#8217;organisation des 
discours (Terran, 2002 ; Le Draoulec et P&#233;ry-Woodley, 2005) que sur le plan de leur rep&#233;rage 
effectif dans les textes, depuis celles du type &#171; demain &#187;, &#171; dans trois jours &#187;, &#171; vers la fin de 
la semaine &#187; (comme dans Maurel, 1989) jusqu&#8217;&#224; celles du type &#171; lors d&#8217;une messe &#187; (comme 
dans Vazov, 2001). Nous nous limitons ici &#224; l&#8217;analyse et au rep&#233;rage d&#8217;expressions 
temporelles qui font r&#233;f&#233;rence directement &#224; des unit&#233;s de temps relatives aux divisions 
courantes des calendriers (&#8216;an&#8217;, &#8216;semaine&#8217;, etc.). Nous qualifions ces expressions 
d&#8217;expressions calendaires (d&#233;sormais EC). Notons que dans notre conceptualisation 
(Battistelli et al., 2007) &#8211; m&#234;me si nous n&#8217;en pr&#233;sentons pas d&#8217;analyse ici &#8211; une expression 
comme &#171; au cours de TALN 2008 &#187; constitue aussi une EC. En effet, m&#234;me si &#8216;TALN 2008&#8217; 
fait r&#233;f&#233;rence &#224; un &#233;v&#232;nement unique, il entre dans une s&#233;rie qui permet de g&#233;n&#233;rer une 
chronologie et donc de donner naissance &#224; une unit&#233; calendaire. En revanche, une expression 
temporelle comme &#171; pendant la seconde guerre mondiale &#187;, r&#233;f&#233;rant &#224; un &#233;v&#233;nement unique 
positionnable sur un calendrier, est exclue de notre d&#233;finition d&#8217;une EC : l&#8217;&#233;v&#233;nement &#8216;guerre 
mondiale&#8217;, s&#8217;il peut se reproduire (et &#234;tre affect&#233; d&#8217;un num&#233;ro), n&#8217;est en effet pas v&#233;cu comme 
une occurrence d&#8217;un &#233;v&#233;nement type dont on pourrait pr&#233;voir sur une longue p&#233;riode de 
temps l&#8217;it&#233;ration p&#233;riodique (comme l&#8217;ont &#233;t&#233; par exemple les crues du Nil sur lesquelles s&#8217;est 
construit le calendrier agraire &#233;gyptien). 
</p>
<p>La question de l&#8217;annotation automatique des EC a &#233;t&#233; plus particuli&#232;rement pos&#233;e dans le 
cadre de syst&#232;mes visant &#224; ordonnancer des &#233;v&#232;nements selon leur ancrage calendaire 
(Schilder et Habel, 2001) ou dans le cadre de syst&#232;mes de questions-r&#233;ponses (Pustejovsky et 
al., 2005 ; Harabagiu et Bejan, 2005). Il est &#224; noter &#224; cet effet qu&#8217;une proposition de 
m&#233;talangage standard telle que TimeML, d&#233;di&#233;e &#224; l&#8217;annotation des &#233;v&#233;nements dans des 
textes et de leurs relations temporelles (Pustejovsky et al., 2003), a &#233;t&#233; initialement mise en 
place dans le cadre du workshop TERQAS (2002), qui lui-m&#234;me prenait place dans le 
contexte des syst&#232;mes de questions/r&#233;ponses. Il int&#232;gre principalement deux sch&#233;mas 
d&#8217;annotation, TIDES TIMEX2 (Ferro et al., 2003) et Sheffield STAG (Setzer et al., 2000), 
propos&#233;s &#224; partir essentiellement de l&#8217;analyse d&#8217;adverbiaux temporels que sont les EC1.  
</p>
<p>Dans cet article, nous nous proposons de d&#233;crire formellement ces EC &#8211; pour le fran&#231;ais &#8211; en 
distinguant explicitement diff&#233;rentes classes de marqueurs linguistiques qui apparaissent dans 
les EC selon les types d&#8217;op&#233;rations qu&#8217;elles mettent en &#339;uvre. Cette approche nous am&#232;ne &#224; 
proposer des crit&#232;res fins pour d&#8217;une part l&#8217;annotation automatique de ces expressions et 
d&#8217;autre part la navigation temporelle dans un texte ou un corpus de textes. Nous nous 
distinguons des approches pr&#233;c&#233;demment cit&#233;es sur au moins deux points cruciaux : (i) notre 
but n&#8217;est pas de relier une EC ramen&#233;e &#224; sa valeur &#8211; selon la norme ISO &#8211; &#224; un &#233;v&#233;nement 
dans un texte mais de relier qualitativement les EC d&#8217;un texte entre elles, c&#8217;est-&#224;-dire &#233;tablir 
leurs relations de positionnement relatif (l&#8217;ensemble de ces relations correspond &#224; ce que nous 
appelons le calendrier propre au texte) ; (ii) nous mod&#233;lisons la s&#233;mantique d&#8217;une EC comme 
</p>
<p>                                                 
</p>
<p>1  Les EC sont g&#233;n&#233;ralement d&#233;sign&#233;es sous le terme de &#171; locutions adverbiales de temps &#187; (voir par exemple 
pour le fran&#231;ais (Maurel, 1989) qui qualifie ces expressions d&#8217; &#171; adverbes de date &#187;). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation alg&#233;brique des expressions calendaires et vue calendaire d&#8217;un texte 
</p>
<p>une expression alg&#233;brique2. Dans la section 2, nous pr&#233;sentons notre approche formelle 
fond&#233;e sur une alg&#232;bre d&#8217;op&#233;rateurs et, dans la section 3, un projet d&#8217;application qui consiste 
&#224; aider &#224; la lecture d&#8217;un texte biographique. Nous concluons sur les perspectives offertes par 
le d&#233;veloppement d&#8217;une premi&#232;re application de navigation temporelle. 
</p>
<p>2 Une alg&#232;bre des expressions calendaires 
</p>
<p>Nous postulons que l&#8217;EC utilis&#233;e pour r&#233;f&#233;rer un lieu calendaire peut &#234;tre d&#233;crite par une suite 
d&#8217;op&#233;rations unaires (un seul argument) qui permettent d&#8217;acc&#233;der &#224; ce lieu calendaire. Il s&#8217;agit 
donc de consid&#233;rer une EC comme la composition d&#8217;un certain nombre d&#8217;op&#233;rateurs qui 
chacun donne un bout de chemin selon l&#8217;ordre suivant : &#224; partir d&#8217;une base calendaire (BC) 
prise comme argument, qui peut &#234;tre donn&#233;e imm&#233;diatement ( 21 juin 2008 dans &#171; le 21 juin 
2008 &#187;) ou m&#233;diatement (le jour courant dans &#171; demain &#187;) g&#233;n&#233;ralement introduite par un 
d&#233;terminant (le, &#8230;) et/ou une pr&#233;position (en, &#224;, &#8230;) qui op&#232;re comme un pointeur, un second 
type d&#8217;op&#233;rateur exprime la portion &#171; utile &#187; de cette base (tout, le d&#233;but, le milieu, la fin, une 
zone floue autour). Cette portion utile partitionne la ligne du temps en trois r&#233;gions (cf. Fig. 
1) : la demi-droite ant&#233;rieure (A), la portion (U) elle-m&#234;me et la demi-droite post&#233;rieure (P) &#8211;
cette demi-droite &#233;tant born&#233;e par l&#8217;instant pr&#233;sent (ou le maintenant du texte). Un troisi&#232;me 
type d&#8217;op&#233;rateur permet d&#8217;acc&#233;der au lieu d&#233;crit par l&#8217;EC : soit par d&#233;placement quantitatif 
(ex. : &#171; trois semaines plus tard &#187;), soit par zoom (ex. : &#171; l&#8217;automne de cette ann&#233;e-l&#224; &#187;) soit 
en prenant l&#8217;une des trois r&#233;gions d&#233;coup&#233;es (ex. : &#171; jusqu&#8217;en mai 2006 &#187;). 
</p>
<p>U
</p>
<p>I
</p>
<p>PA
</p>
<p> 
</p>
<p>Figure 1 : Partition de la ligne du temps pour une EC unaire 
</p>
<p>Notre objectif est la d&#233;finition d&#8217;une expression alg&#233;brique pour chaque EC. Une expression 
alg&#233;brique est d&#233;riv&#233;e de la d&#233;composition d&#8217;une EC en sous-expressions chacune associ&#233;e &#224; 
un op&#233;rateur ou, pour la plus &#224; droite, &#224; un op&#233;rande, appel&#233; base calendaire (BC). Analysons 
par exemple l&#8217;EC &#171; depuis la fin des ann&#233;es 1980 &#187;. Notre d&#233;marche, constructive, 
commence par consid&#233;rer &#171; ann&#233;es 1980 &#187; comme point de d&#233;part de la d&#233;composition. Cette 
expression correspond &#224; BC, qui porte le grain et la valeur permettant, puisqu&#8217;elle entretient 
des relations avec d&#8217;autres BC, de r&#233;f&#233;rencer celle-ci dans le calendrier. &#192; cette BC 
s&#8217;applique un op&#233;rateur de pointage correspondant &#224; l&#8217;article &#171; les &#187;, application qui renvoie 
l&#8217;expression &#171; les ann&#233;es 1980 &#187;3 qui d&#233;termine la partie I de Fig. 1 et qui est une EC. 
Ensuite, la portion utile U de BC est obtenue par l&#8217;op&#233;rateur exprim&#233; par &#171; la fin de &#187; ; enfin, 
la r&#233;gion d&#233;peinte par l&#8217;EC est la partie P union U de l&#8217;op&#233;rateur &#171; depuis &#187;. Cette analyse est 
strictement qualitative comme l&#8217;exprime le sch&#233;ma de Fig. 2. Un op&#233;rateur dit de 
d&#233;placement correspond &#224; la composante lexicale &#171; la fin de &#187; et un op&#233;rateur dit de 
r&#233;gionalisation correspond &#224; la pr&#233;position &#171; depuis &#187;. Ainsi, l&#8217;EC &#171; depuis la fin des ann&#233;es 
1980 &#187; est repr&#233;sent&#233;e par l&#8217;expression fonctionnelle suivante : depuis(la fin de(les(ann&#233;es 
</p>
<p>                                                 
</p>
<p>2  Dans cet article, nous nous limitons &#224; la description d&#8217;EC ne faisant pas intervenir de quantification comme 
dans &#171; chaque mardi &#187; et ne correspondant pas &#224; une s&#233;quence comme dans &#171; lundi et mardi &#187;. Nous 
consid&#233;rons par ailleurs ici des EC qui ne n&#233;cessitent pas de faire appel pour leur calcul &#224; des marques 
temporelles autres qu&#8217;adverbiales (comme les temps verbaux ou les adjectifs). 
</p>
<p>3  Cette expression n&#8217;est pas lexicalis&#233;e dans l&#8217;EC &#224; cause du ph&#233;nom&#232;ne de contraction. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Battistelli, Javier Couto, Jean-Luc Minel, Sylviane Schwer 
</p>
<p>1980))). Tab. 1 montre les expressions obtenues en appliquant la m&#234;me d&#233;marche &#224; d&#8217;autres 
EC. 
</p>
<p> 
</p>
<p>Figure 2 : Analyse qualitative d&#8217;une EC 
</p>
<p>EC Mod&#233;lisation fonctionnelle 
mai 1974 (mai 1974) 
en 1945 en ( (1945 )) 
pendant l&#8217;&#233;t&#233;  2001 pendant( l&#8217;(&#233;t&#233; 2001 ) )  
au mois d&#8217;ao&#251;t &#224; (le ( mois d&#8217;ao&#251;t ) )  
&#224; l&#8217;aube de l&#8217;ann&#233;e 2001 &#224; l&#8217;aube de ( l&#8217; (ann&#233;e 2001 ) ) 
&#224; partir de 1958 &#224; partir de ( (1958 )) 
&#224; la veille de No&#235;l 1994 &#224; (la veille de ( (No&#235;l 1994 ))) 
trois jours avant No&#235;l 1994 (trois jours avant ((No&#235;l 1994))) 
jusqu&#8217;en juillet 1962 jusqu&#8217;en( ( juillet 1962 ) ) 
le 21 juin  le ( 21 juin ) 
au milieu de la fin des ann&#233;es 1990 &#224; ( le milieu de ( la fin de (les ( ann&#233;es 1990 ) ) ) ) 
</p>
<p>Tableau 1. Exemples de mod&#233;lisation fonctionnelle d&#8217;EC  
</p>
<p>Les exemples de Tab. 1 montrent que certains op&#233;rateurs sont implicites : les EC &#171; trois jours 
avant No&#235;l 1994 &#187; et &#171; mai 1974 &#187; ne contiennent pas d&#8217;expressions explicites associ&#233;es au 
pointage. Les expressions fonctionnelles associ&#233;es font appara&#238;tre cet op&#233;rateur par un 
parenth&#233;sage syst&#233;matique de leur BC, qui les transforme en des EC. L&#8217;EC &#171; depuis la fin des 
ann&#233;es 1980 &#187; correspond &#224; une transformation successive des trois EC suivantes : EC1= 
&#171; les ann&#233;es 1980 &#187;, EC2 =&#171; la fin des ann&#233;es 1980 &#187; et EC3= &#171; depuis la fin des ann&#233;es 
1980 &#187;. Une parenth&#232;se ouvrante non pr&#233;c&#233;d&#233;e d&#8217;une expression d&#8217;op&#233;rateur correspond &#224; 
l&#8217;expression d&#8217;un op&#233;rateur implicite. Pour ne pas surcharger l&#8217;&#233;criture, on ne repr&#233;sente que 
l&#8217;op&#233;rateur implicite de pointage, car c&#8217;est le seul op&#233;rateur non interne aux EC.  
</p>
<p>Il ressort des exemples &#233;tudi&#233;s (tir&#233;s de notre corpus de biographies et de textes accessibles 
sur le web) que les op&#233;rateurs rel&#232;vent de trois types diff&#233;rents : (i) les op&#233;rateurs de 
pointage, qui associent &#224; la BC une zone calendaire (I) de la Fig. 1 ; (ii) des op&#233;rateurs dits de 
focalisation/d&#233;placement, qui sont de deux sortes : m&#233;r&#233;ologiques pour la focalisation (tout, 
d&#233;but, milieu, fin) qui d&#233;finissent la zone calendaire utile (U) de la Fig. 1 et qui peuvent 
s&#8217;it&#233;rer (ex. : &#171; au milieu de la fin des ann&#233;es 1990 &#187;) et (in/d&#233;)cr&#233;mentaux pour le 
d&#233;placement (ex. : &#171; trois jours avant No&#235;l &#187;), c&#8217;est-&#224;-dire qui d&#233;portent la zone utile &#224; gauche 
ou &#224; droite de U ; (iii) des op&#233;rateurs dits de r&#233;gionalisation qui d&#233;finissent la partie de 
l&#8217;espace temporel issue de U capt&#233;e par l&#8217;EC : on obtient soit U, soit A, soit P, soit U et A, 
soit U et P, soit A et P. Notons ensuite que les op&#233;rateurs de focalisation peuvent s&#8217;appliquer 
plusieurs fois, comme dans l&#8217;EC &#171; au milieu de la fin des ann&#233;es 1990 &#187;, de m&#234;me que les 
op&#233;rateurs de r&#233;gionalisation comme dans l&#8217;EC &#171; jusqu&#8217;&#224; au-del&#224; de 1940 &#187;. Enfin, la vaste 
combinatoire potentielle des op&#233;rateurs est, dans la pratique, plus restreinte, au vu de 
diff&#233;rents exemples que nous avons &#233;tudi&#233;s dans notre corpus. Il existe un ordre entre les trois 
types d&#8217;op&#233;rateurs ; des expressions telles que &#171; au d&#233;but de depuis les ann&#233;es 1980 &#187; ou 
&#171; depuis jusqu&#8217;en 2005 &#187; vont ainsi &#234;tre consid&#233;r&#233;es comme agrammaticales. Finalement, 
nous consid&#233;rons donc qu&#8217;une EC est d&#233;finie par une BC sur laquelle s&#8217;applique d&#8217;abord un 
seul op&#233;rateur de pointage, des op&#233;rateurs de d&#233;placement s&#8217;appliquent ensuite, et enfin des 
op&#233;rateurs de r&#233;gionalisation, ce que nous illustrons par l&#8217;expression suivante : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation alg&#233;brique des expressions calendaires et vue calendaire d&#8217;un texte 
</p>
<p>OpR&#233;gionalisation
+
 (Opfocalisation/d&#233;placement
</p>
<p>+ 
(OpPointage (BC)))  
</p>
<p>Notons que l&#8217;alg&#232;bre est bien d&#233;finie. L&#8217;op&#233;rateur de pointage, le plus interne, transforme une 
BC en une EC et tous les autres op&#233;rateurs prennent en argument une EC et fournissent en 
r&#233;sultat une EC. 
</p>
<p>2.1 Analyse des op&#233;rateurs  
</p>
<p>Un op&#233;rateur d&#233;signe un ensemble d&#8217;instances lexicales possibles li&#233;es par une relation 
d&#8217;&#233;quivalence. Le crit&#232;re de regroupement est li&#233; &#224; l&#8217;effet qu&#8217;un op&#233;rateur produit sur une EC. 
Ainsi, nous consid&#233;rons que les expressions &#171; &#224; l&#8217;aube des ann&#233;es 1980 &#187; et &#171; au d&#233;but des 
ann&#233;es 1980 &#187; d&#233;signent des zones utiles identiques (les expressions &#171; &#224; l&#8217;aube de &#187; et &#171; au 
d&#233;but de &#187; sont donc consid&#233;r&#233;es comme deux instances d&#8217;un m&#234;me op&#233;rateur). De m&#234;me, 
&#171; pendant &#187; et &#171; en &#187; d&#233;signent la m&#234;me r&#233;gion calendaire, m&#234;me si elles ne d&#233;signent pas la 
m&#234;me relation entre la zone calendaire et le proc&#232;s concern&#233;. Rappelons que notre but est de 
situer relativement les unes aux autres les EC, et non les proc&#232;s qu&#8217;elles contribuent &#224; situer 
temporellement.  
</p>
<p>2.1.1  L&#8217;op&#233;rateur de pointage 
</p>
<p>Cet op&#233;rateur transforme une BC en une EC, que nous appelons EC &#233;l&#233;mentaire.  
</p>
<p>2.1.2 Les op&#233;rateurs de focalisation/d&#233;placement 
</p>
<p>Le premier op&#233;rateur de Tab. 2 est celui qui ne modifie pas l&#8217;EC &#233;l&#233;mentaire, c&#8217;est donc 
l&#8217;op&#233;rateur d&#8217;identit&#233;. Les trois op&#233;rateurs suivants focalisent sur une partie de l&#8217;EC 
&#233;l&#233;mentaire. Nous avons adopt&#233; une partition en trois parties : d&#233;but, milieu et fin, comme 
c&#8217;est g&#233;n&#233;ralement le cas (voir par exemple (Maurel, 1989) qui les encode comme trois 
parties successives et de m&#234;me taille). Notre approche uniquement qualitative de 
repr&#233;sentation laisse &#224; l&#8217;utilisateur le soin de d&#233;finir les proportions respectives de chaque 
partie. Les deux derniers op&#233;rateurs correspondent &#224; des d&#233;placements avant ou arri&#232;re sur 
l&#8217;axe temporel relativement &#224; l&#8217;EC &#233;l&#233;mentaire. Ces op&#233;rateurs de d&#233;placement sont 
n&#233;cessairement param&#233;tr&#233;s par une unit&#233; et un ordinal. Par exemple, l&#8217;EC &#171; trois jours avant 
No&#235;l &#187; correspondra &#224; l&#8217;expression D&#233;placementAvant(jour, 3)(OpPointage(No&#235;l)). 
</p>
<p>Nom de l&#8217;op&#233;rateur Exemples d&#8217;EC 
</p>
<p>IdFocalDeplac (IdFD) en 1945 ; pendant l&#8217;&#233;t&#233; de 2001 ; au mois d&#8217;ao&#251;t 
FocalD&#233;but (Fd) &#224; l&#8217;aube des ann&#233;es 1980 ; au d&#233;but de mai 2005 
FocalMilieu (Fm) au milieu de l&#8217;ann&#233;e 2006 
FocalFin (Ff) &#224; la fin d&#8217;ao&#251;t 1979 
D&#233;placementAvant(unit&#233;, n) (Dep(u, -n)) trois jours avant No&#235;l 
D&#233;placementApr&#232;s(unit&#233;, n) (Dep(u, +n)) cinq semaines apr&#232;s  P&#226;ques. 
</p>
<p>Tableau 2. Op&#233;rateurs de focalisation/d&#233;placement 
</p>
<p>2.1.3 Les op&#233;rateurs de r&#233;gionalisation 
</p>
<p>Un op&#233;rateur de r&#233;gionalisation op&#232;re sur Opfocalisation+/d&#233;placement+(OpPointage(BC)) 
correspondant &#224; la zone calendaire utile U qui devient le point d&#8217;ancrage servant &#224; d&#233;finir la 
r&#233;gion calendaire d&#233;crite par l&#8217;EC. A partir de cette zone six r&#233;gions sont d&#233;finissables, 
donnant lieu &#224; six op&#233;rateurs (cf. Tab. 3). L&#8217;absence de marqueur linguistique de 
r&#233;gionalisation sp&#233;cifie l&#8217;op&#233;rateur RegionId. Un op&#233;rateur de r&#233;gionalisation floue a &#233;t&#233; 
pr&#233;vu pour d&#233;crire des expressions comme &#171; vers le 21 avril 1997 &#187; ou &#171; peu avant le 21 avril 
1997 &#187; ; il est visualis&#233; &#224; l&#8217;aide d&#8217;une ellipse en pointill&#233;s. Signalons que, &#224; l&#8217;instar des 
op&#233;rateurs de pointage et de Focalisation/D&#233;placement, les op&#233;rateurs de r&#233;gionalisation sont </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Battistelli, Javier Couto, Jean-Luc Minel, Sylviane Schwer 
</p>
<p>unaires, &#224; l&#8217;exception de l&#8217;op&#233;rateur de r&#233;gionalisation binaire associ&#233; &#224; des EC comme 
&#171; entre mai et ao&#251;t 2006 &#187;, &#171; depuis l&#8217;an 2006 et jusqu&#8217;&#224; l&#8217;an 2007 &#187; ou &#171; de l&#8217;&#233;t&#233; 2007 &#224; mai 
2008 &#187; ou encore des EC dites bool&#233;ennes comme &#171; le 21 juin ou/et le 15 ao&#251;t &#187;. Les deux 
EC arguments d&#233;finissent alors une partition de la droite temporelle en cinq zones ]-,U1[, U1, 
]U1,U2[, U2, ]U2,-[ qui peut g&#233;n&#233;rer a priori autant de r&#233;gionalisations que la combinatoire 
le permet (cf. Fig. 3). Par exemple, entre est associ&#233; &#224; la r&#233;gion comprise entre U1 et U2, 
bornes comprises ou non, selon les op&#233;rateurs de r&#233;gionalisations unaires appliqu&#233;s aux EC 
arguments. 
</p>
<p>Nom de l&#8217;op&#233;rateur Exemples d&#8217;EC 
</p>
<p>R&#233;gionId (RId) le 21 avril 1997 
R&#233;gionAvant (Rav) avant le 21 avril 1997 
R&#233;gionJusque (Rj) jusqu&#8217;au 21 avril 1997 
R&#233;gionDepuis (Rd) depuis le 21 avril 1997 
R&#233;gionApr&#232;s (Rap) apr&#232;s le 21 avril 1997 
R&#233;gionHors (Rh) sauf le 21 avril 1997 
</p>
<p>Tableau 3. Classes d&#8217;op&#233;rateurs de r&#233;gionalisation 
</p>
<p>U2U1  
</p>
<p>Figure 3 : Partition de la ligne du temps pour une EC binaire 
</p>
<p>2.2 Exemples d&#8217;analyse alg&#233;brique d&#8217;expressions calendaires 
</p>
<p>Nous reprenons ci-apr&#232;s les expressions de Tab. 1 en en donnant une analyse alg&#233;brique.  
</p>
<p>Exemples d&#8217;EC Mod&#233;lisation alg&#233;brique 
</p>
<p>mai 1974 RId(IdFD(mai 1974)) 
en 1945 RId(IdFD(1945)) 
pendant l&#8217;&#233;t&#233; 2001 RId(IdFD(&#233;t&#233; 2001)) 
au mois d&#8217;ao&#251;t RId(IdFD(mois d&#8217;ao&#251;t)) 
&#224; l&#8217;aube de l&#8217;ann&#233;e 2001 RId(Fd(ann&#233;e 2001)) 
&#224; partir de 1958 Rd(IdFD(1958)) 
&#224; la veille de No&#235;l 1994 Rid(Dep(jour,-1)(No&#235;l 1994)) 
trois jours avant No&#235;l 1994 Rid(Dep(jour,-3)(No&#235;l 1994)) 
jusqu&#8217;en juillet 1962 Rj(IdFD(juillet 1962)) 
le 21 juin  RId (IdFD( 21 juin )) 
au milieu de la fin des ann&#233;es 1990 RId(Fm(Ff(ann&#233;es 1990))) 
</p>
<p>Tableau 4. Exemples de mod&#233;lisation alg&#233;brique d&#8217;EC 
</p>
<p>3 Construction de la vue calendaire d&#8217;un texte 
</p>
<p>L&#8217;impl&#233;mentation informatique de notre approche se fonde sur la plate-forme logicielle de 
navigation textuelle NaviTexte (Couto, 2006 ; Couto et Minel, 2007). Nous avons tout 
d&#8217;abord d&#233;fini une mani&#232;re d&#8217;encoder l&#8217;alg&#232;bre dans les textes, puis un nouveau type de vue, 
nomm&#233; vue calendaire, a &#233;t&#233; con&#231;u et d&#233;velopp&#233;. Nous pr&#233;sentons ces deux aspects ici. 
</p>
<p>3.1 Rep&#233;rage et encodage des expressions calendaires 
</p>
<p>Afin que les EC puissent &#234;tre informatiquement exploit&#233;es, il est n&#233;cessaire de rep&#233;rer et de 
repr&#233;senter pr&#233;alablement celles-ci sous un format traitable. La repr&#233;sentation informatique 
utilis&#233;e est celle de NaviTexte, dont nous rappelons bri&#232;vement les principes qui s&#8217;inspirent 
du standard TEI. La repr&#233;sentation du texte, d&#233;crite dans un format XML, se divise en deux </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation alg&#233;brique des expressions calendaires et vue calendaire d&#8217;un texte 
</p>
<p>parties : le Corps, o&#249; les unit&#233;s textuelles significatives pour la t&#226;che sont d&#233;limit&#233;es, et la 
T&#234;te, o&#249; s&#8217;expriment les relations non hi&#233;rarchiques entre ces m&#234;mes unit&#233;s. Dans le Corps, 
l&#8217;&#233;l&#233;ment de base du mod&#232;le est l&#8217;Unit&#233; Textuelle (UT) typ&#233;e, ce qui permet d&#8217;incorporer de 
nouveaux &#233;l&#233;ments textuels de mani&#232;re simple. Dans le cadre de notre travail, les EC sont 
annot&#233;es dans le Corps comme des UT de type &#171; expression calendaire &#187;. Par ailleurs, un 
objet S&#233;quence qui repr&#233;sente l&#8217;ordonnancement des UT des EC est d&#233;clar&#233; dans la T&#234;te. 
</p>
<p> 
</p>
<p>Texte 
Plat 
</p>
<p>Texte Segment&#233; 
+ 
</p>
<p>EC ordonnanc&#233;es 
</p>
<p>Texte 
Segment&#233; 
</p>
<p>Texte Segment&#233; 
+ 
EC 
</p>
<p> 
</p>
<p>Figure 4 : Etapes de traitement  
</p>
<p>Le traitement se d&#233;compose en trois &#233;tapes (cf. Fig. 4) qui, &#224; partir d&#8217;un texte non format&#233;, 
construisent un texte traitable par NaviTexte o&#249; les EC ont &#233;t&#233; rep&#233;r&#233;es, encod&#233;es et 
ordonnanc&#233;es. Le premier module segmente le texte en sections, paragraphes et phrases, 
rep&#233;rant &#233;galement les titres. Le deuxi&#232;me, fond&#233; sur des mod&#232;les d&#8217;automates &#224; &#233;tats finis, 
est charg&#233; de rep&#233;rer les diff&#233;rentes instances des EC et de cr&#233;er les UT correspondantes avec 
toutes les annotations n&#233;cessaires. Ces annotations encodent notre alg&#232;bre. &#192; titre d&#8217;exemple, 
nous donnons dans Fig. 5 les annotations de l&#8217;EC &#171; avant le d&#233;but de la fin de l&#8217;ann&#233;e 2008 &#187;. 
Les annotations sont d&#233;finies en relation avec l&#8217;ensemble des informations mettant en 
particulier en &#233;vidence les types de cheminement op&#233;r&#233;s dans le calendrier selon la 
mod&#233;lisation propos&#233;e (cf. annotations OpTempR&#233;gionn, OpTempD&#233;placementn). Enfin, un 
troisi&#232;me module calcule l&#8217;ordonnancement des EC. 
</p>
<p>&lt;UT Type=&quot;Expression Calendaire&quot; Nro=&quot;7&quot;&gt; 
     &lt;Annotation Nom=&quot;Grain&quot;&gt;Ann&#233;e&lt;/Annotation&gt; 
     &lt;Annotation Nom=&quot;Ann&#233;e&quot;&gt;2008&lt;/Annotation&gt; 
     &lt;Annotation Nom=&quot;RelationCalendrier&quot;&gt;Absolue&lt;/Annotation&gt; 
     &lt;Annotation Nom=&quot;OpTempR&#233;gion1&quot;&gt;Avant&lt;/Annotation&gt; 
     &lt;Annotation Nom=&quot;OpTempD&#233;placement1&quot;&gt;FocalFin&lt;/Annotation&gt; 
     &lt;Annotation Nom=&quot;OpTempD&#233;placement2&quot;&gt;FocalD&#233;but&lt;/Annotation&gt; 
     &lt;Chaine&gt;avant le d&#233;but de la fin de l&#8217;ann&#233;e 2008&lt;/Chaine&gt; 
&lt;/UT&gt; 
</p>
<p>Figure 5 : Annotation de l&#8217;EC &#171; avant le d&#233;but de la fin de l&#8217;ann&#233;e 2008 &#187;  
</p>
<p>3.2 Vue calendaire d&#8217;un texte 
</p>
<p>On appelle calendrier (propre) du texte l&#8217;ensemble des &#233;l&#233;ments calendaires qui 
interviennent dans le texte. Au contraire du travail pr&#233;sent&#233; dans (Battistelli et al., 2007), o&#249; 
nous nous &#233;tions restreints aux EC cadratives, nous repr&#233;sentons actuellement toutes les EC. 
Un nouveau type de vue a &#233;t&#233; cr&#233;&#233; dans la plate-forme NaviTexte. Cette vue calendaire est 
construite &#224; partir d&#8217;un texte comportant des EC annot&#233;es comme d&#233;crit &#224; la section 3.1. Un 
exemple est donn&#233; dans Fig. 6 ; il correspond &#224; l&#8217;analyse d&#8217;un texte biographique tir&#233; du 
journal Le Monde du 6 octobre 2005 et intitul&#233; &#171; Villepin Pile et face &#187;. La vue est con&#231;ue 
comme un graphe coordonn&#233;, visuellement, &#224; une grille bidimensionnelle. Dans la partie 
gauche de la vue nous trouvons les cha&#238;nes lexicales des diff&#233;rentes instances d&#8217;EC du texte. 
Par d&#233;faut, celles-ci sont ordonn&#233;es selon l&#8217;ordre d&#8217;apparition dans le texte, mais il est 
possible de passer &#224; un ordonnancement chronologique, en utilisant les options offertes dans 
le panneau situ&#233; en bas de la vue. Ces cha&#238;nes lexicales sont repr&#233;sent&#233;es par des sommets 
dans le graphe. La repr&#233;sentation graphique de toute EC est plac&#233;e sur l&#8217;axe horizontal, en 
fonction de sa position dans l&#8217;ordonnancement temporel qui a &#233;t&#233; pr&#233;alablement calcul&#233; et </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Battistelli, Javier Couto, Jean-Luc Minel, Sylviane Schwer 
</p>
<p>encod&#233; comme une s&#233;quence dans le texte (cf. section 3.1). Notons que la relation entre l&#8217;axe 
horizontal et la s&#233;quence dans le texte n&#8217;est pas biunivoque, diff&#233;rentes EC pouvant r&#233;f&#233;rer &#224; 
la m&#234;me position sur l&#8217;axe horizontal. Pour chaque EC, d&#8217;autres sommets sont cr&#233;&#233;s dans le 
graphe, plac&#233;s sur la m&#234;me ligne horizontale. Le premier correspond &#224; la repr&#233;sentation 
graphique de celle-ci. Ensuite, deux autres sommets sont cr&#233;&#233;s, correspondant, l&#8217;un &#224; l&#8217;origo 
du r&#233;f&#233;rentiel propre au texte (dans l&#8217;exemple de Fig. 6, le 6 octobre 2005), l&#8217;autre au futur. 
Ces deux sommets peuvent co&#239;ncider si toutes les EC sont ant&#233;rieures &#224; l&#8217;origo. Une fois les 
sommets cr&#233;&#233;s, des arcs peuvent l&#8217;&#234;tre. Lorsqu&#8217;il s&#8217;agit d&#8217;une EC d&#233;ictique (ex. &#171; le 21 juin 
dernier &#187;), un arc dirig&#233; entre sa repr&#233;sentation graphique et le sommet repr&#233;sentant l&#8217;origo 
est cr&#233;&#233;. Lorsque l&#8217;EC contient un op&#233;rateur de r&#233;gionalisation (ex. : &#171; depuis 1980 &#187;), un arc 
non dirig&#233; est cr&#233;&#233;, d&#233;pendant de l&#8217;op&#233;rateur.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 6 : Exemple de vue calendaire dans NaviTexte 
</p>
<p>L&#8217;avantage d&#8217;utiliser une structure de graphe est double. D&#8217;une part, en tant que structure de 
donn&#233;es, celle-ci mod&#233;lise de mani&#232;re naturelle les divers &#233;l&#233;ments participant &#224; la vue 
calendaire d&#8217;un texte. D&#8217;autre part, en terme de visualisation, la gestion est simplifi&#233;e : 
lorsque l&#8217;utilisateur demande des changements (zooms de la vue, changements d&#8217;ordre des 
EC), il suffit de recalculer certaines positions des sommets, tandis que les arcs sont 
automatiquement modifi&#233;s. Nous avons utilis&#233; le package Java nomm&#233; JGraphe pour r&#233;aliser 
l&#8217;impl&#233;mentation informatique. Cela nous a permis en outre de combiner des aspects de 
mod&#233;lisation de donn&#233;es (comme les arcs correspondant aux op&#233;rateurs de r&#233;gionalisation) 
avec des aspects purement de visualisation (par exemple, dans l&#8217;interface de navigation 
d&#233;velopp&#233;e, les arcs en vert qui montrent le parcours chronologique, ou les arcs servant 
comme grille horizontale, qui peuvent &#234;tre activ&#233;s et d&#233;sactiv&#233;s en utilisant les options 
affich&#233;es dans le panneau situ&#233; en bas de la carte). L&#8217;utilisation d&#8217;infobulles sert &#224; 
contextualiser les EC par rapport au texte original. Dans Fig. 6, l&#8217;EC &#171; en 1953 &#187; appara&#238;t en 
rouge dans l&#8217;infobulle (partie de texte encadr&#233;e) qui montre la cha&#238;ne lexicale du paragraphe 
la contenant. Nous voudrions enfin attirer l&#8217;attention sur la mani&#232;re dont la repr&#233;sentation 
graphique d&#8217;une EC est calcul&#233;e par NaviTexte : elle proc&#232;de d&#8217;une m&#233;tamorphose 
relativement &#224; l&#8217;application progressive des diff&#233;rents op&#233;rateurs (cf. Tab. 5). Prenons comme </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Repr&#233;sentation alg&#233;brique des expressions calendaires et vue calendaire d&#8217;un texte 
</p>
<p>autre exemple l&#8217;EC &#171; apr&#232;s le milieu de la fin des ann&#233;es 1990 &#187;, dont l&#8217;expression 
fonctionnelle est apr&#232;s(le milieu de (la fin de(les (ann&#233;es 1990 )))). L&#8217;application de 
l&#8217;op&#233;rateur de pointage &#171; les &#187; cr&#233;e une repr&#233;sentation initiale qui est, toujours, une ellipse 
vide. Ensuite, l&#8217;op&#233;rateur &#171; la fin de &#187; s&#233;lectionne une partie de cette ellipse vide, partie sur 
laquelle se r&#233;alise une autre s&#233;lection lorsqu&#8217;on applique l&#8217;op&#233;rateur &#171; le milieu de &#187;. Une fois 
les op&#233;rateurs de d&#233;placement appliqu&#233;s, un op&#233;rateur de r&#233;gionalisation peut encore modifier 
l&#8217;image (s&#8217;il s&#8217;agit d&#8217;un op&#233;rateur inclusif comme depuis ou jusque) et susciter la cr&#233;ation 
d&#8217;un arc montrant la r&#233;gion r&#233;f&#233;r&#233;e4. 
</p>
<p>l&#8217;( ann&#233;e 2008 )   
la fin de ( l&#8217;( ann&#233;e 2008 ) )  
le d&#233;but de ( la fin de ( l&#8217;( ann&#233;e 2008 ) ) )  
avant ( le d&#233;but de ( la fin de ( l&#8217;( ann&#233;e 2008 ) ) ) )   
</p>
<p>Tableau 5. M&#233;tamorphose progressive dans la repr&#233;sentation graphique d&#8217;une EC 
</p>
<p>4 Conclusion 
</p>
<p>Nous avons pr&#233;sent&#233; ici une alg&#232;bre d&#8217;op&#233;rateurs rendant compte de la s&#233;mantique 
d&#8217;expressions calendaires et &#224; m&#234;me de sp&#233;cifier des op&#233;rations de repr&#233;sentation graphique 
de ces expressions. Comme expos&#233; dans (Le Draoulec et P&#233;ry-Woodley, 2005), s&#8217;il est 
ind&#233;niable que les adverbiaux temporels jouent un r&#244;le structurant, ils ne constituent pas 
n&#233;cessairement un outil d&#8217;indexation fiable de propositions ou de blocs de propositions. 
Aussi, nous les consid&#233;rons seulement comme des &#171; indices &#187; de structuration temporelle ou 
encore comme autant de marques dispos&#233;es dans le texte non explicitement reli&#233;es &#224; des 
segments textuels donn&#233;s. Ce qui nous int&#233;resse ici n&#8217;est pas d&#8217;analyser la port&#233;e s&#233;mantique 
de ces marques et de chercher alors &#224; structurer le texte &#224; partir de ces marques. Il s&#8217;agit 
plut&#244;t de s&#8217;abstraire du texte pour en extraire son calendrier propre &#224; partir duquel l&#8217;on 
cherche &#224; mod&#233;liser le balayage effectu&#233; par le lecteur selon une dimension temporelle. Dans 
cette d&#233;marche, l&#8217;accent est donc mis sur la mise en perspective de la fa&#231;on dont un lecteur 
appr&#233;hende le parcours op&#233;r&#233; dans le calendrier au travers de ces marques. Nous travaillons 
par ailleurs &#224; l&#8217;identification de sous-syst&#232;mes calendaires &#224; partir de l&#8217;analyse des diff&#233;rentes 
prises en charge &#233;nonciative et modale dans les textes selon une m&#233;thodologie pr&#233;sent&#233;e dans 
(Battistelli et Chagnoux, 2007). Cette derni&#232;re rend compte des articulations complexes 
possibles entre plusieurs niveaux de discours &#224; l&#8217;int&#233;rieur d&#8217;un m&#234;me texte ; ils correspondent 
&#224; une plus ou moins grande distance marqu&#233;e par l&#8217;&#233;nonciateur principal dans les situations 
qu&#8217;il d&#233;crit (avec l&#8217;utilisation de marques de discours directs et indirects en particulier). Les 
segments textuels ainsi identifi&#233;s sont organis&#233;s de mani&#232;re hi&#233;rarchique. Il s&#8217;agit alors de 
consid&#233;rer que chaque ensemble d&#8217;EC possiblement pr&#233;sentes dans un segment forme un 
sous-syst&#232;me calendaire propre et que l&#8217;ensemble des EC d&#8217;un texte peut donc renvoyer &#224; 
diff&#233;rents sous-syst&#232;mes calendaires propres &#224; l&#8217;int&#233;rieur desquels &#8211; ou entre lesquels &#8211; un 
parcours de navigation peut &#234;tre envisag&#233;.  
</p>
<p>Remerciements 
</p>
<p>Notre travail s&#8217;inscrit dans le cadre des financements de l'ANR (programme Blanc Conique). 
/NaviTexte/ est soutenu actuellement par le programme ECOS-Sud U05H01.   
                                                 
</p>
<p>4  Nous avons trouv&#233; une occurrence d&#8217;un tel type d&#8217;expressions, &#224; savoir &#171; depuis le milieu de la fin 1990 &#187;, 
dans le compte-rendu d&#8217;audience du Tribunal P&#233;nal International pour l&#8217;ex-Yougoslavie, consult&#233; le 
15/11/2007 &#224; l&#8217;adresse http://www.un.org/ictytransf54/060203IT.htm (p. 47899).  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Delphine Battistelli, Javier Couto, Jean-Luc Minel, Sylviane Schwer 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BATTISTELLI D., CHAGNOUX M. (2007). &#171; Repr&#233;senter la dynamique &#233;nonciative et modale de 
textes &#187;. Actes TALN&#8217;07, 5-8 juin 2007, Toulouse, p. 23-32. 
</p>
<p>BATTISTELLI D., MINEL J-L., SCHWER S. (2007). &#171; Repr&#233;sentation des expressions calendaires 
dans les textes : vers une application &#224; la lecture assist&#233;e de biographies &#187;. TAL Vol 47/3, p. 
11-37. 
</p>
<p>COUTO J. (2006). Mod&#233;lisation des connaissances pour une navigation textuelle assist&#233;e. La 
plate-forme logicielle NaviTexte. Th&#232;se de doctorat, Universit&#233; Paris-Sorbonne (Paris IV). 
</p>
<p>COUTO J., MINEL J.-L. (2007). &#171; NaviTexte, a Text Navigation Tool &#187;. 10th Congress of 
Italian Association for Artificial Intelligence. Lecture Notes in Computer Science 4733, p. 
251&#8722;259. 
</p>
<p>FERRO L., GERBER L., MANI I., SUNDHEIM B., WILSON G. (2003). &#171; TIDES Standard for the 
Annotation of Temporal Expressions &#187;, http ://www.mitre.org/work/tech\-papers/tech\-
papers\-04/ferro\-tides/. 
</p>
<p>GUIMIER C. (1996). Les adverbes du fran&#231;ais. Le cas des adverbes en -ment. Paris. Ophrys. 
</p>
<p>HARABAGIU S., BEJAN A. (2005). &#171; Question Answering Based on Temporal Inference &#187;. 
Actes AAAI-2005 Workshop on Inference for Textual Question Answering. 
</p>
<p>LE DRAOULEC A., P&#201;RY-WOODLEY M.-P. (2005). &#171; Encadrement temporel et relations de 
discours &#187;. Langue Fran&#231;aise 148, p. 45-60. 
</p>
<p>MAUREL D. (1989). Reconnaissance de s&#233;quences de mots par automates, adverbes de date du 
Fran&#231;ais. Th&#232;se de doctorat, Universit&#233; Paris 7. 
</p>
<p>PUSTEJOVSKY J., SAURI R., CASTA&#209;O J., RADEV D.R., GAIZAUSKAS R., SETZER A., SUNDHEIM 
B., KATZ G. (2004). &#171; Representing Temporal and Event Knowledge for QA Systems &#187;. Mark 
T. Maybury (ed.), New Directions in Question Answering. MIT Press, Cambridge. 
</p>
<p>PUSTEJOVSKY J., CASTANO J., INGRIA R. , SAURI R., GAIZAUSKAS R., SETZER A., KATZ G. 
(2003). &#171; TimeML : Robust Specification of Event and Temporal Expressions in Text &#187;. 
Actes IWCS-5 Fifth International Workshop on Computational Semantics. 
</p>
<p>SCHILDER F., HABEL CH. (2001). &#171; From Temporal  Expressions to Temporal Information : 
Semantic Tagging of News Messages. &#187;. Actes ACL&#8217;01, Workshop on temporal and spatial 
information processing, p. 65 -72. 
</p>
<p>SETZER A., GAIZAUSKAS R. (2000). &#171; Annotating Events and Temporal Information in 
Newswire Texts &#187;. Actes 2&#232;me LREC, p. 64-66. 
</p>
<p>TERQAS (2002). Time and Event Recognition for Questions Answering Systems, an ARDA 
Workshop on Advanced Question Answering Technology. http ://www.timeml.org/terqas/. 
</p>
<p>TERRAN E. (2002). Le cadrage temporel en fran&#231;ais. Th&#232;se de doctorat, Universit&#233; Paris 3. 
</p>
<p>VAZOV N. (2001). &#171; A System for Extraction of Temporal Expressions from French Texts &#187;. 
Actes TALN&#8217;2001, p. 315-324. </p>

</div></div>
</body></html>