<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Dissym&#233;trie entre l'indexation des documents et le traitement des requ&#234;tes pour la recherche d&#8217;information en langue arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p>Dissym&#233;trie entre l'indexation des documents et le traitement des 
requ&#234;tes pour la recherche d&#8217;information en langue arabe 
</p>
<p> 
</p>
<p>Ramzi ABB&#200;S(1), Malek BOUALEM (2) 
 
</p>
<p>(1) ICAR-CNRS/ Lyon 2,  
ramzi.abbes@univ-lyon2.fr 
</p>
<p>(2) Orange Labs &#8211; France Telecom R&amp;D 
malek.boualem@orange-ftgroup.com 
</p>
<p> 
</p>
<p>R&#233;sum&#233; 
Les moteurs de recherches sur le web produisent des r&#233;sultats comparables et assez 
satisfaisants pour la recherche de documents &#233;crits en caract&#232;res latins. Cependant, ils 
pr&#233;sentent de s&#233;rieuses lacunes d&#232;s que l'ont s'int&#233;resse &#224; des langues peu dot&#233;es ou des 
langues s&#233;mitiques comme l'arabe. Dans cet article nous pr&#233;sentons une &#233;tude analytique et 
qualitative de la recherche d&#8217;information en langue arabe en mettant l'accent sur l'insuffisance 
des outils de recherche actuels, souvent mal adapt&#233;s aux sp&#233;cificit&#233;s de la langue arabe. Pour 
argumenter notre analyse, nous pr&#233;sentons des r&#233;sultats issus d&#8217;observations et de tests autour 
de certains ph&#233;nom&#232;nes linguistiques de l&#8217;arabe &#233;crit. Pour la validation des ces observations, 
nous avons test&#233; essentiellement le moteur de recherche Google. 
</p>
<p>Abstract 
Web search engines provide quite good results for Latin characters-based languages. 
However, they still show many weaknesses when searching in other languages such as Arabic. 
This paper discusses a qualitative analysis of information retrieval in Arabic language, 
highlighting some of the numerous limitations of available search engines, mainly when they 
are not properly adapted to the Arabic language specificities. To argue our analysis, we 
present some results based on quite sufficient observations and tests on various Arabic 
linguistic phenomena. To validate these observations, we essentially have tested the Google 
search engine. 
</p>
<p> 
</p>
<p>Mots cl&#233;s : recherche d&#8217;information, langue arabe, indexation, lemmatisation, Google 
</p>
<p>Keyword : information retrieval, Arabic, indexation, lemmatization, Google 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ramzi ABB&#201;S et Malek BOUALEM 
</p>
<p>1 Introduction 
Avec 90,83% de part de march&#233; en d&#233;cembre 20071, Google est probablement le moteur de 
recherche le plus puissant sur le march&#233;, ou du moins, le plus utilis&#233;, car il existe bien une 
corr&#233;lation entre les deux constats. 
</p>
<p> 
</p>
<p>Figure 1.  Top 5 des moteurs de recherche en parts de visites 
</p>
<p>Le syst&#232;me de recherche de Google ainsi que le PageRank (S. Brin and L. Page, 1988) restent 
tr&#232;s sensibles au comportement des internautes. En effet, les algorithmes de Google pond&#232;rent 
positivement ou n&#233;gativement les pages en fonction du nombre de clics sur les liens retourn&#233;s. 
Le PageRank de Google note les pages en fonction des liens hypertextes qu&#8217;elles contiennent 
(P. Chen et al ; 2007). Selon que les pages aient &#233;t&#233; visit&#233;es ou non apr&#232;s une recherche, elles 
gagnent ou perdent des points dans le classement par rapport aux mots cl&#233;s recherch&#233;s. Dans 
d&#8217;autres cas, selon que la page ait servi de routeur aux internautes ou pas (c'est-&#224;-dire que la 
page ait &#233;t&#233; pertinente pour la recherche et aurait contenu des liens qui auraient &#233;t&#233; suivis par 
l&#8217;internaute), elle gagne des points dans les priorit&#233;s d&#8217;indexation. 
</p>
<p>Si l&#8217;utilisateur retrouve quelques r&#233;ponses satisfaisantes dans la premi&#232;re page des r&#233;sultats de 
Google, il est souvent loin de trouver la meilleure r&#233;ponse. Il s&#8217;agit surtout des r&#233;ponses les 
plus populaires. En effet, il est clair que, parmi les milliards de pages sur internet, les 
informations recherch&#233;es ne peuvent pas se retrouver uniquement sur une dizaine (ou 
quelques dizaines) de documents propos&#233;s. 
</p>
<p>Ce constat est encore plus r&#233;el lorsque Google est utilis&#233; en langue arabe. En effet, nous avons 
remarqu&#233; que la plupart des r&#233;ponses figurant en t&#234;te de liste, pour une requ&#234;te en arabe, 
proviennent des sites de discussions &#1578;&#2;&#3;&#4;&#5;&#6;&#7; mntdy&#226;t ou d&#8217;autres sources sp&#233;cifiques. Le 
PageRank de Google surclasse ces sources d&#8217;informations riches en renvois hypertextes et 
beaucoup plus utilis&#233;es dans le monde arabe au d&#233;triment d'autres sources d'informations en 
provenance de travaux universitaires, journalistiques, etc. 
                                                 
</p>
<p>1
 http://barometre.secrets2moteurs.com/index.php/Barometre-1ere-position-xiti </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport du TAL pour la RI en arabe 
</p>
<p>  
</p>
<p>L&#8217;essentiel de la population des internautes arabophones ma&#238;trise une seconde langue, le 
fran&#231;ais ou l&#8217;anglais. Le web &#233;tant tr&#232;s bien d&#233;velopp&#233; dans l&#8217;une et l&#8217;autre de ces deux 
langues, l&#8217;internaute arabe s&#8217;oriente vers le multilinguisme pour une grande partie de ses 
recherches. Cet &#233;tat de fait n&#8217;aide forc&#233;ment pas au d&#233;veloppement des ressources 
d'information en langue arabe. Par certains aspects de sp&#233;cialisation de la recherche, comme 
Google Scholar (C. Neuhaus, E. Neuhaus and A. Asher, 2008), le moteur de recherche donne 
souvent des r&#233;ponses satisfaisantes. La mesure du degr&#233; de pertinence suppose une 
connaissance de l&#8217;ensemble des documents existants sur le web. 
</p>
<p>Dans cet article, nous nous int&#233;ressons &#224; un certain nombre de ph&#233;nom&#232;nes linguistiques afin 
de mettre en &#233;vidence la n&#233;cessit&#233; de traitements plus approfondis lors de l'indexation des 
documents &#233;crits en langue arabe. Dans un premier temps, nos parlerons de la couverture des 
moteurs de recherche pour l&#8217;arabe et de la dissym&#233;trie entre l&#8217;indexation et la recherche 
d&#8217;information, particuli&#232;rement palpable pour l'arabe non vocalis&#233;. Par la suite, nous 
insisterons sur l&#8217;apport des traitements linguistiques pour l&#8217;am&#233;lioration de la recherche en 
arabe. Nous conclurons l&#8217;article par une &#233;tude statistique sur quelques exceptions 
orthographiques tr&#232;s r&#233;pondues aupr&#232;s des auteurs arabes. 
</p>
<p>2  La langue arabe sur le web 
</p>
<p>2.1 Couverture des moteurs de recherche 
</p>
<p>Les robots des moteurs de recherche (spiders ou crawlers) parcourent les sites de la toile, &#224; 
intervalles r&#233;guliers. L&#8217;exploration est ind&#233;pendante de l&#8217;alphabet, elle d&#233;pend surtout des 
performances en terme de couverture de chacun des moteurs. La probl&#233;matique de recherche 
d&#8217;information d&#233;pend de deux facteurs, le premier concerne l&#8217;indexation des pages et le 
second est li&#233; &#224; la recherche dans les index ou dans les pages elles m&#234;mes. 
</p>
<p>L&#8217;indexation des pages web se fait, pour l&#8217;essentiel des moteurs de recherche, par l&#8217;une ou la 
combinaison des m&#233;thodes suivantes : 
</p>
<p>- La r&#233;cup&#233;ration des balises &#171; m&#233;ta &#187; contenant les mots cl&#233;s d&#233;crivant le contenu des 
pages et propos&#233;s par le cr&#233;ateur du site. 
</p>
<p>- La r&#233;cup&#233;ration du contenu de la balise &#171; titre &#187;, il est d&#8217;ailleurs recommand&#233; de 
donner des titres diff&#233;rents &#224; chacune des pages web du site pour avoir un maximum 
de chance de ressortir ces pages parmi les r&#233;sultats du moteur. 
</p>
<p>Pour les ressources jug&#233;es importantes, les robots peuvent indexer tout le contenu de la page. 
La recherche est la partie secr&#232;te des robots, les algorithmes pond&#232;rent les pages en fonction 
d&#8217;un ensemble de crit&#232;res comme la position du mot dans la page (titre, paragraphe, lien 
hypertexte) en fonction de l&#8217;historique ou encore de la nature de la ressource. 
</p>
<p>Les webmestres de leurs c&#244;t&#233;s positionnent les mots pertinents pour leurs sites dans les 
endroits strat&#233;giques pour le robot de recherche. Cet aspect n&#8217;a pas de pertinence par rapport 
aux langues utilis&#233;es, mais il est pertinent selon le traitement linguistique possible dans 
chacun des moteurs, en fonction de leur ma&#238;trise de la lemmatisation, de la d&#233;rivation ou de 
leurs ontologies pour relier des mots de la recherche aux mots cl&#233;s proches s&#233;mantiquement 
ou faisant partie de la m&#234;me famille morphologique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ramzi ABB&#201;S et Malek BOUALEM 
</p>
<p>2.2 Dissym&#233;trie de l&#8217;indexation et la recherche en langue arabe 
</p>
<p>La recherche d'information en langue arabe montre souvent une certaine dissym&#233;trie entre 
l'indexation et le traitement des requ&#234;tes provoqu&#233;e particuli&#232;rement par l&#8217;absence des 
voyelles dans les textes arabes &#233;crits et aussi par la nature agglutinante de l'&#233;criture arabe. 
</p>
<p>Par exemple2, lors de l&#8217;indexation d&#8217;un document, le verbe &quot;&#233;crire&quot; (&#8;&#5;&#1614;&#1614;&#1570; katab), le nom 
&quot;livres&quot; (&#8;&#5;&#1615;&#1615;&#1570; kutub ) et le nom &quot;&#233;crit&quot; (&#8;&#5;&#1618;&#1614;&#1570; katb ) sont tous index&#233;s sous une seule et m&#234;me 
entr&#233;e &#8;&#5;&#1570; ktb , car ils ne sont g&#233;n&#233;ralement pas vocalis&#233;s dans le texte. Il en est de m&#234;me pour 
le mot ''&#14;&#15;&#16; &#352;&#221;r &quot; dont les diff&#233;rentes vocalisations peuvent avoir des significations diff&#233;rentes 
(sentir, po&#232;me, cheveux, etc.) ou encore le mot ''&#17;&#18;&#19;'' &#221;lm qui peut d&#233;signer plusieurs sens 
(drapeau, science, conna&#238;tre, etc.). 
</p>
<p>Quelles que soient les pr&#233;cisions apport&#233;es &#224; la recherche (m&#234;me si on note le mot enti&#232;rement 
vocalis&#233;), le moteur ne pourra pas s&#233;parer ces formes &#233;tant donn&#233; qu&#8217;elles ne sont pas 
vocalis&#233;es &#224; la base. Par cons&#233;quent, les mots de l&#8217;index ne sont pas vocalis&#233;s non plus. 
</p>
<p>L&#8217;agglutination consiste, en figure simplifi&#233;e, en l&#8217;augmentation de la forme minimale du mot 
par des proclitiques (pour signifier l&#8217;interrogation, la ressemblance, la liaison, etc.) ou des 
enclitiques (pour rajouter notamment des pronoms). Ces trois exemples illustrent divers cas 
d'agglutination : (1) Kateb Yassine &#20;&#21;&#22;&#3; &#8;&#23;&#2;&#1570; k&#226;tb ysyn , (2) est-ce que Kateb Yassine ?  &#8;&#23;&#2;&#1570;&#1571;
&#20;&#21;&#22;&#3; &#222;k&#226;tb ysyn , (3) j&#8217;&#233;cris &#224; Yassine &#20;&#21;&#22;&#3; &#8;&#23;&#2;&#1570;&#1571; &#222;k&#226;tb ysyn . 
</p>
<p>2.3 Recherche d&#8217;information en langue arabe 
</p>
<p>Une grande partie des requ&#234;tes sur le web, ind&#233;pendamment des langues, concernent des 
entit&#233;s nomm&#233;es tels que des noms propres. Nos tests sur un &#233;chantillon de 2850 requ&#234;tes 
arabes sur un annuaire (M. Boualem et al., 2001) nous ont permis de constater que 94,2% des 
requ&#234;tes concernent les formes nominales, 3,30% concernent les formes verbales et 2,5% 
concernent les mots grammaticaux. Bien entendu, ces valeurs peuvent &#234;tre ajust&#233;es si nous  
prenons en compte le contexte non vocalis&#233; des requ&#234;tes. En effet, en dehors de quelques 
formes verbales et de mots grammaticaux non ambigus comme &#20;&#7; mn , &#25;&#5;&#7; mt &#180;, &#1593;&#14;&#5;&#28;&#1575; &#226;&#204;tr&#221; 
(invent&#233;) , on retrouve beaucoup de formes ambigu&#235;s comme &#1604;&#31;  nzl  (descendre ou h&#244;tel) , 
!&quot;&#1585; rq&#210; , &#8;&#18;$ &#212;lb  (demander, une demande) . Notons aussi que les formes verbales 
rencontr&#233;es ne sont pas fl&#233;chies. 
</p>
<p>Mots graphiques 
Formes Verbales Mots outils Formes nominales 
</p>
<p>3,30% 3% 94,20% 
 
</p>
<p>La particularit&#233; des noms propres arabes est qu&#8217;ils sont souvent des d&#233;riv&#233;es de formes 
verbales (participe actif, participe passif, etc.). &#8;&#23;&#2;&#1570; k&#226;tb d&#233;signe &#224; la fois l&#8217;&#233;crivain et aussi un 
</p>
<p>                                                 
</p>
<p>2
 Pour la translitt&#233;ration des caract&#232;res arabes en caract&#232;res latins, nous utilisions la norme ISO 233-2 (Z 46-002, 
</p>
<p>d&#233;cembre 1993) : [&#1571;, &#222;] [&#1576;, b] [&#1578;, t] [&#1579;, &#215;][&#1580;, &#202;] [&#1581;, &#206;] [&#1582;, &#204;] [&#1583;, d] [&#1584;, &#198;] [&#1585;, r] [&#1586;, z] [&#1587;, s] [&#1588;, &#352;] [&#1589;, &#210; ] 
[&#1590;, &#195;] [&#1591;, &#212;] [&#1592;, &#219;] [&#1593;, &#221;] [&#1594;, &#200;] [&#1601;, f] [&#1602;, q] [&#1603;, k] [&#1604;, l] [&#1605;, m] [&#1606;, n] [9, h] [&#1608;, w] [&#1610;, y] [, a] [&#1611;, &#8709;] [&#1615;, u] [&#1612;, ] 
[,&#1618; &#8709;] [,&#1616; i] [,&#1613; &#8709;] [&#1575;, &#8709;] </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport du TAL pour la RI en arabe 
</p>
<p>  
</p>
<p>nom propre comme pour Kateb Yassine. Toutefois, la recherche par &#8;&#23;&#2;&#1570; k&#226;tb  renvoie 
essentiellement &#233;crivain. Voici quelques exemples de recherche avec des noms : 
</p>
<p>La recherche du mot &#8;&#5;&#1614;&#1614;&#1570; katab  sur Google donne, sur les premiers r&#233;sultats, la notion de 
&#171;livres&#187;. S'agit-il d'une question de &#171;ranking&#187; ou de priorit&#233; donn&#233; aux noms ? Cependant, 
nous constatons que la voyellation du mot cl&#233; n&#8217;a aucune influence sur la recherche.  
</p>
<p>Soit une recherche autour du pr&#233;nom Jamel Eddine Elafghani &#1;&#2;&#3;&#4;&#5;&#6;&#1575; &#9;&#10;&#11;&#12;&#1575; &#1604;&#3;&#14;&#15;  &#202;m&#226;l &#226;ldyn 
&#226;l&#222;f&#200;&#226;ny  et Jamel Abdennasser le leader &#16;&#17;&#18;&#19;&#12;&#1575; &#20;&#21;&#3;&#22;&#12;&#1575; &#11;&#23;&#18; &#1604;&#3;&#14;&#15; &#202;m&#226;l &#221;bd &#226;ln&#226;&#210;r &#226;lz&#221;ym . La 
recherche par &#1604;&#2;@A  &#202;m&#226;l  renvoie en premier les r&#233;sultats concernant l&#8217;adjectif beaut&#233; (le 
pr&#233;nom et l&#8217;adjectif ont la m&#234;me forme graphique non vocalis&#233;) et pas le pr&#233;nom. Nous 
trouvons 5 340 000 pour &#1604;&#3;&#14;&#15; &#202;m&#226;l  , 737 000 pour &#9;&#10;&#11;&#12;&#1575; &#1604;&#3;&#14;&#15; &#202;m&#226;l &#226;ldyn , 70 700 pour  &#1604;&#3;&#14;&#15;
&#1;&#2;&#3;&#4;&#5;&#6;&#1575; &#9;&#10;&#11;&#12;&#1575; &#202;m&#226;l &#226;ldyn &#226;l&#222;f&#200;&#226;ny . Pour la recherche de Nasser, nous obtenons 805 000 pour 
&#23;&#18; &#1604;&#3;&#14;&#15;&#11; , 293 000 pour &#20;&#21;&#3;&#22;&#12;&#1575; &#11;&#23;&#18; &#1604;&#3;&#14;&#15; &#202;m&#226;l &#221;bd &#226;ln&#226;&#210;r , 253 000 pour &#16;&#17;&#18;&#19;&#12;&#1575; &#20;&#21;&#3;&#22;&#12;&#1575; &#11;&#23;&#18; &#1604;&#3;&#14;&#15;  
</p>
<p>&#202;m&#226;l &#221;bd &#226;ln&#226;&#210;r &#226;lz&#221;ym . Parall&#232;lement, une recherche avec la mot &#21;&#19;&#31;B&#1575;&#17;  &#226;lz&#221;ym , donne 
2 100 000 pour  &#16;&#17;&#18;&#19;&#12;&#1575; &#226;lz&#221;ym . Nous trouvons parmi les premiers r&#233;sultats des blogs 
d&#8217;amateurs de foot, des informations sur la pi&#232;ce de th&#233;&#226;tre de Adel Imam (742 000 pour  &#16;&#17;&#18;&#19;&#12;&#1575;
&#1604;&#1583;&#3;&#18; &#226;lz&#221;ym &#221;&#226;dl ). Le premier r&#233;sultat concernant &#20;&#21;&#3;&#22;&#12;&#1575; &#11;&#23;&#18; &#1604;&#3;&#14;&#15; &#202;m&#226;l &#221;bd &#226;ln&#226;&#210;r arrive en 
trenti&#232;me position. Nous constatons donc une grande faiblesse dans le traitement r&#233;serv&#233; 
aux entit&#233;s nomm&#233;es.  
</p>
<p>Au niveau de notre corpus de travail nous avons r&#233;parti les entit&#233;s nomm&#233;es identifi&#233;es 
automatiquement entre les trois cat&#233;gories repr&#233;sent&#233;es ci-dessous : 
</p>
<p>Noms propres 
Pays Noms/pr&#233;noms villes 
</p>
<p>74,75% 23,41% 1,87% 
 
</p>
<p>3 Apport de l&#8217;analyse linguistique pour la recherche 
d&#8217;information en langue arabe 
</p>
<p>En r&#233;alit&#233;, la recherche d'information est une t&#226;che d&#233;pendante de la langue et son succ&#232;s est 
donc li&#233; aux langues des documents et &#224; la mani&#232;re dont les moteurs prennent en compte les 
caract&#233;ristiques de la langue concern&#233;e. 
</p>
<p>A notre avis, les caract&#233;ristiques qui ont le plus d'impact sur la pr&#233;cision des moteurs de 
recherche concernent principalement la structure morphologique des mots et les variations 
morphologiques d'un m&#234;me mot, d&#8217;o&#249; l&#8217;importance accord&#233;e par les moteurs de recherche &#224; la 
lemmatisation et &#224; la troncature. 
</p>
<p>L'apport de la lemmatisation reste discutable pour l&#8217;am&#233;lioration des performances des 
syst&#232;mes de recherche d'information dans les documents anglais (D. Harman 1991, 1995), car 
les r&#232;gles de formations des mots en anglais sont relativement limit&#233;es et syst&#233;matiques. Les 
langues &#224; morphologie complexe comme l'arabe (J. Dichy, 1990), pr&#233;sentent un d&#233;fit aux 
syst&#232;mes de recherche puisque le nombre de r&#232;gles morphologiques est important et non 
syst&#233;matique. Nous allons montrer dans ce qui suit l&#8217;insuffisance des traitements de surface et 
l&#8217;apport de la lemmatisation &#224; la recherche d&#8217;information en arabe. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ramzi ABB&#201;S et Malek BOUALEM 
</p>
<p>Les moteurs de recherche utilisent les parcours de surface pour l&#8217;identification des mots, 
tandis que le mot graphique en arabe pr&#233;sente un caract&#232;re complexe et la notion de noyaux 
est tr&#232;s vague pour la recherche de s&#233;quences. L&#8217;arabe est une langue flexionnelle o&#249; les 
familles morphologiques (d&#233;riv&#233;es d&#8217;une m&#234;me racine) peuvent atteindre une taille assez 
importante. Nous trouvons souvent des formes graphiques proches ou semblables mais 
n&#8217;appartenant pas &#224; la m&#234;me famille morphologique. 
</p>
<p>Voyons, &#224; titre d&#8217;exemple, ce que donne une recherche de surface des d&#233;riv&#233;es du mot &#1604;&#2;&quot;  q&#226;l. 
La requ&#234;te &#171; *&#1604;&#2;&quot;* &#187; donne pr&#233;s de 146 formes dans un corpus, ce qui d&#233;passe largement les 
possibilit&#233;s d&#233;rivationnelles de ce mot. En effet, la requ&#234;te renvoie des termes comme   &#1604;&#2;C&#5; D&#1575; ,
</p>
<p> &#17;FB&#2;C&#5;&#19;&#1575; , GB&#2;C&#5;H&#1575; , &#1604;&#2;C&#15;B&#1575; , &#17;F&#5;B&#2;&quot;&#1575; &#4;&#21;B&#2;C&#7; , &#4;&#21;B&#2;C&#5;B&#1575;, G&#21;B&#2;C&#23;&#14;I  , &#1611;D&#2;CJ&#1575; , &#1611;&#2;KB&#2;&quot;&#1608; , &#17;&#21;B&#2;&quot;L&#1575; , &#8;B&#2;&quot;  &#8230;   En plus de ce bruit 
consid&#233;rable, beaucoup de formes de ce mot restent muettes et il est n&#233;cessaire de les 
rechercher &#224; travers d&#8217;autres requ&#234;tes : c&#8217;est le cas de toutes les formes d&#233;clin&#233;es de 
l&#8217;inaccompli  &#1604;NC&#3; et des autres d&#233;verbaux.  
</p>
<p>En proc&#233;dant &#224; une lemmatisation automatique, malgr&#233; tous les probl&#232;mes inh&#233;rents &#224; cette 
t&#226;che, nous pourrions &#233;viter la plupart des ambigu&#239;t&#233;s pr&#233;sent&#233;es ci-dessus.  
</p>
<p>Soit l&#8217;exemple de recherche du mot &#171; &#1569;&#2;@H sm&#226;&#222;  &#187; ciel, Google renvoie 594 000 pour &#1569;&#3;&#14;&#26; 
sm&#226;&#222;  en appliquant le principe de la compl&#233;tion. Les r&#233;sultats contiennent aussi 279 000 
pour &#1569;&#3;&#14;&#26;&#1571; &#222;sm&#226;&#222; (des pr&#233;noms ou des noms), parmi lesquelles nous trouvons aussi &#1569;&#3;&#14;&#26;&#6;&#1575; 
&#226;l&#222;sm&#226;&#222; les pr&#233;noms (les rares cas du pluriel de &#1569;&#2;@H  sm&#226;&#222;   sont renvoy&#233;s dans des titres 
comme &#1578;&#1575;&#1608;&#2;@&#22;B&#1575; &#1569;&#2;@H&#1571; &#222;sm&#226;&#222; &#226;lsm&#226;w&#226;t .). Cet &#233;cart s&#233;mantique et morphologique entre les 
mots de la recherche provient de l&#8217;application des r&#232;gles de lemmatisation des langues &#224; 
caract&#232;res latins sur l&#8217;arabe. 
</p>
<p>D&#8217;un autre c&#244;t&#233;, la proc&#233;dure de recherche est souvent confront&#233;e &#224; la nature agglutinante de 
l&#8217;arabe. Par exemple tous les noms communs peuvent &#234;tre pr&#233;c&#233;d&#233; du proclitique de 
d&#233;termination  &#1604;&#1575; &#226;l , de politiques de liaison, de ressemblance, d&#8217;interrogation, &#8230; et peuvent 
&#234;tre suivis d'enclitiques pronoms ainsi que de suffixes du pluriel, du duel, du f&#233;minin, &#8230; Dans 
un corpus journalistique de deux millions de mots (pr&#233;sent&#233; dans le dernier paragraphe), nous 
avons reconnus 35 formes augment&#233; du mot &#1576;&#2;&#5;&#1570; livre, pour obtenir les formes &#1576;&#2;&#5;QB&#1575; &#226;lkt&#226;b, le 
livre  /&#20;&#21;I&#2;&#5;QB&#1575;  &#226;lkt&#226;byn, les deux livres/  &#1576;&#2;&#5;QB&#2;I   b&#226;lkt&#226;b, avec le livre/   &#1576;&#2;&#5;QI bkt&#226;b, avec livre/  
SI&#2;&#5;QI bkt&#226;bh, avec son(lui) livre/  &#2;FI&#2;&#5;QI  bkt&#226;bh&#226;, avec son(elle) livre   
</p>
<p>Bien entendu, l&#8217;ambigu&#239;t&#233; &#171; naturelle &#187; de la langue arabe, &#224; tous les niveaux linguistiques, 
vient s'ajouter pour complexifier tous ces probl&#232;mes, d&#233;j&#224; nombreux, en recherche 
d'information en langue arabe. 
</p>
<p>Lemmatisation 
</p>
<p>La lemmatisation se d&#233;finit par l'identification d'une forme canonique correspondant &#224; 
diff&#233;rentes formes flexionnelles ou d&#233;rivationnelles d'un mot donn&#233; (d&#233;rivation du pluriel, du 
singulier, du f&#233;minin ou du masculin, etc.). L&#8217;application de la lemmatisation en recherche 
d'information en langue arabe ne donne pas toujours les r&#233;sultats escompt&#233;s car le syst&#232;me 
r&#233;gissant la d&#233;rivation en arabe est plus complexe et ne se r&#233;sume pas, souvent, &#224; une simple 
suffixation. 
</p>
<p>Toutefois la lemmatisation est indispensable en arabe en raison du caract&#232;re agglutinant de la 
langue. Le mot graphique en arabe est augment&#233; par les proclitiques (de coordination, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport du TAL pour la RI en arabe 
</p>
<p>  
</p>
<p>d&#8217;interrogation, marque de future, de d&#233;termination, de pr&#233;position, &#8230;) et les enclitiques 
(essentiellement des pronoms). 
</p>
<p>Dans ce qui suit, nous allons pr&#233;senter les difficult&#233;s de la lemmatisation concernant deux 
aspects nominaux &#224; savoir (1) le passage du singulier au pluriel ainsi que (2) le passage du 
masculin au f&#233;minin. Nous montrerons l&#8217;insuffisance des techniques de suffixation &#224; travers 
des exemples. 
</p>
<p>Du c&#244;t&#233; des utilisateurs, ils introduisent toujours des mots minimaux, c'est-&#224;-dire sans 
clitiques, sauf le proclitique de d&#233;termination qui permet souvent de lever les ambig&#252;it&#233;s entre 
les noms et les verbes. 
</p>
<p>D&#233;termination 
Ind&#233;termin&#233; D&#233;termin&#233; 
</p>
<p>61,03% 37,97% 
 
</p>
<p>Etant donn&#233; le nombre consid&#233;rable de r&#233;ponses renvoy&#233;s pour les requ&#234;tes avec 
d&#233;termination ou avec clitiques d&#8217;une mani&#232;re g&#233;n&#233;rale, nous n&#8217;avons pas pu v&#233;rifier si le 
moteur Google proc&#232;de &#224; la lemmatisation ou pas. En tout cas tous les r&#233;sultats retourn&#233;s 
contiennent la cha&#238;ne exacte recherch&#233;e. 
</p>
<p>Singulier pluriel 
Soit le mot pluriel &#1578;&#2;I&#2;&#5;&#1570; kt&#226;b&#226;t (des &#233;crits), la proc&#233;dure de lemmatisation classique qui 
consid&#232;re que le pluriel est obtenu par la suffixation de &#1578;&#1575; &#226;t  au nom singulier pour 
l&#8217;obtention du pluriel donnera le lemme &#1576;&#2;&#5;&#1570; kt&#226;b  pour &#1578;&#2;I&#2;&#5;&#1570; kt&#226;b&#226;t , alors que le lemme est 
&#5;&#1570;GI&#2;  kt&#226;bt &#168;. L&#8217;obtention du singulier &#224; partir du duel peut poser quelques difficult&#233;s aussi, 
</p>
<p>pour passe du duel &#1606;&#2;&#23;&#2;&#5;U ft&#226;t&#226;n  au singulier il est n&#233;cessaire de retirer le suffixe &#1606;&#1575; &#226;n , mais 
cela ram&#232;ne le mot &#224; une forme incorrecte qui est &#1578;&#2;&#5;U ft&#226;t , alors que la bonne orthographe est 
&#1577;&#2;&#5;U ft&#226;t &#168;. A ce titre, nos tests sur le moteur Google ont montr&#233; son insuffisance dans le 
traitement de tels ph&#233;nom&#232;nes linguistiques, tels que la diff&#233;rentiation entre les terminaisons 
&#1578; et &#1577;. 
</p>
<p>Pour ce qui est du pluriel en langue arabe, un autre ph&#233;nom&#232;ne s'ajoute pour complexifier la 
lemmatisation : il s'agit de l'existence d'un type de pluriel dit &quot;pluriel bris&#233;&quot; et qui ne suit pas 
v&#233;ritablement des r&#232;gles flexionnelles pr&#233;cises (WA&#1585;- &#1604;&#2;A&#1585; r&#202;l-r&#202;&#226;l , pour homme-hommes et 
&#1577;&#1571;&#14;&#7;&#1575; &#226;mr&#222;t &#168;-&#1577;N&#22;  nswt &#168;-&#1569;&#2;&#22;  ns&#226;&#222;  pour femme-femmes). 
</p>
<p>Du c&#244;t&#233; des utilisateurs nous avons extrait les statistiques suivantes concernant l&#8217;utilisation du 
nombre dans les mots cl&#233;s 
</p>
<p>Nombre 
Singulier Duel Pluriel 
</p>
<p>24,02% 
R&#233;gulier du masculin R&#233;gulier du f&#233;minin bris&#233; 74,21% 1,77% 
</p>
<p>71,09% 21,29% 7,52% 
 
</p>
<p>Remarque: plusieurs noms duels, d&#8217;un point de vue morphologique, d&#233;signent en r&#233;alit&#233; des 
noms au singulier, c&#8217;est le cas, par exemple, du nom de pays &#20;&#3;&#14;XKB&#1575; &#226;lb&#206;ryn Bahrayn ou 
encore le pr&#233;nom &#4;@X&#7;&#20;&#3;  m&#206;mdyn .  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ramzi ABB&#201;S et Malek BOUALEM 
</p>
<p>Masculin f&#233;minin 
La r&#232;gle de suffixation peut-&#234;tre utilis&#233;e aussi pour l&#8217;obtention du f&#233;minin ou du masculin. 
G&#233;n&#233;ralement, la r&#232;gle appliqu&#233;e consiste &#224; ajouter au masculin le suffixe &#1577; pour l&#8217;obtention 
du f&#233;minin, mais cette r&#232;gle non plus n'est pas syst&#233;matique, comme dans le cas du mot &#1577;&#1585;&#2;J&#1575; 
&#226;&#215;&#226;rt  &#776; ou GH&#1575;&#1585;&#1583; dr&#226;st  &#776; qui sont de noms f&#233;minins et n&#8217;admettent pas de masculin. Au niveau 
graphique nous trouvons aussi une multitude de noms masculins se terminant par la &#1577;, marque 
du f&#233;minin comme dans le cas du nom  GY&#21;&#18;&#28; &#204;lyft &#168;. 
Par ailleurs, le genre peut aussi &#234;tre rendu par des mots ayant des racines diff&#233;rentes, comme 
pour les mots WA&#1585;   r&#202;l    &#1576;&#1571;  &#222;b    &#4;B&#1608;  wld    &#1606;&#2;Z[  &#206;&#210;&#226;n    W@A &#202;ml . 
Du c&#244;t&#233; des utilisateurs nous avons extrait les statistiques suivantes concernant l&#8217;utilisation du 
genre dans les mots cl&#233;s 
</p>
<p>Genre 
Masculin F&#233;minin 
</p>
<p>49,84% 
avec marque sans marque Autres 
</p>
<p>ayant 
masculin 
</p>
<p>Sans 
masculin 
</p>
<p>ayant 
masculin 
</p>
<p>Sans 
masculin 
</p>
<p>F&#233;minin d'un 
pluriel 
</p>
<p>masculin 
</p>
<p>50,13% 
</p>
<p>47,11% 11,69% 16,81% 1,01% 23,38% 
 
</p>
<p>4 Pratiques d&#8217;&#233;criture en langue arabe &#8211; probl&#232;mes g&#233;n&#233;raux 
La recherche d&#8217;information en langue arabe doit aussi faire face &#224; des difficult&#233;s 
suppl&#233;mentaires dues aux habitudes orthographiques des auteurs, dont l&#8217;impact sur la 
recherche d'information n&#8217;est pas n&#233;gligeable. Pour examiner cet aspect, nous avons men&#233; une 
&#233;tude sur un corpus journalistique contemporain et nous donnerons des statistiques relatives 
aux pratiques d&#8217;&#233;criture chez les auteurs arabes contemporains. Pour notre &#233;tude, nous avons 
choisi de travailler sur un corpus de deux millions de mots de la presse &#233;crite. Des analyses 
d&#233;taill&#233;es seront publi&#233;es dans les Journ&#233;es internationales d&#8217;Analyse statistique des Donn&#233;es 
Textuelles (R. ABBES, J. DICHY, 2008). 
</p>
<p>4.1 Hamza et &#8217;alif.  
Les scripteurs confondent souvent la hamza (&#1571; &#8211; &#1573;) et le &#8217;alif en d&#233;but de mot. On trouve par 
exemple, dans le corpus de deux millions de mots, 26.923 fois &#25;B&#1575; &#8217;il&#226;, &#171; &#224; &#187;, et 2.089 fois  &#25;B&#1573; 
&#222;l &#180;. On trouve &#233;galement 33.901 &#1606;&#1575;  &#226;n   indiff&#233;renci&#233;, contre 50.569 &#1571;  &#1606;  &#222;n  (conjonctions &#8217;an 
ou &#8217;anna) et 759  &#1606;&#1573; &#222;n  (conjonctions &#8217;in ou &#8217;inna). Les estimations auxquelles nous &#233;tions 
parvenus dans cette &#233;tude indiquent que le taux des items renfermant cette seule confusion 
s&#8217;&#233;l&#232;ve &#224; 5,79% de l&#8217;ensemble des items ou encore &#224; 6,76% des mots. Nos tests sur le moteur 
Google ont montr&#233; qu'il renvoie indiff&#233;remment toutes les orthographes de la Hamza au d&#233;but 
du mot. 
</p>
<p>4.2 Y&#226;&#8217; et &#8217;alif maqs&#61481;&#251;ra.  
A la hamza-&#8217;alif initiale s&#8217;ajoute une autre confusion, situ&#233;e pour celle-ci en fin de mot, entre 
&#1610; (lettre y&#226;&#8217; finale) et &#1609; (ou &#8217;alif maqs &#1;&#251;ra). Le mot &#1610;&#1583;&#2; , n&#226;d&#238;, &#171; club &#187;, par exemple, peut &#234;tre 
not&#233; &#1583;&#2; &#1609;  n&#226;d &#180;, ce qui correspond &#224; l&#8217;usage des typographes &#233;gyptiens (mais peut aussi &#234;tre lu </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apport du TAL pour la RI en arabe 
</p>
<p>  
</p>
<p>comme n&#226;d&#226;, &#171; convier, convoquer &#187;). De m&#234;me, pour cette confusion, le moteur Google 
renvoie syst&#233;matiquement les r&#233;sultats avec &#1610; y  et &#1609; &#180; , m&#234;me si le mot de la requ&#234;te est &#233;crit 
entre guillemets. Par exemple, la recherche du mot _B&#1608;L&#1575; &#226;l&#222;wly  renvoie en t&#234;te des pages 
contenant &#25;B&#1608;L&#1575; &#226;l&#222;wl &#180;. Notons qu'il s'agit d&#8217;un mot qui cumule les deux difficult&#233;s. 
</p>
<p>4.3 Le caract&#232;re &#8216;&#1600;&#8217; 
Les typographes font un usage fr&#233;quent du caract&#232;re &#8216;&#1600;&#8217; (appel&#233; kashida), qui permet 
l&#8217;allongement du trait au milieu des mots, pour une meilleure lisibilit&#233; et pour limiter les 
espaces blancs sur une ligne justifi&#233;e ou m&#234;me parfois pour des raisons purement 
calligraphiques. Ce caract&#232;re, ne faisant pas partie de l&#8217;alphabet arabe, est souvent une source 
de confusion pour les syst&#232;mes de traitement de la langue arabe. Le moteur Google semble 
&#233;liminer ce caract&#232;re dans le mot de la requ&#234;te.  
</p>
<p>4.4 Absence des signes de vocalisation  
L&#8217;absence des signes de vocalisation dans les textes &#8211; &#224; laquelle les lecteurs arabes sont 
accoutum&#233;s &#8211;, constitue une source de difficult&#233; consid&#233;rable pour l&#8217;analyse automatique de 
l'arabe. Certains signes diacritiques relatifs &#224; la base (ou noyau lexical) sont indispensables 
pour la d&#233;tection du sens du mot. Ils sont par cons&#233;quent indispensables pour le choix du mot 
pertinent dans la recherche d'information, particuli&#232;rement en l'absence de contexte. Les 
analyses peuvent en effet reconna&#238;tre dans un m&#234;me item plusieurs patrons (&#1606;&#1586;&#1608;), voire 
plusieurs combinaisons de patrons et de racines. 
</p>
<p>4.5 Ta marbouta &#1577; et ha 9 
Nous avons remarqu&#233;, essentiellement sur le web, une confusion fr&#233;quente entre les lettres &#1577; et 
9 en fin du mot. Google semble avoir transform&#233; la fr&#233;quence en r&#232;gle et semble renvoyer 
exactement les m&#234;mes r&#233;sultats pour les requ&#234;tes GK&#5;Q&#7; mktbt  &#776; et SK&#5;Q&#7; mktbh . 
</p>
<p>5 Conclusion 
La recherche d&#8217;information en langue arabe se heurte inlassablement &#224; ses sp&#233;cificit&#233;s 
linguistiques, notamment par sa morphologie complexe, par l&#8217;absence de signes de 
vocalisation dans les textes publi&#233;s et par la richesse des mots graphiques arabes. Ces 
sp&#233;cificit&#233;s sont souvent &#224; l&#8217;origine d'une grande dissym&#233;trie entre l&#8217;indexation et la 
recherche. Dans cet article, nous avons pr&#233;sent&#233; une partie de la typologie des contraintes 
morphologiques de la langue arabe et montr&#233; le comportement des outils de recherche 
d'informations face &#224; ces contraintes. Nous avons montr&#233; les limites des parcours de surface et 
de l&#8217;utilisation des caract&#232;res de troncature. La forme graphique des mots ne peut &#234;tre utilis&#233;e 
pour la constitution de familles morphologiques, en raison de l&#8217;agglutination et de la richesse 
d&#233;rivationnelle en langue arabe. La solution r&#233;side dans l&#8217;utilisation de v&#233;ritables r&#232;gles 
linguistiques permettant la lemmatisation pour la constitution des familles morphologiques. 
Nous avons appuy&#233; notre constat par des r&#233;sultats d&#8217;&#233;tudes exp&#233;rimentales concernant les 
pratiques d&#8217;&#233;criture des auteurs des documents et les difficult&#233;s qu'elles engendrent pour les 
syst&#232;mes int&#233;grant des traitements automatis&#233;s de la langue arabe. Une conclusion nous parait 
&#233;vidente &#224; r&#233;it&#233;rer et &#224; rappeler : elle concerne la n&#233;cessit&#233; d&#8217;int&#233;gration de v&#233;ritables 
traitements linguistiques, &#224; tous les niveaux (lexical, syntaxique et s&#233;mantique) pour am&#233;liorer 
la recherche d'information en langue arabe. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ramzi ABB&#201;S et Malek BOUALEM 
</p>
<p>6  Bibliographie 
ABB&#200;S RAMZI (2004) La conception et la r&#233;alisation d&#8217;un concordancier pour l&#8217;arabe. 
Th&#232;se de doctorat en Sciences de l&#8217;Information, Lyon : INSA, d&#233;cembre 2004. 
</p>
<p>ABB&#200;S RAMZI, DICHY JOSPH (2008) &#171; Extraction automatique de fr&#233;quences lexicales en 
arabe et analyse d&#8217;un corpus journalistique avec le logiciel AraConc et la base de 
connaissances DIINAR.1 &#187;, JADT&#8217;2008, 12-13 mars 2008, ENS-LSH Lyon, France. 
</p>
<p>ABB&#200;S RAMZI, DICHY JOSEPH and HASSOUN MOHAMED (2004). &#171; The Architecture of a 
Standard Arabic Lexical database: some figures, ratios and categories from the DIINAR.1 
source program. &#187; In COLING'04. Proceedings of the Workshop Computational Approches to 
Arabic Script-bases Languages, 28.08.2004, Gen&#232;ve : 15-22.  
</p>
<p>BOUALEM MALEK, SNEIFER R&#201;GINA (2001) &quot;Hahooa Arabic Web Directory &amp; Natural 
Language Processing for Arabic Information Retrieval&quot;, ACL 2001, Workshop on Arabic 
Language Processing, Toulouse, France, July 2001. 
</p>
<p>BOUALEM MALEK, ZAJAC R. (1999), &quot;Unicode-based Arabic text&quot;, ATLAS'99, Arabic 
Translation and Localisation Symposium, Tunis, May 26-28, 1999. 
</p>
<p>BUCKWALTER TIM (2004). &#171; Issues in Arabic Orthography and Morphological Analysis. &#187; 
In COLING'04, Proceedings of the Workshop Computational Approaches to Arabic Script-
bases Languages, 28.08.2004, Gen&#232;ve : 31-41.  
</p>
<p>BRIN S. and PAGE L. (1988), The anatomy of a large-scale hypertextual web search engine, 
Computer Networks and ISDN Systems 30 (1988), pp. 107&#8211;117. 
</p>
<p>CHEN P., XIE H., MASLOV S. and REDNER S. (2007), Finding scientific gems with 
Google's PageRank algorithm, Journal of Informetrics Volume 1, Issue 1, January 2007,  8-15. 
</p>
<p>DICHY JOSEPH (1990). L&#8217;&#201;criture dans la repr&#233;sentation de la langue : la lettre et le  mot en 
arabe. Th&#232;se d&#8217;&#201;tat, Universit&#233; Lumi&#232;re-Lyon 2. 
HARMAN DONNA (1991). How effective is suffixing? Journal of the American Society of 
Information Science. vol. 42, No 1. pp. 7-15, 1991. 
</p>
<p>HARMAN, DONNA, ed. (1995) TREC-3. Proceedings of the Third Text Retrieval Conference. 
Washington, DC: GPO. 
</p>
<p>LALLICH-BOIDIN GENEVIEVE, MARET DOMINIQUE (2005). Recherche d'information et 
traitement de la langue fondements linguistiques et applications. Villeurbanne : Presses de 
l'ENSSIB, Les Cahiers de l'ENSSIB. 
</p>
<p>NEUHAUS CHRIS, NEUHAUS ELLEN and ASHER ALAN (2008), Google Scholar Goes to 
School: The Presence of Google Scholar on College and University Web Sites, The Journal of 
Academic Librarianship In Press, Corrected Proof, , Available online 29 January 2008. 
</p>
<p>V&#201;RONIS JEAN (2006), &#201;tude comparative de six moteurs de recherche. Rapport d&#8217;&#233;tude, 
Universit&#233; de Provence, f&#233;vrier 2006. </p>

</div></div>
</body></html>