<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annotation en Frames S&#233;mantiques du corpus de dialogue MEDIA</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Annotation en Frames S&#233;mantiques du corpus de dialogue
MEDIA
</p>
<p>Marie-Jean Meurs Fr&#233;d&#233;ric Duvert Fr&#233;d&#233;ric B&#233;chet Fabrice Lef&#232;vre
Renato de Mori
</p>
<p>Universit&#233; d&#8217;Avignon et des Pays de Vaucluse
Laboratoire Informatique d&#8217;Avignon (EA 931), F-84911 Avignon, France.
</p>
<p>{marie-jean.meurs, frederic.duvert, frederic.bechet, fabrice.lefevre,
renato.demori}@univ-avignon.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente un formalisme de repr&#233;sentation des connaissances qui a &#233;t&#233;
utilis&#233; pour fournir des annotations s&#233;mantiques de haut niveau pour le corpus de dialogue oral
MEDIA. Ces annotations en structures s&#233;mantiques, bas&#233;es sur le paradigme FrameNet, sont
obtenues de mani&#232;re incr&#233;mentale et partiellement automatis&#233;e. Nous d&#233;crivons le processus
d&#8217;interpr&#233;tation automatique qui permet d&#8217;obtenir des compositions s&#233;mantiques et de g&#233;n&#233;rer
des hypoth&#232;ses de frames par inf&#233;rence. Le corpus MEDIA est un corpus de dialogues en langue
fran&#231;aise dont les tours de parole de l&#8217;utilisateur ont &#233;t&#233; manuellement transcrits et annot&#233;s
(niveaux mots et constituants s&#233;mantiques de base). Le processus propos&#233; utilise ces niveaux
pour produire une annotation de haut niveau en frames s&#233;mantiques. La base de connaissances
d&#233;velopp&#233;e (d&#233;finitions des frames et r&#232;gles de composition) est pr&#233;sent&#233;e, ainsi que les r&#233;sultats
de l&#8217;annotation automatique.
</p>
<p>Abstract. This paper introduces a knowledge representation formalism, used for incre-
mental and partially automated annotation of the French MEDIA dialogue corpus in terms of
semantic structures. We describe an automatic interpretation process for composing semantic
structures from basic semantic constituents using patterns involving constituents and words.
The process has procedures for obtaining semantic compositions and generating frame hypo-
theses by inference. This process is applied to MEDIA, a dialogue corpus manually annotated at
the word and semantic constituent levels, and thus produces a higher level semantic frame an-
notation. The Knowledge Source defined and the results obtained on the automatically-derived
annotation are reported.
</p>
<p>Mots-cl&#233;s : compr&#233;hension automatique de la parole, syst&#232;me de dialogue oral, frames
s&#233;mantiques, d&#233;codage conceptuel, annotation s&#233;mantique, inf&#233;rence s&#233;mantique.
</p>
<p>Keywords: spoken language understanding, spoken dialogue system, semantic struc-
tures, semantic frames, conceptual decoding, semantic annotation, semantic inference.
</p>
<p>Ce travail a &#233;t&#233; r&#233;alis&#233; dans le cadre du projet LUNA (contrat IST no 33549), inscrit dans le sixi&#232;me
programme-cadre de recherche (FP6) de l&#8217;Union Europ&#233;enne. Pour plus d&#8217;informations concernant LUNA :
www.ist-luna.eu</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Meurs, Duvert, B&#233;chet, Lef&#232;vre, de Mori
</p>
<p>1 Introduction
</p>
<p>La complexit&#233; des syst&#232;mes de dialogue oral homme-machine d&#233;pend essentiellement de la
complexit&#233; de la t&#226;che vis&#233;e. Ainsi les syst&#232;mes d&#233;di&#233;s au routage d&#8217;appels t&#233;l&#233;phoniques ou
encore &#224; la recherche d&#8217;information pouvant se pr&#233;senter sous forme de formulaires (r&#233;pertoires
t&#233;l&#233;phoniques, recherche d&#8217;horaires par exemple) peuvent reposer sur une repr&#233;sentation des
connaissances s&#233;mantiques relativement simple. A contrario d&#232;s lors qu&#8217;un syst&#232;me doit pou-
voir g&#233;rer plusieurs demandes conjointes ou int&#233;grer des phases de n&#233;gociation il requiert une
repr&#233;sentation s&#233;mantique de haut niveau. De tels syst&#232;mes doivent disposer de connaissances
s&#233;mantiques pouvant interagir avec les informations complexes sur l&#8217;&#233;tat courant du dialogue
tout en supportant les erreurs introduites dans la cha&#238;ne de traitement du signal de parole par les
modules de reconnaissance et de compr&#233;hension. La difficult&#233; &#224; obtenir une telle repr&#233;sentation
de haut niveau fonctionnelle et robuste explique que les syst&#232;mes de dialogue actuels soient
limit&#233;s &#224; des espaces s&#233;mantiques assez restreints.
</p>
<p>Obtenir un syst&#232;me de dialogue capable de se remettre en cause, de proposer des alternatives
et de s&#8217;adapter aux phases de n&#233;gociation pr&#233;sentes dans le dialogue &quot;naturel&quot; passe donc par
la construction d&#8217;une nouvelle repr&#233;sentation des connaissances. Elle doit permettre la com-
position s&#233;mantique au sein des tours de parole comme au cours du d&#233;roulement du dialogue
ainsi que la gestion des r&#233;f&#233;rences (ph&#233;nom&#232;ne dont l&#8217;apparition est fortement augment&#233;e lors
des phases de n&#233;gociation). Dans cette perspective, le choix du paradigme FrameNet1 comme
repr&#233;sentation s&#233;mantique de haut niveau para&#238;t appropri&#233;. Outre la robustesse du paradigme,
FrameNet pr&#233;sente l&#8217;avantage de produire des annotations standards qu&#8217;il est facile de partager
et de comparer au sein de la communaut&#233; scientifique.
</p>
<p>Les travaux pr&#233;sent&#233;s dans cet article portent sur l&#8217;annotation en frames2 du corpus de dialogue
en fran&#231;ais MEDIA. Le corpus est d&#233;crit dans la partie 2. Puis, la partie 3 d&#233;taille les principes
utilis&#233;s pour l&#8217;annotation en frames. Enfin, l&#8217;application de ces principes au corpus MEDIA est
pr&#233;sent&#233;e dans la partie 4.
</p>
<p>2 Description des donn&#233;es MEDIA
</p>
<p>Le corpus MEDIA (Bonneau-Maynard et al., 2005) est un corpus de dialogue en fran&#231;ais issu de
la simulation d&#8217;un serveur t&#233;l&#233;phonique d&#8217;informations touristiques et de r&#233;servation d&#8217;h&#244;tels.
Il a &#233;t&#233; enregistr&#233; selon le protocole du Magicien d&#8217;Oz (syst&#232;me de dialogue simul&#233; par un op&#233;-
rateur humain). Huit cat&#233;gories de scenarii sont d&#233;finies avec diff&#233;rents niveaux de complexit&#233;.
Le corpus contient 1250 dialogues produits par 250 locuteurs, pour une dur&#233;e totale d&#8217;envi-
ron 70 heures d&#8217;enregistrement audio. Chaque locuteur a enregistr&#233; cinq scenarii de r&#233;servation
d&#8217;h&#244;tel.
</p>
<p>Le corpus est transcrit manuellement et enrichi par une annotation &#233;galement manuelle utilisant
83 concepts de base rassembl&#233;s dans un dictionnaire s&#233;mantique de concepts. Cette annotation
manuelle a &#233;t&#233; r&#233;alis&#233;e par deux annotateurs de la soci&#233;t&#233; ELDA. L&#8217;accord inter-annotateur
(IAg) obtenu est toujours sup&#233;rieur &#224; 80% et atteint jusqu&#8216;&#769;a 90% dans le meilleur cas (Bonneau-
Maynard et al., 2005).
</p>
<p>1 Plus d&#8217;informations sur http ://framenet.icsi.berkeley.edu
2 Le terme frame a &#233;t&#233; conserv&#233; dans l&#8217;article, plut&#244;t que sa traduction en cadre s&#233;mantique, afin d&#8217;&#233;viter toute
</p>
<p>confusion.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation en Frames S&#233;mantiques du corpus de dialogue MEDIA
</p>
<p>Le dictionnaire s&#233;mantique utilis&#233; pour l&#8217;annotation du corpus MEDIA associe &#224; un mot ou
un groupe de mots une paire concept-valeur puis un sp&#233;cifieur d&#233;finissant des relations entre
concepts et enfin un mode affirmatif, n&#233;gatif, interrogatif ou &#233;ventuel, attach&#233; au concept. En
d&#233;finissant un ensemble de 19 sp&#233;cifieurs pouvant &#234;tre associ&#233;s aux concepts de base, le sch&#233;ma
d&#8217;annotation MEDIA repr&#233;sente les relations entre les concepts et permet ainsi de construire une
repr&#233;sentation hi&#233;rarchique de l&#8217;interpr&#233;tation d&#8217;un &#233;nonc&#233;.
</p>
<p>Un exemple de message annot&#233; du corpus MEDIA est donn&#233; dans le tableau (1). La premi&#232;re
colonne contient les groupes de mots W c supports de chaque concept, pr&#233;sent&#233; dans la seconde
colonne. La troisi&#232;me colonne indique le mode et la quatri&#232;me colonne fournit les sp&#233;cifieurs
associ&#233;s aux concepts. La derni&#232;re colonne pr&#233;sente les valeurs normalis&#233;es des concepts c
associ&#233;s aux groupes de mots W c.
</p>
<p>W c concept c mode specifieur valeur
Je voudrais reserver commande + (affirmatif) reservation
</p>
<p>une chambre chambre-quantite + reservation 1
pour deux nuits sejour-nbNuit + reservation 2
</p>
<p>&#224; Marseille localisation-ville + hotel Marseille
</p>
<p>TAB. 1 &#8211; Exemple d&#8217;annotation s&#233;mantique MEDIA
</p>
<p>Dans cet exemple, le sp&#233;cifieur reservation est li&#233; aux concepts chambre-quantite et s&#233;jour-
nbNuit. On obtient ainsi une structure hi&#233;rarchique repr&#233;sentant une r&#233;servation associ&#233;e au
concept commande et d&#233;velopp&#233;e gr&#226;ce aux valeurs des concepts chambre-quantite et sejour-
nbNuit. Le sp&#233;cifieur hotel adjoint au concept localisation-ville permet de relier le lieu
&#233;voqu&#233; dans le segment &#8220;&#224; Marseille&#8221; &#224; la partie pr&#233;c&#233;dente de l&#8217;&#233;nonc&#233;.
</p>
<p>La combinaison des sp&#233;cifieurs et des concepts permet donc de recomposer une repr&#233;sentation
hi&#233;rarchique de la requ&#234;te de l&#8217;utilisateur &#224; partir de l&#8217;annotation &#224; plat.
</p>
<p>3 Annotation en frames
</p>
<p>Les connaissances s&#233;mantiques th&#233;oriques permettent de d&#233;finir des structures s&#233;mantiques
adapt&#233;es &#224; divers domaines ainsi que l&#8217;ont montr&#233; (Woods, 1975) avec les r&#233;seaux s&#233;man-
tiques repr&#233;sentant des entit&#233;s/relations ou (Jackendoff, 1990) avec les structures de type fonc-
tion/argument. Une fa&#231;on efficace de mod&#233;liser et de manipuler les connaissances s&#233;mantiques
est de les repr&#233;senter comme un ensemble de formules logiques sur lequel repose le processus
de compr&#233;hension. Dans ce contexte, Fillmore d&#233;finit les frames comme des structures cogni-
tives associ&#233;es au processus de compr&#233;hension (Fillmore, 1982; Fillmore, 1985). Chaque frame
comporte des Frame Elements (FEs), r&#244;les s&#233;mantiques qui lui sont propres. Une frame est donc
un mod&#232;le repr&#233;sentant des entit&#233;s s&#233;mantiques et leurs propri&#233;t&#233;s (Petruck, 1996).
</p>
<p>Le projet FrameNet (Lowe et al., 1997; Fillmore &amp; Petruck, 2003) fournit pour la langue an-
glaise une base de donn&#233;es de frames d&#233;taillant leurs relations, leurs FEs et les unit&#233;s lexicales
(Lexical Units, LU) qui leurs correspondent ainsi que de nombreux exemples de textes annot&#233;s.
L&#8217;exemple de la frame cooking_creation d&#233;finie dans le dictionnaire FrameNet est donn&#233;
dans la figure (1) qui illustre les relations de cette frame aux autres frames du dictionnaire.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Meurs, Duvert, B&#233;chet, Lef&#232;vre, de Mori
</p>
<p>FIG. 1 &#8211; La frame cooking_creation de FrameNet
</p>
<p>3.1 D&#233;finition des frames
</p>
<p>Le choix d&#8217;une annotation en frames dans ce travail est motiv&#233; par sa capacit&#233; &#224; repr&#233;senter
des dialogues de n&#233;gociation et &#224; s&#8217;adapter aux actions complexes du gestionnaire de dialogue.
Nous avons manuellement d&#233;finie notre propre source de connaissance (KS) de frames pour
d&#233;crire nos connaissances en termes de composition s&#233;mantique adapt&#233;e au domaine du corpus
MEDIA. Les frames et les FEs sont d&#233;crits par un ensemble de mod&#232;les d&#233;finis manuellement.
Ces mod&#232;les sont compos&#233;s d&#8217;unit&#233;s lexicales (LUs), d&#8217;unit&#233;s conceptuelles (CUs) et peuvent
inclure des associations caract&#233;ristiques de ces composants.
</p>
<p>Le dictionnaire FrameNet est disponible pour la langue anglaise mais il n&#8217;existe pas actuelle-
ment de FrameNet fran&#231;ais comparable, capable de couvrir le domaine s&#233;mantique du corpus
MEDIA. La seule ressource disponible pour le fran&#231;ais, obtenue par projection automatique du
FrameNet anglais (Pado &amp; Pitel, 2007), a &#233;t&#233; &#233;cart&#233;e au profit d&#8217;une d&#233;finition manuelle des
frames pour plusieur motifs :
&#8211; l&#8217;usage d&#8217;une KS de taille plus r&#233;duite mais couvrant parfaitement le domaine du corpus
</p>
<p>MEDIA limite la confusion lors de l&#8217;annotation ;
&#8211; la nature particuli&#232;re du support textuel (transcriptions de parole) induit des diff&#233;rences im-
</p>
<p>portantes dans la d&#233;finition des LU et CU ;
&#8211; les frames de FrameNet risquent d&#8217;&#234;tre trop g&#233;n&#233;riques pour satisfaire les besoins d&#8217;un sys-
</p>
<p>t&#232;me de dialogue automatique.
La d&#233;finition de frames d&#233;di&#233;es au domaine du corpus MEDIA a donc &#233;t&#233; privil&#233;gi&#233;e dans un
premier temps. Toutefois, une attention particuli&#232;re a &#233;t&#233; apport&#233;e afin de maintenir la d&#233;finition
des frames la plus ind&#233;pendante possible de l&#8217;application. Ainsi certaines frames d&#233;crivant des
connaissances g&#233;n&#233;rales comme les relations spatiales sont conformes &#224; leur version FrameNet,
quand d&#8217;autres plus sp&#233;cifiques &#224; l&#8217;application ont &#233;t&#233; cr&#233;&#233;s ou largement modif&#233;es. Toutefois la
plupart des frames d&#233;finies restent en correspondance avec des frames pr&#233;sentes dans le projet
FrameNet. La figure (2) montre un extrait de ces correspondances.
</p>
<p>Les mots d&#233;clenchant l&#8217;instanciation d&#8217;une frame sont les LUs associ&#233;es &#224; la frame ou &#224; ses FEs.
On distingue deux types de LUs : g&#233;n&#233;rique ou sp&#233;cifique. Une LU est g&#233;n&#233;rique lorsqu&#8217;elle
indique le sujet global d&#8217;une proposition. Une LU sp&#233;cifique est un argument possible d&#8217;un
pr&#233;dicat. Un exemple de contenu des cat&#233;gories de LUs est donn&#233; dans le tableau (2). Les
valeurs prises par les LUs peuvent &#234;tre des mots et leurs synonymes, des n-grammes ou des
n-uplets de mots apparaissant dans des portions de dialogues, sans aucune contrainte sur leur
position dans les phrases. Dans la continuit&#233; des annotations MEDIA, les CUs sont associ&#233;s aux
LUs. Ces associations sont utilis&#233;es dans le processus d&#8217;inf&#233;rence d&#233;crit dans la partie suivante
de cet article.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation en Frames S&#233;mantiques du corpus de dialogue MEDIA
</p>
<p>FIG. 2 &#8211; Exemples de correspondances entre les frames de la KS associ&#233;e au corpus MEDIA et
les frames FrameNet
</p>
<p>&lt;framelement fename=&quot;location_town&quot;&gt;
&lt;generic_lexical_units valeur=&quot;ville,cit&#233;,village&quot;/&gt;
&lt;specific_lexical_units valeur=&quot;paris,lyon,marseille...&quot;/&gt;
</p>
<p>&lt;/framelement&gt;
</p>
<p>TAB. 2 &#8211; Cat&#233;gories de LUs pour le Frame El&#233;ment location_town
</p>
<p>3.2 R&#232;gles d&#8217;inf&#233;rence
</p>
<p>La strat&#233;gie d&#8217;annotation se compose en deux &#233;tapes : une premi&#232;re &#233;tape reposant sur l&#8217;instan-
ciation de frames &#224; partir de la d&#233;finition des frames et une seconde &#233;tape de composition des
frames ex&#233;cut&#233;e par des r&#232;gles d&#8217;inf&#233;rence. Le processus d&#8217;inf&#233;rence appliqu&#233; aux instances de
frames est d&#233;crit par des formules de la logique du premier ordre.
</p>
<p>Les frames et FEs obtenus par le processus d&#8217;instanciation initial conditionnent les valeurs de
v&#233;rit&#233; des r&#232;gles logiques. Selon ces valeurs de v&#233;rit&#233;, frames et FEs sont instanci&#233;s, supprim&#233;s,
modifi&#233;s ou reli&#233;s. Par exemple, si les frames RESERVE, HOTEL et LOCATION satisfont la
r&#232;gle pr&#233;sent&#233;e ci-apr&#232;s, une frame LODGING est cr&#233;&#233;e, li&#233;e directement aux frames HOTEL et
LOCATION ainsi qu&#8217;&#224; la frame RESERVE par l&#8217;interm&#233;diaire de la frame LODGING.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Meurs, Duvert, B&#233;chet, Lef&#232;vre, de Mori
</p>
<p>[ Frame RESERVE (FE_reservation_theme, concept = reservation_hotel)
^ Frame HOTEL (FE_hotel_name, concept = hotel)
^ Frame LOCATION (FE_location_town, concept = location_hotel) ]
=&gt;
[ Frame LODGING (FE_lodging_hotel = Frame HOTEL,
</p>
<p>FE_lodging_location = Frame LOCATION)
^ Frame RESERVER (FE_reservation_theme = Frame LODGING) ]
</p>
<p>Environ trente r&#232;gles d&#8217;inf&#233;rence sont utilis&#233;es actuellement. Elles consistent principalement &#224;
proposer des relations entre les objets (frames, FEs) pr&#233;c&#233;demment instanci&#233;s, &#224; &#233;liminer les
redondances et &#224; instancier des frames abstraites non d&#233;couvertes pendant la premi&#232;re &#233;tape
d&#8217;annotation reposant sur les d&#233;finitions de frames. Ces r&#232;gles utilisent les annotations fournies
par l&#8217;&#233;tape de d&#233;finition ainsi que les CUs et leurs valeurs pr&#233;sentes dans le corpus. Elles ne sont
pas directement d&#233;pendantes des mots employ&#233;s et s&#8217;affranchissent ainsi de la s&#233;quentialit&#233; de
la proposition.
</p>
<p>4 Application
</p>
<p>La KS (Figure 3) associ&#233;e au corpus MEDIA est compos&#233;e de 21 frames de base pour un total
de 86 FEs. Cette KS est de taille tr&#232;s modeste en comparaison des FrameNet fran&#231;ais (Pado &amp;
Pitel, 2007) ou anglais. Le tableau (3) indique les dimensions des trois ressources, MEDIA KS,
FrameNet fran&#231;ais et FrameNet. A titre de comparaison, la frame REQUEST, commune &#224; ces
trois ressources, est pr&#233;sent&#233;e avec ses FEs selon les diff&#233;rentes versions.
</p>
<p>MEDIA KS FrameNet fran&#231;ais FrameNet
Frames 21 138 &gt; 825
FEs 86 1371 6800
Frame REQUEST REQUEST REQUEST
</p>
<p>FE_agent FE_speaker FE_medium FE_speaker FE_medium
FEs FE_recipient FE_addresse FE_manner FE_addresse FE_manner
associ&#233;s FE_theme FE_message FE_means FE_message FE_means
</p>
<p>FE_topic FE_topic FE_beneficiary
FE_time
</p>
<p>TAB. 3 &#8211; Comparaison MEDIA KS - FrameNet fran&#231;ais - FrameNet
</p>
<p>Les annotations sont rassembl&#233;es dans des documents au format XML contenant des informa-
tions additionnelles telles que les r&#233;f&#233;rences temporelles des segments de dialogues associ&#233;s
aux frames et aux FEs .
</p>
<p>Les annotations manuelles des dialogues ont &#233;t&#233; produites gr&#226;ce &#224; un outil d&#233;velop&#233; sp&#233;cifique-
ment et qui permet d&#8217;obtenir un temps moyen d&#8217;annotation par tour de parole d&#8217;environ 4 &#224; 5
minutes. Un annotateur a annot&#233; manuellement quinze dialogues, soit 463 tours de parole.
</p>
<p>L&#8217;extraction automatique des composants (LU, CU) pr&#233;sents dans le corpus permet de s&#8217;assurer
de la couverture compl&#232;te du domaine par les mod&#232;les. Ces composants sont rassembl&#233;s dans un
fichier XML de mod&#232;les. Le corpus MEDIA est conceptuellement annot&#233; initialement &#224; l&#8217;aide
de 83 concepts (dont 60 sont repris comme CUs dans la KS). Des CU additionnelles viennent
les compl&#233;ter pour permettre l&#8217;annotation d&#8217;entit&#233;s s&#233;mantiques non initialement annot&#233;es dans</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation en Frames S&#233;mantiques du corpus de dialogue MEDIA
</p>
<p>FIG. 3 &#8211; KS associ&#233;e au corpus MEDIA
</p>
<p>le corpus. Par exemple, les CUs associ&#233;es &#224; la frame PERSON, repr&#233;sentant un agent (Tableau
4), ne sont pas initialement annot&#233;es dans le corpus MEDIA. La KS contient actuellement 106
CUs et environ 1100 LUs.
</p>
<p>Un outil de visualisation des frames, d&#233;di&#233; &#224; la manipulation de dialogues, apporte une aide
pr&#233;cieuse &#224; l&#8217;annotation manuelle, la v&#233;rification et la correction des annotations. Cet outil
fournit pour chaque tour de parole une vue d&#8217;ensemble des frames et FEs instanci&#233;s ainsi que
des relations entre ces objets. Il permet un acc&#232;s direct &#224; un tour de parole s&#233;lectionn&#233;, diffuse
le fichier audio correspondant et est capable d&#8217;interagir avec l&#8217;outil d&#8217;annotation pour faciliter
les corrections manuelles.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Meurs, Duvert, B&#233;chet, Lef&#232;vre, de Mori
</p>
<p>&lt;frame frname =&quot;PERSON&quot;&gt;
&lt;concept valeur = &quot;person&quot;/&gt;
&lt;frlmt fename=&quot;person_name&quot;&gt;
</p>
<p>&lt;concept valeur = &quot;identifier&quot;/&gt;
&lt;/frlmt&gt;
&lt;frlmt fename=&quot;person_surname&quot;&gt;
</p>
<p>&lt;concept valeur = &quot;surname&quot;/&gt;
&lt;/frlmt&gt;
</p>
<p>&lt;/frame&gt;
</p>
<p>TAB. 4 &#8211; CUs associ&#233;es &#224; la frame PERSON
</p>
<p>La figure (4) donne un exemple de visualisation des frames associ&#233;es &#224; un tour de parole dans
lequel le client dit : &#8220;alors j&#8217;aurais souhait&#233; r&#233;server euh deux chambres individuelles euh dans
un h&#244;tel &#224; Orange pour vingt nuits du douze juillet au trente et un juillet euh je souhaiterais que
le prix soit inf&#233;rieur &#224; cent euros ou alors un peu plus s&#8217;il y a une piscine euh je souhaiterais
que dans un cadre tr&#232;s calme et avec une piscine donc si possible&#8221;
</p>
<p>FIG. 4 &#8211; Visualisation des frames et FEs d&#8217;un tour de parole
</p>
<p>Les strat&#233;gies utilis&#233;es pour am&#233;liorer la qualit&#233; des annotations sont largement inspir&#233;es des
approches propos&#233;es par (Scheffczyk &amp; Ellsworth, 2006). L&#8217;annotation manuelle en frames
n&#8217;&#233;tant pas disponible sur l&#8217;ensemble du corpus, l&#8217;annotation automatique a &#233;t&#233; &#233;valu&#233;e sur 100
tours de parole s&#233;lectionn&#233;s par tirage al&#233;atoire. Les annotations pr&#233;sentes ont &#233;t&#233; control&#233;es
manuellement par deux experts humains. La comparaison des annotations manuelles et des
annotations automatiques fournit une F-mesure de 0,90, pour une pr&#233;cision de 0,96 et un rappel
de 0,85.
</p>
<p>Le processus incr&#233;mental d&#8217;annotation utilis&#233; pour annoter en frames le corpus MEDIA est</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation en Frames S&#233;mantiques du corpus de dialogue MEDIA
</p>
<p>d&#233;crit dans la figure (5).
</p>
<p>Corpus MEDIA
avec annotation
</p>
<p>en Frames
</p>
<p>annotations MEDIA 
</p>
<p>463 tours de parole
avec
</p>
<p>Annotation manuelle en Frames
Instanciation
</p>
<p>Regles d&#8217;inferences
</p>
<p>incorrect correct
</p>
<p>avec
</p>
<p>automatique
en Frames
</p>
<p>Annotation
</p>
<p>annotation conceptuelle
</p>
<p>Corpus MEDIA
</p>
<p>des Frames
Processus d&#8217;etiquetage Processusde
</p>
<p>validation
</p>
<p>FIG. 5 &#8211; Processus incr&#233;mental d&#8217;annotation
</p>
<p>Ne disposant pas de proc&#233;dure standard d&#8217;&#233;valuation sur une telle t&#226;che, il n&#8217;est pas possible de
se prononcer sur la pertinence globale de l&#8217;annotation. Sa valeur effective est &#233;videmment tr&#232;s
li&#233;e au contexte d&#8217;application. Toutefois le recours &#224; un formalisme ind&#233;pendant de la t&#226;che est
une nouveaut&#233; qui devrait am&#233;liorer grandement la mise au point de l&#8217;annotation et les possi-
bilit&#233;s de l&#8217;&#233;largir &#224; d&#8217;autres domaines de dialogue homme-machine. Deux approches compl&#233;-
mentaires sont en cours d&#8217;exploration. Du point de vue qualitatif, la prise en compte des actes
de dialogues associ&#233;s &#224; chaque proposition semble permettre d&#8217;am&#233;liorer la qualit&#233; des inf&#233;-
rences. Du point de vue quantitatif, l&#8217;utilisation de probabilit&#233;s lors de l&#8217;&#233;tape d&#8217;inf&#233;rence, en
vue d&#8217;am&#233;liorer sa robustesse, est en cours d&#8217;&#233;valuation.
</p>
<p>5 Conclusion
</p>
<p>Un formalisme de repr&#233;sentation des connaissances bas&#233; sur le paradigme FrameNet a &#233;t&#233; pr&#233;-
sent&#233;. Ce formalisme est mis en oeuvre pour annoter en frames s&#233;mantiques le corpus de dia-
logue fran&#231;ais MEDIA, de fa&#231;on incr&#233;mentale et partiellement automatique. Pour cela, un pro-
cessus d&#8217;interpr&#233;tation automatique a &#233;t&#233; propos&#233; pour composer les structures s&#233;mantiques &#224;
partir des composants s&#233;mantiques de base, utilisant des mod&#232;les contenant des unit&#233;s lexicales
et conceptuelles. La F-mesure &#233;valuant la qualit&#233; des annotations automatiques produites est
suffisamment &#233;lev&#233;e pour permettre de les consid&#233;rer comme annotations de r&#233;f&#233;rence du cor-
pus. La suite de ce travail consiste &#224; produire des annotations automatiques dans le contexte du
syst&#232;me de dialogue (introduction des erreurs en mots et en concepts de base) pour lesquelles
nous serons capables de fournir des probabilit&#233;s associ&#233;es aux hypoth&#232;ses de frames et FEs, en
tenant compte de tous les niveaux trait&#233;s (acoustique, mod&#232;le de language, mod&#232;le de compr&#233;-
hension, d&#233;finition des frames et inf&#233;rence).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Meurs, Duvert, B&#233;chet, Lef&#232;vre, de Mori
</p>
<p>R&#233;f&#233;rences
</p>
<p>BONNEAU-MAYNARD H., ROSSET S., AYACHE C., KUHN A. &amp; MOSTEFA D. (2005). Se-
mantic annotation of the french media dialog corpus. In Eurospeech, Lisboa, Portugal.
</p>
<p>FILLMORE C. J. (1982). Frame Semantics. Linguistics in the Morning Calm, Seoul.
</p>
<p>FILLMORE C. J. (1985). Frames and the semantics of understanding. Quaderni di Semantica,
VI(2), 222&#8211;254.
FILLMORE, CHARLES J. C. R. J. &amp; PETRUCK M. R. (2003). Background to framenet.
International Journal of Lexicography, 16.3, 235&#8211;250.
JACKENDOFF R. (1990). Semantic structures. The MIT Press, Cambridge Mass.
</p>
<p>LOWE J., BAKER C. &amp; FILLMORE C. (1997). A frame-semantic approach to semantic an-
notation. In Proceedings of the SIGLEX Workshop on Tagging Text with Lexical Semantics :
Why, What, and How ?, Washington D.C., USA.
</p>
<p>PADO S. &amp; PITEL G. (2007). Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les par
projection cross-linguistique. In Proceedings of TALN-07, Toulouse, France.
</p>
<p>PETRUCK M. R. (1996). Frame semantics. Handbook of Pragmatics. John Benjamins, Phila-
delphia.
</p>
<p>SCHEFFCZYK J. &amp; ELLSWORTH M. (2006). Improving the quality of framenet. In Workshop
on quality assurance and quality measurement for language and speech resources, p. 8&#8211;13,
Genoa, Italy.
</p>
<p>WOODS W. (1975). What&#8217;s in a Link : Foundations for Semantic Networks. Bolt, Beranek
and Newman.</p>

</div></div>
</body></html>