<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>R&#233;solution de M&#233;tonymie des Entit&#233;s Nomm&#233;es : proposition d&#8217;une m&#233;thode hybride</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>R&#233;solution de M&#233;tonymie des Entit&#233;s Nomm&#233;es : proposition
d&#8217;une m&#233;thode hybride
</p>
<p>Caroline Brun1 Maud Ehrmann1 Guillaume Jacquet1
</p>
<p>(1) Xerox Research Center Europe - XRCE
6, Chemin de Maupertuis, 38240 Meylan
</p>
<p>{Caroline.Brun, Maud.Ehrmann, Guillaume.Jacquet}@xrce.xerox.com
</p>
<p>R&#233;sum&#233;. Dans cet article, nous d&#233;crivons la m&#233;thode que nous avons d&#233;velopp&#233;e pour la
r&#233;solution de m&#233;tonymie des entit&#233;s nomm&#233;es dans le cadre de la comp&#233;tition SemEval 2007.
Afin de r&#233;soudre les m&#233;tonymies sur les noms de lieux et noms d&#8217;organisation, tel que requis
pour cette t&#226;che, nous avons mis au point un syst&#232;me hybride bas&#233; sur l&#8217;utilisation d&#8217;un analy-
seur syntaxique robuste combin&#233; avec une m&#233;thode d&#8217;analyse distributionnelle. Nous d&#233;crivons
cette m&#233;thode ainsi que les r&#233;sultats obtenus par le syst&#232;me dans le cadre de la comp&#233;tition
SemEval 2007.
</p>
<p>Abstract. In this paper, we describe the method we develop in order to solve Named entity
metonymy in the framework of the SemEval 2007 competition. In order to perform Named
Entity metonymy resolution on location names and company names, as required for this task,
we developed a hybrid system based on the use of a robust parser that extracts deep syntactic
relations combined with a non supervised distributional approach, also relying on the relations
extracted by the parser. We describe this methodology as well as the results obtained at SemEval
2007
</p>
<p>Mots-cl&#233;s : Entit&#233;s Nomm&#233;es, m&#233;tonymie, m&#233;thode hybride, analyse syntaxique ro-
buste, approche distributionnelle.
</p>
<p>Keywords: Named Entities, metonymy, hybrid method, robust parsing, distributional
approach.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Maud Ehrmann, Guillaume Jacquet
</p>
<p>1 Introduction
</p>
<p>Le traitement des entit&#233;s nomm&#233;es fait aujourd&#8217;hui figure d&#8217;incontournable en Traitement Au-
tomatique des Langues (TAL). Apparue au milieu des ann&#233;es 1990 &#224; la faveur des derni&#232;res
conf&#233;rences MUC (Message Understanding Conferences, (MUC, 1995) et (MUC, 1998)), la
t&#226;che de reconnaissance et de cat&#233;gorisation des noms de personnes, de lieux, d&#8217;organisations,
etc. appara&#238;t en effet comme fondamentale pour diverses applications participant de l&#8217;analyse de
contenu et nombreux sont les travaux se consacrant &#224; sa mise en oeuvre, obtenant des r&#233;sultats
plus qu&#8217;honorables (F-mesure1 d&#233;passant g&#233;n&#233;ralement 0.9), et ce pour diverses langues. Fort
de ce succ&#232;s, le traitement des entit&#233;s nomm&#233;es s&#8217;oriente d&#233;sormais vers de nouvelles perspec-
tives avec, entre autres, la cat&#233;gorisation fine (Ehrmann &amp; Jacquet, 2006), la normalisation et
la d&#233;sambigu&#239;sation. En effet, &#224; l&#8217;instar des autres unit&#233;s lexicales, plusieurs ph&#233;nom&#232;nes de
glissement ou de superposition de sens peuvent avoir lieu au regard des entit&#233;s nomm&#233;es et
il importe de pouvoir les r&#233;soudre afin de traiter au mieux ces unit&#233;s. Nous nous int&#233;ressons
plus particuli&#232;rement &#224; la m&#233;tonymie des entit&#233;s nomm&#233;es et pr&#233;sentons dans cet article une
m&#233;thode hybride pour la r&#233;solution de ce type particulier de polys&#233;mie.
</p>
<p>La premi&#232;re section reviendra tout d&#8217;abord sur la d&#233;finition et la caract&#233;risation de la m&#233;tonymie
des entit&#233;s nomm&#233;es. La suivante pr&#233;sentera rapidement la campagne d&#8217;&#233;valuation SemEval
(Semantic Evaluation), dans le cadre de laquelle les travaux ici pr&#233;sent&#233;s ont &#233;t&#233; r&#233;alis&#233;s et
&#233;valu&#233;s, puis la trois&#232;me section s&#8217;attachera &#224; d&#233;crire le syst&#232;me mis au point. Enfin, la derni&#232;re
section rendra compte de l&#8217;&#233;valuation.
</p>
<p>2 La m&#233;tonymie des entit&#233;s nommm&#233;es
</p>
<p>La m&#233;tonymie correspond au fait d&#8217;employer un mot (par exemple, le mot r&#233;colte) attach&#233; &#224;
une certaine entit&#233; (l&#8217;action de r&#233;colter) pour en d&#233;signer une autre (les produits recueillis), la
seconde &#233;tant li&#233;e &#224; la premi&#232;re par une relation de type partie-tout ou une relation fonctionnelle
(ici relation de cause &#224; effet). Si la m&#233;tonymie permet un nombre ind&#233;fini de glissements de sens,
il existe n&#233;anmoins des changements de sens r&#233;guliers ou syst&#233;matiques, au regard notamment
des entit&#233;s nomm&#233;es. Examinons les exemples suivants :
</p>
<p>La politique am&#233;ricaine est plomb&#233;e par l&#8217;Irak.
La France a gagn&#233; en demi-finale.
</p>
<p>Dans la premi&#232;re phrase, il n&#8217;est bien s&#251;r pas question du pays proprement dit mais de l&#8217;&#233;v&#233;ne-
ment qui s&#8217;y d&#233;roule, tout comme dans la seconde ou il s&#8217;agit non pas de la France en tant que
telle mais d&#8217;une &#233;quipe sportive fran&#231;aise. Cet usage des unit&#233;s Irak et France en tant qu&#8217;&#233;v&#233;-
nement et &#233;quipe sportive respectivement est possible pour d&#8217;autres noms de pays dans des
situations similaires. Il existe bien d&#8217;autres exemples possibles, sur lesquels nous reviendrons
par la suite, mais il est d&#8217;ores et d&#233;j&#224; possible de postuler une certaine r&#233;gularit&#233; et productivit&#233;
des ph&#233;nom&#232;nes de m&#233;tonymie pour les entit&#233;s nomm&#233;es.
</p>
<p>Outre ces caract&#233;ristiques, des &#233;tudes conduites par K. Markert, U. Hahn et M. Nissim (Markert
&amp; Hahn, 2002), (Markert &amp; Nissim, 2006) ont fait &#233;tat de la fr&#233;quence de ce ph&#233;nom&#232;ne, mon-
trant que 17% de l&#8217;ensemble des occurrences dans un corpus de 27 magazines allemands &#233;taient
</p>
<p>1Moyenne harmonique de la pr&#233;cision et du rappel : : (2&#215; pr&#233;cision &#215; rappel)/(pr&#233;cision + rappel).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution de M&#233;tonymie des Entit&#233;s Nomm&#233;es : proposition d&#8217;une m&#233;thode hybride
</p>
<p>m&#233;tonymiques, tout comme 20% des occurrences des noms de pays et 30% de celles des noms
d&#8217;organisation sur des extraits significatifs du British National Corpus. R&#233;guli&#232;re, productive et
fr&#233;quente, la m&#233;tonymie des entit&#233;s nomm&#233;es constitue ainsi un r&#233;el int&#233;r&#234;t pour le traitement
automatique des langues.
</p>
<p>3 R&#233;solution de m&#233;tonymie pour la campagne SemEval
</p>
<p>La campagne SemEval2007 proposait 18 t&#226;ches d&#8217;&#233;valuations autour de probl&#232;mes s&#233;mantiques
tels que la d&#233;sambigu&#239;sation de pr&#233;positions, l&#8217;annotation d&#8217;expressions et de relations tempo-
relles (TempEval) ou encore la d&#233;sambigu&#239;sation des noms de personne sur le web (Web People
Search). La t&#226;che propos&#233;e par K. Markert et M. Nissim est une t&#226;che lexicale sur l&#8217;anglais, por-
tant plus pr&#233;cis&#233;ment sur la r&#233;solution de m&#233;tonymie pour deux classes s&#233;mantiques, la classe
LOCATION avec des noms de lieux et la classe ORGANISATION avec des noms d&#8217;entreprises.
L&#8217;objectif pour les participants est de classer automatiquement des occurences pr&#233;-s&#233;lectionn&#233;es
et en contexte de noms de lieux et d&#8217;entreprises, et ce en fonction de leur interpr&#233;tation lit&#233;rale
ou non-lit&#233;rale. Cette premi&#232;re alternative correspond &#224; l&#8217;annotation &#8220; gros grain &#8221; ou coarse-
grained annotation. Deux autres niveaux d&#8217;annotation sont possibles : un niveau &#8220;moyen &#8221; (me-
dium) pour lequel il faut faire la distinction entre des interpr&#233;tations lit&#233;rales, m&#233;tonymiques et
mixtes et, enfin, un niveau &#8220; fin &#8221; (fine), pour lequel il importe de pr&#233;ciser, en cas d&#8217;interpr&#233;-
tation m&#233;tonymique, le patron m&#233;tonymique dont il est question. &#192; titre d&#8217;illustration, nous
pouvons reprendre les exemples donn&#233;s par les organisatrices dans le document d&#233;crivant la
t&#226;che (Markert &amp; Nissim, 2007) :
</p>
<p>At the time of Vietnam, increased spending led to inflation.
BMW slipped 4p to 31p.
The BMW slowed down.
</p>
<p>Pour la premi&#232;re phrase, le nom Vietnam ne renvoie pas au pays mais &#224; la guerre qui s&#8217;y est
d&#233;roul&#233;e, il convient donc d&#8217;annoter cette entit&#233; comme non-literal (niveau 1), comme
metonymic (niveau 2) ou comme place-for-event (niveau 3). De m&#234;me, les occur-
rences de BMW dans les exemples suivants ne renvoient pas &#224; l&#8217;entreprise mais &#224; l&#8217;action de
l&#8217;entreprise pour la premi&#232;re (org-for-index) et au produit de cette entreprise pour la se-
conde (org-for-product). Les trois niveaux d&#8217;annotation pour les noms d&#8217;entreprise et
pour les noms de pays sont repr&#233;sent&#233;s ci-apr&#232;s dans le tableau 12 .
</p>
<p>4 Un syst&#232;me de r&#233;solution de m&#233;tonymie pour les EN
</p>
<p>Notre participation &#224; la t&#226;che de r&#233;solution de m&#233;tonymie pour les noms de pays et d&#8217;entreprises
(Brun et al., 2007) a consist&#233; en l&#8217;&#233;laboration d&#8217;un syst&#232;me automatique hybride reposant sur la
combinaison d&#8217;un composant symbolique et d&#8217;un composant distributionnel. Nous pr&#233;senterons
successivement ces deux composants.
</p>
<p>2Davantage de pr&#233;cisions sur les cat&#233;gories d&#8217;annotation (ou patrons m&#233;tonymiques) sont disponibles dans
(Markert &amp; Nissim, 2007).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Maud Ehrmann, Guillaume Jacquet
</p>
<p>Cat&#233;gorie : ORGANISATION
</p>
<p>coarse medium fine
literal literal literal
</p>
<p>non-literal
</p>
<p>mixed mixed
</p>
<p>metonymic
</p>
<p>othermet
</p>
<p>object-for-name
</p>
<p>object-for-representation
</p>
<p>organisation-for-members
</p>
<p>organisation-for-event
</p>
<p>organisation-for-product
</p>
<p>organisation-for-facility
</p>
<p>organisation-for-index
</p>
<p>Cat&#233;gorie : LOCATION
</p>
<p>coarse medium fine
literal literal literal
</p>
<p>non-literal
</p>
<p>mixed mixed
</p>
<p>metonymic
</p>
<p>othermet
</p>
<p>object-for-name
</p>
<p>object-for-representation
</p>
<p>place-for-people
</p>
<p>place-for-event
</p>
<p>place-for-product
</p>
<p>TAB. 1 &#8211; Niveaux de granularit&#233; et cat&#233;gories d&#8217;annotation pour les classes ORGANISATION et
LOCATION.
</p>
<p>4.1 Composant symbolique
</p>
<p>Analyse syntaxique robuste avec XIP L&#8217;&#233;l&#233;ment fondamental sur lequel repose notre ap-
proche est l&#8217;analyseur syntaxique robuste XIP (A&#239;t-Mokhtar &amp; Chanod, 1997), (A&#239;t-Mokhtar
et al., 2002). Xerox Incremental Parser prend en entr&#233;e du texte tout venant et produit en sortie
de fa&#231;on robuste une analyse syntaxique profonde. &#192; partir d&#8217;un ensemble de r&#232;gles, l&#8217;ana-
lyseur est capable de faire de la d&#233;sambigu&#239;sation de cat&#233;gories, de construire des syntagmes
noyaux et d&#8217;extraire des relations de d&#233;pendances syntaxiques entre unit&#233;s lexicales simples
et/ou complexes. En plus de l&#8217;analyse des relations syntaxiques de surface, XIP effectue &#233;gale-
ment une analyse syntaxique dite &#8220; profonde &#8221; ou &#8220; normalis&#233;e &#8221; (prise en compte des sujets et
objets de verbes non finis, normalisation de la forme passive en forme active, etc (Hag&#232;ge &amp;
Roux, 2003)), l&#8217;exploitation d&#8217;information de s&#233;mantique lexicale, avec les classes verbales de
Levin (Levin, 1993) et quelques &#233;l&#233;ments de Framenet (Ruppenhofer et al., 2006). Ci-dessous
un exemple de sortie XIP (avec l&#8217;arbre des chunks et les relations de d&#233;pendance) pour la phrase
suivante :
</p>
<p>Iran wanted the two centers to generate part of its electricity needs. TOP { SC{ NP{Iran} FV{wanted}}
NP{the two centers} IV{to generate} NP{part} PP{of NP{its electricity needs}} .}
</p>
<p>MOD_PRE (needs,electricity) SUBJ-N (generate,centers)
LOCATION (Iran) EXPERIENCER-PRE(wanted,Iran)
CONTENT(wanted,centers) OBJ-N(generate,needs)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution de M&#233;tonymie des Entit&#233;s Nomm&#233;es : proposition d&#8217;une m&#233;thode hybride
</p>
<p>L&#8217;analyseur d&#233;crit ci-dessus contient d&#233;j&#224; un module de reconnaissance d&#8217;entit&#233;s nomm&#233;es
(Brun &amp; Hag&#232;ge, 2004), mais ce dernier ne permet pas le traitement de la m&#233;tonymie ; il a
fallu proc&#233;der &#224; son adaptation.
</p>
<p>Adaptation &#224; la t&#226;che de r&#233;solution de m&#233;tonymie Pour ce faire, nous avons &#233;tudi&#233; les cor-
pus d&#8217;entra&#238;nement &#224; l&#8217;aide de XIP, en tenant compte des directives d&#8217;annotation. Pour les noms
de pays et d&#8217;entreprises, notre attention s&#8217;est focalis&#233;e sur les types de relations grammaticales
dans lesquelles &#233;taient impliqu&#233;es les unit&#233;s &#224; &#233;tudier et sur les informations lexicales ou s&#233;-
mantiques attach&#233;es aux arguments de ces relations. Pour chaque patron m&#233;tonymique, nous
avons donc analys&#233; l&#8217;ensemble de ses occurrences (attach&#233;es &#224; une unit&#233; lexicale) dans le cor-
pus d&#8217;entra&#238;nement pour d&#233;gager des configurations grammaticales et lexicales jouant le r&#244;le d&#8217;
&#8220; amorces &#8221; d&#8217;interpr&#233;tations m&#233;tonymiques.
Au terme de cette &#233;tude de corpus, il fut possible de prendre en compte l&#8217;ensemble des indices
r&#233;colt&#233;s et d&#8217;&#233;laborer un module de r&#233;solution de m&#233;tonymie dans XIP. Intervenant &#224; la fin de
la cha&#238;ne de traitements de l&#8217;analyseur, cette adaptation consiste en l&#8217;&#233;criture de r&#232;gles tradui-
sant les configurations discriminantes relev&#233;es pour tel ou tel patron d&#8217;une part, et &#224; l&#8217;ajout de
lexique d&#8217;autre part. &#192; titre d&#8217;exemple, prenons l&#8217;hypoth&#232;se suivante : &#8220; Si un nom de pays est
sujet d&#8217;un verbe renvoyant &#224; une action &#233;conomique, alors le patron loc-for-people doit
s&#8217;appliquer &#8221; ; cette hypoth&#232;se se retrouve dans XIP sous la forme de r&#232;gle :
</p>
<p>if (LOCATION(#1) &amp; SUBJ-N (#2[v_econ],#1))
LOC-FOR-PEOPLE (#1)
</p>
<p>R&#232;gle qui se lit ainsi : si le parseur a d&#233;tect&#233; un nom de pays (#1) qui est le sujet d&#8217;un verbe (#2)
portant le trait &#8220;v_econ &#8221;, alors il cr&#233;&#233;e un relation unaire LOC-FOR-PEOPLE pour le nom de
pays.
</p>
<p>En sus des indices r&#233;colt&#233;s lors de l&#8217;&#233;tude de corpus, nous avons exploit&#233; des informations lexi-
cales d&#233;j&#224; cod&#233;es dans XIP, comme par exemple les traits attach&#233;s aux verbes de communication
(say, deny, comment) et les cat&#233;gories relevant du cadre &#8220; experiencer &#8221; de Framenet, &#224; savoir
des verbes tels que feel, sense, see, les noms despair, compassion, adoration ou les adjectifs syn-
pathetic, sad, etc. En effet, eu &#233;gard au fait que ce cadre &#8220; experiencer &#8221; renvoie &#224; des personnes
ou &#224; des groupes de personnes, d&#232;s lors qu&#8217;un nom de pays ou d&#8217;entreprise a ce r&#244;le, il peut &#234;tre
annot&#233; en tant que loc-for-people ou organisation-for-members. Ci-dessous un
exemple de sortie de l&#8217;analyseur avec le nouveau d&#233;veloppement :
It was the largest Fiat everyone had ever seen.
</p>
<p>ORG_FOR_PRODUCT (Fiat) MOD_PRE (seen,ever)
SUBJ-N_PRE (was,It) ATTRIB(It,Fiat)
EXPERIENCER_PRE(seen,everyone) QUALIF(Fiat,largest)
</p>
<p>Dans cet exemple, la pr&#233;sence de la relation QUALIF entre le nom d&#8217;entreprise Fiat et l&#8217;ad-
jectif largest, renforc&#233;e par la pr&#233;sence d&#8217;un article d&#233;fini, conduit &#224; l&#8217;annotation en tant que
ORG_FOR_PRODUCT. Ce composant symbolique constitue le premier volet de notre m&#233;thode
de r&#233;solution de m&#233;tonymie, il est compl&#233;t&#233; par un composant distributionnel, qu&#8217;il convient &#224;
pr&#233;sent de d&#233;tailler.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Maud Ehrmann, Guillaume Jacquet
</p>
<p>4.2 Composant distributionnel
</p>
<p>Intervient en &#8220; deuxi&#232;me passe &#8221; de notre syst&#232;me, un composant distributionnel. L&#8217;id&#233;e princi-
pale de cette combinaison est d&#8217;exploiter deux m&#233;thodes relevant d&#8217;approches diff&#233;rentes mais
compl&#233;mentaires, autrement dit de pallier les manquements de l&#8217;analyse symbolique, focalis&#233;e
sur des donn&#233;es pr&#233;cises n&#233;cessitant une &#233;tude minutieuse, par une analyse distributionnelle,
apte &#224; r&#233;colter des informations &#224; grande &#233;chelle sur d&#8217;importantes donn&#233;es textuelles. Le prin-
cipe est donc, lorsqu&#8217;une unit&#233; n&#8217;a pu &#234;tre trait&#233;e par le composant symbolique, d&#8217;essayer de
trouver son annotation en exploitant les informations pr&#233;sentes &#224; propos de cette unit&#233; ou d&#8217;une
unit&#233; de m&#234;me type dans un grand corpus. Nous pr&#233;sentons rapidement l&#8217;analyse distribution-
nelle avant de d&#233;tailler sa mise en &#339;uvre pour la r&#233;solution de m&#233;tonymie.
</p>
<p>L&#8217;analyse distributionnelle La notion d&#8217;analyse distributionnelle a &#233;t&#233; introduite par Z. S.
Harris. En linguistique de corpus, cette m&#233;thode est aujourd&#8217;hui largement exploit&#233;e, notam-
ment dans les travaux de terminologie, de structuration de terminologie et de construction
d&#8217;ontologies (Faure &amp; Nedellec, 1999) (Assadi, 1998) (Bourigault, 2002). L&#8217;hypoth&#232;se est la
suivante : il serait possible, &#224; partir de r&#233;gularit&#233;s syntaxiques observ&#233;es pour un ensemble de
mots, de d&#233;duire des propri&#233;t&#233;s s&#233;mantiques pour ces mots. Concr&#232;tement, il s&#8217;agit d&#8217;&#233;tudier
la distribution des mots, c&#8217;est &#224; dire les contextes lexico-syntaxiques dans lesquels ils appa-
raissent, pour ensuite tenter de d&#233;gager des parent&#233;s s&#233;mantiques. S&#8217;inscrivant dans ce cadre,
G. Jacquet et F. Venant ont &#233;labor&#233; une m&#233;thode automatique de d&#233;sambigu&#239;sation du sens d&#8217;un
mot en contexte, reposant sur la prise en compte de l&#8217;influence des &#233;l&#233;ments syntaxiques et
lexicaux pr&#233;sents dans l&#8217;&#233;nonc&#233; (Jacquet &amp; Venant, 2003). Ainsi, il ne cherchent plus seule-
ment &#224; cr&#233;er des classes de mots relevant du m&#234;me champ s&#233;mantique &#8220;mais des classes de
mots dont le comportement s&#233;mantique influence de la m&#234;me fa&#231;on un contexte donn&#233; &#8221;. Le
composant distributionnel &#233;labor&#233; pour la r&#233;solution de m&#233;tonymie s&#8217;inscrit dans la perspective
de ces travaux.
</p>
<p>M&#233;thode distributionnelle pour la r&#233;solution de m&#233;tonymie L&#8217;objectif ici est de rappro-
cher des contextes et d&#8217;exploiter les r&#233;sultats du composant symbolique. Cette m&#233;thode com-
porte deux processus. Il s&#8217;agit d&#8217;une part de construire un espace distributionnel pour &#234;tre en
mesure de rapprocher des contextes en fonction d&#8217;une entit&#233; donn&#233;e et, d&#8217;autre part, de capitali-
ser l&#8217;information du composant symbolique sous la forme d&#8217;une sorte de &#8220; base de donn&#233;e &#8221; de
contextes avec annotation. Nous d&#233;taillons ces deux processus successivement.
</p>
<p>Construction de l&#8217;espace distributionnel et rapprochement des contextes Ce premier pro-
cessus comporte 5 &#233;tapes. Le point de d&#233;part est le corpus BNC dans son entier (100 millions
de mots), duquel on &#233;t&#233; extraits les corpus d&#8217;entra&#238;nement et de test de la t&#226;che de r&#233;solution de
m&#233;tonymie.
</p>
<p>La premi&#232;re &#233;tape correspond &#224; l&#8217;analyse syntaxique de ce corpus (&#224; l&#8217;aide de l&#8217;analyseur XIP)
afin d&#8217;en extraire des d&#233;pendances syntaxiques. C&#8217;est &#224; partir de ces d&#233;pendances que sont
construits les contextes et les unit&#233;s lexicales. Prenons un exemple, avec la proposition provide
Albania with food aid. Les d&#233;pendances extraites par XIP sont les suivantes :
</p>
<p>IND-OBJ-N3(VERB :provide,NOUN :Albania)
PREP_WITH(VERB :provide,NOUN :aid)
</p>
<p>3la relation ind-obj-n correspond &#224; la relation syntaxique objet indirect.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution de M&#233;tonymie des Entit&#233;s Nomm&#233;es : proposition d&#8217;une m&#233;thode hybride
</p>
<p>PREP_WITH(VERB :provide,NOUN :food aid)
</p>
<p>O&#249; l&#8217;on peut voir que les arguments des d&#233;pendances sont de simples unit&#233;s lexicales (aid) ou
des syntagmes (food aid).
</p>
<p>La deuxi&#232;me &#233;tape de ce processus est la construction d&#8217;un espace distributionnel &#224; partir de
ces d&#233;pendances. Cet espace distributionnel est l&#8217;inverse de celui habituellement construit en
analyse distributionnelle : puisque l&#8217;objectif est de rapprocher des contextes, chaque point de
l&#8217;espace est une contexte syntaxique et chaque dimension est une unit&#233; lexicale. Cet inversion
constitue une premi&#232;re diff&#233;rence avec l&#8217;approche de G. Jacquet et F. Venant (Jacquet &amp; Venant,
2003). Chaque d&#233;pendance obtenue lors de l&#8217;&#233;tape pr&#233;c&#233;dente permet de construire plusieurs
contextes simples et/ou compos&#233;s. Un contexte syntaxique comporte une relation et une unit&#233;
lexicale. La m&#233;thode pr&#233;voit &#233;galement de construire des contextes compos&#233;s (autre diff&#233;rence
par rapport &#224; (Jacquet &amp; Venant, 2003)), soit des contextes combinant plusieurs contextes, dont
le premier comporte n&#233;cessairement un syntagme verbal et le second a pour recteur ce m&#234;me
syntagme. Pour la phrase analys&#233;e ci-dessus, les unit&#233;s lexicales, les contextes simples (1. pour
recteur et 2. pour r&#233;gi) et les contextes compos&#233;s sont les suivants :
</p>
<p>Unit&#233;s lexicales Contextes simples Contextes compos&#233;s
VERB :provide 1.VERB :provide.IND-OBJ-N 1.VERB :provide.IND-OBJ-N + 2.NOUN : aid.PREP_WITH
</p>
<p>NOUN :Albania 1.VERB :provide.PREP_WITH 1.VERB :provide.IND-OBJ-N + 2.NOUN :aid.PREP_WITH
</p>
<p>NOUN :aid 2.NOUN :Albania.IND-OBJ-N 1.VERB :provide.IND-OBJ-N + 2.NOUN :food aid.PREP_WITH
</p>
<p>NOUN :food aid 2.NOUN :aid.PREP_WITH 1.VERB :provide.PREP_WITH + 2.NOUN :Albania.IND-OBJ-N
</p>
<p>2.NOUN :food aid.PREP_WITH
</p>
<p>Une heuristique permet de filtrer ces donn&#233;es en fonction de leur productivit&#233; : chaque unit&#233;
lexicale doit &#234;tre pr&#233;sente au moins 100 fois dans le corpus, tout comme les contextes (y compris
les contextes compos&#233;s). Avec le corpus BNC de 100 millions de mots, on obtient au final 60 849
unit&#233;s lexicales et 140 634 contextes. Il est donc possible de construire un espace distributionnel
comportant 140 634 points (les contextes) et 60 849 dimensions (les unit&#233;s lexicales). Cet espace
est le mat&#233;riau de base &#224; partir duquel les autres traitements viennent s&#8217;effectuer.
</p>
<p>&#192; partir de la troisi&#232;me &#233;tape intervient la prise en compte d&#8217;une unit&#233; lexicale pr&#233;cise, pour
laquelle le composant symbolique n&#8217;a pu trouver d&#8217;annotation. En fonction de cette unit&#233; et de
son contexte d&#8217;apparition (soit telle qu&#8217;elle appara&#238;t dans un extrait de SemEval), il s&#8217;agit tout
d&#8217;abord de construire un sous-espace, de la mani&#232;re suivante :
</p>
<p>Pour un couple donn&#233; form&#233; d&#8217;un contexte i et d&#8217;une unit&#233; lexicale j :
&#8211; Le sous-espace des contextes &#233;quivaut &#224; la liste des contextes occurrant avec l&#8217;unit&#233; lexicale
</p>
<p>j. S&#8217;il y a plus de k contextes, alors on ne garde que ces k contextes les plus fr&#233;quents ;
&#8211; Le sous-espace des dimensions &#233;quivaut &#224; la liste des unit&#233;s lexicales occurrant avec au moins
un des contextes du sous-espace des contextes. S&#8217;il y a plus de n unit&#233;s, alors on ne garde que
ces n unit&#233;s les plus fr&#233;quentes.
</p>
<p>La quatri&#232;me &#233;tape consiste &#224; r&#233;duire les dimensions de ce sous-espace, &#224; l&#8217;aide d&#8217;une analyse
factorielle des correspondances (AFC ; &#233;quivaut &#224; une ACP avec la m&#233;trique du Chi2).
</p>
<p>Enfin, la cinqui&#232;me &#233;tape consiste &#224; rapprocher les contextes restants, c&#8217;est &#224; dire ayant pass&#233;s
le filtre des deux &#233;tapes pr&#233;c&#233;dentes. Ce rapprochement est calcul&#233; &#224; l&#8217;aide de la distance eucli-
dienne. On obtient ainsi, au final, une liste des contextes proches de celui de l&#8217;unit&#233; consid&#233;r&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Maud Ehrmann, Guillaume Jacquet
</p>
<p>Pour l&#8217;unit&#233; Albania dans le contexte provide, les contextes les plus proches sont pr&#233;sent&#233;s dans
la premi&#232;re colonne du tableau 2.
</p>
<p>Pour pouvoir utiliser cette liste de contextes, encore faut-il savoir s&#8217;ils ont re&#231;u ou non une
annotation par le composant symbolique. Intervient alors le second processus.
</p>
<p>Capitalisation de l&#8217;information du composant symbolique Ce second processus a pour ob-
jectif de construire une sorte de base de donn&#233;es de contextes avec annotations. Deux &#233;tapes
sont n&#233;cessaires. Le corpus est analys&#233; BNC avec XIP, augment&#233; cette fois-ci du module de r&#233;-
solution de m&#233;tonymie. Cette analyse permet d&#8217;obtenir des d&#233;pendances syntaxiques mettant en
jeu des noms de pays et des noms d&#8217;entreprise avec leurs annotation m&#233;tonymique (application
du module de r&#233;solution de m&#233;tonymie sur les entit&#233;s nomm&#233;es reconnues par l&#8217;analyseur, ind&#233;-
pendamment des donn&#233;es de SemEval). Le r&#233;sultat de cette premi&#232;re &#233;tape est donc une s&#233;rie de
contextes impliquant des unit&#233;s lexicales avec leur annotation. La deuxi&#232;me &#233;tape correspond
&#224; la s&#233;lection de contextes discriminants au regard des annotations. Par exemple, si le contexte
VERB :allow.IND-OBJ-N se retrouve pour 10% des cas avec une unit&#233; comportant l&#8217;annotation
literal et pour 90% des autres avec une unit&#233; comportant l&#8217;annotation loc-for-people,
alors le contexte est consid&#233;r&#233; comme discriminant vis-&#224;-vis de cette derni&#232;re annotation. En
revanche, si un contexte se trouve dans 50% des cas avec telle annotation et 50% des cas avec
telle autre, alors il n&#8217;est pas conserv&#233;. &#192; l&#8217;issue de cette s&#233;lection de contextes discriminants, on
dispose alors d&#8217;un stock de contextes avec leurs annotations, pouvant &#234;tre exploit&#233; en parall&#232;le
avec le processus pr&#233;c&#233;dent.
</p>
<p>Annotation d&#8217;une unit&#233; Le premier processus permet de d&#233;terminer une liste de contextes
plus ou moins proches du contexte dans lequel appara&#238;t une unit&#233; lexicale non annot&#233;e. Le
second permet de collecter un certain nombre de contextes avec leur annotation. Ces deux types
de donn&#233;es peuvent d&#232;s lors &#234;tre crois&#233;es pour permettre l&#8217;annotation d&#8217;une unit&#233;.
</p>
<p>Ci-dessous (tableau de gauche) la liste de contextes proches du contexte VERB :provide.IND-
OBJ-N pour la proposition provide Albania with food aid, avec l&#8217;indication de leur distance et
de leur annotation correspondante dans la base de donn&#233;es de contextes :
</p>
<p>Contexte Distance Annotation
VERB :provide.IND-OBJ-N 0.00
VERB :allow.OBJ-N 0.76 LOC-FOR-PEOPLE
VERB :include.OBJ-N 0.96
ADJ :new.MOD_PRE 1.02
VERB :be.SUBJ-N 1.43
VERB :supply.SUBJ-N_PRE 1.47 LITERAL
VERB :become.SUBJ-N_PRE 1.64
VERB :come.SUBJ-N_PRE 1.69
VERB :support.SUBJ-N_PRE 1.70 LOC-FOR-PEOPLE
. . . . . . . . .
</p>
<p>Annotation Score
LOC-FOR-PEOPLE 3.11
LITERAL 1.23
LOC-FOR-EVENT 0.00
. . . . . .
</p>
<p>TAB. 2 &#8211; Listes des contextes les plus proches de VERB :provide.IND-OBJ-N et Scores des annotations.
</p>
<p>Pour pouvoir d&#233;terminer une annotation pour le contexte provide.IND-OBJ-N, il faut regarder
les annotations attribu&#233;es &#224; ses contextes les plus proches et examiner si elles sont pertinentes
ou non. Pour ce faire, il importe de calculer un score pour chaque annotation, valorisant sa</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;solution de M&#233;tonymie des Entit&#233;s Nomm&#233;es : proposition d&#8217;une m&#233;thode hybride
</p>
<p>pr&#233;sence dans les contextes de &#8220; t&#234;te de liste : le score d&#8217;une annotation donn&#233;e est &#233;gal &#224;
l&#8217;inverse de la somme des distances des contextes portant cette annotation. Pour notre cas, les
scores sont pr&#233;sent&#233;s dans le tableau ci-dessus &#224; gauche ; il est alors possible, en fonction de ces
scores, d&#8217;attribuer l&#8217;annotation LOC-FOR-PEOPLE &#224; l&#8217;unit&#233; Albania dans la proposition provide
Albania with food aid.
</p>
<p>5 Evaluation et analyse des r&#233;sultats
</p>
<p>Ci-dessous les taux de pr&#233;cisions pour l&#8217;ensemble des participants pour les noms de lieux (ta-
bleau 3) et les noms d&#8217;entreprises (tableau 4).
</p>
<p>XXXXXXXXXXXXT&#226;che
Syst&#232;mes
</p>
<p>baseline up13 FUH UTD-HLT-CG XRCE-M GYDER
</p>
<p>LOCATION-coarse 0.794 0.754 0.778 0.841 0.851 0.852
LOCATION-medium 0.794 0.750 0.772 0.840 0.848 0.848
LOCATION-fine 0.794 0.741 0.759 0.822 0.841 0.844
</p>
<p>TAB. 3 &#8211; Taux de Pr&#233;cision pour tous les syst&#232;mes pour la classe LOCATION.
</p>
<p>XXXXXXXXXXXXT&#226;che
Syst&#232;mes
</p>
<p>baseline XRCE-M UTD-HLT-CG GYDER
</p>
<p>ORGANISATION-coarse 0.618 0.732 0.739 0.767
ORGANISATION-medium 0.618 0.711 0.711 0.733
ORGANISATION-fine 0.618 0.700 0.711 0.728
</p>
<p>TAB. 4 &#8211; Taux de Pr&#233;cision pour tous les syst&#232;mes pour la classe ORGANISATION.
</p>
<p>Malgr&#233; certaines imperfections, XRCE-M est relativement bien plac&#233; au sein des autres syst&#232;mes
ayant particip&#233; &#224; l&#8217;&#233;valuation (cf tableaux 3 et 4), avec notamment une seule erreur de plus
pour la classe LOCATION par rapport au syst&#232;me le plus performant GYDER. Cinq syst&#232;mes
ont particip&#233; &#224; la t&#226;che sur les LOCATION et trois &#224; celle sur les ORGANISATION, pour tous les
niveaux de granularit&#233; &#224; chaque fois. Hormis XRCE-M, les syst&#232;mes reposaient sur des m&#233;thodes
statistiques par apprentissage, mais surtout, notre syst&#232;me est le seul &#224; ne pas avoir utilis&#233; les
annotations syntaxiques manuelles fournies par les organisatrices. Deux syst&#232;mes ne sont pas
parvenus &#224; atteindre la baseline pour les noms de lieux.
</p>
<p>6 Conclusion
</p>
<p>Dans cet article, nous avons d&#233;crit un syst&#232;me hybride pour la r&#233;solution de m&#233;tonymies. Notre
approche, quoique perfectible, a d&#8217;ores et d&#233;j&#224; montr&#233; des r&#233;sultats encourangeants lors de la
comp&#233;tition SemEval. Les perspectives de d&#233;veloppement sont nombreuses, pour notre syst&#232;me
tout comme pour la t&#226;che de r&#233;solution de m&#233;tonymie en g&#233;n&#233;ral. &#192; notre &#233;chelle, nous envi-
sageons de poursuivre le travail entrepris afin d&#8217;am&#233;liorer les performances du syst&#232;me pour
les glissement de sens d&#233;j&#224; pris en compte et d&#8217;&#233;tendre ce traitement &#224; d&#8217;autres types d&#8217;entit&#233;s
nomm&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Maud Ehrmann, Guillaume Jacquet
</p>
<p>R&#233;f&#233;rences
</p>
<p>(1995). MUC-6. Proceedings of the Sixth Message Understanding Conference. Informations
disponibles &#224; l&#8217;adresse suivante : http ://www.cs.nyu.edu/cs/faculty/grishman/muc6.html.
</p>
<p>(1998). MUC-7. Proceedings of the Seventh Message Understanding Conference. Informa-
tions disponibles &#224; l&#8217;adresse suivante : http ://www-nlpir.nist.gov/related_projects/muc/.
</p>
<p>ASSADI H. (1998). Construction d&#8217;ontologies &#224; partir de textes techniques. Application aux
syst&#232;mes documentaires. PhD thesis, Universit&#233; Paris VI.
</p>
<p>A&#207;T-MOKHTAR S. &amp; CHANOD J. P. (1997). Incremental finite-state parsing. In Proceedings
of Applied Natural Language Processing, Washington, DC.
</p>
<p>A&#207;T-MOKHTAR S., CHANOD J. P. &amp; ROUX C. (2002). Robustness beyond shallowness :
incremental dependency parsing. NLE Journal.
</p>
<p>BOURIGAULT D. (2002). Upery : un outil d&#8217;analyse distributionnelle &#233;tendue pour la construc-
tion d&#8217;ontologies &#224; partir de corpus. In Actes de TALN 2002, Nancy.
</p>
<p>BRUN C., EHRMANN M. &amp; JACQUET G. (2007). XRCE-M : A hybrid system for named
entity metonymy resolution. In 4th International Workshop on Semantic Evaluations, Prague :
ACL-SemEval 2007.
</p>
<p>BRUN C. &amp; HAG&#200;GE C. (2004). Intertwining deep syntactic processing and named entity
detection. In ESTAL, Alicante, Espagne.
</p>
<p>EHRMANN M. &amp; JACQUET G. (2006). Vers une double annotation des entit&#233;s nomm&#233;es.
Traitement Automatique des Langues, 47(3). Disponible sur : http ://www.atala.org.
FAURE D. &amp; NEDELLEC C. (1999). Knowledge acquisition of predicate argument structures
from technical texts using machine learning : the system asium. In Poceeedings of the 11th
European Workshop, Knowledge Acquisition, Modelling and Managment (EKAW&#8217;99), Juan-
les-Pins, France.
</p>
<p>HAG&#200;GE C. &amp; ROUX C. (2003). Entre syntaxe et s&#233;mantique : Normalisation de la sortie de
l&#8217;analyse syntaxique en vue de l&#8217;am&#233;lioration de l&#8217;extraction d&#8217;information &#224; partir de textes.
In TALN 2003, Batz-sur-Mer.
</p>
<p>JACQUET G. &amp; VENANT F. (2003). Construction automatique de classes de s&#233;lection dis-
tributionnelle. In Actes de la 10&#232;me conf&#233;rence annuelle sur le Traitement Automatique des
Langues (TALN 2003), Dourdan, France.
</p>
<p>LEVIN B. (1993). English Verb Classes and Alternations - A Preliminary Investigation. The
University of Chicago Press,.
</p>
<p>MARKERT K. &amp; HAHN U. (2002). Understanding metonymies in discourse. Artificial Intel-
ligence, 135(1/2), 145&#8211;198.
MARKERT K. &amp; NISSIM M. (2006). Metonymic proper names : a corpus based account. In A.
STEFANOWITSCH &amp; S. GRIES, Eds., Corpus-based approaches to Metaphor and Metonymy,
p. 152&#8211;174. Mouton de Gruyter.
</p>
<p>MARKERT K. &amp; NISSIM M. (2007). Metonymy Resolution at SemEval I : Guidelines for
Participants. Rapport interne, SemEval.
</p>
<p>RUPPENHOFER J., ELLSWORTH M., PETRUCK M., JOHNSON C. &amp; SCHEFFCZYK J. (2006).
Framenet II : Extended Theory and Practice. Rapport interne, University of Berkeley. Dispo-
nible sur : http ://framenet.icsi.berkeley.edu/.</p>

</div></div>
</body></html>