<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>G&#233;n&#233;ration de reformulations locales par pivot
pour l&#8217;aide &#224; la r&#233;vision
</p>
<p>Aur&#233;lien Max
LIMSI-CNRS et Universit&#233; Paris-Sud 11
</p>
<p>Orsay, France
aurelien.max@limsi.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente une approche pour obtenir des paraphrases pour de courts
segments de texte qui peuvent aider un r&#233;dacteur &#224; reformuler localement des textes. La res-
source principale utilis&#233;e est une table d&#8217;alignements bilingues de segments d&#8217;un syst&#232;me de
traduction automatique statistique. Un segment marqu&#233; par le r&#233;dacteur est tout d&#8217;abord traduit
dans une langue pivot avant d&#8217;&#234;tre traduit &#224; nouveau dans la langue d&#8217;origine, ce qui est per-
mis par la nature m&#234;me de la ressource bilingue utilis&#233;e sans avoir recours &#224; un processus de
traduction complet. Le cadre propos&#233; permet l&#8217;int&#233;gration et la combinaison de diff&#233;rents mo-
d&#232;les d&#8217;estimation de la qualit&#233; des paraphrases. Des mod&#232;les linguistiques tentant de prendre
en compte des caract&#233;ristiques des paraphrases de courts segments de textes sont propos&#233;s, et
une &#233;valuation est d&#233;crite et ses r&#233;sultats analys&#233;s. Les domaines d&#8217;application possibles in-
cluent, outre l&#8217;aide &#224; la reformulation, le r&#233;sum&#233; et la r&#233;&#233;criture des textes pour r&#233;pondre &#224;
des conventions ou &#224; des pr&#233;f&#233;rences stylistiques. L&#8217;approche est critiqu&#233;e et des perspectives
d&#8217;am&#233;lioration sont propos&#233;es.
</p>
<p>Abstract. In this article, we present a method to obtain paraphrases for short text spans
that can be useful to help a writer in reformulating text. The main resource used is a bilingual
phrase table containing aligned phrases, a common resource in statistical machine translation.
The writer can mark a segment for paraphrasing, and this segment is first translated into a pi-
vot language before being back-translated into the original language, which is possible without
performing a full translation of the input. Our proposed framework allows integrating and com-
bining various models for estimating paraphrase quality. We propose linguistic models which
permits to conduct empirical experiments about the characteristics of paraphrases for short text
spans. Application domains include, in addition to paraphrasing aids, summarization and re-
phrasing of text for conforming to conventional or stylistic guidelines. We finally discuss the
limitations of our work and describe possible ways of improvement.
</p>
<p>Mots-cl&#233;s : Paraphrase, Traduction Automatique Statistique bas&#233;e sur les segments,
Aide &#224; la r&#233;daction.
</p>
<p>Keywords: Paraphrasing, Phrase-Based Statistical Machine Translation (PBSMT), Au-
thoring aids.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien Max
</p>
<p>1 Introduction
</p>
<p>La vie d&#8217;un texte est souvent pleine de rebondissements. Un auteur peut le r&#233;viser pour lui
apporter des corrections, le rendre plus court, l&#8217;adapter &#224; un lectorat voire le traduire dans une
autre langue. Lors de la phase de maturation d&#8217;un texte, celui-ci peut subir de nombreux change-
ments avant de prendre sa forme d&#233;finitive. &#192; contenu informationnel (plus ou moins) constant,
l&#8217;auteur cherche &#224; tendre vers des formulations qui seront plus adapt&#233;es au contexte en termes
de correction linguistique et de compr&#233;hensibilit&#233;. La question de la g&#233;n&#233;ration automatique de
reformulations, m&#234;me locales, et de l&#8217;&#233;valuation de leur adaptation &#224; leur contexte semble donc
particuli&#232;rement pertinente alors que les aides &#224; la r&#233;daction sont encore trop peu sensibles &#224; la
nature linguistique des textes manipul&#233;s.
</p>
<p>Des travaux en linguistique distinguent la reformulation &#224; vis&#233;e explicative, qui tente d&#8217;explici-
ter le sens, et la reformulation &#224; vis&#233;e imitative, qui tente de substituer des formulations &#233;quiva-
lentes (Fuchs, 1994). Ce dernier cas pose la difficile question de la prise en compte d&#8217;un seuil
de distortion au-del&#224; duquel une reformulation n&#8217;est plus admissible. Les syst&#232;mes de transfor-
mation automatique de texte butent en effet sur la prise en compte d&#8217;un tel seuil, qui n&#8217;est pas
explicit&#233; dans les principales mesures d&#8217;&#233;valuation utilis&#233;es, telles que BLEU (Papineni et al.,
2002) pour la traduction automatique ou ROUGE (Lin, 2004) pour le r&#233;sum&#233;. Une certaine mo-
d&#233;lisation de la reformulation m&#232;ne &#224; des techniques d&#8217;analyse et de reconnaissance de textes
qui sont des paraphrases les uns des autres &#224; des fins d&#8217;extraction d&#8217;informations, mais o&#249; cette
notion de seuil est souvent &#233;clips&#233;e au profit du rappel.
</p>
<p>Dans cet article, nous pr&#233;sentons une approche permettant de proposer &#224; un r&#233;dacteur des re-
formulations pour de courts segments de texte (par ex. dans de bonnes conditions, maintenir
le contact, la plus &#233;troite) au cours de l&#8217;activit&#233; de r&#233;vision. Ce type d&#8217;aide reprend les prin-
cipes de certains travaux visant &#224; faire des suggestions lexicales, par exemple en enrichissant
des dictionnaires avec des index d&#8217;associations, telles que des mots li&#233;s th&#233;matiquement (Ferret
&amp; Zock, 2006). Dans cet article, nous commen&#231;ons par d&#233;crire bri&#232;vement les travaux existant
en paraphrasage automatique, puis nous d&#233;crivons les fondements de notre approche inspir&#233;e
de (Bannard &amp; Callison-Burch, 2005), qui consiste &#224; utiliser des traductions de segments en
pivot pour produire des reformulations et s&#233;lectionner parmi celles-ci celles qui sont pr&#233;f&#233;r&#233;es
par diff&#233;rents types de mod&#232;les. Une &#233;valuation est d&#233;crite et ses r&#233;sultats sont analys&#233;s, ce qui
met en &#233;vidence le caract&#232;re prometteur de l&#8217;approche propos&#233;e et sugg&#232;re de nouvelles voies
de recherche. En particulier, nous soulignons l&#8217;importance d&#8217;utiliser le contexte de la phrase
d&#8217;origine contenant le segment &#224; paraphraser pour le choix des segments pivots, importance
qu&#8217;on retrouve dans le domaine de la traduction automatique.
</p>
<p>2 Travaux ant&#233;rieurs
</p>
<p>La possibilit&#233; d&#8217;utiliser de grands corpus comparables et parall&#232;les a suscit&#233; r&#233;cemment une
vague de travaux autour du paraphrasage. Des travaux ont par exemple port&#233; sur l&#8217;apprentissage
et l&#8217;utilisation de paraphrases pour am&#233;liorer des t&#226;ches telles que la recherche d&#8217;informations
pr&#233;cises (Duclaye et al., 2003) ou la d&#233;duction sur textes, et des applications texte-&#224;-texte,
telle que la traduction automatique (Callison-Burch, 2007), ou encore l&#8217;&#233;valuation de ce type
d&#8217;applications en traduction (Kauchak &amp; Barzilay, 2006) ou en r&#233;sum&#233; (Zhou et al., 2006).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision
</p>
<p>Les syst&#232;mes de g&#233;n&#233;ration automatique de texte non-d&#233;terministes offrent un cadre naturel
pour la g&#233;n&#233;ration de paraphrases, dont les plus &#171; naturelles &#187; peuvent &#234;tre s&#233;lectionn&#233;es par
un mod&#232;le de langue (Landkilde &amp; Knight, 1998). Si un point fort de ce type d&#8217;approche est
qu&#8217;il est possible de produire des paraphrases de nature tr&#232;s diff&#233;rentes, la construction d&#8217;un
tel syst&#232;me permettant de produire une grande variabilit&#233; de textes en sortie est difficile, et
ces syst&#232;mes attendent des entr&#233;es qui sont soit sous forme de concepts, soit sous forme de
sp&#233;cifications de phrases.
</p>
<p>Des alignements appris &#224; partir de corpus comparables (monolingues) permettent de g&#233;n&#233;rer
des reformulations en se passant d&#8217;un tel g&#233;n&#233;rateur. Par exemple, (Barzilay &amp; Lee, 2003) ap-
prennent des treillis factorisant l&#8217;ensemble des reformulations possibles au niveau des phrases,
ce qui est rendu possible par la nature m&#234;me de leur corpus d&#8217;apprentissage (documents jour-
nalistiques d&#233;crivant les m&#234;mes &#233;v&#233;nements). Pour une phrase en entr&#233;e, si un treillis qui lui
correspond est trouv&#233;, celui-ci est utilis&#233; pour produire un ensemble de formulations corres-
pondant aux chemins du treillis. Si ce type d&#8217;approche peut parfois produire de tr&#232;s bonnes
reformulations phrastiques, une bonne couverture des ph&#233;nom&#232;nes linguistiques s&#8217;av&#232;re diffi-
cile &#224; obtenir. En outre, des reformulations plus locales sont moins susceptibles d&#8217;alt&#233;rer le sens
des phrases. (Quirk et al., 2004) proposent une approche consistant &#224; apprendre un syst&#232;me de
traduction statistique sur un corpus monolingue de phrases align&#233;es automatiquement &#224; partir
d&#8217;un corpus comparable, qui fonctionne par d&#233;codage monotone et donc op&#232;re par reformula-
tions locales. Si cette absence de transformations profondes est souvent per&#231;ue comme l&#8217;une
des principales limitations des syst&#232;mes de traduction statistiques actuels, elle permet n&#233;an-
moins de limiter les risques de d&#233;formation du sens. D&#8217;autres travaux ont exploit&#233; des corpus
parall&#232;les monolingues, comme diff&#233;rentes traductions d&#8217;un m&#234;me texte, pour apprendre des
treillis permettant de g&#233;n&#233;rer des paraphrases (Pang et al., 2003).
Si ces approches s&#8217;attaquent toutes au paraphrasage d&#8217;&#233;nonc&#233;s complets, il est &#233;galement int&#233;-
ressant de proposer des reformulations pour des unit&#233;s plus petites. &#192; partir de corpus parall&#232;les
bilingues, ressources traditionnelles pour l&#8217;apprentissage des syst&#232;mes de traduction statistique,
(Bannard &amp; Callison-Burch, 2005) ont propos&#233; une approche pour le paraphrasage de courts
segments de mots par traduction dans une langue puis par r&#233;tro-traduction et s&#233;lection dans la
langue d&#8217;origine. Le probl&#232;me de la validit&#233; d&#8217;une paraphrase en contexte pose notamment la
question de la prise en compte de son contexte d&#8217;apparition, probl&#232;me qui a r&#233;cemment &#233;t&#233;
abord&#233; en traduction automatique statistique (Stroppa et al., 2007). Des travaux existent au
niveau des paraphrases lexicales, comme ceux de (Connor &amp; Roth, 2007) qui proposent un
classifieur pour d&#233;cider si un mot peut en remplacer un autre dans un certain contexte.
</p>
<p>3 Reformulation de courts segments de texte par pivot
</p>
<p>3.1 Description g&#233;n&#233;rale de l&#8217;approche
</p>
<p>La traduction automatique statistique (Statistical Machine Translation (SMT)) est fond&#233;e sur
l&#8217;apprentissage et l&#8217;utilisation d&#8217;alignements entre mots appris sur des corpus parall&#232;les bi-
lingues. La SMT bas&#233;e sur des segments (Koehn et al., 2003) a &#233;tendu la notion d&#8217;alignements
entre segments de taille quelconque, ce qui permet une meilleure prise en compte du contexte
local, sans que ces segments n&#8217;aient &#224; correspondre &#224; une segmentation motiv&#233;e linguistique-
ment. Des techniques d&#8217;alignement permettent d&#8217;apprendre des probabilit&#233;s de traduction de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien Max
</p>
<p>FIG. 1 &#8211; Exemple de paraphrasage de segment par consultation de tables de traduction. Les
valeurs indiquent la probabilit&#233; conditionnelle du segment &#233;tant donn&#233; le segment &#224; sa gauche.
</p>
<p>segments. Par exemple, (Koehn et al., 2003) partent d&#8217;alignements 1 &#8594; N entre mots pour une
paire de langues dans les deux directions, sym&#233;trisent ces alignements en prenant leur intersec-
tion, puis construisent des alignements N &#8594; M entre mots de fa&#231;on incr&#233;mentale en ajoutant
des &#233;l&#233;ments de l&#8217;union des deux alignements initiaux. Pour qu&#8217;un alignement soit construit &#224;
partir des alignements existant &#224; une it&#233;ration pr&#233;c&#233;dente, tous les mots d&#8217;un segment source
doivent &#234;tre uniquement align&#233;s avec les mots d&#8217;un segment cible et inversement. &#192; partir de
l&#8217;ensemble des segments align&#233;s extraits d&#8217;un corpus parall&#232;le, les probabilit&#233;s de traduction
sont en g&#233;n&#233;ral estim&#233;es &#224; partir de fr&#233;quences relatives correspondant au rapport du nombre de
fois o&#249; un segment source s et un segment cible c sont align&#233;s sur le nombre d&#8217;occurrences du
segment source : P (c|s) = compte(c,s)
</p>
<p>compte(s)
.
</p>
<p>Des tables de traduction de segments sont cr&#233;&#233;es en utilisant notamment ces probabilit&#233;s entre
segments. (Bannard &amp; Callison-Burch, 2005) ont propos&#233; d&#8217;utiliser ce type de probabilit&#233;s &#224;
des fins de paraphrasage, en d&#233;finissant une probabilit&#233; de paraphrasage entre des segments
seg1 et seg2 qui utilise l&#8217;alignement qu&#8217;entretiennent ces deux segments avec un segment pivot
dans une autre langue, pivot :
</p>
<p>&#710;seg2 = arg max
seg2 6=seg1
</p>
<p>P (seg2|seg1) = arg max
seg2 6=seg1
</p>
<p>&#8721;
pivot
</p>
<p>P (seg2|pivot)P (pivot|seg1) (1)
</p>
<p>Dans l&#8217;&#233;quation 1, la recherche se fait en excluant le segment d&#8217;origine seg1 et en sommant sur
l&#8217;ensemble des pivots possibles pour une paire (seg1, seg2). L&#8217;exemple de la figure 1 illustre le
processus de construction de paraphrases d&#8217;un segment par pivot.
</p>
<p>Outre la probabilit&#233; de paraphrasage d&#233;crite ci-dessus, (Callison-Burch, 2007) a utilis&#233; diff&#233;-
rentes sources d&#8217;information pour mesurer l&#8217;importance de diff&#233;rents facteurs dans la qualit&#233;
des reformulations1 :
</p>
<p>&#8211; qualit&#233; des alignements entre segments : la construction manuelle d&#8217;un corpus dont les ali-
gnements sont faits par un humain permet une am&#233;lioration significative de la qualit&#233; des
paraphrases obtenues.
</p>
<p>&#8211; utilisation de plusieurs corpus align&#233;s : l&#8217;utilisation de plusieurs paires de langues pour ob-
tenir les paraphrases (les pivots sont donc multilingues) permet d&#8217;&#233;liminer partiellement les
d&#233;fauts d&#8217;alignements et d&#8217;obtenir une meilleure performance.
</p>
<p>&#8211; contr&#244;le du sens des segments : sans qu&#8217;il ne s&#8217;agisse de d&#233;sambigu&#239;sation s&#233;mantique des
</p>
<p>1Dans ses exp&#233;riences, Callison-Burch utilise 46 segments en anglais choisis al&#233;atoirement parmi des expres-
sions compos&#233;es de plusieurs mots de WordNet (ex : at work, concentrate on, big business), et 289 phrases qui les
contiennent. L&#8217;&#233;valuation est alors effectu&#233;e par deux juges qui doivent attribuer aux reformulations des scores de
conservation du sens (adequacy) et de caract&#232;re naturel (fluency).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision
</p>
<p>segments (qui peuvent avoir, comme les mots, plusieurs sens d&#233;pendant de leur contexte
d&#8217;apparition), paraphraser des segments appartenant &#224; des phrases align&#233;es avec des phrases
dans une autre langue permet de restreindre les traductions possibles du segment, et am&#233;liore
sensiblement les r&#233;sultats.
</p>
<p>&#8211; contr&#244;le de la vraisemblance des paraphrases produites : l&#8217;utilisation d&#8217;un mod&#232;le de langue
trigramme permet d&#8217;am&#233;liorer la grammaticalit&#233; des paraphrases produites, mais a un impact
n&#233;gatif sur la conservation du sens.
</p>
<p>Notre travail se base sur cette approche en proposant une int&#233;gration de diff&#233;rents mod&#232;les pour
aider &#224; la s&#233;lection des paraphrases. L&#8217;utilisation d&#8217;un corpus de paraphrases &#233;valu&#233;es par un
humain peut alors servir &#224; &#233;tudier la contribution de chacun des mod&#232;les, en particulier dans
une t&#226;che d&#8217;aide &#224; la reformulation. Le score d&#8217;une reformulation peut &#234;tre &#233;valu&#233; en utilisant
une combinaison lin&#233;aire de logarithmes correspondant &#224; des scores de mod&#232;les telle que tra-
ditionnellement utilis&#233;e en SMT2 (M repr&#233;sente les mod&#232;les utilis&#233;s, et &#955;m et hm repr&#233;sentent
respectivement le poids et la fonction de score d&#8217;un mod&#232;le) :
</p>
<p>&#710;seg2 = arg max
seg2
</p>
<p>P (seg2|seg1) = arg max
seg2
</p>
<p>&#8721;
m&#8712;M
</p>
<p>&#955;mhm(seg1, seg2) (2)
</p>
<p>3.2 Mod&#232;les pour la s&#233;lection des reformulations
</p>
<p>Nous pr&#233;sentons dans cette section les mod&#232;les que nous avons utilis&#233;s pour &#233;valuer les refor-
mulations.3
</p>
<p>Mod&#232;le pivot (PIV) Nous utilisons un score d&#233;riv&#233; de la probabilit&#233; de paraphrasage de (Ban-
nard &amp; Callison-Burch, 2005) en utilisant une seule langue pivot, qui nous servira de r&#233;f&#233;rence
(baseline) :
</p>
<p>Piv(p1, p2) = log(
&#8721;
pivot
</p>
<p>P (p2|pivot)P (pivot|p1)) (3)
</p>
<p>Mod&#232;le de conservation de d&#233;pendances (DEP) Ce mod&#232;le vise &#224; prendre en compte une cer-
taine proportion des relations de d&#233;pendance qui sont conserv&#233;es par la reformulation. Il prend
en compte les d&#233;pendances externes au segment avant et apr&#232;s reformulation (resp. Dextra1 et
Dextra2 ) sous la forme (d&#233;pendance, gouverneur, d&#233;pendant), ainsi que les d&#233;pendances entrant
ou sortant du segment avant et apr&#232;s reformulation (resp. Dinter1 et Dinter2 ) sous la forme (d&#233;-
pendance, cible_hors_segment) :
</p>
<p>Dep(p1, p2, context) = log
(1 + |Dextra1 &#8745; Dextra2 |+ |Dinter1 &#8745; Dinter2 |
</p>
<p>1 + |Dextra1 |+ |D
inter
1 |
</p>
<p>)
(4)
</p>
<p>2L&#8217;approche choisie pourrait sugg&#233;rer l&#8217;utilisation de syst&#232;mes de SMT complets pour le paraphrasage par
pivot d&#8217;&#233;nonc&#233;s entiers, mais les performances des syst&#232;mes actuels, qui butent notamment sur la prise en compte
du contexte source et sur la conservation du sens et de la grammaticalit&#233; en cible, rendent pour le moment cette
approche probl&#233;matique. (Quirk et al., 2004) attaquent eux ce probl&#232;me avec un syst&#232;me SMT appris avec des
alignements monolingues, ce qui constitue une voie de recherche int&#233;ressante.
</p>
<p>3Nous avons &#233;galement fait des exp&#233;riences avec des mod&#232;les bas&#233;s sur les cat&#233;gories morphosyntaxiques des
mots, comme par exemple mod&#233;lisant la probabilit&#233; de la suite de cat&#233;gories d&#8217;un segment &#233;tant donn&#233; son contexte
constitu&#233; des cat&#233;gories &#224; gauche et &#224; droite du segment, mais ces mod&#232;les n&#8217;ont permis d&#8217;am&#233;liorer les r&#233;sultats
que nous pr&#233;senterons en section 4.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien Max
</p>
<p>Le sch&#233;ma ci-dessous illustre les cas o&#249; deux d&#233;pendances entrante et sortante sont retrouv&#233;es
(reformulation A) et o&#249; une d&#233;pendance entrante n&#8217;est pas retrouv&#233;e (formulation B).
</p>
<p>Mod&#232;le de lemmes (LEM) Ce mod&#232;le mesure une certaine proportion de lemmes de mots
pleins communs au segment initial p1 et au segment apr&#232;s reformulation p2 (resp. L1 et L2) :
</p>
<p>Lem(p1, p2) = log
(1 + |L2| &#8722; |L1 &#8745; L2|
</p>
<p>1 + |L1 &#8746; L2|
</p>
<p>)
(5)
</p>
<p>4 Exp&#233;riences et &#233;valuation
</p>
<p>Les tables de traduction utilis&#233;es ont &#233;t&#233; apprises par la m&#233;thode d&#233;crite dans la section pr&#233;c&#233;-
dente sur les parties fran&#231;aise et anglaise du corpus Europarl4, qui comprend environ 1,2 million
de phrases align&#233;es. Les tables contiennent environ 42 millions de segments align&#233;s (d&#8217;une taille
maximale de 10 &#233;l&#233;ments (tokens)) avec des scores de traduction dans les deux directions. Nous
avons choisi de travailler avec le fran&#231;ais comme langue principale (et donc l&#8217;anglais comme
seule langue pivot pour le moment), ce qui rend plus manifeste le besoin d&#8217;utiliser des segments
rendant compte des d&#233;pendances ainsi que des accords entre mots qui en d&#233;coulent. Nous avons
utilis&#233; l&#8217;analyseur syntaxique robuste pour le fran&#231;ais SYNTEX (Bourigault et al., 2005) pour
obtenir une segmentation en unit&#233;s lexicales, la lemmatisation de ces unit&#233;s et une analyse en
d&#233;pendances. Outre les mod&#232;les d&#233;crits en section 3.2, nous avons utilis&#233; un mod&#232;le de langue
5-grammes (5GRAM) appris sur la partie fran&#231;aise du corpus avec un lissage Kneser-Ney.
Nous avons constitu&#233; manuellement un corpus de test de 82 phrases issues d&#8217;une partie du
corpus Europarl n&#8217;ayant pas servi &#224; l&#8217;apprentissage des mod&#232;les de traduction et du mod&#232;le de
langue. Pour chacune de ces phrases, un &#233;valuateur &#224; qui il &#233;tait demand&#233; de simuler la t&#226;che
d&#8217;un r&#233;dacteur en phase de r&#233;vision a choisi un segment d&#8217;int&#233;r&#234;t pour la reformulation, celui-ci
&#233;tant accept&#233; s&#8217;il appartenait &#224; la table de traduction fran&#231;ais &#8594; anglais (ex : dans de bonnes
conditions, maintenir le contact, attendent avec impatience, la plus &#233;troite, etc.).
Nous souhaitions disposer d&#8217;un corpus pouvant servir de r&#233;f&#233;rence pour diff&#233;rentes exp&#233;riences
impliquant plusieurs mod&#232;les. Ne disposant pas d&#8217;une m&#233;trique automatique acceptable pour
&#233;valuer la qualit&#233; des reformulations, et souhaitant ne pas avoir &#224; conduire plusieurs &#233;valuations
manuelles, nous avons construit automatiquement un premier ensemble de reformulations pour
chaque couple (phrase, segment &#224; paraphraser). Afin de limiter le travail d&#8217;&#233;valuation, nous
avons choisi de ne retenir au plus que les 20 premi&#232;res reformulations en utilisant PIV seul (ce
qui de fait introduit un biais dans nos exp&#233;riences, en restreignant l&#8217;ensemble des reformulations
consid&#233;r&#233;es). Pour chacune des 1648 phrases &#224; &#233;valuer, les juges avaient &#224; indiquer les scores
suivants sur une &#233;chelle de 1 &#224; 5 :
</p>
<p>&#8211; score de grammaticalit&#233; : indique si la paraphrase est grammaticalement correcte en l&#8217;&#233;tat
(5), n&#233;cessite diff&#233;rents niveaux de r&#233;vision (4 &#224; 2) ou est compl&#232;tement inexploitable (1).
4Version du corpus utilis&#233;e pour la t&#226;che WMT08 (http://www.statmt.org/wmt08).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision
</p>
<p>R&#233;sultat au premier rang R&#233;sultats au 8 premiers rangs
gram. sens r&#233;dact. moy. gram. sens r&#233;dact. moy.
</p>
<p>PIV (baseline) 4.46 4.18 3.62 4.09 11.66 10.60 9.10 10.45
5GRAM 4.28 3.62 3.45 3.78 11.52 9.72 9.20 10.15
</p>
<p>DEP 4.35 3.68 3.43 3.82 11.47 9.70 8.91 10.03
LEM 4.05 3.21 3.28 3.51 10.68 8.74 8.59 9.33
</p>
<p>PIV+5GRAM 4.65 4.06 3.82 4.18 11.95 10.30 9.58 10.61
PIV+DEP 4.58 4.27 3.66 4.17 11.85 10.68 9.38 10.64
PIV+LEM 4.37 4.00 3.76 4.05 11.53 10.14 9.56 10.41
</p>
<p>5GRAM+DEP 4.49 3.81 3.68 3.99 11.79 9.95 9.51 10.42
5GRAM+LEM 4.28 3.59 3.56 3.81 11.46 9.57 9.37 10.13
</p>
<p>PIV+5GRAM+DEP 4.65 4.05 3.92 4.21 12.04 10.35 9.71 10.70
PIV+5GRAM+LEM 4.61 4.02 3.97 4.20 11.86 10.11 9.74 10.57
</p>
<p>PIV+DEP+LEM 4.57 4.17 4.02 4.25 11.82 10.33 9.81 10.65
5GRAM+DEP+LEM 4.37 3.69 3.64 3.90 11.65 9.75 9.54 10.31
</p>
<p>PIV+5GRAM+DEP+LEM 4.68 4.09 4.05 4.27 12.01 10.24 9.87 10.71
</p>
<p>FIG. 2 &#8211; R&#233;sultats de l&#8217;&#233;valuation automatique sur les 82 phrases de notre corpus d&#8217;&#233;valuation
(les notes au premier rang sont entre 1 et 5, et entre 2.71 et 13.59 pour les 8 premiers rangs)
</p>
<p>&#8211; score de conservation du sens : indique si la paraphrase reprend exactement le sens de la
phrase d&#8217;origine (5), comporte diff&#233;rents niveaux d&#8217;ajout ou de retrait d&#8217;information (4 &#224; 2)
ou est d&#8217;un sens compl&#232;tement diff&#233;rent (1).
</p>
<p>&#8211; score d&#8217;int&#233;r&#234;t pour un r&#233;dacteur : indique si la paraphrase pourrait &#234;tre r&#233;utilis&#233;e en l&#8217;&#233;tat
pour une reformulation (5), avec une modification mineure (4), pr&#233;sente des &#233;l&#233;ments int&#233;-
ressants qui peuvent participer &#224; une reformulation (3), pr&#233;sente des &#233;l&#233;ments qui peuvent
sugg&#233;rer une reformulation (2) ou correspond &#224; du bruit (1).
</p>
<p>Les scores sont obtenus en prenant la moyenne des scores de deux juges francophones.5 Le ta-
bleau de la figure 2 pr&#233;sente les r&#233;sultats obtenus par diff&#233;rentes combinaisons de mod&#232;les pour
notre corpus d&#8217;&#233;valuation.6 Nous avons ici d&#233;cid&#233; d&#8217;utiliser des poids &#955;m uniformes pour la
combinaison des mod&#232;les, leur optimisation automatique en fonction de caract&#233;ristiques choi-
sies par un utilisateur faisant partie de nos travaux futurs. Le deuxi&#232;me groupe de colonnes
indique les moyennes des diff&#233;rents scores et leur moyenne pour la reformulation class&#233;e au
premier rang. Le troisi&#232;me groupe de colonnes donne un score combinant les scores des 8
meilleurs r&#233;sultats7, calcul&#233; comme suit :
</p>
<p>&#8721;8
rang=1
</p>
<p>1
rang
</p>
<p>score(rang).
</p>
<p>En ce qui concerne la grammaticalit&#233; des paraphrases, les mod&#232;les PIV et 5GRAM sont les
meilleurs contributeurs. La performance de PIV peut s&#8217;expliquer par la nature des alignements,
dont les plus forts peuvent correspondre &#224; des patrons morpho-syntaxiques coh&#233;rents. La contri-
bution d&#8217;un mod&#232;le de langue &#233;tait attendue, mais on constate que 5GRAM seul a une per-
formance l&#233;g&#232;rement inf&#233;rieure &#224; DEP. La combinaison PIV+5GRAM m&#232;ne cependant &#224; une
</p>
<p>5L&#8217;&#233;cart-type des diff&#233;rences de scores entre les deux juges est de 0.59 pour la grammaticalit&#233;, 0.7 pour la
conservation du sens, et 0.8 pour l&#8217;int&#233;r&#234;t pour un r&#233;dacteur, ce qui rend assez bien compte des diff&#233;rents niveaux
de subjectivit&#233; de ces scores.
</p>
<p>6Contrairement &#224; ce qui se passe en traduction statistique sur des phrases compl&#232;tes, la taille de notre espace de
recherche permet ici une exploration compl&#232;te, et l&#8217;on a donc la garantie de trouver le meilleur score global (parmi
les r&#233;sultats pr&#233;s&#233;lectionn&#233;s par PIV).
</p>
<p>7Ce type de mesure est motiv&#233; par la finalit&#233; de nos travaux, i.e. proposer un nombre raisonnable de suggestions
de reformulation &#224; un r&#233;dacteur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien Max
</p>
<p>meilleure performance que la combinaison PIV+DEP, ce qui semble indiquer que PIV et DEP
op&#232;rent des s&#233;lections plus similaires que PIV et LM. &#192; l&#8217;examen des donn&#233;es, il appara&#238;t qu&#8217;ob-
tenir des reformulations grammaticales requiert parfois des modifications en dehors du segment.
Il serait possible d&#8217;essayer d&#8217;&#233;tendre les segments automatiquement en cherchant &#224; obtenir des
reformulations de meilleure qualit&#233;, mais en conservant l&#8217;approche actuelle, on peut remarquer
qu&#8217;un crit&#232;re strict de grammaticalit&#233; n&#8217;est pas n&#233;cessairement le plus important pour le r&#233;dac-
teur.
</p>
<p>L&#8217;&#233;valuation au niveau de la conservation du sens fait ressortir qu&#8217;il est difficile de faire mieux
que la baseline PIV. Il s&#8217;agit cependant certainement l&#224; d&#8217;un biais imputable au corpus d&#8217;ap-
prentissage des tables de traduction (les d&#233;bats parlementaires europ&#233;ens), qui contient vraisem-
blablement peu d&#8217;ambigu&#239;t&#233;s s&#233;mantiques au niveau des segments dont les scores d&#8217;alignement
sont les plus forts. Si la combinaison avec d&#8217;autres mod&#232;les a plut&#244;t tendance &#224; d&#233;grader les
scores, car ils entra&#238;nent vraisemblablement une d&#233;formation du sens en pr&#233;f&#233;rant des &#233;nonc&#233;s
grammaticaux, le mod&#232;le DEP entra&#238;ne une am&#233;lioration lorsque combin&#233; avec PIV, alors que
seul il obtient une performance bien moindre. La conservation des relations de d&#233;pendances, et
en particulier du type de celles-ci pour les d&#233;pendances entrant ou sortant dans le segment para-
phras&#233;, participe certainement &#224; cela.8 La d&#233;gradation observ&#233;e avec PIV+5GRAM est coh&#233;rente
avec les r&#233;sultats obtenus par (Callison-Burch, 2007). Les scores observ&#233;s en utilisant le mo-
d&#232;le LEM semblent indiquer que les reformulations contenant plusieurs mots pleins diff&#233;rents
correspondent fr&#233;quemment &#224; des sens jug&#233;s diff&#233;rents.
Les meilleurs r&#233;sultats concernant l&#8217;int&#233;r&#234;t pour le r&#233;dacteur sont obtenus en combinant tous les
mod&#232;les. On constate qu&#8217;une mauvaise grammaticalit&#233; ou une mauvaise conservation du sens
ont tendance &#224; p&#233;naliser ce score, ce qui est coh&#233;rent avec les directives d&#8217;&#233;valuation. Le mod&#232;le
5GRAM se combine &#224; nouveau favorablement avec PIV, et toutes les combinaisons impliquant
PIV am&#233;liorent le score obtenu par ce mod&#232;le seul. Le mod&#232;le LEM permet d&#8217;am&#233;liorer les
r&#233;sultats, vraisemblablement parce qu&#8217;il permet de favoriser les reformulations les plus diff&#233;-
rentes du segment d&#8217;origine, qu&#8217;un r&#233;dacteur peut juger plus utiles qu&#8217;un segment tr&#232;s proche.
Il permet ainsi parfois de s&#233;lectionner des reformulations qui obtiennent par ailleurs de mauvais
scores en grammaticalit&#233; et/ou en conservation du sens, comme dans l&#8217;exemple suivant :
</p>
<p>Phrase d&#8217;origine : ceux qui viennent dire ici que l&#8217; europe ne doit pas adopter de directive
&#233;non&#231;ant les valeurs que nous voulons tous d&#233;fendre se trompent .
Reformulation : ceux qui viennent dire ici que l&#8217; europe ne doit pas adopter de directive &#233;non-
&#231;ant les valeurs que nous voulons tous d&#233;fendre devrions &#224; nouveau r&#233;fl&#233;chir .
L&#8217;&#233;valuation prenant en compte les 8 premiers r&#233;sultats ne fait pas ressortir de diff&#233;rences si-
gnificatives avec le r&#233;sultat au premier rang. Les exemples ci-dessous illustrent deux cas o&#249;
les premi&#232;res propositions du syst&#232;me en combinant tous les mod&#232;les obtiennent de tr&#232;s bons
scores :
</p>
<p>Phrase initiale : et , &#224; cet &#233;gard bien pr&#233;cis , je suis d&#8217; accord avec vous , monsieur le commis-
saire
</p>
<p>Reformulations : je partage votre point de vue, je pense comme vous, je partage votre avis, je
vous rejoins
</p>
<p>8Ce type de mod&#232;le d&#233;pend cependant tr&#232;s fortement de la robustesse de l&#8217;analyseur syntaxique utilis&#233; pour
analyser des &#233;nonc&#233;s plus ou moins corrects.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision
</p>
<p>Phrase initiale : notre voisin s&#8217; est efforc&#233; r&#233;solument pendant la d&#233;cennie &#233;coul&#233;e de remplir les
crit&#232;res de l&#8217; adh&#233;sion .
</p>
<p>Reformulations : satisfaire aux exigences, satisfaire aux conditions, r&#233;pondre aux exigences,
respecter les exigences, r&#233;pondre aux crit&#232;res, remplir les conditions, satisfaire aux crit&#232;res
</p>
<p>5 Conclusions et perspectives
</p>
<p>Dans cet article, nous avons d&#233;crit une approche inspir&#233;e de (Bannard &amp; Callison-Burch, 2005)
pour produire des reformulations locales en utilisant des tables de traduction de segments et
en combinant les scores de diff&#233;rents mod&#232;les. Nos &#233;valuations, bas&#233;es sur trois crit&#232;res dont
un concernant directement l&#8217;int&#233;r&#234;t des reformulations propos&#233;es pour le r&#233;dacteur, ont plus
particuli&#232;rement permis de d&#233;gager la contribution de notre mod&#232;le bas&#233; sur la conservation des
relations de d&#233;pendance entre un &#233;nonc&#233; et ses reformulations. Cependant, l&#8217;approche propos&#233;e
comporte de nombreuses limitations, que nous nous efforcerons de corriger dans nos travaux
ult&#233;rieurs.
</p>
<p>La principale source d&#8217;am&#233;lioration selon nous consiste &#224; mieux prendre en compte le contexte
du segment &#224; paraphraser dans la phrase source. Alors que (Callison-Burch, 2007) a montr&#233;
l&#8217;importance de la prise en compte du contexte pour la g&#233;n&#233;ration de paraphrases, ses exp&#233;-
riences se sont bas&#233;es sur un choix de pivot issu directement d&#8217;un corpus parall&#232;le bilingue, ce
qui revient &#224; faire une d&#233;sambigu&#239;sation supervis&#233;e. Des travaux r&#233;cents en traduction statis-
tique tels que (Stroppa et al., 2007) ont montr&#233; la possibilit&#233; d&#8217;int&#233;grer dans des syst&#232;mes bas&#233;s
sur des segments des mod&#232;les permettant d&#8217;am&#233;liorer la s&#233;lection des segments cibles.9 Nous
travaillons par ailleurs sur ces aspects dans le cadre d&#8217;un syst&#232;me de traduction statistique bas&#233;
sur des segments, et esp&#233;rons que les r&#233;sultats b&#233;n&#233;ficieront au travail pr&#233;sent&#233; ici.
</p>
<p>Nous allons par ailleurs poursuivre l&#8217;analyse de nos donn&#233;es pour proposer de nouveaux mo-
d&#232;les, permettant par exemple de regrouper des sens dans les segments. Dans le cadre d&#8217;une
int&#233;gration dans un syst&#232;me d&#8217;aide &#224; la reformulation, nous serons int&#233;ress&#233; par la possibilit&#233; de
corriger les paraphrases produites, pour respecter par exemple des contraintes d&#8217;accords gram-
maticaux. Il nous semble &#233;galement int&#233;ressant de travailler sur le probl&#232;me du rep&#233;rage des
segments qui seraient de bons candidats &#224; la reformulation (gallicismes en anglais, phras&#233;olo-
gie mal adapt&#233;e &#224; un genre documentaire, etc.). En outre, nous aurons &#224; consid&#233;rer l&#8217;int&#233;gration
de segments align&#233;s provenant de corpus comparables, qui sont des ressources beaucoup plus
faciles &#224; construire que les corpus align&#233;s. Enfin, ce type de recherche devrait tendre vers plus
de g&#233;n&#233;ralisation dans le processus de reformulation, et la possibilit&#233; de produire des para-
phrases plus profondes au niveau d&#8217;&#233;nonc&#233;s, voire de discours. Un type d&#8217;application particu-
li&#232;rement int&#233;ressant serait alors l&#8217;aide &#224; la condensation d&#8217;articles scientifiques pour tenir dans
des contraintes de taille impos&#233;es.
</p>
<p>Remerciements L&#8217;auteur remercie Daniel D&#233;chelotte pour la pr&#233;paration de certaines donn&#233;es
utilis&#233;es dans ce travail, et Didier Bourigault pour l&#8217;utilisation de SYNTEX.
</p>
<p>9Il est possible cependant que la nature des corpus utilis&#233;s ne permette pas d&#8217;am&#233;lioration tr&#232;s sensible des
r&#233;sultats, car le besoin de d&#233;sambigu&#239;sation est peut-&#234;tre assez faible dans l&#8217;ensemble.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Aur&#233;lien Max
</p>
<p>R&#233;f&#233;rences
BANNARD C. &amp; CALLISON-BURCH C. (2005). Paraphrasing with bilingual parallel corpora.
In Proceedings of ACL, Ann Arbor, USA.
BARZILAY R. &amp; LEE L. (2003). Learning to paraphrase : an unsupervised approach using
multiple-sequence alignment. In Proceedings of NAACL/HLT, Edmonton, Canada.
BOURIGAULT D., FABRE C., FR&#201;ROT C., JACQUES M.-P. &amp; OZDOWSKA S. (2005). Syntex,
analyseur syntaxique de corpus. In Actes de TALN, Dourdan, France.
CALLISON-BURCH C. (2007). Paraphrasing and Translation. PhD thesis, University of
Edinburgh.
CONNOR M. &amp; ROTH D. (2007). Context sensitive paraphrasing with a single unsupervised
classifier. In Proceedings of ECML, Warsaw, Poland.
DUCLAYE F., COLLIN O. &amp; YVON F. (2003). Apprentissage automatique de paraphrases
pour l&#8217;am&#233;lioration d&#8217;un syst&#232;me de questions-r&#233;ponses. In Actes de TALN, Batz-sur-mer,
France.
FERRET O. &amp; ZOCK M. (2006). Enhancing electronic dictionaries with an index based on
associations. In Proceedings of COLING/ACL, Sydney, Australia.
FUCHS C. (1994). Paraphrase et &#233;nonciation. Ophrys, Paris.
KAUCHAK D. &amp; BARZILAY R. (2006). Paraphrasing for automatic evaluation. In Proceedings
of NAACL/HLT, New York, USA.
KOEHN P., OCH F. J., &amp; MARCU D. (2003). Statistical phrase-based translation. In Procee-
dings of NAACL/HLT, Edmonton, Canada.
LANDKILDE I. &amp; KNIGHT K. (1998). Generation that exploits corpus-based statistical know-
ledge. In Proceedings of COLING/ACL, Montr&#233;al, Canada.
LIN C.-Y. (2004). Rouge : a package for automatic evaluation of summaries. In Proceedings
of the Workshop on Text Summarization Branches Out (WAS 2004), Barcelona, Spain.
PANG B., KNIGHT K. &amp; MARCU D. (2003). Syntax-based alignment of multiple transla-
tions : Extracting paraphrases and generating new sentences. In Proceedings of NAACL/HLT,
Edmonton, Canada.
PAPINENI K., ROUKOS S., WARD T. &amp; ZHU W.-J. (2002). Bleu : a method for automatic
evaluation of machine translation. In Proceedings of ACL, Philadelphia, USA.
QUIRK C., BROCKETT C. &amp; DOLAN W. B. (2004). Monolingual machine translation for
paraphrase generation. In Proceedings of EMNLP, Barcelona, Spain.
STROPPA N., VAN DEN BOSCH A. &amp; WAY A. (2007). Exploiting source similarity for smt
using context-informed features. In Proceedings of TMI, Sk&#246;vde, Sweden.
ZHOU L., LIN C.-Y., MUNTEANU D. S. &amp; HOVY E. (2006). Paraeval : Using paraphrases
to evaluate summaries automatically. In Proceedings of NAACL/HLT, New York, USA.</p>

</div></div>
</body></html>