<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La polys&#233;mie r&#233;guli&#232;re dans WordNet</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p>La polys&#233;mie r&#233;guli&#232;re dans WordNet  
</p>
<p> 
</p>
<p> Lucie Barque (1), Fran&#231;ois-R&#233;gis Chaumartin (2,3) 
</p>
<p> 
</p>
<p>(1)  Lattice &#340; Universit&#233; Paris 7, UFRL, Case 7003, 75251 Paris cedex 5 
lucie.barque@linguist.jussieu.fr 
</p>
<p>(2)  Proxem &#340; 7 impasse Dumur, 92110 Clichy 
frc@proxem.com 
</p>
<p>(3)  Alpage &#340; Universit&#233; Paris 7, UFRL, Case 7003, 75251 Paris cedex 5 
fchaumartin@linguist.jussieu.fr 
</p>
<p>R&#233;sum&#233; Cette &#233;tude propose une analyse et une mod&#233;lisation des relations de polys&#233;mie 
dans le lexique &#233;lectronique anglais WordNet. Elle exploite pour cela la hi&#233;rarchie des 
</p>
<p>concepts (repr&#233;sent&#233;s par des synsets), et la d&#233;finition associ&#233;e &#224; chacun de ces concepts. Le 
</p>
<p>r&#233;sultat est constitu&#233; d'un ensemble de r&#232;gles qui nous ont permis d'identifier d&#8217;une fa&#231;on 
largement automatis&#233;e, avec une pr&#233;cision voisine de 91%, plus de 2100 paires de synsets li&#233;s 
</p>
<p>par une relation de polys&#233;mie r&#233;guli&#232;re. Notre m&#233;thode permet aussi une d&#233;sambigu&#239;sation 
</p>
<p>lexicale partielle des mots de la d&#233;finition associ&#233;e &#224; ces synsets. 
</p>
<p>Abstract This paper presents an analysis and modeling of polysemy in the WordNet 
English lexical database. It exploits the concepts hierarchy (constituted by synsets), and the 
</p>
<p>gloss defining each of these concepts. The result consists of rules set which enabled us to 
</p>
<p>identify in a largely automated way, with a precision close to 91%, more than 2100 synsets 
</p>
<p>pairs, connected by a regular polysemy relation. Our method also allows a partial word sense 
</p>
<p>disambiguation of the definition associated with these synsets. 
</p>
<p>Mots-cl&#233;s : polys&#233;mie r&#233;guli&#232;re, m&#233;taphore, m&#233;tonymie, WordNet, d&#233;sambigu&#239;sation 
lexicale 
Keywords: regular polysemy, metaphor, metonymy, WordNet, word sense 
disambiguation  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Barque et F. R. Chaumartin 
</p>
<p>1 Introduction 
</p>
<p>WordNet a d&#233;j&#224; &#233;t&#233; exploit&#233;e en vue d'une caract&#233;risation de la polys&#233;mie (Peters, 2006 ; 
</p>
<p>Veale, 2006). Dans cette lign&#233;e, notre &#233;tude propose une d&#233;marche pour cr&#233;er des patrons de 
</p>
<p>polys&#233;mie r&#233;guli&#232;re, puis pour d&#233;tecter automatiquement leurs occurrences dans ce lexique. 
</p>
<p>WordNet est construit sous la forme d'une hi&#233;rarchie de synsets (ensemble de lexies 
</p>
<p>synonymes entre elles) ; ces concepts sont li&#233;s entre eux par diff&#233;rents types de relations 
</p>
<p>s&#233;mantiques (hyp&#233;ronymie, m&#233;ronymie, antonymie, etc.). Chaque synset est &#233;galement associ&#233; 
</p>
<p>&#224; une d&#233;finition lexicographique (Fellbaum, 1998), comme l&#8217;illustre l'exemple suivant (o&#249; 
nous notons lexie#i la i
</p>
<p>&#232;me
 lexie d&#8217;un vocable dans WordNet.): 
</p>
<p>&#61623; {treachery#2, betrayal#1, treason#3, perfidy#2} = an act of deliberate betrayal 
</p>
<p>Comme on peut le remarquer dans cet exemple, un des &#233;l&#233;ments du synset se retrouve dans sa 
</p>
<p>d&#233;finition (betrayal#1, betrayal). En fait il ne s&#8217;agit pas, &#224; proprement parler, du m&#234;me 
&#233;l&#233;ment. Dans la suite de notre article, nous distinguerons syst&#233;matiquement les notions de 
</p>
<p>lexie (unit&#233; lexicale, association d&#8217;un signifiant et d&#8217;un signifi&#233;) et de vocable (unit&#233; 
polys&#233;mique regroupant diff&#233;rentes lexies de m&#234;me signifiant). Nous dirons donc que la lexie 
</p>
<p>betrayal#1 contient dans sa d&#233;finition une autre lexie du vocable BETRAYAL, mais on ignore 
</p>
<p>laquelle avant d&#8217;avoir d&#233;sambigu&#239;s&#233; les &#233;l&#233;ments de la d&#233;finition.   
</p>
<p>Notre article se constitue de trois sections. La premi&#232;re dresse un rapide &#233;tat des lieux des 
</p>
<p>recherches d&#233;di&#233;es &#224; la description de la polys&#233;mie r&#233;guli&#232;re. La deuxi&#232;me section pr&#233;sente les 
</p>
<p>objectifs de cette &#233;tude et les moyens mis en &#339;uvre pour y parvenir ; nous y proposerons 
notamment une m&#233;thode de construction des patrons de polys&#233;mie &#171; assist&#233;e par ordinateur &#187;. 
</p>
<p>Nous pr&#233;senterons enfin les r&#233;sultats obtenus, sous forme d'une classification de ces patrons, 
</p>
<p>et d&#8217;une mesure de leur r&#233;gularit&#233; dans la version la plus r&#233;cente de WordNet1. 
</p>
<p>2 Etat de l'art 
</p>
<p>2.1 Description de la polys&#233;mie r&#233;guli&#232;re  
</p>
<p>L'int&#233;r&#234;t d&#8217;expliciter la polys&#233;mie r&#233;guli&#232;re lors du d&#233;veloppement d'un lexique a souvent &#233;t&#233; 
mis en &#233;vidence, notamment dans le cadre du TAL. Qu'elle soit repr&#233;sent&#233;e sous forme de 
</p>
<p>r&#232;gles lexicales (Ostler et Atkins, 1991; Copestake et Briscoe, 1995) ou de m&#233;canismes 
</p>
<p>transformationnels agissant lors de la composition de mots en syntagmes (Pustejovsky, 1995), 
</p>
<p>la description de la polys&#233;mie r&#233;guli&#232;re pr&#233;sente au moins deux avantages. 
</p>
<p>D&#8217;un point de vue th&#233;orique tout d&#8217;abord, il s&#8217;agit d'offrir une repr&#233;sentation de l&#8217;un des 
aspects de la formation du lexique, la polys&#233;mie r&#233;guli&#232;re constituant une source importante 
</p>
<p>de cr&#233;ativit&#233; lexicale. Par exemple, en disposant d'une r&#232;gle de polys&#233;mie r&#233;guli&#232;re entre une 
</p>
<p>unit&#233; de type animal et une unit&#233; de type individu ayant une fonction, (alternance 
</p>
<p>qui s'applique par exemple aux vocables GORILLE, LIEVRE, TAUPE, etc.) le lexique dispose 
</p>
<p>potentiellement d'entr&#233;es de type individu ayant une fonction d&#233;riv&#233;es &#224; partir 
</p>
<p>d'entr&#233;e existantes de type animal. L'unit&#233; de type individu ayant une fonction 
</p>
<p>                                                 
1
 WordNet 3.0 compte 117 659 synsets et 206 941 lexies.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La polys&#233;mie r&#233;guli&#232;re dans WordNet 
</p>
<p>pour le vocable MULE (individu charg&#233; de transporter de la drogue) n'est, par exemple, pas 
</p>
<p>(encore) r&#233;f&#233;renc&#233;e dans les dictionnaires. Autrement dit, les r&#232;gles de polys&#233;mie constituent 
</p>
<p>l'un des moyens de rendre compte de l'aspect dynamique du lexique. 
</p>
<p>Le second avantage, d'ordre pratique, concerne la valorisation du lexique &#224; partir duquel 
</p>
<p>s&#8217;effectue l&#8217;&#233;tude de la polys&#233;mie r&#233;guli&#232;re, en l&#8217;occurrence WordNet. Les r&#232;gles lexicales de 
polys&#233;mie r&#233;guli&#232;re permettent en effet de syst&#233;matiser l&#8217;encodage des donn&#233;es en fournissant 
au lexicographe un canevas d&#233;finitionnel. Par exemple, le sch&#233;ma de d&#233;finition indiqu&#233; en 
</p>
<p>gras dans l&#8217;exemple ci-dessous pourra servir &#224; la d&#233;finition d&#8217;autres paires de lexies de type 
pi&#232;ce de vaisselle ~ quantit&#233; (de qqch.) li&#233;es par une m&#233;tonymie r&#233;guli&#232;re. 
</p>
<p>&#61623; L2 = quantit&#233; de X contenue dans L1 
</p>
<p>&#61623; assiette#2 de X = quantit&#233; de X contenue dans une assiette#1 
</p>
<p>&#61623; bol#2 de X = quantit&#233; de X contenue dans un bol#1 
</p>
<p>2.2 D&#233;finition de la polys&#233;mie r&#233;guli&#232;re 
</p>
<p>Selon Apresjan (1974), une polys&#233;mie est r&#233;guli&#232;re s'il existe au moins deux vocables (A et B) 
</p>
<p>ayant chacun deux lexies (A#1~A#2 et B#1~B#2) li&#233;es par la m&#234;me relation s&#233;mantique. Les 
</p>
<p>lexies A#1 et B#1 ne doivent pas &#234;tre synonymes, pas plus que les lexies A#2 et B#2. 
</p>
<p>Illustrons cette notion de polys&#233;mie r&#233;guli&#232;re avec des donn&#233;es extraites de WordNet : 
</p>
<p>&#61623; {cerise#1, cherry#4, cherry red#1} = the red color of cherries  
</p>
<p>&#61623; {chestnut#4} = the brown color of chestnuts 
</p>
<p>Les vocables CHERRY et CHESTNUT pr&#233;sentent la m&#234;me alternance s&#233;mantique entre un 
</p>
<p>fruit et une couleur (respectivement le rouge des cerises et le marron des ch&#226;taignes). 
</p>
<p>On peut donc d'ores et d&#233;j&#224; dire que ce lien est r&#233;gulier et chercher d'autres occurrences dans 
</p>
<p>WordNet, afin de d&#233;terminer son degr&#233; de r&#233;gularit&#233; (Barque, 2008). Bien entendu, ce dernier 
</p>
<p>d&#233;pendra du degr&#233; de sp&#233;cificit&#233; de la caract&#233;risation s&#233;mantique du lien. Par exemple, le lien 
</p>
<p>entre un fruit et une couleur sera associ&#233; &#224; moins d'occurrences que le lien entre une 
</p>
<p>entit&#233; et une couleur, le type entit&#233; &#233;tant plus g&#233;n&#233;ral que le type fruit.  
</p>
<p>Une chose est de d&#233;terminer le degr&#233; de r&#233;gularit&#233; d'un lien de polys&#233;mie, une autre de 
</p>
<p>d&#233;terminer &#224; quelle cat&#233;gorie il appartient. Nous distinguons, pour la suite de notre &#233;tude, trois 
</p>
<p>grandes cat&#233;gories de liens de polys&#233;mie r&#233;guli&#232;re (Fass, 1988) : 
</p>
<p>1. La sp&#233;cialisation : une lexie L2 est une sp&#233;cialisation d'une lexie L1 si son sens est 
plus sp&#233;cifique que celui de L1. Ci-dessous, on peut voir que la lexie pressure#7 
</p>
<p>d&#233;note un cas particulier de ce &#224; quoi renvoie &#171; pressure &#187; dans la d&#233;finition.  
</p>
<p>&#61623; {pressure#7} = the pressure exerted by the atmosphere 
</p>
<p>2. La m&#233;taphore : deux lexies L1 et L2 sont li&#233;es par m&#233;taphore si le r&#233;f&#233;rent de L1 et 
celui de L2 sont en relation d'analogie, autrement dit s&#8217;ils se ressemblent sur au moins 
un de leurs aspects. Par exemple, le rire d&#233;not&#233; par la lexie cackle#3 ressemble, du 
</p>
<p>point de vue du son, au gloussement de la poule (&#8220;hen&#8217;s cackle&#8221;). 
</p>
<p>&#61623; {cackle#3} = a loud laugh suggestive of a hen&#8217;s cackle  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Barque et F. R. Chaumartin 
</p>
<p>3. La m&#233;tonymie : deux lexies L1 et L2 sont li&#233;es par m&#233;tonymie si le r&#233;f&#233;rent de L1 et 
celui de L2 sont en relation de contigu&#239;t&#233;, autrement dit si les deux r&#233;f&#233;rents &#171; se 
</p>
<p>touchent &#187;, de fa&#231;on plus ou moins concr&#232;te. Par exemple, le lien entre les deux sens 
</p>
<p>de CHESNUT, d&#233;j&#224; &#233;voqu&#233; plus haut, rel&#232;ve de la m&#233;tonymie puisque la couleur d&#233;not&#233;e 
</p>
<p>par la lexie chesnut#4 est celle du fruit d&#233;not&#233; par &#8220;chesnuts&#8221; dans la d&#233;finition. 
</p>
<p>&#61623; {chesnut#4} = the brown color of chestnuts 
</p>
<p>3 Objectif et m&#233;thode 
</p>
<p>L'objectif principal de notre &#233;tude est de d&#233;crire les liens de polys&#233;mie r&#233;guliers de WordNet 
</p>
<p>et de mesurer leur r&#233;gularit&#233; en d&#233;tectant automatiquement leurs occurrences dans la base 
</p>
<p>lexicale. L'un des enrichissements possibles du lexique sera ainsi la cr&#233;ation de nouvelles 
</p>
<p>relations s&#233;mantiques, en l'occurrence des relations de m&#233;taphore et de m&#233;tonymie
2
. 
</p>
<p>3.1 Description des r&#232;gles 
</p>
<p>Notre objectif &#233;tant de rendre compte de la polys&#233;mie r&#233;guli&#232;re repr&#233;sent&#233;e dans 
</p>
<p>WordNet, nous avons pris le parti de nous int&#233;resser, dans un premier temps, aux seuls synsets 
</p>
<p>dont la d&#233;finition contient une lexie (L1) appartenant au m&#234;me vocable que l&#8217;une des lexies du 
synset d&#233;fini (L2) ; ce parti pris repose sur l'id&#233;e commun&#233;ment admise qu&#8217;un lien de sens 
entre deux lexies de m&#234;me forme est d'autant plus &#233;vident que l'une est d&#233;finie au moyen de 
</p>
<p>l'autre : {&#8230;, L2, &#8230;} = &#8230; L1 &#8230; En voici deux exemples : 
</p>
<p>&#61623; {driver#3} = a golfer who hits the golf ball with a driver 
</p>
<p>&#61623; {falsify#4} = falsify knowingly 
</p>
<p>Dans le premier exemple, la lexie driver#3 est d&#233;finie au moyen d'une autre lexie du vocable 
</p>
<p>DRIVER. On rappellera qu&#8217;&#224; ce stade, cette derni&#232;re n'est pas identifi&#233;e, les &#233;l&#233;ments utilis&#233;s 
dans les d&#233;finitions de WordNet n&#8217;&#233;tant pas d&#233;sambigu&#239;s&#233;s3. Sur le plan informatique, nous 
avons proc&#233;d&#233; &#224; l&#8217;&#233;tiquetage morphosyntaxique des d&#233;finitions de tous les synsets4 pour les 
filtrer et retenir un premier ensemble de 1984 synsets o&#249; L1 et L2 appartiennent &#224; la m&#234;me 
</p>
<p>partie du discours
5
. 
</p>
<p>                                                 
2
 Dans WordNet, les relations de sp&#233;cialisation sont d&#233;j&#224; pr&#233;sentes pour les noms et verbes. Par exemple, 
</p>
<p>pressure#7 a explicitement pour hyperonyme pressure#1. 
</p>
<p>3
 Notons l&#8217;existence du projet eXtended WordNet, men&#233; en 2003 &#224; l&#8217;Universit&#233; de Dallas. Ce projet enrichit 
</p>
<p>WordNet 2.0 avec une repr&#233;sentation logique et une analyse syntaxique de la d&#233;finition de chaque synset. 
Apr&#232;s l&#8217;analyse syntaxique, les mots d&#8217;une d&#233;finition font l&#8217;objet d&#8217;une d&#233;sambigu&#239;sation lexicale, avec une 
qualit&#233; gold, silver ou bronze (gold indiquant une validation manuelle). Or, pour un nombre total de 
1 127 695 mots utilis&#233;s dans les d&#233;finitions, seuls 14 657 mots sont de qualit&#233; gold (1,3%). Ce ratio nous 
semblant faible, nous n&#8217;avons pas utilis&#233; cette ressource dans le cadre de notre &#233;tude. 
</p>
<p>4
 Nous avons utilis&#233; pour cela la plateforme de traitement linguistique Antelope (www.proxem.com). 
</p>
<p>5
 En toute rigueur, nous avons impos&#233; des contraintes suppl&#233;mentaires. Nous avons &#233;limin&#233; les synsets o&#249; L1 
</p>
<p>d&#233;signe en fait L2. Cela correspond aux cas o&#249; la d&#233;finition contient &#8220;equal&#8221; (comme dans {kopek, kopeck, 
copeck} = 100 kopecks equal 1 ruble in Russia),  &#8220;trademark&#8221; ou &#8220;trade name&#8221; (L1 et L2 repr&#233;sentent alors 
un nom commercial, par exemple {sildenafil, sildenafil citrate, Viagra} = virility drug, trade name Viagra), et 
&#8220;capital of&#8221; (comme dans {Bern, Berne, capital of Switzerland} = the capital of Switzerland).  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La polys&#233;mie r&#233;guli&#232;re dans WordNet 
</p>
<p>La m&#233;thode adopt&#233;e pour attribuer &#224; une occurrence L1~L2 une cat&#233;gorie de liens de 
</p>
<p>polys&#233;mie repose sur diff&#233;rents crit&#232;res formels appliqu&#233;s aux d&#233;finitions de WordNet 
</p>
<p>(Martin, 1972 ; Fass, 1988). Nous avons regard&#233;, tout d'abord, si l'inclusion de L1 figurait 
</p>
<p>dans la premi&#232;re partie de la d&#233;finition de L2 (i.e. en tant que genre prochain) ou bien dans sa 
</p>
<p>seconde partie (i.e. en tant que diff&#233;rence sp&#233;cifique), comme illustr&#233; ci-dessous : 
</p>
<p>&#61623; {behave#3} = behave well or properly 
</p>
<p>&#61623; {sweep#6} = clean by sweeping 
</p>
<p>Dans le premier exemple, L1 appara&#238;t dans la premi&#232;re partie de la d&#233;finition de L2 : le 
</p>
<p>troisi&#232;me sens du vocable TO BEHAVE est d&#233;fini au moyen d'un autre sens du m&#234;me vocable, 
</p>
<p>qui en constitue le genre prochain (&#171; se comporter &#187; signifie, dans un de ses sens, &#171; se 
</p>
<p>comporter d'une certaine mani&#232;re &#187;, en l'occurrence d'une mani&#232;re appropri&#233;e). Dans le 
</p>
<p>second exemple, L1 appara&#238;t dans la seconde partie de la d&#233;finition de L2 : le sixi&#232;me sens du 
</p>
<p>verbe TO SWEEP ne veut pas dire &#171; balayer d'une certaine mani&#232;re &#187; mais &#171; faire quelque 
</p>
<p>chose en balayant &#187;, en l'occurrence nettoyer en balayant. 
</p>
<p>Outre la place de l'inclusion de L1 dans la d&#233;finition de L2, nous retenons des sous-cha&#238;nes 
</p>
<p>r&#233;currentes dans les d&#233;finitions. Voici trois exemples d'inclusion dans la seconde partie de la 
</p>
<p>d&#233;finition, distingu&#233;s selon certains &#233;l&#233;ments pertinents de leur d&#233;finition : 
</p>
<p>&#61623; {mint#5} = a candy that is flavored with a mint oil &#61664; &#8220;that is flavored with L1&#8221; 
</p>
<p>&#61623; {bluefish#2} = fatty bluish flesh of bluefish &#61664; &#8220;flesh of L1&#8221; 
</p>
<p>&#61623; {fin#5} = a stabilizer on a ship that resembles the fin of a fish &#61664; &#8220;that resembles L1&#8221; 
</p>
<p>On peut ainsi, en m&#234;lant ces deux crit&#232;res (la place de l'inclusion et les &#233;l&#233;ments d&#233;finitionnels 
</p>
<p>qui entourent cette inclusion), attribuer de mani&#232;re automatique une cat&#233;gorie de lien de 
</p>
<p>polys&#233;mie &#224; une occurrence donn&#233;e. De mani&#232;re informelle, disons que si l'inclusion a lieu 
</p>
<p>dans la premi&#232;re partie de la d&#233;finition, il s'agit soit d'une sp&#233;cialisation, soit d'une m&#233;taphore. 
</p>
<p>Les deux exemples ci-dessous montrent en effet deux cas d&#8217;inclusion de L1 dans la premi&#232;re 
partie de la d&#233;finition ; mais le premier exemple rel&#232;ve de la sp&#233;cialisation, tandis que le 
</p>
<p>second rel&#232;ve de la m&#233;taphore.  
</p>
<p>&#61623; {arrange#5} = arrange attractively  
</p>
<p>&#61623; {grow#9} = grow emotionally  
</p>
<p>Si l&#8217;inclusion a lieu dans la seconde partie de la d&#233;finition, il s'agit soit d'une m&#233;tonymie, soit 
d'une m&#233;taphore, selon le type d'&#233;l&#233;ment qui introduit l'inclusion. Parmi les trois exemples 
</p>
<p>d&#233;j&#224; pr&#233;sent&#233;s plus haut, les deux premiers ({mint#5} et {bluefish#2}) sont des cas de 
</p>
<p>m&#233;tonymie, le troisi&#232;me ({fin#5}) est un cas de m&#233;taphore. Ici, l&#8217;ambigu&#239;t&#233; sur la cat&#233;gorie 
d&#8217;appartenance d&#8217;un lien donn&#233; peut &#234;tre lev&#233;e gr&#226;ce aux canevas d&#233;finitionnels. Par exemple, 
si l&#8217;inclusion est pr&#233;c&#233;d&#233;e de la s&#233;quence &#8220;that resembles&#8221; comme c&#8217;est le cas pour le vocable 
FIN (nageoire) ci-dessus, on sait qu&#8217;il s&#8217;agit d&#8217;un cas de m&#233;taphore et non de m&#233;tonymie. 
</p>
<p>3.2 Recherche d'occurrences 
</p>
<p>Notre m&#233;thode de d&#233;tection des liens de polys&#233;mie r&#233;guli&#232;re s&#8217;applique, dans un premier 
temps, &#224; l&#8217;ensemble des 1984 synsets dont la d&#233;finition inclut un synset de m&#234;me forme. Nous </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Barque et F. R. Chaumartin 
</p>
<p>avons cr&#233;&#233; manuellement une soixantaine de patrons, en analysant des d&#233;finitions de ces 
</p>
<p>synsets qui correspondaient manifestement &#224; un cas de polys&#233;mie r&#233;guli&#232;re. 
</p>
<p>L&#8217;application de ces patrons a permis d&#8217;obtenir un premier classement de 1427 synsets6. Nous 
allons d&#233;tailler ce processus en montrant notamment comment il permet de d&#233;sambigu&#239;ser L1. 
</p>
<p>Nous verrons ensuite comment cette m&#233;thode peut se g&#233;n&#233;raliser aux autres synsets ne 
</p>
<p>pr&#233;sentant pas la particularit&#233; d&#8217;inclure un synset de m&#234;me forme dans leur d&#233;finition. 
</p>
<p>3.2.1 D&#233;finition de patrons de polys&#233;mie r&#233;guli&#232;re 
</p>
<p>Voici quelques lignes de code
7
 d&#233;finissant un patron appel&#233; colorOf (&#171; couleur de &#187;) : 
</p>
<p> patterns.Add(new Pattern(&quot;colorOf&quot;) 
       .AddType(&quot;color&quot;, &quot;fruit&quot;)  
</p>
<p>       .AddType(&quot;color&quot;, &quot;gem&quot;)  
</p>
<p>       .AddType(&quot;color&quot;, &quot;metal&quot;) 
</p>
<p>       .AddMatchingRule(&quot;color of *&quot;)); 
</p>
<p>La premi&#232;re ligne de code d&#233;finit le patron de polys&#233;mie. Les trois lignes suivantes indiquent 
</p>
<p>que les paires de lexies susceptibles d'instancier ce patron sont de type color pour L2 et 
</p>
<p>fruit, gem ou metal pour L1. Enfin, la derni&#232;re ligne indique que la d&#233;finition de L2 doit, 
</p>
<p>pour &#234;tre d&#233;clar&#233;e occurrence du patron, contenir la cha&#238;ne de caract&#232;res &#8220;color of&#8221; suivie de 
L1 (indicateur * &#224; droite)
</p>
<p>8
. 
</p>
<p>Consid&#233;rons un autre des quelques soixante patrons de polys&#233;mie produits par notre &#233;tude : 
</p>
<p>    patterns.Add(new Pattern(&quot;causedBy&quot;) 
</p>
<p>      .AddMatchingRule(&quot;resulting from *&quot;) 
</p>
<p>      .AddMatchingRule(&quot;caused by *&quot;)); 
</p>
<p>Ce patron, contrairement au pr&#233;c&#233;dent, n&#8217;impose pas de contrainte sur le type des lexies 
susceptibles de l&#8217;instancier mais n&#233;cessite que L2 inclue dans sa d&#233;finition une des deux 
s&#233;quences indiqu&#233;es (&#8220;resulting from&#8221; ou &#8220;caused by&#8221;). On voit ici que la seule utilisation de 
la hi&#233;rarchie des concepts conduirait &#224; exclure un certain nombre de patrons de polys&#233;mie 
</p>
<p>r&#233;guli&#232;re, et donc &#224; diminuer le rappel de notre m&#233;thode.  
</p>
<p>3.2.2 Application des patrons 
</p>
<p>Les exemples ci-apr&#232;s sont reconnus comme des occurrences du patron colorOf : 
</p>
<p>&#61623; {emerald#3} = the green color of an emerald 
</p>
<p>&#61623; {tan#2, topaz#3} = a light brown, the color of topaz 
</p>
<p>&#61623; {copper#4} = a reddish-brown color resembling the color of polished copper 
</p>
<p>                                                 
6
 Les autres 557 synsets correspondent soit &#224; des situations n&#8217;&#233;tant pas un cas de polys&#233;mie r&#233;guli&#232;re, soit &#224; des 
</p>
<p>situations o&#249; la d&#233;finition d&#8217;un patron de polys&#233;mie ne permettrait de couvrir qu&#8217;un faible nombre de cas. 
</p>
<p>7
 Cet exemple est cod&#233; en C#, langage proche de Java. 
</p>
<p>8
 Plusieurs paraphrases peuvent &#234;tre pr&#233;cis&#233;es ; par exemple, la d&#233;tection des m&#233;taphores testera plusieurs cas de 
</p>
<p>figure : &#8220;suggestive of *&#8221;, &#8220;similar to *&#8221;, &#8220;corresponds to *&#8221;, &#8220;that suggests *&#8221;, &#8220;imitating *&#8221;&#8230; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La polys&#233;mie r&#233;guli&#232;re dans WordNet 
</p>
<p>Gr&#226;ce aux informations de typage associ&#233;es au patron, la lexie L1 peut &#234;tre ensuite 
</p>
<p>d&#233;sambigu&#239;s&#233;e. Pour ce faire, le syst&#232;me &#233;num&#232;re tous les sens possible de L1 (autre que L2), 
</p>
<p>et s&#8217;arr&#234;te quand le couple (L2, L1) est compatible avec l&#8217;un des couples de types d&#233;finis dans 
le patron (la hi&#233;rarchie d&#8217;hyperonymie des noms ou des verbes est explor&#233;e si besoin). 
</p>
<p>On obtient alors une d&#233;finition dans laquelle le sens de L1 est d&#233;sambigu&#239;s&#233; : 
</p>
<p>&#61623; {emerald#3} = the green color of an emerald#1 [gem] 
</p>
<p>&#61623; {tan#2, topaz#3} = a light brown, the color of topaz#2 [gem] 
</p>
<p>&#61623; {copper#4} = a reddish-brown color resembling the color of polished copper#1 [metal] 
</p>
<p>3.2.3 G&#233;n&#233;ralisation par &#233;largissement du champ d&#8217;application des patrons 
</p>
<p>Les patrons sont ensuite appliqu&#233;s &#224; l&#8217;ensemble des lexies ayant plusieurs sens, sans imposer 
aux synsets la contrainte d&#8217;inclure un synset de m&#234;me forme dans leur d&#233;finition. Cette &#233;tape 
permet d&#8217;identifier 367 synsets suppl&#233;mentaires. Par exemple, &#8220;gold&#8221; (&#171; or &#187;) a cinq sens : les 
pi&#232;ces d&#8217;or, la couleur, le m&#233;tal, une bonne sant&#233;, quelque chose de pr&#233;cieux. La paire de 
lexies (gold#2, gold#3) est de type (color,  metal) ; elle est donc compatible avec la r&#232;gle 
</p>
<p>colorOf, et peut donc s&#8217;appliquer m&#234;me si la d&#233;finition de {gold#2} (&#8220;a deep yellow 
color&#8221;) ne contient pas directement le mot &#8220;gold&#8221;. Le m&#234;me traitement est appliqu&#233; pour 
{coral#1} (&#171; corail &#187;). On obtient alors aussi :  
</p>
<p>&#61623; {amber#1, gold#2} = a deep yellow color (lien implicite vers gold#3[metal]) 
</p>
<p>&#61623; {coral#1} = a variable color averaging a deep pink (lien implicite vers coral#2[gem]) 
</p>
<p>Cette g&#233;n&#233;ralisation de l&#8217;application des patrons doit toutefois se faire en prenant des 
pr&#233;cautions. On constate exp&#233;rimentalement que cette g&#233;n&#233;ralisation donne de bons r&#233;sultats 
</p>
<p>sur certains patrons, mais pas sur tous. En effet, quand les patrons sont contraints par des 
</p>
<p>types trop g&#233;n&#233;raux (entit&#233;, artefact, abstraction&#8230;), le fait de ne plus imposer L1 dans la 
d&#233;finition de L2 va se traduire par une multiplication de couples de synsets qui ne sont pas li&#233;s 
</p>
<p>par une relation de polys&#233;mie r&#233;guli&#232;re. Pour minimiser ce risque, un patron peut tester si les 
</p>
<p>deux synsets portent effectivement sur le m&#234;me sujet, ou des sujets voisins. Cette v&#233;rification 
</p>
<p>est impl&#233;ment&#233;e par une classique mesure de similarit&#233; entre les deux d&#233;finitions, qui peut 
</p>
<p>&#234;tre astreinte &#224; respecter un seuil minimal. Nous avons utilis&#233; une mesure vectorielle de 
</p>
<p>recouvrement des mots entre d&#233;finitions, avec une pond&#233;ration de type TF-IDF
9
. Par exemple, 
</p>
<p>parmi les occurrences de la relation entre un mouvement et le son associ&#233;, nous obtenons pour 
</p>
<p>&#171; (bruit de) pas &#187; une paire de synsets dont les d&#233;finitions comportent deux mots en commun 
</p>
<p>(donnant une similarit&#233; &#233;gale &#224; 48,5%) : 
</p>
<p>&#61623; {footstep#1} = the sound of a step of someone walking 
</p>
<p>&#61623; {footstep#2} = the act of taking a step in walking 
</p>
<p>Imposer une telle contrainte, avec un seuil minimal, favorise la pr&#233;cision au d&#233;triment du 
</p>
<p>rappel. Par exemple, pour la m&#233;taphore entre animal et personne, notre syst&#232;me identifie 
</p>
<p>                                                 
9
 TF-IDF (term frequency-inverse document frequency) est une m&#233;thode de pond&#233;ration souvent utilis&#233;e dans la 
</p>
<p>fouille de textes. Cette mesure statistique nous permet ici d'&#233;valuer l'importance d'un mot au sein d&#8217;une 
d&#233;finition. Le poids augmente proportionnellement en fonction du nombre d'occurrences du mot dans la 
d&#233;finition. Il varie &#233;galement en fonction de la fr&#233;quence du mot dans l&#8217;ensemble des d&#233;finitions. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Barque et F. R. Chaumartin 
</p>
<p>&#171; tigre &#187; (et il existe bien une m&#233;taphore entre les deux lexies, bas&#233;e sur la f&#233;rocit&#233; de 
</p>
<p>l&#8217;animal) ; n&#233;anmoins, il ne le retient pas car les deux d&#233;finitions ne partagent aucun mot : 
</p>
<p>&#61623; {tiger#1} = a fierce or audacious person 
</p>
<p>&#61623; {tiger#2} = large feline of forests in Asia having a tawny coat with black stripes 
</p>
<p>4 Classification (non exhaustive) des relations de polys&#233;mie 
</p>
<p>Nous proposons ici une classification des relations de m&#233;tonymie et de m&#233;taphore
10
</p>
<p> sur la 
</p>
<p>base des patrons identifi&#233;s pendant l&#8217;&#233;tude. Dans cette classification, nous indiquons entre 
parenth&#232;ses deux nombres (occurrences correctes / nombre total d&#8217;occurrences d&#233;tect&#233;es), 
suivis d&#8217;exemples significatifs choisis pour illustrer le caract&#232;re r&#233;gulier de la relation.  
</p>
<p>4.1 Classification des relations de m&#233;tonymie 
</p>
<p>L2 repr&#233;sente L1 
&#9492;&#9472; Carte &#224; jouer repr&#233;sente Figure ou Nombre entier (5/6 ; queen#7, king#9 ; ten#2, nine#3) 
</p>
<p>L2 est caus&#233; par L1 
&#9500;&#9472; D&#233;pense caus&#233;e par Action (27/27 ; admission#3, anchorage#2) 
&#9492;&#9472; Maladie caus&#233;e par Organisme (13/17 ; ergot#1, herpes#1)   
</p>
<p>L2 est produit par L1 
&#9500;&#9472; Son produit par Instrument, Mouvement ou Appareil (15/15 ; drum#2, whistle#1 ; snap#5 ; bell#3) 
&#9500;&#9472; &#338;uvre &#233;crite par Personne 
&#9474;    &#9500;&#9472; Livre &#233;crit par Auteur (pas d&#8217;exemple dans WordNet ; ce pourrait &#234;tre &#8220;Shakespeare&#8221;) 
&#9474;    &#9474;    &#9492;&#9472; Livre &#233;crit par Proph&#232;te (15/15 ; Job#12, Jeremiah#2) 
&#9474;    &#9492;&#9472; Musique &#233;crite par Compositeur (9/9 ; Mozart#2, Wagner#3) 
&#9492;&#9472; L2 produit par Plante ou Arbre 
       &#9500;&#9472; Fruit produit par Arbre (orange#1, citrus#1) 
       &#9492;&#9472; Fleur produite par Plante (50/51 ; chrysanthemum#1, cottonweed#1) 
</p>
<p>L2 produit L1 
&#9492;&#9472; Entreprise produit Media (2/2 ; newspaper#2, magazine#3)   
</p>
<p>L2 est d&#233;riv&#233; de L1 
&#9500;&#9472; L2 est d&#233;riv&#233; d&#8217;Animal 
&#9474;    &#9500;&#9472; Chair d&#8217;Animal, Poisson, Volaille ou Crustac&#233; (303/303 ; rabbit#3 ; trout#1 ; pheasant#2 ; lobster#1) 
&#9474;    &#9500;&#9472; Fourrure d&#8217;Animal (17/17 ; fox#3, chinchilla#1) 
&#9474;    &#9492;&#9472; Laine d&#8217;Animal (2/2 ; alpaca#1, vicuna#1) 
&#9492;&#9472; L2 est d&#233;riv&#233; de Plante, Feuille, Arbre&#8230; 
       &#9500;&#9472; Boisson d&#233;riv&#233;e de Feuille (3/3 ; tea#1, mate#9)  
       &#9500;&#9472; Fibre d&#233;riv&#233;e de Plante (13/13 ; cotton#1, flax#1) 
       &#9500;&#9472; Bois d&#233;riv&#233; d&#8217;Arbre (70/70 ; bamboo#1, balsa#1) 
       &#9492;&#9472; Vin d&#233;riv&#233; de Vigne (2/2 ; Tokay#1, Verdicchio#2)    
</p>
<p>L2 a pour sujet L1 
&#9500;&#9472; Discipline a pour Sujet (56/64 ; literature#2, physics#1)  
&#9500;&#9472; L2 est responsable de L1 (4/6) 
&#9474;    &#9500;&#9472; Minist&#232;re est responsable de Sujet (Education#6, Energy#7) 
&#9474;    &#9492;&#9472; Division est responsable de Sujet (personnel#2, security#6) 
&#9492;&#9472; Livre a pour sujet Personne (6/6 ; Jonah#3, Joshua#2) 
</p>
<p>L2 accompagne L1 
&#9492;&#9472; Musique accompagne Danse (32/32 ; polka#1, mazurka#1)     
</p>
<p>                                                 
10
</p>
<p> Les r&#233;sultats contiennent &#233;galement une proportion significative d&#8217;occurrences de liens de sp&#233;cialisation 
(approximativement 12%). Toutefois, il nous semble que cette cat&#233;gorie de lien de polys&#233;mie se pr&#234;te mal &#224; 
une classification, dans la mesure o&#249; il est difficile d&#8217;identifier un typage r&#233;gulier pour L1 et L2. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La polys&#233;mie r&#233;guli&#232;re dans WordNet 
</p>
<p>L2 est inclus dans L1 
&#9500;&#9472; Substance contenue dans Medicament (17/17 ; arnica#2, menthol#1) 
&#9500;&#9472; Personne membre de Groupe (37/39 ; samurai#1, ninja#1) 
&#9500;&#9472; Personne occupant une Construction (6/6 ; building#4, floor#7) 
&#9500;&#9472; Quantit&#233; contenue dans Conteneur (39/39 ; teaspoon#1, bag#5) 
&#9474;    &#9492;&#9472; Nourriture contenue dans Plat (5/5 ; plate#8, casserole#1) 
&#9500;&#9472; Rivi&#232;re passant dans R&#233;gion (6/6 ; Alabama#3, Delaware#1) 
&#9492;&#9472; Pays situ&#233; dans &#206;le (22/22 ; Ireland#1, Malta#1) 
</p>
<p>L2 est caract&#233;ris&#233; par L1 
&#9500;&#9472; Balle caract&#233;ris&#233; par Jeu (9/10 ; paintball#1, volleyball#2) 
&#9500;&#9472; Boisson provenant de R&#233;gion (4/4 ; Chablis#2, Bordeaux#2) 
&#9500;&#9472; Couleur caract&#233;ristique de L1 (7/7) 
&#9474;    &#9500;&#9472; Couleur caract&#233;ristique de Gemme (topaz#3, emerald#3) 
&#9474;    &#9500;&#9472; Couleur caract&#233;ristique de M&#233;tal (gold#2, copper#4) 
&#9474;    &#9492;&#9472; Couleur caract&#233;ristique de Fruit (cherry#4, chestnut#4) 
&#9500;&#9472; Nourriture au go&#251;t de L1 (13/25) 
&#9474;    &#9492;&#9472; Nourriture au go&#251;t d&#8217;Herbe (mint#5, ratafia#2) 
&#9500;&#9472; V&#234;tement caract&#233;ris&#233; par Partie du corps (12/14 ; back#7, shoulder#4) 
&#9492;&#9472; Personne caract&#233;ris&#233;e par L1 
       &#9500;&#9472; Sportif caract&#233;ris&#233; par Position (31/31 ; center#13, wingback#1) 
       &#9492;&#9472; Chanteur caract&#233;ris&#233; par Voix (11/11 ; contralto#1, soprano#1) 
</p>
<p>Langue parl&#233;e par Personne (199/223 ; Korean#2, Portuguese#1) 
</p>
<p>4.2 Classification des relations de m&#233;taphore 
</p>
<p>L2 est analogue &#224; L1 
&#9500;&#9472; Communication humaine est analogue &#224; Communication animale (3/4 ; bark#1, cackle#1) 
&#9500;&#9472; Partie du corps animal correspond &#224; Partie du corps humain (3/3 ; leg#2, throat#4) 
&#9500;&#9472; Individu ressemble, dans son comportement, &#224; Animal (36/54 ; piranha#1, popinjay#1 (perroquet)) 
&#9492;&#9472; Objet ressemble, par sa forme, &#224; Objet naturel (38/38 ; moon#2, snake#5) 
       &#9492;&#9472; Artefact ressemble &#224; Partie du corps (5/5 ; nose#2, throat#3) 
</p>
<p>5 Evaluation des r&#233;sultats 
</p>
<p>A notre connaissance, il n&#8217;existe pas de gold standard pour ce type d&#8217;exp&#233;rience. A titre 
indicatif, nous avons &#233;valu&#233; manuellement les 2351 relations propos&#233;es par notre syst&#232;me. 
</p>
<p>Nous estimons que 2140 d&#8217;entre elles sont correctes, ce qui donne une pr&#233;cision de 91,03%. 
</p>
<p>Nous n&#8217;avons pas identifi&#233; de m&#233;thode permettant une &#233;valuation automatique pr&#233;cise du 
rappel. Toutefois, nous avons calcul&#233; manuellement le rappel pour deux des patrons de 
</p>
<p>polys&#233;mie pr&#233;sent&#233;s ci-dessus : la m&#233;taphore Individu ressemble &#224; Animal, ainsi que la 
</p>
<p>m&#233;tonymie Bois d&#233;riv&#233; d&#8217;Arbre. Nous avons identifi&#233; manuellement 142 occurrences du lien 
de m&#233;taphore dans WordNet (rappel de 36/142=25,3%) et 79 occurrences du lien de 
</p>
<p>m&#233;tonymie (rappel de 70/79=88,6%). Comme on le voit, le rappel d&#233;pend aussi de la nature 
</p>
<p>de la relation, qui peut &#234;tre plus ou moins r&#233;guli&#232;re.  
</p>
<p>6 Conclusion et perspective 
</p>
<p>Nous avons pr&#233;sent&#233; ici une m&#233;thode permettant de cr&#233;er automatiquement dans WordNet, 
</p>
<p>avec une bonne pr&#233;cision, deux nouvelles cat&#233;gories de relations s&#233;mantiques : des 
</p>
<p>m&#233;taphores et des m&#233;tonymies. (Une ressource contenant ces nouvelles relations est </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. Barque et F. R. Chaumartin 
</p>
<p>disponible en ligne
11
</p>
<p>.) Cette m&#233;thode peut aussi &#234;tre mise &#224; contribution dans une t&#226;che de 
</p>
<p>d&#233;sambigu&#239;sation lexicale, pour inf&#233;rer des sens de mots n&#8217;existant pas un lexique.12  
</p>
<p>Ce travail a &#233;t&#233; effectu&#233; sur l'anglais ; il pourrait aussi &#234;tre d&#233;clin&#233; pour des WordNet en 
</p>
<p>d&#8217;autres langues (une fois, bien s&#251;r, les patrons adapt&#233;s &#224; la langue d&#233;crite) pour (i) aider &#224; 
valider l'homog&#233;n&#233;it&#233; des d&#233;finitions produites et (ii) comparer les polys&#233;mies r&#233;guli&#232;res 
</p>
<p>partag&#233;es entre diff&#233;rentes langues.   
</p>
<p>R&#233;f&#233;rences  
</p>
<p>APRESJAN J. (1974). Regular Polysemy. Linguistics 142, 5-32. 
</p>
<p>BARQUE L. (2008). Description et formalisation de la polys&#233;mie r&#233;guli&#232;re du fran&#231;ais. 
</p>
<p>Universit&#233; Paris 7, Th&#232;se de doctorat. 
</p>
<p>COPESTAKE A., BRISCOE T. (1995). Semi-productive polysemy and Sense Extension. Journal 
</p>
<p>of Semantics 1, 15-67. 
</p>
<p>FASS D. (1988). Metonymy and Metaphor : What's the difference ?. Coling-88, 177-181. 
</p>
<p>FELLBAUM C. (1998). WordNet, An Electronic Lexical Database. Cambridge : MIT Press. 
</p>
<p>FELLBAUM C. (2000). Autotroponymy. In Ravin Y., LEACOCK C. (EDS.): Polysemy, pp. 52-67. 
</p>
<p>Cambridge: Cambridge University Press. 
</p>
<p>KILGARRIFF A., GAZDAR G. (1995). Polysemous relations. In PALMER F.R. (ED.). Grammar 
</p>
<p>and Meaning: Essays in Honour of Sir John Lyons, pp. 1-25. Cambridge University Press. 
</p>
<p>MARTIN R. (1972). Esquisse d'une analyse formelle de la polys&#233;mie. Travaux de linguistique  
</p>
<p>et de litt&#233;rature 10, 125-136. 
</p>
<p>OSTLER N., ATKINS B. (1991). Predictable Meaning Shift : Some Linguistic Properties of 
</p>
<p>Lexical Implication Rules. In PUSTEJOVSKY J., BERGLER S. (ED.). Lexical Semantics and 
</p>
<p>Knowledge Representation : First SIGLEX Workshop Proceedings. Berlin : Springer-Verlag. 
</p>
<p>PETERS W. (2006). In Search for More Knowledge: Regular Polysemy and Knowledge 
</p>
<p>Acquisition. Proceedings of GWC2006. 
</p>
<p>PUSTEJOVSKY J. (1995). The Generative Lexicon. Cambridge : MIT Press. 
</p>
<p>VEALE T. (2006) A typology of Lexical Analogy in WordNet. Proceedings of GWC2006. 
</p>
<p>                                                 
11
</p>
<p> http://www.chaumartin.fr/download/wnpolysemy.zip 
</p>
<p>12
 Par exemple, si {Bordeaux#1} (a port city in southwestern France) et {Bordeaux#2, Bordeaux wine#1} 
</p>
<p>existent tous deux dans WordNet, &#171; Bourgogne &#187; n&#8217;y est pr&#233;sent qu&#8217;en tant que r&#233;gion. L&#8217;exploitation des 
informations pr&#233;sentes dans les patrons d&#233;finis pour l&#8217;&#233;tude pourrait permettre de cr&#233;er dynamiquement des 
nouveaux sens de mots, quand le contexte s&#8217;y pr&#234;te (&#8220;they convince you to drink Bourgogne&#8221;). </p>

</div></div>
</body></html>