<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Sylva : plate-forme de validation multi-niveaux de lexiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Sylva : plate-forme de validation multi-niveaux de lexiques
</p>
<p>Kar&#235;n Fort Bruno Guillaume
LORIA / INRIA Nancy Grand-Est
</p>
<p>Karen.Fort@loria.fr, Bruno.Guillaume@loria.fr
</p>
<p>R&#233;sum&#233;. La production de lexiques est une activit&#233; indispensable mais complexe, qui n&#233;-
cessite, quelle que soit la m&#233;thode de cr&#233;ation utilis&#233;e (acquisition automatique ou manuelle),
une validation humaine. Nous proposons dans ce but une plate-forme Web librement dispo-
nible, appel&#233;e Sylva (Systematic lexicon validator). Cette plate-forme a pour caract&#233;ristiques
principales de permettre une validation multi-niveaux (par des validateurs, puis un expert) et
une tra&#231;abilit&#233; de la ressource. La t&#226;che de l&#8217;expert(e) linguiste en est all&#233;g&#233;e puisqu&#8217;il ne lui
reste &#224; consid&#233;rer que les donn&#233;es sur lesquelles il n&#8217;y a pas d&#8217;accord inter-validateurs.
</p>
<p>Abstract. Lexicon production is essential but complex and all creation methods (auto-
matic acquisition or manual creation) require human validation. For this purpose, we propose a
freely available Web-based framework, named Sylva (Systematic lexicon validator). The main
point of our framework is that it handles multi-level validations and keeps track of the resour-
ce&#8217;s history. The expert linguist task is made easier : (s)he has only to consider data on which
validators disagree.
</p>
<p>Mots-cl&#233;s : Lexiques, plate-forme de validation, cadres de sous-cat&#233;gorisation.
</p>
<p>Keywords: Lexicons, validation framework, subcategorization frames.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Bruno Guillaume
</p>
<p>1 Introduction
</p>
<p>De nombreux outils de traitement automatique des langues (TAL) n&#233;cessitent des ressources
linguistiques et notamment des lexiques. La construction de ce type de ressources pr&#233;sente de
nombreuses difficult&#233;s :
&#8211; diff&#233;rents types de lexiques sont n&#233;cessaires en fonction des applications ;
&#8211; le nombre d&#8217;entr&#233;es &#224; d&#233;crire est souvent important (de l&#8217;ordre de 500 000 pour les formes
</p>
<p>fl&#233;chies du fran&#231;ais par exemple) ;
&#8211; suivant la t&#226;che vis&#233;e, des informations plus ou moins d&#233;taill&#233;es sont n&#233;cessaires ;
&#8211; la fa&#231;on de coder le contenu linguistique doit parfois &#234;tre adapt&#233;e aux outils ou au moins aux
</p>
<p>th&#233;ories mises en jeu dans ces outils.
Pour la langue fran&#231;aise, les lexiques morphologiques sont moins probl&#233;matiques : ce type de
lexique ne pose pas de probl&#232;me majeur quant au contenu linguistique qu&#8217;il doit contenir. On
dispose ainsi de lexiques morphologiques de bonne qualit&#233; avec une couverture satisfaisante
(Morphalou (Romary et al., 2004), partie morphologie du Lefff (Sagot et al., 2006), . . .). Le
probl&#232;me est plus aigu pour les lexiques syntaxiques sur lesquels nous nous concentrons ici.
Des acteurs du TAL francophones travaillent ensemble r&#233;guli&#232;rement depuis deux ans sur le
d&#233;veloppement de ressources syntaxiques du fran&#231;ais (projet LexSynt1), le travail pr&#233;sent&#233; ici
pour la validation est en partie issu des reflexions men&#233;es dans le cadre de ce projet. Il est im-
portant de noter que la plate-forme pr&#233;sent&#233;e n&#8217;est pas sp&#233;cifique &#224; ces lexiques et pourrait &#234;tre
utilis&#233;e avec des lexiques s&#233;mantiques pour lesquels les probl&#232;mes sont encore plus marqu&#233;s.
</p>
<p>La construction manuelle de ressources par des experts linguistes est a priori la plus satisfai-
sante, mais la quantit&#233; de travail n&#233;cessaire rend cette m&#233;thode irr&#233;aliste dans la plupart des cas.
Quelques exemples de ressources manuelles existent n&#233;ammoins : pour le fran&#231;ais, on peut citer
DICOVALENCE (van den Eynde &amp; Mertens, 2003), les tables du lexique-grammaire (Gross,
1975) ou la base lexicale de Dubois (Dubois &amp; Dubois-Charlier, 1997). &#192; l&#8217;oppos&#233;, des m&#233;-
thodes de construction automatique de lexiques &#224; partir de corpus ont &#233;t&#233; propos&#233;es : acqui-
sition de cadres de sous-cat&#233;gorisation &#224; partir de corpus (Preiss et al., 2007) ou de corpus
arbor&#233;s (Kupsc, 2007). L&#8217;inconv&#233;nient de cette derni&#232;re m&#233;thode est &#233;videmment la qualit&#233; du
lexique produit. En effet, la pertinence de chacune des entr&#233;es ne peut &#234;tre qu&#8217;estim&#233;e et la cou-
verture d&#233;pend de la taille des corpus utilis&#233;s et de leur repr&#233;sentativit&#233; pour l&#8217;aspect consid&#233;r&#233;
dans le lexique.
</p>
<p>Dans la pratique, le plus souvent, la production de lexique utilise des m&#233;thodes mixtes qui
automatisent une partie du travail et qui minimisent l&#8217;intervention humaine. L&#8217;acquisition au-
tomatique se fait sur des ressources existantes : des corpus bruts ou arbor&#233;s, des dictionnaires
&#233;lectroniques (construction de Morphalou &#224; partir du TLFi (Pierrel et al., 2004)), ou d&#8217;autres
ressources informatis&#233;es mais qu&#8217;il faut adapter (contruction de SynLex (Gardent et al., 2006)
&#224; partir des tables du lexique-grammaire). La ressource produite d&#233;pend alors de la qualit&#233; de
la ressource de d&#233;part et de la m&#233;thode de conversion. Dans le cas de SynLex, la ressource
produite souffre de nombreuses imperfections (Falk et al., 2007) et l&#8217;intervention humaine est
n&#233;cessaire pour valider a posteriori toute ou partie de la ressource.
</p>
<p>La validation multi-niveaux permet de reporter une partie du travail humain vers des linguistes
moins exp&#233;riment&#233;s. Le premier niveau de validation est ainsi r&#233;alis&#233; par plusieurs validateurs
non-experts, le deuxi&#232;me niveau permet ensuite au linguiste expert de ne consid&#233;rer que les cas
o&#249; les diff&#233;rents validateurs ont des avis divergents.
</p>
<p>1http://lexsynt.inria.fr</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylva : plate-forme de validation multi-niveaux de lexiques
</p>
<p>Nous proposons ici une plate-forme pour g&#233;rer la validation multi-niveaux de lexiques. Cette
plate-forme permet la gestion des deux types d&#8217;utilisateurs et automatise le passage par les deux
niveaux de validation. Apr&#232;s avoir d&#233;crit les fonctionnalit&#233;s et l&#8217;implantation de la plate-forme,
nous montrons comment elle peut s&#8217;instancier avec un lexique syntaxique (SynLex) produit
automatiquement &#224; partir des tables du lexique-grammaire.
</p>
<p>2 Choix m&#233;thodologiques
</p>
<p>Notre objectif premier est de permettre la validation rapide et compl&#232;te d&#8217;une ressource &#224; large
couverture. C&#8217;est cet objectif qui a guid&#233; certains choix pour cette premi&#232;re version de l&#8217;outil.
</p>
<p>2.1 Interface simplifi&#233;e
</p>
<p>Pour chaque entr&#233;e du lexique, le validateur a le choix entre trois jugements : accept&#233;, refus&#233;,
ne sait pas. Il n&#8217;a donc pas la possibilit&#233; d&#8217;&#233;diter une entr&#233;e pour la modifier. En effet, le but
de cette interface est de permettre au validateur de se prononcer rapidement sur chacune des
entr&#233;es. Nous sommes bien conscients que cela n&#8217;est pas toujours satisfaisant et que certaines
entr&#233;es devraient &#234;tre corrig&#233;es plut&#244;t que rejet&#233;es. C&#8217;est pourquoi, il est demand&#233; au validateur
de motiver ses choix par des commentaires guid&#233;s. Il sera ainsi possible d&#8217;envisager une phase
ult&#233;rieure de correction des entr&#233;es qui posent probl&#232;me, guid&#233;e par les commentaires de la
premi&#232;re phase.
</p>
<p>Une autre cons&#233;quence de cette interface simplifi&#233;e sans possibilit&#233; d&#8217;&#233;dition est que chaque
entr&#233;e doit contenir une information suffisamment atomique. Par exemple, il n&#8217;est pas possible
de pr&#233;senter des valences (ou cadres de sous-cat&#233;gorisation, CSC) diff&#233;rentes avec une notation
factoris&#233;e en une seule entr&#233;e.
</p>
<p>2.2 Ajout d&#8217;entr&#233;es a posteriori
</p>
<p>Il n&#8217;est pas pr&#233;vu pour l&#8217;instant d&#8217;ajouter des informations dans la ressource. En effet, la notion
de paquet (d&#233;crite en section 4.2), qui permet d&#8217;obtenir une s&#233;rie de vues transversales sur la
ressource, interdit le regroupement des entr&#233;es par lemme. Par cons&#233;quent, le validateur ne
peut se faire une id&#233;e sur l&#8217;ensemble des cadres d&#8217;un lemme et il ne peut donc pas juger de la
couverture du lexique pour un lemme donn&#233;. Ainsi, si l&#8217;ajout d&#8217;entr&#233;es existait, il ne pourrait
pas &#234;tre syst&#233;matique et ne serait pas homog&#232;ne.
</p>
<p>Le probl&#232;me de compl&#233;tion par des entr&#233;es manquantes n&#233;cessite selon nous d&#8217;autres m&#233;thodes
comme l&#8217;int&#233;gration d&#8217;autres ressources (Dicovalence, Lefff, . . .) ou l&#8217;&#233;tude sur corpus (&#233;ven-
tuellement guid&#233;e par un ou plusieurs analyseurs syntaxiques).
</p>
<p>2.3 Lien facultatif vers des exemples
</p>
<p>Dans la version actuelle de l&#8217;outil, l&#8217;ajout d&#8217;un exemple est facultatif lorsque l&#8217;on accepte un
cadre. Des exp&#233;riences sont pr&#233;vues pour comparer la vitesse de validation avec ou sans ajout
d&#8217;exemple.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Bruno Guillaume
</p>
<p>Quoi qu&#8217;il en soit, nous pensons qu&#8217;une validation, m&#234;me sans exemple, produira une ressource
avec une forte valeur ajout&#233;e et qu&#8217;il est possible dans une deuxi&#232;me phase de combiner l&#8217;am&#233;-
lioration de la couverture et l&#8217;ajout d&#8217;exemples.
</p>
<p>Dans cette seconde phase, il sera sans doute plus efficace de proposer des exemples et de deman-
der au validateur de choisir le CSC qui correspond (&#233;ventuellement guid&#233; par un ou plusieurs
analyseur(s) syntaxique(s)), plut&#244;t que de lui demander de fournir lui-m&#234;me un exemple.
</p>
<p>3 La plate-forme Sylva
</p>
<p>3.1 Fonctionnalit&#233;s
</p>
<p>La plate-forme Sylva est b&#226;tie autour d&#8217;une base de donn&#233;es, con&#231;ue pour g&#233;rer &#224; la fois les
informations linguistiques du lexique et les informations p&#233;riph&#233;riques (source, historique de
validation, gestion des paquets (d&#233;crits en section 4.2)).
</p>
<p>Nous donnons ci-dessous, par ordre d&#8217;importance d&#233;croissant, les principales fonctionnalit&#233;s de
Sylva2 :
</p>
<p>Validation multi-niveaux. Comme on l&#8217;a vu, il est difficile de demander &#224; des experts lin-
guistes de valider un lexique dans son int&#233;gralit&#233;. Nous proposons donc d&#8217;utiliser comme
validateurs de premier niveau des linguistes non-experts (des &#233;tudiant(e)s en Master Sciences
du Langage, par exemple). Ainsi, dans la version actuelle de Sylva, chaque entr&#233;e est va-
lid&#233;e par deux validateurs diff&#233;rents. Lorsque les deux rendent le m&#234;me verdict (positif
ou n&#233;gatif), le jugement est automatiquement appliqu&#233; &#224; l&#8217;entr&#233;e. Lorsque les jugements
diff&#232;rent ou lorsque les validateurs h&#233;sitent, Sylva demande &#224; l&#8217;expert linguiste de tran-
cher3.
</p>
<p>Tra&#231;abilit&#233;. Nous avons &#233;galement d&#233;cid&#233; de conserver le plus d&#8217;information possible pour
chaque entr&#233;e. Outre la description linguistique, nous conservons dans la base de don-
n&#233;es les informations concernant la source de la ressource initiale (d&#8217;o&#249; proviennent les
donn&#233;es utilis&#233;es pour peupler la base) ainsi que celles concernant les processus de vali-
dation (le nom des validateurs, leur jugement, le jugement de l&#8217;expert s&#8217;il y a lieu, . . .).
</p>
<p>Vue transversale. Le nombre d&#8217;entr&#233;es &#224; valider peut &#234;tre relativement important : le premier
lexique que nous allons valider avec Sylva contient par exemple pr&#232;s de 30 000 entr&#233;es.
Une validation globale de la ressource serait probl&#233;matique : par exemple, il serait dif-
ficile pour l&#8217;expert de r&#233;partir les t&#226;ches aux diff&#233;rents validateurs. Il est donc possible
de d&#233;composer la ressource en ensembles plus petits, linguistiquement coh&#233;rents. Dans
Sylva, ces ensembles correspondent &#224; la notion de paquet (voir section 4.2).
</p>
<p>3.2 Acteurs
</p>
<p>L&#8217;interface utilisateur est accessible sur le Web. Trois types d&#8217;acteurs existent : l&#8217;invit&#233;, le vali-
dateur et l&#8217;expert. Pour ces deux derniers, la connexion se fait par identifiant et mot de passe.
</p>
<p>2la version en cours de d&#233;veloppement est disponible ici : http://sylva.loria.fr/
3Sylva est pr&#233;vu pour permettre la validation par plus de deux validateurs, il faut dans ce cas param&#233;trer les
</p>
<p>r&#232;gles de d&#233;cisions pour l&#8217;accord (unanimit&#233;, majorit&#233;, . . .)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylva : plate-forme de validation multi-niveaux de lexiques
</p>
<p>3.2.1 L&#8217;utilisateur invit&#233;
</p>
<p>L&#8217;invit&#233; peut :
&#8211; voir la ressource dans son &#233;tat actuel. Plusieurs types de vues sont disponibles, par lemme
</p>
<p>ou par initiale, par exemple. Il sera &#233;galement possible &#224; terme de filtrer les entr&#233;es selon des
crit&#232;res plus fins (verbes poss&#233;dant tel type de valence, verbes dont le lemme correspond &#224;
une expression rationnelle donn&#233;e, etc.).
</p>
<p>&#8211; exporter le lexique dans un format texte ou XML respectant la norme Lexical Markup Fra-
mework (Francopoulo et al., 2006).
</p>
<p>&#8211; poster des questions, des suggestions via une interface d&#8217;envoi de courriers &#233;lectroniques.
</p>
<p>3.2.2 Le validateur
</p>
<p>Le r&#244;le du validateur est de juger toutes les entr&#233;es des paquets qui lui sont assign&#233;s. Pour
chaque paquet, une page Web s&#8217;affiche. Les informations concernant une entr&#233;e sont pr&#233;sent&#233;es
de mani&#232;re condens&#233;e sur une seule ligne. Le validateur peut :
&#8211; accepter l&#8217;entr&#233;e et &#233;ventuellement en donner un exemple d&#8217;utilisation,
&#8211; rejeter l&#8217;entr&#233;e en donnant une explication pour ce rejet (l&#8217;interface de validation sugg&#232;re
</p>
<p>certaines explications afin d&#8217;aider le validateur &#224; formuler plus rapidement son jugement),
&#8211; exprimer un doute (Ne sait pas).
En outre, quelle que soit sa d&#233;cision, le validateur peut toujours ajouter un commentaire.
</p>
<p>3.2.3 L&#8217;expert
</p>
<p>Les principaux r&#244;les de l&#8217;expert sont de :
&#8211; cr&#233;er et g&#233;rer les comptes des validateurs, et ce afin d&#8217;assurer la souplesse de validation,
&#8211; assigner les paquets aux validateurs,
&#8211; finaliser la validation d&#8217;un paquet une fois les validations de premier niveau termin&#233;es, c&#8217;est-
</p>
<p>&#224;-dire trancher les cas pour lesquels il n&#8217;y a pas d&#8217;accord inter-validateurs.
Il est important de noter que l&#8217;expert peut &#233;galement valider directement les entr&#233;es, court-
circuitant ainsi les validateurs. Cette fonctionnalit&#233; a &#233;t&#233; pr&#233;vue pour faire face &#224; des cas ex-
ceptionnels, comme par exemple l&#8217;incapacit&#233; pour un validateur de terminer sa t&#226;che ou pour
acc&#233;l&#233;rer la validation.
</p>
<p>3.3 Qualit&#233;
</p>
<p>Sylva a &#233;t&#233; con&#231;ue et d&#233;velopp&#233;e dans le respect des techniques de d&#233;veloppement les plus r&#233;-
centes. En particulier, cette plate-forme a fait l&#8217;objet de sp&#233;cifications UML (Unified Modeling
Language) d&#233;taill&#233;es, valid&#233;es par les utilisateurs. Nous avons par ailleurs utilis&#233; un framework
de d&#233;veloppement PHP robuste, bien document&#233; et tr&#232;s utilis&#233;, symfony (Potencier &amp; Zaninotto,
2007), qui offre :
</p>
<p>&#8211; s&#233;paration mod&#232;le/objet et Mod&#232;le/Vue/Contr&#244;leur (Gamma et al., 1995),
&#8211; ind&#233;pendance &#224; l&#8217;impl&#233;mentation de la base de donn&#233;es (Object Relational Mapping),
&#8211; le support du multilinguisme (encodage UTF-8) et de l&#8217;internationalisation,
&#8211; une couche s&#233;curit&#233; performante, permettant de prot&#233;ger la base contre les intrusions,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Bruno Guillaume
</p>
<p>&#8211; des performances accrues gr&#226;ce &#224; l&#8217;utilisation d&#8217;AJAX (Asynchronous JavaScript And XML).
</p>
<p>Cela facilite une conception propre et l&#8217;&#233;criture d&#8217;un code lisible, rendant de ce fait la mainte-
nance, les modifications et la localisation plus faciles.
</p>
<p>Par ailleurs, une documentation utilisateur d&#233;taill&#233;e et adapt&#233;e au statut de l&#8217;utilisateur est dis-
ponible en ligne, afin de permettre &#224; la fois &#224; l&#8217;expert linguiste et aux validateurs de b&#233;n&#233;ficier
au mieux des fonctionnalit&#233;s de Sylva. Une documentation d&#233;veloppeur sera &#233;galement fournie
pour permettre d&#8217;adapter l&#8217;outil &#224; d&#8217;autres types de ressources.
</p>
<p>4 Un exemple de mise en &#339;uvre de Sylva
</p>
<p>Une instanciation de la plate-forme est une description pr&#233;cise des informations associ&#233;es aux
entr&#233;es du lexique. &#192; partir de cette description, nous devons adapter l&#8217;interface utilisateur
correspondante pour la validation. Il faut notamment adapter la partie de l&#8217;interface qui permet
au validateur de motiver son jugement en cas de refus.
</p>
<p>4.1 La ressource utilis&#233;e
</p>
<p>La validation &#224; grande &#233;chelle d&#8217;une premi&#232;re ressource est en cours. Nous avons choisi de com-
mencer par le lexique syntaxique SynLex (Gardent et al., 2006). En effet, malgr&#233; des d&#233;fauts
identifi&#233;s (Falk et al., 2007), SynLex est construit &#224; partir d&#8217;une ressource de qualit&#233; (les tables
du lexique-grammaire fran&#231;ais (Gross, 1975)) qui est l&#8217;une des seules &#224; concilier couverture
large et informations d&#233;taill&#233;es. Il est &#224; noter que SynLex ne fait pas de distinction de sens pour
un m&#234;me lemme car il a &#233;t&#233; construit uniquement par extraction des informations syntaxiques
contenues dans les tables du lexique-grammaire.
</p>
<p>La validation de SynLex va permettre d&#8217;en am&#233;liorer la pr&#233;cision ; l&#8217;am&#233;lioration de la couver-
ture se fera &#224; l&#8217;aide d&#8217;autres m&#233;thodes (cf. section suivante).
</p>
<p>Dans Synlex, une entr&#233;e se compose d&#8217;un verbe, d&#8217;une liste d&#8217;arguments syntaxiques ayant
un r&#244;le s&#233;mantique (a0, a1, ...), d&#8217;une liste optionnelle d&#8217;associ&#233;s (arguments r&#233;gis par le verbe
mais ne remplissant pas de r&#244;le s&#233;mantique, Ilimp pour &#171; il impersonnel &#187;, par exemple) et d&#8217;une
liste de macros (informations suppl&#233;mentaires sur les propri&#233;t&#233;s syntaxiques du verbe comme
l&#8217;auxiliaire ou la passivisation). Les associ&#233;s et les macros sont des listes finies d&#8217;atomes.
Chaque argument est d&#233;crit par : fonction grammaticale (suj, objde, ...), marqueur optionnel
(de, pour, ...), cat&#233;gorie syntaxique (scompl, sn, ...), restrictions morphologiques (pluriel obli-
gatoire, par exemple), restrictions s&#233;mantiques (humain, non humain, abstrait).
</p>
<p>Construit &#224; partir de 60% des tables, la version de SynLex utilis&#233;e pour peupler la base d&#233;crit
3 494 verbes diff&#233;rents et 26 714 entr&#233;es. La figure ci-dessous d&#233;crit quelques entr&#233;es associ&#233;es
au lemme &#171; abuser &#187; (celles qui apparaissent dans l&#8217;interface de la figure 2), ainsi que quelques
entr&#233;es associ&#233;es au lemme &#171; &#233;pater &#187; qui font appara&#238;tre d&#8217;autres &#233;l&#233;ments (marqueur de, macro
&#234;tre).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylva : plate-forme de validation multi-niveaux de lexiques
</p>
<p>abuser &lt;a0:suj:sinf:::&gt;
abuser &lt;a0:suj:sn:::humain&gt;
abuser &lt;a0:suj:sn:::non_humain&gt;
abuser &lt;a0:suj:scompl:::&gt;
abuser &lt;a0:suj:sn:::non_humain,a1:obj:sn:::humain&gt;
abuser &lt;a0:suj:sinf:::,a1:obj:sn:::humain&gt;
abuser &lt;a0:suj:sn:::humain,a1:obj:sn:::humain&gt;
abuser &lt;a0:suj:scompl:::,a1:obj:sn:::humain&gt;
</p>
<p>&#233;pater &lt;a1:suj:sn:::humain,a0:objde:de-scompl:::&gt;; etre, participe-passe
&#233;pater &lt;a1:suj:sn:::humain,a0:objde:de-sn:::abstrait&gt;; etre, participe-passe
</p>
<p>FIG. 1 &#8211; Exemples d&#8217;entr&#233;es de SynLex.
</p>
<p>FIG. 2 &#8211; Interface du validateur pour SynLex (version b&#233;ta).
</p>
<p>4.2 Les paquets
</p>
<p>Afin de rendre la phase de validation la plus efficace possible, la ressource est d&#233;compos&#233;e
en ensembles, linguistiquement coh&#233;rents et de taille raisonnable (entre 50 et 210 entr&#233;es), les
paquets. Etant donn&#233;e la taille de SynLex, ceux-ci ont &#233;t&#233; construits de mani&#232;re automatique,
avant le peuplement de la base, notre but &#233;tant de r&#233;unir les entr&#233;es ayant un comportement
semblable, afin d&#8217;en simplifier la validation.
</p>
<p>Une premi&#232;re &#233;tape de tri consiste &#224; regrouper les entr&#233;es poss&#233;dant le m&#234;me CSC. Les groupes
suffisamment gros forment directement des paquets : 109 paquets sont produits ainsi. Les en-
tr&#233;es restantes sont regroup&#233;es par table d&#8217;origine : 110 paquets. Enfin, le reste est arbitrairement
r&#233;parti dans les 9 derniers paquets. Au final, 228 paquets peuplent la base.
</p>
<p>4.3 Des interfaces adapt&#233;es
</p>
<p>La validation de SynLex a donn&#233; lieu au d&#233;veloppement d&#8217;interfaces sp&#233;cifiques, qui, gr&#226;ce &#224; la
s&#233;paration Mod&#232;le/Vue/Contr&#244;leur sont facilement adaptables &#224; d&#8217;autres lexiques. Des captures
d&#8217;&#233;crans des interfaces de validation des validateurs et de l&#8217;expert pour la ressource actuelle
sont pr&#233;sent&#233;es respectivement en figures 2 et 3. L&#8217;interface de gestion de l&#8217;expert est quant &#224;
elle pr&#233;sent&#233;e en figure 4.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Bruno Guillaume
</p>
<p>FIG. 3 &#8211; Interface de l&#8217;expert pour SynLex (version b&#233;ta).
</p>
<p>FIG. 4 &#8211; Interface g&#233;n&#233;rale de l&#8217;expert pour SynLex (version b&#233;ta).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Sylva : plate-forme de validation multi-niveaux de lexiques
</p>
<p>5 D&#233;veloppements futurs
</p>
<p>5.1 Int&#233;gration d&#8217;autres ressources
</p>
<p>SynLex a &#233;t&#233; contruit &#224; partir d&#8217;une ressource de grande qualit&#233;, produite manuellement, mais il
reste limit&#233; &#224; une partie des verbes (seules 60% des tables de lexique-grammaire des verbes sont
disponibles librement). Il est par cons&#233;quent n&#233;cessaire de le fusionner avec d&#8217;autres ressources
pour obtenir un lexique syntaxique du fran&#231;ais g&#233;n&#233;rique.
</p>
<p>Le Lefff (lexique des formes fl&#233;chies du fran&#231;ais) est un lexique du fran&#231;ais &#224; large couverture
qui fournit des informations morphologiques et syntaxiques, non seulement pour les verbes,
mais aussi pour toutes les autres cat&#233;gories morphosyntaxiques. Le Lefff surg&#233;n&#232;re souvent :
par d&#233;faut, &#224; tout nom sont affect&#233;s tous les CSC possibles pour les noms. Cette ressource
est donc une bonne candidate pour une validation par filtrage des entr&#233;es. Le format du Lefff
&#233;tant tr&#232;s proche de celui de SynLex, il peut &#234;tre entr&#233; facilement dans la plate-forme actuelle.
Cependant, les informations de sous-cat&#233;gorisation sont tr&#232;s factoris&#233;es dans le Lefff, il faudra
en tenir compte lors de son int&#233;gration soit en d&#233;pliant les cadres factoris&#233;s, soit en permettant
au validateur de d&#233;crire plus finement les motivations de son choix.
</p>
<p>Bien que n&#233;cessitant un travail linguistique cons&#233;quent, la traduction des informations de DICO-
VALENCE (van den Eynde &amp; Mertens, 2003), lexique de grande qualit&#233; des valences verbales
du fran&#231;ais, permettrait d&#8217;am&#233;liorer significativement la qualit&#233; du lexique envisag&#233;.
</p>
<p>5.2 Int&#233;gration d&#8217;autres fonctionnalit&#233;s
</p>
<p>Comme nous l&#8217;avons d&#233;j&#224; &#233;voqu&#233;, la premi&#232;re fonctionnalit&#233; que nous souhaitons ajouter &#224;
Sylva est une interface Web permettant de relier des usages de verbes &#224; des exemples. En-
core une fois, il s&#8217;agit l&#224; d&#8217;une t&#226;che longue et p&#233;nible. Nous envisageons d&#8217;utiliser pour cela
des exemples extraits de corpus arbor&#233;s, de corpus de textes ou de dictionnaires. Pour chaque
exemple, l&#8217;utilisateur devra s&#233;lectionner l&#8217;une des entr&#233;es du lexique. Gr&#226;ce aux informations
fournies par le corpus arbor&#233; ou par le r&#233;sultat d&#8217;une analyse syntaxique, on pourra r&#233;duire le
nombre de possibilit&#233;s propos&#233;es au validateur et ainsi lui faciliter la t&#226;che.
</p>
<p>Une autre fonctionnalit&#233; importante serait la possibilit&#233; de modifier les entr&#233;es. En utilisant les
commentaires accompagnant les refus de la premi&#232;re phase, on pourra proposer au validateur
des hypoth&#232;ses de corrections de l&#8217;entr&#233;e parmi lesquelles il pourra choisir.
</p>
<p>On peut imaginer que des entr&#233;es manquantes pourraient &#234;tre d&#233;tect&#233;es, y compris apr&#232;s l&#8217;int&#233;-
gration d&#8217;autres ressources, par exemple dans la phase de liage des exemples &#224; partir de corpus.
Il faudrait donc pr&#233;voir une interface pour ajouter de nouvelles entr&#233;es, au moins pour l&#8217;utilisa-
teur expert.
</p>
<p>Le d&#233;veloppement de ces fonctionnalit&#233;s n&#233;cessite un travail non n&#233;gligeable, mais nous pen-
sons que notre plate-forme est suffisamment g&#233;n&#233;rique et adaptable pour en faciliter et en acc&#233;-
l&#233;rer l&#8217;impl&#233;mentation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Kar&#235;n Fort, Bruno Guillaume
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; r&#233;alis&#233; gr&#226;ce &#224; des fonds provenant du CPER MISN de la R&#233;gion Lorraine.
Les auteurs souhaitent remercier les autres membres du projet pour leur participation active aux
sp&#233;cifications : Claire Gardent, Guy Perrier et Ingrid Falk. Nous remercions &#233;galement Mathieu
Morey et Fran&#231;ois-R&#233;gis Chaumartin pour leur aide lors de la phase de d&#233;veloppement.
</p>
<p>R&#233;f&#233;rences
</p>
<p>DUBOIS J. &amp; DUBOIS-CHARLIER F. (1997). Les Verbes Fran&#231;ais. Paris, France : Larousse-
Bordas.
</p>
<p>FALK I., FRANCOPOULO G. &amp; GARDENT C. (2007). &#201;valuer SynLex. In Actes de TALN 07,
p. 335&#8211;344, Toulouse.
</p>
<p>FRANCOPOULO G., GEORGE M., CALZOLARI N., MONACHINI M., BEL N., PET M. &amp;
SORIA C. (2006). Lexical Markup Framework (LMF). In Actes de LREC 06, G&#232;ne, Italie.
</p>
<p>GAMMA E., HELM R., JOHNSON R. &amp; VLISSIDES J. (1995). Design Patterns : Elements
of Reusable Object-Oriented Software. Boston, MA, USA : Addison-Wesley Longman Publi-
shing Co., Inc.
</p>
<p>GARDENT C., GUILLAUME B., PERRIER G. &amp; FALK I. (2006). Extraction d&#8217;information de
sous-cat&#233;gorisation &#224; partir des tables du LADL. In Actes de TALN 06, p. 139&#8211;148, Louvain.
</p>
<p>GROSS M. (1975). M&#233;thodes en syntaxe. Hermann.
</p>
<p>KUPSC A. (2007). Extraction automatique de cadres de sous-cat&#233;gorisation verbale pour le
fran&#231;ais &#224; partir d&#8217;un corpus arbor&#233;. In Actes de TALN 07, Toulouse, France.
</p>
<p>PIERREL J., DENDIEN J. &amp; BERNARD P. (2004). Le TLFi ou Tr&#233;sor de la Langue Fran&#231;aise
informatis&#233;. In Actes de EURALEX 04, Lorient, France.
</p>
<p>POTENCIER F. &amp; ZANINOTTO F. (2007). The Definitive Guide to symfony. Berkeley, CA,
USA : Apress.
</p>
<p>PREISS J., BRISCOE T. &amp; KORHONEN A. (2007). A system for large-scale acquisition of
verbal, nominal and adjectival subcategorization frames from corpora. In Actes de ACL 07,
Prague, R&#233;publique tch&#232;que.
</p>
<p>ROMARY L., SALMON-ALT S. &amp; FRANCOPOULO G. (2004). Standards going concrete :
from LMF to Morphalou. In M. ZOCK, Ed., COLING 2004 Enhancing and using electronic
dictionaries, p. 22&#8211;28, Gen&#232;ve, Suisse.
</p>
<p>SAGOT B., CL&#201;MENT L., VILLEMONTE DE LA CLERGERIE &#201;. &amp; BOULLIER P. (2006). The
Lefff 2 syntactic lexicon for French : architecture, acquisition, use. In Actes de LREC 06,
G&#232;ne, Italie.
</p>
<p>VAN DEN EYNDE K. &amp; MERTENS P. (2003). La valence : l&#8217;approche pronominale et son
application au lexique verbal. Journal of French Language Studies, 13, 63&#8211;104.</p>

</div></div>
</body></html>