<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apprentissage artificiel de r&#232;gles d&#8217;indexation pour MEDLINE</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Apprentissage artificiel de r&#232;gles d&#8217;indexation pour MEDLINE
</p>
<p>Aur&#233;lie N&#233;v&#233;ol
National Library of Medicine
</p>
<p>8600 Rockville Pike
Bethesda, MD 20894, USA
</p>
<p>neveola@nlm.nih.gov
</p>
<p>Vincent Claveau
IRISA - CNRS
</p>
<p>Campus de Beaulieu
35042 Rennes cedex, France
</p>
<p>Vincent.Claveau@irisa.fr
</p>
<p>R&#233;sum&#233;. L&#8217;indexation est une composante importante de tout syst&#232;me de recherche d&#8217;in-
formation. Dans MEDLINE, la base documentaire de r&#233;f&#233;rence pour la litt&#233;rature du domaine
biom&#233;dical, le contenu des articles r&#233;f&#233;renc&#233;s est index&#233; &#224; l&#8217;aide de descripteurs issus du th&#233;-
saurus MeSH. Avec l&#8217;augmentation constante de publications &#224; indexer pour maintenir la base
&#224; jour, le besoin d&#8217;outils automatiques se fait pressant pour les indexeurs. Dans cet article, nous
d&#233;crivons l&#8217;utilisation et l&#8217;adaptation de la Programmation Logique Inductive (PLI) pour d&#233;-
couvrir des r&#232;gles d&#8217;indexation permettant de g&#233;n&#233;rer automatiquement des recommandations
d&#8217;indexation pour MEDLINE. Les r&#233;sultats obtenus par cette approche originale sont tr&#232;s satis-
faisants compar&#233;s &#224; ceux obtenus &#224; l&#8217;aide de r&#232;gles manuelles lorsque celles-ci existent. Ainsi,
les jeux de r&#232;gles obtenus par PLI devraient &#234;tre prochainement int&#233;gr&#233;s au syst&#232;me produisant
les recommandations d&#8217;indexation automatique pour MEDLINE.
</p>
<p>Abstract. Indexing is a crucial step in any information retrieval system. In MEDLINE, a
widely used database of the biomedical literature, the indexing process involves the selection
of Medical Subject Headings in order to describe the subject matter of articles. The need for
automatic tools to assist human indexers in this task is growing with the increasing amount of
publications to be referenced in MEDLINE. In this paper, we describe the use and the customiza-
tion of Inductive Logic Programming (ILP) to infer indexing rules that may be used to produce
automatic indexing recommendations for MEDLINE indexers. Our results show that this origi-
nal ILP-based approach overperforms manual rules when they exist. We expect the sets of ILP
rules obtained in this experiment to be integrated in the system producing automatic indexing
recommendations for MEDLINE.
</p>
<p>Mots-cl&#233;s : Analyse et Indexation/m&#233;thodes ; Medical Subject Headings ; Apprentissage
Artificiel ; Programmation Logique Inductive.
</p>
<p>Keywords: Abstracting and Indexing/methods ; Medical Subject Headings ; Ma-
chine Learning ; Inductive Logic Programming.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. N&#233;v&#233;ol et V. Claveau
</p>
<p>1 Introduction
</p>
<p>La recherche d&#8217;information dans une collection de documents qu&#8217;elle soit sp&#233;cialis&#233;e (e.g. Le-
gifrance1, MEDLINE&#174;2) ou non (e.g. Internet) n&#233;cessite une indexation des documents. L&#8217;index
ainsi cr&#233;&#233; est ensuite utilis&#233; pour &#233;valuer la pertinence de chacun des documents de la collection
pour les requ&#234;tes des utilisateurs. Dans le cadre de documents textuels, on distingue usuellement
deux types d&#8217;indexation : l&#8217;indexation libre, qui permet d&#8217;utiliser sans limitation des s&#233;quences
de mots quelconques, et l&#8217;indexation contr&#244;l&#233;e qui utilise de mani&#232;re contrainte les concepts
r&#233;pertori&#233;s dans une liste pr&#233;d&#233;finie. On parle alors de vocabulaire contr&#244;l&#233; ; c&#8217;est dans ce cadre
que se situe notre travail.
</p>
<p>Dans le domaine biom&#233;dical, le th&#233;saurus MeSH&#174; (Medical Subject Headings) d&#233;velopp&#233; par la
U.S. National Library of Medicine (NLM) est l&#8217;outil de pr&#233;dilection pour indexer la litt&#233;rature.
Ainsi, la base MEDLINE recense plus de 17 millions d&#8217;articles scientifiques du domaine et re&#231;oit
3 millions de requ&#234;tes par jour. Ces articles sont r&#233;f&#233;renc&#233;s &#224; l&#8217;aide de notices descriptives, ou
&#171; citations &#187;, contenant notamment une quinzaine de mots-cl&#233;s repr&#233;sentant les concepts abor-
d&#233;s par les auteurs parmi les quelque 24 000 du th&#233;saurus (e.g. aphasia, patient care, hand. . .),
organis&#233;s hi&#233;rarchiquement (e.g. thumb est un descendant de hand dans l&#8217;arborescence Ana-
tomy). Le cas &#233;ch&#233;ant, ces mots-cl&#233;s doivent ensuite &#234;tre pr&#233;cis&#233;s &#224; l&#8217;aide des 83 qualificatifs
(e.g. surgery, pharmacology). Pour chaque mot-cl&#233;, le MeSH d&#233;finit un sous-ensemble de qua-
lificatifs &#171; affiliables &#187;, de sorte que seules certaines paires peuvent &#234;tre form&#233;es. Par exemple,
les paires aphasia/metabolism ou hand/surgery sont autoris&#233;es, mais pas hand/metabolism.
</p>
<p>L&#8217;augmentation constante du nombre de publications &#224; indexer dans MEDLINE (environ 3 000
par jour) a conduit au d&#233;veloppement d&#8217;outils automatiques tels que MTI (Aronson et al., 2004)
destin&#233;s &#224; aider les indexeurs en leur proposant des mots-cl&#233;s jug&#233;s pertinents pour chacun des
documents trait&#233;s. La complexit&#233; de la t&#226;che d&#8217;indexation et le volume croissant de donn&#233;es
&#224; traiter fait du perfectionnement des outils existant une n&#233;cessit&#233;. En particulier, en ce qui
concerne l&#8217;indexation MeSH, un progr&#232;s notable repose sur l&#8217;extraction par des outils automa-
tiques de paires mot-cl&#233; / qualificatif et non seulement des mots-cl&#233;s isol&#233;s. Des travaux r&#233;cents
(N&#233;v&#233;ol et al., 2007) men&#233;s dans le cadre du projet &#171; Indexing 2015 &#187; de la NLM ont montr&#233;
que l&#8217;utilisation de r&#232;gles d&#8217;indexation appliqu&#233;es &#224; partir des mots-cl&#233;s isol&#233;s est une bonne
m&#233;thode pour l&#8217;extraction de paires. Pour quelques qualificatifs, des r&#232;gles r&#233;gissant leur emploi
ont &#233;t&#233; trouv&#233;es manuellement. Les performances obtenues &#224; l&#8217;aide de ces r&#232;gles manuelles sont
satisfaisantes au niveau de la pr&#233;cision, mais le rappel reste faible et le d&#233;veloppement manuel
de nouvelles r&#232;gles est &#224; la fois complexe et co&#251;teux.
</p>
<p>L&#8217;objectif du travail pr&#233;sent&#233; dans cet article est de d&#233;passer ce cadre manuel en
inf&#233;rant automatiquement de nouvelles r&#232;gles d&#8217;indexation impliquant des qualificatifs
pour compl&#233;ter les r&#233;sultats de MTI. Pour ce faire, nous adoptons une approche ori-
ginale en utilisant une m&#233;thode d&#8217;apprentissage symbolique particuli&#232;re, la programma-
tion logique inductive (PLI), que nous adaptons aux sp&#233;cificit&#233;s des donn&#233;es MED-
LINE afin d&#8217;obtenir des r&#232;gles pertinentes permettant de traiter efficacement une grande
quantit&#233; de donn&#233;es. Ces r&#232;gles, que nous cherchons &#224; inf&#233;rer, sont du type :
Si un terme de l&#8217;arborescence &#171; Anatomy &#187; ainsi qu&#8217;un &#171; Carboxylic
Acids &#187; sont recommand&#233;s pour l&#8217;indexation, alors la paire
&#171; [Carboxylic Acids]/pharmacology &#187; doit &#233;galement &#234;tre recommand&#233;e.
</p>
<p>1http://www.legifrance.gouv.fr/
2Accessible via PubMed &#224; l&#8217;URL http://www.ncbi.nlm.nih.gov/sites/entrez?db=pubmed</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage de r&#232;gles d&#8217;indexation
</p>
<p>2 Travaux connexes
</p>
<p>L&#8217;indexation de textes du domaine biom&#233;dical &#224; l&#8217;aide de descripteurs MeSH a donn&#233; lieu &#224; de
nombreux travaux aussi bien en anglais que dans d&#8217;autres langues europ&#233;ennes. Les m&#233;thodes
utilis&#233;es pour l&#8217;indexation rel&#232;vent aussi bien du TAL (N&#233;v&#233;ol et al., 2006) que de l&#8217;appren-
tissage (Lin &amp; Wilbur, 2007; Rak et al., 2007) ou d&#8217;une combinaison des deux (Mark&#243; et al.,
2003; Aronson et al., 2004). Cependant, du fait de la complexit&#233; du probl&#232;me de l&#8217;indexation
MeSH (nombre de descripteurs, multiples combinaisons possibles...), la plupart de ces travaux,
m&#234;me r&#233;cents, se focalisent sur l&#8217;indexation &#224; l&#8217;aide de mots-cl&#233;s MeSH isol&#233;s et ne prennent
pas en compte le r&#244;le des qualificatifs. Ainsi, nos travaux prennent appui sur ceux de N&#233;v&#233;ol et
al. (2006; 2007) pour proposer une avanc&#233;e innovante dans ce domaine.
</p>
<p>Bien que la formalisation de r&#232;gles d&#8217;indexation MeSH n&#8217;ait pas fait l&#8217;objet de travaux en in-
dexation automatique, cette question a &#233;t&#233; abord&#233;e dans le cadre de la recherche d&#8217;information
par Soualmia (2004) qui proposait l&#8217;application de r&#232;gles d&#8217;association pour l&#8217;expansion de re-
qu&#234;tes. Cependant, peu de r&#232;gles avaient &#233;t&#233; obtenues du fait de la complexit&#233; de la description
du probl&#232;me d&#8217;apprentissage par des techniques standard (cf. section suivante). La technique
d&#8217;apprentissage artificiel que nous utilisons pour aborder ce probl&#232;me, la PLI, doit nous per-
mettre de contourner ces difficult&#233;s. La PLI a d&#233;j&#224; &#233;t&#233; employ&#233;e pour certains travaux en TAL ;
par exemple pour inf&#233;rer des patrons d&#8217;extraction (Claveau et al., 2003), des r&#232;gles d&#8217;alignement
(Ozdowska &amp; Claveau, 2006), faire de l&#8217;&#233;tiquetage et d&#8217;autres t&#226;ches (Cussens &amp; D&#382;eroski,
2000). Dans tous ces travaux, c&#8217;est principalement l&#8217;expressivit&#233; de la PLI qui est exploit&#233;e,
notamment sa capacit&#233; &#224; repr&#233;senter simplement des probl&#232;mes relationnels, et &#224; produire des
r&#232;gles interpr&#233;tables. Cette capacit&#233; &#224; traiter des probl&#232;mes impliquant des repr&#233;sentations com-
plexes se traduisent en revanche souvent par des complexit&#233;s calculatoires prohibitives pour tra-
vailler sur de grandes quantit&#233;s de donn&#233;es. Il est donc important de bien contr&#244;ler ces aspects,
comme nous le d&#233;crivons en section 3.3.
</p>
<p>3 Utilisation de la programmation logique inductive
</p>
<p>Dans cette section, nous pr&#233;sentons bri&#232;vement les principes de la PLI ; nous invitons le lecteur
int&#233;ress&#233; &#224; consulter (Muggleton &amp; Raedt, 1994) pour une description &#233;tendue. Nous d&#233;taillons
ensuite l&#8217;int&#233;r&#234;t de cette m&#233;thode pour l&#8217;indexation MeSH et d&#233;crivons comment nous l&#8217;avons
adapt&#233;e pour prendre en compte les sp&#233;cificit&#233;s de notre probl&#232;me.
</p>
<p>3.1 Principes de la PLI
</p>
<p>La PLI est une technique d&#8217;apprentissage symbolique supervis&#233;e permettant d&#8217;inf&#233;rer des
r&#232;gles, exprim&#233;es sous forme de clauses logiques (clauses Prolog), &#224; partir d&#8217;exemples, eux
aussi d&#233;crits en Prolog. Formellement, &#233;tant donn&#233;s les ensembles d&#8217;exemples E+ et de contre-
exemples E&#8722;, un ensemble d&#8217;informations sur le monde B (background knowledge), le but
d&#8217;un programme de PLI est de trouver un ensemble de r&#232;gles H tel que (&#3; repr&#233;sente faux) :
B &#8743;H &#8743; E&#8722; 6|= &#3; et B &#8743;H |= E+.
En pratique, ces deux conditions sont assouplies : on cherche un ensemble de r&#232;gles couvrant
(expliquant) la plupart des exemples positifs et rejetant la plupart des exemples n&#233;gatifs. Cela
permet de travailler avec des donn&#233;es imparfaites ou bruit&#233;es &#8211; ce qui est souvent le cas avec des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. N&#233;v&#233;ol et V. Claveau
</p>
<p>probl&#232;mes r&#233;els &#8211; et d&#8217;obtenir des r&#232;gles plus g&#233;n&#233;riques quitte &#224; accepter quelques exceptions.
</p>
<p>La plupart des algorithmes de PLI abordent l&#8217;inf&#233;rence de r&#232;gles comme un probl&#232;me de re-
cherche dans un espace d&#8217;hypoth&#232;ses (not&#233; EH). L&#8217;algorithme 1 illustre ce type de fonctionne-
ment ; c&#8217;est ce m&#234;me algorithme qui est au c&#339;ur d&#8217;ALEPH (Srinivasan, 2001), l&#8217;outil de PLI que
nous utilisons pour nos exp&#233;riences. L&#8217;organisation et le parcours de l&#8217;espace EH est un point
crucial pour l&#8217;efficacit&#233; de la phase d&#8217;inf&#233;rence (cf. section 3.3). La fonction de score Sc prend
g&#233;n&#233;ralement en compte le nombre d&#8217;exemples positifs et n&#233;gatifs couverts (respectivement P
et N ) pour juger de la qualit&#233; d&#8217;une hypoth&#232;se ; dans notre cas, Sc = P
</p>
<p>P+N
.
</p>
<p>Algorithme 1 Algorithme d&#8217;ALEPH
</p>
<p>It&#233;ration jusqu&#8217;&#224; E+ = &#8709;
1. choisir al&#233;atoirement un exemple positif e+ dans E+ ;
</p>
<p>2. construire la clause la plus sp&#233;cifique &#8869; couvrant e+ ;
3. g&#233;n&#233;rer et parcourir l&#8217;espace de recherche EH bas&#233; sur &#8869; &#224; la recherche de la clause h
</p>
<p>maximisant une fonction de score Sc ;
</p>
<p>4. ajouter h &#224; l&#8217;ensemble H et &#244;ter de E+ les exemples couverts par h.
</p>
<p>Fin it&#233;ration
</p>
<p>3.2 Description des exemples
</p>
<p>Dans notre cadre, la PLI doit permettre d&#8217;inf&#233;rer des r&#232;gles d&#8217;adjonction de qualificatifs &#224; partir
d&#8217;exemples d&#8217;articles recens&#233;s dans MEDLINE et pr&#233;alablement annot&#233;s &#224; l&#8217;aide de descripteurs
MeSH. Pour un qualificatif donn&#233;, on cherche &#224; obtenir les r&#232;gles indiquant &#224; quel mot-cl&#233; il
doit &#234;tre associ&#233; selon le contexte de ce mot-cl&#233;.
</p>
<p>Ce probl&#232;me peut &#234;tre vu comme un simple probl&#232;me de recherche de r&#232;gles d&#8217;association
pour lequel il existe des algorithmes qui peuvent sembler moins lourds que la PLI (Agrawal
et al., 1993). Cependant, le choix de la PLI pour ce probl&#232;me n&#8217;est pas un hasard. En effet, une
technique de recherche de r&#232;gle d&#8217;association (e.g. APRIORI) n&#233;cessiterait de d&#233;crire chaque
exemple par un tuple indiquant quel mot-cl&#233; est examin&#233; (celui pour lequel on peut vouloir
ajouter le qualificatif &#233;tudi&#233;) et quels autres mots-cl&#233;s apparaissent dans le reste de la des-
cription. Sans autre subtilit&#233; de repr&#233;sentation, cela produirait un tuple de dimension 24 000 x
24 000. La recherche de repr&#233;sentations plus l&#233;g&#232;res se heurte tout de m&#234;me &#224; deux probl&#232;mes
(Soualmia, 2004) : le nombre variable de mots-cl&#233;s par article et la prise en compte des relations
hi&#233;rarchiques entre mots-cl&#233;s. Ces deux probl&#232;mes propres aux m&#233;thodes propositionnelles (i.e.
d&#233;crivant les probl&#232;mes sous forme de tuples attributs-valeurs) sont naturellement r&#233;solus par
l&#8217;emploi de la PLI.
</p>
<p>En effet, gr&#226;ce &#224; l&#8217;expressivt&#233; de Prolog, la PLI permet de d&#233;crire de tels probl&#232;mes relation-
nels simplement. Le tableau 1 pr&#233;sente par exemple la notice d&#8217;un article et son encodage en
Prolog. Un exemple positif est une occurrence d&#8217;un mot-cl&#233; associ&#233; au qualificatif dont nous
cherchons &#224; mod&#233;liser l&#8217;utilisation. Supposons que l&#8217;on s&#8217;int&#233;resse aux r&#232;gles d&#8217;indexation im-
pliquant le qualificatif pharmacology ; d&#8217;apr&#232;s la notice du tableau 1, on ajoute &#224;E+ l&#8217;exemple :
qualif(mh16179550_1,&quot;pharmacology&quot;). Les exemples n&#233;gatifs sont des occurrences de mots-cl&#233;s
auxquels le qualificatif recherch&#233; n&#8217;est pas associ&#233; bien qu&#8217;il soit autoris&#233; pour ces mots-cl&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage de r&#232;gles d&#8217;indexation
</p>
<p>Extrait de la notice d&#8217;un article Extrait de l&#8217;encodage de l&#8217;article dans B
PMID - 16179550 in_article(pmid16179550,mh16179550_1).
MH - Acrylamide/*pharmacology hierarchy(mh16179550_1,&quot;Acrylamide&quot;).
MH - Animals in_article(pmid16179550,mh16179550_2).
MH - Astrocytes/drug effects hierarchy(mh16179550_2,&quot;Animals&quot;).
MH - Histidine/physiology in_article(pmid16179550,mh16179550_3).
MH - Amino Acid Transport hierarchy(mh16179550_3,&quot;Astrocytes&quot;).
</p>
<p>Systems/*biosynthesis in_article(pmid16179550,mh16179550_4).
MH - Cells, Cultured hierarchy(mh16179550_4,&quot;Histidine&quot;).
... ...
</p>
<p>TAB. 1 &#8211; Description des exemples en PLI
</p>
<p>Dans le background knowledge, les informations sur le contexte de cette occurrence, c&#8217;est-
&#224;-dire les autres mots-cl&#233;s associ&#233;s au m&#234;me article sont donn&#233;es comme illustr&#233; dans le ta-
bleau 1: la premi&#232;re ligne indique qu&#8217;un mot-cl&#233; identifi&#233; par mh16179550_1 est assign&#233; &#224; l&#8217;ar-
ticle pmid16179550 &#224; l&#8217;aide du pr&#233;dicat in_article/2 ; la deuxi&#232;me ligne indique que ce mot-cl&#233;
correspond au terme MeSH &quot;Acrylamide&quot; avec le pr&#233;dicat hierarchy/2. Enfin, la hi&#233;rarchie MeSH
est &#233;galement transcrite dans le background knowledge sous la forme :
hierarchy(W,&quot;Neuroglia&quot;) :- hierarchy(W,&quot;Astrocytes&quot;).
hierarchy(W,&quot;Nervous System&quot;) :- hierarchy(W,&quot;Neuroglia&quot;).
hierarchy(W,&quot;Anatomy&quot;) :- hierarchy(W,&quot;Nervous System&quot;).
...
Cela permet d&#8217;indiquer que le mot-cl&#233; Astrocytes est un descendant (concept plus sp&#233;cifique) du
mot-cl&#233; Neuroglia dans la hi&#233;rarchie MeSH, lui-m&#234;me descendant de Nervous System... Toutes
les informations de hi&#233;rarchie du MeSH sont ainsi exploitables par le processus d&#8217;inf&#233;rence.
</p>
<p>La phase de construction des exemples, n&#233;cessaire pour notre technique supervis&#233;e, est donc
enti&#232;rement automatique. Les r&#232;gles qui en sont inf&#233;r&#233;es manipulent les diff&#233;rents pr&#233;dicats que
nous venons de d&#233;crire. Voici un exemple de r&#232;gle qui pourrait &#234;tre inf&#233;r&#233;e &#224; partir de l&#8217;exemple
qualif(mh16179550_1,&quot;pharmacology&quot;). et qui correspond &#224; la r&#232;gle donn&#233;e en introduction :
qualif(W,&quot;pharmacology&quot;) :- hierarchy(W,&quot; Carboxylic Acids&quot;), in_article(A,W), in_article(A,W), hierar-
chy(W,&quot;Anatomy&quot;).
</p>
<p>3.3 Efficacit&#233; de l&#8217;inf&#233;rence
</p>
<p>La contrepartie &#224; l&#8217;expressivit&#233; de la PLI est la grande complexit&#233; de l&#8217;inf&#233;rence des r&#232;gles. L&#8217;es-
pace de recherche EH est g&#233;n&#233;ralement tr&#232;s grand, voire infini dans certains cas. Par ailleurs, le
calcul du score Sc repose sur le nombre d&#8217;exemples positifs et n&#233;gatifs couverts par l&#8217;hypoth&#232;se
examin&#233;e, ce qui implique de confronter tous les exemples &#224; la clause. C&#8217;est cette partie qui est
la plus co&#251;teuse en PLI. Il est donc essentiel de bien contr&#244;ler cette phase de recherche pour
s&#8217;assurer &#224; la fois d&#8217;un temps de calcul praticable et de la production de r&#232;gles pertinentes pour
notre probl&#232;me. Heureusement, EH peut &#234;tre organis&#233; et parcouru hi&#233;rarchiquement ; la relation
d&#8217;ordre usuellement utilis&#233;e est la &#952;-subsomption.
</p>
<p>D&#233;finition 1 (&#952;-subsomption) Une clause C1 &#952;-subsume une clause C2 (C1 &#23;&#952; C2) si et seule-
ment si (ssi) il existe une substitution &#952; telle que C1&#952; &#8838; C2 (en consid&#233;rant les clauses comme
des ensembles de litt&#233;raux).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. N&#233;v&#233;ol et V. Claveau
</p>
<p>Par exemple, la clause p(a, b) &#8592; r(b, a) est subsum&#233;e par la clause p(Y1, Y2) &#8592; r(Y2, Y1). En
effet, on a bien {p(Y1, Y2),&#172;r(Y2, Y1)}&#952;1 &#8838; {p(a, b),&#172;r(b, a)} avec &#952;1 = {Y1/a, Y2/b}. Gr&#226;ce
&#224; cette relation hi&#233;rarchique, l&#8217;espace peut &#234;tre g&#233;n&#233;r&#233; et explor&#233; efficacement, par exemple de
la clause la plus g&#233;n&#233;rale &#224; la plus sp&#233;cifique selon la &#952;-subsomption. &#192; partir d&#8217;une clause C1,
on peut g&#233;n&#233;rer des clauses plus sp&#233;cifiques qui ont notamment pour propri&#233;t&#233; de ne couvrir
que des sous-ensembles des exemples couverts par C1. Le calcul du score des clauses plus
sp&#233;cifiques que C1 s&#8217;en trouve grandement acc&#233;l&#233;r&#233;. De m&#234;me, on peut &#233;viter de g&#233;n&#233;rer une
clause que l&#8217;on consid&#232;re comme ne couvrant pas assez d&#8217;exemples d&#232;s lors que son anc&#234;tre ne
couvre lui-m&#234;me pas assez d&#8217;exemples.
</p>
<p>Cependant, la &#952;-subsomption n&#8217;est pas parfaitement adapt&#233;e &#224; notre probl&#232;me car la hi&#233;rar-
chie entre termes MeSH n&#8217;est pas prise en compte. Ainsi, la clause qualif(W1,&quot;genetics&quot;) :-
in_article(A,W1), in_article(A,W2), hierarchy(W2,&quot;Frameshift Mutation&quot;) n&#8217;est pas subsum&#233;e par qua-
lif(W1,&quot;genetics&quot;) :- in_article(A,W1), in_article(A,W2), hierarchy(W2,&quot;Mutation&quot;) bien que Mutation
soit un anc&#234;tre de Frameshift Mutation dans la hi&#233;rarchie MeSH. Nous proposons donc une
autre notion de subsomption en nous inspirant des travaux de Buntine (1988) :
</p>
<p>D&#233;finition 2 Une clause C1 &#952;hier-subsume une clause C2 (C1 &#23;hier C2) relativement au
background knowledge B ssi il existe une substitution &#952; et une fonction fD telles que
fD(C)&#952; &#8838; D, o&#249; fD est telle que &#8704;l &#8712; C, B, fD(l) |= l, avec fD({l1, l2, ..., lm}) signifiant
{fD(l1), fD(l2), ..., fD(lm)}.
</p>
<p>La fonction f permet donc de prendre en compte les informations du background knowledge,
c&#8217;est-&#224;-dire l&#8217;organisation hi&#233;rarchique des mots-cl&#233;s du MeSH. Cette subsomption, que nous
avons mise en &#339;uvre en modifiant ALEPH, est coh&#233;rente avec la notion de couverture. Il est
ais&#233; de montrer qu&#8217;elle induit un ordre partiel entre les clauses et structure donc l&#8217;espace EH en
treillis, ce qui facilitera son parcours. Parfaitement adapt&#233;e &#224; notre probl&#232;me, elle va nous per-
mettre d&#8217;inf&#233;rer efficacement des r&#232;gles d&#8217;indexation &#224; partir de grandes quantit&#233;s d&#8217;exemples
et contre-exemples (cf. section 5) en &#233;vitant l&#8217;impasse calculatoire qui aurait consist&#233; &#224; consi-
d&#233;rer ind&#233;pendamment les 24 000 mots-cl&#233;s du MeSH. Il est int&#233;ressant de noter que cette
subsomption est en fait adapt&#233;e &#224; tous les probl&#232;mes de recherche de r&#233;gularit&#233;s impliquant des
connaissances structur&#233;es (e.g. ontologies).
</p>
<p>4 Contexte exp&#233;rimental
</p>
<p>4.1 Base de comparaison
</p>
<p>Comme nous l&#8217;avons expliqu&#233;, les m&#233;thodes simples de recherche de r&#232;gles d&#8217;association ne
peuvent pas traiter directement nos donn&#233;es. Pour n&#233;anmoins donner une base de comparaison
aux performances de notre approche, nous impl&#233;mentons une simple baseline. Celle-ci consiste
&#224; former al&#233;atoirement des paires mot-cl&#233;/qualificatif en respectant la distribution statistique
de l&#8217;ensemble des paires dans la base MEDLINE. Ainsi, nous avons estim&#233; que la probabilit&#233;
d&#8217;apparition P d&#8217;une paire mot-cl&#233;/qualificatif &#233;tait &#233;gale au nombre d&#8217;occurrences de cette
paire dans MEDLINE divis&#233; par le nombre total d&#8217;occurrences du mot-cl&#233; dans MEDLINE, qu&#8217;il
soit affili&#233; &#224; un qualificatif ou non. Le tableau 2 pr&#233;sente par exemple la distribution compl&#232;te
du mot-cl&#233; Irritable Mood et un extrait de la distribution du mot-cl&#233; Lung.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage de r&#232;gles d&#8217;indexation
</p>
<p>Irritable Mood Lung (extrait)
5 qualificatifs affiliables 26 qualificatifs affiliables
Qualificatif P Qualificatif P
sans qualificatif 0.758 sans qualificatif 0.047
classification 0.008 classification 0
drug effect 0.129 drug effect 0.082
ethics 0 metabolism 0.117
physiology 0.101 pathology 0.171
radiation effect 0.004 radiation effect 0.011
</p>
<p>TAB. 2 &#8211; Extrait de la distribution des descripteurs MeSH dans MEDLINE
</p>
<p>4.2 Corpus de travail
</p>
<p>Pour l&#8217;apprentissage des r&#232;gles par PLI, nous avons utilis&#233; un corpus compos&#233; de 100 000 cita-
tions choisies al&#233;atoirement parmi celles ajout&#233;es &#224; la base MEDLINE en 2006. Pour la m&#233;thode
baseline, nous avons utilis&#233; les 15 433 668 citations contenues dans la base MEDLINE fin 20053
</p>
<p>afin de calculer la distribution statistique des paires de descripteurs MeSH. Finalement, nous
avons &#233;galement utilis&#233; un corpus de test compos&#233; de 100 000 citations choisies al&#233;atoirement
parmi celles ajout&#233;es &#224; la base MEDLINE en 2006. Ce corpus est enti&#232;rement disjoint des deux
corpus d&#8217;apprentissage mentionn&#233;s ci-dessus.
</p>
<p>4.3 &#201;valuation des r&#232;gles obtenues dans un contexte r&#233;el
</p>
<p>En pratique, on voit d&#8217;apr&#232;s l&#8217;exemple de r&#232;gle d&#8217;indexation donn&#233; en introduction que des
mots-cl&#233;s isol&#233;s servent de point de d&#233;part &#224; la recommandation de paires. Pour l&#8217;anglais, le
logiciel MTI (Aronson et al., 2004) d&#233;velopp&#233; &#224; la NLM permet de g&#233;n&#233;rer automatiquement
des recommandations d&#8217;indexation pour des mots-cl&#233;s isol&#233;s. Il faut remarquer que les mots-
cl&#233;s recommand&#233;s par MTI ont, sur le corpus de test, un rappel de 45 % par rapport aux termes
s&#233;lectionn&#233;s par les indexeurs MEDLINE. Ainsi, un &#233;cart est attendu entre les performances
th&#233;oriques des r&#232;gles d&#8217;indexation obtenues par PLI et les performances obtenues &#224; partir de
l&#8217;application de ces m&#234;mes r&#232;gles sur les mots-cl&#233;s isol&#233;s recommand&#233;s par MTI, c&#8217;est-&#224;-dire
dans un environnement pratique d&#8217;indexation automatique. Les r&#232;gles d&#8217;indexation obtenues
par PLI sont &#233;valu&#233;es sur le corpus de test, l&#8217;indexation MEDLINE servant de r&#233;f&#233;rence. Ces
performances sont compar&#233;es &#224; celles de r&#232;gles d&#8217;indexation similaires obtenues manuellement
par un expert du domaine et &#224; celles de la baseline d&#233;crite en 4.1.
</p>
<p>Pour chacune des m&#233;thodes (PLI, manuelle, baseline) seules les paires constitu&#233;es &#224; partir
de mots-cl&#233;s extraits par MTI et figurant dans MEDLINE sont prises en compte. Les mesures
de performances utilis&#233;es sont la pr&#233;cision, le rappel et la F-mesure. La pr&#233;cision correspond
au nombre de paires mot-cl&#233;/qualificatif recommand&#233;es utilis&#233;es dans MEDLINE divis&#233; par le
nombre total de paires recommand&#233;es. Le rappel correspond au nombre de paires recomman-
d&#233;es utilis&#233;es dans MEDLINE divis&#233; par le nombre total de paires figurant dans l&#8217;indexation
MEDLINE. La F-mesure correspond &#224; la moyenne harmonique de la pr&#233;cision et du rappel.
</p>
<p>3Voir http://mbr.nlm.nih.gov/Reference/medline_Baseline_Repository_Detail.
pdf pour plus de d&#233;tails</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. N&#233;v&#233;ol et V. Claveau
</p>
<p>5 R&#233;sultats
</p>
<p>Nous ne pr&#233;sentons ici que les r&#233;sultats obtenus sur quelques qualificatifs, notamment ceux
pour lesquels il existe des r&#232;gles manuelles qui nous permettent d&#8217;effectuer une comparaison.
Ces r&#233;sultats sont discut&#233;s dans la section suivante.
</p>
<p>Le tableau 3 pr&#233;sente les performances th&#233;oriques obtenues en appliquant les r&#232;gles PLI sur les
mots cl&#233;s contenus dans les notices MEDLINE. Nous indiquons &#233;galement les temps de calcul
obtenus sur une machine de bureau (linux Intel Xeon 3 GHz) au regard du nombre d&#8217;exemples
utilis&#233;s.
</p>
<p>Qualificatif |E+| |E&#8722;| Temps de Pr&#233;cision Rappel F-mesure
calcul (%) (%) (%)
</p>
<p>Administration &amp; dosage 5 300 40 000 75 mn 41.4 53 46.5
Metabolism 4 500 21 000 37 mn 42.4 60.2 49.7
Pharmacology 5 000 22 000 45 mn 48.8 53.9 51.2
Physiology 5 200 34 000 46 mn 41.4 41.5 41.5
</p>
<p>TAB. 3 &#8211; Performance de l&#8217;inf&#233;rence de r&#232;gles par PLI sur les notices compl&#232;tes
</p>
<p>Le tableau 4 pr&#233;sente les performances sur le corpus de test des r&#232;gles obtenues par apprentis-
sage, compar&#233;es aux r&#232;gles manuelles et &#224; la baseline dans le cas o&#249; les mots-cl&#233;s sont extraits
automatiquement par MTI.
</p>
<p>Qualificatif M&#233;thode Nb. r&#232;gles Pr&#233;cision (%) Rappel(%) F-mesure(%)
Administration PLI 166 38 29 33
&amp; dosage Manuelle 1 54 1 1
</p>
<p>Baseline - 26 9 13
Metabolism PLI 134 49 38 43
</p>
<p>Manuelle 61 58 20 30
Baseline - 37 12 18
</p>
<p>Pharmacology PLI 217 47 28 35
Manuelle 7 67 3 5
Baseline - 28 12 17
</p>
<p>Physiology PLI 70 46 24 32
Manuelle 0 - - -
Baseline - 28 10 15
</p>
<p>TAB. 4 &#8211; Performance des m&#233;thodes sur le corpus de test en conjonction avec MTI
</p>
<p>6 Discussion
</p>
<p>Performances. Comme attendu, l&#8217;utilisation de l&#8217;outil MTI pour produire dans un premier
temps des recommandations de mots-cl&#233;s fait que le rappel en situation r&#233;elle des r&#232;gles inf&#233;-
r&#233;es par PLI est inf&#233;rieur &#224; celui mesur&#233; sur les notices. Malgr&#233; cela, les performances des r&#232;gles
PLI sont bien sup&#233;rieures &#224; celles de la baseline et produisent toujours la meilleure F-mesure</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Apprentissage de r&#232;gles d&#8217;indexation
</p>
<p>avec une diff&#233;rence de pr&#233;cision mod&#233;r&#233;e par rapport aux r&#232;gles manuelles. Ces derni&#232;res sont
beaucoup plus cibl&#233;es, ce qui produit de tr&#232;s bons taux de pr&#233;cision mais des rappels g&#233;n&#233;ra-
lement faibles, inf&#233;rieurs non seulement &#224; la PLI mais aussi &#224; la baseline (sauf dans le cas de
metabolism). Dans le cadre d&#8217;une utilisation combin&#233;e avec d&#8217;autres m&#233;thodes d&#8217;indexation, il
est probable que le gain significatif en rappel apport&#233; par les r&#232;gles PLI contribue &#224; une am&#233;lio-
ration globale du rappel des recommandations sans perte de pr&#233;cision. Par ailleurs, gr&#226;ce &#224; notre
notion de subsomption adapt&#233;e au probl&#232;me, les temps de calcul de la phase d&#8217;inf&#233;rence sont
tout &#224; fait raisonnables, notamment au regard des temps de d&#233;veloppement de r&#232;gles manuelles.
Sans la modification de subsomption, des exp&#233;riences pr&#233;liminaires ont montr&#233; que la PLI ne
pouvait gu&#232;re manipuler ces quantit&#233;s d&#8217;information (temps de calcul d&#233;passant plusieurs jours,
d&#233;passement m&#233;moire).
</p>
<p>R&#232;gles PLI vs. manuelles. Avec les modifications apport&#233;es, la PLI permet donc d&#8217;obtenir rapi-
dement un grand nombre de r&#232;gles. En examinant ces r&#232;gles, il appara&#238;t parfois que des r&#232;gles un
peu diff&#233;rentes obtenant des performances proches semblent s&#233;mantiquement meilleures pour
un expert du domaine. De m&#234;me, certaines r&#232;gles PLI peuvent permettre &#224; un expert de cr&#233;er ma-
nuellement une nouvelle r&#232;gle qui n&#8217;aurait pas pu &#234;tre inf&#233;r&#233;e &#224; partir du corpus d&#8217;entra&#238;nement.
Ainsi, il pourrait &#234;tre possible d&#8217;optimiser la production de r&#232;gles d&#8217;indexation en envisageant
une relecture des r&#232;gles PLI par un expert afin d&#8217;am&#233;liorer la lisibilit&#233; et les performances des
r&#232;gles tout en minimisant le temps pass&#233; &#224; la production des r&#232;gles.
</p>
<p>MTI. Outre la baisse globale de rappel observ&#233;e avec l&#8217;application des r&#232;gles PLI sur les mots-
cl&#233;s extraits par MTI, on constate en observant les performances individuelles de chaque r&#232;gle
que les variations sont h&#233;t&#233;rog&#232;nes en fonction des mots-cl&#233;s mis en jeu ; ce qui refl&#232;te les
performances de MTI pour l&#8217;extraction des mots-cl&#233;s. Ainsi, il est envisageable de filtrer auto-
matiquement les r&#232;gles les moins performantes dans notre cadre applicatif pr&#233;cis.
</p>
<p>7 Conclusion et perspectives
</p>
<p>Nous avons montr&#233; qu&#8217;il &#233;tait possible d&#8217;exploiter des r&#233;gularit&#233;s dans les descriptions des
articles biom&#233;dicaux index&#233;s dans MEDLINE pour proposer automatiquement des qualificatifs
&#224; affilier aux mots-cl&#233;s lors du traitement d&#8217;un nouvel article. L&#8217;automatisation de cette t&#226;che
jusqu&#8217;alors manuelle &#8212; probl&#232;me peu abord&#233; auparavant &#8212; a &#233;t&#233; possible par l&#8217;utilisation
de la PLI et sa capacit&#233; &#224; g&#233;rer des probl&#232;mes impliquant des repr&#233;sentations complexes. Il a
n&#233;anmoins &#233;t&#233; n&#233;cessaire d&#8217;impl&#233;menter une notion de subsomption entre clauses permettant de
prendre en compte les sp&#233;cificit&#233;s de la t&#226;che ; cela nous a permis d&#8217;obtenir des temps de calcul
praticables tout en traitant un nombre de donn&#233;es suffisamment important pour obtenir des
r&#233;sultats fiables. Cette approche est d&#8217;ailleurs transposable &#224; d&#8217;autres probl&#232;mes impliquant des
recherche de r&#233;gularit&#233;s dans des connaissances organis&#233;es (th&#233;saurus, ontologies...). Enfin, ces
r&#233;sultats sont d&#8217;autant plus remarquables qu&#8217;ils n&#8217;exploitent que des r&#233;gularit&#233;s implicites des
descriptions et non le contenu de l&#8217;article et permettent ainsi d&#8217;envisager l&#8217;utilisation d&#8217;autres
strat&#233;gies de recommandations de qualificatifs bas&#233;es cette fois sur le corps de l&#8217;article &#224; indexer.
</p>
<p>Plusieurs perspectives sont envisag&#233;es &#224; la suite de ce travail. Tout d&#8217;abord, il sera n&#233;cessaire de
l&#8217;&#233;tendre &#224; l&#8217;ensemble des 83 qualificatifs afin d&#8217;obtenir un jeu complet de r&#232;gles d&#8217;indexation.
Par ailleurs, nous envisageons une am&#233;lioration des performances et de la lisibilit&#233; gr&#226;ce &#224; un
filtrage automatique ou &#224; une relecture manuelle comme indiqu&#233; en 6. Enfin, nous anticipons
l&#8217;int&#233;gration du jeu de r&#232;gles obtenues au module d&#8217;affiliation de qualificatifs de MTI.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>A. N&#233;v&#233;ol et V. Claveau
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; effectu&#233; dans le cadre de la participation d&#8217;A. N&#233;v&#233;ol au programme de re-
cherche postdoctorale de la National Library of Medicine administr&#233; par ORISE. Les auteurs
remercient A. Aronson, J. Mork et S. Shooshan pour de nombreuses discussions sur les aspects
th&#233;oriques et techniques de cette &#233;tude.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AGRAWAL R., IMIELINSKI T. &amp; SWAMI A. (1993). Mining association rules between sets of
items in large databases. In Proceedings of the SIGMOD Conference, Washington, &#201;tats-Unis.
</p>
<p>ARONSON A. R., MORK J. G., GAY C. W., HUMPHREY S. M. &amp; ROGERS W. J. (2004).
The nlm indexing initiative&#8217;s medical text indexer. In Proc. Medinfo 2004, p. 268&#8211;272.
</p>
<p>BUNTINE W. L. (1988). Generalized Subsumption and its Application to Induction and Re-
dundancy. Artificial Intelligence, 36, 375&#8211;399.
CLAVEAU V., S&#201;BILLOT P., FABRE C. &amp; BOUILLON P. (2003). Learning semantic lexicons
from a part-of-speech and semantically tagged corpus using inductive logic programming.
Journal of Machine Learning Research (JMLR), special issue on ILP, 4, 493&#8211;525.
J. CUSSENS &amp; S. D&#381;EROSKI, Eds. (2000). Learning Language in Logic. Lecture Notes in
Artificial Intelligence. Sringer Verlag.
</p>
<p>LIN J. &amp; WILBUR W. J. (2007). PubMed related articles: a probabilistic topic-based model
for content similarity. BMC Bioinformatics, 8(1), 423.
MARK&#211; K., DAUMKE P., SCHULZ S. &amp; HAHN U. (2003). Cross-language MeSH indexing
using morpho-semantic normalization. In Actes de AMIA Symp. 2003, p. 425&#8211;429.
</p>
<p>MUGGLETON S. &amp; RAEDT L. D. (1994). Inductive logic programming: Theory and methods.
Journal of Logic Programming, 19/20, 629&#8211;679.
N&#201;V&#201;OL A., ROGOZAN A. &amp; DARMONI S. J. (2006). Automatic indexing of online health
resources for a french quality controlled gateway. Information Processing and Management,
p. 695&#8211;709.
</p>
<p>N&#201;V&#201;OL A., SHOOSHAN S. E., RINDFLESH T. C. &amp; ARONSON A. R. (2007). Multiple
approaches to fine-grained indexing of the biomedical literature. In Actes de PSB 2007, p.
292&#8211;303.
</p>
<p>OZDOWSKA S. &amp; CLAVEAU V. (2006). Inf&#233;rence de r&#232;gles de propagation syntaxique pour
l&#8217;alignement de mots. TAL (Traitement Automatique des Langues), 47(1), 167&#8211;186.
RAK R., KURGAN L. A. &amp; REFORMAT M. (2007). Multilabel associative classification
categorization of MEDLINE articles into MeSH keywords. IEEE Eng Med Biol Mag, 2(26),
47&#8211;55.
</p>
<p>SOUALMIA L. F. (2004). &#201;tude et &#233;valuation d&#8217;approches multiples de projection de requ&#234;tes
pour une recherche d&#8217;information intelligente. Application au domaine de la Sant&#233; sur l&#8217;Inter-
net. Th&#232;se de doctorat, INSA de Rouen.
</p>
<p>SRINIVASAN A. (2001). The ALEPH manual. Machine Learning at the Computing Laboratory,
Oxford University.</p>

</div></div>
</body></html>