<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un mod&#232;le de langage pour le DHM : la Grammaire S&#233;mantique R&#233;versible</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>La Grammaire S&#233;mantique R&#233;versible 
</p>
<p>Un mod&#232;le de langage pour le DHM : 
la Grammaire S&#233;mantique R&#233;versible 
</p>
<p>J&#233;r&#244;me Lehuen 
</p>
<p>LIUM - Universit&#233; du Maine 
Avenue La&#235;nnec, 72085 Le Mans Cedex 9 
</p>
<p>Jerome.Lehuen@lium.univ-lemans.fr 
</p>
<p>R&#233;sum&#233; Cet article propose un mod&#232;le de langage d&#233;di&#233; au dialogue homme-machine, ain-
si que des algorithmes d&#8217;analyse et de g&#233;n&#233;ration. L&#8217;originalit&#233; de notre approche est de faire 
reposer l&#8217;analyse et la g&#233;n&#233;ration sur les m&#234;mes connaissances, essentiellement  s&#233;mantiques. 
Celles-ci sont structur&#233;es sous la forme d&#8217;une biblioth&#232;que de concepts, et de formes d&#8217;usage 
associ&#233;es aux concepts. Les algorithmes, quant &#224; eux, sont fond&#233;s sur un double principe de 
correspondance entre des offres et des attentes, et d&#8217;un calcul heuristique de score. 
</p>
<p>Abstract In this paper we present a language model for man-machine dialogue, as well as 
algorithms for analysis and text generation. The originality of our approach is to base analysis 
and generation on the same knowledge. These one is structured like a library of concepts and 
syntactic patterns. The algorithms are based on a principle of correspondence between offers 
and expectations, and calculation of a heuristic scoring. 
</p>
<p>Mots-cl&#233;s : Grammaire S&#233;mantique, R&#233;versibilit&#233;, Analyse, G&#233;n&#233;ration, Dialogue. 
Keywords : Semantic Grammar, Reversibility, Analysis, Generation, Dialogue. 
</p>
<p>1 Introduction 
La finalit&#233; de la recherche en dialogue homme-machine (DHM) est de permettre aux syst&#232;mes 
informatiques d&#8217;interagir avec leurs utilisateurs selon des modalit&#233;s proches de celles utilis&#233;es 
dans les interactions humaines, en particulier la modalit&#233; verbale. Dans cette optique, les th&#233;o-
ries et mod&#232;les en TAL sont convoqu&#233;s car ils ont pour vocation de d&#233;crire la structure et la 
fonction des productions langagi&#232;res. Or, il se trouve que le TAL s&#8217;est longtemps focalis&#233; sur 
l&#8217;analyse de textes, selon une approche essentiellement monologique, tant du c&#244;t&#233; des niveaux 
de traitements (morphologie, syntaxe, s&#233;mantique, pragmatique), que des applications vis&#233;es 
(correction, indexation, r&#233;sum&#233;, traduction). Anne Nicolle &#233;crit dans (Nicolle, 2006) que la 
difficult&#233; principale du DHM vient du monologisme de l&#8217;interface [&#8230;] avec une vision du dia-
logue comme succession d&#8217;&#233;nonc&#233;s autosuffisants, sur le mod&#232;le de l&#8217;&#233;crit. Daniel Luzzati 
constate dans (Luzzati, 2006) l&#8217;inad&#233;quation des grammaires actuelles construites &#224; partir de 
donn&#233;es sans rapport avec les productions dialogiques. D&#8217;un c&#244;t&#233;, on trouve des descriptions 
qui ne correspondent que rarement &#224; des exemples de langue en interaction. De l&#8217;autre c&#244;t&#233;, 
on a des th&#233;ories de l&#8217;interaction, fortement descendantes, qui ne rencontrent que rarement la 
parole. De plus, la morphosyntaxe du dialogue est approximative. M&#234;me le concept de phrase 
est remis en question : en dialogue, on produit des &#233;nonc&#233;s dont la compl&#233;tude ne peut se me-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEROME LEHUEN 
</p>
<p>surer qu&#8217;en termes d&#8217;efficacit&#233; interactive (Luzzati, 2006). Ils comportent des bruits, des h&#233;si-
tations, des disfluences, des inattendus structurels. C&#8217;est une langue par essence difficile, 
voire impossible &#224; d&#233;crire de fa&#231;on exhaustive, qui se d&#233;finit par sa spontan&#233;it&#233; et par sa va-
riabilit&#233;. Par ailleurs, les syst&#232;mes de DHM dissocient souvent les aspects interpr&#233;tation et 
g&#233;n&#233;ration. Cette dichotomie n&#8217;est pas r&#233;dhibitoire : la g&#233;n&#233;ration des &#233;nonc&#233;s de la machine 
est moins probl&#233;matique que l&#8217;analyse des &#233;nonc&#233;s de l&#8217;usager, puisqu&#8217;on peut d&#233;terminer un 
champ lexical et des formes d&#8217;usage en fonction d&#8217;une application vis&#233;e. Cela dit, comme &#224; 
d&#8217;autres auteurs (Gertjan, 1993) (Dymetman, 1994), il nous est apparu int&#233;ressant de mutuali-
ser les connaissances de l&#8217;analyse et de la g&#233;n&#233;ration, le syst&#232;me &#233;tant en mesure de dire ce 
qu&#8217;il comprend et de comprendre ce qu&#8217;il dit. Cette capacit&#233; n&#8217;est pas neutre. Tout d&#8217;abord, 
elle permet des citations et reformulations des &#233;nonc&#233;s de l&#8217;usager par la machine. Ensuite, 
elle rend possible une forme de r&#233;flexivit&#233; de l&#8217;activit&#233; langagi&#232;re de la machine, ce qui lui 
permet potentiellement de s&#8217;autocontr&#244;ler au cours des phases de g&#233;n&#233;ration. Enfin, elle per-
met d&#8217;envisager des &#233;volutions conjointes de ces deux comp&#233;tences d&#232;s lors que les connais-
sances &#233;voluent, par intervention ext&#233;rieure ou par apprentissage automatique. 
</p>
<p>Partant de ces consid&#233;rations, nous d&#233;veloppons actuellement le moteur de dialogue YADE, 
construit autour d&#8217;un mod&#232;le de langage adapt&#233; &#224; la probl&#233;matique du DHM. Ce mod&#232;le 
&#171; orient&#233; connaissances &#187; associe une s&#233;mantique lexicale et des biblioth&#232;ques de formes 
d&#8217;usage utilisables en analyse comme en g&#233;n&#233;ration. Les algorithmes d&#8217;analyse et de g&#233;n&#233;ra-
tion fonctionnent de fa&#231;on opportuniste. Ils ne sont pas fond&#233;s sur des principes d&#8217;unification 
et de contraintes mais sur des principes de d&#233;pendances et de score. L&#8217;utilisation conjointe 
d&#8217;une syntaxe partielle/rel&#226;ch&#233;e et d&#8217;une s&#233;mantique lexicale a d&#233;j&#224; &#233;t&#233; explor&#233;e, notamment 
par (Goulian, Antoine, 2001). La sp&#233;cificit&#233; de notre approche tient essentiellement dans la 
r&#233;versibilit&#233;, laquelle conditionne le mod&#232;le des connaissances et les algorithmes. La mise en 
&#339;uvre d&#8217;une grammaire r&#233;versible en g&#233;n&#233;ration est &#233;galement explor&#233;e dans (Gardent, Kow, 
2007) : le g&#233;n&#233;rateur GENI combine un algorithme non-d&#233;terministe et un m&#233;canisme de s&#233;-
lection des paraphrases. La diff&#233;rence avec notre proposition r&#233;side dans le mod&#232;le de langage 
et dans les crit&#232;res de d&#233;terminisation. GENI exploite une grammaire d&#8217;arbres adjoints, bas&#233;e 
sur l&#8217;unification, alors que YADE utilise une grammaire essentiellement s&#233;mantique. 
</p>
<p>Le moteur de dialogue YADE est architectur&#233; selon quatre niveaux (cf. Fig. 1) dont les trois 
premiers (langage, dialogue et t&#226;che interactive) communiquent via une m&#233;moire de travail 
commune, un peu &#224; la fa&#231;on des architectures de type &#171; tableau noir &#187;. Cet article se focalise 
sur le niveau langagier qui impl&#233;mente la Grammaire S&#233;mantique R&#233;versible (GSR). La pre-
mi&#232;re partie d&#233;crit le mod&#232;le de langage (repr&#233;sentations et connaissances), la seconde partie 
pr&#233;sente les algorithmes d&#8217;analyse et de g&#233;n&#233;ration, ainsi que quelques exemples. 
</p>
<p> 
Figure 1 : Architecture du moteur de dialogue YADE </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La Grammaire S&#233;mantique R&#233;versible 
</p>
<p>2 Le mod&#232;le de langage de la GSR 
Cette partie pr&#233;sente d&#8217;abord le mod&#232;le de repr&#233;sentation des &#233;nonc&#233;s (de l&#8217;usager et de la 
machine), puis le formalisme &#171; orient&#233; connaissances &#187; qui permet de passer d&#8217;une cha&#238;ne de 
caract&#232;res &#224; une repr&#233;sentation exploitable par le moteur de dialogue et inversement. Ces 
repr&#233;sentations sont centrales dans notre proposition car elles sont communes aux modules 
d&#8217;analyse, de g&#233;n&#233;ration, et de dialogue. 
</p>
<p>2.1 Repr&#233;sentation des &#233;nonc&#233;s 
En DHM, il s&#8217;agit d&#8217;obtenir, &#224; partir d&#8217;&#233;nonc&#233;s relativement courts, des repr&#233;sentations qui 
permettent de d&#233;clencher des m&#233;canismes cognitifs, en rapport avec une t&#226;che donn&#233;e ou avec 
le dialogue lui-m&#234;me. &#192; moins d&#8217;&#234;tre une &#233;tape n&#233;cessaire, une repr&#233;sentation syntagmatique 
n&#8217;est d&#8217;aucune utilit&#233;. Enfin, nous souhaitions pouvoir passer d&#8217;un &#233;nonc&#233; &#224; sa repr&#233;sentation 
et inversement sans avoir &#224; convoquer des mod&#233;lisations morphosyntaxiques subtiles. Partant 
de ces objectifs et contraintes, nous avons opt&#233; pour un formalisme fortement inspir&#233; des 
grammaires de d&#233;pendance (Tesni&#232;re, 1959) mais r&#233;solument orient&#233; vers la s&#233;mantique. La 
repr&#233;sentation d&#8217;un &#233;nonc&#233; consiste en un graphe de relations qui couvre les mots ou expres-
sions significatives par rapport au contexte applicatif et/ou dialogique. Les n&#339;uds du graphe 
(appel&#233;s granules) sont des concepts instanci&#233;s dans le double contexte de l&#8217;&#233;nonc&#233; et du dia-
logue. Les granules sont identifi&#233;s par leur concept, une cat&#233;gorie s&#233;mantique ou pragmatique 
indiquant son r&#244;le dans la structure ou dans l&#8217;interaction, et un num&#233;ro d&#8217;instanciation. 
</p>
<p>Par exemple, l&#8217;analyse de l&#8217;&#233;nonc&#233; &#171; Bonjour, je voudrais une baguette bien cuite s&#8217;il vous 
pla&#238;t &#187; produit trois granules-racines : ouverture:SALUER#1, demande:DEMANDER#6 et 
politesse:SVP#4 (cf. Fig. 2). Le choix des concepts et des cat&#233;gories ne d&#233;pend pas du mo-
d&#232;le : il rel&#232;ve d&#8217;un travail d&#8217;ing&#233;nierie des connaissances &#224; partir d&#8217;un domaine d&#8217;application 
et &#233;ventuellement d&#8217;un corpus de dialogue. 
</p>
<p> 
Figure 2 : Structure de d&#233;pendances produite par la GSR 
</p>
<p>2.2 Repr&#233;sentation des connaissances 
Le mod&#232;le des connaissances est construit autour de la notion de concept. Un concept repr&#233;-
sente un objet, une action, la valeur d&#8217;un attribut, etc. Il poss&#232;de des propri&#233;t&#233;s qui permettent, 
d&#8217;une part de le distinguer des autres concepts, d&#8217;autre part de le relier &#224; d&#8217;autres concepts 
dans le cadre de l&#8217;application vis&#233;e. Un concept est caract&#233;ris&#233; par des offres, des attentes, et 
des formes d&#8217;usage (cf. Fig. 3). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEROME LEHUEN 
</p>
<p> 
Figure 3 : Mod&#232;le de concept de valence 2 
</p>
<p>Les descripteurs des offres sont des cat&#233;gories ou des traits s&#233;mantiques (Katz, Fodor, 1963). 
Le mod&#232;le ne pr&#233;suppose pas la fa&#231;on dont les traits sont d&#233;termin&#233;s : soit &#224; partir de condi-
tions n&#233;cessaires et suffisantes (et nous obtenons une collection de concepts autosuffisants), 
soit &#224; partir de diff&#233;rences entre concepts (et nous obtenons une structure relationnelle de 
concepts). Cette distinction, explor&#233;e dans (Nicolle et al., 2001), ne fait pas l&#8217;objet de cet arti-
cle. Les attentes, qui sont d&#233;crites dans les m&#234;mes termes que les offres, caract&#233;risent des ac-
tants, des circonstants, des modifieurs, des attributs. Les attentes ne sont pas obligatoires, elles 
participent &#224; la description du concept en d&#233;crivant les liaisons potentielles entre granules. 
Enfin, un concept est associ&#233; &#224; un catalogue de formes d&#8217;usage. Les formes d&#8217;usage sont des 
structures de surface compos&#233;es de mots et de r&#233;f&#233;rences aux attentes du concept. Elles sont 
associ&#233;es &#224; des traits pragmatiques et/ou morphologiques qui permettent de caract&#233;riser fine-
ment les formulations de l&#8217;usager pour un m&#234;me acte de langage (type de langage, politesse, 
force illocutoire, etc.). La multiplication des formes d&#8217;usage engendre une certaine variabilit&#233; 
en interpr&#233;tation ou pour la g&#233;n&#233;ration des &#233;nonc&#233;s de la machine. Nous avons choisi 
d&#8217;int&#233;grer les variations morphologiques (genre et nombre) dans les formes (codage full-form) 
pour faire l&#8217;&#233;conomie de traitements morphologiques en analyse, et surtout en g&#233;n&#233;ration. 
C&#8217;est la raison pour laquelle des traits morphologiques sont combin&#233;s aux traits pragmatiques. 
&lt;concept nom=&quot;DEMANDER&quot; offres=&quot;action demande&quot;&gt; 
 
 &lt;attente code=&quot;A1&quot; cat&#233;gories=&quot;demandable&quot; 
</p>
<p>                   description=&quot;l'objet de la demande&quot; 
                   question=&quot;que d&#233;sirez-vous ?&quot;/&gt; 
 
&lt;syntaxe traits=&quot;familier&quot;&gt;file-moi A1&lt;/syntaxe&gt; 
</p>
<p> &lt;syntaxe traits=&quot;normal&quot;&gt;je voudrais A1&lt;/syntaxe&gt; 
&lt;syntaxe traits=&quot;normal&quot;&gt;avez-vous A1&lt;/syntaxe&gt; 
</p>
<p> &lt;syntaxe traits=&quot;soutenu&quot;&gt;puis-je avoir A1&lt;/syntaxe&gt; 
&lt;syntaxe traits=&quot;assertion rpv&quot;&gt;vous d&#233;sirez A1&lt;/syntaxe&gt; 
&lt;syntaxe traits=&quot;v&#233;rification rpv&quot;&gt;c&#8217;est bien A1 que vous d&#233;sirez ?&lt;/syntaxe&gt; 
</p>
<p>&lt;/concept&gt; 
 
&lt;concept nom=&quot;BAGUETTE&quot; offres=&quot;objet demandable&quot;&gt; 
 
 &lt;attente code=&quot;A1&quot; cat&#233;gories=&quot;quantit&#233;&quot; 
                    description=&quot;la quantit&#233;&quot; 
</p>
<p>                   question=&quot;combien de baguettes d&#233;sirez-vous ?&quot;/&gt; 
 &lt;attente code=&quot;A2&quot; cat&#233;gories=&quot;cuisson&quot; 
                    description=&quot;la cuisson&quot; 
</p>
<p>                   question=&quot;quelle cuisson souhaitez-vous ?&quot;/&gt; 
 
</p>
<p> &lt;syntaxe traits=&quot;f&#233;minin singulier&quot;&gt;A1 baguette A2&lt;/syntaxe&gt; 
 &lt;syntaxe traits=&quot;f&#233;minin pluriel&quot;&gt;A1 baguettes A2&lt;/syntaxe&gt; 
&lt;/concept&gt; 
</p>
<p>Tableau 1 : Fragment d&#8217;une base de connaissances cod&#233;e en XML </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La Grammaire S&#233;mantique R&#233;versible 
</p>
<p>La constitution d&#8217;une base de connaissances d&#233;di&#233;e repr&#233;sente un important travail, m&#234;me s&#8217;il 
est envisageable de r&#233;utiliser des &#171; connaissances g&#233;n&#233;rales &#187; d&#8217;une application &#224; l&#8217;autre, que 
ce soit au niveau de l&#8217;ontologie (contribution de l&#8217;ing&#233;nierie des connaissances) ou au niveau 
des formes d&#8217;usage (contribution de la linguistique). Parall&#232;lement &#224; notre d&#233;marche, et non 
sans rapports avec celle-ci, a &#233;t&#233; d&#233;velopp&#233;e la Grammaire Interactive (cf. &#167; 2.3). Cette der-
ni&#232;re peut constituer une r&#233;ponse au probl&#232;me de la syst&#233;matisation de la constitution des 
formes d&#8217;usage de la GSR, avec un point de vue linguistique et dialogique. 
</p>
<p>2.3 GSR et Grammaire Interactive 
L&#8217;objectif de la Grammaire Interactive (Luzzati, 2007) est d&#8217;aborder la morphosyntaxe avec 
un point de vue r&#233;solument dialogique : la morphosyntaxe d&#8217;une question se justifie par 
l&#8217;existence d&#8217;une r&#233;ponse pr&#233;suppos&#233;e ou escompt&#233;e, &#224; laquelle les interactants adh&#232;rent ou 
dont ils se d&#233;marquent. Le principe consiste &#224; faire varier une formulation prototypique selon 
des paradigmes qui d&#233;pendent ou non du type et du th&#232;me de l&#8217;&#233;nonc&#233;. La combinatoire des 
crit&#232;res identifi&#233;s g&#233;n&#232;re une table &#224; n dimensions qu&#8217;il s&#8217;agit de remplir. Par exemple, pour 
les questions quantificatrices, on fait varier la formulation &#171; Combien co&#251;te X ? &#187; selon deux 
dimensions : une dimension propre &#224; la quantification, et une dimension g&#233;n&#233;ralisable &#224; 
l&#8217;interrogation (cf. Tableau 2). Cette &#233;tude s&#8217;est focalis&#233;e pour l&#8217;instant sur les questions 
quantificatrices et locatives du corpus Ritel (Rosset, Petel, 2006). 
</p>
<p>question adverbiale num&#233;rale d&#233;terminative nominale propositionnelle 
</p>
<p>simple Combien co&#251;te X ? Combien d&#8217;euros co&#251;te X ? Quel prix co&#251;te X ? Que co&#251;te X ? X co&#251;te-t-il 5 euros ? 
</p>
<p>tonique X co&#251;te combien ? X co&#251;te combien  d&#8217;euros ? X co&#251;te quel prix ? X co&#251;te quoi ?  
</p>
<p>renforc&#233;e Combien est-ce que co&#251;te X ? 
Combien d&#8217;euros est-
</p>
<p>ce que co&#251;te X ? 
Quel prix est-ce que 
</p>
<p>co&#251;te X ? 
Qu&#8217;est-ce que co&#251;te 
</p>
<p>X ? 
Est-ce que X co&#251;te 5 
</p>
<p>euros ? 
</p>
<p>p&#233;riphrastique Je voudrais savoir combien X co&#251;te 
Je voudrais savoir 
combien d&#8217;euros 
</p>
<p>co&#251;te X 
Je voudrais savoir 
quel prix co&#251;te X 
</p>
<p>Je voudrais savoir 
qu&#8217;est-ce que X 
</p>
<p>co&#251;te 
Je voudrais savoir si X 
</p>
<p>co&#251;te 5 euros 
</p>
<p>assertive X co&#251;te 5 euros ? X co&#251;te 5 en euros ? Le prix de X est de 5 euros ? 
X co&#251;te quelque 
</p>
<p>chose ?  
</p>
<p>Tableau 2 : Variabilit&#233; de la question &#171; Combien co&#251;te X ? &#187; (Luzzati, 2007) 
</p>
<p>Pour &#233;largir la couverture morphosyntaxique, il suffit d&#8217;ajouter des crit&#232;res de variabilit&#233;. Par 
exemple, la prise en compte de l&#8217;adverbe &#171; bien &#187; augmente la combinatoire. Apr&#232;s avoir fait 
le m&#234;me travail pour les r&#233;ponses associ&#233;es, il s&#8217;agit de d&#233;gager les structures syntaxiques, et 
de les coder en tant que formes d&#8217;usage. 
</p>
<p>La Grammaire Interactive repose sur l&#8217;identification de structures de surface, &#224; partir d&#8217;une 
combinaison de crit&#232;res morphosyntaxiques et pragmatiques. Elle est moins g&#233;n&#233;rique que 
des grammaires qui reposent sur des connaissances de granularit&#233; plus fine. Ceci dit, nous 
formulons l&#8217;hypoth&#232;se que la subtilit&#233; linguistique permise par la GI, la finesse dans la formu-
lation des r&#233;ponses, peuvent compenser ce manque de g&#233;n&#233;ricit&#233;. C&#8217;est la raison pour laquelle 
nous nous inspirons de la GI pour d&#233;velopper la GSR. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEROME LEHUEN 
</p>
<p>3 Analyse et g&#233;n&#233;ration des &#233;nonc&#233;s 
L&#8217;ad&#233;quation des repr&#233;sentations propos&#233;es au &#167;2 pour le dialogue d&#233;pend des processus qui 
vont les utiliser. En situation de dialogue, en compr&#233;hension comme en g&#233;n&#233;ration, un r&#233;sultat 
erron&#233; ou approximatif est pr&#233;f&#233;rable &#224; une absence de r&#233;sultat qui entraverait l&#8217;interaction. 
Ceci est vrai &#224; condition de pouvoir corriger ou compl&#233;ter ce r&#233;sultat. C&#8217;est pour cette raison 
que : premi&#232;rement, nous avons privil&#233;gi&#233; des algorithmes non-d&#233;terministes, deuxi&#232;mement, 
les repr&#233;sentations produites par l&#8217;analyseur sont partag&#233;es avec le dialogueur et manipulables 
par celui-ci. Les sous-sections suivantes d&#233;crivent les algorithmes d&#8217;analyse des &#233;nonc&#233;s de 
l&#8217;usager, puis de g&#233;n&#233;ration de ceux de la machine. 
</p>
<p>3.1 Algorithme d&#8217;analyse 
L&#8217;analyse part d&#8217;un &#233;nonc&#233; sous forme de cha&#238;ne de caract&#232;res et produit une repr&#233;sentation 
construite suivant le mod&#232;le pr&#233;sent&#233; au &#167;2.1. L&#8217;algorithme d&#8217;analyse proc&#232;de en cinq &#233;tapes 
au cours desquelles il s&#8217;agit d&#8217;instancier et de relier des &#171; granules &#187; en se fondant sur un cri-
t&#232;re syntaxique (reconnaissance de leurs formes d&#8217;usage) et/ou sur un crit&#232;re s&#233;mantique (cor-
respondance entre leurs offres et leurs attentes). Ces deux crit&#232;res sont soit combin&#233;s, soit uti-
lis&#233;s ind&#233;pendamment l&#8217;un de l&#8217;autre, afin de g&#233;n&#233;rer des hypoth&#232;ses. Les cinq &#233;tapes de 
l&#8217;analyse sont les suivantes : 
</p>
<p>1. Noyautage = instanciation de certains types de granules terminaux (comme les dates) 
&#224; l&#8217;aide d&#8217;expressions r&#233;guli&#232;res ou de grammaires locales ; 
</p>
<p>2. Segmentation = identification des portions de texte susceptibles de contenir un gra-
nule-fils &#224; l&#8217;aide des formes d&#8217;usage et des attentes. L&#8217;objectif est de g&#233;n&#233;rer des hy-
poth&#232;ses sur des mots ou expressions non r&#233;pertori&#233;es (granules hypoth&#233;tiques) ; 
</p>
<p>3. Construction = instanciation des granules et de leurs liaisons &#224; l&#8217;aide des formes 
d&#8217;usage et des attentes. L&#8217;algorithme repose sur le remplissage d&#8217;un tableau de granu-
les (lexicalis&#233;s ou hypoth&#233;tiques), et sur une fonction d&#8217;&#233;valuation ; 
</p>
<p>4. R&#233;solution = suppression des conflits de position entre granules. Les granules faibles 
sont supprim&#233;s au profit des granules forts (cf. fonction d&#8217;&#233;valuation) ; 
</p>
<p>5. Sauvetage = rattachement hypoth&#233;tique des &#171; granules orphelins &#187; sur des crit&#232;res de 
correspondance entre offres et attentes, et de proximit&#233;. 
</p>
<p>La m&#233;thode choisie pour progresser dans l&#8217;analyse sans avoir &#224; effectuer d&#8217;incessants retours 
arri&#232;res est l&#8217;analyse tabulaire ou chart parsing (Kay, 1980) dont le principe est de poursuivre 
en parall&#232;le des analyses concurrentes, &#224; chaque niveau de granularit&#233; permis par le mod&#232;le 
de langage. Dans notre cas, il s&#8217;agit de m&#233;moriser les granules (hypoth&#233;tiques ou non) dans 
une sorte de tableau-agenda avec leur position, leurs d&#233;pendances, et leur score. &#192; la fin de la 
cinqui&#232;me &#233;tape, ne restent que les structures fortes ou de m&#234;me poids. En cas d&#8217;ambigu&#239;t&#233;, 
une reformulation est propos&#233;e et c&#8217;est le dialogue qui devra permettre de trancher. 
</p>
<p>Un granule est caract&#233;ris&#233; par une position, une couverture (nombre de mots), et une disper-
sion (nombre de mots non pris en compte). De plus, il est &#233;ventuellement reli&#233; &#224; des granules-
fils Gi. Le score d&#8217;une liaison Ai correspond au nombre d&#8217;&#233;l&#233;ments en commun entre les en-
sembles de traits offerts et attendus. Le score d&#8217;un granule G est donn&#233; par la formule : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La Grammaire S&#233;mantique R&#233;versible 
</p>
<p> 
Par exemple, le score du granule BAGUETTE de l&#8217;&#233;nonc&#233; : &#171; Je voudrais une baguette tr&#232;s 
bien cuite &#187; est de 5&#8722;1+10+20=34 (cf. Fig. 4). Tout granule en conflit de position avec celui-
ci, et ayant un score inf&#233;rieur &#224; 34, sera supprim&#233; du chart, avec des suppressions en cha&#238;ne 
sur les liaisons et granules d&#233;pendants. 
</p>
<p> 
Figure 4 : Calcul du score du granule BAGUETTE 
</p>
<p>3.2 Quelques cas particuliers d&#8217;analyse 
Cette section donne des exemples qui illustrent des performances particuli&#232;res (identification 
des questions toniques/p&#233;riphrastiques, r&#233;solution d&#8217;ambigu&#239;t&#233;s homonymiques, r&#233;solution de 
conjonctions de coordination), ainsi que la capacit&#233; qu&#8217;&#224; l&#8217;analyse de g&#233;n&#233;rer des hypoth&#232;ses 
(hypoth&#232;ses de rattachement ou hypoth&#232;ses lexicales). 
</p>
<p>&#8226; Le premier exemple illustre la diff&#233;rence d&#8217;analyse entre une question tonique et une ques-
tion p&#233;riphrastique. Le type des questions non-p&#233;riphrastiques est not&#233; comme traits d&#8217;un 
granule, alors que les questions p&#233;riphrastiques g&#233;n&#232;rent un concept suppl&#233;mentaire : 
</p>
<p>a) Le s2 il commence quand ? 
=&gt; (DATE-DE interrogation tonique A1:(&#233;v&#233;nement:S2)) 
</p>
<p>b) Je voudrais savoir &#224; quelle date commence le s2 
=&gt; (QUESTIONNER A1:(information:DATE-DE A1:(&#233;v&#233;nement:S2))) 
&#8226; Le deuxi&#232;me exemple montre comment l&#8217;analyseur r&#233;sout naturellement les rares (et artifi-
</p>
<p>ciels) cas d&#8217;ambigu&#239;t&#233; homonymiques si le contexte le lui permet. Ici, le vocable &#171; avocat &#187; 
est d&#233;sambigu&#239;s&#233; par son adjectif : 
</p>
<p>c) Je voudrais un avocat bien m&#251;r 
=&gt; (DEMANDER A1:(demandable:AVOCAT-FRUIT A1:(quantit&#233;:UN) A2:(avancement:MUR))) 
</p>
<p>d) Je voudrais un avocat comp&#233;tent 
=&gt; (DEMANDER A1:(demandable:AVOCAT-PERS A1:(quantit&#233;:UN) A2:(qualificatif:COMPETENT))) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEROME LEHUEN 
</p>
<p>&#8226; La conjonction de coordination &#171; et &#187; est construite en fonction des cat&#233;gories ou des traits 
des granules situ&#233;s &#224; gauche et &#224; droite de la conjonction, qui d&#233;terminent sa port&#233;e. La 
cat&#233;gorie du concept ET est donn&#233;e par ses arguments : 
</p>
<p>e) Je voudrais une baguette et avez-vous deux croissants ? 
=&gt; (demande:ET A1:(demande:DEMANDER A1:(demandable:BAGUETTE A1:(quantit&#233;:UN))) 
 A2:(demande:DEMANDER A1:(demandable:CROISSANT A1:(quantit&#233;:DEUX)))) 
</p>
<p>f) Je voudrais une baguette et deux croissants 
=&gt; (DEMANDER A1:(demandable:ET A1:(demandable:BAGUETTE A1:(quantit&#233;:UN)) 
 A2:(demandable:CROISSANT A1:(quantit&#233;:DEUX)))) 
</p>
<p>&#8226; L&#8217;&#233;tape de sauvetage permet d&#8217;analyser des &#233;nonc&#233;s disloqu&#233;s qui produisent des granules 
orphelins. Lorsque les offres et les attentes s&#233;mantiques le permettent, l&#8217;analyseur tente des 
rattachements hypoth&#233;tiques (indiqu&#233;s ci-dessous par un point d&#8217;interrogation) : 
</p>
<p>g) Le semestre 2 je voudrais savoir la date 
=&gt; (QUESTIONNER A1:(information:DATE-DE ?A1:(&#233;v&#233;nement:S2))) 
</p>
<p>h) Le semestre 2 la date je voudrais savoir 
=&gt; (QUESTIONNER ?A1:(information:DATE-DE ?A1:(&#233;v&#233;nement:S2))) 
</p>
<p>&#8226; Enfin, gr&#226;ce &#224; l&#8217;&#233;tape de segmentation, l&#8217;analyseur est capable de faire des hypoth&#232;ses sur 
des mots inconnus. Les segments [le truc] et [le bidule] ont &#233;t&#233; g&#233;n&#233;r&#233;s &#224; partir de la forme 
d&#8217;usage &#171; ranger [objet] dans [rangement] &#187;. Au dialogueur de g&#233;rer ces hypoth&#232;ses : 
</p>
<p>i) Ranger le truc dans le bidule 
=&gt; (RANGER A1:(?objet:&quot;le truc&quot;) A2:(?rangement:&quot;le bidule&quot;)) 
</p>
<p>3.3 Algorithme de g&#233;n&#233;ration 
Le principe est de reconstruire un texte &#224; partir d&#8217;une structure de granules en activant les 
formes d&#8217;usage les plus int&#233;ressantes et en les composant. Comme pour l&#8217;analyse, il s&#8217;agit 
d&#8217;&#234;tre opportuniste, c&#8217;est-&#224;-dire de faire pour le mieux avec ce dont on dispose, en fonction 
d&#8217;indices et non pas de contraintes. L&#8217;algorithme de g&#233;n&#233;ration proc&#232;de de la fa&#231;on suivante. 
Un but de g&#233;n&#233;ration est propag&#233; de la racine de la structure vers ses feuilles, en v&#233;hiculant un 
ensemble Tg de modifieurs globaux (cf. Fig. 5). Un score est calcul&#233;, pour chaque verbalisa-
tion et pour chaque n&#339;ud, en fonction d&#8217;un crit&#232;re global (ad&#233;quation avec Tg), et d&#8217;un crit&#232;re 
local (score des fils et nombre de traits communs entre p&#232;res et fils). L&#8217;&#233;nonc&#233; final est obtenu 
en combinant les verbalisations de meilleurs scores. Soit cote(V) la cote d&#8217;une verbalisation, 
Tp(V) ses traits propres, et Tp(Vi) les traits propres des verbalisations &#171; filles &#187;, le score d&#8217;une 
verbalisation V est alors donn&#233; par la formule : 
</p>
<p> 
Par exemple, le score de la verbalisation &#171; une baguette bien cuite &#187; est de 1+0+12+12=25, 
tandis que le score de la verbalisation &#171; un baguette bien cuit &#187; est de 1+0+11+11=23. Avec 
Tg = {familier}, le score de la verbalisation &#171; je voudrais une baguette bien cuite &#187; est de 
1+0+250=251, tandis que le score de la verbalisation &#171; file-moi une baguette bien cuite &#187; est 
de 1+1+250=252. Cette verbalisation est gagnante. Si l&#8217;expression &#171; file-moi&#8230; &#187; n&#8217;avait pas 
&#233;t&#233; connue du syst&#232;me, &#171; je voudrais&#8230; &#187; serait rest&#233;e. En cas de ballottage, on applique une </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>La Grammaire S&#233;mantique R&#233;versible 
</p>
<p>fonction al&#233;atoire. La cote d&#8217;une verbalisation (par d&#233;faut = 1) permet de faire &#233;voluer les 
&#171; habitudes &#187; du g&#233;n&#233;rateur en fonction de crit&#232;res ext&#233;rieurs au processus de g&#233;n&#233;ration, 
comme la fr&#233;quence d&#8217;usage constat&#233;e en analyse, par exemple. 
</p>
<p> 
Figure 5 : Exemple de processus de g&#233;n&#233;ration 
</p>
<p>Les algorithmes d&#8217;analyse et de g&#233;n&#233;ration ont &#233;t&#233; test&#233;s sur des jeux d&#8217;&#233;nonc&#233;s, &#224; l&#8217;aide d&#8217;un 
script de &#171; double traduction &#187;, chaque &#233;nonc&#233; &#233;tant analys&#233; puis r&#233;g&#233;n&#233;r&#233; dans la foul&#233;e. La 
repr&#233;sentation interne de l&#8217;&#233;nonc&#233; est alors utilis&#233;e comme un &#171; langage pivot &#187;. Nous avons 
ainsi pu comparer les &#233;nonc&#233;s d&#8217;origines et leurs reg&#233;n&#233;rations. Bien que notre probl&#233;matique 
n&#8217;ait a priori aucun rapport avec la traduction automatique, nous avons tent&#233; de fournir au 
syst&#232;me des formes d&#8217;usage anglophones et sp&#233;cifi&#233; un Tg = {anglais}. Il a &#233;t&#233; int&#233;ressant de 
constater que le g&#233;n&#233;rateur produisait des traductions correctes et que, lorsqu&#8217;une forme 
d&#8217;usage anglophone venait &#224; manquer, l&#8217;algorithme utilisait une forme d&#8217;usage francophone. 
Le m&#233;lange d&#8217;anglais et de fran&#231;ais qui en r&#233;sulte illustre bien le principe opportuniste. 
</p>
<p>4 Conclusion 
La finalit&#233; de notre mod&#232;le n&#8217;est pas de repr&#233;senter la phrase ou l&#8217;&#233;nonc&#233;. Elle est de fournir &#224; 
un moteur de dialogue finalis&#233; les &#233;l&#233;ments qui lui permettront de r&#233;pondre &#224; un &#233;nonc&#233;, dans 
le contexte d&#8217;une application donn&#233;e. Ainsi, les repr&#233;sentations produites sont ni absolues, ni 
forc&#233;ment utilisables hors d&#8217;un contexte dialogique. De plus, elles sont tr&#232;s d&#233;pendantes des 
connaissances fournies, lesquelles sont tr&#232;s d&#233;pendantes de l&#8217;application vis&#233;e. En revanche, 
nous proposons un formalisme &#171; r&#233;versible &#187; puisque utilisable en analyse comme en g&#233;n&#233;ra-
tion, et des algorithmes ind&#233;pendants des applications. Parce qu&#8217;il tol&#232;re bruits, dislocations et 
incompl&#233;tudes, et parce qu&#8217;il peut faire certaines hypoth&#232;ses, l&#8217;analyseur vise la robustesse. 
Le mod&#232;le de langage est non-normatif car les structures syntaxiques d&#233;crites sont davantage 
propos&#233;es qu&#8217;impos&#233;es. Nous l&#8217;avons &#233;galement souhait&#233; extensible : il suffit d&#8217;ajouter une 
forme d&#8217;usage pour augmenter son potentiel, en analyse comme en g&#233;n&#233;ration. La multiplica-
tion des formes d&#8217;usage permet d&#8217;interagir en prenant en compte la variabilit&#233; et les subtilit&#233;s 
langagi&#232;res d&#233;crites dans la grammaire interactive. Le mod&#232;le de langage et les algorithmes 
pr&#233;sent&#233;s sont impl&#233;ment&#233;s en CLIPS (http://clipsrules.sourceforge.net) et op&#233;rationnels. 
Nous disposons &#233;galement d&#8217;un &#233;diteur d&#233;di&#233; permettant d&#8217;&#233;diter une ontologie de concepts 
selon le mod&#232;le ANADIA (Beust, 1998) (Nicolle et al. 2001), ainsi que sa GSR associ&#233;e. La 
plate-forme de dialogue est en cours de d&#233;veloppement. Elle int&#232;grera un module de recon-
naissance de la parole et un module de synth&#232;se vocale. Afin de positionner notre approche 
par rapport &#224; d&#8217;autres, nous avons engag&#233; une &#233;valuation en nous fondant sur le corpus utilis&#233; 
pour la campagne Evalda-Media (Bonneau-Maynard et al. 2006). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEROME LEHUEN 
</p>
<p>R&#233;f&#233;rences 
BEUST P. (1998). Contribution &#224; un mod&#232;le interactionniste du sens. Th&#232;se de doctorat 
d&#8217;informatique de l&#8217;Universit&#233; de Caen. 
</p>
<p>BONNEAU-MAYNARD, H., AYACHE, C., BECHET, F., DENIS, A., KUHN, A., LEFEVRE, F., MOS-
TEFA, D., QUIGNARD, M., ROSSET, S., SEVRAN, C., VILLANEAU, J. (2006). Results of the 
french evalda-media evaluation campaign for literal understanding. In: Proceedings of LREC 
2006, Genoa, 2054&#8211;2059. 
</p>
<p>DYMETMAN M. (1994). Inherently reversible grammars. In: Tomek Strzalkowski (ed.), Rever-
sible Grammar in Natural Language Processing, Kluwer, 33&#8211;57. 
</p>
<p>GARDENT C., KOW E. (2007). A symbolic approach to near-deterministic surface realisation 
using tree adjoining grammar. In: Proceeding of ACL 2007, Prague, 328&#8211;335. 
</p>
<p>GERTJAN VON NOORD (1993). Reversibility in Natural Language Processing. Dissertation. 
University of Utrecht. http://www.let.rug.nl/~vannoord/papers/diss/diss.html 
</p>
<p>GOULIAN J., ANTOINE J.-Y. (2001). Compr&#233;hension Automatique de la Parole combinant syn-
taxe locale et s&#233;mantique globale pour une CHM portant sur des t&#226;ches relativement com-
plexes., In: Proceeding of TALN 2001, Tours, 203&#8211;212. 
</p>
<p>GREIMAS A.J. (1966). S&#233;mantique Structurale. PUF : Paris. 
</p>
<p>KATZ J.J., FODOR  J.A. (1963). The Structure of a Semantic Theory. In: Rosenberg and Travis 
(1971), Language n&#176;34 (2). 170&#8211;210. 
</p>
<p>KAY M. (1980). Algorithm shemata and data structures in syntactic processing. Rapport 
CSL-80-12. Xerox Corporation. 
</p>
<p>LUZZATI D. (2006). Dialogue et apprentissage. In: Compr&#233;hension des langues et interaction, 
G&#233;rard Sahab (ed.), Herm&#232;s-Lavoisier, 337&#8211;356. 
</p>
<p>LUZZATI D. (2007). Essai de description interactive des questions quantificatrices. In: Actes 
du colloque La Quantification. Strasbourg. Presses Universitaires de Caen. (&#224; para&#238;tre) 
</p>
<p>NICOLLE P., BEUST P., PERLERIN V. (2001). Un analogue de la m&#233;moire pour un agent logi-
ciel interactif. In: Revue In Cognito n&#176;21. 37&#8211;66. 
</p>
<p>NICOLLE P. (2006). Compr&#233;hension et interaction. In: Compr&#233;hension des langues et interac-
tion, G&#233;rard Sahab (ed.), Herm&#232;s-Lavoisier, 141&#8211;170. 
</p>
<p>ROSSET S., PETEL. S. (2006). The Ritel Corpus &#8211; An annotated Human-Machine open-domain 
question answering spoken dialog corpus. In: Proceedings of International Conference on 
Language Resources and Evaluation. G&#234;nes. 1640&#8211;1643. 
</p>
<p>TESNIERE L. (1959). &#201;l&#233;ments de syntaxe structurale, Paris, Klincksiek. </p>

</div></div>
</body></html>