<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mod&#233;lisation du principe d&#8217;ancrage pour la robustesse des syst&#232;mes de dialogue homme-machine finalis&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Mod&#233;lisation du principe d&#8217;ancrage pour la robustesse des
syst&#232;mes de dialogue homme-machine finalis&#233;s
</p>
<p>Alexandre Denis Matthieu Quignard
UMR 7503 LORIA/CNRS &#8211; Campus scientifique
</p>
<p>56 506 Vandoeuvre-l&#232;s-Nancy Cedex
alexandre.denis@loria.fr, matthieu.quignard@loria.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente une mod&#233;lisation du principe d&#8217;ancrage (grounding) pour
la robustesse des syst&#232;mes de dialogue finalis&#233;s. Ce principe, d&#233;crit dans (Clark &amp; Schaefer,
1989), sugg&#232;re que les participants &#224; un dialogue fournissent des preuves de compr&#233;hension
afin d&#8217;atteindre la compr&#233;hension mutuelle. Nous explicitons une d&#233;finition computationnelle
du principe d&#8217;ancrage fond&#233;e sur des jugements de compr&#233;hension qui, contrairement &#224; d&#8217;autres
mod&#232;les, conserve une motivation pour l&#8217;expression de la compr&#233;hension. Nous d&#233;roulons enfin
le processus d&#8217;ancrage sur un exemple tir&#233; de l&#8217;impl&#233;mentation du mod&#232;le.
</p>
<p>Abstract. This paper presents a grounding model for robustness in dialogue systems. The
grounding process (Clark &amp; Schaefer, 1989) suggests that dialogue participants provide evi-
dence of understanding in order to reach mutual understanding. We propose here a computatio-
nal definition of the grounding criterion based on understanding judgments that keeps a motiva-
tion for providing evidence of understanding, as opposed to some existing models. Eventually,
we detail the grounding process on a dialogue generated by the actual implementation.
</p>
<p>Mots-cl&#233;s : dialogue homme-machine, robustesse, ancrage, compr&#233;hension mutuelle.
</p>
<p>Keywords: human-machine dialogue, robustness, grounding, mutual understanding.
</p>
<p>1 Introduction
</p>
<p>La campagne EVALDA-MEDIA du projet Technolangues (Bonneau-Maynard et al., 2006)
a permis d&#8217;&#233;valuer diff&#233;rents syst&#232;mes de dialogue &#233;labor&#233;s dans des laboratoires fran&#231;ais
(LIMSI, LORIA, LIA, VALORIA). Cette &#233;valuation consistait &#224; mesurer la capacit&#233; des sys-
t&#232;mes &#224; produire une repr&#233;sentation s&#233;mantique correcte hors et en contexte d&#8217;&#233;nonc&#233;s naturels,
recueillis dans un protocole de Magicien d&#8217;Oz. Le probl&#232;me d&#8217;une telle &#233;valuation sur corpus
r&#233;side dans le fait qu&#8217;il n&#8217;est pas possible de tirer des conclusions sur la robustesse des sys-
t&#232;mes lorsqu&#8217;ils seront engag&#233;s dans des situations r&#233;elles. M&#234;me si un syst&#232;me atteint un score
de compr&#233;hension de 80% de couverture s&#233;mantique ou r&#233;f&#233;rentielle, il n&#8217;est pas possible de
savoir si les erreurs commises sont critiques ou non vis-&#224;-vis de la r&#233;ussite du dialogue1.
</p>
<p>La campagne MEDIA revenait &#224; &#233;valuer la robustesse interne des syst&#232;mes, c&#8217;est-&#224;-dire leur
capacit&#233; &#224; comprendre l&#8217;&#233;nonc&#233; sans faire appel &#224; l&#8217;utilisateur. Le caract&#232;re critique ou non
</p>
<p>1Au mieux, on peut faire l&#8217;hypoth&#232;se qu&#8217;un concept est d&#8217;autant plus critique pour la t&#226;che que sa fr&#233;quence
est &#233;lev&#233;e dans le corpus, mais est-ce vraiment le cas ?</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>d&#8217;une erreur de compr&#233;hension rejoint la probl&#233;matique de la robustesse externe : &#233;tant donn&#233;e
une erreur de compr&#233;hension (d&#233;tect&#233;e ou non), le syst&#232;me est-il capable gr&#226;ce au dialogue
d&#8217;atteindre la bonne interpr&#233;tation, par exemple en posant des questions de clarification ?
</p>
<p>La gestion de la compr&#233;hension mutuelle des participants d&#8217;un dialogue constitue le c&#339;ur des
travaux de Clark, notamment (Clark, 1996), dans la th&#233;orie du grounding (que nous traduirons
par la suite par le terme &#171; ancrage &#187;). Il s&#8217;agit du processus par lequel les participants manifestent
leur compr&#233;hension tout en surveillant, consolidant ou corrigeant l&#8217;interpr&#233;tation que fait leur
interlocuteur des &#233;nonc&#233;s qu&#8217;ils produisent.
</p>
<p>Nous pr&#233;sentons cette th&#233;orie et les diff&#233;rents mod&#232;les computationnels qui en d&#233;coulent dans
la section suivante. Nous proposerons ensuite un mod&#232;le qui pr&#233;sente l&#8217;avantage de d&#233;finir un
crit&#232;re d&#8217;ancrage qui ne requiert pas de croyances mutuelles de compr&#233;hension tout en motivant
le besoin de manifester des preuves de compr&#233;hension. Enfin, nous d&#233;roulerons le mod&#232;le sur
un exemple de mauvaise compr&#233;hension d&#8217;une expression r&#233;f&#233;rentielle.
</p>
<p>2 Mod&#232;les d&#8217;ancrage computationnels
</p>
<p>Le terrain commun est l&#8217;ensemble des informations mutuelles qui sert de support aux parti-
cipants d&#8217;un dialogue pour l&#8217;interpr&#233;tation et la production de leurs &#233;nonc&#233;s. Chaque &#233;nonc&#233;
provoque la mise &#224; jour de ce terrain commun (Lewis, 1969; Clark, 1996; Stalnaker, 1998).
</p>
<p>Mod&#232;le des contributions.
</p>
<p>Le mod&#232;le des contributions (Clark &amp; Schaefer, 1989) critique les mod&#232;les dans lesquels le
contenu d&#8217;un &#233;nonc&#233; est automatiquement ajout&#233; au terrain commun. Il souligne que la mise &#224;
jour du terrain commun requiert au pr&#233;alable l&#8217;&#233;tablissement d&#8217;une compr&#233;hension de l&#8217;&#233;nonc&#233;.
Clark critique &#233;galement les mod&#232;les qui conditionnent la mise &#224; jour &#224; l&#8217;absence de preuve n&#233;-
gative de compr&#233;hension, car ces mod&#232;les ne rendent pas compte de la manifestation positive de
compr&#233;hension tels les acknowledgements. Le mod&#232;le des contributions suppose alors que pour
contribuer au dialogue, les participants cherchent &#224; atteindre une croyance mutuelle de com-
pr&#233;hension, mod&#233;lis&#233;e sous la forme d&#8217;un crit&#232;re d&#8217;ancrage (grounding criterion) : un &#233;nonc&#233;
est ancr&#233; lorsque &#171; le locuteur et ses interlocuteurs croient mutuellement que les interlocuteurs
ont compris suffisamment le locuteur pour les buts courants &#187;. La volont&#233; d&#8217;atteindre ce crit&#232;re
d&#8217;ancrage fournit une motivation &#224; la manifestation (positive ou n&#233;gative) de la compr&#233;hension.
</p>
<p>Une contribution au dialogue est un acte collaboratif r&#233;alis&#233; en deux phases : la pr&#233;sentation
d&#8217;un &#233;nonc&#233; et son acceptation par le partenaire. Lorsque A pr&#233;sente un &#233;nonc&#233; Ai, il fait l&#8217;hy-
poth&#232;se que s&#8217;il re&#231;oit une preuve de compr&#233;hension de son partenaire B, il peut l&#233;gitimement
croire que B a compris Ai. Lorsque B accepte Ai, il produit une preuve de compr&#233;hension en
supposant qu&#8217;une fois que A re&#231;oit cette preuve, A croit que B comprend l&#8217;&#233;nonc&#233;. La coor-
dination de ces deux phases constitue le processus d&#8217;ancrage. Le crit&#232;re d&#8217;ancrage n&#8217;est atteint
que lorsque ces deux phases sont termin&#233;es, et le cas &#233;ch&#233;ant elles forment une base partag&#233;e
pour inf&#233;rer la croyance mutuelle de compr&#233;hension (Clark, 1996). Le mod&#232;le des contributions
n&#8217;est toutefois qu&#8217;un mod&#232;le descriptif, non computationnel.
</p>
<p>Mod&#232;le des &#233;changes.
</p>
<p>Le mod&#232;le des &#233;changes (Cahn &amp; Brennan, 1999) critique le mod&#232;le des contributions car</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation du principe d&#8217;ancrage pour la robustesse des syst&#232;mes de dialogue
</p>
<p>son manque de formalisme le rend inadapt&#233; pour le dialogue homme-machine. Celui-ci pose
en outre deux probl&#232;mes : il ne repr&#233;sente que le r&#233;sultat final du processus d&#8217;ancrage et pas
ses &#233;tapes interm&#233;diaires, et le fait avec une perspective omnisciente. Le mod&#232;le des &#233;changes
donne alors une formalisation du processus d&#8217;ancrage d&#8217;un point de vue interne et incr&#233;men-
tal en rajoutant la structure d&#8217;&#233;change. Les &#233;changes sont simplement des paires adjacentes de
contributions plus &#224; m&#234;me de mod&#233;liser la structure du dialogue homme-machine.
</p>
<p>Le mod&#232;le des &#233;changes est une version tr&#232;s fid&#232;le du mod&#232;le des contributions qui en donne une
version computationnelle mais n&#8217;en r&#233;sout pas les principaux probl&#232;mes (Denis et al., 2007).
Le plus important est sans doute celui pos&#233; par le processus d&#8217;ancrage, soulev&#233; dans (Traum,
1999) sous le nom de probl&#232;me de l&#8217;acceptation r&#233;cursive : si une contribution a besoin d&#8217;&#234;tre
accept&#233;e pour jouer son r&#244;le d&#8217;acceptation alors aucune phase d&#8217;acceptation ne peut &#234;tre close.
En effet pour que l&#8217;&#233;nonc&#233; soit ancr&#233;, B doit savoir si oui ou non A a bien re&#231;u sa preuve
de compr&#233;hension et attendre alors une nouvelle contribution de A. Mais comment savoir si
cette nouvelle contribution est bien comprise ?B doit effectuer un nouvel &#233;nonc&#233;, qui lui-m&#234;me
n&#233;cessitera d&#8217;&#234;tre accept&#233; avant que l&#8217;&#233;nonc&#233; initial puisse &#234;tre ancr&#233;, etc.
</p>
<p>Solutions au probl&#232;me de l&#8217;acceptation r&#233;cursive.
</p>
<p>Dans (Clark &amp; Schaefer, 1989), le probl&#232;me de l&#8217;acceptation r&#233;cursive est r&#233;solu par un principe
de diminution de preuve de compr&#233;hension : pour accepter une preuve il suffit de fournir une
preuve moins forte, l&#8217;ensemble des preuves pouvant &#234;tre ordonn&#233;. Bien que cette classification
soit discutable (Traum, 1999), ce principe n&#8217;explique pas pourquoi on peut initier une nouvelle
contribution sans manifester explicitement sa compr&#233;hension de la preuve.
</p>
<p>La solution g&#233;n&#233;ralement adopt&#233;e est alors de supposer la bonne compr&#233;hension de cette preuve.
Ainsi dans le mod&#232;le des grounding acts (Traum, 1999), la fonction d&#8217;acceptation n&#8217;a pas &#224; &#234;tre
accept&#233;e. D&#232;s lors, le probl&#232;me de l&#8217;acceptation r&#233;cursive ne se pose plus puisque B consid&#232;re
que A re&#231;oit correctement la preuve de compr&#233;hension. Cette solution a deux cons&#233;quences :
d&#8217;abord elle entra&#238;ne dans ce mod&#232;le une structure plate du dialogue, les discourse units, qui
rassemblent les &#233;nonc&#233;s qui peuvent &#234;tre ancr&#233;s ensemble. Cette structure est simple &#224; manipu-
ler mais difficile &#224; r&#233;interpr&#233;ter. Ensuite elle implique que les &#233;nonc&#233;s qui n&#8217;ont qu&#8217;une fonction
d&#8217;acceptation sont automatiquement compris (par exemple les acknowledgements). Ce mod&#232;le
ne peut donc pas expliquer pourquoi on peut observer deux acknowledgements d&#8217;affil&#233;e.
</p>
<p>L&#8217;approche de (Larsson, 2002) va encore plus loin en supposant la bonne compr&#233;hension des
&#233;nonc&#233;s. Ce mod&#232;le les consid&#232;re ancr&#233;s par d&#233;faut tout en autorisant une possibilit&#233; de r&#233;vision
(strat&#233;gie prudente). Mais cette strat&#233;gie &#233;limine le besoin de fournir des preuves de compr&#233;-
hension : pourquoi le faire puisque l&#8217;&#233;nonc&#233; est ancr&#233; par d&#233;faut ?
</p>
<p>Nous pensons qu&#8217;un bon mod&#232;le ne doit pas ancrer les &#233;nonc&#233;s par d&#233;faut afin de conserver
une motivation pour la manifestation positive de leur compr&#233;hension. Ces preuves de compr&#233;-
hension jalonnent les dialogues homme-homme ; il nous faut conserver un principe motivant
leur emploi. Le probl&#232;me d&#8217;acceptation r&#233;cursive doit alors &#234;tre r&#233;solu autrement. Nous sug-
g&#233;rons de rel&#226;cher l&#8217;hypoth&#232;se forte que le crit&#232;re d&#8217;ancrage n&#8217;est atteint qu&#8217;avec la croyance
mutuelle de compr&#233;hension. Comme Taylor (1996), nous pensons qu&#8217;une croyance partag&#233;e
peut suffire2.
</p>
<p>2La croyance mutuelle est la conjonction d&#8217;une infinit&#233; de croyances r&#233;ciproques (je crois p, tu crois p, je crois
que tu crois p, tu crois que je crois p, je crois que tu crois que je crois p, etc.), tandis que la croyance partag&#233;e est
une conjonction finie (jusqu&#8217;&#224; un rang n).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>3 Mod&#233;lisation de l&#8217;ancrage
</p>
<p>Avant tout il est n&#233;cessaire de rappeler que le crit&#232;re d&#8217;ancrage d&#8217;un point de vue interne ne
requiert qu&#8217;une croyance de compr&#233;hension et non la compr&#233;hension effective. D&#232;s lors, l&#8217;an-
crage peut &#234;tre r&#233;alis&#233; &#224; tort. Notre hypoth&#232;se est qu&#8217;un &#233;nonc&#233; joue sa fonction d&#8217;acceptation
lorsque celui-ci est cru compris ; l&#8217;acceptation ne d&#233;pend donc pas d&#8217;une acceptation ult&#233;rieure.
Lorsque A re&#231;oit la preuve de compr&#233;hension fournie par B en Bi+1, il peut estimer si B a
correctement compris son &#233;nonc&#233; Ai et juger de son ancrage. La seule condition est que A croit
avoir compris cette preuve. Son interpr&#233;tation peut &#234;tre divergente et entra&#238;ner le cas &#233;ch&#233;ant un
ancrage erron&#233; de Ai.
</p>
<p>Nous proposons alors un principe d&#8217;ancrage capable de rendre compte de ce fait, motivant
la manifestation de preuve de compr&#233;hension tout en consid&#233;rant que leur interpr&#233;tation peut
&#234;tre erron&#233;e et qu&#8217;alors la r&#233;interpr&#233;tation des preuves de compr&#233;hension est n&#233;cessaire. Ce
principe a &#233;t&#233; impl&#233;ment&#233; dans un module adjoint &#224; un syst&#232;me d&#8217;interpr&#233;tation. Son r&#244;le est de
sp&#233;cifier les preuves de compr&#233;hension que le syst&#232;me doit manifester afin d&#8217;ancrer les &#233;nonc&#233;s
ant&#233;rieurs.
</p>
<p>3.1 Formulation en logique &#233;pist&#233;mique
</p>
<p>Le principe d&#8217;ancrage que nous proposons est d&#233;crit &#224; l&#8217;aide d&#8217;une croyance partag&#233;e au lieu
d&#8217;une croyance mutuelle et il est formul&#233; de mani&#232;re unilat&#233;rale afin de rendre compte d&#8217;une
perspective interne.
</p>
<p>D&#233;finition : &#171; un &#233;nonc&#233; est ancr&#233; pour un participant ssi ce participant entretient
la croyance que le locuteur et l&#8217;interlocuteur partagent la croyance (au rang n) que
l&#8217;interlocuteur a compris suffisamment le locuteur pour les buts courants. &#187;
</p>
<p>Cette d&#233;finition &#224; l&#8217;aide d&#8217;une croyance partag&#233;e unilat&#233;rale pr&#233;sente plusieurs avantages. Elle
r&#233;sout le probl&#232;me de l&#8217;acceptation r&#233;cursive car il n&#8217;y a pas de n&#233;cessit&#233; d&#8217;avoir une cha&#238;ne
infinie de croyances et d&#8217;&#233;nonc&#233;s. Ensuite, elle conserve le besoin de manifester sa compr&#233;hen-
sion puisqu&#8217;elle ne suppose pas que les &#233;nonc&#233;s sont ancr&#233;s a priori. De plus, elle autorise la
possibilit&#233; de construire ces croyances sur la seule base de la rationnalit&#233; et ainsi de mod&#233;liser
la strat&#233;gie prudente3 (Larsson, 2002), ou d&#8217;autres strat&#233;gies qui ne font pas partie du mod&#232;le
collaboratif. Enfin, elle pr&#233;sente un int&#233;r&#234;t computationnel ind&#233;niable de par son caract&#232;re fini.
</p>
<p>Une formulation du principe d&#8217;ancrage en logique &#233;pist&#233;mique permet de mettre en &#233;vidence
les croyances de compr&#233;hension n&#233;cessaires &#224; l&#8217;ancrage. Au rang deux, que nous supposons
suffisant (Taylor et al., 1996), le principe d&#8217;ancrage du point de vue des participants A et B &#224;
propos d&#8217;un &#233;nonc&#233; Ai peut &#234;tre formul&#233; par :
</p>
<p>BelB GroundedAi = BelB UndB Ai &#8743;BelB BelA UndB Ai
BelAGroundedAi = BelA UndB Ai &#8743;BelABelB UndB Ai
</p>
<p>Le premier int&#233;r&#234;t pratique de cette d&#233;finition est qu&#8217;elle met en lumi&#232;re les deuxmodes d&#8217;acqui-
sition de la croyance de compr&#233;hension : l&#8217;&#233;valuation de sa propre interpr&#233;tation (BelB UndB Ai),
</p>
<p>3Il suffit de prendre n = 1 pour l&#8217;interlocuteur et n = 0 pour le locuteur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation du principe d&#8217;ancrage pour la robustesse des syst&#232;mes de dialogue
</p>
<p>et l&#8217;extraction de la preuve de compr&#233;hension (BelB BelA UndB Ai). De plus, &#233;tant donn&#233;
qu&#8217;elle distingue l&#8217;auteur du jugement (BelX) et l&#8217;auteur de l&#8217;interpr&#233;tation (UndY ), elle
permet une repr&#233;sentation unifi&#233;e de la non-compr&#233;hension et de la mauvaise compr&#233;hension
(McRoy &amp; Hirst, 1993). La non-compr&#233;hension est alors un jugement n&#233;gatif d&#8217;un participant
sur sa propre interpr&#233;tation (BelX &#172;UndX Yi), et la mauvaise compr&#233;hension un jugement n&#233;-
gatif d&#8217;un participant sur l&#8217;interpr&#233;tation de son partenaire (BelX &#172;UndY Xi).
</p>
<p>3.2 Mod&#233;lisation des jugements
</p>
<p>Lorsqu&#8217;un participant S re&#231;oit un &#233;nonc&#233;On de son partenaireO il se pose alors les questions de
compr&#233;hension suivantes, destin&#233;es &#224; &#233;tablir le crit&#232;re d&#8217;ancrage de On et d&#8217;&#233;nonc&#233;s ant&#233;rieurs ;
nous appelons S (Self ) le participant dont on adopte le point de vue etO son partenaire (Other) :
</p>
<p>SS Est-ce que je juge avoir suffisamment compris l&#8217;&#233;nonc&#233; de mon partenaire ? (BelS UndS On)
SO Est-ce que je juge que mon partenaire a suffisamment compris mon &#233;nonc&#233; ant&#233;rieur ?
</p>
<p>(BelS UndO Sk)
OO Est-ce que (je crois que) mon partenaire juge avoir suffisamment compris mon &#233;nonc&#233;
</p>
<p>ant&#233;rieur ? (BelS BelO UndO Sk)
OS Est-ce que (je crois que) mon partenaire juge que j&#8217;ai suffisamment compris son &#233;nonc&#233;
</p>
<p>ant&#233;rieur ? (BelS BelO UndS Oi)
</p>
<p>Ces quatre types de questions d&#233;coulent de la combinatoire auteur du jugement / auteur de
l&#8217;interpr&#233;tation et on noteraXY le jugement deX sur l&#8217;interpr&#233;tation de Y . Par exemple SO est
le jugement de S sur l&#8217;interpr&#233;tation de O ou OO le jugement de O sur sa propre interpr&#233;tation
(mais toujours du point de vue de S). Nous utilisons la terminologie du mod&#232;le des &#233;changes
pour nommer les valeurs de ces jugements. Les jugements positifs et n&#233;gatifs de OO ou de SS
seront appel&#233;s respectivement U (UNDERSTOOD) et U (NOTUNDERSTOOD). Les jugements
positifs et n&#233;gatifs de SO ou OS seront appel&#233;s R (RELEVANT) et R (NOTRELEVANT). On
dira par exemple qu&#8217;un &#233;nonc&#233; On est UR lorsque SS est U et SO est R, et qu&#8217;il manifeste UR
lorsque OO est U et OS est R. Enfin nous noterons dans ce cas UR/UR pour repr&#233;senter &#224; la
fois la compr&#233;hension de l&#8217;&#233;nonc&#233; et la compr&#233;hension qu&#8217;il manifeste.
</p>
<p>Les jugements n&#233;gatifs permettent de repr&#233;senter des cat&#233;gories globales de probl&#232;me. Ils ne
peuvent &#234;tre utilis&#233;s tels quels et doivent &#234;tre raffin&#233;s par niveau, type et localisation du pro-
bl&#232;me. Le niveau et le type de probl&#232;me font l&#8217;objet de nombreux travaux qui visent &#224; &#233;tablir
une taxonomie d&#8217;erreurs, voir par exemple (Paek, 2003; Schlangen, 2004). La localisation du
probl&#232;me doit permettre d&#8217;identifier l&#8217;unit&#233; probl&#233;matique, diff&#233;rente en fonction du niveau du
probl&#232;me : les mots au niveau lexical, les sens au niveau s&#233;mantique, les r&#233;f&#233;rents au niveau
r&#233;f&#233;rentiel, etc.
</p>
<p>3.3 Acquisition des jugements
</p>
<p>La premi&#232;re &#233;tape pour d&#233;terminer si un &#233;nonc&#233; est ancr&#233; est d&#8217;acqu&#233;rir ces jugements et nous
faisons l&#8217;hypoth&#232;se qu&#8217;ils sont acquis lors de la phase d&#8217;interpr&#233;tation. Ces jugements sont
d&#8217;abord construits, puis utilis&#233;s dans un second temps pour produire l&#8217;&#233;nonc&#233; suivant. Nous ne
nous attachons pas ici &#224; &#233;laborer une th&#233;orie ou des algorithmes d&#8217;acquisition des jugements
mais donnons quelques pistes en ce sens.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>Les jugements SS et SO peuvent &#234;tre mod&#233;lis&#233;s comme des attentes vis &#224; vis de l&#8217;interpr&#233;tation.
Le jugement SS correspond &#224; l&#8217;attente d&#8217;une interpr&#233;tation unique et certaine : une interpr&#233;ta-
tion vide, ambigu&#235; ou incertaine conduit alors &#224; un U . En g&#233;n&#233;ral le calcul du jugement SS
s&#8217;appuie sur un score de confiance issu de la reconnaissance de la parole ou d&#8217;une combinai-
son de scores &#224; diff&#233;rents niveaux d&#8217;analyse (Purver et al., 2006). Si le score est inf&#233;rieur &#224;
un seuil donn&#233;, alors l&#8217;&#233;nonc&#233; est consid&#233;r&#233; non compris (le jugement SS est U ). Le jugement
SO peut &#234;tre acquis par la satisfaction d&#8217;attentes vis &#224; vis du contenu de l&#8217;&#233;nonc&#233; d&#8217;autrui. Par
exemple (Danieli, 1996) rep&#232;re les occurences de mauvaise compr&#233;hension par la d&#233;viation du
comportement de l&#8217;utilisateur vis &#224; vis des pr&#233;dictions du syst&#232;me, ou (McRoy &amp; Hirst, 1993)
utilise l&#8217;abduction pour inf&#233;rer la cause de la mauvaise compr&#233;hension. Pour les jugements OO
et OS, le contenu propositionnel peut expliciter l&#8217;existence d&#8217;un probl&#232;me d&#8217;interpr&#233;tation, par
exemple &#171; je ne comprends pas &#187; qui manifeste un U ou encore &#171; non, c&#8217;est l&#8217;h&#244;tel Ibis &#187; qui
manifeste un UR. Mais la prosodie, les marqueurs de discours, les attitudes gestuelles ou le
regard sont &#233;galement des indices sur lesquels on peut fonder la construction de ces jugements
(Krahmer et al., 1999; Nakano et al., 2003).
</p>
<p>3.4 Gestion de la structure du dialogue
</p>
<p>Une fois que les jugements de compr&#233;hension ont &#233;t&#233; construits, il est n&#233;cessaire de v&#233;rifier
l&#8217;&#233;tat courant du dialogue afin de d&#233;terminer si ces jugements modifient le statut d&#8217;ancrage
d&#8217;un &#233;nonc&#233; ant&#233;rieur. Nous reprenons la proposition du mod&#232;le des &#233;changes de repr&#233;senter
explicitement la composante structurelle du processus d&#8217;ancrage en maintenant une structure
de dialogue. De mani&#232;re analogue au mod&#232;le des &#233;changes, Luzzati (Luzzati, 1995) sugg&#232;re
que le dialogue s&#8217;oriente en deux axes : un axe r&#233;gissant lorsqu&#8217;il n&#8217;y a pas de probl&#232;me de
compr&#233;hension, et un axe incident en cas de phase de clarification. La structure de dialogue
du mod&#232;le des &#233;changes est tr&#232;s proche des Unit&#233;s Minimales d&#8217;Interaction de Coala (Lehuen,
1997) : un &#233;change initi&#233; dans l&#8217;acceptation d&#8217;une contribution correspond &#224; une UMI incidente.
</p>
<p>R&#232;gles de mise &#224; jour. La structure de dialogue est une structure incr&#233;mentale, construite ou
r&#233;vis&#233;e en fonction des jugements de compr&#233;hension. Nous proposons de repr&#233;senter les mises
&#224; jour comme des op&#233;rations sur la structure, d&#233;clench&#233;es en fonction des jugements de et port&#233;s
par l&#8217;&#233;nonc&#233; courant On. Il existe deux types de r&#232;gles. Les r&#232;gles de U ou de UR impliquent
que la r&#233;action du syst&#232;me est enti&#232;rement d&#233;termin&#233;e par la r&#233;solution de la divergence, par
exemple gr&#226;ce &#224; l&#8217;initiation d&#8217;un &#233;change incident. Les r&#232;gles de UR impliquent que la r&#233;action
du syst&#232;me est d&#233;termin&#233;e par l&#8217;ancrage d&#8217;autres &#233;nonc&#233;s et/ou par la gestion de la t&#226;che (Denis
et al., 2007). En effet lorsqu&#8217;un &#233;nonc&#233;On est UR / UR et cl&#244;t un &#233;change incident, il provoque
la r&#233;interpr&#233;tation de l&#8217;&#233;nonc&#233; accept&#233; Oi, entra&#238;nant alors le besoin d&#8217;effectuer un nouveau
jugement de compr&#233;hension sur Oi et alors de d&#233;cider en fonction de ce nouveau jugement
les op&#233;rations &#224; effectuer. Le cas &#233;ch&#233;ant, le processus d&#8217;ancrage s&#8217;applique sur Oi et sur On.
Le mod&#232;le des grounding acts ne consid&#232;re pas la r&#233;interpr&#233;tation des jugements puisque les
preuves de compr&#233;hension sont suppos&#233;es ancr&#233;es par d&#233;faut.
</p>
<p>R&#233;interpr&#233;tation. La r&#233;interpr&#233;tation consiste &#224; effectuer de nouveau l&#8217;interpr&#233;tation d&#8217;un
&#233;nonc&#233;Oi gr&#226;ce &#224; de nouvelles informations apport&#233;es par un &#233;nonc&#233;On, soit qu&#8217;il s&#8217;agit d&#8217;une
r&#233;ponse &#224; unU initi&#233; par S, ou soit qu&#8217;On manifeste unUR. La diff&#233;rence principale tient au fait
que dans le premier cas l&#8217;interpr&#233;tation est jug&#233;e probl&#233;matique a priori et dans le second elle</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation du principe d&#8217;ancrage pour la robustesse des syst&#232;mes de dialogue
</p>
<p>l&#8217;est a posteriori. Dans les deux cas l&#8217;alt&#233;ration de l&#8217;ancienne interpr&#233;tation et du contexte peut
conduire &#224; r&#233;viser la structure du dialogue (voir l&#8217;effet de l&#8217;UR dans le mod&#232;le des &#233;changes)
ainsi que les jugements de compr&#233;hension de et port&#233;s par Oi. L&#8217;acquisition de nouveaux ju-
gements permet alors de r&#233;agir &#224; l&#8217;&#233;volution de la compr&#233;hension. Par exemple le fait qu&#8217;un
&#233;nonc&#233; U demeure U malgr&#233; l&#8217;emploi d&#8217;une strat&#233;gie donn&#233;e sugg&#232;re que le probl&#232;me doit &#234;tre
abord&#233; avec une strat&#233;gie diff&#233;rente. Le fait que plusieurs interpr&#233;tations se produisent lors-
qu&#8217;on re&#231;oit un &#233;nonc&#233; entra&#238;ne que la sortie du module d&#8217;ancrage est une liste de jugements de
compr&#233;hension.
</p>
<p>3.5 Production des preuves de compr&#233;hension
</p>
<p>Enfin, lorsque les jugements de compr&#233;hension ont &#233;t&#233; calcul&#233;s et recalcul&#233;s, la structure de dia-
logue mise &#224; jour et toutes les r&#233;interpr&#233;tations effectu&#233;es, il est n&#233;cessaire de produire l&#8217;&#233;nonc&#233;
suivant. Une strat&#233;gie na&#239;ve du type &#171; Je ne comprends pas. Veuillez reformuler. &#187; n&#8217;a que
peu de chances de parvenir &#224; la convergence essentiellement parce que la manifestation de la
non-compr&#233;hension est trop pauvre : elle n&#8217;indique que l&#8217;existence d&#8217;un probl&#232;me. Par exemple
&#171; Je ne comprends pas &quot;cet h&#244;tel&quot;. C&#8217;est vide. Quel h&#244;tel ? &#187; contient quatre indices permettant
&#224; l&#8217;utilisateur d&#8217;inf&#233;rer le probl&#232;me :
</p>
<p>&#8211; &#171; Je ne comprends pas &#187; qui manifeste l&#8217;existence d&#8217;un probl&#232;me d&#8217;interpr&#233;tation,
&#8211; &#171; &quot;cet h&#244;tel&quot; &#187; qui d&#233;signe la couverture lexicale du probl&#232;me,
&#8211; &#171; C&#8217;est vide. &#187; qui pr&#233;sente l&#8217;&#233;tat dans lequel se trouve le syst&#232;me (ici le type de probl&#232;me
rencontr&#233;),
</p>
<p>&#8211; &#171; Quel h&#244;tel ? &#187; qui correspond &#224; la requ&#234;te destin&#233;e &#224; r&#233;soudre le probl&#232;me.
</p>
<p>Ces indices sont construits lorsque le syst&#232;me &#233;tablit les jugements SS et SO. Leur manifes-
tation dans le dialogue en fait des preuves de compr&#233;hension, traduisant l&#8217;&#233;tat des participants
relativement &#224; l&#8217;ancrage.
</p>
<p>Enfin, le syst&#232;me doit &#234;tre capable d&#8217;exprimer l&#8217;ensemble des jugements qu&#8217;il effectue &#224; l&#8217;aide
de plusieurs preuves de compr&#233;hension dans un m&#234;me &#233;nonc&#233;. Nous proposons de coordonner
ces preuves au moyen de connecteurs discursifs, afin de manifester explicitement le r&#233;sultat
de la r&#233;interpr&#233;tation (Byron &amp; Heeman, 1997). Ces marqueurs fournissent un compte-rendu
des raisonnements effectu&#233;s et de l&#8217;&#233;tat dans lequel se trouve le syst&#232;me : si la r&#233;interpr&#233;tation
aboutit &#224; un jugement UR de l&#8217;&#233;nonc&#233;, alors utiliser &#171; donc &#187;, si elle aboutit &#224; un jugement U
ou UR, alors utiliser &#171; mais &#187;.
</p>
<p>4 Exemple d&#233;taill&#233;
</p>
<p>L&#8217;exemple que nous proposons (figure 4), issu de l&#8217;impl&#233;mentation du mod&#232;le, illustre la ges-
tion de deux ph&#233;nom&#232;nes : une mauvaise interpr&#233;tation suivie d&#8217;un &#233;chec de r&#233;interpr&#233;tation.
Le dialogue ne s&#8217;applique pas sur une t&#226;che extra-linguistique, le seul but du syst&#232;me S est ici
d&#8217;ancrer l&#8217;interpr&#233;tation des expressions r&#233;f&#233;rentielles de l&#8217;utilisateur O. Pour cet exemple, les
jugements sont calcul&#233;s de mani&#232;re tr&#232;s simple : SS ne s&#8217;appuie que sur le r&#233;sultat de la r&#233;so-
lution de la r&#233;f&#233;rence, SO n&#8217;est pas calcul&#233;, OO et OS sont d&#233;duits de la force illocutoire et du
contenu propositionnel (par exemple, un &#171; non &#187; qui n&#8217;est pas pr&#233;c&#233;d&#233; d&#8217;une question ferm&#233;e
manifeste un UR).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>O0 : je prends l&#8217;h&#244;tel europa
S1 : OK un h&#244;tel
O2 : non l&#8217;h&#244;tel europa
S3 : je ne comprends pas &quot;l&#8217;h&#244;tel europa&quot;.
</p>
<p>: Pour moi, &quot;l&#8217;h&#244;tel europa&quot; r&#233;f&#232;re &#224; un h&#244;tel (quelconque)
O4 : non &#231;a r&#233;f&#232;re &#224; l&#8217;europa
S5 : OK OK donc l&#8217;europa
O6 : OK
</p>
<p>FIG. 1 &#8211; Mauvaise compr&#233;hension avec r&#233;interpr&#233;tation &#233;chou&#233;e
</p>
<p>En recevant O0, S construit le jugement UR/UR mais interpr&#232;te mal l&#8217;expression &#171; l&#8217;h&#244;tel eu-
ropa &#187; sans le percevoir4. Puisque O0 est le premier &#233;nonc&#233;, il initie un &#233;change niveau dialogue
auquel S1 r&#233;pond par une simple paraphrase (voir figure 2-a).
</p>
<p>(a) (b) (c)
</p>
<p>FIG. 2 &#8211; Structures du dialogue 4
</p>
<p>Lorsqu&#8217;il re&#231;oit O2, S construit le jugement UR/UR : il croit d&#8217;abord comprendre O2 mais
le &#171; non &#187; indique sa mauvaise compr&#233;hension de O0. Cet UR a deux effets : d&#8217;abord une
restructuration du dialogue, S1 n&#8217;est plus une r&#233;ponse pertinente &#224; O0 et est d&#233;plac&#233;e dans
l&#8217;acceptation de O0 (voir 2-b), ensuite une r&#233;interpr&#233;tation de O0.
</p>
<p>Cependant, &#233;tant donn&#233; que les r&#233;f&#233;rents des expressions cible (enO2) et source (enO0) sont les
m&#234;mes pour S, cette r&#233;interpr&#233;tation &#233;choue, entra&#238;nant alors un jugement U de O2. S produit
son &#233;nonc&#233; S3 en explicitant sa non-compr&#233;hension par la couverture du probl&#232;me (&#171; &quot;l&#8217;h&#244;tel
europa&quot; &#187;), le niveau du probl&#232;me (&#171; r&#233;f&#232;re &#224; &#187;) et son &#233;tat (&#171; Pour moi, X r&#233;f&#232;re &#224; Y &#187;). La
non-compr&#233;hension entra&#238;ne alors l&#8217;initiation par S3 d&#8217;un &#233;change incident dans l&#8217;acceptation
de O2 (voir figure 2-b).
</p>
<p>Lorsque S re&#231;oit O4, il parvient &#224; analyser correctement &#171; l&#8217;europa &#187;, gr&#226;ce cette fois &#224; une
bonne s&#233;mantique. S peut alors r&#233;interpr&#233;ter O2 gr&#226;ce &#224; l&#8217;&#233;change &#12296;S3,O4&#12297;. Cette r&#233;interpr&#233;ta-
tion conduit au jugement de O2 UR/UR, et provoque &#224; son tour la r&#233;interpr&#233;tation de O0 en
vertu du fait que O2 cl&#244;t un &#233;change d&#8217;acceptation. Enfin, puisque d&#233;sormais les r&#233;f&#233;rents des
expressions cible et source sont diff&#233;rents, cette r&#233;interpr&#233;tation r&#233;ussit et le nouveau jugement
de O0 est alors UR/UR. S produit son &#233;nonc&#233; S5 en manifestant trois preuves : sa compr&#233;hen-
</p>
<p>4Cette erreur a &#233;t&#233; r&#233;ellement observ&#233;e lors de l&#8217;&#233;valuationMEDIA et est caus&#233;e par une s&#233;mantique incompl&#232;te
de &#171; europa &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation du principe d&#8217;ancrage pour la robustesse des syst&#232;mes de dialogue
</p>
<p>sion de O4, de O2, traduites par des &#171; OK &#187; et de O0, traduite par une paraphrase, coordonnant
les deux derni&#232;res par un &#171; donc &#187;. S5 cl&#244;t l&#8217;&#233;change initi&#233; par O0 (voir figure 2-c).
</p>
<p>5 Conclusion et perspectives
</p>
<p>Lemod&#232;le d&#8217;ancrage que nous avons pr&#233;sent&#233; a pour avantage de s&#8217;appuyer sur des croyances de
compr&#233;hension finies tout en motivant le besoin de fournir des preuves de compr&#233;hension. Ces
preuves sont la manifestation des jugements de compr&#233;hension que chaque participant &#233;labore
lorsqu&#8217;il interpr&#232;te les &#233;nonc&#233;s de son partenaire. Le mod&#232;le permet de rendre compte de la non-
compr&#233;hension ou de la mauvaise compr&#233;hension, qu&#8217;elle soit issue de l&#8217;interpr&#233;tation ou de la
r&#233;interpr&#233;tation. Il souffre toutefois de nombreuses limitations : la plus importante est qu&#8217;il ne
consid&#232;re que les tours de parole mono-contributifs. En effet, un locuteur peut fournir plusieurs
preuves de compr&#233;hension, et si nous avons rendu compte de leur production, l&#8217;interpr&#233;tation
de ces preuves multiples soul&#232;ve des probl&#232;mes difficiles quant &#224; la gestion de la structure du
dialogue. La seconde limitation est que le mod&#232;le se limite &#224; la non-compr&#233;hension de ces
derni&#232;res (Denis et al., 2007) et pas &#224; leur mauvaise compr&#233;hension en raison de la complexit&#233;
de la r&#233;interpr&#233;tation des preuves. Il s&#8217;agit pourtant d&#8217;un enjeu majeur &#233;tant donn&#233; la difficult&#233;
des syst&#232;mes &#224; percevoir qu&#8217;ils ne comprennent pas.
</p>
<p>Pour &#233;valuer si ces limitations ont un impact sur la robustesse du syst&#232;me, l&#8217;&#233;valuation ME-
DIA ne saurait &#234;tre suffisante en raison de sa nature statique. Il est n&#233;cessaire, afin d&#8217;&#233;valuer la
robustesse externe de pouvoir &#233;valuer le syst&#232;me dans l&#8217;interaction. Nous nous orientons vers
le paradigme SIMDIAL (Allemandou, 2007) qui permet d&#8217;&#233;valuer un syst&#232;me en simulant un
utilisateur de mani&#232;re d&#233;terministe. Le but du dialogue est alors l&#8217;ancrage des &#233;nonc&#233;s pro-
pos&#233;s par l&#8217;utilisateur simul&#233;. L&#8217;&#233;valuation consiste &#224; d&#233;terminer si le syst&#232;me peut atteindre
l&#8217;interpr&#233;tation de l&#8217;utilisateur par le dialogue et comment il peut l&#8217;atteindre. Nous esp&#233;rons en
particulier retirer de cette &#233;valuation des indices fins quant aux meilleures strat&#233;gies &#224; employer
pour la convergence de l&#8217;interpr&#233;tation.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALLEMANDOU J. (2007). SIMDIAL, un paradigme d&#8217;&#233;valuation automatique de syst&#232;mes de
Dialogue homme-machine par simulation d&#233;terministe d&#8217;utilisateurs. PhD thesis, Universit&#233;
Paris Sud, Orsay.
</p>
<p>BONNEAU-MAYNARD H., AYACHE C., B&#201;CHET F., DENIS A., KHUN A., LEF&#200;VRE F.,
MOSTEFA D., QUIGNARD M., ROSSET S., SERVAN C. &amp; VILLANEAU J. (2006). Results of
the french evalda-media evaluation campaign for literal understanding. In Proceedings of the
Language Resources and Evaluation Conference, G&#234;nes, Italie.
</p>
<p>BYRON D. &amp; HEEMAN P. (1997). Discourse marker use in task-oriented spoken dialog. In
Proceedings of Eurospeech&#8217;97, p. 2223&#8211; 2226, Rhodes, Gr&#232;ce.
</p>
<p>CAHN J. &amp; BRENNAN S. (1999). A psychological model of grounding and repair in dialog. In
AAAI Fall Symposium on Psychological Models of Communication in Collaborative Systems,
Sea Cliff, MA.
</p>
<p>CLARK H. (1996). Using Language. Cambridge University Press.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alexandre Denis, Matthieu Quignard
</p>
<p>CLARK H. &amp; SCHAEFER E. (1989). Contributing to discourse. Cognitive Science, 13, 259&#8211;
294.
</p>
<p>DANIELI M. (1996). On the use of expectations for detecting and repairing human-machine
miscommunication. In AAAI-96 Workshop on Detecting, Preventing, and Repairing Human-
Machine Miscommunications, Portland, OR.
</p>
<p>DENIS A., PITEL G., QUIGNARD M. &amp; BLACKBURN P. (2007). Incorporating asymmetric
and asychronous evidence of understanding in a grounding model. In Proceedings of DECA-
LOG, the 11th International Workshop on the Semantics and Pragmatics of Dialogue, Trento,
Italie.
</p>
<p>KRAHMER E., SWERTS M., THEUNE M. &amp; WEEGELS M. (1999). Problem spotting in
human-machine interaction. In Eurospeech 1999, p. 1423&#8211;1426, Budapest, Hongrie.
</p>
<p>LARSSON S. (2002). Issue-based Dialogue Management. PhD thesis, Goteborg University.
</p>
<p>LEHUEN J. (1997). Un mod&#232;le de dialogue dynamique et g&#233;n&#233;rique int&#233;grant l&#8217;acquisition de
sa comp&#233;tence linguistique - Le syst&#232;me Coala. PhD thesis, Universit&#233; du Maine - Le Mans.
</p>
<p>LEWIS D. (1969). Convention: A Philosophical Study. Harvard University Press.
</p>
<p>LUZZATI D. (1995). De l&#8217;erreur en DHM. Cahiers de Linguistique Fran&#231;aise, 16, 175&#8211;192.
MCROY S. &amp; HIRST G. (1993). Abductive explanations of dialogue misunderstanding. In
6th Conference of the European Chapter of the Association for Computational Linguistic, p.
277&#8211;286, Utrecht, Pays-Bas.
</p>
<p>NAKANO Y., REINSTEIN G., STOCKY T. &amp; CASSELL J. (2003). Towards a model of face-
to-face grounding. In Proceedings of Association for Computational Linguistics, Sapporo,
Japon.
</p>
<p>PAEK T. (2003). Toward a taxonomy of communication errors. In ISCA Workshop on Error
Handling in Spoken Dialogue Systems, p. 53&#8211;58, Ch&#226;teau d&#8217;Oex, Vaud, Suisse.
</p>
<p>PURVER M., RATIU F. &amp; L.CAVEDON (2006). Robust interpretation in dialogue by combi-
ning confidence scores with contextual features. In INTERSPEECH: International Conference
on Spoken Language Processing, Pittsburgh, PA.
</p>
<p>SCHLANGEN D. (2004). Causes and strategies for requesting clarification in dialogue. In
Proceedings of SIGDial, Workshop on Discourse and Dialogue, Boston, MA.
</p>
<p>STALNAKER R. (1998). On the representation of context. Journal of Logic, Language and
Information, 7(1), 3&#8211;19.
TAYLOR J. A., CARLETTA J. &amp; MELLISH C. (1996). Requirements for belief models in
cooperative dialogue. User Modeling and User-Adapted Interaction, 6(1), 23&#8211;68.
TRAUM D. R. (1999). Computational models of grounding in collaborative systems. In
Working Papers of the AAAI., p. 124&#8211;131, Menlo Park, California: AAAI.</p>

</div></div>
</body></html>