<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers l&#8217;identification et le traitement des actes de dialogue composites</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p>Vers l&#8217;identification et le traitement 
des actes de dialogue composites 
</p>
<p>Fr&#233;d&#233;ric Landragin 
</p>
<p>CNRS &#8211; Laboratoire LaTTICe (UMR 8094) 
1 rue Maurice Arnoux &#8211; 92120 Montrouge 
</p>
<p>frederic.landragin@linguist.jussieu.fr 
</p>
<p>R&#233;sum&#233; Il peut &#234;tre difficile d&#8217;attribuer une seule valeur illocutoire &#224; un &#233;nonc&#233; dans un 
dialogue. En premier lieu, un &#233;nonc&#233; peut comporter plusieurs segments de discours ayant 
chacun leur valeur illocutoire sp&#233;cifique. De plus, un seul segment peut s&#8217;analyser en tant 
qu&#8217;acte de langage composite, regroupant par exemple la formulation d&#8217;une question et 
l&#8217;&#233;mission simultan&#233;e d&#8217;une information. Enfin, la structure du dialogue en termes d&#8217;&#233;changes 
et de s&#233;quences peut &#234;tre d&#233;terminante dans l&#8217;identification de l&#8217;acte, et peut &#233;galement 
apporter une valeur illocutoire suppl&#233;mentaire, comme celle de clore la s&#233;quence en cours. 
Dans le but de d&#233;terminer la r&#233;action face &#224; un tel acte de dialogue composite, nous 
pr&#233;sentons une approche th&#233;orique pour l&#8217;analyse des actes de dialogue en fonction du 
contexte de t&#226;che et des connaissances des interlocuteurs. Nous illustrons sur un exemple nos 
choix de segmentation et d&#8217;identification des actes composites, et nous pr&#233;sentons les grandes 
lignes d&#8217;une strat&#233;gie pour d&#233;terminer la r&#233;action qui semble &#234;tre la plus pertinente. 
</p>
<p>Abstract Attributing one illocutionary value to a utterance in a dialogue can be difficult. 
First, a utterance can include several discourse segments, each one with a specific 
illocutionary value. Moreover, one discourse segment can be linked to a complex speech act 
that groups for instance a question together with the assertion of new information. Finally, the 
dialogue structure with the various exchanges and sequences can be decisive when identifying 
the dialogue act, and can also bring an additional illocutionary value, for instance the one 
consisting of closing the current sequence. With the aim to determine how to react to such a 
composite dialogue act, we present a theoretical approach to dialogue act analysis considering 
the task context and the dialogue participants&#8217; knowledge. We illustrate our choices in terms 
of segmentation and identification of composite acts, and we present the main features of a 
strategy for determining the most relevant reaction. 
</p>
<p>Mots-cl&#233;s :   Actes de langage complexes, structure du dialogue, terrain commun 
Keywords:   Complex speech acts, dialogue structure, common ground 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>1 Introduction 
Le terme &#171; acte de langage &#187; d&#233;signe l&#8217;acte que l&#8217;on fait en parlant, en utilisant le langage 
dans une situation de communication. Dans la th&#233;orie de Searle, un acte de langage se d&#233;finit 
par un but, un pr&#233;-requis, un corps (c&#8217;est-&#224;-dire une r&#233;alisation), et des effets (Searle, 1969). 
Cette d&#233;finition fait intervenir, en plus de la mat&#233;rialisation linguistique, un certain nombre 
d&#8217;aspects relevant des motivations et des intentions communicatives. La communication, et 
par cons&#233;quent le dialogue et le dialogue homme-machine, font intervenir non seulement la 
compr&#233;hension des contenus des messages &#233;chang&#233;s, mais aussi la reconnaissance des 
intentions sous-jacentes et l&#8217;attribution d&#8217;&#233;tats mentaux, de mani&#232;re &#224; interpr&#233;ter correctement 
ces messages &#233;chang&#233;s. En fin de compte, on tend &#224; inclure des aspects extra-linguistiques 
dans le processus d&#8217;interpr&#233;tation et dans la notion d&#8217;acte de langage. Le contexte de 
communication devient un &#233;l&#233;ment essentiel, et c&#8217;est peut-&#234;tre pourquoi certains pr&#233;f&#232;rent 
parler d&#8217;&#171; actes de parole &#187;, d&#8217;&#171; actes de communication &#187; ou encore d&#8217;&#171; actes de dialogue &#187;. 
L&#8217;acte se d&#233;finit quasiment par son contexte de r&#233;alisation, l&#8217;acte de dialogue d&#233;signant l&#8217;unit&#233; 
minimale de communication dans un contexte dialogique. 
</p>
<p>En suivant cette voie et en l&#8217;adaptant au domaine du traitement automatique des langues, un 
&#171; acte de dialogue homme-machine &#187; se d&#233;finit par l&#8217;unit&#233; minimale d&#8217;&#233;change entre la 
machine et son utilisateur. C&#8217;est l&#8217;unit&#233; sur laquelle se base le gestionnaire de dialogue pour 
comprendre l&#8217;action de l&#8217;utilisateur et d&#233;cider du comportement &#224; adopter, de l&#8217;action &#224; 
ex&#233;cuter, de l&#8217;information &#224; fournir et du message &#224; envoyer au g&#233;n&#233;rateur de langue 
naturelle. Dans ce contexte, l&#8217;acte de dialogue homme-machine est une notion surtout 
op&#233;rationnelle. L&#8217;annotation de dialogues homme-machine en tenant compte de la progression 
de la t&#226;che applicative constitue alors une m&#233;thode pertinente pour tester cette notion d&#8217;acte. 
</p>
<p>Qu&#8217;il se d&#233;roule entre deux humains ou entre un humain et une machine, un dialogue se 
caract&#233;rise par un certain nombre d&#8217;aspects qui peuvent &#234;tre inclus dans la notion d&#8217;acte de 
dialogue, en la complexifiant d&#8217;autant, c&#8217;est-&#224;-dire en la rendant &#171; composite &#187;. Il en est ainsi : 
des tours de parole ; des &#233;changes que l&#8217;on peut organiser en &#233;changes principaux et en sous-
&#233;changes ; des s&#233;quences particuli&#232;res d&#8217;ouverture et de cl&#244;ture ; et surtout de la finalit&#233; du 
dialogue qui dirige les interlocuteurs vers la co-construction d&#8217;un but commun, la r&#233;solution 
d&#8217;une t&#226;che telle que trouver un billet de train pour aller d&#8217;un endroit &#224; un autre, obtenir une 
information enregistr&#233;e dans une base de donn&#233;es, ou encore faire ex&#233;cuter &#224; la machine une 
s&#233;rie d&#8217;actions sur les objets qu&#8217;elle g&#232;re. Comme chaque message &#233;chang&#233; peut &#234;tre li&#233; &#224; 
plusieurs niveaux d&#8217;acte de dialogue (niveau du simple tour de parole, niveau de l&#8217;&#233;change), 
on parlera d&#8217;actes multi-niveaux ou d&#8217;actes composites (Popescu-Belis, 2005). 
La notion d&#8217;acte composite a d&#233;j&#224; &#233;t&#233; bien &#233;tudi&#233;e (on pensera par exemple aux travaux de 
Levinson ou de Gazdar), en particulier pour rendre compte des actes de langage indirects, 
avec l&#8217;hypoth&#232;se qu&#8217;un &#233;nonc&#233; tel que &#171; peux-tu me passer le sel ? &#187; ou &#171; avez-vous 
l&#8217;heure ? &#187; peut transmettre selon les interpr&#233;tations et les contextes, soit une requ&#234;te (acte 
purement indirect), soit &#224; la fois une question et une requ&#234;te (acte composite). La maxime 
originelle &#171; quand dire, c&#8217;est faire &#187; est ainsi reprise par (Kerbrat-Orecchioni, 2001) en 
&#171; quand dire, c&#8217;est faire une chose sous les apparences d&#8217;une autre &#187; (actes purement 
indirects) et &#171; quand dire, c&#8217;est faire plusieurs choses &#224; la fois &#187; (actes composites). La notion 
d&#8217;acte composite reste cependant pour le moment tr&#232;s li&#233;e &#224; celle d&#8217;acte indirect, et ne nous 
semble pas assez d&#233;velopp&#233;e dans le cadre du dialogue. La majorit&#233; des travaux portant sur 
les actes de langage dans le dialogue s&#8217;int&#233;ressent &#224; d&#233;terminer des typologies d&#8217;actes 
(Popescu-Belis, 2005), dont la mise en &#339;uvre pose de nombreux probl&#232;mes sur les 
ph&#233;nom&#232;nes observ&#233;s et la coh&#233;rence des cat&#233;gories (Traum, 2000). Un exemple de typologie </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement des actes de dialogue composites 
</p>
<p>progressant constamment est celle de Harry Bunt et de ses &#233;tudiants, accessible &#224; : 
http://ls0143.uvt.nl/dit/. Certains chercheurs incluent dans leur typologie des aspects li&#233;s &#224; la 
structure du dialogue, avec par exemple la notion de paire adjacente telle que la paire 
question-r&#233;ponse (Asher, Lascarides, 2003), mais l&#8217;obtention d&#8217;une typologie sans 
recouvrement ni manque reste tr&#232;s d&#233;licate. Une voie qui nous semble &#233;clairante est la 
d&#233;termination des typologies de types d&#8217;actes, avec les &#233;l&#233;ments suivants : les actes partiels 
(Bunt, Schiffrin, 2007) ; les actes simples (Searle, 1969) ; les actes indirects (Searle, 1975) ; 
les actes composites (Bunt, 2000) ; les tentatives d&#8217;actes (Cohen, Levesque, 1995) ; ou encore, 
en revenant &#224; Searle, les faux-actes (si le locuteur dit &#171; Es regnet &#187; avec non pas une intention 
de sens mais une intention d&#8217;exercice de prononciation allemande). On parlera de l&#8217;un ou 
l&#8217;autre de ces types d&#8217;actes selon que l&#8217;action de l&#8217;utilisateur est interrompue, aboutie, d&#233;riv&#233;e, 
multiple, tent&#233;e ou factice. Une autre voie consiste tout simplement &#224; d&#233;passer la notion d&#8217;acte 
de langage et &#224; mettre en place d&#8217;autres th&#233;ories pour rendre compte des ph&#233;nom&#232;nes de 
dialogue. Par exemple, (Trognon, Brassac, 1988) montrent que la th&#233;orie des actes de langage 
n&#8217;est pas &#224; m&#234;me de fournir une th&#233;orie des encha&#238;nements conversationnels et que les 
th&#233;ories qui essayent de rendre compte des structures du dialogue avec des actes de langage 
n&#8217;y parviennent pas. Pour notre part, nous pensons que c&#8217;est possible, &#224; condition de bien 
approfondir la notion d&#8217;acte composite. 
</p>
<p>A quel moment observe-t-on un acte de dialogue composite ? Tous les actes de dialogue sont-
ils composites ? Jusqu&#8217;o&#249; peut-on aller dans l&#8217;identification des &#171; sous-actes &#233;l&#233;mentaires &#187; 
port&#233;s par un &#233;nonc&#233; ? A quel moment doit-on s&#8217;arr&#234;ter dans cette identification ? Dans cet 
article, nous proposons quelques pistes pour r&#233;pondre &#224; ces questions, en posant et en &#233;tudiant 
les probl&#232;mes li&#233;s &#224; la nature des actes composites (section 2), puis en proposant une m&#233;thode 
d&#8217;analyse et de traitement de ces actes par un gestionnaire de dialogue (section 3). 
</p>
<p>2 Nature des actes de dialogue composites 
</p>
<p>2.1 En partant de l&#8217;&#233;nonc&#233; lui-m&#234;me 
</p>
<p>Premi&#232;re possibilit&#233; : on d&#233;finit un &#171; acte de dialogue &#187; par l&#8217;acte port&#233; par un &#233;nonc&#233; en tant 
que tour de parole dans son ensemble. Ainsi, tout ce que le locuteur dit sans &#234;tre interrompu 
par l&#8217;interlocuteur est group&#233; dans un acte. Dans ce cas, un &#233;nonc&#233; comportant deux phrases 
ou plus est forc&#233;ment un &#171; acte composite &#187;. Par ailleurs, une phrase r&#233;partie sur deux &#233;nonc&#233;s 
(quand par exemple l&#8217;interlocuteur poursuit et compl&#232;te ce que dit le locuteur) porte alors 
deux actes de dialogue qui rendent bien compte des &#233;tapes interactionnelles. Ceci entra&#238;ne la 
prise en compte d&#8217;actes partiels (Bunt, Schiffrin, 2007), n&#233;cessaires pour rendre compte de la 
prise en charge par le locuteur de la premi&#232;re partie de la phrase seulement. L&#8217;interlocuteur, 
quant &#224; lui, prend &#224; sa charge plut&#244;t l&#8217;ensemble des deux parties, bien qu&#8217;il n&#8217;ait pas &#233;nonc&#233; la 
premi&#232;re (&#224; moins que sa compl&#233;tion ne vienne en aide au locuteur et ne refl&#232;te pas sa propre 
intention communicative, ce qui conduit alors &#224; un faux-acte). Si la compl&#233;tion de 
l&#8217;interlocuteur ne correspond pas &#224; l&#8217;intention pr&#233;alable du locuteur, nous avons bien deux 
actes diff&#233;rents pour rendre compte de ce fait. 
</p>
<p>Deuxi&#232;me possibilit&#233; : on d&#233;finit un acte de dialogue par l&#8217;acte port&#233; par une phrase. Dans ce 
cas il y a acte composite quand la phrase comporte plusieurs segments de discours. Il y a donc 
acte composite quand la phrase comporte un commentaire, une apposition, une clause 
subordonn&#233;e, une relative non restrictive, un &#233;pith&#232;te, et de mani&#232;re g&#233;n&#233;rale tout ph&#233;nom&#232;ne 
intra-phrastique qui permet de d&#233;composer la phrase en plusieurs intentions communicatives. 
C&#8217;est le cas en particulier des ph&#233;nom&#232;nes &#233;tudi&#233;s dans un autre but par (Potts, 2003). Tous </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>ces cas sont &#233;galement inclus dans la d&#233;finition pr&#233;c&#233;dente. Par contre, en suivant ce principe, 
un &#233;nonc&#233; comportant deux phrases s&#8217;analyse avec deux actes de dialogue distincts et non 
avec un acte composite. Les cons&#233;quences pour le gestionnaire de dialogue sont les m&#234;mes en 
ce qui concerne la d&#233;termination des intentions de l&#8217;utilisateur, mais pas en ce qui concerne la 
d&#233;termination des r&#233;actions possibles de la machine. En effet, la gestion de deux actes de 
dialogue sans lien entre les deux ne permet pas au syst&#232;me autant de possibilit&#233;s que la 
gestion d&#8217;un seul acte comportant plusieurs sous-actes ordonn&#233;s. Car, en effet, des crit&#232;res 
linguistiques permettent de classer les sous-actes par ordre d&#8217;importance (1. principale, 
2. subordonn&#233;e), ce qui permet un choix de r&#233;ponse au seul acte premier ou &#224; l&#8217;acte premier et 
&#224; l&#8217;acte second. Par ailleurs, une phrase r&#233;partie sur plusieurs &#233;nonc&#233;s s&#8217;analyse avec un seul 
acte de dialogue, ce qui peut poser des probl&#232;mes puisque cela ne rend pas compte de mani&#232;re 
simple de qui a dit quoi et de qui s&#8217;est impliqu&#233; dans quoi. 
</p>
<p>Troisi&#232;me possibilit&#233; : on d&#233;finit un acte de dialogue par l&#8217;acte port&#233; par le segment de 
discours, comme le fait la SDRT (Asher, Lascarides, 2003). Dans ce cas, les ph&#233;nom&#232;nes 
intra-phrastiques qui comportent plusieurs segments de discours ne constituent pas des actes 
composites, de m&#234;me d&#8217;ailleurs que les phrases coordonnant deux questions, deux ordres ou 
deux assertions. Par contre, un segment simple comme &#171; avez-vous l&#8217;heure ? &#187; peut toujours 
&#234;tre consid&#233;r&#233; comme un acte composite qui regroupe une question et une requ&#234;te. 
</p>
<p>Compte tenu de l&#8217;importance que nous donnons aux encha&#238;nements d&#8217;&#233;nonc&#233;s dans le 
dialogue, et compte tenu du fait qu&#8217;en dialogue homme-machine finalis&#233; il est rare qu&#8217;un 
&#233;nonc&#233; comporte plusieurs phrases, nous pr&#233;f&#233;rons la premi&#232;re solution. Par ailleurs, on peut 
ajouter aux aspects purement linguistiques les aspects paralinguistiques, en particulier la 
prosodie. Une phrase qui avec une prosodie conventionnelle constitue un acte simple, peut 
avec une prosodie inattendue constituer un acte composite. L&#8217;exemple typique est la phrase 
d&#233;clarative qui, avec une prosodie ad&#233;quate reste assertive, et, avec un contour interrogatif 
(montant ou simplement plat), peut devenir un acte composite groupant assertion et question. 
</p>
<p>2.2 En tenant compte du contexte situationnel imm&#233;diat 
</p>
<p>Une &#233;tape suppl&#233;mentaire pour aborder le probl&#232;me de la nature des actes de dialogue 
composites est de consid&#233;rer la situation communicative imm&#233;diate, c&#8217;est-&#224;-dire le contexte 
visuel &#224; l&#8217;instant de l&#8217;&#233;nonciation, en incluant les objets visibles et les comportements du 
locuteur, de l&#8217;interlocuteur, ainsi que des &#233;ventuels intervenants ext&#233;rieurs. Les param&#232;tres 
dont il faut alors tenir compte sont les gestes co-verbaux, les regards, les postures, les 
attitudes, les expressions faciales, etc. Par exemple, un locuteur qui se gratte ou qui produit 
toute une s&#233;rie de gestes trahissant des h&#233;sitations et un manque de confiance peut, en m&#234;me 
temps qu&#8217;il produit un acte de langage de type assertion, ajouter un acte de dialogue non 
verbal tr&#232;s significatif, plus proche de la question que de l&#8217;assertion. Cet exemple est similaire 
&#224; celui concernant la prosodie, en passant du paralinguistique &#224; l&#8217;extra-linguistique. Selon 
(Kerbrat-Orecchioni, 2001) c&#8217;est le mouvement de t&#234;te ou le geste d&#8217;ostension concomitant 
qui permet &#224; l&#8217;&#233;nonc&#233; &#171; peux-tu me passer le sel ? &#187; de valoir pour une requ&#234;te. 
</p>
<p>Pour nous, cet &#233;nonc&#233; linguistique &#224; l&#8217;interrogative reste essentiellement une question, mais 
l&#8217;apparition d&#8217;un geste &#224; l&#8217;instant de l&#8217;&#233;nonciation est fondamentale. Dans certains cas, le 
geste ne pourra &#234;tre interpr&#233;t&#233; que gr&#226;ce &#224; l&#8217;&#233;nonc&#233; concomitant. Un geste purement d&#233;ictique 
viendra ainsi permettre &#224; l&#8217;interlocuteur de r&#233;soudre une r&#233;f&#233;rence &#224; un objet ou &#224; un lieu, sans 
pour autant avoir une influence sur la valeur illocutoire de l&#8217;&#233;nonc&#233; dans son ensemble. Dans 
d&#8217;autres cas, on pourra attribuer tr&#232;s clairement au geste une valeur illocutoire : un geste peut 
fonctionner comme assertion (c&#8217;est le cas de la plupart des gestes quasi-linguistiques qui </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement des actes de dialogue composites 
</p>
<p>&#233;mettent une information &#224; destination de leur destinataire), comme question (une mimique 
interrogative, par exemple) ou comme ordre (le geste du professeur qui indique la porte &#224; un 
&#233;l&#232;ve, ou, dans le domaine des interfaces graphiques, le geste en forme de croix qui indique au 
syst&#232;me une action de suppression). Il nous semble donc l&#233;gitime de parler d&#8217;&#171; acte gestuel &#187; 
au m&#234;me niveau qu&#8217;&#171; acte de parole &#187;, tous deux &#233;tant des &#171; actes de dialogue &#187;. Dans les 
exemples que nous venons d&#8217;&#233;voquer, certains gestes se voient attribuer &#233;galement un contenu 
propositionnel, comme le geste en forme de croix. D&#8217;autres comme la mimique interrogative 
apportent juste une valeur illocutoire &#224; l&#8217;&#233;nonc&#233; (on ne conna&#238;t pas l&#8217;objet de la question). Au 
final, l&#8217;interlocuteur doit confronter les diff&#233;rentes valeurs illocutoires. Ainsi, pour revenir au 
cas d&#8217;une question produite en m&#234;me temps qu&#8217;un geste &#224; valeur illocutoire d&#8217;ordre, 
l&#8217;interlocuteur se trouve face &#224; deux valeurs illocutoires distinctes. Il peut alors : 
</p>
<p>&#8226; consid&#233;rer qu&#8217;il y a incompatibilit&#233; (en particulier si les contenus propositionnels 
diff&#232;rent, par exemple si la question ne porte pas sur le m&#234;me objet que le geste directif) ; 
</p>
<p>&#8226; consid&#233;rer que l&#8217;une des valeurs illocutoires prend le pas sur l&#8217;autre : dans notre cas, le 
geste, s&#8217;il ne vaut que pour sa valeur illocutoire d&#8217;ordre, impose cette valeur &#224; l&#8217;&#233;nonc&#233; 
dont la partie linguistique est alors consid&#233;r&#233;e comme acte indirect ; 
</p>
<p>&#8226; consid&#233;rer que les valeurs illocutoires sont compl&#233;mentaires, autrement dit que l&#8217;&#233;nonc&#233; 
dans sa globalit&#233; porte simultan&#233;ment les deux valeurs, et qu&#8217;il s&#8217;agit donc d&#8217;un acte de 
dialogue composite. 
</p>
<p>L&#8217;interlocuteur doit ainsi faire preuve de capacit&#233;s de fusion multimodale au niveau des 
valeurs illocutoires. Cette fusion peut &#234;tre &#233;galement dirig&#233;e par des aspects applicatifs pr&#233;cis. 
</p>
<p>2.3 En tenant compte de la structure de dialogue 
</p>
<p>Une troisi&#232;me fa&#231;on d&#8217;aborder le probl&#232;me consiste &#224; consid&#233;rer l&#8217;&#233;nonc&#233; courant comme un 
&#233;l&#233;ment d&#8217;une structure dialogique. Plus que le moment de l&#8217;&#233;nonciation, c&#8217;est tout 
l&#8217;historique du dialogue dont il est ici question. Cet historique commence avec l&#8217;&#233;nonc&#233; 
pr&#233;c&#233;dent, produit par l&#8217;interlocuteur, et rel&#232;ve donc de la paire adjacente, avec les paires 
question-r&#233;ponse, assertion-accus&#233; de r&#233;ception, et bien entendu l&#8217;exemple classique de la 
phrase &#224; l&#8217;imp&#233;ratif &#171; prends la rue Nationale &#187; qui constitue la r&#233;ponse &#224; la question 
&#171; comment puis-je aller au laboratoire ? &#187; et non un ordre. Autrement dit, la reconnaissance 
de l&#8217;acte de dialogue de l&#8217;&#233;nonc&#233; courant ne tient pas compte uniquement de l&#8217;&#233;nonc&#233; courant 
dans son contexte imm&#233;diat, mais tient compte &#233;galement de la structure du dialogue. Si la 
seconde est essentielle, le premier ne doit pas pour autant &#234;tre ignor&#233; : il se peut toujours que 
l&#8217;interlocuteur r&#233;agisse &#224; la forme qu&#8217;il peut juger trop directive. 
La structure du dialogue peut &#234;tre mod&#233;lis&#233;e en parlant d&#8217;un dialogue r&#233;gissant et de sous-
dialogues incidents, d&#8217;ench&#226;ssements hi&#233;rarchiques de paires action-r&#233;action, ou encore 
d&#8217;imbrications et de croisements non hi&#233;rarchiques mais plus libres d&#8217;actes &#233;l&#233;mentaires tels 
que des ordres, des questions et des assertions. C&#8217;est ainsi que (Portner, 2004) propose la 
gestion de piles de questions en cours de discussion (QUD, questions under discussion), 
d&#8217;ordres &#224; ex&#233;cuter (TDL, to do list) et d&#8217;informations assert&#233;es (CG, common ground, du 
moins dans son acception restreinte aux assertions). Le mod&#232;le hi&#233;rarchique genevois (Roulet 
et al., 1985) avec ses cinq niveaux peut donner des indications pr&#233;cieuses sur les ph&#233;nom&#232;nes 
&#224; l&#8217;origine de l&#8217;identification des sous-actes d&#8217;un acte composite. Le premier niveau est celui 
de l&#8217;acte de langage et a d&#233;j&#224; &#233;t&#233; discut&#233; dans la section 2.1. Le deuxi&#232;me niveau est celui de 
l&#8217;intervention et s&#8217;int&#233;resse &#224; l&#8217;&#233;nonc&#233; en tant qu&#8217;unit&#233; de tour de parole. C&#8217;est l&#224; qu&#8217;est </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>soulign&#233;e l&#8217;importance d&#8217;un acte directeur, qui donne &#224; l&#8217;interaction sa valeur pragmatique 
dominante, par rapport aux actes subordonn&#233;s qui peuvent ne provoquer aucune r&#233;action. Le 
troisi&#232;me niveau est celui de l&#8217;&#233;change, avec les exemples de paires adjacentes. Le mod&#232;le 
genevois met ici l&#8217;accent sur plusieurs ph&#233;nom&#232;nes. En particulier, une &#233;valuation de la 
r&#233;ponse (&#171; bon &#187;, &#171; ok &#187;) suit souvent la r&#233;ponse &#224; la question (donc trois interventions et pas 
seulement deux). Ensuite le fait que le d&#233;coupage en &#233;changes ne suit pas celui en 
interventions : on assiste souvent &#224; &#171; P1 &#187; (P pour proposition ou contenu propositionnel) 
suivi de &#171; P2 ; P3 &#187; suivi de &#171; P4 &#187;, o&#249; se trouvent un &#233;change P1-P2 et un &#233;change P3-P4. 
Enfin, on peut consid&#233;rer que tout &#233;nonc&#233; est en soi un accus&#233; de r&#233;ception, dans la mesure o&#249; 
sa pr&#233;sence m&#234;me prouve que le dialogue continue, c&#8217;est-&#224;-dire fonctionne, m&#234;me si c&#8217;est de 
mani&#232;re incompl&#232;te. Cet argument va clairement dans le sens de la pr&#233;sence syst&#233;matique 
d&#8217;actes composites dans le dialogue. Le quatri&#232;me niveau est celui de la s&#233;quence, qui se 
d&#233;finit pour un m&#234;me th&#232;me et inclut les phases d&#8217;ouverture, de d&#233;veloppement et de cl&#244;ture. 
Tout &#233;nonc&#233; peut ainsi porter un acte de dialogue de type cl&#244;ture de la s&#233;quence courante, ce 
qui ajoute une possibilit&#233; suppl&#233;mentaire de sous-acte. (Bunt, 2000) analyse dans ce sens un 
simple &#171; merci &#187;. Plus formellement, une s&#233;quence se termine quand les piles QUD et TDL 
sont vides. Enfin, le cinqui&#232;me niveau, celui de l&#8217;interaction, inclut les types de 
communication et les param&#232;tres qui les d&#233;finissent : continuit&#233; du groupe des participants, du 
cadre spatio-temporel, ainsi que des th&#232;mes abord&#233;s. Ce niveau ne pr&#233;sente aucune variabilit&#233; 
en dialogue homme-machine finalis&#233; et nous ne le retiendrons donc pas pour la d&#233;termination 
des composantes d&#8217;un acte composite. 
</p>
<p>2.4 En tenant compte de quelques aspects sociologiques 
</p>
<p>Une quatri&#232;me fa&#231;on d&#8217;aborder le probl&#232;me se fait en tenant compte de la nature des 
interlocuteurs et des enjeux sociologiques de leur dialogue, avec des aspects tels que attirer 
l&#8217;attention de l&#8217;interlocuteur sur quelque chose de particulier ; garder le contr&#244;le du sujet et du 
d&#233;roulement du dialogue ; ne pas perdre la face ; garder une certaine sup&#233;riorit&#233; hi&#233;rarchique 
par rapport &#224; l&#8217;autre ; etc. (Merin, 1994) propose par exemple une m&#233;thode formelle pour la 
prise en compte de ce qu&#8217;il appelle des actes sociaux &#233;l&#233;mentaires. Dans la mesure o&#249; tout 
&#233;nonc&#233; poss&#232;de une part sociale &#233;l&#233;mentaire, on arrive &#224; l&#8217;identification d&#8217;au moins un sous-
acte social dans l&#8217;acte composite correspondant. Plus r&#233;cemment, (Muller et al., 2006) 
incluent dans les aspects sociologiques les engagements et les obligations, et les int&#232;grent 
dans un cadre de s&#233;mantique formelle, la SDRT (Asher, Lascarides, 2003). 
</p>
<p>3 Proc&#233;dure de traitement des actes composites dans le dialogue 
L&#8217;ensemble des aspects d&#233;crits pr&#233;c&#233;demment n&#8217;est pas forc&#233;ment applicable au dialogue 
homme-machine, certains n&#233;cessitant des outils de TAL qui ne sont pas encore r&#233;alis&#233;s. Ainsi, 
la d&#233;tection automatique des segments de discours semble actuellement bien plus faisable que 
celle des ph&#233;nom&#232;nes intra-phrastiques permettant de d&#233;composer une phrase en plusieurs 
intentions communicatives. D&#8217;autre part, le dialogue homme-machine exploite tr&#232;s souvent un 
support visuel &#224; travers une interface graphique qui appara&#238;t &#224; l&#8217;&#233;cran et qui permet un certain 
nombre de contr&#244;les en plus ou &#224; la place de ceux autoris&#233;s par la modalit&#233; vocale. Chacun de 
ces contr&#244;les constitue un acte de dialogue potentiel, &#171; acte de dialogue &#187; &#233;tant ici employ&#233; 
dans une acception tr&#232;s large qui inclut les actions directes sur la machine, actions non 
verbales mais participant &#224; l&#8217;interaction, avec des traces physiques analysables. Face &#224; tous 
ces actes, un premier probl&#232;me consiste &#224; ordonner les diff&#233;rents sous-actes par ordre 
d&#8217;importance ou de pertinence, et un deuxi&#232;me probl&#232;me consiste &#224; choisir le nombre n 
sup&#233;rieur ou &#233;gal &#224; 1 tel que le syst&#232;me d&#233;cide de r&#233;agir aux n premiers actes. Nous allons </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement des actes de dialogue composites 
</p>
<p>proposer quelques pistes pour un tel traitement automatique des actes de dialogue composites, 
en consid&#233;rant un extrait de dialogue inspir&#233; d&#8217;un sc&#233;nario classique de r&#233;servation de billets 
de trains (U vaut pour l&#8217;utilisateur et S pour le syst&#232;me) : 
</p>
<p>U1 : &#171; Je voudrais aller &#224; Paris &#187; 
S1 : &#171; OK, voici les chemins pour aller &#224; Paris &#187; 
U2 : &#171; Combien de temps par ce chemin qui est sans doute le plus court ? &#187; 
S2 : &#171; Une heure vingt, mais ce n&#8217;est pas le chemin le plus court &#187; 
</p>
<p>Nous nous int&#233;ressons &#224; l&#8217;analyse de l&#8217;&#233;nonc&#233; U2, en la d&#233;composant en cinq &#233;tapes. 
</p>
<p>3.1 Premi&#232;re &#233;tape : analyse litt&#233;rale 
</p>
<p>Cette premi&#232;re &#233;tape regroupe l&#8217;analyse s&#233;mantique, la r&#233;solution en contexte des r&#233;f&#233;rences, 
et l&#8217;attribution des valeurs illocutoires litt&#233;rales. Elle permet d&#8217;obtenir une repr&#233;sentation 
s&#233;mantique et pragmatique initiale, sous la forme de structures de traits ou de formes logiques. 
Avec notre exemple, elle proc&#232;de tout d&#8217;abord &#224; l&#8217;analyse de la proposition principale de la 
phrase constituant U2, avec la r&#233;solution de la r&#233;f&#233;rence multimodale &#171; ce chemin &#187; + geste 
(multimodalit&#233; compl&#233;mentaire classique dans les syst&#232;mes multimodaux &#224; forte composante 
langagi&#232;re). En utilisant des pseudo formes logiques qui manquent de pr&#233;cision mais ont 
l&#8217;avantage de clarifier l&#8217;explication, on obtient ainsi la forme logique (1). La relative est pour 
sa part analys&#233;e en tant que commentaire et donc en tant qu&#8217;assertion (2). Quant au fait que 
l&#8217;&#233;nonc&#233; en lui-m&#234;me est un accus&#233; de bonne r&#233;ception du pr&#233;c&#233;dent, il permet d&#8217;obtenir (3) : 
</p>
<p>(1)   DEMANDE (U, S, &#955; x.x = dur&#233;e_trajet (trajet1)) 
(2)   DIRE_QUE (U, S, trajet1 = plus_court_chemin_vers (Paris)) 
(3)   DIRE_QUE (U, S, compr&#233;hension_&#233;nonc&#233;_pr&#233;c&#233;dent = OK) 
</p>
<p>Cette proposition (3) rel&#232;ve du niveau de l&#8217;&#233;change dans le mod&#232;le hi&#233;rarchique genevois. Le 
fait de poser une question relative &#224; des chemins prouve que l&#8217;utilisateur a correctement per&#231;u 
la r&#233;action pr&#233;c&#233;dente du syst&#232;me (que ce soit l&#8217;&#233;nonc&#233; verbal ou l&#8217;affichage graphique des 
chemins, vu que l&#8217;&#233;nonc&#233; U2 comporte une action de r&#233;f&#233;rence &#224; un chemin). Si le syst&#232;me 
avait &#233;nonc&#233; &#171; OK, voici les chemins pour aller &#224; Nancy &#187; ou s&#8217;il avait affich&#233; des chemins 
n&#8217;aboutissant pas &#224; Paris, il est clair que (3) et que l&#8217;acte de dialogue r&#233;sultant auraient &#233;t&#233; tr&#232;s 
diff&#233;rents, au point de changer compl&#232;tement le d&#233;roulement de l&#8217;interaction. 
</p>
<p>Pour rendre compte du niveau de la s&#233;quence, on devrait aussi ajouter un acte correspondant 
au fait que le th&#232;me courant, &#224; savoir la satisfaction du d&#233;sir de l&#8217;utilisateur de trouver un 
moyen d&#8217;aller sur Paris, n&#8217;est pas &#233;puis&#233;. En effet, le simple fait que U2 soit une question 
montre que S1 n&#8217;a pas suffit &#224; l&#8217;utilisateur. Nous ignorerons ce niveau pour ne pas surcharger. 
</p>
<p>3.2 Deuxi&#232;me &#233;tape : analyse des &#233;tats intentionnels sous-jacents 
La deuxi&#232;me &#233;tape met en rapport la repr&#233;sentation obtenue avec les &#233;tats intentionnels 
(d&#233;sirs, croyances) de l&#8217;utilisateur, c&#8217;est-&#224;-dire qu&#8217;elle active un certain nombre d&#8217;hypoth&#232;ses 
en fonction du r&#233;sultat de l&#8217;&#233;tape pr&#233;c&#233;dente. Nous utilisons un pr&#233;dicat DESIRER pour les 
d&#233;sirs et un pr&#233;dicat CROIRE pour les connaissances, sachant qu&#8217;on peut consid&#233;rer qu&#8217;une 
connaissance est une croyance avec la force la plus &#233;lev&#233;e. A la suite de (Steedman, Petrick, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>2007), nous utilisons en fait pour les connaissances les trois pr&#233;dicats : SAVOIR_QUE ; 
SAVOIR_SI et SAVOIR_VALEUR_DE : 
</p>
<p>(4)   DESIRER (U, SAVOIR_VALEUR_DE (U, dur&#233;e_trajet (trajet1))) 
(5)   CROIRE (U, trajet1 = plus_court_chemin_vers (Paris)) 
(6)   DESIRER (U, SAVOIR_SI (U, trajet1 = plus_court_chemin_vers (Paris))) 
</p>
<p>L&#8217;hypoth&#232;se (4) se d&#233;duit directement de la question (1). Ensuite, on a soit l&#8217;hypoth&#232;se (5), 
soit l&#8217;hypoth&#232;se (6). En fonction de celle qui va &#234;tre retenue, la r&#233;action du syst&#232;me va varier. 
Ainsi, l&#8217;hypoth&#232;se (5) traduit &#171; est-ce que l&#8217;utilisateur croit que c&#8217;est le chemin le plus 
court ? &#187;, ce qui correspond &#224; un commentaire exprimant une croyance et requ&#233;rant 
probablement une confirmation ou une infirmation. Pour sa part, l&#8217;hypoth&#232;se (6) traduit &#171; est-
ce que l&#8217;utilisateur veut savoir si c&#8217;est le chemin le plus court ? &#187;, ce qui correspond en 
quelque sorte &#224; un commentaire indirect, en fait une autre question qui requiert une r&#233;ponse. 
Autrement dit on aurait ici un acte indirect &#224; l&#8217;int&#233;rieur d&#8217;un acte composite. 
</p>
<p>3.3 Troisi&#232;me &#233;tape : confrontation aux connaissances du syst&#232;me 
</p>
<p>La troisi&#232;me &#233;tape active les connaissances et les r&#244;les du syst&#232;me qui peuvent intervenir 
compte tenu du r&#233;sultat de la premi&#232;re &#233;tape. Elle constitue un pendant &#224; la deuxi&#232;me &#233;tape, 
mais du c&#244;t&#233; du syst&#232;me plut&#244;t que de l&#8217;utilisateur. Dans notre cas : 
</p>
<p>(7)   SAVOIR_QUE (S, dur&#233;e_trajet (trajet1) = 80 min) 
(8)   SAVOIR_QUE (S, trajet1 = plus_court_chemin_vers (Paris)) 
(8&#8217;)  SAVOIR_QUE (S, trajet1 &#8800; plus_court_chemin_vers (Paris)) 
</p>
<p>La proposition (7)  traduit le fait que le syst&#232;me conna&#238;t effectivement la r&#233;ponse &#224; la question 
pos&#233;e (1), ce que l&#8217;on attend d&#8217;un tel syst&#232;me. Et les propositions (8) et (8&#8217;) traduisent le fait 
que le syst&#232;me est effectivement capable de confirmer ou d&#8217;infirmer le commentaire (2). Dans 
notre exemple, le commentaire est faux et on active la proposition (8&#8217;). 
</p>
<p>3.4 Quatri&#232;me &#233;tape : hi&#233;rarchisation des sous-actes de dialogue 
La quatri&#232;me &#233;tape se fonde sur les pr&#233;c&#233;dentes pour d&#233;terminer les valeurs illocutoires 
profondes et ainsi l&#8217;ensemble des sous-actes constituant l&#8217;acte de dialogue de l&#8217;&#233;nonc&#233; &#224; 
analyser. Elle consiste &#233;galement &#224; classer les sous-actes identifi&#233;s. Si nous retenons 
l&#8217;hypoth&#232;se (5) et non (6), l&#8217;acte composite correspondant &#224; U2 se compose donc d&#8217;une 
question, de l&#8217;expression d&#8217;une croyance (qui se trouve vraie) et d&#8217;un accus&#233; de bonne 
compr&#233;hension. 
</p>
<p>Chacun de ces actes a des cons&#233;quences sur la gestion du dialogue. La question entra&#238;ne une 
r&#233;ponse, c&#8217;est-&#224;-dire qu&#8217;en ajoutant un item &#224; QUD, elle incite fortement le syst&#232;me &#224; y r&#233;agir. 
L&#8217;expression d&#8217;une croyance qui est vraie n&#8217;a pas beaucoup d&#8217;incidence : si elle se trouve 
confirm&#233;e, une proposition sous forme de croyance devient une proposition sous forme de 
connaissance. Elle a en tout cas a moins d&#8217;incidence qu&#8217;une croyance fausse qui pourrait &#234;tre 
&#224; l&#8217;origine d&#8217;une incompr&#233;hension dans le dialogue. Quant &#224; l&#8217;accus&#233; de bonne r&#233;ception, il va 
dans le sens de la continuation du dialogue : si le syst&#232;me r&#233;agit en lien avec U2, il sera 
implicitement trait&#233; (la situation et la pertinence des actes auraient &#233;t&#233; tr&#232;s diff&#233;rentes s&#8217;il n&#8217;y 
avait pas eu accus&#233; de bonne r&#233;ception). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement des actes de dialogue composites 
</p>
<p>Si nous nous focalisons sur la question et l&#8217;expression de la croyance, nous avons des 
possibilit&#233;s d&#8217;&#233;volution du dialogue et de la t&#226;che tr&#232;s diff&#233;rentes. Compte tenu du fait que 
nous nous situons dans le cadre du dialogue homme-machine finalis&#233;, il appara&#238;t que r&#233;pondre 
&#224; la question est plus pertinent que confirmer la croyance. Ce point va &#234;tre &#224; l&#8217;origine des 
choix de la cinqui&#232;me &#233;tape, et son importance doit &#234;tre soulign&#233;e : nous avons ici consid&#233;r&#233; 
dans le contexte de dialogue que donner une valeur de r&#233;ponse &#224; une question est plus 
pertinent que confirmer une croyance, que cela correspond mieux aux r&#244;les du syst&#232;me et &#224; la 
t&#226;che en cours. Cela ne veut pas dire pour autant que nous classons syst&#233;matiquement des 
comportements tels que &#171; fournir une r&#233;ponse &#224; une question &#187;, &#171; confirmer une croyance &#187; ou 
encore &#171; infirmer une croyance &#187; dans un ordre pr&#233;d&#233;fini. Au contraire, c&#8217;est lors de cette 
&#233;tape que la finalit&#233; du dialogue et les contraintes de la t&#226;che peuvent s&#8217;exprimer. Chaque acte 
de dialogue peut aller dans le sens de la satisfaction de la t&#226;che ou non : dans certains cas 
comme le n&#244;tre, confirmer une croyance peut faire moins avancer la t&#226;che que fournir une 
r&#233;ponse &#224; une question ; dans d&#8217;autres cas, par exemple si la croyance est fondamentale pour 
la t&#226;che en cours, ce sera l&#8217;inverse. 
</p>
<p>3.5 Cinqui&#232;me &#233;tape : d&#233;termination des sous-actes auxquels r&#233;agir 
</p>
<p>Enfin, la cinqui&#232;me &#233;tape se charge de la d&#233;termination de la r&#233;ponse du syst&#232;me, c&#8217;est-&#224;-dire 
du choix du nombre de sous-actes auxquels r&#233;agir, ainsi que du choix des types de r&#233;actions 
(contenus des messages &#224; g&#233;n&#233;rer, ou &#171; quoi dire &#187; et &#171; quoi faire &#187;). Elle consiste pour le 
syst&#232;me &#224; choisir de r&#233;pondre seulement &#224; la question qui a &#233;t&#233; identifi&#233;e comme acte premier, 
ou &#224; la question et &#224; l&#8217;expression de la croyance. Si l&#8217;&#233;cart de pertinence entre l&#8217;acte premier 
et l&#8217;acte second est significatif, on ne retient que l&#8217;acte premier et on g&#233;n&#232;re quelque chose 
comme DIRE_QUE (S, U, dur&#233;e_trajet (trajet1) = 80 minutes). Si, comme ici, on retient les 
deux actes, on g&#233;n&#232;re S2. Nous ne nous &#233;tendrons pas sur les crit&#232;res permettant ce choix. Ces 
crit&#232;res peuvent en effet &#234;tre tr&#232;s nombreux et font intervenir beaucoup d&#8217;aspects de la t&#226;che 
applicative. Par exemple, si le syst&#232;me a pour priorit&#233; de vendre le billet le plus cher, il aura 
peut-&#234;tre int&#233;r&#234;t &#224; ne pas infirmer une croyance de mani&#232;re &#224; laisser l&#8217;utilisateur dans son 
erreur. Autrement dit, il sera amen&#233; dans un tel cas &#224; mentir par omission. Cette conclusion 
illustre en quoi la gestion des actes composites est importante et doit &#234;tre r&#233;alis&#233;e avec 
attention. 
</p>
<p>4 Conclusion et perspectives 
Nous avons soulign&#233; que les actes de langage dans le dialogue sont plus complexes qu&#8217;il n&#8217;y 
para&#238;t, et que la notion d&#8217;acte composite semble essentielle et omnipr&#233;sente, alors qu&#8217;elle n&#8217;est 
pas tant trait&#233;e dans la litt&#233;rature. Notre principal objectif &#233;tait ainsi de mettre l&#8217;accent sur des 
ph&#233;nom&#232;nes auxquels le TAL a trop tourn&#233; le dos et qui pourraient pourtant &#234;tre &#224; la base de 
syst&#232;mes communicants performants. Nous avons ainsi propos&#233; un ensemble de pistes pour 
un mod&#232;le d&#8217;identification et de traitement automatique des actes composites dans des 
dialogues finalis&#233;s. L&#8217;int&#233;r&#234;t principal de ce travail est de montrer comment une prise en 
compte fine des actes de dialogue permet de concevoir un gestionnaire de dialogue capable de 
mettre en rapport les intentions de l&#8217;utilisateur, les buts du dialogue et ses propres contraintes 
de fonctionnement. Il montre &#224; quel point l&#8217;identification des actes de dialogue et le 
raisonnement sont des processus tr&#232;s li&#233;s. Il montre &#233;galement que les aspects coop&#233;ratifs, y 
compris peut-&#234;tre les fameuses maximes de Grice, rel&#232;vent pour une grande part de ces 
processus. Pour le moment, la principale perspective &#224; ce travail est l&#8217;&#233;laboration d&#8217;un mod&#232;le 
formel en exploitant un cadre existant tel que la SDRT. Une autre perspective est </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>exp&#233;rimentale et consiste &#224; faire &#233;valuer par des sujets les r&#233;actions et r&#233;ponses d&#8217;un syst&#232;me 
(ou d&#8217;un syst&#232;me simul&#233;) face &#224; des &#233;nonc&#233;s comportant des actes composites. 
</p>
<p>R&#233;f&#233;rences 
ASHER N., LASCARIDES A. (2003). Logics of Conversation. Cambridge : Cambridge 
University Press. 
</p>
<p>BUNT H. (2000). Non-Problems and Social Obligations in Human-Computer Conversation. 
Actes de Third International Workshop on Human-Computer Conversation, Bellagio, Italy. 
</p>
<p>BUNT H., SCHIFFRIN A. (2007). Defining Interoperable Concepts for Dialogue Act Annotation. 
Actes de Seventh International Workshop on Computational Semantics, Tilburg, The 
Netherlands, 16-27. 
</p>
<p>CAELEN J., XUEREB A. (2007). Interaction et pragmatique. Paris : Herm&#232;s-Lavoisier. 
</p>
<p>COHEN P.R., LEVESQUE H.J. (1995). Communicative Actions for Artificial Agents. Actes de 
First International Conference on Multi-Agent Systems, Cambridge : MIT Press, 65-72. 
KERBRAT-ORECCHIONI C. (2001). Les actes de langage dans le discours, Nathan Universit&#233;. 
</p>
<p>MERIN A. (1994). Algebra of Elementary Social Acts. Dans : TSOHATZIDIS S.L. (Ed.) 
Foundations of Speech Act Theory. London : Routledge, 234-263. 
MULLER P., MAUDET N., PREVOT L. (2006). Social Constraints on Rhetorical Relations in 
Dialogue. Actes de Workshop on Constraints in Discourse, Maynooth, Ireland, 2006. 
</p>
<p>POPESCU-BELIS A. (2005). Dialogue Acts: One or More Dimensions? ISSCO Working Paper 
n&#176; 62, University of Geneva. 
</p>
<p>PORTNER P. (2004). The Semantics of Imperatives within a Theory of Clause Types. Dans : 
WATANABE K., YOUNG R.B. (Eds.) Proceedings of Semantics and Linguistic Theory 14. CLC. 
POTTS C. (2003). The Logic of Conventional Implicatures. PhD, University of California. 
</p>
<p>ROULET E., AUCHLIN A., MOESCHLER J., RUBATTEL C., SCHELLING M. (1985). L&#8217;articulation 
du discours en fran&#231;ais contemporain. Berne : Peter Lang. 
SEARLE J. (1969). Speech Acts. Cambridge : Cambridge University Press. 
</p>
<p>SEARLE J. (1975). Indirect Speech Acts. Dans COLE P., MORGAN J. (Eds.) Syntax and 
Semantics, Vol. 3: Speech Acts. Academic Press. 
</p>
<p>STEEDMAN M., PETRICK R. (2007). Planning Dialogue Actions. Proceedings of the 8th SIGdial 
Workshop on Discourse and Dialogue. Antwerp, Belgium, 265-272. 
</p>
<p>TRAUM D. (2000). 20 Questions on Dialog Act Taxonomies. Journal of Semantics 17 (1), 7-
30. 
</p>
<p>TROGNON A., BRASSAC C. (1988). Actes de langage et conversation. Intellectica 2 (6), 211-
232. </p>

</div></div>
</body></html>