<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un mod&#232;le multi-sources pour la segmentation en sujets de journaux radiophoniques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Un mod&#232;le multi-sources pour la segmentation en sujets de
journaux radiophoniques
</p>
<p>St&#233;phane Huet1, Guillaume Gravier2, Pascale S&#233;billot3
</p>
<p>Institut de Recherche en Informatique et Syst&#232;mes Al&#233;atoires, Rennes
(1) Universit&#233; de Rennes 1, (2) CNRS, (3) INSA de Rennes
{stephane.huet,guillaume.gravier,pascale.sebillot}@irisa.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons une m&#233;thode de segmentation de journaux radiophoniques en
sujets, bas&#233;e sur la prise en compte d&#8217;indices lexicaux, syntaxiques et acoustiques. Partant d&#8217;un
mod&#232;le statistique existant de segmentation th&#233;matique, exploitant la notion de coh&#233;sion lexi-
cale, nous &#233;tendons le formalisme pour y inclure des informations d&#8217;ordre syntaxique et acous-
tique. Les r&#233;sultats exp&#233;rimentaux montrent que le seul mod&#232;le de coh&#233;sion lexicale ne suffit
pas pour le type de documents &#233;tudi&#233; en raison de la taille variable des segments et de l&#8217;absence
d&#8217;un lien direct entre segment et th&#232;me. L&#8217;utilisation d&#8217;informations syntaxiques et acoustiques
permet une am&#233;lioration substantielle de la segmentation obtenue.
</p>
<p>Abstract. We present a method for story segmentation of radio broadcast news, based on
lexical, syntactic and audio cues. Starting from an existing statistical topic segmentation model
which exploits the notion of lexical cohesion, we extend the formalism to include syntactic and
acoustic knwoledge sources. Experimental results show that the sole use of lexical cohesion is
not efficient for the type of documents under study because of the variable size of the segments
and the lack of direct relation between topics and stories. The use of syntactics and acoustics
enables a consequent improvement of the quality of the segmentation.
</p>
<p>Mots-cl&#233;s : segmentation en sujets, corpus oraux, coh&#233;sion lexicale, indices acoustiques,
indices syntaxiques.
</p>
<p>Keywords: story segmentation, spoken documents, lexical cohesion, acoustic cues, syn-
tactic cues.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phane Huet, Guillaume Gravier, Pascale S&#233;billot
</p>
<p>1 Introduction
</p>
<p>Le traitement de flux de donn&#233;es sonores ou encore multim&#233;dias &#224; des fins d&#8217;indexation n&#233;ces-
site une &#233;tape pr&#233;alable de structuration de ce flux, bas&#233;e sur une segmentation en composantes
&#233;l&#233;mentaires puis en sujets sp&#233;cifiques au sein des composantes. Typiquement, analyser un flux
sonore diffus&#233; &#224; la radio ou &#224; la t&#233;l&#233;vision requiert la d&#233;tection des diff&#233;rentes &#233;missions puis,
lorsque cela a un sens, une segmentation de chaque &#233;mission selon les sujets abord&#233;s. Cette der-
ni&#232;re &#233;tape est particuli&#232;rement importante pour les informations (journaux t&#233;l&#233;vis&#233;s ou flash
d&#8217;informations) qui abordent diff&#233;rents sujets li&#233;s &#224; l&#8217;actualit&#233; du moment (Allan et al., 1998) :
leur indexation ou leur structuration n&#233;cessite leur d&#233;coupage en titres, reportages et transitions.
</p>
<p>Pour mener &#224; bien cette segmentation en sujets, on utilise classiquement des m&#233;thodes d&#233;velop-
p&#233;es en traitement automatique des langues pour la segmentation th&#233;matique de corpus &#233;crits,
que l&#8217;on applique sur la transcription automatique de la parole des &#233;missions, consid&#233;r&#233;e comme
un texte &#224; part enti&#232;re. La majorit&#233; de ces m&#233;thodes se base sur la notion de coh&#233;sion lexicale qui
mesure &#224; quel point l&#8217;usage fait du vocabulaire change entre deux th&#232;mes. L&#8217;application directe
de ces techniques dans le cadre d&#8217;une segmentation en sujets des informations pose toutefois
plusieurs probl&#232;mes. Tout d&#8217;abord, la transcription automatique pr&#233;sente des caract&#233;ristiques
diff&#233;rentes des textes &#233;crits. En plus des erreurs de transcription &#8212; entre 10 % et 20 % des mots
des &#233;missions d&#8217;information sont g&#233;n&#233;ralement mal reconnus avec les syst&#232;mes de transcription
actuels &#8212;, le texte produit automatiquement ne poss&#232;de pas de marques de structure syntaxique
fortes : notions de phrase et paragraphe non d&#233;finies, pas de ponctuation... En revanche, on peut
associer &#224; la transcription des informations d&#8217;ordre acoustique comme la dur&#233;e des pauses ou
les changements de locuteurs. Par ailleurs, la nature m&#234;me des documents implique certaines
difficult&#233;s. Le temps allou&#233; &#224; chaque sujet varie fortement et peut &#234;tre extr&#234;mement court, ce qui
rend les mesures de coh&#233;sion lexicale peu efficaces. Si les reportages y ont en g&#233;n&#233;ral une dur&#233;e
cons&#233;quente, des nouvelles br&#232;ves &#233;maillent aussi leur contenu. Les titres du journal constituent
un cas typique o&#249; un sujet est abord&#233; en quelques mots.
</p>
<p>Ce dernier exemple soul&#232;ve d&#8217;ailleurs deux questions fondamentales, fortement li&#233;es, &#224; savoir
d&#8217;une part la relation entre th&#232;me et sujet d&#8217;actualit&#233; et, d&#8217;autre part, la granularit&#233; vis&#233;e de la
segmentation. L&#8217;utilisation de techniques de segmentation th&#233;matique pour d&#233;tecter les chan-
gements de sujets se justifie par le fait que, dans la plupart des cas, deux sujets cons&#233;cutifs ne
traitent pas du m&#234;me th&#232;me. Cependant, les notions de sujet et de th&#232;me, bien que proches, ne
sont pas strictement &#233;quivalentes. Le cas des titres est embl&#233;matique : faut-il consid&#233;rer les titres
dans leur ensemble ou bien chaque titre comme un sujet ? Du point de vue de la structure de
l&#8217;&#233;mission, le premier choix peut para&#238;tre plus pertinent, alors que c&#8217;est l&#8217;inverse si l&#8217;on consi-
d&#232;re la question d&#8217;un point de vue du th&#232;me. Par ailleurs, la notion de th&#232;me n&#8217;est elle-m&#234;me
pas clairement d&#233;finie et sujette &#224; interpr&#233;tation quant &#224; la granularit&#233; envisag&#233;e. Un reportage
traitant de deux aspects proches, par exemple le clan Saddam Hussein et le r&#244;le de l&#8217;ONU en
Irak, doit-il &#234;tre consid&#233;r&#233; comme une unique entit&#233; sur la guerre en Irak ou comme deux en-
tit&#233;s ? &#192; d&#233;faut d&#8217;avoir une solution tranch&#233;e pour ces deux questions, nous prenons le parti
ici de nous baser sur une m&#233;thode de type segmentation th&#233;matique pour notre probl&#232;me de
d&#233;coupage en sujets journalistiques et nous laissons, &#224; l&#8217;instar de (Rossignol &amp; S&#233;billot, 2005),
la granularit&#233; des th&#232;mes &#233;merger des donn&#233;es.
</p>
<p>Pour r&#233;pondre &#224; notre t&#226;che de segmentation de transcriptions automatiques d&#8217;&#233;missions d&#8217;ac-
tualit&#233;s, nous d&#233;crivons, dans cet article, une extension du mod&#232;le de coh&#233;sion lexicale de
Utiyama et Isahara (Utiyama &amp; Isahara, 2001), mod&#232;le qui a fait ses preuves pour la segmenta-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation en sujets de corpus oraux d&#8217;informations
</p>
<p>tion th&#233;matique de l&#8217;&#233;crit. Nous tirons profit du cadre probabiliste de ce mod&#232;le pour proposer
une technique permettant d&#8217;y combiner diff&#233;rents types d&#8217;information, &#224; savoir lexicale, syn-
taxique et acoustique. Cette combinaison in&#233;dite d&#8217;indices nous permet d&#8217;obtenir un d&#233;coupage
en sujets performant, sans faire d&#8217;hypoth&#232;ses a priori sur les sujets pr&#233;sents, tout en &#233;tant ro-
buste aux erreurs de transcription et &#224; la dur&#233;e potentiellement courte des segments.
</p>
<p>Dans la suite, nous passons tout d&#8217;abord en revue les techniques classiquement utilis&#233;es pour
d&#233;tecter des changements de th&#232;mes, avant de pr&#233;senter en d&#233;tail le mod&#232;le de coh&#233;sion lexicale
utilis&#233; et l&#8217;extension propos&#233;e aux autres sources d&#8217;information. Nous d&#233;crivons ensuite notre
cadre exp&#233;rimental et notre m&#233;thodologie de mesure des performances avant de pr&#233;senter des
r&#233;sultats exp&#233;rimentaux sur le corpus ESTER (Galliano et al., 2006).
</p>
<p>2 Techniques de segmentation th&#233;matique
</p>
<p>La segmentation th&#233;matique consiste &#224; localiser dans un document les points de changement
de th&#232;mes, de mani&#232;re &#224; obtenir des entit&#233;s homog&#232;nes du point de vue du th&#232;me. Cette pro-
bl&#233;matique a principalement &#233;t&#233; &#233;tudi&#233;e sur des donn&#233;es textuelles dans diff&#233;rents contextes
applicatifs comme la recherche d&#8217;information ou le r&#233;sum&#233; automatique. Dans le cadre des do-
cuments &#233;crits, les indices permettant de d&#233;tecter ces points de changement th&#233;matique sont de
plusieurs natures. Tout d&#8217;abord, au niveau lexical, un changement de th&#232;me s&#8217;accompagne en
g&#233;n&#233;ral d&#8217;une modification du vocabulaire utilis&#233;. D&#232;s lors, la notion de coh&#233;sion lexicale d&#8217;un
segment, qui refl&#232;te l&#8217;homog&#233;n&#233;it&#233; du vocabulaire &#8212; homog&#233;n&#233;it&#233; &#171; graphique &#187; (r&#233;p&#233;titions)
mais &#233;galement s&#233;mantique, les m&#234;mes lexies ou des lexies d&#8217;un m&#234;me paradigme &#233;tant em-
ploy&#233;es conjointement et diff&#233;remment de leur distribution dans les segments adjacents &#8212;, est
&#224; la base de nombreuses m&#233;thodes que nous discutons par la suite. Au-del&#224; de la mise au jour de
ruptures de similarit&#233; lexicale entre portions cons&#233;cutives, la segmentation th&#233;matique peut &#233;ga-
lement s&#8217;appuyer sur le rep&#233;rage de marqueurs discursifs, tant de continuit&#233; (&#171; de plus &#187;) que de
changement (&#171; et maintenant &#187;), mais &#233;galement sur des informations de type syntaxique telles
la pr&#233;sence de pronoms r&#233;f&#233;rant des &#233;l&#233;ments ant&#233;rieurs et sugg&#233;rant la continuit&#233; d&#8217;un th&#232;me.
</p>
<p>Dans le cas de documents sonores ou multim&#233;dias contenant de la parole, d&#8217;autres indices que
ceux li&#233;s au langage naturel peuvent apporter une information sur les fronti&#232;res de segments.
Par exemple, lors des informations, les changements de locuteurs, la pr&#233;sence de musique et,
dans le cas de la t&#233;l&#233;vision, les changements de plans ou l&#8217;apparition du plateau sont des indices
forts marquant un changement de sujet (T&#252;r et al., 2001; Galley et al., 2003). De mani&#232;re moins
sp&#233;cifique au type de documents &#233;tudi&#233;s, la prosodie fournit de pr&#233;cieux indices qui, en dehors
de la dur&#233;e des pauses silencieuses, restent peu utilis&#233;s du fait de la difficult&#233; &#224; les mesurer de
fa&#231;on fiable (Passonneau &amp; Litman, 1997; T&#252;r et al., 2001).
</p>
<p>Concr&#232;tement, un ou plusieurs des indices que nous venons de mentionner sont exploit&#233;s par les
diverses m&#233;thodes de segmentation th&#233;matique de la litt&#233;rature. Lorsque les th&#232;mes susceptibles
d&#8217;&#234;tre abord&#233;s sont connus &#224; l&#8217;avance, il est possible de s&#8217;appuyer sur des mod&#232;les de langue
th&#233;matiques pour la segmentation et la caract&#233;risation des th&#232;mes. Cette n&#233;cessit&#233; de d&#233;finir a
priori les th&#232;mes limite toutefois les applications possibles de ces approches et les rend diffici-
lement exploitables dans le cadre de la segmentation en sujets des informations. En l&#8217;absence de
ces connaissances a priori, de nombreux travaux fondent leur rep&#233;rage de ruptures th&#233;matiques
sur la coh&#233;sion lexicale, et plus particuli&#232;rement sur la d&#233;tection de minima locaux de simila-
rit&#233; lexicale entre parties de textes cons&#233;cutives. Outre le choix de la repr&#233;sentation des mots</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phane Huet, Guillaume Gravier, Pascale S&#233;billot
</p>
<p>par des lexies, des lemmes ou des racines, un aspect d&#233;licat de ces m&#233;thodes reste la d&#233;finition
des unit&#233;s &#233;l&#233;mentaires pour la comparaison de la distribution lexicale. Dans le cas de textes
structur&#233;s, le paragraphe peut &#234;tre utilis&#233; comme unit&#233; &#233;l&#233;mentaire, une mesure de rupture th&#233;-
matique &#233;tant effectu&#233; entre paragraphes successifs. &#192; l&#8217;oppos&#233;, la technique peut se baser sur
des fen&#234;tres d&#8217;analyse contenant un nombre fixe d&#8217;unit&#233;s (Hearst, 1997), ces derni&#232;res pouvant
&#234;tre des mots, des phrases ou encore des segments d&#233;coup&#233;s lors de l&#8217;&#233;tape de la transcription
automatique dans le cas de documents oraux. Ces m&#233;thodes n&#233;cessitent des fen&#234;tres d&#8217;ana-
lyse suffisamment &#233;tendues ou l&#8217;apport de connaissances ext&#233;rieures pour &#233;valuer correctement
les zones de ruptures de coh&#233;sion. Utiyama et Isahara proposent une approche originale dans
laquelle l&#8217;ensemble des segmentations possibles est consid&#233;r&#233;, le probl&#232;me de segmentation
th&#233;matique consistant &#224; trouver celle conduisant aux segments les plus homog&#232;nes (Utiyama
&amp; Isahara, 2001). &#192; l&#8217;inverse des techniques exploitant une mesure de coh&#233;sion lexicale entre
segments successifs, cette approche ne se base que sur la mesure de la coh&#233;sion au sein d&#8217;un
segment. Lorsque des indices autres que lexicaux sont disponibles, ces diff&#233;rentes m&#233;thodes &#224;
base de coh&#233;sion lexicale peuvent &#234;tre &#233;tendues pour les prendre en compte. Diverses techniques
telles les arbres de d&#233;cision (T&#252;r et al., 2001) ou les mod&#232;les de maximum d&#8217;entropie (Beefer-
man et al., 1999), ont &#233;t&#233; ainsi &#233;tudi&#233;es pour m&#233;langer des informations lexicales et acoustiques.
</p>
<p>Notre cadre applicatif d&#8217;&#233;missions d&#8217;actualit&#233;s implique le rep&#233;rage de segments de longueurs
tr&#232;s variables, possiblement tr&#232;s courts, potentiellement probl&#233;matiques pour la plupart des tech-
niques &#171; standards &#187; de coh&#233;sion lexicale s&#8217;appuyant sur des fen&#234;tres de taille fixe. Nous avons
choisi d&#8217;exploiter pour l&#8217;oral la m&#233;thode de coh&#233;sion lexicale de Utiyama et Isahara, et de
l&#8217;&#233;tendre en tirant profit de sa flexibilit&#233;, de ses bonnes performances et de son potentiel &#8212; non
encore explor&#233; &#8212; pour l&#8217;int&#233;gration d&#8217;informations syntaxiques et acoustiques.
</p>
<p>3 Un mod&#232;le statistique multi-sources
</p>
<p>Nous rappelons tout d&#8217;abord le principe propos&#233; par Utiyama et Isahara avant de d&#233;crire une
extension de ce formalisme.
</p>
<p>3.1 Mod&#232;le statistique bas&#233; sur la coh&#233;sion lexicale
</p>
<p>L&#8217;id&#233;e de la m&#233;thode de Utiyama et Isahara est de rechercher la segmentation qui conduit aux
segments les plus homog&#232;nes sur le plan lexical tout en respectant une distribution a priori de
la longueur des segments. La m&#233;thode se place dans un cadre probabiliste et consiste &#224; trouver
la meilleure segmentation S&#770; d&#8217;une s&#233;quence de l unit&#233;s &#233;l&#233;mentaires (mots, phrases...) W =
W l1, parmi toutes les segmentations possibles. La loi de Laplace est utilis&#233;e pour mod&#233;liser la
coh&#233;sion lexicale des segments, ces derniers &#233;tant vus comme des &#171; sacs de mots &#187;. De mani&#232;re
formelle, la meilleure segmentation est donn&#233;e par le crit&#232;re du maximum a posteriori, soit, par
application de la r&#232;gle de Bayes,
</p>
<p>S&#770; = argmax
S
</p>
<p>P [W |S]P [S] . (1)
</p>
<p>En supposant d&#8217;une part que chaque segment forme une unit&#233; ind&#233;pendante du reste du texte et,
d&#8217;autre part, que les mots au sein d&#8217;un segment sont ind&#233;pendants &#8212; ce qui revient &#224; repr&#233;senter
un segment comme un &#171; sac de mots &#187; &#8212;, la probabilit&#233; d&#8217;un texte W pour une segmentation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation en sujets de corpus oraux d&#8217;informations
</p>
<p>S = Sm1 est alors donn&#233;e par
</p>
<p>P [W |Sm1 ] =
m&#8719;
i=1
</p>
<p>ni&#8719;
j=1
</p>
<p>P [w
(i)
j |Si] , (2)
</p>
<p>o&#249; ni est le nombre de mots dans le segment Si et w
(i)
j le j-&#232;me mot de Si. La probabilit&#233;
</p>
<p>P [w
(i)
j |Si] est fournie par une loi de Laplace dont les param&#232;tres sont estim&#233;s sur Si, soit
</p>
<p>P [w
(i)
j |Si] =
</p>
<p>fi(w
(i)
j ) + 1
</p>
<p>ni + k
(3)
</p>
<p>o&#249; fi(w
(i)
j ) est le nombre d&#8217;occurrences dew
</p>
<p>(i)
j dans Si et k est le nombre total de mots diff&#233;rents
</p>
<p>dans W . En d&#8217;autres termes, on mesure &#224; quel point un mod&#232;le de la distribution des mots appris
sur un segment Si permet de pr&#233;dire les mots de ce dernier. Intuitivement, cette probabilit&#233;
favorise les segments homog&#232;nes du point de vue lexical puisqu&#8217;elle augmente lorsque les mots
apparaissent plusieurs fois et qu&#8217;elle diminue si beaucoup de mots sont diff&#233;rents.
</p>
<p>La mesure de coh&#233;sion lexicale pr&#233;c&#233;dente est compl&#233;t&#233;e par une distribution a priori de la
dur&#233;e des segments, donn&#233;e en l&#8217;absence de connaissances explicites sur les documents &#224; traiter,
par P [Sm1 ] = n
</p>
<p>&#8722;m o&#249; n est le nombre total de mots. Sa valeur est &#233;lev&#233;e lorsque le nombre de
segments est petit, ce qui compense le fait que les valeurs de P [W |S] sont fortes lorsque le
nombre de segments est grand.
</p>
<p>Sur le plan de la mise en &#339;uvre, cette m&#233;thode de segmentation peut &#234;tre vue comme la re-
cherche du meilleur chemin dans un graphe valu&#233; repr&#233;sentant l&#8217;ensemble des segmentations
possibles. Chaque n&#339;ud du graphe mod&#233;lise une fronti&#232;re de segment entre deux unit&#233;s &#233;l&#233;-
mentaires, un arc entre deux n&#339;uds i et j repr&#233;sentant alors un segment regroupant les unit&#233;s
&#233;l&#233;mentaires Wi+1 &#224; Wj . La valeur associ&#233;e &#224; un arc entre deux n&#339;uds i et j est donn&#233;e par
</p>
<p>v(i, j) =
j&#8721;
</p>
<p>k=i+1
</p>
<p>ln(P [Wk|Si&#8594;j])&#8722; &#945; ln(n) (4)
</p>
<p>en notant Si&#8594;j le segment correspondant &#224; l&#8217;arc. Le facteur &#945; est ajout&#233; en pratique pour pond&#233;-
rer la probabilit&#233; a priori et permettre un contr&#244;le de la taille moyenne des segments retourn&#233;s.
</p>
<p>3.2 Introduction d&#8217;informations syntaxiques et acoustiques
</p>
<p>Nous &#233;tendons le mod&#232;le pr&#233;c&#233;dent de mani&#232;re &#224; prendre en compte de nouvelles sources d&#8217;in-
formation. Nous consid&#233;rons ici deux nouvelles sources, &#224; savoir la syntaxe et l&#8217;acoustique,
sans toutefois limiter la g&#233;n&#233;ralisation du formalisme propos&#233;. En notant A l&#8217;ensemble des in-
formations acoustiques disponibles et M les &#233;tiquettes morpho-syntaxiques associ&#233;es aux mots
de W , le crit&#232;re &#224; optimiser pour la segmentation s&#8217;&#233;crit sous la forme
</p>
<p>S&#770; = P [W,A,M |S]P [S] = P [W |S]P [A|S]P [M |S]P [S] , (5)
</p>
<p>en supposant les sources d&#8217;information ind&#233;pendantes.
</p>
<p>Le calcul des probabilit&#233;s P [A|S] et P [M |S] suit le m&#234;me principe que nous illustrons ici pour
A. Dans la mesure o&#249; P [A|S] est proportionnel &#224; P [S|A]/P [S], d&#233;terminer P [A|S] se r&#233;sume
au calcul de P [S|A]. Nous proposons d&#8217;utiliser les informations acoustiques ou syntaxiques</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phane Huet, Guillaume Gravier, Pascale S&#233;billot
</p>
<p>pour pr&#233;dire la probabilit&#233; qu&#8217;une fronti&#232;re de segment se trouve entre chacune des unit&#233;s &#233;l&#233;-
mentaires. En notant Bi la variable al&#233;atoire binaire telle que Bi = 1 s&#8217;il existe une fronti&#232;re
entre Wi et Wi+1 et en supposant les Bi ind&#233;pendants, nous obtenons
</p>
<p>P [S|A] =
l&#8719;
</p>
<p>i=1
</p>
<p>P [Bi|A] . (6)
</p>
<p>Dans les exp&#233;riences pr&#233;sent&#233;es par la suite, nous utilisons un arbre de d&#233;cision pour le cal-
cul des probabilit&#233;s P [Bi|A] &#224; partir des caract&#233;ristiques acoustiques au voisinage de la fron-
ti&#232;re consid&#233;r&#233;e. Pour les informations syntaxiques, un mod&#232;le N-gramme cach&#233; (Stolcke et al.,
1998) est utilis&#233; pour calculer la probabilit&#233; d&#8217;une fronti&#232;re P [Bi|M ] entre chaque unit&#233; &#233;l&#233;-
mentaire.
</p>
<p>Si l&#8217;hypoth&#232;se d&#8217;ind&#233;pendance entre les sources d&#8217;information permet d&#8217;employer ind&#233;pendam-
ment un mod&#232;le pour chacune d&#8217;elles dans l&#8217;&#233;quation (5), elle est quelque peu r&#233;ductrice. En
particulier, les informations morpho-syntaxiques et les mots sont fortement li&#233;s. Cependant, la
repr&#233;sentation de W sous forme de sac de mots est relativement distincte de la notion de s&#233;-
quence d&#8217;&#233;tiquettes morpho-syntaxiques consid&#233;r&#233;e pour M , justifiant ainsi l&#8217;hypoth&#232;se faite.
Dans le cas de deux sources d&#8217;information fortement corr&#233;l&#233;es, par exemple X et Y , il est
toujours possible de les int&#233;grer conjointement en calculant par une m&#233;thode appropri&#233;e les
probabilit&#233;s P [Bi|X,Y ].
En pratique, les informations acoustiques et syntaxiques sont utilis&#233;es pour modifier les valeurs
associ&#233;es aux arcs dans le graphe des segmentations possibles. La valeur de l&#8217;arc i&#8594; j est alors
donn&#233;e par
</p>
<p>v(i, j) =
j&#8721;
</p>
<p>k=i+1
</p>
<p>ln(P [Wk|Sij]) + &#946;A
&#63723;&#63725;ln(P [Bj = 1|A]) + j&#8722;1&#8721;
</p>
<p>k=i+1
</p>
<p>ln(P [Bk = 0|A])
&#63734;&#63736;
</p>
<p>+ &#946;M
</p>
<p>&#63723;&#63725;ln(P [Bj = 1|M ]) + j&#8722;1&#8721;
k=i+1
</p>
<p>ln(P [Bk = 0|M ])
&#63734;&#63736;&#8722; &#945; ln(n) , (7)
</p>
<p>les param&#232;tres &#946;A et &#946;M ayant pour but de pond&#233;rer l&#8217;apport de chacune des sources d&#8217;informa-
tion. Comme pr&#233;c&#233;demment, le param&#232;tre &#945; permet de contr&#244;ler la taille moyenne des segments
retourn&#233;s en donnant plus ou moins d&#8217;importance &#224; la distribution a priori de la segmentation.
</p>
<p>4 Conditions exp&#233;rimentales
</p>
<p>Les exp&#233;riences pr&#233;sent&#233;es dans cet article ont &#233;t&#233; men&#233;es sur les journaux de France Inter et de
France Info du corpus de d&#233;veloppement ESTER (Galliano et al., 2006), soit quatre journaux
d&#8217;une heure chacun enregistr&#233;s le m&#234;me jour. Deux des journaux, un par radio, sont utilis&#233;s
comme donn&#233;es de d&#233;veloppement pour r&#233;gler les param&#232;tres du mod&#232;le tandis que les deux
autres sont utilis&#233;s comme donn&#233;es de test. Nous avons &#233;tabli une segmentation de r&#233;f&#233;rence des
quatre &#233;missions consid&#233;r&#233;es en distinguant cinq types de segments, correspondant &#224; la struc-
ture de montage des &#233;missions : les titres, les reportages, les br&#232;ves, les segments de remplissage
et les publicit&#233;s. Si les titres du journal forment un ensemble sur le plan de la structure, chaque
titre aborde un sujet diff&#233;rent. Nous avons choisi d&#8217;&#233;tiqueter chacun comme un segment, suivant
ainsi un crit&#232;re th&#233;matique, m&#234;me si ces titres sont consid&#233;r&#233;s diff&#233;remment des autres sections
lors de l&#8217;&#233;valuation des performances comme discut&#233; ult&#233;rieurement. Les reportages corres-
pondent au d&#233;veloppement des sujets d&#8217;actualit&#233;s. Ils sont souvent longs, parfois entrecoup&#233;s</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation en sujets de corpus oraux d&#8217;informations
</p>
<p>d&#8217;interviews ou encore d&#8217;interventions de sp&#233;cialistes. Cependant, plusieurs sujets peuvent &#234;tre
abord&#233;s dans un reportage. Par exemple, un reportage sur la guerre en Irak aborde la traque des
proches de Saddam Hussein, le r&#244;le de l&#8217;ONU en Irak et enfin les conditions sanitaires &#224; l&#8217;issue
des combats. Comme pour les titres, nous avons choisi d&#8217;avoir un segment pour chacun des su-
jets abord&#233;s dans un reportage. Les br&#232;ves correspondent &#224; des nouvelles courtes, g&#233;n&#233;ralement
diffus&#233;es entre deux reportages. La difficult&#233; de ce type de segment tient d&#8217;une part &#224; leur dur&#233;e
extr&#234;mement courte, de l&#8217;ordre d&#8217;une phrase ou deux, et, d&#8217;autre part, &#224; l&#8217;agr&#233;gation possible de
plusieurs nouvelles br&#232;ves dans une m&#234;me phrase. Les segments de remplissage correspondent
&#224; des annonces de la radio pour donner l&#8217;heure, rappeler le nom des journalistes ou annoncer
une rubrique (la m&#233;t&#233;o, la bourse...). De par leur nature, ces segments ne sont associ&#233;s &#224; aucun
sujet. En revanche, ils marquent la plupart du temps un changement de segment. Finalement,
chaque publicit&#233; est annot&#233;e comme un segment &#224; part enti&#232;re.
</p>
<p>La transcription automatique requiert une &#233;tape pr&#233;alable de segmentation du flux sonore en
pseudo-phrases, appel&#233;s groupes de souffle, chaque groupe de souffle correspondant &#224; un &#233;nonc&#233;
entre deux respirations. Nous consid&#233;rons dans cet article une segmentation manuelle en groupes
de souffle, telle qu&#8217;&#233;tablie selon les conventions de transcription du corpus ESTER, afin de pou-
voir mesurer la d&#233;gradation de performance due &#224; la transcription automatique. Les diff&#233;rentes
&#233;tapes du processus de transcription automatique des journaux radiophoniques sont d&#233;crites en
d&#233;tail dans (Huet et al., 2007). Pour les quatre journaux consid&#233;r&#233;s, le taux d&#8217;erreur sur les
mots est d&#8217;environ 20 %. Pour le mod&#232;le de coh&#233;sion lexicale employ&#233; dans la segmentation en
sujets, nous ne conservons que les noms communs, les noms propres et les adjectifs apr&#232;s lem-
matisation. Le taux d&#8217;erreur sur les lemmes conserv&#233;s est d&#8217;environ 17 % sur les quatre heures
d&#8217;&#233;missions.
</p>
<p>L&#8217;&#233;valuation des performances se fait sur la base du nombre de fronti&#232;res entre groupes de
souffle d&#233;tect&#233;es correctement, les r&#233;sultats &#233;tant donn&#233;s en termes de rappel et pr&#233;cision ainsi
que selon la m&#233;trique WindowDiff (Pevzner &amp; Hearst, 2002). En raison des difficult&#233;s &#233;voqu&#233;es
pr&#233;c&#233;demment concernant les titres et la granularit&#233; consid&#233;r&#233;e pour la segmentation des re-
portages, la notion de fronti&#232;res correctes n&#8217;est pas imm&#233;diate. Nous distinguons deux types
de fronti&#232;res selon qu&#8217;elles sont consid&#233;r&#233;es comme facultatives ou obligatoires. Les fronti&#232;res
entre titres successifs ainsi qu&#8217;entre sujets proches au sein d&#8217;un m&#234;me reportage sont consi-
d&#233;r&#233;es comme facultatives. Si de telles fronti&#232;res n&#8217;entrent pas dans la comptabilisation des
erreurs, les d&#233;tecter ne constitue pas pour autant une erreur d&#8217;insertion. Enfin, les segment de
remplissage posent un probl&#232;me particulier car ils ne sont pas li&#233;s &#224; un sujet particulier. La
d&#233;tection de tels segments n&#233;cessite des m&#233;thodes ad hoc et peu portables, par exemple bas&#233;es
sur une liste de marqueurs pr&#233;-&#233;tablis, que nous ne souhaitons pas consid&#233;rer dans ce travail
par souci de g&#233;n&#233;ricit&#233;. Nous adoptons plut&#244;t la notion de fronti&#232;re floue en acceptant comme
correcte non seulement la d&#233;tection des deux fronti&#232;res du segment de remplissage mais aussi
l&#8217;agr&#233;gation de ce dernier au segment pr&#233;c&#233;dent ou suivant. La m&#233;trique WindowDiff a &#233;t&#233;
adapt&#233;e pour prendre en compte les consid&#233;rations que nous venons d&#8217;&#233;num&#233;rer.
</p>
<p>5 R&#233;sultats
</p>
<p>Nous pr&#233;sentons tout d&#8217;abord quelques r&#233;sultats bas&#233;s sur le seul mod&#232;le de coh&#233;sion lexi-
cale. Le poids &#945; de la distribution a priori dans l&#8217;&#233;quation (7) permet de faire varier la dur&#233;e
moyenne des segmentations et donc d&#8217;atteindre diff&#233;rents compromis entre rappel et pr&#233;cision.
Nous avons r&#233;gl&#233; ce poids de mani&#232;re &#224; minimiser le crit&#232;re WindowDiff sur le corpus de d&#233;ve-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phane Huet, Guillaume Gravier, Pascale S&#233;billot
</p>
<p>loppement. Sur ce dernier, les valeurs de rappel et de pr&#233;cision sur les fronti&#232;res de segments,
apr&#232;s optimisation de &#945;, sont respectivement de 37,5 % et 54,1 % pour une dur&#233;e moyenne des
segments de 26,5 groupes de souffle (WindowDiff=0,110). Ces r&#233;sultats mettent en &#233;vidence
d&#8217;une part les performances limit&#233;es de la seule coh&#233;sion lexicale pour segmenter des journaux
radiophoniques et, d&#8217;autre part, la d&#233;gradation de performances li&#233;e aux erreurs de transcription.
En effet, en remplacant la transcription automatique par la r&#233;f&#233;rence, nous obtenons un rappel
de 43,8 % pour une pr&#233;cision de 54,5 %, correspondant &#224; un crit&#232;re WindowDiff de 0,105. Les
faibles valeurs de rappel et de pr&#233;cision, par opposition aux relativement bonnes performances
obtenues selon le crit&#232;re WindowDiff , montrent que nombre d&#8217;erreurs sont dues &#224; une l&#233;g&#232;re
impr&#233;cision sur la position des fronti&#232;res. En effet, en acceptant une tol&#233;rance d&#8217;un groupe de
souffle sur la position des fronti&#232;res, on obtient alors un rappel de 58,8 % et une pr&#233;cision de
79,7% pour la transcription automatique, ce qui illustre bien le probl&#232;me de pr&#233;cision sur la
position des fronti&#232;res de segments.
</p>
<p>Pour am&#233;liorer les premiers r&#233;sultats bas&#233;s sur la seule coh&#233;sion lexicale, nous &#233;tudions l&#8217;apport
des informations syntaxiques et acoustiques. Les mod&#232;les utilis&#233;s pour pr&#233;dire la probabilit&#233;
d&#8217;une fronti&#232;re &#224; partir de l&#8217;une ou l&#8217;autre des sources d&#8217;information ont &#233;t&#233; appris sur les an-
notations de r&#233;f&#233;rence des 80 heures du corpus d&#8217;apprentissage ESTER en se basant sur la seg-
mentation en sujets pr&#233;sente dans le corpus. Bien que sujette &#224; caution sur certains points1, cette
derni&#232;re indique clairement les fronti&#232;res de reportages et les alternances reportages, br&#232;ves et
segments de remplissage. Nous utilisons un arbre de d&#233;cision pour calculer la probabilit&#233; d&#8217;une
fronti&#232;re de segment entre groupes de souffle sur la base des informations acoustiques. Les in-
dices acoustiques consid&#233;r&#233;s sont la pr&#233;sence d&#8217;un jingle &#224; la fronti&#232;re, les dur&#233;es du jingle en
cours respectivement avant et apr&#232;s la fin du groupe de souffle, l&#8217;alternance ou pas de locu-
teurs homme/femme2 et la dur&#233;e des pauses en ne consid&#233;rant que les pauses sup&#233;rieures &#224; 1,5
secondes. De mani&#232;re surprenante, la dur&#233;e des pauses silencieuses n&#8217;a pas &#233;t&#233; retenu comme
crit&#232;re dans l&#8217;arbre de d&#233;cision pour pr&#233;dire la pr&#233;sence d&#8217;une fronti&#232;re de segment. En effet,
nous avons constat&#233; que de longues plages de silence intervenaient lors des interviews, expli-
quant ainsi la faible corr&#233;lation entre dur&#233;e des pauses et fronti&#232;re th&#233;matique. L&#8217;alternance de
locuteurs homme/femme a &#233;t&#233; jug&#233;e comme le crit&#232;re le plus pertinent, suivie par la pr&#233;sence de
musique. Les informations syntaxiques sont quant &#224; elles prises en compte par l&#8217;interm&#233;diaire
d&#8217;un mod&#232;le N-gramme cach&#233;, avec N=6, sur les &#233;tiquettes morpho-syntaxiques.
</p>
<p>Les r&#233;sultats obtenus sur le corpus de d&#233;veloppement, en tenant compte des informations lexi-
cales, syntaxiques et acoustiques, sont donn&#233;s dans la figure 1. Pour l&#8217;ensemble des courbes
pr&#233;sent&#233;es, les poids &#946;A et &#946;M ont &#233;t&#233; d&#233;termin&#233;s de mani&#232;re &#224; minimiser le crit&#232;re WindowDiff
sur les donn&#233;es de d&#233;veloppement. Ces r&#233;sultats montrent clairement l&#8217;apport des informations
syntaxiques par rapport au mod&#232;le initial de coh&#233;sion lexicale. Bien que moindre, l&#8217;apport des
informations acoustiques est &#233;galement mis en &#233;vidence. Ce dernier r&#233;sultat s&#8217;explique en par-
tie par le fait que les indices acoustiques permettent surtout d&#8217;&#233;viter les fronti&#232;res consid&#233;r&#233;es
comme optionnelles, notamment entre titres. Cette am&#233;lioration n&#8217;a qu&#8217;un faible impact sur la
mesure du rappel et de la pr&#233;cision en raison de la m&#233;trique utilis&#233;e pour laquelle la d&#233;tection
des fronti&#232;res dites optionnelles n&#8217;est pas consid&#233;r&#233;e comme une erreur. Enfin, la combinai-
son de l&#8217;ensemble des sources d&#8217;information permet d&#8217;obtenir les meilleurs r&#233;sultats, ce qui est
</p>
<p>1&#192; l&#8217;inverse des choix que nous avons effectu&#233;s, les titres sont consid&#233;r&#233;s comme un unique segment. Il en est
de m&#234;me pour les reportages abordant plusieurs sujets.
</p>
<p>2L&#8217;alternance de locuteurs homme/femme a &#233;t&#233; pr&#233;f&#233;r&#233;e aux changements de locuteurs pour deux raisons :
d&#8217;une part, la d&#233;tection automatique des changements de sexe du locuteur est d&#233;j&#224; un indice int&#233;ressant pour le
passage d&#8217;un sujet &#224; un autre. D&#8217;autre part, cette d&#233;tection est plus fiable que celle des locuteurs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Segmentation en sujets de corpus oraux d&#8217;informations
</p>
<p> 10&#13;
</p>
<p> 20&#13;
</p>
<p> 30&#13;
</p>
<p> 40&#13;
</p>
<p> 50&#13;
</p>
<p> 60&#13;
</p>
<p> 70&#13;
</p>
<p> 10&#13;  20&#13;  30&#13;  40&#13;  50&#13;  60&#13;  70&#13;
</p>
<p>pr
&#233;c
</p>
<p>is
io
</p>
<p>n
&#13;
</p>
<p>rappel&#13;
</p>
<p>courbes obtenues sur des transcriptions automatiques&#13;
</p>
<p>LEX&#13;
</p>
<p>LEX+AC&#13;
LEX+SYN&#13;
</p>
<p>LEX+AC+SYN&#13;
</p>
<p>lex&#13;
lex+ac&#13;
</p>
<p>lex+syn&#13;
lex+ac+syn&#13;
</p>
<p>FIG. 1 &#8211; Rappel et pr&#233;cision pour la coh&#233;sion lexicale seule (LEX), avec l&#8217;acoustique
(LEX+AC), la syntaxe (LEX+SYN) ou encore les deux (LEX+AC+SYN). Les courbes sont
obtenues en faisant varier les valeurs des pond&#233;rations sur les deux &#233;missions du corpus de
d&#233;veloppement.
</p>
<p>longueur puret&#233;
moyenne segment rappel pr&#233;cision F wDiff
</p>
<p>lex 23,8 0,76 45,2 51,5 48,1 0,098
lex+ac 38,5 0,69 43,5 70,0 53,7 0,121
lex+syn 29,9 0,73 45,2 61,5 52,1 0,097
lex+ac+syn 20,5 0,81 56,5 62,3 59,3 0,090
</p>
<p>TAB. 1 &#8211; R&#233;sultats sur les deux &#233;missions de test. Le nombre moyen de groupes de souffle par
segment selon la segmentation de r&#233;f&#233;rence est sur ce corpus de 24,7.
</p>
<p>confirm&#233; sur les donn&#233;es de test (cf. tableau 1). L&#8217;utilisation d&#8217;indices acoustiques permet d&#8217;ob-
tenir des segments plus longs, augmentant ainsi grandement la pr&#233;cision pour une faible baisse
du rappel ; ceci se fait au d&#233;triment de la puret&#233; qui mesure la part des segments qui ne traitent
que d&#8217;un seul sujet. Les informations syntaxiques permettent &#233;galement une augmentation de la
pr&#233;cision sans toutefois modifier le rappel ni outre mesure la longueur moyenne des segments.
L&#8217;utilisation conjointe des indices acoustiques et syntaxiques permet une am&#233;lioration &#224; la fois
de la pr&#233;cision et du rappel, ce qui se traduit par une am&#233;lioration sensible du crit&#232;re Window-
Diff par rapport &#224; la seule coh&#233;sion lexicale. La puret&#233; des segments obtenus est &#233;galement
grandement am&#233;lior&#233;e.
</p>
<p>6 Conclusion
</p>
<p>Nous avons propos&#233; dans cet article un mod&#232;le statistique permettant la prise en compte simul-
tan&#233;e d&#8217;indices lexicaux, syntaxiques et acoustiques pour la segmentation en sujets de journaux
radiophoniques. Les r&#233;sultats exp&#233;rimentaux ont permis de mettre en &#233;vidence que les limites
du mod&#232;le de coh&#233;sion lexicale pour le type de documents utilis&#233;s ainsi que sa sensibilit&#233; aux
erreurs de transcription sont compens&#233;es par les informations syntaxiques et acoustiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>St&#233;phane Huet, Guillaume Gravier, Pascale S&#233;billot
</p>
<p>Bien qu&#8217;appliqu&#233; &#224; deux sources de connaissances, notre mod&#232;le offre un cadre g&#233;n&#233;rique per-
mettant d&#8217;accueillir d&#8217;autres indices. Il convient de noter toutefois que subsiste un aspect su-
pervis&#233; qui pourrait limiter la robustesse de la m&#233;thode par rapport &#224; la diversit&#233; des types de
documents : l&#8217;apprentissage des mod&#232;les de pr&#233;diction des fronti&#232;res effectu&#233; sur un corpus
segment&#233; manuellement. Si les indices consid&#233;r&#233;s ici sont suffisamment g&#233;n&#233;raux pour donner
&#224; penser que l&#8217;extension &#224; d&#8217;autres documents est possible, une v&#233;rification est toutefois n&#233;-
cessaire. C&#8217;est d&#8217;ailleurs l&#8217;une des premi&#232;res perspectives du travail pr&#233;sent&#233;. Une autre piste
consiste &#224; &#233;tudier l&#8217;apport de connaissances s&#233;mantiques, syntagmatiques et paradigmatiques, &#224;
la segmentation, connaissances que notre mod&#232;le est &#224; m&#234;me de repr&#233;senter. Ces informations
permettront entre autres de compenser la faible taille de certains segments. Enfin, il s&#8217;av&#232;re
important d&#8217;att&#233;nuer l&#8217;impact des erreurs de transcription, par exemple en ne se limitant pas
&#224; la seule transcription mais en exploitant d&#8217;autres repr&#233;sentations plus riches fournies par le
syst&#232;me de reconnaissance automatique (graphes de mots, indices de confiance...).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALLAN J., CARBONELL J., DODDINGTON G., YAMRON J. &amp; YANG Y. (1998). Topic de-
tection and tracking pilot study final report. In Proc. DARPA Broadcast News Transcription
and Understanding Workshop.
</p>
<p>BEEFERMAN D., BERGER A. &amp; LAFFERTY J. (1999). Statistical models for text segmenta-
tion. Machine Learning, 34(1-3), 177&#8211;210.
GALLEY M., MCKEOWN K., FOSLER-LUSSIER E. &amp; JING H. (2003). Discourse segmenta-
tion of multi-party conversation. In Proc. Association for Computational Linguistics.
</p>
<p>GALLIANO S., GEOFFROIS E., BONASTRE J.-F., GRAVIER G., MOSTEFA D. &amp; CHOUKRI
K. (2006). Corpus description of the ESTER evaluation campaign for the rich transcription of
French broadcast news. In Proc. Language Resources and Evaluation Conference.
</p>
<p>HEARST M. A. (1997). TextTiling : Segmenting text into multi-paragraph subtopic passages.
Computational Linguistics, 23(1), 33&#8211;64.
HUET S., GRAVIER G. &amp; S&#201;BILLOT P. (2007). Morphosyntactic processing of N-best lists
for improved recognition and confidence measure computation. In Proc. European Conf. on
Speech Communication and Technology.
</p>
<p>PASSONNEAU R. J. &amp; LITMAN D. J. (1997). Discourse segmentation by human and automa-
ted means. Computational Linguistics, 23(1), 103&#8211;139.
PEVZNER L. &amp; HEARST M. A. (2002). A critique and improvement of an evaluation metric
for text segmentation. Computational Linguistics, 28(1), 19&#8211;36.
ROSSIGNOL M. &amp; S&#201;BILLOT P. (2005). Combining statistical data analysis techniques to
extract topical keyword classes from corpora. Intelligent Data Analysis, 9(1), 105&#8211;127.
STOLCKE A., SHRIBERG E., BATES R., OSTENDORF M., HAKKANI D., PLAUCHE M.,
T&#220;R G. &amp; LU Y. (1998). Automatic detection of sentence boundaries and disfluencies based
on recognized words. In Proc. Intl. Conf. on Spoken Language Processing.
</p>
<p>T&#220;R G., HAKKANI-T&#220;R D., STOLCKE A. &amp; SHRIBERG E. (2001). Integrating prosodic and
lexical cues for automatic topic segmentation. Computational Linguistics, 21(1), 31&#8211;57.
UTIYAMA M. &amp; ISAHARA H. (2001). A statistical model for domain-independent text seg-
mentation. In Proc. Association for Computational Linguistics.</p>

</div></div>
</body></html>