<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Exploitation de treillis de Galois en d&#233;sambigu&#239;sation non supervis&#233;e d&#8217;entit&#233;s nomm&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Exploitation de treillis de Galois en
d&#233;sambigu&#239;sation non supervis&#233;e d&#8217;entit&#233;s nomm&#233;es
</p>
<p>Thomas Girault
France T&#233;l&#233;com R&amp;D
</p>
<p>2, avenue Pierre Marzin 22307 Lannion Cedex
thomas.girault@orange-ftgroup.com
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons une m&#233;thode non supervis&#233;e de d&#233;sambigu&#239;sation d&#8217;entit&#233;s
nomm&#233;es, bas&#233;e sur l&#8217;exploitation des treillis de Galois. Nous r&#233;alisons une analyse de concepts
formels &#224; partir de relations entre des entit&#233;s nomm&#233;es et leurs contextes syntaxiques extraits
d&#8217;un corpus d&#8217;apprentissage. Le treillis de Galois r&#233;sultant fournit des concepts qui sont utilis&#233;s
comme des &#233;tiquettes pour annoter les entit&#233;s nomm&#233;es et leurs contextes dans un corpus de
test. Une &#233;valuation en cascade montre qu&#8217;un syst&#232;me d&#8217;apprentissage supervis&#233; am&#233;liore la
classification des entit&#233;s nomm&#233;es lorsqu&#8217;il s&#8217;appuie sur l&#8217;annotation r&#233;alis&#233;e par notre syst&#232;me
de d&#233;sambigu&#239;sation non supervis&#233;e.
</p>
<p>Abstract. We present an unsupervised method for named entities disambiguation, based
on concept lattice mining. We perform a formal concept analysis from relations between named
entities and their syntactic contexts observed in a training corpora. The resulting lattice pro-
duces concepts which are considered as labels for named entities and context annotation. Our
approach is validated through a cascade evaluation which shows that supervised named entity
classification is improved by using the annotation produced by our unsupervised disambigua-
tion system.
</p>
<p>Mots-cl&#233;s : D&#233;sambigu&#239;sation non supervis&#233;e, treillis de Galois, entit&#233;s nomm&#233;es.
</p>
<p>Keywords: Unsupervised word sense disambiguation, concept lattice, named entities.
</p>
<p>1 Introduction
</p>
<p>Le traitement de la polys&#233;mie lexicale est un probl&#232;me linguistique g&#233;n&#233;ral qui est central dans
de nombreuses t&#226;ches impliquant la manipulation de donn&#233;es en langue naturelle (e.g. recherche
d&#8217;information, extraction d&#8217;information). Nous nous int&#233;ressons ici &#224; un type d&#8217;unit&#233;s lexicales
(UL) particulier, les entit&#233;s nomm&#233;es (EN), une appellation g&#233;n&#233;rique pour les noms propres
d&#233;signant entre autres des personnes, des lieux ou des organisations. Comme la plupart des UL
consid&#233;r&#233;es en dehors du contexte d&#8217;un &#233;nonc&#233;, les EN sont polys&#233;miques, c&#8217;est-&#224;-dire qu&#8217;elles
peuvent faire r&#233;f&#233;rence &#224; des sens (et des r&#233;f&#233;rents) diff&#233;rents. Notre approche s&#8217;inscrit dans le
cadre d&#8217;un apprentissage non supervis&#233; pour r&#233;soudre en partie un probl&#232;me de d&#233;sambigu&#239;sa-
tion du sens d&#8217;UL en contexte.
</p>
<p>Plusieurs familles d&#8217;approches de d&#233;sambigu&#239;sation s&#233;mantique ont &#233;t&#233; d&#233;velopp&#233;es. Une pre-
mi&#232;re tente de d&#233;terminer le sens de mots en utilisant entre autres la connaissance lexicale r&#233;-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thomas Girault
</p>
<p>pertori&#233;e dans des dictionnaires ou des th&#233;saurus (e.g. WordNet). Les approches qui exploitent
des corpus examinent, elles, les occurrences d&#8217;UL et de leurs contextes en utilisant des outils
d&#8217;apprentissage artificiel. Lorsque les UL &#224; d&#233;sambigu&#239;ser sont &#233;tiquet&#233;es par des sens pr&#233;d&#233;-
finis, les techniques d&#8217;apprentissage utilis&#233;es sont supervis&#233;es. L&#8217;apprentissage non supervis&#233;
intervient lorsque l&#8217;on ne dispose d&#8217;aucune annotation pour d&#233;sambigu&#239;ser les UL du corpus.
</p>
<p>L&#8217;&#233;tiquetage de corpus &#233;tant une t&#226;che fastidieuse et co&#251;teuse, nous nous int&#233;ressons aux ap-
proches non supervis&#233;es. Nous avons choisi d&#8217;utiliser l&#8217;analyse de concepts formels (ACF)
(Ganter &amp; Wille, 1999), une technique de classification non supervis&#233;e symbolique qui permet
d&#8217;inf&#233;rer des concepts formels pour mettre en relation des regroupements d&#8217;EN et des regrou-
pements de contextes syntaxiques. Les concepts formels sont consid&#233;r&#233;es comme des unit&#233;s de
sens qui sont organis&#233;es au sein d&#8217;une structure hi&#233;rarchique de treillis de Galois (ou treillis
de concepts). Elle peut &#234;tre interpr&#233;t&#233;e comme une base de connaissance lexicale mod&#233;lisant le
recouvrement des unit&#233;s de sens sur plusieurs niveaux de granularit&#233;. &#192; notre connaissance, ces
propri&#233;t&#233;s attach&#233;es aux treillis de Galois n&#8217;ont pas encore &#233;t&#233; exploit&#233;es dans une application
de d&#233;sambigu&#239;sation lexicale. Dans cette perspective, nous proposons d&#8217;utiliser les concepts du
treillis comme des &#233;tiquettes pour d&#233;sambigu&#239;ser des UL de mani&#232;re non supervis&#233;e.
</p>
<p>Le plan de cet article est le suivant. Nous partons des approches existantes en d&#233;sambigu&#239;sa-
tion bas&#233;e sur corpus (Section 2) pour introduire notre d&#233;marche. Nous d&#233;crivons ensuite notre
approche bas&#233;e sur l&#8217;analyse de concepts formels (Section 3) nous permettant de construire, &#224;
partir, d&#8217;un corpus la structure de connaissance des treillis de concepts. Nous d&#233;taillons com-
ment exploiter les concepts du treillis pour r&#233;aliser une d&#233;sambigu&#239;sation non supervis&#233;e des
entit&#233;s nomm&#233;es d&#8217;un corpus. Notre approche est valid&#233;e par une &#233;valuation en cascade (Sec-
tion 4) qui consiste &#224; montrer qu&#8217;un syst&#232;me de reconnaissance des entit&#233;s nomm&#233;es supervis&#233;
s&#8217;am&#233;liore lorsqu&#8217;il exploite l&#8217;annotation r&#233;alis&#233;e par notre syst&#232;me.
</p>
<p>2 D&#233;sambigu&#239;sation bas&#233;e sur corpus
</p>
<p>Dans cette section, nous introduisons notre probl&#233;matique de d&#233;sambigu&#239;sation en donnant une
limitation des syst&#232;mes d&#8217;apprentissage supervis&#233; pour s&#8217;adapter &#224; des corpus n&#233;cessitant une
granularit&#233; d&#8217;&#233;tiquetage sp&#233;cifique. Nous exposons les principes de l&#8217;analyse distributionnelle
(Bouaud et al., 1997) dirig&#233;e par l&#8217;&#233;tude de relations syntaxiques entre des UL et qui n&#233;cessite
une extraction des contextes syntaxiques des EN pour notre probl&#232;me. Nous expliquons enfin
comment repr&#233;senter l&#8217;ensemble de ces relations syntaxiques pour envisager une d&#233;sambigu&#239;-
sation des UL selon plusieurs points de vues.
</p>
<p>2.1 Corpus et granularit&#233; d&#8217;&#233;tiquetage
</p>
<p>De nombreux algorithmes d&#8217;apprentissage supervis&#233; sont capables d&#8217;exploiter l&#8217;annotation s&#233;-
mantique de corpus pour d&#233;sambigu&#239;ser des UL. Les syst&#232;mes de reconnaissance des EN les
plus efficaces adoptent cette approche pour apprendre &#224; d&#233;tecter et classer des EN d&#8217;un corpus
selon un inventaire de sens pr&#233;d&#233;fini (e.g. {personne, lieu, organisation, autre}). Il
nous semble d&#233;licat de r&#233;pertorier les EN selon ce type classification : cette granularit&#233; des sens
n&#8217;est pas toujours appropri&#233;e pour d&#233;sambigu&#239;ser les EN de corpus sp&#233;cialis&#233;s.
</p>
<p>&#192; titre d&#8217;exemple, nous avons constitu&#233; un corpus d&#8217;&#233;tude &#224; partir duquel nous avons s&#233;lec-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation de treillis de Galois en d&#233;sambigu&#239;sation non supervis&#233;e d&#8217;entit&#233;s nomm&#233;es
</p>
<p>tionn&#233; quelques &#233;nonc&#233;s pour illustrer notre probl&#232;me. Ce corpus a &#233;t&#233; &#233;labor&#233; en collectant les
r&#233;sultats renvoy&#233;s par un moteur de recherche interrog&#233; avec des noms propres de personnes
comme requ&#234;tes.
</p>
<p>(1) filmographie de l&#8217;acteur Arnold Schwarzenegger, star de Terminator
</p>
<p>(2) victoire d&#8217;Arnold Schwarzenegger en Californie
</p>
<p>(3) &#233;lection d&#8217;Arnold Schwarzenegger au poste de gouverneur de la Californie
</p>
<p>(4) &#233;lection d&#8217;Angela Merkel en Allemagne
</p>
<p>(5) Angela Merkel dirige la politique gouvernementale
</p>
<p>(6) concert de Yannick Noah au Zenith
</p>
<p>(7) victoire de Yannick Noah &#224; Roland Garros
</p>
<p>(8) concert de Michael Jackson avec les Jackson Five
</p>
<p>Dans ce corpus, on peut souhaiter diff&#233;rencier les acteurs, les musiciens, les politiciens et les
sportifs : il s&#8217;agit d&#8217;une d&#233;sambigu&#239;sation fine des fonctions des EN (distinguer entre Schwar-
zenegger gouverneur et Schwarzenegger acteur). Cette t&#226;che s&#8217;apparente au template element
filling des conf&#233;rences MUC (Grishman &amp; Sundheim, 1996) qui visait &#224; remplir une fiche (pr&#233;-
d&#233;finie) pour affiner la description des EN d&#233;j&#224; &#233;tiquet&#233;es dans un document. Notons que nous
ne traitons pas le probl&#232;me de l&#8217;ambigu&#239;t&#233; des r&#233;f&#233;rents d&#8217;une EN (des personnes diff&#233;rentes
peuvent porter le m&#234;me nom).
</p>
<p>Quelle que soit la t&#226;che de d&#233;sambigu&#239;sation, il n&#8217;est pas envisageable d&#8217;annoter manuellement
des nouveaux corpus pour s&#8217;adapter &#224; un nouveau domaine ou un nouveau jeu d&#8217;&#233;tiquetage.
De plus, les EN font r&#233;f&#233;rence &#224; des objets du monde en constante &#233;volution qui semblent
d&#233;licates &#224; r&#233;pertorier selon une jeu d&#8217;&#233;tiquetage stable. La constitution d&#8217;un dictionnaire d&#8217;EN
exhaustif serait co&#251;teuse &#224; mettre en place et &#224; adapter &#224; de nouveaux types de corpus. Comment
d&#233;terminer automatiquement les diff&#233;rentes fonctions d&#8217;une EN dans un corpus sans utilisation
d&#8217;un dictionnaire ou de corpus &#233;tiquet&#233;s ?
</p>
<p>2.2 Contextes distributionnels des entit&#233;s nomm&#233;es
</p>
<p>Plut&#244;t que d&#8217;assigner des &#233;tiquettes connues &#224; des UL, une strat&#233;gie alternative est de discri-
miner leurs sens en analysant leurs interactions avec d&#8217;autres UL pr&#233;sentes dans les &#233;nonc&#233;s
d&#8217;un corpus. Cette approche non supervis&#233;e est d&#233;velopp&#233;e &#224; partir de l&#8217;hypoth&#232;se de Harris
selon laquelle des UL (des EN en l&#8217;occurrence) qui apparaissent dans des contextes similaires
tendent &#224; avoir des sens proches. Les m&#233;thodes bas&#233;es sur l&#8217;analyse distributionnelle (Bouaud
et al., 1997) s&#8217;appuient sur cette hypoth&#232;se et consid&#232;rent que le partage de contextes dispos&#233;s
selon une m&#234;me configuration syntaxique (e.g. sujet-verbe, modifieur-nom) constitue un indice
de proximit&#233; s&#233;mantique.
</p>
<p>Nous adoptons ces derni&#232;res consid&#233;rations pour notre probl&#232;me : nous avons donc besoin
d&#8217;identifier les UL pouvant &#234;tre rattach&#233;es syntaxiquement aux EN des &#233;nonc&#233;s de notre cor-
pus. Pour le moment, nous privil&#233;gions l&#8217;extraction des noms, verbes et pr&#233;positions qui en-
tretiennent des liens syntaxiques avec des EN. Les patrons d&#8217;extraction que nous avons d&#233;-
fini manuellement s&#8217;appuient sur un &#233;tiquetage morpho-syntaxique. Ils se traduisent par des
constructions du type :
&#8211; nom commun + EN dans un chunk nominal (e.g. [acteur, Arnold Schwarzenegger]).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thomas Girault
</p>
<p>&#8211; nom commun + pr&#233;position + EN (e.g. [&#233;lection de, Angela Merkel], [victoire de, Arnold
Schwarzenegger], [victoire de, Yannick Noah]).
</p>
<p>&#8211; EN + chunk verbal (e.g. [Angela Merkel, dirige] )
Ce travail d&#8217;extraction fournit un ensemble de couples (entit&#233; nomm&#233;e, contexte syntaxique)
dans lesquels chaque &#233;l&#233;ment est potentiellement polys&#233;mique : l&#8217;entit&#233; nomm&#233;e &quot;Yannick
Noah&quot; peut se r&#233;f&#233;rer &#224; la fois &#224; un musicien et un sportif et le contexte syntaxique &quot;victoire de&quot;
peut d&#233;signer une victoire politique ou sportive. Quelles repr&#233;sentations et quelles m&#233;thodes
sont appropri&#233;es pour prendre en compte deux unit&#233;s polys&#233;miques en interaction ?
</p>
<p>2.3 Bipartition des unit&#233;s lexicales
</p>
<p>Les approches distributionnelles classiques sont bien entendu applicables pour traiter la poly-
s&#233;mie de toutes les UL. Cependant, elles les consid&#232;rent d&#8217;un seul point de vue alors que pour
notre probl&#232;me les donn&#233;es semblent plus naturellement repr&#233;sent&#233;es par deux vues intercon-
nect&#233;es comme le montre la figure (1) :
&#8211; une vue sur les entit&#233;s nomm&#233;es qui est associ&#233;e &#224; un ensemble d&#8217;objetsO = {o1, o2, &#183; &#183; &#183; , om}.
&#8211; une vue sur leurs contextes syntaxiques repr&#233;sent&#233;e par un ensemble d&#8217;attributsA = {a1, a2, &#183; &#183; &#183; , an}
Ces deux vues sont connect&#233;es par une relation R &#8838; O &#215; A, o&#249; R(o, a) signifie que l&#8217;objet o
poss&#232;de l&#8217;attribut a (i.e. l&#8217;EN o poss&#232;de le contexte syntaxique a).
</p>
<p>concert de
</p>
<p>victoire de
</p>
<p>politique de
</p>
<p>&#233;lection de
</p>
<p>acteur
</p>
<p>filmographie de
</p>
<p>Michael Jackson
</p>
<p>Yannick Noah
</p>
<p>Arnold Schwarzenegger
</p>
<p>Angella Merkel
</p>
<p>Bruce Willis
</p>
<p>FIG. 1 &#8211; Relations entre les EN et leur contexte syntaxique local
</p>
<p>Cette structure est un graphe biparti et ce mode de repr&#233;sentation est utilis&#233; en co-training (Blum
&amp; Mitchell, 1998), une famille d&#8217;algorithmes d&#8217;apprentissage supervis&#233; qui exploite plusieurs
vues ind&#233;pendantes et redondantes sur les donn&#233;es. Selon cette approche, il serait avantageux
de combiner les pr&#233;dictions r&#233;alis&#233;es par des apprentissages ind&#233;pendants sur chaque vue. Dans
le cadre de la classification supervis&#233;e d&#8217;EN, on cherche &#224; d&#233;terminer l&#8217;&#233;tiquette tag(x) &#8712;
Tagset d&#8217;un &#233;chantillon x repr&#233;sent&#233; par deux vues : l&#8217;EN o et son contexte syntaxique a. Pour
(Blum &amp; Mitchell, 1998), la combinaison des pr&#233;dictions peut &#234;tre formul&#233;e par un produit de
probabilit&#233;s estim&#233;es avec des classifieurs bayesiens na&#239;fs entra&#238;n&#233;s sur chaque vue :
</p>
<p>tag(x) = argmax
c&#8712;Tagset
</p>
<p>P (c|o)P (c|a) (1)
</p>
<p>Le co-training et ses versions d&#233;riv&#233;es ont &#233;t&#233; appliqu&#233;es avec succ&#232;s en d&#233;sambigu&#239;sation
lexicale semi-supervis&#233;e (Yarowsky, 1995) et en extraction d&#8217;information (Jones, 2005). Ces
travaux m&#233;riteraient d&#8217;&#234;tre &#233;tendus au cadre de l&#8217;apprentissage non supervis&#233; et c&#8217;est dans cette
optique que nous avons emprunt&#233; une m&#233;thode appel&#233;e analyse de concepts formels (AFC)
pour notre probl&#232;me. Elle nous permet de r&#233;aliser en parall&#232;le des regroupements d&#8217;EN et des
regroupements de contextes syntaxiques. Ces deux types de regroupements sont attach&#233;s &#224; des
vues qui sont combin&#233;es pour d&#233;sambigu&#239;ser &#224; la fois les EN et leurs contextes syntaxiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation de treillis de Galois en d&#233;sambigu&#239;sation non supervis&#233;e d&#8217;entit&#233;s nomm&#233;es
</p>
<p>3 Utilisation des treillis en d&#233;sambigu&#239;sation lexicale
</p>
<p>Dans cette section, nous d&#233;crivons les principes de notre m&#233;thodologie bas&#233;e sur l&#8217;ACF pour
d&#233;sambigu&#239;ser des EN selon une approche non supervis&#233;e. Nous donnons d&#8217;abord plusieurs
d&#233;finitions formelles que nous illustrons par un exemple d&#8217;application de l&#8217;ACF sur un petit
corpus avant de d&#233;tailler les principes de notre m&#233;thode de d&#233;sambigu&#239;sation.
</p>
<p>3.1 Analyse de concepts formels
</p>
<p>En analyse de concepts formels, le triplet (O,A,R) est appel&#233; contexte formel. (O,A,R) cor-
respond au graphe biparti (figure (1)) des objets (entit&#233;s nomm&#233;es) en relation avec des attributs
(contextes lexico-syntaxique).
</p>
<p>Pour E &#8838; O et I &#8838; A, nous d&#233;finissons deux ensembles E &#8242; &#8838; A et I &#8242; &#8838; O les &#233;tendant :
E &#8242; = {a &#8712; A|&#8704;o &#8712; E : (o, a) &#8712; R} comme l&#8217;ensemble maximal des attributs communs aux
objets de E et I &#8242; = {o &#8712; O|&#8704;a &#8712; C : (o, a) &#8712; R}, l&#8217;ensemble maximal des objets partageant
les attributs de I . Par exemple, si I = {politique de, &#233;lection de} alors I &#8242; = {Angela Merkel,
Arnold Schwarzenegger}. Pour E = {Michael Jackson}, on a, E &#8242; = {album de, concert de,
interview de, fan de}.
Un concept formel d&#8217;un contexte formel (O,A,R) est une paire (E, I) telle queE &#8838; O, I &#8838; A,
E &#8242; = I et I &#8242; = E. On appelleE, l&#8217;extension du concept et I l&#8217;intention du concept. Par exemple
la paire ({Angela Merkel, Arnold Schwarzenegger},{politique de, victoire de, &#233;lection de}) est
un concept formel. Pour o &#8712; O et a &#8712; A, {o}&#8242; est d&#233;not&#233; par o&#8242; et appel&#233; l&#8217;intention d&#8217;un objet,
et {a}&#8242; est d&#233;not&#233; par a&#8242; et est appel&#233; l&#8217;extension d&#8217;un attribut.
Les concepts formels sont partiellement ordonn&#233;s les uns par rapport aux autres selon une rela-
tion d&#8217;inclusion entre les extensions des concepts. Un concept C1 = (E1, I1) est plus sp&#233;cifique
ou &#233;gal qu&#8217;un concept C2 = (E2, I2) (ou C1 &#8804; C2) si E1 &#8838; E2 ou de mani&#232;re &#233;quivalente
I2 &#8838; I1. Par exemple, on a C1 &#8804; C2 pour les concepts C1 = ({Michael Jackson, Yannick
Noah}, {album de, concert de, interview de, fan de}) et C2 = ({Michael Jackson, Yannick
Noah, Arnold Schwarzenegger}, {interview de, fan de}).
Soit deux concepts X et Y : si X &#8804; Y et qu&#8217;il n&#8217;y a pas de concept Z tels que Z 6= X,Z 6=
Y,X &#8804; Z &#8804; Y ,X est un enfant de Y et Y est un parent deX . Cette relation de parent&#233; entre les
concepts formels permet d&#8217;&#233;tablir un graphe orient&#233; des concepts formels qui est appel&#233; treillis
de Galois (ou treillis de concepts).
</p>
<p>&#192; quoi ressemble un treillis de concept construit &#224; partir de relations entre des unit&#233;s lexicale ?
Cette structure est elle appropri&#233;e pour traiter une partie du probl&#232;me de la polys&#233;mie lexicale ?
</p>
<p>3.2 Constitution du treillis : structure de connaissance discriminante
</p>
<p>Pour illustrer les d&#233;finitions formelles &#233;nonc&#233;es dans la partie pr&#233;c&#233;dente, nous avons repris
le contexte formel de la figure (1) pour constituer le treillis repr&#233;sent&#233; graphiquement par le
diagramme de Hasse de la figure (2).
</p>
<p>La m&#233;thodologie employ&#233;e pour b&#226;tir le treillis de concepts &#224; partir de notre corpus peut s&#8217;ap-
parenter aux travaux de (Bendaoud et al., 2007; Cimiano et al., 2005). Nous avons utilis&#233; l&#8217;al-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thomas Girault
</p>
<p>&gt;
Arnold,Angela,Yannick,Michael
</p>
<p>&#8709;
</p>
<p>c0
</p>
<p>Arnold,Michael,Yannick
</p>
<p>interview de,fan de
</p>
<p>c1
</p>
<p>Arnold,Angela,Yannick
</p>
<p>victoire de
</p>
<p>c2
</p>
<p>Michael,Yannick
</p>
<p>fan de,interview de,
concert de,album de
</p>
<p>c3
</p>
<p>Arnold,Yannick
</p>
<p>victoire de,interview de,fan de
</p>
<p>c4
</p>
<p>Arnold,Angela
</p>
<p>victoire de,&#233;lection de,
discours de,politique de
</p>
<p>c5
</p>
<p>Yannick
victoire de, interview de,
</p>
<p>fan de, concert de,
album de
</p>
<p>c6
</p>
<p>Arnold
acteur, filmographie de,
victoire de, &#233;lection de,
discours de, politique de
</p>
<p>&#8869;
&#8709;
</p>
<p>victoire de, &#233;lection de, discours de,politique de, interview de, fan de, concert de, album de, acteur, filmographie de
</p>
<p>FIG. 2 &#8211; Treillis de Galois associ&#233; au contexte formel de la figure (1)
</p>
<p>gorithme AddIntent (van der Merwe et al., 2004) qui adopte une proc&#233;dure de construction
incr&#233;mentale : le treillis est construit dynamiquement avec les nouveaux objets et attributs d&#233;-
couverts lors de l&#8217;extraction des UL du corpus. Cette construction permet d&#8217;utiliser un treillis
comme une base de connaissances d&#233;j&#224; structur&#233;e que l&#8217;on souhaiterait adapter &#224; un nouveau
corpus, propri&#233;t&#233; tr&#232;s int&#233;ressante au regard de la faible &#233;volutivit&#233; de nombreuses ressources
lexicales structur&#233;es. C&#8217;est dans cette perspective que (Priss &amp; Old, 2004) &#224; &#233;labor&#233; le mod&#232;le
d&#8217;analyse de concepts relationnels pour une repr&#233;sentation FrameNet. Ces derniers travaux r&#233;-
v&#232;lent d&#8217;excellentes propri&#233;t&#233;s associ&#233;es aux treillis pour traiter l&#8217;ambigu&#239;t&#233; lexicale.
</p>
<p>Comme nous pouvons l&#8217;observer en figure (2), diff&#233;rents niveaux de granularit&#233; apparaissent
au sein de la structure hi&#233;rarchique d&#8217;un treillis. La partie sup&#233;rieure du treillis englobe des
concepts g&#233;n&#233;raux qui regroupent plusieurs objets partageant des attributs ambigus. &#192; l&#8217;oppos&#233;,
la partie inf&#233;rieure pr&#233;sente des concepts tr&#232;s sp&#233;cifiques qui contiennent des objets ambigus.
Les concepts de la zone sup&#233;rieure se diff&#233;rencient dans une zone interm&#233;diaire qui nous semble
la plus informative. Les regroupements d&#8217;objets et d&#8217;attributs correspondent &#224; des unit&#233;s de sens
qui semblent plus coh&#233;rentes pour d&#233;sambigu&#239;ser &#224; la fois les objets et les attributs. De mani&#232;re
g&#233;n&#233;rale, on observe une tendance au recouvrement des concepts qui traduit une certaine conti-
nuit&#233; entre les unit&#233;s de sens alors que le mod&#232;le des treillis est normalement consid&#233;r&#233; comme
symbolique et discret. &#192; notre connaissance, ces propri&#233;t&#233;s attach&#233;es aux treillis n&#8217;ont pas en-
core &#233;t&#233; exploit&#233;es pour r&#233;soudre le probl&#232;me de la d&#233;sambigu&#239;sation non supervis&#233;e et c&#8217;est
dans cette perspective que nous cherchons &#224; les exploiter.
</p>
<p>3.3 Annotation conceptuelle pour d&#233;sambigu&#239;ser les UL en interaction
</p>
<p>Nous pr&#233;sentons ici notre mod&#232;le d&#8217;exploitation des treillis de Galois en d&#233;sambigu&#239;sation lexi-
cale. Nous consid&#233;rons d&#233;sormais chaque concept structur&#233; dans un treillis comme une &#233;tiquette
s&#233;mantique potentiellement utile pour d&#233;sambigu&#239;ser une UL en contexte.
</p>
<p>Dans un &#233;nonc&#233;, on suppose qu&#8217;une EN o &#8712; O et son contexte lexico-syntaxique a &#8712; A ont</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation de treillis de Galois en d&#233;sambigu&#239;sation non supervis&#233;e d&#8217;entit&#233;s nomm&#233;es
</p>
<p>&#233;t&#233; d&#233;tect&#233;s avec les patrons d&#8217;extraction que nous avons &#233;labor&#233;s. Le couple (o, a) est ajout&#233;
au treillis &#224; l&#8217;aide de l&#8217;algorithme AddIntent. Nous cherchons &#224; &#233;tiqueter le couple (o, a) par
un couple de concepts (X, Y ) du treillis. Notre proposition est la suivante. L&#8217;extension Ex =
Ext(X) du concept X qui annote o poss&#232;de des objets similaires aux objets de l&#8217;extension de
a (i.e. Ex doit &#234;tre proche de Ea = {a}&#8242;). L&#8217;intention Iy = Int(Y ) du concept Y qui annote
a poss&#232;de des attributs similaires aux attributs de l&#8217;intention de o (i.e. Iy doit &#234;tre proche de
Io = {o}&#8242;). Les deux concepts (X, Y ) &#224; d&#233;terminer se situent sur des chemins entre le concept
Co = ({o}, {o}&#8242;) associ&#233; &#224; o et le concept Ca = ({a}&#8242;, {a}) associ&#233; &#224; a. Plus formellement, on
a Ca &#8804; X &#8804; Co et Ca &#8804; Y &#8804; Co : l&#8217;ensemble des concepts associ&#233;s &#224; cet intervalle se substitue
au jeu d&#8217;&#233;tiquettes pr&#233;d&#233;finies Tagset dans la formule (1).
</p>
<p>X = argmax
Ca&#8804;X&#8804;Co
</p>
<p>P (Ex|Eo)P (Ex|Ea) (2)
Y = argmax
</p>
<p>Ca&#8804;Y&#8804;Co
P (Iy|Io)P (Iy|Ia) (3)
</p>
<p>L&#8217;inf&#233;rence bayesienne s&#8217;applique sur chaque vue du treillis (Knuth, 2004) et le terme P (c|o)P (c|a)
de la formule (1) est remplac&#233; par P (Ex|Eo)P (Ex|Ea) pour d&#233;terminer l&#8217;extension Ex la plus
probable par rapport &#224; Eo ou Ea pour annoter l&#8217;EN o. De mani&#232;re similaire, l&#8217;estimation de
P (Iy|Io)P (Iy|Ia) permet de choisir l&#8217;intention Iy pour le contexte syntaxique a.
&#192; titre d&#8217;exemple, on peut vouloir d&#233;sambigu&#239;ser l&#8217;expression &quot;la victoire d&#8217;Arnold Schwarze-
negger&quot; dans lequel on extrait le couple (o, a) = (Arnold Schwarzenegger,victoire de). L&#8217;objet
o est repr&#233;sent&#233; dans le treillis par le concept C6 = ({Arnold Schwarzenegger}, {politique
de, discours de, victoire de, &#233;lection de, acteur, filmographie de, film avec, fan de}) qui d&#233;-
crit des r&#244;les d&#8217;homme politique tout autant que d&#8217;acteur de cin&#233;ma. L&#8217;attribut &quot;victoire de&quot;
est aussi polys&#233;mique car une victoire peut &#234;tre politique ou sportive. Cet attribut est repr&#233;-
sent&#233; dans le treillis par le concept C1 = ({Arnold Schwarzenegger, Angela Merkel, Yannick
Noah},{victoire de}). Les chemins possibles entre C1 et C6 sont C1C4C6 et C1C4C6. L&#8217;appli-
cation des formules (2) et (3) permet de selectionner (C4, C4) pour annoter (o, a).
</p>
<p>Notre proposition peut s&#8217;apparenter &#224; plusieurs mod&#232;les qui ont &#233;t&#233; appliqu&#233;s au calcul de si-
milarit&#233; entre des ensembles de mots dans des ressources lexicales structur&#233;es. Les travaux de
(Jacquet et al., 2005) sur les graphes de synonymes ont permis de d&#233;finir des unit&#233;s de sens
comme des cliques du graphes. Les auteurs utilisent des mesures bas&#233;es sur le &#967;2 pour estimer
le degr&#233; d&#8217;affinit&#233; entre deux cliques et choisir le sens d&#8217;une UL. Nous pouvons noter que la
notion de concept formel s&#8217;apparente &#224; celle de clique : un concept formel pouvant &#234;tre d&#233;fini
comme une bi-clique dans un graphe biparti. Dans le cadre de l&#8217;utilisation de WordNet en d&#233;sa-
mbigu&#239;sation lexicale, (Resnik, 1999) propose une mesure de similarit&#233; conceptuelle hybride :
elle combine des contraintes structurelles (plus petit subsumant commun &#224; deux UL) avec des
crit&#232;res probabilistes estim&#233;s sur corpus.
</p>
<p>4 &#201;valuation
</p>
<p>Il serait d&#233;licat de demander &#224; un expert de juger de la qualit&#233; des concepts qui ont &#233;t&#233; pro-
duits par ACF : cette activit&#233; est subjective par nature car diff&#233;rents concepts pourraient &#234;tre
appropri&#233;s pour d&#233;sambigu&#239;ser une EN. Il nous semble pr&#233;f&#233;rable de valider notre approche par
rapport &#224; une t&#226;che existante. Nous proposons d&#8217;&#233;valuer la pertinence de l&#8217;annotation non super-
vis&#233;e en prouvant que celle-ci apporte une connaissance nouvelle et int&#233;ressante pour am&#233;liorer
une t&#226;che de classification des EN supervis&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thomas Girault
</p>
<p>Dans cette section, nous pr&#233;sentons d&#8217;abord le corpus utilis&#233; pour cette t&#226;che. Nous d&#233;crivons
ensuite le protocole d&#8217;&#233;valuation en cascade (Candillier et al., 2006) que nous avons utilis&#233;
pour transf&#233;rer les connaissances apprises avec notre syst&#232;me non supervis&#233; vers le syst&#232;me
supervis&#233;. Cette section s&#8217;ach&#232;ve avec une &#233;tude des r&#233;sultats fournis par notre syst&#232;me.
</p>
<p>4.1 La campagne d&#8217;&#233;valuation CoNLL 2003
</p>
<p>Pour nos exp&#233;rimentations, nous avons utilis&#233; un corpus de la campagne d&#8217;&#233;valuation CoNLL
2003 (Sang &amp; Meulder, 2003) qui a &#233;t&#233; largement repris pour &#233;valuer les technologies de re-
connaissance des EN. Il est constitu&#233; d&#8217;un ensemble d&#8217;articles de presse anglophone (collection
Reuters) d&#233;coup&#233;s en phrases. Celles-ci sont fournies avec un &#233;tiquetage morpho-syntaxique et
une segmentation en chunks qui ont &#233;t&#233; produits automatiquement et sont donc bruit&#233;s. Les EN
des phrases sont d&#233;limit&#233;es et annot&#233;es manuellement selon le jeu d&#8217;&#233;tiquettes {personne, lieu,
organisation, &quot;autre&quot;}. Bien qu&#8217;il puisse para&#238;tre limit&#233;, c&#8217;est par rapport &#224; ce jeu d&#8217;&#233;tiquettes
que nous allons nous &#233;valuer. La figure (3) donne un aper&#231;u des caract&#233;ristiques du corpus.
</p>
<p>Articles Phrases Tokens Lieux Autres Organisations Personnes
Corpus d&#8217;apprentissage (train) 946 14987 203621 7140 3438 6321 6600
Corpus de d&#233;veloppement (testa) 216 3466 51362 1837 922 1341 1842
Corpus de test (testb) 231 3684 46435 1668 702 1661 1617
</p>
<p>FIG. 3 &#8211; Caract&#233;ristiques du corpus CoNLL 2003
</p>
<p>4.2 &#201;valuation en cascade
</p>
<p>En se pla&#231;ant dans le cadre d&#8217;une &#233;valuation en cascade (Candillier et al., 2006), on consid&#232;re
qu&#8217;un apprentissage non supervis&#233; est un pr&#233;traitement d&#8217;une t&#226;che supervis&#233;e que l&#8217;on sait
&#233;valuer. Cet assemblage en cascade permet de v&#233;rifier si notre syst&#232;me de d&#233;sambigu&#239;sation
non supervis&#233;e apporte une connaissance nouvelle et int&#233;ressante pour am&#233;liorer une t&#226;che de
classification supervis&#233;e des EN sur le corpus CoNLL. Il s&#8217;agit de comparer les erreurs pro-
duites par deux classifieurs A et B, lorsqu&#8217;ils sont &#233;valu&#233;s sur le corpus de test (testb), apr&#232;s
entra&#238;nement sur le m&#234;me corpus d&#8217;apprentissage (train + testa).
</p>
<p>Le syst&#232;meA est &#233;labor&#233; &#224; partir d&#8217;un apprentissage supervis&#233; sur le corpus d&#8217;apprentissage &#233;ti-
quet&#233;. &#192; la mani&#232;re de (Ehrmann &amp; Jacquet, 2006), le syst&#232;meB produit une double annotation
des EN. La premi&#232;re couche d&#8217;&#233;tiquetage est appliqu&#233;e avec une annotation conceptuelle suite &#224;
une AFC effectu&#233;e &#224; partir du corpus d&#8217;apprentissage non &#233;tiquet&#233;. Cette &#233;tape de pr&#233;traitement
permet d&#8217;enrichir la description des corpus. Le syst&#232;me B pourra b&#233;n&#233;ficier de cet enrichisse-
ment durant la phase apprentissage supervis&#233; pour produire la deuxi&#232;me couche d&#8217;&#233;tiquetage.
</p>
<p>4.3 Premiers r&#233;sultats avec l&#8217;algorithme de Brill
</p>
<p>Nous avons adapt&#233; l&#8217;algorithme transformation-based learning (Brill, 1995) pour r&#233;aliser un
syst&#232;me de reconnaissance des EN supervis&#233;. L&#8217;algorithme initialise la classification des EN
gr&#226;ce &#224; un mod&#232;le de langue de type unigramme, entra&#238;n&#233; sur le corpus d&#8217;apprentissage. La
suite de la proc&#233;dure est it&#233;rative : l&#8217;algorithme corrige progressivement la classification initiale</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation de treillis de Galois en d&#233;sambigu&#239;sation non supervis&#233;e d&#8217;entit&#233;s nomm&#233;es
</p>
<p>erron&#233;e en inf&#233;rant une s&#233;quence de r&#232;gles correctrices. Elles sont appliqu&#233;es successivement
sur les &#233;chantillons d&#8217;un corpus pour am&#233;liorer progressivement la classification des EN. Les
r&#232;gles produites par le syst&#232;me sont instanci&#233;es &#224; partir d&#8217;une liste de patrons d&#8217;extraction d&#233;fi-
nis manuellement. Ces patrons sont capables d&#8217;explorer les mots du contexte dans une fen&#234;tre
de +/- 3 mots. Diff&#233;rents types de propri&#233;t&#233;s sont pris en compte par les patrons : le mot, son
&#233;tiquette morpho-syntaxique et, dans le cas du classifieurB, son &#233;tiquette conceptuelle produite
par notre syst&#232;me non supervis&#233;.
</p>
<p>Le figure (4) pr&#233;sente les r&#233;sultats de l&#8217;&#233;valuation en cascade. La colonne de gauche pr&#233;sente
les scores pour l&#8217;&#233;tiqueteur A appliqu&#233; sur les donn&#233;es de test dot&#233;es d&#8217;un &#233;tiquetage morpho-
syntaxique. La colonne de droite correspond aux r&#233;sultats obtenus avec l&#8217;&#233;tiqueteur B qui a &#233;t&#233;
utilis&#233; sur le jeu de test enrichi par l&#8217;annotation conceptuelle issue du treillis de Galois.
</p>
<p>A : Brill simple B : annotation conceptuelle + Brill
Pr&#233;cision Rappel F&#946;=1 Pr&#233;cision Rappel F&#946;=1
</p>
<p>Lieu 66.56% 66.19% 66.38 75.09% 65.65% 70.06
Organisation 52.22% 55.18% 53.66 61.55% 46.91% 53.24
Personne 59.68% 68.62% 63.84 75.32% 57.82% 65.42
Autre 83.58% 60.74% 70.35 85.21% 67.46% 75.30
Total 62.67% 63.61% 63.14 73.81% 59.27% 65.75
</p>
<p>FIG. 4 &#8211; R&#233;sultats de l&#8217;&#233;valuation en cascade
</p>
<p>Notre syst&#232;me de d&#233;sambigu&#239;sation non supervis&#233; apporte donc une am&#233;lioration de 11.14% en
pr&#233;cision, une r&#233;gression de 4.4% en rappel et une progression de 2.61 pour F&#946;=1.
</p>
<p>5 Conclusion, discussion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; une m&#233;thode non supervis&#233;e de d&#233;sambigu&#239;sation d&#8217;entit&#233;s nomm&#233;es, ba-
s&#233;e sur l&#8217;analyse de concepts formels. Cette technique produit un treillis de Galois pour hi&#233;rar-
chiser des relations entre des EN et leurs contextes syntaxiques qui ont &#233;t&#233; extraits de corpus. Le
treillis r&#233;sultant r&#233;alise une double structuration des UL facilitant l&#8217;interpr&#233;tation linguistique,
le lien avec des ressources lexicales existantes et l&#8217;adaptation &#224; des corpus. Nous tirons profit
de cette double structuration pour s&#233;lectionner les concepts d&#233;sambigu&#239;sant &#224; la fois les entit&#233;s
nomm&#233;es et leurs contextes syntaxiques. L&#8217;&#233;valuation en cascade montre qu&#8217;un syst&#232;me de re-
connaissance des EN supervis&#233; am&#233;liore la pr&#233;cision d&#8217;&#233;tiquetage des entit&#233;s nomm&#233;es lorsqu&#8217;il
s&#8217;appuie sur l&#8217;annotation r&#233;alis&#233;e par notre syst&#232;me de d&#233;sambigu&#239;sation non supervis&#233;e.
</p>
<p>Les premiers r&#233;sultats sont encourageants m&#234;me si notre syst&#232;me n&#8217;atteint pas encore les per-
formances obtenues par d&#8217;autres auteurs. Notre proc&#233;dure d&#8217;extraction syntaxique r&#233;alis&#233;e en
amont pourrait &#234;tre am&#233;lior&#233;e par l&#8217;utilisation d&#8217;un analyseur en d&#233;pendances permettant de
couvrir d&#8217;avantage de configurations syntaxiques et d&#8217;identifier diff&#233;rents types de d&#233;pendances
(e.g. sujet-objet, verbe-objet). Ces diff&#233;rents types de relations pourraient permettre de consti-
tuer plusieurs treillis &#224; combiner : cette strat&#233;gie pourrait r&#233;duire significativement le nombre de
concepts assurant ainsi une meilleure g&#233;n&#233;ralisation. D&#8217;autre part nous devrons nous comparer
avec d&#8217;autres mod&#232;les comme l&#8217;analyse distributionnelle classique et les techniques d&#8217;appren-
tissage non supervis&#233; d&#233;riv&#233;es du co-training. Enfin, nous devrons v&#233;rifier que le syst&#232;me est
capable de tenir la charge impos&#233;e par les volumes de donn&#233;es importants.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thomas Girault
</p>
<p>Remerciements : nous remercions vivement Pascale S&#233;billot, Laurent Candillier et Maxime
Amblard pour leurs conseils et leurs remarques &#224; la lecture de cet article.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BENDAOUD R., HACENE M. R., TOUSSAINT Y., DELECROIX B. &amp; NAPOLI A. (2007).
Construction d&#8217;une ontologie &#224; partir d&#8217;un corpus de textes avec l&#8217;ACF. In 18e Journ&#233;es
Francophones d&#8217;Ing&#233;nierie des Connaissances (IC&#8217;2007).
BLUM A. &amp; MITCHELL T. (1998). Combining labeled and unlabeled data with co-training. In
COLT : Proceedings of the Workshop on Computational Learning Theory, p. 92&#8211;100 : Morgan
Kaufmann Publishers.
BOUAUD J., HABERT B., NAZARENKO A. &amp; ZWEIGENBAUM P. (1997). Regroupements
issus de d&#233;pendances syntaxiques en corpus : cat&#233;gorisation et confrontation &#224; deux mod&#233;lisa-
tions conceptuelles. In Ing&#233;ni&#233;rie de la connaissance (IC&#8217;97), p. 207&#8211;223, Roskoff.
BRILL E. (1995). Transformation-based error-driven learning and natural language proces-
sing : A case study in part-of-speech tagging. Computational Linguistics, 21(4), 543&#8211;565.
CANDILLIER L., TELLIER I., TORRE F. &amp; BOUSQUET O. (2006). &#233;valuation en cascade
d&#8217;algorithmes de clustering. In L. MICLET, Ed., 8i&#232;me Conf&#233;rence francophone sur l&#8217;Appren-
tissage automatique (CAp&#8217;2006), p. 109&#8211;124.
CIMIANO P., HOTHO A. &amp; STAAB S. (2005). Learning concept hierarchies from text corpora
using formal concept analysis. Journal of Artificial Intelligence Research, 24, 305&#8211;339.
EHRMANN M. &amp; JACQUET G. (2006). Vers une double annotation des entit&#233;s nomm&#233;es.
Traitement automatique des langues, 47, 63&#8211;88.
GANTER B. &amp; WILLE R. (1999). Formal Concept Analysis. Springer-Verlag.
GRISHMAN R. &amp; SUNDHEIM B. (1996). Message understanding conference- 6 : A brief
history. In COLING, p. 466&#8211;471.
JACQUET G., VENANT F. &amp; VICTORRI B. (2005). Polys&#233;mie lexicale, In P. ENJALBERT,
Ed., S&#233;mantique et traitement automatique du langage naturel. Herm&#232;s Sciences.
JONES R. (2005). Learning to Extract Entities from Labeled and Unlabeled Text. PhD thesis,
Carnegie Mellon University.
KNUTH K. (2004). Lattice duality : the origin of probability and entropy. Neurocomputing,
67C, 245&#8211;274.
PRISS U. &amp; OLD L. J. (2004). Modelling lexical databases with formal concept analysis. J.
UCS, 10(8), 967&#8211;984.
RESNIK P. (1999). Semantic similarity in a taxonomy : An information-based measure and
its application to problems of ambiguity in natural language. Journal of Artificial Intelligence
Research, 11, 95&#8211;130.
SANG E. F. T. K. &amp; MEULDER F. D. (2003). Introduction to the conll-2003 shared task :
Language-independent named entity recognition. CoRR, cs.CL/0306050.
VAN DER MERWE D., OBIEDKOV S. A. &amp; KOURIE D. G. (2004). Addintent : A new incre-
mental algorithm for constructing concept lattices. In P. W. EKLUND, Ed., ICFCA, volume
2961 of Lecture Notes in Computer Science, p. 372&#8211;385 : Springer.
YAROWSKY D. (1995). Unsupervised word sense disambiguation rivaling supervised me-
thods. In Meeting of the Association for Computational Linguistics, p. 189&#8211;196.</p>

</div></div>
</body></html>