<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Rep&#233;rage de citations, classification des styles de discours rapport&#233; et identification des constituants citationnels en &#233;crits journalistiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Rep&#233;rage de citations, classification des styles de discours
rapport&#233; et identification des constituants citationnels en
</p>
<p>&#233;crits journalistiques
</p>
<p>Fabien Poulard1 Thierry Waszak2 Nicolas Hernandez 1 Patrice Bellot2
</p>
<p>(1) LINA UMR 6241 / Universit&#233; de Nantes
(2) LIA / Universit&#233; d&#8217;Avignon
</p>
<p>{fabien.poulard,nicolas.hernandez}@univ-nantes.fr,
{thierry.waszak,patrice.bellot}@univ-avignon.fr
</p>
<p>R&#233;sum&#233;. Dans le contexte de la recherche de plagiat, le rep&#233;rage de citations et de ses
constituants est primordial puisqu&#8217;il peut amener &#224; &#233;valuer le caract&#232;re licite ou illicite d&#8217;une
reprise (source cit&#233;e ou non). Nous proposons ici une comparaison de m&#233;thodes automatiques
pour le rep&#233;rage de ces informations et rapportons une &#233;valuation quantitative de celles-ci. Un
corpus d&#8217;&#233;crits journalistiques fran&#231;ais a &#233;t&#233; manuellement annot&#233; pour nous servir de base
d&#8217;apprentissage et de test.
</p>
<p>Abstract. In the application context of reported content, that includes plagiarism and
impact of textual information searched, citations finding and its fundamentals is essential as it
may help estimating legal value of a citation (with or without specifying original source). We
propose here a comparison between automatic methods for finding up those elements and we
quantitatively evaluate them. A French journalistic corpus has been manually annotated to be
used as learning base and for testing.
</p>
<p>Mots-cl&#233;s : d&#233;tection de citations, classification des styles de discours rapport&#233;, identi-
fication du locuteur, techniques par apprentissage et base de r&#232;gles, &#233;crits journalistiques.
</p>
<p>Keywords: detection of citations, reported speech style classification, source identifi-
cation, machine learning and rules-based techniques, news corpus.
</p>
<p>1 Introduction
</p>
<p>&#171; Qui dit quoi sur qui (quoi) et de quelle mani&#232;re ? &#187; L&#8217;int&#233;r&#234;t pour cette question, et plus lar-
gement les informations de type attribution, n&#8217;est pas nouveau et l&#8217;on constate m&#234;me un certain
regain depuis quelques ann&#233;es avec les travaux cherchant &#224; mesurer la subjectivit&#233; (opinion,
sentiment, &#233;motion) engag&#233;e dans l&#8217;attribution.
</p>
<p>Cet int&#233;r&#234;t se retrouve dans plusieurs disciplines (linguistique, sociologie, traitement automa-
tique des langues, professions de la documentation. . .). Pour certains il s&#8217;agit de mesurer l&#8217;im-
pact du travail d&#8217;un chercheur (mesures bibliom&#233;triques) (Hirsch, 2005), pour d&#8217;autres d&#8217;am&#233;-
liorer les syst&#232;mes existants avec de nouvelles formes de r&#233;sum&#233; (orient&#233; selon une opinion)
(Stoyanov &amp; Cardie, 2006), de recherche d&#8217;information (indexation des documents par les ci-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard Thierry Waszak Nicolas Hernandez Patrice Bellot
</p>
<p>tations) (Ritchie et al., 2006), de question-r&#233;ponse (&#171; Que pense X au sujet de Y ? &#187;) (Soma-
sundaran et al., 2007). Finalement pour d&#8217;autres encore il s&#8217;agit de collecter des opinions sur
diff&#233;rents sujets (Wilson et al., 2005), potentiellement &#224; des fins commerciales (suivi de l&#8217;im-
pact d&#8217;un produit) (Dave et al., 2003). Ces travaux couvrent plusieurs t&#226;ches : du rep&#233;rage de la
pr&#233;sence d&#8217;attribution &#224; l&#8217;identification de l&#8217;&#233;tendue de ses constituants en passant par la mesure
de sa fonction rh&#233;torique, de sa subjectivit&#233;, de sa polarit&#233; et de son contexte. N&#233;anmoins, cette
couverture est in&#233;gale selon la langue, le genre de texte et la motivation applicative.
</p>
<p>Le contexte applicatif du pr&#233;sent article est celui de la d&#233;tection de plagiats et du suivi d&#8217;im-
pact &#224; partir d&#8217;un &#233;crit original, dans des textes journalistiques francophones. Ce travail s&#8217;inscrit
dans le cadre du projet ANR PIITHIE1 (Plagiats et Impacts de l&#8217;Information Textuelle recHer-
ch&#233;e dans un contexte InterlinguE). Dans cette perspective, le rep&#233;rage de citations et de ses
constituants (l&#8217;identification de la source et son propos) est primordial puisqu&#8217;il peut permettre
l&#8217;&#233;valuation du caract&#232;re licite ou illicite d&#8217;une reprise. En effet, la d&#233;tection de plagiat se fait
notamment par identification de similarit&#233;s entre deux textes. La pr&#233;sence commune de citations
a tendance &#224; augmenter artificiellement la similarit&#233; entre deux textes qui ne sont pas plagiat
l&#8217;un de l&#8217;autre. &#192; l&#8217;inverse, en faisant l&#8217;hypoth&#232;se que les citations ne sont pas modifi&#233;es dans
un texte plagi&#233;, les citations constituent de bons points de rep&#232;res pour identifier de potentiels
plagiats en analysant le texte environnant et seulement celui-ci.
</p>
<p>Dans cet article, nous proposons des approches pour le rep&#233;rage des citations, leur classification
en discours direct (DD) ou discours indirect (DI), ainsi que pour l&#8217;identification des entit&#233;s
nomm&#233;es dont on rapporte un discours, et les segments textuels entre guillemets porteurs de DD.
L&#8217;int&#233;r&#234;t pour les DD s&#8217;explique par le fait que l&#8217;identification d&#8217;une reprise verbatim facilite le
suivi d&#8217;impact. &#192; ces fins, nous avons construit et annot&#233; un corpus d&#8217;&#233;crits journalistiques.
</p>
<p>1.1 Travaux existants en rep&#233;rage d&#8217;attribution
</p>
<p>Notre probl&#233;matique diff&#232;re de celle qui a pu &#234;tre trait&#233;e dans les travaux men&#233;s en anglais sur
des textes scientifiques (Teufel et al., 2006) o&#249; les sources sont clairement identifi&#233;es (l&#8217;auteur
ou les r&#233;f&#233;rences bibliographiques) et les formes de reprise diff&#233;rentes, puisque pour ce genre
les citations constituent un positionnement de l&#8217;auteur &#233;crivain qui nourrit son discours, alors
que pour les &#233;crits journalistiques, le discours rapport&#233; constitue l&#8217;essence m&#234;me de l&#8217;article.
</p>
<p>Nos consid&#233;rations seraient davantage &#224; rapprocher des travaux en reconnaissance d&#8217;attribution
et de capture de subjectivit&#233; r&#233;alis&#233;s sur les journaux et les blogs (Bethard et al., 2004; Choi
et al., 2005; Stoyanov &amp; Cardie, 2006; Somasundaran et al., 2007). Nous nous diff&#233;rencions
n&#233;anmoins sur plusieurs points. Outre le fait que ces travaux ont &#233;t&#233; dirig&#233;s sur de l&#8217;anglais,
ils reposent avant tout sur des ressources lexicales importantes (pour mesurer la subjectivit&#233;),
syntaxiques (arbre de d&#233;pendance ou fonction grammaticale) et s&#233;mantiques pour les travaux
ayant cherch&#233; &#224; identifier les syntagmes sources et les propositions porteuses d&#8217;un discours re-
pris. En comparaison nos approches visent &#224; exploiter essentiellement des marques de surfaces
de nature typographique, morphologique et positionnelle. En cela, nous suivons l&#8217;approche d&#233;-
crite par (Giguet &amp; Lucas, 2004). Ces marques sont n&#233;anmoins compl&#233;t&#233;es par une ressource
lexicale de verbes de parole produite par (Mourad &amp; Descl&#233;s, 2004).
</p>
<p>&#192; notre connaissance, (Mourad &amp; Descl&#233;s, 2004) et (Giguet &amp; Lucas, 2004) sont les seuls
</p>
<p>1Ce travail a b&#233;n&#233;fici&#233; d&#8217;une aide de l&#8217;Agence Nationale de la Recherche, projet PIITHIE portant la r&#233;f&#233;rence
2006 TLOG 013 03. www.piithie.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de citations, classification des styles de discours rapport&#233; et identification des
constituants citationnels en &#233;crits journalistiques
</p>
<p>travaux r&#233;alis&#233;s en fran&#231;ais sur le rep&#233;rage de citations. Ces deux techniques reposent sur des
r&#232;gles. Celle de (Mourad &amp; Descl&#233;s, 2004) se fonde sur l&#8217;exploration contextuelle qui distingue
les marques ayant un r&#244;le d&#8217;embrayeur de celles jouant le r&#244;le de confirmateur. Le mod&#232;le de
(Giguet &amp; Lucas, 2004) s&#8217;appuie dans un premier temps sur la co-pr&#233;sence de marques pour re-
conna&#238;tre les constituants source, relateur ou discours, puis sur la reconnaissance du motif SRD
(source + relateur + discours rapport&#233;) ou de son inverse, DRS, pour rep&#233;rer une citation. Par
la suite, nous nous int&#233;ressons &#224; l&#8217;expression linguistique r&#233;f&#233;rant &#224; la source que nous appelons
&#171; expression locuteur &#187;. Nous &#233;tendons ce mod&#232;le en ne posant pas de contraintes sur les motifs
possibles et en consid&#233;rant diverses techniques de reconnaissance notamment par apprentissage
supervis&#233;. Par ailleurs nous apportons une &#233;valuation quantitative de nos m&#233;thodes.
</p>
<p>1.2 Difficult&#233; des t&#226;ches de rep&#233;rage de citations et de ses constituants
</p>
<p>Les probl&#232;mes du rep&#233;rage sont complexes puisqu&#8217;une citation peut se caract&#233;riser par diff&#233;rents
types d&#8217;information. Dans sa typologie, (Jackiewicz, 2006), d&#233;crit les citations en fonction du
type d&#8217;information accompagnant le discours repris (param&#232;tres de la situation d&#8217;&#233;nonciation
(par qui, quand, o&#249; et pour qui), intentions du locuteur d&#8217;origine, informations &#224; l&#8217;attention de
celui &#224; qui le discours est rapport&#233;). (Giguet &amp; Lucas, 2004) parlent d&#8217;invariants prototypiques et
consid&#232;rent en plus du discours repris et de sa source, l&#8217;&#233;l&#233;ment relateur qui marque le lien entre
ces derniers. Dans un contexte d&#8217;analyse de la subjectivit&#233;, (Prasad et al., 2006) rendent compte
d&#8217;un important travail sur l&#8217;annotation des attributions en fonction de leur source, leur degr&#233; de
factualit&#233;, leur polarit&#233; et leur contexte d&#8217;existence. Notre d&#233;finition d&#8217;expression locuteur se
rapproche des cas de sources indirectes qu&#8217;ils consid&#232;rent.
</p>
<p>Outre ces diff&#233;rents types d&#8217;informations, il existe plusieurs mani&#232;res2 de restituer un discours
en provenance d&#8217;une situation d&#8217;&#233;nonciation initiale. En effet, les reprises de discours peuvent
prendre diff&#233;rentes formes d&#8217;int&#233;gration, du style direct (reprise litt&#233;rale traditionnellement mar-
qu&#233;e par des guillemets (cf. exemples 1 et 2) au style indirect (discours int&#233;gr&#233; dans l&#8217;&#233;non-
ciation du reprenant (cf. exemples 3) en passant par des formes interm&#233;diaires avec des &#238;lots
de reprises verbatims (que nous appelons style &#171; &#224; composantes &#187;) (cf. exemple 4). De surcro&#238;t,
outre le fait qu&#8217;il puisse &#234;tre difficile de d&#233;limiter un discours repris, celui-ci peut &#234;tre fragment&#233;
(cf. exemple 2) voire &#233;tal&#233; sur plusieurs phrases. &#192; cela on peut encore ajouter le fait que les in-
formations caract&#233;risant une citation peuvent prendre diff&#233;rentes formes morpho-syntaxiques :
e.g. relateur verbal ou pr&#233;positionnel (cf. exemples 1 et 3), source marqu&#233;e par un pronom
ou une entit&#233; nomm&#233;e (cf. exemples 2 et 4), se combiner selon diff&#233;rentes configurations syn-
taxiques (cf. exemples 1 et 2), ou se retrouver distribu&#233;es dans une fen&#234;tre transphrastique.
</p>
<p>(1) Le quotidien &#233;conomique souligne : &#8220;Si le rapport ne veut pas associer ces montants &#224; l&#8217;id&#233;e
d&#8217;une nouvelle &#8217;cagnotte&#8217; budg&#233;taire, ni au d&#233;bat &#233;lectoral sur le niveau de pr&#233;l&#232;vements obliga-
toires, le montant est &#233;quivalent au d&#233;ficit budg&#233;taire de l&#8217;&#201;tat, &#224; savoir 36,5 milliards d&#8217;euros l&#8217;an
dernier.&#8221;
(2) &quot;En 2003 , explique-t-il, j&#8217;ai fait effectuer douze tests sur des vols en France, dans onze cas sur
douze, des armes et explosifs ont pu &#234;tre introduits dans les avions&quot;.
(3) D&#8217;apr&#232;s sa m&#232;re, Julien faisait une sieste dans l&#8217;appartement familial lorsqu&#8217;il a disparu.
(4) Le Figaro estime, lui, que &quot;les techniciens et les cadres sont en premi&#232;re ligne&quot;, notamment
ceux de la &quot;Central Entity&quot; de Toulouse.
</p>
<p>2Le groupe de recherche Ci-dit rend compte de nombreuses descriptions exemplifi&#233;es de ces formes en corpus
de presse et de litt&#233;rature. www.ci-dit.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard Thierry Waszak Nicolas Hernandez Patrice Bellot
</p>
<p>2 Corpus
</p>
<p>Nous avons constitu&#233; un corpus avec trois objectifs en t&#234;te. Tout d&#8217;abord, pour obtenir des actes
langagiers r&#233;els illustrant les diff&#233;rents concepts d&#233;crits &#224; la section pr&#233;c&#233;dente. Ensuite, pour
servir de support d&#8217;apprentissage supervis&#233;. Finalement, pour nous permettre d&#8217;&#233;valuer les per-
formances de nos m&#233;thodes. Nous pr&#233;sentons dans cette section la constitution et l&#8217;organisation
du corpus dans un premier temps, puis nous d&#233;crivons statistiquement sa composition.
</p>
<p>Notre corpus est constitu&#233; d&#8217;articles extraits des &#233;ditions en ligne de journaux francophones (La
Tribune, Challenges, Le Soir, Le Figaro, Lib&#233;ration, L&#8217;Humanit&#233;, Le Monde, AFP, Reuters).
Tous ces articles ont &#233;t&#233; collect&#233;s s&#233;par&#233;ment dans un premier temps et finalement fusionn&#233;s en
un seul corpus. Le contenu de chacun des 108 articles (env. 70 000 mots) a &#233;t&#233; stock&#233; sous forme
d&#8217;un arbre XML dans un fichier, accompagn&#233; de m&#233;tadonn&#233;es sur le nom du journal, la date
de publication et les auteurs. Nous avons annot&#233; manuellement, en nous inspirant du sch&#233;ma
SRD de (Giguet &amp; Lucas, 2004), 846 expressions locuteur et 938 discours repris, en pr&#233;cisant
pour ces derniers le style de discours rapport&#233; associ&#233; : direct, indirect ou &#224; composantes. On
trouve en moyenne 9 discours repris par article, avec un minimum de 5,4 pour les articles du
quotidien &#8220;Le Soir&#8221;. Si la taille des discours repris est d&#8217;environ 25 mots, le rapport entre les
mots appartenant &#224; du discours repris par rapport au discours englobant varie de 17% pour
Challenges &#224; pr&#232;s de 70% pour Reuters.
</p>
<p>Les styles de discours rapport&#233; modifiant peu le discours source sont les plus fortement utilis&#233;s.
En effet, pr&#232;s de 80% des discours repris que nous avons annot&#233;s sont rapport&#233;s au style direct
ou &#224; composantes. D&#8217;une mani&#232;re g&#233;n&#233;rale, les expressions locuteurs sont moins nombreuses
que les discours repris. Toutefois, 9 discours repris sur 10 sont accompagn&#233;s d&#8217;une expression
locuteur. Les journalistes s&#8217;efforcent donc d&#8217;accompagner les discours qu&#8217;ils rapportent d&#8217;une
expression faisant r&#233;f&#233;rence &#224; l&#8217;&#233;nonciateur source. (Poulard, 2008) d&#233;crit quantitativement et
qualitativement un sous-ensemble du corpus avec plus de pr&#233;cision.
</p>
<p>3 Propositions de m&#233;thodes de rep&#233;rage
</p>
<p>Nous avons utilis&#233; le corpus d&#233;crit dans la section pr&#233;c&#233;dente pour exp&#233;rimenter plusieurs ap-
proches que nous pr&#233;sentons dans cette section. Chaque m&#233;thode n&#233;cessite un pr&#233;traitement :
&#233;tiquetage grammatical, lemmatisation3 et d&#233;coupage en phrases pr&#233;servant les segments entre
guillemets. Les deux premi&#232;res m&#233;thodes pr&#233;sent&#233;es cherchent &#224; rep&#233;rer les segments de dis-
cours repris au style direct et indirect, &#224; l&#8217;aide d&#8217;automates pour la premi&#232;re et statistiquement
pour la seconde. La troisi&#232;me m&#233;thode tente de rep&#233;rer statistiquement les constituants citation-
nels &#224; partir de candidats pr&#233;determin&#233;s.
</p>
<p>3.1 Classification des discours &#224; l&#8217;aide d&#8217;automates &#224; &#233;tats finis
</p>
<p>Notre but est de classer des segments de texte comme &#233;tant ou non du discours repris direct ou
indirect. L&#8217;id&#233;e est de rep&#233;rer les &#233;l&#233;ments du sch&#233;ma SRD propos&#233; par (Giguet &amp; Lucas, 2004)
et de les mettre en relation gr&#226;ce &#224; l&#8217;utilisation d&#8217;automates &#224; &#233;tats finis. Nous sommes ici dans
une approche linguistique n&#233;cessitant l&#8217;&#233;criture de r&#232;gles repr&#233;sent&#233;es par des automates.
</p>
<p>3Nous avons utilis&#233; TreeTagger pour le d&#233;coupage en mots, l&#8217;&#233;tiquetage et la lemmatisation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de citations, classification des styles de discours rapport&#233; et identification des
constituants citationnels en &#233;crits journalistiques
</p>
<p>Le principe des automates &#224; &#233;tats finis (Finite State Machine &#8211; FSM) &#233;tant d&#8217;accepter ou de
rejeter des suites de symboles, nous pouvons, dans un premier temps, les utiliser pour identifier
dans les textes des expressions locuteur, des relateurs ou des segments de discours repris poten-
tiels. En effet, en reprenant l&#8217;exemple (1) de la section 1, l&#8217;expression locuteur &#171; Le quotidien
&#233;conomique &#187; (qui peut &#234;tre d&#233;compos&#233;e comme &#233;tant un d&#233;terminant suivi d&#8217;un nom et d&#8217;un
adjectif) pourra &#234;tre identifi&#233;e &#224; l&#8217;aide d&#8217;un FSM sp&#233;cifique (les FSM se basant sur les &#233;tiquettes
morpho-syntaxiques et sur les lemmes des mots). De m&#234;me, le relateur &#171; souligne : &#187; est iden-
tifi&#233; ainsi que le segment de texte entre guillemets qui le suit (discours repris direct potentiel).
Pour cette approche, il nous a donc fallu concevoir tous les FSM possibles pouvant repr&#233;senter
les expressions locuteur, relateurs et segments de discours repris potentiels, soit environ 900
FSM repr&#233;sentant 39 cat&#233;gories diff&#233;rentes comme les expressions locuteur compos&#233;es d&#8217;un
d&#233;terminant suivi d&#8217;un nom, d&#8217;un nom propre ou les relateurs compos&#233;s d&#8217;un auxiliaire suivi
d&#8217;un verbe d&#8217;expression, . . .
</p>
<p>Afin d&#8217;identifier D comme faisant partie du sch&#233;ma SRD, nous proc&#233;dons en trois &#233;tapes : un
premier niveau de FSM identifie toutes les expressions locuteur, les relateurs et les segments
de discours repris potentiels ; puis un deuxi&#232;me niveau associe les expressions locuteur avec
les relateurs (exemple de la figure 1) ; finalement, un dernier niveau permet de compl&#233;ter le
sch&#233;ma SRD. S&#8217;il existe un FSM permettant d&#8217;associer les &#233;l&#233;ments S, R et D, en consid&#233;rant
tous les ordres possibles, on d&#233;cide qu&#8217;il s&#8217;agit r&#233;ellement d&#8217;un discours repris. Pr&#233;cisons que
le dernier niveau est compos&#233; de deux cat&#233;gories de FSM, ceux identifiant le discours direct et
ceux identifiant le discours indirect.
</p>
<p>FIG. 1 &#8211; Exemple d&#8217;un FSM permettant d&#8217;associer une expression locuteur avec un relateur.
</p>
<p>3.2 Classification des discours par apprentissage
</p>
<p>En comparaison avec la pr&#233;c&#233;dente m&#233;thode, nous pr&#233;sentons ici, une approche statistique de
rep&#233;rage des segments de discours repris. Il s&#8217;agit d&#8217;effectuer un apprentissage &#224; partir du corpus
annot&#233; manuellement pour aboutir &#224; un mod&#232;le pr&#233;dictif des classes : nous voulons classer les
segments de texte comme &#233;tant soit du discours direct, soit du discours indirect, soit n&#8217;&#233;tant pas
du discours repris.
</p>
<p>Afin d&#8217;obtenir des segments de discours repris candidats, nous utilisons le premier niveau des
FSM &#233;voqu&#233; pr&#233;c&#233;demment. Ces FSM nous permettent &#233;galement de retrouver certains consti-
tuants (comme les verbes d&#8217;&#233;nonciation, les syntagmes pr&#233;positionnels, . . .) qui vont permettre
d&#8217;extraire les attributs pour l&#8217;apprentissage. En partant de nos observations et en se fondant sur
(Mourad &amp; Descl&#233;s, 2004), nous avons pu d&#233;gager les &#233;l&#233;ments caract&#233;ristiques &#224; retenir pour</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard Thierry Waszak Nicolas Hernandez Patrice Bellot
</p>
<p>l&#8217;&#233;laboration d&#8217;un syst&#232;me statistique. Ces caract&#233;ristiques correspondent &#224; des marques lexi-
cales, syntaxiques et typographiques. Ainsi, nous consid&#233;rons par rapport au cadre phrastique
contenant le discours repris candidat D deux types d&#8217;attributs : ceux recherch&#233;s &#224; l&#8217;int&#233;rieur du
cadre phrastique et ceux ne s&#8217;y limitant pas. Pour les premiers, nous consid&#233;rons les distances
en nombre de mots entre D et le plus proche verbe d&#8217;&#233;nonciation, entre D et le plus proche verbe
d&#8217;&#233;nonciation de discours indirect (sous ensemble des verbes d&#8217;&#233;nonciation) et enfin entre D et
le plus proche syntagme pr&#233;positionnel. Pour les seconds, nous recherchons la pr&#233;sence, dans
les trois et neuf mots du contexte gauche ou droit de D, un indice du type : verbe, syntagme pr&#233;-
positionnel, conjonction que (attributs bool&#233;ens). Nous utilisons &#233;galement comme attributs les
&#233;tiquettes morpho-syntaxiques associ&#233;es &#224; D (qui permettent notamment d&#8217;identifier le change-
ment de temps des verbes dans D) ainsi que le nombre de mots composant D.
</p>
<p>Les mod&#232;les ont &#233;t&#233; construits et test&#233;s &#224; l&#8217;aide d&#8217;arbres de d&#233;cision, de machines &#224; support de
vecteurs (SVM) et des r&#233;seaux Bay&#233;siens.
</p>
<p>3.3 Identification des constituants
</p>
<p>Nous contournons la difficult&#233; de d&#233;terminer les bornes des constituants discours repris et ex-
pression locuteur en identifiant des segments appartenant &#224; l&#8217;un, puis &#224; l&#8217;autre.
</p>
<p>3.3.1 Appartenance au discours repris
</p>
<p>Environ 80%4 des discours repris dans notre corpus contiennent un passage entre guillemets, et
82% de ces derniers appartiennent &#224; un discours repris. Nous faisons donc l&#8217;hypoth&#232;se que les
segments entre guillemets sont candidats &#224; appartenir &#224; un discours repris. Ce choix se justifie
par leur extraction ais&#233;e, en couplant les guillemets dans une pile par exemple. &#192; partir des
candidats extraits de notre corpus et caract&#233;ris&#233;s automatiquement selon les marques pr&#233;sent&#233;es
ci-dessous, nous avons produit un mod&#232;le pr&#233;dictif dont les performances sont pr&#233;sent&#233;es &#224; la
section 4.2.
</p>
<p>Nous caract&#233;risons automatiquement des segments entre guillemets dans leur contexte phras-
tique afin de les classer en deux cat&#233;gories : ceux appartenant &#224; du discours repris et les autres.
Nous consid&#233;rons uniquement des marques de surface ou qui peuvent &#234;tre calcul&#233;es ais&#233;ment.
Ainsi, nous prenons en compte les marques discursives classiques (pronoms et adjectifs pos-
sessifs aux premi&#232;res personnes, verbes conjugu&#233;s au sein du candidat), mais &#233;galement les
&#233;l&#233;ments marquant une rupture dans l&#8217;&#233;nonciation (les incises [. . .] ou (. . .), guillemets au sein
des candidats). Nous y ajoutons les relateurs de (Giguet &amp; Lucas, 2004) : verbe + que, verbes
d&#8217;&#233;nonciation (Mourad &amp; Descl&#233;s, 2004). Finalement, nous avons consid&#233;r&#233; la taille en mots
des candidats et la pr&#233;sence dans le contexte phrastique de pronoms &#224; la troisi&#232;me personne.
Cette derni&#232;re marque permet de contre-balancer la pr&#233;sence des pronoms aux premi&#232;res per-
sonnes dans une &#233;nonciation qui n&#8217;est pas &#224; la troisi&#232;me personne.
</p>
<p>Les marques sus &#233;nonc&#233;es nous ont permis de caract&#233;riser automatiquement les 1004 segments
entre guillemets de notre corpus, dont 820 appartiennent &#224; un discours repris. La classification
de ces candidats nous permet d&#8217;obtenir des segments appartenant &#224; du discours repris.
</p>
<p>4508 discours direct et 259 discours &#224; composantes pour 938 discours repris au total.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de citations, classification des styles de discours rapport&#233; et identification des
constituants citationnels en &#233;crits journalistiques
</p>
<p>3.3.2 Appartenance aux expressions locuteur
</p>
<p>Neuf discours repris sur dix sont accompagn&#233;s d&#8217;une expression locuteur dans notre corpus.
Selon (Giguet &amp; Lucas, 2004), les expressions locuteur apparaissent en premier lieu sous des
formes tr&#232;s d&#233;termin&#233;es, reprises par la suite sous forme de &#8220;r&#233;ductions lexicales&#8221;, &#8220;d&#8217;ana-
phores&#8221;. Nous faisons l&#8217;hypoth&#232;se que ces formes tr&#232;s d&#233;termin&#233;es sont constitu&#233;es d&#8217;entit&#233;s
nomm&#233;es, et choisissons ces derni&#232;res comme candidates. Nous utilisons N&#233;mesis (Fourour,
2004) pour leur extraction. &#192; partir des candidats extraits de notre corpus annot&#233; et caract&#233;ris&#233;s
automatiquement selon les marques pr&#233;sent&#233;es ci-dessous, nous avons pu produire un mod&#232;le
pr&#233;dictif dont les performances sont pr&#233;sent&#233;es &#224; la section 4.2.
</p>
<p>Nous caract&#233;risons les entit&#233;s nomm&#233;es afin de les classer en deux cat&#233;gories : celles apparte-
nant &#224; une expression locuteur et les autres. Les marques retenues correspondent &#224; la mise en
place du sc&#233;nario d&#8217;&#233;nonciation : syntagmes pr&#233;positionnels Selon X, D&#8217;apr&#232;s X, . . ., proximit&#233;
d&#8217;un verbe d&#8217;&#233;nonciation ou encore la taille en mot.
</p>
<p>Les marques sus &#233;nonc&#233;es nous ont permis de caract&#233;riser automatiquement les 1703 entit&#233;s
nomm&#233;es de notre corpus, dont 2915 appartiennent &#224; un discours repris.
</p>
<p>4 &#201;valuations
</p>
<p>Nous avons &#233;valu&#233; les m&#233;thodes pr&#233;c&#233;demment pr&#233;sent&#233;es par validation crois&#233;e sur notre cor-
pus &#224; l&#8217;aide de la plateforme Weka (Witten &amp; Frank, 2005), en consid&#233;rant les m&#233;triques clas-
siques (pr&#233;cision, rappel, F-mesure). La premi&#232;re section pr&#233;sente l&#8217;&#233;valuation des m&#233;thodes
de rep&#233;rage des segments de discours repris au style direct et indirect, et la deuxi&#232;me section
&#233;value la m&#233;thode de recherche des constituants.
</p>
<p>4.1 M&#233;thode pour le rep&#233;rage du discours direct et indirect
</p>
<p>Notons tout d&#8217;abord que pour le calcul de la pr&#233;cision et du rappel, dans le cas du discours
direct, est consid&#233;r&#233; correct un segment de texte dont les fronti&#232;res co&#239;ncident exactement avec
le segment de r&#233;f&#233;rence. Dans le cas du discours indirect, nous choisissons de consid&#233;rer un
segment comme correct simplement s&#8217;il y a chevauchement avec le segment de r&#233;f&#233;rence. Cela
nous permet notamment de mesurer la couverture du syst&#232;me et refl&#232;te la difficult&#233; de segmen-
tation du discours indirect dont nous mesurons la qualit&#233; en utilisant la mesure WindowDiff
d&#233;finie par (Pevzner &amp; Hearst, 2002). Notons que cette mesure indique une segmentation opti-
male lorsqu&#8217;elle vaut 0.
</p>
<p>Dans cette &#233;valuation, nous consid&#233;rons dans le corpus pr&#233;sent&#233; dans la section 2 comme dis-
cours direct, les segments de discours repris direct mais aussi chaque segment de texte entre
guillemets &#224; l&#8217;int&#233;rieur des segments de discours repris &#171; &#224; composantes &#187;. Ce qui repr&#233;sente
863 segments de discours direct et 171 segments de discours indirect.
</p>
<p>Dans le cas de la premi&#232;re m&#233;thode &#224; base de FSM, nous utilisons l&#8217;ensemble de ce corpus
comme corpus de test ; les FSM ayant &#233;t&#233; con&#231;u &#224; partir d&#8217;un autre corpus de d&#233;veloppe-
</p>
<p>5&#192; supposer que chaque expression locuteur compte au plus une entit&#233; nomm&#233;e, ces derni&#232;res couvriraient
34% des expressions locuteur du corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard Thierry Waszak Nicolas Hernandez Patrice Bellot
</p>
<p>ment contenant 261 segments de discours direct et 82 segments de discours indirect. En ce
qui concerne l&#8217;approche statistique, une validation crois&#233;e (&#224; l&#8217;aide de Weka) a &#233;t&#233; effectu&#233;e sur
le corpus. Les r&#233;sultats sont pr&#233;sent&#233;s dans le tableau 1.
</p>
<p>M&#233;thode Discours direct Discours indirect
Pr&#233;cision Rappel F-Mesure Pr&#233;cision Rappel F-Mesure
</p>
<p>FSM 0,89 0,93 0,91 0,58 0,72 0,68
R&#233;seaux Bay&#233;siens 0,86 0,93 0,91 0,58 0,68 0,64
SVM 0,92 0,88 0,89 0,70 0,52 0,57
Arbres de d&#233;cision 0,91 0,88 0,89 0,66 0,52 0,56
</p>
<p>TAB. 1 &#8211; &#201;valuation des m&#233;thodes pour les discours directs et indirects
</p>
<p>Nous obtenons des r&#233;sultats tr&#232;s satisfaisants pour le discours direct. En ce qui concerne les 10%
de pertes, notons que la majeure partie des segments de discours direct non rapport&#233;s ne peuvent
pas &#234;tre rattach&#233;s &#224; une expression locuteur. Comme pr&#233;vu, le rep&#233;rage du discours indirect pose
davantage de difficult&#233;s. Les r&#233;sultats montrent toutefois que les syst&#232;mes &#224; base de FSM et des
r&#233;seaux Bay&#233;siens sont capables d&#8217;identifier la pr&#233;sence d&#8217;environ 70% des citations indirectes.
En ce qui concerne le WindowDiff pour la m&#233;thode &#224; base de FSM nous obtenons une mesure
de 0,23. Cela refl&#232;te le fait que la segmentation des discours indirects n&#8217;est pas optimale. En
effet, elle a &#233;t&#233; faite en suivant des heuristiques : par exemple, on suppose qu&#8217;un segment de
discours indirect commen&#231;ant par la conjonction que se termine avec la phrase. Ce qui n&#8217;est
pas toujours le cas. Les r&#233;sultats obtenus par les FSM sont tr&#232;s proches de ceux des r&#233;seaux
Bay&#233;siens. On peut remarquer que les SVM, tout comme les arbres de d&#233;cisions, permettent
d&#8217;avoir une meilleure pr&#233;cision. Toutefois cela est obtenu au d&#233;triment du rappel, dont la chute
est importante pour le discours indirect.
</p>
<p>4.2 M&#233;thode avec apprentissage supervis&#233;, recherche des constituants
</p>
<p>Nous utilisons une classification selon la classe majoritaire comme approche de base, le rappel
et la pr&#233;cision pour la seconde classe est donc toujours nul. Nous avons fait ce choix faute de
r&#233;sultats exp&#233;rimentaux dans la litt&#233;rature. Nous pr&#233;sentons ci-dessous l&#8217;&#233;valuation du mod&#232;le
pour la classification des segments entre guillemets, puis l&#8217;&#233;valuation de celui pour la classifi-
cation des entit&#233;s nomm&#233;es en expression locuteur.
</p>
<p>Pour rappel, nous consid&#233;rons les segments entre guillemets comme sous-ensembles candidats
de discours repris. Nous s&#233;parons les segments entre guillemets en deux classes : ceux qui font
partie d&#8217;un discours repris, et ceux n&#8217;appartenant &#224; aucun. La premi&#232;re classe est majoritaire,
l&#8217;approche de base obtient une F-mesure de 0,899. Nous obtenons les meilleurs r&#233;sultats avec
l&#8217;algorithme ADTree6 (cf. Tableau 2). Le mod&#232;le est alors capable de rep&#233;rer 94% des segments
entre guillemets appartenant &#224; un discours repris avec une pr&#233;cision de 89,4%, soit un gain de
7,7 points par rapport &#224; l&#8217;approche de base.
</p>
<p>&#192; l&#8217;instar des segments entre guillemets, nous consid&#233;rons les entit&#233;s nomm&#233;es comme sous-
ensembles candidats d&#8217;expressions locuteur. Nous les s&#233;parons en deux classes : celles prenant
part &#224; une expression locuteur, et les autres. Cette deuxi&#232;me classe est majoritaire, l&#8217;approche de
base offrant une pr&#233;cision de 82,9%. Nous nous int&#233;ressons aux entit&#233;s nomm&#233;es de la premi&#232;re
</p>
<p>6Algorithme de type arbre de d&#233;cision.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Rep&#233;rage de citations, classification des styles de discours rapport&#233; et identification des
constituants citationnels en &#233;crits journalistiques
</p>
<p>classe, les r&#233;sultats les plus probants sont obtenus avec les r&#233;seaux Bay&#233;siens (cf. Tableau 2).
Nous r&#233;cup&#233;rons alors pr&#232;s de 50% des entit&#233;s nomm&#233;es constituant les expressions locuteur,
et parmis celles que nous s&#233;lectionnons, 45% appartiennent effectivement &#224; des expressions
locuteur. Les entit&#233;s nomm&#233;es repr&#233;sentent 34% des expressions locuteurs de notre corpus,
nous pouvons donc extraire ainsi 17% des expressions locuteur du corpus.
</p>
<p>M&#233;thode Classe discours repris Classe non discours repris
Pr&#233;cision Rappel F-mesure Pr&#233;cision Rappel F-mesure
</p>
<p>Approche de base 0,817 1 0,899 0 0 0
R&#233;seaux Bay&#233;siens 0,893 0,884 0,888 0,505 0,527 0,516
SVM 0,817 1 0,899 0 0 0
Arbre (ADTree) 0,894 0,94 0,917 0,655 0,505 0,571
</p>
<p>M&#233;thode Classe expression locuteur Classe non expression locuteur
Pr&#233;cision Rappel F-mesure Pr&#233;cision Rappel F-mesure
</p>
<p>Approche de base 0 0 0 0,829 1 0,907
R&#233;seaux Bay&#233;siens 0,458 0,474 0,466 0,891 0,885 0,888
SVM 0 0 0 0,829 1 0,907
Arbre (J48) 0,576 0,247 0,346 0,861 0,962 0,909
</p>
<p>TAB. 2 &#8211; &#201;valuation des mod&#232;les pour le rep&#233;rage des constituants.
</p>
<p>5 Conclusion et discussion
</p>
<p>Dans cet article, nous avons propos&#233; et &#233;valu&#233; diff&#233;rentes m&#233;thodes d&#233;di&#233;es &#224; l&#8217;analyse du
discours rapport&#233; en corpus de presse. &#192; cette fin, nous avons construit et annot&#233; manuellement
un corpus que nous souhaitons rendre public (discussion avec les &#233;diteurs en cours).
</p>
<p>Notre approche a montr&#233; des r&#233;sultats significatifs. Comme nous l&#8217;avons d&#233;j&#224; mentionn&#233;, &#224; notre
connaissance, il n&#8217;y a pas d&#8217;&#233;valuation disponible pour le fran&#231;ais pour les t&#226;ches de d&#233;tection de
citations, d&#8217;identification des composants citationnels, ou encore de classification des styles de
discours rapport&#233; (Mourad &amp; Descl&#233;s, 2004), (Giguet and Lucas, 2004). En anglais, des travaux
similaires ont &#233;t&#233; men&#233;s dans le contexte de l&#8217;analyse de la subjectivit&#233;. N&#233;anmoins les r&#233;sultats
ne peuvent pas &#234;tre compar&#233;s car le discours rapport&#233; est un cas particulier d&#8217;attribution. De
plus, nos int&#233;r&#234;ts diff&#232;rent souvent. Alors que nous n&#8217;observons que les sources indirectes (les
seules pr&#233;sentes dans les articles de presse), (Bethard et al., 2004) s&#8217;int&#233;ressent &#224; l&#8217;identification
des sources directes (l&#8217;auteur), tandis que (Choi et al., 2005) ne distinguent pas les deux.
</p>
<p>En ce qui concerne nos travaux futurs sur l&#8217;analyse de citations, nous projetons de ne pas nous
limiter aux entit&#233;s nomm&#233;s et de consid&#233;rer aussi les pronoms personnels comme expression
locuteur candidate. Nous pourrons par exemple suivre les travaux de (Stoyanov &amp; Cardie, 2006)
pour utiliser des m&#233;thodes de r&#233;solution d&#8217;anaphores appliqu&#233;es &#224; des cas d&#8217;attribution. Par
ailleurs, nous souhaitons &#233;valuer le recoupement entre les expressions que nous extrayons et
celles annot&#233;es soit par la mesure WindowDiff soit par une technique propos&#233;e par (Choi et al.,
2005). Enfin, nous chercherons &#224; adapter nos techniques afin d&#8217;&#234;tre &#224; m&#234;me de pouvoir traiter
des corpus de presse anglophones.
</p>
<p>Remerciements
Nous remercions Annie Tartier et les relecteurs pour leurs conseils &#233;clair&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fabien Poulard Thierry Waszak Nicolas Hernandez Patrice Bellot
</p>
<p>R&#233;f&#233;rences
</p>
<p>BETHARD S., YU H., THORNTON A., HATZIVASSILOGLOU V. &amp; JURAFSKY D. (2004).
Automatic extraction of opinion propositions and their holders. In AAAI Spring Symposium
on Exploring Attitude and Affect in Text : Theories and Applications.
</p>
<p>CHOI Y., CARDIE C., RILOFF E. &amp; PATWARDHAN S. (2005). Identifying sources of opinions
with conditional random fields and extraction patterns. In HLT - EMNLP, Vancouver, Canada.
</p>
<p>DAVE K., LAWRENCE S. &amp; PENNOCK D. M. (2003). Mining the peanut gallery : Opinion
extraction and semantic classification of product reviews. In Twelfth International World Wide
Web Conference (WWW&#8217;03).
</p>
<p>FOUROUR N. (2004). Identification et cat&#233;gorisation des entit&#233;s nomm&#233;es dans les textes
fran&#231;ais. PhD thesis, Universit&#233; de Nantes.
</p>
<p>GIGUET E. &amp; LUCAS N. (2004). La d&#233;tection automatique des citations et des locuteurs dans
les textes informatifs. In (L&#243;pez-Mu&#241;oz et al., 2004), p. 410&#8211;418.
</p>
<p>HIRSCH J. E. (2005). An index to quantify an individual&#8217;s scientific research output. In
Proceedings of the National Academy of Sciences, volume 102, p. 16569&#8211;16572.
</p>
<p>JACKIEWICZ A. (2006). Relations intersubjectives dans les discours rapport&#233;s. Journal TAL,
47(2), 65&#8211;87.
J.-M. L&#211;PEZ-MU&#209;OZ, S. MARNETTE &amp; L. ROSIER, Eds. (2004). Le discours rapport&#233; dans
tous ses &#233;tats : question de fronti&#233;res, Paris. L&#8217;Harmattan.
</p>
<p>MOURAD G. &amp; DESCL&#201;S J.-P. (2004). Identification et extraction automatique des informa-
tions citationnelles dans un texte. In (L&#243;pez-Mu&#241;oz et al., 2004).
</p>
<p>PEVZNER L. &amp; HEARST M. (2002). A critique and improvement of an evaluation metric for
text segmentation. Computational Linguistics.
</p>
<p>POULARD F. (2008). Analyse quantitative et qualitative de citations extraites d&#8217;un corpus
journalistique. In RECITAL&#8217;08 (&#192; para&#238;tre), Avignon.
</p>
<p>PRASAD R., DINESH N., LEE A., JOSHI A. &amp; WEBBER B. (2006). Attribution and its
annotation in the penn discourse treebank. Journal TAL, 47(2), 43&#8211;64.
RITCHIE A., TEUFEL S. &amp; ROBERTSON S. (2006). How to find better index terms through
citations. In &quot;Can Computational Linguistics Improve Information Retrieval ?&quot; Workshop at
ACL/COLING, Sydney, Australia.
</p>
<p>SOMASUNDARAN S., WILSON T., WIEBE J. &amp; STOYANOV V. (2007). Qa with attitude :
Exploiting opinion type analysis for improving question answering in on-line discussions and
the news. In International Conference on Weblogs and Social Media (ICWSM&#8217;07).
</p>
<p>STOYANOV V. &amp; CARDIE C. (2006). Toward opinion summarization : Linking the sources.
In COLING-ACL 2006 Workshop on Sentiment and Subjectivity in Text.
</p>
<p>TEUFEL S., SIDDHARTHAN A. &amp; TIDHAR D. (2006). Automatic classification of citation
function. In EMNLP, Sydney, Australia.
</p>
<p>WILSON T., HOFFMANN P., SOMASUNDARAN S., KESSLER J., JANYCEWIEBE, CHOI Y.,
CARDIE C., RILOFF E. &amp; PATWARDHAN S. (2005). Opinionfinder : A system for subjectivity
analysis. In HLT - EMNLP, Vancouver, Canada.
</p>
<p>WITTEN I. H. &amp; FRANK E. (2005). In Data Mining : Practical machine learning tools and
techniques. Morgan Kaufmann, 2nd edition edition.</p>

</div></div>
</body></html>