<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction automatique d'informations &#224; partir de micro-textes non structur&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008
</p>
<p>Extraction automatique d'informations 
&#224; partir de micro-textes non structur&#233;s
</p>
<p>C&#233;dric Vidrequin1, Juan-Manuel Torres-Moreno1, 
Jean-Jacques Schneider2, Marc El-B&#232;ze1
</p>
<p>(1) Laboratoire Informatique d'Avignon, Agroparc 
BP1228, 84911 Avignon CEDEX 9, France
</p>
<p>{cedric.vidrequin,  marc.elbeze,  juan-manuel.torres} @univ-avignon.fr  
(2) Soci&#233;t&#233; SEMANTIA, Parc d'activit&#233; de G&#233;menos,
</p>
<p>30 avenue du ch&#226;teau de Jouques, 13420 G&#233;menos, France
jjschneider@semantia.com 
</p>
<p>R&#233;sum&#233;  Nous  pr&#233;sentons  dans  cet  article  une  m&#233;thode  d'extraction  automatique 
d'informations sur des textes de tr&#232;s petite taille, faiblement structur&#233;s. Nous travaillons sur 
des textes dont la r&#233;daction n'est  pas normalis&#233;e,  avec tr&#232;s peu de mots pour caract&#233;riser 
chaque information.  Les textes ne contiennent pas ou tr&#232;s peu de phrases. Il s'agit le plus 
souvent  de  morceaux  de  phrases  ou  d'expressions  compos&#233;es  de  quelques  mots.  Nous 
comparons  plusieurs  m&#233;thodes  d'extraction,  dont  certaines  sont  enti&#232;rement  automatiques. 
D'autres  utilisent  en  partie  une  connaissance  du  domaine  que  nous  voulons  r&#233;duite  au 
minimum,  de  fa&#231;on &#224;  minimiser  le  travail  manuel  en  amont.  Enfin,  nous  pr&#233;sentons  nos 
r&#233;sultats qui d&#233;passent ce dont il est fait &#233;tat dans la litt&#233;rature, avec une pr&#233;cision &#233;quivalente 
et un rappel sup&#233;rieur. 
</p>
<p>Abstract In this article, we present a method of automatic extraction of informations on 
very  small-sized  and  weakly  structured  texts.  We  work  on  texts  whose  drafting  is  not 
normalised,  with very few words to characterize each information.  Texts does not contain 
sentences, or only few. There are mostly about fragments of sentences or about expressions of 
some words. We compare several extracting methods, some completely automatic and others 
using an small domain knowledge. We want this knowledge to be minimalistic to reduce as 
much as possible any manual work. Then, we present our results, witch are better than those 
published in the literature, with an equivalent precision and a greater recall.
</p>
<p>Mots-cl&#233;s extraction automatique, micro-texte, texte non structur&#233;, petites annonces.
Keywords automatique extraction, micro-text, unstructured text, adds.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Vidrequin, Juan-Manuel Torres-Moreno, Jean-Jacques Schneider, Marc El-B&#232;ze
</p>
<p>1 Introduction
L'extraction  automatique  d'informations  sur  des  textes  de  petite  taille  peut  se  r&#233;v&#233;ler 
relativement simple ou tr&#232;s compliqu&#233;e, selon les caract&#233;ristiques des documents trait&#233;s et le 
type  d'informations  cherch&#233;es.  Le  domaine  des  petites  annonces  est  souvent  utilis&#233;  pour 
exp&#233;rimenter ce type d'extraction automatique car on peut travailler sur des petits, des tr&#232;s 
petits  voire des micro-textes.  De plus, on y rencontre &#224; la fois des donn&#233;es sp&#233;cifiques &#224; 
chaque annonce, et des donn&#233;es communes li&#233;es au domaine. Deux approches sont utilis&#233;es 
pour  r&#233;diger  une  petite  annonce  :  la  saisie  de  texte  libre  ou la  saisie  par  formulaire.  La 
premi&#232;re permet au vendeur de d&#233;crire son bien aussi pr&#233;cis&#233;ment qu'il le d&#233;sire. La seconde 
accorde plus de facilit&#233; &#224; l'acheteur lors de sa recherche, en proposant de filtrer les annonces 
par crit&#232;res (marque, prix, garantie ...). Si la saisie par formulaire pr&#233;voit assez souvent une 
zone de description libre, celle-ci n'est, en g&#233;n&#233;ral, pas trait&#233;e lors de la recherche par crit&#232;re. 
On souhaiterait donc concilier la libert&#233; apport&#233;e par la saisie en texte libre, et la simplicit&#233; de 
la  recherche  par  crit&#232;res.  C'est  dans  cette  optique  que  nous  d&#233;veloppons  une  m&#233;thode 
d'extraction  automatique  d'informations,  &#224;  partir  de  petites  annonces.  Les  m&#233;thodes 
employ&#233;es  dans  la  litt&#233;rature  sont  en  g&#233;n&#233;ral  satisfaisantes,  mais  ne  font  &#233;tat  que  de 
l'extraction d'une partie des informations. C'est pourquoi nous souhaitons d&#233;velopper un outil 
capable de d&#233;tecter le plus de crit&#232;res possibles, avec un taux d'erreur minimal. 
</p>
<p>En section 2, nous recensons les m&#233;thodes existantes dont nous nous sommes inspir&#233;s. Dans 
la section 3, est d&#233;crite la m&#233;thode que nous proposons. Enfin, nous rapportons, en section 4, 
les r&#233;sultats que nous obtenons avec notre syst&#232;me. Nous concluons en section 5 et donnons 
les perspectives que nous envisageons l'avenir.
</p>
<p>2 M&#233;thodes  pour  l'extraction  d'informations  dans  des  petites 
annonces
</p>
<p>Une  des  approches  utilis&#233;es  pour  extraire  automatiquement  des  informations  &#224;  partir  de 
petites annonces est de r&#233;aliser un adaptateur (wrapper). Celui-ci parcourt le document et en 
extrait une carte hi&#233;rarchique des donn&#233;es. Cette m&#233;thode a besoin de documents structur&#233;s 
ou semi structur&#233;s, comme des documents HTML, et implique le plus souvent la r&#233;daction 
manuelle  de r&#232;gles d'extraction pour chaque crit&#232;re.  (Gao et  Sterling,  1999) extraient  des 
informations &#224; partir de sites web h&#233;t&#233;rog&#232;nes en suivant deux &#233;tapes successives. Ils mettent 
tout d'abord en &#233;vidence les crit&#232;res caract&#233;risant chaque objet de l'annonce, puis ils groupent 
les connaissances en concepts hi&#233;rarchiques. La premi&#232;re &#233;tape est proche du probl&#232;me qui 
nous int&#233;resse : les crit&#232;res recherch&#233;s sont par exemple le prix, la superficie ou le type d'un 
bien immobilier. Ceux-ci sont mis en &#233;vidence gr&#226;ce &#224; des fonctions d'extraction adapt&#233;es, 
r&#233;alis&#233;es de fa&#231;on manuelle, en utilisant des listes de termes et des expressions r&#233;guli&#232;res. Les 
listes peuvent caract&#233;riser par exemple les marques et les mod&#232;les de v&#233;hicule automobile. 
Les expressions r&#233;guli&#232;res, quant &#224; elles, peuvent mod&#233;liser des informations comme le prix 
ou la surface d'une habitation. La d&#233;tection des crit&#232;res se fait &#224; l'aide d'une liste de pr&#233;dicats 
de priorit&#233; entre concepts et balisage HTML. 
</p>
<p>De la m&#234;me fa&#231;on, (Seo  et al., 2001) mettent en &#233;vidence des paires [&#233;tiquette, valeur] en 
utilisant des connaissances du domaine de l'immobilier. Ces connaissances, mod&#233;lis&#233;es dans 
un fichier XML, repr&#233;sentent les diff&#233;rentes fa&#231;on de formuler chaque crit&#232;re : &#224; un m&#234;me 
niveau  de  l'arbre  XML se  trouvent  les  diff&#233;rentes  formulations  pour  la  valeur  du  crit&#232;re 
concern&#233;. Cette repr&#233;sentation constitue une alternative &#224; l'utilisation d'expressions r&#233;guli&#232;res. 
Les paires d&#233;tect&#233;es peuvent avoir diff&#233;rentes formes : $395 000 ou 5 BR ou encore 2 BA. Ces </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique d'informations &#224; partir de micro-textes non structur&#233;s
</p>
<p>paires correspondent au crit&#232;re prix qui a pour valeur 395 000, au crit&#232;re nombre de chambres 
qui a pour valeur 5, ou au crit&#232;re nombre de salles de bain qui a pour valeur 2. 
</p>
<p>Notre  fa&#231;on  d'aborder  la  probl&#233;matique  est  diff&#233;rente  de  l'approche  des  auteurs.  Ceux-ci 
s'attachent plus &#224; r&#233;aliser une segmentation des pages Web en annonces, qu'&#224; un d&#233;coupage 
d'annonces.  D'autre  part,  les  crit&#232;res  extraits  sont  tr&#232;s  limit&#233;s,  et  ne  repr&#233;sentent  pas 
l'ensemble de l'annonce. Ce nombre n'est d'ailleurs pas donn&#233;, mais les exemples illustrant 
leurs r&#233;sultats en comportent moins de dix pour chaque type d'annonce. L'&#233;valuation de leur 
performance porte uniquement sur les crit&#232;res qu'ils visent &#224; d&#233;tecter.
</p>
<p>(Embley et al., 1998) r&#233;alisent une extraction semblable &#224; celle de (Seo et al., 2001), sur des 
textes non structur&#233;s, en s'appuyant sur une ontologie. Cette ontologie est obtenue &#224; partir 
d'un mod&#232;le s&#233;mantique de donn&#233;es et a pour but de d&#233;crire la vue d&#233;sir&#233;e du domaine retenu. 
Les auteurs appliquent un parseur, un outil de reconnaissance de constantes et mots cl&#233;s, puis 
un g&#233;n&#233;rateur  de texte  structur&#233; sur le texte  non structur&#233;.  Des couples [cl&#233;,  valeur]  sont 
g&#233;n&#233;r&#233;s, en respectant les contraintes et les r&#232;gles de l'ontologie. Cette m&#233;thode n'a pas pour 
pr&#233;tention  de fonctionner  sur  tout  type de documents,  mais  vise les  documents  riches  en 
donn&#233;es constantes - dates, noms, identifiants, quantit&#233;s - ou dont le domaine d'application est 
d&#233;crit par une partie d'ontologie restreinte. C'est &#224; partir de l'ontologie que sont g&#233;n&#233;r&#233;es les 
expressions r&#233;guli&#232;res qui sont utilis&#233;es par l'outil de reconnaissance de paires [cl&#233;, valeur], 
pour extraire les crit&#232;res.  Le moteur de g&#233;n&#233;ration de texte structur&#233; est ensuite appliqu&#233;, 
suivant une liste d'heuristiques pr&#233;d&#233;finies. (Embley et al., 1998) &#233;valuent leur syst&#232;me sur un 
ensemble de 216 annonces automobiles et 100 annonces d'offres d'emploi. Tout comme (Gao 
et  Sterling,  1999),  ils  n'extraient  pas  la  totalit&#233;  des  crit&#232;res  des  annonces.  Cette  fois,  la 
limitation vient des contraintes impos&#233;es par l'ontologie. Par exemple, le num&#233;ro de t&#233;l&#233;phone 
des  annonces  automobiles  n'accepte  qu'une  seule  valeur,  m&#234;me si  l'annonce  en  comporte 
plusieurs. Les calculs de rappel et de pr&#233;cision sont effectu&#233;s sur la base d'une r&#233;ponse unique 
et non sur l'ensemble des informations contenues dans l'annonce, et seuls les crit&#232;res d&#233;finis 
par l'ontologie sont pris en compte. Nous nous diff&#233;rencions des auteurs sur ce point, comme 
nous le verrons en section 4.
</p>
<p>(Peleato et al., 2000) &#233;tiquettent des donn&#233;es &#224; partir de lexiques, d'expressions r&#233;guli&#232;res et 
d'analyses de position des mots. Les &#233;tiquettes correspondent au nom des crit&#232;res, les donn&#233;es 
&#224; leur valeur. Les expressions et noms sont tout d'abord d&#233;tect&#233;s gr&#226;ce &#224; des lexiques, &#233;tablis 
&#224; partir d'une &#233;tude de fr&#233;quence d'apparition des mots, dans un corpus de 10 000 annonces. 
On rencontre dans ces listes des termes tels &quot;camion&quot;,  &quot;airbag&quot;, ou encore  &quot;libre de suite&quot;. 
Des listes publiques, obtenues sur le Web, sont utilis&#233;es pour d&#233;tecter certaines informations 
comme  les  noms  de  villes  ou  de  pays,  ainsi  que  les  abr&#233;viations.  Un  jeu  d'expressions 
r&#233;guli&#232;res  est  ensuite  appliqu&#233;  pour  les  informations  telles  que  les  dates,  les  prix  ou  les 
num&#233;ros de t&#233;l&#233;phone.  Ce jeux d'expressions  a &#233;t&#233;  enrichi  manuellement  &#224;  partir  de tests 
bas&#233;s sur un corpus d'entra&#238;nement. Un second processus a pour but d'identifier la nature des 
informations  restantes,  &#224;  partir  de  l'annonce  partiellement  &#233;tiquet&#233;e.  Cette  derni&#232;re  est 
segment&#233;e suivant la ponctuation, et des pr&#233;positions dans le cas d'annonces d'offre d'emploi. 
Les mots mis en &#233;vidence sont compar&#233;s &#224; des listes de mots cl&#233;s d&#233;crivant chaque crit&#232;re. 
Ces listes ont  &#233;t&#233; constitu&#233;es manuellement, suite &#224; l'&#233;tude pr&#233;c&#233;demment cit&#233;e. La diff&#233;rence 
entre ces listes et les lexiques est que ces listes ne d&#233;finissent pas une information pr&#233;cise, 
mais plut&#244;t la cat&#233;gorie d'information concern&#233;e. Par exemple,  &quot;climatisation&quot; ou  &quot;alarme&quot; 
appartiennent &#224; la cat&#233;gorie &quot;options&quot; ; &quot;spacieux&quot; ou &quot;charmant&quot; appartiennent &#224; la cat&#233;gorie 
&quot;qualit&#233;&quot;. L'&#233;tiquetage du segment se fait en fonction de la liste &#224; laquelle correspondent le 
plus de mots du segment. Les positions relatives des mots sont utilis&#233;es pour &#233;tiqueter les 
segments qui n'ont pu l'&#234;tre jusque-l&#224;. Ainsi, un segment est rattach&#233; &#224; celui qui le pr&#233;c&#232;de 
directement,  suivant un jeu pr&#233;d&#233;fini de r&#232;gles.  Par exemple, un mot non &#233;tiquet&#233; suivant 
directement la marque d'un v&#233;hicule est &#233;tiquet&#233; comme mod&#232;le. L'&#233;tude pr&#233;c&#233;dente montre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Vidrequin, Juan-Manuel Torres-Moreno, Jean-Jacques Schneider, Marc El-B&#232;ze
</p>
<p>en effet que le mod&#232;le d'un v&#233;hicule suit le plus souvent la marque. Les segments restants 
sont  &#233;tiquet&#233;s  ind&#233;finis.  Le  syst&#232;me  est  &#233;valu&#233;  sur  77  annonces  dont  6  portent  sur 
l'automobile, 30 sur les offres d'emploi et 41 sur l'immobilier. Ces annonces sont annot&#233;es 
manuellement par plusieurs personnes, les r&#233;sultats donnant lieu &#224; une mesure de kappa (1). 
</p>
<p>(1) 
P(A) est  la  proportion  de  correcteurs  proposant  la  m&#234;me &#233;tiquette,  et  P(E)  la  proportion 
d'accord al&#233;atoire (cas o&#249; l'on met les &#233;tiquettes au hasard). Les auteurs obtiennent un kappa 
k=0,9, ce qui est au dessus du taux k=0,8, consid&#233;r&#233; comme tr&#232;s acceptable. Une fois de plus, 
tous les crit&#232;res des annonces ne sont pas pris en compte lors de l'&#233;valuation. Lorsque les 
correcteurs ne sont pas d'accord, le crit&#232;re est consid&#233;r&#233; comme neutre et ne fait pas partie de 
l'&#233;valuation. Si un crit&#232;re n'est relev&#233; ni par les correcteurs, ni par le syst&#232;me, il est &#233;galement 
ignor&#233;. Sur l'ensemble de test, 519 crit&#232;res sont pris en compte sur 1 415 crit&#232;res. Pour les 
crit&#232;res &#233;valu&#233;s, si les correcteurs et le syst&#232;me s'accordent sur la d&#233;tection du crit&#232;re, celui-ci 
est  compt&#233;  comme  correct,  sinon  il  est  compt&#233;  comme  incorrect.  Seule  la  pr&#233;cision  est 
&#233;valu&#233;e, en comparant manuellement les r&#233;ponses des correcteurs et celles du syst&#232;me. 
</p>
<p>3 Extraction automatique par le contenu
Nous parlons ici d'extraction plut&#244;t que de rep&#233;rage, car cette derni&#232;re notion laisse sous-
entendre un chevauchement possible entre les crit&#232;res. La soci&#233;t&#233; SEMANTIA nous fourni un 
corpus  de  83  749 petites  annonces,  longues  en  moyenne  de 35  termes,  et  dont  voici  un 
exemple  :  &quot;206  1.6  16V ROLLAND GARROS 5  Portes  VERT FONCE 24692  Km 2004  
Essence Alarme Garantie 12 mois 12900&#8364;&quot;. Notre objectif est d'utiliser le moins possible de 
connaissances du domaine. Nous  s&#233;parons pour cela les informations entre informations &#224; 
valeur variable et informations &#224; caract&#232;re bool&#233;en. 
</p>
<p>3.1 Les crit&#232;res &#224; valeur variable
</p>
<p>Le premier  type de crit&#232;res  correspond &#224; ceux dont  la valeur  peut  fortement  varier  d'une 
annonce &#224; l'autre, et pour lesquels on ne peut pas op&#233;rer de d&#233;tection automatique efficace. En 
effet,  on  peut  consid&#233;rer  que  la  valeur  de  ces  crit&#232;res  est  presque  unique  pour  chaque 
annonce. C'est le cas pour des informations comme un prix, une date ou une marque. Nous 
utilisons donc notre connaissance du domaine pour extraire ces crit&#232;res, ce qui n&#233;cessite un 
certain  travail  manuel,  en amont  de l'extraction.  Tout  comme (Gao et  Sterling,  1999)  ou 
(Peleato  et  al.,  2000),  nous  utilisons  des  listes  pour  mettre  en  &#233;vidence  une  partie  des 
informations. En revanche, notre objectif &#233;tant d'avoir la plus petite contribution manuelle en 
amorce, nous en limitons fortement l'utilisation. Nous n'utilisons donc qu'une liste ferm&#233;e de 
valeurs et une liste d'expressions r&#233;guli&#232;res. La premi&#232;re est obtenue sur Internet1, et contient 
uniquement  les  marques  et  les mod&#232;les  des v&#233;hicules.  Pour les  autres  informations,  nous 
fabriquons  manuellement  une  courte  liste  d'expressions  r&#233;guli&#232;res  simples,  mod&#233;lisant 
chacune  des  informations  recherch&#233;es.  Par  exemple,  le  nombre  de  portes  est  extrait  par 
l'expression suivante : &quot;([1-7][ ]*[Pp](or|OR)?(te[s]?|TE[S]?))&quot;. Contrairement &#224; (Embley 
et al.,1998) qui utilisent 165 expressions r&#233;guli&#232;res pour l'automobile, notre liste contient une 
15&#232;ne d'expressions r&#233;guli&#232;res. Ces derni&#232;res permettent d'extraire des crit&#232;res comme le prix 
du v&#233;hicule, le nombre de portes, le mill&#233;sime ou encore le kilom&#233;trage. &#192; la diff&#233;rence de 
l'&#233;tude de fr&#233;quence de (Peleato  et al., 2000), dont la mise en place a dur&#233; 45 jours, notre 
amorce manuelle peut &#234;tre r&#233;alis&#233;e en moins d'une journ&#233;e, et peut &#234;tre, si besoin, rapidement 
adapt&#233;e en fonction des r&#233;sultats obtenus. 
1 http://fr.wikipedia.org/wiki/Constructeur_automobile et liens sous-jacents</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique d'informations &#224; partir de micro-textes non structur&#233;s
</p>
<p>Un seul groupe d'informations s'est r&#233;v&#233;l&#233; &#224; l'usage trop compliqu&#233; &#224; extraire : il s'agit des 
informations  puissance-motorisation-cylindr&#233;e.  En effet,  dans la  plupart  des annonces,  on 
constate que ces crit&#232;res ne sont pas n&#233;cessairement regroup&#233;s et ordonn&#233;s. Les informations 
peuvent &#234;tre port&#233;es diff&#233;remment d'une annonce l'autre, par un ou plusieurs mots. Certaines 
informations peuvent &#234;tre absentes et les valeurs de ces crit&#232;res sont suffisamment variables 
pour emp&#234;cher une d&#233;tection automatique efficace.  Les combinaisons de ces informations 
sont  nombreuses,  et  si  elles sont port&#233;es  par un mot unique,  il  est  alors  peu probable de 
pouvoir  les mettre  en &#233;vidence de fa&#231;on totalement  automatique,  tout en garantissant  une 
extraction suffisamment fine. Pour ces raisons, le traitement de ces informations fait l'objet 
d'une m&#233;thode d'extraction automatique sp&#233;cifique, comme l'ont fait (Gao et Sterling, 1999). 
Cette m&#233;thode combine un jeu de quatre expressions r&#233;guli&#232;res : la premi&#232;re, la plus g&#233;n&#233;rale, 
permet d'extraire le groupe de crit&#232;res de l'annonce, comme par exemple &quot;1.5DCI 70CV&quot;. Les 
trois  autres,  plus  sp&#233;cialis&#233;es  extraient  chacun  des  trois  crit&#232;res  individuellement  :  la 
puissance (70CV), la motorisation (DCI) et la cylindr&#233;e (1.5). 
</p>
<p>3.2 Les crit&#232;res &#224; caract&#232;re bool&#233;en
</p>
<p>Une fois les crit&#232;res &#224; valeur variable extraits, nous consid&#233;rons que les informations restantes 
font partie  du groupe des crit&#232;res &#224; caract&#232;re bool&#233;en.  Pour les extraire  automatiquement, 
nous tirons parti de la taille de notre corpus. Les sections suivantes  d&#233;crivent deux m&#233;thodes 
d'extraction  qui ne n&#233;cessitent pas ou tr&#232;s peu d'apport manuel.
</p>
<p>3.2.1 D&#233;coupage suivant la ponctuation
</p>
<p>Nous d&#233;finissons ici une liste ferm&#233;e de s&#233;parateurs [,-./;] suivant lesquels on d&#233;coupe tour &#224; 
tour les annonces. On obtient ainsi plusieurs d&#233;coupages possibles diff&#233;rents. Les crit&#232;res &#224; 
valeur variable d&#233;j&#224; extraits sont remplac&#233;s par le s&#233;parateur courant, ce qui donne un pr&#233;-
d&#233;coupage fiable. Le texte restant est d&#233;coup&#233; en fonction du m&#234;me s&#233;parateur, afin de mettre 
en &#233;vidence les crit&#232;res potentiels. On trie les crit&#232;res des diff&#233;rents d&#233;coupages, de fa&#231;on 
d&#233;croissante, et en fonction de leur nombre d'occurrences sur l'ensemble des annonces. De la 
liste obtenue, on &#233;limine les crit&#232;res automatiquement d&#233;tect&#233;s qui sont trop courts ou trop 
longs. Nous gardons arbitrairement les crit&#232;res longs de plus de trois lettres et comprenant au 
maximum sept mots. Ces valeurs ont &#233;t&#233; d&#233;finies en observant le comportement du syst&#232;me 
durant  la  phase  de  d&#233;veloppement.  On  &#233;limine  &#233;galement  les  crit&#232;res  qui  contiennent 
plusieurs  fois  le  m&#234;me s&#233;parateur,  en partant  du principe  qu'il  s'agit  potentiellement  d'un 
mauvais  d&#233;coupage.  En effet,  certaines  annonces  utilisent  un type  de  s&#233;parateur,  puis  en 
changent en cours d'annonce. L'extraction automatique des crit&#232;res se fait sur base de la liste 
ainsi mise en &#233;vidence.
</p>
<p>Pour chaque annonce, on parcourt la liste des crit&#232;res automatiquement mis en &#233;vidence. Si le 
crit&#232;re est pr&#233;sent, on l'extrait de l'annonce et on passe au suivant, sinon on passe directement 
au crit&#232;re suivant. Le traitement de l'annonce est termin&#233; une fois que la liste des crit&#232;res est 
enti&#232;rement parcourue. Si cette m&#233;thode a l'avantage de donner de tr&#232;s bons r&#233;sultats en terme 
de pr&#233;cision, elle a aussi des inconv&#233;nients. Elle est limit&#233;e en rappel dans la mesure o&#249; elle 
ne cherche pas &#224; extraire tous les crit&#232;res des annonces, mais seulement ceux que la m&#233;thode 
a retenus. Ensuite, certains crit&#232;res sont impossibles &#224; extraire comme c'est le cas des crit&#232;res 
contenant  plusieurs  ponctuations2.  Enfin,  les  crit&#232;res  de  plus  de  sept  mots,  comme  par 
exemple &quot;livraison partout en France comprise dans le prix&quot;, ne peuvent &#234;tre extraits. 
</p>
<p>2
 &quot;Banquette arri&#232;re 2/3 - 1/3&quot; ou &quot;r&#233;troviseurs &#233;lectr. - d&#233;givr. &amp;ab&quot;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Vidrequin, Juan-Manuel Torres-Moreno, Jean-Jacques Schneider, Marc El-B&#232;ze
</p>
<p>3.2.2 D&#233;coupage avec les collocations
</p>
<p>Nous d&#233;sirons &#224; pr&#233;sent augmenter le rappel en essayant d'extraire l'ensemble des crit&#232;res de 
chaque annonce. Nous souhaitons &#233;galement utiliser  une m&#233;thode qui soit  moins li&#233;e aux 
caract&#232;res  de  ponctuation,  puisque  ces  derniers  peuvent  se  trouver  dans  l'expression  de 
certains crit&#232;res. Afin de mettre en &#233;vidence des groupes de mots ayant un sens particulier 
lorsqu'ils  se  suivent,  nous  avons  d&#233;velopp&#233;  une  m&#233;thode  d'extraction  s'appuyant  sur  les 
collocations et utilisant un filtrage bas&#233; sur les ratios de vraisemblance. 
</p>
<p>Une collocation (Manning et Sch&#252;tze, 1999) est une tournure de phrase pour laquelle le tout 
est per&#231;u pour avoir un sens au-del&#224; de la somme des parties. Les collocations comprennent 
les groupes nominaux, les groupes verbaux ou encore les locutions. Enfin, tout type de groupe 
de mots fr&#233;quemment  r&#233;p&#233;t&#233;  est  candidat  au statut de collocation.  Les collocations  ont  la 
double particularit&#233;  que les termes qui la composent  apparaissent  fr&#233;quemment ensemble, 
tout en pouvant avoir une existence ind&#233;pendante. 
</p>
<p>Les ratios de vraisemblance sont une approche par test d'hypoth&#232;se. Ils sont appropri&#233;s pour 
des  donn&#233;es  &#233;parses  et  sont  faciles  &#224;  interpr&#233;ter,  gr&#226;ce  &#224;  un  nombre  qui  exprime  la 
vraisemblance  entre  les  hypoth&#232;ses  test&#233;es.  Les  hypoth&#232;ses  H0 et  H1 consid&#232;rent 
respectivement l'ind&#233;pendance et la d&#233;pendance entre deux mots. Le ratio de vraisemblance 
correspond &#224; la probabilit&#233; de r&#233;unir les deux conditions de l'hypoth&#232;se. Pour comparer les 
collocations potentielles, le logarithme de vraisemblance est utilis&#233;. Celui-ci a l'avantage de 
mettre  en &#233;vidence  les  collocations  dont  les  occurrences  sont  rares.  La variable  al&#233;atoire 
utilis&#233;e est asymptotique3 &#224; une distribution de type &#967;&#178; et peut &#234;tre utilis&#233;e pour r&#233;aliser des 
tests  d'hypoth&#232;se.  Ainsi,  en utilisant  les  tables  de valeurs  de r&#233;f&#233;rence  d'une  &#967;&#178;,  on peut 
valider ou refuser une hypoth&#232;se, en associant un score de confiance &#224; la d&#233;cision prise. 
</p>
<p>La mise en &#233;vidence des crit&#232;res se fait de fa&#231;on it&#233;rative en utilisant le corpus d'annonces. 
Lors de la premi&#232;re it&#233;ration, des couples de termes sont construits &#224; partir de mots, tandis 
que pour les it&#233;rations suivantes, les termes peuvent &#234;tre encore des mots ou des groupements 
de mots. Nous recensons le nombre d'occurrences de chaque couple de termes, ainsi que celui 
des  termes  pris  s&#233;par&#233;ment.  &#192;  partir  de  ces  informations,  nous  calculons  le  ratio  de 
vraisemblance des couples de termes et nous les classons par ordre d&#233;croissant. Le corpus 
&#233;tant  suffisamment  grand,  nous  approximons  la  variable  al&#233;atoire  qui  d&#233;finit  le  ratio  de 
vraisemblance par une distribution  &#967;&#178;.  Puisque nous travaillons &#224; chaque it&#233;ration sur des 
couples de termes, le degr&#233; de libert&#233; est de un. Nous d&#233;cidons de tol&#233;rer un taux d'erreur de 
0,001, ce qui nous am&#232;ne &#224; supprimer tous les couples dont le score est inf&#233;rieur4 &#224; 10,83. 
Nous supprimons les couples pour lesquels le premier terme se termine par une ponctuation, 
ou  pour  lesquels  le  second  terme  commence  par  une  ponctuation5,  mod&#233;lisant  par  l&#224;  un 
mauvais d&#233;coupage potentiel de l'annonce. Nous avons exp&#233;riment&#233; diff&#233;rents ensembles de 
ponctuations concern&#233;es, y compris l'ensemble vide (section 4.2). Les couples conserv&#233;s dans 
la liste sont regroup&#233;s en une seule entit&#233; et repr&#233;sentent les crit&#232;res potentiels. 
</p>
<p>Des crit&#232;res pouvant se chevaucher, il est important de r&#233;aliser les choix qui favorisent le 
d&#233;coupage  optimal.  L'annonce  &quot;(...)10000  km  hifi  syst&#232;me  alarme  garantie  or  ESP  (...)&quot; 
pr&#233;sente une ambigu&#239;t&#233;  forte  pouvant  amener aux d&#233;coupages  suivants  :  [10000 km, hifi, 
syst&#232;me alarme, garantie or, ESP] ou [10000 km, hifi syst&#232;me, alarme garantie, or, ESP]. 
Nous  d&#233;veloppons  donc  une  m&#233;thode  inspir&#233;e  de  l'algorithme  de  Viterbi  (Viterbi  1967) 
projet&#233; sur une seule dimension. Parmi les d&#233;coupages possibles, cette m&#233;thode cherche un 
maximum  global  de  la  somme  des  ratios  de  vraisemblance  correspondant  aux  crit&#232;res 
3 Quand le corpus est suffisamment grand.
4 Tir&#233;e des tables des distributions &#178;&#967;
5 Exemple : &quot;(...) Immobiliseur,  Vitres  &#233;lectriques  ,Volant  multifonctions.  Garantie.  (...)&quot;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique d'informations &#224; partir de micro-textes non structur&#233;s
</p>
<p>d&#233;coup&#233;s. Soient n le nombre de mots du plus long crit&#232;re, m le nombre de mots de l'annonce 
trait&#233;e,  S un tableau de  m cases qui fait correspondre les mots de la phrase et le score du 
meilleur  d&#233;coupage  de  l'annonce  jusqu'&#224;  ce  mot,  et  I un  tableau  de  m cases  qui  fait 
correspondre &#224; chaque mot l'indice du d&#233;but du crit&#232;re correspondant au meilleur d&#233;coupage. 
Nous faisons glisser une fen&#234;tre de mots sur le texte de l'annonce, en commen&#231;ant  par le 
premier mot et en allant vers le dernier. &#192; chaque d&#233;calage, nous prenons une fen&#234;tre de n 
mots que nous diminuons progressivement d'un mot, jusqu'&#224; arriver au singleton. Pour chaque 
groupe de mots de la fen&#234;tre, si le n-gramme est pr&#233;sent dans la liste de crit&#232;res propos&#233;s :
</p>
<p>&#8226; dans S : on calcule le score de la case correspondant au dernier mot de la fen&#234;tre : 
&#8226; on  normalise le ratio de vraisemblance du crit&#232;re en le multipliant par le nombre 
</p>
<p>de mots du crit&#232;re. Les ratios ont des valeur positives, sup&#233;rieure &#224; 1. On favorise 
ainsi la pr&#233;sence de crit&#232;res longs, plus difficiles &#224; obtenir que des crit&#232;res courts ;
</p>
<p>&#8226; on ajoute &#224; ce score celui de la case pr&#233;c&#233;dant le premier mot du  n-gramme (et 
correspondant  donc  au  dernier  mot  du  n-gramme  pr&#233;c&#233;dent).  Cela  permet  de 
cumuler les scores des crit&#232;res en fonction du d&#233;coupage ;
</p>
<p>&#8226; dans I : on enregistre l'indice correspondant &#224; la premi&#232;re case de la fen&#234;tre dans la 
case correspondant au dernier mots de la fen&#234;tre. Cela nous permet de remonter par 
la suite du dernier n-gramme vers le premier.
</p>
<p>Un n-gramme peut ne pas appara&#238;tre dans la liste des crit&#232;res, parce qu'il a &#233;t&#233; filtr&#233;, ou parce 
qu'il s'agit d'un mot seul. Nous n'attribuons alors pas de poids suppl&#233;mentaire au n-gramme, et 
propageons simplement celui du d&#233;coupage pr&#233;c&#233;dent. Dans le premier cas, cela permet de 
conserver la possibilit&#233; de d&#233;couper ce crit&#232;re suivant le  n-gramme, si on ne trouve pas de 
meilleur d&#233;coupage en r&#233;duisant ou/et en d&#233;calant la fen&#234;tre de mots. Dans le second cas, la 
notion  de  collocation  n'a  pas  vraiment  de  sens  pour  un  mot  seul,  et  nous  n'avons  pas  &#224; 
disposition de probabilit&#233; associ&#233;e &#224; cet &#233;v&#232;nement. Malgr&#233; cela, la propagation du score sans 
ajout de poids permet de consid&#233;rer le mot seul comme un crit&#232;re potentiel. 
Une fois toutes les fen&#234;tres &#233;valu&#233;es, nous prenons successivement  les maxima de  S pour 
extraire le meilleur n-gramme courant. Une fois un n-gramme extrait, nous supprimons tous 
les scores des mots lui appartenant. Nous r&#233;alisons le d&#233;coupage du dernier crit&#232;re trouv&#233; vers 
le premier. Les annonces d&#233;coup&#233;es servent de base &#224; l'it&#233;ration suivante, o&#249; les termes ne 
sont plus des mots (ou des n-grammes) mais des bi-grammes (ou des n+1 grammes).
</p>
<p>4 Exp&#233;riences
L'&#233;valuation de la performance du syst&#232;me n&#233;cessite une r&#233;f&#233;rence qui doit &#234;tre construite 
manuellement. Ce processus &#233;tant long et fastidieux, seules 200 petites annonces prises au 
hasard sont actuellement v&#233;rifi&#233;es6. Cette &#233;valuation comprend deux &#233;tapes, l'une portant sur 
la m&#233;thode d'extraction par d&#233;coupage en fonction des ponctuations, l'autre sur la m&#233;thode 
des collocations. Nous utilisons les annonces pour lesquelles nous avons relev&#233; manuellement 
l'ensemble des crit&#232;res de chaque annonce. Nous comptabilisons ceux correctement d&#233;tect&#233;s, 
ceux mal d&#233;tect&#233;s et ceux qui ne sont pas d&#233;tect&#233;s. Contrairement &#224; (Peleato  et al., 2000), 
nous &#233;valuons tous les crit&#232;res de chaque annonce. Ainsi, nos mesures de pr&#233;cisions et de 
rappel  sont  calcul&#233;es  sur  un  &#233;ventail  plus  large,  et  sont  donc  soumises  &#224;  de  plus  fortes 
contraintes. Durant cette phase d'&#233;valuation, nous s&#233;parons l'&#233;valuation des crit&#232;res &#224; valeur 
variable de celle des crit&#232;res &#224; caract&#232;re bool&#233;en. Nous conjuguons, dans un second temps, 
ces informations dans une moyenne globale. Cela nous permet de nous situer par rapport aux 
r&#233;sultats de la litt&#233;rature. Les m&#233;thodes utilisent des principes similaires, mais les donn&#233;es des 
6 Nous en pr&#233;parons actuellement 200 suppl&#233;mentaires.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Vidrequin, Juan-Manuel Torres-Moreno, Jean-Jacques Schneider, Marc El-B&#232;ze
</p>
<p>syst&#232;mes sont diff&#233;rentes,  le nombre ainsi que le type de crit&#232;res d&#233;tect&#233;s ne sont pas les 
m&#234;mes. (Peleato et al., 2000) obtiennent 73% de pr&#233;cision en moyenne sur les trois domaines 
test&#233;s7. Ils obtiennent leur meilleure pr&#233;cision pour les annonces automobile avec une valeur 
de 88%. Souvenons nous qu'ici, le rappel n'est pas &#233;valu&#233;.  (Seo  et al., 2001) comparent les 
mots  qu'ils  ont  extraits  aux  concepts  auxquels  ils  correspondent.  Ils  obtiennent  100% de 
pr&#233;cision et 80% de rappel, sur les 4 crit&#232;res qu'ils extraient. (Gao et Sterling, 1999) &#233;valuent 
seulement les crit&#232;res sur lesquels ils travaillent. Ils  pr&#233;sentent des r&#233;sultats allant de 90 &#224; 
99%  pour  la  pr&#233;cision,  et  de  76  &#224;  99%  pour  le  rappel,  suivant  les  pages  web  test&#233;es. 
Rappelons tout de m&#234;me que leurs exp&#233;riences sont bas&#233;es sur des pages semi-structur&#233;es, ce 
qui n'est pas notre cas. (Embley et al., 1998) obtiennent les meilleurs r&#233;sultats en pr&#233;cision-
rappel avec des scores respectif de 99% et 94%. Cependant, dans le cas de valeurs multiples 
pour un crit&#232;re, une seule valeur est prise en compte. 
</p>
<p>Figure 1 : R&#233;sultats des m&#233;thodes propos&#233;es
</p>
<p>4.1 Evaluation du d&#233;coupage suivant les caract&#232;res de ponctuation
</p>
<p>Notre syst&#232;me extrait une quinzaine de crit&#232;res &#224; valeur variable. De plus, il tient compte des 
valeurs multiples pour un crit&#232;re. Ainsi il est p&#233;nalis&#233; s'il manque une valeur pouvant &#234;tre 
extraite par un correcteur humain. Il est, de ce point de vue, jug&#233; plus s&#233;v&#232;rement que ses 
concurrents.  Enfin,  notre  syst&#232;me  n'utilise  que  tr&#232;s  peu  de  connaissances  du  domaine, 
comparativement aux autres syst&#232;mes. Malgr&#233; ces contraintes, nos performances se situent 
dans une bonne moyenne avec une F-mesure de 0,93 (Fig. 1 - valeur variable). 
Mais cette &#233;valuation n'est que partielle : elle ne prend pas en compte l'ensemble des crit&#232;res 
des annonces. Nous la r&#233;alisons uniquement dans le but de nous positionner par rapport aux 
travaux  d&#233;j&#224;  mis  en  &#339;uvre dans  le  domaine.  Pour  les  crit&#232;res  automatiquement  d&#233;tect&#233;s 
(bool&#233;ens 1), nous obtenons une F-mesure de 0,56. Les performances de notre syst&#232;me restent 
donc acceptables, avec une F-mesure globale de 0,75, soient 70,6% de pr&#233;cision et 81,3% de 
rappel  (Global  1).  Cette  &#233;valuation  prend  en  compte  les  crit&#232;res  comportant  des  erreurs 
r&#233;currentes, des fautes d'orthographe ou des abr&#233;viations. 
</p>
<p>4.2 Evaluation du d&#233;coupage bas&#233; sur les collocations
</p>
<p>La premi&#232;re exp&#233;rience que nous avons r&#233;alis&#233;e a pour but d'&#233;tudier l'impact de l'utilisation 
des m&#233;thodes num&#233;riques seules. Nous n'utilisons donc que les crit&#232;res mis en &#233;vidence par 
7 Automobile, immobilier et offres d'emploi</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Extraction automatique d'informations &#224; partir de micro-textes non structur&#233;s
</p>
<p>les collocations, et nous ne r&#233;alisons pas de filtrage sur les caract&#232;res de ponctuation (Global  
2). N'utilisant pas de connaissances du domaine, nous perdons  beaucoup en performance et 
obtenons seulement 0,42 lors du calcul de la F-mesure. De nouveaux crit&#232;res, impossibles &#224; 
d&#233;tecter  avec  la  m&#233;thode  pr&#233;c&#233;dente,  sont  &#224;  pr&#233;sent  extraits.  C'est  notamment  le  cas  de 
&quot;Banquette  arri&#232;re  2/3  -  1/3&quot;.  En revanche,  malgr&#233;  une  grande  variabilit&#233;  de  l'ordre  des 
crit&#232;res, certains d'entre eux apparaissent suffisamment c&#244;te &#224; c&#244;te pour &#234;tre regroup&#233;s. C'est 
le cas par exemple de &quot;vitres &#233;lectriques vitres teint&#233;es&quot;.
</p>
<p>Si l'on filtre les crit&#232;res par rapport &#224; la ponctuation (voir 3.2.2), la F-mesure chute alors &#224; 
0,24 (Global 3). De nombreux mots sont en effet regroup&#233;s de fa&#231;on injustifi&#233;e du point de 
vue du sens. C'est le cas par exemple des mots &quot;&#8364;&quot; et &quot;T&#233;l.&quot; qui sont rapproch&#233;s dans le m&#234;me 
bi-gramme. En effet, nous emp&#234;chons la constitution d'un n-gramme dont l'un des mots est 
suivi  par un caract&#232;re de ponctuation.  On ne peut  donc pas regrouper le mot &quot;T&#233;l.&quot; et  le 
num&#233;ro de t&#233;l&#233;phone qui lui correspond. Ensuite, le num&#233;ro de t&#233;l&#233;phone du contact suit tr&#232;s 
fr&#233;quemment le prix de l'objet de la vente. Le regroupement de ces deux informations est 
donc facilit&#233;. De plus, le num&#233;ro de t&#233;l&#233;phone est souvent d&#233;coup&#233; en cinq mots, un espace 
s&#233;parant chacun des chiffres. Il est donc plus difficile de recomposer les  6-grammes que les 
bi-grammes (lorsque les chiffres sont, par exemple, coll&#233;s les uns aux autres). En permettant 
l'apparition d'un point ou d'un tiret entre deux mots d'un crit&#232;re, on am&#233;liore l&#233;g&#232;rement les 
r&#233;sultats et l'on obtient 0,45 de F-mesure (Global 4).  Si on se r&#233;f&#232;re &#224; la premi&#232;re m&#233;thode, 
l'une des raisons de la perte de performances, est li&#233;e au regroupement de crit&#232;res proches du 
point  de  vue  de  l'information  qu'ils  portent.  C'est  notamment  le  cas  de  la  marque  et  du 
mod&#232;le.  Ces  deux informations  &#233;tant  tr&#232;s  souvent  regroup&#233;es  au  niveau  de  l'annonce,  la 
m&#233;thode des collocations en fait presque syst&#233;matiquement un n-gramme. Le d&#233;coupage n'est 
donc pas aussi fin que ce que l'on attend. On retrouve le m&#234;me genre de probl&#232;me avec des 
informations beaucoup plus complexes &#224; extraire comme la cylindr&#233;e, la motorisation et la 
puissance. L&#224; encore, ces informations sont le plus souvent coll&#233;es les unes aux autres, et 
donc impossibles &#224; extraire automatiquement. 
</p>
<p>Nous constatons donc que nous ne pouvons nous passer totalement de la connaissance du 
domaine pour assurer une extraction satisfaisante. C'est pourquoi nous testons l'extraction des 
collocations,  apr&#232;s avoir  extrait  au pr&#233;alable les crit&#232;res  &#224; valeur variable.  Nous obtenons 
ainsi des performances l&#233;g&#232;rement sup&#233;rieures &#224; la premi&#232;re m&#233;thode avec une F-mesure de 
0,76 (Global 5). Les r&#233;sultats de l'extraction des crit&#232;res &#224; valeur variable sont &#233;videmment 
inchang&#233;s. Pour les crit&#232;res &#224; caract&#232;re bool&#233;en, nous perdons un peu en pr&#233;cision (43,9% 
contre 47,5% pour la premi&#232;re m&#233;thode) mais nous gagnons en rappel (73,8% contre 68,7%). 
Ces r&#233;sultats s'expliquent par le fait que l'on essaye ici d'extraire tous les crit&#232;res et non pas 
seulement ceux qui ont &#233;t&#233; mis en &#233;vidence automatiquement. On augmente donc le rappel, 
mais  puisque  l'on  prend  plus  de  risques,  on  diminue  forc&#233;ment  la  pr&#233;cision.  On  note 
&#233;galement  une  am&#233;lioration  de  la  qualit&#233;  de  certains  crit&#232;res  que  l'on  extrayait  de  fa&#231;on 
automatique.  Ainsi  les  crit&#232;res  complexes  comme  &quot;coussins  gonflables  (4  &amp;plus)&quot;  ou 
&quot;garanti garantie or 12 mois&quot; sont correctement extraits, ce qui n'&#233;tait pas le cas auparavant. 
</p>
<p>5 Conclusion
Nous avons vu dans cet article que les m&#233;thodes que nous proposons donnent des r&#233;sultats 
comparables &#224; ce que l'on rencontre dans la litt&#233;rature, mais en utilisant une connaissance du 
domaine r&#233;duite tout en d&#233;tectant plus de crit&#232;res. De plus, une partie des crit&#232;res est extraite 
sans connaissances du domaine et notre m&#233;thode continue &#224; donner des r&#233;sultats acceptables. 
&#192; pr&#233;sent, nos objectifs sont d'am&#233;liorer nos r&#233;sultats en testant l'impact de l'utilisation d'un 
outil  de  racinisation.  Nous  g&#233;n&#233;rerons  ainsi  des  crit&#232;res  plus  g&#233;n&#233;raux,  et  nous  esp&#233;rons </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;dric Vidrequin, Juan-Manuel Torres-Moreno, Jean-Jacques Schneider, Marc El-B&#232;ze
</p>
<p>rapprocher des crit&#232;res li&#233;s. Pour extraire les crit&#232;res des petites annonces, nous utiliserons cet 
outil  de  racinisation  pour  faire  correspondre  n-grammes  et  crit&#232;res.  D'autre  part,  nous 
pr&#233;voyons de mettre &#224; l'&#233;preuve notre m&#233;thode en testant celle-ci sur des petites annonces 
&#233;crites dans une autre langue, ou traitant d'un autre domaine. Nous comptons appliquer notre 
algorithme sur  des  petites  annonces  automobile  en anglais,  puis  sur  des  petites  annonces 
immobili&#232;res en fran&#231;ais. Ces exp&#233;riences nous permettront en outre d'&#233;valuer le co&#251;t r&#233;el de 
l'adaptation des connaissances du domaine. Enfin, pour r&#233;soudre les probl&#232;mes de mots mal 
d&#233;coup&#233;s  &#224;  cause  des  ponctuations  ou  pour  des  mots  abr&#233;g&#233;s  de  fa&#231;on  particuli&#232;re  (ex: 
&quot;d&#233;givr.&quot;,  &quot;airbags  front.  et  lat.&quot;  ),  nous  r&#233;fl&#233;chissons  &#224;  l'utilisation  d'un  algorithme  de 
r&#233;duction de bruit. En consid&#233;rant les annonces comme un ensemble de donn&#233;es bruit&#233;es, ou 
contenant  des  erreurs,  le  but  serait  de  d&#233;tecter  ces  erreurs  et  de  pouvoir  les  corriger 
automatiquement, &#224; condition, bien s&#251;r, que les formes correctes soient pr&#233;dominantes sur les 
formes incorrectes. 
</p>
<p>Remerciement Ces travaux sont co-financ&#233;s par l'ANRT - CIFRE n&#176; 777/2004.
</p>
<p>R&#233;f&#233;rences 
Y. CHOUEKA, T. KLEIN, E. NEUWITZ. Automatic retrieval of frequent idiomatic and collocational 
expressions in a large corpus. Journal for literary and linguistic computing, 4:34-38.
</p>
<p>GAO X., STERLING L. (1999). Semi-Structured Data Extraction from Heterogeneous Sources. In 
Proceedings  of  2cd  International  Workshop  on  Innovative  Internet  Information  Systems 
(IIIS'99) in conjunction with the European Conference on Information Systems (ECIS'99), 
Copenhagen, Denmark.
</p>
<p>EMBLEY D.  W.,  CAMPBELL D.  M., SMITH R.  D. and  LIDDLE S.  W.  (1998).  Ontology-Based 
Extraction and Structuring of Information from Data-Rich Unstructured Documents. In G. 
Gardarin, J.C. French, N. Pissinou, K. Makki and L. Bouganim, editors, In Proceedings of the 
International Conference on Knowledge Management. ACM.
</p>
<p>PELEATO R. A., CHAPPELIER J.-C., and RAJMAN M. (2000). Automated Information Extraction out 
of Classified Advertisements. In Natural Language Processing and Information Systems : 5th 
International  Conference  on  Applications  of  Natural  Language  to  Information  Systems, 
NLDB 2000, Versailles, France.
</p>
<p>SEO H., YANG J., and CHOI J. (2001), Knowledge-based Wrapper Generation by Using XML. 
In IJCAI-2001 Workshop on Adaptive Text Extraction and Mining, Seattle, Washington.
</p>
<p>MANNING C. D., SCH&#220;TZE H. (1999).  Foundations of statistical  natural language processing. 
MIT Press, 620 p., Cambridge, MA. 
</p>
<p>VITERBI A.  (1967).  Error  bounds  for  convolutional  codes  and an  asymptotically  optimum 
decoding algorithm. IEEE Transactions on Information Theory.</p>

</div></div>
</body></html>