<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>V&#233;rification s&#233;mantique pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p>V&#233;rification s&#233;mantique pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>Caroline Brun (1), Caroline Hag&#232;ge  (2) 
 
</p>
<p>(1) Xerox Research Centre Europe &#8211; 6, chemin de Maupertuis, 38240 Meylan 
France 
</p>
<p>Caroline.Brun@xrce.xerox.com 
(2) Xerox Research Centre Europe &#8211; 6, chemin de Maupertuis, 38240 Meylan 
</p>
<p>France 
Caroline.Hagege@xrce.xerox.com 
</p>
<p>R&#233;sum&#233; Dans cet article, nous proposons une m&#233;thode visant &#224; corriger et &#224; associer 
dynamiquement de nouveaux types s&#233;mantiques dans le cadre de syst&#232;mes de d&#233;tection 
automatique d&#8217;entit&#233;s nomm&#233;es (EN). Apr&#232;s la d&#233;tection des entit&#233;s nomm&#233;es et aussi de 
mani&#232;re plus g&#233;n&#233;rale des noms propres dans les textes,  une v&#233;rification de compatibilit&#233; de 
types s&#233;mantiques est effectu&#233;e non seulement pour confirmer ou corriger les r&#233;sultats 
obtenus par le syst&#232;me de d&#233;tection d&#8217;EN, mais aussi pour associer de nouveaux types non 
couverts par le syst&#232;me de d&#233;tection d&#8217;EN. Cette v&#233;rification est effectu&#233;e en utilisant 
l&#8217;information syntaxique associ&#233;e aux EN par un syst&#232;me d&#8217;analyse syntaxique robuste et en 
confrontant ces r&#233;sultats avec la ressource s&#233;mantique WordNet. Les r&#233;sultats du syst&#232;me de 
d&#233;tection d&#8217;EN sont alors consid&#233;rablement enrichis, ainsi que les &#233;tiquettes s&#233;mantiques 
associ&#233;es aux EN, ce qui est particuli&#232;rement utile pour l&#8217;adaptation de syst&#232;mes de d&#233;tection 
d&#8217;EN &#224; de nouveaux domaines.  
</p>
<p>Abstract In this paper we propose a new method that enables to correct and to associate 
new semantic types in the context of Named Entity (NE) Recognition Systems. After named 
entities (and more generally proper nouns) have been detected in texts, a semantic 
compatibility checking is performed. This checking can not only confirm or correct previous 
results of the NER system but also associate new NE types that have not been previously 
foreseen. This checking is performed using information associated to the NE by a robust 
syntactic analyzer and confronting this information to WordNet. After this checking is 
performed, final results of the NER system are better and new NE semantic tags are created. 
This second point is particularly useful when adapting existing NER systems to new domains. 
</p>
<p>Mots-cl&#233;s :   Entit&#233;s nomm&#233;es, Analyse syntaxique robuste, Types s&#233;mantiques 
Keywords:   Named Entities, Robust Parsing, Semantic Types 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge 
</p>
<p>1 Introduction 
Dans cet article, nous proposons une m&#233;thode permettant d&#8217;enrichir les r&#233;sultats obtenus par 
un syst&#232;me de d&#233;tection automatique d&#8217;entit&#233;s nomm&#233;es en utilisant les relations syntaxiques 
qui leur sont associ&#233;es par un analyseur syntaxique robuste, XIP (Xerox Incremental Parser), 
et en v&#233;rifiant les types s&#233;mantiques des arguments en relation syntaxique &#224; l&#8217;aide de la 
ressource ontologique WordNet (Fellbaum, 1998). L&#8217;utilisation de relations syntaxiques pour 
raffiner la t&#226;che de d&#233;tection d&#8217;EN n&#8217;est pas nouvelle, voir par exemple (Ehrmann et Jacquet, 
2006) ou (Brun et Hag&#232;ge, 2004). De m&#234;me, l&#8217;utilisation de WordNet dans le cadre de la 
d&#233;tection d&#8217;EN est d&#233;crite dans plusieurs travaux, comme par exemple dans (Magnini et al., 
2002). Les travaux de (Benetti et al., 2006) montrent aussi l&#8217;enrichissement d&#8217;un syst&#232;me de 
reconnaissance d&#8217;EN gr&#226;ce &#224; l&#8217;utilisation de Wikipedia. La nouveaut&#233; de notre m&#233;thode est de 
coupler information syntaxique et information s&#233;mantique sur les r&#233;sultats de cette analyse 
syntaxique fine. Cela va nous permettre non seulement de valider ou d&#8217;invalider les r&#233;sultats 
pr&#233;alablement fournis par le syst&#232;me de d&#233;tection d&#8217;EN, mais aussi de consid&#233;rer de 
nouveaux types s&#233;mantiques via WordNet et de les associer &#224; des noms propres non typ&#233;s par 
le syst&#232;me initial, cr&#233;ant ainsi de nouvelles cat&#233;gories d&#8217;entit&#233;s nomm&#233;es.  
</p>
<p>Apr&#232;s avoir pr&#233;sent&#233; l&#8217;analyseur syntaxique robuste XIP, ainsi que le syst&#232;me de d&#233;tection 
d&#8217;EN, bas&#233; &#233;galement sur XIP, nous d&#233;crivons en d&#233;tail cette m&#233;thode et son implantation. 
Puis, nous donnons les r&#233;sultats de diff&#233;rentes exp&#233;rimentations r&#233;alis&#233;es avec le prototype 
que nous avons d&#233;velopp&#233;. Enfin, nous tirons les conclusions  relatives &#224; cette m&#233;thode.  
</p>
<p>2 D&#233;tection d&#8217;entit&#233;s nomm&#233;es  
</p>
<p>2.1 G&#233;n&#233;ralit&#233;s  
</p>
<p>La d&#233;tection d&#8217;entit&#233;s nomm&#233;es fait l&#8217;objet d&#8217;un int&#233;r&#234;t certain pour le TALN (voir les 
conf&#233;rences MUC http://www.itl.nist.gov/iaui/894.02/related_projects/muc/, les campagnes 
ACE http://www.nist.gov/speech/tests/ace/, ESTER, etc.), en particulier pour la t&#226;che 
d&#8217;extraction d&#8217;information, mais aussi pour beaucoup d&#8217;autres applications sp&#233;cifiques. De 
nombreux syst&#232;mes, symboliques ou statistiques, d&#233;tectent et cat&#233;gorisent les NE avec de 
bonnes performances (environ 90 de f-mesure).  Cependant, certaines applications requi&#232;rent 
plus de pr&#233;cision et la m&#233;thode que nous proposons vise &#224; am&#233;liorer a posteriori les r&#233;sultats 
d&#8217;en syst&#232;me d&#8217;extraction d&#8217;EN.     
</p>
<p>2.2 L&#8217;analyseur syntaxique robuste XIP 
</p>
<p>XIP (Ait-Mokhtar  et al., 2002) est un analyseur dont l'objectif est d'extraire des d&#233;pendances 
syntaxiques de fa&#231;on robuste. Cet analyseur accepte en entr&#233;e n&#8217;importe quel document ou 
partie de document au format texte ou XML et produit en sortie une repr&#233;sentation 
grammaticale du contenu de ce document.  
</p>
<p>Le formalisme propos&#233; par XIP nous permet d'exprimer un large &#233;ventail de r&#232;gles qui vont 
de la d&#233;sambigu&#239;sation cat&#233;gorielle &#224; la construction de d&#233;pendances, en passant par la 
constitution de syntagmes noyaux : XIP permet de relier par des relations des &#233;l&#233;ments 
linguistiques qui peuvent &#234;tre des &#233;l&#233;ments lexicaux, mais aussi des &#233;l&#233;ments non lexicaux 
correspondant &#224; des syntagmes noyaux. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;rification s&#233;mantique pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>Dans le cadre du travail pr&#233;sent&#233; dans cet article, nous utilisons la version la plus compl&#232;te de 
la grammaire de l&#8217;anglais d&#233;velopp&#233;e au sein de XIP, que nous d&#233;signons par grammaire &#171;de 
 normalisation &#187;. Cette grammaire est construite sur la base des r&#233;sultats obtenus lors de 
l&#8217;analyse grammaticale g&#233;n&#233;rale de l&#8217;anglais.  
</p>
<p>Grammaire g&#233;n&#233;rale : La grammaire g&#233;n&#233;rale de l&#8217;anglais permet le &#171; chunking &#187; (analyse 
en syntagmes noyaux) et r&#233;alise une extraction des d&#233;pendances standards (Sujet, Objet, 
modifieurs, attributs etc.).  
</p>
<p>A titre d&#8217;exemple, voici une phrase analys&#233;e par cette grammaire :  
McMurphy was successful in changing many of the rules that were imposed 
upon them by Nurse Ratched. 
 
Analyse par XIP (grammaire g&#233;n&#233;rale): 
</p>
<p>MAIN(was) 
NUCL_SUBJCOMPL(was,successful) 
SUBJ_PRE(was,McMurphy) 
MOD_POST_GERUND(was,changing) 
OBJ_POST(changing,rules) 
QUANTD(rules,many) 
MOD_POST_SENTENCE_RELATIV(rules,im
posed) 
</p>
<p>NUCL_VLINK_PASSIVE(were,imposed) 
SUBJ_PRE_RELATIV(were,that) 
AGENT(imposed,Nurse Ratched) 
MOD_POST(imposed,them) 
MOD_POST(them,Nurse Ratched) 
PERSON(Nurse Ratched) 
PERSON(McMurphy) 
</p>
<p> 
 
Grammaire de normalisation  (Hag&#232;ge, Roux, 2003): Une couche suppl&#233;mentaire de 
d&#233;veloppement a &#233;t&#233; rajout&#233;e &#224; cette grammaire de base, l&#8217;objectif applicatif vis&#233; &#233;tant 
l&#8217;extraction d&#8217;information. Ces d&#233;veloppements permettent d'avoir, apr&#232;s l'analyse, une 
repr&#233;sentation commune pour des suites de signifiants qui ne sont pas identiques mais qui 
v&#233;hiculent une information similaire. A l'heure actuelle, ce travail de normalisation s'effectue 
selon trois axes :  
 
</p>
<p>&#8226; L'exploitation des relations syntaxiques mises en &#233;vidence lors de l'analyse g&#233;n&#233;rale : 
L'analyse par la grammaire g&#233;n&#233;rale est tout d&#8217;abord raffin&#233;e afin de consid&#233;rer les 
sujets et objets de verbes non finis et les ant&#233;c&#233;dents des relatives dans le calcul du 
sujet et de l'objet, de normaliser la forme passive en forme active et de typer certains 
compl&#233;ments. Ensuite, certaines alternances verbales telles qu&#8217;elles sont d&#233;finies dans 
(Levin,  93)  sont exploit&#233;es. 
</p>
<p> 
&#8226; La hi&#233;rarchisation des propositions dans une phrase : la grammaire normalis&#233;e permet 
</p>
<p>de reconna&#238;tre les degr&#233;s d&#8217;ench&#226;ssements des verbes par rapport au verbe principal.  
 
</p>
<p>&#8226; L'exploitation d'information de morphologie d&#233;rivationnelle : cette information permet 
d&#8217;exprimer des &#233;quivalences entre verbe-compl&#233;ments et nom-arguments. 
</p>
<p>L&#8217;analyse de la phrase pr&#233;c&#233;dente avec cette version de la grammaire donne alors : 
</p>
<p>Analyse par XIP (grammaire normalis&#233;e): 
</p>
<p>ATTRIB(McMurphy,successful) 
MAIN(was) 
MOD_POST_GERUND(was,changing) 
SUBJ-N_PRE(was,McMurphy) 
OBJ-N(changing,rules) 
EMBED_PROG(changing,was) 
</p>
<p>SUBJ-N(changing,McMurphy) 
MOD_POST_SENTENCE_RELATIV(rules,im
posed) 
SUBJ-N(imposed,Nurse Ratched) 
OBJ-N(imposed,rules) 
MOD_POST(imposed,them) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge 
</p>
<p>MOD_POST(them,Nurse Ratched) 
PERSON(Nurse Ratched) 
</p>
<p>PERSON(McMurphy) 
SUBJ-N(succeed,McMurphy) 
</p>
<p> 
Nous pouvons remarquer dans l&#8217;analyse effectu&#233;e par la grammaire de normalisation qu&#8217;une 
relation de type &#171; sujet normalis&#233; &#187; (SUBJ-N) est &#233;tablie entre le verbe &#171; succeed &#187; et 
&#171; McMurphy &#187; (&#224; partir de la suite &#171; McMurphy was successful &#187;). L&#8217;identification de 
l&#8217;ant&#233;c&#233;dent de la relative ainsi que la normalisation entre forme passive et forme active 
permettent d&#8217;extraire une relation &#171; sujet normalis&#233; &#187; entre le verbe &#171; impose &#187; et &#171; Nurse 
Ratched &#187; et une relation &#171; objet normalis&#233; &#187; entre ce m&#234;me verbe et le nom &#171; rule &#187;. Enfin, 
une relation &#171; sujet normalis&#233; &#187; est &#233;galement extraite entre le verbe &#171; change &#187; et le nom 
&#171; McMurphy &#187;. 
 
C&#8217;est cette version de la grammaire que nous avons utilis&#233;e dans pour construire le prototype 
de validation et d&#233;couverte d&#8217;EN.   
</p>
<p>2.3 XIP et la d&#233;tection d&#8217;EN 
</p>
<p>Un syst&#232;me de d&#233;tection des EN a &#233;t&#233; d&#233;velopp&#233; au sein de l&#8217;analyseur XIP. Il permet de 
d&#233;tecter les types &#171; standards &#187; d&#8217;entit&#233;s nomm&#233;es &#224; savoir : dates, pourcentages, monnaies,  
lieux, personnes, organisations. Il s&#8217;agit d&#8217;un syst&#232;me &#224; base de r&#232;gles, consistant en un 
ensemble de r&#232;gles locales qui utilisent de l&#8217;information lexicale combin&#233;e &#224; de l&#8217;information 
contextuelle sur les cat&#233;gories syntaxiques. Ces r&#232;gles locales sont tr&#232;s similaires &#224; des r&#232;gles 
de &#171; chunking &#187;  (identification des syntagmes noyaux), sauf qu&#8217;elles op&#232;rent au niveau du 
nom.  
</p>
<p>Voici un exemple d&#8217;analyse1: 
</p>
<p>Margaret Sinclair Trudeau, born September 10, 1948 in Vancouver, British Columbia, 
Canada, was the wife of the late Canadian Prime Minister Pierre Trudeau. The daughter of 
James Sinclair, a former Liberal member of the Parliament of Canada and fisheries minister, 
she attended Simon Fraser University where she obtained a degree in English literature. 
</p>
<p>PERSON(Margaret Sinclair Trudeau) 
DATE(September 10 , 1948) 
LOC_CITY(Vancouver) 
LOC_REGION(British Columbia) 
LOC_COUNTRY(Canada) 
PERSON(Canadian Prime Minister  Pierre Trudeau) 
PERSON(James Sinclair) 
ORGANISATION(Parliament of Canada) 
ORGANISATION(Simon Fraser University) 
 
Le syst&#232;me a &#233;t&#233; &#233;valu&#233;  en interne, sur un corpus de d&#233;p&#234;ches d&#8217;environ 87000 mots,  et 
montre une f-mesure de 90 tous types d&#8217;entit&#233;s confondus (Erhmann 2004). Ce syst&#232;me de 
d&#233;tection des entit&#233;s nomm&#233;es est int&#233;gr&#233; aux diff&#233;rentes grammaires pr&#233;sent&#233;es dans le 
paragraphe pr&#233;c&#233;dent.  La validation et d&#233;couverte d&#8217;EN se fait sur la base des r&#233;sultats 
obtenus par ce syst&#232;me initial.  
</p>
<p>                                                 
1 Les entit&#233;s extraites sont pr&#233;sent&#233;es sous forme de &#171; d&#233;pendances unaires &#187;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;rification s&#233;mantique pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>3 Validation et d&#233;couverte d&#8217;EN 
</p>
<p>3.1 D&#233;tection des relations attributives 
</p>
<p>La premi&#232;re &#233;tape r&#233;alis&#233;e par notre prototype est de d&#233;tecter les entit&#233;s nomm&#233;es ainsi que 
les entit&#233;s potentielles non &#233;tiquet&#233;es s&#233;mantiquement (noms propres) &#224; l&#8217;aide du syst&#232;me 
pr&#233;sent&#233; au paragraphe 2.3.  Notre syst&#232;me va consid&#233;rer comme nom propre, toute suite de 
mots (&#233;ventuellement non reconnus par l&#8217;analyseur lexical) pr&#233;sentant des particularit&#233;s 
typographiques comme une majuscule initiale et ne rentrant dans aucune des cat&#233;gories 
d&#8217;entit&#233;s nomm&#233;es reconnues par le syst&#232;me. 
</p>
<p>Nous appliquons ensuite sur le m&#234;me texte la grammaire normalis&#233;e. Cette grammaire 
normalis&#233;e a pour particularit&#233; d&#8217;extraire une relation que nous d&#233;signons par relation 
attributive. Une relation attributive relie des suites de caract&#232;res lorsque des indicateurs 
textuels et des constructions syntaxiques permettent d&#8217;affirmer qu&#8217;ils entretiennent une 
relation de type IS-A 
</p>
<p>Les exemples suivants illustrent la notion de relation attributive telle que nous l&#8217;entendons. 
</p>
<p>(1) John Smith was an inventor.  
(2) John Smith, the inventor, made a presentation. 
 (3) John Smith is expected to be an inventor.  
(4) They consider John Smith an inventor. 
(5) The inventor John Smith was awarded. 
(6) An inventor called John Smith was awarded. 
(7) John Smith, who is a great inventor, was awarded. 
(8) John Smith, as the inventor of the process, was awarded. 
Dans tous ces exemples, &#8220;John Smith&#8221; est en relation attributive avec &#8220;inventor&#8221;. 
A titre d&#8217;exemple, l&#8217;analyse donn&#233;e par XIP pour la phrase (5), en utilisant la grammaire de 
normalisation,  est la suivante :  
SUBJ-N_PRE(consider,They) 
PREPD(inventor,as) 
PERSON(John Smith) 
</p>
<p>OBJ-N(consider,Smith) 
ATTRIB(John Smith,inventor) 
</p>
<p> 
</p>
<p>Nous nous int&#233;resserons uniquement aux relations attributives mettant en jeu les entit&#233;s 
nomm&#233;es et nom propres extraites &#224; l&#8217;aide de XIP : elles correspondent &#224; une relation de type 
IS-A du point de vue s&#233;mantique, et vont ainsi nous permettre de typer s&#233;mantiquement les 
EN.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge 
</p>
<p>3.2 Confrontation avec WordNet 
</p>
<p>Nous utilisons l&#8217;information s&#233;mantique fournie par la base de donn&#233;es lexicale WordNet2 
(Fellbaum 1998), en particulier les classes s&#233;mantiques de plus haut niveau associ&#233;es aux 
synsets.   
</p>
<p>Une fois les relations attributives extraites entre entit&#233;s et attribut nominal, le syst&#232;me utilise 
WordNet pour associer un type s&#233;mantique &#224; l&#8217;attribut nominal. Pour ce faire, nous avons 
extrait de WordNet tous les noms dont le &#171; super type &#187; (person, artifact, substance, etc.) n&#8217;est 
pas ambigu, par exemple : 
</p>
<p>Girl [5 sens] &#198; noun.person   Ship [1 sens] &#198; noun.artifact 
Drug [1 sens] &#198; noun.artifact  Liquidation [3 sens] &#198; noun.act  
 
En r&#233;sulte un vocabulaire de 44406 noms accompagn&#233;s de leur &#171; super type &#187; s&#233;mantique qui 
est int&#233;gr&#233; &#224; des lexiques au sein de XIP.  Un appariement entre &#171; super type &#187; s&#233;mantique de 
WordNet et type d&#8217;entit&#233;s nomm&#233;es reconnues par le syst&#232;me initial est &#233;galement effectu&#233; 
(par exemple le type WordNet &#171; person &#187; correspond au type &#171; PERSON &#187; de notre syst&#232;me 
de reconnaissance de EN.  
</p>
<p>Le sch&#233;ma suivant d&#233;crit l&#8217;architecture du prototype que nous avons d&#233;velopp&#233; : 
</p>
<p> 
</p>
<p>Le r&#233;sultat de la confrontation entre entit&#233; nomm&#233;e ou nom propre extraits par le syst&#232;me 
initial et type s&#233;mantique de l&#8217;attribut nominal selon WordNet peut produire les cas de figures 
suivants : 
</p>
<p>                                                 
2 http://wordnet.princeton.edu/ 
</p>
<p>EN et type s&#233;mantique de 
l&#8217;attribut compatibles 
</p>
<p>Texte en entr&#233;e 
</p>
<p>XIP 
Extraction des EN et 
Noms Propres (NPr) 
</p>
<p>D&#233;tection des relations attributives 
WordNet 
</p>
<p>EN/NPr et types des 
attributs nominaux 
</p>
<p>NPr et type 
s&#233;mantique 
de l&#8217;attribut 
</p>
<p>EN et type s&#233;mantique 
de l&#8217;attribut non 
compatibles 
</p>
<p>Conflit de 
type  
</p>
<p>Confirmation 
de type  
</p>
<p>D&#233;couverte 
de type  
</p>
<p>Suite de l&#8217;analyse avec 
d&#233;tection d&#8217;EN am&#233;lior&#233;e 
</p>
<p>XIP </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;rification s&#233;mantique pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>1) Conflit de type 
</p>
<p>Dans ce cas, le syst&#232;me initial a associ&#233; &#224; une EN un certain type s&#233;mantique qui n&#8217;est pas 
compatible avec le type que WordNet assigne &#224; l&#8217;attribut de cette entit&#233;, comme par exemple 
dans la phrase (o&#249; l&#8217;EN est indiqu&#233;e en gras) : 
</p>
<p>The warship is called the Armando Diaz 
</p>
<p>Le type de l&#8217;EN extrait par le syst&#232;me initial est &#171; PERSON &#187; alors que le type de &#171; warship &#187; 
selon WordNet est &#171; artifact &#187;. Ces deux types sont contradictoires. 
</p>
<p>2) Confirmation de type 
</p>
<p>C&#8217;est le cas pour lequel le type de l&#8217;entit&#233; nomm&#233;e est compatible avec le type WordNet de 
son attribut. Dans ce cas, il s&#8217;agit d&#8217;une information suppl&#233;mentaire qui vient confirmer le 
choix du syst&#232;me initial, comme par exemple dans :  
</p>
<p>If one man has done more than any other to keep Old Labour behind Tony Blair it is surely 
his deputy, John Prescott. 
</p>
<p>Une relation attributive est d&#233;tect&#233;e entre &#171; deputy &#187; et &#171; John Prescott &#187;, pr&#233;alablement 
identifi&#233; comme nom de personne par le syst&#232;me initial. Selon WordNet, &#171; deputy &#187;, 
n&#8217;appartient qu&#8217;au &#171; super type &#187; &#171; person &#187;. Les deux types sont parfaitement compatibles, 
donc le syst&#232;me confirme le type de l&#8217;entit&#233;.  
</p>
<p>3) D&#233;couverte d&#8217;un nouveau type 
</p>
<p>Ce cas s&#8217;applique uniquement aux noms propres non typ&#233;s extraits par le syst&#232;me initial. 
Gr&#226;ce &#224; l&#8217;association d&#8217;un attribut &#224; ce nom propre, et au typage par WordNet de cet attribut, 
nous pouvons proposer d&#8217;attribuer ce type s&#233;mantique WordNet au nom propre. Par exemple 
dans la phrase suivante : 
</p>
<p>Activia is yogurt, but not just any yogurt.  
</p>
<p>&#8220;Activia&#8221; n&#8217;est pas d&#233;tect&#233; comme une EN par le syst&#232;me initial de XIP. Il est cependant en 
relation attributive avec le nom &#171; yogurt &#187;, dont le super type dans WordNet est &#171; food &#187;. Le 
syst&#232;me associe donc la nouvelle &#233;tiquette s&#233;mantique &#171; food &#187; &#224; &#171; Activia &#187;.  
</p>
<p>4 Exp&#233;rimentations sur corpus 
</p>
<p>4.1 Corpus g&#233;n&#233;ral 
</p>
<p>Le corpus g&#233;n&#233;ral, de 5500 mots, est constitu&#233; d&#8217;un ensemble de d&#233;p&#234;ches de provenance 
diverse (Herald Tribune, The Guardian, The Observer, The New York Times) ainsi que de 
quelques courtes biographies. Le syst&#232;me initial de reconnaissance d&#8217;EN d&#233;tecte 7441 entit&#233;s 
nomm&#233;es. 
</p>
<p>L&#8217;application post&#233;rieure de notre m&#233;thode nous permet de consid&#233;rer 115 entit&#233;s, parmi 
lesquelles 78 sont des compatibilit&#233;s entre types, 19 sont des d&#233;couvertes de nouveau type, 18 
sont des conflits ; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge 
</p>
<p>Compatibilit&#233; : 
</p>
<p>Seuls des entit&#233;s de type PERSON et ORGANISATION sont concern&#233;es. Les 78 cas de 
compatibilit&#233;s extraites sont justes, comme par exemple pour la phrase suivante : 
</p>
<p>The Democratic challenger, John Kerry, has called on the White House to turn words into 
action. 
 
John Kerry a &#233;t&#233; d&#233;tect&#233; comme EN de type personne par le syst&#232;me g&#233;n&#233;ral (&#8220;John&#8221; &#233;tant 
une suite cod&#233;e comme pr&#233;nom dans le lexique). Cela est confirm&#233; dans un deuxi&#232;me temps 
gr&#226;ce &#224; l&#8217;identification du lien attributif entre &#8220;John Kerry&#8221; et &#8220;challenger&#8221; qui lui-m&#234;me est 
consid&#233;r&#233; comme de type personne par WordNet.  
</p>
<p>D&#233;couverte : 
</p>
<p>Les types d&#233;couverts et propos&#233;s par le biais de WordNet dans ce texte sont les types 
COMMUNICATION et ARTIFACT, comme par exemple dans :  
 
For Tom Hanks, it's his maiden voyage to Cannes where he will be publicising the Coen 
brothers ' remake of the classic British comedy The Ladykillers. 
ENTITE(Cannes) 
ENTITE(Ladykillers) 
PERSON(Tom Hanks) 
PERSON(Coen) 
</p>
<p>LOCORG_CITY(Cannes) 
ATTRIB(Ladykillers,comedy) 
DISCOVERY_WN_COMMUNICATION(Lady
killers)
</p>
<p> 
&#8220;Ladykillers&#8221; qui avait simplement &#233;t&#233; rep&#233;r&#233;e comme nom propre par le syst&#232;me g&#233;n&#233;ral, se 
voit attribuer le type &#8220;COMMUNICATION&#8221; gr&#226;ce &#224; la relation attributive qu&#8217;il entretient 
avec le nom &#8220;comedy&#8221;. 
 
Sur les 19 entit&#233;s d&#233;couvertes, 5 sont erron&#233;es et 14 sont correctes. Les erreurs sont dues a des 
erreurs de d&#233;tection de la relation attributive provenant en g&#233;n&#233;ral d&#8217;une erreur dans la 
d&#233;tection de la t&#234;te d&#8217;un groupe nominal complexe. Cette erreur de d&#233;tection de la t&#234;te est &#224; 
son tour souvent li&#233;e &#224; des erreurs de d&#233;sambiguisation de la partie du discours.  
</p>
<p>On peut remarquer que le faible nombre d&#8217;entit&#233;s d&#233;couvertes s&#8217;explique par le fait que le 
corpus trait&#233; est en harmonie avec le type d&#8217;entit&#233;s que le syst&#232;me g&#233;n&#233;ral pr&#233;voit (langue 
g&#233;n&#233;rale, presse). 
Conflit : 
</p>
<p>Nous obtenons pour ce corpus 17 cas de conflit. Il est int&#233;ressant de noter que parmi ces 
conflits, certains rel&#232;vent de cas d&#8217;emploi m&#233;tonymique des entit&#233;s nomm&#233;es, comme par 
exemple dans la phrase suivante : 
</p>
<p>While Schr&#246;der was saying that D-Day signaled the starting point for today&#8217;s new Europe 
and maintained that the EU was the best guarantor of peace in Europe,... 
</p>
<p>Une relation attributive entre l&#8217;entit&#233; nomm&#233;e &#171; EU &#187; et le nom &#171; guarantor &#187; est extraite. Le 
syst&#232;me de base de d&#233;tection des EN indique que &#171; EU &#187; est de type ORG. Par le biais de 
notre m&#233;thode, dans la mesure o&#249; le nom &#171; guarantor &#187; est de type PERSON, nous obtenons 
un conflit de type.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V&#233;rification s&#233;mantique pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es 
</p>
<p>Or, dans le cas pr&#233;sent, c&#8217;est bien un usage m&#233;tonymique de l&#8217;entit&#233; &#171; EU &#187; dont il s&#8217;agit dans 
cette phrase, m&#234;me si par nature, &#171; EU &#187; correspond &#224; un lieu ou &#224; une organisation. 
</p>
<p>Parmi les 18 cas de conflit, nous obtenons  6 cas de conflits li&#233;s &#224; des usages m&#233;tonymiques 
des entit&#233;s nomm&#233;es d&#233;tect&#233;es. Nous pouvons donc consid&#233;rer que ces 6 cas sont pertinents. 
Nous obtenons &#233;galement 3 cas pertinents de conflits pour lesquels le syst&#232;me initial de 
d&#233;tection des EN a fait des erreurs que nous pouvons corriger gr&#226;ce &#224; notre m&#233;thode. 
</p>
<p>Enfin, les 8 cas restants sont des d&#233;tections de conflit erron&#233;es, ces erreurs &#233;tant 
essentiellement li&#233;es, comme pour les erreurs de d&#233;couverte &#224; des erreurs d&#8217;analyse 
syntaxique et de d&#233;sambigu&#239;sation. 
</p>
<p>4.2 Corpus sp&#233;cialis&#233;  
</p>
<p>Nous avons &#233;galement test&#233; notre m&#233;thode sur un corpus3 sp&#233;cialis&#233; de biologie, d&#8217;environ 
92000 mots (il s&#8217;agit de 422 articles extraits de pubmed). Nous nous sommes int&#233;ress&#233;es aux 
noms de g&#232;nes, annot&#233;s dans ce corpus, et qui correspondent aux  classes s&#233;mantiques 
&#171; BODY &#187;  et &#171; SUBSTANCE&#187; de Wordnet. Sur ce corpus, le syst&#232;me &#171; d&#233;couvre &#187; 505 
noms de g&#232;nes, et d&#233;tecte 8 cas de conflits avec le syst&#232;me initial.  Voici une illustration de 
ces r&#233;sultats : 
</p>
<p>(1) Structural basis of multidrug recognition by BmrR, a transcription activator of a 
multidrug transporter. 
</p>
<p> 
ATTRIB(activator,BmrR) 
DISCOVERY_WN_SUBSTANCE(BmrR) 
0&gt;TOP{NP{AP{Structural} basis} PP{of NP{multidrug recognition}} PP{by NP{BmrR}} , NP{a transcription 
activator} PP{of NP{a AP{multidrug} transporter}} .} 
 
Le nom propre &#171; Bmr&#187; est d&#233;couvert comme une entit&#233; de type &#171; Substance &#187; (g&#232;ne)  par 
notre syst&#232;me car l&#8217;attribut &#171; activator&#187; appartient &#224; la classe noun.substance dans WordNet.  
(2) ADP is an inhibitor of the phosphorylation by ATP.  
ORGANISATION(ADP) 
ATTRIB(ADP,inhibitor) 
CONFLICT_WN_SUBSTANCE(ADP) 
0&gt;TOP{SC{NP{ADP} FV{is}} NP{an inhibitor} PP{of NP{the phosphorylation}} PP{by NP{ATP}}} 
 
Ici, un conflit est d&#233;tect&#233; car le syst&#232;me initial de reconnaissance consid&#232;re ADP comme une 
organisation  (ADP= A&#233;roport de Paris), alors que notre syst&#232;me lui associe le type 
SUBSTANCE.  
Les 8 cas de conflits d&#233;tect&#233;s sont tous corrects, c'est-&#224;-dire que le syst&#232;me initial donne une 
annotation erron&#233;e pour un nom de g&#232;ne.   Concernant les noms de g&#232;nes d&#233;couverts, 
l&#8217;&#233;valuation sur ce corpus donne 85% de pr&#233;cision et 6,6 % de rappel.  
Nous obtenons donc une tr&#232;s bonne pr&#233;cision pour un rappel faible, ce dernier point &#233;tant 
assez pr&#233;visible car le syst&#232;me n&#8217;utilise que des relations attributives pour d&#233;tecter les EN. A 
titre d&#8217;information, 1900 relations attributives sont d&#233;tect&#233;es sur l&#8217;ensemble du corpus.   
</p>
<p>                                                 
3 Disponible ici : http://mig.jouy.inra.fr/recherches/bibliome/linguistic-and-semantic-
</p>
<p>resources/corpora/manual_genes_annotation.tar.bz2/view </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Brun, Caroline Hag&#232;ge 
</p>
<p>5 Conclusion 
La m&#233;thode que nous pr&#233;sentons permet d&#8217;am&#233;liorer les r&#233;sultats d&#8217;un syst&#232;me de 
reconnaissance d&#8217;entit&#233;s nomm&#233;es en validant ou invalidant les r&#233;sultats produits par ce 
syst&#232;me et permet &#233;galement de proposer de nouveaux types d&#8217;entit&#233;s nomm&#233;es pour des 
noms propres d&#233;tect&#233;s mais non typ&#233;s par le syst&#232;me. La m&#233;thode utilise les r&#233;sultats d&#8217;une 
analyse syntaxique fine permettant d&#8217;extraire des relations de type IS-A entre noms propres et 
entit&#233;s reconnues par le syst&#232;me initial et d&#8217;autres noms communs cat&#233;goris&#233;s 
s&#233;mantiquement par la ressource WordNet. 
</p>
<p>Les tests effectu&#233;s sur les corpus montrent que l&#8217;apport de notre m&#233;thode est tr&#232;s variable 
selon le type de corpus sur lequel on travaille. Dans le cas de textes appartenant &#224; un domaine 
particulier, c&#8217;est l&#8217;aspect d&#233;couverte de nouvelles entit&#233;s dont les types n&#8217;ont pas &#233;t&#233; 
pr&#233;alablement pr&#233;d&#233;finis qui semble le plus int&#233;ressant. En effet, m&#234;me si la couverture reste 
basse elle peut constituer une amorce fiable pour des syst&#232;mes d&#8217;apprentissage. Dans le cas de 
textes g&#233;n&#233;raux pour lesquels  les types d&#8217;entit&#233;s nomm&#233;es pr&#233;d&#233;finis sont couvrants, c&#8217;est 
l&#8217;aspect confirmation qui semble le plus prometteur.  
</p>
<p>R&#233;f&#233;rences 
A&#1031;T-MOKTHAR S., CHANOD J.P., ROUX C. (2002). Robustness beyond Shallowness : 
Incremental Dependency Parsing. Special issue of NLE Journal.  
</p>
<p>BENETI A., HAMMOUMI W., HIELSCHER E., MULLER M., PERSONS D. (2006). Automatic 
Generation of Fine-Grained Named Entity Classification, 
http://www.ifarm.nl/erikt/ltp2006/ltp2006.pdf 
BRUN C.  HAG&#200;GE H.  (2004). Intertwining deep syntactic processing and named entity 
detection. Actes de  ESTAL 2004, Alicante, Spain, October 20-22, 2004. 
EHRMANN M. (2004). Evaluation d'un Syst&#232;me d'extraction d'Entit&#233;s Nomm&#233;es. Rapport de 
stage DESS Texte, Nancy, 2004. 
EHRMANN M., JACQUET G. (2006). Vers une double annotation des entit&#233;s nomm&#233;es. Revue 
TAL, num&#233;ro 46,  volume 3.  
</p>
<p>FELLBAUM C. (1998). WordNet: An Electronical Lexical Database. MIT Press, Cambridge, 
USA.  
</p>
<p>HAG&#200;GE C, ROUX C. (2003). Entre syntaxe et s&#233;mantique : normalisation de l&#8217;analyse 
syntaxique en vie de l&#8217;amelioration de l&#8217;extraction d&#8217;information. Actes de TALN 2003, Batz-
sur-Mer, France.  
</p>
<p>LEVIN, B. (1993). English Verb Classes and Alternations &#8211; A preliminary Investigation. The 
University of Chicago Press.  
</p>
<p>MAGNINI B, NEGRI M, PREVETE R., TAEV H. (2002). A WordNEt-Based Approach to Named 
Entities Recognition. COLING-02 on SEMANET, Vol.11, pp. 1-7 </p>

</div></div>
</body></html>