<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Contr&#244;le rh&#233;torique de la g&#233;n&#233;ration des connecteurs concessifs en dialogue homme-machine</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Contr&#244;le rh&#233;torique de la g&#233;n&#233;ration des connecteurs
concessifs en dialogue homme-machine
</p>
<p>Vladimir Popescu1, 2 Jean Caelen1
</p>
<p>(1) GETALP/LIG, Institut National Polytechnique de Grenoble, France
(2) Universit&#233; &#171; Politehnica &#187; de Bucarest, Roumanie
</p>
<p>{vladimir.popescu, jean.caelen}@imag.fr
</p>
<p>R&#233;sum&#233;. Les connecteurs discursifs ont on r&#244;le important dans l&#8217;interpr&#233;tation des dis-
cours (dialogiques ou pas), donc lorsqu&#8217;il s&#8217;agit de produire des &#233;nonc&#233;s, le choix des mots
qui relient les &#233;nonc&#233;s (par exemple, en dialogue oral) s&#8217;av&#232;re essentiel pour assurer la com-
pr&#233;hension des vis&#233;es illocutoires des locuteurs. En linguistique computationnelle, le probl&#232;me
a &#233;t&#233; abord&#233; surtout au niveau de l&#8217;interpr&#233;tation des discours monologiques, tandis que pour
le dialogue, les recherches se sont limit&#233;es en g&#233;n&#233;ral &#224; &#233;tablir une correspondance quasiment
biunivoque entre relations rh&#233;toriques et connecteurs. Dans ce papier nous proposons un m&#233;ca-
nisme pour guider la g&#233;n&#233;ration des connecteurs concessifs en dialogue, &#224; la fois du point de vue
discursif et s&#233;mantique ; chaque connecteur consid&#233;r&#233; sera contraint par un ensemble de condi-
tions qui prennent en compte la coh&#233;rence du discours et la pertinence s&#233;mantique de chaque
mot concern&#233;. Les contraintes discursives, exprim&#233;es dans un formalisme d&#233;riv&#233; de la SDRT
(&#171; Segmented Discourse Representation Theory &#187;) seront plong&#233;es dans des contraintes s&#233;man-
tiques sur les connecteurs, propos&#233;es par l&#8217;&#233;cole genevoise (Moeschler), pour enfin &#233;valuer la
coh&#233;rence du discours r&#233;sultant de l&#8217;emploi de ces connecteurs.
</p>
<p>Abstract. Cue words play an important part in discourse interpretation (whether dialogues
are concerned or not), hence when utterances have to be produced, the choice of the words that
connect these utterances (for example, in spoken dialogue) is essential for ensuring the com-
prehension of the illocutionary goals of the speakers. In computational linguistics, the issue
has been mitigated particularly in the context of monologue discourse interpretation, whereas
for dialogues, research is usually limited to establishing an almost one-to-one mapping between
rhetorical relations and cue words. In this paper we propose a mechanism for guiding concessive
connectors in dialogue, at the same time from a discourse and from a semantic point of view ;
each considered connector will be constrained via a set of conditions that take into account dis-
course coherence and the semantic relevance of each word concerned. Discourse constraints,
expressed in a formalism derived from SDRT (&#8220;Segmented Discourse Representation Theory&#8221;)
will be mapped to semantic constraints on the connectors ; these semantic constraints are pro-
posed by the Geneve linguistics school (Moeschler). Finally, the coherence of the discourse
resulted from the use of these connectors will be assessed.
</p>
<p>Mots-cl&#233;s : Dialogue homme-machine, coh&#233;rence discursive, connecteurs concessifs,
s&#233;mantique, pragmatique.
</p>
<p>Keywords: Human-computer dialogue, discourse coherence, concessive connectors, se-
mantics, pragmatics.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir Popescu, Jean Caelen
</p>
<p>1 Introduction
</p>
<p>Les connecteurs discursifs sont importants pour guider la compr&#233;hension des messages1 que les
locuteurs transmettent sous forme linguistique en dialoguant. Par cons&#233;quent, ils ont re&#231;u relati-
vement beaucoup d&#8217;attention dans les recherches en linguistique, surtout lorsque l&#8217;interpr&#233;tation
des &#233;nonc&#233;s est concern&#233;e (Ducrot, 1980), (Moeschler, 1989). En traitement automatique des
langues, les connecteurs sont regard&#233;s en g&#233;n&#233;ral de deux mani&#232;res diff&#233;rentes, selon les buts
assum&#233;s :
</p>
<p>&#8211; en analyse morpho-syntaxique et s&#233;mantique, les connecteurs ont souvent on r&#244;le mod&#233;r&#233;,
car, d&#8217;un c&#244;t&#233; ils subissent et imposent peu de contraintes aux niveaux morphologique et
syntaxique (voir par exemple, en fran&#231;ais, l&#8217;emploi du subjonctif du verbe, apr&#232;s bien que)
et, d&#8217;un autre c&#244;t&#233;, ils n&#8217;apportent rien &#224; la s&#233;mantique des &#233;nonc&#233;s, consid&#233;r&#233;e de mani&#232;re
v&#233;riconditionnelle et / ou isol&#233;e (Jurafsky &amp; Martin, 2000)2 ;
</p>
<p>&#8211; en interpr&#233;tation / analyse du discours (qui remonte surtout &#224; la prise en compte des aspects
pragmatiques de la langue), les connecteurs ont une place importante, car leur pr&#233;sence guide
le processus d&#8217;analyse (Mann &amp; Thomson, 1986).
</p>
<p>En g&#233;n&#233;ration du langage naturel, les connecteurs sont en g&#233;n&#233;ral consid&#233;r&#233;s comme les mani-
festations superficielles (c&#8217;est-&#224;-dire, au niveau de la r&#233;alisation de surface) des relations rh&#233;to-
riques qui relient des &#233;nonc&#233;s distincts pour constituer des discours (Reiter &amp; Dale, 2000) ; par
exemple, le connecteur &#8220;mais&#8221; mat&#233;rialise une relation de correction par rapport &#224; ce qui avait
&#233;t&#233; dit auparavant. De toutes fa&#231;ons, cette approche s&#8217;av&#232;re souvent insuffisante, car, comme
l&#8217;a montr&#233; Moeschler (Moeschler, 1989), les conditions d&#8217;emploi de chaque connecteur im-
pliquent souvent plusieurs &#233;nonc&#233;s, reli&#233;s de mani&#232;res assez diverses.
</p>
<p>De l&#8217;autre c&#244;t&#233;, au niveau computationnel, les propos de Moeschler doivent &#234;tre d&#233;velopp&#233;s
sous forme d&#8217;algorithmes, o&#249; les entr&#233;es et les sorties soient clairement pr&#233;cis&#233;es. A partir de
ce constat, cet article propose une formalisation computationnelle du choix des connecteurs
concessifs dans le cadre d&#8217;un module g&#233;n&#233;rique, con&#231;u pour le contr&#244;le pragmatique de la
g&#233;n&#233;ration du langage en dialogue oral homme-machine (Popescu et al., 2007).
</p>
<p>Au niveau th&#233;orique, la nouveaut&#233; de l&#8217;approche propos&#233;e dans cet article r&#233;side dans le fait
qu&#8217;&#224; la diff&#233;rence de Moeschler, qui, &#233;tant donn&#233; le connecteur, d&#233;duisait le sch&#233;ma s&#233;mantico-
pragmatique le plus pertinent et donc l&#8217;emploi du connecteur (causal ou argumentatif) (Moes-
chler, 1989), nous proposons de d&#233;duire le sch&#233;ma s&#233;mantico-pragmatique le plus pertinent &#224;
partir de la structure rh&#233;torique (SDRS - &#171; Segmented Discourse Representation Structure &#187;) du
dialogue et, par cons&#233;quent, choisir le connecteur qui satisfasse le mieux ce sch&#233;ma ; ainsi, la
coh&#233;rence du discours est &#233;galement prise en compte.
</p>
<p>Du point de vue applicatif, une telle d&#233;marche est utile lorsqu&#8217;il s&#8217;agit, pour la machine, de
produire des r&#233;pliques, &#224; partir d&#8217;expressions fig&#233;es &#224; trous, ce qui est une approche courante en
dialogue homme-machine finalis&#233; par la t&#226;che, &#233;tant donn&#233;es la facilit&#233; de l&#8217;impl&#233;mentation et
la vitesse d&#8217;ex&#233;cution ; les expressions fig&#233;es sont ensuite coll&#233;es via les connecteurs calcul&#233;s.
On g&#233;n&#232;re donc un ph&#233;nom&#232;ne de surface (les connecteurs discursifs concessifs) de mani&#232;re
motiv&#233;e du point de vue pragmatique et s&#233;mantique.
</p>
<p>1Le mot &#171; message &#187; est pris ici dans un sens &#233;largi, int&#233;grant la port&#233;e sp&#233;cifi&#233;e par la th&#233;orie de l&#8217;information
et les vis&#233;es illocutoires des sujets parlants.
</p>
<p>2Il y a toutefois des exceptions &#224; cette mani&#232;re de consid&#233;rer les connecteurs en analyse et en g&#233;n&#233;ration,
comme par exemple la th&#233;orie &#171; sens-texte &#187; de Mel&#8217;c&#780;uk (Reiter &amp; Dale, 2000).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration des connecteurs concessifs en dialogue
</p>
<p>Pour un &#233;tat de l&#8217;art concis sur ce sujet, on peut retenir, d&#8217;un c&#244;t&#233;, les d&#233;marches convergentes
avec celles deMoeschler, qui concernent seulement l&#8217;interpr&#233;tation des connecteurs du discours
ou, d&#8217;un autre c&#244;t&#233;, l&#8217;interpr&#233;tation des connecteurs surtout en termes de relations de discours,
soit dans la direction fix&#233;e par Marcu (Marcu, 2000), soit selon l&#8217;approche de Lascarides en
SDRT (Sporelander &amp; Lascarides, 2006). En ce qui concerne le choix des connecteurs en g&#233;-
n&#233;ration, des travaux repr&#233;sentatifs ont &#233;t&#233; poursuivis par Marcu, qui reliait les connecteurs
&#224; des relations discursives seulement (Marcu, 2000) ; donc, selon la terminologie de Moes-
chler, seul le &#171; cotexte &#187; &#233;tait pris en compte, en opposition avec le &#171; contexte &#187; s&#233;mantico-
pragmatique, qui l&#233;gitime ou bloque la production d&#8217;un connecteur, surtout lorsque le dialogue
oral est concern&#233;.
</p>
<p>Ici, &#224; partir de la structure rh&#233;torique (cotexte), nous calculons un contexte s&#233;mantico-pragma-
tique, qu&#8217;on filtre ensuite &#224; travers le cotexte du dialogue entier, et qui pilote le choix des
connecteurs. La section suivante constitue le c&#339;ur de l&#8217;article et pr&#233;sente les s&#233;mantiques des
connecteurs pragmatiques consid&#233;r&#233;s, aussi que les d&#233;tails formels et computationnels du m&#233;-
canisme pilotant le choix des connecteurs en g&#233;n&#233;ration ; ce m&#233;canisme sera ensuite &#233;valu&#233; de
mani&#232;re qualitative via un exemple typique de dialogue. La troisi&#232;me section conclut l&#8217;article
et pr&#233;sente des pistes pour continuer cette recherche.
</p>
<p>2 G&#233;n&#233;ration des connecteurs concessifs en dialogue
</p>
<p>2.1 Aper&#231;us s&#233;mantico-pragmatiques des connecteurs
</p>
<p>Les connecteurs discursifs marquant la concession ont &#233;t&#233; bien &#233;tudi&#233;s, surtout dans l&#8217;&#233;cole
genevoise de linguistique (Moeschler, Roulet, Rubattel, etc.) (Moeschler, 1989) ; ces travaux ont
abouti &#224; des mod&#233;lisations s&#233;mantiques formelles des connecteurs tels que mais, quand m&#234;me,
pourtant ou bien que. Dans ce paragraphe on donne un bref aper&#231;u d&#8217;une telle mod&#233;lisation, &#224;
partir de la pr&#233;sentation de (Moeschler, 1989).
</p>
<p>Pour cela, on consid&#232;re d&#8217;abord un ensemble de notations, utilis&#233;es tout au long de cet article :
</p>
<p>&#8211; &#945;, &#946;, ..., ::= &#233;tiquettes des &#233;nonc&#233;s dans le discours ;
&#8211; &#8727; ::= marque de connexion entre deux &#233;nonc&#233;s du discours ;
&#8211; TRUE, FALSE ::= les valeurs de v&#233;rit&#233; &#171; vrai &#187;, respectivement &#171; faux &#187; ;
&#8211; equals(&#945;, &#981;) ::= pr&#233;dicat binaire vrai ssi la variable &#945; est &#233;gale (c&#8217;est-&#224;-dire, unifi&#233;e) avec la valeur &#981; ;
&#8211; &#8658;, &#172;, &#8743;, &#8744; ::= connecteurs logiques ayant leur signification classique en logique (Gallier, 1986) ;
&#8211; &#8712;, 3, &#8834;, &#8835; ::= connecteurs ayant leur signification classique en th&#233;orie des ensembles ;
&#8211; &#8707;, &#8704; ::= quantificateurs logiques existentiel, respectivement universel ;
&#8211; K(&#945;) ::= fonction retournant la s&#233;mantique (en logique du premier ordre) de l&#8217;&#233;nonc&#233; &#945; ;
&#8211; &#965;(&#955;) ::= fonction retournant la valeur de v&#233;rit&#233; de la formule logique &#955; ; donc, d&#233;signant par &#923; l&#8217;ensemble des
</p>
<p>formules logiques d&#233;finissables pour un alphabet donn&#233;, on a que &#965; : &#923;&#8594; {TRUE,FALSE} ;
&#8211; cause(&#945;, &#946;) ::= pr&#233;dicat binaire vrai ssi la modification de contexte du discours, d&#233;termin&#233;e par l&#8217;&#233;nonc&#233; &#945;,
</p>
<p>est une cause suffisante pour l&#8217;ajout du contenu de l&#8217;&#233;nonc&#233; &#946; au contexte ;
&#8211; &#16; (&#945;, &#946;) ::= relation argumentative entre les &#233;nonc&#233;s &#945; et &#946;, vraie ssi un locuteur utilise l&#8217;&#233;nonc&#233; &#945; pour faire
</p>
<p>admettre le contenu propositionnel o&#249; les vis&#233;es illocutoires de l&#8217;&#233;nonc&#233; &#946; (Ducrot, 1980) ;
&#8211; &lt; ::= relation de force argumentative entre deux &#233;nonc&#233;s : &#945; &lt; &#946; ssi &#946; est plus pertinent pour son &#233;metteur
</p>
<p>(qui tente d&#8217;argumenter le contenu d&#8217;un autre &#233;nonc&#233;, soit-il &#947;) que &#945; (Moeschler, 1989) ;
&#8211; &#957;(&#945;, &#946;) ::= relation de norme, vraie ssi d&#8217;ordinaire &#945; implique &#946; ; la norme est donc une implication r&#233;visable
</p>
<p>selon le contexte ;
&#8211; smaller(&#966;, &#968;) ::= pr&#233;dicat binaire vrai ssi la valeur &#966; est inf&#233;rieure &#224; la valeur &#968; ;
&#8211; ClassOf(&#966;,&#934;) ::= pr&#233;dicat binaire vrai ssi l&#8217;&#233;l&#233;ment &#966; appartient &#224; l&#8217;ensemble &#934; ;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir Popescu, Jean Caelen
</p>
<p>&#8211; &#8744;&#772; ::= op&#233;ration logique de &#171; ou exclusif &#187;.
</p>
<p>Ainsi, (Moeschler, 1989) d&#233;finit deux types de concession, causale et argumentative qui se
particularisent pour chacun des connecteurs consid&#233;r&#233;s - mais, quand m&#234;me, pourtant ou bien
que. Par cons&#233;quent, (Moeschler, 1989) propose un ensemble de s&#233;mantiques pour ces quatre
connecteurs, dont on ne retient, de toutes fa&#231;ons, que les aspects &#8217;proc&#233;duraux&#8217;, car le but as-
sum&#233; dans cet article est de proposer un cadre op&#233;rationnel pour la g&#233;n&#233;ration de ces connec-
teurs en dialogue homme-machine.
</p>
<p>Ainsi, mais et quand m&#234;me se d&#233;finissent &#224; travers un &#171; carr&#233; argumentatif &#187; (d&#233;limit&#233; par trois
&#233;nonc&#233;s, &#945;, &#946; et &#947;), formalisable de mani&#232;re concise comme ci-dessous :
</p>
<p>1. mais peut &#234;tre employ&#233; de deux mani&#232;res, d&#233;sign&#233;es par mais1 (pour l&#8217;emploi de relation directe) et mais2
(pour l&#8217;emploi de relation indirecte) :
&#8211; &#945; mais1 &#172;&#947; ::= &#8707;&#946; :&#16; (&#945;, &#947;) &#8743; (&#947;&#8744;&#772;&#172;&#947;) &#8743; (&#945; &lt; &#946;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE)&#8743;&#16; (&#946;,&#172;&#947;) ;
</p>
<p>exemple : Il fait beau mais1 je ne sors pas . &#8211; &#945; est &#8217;il fait beau&#8217;, &#947; est &#8217;je sors&#8217; et &#946; est par exemple &#8217;je
ne me sens pas bien&#8217;.
</p>
<p>&#8211; &#945; mais2 &#946; ::= &#8707;&#947; :&#16; (&#945;, &#947;) &#8743; (&#947;&#8744;&#772;&#172;&#947;)&#8743;&#16; (&#946;,&#172;&#947;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) ;
exemple : Il fait beau mais2 j&#8217;ai mal &#224; la t&#234;te. &#8211; &#945; est &#8217;il fait beau&#8217;, &#946; est &#8217;j&#8217;ai mal &#224; la t&#234;te&#8217; et &#947; est par
exemple &#8217;je sors&#8217;.
</p>
<p>2. quand m&#234;me peut &#234;tre employ&#233; en relation directe seulement, ainsi :
</p>
<p>&#945; quand m&#234;me &#172;&#947; ::= &#8707;&#946; : &#957;(&#945;, &#947;) &#8743; (&#947;&#8744;&#772;&#172;&#947;)&#8743;&#16; (&#946;,&#172;&#947;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) ;
</p>
<p>exemple : Il fait beau. Je reste quand m&#234;me chez moi. &#8211; &#945; est &#8217;il fait beau&#8217;, &#946; est par exemple &#8217;j&#8217;ai mal &#224; la
t&#234;te&#8217; et &#947; est &#8217;je sors&#8217; .
</p>
<p>D&#8217;un autre c&#244;t&#233;, les connecteurs pourtant et bien que se d&#233;finissent &#224; travers un &#171; triangle
causal &#187; (d&#233;limit&#233; par deux &#233;nonc&#233;s, &#945; et &#946;), formalisable ainsi :
</p>
<p>1. pourtant peut &#234;tre employ&#233; de deux mani&#232;res, selon les deux permutations possibles du triangle causal
(Moeschler, 1989) :
&#8211; &#945; pourtant1 &#946; ::= cause(&#945;,&#172;&#946;) &#8743; (&#946;&#8744;&#772;&#172;&#946;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) ;
</p>
<p>exemple : Il pleut, pourtant1 je me balade dans le parc. &#8211; &#945; est &#8217;il pleut&#8217; et &#946;, &#8217;je me balade...&#8217;.
&#8211; &#945; pourtant2 &#946; ::= cause(&#946;,&#172;&#945;) &#8743; (&#945;&#8744;&#772;&#172;&#945;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) ;
</p>
<p>exemple : Je suis gentil avec lui, pourtant2 il me dit de gros mots toujours. &#8211; &#945; est &#8217;je suis gentil...&#8217; et &#946;,
&#8217;il me dit de gros mots...&#8217;.
</p>
<p>2. bien que peut &#233;galement &#234;tre employ&#233; de deux mani&#232;res, selon les permutations du triangle causal :
&#8211; bien que1 &#945;, &#946; ::= cause(&#945;,&#172;&#946;) &#8743; (&#946;&#8744;&#772;&#172;&#946;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) ;
</p>
<p>exemple : Bien qu&#8217;1 il fasse mauvais, je sors. &#8211; &#945; est &#8217;il fait mauvais&#8217; et &#946;, &#8217;je sors&#8217;.
&#8211; &#945; bien que2 &#946; ::= cause(&#946;,&#172;&#945;) &#8743; (&#945;&#8744;&#772;&#172;&#945;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) ;
</p>
<p>exemple : Je me balade dans le parc, bien qu&#8217;2 il pleuve. &#8211; &#945; est &#8217;je me balade...&#8217; et &#946;, &#8217;il pleut&#8217;.
</p>
<p>Dans ce paragraphe nous avons pr&#233;sent&#233; les s&#233;mantiques de quatre connecteurs concessifs,
mais, quand m&#234;me, pourtant et bien que, formalis&#233;es dans une approche qui s&#8217;inspire des tra-
vaux de l&#8217;&#233;cole genevoise (Moeschler, 1989). Pour une sp&#233;cification algorithmique du proces-
sus de g&#233;n&#233;ration de ces connecteurs, &#224; partir de leurs s&#233;mantiques, il y a au moins un point
&#224; am&#233;liorer dans les s&#233;mantiques pr&#233;sent&#233;es : on observe qu&#8217;au niveau formel il n&#8217;y a aucune
diff&#233;rence entre les s&#233;mantiques de pourtant et bien que. Comment savoir alors quel connecteur
produire, dans un contexte donn&#233; ? Pour l&#8217;interpr&#233;tation, Moeschler pr&#233;cise seulement que bien
que stipule une plus forte d&#233;termination causale entre ses arguments, par rapport &#224; pourtant
(Moeschler, 1989) ; donc, il faudra exprimer cette id&#233;e de mani&#232;re formelle, en tant que r&#232;gle
ou contrainte suppl&#233;mentaire agissant sur la s&#233;mantique de ce connecteur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration des connecteurs concessifs en dialogue
</p>
<p>2.2 Structure de discours et s&#233;mantique des connecteurs
</p>
<p>L&#8217;id&#233;e fondamentale de cet article est de &#171; calculer &#187; le connecteur le plus appropri&#233; en g&#233;n&#233;ra-
tion dialogique, par rapport au contexte s&#233;mantico-pragmatique de la conversation. Ainsi, pour
cela on part d&#8217;une repr&#233;sentation profonde du cotexte associ&#233; au dialogue, &#224; laquelle on ajoutera
des contraintes contextuelles.
</p>
<p>Nous supposons que le point de d&#233;part pour le calcul des connecteurs est une structure segmen-
t&#233;e de discours (SDRS), calcul&#233; en pr&#233;alable par un module de structuration rh&#233;torique (Popescu
et al., 2007). Cette structure de discours est calcul&#233;e dans le cadre d&#8217;une version adapt&#233;e de la
SDRT, pour la g&#233;n&#233;ration en dialogue (Popescu et al., 2007).
</p>
<p>Pour qu&#8217;on puisse utiliser cette structure rh&#233;torique dans le calcul des connecteurs, nous sp&#233;-
cifions une grammaire pour la repr&#233;senter, utilisant les informations fournies par le module
de structuration rh&#233;torique. Une telle grammaire suppose que les informations sur la SDRS
consistent en (i) le nombreD des &#233;nonc&#233;s connect&#233;s par des relations rh&#233;toriques, (ii) le nombre
R des relations rh&#233;toriques qui relient les &#233;nonc&#233;s, (iii) l&#8217;ensemble&#928; d&#8217;&#233;tiquettes pi des &#233;nonc&#233;s,
(iv) l&#8217;ensemble P des &#233;tiquettes des relations rh&#233;toriques3, (v) les formes logiquesK des &#233;non-
c&#233;s dans la structure de discours, (vi) les s&#233;mantiques (exprim&#233;es dans une logique du premier
ordre (Popescu et al., 2007)) &#931; des relations rh&#233;toriques dans la structure de discours. Cette
grammaire est pr&#233;sent&#233;e de mani&#232;re d&#233;taill&#233;e en (Popescu, 2007).
</p>
<p>En ce qui concerne l&#8217;ensemble possible des relations rh&#233;toriques qui relient des paires d&#8217;&#233;non-
c&#233;s (ou de sous-structures de discours), nous avons consid&#233;r&#233; 17 relations (Popescu et al.,
2007), du total de 35, pr&#233;cis&#233;es par la SDRT d&#8217;origine (Asher &amp; Lascarides, 2003) : (i) re-
lations dialogiques - Q-Elab (&#171; Question Elaboration &#187;), IQAP (&#171; Indirect Question-Answer
Pair &#187;), P-Corr (&#171; Plan Correction &#187;), P-Elab (&#171; Plan Elaboration &#187;), Backgroundq (&#171; Back-
ground Question &#187;), Elabq (&#171; Elaboration Question &#187;), Narrationq (&#171; Narration Question &#187;),
QAP (&#171; Question-Answer Pair &#187;), ACK (&#171; Acknowledgement &#187;) et NEI (&#171; Not Enough Infor-
mation &#187;) ; (ii) relations monologiques - Alternation, Background, Consequence, Elaboration,
Narration, Contrast et Parallel. Les s&#233;mantiques de toutes ces relations rh&#233;toriques sont simu-
l&#233;es dans une logique du premier ordre, pour plus d&#8217;efficacit&#233; computationnelle dans le contexte
des dialogues finalis&#233;s par la t&#226;che (Popescu et al., 2007) ; cette simulation conserve les s&#233;-
mantiques informelles des relations, en tant que pr&#233;cis&#233;es dans la SDRT d&#8217;origine (Asher &amp;
Lascarides, 2003).
</p>
<p>Pour relier cette structure rh&#233;torique aux sp&#233;cifications s&#233;mantiques des connecteurs concessifs
(pr&#233;sent&#233;es dans la section 2.1), on va transposer le carr&#233; argumentatif et le triangle causal qui
situent les quatre connecteurs consid&#233;r&#233;s, dans des contraintes de type rh&#233;torique ; pour cela, on
s&#8217;appuie sur les s&#233;mantiques des relations rh&#233;toriques, en tant que pr&#233;cis&#233;es en (Popescu et al.,
2007). Ainsi, nous proposons tout d&#8217;abord un ensemble de correspondances entre les relations
s&#233;mantiques sp&#233;cifiant les connecteurs et les relations rh&#233;toriques ; ces correspondances, pr&#233;-
sent&#233;es dans le tableau 1 sont motiv&#233;es &#233;galement par les d&#233;finitions de (Moeschler, 1989) et
par les sp&#233;cifications de (Asher &amp; Lascarides, 2003).
</p>
<p>S&#8217;appuyant sur ces correspondances, nous pourrons sp&#233;cifier les s&#233;mantiques des connecteurs,
en termes des relations de discours (et des connecteurs logiques usuels). Cependant, une obser-
vation pr&#233;alable s&#8217;impose : dans la section 2.1 il n&#8217;y avait pas de distinction s&#233;mantique formelle
entre pourtant et bien que ; de toutes fa&#231;ons, l&#8217;id&#233;e d&#8217;une plus forte d&#233;termination causale agen-
</p>
<p>3Les &#233;tiquettes des relations rh&#233;toriques sont identiques &#224; leurs noms (Asher &amp; Lascarides, 2003).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir Popescu, Jean Caelen
</p>
<p>TAB. 1 &#8211; Relations s&#233;mantiques (Moeschler) et relations rh&#233;toriques (Asher &amp; Lascarides)
Relation s&#233;mantique Relation rh&#233;torique
</p>
<p>&#8744;&#772;(&#945;, &#946;) Contrast(&#945;, &#946;) &#8743; (&#945; &#8744; &#946;)
cause(&#945;, &#946;) &#945;&#8658; &#946;
&#16; (&#945;, &#946;) Consequence(&#945;, &#946;)
&#957;(&#945;, &#946;) Background(&#945;, &#946;)
</p>
<p>c&#233;e par bien que peut &#234;tre formalis&#233;e via une contrainte suppl&#233;mentaire sur ce connecteur : que
le temps de l&#8217;action d&#233;crite par l&#8217;&#233;nonc&#233; qui succ&#232;de ce connecteur pr&#233;c&#232;de le temps de l&#8217;action
d&#233;crite par le deuxi&#232;me &#233;nonc&#233; sous l&#8217;incidence de ce connecteur. Au niveau logique cela sera
exprim&#233; via la fonction &#8710;(&#945;) qui pr&#233;cise (retourne) le temps de l&#8217;action d&#233;crite par l&#8217;&#233;nonc&#233;
libell&#233; &#945; ; cette fonction est cod&#233;e dans une ontologie de discours (Popescu et al., 2007).
</p>
<p>Ainsi, les s&#233;mantiques des connecteurs concessifs consid&#233;r&#233;s se formalisent, en termes rh&#233;to-
riques, comme ci-dessous :
</p>
<p>1. &#945; mais1 &#172;&#947; ::= &#8707;&#946; : Consequence(&#945;, &#947;)&#8743;Contrast(&#947;,&#172;&#947;)&#8743;Consequence(&#946;,&#172;&#947;)&#8743;equals(&#965;(K(&#945;)),TRUE)&#8743;equals(&#965;(K(&#946;)),
TRUE) &#8743; equals(&#965;(K(&#947;)),FALSE)&#8743; &lt; (&#945;, &#946;) ;
</p>
<p>2. &#945; mais2 &#946; ::= &#8707;&#947; : Consequence(&#945;, &#947;)&#8743;Contrast(&#947;,&#172;&#947;)&#8743;Consequence(&#946;,&#172;&#947;)&#8743;equals(&#965;(K(&#945;)),TRUE)&#8743;equals(&#965;(K(&#946;)),
TRUE) &#8743; equals(&#965;(K(&#947;)),FALSE) ;
</p>
<p>3. &#945; quand m&#234;me &#172;&#947; ::= &#8707;&#946; : Background(&#945;, &#947;) &#8743; Contrast(&#947;,&#172;&#947;) &#8743; Consequence(&#946;,&#172;&#947;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743;
equals(&#965;(K(&#946;)),TRUE) &#8743; equals(&#965;(K(&#947;)),FALSE) ;
</p>
<p>4. &#945; pourtant1 &#946; ::= (&#945;&#8658; &#172;&#946;) &#8743; Contrast(&#946;,&#172;&#946;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) ;
5. &#945; pourtant2 &#946; ::= (&#946; &#8658; &#172;&#945;) &#8743; Contrast(&#945;,&#172;&#945;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) ;
6. bien que1 &#945;, &#946; ::= (&#945;&#8658; &#172;&#946;) &#8743; Contrast(&#946;,&#172;&#946;) &#8743; equals(&#965;(K(&#945;)),TRUE) &#8743; equals(&#965;(K(&#946;)),TRUE) &#8743; smaller(&#8710;t(&#945;),
</p>
<p>&#8710;t(&#946;)) ;
</p>
<p>7. &#945; bien que2 &#946; ::= (&#946; &#8658; &#172;&#945;)&#8743;Contrast(&#945;,&#172;&#945;)&#8743;equals(&#965;(K(&#945;)),TRUE)&#8743;equals(&#965;(K(&#946;)),TRUE)&#8743;smaller(&#8710;t(&#946;),&#8710;t(&#945;)).
</p>
<p>Dans ces s&#233;mantiques, les &#233;nonc&#233;s non reli&#233;s par les connecteurs, mais intervenant dans les
contraintes sur ces derniers (&#947; ou &#946;, selon le cas) sont tir&#233;s soit du cotexte, soit du contexte :
</p>
<p>&#8211; si l&#8217;&#233;nonc&#233; en question est pr&#233;sent dans le discours, dans des tours de parole ant&#233;rieurs, on
s&#8217;appuie sur lui ;
</p>
<p>&#8211; sinon, on d&#233;duit cet &#233;nonc&#233; &#224; partir des &#233;nonc&#233;s ant&#233;rieurs et de l&#8217;ontologie de t&#226;che (Caelen
&amp; Xuereb, 2007) (le contexte), via un processus inf&#233;rentiel.
</p>
<p>Une derni&#232;re remarque &#224; l&#8217;&#233;gard des s&#233;mantiques des connecteurs concessifs (et du lien entre
celles-ci et la structure rh&#233;torique) concerne la relation &#171; &lt; /2 &#187;, de force argumentative, non
formalis&#233;e par Moeschler ou dans les sections ant&#233;rieures de cet article. Pour cela, on s&#8217;appuie
de mani&#232;re explicite sur le contexte du dialogue, posant qu&#8217;on peut avoir deux interlocuteurs,
l&#8217;&#233;metteur d&#8217;un &#233;nonc&#233; courant, d&#233;sign&#233; comme ci-dessus, par la fonction emitter/1 et l&#8217;alocu-
taire, d&#233;sign&#233; par &#172;emitter/1 ; par cons&#233;quent, il n&#8217;y a pas d&#8217;&#233;quivalence entre des expressions
du type &#8727;(&#172;emitter(&#945;), &#966;) et &#172; &#8727; (emitter(&#945;), &#966;), o&#249; &#171; &#8727; &#187; d&#233;signe un pr&#233;dicat binaire quel-
conque et &#171; &#966; &#187;, un terme quelconque. Ceci &#233;tant, nous posons comme hypoth&#232;se de travail
qu&#8217;un &#233;nonc&#233; dont le contenu fait une r&#233;f&#233;rence explicite &#224; son &#233;metteur a une force argumenta-
tive plus &#233;lev&#233;e par rapport &#224; un &#233;nonc&#233; qui ne le fait pas, ou qu&#8217;un &#233;nonc&#233; qui fait une r&#233;f&#233;rence
explicite &#224; l&#8217;alocutaire (donc, au destinataire) a une force argumentative plus &#233;lev&#233;e par rapport
&#224; un &#233;nonc&#233; dont le contenu ne fait r&#233;f&#233;rence ni &#224; cet alocutaire, ni &#224; l&#8217;&#233;metteur. Pr&#233;cisant que
deux &#233;nonc&#233;s dont la force argumentative est &#224; comparer ont le m&#234;me &#233;metteur, ces consignes
peuvent s&#8217;exprimer sous forme logique ainsi :
</p>
<p>&#945; &lt; &#946; ::= (ClassOf(emitter(&#946;),K(&#946;))&#8743;&#172;ClassOf(emitter(&#945;),K(&#945;)))&#8744;(ClassOf(&#172;emitter(&#946;),K(&#946;))&#8743;&#172;ClassOf(&#172;emitter(&#945;),K(&#945;))
&#8743; &#172;ClassOf(emitter(&#945;),K(&#945;))) &#8743; equals(emitter(&#945;), emitter(&#946;)) &#8743; equals(&#172;emitter(&#945;),&#172;emitter(&#946;)).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration des connecteurs concessifs en dialogue
</p>
<p>2.3 Choix des connecteurs : algorithme
</p>
<p>Le cadre pos&#233; dans le paragraphe pr&#233;cedent pour l&#8217;expression s&#233;mantique, amend&#233;e par la struc-
ture rh&#233;torique, des connecteurs concessifs en dialogue sera mis en valeur via une proc&#233;dure
con&#231;ue pour g&#233;n&#233;rer les connecteurs appropri&#233;s, lorsqu&#8217;il s&#8217;agit, pour la machine, de produire
un &#233;nonc&#233; dialogique.
</p>
<p>Les entr&#233;es dans cette procedure consistent en (i) la structure rh&#233;torique du dialogue &#171; courant &#187;
(c&#8217;est-&#224;-dire, int&#233;grant aussi la s&#233;mantique de la r&#233;plique cens&#233;e &#234;tre g&#233;n&#233;r&#233;e par la machine et
donc, &#233;ventuellement, contenir un ou plusieurs connecteurs concessifs), (ii) les s&#233;mantiques
des connecteurs (sp&#233;cifi&#233;es sous forme de r&#232;gles), (iii) l&#8217;ontologie de discours (sp&#233;cifi&#233;e sous
forme d&#8217;arbre hi&#233;rarchique (Popescu et al., 2007)) et (iv) l&#8217;ontologie de t&#226;che pour les dialogues
(sp&#233;cifi&#233;e, &#224; l&#8217;instar de l&#8217;ontologie de discours, sous forme de hi&#233;rarchie de concepts (Caelen &amp;
Xuereb, 2007)).
</p>
<p>La sortie de cette procedure consiste en un ensemble de connecteurs qui peuvent relier les
&#233;nonc&#233;s dans la r&#233;plique courante de la machine ; cette liste peut &#233;ventuellement &#234;tre vide, mais
dans le cas contraire, chaque entr&#233;e dans cette liste a trois &#233;l&#233;ments : (i) le connecteur choisi,
(ii) son &#171; argument gauche &#187; et (iii), son argument droit ; donc une entr&#233;e type est de la forme :
(&#8727;, pii, pij), ce qui correspondra &#224; une forme de surface du type pii &#8727; pij , o&#249; &#8727; est le connecteur
et pii et pij , les libell&#233;s de deux &#233;nonc&#233;s. Donc, la proc&#233;dure est sp&#233;cifi&#233;e ci-dessous :
</p>
<p>1. initialiser la liste des connecteurs : &#923;&#8592; &#8709; ;
2. lire la structure de discours courante, S(D,R, P,&#928;) (cf. &#167;2.2) ;
3. lire les &#233;tiquettes des &#233;nonc&#233;s &#224; &#234;tre g&#233;n&#233;r&#233;s par la machine, &lt; pi &gt;, avec &lt; pi &gt;&#8834; &#928; et | &lt; pi &gt; | &lt; D ;
4. trier l&#8217;ensemble &lt; pi &gt; par rapport &#224; l&#8217;ordre d&#8217;apparition des &#233;nonc&#233;s (ordre sp&#233;cifi&#233; par le composant de
</p>
<p>structuration rh&#233;torique (Popescu et al., 2007)) ;
</p>
<p>5. pour chaque &#233;nonc&#233; pi_ dans &lt; pi &gt; :
(a) rep&#233;rer les relations rh&#233;toriques connectant l&#8217;&#233;nonc&#233; pi_ &#224; des &#233;nonc&#233;s dans S ; soient ces relations
</p>
<p>sp&#233;cifi&#233;es par l&#8217;ensemble &lt; &#961; &gt;pi_&#8834; P , avec | &lt; &#961; &gt;pi_ | &lt; R ;
(b) rep&#233;rer les arguments gauches des relations dans l&#8217;ensemble &lt; &#961; &gt;pi_ ; soient ces arguments sp&#233;ci-
</p>
<p>fi&#233;s par l&#8217;ensemble &lt; &#947; &gt;pi_&#8834; &#928;, avec | &lt; &#947; &gt;pi_ | &lt; D ;
(c) pour chaque s&#233;mantique &#958; des connecteurs (&#958; &#8712; &#926;, avec |&#926;| = 7, car il y a 7 connecteurs possibles) :
</p>
<p>i. apparier(&#958;, pi_, (&lt; &#961; &gt;pi_, &lt; &#947; &gt;pi_)) ;
ii. si OK, alors &#923;&#8592; &#923; &#8746; (&#958;, pi&#958;, pi_) ;
iii. sinon, alors &#923;&#8592; &#955; &#8746; &#8709; ;
</p>
<p>6. si |(&#8727;, pi&#958;, pi_)| &gt; 1 (la proc&#233;dure apparier retourne plusieurs connecteurs entre deux &#233;nonc&#233;s), alors :
(a) s&#8217;il existe un connecteur qui a un maximum de contraintes, alors garder celui-ci et enlever le reste
</p>
<p>(par exemple, entre pourtant et bien que, garder le dernier et enlever le premier) ;
</p>
<p>(b) sinon, s&#8217;il existe un connecteur qui assure un nombre maximal de relations rh&#233;toriques, c&#8217;est-&#224;-dire,
qui contient un nombre maximal de relations rh&#233;toriques diff&#233;rentes dans ses contraintes, alors :
</p>
<p>i. si les s&#233;mantiques des connecteurs ne m&#232;nent pas &#224; une contradiction logique, alors garder
tous ces connecteurs ;
</p>
<p>ii. sinon, alors garder celui-ci et enlever le reste (par exemple, entre mais et quand m&#234;me, garder
le dernier et enlever le premier, car celui-ci contient deux relations rh&#233;toriques diff&#233;rentes,
Consequence et Contrast, tandis que le dernier en contient trois - les deux qui viennent d&#8217;&#234;tre
pr&#233;cis&#233;es, auxquelles Background s&#8217;ajoute) ;
</p>
<p>(c) sinon, alors choisir de mani&#232;re al&#233;atoire un des connecteurs (cette situation est peu probable, &#233;tant
donn&#233;es les s&#233;mantiques des connecteurs et leur utilisation) ;
</p>
<p>7. retourner &#923;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir Popescu, Jean Caelen
</p>
<p>Le noyau de l&#8217;algorithme consiste dans la proc&#233;dure apparier/3, qui prend en entr&#233;e la s&#233;man-
tique d&#8217;un connecteur, (l&#8217;&#233;tiquette d&#8217;) un &#233;nonc&#233; qui constituera l&#8217;argument droit du connecteur
et une structure form&#233;e de deux ensembles : un ensemble de relations rh&#233;toriques (cens&#233;es
avoir pi_ en tant qu&#8217;argument droit) et, respectivement, un ensemble d&#8217;&#233;nonc&#233;s (cens&#233;s &#234;tre les
arguments gauches des relations rh&#233;toriques). La sortie de la proc&#233;dure apparier est constitu&#233;e
d&#8217;une structure qui contient la s&#233;mantique d&#8217;un connecteur, son argument gauche et, respecti-
vement, son argument droit (qui est cens&#233; &#234;tre justement l&#8217;&#233;nonc&#233; pi_ lu en entr&#233;e) :
</p>
<p>1. initialiser trois listes : &#928; &#8592; &#8709;, P &#8592; &#8709;, C &#8592; &#8709; ; ces listes contiendront, respectivement, des &#233;tiquettes
d&#8217;&#233;nonc&#233;s, des &#233;tiquettes de relations rh&#233;toriques, et des connecteurs logiques ;
</p>
<p>2. pour chaque terme dans la s&#233;mantique &#958; du connecteur, le classer dans une des cat&#233;gories suivantes : (i)
&#233;tiquettes d&#8217;&#233;nonc&#233;s, (ii) relations de discours, (iii) connecteurs logiques ;
</p>
<p>3. par cons&#233;quent, actualiser les listes &#928;, P et C ;
4. si P &#8834;&lt; &#961; &gt;pi_, alors :
</p>
<p>(a) unifier les termes dans &#928; qui sont les arguments des termes en P , avec les termes en &lt; &#947; &gt;pi_ qui
sont les arguments des termes en P&#8745; &lt; &#961; &gt;pi_ ;
</p>
<p>(b) pour chaque connecteur logique enC, v&#233;rifier si celui-ci peut &#234;tre plac&#233; entre des entit&#233;s en&lt; &#961; &gt;pi_
&#8745;P et &lt; &#947; &gt;pi_ &#8745;&#928;, afin que :
&#8211; la succession des termes et connecteurs soit identique &#224; celle sp&#233;cifi&#233;e en &#958;, &#224; part les unifications
</p>
<p>de l&#8217;&#233;tape 4.(a) ;
&#8211; la forme logique r&#233;sult&#233;e (en &#233;tendant les &#233;nonc&#233;s &#224; leurs s&#233;mantiques, exprim&#233;es via des pr&#233;dicats
</p>
<p>dans l&#8217;ontologie de t&#226;che, selon les d&#233;tails pr&#233;cis&#233;s en (Popescu et al., 2007)) ne m&#232;ne pas &#224;
l&#8217;ensemble vide (c&#8217;est-&#224;-dire, &#224; une contradiction) ;
</p>
<p>cette &#233;tape repr&#233;sente en fait la r&#233;solution de la formule logique obtenue de &#958;, en substituant les
&#233;nonc&#233;s par des &#233;nonc&#233;s dans la structure de discours en entr&#233;e, pourvu qu&#8217;on pr&#233;serve les arguments
des relations rh&#233;toriques ;
</p>
<p>(c) si OK, alors retourner OK, (&#958;, pi&#958;, pi_) ;
(d) sinon, alors retourner KO ;
</p>
<p>5. sinon, alors retourner KO.
</p>
<p>2.4 Tra&#231;age sur une situation de dialogue
</p>
<p>Nous d&#233;montrons l&#8217;op&#233;ration des algorithmes propos&#233;s en &#167;2.3 sur un fragment de dialogue
typique entre le syst&#232;me et un client, o&#249; la machine est une biblioth&#233;caire virtuelle. Ainsi, d&#233;si-
gnant par U le client (l&#8217;usager), parM , la machine, et par l&#8217;indice sup&#233;rieur piij , l&#8217;&#233;tiquette du
j-&#232;me &#233;nonc&#233; dans le i-&#232;me tour de parole, le dialogue est montr&#233; ci-dessous (les connecteurs
ont &#233;t&#233; mis en italiques) :
</p>
<p>U : Excusez-moipi11 , pourrais-je emprunter ce bouquin ?pi12
</p>
<p>M : Monsieur, vous ne pouvez emprunter que trois livres &#224; la foispi21 , mais je ferai quand m&#234;me une
exception cette fois-ci.pi22
</p>
<p>U : Merci beaucoup !pi31 Alors, je vous donne ma carte ?pi32
</p>
<p>M : Bonpi41 , bien que vous ayez d&#233;j&#224; gard&#233; un livre il y a deux moispi42 , je vous en pr&#234;te maintenant
quatrepi43 ; pourtant, vous n&#8217;avez pas l&#8217;air plus attentif en ce moment...pi44
</p>
<p>Les &#233;nonc&#233;s de M sont disponibles sous forme logique, en tant que fournis par le contr&#244;-
leur de dialogue (Caelen &amp; Xuereb, 2007), (Popescu et al., 2007), tandis que ceux de U , sous
forme linguistique ; &#224; partir de ces derniers, l&#8217;analyseur s&#233;mantique calcule, pour ces &#233;nonc&#233;s,
les formes logiques correspondantes, auxquelles l&#8217;interpr&#233;teur pragmatique attache les infor-
mations concernant le type d&#8217;acte de langage v&#233;hicul&#233; par chaque contribution dialogique de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#233;n&#233;ration des connecteurs concessifs en dialogue
</p>
<p>l&#8217;usager (Caelen &amp; Xuereb, 2007). A partir de ces informations, le composant de structuration
rh&#233;torique dans le module de g&#233;n&#233;ration calcule la SDRS qui int&#232;gre les formes logiques des
&#233;nonc&#233;s cens&#233;s &#234;tre r&#233;alis&#233;s sous forme linguistique par M (Popescu et al., 2007). Ainsi, pour
le fragment de dialogue consid&#233;r&#233;, la SDRS calcul&#233;e est exprim&#233;e, sous forme synth&#233;tique,
ci-dessous :
</p>
<p>Elaboration(pi11, pi12) &#8743; P-Corr(pi12, pi21) &#8743; Consequence(pi21,&#172;pi22) &#8743; ACK(pi22, pi31) &#8743; Consequence(pi31, pi32) &#8743; ACK(pi32, pi41) &#8743;
P-Elab(pi22, pi43) &#8743; Consequence(pi42,&#172;pi43) &#8743; Consequence(pi43,&#172;pi44) &#8743; Narration(pi42, pi44).
</p>
<p>Les relations de discours ont &#233;t&#233; calcul&#233;es entre des paires d&#8217;&#233;nonc&#233;s et m&#234;me entre des paires
dont un &#233;l&#233;ment est un &#233;nonc&#233; sous forme ni&#233;e ; cela est utile pour faire la correspondance
entre des fragments de cette SDRS et les s&#233;mantiques des connecteurs. Ainsi, pour la premi&#232;re
r&#233;plique de la machine, entre les &#233;nonc&#233;s pi21 et pi22 la proc&#233;dure apparier retourne les &#233;l&#233;-
ments (mais, pi21, pi22) et (quand m&#234;me, pi21, pi22), puisque, pour mais on retrouve les contraintes
Consequence(pi21,&#172;pi22) &#8743; Contrast(pi22,&#172;pi22) &#8743; equals(&#965;(K(pi21)),TRUE) &#8743;
equals(&#965;(K(&#172;pi21)),FALSE) et l&#8217;&#233;nonc&#233; &#171; manquant &#187; &#946; est retrouv&#233; en tant que &#8217;vous ne
pouvez pas emprunter ce livre&#8217; qui est d&#233;duit par modus ponens (Gallier, 1986) &#224; partir de pi21
et du fait (connu par le syst&#232;me &#224; travers son ontologie de t&#226;che) que U a d&#233;j&#224; emprunt&#233; trois
livres qu&#8217;il n&#8217;a pas encore rendus ; pour quand m&#234;me est d&#233;duit via les m&#234;mes contraintes que
ci-dessus, auxquelles s&#8217;ajoute la contrainte Background(pi21,&#172;pi22), d&#233;duite par modus ponens
du fait que U a d&#233;j&#224; emprunt&#233; trois livres et que, par d&#233;faut, selon le r&#232;glement, la biblioth&#232;que
ne pr&#234;te pas plus de trois livres &#224; la fois. Dans ce contexte, on a trois choix : (i) supprimer mais,
(ii) supprimer quand m&#234;me, (iii) garder les deux connecteurs ; selon l&#8217;algorithme dans &#167;2.3 nous
devrions adopter un des choix (ii) ou (iii). Du fait que (iii) ne m&#232;ne &#224; aucune contradiction lo-
gique, nous l&#8217;adoptons, car ainsi nous augmentons la pertinence illocutoire de la contribution
langagi&#232;re deM . De toutes fa&#231;ons, pour pouvoir garder mais on doit v&#233;rifier la satisfaction de
&lt; (pi21, &#946;), ce qui est vrai puisque pi21 exprime une v&#233;rit&#233; g&#233;n&#233;rale - &#8217;on peut emprunter au plus
trois livres &#224; la fois&#8217;, tandis que &#946; exprime un fait reli&#233; &#224;U , donc :ClassOf(&#172;emitter(&#946;), K(&#946;)).
La deuxi&#232;me contribution de la machine est trait&#233;e de mani&#232;re similaire : entre les &#233;nonc&#233;s
pi42 et pi43 la proc&#233;dure apparier retourne (bien que, pi42, pi43) et (pourtant, pi42, pi43), puisqu&#8217;on
retrouve la contrainte pi42 &#8658; &#172;pi43, d&#233;duite de la relation Consequence(pi42,&#172;pi43) et du fait,
pr&#233;sent dans l&#8217;ontologie de t&#226;che, que si un client avait perdu un document, la biblioth&#232;que serait
devenue plus stricte avec celui-ci, ce qui n&#8217;est pas compatible avec la concession de pr&#234;ter plus
de documents que le r&#232;glement pr&#233;voit, &#224; cet usager (quatre livres, au lieu de trois) ; toutefois,
on en retient seulement bien que, car, selon l&#8217;algorithme dans &#167;3.2, ce connecteur est d&#233;fini
par plus de contraintes : &#224; partir de K(pi42) et de K(pi43) (les s&#233;mantiques des &#233;nonc&#233;s pi43 et
pi44) on d&#233;duit smaller(&#8710;t(pi42),&#8710;t(pi43)). Par contre, pour les &#233;nonc&#233;s pi43 et pi44, la proc&#233;dure
apparier, op&#233;rant &#224; l&#8217;instar du cas pr&#233;c&#233;dent, ne retourne quand m&#234;me que pourtant, car, du fait
que le temps de ces deux &#233;nonc&#233;s est le m&#234;me (le pr&#233;sent), on a que equals(&#8710;t(pi43),&#8710;t(pi44)),
donc les contraintes pour bien que ne sont pas satisfaites.
</p>
<p>3 Conclusion
</p>
<p>Dans cet article nous avons propos&#233; un cadre pour contr&#244;ler la g&#233;n&#233;ration des connecteurs
concessifs afin de mieux structurer les r&#233;pliques de la machine en dialogue avec les utilisa-
teurs. Le m&#233;canisme propos&#233; pour g&#233;n&#233;rer mais, quand m&#234;me, pourtant et bien que s&#8217;articule
d&#8217;une part autour d&#8217;une description s&#233;mantique de ces connecteurs, d&#233;riv&#233;e de celle propos&#233;e</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vladimir Popescu, Jean Caelen
</p>
<p>par (Moeschler, 1989) et, d&#8217;une autre part, autour d&#8217;un ensemble de sp&#233;cifications pragmatiques
dans une proc&#233;dure computationnelle. Ainsi, l&#8217;efficacit&#233; de ce cadre a &#233;t&#233; d&#233;montr&#233;e sur un frag-
ment typique de dialogue homme-machine autour d&#8217;une application particuli&#232;re - la r&#233;servation
de documents dans une biblioth&#232;que. Toutefois, les d&#233;marches propos&#233;es sont g&#233;n&#233;riques, voire
ind&#233;pendantes du domaine d&#8217;application et param&#233;trables par rapport &#224; celui-ci.
</p>
<p>Cette recherche devrait &#234;tre continu&#233;e &#224; plusieurs niveaux : (i) l&#8217;ensemble des connecteurs de-
vrait &#234;tre &#233;tendu &#224; d&#8217;autres, comme parce que, puisque, car, d&#8217;ailleurs, etc. ; (ii) le m&#233;canisme
devrait &#234;tre &#233;tendu au cas du dialogue &#224; plusieurs locuteurs, ce qui reviendrait dans un premier
temps &#224; la modification de la s&#233;mantique de la relation de force argumentative &lt; : les inter-
locuteurs de la machine ne sont plus r&#233;duits &#224; &#172;emitter() ; du fait que plusieurs interlocuteurs
interviennent, on peut avoir un ensemble plus large de situations concernant la force argumen-
tative : par exemple un &#233;nonc&#233; dont l&#8217;action implique un locuteur plus haut du point de vue
hi&#233;rarchique ou plus actif en conversation peut &#234;tre plus pertinent du point de vue argumentatif
qu&#8217;un autre &#233;nonc&#233; impliquant son &#233;metteur... ; (iii) une fois r&#233;alis&#233;es les extensions au dialogue
&#224; plusieurs, ce m&#233;canisme devra &#234;tre &#233;valu&#233; de mani&#232;re statistique sur des dialogues r&#233;els.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation. United Kingdom : Cambridge
University Press.
</p>
<p>CAELEN J. &amp; XUEREB A. (2007). Interaction et pragmatique - jeux de dialogue et de lan-
gage. Paris : Herm&#232;s Science.
</p>
<p>DUCROT O. (1980). Les mots du discours. Paris : Editions du Minuit.
</p>
<p>GALLIER J. (1986). Logic for Computer Science. New York : Wiley.
</p>
<p>JURAFSKY D. &amp; MARTIN J. H. (2000). Speech and Language Processing. New Jersey :
Prentice Hall.
</p>
<p>MANN W. C. &amp; THOMSON S. A. (1986). Rhetorical Structure Theory : description and
construction of text structures. Nijmegen, The Netherlands : Information Sciences Institute.
</p>
<p>MARCU D. (2000). The Rhetorical Parsing, Summarization and Generation of Natural Lan-
guage Texts. Canada : Ph D Thesis, University of Toronto.
</p>
<p>MOESCHLER J. (1989). Mod&#233;lisation du dialogue - repr&#233;sentation de l&#8217;inf&#233;rence argumenta-
tive. Paris : Herm&#232;s Science.
</p>
<p>POPESCU V. (2007). Pronominal anaphora generation in human-computer dialogue, using
a semantic-pragmatic approach. In Proceedings of the Doctoral Consortium at the FoLLI
Summer School EUROLAN, Iasi, Romania : &#8220;Al. I Cuza&#8221; University Press.
</p>
<p>POPESCU V., CAELEN J. &amp; BURILEANU C. (2007). First-order logic rhetorical structuring
for natural language generation in human-computer dialogue. In Lecture Notes in Computer
Science 4629, Heidelberg : Springer.
</p>
<p>REITER E. &amp; DALE R. (2000). Building Natural Language Generation Systems. United
Kingdom : Cambridge University Press.
</p>
<p>SPORELANDER C. &amp; LASCARIDES A. (2006). Using automatically labelled examples to
classify rhetorical relations : an assessment. In Journal of Natural Language Engineering,
United Kingdom : Cambridge University Press.</p>

</div></div>
</body></html>