<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mod&#233;lisation normalis&#233;e LMF des dictionnaires &#233;lectroniques &#233;ditoriaux de l&#8217;arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p> 
 
</p>
<p>Mod&#233;lisation normalis&#233;e LMF des dictionnaires              
&#233;lectroniques &#233;ditoriaux de l&#8217;arabe  
</p>
<p>Feten BACCAR (1), A&#239;da KHEMAKHEM (1), Bilel GARGOURI (1),                           
Kais HADDAR (2), Abdelmajid BEN HAMADOU (3) 
</p>
<p> 
</p>
<p>Laboratoire MIRACL  
</p>
<p>(1) FSEGS, B.P. 1088, 3018 Sfax, Tunisie  
baccarf@yahoo.fr  aida_khemakhem@yahoo.fr  bilel.gargouri@fsegs.rnu.tn 
</p>
<p>(2) FSS,  B.P.  802,  3038  Sfax,  Tunisie      
kais.haddar@fss.rnu.tn 
</p>
<p>(3) ISIMS, B.P. 242, 3021 Sakiet-Ezzit Sfax, Tunisie 
          abdelmajid.benhamadou@isimsf.rnu.tn 
</p>
<p>R&#233;sum&#233;  
Le pr&#233;sent papier s&#8217;int&#233;resse &#224; l&#8217;&#233;laboration des dictionnaires &#233;lectroniques arabes &#224; usage 
&#233;ditorial. Il propose un mod&#232;le unifi&#233; et normalis&#233; de ces dictionnaires en se r&#233;f&#233;rant &#224; la 
future norme LMF (Lexical Markup Framework) ISO 24613. Ce mod&#232;le permet de construire 
des dictionnaires extensibles, sur lesquels on peut r&#233;aliser, gr&#226;ce &#224; une structuration fine et 
standard, des fonctions de consultation g&#233;n&#233;riques adapt&#233;es aux besoins des utilisateurs. La 
mise en &#339;uvre du mod&#232;le propos&#233; est test&#233;e sur des dictionnaires existants de la langue arabe 
en utilisant, pour la consultation, le syst&#232;me ADIQTO (Arabic DIctionary Query TOols) que 
nous avons d&#233;velopp&#233; pour l&#8217;interrogation g&#233;n&#233;rique des dictionnaires normalis&#233;s de l&#8217;arabe.   
</p>
<p>Abstract  
This paper is interested in the development of the Arabic electronic dictionaries of human use. 
It proposes a unified and standardized model for these dictionaries according to the future 
standard LMF (Lexical Markup Framework) ISO 24613. Thanks to its subtle and 
standardized structure, this model allows the development of extendable dictionaries on 
which generic interrogation functions adapted to the user&#8217;s needs can be implemented. This 
model has already been carried out on some existing Arabic dictionaries using the ADIQTQ 
(Arabic DIctionary Query Tool) system, which we developed for the generic interrogation of 
standardized dictionaries of Arabic. 
</p>
<p>Mots-cl&#233;s : Dictionnaire &#233;lectronique Arabe, usage &#233;ditorial, mod&#232;le normalis&#233;, LMF, 
interrogation g&#233;n&#233;rique 
</p>
<p>Keywords: Arabic electronic dictionary, human use, standardized model, LMF, generic 
interrogation   </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F. BACCAR, A. KHEMAKHEM, B. GARGOURI, K. HADDAR et A. BEN HAMADOU 
</p>
<p> 
 
</p>
<p>1 Introduction 
L&#8217;av&#232;nement de l&#8217;outil informatique et la prolif&#233;ration des moyens de communication ont 
chang&#233; nos modes de stockage et d&#8217;acc&#232;s aux informations. De ce fait, les dictionnaires 
&#233;lectroniques &#224; usage humain (ou &#233;ditorial) se trouvent lib&#233;r&#233;s des contraintes de leurs 
versions papiers et r&#233;pondent &#224; un certain nombre de besoins pratiques d&#8217;actualisation et 
d&#8217;exploitation pour une population h&#233;t&#233;rog&#232;ne d&#8217;utilisateurs (i.e., les apprenants, les experts 
journalistes ou &#233;crivains et les chercheurs en linguistique) (Dendien &amp; Pierrel, 2003), 
(Wooldridge, 1998), et (Arregi &amp; al, 2002). Sur cette lanc&#233;e, plusieurs dictionnaires 
&#233;lectroniques &#224; usage humain sont aujourd&#8217;hui disponibles sur le Web et/ou commercialis&#233;s 
sur des CD-ROM, notamment pour les langues occidentales.   
</p>
<p>Les travaux d&#8217;informatisation des dictionnaires occidentaux ont d&#233;but&#233; depuis quelques 
d&#233;cennies. L&#8217;objectif &#233;tait de faire b&#233;n&#233;ficier les utilisateurs d&#8217;une aide &#233;minemment 
pr&#233;cieuse, dans la mesure o&#249; ces dictionnaires &#233;lectroniques permettent un acc&#232;s s&#233;lectif et 
rapide aux informations. Ces services consistent, notamment, &#224; retrouver un mot par son 
orthographe approximative, extraire une liste de termes sp&#233;cialis&#233;s se rapportant &#224; un 
domaine, rechercher une liste de mots sur des crit&#232;res autres qu'alphab&#233;tiques, etc. Parmi les 
dictionnaires &#233;lectroniques occidentaux, nous citons ici  quelques exemples pour les langues 
fran&#231;aise et anglaise : le Tr&#233;sor de la Langue Fran&#231;aise informatis&#233; (TLFi) 
[http://ww.atilf.fr/tlfi], le Dictionnaire de l&#8217;Acad&#233;mie Fran&#231;aise 
[http://www.atilf.fr/academie9], le Nouveau Petit Robert &#233;lectronique, le Bibliorom Larousse, 
Oxford English Dictionary [http://www.oed.com] et Collins Electronic English Dictionary &amp; 
Thesaurus. 
</p>
<p>Par ailleurs, la diversit&#233; structurale des ressources dictionnairiques disponibles a rendu 
l&#8217;&#233;change et la fusion de leurs donn&#233;es incontestablement difficiles et complexes. De toute 
&#233;vidence, une repr&#233;sentation lexicale unifi&#233;e et normalis&#233;e est n&#233;cessaire et pr&#233;alable &#224; toute 
exploitation de ces ressources hors de leur propre contexte de conception (Francopoulo, 
2004). Ainsi, deux principales propositions de standardisation de dictionnaires &#233;lectroniques 
ont vu le jour, &#224; savoir  la TEI (Text Encoding Initiative) (Sperberg-Mcqueen &amp; Burnard, 
2005) et LMF (Lexical Markup Framework) (Francopoulo &amp; George, 2008).        
</p>
<p>De ces travaux et r&#233;alisations, la langue arabe n&#8217;a pas pu profiter pleinement.  L&#8217;&#233;laboration 
de dictionnaires &#233;lectroniques arabes, notamment &#224; usage humain, est dans une phase qu&#8217;on 
peut qualifier de primaire. En effet, il appert que la quasi-totalit&#233; des dictionnaires 
&#233;lectroniques arabes disponibles ne sont rien d&#8217;autre qu&#8217;une num&#233;risation de fonds 
dictionnairiques (sous format : &quot;.doc&quot;, &quot;.pdf&quot; ou &quot;.html&quot;), non structur&#233;es et peu b&#233;n&#233;fiques 
(Ait Taleb, 2005). Par ailleurs, les outils de consultation accompagnant ces dictionnaires 
offrent un seul type de recherche qualifi&#233; de primitif  (recherche de mots vedettes dans un ou 
plusieurs dictionnaires) comme le prouvent les r&#233;alisations des projets les plus connus Ajeeb 
du syst&#232;me Sakhr [http://lexicons.ajeeb.com/Results.asp], Alburaq [http://www.alburaq.net/], 
Kalimet [http://www.kl28.com/lesanalarab.php] et LisanElArab/Al-Qamous-Al-Mouhit 
[http://www.content.com.sa/Languages/]. Ces limites d&#8217;interrogation sont dues, 
principalement, &#224; une faiblesse de structuration des entr&#233;es dictionnairiques utilis&#233;es. 
</p>
<p>Devant ces limites, et en vue de donner &#224; cette langue la place qui lui convient en tant que 
langue v&#233;hiculaire, nous proposons une mod&#233;lisation LMF pour l&#8217;&#233;laboration de dictionnaires 
arabes &#233;ditoriaux extensibles et incr&#233;mentaux (possibilit&#233; d&#8217;ajouter des entr&#233;es et des 
descriptions au sein des entr&#233;es). Cette mod&#233;lisation permettra de profiter de la richesse de la 
langue arabe en unifiant ce qui existe avec une structure &#233;volutive et aussi fine que possible, &#224; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation normalis&#233;e LMF des dictionnaires &#233;lectroniques &#233;ditoriaux de l&#8217;arabe  
</p>
<p> 
 
</p>
<p>partir de laquelle, il est possible de r&#233;aliser des fonctions de consultation g&#233;n&#233;riques et 
adapt&#233;es aux besoins vari&#233;s des utilisateurs.   
</p>
<p>Dans cet article, nous commen&#231;ons par pr&#233;senter les principales caract&#233;ristiques des 
dictionnaires de l&#8217;arabe, en insistant notamment sur leurs sp&#233;cificit&#233;s structurelles. Ensuite 
nous argumentons le choix de la mod&#233;lisation LMF pour l&#8217;&#233;laboration de dictionnaires 
&#233;lectroniques arabes &#224; usage humain. Puis, nous d&#233;taillons le mod&#232;le normalis&#233; que nous 
proposons. Enfin, nous d&#233;crivons une mise en &#339;uvre informatique et une exp&#233;rimentation du 
mod&#232;le partant de la normalisation du dictionnaire &#233;ditorial El-Ghani &#171; &#1617;&#1610;&#1606;&#1594;&#1604;&#1575; &#187; et d&#8217;un 
ensemble d&#8217;extraits relatifs &#224; d&#8217;autres dictionnaires. L&#8217;interrogation est r&#233;alis&#233;e par le syst&#232;me 
ADIQTO (Arabic DIctionary Query TOols) que nous avons d&#233;velopp&#233; pour l&#8217;interrogation 
g&#233;n&#233;rique des dictionnaires normalis&#233;s de l&#8217;arabe.      
</p>
<p>2 Principales caract&#233;ristiques des dictionnaires arabes   
La lexicographie arabe est une discipline tr&#232;s ancienne. Elle a connu tout le long de son 
histoire une diversit&#233; d&#8217;&#233;coles ayant chacune ses sp&#233;cificit&#233;s. Certaines de ces &#233;coles 
proposent une classification des entr&#233;es lexicales selon l&#8217;ordre phon&#233;tique (e.g. Al-Ain 
&#171; &#1606;&#1610;&#1593;&#1604;&#1575; &#187;, Tahdhib Al-Loghah &#171; &#1577;&#1594;&#1604;&#1617;&#1604;&#1575; &#1576;&#1610;&#1584;&#1607;&#1578; &#187;). D&#8217;autres utilisent l&#8217;ordre alphab&#233;tique soit direct 
(e.g. Lisan-El-Arab &#171; &#1576;&#1585;&#1593;&#1604;&#1575; &#1606;&#1575;&#1587;&#1604; &#187;, Al-Qamous-Al-Mouhit &#171; &#1591;&#1610;&#1581;&#1605;&#1604;&#1575; &#1587;&#1608;&#1605;&#1575;&#1602;&#1604;&#1575; &#187;, Assihah 
&#171; &#1617;&#1589;&#1604;&#1575;&#1581;&#1575;&#1581;  &#187;)  soit invers&#233; (e.g. El-Ghani &#171; &#1617;&#1610;&#1606;&#1594;&#1604;&#1575; &#187;, Larousse : Al-Moojam Alarabi Al-Hadith 
&#171; &#1587;&#1608;&#1585;&#1604;&#1575;: &#1579;&#1610;&#1583;&#1581;&#1604;&#1575; &#1610;&#1576;&#1585;&#1593;&#1604;&#1575; &#1605;&#1580;&#1593;&#1605;&#1604;&#1575;  &#187;). Nous distinguons aussi le classement selon l&#8217;ordre alphab&#233;tique 
croissant de la racine du mot qui constitue l&#8217;une des sp&#233;cificit&#233;s des dictionnaires de l&#8217;arabe 
(e.g. Al-Wassit &#171; &#1591;&#1610;&#1587;&#1608;&#1604;&#1575; &#187;, Al-Mosbah Al-Mounir &#171; &#1585;&#1610;&#1606;&#1605;&#1604;&#1575; &#1581;&#1575;&#1576;&#1589;&#1605;&#1604;&#1575; &#187;). Cette organisation permet 
d&#8217;inclure toutes les formes verbales et nominales d&#233;riv&#233;es d&#8217;une racine sous la m&#234;me entr&#233;e. 
</p>
<p>Cette diversit&#233; peut &#234;tre r&#233;sum&#233;e dans les points suivants :  
</p>
<p>&#8226; Contenu : la description du contenu des entr&#233;es varie d&#8217;un dictionnaire &#224; un autre.  
Certains se contentent des exemples pour d&#233;finir le sens d&#8217;un mot, d&#8217;autres donnent 
la d&#233;finition accompagn&#233;e d&#8217;exemples. Les informations d&#8217;ordre morphologique et 
syntaxique sont plus ou moins riches d&#8217;un dictionnaire &#224; un autre, etc.    
</p>
<p>&#8226; Macrostructure : l&#8217;organisation des entr&#233;es lexicales diff&#232;re d&#8217;un dictionnaire &#224; un 
autre (selon l&#8217;&#233;cole lexicographique). Par exemple, MaKTaBaTun &#171; &#1612;&#1577;&#1614;&#1576;&#1614;&#1578;&#1618;&#1603;&#1614;&#1605; &#187; (librairie) 
repr&#233;sente une entr&#233;e lexicale &#224; part dans le dictionnaire El-Ghani &#171; &#1617;&#1610;&#1606;&#1594;&#1604;&#1575; &#187; alors qu&#8217;il 
figure comme une sous-entr&#233;e de l&#8217;entr&#233;e lexicale KaTaBa &#171; &#1614;&#1576;&#1614;&#1578;&#1614;&#1570; &#187; (&#233;crire) dans le 
dictionnaire Al-Wassit &#171; &#1591;&#1610;&#1587;&#1608;&#1604;&#1575; &#187; puisque c&#8217;est un mot d&#233;riv&#233; de KaTaBa. 
</p>
<p>&#8226; Microstructure : l&#8217;organisation des informations linguistiques, au  niveau des entr&#233;es 
lexicales, varie d&#8217;un dictionnaire &#224; un autre et m&#234;me au sein d&#8217;un m&#234;me dictionnaire. 
Par exemple, le pluriel et/ou le f&#233;minin d&#8217;un lemme de type nom &quot;&#1605;&#1587;&#1575;&quot; ou adjectif 
&quot;&#1577;&#1601;&#1589;&quot; se trouvent en t&#234;te de l&#8217;article dans le dictionnaire El-Ghani  &#171; &#1617;&#1610;&#1606;&#1594;&#1604;&#1575; &#187; et &#224; la fin 
de l&#8217;article, si elles existent, dans Al-Wassit  &#171; &#1591;&#1610;&#1587;&#1608;&#1604;&#1575; &#187;. 
</p>
<p>&#8226; Consultation : Il n&#8217;y a pas une mani&#232;re unique de consulter ces dictionnaires. Dans la 
plupart des cas, l&#8217;utilisateur est contraint &#224; conna&#238;tre la structure interne d&#8217;un 
dictionnaire pour pouvoir trouver l&#8217;information qu&#8217;il cherche.  
</p>
<p>La question que nous nous posons est comment profiter de cette richesse structurelle et 
informationnelle dans l&#8217;&#233;laboration de nouveaux dictionnaires &#233;lectroniques arabe ?  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F. BACCAR, A. KHEMAKHEM, B. GARGOURI, K. HADDAR et A. BEN HAMADOU 
</p>
<p> 
 
</p>
<p>3 Choix et pr&#233;sentation g&#233;n&#233;rale de LMF   
</p>
<p>3.1 Choix de LMF  
</p>
<p>En vue de proposer un mod&#232;le unifi&#233; des dictionnaires arabes &#224; usage &#233;ditorial, notre choix 
s&#8217;est fix&#233; sur LMF pour les raisons suivantes. Tout d&#8217;abord, cette future norme, qui sera  
publi&#233;e tr&#232;s prochainement par l&#8217;ISO sous le num&#233;ro 24613, permet la sp&#233;cification de 
lexiques monolingues et multilingues destin&#233;s &#224; la fois aux usages &#233;ditorial et TALN. En plus, 
elle assure une mod&#233;lisation extensible et modulaire couvrant tous les niveaux de description 
linguistique (i.e. morphologie, syntaxe, s&#233;mantique). De surcro&#238;t, sa souplesse de 
mod&#233;lisation favorise la repr&#233;sentation des caract&#233;ristiques de la langue arabe  notamment ses 
aspects d&#233;rivationnel et flexionnel  (Khemakhem, Gargouri, Abdelwahed &amp; Francopoulo, 
2007). E&#1615;n effet, les classes des extensions de LMF permettent de repr&#233;senter la racine et le 
sch&#232;me (les sch&#232;mes sont des mod&#232;les de diff&#233;rentes structures que l'on applique aux racines) 
d&#8217;une entr&#233;e lexicale du dictionnaire, ainsi que les patrons morphologiques assurant les 
op&#233;rations de d&#233;rivation et de flexion. De ce fait, il est possible de repr&#233;senter aussi bien les 
lexiques extensionnels qu&#8217;intensionnels. Enfin, la mod&#233;lisation LMF se pr&#234;te &#224; une utilisation 
en ligne avec les services Web (Ben Abderrahman, Chaari, Gargouri &amp; Jmaiel, 2006). 
</p>
<p>3.2 Pr&#233;sentation g&#233;n&#233;rale de LMF 
</p>
<p>Dans une perspective de g&#233;n&#233;ricit&#233;, LMF propose un m&#233;ta-mod&#232;le constitu&#233; d&#8217;une partie 
noyau obligatoire et de mod&#232;les d&#8217;extension optionnels couvrant, notamment, les aspects 
morphologique, syntaxique, s&#233;mantique et MRD (Machine Readable Dictionary) 
(Francopoulo &amp; George, 2008). La modularit&#233; de LMF est assur&#233;e par les m&#233;canismes 
d&#8217;adjonction des cat&#233;gories de donn&#233;es aux composantes du m&#233;ta-mod&#232;le. Ce sont des 
descripteurs linguistiques &#233;l&#233;mentaires qui permettent de d&#233;corer les classes du m&#233;ta-mod&#232;le 
par les sp&#233;cificit&#233;s de la langue et du lexique (e.g. /Part of speech/, /Grammatical number/, 
etc.). Elles sont organis&#233;es, avec leurs valeurs possibles, dans un registre de cat&#233;gories de 
donn&#233;es qui est consultable et &#233;ditable en ligne [http://syntax.inist.fr]. Ainsi leur 
normalisation suit des principes d&#233;finis par la norme ISO 12620 (Ide &amp; Romary, 2004).  
</p>
<p>4 Elaboration du mod&#232;le normalis&#233; des dictionnaires arabes 
Ce mod&#232;le propose une repr&#233;sentation unifi&#233;e des dictionnaires arabes existants en se r&#233;f&#233;rant 
&#224; la derni&#232;re r&#233;vision de LMF (rev.15) (Francopoulo &amp; George, 2008). 
</p>
<p>4.1 D&#233;marche de cr&#233;ation du mod&#232;le normalis&#233;   
</p>
<p>Dans ce paragraphe, nous nous proposons d&#8217;esquisser un mod&#232;le normatif et repr&#233;sentatif des 
dictionnaires arabes. La d&#233;marche suivie respecte le processus recommand&#233; par LMF 
(Francopoulo &amp; George, 2008). Ainsi, nous avons commenc&#233; par la s&#233;lection des classes 
n&#233;cessaires pour repr&#233;senter les informations dictionnairiques de l&#8217;arabe. Les classes que nous 
avons retenues repr&#233;sentent pour notre mod&#232;le cible des sous mod&#232;les relatifs aux extensions 
morphologique, MRD, syntaxique et s&#233;mantique. Ces classes sont greff&#233;es sur le noyau de 
LMF qui sp&#233;cifie essentiellement les notions de lexique, de mot, de forme et de sens. La 
pr&#233;sence du noyau est obligatoire selon LMF. Ensuite, nous avons s&#233;lectionn&#233; les cat&#233;gories </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation normalis&#233;e LMF des dictionnaires &#233;lectroniques &#233;ditoriaux de l&#8217;arabe  
</p>
<p> 
 
</p>
<p>de donn&#233;es ad&#233;quates &#224; l&#8217;arabe &#224; partir du registre normalis&#233;. Enfin, nous avons d&#233;cor&#233; les 
sous mod&#232;les ainsi cr&#233;&#233;s par les cat&#233;gories de donn&#233;es s&#233;lectionn&#233;es. 
</p>
<p>4.2 Mod&#232;le de l&#8217;extension morphologique 
</p>
<p>Le mod&#232;le de cette extension permet de repr&#233;senter les informations morphologiques des 
lexiques. Compte tenu de l&#8217;aspect flexionnel et d&#233;rivationnel de l&#8217;arabe, nous avons retenu les 
classes Lemma, Related Form et Word Form de l&#8217;extension morphologique de LMF, qui 
servent &#224; d&#233;crire, respectivement,  le sch&#232;me et la forme &#233;crite du lemme, sa racine et les 
propri&#233;t&#233;s des formes fl&#233;chies. La Figure 1-a d&#233;crit les liens des classes morphologiques avec 
celles du noyau. Elle pr&#233;cise, en plus, les cat&#233;gories de donn&#233;es utilis&#233;es. La Figure 1-b 
pr&#233;sente un extrait XML qui illustre l&#8217;instanciation de ce mod&#232;le pour l&#8217;exemple de l&#8217;entr&#233;e 
lexicale KaTaBa &#171; &#1614;&#1576;&#1614;&#1578;&#1614;&#1570; &#187; (&#233;crire).  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Erreur ! 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1-a : Mod&#232;le morphologique         Figure 1-b : Extrait XML du mod&#232;le morphologique 
</p>
<p>4.3 Mod&#232;le de l&#8217;extension MRD 
</p>
<p>Cette extension est particuli&#232;rement utilis&#233;e dans la description des dictionnaires 
&#233;lectroniques &#224; usage &#233;ditorial. La Figure 2 pr&#233;sente les liens des classes MRD, que nous 
avons retenues, Context et SubjectField avec la classe Sense du noyau. La premi&#232;re classe 
repr&#233;sente un exemple d&#8217;utilisation du lemme dans une phrase. Quant &#224; la deuxi&#232;me, elle 
d&#233;finit le domaine d&#8217;usage du lemme correspondant &#224; un sens donn&#233;. Nous avons exclu la 
troisi&#232;me classe MRD, propos&#233;e par LMF, &#224; savoir Equivalent, vu que cette derni&#232;re est 
relative &#224; un contexte multilingue. 
</p>
<p> 
</p>
<p>Figure 2 : Mod&#232;le de l&#8217;extension MRD 
</p>
<p>0..*
</p>
<p>0..*
</p>
<p>Context 
</p>
<p>Subject FieldLexicon 
</p>
<p>Lexical Entry 0..* Sense 
1..* 
</p>
<p>Text Representation 
0..*
</p>
<p>/text/ 
</p>
<p>/text/ 
</p>
<p>1 
</p>
<p>0..* 
</p>
<p>1..* 
</p>
<p>Lexicon 
</p>
<p>Lexical Entry 
</p>
<p>Lemma 
</p>
<p>Word Form 
</p>
<p>0..
</p>
<p>Related Form 
</p>
<p>0..* 
/writtenForm/
</p>
<p>/type/ 
</p>
<p>/writtenForm/ 
</p>
<p>/grammaticalNumber
/  
</p>
<p>/person/ 
</p>
<p>/grammaticalAspect/  
</p>
<p>/writtenForm
/ 
</p>
<p>Form Representation 
</p>
<p>0..* 
0..* 
</p>
<p>0..* </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F. BACCAR, A. KHEMAKHEM, B. GARGOURI, K. HADDAR et A. BEN HAMADOU 
</p>
<p> 
 
</p>
<p>4.4 Mod&#232;le de l&#8217;extension syntaxique 
</p>
<p>L&#8217;objectif de ce mod&#232;le est de d&#233;crire les propri&#233;t&#233;s syntaxiques du mot vedette lorsqu&#8217;il 
s&#8217;agit d&#8217;une construction form&#233;e de plusieurs mots. Les classes que nous jugeons n&#233;cessaires 
pour d&#233;crire les informations syntaxiques de l&#8217;arabe sont Syntactic Behaviour, 
Subcategorization Frame et Subcategorization Frame Set qui sont rattach&#233;es au noyau 
comme le montre la Figure 3-a. Le r&#244;le de ces classes correspond bien aux descriptions 
d&#8217;ordre syntaxique utilis&#233;es dans la majorit&#233; des dictionnaires de l&#8217;arabe l&#224; o&#249; la focalisation 
sur un verbe sugg&#232;re la description de sa valence. La Figure 3-b, donn&#233;e ci-apr&#232;s, illustre un 
extrait XML d&#8217;une instance du mod&#232;le syntaxique relative au mot KaTaBa &#171; &#1614;&#1576;&#1614;&#1578;&#1614;&#1570; &#187; (&#233;crire).  
</p>
<p>Figure 3-a : Mod&#232;le syntaxique                      Figure 3-b : Extrait XML du mod&#232;le syntaxique 
</p>
<p>4.5 Mod&#232;le de l&#8217;extension s&#233;mantique 
</p>
<p>En ce qui concerne l&#8217;extension s&#233;mantique de notre mod&#232;le, nous avons retenu les classes 
SenseRelation et SenseExample. Le choix de la classe SenseRelation, &#224; la place de Synset, 
propos&#233;e aussi par LMF, se justifie par le fait que nous ne disposons pas de dictionnaires type 
WordNet qui se base sur le concept de synset (ensemble de synonymes). La classe 
SenseExample s&#8217;av&#232;re tr&#232;s utile pour la langue arabe. En effet, la totalit&#233; des dictionnaires de 
cette langue insistent sur les  exemples, notamment pour d&#233;finir les mots vedettes.   
</p>
<p>Les deux classes que nous avons retenues sont reli&#233;es &#224; la classe Sense du noyau comme le 
montre la Figure 4-a. Par ailleurs, la Figure 4-b illustre un extrait d&#8217;instanciation de ce 
mod&#232;le, d&#233;crit en XML. 
</p>
<p> 
</p>
<p>Figure 4-a : Mod&#232;le s&#233;mantique                      Figure 4-b : Extrait XML du mod&#232;le s&#233;mantique 
</p>
<p>0..*
</p>
<p>0..*
</p>
<p>SenseExample 
</p>
<p>Lexicon 
</p>
<p>Lexical Entry 0..* Sense 
1..* 
</p>
<p>0..* 
0..* 
</p>
<p>/label/ SenseRelation 
</p>
<p>/text/ 
</p>
<p>/source/ 
</p>
<p>/senseNumber/ 
</p>
<p>Lexical Entry 
</p>
<p>Sense 
</p>
<p>Syntactic Behaviour 
</p>
<p>0..* Subcategorization Frame Set 
</p>
<p>0..* 
</p>
<p>0..* 
</p>
<p>0..* 
</p>
<p>0..* 
</p>
<p>Subcategorization Frame 
</p>
<p>Lexicon 
</p>
<p>1..* 
</p>
<p>0..* 
</p>
<p>0..*
</p>
<p>0..*
</p>
<p>0..*
</p>
<p>0..* 
</p>
<p>0..* 0..*
</p>
<p>0..* 0..*
</p>
<p>0..* 
</p>
<p>0..* </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation normalis&#233;e LMF des dictionnaires &#233;lectroniques &#233;ditoriaux de l&#8217;arabe  
</p>
<p> 
 
</p>
<p>5 Mise en &#339;uvre du mod&#232;le et exp&#233;rimentation   
Dans le but d&#8217;exp&#233;rimenter le mod&#232;le &#233;labor&#233;, nous avons tout d&#8217;abord proc&#233;d&#233; &#224; la 
normalisation de certains dictionnaires disponibles, notamment El-Ghani &#171; &#1617;&#1610;&#1606;&#1594;&#1604;&#1575; &#187;. Nous 
avons choisi, dans ce cas, une repr&#233;sentation extensionnelle de ce dictionnaire puisqu&#8217;il ne 
comporte pas toutes les formes fl&#233;chies d&#8217;un mot. Ensuite, nous avons d&#233;fini un ensemble de 
fonctions d&#8217;interrogation selon le niveau des utilisateurs. Enfin, nous avons d&#233;velopp&#233; et test&#233; 
ces fonctions dans le cadre de la mise en &#339;uvre du syst&#232;me d&#8217;interrogation ADIQTO.  
</p>
<p>5.1 Normalisation des dictionnaires existants   
</p>
<p>Nous avons proc&#233;d&#233;, en premier lieu, &#224; la normalisation du dictionnaire El-Ghani &#171; &#1606;&#1594;&#1604;&#1575;&#1617;&#1610;  &#187; 
dont nous disposons d&#8217;une version HTML. En effet, ce dictionnaire se distingue par sa 
microstructure all&#233;g&#233;e et invariante, ainsi que par un ensemble de marqueurs facilitant la 
transformation de son contenu brut vers une version structur&#233;e en XML. Par ailleurs, cette 
conversion a &#233;t&#233; faite d&#8217;une mani&#232;re quasi-automatique en se servant d&#8217;outils TALN 
disponibles dans notre laboratoire (i.e., segmenteur, analyseur morphologique).  
</p>
<p>En plus, nous avons normalis&#233; quelques extraits d&#8217;autres dictionnaires Al-Wassit &#171; &#1591;&#1610;&#1587;&#1608;&#1604;&#1575;  &#187;,  
Lissan-El-Arab &#171; &#1576;&#1585;&#1593;&#1604;&#1575; &#1606;&#1575;&#1587;&#1604; &#187; et  Al-Mouhit &#171;  &#1591;&#1610;&#1581;&#1605;&#1604;&#1575; &#187; dont la structure est plus complexe, qui 
varie d&#8217;une entr&#233;e &#224; une autre et caract&#233;ris&#233;e par une quasi-absence de marqueurs. Cette 
normalisation a &#233;t&#233; r&#233;alis&#233;e manuellement vu la difficult&#233; de la mise en place d&#8217;un syst&#232;me 
automatique d&#8217;analyse et de conversion.   
</p>
<p>5.2 Elaboration des fonctions d&#8217;interrogation   
</p>
<p>Pour d&#233;finir les fonctionnalit&#233;s d&#8217;interrogation des dictionnaires, nous avons consid&#233;r&#233; deux 
crit&#232;res : l&#8217;intervention de l&#8217;utilisateur et la complexit&#233; de la requ&#234;te. Ainsi, les  services 
d&#8217;interrogation peuvent &#234;tre class&#233;es en trois types : (i) interrogation simple, (ii) interrogation 
guid&#233;e ou assist&#233;e et (iii) interrogation avanc&#233;e (complexe). La recherche peut s&#8217;effectuer 
dans un ou plusieurs dictionnaires choisis par l&#8217;utilisateur. 
</p>
<p>&#8226; Interrogation simple 
</p>
<p>Cette recherche permet un acc&#232;s simple &#224; un mot vedette (entr&#233;e lexicale principale) ou &#224; 
l&#8217;une de ses formes fl&#233;chies. Toutes les informations relatives au mot recherch&#233; seront 
affich&#233;es : caract&#233;ristiques morphologiques, d&#233;finitions, exemples, etc.   
</p>
<p>&#8226; Interrogation guid&#233;e ou assist&#233;e 
</p>
<p>L&#8217;utilisateur de ce type de recherche jouit d&#8217;une assistance &#224; travers une correction du mot 
saisi. De surcro&#238;t, des requ&#234;tes pr&#233;d&#233;finies seront mises &#224; la disposition consistant &#224; la 
recherche des synonymes, du masculin ou du f&#233;minin, du singulier ou du pluriel et finalement 
des verbes et des noms d&#233;riv&#233;s.   
</p>
<p>&#8226; Interrogation avanc&#233;e 
</p>
<p>Le troisi&#232;me type concerne des besoins complexes exprim&#233;s par des experts qui cherchent &#224; 
calculer des statistiques sur la morphologie des mots, les liens entre les mots, etc. ou encore &#224;  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F. BACCAR, A. KHEMAKHEM, B. GARGOURI, K. HADDAR et A. BEN HAMADOU 
</p>
<p> 
 
</p>
<p>calculer des r&#233;sultats sp&#233;cifiques non stock&#233;s dans le dictionnaire comme la conjugaison.  
Dans ce cadre, nous allons r&#233;utiliser le langage graphique LMF-QL (Ben Abderrahman, 
Gargouri &amp; Jmaaiel, 2007). LMF-QL permet de g&#233;n&#233;rer une requ&#234;te XQuery &#224; partir d&#8217;une 
s&#233;lection dynamique des entr&#233;es qui seront combin&#233;es avec des op&#233;rateurs logiques (not, and 
et or). Ainsi, l&#8217;utilisateur est capable d&#8217;acc&#233;der &#224; n&#8217;importe quelle information et &#224; faire des 
croisements selon le besoin envisag&#233; (e.g. chercher les mots qui ont la m&#234;me racine).  
</p>
<p>5.3 Impl&#233;mentation du syst&#232;me ADIQTO   
</p>
<p>L&#8217;impl&#233;mentation du syst&#232;me ADIQTO est r&#233;alis&#233;e en Java avec utilisation de l&#8217;API Saxon9 
pour assurer l&#8217;ex&#233;cution des requ&#234;tes XQuery. Cette impl&#233;mentation se base sur des requ&#234;tes 
pr&#233;d&#233;finies assurant, notamment, les recherches simples et assist&#233;es (des macros). Quant &#224; la 
recherche avanc&#233;e, ses requ&#234;tes seront g&#233;n&#233;r&#233;es automatiquement gr&#226;ce &#224; l&#8217;utilisation du 
langage LMF-QL. La Figure 5 illustre la recherche simple du mot KaTaBa &#171; &#1614;&#1576;&#1614;&#1578;&#1614;&#1570; &#187; (&#233;crire). 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 5 : Interface graphique de recherche simple du syst&#232;me ADIQTO 
</p>
<p>Outre les services de consultation, ADIQTO assure aussi bien la correction des erreurs de 
voyellation du mot recherch&#233; que celle de ses erreurs orthographiques par le biais du syst&#232;me 
CORTEXA (Ben Hamadou, 1993) qui, dans un premier temps, analyse les mots apr&#232;s 
d&#233;voyellation, puis propose une liste de mots candidats &#224; la correction du mot recherch&#233;. 
</p>
<p>6 Discussion  
Le syst&#232;me ADIQTO est actuellement fonctionnel sur le dictionnaire moderne El-Ghani 
&#171; &#1617;&#1610;&#1606;&#1594;&#1604;&#1575; &#187; et sur des fragments des dictionnaires : Al-Wassit  &#171; &#1591;&#1610;&#1587;&#1608;&#1604;&#1575;  &#187;, Al-Mouhit &#171;  &#1591;&#1610;&#1581;&#1605;&#1604;&#1575; &#187; et 
Lissan-El-Arab &#171; &#1576;&#1585;&#1593;&#1604;&#1575;  &#1606;&#1575;&#1587;&#1604; &#187;. Le mod&#232;le que nous avons propos&#233; a &#233;largi, comme pr&#233;vu, le 
champ d&#8217;acc&#232;s aux donn&#233;es dictionnairiques, en permettant des requ&#234;tes tr&#232;s vari&#233;es afin de 
satisfaire les besoins d&#8217;une diversit&#233; d&#8217;utilisateurs. A l&#8217;inverse des outils de consultation des 
dictionnaires arabes disponibles, le principal m&#233;rite d&#8217;ADIQTO consiste &#224; fournir un acc&#232;s 
s&#233;lectif aux diff&#233;rentes informations relatives &#224; une entr&#233;e lexicale. A cet &#233;gard, il n&#8217;est plus 
obligatoire de limiter l&#8217;interrogation &#224; la liste des entr&#233;es lexicales, mais elle peut couvrir 
</p>
<p>Ensemble des 
dictionnaires interrog&#233;s
</p>
<p>Entr&#233;e de 
l&#8217;utilisateur 
</p>
<p>Visualiser un 
dictionnaire 
</p>
<p>Verbes et 
noms d&#233;riv&#233;s 
</p>
<p>Masculin et 
f&#233;minin 
</p>
<p>Singulier 
et pluriel 
</p>
<p>Recherche 
simple 
</p>
<p>Zone d&#8217;affichage 
des r&#233;sultats 
</p>
<p>Quitter 
l&#8217;application 
</p>
<p>Visualiser le 
r&#233;sultat pr&#233;c&#233;dent </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mod&#233;lisation normalis&#233;e LMF des dictionnaires &#233;lectroniques &#233;ditoriaux de l&#8217;arabe  
</p>
<p> 
 
</p>
<p>n&#8217;importe quelle forme fl&#233;chie ou d&#233;riv&#233;e rattach&#233;e &#224; une entr&#233;e lexicale. D&#8217;un autre c&#244;t&#233;, le 
mod&#232;le ainsi d&#233;fini supporte les repr&#233;sentations extensionnelle et intentionnelle, ce qui permet 
de produire des dictionnaires complets avec g&#233;n&#233;ration automatique des formes fl&#233;chies. 
</p>
<p>7 Conclusion    
Dans cet article, nous avons propos&#233; un mod&#232;le conforme &#224; la norme LMF-ISO 24613 pour la 
repr&#233;sentation des dictionnaires &#233;lectroniques &#233;ditoriaux de la langue arabe. Ce mod&#232;le a le 
m&#233;rite d&#8217;unifier les diff&#233;rents mod&#232;les propos&#233;s en lexicographie de l&#8217;arabe tout en offrant 
des possibilit&#233;s d&#8217;extension. La structure &#233;volutive et assez fine de ce mod&#232;le a permis un 
acc&#232;s s&#233;lectif aux diff&#233;rents champs aff&#233;rents &#224; un mot vedette par le biais d&#8217;un ensemble de 
recherches (simple, assist&#233;e et avanc&#233;e) satisfaisant les besoins d&#8217;une diversit&#233; d&#8217;utilisateurs 
(i.e. apprenant de la langue, &#233;crivain, journaliste, linguiste. etc.). 
</p>
<p>Dans les travaux futurs, nous comptons d&#233;velopper des services Web permettant de mettre en 
ligne le syst&#232;me ADIQTO, muni des dictionnaires normalis&#233;s disponibles, en vue d&#8217;&#233;largir le 
spectre de son utilisation. Finalement, nous envisageons aborder la normalisation des 
dictionnaires &#233;ditoriaux existants de l&#8217;arabe, notamment &#224; partir des versions num&#233;riques dont 
nous disposons (nous disposons d&#8217;une dizaine de dictionnaires en format .doc, html, et pdf).   
</p>
<p>R&#233;f&#233;rences  
AIT TALEB S., (2005). Dictionnaires &#233;lectroniques arabes : le mod&#232;le des dictionnaires de 
Sakhr, revue de l&#8217;Association Marocaine des Etudes Lexicographiques, Num&#233;ro 3-4, 15-31.  
</p>
<p>ARREGI X. &amp; AL. (2002). Semiautomatic of the Euskal Hiztegia Basque Dictionary to a 
queryabale electronic form. L&#8217;objet 8/2002, LMO&#8217; 2002, 45-57. 
</p>
<p>BEN ABDERRAHMEN M., CHAARI. F.,  GARGOURI B., JMAIEL M. (2006). Des services orient&#233;s 
besoin pour l&#8217;exploitation des bases lexicales normalis&#233;es. 10th Maghrebian Conference on 
Software Engineering and Artificial Intelligence MCSEAI&#8217;06, Agadir, Maroc.  
</p>
<p>BEN ABDERRAHMEN M., GARGOURI B., JMAIEL M. (2007). LMF-QL: A graphical Tool to 
Query LMF databases. Third Language &amp; Technology Conference: Human Language 
Technologies as a Challenge for Computer Science and Linguistics, Pozna&#324;, Poland. 
</p>
<p>BEN HAMADOU A., (1993). V&#233;rification et correction automatiques par analyse affixale des 
textes &#233;crits en langage naturel : le cas de l'arabe non voyell&#233;. Th&#232;se Es-Sciences en 
Informatique, Facult&#233; des Sciences, Universit&#233;  de Tunis.  
</p>
<p>DENDIEN, J. &amp; PIERREL, J.-M. (2003). Le Tr&#233;sor de la Langue Fran&#231;aise informatis&#233;. Un 
exemple d&#8217;informatisation d&#8217;un dictionnaire de langue de r&#233;f&#233;rence. TAL 44, Num&#233;ro 2, 11-
39. 
</p>
<p>FRANCOPOULO G. (2004). Proposition de norme des lexiques pour le traitement automatique 
du langage. INRIA/LORIA-ACTION SYNTAXE, Version-1.10, 13 mai 2004. 
</p>
<p>FRANCOPOULO G., GEORGE M. (2008). ISO/TC 37/SC 4 Rev.15. Language resource 
management &#8722; Lexical markup framework (LMF). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>F. BACCAR, A. KHEMAKHEM, B. GARGOURI, K. HADDAR et A. BEN HAMADOU 
</p>
<p> 
 
</p>
<p>IDE N., ROMARY L. (2004). International standard for a linguistic annotation framework. 
International Journal of Natural Language Engineering, 10 Num&#233;ro 3-4, 211-225. 
</p>
<p>KHEMAKHEM A., GARGOURI B., ABDELWAHED A., FRANCOPOULO G (2007). Mod&#233;lisation des 
paradigmes de flexion des verbes arabes selon la norme LMF - ISO 24613. Traitement 
Automatique des Langues Naturelles : du 5 au 8 juin 2007 &#224; Toulouse. 
</p>
<p>SPERBERG-MCQUEEN C.M., BURNARD L. (2005). TEI P5 &#8722; Guidelines for Electronic Text 
Encoding and Interchange, TEI Consortium. January 2005.  
</p>
<p>WOOLDRIDGE R. (1998). L&#8217;informatisation du Dictionnaire de l&#8217;Acad&#233;mie fran&#231;aise (DAF). 
DictA 1998, Table ronde sur l&#8217;informatisation des dictionnaires anciens. Limoges, 19-20. </p>

</div></div>
</body></html>