<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Grammaires factoris&#233;es pour des dialectes apparent&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Grammaires factoris&#233;es pour des dialectes apparent&#233;s
</p>
<p>Pascal Vaillant
GRIMAAG, Universit&#233; des Antilles-Guyane, B.P. 792, 97337 Cayenne cedex
</p>
<p>pascal.vaillant@guyane.univ-ag.fr
</p>
<p>R&#233;sum&#233;. Pour la formalisation du lexique et de la grammaire de dialectes &#233;troitement
apparent&#233;s, il peut se r&#233;v&#233;ler utile de factoriser une partie du travail de mod&#233;lisation. Les sous-
syst&#232;mes linguistiques isomorphes dans les diff&#233;rents dialectes peuvent alors faire l&#8217;objet d&#8217;une
description commune, les diff&#233;rences &#233;tant sp&#233;cifi&#233;es par ailleurs. Cette d&#233;marche aboutit &#224; un
mod&#232;le de grammaire &#224; couches : le noyau est commun &#224; la famille de dialectes, et une couche
superficielle d&#233;termine les caract&#233;ristiques de chacun. Nous appliquons ce proc&#233;d&#233; &#224; la famille
des langues cr&#233;oles &#224; base lexicale fran&#231;aise de l&#8217;aire am&#233;ricano-cara&#239;be.
</p>
<p>Abstract. The task of writing formal lexicons and grammars for closely related dialects
can benefit from factoring part of the modelling. Isomorphic linguistic subsystems from the
different dialects may have a common description, while the differences are specified aside. This
process leads to a layered grammar model: a kernel common to the whole family of dialects,
and a superficial skin specifying the particular properties of each one of them. We apply this
principle to the family of French-lexifier creole languages of the American-Caribbean area.
</p>
<p>Mots-cl&#233;s : TAG, mod&#233;lisation, grammaire, variation dialectale.
Keywords: TAG, grammar, modelling, dialectal variation.
</p>
<p>1 Introduction
</p>
<p>Certains groupes de langues pr&#233;sentent des similitudes importantes quant au fonctionnement
de leur syst&#232;me grammatical. Bien que cela ne soit pas logiquement n&#233;cessaire, ces similitudes
sont le plus souvent li&#233;es &#224; une origine historique commune, c&#8217;est-&#224;-dire qu&#8217;elles se manifestent
dans des groupes de dialectes g&#233;n&#233;tiquement apparent&#233;s. Pour m&#233;moire, nous prenons ici le mot
&#171; dialecte &#187; dans le sens technique qu&#8217;il a en linguistique, o&#249; il d&#233;signe un syst&#232;me linguistique
consid&#233;r&#233; non pas en lui-m&#234;me, mais dans son appartenance &#224; une famille de syst&#232;mes apparen-
t&#233;s. La question de la d&#233;limitation du seuil de ressemblance qui d&#233;finit une famille de dialectes,
et du seuil de diff&#233;rence qui d&#233;finit la fronti&#232;re entre deux dialectes distincts, ne sera pas abord&#233;e
dans cette discussion1. La r&#233;flexion que nous pr&#233;sentons peut donc s&#8217;appliquer indiff&#233;remment
&#224; ce que l&#8217;on choisirait d&#8217;appeler, selon le contexte, l&#8217;usage, ou les pr&#233;-suppos&#233;s du locuteur,
un ensemble de variantes dialectales d&#8217;une m&#234;me langue ou une famille de langues &#233;troitement
apparent&#233;es.
</p>
<p>Entre les diff&#233;rents dialectes appartenant &#224; une famille de ce type, les similitudes entre sys-
1Dans le cas qui nous a occup&#233;, nous avons affaire &#224; des langues insulaires, pour lesquelles, malgr&#233; une varia-
</p>
<p>bilit&#233; g&#233;ographique interne, la question de la d&#233;limitation des vari&#233;t&#233;s principales au sein d&#8217;une famille ne fait pas
l&#8217;objet de pol&#233;mique. Celle des familles elle-m&#234;me est plus discut&#233;e (cf. plus loin, &#167; 3).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>t&#232;mes ne sont pas des &#233;v&#233;nements isol&#233;s, mais se constituent elles-m&#234;mes en syst&#232;me : on peut
parler d&#8217;un isomorphisme (partiel) de syst&#232;mes. C&#8217;est notamment le cas, pour des raisons &#233;vi-
dentes, quand il y a parent&#233; g&#233;n&#233;tique : c&#8217;est un syst&#232;me commun qui est h&#233;rit&#233;, et ce sont
les divergences qui s&#8217;accumulent au fil du temps. L&#8217;argument que nous souhaitons avancer ici
est que lorsque cet isomorphisme couvre une part suffisamment importante du syst&#232;me morpho-
syntaxique, il est int&#233;ressant du point de vue de la description formelle de factoriser, c&#8217;est-&#224;-dire
de concevoir une mod&#233;lisation en plusieurs couches : un noyau de grammaire commun, et une
couche superficielle ne sp&#233;cifiant que les ph&#233;nom&#232;nes particuliers &#224; chaque dialecte.
</p>
<p>L&#8217;id&#233;e que nous d&#233;fendons semble intuitive, et s&#8217;inscrit dans la coh&#233;rence logique d&#8217;approches
comme celle du programme minimaliste (Chomsky, 1995). La vis&#233;e de notre mod&#233;lisation, ce-
pendant, reste tr&#232;s pratique, et centr&#233;e sur le cas d&#8217;une famille tr&#232;s resserr&#233;e de dialectes : ainsi,
l&#8217;application que nous faisons du concept de &#171; param&#232;tres &#187; se restreint &#224; la param&#233;trisation
d&#8217;un dialecte au sein de son taxon linguistique, et nous n&#8217;avons pas &#224; examiner les niveaux de
g&#233;n&#233;ralisation allant, en amont, de ce taxon &#224; des principes universels.
</p>
<p>Les facteurs contextuels qui rendent cet effort de factorisation particuli&#232;rement utile sont au
nombre de deux. Le premier est la proximit&#233; des dialectes : le travail de factorisation est facilit&#233;
si une grande partie de la grammaire des diff&#233;rents dialectes se retrouve dans le noyau com-
mun, et que les couches superficielles sont minces. Le second est la raret&#233; des moyens humains
disponibles pour le travail de mod&#233;lisation : s&#8217;il n&#8217;y a qu&#8217;une petite &#233;quipe de sp&#233;cialistes pour
mod&#233;liser plusieurs dialectes, alors elle a &#233;videmment int&#233;r&#234;t &#224; concentrer ses efforts dans une
optique de r&#233;utilisabilit&#233;, m&#234;me si elle y perd potentiellement par rapport &#224; la finesse de descrip-
tion qu&#8217;elle pourrait atteindre en se consacrant exclusivement &#224; un syst&#232;me linguistique unique.
Ces deux facteurs se trouvent r&#233;unis dans les situations que l&#8217;on pourrait grossi&#232;rement d&#233;finir
comme &#233;tant celles des &#171; petites &#187; langues dialectalis&#233;es2. Le cas d&#8217;esp&#232;ce qui nous occupe,
celui des cr&#233;oles fran&#231;ais de l&#8217;aire am&#233;rique-cara&#239;be, illustre bien cette conjonction de facteurs
(cf. plus bas, &#167; 3).
</p>
<p>2 Choix de mod&#233;lisation formelle
</p>
<p>Candito (1998) a montr&#233; l&#8217;int&#233;r&#234;t, et la faisabilit&#233;, de l&#8217;id&#233;e consistant &#224; factoriser une partie de
la mod&#233;lisation grammaticale pour des langues apparent&#233;es : son travail porte sur le d&#233;veloppe-
ment parall&#232;le de grammaires pour le fran&#231;ais et l&#8217;italien. Ces deux langues sont suffisamment
proches pour avoir un noyau de syst&#232;me grammatical cons&#233;quent en commun (ce qui rend l&#8217;ap-
proche &#171; rentable &#187; au regard de notre premier facteur mentionn&#233; au paragraphe pr&#233;c&#233;dent), tout
en ayant des sp&#233;cificit&#233;s notables. Son approche se fonde sur le d&#233;veloppement d&#8217;une m&#233;ta-
grammaire, description-source &#224; partir de laquelle des grammaires TAG lexicalis&#233;es (LTAG)
sont engendr&#233;es automatiquement.
</p>
<p>Notre approche est sensiblement diff&#233;rente dans la mesure o&#249; nous souhaitons factoriser non
seulement une description en amont, mais &#233;galement les grammaires elles-m&#234;mes. Une appli-
cation &#171; chargeant &#187; la grammaire du martiniquais, par exemple, pour effectuer des t&#226;ches de g&#233;-
n&#233;ration, commence concr&#232;tement par charger les fichiers de grammaire du &#171; cr&#233;ole commun &#187;,
avant de charger la couche sp&#233;cifiquement martiniquaise. Cette &#233;conomie suppl&#233;mentaire en
termes de quantit&#233; de structures stock&#233;es est rendue possible par le degr&#233; de correspondance
&#233;lev&#233; entre les syst&#232;mes.
</p>
<p>2On parle aujourd&#8217;hui de &#171; langues peu dot&#233;es &#187; pour ne pas m&#234;ler le facteur du nombre de locuteurs d&#8217;une
langue &#224; celui du nombre de linguistes pay&#233;s pour la d&#233;crire ; notons que ce qui nous int&#233;resse en particulier ici
sont les &#171; familles de langues peu dot&#233;es &#187;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Grammaires factoris&#233;es
</p>
<p>Il convient de mentionner en outre que les quatre cr&#233;oles auxquels nous nous int&#233;ressons ont
en commun non seulement de grands pans de leur syst&#232;me grammatical, mais &#233;galement une
partie importante de leur lexique (comme l&#8217;illustrent les tableaux de la partie &#167; 3). Il est donc
doublement pertinent de chercher &#224; factoriser non pas une m&#233;ta-structure, mais des structures
du niveau de base (concr&#232;tement, des fichiers de grammaire contenant des sch&#233;mas d&#8217;arbres
&#233;l&#233;mentaires, mais &#233;galement des fichiers de lexique).
Le travail que nous pr&#233;sentons ici s&#8217;inscrit dans le prolongement d&#8217;un effort de description for-
melle et de mod&#233;lisation des langues r&#233;gionales cr&#233;oles de la zone des Antilles et de la Guyane,
dont les premi&#232;res &#233;tapes avaient d&#233;j&#224; &#233;t&#233; expos&#233;es dans une communication (Vaillant, 2003)
qui ne portait encore que sur le cr&#233;ole martiniquais. Ces travaux s&#8217;appuient sur le mod&#232;le des
grammaires &#224; adjonction d&#8217;arbres, &#224; unification de structures de traits (FS-TAG) (Vijay-Shanker
&amp; Joshi, 1988; Abeill&#233;, 1993), qui pr&#233;sentent l&#8217;avantage de permettre une mod&#233;lisation de ph&#233;-
nom&#232;nes linguistiques de port&#233;es diverses ; et d&#8217;offrir un ensemble d&#8217;outils et de ressources
pour la repr&#233;sentation, l&#8217;analyse, et la g&#233;n&#233;ration. Pour nos propres tests, nous utilisons jusqu&#8217;&#224;
pr&#233;sent une implantation ad hoc en Prolog (cf. &#167; 4).
La question centrale impliqu&#233;e par le pr&#233;sent travail est la suivante : &#224; quel niveau doivent
s&#8217;articuler les parties communes et les parties sp&#233;cifiques de la description linguistique, &#224; partir
du moment o&#249; l&#8217;on d&#233;cide de factoriser les langues ? Afin d&#8217;obtenir une r&#233;elle factorisation
des structures du niveau de base de la description, nous avons fait le choix de mod&#233;liser le
param&#232;tre de la langue sous la forme d&#8217;un trait descriptif inclus dans les structures de traits de
la grammaire, au m&#234;me titre que le nombre ou le degr&#233; de d&#233;termination (cf. plus bas, fig. 1 &#224;
3). Ceci implique que les structures communes ne sont pas des &#171; m&#233;ta-arbres &#187; virtuels, mais
des &#233;l&#233;ments du mod&#232;le TAG exactement au m&#234;me niveau que les autres &#8212; &#224; ceci pr&#232;s que le
param&#232;tre de langue n&#8217;y est pas instanci&#233;.
</p>
<p>3 Application &#224; la famille des cr&#233;oles fran&#231;ais de l&#8217;aire am&#233;ricano-cara&#239;be
</p>
<p>La famille de dialectes &#224; laquelle nous appliquons la m&#233;thode d&#233;crite ici est la famille des
cr&#233;oles &#224; base fran&#231;aise de la zone am&#233;ricano-cara&#239;be. Nous nous focalisons ici sur quatre dia-
lectes principaux dans le monde contemporain : le cr&#233;ole ha&#239;tien, langue nationale de la R&#233;-
publique d&#8217;Ha&#239;ti, dans les Grandes Antilles ; le cr&#233;ole guadeloup&#233;en, et le cr&#233;ole martiniquais,
parl&#233;s respectivement dans les &#238;les de Guadeloupe et de Martinique, dans les Petites Antilles ;
enfin, le cr&#233;ole guyanais, dont la variante centrale d&#233;crite ici est parl&#233;e dans l&#8217;Est de la Guyane
Fran&#231;aise, sur la c&#244;te nord du continent sud-am&#233;ricain. Dans chacun de ces territoires, il existe
des variantes, que nous n&#233;gligeons pour nous concentrer sur la vari&#233;t&#233; de la capitale3.
</p>
<p>La question de la parent&#233; g&#233;n&#233;tique des cr&#233;oles est une question th&#233;orique non-triviale, qui fait
intervenir des consid&#233;rations non seulement de linguistique comparative, mais &#233;galement de so-
ciolinguistique historique. Un premier type d&#8217;argument consisterait &#224; poser que les cr&#233;oles sont
n&#233;cessairement apparent&#233;s, puisqu&#8217;ils d&#233;rivent tous du fran&#231;ais ; quoiqu&#8217;ayant des fondements
historiques, cet argument est contestable dans la mesure o&#249; si les cr&#233;oles d&#233;rivent effectivement
du fran&#231;ais, ils en d&#233;rivent d&#8217;une mani&#232;re atypique par rapport aux crit&#232;res habituels de la lin-
guistique historique. En effet, &#224; la source de leur &#233;volution se trouve, &#224; un point dans le temps,
une masse parlante constitu&#233;e en majorit&#233; de locuteurs dont la langue cible (ici le fran&#231;ais) n&#8217;est
</p>
<p>3Cette famille comprend aussi les cr&#233;oles fran&#231;ais parl&#233;s sur d&#8217;autres &#238;les des Petites Antilles, ainsi qu&#8217;un cr&#233;ole
r&#233;siduel parl&#233; par quelques milliers de familles en Louisiane, que nous n&#8217;incluons pas dans notre &#233;tude faute de
ressources descriptives suffisantes &#224; l&#8217;heure actuelle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>pas la langue maternelle, et par qui elle a &#233;t&#233; imparfaitement apprise4. Un second d&#233;bat oppose
des th&#233;ories de monogen&#232;se et de polygen&#232;se des diff&#233;rentes langues cr&#233;oles : y a-t-il pu y avoir
un &#171; proto-cr&#233;ole &#187;, &#224; l&#8217;origine des langues cr&#233;oles contemporaines ? Nous ne pouvons entrer
dans le d&#233;tail de ces discussions, qui sont p&#233;riph&#233;riques au th&#232;me de cette communication (pour
une pr&#233;sentation des discussions sur les cr&#233;oles, leurs origines et leur rapport au fran&#231;ais, nous
renvoyons &#224; (Haza&#235;l-Massieux, 2002)). Disons simplement si les diff&#233;rentes th&#233;ories postulant
une origine commune pour tous les cr&#233;oles (ceux des Antilles comme ceux de l&#8217;Oc&#233;an Indien)
ne trouvent aujourd&#8217;hui que peu de d&#233;fenseurs, il est en revanche tr&#232;s g&#233;n&#233;ralement acquis,
parmi les linguistes sp&#233;cialistes du champ, que les cr&#233;oles fran&#231;ais de l&#8217;aire am&#233;ricano-cara&#239;be
forment une famille g&#233;n&#233;tique, &#224; cause de la quantit&#233; consid&#233;rable de convergences dans leurs
syst&#232;mes grammaticaux, qui ne sont justement en aucune mani&#232;re explicables par une parent&#233;
commune au fran&#231;ais. Pf&#228;nder (2000, p.192&#8211;209) propose une analyse de cette famille en termes
d&#8217;aire dialectale, opposant centre (Antilles) et p&#233;riph&#233;rie (Louisiane et Guyane), et en donne des
tableaux comparatifs pour le syst&#232;me d&#8217;expression du temps et de l&#8217;aspect.
</p>
<p>Nous n&#8217;entrerons pas ici dans une description d&#233;taill&#233;e de la structure du syst&#232;me grammatical
de chaque cr&#233;ole. Une pr&#233;sentation synth&#233;tique des principales caract&#233;ristiques structurales de
la famille a &#233;t&#233; donn&#233;e dans (Vaillant, 2003), et illustr&#233;e par des exemples en cr&#233;ole martiniquais
(mais totalement g&#233;n&#233;ralisables aux trois autres dialectes qui font l&#8217;objet du pr&#233;sent article).
Dans les tableaux qui suivent, compil&#233;s &#224; partir de diverses sources (notamment (Pf&#228;nder, 2000)
et (Damoiseau, 2007) pour la perspective comparative, mais &#233;galement plusieurs autres ou-
vrages pour les points pr&#233;cis de description de chaque dialecte pris individuellement) ; puis com-
pl&#233;t&#233;s et modifi&#233;s par nous apr&#232;s des observations sur des corpus r&#233;cents ; nous nous contentons
de montrer des exemples de comparaison de sous-syst&#232;mes grammaticaux. Nous pr&#233;sentons
ici, pour leur exemplarit&#233;, le syst&#232;me des degr&#233;s de d&#233;termination dans le groupe nominal, ainsi
que le syst&#232;me noyau d&#8217;expression du temps, du mode et de l&#8217;aspect (par des particules) dans le
groupe pr&#233;dicatif. Les deux tableaux pr&#233;sent&#233;s (1 et 2) suffiront &#224; donner une id&#233;e du degr&#233; de
similitude lexicale et syntaxique de ces dialectes (N.B. il n&#8217;y a pas de morphologie flexionnelle,
car ces langues sont isolantes).
D&#233;termination dans le groupe nominal
Les cr&#233;oles consid&#233;r&#233;s poss&#232;dent tous quatre degr&#233;s de d&#233;termination syst&#233;matiques du nom :
un g&#233;n&#233;rique, un ind&#233;fini, un sp&#233;cifique, et un d&#233;monstratif. Le degr&#233; g&#233;n&#233;rique exprime le
concept pris dans ses caract&#233;ristiques g&#233;n&#233;rales de cat&#233;gorie ; en fran&#231;ais, il pourrait se traduire
indiff&#233;remment par un singulier ou un pluriel : zwazo gen d&#232; z&#232;l (ha&#239;t.), l&#8217;oiseau a deux ailes /un
oiseau a deux ailes / les oiseaux ont deux ailes. Pour des raisons d&#8217;&#233;conomie descriptive, dans
la formalisation, nous traitons ce degr&#233; g&#233;n&#233;rique comme une valeur s&#233;mantique possible de
l&#8217;expression du degr&#233; ind&#233;fini au pluriel (qui s&#8217;exprime lui aussi par le nom seul sans article).
Le degr&#233; ind&#233;fini s&#8217;exprime comme en fran&#231;ais &#224; l&#8217;aide d&#8217;un adjectif num&#233;ral, qui a gard&#233;
une valeur plus sp&#233;cialis&#233;e, plus proche de son origine num&#233;rale, qu&#8217;en fran&#231;ais contemporain.
Le degr&#233; sp&#233;cifique (plus fortement d&#233;termin&#233; que le d&#233;fini fran&#231;ais) s&#8217;exprime par un article
postpos&#233;, qui d&#233;rive historiquement d&#8217;un adverbe d&#233;ictique. Enfin, le degr&#233; d&#233;monstratif d&#233;rive
d&#8217;une combinaison impliquant un ancien pronom d&#233;monstratif, qui se retrouve tant&#244;t pr&#233;pos&#233;
(guya.), tant&#244;t postpos&#233; au nom (autres cr&#233;oles), et auquel se rajoute la marque du d&#233;fini sp&#233;ci-
fique (qui s&#8217;y est amalgam&#233;e dans le cas des cr&#233;oles guadeloup&#233;en et martiniquais). Le pluriel
s&#8217;exprime soit par un marqueur pr&#233;pos&#233; d&#233;riv&#233; d&#8217;un ancien d&#233;monstratif pluriel (mart., guad.),
</p>
<p>4Cette consid&#233;ration conduit certains linguistes &#224; aller jusqu&#8217;&#224; refuser de parler de transmission g&#233;n&#233;tique entre
langue source et cr&#233;ole, p.ex. (Thomason &amp; Kaufman, 1988, p. 152).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Grammaires factoris&#233;es
</p>
<p>soit par un pronom personnel pluriel postpos&#233; (ha&#239;t., guya.), qui en guyanais s&#8217;est amalgam&#233; &#224;
la marque du d&#233;fini (y&#233; la [forme historique, d&#233;crite en 1872] &gt; ya).
Dans la formalisation, nous ne retenons donc plus que trois degr&#233;s de d&#233;termination (ind&#233;fini,
sp&#233;cifique et d&#233;monstratif), qui se croisent aux deux valeurs de nombre (singulier et pluriel).
Par ailleurs, &#233;tant donn&#233; que la marque du degr&#233; ind&#233;fini ne se combine avec aucune autre, alors
qu&#8217;il y a par ailleurs une combinaison entre les marques du d&#233;monstratif et du sp&#233;cifique (avec
d&#233;monstratif &#8658; sp&#233;cifique), nous mod&#233;lisons le degr&#233; ind&#233;fini par une absence de trait, alors
que le sp&#233;cifique se caract&#233;rise par le trait &#12296;spe = +&#12297;, et le d&#233;monstratif par la combinaison de
traits &#12296;spe = +&#12297;, &#12296;dem = +&#12297; .
</p>
<p>Certains dialectes pr&#233;sentent un ph&#233;nom&#232;ne d&#8217;assimilation nasale qui change la forme de sur-
face de l&#8217;article sp&#233;cifique postpos&#233; (ha&#239;t., mart., guya.) ; d&#8217;autres, en outre, changent aussi la
forme de l&#8217;article selon que le mot pr&#233;c&#233;dent se termine par une consonne ou par une voyelle
(ha&#239;t., mart.). Les quatre combinaisons possibles sont indiqu&#233;es dans le tableau 1.
</p>
<p>ha&#239;t. guad. mart. guya. fran&#231;ais
Degr&#233; g&#233;n&#233;rique moun moun moun moun personne (humaine)
</p>
<p>Singulier
</p>
<p>ind&#233;fini yon moun on moun an moun roun moun une personne
</p>
<p>sp&#233;cifique
</p>
<p>moun nan moun la moun lan moun an la personne
tab la tab la tab la tab a la table
chyen an chyen la chyen an chyen an le chien
zwazo a zozyo la zw&#233;zo a zozo a l&#8217;oiseau
</p>
<p>d&#233;monstratif moun sa a moun lasa moun tala sa moun an cette personne
tab sa a tab lasa tab tala sa tab a cette table
</p>
<p>Pluriel
</p>
<p>ind&#233;fini moun moun moun moun des personnes
</p>
<p>sp&#233;cifique
</p>
<p>moun yo s&#233; moun la s&#233; moun lan moun yan les personnes
tab yo s&#233; tab la s&#233; tab la tab ya les tables
chyen yo s&#233; chyen la s&#233; chyen an chyen yan les chiens
zwazo yo s&#233; zozyo la s&#233; zw&#233;zo a zozo ya les oiseaux
</p>
<p>d&#233;monstratif moun sa yo s&#233; moun lasa s&#233; moun tala sa moun yan ces personnes
tab sa yo s&#233; tab lasa s&#233; tab tala sa tab ya ces tables
</p>
<p>TAB. 1 &#8211; D&#233;termination dans le groupe nominal
</p>
<p>Notons que certaines portions du syst&#232;me pr&#233;sent&#233; ici connaissent en pratique des variations
dans l&#8217;usage oral, notamment en ce qui concerne le degr&#233; de d&#233;termination sp&#233;cifique, dans les
r&#233;gions o&#249; le bilinguisme cr&#233;ole / fran&#231;ais est la r&#232;gle. Nous n&#8217;avons pas tent&#233; de prendre en
compte ces variations dans le pr&#233;sent &#233;tat de notre mod&#233;lisation.
</p>
<p>Temps et aspect dans le groupe pr&#233;dicatif
Une description classique donn&#233;e, en cr&#233;olistique, du syst&#232;me TMA (Temps, Mode, Aspect)
des langues cr&#233;oles &#171; atlantiques &#187;5 fait &#233;tat d&#8217;un syst&#232;me &#224; trois composantes s&#8217;ordonnant
suivant un ordre strict : marquage (ou non) d&#8217;un temps pass&#233; ; marquage (ou non) d&#8217;un mode
pouvant avoir des emplois de futur ou d&#8217;irr&#233;el, selon les contextes ; marquage (ou non) d&#8217;un
aspect imperfectif. Une version canonique de ce syst&#232;me est d&#233;crite en fran&#231;ais, par exemple,
par Valdman (1978), qui d&#233;finit ces trois cat&#233;gories comme une cat&#233;gorie de temps (pass&#233; ), et
deux cat&#233;gories d&#8217;aspect (prospectif et continuatif ). La marque du milieu (celle que Valdman
appelle prospectif) prend une valeur d&#8217;irr&#233;el lorsqu&#8217;elle est combin&#233;e avec un pass&#233;.
On a donc une combinatoire (t&#233; / &#8709;) &#215; (k&#233; / &#8709;) &#215; (ka / &#8709;) (en d&#233;signant ces marques par les
formes sous lesquelles elles se manifestent dans les trois cr&#233;oles guadeloup&#233;en, martiniquais et
</p>
<p>5On retrouve ce sch&#233;ma dans d&#8217;autres langues cr&#233;oles &#224; base anglaise.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>guyanais), qui engendre th&#233;oriquement les huit combinaisons possibles : &#8709;, ka, k&#233;, k&#233; ka, t&#233;,
t&#233; ka, t&#233; k&#233;, t&#233; k&#233; ka. Ces huit combinaisons sont attest&#233;es &#224; diff&#233;rents degr&#233;s, avec les valeurs
pr&#233;cis&#233;es dans le tableau 2. En cr&#233;ole ha&#239;tien, les formes correspondantes sont te, va et ap, et
les combinaisons pr&#233;sentent des formes contract&#233;es6.
</p>
<p>Ce sch&#233;ma de base conna&#238;t des variations. Ainsi le terme d&#8217;aspect &#171; imperfectif &#187; recouvre-
t-il un complexe de valeurs diverses (progressif, fr&#233;quentatif, ou simplement inaccompli) qui
se manifestent diff&#233;remment dans les diff&#233;rents dialectes consid&#233;r&#233;s. Ainsi, si la marque ka
recouvre tous ces aspects en cr&#233;ole guadeloup&#233;en ou martiniquais (jusqu&#8217;&#224; pouvoir prendre la
valeur temporelle g&#233;n&#233;rale correspondant au pr&#233;sent fran&#231;ais), il n&#8217;en va pas n&#233;cessairement
de m&#234;me en cr&#233;ole guyanais, et encore moins en ha&#239;tien (ou l&#8217;inaccompli est non-marqu&#233;, et
o&#249; la valeur aspectuelle la plus remarquable de la particule ap est le progressif &#8212; qui prend
fr&#233;quemment une valeur temporelle de futur). Le tableau 2 prend en compte ces diff&#233;rences.
</p>
<p>ha&#239;t. guad. mart. guya.
Accompli / Aoriste danse dans&#233; dans&#233; dans&#233;
Inaccompli / Pr&#233;sent danse ka dans&#233; ka dans&#233; (ka) dans&#233;
Fr&#233;quentatif danse ka dans&#233; ka dans&#233; ka dans&#233;
Progressif ap danse ka dans&#233; ka dans&#233; ka dans&#233;
Futur proche pral danse kay dans&#233; kay dans&#233; k&#8217;al&#233; / kay dans&#233;
Futur va danse k&#233; dans&#233; k&#233; dans&#233; k&#233; dans&#233;
Futur inaccompli (tr&#232;s peu fr&#233;q.) vap danse k&#233; ka dans&#233; k&#233; ka dans&#233; k&#233; ka dans&#233;
Pass&#233; accompli (plus-que-parfait) te danse t&#233; dans&#233; t&#233; dans&#233; t&#233; dans&#233;
Pass&#233; inaccompli tap danse t&#233; ka dans&#233; t&#233; ka dans&#233; t&#233; ka dans&#233;
Irr&#233;el ta danse t&#233; k&#233; dans&#233; t&#233; k&#233; dans&#233; t&#233; k&#233; dans&#233;
Irr&#233;el inaccompli ta vap danse t&#233; k&#233; ka dans&#233; t&#233; k&#233; ka dans&#233; t&#233; k&#233; ka dans&#233;
Conditionnel / Optatif ta danse t&#233; k&#233; dans&#233; s&#233; dans&#233; t&#233; k&#233; dans&#233;
</p>
<p>TAB. 2 &#8211; Marquage du temps et de l&#8217;aspect dans le groupe pr&#233;dicatif
</p>
<p>Dans les figures 1 et 2, nous montrons les &#233;l&#233;ments principaux de la mod&#233;lisation des donn&#233;es
linguistiques du groupe nominal, expos&#233;es dans le tableau 1, sous forme de TAGs int&#233;grant un
param&#232;tre de langue l 7.
On notera que les arbres Det Dem (gp,mq) et Plur (gp,mq), qui concernent deux dialectes parmi
les quatre (guadeloup&#233;en et martiniquais), figurent dans la couche g&#233;n&#233;rale sans risque d&#8217;inter-
f&#233;rer avec la construction du d&#233;monstratif ou du pluriel en ha&#239;tien ou en guyanais (les contraintes
d&#8217;unification ne permettent pas l&#8217;adjonction d&#8217;un d&#233;monstratif antillais sur un d&#233;monstratif ha&#239;-
tien ou guyanais, ni celle d&#8217;un pluriel antillais sur un pluriel ha&#239;tien ou guyanais).
L&#8217;adjonction du d&#233;monstratif en ha&#239;tien ou en guyanais se fait bien au-dessus du niveau des
compl&#233;ments de nom (attention au param&#232;tre bar dans les arbres Dem (gf) et Dem (ht)), mais
en-dessous de l&#8217;article sp&#233;cifique ; ex. moun Sentoma sa yo (ha&#239;t.) : les gens de Saint-Thomas ;
sa moun Senloran yan (guya.) : les gens de Saint-Laurent.
Le syst&#232;me TMA, quant &#224; lui, poss&#232;de des m&#233;canismes en grande partie communs : les arbres
auxiliaires qui mod&#233;lisent l&#8217;adjonction de valeurs aspectuelles ou temporelles sont donc tous
communs (fig. 3), &#224; la nuance pr&#232;s que celui qui rend compte de valeurs g&#233;n&#233;rales de l&#8217;aspect
</p>
<p>6va ap &gt; vap ; te ap &gt; tap ; te va &gt; ta ; te va ap &gt; ta vap.
7Les abr&#233;viations suivantes sont utilis&#233;es pour les attributs : bar = niveau de barre (1 = nom avec compl&#233;ments,
</p>
<p>mais sans d&#233;termination ; 2 = groupe nominal) ; nbr = nombre ; spe = d&#233;terminant sp&#233;cifique ; dem = d&#233;terminant
d&#233;monstratif ; cns = le constituant se termine par une consonne ; nas = le constituant se termine par une syllabe
nasale ; lan = langue. Les valeurs utilis&#233;s pour identifier les quatre cr&#233;oles sont bas&#233;es sur les codes bilitt&#233;raux de
la norme ISO-3166 pour les noms de pays : HT pour Ha&#239;ti, GP pour Guadeloupe, MQ pour Martinique, et GF pour
Guyane Fran&#231;aise. Les variables non-instanci&#233;es sont not&#233;es en italique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Grammaires factoris&#233;es
</p>
<p>N
</p>
<p>N (c,n,l)
</p>
<p>&gt;1=&lt;bar
&gt;
</p>
<p>&lt;dem &gt;=
=&lt;spe
</p>
<p>&gt;=&lt;lan l
&gt;n=&lt;nas
&gt;c=&lt;cns N*Det
</p>
<p>Ind (l) &gt;=
</p>
<p>&gt;1=&lt;bar
&gt;
</p>
<p>&lt;dem &gt;=
=&lt;spe
</p>
<p>&lt;lan l
</p>
<p>*N Det
</p>
<p>Spe (x,c,n,l)&gt;=
&gt;n=&lt;nas
</p>
<p>&lt;lan l
</p>
<p>&gt;=&lt;bar 1
</p>
<p>&gt;c=&lt;cns
&lt;dem = d &gt;
</p>
<p>N sans compl. Det Ind sg (*) Det Spe (*)
</p>
<p>N N
&gt;=
</p>
<p>=
</p>
<p>&gt;=&lt;bar
&gt;
</p>
<p>&lt;dem =
=&lt;spe
</p>
<p>&lt;lan l
&lt;nbr
</p>
<p>2
</p>
<p>x&gt;
d
</p>
<p>+
&gt;
</p>
<p>*N Det
</p>
<p>Dem (l)&gt;=
</p>
<p>&gt;1=&lt;bar
&gt;
</p>
<p>&lt;dem &gt;=
=&lt;spe
</p>
<p>&lt;lan l
</p>
<p>N*Det
</p>
<p>Plur (l) &gt;=
=
</p>
<p>=
</p>
<p>&gt;=&lt;bar 2
</p>
<p>&lt;lan l
&lt;nbr sing&gt;
</p>
<p>Plur (gp,mq)Det Dem (gp,mq)
</p>
<p>NN
&gt;=
</p>
<p>=
</p>
<p>&lt;lan l
&lt;nbr sing&gt;
</p>
<p>&gt;=&lt;bar 2
</p>
<p>&lt;dem &gt;= +
=&lt;spe +&gt;
</p>
<p>&gt;=
=
</p>
<p>=
</p>
<p>&gt;=&lt;bar 2
</p>
<p>&lt;lan l
&lt;nbr &gt;plur
</p>
<p>&gt;=
=
</p>
<p>&gt;=&lt;bar
&gt;
</p>
<p>&lt;dem &gt;=
=&lt;spe
</p>
<p>&lt;lan l
&lt;nbr sing&gt;
</p>
<p>2
</p>
<p>+&lt;spe
</p>
<p>&lt;spe +&gt;
</p>
<p>&gt;
</p>
<p>FIG. 1 &#8211; &#201;l&#233;ments communs de mod&#233;lisation du groupe nominal.
</p>
<p>N* Det
</p>
<p>Dem
</p>
<p>&gt;=&lt;bar 1
&lt;dem =
&lt;lan =
</p>
<p>&gt;
&gt;ht
</p>
<p>(ht)
</p>
<p>N
</p>
<p>Dem (ht)
</p>
<p>=
</p>
<p>&gt;=&lt;bar
</p>
<p>&lt;lan
&lt;nbr
</p>
<p>=
</p>
<p>1
</p>
<p>sing &gt;
&lt;dem &gt;
</p>
<p>&gt;
</p>
<p>= +
</p>
<p>ht
</p>
<p>N*Det
</p>
<p>Dem (gf)
</p>
<p>&gt;=&lt;bar 1
&lt;dem = &gt;
</p>
<p>=&lt;lan
&gt;n=&lt;nas
&gt;c=&lt;cns
</p>
<p>gf &gt;
</p>
<p>N
</p>
<p>Dem (gf)
</p>
<p>=&lt;lan
&gt;n=&lt;nas
&gt;c&lt;cns
</p>
<p>=
</p>
<p>&gt;=&lt;bar
</p>
<p>&lt;nbr
=
</p>
<p>1
</p>
<p>sing &gt;
&lt;dem &gt;= +
</p>
<p>gf&gt;
</p>
<p>FIG. 2 &#8211; &#201;l&#233;ments de mod&#233;lisation du groupe nominal sp&#233;cifiques au ha&#239;tien et au guyanais
</p>
<p>imperfectif (duratif, fr&#233;quentatif) ne s&#8217;unifie pas lorsque le param&#232;tre de langue indique le cr&#233;ole
ha&#239;tien. Ce sont ensuite les variables lexicales qui font la diff&#233;rence entre les dialectes8.
</p>
<p>4 Implantation informatique
</p>
<p>L&#8217;approche propos&#233;e a &#233;t&#233; test&#233;e avec une petite implantation des FS-TAG en PROLOG9 , d&#233;-
velopp&#233;e &#224; l&#8217;origine pour une autre application (Vaillant, 1999) et pour la langue allemande, et
adapt&#233;e ult&#233;rieurement au cr&#233;ole martiniquais (Vaillant, 2003). Cette grammaire est test&#233;e en
g&#233;n&#233;ration.
</p>
<p>Les arbres syntaxiques sont des structures r&#233;cursives compos&#233;es de triplets &#12296; cat, liste_ss_arbres,
traits &#12297;. L&#8217;&#233;l&#233;ment liste_ss_arbres peut consister soit en une liste de triplets ayant &#224; leur tour la
m&#234;me forme, soit en une &#233;tiquette lexicale (cas des n&#339;uds feuilles). Les familles d&#8217;arbres sont
g&#233;r&#233;es &#224; la vol&#233;e par l&#8217;unification d&#8217;&#233;tiquettes lexicales dans les arbres sch&#233;ma.
</p>
<p>Les op&#233;rations de substitution et d&#8217;adjonction sont d&#233;finies comme des pr&#233;dicats Prolog mani-
pulant des arbres. Chaque n&#339;ud substituable, dans un arbre, est porteur d&#8217;une &#233;tiquette ; celle-ci
doit &#234;tre fournie en argument &#224; l&#8217;op&#233;ration de substitution pour qu&#8217;elle &#171; sache &#187; &#224; quel en-
droit effectuer l&#8217;unification. La liste des correspondances entre n&#339;uds &#224; substituer et r&#244;les dans
</p>
<p>8Les abr&#233;viations suivantes sont utilis&#233;es pour les attributs dans la fig. 3 : Temps : pas = pass&#233; ; Aspects : psp =
prospectif ; prx = prospectif proximal (aspect imminent ~ valeur temporelle de futur proche) ; imp = imperfectif ;
prg = progressif.
</p>
<p>9Environnement utilis&#233; : SWI-Prolog, d&#233;velopp&#233; par Jan Wielemaker, Universit&#233; d&#8217;Amsterdam :
http://www.swi-prolog.org.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>N
</p>
<p>Ph
</p>
<p>=
</p>
<p>=
</p>
<p>&lt;lan l
&lt;bar 2&gt;
</p>
<p>&gt;
</p>
<p>Pred
</p>
<p>= l &gt;&lt;lan
</p>
<p>(l)V
</p>
<p>V intr. (*)
</p>
<p>Pred
</p>
<p>Pred *Asp
</p>
<p>&gt;= +&lt;psp
</p>
<p>=
</p>
<p>&lt;psp &gt;=
&lt;pas &gt;
</p>
<p>&gt;=&lt;lan l
</p>
<p>Prospectif (*)
</p>
<p>Prosp (l)
</p>
<p>&gt;=
=
</p>
<p>&gt;=
</p>
<p>&lt;lan l
</p>
<p>&lt;prg
&lt;imp &gt;=
&lt;psp &gt;=
&lt;pas &gt;
</p>
<p>Pred
</p>
<p>Pred *Asp
</p>
<p>Imp (l)
</p>
<p>Progressif (*)
</p>
<p>&lt;prg &gt;= +
&lt;imp &gt;+=
</p>
<p>=
</p>
<p>&gt;=&lt;prg
&lt;imp &gt;=
&lt;psp &gt;=
&lt;pas &gt;
</p>
<p>&gt;=&lt;lan l
</p>
<p>Pred
</p>
<p>Pred *Asp
&gt;=
</p>
<p>&gt;=&lt;lan l
</p>
<p>Futur proche (*)
</p>
<p>&gt;= +
=
</p>
<p>&lt;psp
&gt;&lt;prx +
</p>
<p>Prox (l)
</p>
<p>=
</p>
<p>&lt;psp
&lt;pas &gt;
</p>
<p>Pred
</p>
<p>Pred *Asp
</p>
<p>Imp (l)
</p>
<p>Imperfectif g&#233;n&#233;ral (gp,mq,gf)
</p>
<p>&lt;prg =
&lt;imp &gt;+=
</p>
<p>&gt;
</p>
<p>=
</p>
<p>=
</p>
<p>&lt;lan
</p>
<p>&lt;prg
&lt;imp &gt;=
&lt;psp &gt;=
&lt;pas &gt;
</p>
<p>&gt;
</p>
<p>= l = &gt;gp|mq|gf
</p>
<p>Pred
</p>
<p>Pred *
</p>
<p>&gt;= +
</p>
<p>Pass&#233; (*)
</p>
<p>Tem
</p>
<p>Pas (l)
</p>
<p>&lt;pas
</p>
<p>=&lt;pas &gt;
&gt;=&lt;lan l
</p>
<p>FIG. 3 &#8211; &#201;l&#233;ments communs de mod&#233;lisation du groupe pr&#233;dicatif
</p>
<p>la structure argumentale du lex&#232;me pr&#233;dicatif est g&#233;r&#233;e par une liste qui est int&#233;gr&#233;e dans la
description de ces lex&#232;mes sous forme d&#8217;arbres &#233;l&#233;mentaires.
</p>
<p>Pour l&#8217;adjonction en revanche, la structure argumentale n&#8217;est pas disponible dans la description
de l&#8217;arbre initial (mais dans celle de l&#8217;arbre auxiliaire) : il n&#8217;existe pas de sp&#233;cification pr&#233;cise a
priori du n&#339;ud de l&#8217;arbre initial auquel l&#8217;adjonction doit &#234;tre r&#233;alis&#233;e (puisque tout arbre initial
se suffit &#224; lui-m&#234;me, et peut se passer d&#8217;adjonction). Afin de situer le lieu d&#8217;adjonction le plus
ad&#233;quat, nous avons programm&#233; une op&#233;ration d&#8217;adjonction &#171; &#224; proximit&#233; de &#187;. Cette op&#233;ration
rep&#232;re, dans l&#8217;arbre initial sur lequel doit se faire l&#8217;adjonction, le n&#339;ud feuille correspondant au
lex&#232;me argument, et tente d&#8217;adjoindre l&#8217;arbre auxiliaire &#171; au plus bas &#187;, c&#8217;est-&#224;-dire au n&#339;ud
de cat&#233;gorie compatible situ&#233; le plus bas possible sur le chemin allant du lex&#232;me feuille &#224; la
racine de l&#8217;arbre initial. Cette fa&#231;on de proc&#233;der &#233;vite que des d&#233;terminants ne se branchent &#224;
un niveau trop &#233;lev&#233; dans l&#8217;arbre.
</p>
<p>Le principe de base du g&#233;n&#233;rateur est le suivant : le graphe s&#233;mantique est parcouru &#224; partir
d&#8217;un n&#339;ud, et le programme tente d&#8217;engendrer un arbre initial correspondant &#224; l&#8217;expression du
lex&#232;me correspondant et de sa structure argumentale. Si une partie du graphe s&#233;mantique reste
non-g&#233;n&#233;r&#233;e apr&#232;s cette premi&#232;re passe directe, le programme essaye de l&#8217;exprimer sous forme
d&#8217;arbre auxiliaire et de l&#8217;adjoindre &#224; l&#8217;arbre d&#233;j&#224; existant. Ce principe est appliqu&#233; r&#233;cursive-
ment.
</p>
<p>En ce qui concerne l&#8217;application de notre approche factoris&#233;e : celle-ci est simplement r&#233;alis&#233;e
par l&#8217;ajout de la contrainte d&#8217;une valeur pr&#233;cise du param&#232;tre langue au niveau du r&#233;sultat
souhait&#233;. La figure 4 illustre l&#8217;application de cette m&#233;thode.
Le gain en termes de quantit&#233; de repr&#233;sentations grammaticales peut ici &#234;tre &#233;valu&#233; de mani&#232;re
grossi&#232;re par le rapport de volume entre l&#8217;ensemble des fichiers utilis&#233;s dans la version qua-
drilingue de la mod&#233;lisation, et l&#8217;ensemble des fichiers utilis&#233;s pour la version martiniquaise
seulement : ce rapport est d&#8217;environ 210 %10. En partant du postulat (pour simplifier) selon
</p>
<p>10Cette &#233;valuation est biais&#233;e par le fait qu&#8217;outre le passage &#224; un travail de mod&#233;lisation pluridialectal, nous
avons &#233;galement augment&#233; la quantit&#233; de ph&#233;nom&#232;nes grammaticaux d&#233;crits ; elle est donc probablement encore
sur&#233;valu&#233;e par rapport &#224; ce qu&#8217;elle pourrait &#234;tre dans le cas id&#233;al. Afin de proposer une &#233;valuation plus rigoureuse
du gain, nous devrions &#171; mettre &#224; jour &#187; la version martiniquaise seulement de fa&#231;on &#224; ce qu&#8217;elle ait exactement la
m&#234;me couverture que la version factoris&#233;e actuelle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Grammaires factoris&#233;es
</p>
<p>FIG. 4 &#8211; Deux exemples de phrases engendr&#233;es par le syst&#232;me &#224; partir d&#8217;un graphe s&#233;mantique (G) :
une phrase en cr&#233;ole martiniquais (&#171; S&#233; moun-tala t&#233; ka bw&#232; vy&#233; tafia &#187;) et la phrase correspondante
en cr&#233;ole guyanais (&#171; Sa moun-yan t&#233; ka bw&#232; vy&#233; tafia &#187;). Sans contrainte sur le trait langue (ap-
pel au pr&#233;dicat &#8216;connected_tree(G,Arbre,[]).&#8217;), quatre phrases sont g&#233;n&#233;r&#233;es (correspon-
dant aux quatre dialectes repr&#233;sent&#233;s). Pour limiter la g&#233;n&#233;ration &#224; une seule langue, on impose une
contrainte sur le trait langue au niveau le plus &#233;lev&#233; du graphe, qui emp&#234;che l&#8217;unification avec les autres
possibilit&#233;s (en appelant par exemple &#8216;connected_tree(G,Arbre,[]), Arbre=[ph,X,LT],
member([lan,mq],LT).&#8217;).
</p>
<p>lequel chaque lexique-grammaire unilingue aurait environ la m&#234;me taille, notre mod&#233;lisation
permet donc de passer d&#8217;un facteur 4 &#224; un facteur 2,1, soit un gain de 48 %.
</p>
<p>5 Discussion et Conclusion
</p>
<p>Le choix de mod&#233;lisation d&#233;crit plus haut (&#167; 2) peut sembler contre-intuitif si l&#8217;on raisonne
suivant les habitudes de la linguistique structurale, pour laquelle la langue est par d&#233;finition
le syst&#232;me englobant les diff&#233;rentes cat&#233;gories, et ne saurait donc elle-m&#234;me constituer l&#8217;une
des cat&#233;gories. Il se justifie pourtant en pratique, par sa capacit&#233; &#224; cristalliser les structures
communes de diff&#233;rents dialectes proches : cela revient alors &#224; consid&#233;rer ces derniers comme
des sous-syst&#232;mes d&#8217;un m&#233;ta-syst&#232;me plus g&#233;n&#233;rique.
</p>
<p>La mod&#233;lisation du syst&#232;me d&#8217;un locuteur monolingue s&#8217;obtient alors, tout simplement, en ins-
tanciant le param&#232;tre langue &#224; l&#8217;une de ses valeurs possibles, en &#233;cr&#233;mant les arbres qui ne
peuvent pas s&#8217;unifier avec cette valeur, puis en effa&#231;ant le param&#232;tre &#8212; devenu redondant &#8212; de
toutes les descriptions. On peut donc, par cette proc&#233;dure, sp&#233;cifier la description de la famille
de dialectes pour retomber sur la description, plus classique, d&#8217;une langue unique et homog&#232;ne.
</p>
<p>Il est utile de remarquer, par ailleurs, que notre mod&#232;le de description &#171; &#224; couches &#187; apporte
potentiellement un aper&#231;u int&#233;ressant de ce que pourrait &#234;tre le syst&#232;me linguistique interne (I-
Language) d&#8217;un locuteur multilingue alternant entre ces diff&#233;rents dialectes. De tels locuteurs
existent, dans certaines situations sociolinguistiques : ce n&#8217;est pas g&#233;n&#233;ralement le cas des An-
tillais de Guadeloupe ou de Martinique (qui sont plut&#244;t bilingues cr&#233;ole / fran&#231;ais), mais c&#8217;est le
cas des membres des communaut&#233;s ha&#239;tiennes de Guadeloupe et de Guyane (plusieurs dizaines
de milliers de personnes dans chaque cas), et sans doute de ceux des communaut&#233;s antillo-
guyanaises des grandes agglom&#233;rations de m&#233;tropole (o&#249; une nouvelle koin&#232; pan-cr&#233;ole peut
se constituer). La th&#233;orie TAG a d&#233;j&#224; &#233;t&#233; utilis&#233;e pour la mod&#233;lisation de processus cognitifs</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pascal Vaillant
</p>
<p>(par exemple sur la question de l&#8217;acquisition de la langue maternelle, par Frank (2000)). Nous
l&#8217;utilisons ici (bien que l&#8217;utilisation d&#8217;autres formalismes e&#251;t &#233;galement &#233;t&#233; possible) dans un
contexte qui rend possible d&#8217;aborder ce type de questions. La mod&#233;lisation de la grammaire
du I-Language d&#8217;un sujet bilingue peut constituer un sujet d&#8217;&#233;tude passionnant, si l&#8217;on accepte
de lever l&#8217;hypoth&#232;se simpliste des r&#233;pertoires cloisonn&#233;s11. Cela ne constitue bien s&#251;r pas notre
propos ici, mais cela montre un int&#233;r&#234;t th&#233;orique potentiel du type de travaux expos&#233;, et un cas
possible de retournement de point de vue &#8212; dans lequel le choix de consid&#233;rer la langue comme
un param&#232;tre alternant dans un m&#233;ta-syst&#232;me passerait du statut de bug &#224; celui de feature .
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A. (1993). Les nouvelles syntaxes. Paris: Armand Colin.
CANDITO M.-H. (1998). Building parallel LTAG for French and Italian. In Proceedings of
the 17th International Conference on Computational Linguistics (COLING 1998), p. 211&#8211;217,
Montr&#233;al (Qu&#233;bec, Canada).
CHOMSKY N. (1995). The Minimalist Program. Current studies in linguistics. Cambridge
(Massachussets, &#201;.-U.-A.): MIT Press.
DAMOISEAU R. (2007). Le cr&#233;ole guyanais dans la famille des cr&#233;oles &#224; base lexicale fran-
&#231;aise de la zone am&#233;ricano-cara&#239;be. In S. MAM-LAM-FOUCK, Ed., Comprendre la Guyane
d&#8217;aujourd&#8217;hui, p. 501&#8211;514, Matoury (Guyane Fran&#231;aise): Ibis Rouge.
FRANK R. (2000). From regular to context-free to mildly context-sensitive tree rewriting
systems: The path of child language acquisition. In A. ABEILL&#201; &amp; O. RAMBOW, Eds., Tree
Adjoining Grammars: Formalisms, Linguistic Analysis and Processing, p. 101&#8211;120, Stanford
(Californie, &#201;.-U.-A.): CSLI Publications.
HAZA&#203;L-MASSIEUX M.-C. (2002). Les cr&#233;oles &#224; base fran&#231;aise : une introduction. TIPA
(Travaux Interdisciplinaires du laboratoire Parole et Langage d&#8217;Aix-en-Provence), 21, 63&#8211;86.
Disponible en ligne : http://aune.lpl.univ-aix.fr/lpl/tipa/21/tipa21-hazael.pdf.
PF&#196;NDER S. (2000). Aspekt und Tempus im Frankokreol. ScriptOralia. T&#252;bingen (Alle-
magne): G&#252;nter Narr Verlag.
THOMASON S. &amp; KAUFMAN T. (1988). Language Contact, Creolization, and Genetic Lin-
guistics. Berkeley (Californie, &#201;.-U.-A.): University of California Press.
VAILLANT P. (1999). Learning to Communicate in German through an Iconic Input Inter-
face: Presentation of the GLOTTAI Project. Rapport interne, Humboldt Universit&#228;t zu Berlin.
Disponible en ligne : http://www.vaillant.nom.fr/pascal/glottai/presentation/.
VAILLANT P. (2003). Une grammaire formelle du cr&#233;ole martiniquais pour la g&#233;n&#233;ration
automatique. In B. DAILLE, Ed., Actes de TALN 2003 (Traitement automatique des langues
naturelles), p. 255&#8211;264, Batz-sur-mer: ATALA IRIN.
VALDMAN A. (1978). Le cr&#233;ole : structure, statut et origine. Paris: Klincksieck.
VIJAY-SHANKER K. &amp; JOSHI A. (1988). Feature-structure based Tree Adjoining Grammars.
In Proceedings of the 12th International Conference on Computational Linguistics (COLING
1988), p. 714&#8211;719, Budapest (Hongrie).
</p>
<p>11Une th&#232;se sur ce sujet est en cours &#224; l&#8217;Universit&#233; des Antilles-Guyane (Jocelyne Litou).</p>

</div></div>
</body></html>