<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Discourse Representation Theory et graphes s&#233;mantiques : formalisation s&#233;mantique en contexte industriel</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Discourse Representation Theory et graphes s&#233;mantiques :
formalisation s&#233;mantique en contexte industriel
</p>
<p>Maxime Amblard Johannes Heinecke Estelle Maillebuau
Orange Labs, 2 av. Pierre Marzin, 22307 Lannion cedex
</p>
<p>{maxime.amblard, johannes.heinecke,
estelle.maillebuau}@orange-ftgroup.com
</p>
<p>R&#233;sum&#233;. Ces travaux pr&#233;sentent une extension des repr&#233;sentations formelles pour la s&#233;-
mantique, de l&#8217;outil de traitement automatique des langues de Orange Labs1. Nous abordons
ici uniquement des questions relatives &#224; la construction des repr&#233;sentations s&#233;mantiques, dans
le cadre de l&#8217;analyse linguistique. Afin d&#8217;obtenir des repr&#233;sentations plus fines de la structure
argumentale des &#233;nonc&#233;s, nous incluons des concepts issus de la DRT dans le syst&#232;me de repr&#233;-
sentation bas&#233; sur les graphes s&#233;mantiques afin de rendre compte de la notion de port&#233;e.
</p>
<p>Abstract. This works present an extension of the formal representation of semantic for
the natural language processing tool developped at Orange Labs. We cover here only issues re-
lating to build the semantic representations, based on linguistic parsing. To obtain more detailed
representations of the argumental structure statements, we include insights from the DRT in the
system of representation based on the semantic graphs to give an account of scope.
</p>
<p>Mots-cl&#233;s : Mod&#232;le s&#233;mantique, analyse syntaxique en d&#233;pendance, DRT.
</p>
<p>Keywords: Semantic modelling, parsing, DRT.
</p>
<p>Un grand nombre d&#8217;applications en lien avec les technologies r&#233;centes (internet, etc.) s&#8217;orientent
vers des th&#233;matiques dites s&#233;mantiques. Nous souhaitons associer automatiquement &#224; des don-
n&#233;es informatis&#233;es une interpr&#233;tation plus large que ce que peut apporter un lexique s&#233;mantique
standard, tout en maintenant une forte coh&#233;rence dans les syt&#232;mes de repr&#233;sentation. Bien que
la terminologie s&#233;mantique reste actuellement ambigu&#235;, nous souhaitons nous inscrire dans ces
prospectives. Nous proposons une extension &#224; la notion de port&#233;e du mod&#232;le de repr&#233;sentation
s&#233;mantique utilis&#233; dans l&#8217;outil de traitement automatique des langues de Orange Labs.
</p>
<p>Des d&#233;veloppements, conduits depuis plus d&#8217;une d&#233;cennie ont permis de proposer un syst&#232;me
d&#8217;analyse et de g&#233;n&#233;ration, appel&#233; TiLT. Chaque traitement linguistique propose des degr&#233;s de
finesse &#224; ajuster qui permettent son utilisation pour des t&#226;ches de TAL diverses. Nous nous
sommes focalis&#233;s sur l&#8217;interface entre syntaxe et s&#233;mantique. Ici, la s&#233;mantique rend compte de
relations via des propri&#233;t&#233;s logiques, dans la continuit&#233; de (Retor&#233;, 2008) et (Blackburn et al.,
1999), ainsi que de (Asher &amp; Lascarides, 2003) pour les aspects dynamiques.
</p>
<p>Nous utilisons les analyses syntaxiques fournies par l&#8217;analyseur TiLT, ainsi que les premi&#232;res
repr&#233;sentations s&#233;mantiques. Le mod&#232;le choisi est bas&#233; sur la notion de graphe conceptuel,
(Sowa, 1964). Cette th&#233;orie est largement d&#233;velopp&#233;e comme outil de mod&#233;lisation de la lo-
gique. Afin d&#8217;&#233;tendre le mod&#232;le de repr&#233;sentation nous nous sommes orient&#233;s vers la Discourse
</p>
<p>1France T&#233;l&#233;com R&amp;D</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maxime Amblard, Johannes Heinecke et Estelle Maillebuau
</p>
<p>Representation Theory (DRT), (Kamp &amp; Reyle, 1993). Cette th&#233;orie propose une mod&#233;lisation
simple des notions de port&#233;e que nous souhaitons inclure.
</p>
<p>Nous illustrerons les diff&#233;rentes repr&#233;sentations pr&#233;c&#233;dentes et nouvelles propri&#233;t&#233;s propos&#233;es
au travers de l&#8217;exemple principal de cet article :
</p>
<p>(1) Paul avale un m&#233;dicament
</p>
<p>Nous reviendrons dans un premier temps sur les cadres g&#233;n&#233;raux utilis&#233;s (section 1) : contexte
de ces d&#233;veloppements, graphes s&#233;mantiques et DRT. Nous pr&#233;senterons l&#8217;interface syntaxe-
s&#233;mantique mise en &#339;uvre dans TiLT (section 2). Puis nous expliciterons les choix des concepts
issus de la DRT pour la mod&#233;lisation s&#233;mantique qui augmentent la pertinence du mod&#232;le (sec-
tion 3). Enfin nous conclurons en mettant en perspective d&#8217;autres utilisations possibles de la
DRT dans notre mod&#232;le (section 4).
</p>
<p>1 Cadres g&#233;n&#233;raux : applicatif et formel
</p>
<p>1.1 Contexte industriel
</p>
<p>Les recherches pr&#233;sent&#233;es ici sont le prolongement de diff&#233;rents d&#233;veloppements r&#233;alis&#233;s ces
derni&#232;res ann&#233;es. La question de la mod&#233;lisation s&#233;mantique est &#224; la fois fortement d&#233;pendante
des repr&#233;sentations syntaxiques, et &#233;galement corr&#233;l&#233;e &#224; la structuration des donn&#233;es lexicales.
Toutefois, le calcul de repr&#233;sentations s&#233;mantiques reste incontournable pour des syst&#232;mes de
TAL, comme ceux d&#233;velopp&#233;s par Orange Labs.
</p>
<p>La premi&#232;re perspective d&#8217;utilisation du niveau s&#233;mantique envisag&#233;e a &#233;t&#233; le d&#233;veloppement
d&#8217;un outil de traduction automatique. Le but &#233;tait de partager des repr&#233;sentations abstraites de la
distribution argumentale des pr&#233;dicats associ&#233;s aux mots d&#8217;un &#233;nonc&#233; d&#8217;une langue source, afin
de les transposer dans une langue cible. Le r&#233;sultat respecte alors la distribution de d&#233;part. Le ni-
veau s&#233;mantique a &#233;t&#233; utilis&#233; et &#233;valu&#233; comme substitut &#224; un pivot langagier, (Iheddadene, 2007;
Park et al., 2007), pour une application intervenant dans la relation entre un client francophone
et un pharmacien anglophone, outil o&#249; la fiabilit&#233; est n&#233;cessaire. Cependant, cette perspective
est actuellement en veille car le mod&#232;le s&#233;mantique pose des questions structurelles.
</p>
<p>Ce syst&#232;me est &#233;galement utilis&#233; dans une application d&#8217;aide &#224; la communication entre per-
sonnes sourdes et entendantes, (Kervajan et al., 2007). Pour transcrire en s&#233;quence sign&#233;e un
&#233;nonc&#233; d&#8217;une langue parl&#233;e, la simple analyse syntaxique ne suffit pas. Nous avons besoin de
mettre en &#339;uvre des concepts plus &#233;labor&#233;s. Les repr&#233;sentations s&#233;mantiques permettent de
r&#233;cup&#233;rer tout ou partie de cette information.
</p>
<p>Enfin, un troisi&#232;me aspect de la mod&#233;lisation s&#233;mantique est utilis&#233; dans la production d&#8217;outil
liant repr&#233;sentations abstraites (du type ontologique) et donn&#233;es primaires. Une application per-
mettant de maintenir et rechercher des documents dans une grande masse de donn&#233;es &#224; partir
de concepts de haut niveau a &#233;t&#233; d&#233;velopp&#233;e, (Heinecke, 2006).
</p>
<p>1.2 Graphes S&#233;mantiques
</p>
<p>La repr&#233;sentation choisie est issue de la th&#233;orie des graphes conceptuels de Sowa, (1964). Cette
th&#233;orie a pour but de proposer une repr&#233;sentation sous forme de graphes des formules logiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DRT et graphes s&#233;mantiques
</p>
<p>L&#8217;origine de ces travaux &#233;tait de proposer une mod&#233;lisation pour le TAL.
</p>
<p>L&#8217;avantage que propose de telles repr&#233;sentations est sans conteste une plus grande facilit&#233; de
lecture et de repr&#233;sentation des &#233;l&#233;ments intervenant dans ces structures. De plus, cette commu-
naut&#233; a &#233;galement propos&#233; un ensemble d&#8217;op&#233;rations sur ces graphes permettant efficacement la
mise en relation entre eux. Ces propri&#233;t&#233;s permettent ainsi facilement de relier un graphe associ&#233;
&#224; un &#233;nonc&#233;, &#224; un graphe qui est une mod&#233;lisation abstraitre des relations entre concepts2.
</p>
<p>Cependant, si les relations pr&#233;dicats/variables des formules logiques trouvent naturellement leur
correspondance dans la repr&#233;sentation sous forme de graphe, il est moins ais&#233; de rendre compte
de certains concepts de plus haut niveau, en particulier ce qui a trait &#224; la mod&#233;lisation des port&#233;es
des op&#233;rateurs. Ces perspectives n&#8217;avaient pas &#233;t&#233; retenues dans la mod&#233;lisation initiale.
</p>
<p>Les graphes s&#233;mantiques portent sur des &#233;l&#233;ments appel&#233;s individus qui mat&#233;rialisent un objet
physique ou abstrait, une situation, un &#233;v&#233;nement de la repr&#233;sentation. On leur associe alors
un num&#233;ro unique. Les relations entre individus sont repr&#233;sent&#233;es au travers de pr&#233;dicats. Ces
derniers ont pour fonction de mat&#233;rialiser le signifiant d&#8217;un mot ou d&#8217;un morph&#232;me. Chacun
poss&#232;de des participants (individus) en nombre constant, cependant ils n&#8217;apparaissent dans la
repr&#233;sentation que dans le cas o&#249; ils sont sp&#233;cifi&#233;s. Chacun re&#231;oit alors un r&#244;le th&#233;matique ou
une fonction pr&#233;d&#233;finie par le pr&#233;dicat.
</p>
<p>Cette derni&#232;re propri&#233;t&#233; les diff&#233;rencie de la d&#233;finition logique traditionnelle de pr&#233;dicat. Pour
marquer cette association entre attribution th&#233;matique et argument du pr&#233;dicat, nous utilisons le
symbole &#171; = &#187;. Il faut alors voir cette relation intra-argument comme une forme de transtypage
des types s&#233;mantiques de base associ&#233;s aux individus vers les r&#244;les th&#233;matiques.
</p>
<p>Ainsi, on peut d&#233;finir formellement un graphe s&#233;mantique qui repr&#233;sente partiellement le
contenu informationnel d&#8217;un &#233;nonc&#233; en langue naturelle sous forme de graphe orient&#233; acyclique.
</p>
<p>Soit G un graphe s&#233;mantique, G est un quadruplet tel que G=&lt;Vpred,Vind,E,&#966;&gt; o&#249;:
&#8211; Vpred est l&#8217;ensemble des n&#339;uds repr&#233;sentant des pr&#233;dicats.
&#8211; Vind est l&#8217;ensemble des n&#339;uds repr&#233;sentant des individus.
&#8211; E est l&#8217;ensemble des ar&#234;tes
&#8211; &#966; est une fonction de E &#8594; (Vind&#215;Vpred) qui associe les ar&#234;tes &#224; des n&#339;uds.
</p>
<p>Les n&#339;uds repr&#233;sentent des pr&#233;dicats ou des individus et les ar&#234;tes les liens entre ces &#233;l&#233;ments
&#233;tiquet&#233;s par le r&#244;le ou la fonction attribu&#233;e. On note G l&#8217;ensemble des sous-graphes de G.
</p>
<p>1.3 Discourse Representation Theory - DRT
</p>
<p>La DRT a &#233;t&#233; con&#231;ue pour rendre compte de deux types de probl&#232;mes connexes :
1. proposer un m&#233;canisme d&#8217;unification des variables. L&#8217;id&#233;e principale est de proposer un
</p>
<p>syst&#232;me de repr&#233;sentation permettant la mod&#233;lisation des relations discursives comme la
r&#233;solution des anaphores pronominales (intra- et inter- phrastique),
</p>
<p>2. rendre compte d&#8217;un probl&#232;me classique relatif aux Donkey sentences3.
Ces perspectives ont permis d&#8217;&#233;laborer un formalisme qui utilise des formules logiques pour
proposer une repr&#233;sentation s&#233;mantique, ainsi qu&#8217;une interface entre s&#233;mantique et discours.
</p>
<p>2Ici, cette repr&#233;sentation est un type d&#8217;ontologie.
3Les Donkey sentences sont des phrases o&#249; les interactions entre la port&#233;e d&#8217;un quantificateur universel et d&#8217;un
</p>
<p>existentiel sont complexes, par exemple : tout fermier qui poss&#232;de un &#226;ne le bat.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maxime Amblard, Johannes Heinecke et Estelle Maillebuau
</p>
<p>Les &#233;volutions de la DRT ont &#233;t&#233; men&#233;es en int&#233;grant les &#233;v&#233;nements et leurs relations dans la
construction du discours. On trouvera une pr&#233;sentation d&#233;taill&#233;e de leur utilisation dans (Bus-
quets et al., 2001). Cette th&#233;orie a fait l&#8217;objet de nombreuses propositions, en particulier sur
la construction des structures de repr&#233;sentation, (Amsili &amp; Roussarie, 2004), et l&#8217;utilisation de
calculs &#233;labor&#233;s, par exemple la sous-sp&#233;cification dans (Schilder, 1998).
</p>
<p>Afin de mod&#233;liser les relations entre les &#233;l&#233;ments pr&#233;sents dans l&#8217;&#233;nonc&#233;, la DRT utilise la
logique du premier ordre. Ainsi, &#224; chaque mot est associ&#233; un pr&#233;dicat au sens traditionnel. Les
liens entre les pr&#233;dicats sont r&#233;alis&#233;s par des variables.
</p>
<p>Pour l&#8217;exemple (1), nous obtiendrons les pr&#233;dicats avaler(e,x,y),me&#769;dicament(z) et Paul. L&#8217;uni-
fication entre les variables est d&#233;l&#233;gu&#233;e &#224; un m&#233;canisme externe. Les variables mises en jeu dans
cette construction sont d&#233;clar&#233;es gr&#226;ce &#224; des quantificateurs qui sont repr&#233;sent&#233;s par des Dis-
course Reprentation Structures (DRS). Les DRS sont des structures compos&#233;es de deux parties:
la premi&#232;re exhibant une liste de variables relatives &#224; la DRS et la seconde la liste des formules
sur lesquelles les variables ont port&#233;e.
</p>
<p>Ainsi, on donne de mani&#232;re effective la port&#233;e d&#8217;un quantificateur sur les variables d&#8217;une des-
cription. La figure 1 pr&#233;sente les DRS pour les quantifications existentielle et universelle, cor-
respondant aux syntagmes un m&#233;dicament et les m&#233;dicaments.
</p>
<p>x
</p>
<p>me&#769;dicament(x)
x
</p>
<p>me&#769;dicament(x)
</p>
<p>(a) (b)
</p>
<p>FIG. 1 &#8211; Repr&#233;sentation sous forme de DRS de la quantification existentielle (a) du syntagme
&#171;un m&#233;dicament&#187; et de la quantification universelle (b) du syntagme &#171;les m&#233;dicaments&#187;
</p>
<p>Afin de repr&#233;senter de mani&#232;re simplifi&#233;e ces DRS, nous reprenons la notation utilis&#233;e dans
(Amblard, 2007) &#224; partir des crochets. La quantification existentielle est not&#233;e: [x|me&#769;dicament(x)]
et la quantification universelle: [|[x|me&#769;dicament(x)]].
Un objectif important de la DRT est de mod&#233;liser les relations de discours. Pour cela, elle
adopte la position Davidsonienne, (Davidson, 1967), et r&#233;ifie (d&#233;signer l&#8217;action ou le fait par
une variable particuli&#232;re) les formules. Elle associe des relations discursives entre variables
d&#8217;&#233;v&#233;nement. Nous n&#8217;int&#233;grons pas ces propri&#233;t&#233;s dans nos repr&#233;sentations, mais supposons
que leur int&#233;gration, au moins pour les relations intra-phrastiques entre &#233;v&#233;nements, est une
prolongation pertinente de ces travaux.
</p>
<p>2 Fonctionnement des repr&#233;sentations s&#233;mantiques
</p>
<p>Les mises en &#339;uvre de l&#8217;analyse s&#233;mantique offrent des perspectives nombreuses et diverses.
Nous nous attacherons dans cet expos&#233; uniquement &#224; ce qui concerne l&#8217;analyse composition-
nelle de la s&#233;mantique, laissant les questions li&#233;es &#224; la s&#233;mantique du discours, ainsi que celles
relatives &#224; la s&#233;mantique lexicale. L&#8217;outil principal que nous d&#233;veloppons fournit une repr&#233;-
sentation s&#233;mantique. La mod&#233;lisation choisie en utilise un fragment pour donner des graphes</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DRT et graphes s&#233;mantiques
</p>
<p>s&#233;mantiques. Ils ont pour but de fournir une repr&#233;sentation des relations pr&#233;dicatives extraites
&#224; partir de l&#8217;analyse syntaxique des &#233;nonc&#233;s. Ce sont des graphes orient&#233;s acycliques. Pour
parvenir &#224; ce calcul, plusieurs types de donn&#233;es et repr&#233;sentations doivent &#234;tre mobilis&#233;es, en
particulier les donn&#233;es lexico-s&#233;mantiques qui sont regroup&#233;es et organis&#233;es dans des lexiques
et un thesaurus o&#249; des pr&#233;dicats sont associ&#233;s aux entr&#233;es lexicales. Cet ensemble permet de
sp&#233;cifier des sens diff&#233;rents en fonction de l&#8217;utilisation faite des mots.
</p>
<p>Pour l&#8217;&#233;nonc&#233; (1), on utilise un pr&#233;dicat associ&#233; au mot &#171; avaler &#187; qui prend deux arguments.
L&#8217;un en relation d&#8217;agent, en l&#8217;occurrence Paul, et l&#8217;autre en relation de th&#232;me, ici un m&#233;dica-
ment. Les assignations de r&#244;les th&#233;matiques sont alors vues comme un trans-typage des argu-
ments. Donc, ce pr&#233;dicat est: OPERATION.avaler(agent=x19, situation=x17, th&#232;me=x18). Nous
avons fait le choix d&#8217;introduire des arguments servant &#224; repr&#233;senter les &#233;v&#233;nements d&#233;crits (si-
tuations). Comme nous ne construisons pas des formules, nous ne parlerons pas de r&#233;ification.
Cependant, nous adoptons la position Davidsonienne, pr&#233;c&#233;demment &#233;voqu&#233;e. Le probl&#232;me est
d&#8217;unifier les variables x17, x18, x19 qui d&#233;notent des individus de la repr&#233;sentation. Ainsi, l&#8217;agent
du pr&#233;dicat OPERATION.avaler doit avoir le m&#234;me r&#233;f&#233;rent que l&#8217;entit&#233; npr.Paul(x19).
</p>
<p>Le graphe de la figure 2 est construit &#224; partir de l&#8217;analyse syntaxique (en d&#233;pendance) r&#233;ali-
s&#233;e par le syst&#232;me TiLT. Pour cela, l&#8217;analyse s&#233;mantique utilise les donn&#233;es du type cat&#233;gorie,
traits morpho-syntaxiques, etc. Un ensemble de r&#232;gles se charge de cr&#233;er ces relations. Pour
</p>
<p>OPERATION.avaler
</p>
<p>situation
</p>
<p>FORM~AFFIRM
</p>
<p>affirm
</p>
<p>NOMBRE~SING
</p>
<p>x18
</p>
<p>patientnumber
</p>
<p>th&#232;me x17
x19
</p>
<p>agent
</p>
<p>INDEF.artIndef
</p>
<p>det
</p>
<p>npr~Paul
</p>
<p>entity
</p>
<p>ACTIVE_SUBSTANCE.m&#233;dicament
</p>
<p>FIG. 2 &#8211; Graphe S&#233;mantique de &#171; Paul avale un m&#233;dicament &#187;.
</p>
<p>chaque fonction syntaxique d&#233;tect&#233;e dans l&#8217;arbre de d&#233;pendance, le syst&#232;me cherche une r&#232;gle
qui lui correspond. Par exemple, pour la relation de d&#233;pendance SUJ entre npr.Paul et OPERA-
TION.avaler correspond la r&#232;gle:
</p>
<p>SUJ : P/suj = D/narg0
</p>
<p>Cette r&#232;gle peut s&#8217;interpr&#233;ter comme &#171;dans la relation SUJ, les variables doivent &#234;tre unifi&#233;es
entre l&#8217;item qui a la fonction sujet dans la principale et l&#8217;item qui a la fonction narg0 du d&#233;pen-
dant&#187;. Il s&#8217;agit alors d&#8217;identifier &#224; quelles variables correspondent suj et narg0. Cette information
est contenue dans un trait particulier de position fonctionnelle, appel&#233; FONCPOS. La valeur de
ce trait sp&#233;cifie &#224; quelle position argumentale correspond chaque fonction syntaxique:
</p>
<p>Paul : FONCPOS/narg0=P0
avaler : FONCPOS/varg0=P0/suj=P1/objd=P2
</p>
<p>L&#8217;argument P0 du pr&#233;dicat npr.Paul correspond au m&#234;me individu que celui de la position P1 du
pr&#233;dicat OPERATION.avaler. L&#8217;information s&#233;mantique correspondant &#224; ces positions se trouve
dans le thesaurus. Ainsi, on est en mesure de reconstruire la r&#232;gle enti&#232;rement:
</p>
<p>SUJ : P/(suj-P1-agent) = D/(narg0-P0-entity)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maxime Amblard, Johannes Heinecke et Estelle Maillebuau
</p>
<p>3 Extension des graphes s&#233;mantiques
</p>
<p>Les graphes s&#233;mantiques permettent de retrouver une des parties importantes de l&#8217;information
&#224; mod&#233;liser pour la s&#233;mantique compositionnelle : les liens entre variables qui interviennent
dans les structures argumentales des pr&#233;dicats. Cependant, aucun m&#233;canisme ne permet struc-
turellement de rendre compte de la notion de port&#233;e. On retrouve cette question tant dans la
mod&#233;lisation des quantificateurs, qui est classique en s&#233;mantique, que pour celle de la n&#233;gation.
Bien qu&#8217;il soit complexe de proposer une r&#233;ponse globale pour les ph&#233;nom&#232;nes li&#233;s &#224; la n&#233;ga-
tion, m&#234;me pour des exemples &#233;l&#233;mentaires, cette mod&#233;lisation &#233;choue &#224; proposer des r&#233;ponses
coh&#233;rentes. Nous proposons dans cette section de revenir sur ces deux aspects en pr&#233;sentant
une mod&#233;lisation bas&#233;e sur les graphes s&#233;mantiques qui reprend des propri&#233;t&#233;s de la DRT. Nous
appellons DRS-graphes ces nouvelles structures.
</p>
<p>3.1 Quantification dans les DRS-graphes
</p>
<p>Du point de vue de la mod&#233;lisation s&#233;mantique, la particularit&#233; de la DRT est de mod&#233;liser de
mani&#232;re simple la port&#233;e d&#8217;un op&#233;rateur par des DRS. Nous reprenons ce concept que nous
ajoutons &#224; notre mod&#232;le. Ainsi, au lieu de repr&#233;senter uniquement une variable par un n&#339;ud
du graphe de Vind , nous lui associons une port&#233;e si celle-ci fait l&#8217;objet d&#8217;une quantification. La
port&#233;e est alors repr&#233;sent&#233;e du point de vue formel par le biais d&#8217;une fonction et par une bo&#238;te
pour la repr&#233;sentation graphique.
</p>
<p>Soit G &#8712; G un graphe s&#233;mantique, nous construisons le DRS-graphe H en associant au qua-
druplet G une fonction P de Vind &#8594; G qui repr&#233;sente la port&#233;e des quantifications. Elle associe
&#224; tout &#233;l&#233;ment de Vind (les individus de la repr&#233;sentation) un graphe G&#8242; &#8712; G (sous-graphe du
graphe initial G). Les DRS-graphes sont donc des quintuplets contenant un graphe s&#233;mantique
et une fonction de Vind &#8594; G . On remarquera que cette d&#233;finition ne contraint pas les port&#233;es
possibles et impossibles. De fait, un DRS-graphe est un ensemble ordonn&#233; de graphes.
</p>
<p>Dans le cas g&#233;n&#233;ral, les port&#233;es sont r&#233;cursivement contenues les unes dans les autres. Apr&#232;s
identification de structures de port&#233;es complexes par exemple pour des &#233;nonc&#233;s contenant plu-
sieurs informations du discours, nous int&#233;grerons une heuristique de normalisation des formes
obtenues pour int&#233;grer une repr&#233;sentation simplifi&#233;e (unique) dans nos outils.
</p>
<p>En reprenant l&#8217;exemple (1), nous ne souhaitons plus seulement obtenir le graphe de la figure
2, mais une repr&#233;sentation graphique o&#249; les port&#233;es sont repr&#233;sent&#233;es par des bo&#238;tes, comme
pr&#233;sent&#233; dans le graphe de la figure 3. Dans cet exemple, nous mod&#233;lisons les noms propres non
pas par une constante du syst&#232;me, mais par un pr&#233;dicat d&#233;signant l&#8217;ensemble des propri&#233;t&#233;s les
d&#233;crivant. Implicitement, on r&#233;alise un type-raising4 syst&#233;matique sur ces cat&#233;gories.
</p>
<p>Appara&#238;t alors un probl&#232;me classique concernant la port&#233;e des quantificateurs et qui justifie la
production d&#8217;un ensemble de r&#233;sultats : la pr&#233;sence de plusieurs d&#8217;entre eux dans un m&#234;me
&#233;nonc&#233; peut impliquer que les port&#233;es diff&#233;rentes g&#233;n&#232;rent des interpr&#233;tations diff&#233;rentes. Par
exemple, dans l&#8217;&#233;nonc&#233; &#171; les mus&#233;es re&#231;oivent une exposition &#187;, si le quantificateur des mus&#233;es
domine celui des expositions, il y a autant de mus&#233;es que d&#8217;expositions ; dans le cas contraire,
il y a une unique exposition qui est re&#231;ue par tous les mus&#233;es.
</p>
<p>4ou mont&#233;e de type, ce qui correspond &#224; la modification du statut foncteur/argument dans le syst&#232;me de types,
permettant de consid&#233;rer un objet par sa d&#233;finition en intension (l&#8217;ensemble de ses propri&#233;t&#233;s).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DRT et graphes s&#233;mantiques
</p>
<p>x18
</p>
<p>number
</p>
<p>det
</p>
<p>th&#232;me
</p>
<p>NOMBRE~SING
</p>
<p>npr~Paul
</p>
<p>patient
</p>
<p>FORM~AFFIRM
</p>
<p>ACTIVE_SUBSTANCE.m&#233;dicament
</p>
<p>x19
</p>
<p>agent
</p>
<p>entity
</p>
<p>OPERATION.avaler
</p>
<p>x17
</p>
<p>affirm
</p>
<p>situation
</p>
<p>INDEF.artIndef
</p>
<p>FIG. 3 &#8211; Repr&#233;sentation sous forme de DRS-graphe de l&#8217;exemple.
</p>
<p>Actuellement, nous ne nous attachons pas &#224; proposer une interpr&#233;tation des r&#233;sultats fournis par
les DRS-graphes, mais une mod&#233;lisation des ph&#233;nom&#232;nes pr&#233;sents.
</p>
<p>Nous introduisons la notion de DRS ouvertes qui permet de rendre compte de la port&#233;e par-
tielle, c&#8217;est-&#224;-dire de relations sous-sp&#233;cifi&#233;es de port&#233;e. Ainsi, au cours de la construction de la
repr&#233;sentation s&#233;mantique, nous associons &#224; un individu quantifi&#233; non pas le graphe entier sur
lequel il a port&#233;e dans la repr&#233;sentation finale, mais le sous-graphe sur lequel il a n&#233;cessairement
port&#233;e. Pour mod&#233;liser les DRS ouvertes, lorsque nous ferons appel &#224; la notation simplifi&#233;e des
DRS, nous n&#8217;inclurons pas le crochet fermant.
</p>
<p>En reprenant l&#8217;exemple, nous construisons :
</p>
<p>(i) [x18| OPERATION.avaler(x17, x18, x19) &#8743;{x17}&#8743;{x18}
</p>
<p>o&#249; nous notons {y} l&#8217;ensemble des pr&#233;dicats utilisant uniquement la variable y. D&#8217;autre part,
nous construisons :
</p>
<p>(ii) [x19| OPERATION.avaler(x17, x18, x19) &#8743;{x17}&#8743;{x19}
</p>
<p>x19x18
</p>
<p>x17
</p>
<p>FIG. 4 &#8211; Port&#233;es sous-
sp&#233;cifi&#233;es de l&#8217;exemple 1.
</p>
<p>La repr&#233;sentation sous forme d&#8217;arbre de ces relations sous-
sp&#233;cifi&#233;es peut-&#234;tre vue de mani&#232;re classique comme dans la
figure 4. Ainsi, on repr&#233;sente que (i)&#8745; (ii) = {x17}.
La r&#233;duction des relations sous-sp&#233;cifi&#233;es permet alors de four-
nir plusieurs DRS-graphes pour chacune des port&#233;es possibles.
Les algorithmes traditionnels de la DRT font souvent appel &#224; la
structure hi&#233;rarchique des DRS, notamment pour la r&#233;solution
d&#8217;anaphore. M&#234;me si cette structure ne se retrouve que partiel-
lement au fur et &#224; mesure de la construction des DRS-graphes,
la fonction de port&#233;e et les intersections de DRS-graphes per-
</p>
<p>mettent de retrouver la hi&#233;rarchie des DRS en jeu.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maxime Amblard, Johannes Heinecke et Estelle Maillebuau
</p>
<p>Cependant, nous proposons un crit&#232;re de normalisation afin de ne pas d&#233;multiplier les solutions
propos&#233;es par nos applications. Nous supposons que la forme normale d&#8217;un DRS-graphe (ou
le repr&#233;sentant unique d&#8217;une classe de DRS-graphe) est celle o&#249; les quantificateurs respectent
l&#8217;ordre lin&#233;aire gauche droite, &#224; l&#8217;exception des descriptions des noms propres, et o&#249; la quanti-
fication &#233;v&#233;nementielle ne porte sur aucune autre variable.
</p>
<p>Pour l&#8217;exemple 1, c&#8217;est le DRS-graphe de la figure 3 qui sera propos&#233;. On appelle extension
s&#233;mantique d&#8217;un DRS-graphe H l&#8217;ensemble des DRS-graphes partiels appartenant &#224; la m&#234;me
classe s&#233;mantique queH. La figure 5, sur laquelle nous reviendrons, montre un DRS-graphe (fig
5 (b)) et un membre de l&#8217;extension s&#233;mantique de ce DRS-graphe (fig 5 (b&#8242;)). Nous revenons
dans la section suivante sur la quantification des &#233;v&#233;nements au travers de la question de la
mod&#233;lisation de la n&#233;gation.
</p>
<p>3.2 N&#233;gation dans les DRS-graphes
</p>
<p>Du point de vue de la DRT, il est n&#233;cessaire de r&#233;ifier les graphes s&#233;mantiques (pour ne pas
dire les formules) et ainsi adopter la position Davidsonnienne, (Davidson, 1967), en d&#233;signant
l&#8217;action ou le fait par une variable particuli&#232;re. Dans les DRS-graphes, nous respectons cette
position comme nous l&#8217;avons pr&#233;c&#233;demment &#233;voqu&#233;. Dans ce cas, les &#233;v&#233;nements ont un statut
particulier dans la description de la structure &#224; construire. Mais si ce statut est particulier, il n&#8217;en
est pas diff&#233;rent et ces variables appartiendront &#224; l&#8217;ensemble Vind .
</p>
<p>Nous supposons que la quantification standard pour ces variables est la quantification existen-
tielle et que la modification du type de quantification doit &#234;tre justifi&#233;e par des indices linguis-
tiques pr&#233;sents dans l&#8217;&#233;nonc&#233;. Dans nos graphes s&#233;mantiques traditionnels, la n&#233;gation est un
pr&#233;dicat qui porte sur la variable de r&#233;ification. Dans la transcription de ces graphes sous forme
de DRS-graphes, les implications de la mod&#233;lisation de la port&#233;e sont directes sur l&#8217;interpr&#233;ta-
tion de la n&#233;gation. En effet, si on analyse la version n&#233;gative de l&#8217;exemple 1 :
</p>
<p>(2) Paul n&#8217;avale pas de m&#233;dicament.
</p>
<p>On s&#8217;aper&#231;oit que l&#8217;extension s&#233;mantique n&#8217;est pas r&#233;duite &#224; un unique repr&#233;sentant, c&#8217;est-&#224;-dire
que plusieurs DRS-graphes peuvent &#234;tre construits. Cependant, en supposant que la quantifica-
tion sur la variable Paul ne porte pas d&#8217;enjeu, seulement deux sont pertinentes:
</p>
<p>1. l&#8217;un o&#249; la quantification &#233;v&#233;nementielle a port&#233;e sur toute la construction (fig 5.(b)),
</p>
<p>2. l&#8217;autre o&#249; il n&#8217;a port&#233;e que sur les pr&#233;dicats n&#8217;utilisant que cette variable (fig 5.(b&#8217;)).
</p>
<p>Dans le premier cas, le fait que l&#8217;&#233;v&#233;nement soit ni&#233; implique que l&#8217;ensemble des descriptions
sur lesquelles il a port&#233;e le sont aussi. Ainsi, le fait qu&#8217;il n&#8217;existe pas de m&#233;dicament est une
condition qui rend la mod&#233;lisation recevable. Or il n&#8217;est pas acceptable pour une mod&#233;lisation
pragmatique de supposer qu&#8217;il n&#8217;existe pas l&#8217;une des entit&#233;s d&#233;finies, &#224; moins que cela soit
l&#8217;expression d&#8217;une figure stylistique. La n&#233;gation d&#8217;un &#233;v&#233;nement x ne doit alors porter que sur
l&#8217;&#233;v&#233;nement lui-m&#234;me (et sur les pr&#233;dicats ne portant que sur cette variable ({x})).
Nous supposerons que l&#8217;impact de la n&#233;gation sur la construction des DRS-graphes est la fer-
meture de la port&#233;e de l&#8217;&#233;v&#233;nement sur lequel il porte. Ainsi, l&#8217;ambigu&#239;t&#233; de port&#233;e de quantifi-
cation est d&#233;l&#233;gu&#233;e &#224; la r&#233;solution de la structure sous-sp&#233;cifi&#233;e finale, mais cette proc&#233;dure la
r&#233;duit. Si ce ph&#233;nom&#232;ne est important dans l&#8217;interpr&#233;tation de la n&#233;gation simple, il l&#8217;est &#233;gale-
ment pour tout ce qui a trait &#224; la description de l&#8217;&#233;v&#233;nement. La n&#233;gation des pr&#233;dicats utilis&#233;s</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DRT et graphes s&#233;mantiques
</p>
<p>NOMBRE~SING
</p>
<p>number
</p>
<p>x17
</p>
<p>affirm
</p>
<p>INDEF.artIndef
</p>
<p>det
</p>
<p>ACTIVE_SUBSTANCE.m&#233;dicament
</p>
<p>th&#232;me
</p>
<p>x18
x19
</p>
<p>entity
npr~Paul
</p>
<p>FORM~NEGATIVE
</p>
<p>OPERATION.avaler
</p>
<p>situation
</p>
<p>patient agent
</p>
<p>(a)
x17
</p>
<p>det
number
</p>
<p>th&#232;me
</p>
<p>FORM~NEGATIVE
</p>
<p>affirm
</p>
<p>ACTIVE_SUBSTANCE.m&#233;dicament
</p>
<p>x18
</p>
<p>NOMBRE~SING
</p>
<p>INDEF.artIndef
</p>
<p>OPERATION.avaler
</p>
<p>situation
</p>
<p>patient
</p>
<p>x19
agent
</p>
<p>npr~Paul
</p>
<p>entity
</p>
<p>x18
</p>
<p>det
</p>
<p>number
</p>
<p>th&#232;me
</p>
<p>NOMBRE~SING
</p>
<p>INDEF.artIndef
</p>
<p>x19
</p>
<p>npr~Paul
</p>
<p>entity
x17
</p>
<p>OPERATION.avaler
</p>
<p>situation
</p>
<p>patient
</p>
<p>agent
</p>
<p>FORM~NEGATIVE
</p>
<p>affirm
</p>
<p>ACTIVE_SUBSTANCE.m&#233;dicament
</p>
<p>(b) (b&#8242;)
</p>
<p>FIG. 5 &#8211; Graphe s&#233;mantique pour la n&#233;gation (a) et de DRT-Graphes &#233;quivalents (b) et (b&#8242;).
</p>
<p>pour sp&#233;cifier les ph&#233;nom&#232;nes de temps et aspects n&#8217;ont pas n&#233;cessairement d&#8217;implication sur
l&#8217;interpr&#233;tation des &#233;nonc&#233;s.
</p>
<p>Ainsi, pour l&#8217;analyse de l&#8217;exemple 2, on construit le DRS-graphe [e|avaler(e,x,y). L&#8217;ajout de
la n&#233;gation implique la construction du DRS-graphe [e|avaler(e,x,y)&#8743;&#172;(e)]. La suite de l&#8217;ana-
lyse permet alors de ne construire que les structures sous-sp&#233;cifi&#233;es o&#249; les quantifications ont
port&#233;e sur la variable d&#8217;&#233;v&#233;nement. Le choix fait de positionner en bas de la structure hi&#233;rar-
chique les &#233;v&#233;nements ni&#233;s et le soucis d&#8217;homog&#233;n&#233;it&#233; du calcul, explique la position expos&#233;e
pr&#233;c&#233;demment sur les formes normales des &#233;nonc&#233;s affirmatifs.
</p>
<p>4 Conclusion et perspectives
</p>
<p>Les raisons qui nous ont conduit &#224; r&#233;aliser les choix initiaux sont principalement dues &#224; des pro-
bl&#232;mes de robustesse. En effet, ajouter le traitement des quantificateurs entra&#238;ne une n&#233;cessaire
sur-g&#233;n&#233;ration (ou ambigu&#239;t&#233;). Bien que nous soyons en mesure de faire un choix parmi les
r&#233;sultats obtenus, en prenant par exemple la repr&#233;sentation qui poss&#232;de la plus longue cha&#238;ne
connexe (ces graphes sont acycliques par d&#233;finition), nous souhaitons &#224; pr&#233;sent int&#233;grer des
repr&#233;sentations plus &#233;labor&#233;es permettant une repr&#233;sentation plus fine. Ceci est r&#233;alis&#233; via des
notions issues de la sous-sp&#233;cification. Une raison pour laquelle cette n&#233;cessit&#233; ne s&#8217;est pas fait
sentir de mani&#232;re importante pour le moment est que les domaines sur lesquels les outils ont &#233;t&#233;
d&#233;velopp&#233;s &#233;taient d&#233;lib&#233;r&#233;ment limit&#233;s.
</p>
<p>Les autres points importants dont il nous faudrait rendre compte sont les probl&#232;mes li&#233;s &#224; la co-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Maxime Amblard, Johannes Heinecke et Estelle Maillebuau
</p>
<p>ordination et &#224; l&#8217;implication (cause et effet). Si cette approche permet d&#8217;augmenter la pertinence
de la mod&#233;lisation, elle se pose comme une &#233;tape vers la d&#233;finition d&#8217;un syst&#232;me complet.
</p>
<p>Une fois ces propri&#233;t&#233;s formelles introduites dans le syst&#232;me de calcul, nous avons envisag&#233; de
tester sa robustesse. Pour cela, nous avons mis en place un protocole dont la premi&#232;re &#233;tape a
&#233;t&#233; la constructrion d&#8217;un corpus s&#233;mantique. Ce dernier comporte une soixantaine de phrases
r&#233;parties en dix domaines relatifs &#224; diff&#233;rentes questions de s&#233;mantique. La seconde phase,
celle d&#8217;impl&#233;mentation de ces propositions et d&#8217;int&#233;gration dans l&#8217;outil TiLT, est en cours. Elle
permettra de finaliser les tests pr&#233;vus.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AMBLARD M. (2007). Calculs de repr&#233;sentations s&#233;mantique et syntaxe g&#233;n&#233;rative: les gram-
maires minimalistes cat&#233;gorielles. PhD thesis, LaBRI, Universit&#233; Bordeaux 1.
AMSILI P. &amp; ROUSSARIE L. (2004). Vers une lambda-drt &#233;tendue. In P. BLACHE, Ed., Actes
de TALN 2004 (Traitement automatique des langues naturelles), F&#232;s, Maroc: ATALA LPL.
ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation. Cambridge University Press.
BLACKBURN P., BOS J., KOHLHASE M. &amp; DE NEVILLE H. (1999). Inference and com-
putational semantics. In H. BUNT &amp; E. THIJSSE, Eds., Third International Workshop on
Computational Semantics (IWCS&#8211;3), p. 5&#8211;21.
BUSQUETS J., VIEU L. &amp; ASHER N. (2001). La SDRT : une approche de la coh&#233;rence du
discours dans la tradition de la s&#233;mantique dynamique. Verbum, XXIII(1), 73&#8211;101.
DANLOS L. (2007). Un formalisme pour le discours inspir&#233; des TAG synchrones. In F.
BENARMARA, N. HATOUT, P. MULLER &amp; S. OZDOWSKA, Eds., Actes de TALN 2007 (Trai-
tement automatique des langues naturelles), p. 389&#8211;398, Toulouse: ATALA IRIT.
DAVIDSON D. (1967). The logical form of action sentences. In N. RESHER, Ed., The Logic
of Decision and Action, p. 81&#8211;95: Pittsburgh University Press.
HEINECKE J. (2006). G&#233;n&#233;ration automatique des repr&#233;sentations ontologiques. In P. MER-
TENS, C. FAIRON, A. DISTER &amp; P. WATRIN, Eds., Actes de la 13e conf&#233;rence TALN, vol. 2,
p. 502&#8211;511. Louvain: Presses universitaires de Louvain.
IHEDDADENE M. (2007). Traduction Automatique : &#233;tude et r&#233;alisation d&#8217;un module de
g&#233;n&#233;ration &#224; partir d&#8217;une repr&#233;sentation s&#233;mantique interlingue. PhD thesis, Universit&#233; de
Provence, France.
KAMP H. &amp; REYLE U. (1993). From Discourse to Logic. Dordrecht: Kluwer Publishers.
KERVAJAN L., GUIMIER DE NEEF E. &amp; BRETON G. (2007). Vers un syst&#232;me de traduction
automatique fran&#231;ais/langue des signes fran&#231;aise. Traitement Automatique des Langues, 48(2).
PARK J., MAILLEBUAU E., GUIMIER DE NEEF E., VINESSE J. &amp; HEINECKE J. (2007).
Evaluating an Interlingual Semantic Representation. In K. GERDES, T. REUTHER &amp; L. WAN-
NER, Eds., Meaning - Text Theory 2007, M&#252;nchen - Wien.
RETOR&#201; C. (2008). Les math&#233;matiques de la linguistique computationnelle. Gazette des
Math&#233;maticiens, 115, 35&#8211;62.
SCHILDER F. (1998). An underspecified segmented discourse representation theory (USDRT).
In COLING-ACL, p. 1188&#8211;1192.
SOWA J. (1964). Conceptual graphs for a data base interface. IBM J. RES. DEVELOP., p.
336&#8211;357.</p>

</div></div>
</body></html>