<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Int&#233;gration d&#8217;une &#233;tape de pr&#233;-filtrage et d&#8217;une fonction multiobjectif en vue d&#8217;am&#233;liorer le syst&#232;me ExtraNews de r&#233;sum&#233; de documents multiples</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p>Int&#233;gration d&#8217;une &#233;tape de pr&#233;-filtrage et d&#8217;une fonction multi-
objectif en vue d&#8217;am&#233;liorer le syst&#232;me ExtraNews de r&#233;sum&#233; de 
</p>
<p>documents multiples 
</p>
<p>Fatma Kallel Jaoua (1), Lamia Hadrich Belguith, Maher Jaoua (2)           
Abdelmajid Ben Hamadou (3) 
</p>
<p>(1) Laboratoire LARIS-MIRACL, ISG Universit&#233; de Gab&#232;s, Tunisie.   
fatma_fseg@yahoo.fr  
</p>
<p>(2) Laboratoire LARIS-MIRACL, FSEGS, Universit&#233; de Sfax, Tunisie.   
l.belguith@fsegs.rnu.tn, maher.jaoua@fsegs.rnu.tn 
</p>
<p>(3) Laboratoire LARIM-MIRACL &#8211; ISIMS, Universit&#233; de Sfax, Tunisie. 
abdelmajid.benhamadou@fsegs.rnu.tn  
</p>
<p>R&#233;sum&#233; Dans cet article, nous pr&#233;sentons les am&#233;liorations que nous avons apport&#233;es au 
syst&#232;me ExtraNews de r&#233;sum&#233; automatique de documents multiples. Ce syst&#232;me se base sur 
l&#8217;utilisation d&#8217;un algorithme g&#233;n&#233;tique qui permet de combiner les phrases des documents 
sources pour former les extraits, qui seront crois&#233;s et mut&#233;s pour g&#233;n&#233;rer de nouveaux extraits. 
La multiplicit&#233; des crit&#232;res de s&#233;lection d&#8217;extraits nous a inspir&#233; une premi&#232;re am&#233;lioration qui 
consiste &#224; utiliser une technique d&#8217;optimisation multi-objectif en vue d&#8217;&#233;valuer ces extraits. La 
deuxi&#232;me am&#233;lioration consiste &#224; int&#233;grer une &#233;tape de pr&#233;-filtrage de phrases qui a pour 
objectif la r&#233;duction du nombre des phrases des textes sources en entr&#233;e. Une &#233;valuation des 
am&#233;liorations apport&#233;es &#224; notre syst&#232;me est r&#233;alis&#233;e sur les corpus de DUC&#8217;04 et DUC&#8217;07. 
</p>
<p>Abstract In this paper, we present the improvements that we brought to the ExtraNews 
system dedicated for automatic summarisation of multiple documents. This system is based on 
the use of a genetic algorithm that combines sentences of the source documents to form the 
extracts. These extracts are crossed and transferred to generate new ones. The multiplicity of 
the extract selection criteria inspired us the first improvement that consists in the use of a 
multi-objectif optimization technique to evaluate these extracts. The second improvement 
consists of the integration of a sentence pre-filtering step which is based on the notion of 
dominance between sentences. Our objective is to reduce the sentence number of the source 
texts. An evaluation of the proposed improvements to our system is realized on DUC' 04 and 
DUC' 07 corpus. 
</p>
<p>Mots-cl&#233;s : R&#233;sum&#233; automatique, pr&#233;-filtrage de phrases, optimisation multi-objectif, 
algorithme g&#233;n&#233;tique.  
Keywords: Automatic summarization, sentences pre-filtering, multi-objective 
optimization, genetic algorithm.  
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jaoua K.F., Jaoua M., Belguith H.L. et Ben Hamadou A. 
</p>
<p>1 Introduction  
La mont&#233;e en volume des documents &#233;lectroniques disponibles en ligne a suscit&#233; la 
production d'outils informatiques dont la t&#226;che principale est de trouver et d'extraire 
l'information pertinente. Dans ce contexte, les syst&#232;mes de r&#233;sum&#233; automatique de documents 
semblent &#234;tre une bonne solution puisqu&#8217;ils permettent de reproduire automatiquement une 
repr&#233;sentation courte d'une collection de documents sources tout en conservant l'information 
pertinente. Ces syst&#232;mes visent, essentiellement, &#224; faciliter la recherche et l'assimilation des 
informations textuelles pertinentes contenues dans les documents sources.  
</p>
<p>C&#8217;est dans ce cadre que nous avons propos&#233;, dans un travail pr&#233;c&#233;dent (Jaoua et al., 2004), 
une m&#233;thode originale de r&#233;sum&#233; automatique de documents multiples d&#233;crivant un m&#234;me 
th&#232;me. Cette m&#233;thode se distingue par le fait qu&#8217;elle consid&#232;re l&#8217;extrait en tant qu&#8217;unit&#233; 
minimale d&#8217;extraction. Elle op&#232;re par constitution d&#8217;un ensemble d&#8217;extraits qui sont, ensuite, 
&#233;valu&#233;s et class&#233;s en vue de d&#233;terminer le meilleur en tenant compte de certains crit&#232;res 
statistiques et linguistiques. Cette m&#233;thode a &#233;t&#233; impl&#233;ment&#233;e dans le cadre du syst&#232;me 
ExtraNews de r&#233;sum&#233; automatique de documents multiples. Elle a &#233;t&#233; marqu&#233;e par 
l&#8217;utilisation d&#8217;un algorithme g&#233;n&#233;tique qui assure les m&#233;canismes de g&#233;n&#233;ration et de 
classement d&#8217;extraits. 
</p>
<p>La version du syst&#232;me ExtraNews traitant la langue anglaise a &#233;t&#233; &#233;valu&#233;e dans le cadre de la 
conf&#233;rence d&#8217;&#233;valuation DUC&#8217;04 et a obtenu des r&#233;sultats int&#233;ressants. En effet, il a &#233;t&#233; class&#233; 
premier dans la t&#226;che 4 (de r&#233;sum&#233; de documents multiples traduits de la langue arabe &#224; 
l&#8217;anglais) et troisi&#232;me dans la t&#226;che 5 (de r&#233;sum&#233; de biographie humaine) (Jaoua et al., 2004). 
Toutefois, l&#8217;&#233;valuation de ExtraNews dans la conf&#233;rence DUC&#8217;07 n&#8217;a pas obtenu les r&#233;sultats 
escompt&#233;s (i.e. il a &#233;t&#233; class&#233; seizi&#232;me dans la t&#226;che principale de r&#233;sum&#233; guid&#233; par une 
question utilisateur). Malgr&#233; la diff&#233;rence des t&#226;ches et des mesures d&#8217;&#233;valuations employ&#233;es 
dans ces deux sessions d&#8217;&#233;valuation, la divergence des r&#233;sultats met en cause le choix des 
&#233;tapes de mise en &#339;uvre de notre m&#233;thode. L&#8217;analyse des r&#233;sultats g&#233;n&#233;r&#233;s nous a permis de 
d&#233;gager deux maillons faibles dans la cha&#238;ne de production d&#8217;extraits employ&#233;e par notre 
m&#233;thode. Le premier maillon se situe au niveau de la fonction utilis&#233;e pour l&#8217;agr&#233;gation des 
crit&#232;res de classement des extraits. Le deuxi&#232;me maillon concerne l&#8217;apparition d&#8217;une d&#233;rive 
g&#233;n&#233;tique qui s&#8217;est traduite par la convergence pr&#233;matur&#233;e de notre algorithme g&#233;n&#233;tique vers 
des solutions non pertinentes et donc de g&#233;n&#233;rer des extraits de qualit&#233; relativement &quot;faible&quot;. 
Ce ph&#233;nom&#232;ne de d&#233;rive a &#233;t&#233; ressenti essentiellement, dans le cas o&#249; la taille de la collection 
des documents sources est importante. En effet, le nombre de phrases dans une collection de 
documents est pass&#233; de 275 phrases lors de DUC&#8217;04 &#224; 720 phrases lors de DUC&#8217;07.  
</p>
<p>Dans cet article, nous allons pr&#233;senter les am&#233;liorations que nous avons apport&#233;es &#224; notre 
syst&#232;me afin de rem&#233;dier aux probl&#232;mes pr&#233;cit&#233;s. Nous allons d&#8217;abord exp&#233;rimenter une 
nouvelle technique permettant d&#8217;int&#233;grer les crit&#232;res de classement des extraits. L&#8217;id&#233;e de 
cette exp&#233;rimentation est de v&#233;rifier si un classement multi-objectif est plus appropri&#233; que la 
technique initiale utilis&#233;e dans le syst&#232;me ExtraNews qui consiste &#224; classer les extraits 
moyennant une fonction d&#8217;agr&#233;gation des crit&#232;res utilis&#233;s. La deuxi&#232;me exp&#233;rimentation vise &#224; 
r&#233;soudre la d&#233;rive g&#233;n&#233;tique qui a &#233;t&#233; constat&#233;e lorsque le syst&#232;me traite des collections de 
documents de grande taille. Dans ce cadre, nous allons &#233;tudier l&#8217;utilit&#233; d&#8217;int&#233;grer une &#233;tape de 
pr&#233;-filtrage de phrases qui a pour objectif la r&#233;duction de l&#8217;espace de recherche explor&#233; par 
l&#8217;algorithme g&#233;n&#233;tique utilis&#233; dans notre m&#233;thode.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;gration d&#8217;une &#233;tape de pr&#233;-filtrage et d&#8217;une fonction multi-objectif en vue d&#8217;am&#233;liorer le 
syst&#232;me ExtraNews de r&#233;sum&#233; de documents multiples 
Le pr&#233;sent article s&#8217;articule autour de cinq sections. Cette partie introductive est suivie par la 
deuxi&#232;me section qui pr&#233;sente un survol des principaux travaux r&#233;alis&#233;s dans le domaine du 
r&#233;sum&#233; automatique de documents multiples. La troisi&#232;me et la quatri&#232;me section d&#233;taillent le 
principe de base de la m&#233;thode propos&#233;e ainsi que les am&#233;liorations apport&#233;es &#224; cette 
m&#233;thode. La cinqui&#232;me section pr&#233;sente l&#8217;&#233;valuation men&#233;e avant et apr&#232;s l&#8217;int&#233;gration de ces 
am&#233;liorations dans le syst&#232;me ExtraNews. Cette &#233;valuation est r&#233;alis&#233;e sur les corpus utilis&#233;s 
lors de DUC&#8217;04 et DUC&#8217;07. 
</p>
<p>2 Etat de l&#8217;art  
La plupart des travaux r&#233;alis&#233;s dans le domaine du r&#233;sum&#233; automatique de documents 
multiples s&#8217;articulent autour du processus de regroupement et de classement des unit&#233;s 
textuelles similaires en vue de d&#233;gager les unit&#233;s les plus importantes (Spark Jones, 2007). 
Ces travaux peuvent utiliser plusieurs types de m&#233;thodes : les m&#233;thodes statistiques, les 
m&#233;thodes linguistiques et les m&#233;thodes par compr&#233;hension.  
</p>
<p>Dans les m&#233;thodes statistiques, l&#8217;importance des unit&#233;s textuelles (g&#233;n&#233;ralement les phrases) 
est repr&#233;sent&#233;e par un poids ou une probabilit&#233; qui leur est assign&#233;e en fonction de leur 
richesse en mots cl&#233;s, du groupement de termes, de leurs positions dans le document 
(Lin et al., 2002). Dans d&#8217;autres m&#233;thodes, cette importance d&#233;pend de la diversit&#233; que l&#8217;unit&#233; 
textuelle apporte &#224; l&#8217;extrait g&#233;n&#233;r&#233;, tout en gardant un niveau &#233;lev&#233; de similarit&#233; avec la 
requ&#234;te utilis&#233;e (Carbonell et al., 1998). D&#8217;autres m&#233;thodes exploitent la distribution des mots 
dans les documents sources pour s&#233;lectionner les unit&#233;s qui regroupent les mots jug&#233;s 
pertinents (Mori et al., 2004).  
</p>
<p>Les m&#233;thodes linguistiques exploitent les connaissances sur la langue pour guider le processus 
d&#8217;extraction. Certaines m&#233;thodes m&#232;nent une analyse linguistique dans le but de regrouper les 
phrases similaires (McKeown et al., 1999). D&#8217;autres travaux exploitent les relations de 
cor&#233;f&#233;rence (Saggion et al., 2004) ou des relations entreprises par les entit&#233;s nomm&#233;es 
(Fuentes et al., 2003) pour &#233;liminer les pr&#233;positions redondantes.  
</p>
<p>Les m&#233;thodes par compr&#233;hension op&#232;rent par la construction d&#8217;une repr&#233;sentation interne des 
textes sources en vue de d&#233;terminer les composantes importantes qui sont ensuite r&#233;duites 
puis reformul&#233;es pour former le r&#233;sum&#233; final. Cette repr&#233;sentation peut &#234;tre illustr&#233;e par un 
graphe conceptuel (Mani et al., 1997) ou par des patrons s&#233;mantiques (Harabagiu et al., 2005). 
D&#8217;autres m&#233;thodes se basent sur l&#8217;utilisation de mod&#232;les pr&#233;d&#233;finis de r&#233;sum&#233;s qui sont 
instanci&#233;s &#224; partir d&#8217;informations extraites des documents sources (Radev et al., 1998), (White 
et al., 2001). Il est &#224; noter que ces m&#233;thodes exigent des connaissances pr&#233;alables du domaine 
&#224; traiter pour g&#233;n&#233;rer des r&#233;sum&#233;s de bonne qualit&#233;. 
</p>
<p>La plupart des m&#233;thodes pr&#233;cit&#233;es utilisent une phase de regroupement d&#8217;unit&#233;s textuelles 
similaires pour &#233;viter la s&#233;lection d&#8217;unit&#233;s redondantes dans le r&#233;sum&#233; final. Cette &#233;tape est 
indispensable vu que la granularit&#233; d&#8217;importance utilis&#233;e se limite, g&#233;n&#233;ralement, &#224; la phrase. 
Dans la m&#233;thode que nous avons propos&#233;e, nous consid&#233;rons l&#8217;extrait en tant que granularit&#233; 
d&#8217;importance ; ce qui permet d&#8217;&#233;viter la phase de regroupement et d&#8217;offrir un moyen pour 
traiter l&#8217;extrait en tant qu&#8217;unit&#233; &#224; part enti&#232;re et non pas en tant qu&#8217;un ensemble d&#8217;unit&#233;s 
ind&#233;pendantes.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jaoua K.F., Jaoua M., Belguith H.L. et Ben Hamadou A. 
</p>
<p>3 M&#233;thode d&#8217;extraction utilis&#233;e dans ExtraNews 
Afin d'appr&#233;hender le probl&#232;me d&#8217;extraction des phrases pertinentes dans un document, nous 
avons propos&#233; une nouvelle unit&#233; d'extraction qui op&#232;re &#224; un niveau plus &#233;tendu que la phrase 
(Jaoua et al., 2003). Cette conviction est guid&#233;e par l&#8217;id&#233;e que pour un niveau englobant la 
phrase, nous pouvons mieux contr&#244;ler les probl&#232;mes r&#233;sultant de la s&#233;lection des phrases 
ind&#233;pendamment les unes des autres. La granularit&#233; d&#8217;extraction que nous avons choisie est 
l&#8217;extrait qui est form&#233; &#224; partir de phrases des documents sources (Jaoua et al., 2003). Ainsi le 
probl&#232;me d&#8217;extraction est abord&#233; comme &#233;tant un probl&#232;me d&#8217;optimisation o&#249; il s&#8217;agit 
d&#8217;effectuer une comparaison entre plusieurs extraits en vue de s&#233;lectionner le &quot;meilleur&quot;. Il 
s&#8217;agit donc de choisir &#224; partir des textes sources la meilleure partition form&#233;e par les phrases 
issues des documents sources, et qui maximisent certains crit&#232;res li&#233;s &#224; la qualit&#233; et &#224; la 
quantit&#233; des informations v&#233;hicul&#233;es.  
</p>
<p>Toutefois, la d&#233;termination de l&#8217;ensemble des partitions d&#8217;un document est un probl&#232;me NP 
(non polynomial) qui ne peut pas &#234;tre r&#233;solu en un temps raisonnable (Brucker et al., 1978). 
Afin de r&#233;soudre ce probl&#232;me, les m&#233;thodes d&#8217;optimisation op&#232;rent par &#233;valuation de 
solutions interm&#233;diaires en vue de converger vers une solution proche de l&#8217;optimale. 
L&#8217;application de ces m&#233;thodes pour le probl&#232;me d&#8217;extraction suppose que toutes les solutions 
interm&#233;diaires repr&#233;sentent des extraits g&#233;n&#233;r&#233;s en une premi&#232;re &#233;tape, puis &#233;valu&#233;s en 
fonction des crit&#232;res utilis&#233;s en une deuxi&#232;me &#233;tape.  
</p>
<p>La m&#233;thode d&#8217;optimisation que nous avons utilis&#233;e dans le contexte d&#8217;extraction des phrases 
s&#8217;appuie sur les algorithmes g&#233;n&#233;tiques. Le choix des algorithmes g&#233;n&#233;tiques est 
essentiellement motiv&#233; par l&#8217;&#233;tendue de l&#8217;espace de recherche explor&#233; lors de leur application. 
En effet, ces algorithmes offrent l&#8217;avantage de manipuler plusieurs solutions en m&#234;me temps, 
ce qui permet d&#8217;explorer un grand espace de recherche. Notons que les algorithmes g&#233;n&#233;tiques 
se basent sur le principe de g&#233;n&#233;ration al&#233;atoire d'une population de g&#233;nomes qui sera class&#233;e 
en fonction d'une valeur d'adaptation (Goldberg, 1989). Dans notre cas, le g&#233;nome constitue 
l&#8217;extrait alors que la phrase repr&#233;sente un g&#232;ne de ce g&#233;nome. Les meilleurs g&#233;nomes 
(extraits) de cette population seront crois&#233;s et mut&#233;s en vue de g&#233;n&#233;rer une nouvelle 
population qui sera ensuite class&#233;e pour retrouver ses meilleurs extraits. Ce processus est 
r&#233;it&#233;r&#233; jusqu'&#224; la non-am&#233;lioration (stagnation) de la valeur d'adaptation. A chaque it&#233;ration, il 
s&#8217;agit de classer les extraits moyennant des crit&#232;res li&#233;s &#224; certains aspects statistiques et 
linguistiques de l&#8217;extrait. 
</p>
<p>Dans notre syst&#232;me ExtraNews, l&#8217;&#233;valuation des extraits se base sur cinq crit&#232;res :  
</p>
<p>&#8226; La taille de l&#8217;extrait (C1) : ce crit&#232;re permet de fixer la longueur de l&#8217;extrait en mots. 
La valeur de ce crit&#232;re est &#233;gale &#224; 1 si la taille de l&#8217;extrait est voisine de la taille 
d&#233;sir&#233;e. Cette valeur est inf&#233;rieure &#224; 1 si la taille de l&#8217;extrait est inf&#233;rieure &#224; celle 
fix&#233;e et elle est &#233;gale &#224; 0 en cas de d&#233;passement. La p&#233;nalisation des extraits longs est 
due &#224; la troncature, effectu&#233;e lors de l&#8217;&#233;valuation des extraits d&#233;passant la taille fix&#233;e. 
</p>
<p>&#8226; La couverture en mots cl&#233;s simples (C2) : un mot cl&#233; est un mot non vide dit plein 
(obtenu apr&#232;s &#233;limination des mots vides tels que les articles, les pr&#233;positions, etc.) 
dont la fr&#233;quence est importante. Ce crit&#232;re est calcul&#233; en divisant le nombre de mots 
cl&#233;s contenus dans l&#8217;extrait par le nombre total des mots cl&#233;s contenus dans les textes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;gration d&#8217;une &#233;tape de pr&#233;-filtrage et d&#8217;une fonction multi-objectif en vue d&#8217;am&#233;liorer le 
syst&#232;me ExtraNews de r&#233;sum&#233; de documents multiples 
</p>
<p>sources. Il est &#224; noter que les mots cl&#233;s peuvent appara&#238;tre sous forme de synonymes1 
et donc &#234;tre consid&#233;r&#233;s comme une seule entr&#233;e pour le crit&#232;re de couverture.  
</p>
<p>&#8226; La couverture en mots cl&#233;s doubles (C3) : un mot cl&#233; double correspond &#224; deux mots 
adjacents qui se r&#233;p&#232;tent fr&#233;quemment dans les textes sources. Il est &#224; noter que deux 
mots adjacents sont deux mots s&#233;par&#233;s par un espace ou par des mots vides. Ce 
crit&#232;re est calcul&#233; de la m&#234;me mani&#232;re que le crit&#232;re pr&#233;c&#233;dent et tient compte de la 
relation de synonymes entre mots.  
</p>
<p>&#8226; La couverture en mots cl&#233;s de la question utilisateur (C4) : ce crit&#232;re a &#233;t&#233; introduit 
pour tenir compte de la question de l&#8217;utilisateur qui peut guider le syst&#232;me dans la 
g&#233;n&#233;ration du r&#233;sum&#233;. Le calcul s&#8217;effectue de la m&#234;me mani&#232;re utilis&#233;e dans les deux 
crit&#232;res pr&#233;c&#233;dents. Tous les mots de la question (&#224; l&#8217;exception des mots vides) sont 
consid&#233;r&#233;s comme &#233;tant des mots cl&#233;s et seront enrichis par leurs synonymes.  
</p>
<p>&#8226; Le poids de l&#8217;extrait (C5) : ce crit&#232;re correspond &#224; la somme des valeurs TF*IDF des 
termes contenus dans l&#8217;extrait. La valeur de ce crit&#232;re est normalis&#233;e en divisant le 
poids de l&#8217;extrait par celui de l&#8217;extrait le plus pond&#233;rant de la population courante.  
</p>
<p>Pour classer les extraits de chaque population g&#233;n&#233;r&#233;e suite &#224; l&#8217;application de l&#8217;algorithme 
g&#233;n&#233;tique, nous avons choisi pr&#233;alablement une fonction &quot;objectif&quot; qui permet d&#8217;agr&#233;ger les 
crit&#232;res pr&#233;cit&#233;s. La fonction d&#8217;agr&#233;gation utilis&#233;e consiste &#224; multiplier les valeurs associ&#233;es &#224; 
ces crit&#232;res apr&#232;s &#234;tre normalis&#233;es. Si l&#8217;extrait d&#233;passe la taille fix&#233;e au pr&#233;alable, sa valeur 
&quot;objectif&quot; est &#233;gale &#224; z&#233;ro vu que le crit&#232;re de longueur vaut z&#233;ro, ce qui permet d&#8217;&#233;liminer les 
extraits dont la longueur exc&#232;de celle d&#233;sir&#233;e : F(extrait) = &#928; i&#969;~ .  
</p>
<p>Il est &#224; noter que i&#969;~  d&#233;signe le coefficient associ&#233; au crit&#232;re i apr&#232;s &#234;tre normalis&#233;. Par 
exemple, la normalisation du crit&#232;re associ&#233; au poids consiste &#224; diviser la valeur de ce crit&#232;re 
par le poids maximal obtenu parmi les extraits g&#233;n&#233;r&#233;s dans la m&#234;me population. 
</p>
<p>4 Am&#233;liorations apport&#233;es  
</p>
<p>4.1 Classification multi-objectif des extraits 
A l&#8217;issue de l&#8217;&#233;valuation de notre m&#233;thode dans les sessions DUC&#8217;04 et DUC&#8217;07, nous avons 
pr&#233;lev&#233; certaines critiques li&#233;es &#224; la mani&#232;re dont la fonction &quot;objectif&quot; agr&#232;ge les crit&#232;res 
pr&#233;cit&#233;s. En effet, les crit&#232;res peuvent ne pas avoir le m&#234;me ordre de grandeur malgr&#233; la 
normalisation effectu&#233;e ; ce qui permet de donner &#224; certains crit&#232;res la possibilit&#233; d&#8217;augmenter 
(ou de diminuer) d&#8217;une mani&#232;re significative la valeur de la fonction &quot;objectif&quot;. Ce probl&#232;me 
persiste m&#234;me si on attribue des coefficients aux diff&#233;rents crit&#232;res ; dans ce cas le pouvoir 
d&#8217;un crit&#232;re reste li&#233; &#224; l&#8217;intervalle des valeurs prises par ce crit&#232;re.  
</p>
<p>Afin de tenir compte de divers crit&#232;res lors du classement des extraits, nous proposons 
d&#8217;utiliser un classement multi-objectif. L&#8217;optimisation multi-objectif se base sur la notion de 
dominance qui compare chacun des crit&#232;res des solutions (Collette et al., 2002). 
                                                 
</p>
<p>1
  Afin de chercher les synonymes des mots cl&#233;s, nous avons utilis&#233; le dictionnaire WordNet. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jaoua K.F., Jaoua M., Belguith H.L. et Ben Hamadou A. 
</p>
<p>Formellement, on dit qu&#8217;une solution (extrait) X domine une solution (extrait) Y si pour tous 
les crit&#232;res Ci, on a : 
</p>
<p>Ci(X) &#8805; Ci (Y) et &#8707; Cj / Cj(X) &gt; Cj(Y).  
Avec Ci(X) la valeur attribu&#233;e &#224; la solution (extrait) X pour le crit&#232;re Ci.  
</p>
<p>Les solutions (extraits) non domin&#233;es dans une population sont consid&#233;r&#233;es comme des 
solutions potentielles, capables de g&#233;n&#233;rer des solutions int&#233;ressantes. Elles sont s&#233;lectionn&#233;es 
pour former la population initiale de l&#8217;it&#233;ration suivante. La stagnation pendant plusieurs 
it&#233;rations des solutions obtenues renseigne sur la convergence de l&#8217;algorithme.  
</p>
<p>Dans le cas de classement des extraits, l&#8217;obtention d&#8217;un ensemble d&#8217;extraits dominants, apr&#232;s 
la convergence de l&#8217;algorithme, ne peut pas r&#233;soudre le probl&#232;me, car le r&#233;sultat escompt&#233; doit 
&#234;tre un seul extrait. Pour pallier ce probl&#232;me, nous avons essay&#233; de classer les crit&#232;res utilis&#233;s 
en comparant les extraits dominants obtenus avec des r&#233;sum&#233;s de r&#233;f&#233;rence r&#233;dig&#233;s par des 
experts humains. Le classement des crit&#232;res permet, dans le cas o&#249; il existe plusieurs extraits 
dominants, de retenir un seul extrait.  
</p>
<p>Nous avons exploit&#233; &#224; cet effet le corpus diffus&#233; lors de la conf&#233;rence DUC&#8217;06, ainsi que la 
m&#233;trique Rouge2 : Recall-Oriented Understudy for Gistering Evaluation (2_grammes) qui est 
une m&#233;trique de rappel utilis&#233;e pour l&#8217;&#233;valuation des r&#233;sum&#233;s (Lin, 2004). Cette m&#233;trique, qui 
pr&#233;sente une bonne corr&#233;lation avec des &#233;valuations humaines, permet de comptabiliser 
l&#8217;apparition des mots doubles dans l&#8217;extrait (ou le r&#233;sum&#233;) syst&#232;me et les r&#233;sum&#233;s de r&#233;f&#233;rence 
(voir section 5). Le corpus diffus&#233; lors de la conf&#233;rence DUC&#8217;06 est form&#233; de 50 collections 
de documents. Chaque collection comprend 25 documents, alors que les r&#233;sum&#233;s de r&#233;f&#233;rence 
sont au nombre de 4 pour chaque collection. La proc&#233;dure de test consiste &#224; d&#233;terminer, parmi 
les extraits dominants, celui qui pr&#233;sente le meilleur indice Rouge2 et donc la meilleure 
correspondance avec les r&#233;sum&#233;s de r&#233;f&#233;rence. Pour chaque crit&#232;re nous comparons la valeur 
attribu&#233;e au &quot;meilleur&quot; extrait avec les valeurs attribu&#233;es au m&#234;me crit&#232;re pour le reste des 
extraits dominants. Cette comparaison nous a permis de d&#233;duire un pourcentage d&#8217;importance 
ainsi qu&#8217;un classement de chaque crit&#232;re par rapport aux autres crit&#232;res (voir tableau 1). 
</p>
<p>Tableau 1 : Classement des crit&#232;res d&#8217;&#233;valuation des extraits 
</p>
<p>En cas de pr&#233;sence de plusieurs solutions dominantes, la s&#233;lection se fait en se basant sur le 
classement des crit&#232;res indiqu&#233; dans le tableau 1. Dans l&#8217;exemple illustr&#233; par le tableau 2, 
seuls les extraits E1, E2 et E4 sont consid&#233;r&#233;s comme des extraits dominants. En effet, E1 
poss&#232;de le meilleur score selon le crit&#232;re C5, E2 poss&#232;de le meilleur score selon les crit&#232;res C2 
et C3 et E4 est class&#233; premier selon C4. Le classement des crit&#232;res pr&#233;sent&#233; dans le tableau 1 
est en faveur de l&#8217;extrait E2 qui sera choisi comme &#233;tant le meilleur extrait.  
</p>
<p>Crit&#232;re Taille de l&#8217;extrait 
(C1) 
</p>
<p>Couverture en 
mots simples 
</p>
<p>(C2) 
</p>
<p>Couverture en 
mots doubles 
</p>
<p>(C3) 
</p>
<p>Couverture en mots 
de la question 
</p>
<p>utilisateur 
(C4) 
</p>
<p>Poids de 
l&#8217;extrait 
</p>
<p>(C5) 
Importance 95% 57% 27% 34% 25% 
</p>
<p>Classement 1 2 4 3 5 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;gration d&#8217;une &#233;tape de pr&#233;-filtrage et d&#8217;une fonction multi-objectif en vue d&#8217;am&#233;liorer le 
syst&#232;me ExtraNews de r&#233;sum&#233; de documents multiples 
</p>
<p>Tableau 2 : Exemple de classement Multi-objectif des extraits 
</p>
<p>4.2 Pr&#233;-filtrage des phrases 
A l&#8217;issue de l&#8217;&#233;valuation de notre m&#233;thode dans les sessions DUC&#8217;04 et DUC&#8217;07, nous avons 
d&#233;tect&#233; un autre probl&#232;me li&#233; &#224; la taille des collections des documents sources en entr&#233;e. En 
effet, un ph&#233;nom&#232;ne de d&#233;rive g&#233;n&#233;tique a &#233;t&#233; constat&#233; lorsque la taille des documents sources 
est importante. Cette d&#233;rive a &#233;t&#233; signal&#233;e par la convergence de l&#8217;algorithme utilis&#233; vers des 
solutions pr&#233;matur&#233;es non pertinentes (i.e. des extraits de qualit&#233; relativement faible) vu que 
l&#8217;espace de recherche est tr&#232;s grand.  
</p>
<p>Afin de r&#233;duire l&#8217;espace de recherche, nous avons int&#233;gr&#233; une &#233;tape de pr&#233;-filtrage de phrases 
qui a pour objectif de supprimer les phrases redondantes et par suite, de minimiser le nombre 
de phrases en entr&#233;e (Jaoua et al., 2008b). Malgr&#233; la pr&#233;sence de crit&#232;res li&#233;s &#224; la couverture 
des mots cl&#233;s et qui permet d&#8217;&#233;liminer les extraits pr&#233;sentant de la redondance, l&#8217;&#233;tape de pr&#233;-
filtrage s&#8217;av&#232;re indispensable afin de r&#233;duire l&#8217;espace de recherche et par suite d&#8217;&#233;viter la 
d&#233;rive g&#233;n&#233;tique.  
</p>
<p>L&#8217;&#233;tape de pr&#233;-filtrage utilise la notion de dominance entre phrases qui est une notion inspir&#233;e 
du domaine de l&#8217;ordonnancement multi-objectif. On dit qu&#8217;une phrase P domine une phrase Q 
si l&#8217;ensemble des mots cl&#233;s de la phrase Q (ou de leurs synonymes) est inclus dans l&#8217;ensemble 
des mots cl&#233;s de la phrase P et si la longueur de la phrase P (calcul&#233;e en nombre de mots) est 
inf&#233;rieure ou &#233;gale &#224; celle de la phrase Q. Il est &#224; noter la notion de dominance entre phrases 
utilis&#233;e &#224; ce niveau n&#8217;implique que les deux crit&#232;res de longueur et de couverture en mots cl&#233;s 
simples car ce sont les deux crit&#232;res les mieux class&#233;s au niveau de l&#8217;&#233;valuation des extraits.  
</p>
<p>L&#8217;exemple des deux phrases suivantes extraites du corpus de DUC&#8217;07 illustre la dominance 
de la phrase Q par la phrase P sachant que ces deux phrases renferment les m&#234;mes mots cl&#233;s 
(les mots en italique) et que la longueur de P (33 mots) est inf&#233;rieure &#224; celle de Q (38 mots).  
</p>
<p>P (APW19991026.0010/D0721E): They saw pictures of the ponderosa pine fence where 
Shepard was left to die, his hands tied behind his back, and the pool of blood caused by 
blows as he fought his attackers. 
</p>
<p>Q (APW19991026.0133/D0721E): On Monday, jurors saw pictures of the ponderosa 
pine fence where Shepard was left to die, his hands tied behind his back, and the pool of 
blood caused by more than dozen blows as he fought his attackers.  
</p>
<p>Extraits C1 C2 C3 C4 C5 
</p>
<p>E1 0.98 0.41 0.30 0.31 0.93 
E2 1 0.42 0.35 0.42 0.87 
E3 1 0.37 0.29 0.40 0.86 
E4 0.98 0.37 0.30 0.63 0.83 
E5 0.95 0.32 0.27 0.24 0.80 
E6 0.90 0.15 0.25 0.39 0.75 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jaoua K.F., Jaoua M., Belguith H.L. et Ben Hamadou A. 
</p>
<p>L&#8217;&#233;tape de pr&#233;-filtrage consiste, donc, &#224; comparer les phrases en terme de longueur et de mots 
cl&#233;s simples afin de d&#233;terminer les phrases domin&#233;es qui seront supprim&#233;es du pool des 
phrases initiales utilis&#233; pour g&#233;n&#233;rer des extraits. Il est &#224; noter que la s&#233;lection des phrases 
dominantes permet, en outre, d&#8217;&#233;liminer les phrases similaires ou synonymes. Il est &#224; signaler 
que l&#8217;&#233;limination des phrases synonymes dans l&#8217;extrait a &#233;t&#233; abord&#233;e comme crit&#232;re de 
classification d&#8217;extraits dans les travaux de Liu (Liu et al, 2006).  
</p>
<p>5 Evaluation de la nouvelle m&#233;thode propos&#233;e  
Plusieurs types d&#8217;&#233;valuations ont &#233;t&#233; adopt&#233;es lors des conf&#233;rences DUC pour quantifier les 
performances des syst&#232;mes de r&#233;sum&#233; automatique (Over et al., 2007). Parmi ces &#233;valuations, 
nous citons l&#8217;&#233;valuation Rouge2 (Lin, 2004) qui fait intervenir la diff&#233;rence entre la 
distribution des mots (n_grammes) d&#8217;un r&#233;sum&#233; candidat et celle d&#8217;un ensemble de r&#233;sum&#233;s 
de r&#233;f&#233;rence (r&#233;sum&#233;s humains). La formule de calcul des mesures Rouge est la suivante : 
</p>
<p>{ }
{ } &#8721; &#8712;&#8721;&#8712;
</p>
<p>&#8721;
</p>
<p>&#8712;
&#8721;
</p>
<p>&#8712;
=
</p>
<p>CgramnR&#233;f&#233;renceC
</p>
<p>Cgramn
ccandidatcorrespond
</p>
<p>R&#233;f&#233;renceC
n
</p>
<p>Rouge
</p>
<p>_
</p>
<p>_
</p>
<p>),(
 
</p>
<p>O&#249; correspond (candidat,c) repr&#233;sente le nombre maximum de n_grammes communs entre le 
r&#233;sum&#233; syst&#232;me et le r&#233;sum&#233; de r&#233;f&#233;rence. Le d&#233;nominateur de l&#8217;&#233;quation repr&#233;sente la somme 
du nombre de n_grammes des r&#233;sum&#233;s de r&#233;f&#233;rences. Il est &#224; noter que Rougen est la formule 
de base du score Rouge. On peut donc obtenir des mesures de Rouge1 (1_gramme), Rouge2 
(2_grammes), etc. Des &#233;tudes de corr&#233;lation ont montr&#233; que la mesure Rouge2 pr&#233;sente la 
meilleure corr&#233;lation avec les r&#233;sum&#233;s humains (Lin, 2004).  
</p>
<p>Nous avons &#233;valu&#233; notre m&#233;thode de g&#233;n&#233;ration d&#8217;extraits avant et apr&#232;s l&#8217;int&#233;gration des 
diff&#233;rentes am&#233;liorations pr&#233;sent&#233;es dans la section 4. Dans ce qui suit, nous utilisons le terme 
initiale pour se r&#233;f&#233;rer &#224; la m&#233;thode avant am&#233;lioration. La m&#233;thode initiale a &#233;t&#233; 
exp&#233;riment&#233;e dans les trois t&#226;ches qui s&#8217;int&#233;ressent aux r&#233;sum&#233;s de documents multiples dans 
la session DUC&#8217;04 (t&#226;che 2, 4, et 5). Il est &#224; noter que dans cette version, le crit&#232;re li&#233; aux 
mots cl&#233;s de la question utilisateur n&#8217;est pas pris en compte par notre m&#233;thode car les t&#226;ches 
de r&#233;sum&#233;s exp&#233;riment&#233;es ne comportent pas de questions. Notre m&#233;thode a &#233;t&#233; en outre 
exp&#233;riment&#233;e dans DUC&#8217;07 et a particip&#233; &#224; la t&#226;che principale d&#233;di&#233;e pour le r&#233;sum&#233; guid&#233; 
par une question utilisateur.  
</p>
<p>Apr&#232;s avoir int&#233;gr&#233; les am&#233;liorations pr&#233;cit&#233;es, nous avons proc&#233;d&#233; &#224; une nouvelle &#233;valuation 
de notre m&#233;thode sur le m&#234;me corpus utilis&#233; lors des sessions DUC&#8217;04 et DUC&#8217;07. Les 
r&#233;sultats obtenus montrent une baisse consid&#233;rable du nombre de phrases en entr&#233;e de notre 
syst&#232;me (i.e. ce nombre est pass&#233; de 720 &#224; 386 phrases en moyenne par collection de 
documents). Le tableau 3 reporte les r&#233;sultats obtenus de l&#8217;indice Rouge2 avant et apr&#232;s 
l&#8217;int&#233;gration de l&#8217;&#233;tape de pr&#233;-filtrage ainsi que de l&#8217;application du classement multi-objectif.  
Les r&#233;sultats du tableau 3 montrent l&#8217;int&#233;r&#234;t de l&#8217;int&#233;gration de l&#8217;&#233;tape de pr&#233;-filtrage, et de 
l&#8217;application de la m&#233;thode d&#8217;optimisation multi-objectif. L&#8217;int&#233;gration de l&#8217;&#233;tape de pr&#233;-
                                                 
</p>
<p>2
  Rouge : Recall-Oriented Understudy for Gistering Evaluation  http://berouge.com </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Int&#233;gration d&#8217;une &#233;tape de pr&#233;-filtrage et d&#8217;une fonction multi-objectif en vue d&#8217;am&#233;liorer le 
syst&#232;me ExtraNews de r&#233;sum&#233; de documents multiples 
filtrage a permis d&#8217;augmenter la valeur Rouge2 de 2.2 % en moyenne. L&#8217;utilisation de 
l&#8217;approche multi-objectif a aussi fait ses preuves et a permis d&#8217;am&#233;liorer la valeur de Rouge2 
de 0.4 %. 
</p>
<p>Tableau 3 : Evaluation selon la m&#233;trique Rouge2 avant et apr&#232;s int&#233;gration des am&#233;liorations 
</p>
<p>6 Conclusion  
Dans cet article, nous avons pr&#233;sent&#233; les am&#233;liorations que nous avons apport&#233;es &#224; notre 
m&#233;thode de r&#233;sum&#233; automatique de documents multiples utilis&#233; dans le syst&#232;me ExtraNews. 
Les r&#233;sultats obtenus lors de la session DUC&#8217;07 ont permis d&#8217;identifier l&#8217;importance de 
l&#8217;&#233;tape de pr&#233;-filtrage de phrases pour faire face &#224; la d&#233;rive g&#233;n&#233;tique qui a caract&#233;ris&#233; notre 
m&#233;thode. En effet, cette &#233;tape a permis de r&#233;duire de moiti&#233; le nombre de phrases initiales 
issues des documents sources. Nous avons aussi mis en &#233;vidence l&#8217;importance d&#8217;utiliser une 
strat&#233;gie d&#8217;optimisation multi-objectif pour classer les extraits. 
L&#8217;examen des r&#233;sultats obtenus montre aussi que l&#8217;on peut am&#233;liorer davantage les 
performances de notre syst&#232;me ExtraNews &#224; travers l&#8217;application de nouveaux crit&#232;res de 
s&#233;lection d&#8217;extraits. Nous avons, en outre, envisag&#233; l&#8217;am&#233;lioration de la qualit&#233; discursive de 
l&#8217;extrait produit par notre syst&#232;me &#224; travers l&#8217;int&#233;gration d&#8217;une &#233;tape de r&#233;vision en 
r&#233;organisant les phrases de cet extrait (Jaoua et al., 2008a). Au niveau de cette &#233;tape, nous 
projetons aussi d&#8217;int&#233;grer des m&#233;canismes de compression et de fusion visant &#224; am&#233;liorer la 
qualit&#233; linguistique de l&#8217;extrait final.  
</p>
<p>7 R&#233;f&#233;rences 
BRUCKER P. (1978). On the complexity of clustering problems in Optimization and Operations 
</p>
<p>Research. Lecture Notes in Economics and Mathematical Systems n&#176; 157. 45-54. 
</p>
<p>CARBONELL J., GOLDSTEIN J. (1998). The use of MMR, diversity-based reranking for reordering 
documents and producing summaries. Proceedings of the 21st Annual International ACM SIGIR 
Conference on Research and Development in Information Retrieval. 335-336. 
</p>
<p>COLLETTE Y., SIARRY P. (2002). Optimisation multiobjectif. Paris : Edition Eyrolles.  
</p>
<p>FUENTES M., MASSOT M., RODR&#205;GUEZ H., ALONSO L. (2003). Headline extraction combining statistic 
and symbolic techniques, Proceeding of DUC03 Document Understanding conferences Workshop. 
</p>
<p>                    DUC&#8217;04 (identifiant : id=21, 23,24) :  DUC&#8217;07 
(id=28) 
</p>
<p>T&#226;che 2 T&#226;che 4 T&#226;che 5 Principale                        T&#226;che 
</p>
<p>M&#233;thode Rouge2 Rang Rouge2 Rang Rouge2 Rang Rouge2 Rang 
</p>
<p>Initiale (rang) 0.121  4/14 0.132  1/11 0.118  3/14 0.098  16/32 
Initiale + Mutli-objectif  0.122  4/14 0.132 1/11 0.119  3/14 0.103  14/32 
Initiale + Pr&#233;-filtrage  0.123  3/14 0.132 1/11 0.121  3/14 0.118  4/32 
</p>
<p>Initiale + Pr&#233;-filtrage + 
Multi-Objectif  
</p>
<p>0.123  3/14 0.132  1/11 0.122  2/14 0.120  3/32 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Jaoua K.F., Jaoua M., Belguith H.L. et Ben Hamadou A. 
</p>
<p>GOLDBERG D.E. (1998). Genetic algorithms in search, optimization, and machine learning. Addison-
Wesley, New York. 
</p>
<p>HARABAGIU S., LACATUSU F. (2005). Topic themes for multi-document summarisation. In 
Proceedings of the 28th annual international ACM-SIGIR conference on research and 
development in information retrieval (SIGIR 2005). 202&#8211;209. 
</p>
<p>JAOUA K.F., BELGUITH H.L., BEN HAMADOU A. (2008a). R&#233;vision des Extraits de Documents 
Multiples Bas&#233;e sur la R&#233;organisation des Phrases : Application &#224; la Langue Arabe. Actes de la 
conf&#233;rence IBIMA 08 : Information Management in Modern Organizations.  
</p>
<p>JAOUA K.F., JAOUA M., BELGUITH H.L., BEN HAMADOU A. (2008b). Filtrage de texte pour le r&#233;sum&#233; 
automatique de documents multiples &#224; para&#238;tre dans les actes du colloque CORIA&#8217;08 : COnf&#233;rence 
en Recherche d'Information et Applications.  
</p>
<p>JAOUA K.F., JAOUA M., BELGUITH H.L., BEN HAMADOU A. (2004). Summarization at LARIS 
laboratory. Proceeding of the DUC&#8217;04 Document Understanding conferences Workshop. 
</p>
<p>JAOUA M., BEN HAMADOU A. (2003). Automatic Text Summarization of Scientific Articles Based on 
Classification of Extract's Population, Proceeding of Cicling&#8217;03. 623-634. 
</p>
<p>LIN C.Y. (2004). Rouge: a package for automatic evaluation of summaries. Proceedings of the 
ACL&#8217;04 Workshop. 74-81. 
</p>
<p>LIN C.Y., HOVY E. (2002). Automated multi-document summarization in NeATS. Proceedings of the 
DARPA Human Language Technology Conference. 50&#8211;53. 
</p>
<p>LIU D., HE Y., JI D., YANG H. (2006). Genetic algorithm based multi-document summarization. 
PRICAI&#8217;06. 1140-1144. 
</p>
<p>MANI I., BLOEDORN E. (1997). Multi-document summarization by graph search and matching. 
Proceedings of the 14th National Conference on Artificial Intelligence. 622-628. 
</p>
<p>MCKEOWN K. KLAVANS J., HATZIVASSILOGLOU V., BARZILAY R., AND ESKIN E. (1999). Towards 
multidocument summarization by reformulation: progress and prospects. Proceedings of the 16th 
National Conference on Artificial Intelligence. 453-460. 
</p>
<p>MORI T., NOZAWA M., ASADA Y. (2004). Multi-answer-focused multi-document summarization using 
a question-answering engine. Proceedings of the 20th International Conference on Computational 
Linguistics (COLING 04). 439-445. 
</p>
<p>OVER P., DANG H., HARMAN D. (2007). DUC in context. Information Processing and Management. 
1506&#8211;1520. 
</p>
<p>RADEV D., MCKEOWN K. (1998). Generating natural language summaries from multiple on-line 
sources. Proceeding of the Computational Linguistics. 469-500. 
</p>
<p>SAGGION H., GAIZOUSKAS R.(2004). Multi-document summarization by cluster/profile relevance and 
redundancy removal. Proceeding of the Document Understanding Workshop DUC&#8217;04. 
</p>
<p>SPARK JONES K. (2007). Automatic summarising: The state of the art. Information Processing and 
Management 43. 1449&#8211;1481. 
</p>
<p>WHITE M., KORELSKY T., CARDIE C., PIERCE D., NG V., WAGSTAFF K. (2001). Multidocument 
summarization via information extraction. Proceedings of the DARPA Human Language 
Technology Conference. 143&#8211;146.  </p>

</div></div>
</body></html>