<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traduction multilingue : le projet MulTra</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Traduction multilingue : le projet MulTra
</p>
<p>Eric Wehrli, Luka Nerima
LATL-D&#233;partement de linguistique
</p>
<p>Universit&#233; de Gen&#232;ve
Eric.Wehrli@lettres.unige.ch, Luka.Nerima@lettres.unige.ch
</p>
<p>R&#233;sum&#233;. L&#8217;augmentation rapide des &#233;changes et des communications pluriculturels, en
particulier sur internet, intensifie les besoins d&#8217;outils multilingues y compris de traduction. Cet
article d&#233;crit un projet en cours au LATL pour le d&#233;veloppement d&#8217;un syst&#232;me de traduction
multilingue bas&#233; sur un mod&#232;le linguistique abstrait et largement g&#233;n&#233;rique, ainsi que sur un
mod&#232;le logiciel bas&#233; sur la notion d&#8217;objet. Les langues envisag&#233;es dans la premi&#232;re phase de ce
projet sont l&#8217;allemand, le fran&#231;ais, l&#8217;italien, l&#8217;espagnol et l&#8217;anglais.
</p>
<p>Abstract. The increase of cross-cultural communication triggered notably by the Internet
intensifies the needs for multilingual linguistic tools, in particular translation systems for several
languages. The LATL has developed an efficient multilingual parsing technology based on an
abstract and generic linguistic model and on object-oriented software design. The proposed
project intends to apply a similar approach to the problem of multilingual translation (German,
French, Italian and English).
</p>
<p>Mots-cl&#233;s : Traduction automatique multilingue, approche par objets, g&#233;n&#233;ration de
lexiques bilingues.
</p>
<p>Keywords: Multilingual machine translation, object design, bilingual dictionary deri-
vation.
</p>
<p>1 Introduction
</p>
<p>Malgr&#233; l&#8217;avanc&#233;e spectaculaire des syst&#232;mes de traduction stochastiques (cf. Ney, 2005), de
nombreux chercheurs dans le domaine de la traduction automatique consid&#232;rent qu&#8217;une va-
riante du mod&#232;le de transfert bas&#233; sur des r&#232;gles linguistiques constitue encore pour l&#8217;heure
l&#8217;approche la plus satisfaisante au probl&#232;me de la traduction. Il y a par contre un large d&#233;saccord
sur la question du choix du mod&#232;le linguistique, sur la nature des repr&#233;sentations qui serviront
&#224; exprimer les correspondances d&#8217;une langue &#224; l&#8217;autre, ainsi que sur le niveau d&#8217;abstraction
auquel le transfert devrait s&#8217;effectuer (voir Eberle, 2001).
</p>
<p>Un des probl&#232;mes que nous souhaitons aborder dans ce projet est celui de la traduction mul-
tilingue, c&#8217;est-&#224;-dire du d&#233;veloppement d&#8217;un syst&#232;me de traduction capable de traiter non pas
quelques paires de langues, mais potentiellement un large nombre de langues. Rappelons, pour
illustrer ce point, que dans le contexte europ&#233;en pas moins d&#8217;une quinzaine de langues sont
couramment utilis&#233;es dans la vie quotidienne mais aussi pour des activit&#233;s commerciales ou po-
litiques. Et comme le signale Boitet (2001), &#8220;Despite considerable investment over the past 50</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Wehrli, Luka Nerima
</p>
<p>years, only a small number of language pairs is covered by MT (...), and even fewer are capable
of quality translation or speech translation.&#8221;
</p>
<p>Le projet MulTra repose sur un niveau de repr&#233;sentation linguistique abstrait, inspir&#233; des travaux
r&#233;cents en linguistique g&#233;n&#233;rative (cf. Chomsky, 1995, Culicover et Jackendoff, 2005, Bresnan
2001), suffisamment riche pour exprimer toutes la diversit&#233; des langues prises en consid&#233;ration,
mais suffisamment abstrait pour permettre de rendre compte de g&#233;n&#233;ralisations profondes qui
se cachent parfois derri&#232;re des diff&#233;rences de surface. Une telle approche a &#233;t&#233; adopt&#233;e avec
succ&#232;s pour l&#8217;analyseur Fips (cf. Wehrli, 2007). Au plan informatique, c&#8217;est une mod&#233;lisation
&#8220;objets&quot; qui a &#233;t&#233; retenue, tr&#232;s semblable &#224; celle d&#233;finie pour l&#8217;analyseur multilingue Fips.
</p>
<p>La rapide prolif&#233;ration des modules de transfert a souvent &#233;t&#233; reproch&#233;e au mod&#232;le de traduc-
tion bas&#233; sur le transfert syntaxique comme mod&#232;le pour la traduction multilingue (voir par
exemple Arnold et al. 1995 :81). L&#8217;argument repose sur le fait que le nombre de modules de
transfert cro&#238;t de mani&#232;re quadratique en fonction du nombre n de langues. Cet argument est
cependant consid&#233;rablement affaibli si l&#8217;on peut montrer que les modules de transfert sont rela-
tivement peu importants par rapport aux modules d&#8217;analyse et de g&#233;n&#233;ration, qui eux croissent
de mani&#232;re lin&#233;aire au nombre de langues prises en consid&#233;ration. C&#8217;est bien l&#8217;objectif du pro-
jet MulTra, qui s&#8217;appuyant sur un algorithme de transfert g&#233;n&#233;rique, restreint les modules de
transfert sp&#233;cifiques aux aspects non-isomorphes des structures sources et cibles, comme nous
le verrons plus bas. L&#8217;autre &#233;l&#233;ment de complexit&#233; non lin&#233;raire dans le d&#233;veloppement d&#8217;un
syst&#232;me de traduction multilingue est celui des dictionnaires bilingues. Nous verrons dans la
section 3, une m&#233;thode de d&#233;rivation partielle des dictionnaires bilingues par transitivit&#233; qui
semble en mesure de r&#233;duire drastiquement l&#8217;ampleur du travail &#224; accomplir.
</p>
<p>2 Architecture du syst&#232;me
</p>
<p>L&#8217;algorithme de traduction ob&#233;it au sch&#233;ma traditionnel du transfert. Le texte source est tout
d&#8217;abord analys&#233; par l&#8217;analyseur multilingue Fips (Wehrli, 2007), qui produit une repr&#233;sentation
abstraite de la phrase pr&#233;cisant d&#8217;une part le d&#233;coupage syntagmatique (structure arborescente)
et d&#8217;autre part une repr&#233;sentation des relations pr&#233;dicat-arguments (un peu sur le mod&#232;le des
structures d&#8217;arguments utilis&#233;es en LFG). Etant donn&#233; le caract&#232;re abstrait de ce niveau de re-
pr&#233;sentation, la mise en correspondance d&#8217;une langue &#224; une autre est un processus relativement
simple, qui peut &#234;tre esquiss&#233; comme suit : parcours r&#233;cursif de l&#8217;arborescence source dans
l&#8217;ordre t&#234;te, sous-arbre gauche, sous-arbre droit. Le transfert lexical intervient au moment du
transfert de la t&#234;te (non vide) d&#8217;un constituant et livre un objet lexical cible, souvent mais pas
obligatoirement, de la m&#234;me cat&#233;gorie que l&#8217;objet lexical source. Le m&#233;canisme de projection
syntaxique &#8211; qui permet la cr&#233;ation d&#8217;une structure syntaxique sur la base d&#8217;un item lexical &#8211;
est ensuite invoqu&#233; pour d&#233;terminer la structure syntaxique cible dont l&#8217;item lexical constitue la
t&#234;te. Dans le cas de constituants qui ont &#233;t&#233; interpr&#233;t&#233;s comme des arguments, le processus de
transfert est un peu diff&#233;rent dans la mesure o&#249; certaines propri&#233;t&#233;s de la langue cible peuvent
&#234;tre d&#233;termin&#233;es par les informations lexicales associ&#233;es au pr&#233;dicat qui gouverne cet argument.
Pour prendre un exemple simple, l&#8217;objet direct du verbe fran&#231;ais regarder dans l&#8217;example (1a)
sera traduit en anglais comme un syntagme pr&#233;positionnel avec la pr&#233;position at comme t&#234;te,
comme illustr&#233; en (2a). Cette information vient de la base de donn&#233;es lexicale. Plus sp&#233;cifi-
quement, notre dictionnaire bilingue sp&#233;cifie non seulement les correspondances entre items
lexicaux, mais &#233;galement dans le cas d&#8217;items de nature pr&#233;dicative, la correspondance entre
les arguments. Autrement dit, le lexique fran&#231;ais-anglais &#233;tablit une relation entre le lex&#232;me</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction multilingue et approche objets
</p>
<p>fran&#231;ais [NP regarder NP] et le lex&#232;me anglais [NP look [PP at NP]].
</p>
<p>(1)a. Paul regardait la voiture.
</p>
<p>b. [
TP
</p>
<p>[
DP
</p>
<p>Paul ] regardaiti [ VP ei [ DP la [ NP voiture ] ] ] ]
</p>
<p>(2)a. Paul was looking at the car.
</p>
<p>b. [
TP
</p>
<p>[
DP
</p>
<p>Paul ] was [
VP
</p>
<p>looking [
PP
</p>
<p>at [
DP
</p>
<p>the [
NP
</p>
<p>car ] ] ] ] ]
</p>
<p>La g&#233;n&#233;ration se fait sur la base du m&#233;canisme de projection, ainsi que sur la base de la structure
source, puisque par d&#233;faut l&#8217;algorithme de transfert fait l&#8217;hypoth&#232;se de structures source et cible
isomorphes. Les r&#232;gles de transfert sp&#233;cifiques &#224; une paire de langues donn&#233;e sont r&#233;gies par
le m&#233;canisme de red&#233;finition de m&#233;thode. C&#8217;est le cas, par exemple, pour le transfert entre
le fran&#231;ais et l&#8217;anglais des adjectifs postnominaux, dont les &#233;quivalents anglais se placent en
position pr&#233;nominales, ou pour prendre un exemple plus drastique, la gestion de l&#8217;ordre des
mots entre l&#8217;allemand (langue &#224; verbe en position finale de phrase) et le fran&#231;ais. La g&#233;n&#233;ration
de la phrase cible s&#8217;ach&#232;ve par la g&#233;n&#233;ration morphologique, c&#8217;est-&#224;-dire la s&#233;lection de la
formemorphologique d&#8217;un mot appropri&#233;e aux contraintes locales telles que nombre, cas, genre,
personne, temps ou mode.
</p>
<p>2.1 Ajout d&#8217;une nouvelle langue
</p>
<p>L&#8217;ajout d&#8217;une langue additionnelle au syst&#232;me exige les composantes suivantes : (i) l&#8217;analyseur
Fips pour cette langue, (ii) un module de g&#233;n&#233;ration (principalement morphologique), (iii) un
dictionnaire bilingue pour chacune des autres langues du syst&#232;me, et (iv) un module (&#233;ventuel-
lement vide) de transfert pour chacune des paires de langues additionnelles1.
</p>
<p>Traduction L-&#224;-L Comme nous l&#8217;avons vu ci-dessus, l&#8217;ajout d&#8217;une nouvelle langue &#224; notre
syst&#232;me exige, en plus des lexiques monolingues et bilingues, un analyseur pour cette langue,
un g&#233;n&#233;rateur, c&#8217;est-&#224;-dire deux composantes qui sont compl&#233;tement ind&#233;pendantes des appli-
cations de traductions particuli&#232;res. Autrement dit, un texte en langue L est analys&#233; de la m&#234;me
mani&#232;re, quelle que soit la langue cible dans laquelle il sera traduit. De m&#234;me, la g&#233;n&#233;ration
d&#8217;un texte cible L se fait compl&#232;tement ind&#233;pendamment de la langue source du texte. Cela re-
vient &#224; dire que les modules les plus difficiles &#224; r&#233;aliser sont ind&#233;pendants, respectivement des
langues cibles et des langues sources avec lesquels ils seront amen&#233;s &#224; interagir.
</p>
<p>Un outil de d&#233;veloppement original de notre projet a &#233;t&#233; d&#8217;ajouter &#224; la combinatoire tradition-
nelle n &#183; (n&#8722; 1) pour n langues distinctes, la traduction d&#8217;une langue vers elle-m&#234;me, soit n &#183;n.
Etant donn&#233; notre mod&#232;le g&#233;n&#233;ral de traduction, la traduction d&#8217;un texte disons du fran&#231;ais vers
le fran&#231;ais exige (i) un analyseur du fran&#231;ais, (ii) un g&#233;n&#233;rateur du fran&#231;ais et (iii) un diction-
naire bilingue fran&#231;ais-fran&#231;ais. Comme dans ce cas les langues source et cible sont isomorphes,
le module de transfert fran&#231;ais-fran&#231;ais sera vide, le transfert &#233;tant int&#233;gralement pris en charge
par le module de transfert g&#233;n&#233;rique. L&#8217;avantage m&#233;thodologique que procure cette traduction
L-&#224;-L est de permettre une validation de l&#8217;analyseur et du g&#233;n&#233;rateur de la langue L de ma-
ni&#232;re extr&#234;mement simple puisqu&#8217;il suffira de comparer l&#8217;entr&#233;e et la sortie de ce &#8220;traducteur&quot;
pour d&#233;celer des probl&#232;mes dans l&#8217;un ou l&#8217;autre de ces deux modules. Autre avantage pratique
</p>
<p>1Ce module sera vide dans le cas (hypoth&#233;tique) de deux langues dont les structures syntaxiques seraient iso-
morphes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Wehrli, Luka Nerima
</p>
<p>de cette approche, le travail sur la langue L ne n&#233;cessite &#233;videmment aucune connaissance bi-
lingue particuli&#232;re. Le d&#233;veloppement et la validation syst&#233;matique deux modules d&#8217;analyse
et de g&#233;n&#233;ration de la nouvelle langue L simplifie grandement le d&#233;veloppement des modules
bilingues L-L&#8217;.
</p>
<p>L&#8217;exemple suivant illustre le fonctionnement de ce traducteur L-L pour l&#8217;italien. La phrase (3a)
est la phrase source et (3b) la phrase cible. Un petit outil de d&#233;veloppement permet de mettre
en gras (ou en couleur) toutes les diff&#233;rences entre une phrase source et la phrase cible corres-
pondante.
</p>
<p>(3)a. Raffaello ci ha lasciato magnifici quadri.
b. Raffaello ha lasciato ci magnifici quadri.
</p>
<p>Dans cet exemple, volontairement simplifi&#233;, c&#8217;est la g&#233;n&#233;ration du pronom clitique ci qui fait
probl&#232;me, puisqu&#8217;il appara&#238;t en position postverbale plut&#244;t que pr&#233;verbale. De telles erreurs
sont plus faciles &#224; identifier et &#224; corriger dans un contexte L-L que dans une traduction &#224; partir
d&#8217;une autre langue.
</p>
<p>3 Dictionnaires bilingues
</p>
<p>La base de donn&#233;es lexicale utilis&#233;e dans le projet MulTra est compos&#233;e pour chaque langue
(i) d&#8217;un lexique de mots, contenant toutes les formes fl&#233;chies des mots de la langue, (ii) d&#8217;un
lexique de lex&#232;mes, contenant les informations syntaxiques des mots (un lex&#232;me correspondant
&#224; peu pr&#232;s &#224; une entr&#233;e d&#8217;un dictionnaire classique) et (iii) un lexique de collocations (en r&#233;alit&#233;
des expressions &#224; mots multiples). Nous appelons items lexicaux les lex&#232;mes et les collocations
d&#8217;une langue.
</p>
<p>La base de donn&#233;es lexicale multilingue contient les informations lexicales pour le transfert
d&#8217;une langue &#224; une autre. Pour les fins de stockage, nous utilisons un syst&#232;me de gestion de
base de donn&#233;es relationnelle. Pour chaque paire de langues, le dictionnaire bilingue est impl&#233;-
ment&#233; sous forme de table relationnelle contenant les associations entre les items lexicaux des
deux langues. Le dictionnaire bilingue est bi-directionnel, c&#8217;est-&#224;-dire que l&#8217;association est va-
lable dans les deux sens. En plus de ces liens, la table contient des informations sur le contexte
de traduction, les pr&#233;f&#233;rences de traduction dans les cas de traductions multiples, les descrip-
teurs s&#233;mantiques pour les mots ambigus, les correspondances entres arguments dans les deux
langues (c&#8217;est le cas notamment des verbes). La structure des tables est identique pour toutes
les paires de langues.
</p>
<p>Bien que les lexiques bilingues soient bidirectiennels, ils ne sont pas sym&#233;triques. Si un mot m
de la langue A a une seule traduction t dans la langue B, cela n&#8217;implique pas que t n&#8217;a qu&#8217;une
seule traduction m. Par exemple, le mot anglais tongue est traduit en fran&#231;ais par langue, alors
que langue est traduit vers l&#8217;anglais par tongue et par language. Dans ce cas, l&#8217;attribut &#8220;descrip-
teur&#8221; mentionnera respectivement &#8220;partie du corps&#8221; ou &#8220;language&#8221;. Un autre &#233;l&#233;ment d&#8217;asym&#233;-
trie est l&#8217;attribut &#8220;pr&#233;f&#233;rence&#8221; destin&#233; &#224; ordonner la traduction par des synonymes. Par exemple,
le lexicographe pourra, pour traduire lovely, donner un ordre de pr&#233;f&#233;rence pour charmant par
rapport &#224; agr&#233;able. Les pr&#233;f&#233;rences de traduction dans l&#8217;autre sens devront bien entendu &#234;tre
consid&#233;r&#233;es ind&#233;pendamment.
</p>
<p>Un des probl&#232;mes de la traduction automatique multilingue r&#233;side dans le fait que le nombre de
dictionnaires bilingues requis est une fonction quadratique du nombre de langues consid&#233;r&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction multilingue et approche objets
</p>
<p>En d&#8217;autres termes, il est n&#233;cessaire d&#8217;avoir autant de tables bilingues qu&#8217;il y a de paires de
langues consid&#233;r&#233;es, c&#8217;est-&#224;-dire n &#183; (n &#8722; 1)/2 tables. Par exemple, pour 4 langues, il faut 6
dictionnaires bilingues, pour 5 langues 10 dictionnaires bilingues, pour 6 langues 15 diction-
naires bilingues, etc. Dans le cadre de ce projet, nous prenons en compte 5 langues (fran&#231;ais,
anglais, allemand, italien, espagnol) ce qui requiert id&#233;alement, si nous visons la traduction de
ces langues vers toutes les autres, 10 dictionnaires bilingues. Nous verrons dans la section sui-
vante que nous contournons en partie ce probl&#232;me en g&#233;n&#233;rant automatiquement une partie de
ces dictionnaires bilingues.
</p>
<p>Nous consid&#233;rons qu&#8217;une couverture bilingue satisfaisante (pour les fins de traduction g&#233;n&#233;-
rale) exige au moins 40 &#224; 50&#8217;000 correspondances par paire de langues. Pour le moment, nous
disposons de 4 dictionnaires bilingues sur les 10 n&#233;cessaires avec les nombres d&#8217;entr&#233;es list&#233;s
ci-dessous :
</p>
<p>paire de langues nombre d&#8217;entr&#233;es
anglais-fran&#231;ais 75&#8217;000
allemand-fran&#231;ais 45&#8217;000
fran&#231;ais-italien 37&#8217;000
espagnol-fran&#231;ais 20&#8217;000
</p>
<p>FIG. 1 &#8211; Nombre de correspondances dans les dictionnaires bilingues
</p>
<p>Il est important de mentionner que ces 4 dictionnaires bilingues ont &#233;t&#233; cr&#233;&#233;s manuellement par
des lexicographes et que la qualit&#233; des entr&#233;es peut &#234;tre consid&#233;r&#233;e comme bonne.
</p>
<p>3.1 G&#233;n&#233;ration automatique
</p>
<p>Pour parvenir &#224; la constitution de la base de donn&#233;es bilingue pendant la dur&#233;e du projet, nous
envisageons d&#8217;utiliser une g&#233;n&#233;ration semi-automatique pour une partie des dictionnaires bi-
lingues. &#192; cette fin, nous allons d&#233;river par transitivit&#233; un lexique bilingue en utilisant deux
lexiques existants. Si, par exemple, nous disposons d&#8217;un lexique bilingue pour la paire de
langues anglais, fran&#231;ais et un autre pour la paire fran&#231;ais, allemand, nous pouvons d&#233;river
un lexique bilingue pour la paire anglais, allemand. Les correspondances g&#233;n&#233;r&#233;es sont ensuite
valid&#233;es par corpus comme nous allons le voir ci-dessous. Les correspondances qui ne peuvent
pas &#234;tre valid&#233;es de cette fa&#231;on n&#233;cessitent un contr&#244;le manuel.
</p>
<p>L&#8217;id&#233;e d&#8217;utiliser une langue pivot pour d&#233;river un nouveau lexique bilingue par transitivit&#233; n&#8217;est
pas nouvelle (voir par exemple, Paik &amp; al. 2004, Ahn &amp; Frampton 2006). Le recours &#224; une
langue pivot a aussi &#233;t&#233; utilis&#233; dans d&#8217;autre domaine comme la recherche d&#8217;information inter-
langue (Cross Language Information Retrieval) (voir par exemple Gollins &amp; Sanderson 2001,
Lu &amp; al. 2004).
</p>
<p>Le sch&#233;ma g&#233;n&#233;ral de la d&#233;rivation est d&#8217;utiliser deux lexiques bilingues qui partagent la m&#234;me
langue et de faire une jointure sur les tables relationnelles correspondantes en utilisant l&#8217;item
lexical de la langue en partag&#233;e comme pivot. Par exemple, la validation des correspondances
ainsi obtenues est essentielle et seulement celles qui sont de bonne qualit&#233; doivent &#234;tre conser-
v&#233;es dans le lexique g&#233;n&#233;r&#233;s.
</p>
<p>Plus pr&#233;cis&#233;ment, le processus se d&#233;roule comme suit :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Wehrli, Luka Nerima
</p>
<p>1. Choisir deux tables bilingues pour les paires de langues (A, B) et (B, C) et effectuer une
jointure naturelle.
</p>
<p>2. Valider toutes les correspondances non ambigu&#235;. Est consid&#233;r&#233;e comme correspondance
non ambigu&#235; toute correspondance obtenue par transitivit&#233; &#224; partir de correspondances
dont le champ &#8220;descripteur&#8221; est vide.
</p>
<p>3. Valider toutes les correspondances obtenues par un pivot de type collocation. Nous consi-
d&#233;rons en effet comme tr&#232;s improbable qu&#8217;une collocation soit ambigu&#235;.
</p>
<p>4. Toutes les autres correspondances sont soumises &#224; deux filtres successifs : a) seules les
correspondances avec une pr&#233;f&#233;rence sup&#233;rieure ou &#233;gale &#224; la moyenne sont prises en
consid&#233;ration2, b) les correspondances sont ensuite recherch&#233;es dans un corpus parall&#232;le,
seules les correspondances effectivement utilis&#233;es comme traduction dans le corpus sont
valid&#233;es.
</p>
<p>La derni&#232;re &#233;tape m&#233;rite d&#8217;&#234;tre un peu d&#233;taill&#233;e. Tout d&#8217;abord, le corpus parall&#232;le est &#233;tiquet&#233;
par FipsTag, un &#233;tiqueteur bas&#233; sur l&#8217;analyseur syntaxique Fips. Cette mani&#232;re de proc&#233;der a
le grand avantage de lemmatiser les mots du corpus, ce qui permet d&#8217;effectuer le traitement au
niveau des items lexicaux (lex&#232;mes et collocations) qui sont les &#233;l&#233;ments de base des correspon-
dances bilingues plut&#244;t qu&#8217;au niveau des mots. Cette approche est particuli&#232;rement pr&#233;cieuse
pour les verbes &#224; particules, comme on en trouve par exemple en anglais et en allemand. Afin
de v&#233;rifier la validit&#233; des correspondances, nous avons d&#233;velopp&#233; un outil qui recherche et qui
compte dans le corpus parall&#232;le le nombre d&#8217;occurrences de chaque correspondance g&#233;n&#233;r&#233;e
ainsi que celles de ses deux correspondants pris s&#233;par&#233;ment. A la fin du processus, nous effec-
tuons un calcul de rapport de vraisemblance (Likelihood ratio) afin de d&#233;cider de la validation ou
du rejet des correspondances rarement utilis&#233;es dans le corpus. Un autre avantage (inattendu)
de travailler sur un corpus &#233;tiquet&#233; est de pouvoir utiliser le num&#233;ro d&#8217;index unique associ&#233;
par FipsTag &#224; chaque lex&#232;me (ou collocation) dans l&#8217;algorithme de comptage et de v&#233;rification.
Nous avons principalement exploit&#233; le fait que les num&#233;ros d&#8217;index peuvent &#234;tre utilis&#233;s comme
indices de tableaux pour acc&#233;l&#233;rer de fa&#231;on significative le fonctionnement de l&#8217;algorithme.
</p>
<p>3.2 R&#233;sultats de la g&#233;n&#233;ration
</p>
<p>&#192; ce stade du projet, nous avons g&#233;n&#233;r&#233; automatiquement deux lexiques bilingues : (1) le lexique
anglais-allemand sur la base de l&#8217;anglais-fran&#231;ais et allemand-fran&#231;ais et (2) le lexique anglais-
italien sur la base de l&#8217;anglais-fran&#231;ais et fran&#231;ais-italien. Pour la validation des correspon-
dances, nous avons utilis&#233; le corpus parall&#232;le des d&#233;bats du Parlement europ&#233;en pour la p&#233;riode
1996 &#224; 2001, EuroParl Version 1 (Koehn, 2005). Le tableau ci-dessous r&#233;sume les r&#233;sultats :
</p>
<p>anglais-allemand anglais-italien
correspondances candidates 56&#8217;640 49&#8217;686
correspondances non ambig&#252;es 30&#8217;259 28&#8217;322
obtenues avec une collocation comme pivot 2&#8217;220 1&#8217;778
correspondances valid&#233;es par corpus 6&#8217;282 7&#8217;051
total des correspondances obtenues 38&#8217;741 37&#8217;151
</p>
<p>La qualit&#233; des correspondances d&#233;riv&#233;s est tr&#232;s bonne, mais le nombre de correspondances que
nous avons r&#233;ussi &#224; v&#233;rifier dans le corpus est en de&#231;&#224; de nos attentes : nous avons constat&#233;
</p>
<p>2La pr&#233;f&#233;rence est un entier de 0 &#224; 6 (6 le maximum) qui permet d&#8217;ordonner les correspondances multiples pour
un item donn&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traduction multilingue et approche objets
</p>
<p>queseulement 26% des correspondances g&#233;n&#233;r&#233;es ont pu &#234;tre valid&#233;es dans le corpus EuroParl
pour l&#8217;anglais - en allemand et 36% pour l&#8217;anglais &#8211; italien. Les corpus EuroParl utilis&#233;s varient
entre 17M et 19.6M mots selon la langue. Le temps n&#233;cessaire pour &#233;tiqueter le corpus avec
FipsTag, le temps pour effectuer la requ&#234;te SQL qui g&#233;n&#232;re les correspondances par transitivit&#233;
et le temps n&#233;cessaire pour v&#233;rifier les correspondances dans le corpus sont indiqu&#233;s dans le
tableau ci-dessous. Nous avons effectu&#233; ces mesures avec un processeur double c&#339;ur de 2,67
GHz. :
</p>
<p>anglais 43.8h
allemand 37.7h
italien 26.3h
</p>
<p>FIG. 2 &#8211; Temps requis pour l&#8217;&#233;tiquetage
</p>
<p>requ&#234;te SQL validation dans le corpus
anglais-allemand 0.5min 3.2min
anglais-italien 0.4min 3.0min
</p>
<p>FIG. 3 &#8211; Temps requis pour la validation par corpus
</p>
<p>Nous pouvons observer que l&#8217;&#233;tiquetage n&#233;cessite beaucoup de temps. Ce n&#8217;est toutefois pas
trop p&#233;nalisant car l&#8217;&#233;tiquetage des corpus n&#8217;est effectu&#233; qu&#8217;une seule fois. Ce qui est int&#233;res-
sant, par contre, c&#8217;est que la requ&#234;te dans la base de donn&#233;es et la validation des correspondances
dans le corpus sont rapides, permettant ainsi grand nombre d&#8217;essais afin d&#8217;ajuster les param&#232;tres
de filtrage de la requ&#234;te.
</p>
<p>4 Conclusion
</p>
<p>Le projet MulTra vise au d&#233;veloppement d&#8217;un syst&#232;me de traduction multilingue ob&#233;issant au
mod&#232;le classique analyse-transfert-g&#233;n&#233;ration sans succomber aux probl&#232;mes de complexit&#233;
due &#224; la prolif&#233;ration des modules de transferts et &#224; celle des dictionnaires bilingues par le
choix d&#8217;une part d&#8217;un mod&#232;le linguistique abstrait favorisant les repr&#233;sentations g&#233;n&#233;riques et
d&#8217;autre part une architecture logicielle bas&#233;e sur la notion d&#8217;objet, permettant elle aussi l&#8217;ex-
pression de processus g&#233;n&#233;riques susceptibles d&#8217;&#234;tre red&#233;finis (ou &#233;tendus) pour satisfaire les
besoins sp&#233;cifiques des langues particuli&#232;res en ce qui concerne l&#8217;analyseur et le g&#233;n&#233;rateur,
ou de paires de langues dans le cas du transfert. De m&#234;me, un effort particulier a &#233;t&#233; entrepris
pour r&#233;duire le travail consid&#233;rable que repr&#233;sente l&#8217;&#233;laboration des dictionnaires bilingues. La
d&#233;rivation de correspondances bilingues par transitivit&#233;, valid&#233;es gr&#226;ce &#224; un corpus bilingue,
semble en mesure de r&#233;duire de pr&#232;s de 40% (et plus de 90% pour les expressions &#224; mots mul-
tiples) la t&#226;che des lexicographes. Le projet n&#8217;est pas suffisamment avanc&#233; pour que l&#8217;on puisse
v&#233;ritablement comparer les r&#233;sultats de traduction avec des syst&#232;mes commerciaux, mais les
premiers pas sont prometteurs. A l&#8217;heure actuelle, les paires suivantes ont &#233;t&#233; d&#233;velopp&#233;es ou
sont en d&#233;veloppement (anglais-fran&#231;ais, allemand-fran&#231;ais, fran&#231;ais-anglais, allemand-anglais,
fran&#231;ais-italien, italien-fran&#231;ais, fran&#231;ais-espagnol, espagnol-fran&#231;ais), avec des dictionnaires
bilingues de 20&#8217;000 (espagnol-fran&#231;ais) &#224; 75&#8217;000 entr&#233;es (anglais-fran&#231;ais).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Eric Wehrli, Luka Nerima
</p>
<p>Remerciements
</p>
<p>Cette recherche a &#233;t&#233; financ&#233;e en partie par le Fonds national suisse de la recherche scientifique,
subside no 100012-113864.
</p>
<p>5 Bibliographie
</p>
<p>Ahn, K. et M. Frampton, 2006. &#8220;Automatic Generation of Translation Dictionaries Using Inter-
mediary Languages&#8221; in Cross-Language knowledge Induction Workshop of the EACL-
06, 41-44.
</p>
<p>Arnold, D., L. Balkyn, S. Meijer, R. Humphreys et L. Sadler, 1995. Machine Translation : An
Introductory Guide, http ://www.essex.ac.uk/linguistics/clmt/MTbook/HTML/book.html
</p>
<p>Boitet, C. 2001. &#8220;Four technical and organizational keys to handle more languages and improve
quality (on demand) in MT&#8221; in Proceedings of MT-Summit VIII, 18-22.
</p>
<p>Bresnan, J. 2001. Lexical Functional Syntax, Oxford, Blackwell.
</p>
<p>Culicover, P. et R. Jackendoff, 2005. Simpler Syntax, Oxford, Oxford University Press.
</p>
<p>Eberle, K. 2001. &#8220;FUDR-based MT, head switching and the lexicon&#8221; in Proceedings of MT-
Summit VIII, 93-98.
</p>
<p>Gollins, T. et M. Sanderson, 2001. &#8220;Improving cross language retrieval with triangulated trans-
lation&#8221;, Proceedings of the 24th annual international ACM SIGIR conference on Research
and Development in Information Retrieval, 90-95.
</p>
<p>Koehn, Philipp, 2005. &#8220;Europarl : A Parallel Corpus for Statistical Machine Translation&#8221;, MT
Summit 2005, 79-86.
</p>
<p>Lu, W.H., L.F. Chien et H.J. Lee, 2004. &#8220;Anchor Text Mining for Translation of Web Queries :
A Transitive Translation Approach&#8221;, ACM Transactions on Information Systems (TOIS),
vol. 22.2, 242-269.
</p>
<p>Ney, H. 2005. &#8220;One Decade of Statistical Machine Translation&#8221;, Proceedings of MT-Summit X,
12-17.
</p>
<p>Paik, K., S. Shirai et H. Nakaiwa, 2004. &#8220;Automatic Construction of a Transfer Dictionary
Considering Directionality&#8221;, COLING 2004 Multilingual Linguistic Resources Work-
shop, 25-32.
</p>
<p>Seretan, V. et E. Wehrli, 2007. &#8220;Collocation translation based on sentence alignment and par-
sing&#8221;, Actes de la 14e conf&#233;rence sur le Traitement Automatique des Langues Naturelles
(TALN 2007), 401-410.
</p>
<p>Wehrli, E. 1998. &#8220;Translating Idioms&#8221;, Proceedings of COLING-98, Montreal, 1388-1392.
</p>
<p>Wehrli, E. 2007. &#8220;Fips, a &quot;Deep&quot; Linguistic Multilingual Parser&#8221;, Deep Linguistic Processing
Workshop, ACL-2007, Prague, 120-127.</p>

</div></div>
</body></html>