<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Quelles combinaisons de scores et de crit&#232;res num&#233;riques pour un syst&#232;me de Questions/R&#233;ponses ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelles combinaisons de scores et de crit&#232;res num&#233;riques pour un syst&#232;me de QR ? 
</p>
<p>Quelles combinaisons de scores et de crit&#232;res num&#233;riques 
pour un syst&#232;me de Questions/R&#233;ponses ? 
</p>
<p>Laurent Gillard(1,2), Patrice Bellot(2), Marc El-B&#232;ze(2) 
</p>
<p>(1)CEA, LIST, Laboratoire d&#8217;ing&#233;nierie de la connaissance multi-m&#233;dia multilingue, 
18 route du Panorama, BP6, FONTENAY AUX ROSES, F- 92265 France  
</p>
<p>pr&#233;nom.nom @ cea.fr 
(2)Laboratoire d'Informatique d'Avignon (LIA) 
Universit&#233; d&#8217;Avignon et des Pays de Vaucluse 
</p>
<p>F-84911 Avignon Cedex 9 (France) 
pr&#233;nom.nom @ univ-avignon.fr 
</p>
<p>R&#233;sum&#233; Dans cet article, nous pr&#233;sentons une discussion sur la combinaison de diff&#233;rents 
scores et crit&#232;res num&#233;riques pour la s&#233;lection finale d&#8217;une r&#233;ponse dans la partie en charge 
des questions factuelles du syst&#232;me de Questions/R&#233;ponses d&#233;velopp&#233; au LIA. Ces scores et 
crit&#232;res num&#233;riques sont d&#233;riv&#233;s de ceux obtenus en sortie de deux composants cruciaux pour 
notre syst&#232;me : celui de s&#233;lection des passages susceptibles de contenir une r&#233;ponse et celui 
d&#8217;extraction et de s&#233;lection d&#8217;une r&#233;ponse. Ils sont &#233;tudi&#233;s au regard de leur expressivit&#233;. Des 
comparaisons sont faites avec des approches de s&#233;lection de passages mettant en &#339;uvre des 
scores conventionnels en recherche d&#8217;information. Parall&#232;lement, l&#8217;influence de la taille des 
contextes (en nombre de phrases) est &#233;valu&#233;e. Cela permet de mettre en &#233;vidence que le choix 
de passages constitu&#233;s de trois phrases autour d&#8217;une r&#233;ponse candidate, avec une s&#233;lection des 
r&#233;ponses bas&#233;e sur une combinaison entre un score de passage de type Lucene ou Cosine et 
d&#8217;un score de compacit&#233; appara&#238;t comme un compromis int&#233;ressant. 
</p>
<p>Abstract This article discusses combinations of scores for selecting the best answer in a 
factual question answering system. Two major components of our QA system: (i) relevant 
passage selection, and (ii) answer extraction, produce a variety of scores. Here we study the 
expressivity of these scores, comparing our passage density score (i) to more conventional 
ranking techniques in information retrieval. In addition, we study varying the length (in 
number of sentences) of context retained in the relevant passages. We find that a three 
sentences window, and a mixing of Lucene or Cosine ranking with our compactness score (ii) 
provides the best results. 
</p>
<p>Mots-cl&#233;s :   Syst&#232;me de Questions/R&#233;ponses, compacit&#233;, densit&#233;, combinaison de scores. 
Keywords:   Question Answering, compactness, density, combination of scores. 
</p>
<p>1 Introduction 
Les syst&#232;mes de Questions/R&#233;ponses (QR) se proposent d&#8217;extraire LA r&#233;ponse &#224; une question 
formul&#233;e en langage naturel depuis un ensemble de documents. Dans ce travail, nous nous 
int&#233;ressons aux syst&#232;mes de Questions/R&#233;ponses (sQR) capables de r&#233;pondre &#224; des questions </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. GILLARD, P. BELLOT, M. EL-B&#200;ZE 
</p>
<p>factuelles, c'est-&#224;-dire &#224; celles dont la r&#233;ponse est un court &#233;nonc&#233;, et plus sp&#233;cifiquement 
l&#8217;expression d&#8217;une information s&#233;mantique pr&#233;cise et concise telle que le nom d&#8217;une personne, 
d&#8217;un lieu, la date d&#8217;un &#233;v&#233;nement, une valeur num&#233;rique, etc. La r&#233;ponse &#224; produire est 
obtenue par extraction depuis un document plut&#244;t que par synth&#232;se. Enfin, le cadre 
exp&#233;rimental typique pour les r&#233;sultats obtenus ci-apr&#232;s est semblable &#224; celui propos&#233; par 
diff&#233;rentes campagnes d&#8217;&#233;valuation en QR comme le sous-volet Question Answering de la 
campagne TREC (Voorhees, Harman, 2005) ou encore la campagne &#201;valuation en Questions-
R&#233;ponses (EQueR) (Ayache et al., 2005). 
Le syst&#232;me de Questions/R&#233;ponses d&#233;velopp&#233; pour ce travail au LIA poss&#232;de une architecture 
relativement g&#233;n&#233;rique (explicit&#233;e en 1.1). Il fait intervenir un encha&#238;nement s&#233;quentiel de 
traitements pour aboutir &#224; une r&#233;ponse finale. Ces traitements sont &#224; percevoir comme autant 
de processus de filtrage pour limiter le contexte d&#8217;une recherche : d&#8217;abord du corpus vers un 
ensemble de documents, puis de cet ensemble vers des passages, et des passages vers une 
r&#233;ponse. Il est &#224; noter que ce syst&#232;me repose uniquement sur une approche fond&#233;e sur des 
scores et ne n&#233;cessite que peu ou pas de connaissances syntaxiques. Concr&#232;tement, nous 
avons d&#233;fini deux scores pour la t&#226;che de QR : le premier score, dit de densit&#233;, permet de 
s&#233;lectionner des passages susceptibles de contenir une r&#233;ponse int&#233;ressante pour une question; 
le second score, la compacit&#233;, permet, dans un passage, de s&#233;lectionner la meilleure des 
r&#233;ponses. Ces deux scores sont calcul&#233;s relativement &#224; une r&#233;ponse candidate pr&#233;alablement 
rep&#233;r&#233;e dans un document ou dans un passage, celle-ci devant &#234;tre d&#8217;un type compatible avec 
celui attendu exprim&#233; par la question. Ces deux scores sont utilis&#233;s en s&#233;quence : la densit&#233; 
intervient dans un module situ&#233; en amont de celui qui emploie la compacit&#233;. 
Dans cet article, nous nous int&#233;ressons plus sp&#233;cifiquement &#224; une combinaison de ces scores 
de densit&#233; et de compacit&#233;. Notre objectif est d&#8217;&#233;tudier s&#8217;il est possible de faire ressortir des 
caract&#232;res compl&#233;mentaires, a priori inconnus, qui permettent d&#8217;am&#233;liorer les performances 
en bout de cha&#238;ne et par cons&#233;quent ayant un impact sur la s&#233;lection d&#8217;une r&#233;ponse, 
notamment par rapport &#224; un emploi en s&#233;quence de ces scores. En outre, afin d&#8217;&#233;tudier cette 
notion de compl&#233;mentarit&#233; de mani&#232;re plus exhaustive, d&#8217;autres recherches de passages 
mettant en &#339;uvre des scores classiques en recherche d&#8217;information (Cosine, Cosine+Okapi et 
score Lucene) sont &#233;galement examin&#233;es et mises en concurrence. Nous v&#233;rifions qu&#8217;une 
combinaison de ces scores est pr&#233;f&#233;rable &#224; un score obtenu sans combinaison. De plus dans le 
but d&#8217;&#233;largir l&#8217;int&#233;r&#234;t de ce travail, diff&#233;rentes tailles de passages1 (de une, trois, cinq, ou neuf 
phrases autour d&#8217;une r&#233;ponse potentiellement int&#233;ressante) sont envisag&#233;es. Par ailleurs, 
comme nous exploitons des scores, c&#8217;est tout naturellement vers une combinaison num&#233;rique 
que nous nous sommes dirig&#233;s. Enfin, d&#8217;un point de vue applicatif, il est &#224; noter que si les 
deux combinaisons propos&#233;es ont bien &#233;t&#233; employ&#233;es lors de nos deux derni&#232;res participations 
avec le LIA &#224; des campagnes d&#8217;&#233;valuations des syst&#232;mes de Questions/R&#233;ponses, les r&#233;sultats 
pr&#233;sent&#233;s sont ceux d&#8217;exp&#233;riences faites hors campagnes, sur les questions factuelles 
d&#8217;EQueR, et ont &#233;t&#233; de ce fait &#233;valu&#233;s au regard d&#8217;une r&#233;f&#233;rence tir&#233;e d&#8217;EQueR. 
</p>
<p>1.1 Architecture g&#233;n&#233;rique d&#8217;un sQR 
Un syst&#232;me de Questions/R&#233;ponses peut &#234;tre sch&#233;matiquement d&#233;crit comme un 
encha&#238;nement de diff&#233;rents modules correspondant &#224; trois &#233;tapes principales : une analyse (&#224; 
percevoir comme une &#171; compr&#233;hension &#187;) de la question, un traitement des documents et 
                                                 
</p>
<p>1
 Il s&#8217;agit de la dimension des passages produits en sortie du module de s&#233;lection des passages. Lesquels fixent 
</p>
<p>ensuite le contexte d&#8217;extraction pour une r&#233;ponse pr&#233;cise &#224; l&#8217;&#233;tape aval correspondante. C&#8217;est bien la pr&#233;sence 
(ou l&#8217;absence), en fin de cha&#238;ne, d&#8217;une r&#233;ponse pr&#233;cise correcte qui est &#233;valu&#233;e dans nos exp&#233;riences. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelles combinaisons de scores et de crit&#232;res num&#233;riques pour un syst&#232;me de QR ? 
</p>
<p>enfin une extraction d&#8217;une ou de plusieurs r&#233;ponses. Concernant, l&#8217;&#233;tape interm&#233;diaire de 
traitement des documents, elle est tr&#232;s souvent d&#233;compos&#233;e en une recherche documentaire 
classique suivie d&#8217;une exploitation des documents s&#233;lectionn&#233;s &#224; l&#8217;issue de cette recherche 
dans le but de localiser des passages susceptibles de contenir des r&#233;ponses dans la perspective 
d&#8217;une extraction finale. La figure 1 pr&#233;sente cette architecture sch&#233;matique &#224; trois, et plus 
g&#233;n&#233;ralement quatre composants ainsi que leurs principales interactions. Chaque &#233;tape produit 
en sortie des informations utilis&#233;es en entr&#233;e de l&#8217;&#233;tape suivante (voire en entr&#233;e de plusieurs 
de celles situ&#233;es en aval). Par ailleurs, pour quelques syst&#232;mes plus complexes, il manque &#224; ce 
sch&#233;ma d&#8217;&#233;ventuels flux suppl&#233;mentaires g&#233;n&#233;r&#233;s lors d&#8217;allers-retours et/ou r&#233;troactions entre 
les composants (relaxation de contraintes, etc.). 
</p>
<p> 
</p>
<p>Figure 1. Architecture g&#233;n&#233;rique d&#8217;un syst&#232;me de Questions/R&#233;ponses 
</p>
<p>&#192; titre d&#8217;illustration, voici un exemple du fonctionnement de cette architecture g&#233;n&#233;rique pour 
la question &#171; En quelle ann&#233;e est n&#233; Nelson Mandela ? &#187; : 
- L&#8217;analyse de la question identifie la nature de l&#8217;information qui va &#234;tre recherch&#233;e (une 
&#233;tiquette d&#8217;entit&#233; ou un type de r&#233;ponse attendue) (Ferret et al., 2002), soit ici, l&#8217;ann&#233;e 
associ&#233;e &#224; une date, et plus sp&#233;cifiquement celle d&#8217;une date de naissance. Elle construit 
&#233;galement une requ&#234;te &#224; destination d&#8217;un syst&#232;me de recherche documentaire comme par 
exemple, la requ&#234;te constitu&#233;e par les seuls lemmes &#171; na&#238;tre &#187;, &#171; Nelson &#187;, et &#171; Mandela &#187; ; 
- le syst&#232;me de recherche documentaire propose une liste d&#8217;identifiants de documents du 
corpus contenant tous ces lemmes, soit les documents &#171; ATS.940426.0081 &#187;,  &#171; LEMONDE94-000873-
19940509 &#187;, &#171; LEMONDE94-003506-19940429 &#187;, &#171; LEMONDE95-000054 &#187;,  &#171; LEMONDE95-012364 &#187;. Cette liste 
pourrait &#234;tre ordonn&#233;e suivant une similarit&#233; prenant en compte la fr&#233;quence des lemmes ; 
- le composant en charge du traitement des documents effectue un balisage des entit&#233;s 
de type date. Il d&#233;coupe ces documents en blocs ou passages, effectue une s&#233;lection des 
passages int&#233;ressants (Tellex et al., 2003) et &#233;limine, par exemple, ceux qui ne contiennent ni 
une entit&#233; date, ni les lemmes &#171; na&#238;tre &#187;, &#171; Nelson &#187;, et &#171; Mandela &#187; ; 
- enfin, l&#8217;extraction d&#8217;une r&#233;ponse consiste &#224; choisir la &#171; meilleure &#187; r&#233;ponse &#224; proposer 
comme r&#233;sultat, cela en accord avec l&#8217;&#233;tiquette s&#233;mantique associ&#233;e lors de la premi&#232;re &#233;tape 
(pour cet exemple, la date de naissance ou son g&#233;n&#233;rique date). Cette s&#233;lection de la, ou des 
meilleures r&#233;ponses pourrait &#234;tre faite gr&#226;ce &#224; l&#8217;utilisation de patrons morphosyntaxiques ou 
gr&#226;ce &#224; un calcul de proximit&#233; des diff&#233;rents termes associ&#233;s aux lemmes int&#233;ressants de la 
question dans les passages. Et, en d&#233;finitive, le &#171; 1918 &#187; de &#171; Nelson Mandela est n&#233; le 
[DATE18 juillet 1918] dans un village xhosa du Transke&#239;. &#187; (du document &#171; ATS.940426.0081 &#187;) 
appara&#238;t ainsi comme une meilleure r&#233;ponse que le &#171; 1912 &#187; rencontr&#233; dans le passage : 
&#171; Nelson Mandela _ soixante-quinze ans _ n'&#233;tait pas n&#233; quand le Congr&#232;s national africain 
(ANC) vit le jour ([DATE1912]). &#187; (&#171; LEMONDE94-003506-19940429 &#187;). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. GILLARD, P. BELLOT, M. EL-B&#200;ZE 
</p>
<p>2 Quelle combinaison de scores, quels crit&#232;res ? 
Dans le syst&#232;me de QR envisag&#233;, chacune des deux &#233;tapes, s&#233;lection de passages ou s&#233;lection 
d&#8217;une r&#233;ponse, est associ&#233;e &#224; un score. Ce dernier est une valeur num&#233;rique r&#233;elle qui permet 
d&#8217;ordonner l&#8217;ensemble des possibles, le meilleur des scores correspond au meilleur des cas. 
S&#233;lection de passages. Ce score de passage est d&#233;pendant de la technique mise en &#339;uvre pour 
le filtrage. Ainsi, il peut s&#8217;agir de notre score de densit&#233; (Gillard et al., 2005), ou bien de 
scores de similarit&#233; plus conventionnels2, que nous envisageons &#224; titre de comparaison, tels 
que Cosine, d&#8217;une combinaison entre Cosine et Okapi (Wilkinson et al., 1996), ou de celui 
calcul&#233; par Lucene. Lorsque le score consid&#233;r&#233; est notre score de densit&#233;, l&#8217;une de ses 
caract&#233;ristiques essentielles est d&#8217;&#234;tre un score de proximit&#233; des objets de la question (les mots 
qui la constituent et les entit&#233;s nomm&#233;es qu&#8217;elle comprend) &#224; l&#8217;&#233;chelle du document, tout en 
consid&#233;rant, et m&#234;me en englobant, une r&#233;ponse candidate rep&#233;r&#233;e et marqu&#233;e comme 
susceptible d&#8217;&#234;tre en ad&#233;quation avec le type attendu par la question. Dans les cas d&#8217;une 
similarit&#233; vectorielle, l&#8217;expressivit&#233; du score repose principalement sur des concepts de 
fr&#233;quence et de raret&#233;, notamment au travers des pond&#233;rations TF.IDF (&#171; Term 
Frequency&#1;Inverse Document Frequency &#187;). De plus, Okapi fait &#233;galement intervenir un 
crit&#232;re de taille moyenne des passages ; et, le score Lucene, un ratio, appel&#233; couverture, entre 
les mots de la question et ceux de ces mots pr&#233;sents dans le passage. 
S&#233;lection et extraction d&#8217;une r&#233;ponse. Notre score de compacit&#233; positionnelle (Gillard et al., 
2007), fait appel &#224; des notions de proximit&#233; des mots (Luhn, 1958) de la question dans un 
passage. Ces mots doivent en outre &#234;tre au plus pr&#232;s de la r&#233;ponse candidate (l&#8217;id&#233;e est l&#224; 
encore une notion de la plus grande &#171; densit&#233; &#187; possible) compatible avec le type attendu par 
la question mais cette fois dans une localit&#233; restreinte &#224; un fragment d&#8217;un passage. Une autre 
possibilit&#233; est d&#8217;envisager un d&#233;compte des mots communs entre la question et le passage 
extrait, compl&#233;t&#233; par une strat&#233;gie telle que celle employ&#233;e lors de la participation du LIA &#224; 
TREC-11 : celle-ci consistait &#224; proposer comme r&#233;ponse la premi&#232;re r&#233;ponse compatible avec 
le type attendu. L&#8217;expressivit&#233; attendue pour ces diff&#233;rents scores peut &#234;tre sch&#233;matis&#233;e dans 
un tableau tel que le tableau 1. Bien que nous ne l&#8217;ayons pas exp&#233;riment&#233;, il est &#233;galement 
possible de pr&#233;senter l&#8217;usage de patrons morphosyntaxiques qui correspond &#224; une autre grande 
famille de type d&#8217;extraction pour une r&#233;ponse dans des syst&#232;mes de Questions/R&#233;ponses. 
Le tableau 1 pr&#233;sente l&#8217;expressivit&#233; de ces diff&#233;rentes m&#233;thodes. Ainsi, la fr&#233;quence 
correspond &#224; une notion habituellement associ&#233;e &#224; la fr&#233;quence d&#8217;un mot dans un document, 
ou plut&#244;t, dans le cas qui nous int&#233;resse ici, dans un passage. Il s&#8217;agit d&#8217;une notion associ&#233;e 
aux pond&#233;rations intervenant dans des calculs de similarit&#233;. La raret&#233;, que l&#8217;on associe 
ais&#233;ment &#224; l&#8217;inverse d&#8217;une fr&#233;quence au sein d&#8217;un ensemble de documents n&#8217;intervient pas 
dans nos calculs de compacit&#233; positionnelle, dans ceux de densit&#233; ou pour des patrons 
morphosyntaxiques. L&#8217;ordre des mots, est un point faible dans l&#8217;ensemble des scores 
envisag&#233;s ici, mais il serait captur&#233; par des patrons morphosyntaxiques. Il est &#224; noter qu&#8217;il est 
tout &#224; fait envisageable d&#8217;effectuer des calculs de compacit&#233; sur des unit&#233;s plus grandes qu&#8217;un 
mot et ainsi de faire appara&#238;tre une telle notion d&#8217;ordre en consid&#233;rant, par exemple, des 
bigrammes de mots ou toutes combinaisons de n-grammes3. Cependant, dans le cas d&#8217;une 
</p>
<p>                                                 
</p>
<p>2
  Un syst&#232;me de recherche bool&#233;en ne permet pas diff&#233;rencier et d&#8217;ordonner suffisamment les passages trouv&#233;s. 
</p>
<p>3
  Nous avons commenc&#233; &#224; emprunter cette voie dans le cadre d&#8217;une utilisation d&#8217;un score de compacit&#233; pour du 
</p>
<p>r&#233;sum&#233; automatique, mais sans noter un impact significatif. Cependant, selon nous, il s&#8217;agit d&#8217;une voie &#224; 
poursuivre et d&#8217;autres exp&#233;riences sont &#224; mener. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelles combinaisons de scores et de crit&#232;res num&#233;riques pour un syst&#232;me de QR ? 
</p>
<p>question, il existe une difficult&#233; suppl&#233;mentaire puisqu&#8217;il faut &#234;tre capable de retrouver depuis 
une forme interrogative, l&#8217;ordre de sa forme affirmative. Enfin, si l&#8217;ordre est effectivement 
l&#8217;un des points forts de l&#8217;expressivit&#233; associ&#233;e &#224; des patrons morphosyntaxiques il faut 
remarquer que le co&#251;t d&#8217;acquisition de ces patrons n&#8217;est pas minime (m&#234;me lorsque des 
techniques automatiques sont employ&#233;es). 
La connaissance d&#8217;un type de r&#233;ponse attendu est une information typiquement associ&#233;e &#224; un 
composant d&#8217;un syst&#232;me de Questions/R&#233;ponses, aussi n&#8217;appara&#238;t-elle pas pour des scores 
originellement issus de la recherche documentaire. De m&#234;me, la proximit&#233; des mots est une 
notion qui nous a paru particuli&#232;rement importante dans le cadre des sQR, et que nous avons 
souhait&#233; incorporer en priorit&#233; dans notre travail sur les scores. Cette proximit&#233; intervient 
&#233;galement dans le cas de patrons morphosyntaxiques. Il est possible de noter que dans le cas 
des patrons, cette proximit&#233; est particuli&#232;rement rigide, au contraire de celle envisag&#233;e dans 
nos calculs de compacit&#233; et de densit&#233;, ce qui peut &#224; la fois constituer un inconv&#233;nient ou un 
avantage selon le passage. En effet, un patron qui s&#233;lectionne une expression le fait avec une 
plus &#171; grande force &#187;, mais aussi avec un &#171; plus grand &#187; risque de passer &#224; cot&#233;, parfois &#224; 
cause de diff&#233;rences tr&#232;s faibles. Enfin, la proximit&#233; dans le cas de la densit&#233; est une proximit&#233; 
&#233;tendue &#224; la globalit&#233; du document, alors que, pour la compacit&#233;, il s&#8217;agit d&#8217;une proximit&#233; 
locale au passage. De notre point de vue les deux ont une importance. Il est plus facile de 
trouver une r&#233;ponse au sein d&#8217;un passage lorsque la formulation de ce passage est proche de 
celle de la question (i.e. emploie les mots de la question). Cependant, il est des cas, dans 
lesquels au moins un des mots de la question, pr&#233;sent dans le document, n&#8217;est plus r&#233;p&#233;t&#233; par 
la suite et n&#8217;appara&#238;t plus dans la fen&#234;tre d&#8217;un passage, alors que sa pr&#233;sence m&#233;rite d&#8217;&#234;tre 
prise en compte. Un exemple typique est le cas d&#8217;une question comportant une restriction sur 
un pays particulier, notamment dans un style de r&#233;daction journalistique : apr&#232;s un premier 
centrage th&#233;matique sur ce pays, il est probable que son nom ne soit plus r&#233;p&#233;t&#233; dans le reste 
du document. Enfin, la pr&#233;sence des mots de la question appara&#238;t comme un ingr&#233;dient 
&#233;vident de tous les scores envisag&#233;s. Ce n&#8217;est pas le cas de la notion de couverture, qui 
n&#8217;intervient que dans nos scores, et dans celui calcul&#233; par Lucene. Concernant les patrons 
morphosyntaxiques, ils capturent cette couverture d&#8217;une fa&#231;on d&#233;tourn&#233;e. D&#8217;autres crit&#232;res ont 
&#233;t&#233; explor&#233;s comme la variabilit&#233; des mots, au travers d&#8217;une racinisation ou d&#8217;une 
lemmatisation. 
</p>
<p> Sur les mots de la question (Q) 
 Fr&#233;quence Raret&#233; Ordre Proximit&#233;  Pr&#233;sence Couverture 
</p>
<p>Type de 
r&#233;ponse 
attendu 
</p>
<p>Mots communs     &#1;   
</p>
<p>Cosine &#1; &#1;   &#1;   
</p>
<p>Cosine+Okapi &#1; &#1;   &#1;   
</p>
<p>Lucene &#1; &#1;   &#1; &#1;  
</p>
<p>Densit&#233;    &#1;1 &#1; &#1; &#1; 
Compacit&#233; 
</p>
<p>positionnelle    &#1;
2
 
</p>
<p>&#1; &#1; &#1; 
</p>
<p>Patrons 
morphosyntaxiques   &#1; &#1;
</p>
<p>2
 
</p>
<p>&#1; &#1; &#1; 
</p>
<p>Tableau 1. Tableau crois&#233; des expressivit&#233;s de diff&#233;rentes m&#233;thodes de s&#233;lection d&#8217;un passage ou 
d&#8217;une r&#233;ponse en fonction de crit&#232;res int&#233;ressants &#224; capturer. (La proximit&#233; peut &#234;tre envisag&#233;e 
globalement2 &#224; un document ou localement1 &#224; un passage). 
</p>
<p>Remarque. Afin d&#8217;int&#233;grer des patrons morphosyntaxiques &#224; une combinaison telle celle qui 
sera envisag&#233;e, il est n&#233;cessaire d&#8217;affecter, &#224; chacun d&#8217;entre eux, une grandeur num&#233;rique 
r&#233;elle (il ne faut pas se limiter &#224; la d&#233;cision binaire &#171; le patron capture ou ne capture pas &#187; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. GILLARD, P. BELLOT, M. EL-B&#200;ZE 
</p>
<p>une expression). Des travaux tels que (Duclaye et al., 2003) et (Vidrequin et al., 2007) 
permettent cela en extrapolant une interpr&#233;tation du rappel et de la pr&#233;cision. D&#8217;autres crit&#232;res 
comme un crit&#232;re de redondance (correspondant au nombre d&#8217;occurrences o&#249; un patron 
parvient &#224; capturer une expression) pourrait aussi &#234;tre pris en compte. Cependant, et selon 
nous, il s&#8217;agit d&#8217;un crit&#232;re intervenant plut&#244;t lors d&#8217;une &#233;tape de v&#233;rification qu&#8217;&#224; celle 
d&#8217;extraction, d&#8217;autant que ce crit&#232;re peut aussi &#234;tre envisag&#233; dans le cas des autres approches. 
</p>
<p>2.1 Formulation de la combinaison 
En examinant le tableau 1, il ressort que l&#8217;expressivit&#233; de chacun des scores est diff&#233;rente. Ces 
diff&#233;rences peuvent (doivent) &#234;tre per&#231;ues comme susceptibles de d&#233;gager une 
compl&#233;mentarit&#233; des approches dont il est int&#233;ressant de tirer profit. Il s&#8217;agit justement de 
notre objectif principal : mettre en &#339;uvre une combinaison de ces scores afin de capturer au 
mieux les crit&#232;res envisag&#233;s (et peut &#234;tre d&#8217;autres moins &#233;vidents). L&#8217;interrogation que nous 
avons porte sur la mani&#232;re d&#8217;aboutir &#224; une fusion optimale. Ainsi, comme cela a &#233;t&#233; d&#233;j&#224; 
mentionn&#233;, ces scores proviennent de deux modules diff&#233;rents. Les premiers proviennent de 
celui en charge de la recherche de passage, les autres de celui en charge de l&#8217;extraction et de la 
s&#233;lection de la r&#233;ponse. Ce constat nous am&#232;ne &#224; envisager une combinaison de ces scores en 
tenant compte de leur provenance, et &#224; choisir une formulation de leur combinaison. 
Ainsi, consid&#233;rons Cosine et la compacit&#233; positionnelle. Elles apparaissent quasiment 
compl&#233;mentaires (orthogonales), il est raisonnable de penser que leur combinaison peut &#234;tre 
int&#233;ressante. Cette forme d&#8217;orthogonalit&#233; peut &#234;tre rapproch&#233;e d&#8217;une notion d&#8217;ind&#233;pendance, 
et faire penser &#224; percevoir celles-ci comme l&#8217;expression de probabilit&#233;s (cela m&#234;me si elles 
n&#8217;en sont &#233;videmment pas4). De plus, le calcul Cosine qui nous int&#233;resse accepte une valeur 
comprise entre 0 et 1. Concernant la compacit&#233;, si nous avons d&#233;j&#224; envisag&#233; de l&#8217;exprimer 
d&#8217;une mani&#232;re probabiliste (Gillard et al., 2007), la compacit&#233; positionnelle n&#8217;est pas 
l&#8217;expression d&#8217;une probabilit&#233;. Cependant, nous l&#8217;amenons par une normalisation dans ce 
m&#234;me intervalle de valeurs. Ainsi, il est possible d&#8217;envisager leur combinaison au travers d&#8217;un 
produit, justement dans le but de saisir cette ind&#233;pendance / orthogonalit&#233;, soit : 
</p>
<p> scoreFinal scorePassage scoreExtraction= &#215;  (1) 
Ou plut&#244;t, afin de s&#8217;affranchir des probl&#232;mes de cadrage de valeur d&#8217;un produit de facteurs 
inf&#233;rieurs &#224; un : 
</p>
<p> log( ) log( )= +scoreFinal scorePassage scoreExtraction  (2) 
Du point de vue exp&#233;rimental, lors d&#8217;EQueR, la combinaison retenue faisait &#233;galement 
intervenir un d&#233;compte de Mots Communs (MC), dans le but de favoriser encore plus le cas 
o&#249; le nombre de ces MC dans les passages &#233;tait optimal. Le score employ&#233; alors &#233;tait : 
</p>
<p> log( ) log( ) log(1 )scoreFinalAvecMC scorePassage scoreExtraction MC= + + +  (3) 
Dans les exp&#233;riences qui suivent, ces deux scores (2) et (3) sont envisag&#233;s, l&#8217;un &#233;tant une 
version avec d&#233;compte de mots communs (&#171; avec MC &#187;), l&#8217;autre sans (&#171; sans MC &#187;). Le score 
des passages sera tour &#224; tour, un score de densit&#233;, de Cosine, de Cosine+Okapi, ou issu de 
Lucene. Dans le tableau 2, est &#233;galement pr&#233;sent&#233;e une extraction sans aucune combinaison, 
soit depuis un d&#233;compte des mots communs, depuis un score de passage seul, ou depuis une 
compacit&#233; positionnelle, cela afin de v&#233;rifier le gain &#233;ventuel observ&#233; lors d&#8217;une combinaison. 
</p>
<p>                                                 
</p>
<p>4
 En effet, il n&#8217;existe pas de loi de probabilit&#233; avec une densit&#233; de probabilit&#233;, associ&#233;e &#224; ces scores, pas plus 
</p>
<p>que de param&#232;tres susceptibles de faire l&#8217;objet d&#8217;une proc&#233;dure d&#8217;apprentissage comme par exemple via 
l&#8217;estimateur du maximum de vraisemblance. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelles combinaisons de scores et de crit&#232;res num&#233;riques pour un syst&#232;me de QR ? 
</p>
<p>2.2 Exp&#233;rimentation de la combinaison 
Cette partie pr&#233;sente les r&#233;sultats obtenus en fin de cha&#238;ne par le syst&#232;me de QR aux 400 
questions factuelles d&#8217;EQueR. Notre objectif est d&#8217;examiner l&#8217;impact des deux combinaisons 
envisag&#233;es lors de nos participations &#224; EQueR et &#224; QA@CLEF-2006. La premi&#232;re repose sur 
un score de passage, un score de compacit&#233; et un d&#233;compte des mots communs (&#171; avec MC &#187;, 
b1/, comme lors de notre participation &#224; EQueR) ; la seconde est sans d&#233;compte des mots 
communs (&#171; sans MC &#187;, b2/, et correspond &#224; notre participation &#224; CLEF-2006). De plus, lors 
de ces campagnes nous avions fait le choix a priori de nous limiter &#224; des passages de trois 
phrases. Ces r&#233;sultats nous permettent d&#8217;examiner ce choix a posteriori. 
Les &#233;valuations sont obtenues au moyen d&#8217;une proc&#233;dure automatique reposant sur une 
r&#233;f&#233;rence que nous avons constitu&#233;e &#224; partir des r&#233;ponses des participants de la campagne. 
Deux d&#233;clinaisons, stricte et tol&#233;rante sont envisag&#233;es et constituent des bornes inf&#233;rieures et 
sup&#233;rieures. Par ailleurs, il est &#224; noter que, dans une autre exp&#233;rience, nous avons pu comparer 
les sorties obtenues depuis cette proc&#233;dure automatique avec celles faites par un &#233;valuateur 
humain et nous avons constat&#233; que les diff&#233;rences entre les jugements humains/automatiques 
apparaissaient acceptables et comprises entre -3,5% &#224; +1% suivant le type d&#8217;&#233;valuation. 
Les nombres pr&#233;sent&#233;s dans le tableau 2 (voir en fin d&#8217;article) sont le nombre de r&#233;ponses 
correctes pr&#233;cises (aussi dites &#171; exactes &#187;, en ce sens que la &#171; cha&#238;ne de caract&#232;res &#187; 
correspondante contient uniquement les informations utiles pour r&#233;pondre, sans oubli, ni 
ajout) trouv&#233;es suivant le type d&#8217;&#233;valuation (stricte ou tol&#233;rante) en consid&#233;rant la r&#233;ponse 
propos&#233;e par le syst&#232;me au premier rang pour chacune des questions factuelles de la campagne 
EQueR. Ce type d&#8217;&#233;valuation sur une unique r&#233;ponse autoris&#233;e par question correspond &#224; la 
d&#233;finition de l&#8217;&#233;valuation CLEF-2006 (il est &#224; noter que, lors d&#8217;EQueR, les cinq premiers 
rangs &#233;taient examin&#233;s, aussi le graphique 1, plus loin, pr&#233;sente-t-il des r&#233;sultats lorsque la 
r&#233;ponse peut &#234;tre trouv&#233;e parmi les cinq premi&#232;res pour un cas qui nous int&#233;resse 
particuli&#232;rement : celui des combinaisons entre les scores de passages et notre score 
d&#8217;extraction de compacit&#233;). 
Bilan du tableau 2 (voir en fin d&#8217;article). D&#8217;une mani&#232;re globale, on peut noter que les 
performances des combinaisons densit&#233; et compacit&#233; sont assez ind&#233;pendantes de la 
dimension des passages. Cela tend &#224; prouver que la compl&#233;mentarit&#233; des deux approches est 
moindre. Cela s&#8217;explique par le fait que les principes sous-jacents &#224; leur d&#233;finition sont 
identiques et reposent sur des notions de proximit&#233; (et peut-&#234;tre de sym&#233;trie, puisque la phrase 
int&#233;ressante du point de vue de la densit&#233; occupe la position centrale dans le passage). La 
compacit&#233; appara&#238;t comme un choix int&#233;ressant m&#234;me lorsqu&#8217;elle est employ&#233;e seule. Elle se 
situe d&#8217;ailleurs juste derri&#232;re les combinaisons scores de passages et compacit&#233; du point de 
vue des performances. Pour la compacit&#233; employ&#233;e hors d&#8217;une combinaison, les meilleurs 
r&#233;sultats sont obtenus depuis des passages de neuf phrases ([104..118]), lorsque les passages 
sont pr&#233;alablement filtr&#233;s par notre score de densit&#233;, et de trois phrases sinon ([102..118]). 
La meilleure combinaison est obtenue par l&#8217;emploi d&#8217;une combinaison entre Lucene et 
compacit&#233; pour des dimensions de passages d&#8217;une ou de cinq phrases (respectivement 
[121..135], [120..136]), ou compacit&#233; et Cosine sur trois phrases ([120..136]). Concernant la 
combinaison avec mots communs, notre souhait initial consistant &#224; favoriser les combinaisons 
avec un grand nombre de mots communs s&#8217;av&#232;re &#234;tre une mauvaise chose, au moins en l&#8217;&#233;tat : 
peut-&#234;tre manque-t-il des coefficients adapt&#233;s dans l&#8217;expression de la combinaison lin&#233;aire ? 
Enfin, nous avons constat&#233; qu&#8217;il existe une variabilit&#233; non n&#233;gligeable entre les diff&#233;rentes 
m&#233;thodes sur les questions r&#233;pondues (du point de vue des pertes et gains) et cela am&#232;ne &#224; 
supposer que ces exp&#233;rimentations peuvent donner lieu &#224; d&#8217;autres am&#233;liorations en fin de 
traitement : il doit &#234;tre possible de maximiser encore les gains tout en minimisant les pertes. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. GILLARD, P. BELLOT, M. EL-B&#200;ZE 
</p>
<p>Notre principal objectif sur la combinaison de scores appara&#238;t rempli : une combinaison entre 
un score de compacit&#233; et un score Lucene, ou Cosine, permet un gain d&#8217;environ +18% sur les 
meilleures autres configurations sans combinaison (qui proviennent par ailleurs de la 
compacit&#233; que nous avons d&#233;finie), cela si l&#8217;on observe la r&#233;ponse propos&#233;e au premier rang. 
</p>
<p> 
</p>
<p>Graphique 1. Nombre de r&#233;ponses pr&#233;cises correctes trouv&#233;es parmi les cinq premi&#232;res 
depuis des combinaisons entre diff&#233;rents scores de passages et score de compacit&#233; sur le jeu 
des 400 questions factuelles de la campagne EQueR (premier plan &#233;valuation stricte, second 
plan &#233;valuation tol&#233;rante. Note : ce graphique correspond &#224; la ligne &#171; sans MC &#187; (b2/) du tableau 2 
avec une r&#233;ponse correcte trouv&#233;e parmi les cinq premi&#232;res plut&#244;t qu&#8217;uniquement au premier rang). 
</p>
<p>Une autre interrogation qui apparaissait en filigrane concernait l&#8217;influence de la dimension des 
passages sur les performances de notre syst&#232;me. Il ne ressort pas une pr&#233;f&#233;rence nette 
lorsqu&#8217;une r&#233;ponse au premier rang est consid&#233;r&#233;e (soit les r&#233;sultats pr&#233;sent&#233;s dans le 
tableau 1). En revanche, l&#8217;examen du nombre de r&#233;ponses correctes trouv&#233;es parmi les cinq 
premi&#232;res (voir graphique 1) nous permet de mettre en &#233;vidence que notre choix a priori de se 
limiter &#224; un contexte de trois phrases correspond &#224; une configuration acceptable. En outre, 
cela permet &#233;galement de constater que la combinaison Cosine et compacit&#233; ou Lucene et 
compacit&#233; produit dans les cinq premiers rangs, l&#224; encore, les meilleurs r&#233;sultats. 
</p>
<p>3 Conclusion et perspectives 
Dans cet article, nous avons &#233;tudi&#233; une combinaison des scores intervenant dans la s&#233;lection 
de passages et l&#8217;extraction d&#8217;une r&#233;ponse. Notre objectif &#233;tait d&#8217;utiliser cette combinaison 
pour profiter pleinement de la compl&#233;mentarit&#233; des scores employ&#233;s. Nous avons notamment 
examin&#233; la compl&#233;mentarit&#233; entre le score de compacit&#233; positionnelle, que nous avons d&#233;fini 
pour la s&#233;lection et l&#8217;extraction d&#8217;une r&#233;ponse, avec des m&#233;thodes de recherche vectorielle 
conventionnelle ou notre score de densit&#233;. 
Comme attendu, nous avons pu constater un gain lorsqu&#8217;un score de passages et de compacit&#233; 
&#233;taient combin&#233;s. Nous avons mis en &#233;vidence que la meilleure compl&#233;mentarit&#233; s&#8217;obtenait 
depuis un score de passage provenant d&#8217;une similarit&#233; Cosine ou Lucene. Les am&#233;liorations de 
performances, par rapport &#224; notre score de compacit&#233; employ&#233; seul, sont d&#8217;environ +18% 
lorsque seulement la premi&#232;re r&#233;ponse est consid&#233;r&#233;e, et entre +10 et +15% lorsque les cinq 
premi&#232;res le sont. Ces hausses, d&#8217;au moins +10%, nous permettent de conclure, malgr&#233; les 
pr&#233;cautions &#224; prendre vis-&#224;-vis d&#8217;&#233;valuations automatiques en QR, que ces am&#233;liorations 
doivent &#234;tre effectives (et non li&#233;es &#224; des artefacts d&#8217;&#233;valuation lorsque cette derni&#232;re est 
r&#233;alis&#233;e par des patrons et identifiants de documents). Enfin, puisque les r&#233;sultats pr&#233;sent&#233;s ici 
sont ceux en fin de cha&#238;ne de traitement, nous avons pu mettre en &#233;vidence les bonnes 
performances de la compacit&#233; employ&#233;e seule, mais &#233;galement que sa combinaison avec le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Quelles combinaisons de scores et de crit&#232;res num&#233;riques pour un syst&#232;me de QR ? 
</p>
<p>score de densit&#233; &#233;tait relativement stable, ce qui s&#8217;explique par la grande similitude entre les 
deux approches. Parall&#232;lement, nous avons v&#233;rifi&#233; a posteriori qu&#8217;un d&#233;coupage en passages 
de trois phrases correspondait &#224; un optimum local pour notre syst&#232;me de Questions/R&#233;ponses, 
alors qu&#8217;il &#233;tait un compromis technique a priori. 
Une &#233;tude suppl&#233;mentaire int&#233;ressante &#224; mener serait d&#8217;&#233;tudier la distribution et les valeurs 
num&#233;riques engendr&#233;es par la combinaison propos&#233;e afin de mieux cerner les &#233;ventuels effets 
de bord li&#233;s &#224; ces valeurs num&#233;riques (cas d&#8217;&#233;galit&#233;, de &#171; d&#233;crochage &#187;, etc.). Les autres 
perspectives sont nombreuses : il reste &#224; d&#233;gager des crit&#232;res d&#233;pendants des grandes classes 
de questions ou m&#234;me, au niveau des questions elles-m&#234;mes (distribution des mots dans les 
passages, mise en &#233;vidence des mots avec les meilleures contributions num&#233;riques, etc.). Ces 
crit&#232;res, ou d&#8217;autres nouveaux scores, pourraient alors &#234;tre int&#233;gr&#233;s dans une combinaison 
telle que propos&#233;e. Par ailleurs, nous avons pu constater, lors de comparaisons deux-&#224;-deux, 
une rotation d&#8217;une quinzaine de r&#233;ponses qui sont trouv&#233;es ou sont perdues suivant les 
exp&#233;riences. Les crit&#232;res pour aller chercher ces r&#233;ponses sont &#224; d&#233;terminer. Enfin, comme la 
combinaison que nous avons test&#233;e est uniquement num&#233;rique, il pourrait &#234;tre opportun, avec 
un corpus ad&#233;quat, d&#8217;effectuer un apprentissage de coefficients pour maximiser les 
performances de cette combinaison et tenir compte des dynamiques peu visibles. 
Remerciements. Les auteurs tiennent &#224; remercier le Dr. Olivier Ferret pour sa lecture 
attentive de cet article ainsi que ses tr&#232;s utiles commentaires et suggestions. 
</p>
<p>R&#233;f&#233;rences 
AYACHE C., CHOUKRI K., GRAU B., (2005) Rapport de la Campagne EVALDA/EQueR Evaluation en 
Questions-R&#233;ponses http://www.technolangue.net/IMG/pdf/rapport_EQUER_1.2.pdf 
DUCLAYE F., COLLIN O., YVON F., (2003). Apprentissage Automatique de Paraphrases pour 
l&#8217;Am&#233;lioration d'un Syst&#232;me de Questions-R&#233;ponses. Actes de TALN 2003, 115-124. 
FERRET F., GRAU B., HURAULT-PLANTET M., ILLOUZ G., MONCEAUX L., ROBBA I., VILNAT A., (2002). 
Recherche de la r&#233;ponse fond&#233;e sur la reconnaissance du focus de la question. Actes de TALN, Nancy, 307-
316. 
GILLARD L., BELLOT P., EL-B&#200;ZE M., (2007). D'une compacit&#233; positionnelle &#224; une compacit&#233; probabiliste 
pour un syst&#232;me de Questions/R&#233;ponses. Actes de la 4i&#232;me COnf&#233;rence en Recherche d'Informations et 
Applications (CORIA) 2007, 28-30 mars 2007, Saint-Etienne (France), 271-286. 
GILLARD L., SITBON  L., BELLOT P., EL-B&#200;ZE M., (2005). Derni&#232;res &#233;volutions de SQuALIA, le syst&#232;me 
de Questions/R&#233;ponses du LIA. Dans R&#233;ponses &#224; des questions, Traitement Automatique des Langues 
(TAL), 2005, Herm&#232;s, Paris (France), volume 46, n&#176;3/2005, 41-70. 
LUHN H.P., (1958). The Automatic Creation of Literature Astracts. IBM Journal of Research and 
Development, Volume 2, Issue 2, avril 1958, 159 165. 
VIDREQUIN C., EL-B&#200;ZE M., TORRES-MORENO J.M., SCHNEIDER J.J., (2007). G&#233;n&#233;ration et enrichissement 
automatique de listes de patrons de phrases pour les moteurs de questions-r&#233;ponses. Actes des Cinqui&#232;mes 
journ&#233;es Extraction et Gestion des Connaissances (EGC&#8217;2007). Namur (Belgique). 23-26 janvier 2007. 
207-208. 
TELLEX S., KATZ B., LIN J., MARTON G., FERNANDES A., (2003). Quantitative Evaluation of Passage 
Retrieval Algorithms for Question Answering. Actes de The 26th Annual International ACM SIGIR 
Conference on Research and Development in Information Retrieval (SIGIR 2003), Toronto, Canada, 28 
juillet&#8211;1er ao&#251;t 2003, 41-47. 
VOORHEES E.M., HARMAN D., (2005) TREC Experiment and Evaluation Dans Information Retrieval. MIT 
Press 2005, chapitre 10.  233-257. 
WILKINSON W., J. ZOBEL J., SACKS-DAVIS R., (1996). Similarity measures for short queries. Actes de The 
4th Text Retrieval Conference (TREC-4). Gaithersburg, Maryland (USA). NIST special publication 500-
236 (novembre 1995), 1996. 277-286. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. GILLARD, P. BELLOT, M. EL-B&#200;ZE 
 
</p>
<p> Scores de passages mis en &#339;uvre 
 Densit&#233; Cosine Cosine+Okapi Lucene 
</p>
<p>&#201;valuation stricte tol&#233;rante stricte tol&#233;rante stricte tol&#233;rante stricte tol&#233;rante 
                 
</p>
<p>a/ Comparaisons entre d&#233;compte des mots communs et score de passage 
Mots communs 48 (1p) 43 (3p) 57 50 47 37 57 45 47 36 57 44 47 39 57 47 
</p>
<p>(MC) 41 (5p) 25 (9p) 47 32 29 15 41 31 29 16 41 32 30 15 42 30 
Scores de passages 66 50 74 54 64 48 77 55 71 48 84 61 75 48 87 64 
</p>
<p>(&#224; lire en colonne) 50 29 54 31 38 26 49 34 39 23 49 34 36 23 51 33 
Compacit&#233; 100 100 117 117 101 102 118 117 101 102 118 102 101 102 118 117 
</p>
<p> 102 104 118 118 98 89 119 116 98 89 119 120 98 89 119 119 
,                 b/ Comparaisons entre deux combinaisons impliquant des scores de passages et de compacit&#233;, avec ou sans d&#233;compte des mots communs (MC) 
</p>
<p>b1/ avec MC 96 86 104 95 98 81 109 95 97 80 108 93 98 85 109 101 
(formule 3 du 2.1) 85 82 94 91 84 65 100 95 79 64 95 90 86 69 102 98 
</p>
<p>b2/ sans MC 104 103 119 118 113 120 128 136 115 115 127 131 121 118 135 134 
(formule 2 du 2.1) 105 106 120 119 114 106 134 141 111 103 128 128 120 113 136 140 
</p>
<p>Tableau 2. Diverses comparaisons entre des m&#233;thodes &#171; s&#233;quentielles &#187; (a : d&#233;compte des mots communs, scores de passages et score de compacit&#233;) et deux 
combinaisons de ces m&#233;thodes (b) en vue d&#8217;une extraction et de la s&#233;lection d&#8217;une r&#233;ponse finale. Les passages dans lesquels a lieu l&#8217;extraction sont 
</p>
<p>constitu&#233;s d&#8217;une, trois, cinq ou neuf phrases (&#224; lire suivant le sens de lecture de gauche &#224; droite dans une m&#234;me case). Les nombres pr&#233;sent&#233;s correspondent 
au nombre de r&#233;ponses pr&#233;cises correctes &#224; une question factuelle au premier rang suivant la nature des &#233;valuations : strictes ou tol&#233;rantes. Les questions 
</p>
<p>consid&#233;r&#233;es sont les 400 questions factuelles de la campagne EQueR. 
Exemples de lecture : premier exemple : pour une s&#233;lection des passages depuis Lucene (derni&#232;re colonne), suivi d&#8217;une s&#233;lection des r&#233;ponses par un score de compacit&#233; (troisi&#232;me ligne) et 
</p>
<p>dans le cas d&#8217;une &#233;valuation stricte, soit les valeurs en gras et soulign&#233;es dans le tableau, le nombre de r&#233;ponses pr&#233;cises correctes trouv&#233;es au premier rang est de 101 si les passages de 
d&#233;part &#233;taient constitu&#233;s d&#8217;une seule phrase, 102 pour trois phrases, 98 pour cinq phrases, et 89 pour des passages de neuf phrases. 
</p>
<p>Deuxi&#232;me exemple : pour une s&#233;lection des passages depuis un score de passage Cosine+Okapi (pour les scores de Passages pr&#233;sent&#233;s en seconde ligne, la nature du score doit &#234;tre lu depuis 
le titre de la colonne seulement) suivi d&#8217;une s&#233;lection depuis une strat&#233;gie sur la premi&#232;re occurrence du type de r&#233;ponse compatible avec celui recherch&#233;, et dans le cas d&#8217;une &#233;valuation 
</p>
<p>tol&#233;rante, ce qui correspond aux (valeurs en gras et italique dans le tableau, le nombre de r&#233;ponses correctes trouv&#233;es au premier rang est de 84 si les passages de d&#233;part &#233;taient constitu&#233;s 
d&#8217;une seule phrase, 61 pour ceux de trois phrases, 49 pour ceux de cinq phrases, et 34 pour des passages de neuf phrases. 
Troisi&#232;me exemple (valeurs en gras simple dans le tableau) : pour une s&#233;lection des passages depuis un score de passage Cosine (deuxi&#232;me colonne), suivi d&#8217;une s&#233;lection des r&#233;ponses faisant 
</p>
<p>intervenir la combinaison entre un score de compacit&#233; et de passage (ligne b2/ &#171; sans MC &#187;) et dans le cas d&#8217;une &#233;valuation stricte, le nombre de r&#233;ponses correctes trouv&#233;es au premier rang 
est de 113 si les passages de d&#233;part &#233;taient constitu&#233;s d&#8217;une seule phrase, 120 pour ceux de trois phrases, 114 pour ceux de cinq phrases, et 106 pour les passages de neuf phrases. </p>

</div></div>
</body></html>