<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers l&#8217;&#233;valuation de syst&#232;mes de dialogue homme-machine : de l&#8217;oral au multimodal</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9-13 juin 2008 
</p>
<p>Vers l&#8217;&#233;valuation de syst&#232;mes de dialogue homme-machine : 
de l&#8217;oral au multimodal 
</p>
<p>Fr&#233;d&#233;ric Landragin 
</p>
<p>CNRS &#8211; Laboratoire LaTTICe (UMR 8094) 
1 rue Maurice Arnoux &#8211; 92120 Montrouge 
</p>
<p>frederic.landragin@linguist.jussieu.fr 
</p>
<p>R&#233;sum&#233; L&#8217;&#233;valuation pour le dialogue homme-machine ne se caract&#233;rise pas par 
l&#8217;efficacit&#233;, l&#8217;objectivit&#233; et le consensus que l&#8217;on observe dans d&#8217;autres domaines du 
traitement automatique des langues. Les syst&#232;mes de dialogue oraux et multimodaux restent 
cantonn&#233;s &#224; des domaines applicatifs restreints, ce qui rend difficiles les &#233;valuations 
comparatives ou norm&#233;es. De plus, les avanc&#233;es technologiques constantes rendent vite 
obsol&#232;tes les paradigmes d&#8217;&#233;valuation et ont pour cons&#233;quence une multiplication de ceux-ci. 
Des solutions restent ainsi &#224; trouver pour am&#233;liorer les m&#233;thodes existantes et permettre des 
diagnostics plus automatis&#233;s des syst&#232;mes. Cet article se veut un ensemble de r&#233;flexions 
autour de l&#8217;&#233;valuation de la multimodalit&#233; dans les syst&#232;mes &#224; forte composante linguistique. 
Des extensions des paradigmes existants sont propos&#233;es, en particulier DQR/DCR, sachant 
que certains sont mieux adapt&#233;s que d&#8217;autres au dialogue multimodal. Des conclusions et 
perspectives sont tir&#233;es sur l&#8217;avenir de l&#8217;&#233;valuation pour le dialogue homme-machine. 
</p>
<p>Abstract Evaluating human-machine dialogue systems is not so efficient, objective, and 
consensual than evaluating other natural language processing systems. Oral and multimodal 
dialogue systems are still working within reduced applicative domains. Comparative and 
normative evaluations are then difficult. Moreover, the continuous technological progress 
makes obsolete and numerous the evaluating paradigms. Some solutions are still to be 
identified to improve existing methods and to allow a more automatic diagnosis of systems. 
The aim of this paper is to provide a set of remarks dealing with the evaluation of multimodal 
spoken language dialogue systems. Some extensions of existing paradigms are presented, in 
particular DQR/DCR, considering that some paradigms fit better multimodal issues than 
others. Some conclusions and perspectives are then drawn on the future of the evaluation of 
human-machine dialogue systems. 
</p>
<p>Mots-cl&#233;s :   Dialogue finalis&#233;, multimodalit&#233;, &#233;valuation pour le dialogue homme-
machine, paradigme d&#8217;&#233;valuation, test utilisateur, diagnostic, paraphrase multimodale 
Keywords:   Task-driven dialogue, multimodality, evaluating human-machine dialogue, 
evaluation paradigm, user test, diagnosis 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>1 Introduction 
La communaut&#233; internationale voit para&#238;tre un nombre grandissant d&#8217;articles sur l&#8217;&#233;valuation 
des syst&#232;mes de dialogue oraux et multimodaux. Outre les livres de r&#233;f&#233;rence en dialogue 
homme-machine qui incluent d&#233;sormais syst&#233;matiquement un chapitre sur l&#8217;&#233;valuation 
(Gibbon et al., 2000 ; puis L&#243;pez-C&#243;zar, Araki, 2005), on trouve un grand nombre de 
propositions cibl&#233;es sur le dialogue oral ou sur une modalit&#233; particuli&#232;re d&#8217;un syst&#232;me 
multimodal. Des paradigmes d&#8217;&#233;valuation sont propos&#233;s, de plus en plus larges et complexes, 
regroupant entre autres des ensembles de m&#233;triques, des tests utilisateurs et des m&#233;thodes 
d&#8217;analyse de questionnaires remplis par des sujets apr&#232;s leur utilisation du syst&#232;me &#224; &#233;valuer. 
Dans la communaut&#233; fran&#231;aise, les propositions se cantonnent pour le moment &#224; l&#8217;oral ou &#224; 
certains aspects du dialogue multimodal comme le comportement d&#8217;agents anim&#233;s, et il n&#8217;y a 
pas encore de chapitre sur l&#8217;&#233;valuation de la multimodalit&#233; dans des ouvrages tels que 
(Chaudiron, 2004) ou (Caelen, Xuereb, 2007). Ces efforts sont pertinents et louables, mais ne 
doivent pas faire oublier plusieurs constats r&#233;currents qui restent particuli&#232;rement valables. 
</p>
<p>Premier constat : contrairement aux syst&#232;mes de recherche d&#8217;information, de reconnaissance 
de la parole ou d&#8217;analyse syntaxique, les syst&#232;mes de dialogue homme-machine restent 
toujours au niveau de prototypes de recherche difficiles &#224; r&#233;aliser et &#224; faire fonctionner, ainsi 
que tr&#232;s sensibles au comportement des utilisateurs. A part quelques exemples marginaux, 
ludiques par exemple, il n&#8217;existe &#224; l&#8217;heure actuelle aucun syst&#232;me fiable commercialis&#233; et 
utilis&#233; de mani&#232;re profitable par une population de taille importante. Autrement dit, le passage 
&#224; l&#8217;&#233;chelle reste un probl&#232;me majeur en dialogue homme-machine et les &#233;valuations r&#233;alis&#233;es 
s&#8217;en tiennent &#224; des prototypes de recherche ou &#224; des syst&#232;mes professionnels tellement 
finalis&#233;s (militaires par exemple) qu&#8217;ils ne s&#8217;adressent qu&#8217;&#224; un nombre extr&#234;mement r&#233;duit 
d&#8217;utilisateurs. Ce qui est valable pour les syst&#232;mes oraux l&#8217;est encore plus pour les syst&#232;mes 
multimodaux. L&#8217;&#233;valuation pour le dialogue homme-machine se cantonne donc &#224; un p&#233;rim&#232;tre 
limit&#233; qui, sans remettre en cause son utilit&#233;, nuance quelque peu sa port&#233;e. 
</p>
<p>Deuxi&#232;me constat : il risque d&#8217;exister bient&#244;t autant de m&#233;thodologies d&#8217;&#233;valuation que de 
syst&#232;mes proprement dits. Ce n&#8217;est pas un probl&#232;me en soi, mais cela soul&#232;ve des 
interrogations. En particulier, on peut s&#8217;interroger sur le bien-fond&#233; d&#8217;une m&#233;thode 
d&#8217;&#233;valuation propos&#233;e par les concepteurs d&#8217;un syst&#232;me dans le but d&#8217;&#233;valuer ce seul syst&#232;me, 
la m&#233;thode &#233;tant elle-m&#234;me &#233;valu&#233;e par son application au syst&#232;me en question. Cette 
description peut sembler caricaturale, elle refl&#232;te pourtant une certaine r&#233;alit&#233;, ou en tout cas 
elle s&#8217;en approche. Cette situation est tout &#224; fait normale et in&#233;vitable, compte tenu du nombre 
r&#233;duit de syst&#232;mes et, face aux avanc&#233;es de chaque syst&#232;me, de la n&#233;cessit&#233; de prendre en 
compte des aspects qui ne sont pas trait&#233;s par les m&#233;thodologies d&#8217;&#233;valuation existantes. 
Ainsi, on en vient &#224; proposer ou &#224; &#233;tendre une m&#233;thodologie d&#8217;&#233;valuation en vue de pouvoir 
&#233;valuer les avanc&#233;es d&#8217;un nouveau syst&#232;me. Les avanc&#233;es technologiques rapides ne font 
qu&#8217;augmenter ce ph&#233;nom&#232;ne. L&#8217;&#233;valuation pour le dialogue homme-machine semble ainsi 
perp&#233;tuellement en retard par rapport &#224; son objectif. 
Troisi&#232;me constat : l&#8217;&#233;valuation sert non seulement &#224; am&#233;liorer le d&#233;veloppement d&#8217;un 
syst&#232;me particulier (en passant par des mesures, des diagnostics et des questionnaires de 
satisfaction), mais aussi &#224; comparer des syst&#232;mes les uns par rapport aux autres. Plusieurs 
campagnes ont &#233;t&#233; lanc&#233;es, et ce qu&#8217;il en ressort finalement, c&#8217;est qu&#8217;il est tr&#232;s difficile de 
comparer plusieurs syst&#232;mes de dialogue, m&#234;me s&#8217;ils ont &#233;t&#233; r&#233;alis&#233;s pour des contextes 
applicatifs comparables, par exemple le renseignement ferroviaire ou h&#244;telier pour ne citer 
que ces deux applications largement exploit&#233;es. Pour cet aspect, le domaine du dialogue </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers l&#8217;&#233;valuation des syst&#232;mes de dialogue multimodaux 
</p>
<p>homme-machine semble poser un probl&#232;me plus d&#233;licat que les autres domaines du TAL, et 
contribue &#224; l&#8217;image de fragilit&#233; attach&#233;e &#224; son &#233;valuation. 
</p>
<p>Face &#224; ces constats, on peut s&#8217;interroger sur la faisabilit&#233; de l&#8217;&#233;valuation pour le dialogue 
homme-machine. Dans ce but, la section 2 passera en revue les principaux probl&#232;mes et 
quelques m&#233;thodologies qui nous semblent prometteuses. La question de la faisabilit&#233; nous 
semble constituer un probl&#232;me de fond qui n&#8217;est pas assez discut&#233; et pour lequel nous 
essaierons d&#8217;apporter quelques pistes de r&#233;flexion. Les critiques que nous venons de porter 
avec les constats pr&#233;c&#233;dents ne nous emp&#234;cheront pas, dans un second temps, de proposer des 
pistes pour une meilleure prise en compte de la multimodalit&#233; dans des paradigmes existants. 
La section 3 s&#8217;attachera ainsi &#224; faire un point sur les possibilit&#233;s d&#8217;extension &#224; la 
multimodalit&#233; des m&#233;thodologies pr&#233;vues pour l&#8217;oral, en particulier les m&#233;thodes DQR et 
DCR, et sur la prise en compte de ph&#233;nom&#232;nes pour l&#8217;instant ignor&#233;s dans les m&#233;thodologies 
d&#233;j&#224; pr&#233;vues pour la multimodalit&#233;. A d&#233;faut d&#8217;&#233;valuer nos propositions sur des syst&#232;mes 
existants ou sur de nouveaux syst&#232;mes (c&#8217;est l&#8217;une des perspectives de ce travail), nous les 
expliciterons sur des exemples typiques tels que le classique &#171; mets &#231;a ici &#187; (Bolt, 1980). 
</p>
<p>2 M&#233;thodologies existantes 
Dans le contexte du dialogue homme-machine oral, beaucoup de m&#233;thodologies ont &#233;t&#233; 
propos&#233;es (Antoine, Caelen, 1999 ; Bonneau-Maynard et al., 2006 ; Devillers et al., 2004 ; 
Dybkj&#230;r et al., 1998 ; Eckert et al., 1998 ; Litman, Pan, 1999 ; M&#246;ller et al., 2007). Elles 
constituent une sorte de cadre de r&#233;f&#233;rence comprenant des recommandations pour mettre en 
&#339;uvre des tests d&#8217;interaction avec des utilisateurs, des m&#233;thodes pour analyser 
automatiquement ou semi-automatiquement les traces d&#8217;interaction obtenues, des rep&#232;res pour 
d&#233;terminer des m&#233;triques d&#8217;&#233;valuation, ou encore des principes pour constituer et analyser des 
questionnaires remplis a posteriori par les utilisateurs. Chaque &#233;valuateur peut ainsi piocher 
dans ce stock pour d&#233;terminer la ou les m&#233;thodes qu&#8217;il va appliquer. En fait, un seul test 
semble insuffisant et une v&#233;ritable &#233;valuation semble devoir grouper plusieurs types de test. 
Les campagnes d&#8217;&#233;valuation (EVALDA/MEDIA), les groupes de travail (groupe MADCOW, 
groupe &#171; compr&#233;hension de parole &#187; du GdR I3) et les divers consortiums de projets 
europ&#233;ens exploitent largement ce principe. Lorsque plusieurs syst&#232;mes sont en jeu et que 
l&#8217;&#233;valuation est comparative, des r&#232;gles de fonctionnement peuvent &#234;tre d&#233;finies de mani&#232;re &#224; 
mieux contr&#244;ler la qualit&#233; de l&#8217;&#233;valuation. La campagne d&#8217;&#233;valuation par d&#233;fi avec sa gestion 
crois&#233;e des r&#244;les des concepteurs des syst&#232;mes en jeu (Antoine, 2003) en est un exemple. 
Les principales propositions de m&#233;thodologie s&#8217;accompagnent chacune d&#8217;une id&#233;e originale 
qui vient simplifier la mise en &#339;uvre d&#8217;un type de test en lui apportant un moyen d&#8217;&#234;tre 
op&#233;rationnalis&#233; dans un contexte d&#233;termin&#233;. Le paradigme du groupe MADCOW (Hirschman, 
1992) apporte ainsi la notion de gabarit qui caract&#233;rise les solutions minimales et maximales &#224; 
une requ&#234;te et rend ainsi son &#233;valuation plus rigoureuse. Le paradigme PARADISE &#8211; 
PARAdigm for DIalogue System Evaluation (Walker et al., 2001) se focalise sur la 
maximisation de la satisfaction de l&#8217;utilisateur et propose de prendre la satisfaction de la t&#226;che 
comme r&#233;f&#233;rence. Autre exemple d&#8217;id&#233;e originale, (L&#243;pez-C&#243;zar et al., 2003) propose 
d&#8217;&#233;valuer un syst&#232;me en g&#233;n&#233;rant automatiquement des &#233;nonc&#233;s utilisateurs de test, c&#8217;est-&#224;-
dire en mod&#233;lisant le comportement de l&#8217;utilisateur, y compris ses erreurs. En France, la 
m&#233;thodologie DQR &#8211; Donn&#233;e&#8211;Question&#8211;R&#233;ponse (Zeiliger et al., 1997) introduit le principe 
de questionner le syst&#232;me sur le point &#224; &#233;valuer, avec l&#8217;avantage de d&#233;placer ainsi l&#8217;objet de 
l&#8217;&#233;valuation de la donn&#233;e vers la question, et donc ni sur les r&#233;ponses ou r&#233;actions du syst&#232;me 
(m&#233;thode &#171; bo&#238;te noire &#187;, qui ne n&#233;cessite pas d&#8217;explorer les structures internes au syst&#232;me, 
mais qui manque de pr&#233;cision), ni sur les structures s&#233;mantiques du syst&#232;me (m&#233;thode &#171; bo&#238;te </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>transparente &#187;, pr&#233;cise et conduisant facilement &#224; un diagnostic, mais qui n&#233;cessite de disposer 
de repr&#233;sentations s&#233;mantiques de r&#233;f&#233;rence). Encore faut-il que le syst&#232;me soit capable de 
r&#233;pondre aux questions Q de DQR. Le paradigme adapt&#233; DCR &#8211; Demande&#8211;Contr&#244;le&#8211;
R&#233;ponse/R&#233;sultat/R&#233;f&#233;rence (Antoine, Caelen, 1999) minimise ce probl&#232;me en rempla&#231;ant la 
question par un contr&#244;le qui est une simplification ou une reformulation de la demande 
utilisateur initiale. Pour sa part, le paradigme PEACE &#8211; Paradigme d&#8217;Evaluation Automatique 
de ComprEhension (Devillers et al., 2002) apporte l&#8217;id&#233;e originale de mod&#233;liser l&#8217;historique 
du dialogue par une paraphrase, ce qui permet de rester dans le mode &#171; bo&#238;te noire &#187; tout en 
permettant une &#233;valuation de la compr&#233;hension en contexte. 
</p>
<p>Dans le contexte du dialogue homme-machine multimodal, les propositions sont loin d&#8217;&#234;tre 
aussi pertinentes. Le paradigme PROMISE &#8211; PROcedure for Multimodal Interactive System 
Evaluation (Beringer et al., 2002) est pr&#233;sent&#233; comme une extension de PARADISE &#224; la 
multimodalit&#233;, avec des principes pour affecter des scores aux entr&#233;es et sorties multimodales. 
La proposition reste en fait &#224; un niveau tr&#232;s approximatif, bien en de&#231;&#224; de la vari&#233;t&#233; des 
ph&#233;nom&#232;nes multimodaux. Les aspects int&#233;ressants de l&#8217;article concernent le dialogue oral, 
avec des consid&#233;rations sur le niveau de compl&#233;tude de la t&#226;che et le niveau de coop&#233;ration de 
l&#8217;utilisateur. Les travaux de Bernsen et Dybkj&#230;r, qui font pourtant r&#233;f&#233;rence dans le milieu du 
dialogue multimodal, sont plut&#244;t d&#233;cevants en ce qui concerne l&#8217;&#233;valuation. (Bernsen, 
Dybkj&#230;r, 2004) pr&#233;sente ainsi une m&#233;thodologie pr&#233;vue pour un syst&#232;me, avec une 
focalisation sur la m&#233;thode du questionnaire rempli a posteriori par les utilisateurs (la raison 
donn&#233;e est d&#8217;ailleurs que les autres m&#233;thodes ne sont pas encore bien &#233;tablies). 
Malheureusement, les questions du questionnaire restent &#224; un niveau tr&#232;s superficiel pour ce 
qui concerne la multimodalit&#233; : &#171; avez-vous utilis&#233; la souris ou avez-vous point&#233; sur 
l&#8217;&#233;cran ? &#187;, &#171; quelles &#233;taient vos impressions en produisant un geste ? &#187;, et &#171; auriez-vous aim&#233; 
en faire plus avec le geste ? si oui, pour faire quoi ? &#187;. Les r&#233;ponses qui ont &#233;t&#233; fournies par 
les utilisateurs semblent &#233;galement tr&#232;s pauvres, d&#8217;autant plus qu&#8217;une des conclusions des 
auteurs est que les utilisateurs ont pr&#233;f&#233;r&#233; parler plut&#244;t qu&#8217;exploiter les possibilit&#233;s 
multimodales&#8230; Pour sa part, (Dybkj&#230;r et al., 2004) est plus une revue de m&#233;thodologies et de 
projets qu&#8217;une proposition de nouvelle m&#233;thodologie pour la multimodalit&#233; : le propos reste 
au niveau de recommandations tr&#232;s g&#233;n&#233;rales. Par ailleurs, une des remarques finales de 
l&#8217;article rejoint notre point de vue : &#171; The field is moving rapidly beyond the standard task-
oriented, speech-only SLDS [Spoken Language Dialogue System] towards multimodal 
SLDSs, mobile systems, situation-aware systems, location-aware systems, internet access 
systems, educational systems, entertainment systems, etc. In fact, technology development 
may appear to speed further ahead of the knowledge we already have on evaluation, usability 
and standards, increasing the proportion of what we do not know compared with what we do 
know. &#187;. Dans un autre registre, (Vuurpijl et al., 2004) pr&#233;sente un outil, appel&#233; &#171; &#181;eval &#187;, 
pour la transcription des donn&#233;es multimodales et l&#8217;&#233;valuation d&#8217;un syst&#232;me. Or l&#8217;&#233;valuation 
ne concerne que les tours de dialogue et ne traite pas les ph&#233;nom&#232;nes multimodaux. Enfin, 
(Walker et al., 2004), malgr&#233; son titre, se focalise sur les mod&#232;les utilisateur et les strat&#233;gies 
de dialogue (oral) mais quasiment pas sur les aspects multimodaux. D&#8217;une mani&#232;re g&#233;n&#233;rale 
pour l&#8217;&#233;valuation des syst&#232;mes multimodaux, on ne retrouve donc pas les principes appliqu&#233;s 
dans les campagnes d&#8217;&#233;valuation des syst&#232;mes oraux. C&#8217;est ce que nous allons contribuer &#224; 
faire en nous focalisant sur les m&#233;thodologies qui nous semblent les plus prometteuses. 
</p>
<p>3 Extension au dialogue multimodal 
(Zeiliger et al., 2000) ont retenu une m&#233;thodologie de type &#171; bo&#238;te noire &#187; permettant de faire 
un diagnostic du syst&#232;me, m&#233;thodologie qui repose sur des tests g&#233;n&#233;riques pour l&#8217;&#233;valuation 
de la compr&#233;hension d&#8217;un &#233;nonc&#233; isol&#233;. Les aspects contextuels ont &#233;t&#233; n&#233;glig&#233;s (nous y </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers l&#8217;&#233;valuation des syst&#232;mes de dialogue multimodaux 
</p>
<p>reviendrons avec PEACE), mais c&#8217;&#233;tait le prix &#224; payer pour obtenir une m&#233;thodologie simple 
et bien d&#233;limit&#233;e. Le principe est de proc&#233;der &#224; des &#233;valuations ponctuelles, chacune d&#8217;entre 
elles &#233;tant centr&#233;e sur un ph&#233;nom&#232;ne particulier. Ainsi, dans la mat&#233;rialisation DQR, 
l&#8217;&#233;valuation ponctuelle prend la forme d&#8217;une question Q adress&#233;e au syst&#232;me et permet de 
v&#233;rifier sa bonne compr&#233;hension de la demande initiale D. Un des exemples donn&#233;s concerne 
la r&#233;solution des anaphores, avec la demande, la question et la r&#233;ponse suivantes : 
</p>
<p>&#8226; D = &#171; Vous prenez la rue &#224; droite et vous la suivez sur 300 m&#232;tres &#187; (&#233;nonc&#233; initial, 
tel qu&#8217;il a &#233;t&#233; adress&#233; au syst&#232;me dans le but de faire avancer la t&#226;che) ; 
</p>
<p>&#8226; Q = &#171; Suivre rue &#224; droite ? &#187; (question adress&#233;e au syst&#232;me juste apr&#232;s l&#8217;&#233;nonc&#233; D et 
destin&#233;e &#224; &#233;valuer la bonne compr&#233;hension de D) ; 
</p>
<p>&#8226; R = &#171; oui &#187; (r&#233;ponse du syst&#232;me montrant que l&#8217;anaphore a &#233;t&#233; bien comprise et 
rendant l&#8217;&#233;valuation positive). 
</p>
<p>Les auteurs sp&#233;cifient sept niveaux caract&#233;risant la port&#233;e des questions pos&#233;es. Nous allons 
reprendre ces niveaux en indiquant &#224; chaque fois comment &#233;tendre le paradigme pour pouvoir 
l&#8217;exploiter en dialogue multimodal. 
</p>
<p>3.1 DQR multimodal 
Niveau 1 = &#171; information explicite &#187;. Il s&#8217;agit du rep&#233;rage d&#8217;une information explicit&#233;e dans 
l&#8217;&#233;nonc&#233;, l&#8217;int&#233;r&#234;t &#233;tant de tester la bonne compr&#233;hension de l&#8217;&#233;nonc&#233; litt&#233;ral compte tenu de 
la grande variabilit&#233; du langage spontan&#233;. Les exemples donn&#233;s par les auteurs se contentent 
de reprendre une partie de l&#8217;&#233;nonc&#233; et de demander une confirmation de la compr&#233;hension de 
cette partie : D = &#171; vous prenez &#224; droite apr&#232;s les b&#226;timents blancs aux volets bleus &#187; puis 
Q = &#171; volets blancs ? &#187; ou &#171; volets bleus ? &#187;. L&#8217;extension de ce principe &#224; la multimodalit&#233; 
consiste &#224; poser des questions sur les &#233;l&#233;ments de l&#8217;&#233;nonc&#233; multimodal. Avec D = &#171; mets &#231;a 
ici &#187; + geste en (x1, y1) + geste en (x2, y2), on peut tester les capacit&#233;s de capture de la 
multimodalit&#233; en posant les questions Q suivantes : &#171; &#231;a ? &#187; + geste en (x1, y1) ; &#171; mettre 
ici ? &#187; + geste en (x2, y2) ; &#171; mettre &#231;a ? &#187; + geste en (x2, y2) ; &#171; mettre &#231;a ici &#187; + geste en (x2, 
y2) + geste en (x1, y1) ; etc. La proc&#233;dure peut sembler na&#239;ve, mais elle permet de tester de 
mani&#232;re tr&#232;s simple le bon appariement des gestes avec les expressions r&#233;f&#233;rentielles, ce qui 
constitue un processus non n&#233;gligeable de la fusion multimodale. Une attention particuli&#232;re 
sera donn&#233;e &#224; la synchronisation temporelle entre les mots prononc&#233;s et les gestes produits. 
Ainsi, un d&#233;calage temporel entre &#171; &#231;a &#187; et le geste dans la question Q pourra conduire selon 
le syst&#232;me &#224; une r&#233;ponse positive refl&#233;tant sa robustesse pour l&#8217;appariement multimodal 
m&#234;me quand les conditions de production sont d&#233;viantes, ou au contraire &#224; une r&#233;ponse 
n&#233;gative refl&#233;tant l&#8217;incapacit&#233; du syst&#232;me &#224; sortir d&#8217;un certain intervalle temporel. 
</p>
<p>Niveau 2 = &#171; information implicite &#187;. Ce niveau concerne la r&#233;solution des anaphores, des 
ellipses, des incompl&#233;tudes et autres informations implicites mais r&#233;cup&#233;rables aux niveaux 
syntaxique et s&#233;mantique. Un exemple fait intervenir : D = &#171; donnez-moi un billet pour Paris 
et aussi pour Lyon &#187; et Q = &#171; billet pour Lyon ? &#187;. La r&#233;solution de la r&#233;f&#233;rence &#233;tant l&#8217;un des 
principaux aspects de la multimodalit&#233; spontan&#233;e, un DQR multimodal devra bien entendu en 
rendre compte. Ainsi, en reprenant comme D la primitive universelle de la multimodalit&#233;, 
&#171; mets &#231;a ici &#187; avec deux gestes de d&#233;signation, les questions Q pourront introduire des 
pr&#233;cisions sur les r&#233;f&#233;rents, en partant par exemple de la mention de leur cat&#233;gorie et en allant 
jusqu&#8217;&#224; donner leur identifiant unique tel qu&#8217;il est g&#233;r&#233; par le syst&#232;me : &#171; mettre cet objet ? &#187; + 
geste en (x1, y1) ; &#171; mettre ce fichier ? &#187; + geste en (x1, y1) ; &#171; mettre &#8216;submis.tex&#8217; ? &#187; (sans </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>geste) ; &#171; mettre obj4353 ? &#187; (sans geste) ; etc. La proc&#233;dure d&#8217;&#233;valuation inclut donc la 
paraphrase en langage naturel d&#8217;une r&#233;f&#233;rence multimodale. Ce qui reste simple pour le geste 
d&#233;ictique l&#8217;est beaucoup moins pour les autres types de gestes co-verbaux. Imaginons par 
exemple que &#171; mets &#231;a ici &#187;, ou plut&#244;t &#171; d&#233;place &#231;a ici &#187; pour ne pas trop compliquer 
l&#8217;exemple1, s&#8217;accompagne d&#8217;un seul geste qui part de l&#8217;objet &#224; d&#233;placer et aboutit au lieu de 
destination. Selon une premi&#232;re hypoth&#232;se, cette trajectoire gestuelle est consid&#233;r&#233;e comme la 
mat&#233;rialisation de la n&#233;cessaire transition entre la d&#233;signation d&#8217;objet et la d&#233;signation de lieu. 
Dans ce cas, seules les extr&#233;mit&#233;s de la courbe sont utilis&#233;es lors des analyses s&#233;mantiques : le 
point (x1, y1) puis l&#8217;objet pr&#233;sent en ce point ou dans un voisinage imm&#233;diat sont unifi&#233;s avec 
&#171; &#231;a &#187;, et le point (x2, y2) est unifi&#233; avec &#171; ici &#187;. Autrement dit on revient au cas pr&#233;c&#233;dent. 
Selon une seconde hypoth&#232;se, la trajectoire est consid&#233;r&#233;e comme la combinaison de ces deux 
d&#233;signations avec un geste co-verbal illustratif apportant une caract&#233;ristique de l&#8217;action de 
d&#233;placement, &#224; savoir le chemin (ou points de passage) &#224; suivre. La trajectoire est alors 
analys&#233;e d&#8217;un point de vue temporel (courbe produite de mani&#232;re r&#233;guli&#232;re, sans point d&#8217;arr&#234;t 
significatif) et d&#8217;un point de vue structurel (arc de cercle), avant d&#8217;&#234;tre unifi&#233;e &#224; &#171; d&#233;place &#187;, 
c&#8217;est-&#224;-dire d&#8217;&#234;tre interpr&#233;t&#233;e comme un chemin de d&#233;placement. Si l&#8217;on veut tester cette 
fonctionnalit&#233; du syst&#232;me multimodal, il suffit de poser une question Q suppl&#233;mentaire : 
&#171; suivre cette trajectoire ? &#187; ou &#171; d&#233;placer selon ces points de passage ? &#187;, en reprenant dans 
un cas comme dans l&#8217;autre le geste complet. Le seul inconv&#233;nient reste celui qui est valable 
pour l&#8217;ensemble de la m&#233;thodologie DQR, &#224; savoir la n&#233;cessit&#233; pour le syst&#232;me de traiter de 
telles questions. 
</p>
<p>Niveau 3 = &#171; inf&#233;rence &#187;. Il s&#8217;agit ici de la construction du sens complet de l&#8217;&#233;nonc&#233;, la 
difficult&#233; &#233;tant l&#8217;identification des sous-entendus, identification qui fait appel &#224; des 
raisonnements de sens commun et &#224; des inf&#233;rences pragmatiques. Avec D : &#171; je voudrais un 
aller-retour pour Paris &#187;, les auteurs proposent Q : &#171; vouloir billet ? &#187;. Cet aspect est 
ind&#233;pendant des modalit&#233;s, et reste valable dans l&#8217;&#233;tat pour le dialogue multimodal. M&#234;me si 
des inf&#233;rences peuvent &#234;tre identifi&#233;es lors de l&#8217;utilisation cons&#233;cutive de plusieurs gestes, il 
est vrai que ce niveau concerne surtout la langue orale. 
</p>
<p>Niveau 4 = &#171; interpr&#233;tation du type d&#8217;acte illocutoire &#187;. On entre ici dans les niveaux de 
dialogue, avec un premier aspect concernant les actes de langage et la capacit&#233; du syst&#232;me &#224; 
identifier le bon type d&#8217;acte, m&#234;me en cas d&#8217;acte de langage indirect. Avec D : &#171; un billet pour 
Paris &#187;, qui peut faire suite &#224; une question ou qui peut correspondre &#224; une demande initiale, la 
question Q : &#171; est-ce une demande ? &#187; permet d&#8217;&#233;valuer l&#8217;acte identifi&#233; par le syst&#232;me. Il est 
n&#233;cessaire ici de distinguer deux types de dialogue multimodal. Dans le premier type, les 
gestes et les autres modalit&#233;s de communication restent co-verbaux, c&#8217;est-&#224;-dire que 
l&#8217;information qu&#8217;ils apportent s&#8217;ajoute &#224; celle port&#233;e par l&#8217;&#233;nonc&#233; en langage naturel, et l&#8217;acte 
de langage de l&#8217;&#233;nonc&#233; multimodal est celui de l&#8217;&#233;nonc&#233; oral. C&#8217;est le cas des exemples 
&#233;tudi&#233;s jusqu&#8217;&#224; pr&#233;sent avec &#171; mets &#231;a ici &#187; et &#171; d&#233;place &#231;a ici &#187;. Un autre type de dialogue 
multimodal autorise des gestes quasi-linguistiques ou, d&#8217;une mani&#232;re g&#233;n&#233;rale, un message 
effectu&#233; avec une modalit&#233; autre que le langage naturel et portant en lui-m&#234;me un acte de 
communication (ou acte de dialogue), similaire &#224; un acte de langage. C&#8217;est le cas par exemple 
lorsque l&#8217;on &#233;tend une interface graphique et que l&#8217;on autorise des gestes ayant des formes 
telles qu&#8217;une croix ou une fl&#232;che, chaque forme &#233;tant associ&#233;e &#224; un d&#233;clenchement d&#8217;action. 
La croix est un &#233;quivalent du &#171; supprimer &#187; en langage naturel et prend comme argument 
                                                 
</p>
<p>1
 La diff&#233;rence rel&#232;ve de la r&#233;solution de la r&#233;f&#233;rence aux actions : &#171; d&#233;place &#187; ne peut r&#233;f&#233;rer qu&#8217;&#224; une action de 
</p>
<p>d&#233;placement, alors que &#171; mets &#187; peut r&#233;f&#233;rer soit &#224; une action de d&#233;placement, soit &#224; une action de cr&#233;ation. 
Les consid&#233;rations suivantes concernent l&#8217;existence de plusieurs primitives pour &#171; d&#233;place &#187; : 
&#8216;d&#233;placer(objet,lieu)&#8217; et &#8216;d&#233;placer(objet,lieu,chemin)&#8217;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers l&#8217;&#233;valuation des syst&#232;mes de dialogue multimodaux 
</p>
<p>l&#8217;objet cibl&#233; par le geste. Quant &#224; la fl&#232;che, elle &#233;quivaut au &#171; d&#233;place &#231;a ici &#187; avec les aspects 
dont nous avons parl&#233;. Dans un tel type de syst&#232;me multimodal, l&#8217;analyse en termes d&#8217;actes de 
langage et d&#8217;actes de dialogue met en jeu plusieurs processus : l&#8217;identification de l&#8217;acte de 
l&#8217;&#233;nonc&#233; oral et du pr&#233;dicat associ&#233;, l&#8217;identification de l&#8217;acte du geste et du pr&#233;dicat associ&#233;, 
ainsi que l&#8217;analyse de la compatibilit&#233; ou de l&#8217;incompatibilit&#233; entre les diverses hypoth&#232;ses de 
mani&#232;re &#224; aboutir &#224; un seul acte de dialogue qui sera &#224; l&#8217;origine de la r&#233;action du syst&#232;me. Par 
exemple, un geste en forme de fl&#232;che effectu&#233; en m&#234;me temps que l&#8217;&#233;nonc&#233; oral &#171; d&#233;place &#231;a 
ici &#187; ne posera pas de probl&#232;me, alors qu&#8217;un geste en forme de croix effectu&#233; en m&#234;me temps 
que le m&#234;me &#233;nonc&#233; oral conduira &#224; une incoh&#233;rence. Selon le syst&#232;me, cette incoh&#233;rence 
pourra &#234;tre interpr&#233;t&#233;e soit comme une erreur soit comme l&#8217;ex&#233;cution de deux t&#226;ches 
parall&#232;les. Tous ces aspects peuvent &#234;tre &#233;valu&#233;s gr&#226;ce aux questions Q suivantes : &#171; ce geste 
est-il une demande ? &#187; + geste ; &#171; ce geste accompagne-t-il la parole ? &#187; + geste ; &#171; l&#8217;&#233;nonc&#233; 
multimodal est-il une demande ? &#187; ; etc. A ce stade, nous avons fait le tour des principaux 
probl&#232;mes qui se posent pour le traitement des entr&#233;es en dialogue multimodal. 
</p>
<p>Niveau 5 = &#171; reconnaissance des intentions &#187;. Il s&#8217;agit ici de d&#233;terminer les intentions ou les 
buts sous-jacents aux &#233;nonc&#233;s de l&#8217;utilisateur, donc &#224; un niveau plus profond que le niveau 4. 
Le principe est d&#8217;interroger explicitement les &#233;tats intentionnels, avec des questions Q telles 
que : &#171; l&#8217;utilisateur sait-il/veut-il&#8230; ? &#187;. De tels &#233;tats intentionnels sont ind&#233;pendants des 
modalit&#233;s, et l&#8217;extension de DQR &#224; la multimodalit&#233; ne change rien &#224; ce niveau. 
Niveau 6 = &#171; pertinence de la r&#233;ponse &#187;. L&#8217;objet de la question &#233;valuative est ici assez large 
puisqu&#8217;il s&#8217;agit de tester la pertinence des r&#233;ponses du syst&#232;me. Les aspects couverts sont 
donc a priori les capacit&#233;s linguistiques (et donc multimodales) dont font preuve les r&#233;ponses, 
leur ad&#233;quation par rapport &#224; l&#8217;&#233;nonc&#233; initial de l&#8217;utilisateur, par rapport aux connaissances de 
l&#8217;application, par rapport aux moyens de communication, par rapport au profil de l&#8217;utilisateur, 
etc. Dans (Zeiliger et al., 2000), les exemples de questions Q sont les suivants : &#171; cette 
question est-elle agressive ? &#187; ; &#171; cette question est-elle n&#233;cessaire ? &#187; ; &#171; cette proposition est-
elle possible &#224; cet instant ? &#187;. Ces exemples interrogent &#224; la fois la forme et le contenu de la 
r&#233;ponse. R&#233;aliser un syst&#232;me de dialogue capable de r&#233;pondre &#224; de telles questions n&#8217;est pas 
simple. Cela suppose que le syst&#232;me (chacun de ses modules) soit capable d&#8217;&#233;valuer la 
pertinence de ses propres d&#233;cisions, un peu comme dans le mod&#232;le du carnet d&#8217;esquisses de 
(Sabah, 1996). En dialogue multimodal, il faudrait ajouter tous les aspects li&#233;s &#224; la 
multimodalit&#233; en sortie, c&#8217;est-&#224;-dire aux d&#233;cisions que le syst&#232;me a prises lors de la 
d&#233;termination du contenu et de la forme de la r&#233;ponse multimodale. Ainsi, des exemples 
possibles pour Q sont : &#171; le choix de la ou des modalit&#233;s de sortie est-il pertinent ? &#187; ; &#171; le 
message est-il surcharg&#233; ? &#187; ; &#171; le message est-il redondant ? &#187; ; &#171; le message est-il bien 
synchronis&#233; ? &#187; ; &#171; les informations pr&#233;sent&#233;es sont-elles pertinentes ? &#187; ; etc. Ces questions 
font le tour des principaux probl&#232;mes qui se posent en sortie dans le dialogue multimodal. 
Elles int&#232;grent des aspects m&#233;talinguistiques qui ne sont g&#233;n&#233;ralement pas implant&#233;s dans le 
mod&#232;le conceptuel et le lexique des syst&#232;mes. Ces aspects m&#233;talinguistiques, en plus des 
aspects m&#233;tacognitifs vus pr&#233;c&#233;demment, constituent clairement une limite &#224; la faisabilit&#233; de 
ce sixi&#232;me niveau, ainsi qu&#8217;&#224; celle du niveau suivant. 
</p>
<p>Niveau 7 = &#171; pertinence de la strat&#233;gie &#187;. Ce dernier niveau teste la qualit&#233; de la strat&#233;gie de 
dialogue, c&#8217;est-&#224;-dire si elle a &#233;t&#233; efficacement men&#233;e et si elle est r&#233;ussie. En fait, les 
questions couvrent non seulement la strat&#233;gie de dialogue, mais &#233;galement la strat&#233;gie de 
gestion de la t&#226;che : &#171; le client est-il content ? &#187; ; &#171; y a-t-il trop de questions de confirmation 
indirectes ? &#187; ; etc. Peuvent &#233;galement &#234;tre interrog&#233;s la lenteur, le nombre d&#8217;incidences, les 
raisons possibles d&#8217;une rupture, c&#8217;est-&#224;-dire tous les aspects que le syst&#232;me de dialogue peut 
(th&#233;oriquement) calculer. Ces aspects &#233;tant ind&#233;pendants des modalit&#233;s, nous les gardons et 
nous obtenons un DQR multimodal complet. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>3.2 DCR multimodal 
</p>
<p>Comme nous l&#8217;avons d&#233;j&#224; &#233;voqu&#233;, une autre mat&#233;rialisation est le paradigme DCR (Antoine, 
Caelen, 1999) qui, en rempla&#231;ant la question &#233;valuative par un contr&#244;le C, minimise le 
probl&#232;me de la capacit&#233; du syst&#232;me &#224; r&#233;pondre &#224; cette question parfois m&#233;talinguistique. Le 
contr&#244;le consiste en une simplification ou une reformulation de la demande utilisateur initiale. 
Ainsi, en reprenant quelques-uns des exemples pr&#233;c&#233;dents, on fera intervenir les contr&#244;les 
multimodaux C suivants : &#171; mets &#8216;submis.tex&#8217; en (x1, y1) &#187; ; &#171; d&#233;place obj4353 de (x1, y1) &#224; (x2, 
y12 &#187; ; &#171; d&#233;place obj4353 selon les points de passage (x3, y3), (x4, y4), (x5, y5)&#8230; &#187;. Passer du 
DQR multimodal &#224; un DCR multimodal n&#233;cessite donc la paraphrase de mani&#232;re simple et 
non ambigu&#235; des r&#233;f&#233;rences multimodales, avec la description en langage naturel de 
coordonn&#233;es spatiales. Les autres aspects ne posent pas de probl&#232;me particulier, en tout cas 
pas plus de probl&#232;me que le passage de DQR &#224; DCR. 
</p>
<p>3.3 Vers un PEACE pour le dialogue multimodal ? 
</p>
<p>Les principes de PEACE (Devillers et al., 2002) sont la reformulation de l&#8217;historique en une 
phrase unique, l&#8217;utilisation de cette phrase pour une &#233;valuation contextuelle de l&#8217;&#233;nonc&#233; 
courant, et l&#8217;exploitation de repr&#233;sentations s&#233;mantiques de r&#233;f&#233;rence. Nous avons d&#233;j&#224; parl&#233; 
de la difficult&#233; d&#8217;appliquer ce dernier principe au dialogue multimodal, et c&#8217;est donc l&#8217;id&#233;e de 
reformulation de l&#8217;historique qu&#8217;il s&#8217;agit d&#8217;&#233;tudier ici. 
</p>
<p>La mod&#233;lisation de l&#8217;historique du dialogue est un probl&#232;me r&#233;current en dialogue homme-
machine, et s&#8217;av&#232;re particuli&#232;rement complexe en dialogue multimodal (Landragin, 2004). En 
nous focalisant sur le probl&#232;me de la r&#233;f&#233;rence aux objets, l&#8217;historique doit conserver &#224; la fois 
l&#8217;identifiant des r&#233;f&#233;rents (pour ressortir ceux-ci lors de l&#8217;interpr&#233;tation d&#8217;une anaphore) et les 
mentions utilis&#233;es pour y r&#233;f&#233;rer (non seulement pour interpr&#233;ter les &#233;ventuelles r&#233;f&#233;rences 
mentionnelles ou m&#233;talinguistiques, mais aussi et surtout pour interpr&#233;ter les ellipses, en 
particulier les ellipses nominales). En multimodal, il en est de m&#234;me et les formes 
r&#233;f&#233;rentielles multimodales doivent donc &#234;tre conserv&#233;es. (Landragin, 2004) montre que l&#8217;&#233;tat 
de la sc&#232;ne visuelle doit &#233;galement &#234;tre sauvegard&#233; &#224; chaque &#233;tape, conduisant ainsi au moins 
&#224; un historique linguistique, un historique gestuel et un historique visuel. Une cha&#238;ne de 
r&#233;f&#233;rence faisant appel aux modalit&#233;s utilis&#233;es ou aux souvenirs de l&#8217;utilisateur est alors 
interpr&#233;table, par exemple : &#171; l&#8217;objet que je viens de d&#233;signer &#187;, &#171; les deux objets group&#233;s un 
peu plus loin &#187;, &#171; celui de gauche &#187;, &#171; celui qui &#233;tait &#224; droite &#187;, &#171; le dernier &#187;. Ces expressions 
r&#233;f&#233;rentielles montrent d&#8217;elles-m&#234;mes que la paraphrase d&#8217;un historique multimodal est une 
t&#226;che impossible &#224; r&#233;aliser, ou alors au prix de simplifications telles que le biais introduit 
enl&#232;vera toute plausibilit&#233; &#224; l&#8217;&#233;valuation. En effet, le seul processus de paraphrase 
automatisable est l&#8217;utilisation syst&#233;matique des identifiants des r&#233;f&#233;rents, or cette solution 
semble plus destructrice en dialogue multimodal qu&#8217;en dialogue oral : elle met en effet de c&#244;t&#233; 
l&#8217;ensemble des aspects multimodaux. Il nous appara&#238;t donc difficile d&#8217;appliquer les principes 
de PEACE au dialogue multimodal. 
</p>
<p>4 Conclusion et perspectives 
L&#8217;&#233;valuation des syst&#232;mes de dialogue multimodaux s&#8217;av&#232;re en fin de compte plus complexe 
que celle des syst&#232;mes oraux (pourtant d&#233;j&#224; bien d&#233;licate), surtout quand la multimodalit&#233; est 
consid&#233;r&#233;e comme l&#8217;association compl&#233;mentaire du langage naturel et d&#8217;autres modalit&#233;s de 
communication sur lesquelles s&#8217;appuie le langage. Dans cet article nous avons propos&#233; une 
extension du paradigme DQR/DCR &#224; la multimodalit&#233;. Nos illustrations ont port&#233; sur des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers l&#8217;&#233;valuation des syst&#232;mes de dialogue multimodaux 
</p>
<p>d&#233;rivations de l&#8217;exemple &#224; l&#8217;origine de l&#8217;essor des travaux sur la multimodalit&#233; (&#171; mets &#231;a 
ici &#187;), et sont ainsi applicables &#224; la majorit&#233; des ph&#233;nom&#232;nes de r&#233;f&#233;rence multimodale. Si nos 
propositions et les remarques aff&#233;rentes constituent un produit de recherche en soi, elles 
peuvent peut-&#234;tre aussi &#234;tre utiles &#224; la r&#233;alisation de syst&#232;mes de dialogue, de par les questions 
soulev&#233;es et les pr&#233;occupations d&#233;taill&#233;es. 
</p>
<p>Plusieurs aspects restent &#224; &#233;tudier pour obtenir une m&#233;thodologie couvrant le champ occup&#233; 
actuellement par le dialogue multimodal. Un aspect concerne les pistes qui sont explor&#233;es en 
ce moment pour simplifier la r&#233;alisation de syst&#232;mes multimodaux : comme les ph&#233;nom&#232;nes 
sont de plus en plus nombreux et les processus de plus en plus complexes, une solution 
consiste &#224; faciliter le travail des d&#233;veloppeurs en leur fournissant des environnements de 
d&#233;veloppement capables d&#8217;automatiser certaines phases de conception. Un exemple en est 
l&#8217;approche par d&#233;rivation et g&#233;n&#233;ration de mod&#232;les : en simplifiant un peu, les d&#233;veloppeurs 
&#233;crivent des mod&#232;les, et l&#8217;environnement de d&#233;veloppement g&#233;n&#232;re automatiquement des 
modules du syst&#232;me &#224; partir de ces mod&#232;les. L&#8217;&#233;valuation des syst&#232;mes obtenus doit alors 
reposer non seulement sur le comportement du syst&#232;me face &#224; des utilisateurs, mais aussi sur 
la qualit&#233; des mod&#232;les initiaux et sur celle de la cha&#238;ne de d&#233;rivation de mod&#232;les. D&#8217;autre part, 
quand les syst&#232;mes de dialogue multimodaux seront suffisamment nombreux, il nous appara&#238;t 
utile de revenir sur la m&#233;thode d&#8217;&#233;valuation par d&#233;fi. Son principe, que ce soit l&#8217;&#233;tape de 
d&#233;rivation d&#8217;&#233;nonc&#233;s &#224; partir d&#8217;un ensemble d&#8217;&#233;nonc&#233;s initiaux ou l&#8217;&#233;change des r&#244;les entre 
diff&#233;rents concepteurs, nous appara&#238;t en effet tout &#224; fait pertinent pour le dialogue multimodal. 
</p>
<p>R&#233;f&#233;rences 
ANTOINE J.-Y. (2003). Pour une ing&#233;nierie des langues plus linguistique. HDR informatique, 
Universit&#233; de Bretagne Sud, Vannes. 
</p>
<p>ANTOINE J.-Y., CAELEN J. (1999). Pour une &#233;valuation objective, pr&#233;dictive et g&#233;n&#233;rique de la 
compr&#233;hension en CHM orale : le paradigme DCR (Demande, Contr&#244;le, R&#233;sultat). Langues, 
vol. 2, n&#176; 2, 130-139. 
</p>
<p>BERINGER N., KARTAL U., LOUKA K., SCHIEL F., T&#220;RK U. (2002). PROMISE &#8211; A procedure 
for multimodal interactive system evaluation. Proceedings of the LREC Workshop on 
Multimodal Resources and Multimodal Systems Evaluation, Las Palmas, 77-80. 
</p>
<p>BERNSEN N.O., DYBKJ&#198;R L. (2004). Evaluation of Spoken Multimodal Conversation. 
Proceedings of the Sixth International Conference on Multimodal Interfaces (ICMI), Penn 
State University, 38-45. 
</p>
<p>BOLT R.A. (1980). Put-That-There: Voice and gesture at the graphics interface. Proceedings 
of the 7th Annual Conference on Computer Graphics and Interactive Techniques, Seattle. 
BONNEAU-MAYNARD H., AYACHE C., BECHET F., DENIS A., KUHN A., LEFEVRE F., MOSTEFA 
D., QUIGNARD M., ROSSET S., SERVAN C., VILLANEAU J. (2006). Results of the French Evalda-
Media Evaluation Campaign for Literal Understanding. Proceedings of the 5th International 
Conference on Language Resources and Evaluation (LREC&#8217;06), G&#234;nes, Italie. 
CAELEN J., XUEREB A. (2007). Interaction et pragmatique. Paris : Herm&#232;s-Lavoisier. 
</p>
<p>CHAUDIRON S. (Ed.) (2004). Evaluation des syst&#232;mes de traitement de l&#8217;information. Paris : 
Herm&#232;s-Lavoisier. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Fr&#233;d&#233;ric Landragin 
</p>
<p>DEVILLERS L., MAYNARD H., PAROUBEK P. (2002). M&#233;thodologies d&#8217;&#233;valuation des syst&#232;mes 
de dialogue parl&#233; : r&#233;flexions et exp&#233;riences autour de la compr&#233;hension. Traitement 
Automatique des Langues, vol. 43, n&#176; 2, 155-184. 
</p>
<p>DYBKJ&#198;R L., BERNSEN N.O., DYBKJ&#198;R H. (1998). A Methodology for diagnostic evaluation 
of spoken human-machine dialogue, International Journal of Human Computer Studies, 
vol. 48, 605-625. 
</p>
<p>DYBKJ&#198;R L., BERNSEN N.O., MINKER W. (2004). Evaluation and usability of multimodal 
spoken language dialogue systems, Speech Communication, vol. 43, n&#176; 1-2, 33-54. 
</p>
<p>ECKERT W., LEVIN E., PIERACCINI R. (1998). Automatic evaluation of spoken dialogue 
systems. Proceedings of the 2nd Workshop on Formal Semantics and Pragmatics of 
Dialogue, University of Twente, Enschede, The Netherlands, 99-110. 
</p>
<p>GIBBON D., MERTINS I., MOORE R.K. (2000). Handbook of multimodal and spoken dialogue 
systems: Resources, terminology and product evaluation. Kluwer Academic Publishers. 
</p>
<p>HIRSCHMAN L. (1992). Multi-Site Data Collection for a Spoken Language Corpus: 
MADCOW. Proceedings of the DARPA Speech and Natural Language Workshop, New York. 
LANDRAGIN F. (2004). Dialogue homme-machine multimodal. Paris : Herm&#232;s-Lavoisier. 
</p>
<p>LITMAN D.J., PAN S. (1999). Empirically evaluating an adaptable spoken dialogue system. 
Proceedings of the 7th International Conference on User Modeling. 
LOPEZ-COZAR R., ARAKI M. (2005). Spoken, multilingual and multimodal dialogue systems: 
Development and assessment. John Wiley &amp; Sons, Ltd. 
</p>
<p>LOPEZ-COZAR R., DE LA TORRE A., SEGURA J.C., RUBIO A.J. (2003). Assessment of dialogue 
systems by means of a new simulation technique, Speech Communication, vol. 40, 387-407. 
</p>
<p>M&#214;LLER S., SMEELE P., BOLAND H., KREBBER J. (2007). Evaluating spoken dialogue systems 
according to de-facto standards: A case study, Computer Speech and Language, vol. 21. 
</p>
<p>SABAH G. (1996). Le &#171; carnet d&#8217;esquisses &#187; : une m&#233;moire interpr&#233;tative dynamique. Actes du 
colloque AFCET &#8211; AFIA, Rennes. 
</p>
<p>VUURPIJL L.G., TEN BOSCH L., ROSSIGNOL S., NEUMANN A., PFLEGER N., ENGEL R. (2004). 
Evaluation of multimodal dialog systems. Proceedings of the LREC Workshop on Multimodal 
Corpora and Evaluation, Lisbon, Portugal. 
</p>
<p>WALKER M.A., PASSONNEAU R., BOLAND J.E. (2001). Quantitative and Qualitative Evaluation 
of Darpa Communicator Spoken Dialogue Systems. Meeting of the Association of 
Computational Linguistics. 
</p>
<p>WALKER M.A., WHITTAKER S., STENT A., MALOOR P., MOORE J., JOHNSTON M., VASIREDDY 
G. (2004). Generation and Evaluation of User Tailored Responses in Multimodal Dialogue. 
Cognitive Science, vol. 28, n&#176; 5, 811-840. 
</p>
<p>ZEILIGER J., ANTOINE J.-Y., CAELEN J. (2000). La m&#233;thodologie DQR d&#8217;&#233;valuation qualitative 
des syst&#232;mes de dialogue oral homme-machine, Dans Mariani J., Masson N., N&#233;el F., Chibout 
K. (Ed.) Ressources et Evaluations en Ing&#233;nierie de la Langue, AUF et De Boeck Universit&#233;. </p>

</div></div>
</body></html>