<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Mesure de l&#8217;alternance entre pr&#233;fixes pour la g&#233;n&#233;ration en traduction automatique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Mesure de l&#8217;alternance entre pr&#233;fixes pour la g&#233;n&#233;ration en traduction automatique 
</p>
<p>Mesure de l&#8217;alternance entre pr&#233;fixes pour la g&#233;n&#233;ration en 
traduction automatique 
</p>
<p>Bruno Cartoni 
</p>
<p>ISSCO/TIM-ETI &#8211; Universit&#233; de Gen&#232;ve, 40 bd du Pont d&#8217;Arve 
CH-1205 Gen&#232;ve 
</p>
<p>bruno.cartoni@eti.unige.ch 
</p>
<p>R&#233;sum&#233; La g&#233;n&#233;ration de n&#233;ologismes construits pose des probl&#232;mes dans un syst&#232;me de 
traduction automatique, notamment au moment de la s&#233;lection du pr&#233;fixe dans les formations 
pr&#233;fix&#233;es, quand certains pr&#233;fixes paraissent pouvoir alterner. Nous proposons une &#233;tude 
&#171; extensive &#187;, qui vise &#224; rechercher dans de larges ressources textuelles (l&#8217;Internet) des formes 
pr&#233;fix&#233;es g&#233;n&#233;r&#233;es automatiquement, dans le but d&#8217;individualiser les param&#232;tres qui favorisent 
l&#8217;un des pr&#233;fixes ou qui, au contraire, permettent cette alternance. La volatilit&#233; de cette 
ressource textuelle n&#233;cessite certaines pr&#233;cautions dans la m&#233;thodologie de d&#233;compte des 
donn&#233;es extraites.  
</p>
<p>Abstract Generating constructed neologisms in a machine translation system is confronted 
to the issue of selecting the right affixes, especially when some affixes can be used alternately. 
We propose here an &#8220;extensive&#8221; study that looks into large textual data collections (web) for 
prefixed forms that have been automatically generated, in order to find out parameters that 
allow the use of both prefixes or, on the contrary, that prevent one or the other prefixation. 
The volatility of web resources requires methodological precautions, especially in data 
counting. 
</p>
<p>Mots-cl&#233;s :   morphologie, traduction automatique, g&#233;n&#233;ration, n&#233;ologisme, &#233;tudes 
empiriques 
Keywords:   morphology, machine translation, generation, neologism, empirical studies 
</p>
<p>Introduction 
L&#8217;&#233;tape de g&#233;n&#233;ration des n&#233;ologismes construits dans un contexte de traduction automatique 
est souvent confront&#233;e &#224; un certain nombre de difficult&#233;s, notamment lorsqu&#8217;il existe la 
possibilit&#233; de former, sur un m&#234;me mot-base (e.g. dimensionnel), deux formes construites 
avec deux pr&#233;fixes diff&#233;rents pour exprimer deux sens apparemment synonymes 
(multidimensionnel/pluridimensionnel). Dans cet article, nous proposons une m&#233;thodologie de 
morphologie &#171; extensive &#187; autour de ce ph&#233;nom&#232;ne d&#8217;alternance, encore trop peu &#233;tudi&#233; en 
morphologie, qui  nous permet d&#8217;une part de le quantifier, et d&#8217;autre part de mettre au jour 
certaines caract&#233;ristiques autorisant ou emp&#234;chant cette alternance, pour pouvoir contraindre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>les r&#232;gles de g&#233;n&#233;ration. La ressource textuelle utilis&#233;e (l&#8217;Internet) fournit un nombre 
important de donn&#233;es, mais n&#233;cessite &#233;galement la mise en place de certains affinages dans le 
traitement des r&#233;sultats. 
</p>
<p>1 Traduction automatique et morphologie 
Cette &#233;tude s&#8217;inscrit dans un projet de traduction automatique (TA) des mots construits 
(Cartoni 2005) pour lequel nous formalisons un certain nombre de r&#232;gles de construction des 
lex&#232;mes (RCL) bilingues, permettant de traduire automatiquement des n&#233;ologismes construits 
absents des lexiques des syst&#232;mes de TA. Ces r&#232;gles analysent tous les mots inconnus 
construits et individualisent le proc&#233;d&#233; de construction qui les sous-tend ; elles g&#233;n&#232;rent 
ensuite un &#233;quivalent de traduction dans la langue cible. Le syst&#232;me se concentre pour 
l&#8217;instant sur la pr&#233;fixation en fran&#231;ais et en italien. L&#8217;exemple ci-dessous montre une RCL 
bilingue de r&#233;it&#233;rativit&#233;, (ou mot italien X, pr&#233;fix&#233; en ri, peut &#234;tre traduit par un mot fran&#231;ais 
Y, pr&#233;fix&#233; en re). 
IT : RCLREITER [X]V&#8594;ri[X]V &#8596; FR : RCLREITER [Y]V &#8594;re[Y]V 
Ainsi, un mot italien construit (e.g. ricostruire) est analys&#233; par la partie gauche de la r&#232;gle 
(ici : ri+ costruireV ). La partie droite de la r&#232;gle s&#8217;occupe ensuite de g&#233;n&#233;rer un &#233;quivalent de 
traduction en fran&#231;ais (ici : reconstruire) en se basant sur la r&#232;gle et sur la traduction de la 
base (costruireIT=construireFR). Ces RCL bilingues sont bas&#233;es sur une &#233;tude contrastive des 
proc&#233;d&#233;s de traduction, qui s&#8217;attache avant tout &#224; mettre en parall&#232;le des proc&#233;d&#233;s en fonction 
du sens qu&#8217;ils permettent de construire. 
</p>
<p>1.1 Des r&#232;gles de construction des lex&#232;mes &#224; exposants multiples ? 
</p>
<p>Cet appariement des RCL bas&#233; sur le sens construit implique que certaines r&#232;gles mettent en 
jeu plusieurs affixes, sans qu&#8217;il soit possible, a priori, de contraindre l&#8217;emploi de l&#8217;un ou 
l&#8217;autre. Ce ph&#233;nom&#232;ne se retrouve notamment dans les pr&#233;fixations de quantit&#233;, o&#249; l&#8217;on peut 
distinguer la r&#232;gle de pr&#233;fixation de &#171; pluralit&#233; ind&#233;termin&#233;e &#187; (qui met en jeu les pr&#233;fixes 
fran&#231;ais pluri, multi, poly, et les pr&#233;fixes italiens pluri, multi, poli), et celle de &#171; quantit&#233; 
unique &#187; (mettant en jeu les pr&#233;fixes mono et uni dans les deux langues), ainsi que dans les 
r&#232;gles de pr&#233;fixation &#233;valuative, o&#249; l&#8217;on distingue notamment la valeur &#171; grand &#187; &#8211; FR : m&#233;ga, 
maxi, IT : mega, maxi &#8211; et la valeur &#171; bon &#187; FR : hyper, super, IT : iper, super1. 
</p>
<p>D&#8217;un point de vue de pure formalisation morphologique, et dans une approche lex&#233;matique &#8211; 
notamment &#224; la suite de travaux de (Fradin 2003) &#8211;, ces &#171; groupes &#187; de pr&#233;fixes sont 
consid&#233;r&#233;s comme les exposants d&#8217;une m&#234;me r&#232;gle de pr&#233;fixation. Ainsi, nous formalisons 
des RCL bilingues &#224; exposants multiples, qui d&#233;crivent les diff&#233;rentes possibilit&#233;s de 
formation des mots en langues source et cible. La RCL de pluralit&#233; ind&#233;termin&#233;e pour la 
pr&#233;fixation nominale prend alors la forme de : 
</p>
<p>IT : RCLPLUR_INDET [X]N&#8594; multi|pluri|poli[X]N &#8596; FR : RCLPLUR_INDET [Y]N &#8594; multi|pluri|poly [Y]N 
Ces RCL &#224; exposants multiples concernent &#233;videmment les groupes de pr&#233;fixes partageant 
une m&#234;me valeur s&#233;mantique, et doivent &#234;tre sp&#233;cifi&#233;es en fonction des diff&#233;rentes cat&#233;gories 
                                                
</p>
<p>1
 Ces groupes de pr&#233;fixes inclut de nombreux pr&#233;fixes, mais pour limiter l&#8217;&#233;tude, nous nous concentrons sur les 
</p>
<p>pr&#233;fixes les plus fr&#233;quents. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mesure de l&#8217;alternance entre pr&#233;fixes pour la g&#233;n&#233;ration en traduction automatique 
</p>
<p>d&#8217;input et d&#8217;output. En fran&#231;ais, par exemple, (Amiot 2005) rappelle que les trois pr&#233;fixes de 
pluralit&#233; ind&#233;termin&#233;e renvoient tous &#224; une id&#233;e de pluralit&#233;, et entrent dans la formation de 
noms (essentiellement sur base nominale) et d&#8217;adjectifs (sur base nominale ou adjectivale). Ils 
peuvent alterner avec d&#8217;autres formants exprimant d&#8217;autres id&#233;es de d&#233;nombrement 
(multicellulaire/unicellulaire) mais &#233;galement entre eux (multicellulaire/pluricellulaire). Les 
pr&#233;fixes de quantit&#233; unique (mono, uni) semblent pr&#233;senter les m&#234;mes caract&#233;ristiques en 
termes d&#8217;alternance, en italien comme en fran&#231;ais. Enfin, les pr&#233;fixes &#171; &#233;valuatifs &#187; 
s&#8217;appliquent &#224; des bases nominales et adjectivales pour former respectivement des noms ou 
des adjectifs (bien&#1;m&#233;gabienFR, pr&#233;sident &#1; superpr&#233;sidentFR, riforma&#1; iperriformaIT ). 
Parmi ces pr&#233;fixes, l&#8217;alternance semble inh&#233;rente &#224; leur classe particuli&#232;re, qui est souvent 
d&#233;crite comme extr&#234;mement variable et volatile (Montermini &#224; para&#238;tre). 
</p>
<p>1.2 Des pr&#233;fixes interchangeables ? 
</p>
<p>Les &#233;tudes morphologiques d&#233;crivent certes certaines contraintes favorisant l&#8217;emploi de tel ou 
tel pr&#233;fixe, comme l&#8217;origine latine ou grecque de la base et du pr&#233;fixe, la cat&#233;gorie de la base 
(les adjectifs pr&#233;f&#233;rant multi et pluri, les noms poly), ou encore le domaine (poly &#233;tant r&#233;serv&#233; 
&#224; certains vocabulaires techniques). Mais malgr&#233; ces contraintes (lorsqu&#8217;elles existent), 
l&#8217;alternance entre pr&#233;fixes para&#238;t &#234;tre un ph&#233;nom&#232;ne fr&#233;quent, qui m&#233;rite d'&#234;tre &#233;tudi&#233; 
quantitativement et qualitativement. 
</p>
<p>Dans notre projet de syst&#232;me de traduction des n&#233;ologismes construits, et tout 
particuli&#232;rement dans la partie qui traite de la g&#233;n&#233;ration en langue cible, nous avons besoin 
de conna&#238;tre les conditions qui permettent cette interchangeabilit&#233; ou qui, au contraire, 
poussent &#224; la s&#233;lection de l&#8217;une ou l&#8217;autre forme. L&#8217;&#233;tude de l&#8217;alternance entre pr&#233;fixes doit 
donc permettre de d&#233;couvrir des contraintes ou des tendances (de fr&#233;quence ou d&#8217;usage) 
permettant la s&#233;lection de l&#8217;une ou l&#8217;autre forme, ou au contraire, permettant de maintenir 
l&#8217;interchangeabilit&#233; et g&#233;n&#233;rer les diff&#233;rentes possibilit&#233;s de traduction. Pour mesurer 
l&#8217;interchangeabilit&#233; de certains pr&#233;fixes, les indices de productivit&#233; d&#233;sormais classiques 
(Baayen et Lieber 1991) ne suffisent pas, car bien souvent, les pr&#233;fixes sont l&#8217;un comme 
l&#8217;autre tout aussi productifs &#224; l&#8217;int&#233;rieur du m&#234;me groupe. Et m&#234;me si ces indices peuvent in 
fine &#234;tre la solution, ils ne nous &#233;pargnent pas de nous interroger au pr&#233;alable sur l&#8217;alternance 
entre pr&#233;fixes. Nous proposons donc dans la suite une m&#233;thode permettant d&#8217;appr&#233;hender 
l&#8217;alternance entre pr&#233;fixes sous des angles diff&#233;rents. 
</p>
<p>2 M&#233;thodes pour mesurer l&#8217;alternance 
Dans cet article, nous pr&#233;sentons une s&#233;rie d&#8217;&#233;tudes en corpus permettant (1) d&#8217;&#233;valuer 
l&#8217;existence de cette alternance et (2) de quantifier le degr&#233; d&#8217;alternance entre pr&#233;fixes, en 
mesurant l&#8217;&#233;cart des fr&#233;quences entre les paires de formes possibles (p. ex. 
m&#233;gaproduction/maxiproduction). Ces fr&#233;quences compar&#233;es pour des paires de formes 
possibles sont obtenues en confrontant des paires de mots fran&#231;ais g&#233;n&#233;r&#233;s automatiquement 
par nos r&#232;gles de traduction automatique &#224; partir de n&#233;ologismes italiens avec la large 
ressource textuelle que constitue l&#8217;Internet. Cette recherche &#171; extensive &#187; (Hathout, Pl&#233;nat et 
al. 2003) vise &#224; acqu&#233;rir, en corpus, le plus grand nombre possible d&#8217;attestations du proc&#233;d&#233; 
&#233;tudi&#233; en vue de faire appara&#238;tre des r&#233;gularit&#233;s nouvelles, ou, dans notre cas, des contraintes &#224; 
appliquer sur la partie &#171; g&#233;n&#233;ration &#187; des RCL bilingues.  
</p>
<p>Comme toute m&#233;thode empirique, et particuli&#232;rement celles qui se basent sur la ressource 
textuelle que constitue l&#8217;Internet, les &#233;vidences d&#8217;une alternance ne doivent pas mener &#224; une </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>conclusion trop abrupte, sans prendre des pr&#233;cautions d&#8217;analyse des donn&#233;es. En effet, une 
alternance constat&#233;e en corpus peut &#234;tre le fait de deux ph&#233;nom&#232;nes. Soit les pr&#233;fixes sont 
compl&#232;tement interchangeables, et les deux formes pr&#233;fix&#233;es sont possibles et fr&#233;quentes dans 
les m&#234;mes proportions, soit l&#8217;alternance rel&#232;ve d&#8217;un &#171; accident &#187;, l&#8217;une des deux formes &#233;tant 
beaucoup moins fr&#233;quente que l&#8217;autre. Ainsi, une analyse plus fine des fr&#233;quences trouv&#233;es 
doit &#234;tre men&#233;e, pour tenir compte de ces diff&#233;rences &#233;galement d&#8217;un point de vue plus 
qualitatif. 
</p>
<p>Nous d&#233;crivons dans la suite la proc&#233;dure d&#8217;acquisition des n&#233;ologismes construits en italien 
et la g&#233;n&#233;ration des paires de traduction potentielles, ainsi que l&#8217;outil exploit&#233; pour effectuer 
les requ&#234;tes sur le web et r&#233;cup&#233;rer les fr&#233;quences d&#8217;apparition des diff&#233;rentes formes test&#233;es. 
</p>
<p>2.1 Corpus et outils utilis&#233;s 
</p>
<p>Nous avons tout d&#8217;abord extrait d&#8217;un corpus journalistique italien (La Repubblica, 
380 millions d&#8217;occurrences (Baroni, Bernardini et al. 2004)) les mots commen&#231;ant par les 
pr&#233;fixes de notre &#233;tude. Nous avons ensuite affin&#233; cette extraction en ne gardant que les mots 
absents d&#8217;un lexique de r&#233;f&#233;rence de l&#8217;italien (Mmorph, 739 000 formes (Bouillon, Lehmann 
et al. 1998)) et en ne conservant que les mots dont la base est pr&#233;sente dans ce m&#234;me lexique 
de r&#233;f&#233;rence. Pour chaque n&#233;ologisme italien ainsi extrait, nous avons traduit 
semi-automatiquement leur base en fran&#231;ais (multidimensionaleIT &#1; dimensionnelFR), puis 
nous avons g&#233;n&#233;r&#233; automatiquement les diff&#233;rentes possibilit&#233;s de construction avec les 
pr&#233;fixes possibles du fran&#231;ais. Ainsi, pour l'exemple donn&#233; ci-dessus, nous avons g&#233;n&#233;r&#233; 
automatiquement les mots fran&#231;ais : multidimensionnel, pluridimensionnel, polydimensionnel.  
</p>
<p>Nous obtenons ainsi une liste de paires (ou de triplets) de mots possibles pour chacun des 
formes italiennes d&#8217;origine (611 formes pr&#233;fix&#233;es en maxi, 714 formes en mega, 2155 formes 
en super, 731 formes en iper, 210 formes en mono, 263 formes en multi, 274 formes en pluri, 
et 94 formes en poli). Il convient en outre de pr&#233;ciser que nous n&#8217;avons proc&#233;d&#233; &#224; aucune 
lemmatisation des donn&#233;es, &#233;tant donn&#233; que la flexion peut avoir son importance en n&#233;ologie. 
</p>
<p>Pour &#233;valuer empiriquement l&#8217;existence ou la fr&#233;quence de ces mots possibles, nous avons 
utilis&#233; le robot Golf (Thomas 2008) qui permet de lancer une succession de requ&#234;tes sur le 
moteur de recherche Google, en sp&#233;cifiant certaines options (langue, format du fichier, 
emplacement du mot recherch&#233; dans les pages web, etc.). Ce robot donne en retour le nombre 
de pages trouv&#233;es pour chaque requ&#234;te. &#201;videmment, les donn&#233;es provenant de l&#8217;Internet sont 
&#224; prendre avec pr&#233;caution &#233;tant donn&#233; la volatilit&#233; de ce corpus : peu de fiabilit&#233; dans la 
correction (orthographique et terminologique), peu de contr&#244;le linguistique, importante 
pr&#233;sence de noms de marque ou de jeux de mots. Malgr&#233; cela, le corpus du web reste une 
source inestimable pour un travail sur la productivit&#233; n&#233;ologique. 
</p>
<p>En sortie de l&#8217;outil Golf, nous obtenons pour chaque forme la fr&#233;quence d&#8217;apparition sur 
l&#8217;Internet2. Mais cet ensemble de fr&#233;quences peut &#234;tre analys&#233; de diff&#233;rentes mani&#232;res. 
Comme le rappellent (Hathout, Namer et al. (&#224; para&#238;tre). ), nous pouvons prendre en compte la 
distinction absence/pr&#233;sence des formes recherch&#233;es, les diff&#233;rents ordres de grandeur (2 
                                                
</p>
<p>2
 Cette fr&#233;quence est en r&#233;alit&#233; le nombre de &#171; documents &#187; trouv&#233;s qui contiennent  au moins une occurrence de 
</p>
<p>la forme recherch&#233;. Il peut y avoir plusieurs occurrences dans un document, ph&#233;nom&#232;ne dont les moteurs de 
recherche ne permettent pas de rendre compte. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mesure de l&#8217;alternance entre pr&#233;fixes pour la g&#233;n&#233;ration en traduction automatique 
</p>
<p>occurrences vs 3 millions d&#8217;occurrences), ou les diff&#233;rences faiblement marqu&#233;es (presque 
autant d&#8217;occurrences pour les deux formes test&#233;es). Cette derni&#232;re comparaison est la plus 
int&#233;ressante en cas de pr&#233;fixe alternant, mais doit &#234;tre mise en relation avec les autres types de 
comparaison. 
</p>
<p>2.2 Plusieurs mesures possibles 
</p>
<p>Diff&#233;rents types d&#8217;informations peuvent &#234;tre tir&#233;s de la collecte de ces fr&#233;quences. 
Premi&#232;rement, l&#8217;absence de pages retourn&#233;es donne un indice d&#8217;impossibilit&#233; de construction, 
m&#234;me si cette absence ne dit rien dans l&#8217;absolu sur la possibilit&#233; de construction d&#8217;un lex&#232;me, 
et qu&#8217;elle peut provenir de probl&#232;mes informatiques du syst&#232;me ou du r&#233;seau, ou d'une 
divergence de construction entre l&#8217;italien et le fran&#231;ais. Cette absence/pr&#233;sence nous permet 
tout de m&#234;me d&#8217;&#233;valuer l&#8217;ampleur de cette interchangeabilit&#233; (cf. section 3.1). Deuxi&#232;mement, 
en cas d&#8217;alternance entre deux formes d&#8217;une m&#234;me paire, l&#8217;&#233;cart entre les nombres de pages 
retourn&#233;es permet d&#8217;affiner l&#8217;analyse, d&#8217;une part, en comparant cet &#233;cart pour chaque paire 
(section 3.2 ci-apr&#232;s) et, d&#8217;autre part, en focalisant l&#8217;analyse qualitative sur certaines paires, 
quand les &#233;carts de fr&#233;quence entre les deux formes sont tr&#232;s larges ou au contraire tr&#232;s 
restreints (section 3.3). Un &#233;cart important des fr&#233;quences entre deux formes permettra de 
discriminer l&#8217;un des deux pr&#233;fixes, et un &#233;cart restreint montrera en revanche une importante 
interchangeabilit&#233; des pr&#233;fixes du m&#234;me groupe. 
</p>
<p>3 R&#233;sultats 
3.1 Ampleur de l&#8217;alternance des pr&#233;fixes 
En comparant le nombre de paires de formes pour lesquelles Golf ne rendait de r&#233;ponse que 
pour une seule forme pr&#233;fix&#233;e (comme monopoutre (796 occ.)/unipoutre (0 occ.)) avec les 
paires de formes pour lesquels des r&#233;ponses &#233;taient retourn&#233;es pour deux formes pr&#233;fix&#233;es 
(comme monosectoriel (70 occ. )/unisectoriel (44 occ.)), nous pouvons estimer les proportions 
dans lesquelles il y a une alternance ou non, ce que r&#233;sume la figure 1 ci-dessous. Dans cette 
figure, le premier pr&#233;fixe donn&#233; correspond au cognat3 de la forme italienne &#224; partir de 
laquelle le mot a &#233;t&#233; g&#233;n&#233;r&#233;. Le second est le pr&#233;fixe &#171; alternant &#187;. 
</p>
<p>0% 20% 40% 60% 80% 100%
</p>
<p>maxi (avec m&#233;ga)
m&#233;ga (avec maxi)
</p>
<p>super (avec hyper)
hyper (avec super)
</p>
<p>mono (avec uni)
uni (avec mono)
</p>
<p>Aucune occurrence
</p>
<p>Occurrence du 1er
seulement
Occurrence du 2&#232;me
seulement
Occurrences des 2
</p>
<p> 
</p>
<p>Figure 1 : Occurrences retourn&#233;es pour chaque paire alternante 
</p>
<p>                                                
</p>
<p>3
 C&#8217;est-&#224;-dire les pr&#233;fixes qui sont formellement tr&#232;s similaires entre les deux langues. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>Trois types de commentaires peuvent &#234;tre faits sur ce type de r&#233;sultat. Premi&#232;rement, 
concernant l&#8217;absence d&#8217;occurrence, il est difficile de tirer des conclusions, tant les 
ph&#233;nom&#232;nes d&#8217;absence dans des ressources aussi peu contr&#244;l&#233;es que l&#8217;Internet ne repr&#233;sentent 
pas des donn&#233;es fiables. D&#8217;un point de vue traductionnel, il faut n&#233;anmoins remarquer 
l&#8217;absence importante de traductions (aucune occurrence, dans la figure 1) quelles que soient 
les paires en m&#233;ga/maxi. Le deuxi&#232;me type de commentaire porte sur les cas o&#249; il n&#8217;y a pas 
d&#8217;alternance entre deux formes possibles, mais o&#249; un seul mot pr&#233;fix&#233; est retrouv&#233; 
(occurrences du 1er ou du 2&#232;me seulement, dans la figure ci-dessus). Dans ce cas de figure, 
c&#8217;est avant tout la forme &#171; cognat &#187; de l&#8217;italien qui est retrouv&#233;e en fran&#231;ais, avec une 
exception notable des formes italiennes en maxi qui sont majoritairement &#171; traduites &#187; en 
m&#233;ga (pr&#232;s de 30 %, contre seulement 10 % en maxi). Enfin, le dernier commentaire porte sur 
le nombre important de cas o&#249; les deux formes ont &#233;t&#233; retourn&#233;es (occurrences des 2, dans la 
figure 1). Ces cas interchangeables repr&#233;sentent plus de 70 % pour les alternances mono/uni 
dans les deux sens, et tout de m&#234;me plus d&#8217;un quart pour les pr&#233;fix&#233;s en m&#233;ga/maxi.  
</p>
<p>Pour la classe des pr&#233;fixes de pluralit&#233; ind&#233;termin&#233;e, qui contient donc trois pr&#233;fixes 
alternants, les r&#233;sultats sont encore plus frappants, comme le montre la figure 2 ci-dessous :  
</p>
<p>0% 20% 40% 60% 80% 100%
</p>
<p>multi (avec pluri/poly)
</p>
<p>pluri (avec multi/poly)
</p>
<p>poly (avec multi/pluri) Aucune occ.
Occ. de 1 sur 3
</p>
<p>Occ. de 2 sur 3
</p>
<p>Occ. des 3
</p>
<p> 
</p>
<p>Figure 2 : Occurrences retourn&#233;es pour chaque triplet alternant 
</p>
<p>Si l&#8217;on tient compte de l&#8217;alternance entre deux ou entre trois pr&#233;fixes, nous constatons qu&#8217;elle 
est possible dans plus de 50 % des cas. Ces deux graphiques confirment donc qu&#8217;il existe un 
alternance/interchangeabilit&#233; potentielle entre les pr&#233;fixes d&#8217;une m&#234;me valeur s&#233;mantique. 
Mais &#224; nouveau, la qualit&#233; des donn&#233;es extraites de l&#8217;Internet peut &#234;tre sujette &#224; caution, et des 
pr&#233;cautions d&#8217;analyse s&#8217;imposent. Dans la suite, nous proposons deux m&#233;thodes d&#8217;analyse 
permettant de regarder de plus pr&#232;s ces paires alternantes et d&#8217;affiner ces r&#233;sultats. 
</p>
<p>3.2 Plusieurs types d&#8217;alternance : le rapport de fr&#233;quence  
</p>
<p>Les donn&#233;es extraites dans l&#8217;exp&#233;rience pr&#233;c&#233;dente peuvent &#234;tre analys&#233;es de diff&#233;rents points 
de vue. Nous proposons ici de classer et de comparer les diff&#233;rentes paires de mots alternants, 
pour pouvoir qualifier de mani&#232;re plus pr&#233;cise cette alternance et voir s&#8217;il s&#8217;agit d&#8217;une 
interchangeabilit&#233; r&#233;elle, ou si la pr&#233;sence des deux formes rel&#232;ve plut&#244;t de l&#8217;accident et serait 
due &#224; la volatilit&#233; des donn&#233;es de l&#8217;Internet. Pour cette partie, nous travaillons sur les listes de 
mots alternants en fran&#231;ais, quel que soit le mot italien desquels ils proviennent. Ainsi, pour 
des raisons de validit&#233; m&#233;thodologique et de simplicit&#233; de traitement, nous consid&#233;rons dans 
cette section l&#8217;alternance dans sa dimension monolingue uniquement. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mesure de l&#8217;alternance entre pr&#233;fixes pour la g&#233;n&#233;ration en traduction automatique 
</p>
<p>3.2.1 Calcul d&#8217;un score d&#8217;alternance pour chaque paire 
</p>
<p>Pour pouvoir comparer les paires d&#8217;alternances et leur fr&#233;quence, il est int&#233;ressant de calculer, 
pour chaque forme un &#171; score d&#8217;alternance &#187;, qui est obtenu en divisant le nombre 
d'occurrences d'une forme pr&#233;fix&#233;e avec un pr&#233;fixe par le nombre total d&#8217;occurrences 
pr&#233;fix&#233;es par les deux pr&#233;fixes. Par exemple, pour la paire 
multiconfessionnel/pluriconfessionnel, le robot Golf a retourn&#233; respectivement 8310 et 1100 
occurrences. Nous attribuons donc &#224; cette paire le score de 0.883103082, obtenu par division 
du nombre d&#8217;occurrences de la premi&#232;re forme, par le nombre total d&#8217;occurrences des deux 
formes. Nous obtenons ainsi des donn&#233;es comparables pour chaque paire d&#8217;alternance, situ&#233;e 
sur une &#233;chelle d&#8217;alternance entre 0 et 1. Plus le rapport est proche de 0.5, plus les deux 
formes sont aussi fr&#233;quentes l&#8217;une que l&#8217;autre et plus nous avons affaire &#224; une 
interchangeabilit&#233; tr&#232;s fortement marqu&#233;e. 
</p>
<p>3.3 R&#233;partition sur les &#233;chelles d&#8217;alternance 
</p>
<p>Les rapports d&#8217;alternance ainsi obtenus sont ordonn&#233;s, ce qui permet d&#8217;obtenir une 
repr&#233;sentation de ces paires en fonction de la pr&#233;f&#233;rence pour l&#8217;un ou l&#8217;autre des pr&#233;fixes, ou 
en fonction de leur interchangeabilit&#233;. Au milieu de l&#8217;&#233;chelle, nous avons individualis&#233; une 
fen&#234;tre d&#8217;analyse autour du rapport 0,5 (entre les rapports 0,4 et 0,6), dans laquelle se situent 
les paires d&#8217;alternance o&#249; la pr&#233;f&#233;rence pour l&#8217;un ou l&#8217;autre des pr&#233;fixes n&#8217;est quasiment pas 
marqu&#233;e et donc o&#249; les pr&#233;fixes semblent interchangeables. Aux extr&#233;mit&#233;s de l&#8217;&#233;chelle, les 
pr&#233;f&#233;rences sont plus nettement marqu&#233;es4. Ainsi, les &#233;chelles que nous pr&#233;sentons dans la 
figure 3 ci-dessous montrent les proportions de paires o&#249; l&#8217;alternance est &#171; parfaite &#187; et celles 
o&#249; il existe une pr&#233;f&#233;rence plus marqu&#233;e pour l&#8217;un ou l&#8217;autre des formes pr&#233;fix&#233;es. 
</p>
<p>21.89%
</p>
<p>13.41%
</p>
<p>7.91%
</p>
<p>2.85%
</p>
<p>11.20%
</p>
<p>6.88%
</p>
<p>0% 20% 40% 60% 80% 100%
</p>
<p>m&#233;ga/maxi
</p>
<p>super/iper
</p>
<p>multi/pluri
</p>
<p>multi/poly
</p>
<p>pluri/poly
</p>
<p>mono/uni
Pr&#233;f&#233;rence
pour le premier
</p>
<p>Alternance
parfaite
</p>
<p>Pr&#233;f&#233;rence
pour le
deuxi&#232;me
</p>
<p> 
</p>
<p>Figure 3 : Echelles d'alternance 
</p>
<p>De nombreux enseignements peuvent &#234;tre tir&#233;s d&#8217;un tel graphique. Premi&#232;rement, l&#8217;alternance 
&#171; parfaite &#187;, ou interchangeabilit&#233;, est la plus importante dans les deux paires de pr&#233;fixes 
&#233;valuatifs. Ce n&#8217;est pas &#233;tonnant, &#233;tant donn&#233; que ces pr&#233;fixes sont tr&#232;s souvent d&#233;crits 
comme tr&#232;s instables, et n&#8217;apportant pas une &#171; instruction &#187; s&#233;mantique pr&#233;cise. La s&#233;lection 
de l&#8217;un ou l&#8217;autre des pr&#233;fixes d&#233;pend donc de nombreux autres facteurs que de la seule r&#232;gle 
                                                
</p>
<p>4
 Pour des questions de repr&#233;sentativit&#233;, les paires dont les deux formes n&#8217;&#233;taient trouv&#233;es qu&#8217;une fois par Golf 
</p>
<p>ont &#233;t&#233; exclues. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>de pr&#233;fixation (pression lexicale, mode, autres param&#232;tres pragmatiques). Deuxi&#232;mement, 
dans les paires comportant multi, c&#8217;est ce dernier qui a la pr&#233;f&#233;rence, ce qui est sans doute le 
reflet de sa forte productivit&#233; en fran&#231;ais. Cette m&#234;me tendance se retrouve dans la paire 
mono/uni, o&#249; le premier appara&#238;t comme pr&#233;dominant. Troisi&#232;mement, la quasi-absence 
d&#8217;alternance &#171; parfaite &#187; entre multi et poly montre bien la sp&#233;cificit&#233; de ce dernier pr&#233;fixe. En 
revanche, une alternance semble possible entre poly et pluri. 
</p>
<p>3.4 &#201;tude qualitative sur les paires d&#8217;alternance  
En classant ces paires alternantes en fonction de leur &#233;cart de fr&#233;quence, nous obtenons un 
&#233;chantillon de paires de mots o&#249; les deux formes sont quasiment aussi fr&#233;quentes (c&#8217;est la 
fen&#234;tre d&#8217;alternance parfaite du graphique ci-dessus). Il est donc particuli&#232;rement int&#233;ressant 
de regarder de plus pr&#232;s quel type de base permet la double pr&#233;fixation, sans montrer une 
pr&#233;f&#233;rence pour l&#8217;une ou pour l&#8217;autre des formes. A l&#8217;inverse, les groupes les plus 
&#171; extr&#234;mes &#187; contiennent des paires o&#249; l&#8217;existence d&#8217;une alternance entre deux formes rel&#232;ve 
davantage de l&#8217;accident, d&#251; &#224; l&#8217;extr&#234;me volatilit&#233; de la ressource textuelle utilis&#233;e. Par 
exemple, sur l&#8217;&#233;chelle m&#233;ga/maxi, &#224; l&#8217;extr&#233;mit&#233; de la pr&#233;f&#233;rence pour m&#233;ga, nous avons 
trouv&#233; la paire m&#233;gawatt (40500)/maxiwatt (41). Ces cas montrent une alternance entre une 
forme fortement lexicalis&#233;e, et une forme qui rel&#232;ve du jeu de mots, ou d&#8217;un nom propre. En 
les regardant de plus pr&#232;s, et en comparant syst&#233;matiquement leur contenu, nous pouvons 
extraire les caract&#233;ristiques qui semblent favoriser la pr&#233;fixation. 
</p>
<p>3.4.1 Alternance dans la classe des pr&#233;fixes de quantit&#233; 
En analysant la fen&#234;tre d&#8217;alternance &#171; parfaite &#187; des paires en multi/pluri et des paires 
pluri/poly, nous constatons une pr&#233;sence importante d&#8217;adjectifs, comme5 
multicommunaux/pluricommunaux (47/69), multicentenaire/pluricentenaire (1220/1410), 
plurisp&#233;cialis&#233;/polysp&#233;cialis&#233; (10/8), plurifonctionnel/polyfonctionnel (4710/3710) et 
quelques bases nominales, mais utilis&#233;es majoritairement comme adjectifs : 
multipathologie/pluripathologie (65/64), plurifonction/polyfonction (142/110) 
multifonds/plurifonds (712/577). La m&#234;me pr&#233;pond&#233;rance des adjectifs dans la fen&#234;tre 
d&#8217;alternance parfaite se retrouve pour la classe des pr&#233;fixes de quantit&#233; unique, par exemple 
monoconfessionnel/uniconfessionnel (49/66), mononational/uninational (281/255).  
A l&#8217;inverse, dans les fen&#234;tres &#171; extr&#234;mes &#187;, nous avons constat&#233; un grand nombre de bases 
nominales l&#224; o&#249; la pr&#233;f&#233;rence &#233;tait fortement marqu&#233;e pour la pr&#233;fixation en multi et en pluri, 
comme par exemple les paires multir&#233;cidivistes/plurir&#233;cidivistes (29 500/2), 
multicouche/pluricouche (109 000/3), plurith&#233;rapie/polyth&#233;rapie (325/3460), plurivaccination 
/polyvaccination (3/39). Il semblerait donc que la base adjectivale soit plus propice &#224; 
l&#8217;alternance dans le groupe des pr&#233;fixes de quantit&#233;. 
</p>
<p>3.4.2 Alternance dans la classe des pr&#233;fixes &#233;valuatifs  
Sur l&#8217;&#233;chelle super/hyper, dans les trois fen&#234;tres d&#8217;analyse (l&#8217;alternance parfaite et les deux 
extr&#234;mes) nous avons constat&#233; que le nombre de bases adjectivales &#233;tait tr&#232;s diff&#233;rent. En 
</p>
<p>                                                
</p>
<p>5
 Les nombres entre parenth&#232;ses indiquent la fr&#233;quence retourn&#233;e par Golf pour les deux formes. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Mesure de l&#8217;alternance entre pr&#233;fixes pour la g&#233;n&#233;ration en traduction automatique 
</p>
<p>effet, pour la fen&#234;tre o&#249; les formes en super sont les plus fr&#233;quentes, il n&#8217;y a que 10 % 
d&#8217;adjectifs, le reste &#233;tant compos&#233; de bases nominales, comme 
superproduction/hyperproduction (132000/13600), supercat&#233;gorie/hypercat&#233;gorie (256/19), 
superr&#233;gions/hyperr&#233;gions (81/6), superperformance/hyperperformance (2080/122). En 
revanche, parmi les paires &#171; alternantes &#187; et les paires privil&#233;giant la forme en hyper, les bases 
adjectivales repr&#233;sentent plus de la moiti&#233; des effectifs. 
Ce grand nombre de noms construits avec super est sans doute li&#233; au fait que ce pr&#233;fixe &#233;tait &#224; 
l&#8217;origine utilis&#233; dans des r&#232;gles de construction d&#8217;un sens &#171; locatif &#187; (que l&#8217;on ressent encore 
dans superstructure, par exemple), ce qui n&#8217;a jamais &#233;t&#233; le cas pour hyper. 
Ainsi, hyper semble favoriser les adjectifs, avec lesquels il peut parfois entrer en alternance 
avec super. En revanche, devant une base nominale, c&#8217;est avant tout super qui devrait &#234;tre 
favoris&#233;. En revanche, l&#8217;&#233;chelle d&#8217;alternance m&#233;ga/maxi ne nous apporte pas de tendance aussi 
affirm&#233;e que pour les pr&#233;fixes pr&#233;c&#233;dents. 
</p>
<p>4 Quelles contraintes pour la g&#233;n&#233;ration automatique ? 
De l&#8217;&#233;tude de ces fen&#234;tres, nous avons mis &#224; jour un certain nombre de contraintes, qui, si 
elles ne sont pas forc&#233;ment &#171; morphologiques &#187;, t&#233;moignent en tout cas d&#8217;une certaine 
pr&#233;f&#233;rence dans la formation des mots nouveaux. Ainsi, pour g&#233;n&#233;rer une forme nominale de 
pluralit&#233; ind&#233;termin&#233;e, nous favorisons l&#8217;emploi de multi, alors que pour g&#233;n&#233;rer des formes 
adjectivales de cette m&#234;me classe, nous maintenons la possibilit&#233; de g&#233;n&#233;rer les trois formes 
possibles, comme le montrent les deux r&#232;gles ci-dessous : 
</p>
<p>IT : RCLPLUR_INDET [X]N&#8594; multi|pluri|poli[X]N &#8594; FR : RCLPLUR_INDET [Y]N &#8594; multi [Y]N 
IT : RCLPLUR_INDET [X]A&#8594; multi|pluri|poli[X]A &#8594; FR : RCLPLUR_INDET [Y]A &#8594; multi/pluri/poly [Y]A 
Pour les pr&#233;fixes &#233;valuatifs, nous avons mis &#224; jour la forte tendance &#224; la s&#233;lection de super 
pour les bases nominales, sans doute &#224; cause de l&#8217;origine s&#233;mantique de ce pr&#233;fixe. Il sera 
alors plus s&#251;r que les bases nominales des pr&#233;fixations &#233;valuatives soient toujours construites 
avec super en fran&#231;ais. Pour les bases adjectivales en revanche, les deux pr&#233;fixes semblent 
possibles, et il convient alors de maintenir les deux possibilit&#233;s : 
</p>
<p>IT : RCLQUAL+ [X]N&#8594; super|iper[X]N &#8594; FR : RCLQUAL+ [Y]N &#8594; super [Y]N 
IT : RCLQUAL+ [X]A&#8594; super|iper[X]A &#8594; FR : RCLQUAL+ [Y]A &#8594; super/hyper [Y]A 
Enfin, maintenant que nous avons &#233;valu&#233; la possibilit&#233; de l&#8217;alternance, nous connaissons les 
cas o&#249; elle est r&#233;ellement possible et o&#249; les deux formes peuvent &#234;tre g&#233;n&#233;r&#233;es sans risque 
d&#8217;erreur. Nous pouvons &#224; pr&#233;sent envisager soit de laisser pour l&#8217;&#233;tape de post-&#233;dition le choix 
entre les deux formes, soit d&#8217;utiliser des m&#233;thodes de s&#233;lection plus &#171; simples &#187; (bas&#233;es sur 
des indices de productivit&#233; ou des principes de cognaticit&#233;) mais d&#233;sormais sans prendre le 
risque de g&#233;n&#233;rer une mauvaise traduction. 
</p>
<p>Conclusion et discussion  
L&#8217;interchangeabilit&#233; potentielle entre affixes est un vrai d&#233;fi pour la g&#233;n&#233;ration automatique 
de n&#233;ologismes construits. L&#8217;&#233;tude extensive des constructions morphologiques sur de larges 
ressources textuelles nous a permis de rendre compte de l&#8217;ampleur de cette interchangeabilit&#233; 
et nous a permis d&#8217;individualiser certaines tendances. La connaissance de ces derni&#232;res permet 
de faire une &#171; s&#233;lection &#187; pour g&#233;n&#233;rer un n&#233;ologisme construit. Ce genre d&#8217;&#233;tude permet </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Bruno Cartoni 
</p>
<p>&#233;galement d&#8217;am&#233;liorer les connaissances sur certaines r&#232;gles de pr&#233;fixation morphologique, et 
de confirmer certaines assertions th&#233;oriques. 
</p>
<p>En outre, la m&#233;thodologie propos&#233;e pour les besoins de notre projet de traduction automatique 
pourrait &#234;tre r&#233;employ&#233;e pour d&#8217;autres &#233;tudes sur l&#8217;alternance. En effet, &#233;tant donn&#233; qu&#8217;elle est 
bas&#233;e sur des mots &#171; possibles &#187; issus de mots construits dans une autre langue proche, elle 
permet de travailler sur des donn&#233;es beaucoup plus restreintes que si l&#8217;on envisageait tous les 
mots possiblement pr&#233;fixables avec ces pr&#233;fixes. De plus, si une telle m&#233;thode fournit des 
informations avant tout sur les fr&#233;quences d&#8217;utilisation, elle laisse &#233;galement entrevoir 
certaines tendances de productivit&#233;. 
</p>
<p>R&#233;f&#233;rences 
AMIOT D. (2005). Plusieurs vs poly-, pluri- et multi- La quantification c&#244;t&#233; d&#233;terminants et 
c&#244;t&#233; pr&#233;fixes. N. Flaux et D. Amiot, Artois Presse Universit&#233;. 
BAAYEN H. et LIEBER R (1991) Productivity and English derivation Linguistics 29(5), 801-43. 
BARONI, M., BERNARDINI S, COMASTRI F, PICCIONI L., VOLPI A., ASTON G. MAZZOLENI M, 
(2004). Introducing the &quot;la Repubblica&quot; corpus: A large, annotated, TEI(XML)-compliant 
corpus of newspaper Italian. Actes de LREC 2004 Lisbon. 1771-1774. 
BOUILLON P., LEHMANN S, MANZI S., PETITPIERRE D. (1998). D&#233;veloppement de lexiques &#224; 
grande &#233;chelle. Actes du Colloque des journ&#233;es LTT de TUNIS, Tunis, 71-80 
CARTONI B. (2005). Traduction de r&#232;gles de construction des mots pour r&#233;soudre les 
probl&#232;mes d'incompl&#233;tude lexicale en traduction automatique : &#201;tude de cas. Actes de  
RECITAL 2005, Dourdan, Atala. 565-574. 
FRADIN B. (2003) Nouvelles approches en morphologies. Paris, Puf. 
HATHOUT N., NAMER F., PLENAT M., TANGUY L. (&#224; para&#238;tre). La collecte et l'utilisation des 
donn&#233;es en morphologie. Aper&#231;us de morphologie du fran&#231;ais. B. Fradin, F. Kerleroux et 
M. Pl&#233;nat (&#233;d.), Presses Universitaires de Vincennes. 
HATHOUT N., PLENAT M, TANGUY L. (2003) Enqu&#234;te sur les d&#233;riv&#233;s en -able Cahiers de 
Grammaire 28 49-90. 
MONTERMINI, F. (&#224; para&#238;tre). La pr&#233;fixation &#233;valuative. Aper&#231;us de morphologie du fran&#231;ais. 
K. F. Fradin B., Pl&#233;nat M. Vincennes, Puv. 
THOMAS C. (2008). Google Online Lexical Frequencies User Manual (Version 0.9.0) 
http://www.craigthomas.ca/docs/golf-0.9.0-manual.pdf, consult&#233; 04.02.2008 
 
</p>
<p> </p>

</div></div>
</body></html>