<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements en fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2008, Avignon, 9&#8211;13 juin 2008
</p>
<p>Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements en
fran&#231;ais
</p>
<p>Gabriel Parent1 Michel Gagnon1 Philippe Muller2
(1) &#201;cole Polytechnique de Montr&#233;al
(2) Universit&#233; Paul-Sabatier, Toulouse
</p>
<p>R&#233;sum&#233;. Dans cet article, nous proposons une m&#233;thode pour identifier, dans un texte en
fran&#231;ais, l&#8217;ensemble des expressions adverbiales de localisation temporelle, ainsi que tous les
verbes, noms et adjectifs d&#233;notant une &#233;ventualit&#233; (&#233;v&#233;nement ou &#233;tat). Cette m&#233;thode, en plus
d&#8217;identifier ces expressions, extrait certaines informations s&#233;mantiques : la valeur de la loca-
lisation temporelle selon la norme TimeML et le type des &#233;ventualit&#233;s. Pour les expressions
adverbiales de localisation temporelle, nous utilisons une cascade d&#8217;automates, alors que pour
l&#8217;identification des &#233;v&#233;nements et &#233;tats nous avons recours &#224; une analyse compl&#232;te de la phrase.
Nos r&#233;sultats sont proches de travaux comparables sur l&#8217;anglais, en l&#8217;absence d&#8217;&#233;valuation quan-
titative similaire sur le fran&#231;ais.
</p>
<p>Abstract. We propose a method to extract expressions of temporal location in French
texts, and all verbs, nouns and adjectived that denote an event or a state. This method also com-
putes some semantic information : the value of the temporal location according to the TimeML
standard and the types of eventualities. For temporal location expression, we use a cascade of
transducers, wheras event identification is based on full syntactic parsing. Our result are com-
pared to similar work on English, as no other empirical evaluation has been done on French
before.
</p>
<p>Mots-cl&#233;s : Extraction d&#8217;informations temporelle, TimeML.
Keywords: Temporal information extraction, TimeML.
</p>
<p>1 Introduction
</p>
<p>Le probl&#232;me de l&#8217;extraction d&#8217;informations &#224; partir de donn&#233;es textuelles re&#231;oit depuis quelques
ann&#233;es une tr&#232;s grande attention. Il inclut g&#233;n&#233;ralement plusieurs &#233;tapes, dont la reconnais-
sance d&#8217;entit&#233;s et d&#8217;&#233;v&#233;nements dans lesquelles elles sont impliqu&#233;es, ainsi que les informations
temporelles, spatiales et autres qui peuvent leur &#234;tre rattach&#233;es. Mais bien que le probl&#232;me de
l&#8217;identification des entit&#233;s nomm&#233;es soit relativement bien compris (Nadeau &amp; Sekine, 2007),
l&#8217;identification d&#8217;&#233;v&#233;nements et de leurs relations temporelles demeure un probl&#232;me qui est loin
d&#8217;&#234;tre r&#233;solu. Or, que ce soit pour les applications de r&#233;ponses &#224; des questions, ou la simple re-
cherche d&#8217;information, on est souvent appel&#233; &#224; rechercher ou annoter dans les documents les
&#233;l&#233;ments qui nous permettent de r&#233;pondre &#224; des questions de la forme suivante : Quand un cer-
tain &#233;v&#233;nement a-t-il eu lieu ? Que s&#8217;est-il pass&#233; pendant une certaine p&#233;riode de temps donn&#233;e ?
Dans quels &#233;v&#233;nements une personne a-t-elle &#233;t&#233; impliqu&#233;e ?</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gabriel Parent, Michel Gagnon, Philippe Muller
</p>
<p>Pour donner une id&#233;e, environ 15% des questions pos&#233;es dans le cadre des campagnes CLEF
portent sur des informations temporelles. Ce nombre est &#224; peu pr&#232;s similaire dans les instances
des campagnes sur l&#8217;inf&#233;rence textuelle (RTE). Dans les campagnes d&#8217;&#233;valuation de r&#233;sum&#233;
automatique (DUC), nous avons d&#233;nombr&#233; 30% environ de phrases contenant un adverbial
temporel, &#224; la fois dans les textes et les r&#233;sum&#233;s de r&#233;f&#233;rence, ce qui montre l&#8217;importance de
cette information dans la structuration et la coh&#233;rence d&#8217;un texte.
</p>
<p>Pour arriver &#224; capturer cette information, il faut &#233;videmment &#234;tre capable d&#8217;analyser les do-
cuments afin d&#8217;en extraire la structure temporelle. Cette t&#226;che exige une analyse aux niveaux
syntaxique, s&#233;mantique et discursif. Au niveau syntaxique, il faut reconna&#238;tre les diff&#233;rentes
formes d&#8217;expressions adverbiales temporelles que l&#8217;on peut rencontrer dans un texte : demain,
hier, la semaine prochaine, deux jours apr&#232;s son d&#233;part, le 8 janvier &#224; 8h00, depuis le 4 avril,
etc. Il faut aussi reconna&#238;tre les diff&#233;rentes occurrences d&#8217;&#233;ventualit&#233;s1, qui peuvent &#234;tre expri-
m&#233;s sous forme verbale, nominale ou adjectivale :
</p>
<p>(1) a. Secou&#233;s par une violente secousse d&#8217;une magnitude de 5,8 sur l&#8217;&#233;chelle de Richter
jeudi &#224; 03 h 15 (02 h 15 GMT), les Alg&#233;rois sont descendus nombreux jeudi soir dans
les rues d&#8217;Alger, a constat&#233; l&#8217;AFP.
</p>
<p>b. Le conflit a commenc&#233; le mois dernier.
</p>
<p>En plus de rep&#233;rer les expressions pertinentes, il faut aussi distinguer les formes qui ne repr&#233;-
sentent pas une localisation temporelle ou une &#233;ventualit&#233; &#224; extraire :
</p>
<p>(2) a. Jean est un chauffeur du dimanche.
b. Jean, 20 ans, est le plus jeune joueur de l&#8217;&#233;quipe.
c. Il est d&#233;conseill&#233; de regarder la t&#233;l&#233;vision durant de longues heures.
d. Jean est intelligent.
e. Jean a retir&#233; son annonce.
</p>
<p>Dans les deux premiers exemples, on retrouve des expressions qui dans d&#8217;autres contextes pour-
raient d&#233;noter une localisation temporelle ou une dur&#233;e, mais qui dans ce cas jouent plut&#244;t le
r&#244;le d&#8217;un &#233;pith&#232;te. Dans l&#8217;exemple suivant, le verbe regarder r&#233;f&#232;re &#224; une activit&#233; g&#233;n&#233;rique
plut&#244;t qu&#8217;&#224; un &#233;v&#233;nement sp&#233;cifique. La phrase 2d, quant &#224; elle, nous r&#233;v&#232;le une caract&#233;ris-
tique permanente de Jean, plut&#244;t que d&#8217;exprimer un &#233;tat temporaire. Finalement, dans le dernier
exemple, on retrouve un nom qui, dans certains contextes, pourrait &#234;tre vu comme un &#233;v&#233;ne-
ment (comme dans L&#8217;annonce de sa victoire a &#233;t&#233; faite tard hier soir), mais qui dans ce cas est
plut&#244;t un objet.
Pour l&#8217;identification des expressions adverbiales temporelles, nous verrons qu&#8217;une m&#233;thode ba-
s&#233;e sur une cascade d&#8217;automates est suffisante, &#233;tant donn&#233; la nature locale des informations
n&#233;cessaires pour les identifier. L&#8217;identification des &#233;v&#233;nements implique par contre de faire ap-
pel &#224; une analyse syntaxique, combin&#233;e &#224; des r&#232;gles lexico-s&#233;mantiques. Dans l&#8217;exemple 2c, on
doit savoir que le verbe regarder, compl&#233;ment du verbe d&#233;conseill&#233;, ne doit pas &#234;tre annot&#233; pui-
seque la s&#233;mantique du verbe principal n&#8217;implique que l&#8217;action a t&#233;t&#233; r&#233;alis&#233;e. Dans l&#8217;exemple
1b, on d&#233;tecte que conflit r&#233;f&#232;re &#224; un &#233;v&#233;nement, parce qu&#8217;il est le sujet du verbe a commenc&#233;,
soit un verbe qui, par son aspect, implique que son sujet soit un &#233;v&#233;nement non ponctuel. On
voit aussi que certaines informations lexicales doivent &#234;tre utilis&#233;es.
</p>
<p>1Nous regroupons sous le vocable &#233;ventualit&#233; tout &#233;v&#233;nement ou &#233;tat.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements
</p>
<p>Nous verrons, dans la section qui suit, que quelques solutions pour r&#233;soudre ce probl&#232;me ont
&#233;t&#233; propos&#233;es pour les textes en anglais. Pour le fran&#231;ais, &#224; notre connaissance, nous sommes
les seuls &#224; avoir abord&#233; ce probl&#232;me en suivant une m&#233;thodologie comparable. Suivent une
pr&#233;sentation de nos m&#233;thodes pour l&#8217;identification des expressions de localisation temporelle,
dans un premier temps, puis l&#8217;identification des termes qui r&#233;f&#232;rent &#224; des &#233;v&#233;nements ou des
&#233;tats. Pour chacune, nous pr&#233;sentons une d&#233;marche d&#8217;&#233;valuation et des r&#233;sultats. Finalement,
nous &#233;valuons le potentiel des approches propos&#233;es.
</p>
<p>2 Travaux reli&#233;s
</p>
<p>La d&#233;tection d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements a suscit&#233; un certain nombres de tra-
vaux, pour l&#8217;essentiel restreints &#224; l&#8217;anglais dans le cadre des campagnes MUC ou ACE (avec
r&#233;cemment l&#8217;introduction de la t&#226;che sur le chinois et l&#8217;espagnol)2, et &#224; l&#8217;int&#233;rieur du groupe
de travail pr&#233;parant la norme TimeML (Pustejovsky et al., 2005) (avec des exceptions rares sur
l&#8217;allemand et l&#8217;italien)3. Si en fran&#231;ais on peut citer les travaux de (Bernard &amp; Maurel, 1993;
Molin&#232;s, 1989) sur l&#8217;interpr&#233;tation des adverbiaux temporels, il n&#8217;existe pas de travaux r&#233;cents
ayant la couverture des travaux sur l&#8217;anglais ou avec des validations empiriques comparables.
Le travail initi&#233; dans (Muller &amp; Tannier, 2004) avait l&#8217;ambition de se placer dans un cadre com-
plet similaire &#224; TimeML, mais la quantit&#233; de donn&#233;es concern&#233;es &#233;tait alors assez faible. Nous
pr&#233;sentons ici la suite de ce travail, restreint au rep&#233;rage des adverbiaux temporels (et au calcul
de leur r&#233;f&#233;rence selon la norme TimeML) et aux &#233;v&#233;nements.
A l&#8217;int&#233;rieur des travaux similaires sur l&#8217;anglais on peut distinguer deux types d&#8217;approches : des
approches &#224; base de r&#232;gles de pattern-matching de complexit&#233; variable, &#233;crites &#8220;manuellement&#8221;
(Mani &amp; Wilson, 2000; Mazur &amp; Dale, 2007) ou bien des approches &#224; base d&#8217;apprentissage au-
tomatique, qui int&#232;grent presque toujours une analyse syntaxique partielle (du simple &#233;tiquetage
morpho-syntaxique &#224; du chunking plus ou moins &#233;labor&#233;), cf notamment (Boguraev &amp; Ando,
2005). Dans ce cadre le probl&#232;me de d&#233;tection est ramen&#233; &#224; une classification de type IOB (In-
Out-Boudary) o&#249; chaque item lexical est classifi&#233; comme &#224; l&#8217;int&#233;rieur (I), &#224; l&#8217;ext&#233;rieur (O) ou
d&#233;limitant une fronti&#232;re (B) d&#8217;une expression temporelle (&#233;v&#233;nement ou adverbial), &#233;ventuel-
lement avec un niveau d&#8217;imbrication interne (Hacioglu et al., 2005). Le calcul des r&#233;f&#233;rences
temporelles est alors fait par des r&#232;gles lexicales ad hoc, &#224; l&#8217;exception de (Baldwin, 2002) qui
tente de g&#233;n&#233;raliser aussi l&#8217;interpr&#233;tation &#224; base d&#8217;apprentissage, avec des r&#233;sultats plus mitig&#233;s.
</p>
<p>La reconnaissance d&#8217;adverbiaux temporels obtient g&#233;n&#233;ralement des scores comparables avec
les deux m&#233;thodes, avec des F-scores voisins de 80-85% pour la d&#233;tection et le calcul de r&#233;f&#233;-
rence, selon la mani&#232;re de compter (cf section 4) et les normes (Timex2 pour Ace, Timex3 pour
TimeML). En particulier, les travaux de (Negri &amp; Marseglia, 2004), (Mani &amp; Wilson, 2000) et
(Mazur &amp; Dale, 2007) montrent bien qu&#8217;on peut esp&#233;rer de bon r&#233;sultats avec un syst&#232;me bas&#233;
sur un ensemble de r&#232;gles, semblable &#224; ce que nous proposons ici.
</p>
<p>Le syst&#232;me EVITA (Saur&#237; et al., 2005), qui utilise une analyse partielle des phrases, un syst&#232;me
de patrons lexicaux-syntaxiques et Wordnet. obtient un taux de pr&#233;cision de 74% pour le clas-
sement des &#233;v&#233;nements et un rappel de 87%, mais il est &#224; noter que ces r&#233;sultats ne sont pas
obtenus avec un corpus d&#8217;&#233;valuation ind&#233;pendant du corpus d&#8217;entra&#238;nement. Les r&#233;sultats d&#8217;&#233;va-
luations ne sont pas tr&#232;s d&#233;taill&#233;s. Notamment, on ne conna&#238;t pas le nombre total d&#8217;occurrences
</p>
<p>2http://www.nist.gov/speech/tests/ace/ace07/.
3http://www.timeml.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gabriel Parent, Michel Gagnon, Philippe Muller
</p>
<p>et les performances pour chaque type d&#8217;expression reconnue (noms, verbes, adjectifs). Il est
int&#233;ressant de comparer ce travail avec le syst&#232;me STEP (Bethard &amp; Martin, 2006), enti&#232;rement
bas&#233; sur de l&#8217;apprentissage automatique, utilisant le m&#234;me corpus d&#8217;entra&#238;nement et des traits
syntaxiques incluant ceux d&#8217;EVITA. En termes de pr&#233;cision et de rappel, les r&#233;sultats obtenus
avec l&#8217;ensemble total de caract&#233;ristiques est l&#233;g&#232;rement sup&#233;rieur &#224; ceux obtenus en n&#8217;utili-
sant que le sous-ensemble des traits pris par EVITA. Dans la litt&#233;rature, on retrouve d&#8217;autres
approches qui visent &#224; identifier les &#233;v&#233;nements cit&#233;s dans un texte, mais aucune de celles-ci
n&#8217;aborde le probl&#232;me de mani&#232;re aussi compl&#232;te que les deux syst&#232;mes que nous venons de
citer.
</p>
<p>L&#8217;id&#233;e d&#8217;utiliser une analyse syntaxique pour l&#8217;identification d&#8217;&#233;v&#233;nements n&#8217;est pas nouvelle.
Dans un contexte d&#8217;extraction d&#8217;informations, (Madhyastha et al., 2003) ont utilis&#233; une gram-
maire de d&#233;pendance (Sleator &amp; Temperley, 1991) pour identifier les contextes syntaxiques des
&#233;v&#233;nements recherch&#233;s. Similairement, (Yakushiji et al., 2001) se servent d&#8217;une analyse syn-
taxique compl&#232;te de la phrase pour ramener la recherche d&#8217;information &#224; une recherche dans un
ensemble limit&#233; de formes syntaxiques canoniques. Mais dans les deux cas, il s&#8217;agit d&#8217;une m&#233;-
thode appliqu&#233;e &#224; un domaine restreint et dont le but n&#8217;est pas d&#8217;identifier les &#233;v&#233;nements d&#8217;un
texte, mais plut&#244;t l&#8217;extraction d&#8217;informations relatives &#224; un ensemble d&#8217;&#233;v&#233;nements pr&#233;-d&#233;finis.
</p>
<p>3 La norme TimeML
</p>
<p>La norme TimeML est le fruit d&#8217;un groupe de travail dirig&#233; par James Pustejovsky (Pustejovsky
et al., 2005) qui vise &#224; standardiser les annotations s&#233;mantiques reli&#233;es &#224; la temporalit&#233; dans
un texte en langage naturel. Le guide d&#8217;annotation est tourn&#233;e vers l&#8217;anglais, mais les &#233;l&#233;ments
du standard sont a priori ind&#233;pendants de la langue consid&#233;r&#233;e. La norme traite de trois sortes
d&#8217;entit&#233;s annotables : les adverbiaux (objet TIMEX3), les &#233;ventualit&#233;s (EVENT), et les signaux
(SIGNAL) ; elle introduit aussi plusieurs sortes de relations entre ces entit&#233;s : liens d&#8217;ordonnan-
cement (TLINK), de modalit&#233; (SLINK), ou bien aspectuels (ALINK), couvrant ainsi l&#8217;essentiel
des informations temporelles que l&#8217;on peut associer &#224; un texte.
</p>
<p>Les TIMEX ont plusieurs attributs, comme le type (date, heure, dur&#233;e), la valeur absolue corres-
pondant &#224; la localisation temporelle, le temps d&#8217;ancrage, pour les localisations qui sont calcul&#233;es
relativement &#224; une autre (deux jours apr&#232;s son d&#233;part) et la quantit&#233; ou la fr&#233;quence, pour des
localisations qui correspondent &#224; plus d&#8217;un moment dans le temps (tous les jeudi d&#8217;avril). Les
&#233;ventualit&#233;s ont pour attribut une classe parmi : occurrence (la plupart des &#233;v&#233;nements), &#233;tat,
action ou &#233;tat intensionnel (ceux-ci, comme dans je voudrais qu&#8217;il vienne, supposent un second
&#233;v&#233;nement qui ne se r&#233;alise pas n&#233;cessairement), action d&#8217;&#233;nonciation ou de perception (dire,
r&#233;v&#233;ler, entendre, voir, etc.) et finalement les &#233;v&#233;nements aspectuels (commencer, finir de, conti-
nuer, etc.). Les autres attributs sont principalement : le temps grammatical, l&#8217;aspect progressif
ou non (s&#8217;il est d&#233;terminable), la forme (nom, verbe, adjectif). Finalement, la balise &lt;SIGNAL&gt;
sert &#224; identifier un item (g&#233;n&#233;ralement une pr&#233;position) marquant une relation temporelle entre
&#233;v&#233;nements et localisations temporelles : Il viendra apr&#232;s le 3 avril.
Nous nous concentrons ici sur les entit&#233;s &#224; rep&#233;rer, les relations qu&#8217;elles entretiennent &#233;tant un
probl&#232;me &#224; part.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements
</p>
<p>4 L&#8217;identification des expressions de localisation temporelle
</p>
<p>La d&#233;tection d&#8217;expressions de localisation temporelle est ici focalis&#233;e sur l&#8217;identification des
expressions correspondant &#224; la norme TimeML, qui en distingue trois types : les dates, les
&quot;temps&quot; (comme dans &#8217;&#224; trois heures&#8217;) et les dur&#233;es. Cette &#233;tape inclut &#233;galement le calcul de la
r&#233;f&#233;rence temporelle suivant la norme ISO modifi&#233;e par la norme TimeML4, ainsi que certains
attributs suppl&#233;mentaires (par exemple des classes de modifieurs, comme &quot;environ&quot;, etc). Nous
avons ajout&#233; quelques attributs pertinents pour les t&#226;ches en aval de cette reconnaissance (calcul
des r&#233;f&#233;rents des dates et liens avec les &#233;v&#233;nements), qui permettent notamment d&#8217;introduire la
notion de perspective temporelle, nous inspirant des travaux de (Molin&#232;s, 1989). Nous faisons
donc la distinction entre une perspective absolue, d&#233;ictique car relative au temps d&#8217;&#233;nonciation
(TE), ou anaphorique car relative &#224; un point de perspective temporel ou focus temporel (FT).
Cela permet de s&#233;parer les cas suivants :
</p>
<p>&#8211; date relative au TE : il y a 2 ans, l&#8217;ann&#233;e derni&#232;re.
&#8211; dates relatives au FT : 3 jours plus tard, le mois suivant.
&#8211; il reste des dates ambigu&#235;s TE/FT : le 25 mars, en juin.
&#8211; dur&#233;es avec ancrage relatif au TE : depuis un an.
&#8211; dur&#233;es avec ancrage relatif au FT : depuis.
</p>
<p>Nous avons &#233;galement constitu&#233; un lexique des &#233;l&#233;ments pertinents pour le temps (environ
120), associant un ensemble de traits qui instancie directement une ou des valeurs d&#233;finies par
la norme TimeML ou qui pr&#233;parent leur calcul. Par exemple :
</p>
<p>&#8211; matin : [unit&#233;:h valeur:MO] (unit&#233; ISO concern&#233;e : heures, valeur : morning)
&#8211; environ : [mod:approx]
&#8211; janvier : [unit&#233;:m val:1] (unit&#233; ISO concern&#233;e : mois )
Le traitement de cette &#233;tape est constitu&#233; d&#8217;un pipe-line utilisant un tokeniseur, un &#233;tiqueteur
morpho-syntaxique (le Treetagger de (Schmid, 1994)), certains post-traitements pour isoler les
&#233;l&#233;ments lexicaux pertinents ou corriger des erreurs de l&#8217;&#233;tiqueteur, puis une cascade d&#8217;auto-
mates effectuant une analyse syntaxique superficielle (en utilisant le Cass de (Abney, 1996))
&#224; base d&#8217;environ 90 r&#232;gles s&#233;par&#233;es en une cascade de 20 niveaux5. La structure syntaxique
superficielle fournissait auparavant l&#8217;essentiel des informations syntaxiques n&#233;cessaires en aval
(Muller &amp; Tannier, 2004) mais est maintenant corrig&#233;e par le niveau suivant avec un analyseur
plus complet, qui reprend uniquement les structures adverbiales d&#233;tect&#233;es ici. Nous n&#8217;avons
pour l&#8217;instant gard&#233; cette analyse plus locale que pour le calcul de la r&#233;f&#233;rence temporelle (date
exacte) quand celle-ci est ambigu&#235; ou n&#233;cessite le contexte pour &#234;tre interpr&#233;t&#233;e. La derni&#232;re
&#233;tape du traitement consiste &#224; calculer l&#8217;attribut &quot;val&quot; de TimeML qui est une normalisation de
la r&#233;f&#233;rence temporelle pour les dates, heures et dur&#233;es, &#224; partir de l&#8217;analyse pr&#233;c&#233;dente. Les
dates pouvant poser probl&#232;me se r&#233;partissent dans les deux classes TE/FT :
</p>
<p>&#8211; par rapport &#224; la date de la d&#233;p&#234;che : &quot;Les deux pr&#233;sidents se rencontrent mardi&quot;
&#8211; par rapport &#224; un point de perspective : &quot;Les deux hommes se sont d&#233;j&#224; vus deux jours avant&quot;
Nous pr&#233;sentons ci-dessous les r&#233;sultats obtenus &#224; la fois sur le corpus d&#8217;&#233;tude (une vingtaine
de d&#233;p&#234;ches AFP), et sur le corpus de test, obtenu par mise &#224; jour du corpus de (Baldwin, 2002),
qui utilisait une norme pr&#233;c&#233;dente (Timex2, issu de la campagne ACE). Celui-ci &#233;tait constitu&#233;
de 45 d&#233;p&#234;ches AFP. La colonne &quot;app&quot; indique de fa&#231;on similaire &#224; la campagne ACE le nombre
</p>
<p>4Cf aussi le groupe ISO TC37/4 sur la gestion de resources linguistiques.
5Tous ces outils sont disponibles sur demande.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gabriel Parent, Michel Gagnon, Philippe Muller
</p>
<p>d&#8217;adverbiaux d&#233;tect&#233;s mais dont l&#8217;&#233;tendue est incompl&#232;te (par exemple &quot;vingt-quatre heures&quot;
pour &quot;les derni&#232;res vingt-quatre heures&quot; ou &quot;un mois&quot; pour &quot;un mois et demi&quot;). La colonne
&quot;corrects&quot; indique les valeurs exactement trouv&#233;es.
</p>
<p>Humain Trouv&#233;s App. Corrects Valeurs correctes
nombre 233 222 216 207 119
</p>
<p>pr&#233;cision 0,97 0,93 0,77
rappel 0,93 0,93 0,72
</p>
<p>f_score 0,95 0,93 0,74
Humain Trouv&#233;s Apps Corrects Valeurs correctes
</p>
<p>nombre 544 518 485 432 244
precision 0,93 0,83 0,56
</p>
<p>rappel 0,89 0,79 0,45
f_score 0,91 0,81 0,5
</p>
<p>TAB. 1 &#8211; R&#233;sultats pour les entit&#233;s Timex3 sur corpus d&#8217;&#233;tude (haut) et de test (bas).
</p>
<p>Nous voyons ici qu&#8217;avec un jeu de r&#232;gles assez simples et une &#233;tude sur un corpus r&#233;duit, nous
arrivons &#224; une couverture d&#233;j&#224; assez large en g&#233;n&#233;ralisation (du moins sur ce genre particulier),
avec des r&#233;sultats aussi bons que les travaux sur l&#8217;anglais. La plupart des expressions man-
qu&#233;es sont des constructions non pr&#233;vues, les erreurs des confusions entre &#226;ge et p&#233;riode (M.
Rimbaud, 17 ans vs. 100 ans de solitude), des nombres pris pour des ann&#233;es, et des erreurs d&#8217;an-
notation manuelle. Les valeurs &quot;erron&#233;es&quot; sont la plupart du temps juste sous-sp&#233;cifi&#233;es. Nous
pr&#233;sentons aussi parmi les valeurs le cas des dates incompl&#232;tes (cf ci-dessus) qui n&#233;cessitent
une interpr&#233;tation contextuelle (le cas des autres dates &#233;tant plus facile) :
</p>
<p>corpus d&#8217;&#233;tude de test Score total
/TE 42/50 103/140 0.76
/FT 11/19 39/77 0.52
</p>
<p>Score total 0.77 0.65 0.68
</p>
<p>TAB. 2 &#8211; Proportion des dates incompl&#232;tes bien reconnues.
</p>
<p>A partir de l&#224; nous avons &#233;tendu et continuerons &#224; &#233;tendre le corpus de r&#233;f&#233;rence en int&#233;grant
d&#8217;autres genres : biographies (une vingtaine pour l&#8217;instant), textes historiques, juridiques. Nous
avons pour l&#8217;instant 96 textes annot&#233;s pour 40.000 tokens et 1220 expressions Timex3. En com-
paraison, TimeBank1.2, le corpus de r&#233;f&#233;rence de TimeML pour l&#8217;anglais comprend 183 textes
pour 60.000 tokens et 1400 expressions environ. Nous ne pr&#233;sentons pas les r&#233;sultats (meilleurs)
de la d&#233;tection sur ce corpus en cours de construction car il m&#233;lange les genres de fa&#231;on d&#233;s-
&#233;quilibr&#233;e pour l&#8217;instant. De plus les biographies dopent les scores un peu artificiellement car
les dates sont beaucoup plus contraintes et plus faciles &#224; calculer.
</p>
<p>5 Identification des &#233;v&#233;nements
</p>
<p>Contrairement &#224; la plupart des approches d&#233;j&#224; existantes, notre module de reconnaissance des
&#233;v&#233;nements ne se limite pas &#224; extraire le contexte local pour l&#8217;annotation des &#233;v&#233;nements. L&#8217;ana-
lyse syntaxique compl&#232;te de la phrase est utilis&#233;e pour l&#8217;&#233;laboration de r&#232;gles d&#8217;annotation.
Nous utilisons un analyseur syntaxique robuste, soit celui qui est au coeur du Correcteur 101TM,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements
</p>
<p>un corecteur gramatical tr&#232;s performant d&#233;velopp&#233; par Machina Sapiens Inc. Cet analyseur pro-
duit un arbre de d&#233;pendance qui est fourni en entr&#233;e &#224; notre syst&#232;me. Dans un deuxi&#232;me temps,
les &#233;tiquettes TIMEX3 qui ont &#233;t&#233; cr&#233;&#233;es par le module d&#233;crit pr&#233;c&#233;demment sont ajout&#233;es &#224;
l&#8217;arbre de d&#233;pendance : chaque noeud de l&#8217;arbre correspondant &#224; un mot se trouvant dans la
port&#233;e d&#8217;une balise TIMEX3 se voit associer une r&#233;f&#233;rence &#224; cette annotation.
</p>
<p>La t&#226;che d&#8217;annotation temporelle est naturellement divis&#233;e en trois &#233;tapes qui correspondent aux
diff&#233;rentes cat&#233;gories lexicales : verbes, noms et adjectifs. Des strat&#233;gies diff&#233;rentes ont &#233;t&#233; &#233;ta-
blies pour chaque cat&#233;gorie tout en s&#8217;appuyant sur le m&#234;me principe : les patrons-actions. Ces
patrons-actions sont les constituants de base de notre syst&#232;me d&#8217;annotation et sont au nombre
de 80. Parmi ce nombre, 31 utilisent l&#8217;information syntaxique, soit le nom de la relation entre le
noeud et son parent (e.g. &#201;pith&#232;te, Attribut, RelativeQui). L&#8217;annotation des arbres syntaxiques
s&#8217;effectue donc par une cascade de 6 ensembles de patrons-actions, dont 3 ensembles sp&#233;ci-
fiques pour les trois cat&#233;gories lexicales d&#8217;&#233;v&#233;nements.
</p>
<p>Un patron-action (PA) est constitu&#233; avant tout d&#8217;un segment d&#8217;arbre syntaxique, potentiellement
sous-d&#233;fini, qui sera utilis&#233; pour trouver les occurrences de ce patron dans le texte analys&#233;. Dans
un patron-action, les attributs d&#8217;un noeud syntaxique sont entre crochets (&#8217;[&#8217;,&#8217;]&#8217;) ; on explicite
ses enfants en les mettant entre parenth&#232;ses. On mentionne la relation entre les noeuds tout juste
apr&#232;s une paranth&#232;se ouvrante. Par exemple, si on souhaite constuire un patron qui couvre tous
les noeuds de cat&#233;gorie lexicale &#171;verbe&#187; poss&#233;dant un fils avec lequel il est li&#233; par la relation
&#171;Sujet&#187; et de cat&#233;gorie lexicale &#171;pronom&#187;, le patron suivant est utilis&#233; :
</p>
<p>( [cat&#233;gorieLexicale = verbe] ( SUJET [cat&#233;gorieLexicale = pronom ] ) )
La liste des attributs pouvant &#234;tre utilis&#233;s est facilement extensible : pour notre part, nous uti-
lisons 10 attributs tels que &#171;lemme&#187;, &#171;cat&#233;gorieLexicale&#187;, &#171;tempsVerbe&#187;, &#171;estSingulier&#187;, etc.
Pour chaque PA, nous cherchons les instances de ce segment d&#8217;arbre dans l&#8217;ensemble des arbres
de d&#233;pendance que nous sommes en train d&#8217;annoter. Pour chaque instance ainsi trouv&#233;e, nous
appliquons l&#8217;&#171;action&#187; associ&#233;e au patron-action. Une action agit sur un noeud en particulier
en modifiant ses attributs ; dans notre cas, les actions ajoutent ou modifient une &#233;tiquette de
TimeML associ&#233;e &#224; un noeud. Parmi les 8 actions que nous avons d&#233;finies, il y a &#171;creerE-
tiquetteEvent&#187;, &#171;rallongerEtendueEtiquette&#187; et &#171;supprimerEtiquette&#187;. L&#8217;ordre dans lequel on
recherche et applique les PA a une importance, puisque la modification d&#8217;un attribut &#224; un noeud
pourrait influencer la d&#233;tection d&#8217;un PA recherch&#233; par la suite.
</p>
<p>Pour identifier les verbes d&#233;notant un &#233;v&#233;nement, nous avons d&#233;fini 29 patrons-action. La pre-
mi&#232;re r&#232;gle &#224; &#234;tre ex&#233;cut&#233;e consiste &#224; ajouter une &#233;tiquette &#171;EVENT&#187; &#224; tous les verbes pr&#233;sents
dans nos arbres syntaxiques. Par la suite, 28 PA servent &#224; filtrer les verbes n&#8217;exprimant pas
d&#8217;&#233;v&#233;nement ou d&#8217;&#233;tat. Certains de ces PA font exclusivement r&#233;f&#233;rence &#224; l&#8217;information lexi-
cale des noeuds. Par exemple, un des PA mentionne qu&#8217;il faut &#171;supprimer l&#8217;&#233;tiquette EVENT
s&#8217;il est accroch&#233; &#224; un noeud dont le lemme est falloir&#187;. D&#8217;autres r&#232;gles utilisent l&#8217;information
syntaxique, par exemple pour supprimer l&#8217;&#233;tiquette EVENT si elle est accroch&#233;e &#224; un noeud
dont le lemme est venir et poss&#233;dant un fils &#8220;Objet Indirect&#8221; dont la forme est de + verbe in-
finitif. On peut ainsi distinguer la forme il vient &#224; Montr&#233;al, qui exprime un &#233;v&#233;nement, de la
forme il vient de finir son travail, o&#249; le verbe venir exprime plut&#244;t un aspect inchoatif.
Pour d&#233;tecter les &#233;v&#233;nements exprim&#233;s par des nominalisations, nous avons utilis&#233; une ressource
linguistique nomm&#233;e Verbaction6. Ce lexique est le fruit du travail d&#8217;une &#233;quipe de l&#8217;INALF,
enrichi par la suite &#224; l&#8217;ERSS, en utilisant WebAffix (Tanguy &amp; Hathout, 2002) ; Verbaction
</p>
<p>6Cf. http ://w3.univ-tlse2.fr/erss/ressources/verbaction/main.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gabriel Parent, Michel Gagnon, Philippe Muller
</p>
<p>vise &#224; regrouver les couples &#171;verbe&#187; :&#171;nom&#187; o&#249; le nom peut &#234;tre utilis&#233; pour d&#233;noter l&#8217;action
ou l&#8217;activit&#233; exprim&#233;e par le verbe. Un travail manuel a &#233;t&#233; effectu&#233; pour &#233;liminer les items
ind&#233;sirables (les d&#233;verbaux qui ne sont pas des &#233;v&#233;nements au sens v&#233;hicul&#233; par TimeML). En
plus de l&#8217;apport de ce lexique, nous utilisons l&#8217;information syntaxique pour annoter tous les
noms d&#233;pendants d&#8217;une pr&#233;position annot&#233;e comme SIGNAL (e.g. pendant ses &#233;tudes, apr&#232;s la
guerre, etc.) et filtrer ceux qui sont compl&#233;ments de nom (une bourse d&#8217;admission).
Pour les adjectifs d&#233;notant des &#233;ventualit&#233;s, nous notons qu&#8217;il est tr&#232;s difficile de trouver une
r&#232;gle qui augmente le rappel sans que l&#8217;ajout de cette r&#232;gle ne cause une diminution importante
de la pr&#233;cision. La raison est simple : dans notre corpus, nous avons 284 noeuds de cat&#233;gorie
lexicale &#171;adjectif&#187; et seulement 18 (6%) de ceux-ci sont annot&#233;s comme &#233;v&#233;nement ou &#233;tat. Ce
taux passe &#224; pr&#232;s de 75% pour les &#233;v&#233;nements verbaux. La strat&#233;gie utilis&#233;e pour les adjectifs
est donc &#224; l&#8217;oppos&#233; de celle utilis&#233;e pour les verbes : on &#233;tiquette seulement les adjectifs pour
lesquels on est &#224; peu pr&#232;s certain qu&#8217;ils d&#233;signent v&#233;ritablement un &#233;v&#233;nement ou un &#233;tat. Tel
que mentionn&#233; pr&#233;cedemment, Evita utilise une strat&#233;gie semblable, c&#8217;est-&#224;-dire qu&#8217;il annote
seulement les adjectifs annot&#233;s dans leur corpus de d&#233;veloppement. Cette approche n&#8217;est certes
pas durable pour une application o&#249; le domaine n&#8217;est pas restreint. C&#8217;est pourquoi nous avons
tent&#233; d&#8217;identifier des PA assurant un bon rappel et une bonne pr&#233;cision de mani&#232;re &#224; ne pas
d&#233;pendre de l&#8217;existence d&#8217;un corpus de d&#233;veloppement. Entres autres, on annote seulement les
adjectifs qui sont li&#233;s &#224; un verbe copule par la relation &#171;Attribut&#187;.
</p>
<p>Pr&#233;cision % Rappel % F-Measure %
Corpus d&#233;veloppement 86,8 80,6 83,5
Corpus &#233;valuation 62,5 77,7 69,3
Evita TimeBank 1.2 74.0 87.3 80.1
</p>
<p>TAB. 3 &#8211; &#201;valuation comparative de notre approche
</p>
<p>Comme pour la plupart des syst&#232;mes d&#8217;annotation, l&#8217;utilisation d&#8217;un corpus est essentielle pour
l&#8217;&#233;dification et l&#8217;&#233;valuation des performances du syst&#232;me. Nousaurions pu adopter le m&#234;me cor-
pus que celui utilis&#233; pour l&#8217;&#233;valuation de l&#8217;annotation des marqueurs temporels. Cependant, ce
corpus est incomplet du point de vue des &#233;tiquettes EVENT : ce ne sont pas tous les attributs
qui sont inclus et surtout, l&#8217;annotation des EVENT ne correspond pas tout &#224; fait &#224; la sp&#233;cifica-
tion 1.2.1 de TimeML. Nous avons donc repris quelques textes, et construit un autre corpus de
d&#233;veloppement &#224; l&#8217;aide de 13 biographies issues du corpus initial et de 22 rubriques de sports
issues de www.rds.ca. L&#8217;outil d&#8217;annotation graphique Callisto 7 a &#233;t&#233; utilis&#233; pour faciliter la
t&#226;che. Ces 35 fichiers contiennent 9234 mots r&#233;partis dans 400 phrases. Nous avons ainsi ajout&#233;
840 &#233;tiquettes EVENT, 419 &#233;tiquettes TIMEX3 et 210 &#233;tiquettes SIGNAL. Bien que ce corpus
apparaisse dans la pr&#233;sentation des r&#233;sultats, il n&#8217;a &#233;t&#233; utilis&#233; que pour d&#233;velopper l&#8217;ensemble
de PA d&#8217;annotation ; l&#8217;&#233;valuation est effectu&#233;e sur un autre corpus. Ce dernier a &#233;t&#233; construit de
mani&#232;re ind&#233;pendante, &#224; partir des nouvelles du site de l&#8217;&#201;cole Polytechnique de Montr&#233;al. Il
est donc normal de s&#8217;attendre &#224; ce que l&#8217;&#233;valuation soit influenc&#233;e par la nature diff&#233;rente du
corpus d&#8217;&#233;valuation. Le corpus d&#8217;&#233;valuation contient 2673 mots dans 90 phrases, 210 &#233;tiquettes
EVENT, 87 &#233;tiquettes TIMEX3 et 47 &#233;tiquettes SIGNAL. Les r&#233;sultats globaux sont illustr&#233;s
au tableau 3.
</p>
<p>Le tableau 4 pr&#233;sente les r&#233;sultats par cat&#233;gorie lexicale, de mani&#232;re &#224; pouvoir discuter des avan-
7http://callisto.mitre.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements
</p>
<p>Corpus d&#233;veloppement Corpus &#233;valuation
Cat&#233;gorie Pr&#233;c. % Rappel % F-Score % Pr&#233;c. % Rappel % F-Score %
Nominaux 61,5 40,0 48,4 54,7 53,7 54,2
Verbaux 94,1 97,3 95,7 65,6 90,9 76,2
Adjectivaux 66,7 77,8 71,8 NIL NIL NIL
</p>
<p>TAB. 4 &#8211; &#201;valuation comparative de notre approche, segment&#233; en trois cat&#233;gories
</p>
<p>tages de notre m&#233;thode. En segmentant les r&#233;sultats de cette mani&#232;re, il appara&#238;t que le probl&#232;me
principal de notre approche est notre faible capacit&#233; &#224; extraire efficacement les nominalisations.
C&#8217;est aussi la t&#226;che qui semble avoir le moins bon accord inter-annotateur et dont la sp&#233;cifi-
cation n&#233;cessite donc un approfondissement. Le guide d&#8217;annotation TimeML pour l&#8217;anglais ne
fournit pas suffisamment de d&#233;tails sur l&#8217;annotation des noms.
</p>
<p>Les r&#233;sultats obtenus sur le corpus de d&#233;veloppement au niveau des adjectivaux montrent bien
l&#8217;avantage de notre approche par rapport aux m&#233;thodes syntaxiques plus locales : alors qu&#8217;il
est impossible pour un syst&#232;me avec chunker seul de d&#233;terminer correctement si un adjectif
exprime une &#233;ventualit&#233; ou non, l&#8217;analyse syntaxique nous permet de le faire avec un f-score de
71,8%. C&#8217;est principalement parce que nous connaissons la relation qui relie l&#8217;adjectif avec son
p&#232;re syntaxique. On remarquera que dans notre corpus d&#8217;&#233;valuation, aucun des 161 adjectifs
qu&#8217;il contient n&#8217;a &#233;t&#233; annot&#233;, ni par l&#8217;humain, ni par notre syst&#232;me.
</p>
<p>6 Conclusion
</p>
<p>Cet article pr&#233;sente des r&#233;sultats sur deux t&#226;ches reli&#233;es : la d&#233;tection d&#8217;expressions adverbiales
temporelles (et le calcul de leur r&#233;f&#233;rence suivant la norme TimeML) et la d&#233;tection et la classifi-
cation d&#8217;&#233;v&#233;nements, suivant cette m&#234;me norme. Nous pr&#244;nons l&#8217;utilisation de r&#232;gles explicites
et d&#8217;une analyse grammaticale fine des phrases, qui sont pour nous les conditions d&#8217;une g&#233;n&#233;ra-
lisation efficace, dans un domaine o&#249; la pauvret&#233; des donn&#233;es et la complexit&#233; de leur collecte
rend d&#233;licat l&#8217;apprentissage automatique de la t&#226;che en question. Ces informations sont de plus
indispensables aux t&#226;ches qui en d&#233;coulent, &#224; savoir les liens temporels que l&#8217;on peut &#233;tablir
entre les entit&#233;s temporelles d&#8217;un texte et plus g&#233;n&#233;ralement la structure temporelle globale du
texte, ce qui est en fait notre objectif r&#233;el &#224; moyen terme. Nous ne connaissons aucun travail sur
le fran&#231;ais qui aurait &#233;t&#233; &#233;valu&#233; empiriquement comme nous l&#8217;avons fait ici, et les r&#233;sultats sur
d&#8217;autres langues sont comparables. Il faut &#233;galement noter que certaines des informations que
nous extrayons au passage d&#233;passent un peu le cadre strict des &#233;valuations ACE ou de la norme
TimeML, puisque nous avons repris des classes d&#8217;expressions plus d&#233;taill&#233;es, et que nous extra-
yons des constructions syntaxiques compl&#232;tes r&#233;serv&#233;es pour les analyses en aval des liens entre
entit&#233;s temporels, notamment la structure des groupes pr&#233;positionnels ayant plusieurs compo-
santes temporelles, l&#224; o&#249; TimeML ne pr&#233;conise que l&#8217;enregistrement s&#233;par&#233; des expressions et
o&#249; l&#8217;&#233;valuation est confi&#233;e &#224; des fonctions externes non-sp&#233;cifi&#233;es. Par ailleurs nous n&#8217;extrayons
pas toutes les informations, certaines classes d&#8217;&#233;v&#233;nements au sens de TimeML &#233;tant ignor&#233;es
pour l&#8217;instant.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Gabriel Parent, Michel Gagnon, Philippe Muller
</p>
<p>R&#233;f&#233;rences
ABNEY S. (1996). Corpus-Based Methods in Language and Speech, chapter Part-of-Speech Tagging
and Partial Parsing. Kluwer Academic Publisher.
BALDWIN J. A. (2002). Learning temporal annotation of French news. Master&#8217;s thesis, Georgetown
University, Washington, DC.
BERNARD P. &amp; MAUREL D. (1993). Interrogation en langage naturel d&#8217;une base de donn&#233;es : interpr&#233;-
tation des adverbiaux de localisation temporelle. Math&#233;matiques, Informatiques et Sciences humaines,
(123), 45&#8211;52.
BETHARD S. &amp; MARTIN J. H. (2006). Identification of event mentions and their semantic class. In
Proceedings of the 2006 Conference on Empirical Methods in Natural Language Processing (EMNLP
2006), p. 146&#8211;154, Sydney.
BOGURAEV B. &amp; ANDO R. (2005). TimeML-compliant text analysis for temporal reasoning. In L. P.
KAELBLING &amp; F. GIUNCHIGLIA, Eds., Proceedings of IJCAI05, p. 997&#8211;1003.
HACIOGLU K., CHEN Y. &amp; DOUGLAS B. (2005). Automatic time expression labeling for english and
chinese text. In CICLing, p. 548&#8211;559.
MADHYASTHA H. V., BALAKRISHNAN N. &amp; RAMAKRISNAN K. (2003). Event information extrac-
tion using link grammar. In Proceedings of the 13th International WorkShop on Research Issues in
Data Engineering : Multi-lingual Information Management (RIDE&#8217;03), p. 16&#8211;23, Los Alamitos, CA,
USA.
MANI I. &amp; WILSON G. (2000). Robust temporal processing of news. In Proceedings of the 38th Annual
Meeting of the Association for Computational Linguistics (ACL 2000), p. 69&#8211;76, New Brunswick, New
Jersey.
MAZUR P. &amp; DALE R. (2007). The DANTE temporal expression tagger. In Proceedings of the 3rd
Language &amp; Technology Conference (LTC), Poznan, Poland.
MOLIN&#200;S F. (1989). Acceptabilit&#233; et interpr&#233;tation des adverbiaux de localisation temporelle : gram-
maire ou dictionnaire. M&#233;moire de DES, Universit&#233; Toulouse Le Mirail.
MULLER P. &amp; TANNIER X. (2004). Annotating and measuring temporal relations in texts. In Procee-
dings of Coling 2004, volume I, p. 50&#8211;56, Gen&#232;ve.
NADEAU D. &amp; SEKINE S. (2007). A survey of named entity recognition and classification. Journal of
Linguisticae Investigationes, 30(1), 3&#8211;26.
NEGRI M. &amp; MARSEGLIA L. (2004). Recognition and normalization of time expressions : Ictirst at
tern 2004. In TERN 2004 Evaluation Workshop, Alexandria, VA : Technical Report.
PUSTEJOVSKY J., INGRIA R., SAURI R., CASTANO J., LITTMAN J., GAIZAUSKAS R., SETZER A.,
KATZ G. &amp; MANI I. (2005). The specification language TimeML. In I. MANI, J. PUSTEJOVSKY &amp;
R. GAIZAUSKAS, Eds., The Language of Time : A Reader. Oxford University Press.
SAUR&#205; R., KNIPPEN R., VERHAGEN M. &amp; PUSTEJOVSKY J. (2005). Evita : A robust event recognizer
for QA systems. In Proceedings of HLT/EMNLP, p. 700&#8211;707, Vancouver.
SCHMID H. (1994). Probabilistic part-of-speech tagging using decision trees. In Proceedings of the
International Conference on New Methods in Language Processing.
SLEATOR D. &amp; TEMPERLEY D. (1991). Parsing English with a link grammar. In Technical report
CMU-CS-91-196 : Carnegi Mellon University.
TANGUY L. &amp; HATHOUT N. (2002). Webaffix : un outil d&#8217;acquisition morphologique d&#233;rivationnelle &#224;
partir du web. In J.-M. PIERREL, Ed., Actes de la 9eConf&#233;rence Annuelle sur le Traitement Automatique
des Langues Naturelles (TALN-2002), p. 245&#8211;254, Nancy : ATALA.
YAKUSHIJI A., TATEISI Y. &amp; MIYAO Y. (2001). Event extraction from biomedical papers using a full
parser. In Proceedings of the Pacific Symposium on Biocomputing, p. 408&#8211;419.</p>

</div></div>
</body></html>