<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une architecture g&#233;n&#233;rique de syst&#232;me de dialogue oral homme-machine</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Vers une architecture g&#233;n&#233;rique de syst&#232;me de dialogue oral 
homme-machine 
</p>
<p>Ho&#225; NGUYEN 
</p>
<p>Laboratoire CLIPS - IMAG &#8211; Universit&#233; Joseph Fourier 
385, rue de la Biblioth&#232;que - B.P. 53 - 38041 Grenoble Cedex 9 
</p>
<p>Ngoc-Hoa.Nguyen@imag.fr 
 
</p>
<p>Mots-clefs &#8211; Keywords  
</p>
<p>Dialogue homme-machine, gestion du dialogue, gestion de la t&#226;che, compr&#233;hension, 
interpr&#233;tation. 
</p>
<p>Human-machine dialogue system, dialogue management, task management, comprehension, 
interpretation. 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
</p>
<p>Cet article pr&#233;sente une architecture g&#233;n&#233;rique de syst&#232;me de dialogue oral homme-machine. 
Premi&#232;rement, nous abordons quelques probl&#232;mes soulev&#233;s par la g&#233;n&#233;ricit&#233; des syst&#232;mes de 
dialogue homme-machine. Nous d&#233;crivons ensuite dans ce cadre quelques syst&#232;mes r&#233;cents et 
typiques. Nous pr&#233;sentons finalement une architecture g&#233;n&#233;rique pour concevoir/construire 
des syst&#232;mes de dialogue oral homme-machine. 
</p>
<p>In this paper, we present a general architecture for the dialog person-machine system that 
enables human interacts with a machine via speech&#8217;s modality. First, we approach some 
notions of dialog system, the role of the speech in application, their interests and their 
limitations. Then, we present some recent, critical dialog person-machine systems and finally, 
we describe our architecture proposed for designing and constructing the general dialog 
systems. 
</p>
<p>1  Syst&#232;me de dialogue homme-machine 
</p>
<p>L'id&#233;e de remplacer l'interlocuteur humain par une machine est apparue depuis les ann&#233;es 
soixante o&#249; de nombreux syst&#232;mes informatiques ont &#233;t&#233; con&#231;us pour cet objectif, avec pour 
certains, des r&#233;sultats int&#233;ressants. Il s'av&#232;re que les technologies vocales n'ont pas seulement 
p&#233;n&#233;tr&#233; le domaine des applications professionnelles, mais bien celui du grand public, m&#234;me </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ho&#225; NGUYEN 
</p>
<p>si cela reste encore fort discret. L'int&#233;r&#234;t de l'interaction vocale dans un service est tout d'abord 
qu&#8217;il s&#8217;agit du mode le plus naturel et le plus courant de  la communication entre les humains. 
Elle apporte &#233;galement la rapidit&#233;, l'efficacit&#233; et l'extension du champ d'action du syst&#232;me. De 
plus, la parole permet d'avoir acc&#232;s &#224; des donn&#233;es distantes et rend la possibilit&#233; d'&#233;tablir des 
&#233;changes de niveau s&#233;mantique complexe, de manipuler des notions abstraites (Caelen, 1996). 
Par contre, du c&#244;t&#233; des inconv&#233;nients, les interactions vocales subissent actuellement les 
limitations technologiques comme m&#233;dia de transmission, puissance de calcul n&#233;cessaire pour 
une r&#233;ponse en temps r&#233;el, m&#233;moire n&#233;cessaire pour de grands vocabulaires... D'autre part, 
l'ambigu&#239;t&#233; de la langue p&#233;nalise l'interpr&#233;tation du message et r&#233;duit donc la performance du 
syst&#232;me vocal. 
</p>
<p>Nous distinguons les deux notions: &quot;syst&#232;me vocal&quot; et &quot;syst&#232;me de dialogue oral homme-
machine&quot;. Un syst&#232;me vocal est un service utilisant la parole comme une modalit&#233; d'entr&#233;e 
pour r&#233;aliser/accomplir certaines t&#226;ches d&#233;di&#233;es. Dans ce type d'application, l'utilisateur peut 
dialoguer avec l'application en utilisant seulement les mots cl&#233;s, des phrases courtes, simples 
et connues a priori.  Par opposition, un syst&#232;me de dialogue homme-machine est un syst&#232;me 
qui est capable d&#8217;interagir de mani&#232;re plus naturelle avec l&#8217;homme pour accomplir des t&#226;ches 
plus g&#233;n&#233;rales et plus complexes. Dans les deux cas cependant on se heurte au m&#234;me 
probl&#232;me concernant la portabilit&#233; d&#8217;une t&#226;che &#224; un autre : la g&#233;n&#233;ricit&#233;. 
</p>
<p>Il est &#233;vident que ce probl&#232;me repr&#233;sente un verrou important &#224; lever pour un d&#233;veloppement 
en vraie grandeur de syst&#232;mes de dialogue homme-machine &#224; large diffusion. Dans cet article 
nous pr&#233;sentons un premier travail de sp&#233;cification d&#8217;une architecture g&#233;n&#233;rique effectu&#233; dans 
le projet PVE (Portail Vocal d&#8217;Entreprise) financ&#233; par le RNRT (R&#233;seau National de 
Recherche en T&#233;l&#233;communications). 
</p>
<p>2 Etat de l'art 
</p>
<p>La derni&#232;re d&#233;cennie a vu le d&#233;veloppement d&#8217;un grand nombre de syst&#232;mes de dialogue 
homme-machine en langue naturelle. Ces syst&#232;mes permettent &#224; l'usager d'interagir avec la 
machine pour trouver une information ou pour r&#233;soudre un probl&#232;me concret. Cette section 
pr&#233;sente quelques syst&#232;mes r&#233;cents, dans ce domaine. Il est &#233;vident que la liste n'est pas 
exhaustive. 
</p>
<p>&#183; COALA (COAdaptation Langagi&#232;re pour l&#8217;Apprentissage) (Lehuen, 1997) est un 
syst&#232;me d'aide documentaire dans une m&#233;diath&#232;que municipale. L'utilisateur peut 
communiquer au syst&#232;me en fran&#231;ais pour la recherche documentaire en utilisant le 
mod&#232;le hypoth&#233;tico-exp&#233;rimental (un mod&#232;le qui vise &#224; introduire un maximum de 
souplesses dans la gestion de l&#8217;interaction.). COALA pose des hypoth&#232;ses au fur et &#224; 
mesure du dialogue, et les valide ou les infirme selon la suite des &#233;v&#233;nements. Ainsi 
la machine apprend &#224; chaque nouvelle interaction avec l'usager.  
</p>
<p>&#183; HALPIN (Hyperdialogue avec un Agent en Langage Proche de l&#8217;Interaction 
Naturelle) est un syst&#232;me de recherche d'information utilisant l'hyperdialogue1   en 
</p>
<p>                                                 
</p>
<p>1 Un dialogue homme-machine, coop&#233;ratif et finalis&#233;, dans un environnement hypertextuel. L&#8217;&#233;crit, l&#8217;oral, voire 
le geste, peuvent &#234;tre utilis&#233;s dans l&#8217;hyperdialogue </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une architecture g&#233;n&#233;rique de syst&#232;me de dialogue oral homme-machine 
</p>
<p>fran&#231;ais. L'usager dialogue avec le syst&#232;me HALPIN : il &#233;nonce sa demande de 
recherche des documents oralement et la machine lui r&#233;pond en donnant le r&#233;sultat de 
recherche sur le m&#234;me mode (Rouillard, 2000). 
</p>
<p>&#183; CMUCommutator (www.speech.cs.cmu.edu/Communicator/) est un syst&#232;me de 
dialogue provenant du laboratoire de la parole de l'universit&#233; de Carnegie Mellon. Il a 
pour objectif de permettre &#224; l'utilisateur de planifier un voyage en avion, de louer une 
voiture, de r&#233;server une chambre en utilisant un serveur vocal et le r&#233;seau 
t&#233;l&#233;phonique (Rudnicky, Thayer, 1999). Dans ce syst&#232;me, on propose une 
architecture de gestion de dialogue bas&#233;e sur un agenda qui g&#232;re les topiques 
concernant l'accomplissement de t&#226;che (Xu,  Rudnicky, 2000). 
</p>
<p>Le point faible commun de ces syst&#232;mes en particulier et des syst&#232;mes actuels de dialogue en 
g&#233;n&#233;ral est la d&#233;pendance de la t&#226;che. Cela signifie que ces syst&#232;mes ne sont con&#231;us et 
d&#233;velopp&#233;s que pour r&#233;soudre certaines t&#226;ches qui sont tr&#232;s restreintes et ferm&#233;es. Ils ne 
peuvent pas couvrir un ensemble de t&#226;ches et l'ajout d'une t&#226;che &#224; ces syst&#232;mes peut conduire 
&#224; reconstruire un nouveau syst&#232;me, en b&#233;n&#233;ficiant seulement d&#8217;un savoir-faire ant&#233;rieur mais 
non de briques logicielles de base. 
</p>
<p>La g&#233;n&#233;ricit&#233; d&#8217;un syst&#232;me de dialogue a toujours &#233;t&#233; un des probl&#232;mes majeurs soulev&#233;s de 
nombreux chercheurs non seulement dans le domaine du dialogue mais &#233;galement dans les 
autres domaines comme le traitement automatique de la langue. Notre ambition est de 
proposer une architecture de syst&#232;me de dialogue homme-machine plus g&#233;n&#233;rique, et 
relativement portable. Il est &#233;vident que ces syst&#232;mes ne pourront jamais &#234;tre ind&#233;pendants de 
la t&#226;che mais peuvent comporter un gestionnaire de t&#226;ches autonome dont ils seront moins 
d&#233;pendants. 
</p>
<p>3 Architecture du syst&#232;me 
</p>
<p>Dans cette partie, nous d&#233;crivons une architecture qui facilite non seulement la conception 
mais &#233;galement la construction d'un syst&#232;me de dialogue. Elle est g&#233;n&#233;rique, et pourra donc 
&#234;tre instanci&#233;e. Cette architecture s&#233;pare les modules de traitement de donn&#233;es de mani&#232;re 
g&#233;n&#233;rique/instanci&#233;e. Ainsi au niveau de la reconnaissance de la parole nous distinguons les 
donn&#233;es g&#233;n&#233;rales des donn&#233;es particuli&#232;res de la t&#226;che (vocabulaire sp&#233;cialis&#233;, noms propres 
par exemple). De m&#234;me, au niveau du traitement du langage, nous distinguons le module de 
compr&#233;hension s&#233;mantique et d&#8217;interpr&#233;tation pragmatique. Enfin, au niveau du dialogue nous 
s&#233;parons ce qui rel&#232;ve de la gestion proprement dite du dialogue (tours de parole, buts 
dialogiques, strat&#233;gies) de ce qui rel&#232;ve de la gestion de la t&#226;che (plans, objets de la t&#226;che, 
contexte d&#8217;interaction) 
</p>
<p>Dans cette architecture, le flux de donn&#233;es n&#8217;est pas lin&#233;aire :  
</p>
<p>&#183; Le locuteur prononce un &#233;nonc&#233; oral.  
</p>
<p>&#183; Le syst&#232;me de reconnaissance produit une cha&#238;ne orthographique candidate.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ho&#225; NGUYEN 
</p>
<p> 
</p>
<p>Sch&#233;ma s&#233;mantique   
</p>
<p>Acte de langage    
</p>
<p>Re connaissance  
</p>
<p>Compr&#233;hension   
</p>
<p>G&#233;n&#233;ration   
</p>
<p>Interpr&#233;tation   
Gestion de la t&#226;che   
</p>
<p>Gestion du dialogue   
</p>
<p>Cha&#238;ne orthographique   
</p>
<p>But   
</p>
<p>Synth&#232;se   
</p>
<p>Enonc&#233; oral   
</p>
<p>Action sur le  
monde   
</p>
<p>Mod&#232;le  
acoustique   
</p>
<p>Mod&#232;le de  
langage   
</p>
<p>R&#233;f&#233;rents t&#226;ches   Morpho - Syntaxe   
</p>
<p>Concepts   
</p>
<p>Historique   
</p>
<p>Contexte t&#226;che   
</p>
<p>R&#233;f&#233;rents discours   Stra t&#233;gie   
But dialogique   
</p>
<p>Plan   Objet   
</p>
<p>Connaissances   
</p>
<p>Enonc&#233; oral   
</p>
<p>&#183; La cha&#238;ne orthographique est ensuite prise en charge par un composant linguistique 
(dit de compr&#233;hension) qui fournit un sch&#233;ma s&#233;mantique repr&#233;sentant le sens litt&#233;ral 
de l&#8217;&#233;nonc&#233;. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1 : Architecture g&#233;n&#233;rique d'un syst&#232;me de dialogue homme-machine, les parties 
gris&#233;es correspondent aux connaissances ou traitements d&#233;pendants de l&#8217;application 
</p>
<p>&#183; On entre ensuite dans un processus it&#233;ratif contr&#244;l&#233; par un m&#233;canisme de gestion de 
dialogue. Le sch&#233;ma s&#233;mantique s&#8217;enrichit au fur et &#224; mesure des apports des autres 
modules pour devenir un acte de langage, en particulier par le module 
d&#8217;interpr&#233;tation et par le module de gestion de la t&#226;che. Cet acte de langage est pris 
en charge par le contr&#244;leur de dialogue qui le soumet sous forme de but au 
gestionnaire de t&#226;ches.  
</p>
<p>&#183; La r&#233;ponse de ce dernier conduit &#224; formuler une r&#233;action sous forme de changement 
dans le &quot;monde de la t&#226;che&quot; et/ou de r&#233;ponse vocale synth&#233;tis&#233;e. En cas d&#8217;&#233;chec dans 
la r&#233;solution d&#8217;un plan ou d&#8217;une t&#226;che, le contr&#244;le est redonn&#233; au contr&#244;leur de 
dialogue qui d&#233;cide de la strat&#233;gie &#224; tenir. Il peut alors redistribuer les r&#244;les et les 
traitements &#224; l&#8217;un des modules. 
</p>
<p>Nous d&#233;crivons les composants de cette architecture en d&#233;tail ci-dessous. 
</p>
<p>3.1 Reconnaissance de la parole 
</p>
<p>Le module de reconnaissance automatique de la parole prend un &#233;nonc&#233; oral en entr&#233;e et 
fournit une cha&#238;ne orthographique en sortie. Il comporte &#233;videmment des ressources </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une architecture g&#233;n&#233;rique de syst&#232;me de dialogue oral homme-machine 
</p>
<p>acoustiques et linguistiques comme (a) un mod&#232;le acoustique de la langue, (b) un mod&#232;le 
statistique de langage et (c) un mod&#232;le sp&#233;cifique de la langue de l&#8217;application (par exemple 
noms propres, entit&#233;s et expressions du domaine) qui d&#233;pend du contexte de l'application, 
c'est-&#224;-dire que ce module reste encore une partie d&#233;pendant de la t&#226;che. On appelle ces entit&#233;s 
sp&#233;cifiques, &quot;r&#233;f&#233;rents de la t&#226;che&quot;.  
</p>
<p>Aujourd'hui, il existe quelques syst&#232;mes de reconnaissance de la parole en fran&#231;ais ainsi qu'en 
anglais comme Dragon NaturallySpeaking (www.dragonsys.com/), SpeechWorks 
(www.speechworks.com/), ViaVoice d'IBM (www-3.ibm.com/software/speech/), Nuance 
(www.nuance.com/) qui proposent de telles possibilit&#233;s. 
</p>
<p>3.2 Compr&#233;hension s&#233;mantique 
</p>
<p>Le module dit de &quot;compr&#233;hension&quot; prend la cha&#238;ne orthographique en entr&#233;e et fournit un 
sch&#233;ma s&#233;mantique en sortie. Il utilise des outils g&#233;n&#233;raux concernant la morphologie, la 
syntaxe et la s&#233;mantique lexicale comme donn&#233;es et algorithmes. Le pragmatique n'est encore 
pas trait&#233;e &#224; ce niveau. La performance du syst&#232;me de dialogue d&#233;pend &#233;videmment de la 
qualit&#233; de la compr&#233;hension et donc elle doit &#234;tre robuste pour ne pas &#234;tre trop sensible aux 
erreurs de reconnaissance, c'est-&#224;-dire en ayant une bonne anticipation/pr&#233;diction de ce qui est 
dit par l&#8217;utilisateur. Pour cette raison, on peut utiliser une approche descendante par analyse de 
concepts. Les concepts sont des sortes de r&#233;seaux s&#233;mantiques issus d&#8217;un th&#233;saurus. 
</p>
<p>3.3 Interpr&#233;tation pragmatique 
</p>
<p>La sortie du module de compr&#233;hension est l'entr&#233;e du module d&#8217;interpr&#233;tation. Il a pour but de 
d&#233;terminer les actes de langage (Austin 1970, Searle 1986, Vanderveken 1990) et le contenu 
propositionnel de l&#8217;acte (Caelen 1997) en sortie. Ce module travaille sur des repr&#233;sentations 
du discours de type DRT- &quot;Discourse Representation Theory&quot; (Kamp 1981, Reyle 1993). Il 
utilise comme donn&#233;es, l&#8217;historique m&#233;moris&#233; au cours du dialogue, le contexte de la t&#226;che 
(repr&#233;sent&#233; sous-forme de th&#232;mes &#224; structure de graphe) et des algorithmes de calcul de la 
r&#233;f&#233;rence, notamment pour les ellipses et les anaphores (bas&#233;s sur la DRT).  
</p>
<p>3.4 Gestion du dialogue 
</p>
<p>Ce module peut &#234;tre consid&#233;r&#233; comme le contr&#244;leur principal du syst&#232;me de dialogue. Il 
transmet les messages aux autres modules, d&#233;cide de la strat&#233;gie ad&#233;quate, g&#232;re les buts et 
pr&#233;pare les donn&#233;es pour le g&#233;n&#233;rateur d&#8217;&#233;nonc&#233;s. Pour r&#233;aliser toutes ces t&#226;ches, il est &#233;quip&#233; 
de r&#232;gles de calcul des strat&#233;gies et des r&#232;gles de gestion des buts dialogiques (par exemple &#224; 
l&#8217;aide de piles ou de files d&#8217;attente) (Caelen 1997). Les comportements de la machine sont 
d&#233;termin&#233;s selon la strat&#233;gie de dialogue du moment, le but actuel &#224; r&#233;soudre et le plan de la 
t&#226;che (s&#233;quence d&#8217;actions &#233;l&#233;mentaires pour la t&#226;che).  Les buts en cours de traitement sont 
ensuite transmis au gestionnaire de t&#226;ches. Les r&#233;sultats sont r&#233;cup&#233;r&#233;s, analys&#233;s, et selon le 
cas (incompl&#233;tude, &#233;chec ou succ&#232;s) conduisent ou non &#224; une nouvelle it&#233;ration du processus. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ho&#225; NGUYEN 
</p>
<p>3.5 Gestion de la t&#226;che 
</p>
<p>La gestion de la t&#226;che peut &#234;tre consid&#233;r&#233;e comme un planificateur classique. Il prend en 
entr&#233;e le but &#224; r&#233;soudre et d&#233;veloppe un plan pour l&#8217;atteindre. En cas d&#8217;&#233;chec il en donne les 
raisons et propose des solutions de repli. En cas d&#8217;incompl&#233;tude ou d&#8217;impr&#233;cision dans la 
formulation du but en entr&#233;e, il indique les param&#232;tres en cause (par exemple lorsque les pr&#233;-
conditions ou les contraintes ne sont pas satisfaites). Dans des applications ferm&#233;es on peut 
repr&#233;senter explicitement les t&#226;ches et sous-t&#226;ches &#224; l&#8217;aide d&#8217;un arbre hi&#233;rarchis&#233;. Si les t&#226;ches 
peuvent &#233;voluer au cours du temps (t&#226;ches dynamiques), il est pr&#233;f&#233;rable d&#8217;adopter un mod&#232;le 
dit implicite. 
</p>
<p>3.6 G&#233;n&#233;ration 
</p>
<p>Le module de g&#233;n&#233;ration prend en entr&#233;e les consignes du module de gestion de dialogue et 
fournit en sortie une action (suite d&#8217;instructions) ex&#233;cutable et/ou produit une cha&#238;ne 
orthographique textuelle. Ce module peut se r&#233;duire &#224; sa plus simple expression (collage de 
segments d&#8217;&#233;nonc&#233;s) s&#8217;il existe un adaptateur de noyau fonctionnel qui se charge de la 
transformation de la repr&#233;sentation du message en une cha&#238;ne. 
</p>
<p>3.7 Synth&#232;se de la parole 
</p>
<p>Dans cette architecture, on constate que ce module est le plus simple par rapport aux autres. Il  
prend naturellement en entr&#233;e une cha&#238;ne orthographique textuelle et fournit en sortie un 
signal sonore. Actuellement, les synth&#233;tiseurs commercialis&#233;s sont d&#8217;une relative bonne 
qualit&#233;, ils peuvent &#234;tre utilis&#233;s &#224; profit dans un syst&#232;me de dialogue homme-machine. Mais la 
plupart du temps on pr&#233;f&#232;re un g&#233;n&#233;rateur de phrases &#224; trous si le nombre de types de r&#233;ponses 
est limit&#233;. 
</p>
<p>4 R&#233;sultats attendus 
</p>
<p>Notre architecture sera valid&#233;e dans le  projet PVE2. Ce projet vise le d&#233;veloppement d&#8217;un 
mod&#232;le de g&#233;n&#233;ration d&#8217;interface de dialogue vocal pour un portail vocal d&#8217;entreprise. Plus 
pr&#233;cis&#233;ment, il a pour but d'analyser, d'&#233;tudier et de formaliser un mod&#232;le g&#233;n&#233;rique de 
dialogue homme-machine vocal, dans l&#8217;optique de proposer des solutions technologiques 
adapt&#233;es aux n&#233;cessit&#233;s d&#8217;un acc&#232;s au syst&#232;me d&#8217;information de l&#8217;entreprise compatible avec 
la mobilit&#233; (au sens  de la circulation) du personnel dans  l&#8217;entreprise et hors ses murs. Les 
&#233;l&#233;ments fonctionnels prioritaires d&#8217;un portail vocal d&#8217;entreprise sont l&#8217;interrogation du 
r&#233;pertoire du personnel, de l&#8217;agenda d&#8217;un groupe d&#8217;utilisateurs et le suivi du courrier 
&#233;lectronique personnel. Ces fonctions doivent &#234;tre activables de mani&#232;re int&#233;gr&#233;e afin de 
permettre un dialogue utile et performant pour un utilisateur acc&#233;dant au service par 
t&#233;l&#233;phone. 
</p>
<p>                                                 
</p>
<p>2 Pour en savoir plus, consultez sur la page Web www.telecom.gouv.fr/rnrt/projets/res_01_5.htm  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Vers une architecture g&#233;n&#233;rique de syst&#232;me de dialogue oral homme-machine 
</p>
<p>5 Conclusion 
</p>
<p>Nous avons pr&#233;sent&#233; une architecture pour concevoir et construire des syst&#232;mes de dialogue 
homme-machine dans l'optique de couvrir un ensemble de t&#226;ches. Dans cette architecture, le 
mod&#232;le de dialogue est s&#233;par&#233; compl&#232;tement par rapport au mod&#232;le de la t&#226;che. Cela apporte 
aux syst&#232;mes construits bas&#233;s sur cette architecture &#224; la fois la robustesse et la souplesse (par 
exemple l'ajout d'une nouvelle t&#226;che &#224; un tel syst&#232;me n'affecte pas le contr&#244;leur de dialogue). 
L'impl&#233;mentation d'un syst&#232;me de dialogue oral homme-machine dans le cadre du projet PVE 
est en cours. Le d&#233;veloppement de ses modules est progressif et ob&#233;it &#224; une logique de travail 
en &#233;tape. Etant achev&#233;e, cette architecture sera soumise &#224; une &#233;valuation en vue de tester et de 
diagnostiquer les apportes de ses modules, en particulier le module de gestion de dialogue sur 
lequel nous  nous focaliserons dans la continuit&#233; de notre th&#232;se. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>Austin, J.L (1970), Quand dire c&#8217;est faire, Paris, Edition du Seuil. 
</p>
<p>Caelen J., N&#233;el F.(1996), Nouvelles Interfaces Homme-Machine, ARAG0 s&#233;rie XVIII. 
</p>
<p>Caelen J.(1997), Interaction Verbale, Editions CEPADUES. 
</p>
<p>Coulon D., Kayser D. (1986), Informatique et langage naturel : Pr&#233;sentation g&#233;n&#233;rale des 
m&#233;thodes d&#8217;interpr&#233;tation des textes &#233;crits, Revue TSI : Technique et Science Informatique, 
Vol. 5. n&#176;2. 
</p>
<p>Kamp H. (1981), A Theory of truth and Semantic representation, Amsterdam: Mathematical 
Centre, J. Groenendijk, T. Janssen and M. Stokhof Eds. 
</p>
<p>Kamp H.,  Reyle U.(1993), From Discourse to Logic, Kluwer Academic Publishers. 
</p>
<p> Lehuen J.(1997), Un mod&#232;le de dialogue dynamique et g&#233;n&#233;rique int&#233;grant l'acquisition de 
sa comp&#233;tence linguistique - Le syst&#232;me COALA, th&#232;se du laboratoire d&#8217;Informatique, 
Universit&#233; du Maine. 
</p>
<p>Rouillard J. (2000), Hyperdialogue sur Internet &#8211; Le syst&#232;me HALPIN, th&#232;se de l'Universit&#233; 
Joseph Fourier, CLIPS-IMAG. 
</p>
<p>Rudnicky A.I., Thayer E., Constantinides P., Tchou C., Shern R., Lenzo K., Xu W., Oh 
A.(1999), Creating Natural Dialogs In The Carnegie Mellon Communicator System, 
Proceedings of Eurospeech, n&#176;4, 1531-1534. 
</p>
<p>Searle J.R., Vanderveken D.(1985), Foundations of illocutionary Logic, Cambridge 
University Press. 
</p>
<p>Vanderveken D. (1990), Meaning and Speech Acts, Volumes 1 and 2, Cambridge University 
Press. 
</p>
<p>Xu W., Rudnicky A.(2000), Task-based dialog management using an agenda. ANLP/NAACL 
Workshop on Conversational Systems, pp. 42-47. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>

</div></div>
</body></html>