<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Structure communicative du discours : &#233;tude pour la g&#233;n&#233;ration automatique de textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Structure communicative du discours : &#233;tude pour la
g&#233;n&#233;ration automatique de textes
</p>
<p>Laurence Delort
</p>
<p>LaTTICe-TALaNa, Universit&#233; Paris 7
UFR de Linguistique, case 7003
</p>
<p>2, place Jussieu
75251 Paris Cedex 05
</p>
<p>laurence.delort@linguist.jussieu.fr
Fin de th&#232;se : d&#233;cembre 2005
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>Structure communicative (ou structure informationnelle), progression th&#233;matique, structure du
discours (relations de discours), structuration de document, g&#233;n&#233;ration automatique de textes
Communicative structure (or information structure), thematic progression, discourse structure
(discourse relations), document structuring, natural language generation
</p>
<p>R&#233;sum&#233; &#8211; Abstract
</p>
<p>Dans cet article, nous montrons que la coh&#233;rence d&#8217;un discours d&#233;pend de la relation entre la
structure communicative des phrases et la structure du discours. Du point de vue de la synth&#232;se,
la vis&#233;e communicative contr&#244;le la structure du discours, et la structure du discours contraint le
choix des structures communicatives phrastiques : nous proposons de reproduire ce processus
dans un syst&#232;me de g&#233;n&#233;ration de textes. Nous montrons de quelle mani&#232;re la structure commu-
nicative intervient lors de la phase de structuration de document pour permettre la g&#233;n&#233;ration
de discours coh&#233;rents et r&#233;pondant &#224; des vis&#233;es communicatives particuli&#232;res.
</p>
<p>In this paper, we show that discourse coherence depends on the relationship between com-
municative structure of sentences and discourse structure. From the synthesis point of view,
communicative goal controls discourse structure, and discourse structure constrains choice of
communicative structures of sentences : we propose to reproduce this process in a natural lan-
guage generation system. We show how communicative structure can be used during document
structuring task so as to produce discourses which are coherent and corresponding to particular
communicative goals.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence Delort
</p>
<p>1 Introduction
Des &#233;tudes linguistiques, dont (Charolles, 1978), ont d&#233;montr&#233; que la coh&#233;rence d&#8217;un discours
est tributaire de la structure communicative des phrases qui composent le texte (de quoi parle-
t-on et qu&#8217;en dit-on ?) et des relations de discours en jeu entre les &#233;ventualit&#233;s (&#233;v&#233;nements,
&#233;tats) d&#233;crites dans le texte. Selon (Charolles, 1978), pour qu&#8217;un texte soit coh&#233;rent, &#8220;il faut
qu&#8217;il comporte dans son d&#233;veloppement lin&#233;aire des &#233;l&#233;ments &#224; r&#233;currence stricte&#8221; (m&#233;ta-r&#232;gle
de r&#233;p&#233;tition) et &#8220;que son d&#233;veloppement s&#8217;accompagne d&#8217;un apport s&#233;mantique constamment
renouvel&#233;&#8221; (m&#233;ta-r&#232;gle de progression). En d&#8217;autres termes, pour &#234;tre coh&#233;rent, un texte doit
avoir une continuit&#233; th&#233;matique, i.e. avoir un seul propos, et une progression rh&#233;matique, i.e.
apporter des informations nouvelles sur ce propos. Par ailleurs, pour qu&#8217;un texte soit coh&#233;rent,
&#8220;il faut que les faits qu&#8217;il d&#233;note dans le monde repr&#233;sent&#233; soient reli&#233;s&#8221; (m&#233;ta-r&#232;gle de relation),
ce qui signifie qu&#8217;il doit exister des relations qui permettent de lier les &#233;ventualit&#233;s d&#233;crites et
de structurer le discours : ces relations sont appel&#233;es relations rh&#233;toriques ou discursives.
La pr&#233;sente &#233;tude a pour objectif de d&#233;montrer que structure communicative et structure du dis-
cours sont fortement li&#233;es : &#224; une relation de discours correspond un encha&#238;nement de structures
communicatives, appel&#233; &#8220;progression th&#233;matique&#8221;, privil&#233;gi&#233;. Cette &#233;tude a &#233;galement pour ob-
jectif de montrer que des informations communicatives, telles que des r&#232;gles sur la corr&#233;lation
entre une relation de discours et une progression th&#233;matique, peuvent &#234;tre int&#233;gr&#233;es dans des
syst&#232;mes de Traitement Automatique des Langues et notamment dans un g&#233;n&#233;rateur de textes.
Nous pr&#233;sentons les notions de structure communicative et de structure de discours dans la
section 2. Dans la section 3, l&#8217;analyse d&#8217;un texte va permettre de rendre compte du lien entre
une relation de discours et une progression th&#233;matique. Enfin, dans la section 4, nous montrons
dans quelle mesure des informations communicatives peuvent intervenir dans un syst&#232;me de
g&#233;n&#233;ration de textes.
</p>
<p>2 Structure communicative et structure du discours
Pour qu&#8217;un discours soit jug&#233; coh&#233;rent, il faut que son organisation communicative
intra-phrastique (la partition th&#232;me &#0; rh&#232;me) et inter-phrastique (les encha&#238;nements des struc-
tures communicatives) soit en ad&#233;quation avec son organisation textuelle (les relations de dis-
cours). Avant d&#8217;&#233;claircir cette conception de la coh&#233;rence textuelle, nous pr&#233;sentons ce que
nous entendons par th&#232;me, rh&#232;me, progression th&#233;matique et relation de discours.
</p>
<p>2.1 Structure communicative de la phrase
Toute phrase poss&#232;de une structure communicative (ou informationnelle), et cette structure per-
met au locuteur de traduire le sens de la phrase en un message tel qu&#8217;il a l&#8217;intention de le faire
passer. La structure communicative met en jeu diff&#233;rentes valeurs (le th&#232;me et le rh&#232;me no-
tamment) dont l&#8217;organisation peut varier pour produire des &#233;nonc&#233;s distincts d&#8217;un point de vue
informationnel et donc &#233;galement d&#8217;un point de vue syntaxique (Lambrecht, 1994), (Mel&#8217;c&#780;uk,
2001). Au niveau communicatif, la caract&#233;ristique de tout message est que l&#8217;on dit quelque
chose (le rh&#232;me) &#224; propos de quelque chose (le th&#232;me) :
</p>
<p>&#1; Le rh&#232;me correspond &#224; ce qui est communiqu&#233;, il est donc un &#233;l&#233;ment obligatoire. Il est
le focus informationnel de la phrase : il est une information nouvelle quant au propos du
message, s&#8217;il y en a.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure communicative du discours : &#233;tude pour la g&#233;n&#233;ration automatique de
textes
</p>
<p>&#1; Le th&#232;me est l&#8217;entit&#233; au sujet de laquelle la proposition (plus pr&#233;cis&#233;ment le rh&#232;me) est.
Il correspond au propos du message, &#224; ce dont on parle. Il est un &#233;l&#233;ment facultatif : il
existe des phrases sans th&#232;me, appel&#233;es rh&#233;matiques (ou th&#233;tiques).
</p>
<p>Par exemple, dans le discours (1)1 :
</p>
<p>(1) a. IL FAUT SOULIGNER LA VICTOIRE DE L&#8217;&#201;QUIPE DES FOREURS.
</p>
<p>b. Ils ont remport&#233; LES S&#201;RIES &#201;LIMINATOIRES POUR LA DEUXI&#200;ME FOIS DE LEUR
HISTOIRE.
</p>
<p>l&#8217;&#233;v&#233;nement &#8217;la victoire de l&#8217;&#233;quipe des Foreurs&#8217;2 est introduit dans (1a) par le biais de la for-
mule pr&#233;sentative il faut souligner. Il s&#8217;agit d&#8217;une phrase rh&#233;matique : il n&#8217;y a aucun propos
particulier, tout l&#8217;&#233;nonc&#233; constitue une information nouvelle. Dans (1b), il est question de &#8217;la
victoire de l&#8217;&#233;quipe des Foreurs&#8217; (le th&#232;me, lexicalis&#233; par ils ont remport&#233;) et il y a des infor-
mations nouvelles quant &#224; cette victoire (le rh&#232;me) : ce sont les s&#233;ries &#233;liminatoires qui ont &#233;t&#233;
remport&#233;es et pour la deuxi&#232;me fois de leur histoire. La question sous-jacente &#224; (1b) pourrait
&#234;tre : que peut-on dire &#224; propos de la victoire de l&#8217;&#233;quipe des Foreurs ?
Dans l&#8217;&#233;nonc&#233; (2) :
</p>
<p>(2) C&#8217;est L&#8217;&#201;QUIPE DES FOREURS qui a remport&#233; les s&#233;ries &#233;liminatoires.
</p>
<p>il est question d&#8217;une entit&#233; qui a remport&#233; les s&#233;ries &#233;liminatoires (le th&#232;me) et on en dit que
c&#8217;est l&#8217;&#233;quipe des Foreurs (le rh&#232;me). L&#8217;&#233;nonc&#233; (2) peut &#234;tre la r&#233;ponse &#224; la question : qui a
remport&#233; les s&#233;ries &#233;liminatoires ?
Dans un discours, les structures communicatives s&#8217;encha&#238;nent d&#8217;une certaine fa&#231;on : c&#8217;est ce
qui est appel&#233; &#8220;progression th&#233;matique&#8221;. Les premi&#232;res &#233;tudes sur la progression th&#233;matique de
Dane&#353; sont reprises dans (Combettes, 1988), o&#249; sont pr&#233;sent&#233;es trois progressions th&#233;matiques
canoniques. Dans une progression &#8220;lin&#233;aire&#8221;, le th&#232;me de la phrase est issu du rh&#232;me de la
phrase pr&#233;c&#233;dente. Par exemple, dans (3) :
</p>
<p>(3) a. LA PERFORMANCE DE [MAXIME DAIGNEAULT] EST &#192; NOTER.
</p>
<p>b. Il DEVIENT LE PREMIER GARDIEN DE BUT RECRUE DE 16 ANS &#192; CONDUIRE SA
FORMATION &#192; LA CONQU&#202;TE DE LA COUPE DU PR&#201;SIDENT.
</p>
<p>le th&#232;me de (3b), il, est issu du focus rh&#233;matique Maxime Daigneault3, partie du rh&#232;me la plus
informationnelle de (3a), donn&#233;e par une intonation particuli&#232;re (Marandin et al., 2002).
Dans une progression &#8220;&#224; th&#232;me constant&#8221;, le th&#232;me de la phrase est issu du th&#232;me de la phrase
pr&#233;c&#233;dente. Par exemple :
</p>
<p>(4) a. Simon Gamache A R&#201;COLT&#201; AU MOINS UN POINT DANS CHACUN DES 21 MATCHS.
</p>
<p>b. Il A &#201;GALEMENT REMPORT&#201; LE TROPH&#201;E GUY LAFLEUR.
</p>
<p>Dans une progression &#8220;&#224; th&#232;me d&#233;riv&#233;&#8221;, le th&#232;me de la phrase est issu d&#8217;un &#8220;hyper-th&#232;me&#8221;. Par
exemple :
</p>
<p>1Nous marquons le th&#232;me en minuscules et le RH&#200;ME en majuscules.
2Les s&#232;mes (ou s&#233;mant&#232;mes) sont marqu&#233;s entre guillemets simples (ex : &#8217;victoire&#8217;) et les r&#233;alisations de surface
</p>
<p>de ces s&#232;mes en italique (ex : ont remport&#233;, sont victorieux, etc.).
3Dans le RH&#200;ME, le [FOCUS RH&#201;MATIQUE] est marqu&#233; entre crochets.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence Delort
</p>
<p>(5) a. Il faut souligner LA PERFORMANCE DE [TOUS CES JEUNES].
b. Simon Gamache A R&#201;COLT&#201; AU MOINS UN POINT DANS CHACUN DES 21 MATCHS.
</p>
<p>c. Maxime Daigneault DEVIENT LE PREMIER GARDIEN DE BUT RECRUE DE 16 ANS &#192;
CONDUIRE SA FORMATION &#192; LA CONQU&#202;TE DE LA COUPE DU PR&#201;SIDENT.
</p>
<p>Simon Gamache dans (5b) et Maxime Daigneault dans (5c) sont des &#233;l&#233;ments th&#233;matiques issus
de tous ces jeunes introduit dans (5a).
Dans les textes, nous pouvons trouver diff&#233;rentes combinaisons de ces trois progressions th&#233;-
matiques. Il est &#233;galement possible de trouver d&#8217;autres encha&#238;nementss th&#233;matiques. En effet,
il existe une progression dans laquelle le th&#232;me n&#8217;est issu ni du th&#232;me ni du rh&#232;me de la phrase
pr&#233;c&#233;dente (section 3.1).
</p>
<p>2.2 Structure du discours
La structure d&#8217;un discours est mise au jour par des relations dites rh&#233;toriques ou discursives. Ces
relations de discours rendent compte des relations entre les constituants discursifs (&#233;ventualit&#233;s
(&#233;v&#233;nements ou &#233;tats), faits ou propositions). Nous allons d&#233;finir quelques-unes de ces relations
telles qu&#8217;elles sont envisag&#233;es dans le cadre de la Segmented Discourse Representation Theory,
abr&#233;g&#233;e en SDRT (Asher, 1993), (Asher &amp; Lascarides, 2003).
Soient deux &#233;ventualit&#233;s &#2;&#4;&#3; et &#2;&#6;&#5; d&#233;crites respectivement dans les phrases (a) et (b). Les &#233;ven-
tualit&#233;s &#2;&#4;&#3; et &#2;&#6;&#5; sont li&#233;es par une relation :
</p>
<p>&#1; &#201;laboration, lorsque &#2;&#7;&#5; explicite, donne des informations suppl&#233;mentaires sur &#2;&#8;&#3; . Par
exemple :
</p>
<p>(6) a. La performance de Maxime Daigneault est &#224; noter.
b. Il devient le premier gardien de but recrue de 16 ans &#224; conduire sa formation &#224; la
</p>
<p>conqu&#234;te de la Coupe du pr&#233;sident.
&#1; Parall&#232;le, lorsque &#2;&#4;&#3; et &#2;&#6;&#5; portent sur le m&#234;me &#8220;th&#232;me&#8221;. Par exemple :
</p>
<p>(7) a. Simon Gamache a r&#233;colt&#233; au moins un point dans chacun des 21 matchs.
b. Il a &#233;galement remport&#233; le troph&#233;e Guy Lafleur.
</p>
<p>&#1; Commentaire, lorsque &#2;&#7;&#5; est un commentaire sur &#2;&#4;&#3; . Par exemple :
</p>
<p>(8) a. L&#8217;&#233;quipe des Foreurs a remport&#233; les s&#233;ries &#233;liminatoires.
b. C&#8217;est une belle victoire.
</p>
<p>&#1; R&#233;sultat, lorsque &#2;&#7;&#5; est caus&#233;e par &#2;&#9;&#3; . Par exemple :
</p>
<p>(9) a. Les Foreurs ont remport&#233; pour la deuxi&#232;me fois de leur histoire les s&#233;ries &#233;limi-
natoires.
</p>
<p>b. Je suis fier de cette &#233;quipe.
&#1; Explication, lorsque &#2;&#7;&#5; cause (ou explique) &#2;&#4;&#3; . Par exemple :
</p>
<p>(10) a. Je suis fier de l&#8217;&#233;quipe des Foreurs.
b. Ils ont remport&#233; pour la deuxi&#232;me fois de leur histoire les s&#233;ries &#233;liminatoires.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure communicative du discours : &#233;tude pour la g&#233;n&#233;ration automatique de
textes
</p>
<p>3 Mise au jour du lien entre structure communicative et struc-
ture du discours : analyse d&#8217;un texte
</p>
<p>Notre analyse se fonde sur la structure communicative des phrases et sur les relations discursives
qu&#8217;elles entretiennent dans le texte suivant4:
</p>
<p>(11) a. Albert Jambon, g&#233;ologue &#224; Paris-VI, est tout content de la pierre Al-Mala&#8217;ika.
b. Le petit caillou qu&#8217;il vient d&#8217;&#233;tudier, avec des coll&#232;gues de Brest, de Lyon et d&#8217;Angers,
</p>
<p>serait un roc de Mars.
</p>
<p>c. C&#8217;est ce qu&#8217;il assure dans son communiqu&#233; de d&#233;claration &#224; la Meteoritical Society.
</p>
<p>Nous proc&#233;dons en deux temps : nous analysons tout d&#8217;abord la structure communicative de
chaque phrase, pour d&#233;duire des progressions th&#233;matiques et, ensuite, nous analysons les rela-
tions de discours &#233;tablies entre les constituants (11a), (11b) et (11c). Cette analyse va permettre
de mettre au jour la corr&#233;lation entre une relation de discours et une progression th&#233;matique.
</p>
<p>3.1 Analyse de la structure communicative des phrases
Nous proposons pour chaque phrase du texte (ce qui nous semble &#234;tre) sa structure communica-
tive. Pour simplifier la d&#233;monstration, nous n&#8217;analysons pas les &#233;l&#233;ments mis entre parenth&#232;ses.
Pour l&#8217;&#233;nonc&#233; (11a), la structure communicative est la suivante :
(11a) Albert Jambon, (g&#233;ologue &#224; Paris-VI,) EST TOUT CONTENT DE [LA PIERRE AL-
</p>
<p>MALA&#8217;IKA].
Le locuteur parle d&#8217;Albert Jambon et il en dit qu&#8217;il est tout content de la pierre Al-Mala&#8217;ika. La
pierre Al-Mala&#8217;ika est le focus rh&#233;matique et il est repris en th&#232;me dans la phrase suivante5 :
</p>
<p>(11b) Le petit caillou qu&#8217;il vient d&#8217;&#233;tudier, (avec des coll&#232;gues de Brest, de Lyon et d&#8217;Angers,)
SERAIT UN ROC DE MARS.
</p>
<p>Le petit caillou qu&#8217;il vient d&#8217;&#233;tudier est issu du focus rh&#233;matique de (11a) : la progression
th&#233;matique est lin&#233;aire. Et le locuteur dit de ce petit caillou qu&#8217;il serait un roc de Mars.
Le lien entre les structures communicatives de (11b) et de (11c) n&#8217;est pas &#233;vident &#224; premi&#232;re
vue car le th&#232;me de (11c) n&#8217;est issu ni du th&#232;me ni du rh&#232;me de (11b) :
(11c) C&#8217;EST CE QU&#8217;IL ASSURE DANS SON COMMUNIQU&#201; DE D&#201;CLARATION &#192; LA METE-
</p>
<p>ORITICAL SOCIETY.
</p>
<p>Le locuteur dit de quelque chose que c&#8217;est ce qu&#8217;il assure dans son communiqu&#233; de d&#233;clara-
tion &#224; la Meteoritical Society. Ce quelque chose est le fait qui est d&#233;crit dans (11b) soit &#8217;le
petit caillou qu&#8217;il vient d&#8217;&#233;tudier serait un roc de Mars&#8217;. Ce fait est repris sous la forme du
pronom d&#233;monstratif cela (c&#8217;) dans (11c). En d&#8217;autres termes, le fait que &#8217;le petit caillou qu&#8217;il
vient d&#8217;&#233;tudier serait un roc de Mars&#8217; (le th&#232;me) est &#8217;ce qu&#8217;il assure dans son communiqu&#233; de
d&#233;claration &#224; la Meteoritical Society&#8217; (le rh&#232;me).
</p>
<p>4Extrait, l&#233;g&#232;rement modifi&#233;, d&#8217;un article paru dans Lib&#233;ration (&#233;dition du 23 janvier 2003 (p.22) ou
http://www.liberation.fr/page.php?Article=83169).
</p>
<p>5Dans le texte original, la phrase (11a) est la suivante : Albert Jambon, g&#233;ologue &#224; Paris-VI, est tout content de
sa &#8220;derni&#232;re martienne&#8221;, o&#249; sa &#8220;derni&#232;re martienne&#8221; est une cataphore &#233;v&#233;nementielle (co-r&#233;f&#233;rence avec le fait
d&#233;crit dans (11b)). Nous pr&#233;f&#233;rons ne pas tenir compte de cette version de (11a) car elle demande des explications
qui ne font pas l&#8217;objet de la pr&#233;sente &#233;tude.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence Delort
</p>
<p>3.2 Analyse de la structure du discours
Entre les constituants discursifs (11a) et (11b), il y a une relation &#201;laboration. Le fait d&#233;crit
dans (11b) explicite une partie de l&#8217;&#233;ventualit&#233; d&#233;crite dans (11a). En l&#8217;occurrence, le locuteur
introduit une entit&#233; la pierre Al-Mala&#8217;ika dans (11a) et l&#8217;&#233;labore dans la phrase suivante (11b) :
</p>
<p>(11) a. Albert Jambon, g&#233;ologue &#224; Paris-VI, est tout content de la pierre Al-Mala&#8217;ika.
&#10; &#201;laboration
</p>
<p>b. Le petit caillou qu&#8217;il vient d&#8217;&#233;tudier, avec des coll&#232;gues de Brest, de Lyon et d&#8217;Angers,
serait un roc de Mars.
</p>
<p>Il y a une relation Commentaire entre les constituants (11b) et (11c). En effet, l&#8217;&#233;ventualit&#233;
d&#233;crite dans (11c) est un commentaire, une glose sur le fait d&#233;crit dans la phrase pr&#233;c&#233;dente
(11b) :
</p>
<p>(11) b. Le petit caillou qu&#8217;il vient d&#8217;&#233;tudier, avec des coll&#232;gues de Brest, de Lyon et d&#8217;Angers,
serait un roc de Mars.
&#10;
</p>
<p>Commentaire
</p>
<p>c. C&#8217;est ce qu&#8217;il assure dans son communiqu&#233; de d&#233;claration &#224; la Meteoritical Society.
</p>
<p>3.3 Observations
L&#8217;analyse des progressions th&#233;matiques et des relations de discours dans le texte (11) nous
am&#232;ne au constat suivant : la coh&#233;rence d&#8217;un discours d&#233;pend non seulement de la progression
th&#233;matique mais &#233;galement de son lien avec une relation de discours.
Voici le texte (11) o&#249; les structures communicatives et les relations de discours sont indiqu&#233;es :
</p>
<p>(11) a. Albert Jambon, (g&#233;ologue &#224; Paris-VI,) EST TOUT CONTENT DE [LA PIERRE AL-
MALA&#8217;IKA].
&#10; &#201;laboration
</p>
<p>b. Le petit caillou qu&#8217;il vient d&#8217;&#233;tudier, (avec des coll&#232;gues de Brest, de Lyon et d&#8217;Angers,)
SERAIT UN ROC DE MARS.
&#10;
</p>
<p>Commentaire
</p>
<p>c. C&#8217;EST CE QU&#8217;IL ASSURE DANS SON COMMUNIQU&#201; DE D&#201;CLARATION &#192; LA METE-
ORITICAL SOCIETY.
</p>
<p>Nous observons qu&#8217;&#224; une relation de discours peut &#234;tre associ&#233;e une progression th&#233;matique
privil&#233;gi&#233;e. S&#8217;il y a une relation &#201;laboration entre deux constituants discursifs, la progression
th&#233;matique est de pr&#233;f&#233;rence lin&#233;aire (le focus rh&#233;matique est repris en th&#232;me). Et si nous
avons une relation Commentaire, le th&#232;me reprend l&#8217;&#233;ventualit&#233; ou le fait d&#233;crit dans la phrase
pr&#233;c&#233;dente.
Nous pouvons ainsi tenter d&#8217;associer une progression th&#233;matique &#224; chaque relation de discours
d&#233;crite en SDRT. Des r&#232;gles sur cette corr&#233;lation ont pu &#234;tre d&#233;gag&#233;es &#224; partir de l&#8217;observation
de corpus (Delort, 2002).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure communicative du discours : &#233;tude pour la g&#233;n&#233;ration automatique de
textes
</p>
<p>4 Application &#224; la g&#233;n&#233;ration automatique de textes
Notre travail se situe dans le cadre de la g&#233;n&#233;ration automatique de textes (abr&#233;g&#233;e en GAT),
syst&#232;me de Traitement Automatique des Langues qui requiert des informations linguistiques
pointues et &#233;galement, nous allons le voir, communicatives6.
Un g&#233;n&#233;rateur de textes a pour but de produire un discours coh&#233;rent et r&#233;pondant &#224; une vis&#233;e
communicative &#224; partir de donn&#233;es conceptuelles. Pour atteindre ce double objectif, il est n&#233;ces-
saire de prendre en consid&#233;ration, d&#8217;une part, l&#8217;interaction entre la structure du discours (i.e. les
relations de discours) et l&#8217;organisation communicative des phrases (i.e. la progression th&#233;ma-
tique), et d&#8217;autre part, les intentions du locuteur.
Int&#233;grer des informations communicatives dans un syst&#232;me de GAT permettrait d&#8217;assurer la co-
h&#233;rence du discours (par la prise en compte de la corr&#233;lation entre une progression th&#233;matique
et une relation de discours) et de limiter la g&#233;n&#233;ration de paraphrases &#224; celles qui r&#233;pondent &#224;
une vis&#233;e communicative particuli&#232;re.
</p>
<p>4.1 Structuration du discours
L&#8217;entr&#233;e d&#8217;un g&#233;n&#233;rateur de textes peut &#234;tre une repr&#233;sentation logique du contenu s&#233;mantique
du texte &#224; produire. C&#8217;est &#224; partir de cette repr&#233;sentation logique que l&#8217;on va organiser le
texte : c&#8217;est la phase dite de &#8220;structuration de document&#8221; (Danlos et al., 2001). Le module de
structuration de document doit proposer un plan de document au module de lexicalisation, o&#249;
s&#8217;op&#232;re le choix des constructions syntaxiques. Afin d&#8217;illustrer le processus de structuration de
document, prenons la forme logique suivante :
</p>
<p>(12) &#11; x, &#12;&#13;&#3; , y, &#14;&#4;&#5; , z, w, &#15;&#4;&#3; , &#2;&#7;&#5; , &#16;&#17;&#5; , &#2;&#6;&#18; (
</p>
<p>Albert Jambon (x) &#19; g&#233;ologue_Paris-VI ( &#12;&#20;&#3; ) &#19; x = &#12;&#21;&#3;&#22;&#19;
Al-Mala&#8217;ika (y) &#19; pierre ( &#14;&#23;&#5; ) &#19; y = &#14;&#4;&#5;&#24;&#19;
roc_de_Mars (z) &#19; Meteoritical Society (w) &#19;
&#234;tre_content ( &#15;&#4;&#3; , x, y) &#19; &#15;&#4;&#3; O now &#19;
&#233;tudier ( &#2;&#7;&#5; , x, &#14;&#4;&#5; ) &#19; &#2;&#6;&#5; O now &#19;
&#234;tre ( &#16;&#17;&#5; , &#14;&#9;&#5; , z) &#19; &#16;&#25;&#5; O now &#19;
d&#233;clarer ( &#2;&#7;&#18; , x, w, &#16;&#17;&#5; ) &#19; &#2;&#6;&#18; O now )
</p>
<p>Cette forme logique, qui repr&#233;sente la s&#233;mantique du discours &#224; g&#233;n&#233;rer (proche du discours
(11)), comprend six entit&#233;s (&#8217;Albert Jambon&#8217;, &#8217;g&#233;ologue &#224; Paris-VI&#8217;, &#8217;Al-Mala&#8217;ika&#8217;, &#8217;pierre&#8217;,
&#8217;roc de Mars&#8217; et &#8217;Meteoritical Society&#8217;), un &#233;tat ( &#15;&#8;&#3; ), un fait ( &#16;&#17;&#5; ) et deux &#233;v&#233;nements ( &#2;&#25;&#5; et &#2;&#6;&#18; ).
Il y a &#233;galement deux &#233;quations (x = &#12;&#26;&#3; et y = &#14;&#4;&#5; ) qui indiquent une co-r&#233;f&#233;rence entre deux
entit&#233;s. L&#8217;objectif pour le module de structuration de document est de permettre la g&#233;n&#233;ration
de tous les para-textes possibles &#224; partir de la forme logique (12). &#192; la fin du processus de
g&#233;n&#233;ration, nous pourrions obtenir, par exemple, les para-textes (13) et (14) suivants :
(13) a. Albert Jambon, g&#233;ologue &#224; Paris-VI, a fait une d&#233;claration &#224; la Meteoritical Society.
</p>
<p>b. La pierre qu&#8217;il vient d&#8217;&#233;tudier serait un roc de Mars.
</p>
<p>c. Il est content de la pierre Al-Mala&#8217;ika.
6Voir notamment (Iordanskaja, 1992) et (Wanner et al., 2003) pour des &#233;tudes similaires dans le cadre de la
</p>
<p>Th&#233;orie Sens-Texte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence Delort
</p>
<p>Dans le texte (13), &#8217;la d&#233;claration &#224; la Meteoritical Society&#8217; semble &#234;tre le propos central du
discours, appel&#233; &#8220;topique&#8221;7. La suite du discours serait l&#8217;&#233;laboration de ce topique : qu&#8217;est-ce
qu&#8217;a d&#233;clar&#233; Albert Jambon &#224; la Meteoritical Society ?
Quant au texte (14), il para&#238;t traiter d&#8217;une seule entit&#233; &#8217;Albert Jambon&#8217; :
(14) a. Albert Jambon, g&#233;ologue &#224; Paris-VI, est content de la pierre Al-Mala&#8217;ika.
</p>
<p>b. Il vient d&#8217;&#233;tudier une pierre qui serait un roc de Mars.
</p>
<p>c. Il d&#233;clare cela &#224; la Meteoritical Society.
</p>
<p>La position th&#233;matique d&#8221;Albert Jambon&#8217; dans chaque phrase est un indice (non suffisant) pour
dire qu&#8217;il s&#8217;agit du topique de (14).
Le contenu propositionnel des para-textes (13) et (14) est identique. Ce qui les distingue est
l&#8217;organisation des phrases qui les composent et leurs vis&#233;es communicatives. Selon nous, la
vis&#233;e communicative guide la structure du discours : en fonction du propos du locuteur et
de ce qu&#8217;il veut en dire, nous aurons une organisation textuelle (et des relations de discours)
sp&#233;cifique. Par exemple, dans (13), le locuteur veut parler de &#8217;la d&#233;claration &#224; la Meteoritical
Society&#8217; et l&#8217;expliciter : nous aurons donc une relation &#201;laboration entre l&#8217;&#233;ventualit&#233; de (13a)
(qui introduit le topique) et les constituants (13b) et (13c).
Donc, en fonction d&#8217;une vis&#233;e communicative, nous allons avoir un plan de document parti-
culier. En l&#8217;occurrence, nous voulons que le texte traite de &#8217;la pierre Al-Mala&#8217;ika&#8217; et nous
voulons donner des informations sur (i.e. &#233;laborer) cette entit&#233; dans le discours. Suivant le pro-
cessus de construction d&#8217;une SDRS (pour segmented discourse representation structure) d&#233;crit
dans (Danlos et al., 2001), nous obtenons le plan de document illustr&#233; dans la figure 18.
ff
</p>
<p>&#3; ,
ff
</p>
<p>&#5; ,
ff
</p>
<p>&#18;
</p>
<p>ff
</p>
<p>&#3; :
</p>
<p>x, &#12;&#13;&#3; , y, &#15;&#9;&#3;
Albert Jambon (x)
g&#233;ologue_Paris-VI ( &#12;&#13;&#3; )
Al-Mala&#8217;ika (y)
&#234;tre_content ( &#15;&#4;&#3; , x, y)
x = &#12;&#21;&#3;
</p>
<p>&#15;&#9;&#3; O now
</p>
<p>ff
</p>
<p>&#5; :
</p>
<p>&#12;fi&#5; , &#14;&#4;&#5; , &#2;&#6;&#5; , &#16;&#25;&#5;
</p>
<p>&#12;fi&#5; = x
</p>
<p>pierre ( &#14;&#4;&#5; )
&#233;tudier ( &#2;&#7;&#5; , &#12;fl&#5; , &#14;&#4;&#5; )
</p>
<p>&#16;&#25;&#5;&#31;ffi
</p>
<p>&#15;&#6;&#5; , z
</p>
<p>&#234;tre ( &#15;&#6;&#5; , &#14;&#4;&#5; , z)
roc_de_Mars (z)
&#15;&#6;&#5; O now
</p>
<p>y = &#14;&#9;&#5;
&#2;&#6;&#5;! now
</p>
<p>ff
</p>
<p>&#18; :
</p>
<p>&#12;fi&#18; , w, &#2;&#6;&#18; , &#16;&#17;&#18;
</p>
<p>&#12;fi&#18; = x
</p>
<p>Meteoritical Society (w)
d&#233;clarer ( &#2;&#7;&#18; , &#12;fi&#18; , w, &#16;&#17;&#18; )
&#16;&#17;&#18; = &#16;&#17;&#5;
</p>
<p>&#2;&#6;&#18; O now
</p>
<p>&#201;laboration ( ff &#3; , ff &#5; ) Commentaire ( ff &#5; , ff &#18; )
</p>
<p>Figure 1: Plan de document possible construit &#224; partir de la forme logique (12)
</p>
<p>La DRS (pour discourse representation structure) &#233;tiquet&#233;e ff &#3; permet l&#8217;introduction du r&#233;f&#233;rent
&#8217;la pierre Al-Mala&#8217;ika&#8217;. La DRS ff &#5; &#233;labore &#8217;la pierre Al-Mala&#8217;ika&#8217;, nous avons donc une relation
&#201;laboration entre ff &#3; et ff &#5; (&#201;laboration ( ff &#3; , ff &#5; )). Et la DRS ff &#18; commente ce qui a &#233;t&#233; dit sur
&#8217;Al-Mala&#8217;ika&#8217; : une relation Commentaire est &#233;tablie entre ff &#5; et ff &#18; (Commentaire ( ff &#5; , ff &#18; )). Ce
</p>
<p>7Pour une discussion sur la notion de topique, voir (Marandin, 1988).
8Faute de place, nous ne pouvons pas rentrer dans les d&#233;tails.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Structure communicative du discours : &#233;tude pour la g&#233;n&#233;ration automatique de
textes
</p>
<p>plan de document, qui rend compte de l&#8217;organisation des &#233;nonc&#233;s et des relations de discours
en jeu dans le texte, est obtenu en fonction d&#8217;une vis&#233;e communicative particuli&#232;re.
</p>
<p>4.2 Structuration communicative des phrases
Une fois la structure du discours &#233;tablie et les relations de discours mises au jour, il faut attribuer
&#224; chaque phrase la structure communicative appropri&#233;e. Pour qu&#8217;un discours soit coh&#233;rent,
il doit observer certaines progressions th&#233;matiques li&#233;es &#224; des relations de discours : si une
relation &#201;laboration est &#233;tablie entre deux &#233;ventualit&#233;s &#2;&#8;&#3; et &#2;&#6;&#5; , alors le focus rh&#233;matique de
&quot;
</p>
<p>&#3; (phrase exprimant &#2;&#4;&#3; ) peut &#234;tre repris en th&#232;me dans &quot; &#5; (phrase exprimant &#2;&#7;&#5; ) ; et si une
relation Commentaire est &#233;tablie entre deux &#233;ventualit&#233;s &#2;&#8;&#3; et &#2;&#6;&#5; , alors &#2;&#9;&#3; peut &#234;tre repris en
th&#232;me dans &quot; &#5; .
La prise en compte des r&#232;gles sur la corr&#233;lation entre une relation de discours et une progression
th&#233;matique va permettre la g&#233;n&#233;ration du discours suivant :
</p>
<p>(15) a. Albert Jambon, g&#233;ologue &#224; Paris-VI, est content de la pierre Al-Mala&#8217;ika.
b. La pierre qu&#8217;il vient d&#8217;&#233;tudier serait un roc de Mars.
</p>
<p>c. C&#8217;est ce qu&#8217;il d&#233;clare &#224; la Meteoritical Society.
</p>
<p>Ce discours respecte la vis&#233;e communicative telle que l&#8217;on parle de &#8217;la pierre Al-Mala&#8217;ika&#8217; et
que l&#8217;on l&#8217;&#233;labore. Par ailleurs, ce discours est coh&#233;rent car les r&#232;gles sur la corr&#233;lation entre
une relation de discours et une progression th&#233;matique sont respect&#233;es.
Sans but communicatif particulier, le g&#233;n&#233;rateur aurait produit tous les para-textes possibles &#224;
partir de la forme logique (12) (comme (13) et (14)) et, sans informations sur les encha&#238;nements
th&#233;matiques, il aurait produit des textes maladroits comme le suivant :
</p>
<p>(16) a. Albert Jambon, g&#233;ologue &#224; Paris-VI, est content de la pierre Al-Mala&#8217;ika.
b. Il vient d&#8217;&#233;tudier une pierre qui serait un roc de Mars.
</p>
<p>c. C&#8217;est ce qu&#8217;il d&#233;clare &#224; la Meteoritical Society.
</p>
<p>D&#8217;une part, l&#8217;interpr&#233;tation du discours form&#233; par les phrases (16a) et (16b) est difficile car
la pierre Al-Mala&#8217;ika, introduit dans la premi&#232;re phrase, demande une explicitation (qu&#8217;est-ce
que la pierre Al-Mala&#8217;ika et pourquoi Albert Jambon en est-il content ?) et il est question
dans la phrase suivante, non pas d&#8217;une &#233;laboration de la pierre Al-Mala&#8217;ika mais d&#8217;un nouvel
&#233;v&#233;nement qui est &#8217;l&#8217;&#233;tude d&#8217;une pierre&#8217;. D&#8217;autre part, dans (16c), le pronom d&#233;monstratif c&#8217;
peut &#234;tre interpr&#233;t&#233; comme &#233;tant la reprise de l&#8217;&#233;v&#233;nement &#8217;l&#8217;&#233;tude d&#8217;une pierre&#8217; (d&#233;crit dans
(16b)) alors que (16c) est un commentaire sur le fait &#8217;la pierre est un roc de Mars&#8217; (&#233;galement
d&#233;crit dans (16b)).
C&#8217;est le respect des progressions th&#233;matiques et de leur corr&#233;lation avec une relation de discours
qui va permettre de g&#233;n&#233;rer des discours les plus coh&#233;rents possible et d&#8217;&#233;viter la g&#233;n&#233;ration de
discours maladroits.
</p>
<p>5 Conclusion
La coh&#233;rence d&#8217;un discours d&#233;pend de la fa&#231;on dont les informations sont organis&#233;es et des rela-
tions entre les &#233;v&#233;nements d&#233;not&#233;s. Nous avons montr&#233; que structure communicative phrastique</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Laurence Delort
</p>
<p>et structure du discours entretiennent un rapport privil&#233;gi&#233; puisque &#224; une relation de discours,
nous pouvons associer une progression th&#233;matique. Cette interaction a un int&#233;r&#234;t linguistique,
car elle est li&#233;e &#224; la notion de coh&#233;rence textuelle, et un int&#233;r&#234;t applicatif. En GAT, la vis&#233;e
communicative guide la construction du plan de document. Le plan de document, &#224; son tour,
contraint les structures communicatives des phrases i.e. les futures constructions syntaxiques.
L&#8217;int&#233;gration d&#8217;informations sur la structure communicative dans un syst&#232;me de GAT va perme-
ttre de :
</p>
<p>&#1; r&#233;duire le nombre de paraphrases obtenues &#224; la fin du processus de g&#233;n&#233;ration ;
&#1; produire un discours r&#233;pondant &#224; une vis&#233;e communicative particuli&#232;re ;
&#1; produire un discours coh&#233;rent par la prise en compte des progressions th&#233;matiques et des
</p>
<p>relations de discours.
</p>
<p>L&#8217;&#233;tude approfondie de la structure communicative du discours peut fournir de nombreuses
informations linguistiques qui permettraient d&#8217;am&#233;liorer certains syst&#232;mes de Traitement Au-
tomatique des Langues comme, nous l&#8217;avons vu dans la pr&#233;sente &#233;tude, des syst&#232;mes de g&#233;n&#233;ra-
tion de textes.
</p>
<p>R&#233;f&#233;rences
ASHER N. (1993). Reference to Abstract Objects in Discourse, Kluwer Academic Publishers, Dordrecht.
ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation, Cambridge University Press, &#224; para&#238;tre.
CHAROLLES M. (1978). Introduction aux probl&#232;mes de la coh&#233;rence des textes, in Langue Fran&#231;aise
38, pp. 7-41.
COMBETTES B. (1988). Pour une grammaire textuelle : la progression th&#233;matique, De Boeck-Duculot,
Bruxelles.
DANLOS L., GAIFFE B. &amp; ROUSSARIE L. (2001). Document Structuring &#224; la SDRT, in Proceedings of
the 8th European Workshop on Natural Language Generation (ACL&#8217;01), Toulouse, pp. 11-20.
DELORT L. (2002). Int&#233;gration d&#8217;informations sur la structure communicative dans un syst&#232;me de
g&#233;n&#233;ration de textes, M&#233;moire de DEA en Linguistique Informatique, &#201;cole Doctorale Sciences du Lan-
gage, Universit&#233; Denis Diderot, Paris 7.
IORDANSKAJA L. (1992). Communicative Structure and its Use during Text Generation, in International
Forum on Information and Documentation 17 (2), pp. 15-27.
LAMBRECHT K. (1994). Information Structure and Sentence Form : Topic, focus and the mental repre-
sentations of discourse referents, Cambridge Studies in Linguistics 71, Cambridge University Press.
MARANDIN J.-M. (1988). &#192; propos de la notion de th&#232;me en discours. &#201;l&#233;ments d&#8217;analyse dans le r&#233;cit,
in Langue Fran&#231;aise 78, pp. 67-87.
MARANDIN J.-M., BEYSSADE C., DELAIS-ROUSSARIE E. &amp; RIALLAND A. (2002). Discourse mark-
ing in French : C accents and discourse moves, in Proceedings of the Speech Prosody Conference,
Aix-en-Provence, pp. 471-474.
MEL&#8217; &#711;CUK M. (2001). Communicative Organization in Natural Language : The Semantic-
communicative Structure of Sentences, Benjamins, Amsterdam.
WANNER L., BOHNET B. &amp; GIERETH M. (2003). Deriving the Communicative Structure in Applied
NLG, in Proceedings of the 9th European Workshop on Natural Language Generation (EACL&#8217;03), Bu-
dapest, Hongrie, pp. 111-118.</p>

</div></div>
</body></html>