<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Polys&#233;mie verbale et construction syntaxique : &#233;tude sur le verbe jouer</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Polys&#233;mie verbale et construction syntaxique : 
&#233;tude sur le verbe jouer 
</p>
<p> 
</p>
<p>Guillaume Jacquet 
</p>
<p> 
LaTTICe - CNRS UMR 8094 
</p>
<p>Langues, Textes, Traitements Informatiques et Cognition 
Ecole Normale Sup&#233;rieure 
</p>
<p>1 rue Maurice Arnoux 
F-92120 Montrouge 
</p>
<p>guillaume.jacquet@ens.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233; &#150; Abstract 
Dans l&#146;analyse s&#233;mantique de textes, un des obstacles au TAL est la polys&#233;mie des unit&#233;s 
linguistiques. Par exemple, le sens du verbe jouer peut varier en fonction du contexte : Il joue 
de la trompette (pratiquer) ; Il joue avec son fils (s&#146;amuser). 
Une des approches pour traiter ces ambigu&#239;t&#233;s de sens, est le mod&#232;le de la construction 
dynamique du sens propos&#233; par B. Victorri et C. Fuchs (1996). Dans ce mod&#232;le, on associe &#224; 
chaque unit&#233; polys&#233;mique un espace s&#233;mantique, et le sens de l&#146;unit&#233; dans un &#233;nonc&#233; donn&#233; 
est le r&#233;sultat d&#146;une interaction dynamique avec les autres unit&#233;s pr&#233;sentes dans l&#146;&#233;nonc&#233;. 
Nous voulons montrer ici que les constructions verbales sont des &#233;l&#233;ments du co-texte qui 
contribuent, au m&#234;me titre que le co-texte lexical, au processus dynamique de construction du 
sens du verbe. L&#146;objectif est alors de montrer que les constructions verbales sont porteuses de 
sens intrins&#232;que (Goldberg, 1995) et qu&#146;elles permettent dans notre mod&#232;le de contraindre 
automatiquement le sens d'un verbe. 
 
Polysemy is an important issue in Natural Language Processing. For instance, in French, the 
meaning of the verb jouer (to play) change with the context : Il joue de la trompette (to 
practice) ; Il joue avec son fils (to enjoy oneself). 
The model of &quot;Dynamical construction of meaning&quot; (Victorri, Fuchs, 1996) is an interesting 
approach for dealing with this problem. In this model, each polysemic unit is assigned a 
semantic space. The meaning of unit in a particular sentence is the result of a dynamical 
interaction with all other units of the sentence. 
In this paper, we consider the syntactic constructions as units contributing to the global 
meaning like the other linguistics units. We want to show that verbal constructions have an 
intrinsic meaning (Goldberg, 1995), and that we can use automatically this meaning to held 
selecting the right meaning of a verb. 
</p>
<p>Mots Cl&#233;s &#150; Keywords 
polys&#233;mie, calcul du sens, construction syntaxique, espace s&#233;mantique, pr&#233;position 
 
polysemy, meaning calculation, syntactic structure, semantic space, preposition </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Jacquet 
</p>
<p> 
</p>
<p>1 Probl&#233;matique 
Dans l&#146;analyse s&#233;mantique de textes, un des obstacles au Traitement Automatique des 
Langues est la polys&#233;mie des unit&#233;s linguistiques. Ce ph&#233;nom&#232;ne, omnipr&#233;sent dans les 
langues naturelles, implique que le sens d&#146;une unit&#233; d&#233;pend de l&#146;&#233;nonc&#233; dans lequel elle est 
employ&#233;e. Notre cadre de travail est la construction d&#146;un outil qui permette de d&#233;sambigu&#239;ser 
automatiquement un verbe polys&#233;mique en fonction de sa construction verbale. 
Il n&#146;est pas difficile de citer des &#233;nonc&#233;s o&#249; la construction verbale est d&#233;terminante pour 
donner un sens au verbe : 
</p>
<p>(1) Compter sur quelque chose (attendre de, esp&#233;rer de) 
(2) Compter quelque chose (&#233;num&#233;rer) 
</p>
<p>Le verbe jouer, qui a int&#233;ress&#233; de nombreux linguistes (Cadiot, 1999 ; Leland, 2001, Romero-
Lopes, 2002) fait partie des verbes tr&#232;s polys&#233;miques. En fonction de l&#146;&#233;nonc&#233; dans lequel il 
se trouve, il peut aussi bien prendre le sens de s&#146;amuser, que de miser ou encore de 
interpr&#233;ter. Les quatre &#233;nonc&#233;s qui suivent illustrent l&#146;effet du co-texte sur le sens de ce 
verbe : 
Effet du co-texte lexical :  
</p>
<p>(3) Elle joue &#224; la marelle (S&#146;amuser, se divertir) 
(4) Elle joue &#224; la bourse (miser, parier) 
</p>
<p>Effet du co-texte syntaxique (type de construction verbale) : 
(5) Jouer de quelque chose (pratiquer, manier) 
(6) Jouer quelque chose (imiter, interpr&#233;ter) 
</p>
<p>Il n&#146;y a cependant que rarement un sens pour une construction, et une construction pour un 
sens. La prise en compte de la construction verbale pour traiter le probl&#232;me de la polys&#233;mie 
n&#233;cessite un cadre th&#233;orique qui permette de rendre compte de ces subtilit&#233;s de sens. C&#146;est ce 
qui fait l&#146;objet de la premi&#232;re partie de cet article. La deuxi&#232;me partie d&#233;taille les m&#233;thodes 
qui doivent nous permettre de calculer l&#146;influence d&#146;une construction verbale dans la 
construction du sens du verbe. Enfin, nous pr&#233;sentons les r&#233;sultats d&#146;une premi&#232;re 
exp&#233;rimentation de notre mod&#232;le sur les constructions pr&#233;positionnelles du verbe jouer. 
</p>
<p>2 Cadre th&#233;orique 
Nous proposons d&#146;inscrire cette &#233;tude dans un cadre th&#233;orique mettant en parall&#232;le deux 
mod&#232;les. D&#146;une part le mod&#232;le de la grammaire constructionnelle d&#233;velopp&#233; par Ad&#232;le 
Goldberg (1995). Pour A. Goldberg, les constructions syntaxiques, et tout particuli&#232;rement les 
constructions verbales, sont par elles-m&#234;mes porteuses de sens, ind&#233;pendamment du contenu 
lexical des unit&#233;s linguistiques qu&#146;elles agencent. 
Le second mod&#232;le est celui de la construction dynamique du sens propos&#233; par B. Victorri et 
C. Fuchs (1996). Dans ce mod&#232;le, on associe &#224; chaque unit&#233; polys&#233;mique un espace 
s&#233;mantique repr&#233;sentant l&#146;ensemble de ses sens, et le sens de l&#146;unit&#233; dans un &#233;nonc&#233; donn&#233; est 
le r&#233;sultat d&#146;une interaction dynamique avec les autres unit&#233;s pr&#233;sentes dans l&#146;&#233;nonc&#233; qui 
conduisent &#224; d&#233;terminer la r&#233;gion de l&#146;espace s&#233;mantique pertinente dans cet &#233;nonc&#233;. 
L&#146;id&#233;e, qui r&#233;unit ces deux mod&#232;les, est de consid&#233;rer que les constructions verbales sont des 
&#233;l&#233;ments du co-texte qui contribuent, au m&#234;me titre que le co-texte lexical, au processus 
dynamique de construction du sens du verbe. Comme pour les unit&#233;s lexicales co-textuelles, &#224; 
chaque construction est donc associ&#233;e une r&#233;gion de l&#146;espace s&#233;mantique qui contient tous les 
sens compatibles avec cette construction. 
</p>
<p>3 M&#233;thode 
Nous disposons, au sein du laboratoire Lattice (http://www.lattice.ens.fr/), d&#146;un logiciel 
informatique, Visusyn, d&#233;velopp&#233; sous la direction de B. Victorri. Ce logiciel permet de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Polys&#233;mie verbale et construction syntaxique : exp&#233;rimentation sur le verbe jouer 
</p>
<p> 
</p>
<p>construire automatiquement l&#146;espace s&#233;mantique associ&#233; &#224; une unit&#233; lexicale (Ploux, Victorri, 
1998). En voici une br&#232;ve pr&#233;sentation. 
</p>
<p>3.1 Repr&#233;sentation graphique d&#146;un espace s&#233;mantique 
Pour pouvoir proposer la repr&#233;sentation de l&#146;espace s&#233;mantique d&#146;une unit&#233;, il faut d&#146;abord 
r&#233;ussir &#224; repr&#233;senter chacun de ses sens. Si l&#146;on veut d&#233;finir chaque sens en terme de 
synonymes rempla&#231;ables, g&#233;n&#233;ralement, un seul synonyme ne suffit pas puisque les 
synonyme d&#146;un verbe polys&#233;mique peuvent aussi &#234;tre polys&#233;mique. 
 L&#146;id&#233;e est alors d&#146;utiliser le dictionnaire &#233;lectronique des synonymes du fran&#231;ais du 
laboratoire CRISCO (www.crisco.unicaen.fr). Celui-ci nous fournit, pour une unit&#233; donn&#233;e, 
non seulement la liste de ses synonymes, mais aussi la liste des &#171; cliques &#187; de synonymes. Le 
terme de clique, emprunt&#233; &#224; la th&#233;orie des graphes correspond &#224; un graphe compl&#232;tement 
connexe, c'est-&#224;-dire un graphe o&#249; tous les sommets sont directement reli&#233;s entre eux. Ici, une 
clique de synonymes de jouer est un groupe de synonymes contenant jouer, et o&#249; chaque 
&#233;l&#233;ment est synonyme avec les autres : 
</p>
<p> 
</p>
<p> 
 
 
</p>
<p> 
</p>
<p> 
</p>
<p>Pour la repr&#233;sentation graphique, chaque point correspond &#224; une clique de synonymes, c'est-&#224;-
dire &#224; un sens pr&#233;cis du verbe &#233;tudi&#233;. La distance entre deux cliques d&#233;pend de deux crit&#232;res : 
plus deux cliques ont des synonymes en commun, plus elles seront proches. Mais plus un 
synonyme est omnipr&#233;sent dans l&#146;ensemble des cliques, moins il sera influant pour la distance 
(Ploux, Victorri, 1998. Pr&#233;cisions du calcul : Victorri, 2002). En s&#233;lectionnant les deux 
dimensions qui dispersent le plus l&#146;espace des cliques (analyse factorielle des 
correspondances), nous obtenons alors une repr&#233;sentation graphique en 2D, de toutes les 
cliques de synonymes (cf. Figure 1). 
On peut noter, &#224; l&#146;aide de la figure 1 que la r&#233;partition de nos cliques dans l&#146;espace 
s&#233;mantique de jouer n&#146;est pas homog&#232;ne, et que des &#171; branches de sens &#187; se d&#233;marquent tr&#232;s 
nettement. Notre mod&#232;le met en &#233;vidence trois principales &#171; branches &#187; qui sont : en haut les 
sens tournant autours de &#171; jouer, miser, parier, ponter &#187;, en bas &#224; droite &#171; badiner, fol&#226;trer, 
jouer, plaisanter, s&#146;amuser&#187;, puis en bas &#224; gauche &#171; contrefaire, feindre, imiter, jouer, 
simuler &#187;. 
L&#146;id&#233;e est alors d&#146;exploiter cet espace s&#233;mantique pour d&#233;sambigu&#239;ser le verbe polys&#233;mique 
jouer. En effet, dans un &#233;nonc&#233; donn&#233;, si un &#233;l&#233;ment co-textuel de jouer active certaines zones 
de l&#146;espace s&#233;mantique et en inhibe d&#146;autres, nous pourrons mettre en relation ce co-texte et 
les sens qu&#146;il impose au verbe jouer. C&#146;est ce qui a &#233;t&#233; d&#233;velopp&#233; plus r&#233;cemment dans 
Visusyn, en calculant le degr&#233; d&#146;affinit&#233; d&#146;un &#233;l&#233;ment co-textuel pour chaque clique de 
l&#146;espace s&#233;mantique. 
 
</p>
<p>jouer 
</p>
<p>parier ponter
</p>
<p>miser
badiner
</p>
<p>s&#146;amuser taquiner
</p>
<p>plaisanter
</p>
<p>jouer </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Jacquet 
</p>
<p> 
</p>
<p> 
</p>
<p>3.2 Calcul du degr&#233; d&#146;affinit&#233; d&#146;un &#233;l&#233;ment co-textuel 
L&#146;objectif est de repr&#233;senter l&#146;influence d&#146;un &#233;l&#233;ment co-textuel sur le sens d&#146;une unit&#233; 
polys&#233;mique en construisant automatiquement sur l&#146;espace s&#233;mantique la r&#233;gion des sens 
admissibles en pr&#233;sence de l&#146;&#233;l&#233;ment co-textuel (Victorri, Fran&#231;ois, Manguin, &#224; para&#238;tre). 
Nous utilisons pour cela le corpus Frantext (http://frantext.inalf.fr) qui nous fournit le nombre 
d&#146;occurrences attest&#233;es de l&#146;&#233;l&#233;ment co-textuel avec l&#146;unit&#233; polys&#233;mique ainsi qu&#146;avec chacun 
de ses synonymes. A partir de ces donn&#233;es, nous calculons le &#171; degr&#233; d&#146;affinit&#233; &#187; d&#146;un 
&#233;l&#233;ment co-textuel avec une clique verbale. Ce degr&#233; d&#146;affinit&#233;, compris entre 0 et 1, est 
d&#146;autant plus grand qu&#146;il y a plus d&#146;occurrences dans le corpus de l&#146;&#233;l&#233;ment co-textuel avec 
chaque verbe de la clique (Pr&#233;cision du calcul : B. Victorri, 2002).  
Cette m&#233;thode a &#233;t&#233; utilis&#233;e avec succ&#232;s pour &#233;tudier l&#146;influence du nom r&#233;gissant sur des 
adjectifs polys&#233;miques (Victorri, 1998 ; Venant, 2002). Pour r&#233;sumer, ce mod&#232;le permet de 
calculer automatiquement que dans le couple &#171; terre + s&#232;che &#187;, les zones de sens activ&#233;es de 
l&#146;adjectif sec seront plut&#244;t du cot&#233; des cliques telles que &#171; aride, dess&#233;ch&#233;, sec, st&#233;rile &#187; que 
des cliques telles que &#171;aust&#232;re, rude, sec, s&#233;v&#232;re&#187;. Si l&#146;on applique cette m&#233;thode aux verbes 
polys&#233;miques en &#233;tudiant l&#146;influence du nom de t&#234;te du compl&#233;ment essentiel, nous obtenons 
des r&#233;sultats d&#233;j&#224; int&#233;ressants. Mais les limites de l&#146;approche lexicale apparaissent 
rapidement. En effet, il n&#146;est pas possible de distinguer les deux &#233;nonc&#233;s qui suivent :  
</p>
<p>(7) Elle joue la petite fille. (imiter) 
(8) Elle joue avec sa fille. (s&#146;amuser) 
</p>
<p>Ces deux &#233;nonc&#233;s poss&#232;dent la m&#234;me t&#234;te de compl&#233;ment, fille, pourtant le sens de jouer n&#146;est 
pas du tout le m&#234;me. Nous allons donc nous int&#233;resser &#224; l&#146;apport des constructions verbales 
dans le sens du verbe. 
</p>
<p>Figure 1 : repr&#233;sentation de l&#146;espace s&#233;mantique de jouer </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Polys&#233;mie verbale et construction syntaxique : exp&#233;rimentation sur le verbe jouer 
</p>
<p> 
</p>
<p>4 Premi&#232;re &#233;tude sur les constructions verbales 
L&#146;objectif est de faire ressortir les diff&#233;rents sens d&#146;un verbe, pour une construction verbale 
donn&#233;e. En cela, notre objectif est proche de celui d&#146;un lexique-grammaire (Gross, 1989). 
Mais la m&#233;thode est tr&#232;s diff&#233;rente. Les diff&#233;rents sens attribu&#233;s &#224; une construction verbale ne 
sont pas d&#233;finis en fonction d&#146;une &#233;tude linguistique sur chaque verbe, mais en fonction de 
calculs de fr&#233;quences fait sur un corpus de r&#233;f&#233;rence. Le deuxi&#232;me point d&#146;opposition, est que 
nos espaces s&#233;mantiques sont continus. Par cons&#233;quent, les sens que nous cherchons &#224; obtenir 
pour une construction verbale donn&#233;e ne seront pas repr&#233;sent&#233;s par un ensemble d&#146;&#233;nonc&#233;s 
repr&#233;sentatifs, mais par l&#146;activation de zones dans notre espace s&#233;mantique. 
</p>
<p>4.1 Travail sur les constructions pr&#233;positionnelles 
Etant donn&#233; les analyseurs syntaxiques disponibles actuellement, il est assez difficile d'obtenir 
automatiquement des corpus d&#146;&#233;nonc&#233;s d&#233;compos&#233;s grammaticalement de mani&#232;re fiable. Par 
cons&#233;quent, il nous fallait choisir une construction facilement identifiable dans un corpus. 
C&#146;est le cas des constructions pr&#233;positionnelles (verbe + compl&#233;ment introduit par une 
pr&#233;position) puisque, lorsqu&#146;une pr&#233;position est plac&#233;e juste apr&#232;s le verbe, on a quasiment 
toujours &#224; faire &#224; une construction pr&#233;positionnelle (les contre exemples sont les partitifs de, 
du et des, et quelques autres constructions rares)1.  
La seconde raison de notre choix est que, au m&#234;me titre que le verbe jouer, les pr&#233;positions 
ont &#233;t&#233; &#224; l&#146;origine d'un tr&#232;s grand nombre d'&#233;tudes linguistiques, que nous &#233;voquerons lors de 
la pr&#233;sentation de nos r&#233;sultats. Les pr&#233;positions que nous traitons sont &#171; &#224; ; de ; avec ; dans ; 
sur &#187;. 
&#8226; Protocole d&#146;&#233;valuation 
Nous avons choisi d&#146;&#233;valuer notre mod&#232;le en confrontant nos r&#233;sultats &#224; un ensemble d&#146;&#233;tudes 
linguistiques d&#233;taill&#233;es traitant du sens des constructions pr&#233;positionnelles. Pour chaque 
construction, l&#146;id&#233;e est de confronter les diff&#233;rentes zones de sens du verbe propos&#233;es par 
Visusyn, avec les diff&#233;rents sens que lui attribuent les linguistes (principalement Cadiot, 
1999, et Romero-Lopes, 2002). 
</p>
<p>4.2 R&#233;sultats : les sous-espaces s&#233;mantiques des constructions pr&#233;positionnelles 
En utilisant les calculs de degr&#233; d&#146;affinit&#233; pr&#233;sent&#233;s ci-dessus (cf. 3.2), nous avons obtenu les 
repr&#233;sentations graphiques du sens du verbe jouer en fonction de la construction 
pr&#233;positionnelle dans laquelle il est employ&#233;. C'est-&#224;-dire que pour chaque construction 
pr&#233;positionnelle, on extrait de Frantext le nombre d&#146;occurrences de cette construction avec 
l&#146;unit&#233; polys&#233;mique, jouer, ainsi qu&#146;avec chacun de ses synonymes. A partir de ces donn&#233;es, 
nous calculons le &#171; degr&#233; d&#146;affinit&#233; &#187; de la construction avec chaque verbe. Dans une clique, 
plus il y aura de synonymes de degr&#233; d&#146;affinit&#233; &#233;lev&#233;, plus cette clique aura un degr&#233; d&#146;affinit&#233; 
&#233;lev&#233; avec cette construction. 
Pour faciliter la lecture, nous nommerons la repr&#233;sentation de sens correspondante, le sous-
espace s&#233;mantique de la construction &#171; jouer + pr&#233;position &#187;. Nous allons donc exposer 
chacune de ces repr&#233;sentations, et les confronter &#224; l&#146;&#233;tude linguistique faite par Pierre Cadiot 
sur les constructions pr&#233;positionnelles de jouer (Cadiot, 1993, 1997, 1999). 
 
</p>
<p>&#8226; La construction pr&#233;positionnelle &#171; Jouer sur &#187; 
Sur la figure 2 ci-dessous, ainsi que sur toutes celles qui vont suivre, on retrouve toutes les 
cliques de synonymes du verbe jouer, repr&#233;sent&#233;es par les points, ainsi que des zones de sens 
du verbe jouer, qui, si le mod&#232;le est juste, doivent correspondre aux sens de jouer lorsque la 
construction verbale est &#171; jouer sur &#187;. 
                                                 
1  Dans cette &#233;tude, nous ne distinguons pas les compl&#233;ments essentiels des circonstanciels puisque nous 
travaillons sur un corpus non analys&#233;. Plus r&#233;cemment, nous avons fait la m&#234;me &#233;tude sur un corpus plus petit, 
en distinguant les deux types de compl&#233;ment. Les r&#233;sultats obtenus nous ont permis d&#146;affiner nos conclusions. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Jacquet 
</p>
<p> 
</p>
<p> 
</p>
<p> 
 
Afin d&#146;&#233;valuer les r&#233;sultats obtenus, il nous faut confronter nos donn&#233;es &#224; celles propos&#233;es par 
un linguiste. Pierre Cadiot propose de d&#233;finir les diff&#233;rents sens que peut prendre le verbe 
jouer avec la construction &#171; jouer sur &#187; par les &#233;nonc&#233;s suivants (Cadiot, 1999)  : 
Enonc&#233;s illustratifs (Cadiot) Pr&#233;cision du sens (Cadiot) Synonymes correspondants 
jouer sur un cheval mettre sa mise miser, parier 
Jouer sur les grains sp&#233;culer sp&#233;culer, miser, parier 
la barque joue sur son ancre se mouvoir se mouvoir, remuer 
jouer sur les nerfs de quelqu'un tirer profit de la nervosit&#233; agiter, manier 
jouer sur plusieurs registres mettre en &#156;uvre agir, influer 
jouer sur les mots tirer parti des &#233;quivoques feinter, rouler, tromper 
 
Dans le tableau ci-dessus, la premi&#232;re colonne correspond aux diff&#233;rents sens propos&#233;s par P. 
Cadiot, illustr&#233;s par des &#233;nonc&#233;s-types. La seconde colonne correspond &#224; une explication du 
sens que P. Cadiot donne au verbe jouer. Enfin, la derni&#232;re colonne correspond &#224; des 
synonymes de jouer pr&#233;sents dans le dictionnaire des synonymes que nous utilisons, et qui 
selon nous, illustrent le sens que P. Cadiot donne &#224; jouer dans chaque &#233;nonc&#233;. 
Nous avons fait ressortir sur la figure 2, les cliques contenant les synonymes de la derni&#232;re 
colonne. On peut constater que la quasi-totalit&#233; des sens propos&#233;s par P. Cadiot se trouvent &#224; 
l&#146;int&#233;rieur de la zone activ&#233;e par notre mod&#232;le. La seule exception est la repr&#233;sentation de 
l&#146;&#233;nonc&#233; &#171; jouer sur les grains &#187; que P. Cadiot a assimil&#233; &#224; la notion de &#171; sp&#233;culer &#187;. Nous 
pensons que dans cet &#233;nonc&#233;, on peut aussi assimiler le sens de jouer &#224; &#171; miser, parier &#187;, ce 
qui correspondrait alors mieux au sous-espace s&#233;mantique calcul&#233;. Cependant, m&#234;me si l&#146;on 
admet cela il n&#146;en reste pas moins que dans cet &#233;nonc&#233;, jouer doit &#234;tre assimil&#233; &#224; sp&#233;culer. Il y 
a donc ici une lacune de notre mod&#232;le. La principale raison est, selon nous, le fait qu&#146;il y ait 
peu de cliques dans cette partie de l&#146;espace, ce qui fait que les distances calcul&#233;es sont 
</p>
<p>Figure 2 : sous-espace s&#233;mantique de &#171; jouer sur &#187; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Polys&#233;mie verbale et construction syntaxique : exp&#233;rimentation sur le verbe jouer 
</p>
<p> 
</p>
<p>accentu&#233;es, puisque non contraintes par d&#146;autres cliques ayant un sens diff&#233;rent. Cela fait 
partie des choses &#224; affiner dans notre mod&#232;le. 
Une autre observation qui conforte les r&#233;sultats du mod&#232;le est que l&#146;ensemble des &#233;nonc&#233;s 
propos&#233;s par P. Cadiot ne sont pas regroup&#233;s dans une zone restreinte du sous-espace 
s&#233;mantique de &#171; jouer sur &#187;. Au contraire, les diff&#233;rents sens propos&#233;s par P. Cadiot sont 
plac&#233;s aux contours du sous-espace calcul&#233;. Par cons&#233;quent, la zone d&#233;limit&#233;e par le mod&#232;le 
poss&#232;de des caract&#233;ristiques qui semblent correspondre au sous-espace s&#233;mantique de &#171; jouer 
sur &#187;. 
&#8226; La construction pr&#233;positionnelle &#171; jouer avec &#187; 
</p>
<p> 
 
Le mode de pr&#233;sentation et d&#146;&#233;valuation est le m&#234;me que pour la construction &#171; jouer sur &#187;. 
Les &#233;nonc&#233;s propos&#233;s par P. Cadiot sont :  
Enonc&#233;s illustratifs Pr&#233;cision du sens Synonymes correspondants 
jouer avec sa sant&#233; exposer avec l&#233;g&#232;ret&#233; compromettre, risquer 
jouer avec le feu manier par d&#233;fi ou distraction manier, tripoter 
Jouer avec le chien tirer un amusement de  s&#146;amuser, se divertir 
 
Ici, la superposition est encore assez bonne puisque notre sous-espace calcul&#233; englobe 
l&#146;ensemble des &#233;nonc&#233;s-types, et que ces derniers sont assez bien r&#233;partis dans ce sous-espace. 
On peut m&#234;me constater qu&#146;une zone de sens a &#233;t&#233; activ&#233;e par notre mod&#232;le, mais ne poss&#232;de 
pas d&#146;&#233;quivalent dans les &#233;nonc&#233;s-types de P. Cadiot. Cette zone correspond &#224; jouer au sens 
de &#171; abuser ; mentir ; mystifier ; tromper &#187;. Un &#233;nonc&#233; correspondant pourrait &#234;tre : 
</p>
<p>(9) &#171; Il joue avec ses employ&#233;s &#187; 
On retrouve dans cet &#233;nonc&#233;, d&#146;une part le sens de s&#146;amuser, mais aussi le sens de abuser, 
tromper. 
On peut noter que notre mod&#232;le calcule un sous-espace de la construction &#171; jouer avec &#187; 
correspondant &#224; celui propos&#233; par P. Cadiot, et mieux encore, il met en &#233;vidence une zone de 
sens justifi&#233;e qui n&#146;avait pas &#233;t&#233; prise en compte par P. Cadiot. 
</p>
<p>Figure 3 : espace s&#233;mantique de &#171; jouer avec &#187;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Jacquet 
</p>
<p> 
</p>
<p>&#8226; Les constructions &#171; jouer &#224; &#187; et &#171; jouer de &#187; 
Une analyse approfondie a &#233;t&#233; faite pour chacune de ces constructions (G. Jacquet, 2002). 
Dans cette &#233;tude, nous nous int&#233;resserons plut&#244;t &#224; une mise en parall&#232;le de ces deux 
constructions qui toutes deux emploient une pr&#233;position appel&#233;e parfois &#171; incolore &#187; 
(Vandeloise, 1993), du fait de l&#146;absence apparente de sens intrins&#232;que. 
 
</p>
<p> 
Figure 4 : Sous-espaces s&#233;mantiques de &quot;jouer de&quot; et &quot;jouer &#224;&quot; 
</p>
<p>Au cours de nos manipulations de corpus, nous nous sommes aper&#231;u qu&#146;il &#233;tait tr&#232;s rare 
d&#146;observer pour une m&#234;me construction &#171; verbe + pr&#233;position + syntagme nominal &#187;, des cas 
avec la pr&#233;position &#224; aux c&#244;t&#233;s de cas avec la pr&#233;position de. Il semble donc que leur emploi 
soit assez herm&#233;tiquement s&#233;par&#233; pour un verbe donn&#233;. Par exemple, pour le verbe jouer, on 
joue d&#146;un instrument de musique, alors qu&#146;on joue &#224; un jeu ou un sport (Cadiot, 1993, 1999). 
Et l&#146;inverse est tr&#232;s rare. Ce n&#146;est donc pas un hasard si les espaces s&#233;mantiques que nous 
obtenons pour &#171; jouer &#224; &#187; et &#171; jouer de &#187; sont oppos&#233;s. 
Nous proposons d&#146;interpr&#233;ter cette opposition par les constatations suivantes : dans une 
construction &#171; jouer de SN &#187;, le SN correspond souvent &#224; l&#146;espace de l&#146;activit&#233; de jeu, alors 
que dans une construction &#171; jouer &#224; SN &#187;, le SN correspond &#224; l&#146;activit&#233; en elle-m&#234;me. Ce qui 
fait que &#224; implique la connaissance pr&#233;alable de l&#146;espace d&#146;activit&#233;. Pour pouvoir prononcer 
un &#233;nonc&#233; tel que jouer au foot, Il faut au pr&#233;alable conna&#238;tre l&#146;espace d&#146;activit&#233; auquel cela 
correspond. Alors que, m&#234;me si on ne sait pas se servir d&#146;un instrument de musique, &#233;tant 
donn&#233; que son espace d&#146;activit&#233; est fix&#233; (l&#146;instrument de musique), on peut dire que l&#146;on joue 
d&#146;un instrument (Pour des pr&#233;cisions sur ce ph&#233;nom&#232;ne : Jacquet, 2002). 
Afin de mieux comprendre cette opposition, nous allons nous int&#233;resser aux cas particuliers, 
c'est-&#224;-dire les constructions &#171; jouer + pr&#233;position + syntagme nominal &#187; qui acceptent les 
pr&#233;positions &#224; et de (les &#233;nonc&#233;s sont tir&#233;s de Frantext) : 
</p>
<p>(10) &#171; Jouer au couteau &#187; 
(11) &#171; Jouer du couteau &#187; 
</p>
<p>Le sens de jouer au couteau reste ind&#233;termin&#233; si cette activit&#233; n&#146;est pas d&#233;finie dans le 
contexte. C'est-&#224;-dire que pour comprendre le sens de jouer au couteau, il nous faut des 
&#233;l&#233;ments permettant de construire l&#146;espace d&#146;activit&#233;, puisque l&#146;on parle directement ici de 
l&#146;activit&#233;. Alors que jouer du couteau, fournit directement un sens, c'est-&#224;-dire qu&#146;il fait appel </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Polys&#233;mie verbale et construction syntaxique : exp&#233;rimentation sur le verbe jouer 
</p>
<p> 
</p>
<p>&#224; ce que nous avons comme donn&#233;es pr&#233;alables sur cet outil, pour construire, dans cette 
situation, l&#146;espace d&#146;activit&#233;. 
</p>
<p>(12) &#171; Jouer au piano &#187; 
(13)  &#171; Jouer du piano &#187; 
</p>
<p>Les &#233;nonc&#233;s (12) et (13) sont int&#233;ressants parce que le sens du verbe ne change pas : 
pratiquer, interpr&#233;ter. Or, si l&#146;on reporte ces synonymes dans l&#146;espace s&#233;mantique de jouer, la 
zone correspondante est exactement &#224; la fronti&#232;re entre les sous-espaces s&#233;mantiques de 
&#171; jouer &#224; &#187;, et de &#171; jouer de &#187; (cf. figure 4). Cela s&#146;explique  par le fait que la notion 
&#171; d&#146;interpr&#233;ter, repr&#233;senter, mettre en sc&#232;ne &#187;, v&#233;hicul&#233;e par &#171; jouer au piano &#187; est tr&#232;s 
proche de &#171; pratiquer, user, faire &#187; qui caract&#233;rise la notion g&#233;n&#233;rale de jouer d&#146;un 
instrument. 
Ainsi, l&#146;opposition mise en &#233;vidence par les zones de sens calcul&#233;es semble bien refl&#233;ter 
l&#146;opposition linguistique existant entre le sens de jouer dans &#171; jouer de quelque chose &#187; et 
dans &#171; jouer &#224; quelque chose &#187;. Le caract&#232;re incolore de ces pr&#233;positions nous conforte dans 
l&#146;id&#233;e que l&#146;influence calcul&#233;e ici est celle des constructions syntaxiques, et non celle du 
lexique. 
</p>
<p>4.3 Discussion des r&#233;sultats 
L&#146;&#233;valuation de notre mod&#232;le, m&#234;me imparfaite, a fait ressortir une assez bonne efficacit&#233; de 
notre syst&#232;me &#224; calculer le sens du verbe jouer en fonction de la construction pr&#233;positionnelle 
dans laquelle il est employ&#233;. Ceci &#233;tant, notre mod&#232;le est encore limit&#233; par l&#146;absence 
d&#146;analyseur syntaxique. C&#146;est un des principaux points sur lesquels nous travaillons 
actuellement. On peut noter toutefois, que malgr&#233; l&#146;imperfection des donn&#233;es de d&#233;part, nous 
obtenons d&#233;j&#224; des r&#233;sultats significatifs, ce qui nous laisse beaucoup d&#146;espoir pour la suite. 
 
Un des probl&#232;mes caus&#233;s par l&#146;absence d&#146;analyseur syntaxique est le fait de ne pas pouvoir 
distinguer les compl&#233;ments essentiels des circonstanciels. Par cons&#233;quent, les sous-espaces 
s&#233;mantiques que nous avons calcul&#233;s correspondent &#224; l&#146;influence des constructions 
pr&#233;positionnelles qu&#146;elles soient essentielles ou circonstancielles. 
Dans notre cadre th&#233;orique, cette fusion n&#146;est pas r&#233;dhibitoire puisque nous consid&#233;rons qu&#146;il 
n&#146;y a pas de fronti&#232;re &#233;tablie entre ces deux types de compl&#233;ment. Il s&#146;agit plut&#244;t d&#146;un 
continuum o&#249; l&#146;on passe progressivement de l&#146;essentiel au circonstanciel (Victorri, Fuchs, 
1996 ; Fabre, Fr&#233;rot, 2002).  
</p>
<p>(14) &#171; Les enfants jouent sur le canap&#233; &#187; 
L&#146;&#233;nonc&#233; (14) illustre bien la difficult&#233; &#224; classer certains compl&#233;ments dans l&#146;une des deux 
cat&#233;gories. En pratique, la pr&#233;sence des compl&#233;ments circonstanciels dans notre calcul est 
plus probl&#233;matique puisqu&#146;elle peut d&#233;former nos sous-espaces s&#233;mantiques. Conscients de 
ces probl&#232;mes, nous travaillons actuellement &#224; caract&#233;riser automatiquement les compl&#233;ments 
de notre corpus. Ces travaux s&#146;inscrivent dans le m&#234;me courant que les travaux de C&#233;cile 
Fabre et C&#233;cile Fr&#233;rot (Fabre, Fr&#233;rot, 2002). 
</p>
<p>5 Conclusion et perspectives 
Notre objectif &#233;tait de construire un outil qui permette de d&#233;sambigu&#239;ser automatiquement un 
verbe polys&#233;mique en fonction de sa construction verbale. 
A partir du mod&#232;le de la construction dynamique du sens, nous avons propos&#233; une m&#233;thode 
permettant de calculer l&#146;influence d&#146;une construction verbale sur le sens du verbe.  
Les r&#233;sultats obtenus lors de la premi&#232;re exp&#233;rimentation de cette m&#233;thode sont assez 
encourageants, puisque nous avons pu calculer l&#146;influence de quelques constructions 
pr&#233;positionnelles sur le sens du verbe jouer. Cette &#233;tude semble confirmer qu&#146;il est possible 
de r&#233;duire automatiquement l&#146;ambigu&#239;t&#233; de sens d&#146;un verbe, gr&#226;ce &#224; sa construction verbale. 
Enfin, nos r&#233;sultats semblent aller dans le sens de l&#146;hypoth&#232;se de A. Goldberg, c&#146;est-&#224;-dire </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Guillaume Jacquet 
</p>
<p> 
</p>
<p>consid&#233;rer les constructions verbales comme des unit&#233;s linguistiques porteuses de sens 
intrins&#232;que. 
Reste maintenant &#224; g&#233;n&#233;raliser notre &#233;tude &#224; l&#146;ensemble des verbes, et surtout &#224; l&#146;ensemble 
des constructions verbales. Comme nous l&#146;avons d&#233;j&#224; pr&#233;cis&#233;, la mise en place d&#146;un tel 
syst&#232;me n&#233;cessite l&#146;introduction d&#146;analyseurs syntaxiques robustes. Nous travaillons d&#146;ores et 
d&#233;j&#224; en collaboration avec E. Giguet qui d&#233;veloppe une plateforme, WIMS, comportant un 
analyseur syntaxique (Giguet, 2003), ainsi qu&#146;avec D. Bourigault dont les logiciels SYNTEX 
et UPERY semblent bien adapt&#233;s pour distinguer automatiquement certains compl&#233;ments 
essentiels des compl&#233;ments circonstanciels (Bourigault, 2002). 
</p>
<p>6 Remerciements 
Nous remercions Sophie Pr&#233;vost, Emmanuel Giguet pour leur relecture attentive, ainsi que 
C&#233;cile Fabre pour ses commentaires constructifs. 
</p>
<p>7 Bibliographie 
Bourigault D. (2002), Upery : un outil d'analyse distributionnelle &#233;tendue pour la construction 
</p>
<p>d&#146;ontologies &#224; partir de corpus, Actes de la 9&#232;me conf&#233;rence annuelle sur le Traitement 
Automatique des Langues (TALN 2002), Nancy, pp. 75-84 
</p>
<p>Cadiot P. Berthonneau A.-M. (1993), Les pr&#233;positions, m&#233;thode d&#146;analyse, Presse 
Universitaire de Lille. 
</p>
<p>Cadiot P. (1997), Les pr&#233;positions abstraites en fran&#231;ais, Paris, Armand Colin. 
Cadiot P. (1999), Les sens de jouer : esquisse d&#146;une approche par le biais des attaches 
</p>
<p>pr&#233;positionnelles, Recherches en linguistique et psychologie cognitive, n&#176;11, Presses 
Universitaires de Reims. 
</p>
<p>Fabre C., Fr&#233;rot C. (2002), Groupes pr&#233;positionnels arguments ou circonstants : vers un 
rep&#233;rage automatique en corpus, Actes de la 9&#232;me conf&#233;rence annuelle sur le 
Traitement Automatique des Langues (TALN 2002), Nancy. 
</p>
<p>Giguet E. (2003), Rapport d&#146;activit&#233; CNRS, laboratoire Lattice CNRS UMR 8094 &#150; ENS, 
Montrouge. 
</p>
<p>Goldberg A. (1995), Constructions : a construction grammar approach to argument 
structure, Chicago and London, University of Chicago Press. 
</p>
<p>Gross G. (1989), d&#233;sambigu&#239;sation s&#233;mantique &#224; l&#146;aide d&#146;un lexique-grammaire, Semantica, 
Paris, Ladl et Univ. Paris 7. 
</p>
<p>Jacquet G. (2002), La grammaire cognitive au service de la d&#233;sambigu&#239;sation du sens : 
exp&#233;rimentation sur le verbe jouer, m&#233;moire de DEA de l&#146;universit&#233; Paris 6. 
</p>
<p>Leland, Tracy, 2001, la polys&#233;mie lexicale : l&#146;articulation entre la signification et la 
r&#233;f&#233;rence. Etude comparative de trois polys&#232;mes en fran&#231;ais et en anglais, th&#232;se de 
doctorat de l&#146;Universit&#233; de Paris 8. 
</p>
<p>Ploux S., Victorri B. (1998), construction d&#146;espaces s&#233;mantiques &#224; l&#146;aide de dictionnaires de 
synonymes, TAL , 39, n&#176;1, pp 161-182. 
</p>
<p>Romero-Lopes Marcia C. (2002), Identit&#233; et variation du verbe jouer, Langue fran&#231;aise, Paris, 
Larousse, 133. 
</p>
<p>Vandeloise C. (1993), La pr&#233;position &#224; p&#226;lit-elle devant toucher ?, Langages, n&#176;110, pp 107. 
Venant F. (2002), m&#233;moire de DEA de l&#146;universit&#233; Paris 6. 
Victorri B., Fuchs C. (1996), La polys&#233;mie, construction dynamique du sens, Paris, Herm&#232;s. 
Victorri B., (2002), Espaces s&#233;mantiques et repr&#233;sentation du sens, Textualit&#233;s et nouvelles 
</p>
<p>technologies, &#233;c/artS, 3. 
Victorri B., Fran&#231;ois J., Manguin J.L. (&#224; para&#238;tre): Dynamical construction of meaning in 
</p>
<p>polysemic units, in Willems D(&#233;d.), Points of comparison in linguistic theory: from 
morphology to discourse. </p>

</div></div>
</body></html>