<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Proc&#233;dures d&#146;apprentissage endog&#232;ne doubl&#233;es de ressources exog&#232;nes : r&#233;solution en corpus d&#146;une ambigu&#239;t&#233; sur &#147;de &#148;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Proc&#233;dures d&#146;apprentissage endog&#232;ne doubl&#233;es de ressources 
exog&#232;nes : r&#233;solution en corpus d&#146;une ambigu&#239;t&#233; sur &#147; de &#148; 
</p>
<p> 
 
</p>
<p>C&#233;cile Fr&#233;rot 
 
</p>
<p>ERSS &#150; Universit&#233; Toulouse-Le Mirail 
Maison de la Recherche 
</p>
<p>5 all&#233;es A. Machado 
31058 Toulouse Cedex   
</p>
<p>frerot@univ-tlse2.fr 
 
 
</p>
<p>Mots-clefs &#150; Keywords  
analyse syntaxique automatique, approche endog&#232;ne, ressource exog&#232;ne, approche mixte, 
ambigu&#239;t&#233; cat&#233;gorielle 
 
automatic parsing, endogenous strategy, exogenous resources, hybrid approach, POS 
ambiguity 
</p>
<p>R&#233;sum&#233; &#150; Abstract 
Dans cette &#233;tude, nous nous int&#233;ressons &#224; l&#146;apport de ressources exog&#232;nes dans un analyseur 
syntaxique de corpus bas&#233; sur des proc&#233;dures d&#146;apprentissage endog&#232;ne. Nous menons une 
exp&#233;rience en corpus sur un cas d&#146;ambigu&#239;t&#233; cat&#233;gorielle du fran&#231;ais (forme de en position 
postverbale, article ou pr&#233;position). Apr&#232;s avoir pr&#233;sent&#233; et &#233;valu&#233; la strat&#233;gie endog&#232;ne, nous 
en analysons les limites. Nous discutons ensuite la perspective d&#146;une approche mixte 
combinant des informations acquises de mani&#232;re endog&#232;ne &#224; des informations exog&#232;nes 
(donn&#233;es de sous-cat&#233;gorisation verbale sur la pr&#233;position de). Nous montrons alors comment 
un apport maximal de ressources exog&#232;nes am&#233;liore les performances de l&#146;analyseur (+8%, 
+15% sur les deux corpus &#233;valu&#233;s). Nous pr&#233;sentons les premiers r&#233;sultats d&#146;une approche 
mixte avant de conclure sur les orientations futures du travail.   
 
This paper addresses the issue of the contribution of exogenous resources within the 
framework of a parser, based on endogenous techniques. We discuss how exogenous 
resources could combine with endogenous techniques in the context of a POS French 
ambiguity (the word de, determiner or preposition). We present and evaluate our endogenous 
strategy on cases where verbs are adjacent to de. We highlight the limits of such a strategy 
and show how exogenous resources improve the parser output (+8%, +15% on the corpus 
evaluated). Finally, we present the first results of the combined strategy and conclude on 
future work.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fr&#233;rot 
</p>
<p>1 Introduction 
 
Notre cadre de travail est la r&#233;alisation de l&#146;outil d&#146;analyse syntaxique de corpus, Syntex 
(Bourigault, Fabre, 2000), dont l&#146;application principale est la construction de ressources 
lexicales sp&#233;cialis&#233;es &#224; partir de corpus (terminologies, ontologies, lexiques pour la 
traduction). La sp&#233;cificit&#233; majeure de l&#146;analyseur est d&#146;&#234;tre dot&#233; de proc&#233;dures 
d&#146;apprentissage endog&#232;ne (Bourigault, 1994) qui lui permettent d&#146;acqu&#233;rir, sur chaque 
nouveau corpus, les informations n&#233;cessaires &#224; la r&#233;solution des ambigu&#239;t&#233;s de rattachement 
syntaxique. Ce choix de ne fournir &#224; l&#146;analyseur aucune information s&#233;mantique ni donn&#233;e de 
sous-cat&#233;gorisation est li&#233; &#224; l&#146;hypoth&#232;se, forte, sur l&#146;idiosyncrasie des textes sp&#233;cialis&#233;s. Il 
s&#146;explique par la conviction, &#233;tay&#233;e par l&#146;analyse d&#233;taill&#233;e de textes de domaines distincts, 
qu&#146;on ne peut pas forc&#233;ment utiliser des connaissances linguistiques g&#233;n&#233;rales dans des textes 
sp&#233;cialis&#233;s, et que les textes d&#146;un domaine donn&#233; peuvent poss&#233;der des propri&#233;t&#233;s de 
compl&#233;mentation distinctes de celles d&#146;un autre domaine (Bourigault, Fabre, 2000, Fabre, 
Bourigault, 2001, Basili et al., 1997, Basili et al., 1999).  
 
Les m&#233;thodes bas&#233;es sur l&#146;acquisition de connaissances &#224; partir des seules donn&#233;es du corpus 
montrent cependant des limites. Dans notre analyseur, une des limites concerne certains 
ph&#233;nom&#232;nes rares, par leur nombre d&#146;occurrences dans les corpus, et non moins &#147; g&#233;n&#233;raux &#148; 
(c&#146;est-&#224;-dire recens&#233;s dans des dictionnaires de langue g&#233;n&#233;rale) qui &#233;chappent &#224; la strat&#233;gie 
endog&#232;ne, bas&#233;e sur la notion de productivit&#233; (Bourigault, 1994). D&#146;o&#249; un nombre 
d&#146;ambigu&#239;t&#233;s de rattachement syntaxique mal r&#233;solues, notamment au niveau des pr&#233;positions 
r&#233;gies par des verbes. C&#146;est le cas en particulier de structures verbales dont on peut penser 
qu&#146;elles sont d&#233;crites dans des ressources lexicales g&#233;n&#233;rales et que leur fonctionnement est 
stable d&#146;un corpus &#224; l&#146;autre. Partant de ce constat, nous faisons l&#146;hypoth&#232;se que les 
performances de l&#146;outil peuvent &#234;tre am&#233;lior&#233;es gr&#226;ce &#224; l&#146;introduction dans l&#146;analyseur de 
ressources exog&#232;nes d&#233;crites sous la forme de donn&#233;es de sous-cat&#233;gorisation verbale. Nous 
pensons qu&#146;une approche endog&#232;ne est n&#233;cessaire pour r&#233;soudre les sp&#233;cificit&#233;s du corpus 
trait&#233;, mais qu&#146;une telle approche pr&#233;sente n&#233;anmoins des limites et doit &#234;tre compl&#233;t&#233;e par 
des ressources exog&#232;nes. Les approches mixtes d&#233;j&#224; test&#233;es concernent (presque) 
exclusivement l&#146;acquisition de liens s&#233;mantiques et exploitent majoritairement des ressources 
existantes sp&#233;cialis&#233;es (Morin, 1998, Habert et al., 1998), beaucoup plus rarement des 
ressources g&#233;n&#233;rales (Basili et al., 1997, Hamon et al., 1998). C&#146;est ici dans le cadre d&#146;une 
analyse syntaxique automatique de corpus que nous souhaitons &#233;tudier la pertinence d&#146;une 
approche mixte exploitant des ressources lexicales g&#233;n&#233;rales.  
 
Nous pr&#233;sentons un premier travail sur une mise en &#156;uvre de cette approche. Nous menons 
une exp&#233;rience en corpus sur une ambigu&#239;t&#233; cat&#233;gorielle du fran&#231;ais concernant la forme de en 
position postverbale (article ou pr&#233;position). Apr&#232;s avoir pr&#233;sent&#233; et &#233;valu&#233; la strat&#233;gie 
endog&#232;ne, nous en analysons les limites. Nous montrons ensuite comment l&#146;apport d&#146;une 
ressource lexicale g&#233;n&#233;rale, listant les verbes sous-cat&#233;gorisant la pr&#233;position de, am&#233;liore les 
performances de l&#146;analyseur. Pour cette exp&#233;rience, nous construisons cette ressource &#224; partir 
des corpus soumis &#224; l&#146;&#233;valuation. Ce choix se justifie par l&#146;objectif m&#234;me de l&#146;&#233;tude qui vise &#224; 
mesurer l&#146;apport maximal d&#146;une ressource exog&#232;ne dans notre analyseur. Pour cela, il &#233;tait 
donc fondamental de nous mettre en situation d&#146;apport maximal, c&#146;est-&#224;-dire de disposer, pour 
les deux corpus &#233;valu&#233;s, de l&#146;ensemble de ces verbes.  
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Proc&#233;dures d&#146;apprentissage endog&#232;ne doubl&#233;es de  ressources exog&#232;nes  
</p>
<p>2 Etude de cas sur une ambigu&#239;t&#233; cat&#233;gorielle du fran&#231;ais  
 
Notre &#233;tude porte sur une ambigu&#239;t&#233; cat&#233;gorielle du fran&#231;ais concernant la forme de, et les 
ambigu&#239;t&#233;s port&#233;es par les formes du et des. Cette ambigu&#239;t&#233; est particuli&#232;rement &#147; rebelle &#148; &#224; 
l&#146;&#233;tiquetage morpho-syntaxique lorsque de se trouve en position postverbale (Leconte, 1998, 
Silberztein, 2000). Les formes du, des, de peuvent alors correspondre &#224; un article (il a fourni 
des r&#233;sultats int&#233;ressants) ou &#224; la pr&#233;position de (il doute des conclusions). Cette ambigu&#239;t&#233; 
est g&#233;n&#233;ralement trait&#233;e au cours de l&#146;&#233;tiquetage morpho-syntaxique via l&#146;utilisation de 
ressources lexicales - c&#146;est le cas en particulier de (A&#239;t-Mokhtar et al., 2002) qui exploitent 
des donn&#233;es de sous-cat&#233;gorisation verbale pour lever l&#146;ambigu&#239;t&#233;. Un traitement post-
&#233;tiquetage est rarement envisag&#233; m&#234;me s&#146;il semble s&#146;imposer, comme le constatent (Giguet, 
Vergne, 1997) qui utilisent des informations sur les sujets et objets des verbes pour r&#233;soudre 
l&#146;ambigu&#239;t&#233;. 
 
Dans le cadre de notre analyseur syntaxique, nous sommes confront&#233;s &#224; cette ambigu&#239;t&#233; qui 
n&#146;est que partiellement lev&#233;e par l&#146;&#233;tiqueteur. Or sa r&#233;solution s&#146;av&#232;re fondamentale pour 
notre outil. En effet, comme l&#146;ont montr&#233; (A&#239;t-Mokhtar, Chanod, 1997), la propagation des 
erreurs d&#146;&#233;tiquetage affaiblit nettement les performances de reconnaissance des objets directs 
et pr&#233;positionnels d&#146;un analyseur syntaxique. En outre, dans Syntex, c&#146;est &#224; partir des r&#233;sultats 
de l&#146;analyse syntaxique que s&#146;op&#232;re l&#146;analyse distributionnelle, qui vise &#224; faire &#233;merger des 
classes s&#233;mantiques de mots en fonction des contextes syntaxiques partag&#233;s (Bourigault, 
2002). Et ces contextes sont pr&#233;cis&#233;ment d&#233;termin&#233;s par les relations syntaxiques &#233;tablies par 
l&#146;analyseur ; dans le cas pr&#233;sent, il s&#146;agit de la relation syntaxique entre un verbe et de 
(marqu&#233;e OBJ - compl&#233;ment d&#146;objet direct - ou PREP - compl&#233;ment pr&#233;positionnel1).  
 
Notre strat&#233;gie de r&#233;solution ne s&#146;appuie pas sur les cas d&#233;j&#224; r&#233;solus par l&#146;&#233;tiqueteur ; nous 
&#147; effa&#231;ons &#148; ses choix et affectons l&#146;&#233;tiquette Prep2 &#224; de. C&#146;est au cours de l&#146;analyse 
syntaxique que l&#146;ambigu&#239;t&#233; est r&#233;solue ; plus exactement, la reconnaissance d&#146;un compl&#233;ment 
d&#146;objet direct ou pr&#233;positionnel nous permet aussi de r&#233;soudre l&#146;ambigu&#239;t&#233; cat&#233;gorielle. Le 
probl&#232;me consiste donc &#224; &#233;tablir de mani&#232;re automatique la relation syntaxique entre un verbe 
et de, quand pour une m&#234;me configuration syntaxique donn&#233;e, la nature de cette relation est 
ambigu&#235; (tableau 1).  
 
Configuration syntaxique Compl&#233;ment d&#146;objet direct  
</p>
<p>(relation OBJ) 
Compl&#233;ment pr&#233;positionnel 
</p>
<p>(relation PREP) 
Vb3+Prep+Det+NomP cr&#233;er des climats douter des ph&#233;nom&#232;nes 
</p>
<p>Vb+Prep+Det+NomS faire de la morphologie provenir d&#146;une source 
Vb+Prep+AdjP+NomP manifester de belles intentions profiter de diverses 
</p>
<p>opportunit&#233;s 
  
</p>
<p>Tableau 1 : Configurations syntaxiques ambigu&#235;s 
</p>
<p>                                                 
1  Pr&#233;cisons que dans l&#146;analyseur nous ne faisons aucune distinction entre groupes pr&#233;positionnels (GP) 
arguments ou circonstants. Quel que soit le statut du GP, nous cherchons &#224; le rattacher au verbe.  
2  Exemples : le syst&#232;me donne des r&#233;sultats satisfaisants 
                    donne  Prep|de Det|le r&#233;sultats  
              les sp&#233;cialistes doutent de la nature liquide du magma    
                          doutent  Prep|de Det|la nature 
3  Vb : verbe, Det : d&#233;terminant, NomP : nom pluriel, NomS : nom singulier, AdjP : adjectif pluriel.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fr&#233;rot 
</p>
<p>3 Strat&#233;gie endog&#232;ne : pr&#233;sentation et &#233;valuation 
 
3.1 Illustration de la strat&#233;gie 
</p>
<p> 
Le principe de l&#146;apprentissage endog&#232;ne est classiquement utilis&#233; dans l&#146;analyseur pour 
r&#233;soudre des cas d&#146;ambigu&#239;t&#233; de rattachement syntaxique (adjectival, pr&#233;positionnel). Ici, ce 
principe est mis en &#156;uvre non pour lever une ambigu&#239;t&#233; de rattachement mais pour d&#233;terminer 
la nature de la relation syntaxique (OBJ ou PREP) &#224; &#233;tablir entre un verbe et de en contexte 
contigu. La proc&#233;dure est la suivante : l&#146;analyseur acquiert des informations sur la 
compl&#233;mentation des verbes gr&#226;ce au rep&#233;rage de configurations syntaxiques non ambigu&#235;s 
pour la relation PREP. Il utilise ensuite ces informations pour calculer des indices, bas&#233;s sur 
la notion de productivit&#233;4 (Bourigault, Fabre, 2000). Dans la phase de r&#233;solution des cas 
ambigus, ces indices sont exploit&#233;s conjointement aux indices obtenus pour la relation OBJ 
(informations acquises gr&#226;ce au module de recherche des objets directs). Nous illustrons cette 
strat&#233;gie dans le tableau 2.  
 
1 Cas ambigus Vb + de + les + NomP 
</p>
<p>OBJ ou PREP ? 
 
</p>
<p> parler des sens : PREP              r&#233;aliser des exp&#233;riences : OBJ  
</p>
<p>2 Cas non ambigus 
PREP 
(indice PREP) 
</p>
<p>Vb + de + &#216; + NomPluriel 
Vb + de + Detindef + Nom 
 
parler de formes 
parler d&#146;une d&#233;sint&#233;gration 
</p>
<p> 
 
</p>
<p>3 Cas non ambigus OBJ 
(indice OBJ) 
</p>
<p> Vb + Det + Nom 
 
r&#233;aliser une action, r&#233;aliser les 
figures, r&#233;aliser un triage 
</p>
<p>4 Indices OBJ(parler) = 0 
PREP(parler) = 2  
</p>
<p>OBJ(r&#233;aliser) = 3 
PREP(r&#233;aliser) = 0 
</p>
<p>5 D&#233;cision parler des sens ! PREP r&#233;aliser des exp&#233;riences ! OBJ 
 
</p>
<p>Tableau 2 : Strat&#233;gie endog&#232;ne . Les donn&#233;es se lisent ainsi : pour r&#233;soudre les cas ambigus 
(1), l&#146;analyseur s&#146;appuie sur la r&#233;solution de cas non ambigus pour PREP et OBJ (2, 3) ; il 
</p>
<p>calcule ensuite des indices en faveur de la relation PREP ou OBJ et les exploite conjointement 
dans la phase de r&#233;solution des cas ambigus (4) pour prendre une d&#233;cision (5). 
</p>
<p> 
3.2 Evaluation 
 
L&#146;&#233;valuation porte sur deux corpus, un ouvrage de g&#233;omorphologie (GEO, 243 000 mots ) et 
le journal Le Monde5 (LM, 250 000 mots) ; nous avons &#233;valu&#233; 850 cas ambigus dans chaque 
corpus. L&#146;&#233;valuation exclut des cas entrant dans une configuration &#233;tiquet&#233;e Verbe+Prep(de) 
                                                 
4  La productivit&#233; est d&#233;termin&#233;e par le nombre de r&#233;gis diff&#233;rents avec lesquels un couple {recteur, 
pr&#233;position} se combine dans le corpus. 
5  Le corpus (ann&#233;e 1998 du journal Le Monde) comportait initialement environ 700 000 mots. Nous 
avons souhait&#233; travailler sur un nombre de mots &#233;quivalent pour les deux corpus et n&#146;avons donc exploit&#233; qu&#146;une 
partie de LM.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Proc&#233;dures d&#146;apprentissage endog&#232;ne doubl&#233;es de  ressources exog&#232;nes  
</p>
<p>mais qui ne rel&#232;vent pas de l&#146;ambigu&#239;t&#233;, tels les sujets invers&#233;s (dans ces montagnes 
apparaissent des &#233;rosions) ou les structures causatives (il a fait chuter des taux) dont le 
traitement d&#233;pend d&#146;un autre module6. Les r&#233;sultats de l&#146;&#233;valuation apparaissent dans le 
tableau 3.  
</p>
<p> 
Corpus GEO LM 
</p>
<p>                    Syntex 
Correct 
</p>
<p>    OBJ          PREP         Total      OBJ            PREP         Total   
</p>
<p>618 6 624 547 3 550 
84 142 226 167 133 300 
</p>
<p>OBJ 
PREP 
Total 702 148 850 714 136 850 
</p>
<p>Taux de r&#233;ussite GEO LM 
89% 
</p>
<p>(618+142/850) 
80% 
</p>
<p>(547+133/850) 
 
</p>
<p>Syntex 
OBJ 
99% 
</p>
<p>(618/624) 
</p>
<p>PREP 
63% 
</p>
<p>(142/226) 
</p>
<p>OBJ 
99% 
</p>
<p>(547/550) 
</p>
<p>PREP 
44% 
</p>
<p>(133/300) 
Strat&#233;gie de base 
</p>
<p>(OBJ) 
73% 
</p>
<p>(624/850) 
65% 
</p>
<p>(550/850) 
Gain endog&#232;ne 16% 15% 
</p>
<p> 
Tableau 3 : Evaluation de la strat&#233;gie endog&#232;ne 
</p>
<p> 
Illustrons la lecture des donn&#233;es sur le corpus GEO : sur 624 cas OBJ, l&#146;analyseur en a 
reconnu 618 ; sur 226 cas PREP, il en a reconnu 142. Le taux de r&#233;ussite mesure le rapport 
entre le nombre de cas correctement analys&#233;s par Syntex (618+142) et le nombre de cas 
valid&#233;s (624+226). Nous d&#233;taillons ce taux pour les deux relations OBJ et PREP et le 
comparons &#224; une strat&#233;gie de base qui choisit la relation OBJ pour l&#146;ensemble des cas : sur 
850 cas valid&#233;s, la strat&#233;gie de base prend donc la bonne d&#233;cision dans 624 cas. Cette 
comparaison nous permet de mieux appr&#233;hender le gain de la strat&#233;gie endog&#232;ne (diff&#233;rence 
entre le taux de r&#233;ussite de Syntex et celui de la strat&#233;gie de base : 89% - 73% = 16%).  
 
3.3 Analyse des r&#233;sultats 
 
Globalement, les r&#233;sultats attestent du gain apport&#233; par l&#146;apprentissage endog&#232;ne par rapport &#224; 
une strat&#233;gie de base qui choisirait la relation OBJ dans chaque cas. Sur l&#146;ensemble des 
donn&#233;es, on retiendra le taux de r&#233;ussite pour la relation PREP, qui semble t&#233;moigner des 
limites de la strat&#233;gie endog&#232;ne (GEO : 63%, LM : 44%). C&#146;est &#224; cette relation que nous 
allons nous int&#233;resser en cherchant &#224; identifier les causes d&#146;&#233;chec.   
 
Ces causes concernent notamment l&#146;absence ou le manque d&#146;indices en corpus7. C&#146;est le cas 
par exemple de verbes qui sous-cat&#233;gorisent la pr&#233;position de et sont d&#233;crits dans des 
ressources lexicales g&#233;n&#233;rales. Aucune occurrence de ces verbes n&#146;a &#233;t&#233; trouv&#233;e en contexte 
non ambigu, l&#146;indice endog&#232;ne pour PREP est donc nul. Citons dans GEO les verbes : affluer 
de, d&#233;river de, douter de, profiter de, r&#233;sulter de, se d&#233;solidariser de, se distinguer de et dans 
                                                 
6  Lorsque ces cas ne sont pas, ou que partiellement, r&#233;solus par l&#146;analyseur, les r&#232;gles pour la r&#233;solution 
de l&#146;ambigu&#239;t&#233; cat&#233;gorielle sur de s&#146;appliquent (&#224; tort).  
7  Syntex choisit par d&#233;faut la relation OBJ.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fr&#233;rot 
</p>
<p>LM, les verbes discuter de, d&#233;pendre de, p&#226;tir de, regorger de, b&#233;n&#233;ficier de. C&#146;est ici la 
fr&#233;quence d&#146;apparition des verbes qui est &#147; responsable &#148; de l&#146;&#233;chec, et plus pr&#233;cis&#233;ment 
l&#146;absence de redondance lexico-syntaxique en contexte non ambigu, sachant qu&#146;un cas 
ambigu a d&#146;autant plus de chance d&#146;&#234;tre r&#233;solu qu&#146;il a &#233;t&#233; rep&#233;r&#233; dans un contexte {verbe, 
relation syntaxique} non ambigu. Des erreurs d&#146;analyse syntaxique expliquent &#233;galement les 
r&#233;sultats. Ces erreurs se propagent dans le calcul des indices endog&#232;nes  et les &#147; gonflent &#148; 
artificiellement ; c&#146;est le cas de certains sujets invers&#233;s analys&#233;s comme des objets directs qui 
faussent l&#146;indice OBJ. Des cas de conflit indiciel se pr&#233;sentent aussi : deux indices8 
comportent une m&#234;me valeur non nulle, donc non discriminante ; ce conflit est &#224; la fois 
imputable au manque de redondance lexico-syntaxique et aux erreurs d&#146;analyse.  
</p>
<p> 
La redondance lexico-syntaxique des deux corpus semble une piste int&#233;ressante &#224; explorer 
pour analyser le taux de r&#233;ussite (PREP) contrast&#233; entre GEO et LM, taux sup&#233;rieur d&#146;environ 
20% sur GEO (63%) par rapport &#224; LM (44%). Comme nous l&#146;avons d&#233;j&#224; pr&#233;cis&#233;, 
l&#146;apprentissage endog&#232;ne est bas&#233; sur la notion de productivit&#233; et sa performance repose sur la 
redondance des structures lexico-syntaxiques. Si le taux de r&#233;ussite (PREP) est meilleur dans 
GEO que dans LM, on peut avancer l&#146;id&#233;e que la redondance lexico-syntaxique est plus forte 
dans GEO que dans LM. Et qu&#146;elle est plus forte en contexte non ambigu. Cette redondance 
peut s&#146;expliquer par l&#146;homog&#233;n&#233;it&#233; th&#233;matique de GEO (g&#233;omorphologie) face &#224; 
l&#146;h&#233;t&#233;rog&#233;n&#233;it&#233; th&#233;matique de LM (politique, &#233;conomie, culture, sciences et techniques...), et 
par leurs vocabulaires respectifs (lexique verbal plus dense dans LM que dans GEO).  
 
4 Introduction de ressources exog&#232;nes dans l&#146;analyseur 
 
4.1 Donn&#233;es de sous-cat&#233;gorisation verbale 
 
Ce constat sur les limites du &#147; tout endog&#232;ne &#148; nous am&#232;ne &#224; envisager une strat&#233;gie 
alternative, via l&#146;utilisation dans l&#146;analyseur d&#146;une ressource lexicale g&#233;n&#233;rale listant 
l&#146;ensemble des verbes sous-cat&#233;gorisant la pr&#233;position de. A d&#233;faut d&#146;avoir achev&#233; la 
constitution exhaustive de cette ressource, nous constituons les donn&#233;es &#224; partir des corpus 
utilis&#233;s pour l&#146;exp&#233;rience (GEO et LM). Cette d&#233;marche se justifie par l&#146;objectif m&#234;me de 
notre &#233;tude ; nous cherchons ici &#224; mesurer quel peut &#234;tre l&#146;apport maximal d&#146;une ressource 
lexicale g&#233;n&#233;rale. Pour cela, il &#233;tait donc indispensable de nous mettre en situation d&#146;apport 
maximal et de disposer, pour les deux corpus &#233;valu&#233;s, de l&#146;ensemble de ces verbes.  
 
Les listes constitu&#233;es sont les suivantes : i) verbes qui sous-cat&#233;gorisent la pr&#233;position de et ne 
sont pas transitifs directs (liste A) ; ii) verbes sous-cat&#233;gorisant la pr&#233;position de ou transitifs 
directs (liste B1) ; iii) verbes &#224; double compl&#233;mentation (liste B2). Nous d&#233;taillons ces listes 
(tableaux 4, 5). 
 
</p>
<p>GEO LM 
 arriver de, d&#233;pendre ~, d&#233;river ~, douter ~, &#233;merger 
~, faire partie9 ~, jaillir ~, parler ~, pr&#233;juger ~, 
profiter ~, provenir ~, rendre compte ~, venir ~ 
</p>
<p>abuser de, b&#233;n&#233;ficier ~, d&#233;couler ~, d&#233;battre ~, d&#233;pendre 
~, d&#233;missionner ~, discuter ~, &#233;maner ~, faire &#233;tat ~, 
faire figure ~, grouiller ~, jouir ~, mourir ~, p&#226;tir ~ 
</p>
<p> 
Tableau 4 : Liste A 
</p>
<p>                                                 
8  Indices oppos&#233;s, c&#146;est-&#224;-dire l&#146;un en faveur de PREP, l&#146;autre de OBJ.  
9  Les listes comprennent des formes verbales complexes (avoir besoin, faire partie, rendre compte, &#133;). 
Ce choix est li&#233; &#224; la concat&#233;nation de certaines s&#233;quences Verbe+Nom lors de l&#146;&#233;tiquetage morphosyntaxique.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Proc&#233;dures d&#146;apprentissage endog&#232;ne doubl&#233;es de  ressources exog&#232;nes  
</p>
<p>GEO LM 
Verbes 
</p>
<p>Transitifs directs Sous-cat&#233;gorisant de Transitifs directs Sous-cat&#233;gorisant de 
dater des ph&#233;nom&#232;nes 
disposer des feuillets 
</p>
<p>dater de cette &#233;poque 
disposer de donn&#233;es 
</p>
<p>relever des erreurs 
d&#233;passer les limites 
</p>
<p>relever d&#146;une grande qualit&#233; 
d&#233;passer de quelques m&#232;tres 
</p>
<p>Liste B1 : verbes transitifs directs ou sous-cat&#233;gorisant de 
 
</p>
<p>Verbes 
A double compl&#233;mentation  A double compl&#233;mentation 
</p>
<p>imbiber le premier d&#146;eau 
enrober de calcite des mat&#233;riaux 
</p>
<p>prot&#233;ger du ruissellement des portions de la formation 
</p>
<p>accuser des hommes de corruption 
remplir d&#146;humanit&#233; ce monstre froid 
 faire de ce fait un dossier d&#146;actualit&#233;  
</p>
<p>Liste B2 : verbes &#224; double compl&#233;mentation (directe et pr&#233;positionnelle) 
Tableau 5 : Listes B1 et B2 
</p>
<p> 
La liste A est destin&#233;e &#224; &#234;tre utilis&#233;e dans l&#146;analyseur lors de la premi&#232;re passe (r&#233;solution de 
cas d&#233;tect&#233;s comme non ambigus). Ces verbes, m&#234;me s&#146;ils entrent en corpus dans une 
configuration syntaxique ambigu&#235;, ne sont pas transitifs directs : la forme de correspond donc 
&#224; la pr&#233;position. Les verbes de la liste B1 entrent dans une construction transitive directe ou 
pr&#233;positionnelle, qui influe directement sur leur sens : de est dans ce cas une forme ambigu&#235; 
(disposer de(PREP) donn&#233;es &#8800; disposer des(OBJ) feuillets). Ce qui est &#233;galement le cas des verbes 
de la liste B2 : la forme de qui suit le verbe correspond &#224; l&#146;article (accuser des(OBJ) hommes de 
corruption) ou &#224; la pr&#233;position (enrober de(PREP) calcite des mat&#233;riaux). Les verbes de B1 et 
B2 sont actuellement regroup&#233;s dans une seule et m&#234;me liste et font l&#146;objet d&#146;un traitement 
indiff&#233;renci&#233; dans l&#146;analyseur. Ils sont utilis&#233;s lors de la deuxi&#232;me passe (r&#233;solution de cas 
ambigus) et constituent un indice exog&#232;ne pour PREP, destin&#233; &#224; &#234;tre combin&#233; aux indices 
endog&#232;nes. 
 
4.2 R&#233;solution de l&#146;ambigu&#239;t&#233;   
 
Nous d&#233;crivons la proc&#233;dure de r&#233;solution de l&#146;ambigu&#239;t&#233; en contexte contigu verbe+de.  
 
</p>
<p>&#8226; Premi&#232;re passe : r&#233;solution de cas d&#233;tect&#233;s comme non ambigus. L&#146;analyseur se 
base par ordre de priorit&#233; d&#233;croissante sur :  
</p>
<p> 
- la liste A. Si le verbe est dans la liste, alors l&#146;analyseur choisit la relation PREP entre le 
verbe et de ;  
- une relation syntaxique OBJ d&#233;j&#224; &#233;tablie par l&#146;analyseur. On fait l&#146;hypoth&#232;se qu&#146;il s&#146;agit de 
verbes &#224; double compl&#233;mentation et que si l&#146;analyseur a rattach&#233; un compl&#233;ment d&#146;objet 
direct au verbe, alors la forme de correspond &#224; la pr&#233;position. L&#146;objet direct peut &#234;tre r&#233;alis&#233; 
sous la forme d&#146;un clitique (une crise climatique qui [le](OBJ) d&#233;gage de(PREP) tout manteau 
d&#146;alt&#233;ration), d&#146;un pronom relatif (c&#146;est l&#146;interpr&#233;tation [qu](OBJ)&#146;on a donn&#233; des(PREP) 
mandelles), ou d&#146;un nom &#224; distance du verbe (exclure de(PREP) l&#146;&#233;tude des socles [les mont&#233;es 
tardives](OBJ), faisant du(PREP) Br&#233;sil aujourd&#146;hui au septi&#232;me rang [le quatri&#232;me producteur 
mondial](OBJ)) (r&#232;gle 1) ;  
- les configurations syntaxiques non ambigu&#235;s pour la relation PREP (r&#232;gle 2).   
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fr&#233;rot 
</p>
<p>Cet ordre de priorit&#233; se fonde sur la performance respective des r&#232;gles 1 et 210. Les cas r&#233;solus 
par ces r&#232;gles constituent les contextes d&#146;acquisition &#224; partir desquels sont calcul&#233;s les indices 
endog&#232;nes utilis&#233;s lors de la deuxi&#232;me passe. Afin de mieux &#147; contr&#244;ler &#148; les donn&#233;es 
d&#146;acquisition erron&#233;es, nous envisageons d&#146;affecter une valeur de confiance &#224; chaque r&#232;gle en 
fonction de sa fiabilit&#233; et de doter &#233;galement les contextes d&#146;acquisition pour la relation OBJ 
d&#146;une valeur de confiance. 
 
</p>
<p>&#8226; Deuxi&#232;me passe : r&#233;solution de cas ambigus  
 
</p>
<p>La strat&#233;gie de r&#233;solution repose sur un calcul de scores. Les listes B1 et B2 (verbes transitifs 
directs et/ou sous-cat&#233;gorisant la pr&#233;position de) constituent un indice exog&#232;ne en faveur de la 
relation PREP, exploit&#233; conjointement aux indices endog&#232;nes. L&#146;id&#233;e mise en &#156;uvre est 
d&#146;exploiter prioritairement les donn&#233;es bas&#233;es sur les indices endog&#232;nes et, lorsque la valeur 
du score est jug&#233;e insuffisante, de faire intervenir l&#146;information exog&#232;ne.   
 
4.3 R&#233;sultats   
 
Nous pr&#233;sentons dans le tableau 6 les r&#233;sultats de la strat&#233;gie mixte.  
 
</p>
<p>Corpus GEO LM 
</p>
<p>                     Syntex 
Correct 
</p>
<p>    OBJ           PREP        Total     OBJ           PREP         Total 
</p>
<p>622 2 624 549 1 550 
23 203 226 44 256 300 
</p>
<p>OBJ 
PREP 
Total 645 205 850 593 257 850 
</p>
<p> 
97% 
</p>
<p>(622+203/850) 
95% 
</p>
<p>(549+256/850) 
Taux de r&#233;ussite 
</p>
<p>Syntex 
OBJ 
</p>
<p>100% 
(622/624) 
</p>
<p>PREP 
90% 
</p>
<p>(203/226) 
</p>
<p>OBJ 
100% 
</p>
<p>(549/550) 
</p>
<p>PREP 
85% 
</p>
<p>(256/300) 
Gain exog&#232;ne11 8% 15% 
</p>
<p> 
</p>
<p>Tableau 6 : Evaluation de la strat&#233;gie mixte 
</p>
<p>L&#146;utilisation d&#146;informations exog&#232;nes am&#233;liore les performances de l&#146;analyseur : +8% sur 
GEO, +15% sur LM. Globalement, ces informations &#147; agissent &#148; sur les faiblesses de 
l&#146;endog&#232;ne et permettent &#224; l&#146;analyseur de prendre la bonne d&#233;cision lorsque la redondance 
lexico-syntaxique seule ne le permettrait pas. On note que l&#146;&#233;cart entre le taux de r&#233;ussite des 
deux corpus s&#146;est consid&#233;rablement r&#233;duit : il &#233;tait de 9% lors de la premi&#232;re &#233;valuation (89% 
- 80%) ; &#224; l&#146;issue de la deuxi&#232;me &#233;valuation, il n&#146;est plus que de 2% (97% - 95%). 
L&#146;introduction de ressources exog&#232;nes dans l&#146;analyseur am&#233;liore le traitement des deux 
corpus &#233;valu&#233;s, mais elle semble d&#146;autant plus l&#146;am&#233;liorer que la redondance lexicale du 
corpus est faible et le nombre de verbes pr&#233;sents dans les ressources exog&#232;nes est &#233;lev&#233;12.  
</p>
<p>                                                 
10  R&#232;gle 1 :  93% (GEO), 89% (LM) ; r&#232;gle 2 : 90% (GEO), 87% (LM).  
11  Gain exog&#232;ne : taux de r&#233;ussite Syntex (1&#232;re &#233;valuation) &#150; taux de r&#233;ussite Syntex (2&#232;me &#233;valuation), soit 
pour GEO : 97% - 89% = 8%, et pour LM : 95% - 80% = 15%.  
12  Liste A : 115 verbes pour LM ; 75 verbes pour GEO.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Proc&#233;dures d&#146;apprentissage endog&#232;ne doubl&#233;es de  ressources exog&#232;nes  
</p>
<p>Le gain exog&#232;ne est majoritairement apport&#233; par les verbes de la liste A et on peut se 
demander, au vu des ambigu&#239;t&#233;s r&#233;siduelles pour PREP, quel gain repr&#233;senterait un traitement 
diff&#233;renci&#233; des listes B1 et B2. Les ambigu&#239;t&#233;s r&#233;siduelles concernent le cas des verbes &#224; 
double compl&#233;mentation (compl&#233;ment d&#146;objet direct et compl&#233;ment pr&#233;positionnel). Or en 
l&#146;&#233;tat, l&#146;analyseur ne traite pas le cas de de lorsqu&#146;il se trouve &#224; distance du verbe13. Il semble 
que seule une analyse de la construction verbale dans son ensemble permettra de r&#233;soudre 
correctement les formes ambigu&#235;s de, contigu&#235;s et &#224; distance du verbe. Les ambigu&#239;t&#233;s 
r&#233;siduelles concernent aussi des groupes pr&#233;positionnels (GP) qui entretiennent avec le verbe 
une relation de nature circonstancielle et non argumentale. L&#146;utilisation de donn&#233;es de sous-
cat&#233;gorisation listant la nature syntaxique des arguments ne permettra pas de lever 
l&#146;ambigu&#239;t&#233;. On citera l&#146;exemple des compl&#233;ments de mani&#232;re (fonctionner du premier coup, 
s&#146;appr&#233;cier de diverses mani&#232;res, condamner de la fa&#231;on la plus ferme) et groupes 
adverbiaux (arriver de surcro&#238;t dans un climat tendu, incorporer d&#146;office ce logiciel, attester 
de fait leur existence). La r&#233;solution de ces cas implique de mettre en &#156;uvre des m&#233;thodes de 
traitement compl&#233;mentaires. Nous envisageons &#224; ce titre de poursuivre le travail entrepris sur 
le rep&#233;rage automatique en corpus de GP arguments ou circonstants (Fabre, Fr&#233;rot, 2002) 
pour isoler de mani&#232;re automatique et retyper ces GP au statut circonstanciel.  
</p>
<p>5 Conclusions et perspectives 
 
Ces premiers r&#233;sultats sur l&#146;introduction de ressources exog&#232;nes dans l&#146;analyseur sont 
prometteurs. Cette phase exp&#233;rimentale en corpus doit &#224; pr&#233;sent s&#146;accompagner de la 
constitution d&#146;une ressource lexicale g&#233;n&#233;rale compl&#232;te pour les liste A et B, et son apport 
dans Syntex doit &#234;tre &#233;valu&#233; sur diff&#233;rents corpus. L&#146;&#233;tude a port&#233; sur la r&#233;solution de 
l&#146;ambigu&#239;t&#233; cat&#233;gorielle en contexte contigu verbe+de ; nous travaillons actuellement &#224; la 
r&#233;solution de l&#146;ambigu&#239;t&#233; lorsque de se trouve &#224; distance du verbe14 : la r&#233;solution de cette 
double ambigu&#239;t&#233;, cat&#233;gorielle et structurelle (il s&#146;agit de d&#233;terminer, outre la nature de la 
relation, &#224; quel recteur se rattache de) s&#146;inscrit plus globalement dans une strat&#233;gie de 
rattachement pr&#233;positionnel visant &#224; &#147; marier &#148; harmonieusement proc&#233;dures d&#146;apprentissage 
endog&#232;ne et ressources exog&#232;nes.  
</p>
<p>Remerciements 
Je remercie vivement Didier Bourigault et C&#233;cile Fabre de leurs conseils et remarques au 
cours de la r&#233;daction de cet article.  
</p>
<p>R&#233;f&#233;rences 
A&#239;t-Mokhtar S., Chanod J-P. (1997), Subject and Object Dependency Extraction Using Finite-
State Tranducers. Proceedings of ACL Workshop on Automatic Information Extraction and 
Building of Lexical Semantic Resources for NLP Applications, Madrid.  
 
A&#239;t-Mokhtar S., Chanod J-P., Roux C. (2002), Robustness beyond shallowness : incremental 
deep parsing. Natural Language Engineering, Vol.8 (2/3), pp. 121-144. 
 
                                                 
13  Dans l&#146;exemple :  d&#233;duire des(PREP)  ph&#233;nom&#232;nes analys&#233;s des(OBJ) conclusions int&#233;ressantes, le 
rattachement de des(OBJ)   au verbe d&#233;duire n&#146;est pas pris en charge par l&#146;analyseur.  
14  Exemples : joindre par des segments de droite des(OBJ) points carr&#233;s, armer le cours d&#146;eau de(PREP) 
particules tranchantes.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C&#233;cile Fr&#233;rot 
</p>
<p>Basili R. Pazienza M-T., Vindigni M. (1997), Corpus-driven Unsupervised Learning of Verb 
Subcategorization Frames, Actes du 5&#232;me congr&#232;s AI*IA 97, M. Lenzerini (ed), Lecture Notes 
in Artificial Intelligence, 1321, pp. 159-170. 
 
Basili R., Pazienza M-T., Vindigni M. (1999), Adaptative Parsing and Lexical Learning. 
Actes de VEXTAL&#146;99, Venise.  
 
Bourigault D. (1994), Lexter, un logiciel d&#146;extraction de terminologie. Application &#224; 
l&#146;acquisition de connaissances &#224; partir de textes, Th&#232;se de l&#146;Ecole des Hautes Etudes en 
Sciences Sociales, Paris. 
 
Bourigault D., Fabre C. (2000), Approche linguistique pour l'analyse syntaxique de corpus. 
Cahiers de grammaire, Vol.25, pp.131-151.  
 
Bourigault D. (2002), Upery : un outil d&#146;analyse distributionnelle &#233;tendue pour la construction 
d&#146;ontologies &#224; partir de corpus. Actes de la conf&#233;rence TALN, Nancy, 75-84. 
 
Fabre  C., Bourigault D. (2001), Linguistic clues for corpus-based acquisition of lexical 
dependencies. Actes de Corpus Linguistics Conference, Lancaster, 176-184.  
 
Fabre C., Fr&#233;rot C. (2002), Groupes pr&#233;positionnels arguments ou circonstants : vers un 
rep&#233;rage automatique en corpus. Actes de la conf&#233;rence TALN, 215-224. 
 
Giguet E., Vergne J. (1997), From Part of Speech Tagging to Memory-based Deep Syntactic 
Analysis. Proceedings of the International Workshop on Parsing Technologies, MIT, Boston, 
77-88.  
 
Habert B., Nazarenko A., Zweigenbaum P. (1998), Extending an Existing Specialized 
Semantic Lexicon. Proceedings of Coling-ACL&#146;98, Granada, 663-668. 
 
Hamon T., Nazarenko A., Gros C. (1998), A step towards the detection of semantic variants 
of terms in technical documents. Proceedings of Coling-ACL&#146;98, 498-504. 
 
Leconte J. (1998), Le cat&#233;goriseur Brill14-JL5 / Winbrill-0.3.  
 
Morin E. (1998), Prom&#233;th&#233;e : un outil d&#146;aide &#224; l&#146;acquisition de relations s&#233;mantiques entre 
termes. Actes de la conf&#233;rence TALN, Paris.  
 
Silberztein M. (2000), Manuel d&#146;utilisation d&#146;Intex 4.12.  </p>

</div></div>
</body></html>