<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une Approche Fonctionnelle de la R&#233;solution de la R&#233;f&#233;rence dans le Dialogue Finalis&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Vers une Approche Fonctionnelle de la  
R&#233;solution de la R&#233;f&#233;rence dans le 
</p>
<p>Dialogue Finalis&#233; 
</p>
<p>Guillaume Pitel  
</p>
<p>LIMSI &#150; CNRS 
B&#226;t. 508 BP 133 F-91403 Orsay CEDEX 
</p>
<p>Guillaume.Pitel@limsi.fr &#150; Soutenance pr&#233;vue en 2004 
</p>
<p>Keywords &#150; Mots Clefs 
</p>
<p>R&#233;solution de la R&#233;f&#233;rence Intrins&#232;que, Approche Fonctionnelle, Dialogue Homme Machine 
Reference Resolution, Intrinsic Reference, Functional Approach, Human Computer Dialogue 
</p>
<p>R&#233;sum&#233; &#150; Abstract 
</p>
<p>Dans cet article, nous montrons l&#146;insuffisance du pouvoir d&#146;expression des approches par 
pr&#233;dicats pour la r&#233;solution de la r&#233;f&#233;rence en extension dans un cadre g&#233;n&#233;rique de dialogue 
homme-machine. Cette insuffisance oblige pour l&#146;instant les concepteurs de tels syst&#232;mes de 
dialogue &#224; concevoir des heuristiques ad hoc impossibles &#224; int&#233;grer dans un cadre de 
description unifi&#233;. Nous montrons que la r&#233;solution des expressions r&#233;f&#233;rentielles n&#233;cessite la 
prise en compte du contexte m&#234;me pour les termes portant sur des caract&#233;ristiques 
intrins&#232;ques aux &#233;l&#233;ments. Nous proposons alors un formalisme pour repr&#233;senter la 
s&#233;mantique des extracteurs r&#233;f&#233;rentiels intrins&#232;ques. Ce formalisme repose sur trois 
fonctions, la premi&#232;re permet de calculer le rapport de similarit&#233; de deux &#233;l&#233;ments en fonction 
d&#146;une certaine dimension et dans un certain contexte, les deux autres permettent de 
partitionner un domaine de r&#233;f&#233;rence tri&#233; par l&#146;utilisation de la premi&#232;re fonction.  
</p>
<p>In this paper, we show the lack of expressiveness of predicative approaches for extensional 
reference resolution. This drawback forces dialogue systems designers to develop specific 
heuristics for solving some reference cases they can&#146;t integrate in a unified representation 
framework. As we focus on extensional reference resolution in a generic framework for 
human computer dialogue system, we point the fact that the process of resolving referential 
expressions needs to take context into account even for expressions involving intrinsic 
characteristics of elements. Thus we propose a representation model for the semantic of 
intrinsic referential extractors. This model is built on three functions, the first one serves to 
calculate the similarity ratio between two elements, the two others serve to partition a 
reference domain which is previously sorted by the first function. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Pitel 
</p>
<p> 
</p>
<p>1 Introduction 
La g&#233;n&#233;ricit&#233; est un objectif crucial dans de dialogue homme-machine, et ce pour deux 
raisons, l&#146;une quantitative : le co&#251;t de d&#233;veloppement et d&#146;adaptation des syst&#232;mes de 
dialogue ; l&#146;autre qualitative : la coh&#233;rence th&#233;orique du cadre dans lequel sont construit ces 
syst&#232;mes de dialogue. Nous &#233;tudions le cas extensionnel des expressions r&#233;f&#233;rentielles, d&#233;fini 
par (Byron et Allen, 2002) comme la recherche des &#233;l&#233;ments de l&#146;application m&#233;di&#233;e1 
d&#233;sign&#233;s dans un &#233;nonc&#233;2. Ce traitement a longtemps &#233;t&#233; soit construit comme un filtrage 
successif par pr&#233;dicats, soit construit autour d&#146;heuristiques sp&#233;cifiques (Winograd, 1973). Ces 
deux approches ne permettent pas de d&#233;finir un cadre g&#233;n&#233;rique pour la r&#233;solution de la 
r&#233;f&#233;rence dans le cadre du dialogue finalis&#233;. Dans cet article, nous pr&#233;sentons un mod&#232;le 
permettant de repr&#233;senter les extracteurs r&#233;f&#233;rentiels de mani&#232;re fine et qui s&#146;appuie sur le 
mod&#232;le de r&#233;solution de la r&#233;f&#233;rence de (Salmon-Alt, 2001). Dans la terminologie de cette 
auteur, les termes composant une expression r&#233;f&#233;rentielle et que nous d&#233;signons par 
&#171; extracteurs r&#233;f&#233;rentiels &#187;, sont repr&#233;sent&#233;s par des crit&#232;res de diff&#233;rentiation, utilis&#233;s dans le 
proc&#232;s de s&#233;lection d&#146;&#233;l&#233;ment3, et l&#146;ensemble des entit&#233;s &#224; partir duquel l&#146;op&#233;ration de 
s&#233;lection s&#146;op&#232;re est repr&#233;sent&#233; par des domaines de r&#233;f&#233;rence. Nous adoptons sur les 
extracteurs r&#233;f&#233;rentiels un point de vue proc&#233;dural, en les envisageant en tant qu&#146;op&#233;rateurs 
actifs de s&#233;lection d&#146;&#233;l&#233;ments dans un ensemble, plut&#244;t que comme des formules de logique 
utilis&#233;es pour s&#233;lectionner les &#233;l&#233;ments r&#233;pondant &#224; certaines conditions de v&#233;rit&#233;. L&#146;id&#233;e 
directrice est d&#146;utiliser des fonctions de diff&#233;rentiation &#224; la place des crit&#232;res, nous montrons 
en effet dans la section 2 que repr&#233;senter l&#146;action des extracteurs r&#233;f&#233;rentiels par des pr&#233;dicats 
ne permet pas de prendre en compte leur d&#233;pendance vis-&#224;-vis du contexte. Nous proposons 
alors dans la section 3 de consid&#233;rer l&#146;acte d&#146;extraction comme une diff&#233;rentiation d&#233;pendante 
du contexte, effectu&#233;e par ces fonctions. Dans la conclusion, section 4, nous pr&#233;sentons les 
probl&#232;mes que nous n&#146;avons pas pu traiter jusqu&#146;&#224; maintenant, et proposons quelques pistes 
de recherche pour les aborder.  
</p>
<p>2 Etude d&#146;extracteurs r&#233;f&#233;rentiels intrins&#232;ques 
Dans une expression r&#233;f&#233;rentielle qui d&#233;signe un ou des objets du monde, nous appelons 
extracteurs r&#233;f&#233;rentiels les termes jouant un r&#244;le dans la construction de l&#146;extension de 
l&#146;expression par extraction d&#146;&#233;l&#233;ments dans la repr&#233;sentation du monde. Le probl&#232;me de la 
</p>
<p>                                                 
1  Nous d&#233;signons sous le terme &#171; application m&#233;di&#233;e &#187; le programme informatique avec lequel on souhaite 
</p>
<p>que l&#146;utilisateur puisse interagir par l&#146;interm&#233;diaire de la langue. 
</p>
<p>2  Le traitement extensionnel s&#146;oppose au traitement anaphorique, consistant &#224; chercher un ant&#233;c&#233;dent 
linguistique dans les &#233;nonc&#233;s pass&#233;s, et au traitement logique consistant &#224; construire une repr&#233;sentation 
logique d&#146;une expression r&#233;f&#233;rentielle sans prendre en compte l&#146;&#233;tat de l&#146;application m&#233;di&#233;e. 
</p>
<p>3  Les crit&#232;res de diff&#233;rentiation sont classiquement utilis&#233;s par les modules de traitement de la r&#233;f&#233;rence pour 
repr&#233;senter la s&#233;mantique des expressions r&#233;f&#233;rentielles. Chaque &#233;l&#233;ment de l&#146;expression est transform&#233; en 
pr&#233;dicat (par exemple &#171; grand carr&#233; &#187; &#8594; grand(x) ET carr&#233;(x)), et utilis&#233; ensuite pour filtrer successivement les 
entit&#233;s accessibles &#224; l&#146;interlocuteur afin de produire le ou les &#233;l&#233;ments compatibles avec l&#146;expression 
r&#233;f&#233;rentielle. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Approche Fonctionnelle de la R&#233;solution de la R&#233;f&#233;rence dans le Dialogue Finalis&#233; 
</p>
<p> 
</p>
<p>repr&#233;sentation des objets4 de l&#146;application m&#233;di&#233;e et de leur lien avec les expressions 
r&#233;f&#233;rentielles qui les d&#233;signent n&#146;a pas &#233;t&#233; beaucoup explor&#233;. La repr&#233;sentation sur laquelle se 
fait la recherche r&#233;f&#233;rentielle est g&#233;n&#233;ralement une base de connaissances compos&#233;e d&#146;objets 
ad&#233;quats pour l&#146;application ou m&#234;me repr&#233;sent&#233;e en logique du premier ordre. On constate 
ceci m&#234;me dans les travaux r&#233;cents, comme (Salmon-Alt, 2001 :149), (Byron et Allen, 2002) 
ou (Dale et Reiter, 1995).  Typiquement, (Byron et Allen, 2002) expriment les champs de 
restriction par des propositions de la forme (color x RED). (Dale et Reiter, 1995) distinguent 
trois types de composantes pour caract&#233;riser un &#233;l&#233;ment : les propri&#233;t&#233;s intrins&#232;ques (p. ex. 
taille, couleur), les propri&#233;t&#233;s relationnelles (p. ex. position spatiale), les propri&#233;t&#233;s 
typologiques des objets (p. ex. triangle, carr&#233;). Nous &#233;tudierons dans cet article les extracteurs 
r&#233;f&#233;rentiels qui portent sur les caract&#233;ristiques intrins&#232;ques. Les caract&#233;ristiques relationnelles 
pures, comme les pr&#233;positions spatiales (Dzikovska, 2000) ne seront pas &#233;tudi&#233;es ici. 
</p>
<p>Les extracteurs intrins&#232;ques s&#146;appuient sur les caract&#233;ristiques intrins&#232;ques, qui sont des 
caract&#232;res stables (toujours pr&#233;sents) et ind&#233;pendants du contexte. Nous allons nous attacher 
dans cette section &#224; d&#233;montrer que m&#234;me si ces caract&#232;res sont effectivement ind&#233;pendants du 
contexte, il n&#146;en reste pas moins que l&#146;op&#233;ration d&#146;extraction du r&#233;f&#233;rent, effectu&#233;e dans les 
expressions qui font r&#233;f&#233;rence &#224; ces caract&#232;res est, elle d&#233;pendante du contexte. Nous 
parlerons du contexte op&#233;ratoire pour parler de l&#146;&#233;tat de l&#146;application avec laquelle 
l&#146;utilisateur dialogue ; du contexte ontologique pour parler de l&#146;&#233;tat des relations qui relient 
les diff&#233;rentes cat&#233;gories d&#146;entit&#233;s entre elles ainsi que les connaissances typiques qui y sont 
li&#233;es ; du contexte dialogique lorsqu&#146;il s&#146;agira de faire r&#233;f&#233;rence &#224; l&#146;&#233;tat de l&#146;interaction entre 
l&#146;utilisateur et l&#146;application. Nous &#233;tudierons tout d&#146;abord une caract&#233;ristique intrins&#232;que, la 
taille, dont il est commun&#233;ment admis que l&#146;utilisation dans les expressions r&#233;f&#233;rentielles la 
transforme en une caract&#233;ristique relationnelle, et donc d&#233;pendante du contexte op&#233;ratoire. 
Nous aborderons ensuite le cas de la couleur, g&#233;n&#233;ralement consid&#233;r&#233;e comme intrins&#232;que et 
ind&#233;pendante du contexte mais dont nous montrerons qu&#146;elle peut aussi &#234;tre d&#233;pendante du 
contexte.  
</p>
<p>2.1 La taille 
</p>
<p>Salmon-Alt &#233;tudie les variantes de la r&#233;f&#233;rence &#224; partir d&#146;un corpus de dialogues (relatant les 
&#233;changes entre un utilisateur et un op&#233;rateur) destin&#233;s &#224; faire r&#233;aliser un dessin complexe &#224; 
l&#146;op&#233;rateur &#224; partir d&#146;un ensemble d&#146;objets d&#233;crits dans la Figure 1. Ces dialogues sont tir&#233;s 
d&#146;un corpus construit &#224; partir d&#146;une exp&#233;rimentation d&#233;crite dans (Ozkan, 1994). Dans cette 
situation, l&#146;approche pr&#233;dicative est tout &#224; fait efficace, puisque toute entit&#233; X de l&#146;application 
est repr&#233;sent&#233;e par un sch&#233;ma de la forme suivante : 
</p>
<p>Entit&#233;Type X = (taille, couleur) o&#249;  
&#8226; Entit&#233;Type &#8712; {BARRE, TRIANGLE, ROND, CARRE}  
&#8226; taille &#8712; {GRAND, PETIT}, 
&#8226; couleur &#8712; {BLANC, NOIR, ROUGE, VERT, BLEU}. 
</p>
<p>                                                 
4  Nous distinguerons d&#146;une part les repr&#233;sentations informatiques de l&#146;application m&#233;di&#233;e, que nous 
</p>
<p>appellerons objets, construits par un type et des attributs ; et d&#146;autre part, les entit&#233;s auxquelles l&#146;utilisateur 
fait r&#233;f&#233;rence, que nous d&#233;signons par le terme &#233;l&#233;ments, ayant des cat&#233;gories et des caract&#233;ristiques. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Pitel 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1 : Palette des formes disponibles, corpus Ozkan 
</p>
<p> 
</p>
<p>Figure 2 : Probl&#232;me avec trois tailles (petit, moyen, 
grand) : le grand carr&#233; est-il en fait le carr&#233; moyen ? 
</p>
<p>Pourtant, il suffit d&#146;ajouter une taille possible (MOYEN) pour que cette approche soit mise en 
d&#233;faut pour r&#233;soudre l&#146;expression &#171; le grand carr&#233; &#187; dans le contexte pr&#233;sent&#233; Figure 2. Le 
carr&#233; situ&#233; &#224; gauche est en effet un grand carr&#233; par rapport &#224; l&#146;ensemble des carr&#233;s de la 
figure, mais son attribut taille ayant la valeur MOYEN, il ne peut pas &#234;tre recrut&#233; comme 
candidat &#224; l&#146;expression r&#233;f&#233;rentielle &#171; grand carr&#233; &#187;. Comme le rel&#232;ve (Dale et Reiter, 1995) 
la taille d&#233;finie dans {PETIT, MOYEN, GRAND} ne peut &#234;tre li&#233;e aux adjectifs &#171; petit &#187;, 
&#171; moyen &#187; et &#171; grand &#187;, car ces termes d&#233;signent aussi la relation entre les tailles, que nous 
appelons grandeur pour la diff&#233;rencier. La taille contient uniquement les dimensions 
objectives des objets. Ceci nous am&#232;ne &#224; conclure que la s&#233;mantique d&#233;notationnelle des 
adjectifs n&#146;est pas, m&#234;me dans un cas aussi simple que grand ou petit, r&#233;ductible &#224; une 
approche par pr&#233;dicats de la logique du premier ordre.  
</p>
<p>2.2 La couleur 
</p>
<p>Nous consid&#233;rons donc que la grandeur, contrairement &#224; la taille, est une caract&#233;ristique 
d&#233;pendante du contexte op&#233;ratoire. Le fait qu&#146;il soit ais&#233; de se m&#233;prendre sur ce point 
montre la difficult&#233; qu&#146;il peut y avoir &#224; d&#233;terminer exactement la cat&#233;gorie (typologique, 
intrins&#232;que ou relationnel) des caract&#232;res d&#233;finissant les &#233;l&#233;ments.  
</p>
<p> 
</p>
<p>Figure 3 : Cat&#233;gorisation des couleurs en fonction de l&#146;objet et du contexte5 
Nous illustrons Figure 3 qu&#146;il existe la m&#234;me difficult&#233; pour les adjectifs de couleur. En effet, 
dans le cas 1, &#171; la feuille bleue &#187; d&#233;signe la feuille de gauche (sur la version couleur), puis  
lorsque l&#146;on demande &#224; des sujets6 de d&#233;signer dans le cas 2 les carr&#233;s qui ne sont pas de 
couleur bleu, il choisissent les trois carr&#233;s du bas. Si l&#146;on demande la couleur de la voiture 
dans le cas 3, la plupart des sujets r&#233;pondent &#171; noir &#187;, m&#234;me s&#146;ils r&#233;pondent aussi pour la 
</p>
<p>                                                 
5  Le sujet du pr&#233;sent article portant en partie sur la couleur, nous avons d&#251; en utiliser dans nos sch&#233;mas. Une 
</p>
<p>version &#233;lectronique est disponible &#224; : http://www.sciences.univ-nantes.fr/irin/taln2003. 
</p>
<p>6  Nous avons proc&#233;d&#233; &#224; une exp&#233;rimentation avec une douzaine de sujets. Le protocole de test consiste en une 
feuille o&#249; est imprim&#233;e la figure avec les carr&#233;s color&#233;s et des questions sur les objets. 
</p>
<p>Bleu gris 
</p>
<p> 
</p>
<p>Turquoise Violet 
</p>
<p>Bleu Aqua 
Bleu 
fonc&#233;
</p>
<p>Cas 1 Cas 2 
</p>
<p>Cas 3
</p>
<p>Bleu 
gris </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Approche Fonctionnelle de la R&#233;solution de la R&#233;f&#233;rence dans le Dialogue Finalis&#233; 
</p>
<p> 
</p>
<p>plupart par l&#146;affirmative si on leur demande si la voiture est bleue. Pourtant, la feuille, le carr&#233; 
en bas &#224; gauche et la voiture ont tous la m&#234;me couleur. Une feuille, qui est typiquement dans 
les couleurs vertes, jaunes, rouges ou marrons, peut donc &#234;tre cat&#233;goris&#233;e comme bleue d&#232;s 
l&#146;instant o&#249; sa couleur s&#146;&#233;loigne de ces couleurs typiques pour aller vers le bleu, tandis qu&#146;une 
figure g&#233;om&#233;trique de la m&#234;me couleur, qui en tant que figure a une couleur typique neutre, 
ne pourra pas &#234;tre cat&#233;goris&#233;e comme bleue. C&#146;est ce que nous appelons la d&#233;pendance au 
contexte ontologique. D&#146;autre part, si un objet est per&#231;u entour&#233; par d&#146;autres objets, la couleur 
des ces objets d&#233;terminera en partie la mani&#232;re dont sa propre couleur sera cat&#233;goris&#233;e par un 
observateur humain. C&#146;est ce que nous appelons la d&#233;pendance au contexte op&#233;ratoire. 
</p>
<p>2.3 Importance du contexte pour certains attributs intrins&#232;ques 
</p>
<p>D&#146;apr&#232;s ces observations, le r&#244;le du contexte ne peut pas &#234;tre n&#233;glig&#233; si l&#146;on s&#146;int&#233;resse au 
calcul r&#233;f&#233;rentiel des adjectifs de couleur. Cette conclusion rejoint celle de (Pateras et al., 
1995) portant sur des situations de dialogue o&#249; les caract&#233;ristiques utilis&#233;es dans la r&#233;f&#233;rence 
ne peuvent pas &#234;tre mises en relation directe avec un sch&#233;ma de base de donn&#233;e, ou plus 
g&#233;n&#233;ralement, avec une repr&#233;sentation pr&#233;dicative des connaissances. La solution propos&#233;e 
pour choisir le r&#233;f&#233;rent correctement consiste &#224; utiliser des fonctions floues d&#146;appartenance &#224; 
un ensemble. Cependant, ces fonctions sont d&#233;finies par rapport &#224; une situation sp&#233;cifique, 
(voir Figure 4) et les auteurs ne proposent pas de moyen pour prendre en compte le contexte. 
Il en est de m&#234;me dans (Lammens &amp; Shapiro, 1993) o&#249; les auteurs construisent par 
apprentissage des fonctions de cat&#233;gorisations de la couleur, fonctions qui sont au final 
ind&#233;pendantes du contexte. Ces recherches montrent cependant clairement qu&#146;une 
repr&#233;sentation s&#233;mantique des adjectifs n&#233;cessite un formalisme permettant d&#146;exprimer des 
fonctions complexes, et permettant d&#146;en d&#233;finir pr&#233;cis&#233;ment l&#146;usage. 
</p>
<p> 
</p>
<p>Figure 4 : Cat&#233;gorisation du poids par une fonction floue d&#146;apr&#232;s (Pateras, 1995) 
</p>
<p>Notre proposition est que la repr&#233;sentation s&#233;mantique des extracteurs r&#233;f&#233;rentiels 
intrins&#232;ques devrait pouvoir supporter les cas d&#146;utilisation suivants (ici avec l&#146;exemple de la 
couleur bleue) : Choisir le bon r&#233;f&#233;rent en fonction du contexte. (&#171; Supprime la feuille bleue &#187; 
dans les Cas 1 et 2, Figure 3) ; Pouvoir dire si, dans un contexte donn&#233;, des objets peuvent 
&#234;tre consid&#233;r&#233;s comme bleus ou non (&#171; Montre-moi les objets qui ne sont pas bleus &#187; dans le 
Cas 2, Figure 3) ; Pouvoir &#234;tre utilis&#233; pour d&#233;terminer si X est plus ou moins bleu que Y (nous 
consid&#233;rons que cette capacit&#233; permet aussi de traiter les superlatifs). 
</p>
<p>3 Mod&#232;le de diff&#233;rentiation fonctionnelle 
Nous proposons de repr&#233;senter les extracteurs r&#233;f&#233;rentiels, c&#146;est-&#224;-dire les termes de la langue 
qui servent &#224; d&#233;signer un &#233;l&#233;ment parmi d&#146;autres, par des structures de donn&#233;es contenant 
des fonctions. Nous nous positionnons dans le cadre d&#146;une application de dialogue o&#249; 
l&#146;utilisateur peut parler d&#146;&#233;l&#233;ments comme par exemple ceux visibles &#224; la Figure 5. Nous 
</p>
<p>&#171; l&#233;ger &#187; &#171; lourd &#187; 
</p>
<p>kg
</p>
<p>1 
</p>
<p>0 
</p>
<p>&#181;
</p>
<p>0 5 10 15 20 25</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Pitel 
</p>
<p> 
</p>
<p>consid&#233;rons pour l&#146;instant que les &#233;l&#233;ments de l&#146;application sous-jacente sont des objets (au 
sens algorithmique du terme) d&#233;finis par leur type (ici tous sont de type carr&#233;) et par deux 
attributs : la couleur (un triplet de valeurs comprises dans [0,1]) et la taille (une valeur 
comprise dans ]0,+&#8734;[ ). 
</p>
<p>3.1 Mod&#232;le d&#146;extraction pr&#233;liminaire 
</p>
<p>Nous proposons comme base pr&#233;liminaire de r&#233;flexion de d&#233;finir les extracteurs r&#233;f&#233;rentiels 
par une fonction de calcul de similarit&#233; qui suit. Nous discuterons ensuite cette premi&#232;re 
proposition et proposerons d&#146;y adjoindre un m&#233;canisme suppl&#233;mentaire pour traiter les cas 
probl&#233;matiques. 
</p>
<p>fSimil(entit&#233; a, entit&#233; b)&#8594;[-1, 1] &#8746; &#8869;. 
</p>
<p>La fonction &#402;Simil doit permettre de trier un ensemble d&#146;&#233;l&#233;ments en fonction d&#146;une 
caract&#233;ristique (ici, bleu ou grand). Pour l&#146;extracteur bleu, elle donne le rapport entre les 
couleurs de deux objets projet&#233;es selon la dimension bleue7. Si a est plus bleu que b, la valeur 
retourn&#233;e est positive, n&#233;gative dans le cas contraire, si l&#146;une des deux n&#146;a pas de position 
dans la dimension bleu, la valeur retourn&#233;e est &#8869;. A partir de ces fonctions, il est alors 
possible de trier les entit&#233;s du domaine de r&#233;f&#233;rence, et de s&#233;parer les entit&#233;s &#224; exclure des 
autres. Nous verrons par la suite que cette hypoth&#232;se ne permet pas de traiter certains cas de 
r&#233;f&#233;rence.  
</p>
<p> 
</p>
<p>Figure 5 : Situation de test pour la repr&#233;sentation fonctionnelle des couleurs et des tailles. 
</p>
<p>A partir de la situation exp&#233;rimentale expos&#233;e Figure 5, nous illustrons l&#146;utilisation des 
fonctions de diff&#233;rentiation dans le cadre de la r&#233;solution de l&#146;expression r&#233;f&#233;rentielle &#171; grand 
carr&#233; bleu &#187;. Nous prenons comme point de d&#233;part pour le domaine de r&#233;f&#233;rence l&#146;ensemble 
des carr&#233;s de la sc&#232;ne (ici tous les objets). Nous appliquons la fonction de diff&#233;rentiation de 
l&#146;extracteur r&#233;f&#233;rentiel &#171; grand &#187;. On suppose ici que la grandeur est une relation transitive, 
telle que similG(x,z) = similG(x,y) * similG(y,z). On peut alors produire une liste tri&#233;e d&#146;entit&#233;s 
(les num&#233;ros dans les cases sont les num&#233;ros des objets), &#233;tape 1 de la Figure 6, et annoter le 
lien entre deux cases par un rapport de similarit&#233; (ici case gauche par rapport &#224; case droite) 
qui a &#233;t&#233; calcul&#233; entre elles. Puis nous appliquons, ind&#233;pendamment de l&#146;&#233;tape 1, la fonction 
de diff&#233;rentiation de l&#146;extracteur r&#233;f&#233;rentiel &#171; bleu &#187;. En th&#233;orie, si la couleur est repr&#233;sent&#233;e 
</p>
<p>                                                 
7  A ne pas confondre avec la composante bleue, dans le cas d&#146;une d&#233;composition en rouge, vert et bleu de la 
</p>
<p>couleur. La dimension bleue est avant tout une dimension cognitive, qui doit &#234;tre figur&#233;e &#224; l&#146;aide de 
fonctions math&#233;matiques ad&#233;quates. 
</p>
<p>1 
</p>
<p>2 
</p>
<p>3 
</p>
<p>5 
</p>
<p>6
</p>
<p>8
</p>
<p>4 
</p>
<p>7
</p>
<p>1. bleu marine 
2. vert 
3. bleu ciel 
4. magenta 
5. bleu roi 
6. vert fonc&#233; 
7. orange 
8. kaki </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Approche Fonctionnelle de la R&#233;solution de la R&#233;f&#233;rence dans le Dialogue Finalis&#233; 
</p>
<p> 
</p>
<p>par un triplet de valeurs dans [0,1], la fonction de diff&#233;rentiation appliqu&#233;e &#224; toutes les entit&#233;s 
doit produire une matrice de n&#215;n triplets. En pratique nous allons accepter ici une 
simplification consistant &#224; calculer la distance entre le point bleu typique (qu&#146;on suppose 
d&#233;fini par d&#233;faut hors contexte, avant d&#146;&#233;ventuellement le modifier) et le point de la couleur 
de l&#146;entit&#233;. Dans ce cas, la distance entre deux couleurs sur la dimension bleue est simplement 
la diff&#233;rence des distances de ces deux couleurs par rapport &#224; la couleur bleue typique. On 
peut alors, comme dans le cas de la grandeur, utiliser un algorithme de tri pour produire une 
liste tri&#233;e d&#146;entit&#233;s, c&#146;est l&#146;&#233;tape 2 de la Figure 6. Il faut ensuite combiner les deux r&#233;sultats. 
La fonction de combinaison de ces deux tris est la suivante : simil(x,y) = &#945;.similBleue(x,y)  &#215; 
&#946;.similGrand(x,y) o&#249; &#945; et &#946; sont des coefficients en rapport avec l&#146;importance relative des 
caract&#232;res couleur et taille  qui devraient &#234;tre d&#233;duits &#224; partir d&#146;une exp&#233;rimentation. Pour &#945; = 
&#946; = 1, on obtient l&#146;&#233;tape 3 de la Figure 6. Le r&#233;sultat du calcul &#171; grand carr&#233; bleu &#187; appliqu&#233; &#224; 
la situation Figure 5 donne donc le carr&#233; 1 comme r&#233;f&#233;rent pr&#233;f&#233;r&#233;. La m&#234;me m&#233;thode 
appliqu&#233;e &#224; l&#146;expression &#171; petit carr&#233; bleu &#187; produit comme r&#233;f&#233;rent pr&#233;f&#233;r&#233; le carr&#233; n&#176;5. Dans 
les deux cas, cette m&#233;thode apporte un r&#233;sultat coh&#233;rent avec ce &#224; quoi on s&#146;attend. 
</p>
<p> 
</p>
<p>Figure 6 : Etapes de l&#146;extraction de &#171; grand carr&#233; bleu &#187; 
</p>
<p>3.2 Mod&#232;le d&#146;extraction &#233;tendu 
</p>
<p>3.2.1 Partitionnement 
</p>
<p>Il est n&#233;cessaire d&#146;apporter des am&#233;liorations &#224; la proposition pr&#233;liminaire tout d&#146;abord pour 
assurer la gestion de r&#233;ponses n&#233;gatives, autrement dit comment r&#233;pondre : &#171; Il n&#146;y a pas de 
grand carr&#233; bleu &#187;, car, par exemple, la fonction de similarit&#233; de la grandeur ne permet pas 
l&#146;exclusion de candidats (alors que la validation exp&#233;rimentale sur l&#146;&#233;nonc&#233; &#171; le grand carr&#233; 
orange &#187; dans la situation d&#233;crite Figure 5 donne une r&#233;ponse n&#233;gative). D&#146;autre part, le 
mod&#232;le de calcul r&#233;f&#233;rentiel doit &#234;tre utilisable pour la s&#233;lection de groupes d&#146;&#233;l&#233;ments, 
comme pour &#171; les carr&#233;s bleus &#187;. De m&#234;me la mod&#232;le de calcul pr&#233;liminaire ne permet pas 
d&#146;expliquer le ph&#233;nom&#232;ne observ&#233; autour du cas 2 de la Figure 3 (d&#233;pendance contextuelle 
op&#233;ratoire), qui montre que des couleurs acceptables pour un adjectif peuvent &#234;tre exclues 
dans certaines situations et accept&#233;es dans d&#146;autres. La question est de savoir si le r&#233;f&#233;rent de 
l&#146;expression &#171; les carr&#233;s bleus &#187; dans cette situation est l&#146;ensemble des carr&#233;s {1,3,4,5}, 
{1,3,4} ou  {1,3} ou encore un autre ? L&#146;exp&#233;rience nous montre que les sujets donnent 
majoritairement comme r&#233;ponse l&#146;ensemble {1,3,5}8. Ceci nous am&#232;ne &#224; conclure qu&#146;il est 
n&#233;cessaire d&#146;adjoindre un m&#233;canisme de partitionnement similaire au m&#233;canisme propos&#233; 
</p>
<p>                                                 
8  Dans le m&#234;me ordre d&#146;id&#233;es, il est &#224; noter que la validation exp&#233;rimentale sur &#171; les petits carr&#233;s &#187; produit la 
</p>
<p>r&#233;ponse {6, 7, 8}, alors que &#171; le petit carr&#233; bleu &#187; produit bien la r&#233;ponse {5}, qui n&#146;est pas dans l&#146;ensemble 
{6,7,8} bien que dans les deux cas, l&#146;adjectif &#171; petit &#187; a &#233;t&#233; utilis&#233;. 
</p>
<p>2 1 3 5 6 7 84
0.9 1. 1. 0.6 0.25 1. 1. 
</p>
<p>5 1 3 2 6 7 84
0.9 0.75 0.6 &#8869; &#8869; &#8869; &#8869; 
</p>
<p>1 3 5 2 6 7 84
0.75 0.88 0.675 &#8869; &#8869; &#8869; &#8869; 
</p>
<p>Etape 1 &#150; &#171; grand &#187; 
</p>
<p>Etape 2 &#150; &#171; bleu &#187; 
</p>
<p>Etape 3 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Pitel 
</p>
<p> 
</p>
<p>par Salmon-Alt, mais &#233;tendu pour obtenir des partitions ternaires. Pour cela, nous adjoignons 
&#224; la fonction de similarit&#233; deux autres fonctions permettant de produire une partition ternaire 
sur le domaine de r&#233;f&#233;rence, d&#233;coup&#233;e en exclus, possibles et typiques.  
</p>
<p>Concernant la d&#233;pendance au contexte op&#233;ratoire, nous supposons qu&#146;il n&#146;influence pas la 
fonction de similarit&#233;. En revanche, la s&#233;lection des &#233;l&#233;ments exclus et typiques est, elle, 
d&#233;pendante de ce contexte, comme le montrent les ph&#233;nom&#232;nes autour du cas 2 Figure 5. Les 
fonctions de partitionnement sont pour cette raison param&#233;tr&#233;es par un domaine de r&#233;f&#233;rence, 
contenant tous les candidats potentiels &#224; la r&#233;f&#233;rence. La d&#233;pendance des fonctions de 
partitionnement au contexte op&#233;ratoire implique que les &#233;tapes d&#146;extraction doivent &#234;tre 
ordonn&#233;es. En effet, une &#233;tape &#224; besoin du domaine de r&#233;f&#233;rence calcul&#233; par l&#146;&#233;tape 
pr&#233;c&#233;dente pour partitionner correctement. Il est &#224; noter que la phase de partitionnement 
n&#233;gative (entit&#233;s exclues) est obligatoire dans le processus, alors que la phase de 
partitionnement positive (entit&#233;s typiques) n&#146;est n&#233;cessaire que lorsque l&#146;expression 
r&#233;f&#233;rentielle d&#233;signe un ensemble d&#146;&#233;l&#233;ments. 
</p>
<p>Pour justifier l&#146;ordonnancement des &#233;tapes d&#146;extraction, nous nous appuyons sur les 
observations &#233;mises dans (Dale et Reiter, 1995) &#224; propos de l&#146;importance relative &#224; attribuer 
aux caract&#232;res des objets pour la g&#233;n&#233;ration d&#146;expressions r&#233;f&#233;rentielles. Ces observations ont 
une forte corr&#233;lation avec les maximes de (Grice, 1975), et suivent globalement le principe 
d&#146;&#233;conomie maximum. Les auteurs proposent de prendre en compte les caract&#232;res dans 
l&#146;ordre suivant : type &gt; propri&#233;t&#233; intrins&#232;que &gt; propri&#233;t&#233; relationnelle. A partir de cette 
proposition, nous exprimons une r&#232;gle plus g&#233;n&#233;rale pour l&#146;ordonnancement par la 
proposition suivante : Plus le contexte op&#233;ratoire est significatif dans la s&#233;mantique d&#146;un 
extracteur r&#233;f&#233;rentiel, plus tard cet extracteur r&#233;f&#233;rentiel doit &#234;tre mis en &#156;uvre dans la 
cha&#238;ne de r&#233;solution. La perception des couleurs &#233;tant peu modifi&#233;e9 par le contexte 
op&#233;ratoire, contrairement &#224; la perception de la grandeur, l&#146;ordre d&#146;interpr&#233;tation est donc bien 
couleur puis grandeur.  
</p>
<p>3.2.2 Repr&#233;sentation des extracteurs r&#233;f&#233;rentiels 
</p>
<p>D&#146;apr&#232;s les propositions que nous avons &#233;mises pr&#233;c&#233;demment, un extracteur r&#233;f&#233;rentiel est 
repr&#233;sent&#233; par un agr&#233;gat de trois fonctions (Figure 7), et utilis&#233; par l&#146;algorithme Figure 8. 
</p>
<p>Une fonction &#402;Simil, permet de trier des entit&#233;s selon un crit&#232;re donn&#233; en donnant un rapport 
de similarit&#233; entre deux entit&#233;s selon ce crit&#232;re. En plus des deux entit&#233;s dont elle calcule le 
rapport, cette fonction peut prendre en argument un point de r&#233;f&#233;rence, optionnel ou non selon 
l&#146;extracteur. Ce point de r&#233;f&#233;rence est d&#233;termin&#233; par le contexte ontologique, c&#146;est-&#224;-dire par 
la cat&#233;gorie des entit&#233;s du domaine de r&#233;f&#233;rence sur lequel la diff&#233;rentiation est appliqu&#233;e.  
</p>
<p>                                                 
9  Pour comprendre le calcul du co&#251;t d&#146;interpr&#233;tation, il est n&#233;cessaire de voir le processus d&#146;extraction 
</p>
<p>r&#233;f&#233;rentielle comme un algorithme paresseux, ne prenant en compte les informations que lorsque c&#146;est 
n&#233;cessaire. La prise en compte du contexte op&#233;ratoire pour l&#146;op&#233;ration d&#146;extraction sur la couleur n&#146;est 
n&#233;cessaire que si le rapport entre les &#233;l&#233;ments d&#146;un domaine de r&#233;f&#233;rence est inf&#233;rieur &#224; la variation 
maximale apport&#233;e par la prise en compte du contexte. M&#234;me si la couleur est tout autant d&#233;pendante du 
contexte que la grandeur, le poids du contexte est moins important sur la premi&#232;re que sur la seconde. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Approche Fonctionnelle de la R&#233;solution de la R&#233;f&#233;rence dans le Dialogue Finalis&#233; 
</p>
<p> 
</p>
<p>Une fonction &#402;Exclus, permettant de marquer le point d&#146;exclusion dans le domaine de 
r&#233;f&#233;rence produit par le tri effectu&#233; avec la fonction &#402;Simil. Pour l&#146;extracteur grand, le point 
d&#146;exclusion sera le dernier rapport de similarit&#233; entre entit&#233;s strictement inf&#233;rieur &#224; 1 (c&#146;est-&#224;-
dire les objets les plus petits). Pour l&#146;extracteur couleur, ce point correspond au premier 
rapport de similarit&#233; &#233;gal &#224; &#8869;. 
</p>
<p>Une fonction &#402;Typique, permettant de marquer le point &#224; partir duquel les entit&#233;s ne sont plus 
typiques pour un extracteur donn&#233;. Nous n&#146;avons pu d&#233;terminer de r&#232;gle g&#233;n&#233;rale pour cette 
fonction, mais pour la taille par exemple, elle pourrait marquer le point o&#249; le rapport de 
similarit&#233; entre une entit&#233; et la premi&#232;re devient inf&#233;rieur &#224; un certain seuil, ou bien encore le 
point o&#249; le rapport de similarit&#233; d&#146;entit&#233;s cons&#233;cutives tombe en dessous d&#146;un certain seuil. 
</p>
<p> 
</p>
<p>Figure 7 : Repr&#233;sentation d&#146;un extracteur r&#233;f&#233;rentiel avec prise en compte des marques d&#146;exclusions et de typicalit&#233;. 
</p>
<p> 
</p>
<p>Figure 8 : Algorithme d&#146;utilisation des extracteurs r&#233;f&#233;rentiels 
</p>
<p>4 Travaux en cours et perspectives de recherche 
Apr&#232;s avoir constat&#233; l&#146;insuffisant pouvoir d&#146;expression des approches par pr&#233;dicats pour la 
r&#233;solution de la r&#233;f&#233;rence dans un cadre g&#233;n&#233;rique de dialogue homme machine, et qie cette 
insuffisance oblige pour l&#146;instant les concepteurs de tels syst&#232;mes &#224; concevoir des 
heuristiques ad hoc impossibles &#224; int&#233;grer dans un cadre de description unifi&#233;, nous avons 
propos&#233; un formalisme pour repr&#233;senter la s&#233;mantique des extracteurs r&#233;f&#233;rentiels 
intrins&#232;ques. La prise en compte des extracteurs relationnels et typologique n&#233;cessite d&#146;autres 
m&#233;canismes pour accompagner l&#146;approche fonctionnelle que nous avons propos&#233;e, et nous 
pr&#233;parons actuellement une publication &#224; ce sujet. L&#146;utilisation des fonctions de 
diff&#233;rentiation nous semble une voie prometteuse pour r&#233;soudre ces probl&#232;mes. Gr&#226;ce &#224; la 
repr&#233;sentation utilis&#233;e, il est tr&#232;s facile de prendre en compte les modificateurs d&#146;intensit&#233; 
(tr&#232;s, peu, etc.) et la n&#233;gation. Nous nous engageons dans une exploration approfondie de 
cette voie de recherche. 
</p>
<p>Actuellement, l&#146;&#233;quipe AMI du LIMSI-CNRS d&#233;veloppe le projet INTERVIEWS (Sansonnet et al., 
2002) (Sabouret et Sansonnet, 2001) autour du concept d&#146;agents conversationnels 
</p>
<p>Extracteur : 
&#8226; [ ] &#8869;&#8746;&#8722;&#8594; 1,1),,( refbentit&#233;aentit&#233;fSimil   
&#8226; DomaineRefdDomaineReffExclus &#8594;)(  
&#8226; DomaineRefdDomaineReffTypique &#8594;)(  
</p>
<p>1. Choisir le domaine de r&#233;f&#233;rence courant en fonction du type de l&#146;expression r&#233;f&#233;rentielle (d&#233;finie, ind&#233;finie, 
etc.) tel que propos&#233; dans (Salmon-Alt, 2001) 
</p>
<p>2. Parmi tous les extracteurs, faire dans l&#146;ordre croissant de d&#233;pendance au contexte 
a. Trier les entit&#233;s non exclues du domaine de r&#233;f&#233;rence courant avec la fonction de similarit&#233; de 
</p>
<p>l&#146;extracteur r&#233;f&#233;rentiel. 
b. Marquer la borne d&#146;exclusion dans la liste tri&#233;e. 
</p>
<p>3. Si la totalit&#233; du domaine de r&#233;f&#233;rence est exclu, fin et &#233;chec de la r&#233;solution 
4. Si le type de l&#146;expression r&#233;f&#233;rentielle n&#233;cessite de s&#233;lectionner les r&#233;f&#233;rents typiques, alors 5 sinon 6 
5. Parmi tous les extracteurs, faire dans le m&#234;me ordre que 2 : Marquer la borne typique dans la liste tri&#233;e des 
</p>
<p>candidats r&#233;f&#233;rents. (Le calcul de la borne typique est effectu&#233; en fonction des entit&#233;s pr&#233;sentes dans le 
domaine non exclu) 
</p>
<p>6. A partir de la liste tri&#233;e et marqu&#233;e, extraire le ou les candidats r&#233;f&#233;rents vainqueurs en fonction du type de 
l&#146;expression r&#233;f&#233;rentielle. 
</p>
<p>7. Mettre &#224; jour le domaine de r&#233;f&#233;rence courant. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G. Pitel 
</p>
<p> 
</p>
<p>d&#146;assistance aux gens ordinaires pour l&#146;aide &#224; l&#146;utilisation des composants et services WEB. 
Le formalisme pr&#233;sent&#233; dans cet article est en cours d&#146;impl&#233;mentation dans ce cadre 
applicatif. Ce projet int&#232;gre aussi des m&#233;canismes pour le traitement des expressions 
r&#233;f&#233;rentielles relationnelles et typologiques, issus de nos travaux, mais que nous n&#146;avons pas 
pu pr&#233;senter ici. Il nous est pour l&#146;instant impossible d&#146;en donner une &#233;valuation, les principes 
sous-tendant son fonctionnement &#233;tant assez &#233;loign&#233; de ceux des outils existants, il nous est 
n&#233;cessaire de d&#233;finir un grand nombre de connaissances avant de pouvoir l&#146;exploiter. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Byron D.K, Allen J.F. (2002) What's a Reference Resolution Module to do? Redefining the 
Role of Reference in Language Understanding Systems, Actes de DAARC2002. 
</p>
<p>Dale R., Reiter E. (1995), Computational Interpretation of the Gricean Maxims in the 
Generation of Referring Expressions. Cognitive Science. 
</p>
<p>Dsikovska M.O., Byron D.K. (2000), When is a union really an intersection? Problems 
interpreting reference to locations in a dialogue system, Actes de GOTALOG'2000. 
</p>
<p>Grice H.P. (1975). Logic and conversation. In P. Cole and J. Morgan, editors, Syntax and 
Semantics: Vol 3, Speech Acts, pages 43--58. New York, Academic Press. 
</p>
<p>Lammens J.M., Shapiro S.C., Learning Symbolic names for Perceived Colors, in Machine 
Learning in Computer Vision: What, Why and How?, AAAI-TR FSS93-04. 
</p>
<p>Ozkan N. (1994), Vers un mod&#232;le dynamique du dialogue : analyse de dialogues finalis&#233;s 
dans une perspective communicationnelle, Th&#232;se, INP Grenoble. 
</p>
<p>Pateras C., Dudek G., Mori R. D. (1995), Understanding Referring Expressions in a Person- 
Machine Spoken Dialogue, Actes de ICASSP'95, Detroit, MI. 
</p>
<p>Sabouret N., Sansonnet J.P. (2001), Un mod&#232;le de requ&#234;tes sur le fonctionnement de 
composants actifs, Actes de MFI'01. 
</p>
<p>Sansonnet J.P., Sabouret N., Pitel G. (2002), An Agent Design and Query Language dedicated 
to Natural Language Interaction, Poster &#224; AAMAS 2002. 
</p>
<p>Salmon-Alt S. (2001), R&#233;f&#233;rence et dialogue finalis&#233; : de la linguistique &#224; un mod&#232;le 
op&#233;rationnel, Th&#232;se d'informatique, Universit&#233; H.Poincar&#233; - Nancy 1, France. Mai 2001. 
</p>
<p>Schang  D. (1995), Application de la notion de cadre aux &#233;nonc&#233;s de positionnement et de 
r&#233;f&#233;rence, Rapport de recherche n&#176; 2529, Unit&#233; de Recherche INRIA Lorraine. 
</p>
<p>Winograd T. (1973), A Procedural Model of Language Understanding, Computer Models of 
Thought and Language, Roger Schank &amp; Kenneth Colby &#233;diteurs., W. H. Freman Press. </p>

</div></div>
</body></html>