<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Soci&#233;t&#233; d&#8217;agents apprenants et s&#233;mantique lexicale : comment construire des vecteurs conceptuels &#224; l&#8217;aide de la double boucle</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RECITAL 2003, Batz-sur-Mer, 11&#8211;14 juin 2003
</p>
<p>Soci&#233;t&#233; d&#8217;agents apprenants et s&#233;mantique lexicale : comment
construire des vecteurs conceptuels &#224; l&#8217;aide de la double
</p>
<p>boucle
</p>
<p>Didier Schwab
LIRMM
</p>
<p>Laboratoire d&#8217;informatique, de Robotique
et de Micro&#233;lectronique de Montpellier
</p>
<p>MONTPELLIER - FRANCE.
schwab@lirmm.fr
</p>
<p>http://www.lirmm.fr/&#732;schwab
</p>
<p>Mots-clefs &#8211; Keywords
</p>
<p>soci&#233;t&#233;s d&#8217;agents, vecteurs conceptuels, s&#233;mantique lexicale, apprentissage
agents society, conceptual vectors, lexical semantic, learning
</p>
<p>R&#233;sum&#233; - Abstract
</p>
<p>Dans le cadre de la repr&#233;sentation du sens en TALN, nous d&#233;veloppons actuellement un sys-
t&#232;me d&#8217;analyse des aspects th&#233;matiques des textes et de d&#233;sambigu&#239;sation lexicale bas&#233;e sur les
vecteurs conceptuels. Ces vecteurs visent &#224; repr&#233;senter un ensemble d&#8217;id&#233;es associ&#233;es &#224; tout
segment textuel. &#192; partir de ce mod&#232;le, nous avons pos&#233; des hypoth&#232;ses sur la construction des
vecteurs. Dans cet article, nous montrons comment ces hypoth&#232;ses, ainsi que des consid&#233;ra-
tions techniques comme la possibilit&#233; de distribuer les t&#226;ches &#224; effectuer ou la modularit&#233;, nous
ont amen&#233;es &#224; adopter une architecture multi-agents. Chaque agent poss&#232;de un certain nombre
de comp&#233;tences, une m&#233;moire qui lui est propre et peut interragir avec son environnement (les
autres agents). Pour finir, nous pr&#233;sentons les agents d&#233;j&#224; impl&#233;ment&#233;s et un exemple de leur
collaboration.
</p>
<p>In the framework of research in meaning representations in NLP, we focus our attention on
thematic aspects and lexical disambiguation based on conceptual vectors. These vectors are
supposed to encode &#8220;ideas&#8221; associated to words or expressions. Starting from this model, we
have built a number of hypothesis on the construction of vectors. In this article, we show how
we adopted a multi-agents architecture using these hypothesis together with some technical con-
siderations such as modularity and tasks distribution. Each agent has some abilities, a memory,
and can interact with its environment (the other agents). To conclude, we present implemented
agents and an example of their collaboration.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab
</p>
<p>1 introduction
</p>
<p>Dans le cadre de la repr&#233;sentation du sens en TALN, l&#8217;&#233;quipe TAL (Traitement Algorithmique
des Langues) du LIRMM d&#233;veloppe actuellement un syst&#232;me d&#8217;analyse des aspects th&#233;matiques
des textes et de d&#233;sambigu&#239;sation lexicale bas&#233;e sur les vecteurs conceptuels. Ces vecteurs
cherchent &#224; repr&#233;senter un ensemble d&#8217;id&#233;es associ&#233;es &#224; tout segment textuel (mots, expres-
sions, textes, . . . ). &#192; partir de ce mod&#232;le, nous avons pos&#233; un certain nombre hypoth&#232;ses sur
la construction des vecteurs (g&#233;n&#233;ration automatique, multi-sources, apprentissage permanent,
. . . ). Dans cet article, nous montrons comment ces hypoth&#232;ses ainsi que des consid&#233;rations
techniques comme la possibilit&#233; de distribuer les t&#226;ches &#224; effectuer ou la modularit&#233;, nous ont
amen&#233; &#224; constituer une architecture multi-agents. Chaque agent poss&#232;de un certain nombre de
comp&#233;tences (conservations de d&#233;finitions, de vecteurs, analyse morpho-syntaxiques, fonctions
lexicales, . . . ), d&#8217;une m&#233;moire qui lui est propre et peut interragir avec son environnement (les
autres agents). Nous pr&#233;sentons l&#8217;organisation g&#233;n&#233;rale d&#8217;un tel syst&#232;me et enfin un exemple de
coop&#233;ration entre agents dans le cadre de l&#8217;apprentissage d&#8217;un item.
</p>
<p>2 Vecteurs conceptuels
</p>
<p>Nous repr&#233;sentons les aspects th&#233;matiques des segments textuels (documents, paragraphes, syn-
tagmes, etc) par des vecteurs conceptuels. Les vecteurs ont &#233;t&#233; utilis&#233;s en informatique doc-
umentaire pour la recherche d&#8217;information (Salton et MacGill, 1983). Leur emploi pour la
repr&#233;sentation du sens est plus le fait du mod&#232;le LSI (Latent Semantic Indexing (Deerwester et
al., 90)) issue de l&#8217;analyse s&#233;mantique latente en psycho-linguistique. En informatique, et de
fa&#231;on presque concurrente, c&#8217;est &#224; partir de (Chauch&#233;, 90) que l&#8217;on a une formalisation de la
projection de la notion, linguistique cette fois, de champ s&#233;mantique dans un espace vectoriel.
&#192; partir d&#8217;un ensemble de notions &#233;l&#233;mentaires dont nous faisons l&#8217;hypoth&#232;se, les concepts,
il est possible de construire des vecteurs (dits conceptuels) et de les associer &#224; des items lexi-
caux1. Les termes polys&#233;miques combinent les diff&#233;rents vecteurs correspondant aux diff&#233;rents
sens. Cette approche vectorielle est fond&#233;e sur des propri&#233;t&#233;s math&#233;matiques bien connues
sur lesquelles il est possible d&#8217;effectuer des manipulations formellement pertinentes auxquelles
sont attach&#233;es des interpr&#233;tations linguistiques raisonnables. Les concepts sont donn&#233;s a pri-
ori. Dans notre exp&#233;rimentation sur le fran&#231;ais nous utilisons (Larousse, 1992) dans lequel
sont d&#233;finis 873 concepts. L&#8217;hypoth&#232;se principale du th&#233;saurus, que nous adoptons ici, est que
cet ensemble constitue un espace g&#233;n&#233;rateur pour les termes et leurs sens. D&#8217;une fa&#231;on plus
g&#233;n&#233;rale, n&#8217;importe quel sens peut s&#8217;y projeter selon le principe suivant.
Soit
</p>
<p>&#0;
</p>
<p>un ensemble fini de &#1; concepts, un vecteur conceptuel &#2; est une combinaison lin&#233;aire
d&#8217;&#233;l&#233;ments &#3;&#5;&#4; de
</p>
<p>&#0;
</p>
<p>. Pour une id&#233;e &#6; , le vecteur &#2;&#8;&#7; est la description en extension des activa-
tions de tous les concepts de
</p>
<p>&#0;
</p>
<p>. Par exemple, les diff&#233;rents sens d&#8217; &#9; existence &#10; peuvent &#234;tre pro-
jet&#233;s sur les concepts suivants (les CONCEPT &#11; intensit&#233; &#12; sont ordonn&#233;s par valeurs d&#233;croissantes) :
&#2;&#13;&#9; existence &#10; = (EXISTENCE &#11; 0.82 &#12; , VIE &#11; 0.44 &#12; , IDENTIT&#201; &#11; 0.38 &#12; , &#201;TAT &#11; 0.33 &#12; , . . . ). En pratique, plus &#0; est
large, plus fines sont les descriptions de sens mais plus leur manipulation est lourde. Il est clair
que pour les vecteurs denses, ceux qui ont peu de coordonn&#233;es nulles, l&#8217;&#233;num&#233;ration des con-
cepts activ&#233;s est longue et la pertinance difficile &#224; &#233;valuer. En g&#233;n&#233;ral, pour &#233;valuer la qualit&#233;
</p>
<p>1Les items lexicaux sont des mots ou des expressions qui constituent les entr&#233;es du lexique. Par exemple,
&#14; voiture &#15; ou &#14; pomme de terre &#15; sont des items lexicaux. Dans la suite, par abus de langage, nous utiliserons parfois
mot ou terme pour qualifier un item lexical. Nous noterons les items en minuscule et entre apostrophes ( &#14; vie &#15; ) et
les concepts en majuscules ( VIE ).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Soci&#233;t&#233; d&#8217;agents apprenants et s&#233;mantique lexicale
</p>
<p>d&#8217;un vecteur, nous pr&#233;f&#232;rerons s&#233;lectionner les termes th&#233;matiquements proches, le voisinage
(not&#233; &#16; ). Par exemple, pour &#9; vie &#10; : &#16; ( &#9; existence &#10; ) : &#9; existence &#10; , &#9; exister &#10; , &#9; vivant &#10; , &#9; vie &#10; , . . . Cette
op&#233;ration est r&#233;alis&#233;e &#224; l&#8217;aide de la distance angulaire.
</p>
<p>2.1 Distance angulaire
</p>
<p>Soit &#17;&#19;&#18;&#21;&#20;&#23;&#22;&#25;&#24;ff&#26;flfi&#31;ffi une des mesures de similarit&#233; entre deux vecteurs X et Y, souvent utilis&#233;e
en recherche d&#8217;information (Morin, 1999). &#17; &#18;&#21;&#20;&#23;&#22;&#25;&#24;!&#26;&quot;fi#ffi%$ &amp;('*)+&#22;-,&#24;ff&#26;&quot;fi&#31;ffi&#23;$ .0/ 12
</p>
<p>.
</p>
<p>24352
</p>
<p>1
</p>
<p>2 avec &#8220; 6 &#8221;
</p>
<p>d&#233;signant le produit scalaire. Nous supposons ici que les composants des vecteurs sont positifs
ou nuls, la distance angulaire entre deux vecteurs &#24; et fi est 78&#7;9&#22;&#25;&#24;!&#26;&quot;fi&#31;ffi $;:=&lt;&gt;&amp;(&amp;?'@)A&#22;&#21;&#17; &#18;&#21;&#20;&#23;&#22;&#25;&#24;!&#26;&quot;fi&#31;ffi4ffi .
Intuitivement, cette fonction constitue une &#233;valuation de la proximit&#233; th&#233;matique et en pratique
la mesure de l&#8217;angle entre les deux vecteurs. Nous consid&#233;rons en g&#233;n&#233;ral que pour une distance
7#&#7;&#19;&#22;B&#24;ff&#26;&quot;fi&#13;ffiDC E F ( GIH*J ), X et Y sont th&#233;matiquement proches et partagent plusieurs concepts.
Pour 7#&#7;&#19;&#22;B&#24;ff&#26;&quot;fi&#13;ffiLKMEF , la proximit&#233; th&#233;matique est consid&#233;r&#233;e comme faible et aux alentours de
E N ( O@P J ), X et Y n&#8217;ont aucune relation. On remarquera que ces seuils ne servent que d&#8217;indicateurs
pour un r&#233;viseur humain et restent &#224; la fois subjectifs et arbitraires. 78&#7; est une distance, elle
v&#233;rifie donc les propri&#233;t&#233;s de r&#233;flexivit&#233;, de sym&#233;trie et d&#8217;in&#233;galit&#233; triangulaire. Nous obtenons,
par exemple, les angles suivants2 :
QSR (V( &#14; locomotive &#15; ), V( &#14; locomotive &#15; ))=0 ( T+U ) QSR (V( &#14; locomotive &#15; ), V( &#14; rhododendron &#15; ))=1.15 ( V?W+U )
QSR (V( &#14; locomotive &#15; ), V( &#14; locomotrice &#15; ))=0.24 ( X4YAU ) QSR (V( &#14; locomotive &#15; ), V( &#14; train &#15; ))=0.54 ( Z[X&#5;U )
QSR (V( &#14; locomotive &#15; ), V( &#14; automotrice &#15; ))=0.22 ( X&gt;Z U ) QSR (V( &#14; locomotive &#15; ), V( &#14; gu&#233;pard &#15; ))=0,94 ( W&quot;Y U )
</p>
<p>Le premier r&#233;sultat a une interpr&#233;tation directe, &#9; locomotive &#10; ne peut &#234;tre plus proche d&#8217;autre
chose que de lui m&#234;me. Les termes &#9; automotrice &#10; et &#9; locomotrice &#10; sont synonymes de &#9; locomotive &#10; ,
ce qui explique les deux r&#233;sultats suivants. Le peu de rapport entre &#9; locomotive &#10; et &#9; rhododendron &#10;
explique l&#8217;&#233;cart entre leur vecteurs. Dans le dernier exemple, l&#8217;angle peu important entre
&#9; locomotive &#10; et &#9; gu&#233;pard &#10; au regard de celui entre &#9; locomotive &#10; et &#9; rhododendron &#10; se comprend si
on se rappelle que 7\&#7; est une distance th&#233;matique et non une distance ontologique. Les deux
items ont en commun de partager une id&#233;e de rapidit&#233;. On remarquera que les comparaisons
entre les valeurs sont plus significatives que les valeurs elles-m&#234;mes. Seule une expertise hu-
maine est capable de juger de la pertinence des vecteurs (si les r&#233;sultats renvoy&#233;s sont coh&#233;rents
avec la langue).
</p>
<p>2.2 Construction des vecteurs conceptuels : hypoth&#232;ses de d&#233;part
</p>
<p>Tout en respectant le mod&#232;le pr&#233;sent&#233;, les vecteurs peuvent &#234;tre construits de plusieurs mani&#232;res.
Il s&#8217;agit d&#8217;une &#233;tape cl&#233; car les r&#233;sultats pratiques, la proximit&#233; th&#233;matique en particulier, sont
diff&#233;rents suivant le mode de construction. La construction de nos vecteurs est bas&#233;e sur
quelques hypoth&#232;ses fortes.
</p>
<p>2.2.1 G&#233;n&#233;ration automatique
</p>
<p>Le but est de construire une base de stockage de couples ]^&#18;&#21;_a`b&#20;c&#26;flde`+&#3;&quot;_a`bf&#8;gih . La difficult&#233;
principale vient de l&#8217;affectation de vecteurs &#224; chaque item. Dans notre exp&#233;rience sur le fran&#231;ais,
pour un peu plus de 100000 entr&#233;es (mots communs, nom propres, expressions, . . . ), le taux de
termes polys&#233;miques est d&#8217;environ 61%. Le nombre moyen de d&#233;finitions pour ces derniers
&#233;tant d&#8217;un peu plus de 5, il faudrait indexer &#224; la main plus de 400000 vecteurs de taille 873, ce
qui totalement inenvisageable.
</p>
<p>2Les exemples sont extraits de http://www.lirmm.fr/&#732;schwab</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab
</p>
<p>Notre premi&#232;re hypoth&#232;se forte est qu&#8217;il est possible d&#8217;automatiser cette t&#226;che gr&#226;ce &#224; un ap-
prentissage bas&#233; sur des informations extraites de diverses sources (dictionnaires, listes de syn-
onymes, indexations manuelles, recherches web, . . . ). L&#8217;essentiel de l&#8217;apprentissage principal
se fait sur des dictionnaires &#224; usage humain. Dans la perspective o&#249; nous pla&#231;ons cet article,
dans un espace dimensionn&#233; en fonction d&#8217;une hi&#233;rarchie de concepts3, un amor&#231;age du syst&#232;me
d&#8217;apprentissage est n&#233;cessaire. Il s&#8217;agit d&#8217;affecter des vecteurs &#224; un nombre r&#233;duit d&#8217;entit&#233;s qui
sont choisies en fonction de leur fr&#233;quence en langue et/ou de leur polys&#233;mie. La taille du
noyau est tr&#232;s r&#233;duite (un millier de termes environ) et les &#233;l&#233;ments de ce noyau consid&#233;r&#233;s
comme pertinents. &#192; partir de ce noyau, le processus d&#8217;apprentissage peut d&#233;buter. La m&#233;thode
d&#8217;analyse construit, &#224; partir de vecteurs conceptuels d&#233;j&#224; existants et de nouvelles d&#233;finitions,
de nouveaux vecteurs. L&#8217;id&#233;e est qu&#8217;&#224; partir d&#8217;un noyau r&#233;duit d&#8217;items pertinents, un apprentis-
sage sur des d&#233;finitions permet de cr&#233;er une coh&#233;rence entre les vecteurs et donc de g&#233;n&#233;rer une
base d&#8217;items pertinents.
</p>
<p>2.2.2 Analyse multi-sources
</p>
<p>L&#8217;analyse des d&#233;finitions pose un certain nombre de probl&#232;mes quant &#224; la lecture du sens. C&#8217;est
le cas du m&#233;talangage, c&#8217;est &#224; dire le langage utilis&#233; pour structurer le dictionnaire. Ce dernier
est ais&#233;ment utilisable lorsqu&#8217;il s&#8217;agit de r&#233;cup&#233;rer les cat&#233;gories grammaticales des items mais
certaines constructions de d&#233;finitions sont difficilement compr&#233;hensibles sans comp&#233;tence m&#233;-
talinguistique. Comment savoir que en parlant est du m&#233;talangage dans une d&#233;finition de l&#8217;item
&#9; aboyer &#10; comme Crier, en parlant du chien.? Pour pallier de tels manques d&#233;finitoires, nous util-
isons diverses sources lexicales. Il s&#8217;agit de temp&#233;rer statistiquement les diverses incoh&#233;rences
locales. Ainsi, si une d&#233;finition est mal form&#233;e (donc difficilement analysable correctement)
une autre d&#233;finition, mieux form&#233;e et provenant d&#8217;une autre source pourra corriger l&#8217;effet de la
premi&#232;re. L&#8217;utilisation de multi-sources permet aussi de maximiser la probabilit&#233; de r&#233;cup&#233;rer
une d&#233;finition pour certains termes qui sont dans certains dictionnaires et pas dans d&#8217;autres. On
ne trouve pas, par exemple, &#9; liturgiste &#10; dans (Larousse, 2001) mais on le trouve dans (Robert,
2000).
</p>
<p>2.2.3 Apprentissage permanent
</p>
<p>Pour analyser un certain nombre de documents, en particulier les journaux, il est souvent n&#233;ces-
saire de savoir &#224; quoi correspondent des n&#233;ologismes, qui sont certaines personnalit&#233;s ou encore
quel est le domaine d&#8217;activit&#233; d&#8217;une entreprise. Par exemple, dans un texte, l&#8217;usage du nom de
l&#8217;entreprise &#9; Usinor &#10; indique vraisemblablement un contexte ax&#233; sur le traitement de l&#8217;acier. Les
diverses sources et en particulier le web par les serveurs d&#8217;informations (Le Monde, Lib&#233;ration,
. . . ) pr&#233;sentent ces nouveaut&#233;s.
Il est, de plus, difficile de penser que la base de vecteurs deviendrait coh&#233;rente d&#232;s la premi&#232;re
passe. Il est vraissemblable que des mots cl&#233;s d&#8217;une d&#233;finition n&#8217;aient pas encore &#233;t&#233; appris par
le syst&#232;me lors de son analyse. La convergence des vecteurs vers une position quasi-stable ne
pourra se faire que dans un nombre de cycles qu&#8217;il est impossible de d&#233;terminer &#224; l&#8217;avance mais
qui est fonction de l&#8217;ordre d&#8217;apprentissage des items et de leur d&#233;finition. Ces deux raisons, la
variabilit&#233; lexicale et l&#8217;impossibilit&#233; de v&#233;ritablement stabiliser une base, nous ont conduits &#224;
consid&#233;rer cette troisi&#232;me hypoth&#232;se forte : la base est en apprentissage permanent.
</p>
<p>3Notre &#233;quipe travaille parall&#232;lement sur la non-utilisation d&#8217;une telle hi&#233;rarchie, sur ses cons&#233;quences et ses
diff&#233;rences avec l&#8217;approche &#8220;classique&#8221; pr&#233;sent&#233;e ici.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Soci&#233;t&#233; d&#8217;agents apprenants et s&#233;mantique lexicale
</p>
<p>3 Vers une soci&#233;t&#233; d&#8217;agents
</p>
<p>Notre objectif est la cr&#233;ation d&#8217;un v&#233;ritable syst&#232;me permettant l&#8217;apprentissage des vecteurs
et leur exploitation. Il s&#8217;agit de r&#233;cup&#233;rer des d&#233;finitions, les analyser &#224; l&#8217;aide des vecteurs
d&#233;j&#224; calcul&#233;s afin d&#8217;en fabriquer de nouveaux. L&#8217;analyse simple des d&#233;finitions peut ne pas
toujours suffire &#224; am&#233;liorer la coh&#233;rence des vecteurs (difficult&#233; d&#8217;analyser certaines tournures,
probl&#232;mes de m&#233;talangage, . . . ). Plusieurs solutions sont alors possibles comme par exemple,
l&#8217;utilisation des relations s&#233;mantiques existant entre les items (synonymie (Lafourcade et Prince,
2001), antonymie (Schwab et al., 2002), hyp&#233;ronymie, . . . ). D&#8217;autres solutions peuvent etre
envisag&#233;es.
</p>
<p>L&#8217;exploitation des vecteurs peut aussi &#234;tre plurielle : utilisation pour la d&#233;sambigu&#239;sation s&#233;-
mantique, annotation, transfert lexical, recherche d&#8217;informations. &#192; la fois pour l&#8217;exploitation
et l&#8217;apprentissage des vecteurs conceptuels, il est donc n&#233;cessaire de pouvoir facilement ajouter
des modules apportant tel ou tel service. C&#8217;est une des raisons pour lesquelle notre vision de
l&#8217;architecture n&#233;cessaire s&#8217;est rapidement rapproch&#233;e des syst&#232;mes multi-agents (SMA).
</p>
<p>3.1 SMA et TALN
</p>
<p>Les SMA sont issus de l&#8217;intelligence artificielle distribu&#233;e (IAD) qui r&#233;partit l&#8217;intelligence
dans des agents. Tout ou partie de cette intelligence est la cons&#233;quence de leur int&#233;raction
(ph&#233;nom&#232;ne d&#8217;&#233;mergence). Un agent est une entit&#233; physique ou virtuelle (virtuelle dans notre
cas) capable d&#8217;agir sur son environnement (les autres agents), qui peut communiquer directe-
ment avec d&#8217;autres agents, qui poss&#232;de des ressources propres, qui est capable de percevoir son
environnement, qui poss&#232;de des comp&#233;tences et offre des services. On peut distinguer deux
types d&#8217;agents (Ferber, 1995):
</p>
<p>j les agents r&#233;actifs : les syst&#232;mes &#224; agents r&#233;actifs suivent l&#8217;hypoth&#232;se que le syst&#232;me
peut avoir un comportement global intelligent sans que les agents soient n&#233;cessairement
intelligents individuellement. La communication des agents r&#233;actifs se fait par diffusion
d&#8217;un signal dans l&#8217;environnement. Un exemple type d&#8217;agent r&#233;actif est celui des fourmis
dont les actions se coordonnent afin de r&#233;soudre des probl&#232;mes complexes tel que ceux
de la recherche de nourriture, construction de nid, . . .
</p>
<p>j les agents cognitifs : chaque agent poss&#232;de sa propre base de connaissance, c&#8217;est &#224; dire
l&#8217;ensemble des informations et des savoir-faire n&#233;cessaires &#224; la r&#233;alisation de sa t&#226;che.
Les communications se font ici par envoi de messages entre agents et &#233;ventuellement
tractations, n&#233;gociations entre eux.
</p>
<p>Nous nous situons clairement ici dans la deuxi&#232;me approche, au moins, &#224; l&#8217;&#233;chelle globale du
syst&#232;me (cf 3.2.1). Celle-ci est utilis&#233;e d&#233;j&#224; depuis longtemps dans le domaine des langues
naturelles. D&#232;s le d&#233;but des ann&#233;es 70, des travaux en IAD ont &#233;t&#233; effectu&#233;s sur la compr&#233;hen-
sion automatique de la parole (HEARSAY-II (Erman et al., 1980)). Plus r&#233;cemment, (Lebarb&#233;,
2001) utilise cette approche pour l&#8217;analyse syntaxique et (Men&#233;zo et al., 1996) pour la d&#233;tection
d&#8217;erreurs. Parmis les autres travaux, certains se rapprochent de ce que nous voulons faire, une
architecture modulaire permettant l&#8217;apprentissage de donn&#233;es et leur utilisation. On peut citer
le syst&#232;me CARAMEL (Sabah, 1990) ou le syst&#232;me TALISMAN (Stefanini et al. 1992).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab
</p>
<p>Les caract&#233;ristiques de notre syst&#232;me sont induites par les caract&#233;ristiques g&#233;n&#233;rales des agents
et les moyens de communiquer entre eux, c&#8217;est &#224; dire leur interaction.
</p>
<p>3.2 Agents
</p>
<p>Nos agents ont des caract&#233;ristiques &#224; la fois conceptuelles (les hypoth&#232;ses que nous suivont pour
les cr&#233;er) et techniques (comment ils sont impl&#233;ment&#233;s) .
</p>
<p>3.2.1 Caract&#233;ristiques conceptuelles : hypoth&#232;ses
</p>
<p>Ce sont ces caract&#233;ristiques qui d&#233;veloppent le caract&#232;re cognitif de nos agents, c&#8217;est &#224; dire la
mani&#232;re dont ils &#8220;raisonnent&#8221;.
</p>
<p>j Vision r&#233;cursive des agents : Notre syst&#232;me peut &#234;tre vu &#224; diff&#233;rentes &#233;chelles. M&#234;me si
nous nous situons clairement dans une approche cognitive au niveau global de notre sys-
t&#232;me, chaque agent peut &#234;tre lui-m&#234;me compos&#233; d&#8217;agents r&#233;actifs dont l&#8217;effet &#233;mergeant
fera l&#8217;objet de transmission aux autres agents par envoi de messages. Par exemple,
pour l&#8217;analyse d&#8217;un texte, un agent peut utiliser un syst&#232;me de fourmis (agents r&#233;act-
ifs) sur l&#8217;arbre morpho-syntaxique correspondant afin de d&#233;sambigu&#239;ser les feuilles et
faire &#233;merger le vecteur global du texte (Lafourcade, 2003) qui sera envoy&#233; &#224; l&#8217;agent
demandeur.
</p>
<p>j Apprentissage par renforcement, double boucle :
Chacun des agents poss&#232;de sa propre base de connaissance qu&#8217;il modifie au gr&#233; de ses
exp&#233;riences et de ses int&#233;ractions avec les autres agents. &#192; chaque requ&#234;te, les agents
tirent parti des informations re&#231;ues pour modifier leurs connaissances avant de r&#233;pondre
&#224; la requ&#234;te. Par exemple, l&#8217;agent d&#8217;apprentissage peut extraire d&#8217;une d&#233;finition une liste
d&#8217;antonymes. Il va demander aux agent sp&#233;cialistes de l&#8217;antonymie de lui fournir les
vecteurs correspondants. Ces agents vont donc permettre une am&#233;lioration g&#233;n&#233;rale de
la coh&#233;rence de la base. Parall&#232;lement, ces agents vont utiliser les informations lexicales
re&#231;ues du syst&#232;me pour modifier leurs m&#233;thodes de calcul (Schwab et al., 2002). Ainsi, les
agents peuvent fournir de meilleurs r&#233;sultats. Le syst&#232;me global s&#8217;enrichit de l&#8217;apport des
agents qui eux-m&#234;me s&#8217;enrichissent du syst&#232;me (cf. fig. 1). Ce principe est semblable
&#224; l&#8217;apprentissage dans le syst&#232;me nerveux central (SNC). Les neurones constituent un
r&#233;seau qui se renforce &#224; mesure qu&#8217;il est utilis&#233; et il sera d&#8217;autant plus utilis&#233; qu&#8217;il sera
renforc&#233;. Ce principe est connu sous le nom de double boucle (Lecerf, 1997).
</p>
<p>j Unicit&#233; des agents : Au cours de sa vie, chaque agent est unique. Plusieurs agents peu-
vent pourtant avoir un r&#244;le identique, &#234;tre sp&#233;cialiste d&#8217;un m&#234;me domaine. Par exem-
ple, plusieurs agents peuvent &#234;tre charg&#233;s de l&#8217;analyse du fran&#231;ais ou &#234;tre sp&#233;cialistes
de la m&#234;me relation s&#233;mantique. Ces agents peuvent &#234;tre conceptuellements diff&#233;rents,
c&#8217;est &#224; dire qu&#8217;ils utilisent chacun une m&#233;thode particuli&#232;re de r&#233;solution du probl&#232;me
(l&#8217;analyse s&#233;mantique d&#8217;un texte peut se faire, par exemple, par propagation d&#8217;un vecteur
conceptuel dans l&#8217;arbre morpho-syntaxique ou par &#233;mergeance gr&#226;ce &#224; des agents r&#233;actifs
de type fourmis) ou &#234;tre simplement des clones (exactement le m&#234;me code source). Dans
ce dernier cas, l&#8217;unicit&#233; des agents est la cons&#233;quence de l&#8217;exp&#233;rience diff&#233;rente acquise
par chaque agent en fonction des donn&#233;es rencontr&#233;es ou des requ&#234;tes re&#231;ues. Il est par
exemple difficile de savoir si un ordre particulier dans l&#8217;apprentissage des vecteurs leur</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Soci&#233;t&#233; d&#8217;agents apprenants et s&#233;mantique lexicale
</p>
<p>agent agent
</p>
<p>agent
</p>
<p>agentagent
</p>
<p>environnement
(autres agents)
</p>
<p>agent
</p>
<p>connaissances
</p>
<p>Figure 1: Double boucle : la figure de gauche montre l&#8217;organisation macroscopique d&#8217;un syst&#232;me et l&#8217;interaction
des diff&#233;rents agents entre eux. La figure de droite pr&#233;sente l&#8217;organisation microscopique d&#8217;un syst&#232;me, la &#8220;vision
du monde&#8221; d&#8217;un agent. Les donn&#233;es ext&#233;rieures sont utilis&#233;es pour am&#233;liorer la propre base de connaissance de
l&#8217;agent et l&#8217;agent am&#233;liore les donn&#233;es ext&#233;rieures (double boucle)
</p>
<p>assurerait une convergence plus rapide. Un agent d&#8217;apprentissage r&#233;vise donc p&#233;riodique-
ment de mani&#232;re al&#233;atoire chaque item de sa base. Un autre agent de ce type acquiert une
exp&#233;rience distincte puisqu&#8217;il analyse les items dans un ordre diff&#233;rent. Il en est de m&#234;me
des agents sp&#233;cialistes des relations s&#233;mantiques puisqu&#8217;ils peuvent ne pas rencontrer les
m&#234;mes couples de termes ou les rencontrer plus ou moins souvent.
</p>
<p>j expertises en concurrence : lorsqu&#8217;un agent est confront&#233; &#224; un probl&#232;me, il peut demander
&#224; d&#8217;autres agents de l&#8217;aider. Ces agents lui donnent un certain nombre de solutions qu&#8217;il
lui revient de choisir voire si possible de combiner. Par exemple, si un agent d&#8217;analyse
s&#233;mantique rencontre un sch&#233;ma particulier, il pourra demander aux agents experts en
antonymie, hyp&#233;ronymie ou m&#233;ronymie si ce sch&#233;ma peut les caract&#233;riser. De m&#234;me, il
peut demander un service &#224; des agents sp&#233;cialistes d&#8217;un m&#234;me domaine. Dans les deux
cas, l&#8217;agent demandeur consid&#232;rera toutes les r&#233;ponses obtenues et leur attribuera plus ou
moins de cr&#233;dit en fonction de la comp&#233;tence de l&#8217;agent.
</p>
<p>3.2.2 Caract&#233;ristiques techniques
</p>
<p>Ce sont les caract&#233;ristiques mat&#233;rielles des agents, la mani&#232;re dont ils sont impl&#233;ment&#233;s et
comment ils communiquent.
</p>
<p>j Possibilit&#233; de distribuer sur plusieurs machines : Les syst&#232;mes TALN ont toujours &#233;t&#233;
consommateurs de ressources syst&#232;mes importantes dues aux donn&#233;es &#224; stocker (la taille
du lexique est d&#8217;au moins 100000 entr&#233;es pour une langue comme le Fran&#231;ais) et aux
calculs souvents lourds. Chaque agent peut se trouver sur une machine, ainsi, il pourra
pleinement utiliser les ressources mat&#233;rielles disponibles. La communication entre agents
se fait donc par acc&#232;s r&#233;seaux sur le mod&#232;le client-serveur.
</p>
<p>j modularit&#233; : La modularit&#233; est une caract&#233;ristique principale des architectures agent.
Un service global r&#233;sulte de la coop&#233;ration de chaque agent qui effectue une sous-t&#226;che
moins complexe. Les avantages g&#233;nie-logiciel sont nombreux : un d&#233;veloppeur peut
facilement cr&#233;er un agent dans le langage informatique de son choix, pourra ais&#233;ment le
tester et l&#8217;am&#233;liorer ind&#233;pendament des autres. L&#8217;ajout d&#8217;un programme d&#233;j&#224; existant est
simplifi&#233;. Dans notre application, par exemple, il a &#233;t&#233; extr&#232;mement facile de cr&#233;er un
agent d&#8217;analyse morpho-syntaxique qui n&#8217;est qu&#8217;une interface &#224; l&#8217;analyseur SYGMART.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab
</p>
<p>La modularit&#233; est une des caract&#233;ristiques fondamentales pour notre syst&#232;me puisque en
plus de ces avantages, il est facile de r&#233;unir plusieurs syst&#232;mes (un g&#233;rant le fran&#231;ais, un
autre l&#8217;anglais, par exemple) pour n&#8217;en obtenir qu&#8217;un.
</p>
<p>3.3 Gestion et communication des agents
</p>
<p>La gestion des agents se fait par un superviseur. Lors de sa cr&#233;ation, chaque agent adresse
au superviseur son identifiant, son r&#244;le, &#233;ventuellement sa langue4, ainsi que la machine et le
port sur lequel il &#233;coute. Le superviseur accepte la cr&#233;ation de l&#8217;agent si aucun autre agent
encore actif ne pr&#233;sente cet identifiant. Plusieurs types de communications sont possibles : (1)
communication directe entre agents : comme pour le point &#224; point (peer to peer), un agent
demande au superviseur l&#8217;adresse particuli&#232;re d&#8217;un agent puis communique directement avec
lui. C&#8217;est le cas, par exemple, d&#8217;un agent contextualiseur qui a besoin de r&#233;cup&#233;rer tr&#232;s souvent
les informations sur les lexies (cf 4.1) que stocke la base de vecteurs. (2) Communication par
l&#8217;interm&#233;diaire du superviseur : Suivant la requ&#234;te, les messages peuvent &#234;tre envoy&#233;s &#224; un
agent, &#224; tous les agents ayant un certain r&#244;le, &#224; tous les agents d&#8217;une langue ayant un certain
r&#244;le et m&#234;me &#224; tous les agents. En pratique, le message est envoy&#233; au superviseur qui se charge
de l&#8217;envoyer &#224; ses destinataires. Chaque agent qui a re&#231;u le message y r&#233;pond en apportant une
r&#233;ponse ou en signifiant sa non-comp&#233;tence dans ce domaine.
</p>
<p>4 Exemple de soci&#233;t&#233; d&#8217;agents
</p>
<p>4.1 Agents impl&#233;ment&#233;s
</p>
<p>&#192; l&#8217;heure actuelle, notre syst&#232;me compte un certain nombre d&#8217;agents qui peuvent avoir les r&#244;les
suivants :
</p>
<p>j Base : ce sont des agents dont le but est de conserver et de restituer les donn&#233;es n&#233;ces-
saires &#224; l&#8217;apprentissage (d&#233;finitions, vecteurs conceptuels).
</p>
<p>j Contextualiseur : cette sorte d&#8217;agents est capable de calculer le vecteur conceptuel d&#8217;un
item en fonction de contextes s&#233;mantique et morphologiques. En pratique, il fait une
somme pond&#233;r&#233;e des vecteurs calcul&#233;s pour chaque d&#233;finition du terme en fonction d&#8217;un
vecteur contexte, d&#8217;informations morphologiques et statistiques (fr&#233;quence en corpus).
</p>
<p>j Analyseur morpho-syntaxique : Il s&#8217;agit de l&#8217;analyseur SYGMART(Chauch&#233;, 84). Pour
un texte, il nous renvoie l&#8217;arbre morpho-syntaxique correspondant.
</p>
<p>j Analyseur s&#233;mantique : avec l&#8217;aide de l&#8217;agent d&#8217;analyse morpho-syntaxique et l&#8217;aide de
l&#8217;agent contextualiseur, l&#8217;agent d&#8217;analyse s&#233;mantique calcule le vecteur correspondant &#224;
un texte. Ce texte, dans le cas d&#8217;un apprentissage est une d&#233;finition de dictionnaire dont
l&#8217;agent d&#8217;apprentissage souhaite le vecteur (cf. fig. 2).
</p>
<p>j Apprentissage : Cet agent g&#232;re l&#8217;apprentissage des vecteurs conceptuels. Il est directe-
ment aid&#233; dans cette t&#226;che par des agents d&#8217;analyse s&#233;mantique ainsi que par les agents
extracteurs de d&#233;finitions.
</p>
<p>4certains agents peuvent &#234;tre ind&#233;pendants de la langue, c&#8217;est le cas, par exemple, d&#8217;agents dont les donn&#233;es ne
sont que des vecteurs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Soci&#233;t&#233; d&#8217;agents apprenants et s&#233;mantique lexicale
</p>
<p>j Agents extracteurs de d&#233;finitions : ces agents ont pour r&#244;le de r&#233;cup&#233;rer les d&#233;finitions
correspondant &#224; des items et de les fournir &#224; l&#8217;agent d&#8217;apprentissage.
</p>
<p>j Agents relations s&#233;mantiques : ces agents sont des experts des relations s&#233;mantiques
comme la synonymie, l&#8217;antonymie, l&#8217;hyp&#233;ronymie ou toute autres fonctions lexicales.
</p>
<p>Ces agents sont accessibles en ligne &#224; l&#8217;adresse http://www.lirmm.fr/&#732;schwab
</p>
<p>1 6
</p>
<p>3 5
</p>
<p>4
2
</p>
<p>agent
d&#8217;analyse
</p>
<p>s&#233;mantique
</p>
<p>Vecteur conceptuel
</p>
<p>Apprentissage
</p>
<p>texte
</p>
<p>arbre
Vecteur
</p>
<p>contextualis&#233; de l&#8217;item
</p>
<p>contextualisateuragent d&#8217;analyse
morpho&#8722;syntaxique
</p>
<p>item
+ contexte
</p>
<p>texte
</p>
<p>Figure 2: Organisation macroscopique du syst&#232;me au cours d&#8217;une analyse s&#233;mantique.
</p>
<p>4.2 Exemple d&#8217;interaction entre agents, apprentissage du vecteur d&#8217;un
item
</p>
<p>Pour calculer le vecteur conceptuel correpondant &#224; un item et &#224; ses d&#233;finitions, l&#8217;agent d&#8217;apprentis-
sage demande &#224; un agent extracteur de d&#233;finitions de lui fournir les d&#233;finitions de cet item qu&#8217;il
a r&#233;cup&#233;r&#233;es en explorant le web ou des dictionnaires &#224; usage humain. Le texte de chaque d&#233;f-
inition est donn&#233; &#224; l&#8217;agent analyse s&#233;mantique (1) qui, &#224; partir de l&#8217;arbre morpho-syntaxique
obtenu gr&#226;ce &#224; l&#8217;agent analyseur morpho-syntaxique (2) (3), calcule le vecteur conceptuel cor-
respondant &#224; la d&#233;finition (6). L&#8217;agent contextualiseur (lui-m&#234;me aid&#233; par la base de vecteur)
et &#233;ventuellement des agents experts en relations s&#233;mantiques collaborent avec lui dans cette
t&#226;che (4) (5). L&#8217;agent apprentissage r&#233;cup&#232;re chaque vecteur des d&#233;finitions et utilise l&#8217;agent
contextualiseur pour obtenir le vecteur global de l&#8217;item. L&#8217;apprentissage donne alors &#224; la base
de vecteurs les nouveaux vecteurs calcul&#233;s.
</p>
<p>5 Conclusion et Perspectives
Dans cet article, nous avons expos&#233; les diff&#233;rentes hypoth&#232;ses que nous avons consid&#233;r&#233;es pour
construire une base lexicale de vecteurs conceptuels (g&#233;n&#233;ration automatique, analyse multi-
sources, apprentissage permanent). Ces hypoth&#232;ses ainsi que des consid&#233;rations techniques
telles que la modularit&#233; et la possibilit&#233; de distribuer sur plusieurs machines nous ont amen&#233; &#224;
adopter une architecture de type multi-agents. Nous avons aussi pr&#233;sent&#233; les caract&#233;ristiques
conceptuelles fondamentales de nos agents : une vision r&#233;cursive des agents, l&#8217;unicit&#233; des
agents, la mani&#232;re dont les agents partagent leur expertises et le principe le plus important, celui
de la double boucle. Les agents utilisent les donn&#233;es du syst&#232;me (les vecteurs) pour am&#233;liorer
leur base de connaissance et agissent sur cette base pour am&#233;liorer sa coh&#233;rence. Nous avons
finalement pr&#233;sent&#233; certains agents qui ont &#233;t&#233; impl&#233;ment&#233;s et sont accessibles en ligne. Dans
la suite de nos travaux, nous allons continuer &#224; travailler sur chaque agent pris individuellement
afin d&#8217;am&#233;liorer leur t&#226;che respectives. Nous allons aussi essayer d&#8217;am&#233;liorer leur mode de
communication en analysant les moyens techniques qui permettraient aux agents de seconder
un autre agent sans que celui-ci ait &#224; demander de l&#8217;aide.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Didier Schwab
</p>
<p>Ces travaux n&#8217;auraient pu exister sans l&#8217;aide pr&#233;cieuse de Mathieu Lafourcade et Violaine
Prince.
</p>
<p>R&#233;f&#233;rences
Chauch&#233; J., Un outil multidimensionnel de l&#8217;analyse du discours., Proc of COLING&#8217;84 (2-6 July 1984
Stanford University, California), pp 11-15,1984.
Chauch&#233; J., D&#233;termination s&#233;mantique en analyse structurelle : une exp&#233;rience bas&#233;e sur une d&#233;finition
de distance. TAL Information, 31/1, pp 17-24, 1990.
Deerwester S. et Dumais D., Landauer T., Furnas G., Harshman R., Indexing by latent semantic analysis.
In Journal of the American Society of Information science, 1990, 416(6), pp 391-407.
Erman L., Hayes-Roth F., Lesser V. et Reddy D. The HEARSAY-II Speech Understanding System : Inte-
gration Knowledge to Resolve Uncertainly. ACM Computing Surveys, 12, 1980.
Lafourcade M. Algorithmes &quot;fourmis&quot; et TALN. http://www.lirmm.fr/&#732;lafourca/ML-
research/directions/TALN-algo-fourmi/TALN-algo-fourmi.html
Lafourcade M. et Prince V. Synonymies et vecteurs conceptuels. Proc. of Traitement Automatique du
Langages Naturel (TALN&#8217;2001), Tours, France, Juillet 2001 pp 233-242.
Lafourcade M . Lexical sorting and lexical transfer by conceptual vectors. Proc. of the First International
Workshop on MultiMedia Annotation (Tokyo, Janvier 2001) 6 p.
Larousse. Le Petit Larousse Illustr&#233; 2001. Larousse, 2000.
Larousse. Th&#233;saurus Larousse - des id&#233;es aux mots, des mots aux id&#233;es. Larousse, ISBN 2-03-320-148-
1, 1992.
Lebarb&#233; T., Vers une plate-forme multi-agents pour l&#8217;exploration et le traitement linguistique, Proc. of
Traitement Automatique du Langages Naturel (TALN&#8217;2001) (Tours, France, Juillet 2001).
Lecerf C., Une le&#231;on de piano ou la double boucle de l&#8217;apprentissage cognitif., revue Travaux et Docu-
ments, n
</p>
<p>J
</p>
<p>3-1997, Universit&#233; Paris 8, Vincennes Saint-denis, Mars 1997.
Lehmann A. et Martin-Berthet F. Introduction &#224; la lexicologie. S&#233;mantique et morphologie, Paris, Dunod
(Lettres Sup), 1998.
Mel&#8217;c&#780;uk I., Clas A.et Polgu&#232;re A. Introduction &#224; la lexicologie explicative et combinatoire. , &#233;ditions
Duculot, 1995.
Morin, E. Extraction de liens s&#233;mantiques entre termes &#224; partir de corpus techniques. Th&#232;se de doctorat
de l&#8217;Universit&#233; de Nantes, 1999.
Men&#233;zo J., Genthial D. ET Courtin J., Reconnaissances pluri-lexicales dans CELINE, un syst&#232;me multi-
agents de detection et correction des erreur, NLP+IA 96, Moncton-Canada, pp 174-180.
Ferber J. Les syst&#232;mes multi-agents. Vers une intelligence collective. InterEditions, 1995. ISBN 2-7296-
0665-3.
St&#233;fanini M-H, Berrendonner A., Lallich G., Oquendo F. TALISMAN : un syst&#232;me multi-agents gouvern&#233;
par des lois linguistiques pour le traitement de la langue naturelle Coling 92, Nantes, 22-29 Juillet 1992.
</p>
<p>Le Nouveau Petit Robert, dictionnaire alphab&#233;tique et analogique de la langue fran&#231;aise. Hachette,
2000.
CARAMEL : Un syst&#232;me multi-expert pour le traitement automatique des langues. Mod&#232;les linguistiques
Tome XII Fascicule 1.
Salton G. et MacGill M.J. Introduction to modern Information Retrieval McGraw-Hill, New-York, 1983.
</p>
<p>Schwab D, Lafourcade M et Prince V. Am&#233;lioration de la repr&#233;sentation s&#233;mantique lexicale par les
vecteurs conceptuels : le r&#244;le de l&#8217;antonymie, actes de JADT 2002, Saint-Malo, Mars 2002 .
Schwab D, Lafourcade M et Prince V. Vers l&#8217;apprentissage automatique, pour et par, les vecteurs con-
ceptuels de fonctions lexicales. L&#8217;exemple de l&#8217;antonymie, actes de TALN 2002, Nancy, Juin 2002.</p>

</div></div>
</body></html>