<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse syntaxique de l&#146;'Arabe: Le syst&#232;me MASPAR</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Analyse syntaxique de l&#146;Arabe: Le syst&#232;me MASPAR 
</p>
<p>Chafik ALOULOU  
Facult&#233; des Sciences Economiques et de Gestion de Sfax 
</p>
<p>Laboratoire de recherche LARIS, B.P. 1088 
3018 - Sfax &#150; TUNISIE 
</p>
<p>T&#233;l. (216) 74 27 87 77, Fax (216) 74 27 91 39 
chafik.aloulou@fsegs.rnu.tn 
</p>
<p>Mots-clefs  
</p>
<p>Analyse syntaxique, Robustesse d&#146;analyse, HPSG, syst&#232;me multi-agent, AgentBuilder. 
</p>
<p>Syntactic Analysis, Robust analysis, HPSG, multi-agent system, AgentBuilder,.  
</p>
<p>R&#233;sum&#233;  
</p>
<p>De nombreux syst&#232;mes de Traitement Automatique des Langues (TAL) utilisent une 
architecture s&#233;quentielle bas&#233;e sur la transmission, &#224; la fin de chaque phase d&#146;analyse, des 
r&#233;sultats trouv&#233;s &#224; la phase d&#146;analyse suivante. Ces types de syst&#232;mes s&#233;quentiels posent 
plusieurs probl&#232;mes (i.e. explosion combinatoire des solutions, lourdeur d&#146;analyse, etc.). Pour 
rem&#233;dier &#224; ces probl&#232;mes, plusieurs solutions de remplacement ont vu le jour, nous pouvons 
citer par exemple, l&#146;utilisation des approches multi-agent que nous avons adopt&#233; pour faire 
l&#146;analyse syntaxique de textes Arabes, et que nous pr&#233;sentons dans cet article. 
</p>
<p>1 Introduction 
Le traitement automatique de la langue naturelle (TALN) touche plusieurs domaines, telles 
que, les applications de correction grammaticale, les applications de communication 
homme/machine, les applications de traduction automatique, etc. L&#146;automatisation de l&#146;une de 
ces applications n&#233;cessite en g&#233;n&#233;ral une &#233;tape d&#146;analyse du texte ou document source, qui se 
fait &#224; son tours par la d&#233;composition de cette analyse en sous-t&#226;ches calqu&#233;es sur les 
diff&#233;rents niveaux d&#146;analyse linguistique &#224; savoir l&#146;analyse lexicale, l&#146;analyse morphologique, 
l&#146;analyse syntaxique, l&#146;analyse s&#233;mantique et l&#146;analyse pragmatique. Cette d&#233;composition 
permet de se fixer un objectif moins ambitieux, mais il est clair, d&#146;un point de vue 
linguistique, que les t&#226;ches ne sont pas ind&#233;pendantes les unes des autres et qu&#146;&#224; chaque 
niveau, les connaissances des autres niveaux sont n&#233;cessaires (Abeill&#233;, 2000). En plus, ces 
diff&#233;rents niveaux d&#146;analyse sont coupl&#233;s, en g&#233;n&#233;ral de mani&#232;re s&#233;quentielle, ce qui suppose 
que les phases d&#146;analyse sont quasi-d&#233;pendantes.  
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chafik Aloulou 
</p>
<p> 
Les syst&#232;mes bas&#233;s sur un couplage s&#233;quentiel pr&#233;sentent des inconv&#233;nients majeurs pour 
l'analyse de la langue Arabe: absence d'interaction entre les niveaux de repr&#233;sentation, 
absence de distribution du contr&#244;le et des connaissances, syst&#232;me difficilement &#233;volutif. La 
principale cons&#233;quence &#233;tant une explosion combinatoire qui peut &#234;tre r&#233;sorb&#233;e par une 
coop&#233;ration entre les diff&#233;rentes phases d'analyse ou les diff&#233;rents modules. Cette coop&#233;ration 
doit permettre de trouver les bonnes analyses syntaxiques d'un morceau de texte tout en 
&#233;liminant rapidement les solutions parasites et par la suite aboutir &#224; une analyse robuste 
(Warren et Stefanini, 1996). 
</p>
<p>Dans cet article, nous nous int&#233;ressons principalement &#224; la phase d&#146;analyse syntaxique, qui 
constitue, &#224; notre sens, la base du traitement automatique de tout &#233;nonc&#233; &#233;crit en langage 
naturel, et nous pr&#233;sentons les limites des m&#233;thodes s&#233;quentielles, dites classiques, de 
couplage des niveaux d&#146;analyse linguistique. Nous mettons l&#146;accent sur l&#146;aspect robustesse, 
qui constitue une qualit&#233; tr&#232;s recherch&#233;e des analyseurs, &#233;tant donn&#233; que les textes bien 
form&#233;s sur le plan linguistique sont de plus en plus rares. Nous introduisons ensuite les 
syst&#232;mes multi-agents afin de pouvoir d&#233;crire notre syst&#232;me d&#146;analyse de la langue Arabe, qui 
est d&#233;j&#224; bas&#233; sur une approche multi-agent. 
</p>
<p>2 La robustesse d&#146;analyse 
Les textes libres peuvent contenir des erreurs de tout genre (i.e., des fautes d&#146;orthographe, de 
grammaire, des omissions, des mots inconnus ou ambigus par rapport au lexique de 
l&#146;analyseur). Les analyseurs robustes doivent fournir syst&#233;matiquement une analyse 
syntaxique de chaque phrase contenue dans le texte concern&#233; y compris celles qui sont mal 
formul&#233;es ou dont la structure n&#146;est pas couverte par la grammaire du syst&#232;me (Giguet, 1997), 
(Shalen, 2000). En effet, vu la versatilit&#233; des langues, il est impossible d&#146;&#233;crire une 
grammaire compl&#232;te, capable de traiter toutes les phrases imaginables dans une langue. Pour 
cette raison, une strat&#233;gie d&#146;analyse partielle est souvent adopt&#233;e : l&#146;analyseur examine autant 
que possible chaque phrase en entr&#233;e et renvoie une analyse partielle lorsqu&#146;une analyse 
compl&#232;te n&#146;est pas possible.  
</p>
<p>Plusieurs strat&#233;gies sont adopt&#233;es afin de g&#233;rer ces probl&#232;mes. Il existe des analyseurs non 
d&#233;terministes qui g&#233;n&#232;rent plusieurs analyses par phrase et utilisent ensuite des statistiques ou 
des r&#232;gles de grammaire bas&#233;es sur des heuristiques afin de s&#233;lectionner l&#146;analyse la plus 
probable parmi les r&#233;ponses. D&#146;autres analyseurs sont d&#233;terministes : ils ne rendent qu&#146;une 
seule analyse par phrase m&#234;me si plusieurs sont possibles en termes r&#233;els. Les grammaires 
sont limit&#233;es dans ces cas-l&#224; et un certain taux d&#146;erreur est accept&#233; d&#146;avance.  
</p>
<p>La vitesse de la r&#233;ponse est une autre contrainte importante pour les analyseurs car, afin d&#146;&#234;tre 
utile dans le monde r&#233;el, ils doivent retourner une r&#233;ponse tr&#232;s rapidement. 
</p>
<p>La qu&#234;te pour un analyseur syntaxique robuste, capable d&#146;analyser des textes libres en 
profondeur, a men&#233; au d&#233;veloppement de toute une gamme d&#146;analyseurs syntaxiques ces 
derni&#232;res ann&#233;es. Ces analyseurs varient en termes de strat&#233;gies (i.e., le d&#233;terminisme contre 
le non-d&#233;terminisme, l&#146;analyse partielle contre l&#146;analyse compl&#232;te ou approfondie), de base 
th&#233;orique (i.e., les analyseurs statistiques contre les analyseurs symboliques et les analyseurs 
bas&#233;s sur la grammaire syntagmatique contre ceux bas&#233;s sur la grammaire de d&#233;pendances, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique de l'arabe: Le syst&#232;me MASPAR 
</p>
<p>etc.) (Giguet, 1997). Cependant, alors que chaque analyseur a ses points forts et fonctionne 
bien pour certaines t&#226;ches, aucun d&#146;entre eux n&#146;est capable de faire une analyse compl&#232;te de 
toutes les phrases dans un corpus de texte libre. Les m&#233;thodes statistiques, quoique 
prometteuses, ne suffisent pas, &#224; elles seules, pour r&#233;gler toutes les t&#226;ches du traitement 
automatique de la langue. Les grammaires symboliques sont &#233;galement n&#233;cessaires afin 
d&#146;obtenir une repr&#233;sentation pr&#233;cise et fiable de la s&#233;mantique, ce qui est crucial pour 
beaucoup de t&#226;ches de traitement automatique des langues.  R&#233;cemment, il y a une tendance 
croissante &#224; m&#233;langer les approches diff&#233;rentes envers l&#146;analyse syntaxique afin de profiter 
des points forts des diff&#233;rents types d&#146;analyseurs. 
</p>
<p>Pour l&#146;analyse de la langue Arabe, et afin d&#146;avoir une analyse robuste, nous avons choisi 
d&#146;adopter une autre approche d&#146;analyse qui se base, d&#146;une part sur la distribution des 
traitements1 et d&#146;autre part, par l&#146;application du formalisme HPSG (Head-Driven Phrase 
Structure Grammar, ou Grammaire syntagmatique endocentrique2) qui privil&#233;gie une 
composante lexicale riche permettant de r&#233;duire au minimum le nombre de r&#232;gles syntaxiques 
et qui propose des repr&#233;sentations lexicales riches et structur&#233;es. Ceci nous permettra de 
disposer du maximum d&#146;informations sur les mots composants le texte en cours d&#146;analyse et 
par la suite de r&#233;duire au maximum le nombre d&#146;ambigu&#239;t&#233;s qui se g&#233;n&#232;rent au cours de 
l&#146;analyse. Nous pr&#233;sentons dans les paragraphes suivants une description de notre syst&#232;me 
d&#146;analyse ainsi que la m&#233;thode adopt&#233;e.   
</p>
<p>3 L&#146;approche multi-agent 
Le terme &#171; agent &#187; est tr&#232;s r&#233;pandu en informatique et il est utilis&#233; dans plusieurs contextes. 
Plusieurs d&#233;finitions d&#146;agent existent aujourd&#146;hui. D&#146;apr&#232;s Ferber (Ferber 1995), &#147; On appelle 
agent une entit&#233; physique ou abstraite qui est capable d&#146;agir sur elle-m&#234;me et son 
environnement, qui dispose d&#146;une repr&#233;sentation partielle de cet environnement, qui, dans un 
univers multi-agent, peut communiquer avec d&#146;autres agents, et dont le comportement est la 
cons&#233;quence de ses observations, de ses connaissances et des interactions avec les autres 
agents &#148;. 
</p>
<p>Cependant, les agents peuvent &#234;tre d&#233;crits au moyen de plusieurs concepts. Les  principaux 
concepts des agents &#145;logiciels&#146; sont : l&#146;autonomie, la r&#233;activit&#233; , l&#146;orient&#233;-but (Goal-Oriented), 
la continuit&#233;, la communication, la coop&#233;ration, l&#146;anthropomorphisme, la mobilit&#233;, 
l&#146;apprentissage, l&#146;adaptabilit&#233; et l&#146;auto-d&#233;clenchement (self-starting).  
</p>
<p>En respectant ces concepts, les agents peuvent communiquer entre eux, pour r&#233;soudre des 
probl&#232;mes, et forment par cons&#233;quent un syst&#232;me multi-agent. La communication entre les 
diff&#233;rents agents peut se faire par partage d&#146;une zone de donn&#233;es communes dans laquelle les 
agents peuvent mettre et/ou trier des conclusions (tableau noir), ou aussi par envoi direct de 
messages &#224; l&#146;agent ou bien aux agents concern&#233;s. Dans ce type de communication les agents 
se connaissent les uns les autres. 
</p>
<p>                                                 
1 Plus pr&#233;cis&#233;ment, une approche d&#146;analyse multi-agent. 
2 Cette traduction de &quot;Head-driven&quot; d&#233;crit &#233;galement les structures endocentriques, &quot;headed phrase&quot; en anglais, 
</p>
<p>c'est-&#224;-dire celles qui poss&#232;dent une seule t&#234;te. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chafik Aloulou 
</p>
<p>Les domaines d&#146;application des syst&#232;mes multi-agents sont tr&#232;s vari&#233;s, tels que par exemple 
notre domaine d&#146;application qui est le traitement automatique de la langue naturelle Arabe. 
Notre choix de l&#146;approche multi-agent se justifie par nos propos de rem&#233;dier aux probl&#232;mes 
de robustesse d&#146;analyse d&#233;j&#224; pr&#233;sent&#233;s dans le paragraphe pr&#233;c&#233;dent, et aussi de r&#233;soudre 
certains probl&#232;mes rencontr&#233;s dans les syst&#232;mes classiques d&#146;analyse bas&#233;s sur des approches 
s&#233;quentielles. Parmi ces probl&#232;mes nous pouvons citer : 
</p>
<p>&#8226; le manque d&#146;interaction entre les niveaux de repr&#233;sentation, 
&#8226; le manque de distribution des connaissances et du contr&#244;le, 
&#8226; la rigidit&#233; de l&#146;architecture, 
&#8226; la lourdeur de traitement, 
&#8226; la difficult&#233; d&#146;&#233;volution du syst&#232;me  
</p>
<p>Ainsi nous avons propos&#233; dans (Aloulou 2002-A), (Aloulou 2002-B) un syst&#232;me d&#146;analyse de 
textes Arabes que nous avons baptis&#233; MASPAR (Multi-Agent System for Parsing ARabic). 
Dans ce qui suit, nous pr&#233;sentons ce syst&#232;me en exposant le r&#244;le de chaque agent qui le 
constitue. Nous pr&#233;sentons ensuite la plateforme utilis&#233;e pour le d&#233;veloppement de MASPAR 
en justifiant le choix de cette plateforme. Nous expliquons, ensuite le mod&#232;le agent de 
MASPAR et nous illustrons son fonctionnement par un exemple d&#146;ex&#233;cution. 
</p>
<p>4 Pr&#233;sentation du syst&#232;me MASPAR 
Notre syst&#232;me d&#146;analyse est compos&#233;, &#224; l&#146;&#233;tat actuel, de six agents, &#224; savoir l&#146;agent 
&#145;Segmenteur&#146;, l&#146;agent &#145;lexical&#146;, l&#146;agent &#145;morphologie&#146;, l&#146;agent &#145;syntax&#146;, l&#146;agent &#145;anaphore&#146; et 
l&#146;agent &#145;ellipse&#146; (figure 1) (Aloulou 2002-A):  
</p>
<p>&#8226; l&#146;agent &#145;Segmenteur&#146;: cet agent &#224; pour objectif de d&#233;composer le texte brut en 
paragraphes et en phrases. 
</p>
<p>&#8226; l&#146;agent &#145;Lexical&#146; : cet agent propose une multitude de d&#233;composition de mots en un 
ensemble de triades affixales (pr&#233;fixe, affixe, suffixe) et de racines (Ben Hamadou 
1993). Ensuite, il v&#233;rifie l&#146;appartenance au langage de chaque mot, obtenu &#224; partir de 
l&#146;agent &#145;Segmenteur&#146; en se basant sur les diff&#233;rentes d&#233;compositions obtenues. 
</p>
<p>&#8226; l&#146;agent &#145;Morphologie&#146; : cet agent &#224; pour objet de d&#233;terminer les caract&#233;ristiques 
morpho-syntaxiques de  chaque mot (Belguith 1999). Ainsi, par exemple, le mot 
&#145;&#1592;&#1601;&#1581;&#146;3 (a appris) aura les caract&#233;ristiques suivantes : 
</p>
<p>&#8226; Type  : Verbe 
&#8226; Personne : 3&#232;me  
&#8226; Temps : Accompli 
</p>
<p>                                                 
</p>
<p>3 Vu que nous travaillons sur l&#146;Arabe non voyell&#233;, le mot &#1592;&#1601;&#1581; peut &#234;tre interpr&#233;t&#233; de la mani&#232;re suivante : Type : 
Nom, Genre: Masculin,  Nombre: singulier,  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique de l'arabe: Le syst&#232;me MASPAR 
</p>
<p>&#8226; l&#146;agent &#145;Syntaxe&#146; : cet agent d&#233;termine si une phrase (ou une succession de mots) 
appartient ou non au langage et respecte donc les r&#232;gles de grammaire de la langue 
Arabe. Dans notre cas nous avons choisi de repr&#233;senter notre grammaire selon le 
formalisme HPSG (Head-Driven Phrase Structure Grammar) qui s'inspire de 
plusieurs th&#233;ories syntaxiques contemporaines, dont GPSG, la th&#233;orie 
gouvernement-liage et la grammaire cat&#233;gorielle. HPSG se distingue, notamment, 
par un hyper-lexicalisme qui r&#233;duit au minimum le nombre de r&#232;gles syntaxiques et 
propose des repr&#233;sentations lexicales riches et structur&#233;es. L&#146;application de HPSG 
pour la langue Arabe a n&#233;cessit&#233; une modification des sch&#233;mas standards pour 
pouvoir int&#233;grer les particularit&#233;s de la langue Arabe.  
</p>
<p>&#8226; l&#146;agent &#145;Ellipse&#146; : cet agent &#224; pour but de reconstruire les diff&#233;rents types d'ellipses. 
Il d&#233;tecte et reconstruit, suivant les cas, l'ellipse du sujet, du verbe, du compl&#233;ment 
ou de la proposition. 
</p>
<p>&#8226; l&#146;agent &#145;Anaphore&#146; : le but de cet agent est de retrouver l'ant&#233;c&#233;dent d'une forme 
anaphorique. Il &#233;tablit aussi le lien entre la forme anaphorique et son ant&#233;c&#233;dent. 
</p>
<p>Figure 1 : Architecture g&#233;n&#233;rale du syst&#232;me MASPAR 
</p>
<p> 
</p>
<p>Segmenteur Morphologie 
</p>
<p>Syntaxe 
</p>
<p>Lexical 
</p>
<p>Phrase 
Segment&#233;e 
</p>
<p>Reconnaissance 
lexicale des mots 
</p>
<p>Mots &#233;tiquet&#233;s 
</p>
<p>Message d'information 
conduisant &#224; la solution 
</p>
<p>Entr&#233;e : Document &#224; analyser 
</p>
<p>Sortie : Phrase d&#146;entr&#233;e analys&#233;e 
          - En cas de succ&#232;s de l&#146;analyse :pr&#233;sentation de la structure 
            syntaxique de la phrase. 
          - En cas d&#146;&#233;chec de l&#146;analyse : pr&#233;sentation de la structure 
            syntaxique des fragments reconnus. 
</p>
<p>Message d'information 
(Protocole d'affirmation) 
</p>
<p>Anaphore Ellipse 
</p>
<p>Recouvrement  
   des ellipses R&#233;solution des anaphores 
</p>
<p>Agent </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chafik Aloulou 
</p>
<p>Les diff&#233;rents agents de notre syst&#232;me communiquent entre eux par un &#233;change dynamique de 
messages. Ces messages varient selon le type de document et le type de la phrase donn&#233;e en 
entr&#233;e. Le premier agent qui se lance, suite &#224; la r&#233;ception d&#146;un document &#233;lectronique &#224; 
analyser, est l&#146;agent de segmentation (&#145;Segmenteur&#146;). Suite &#224; l&#146;identification de la premi&#232;re 
phrase, et suite &#224; l&#146;identification du premier mot de cette phrase, un message est envoy&#233; &#224; 
l&#146;agent &#145;Lexical&#146;. Ce dernier g&#233;n&#232;re toutes les d&#233;compositions possibles du mot en racine, 
pr&#233;fixe, infixe et suffixe. Ainsi d&#232;s que l&#146;agent &#145;Lexical&#146; g&#233;n&#232;re une d&#233;composition, il 
l&#146;envoie &#224; l&#146;agent &#145;Morphologie&#146;. Cette t&#226;che se r&#233;p&#232;te au fur et &#224; mesure qu&#146;une 
d&#233;composition est g&#233;n&#233;r&#233;e et pour chaque mot de la phrase4. 
</p>
<p>L&#146;agent &#145;Morphologie&#146; utilise ses comp&#233;tences pour d&#233;terminer les caract&#233;ristiques 
morphologiques du mot re&#231;u. Signalons qu&#146;une d&#233;composition donn&#233;e peut g&#233;n&#233;rer plus 
qu&#146;une seule liste de caract&#233;ristiques morphologiques possibles. 
</p>
<p>L&#146;agent &#145;Syntax&#146; sera lanc&#233; d&#232;s la r&#233;ception des caract&#233;ristiques morphologiques du premier 
mot. A ce moment, cet agent commence par g&#233;n&#233;rer la matrice attribut/valeur relative au mot 
obtenu, et s&#233;lectionne par la suite, la liste des r&#232;gles de la grammaire validant ce premier mot 
trouv&#233;. Cette liste de r&#232;gles, qui est d&#233;j&#224; class&#233;e par ordre d&#146;apparition des r&#232;gles dans le 
corpus, sera raffin&#233;e au fur et &#224; mesure de l&#146;&#233;volution de l&#146;analyse. L&#146;agent &#145;Syntax&#146; peut 
orienter l&#146;agent &#145;Morphologie&#146; dans le choix des caract&#233;ristiques morphologiques des mots 
suivants. Ceci se fera par envoie de messages d&#146;information pr&#233;sentant les caract&#233;ristiques 
morphologiques des mots attendus. Ainsi, les solutions parasites seront &#233;limin&#233;es dans la 
progression de l&#146;analyse. Dans le cas ou plusieurs familles de r&#232;gles sont applicables, et afin 
d'&#233;viter des retours en arri&#232;re dans l'analyse, nous appliquons un nombre de clonages de 
l'agent &#145;Syntax&#146; en fonction des r&#232;gles partiellement applicables. L'instance clon&#233;e non 
valid&#233;e au cours de l'analyse sera d&#233;truite. 
</p>
<p>Toutefois, et dans le cas de blocage de l&#146;analyse, l&#146;agent &#145;Syntax&#146; prendra l&#146;initiative de 
d&#233;bloquer la situation. Selon les caract&#233;ristiques morphologiques des mots d&#233;j&#224; trait&#233;s et 
selon le groupe de r&#232;gles de la grammaire d&#233;j&#224; s&#233;lectionn&#233;es, l&#146;agent &#145;Syntax&#146; peut, ou bien 
demander l&#146;aide de l&#146;agent Ellipse, ou celui de l&#146;agent Anaphore qui vont utiliser leurs 
comp&#233;tences pour recouvrir les structures elliptiques ou anaphoriques, ou peut m&#234;me 
demander &#224; l&#146;agent &#145;Morphologie&#146; de proposer d&#146;autres caract&#233;ristiques morphologiques qui &#224; 
son tour peut demander &#224; l&#146;agent d&#233;coupage d&#146;autres alternatives de d&#233;composition (c&#146;est le 
cas par exemple de groupement de mots). L&#146;analyse s&#146;ach&#232;ve par la reconnaissance d&#146;une 
structure syntaxique valide, ou bien se limite &#224; la pr&#233;sentation des fragments syntaxiques 
reconnus. 
</p>
<p>L&#146;agent de segmentation (&#145;Segmenteur&#146;), qui se base en grande partie sur les indicateurs de 
surfaces pour identifier les phrases et les paragraphes, n&#233;cessite dans certains cas de conna&#238;tre 
le type de quelques mots du texte ou m&#234;me leurs encha&#238;nements. Ceci n&#233;cessite d&#146;anticiper 
dans l&#146;analyse et de d&#233;clencher le ph&#233;nom&#232;ne d&#146;analyse pour agir localement sur une partie 
du texte. Cette liste d&#146;alternatives ou de mod&#232;les de communication entre les diff&#233;rents agents 
n&#146;est pas exhaustive, et d&#146;autres cas sont envisageables selon la complexit&#233; des textes trait&#233;s 
et les ambigu&#239;t&#233;s qui  s&#146;y trouvent. 
</p>
<p>                                                 
4 Ceci concerne uniquement les mots qui vont subir une d&#233;composition, sont exclus les particules, tel que, les 
</p>
<p>pronoms personnels, etc. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique de l'arabe: Le syst&#232;me MASPAR 
</p>
<p>Cette suite de mod&#232;les de communications a d&#233;bouch&#233; sur la conception d&#233;taill&#233;e de notre 
syst&#232;me. Cette conception respecte au niveau des sp&#233;cifications, les diff&#233;rents mod&#232;les 
donn&#233;s par AUML (Agent Unified Modeling Language) qui repr&#233;sente une extension de la 
m&#233;thode UML, elle est employ&#233;e principalement pour la mod&#233;lisation des interactions multi-
agent, elle introduit principalement deux nouveaux concepts au niveau de la repr&#233;sentation 
des protocoles et au niveau de la repr&#233;sentation des interactions entre agents (Odell, 2000). 
</p>
<p>5 Pr&#233;sentation de la plateforme  
de d&#233;veloppement 
</p>
<p>Afin de choisir une plate-forme de d&#233;veloppement de notre syst&#232;me, nous avons men&#233; une 
&#233;tude comparative de quelques plates-formes disponibles. Notre &#233;tude s&#146;est port&#233;e 
principalement sur les trois plates-formes suivantes : 
</p>
<p>&#8226; Dima : D&#233;veloppement et Impl&#233;mentation de Syst&#232;mes Multi-Agents 
http://www-poleia.lip6.fr/~guessoum/dima.html 
</p>
<p>&#8226; EMAC : Environnement Multi-Agent &#224; m&#233;moire Collective  
&#8226; AgentBuilder 
</p>
<p>http://www.agentbuilder.com/ 
Le tableau ci-dessous r&#233;sume les diff&#233;rents crit&#232;res d&#146;&#233;valuation que nous avons pris en 
consid&#233;ration pour comparer les trois plates-formes, ainsi que les valeurs attribu&#233;es pour 
chacun de ces crit&#232;res. 
</p>
<p>Crit&#232;res DIMA EMAC AgentBuilder 
</p>
<p>Architecture Centralis&#233;e D&#233;centralis&#233;e D&#233;centralis&#233;e 
</p>
<p>Type d&#146;agent Hybrides R&#233;actifs Cognitifs 
</p>
<p>Comp&#233;tences R&#233;duites Etendues Tr&#232;s &#233;tendues 
</p>
<p>Langage de 
communication 
</p>
<p>Non Oui Oui 
</p>
<p>Contr&#244;le Centralis&#233; Distribu&#233; Distribu&#233; 
</p>
<p>Niveau de coop&#233;ration Coop&#233;ration faible Coop&#233;ration 
moyenne 
</p>
<p>Coop&#233;ration 
compl&#232;te 
</p>
<p>Langage de 
programmation 
</p>
<p>Java C++ Java 
</p>
<p>Syst&#232;me d&#146;exploitation Win-NT, Win95 Unix Win-NT, Win95, 
Unix 
</p>
<p> 
</p>
<p>R&#233;utilisabilit&#233; 
</p>
<p>Classement et 
importation ou 
</p>
<p>modification du code 
source 
</p>
<p>Par modification du 
code source 
</p>
<p>Par copie 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chafik Aloulou 
</p>
<p>Suite &#224; cette &#233;tude comparative, nous avons remarqu&#233; que la plate-forme &#224; agent hybride 
pr&#233;sente un cycle de conception et d&#146;impl&#233;mentation non complet, quant &#224; la plate-forme 
EMAC, elle pr&#233;sente un cycle de conception et d&#146;impl&#233;mentation acceptable alors que la 
plate-forme AgentBuilder pr&#233;sente un cycle de conception et d&#146;impl&#233;mentation relativement 
complet. Notre choix s&#146;est fix&#233; donc sur la plate-forme AgentBuider, que nous essayons de 
d&#233;crire d&#146;avantage.  
</p>
<p>AgentBuilder est une suite d&#146;outils int&#233;gr&#233;s permettant de construire des agents intelligents, 
d&#233;velopp&#233;e par Reticular Systems Inc. 
</p>
<p>L&#146;&#233;tape d&#146;analyse consiste en la sp&#233;cification en OMT (Object Modelling Technique) des 
objets du domaine et des op&#233;rations qu&#146;ils peuvent effectuer, puis en la production d&#146;une 
ontologie du domaine. Des outils graphiques sont fournis pour effectuer ces t&#226;ches.  
</p>
<p>L&#146;&#233;tape de conception avec AgentBuilder consiste en la d&#233;composition du probl&#232;me en 
fonctionnalit&#233;s que les agents doivent avoir. Puis les agents sont identifi&#233;s, leurs r&#244;les et leurs 
caract&#233;ristiques sont d&#233;finis, puis les protocoles d&#146;interactions qu&#146;ils utiliseront sont sp&#233;cifi&#233;s. 
</p>
<p>L&#146;&#233;tape de d&#233;veloppement consiste en la d&#233;finition du comportement des agents, par 
l&#146;interm&#233;diaire de leurs r&#232;gles de comportement, croyances initiales, intentions et capacit&#233;s. 
</p>
<p>La figure 2 repr&#233;sente le mod&#232;le de protocole agent de notre syst&#232;me de traitement 
automatique de la langue naturelle 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
 
</p>
<p>Figure 2 : Mod&#232;le de protocole  du syst&#232;me MASPAR 
</p>
<p>Les agents engendr&#233;s au cours de la phase pr&#233;c&#233;dente sont ex&#233;cut&#233;s par un Run-Time Agent 
Engine, qui interpr&#232;te le code des agents. Un outil de d&#233;boguage est &#233;galement fourni, 
permettant le suivi des &#233;tats mentaux des agents et de leurs interactions. A cause du mod&#232;le 
purement BDI choisi, seuls des syst&#232;mes multi-agents compos&#233;s d&#146;un petit nombre d&#146;agents 
intelligents sont envisageables. La complexit&#233; du d&#233;ploiement est r&#233;duite par la nature 
conviviale des outils de d&#233;ploiement. 
</p>
<p>D&#233;tection fin
phrase
</p>
<p>Analyse
morphologique
</p>
<p>Demande 
caract&#233;ristiques 
morphologiques
</p>
<p>V&#233;rification
</p>
<p>Mot 
d&#233;compos&#233;
</p>
<p>Mot raffin&#233;
</p>
<p>Demande 
d&#233;composition
</p>
<p>Envoi 
d&#233;composition
</p>
<p>Raffinement 
reconnaissance
</p>
<p>Envoi mot 
raffin&#233;
</p>
<p>Initial
</p>
<p>Mot re&#231;u
Envoi 
mot
</p>
<p>Demande mot 
suivant
</p>
<p>Fin 
reconnaissance
</p>
<p>Identifier 
structure
</p>
<p>Fin phrase
</p>
<p>Est-ce 
que fin 
phrase ?</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Analyse syntaxique de l'arabe: Le syst&#232;me MASPAR 
</p>
<p>L&#146;ex&#233;cution de notre syst&#232;me par AgentBuider nous donne un ensemble de fen&#234;tres dont 
chacune repr&#233;sente un agent. Comme &#231;a nous pouvons suivre l&#146;&#233;tat d&#146;&#233;volution de l&#146;analyse. 
Nous donnons &#224; titre d&#146;exemple dans la figure suivante (figure 3), l&#146;&#233;tat  initial et l&#146;&#233;tat final 
de l&#146;analyse de la phrase suivante : 
</p>
<p>  .&#1606;&#1591;&#1608;&#1604;&#1575; &#1609;&#1604;&#1573; &#1585;&#1580;&#1575;&#1607;&#1605;&#1604;&#1575; &#1593;&#1580;&#1585;    
 (est revenu l&#146;&#233;migrant au le patrie.)5 
</p>
<p> 
Ainsi, la premi&#232;re fen&#234;tre repr&#233;sente tous les agents de notre syst&#232;me qui sont &#224; l&#146;&#233;tat inactif, 
dans l&#146;attente de la fin de la saisie de la phrase &#224; analyser. La deuxi&#232;me fen&#234;tre repr&#233;sente 
notre syst&#232;me apr&#232;s la fin de l&#146;analyse. Nous remarquons que nous avons obtenu l&#146;arbre 
syntaxique de la phrase analys&#233;e.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
 
 
 
 
</p>
<p>Figure 3 : Exemple d&#146;ex&#233;cution du syst&#232;me MASPAR  
</p>
<p>6 Conclusion 
Dans cet article, nous avons pr&#233;sent&#233; le syst&#232;me MASPAR d&#146;analyse de textes Arabes non 
voyell&#233;s permettant de reconna&#238;tre les structures syntaxiques. Nous avons commenc&#233; par 
d&#233;finir l&#146;analyse syntaxique et son utilit&#233; dans les syst&#232;mes de TALN, ensuite nous avons 
d&#233;fini la robustesse d&#146;analyse qui est une qualit&#233; exig&#233;e au niveau de notre syst&#232;me d&#146;analyse. 
Avant de d&#233;finir l&#146;architecture de notre syst&#232;me, nous avons d&#233;crit le mod&#232;le de 
communication qui peut se d&#233;rouler lors de l&#146;analyse d&#146;un texte. Signalons que ce syst&#232;me a 
&#233;t&#233; impl&#233;ment&#233; en utilisant la plate-forme AgentBuilder. 
</p>
<p>La premi&#232;re version de ce syst&#232;me s&#146;est limit&#233;e au d&#233;veloppement de l&#146;agent &#145;Lexical&#146;, 
&#145;Morphologie&#146; et &#145;Syntax&#146;, et accepte en entr&#233;e une phrase. Les r&#233;sultats obtenus sont 
encourageants. Nous sommes actuellement en train d'impl&#233;menter une deuxi&#232;me version de 
ce syst&#232;me en int&#233;grer les agents &#145;S&#233;gmenteur&#146;, &#145;Anaphore&#146; et &#145;Ellipse&#146;. Ainsi notre syst&#232;me 
sera capable d&#146;analyser un texte &#233;lectronique compos&#233; de plusieurs phrases et paragraphes.  
</p>
<p>                                                 
5 La traduction de la phrase est faite mot &#224; mot. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Chafik Aloulou 
</p>
<p>7 R&#233;f&#233;rences 
Abeill&#233; A., Blache P., (2000) &#147;Grammaires et analyseurs syntaxiques&#148;, dans J.-M. Pierrel 
&#233;dition Ing&#233;nierie des Langues, Paris, Herm&#232;s. 
</p>
<p>Aloulou C., Belguith Hadrich L. et Ben Hamadou A. (2002-A) MASPAR: &#147;Multi-agent 
System for Parsing Arabic&#148;, IEEE international conference on systems, man and cybernetics, 
du 6 au 9 octobre 2002 &#224; Hammamet - Tunisie.  
</p>
<p>Aloulou C., Belguith Hadrich L. et Ben Hamadou A. (2002-B), &#147;Utilisation des grammaires 
HPSG pour l&#146;analyse de l&#146;Arabe&#148;, JEI&#146;2002, 2&#232;me journ&#233;e des jeunes chercheurs en 
&#233;lectronique et Informatique, 26 &#150; 28 Mars 2002, Hammamet, Tunisie. 
</p>
<p>Belguith L. (1999), &#147;Traitement des erreurs d&#146;accord de l&#146;arabe bas&#233; sur une analyse 
syntagmatique &#233;tendue pour la v&#233;rification et une analyse multicrit&#232;re pour la correction&#148;, 
Th&#232;se de doctorat en Informatique, Facult&#233; des Sciences de Tunis, F&#233;vrier 1999. 
</p>
<p>Ben Hamadou A. (1993), &#147;V&#233;rification et correction automatique par analyse affixale des 
textes &#233;crits en langage naturel : le cas de l&#146;arabe non voyell&#233;&#148;, Th&#232;se d&#146;Etat en 
Informatique, Facult&#233; des Sciences de Tunis, Mars 1993. 
</p>
<p>Delisle S., Boufaden N, Moulin B. (1998), &#147;L&#146;analyse syntaxique robuste de dialogues 
transcrits : de la parole aux actes en passant par l&#146;&#233;crit&#148;, Actes des XXII&#232;mes Journ&#233;es 
d&#146;&#201;tudes sur la Parole (JEP 98), Martigny (Suisse), 15-19 juin&#146;98, 359-362, 1998. 
</p>
<p>Ferber J.,(1995), &#147;Les syst&#232;mes multi-agents vers une intelligence collective&#148;. InterEdition, 
Paris, 1995. 
</p>
<p>Giguet E., Vergne J. (1997), &#147;Syntactic analysis of unrestricted French&#148;, Actes de la 
conf&#233;rence &#147;International Conference on Recent Advances in Natural Languages Processing&#148; 
(RANLP'97), pages 276-281, Tzigov Chark, Bulgaria, 11-13Septembre 1997. 
</p>
<p>Jacobs P. (1990), &#147;To parse or not to parse: Relation-driven text skimming&#148;, Actes de 13&#232;me 
conference COLING, Volume 2, pp 194-198, Helsinki , 1990. 
</p>
<p>Odell, J., Van Dyke Parunak, H., Bauer, B. (2000): &#147;Extending UML for Agents&#148;. Workshop 
AOIS dans la conf&#233;rence AAAI 2000. Austin, Texas, Juillet 2000. 
</p>
<p>Shaalan K., Farouk A et Rafea A. (2000), &#147;Towards An Arabic Parser For Modern Scientific 
Text&#148;, Actes de la conference &#147;International Conference on Artificial and Computational 
Intelligence for Decision, Control and Automation in Engineering and Industrial 
Applications&#148; : ACIDCA &#146;2000, pp 228 &#150; 235, Monastir, Tunisie,.Mars 2000. 
</p>
<p>Warren K., Stefanini M.H.. (1996), &#147;Mod&#233;lisation et validation de protocoles de 
communication dans l'architecture TALISMAN&#148;, Actes de la conference &#147;Natural Language 
Processing and Industrial Applications&#148; : NLP+IA'96, pp 270 &#150; 276, Moncton, Canada,.Juin 
1996. 
</p>
<p> </p>

</div></div>
</body></html>