<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un &#233;tiquetage morphologique pour une r&#233;solution des ambigu&#239;t&#233;s morphologiques en anglais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p>Un &#233;tiquetage morphologique pour une r&#233;solution des ambigu&#239;t&#233;s 
morphologiques en anglais 
</p>
<p>Ga&#235;lle BIROCHEAU (1) 
</p>
<p>(1) Centre de recherches Lucien TESNIERE &#150; Universit&#233; de Franche-Comt&#233; 
rue M&#233;gevand 25000 BESANCON FRANCE 
</p>
<p>gaelle.birocheau@univ-fcomte.fr 
Date de la th&#232;se (septembre 2003) 
</p>
<p>Mots-clefs  
Anglais, TAL, &#233;tiquetage morphologique, ambigu&#239;t&#233;s dues &#224; la morphologie, grammaires 
locales, contexte 
</p>
<p>Keywords 
English, NLP, morphological tagging, morphological ambiguities, local grammars, context. 
</p>
<p>R&#233;sum&#233;  
Cet article expose la recherche effectu&#233;e dans le cadre de mon doctorat visant &#224; &#233;laborer un 
&#233;tiquetage morphologique de l&#146;anglais et &#224; d&#233;sambigu&#239;ser automatiquement les ambigu&#239;t&#233;s 
dues &#224; la morphologie dans le cadre du projet LABELGRAM [9]. Nous montrons qu&#146;il est 
tr&#232;s pertinent et efficace de travailler conjointement sur l&#146;&#233;tiquetage et la d&#233;sambigu&#239;sation. 
Nous d&#233;crivons de mani&#232;re pr&#233;cise notre contribution au syst&#232;me qui a consist&#233; &#224; mettre en 
place la partie anglaise. Pour ce faire, nous avons &#233;tabli un dictionnaire en intention, nous 
avons &#233;valu&#233; quantitativement le ph&#233;nom&#232;ne d&#146;ambigu&#239;t&#233; morphologique et &#233;tabli la validit&#233; 
de la m&#233;thode de d&#233;sambigu&#239;sation par r&#232;gles contextuelles pour l&#146;anglais. 
</p>
<p>Abstract 
The issue of this paper is to present a morphological tagging of English dedicated to resolve 
morphological ambiguities within the LABELGRAM project. We show it is useful to work on 
both fields of NLP at the same time since they make their mutual contribution to each other. 
To establish the base of the English part of the LABELGRAM software, we completely built 
up an intention dictionary of the English language, we quantitatively brought the ambiguity to 
the fore, and we precisely described ambiguous contexts of simple words and proved the 
context based disambiguation valid for English. Finally we give a tool, useful for many NLP 
fields, even semantic processing. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ga&#235;lle BIROCHEAU  
 
</p>
<p>1 Introduction 
</p>
<p>Cet article expose la recherche effectu&#233;e dans le cadre du projet LABELGRAM [9]. Nous 
appelons ambigu&#239;t&#233; due &#224; la morphologie un mot pr&#233;sentant une graphie identique et pouvant 
potentiellement appartenir &#224; plusieurs cat&#233;gories grammaticales. Il suffit d&#146;ouvrir un 
dictionnaire pour se rendre compte que les mots sont souvent ambigus. Or, ces ambigu&#239;t&#233;s 
sont les pierres d&#146;achoppement des techniques de TAL car elles en limitent les performances, 
quel que soit le domaine d&#146;application.  
</p>
<p>L&#146;&#233;tiquetage morphologique semble efficace en ce sens qu&#146;il autorise une description du 
lexique en intention par rapport aux descriptions extensives des dictionnaires usuels. De plus, 
il apporte une contribution &#224; la phase de d&#233;sambigu&#239;sation ult&#233;rieure en effectuant certaines 
lemmatisations. Enfin, la description des ambigu&#239;t&#233;s morphologiques fournit des crit&#232;res 
formels pour la d&#233;finition des cat&#233;gories grammaticales. La d&#233;sambigu&#239;sation morphologique 
bas&#233;e sur le contexte local donne des r&#233;sultats probants tout en &#233;vitant la lourdeur d&#146;une 
analyse syntaxique compl&#232;te ou d&#146;un syst&#232;me devant g&#233;rer des connaissances 
encyclop&#233;diques. Bas&#233;e uniquement sur les cat&#233;gories grammaticales, il s&#146;av&#232;re que la 
d&#233;sambigu&#239;sation morphologique r&#233;duit l&#146;ambigu&#239;t&#233; s&#233;mantique et offre m&#234;me un cadre pour 
sa r&#233;solution ult&#233;rieure. Il est donc tr&#232;s pertinent et efficace de travailler conjointement sur 
l&#146;&#233;tiquetage et la d&#233;sambigu&#239;sation. 
</p>
<p>2 Etiquetage 
</p>
<p>Notre &#233;tude s&#146;est bas&#233;e sur les donn&#233;es de l&#146;Oxford English Dictionary &#233;lectronique [6]. Nous 
avons proc&#233;d&#233; &#224; une analyse d&#233;taill&#233;e syst&#233;matique de l&#146;OED &#233;lectronique, &#224; partir de 
laquelle nous avons &#233;tabli un mode d&#146;&#233;tiquetage automatique, original, du lexique anglais, 
compatible avec les formats de l&#146;analyseur du projet LABELGRAM. 
</p>
<p>2.1 Ambigu&#239;t&#233;s 
</p>
<p>L&#146;&#233;tude de l&#146;OED montre que les ambigu&#239;t&#233;s sont souvent plus nombreuses que ce que l&#146;on 
croit (Figure 1), et relativement mal r&#233;pertori&#233;es : les dictionnaires ne s&#146;accordent pas sur le 
nombre et la nature des ambigu&#239;t&#233;s morphologiques ce qui rend leur traitement 
particuli&#232;rement d&#233;licat.  
</p>
<p>cat&#233;gories tous non ambigus  ambigus % ambig / % ambig / % ambig / 
        total cat&#233;gorie total lexique total ambig 
</p>
<p>adjectifs 49232 45656 3576 7,26 3,56 14,94 
adverbes 7901 7205 696 8,81 0,69 2,91 
</p>
<p>conjonctions 41 25 16 39,02 0,02 0,07 
interjections 685 476 209 30,51 0,21 0,87 
</p>
<p>noms 16269 6484 9785 60,15 9,75 40,89 
pr&#233;positions 215 151 64 29,77 0,06 0,27 
</p>
<p>pronoms 150 112 38 25,33 0,04 0,16 
verbes 25914 16366 9548 36,84 9,51 39,90 
</p>
<p>TOTAL 100407 76475 23932 23,83 23,83 100,00 
</p>
<p>Figure 1 : Importance des ambigu&#239;t&#233;s par cat&#233;gorie grammaticale </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un &#233;tiquetage morphologique pour une r&#233;solution des ambigu&#239;t&#233;s morphologiques en anglais. 
</p>
<p> 
</p>
<p>2.2 M&#233;thodologie 
</p>
<p>Nous avons d&#146;abord red&#233;fini les ambigu&#239;t&#233;s en op&#233;rant des croisements de fichiers de chacune 
des cat&#233;gories grammaticales de l&#146;OED. Puis, nous les avons analys&#233;es automatiquement, et 
sans &#224; priori, en fonction de leur terminaison afin d&#146;&#233;laborer des r&#232;gles de reconnaissance. 
Notre travail se limite au traitement des mots simples. Il a permis de valider la m&#233;thode. Nous 
&#233;tudierons ensuite son adaptabilit&#233; au traitement des compos&#233;s. Cette m&#233;thode d&#233;j&#224; 
exp&#233;riment&#233;e pour le fran&#231;ais1 a donn&#233; des r&#233;sultats tr&#232;s prometteurs. Sa pertinence r&#233;side 
dans sa facult&#233; &#224; mettre &#224; jour des r&#232;gles morphologiques masqu&#233;es qui peuvent &#234;tre 
particuli&#232;rement utiles pour les apprenants &#233;trangers, et &#224; pouvoir prendre en compte (dans 
une certaine mesure) la cr&#233;ativit&#233; lexicale. 
</p>
<p>2.3 R&#233;sultats 
</p>
<p>Les r&#233;sultats de cette analyse du lexique sont &#233;loquents &#224; plusieurs niveaux : d&#146;un point de 
vue num&#233;rique, ils d&#233;crivent pr&#233;cis&#233;ment l&#146;ampleur des ambigu&#239;t&#233;s morphologiques en langue 
anglaise et permettent de mettre le doigt sur les ph&#233;nom&#232;nes linguistiques sous-jacents. Le 
mode d&#146;&#233;tiquetage offre la possibilit&#233; de mettre en &#233;vidence les caract&#233;ristiques linguistiques 
et de r&#233;soudre certaines difficult&#233;s. En effet, il permet de regrouper les variantes 
morphologiques par prise en compte de la d&#233;rivation ou des flexions ce qui accro&#238;t les 
performances des syst&#232;mes TAL (Krovetz, 2000). De plus, les orientations choisies conf&#232;rent 
une souplesse facilitant une optimisation du traitement informatique des donn&#233;es. Les 
diff&#233;rentes &#233;tapes de cette d&#233;marche, pr&#233;cis&#233;ment d&#233;crites et consign&#233;es, offrent la 
perspective d&#146;une automatisation du proc&#233;d&#233; pour le traitement d&#146;autres lexiques. 
</p>
<p>3 D&#233;sambigu&#239;sation 
</p>
<p>La d&#233;sambigu&#239;sation est une phase pr&#233;liminaire indispensable &#224; tout traitement du langage 
(Rosenthal et al., 1989). De sa r&#233;ussite d&#233;pendent les phases d&#146;analyses ult&#233;rieures. 
</p>
<p>3.1 M&#233;thodologie 
</p>
<p>Le seconde &#233;tape a consist&#233; &#224; &#233;laborer un analyseur morphologique fiable, facilement 
adaptable et modifiable et &#233;vitant les erreurs habituelles des taggers li&#233;s &#224; des dictionnaires. 
</p>
<p>3.1.1 Erreurs des autres taggers 
</p>
<p>L&#146;examen de quelques r&#233;sultats d&#146;analyse d&#146;ambigu&#239;t&#233; par diff&#233;rents syst&#232;mes, qui comptent 
pourtant parmi les syst&#232;mes performants, montre que les ambigu&#239;t&#233;s morphologiques posent 
encore beaucoup des probl&#232;mes aux analyseurs. 
</p>
<p>R&#233;sultats de l&#146;analyseur Xerox MLTT [8] (MultiLingual Theories and Technologies)  
</p>
<p>Entr&#233;e : That very old man works on computer. 2  
</p>
<p>                                                 
1  Th&#232;se de Zarah El Harouchy (1998), BESANCON. 
2  Les mots en gras symbolisent les erreurs d&#146;analyse. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ga&#235;lle BIROCHEAU  
 
</p>
<p>L&#146;analyseur analyse that comme conjonction de subordination et works comme un nom 
pluriel. 
</p>
<p>R&#233;sultats du BNC &#233;tiquet&#233; par CLAWS 
</p>
<p>Lorsque l&#146;on effectue un recherche en ligne sur le BNC, on constate que le syst&#232;me peine &#224; 
d&#233;sambigu&#239;ser certaines formes. Par exemple, 10,56% des occurrences de work ne sont pas 
&#233;tiquet&#233;es, 3,09% des occurrences de surprise, 2,61% de program&#133;Le nombre d&#146;occurrences 
se comptant souvent en centaines de milliers et parfois en millions, ces chiffres repr&#233;sentent 
un nombre important de donn&#233;es non trait&#233;es. Quant &#224; la correction des analyses, voil&#224; ce que 
nous obtenons, par exemple, pour down apr&#232;s v&#233;rification manuelle des r&#233;sultats obtenus : 
</p>
<p>Cat&#233;gories PREP ADJ ADV N,pro N V,inf V 
Nombre d&#146;analyses correctes / 
Nombre d&#146;analyses obtenues 
</p>
<p>49/50 32/50 50/50 34/50 7/50 5/7 3/42 
</p>
<p>Taux d&#146;erreurs en pourcentage 2% 36% 0% 32% 86% 28,57% 92,8% 
</p>
<p>Figure 2 : L&#146;analyse de down par l&#146;analyseur CLAWS du BNC 
</p>
<p>3.1.2 Notre m&#233;thode 
</p>
<p>Nous avons d&#146;abord d&#233;fini deux grands types de classes grammaticales : les classes majeures 
et les classes mineures. Ces concepts s&#146;entendent quantitativement. Les classes mineures sont 
ce que nous appelons aussi parfois les mots outils ou grammaticaux. Les classes majeures 
sont au nombre de 4 : les adjectifs, les adverbes, les noms et les verbes. Pour chacune des 
classes, nous avons d&#233;fini des sous-ensembles ambigus et non ambigus. 
</p>
<p> Total 
formes 
</p>
<p>non  
forme
</p>
<p>s %  formes
   ambig. ambig. ambig. 
</p>
<p>Simples     
ADJ 49232 45656 3576 7,26 
ADV 7901 7205 696 8,81 
</p>
<p>N 16269 6484 9785 60,15 
V 25914 16366 9548 36,84 
</p>
<p>TOTAL 99316 75711 23605 23,77 
Triples     
</p>
<p>N/V/ADJ 973 891 82 8,43 
N/V/ADV 156 74 82 52,56 
N/ADJ/AD
</p>
<p>V 109 27 82 75,23 
V/ADJ/AD
</p>
<p>V 117 35 82 70,09 
TOTAL 1355 1027 328 24,21 
</p>
<p> 
</p>
<p> Total 
formes 
</p>
<p>non  formes 
%  
</p>
<p>formes 
   ambig. ambig. ambig.
</p>
<p>Quadruple     
N/V/ADJ/ADV 82 82 0 0,00 
</p>
<p>TOTAL 82 82 0 0,00 
Doubles     
</p>
<p>N/V 8293 7246 1047 12,63 
N/ADJ 2097 1097 1000 47,69 
N/ADV 245 62 183 74,69 
V/ADJ 2102 1094 1008 47,95 
V/ADV 272 81 191 70,22 
</p>
<p>ADJ/ADV 479 335 144 30,06 
TOTAL 13488 9915 3573 26,49 
</p>
<p>Figure 3: Les ambigu&#239;t&#233;s dans l&#146;OED 
</p>
<p>Puis nous avons utilis&#233; essentiellement le British National Corpus [7] pour d&#233;crire 
formellement les contextes afin d&#146;&#233;tablir des r&#232;gles de d&#233;sambigu&#239;sation bas&#233;es sur le 
contexte local. Notre choix est bas&#233; sur deux faits essentiels : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un &#233;tiquetage morphologique pour une r&#233;solution des ambigu&#239;t&#233;s morphologiques en anglais. 
</p>
<p> 
</p>
<p>&#8226; Les th&#233;ories syntaxiques visant &#224; une description compl&#232;te des structures de la 
langue &#233;chouent &#224; traiter l&#146;ensemble du probl&#232;me de l&#146;ambigu&#239;t&#233; alors qu&#146;une simple 
analyse du contexte proche parvient &#224; r&#233;duire consid&#233;rablement ce probl&#232;me (Leffa, 
1998). On s&#146;abstrait ainsi de la n&#233;cessit&#233; de g&#233;rer des connaissances encyclop&#233;diques 
tant sur le plan th&#233;orique (linguistique) que pratique (informatique). 
</p>
<p>&#8226; Des &#233;tudes montrent qu&#146;en mati&#232;re de d&#233;sambigu&#239;sation, les r&#232;gles n&#233;cessaires &#224; la 
r&#233;solution d&#146;ambigu&#239;t&#233;s sont aussi efficaces qu&#146;elles soient g&#233;n&#233;r&#233;es manuellement 
ou automatiquement (Weiss, 1973). 
</p>
<p>Nous avons donc &#233;tabli les r&#232;gles de d&#233;sambigu&#239;sation bas&#233;e sur le contexte local en nous 
conformant aux crit&#232;res scientifiques de syst&#233;maticit&#233;, de rigueur et de reproductibilit&#233;. Nous 
sommes parvenue &#224; &#233;tablir des r&#232;gles valables pour une cat&#233;gorie enti&#232;re ce qui permet de 
mettre en avant le principe m&#234;me du fonctionnement de la cat&#233;gorie et de d&#233;finir ainsi, de 
mani&#232;re formelle, la cat&#233;gorie elle-m&#234;me, ce qui n&#146;est pas toujours le cas dans la linguistique 
traditionnelle. Parfois, il a cependant &#233;t&#233; n&#233;cessaire d&#146;&#233;crire des r&#232;gles pour un ensemble de 
termes tr&#232;s restreints, voire pour un mot seul, notamment pour ce qui concerne les classes 
mineures dont le fonctionnement est loin d&#146;&#234;tre normalis&#233; et donc normalisable. Notre 
proc&#233;d&#233; de d&#233;sambigu&#239;sation est uniquement bas&#233; sur les cat&#233;gories grammaticales et ne 
recourt jamais &#224; une information &#224; caract&#232;re s&#233;mantique. Mais on a montr&#233; (Wilks, 1998) 
qu&#146;il &#233;tait possible de d&#233;sambigu&#239;ser pr&#232;s de 92% du contenu des mots en utilisant 
uniquement l&#146;information fournie pour un &#233;tiqueteur grammatical. 
</p>
<p>3.2 R&#233;sultats 
</p>
<p>Notre syst&#232;me n&#146;a pas encore &#233;t&#233; impl&#233;ment&#233; mais le sera tr&#232;s prochainement. Cependant, il 
est dors et d&#233;j&#224; possible de dire que les r&#232;gles en contexte imm&#233;diat (ne prenant en 
consid&#233;ration qu&#146;un mot &#224; droite et &#224; gauche de la forme ambigu&#235;) suffisent &#224; r&#233;duire 
l&#146;ambigu&#239;t&#233; morphologique de 35 &#224; 50%. Ce taux augmente consid&#233;rablement avec les 
contextes longs. 
Un exemple de d&#233;sambigu&#239;sation du LABELGRAM anglais : 
</p>
<p>Entr&#233;e : That very old man works on computer.
</p>
<p>Analyse Morphologique : 
D&#233;but D&#233;but 
That PRO,rel/PRO,dem/DET/CONJ,sub 
very ADJ/ADV 
old ADJ/N 
man N/V 
</p>
<p>works N,plu/V,3,sing 
on PREP/ADV 
</p>
<p>computers N,plu 
. PONCT 
</p>
<p> 
</p>
<p>D&#233;sambigu&#239;sation : 
D&#233;but .+Maj D&#233;but 
That that DET 
very very ADV 
old old ADJ 
man man N 
</p>
<p>works work V 
on on PREP 
</p>
<p>computers computer N 
. . PONCT 
</p>
<p>Les &#233;tapes de la d&#233;sambigu&#239;sation : 
Les r&#232;gles appliqu&#233;es Les r&#233;sultats 
1/ PREP/ADV+Nplu+PONCT PREP+Nplu+PONCT 
2/ D&#233;but+PROrel/PROdem/DET/CONJsub D&#233;but+PROdem/DET/CONJsub 
3/ Recherche des verbes conjugu&#233;s 
</p>
<p>2 verbes possibles : man et works 
Recherche du nom 
</p>
<p>2 noms possibles avant : old et man </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Ga&#235;lle BIROCHEAU  
</p>
<p>V&#233;rification de l&#146;accord nom-verbe 
Soit old=N est le sujet de man=V *accord 
Soit man=N est le sujet de works=V accord 
</p>
<p>4/ Les compos&#233;s N+N ne sont pas pris en compte old=ADJ 
5/ ADJ/ADV+ADJ+N ADV+ADJ+N 
6/ [ADV+ADJ+N] = SN sujet 
7/ Il n&#146;y a qu&#146;un verbe conjugu&#233; that=PROdem/DET 
8/ PROdem = SN and *D&#233;but+SN+SN sujet+Vconj that=DET 
 
</p>
<p>&#8658; D&#233;but+DET+ADV+ADJ+N+V+PREP+N+PONCT 
</p>
<p>4 Conclusion 
</p>
<p>L&#146;ambigu&#239;t&#233; reste encore aujourd&#146;hui un des grands probl&#232;mes du TAL. Les progr&#232;s 
accomplis dans de nombreux domaines gagneraient &#224; voir ce probl&#232;me d&#233;finitivement r&#233;solu, 
exemple : &#147;We describe the interaction between morphology and lexical ambiguity, and how 
resolving that ambiguity will lead to further improvements in performance.&#148; (Krovetz, 2000) 
</p>
<p>Nous avons &#233;tabli la description linguistique n&#233;cessaire &#224; la mise en place de la partie 
anglaise du logiciel LABELGRAM.  
</p>
<p>&#8226; Nous avons construit un dictionnaire complet de la langue anglaise en intention. 
</p>
<p>&#8226; Nous avons analys&#233; pr&#233;cis&#233;ment le probl&#232;me de l&#146;ambigu&#239;t&#233;. 
</p>
<p>&#8226; Nous avons d&#233;crit dans le d&#233;tail les contextes susceptibles de contenir des formes 
ambigu&#235;s simples. 
</p>
<p>&#8226; Nous avons prouv&#233; que la m&#233;thode de d&#233;sambigu&#239;sation bas&#233;e sur le contexte 
pouvait s&#146;appliquer &#224; l&#146;anglais. 
</p>
<p>Nous avons constitu&#233; un outil efficace et utile pour de nombreux domaines du TAL qui 
pr&#233;sente l&#146;avantage d&#146;&#234;tre l&#233;ger, adaptable et facilement modifiable. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>[1] Krovetz R.; Croft, W. Bruce (2000), Lexical ambiguity and information retrieval : 
Viewing morphology as an inference process, Artificial Intelligence, Vol. 118, pp 277-294. 
</p>
<p>[2] Rosenthal V., Goldblum M.C. (1989), On certain grammatical prerequisites for 
agrammatic behaviour in comprehension, Journal of Neurolinguistics, Vol. 4, pp 179-211. 
[3] Leffa V. J. (1998), Textual constraints in L2 lexical disambiguation, System, Vol. 26, pp 
183-194. 
</p>
<p>[4] Weiss S. F. (1973), Learning to disambiguate, Information Storage and Retrieval, Vol. 9, 
pp 33-41.  
</p>
<p>[5] Wilks, Stevenson (1998), NLP in support of decision making: phrases and part-of-speech 
tagging in Information, Processing &amp; Management, Vol. 37, pp 769-787. 
</p>
<p>[6] Robert &amp; Collins Senior, fourth edition, 1995 
Oxford English Dictionary, version &#233;lectronique 1.1, 1994 : http://www.uhb.fr/scd/oed2.htm 
</p>
<p>[7] http://nlp01.cs.ul.ie - http://www.hcu.ox.ac.uk/BNC/what/gramtag.html </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un &#233;tiquetage morphologique pour une r&#233;solution des ambigu&#239;t&#233;s morphologiques en anglais  
</p>
<p> 
</p>
<p>[8] http://www.xrce.xerox.com/competencies/content-analysis/toolhome.en.html 
</p>
<p>[9] http://tesniere.univ-fcomte.fr/projets/labelgram/labelgram.html </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>

</div></div>
</body></html>