<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un outil de repr&#233;sentation et de d&#233;veloppement des Grammaires de Propri&#233;t&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Un outil de repr&#233;sentation et de d&#233;veloppement                            
des Grammaires de Propri&#233;t&#233;s 
</p>
<p>Marie-Laure Gu&#233;not &amp; Tristan Van Rullen 
</p>
<p>Laboratoire Parole et Langage &#8211; CNRS &#8211; Universit&#233; de Provence 
29 avenue Robert Schuman, 13621 Aix-en-Provence cedex 1 
</p>
<p>{mlg, tristan}@lpl.univ-aix.fr 
</p>
<p>Mots-clefs &#8211; Keywords 
Linguistique descriptive &#8211; Linguistique formelle &#8211; Grammaires de Propri&#233;t&#233;s (GP) &#8211; Traite-
ment Automatique des Langues Naturelles (TALN) &#8211; Syntaxe. 
</p>
<p>Descriptive linguistics &#8211; Formal linguistics &#8211; Property Grammars (PG) &#8211; Natural Language 
Processing (NLP) &#8211; Syntax. 
 
</p>
<p>R&#233;sum&#233; &#8211; Abstract 
Nous pr&#233;sentons dans cet article un outil graphique de d&#233;veloppement de grammaire, bas&#233; sur 
le formalisme des Grammaires de Propri&#233;t&#233;s. Nous y exprimons les raisons pour lesquelles 
l&#8217;association d&#8217;une repr&#233;sentation compl&#232;te et ergonomique, et d&#8217;un mod&#232;le formel flexible et 
homog&#232;ne fournit un avantage consid&#233;rable pour l&#8217;int&#233;gration des informations issues de la 
linguistique descriptive.  
</p>
<p>We present in this paper a graphical tool for grammar development, based upon the Property 
Grammars formalism. We explain the reasons why the association of a complete and ergo-
nomic representation and a neutral and homogeneous model, provides the considerable ad-
vantage of integrating information coming from descriptive linguistics.  
 
</p>
<p>1 Introduction 
La diversit&#233; croissante des besoins en TALN pousse aujourd&#8217;hui les recherches en linguistique 
informatique &#224; d&#233;velopper des mod&#232;les grammaticaux aptes &#224; traiter des productions de lan-
gue toutes h&#233;t&#233;rog&#232;nes qu&#8217;elles soient (e.g. sources orales, importants &#233;carts &#224; la norme). Or la 
linguistique descriptive a d&#8217;ores et d&#233;j&#224; propos&#233; quantit&#233; d&#8217;analyses empiriques approfondies 
de ce type d&#8217;attestations prot&#233;iformes ; cependant leurs propositions ne sont actuellement pas 
exploit&#233;es en informatique, faute d&#8217;un formalisme qui soit &#224; m&#234;me de leur proposer un com-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not &amp; Tristan van Rullen 
</p>
<p>pl&#233;tude, une homog&#233;n&#233;it&#233; et une flexibilit&#233; suffisantes pour repr&#233;senter l&#8217;int&#233;gralit&#233; de leurs 
r&#233;ponses sous une forme tout &#224; la fois ergonomique et directement impl&#233;mentable.  
</p>
<p>Nous pr&#233;sentons dans cet article un projet qui vise &#224; permettre de repr&#233;senter et d&#8217;exploiter de 
telles th&#233;ories, en utilisant le formalisme des Grammaires de Propri&#233;t&#233;s. Nous proposons &#224; 
cette fin un format de repr&#233;sentation de ces grammaires qui soit &#224; la fois g&#233;n&#233;rique par 
l&#8217;utilisation du langage XML pour l&#8217;encodage de la grammaire, et simple d&#8217;utilisation par la 
mise en place d&#8217;une interface graphique d&#233;di&#233;e &#224; la repr&#233;sentation, la cr&#233;ation et l&#8217;utilisation 
des Grammaires de Propri&#233;t&#233;s.  
</p>
<p> 
</p>
<p>2 Contraintes formelles et informatiques 
</p>
<p>2.1 Contraintes formelles 
</p>
<p>Le mod&#232;le des Grammaires de Propri&#233;t&#233;s1 (ci-apr&#232;s GP) repose sur la constatation que toute 
information linguistique, quel qu&#8217;en soit le niveau, peut &#234;tre int&#233;gralement exprim&#233;e en ter-
mes de contraintes (&#233;galement appel&#233;es propri&#233;t&#233;s). L&#8217;utilisation d&#8217;un tel formalisme offre &#224; 
notre sens un certain nombre d&#8217;avantages, et a d&#8217;importantes cons&#233;quences sur le d&#233;veloppe-
ment d&#8217;une grammaire. Plus pr&#233;cis&#233;ment, puisque l&#8217;information n&#8217;est repr&#233;sent&#233;e qu&#8217;en ter-
mes de contraintes, il est possible de concevoir une grammaire int&#233;grant des informations 
aussi pr&#233;cises que celles fournies par les th&#233;ories descriptivistes.  
</p>
<p>2.2 Contraintes informatiques 
</p>
<p>Du point de vue informatique, int&#233;grer une grammaire &#224; un syst&#232;me de TALN n&#233;cessite la v&#233;ri-
fication de plusieurs contraintes, provenant autant du type de probl&#232;me &#224; traiter que des futurs 
utilisateurs du syst&#232;me. Tout d&#8217;abord le linguiste &#8211; qui d&#233;veloppe la grammaire &#8211; et 
l&#8217;informaticien &#8211; qui l&#8217;int&#232;gre &#224; un programme de TALN &#8211; manipulent le m&#234;me formalisme ; il 
est donc n&#233;cessaire de convenir d&#8217;un mod&#232;le de repr&#233;sentation des objets de la grammaire 
r&#233;pondant simultan&#233;ment aux besoins des deux protagonistes. 
</p>
<p>Il est essentiel, de plus, pour la validit&#233; des outils ainsi que par &#233;conomie de moyens, que les 
modifications faites &#224; une grammaire soient imm&#233;diatement r&#233;percut&#233;es dans le programme 
qui s&#8217;en sert sans modification2. A cette fin la repr&#233;sentation de la grammaire doit &#234;tre parfai-
tement ind&#233;pendante de son utilisation, ce qui implique d&#8217;exclure toute proc&#233;dure ad hoc.  
Enfin, l&#8217;outil informatique est lui-m&#234;me soumis &#224; des contraintes incontournables &#224; plusieurs 
niveaux, allant du choix d&#8217;un format standardis&#233; (tel que le XML), &#224; celui de donn&#233;es et 
d&#8217;algorithmes &#233;vitant l&#8217;explosion combinatoire des traitements (graphes, bottom-up parsing, 
etc.). En cons&#233;quence de quoi les grammaires seront repr&#233;sent&#233;es en m&#233;moire sous forme de 
structures de donn&#233;es suffisamment souples pour permettre &#224; diverses applications de les ma-
nipuler et d&#8217;en obtenir rapidement les r&#233;sultats attendus.  
</p>
<p>Ces contraintes interviennent simultan&#233;ment dans les choix de repr&#233;sentation. La probl&#233;mati-
que qui les gouverne consiste &#224; conserver un regard suffisamment en recul par rapport aux 
                                                 
1  Pour une description d&#233;taill&#233;e du formalisme des GP, on peut se reporter par exemple &#224; Blache 2001. 
2  On peut se reporter &#224; ce propos &#224; Kermes et Evert 2003.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un outil de repr&#233;sentation et de d&#233;veloppement des Grammaires de Propri&#233;t&#233;s 
</p>
<p>relations qu&#8217;entretiennent mod&#232;les et th&#233;ories linguistiques, et &#224; choisir un mod&#232;le en d&#233;mon-
trant qu&#8217;il est &#224; la fois repr&#233;sentatif de la totalit&#233; des objets du formalisme, et g&#233;n&#233;rique &#8211; ca-
nonique &#8211; dans les repr&#233;sentations qu&#8217;il permet.  
</p>
<p>Partant des consid&#233;rations et de la probl&#233;matique expos&#233;es ci-dessus, le choix d&#8217;une repr&#233;sen-
tation donn&#233;e pour les GP d&#233;coule &#224; la fois des travaux d&#233;j&#224; r&#233;alis&#233;s sur ces m&#234;mes grammai-
res et des perspectives de d&#233;veloppement qu&#8217;elles offrent, tant dans le traitement de l&#8217;analyse 
syntaxique &#224; granularit&#233; variable (cf. par exemple Balfourier et al. 2002) que dans les traite-
ments particuliers de la synth&#232;se vocale &#224; l&#8217;aide de repr&#233;sentations s&#233;mantiques et prosodi-
ques au sein m&#234;me de la grammaire (cf. par exemple Blache et Hirst 2001, ou Blache 2003).  
Le format de fichier XML, qui permet &#224; la fois une lecture humaine et informatique des don-
n&#233;es de la grammaire, une correction manuelle comme un chargement ais&#233; et pr&#233;contraint 
gr&#226;ce &#224; une sp&#233;cification de r&#232;gles syntaxiques &#224; v&#233;rifier au sein m&#234;me de ce fichier (telle que 
le format DTD), est notre point de d&#233;part pour repr&#233;senter les objets de la grammaire (voir &#224; ce 
propos Simov et al. 2002 et Simov et al. 2001, par exemple).  
Le mod&#232;le informatique qui s&#8217;apparente directement aux donn&#233;es des GP est celui des gra-
phes, dans lesquels les noeuds sont associ&#233;s &#224; une structure &#171; objet s&#233;mantique &#187; permettant 
de les qualifier, et les arcs repr&#233;sentent les relations s&#233;mantiques entre ces objets.  
</p>
<p>2.3 Point de convergence de ces contraintes : l&#8217;outil Accolade  
</p>
<p>Les contraintes &#233;num&#233;r&#233;es ci-dessus nous ont conduit &#224; d&#233;velopper un outil, Accolade, r&#233;alis&#233; 
en Java, qui se positionne au coeur de la probl&#233;matique du formalisme et du traitement auto-
matique. Cet outil r&#233;alise l&#8217;interface entre le d&#233;veloppement assist&#233; de grammaires (cf. Blache 
et al. 2003), les ressources (notamment un lexique de 450 000 formes d&#233;velopp&#233; au Labora-
toire Parole et Langage) et les outils de TALN qui s&#8217;appuient dessus.  
</p>
<p>Cette application offre de fait la possibilit&#233; de compiler un graphe des GP en un analyseur su-
perficiel (shallow parser) imm&#233;diatement fonctionnel (cf. &#224; ce propos Blache et Van Rullen 
2002), et ouvre une perspective pour la r&#233;daction d&#8217;un analyseur syntaxique profond (deep 
parser). Elle met en &#233;vidence &#224; la fois les caract&#233;ristiques des ressources linguistiques (lexi-
que et grammaire) et celles des r&#233;sultats (&#233;tiquetages, analyses syntaxiques, etc.) produits par 
les outils de TALN traditionnels.  
</p>
<p> 
</p>
<p>3 D&#233;finition des objets du mod&#232;le 
Le mod&#232;le formel des GP repose sur l&#8217;utilisation de deux couples de deux objets fondamen-
taux : cat&#233;gories et traits d&#8217;une part, propri&#233;t&#233;s et op&#233;rations d&#8217;autre part. Nous allons dans 
cette partie les d&#233;finir et donner &#224; titre d&#8217;exemple un extrait de la grammaire du fran&#231;ais &#224; 
large couverture en cours de d&#233;veloppement au Laboratoire Parole et Langage, et sa repr&#233;sen-
tation dans l&#8217;interface de d&#233;veloppement Accolade.  
</p>
<p>3.1 Cat&#233;gories 
</p>
<p>Chaque cat&#233;gorie est une unit&#233; syntaxique, constituant le vocabulaire de base de la gram-
maire. Il est important de souligner qu&#8217;il n&#8217;est fait aucune diff&#233;rence explicite entre cat&#233;gories </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not &amp; Tristan van Rullen 
</p>
<p>dites &#171; lexicales &#187;3 et &#171; syntagmatiques &#187;4 ; cette distinction n&#8217;est op&#233;r&#233;e qu&#8217;en regard au lexi-
que utilis&#233; qui lui, de fait, ne contient que des unit&#233;s minimales.  
</p>
<p>Dans le logiciel Accolade (cf. figure 1), la grammaire correspond &#224; un noeud initial, qui est 
reli&#233; &#224; autant de noeuds-fils qu&#8217;elle contient de cat&#233;gories (A pour l&#8217;adjectif5 et R pour 
l&#8217;adverbe dans notre exemple). Puis chaque cat&#233;gorie a elle-m&#234;me deux fils : un noeud pour 
rassembler ses traits (A_traits dans notre exemple, correspondant aux traits de l&#8217;adjectif), un 
autre pour ses propri&#233;t&#233;s (A_props). Priorit&#233; a &#233;t&#233; donn&#233;e &#224; repr&#233;senter les informations de la 
mani&#232;re la plus proche possible de l&#8217;encodage XML, de fa&#231;on d&#8217;une part &#224; permettre de visua-
liser facilement l&#8217;int&#233;gralit&#233; des informations linguistiques, d&#8217;autre part &#224; fournir un r&#233;el outil 
graphique de d&#233;veloppement de grammaire (en permettant d&#8217;&#233;diter, de modifier, de cr&#233;er en-
ti&#232;rement une grammaire via le graphe qui la repr&#233;sente).  
</p>
<p> 
Figure 1 : Extrait de repr&#233;sentation graphique dans Accolade. 
</p>
<p>3.2 Traits 
</p>
<p>A chaque cat&#233;gorie est attribu&#233; un ensemble de traits possibles, ordonn&#233;, dans lequel un trait 
est, tout &#224; fait usuellement, un couple attribut-valeur apportant des sp&#233;cifications caract&#233;risti-
ques. Cependant &#224; la diff&#233;rence des th&#233;ories classiques bas&#233;es sur les contraintes, ces ensem-
bles de traits sont statiques dans le sens o&#249; ils ne contiennent aucune information op&#233;ration-
nelle (qui sont int&#233;gralement rel&#233;gu&#233;es dans les propri&#233;t&#233;s). 
</p>
<p>Dans Accolade (cf. figure 1), le noeud correspondant &#224; l&#8217;ensemble des traits possibles 
(A_traits) pr&#233;sente autant de fils que d&#8217;attributs d&#233;finis pour la cat&#233;gorie (soit genre, nombre 
et nature). Chacun de ces fils a, lui-m&#234;me, autant de fils que de valeurs possibles (m et s pour 
l&#8217;attribut nombre, par exemple).  
</p>
<p>                                                 
3  Ou &#171; terminales &#187;, ou encore &#171; minimales &#187;. 
4  Ou &#171; non terminales &#187;, ou encore &#171; construites &#187;.  
5  Comme on l&#8217;a fait remarquer pr&#233;c&#233;demment, il est &#224; noter que le terme adjectif s&#8217;applique ici &#224; la fois aux 
</p>
<p>lex&#232;mes et aux syntagmes adjectivaux. Il en est de m&#234;me pour adverbe, qu&#8217;on emploie pour signifier &#224; la fois 
lex&#232;me et syntagme adverbial.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un outil de repr&#233;sentation et de d&#233;veloppement des Grammaires de Propri&#233;t&#233;s 
</p>
<p>3.3 Propri&#233;t&#233;s 
</p>
<p>Les propri&#233;t&#233;s constituent des relations entre cat&#233;gories ou ensembles de cat&#233;gories. Elles 
sont parfaitement ind&#233;pendantes les unes des autres, et d&#233;finies au m&#234;me niveau. Dans la 
grammaire que nous mettons en place actuellement, nous utilisons le jeu de propri&#233;t&#233;s sui-
vant6 : exigence (relations de cooccurrence), exclusion (restriction de cooccurrence), lin&#233;arit&#233; 
(contraintes de pr&#233;c&#233;dence lin&#233;aire) et d&#233;pendance (relations de d&#233;pendance lexico-
s&#233;mantique).  
</p>
<p>Dans Accolade (cf. figure 1), &#224; chaque type de propri&#233;t&#233; (e.g. exigence, lin&#233;arit&#233;) correspond 
un noeud, qui a comme fils autant de noeuds que la propri&#233;t&#233; contient d&#8217;op&#233;rations (on peut 
ainsi voir deux clauses de lin&#233;arit&#233; d&#233;velopp&#233;es dans la figure 1, dont le symbole est &lt;&lt;), et 
qui eux-m&#234;mes ont deux fils, un par op&#233;rande, repr&#233;sentant des r&#233;f&#233;rences &#224; des cat&#233;gories 
(comme R et A fils de &lt;&lt; dans notre exemple). On remarque que chacune de ces r&#233;f&#233;rences se 
manifeste par la pr&#233;sence d&#8217;un noeud qui est reli&#233; &#224; la fois &#224; la propri&#233;t&#233; &#224; laquelle on 
s&#8217;int&#233;resse (on voit que le noeud de r&#233;f&#233;rence R est le fils de la clause de lin&#233;arit&#233; &lt;&lt;), et &#224; la 
cat&#233;gorie correspondante (le noeud de r&#233;f&#233;rence R est reli&#233; au noeud de cat&#233;gorie R). Ceci 
fournit un confort consid&#233;rable dans la visualisation des relations entre cat&#233;gories, peu &#233;vi-
dente dans le codage XML.  
</p>
<p>3.4 Op&#233;rations 
</p>
<p>Les propri&#233;t&#233;s sont constitu&#233;es d&#8217;un ensemble de clauses, c&#8217;est-&#224;-dire d&#8217;expressions mettant 
en relation un certain nombre de r&#233;f&#233;rences &#224; des cat&#233;gories donn&#233;es &#224; l&#8217;aide d&#8217;une op&#233;ration 
d&#233;finie dans la grammaire7. On utilise &#224; cette fin des op&#233;rateurs binaires8, s&#8217;appliquant sur 
deux membres, chacun constitu&#233;s d&#8217;une r&#233;f&#233;rence &#224; une cat&#233;gorie ou d&#8217;un ensemble de r&#233;f&#233;-
rences &#224; des cat&#233;gories (rassembl&#233;es &#224; l&#8217;aide d&#8217;op&#233;rateurs proches des ET et OU logiques).  
</p>
<p>L&#8217;ordre des op&#233;randes est pertinent pour les propri&#233;t&#233;s d&#8217;exigence, d&#8217;exclusion et de lin&#233;ari-
t&#233; ; il ne l&#8217;est pas pour la d&#233;pendance. Dans le premier cas, la diff&#233;renciation entre les deux 
membres d&#8217;une clause est essentielle puisque les deux op&#233;randes ne seront pas sujets au 
m&#234;me traitement9 ; cette distinction doit donc figurer clairement dans Accolade (cf. figure 1).  
 
</p>
<p>4 Conclusion 
La repr&#233;sentation formelle des r&#233;sultats d&#8217;analyses descriptives des langues semble &#234;tre une 
perspective enrichissante dans l&#8217;objectif d&#8217;un TALN qui soit capable de traiter des entr&#233;es 
&#171; tout-venant &#187;. Cependant il est n&#233;cessaire pour repr&#233;senter ce type d&#8217;informations linguisti-
</p>
<p>                                                 
6   Dans sa forme actuelle, notre grammaire ne pr&#233;sente que des propri&#233;t&#233;s de niveau syntaxique, mais 
</p>
<p>l&#8217;int&#233;gration de propri&#233;t&#233;s d&#8217;autres niveaux, notamment s&#233;mantique, est en cours.  
7   Pour &#234;tre tout &#224; fait pr&#233;cis, la s&#233;mantique des propri&#233;t&#233;s (i.e. le mode de fonctionnement de chacun des op&#233;ra-
</p>
<p>teurs de propri&#233;t&#233;s employ&#233;s) est l&#8217;objet d&#8217;un fichier s&#233;par&#233;, comparable &#224; un DTD, ind&#233;pendant de la gram-
maire et des logiciels l&#8217;exploitant, de fa&#231;on &#224; pouvoir en modifier le contenu sans avoir &#224; modifier le reste, et 
vice versa.  
</p>
<p>8  Le fait que nous n&#8217;utilisions actuellement que des op&#233;rateurs binaires constitue une co&#239;ncidence et n&#8217;exclut 
en rien le fait qu&#8217;on puisse en d&#233;finir d&#8217;autres, non binaires, pour des propri&#233;t&#233;s diff&#233;rentes.  
</p>
<p>9  Pour plus de d&#233;tails &#224; propos des op&#233;rations des propri&#233;t&#233;s, on peut se r&#233;f&#233;rer &#224; Van Rullen 2003. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie-Laure Gu&#233;not &amp; Tristan van Rullen 
</p>
<p>ques extr&#234;mement fines de disposer d&#8217;un mod&#232;le suffisamment souple, complet et accessible 
&#8211; modifiable &#8211;. Nous proposons &#224; cette fin d&#8217;associer la flexibilit&#233; du formalisme des GP (en-
ti&#232;rement bas&#233; sur les contraintes), &#224; la g&#233;n&#233;ricit&#233; du XML (pour faciliter l&#8217;exploitation des 
donn&#233;es), et au confort de la plate-forme de d&#233;veloppement Accolade (permettant une repr&#233;-
sentation graphique int&#233;grale des informations linguistiques, et donc une visualisation des 
relations nettement facilit&#233;es).  
</p>
<p> 
</p>
<p>R&#233;f&#233;rences 
Balfourier JM., Blache P., Van Rullen T. (2002), From shallow to deep parsing using cons-
traint satisfaction, in proceedings of COLING-2002.  
Blache P. (2001), Les Grammaires de Propri&#233;t&#233;s : des contraintes pour le traitement automa-
tique des langues naturelles, Paris, Herm&#232;s Sciences Publications.  
Blache P., Hirst D. (2001), Aligning prosody and syntax in Property Grammars, in procee-
dings of EuroSpeech 2001.   
Blache P., Van Rullen T. (2002), An evaluation of different symbolic shallow parsing techni-
ques, in proceedings of LREC-02.  
Blache P., Gu&#233;not ML., Van Rullen T. (2003), Corpus-based grammar development, in pro-
ceedings of Corpus Linguistics 2003, 124-131.  
Blache P. (2003), Vers une th&#233;orie cognitive de la langue bas&#233;e sur les contraintes, in actes de 
TALN-2003 (&#224; para&#238;tre).  
Butt M., King T., Nino ME., Segond F. (1999), A Grammar Writer&#8217;s Cookbook, CSLI Publi-
cations. 
</p>
<p>Kaplan R., King T., Maxwell J. (2002), Adapting existing grammars: the XLE experience, in 
proceedings of Workshop on Grammar Engineering and Evaluation (COLING-02). 
Kermes H., Evert S. (2003), Text analysis meet corpus linguistics, in proceedings of Corpus 
Linguistics 2003, 402-411.  
Kinyon A., Prolo C. (2002), A classification of grammar development strategies, in procee-
dings of Workshop on Grammar Engineering and Evaluation (COLING-02).  
Simov K., Peev Z., Kouylekov M., Simov A., Dimitrov M., Kiryakov A. (2001), CLaRK &#8211; an 
XML-based system for corpora development, in proceedings of Corpus Linguistics 2001, 558-
560. 
</p>
<p>Simov K., Kouylekov M., Simov A. (2002), Cascaded regular grammars over XML docu-
ments, in proceedings of the 2nd Workshop on NLP and XML (NLPXML-2002). 
Van Rullen T., Gu&#233;not ML., Bellengier E. (2003), Formal representation of Property Gram-
mars, in proceedings of ESSLLI 2003 Student Session (&#224; para&#238;tre).  
 </p>

</div></div>
</body></html>