<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un &quot;langage pivot&quot; pour articuler description et formalisation : l&#8217;exemple des verbes introducteurs de &quot;que-phrases&quot;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Un &quot;langage pivot&quot; pour articuler description et formalisation : 
l'exemple des verbes introducteurs de &quot;que-phrases1&quot; 
</p>
<p>Christophe Benzitoun 
</p>
<p>Equipe Delic &#150; Universit&#233; de Provence 
29, Av. Robert Schuman, 13100 Aix-en-Provence 
</p>
<p>christophebenzitoun@yahoo.fr 
1&#232;re ann&#233;e de Doctorat 
</p>
<p>Mots-clefs &#150; Keywords 
Langage &quot;pivot&quot;, que-phrase, description, formalisation 
&quot;pivot&quot; language, Wh-sentence, description, formalization 
</p>
<p>R&#233;sum&#233; &#150; Abstract 
Nous pr&#233;sentons dans cet article une r&#233;flexion en vue de la mod&#233;lisation d'une partie du pa-
trimoine descriptif du fran&#231;ais finalement peu utilis&#233; en TALN. Pour ce faire, nous utilisons le 
concept de langage &quot;pivot&quot; qui permet d'articuler la description et la pr&#233;sentation formalis&#233;e. 
This paper presents insights to rewrite in a &quot;one level&quot; formal language a part of French 
descriptive patrimony finally not much employed in NLP. We make use the concept of 
&quot;pivot&quot; language that allows to combine the description of a language and his formalized 
presentation. 
</p>
<p>1 Introduction 
Le pr&#233;sent article pr&#233;sente un projet de recherche et a comme objectifs de montrer les 
avantages qu'apporterait un langage de traduction entre la linguistique &quot;descriptive&quot; et la 
linguistique &quot;formelle&quot; ainsi que de proposer une m&#233;thodologie apte &#224; atteindre cet objectif 
(d'o&#249; l'aspect provisoirement th&#233;orique). La linguistique descriptive d&#233;signe une discipline 
reposant sur des crit&#232;res et une m&#233;thodologie qui lui sont propres, par opposition &#224; la 
linguistique formelle d&#233;rivant d'autres disciplines telles que la logique ou les math&#233;matiques. 
La linguistique descriptive s'appuie, selon  (Dixon, 1997 : 128-131), sur une &quot;Th&#233;orie 
Linguistique de Base&quot; qui constitue &quot;the fundamental theoretical concepts that underlie all 
work in language description&#133;&quot; (Dixon, 1997 : 128), Th&#233;orie que l'on ne retrouve pas 
forc&#233;ment dans les formalismes ou de mani&#232;re fragmentaire. 
La description et la formalisation ne s'excluent pas mais se compl&#232;tent et, selon nous, elles 
doivent constituer deux &#233;tapes n&#233;cessairement distinctes car &quot;En toute rigueur th&#233;orique, il 
convient donc de distinguer la description des connaissances (notamment linguistiques), 
l&#146;expression de ces connaissances dans un formalisme, et l&#146;&#233;laboration de techniques et de 
</p>
<p>                                                 
1  Nous employons le terme de &quot;que-phrases&quot; (d&#233;sormais que-P) pour ne pas pr&#233;sumer de la nature ni de la 
</p>
<p>fonction du constituant. Le ph&#233;nom&#232;ne que nous allons &#233;tudier ici se rapproche de ce que l'on appelle tradi-
tionnellement les &quot;compl&#233;tives&quot;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christophe Benzitoun 
</p>
<p> 
</p>
<p>strat&#233;gies informatiques de traitement effectif. Dans la pratique toutefois [&#133;], les traitements 
automatiques ne mettent pas toujours en &#156;uvre ces trois types d&#146;outils&quot; (Fuchs et al., 1993 : 
12). Cette citation met en &#233;vidence un paradoxe int&#233;ressant qui se trouve au c&#156;ur du TALN, 
en tant que discipline au confluent de la description et de la formalisation. En effet, le nombre 
de descriptions linguistiques ne cesse de grandir, sans qu'il y ait vraiment de compilations 
faites par les descriptivistes ni de r&#233;cup&#233;ration syst&#233;matique des descriptions par les formalis-
tes2. Or, le recueil et le filtrage des descriptions sont des travaux qu&#146;il est important de faire 
dans un but de cumul des connaissances. Une traduction interm&#233;diaire dans un langage que 
nous qualifions de &quot;langage pivot&quot; est une premi&#232;re &#233;tape vers la formalisation des descrip-
tions. Un double b&#233;n&#233;fice r&#233;sulterait de l'&#233;laboration et de l'utilisation de ce langage : pour la 
linguistique, l'&#233;valuation sur de vastes donn&#233;es authentiques des propri&#233;t&#233;s d&#233;gag&#233;es et pour 
les formalistes, l'existence d'une base de donn&#233;es pour la constitution de grammaires formel-
les. 
Nous pr&#233;senterons bri&#232;vement (partie 2) la m&#233;thodologie propos&#233;e. Puis, nous illustrerons 
(partie 3) son utilisation par l&#146;interm&#233;diaire d&#146;une &#233;tude sur les comportements des verbes 
dominant des que-P en position objet et les incises. Cette &#233;tude concerne notamment les 
verbes de &quot;dire&quot; ainsi que croire, falloir, penser, savoir, trouver, voir, vouloir&#133; 
Nous avons choisi les que-P car cela recoupe un probl&#232;me largement pr&#233;sent dans la 
litt&#233;rature et qui a &#233;t&#233; trait&#233; &#224; l&#146;aide de cadres formels. Cela nous permettra d'effectuer une 
&#233;tude comparative. Nous montrerons que notre approche permet de tenir compte de 
distinctions empiriquement motiv&#233;es qui peuvent &#234;tre masqu&#233;es dans le formalisme utilis&#233;, 
celui-ci ne disposant pas forc&#233;ment d'outils aptes &#224; r&#233;v&#233;ler de telles propri&#233;t&#233;s. 
</p>
<p>2 M&#233;thodologie 
Notre m&#233;thodologie se propose de faire l'interface entre deux approches. En effet, le fait que 
les formalistes utilisent des formalismes de plus en plus contraignants et sophistiqu&#233;s 
n'impose-t-il pas de refaire partiellement ou enti&#232;rement une description &#224; chaque formalisme 
cr&#233;&#233; ? De leur c&#244;t&#233;, les descriptivistes se pr&#233;occupent finalement peu de la formalisation et de 
l&#146;impl&#233;mentation qui pourraient &#234;tre faites de leurs analyses et s'en tiennent le plus souvent &#224; 
une description &quot;morcel&#233;e&quot; de la langue, sans forc&#233;ment avoir une vis&#233;e d&#146;uniformit&#233;. Cet &#233;tat 
de fait vient sans doute de la nature m&#234;me de ces disciplines. Pour &#233;viter un tel paradoxe et 
garder la sp&#233;cificit&#233; de chacune des disciplines, nous proposons de formaliser les propri&#233;t&#233;s 
mises en &#233;vidence par des descriptions. Nous pouvons r&#233;sumer notre m&#233;thode globale comme 
suit (nous nous centrerons seulement sur les deux premi&#232;res &#233;tapes). 
</p>
<p>                                                 
2  Nous utilisons les raccourcis de &quot;descriptiviste&quot; pour linguiste travaillant sur la description des langues en 
</p>
<p>dehors  d'un formalisme et &quot;formaliste&quot; pour linguiste travaillant &#224; partir d'un formalisme. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un &quot;langage pivot&quot; pour articuler description et formalisation 
</p>
<p> 
</p>
<p>Recueil de
descriptions
</p>
<p>Suppression des distinctions
non formalisables
</p>
<p>Mod&#233;lisation
</p>
<p>Grammaire formelle
HPSG, TAG etc. Traitement effectif
</p>
<p>Repr&#233;sentation des r&#233;sultats
</p>
<p>linguistique
</p>
<p>informatique
math&#233;matiques
</p>
<p>mixte
</p>
<p>V&#233;rification sur corpus
</p>
<p>Traduction dans le langage &quot;pivot&quot;
</p>
<p> 
Figure 1 : Etapes successives de la description &#224; la formalisation 
</p>
<p>3 Application de la m&#233;thode 
En (3.1), nous &#233;voquons bri&#232;vement deux analyses concernant les &quot;compl&#233;tives&quot; : (Abeill&#233;, 
2002) et (Blanche-Benveniste, 1989). En (3.2) et (3.3), nous d&#233;crivons les propri&#233;t&#233;s traduites 
dans le langage pivot. 
</p>
<p>3.1 Pr&#233;sentation des analyses 
(Abeill&#233;, 2002 : 128) consid&#232;re &quot;les compl&#233;tives comme des phrases de base et les 
&quot;principales&quot; comme des ajouts&quot;, ce qu'illustre l'arbre de d&#233;rivation suivant3 (p.117) : 
</p>
<p>dort
</p>
<p>(1) Jean il-semble-que (0)
 
</p>
<p>Figure 2 : arbre de d&#233;rivation de l'&#233;nonc&#233; Il semble que Jean dort 
Une alternative &#224; cette analyse uniforme des compl&#233;tives est celle que propose notamment 
(Blanche-Benveniste, 1989) qui distingue deux fonctionnements. En effet, une s&#233;rie de tests 
r&#233;v&#232;le l'existence d'au moins deux types de verbes introducteurs de que-P : les verbes 
&quot;recteurs faibles&quot; (non constructeurs comme ceux de (Abeill&#233;, 2002)) et &quot;recteurs 
forts&quot; (constructeurs). Plus un autre fonctionnement associ&#233; aux recteurs faibles : les incises. 
Ces trois constructions sont illustr&#233;es par les exemples suivants : 
</p>
<p>1) Recteur fort : il a prouv&#233; qu&#146;il &#233;tait brave. =&gt; il l&#146;a prouv&#233;, qu'il &#233;tait brave. 
2) Recteur faible : il para&#238;t que tu es parti hier. =&gt; *il le para&#238;t, que tu es parti. 
3) Incise : &quot;je reviendrai demain&quot;, a-t-il dit. =&gt; *&quot;je reviendrai demain&quot;, l'a-t-il dit. 
</p>
<p>Certains verbes peuvent avoir les deux fonctionnements (croire), d&#146;autres ont uniquement le 
statut de recteur fort (souhaiter, prouver) ou faible (para&#238;tre). Les verbes ne pouvant &#234;tre que 
recteurs forts r&#233;gissent notamment une que-P proportionnelle &#224; un pronom clitique (ex. 1) et 
ils ne peuvent pas appara&#238;tre en incise. 
</p>
<p>4) Il a prouv&#233; qu&#146;il &#233;tait brave. =&gt; ?Il &#233;tait brave, il a prouv&#233;. 
Ceci montre bien que certains verbes peuvent construire des que-P et ne sont donc pas des 
&quot;ajouts&quot;, ce qui oblige &#224; nuancer l'analyse de (Abeill&#233;, 2002) qui pourtant &#233;num&#232;re de telles 
propri&#233;t&#233;s. 
Les recteurs faibles, quant &#224; eux, sont caract&#233;ris&#233;s par une absence de proportionnalit&#233; entre la 
que-P et un clitique. Cela induit le fait que le compl&#233;ment &quot;apparent&quot; du verbe est grammati-
</p>
<p>                                                 
3  Pour une pr&#233;sentation des arbres d&#233;riv&#233;s et de d&#233;rivation, voir (Abeill&#233;, 2002). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christophe Benzitoun 
</p>
<p> 
</p>
<p>calement &quot;informe&quot; : il n&#146;a donc pas les propri&#233;t&#233;s d&#146;un compl&#233;ment. Cette propri&#233;t&#233; se re-
trouve dans les incises qui, de plus, ont leur verbe bloqu&#233; dans la modalit&#233; assertive : 
</p>
<p>5) Il est parti, je pense. =&gt; *il est parti, je ne pense pas. =&gt; ? il est parti, je le pense. 
Dans ce cas, il est clair que le verbe n&#146;est pas recteur. Il y a donc bien au moins deux fonc-
tionnements distincts pour les verbes introducteurs de que-P. Mais si l'on entre dans les 
d&#233;tails, le probl&#232;me se r&#233;v&#232;le encore plus ardu. En effet, Blanche-Benveniste pense que les 
&quot;recteurs faibles&quot; ont de nombreuses propri&#233;t&#233;s qu'il serait tr&#232;s difficile de hi&#233;rarchiser. Ainsi, 
une &#233;tude descriptive plus pr&#233;cise serait n&#233;cessaire, ce qu'illustre la partie suivante.  
</p>
<p>3.2 D&#233;rivation des propri&#233;t&#233;s linguistiques 
Nous allons maintenant &#233;voquer le passage de la description linguistique au langage pivot. 
Une propri&#233;t&#233; importante est illustr&#233;e par le subjonctif. En effet, les verbes contraignant le 
verbe pr&#233;sent dans la que-P &#224; &#234;tre au subjonctif sont rarement recteurs faibles et n&#146;ont pas la 
possibilit&#233; d&#146;&#234;tre incise. D&#146;o&#249; la r&#232;gle : Subjonctif dans la que-P = indice de rection forte. 
Des logiciels d'&#233;tiquetage morpho-syntaxique tel Cordial 84 permettent de rep&#233;rer ce type de 
propri&#233;t&#233; li&#233; &#224; la flexion du verbe, ce qui en fait un crit&#232;re apte &#224; un traitement automatique. 
De m&#234;me, le blocage du pronom sujet sur une personne en particulier est un indice op&#233;ratoire. 
</p>
<p>6) Je crois bien qu'il va neiger. =&gt; *Tu crois bien qu'il va neiger. 
En revanche, le blocage des modalit&#233;s n'est pas une propri&#233;t&#233; facile &#224; traduire dans le langage 
pivot. En effet, une modalit&#233; particuli&#232;re n'est pas l'indice d'une rection faible. 
</p>
<p>7) Il n'emp&#234;che pas que la fen&#234;tre soit ouverte. 
8) Il n'emp&#234;che que la fen&#234;tre est ouverte. 
</p>
<p>Ce qui fait du verbe dans l'exemple (8) un recteur faible, c'est l'absence de la particule de n&#233;-
gation pas et l'absence du subjonctif dans la que-P. On remarquera aussi le sujet bloqu&#233; &#224; 
l'impersonnel. En revanche, l'absence de la modalit&#233; n&#233;gative est l'indice d'une rection forte 
dans le cas du verbe emp&#234;cher. Pour traduire le blocage des modalit&#233;s, il faut donc constituer 
des entr&#233;es r&#233;pertoriant un certain nombre de propri&#233;t&#233;s des verbes. Par exemple, deux entr&#233;es 
simplifi&#233;es se pr&#233;senteraient sous la forme : 
</p>
<p>emp&#234;cher Vnc mod. n&#233;g !pas emp&#234;cher Vc si mod. n&#233;g. alors pas 
mode = ind.    mode = subj. 
sujet = il impers.   sujet = !il impers. 
</p>
<p>On peut donc traduire cette propri&#233;t&#233; dans le langage pivot moyennant la constitution d'en-
tr&#233;es. De plus, certaines propri&#233;t&#233;s &#233;tant inhib&#233;es &#224; cause de l'interaction avec la construction 
&#224; objet de type SN, ces entr&#233;es nous permettront de donner des restrictions sur la bonne appli-
cation des propri&#233;t&#233;s. Du reste, c&#146;est la solution envisag&#233;e par la plupart des formalismes 
contemporains avec le recours aux structures de traits et &#224; la lexicalisation des grammaires. 
Une d&#233;rivation est donc facile &#224; proposer. 
</p>
<p>3.3 Mod&#233;lisation dans le langage pivot 
Une correspondance bi-univoque entre une description et un cadre formel &#233;tant difficile &#224; 
obtenir, il semble n&#233;cessaire de passer par une sorte de dictionnaire de traduction : ce 
dictionnaire est ce que nous avons appel&#233; le &quot;langage pivot&quot;. Il doit tendre vers une neutralit&#233; 
terminologique et &#234;tre apte &#224; mod&#233;liser le plus de propri&#233;t&#233;s linguistiques possibles. Dans le 
cas qui nous occupe ici, une partie du langage pivot est de la forme5 : soit des &#233;nonc&#233;s du type 
CV1-que-CV2 (que-P) ou CV2-CV1 (incise). 
</p>
<p>                                                 
4  Logiciel d&#233;velopper par la soci&#233;t&#233; Synapse D&#233;veloppement. 
5  Comme nous l'avons signal&#233; pr&#233;c&#233;demment, il serait n&#233;cessaire de faire des entr&#233;es pour chacun des verbes 
</p>
<p>concern&#233;s. Ne disposant pas de l'espace n&#233;cessaire, nous ne pouvons les reproduire ici. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Un &quot;langage pivot&quot; pour articuler description et formalisation 
</p>
<p> 
</p>
<p> 
construction propri&#233;t&#233;s 
Vc V !&gt; bien mode(V2) = s&#233;l. 
 mode(V2) = subj. aspect(V2) = s&#233;l. 
 O(V1) = que-P tps(V2) = s&#233;l. 
 V1 &gt; que-P  
Vnc V1 &gt; que-P suj(V1) = bloc. 
</p>
<p>mode(V2) != subj. tps(V1) = bloc.  
mode(V2) = indic. O(V1) = que-P 
</p>
<p> mod.(V1) = const. V &gt; bien 
Vi CV2 &gt; CV1 | CV2 &gt; CV1 &gt; CV2 !O(V1) 
 suj. &gt; V1 | V &gt; suj. tps(V1) != subj. 
 mod(V1) = assert.  
</p>
<p>Figure 3 : traduction des propri&#233;t&#233;s linguistiques dans le langage pivot 
On peut donc traiter des exemples du type : 
</p>
<p>9) Je ne regrette pas qu&#146;il soit parti avec mode(V2) = subj. ; O(V1) = que-P ; 
mod.(V1) = n&#233;g. d&#146;o&#249; regrette = Vc. 
</p>
<p>4 Conclusion et perspectives 
En confrontant deux analyses, nous avons pu mettre en &#233;vidence l'int&#233;r&#234;t d'une approche 
descriptive ind&#233;pendante pr&#233;c&#233;dant l'approche formelle. On pourrait appliquer les distinctions 
op&#233;r&#233;es dans un formalisme (en TAG, par exemple) : 
</p>
<p>N0 P1&#146;V
</p>
<p>P
</p>
<p>P1C
</p>
<p>P1&#146;V&#146;
</p>
<p>P
</p>
<p>P1Cn&#146;emp&#234;che pas
</p>
<p>que
</p>
<p>Marie
</p>
<p>cet &#233;v&#233;nement
</p>
<p>parte
</p>
<p>que
</p>
<p>Marie
</p>
<p>il n&#146;emp&#234;che
</p>
<p>partira
</p>
<p>Cl VD N
</p>
<p>N0 V N0 V
</p>
<p>a)
</p>
<p> 
n&#146;emp&#234;che pas-que
</p>
<p>parte
</p>
<p>Marie
</p>
<p>cet &#233;v&#233;nement Marie il-n&#146;emp&#234;che-que
</p>
<p>partirab)
</p>
<p> 
Figure 4 : arbres d&#233;riv&#233;s (a) et de d&#233;rivation (b) pour deux constructions du verbe emp&#234;cher-que 
</p>
<p>Dans ce contexte, les propri&#233;t&#233;s mises en &#233;vidence par une approche descriptive peuvent donc 
&#234;tre syst&#233;matis&#233;es, r&#233;fut&#233;es, reproductibles et pass&#233;es &#224; l&#146;&#233;preuve de larges corpus. Cette 
m&#233;thode serait donc un bon moyen pour l'&#233;valuation des descriptions et leur int&#233;gration dans 
des grammaires formelles. Mais c'est seulement lorsque nous aurons pris en compte plus de 
ph&#233;nom&#232;nes, &#233;tendu le langage pivot et impl&#233;ment&#233; effectivement les propri&#233;t&#233;s que nous 
pourrons conclure quant &#224; la f&#233;condit&#233; d'une telle approche. 
</p>
<p>R&#233;f&#233;rences 
Abeill&#233; A. (2002), Une grammaire &#233;lectronique du fran&#231;ais, Paris, CNRS &#233;ditions. 
Andersen H.L. (2000), Discours rapport&#233; en fran&#231;ais parl&#233;, Actes du colloque international 
Universit&#233; de Copenhague 1998, Etudes Romanes N&#176;47, pp. 143-155. 
Blanche-Benveniste Cl. (1989), Constructions verbales &quot;en incise&quot; et rection faible des ver-
bes, Recherches sur le fran&#231;ais parl&#233;, Vol. 9, pp. 53-73. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Christophe Benzitoun 
</p>
<p> 
</p>
<p>Blanche-Benveniste Cl., Deulofeu J., St&#233;fanini J., van den Eynde K. (1984), Pronom et syn-
taxe. L&#146;approche pronominale et son application &#224; la langue fran&#231;aise, Paris, SELAF. 
Boone A. (1996), Les compl&#233;tives et la modalisation, Muller (&#233;d.), pp. 45-51. 
Dixon R.M.W. (1997), The rise and Fall of languages, Cambridge University Press. 
Fuchs C., Danlos L., Lacheret-Dujour A., Luzzati D., Victorri B. (1993), Linguistique et trai-
tements automatiques des langues, Hachette Universit&#233;. 
Lebarb&#233; T. (2002), Hi&#233;rarchie Inclusive des Unit&#233;s Linguistiques en Analyse Syntaxique 
Coop&#233;rative, Th&#232;se de Doctorat, Universit&#233; de Caen. 
Vergne J. (2001), Analyse syntaxique automatique de langue : du combinatoire au calcula-
toire, Actes de TALN 2001, pp. 15-29. 
</p>
<p>Annexe 
</p>
<p>Lexique non exhaustif du langage pivot 
Vc verbe constructeur 
Vnc verbe non constructeur 
Vi verbe en incise 
</p>
<p>! non 
| ou 
O(V1) objet de V1 
</p>
<p>mod. modalit&#233; 
que-P que-phrase 
&gt; suivi de 
</p>
<p> 
</p>
<p>Liste des 10 verbes les plus fr&#233;quents ayant une que-P en position 
objet 
Ce d&#233;nombrement a &#233;t&#233; entrepris sur le corpus de fran&#231;ais parl&#233; CORPAIX6 (1.228.645 occ.) 
</p>
<p>dire 924  trouver 288
penser 839  voir 191
croire 609  vouloir 101
savoir 440  apercevoir 52
falloir 381  comprendre 51
 
 
 
 
 
</p>
<p> 
</p>
<p>                                                 
6  CORPAIX est un corpus de fran&#231;ais parl&#233; constitu&#233; par le GARS &#224; l'Universit&#233; de Provence. </p>

</div></div>
</body></html>