<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction de segments th&#233;matiques pour la construction de r&#233;sum&#233; multi-document orient&#233; par un profil utilisateur</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>5e&amp;,7$/&#3;&#21;&#19;&#19;&#22;&#15;&#3;%DW]&#16;VXU&#16;0HU&#15;&#3;&#20;&#20;&#16;&#20;&#23;&#3;MXLQ&#3;&#21;&#19;&#19;&#22;&#3;
</p>
<p>([WUDFWLRQ&#3;GH&#3;VHJPHQWV&#3;WKpPDWLTXHV&#3;SRXU&#3;OD&#3;FRQVWUXFWLRQ&#3;GH&#3;
UpVXPp&#3;PXOWL&#16;GRFXPHQW&#3;RULHQWp&#3;SDU&#3;XQ&#3;SURILO&#3;XWLOLVDWHXU&#3;
</p>
<p>&#3;
Sana-Leila Chaar 
</p>
<p> 
</p>
<p>Universit&#233; de Marne la vall&#233;e 
CEA &#8211; LIST 18, rue du Panorama 
</p>
<p>BP 6  92265 Fontenay-aux-Roses Cedex 
[sana.chaar]@cea.fr 
</p>
<p>Date de la th&#232;se : juin 2004 
 
</p>
<p> 
</p>
<p>Mots-clefs &#8211; Keywords 
 Extraction d&#8217;information, profil utilisateur, r&#233;sum&#233; multi-document 
 Information extraction, user profile, multi-document summarization 
 
</p>
<p>5pVXPp&#3;&#8211;&#3;$EVWUDFW&#3;
&#3;
Dans cet article, nous pr&#233;sentons une m&#233;thode qui vise &#224; donner &#224; un utilisateur la possibilit&#233; 
de parcourir rapidement un ensemble de documents par le biais d&#8217;un profil utilisateur. Un 
profil est un ensemble de termes structur&#233; en sous-ensembles th&#233;matiquement homog&#232;nes. 
L&#8217;analyse des documents se fonde pour sa part sur l&#8217;extraction des passages les plus 
&#233;troitement en relation avec ce profil. Cette analyse permet en particulier d&#8217;&#233;tendre le 
vocabulaire d&#233;finissant un profil en fonction du document trait&#233; en s&#233;lectionnant les termes de 
ce dernier les plus &#233;troitement li&#233;s aux termes du profil. Cette capacit&#233; ouvre ainsi la voie &#224; 
une plus grande finesse du filtrage en permettant la s&#233;lection d&#8217;extraits de documents ayant un 
lien plus t&#233;nu avec les profils mais davantage susceptibles d&#8217;apporter des informations 
nouvelles et donc int&#233;ressantes. La production du r&#233;sum&#233; r&#233;sulte de l&#8217;appariement entre les 
segments d&#233;limit&#233;s lors de l&#8217;analyse des documents et les th&#232;mes du profil. 
 
</p>
<p>In this article, we present an information extraction method that selects from a set of 
documents their most significant excerpts in relation to an user profile. This method relies on 
both structured profiles and a topical analysis of documents. The topical analysis is notably 
used for expanding a profile in relation to a particular document by selecting the terms of the 
document that are closely linked to those of the profile. This expansion is a way for selecting 
in a more reliable way excerpts that are not strongly linked to profiles but that may bring new 
and interessant information about their topics. 
</p>
<p>1 Introduction 
La veille strat&#233;gique, commerciale, scientifique et technique est une pr&#233;occupation majeure 
pour toute organisation grande ou petite. Les d&#233;cideurs sont submerg&#233;s d&#8217;information, ne </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#3; &#3; 6DQD&#16;/HLOD&#3;&amp;+$$5&#3;
 
</p>
<p>disposent pas du temps n&#233;cessaire pour compiler toutes les sources qui pourraient leur 
permettre de prendre les meilleures d&#233;cisions. L&#8217;exploitation des documents r&#233;cup&#233;r&#233;s pour 
r&#233;aliser une synth&#232;se ou un r&#233;sum&#233; automatique est devenue un th&#232;me qui occupe de plus en 
plus les chercheurs. On s&#8217;est d&#8217;abord int&#233;ress&#233; au r&#233;sum&#233; d&#8217;un document unique puis, pour les 
besoins de la veille, l&#8217;un des th&#232;mes de recherche principal est devenu le r&#233;sum&#233; multi-
document. Cette nouvelle probl&#233;matique fait l&#8217;objet de nombreux travaux, en particulier dans 
le cadre de l&#8217;&#233;valuation DUC (Document Understanding Conference) (Over, 2001). Le travail 
que nous pr&#233;sentons dans cet article rejoint donc la probl&#233;matique du r&#233;sum&#233; multi-document. 
 
</p>
<p>Actuellement les syst&#232;mes de r&#233;sum&#233;, qu&#8217;ils soient mono ou multi-document, fonctionnent 
essentiellement par extraction de passages ou de phrases. Diff&#233;rentes approches ont &#233;t&#233; 
d&#233;velopp&#233;es au sein de ce paradigme. L&#8217;une des plus r&#233;pandues consiste &#224; exploiter des 
crit&#232;res essentiellement statistiques ou probabilistes. C&#8217;est le cas notamment de la m&#233;thode 
MMR-MD (Maximal Marginal Relevance &#8211; Multi-Document) (Goldstein et al., 2000), qui 
d&#233;finit une m&#233;trique d&#8217;int&#233;r&#234;t des passages de texte, du syst&#232;me d&#233;velopp&#233; par TNO-TPD 
(Kraaij et al., 2001) qui attribue un score &#224; des segments textuels en combinant un mod&#232;le de 
langage uni-gramme et un mod&#232;le bay&#233;sien, ou encore le syst&#232;mes d&#233;crit dans (Boros et al., 
2001) qui fait appel &#224; des m&#233;thodes de classification. L&#8217;exploitation de crit&#232;res plus 
linguistiques constitue une deuxi&#232;me grande approche parmi les syst&#232;mes de r&#233;sum&#233; multi-
document. Elle est repr&#233;sent&#233;e par des travaux tels que ceux de Radev et McKeown (Raved et 
al. 1998), de Barzilay (Barzilay et al., 1999) ou encore de McKeown (McKeown et al., 2001). 
Les syst&#232;mes concern&#233;s font appel &#224; des traitements linguistiques plus ou moins &#233;labor&#233;s 
(extraction de termes, reconnaissance d&#8217;entit&#233;s nomm&#233;es, analyse syntaxique, &#8230;). Dans cette 
m&#234;me perspective, des travaux tels que (Mani, 1999) ou (White et al., 2001) utilisent des 
m&#233;thodes d&#8217;extraction d&#8217;information pour produire des r&#233;sum&#233;s multi-documents en fonction 
d&#8217;une requ&#234;te ou d&#8217;un profil utilisateur. Enfin, la probl&#233;matique du r&#233;sum&#233; multi-document 
rejoint et peut se combiner &#224; celle de la visualisation et du parcours d&#8217;un ensemble de 
documents ainsi qu&#8217;en t&#233;moigne le syst&#232;me d&#233;velopp&#233; par Rie Kubota Ando (Ando et al , 
2000). 
 
</p>
<p>Le travail que nous pr&#233;sentons dans cet article vise pour sa part &#224; donner &#224; un utilisateur la 
possibilit&#233; de parcourir rapidement un ensemble de documents selon un point de vue 
particulier, par exemple &#224; la suite d&#8217;une requ&#234;te r&#233;alis&#233;e aupr&#232;s d&#8217;un moteur de recherche. Ce 
point de vue est repr&#233;sent&#233; par le biais d&#8217;un profil. Le parcours se fonde quant &#224; lui sur 
l&#8217;extraction des passages les plus &#233;troitement en relation avec ce profil en s&#8217;appuyant sur une 
analyse th&#233;matique des documents. L&#8217;utilisation d&#8217;un profil rapproche ce travail de (Mani, 
1999) et (White et al., 2001) tandis que l&#8217;importance accord&#233;e &#224; l&#8217;analyse th&#233;matique lui fait 
entretenir de forts liens avec (Ando et al , 2000). 
</p>
<p>2 Analyse des documents &#224; r&#233;sumer 
L&#8217;analyse des documents a pour r&#244;le de mettre en &#233;vidence dans les documents &#224; r&#233;sumer : le 
vocabulaire susceptible d&#8217;&#234;tre compar&#233; au profil et les structures th&#233;matiques pouvant &#234;tre 
mises en correspondance avec les th&#232;mes constituant ce profil.  
</p>
<p> 
</p>
<p>2.1 Normalisation des documents 
</p>
<p>La premi&#232;re &#233;tape de l&#8217;analyse des document vise &#224; normaliser le vocabulaire des documents. 
Cette normalisation consiste &#224; associer &#224; chaque mot d&#8217;un document son lemme.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>([WUDFWLRQ&#3;GH&#3;VHJPHQWV&#3;WKpPDWLTXHV&#3;SRXU&#3;OH&#3;UpVXPp&#3;PXOWL&#16;GRFXPHQW&#3;&#3;
&#3;
</p>
<p>Pour cela nous utilisons les modules d&#8217;analyse morphologique et d&#8217;&#233;tiquetage morpho-
syntaxique du logiciel 63,5,7&#3;(Fluhr, 1994). A la fin du processus d&#8217;analyse et d&#8217;&#233;tiquetage, 
seuls les mots non grammaticaux susceptibles d&#8217;appara&#238;tre dans les profils sont s&#233;lectionn&#233;s, 
c&#8217;est-&#224;-dire les noms, les verbes et les adjectifs. Ce pr&#233;traitement linguistique vise donc &#224; 
normaliser le vocabulaire et &#224; faciliter ainsi la comparaison avec un profil. Malgr&#233; la pr&#233;sence 
dans les profils de termes complexes, nous ne faisons volontairement appel ni &#224; un extracteur 
terminologique g&#233;n&#233;raliste, ni &#224; un outil de reconnaissance de variantes terminologiques. En 
d&#233;pit de l&#8217;int&#233;r&#234;t de ces outils pour la mise en &#233;vidence des termes complexes des profils dans 
les documents, leur fragilit&#233; rend leur utilisation d&#233;licate dans un contexte, comme celui du 
filtrage, o&#249; chaque occurrence d&#8217;un terme peut &#234;tre importante. Nous d&#233;taillerons &#224; la 
section 4.2 la m&#233;thode que nous utilisons pour identifier dans les documents les termes 
complexes d&#8217;un profil.  
 
</p>
<p>2.2 Analyse th&#233;matique 
L&#8217;analyse th&#233;matique des documents a dans le cas pr&#233;sent pour r&#244;le de segmenter les 
documents en unit&#233;s th&#233;matiquement homog&#232;nes, t&#226;che que l&#8217;on nomme segmentation 
th&#233;matique. Les segments ainsi d&#233;limit&#233;s constituent les unit&#233;s textuelles de base qui sont 
compar&#233;es aux profils. Nous avons choisi d&#8217;utiliser le syst&#232;me 7H[W7LOLQJ de Hearst (Hearst, 
1997) en l&#8217;adaptant afin de prendre en entr&#233;e le r&#233;sultat du pr&#233;traitement des textes d&#233;crit &#224; la 
section pr&#233;c&#233;dente et d&#8217;aligner les bornes de segment sur des fronti&#232;res de phrase. Le choix de 
7H[W7LOLQJ s&#8217;appuie sur le bon rapport complexit&#233; / efficacit&#233; de son algorithme : une fen&#234;tre 
glissante est d&#233;plac&#233;e sur le texte &#224; segmenter. Pour chaque position du texte ainsi parcourue, 
on compare les deux parties de la fen&#234;tre situ&#233;es de part et d&#8217;autre de cette position &#224; l&#8217;aide 
d&#8217;une mesure de similarit&#233; s&#8217;appuyant sur les mots pr&#233;sents dans la fen&#234;tre. Les valeurs de 
cette mesure pour l&#8217;ensemble du texte permettent de situer les zones de faible coh&#233;sion 
lexicale. Celles-ci sont assimil&#233;es &#224; des ruptures th&#233;matiques et donnent lieu ainsi &#224; la 
d&#233;finition de segments th&#233;matiques. Ces segments ont une taille moyenne aux alentours d&#8217;une 
centaine de mots, cette valeur variant bien entendu en fonction des variations th&#233;matiques 
effectivement rencontr&#233;es dans les textes.  
 
</p>
<p>Nous n&#8217;avons abord&#233; dans cette partie que l&#8217;analyse th&#233;matique r&#233;alis&#233;e en dehors du contexte 
d&#8217;un profil particulier. Les op&#233;rations d&#8217;identification th&#233;matique1 que nous d&#233;crirons dans la 
section 4. permettant d&#8217;&#233;tablir qu&#8217;un segment s&#8217;apparie avec un profil ou plus globalement 
que le th&#232;me principal d&#8217;un texte s&#8217;apparie avec un profil rel&#232;vent &#233;galement de l&#8217;analyse 
th&#233;matique. Cependant, elles ne sont pas r&#233;alis&#233;es ici selon une perspective g&#233;n&#233;rique qui 
consisterait en premier lieu &#224; caract&#233;riser le th&#232;me d&#8217;un segment ou d&#8217;un texte par ses mots 
les plus caract&#233;ristiques pour ensuite comparer ceux-ci avec les mots du profil. 
</p>
<p>3 Description des profils utilisateur 
Par profil utilisateur, nous entendons une repr&#233;sentation a long terme des centres d&#8217;int&#233;r&#234;t de 
l&#8217;utilisateur, exprim&#233;s sous forme d&#8217;un ensemble de termes ou d&#8217;expressions jug&#233;s les plus 
repr&#233;sentatifs de son domaine. Ces termes peuvent &#234;tre simples ou complexes. La constitution 
d&#8217;un profil demande un investissement de la part de l&#8217;utilisateur par rapport aux requ&#234;tes 
ponctuelles qu&#8217;il a le plus souvent l&#8217;habitude de formuler pour effectuer une recherche 
d&#8217;information via un moteur de recherche. 
                                                 
</p>
<p>1
 L&#8217;identification th&#233;matique est la partie de l&#8217;analyse th&#233;matique visant &#224; d&#233;terminer le th&#232;me d&#8217;une unit&#233; textuelle. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#3; &#3; 6DQD&#16;/HLOD&#3;&amp;+$$5&#3;
 
</p>
<p> 
</p>
<p>Nous avons plus pr&#233;cis&#233;ment choisi d&#8217;adopter une structure th&#233;matique pour les profils, c&#8217;est-
&#224;-dire de regrouper les termes qui les composent en sous-ensembles th&#233;matiquement 
homog&#232;nes. Chacun de ces sous-ensembles repr&#233;sente un th&#232;me du profil renvoyant au point 
focal de ce dernier ou bien &#224; son contexte. Par exemple, le profil d&#8217;un utilisateur recherchant 
de l&#8217;information sur le probl&#232;me de l&#8217;XWLOLVDWLRQ&#3;GHV&#3;SLOHV&#3;j&#3;FRPEXVWLEOHV&#3;SRXU&#3;OD&#3;SURSXOVLRQ&#3;
DXWRPRELOH pourra &#234;tre d&#233;compos&#233; en deux sous-th&#232;mes : l&#8217;un relatif au PRQGH&#3; GH&#3;
O&#182;DXWRPRELOH et l&#8217;autre relatif aux SLOHV&#3;j&#3;FRPEXVWLEOHV. Chacun de ces sous-th&#232;mes regroupe 
un ensemble de termes significatifs. Par exemple pour le premier sous-th&#232;me nous aurons : 
SLOH&#3;j&#3;FRPEXVWLEOH&#15;&#3;SLOH&#3;j&#3;K\GURJHQH&#15;&#3;3$&amp;&#15;&#3;62)&amp;&#15;&#8230; et pour le second un autre ensemble de 
termes : PR\HQ&#3;GH&#3; WUDQVSRUW&#15;&#3; YpKLFXOH&#15;&#3; DXWR&#15;&#3; YRLWXUH, &#8230; Cette structuration r&#233;pond au souci 
d&#8217;am&#233;liorer la pr&#233;cision de l&#8217;extraction des passages pertinents en ne mettant pas sur le m&#234;me 
plan tous les termes composant un profil. Les documents les plus pertinents seront ceux dans 
lesquels le vocabulaire li&#233; au PRQGH&#3; GH&#3; O&#182;DXWRPRELOH et celui li&#233; aux SLOHV&#3; j&#3; FRPEXVWLEOHV 
seront simultan&#233;ment pr&#233;sents. Un document ne comportant que des termes li&#233;s au PRQGH&#3;GH&#3;
O&#182;DXWRPRELOH, m&#234;me s&#8217;ils sont pr&#233;sents en grand nombre, n&#8217;a ainsi que peu de chance d&#8217;&#234;tre 
int&#233;ressant. Seule la s&#233;paration au niveau du profil des termes li&#233;s respectivement &#224; chacun de 
ces deux sous-th&#232;mes permet d&#8217;&#233;carter lors du filtrage un document tr&#232;s marqu&#233; par l&#8217;un des 
deux seulement au profit d&#8217;un document qui comporte des termes du profil en moins grand 
nombre mais r&#233;partis de fa&#231;on plus &#233;quilibr&#233;e entre les deux sous-th&#232;mes qui le caract&#233;risent. 
Outre l&#8217;am&#233;lioration de la pr&#233;cision du filtrage qui en r&#233;sulte, adopter une telle structuration 
des profils se justifie par son ad&#233;quation avec la nature des demandes de recherche 
d&#8217;information &#233;manant des utilisateurs. Celles-ci sont en effet fr&#233;quemment d&#233;finies par un 
recoupement de plusieurs th&#232;mes et non par la donn&#233;e d&#8217;un seul grand th&#232;me. 
</p>
<p>4 Filtrage des documents en fonction d&#8217;un profil utilisateur 
Notre travail met l&#8217;accent sur l&#8217;utilisation conjointe de profils structur&#233;s et d&#8217;une analyse 
discursive des documents pour extraire des passages de textes en rapport avec les attentes de 
l&#8217;utilisateur. Dans le cadre du processus de filtrage, l&#8217;analyse des documents est suivie d&#8217;une 
&#233;tape d&#8217;appariement entre les segments d&#233;limit&#233;s et les sous-th&#232;mes du profil consid&#233;r&#233;, 
appariement se fondant sur la similarit&#233; de leurs vocabulaires respectifs.  
</p>
<p>&#3;
4.1 S&#233;lection des documents 
Afin de d&#233;terminer les documents pertinents nous appliquons en premier une fonction de 
similarit&#233; entre les termes normalis&#233;s des documents (cf. section 2) et les termes du profil 
utilisateur (cf. section 3). Le r&#233;sultat de cet appariement permet de d&#233;finir si un document 
pr&#233;sente ou non un int&#233;r&#234;t du point de vue du profil. Trois cas de figure peuvent appara&#238;tre : 
</p>
<p>&#8226;    le document est globalement en relation avec le profil, m&#234;me s&#8217;il peut comporter des 
parties abordant des th&#232;mes en dehors de ceux du profil ; 
</p>
<p>&#8226;  une partie seulement du document est en relation avec le profil. Ce dernier 
correspond &#224; un th&#232;me secondaire du document et n&#8217;est donc &#233;voqu&#233; que 
ponctuellement au sein de celui-ci ; 
</p>
<p>&#8226;  le document n&#8217;a pas de relation avec le profil, m&#234;me &#224; un niveau local. 
 
</p>
<p>L&#8217;&#233;tape de s&#233;lection des documents vise &#224; s&#233;parer les documents relevant des deux premiers 
cas de figure de ceux relevant du dernier. Nous consid&#233;rons par ailleurs que les documents </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>([WUDFWLRQ&#3;GH&#3;VHJPHQWV&#3;WKpPDWLTXHV&#3;SRXU&#3;OH&#3;UpVXPp&#3;PXOWL&#16;GRFXPHQW&#3;&#3;
&#3;
</p>
<p>globalement en relation avec le profil ont n&#233;cessairement une partie s&#8217;appariant avec ce profil 
(cf. section 3). Par cons&#233;quent, le crit&#232;re de s&#233;lection des documents que nous appliquons est 
li&#233; au deuxi&#232;me cas de figure : un document est s&#233;lectionn&#233; &#224; condition qu&#8217;au moins l&#8217;un de 
ses segments (issus de l&#8217;analyse th&#233;matique) s&#8217;apparie avec le profil consid&#233;r&#233;. 
 
</p>
<p>4.2 Selection des extraits de document en fonction du profil utilisateur 
Ainsi que nous l&#8217;avons indiqu&#233;, la structuration th&#233;matique des profils vise &#224; &#233;viter qu&#8217;un 
document ou une partie de document ne soit s&#233;lectionn&#233;e alors qu&#8217;elle n&#8217;aborde qu&#8217;une des 
dimensions d&#8217;un profil. Il appara&#238;t donc logique d&#8217;imposer qu&#8217;un segment de texte ne puisse 
s&#8217;apparier avec un profil que si chacun des sous-th&#232;mes constituant ce profil est repr&#233;sent&#233; 
dans le segment. Les segments &#233;tant en moyenne de petite taille, nous consid&#233;rons que la 
repr&#233;sentation d&#8217;un th&#232;me dans un segment se manifeste par la pr&#233;sence au sein de celui-ci 
d&#8217;un terme caract&#233;risant ce th&#232;me au niveau du profil. Ce crit&#232;re peut appara&#238;tre au premier 
abord un peu faible &#224; l&#8217;&#233;chelle d&#8217;un seul th&#232;me mais il est beaucoup plus significatif &#224; 
l&#8217;&#233;chelle d&#8217;un profil regroupant plusieurs th&#232;mes. Bien que les termes complexes soient en 
g&#233;n&#233;ral plus informatifs que les termes simples, nous n&#8217;imposons pas que le terme 
repr&#233;sentant un th&#232;me dans un segment soit un terme complexe. Par ailleurs, les termes 
complexes 7&amp; posent un probl&#232;me de reconnaissance que nous avons choisi de r&#233;soudre en 
adoptant un compromis moyen entre pr&#233;cision et rappel. La reconnaissance stricte d&#8217;un terme 
7&amp; du profil dans un segment ob&#233;it plus pr&#233;cis&#233;ment &#224; la s&#233;rie d&#8217;heuristiques suivantes : 
</p>
<p>&#8226;    les termes simples 76
L
</p>
<p> composant 7&amp; doivent appara&#238;tre dans le segment dans le 
m&#234;me ordre qu&#8217;au sein de 7&amp;. La reconnaissance des 76
L
</p>
<p> est directe puisqu&#8217;ils sont 
normalis&#233;s de la m&#234;me fa&#231;on dans les documents et dans le profil ; 
</p>
<p>&#8226;  soit 1&#15; nombre des 76
L
</p>
<p>. L&#8217;espace occup&#233; par une occurrence de 7&amp; dans le segment 
ne peut d&#233;passer 1,5*1 mots pleins. Ainsi nous prenons en compte d&#8217;&#233;ventuelles 
variations syntaxiques de type insertion ; 
</p>
<p>&#8226;  si 7&amp; comporte des pr&#233;positions, celles-ci doivent &#234;tre &#233;galement pr&#233;sentes au 
niveau de ses occurrences dans les documents, ceci en respectant leur position par 
rapport aux 76
L
</p>
<p>. Par ailleurs, une occurrence pr&#233;sum&#233;e de 7&amp; ne doit contenir aucun 
signe de ponctuation. 
</p>
<p> 
</p>
<p>Le terme complexe 7&amp; peut &#233;galement &#234;tre reconnu lorsque seulement un de ses sous-termes 
67 est pr&#233;sent. On parle alors de reconnaissance approch&#233;e. Trois conditions doivent &#234;tre 
remplies pour ce faire : 
</p>
<p>&#8226;  67 doit regrouper au moins 50% des termes simples de 7&amp; ; 
&#8226;  1 occurrence de 67 est reconnue si elle respecte les trois contraintes de 
</p>
<p>reconnaissance stricte d&#8217;un terme ; 
&#8226;  7&amp; doit avoir &#233;t&#233; reconnu de fa&#231;on stricte au moins une fois dans le document 
</p>
<p>auquel appartient le segment consid&#233;r&#233;. 
 
</p>
<p>Dans le cadre de l&#8217;identification d&#8217;un th&#232;me dans un segment, la reconnaissance d&#8217;un terme 
caract&#233;ristique de ce th&#232;me peut &#234;tre stricte ou bien approch&#233;e. Le fait qu&#8217;un document a &#233;t&#233; 
s&#233;lectionn&#233; renvoie &#224; deux cas de figure comme nous l&#8217;avons vu en section 4.1 : le document 
s&#8217;apparie globalement avec le profil consid&#233;r&#233; ou bien seulement une partie de ce document 
s&#8217;apparie avec ce profil. Dans le second cas, la th&#233;matique du profil n&#8217;&#233;tant &#233;voqu&#233;e que </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#3; &#3; 6DQD&#16;/HLOD&#3;&amp;+$$5&#3;
 
</p>
<p>secondairement dans le document, seul les segments  qui s&#8217;apparient avec le profil sont 
s&#233;lectionn&#233;s. Dans le premier cas au contraire, il peut &#234;tre int&#233;ressant d&#8217;&#233;largir le champ de la 
s&#233;lection &#224; des segments ne r&#233;pondant pas strictement aux crit&#232;res d&#8217;appariement avec le 
profil mais contenant des termes du document jug&#233;s li&#233;s &#224; ceux du profil. Plus pr&#233;cis&#233;ment, 
dans ce cas de figure, nous effectuons une analyse plus approfondie des documents, afin de 
s&#233;lectionner de nouveaux termes pouvant s&#8217;inscrire dans l&#8217;un des sous th&#232;me de profil.  
</p>
<p> 
</p>
<p>4.3 Profil enrichi 
Un terme nouveau est un terme pouvant s&#8217;inscrire dans l&#8217;un des sous-th&#232;me du profil. La 
liaison entre un terme nouveau et un terme du profil s&#8217;appuie sur une s&#233;rie de cooccurrences 
au sein du document. Plus pr&#233;cis&#233;ment, soit {WS
.L
</p>
<p>}, l&#8217;ensemble des termes du th&#232;me . 
appartenant au profil qui sont pr&#233;sents dans le document. On d&#233;finit l&#8217;ensemble {WG
.L
</p>
<p>} des 
termes du document tels que WG
.L
</p>
<p> cooccurre avec un terme WS
.L
</p>
<p> (pas n&#233;cessairement le m&#234;me 
d&#8217;un segment &#224; l&#8217;autre) dans un segment et ce, dans une proportion suffisamment importante 
de segments du document. Cette proportion a &#233;t&#233; fix&#233;e dans le cas pr&#233;sent &#224; 1/3. Les termes 
WG
.L
</p>
<p> constituent ce que nous avons appel&#233; ci-dessus des termes nouveaux. Ces termes 
nouveaux repr&#233;sentent une forme adaptation des profils par rapport aux documents auxquels 
ils sont confront&#233;s dans le cadre du processus de filtrage. Les profils ont tendance &#224; donner 
une description assez g&#233;n&#233;rale des th&#232;mes qu&#8217;ils recouvrent. Au sein de chaque document, on 
retrouve les termes de cette description mais on y trouve &#233;galement une caract&#233;risation 
beaucoup plus sp&#233;cifique qu&#8217;il est n&#233;cessaire de prendre en compte pour analyser finement 
l&#8217;organisation th&#233;matique du document. La mise en &#233;vidence de ces termes nouveaux pr&#233;sente 
&#224; cet &#233;gard une certaine parent&#233; avec le processus de blind relevance feedback utilis&#233; en 
recherche documentaire. Reprenons l&#8217;exemple  de&#3;&#3; '&#3;O&#182;XWLOLVDWLRQ&#3; GHV&#3; SLOHV&#3; j&#3; FRPEXVWLEOHV&#3;
SRXU&#3; OD&#3; SURSXOVLRQ&#3; DXWRPRELOH&#8220;, apr&#232;s avoir confront&#233; les documents au profil d&#233;fini par 
l&#8217;utilisateur, nous constatons  que les segments s&#233;lectionn&#233;s contiennent un ensemble de 
termes qui peuvent s&#8217;inscrire dans les sous-th&#232;mes du PRQGH&#3;GH&#3; O&#182;DXWRPRELOH et des SLOHV&#3;j&#3;
FRPEXVWLEOHV.&#3;Ces nouveaux termes sont donc propos&#233;s &#224; l&#8217;utilisateur sous forme d&#8217;un profil 
appel&#233; profil enrichi, et gr&#226;ce au processus de blind relevance feedback, nous recherchons les 
nouveaux segments pertinents qui peuvent correspondre au besoin de l&#8217;utilisateur. 
</p>
<p> 
</p>
<p>7KqPH&#3;3LOHV&#3;j&#3;FRPEXVWLEOHV&#3; 7KqPH&#3;0RQGH&#3;GH&#3;O&#182;DXWRPRELOH&#3;
Pile &#224; combustible Moyen de transport 
Pile &#224; hydrog&#232;ne V&#233;hicule 
</p>
<p>PAC Auto 
3(0)&amp;&#3;&#3; 9pKLFXOHV&#3;K\EULGHV&#3;
$)&amp;&#3; &amp;RQVWUXFWHXU&#3;DXWRPRELOH&#3;
</p>
<p>3URSXOVLRQ&#3;pOHFWULTXH&#3; 7R\RWD&#3;
</p>
<p>Figure 1 : Exemple de profil enrichi sur l&#8217;utilisation des piles &#224; combustible dans le domaine 
des transports2 (termes nouveaux en gras) 
</p>
<p>4.4 Appariement d&#8217;un profil et d&#8217;un document 
</p>
<p>Dire qu&#8217;un document s&#8217;apparie globalement avec un profil revient &#224; dire que le th&#232;me 
principal du document correspond au th&#232;me repr&#233;sent&#233; par ce profil3. Bien que le probl&#232;me de 
la formalisation de l&#8217;organisation th&#233;matique des textes ait &#233;t&#233; peu explor&#233;, les travaux sur le 
                                                 
</p>
<p>2
 La figure 1 ne donne que quelques uns des termes composant un tel profil. 
</p>
<p>3
 Le th&#232;me repr&#233;sent&#233; par un profil correspond &#224; la r&#233;union des th&#232;mes qui le composent, ce qui pr&#233;suppose une certaine 
compositionnalit&#233; des th&#232;mes. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>([WUDFWLRQ&#3;GH&#3;VHJPHQWV&#3;WKpPDWLTXHV&#3;SRXU&#3;OH&#3;UpVXPp&#3;PXOWL&#16;GRFXPHQW&#3;&#3;
&#3;
</p>
<p>r&#233;sum&#233; automatique laissent entrevoir une d&#233;finition op&#233;rationnelle de la notion de th&#232;me 
principal que l&#8217;on peut &#233;noncer comme suit : le th&#232;me principal d&#8217;un texte est le th&#232;me abord&#233; 
en d&#233;but ou/et en fin de texte et qui est l&#8217;objet d&#8217;une partie importante de celui-ci. En 
transposant cette d&#233;finition dans notre contexte, d&#233;terminer si le th&#232;me principal d&#8217;un 
document s&#8217;apparie avec un profil revient &#224; v&#233;rifier les deux conditions suivantes : 
</p>
<p>&#8226;  le profil doit s&#8217;apparier avec le premier et/ou le dernier segment du document ; 
&#8226;  plus globalement, l&#8217;ensemble des segments du document s&#8217;appariant avec le profil 
</p>
<p>doivent repr&#233;senter une part significative de l&#8217;ensemble des segments du document. 
 
</p>
<p>La premi&#232;re condition fait appel &#224; la notion d&#8217;appariement entre profil et segment d&#233;velopp&#233;e 
&#224; la section 4.2 La seconde s&#8217;appuie quant &#224; elle sur la version &#233;largie de cet appariement 
d&#233;velopp&#233;e &#224; la section 4.3 et prenant en compte les termes nouveaux, c&#8217;est-&#224;-dire des termes 
du document li&#233;s aux termes du profil. 
</p>
<p>5 Fusion des segments s&#233;lectionn&#233;s 
Les segments ainsi s&#233;lectionn&#233;s, qu&#8217;ils appartiennent &#224; un m&#234;me document ou &#224; des 
documents diff&#233;rents, peuvent &#234;tre redondants, L&#17;H&#17; une m&#234;me information est susceptible 
d&#8217;appara&#238;tre dans plusieurs segments sous des formes l&#233;g&#232;rement diff&#233;rentes. Une &#233;valuation 
de la similarit&#233; des segments s&#233;lectionn&#233;s est donc r&#233;alis&#233;e, d&#8217;abord au sein d&#8217;un m&#234;me 
document puis entre documents, en utilisant une mesure de similarit&#233; adapt&#233;e &#224; la 
comparaison d&#8217;unit&#233;s textuelles. Pour un ensemble de segments similaires, seul est retenu le 
segment suppos&#233; contenir l&#8217;information la plus compl&#232;te, L&#17;H&#17; celui dont le vocabulaire couvre 
le plus compl&#232;tement l&#8217;ensemble des segments concern&#233;s. Le r&#244;le de l&#8217;&#233;tape de fusion vise 
donc &#224; minimiser les redondances d&#8217;information.  
</p>
<p> 
</p>
<p>5.1 Fusion intra-document 
</p>
<p>Du point de vue de la d&#233;tection des redondances entre segments, nous distinguons deux 
classes de segments : 
</p>
<p>&#8226;  les segments dont l&#8217;appariement avec le profil se fonde sur des termes du profil 
reconnus de fa&#231;on stricte dans le segment ; 
</p>
<p>&#8226;  les segments dont l&#8217;appariement avec le profil se fonde au moins partiellement sur 
des termes nouveaux. 
</p>
<p> 
</p>
<p>Les premiers, appel&#233;s segments c&#339;ur, repr&#233;sentent plut&#244;t l&#8217;instanciation dans un document 
particulier de l&#8217;information d&#233;j&#224; contenue dans le profil tandis que les seconds, appel&#233;s 
segments extension, sont davantage vou&#233;s &#224; apporter de l&#8217;information nouvelle en relation 
avec le profil. Ces deux classes &#233;tant compl&#233;mentaires, nous ne chercherons pas &#224; fusionner 
les informations issues d&#8217;une classe avec celles provenant de l&#8217;autre classe. Au sein de 
chacune de ces deux classes, la d&#233;tection des redondances entre segments s&#8217;appuie sur une 
mesure de similarit&#233; &#224; laquelle est associ&#233; le seuil fix&#233; D&#3; SULRUL 6
VHJPHQW
</p>
<p>. Nous avons 
classiquement choisi la mesure du cosinus, qui s&#8217;av&#232;re particuli&#232;rement bien adapt&#233;e &#224; la 
comparaison d&#8217;unit&#233;s textuelles. La similarit&#233; entre deux segments 6
&#20;
</p>
<p> et 6
&#21;
</p>
<p> est donn&#233;e par : 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#3; &#3; 6DQD&#16;/HLOD&#3;&amp;+$$5&#3;
 
</p>
<p>&#8721;&#8721;
&#8721;
</p>
<p>&#8901;
</p>
<p>&#8901;
</p>
<p>=
</p>
<p>L
</p>
<p>L
</p>
<p>L
</p>
<p>L
</p>
<p>L
</p>
<p>L
</p>
<p>L
</p>
<p>6WQE2FF6WQE2FF
</p>
<p>6WQE2FF6WQE2FF
66VLP
</p>
<p>2
2
</p>
<p>2
1
</p>
<p>21
</p>
<p>21 ),()(
</p>
<p>),(),(
),(
</p>
<p>            (5.1) 
</p>
<p> 
</p>
<p>avec QE2FF&#11;W
L
</p>
<p>&#15;&#3;6
^&#20;&#15;&#21;`
</p>
<p>&#12;, le nombre d&#8217;occurrences du terme W
L
</p>
<p> dans le segment 6
^&#20;&#15;&#21;`
</p>
<p>. Les termes W
L
</p>
<p> 
</p>
<p>consid&#233;r&#233;s ici correspondent aux lemmes issus du pr&#233;-traitement linguistique des documents. 
Si cette mesure de similarit&#233; d&#233;passe le seuil 6
VHJPHQW
</p>
<p>, les deux segments sont jug&#233;s similaires 
et sont donc suppos&#233;s contenir en premi&#232;re approximation les m&#234;mes informations. Un seul 
des deux segments peut donc repr&#233;senter les deux. Dans le cas contraire, on conserve les deux 
segments. Plus globalement, la mesure de similarit&#233; (5.1) est &#233;valu&#233;e entre tous les segments 
au sein de chacune des deux classes distingu&#233;es ci-dessus (segments c&#339;ur et segments 
extension). Ces segments sont ensuite regroup&#233;s en fonction de la valeur de cette mesure : 
chaque segment est associ&#233; au segment avec lequel sa similarit&#233; est la plus forte, &#224; condition 
toutefois que cette similarit&#233; soit sup&#233;rieure au seuil 6
VHJPHQW
</p>
<p>. On obtient ainsi un ensemble de 
regroupements disjoints de segments similaires. Dans le cas o&#249; la similarit&#233; entre tous les 
segments est assez forte, une classe peut ne comporter qu&#8217;un seul groupe de segments. Un 
repr&#233;sentant est ensuite s&#233;lectionn&#233; pour chaque groupe de segments ainsi d&#233;fini. Nous nous 
appuyons pour ce faire sur le vocabulaire caract&#233;risant le groupe, vocabulaire d&#233;fini comme 
l&#8217;ensemble des termes simples communs &#224; au moins deux de ses segments. Le repr&#233;sentant du 
groupe est plus pr&#233;cis&#233;ment le segment abritant la plus large proportion de ce vocabulaire. 
 
</p>
<p>5.2  Fusion inter-document 
</p>
<p>&#192; l&#8217;issue de l&#8217;&#233;tape de fusion intra-document, chaque document est repr&#233;sent&#233; par deux 
ensembles rassemblant des segments non similaires selon (5.1). La fusion inter-document 
commence par l&#8217;union des ensembles de m&#234;me type des diff&#233;rents documents consid&#233;r&#233;s. Au 
sein de chacun de ces deux ensembles, nous appliquons le m&#234;me algorithme de regroupement 
et de s&#233;lection d&#8217;un repr&#233;sentant que celui appliqu&#233; dans le cadre de la fusion intra-document. 
En finale, nous obtenons donc un ensemble de segments c&#339;ur et un ensemble de segments 
extension.  
</p>
<p>6 Classement des extraits de documents 
Afin de faciliter l&#8217;exploitation ult&#233;rieure des deux ensembles de segments issus du filtrage, en 
particulier leur visualisation, un ordre de pertinence est d&#233;fini sur leurs &#233;l&#233;ments. En 
revanche, ces deux ensembles sont conserv&#233;s disjoints dans la mesure o&#249; chacun d&#8217;eux rend 
compte d&#8217;une dimension particuli&#232;re du filtrage, dimension qui sera ou non exploit&#233;e suivant 
l&#8217;application dans laquelle celui-ci vient s&#8217;ins&#233;rer. Plus pr&#233;cis&#233;ment, chaque segment se voit 
attribuer un score calcul&#233; sur la base du vocabulaire qui le compose. Ce score prend en 
compte &#224; la fois la pr&#233;sence des termes du profil, sous une forme stricte ou approch&#233;e, ainsi 
que celle des termes communs au groupe de segments dont celui consid&#233;r&#233; est le repr&#233;sentant. 
Ce score est donn&#233;e par : 
</p>
<p>      
</p>
<p>&#8721;&#8901;+&#8721;&#8901;+&#8721;&#8901;=
L
</p>
<p>6LWFJQE2FF
L
</p>
<p>6LWSDQE2FF
L
</p>
<p>6LWSVQE2FF6VFRUH ),(5,0),(75,0),(0,1)(       (6.1) 
</p>
<p>o&#249; WSV
L
</p>
<p> est un terme du profil reconnu de fa&#231;on stricte, WSD
L
</p>
<p> est un terme du profil reconnu de 
fa&#231;on approch&#233;e et WFJ
L
</p>
<p> est un des termes communs aux segments formant le groupe dont le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>([WUDFWLRQ&#3;GH&#3;VHJPHQWV&#3;WKpPDWLTXHV&#3;SRXU&#3;OH&#3;UpVXPp&#3;PXOWL&#16;GRFXPHQW&#3;&#3;
&#3;
</p>
<p>segment consid&#233;r&#233; est le repr&#233;sentant. Ces pond&#233;rations favorisent la proximit&#233; par rapport au 
profil tout en accordant une place significative aux termes qu&#8217;il semble raisonnable d&#8217;associer 
au profil (termes&#3; WFJ
L
</p>
<p>). Les segments ayant des tailles assez similaires, nous n&#8217;avons pas 
adopt&#233; de normalisation en fonction de la taille des segments. Finalement, le r&#233;sultat du 
processus global se pr&#233;sente sous la forme de deux listes, celle des segments c&#339;ur et celle des 
segments extension, ordonn&#233;es suivant l&#8217;ordre d&#233;croissant du score de leurs segments. 
</p>
<p>7 Conclusion 
Nous avons propos&#233;e dans cet article une m&#233;thode qui permet d&#8217;extraire d&#8217;un ensemble de 
documents ses parties les plus significatives relativement &#224; un profil utilisateur structur&#233;s sur 
le plan th&#233;matique. Cette m&#233;thode fait l&#8217;objet d&#8217;une impl&#233;mentation au sein d&#8217;un syst&#232;me qui 
est actuellement en cours de r&#233;alisation. Dans ce travail nous faisons la distinction entre les 
parties de document en relation directe avec un profil et les parties de document repr&#233;sentant 
potentiellement des informations nouvelles li&#233;es &#224; ce profil, ce qui pr&#233;sente un int&#233;r&#234;t 
particulier pour des applications de veille technologique. Plus classiquement, les extraits 
similaires au sein de chacune de ces deux cat&#233;gories sont regroup&#233;s et d&#233;sign&#233;s par leur 
repr&#233;sentant le plus caract&#233;ristique. Bien que le filtrage soit ici con&#231;u comme une activit&#233; 
r&#233;currente pouvant justifier un certain investissement de la part d&#8217;un utilisateur, la n&#233;cessit&#233; 
de d&#233;finir une structuration de ce type peut appara&#238;tre comme r&#233;dhibitoire vis-&#224;-vis de 
l&#8217;utilisation d&#8217;une telle m&#233;thode. Il convient n&#233;anmoins de souligner que cette structuration 
n&#8217;est pas une condition indispensable &#224; la mise en &#339;uvre de la m&#233;thode. Ainsi que nous 
l&#8217;avons vu &#224; la section 4.2, la structure des profils intervient lors de la s&#233;lection des segments 
d&#8217;un document afin d&#8217;am&#233;liorer la pertinence de l&#8217;&#233;valuation de la proximit&#233; entre un segment 
et un profil. Au prix d&#8217;une baisse de pr&#233;cision, il est cependant tout &#224; fait possible de r&#233;aliser 
cette &#233;valuation avec un profil non structur&#233;. Par ailleurs, une aide &#224; la structuration 
th&#233;matique des profils peut &#234;tre apport&#233;e &#224; l&#8217;utilisateur. Si celui-ci dispose d&#8217;un ensemble de 
documents relatifs aux th&#232;mes du profil qu&#8217;il souhaite d&#233;finir, l&#8217;utilisation conjointe, d&#8217;une 
segmentation th&#233;matique (cf. 2.2) et d&#8217;une m&#233;thode de classification non supervis&#233;e permet 
de proposer &#224; l&#8217;utilisateur une repr&#233;sentation des th&#232;mes de ces documents qu&#8217;il pourra 
ensuite modifier manuellement s&#8217;il le souhaite. 
 
</p>
<p>Outre la nature des profils, une m&#233;thode de extraction se caract&#233;rise &#233;galement par le type des 
textes qu&#8217;elle se propose de traiter. Dans le cas pr&#233;sent, les moyens d&#8217;analyse mobilis&#233;s, en 
particulier l&#8217;analyse th&#233;matique, ne s&#8217;appuient que sur la forme de surface des textes et ne 
font pas intervenir de connaissances externes &#224; ceux-ci de nature s&#233;mantique ou pragmatique. 
Compte tenu de ces moyens, le filtrage de textes dans lesquels une notion est &#233;voqu&#233;e sous 
des formes tr&#232;s diverses, comme c&#8217;est souvent le cas dans les textes journalistes ou narratifs, 
est D&#3;SULRUL moins bon que le filtrage de textes o&#249; la r&#233;currence du vocabulaire, &#224; l&#8217;instar des 
textes techniques, est assez &#233;lev&#233;e, en particulier du fait de son caract&#232;re tr&#232;s sp&#233;cifique.  
 
</p>
<p>Il faut d&#8217;autre part remarquer que ce relatif minimalisme au niveau des moyens d&#8217;analyse rend 
assez l&#233;ger la transposition d&#8217;une langue &#224; une autre4, ce qui r&#233;pond &#224; une partie de nos 
pr&#233;occupations. Une des fa&#231;ons d&#8217;am&#233;liorer l&#8217;analyse des textes tout en pr&#233;servant cette 
capacit&#233; d&#8217;adaptation rapide &#224; une autre langue est de faire appel &#224; des connaissances pouvant 
&#234;tre construites automatiquement &#224; partir de corpus. Nous envisageons d&#8217;adapter ces principes 
&#224; la m&#233;thode que nous avons pr&#233;sent&#233;e ici apr&#232;s validation de celle-ci sous sa forme actuelle.  
</p>
<p>                                                 
</p>
<p>4
 Cette transposition d&#233;pend plus pr&#233;cis&#233;ment des moyens d&#8217;analyse morpho-syntaxique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#3; &#3; 6DQD&#16;/HLOD&#3;&amp;+$$5&#3;
 
</p>
<p>Nous projetons en particulier de l&#8217;&#233;valuer dans le cadre propos&#233; par les conf&#233;rences DUC, soit 
au travers d&#8217;une participation &#224; la t&#226;che d&#233;di&#233;e au r&#233;sum&#233; multi-document5, soit par une 
utilisation des donn&#233;es de r&#233;f&#233;rence qui en sont issues et des outils d&#233;finis dans ce m&#234;me 
contexte afin de r&#233;aliser une &#233;valuation automatique. 
 
</p>
<p>R&#233;f&#233;rences  
Ando, Rie Kubota, , Boguraev K., Byrd, Roy J., Neff, Mary S. (2000)  Multisummarization 
by Visualizing Topical Content, $1/3&#18;1$$&amp;/&#3;:RUNVKRS&#3;$XWRPDWLF&#3;6XPPDUL]DWLRQ&#3;
&#3;
Barzilay R., Mc Keown, Kathleen R., Elhadad, M. (1999)  Information fusion in the context 
of multi-document summarization&#15;&#3;&#22;&#26;qPH&#3;$QQXDO&#3;0HHWLQJ&#3;RI&#3;WKH&#3;$&amp;/. 
 
</p>
<p>Boros, Endre, Kandor, Paul B., Neu, David J. (2001) A clustering based approach to creating 
multi-document summaries, $&amp;0&#3;6,*,5&#182;&#19;&#20;&#3;:RUNVKRS&#3;RQ&#3;7H[W&#3;6XPPDUL]DWLRQ. 
 
</p>
<p>Fluhr C. (1994)  SPIRIT : un syst&#232;me d'exploration de donn&#233;es textuelles, /H&#3; 7UDLWHPHQW&#3;
,QIRUPDWLTXH&#3;GHV&#3;&amp;RUSXV&#3;7H[WXHOV, INALF. 
 
</p>
<p>Goldstein J., Mittal V., Kantrowitz M., Carbonell J. (2000)  Multi-Document Summarization 
By Sentence Extraction,&#3;$1/3&#18;1$$&amp;/&#3;:RUNVKRS&#3;RQ&#3;$XWRPDWLF&#3;6XPPDUL]DWLRQ. 
 
</p>
<p>Hearst M. (1997)  TextTiling: Segmenting Text into Multi-paragraph Subtopic Passages, 
&amp;RPSXWDWLRQDO&#3;/LQJXLVWLFV, Vol. 23, n&#176; 1, p. 33-64. 
 
</p>
<p>Kraaij, Wessel, Spitters, , et al. (2001) Combining a mixture language model and Naive Bayes 
for multi-document summarisation, $&amp;0&#3;6,*,5&#182;&#19;&#20;&#3;:RUNVKRS&#3;RQ&#3;7H[W&#3;6XPPDUL]DWLRQ. 
 
</p>
<p>Mani I., Bloedorn E. (1999) Summarizing similarities and differences among documents, 
,QIRUPDWLRQ&#3;5HWULHYDO, Vol. 1, n&#176; 1, p. 1-23. 
 
</p>
<p>McKeown, Kathleen R., Barzilay, Regina, Evans David, Hatzivassiloglou, Vasileios, Kan, 
Min-Yen, Schiffman, Barry, Teufel, Simone (2001) Columbia Multi-document 
Summarization : Approach and Evalution , $&amp;0&#3;6,*,5&#182;&#19;&#20;&#3;:RUNVKRS&#3;RQ&#3;7H[W&#3;6XPPDUL]DWLRQ. 
 
</p>
<p>Over P. (2001) Introduction to DUC-2001: an Intrinsic Evaluaton of Generic News Text 
Summarization Systems,&#3;$&amp;0&#3;6,*,5&#182;&#19;&#20;&#3;:RUNVKRS&#3;RQ&#3;7H[W&#3;6XPPDUL]DWLRQ. 
 
</p>
<p>Radev, Dragomir R., McKeown, Kathleen R. (1998) Generating natural language summaries 
from multiple on-line sources, &amp;RPSXWDWLRQDO&#3;/LQJXLVWLFV, Vol. 24, n&#176; 3, p. 469-500.  
 
</p>
<p>White, Michael,  et al., (2001) Detecting Disrepancies and Improving Intelligibility : Two 
Preliminary Evaluations of RIPTIDES, $&amp;0&#3;6,*,5&#182;&#19;&#20;&#3;:RUNVKRS&#3;RQ&#3;7H[W&#3;6XPPDUL]DWLRQ. 
</p>
<p>                                                 
</p>
<p>5
 Une telle participation demandera &#233;videmment une adaptation au niveau de l&#8217;&#233;tape de fusion afin de consid&#233;rer des phrases 
et non plus seulement des segments. </p>

</div></div>
</body></html>