<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitement de la morphologie du finnois par transducteurs &#224; nombre fini d&#8217;&#233;tats</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;CITAL 2003, Batz-sur-Mer, 11-14 juin 2003 
</p>
<p>Traitement de la morphologie du finnois par transducteurs &#224; 
nombre fini d&#8217;&#233;tats 
</p>
<p>Marie CALBERG 
</p>
<p>OSTERLITS  
</p>
<p>marie.calberg@wanadoo.fr 
</p>
<p>Mots-clefs &#8211; Keywords 
</p>
<p>D&#233;rivation &#8211; suffixe &#8211; finnois &#8211; tranducteurs &#224; nombre fini d&#8217;&#233;tats  
</p>
<p>Derivation &#8211; suffix &#8211; finnish &#8211; finite state tranducers 
</p>
<p>R&#233;sum&#233; - Abstract 
</p>
<p>Cette &#233;tude pr&#233;sente un mod&#232;le pour le traitement de la morphologie du finnois. Ce mod&#232;le 
est fond&#233; sur des transducteurs &#224; nombre fini d&#8217;&#233;tats. L&#8217;approche utilise une fa&#231;on originale 
d&#8217;organiser les donn&#233;es et de g&#233;n&#233;rer dynamiquement une structure s&#233;mantique &#224; partir d&#8217;une 
analyse morphologique. L&#8217;approche est linguistiquement valid&#233;e par une &#233;tude des suffixes 
de d&#233;rivation verbale en finnois. 
</p>
<p>This study presents a model for Finnish morphology processing. This model is based on 
finite-state machines. The approach uses an original way to structure the data and 
dynamically generates semantic information from the morphology analysis. The approach is 
linguistically validated by a study of Finnish verbal suffixes.  
</p>
<p>1 Introduction  
 
Du point de vue de leur structure, les mots finnois peuvent &#234;tre des mots racines, d&#233;riv&#233;s ou 
compos&#233;s. Le noyau du vocabulaire est form&#233; par des mots racines : ces mots ne sont pas 
d&#233;composables et leur th&#232;me se r&#233;duit au morph&#232;me radical. &#192; c&#244;t&#233; de la composition, la 
d&#233;rivation est le proc&#233;d&#233; le plus important pour la formation de mots nouveaux. Notre 
hypoth&#232;se de d&#233;part est de voir s'il existe une corr&#233;lation entre l&#8217;emploi des suffixes de 
d&#233;rivation verbale et la nature d&#8217;un texte.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie Calberg 
</p>
<p>L'article pr&#233;sente un rapide &#233;tat de l&#8217;art. Nous proposons ensuite un syst&#232;me reprenant la 
notion de morphologie &#224; deux niveaux enrichie de processus de structuration et d&#8217;h&#233;ritage au 
sein des &#233;l&#233;ments constitutifs du lexique.  
</p>
<p>2 Travaux ant&#233;rieurs en traitement automatique de la 
morphologie du finnois  
</p>
<p>Ces derni&#232;res ann&#233;es, de nombreux travaux concernant le traitement automatique de la 
morphologie des langues naturelles ont &#233;t&#233; d&#233;velopp&#233;s. Nous mentionnons ici trois sources 
d'inspiration. K. Koskenniemi (1983) propose un mod&#232;le &#224; deux niveaux pour le traitement de 
la morphologie. Le premier niveau correspond aux unit&#233;s morphologiques de base tandis que 
le deuxi&#232;me niveau code les variations morphologiques dues &#224; la mise en correspondance 
d&#8217;unit&#233;s de base au sein d&#8217;unit&#233;s de plus haut niveau. D. Cl&#233;menceau (1996) a &#233;galement 
propos&#233; un mod&#232;le fond&#233; sur un syst&#232;me de transducteurs &#224; nombre fini d&#8217;&#233;tats pour traiter la 
morphologie. R. Evans et G. Gazdar (1996) ont propos&#233; un mod&#232;le riche permettant de 
structurer hi&#233;rarchiquement les unit&#233;s linguistiques de sorte que des informations 
linguistiques peuvent &#234;tre partag&#233;es par plusieurs unit&#233;s. Le lexique ainsi d&#233;velopp&#233; est donc 
moins redondant et plus coh&#233;rent.  
</p>
<p>3 Un mod&#232;le pour traiter la morphologie du finnois 
</p>
<p>Le mod&#232;le que nous nous avons d&#233;velopp&#233; pour analyser la morphologie du finnois est fond&#233; 
sur un ensemble de transducteurs nombre fini d&#8217;&#233;tats. Il est inspir&#233; de diff&#233;rents travaux, entre 
autres ceux de Koskeniemmi (morphologie &#224; deux niveaux, 1986), de Cl&#233;menceau 
(morphologie &#224; nombre fini d&#8217;&#233;tats, 1993), de Gazdar (organisation hi&#233;rarchique du lexique, 
cf. DATR, 1996). 
</p>
<p>3.1 Les donn&#233;es de base (morphologie de premier niveau) 
</p>
<p>Les diff&#233;rents morph&#232;mes sont d&#8217;abord d&#233;compos&#233;s dans des graphes ind&#233;pendants. Voici par 
exemple le graphe lexical qui correspond &#224; la racine eksy (perdre): 
</p>
<p> 
</p>
<p>Le graphe suivant correspond au d&#233;riv&#233; causatif : 
</p>
<p> 
Et le graphe suivant correspondant &#224; l'infinitif :  
</p>
<p> 
Chaque graphe de base est typ&#233; : les racines lexicales sont typ&#233;es en Verb_Root, les suffixes de 
d&#233;rivation en Suff et les terminaisons verbales en Conj. La combinaison de graphes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement de la morphologie du finnois par transducteurs &#224; nombre fini d&#8217;&#233;tats 
</p>
<p>ind&#233;pendants est cod&#233;e en utilisant un m&#233;tagraphe lexical abstrait permettant d&#8217;appeler 
dynamiquement les graphes lexicaux. Par exemple, le graphe suivant : 
</p>
<p> 
correspond &#224; un verbe simple, tandis que le graphe ci-dessous : 
</p>
<p> 
correspond &#224; un verbe suffix&#233;. La correspondance entre le nom des &#171; bo&#238;tes &#187; dans les graphes 
ci-dessus et les types des graphes &#233;l&#233;mentaires est &#233;vidente (ce point est modelis&#233; par les 
bo&#238;tes grises, qui renvoient aux sous-graphes dont elles portent les noms). Nous obtenons 
ainsi les graphes lexicaux suivants : 
</p>
<p>        
</p>
<p>qui correspondent respectivement &#224; la forme simple et d&#233;riv&#233;e du verbe dont la racine est 
eksy. Nous examinons dans la section suivante les r&#232;gles de lin&#233;arisation permettant de 
produire des unit&#233;s lexicales valides. Un ensemble de r&#232;gles de lin&#233;arisation permettent en 
outre de contraindre l'insertion des voyelles entre la racine et le suffixe (cf. tunn-i-sta-a &lt;- 
tuntea). Enfin, des r&#232;gles permettent de modifier dynamiquement certains cas de mise en 
relation de racines avec des suffixes (ph&#233;nom&#232;nes d&#8217;assimilation). Cl&#233;menceau (1996) a 
propos&#233; un mod&#232;le permettant d&#8217;implanter ce type de propri&#233;t&#233;s linguistiques &#224; l'aide des 
machines &#224; nombre fini d&#8217;&#233;tats. Nous nous inspirons ici de l'analyse propos&#233;e par 
Cl&#233;menceau.  
</p>
<p>3.2 Probl&#232;mes de lin&#233;arisation (morphologie &#224; deux niveaux) 
</p>
<p>L'approche que nous avons propos&#233;e n'est pas compl&#232;te puisque ni *eksya ni *eksyttA ne 
correspondent aux formes lexicales valides en finnois. La lin&#233;arisation est un m&#233;canisme 
pr&#233;vu pour produire les formes de surface valides, c&#8217;est-&#224;-dire eksy&#228; de *eksya du fait que le 
radical de verbe contient une voyelle ant&#233;rieure (y et pas u). Les probl&#232;mes de lin&#233;arisation 
sont r&#233;solus en utilisant des graphes sp&#233;cifiques qui sont appliqu&#233;s apr&#232;s l'&#233;tape pr&#233;c&#233;dente. 
Les lettres majuscules dans les graphes lexicaux correspondent &#224; des variables qui doivent 
&#234;tre rep&#233;r&#233;es &#224; partir du contexte. Le graphe suivant code ce genre d'information : 
</p>
<p> 
Le graphe indique le fait que la variable (la lettre majuscule A) doit &#234;tre r&#233;alis&#233;e par un &#228; si et 
seulement si elle est pr&#233;c&#233;d&#233;e par une voyelle ant&#233;rieure &#228;, &#246; ou y. Le &lt;L&gt; correspond &#224; 
n'importe quelle lettre de l'alphabet. Le graphe correspondant aux voyelles post&#233;rieures est le 
suivant : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie Calberg 
</p>
<p> 
</p>
<p>Enfin, un graphe par d&#233;faut s'applique si le radical de verbe contient des voyelles neutres. Ces 
graphes de lin&#233;arisation sont appliqu&#233;s apr&#232;s les graphes lexicaux pr&#233;c&#233;dents. Par exemple, &#224; 
partir du graphe ci-dessous : 
</p>
<p> 
</p>
<p>on peut obtenir le r&#233;sultat suivant : 
</p>
<p> 
</p>
<p>ce qui correspond &#224; une forme de surface valide. 
</p>
<p>3.3 Les propri&#233;t&#233;s s&#233;mantiques 
</p>
<p>La d&#233;composition de morph&#232;mes lexicaux en unit&#233;s de base permet de leur associer une 
information s&#233;mantique. Ceci permet de g&#233;n&#233;rer dynamiquement une structure s&#233;mantique 
pour les unit&#233;s lexicales complexes, par analyse compositionnelle. Ceci est particuli&#232;rement 
important en finnois du fait qu&#8217;il s&#8217;agit d&#8217;une langue agglutinante. 
</p>
<p>Nous associons alors des informations s&#233;mantiques aux unit&#233;s morphologiques de base. Ces 
informations peuvent &#234;tre attach&#233;es &#224; diff&#233;rents niveaux de d&#233;tail, puisque les unit&#233;s 
morphologiques sont stock&#233;es dans un treillis inspir&#233; de DATR (Gazdar et Evans, 1996) : 
</p>
<p>Lexicon 
</p>
<p> 
Root            Suffix           Conj... 
</p>
<p> 
Verb               Noun ... 
</p>
<p>Ce sch&#233;ma est particuli&#232;rement important pour le codage de l&#8217;information s&#233;mantique. Par 
exemple, le transducteur suivant : 
</p>
<p> 
</p>
<p>permet de calculer la forme s&#233;mantique du verbe comme eksytt&#228;&#228;. La bo&#238;te Verb_Root 
correspond &#224; la racine eksy de sorte que le transducteur produit la forme suivante :  
</p>
<p>eksytt&#228;&#228; -&gt; le CAUS (eksy) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement de la morphologie du finnois par transducteurs &#224; nombre fini d&#8217;&#233;tats 
</p>
<p>La g&#233;n&#233;ralisation de ce type de codage est particuli&#232;rement adapt&#233;e pour la morphologie du 
finnois. Il est naturellement impossible de stocker l'ensemble des formes linguistiques de 
surface dans un dictionnaire pour une langue agglutinante comme le finnois; le lexique serait 
infini. Une approche g&#233;n&#233;rative permet un traitement plus &#233;conomique et plus appropri&#233; &#224; la 
morphologie du finnois. 
</p>
<p>3.4 Algorithme 
</p>
<p>L'algorithme propos&#233; est alors tr&#232;s simple. Il est tout d&#8217;abord n&#233;cessaire d&#8217;identifier les 
formes ambigu&#235;s, c'est-&#224;-dire les formes linguistiques qui se terminent comme un d&#233;riv&#233; mais 
qui n&#8217;en sont pas. Ces formes ambigu&#235;s sont enregistr&#233;es dans un dictionnaire sp&#233;cifique. 
L'analyse des autres formes est alors effectu&#233;e par l'application du lexique sous forme de 
graphes &#224; nombre fini d&#8217;&#233;tats. L'algorithme suivant est appliqu&#233; :  
</p>
<p>1. Isoler les formes ambigu&#235;s  
</p>
<p>2. Appliquer le lexique sous forme de transducteurs sur les formes non ambigu&#235;s  
</p>
<p>3. G&#233;n&#233;rer la repr&#233;sentation s&#233;mantique attach&#233;e aux formes de surface analys&#233;es 
</p>
<p>Cet algorithme a &#233;t&#233; appliqu&#233; sur un corpus repr&#233;sentatif pour valider les hypoth&#232;ses 
linguistiques de d&#233;part. 
</p>
<p>3.5 Impl&#233;mentation 
</p>
<p>Les graphes ci-dessus ont &#233;t&#233; dessin&#233;s en utilisant le module graphique d'INTEX/UNITEX 
(Silberztein, 1993). Cependant, l&#8217;application r&#233;cursive des graphes morphologiques 
ind&#233;pendants n'a pas encore &#233;t&#233; vraiment implant&#233; dans cette plateforme. Par exemple, il n'est 
pas possible de d&#233;composer dynamiquement des entr&#233;es complexes  pour produire une 
analyse morpho-s&#233;mantique.  
</p>
<p>Nous avons d&#233;velopp&#233; une premi&#232;re implantation, en utilisant des scripts Perl. Cette 
implantation est fond&#233;e sur un ensemble d'expressions r&#233;guli&#232;res codant l'analyse 
morphologique d&#233;taill&#233;e ci-dessus. Ce travail fait partie d'un projet de plus grande ampleur 
pr&#233;vu pour fournir une analyse compl&#232;te du finnois en utilisant les transducteurs &#224; nombre 
fini d&#8217;&#233;tats (cf. derni&#232;re section : perspectives). 
</p>
<p>4 Conclusion 
</p>
<p>Nous avons pr&#233;sent&#233; dans cet article un mod&#232;le pour traiter la morphologie de langues 
agglutinantes telles que le finnois. L&#8217;approche est fond&#233;e sur la manipulation d&#8217;unit&#233;s de base 
codant des informations morphologiques et s&#233;mantiques. Des r&#232;gles constructivistes 
permettent de calculer une repr&#233;sentation s&#233;mantique pour les unit&#233;s complexes et de 
contr&#244;ler les ph&#233;nom&#232;nes d&#8217;assimilation de voyelles. Ce travail est d&#233;velopp&#233; avec des 
linguistes et permettra la validation d&#8217;hypoth&#232;ses linguistiques sur la structure du finnois. Le 
travail a &#233;t&#233; valid&#233; sur un large corpus textes en finnois. (Calberg, 2002).  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Marie Calberg 
</p>
<p>5 Perspectives : des donn&#233;es &#224; grande &#233;chelle pour le traitement 
du finnois 
</p>
<p>L'exp&#233;rience d&#233;crite dans cet article fait partie d'un projet de plus grande ampleur pr&#233;vu pour 
fournir des ressources &#224; grande &#233;chelle pour le traitement du finnois. La premi&#232;re &#233;tape 
consiste &#224; compl&#233;ter les ressources existantes. Nous envisageons une collaboration pour 
d&#233;velopper un dictionnaire et un &#233;tiqueteur pour cette langue. Le r&#233;sultat devrait &#234;tre 
utilisable dans la plateforme d'INTEX/UNITEX (Silberztein, 1993). L'approche 
constructiviste et g&#233;n&#233;rativiste d&#233;crite dans cet article sera, autant que peut se faire, respect&#233;e 
pour fournir une description riche de cette langue. Enfin, un corpus repr&#233;sentatif plus 
important doit &#234;tre &#233;tabli pour le finnois, comme il en a &#233;t&#233; discut&#233; ci-dessus. Ce travail sera 
d&#233;velopp&#233; par des informaticiens et des linguistes pour &#233;tablir une approche r&#233;ellement 
multidisciplinaire permettant d&#8217;aborder la linguistique de corpus en finnois dans ses 
diff&#233;rentes dimensions. 
</p>
<p>Remerciements 
</p>
<p>Nous remercions Thierry Poibeau, M.M.Jocelyne Fernandez-Vest, Andr&#233; Salem et Serge 
Fleury pour leur soutien &#224; cette participation et les relecteurs de RECITAL pour leurs 
remarques qui nous ont permis d&#8217;am&#233;liorer cet article. 
</p>
<p>References 
</p>
<p>Bl&#229;berg O. (1994) The Ment Model. Complex States in Finite State Morphology. PhD 
dissertation. Dept. of Linguistics. Uppsala, Sweden. 
Calberg M. (2002) &#171; Les suffixes de d&#233;rivation verbale du finnois et leurs &#233;quivalents fran&#231;ais 
- approche en Traitement Automatique des Langues &#187;. 6e colloque contrastif fran&#231;ais-finnois, 
Helsinki.  
Cl&#233;menceau D. (1996) &#8220;Finite-state morphology processing : inflections and derivation in a 
single framework using dictionaries and rules&#8221;. In Roche E. and Schabes E. (eds.) Finite-state 
language processing, MIT Press, Cambridge. 
Dubois J., Giacomo M., Guespin L., Marcellesi C. et Mevel J-P. (1994). Dictionnaire de 
linguistique et des sciences du langage, Larousse, Paris. 
Evans R. and Gazdar G (1996) &#8220;DATR: a language for lexical knowledge representation&#8221;. 
Computational Linguistics, 22(2), pp. 797-815. 
Goldsmith (2000) &#8220;Unsupervised Learning of the Morphology of a Natural Language&#8221;.  
Computational Linguistics 27(2), pp. 153-198.  
Habert B., Nazarenko A. et Salem. A. (1997). Les linguistiques de corpus. Armand Colin 
Paris. 
Koskenniemi K. (1983) Two level morphology : a general computational model for word 
form recognition and production. University of Helsinki. 
Silberztein M. (1993) Dictionnaires &#233;lectroniques et analyse automatique de textes, le 
syst&#232;me Intex. Masson, Paris. </p>

</div></div>
</body></html>