<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Comment formule-t-on une r&#233;ponse en langue naturelle ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Comment formule-t-on une r&#233;ponse en langue naturelle ?
</p>
<p>Anne Garcia-Fernandez1,2, Sophie Rosset1, Anne Vilnat1,2
</p>
<p>(1) LIMSI-CNRS B.P. 133 91403 Orsay Cedex
(2) Universit&#233; Paris Sud 11 Orsay
annegf, vilnat, rosset @limsi.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente l&#8217;&#233;tude d&#8217;un corpus de r&#233;ponses formul&#233;es par des humains &#224; des
questions factuelles. Des observations qualitatives et quantitatives sur la reprise d&#8217;&#233;l&#233;ments de la question
dans les r&#233;ponses sont expos&#233;es. La notion d&#8217;information-r&#233;ponse est introduite et une &#233;tude de la pr&#233;sence
de cet &#233;l&#233;ment dans le corpus est propos&#233;e. Enfin, les formulations des r&#233;ponses sont &#233;tudi&#233;es.
</p>
<p>Abstract. This paper presents the study of a corpus of human answers to factual questions. Obser-
vations of how and how much question elements are used in the answer are done. We define the concept
of &#8220;information-answer&#8221; and study its presence in the corpus. Finally, answer formulations are shown.
</p>
<p>Mots-cl&#233;s : syst&#232;mes de r&#233;ponse &#224; une question, variations linguistiques, r&#233;ponse en langue natu-
relle, oral et &#233;crit.
</p>
<p>Keywords: question-answering systems, linguistics variations, natural language answer, oral and
written.
</p>
<p>1 Introduction
</p>
<p>La probl&#233;matique de la g&#233;n&#233;ration des r&#233;ponses dans le cadre des syst&#232;mes de question-r&#233;ponse en do-
maine ouvert a &#233;t&#233; &#233;tudi&#233;e essentiellement pour am&#233;liorer la pr&#233;cision de l&#8217;extraction de la r&#233;ponse ou
encore de la s&#233;lection des documents ((Plamondon et al., 2002), (Soubbotin &amp; Soubbotin, 2001)). Des
&#233;tudes sur naturalit&#233; des r&#233;ponses ont &#233;t&#233; men&#233;es sur des domaines limit&#233;s ((Green &amp; Carberry, 1999),
(Higashinaka et al., 2006)). La production de r&#233;ponses interactives multimodales a &#233;t&#233; &#233;tudi&#233;e (van Hooi-
jdonk et al., 2008) mais toujours en domaine limit&#233;. Le syst&#232;me ARISE (Lamel et al., 2000) g&#233;n&#232;re des
r&#233;ponses en langue naturelle et produit des phrases qui, si elles sont imit&#233;es par les utilisateurs, sont
simples &#224; reconna&#238;tre par le syst&#232;me de reconnaissance et &#224; comprendre par le syst&#232;me de compr&#233;hension.
Il int&#232;gre des strat&#233;gies employ&#233;es par des op&#233;rateurs humains ce qui a abouti &#224; un meilleur taux de satis-
faction et une meilleure note sur la naturalite lors d&#8217;&#233;valuation utilisateur.
Cependant, les formulations des r&#233;ponses semblent toujours avoir &#233;t&#233; d&#233;termin&#233;es de fa&#231;on ad hoc. Pour-
tant au vue des exemples suivants, il est &#233;vident que plusieurs formulations, diff&#233;rents choix lexicaux
mais aussi diff&#233;rents &#233;l&#233;ments de contenu sont possibles. Cet article se centre sur des choix lexicaux et
s&#233;mantique (quel contenu pour la r&#233;ponse) et laisse de c&#244;t&#233; la question de la syntaxe.
</p>
<p>Question : O&#249; est-ce que se trouve la Joconde ?
R&#233;ponse A : au Louvre
R&#233;ponse B : La Joconde se trouve au Louvre.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>R&#233;ponse C : Elle se trouve au Louvre.
R&#233;ponse D : La Joconde est au Louvre.
R&#233;ponse E : C&#8217;est au Louvre que la Joconde se trouve.
R&#233;ponse F : La Joconde est une oeuvre de L&#233;onard de Vinci expos&#233;e au Louvre.
</p>
<p>Dans le cadre d&#8217;une campagne d&#8217;&#233;valuation des syst&#232;mes de question-r&#233;ponse, la r&#233;ponse A sera &#224; pri-
vil&#233;gier (TREC, site Web). Dans le cas de syst&#232;mes coop&#233;ratifs, ce sera la r&#233;ponse F qui fait preuve de
compl&#233;tion. Mais, si le but est de proposer une r&#233;ponse en langue naturelle, pour faciliter l&#8217;interaction
par exemple, les m&#234;mes interrogations que dans n&#8217;importe quelle t&#226;che de g&#233;n&#233;ration en langue naturelle
demeurent : faut-il construire une phrase (r&#233;ponse B) ou bien une r&#233;ponse minimale telle que A suffit-elle
ou bien ? Doit-on r&#233;utiliser les termes de la question ou bien des pronoms (r&#233;ponse C), des synonymes
(r&#233;ponse D) ? Quelle structure syntaxique choisir (r&#233;ponses B vs E) ?
</p>
<p>Dans cet article, nous pr&#233;sentons une &#233;tude de corpus permettant de mettre en valeur les caract&#233;ristiques de
r&#233;ponses formul&#233;es par des locuteurs fran&#231;ais. L&#8217;application vis&#233;e est de produire des r&#233;ponses en langue
naturelle au sein d&#8217;un syst&#232;me de question-r&#233;ponse multimodal (oral ou &#233;crit) et en domaine ouvert. Il ne
s&#8217;agit pas de donner de bonnes r&#233;ponses ou bien des r&#233;ponses dont la forme serait la plus claire ou la plus
correcte possible mais de donner une r&#233;ponse qui peut sembler la plus &#8220;naturelle&#8221; possible &#224; un utilisateur
humain. Nous supposons qu&#8217;ainsi, il sera plus satisfait et aura tendance plus facilement &#224; utiliser notre
syst&#232;me. Apr&#232;s avoir pr&#233;sent&#233; le corpus utilis&#233;, nous &#233;tudions la fa&#231;on dont les questions sont reprises
dans les r&#233;ponses. Nous observons qualitativement et quantitativement ce que nous d&#233;finissons comme
l&#8217;information-r&#233;ponse. Puis les patrons des r&#233;ponses les plus fr&#233;quents du corpus seront expos&#233;s.
</p>
<p>2 MACAQ : Un corpus de r&#233;ponses produites par des humains
</p>
<p>Nous disposons d&#8217;un corpus de r&#233;ponses humaines &#224; des questions construites. Nous les avons collect&#233;es
au cours d&#8217;exp&#233;riences (Garcia-Fernandez et al., 2009) o&#249; un syst&#232;me posait des questions aux partici-
pants qui devaient y r&#233;pondre.
Le corpus d&#233;crit dans (Garcia-Fernandez et al., 2010) est constitu&#233; de r&#233;ponses &#233;crites &#224; des questions
pos&#233;es au travers d&#8217;une interface web et de r&#233;ponses orales transcrites &#224; des questions pos&#233;es par t&#233;l&#233;-
phone et synth&#233;tis&#233;es vocalement. Les questions pos&#233;es pour obtenir ces r&#233;ponses sont des questions de
quantit&#233;, lieu et temps qui portent sur des th&#232;mes vari&#233;s relevant de la culture g&#233;n&#233;rale fran&#231;aise (&#339;uvres
d&#8217;art, fleuves, &#233;v&#232;nements nationaux, feuilles &quot;A4&quot;, grossesse,...). Pour chaque question, diff&#233;rentes for-
mulations ont &#233;t&#233; propos&#233;es (l&#8217;&#233;laboration des variations d&#8217;une m&#234;me question repose sur la grammaire
interactive (Luzzati, 2006)).
Les exemples de la figure 1 montrent, pour une m&#234;me question, quelques unes des reformulations utilis&#233;es
lors de l&#8217;exp&#233;rience.
</p>
<p>Q116 : Combien mesure une feuille A4 ?
Q122 : Une feuille A4 mesure combien de centim&#232;tres ?
Q129 : Je voudrais savoir quelle taille mesure une feuille A4.
Q137 : Est-ce qu&#8217;une feuille A4 mesure 21 centim&#232;tres de largeur par 29,7 centim&#232;tres de longueur ?
</p>
<p>FIG. 1 &#8211; Exemples de reformulations d&#8217;une question
</p>
<p>Dans ces exemples, les questions portent toutes sur le m&#234;me objet &quot;une feuille A4&quot;. On observe que les
trois premi&#232;res formulations sont des questions ouvertes, qui attendent un nombre (accompagn&#233; ou non</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comment formule-t-on une r&#233;ponse en langue naturelle ?
</p>
<p>d&#8217;une unit&#233;) comme r&#233;ponse tandis que la derni&#232;re question est ferm&#233;e et attend une r&#233;ponse ferm&#233;e telle
que &quot;oui&quot;, &quot;peut-&#234;tre&quot;,...
</p>
<p>Nous proposons ici le tableau des caract&#233;ristiques principales du corpus global et des sous-parties corres-
pondant d&#8217;une part &#224; la modalit&#233; d&#8217;interaction (orale ou &#233;crite), d&#8217;autre part &#224; la nature ouverte ou ferm&#233;e
de la question.
</p>
<p>Tout Oral &#201;crit Q. ouvertes Q. ferm&#233;es
nb de r&#233;ponses 3132 1044 2088 2119 1025
nb de mots total 25104 7128 17976 18101 7111
nb de mots diff&#233;rents 4574 1634 3363 3331 1794
nb de mots moy par r&#233;ponse 8,01 6,82 8,60 8,54 6,93
nb de questions diff&#233;rentes 507 496 507 336 171
nb de participants 152 53 99 152 152
nb de r&#233;ponses/question 6,17 2,39 4,11 6,30 5,99
</p>
<p>TAB. 1 &#8211; Caract&#233;ristiques g&#233;n&#233;rales du corpus
</p>
<p>Le nombre de participants (152 au total) est de 53 &#224; l&#8217;oral et 99 &#224; l&#8217;&#233;crit ; les deux phases de l&#8217;exp&#233;rience
se sont d&#233;roul&#233;es ind&#233;pendamment. Le corpus est constitu&#233; de 3132 r&#233;ponses dont deux tiers de r&#233;ponses
&#233;crites et un tiers de r&#233;ponses orales transcrites. Il correspond &#224; plus de 25 000 mots pour de pr&#232;s de 4 600
mots distincts. La taille du lexique est 2 fois plus importante &#224; l&#8217;&#233;crit qu&#8217;&#224; l&#8217;oral alors qu&#8217;on pourrait s&#8217;at-
tendre &#224; un plafonnement du nombre de formes &#233;tant donn&#233; que les questions pos&#233;es &#224; l&#8217;&#233;crit et &#224; l&#8217;oral
sont les m&#234;mes. Il s&#8217;agit en fait d&#8217;un d&#233;compte du nombre de formes diff&#233;rentes sans aucun traitement
du corpus initial. &#192; l&#8217;&#233;crit, les r&#233;ponses contiennent des fautes d&#8217;orthographe, erreurs et coquilles qui
&#233;largissent la taille du lexique. &#192; l&#8217;oral, le corpus est constitu&#233; des transcriptions des r&#233;ponses des parti-
cipants, toutes effectu&#233;es par un m&#234;me transcripteur. Les formes sont donc plus r&#233;guli&#232;res et normalis&#233;es.
Le nombre de mots total est 2,5 fois plus important &#224; l&#8217;&#233;crit qu&#8217;&#224; l&#8217;oral. L&#8217;information sur le nombre de
mots moyens par r&#233;ponse indique que les r&#233;ponses sont en moyenne plus longues (de presque deux mots)
&#224; l&#8217;&#233;crit qu&#8217;&#224; l&#8217;oral. Plus pr&#233;cisement, dans deux tiers des cas, les r&#233;ponses &#224; une m&#234;me question sont plus
longues &#224; l&#8217;&#233;crit qu&#8217;&#224; l&#8217;oral.
Contrairement au caract&#232;re &#233;crit ou oral de l&#8217;interaction qui sont deux modalit&#233;s qui s&#8217;excluent mutuelle-
ment, la nature ouverte ou ferm&#233;e des questions a &#233;t&#233; test&#233;e au cours de m&#234;me passations : tous les partici-
pants (152) ont r&#233;pondu &#224; des questions ouvertes et &#224; des questions ferm&#233;es. Les formulations de questions
ferm&#233;es selon le mod&#232;le de variation de la question utilis&#233; sont moins nombreuses que les formulations de
questions ouvertes ce qui explique qu&#8217;on ait plus du double de questions ouvertes que de ferm&#233;es (et donc
plus du double de r&#233;ponses dans le sous-corpus &quot;ouvert&quot; que dans le sous-corpus &quot;ferm&#233;&quot;). On note que
les r&#233;ponses aux questions ouvertes sont en moyenne plus longues que celles aux questions ferm&#233;es : un
nombre de mot moyen de 8,54 pour les r&#233;ponses &#224; des questions ouvertes et de 6,93 pour les r&#233;ponses &#224;
des questions ferm&#233;es (voir tableau 1).
</p>
<p>3 &#201;tude des r&#233;ponses
</p>
<p>L&#8217;&#233;tude que nous avons men&#233;e sur ce corpus s&#8217;articule en 3 axes.
&#192; travers l&#8217;observation des couples question-r&#233;ponse, nous cherchons tout d&#8217;abord &#224; savoir si les r&#233;ponses
r&#233;utilisent les termes de la question ou pas. Les r&#233;ponses r&#233;p&#232;tent-elles le focus, le verbe, ... de la question
ou bien les reprennent-elles par un pronom, un synonyme ? Pour un syst&#232;me de question-r&#233;ponse, il s&#8217;agit</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>de savoir comment un feed-back sur la compr&#233;hension de la question peut &#234;tre donn&#233; et plus pr&#233;cis&#233;ment
de travailler sur la r&#233;alisation lexicale de la r&#233;ponse &#224; g&#233;n&#233;rer.
Notre second axe concerne l&#8217;information r&#233;pondue en elle-m&#234;me : les syst&#232;mes de question-r&#233;ponse sont
&#233;valu&#233;s sur l&#8217;exactitude de la r&#233;ponse extraite. Cette r&#233;ponse, nous l&#8217;appelons information-r&#233;ponse. Dans
le corpus, nous avons ainsi observ&#233; la partie de la phrase-r&#233;ponse (nous utiliserons le mot r&#233;ponse) qui
correspond &#224; cette information-r&#233;ponse. La section 3.2 traite plus particuli&#232;rement de cet &#233;l&#233;ment dans la
r&#233;ponse.
Un dernier axe d&#8217;observations concerne les diff&#233;rentes formulations de r&#233;ponses possibles. Nous nous
attachons aux &#233;l&#233;ments de la question repris dans la r&#233;ponse et aux r&#233;ponses qui ne proposent qu&#8217;une
seule information-r&#233;ponse.
</p>
<p>3.1 Reprise de la question
</p>
<p>Nous avons observ&#233; quantitativement et qualitativement la fa&#231;on dont les r&#233;ponses reprennent les ques-
tions. Nos interrogations sont : reprendre des &#233;l&#233;ments est-il courant ou au contraire rare ? En cas de
reprise, qu&#8217;est-ce qui est repris et &#224; quelle fr&#233;quence ? La question est-elle reprise de la m&#234;me fa&#231;on &#224;
l&#8217;&#233;crit et &#224; l&#8217;oral ? Quelles formes prennent ces reprises ?
Pour r&#233;pondre &#224; ces diff&#233;rentes questions, nous avons annot&#233; manuellement &#224; la fois le corpus de questions
et le corpus de r&#233;ponses.
</p>
<p>Annotation du corpus de questions Le corpus de questions a &#233;t&#233; annot&#233; de fa&#231;on &#224; identifier les dif-
f&#233;rents &#233;l&#233;ments qui les composent. L&#8217;annotation porte sur : l&#8217;objet de la question ou focus, le verbe
principal, le type de r&#233;ponse attendu s&#8217;il est explicitement pr&#233;cis&#233; (comme c&#8217;est le cas dans la question
Q122 (figure 2)), les informations compl&#233;mentaires qui permettent de restreindre l&#8217;objet de la question ou
le cadre de validit&#233; de la r&#233;ponse (dans la question Q022 est pr&#233;cis&#233; que l&#8217;on recherche le poids d&#8217;un b&#233;b&#233;
&#224; sa naissance) ainsi que l&#8217;information-r&#233;ponse &#224; confirmer dans le cas d&#8217;une question ferm&#233;e (exemple
Q022). Nous entendons par objet de la question l&#8217;&#233;l&#233;ment sur lequel elle porte. Ainsi dans l&#8217;exemple
Q116, l&#8217;objet est &#8220;une feuille A4&#8221;.
</p>
<p>Les questions pos&#233;es sont des questions factuelles simples construites en faisant varier les caract&#233;ristiques
morphosyntaxiques de questions prototypiques de la forme &#8220;&lt;interrogatif&gt; &lt;verbe&gt; &lt;compl&#233;ment d&#8217;ob-
jet&gt; (&lt;information compl&#233;mentaire&gt;&#8221; ((Garcia-Fernandez et al., 2009)). L&#8217;objet de la question est donc
syst&#233;matiquement, dans l&#8217;&#233;tude pr&#233;sent&#233;e ici, son compl&#233;ment d&#8217;objet.
</p>
<p>Q116 : Combien &lt;verbe&gt; mesure &lt;/verbe&gt; &lt;objet&gt; une feuille A4 &lt;/objet&gt; ?
Q122 : &lt;objet&gt; Une feuille A4 &lt;/objet&gt; &lt;verbe&gt; mesure &lt;/verbe&gt; combien de &lt;type&gt; centim&#232;tres
</p>
<p>&lt;/type&gt; ?
Q129 : Je voudrais savoir quelle &lt;type&gt; taille &lt;/type&gt; &lt;verbe&gt; mesure &lt;/verbe&gt; &lt;objet&gt; une feuille A4
</p>
<p>&lt;/objet&gt;.
Q022 : Est-ce qu&#8217;&lt;objet&gt; un b&#233;b&#233; &lt;/objet&gt; &lt;verbe&gt; p&#232;se &lt;/verbe&gt; &lt;reprise-information-r&#233;ponse&gt; 3,2
</p>
<p>&lt;/reprise-information-r&#233;ponse&gt; &lt;type&gt; kilos &lt;/type&gt; &lt;Qcompletion&gt; &#224; la naissance &lt;/Qcompletion&gt; ?
FIG. 2 &#8211; Exemples d&#8217;annotation des questions
</p>
<p>Comme nous pouvons le voir dans les exemples de la figure 2, les marqueurs interrogatifs n&#8217;ont pas &#233;t&#233;
annot&#233;s : ce ne sont a priori pas des &#233;l&#233;ments susceptibles d&#8217;&#234;tre repris dans la r&#233;ponse.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comment formule-t-on une r&#233;ponse en langue naturelle ?
</p>
<p>Annotation du corpus des r&#233;ponses Le corpus des r&#233;ponses a lui aussi &#233;t&#233; annot&#233; afin de d&#233;tecter les
&#233;l&#233;ments de la r&#233;ponse qui correspondent &#224; une reprise. Pour la reprise de l&#8217;objet, trois cas ont &#233;t&#233; distin-
gu&#233;s : les reprises &#8220;exactes&#8221;, les reprises avec modification et les reprises par pronom. Sont consid&#233;r&#233;es
comme reprises exactes, les reprises qui comportent tous les termes de l&#8217;&#233;l&#233;ment dans la question y com-
pris si la forme est erron&#233;e, abr&#233;vi&#233;e, mal accentu&#233;e,... (&quot;bebe&quot;, &quot;Bb&quot; et &quot;b&#233;b &#233;&quot; sont consid&#233;r&#233;s comme
des reprises exactes de &quot;b&#233;b&#233;&quot;). Les reprises avec modification peuvent &#234;tre, comme nous le voyons dans
l&#8217;exemple A45 de la figure 3, des reprises de l&#8217;objet de fa&#231;on r&#233;duite : &#8220;une brique&#8221; au lieu de &#8220;une brique
de lait&#8221;. Les reprises par pronom (&#8220;elle p&#232;se 1kg&#8221;, &#8220;cela dure 5 ans&#8221;) ont &#233;t&#233; annot&#233;es sp&#233;cifiquement.
Nous soulignons le fait qu&#8217;une r&#233;ponse peut reprendre plusieurs fois un &#233;l&#233;ment de la question, notam-
ment son objet, et ce de diff&#233;rentes fa&#231;ons. Dans la r&#233;ponse A2280 (figure 3), les trois types de reprise de
l&#8217;objet sont pr&#233;sents simultan&#233;ment : reprise exacte, modifi&#233;e et par pronom.
</p>
<p>A45 : &lt;objet_modifi&#233;&gt; Une brique &lt;/objet_modifi&#233;&gt; de 1L doit &lt;verbe&gt; peser &lt;/verbe&gt; environ 1kg
(je ne suis pas s&#251;re).
A2280 : &lt;objet&gt; Une bouteille d&#8217;eau &lt;/objet&gt; contient du liquide. (...) Si &lt;objet_modifi&#233;&gt; la
bouteille &lt;/objet_modifi&#233;&gt; contient 1 litre, &lt;objet_pronom&gt; elle &lt;/objet_pronom&gt; &lt;verbe&gt; p&#232;sera
&lt;/verbe&gt; un kilo et ainsi de suite.
</p>
<p>FIG. 3 &#8211; Exemples d&#8217;annotation de la reprise de la question dans les r&#233;ponses
</p>
<p>Concernant le type, les diff&#233;rentes formes des unit&#233;s de mesure (par exemple &#8220;centim&#232;tre&#8221;, &#8220;cm&#8221;) sont
consid&#233;r&#233;es comme &#233;quivalentes.
On consid&#232;re qu&#8217;il y a reprise du verbe quelle que soit la forme qu&#8217;il prend (personne, temps, accompagn&#233;
d&#8217;un verbe modal...)
</p>
<p>Taux de reprise Le tableau 2 donne les pourcentages de reprise d&#8217;&#233;l&#233;ments de la question en fonction
du nombre effectif d&#8217;&#233;l&#233;ments pr&#233;sents dans les questions. Nous parlons de taux effectifs car si toutes
les questions comportent les &#233;l&#233;ments objet et verbe, seules certaines pr&#233;cisent un type, une information
compl&#233;mentaire ou une information-r&#233;ponse. Les pourcentages sont pr&#233;sent&#233;s pour l&#8217;ensemble du corpus
et pour deux partitions de celui-ci : un d&#233;coupage en fonction de la modalit&#233; d&#8217;interaction (oral ou bien
&#233;crit) et un d&#233;coupage en fonction de la nature ouverte ou ferm&#233;e de la question pos&#233;e.
Le tableau 3 d&#233;taille des diff&#233;rents types de reprises de l&#8217;objet de la question sur l&#8217;ensemble du corpus et
les deux partitions oral/&#233;crit, ouvert/ferm&#233;.
</p>
<p>&#201;l&#233;ment repris Tout Oral &#201;crit Q. ouvertes Q. ferm&#233;es
Tous 9.90% 11.69% 9.02% 12.61% 4.31%
Au moins 1 &#233;l&#233;ment 27.39% 29.23% 26.50% 30.87% 20.41%
Objet 22.54% 22.31% 22.65% 24.95% 17.76%
Verbe 15.79% 17.83% 14.78% 18.35% 10.59%
Type 14.51% 19.20% 12.08% 19.52% 5.60%
Information compl&#233;mentaire 11.79% 12.59% 11.27% 13.05% 9.36%
Information-r&#233;ponse 9.58% 13.26% 7.87% N.A. 9.58%
</p>
<p>TAB. 2 &#8211; Taux de reprise des &#233;l&#233;ments de la question dans les r&#233;ponses
</p>
<p>Presque 10% des r&#233;ponses reprennent l&#8217;ensemble des &#233;l&#233;ments de la question et pr&#232;s de 30% en reprennent
au moins un &#233;l&#233;ment. On observe que les &#233;l&#233;ments les plus repris sont l&#8217;objet, le verbe et le type de la
question. Pr&#232;s d&#8217;une r&#233;ponse sur cinq reprend au moins une fois l&#8217;objet de la question de fa&#231;on modi-
fi&#233;e ou non. Parmi ces reprises (tableau 3), 63% reprennent l&#8217;objet de la question exactement tandis que</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>Tout Oral &#201;crit Q. ouvertes Q. ferm&#233;es
Parmi les r&#233;ponses qui reprennent l&#8217;objet... 22.54% 22.31% 22.65% 24.95% 17.76%
ont au moins une reprise exacte 62.48% 67.24% 60.16% 66.28% 51.38%
ont au moins une reprise avec modification 16.11% 14.41% 16.94% 16.66% 14.36%
ne le reprennent que par un pronom 23.39% 18.77% 25.63% 19.15% 35.91%
</p>
<p>TAB. 3 &#8211; D&#233;tails des reprises de l&#8217;objet de la question
</p>
<p>19% reprennent l&#8217;objet de la question uniquement par un pronom. On observe que les reprises modifi&#233;es
consistent &#224; r&#233;duire l&#8217;objet de la question &#224; sa t&#234;te de syntagme, les &#233;ventuels modificateurs &#233;tant omis
(exemple A2691 o&#249; &quot;une brique de lait&quot; est repris par &quot;la brique&quot;) ou au terme s&#233;mantiquement le plus
important (exemple A862 o&#249; &quot;Le mois de f&#233;vrier&quot; est repris par &quot;F&#233;vrier&quot;).
</p>
<p>A2691 : Cela d&#233;pend de la contenance de &lt;objet_modifi&#233;&gt; la brique &lt;/objet_modifi&#233;&gt; (...)
A862 : &lt;objet_modifi&#233;&gt; F&#233;vrier &lt;/objet_modifi&#233;&gt; &lt;verbe&gt; dure &lt;/verbe&gt; en g&#233;n&#233;ral 28 jours. (...)
</p>
<p>FIG. 4 &#8211; Exemples de reprise avec modification de l&#8217;objet de la question
</p>
<p>Parmi les r&#233;ponses qui ne reprennent aucun &#233;l&#233;ment de la question, nous avons comptabilis&#233; les r&#233;ponses
qui ne sont constitu&#233;es que d&#8217;une information-r&#233;ponse &#224; la question : elles sont au nombre de 1413 soit
60% des r&#233;ponses qui ne reprennent aucun &#233;l&#233;ment de la question.
En observant les diff&#233;rents sous-corpus, on note qu&#8217;il y a plus de reprise &#224; l&#8217;oral qu&#8217;&#224; l&#8217;&#233;crit et en r&#233;ponse
aux questions ouvertes qu&#8217;aux questions ferm&#233;es La proportion de r&#233;ponses orales est la m&#234;me dans les
corpus ferm&#233; et ouvert. De m&#234;me, la proportion de r&#233;ponses aux questions ouvertes est identique dans les
corpus oral et &#233;crit (environ 32%).
C&#8217;est en r&#233;ponse aux questions ferm&#233;es qu&#8217;il y a le moins de reprise. Notamment, peu de r&#233;ponses re-
prennent le type pr&#233;cis&#233; dans la question. La reprise de l&#8217;objet de la question par un pronom se fait plus
souvent &#224; l&#8217;&#233;crit qu&#8217;&#224; l&#8217;oral et pour les r&#233;ponses &#224; des questions ferm&#233;es que celles &#224; des questions ou-
vertes.
Il est int&#233;ressant d&#8217;observer que bien qu&#8217;une question ferm&#233;e n&#8217;attend a priori qu&#8217;une courte r&#233;ponse qui
infirme ou valide, l&#8217;objet de la question et le verbe sont repris dans respectivement 17 et 10 % des r&#233;ponses.
Concernant l&#8217;opposition oral/&#233;crit, on voit qu&#8217;en g&#233;n&#233;ral il y a plus de reprises &#224; l&#8217;oral qu&#8217;&#224; l&#8217;&#233;crit. Nous
l&#8217;expliquons de deux fa&#231;ons. D&#8217;une part, le canal de communication est plus facilement bruit&#233; &#224; l&#8217;oral qu&#8217;&#224;
l&#8217;&#233;crit. D&#8217;autre part la question n&#8217;est jamais r&#233;p&#233;t&#233;e &#224; l&#8217;oral (alors qu&#8217;&#224; l&#8217;&#233;crit, elle reste affich&#233;e &#224; l&#8217;&#233;cran).
On peut interpr&#233;ter ces reprises comme une confirmation de sa propre compr&#233;hension de la question et/ou
comme le fait de rendre la r&#233;ponse donn&#233;e plus compr&#233;hensible &#224; son interlocuteur.
</p>
<p>Les informations compl&#233;mentaires des questions sont des &#233;l&#233;ments restrictifs qui servent &#224; limiter l&#8217;ambi-
gu&#239;t&#233; de la question, &#224; pr&#233;ciser le focus de la question. Par exemple, lorsqu&#8217;une question porte sur le poids
d&#8217;un b&#233;b&#233;, il est pr&#233;cis&#233; qu&#8217;il s&#8217;agit de son poids &#224; la naissance. Nous observons que dans les r&#233;ponses du
corpus, ces &#233;l&#233;ments sont moins repris que les autres &#233;l&#233;ments de la question.
</p>
<p>Synth&#232;se L&#8217;un des &#233;l&#233;ments de la question est repris dans une r&#233;ponse sur trois et 10% des r&#233;ponses
reprennent enti&#232;rement la question : ce ph&#233;nom&#232;ne n&#8217;est donc absolument pas marginal.
On observe que l&#8217;objet, le verbe et le type de la question sont les &#233;l&#233;ments les plus repris et ce quelle que
soit la modalit&#233; d&#8217;interaction. La plupart des reprises de l&#8217;objet sont des reprises exactes mais les reprises
par pronom sont aussi possibles (notamment &#224; l&#8217;&#233;crit et en r&#233;ponse aux questions ferm&#233;es). Les reprises</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comment formule-t-on une r&#233;ponse en langue naturelle ?
</p>
<p>avec modification consistent en une r&#233;duction de l&#8217;objet au mot le plus porteur de sens.
Les r&#233;ponses aux questions ferm&#233;es se distinguent par leur plus faibles taux de reprise : l&#8217;objet est repris
dans 17% des r&#233;ponses mais tous les autres &#233;l&#233;ments ne sont repris que dans une r&#233;ponse sur dix.
</p>
<p>Tous les syst&#232;mes de question-r&#233;ponse analysent d&#8217;une fa&#231;on ou d&#8217;une autre la question. Ils peuvent d&#233;-
tecter entre autres le focus, le verbe principal et le type, s&#8217;il est pr&#233;cis&#233;, de la question. Une r&#233;ponse-phrase
possible peut donc &#234;tre compos&#233;e de ces trois &#233;l&#233;ments d&#232;s lors que la r&#233;ponse est ouverte. Pour les ques-
tions ferm&#233;es, l&#8217;objet de la question peut constituer une base pour la formulation d&#8217;une phrase-r&#233;ponse.
Pour produire de telles r&#233;ponses, il faut bien &#233;videmment d&#233;terminer d&#8217;autres &#233;l&#233;ments : quelle structure
syntaxique ? quelle information-r&#233;ponse ? Dans la section suivante, nous nous int&#233;ressons plus particuli&#232;-
rement &#224; cette information-r&#233;ponse.
</p>
<p>3.2 L&#8217;information-r&#233;ponse
</p>
<p>Donner une r&#233;ponse &#224; une question va beaucoup plus loin que r&#233;pondre une nouvelle information qui
correspond &#224; ce qui est mis en cause par la question. Comme nous l&#8217;avons vu dans la section pr&#233;c&#233;dente,
reprendre des &#233;l&#233;ments de la question est un ph&#233;nom&#232;ne fr&#233;quent, ce qui laisse supposer qu&#8217;un retour
d&#8217;information sur ce qui a &#233;t&#233; compris de la question est essentiel.
</p>
<p>Du point de vue des syst&#232;mes de question-r&#233;ponse, l&#8217;un des &#233;l&#233;ments &#233;valu&#233; est l&#8217;information extraite des
documents. Il peut s&#8217;agir d&#8217;une r&#233;ponse pr&#233;cise de peu de mots, souvent une entit&#233; nomm&#233;e ou assimil&#233;e,
ou encore une liste de mots1 (TREC, site Web). Face &#224; des r&#233;ponses spontan&#233;es comme celles de notre
corpus, la d&#233;finition de cette information-r&#233;ponse est primordiale.
</p>
<p>Ici, notre but est d&#8217;annoter la ou les informations qui sont une information nouvelle (par rapport &#224; celles
contenues dans la question) et correspondent soit au type attendu de la r&#233;ponse, soit &#224; un aveu d&#8217;incomp&#233;-
tence (nous parlerons de r&#233;ponse &#224; valence n&#233;gative : &quot;je ne sais pas&quot; par exemple).
Les informations suppl&#233;mentaires sur le cadre de validit&#233; de la r&#233;ponse (par exemple &quot;les ann&#233;es bissex-
tiles&quot; dans l&#8217;exemple A60) ne font pas partie de l&#8217;information-r&#233;ponse.
Dans le cas des r&#233;ponses &#224; des questions ferm&#233;es, l&#8217;&#233;l&#233;ment annot&#233; est le premier qui exprime une infir-
mation ou une confirmation de la question.
</p>
<p>La figure 5 pr&#233;sente des exemples d&#8217;annotation que nous discutons &#224; pr&#233;sent.
La valeur des r&#233;ponses et le fait qu&#8217;il s&#8217;agissent bel et bien d&#8217;une bonne r&#233;ponse ou pas d&#233;pend de la
connaissance du monde du participant. Nous ne nous attacherons pas &#224; les commenter.
Certaines r&#233;ponses du corpus contiennent plus d&#8217;une information-r&#233;ponse (exemple A2766 figure 5).
Que ce soit une r&#233;ponse &#224; une question ouverte ou ferm&#233;e, dans le cas des r&#233;ponses &#224; valence n&#233;gative
(exemple A2480 figure 5), l&#8217;information-r&#233;ponse se r&#233;alise en g&#233;n&#233;ral par une expression fig&#233;e ou semi-
fig&#233;e telle que &#8220;je n&#8217;en sais pas grand chose&#8221;, &#8220;je sais pas&#8221;, &#8220;je ne connais pas&#8221;,...
Dans le cas des r&#233;ponses &#224; valence positive, les r&#233;ponses aux questions ouvertes et ferm&#233;es ne prennent pas
la m&#234;me forme. Pour les r&#233;ponses &#224; des questions ouvertes, l&#8217;information-r&#233;ponse est une entit&#233; nomm&#233;e :
nom de ville, mus&#233;e, a&#233;roport,... pour les questions de lieu, date, mois, ann&#233;e... pour les questions de temps
et valeur accompagn&#233;e ou non d&#8217;une unit&#233; de mesure pour les questions de quantit&#233;. Ces informations-
r&#233;ponse peuvent aussi contenir des modifieurs comme on peut le voir dans l&#8217;exemple A1938 de la figure 5.
Une r&#233;ponse &#224; valence positive &#224; une question ferm&#233;e peut &#234;tre un adverbe ou une expression : &#8220;oui&#8221;,&#8220;en
</p>
<p>1Nous parlons ici de r&#233;ponses &#224; des questions factuelles uniquement</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>effet&#8221;, &#8220;non&#8221;,... (exemple A665 figure 5). Mais il peut aussi s&#8217;agir d&#8217;une reformulation sous forme d&#233;-
clarative de la question (exemple A2499). Plus pr&#233;cis&#233;ment, on distingue diff&#233;rents cas. On observe des
affirmations qui reprennent l&#8217;information-r&#233;ponse propos&#233;e dans la question et confirment ainsi la ques-
tion (exemple A2499). On observe des phrases n&#233;gatives qui elles aussi reprennent l&#8217;information-r&#233;ponse
de la question, infirmant ainsi la question (exemple A2608 figure 5).
</p>
<p>On observe aussi des affirmations au sein desquelles l&#8217;information-r&#233;ponse de la question est substitu&#233;e
par une autre information-r&#233;ponse (exemple A1353 figure 5).
</p>
<p>A2766 : la V&#233;nus de Milo se trouve &lt;information-r&#233;ponse&gt; en France &lt;/information-r&#233;ponse&gt;
notamment &lt;information-r&#233;ponse&gt; &#224; paris &lt;/information-r&#233;ponse&gt;,&lt;information-r&#233;ponse&gt; au Louvre
&lt;/information-r&#233;ponse&gt;.
A2480 : &lt;information-r&#233;ponse&gt; je n&#8217;en ai aucune id&#233;e &lt;/information-r&#233;ponse&gt;
A1938 : un mois de f&#233;vrier dure &lt;information-r&#233;ponse&gt; &#224; peu pr&#232;s 28 jours &lt;/information-r&#233;ponse&gt;
A60 : &lt;information-r&#233;ponse&gt; 28 jours &lt;/information-r&#233;ponse&gt; les ann&#233;es bissextiles, &lt;information-
r&#233;ponse&gt; 29 jours &lt;/information-r&#233;ponse&gt; les autres
A665 : &lt;information-r&#233;ponse&gt; oui &lt;/information-r&#233;ponse&gt;, il dure effectivement 5 ans en France
A2499 : Elle &lt;information-r&#233;ponse&gt; a bien &#233;t&#233; sign&#233;e &lt;/information-r&#233;ponse&gt; &#224; cette date
A2608 : Le Rh&#244;ne &lt;information-r&#233;ponse&gt; ne fini pas &lt;/information-r&#233;ponse&gt; dans le delta de la Ca-
margue
Q061 : Le poids d&#8217;une bouteille d&#8217;eau est de 2 kilos ?
A1353 : le poids d&#8217;une bouteille d&#8217;eau de 1 litre est de &lt;information-r&#233;ponse&gt; 1 kilo environ
&lt;/information-r&#233;ponse&gt; (...)
</p>
<p>FIG. 5 &#8211; Exemples d&#8217;annotation de l&#8217;information-r&#233;ponse dans les r&#233;ponses
</p>
<p>3.3 Formulations des r&#233;ponses
</p>
<p>Nous avons observ&#233; dans la section pr&#233;c&#233;dente la forme que peut prendre une information-r&#233;ponse. Nous
avions vu dans la section 3.1 comment les r&#233;ponses reprennent des &#233;l&#233;ments de la question. &#192; pr&#233;sent,
nous proposons d&#8217;&#233;tudier comment ces &#233;l&#233;ments s&#8217;articulent entre eux.
</p>
<p>Nous avons cr&#233;&#233; pour chaque r&#233;ponse son patron. Il s&#8217;agit d&#8217;une forme r&#233;duite de la r&#233;ponse dans laquelle
les &#233;l&#233;ments de reprise de la question sont remplac&#233;s par le nom de l&#8217;&#233;l&#233;ment repris, l&#8217;information-r&#233;ponse
est substitu&#233;e par le terme &quot;information-r&#233;ponse&quot; et les autres &#233;l&#233;ments de la r&#233;ponse sont supprim&#233;s.
L&#8217;exemple 6 montre en quoi consiste cette r&#233;duction.
</p>
<p>A2212 : Si tout se passe bien, &lt;objet&gt;une grossesse&lt;/objet&gt; &lt;verbe&gt;dure&lt;/verbe&gt; &lt;information-
r&#233;ponse&gt;aux environ de 9 mois&lt;/information-r&#233;ponse&gt;. Il se peut qu&#8217;elle soit plus courte.
A2212 r&#233;duite : objet verbe information-reponse
</p>
<p>FIG. 6 &#8211; Exemple de patron de r&#233;ponse
</p>
<p>Nous avons observ&#233; les diff&#233;rents patrons de r&#233;ponse du corpus et des sous-corpus oral/&#233;crit, ouvert/ferm&#233;
pour les r&#233;ponses qui ne proposent qu&#8217;une unique information-r&#233;ponse. Le tableau 4 pr&#233;sente les patrons
de r&#233;ponse les plus fr&#233;quents dans l&#8217;ensemble du corpus et leurs effectifs dans chacun des sous-corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Comment formule-t-on une r&#233;ponse en langue naturelle ?
</p>
<p>Tout Oral &#201;crit Q.ouvertes Q.ferm&#233;es
info-rep 2100 711 1389 1315 785
</p>
<p>objet verbe info-rep 147 54 93 143 4
objet_pronom verbe info-rep 56 20 36 52 4
</p>
<p>objet info-rep 44 11 33 40 4
objet_modifi&#233; verbe info-rep 23 8 15 22 1
</p>
<p>objet verbe info-rep Qcompletion 22 11 11 20 2
objet_pronom info-rep 17 2 15 16 1
objet_modifi&#233; info-rep 10 2 8 8 2
</p>
<p>verbe info-rep 9 3 6 7 2
objet_pronom info-rep reprise-info-rep 7 3 4 0 7
</p>
<p>objet info-rep reprise-info-rep 7 2 5 0 7
objet Qcompletion verbe info-rep 7 3 4 7 0
</p>
<p>info-rep reprise-info-rep 6 1 5 0 6
Qcompletion objet verbe info-rep 6 3 3 6 0
</p>
<p>objet objet_pronom verbe info-rep 4 1 3 4 0
info-rep objet reprise-info-rep 3 0 3 0 3
</p>
<p>TAB. 4 &#8211; Patrons de r&#233;ponses les plus fr&#233;quents. Avec info-rep pour information-r&#233;ponse et reprise-info-rep pour reprise-
information-r&#233;ponse.
</p>
<p>Nous observons les diff&#233;rentes formulations de r&#233;ponse pr&#233;sentes dans le corpus. L&#8217;ordre des &#233;l&#233;ments
est assez fig&#233; : objet verbe information-r&#233;ponse. Seule la reprise des informations compl&#233;mentaires de la
question peut se faire tant avant l&#8217;information-r&#233;ponse qu&#8217;apr&#232;s. On observe que certains patrons ne sont
valables que pour les questions ouvertes et d&#8217;autres uniquement pour les questions ferm&#233;es. En revanche,
on n&#8217;observe pas de telle diff&#233;rence entre l&#8217;oral et l&#8217;&#233;crit.
Si ces patrons donnent une id&#233;e sur l&#8217;ordre d&#8217;apparition des &#233;l&#233;ments de reprise de la question et l&#8217;information-
r&#233;ponse, ils sont peu repr&#233;sentatifs de la forme syntaxique de la r&#233;ponse qui comporte des marques d&#8217;h&#233;-
sitation, des connecteurs,... Cependant, ces patrons sont int&#233;ressants dans l&#8217;optique de donner une r&#233;ponse
en langue naturelle minimale qui ne demande pas de traitement ou de connaissances suppl&#233;mentaires &#224;
celles qu&#8217;ont d&#233;j&#224; les syst&#232;mes de question-r&#233;ponse : d&#8217;une part une analyse de la question mettant en
valeur son focus, son verbe principal et les &#233;ventuels &#233;l&#233;ments compl&#233;mentaires, d&#8217;autre part la recherche
d&#8217;une information-r&#233;ponse. Un syst&#232;me de question-r&#233;ponse peut s&#8217;inspirer des diff&#233;rents patrons ici mis
en &#233;vidence pour construire une &#8220;phrase-r&#233;ponse&#8221; sans se limiter &#224; retourner l&#8217;information-r&#233;ponse seule.
</p>
<p>4 Discussion et conclusion
</p>
<p>Nous avons montr&#233; que les r&#233;ponses du corpus reprennent les &#233;l&#233;ments de la question et en particulier
l&#8217;objet, le verbe et le type et ce, que l&#8217;interaction soit orale ou &#233;crite. D&#8217;une mani&#232;re g&#233;n&#233;rale, il y a moins
de reprise en r&#233;ponse aux questions ferm&#233;es qu&#8217;aux questions ouvertes. D&#8217;autre part, l&#8217;objet est plus sou-
vent repris par un pronom &#224; l&#8217;&#233;crit qu&#8217;&#224; l&#8217;oral.
Nous avons d&#233;fini l&#8217;information-r&#233;ponse comme l&#8217;&#233;l&#233;ment qui soit apporte une r&#233;ponse &#224; la question, soit
exprime un aveu d&#8217;incomp&#233;tence. Cette information-r&#233;ponse rev&#234;t diff&#233;rentes formes en fonction de la
nature ferm&#233;e ou ouverte de la question.
Nous avons r&#233;duit les r&#233;ponses &#224; leurs &#233;l&#233;ments de reprise de la question et &#224; l&#8217;information-r&#233;ponse et
avons montr&#233; les patrons de r&#233;ponse pr&#233;sents dans le corpus. Il ne s&#8217;agit pas de patrons syntaxiques mais</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Anne Garcia-Fernandez, Sophie Rosset, Anne Vilnat
</p>
<p>ils peuvent &#234;tre utilis&#233;s pour d&#233;terminer le Quoi dire et effectuer certains choix lexicaux dans la phase de
g&#233;n&#233;ration de r&#233;ponse en langue naturelle et ce, quel que soit le syst&#232;me de question-r&#233;ponse.
Nous avons mis de c&#244;t&#233; les r&#233;ponses comportant plus d&#8217;une information-r&#233;ponse. Il serait int&#233;ressant d&#8217;ob-
server ces cas particuliers (19% des r&#233;ponses) et de d&#233;terminer le rapport qui existe entre ces informations-
r&#233;ponse : modification de la granularit&#233;, reformulation, validit&#233; diff&#233;rente,... D&#8217;autre part, nous avons
ignor&#233;, dans les r&#233;ponses, les &#233;l&#233;ments autres que les reprises de la question et l&#8217;information-r&#233;ponse.
Une &#233;tude plus fine est d&#8217;ores et d&#233;j&#224; en cours. nous cherchons &#224; mettre en valeur les structures syn-
taxiques des r&#233;ponses du corpus.
Du point de vue de l&#8217;int&#233;gration &#224; un syst&#232;me de question-r&#233;ponse, la construction d&#8217;une phrase-r&#233;ponse
minimale suivant les patrons mis en valeur dans la section 6 peut constituer les bases d&#8217;un premier module
de g&#233;n&#233;ration de r&#233;ponses en interaction en langue naturelle.
Enfin nous envisageons une &#233;valuation type &#8220;satisfaction utilisateur&#8221; qui permettra une observation, non
plus de la production de r&#233;ponses, mais de leur perception.
</p>
<p>Remerciements Ce travail a &#233;t&#233; partiellement financ&#233; par OSEO par le biais du programme Quaero.
</p>
<p>R&#233;f&#233;rences
</p>
<p>GARCIA-FERNANDEZ A., ROSSET S. &amp; VILNAT A. (2009). Collecte et analyses de r&#233;ponses naturelles
pour les syst&#232;mes de questions-r&#233;ponses. In Actes de TALN 2009.
GARCIA-FERNANDEZ A., ROSSET S. &amp; VILNAT A. (2010). MACAQ : A multi annotated corpus
to study how we adapt answersto various questions. In Proceedings of the Seventh International Lan-
guage Resources and Evaluation (LREC&#8217;10), Valletta, Malta : European Language Resources Associa-
tion (ELRA). http ://www.lrec-conf.org/proceedings/lrec2010/.
GREEN N. &amp; CARBERRY S. (1999). A computational mechanism for initiative in answer generation.
User Modeling and User-Adapted Interaction, 9(1), 93&#8211;132.
HIGASHINAKA R., PRASAD R. &amp; WALKER M. A. (2006). Learning to generate naturalistic utterances
using reviews in spoken dialogue systems. In ACL-44 : Proceedings of the 21st International Confe-
rence on Computational Linguistics and the 44th annual meeting of the Association for Computational
Linguistics, p. 265&#8211;272, Morristown, NJ, USA : Association for Computational Linguistics.
LAMEL L., ROSSET S., GAUVAIN J.-L., BENNACEF S., GARNIER-RIZET M. &amp; PROUTS B. (2000).
The limsi arise system. Speech Communication, 31(4), 339&#8211;354.
LUZZATI D. (2006). Essai de description interactive : l&#8217;exemple des questions quantificatrices. Colloque
La quantification, 1, 15.
PLAMONDON L., LAPALME G. &amp; KOSSEIM L. (2002). The quantum question answering system at trec-
11. In E. M. VORHEES &amp; D. K. HARMAN, Eds., Proceedings of the Eleventh Text Retrieval Conference
(TREC-2002), p. 750&#8211;757, Gaithersburg, Maryland : NIST.
SOUBBOTIN M. M. &amp; SOUBBOTIN S. M. (2001). Patterns of potential answer expressions as clues to
the right answers. In In Proceedings of the Tenth Text REtrieval Conference (TREC 10), p. 293&#8211;302.
TREC (site Web). Text REtrieval Conference. http ://trec.nist.gov/.
VAN HOOIJDONK C., KRAHMER E., MAES A., THEUNE M. &amp; BOSMA W. (2008). Production and
evaluation of (multimodal) answers to medical questions. In EARLI SIG2 - 2008 Conference on Com-
prehension of Text and Graphics, p. 72&#8211;76, Tilburg, The Netherlands.</p>

</div></div>
</body></html>