<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;tection et r&#233;solution d&#8217;entit&#233;s nomm&#233;es dans des d&#233;p&#234;ches d&#8217;agence</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>D&#233;tection et r&#233;solution d&#8217;entit&#233;s nomm&#233;es
dans des d&#233;p&#234;ches d&#8217;agence
</p>
<p>Rosa Stern1,2 &amp; Beno&#238;t Sagot1
</p>
<p>1. Alpage, INRIA Paris&#8211;Rocquencourt &amp; Universit&#233; Paris 7
Rocquencourt, BP 105, 78153 Le Chesnay Cedex, France
</p>
<p>2. Agence France-Presse &#8211; Medialab, 2 place de la Bourse, 75002 Paris, France
rosa.stern@afp.com, benoit.sagot@inria.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons NP, un syst&#232;me de reconnaissance d&#8217;entit&#233;s nomm&#233;es. Comprenant un
module de r&#233;solution, il permet d&#8217;associer &#224; chaque occurrence d&#8217;entit&#233; le r&#233;f&#233;rent qu&#8217;elle d&#233;signe parmi
les entr&#233;es d&#8217;un r&#233;f&#233;rentiel d&#233;di&#233;. NP apporte ainsi des informations pertinentes pour l&#8217;exploitation de
l&#8217;extraction d&#8217;entit&#233;s nomm&#233;es en contexte applicatif. Ce syst&#232;me fait l&#8217;objet d&#8217;une &#233;valuation gr&#226;ce au
d&#233;veloppement d&#8217;un corpus annot&#233; manuellement et adapt&#233; aux t&#226;ches de d&#233;tection et de r&#233;solution.
</p>
<p>Abstract. We introduce NP, a system for named entity recognition. It includes a resolution module
for linking each entity occurrence to its matching entry in a dedicated reference base. NP thus brings
information relevant for using named entity extraction in an applicative context. We have evaluated NP by
the means of a manually annotated corpus designed for the tasks of recognition and resolution.
</p>
<p>Mots-cl&#233;s : r&#233;solution d&#8217;entit&#233;s nomm&#233;es, d&#233;tection d&#8217;entit&#233;s nomm&#233;es, extraction d&#8217;information.
</p>
<p>Keywords: named entity resolution, named entity recognition, information extraction.
</p>
<p>1 Introduction
</p>
<p>Dans le cadre d&#8217;applications utilisant l&#8217;extraction d&#8217;informations, la d&#233;tection de segments de texte cor-
respondant &#224; des entit&#233;s nomm&#233;es (EN), c&#8217;est-&#224;-dire des mentions de noms de personnes, de lieux ou
d&#8217;organisations notamment, n&#8217;est pas en elle-m&#234;me suffisante. Seul un syst&#232;me permettant d&#8217;associer &#224;
ces mentions un r&#233;f&#233;rent extra-linguistique permet d&#8217;exploiter le r&#233;sultat de la d&#233;tection gr&#226;ce au sens qui
lui est ainsi conf&#233;r&#233; (Blume, 2005). Comme l&#8217;expose en effet avec pr&#233;cision (Ehrmann, 2008), le fonction-
nement r&#233;f&#233;rentiel des EN constitue une de leurs caract&#233;ristiques d&#233;finitoires. Cette t&#226;che dite de r&#233;solution
des EN (REN) consiste ainsi &#224; associer &#224; chaque mention d&#8217;EN l&#8217;entr&#233;e ad&#233;quate dans un r&#233;f&#233;rentiel d&#233;di&#233;.
</p>
<p>Retrouver le r&#233;f&#233;rent correspondant &#224; une mention pose le probl&#232;me de la polys&#233;mie des EN. Comme
le rappelle &#233;galement (Ehrmann, 2008), l&#8217;homonymie (la ville d&#8217;Orange et l&#8217;entreprise Orange) et la
m&#233;tonymie (la France en tant qu&#8217;entit&#233; g&#233;ographique vs. en tant qu&#8217;organisation dans La France a gagn&#233;
la coupe du monde de football) peuvent en &#234;tre &#224; l&#8217;origine. A cette difficult&#233; s&#8217;ajoute celle des diff&#233;rentes
variantes qui g&#233;n&#232;rent une synonymie entre plusieurs mentions se rapportant au m&#234;me r&#233;f&#233;rent (variantes
graphiques : Jacques Chirac et J. Chirac ou surnoms : Ali le chimique pour Ali Hassan al-Majid). Ainsi, la
REN ne peut donc pas s&#8217;appuyer sur une correspondance biunivoque entre mention et entr&#233;e du r&#233;f&#233;rentiel.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ROSA STERN &amp; BENO&#206;T SAGOT
</p>
<p>Nous proposons un syst&#232;me de d&#233;tection et de r&#233;solution des EN pour le fran&#231;ais d&#233;ploy&#233; dans un contexte
applicatif que nous pr&#233;sentons &#224; la section 2. Nous d&#233;crivons ensuite le syst&#232;me lui-m&#234;me ainsi que les
ressources sur lesquelles il repose (section 3). Nous avons constitu&#233; manuellement un corpus annot&#233; (sec-
tion 4) qui nous permet d&#8217;&#233;valuer notre syst&#232;me sur les t&#226;ches de d&#233;tection et de REN de fa&#231;on int&#233;gr&#233;e.
Les r&#233;sultats de cette &#233;valuation sont d&#233;taill&#233;s &#224; la section 5.
</p>
<p>2 Contexte d&#8217;application
</p>
<p>La production d&#8217;une agence de presse &#8212; dans notre cas, l&#8217;Agence France Presse (AFP) &#8212; consiste en
un flux de donn&#233;es, sous forme de texte mais &#233;galement de documents multimedia (photo, video, info-
graphie) dont le contenu est informatif &#224; plusieurs niveaux : le traitement des &#233;v&#233;nements m&#233;diatiques est
doubl&#233; d&#8217;un ensemble de connaissances relatives &#224; ces &#233;v&#233;nements. Ces connaissances sont en premier
lieu des EN, dont les r&#233;f&#233;rents sont les acteurs principaux des &#233;v&#233;nements rapport&#233;s. Les lieux, personnes
et organisations mentionn&#233;s dans les d&#233;p&#234;ches constituent donc des m&#233;tadonn&#233;es dont la collecte permet
d&#8217;am&#233;liorer un certain nombre d&#8217;applications de traitement de l&#8217;information : indexation des d&#233;p&#234;ches,
filtrage de la production suivant des crit&#232;res propres aux utilisateurs, t&#226;ches de documentation aid&#233;es par
la recherche d&#8217;information. Or les EN deviennent des m&#233;tadonn&#233;es pertinentes lorsque leur statut r&#233;f&#233;ren-
tiel est r&#233;alis&#233;, c&#8217;est-&#224;-dire quand il est possible d&#8217;acc&#233;der &#224; un ensemble d&#8217;informations les concernant et
non uniquement &#224; leur mention textuelle. Dans ce contexte, un syst&#232;me ne se limitant pas &#224; d&#233;tecter des
mentions d&#8217;EN est particuli&#232;rement utile : il permet de rendre ces EN signifiantes gr&#226;ce &#224; l&#8217;identification
du r&#233;f&#233;rent vers lequel elles pointent.
</p>
<p>La production de l&#8217;AFP &#233;tant g&#233;n&#233;raliste, sa couverture en termes de sujets et domaines est tr&#232;s large ;
les EN employ&#233;es correspondent donc &#224; des r&#233;f&#233;rences aussi nombreuses que vari&#233;es : sur les 300 000
d&#233;p&#234;ches en fran&#231;ais de 2009, plus de 3 millions de mentions correspondant &#224; environ 150 000 r&#233;f&#233;rences
diff&#233;rentes ont &#233;t&#233; d&#233;tect&#233;es par le syst&#232;me pr&#233;sent&#233; &#224; la section 3. Le d&#233;ploiement de ce syst&#232;me de REN
doit ainsi tenir compte du grand nombre et de la vari&#233;t&#233; d&#8217;EN qui seront potentiellement &#224; d&#233;tecter puis
&#224; r&#233;soudre au fil de la production. Cela implique qu&#8217;il s&#8217;appuie sur des ressources &#224; la fois importantes et
non sp&#233;cialis&#233;es, comme l&#8217;explique la section 3. Mais ces ressources ne sont pas les seuls ensembles de
r&#233;f&#233;rences utilis&#233;s dans la mise en &#339;uvre de la REN. Un r&#233;f&#233;rentiel est en effet d&#233;velopp&#233; parall&#232;lement
afin de centraliser et de structurer les connaissances repr&#233;sentatives du m&#233;tier de l&#8217;Agence. Ce r&#233;f&#233;rentiel
est bas&#233; sur une ontologie rendant compte du mod&#232;le de repr&#233;sentation de ces connaissances et dont les
instances sont des EN. L&#8217;instanciation d&#8217;une EN dans ce r&#233;f&#233;rentiel se fait si l&#8217;on reconna&#238;t &#224; l&#8217;entit&#233; en
question un statut pertinent pour la description des connaissances de l&#8217;Agence.
</p>
<p>L&#8217;interaction entre le syst&#232;me de REN et la production de d&#233;p&#234;ches est donc double : il s&#8217;agit d&#8217;une
part de r&#233;soudre les mentions d&#8217;EN d&#233;tect&#233;es au fil des textes en regard des ressources r&#233;f&#233;rentielles
employ&#233;es par ce syst&#232;me, et d&#8217;autre part d&#8217;op&#233;rer cette r&#233;solution en correspondance avec les instances
du r&#233;f&#233;rentiel existant. Ce second point implique que les r&#233;sultats de la REN sont potentiellement plus
larges que l&#8217;ensemble des instances, et qu&#8217;il a donc &#233;galement pour fonction de proposer de nouvelles
entr&#233;es au r&#233;f&#233;rentiel. Cet aspect &#233;volutif de l&#8217;analyse des donn&#233;es est particuli&#232;rement important dans le
contexte d&#8217;une agence de presse : sa production refl&#232;te &#224; un rythme rapide les fluctuations, nouveaut&#233;s et
obsolescences de l&#8217;usage des EN au cours du temps1.
</p>
<p>1Cela vaut d&#8217;ailleurs pour l&#8217;ensemble du lexique et non seulement pour les EN : les d&#233;p&#234;ches d&#8217;agence suivant l&#8217;actualit&#233;, les
n&#233;ologismes, nouveaux emplois ou nouveaux types lexicaux (sujets Twitter par exemple) y font r&#233;guli&#232;rement leur apparition.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#201;TECTION ET R&#201;SOLUTION D&#8217;ENTIT&#201;S NOMM&#201;ES DANS DES D&#201;P&#202;CHES D&#8217;AGENCE
</p>
<p>3 D&#233;tection et r&#233;solution des entit&#233;s nomm&#233;es : le syst&#232;me NP
</p>
<p>NP, notre syst&#232;me de d&#233;tection et de r&#233;solution des EN, fait partie de la cha&#238;ne SXPipe, une cha&#238;ne robuste
et modulaire de traitement de surface qui traite du texte tout-venant dans diff&#233;rentes langues (Sagot &amp;
Boullier, 2008)2. Diff&#233;rents modules permettent de traiter les probl&#232;mes d&#8217;encodage et de translitt&#233;ration,
de reconna&#238;tre diff&#233;rents types d&#8217;entit&#233;s (URL, nombres, dates, adresses, s&#233;quences en langue &#233;trang&#232;re. . .)
et de corriger l&#8217;orthographe et traiter les compos&#233;s et les amalgames.
</p>
<p>NP est constitu&#233; de deux modules, l&#8217;un pour la d&#233;tection et le typage et l&#8217;autre pour la d&#233;sambigu&#239;sation et
la r&#233;solution des EN. Ils reposent sur une volumineuse base d&#8217;entit&#233;s.
</p>
<p>Ressources utilis&#233;es Notre base de donn&#233;es, d&#233;crite plus en d&#233;tails dans (Stern &amp; Sagot, 2010), contient
environ 800 000 entit&#233;s et 1,3 million de variantes d&#233;notationnelles. Elle comprend des lieux, des organi-
sations, des personnes, des entreprises, des produits et des &#339;uvres (titres de livres, de films, etc.). Nous
avons construit cette base &#224; partir de diff&#233;rentes sources, principalement GeoNames pour les noms de
lieu3 et la Wikipedia fran&#231;aise pour les autres types d&#8217;entit&#233;s4.
</p>
<p>Pour les noms de lieux, nous avons tout d&#8217;abord filtr&#233; la volumineuse base GeoNames 5. Pour chaque en-
tit&#233; conserv&#233;e, nous avons extrait l&#8217;identifiant GeoNames, le nom normalis&#233; GeoNames (&#233;ventuellement
compl&#233;t&#233; par un indice permettant de distinguer les entit&#233;s homonymes), un poids (la population indiqu&#233;e
par GeoNames), les variantes d&#233;notationnelles associ&#233;es, et des indications permettant de visualiser la
localit&#233; dans Google maps6.
</p>
<p>Pour les autres types d&#8217;entit&#233;s, nous nous sommes appuy&#233;s sur la Wikipedia fran&#231;aise, dans la lign&#233;e de
travaux ant&#233;rieurs (Balasuriya et al., 2009; Charton &amp; Torres-Moreno, 2009). Nous avons extrait et typ&#233;
plus de 170 000 entit&#233;s &#224; partir des articles Wikipedia sur la base de leur cat&#233;gorie. Le nom normalis&#233; de
l&#8217;entit&#233; est le titre de son article, et diff&#233;rentes variantes d&#233;notationnelles sont extraites au moyen des liens
de redirection. Pour les noms de personnes, des variantes suppl&#233;mentaires sont calcul&#233;es. Nous identifions
tout d&#8217;abord le pr&#233;nom dans les diff&#233;rentes variantes de base puis produisons des variantes avec pr&#233;noms
abr&#233;g&#233;s et sans pr&#233;noms. Enfin, nous associons &#224; chaque entit&#233; un poids, d&#233;fini par le nombre de lignes de
son article Wikipedia.
</p>
<p>D&#233;tection et typage Une grammaire non-contextuelle de 130 r&#232;gles a &#233;t&#233; d&#233;velopp&#233;e pour d&#233;tecter et ty-
per les entit&#233;s nomm&#233;es &#224; partir de la base ainsi construite ; des motifs contextuels (p.ex. ville/localit&#233;/village
de ou Dr/M./Mme. . .) sont &#233;galement utilis&#233;s. La reconnaissance est faite de fa&#231;on ambigu&#235; par l&#8217;archi-
tecture dag2dag de SXPipe (Sagot &amp; Boullier, 2008). Des heuristiques de d&#233;sambigu&#239;sation sont appli-
qu&#233;es pour r&#233;duire en partie cette ambigu&#239;t&#233;. La sortie de ce module est donc un graphe (DAG) dans lequel
chaque EN candidate (empan et type) est repr&#233;sent&#233;e par une transition diff&#233;rente.
</p>
<p>2SXPipe est distribu&#233; librement sous licence compatible LGPL (http://gforge.inria.fr/projects/
lingwb/).
</p>
<p>3GeoNames est librement t&#233;l&#233;chargeable sur http://www.geonames.org.
4http://download.wikimedia.org/frwiki/latest/frwiki-latest-pages-articles.xml.bz2
5Nous avons conserv&#233; toutes les entr&#233;es concernant la France, ainsi que les localit&#233;s et r&#233;gions des autres pays si leur
</p>
<p>population est connue de GeoNames et sup&#233;rieure &#224; 200. Nous en avons exclu les variantes d&#233;notationnelles indiqu&#233;es comme
relevant d&#8217;une langue autre que le fran&#231;ais ou utilisant des caract&#232;res inconnus de la langue fran&#231;aise.
</p>
<p>6Latitude, longitude, et une estimation de l&#8217;&#233;chelle &#224; utiliser en fonction de la population indiqu&#233;e par GeoNames.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ROSA STERN &amp; BENO&#206;T SAGOT
</p>
<p>D&#233;sambigu&#239;sation et r&#233;solution L&#8217;objectif de ce module est de r&#233;soudre les ambigu&#239;t&#233;s d&#8217;empan et de
type (d&#233;sambigu&#239;sation) et d&#8217;assigner &#224; chaque EN conserv&#233;e une entr&#233;e dans la base (r&#233;solution). La
combinaison d&#8217;un empan, d&#8217;un type et d&#8217;une r&#233;f&#233;rence est appel&#233;e une lecture. Les t&#226;ches de d&#233;sambigu&#239;-
sation et de r&#233;solution sont effectu&#233;es conjointement car elles sont vues toutes deux comme le choix d&#8217;une
lecture parmi plusieurs lectures possibles.
</p>
<p>Notre module de d&#233;sambigu&#239;sation et de r&#233;solution repose sur des informations qualitatives et quantita-
tives, mais pas sur des techniques d&#8217;apprentissage automatique, contrairement &#224; des travaux tels que ceux
de (Pilz &amp; Paa&#223;, 2009). Il traite en s&#233;quence chaque phrase, en prenant en compte le d&#233;coupage du cor-
pus d&#8217;entr&#233;e en documents. Nous d&#233;finissons un niveau de saillance pour chaque entit&#233; qui est r&#233;&#233;valu&#233; &#224;
chaque nouvelle phrase d&#8217;un m&#234;me document. Ainsi, la mention d&#8217;une entit&#233; dans le document augmente
son niveau de saillance d&#8217;une quantit&#233; qui d&#233;pend de sa forme de surface7 et de son poids dans la base8.
&#192; l&#8217;inverse, le passage d&#8217;un document &#224; l&#8217;autre au sein d&#8217;un m&#234;me corpus divise par deux la saillance de
toutes les entit&#233;s. Ne sont alors conserv&#233;es que les lectures de saillance maximale, &#224; condition qu&#8217;elles
soient suffisantes, de fa&#231;on &#224; &#233;liminer les ambigu&#239;t&#233;s concernant les EN dans la phrase9.
</p>
<p>4 D&#233;veloppement d&#8217;un corpus d&#8217;&#233;valuation
</p>
<p>Afin d&#8217;&#233;valuer notre syst&#232;me de d&#233;tection et de r&#233;solution d&#8217;EN, nous avons s&#233;lectionn&#233; puis annot&#233; ma-
nuellement un ensemble de d&#233;p&#234;ches de l&#8217;AFP. Cette annotation a la forme de marqueurs XML balisant
le texte et indiquant pour chaque EN les informations concernant sa mention d&#8217;une part (fronti&#232;res du
segment de texte), et son aspect r&#233;f&#233;rentiel d&#8217;autre part (identifiant unique correspondant au r&#233;f&#233;rentiel
et associ&#233; au type de l&#8217;EN). Ce corpus permet donc d&#8217;&#233;valuer les performances de d&#233;tection d&#8217;EN mais
&#233;galement celles de la r&#233;solution, de fa&#231;on comparable &#224; (M&#246;ller et al., 2004).
</p>
<p>Ce corpus est constitu&#233; de 100 d&#233;p&#234;ches contenant en moyenne 300 mots. La table 2 pr&#233;sente la dis-
tribution des EN selon leur type et le caract&#232;re connu ou non de leur r&#233;f&#233;rent au vu des ressources de
l&#8217;annotateur. Il est disponible librement dans le cadre de la distribution de SXPipe.
</p>
<p>Les types d&#8217;EN annot&#233;s dans ce corpus correspondent &#224; ceux habituellement choisis dans la plupart des
t&#226;ches organis&#233;es par les conf&#233;rences concern&#233;es. Ils sont aujourd&#8217;hui limit&#233;s &#224; Personnes, Lieux et Orga-
nisations. L&#8217;identifiant reprend celui qui existe dans les ressources de l&#8217;annotateur (section 3). Si aucune
correspondance de r&#233;f&#233;rence ne peut &#234;tre &#233;tablie entre la mention et ces ressources, la forme normalis&#233;e
tient lieu de r&#233;f&#233;rence et l&#8217;&#233;tiquette &#171; inconnue &#187; lui est attribu&#233;e. Par ailleurs les annotations de mentions
ne comprennent pas les tokens non constitutifs du nom de l&#8217;entit&#233; lui-m&#234;me : les titres pr&#233;c&#233;dant les noms
de personnes notamment en sont exclus (Mme ou Dr).
</p>
<p>- Le pr&#233;sident &lt;Person name=&quot;Barack Obama&quot;&gt;Barack Obama&lt;/Person&gt; a approuv&#233; un accord
- grippe porcine au &lt;Location name=&quot;Canada (2)&quot;&gt;Canada&lt;/Location&gt; a &#233;t&#233; r&#233;vis&#233;
- M. &lt;Person name=&quot;Jim Buckmaster&quot; ref=&quot;unknown&quot;&gt;Buckmaster&lt;/Person&gt;, se plaint mercredi
</p>
<p>TAB. 1 &#8211; Exemple d&#8217;annotation
</p>
<p>7Par exemple, une lecture impliquant un nom de personne pour un empan de longueur 1 (nom de famille &#171; nu &#187;) sera
d&#233;favoris&#233;, surtout s&#8217;il s&#8217;agirait de la premi&#232;re mention de cette personne dans le document.
</p>
<p>8La saillance d&#8217;un lieu est encore augment&#233;e si elle appara&#238;t dans un document o&#249; l&#8217;on a d&#233;tect&#233; une mention de son pays.
9Dans le d&#233;tail, le fonctionnement du module est un peu plus complexe. Il peut notamment pr&#233;server certaines ambigu&#239;t&#233;s,
</p>
<p>si une validation manuelle est effectu&#233;e en aval (par exemple, pour le d&#233;veloppement d&#8217;un corpus annot&#233;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#201;TECTION ET R&#201;SOLUTION D&#8217;ENTIT&#201;S NOMM&#201;ES DANS DES D&#201;P&#202;CHES D&#8217;AGENCE
</p>
<p>Lieux Personnes Organisations
Total Connus Inconnus Total Connus Inconnus Total Connus Inconnus
</p>
<p>R&#233;f&#233;rences 262 218 44 223 111 112 182 99 83
Mentions 673 614 59 424 252 172 447 312 135
</p>
<p>TAB. 2 &#8211; Distribution des EN sur le corpus selon le type et la r&#233;f&#233;rence
</p>
<p>5 Evaluation et r&#233;sultats
</p>
<p>D&#233;veloppement et test Le corpus d&#8217;&#233;valuation a &#233;t&#233; divis&#233; en deux parties de tailles &#233;quivalentes, cor-
respondant aux donn&#233;es de d&#233;veloppement et de test. Une connaissance de l&#8217;ensemble des donn&#233;es lors
du d&#233;veloppement entra&#238;nerait en effet une am&#233;lioration artificielle des performances du syst&#232;me. Une d&#233;-
p&#234;che sur deux correspond &#224; la partie de test, ce qui permet d&#8217;&#233;viter des biais syst&#233;matiques qui pourraient
&#234;tre caus&#233;s par certaines EN se trouvant plus fr&#233;quemment dans une partie ou une autre du corpus.
</p>
<p>M&#233;triques d&#8217;&#233;valuation L&#8217;&#233;valuation se fait &#224; trois niveaux. D&#8217;abord la performance du syst&#232;me est
not&#233;e en comparant les EN d&#233;tect&#233;es automatiquement en termes d&#8217;empan et de type (D&#233;tection et typage
dans la table 3). C&#8217;est ainsi que sont construits les scores de la t&#226;che partag&#233;e de CONLL 2003 (Tjong
Kim Sang &amp;Meulder, 2003). Nous n&#8217;&#233;tablissons donc pas, contrairement &#224; MUC (Grishman &amp; Sundheim,
1996), de scores ou cr&#233;dits partiels en cas d&#8217;erreurs sur l&#8217;empan ou sur le type.
</p>
<p>Ensuite, pour les mentions dont l&#8217;empan et le type sont corrects, nous &#233;valuons la capacit&#233; du syst&#232;me
&#224; d&#233;tecter si l&#8217;entit&#233; correspondante est dans le r&#233;f&#233;rentiel ou si elle est &#171; inconnue &#187; (D&#233;tection de la
r&#233;f&#233;rence). Pour les mentions qui correspondent &#224; une entit&#233; correctement identifi&#233;e comme connue, on
&#233;value alors la capacit&#233; du syst&#232;me &#224; identifier la bonne entit&#233; (R&#233;solution de la r&#233;f&#233;rence).
</p>
<p>R&#233;sultats La table 3 pr&#233;sente les r&#233;sultats obtenus sur l&#8217;ensemble de test. La phase de d&#233;tection a le score
le plus bas. Les F-scores pour les types Personnes, Lieux et Organisations sont respectivement 0,85, 0,87
et 0,52 (F-score g&#233;n&#233;ral de 0,77). Ces chiffres sont satisfaisants lorsqu&#8217;on les compare &#224; d&#8217;autres syst&#232;mes.
&#201;valu&#233; sur le m&#234;me corpus, le syst&#232;me de d&#233;tection d&#8217;entit&#233;s nomm&#233;es de Temis, utilis&#233; parall&#232;lement &#224;
l&#8217;AFP pour l&#8217;annotation de d&#233;p&#234;ches, obtient respectivement 0,86, 0,86 et 0,42. Par ailleurs, les r&#233;sultats
de (Brun et al., 2009) sur leur propre corpus sont respectivement de 0.79, 0.76 et 0.65 (Jacquet, c.p.).
</p>
<p>T&#226;che Pr&#233;cision Rappel F-score
Type Lieux Pers. Org. Tot. Lieux Pers. Org. Tot. Lieux Pers. Org. Tot.
D&#233;tection et typage 0,85 0,92 0,85 0,87 0,88 0,79 0,37 0,70 0,87 0,85 0,52 0,77
D&#233;tection de la r&#233;f&#233;rence 0,92 0,98 0,95
R&#233;solution de la r&#233;f&#233;rence 0,82 &#8211; &#8211;
</p>
<p>TAB. 3 &#8211; R&#233;sultats d&#8217;&#233;valuation pour les 3 sous-t&#226;ches : d&#233;tection et typage des EN, d&#233;tection de r&#233;f&#233;rence,
r&#233;solution de la r&#233;f&#233;rence
</p>
<p>Nous avons pu constater, au cours du d&#233;veloppement de NP, combien la qualit&#233; des r&#233;sultats est d&#233;pendante
de celle du r&#233;f&#233;rentiel utilis&#233; et des heuristiques mises en &#339;uvre &#224; tous les niveaux. Une am&#233;lioration
importante des performances de NP est donc envisageable, par exemple en augmentant la couverture du
r&#233;f&#233;rentiel sur les organisations ou en couplant nos techniques avec des m&#233;thodes d&#8217;apprentissage.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ROSA STERN &amp; BENO&#206;T SAGOT
</p>
<p>6 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; NP, un syst&#232;me qui compl&#232;te une phase de d&#233;tection et de typage des EN par leur
r&#233;solution, c&#8217;est-&#224;-dire le calcul de leur r&#233;f&#233;rent. Dans le contexte applicatif du traitement de d&#233;p&#234;ches
AFP, ce syst&#232;me donne des r&#233;sultats encourageants pour de futurs travaux. Il s&#8217;agira notamment d&#8217;int&#233;grer
des informations directement issues du r&#233;f&#233;rentiel ontologique de l&#8217;AFP pour aider la d&#233;sambigu&#239;sation
et la r&#233;solution, ainsi que des donn&#233;es acquises au cours de la production des d&#233;p&#234;ches : fr&#233;quences d&#8217;oc-
currences des EN, apparition ou disparition au cours du temps. Le d&#233;veloppement de ce syst&#232;me pour
d&#8217;autres langues de travail de l&#8217;AFP est envisag&#233;, notamment l&#8217;anglais et l&#8217;espagnol, avec la constitution
de nouvelles ressources r&#233;f&#233;rentielles bas&#233;es sur le mod&#232;le construit pour le fran&#231;ais.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BALASURIYA D., RINGLAND N., NOTHMAN J., MURPHY T. &amp; CURRAN J. R. (2009). Named entity
recognition in wikipedia. In People&#8217;s Web &#8217;09 : Proceedings of the 2009 Workshop on The People&#8217;s Web
Meets NLP, p. 10&#8211;18, Suntec, Singapour.
</p>
<p>BLUME M. (2005). Automatic entity disambiguation : Benefits to ner, relation extraction, link analysis,
and inference. International Conference on Intelligence Analysis.
</p>
<p>BRUN C., DESSAIGNE N., EHRMANN M., GAILLARD B., GUILLEMIN-LANNE S., JACQUET G., KA-
PLAN A., KUCHARSKI M., MARTINEAU C., MIGEOTTE A., NAKAMURA T. &amp; VOYATZI S. (2009).
Une exp&#233;rience de fusion pour l&#8217;annotation d&#8217;entit&#233;s nomm&#233;es. In Actes de TALN 2009, Senlis, France.
</p>
<p>CHARTON E. &amp; TORRES-MORENO J.-M. (2009). Classification d&#8217;un contenu encyclop&#233;dique en vue
d&#8217;un &#233;tiquetage par entit&#233;s nomm&#233;es. In Actes de TALN 2009, Senlis, France.
</p>
<p>EHRMANN M. (2008). Les Entit&#233;s Nomm&#233;es, de la Linguistique au TAL - Statut Th&#233;orique et M&#233;thodes
de D&#233;sambigu&#239;sation. Th&#232;se de doctorat, Universit&#233; Paris 7 Denis Diderot.
</p>
<p>GRISHMAN R. &amp; SUNDHEIM B. (1996). Message understanding conference-6 : a brief history. In
Proceedings of CoLing&#8217;96, p. 466&#8211;471, Copenhagen, Denmark.
</p>
<p>M&#214;LLER K., SCHUTZ A. &amp; DECKER S. (2004). Towards an integrated corpus for the evaluation
of named entity recognition and object consolidation. In Proceedings of the SemAnnot Workshop at
ISWC2004, Hiroshima, Japan.
</p>
<p>PILZ A. &amp; PAASS G. (2009). Named entity resolution using automatically extracted semantic informa-
tion. In Proceedings of LWA 2009, Darmstadt, Allemagne.
</p>
<p>SAGOT B. &amp; BOULLIER P. (2008). SXPipe 2 : architecture pour le traitement pr&#233;syntaxique de corpus
bruts. Traitement Automatique des Langues (T.A.L.), 49(2), 155&#8211;188.
STERN R. &amp; SAGOT B. (2010). Resources for named entity recognition and resolution in news wires.
In Proceedings of LREC 2010 Workshop on Resources and Evaluation for Identity Matching, Entity
Resolution and Entity Management, La Valette, Malte. &#192; para&#238;tre.
</p>
<p>TJONG KIM SANG E. F. &amp; MEULDER F. D. (2003). Introduction to the CoNLL-2003 Shared Task :
Language-Independent Named Entity Recognition. In Proceedings of CoNLL-2003, p. 142&#8211;147, Edmon-
ton, Canada.</p>

</div></div>
</body></html>