<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Exploitation de Wikip&#233;dia pour l&#8217;Enrichissement et la Construction des Ressources Linguistiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Exploitation de Wikip&#233;dia pour l&#8217;Enrichissement et la Construction des 
Ressources Linguistiques 
</p>
<p>Fatiha Sadat1 et Alexandre Terrasa1,2 
</p>
<p>(1)  Universit&#233; du Qu&#233;bec &#224; Montr&#233;al, 201 av. President Kennedy,                  
Montr&#233;al, QC, H3X 2Y3, Canada 
</p>
<p>(2) &#201;cole Sup&#233;rieure d&#8217;Informatique Appliqu&#233;e EXIA.CESI  
11 avenue Neil Armstrong, 33700 M&#233;rignac, Bordeaux, France 
</p>
<p>sadat.fatiha@uqam.ca, alexandre.terrasa@viacesi.fr 
</p>
<p>R&#233;sum&#233; Cet article pr&#233;sente une approche et des r&#233;sultats utilisant l'encyclop&#233;die en ligne Wikip&#233;dia 
comme ressource semi-structur&#233;e de connaissances linguistiques et en particulier comme un corpus 
comparable pour l&#8217;extraction de terminologie bilingue. Cette approche tend &#224; extraire d&#8217;abord des paires 
de terme et traduction &#224; partir de types des informations, liens et textes de Wikip&#233;dia. L&#8217;&#233;tape suivante 
consiste &#224; l&#8217;utilisation de l&#8217;information linguistique afin de r&#233;-ordonner les termes et leurs traductions 
pertinentes et ainsi &#233;liminer les termes cibles inutiles. Les &#233;valuations pr&#233;liminaires utilisant les paires de 
langues fran&#231;ais-anglais, japonais-fran&#231;ais et japonais-anglais ont montr&#233; une bonne qualit&#233; des paires de 
termes extraits. Cette &#233;tude est tr&#232;s favorable pour la construction et l&#8217;enrichissement des ressources 
linguistiques tels que les dictionnaires et ontologies multilingues. Aussi, elle est tr&#232;s utile pour un syst&#232;me 
de recherche d&#8217;information translinguistique (RIT). 
</p>
<p>Abstract Multilingual linguistic resources are usually constructed from parallel corpora, but since these 
corpora are available only for selected text domains and language pairs, the potential of other resources is 
being explored as well. This article seeks to explore and exploit the idea of using multilingual web-based 
encyclopaedias such as Wikipedia as comparable corpora for bilingual terminology extraction. We 
propose an approach to extract terms and their translations from different types of Wikipedia link 
information and texts. The next step will be using a linguistic-based information to re-rank and filter the 
extracted term candidates in the target language. Preliminary evaluations using the combined statistics-
based and linguistic-based approaches were applied on Japanese-French, French-English and Japanese-
French. These evaluations showed a real open improvement and good quality of the extracted term 
candidates for building or enriching multilingual ontologies, dictionaries or feeding a cross-language 
information retrieval system with the related expansion terms of the source query. 
</p>
<p>Mots-cl&#233;s :   Terminologie bilingue, corpus comparable, Wikip&#233;dia, ontologie multilingue. 
Keywords:   Bilingual terminology, comparable corpora, Wikipedia, mulilingual ontologies. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FATIHA SADAT ET ALEXANDRE TERRASA 
1 Introduction 
Wikip&#233;dia, une encyclop&#233;die en ligne multilingue, offre en m&#234;me temps un r&#233;servoir gigantesque de 
donn&#233;es multilingues qui peut &#234;tre exploit&#233; par des moyens automatiques, en particulier gr&#226;ce &#224; des 
moteurs de recherche tels que Google1 ou Yahoo2 ou m&#234;me le moteur de recherche propre de Wikipedia3.  
L&#8217;objectif de notre travail est l&#8217;acquisition automatique d&#8217;une terminologie bilingue ou multilingue des 
articles de Wikip&#233;dia ind&#233;pendamment des langues utilis&#233;es; mais appliqu&#233;e pour cette premi&#232;re &#233;tude aux 
paires de langues fran&#231;ais-anglais et plus tard au fran&#231;ais-japonais. Ce travail sera utilis&#233; pour la recherche 
d&#8217;information multilingue ainsi que pour la construction et l&#8217;enrichissement des ressources linguistiques 
multilingue telles que les dictionnaires et ontologies. 
Le contenu de cet article se r&#233;sume comme suit. La section 2 pr&#233;sente la ressource Wikip&#233;dia ainsi que les 
diff&#233;rentes &#233;tapes du processus d&#8217;extraction de terminologie bilingue en utilisant une combinaison 
d&#8217;approches statistique et linguistique. Nous montrons dans la section 3 les analyses et &#233;valuations 
obtenues en impl&#233;mentant notre approche sur diff&#233;rentes paires de langues incluant le fran&#231;ais, le japonais 
et l&#8217;anglais ; et discutons d&#8217;autres r&#233;sultats et extensions auxquels la pr&#233;sente &#233;tude est li&#233;e. La section 4 
conclue cet article et donne des pointeurs et extensions pour le futur. 
2 Wikip&#233;dia et le Processus d&#8217;Extraction de la Terminologie Bilingue 
Wikip&#233;dia (prononc&#233; wikipe'dja ou vikipe'dja) est une encyclop&#233;die collective &#233;tablie sur Internet, 
universelle, multilingue et fonctionnant sur le principe du wiki , c-&#224;-d un site Web dont les pages sont 
modifiables (gratuitement) par tout ou partie des visiteurs du site. Nous exploitons l&#8217;aspect multilingue de 
cette ressource afin d&#8217;extraire de la terminologie qui pourra cr&#233;er ou enrichir les ressources linguistiques 
existantes, comme les ontologies et dictionnaires multilingues. Dans notre approche, les liens au sein de la 
m&#234;me langue seront utilis&#233;s afin de chercher l&#8217;information dans la langue pr&#233;cis&#233;e et ainsi parcourir le 
corpus monolingue. Aussi, les liens entre diff&#233;rentes langues seront utilis&#233;s afin de chercher l&#8217;information 
translinguistique. 
En premier, nous consid&#233;rons une requ&#234;te compos&#233;e de n mots en langue source S qu&#8217;on utilise pour 
interroger Wikip&#233;dia. L&#8217;article obtenu est utilis&#233; pour la construction de notre corpus comparable en 
langue S. L&#8217;utilisation des liens interlangues pour la m&#234;me requ&#234;te permet de construire un corpus 
comparable en langues source S et cible T. De cette mani&#232;re, nous aurons construit un premier article 
comparable pour la requ&#234;te de d&#233;part. 
L&#8217;exploitation des liens existants dans les articles obtenus en premier en langue S et T, servira &#224; agrandir et 
&#224; approfondir le contenu et la taille de notre corpus comparable. Dans cette &#233;tude, nous nous basons sur 
des profondeurs de la recherche documentaire sur Wikip&#233;dia afin d&#8217;exploiter les liens dans la m&#234;me 
langue ; c-&#224;-d l&#8217;article obtenu en premier aura une profondeur &#233;gale &#224; 0, l&#8217;utilisation des liens de cet article 
aboutira &#224; une profondeur &#233;gale &#224; 1 et plus - l&#8217;utilisation de n fois les liens des articles aboutiront &#224; une 
profondeur &#233;gale &#224; n. Plus nous parcourant les profondeurs dans la m&#234;me langue, plus la taille de notre 
corpus devient volumineuse et plus le corpus sera plus consistant et pertinent pour nos recherches. Le 
parcours en parall&#232;le dans l&#8217;autre langue sera in&#233;vitable puisqu&#8217;il s&#8217;agit d&#8217;un corpus comparable (c-&#224;-d 
dans deux langues au moins). 
Le processus d&#8217;extraction de terminologie bilingue des documents de Wikip&#233;dia se base en premier sur 
une approche statistique pr&#233;sent&#233;e par Sadat et al. (2003, 2004) et plus tard sur une combinaison avec 
l&#8217;information linguistique afin de r&#233;-ordonner et raffiner la terminologie r&#233;sultante.  
</p>
<p>                                                
1 http://www.google.com 
2 http://www.yahoo.com 
3 http://www.wikipedia.org/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Exploitation de Wikip&#233;dia pour l&#8217;Enrichissement et la Construction des Ressources Linguistiques 
La phase statistique reprend et adapte la m&#233;thode propos&#233;e par Sada et al. (2003), Dejean et al. (2002) et 
Morin et al. (2004), et a pour objectif de r&#233;aliser l&#8217;alignement des termes de la langue source avec ceux 
de(s) la langue(s) cible(s). En consid&#233;rant les corpus comparables construits &#224; partir des articles de 
Wikip&#233;dia, nous appliquons les &#233;tapes du processus d&#8217;extraction de terminologie bilingue comme suit:  
</p>
<p>1. Rep&#233;rages des termes sources et cibles des deux corpus comparables ;  
2. Construction des vecteurs contextes dans les deux langues ; 
3. Transfert du contenu des vecteurs contextes de la langue source vers la langue cible en utilisant les 
</p>
<p>traducteur interlangue de Wikip&#233;dia 
4. Construction des vecteurs de similarit&#233; en utilisant des mesures de similarit&#233; tel que le cosinus, la 
</p>
<p>distance de Jaccard et le coefficient Dice ; 
5. Les informations linguistiques des mots sources et cibles sont utilis&#233;es afin de r&#233;-ordonner les 
</p>
<p>termes et leurs traductions candidates et ainsi &#233;liminer les termes cibles inutiles.  
</p>
<p>3 Evaluations 
Nous &#233;valuons dans cette section l&#8217;approche d&#233;crite pr&#233;c&#233;demment en utilisant des paires de langues 
incluant le fran&#231;ais, l&#8217;anglais et le japonais ainsi que le site Wikip&#233;dia comme r&#233;servoir de corpus 
comparables. Diff&#233;rentes profondeurs, c-&#224;-d tailles des corpus comparables serons consid&#233;r&#233;es. Toutefois, 
faute de temps et des limitations de ressources mat&#233;riels informatiques disponibles dans notre laboratoire, 
nous nous sommes arr&#234;t&#233;s &#224; la profondeur 3 avec des r&#233;sultats prometteurs. 
Les premiers r&#233;sultats obtenus avec la paire de langues fran&#231;ais-anglais et d&#8217;apr&#232;s l&#8217;exploitation des liens 
dans un m&#234;me article (repr&#233;sent&#233; par les profondeurs) sont d&#233;crits dans le tableau 1. D&#8217;autres exemples 
pour les paires de langues incluant le japonais vers le fran&#231;ais ou l&#8217;anglais sont pr&#233;sent&#233;s dans les tableaux 
2 et 3, respectivement. Nous avons explor&#233; les diff&#233;rents termes extraits en langue cible et nous avons 
constat&#233; qu&#8217;une ontologie bilingue (ou multilingue) pourrait &#234;tre construite en suivant ce processus. Les 
termes extraits ont une certaine relation s&#233;mantique avec les termes sources et les articles qui leurs sont 
li&#233;s pourront &#234;tre exploit&#233;s dans le but d&#8217;extraire les relations s&#233;mantiques et ainsi construire une ontologie 
multilingue. 
4 Conclusion 
Nous avons propos&#233; une premi&#232;re &#233;tude d&#8217;une encyclop&#233;die en ligne multilingue afin d&#8217;extraire de la 
terminologie bilingue et possiblement multilingue en utilisant les liens inter-langues et diff&#233;rentes 
profondeurs des liens monolingues. Nos r&#233;sultats sont tr&#232;s encourageants et prometteurs pour la 
construction d&#8217;une ontologie multilingue. Les prochaines &#233;valuations porteront sur plus de profondeurs 
afin d&#8217;agrandir la taille des corpus comparables et ainsi obtenir une meilleure terminologie. La d&#233;finition 
des relations s&#233;mantiques entre les diff&#233;rents termes en langues source et cible est &#224; l&#8217;&#233;tude.  Aussi, pour le 
moment, nous avons utilis&#233; une seule requ&#234;te pour interroger le site de Wikip&#233;dia et ainsi obtenir des 
corpus comparables. Une &#233;ventuelle extension sera l&#8217;utilisation de plusieurs requ&#234;tes et des &#233;valuations 
pour d&#233;terminer la  qualit&#233; des traductions. D&#8217;autres paires de langues sont aussi &#224; l&#8217;&#233;tude. 
R&#233;f&#233;rences 
ADAR E., SKINNER M., WELD D. S. (2009). INFORMATION ARBITRAGE ACROSS MULTI-LINGUAL WIKIPEDIA, 
PROCEEDINGS OF THE SECOND ACM INTERNATIONAL CONFERENCE ON WEB SEARCH AND DATA MINING, 
FEBRUARY 09-12, 2009, BARCELONA, SPAIN. 
DEJEAN, H., GAUSSIER, E., SADAT, F. (2002). AN APPROACH BASED ON MULTILINGUAL THESAURI AND MODEL 
COMBINATION FOR BILINGUAL LEXICON EXTRACTION. IN PROCEEDINGS OF COLING&#8217;02, TAIWAN. 
ERDMANN M., NAKAYAMA K., HARA T., NISHIO S. (2008B). EXTRACTION OF BILINGUAL TERMINOLOGY FROM A 
MULTILINGUAL WEB-BASED ENCYCLOPEDIA. J. INFORM. PROCESS. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FATIHA SADAT ET ALEXANDRE TERRASA 
Profondeur Mot source (fr.) Nombre de candidats (ang.) Traduction id&#233;ale (ang.) Rang 
</p>
<p>Organisation 14 Organization 1 
Maladie 101 disease 14 
Sant&#233; 89 Health 1 0 
H&#244;pital 19 Hospital 3 
Admission 90 admission 1 
Algue 88 Algae 1 1 
Th&#233;rapie 52 Therapy 1 
Abeille 443 Bee 1 
Narcotique 1656 Narcotic 1 3 
Assurance 289 Insurance 2 
</p>
<p>Tableau 1: Exemples de la terminologie bilingue (fran&#231;ais-anglais) extraite suivant les diff&#233;rentes 
profondeurs des articles de Wikip&#233;dia 
</p>
<p>Profondeur Mot source (jap.) Nombre de candidats (fr.) Traduction id&#233;ale (fr.) Rang 
0 &#24863;&#26579; 14 Infection 1 
</p>
<p>&#12452;&#12531;&#12464;&#12521;&#12531;&#12489;! &quot;#! $%&amp;'()(**(! +!
&#12369;&#12387;&#12363;! #! ,-./')0)! &quot;!1 
&#19990;&#30028;! &quot;1! 23%4(! &quot;!
&#12450;&#12524;&#12523;&#12462;&#12540;! +5#! $''(*&amp;6(! +!
&#12475;&#12523;&#12525;&#12540;&#12473;! +55! 7(''/'3.(! +!
</p>
<p>3 
&#12527;&#12463;&#12481;&#12531;! &quot;8+! 90::6%! &quot;!
</p>
<p>Tableau 2: Exemples de la terminologie bilingue (japonais-fran&#231;ais) extraite suivant les diff&#233;rentes 
profondeurs des articles de Wikip&#233;dia 
</p>
<p>Profondeur Mot source (jap.) Nombre de candidats (ang.) Traduction id&#233;ale (ang.) Rang 
0 &#32048;&#33740;! &quot;;! &lt;0:)(*60! +!
</p>
<p>&#24863;&#26579;! 36 Infection +!1 
&#12489;&#12452;&#12484;! 4 Germany &quot;!
&#12527;&#12463;&#12481;&#12531;! ==! 90::6%(! +!
&#12498;&#12488;! 1;+! &gt;/?0%! &quot;!
</p>
<p> 
</p>
<p>3 
&#24494;&#29983;&#29289;! =1! 26:*33*&amp;0%6.?! &quot;!
</p>
<p>Tableau 3: Exemples de la terminologie bilingue (japonais-anglais) extraite suivant les diff&#233;rentes 
profondeurs des articles de Wikip&#233;dia 
</p>
<p> 
KUN Y., TSUJII J. (2009). BILINGUAL DICTIONARY EXTRACTION FROM WIKIPEDIA. (2009A). IN PROCEEDINGS OF 
MT SUMMIT XII PROCEEDINGS 2009. 
MORIN, E., AND DAILLE, B. (2006). COMPARABILITE DE CORPUS ET FOUILLE TERMINOLOGIQUE MULTILINGUE. 
TRAITEMENT AUTOMATIQUE DES LANGUES (TAL), 47(1):113-136, 2006.  
SADAT, F., YOSHIKAWA, M., UEMURA, S. (2003). LEARNING BILINGUAL TRANSLATIONS FROM COMPARABLE 
CORPORA TO CROSS-LANGUAGE INFORMATION RETRIEVAL: HYBRID STATISTICS-BASED AND LINGUISTICS-BASED 
APPROACH. IN PROCEEDINGS OF  EACL&#8217;203, WORKSHOP ON INFORMATION RETRIEVAL WITH ASIAN LANGUAGES - 
VOLUME 11, SAPPORO, JAPAN. PAGES: 57&#8211;64.  
SADAT, F. (2004). KNOWLEDGE ACQUISITION FROM COLLECTIONS OF NEWS ARTICLES TO CROSS-LANGUAGE 
INFORMATION RETRIEVAL. IN PROCEEDINGS OF RIAO 2004 CONFERENCE, AVIGNON, FRANCE, PP. 504-513. 
V&#201;RONIS, J. (2000). PARALLEL TEXT PROCESSING: ALIGNMENT AND USE OF TRANSLATION CORPORA. 
DORDRECHT, KLUWER ACADEMIC PUBLISHERS </p>

</div></div>
</body></html>