<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>R&#233;&#233;criture de graphes de d&#233;pendances pour l&#8217;interface syntaxe-s&#233;mantique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>R&#233;&#233;criture de graphes de d&#233;pendances pour l&#8217;interface
syntaxe-s&#233;mantique
</p>
<p>Guillaume Bonfante, Bruno Guillaume, Mathieu Morey, Guy Perrier
INRIA Nancy-Grand Est - LORIA - Nancy-Universit&#233;
</p>
<p>R&#233;sum&#233;. Nous d&#233;finissons le &#946;-calcul, un calcul de r&#233;&#233;criture de graphes, que nous proposons d&#8217;uti-
liser pour &#233;tudier les liens entre diff&#233;rentes repr&#233;sentations linguistiques. Nous montrons comment trans-
former une analyse syntaxique en une repr&#233;sentation s&#233;mantique par la composition de deux jeux de r&#232;gles
de &#946;-calcul. Le premier souligne l&#8217;importance de certaines informations syntaxiques pour le calcul de la
s&#233;mantique et explicite le lien entre syntaxe et s&#233;mantique sous-sp&#233;cifi&#233;e. Le second d&#233;compose la re-
cherche de mod&#232;les pour les repr&#233;sentations s&#233;mantiques sous-sp&#233;cifi&#233;es.
</p>
<p>Abstract. We define the &#946;-calculus, a graph-rewriting calculus, which we propose to use to study
the links between different linguistic representations. We show how to transform a syntactic analysis into
a semantic analysis via the composition of two sets of &#946;-calculus rules. The first one underlines the im-
portance of some syntactic information to compute the semantics and clearly expresses the link between
syntax and underspecified semantics. The second one breaks up the search for models of underspecified
semantic representations.
</p>
<p>Mots-cl&#233;s : D&#233;pendances, r&#233;&#233;criture de graphes, interface syntaxe-s&#233;mantique, DMRS.
</p>
<p>Keywords: Dependencies, graph rewriting, syntax-semantics interface, DMRS.
</p>
<p>Introduction
</p>
<p>Les analyseurs syntaxiques produisent des sorties dans des formats les plus divers. En outre, ils n&#8217;ont pas
forc&#233;ment en vue la production d&#8217;une repr&#233;sentation s&#233;mantique compl&#232;te des &#233;nonc&#233;s et ne fournissent
pas toujours les informations qui y seraient n&#233;cessaires. D&#8217;un autre c&#244;t&#233;, il existe diff&#233;rents formalismes
de repr&#233;sentation s&#233;mantique li&#233;s ou non &#224; des formalismes de repr&#233;sentation syntaxique.
</p>
<p>D&#8217;un point de vue th&#233;orique comme d&#8217;un point de vue pratique, il appara&#238;t utile de disposer d&#8217;un cadre
formel commun qui permette d&#8217;&#233;tudier la transformation d&#8217;une repr&#233;sentation dans un format A en une re-
pr&#233;sentation dans un format B, les formats A et B ayant &#233;t&#233; d&#233;velopp&#233;s de fa&#231;on totalement ind&#233;pendante.
Pos&#233; de fa&#231;on totalement g&#233;n&#233;rale, le probl&#232;me est insoluble. Pour cette &#233;tude, nous nous restreindrons &#224;
des formats en d&#233;pendances, tant pour la syntaxe que pour la s&#233;mantique.
</p>
<p>En effet, de nombreux analyseurs syntaxiques produisent des arbres de d&#233;pendances, soit de fa&#231;on directe
ou par transformation d&#8217;arbres syntagmatiques. La r&#233;cente campagne PASSAGE d&#8217;&#233;valuation des analy-
seurs syntaxiques du fran&#231;ais 1 en est une bonne illustration. Pour cette campagne, a &#233;t&#233; d&#233;fini un format
</p>
<p>1. http://atoll.inria.fr/passage/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>de sortie qui prend en compte &#224; la fois la structure en constituants des phrases et la structure en d&#233;pen-
dances, appel&#233;es ici relations. Dans PASSAGE, on peut choisir indiff&#233;remment de faire porter les relations
sur les mots ou sur des groupes syntaxiques (qui ne sont pas forc&#233;ment des syntagmes complets), mais la
pr&#233;sence d&#8217;une t&#234;te dans chaque groupe syntaxique permet de faire syst&#233;matiquement porter les relations
sur les mots. Chaque phrase est alors annot&#233;e par un graphe de d&#233;pendances entre mots, rien n&#8217;interdisant
des cycles dans les d&#233;pendances comme pour la phrase &#171; Jean me propose un livre facile &#224; lire &#187;, o&#249; le
cycle de d&#233;pendances est localis&#233; dans le segment &#171; livre facile &#224; lire &#187;.
</p>
<p>Pour ce qui est de la s&#233;mantique, les formats en d&#233;pendances sont la r&#232;gle pour les grammaires de d&#233;pen-
dance (voir la Th&#233;orie Sens-Texte par exemple (TST) (Mel&#8217;c&#780;uk, 1988)). Mais c&#8217;est aussi le cas pour des
repr&#233;sentations produites &#224; partir de grammaires syntagmatiques. Ainsi, &#224; partir de HPSG, a &#233;t&#233; con&#231;u un
formalisme de repr&#233;sentation s&#233;mantique sous-sp&#233;cifi&#233;e la MRS (Minimal Recursion Semantics) (Copes-
take et al., 2005). De ce formalisme, a &#233;t&#233; d&#233;riv&#233; un formalisme &#233;quivalent plus compact et plus lisible,
o&#249; les structures s&#233;mantiques sont des graphes de d&#233;pendances ; c&#8217;est la Dependency Minimal Recursion
Semantics (DMRS) (Copestake, 2009).
</p>
<p>De nombreux travaux en linguistique utilisent des graphes en syntaxe et en s&#233;mantique. Notre travail se
place dans ce cadre mais se concentre sur la formalisation des processus de calcul entre ces structures.
</p>
<p>Pour transformer les graphes de d&#233;pendances syntaxiques en graphes de d&#233;pendances s&#233;mantiques, nous
proposons d&#8217;utiliser une forme particuli&#232;re de r&#233;&#233;criture de graphes, que nous avons appel&#233; &#946;-calcul.
Un syst&#232;me du &#946;-calcul est un ensemble de r&#232;gles qui permettent de transformer un graphe d&#8217;un certain
formalisme dans un graphe dans un autre formalisme. L&#8217;int&#233;r&#234;t d&#8217;utiliser le paradigme de la r&#233;&#233;criture de
graphes est d&#8217;une part de pouvoir exprimer des principes linguistiques de fa&#231;on simple et lisible, chaque
r&#232;gle traduisant un principe linguistique. D&#8217;autre part, cela permet d&#8217;exploiter la souplesse inh&#233;rente &#224; la
r&#233;&#233;criture de graphes. On peut ainsi enrichir une transformation d&#8217;un format A en un format B de fa&#231;on
compl&#232;tement monotone par simple ajout de r&#232;gles. On peut aussi composer deux transformations d&#8217;un
format A &#224; un format B et d&#8217;un format B &#224; un format C par union des deux ensembles de r&#232;gles, si
on suppose que le second ne peut pas interf&#233;rer avec le premier, en ce sens qu&#8217;une r&#232;gle du second ne
s&#8217;applique jamais avant une r&#232;gle du premier.
</p>
<p>Pour illustrer notre propos, nous d&#233;finissons un ensemble de &#946;-r&#232;gles qui permettent de transformer des
structures de d&#233;pendances syntaxiques au format PASSAGE en structures de d&#233;pendances s&#233;mantiques
au format DMRS. Nous avons choisi ces deux formats, car l&#8217;information qu&#8217;ils repr&#233;sentent, si elle n&#8217;est
pas compl&#232;te, fait consensus et ils s&#8217;appuient tous les deux sur une exp&#233;rimentation &#224; large &#233;chelle : la
campagne d&#8217;&#233;valuation PASSAGE d&#8217;un c&#244;t&#233; et le projet DELPH-IN 2 de l&#8217;autre.
</p>
<p>Dans la section 1, nous montrerons que l&#8217;information donn&#233;e par les structures de d&#233;pendances PASSAGE
n&#8217;est pas suffisante pour produire des structures de d&#233;pendances s&#233;mantiques DMRS. Nous d&#233;crirons pr&#233;-
cis&#233;ment les relations qu&#8217;il faut ajouter, les &#233;tiquettes des relations existantes qu&#8217;il faut raffiner et l&#8217;infor-
mation lexicale qu&#8217;il faut mettre sur les mots pour obtenir ce que nous appellerons un format enrichi DSC
(pour D&#233;pendances Syntaxiques Compl&#232;tes). Nous d&#233;crirons aussi le format DMRS que nous visons.
</p>
<p>Contrairement &#224; la r&#233;&#233;criture de termes ou de mots, il y a plusieurs d&#233;finitions possibles de la r&#233;&#233;criture
de graphes (Rozenberg, 1997). Chacune d&#8217;entres elles induit des propri&#233;t&#233;s calculatoires sp&#233;cifiques, en
particulier une s&#233;mantique op&#233;rationnelle caract&#233;ristique. De ce fait, le choix de la d&#233;finition est guid&#233; par
le domaine d&#8217;application. Dans notre &#233;tude, un nouveau calcul est n&#233;cessaire : le &#946;-calcul, pr&#233;sent&#233; &#224; la
</p>
<p>2. http://www.delph-in.net/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;&#201;CRITURE DE GRAPHES DE D&#201;PENDANCES POUR L&#8217;INTERFACE SYNTAXE-S&#201;MANTIQUE
</p>
<p>section 2. Notre approche est compatible avec des approches ant&#233;rieures, comme celle de (B&#233;daride &amp;
Gardent, 2008) qui traite des inf&#233;rences textuelles.
</p>
<p>Dans la section 3, nous d&#233;crirons un ensemble R1 de &#946;-r&#232;gles qui permettent de transformer les structures
de d&#233;pendances syntaxiques au format DSC en structures de d&#233;pendances s&#233;mantiques DMRS. Ainsi, sera
&#233;tabli de fa&#231;on formelle la proximit&#233; du format PASSAGE par rapport au format DMRS. Plus m&#234;me, nous
pointerons exactement quelles sont les informations manquantes du format PASSAGE pour produire des
repr&#233;sentations DMRS.
</p>
<p>Dans la section 4, nous illustrerons une autre facette de la souplesse du &#946;-calcul, son aptitude &#224; composer
des transformations. Nous d&#233;crirons un ensemble R2 de &#946;-r&#232;gles qui permettent d&#8217;obtenir, &#224; partir des
repr&#233;sentations s&#233;mantiques sous-sp&#233;cifi&#233;es de la DMRS, des mod&#232;les de ces repr&#233;sentations correspondant
&#224; diff&#233;rentes formes logiques, o&#249; les port&#233;es des quantificateurs et des adverbes ont &#233;t&#233; compl&#232;tement
fix&#233;es. Nous appellerons le format dans lequel ces mod&#232;les sont d&#233;finis le format DMRSF (F pour final).
</p>
<p>1 Enrichir le format PASSAGE pour produire des structures DMRS
</p>
<p>Le format PASSAGE Le format PASSAGE, si nous ignorons le volet des groupes syntaxiques, consiste
avant tout en un jeu de 14 &#233;tiquettes de relations. Chacune repr&#233;sente une fonction syntaxique avec &#233;ven-
tuellement en plus la cat&#233;gorie grammaticale du gouverneur de la relation. Par exemple, on distingue la
relation modifieur de nom (MOD_N) de celle de modifieur de verbe (MOD_V).
</p>
<p>L&#8217;annotation en d&#233;pendances syntaxiques selon PASSAGE de la phrase &#171; Jean lit un livre que Marie
conna&#238;t &#187; est donn&#233;e par la figure ci-dessous 3.
</p>
<p>Jean
np
</p>
<p>lit
v
</p>
<p>un
det
</p>
<p>livre
n
</p>
<p>que
rel
</p>
<p>Marie
np
</p>
<p>conna&#238;t
v
</p>
<p>SUJ_V COD_V SUJ_V
</p>
<p>COD_V
</p>
<p>MOD_N
</p>
<p>Le format DMRS Une structure en DMRS est un graphe dont les n&#339;uds sont des pr&#233;dicats et les arcs des
relations entre ces pr&#233;dicats. Ces arcs sont &#233;tiquet&#233;s par deux types d&#8217;informations :
&#8211; Si l&#8217;arc repr&#233;sente une relation pr&#233;dicat-argument, une &#233;tiquette pr&#233;cise la nature de cette relation :
rstr pour la restriction d&#8217;un quantificateur, arg1, arg2, arg3 pour les relations entre un pr&#233;dicat
standard et ses arguments selon un ordre d&#8217;oblicit&#233; canonique.
</p>
<p>&#8211; Des arcs &#233;tiquet&#233;s par EQ (resp. NEQ) indiquent que les deux pr&#233;dicats sont (resp. ne sont pas) associ&#233;s
dans une m&#234;me conjonction. L&#8217;&#233;tiquette H indique une relation de port&#233;e entre un pr&#233;dicat et un &#233;l&#233;ment
de cette port&#233;e : la restriction ou le corps pour un quantificateur par exemple.
</p>
<p>Reprenons l&#8217;exemple de la phrase &#171; Jean lit un livre que Marie conna&#238;t &#187;. Une repr&#233;sentation de sa
s&#233;mantique en DMRS est pr&#233;sent&#233;e dans la figure ci-dessous, si l&#8217;on consid&#232;re une lecture restrictive de la
relative.
</p>
<p>3. Pour se conformer &#224; l&#8217;usage en grammaires de d&#233;pendances, le sens des d&#233;pendances est invers&#233; par rapport au format
officiel PASSAGE. Le d&#233;terminant &#171; un &#187; reste isol&#233; car PASSAGE ignore les relations d&#233;terminant-nom.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>Marie
</p>
<p>conna&#238;tre
</p>
<p>livre
</p>
<p>Jean
</p>
<p>lire
</p>
<p>un
</p>
<p>ar
g1
</p>
<p>a
r
</p>
<p>g
2NE
</p>
<p>Q
</p>
<p>ar
g1
</p>
<p>arg2
</p>
<p>EQ rs
tr
</p>
<p>H
</p>
<p>L&#8217;arc &#233;tiquet&#233; rstr indique que le quantificateur &#171; un &#187;
a comme restriction le pr&#233;dicat &#171; livre &#187; et la relation &#233;ti-
quet&#233;e EQ entre &#171; conna&#238;tre &#187; et &#171; livre &#187; signifie que les
deux pr&#233;dicats doivent &#234;tre li&#233;s dans une m&#234;me conjonc-
tion, donc &#171; conna&#238;tre &#187; est aussi dans la restriction de
&#171; un &#187;. L&#8217;autre arc &#233;tiquet&#233; arg2 entre &#171; conna&#238;tre &#187; et
&#171; livre &#187; signifie que le pr&#233;dicat &#171; conna&#238;tre &#187; a comme
argument en position 2 (l&#8217;objet direct du verbe dans sa
forme canonique), un &#233;l&#233;ment caract&#233;ristique du pr&#233;di-
cat &#171; livre &#187;. La diff&#233;rence pour le pr&#233;dicat &#171; lire &#187; vis-
&#224;-vis du pr&#233;dicat &#171; conna&#238;tre &#187; est qu&#8217;il est reli&#233; par un arc &#233;tiquet&#233; NEQ &#224; &#171; livre &#187;, ce qui signifie que
les deux pr&#233;dicats ne sont pas associ&#233;s dans la m&#234;me conjonction, et donc que &#171; lire &#187; n&#8217;est pas dans la
restriction de &#171; un &#187;.
</p>
<p>Le format DSC Un examen informel d&#8217;exemples de phrases annot&#233;es en d&#233;pendances syntaxiques PAS-
SAGE et en d&#233;pendances s&#233;mantiques DMRS montre que les deux repr&#233;sentations sont relativement proches
mais qu&#8217;il manque certaines informations syntaxiques dans les d&#233;pendances PASSAGE pour obtenir les d&#233;-
pendances DMRS. Nous proposons ci-dessous un certain nombre d&#8217;enrichissements du format PASSAGE
de d&#233;part pour produire le format DSC (d&#233;pendances syntaxiques compl&#232;tes) et nous montrerons dans la
section 3 un ensemble de &#946;-r&#232;gles permettant de passer de DSC &#224; DMRS :
&#8211; Pour mod&#233;liser la quantification au niveau s&#233;mantique, il est n&#233;cessaire d&#8217;ajouter les relations DET
</p>
<p>d&#233;terminant-nom.
&#8211; Pour les propositions relatives, la relation anaphorique entre le pronom relatif et son ant&#233;c&#233;dent est
</p>
<p>indispensable, m&#234;me si on peut penser qu&#8217;elle rel&#232;ve de la r&#233;solution g&#233;n&#233;rale des anaphores, &#224; la dif-
f&#233;rence pr&#232;s qu&#8217;ici, elle est principalement d&#233;termin&#233;e par la syntaxe. Elle sera marqu&#233;e par l&#8217;&#233;tiquette
ANT.
</p>
<p>&#8211; Les pr&#233;positions, quand elles introduisent des compl&#233;ments requis, donnent des informations sur leur
r&#244;le s&#233;mantique, et lorsqu&#8217;elles introduisent des compl&#233;ments adjoints, elles peuvent &#234;tre consid&#233;r&#233;es
comme des pr&#233;dicats &#224; part enti&#232;re. Nous diff&#233;rencierons les &#233;tiquettes CPL_V en CPL_V_REQ pour
les compl&#233;ments requis et CPL_V_ADJ pour les compl&#233;ments adjoints.
Par ailleurs, dans les deux cas, il est n&#233;cessaire de conna&#238;tre la relation entre la pr&#233;position et la t&#234;te du
groupe nominal ou de la proposition qui suit. Cette relation n&#8217;appara&#238;t pas dans PASSAGE et elle doit
&#234;tre ajout&#233;e. Comme (Candito et al., 2009), on peut choisir OBJ pour l&#8217;&#233;tiqueter.
</p>
<p>&#8211; Comme les analyseurs syntaxiques participant &#224; PASSAGE travaillent avec des jeux d&#8217;&#233;tiquettes souvent
incompatibles, PASSAGE a choisi un jeu contenant un minimum d&#8217;information mais pour la s&#233;mantique,
il est n&#233;cessaire d&#8217;avoir une information plus pr&#233;cise. C&#8217;est par exemple le cas pour les relations AUX
qui ont besoin d&#8217;&#234;tre pr&#233;cis&#233;es en TPS ou PASSIF, selon que l&#8217;auxiliaire est un auxiliaire de temps ou du
passif. On a aussi besoin, pour les relations MOD_N et MOD_A de traiter &#224; part les compl&#233;ments requis
par les noms et les adjectifs, en sp&#233;cifiant les &#233;tiquettes sous la forme par exemple de CPL_N_REQ et
CPL_A_REQ.
</p>
<p>&#8211; Enfin, il est n&#233;cessaire d&#8217;enrichir les n&#339;uds des graphes avec des informations morphologiques, syn-
taxiques ou s&#233;mantiques, sous forme par exemple de structures de traits. Nous ne d&#233;taillerons pas ce
point ici.
</p>
<p>La motivation du format DSC ci-dessus est d&#8217;indiquer dans la m&#234;me structure toute l&#8217;information n&#233;ces-
saire au transfert vers une structure s&#233;mantique avec un petit nombre de r&#232;gles qui ne d&#233;pendent pas du</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;&#201;CRITURE DE GRAPHES DE D&#201;PENDANCES POUR L&#8217;INTERFACE SYNTAXE-S&#201;MANTIQUE
</p>
<p>lexique. Dans notre cadre, les relations syntaxiques sont beaucoup plus riches que celles de Kahane (2003)
par exemple o&#249; plus d&#8217;informations sont donn&#233;es dans l&#8217;interface plut&#244;t que dans la structure syntaxique.
</p>
<p>2 Formalisation des r&#232;gles de calcul
</p>
<p>Le principe calculatoire de notre syst&#232;me est la r&#233;&#233;criture de graphe, plus pr&#233;cis&#233;ment la r&#233;&#233;criture de
&#946;-structures. Un syst&#232;me de r&#233;&#233;criture consiste en un ensemble fini de r&#232;gles de la forme L &#8594;&#966; R : si
le motif L est reconnu dans une &#946;-structure, il sera remplac&#233; par R. On suppose fix&#233; un ensemble fini
d&#8217;&#233;tiquettes L.
</p>
<p>Structure Une &#946;-structure est donn&#233;e par un k + 2-uplet (V, `,&#8594;1, . . . ,&#8594;k) o&#249; V est un ensemble
fini de sommets, ` : V &#8594; L est une fonction d&#8217;&#233;tiquetage et pour tout i &#8804; k, &#8594;i est une relation
binaire (i.e.&#8594;i&#8834; V &#215; V ). En d&#8217;autres termes, on a un nombre fini de graphes sur le m&#234;me ensemble de
sommets. On utilisera la notation (V, `,&#8658;) comme une abr&#233;viation de (V, `,&#8594;1, . . . ,&#8594;k). &#201;tant donn&#233;e
une &#946;-structure G, on notera respectivement VG, `G et&#8658;G les &#233;l&#233;ments du triplet correspondant.
Dans les exemples de cet article, les sommets correspondent aux entit&#233;s lexicales et sont &#233;tiquet&#233;es par
des structures de traits qui contiennent, entre autres, la cat&#233;gorie syntaxique, le lemme ou la forme fl&#233;chie
par exemple. Les diff&#233;rentes relations sont repr&#233;sent&#233;es par des &#233;tiquettes (syntaxique ou s&#233;mantique) sur
les arcs 4.
</p>
<p>Motif Un motif L est une &#946;-structure (VL, `L,&#8658;L). Reconna&#238;tre un motif L dans une &#946;-structure (appe-
l&#233;e instance) I = (VI , `I ,&#8658;I) consiste &#224; construire un morphisme, c&#8217;est-&#224;-dire une fonction &#968; : VL &#8594; VI
telle que &#8704;x &#8712; V : `L(x) = `I(&#968;(x)) et &#8704;x, y &#8712; V : x &#8594;iL y &#8660; &#968;(x) &#8594;iI &#968;(y). Nous supposerons que
ces morphismes sont toujours injectifs 5.
</p>
<p>En d&#8217;autres termes, &#233;tant donn&#233; un motif &#224; n sommets, on doit distinguer dans l&#8217;instance le m&#234;me nombre
de sommets, chaque sommet identifi&#233; a la m&#234;me &#233;tiquette que son ant&#233;c&#233;dent et les sommets ont les m&#234;mes
relations entre eux.
</p>
<p>Jean
np
</p>
<p>lit
v
</p>
<p>un
det
</p>
<p>livre
n
</p>
<p>Jean
np
</p>
<p>lit
v
</p>
<p>Jean
np
</p>
<p>pense
v
</p>
<p>que
cpl
</p>
<p>Marie
np
</p>
<p>lit
v
</p>
<p>SUJ_V COD_V
</p>
<p>DET
</p>
<p>SUJ_V SUJ_V
COD_V
</p>
<p>COMP
</p>
<p>SUJ_V
</p>
<p>Dans la figure ci-dessus, nous avons un tel monomorphisme entre le motif au centre et la phrase de gauche.
Il est illustr&#233; par la mise en couleur verte.
</p>
<p>x
n
</p>
<p>y
v
</p>
<p>SUJ_V
</p>
<p>Du fait de l&#8217;absence de liens entre &#171; Jean &#187; et &#171; lit &#187; dans la phrase de droite, le motif
central n&#8217;est pas satisfait. Par la suite, pour que les r&#232;gles soient suffisamment g&#233;-
n&#233;riques, nous param&#233;trons les &#233;tiquettes. Le motif ci-contre recouvre ainsi tous les
motifs pour lesquels x est un nom et y un verbe, les deux &#233;tant reli&#233;s par une relation
SUJ_V.
</p>
<p>4. Il est en fait &#233;quivalent de consid&#233;rer un ensemble de relations ou une relation &#233;tiquet&#233;e.
5. Techniquement, &#968; est un monomorphisme plein.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>R&#233;&#233;criture Une r&#232;gle est un triplet L&#8594;&#966; R o&#249; L et R sont des &#946;-structures et &#966; est une fonction de VL
dans VR. La &#946;-structure L est le motif &#224; reconna&#238;tre, motif qui est remplac&#233; par R. La fonction &#966; d&#233;crit la
mani&#232;re de faire le recollement : les sommets de L sans image sont d&#233;truits, deux sommets ayant le m&#234;me
but sont fusionn&#233;s.
</p>
<p>x
v
</p>
<p>y
</p>
<p>COD_V
</p>
<p>obj
</p>
<p>x
v
</p>
<p>y
arg2
</p>
<p>x
aux
</p>
<p>y
v
</p>
<p>TPS
</p>
<p>x&#8853; y
v
</p>
<p>aux1
</p>
<p>x
n
</p>
<p>y
rel
</p>
<p>zANT
</p>
<p>MOD_N
</p>
<p>ar
g2
</p>
<p>ant_rel2
</p>
<p>x
n
</p>
<p>z
</p>
<p>arg
2
</p>
<p>EQ
</p>
<p>Dans les trois r&#232;gles ci-contre, en haut, on
trouve le motif, en bas son remplacement.
Les fl&#232;ches bleues pointill&#233;es d&#233;crivent la
fonction &#966;. En fait, les noms x, y et z em-
ploy&#233;s pour les &#233;tiquettes rendent compte de
cette fonction &#966;. x &#8853; y d&#233;note la fusion de
deux n&#339;uds x et y.
</p>
<p>Dans la r&#232;gle aux1, les deux n&#339;uds x et y
sont fusionn&#233;s. La structure de traits asso-
ci&#233;e &#224; la fusion contient en priorit&#233; les traits
sp&#233;cifi&#233;s dans la r&#232;gle (la cat&#233;gorie syntaxique v dans l&#8217;exemple), et l&#8217;unification des traits des n&#339;uds x et
y pour les autres traits. Dans la r&#232;gle ant_rel2, le sommet y est d&#233;truit.
</p>
<p>Jean
np
</p>
<p>lit
v
</p>
<p>un
det
</p>
<p>livre
n
</p>
<p>que
rel
</p>
<p>Marie
np
</p>
<p>conna&#238;t
v
</p>
<p>SUJ_V COD_V SUJ_VANT
</p>
<p>COD_VDET
</p>
<p>MOD_N
</p>
<p>obj
</p>
<p>Jean
np
</p>
<p>lit
v
</p>
<p>un
det
</p>
<p>livre
n
</p>
<p>que
rel
</p>
<p>Marie
np
</p>
<p>conna&#238;t
v
</p>
<p>SUJ_V COD_V ANT
</p>
<p>DET
</p>
<p>SUJ_V
</p>
<p>MOD_N
</p>
<p>arg2
</p>
<p>ant_rel2
</p>
<p>Jean
np
</p>
<p>lit
v
</p>
<p>un
det
</p>
<p>livre
n
</p>
<p>Marie
np
</p>
<p>conna&#238;t
v
</p>
<p>SUJ_V
</p>
<p>DET
</p>
<p>COD_V
</p>
<p>SUJ_V
</p>
<p>arg2
</p>
<p>EQ
</p>
<p>L&#8217;application d&#8217;une r&#232;gle L &#8594;&#966; R sur une &#946;-structure
I avec le morphisme &#968; : L &#8594; I produit une nouvelle
&#946;-structure F . En notant le contexte C = VI\&#968;(VL), on
d&#233;finit F = (C + VR, `L|C + `R,&#8658;F ) telle que x&#8594;iF y
est vraie ssi l&#8217;une des conditions suivantes est vraie :
</p>
<p>(a) x, y &#8712; VR et x &#8594;iR y (liens internes du motif de
remplacement),
</p>
<p>(b) x, y &#8712; C et x&#8594;iI y (liens internes du contexte),
(c) x = &#966;(x&#8242;) avec x&#8242; &#8712; VL, y &#8712; C et &#968;(x&#8242;)&#8594;iI y (lien
</p>
<p>du motif qui pointent vers un mot du contexte),
</p>
<p>(d) x &#8712; C, y = &#966;(y&#8242;) avec y&#8242; &#8712; VL et x&#8594;iI &#968;(y&#8242;) (lien
du contexte qui pointent vers un mot du motif).
</p>
<p>Un exemple d&#8217;applications des r&#232;gles de r&#233;&#233;criture est
donn&#233;e dans la figure ci-contre.
</p>
<p>3 De la syntaxe compl&#232;te &#224; la s&#233;mantique sous-sp&#233;cifi&#233;e
</p>
<p>Nous pouvons maintenant montrer concr&#232;tement comment des r&#232;gles de &#946;-calcul permettent de calcu-
ler une repr&#233;sentation s&#233;mantique sous-sp&#233;cifi&#233;e au format DMRS &#224; partir de d&#233;pendances syntaxiques
compl&#232;tes au format DSC. Fournir une proc&#233;dure de calcul de la s&#233;mantique &#224; partir de la syntaxe n&#8217;est
toutefois pas notre unique but ici : l&#8217;examen de la forme des &#946;-r&#232;gles utilis&#233;es permet de r&#233;pondre &#224; deux
questions.
</p>
<p>D&#8217;une part, sur quelles informations lexicales et syntaxiques les r&#232;gles s&#8217;appuient-elles ? Cela nous ren-
seigne essentiellement sur ce que le format de sortie (ici la DMRS) attend du format d&#8217;entr&#233;e (ici DSC).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;&#201;CRITURE DE GRAPHES DE D&#201;PENDANCES POUR L&#8217;INTERFACE SYNTAXE-S&#201;MANTIQUE
</p>
<p>D&#8217;autre part, les r&#232;gles sont-elles complexes ? De fa&#231;on caricaturale : les r&#232;gles font-elles de simples
changements d&#8217;&#233;tiquettes, ou modifient-elles lourdement la structure du graphe ? Cela nous renseigne sur
l&#8217;&#233;cart entre les deux formats consid&#233;r&#233;s : plus les r&#232;gles sont complexes en moyenne, plus l&#8217;information
d&#233;crite par les formats est de nature diff&#233;rente.
</p>
<p>&#192; titre d&#8217;exemple, consid&#233;rons la phrase &#171; Jean veut lui demander d&#8217;acheter un livre que Marie conna&#238;t &#187;.
</p>
<p>Jean
np
</p>
<p>veut
v
</p>
<p>actif
</p>
<p>lui
clit
</p>
<p>demander
v
</p>
<p>actif
</p>
<p>d&#8217;
prep
</p>
<p>acheter
v
</p>
<p>actif
</p>
<p>un
det
</p>
<p>livre
n
</p>
<p>que
rel
</p>
<p>Marie
np
</p>
<p>conna&#238;t
v
</p>
<p>actif
</p>
<p>SUJ_V
</p>
<p>SUJ_V
</p>
<p>COD_V COD_V COD_V SUJ_V
</p>
<p>MOD_N
</p>
<p>DET COD_VCPL_V_REQ
</p>
<p>SUJ_V
</p>
<p>ANT
</p>
<p>vouloir
</p>
<p>demander
</p>
<p>Marie
</p>
<p>conna&#238;tre
</p>
<p>livre
</p>
<p>Jean acheter
</p>
<p>lui
</p>
<p>un
</p>
<p>a
r
</p>
<p>g
1
</p>
<p>arg2
</p>
<p>H
</p>
<p>ar
g1 ar
</p>
<p>g
2H
</p>
<p>arg3
</p>
<p>arg1
</p>
<p>arg2NEQ
</p>
<p>ar
g1
</p>
<p>arg2
</p>
<p>EQ
</p>
<p>rst
r
</p>
<p>H
</p>
<p>L&#8217;analyse DSC de cette phrase montre qu&#8217;elle combine
un verbe &#224; contr&#244;le par le sujet &#171; veut &#187;, un verbe &#224;
contr&#244;le par le compl&#233;ment d&#8217;attribution &#171; demander &#187;
et une subordonn&#233;e relative &#171; que Marie conna&#238;t &#187;. En
vert, on distingue les ajouts faits &#224; PASSAGE : &#171; lui &#187;
est un compl&#233;ment requis (et qui n&#8217;est ni sujet ni objet
direct) du verbe, &#171; un &#187; est le d&#233;terminant de &#171; livre &#187;,
l&#8217;ant&#233;c&#233;dent du pronom relatif &#171; que &#187; est &#171; livre &#187;, et
les verbes sont &#224; la voix active. Comme nous l&#8217;avons
expliqu&#233; en section 1, ces informations sont n&#233;ces-
saires pour le calcul de la repr&#233;sentation s&#233;mantique en
DMRS. En particulier, conna&#238;tre la voix (active, passive
ou moyenne) du verbe permet de lui attribuer les bons
arguments s&#233;mantiques.
</p>
<p>Pour notre exemple, le calcul de la repr&#233;sentation DMRS
utilise sept &#946;-r&#232;gles : obj et ant_rel2 ont &#233;t&#233; pr&#233;sent&#233;es
en partie 2, det, suj2, v_v2, v_n2 et clit_cpl_req font partie du fragment donn&#233; ci-dessous. Le jeu complet
DSC-DMRS comporte une trentaine de r&#232;gles.
</p>
<p>Ces r&#232;gles correspondent toutes &#224; des principes linguistiques : par exemple, suj1 traduit le fait que l&#8217;arg2
d&#8217;un verbe &#224; la voix passive est fourni par son sujet, suj2 traduit le fait que l&#8217;arg1 d&#8217;un verbe &#224; la voix
active est fourni par son sujet, det traduit le fait que le nom est dans la restriction (rstr et H) du quantifi-
cateur introduit par son d&#233;terminant. . .
</p>
<p>La simplicit&#233; de ces r&#232;gles confirme une intuition : pour l&#8217;essentiel, les d&#233;pendances syntaxiques compl&#232;tes
et les d&#233;pendances s&#233;mantiques DMRS sont tr&#232;s proches. Quelques ph&#233;nom&#232;nes linguistiques laissent ce-
pendant un &#233;cart plus grand entre syntaxe compl&#232;te et s&#233;mantique. C&#8217;est le cas par exemple du tough
movement et de l&#8217;attribut de l&#8217;objet. La r&#232;gle tgh_mvt s&#8217;applique &#224; des expressions comme &#171; un livre fa-
cile &#224; lire &#187; : ce n&#8217;est pas le livre lui-m&#234;me qui est facile, c&#8217;est sa lecture. La r&#232;gle de r&#233;&#233;criture l&#8217;exprime
en produisant une structure qui correspond (approximativement) &#224; la paraphrase &#171; un livre qui est facile
&#224; lire &#187;. La r&#232;gle atb_o s&#8217;applique &#224; des expressions comme &#171; Jean trouve ce livre difficile &#187; : alors que
dans l&#8217;analyse syntaxique, l&#8217;objet ( &#171; livre &#187;) et son attribut ( &#171; difficile &#187;) ne sont pas li&#233;s, dans l&#8217;analyse
s&#233;mantique l&#8217;attribut de l&#8217;objet a celui-ci pour argument. La lecture obtenue se rapproche de la paraphrase</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>x
aux
</p>
<p>y
v
</p>
<p>passif
</p>
<p>PASSIF
</p>
<p>x&#8853; y
v
</p>
<p>passif
</p>
<p>aux2
</p>
<p>x
v
</p>
<p>passif
y
</p>
<p>SUJ_V
</p>
<p>suj1
</p>
<p>x
v
</p>
<p>passif
y
</p>
<p>arg2
</p>
<p>x
v
</p>
<p>actif
y
</p>
<p>SUJ_V
</p>
<p>suj2
</p>
<p>x
v
</p>
<p>actif
y
</p>
<p>arg1
</p>
<p>x
n
</p>
<p>y
det
</p>
<p>DET
</p>
<p>det
</p>
<p>x
n
</p>
<p>y
det
</p>
<p>H
</p>
<p>rstr
</p>
<p>x
v
</p>
<p>y
v
</p>
<p>arg2
</p>
<p>v_v2
</p>
<p>x
v
</p>
<p>y
v
</p>
<p>arg2
</p>
<p>H
</p>
<p>x
v
</p>
<p>y
n
</p>
<p>arg2
</p>
<p>v_n2
</p>
<p>x
v
</p>
<p>y
n
</p>
<p>arg2
</p>
<p>NEQ
</p>
<p>x
v
</p>
<p>y
clit
</p>
<p>CPL_V_REQ
</p>
<p>clit_cpl_req
</p>
<p>x
v
</p>
<p>y
clit
</p>
<p>arg3
</p>
<p>x
adj &#224;
</p>
<p>prep
</p>
<p>y
</p>
<p>z
v
</p>
<p>CPL_A_REQ
OBJ
</p>
<p>arg1
</p>
<p>argx
</p>
<p>tgh_mvt
x
adj
</p>
<p>y
</p>
<p>z
v
</p>
<p>NEQ
</p>
<p>arg1
</p>
<p>argx
</p>
<p>x
</p>
<p>y
v
</p>
<p>z
</p>
<p>COD_V ATB_O
</p>
<p>atb_o
</p>
<p>x
</p>
<p>y
v
</p>
<p>z
</p>
<p>arg1
</p>
<p>NEQ
</p>
<p>arg2
</p>
<p>&#171; Jean trouve que ce livre est difficile &#187;.
</p>
<p>4 De la s&#233;mantique sous-sp&#233;cifi&#233;e &#224; ses mod&#232;les
</p>
<p>Le &#946;-calcul permet &#233;galement de calculer des mod&#232;les DMRSF &#233;quivalents aux formules logiques qui
correspondent aux diff&#233;rentes lectures de la phrase. Dans un mod&#232;le DMRSF la port&#233;e de chaque quanti-
ficateur, verbe ou adverbe modal est fix&#233;e. Cette port&#233;e se d&#233;compose en une restriction, not&#233;e rstr, et
un corps, not&#233; body. On pr&#233;sente ici une partie du jeu de r&#232;gles qui g&#233;n&#232;re les mod&#232;les DMRSF pour une
structure DMRS donn&#233;e. En composant ce jeu de r&#232;gles avec celui pr&#233;sent&#233; &#224; la section 3, on peut calculer
les mod&#232;les DMRSF &#224; partir d&#8217;une analyse syntaxique compl&#232;te DSC.
</p>
<p>x y
rstr
</p>
<p>rstr_bv
</p>
<p>x y
rstr
</p>
<p>bv
</p>
<p>x
</p>
<p>y
</p>
<p>z
bv
</p>
<p>arg
x
</p>
<p>NEQ
</p>
<p>init_body
</p>
<p>x
</p>
<p>y
</p>
<p>z
bv
</p>
<p>arg
x
</p>
<p>NEQ
</p>
<p>body
</p>
<p>x
</p>
<p>y
</p>
<p>z
body
</p>
<p>arg
x
</p>
<p>integ_body
</p>
<p>x
</p>
<p>y
</p>
<p>z
</p>
<p>body
</p>
<p>arg
x
</p>
<p>x
</p>
<p>y z
</p>
<p>t
</p>
<p>body
EQ
</p>
<p>rstr
</p>
<p>integ_rstr
</p>
<p>x
</p>
<p>y z
</p>
<p>t
</p>
<p>body
</p>
<p>EQ
</p>
<p>rs
tr
</p>
<p>x
</p>
<p>y
</p>
<p>z
body
</p>
<p>bod
y
</p>
<p>ordre_total
</p>
<p>x
</p>
<p>y
</p>
<p>z
</p>
<p>body
</p>
<p>bod
y
</p>
<p>Les r&#232;gles correspondent aux phases successives du calcul de la port&#233;e des quantificateurs :
rstr_bv : D&#8217;abord on introduit un arc bv (pour Bound Variable) entre le quantificateur et le nom commun
</p>
<p>porteur de sa variable caract&#233;ristique. Cet arc restera fixe dans le calcul des mod&#232;les, contrairement
&#224; l&#8217;arc rstr qui bougera au fur et &#224; mesure du calcul de la restriction du quantificateur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#201;&#201;CRITURE DE GRAPHES DE D&#201;PENDANCES POUR L&#8217;INTERFACE SYNTAXE-S&#201;MANTIQUE
</p>
<p>init_body : On initialise ensuite le corps (not&#233; body) du quantificateur : tous les pr&#233;dicats qui sont dans
sa port&#233;e (ils ont pour argument la variable li&#233;e par le quantificateur) mais pas dans sa restriction (le
lien est de type NEQ) sont forc&#233;ment dans son corps.
</p>
<p>integ_body : Si un pr&#233;dicat (verbe, adverbe, adjectif, nom relationnel. . . ) a un argument qui se trouve
dans le corps de la port&#233;e d&#8217;un quantificateur, ce pr&#233;dicat fait lui aussi partie du corps de la port&#233;e.
</p>
<p>integ_rstr : La restriction d&#8217;un quantificateur peut contenir enti&#232;rement des quantificateurs de plus petite
port&#233;e.
</p>
<p>ordre_total : S&#8217;il y a ambigu&#239;t&#233; de port&#233;e entre deux quantificateurs, on g&#233;n&#232;re les deux lectures pos-
sibles. &#201;tant donn&#233;s deux quantificateurs A et B, une application de la r&#232;gle donnera port&#233;e large &#224;
A sur B et une autre application port&#233;e large &#224; B sur A.
</p>
<p>Consid&#233;rons la phrase &#171; Tous les &#233;l&#232;ves dont Jean conna&#238;t un parent sont arriv&#233;s &#187;. Pour obtenir le mod&#232;le
DMRSF &#233;quivalent &#224; la formule Tous[x, eleve(x) &#8743; Un[y, parent(y, x), connaitre(j, y)], arriver(x)] en
th&#233;orie des quantificateurs g&#233;n&#233;ralis&#233;es, on applique &#224; la repr&#233;sentation DMRS de la phrase les &#946;-r&#232;gles
suivantes :
</p>
<p>1. rstr_bv fixe le lien bv entre le quantificateur &#171; tous &#187; et &#171; &#233;l&#232;ves &#187; (le nom commun qui porte sa
variable caract&#233;ristique),
</p>
<p>2. rstr_bv fixe le lien bv entre le quantificateur &#171; un &#187; et &#171; parent &#187;,
</p>
<p>3. init_body amorce le corps de la port&#233;e de &#171; tous &#187; ; celui-ci contient &#171; arriver &#187;,
</p>
<p>4. init_body amorce le corps de la port&#233;e de &#171; un &#187; ; celui-ci contient &#171; conna&#238;tre &#187; et donc son argu-
ment &#171; Jean &#187;,
</p>
<p>5. integ_rstr int&#232;gre la s&#233;mantique de toute la subordonn&#233;e relative dans la restriction de &#171; tous &#187; ;
&#171; un &#187; et toute sa port&#233;e font donc partie de la restriction de &#171; tous &#187;. Cette application de r&#232;gle est
repr&#233;sent&#233;e ci-dessous.
</p>
<p>&#233;l&#232;ve
</p>
<p>arriver parent
</p>
<p>conna&#238;tre
</p>
<p>Jean
</p>
<p>un
</p>
<p>tous
</p>
<p>r
s
</p>
<p>t
r
</p>
<p>bo
dy
</p>
<p>r
s
</p>
<p>t
r b
</p>
<p>v
</p>
<p>ar
g1
</p>
<p>arg2
</p>
<p>NEQ
</p>
<p>b
v
</p>
<p>b
o
d
y
</p>
<p>arg1
</p>
<p>NEQ
</p>
<p>arg
1
</p>
<p>EQ
</p>
<p>&#233;l&#232;ve
</p>
<p>arriver parent
</p>
<p>conna&#238;tre
</p>
<p>Jean
</p>
<p>un
</p>
<p>tous
rstr
</p>
<p>bo
dy
</p>
<p>r
s
</p>
<p>t
r b
</p>
<p>v
</p>
<p>ar
g1
</p>
<p>arg2
</p>
<p>NEQ
</p>
<p>b
v
</p>
<p>b
o
d
y
</p>
<p>arg1
</p>
<p>NEQ
</p>
<p>arg
1
</p>
<p>EQ</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>Conclusion
</p>
<p>Nous avons utilis&#233; le &#946;-calcul, un calcul de r&#233;&#233;criture de graphes, pour examiner le lien entre d&#233;pendances
syntaxiques et s&#233;mantiques. En particulier, nous avons montr&#233; qu&#8217;en augmentant le format en d&#233;pendances
syntaxiques PASSAGE, on pouvait g&#233;n&#233;rer simplement une repr&#233;sentation s&#233;mantique sous-sp&#233;cifi&#233;e en
DMRS et, de l&#224;, des repr&#233;sentations logiques correspondant aux lectures d&#8217;un &#233;nonc&#233;. Le &#946;-calcul fournit
un cadre commun &#224; toutes les phases du calcul, ce qui contribue &#224; &#233;claircir les liens entre les diff&#233;rents
formats de repr&#233;sentation. Pour &#233;viter la surg&#233;n&#233;ration, nous projetons d&#8217;affiner notre jeu de &#946;-r&#232;gles par
une exp&#233;rimentation &#224; large &#233;chelle.
</p>
<p>Au m&#234;me titre que la construction d&#8217;un grand programme, construire un grand jeu de r&#232;gles est un pro-
bl&#232;me difficile. Parmi les soucis, notons ceux concernant la terminaison, la modularit&#233;, la coh&#233;rence des
r&#232;gles entre elles, leur compilation, etc. Notre approche formelle nous permet de r&#233;employer les techniques
traditionnelles de construction d&#8217;invariants, en d&#8217;autres termes, de pouvoir d&#233;terminer automatiquement
certaines des propri&#233;t&#233;s de nos syst&#232;mes de r&#232;gles. Nous travaillons activement &#224; ce sujet.
</p>
<p>R&#233;f&#233;rences
</p>
<p>B&#201;DARIDE P. &amp; GARDENT C. (2008). R&#233;&#233;criture et d&#233;tection d&#8217;implication textuelle. In Traitement
Automatique des Langues Naturelles - TALN 2008, p. 19&#8211;28, Avignon France.
</p>
<p>CANDITO M.-H., CRABB&#201; B., DENIS P. &amp; GU&#201;RIN F. (2009). Analyse syntaxique statistique du
fran&#231;ais : des constituants aux d&#233;pendances. In TALN 2009, Senlis, France.
</p>
<p>COPESTAKE A. (2009). Invited Talk : Slacker semantics : Why superficiality, dependency and avoidance
of commitment can be the right way to go. In Proceedings of the 12th Conference of the European
Chapter of the ACL (EACL 2009), p. 1&#8211;9, Athens, Greece : Association for Computational Linguistics.
</p>
<p>COPESTAKE A., FLICKINGER D., POLLARD C. &amp; SAG I. (2005). Minimal Recursion Semantics - an
Introduction. Research on Language and Computation, 3, 281&#8211;332.
KAHANE S. (2003). On the status of deep syntactic structure. In Proceedings of the First International
Conference on Meaning-Text Theory (MTT&#8217;03), p. 229&#8211;238, Paris.
</p>
<p>MEL&#8217;C&#780;UK I. (1988). Dependency Syntax : Theory and Practice. Albany : State Univ. of New York Press.
</p>
<p>G. ROZENBERG, Ed. (1997). Handbook of Graph Grammars and Computing by Graph Transformations,
Volume 1 : Foundations. World Scientific.</p>

</div></div>
</body></html>