<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Acquisition de paraphrases sous-phrastiques depuis des paraphrases d&#8217;&#233;nonc&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010 &#8211; Session Posters, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Acquisition de paraphrases sous-phrastiques
depuis des paraphrases d&#8217;&#233;nonc&#233;s
</p>
<p>Houda Bouamor Aur&#233;lien Max Anne Vilnat
LIMSI-CNRS, Univ. Paris-Sud
</p>
<p>Orsay, F-91403, France
{pr&#233;nom.nom}@limsi.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons la t&#226;che d&#8217;acquisition de paraphrases sous-phrastiques
(impliquant des paires de mots ou de groupes de mots), et d&#233;crivons plusieurs techniques op&#233;rant &#224; diff&#233;-
rents niveaux. Nous d&#233;crivons une &#233;valuation visant &#224; comparer ces techniques et leurs combinaisons sur
deux corpus de paraphrases d&#8217;&#233;nonc&#233;s obtenus par traduction multiple. Les conclusions que nous tirons
peuvent servir de guide pour am&#233;liorer des techniques existantes.
</p>
<p>Abstract. In this article, the task of acquiring sub-sentential paraphrases (word or phrase pairs) is
discussed and several automatic techniques operating at different levels are presented. We describe an
evaluation methodology to compare these techniques and their combination that is applied on two corpora
of sentential paraphrases obtained by multiple translation. The conclusions that are drawn can be used to
guide future work for improving existing techniques.
</p>
<p>Mots-cl&#233;s : Paraphrase, Patrons de correspondances de segments monolingues.
</p>
<p>Keywords: Paraphrase, Monolingual bi-phrase patterns.
</p>
<p>1 Introduction
</p>
<p>Le probl&#232;me de l&#8217;&#233;quivalence de sens entre segments textuels est au c&#339;ur des besoins du Traitement
Automatique des Langues. La capacit&#233; &#224; d&#233;terminer si deux mots, ou deux groupes de mots, ont la m&#234;me
signification dans leur contexte respectif permet de r&#233;soudre, au moins localement, les difficult&#233;s pos&#233;es
par la variation en langue. L&#8217;acquisition de groupes d&#8217;&#233;quivalence permet de constituer des ressources
pouvant &#234;tre utiles, par exemple, en g&#233;n&#233;ration pour aider des auteurs &#224; trouver des formulations plus
adapt&#233;es (Max, 2008). De nombreuses techniques ont &#233;t&#233; propos&#233;es pour l&#8217;acquisition de segments en
relation de paraphrase. La plupart de ces techniques exploitent des corpus monolingues disponibles en
grande quantit&#233;, et se fondent sur l&#8217;hypoth&#232;se que des unit&#233;s linguistiques apparaissant de nombreuses
fois dans des contextes similaires peuvent avoir la m&#234;me signification.
</p>
<p>En comparaison, peu de travaux ont port&#233; sur l&#8217;exploitation de corpus monolingues parall&#232;les, constitu&#233;s
de phrases en relation de paraphrase. Ce fait peut s&#8217;expliquer par la faible disponibilit&#233; de telles ressources
et par leur co&#251;t de construction. Mais elles pr&#233;sentent des caract&#233;ristiques qui en font les candidates les
plus naturelles pour l&#8217;&#233;tude de la paraphrase sous-phrastique. C&#8217;est donc dans ce cadre que se situe le
pr&#233;sent travail qui vise en particulier &#224; extraire des paraphrases de qualit&#233; dans le contexte d&#233;fini par des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HOUDA BOUAMOR, AUR&#201;LIEN MAX ET ANNE VILNAT
</p>
<p>paires de paraphrases d&#8217;&#233;nonc&#233;s. Nous passerons tout d&#8217;abord en revue les principaux travaux portant
sur l&#8217;acquisition de paraphrases sous-phrastiques (section 2), puis nous d&#233;crirons plus en d&#233;tails trois
techniques op&#233;rant au niveau des mots, des termes et de la syntaxe de la phrase sur des corpus monolingues
parall&#232;les (section 3). Nous pr&#233;senterons ensuite un cadre exp&#233;rimental (section 4) visant &#224; comparer et &#224;
combiner de fa&#231;on simple ces approches et nous terminerons par une discussion des r&#233;sultats obtenus et
une description de nos prochains travaux (section 5).
</p>
<p>2 Travaux pr&#233;c&#233;dents en acquisition de paraphrases locales
</p>
<p>Une hypoth&#232;se largement suivie pour extraire des segments textuels &#233;quivalents est que deux mots, et par
extension deux segments, qui partagent des contextes similaires peuvent &#234;tre interchangeables. Cette hy-
poth&#232;se de distributionnalit&#233; a notamment &#233;t&#233; appliqu&#233;e au cas de chemins de d&#233;pendances syntaxiques
par Lin &amp; Pantel (2001). Des corpus comparables monolingues, dans lesquels un m&#234;me contenu est
probablement d&#233;crit sous plusieurs formes, permettent de guider la mise en correspondance d&#8217;&#233;quiva-
lences locales. Ainsi, par exemple, Barzilay &amp; Lee (2003) introduisent une technique d&#8217;alignement multi-
s&#233;quence factorisant des phrases structurellement similaires de ces corpus sous forme de graphes, qui
contiennent par nature des &#233;quivalences locales. Une autre hypoth&#232;se utilis&#233;e est que des segments parta-
geant des traductions dans une autre langue peuvent &#234;tre des paraphrases dans certains contextes. Bannard
&amp; Callison-Burch (2005) ont ainsi d&#233;crit une approche exploitant plusieurs corpus parall&#232;les, et les tra-
vaux de Callison-Burch (2008) et Max (2008) prennent en compte le contexte (monolingue) pour &#233;valuer
la qualit&#233; des &#233;quivalences apprises.
</p>
<p>Toutes les approches pr&#233;c&#233;dentes sont limit&#233;es par le fait que de nombreux contextes ne correspondent pas
&#224; des emplois &#233;quivalents. Si des &#233;nonc&#233;s en relation de paraphrase sont disponibles, la t&#226;che d&#8217;extraction
de segments &#233;quivalents peut &#234;tre attaqu&#233;e comme une t&#226;che d&#8217;alignement fine o&#249; la mise en correspon-
dance est limit&#233;e aux mots et segments de la phrase. Des traductions multiples d&#8217;un m&#234;me &#233;nonc&#233; ont
notamment &#233;t&#233; utilis&#233;es dans ce cadre (Pang et al., 2003; Callison-Burch et al., 2008).
</p>
<p>3 Acquisition depuis des paraphrases d&#8217;&#233;nonc&#233;s
</p>
<p>3.1 Approche fond&#233;e sur l&#8217;apprentissage statistique d&#8217;alignements entremots (MOT)
</p>
<p>En traduction automatique statistique, l&#8217;approche la plus utilis&#233;e pour trouver des correspondances entre
segments dans des corpus parall&#232;les bilingues consiste &#224; apprendre des alignements entre mots dans chaque
direction de traduction (Och &amp; Ney, 2003), puis &#224; utiliser une heuristique de combinaison pour &#171; sym&#233;tri-
ser &#187; les alignements obtenus. Les mod&#232;les d&#8217;alignement appliqu&#233;s sur deux phrases parall&#232;les r&#233;sultent de
l&#8217;apprentissage sur l&#8217;ensemble des bitextes disponibles. Ainsi, plus la quantit&#233; de donn&#233;es est importante
et plus les donn&#233;es sont parall&#232;les, et plus les correspondances au niveau de chaque phrase sont pr&#233;cises.
En outre, ces mod&#232;les tendent &#224; aligner le plus de mots possibles en suivant l&#8217;hypoth&#232;se forte de parall&#233;-
lisme entre phrases d&#8217;une m&#234;me paire. Dans ce travail, nous constituons un corpus parall&#232;le monolingue
et r&#233;alisons toutes les mises en correspondance possibles entre &#233;nonc&#233;s appartenant &#224; un m&#234;me groupe de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ACQUISITION DE PARAPHRASES SOUS-PHRASTIQUES
</p>
<p>paraphrases, afin d&#8217;augmenter la quantit&#233; de donn&#233;es d&#8217;apprentissage. Nous utilisons le syst&#232;me MOSES1
</p>
<p>pour r&#233;aliser l&#8217;alignement avec le programme GIZA++ (Och &amp; Ney, 2003) pour l&#8217;alignement dans chaque
direction de traduction puis des heuristiques de sym&#233;trisation. Une fois une matrice d&#8217;alignement de mots
obtenue, nous ne consid&#233;rons que les bi-segments dont les mots sources (resp. cibles) sont align&#233;s avec au
moins un mot du segment cible (resp. source) et ne sont align&#233;s qu&#8217;avec des mots de ce segment.
</p>
<p>3.2 Approche fond&#233;e sur l&#8217;expression symbolique de la variation de termes (TERME)
</p>
<p>Deux &#233;nonc&#233;s en relation de paraphrase utilisent des mots communs ou des mots ou groupes de mots
en relation d&#8217;&#233;quivalence. Pour chaque paire de tels groupes, et sous certaines hypoth&#232;ses, il est possible
d&#8217;exprimer des r&#232;gles r&#233;gissant les variations syntagmatiques et paradigmatiques acceptables.
</p>
<p>L&#8217;op&#233;ration d&#8217;indexation contr&#244;l&#233;e du syst&#232;me FASTR (Jacquemin, 1999) d&#233;finit les variations acceptables
par un syst&#232;me de m&#233;tar&#232;gles s&#8217;appliquant &#224; des r&#232;gles de termes. Elles permettent d&#8217;exprimer les r&#233;&#233;cri-
tures morphosyntaxiques possibles, ainsi que les relations (au niveau des lemmes) d&#8217;ordre morphologique
ou s&#233;mantique contenues dans des ressources pr&#233;existantes. Dans notre travail, nous avons utilis&#233; cette
indexation contr&#244;l&#233;e pour trouver les alignements possibles entre les deux paraphrases d&#8217;une paire donn&#233;e
et qui sont trouv&#233;s dans les deux directions. &#201;tant donn&#233;es deux paraphrases d&#8217;&#233;nonc&#233;, nous recherchons
dans une premi&#232;re phrase (notre &#171; corpus &#187;) des variantes pour chacun des segments possibles de l&#8217;autre (&#224;
concurrence d&#8217;une certaine taille), puis nous inversons la recherche et retenons l&#8217;intersection des r&#233;sultats.
</p>
<p>3.3 Approche fond&#233;e sur l&#8217;alignement d&#8217;&#233;nonc&#233;s par fusion syntaxique (SYNT)
</p>
<p>L&#8217;exploitation du caract&#232;re parall&#232;le de deux &#233;nonc&#233;s peut &#234;tre pouss&#233;e encore plus loin : si ces &#233;nonc&#233;s
partagent une m&#234;me structure syntaxique, il est possible de r&#233;aliser un alignement fin guid&#233; par la syntaxe
permettant de faire appara&#238;tre des correspondances sous-phrastiques fines. C&#8217;est cette id&#233;e qui est mise
en &#339;uvre dans l&#8217;approche de fusion syntaxique propos&#233;e par Pang et al. (2003). Leur algorithme consiste
essentiellement &#224; fusionner r&#233;cursivement les arbres de constituants de deux &#233;nonc&#233;s l&#224; o&#249; les listes de
cat&#233;gories filles sont compatibles et qu&#8217;aucune &#233;vidence de non parall&#233;lisme syntaxique (via un m&#233;ca-
nisme de blocage lexical) n&#8217;est d&#233;tect&#233;e. La for&#234;t d&#8217;arbre syntaxique ainsi obtenue permet de construire
un automate &#224; &#233;tats finis repr&#233;sentant des formulations alternatives qu&#8217;il est possible d&#8217;extraire par simple
parcours de l&#8217;automate en bornant la taille des segments recherch&#233;s.
</p>
<p>Notre r&#233;impl&#233;mentation de cet algorithme am&#233;liore sa robustesse et sa correction. Nous avons tout d&#8217;abord
impl&#233;ment&#233; un mode de fusion flexible, o&#249; les parties de la phrase non concern&#233;es par un blocage lexical
sont tout de m&#234;me fusionn&#233;es. Par ailleurs, l&#8217;algorithme &#233;tant tr&#232;s d&#233;pendant de la qualit&#233; des analyses
syntaxiques, nous avons impl&#233;ment&#233; un mode dans lequel les k meilleures analyses produites par un ana-
lyseur probabiliste sont utilis&#233;es, et o&#249; la combinaison retenue entre la i-&#232;me analyse du premier &#233;nonc&#233;
et la j-&#232;me analyse du second parmi les k2 combinaisons possibles est celle minimisant le nombre de
n&#339;uds de l&#8217;automate obtenu avant r&#233;duction (fusion d&#8217;arcs correspondant &#224; des pr&#233;fixes ou &#224; des suffixes
communs). Pour notre impl&#233;mentation, nous avons utilis&#233; l&#8217;analyseur syntaxique probabiliste de Berke-
ley (Klein &amp; Manning, 2003) appris sur le fran&#231;ais pour produire les 5 meilleures analyses pour chaque
&#233;nonc&#233;, et nous avons effectu&#233; une recherche exhaustive de la meilleure fusion pour chaque paire.
</p>
<p>1http://www.statmt.org/moses</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HOUDA BOUAMOR, AUR&#201;LIEN MAX ET ANNE VILNAT
</p>
<p>4 Cadre exp&#233;rimental
</p>
<p>4.1 Constitution du corpus d&#8217;&#233;valuation
</p>
<p>Pour construire des corpus de d&#233;veloppement et d&#8217;&#233;valuation, nous avons eu recours &#224; une collecte de
traductions multiples de d&#233;bats parlementaires Europ&#233;ens du corpus Europarl2 vers le fran&#231;ais via une
m&#234;me source depuis plusieurs langues (Bouamor, 2010). Nous avons extrait deux sous-corpus constitu&#233;s
de groupes de paraphrases pour les 50 m&#234;mes &#233;nonc&#233;s afin de permettre la comparaison des techniques
d&#8217;acquisition &#233;tudi&#233;es en fonction du caract&#232;re plus ou moins litt&#233;ral des traductions et donc des para-
phrases obtenues. Un premier corpus est constitu&#233; de paraphrases obtenues par traduction depuis une
m&#234;me phrase en anglais, et un second corpus est constitu&#233; par des traductions depuis l&#8217;allemand, l&#8217;espa-
gnol, l&#8217;italien et le portugais. Nous disposons donc de deux corpus constitu&#233;s de 50 groupes de 4 para-
phrases. Nous consid&#233;rons une paraphrase de chaque groupe comme une paraphrase &#171; de r&#233;f&#233;rence &#187;, qui
devra &#234;tre align&#233;e avec chacune des 3 autres paraphrases de son groupe. Trois annotateurs ont align&#233; au
niveau des mots chacune des 300 paires de paraphrases (2 corpus x 50 groupes x 3 alignements).
</p>
<p>4.2 R&#233;sultats exp&#233;rimentaux
</p>
<p>Nous avons suivi l&#8217;approche PARAMETRIC d&#233;crite dans (Callison-Burch et al., 2008) pour &#233;valuer les
diff&#233;rentes techniques &#233;tudi&#233;es, dans laquelle un ensemble de bi-segments de r&#233;f&#233;rence est compar&#233; aux
bi-segments propos&#233;s par une technique d&#8217;acquisition op&#233;rant sur une paire d&#8217;&#233;nonc&#233;s par le calcul de
valeurs de pr&#233;cision et de rappel, d&#233;finies respectivement comme la proportion des candidats propos&#233;s
appartenant &#224; la r&#233;f&#233;rence (pr&#233;cision) et la proportion des &#233;l&#233;ments de la r&#233;f&#233;rence propos&#233;s (rappel).
Chacune des techniques pr&#233;sent&#233;es dans la section 3 permet d&#8217;extraire un certain nombre de bi-segments
candidats pour chaque paire d&#8217;&#233;nonc&#233;s disponible. Les bi-segments constitu&#233;s d&#8217;une paire d&#8217;un m&#234;me
segment (ind&#233;pendamment de la casse) ne sont pas consid&#233;r&#233;s, et une m&#234;me taille maximale de 6 tokens
est appliqu&#233;e aux deux segments. Nous avons suivi deux strat&#233;gies &#233;l&#233;mentaires pour combiner les r&#233;sultats
de plusieurs techniques : 1) la fusion d&#8217;hypoth&#232;ses par l&#8217;union (sans doublon) des listes de bi-segments
propos&#233;es par plusieurs techniques, visant &#224; augmenter la quantit&#233; d&#8217;hypoth&#232;ses produites ; 2) la fusion par
l&#8217;intersection des listes de bi-segments, visant &#224; augmenter la qualit&#233; des hypoth&#232;ses retenues. La Table 1
pr&#233;sente les r&#233;sultats obtenus pour les techniques &#233;tudi&#233;es et certaines de leurs combinaisons.
</p>
<p>Le r&#233;sultat le plus marquant concerne les diff&#233;rences de performance des diff&#233;rentes techniques, tant au
niveau de la pr&#233;cision que du rappel, sur les deux corpus : il est beaucoup plus ais&#233; de r&#233;aliser la t&#226;che
d&#8217;extraction de bi-segments lorsque les paraphrases utilis&#233;es sont proches. La technique fond&#233;e sur la syn-
taxe (SYNT) y est bien s&#251;r tr&#232;s sensible, tout comme celle fond&#233;e sur l&#8217;alignement entre mots (MOT), ce
qui se retrouve en traduction statistique pour des paires de langues r&#233;put&#233;es difficiles &#224; aligner. Concernant
le rappel, une forte disparit&#233; existe entre l&#8217;approche statistique d&#8217;un c&#244;t&#233; (MOT) et les approches symbo-
liques de l&#8217;autres (TERME et SYNT), ces deux derni&#232;res proposant comparativement peu de bi-segments de
r&#233;f&#233;rence. Il est notable que MOT parvienne tout de m&#234;me &#224; obtenir une pr&#233;cision correcte, bien que moins
importante que celle de SYNT. Les relatives bonnes performances g&#233;n&#233;rales de MOT &#233;taient attenudes, et
sont prometteuses dans un contexte o&#249; davantage de donn&#233;es viendraient &#224; &#234;tre disponibles. TERME se
sp&#233;cialise dans l&#8217;extraction de bi-segments de certains types, qui sont en tr&#232;s petit nombre en regard de
</p>
<p>2http://www.statmt.org/europarl</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ACQUISITION DE PARAPHRASES SOUS-PHRASTIQUES
</p>
<p>MOT TERME SYNT M&#8746;T M&#8745;T T&#8746;S T&#8745;S M&#8746;S M&#8745;S M&#8746;T&#8746;S
Paraphrases obtenues par traduction de l&#8217;anglais
</p>
<p>P 41,94 41,19 50,16 41,54 55,97 46,48 80,76 40,83 71,21 40,46
R/3578 67,07 3,07 8,77 67,66 2,48 11,26 0,58 67,83 8,02 68,41
F1 51,61 5,87 14,93 51,47 4,76 18,13 1,16 50,98 14,41 50,58
</p>
<p>Paraphrases obtenues par traduction depuis plusieurs langues
P 27,05 35,98 40,46 27,08 42,98 39,46 28,57 26,91 50,15 26,90
</p>
<p>R/2517 51,80 3,05 8,26 52,92 1,94 11,08 0,23 53,43 6,63 54,39
F1 35,54 6,07 13,72 35,83 3,72 17,30 0,47 35,79 11,72 36,00
</p>
<p>TAB. 1 &#8211; R&#233;sultats obtenus pour chaque technique et certaines combinaisons
</p>
<p>la taille de l&#8217;ensemble de r&#233;f&#233;rence, mais d&#8217;une pr&#233;cision correcte. Les diff&#233;rentes combinaisons essay&#233;es
font appara&#238;tre des gains attendus en rappel lorsqu&#8217;une union de r&#233;sultats est r&#233;alis&#233;e, et en pr&#233;cision lors-
qu&#8217;une intersection est r&#233;alis&#233;e. Sur le premier corpus, la pr&#233;cision maximale est atteinte en r&#233;alisant des
intersections impliquant les r&#233;sultats de TERME, et le rappel maximal en r&#233;alisant des unions impliquant
les r&#233;sultats de MOT. Les r&#233;sultats sont sensiblement les m&#234;mes sur le second corpus, &#224; l&#8217;exception de
l&#8217;intersection des r&#233;sultats de SYNT avec ceux de TERME.
</p>
<p>Para 1 (de) En ce qui concerne les relations internationales , la communaut&#233; doit s&#8217; y attaquer de mani&#232;re d&#233;termin&#233;e et s&#8217; accorder avec la politique
ext&#233;rieure
</p>
<p>Para 2 (it) Quant aux relations internationales , la Communaut&#233; est confront&#233;e aux d&#233;cisions relatives &#224; la politique &#233;trang&#232;re
REF (En ce qui concerne&#8596;Quant aux) (En ce qui concerne les relations&#8596;Quant aux relations) (la politique ext&#233;rieure&#8596;la politique &#233;tran-
</p>
<p>g&#232;re) (politique ext&#233;rieure&#8596;politique &#233;trang&#232;re) (ext&#233;rieure&#8596;&#233;trang&#232;re)
MOT (En&#8596;Quant) (ce&#8596;&#224;) (concerne les&#8596;aux) (concerne les relations&#8596;aux relations) (concerne les relations internationales&#8596;aux relations in-
</p>
<p>ternationales) (concerne les relations internationales ,&#8596;aux relations internationales ,) (concerne les relations internationales , la&#8596;aux re-
lations internationales , la) (la communaut&#233; doit s&#8217; y attaquer&#8596;la Communaut&#233; est confront&#233;e aux d&#233;cisions) (communaut&#233; doit s&#8217; y
attaquer&#8596;Communaut&#233; est confront&#233;e aux d&#233;cisions) (doit s&#8217; y attaquer&#8596;est confront&#233;e aux d&#233;cisions) (d&#233;termin&#233;e&#8596;relatives) (la politique
ext&#233;rieure&#8596;la politique &#233;trang&#232;re) (ext&#233;rieure&#8596;&#233;trang&#232;re)
</p>
<p>TERME (politique ext&#233;rieure&#8596;politique &#233;trang&#232;re) (ext&#233;rieure&#8596;&#233;trang&#232;re)
SYNT (En ce qui concerne les&#8596;Quant aux)
</p>
<p>TAB. 2 &#8211; Exemples de bi-segments extraits par les diff&#233;rentes techniques &#224; partir d&#8217;une paire de para-
phrases produites depuis l&#8217;allemand et l&#8217;italien (les bi-segments en gras appartiennent &#224; l&#8217;ensemble de
r&#233;f&#233;rence)
</p>
<p>La Table 2 illustre ces r&#233;sultats sur un exemple d&#8217;alignement entre deux paraphrases obtenues &#224; partir
de l&#8217;allemand et de l&#8217;italien, dont l&#8217;alignement s&#8217;av&#232;re difficile comme confirm&#233; par le faible nombre de
bi-segments dans l&#8217;ensemble de r&#233;f&#233;rence. MOT n&#8217;a pas pu aligner de fa&#231;on fiable les mots et a produit
de nombreux bi-segments incorrects. TERME et SYNT n&#8217;ont au contraire propos&#233; que peu de candidats
(appartenant &#224; l&#8217;ensemble de r&#233;f&#233;rence), ce qui refl&#232;te l&#224; aussi les difficult&#233;s de mise en correspondance
rencontr&#233;es par ces deux techniques. Concernant plus pr&#233;cis&#233;ment SYNT, il est par exemple &#224; noter que
le bi-segment (la communaut&#233;&#8596;la Communaut&#233;), correspondant &#224; des syntagmes nominaux dans des
positions syntaxiquement compatibles dans les deux phrases, a &#233;t&#233; propos&#233; mais filtr&#233; (c&#8217;est &#233;galement le
cas pour TERME) ; les syntagmes verbaux, de structures diff&#233;rentes, n&#8217;ont eux pu &#234;tre align&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HOUDA BOUAMOR, AUR&#201;LIEN MAX ET ANNE VILNAT
</p>
<p>5 Discussion et travaux futurs
</p>
<p>Dans cet article, nous avons d&#233;crit et situ&#233; la t&#226;che d&#8217;extraction de paraphrases sous-phrastiques &#224; partir
d&#8217;&#233;nonc&#233;s en relation de paraphrase, une condition difficile &#224; obtenir mais qui permet de se concentrer sur
un cadre naturel d&#8217;&#233;tude des ph&#233;nom&#232;nes de paraphrase. En outre, les correspondances extraites peuvent
&#234;tre facilement associ&#233;es &#224; un contexte, ce qui peut &#234;tre utilis&#233; par la suite pour initialiser la caract&#233;risation
des contextes dans lesquels ces paraphrases sont valides. Les diff&#233;rentes techniques que nous avons mises
en &#339;uvre, &#224; l&#8217;origine d&#233;velopp&#233;es pour des besoins diff&#233;rents, se sont r&#233;v&#233;l&#233;es relativement compl&#233;men-
taires, et permettent sous certaines conditions d&#8217;obtenir des r&#233;sultats acceptables en termes de pr&#233;cision et
de rappel relativement &#224; un ensemble de r&#233;f&#233;rence.
</p>
<p>Nos travaux futurs s&#8217;orientent dans trois directions : tout d&#8217;abord, nous souhaitons pouvoir g&#233;n&#233;raliser les
correspondances obtenues et viser l&#8217;acquisition de patrons int&#233;grant des &#233;l&#233;ments de contexte. Ensuite,
nous souhaitons &#233;tendre les techniques existantes et travailler &#224; une hybridation efficace lors de l&#8217;acquisi-
tion elle-m&#234;me, et non plus simplement sous forme de fusion de r&#233;sultats. Enfin, nous souhaitons mettre
en &#339;uvre des techniques de validation &#224; plus large &#233;chelle sur des corpus monolingues comparables des
paraphrases obtenues.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BANNARD C. &amp; CALLISON-BURCH C. (2005). Paraphrasing with bilingual parallel corpora. In Actes
de ACL, p. 597&#8211;604, Ann Arbor, USA.
</p>
<p>BARZILAY R. &amp; LEE L. (2003). Learning to paraphrase : an unsupervised approach using multiple-
sequence alignment. In Actes de NAACL-HLT, p. 16&#8211;23, Edmonton, Canada.
</p>
<p>BOUAMOR H. (2010). Construction d&#8217;un corpus de paraphrases d&#8217;&#233;nonc&#233;s par traduction multilingue
multisource. In R&#233;cital-TALN, Montr&#233;al, Canada.
</p>
<p>CALLISON-BURCH C. (2008). Syntactic constraints on paraphrases extracted from parallel corpora. In
Actes de EMNLP, p. 196&#8211;205, Hawai, USA.
</p>
<p>CALLISON-BURCH C., COHN T. &amp; LAPATA M. (2008). Parametric : An automatic evaluation metric
for paraphrasing. In Actes de COLING, p. 97&#8211;104, Manchester, UK.
</p>
<p>JACQUEMIN C. (1999). Syntagmatic and paradigmatic representations of term variation. In Actes de
ACL, p. 341&#8211;348, College Park, &#201;tats-Unis.
</p>
<p>KLEIN D. &amp; MANNING C. (2003). A* parsing : Fast exact viterbi parse selection. In Actes de NAACL-
HLT, p. 119&#8211;126, Edmonton, Canada.
</p>
<p>LIN D. &amp; PANTEL P. (2001). Discovery of inference rules for question answering. Natural Language
Engineering, 7(4), 343&#8211;360.
MAX A. (2008). G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision. In Actes de
TALN, Avignon, France.
</p>
<p>OCH F. J. &amp; NEY H. (2003). A systematic comparison of various statistical alignment models. Compu-
tational Linguistics, p. 19&#8211;51.
</p>
<p>PANG B., KNIGHT K. &amp; MARCU D. (2003). Syntax-based alignement of multiple translations : Extrac-
ting paraphrases and generating new sentences. In Actes de NAACL-HLT, Edmonton, Canada.</p>

</div></div>
</body></html>