<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L&#8217;apport des concepts m&#233;tiers pour la classification des questions ouvertes d&#8217;enqu&#234;te</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>L&#8217;apport des concepts m&#233;tiers pour la classification des questions ouvertes 
d&#8217;enqu&#234;te. 
</p>
<p>Ludivine Kuznik1 3   Anne-Laure Gu&#233;net1 Anne Peradotto2   Chlo&#233; Clavel2       
 
</p>
<p>(1)  Electricit&#233; de France, Direction Commerce, 92050 Paris La D&#233;fense, France 
(2) Electricit&#233; de France R&amp;D, 92141 Clamart, France  
</p>
<p>(3) Soci&#233;t&#233; Lincoln , 92570 Boulogne-Billancourt, France 
ludivine-externe.kuznik@edf.fr, anne-laure.guenet@edf.fr, anne.peradotto@edf.fr, 
</p>
<p>chloe.clavel@edf.fr 
</p>
<p>R&#233;sum&#233; EDF utilise les techniques de Text Mining pour optimiser sa relation client, en analysant des 
r&#233;ponses aux questions ouvertes d'enqu&#234;te de satisfaction, et des retranscriptions de conversations issues des 
centres d'appels. Dans cet article, nous pr&#233;sentons les diff&#233;rentes contraintes applicatives li&#233;es &#224; l&#8217;utilisation 
d&#8217;outils de text mining pour l&#8217;analyse de donn&#233;es clients. Apr&#232;s une analyse des diff&#233;rents outils pr&#233;sents sur 
le march&#233;, nous avons identifi&#233; la technologie Skill CartridgeTM fournie par la soci&#233;t&#233; TEMIS comme la plus 
adapt&#233;e &#224; nos besoins. Cette technologie nous permet une mod&#233;lisation s&#233;mantique de concepts li&#233;s au motif 
d&#8217;insatisfaction. L&#8217;apport de cette mod&#233;lisation est illustr&#233;e pour une t&#226;che de classification de r&#233;ponses 
d&#8217;enqu&#234;tes de satisfaction charg&#233;e d&#8217;&#233;valuer la fid&#233;lit&#233; des clients EDF. La mod&#233;lisation s&#233;mantique a permis 
une nette am&#233;lioration des scores de classification (F-mesure = 75,5%) notamment pour les cat&#233;gories 
correspondant &#224; la satisfaction et au m&#233;contentement. 
</p>
<p>Abstract The French power supply company EDF uses text mining tools to improve customer insight by 
analysing satisfaction inquiries or transcriptions of call-centre conversations. In this paper, we present the 
various application needs for text mining tools. After an analysis of the various existing industrial tools, we 
identify the Skill Cartridge tool provided by TEMIS company as the more relevant to our needs. This tool 
offers the capability to model expressions linked to reason for satisfaction/dissatisfaction. The contribution of 
this modelling is illustrated here for the classification of satisfaction inquiries dedicated to the evaluation of 
customer loyalty. The semantic models provide a marked improvement of classification scores (F-mesure = 
75.5%) for the satisfaction/dissatisfaction categories in particular. 
</p>
<p>Mots-cl&#233;s :   outils de text mining, mod&#233;lisation de concepts m&#233;tier, classification supervis&#233;e 
Keywords:   text mining tools, business concept modelling, supervised classification 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LUDIVINE KUZNIK    ANNE-LAURE GUENET   ANNE PERADOTTO   CHLOE CLAVEL  
</p>
<p>1 Introduction 
Une bonne connaissance de ses clients et de leurs besoins est essentielle pour EDF, notamment afin 
d&#8217;adapter ses produits et services. Depuis 2003, EDF analyse de mani&#232;re automatique les diff&#233;rentes 
sources de donn&#233;es textuelles dont elle dispose, &#224; l&#8217;aide de techniques de fouille de contenu et de 
mod&#233;lisation. Ces techniques ont pour vocation de faciliter le traitement et l&#8217;analyse de ces donn&#233;es par les 
marketeurs du Groupe. Par exemple, une description des th&#233;matiques abord&#233;es dans les centres d&#8217;appel a 
&#233;t&#233; obtenue par l&#8217;analyse des champs libres remplis par le conseiller en ligne, consign&#233;s dans nos Syst&#232;mes 
d&#8217;Information. Dans la m&#234;me optique, EDF analyse des retranscriptions automatiques de conversations 
issues de ses centres d&#8217;appels. Un autre moyen de conna&#238;tre les besoins de nos Clients est l&#8217;analyse 
d&#8217;enqu&#234;tes de satisfaction. Les r&#233;ponses aux questions ouvertes offrent un point de vue compl&#233;mentaire &#224; 
celles des questions ferm&#233;es, et sont susceptibles de refl&#233;ter davantage l'&#233;tat d&#8217;esprit du client et ses 
attentes car elles proviennent de son expression libre.  
</p>
<p>L&#8217;outil utilis&#233; &#224; EDF pour le traitement de ces diff&#233;rentes donn&#233;es textuelles permet d&#8217;effectuer de la 
classification, supervis&#233;e et non supervis&#233;e, de documents. Les m&#233;thodes tout d&#8217;abord employ&#233;es ne 
prenaient pas en compte la s&#233;mantique v&#233;hicul&#233;e par les mots : apr&#232;s une lemmatisation puis un filtrage 
des mots bas&#233; sur la cat&#233;gorie grammaticale et la fr&#233;quence (TF-IDF), des rapprochements entre 
documents &#233;taient fait &#224; l&#8217;aide de m&#233;thodes statistiques classiques, chaque document &#233;tant consid&#233;r&#233; 
comme un &#8216;sac de mots&#8217; (perte de l&#8217;ordre d&#8217;apparition des mots). L&#8217;information fournie par l&#8217;analyse 
th&#233;matique de ces documents a &#233;t&#233; jug&#233;e pertinente par les marketeurs d&#8217;EDF. Cependant, certains aspects 
se sont av&#233;r&#233;s trop d&#233;taill&#233;s par rapport &#224; leurs besoins, tandis que d&#8217;autres ne l&#8217;&#233;taient pas suffisamment.  
</p>
<p>Deux probl&#232;mes applicatifs ont notamment &#233;t&#233; soulev&#233;s. Le premier concerne la prise en compte de la 
n&#233;gation et plus g&#233;n&#233;ralement de la s&#233;mantique. Pour la n&#233;gation par exemple, dans les deux phrases 
suivantes &#171; J&#8217;ai un probl&#232;me &#187; / &#171; Je n&#8217;ai jamais eu de probl&#232;me &#187;, notre analyse statistique repose 
uniquement sur le nom &#171; probl&#232;me &#187; et l&#8217;antinomie des deux phrases est perdue, ce qui n&#8217;est pas adapt&#233; 
pour l&#8217;analyse de la satisfaction et du m&#233;contentement. Plus g&#233;n&#233;ralement pour la s&#233;mantique, les 
concepts m&#233;tier sont parfois mal discrimin&#233;s. Par exemple, pour la th&#233;matique m&#233;tier FACTURATION, 
les r&#233;ponses identifi&#233;es seront celles contenant les mots &#171; facture &#187;, &#171; mensualisation &#187;, &#171; pr&#233;l&#232;vement &#187;, &#171; 
estimation &#187;, &#171; duplicata &#187;, &#171; relance &#187; ou &#171; consommation estim&#233;e &#187;&#8230;. Par contre, les documents 
contenant des phrases du type &#171; la facture est ch&#232;re &#187; devront &#234;tre int&#233;gr&#233;s &#224; la th&#233;matique m&#233;tier PRIX. Un 
autre exemple : les deux phrases suivantes &#171; oui, tout va bien &#187; et &#171; non, cela ne va pas du tout &#187; 
deviennent, apr&#232;s lemmatisation et filtrage grammatical, &#171; aller &#187;. Le sens et la polarit&#233; sont perdus. Le 
second probl&#232;me applicatif concerne le ciblage de l&#8217;&#233;tude par rapport aux besoins op&#233;rationnels. 
Suivant les cas, il conviendra de d&#233;tailler certains aspects sp&#233;cifiques, pour aider &#224; la cr&#233;ation d&#8217;un 
nouveau service par exemple, alors que dans d&#8217;autres &#233;tudes, c&#8217;est une analyse fine de la satisfaction et du 
m&#233;contentement qui devra primer. 
</p>
<p>Afin d&#8217;am&#233;liorer nos r&#233;sultats, et afin que ces derniers soient plus pertinents du point de vue du besoin 
op&#233;rationnel, une part de s&#233;mantique a &#233;t&#233; introduite dans nos analyses. Ainsi, des mots et des expressions 
ont &#233;t&#233; d&#233;tect&#233;s comme &#233;tant des concepts m&#233;tier, ou regroup&#233;s au sein de concepts li&#233;s &#224; la satisfaction ou 
au m&#233;contentement de nos clients, de mani&#232;re plus pr&#233;cise.  
</p>
<p>Depuis quelques ann&#233;es, de nombreux travaux se focalisent sur la d&#233;tection des sentiments et opinions. De 
m&#234;me, des &#233;diteurs commencent &#224; proposer une d&#233;tection automatique de ces expressions. Nous suivons </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;APPORT DES CONCEPTS METIERS POUR LA CLASSIFICATION DES QUESTIONS OUVERTES D&#8217;ENQUETE. 
ces travaux de pr&#232;s, notamment en participant au projet collaboratif DoXa1. Cependant, la sp&#233;cificit&#233; de 
nos corpus nous impose de pouvoir ajuster ces mod&#233;lisations g&#233;n&#233;riques. 
L&#8217;objet de cet article est dans un premier temps de d&#233;crire le protocole suivi pour choisir un outil de text 
mining permettant l&#8217;ajout de s&#233;mantique m&#233;tier et r&#233;pondant &#224; nos exigences de production. Cet outil, 
LUXID&#174;de l&#8217;&#233;diteur TEMIS&#174;, a &#233;t&#233; acquis par EDF fin 2009. La seconde partie de l&#8217;article illustrera sur 
un cas d&#8217;usage et des donn&#233;es client, l&#8217;apport de l&#8217;enrichissement du texte par des concepts sur les t&#226;ches 
pr&#233;dictives (classement des verbatims dans des cat&#233;gories pr&#233;d&#233;finies). 
</p>
<p>2 Recherche d&#8217;un outil de text mining adapt&#233; &#224; nos besoins : le choix de 
Luxid&#174; (TEMIS) 
</p>
<p>Apr&#232;s avoir recens&#233; les outils de Text Mining pr&#233;sents sur le march&#233;, &#224; partir des &#233;tudes comparatives 
mises &#224; jour de (Chaumier, Dejean, 2003), (Deveaux et al., 2005) et (Filippone, 2006), nous leur avons 
appliqu&#233; les crit&#232;res d&#233;finis dans le protocole d&#8217;&#233;valuation des outils de text mining (Quatrain et al. , 
2004). Outre les fonctionnalit&#233;s pr&#233;sentes, nous avons &#233;galement pris en compte des crit&#232;res li&#233;s &#224; la 
finalit&#233; industrielle de son utilisation &#224; EDF, soit un outil commercialis&#233; par une soci&#233;t&#233; p&#233;renne, 
proposant un support de qualit&#233; et une offre de prestation. De fait, ont &#233;t&#233; exclus de l&#8217;&#233;tude les outils 
&#171; open-source &#187;. L&#8217;outil devra &#233;galement permettre de traiter une volum&#233;trie importante, disposer de 
ressources en fran&#231;ais, et enfin offrir des traitements linguistiques et statistiques de qualit&#233;. Les crit&#232;res 
consid&#233;r&#233;s pour les traitements linguistiques sont ceux cit&#233;s dans l&#8217;introduction : ils doivent permettre le 
ciblage de th&#233;matiques m&#233;tier et une mod&#233;lisation s&#233;mantique fine (cr&#233;ation de concepts) pour analyser 
des opinions, par exemple. 
</p>
<p>Trois outils ont ainsi &#233;t&#233; s&#233;lectionn&#233;s et &#233;valu&#233;s en fonction de ces crit&#232;res : PASW Modeler Text 
Analytics de SPSS ; le couplage de l&#8217;outil linguistique XEROX/XIP2 et d&#8217;un outil statistique ; la suite 
logicielle LUXID de l&#8217;&#233;diteur TEMIS3. C&#8217;est ce dernier qui a &#233;t&#233; acquis par EDF fin 2009. Cette suite 
logicielle propose des fonctionnalit&#233;s d&#8217;extraction d&#8217;information, d&#8217;analyse du contenu et une interface de 
navigation dans les r&#233;sultats. En ce qui concerne la mod&#233;lisation s&#233;mantique des concepts m&#233;tier, la 
technologie Skill Cartridge&#8482; est particuli&#232;rement puissante. Ensembles de r&#232;gles et de composants 
linguistiques d&#233;finissant l&#8217;information &#224; extraire, les cartouches de connaissance ont la particularit&#233; d&#8217;ob&#233;ir 
au principe de lectures successives. Apr&#232;s une premi&#232;re lecture &#224; la charge de l&#8217;analyseur 
morphosyntaxique de l&#8217;outil (Xelda), la cartouche va permettre de r&#233;aliser une analyse s&#233;mantique sur 
plusieurs niveaux : reconnaissance des entit&#233;s, du lexique, puis des relations de premier niveau, de 
deuxi&#232;me niveau, etc. A chaque lecture, le texte &#233;tiquet&#233; est remplac&#233; par le concept correspondant. Lors 
de la lecture suivante, le serveur d&#8217;extraction ne voit plus le texte mais seulement les concepts. Une r&#232;gle 
peut ainsi contenir des entr&#233;es lexicales, des expressions r&#233;guli&#232;res, des &#233;tiquettes grammaticales mais 
&#233;galement des concepts de niveau inf&#233;rieur.  Par ailleurs, TEMIS&#174; est une soci&#233;t&#233; p&#233;renne proposant un 
accompagnement au niveau des formations et des prestations. M&#234;me si l&#8217;interface de navigation et 
l&#8217;utilisation des diff&#233;rents modules n&#8217;est pas toujours ergonomique et intuitive, c&#8217;est cette solution qui 
nous est apparue comme la plus adapt&#233;e : les r&#233;sultats de la classification non supervis&#233;e des corpus de test 
ont &#233;t&#233; jug&#233;s comme &#233;tant les plus pertinents par trois experts m&#233;tier. 
</p>
<p>                                                 
</p>
<p>1
 Traitement automatiques des opinions et sentiments (2009-2011), https://www.projet-doxa.fr/-Presentation-du-projet-.html 
</p>
<p>2
 XIP est commercialis&#233; par Celi France 
</p>
<p>3
 http://www.temis.com/index.php?id=201&amp;selt=1 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LUDIVINE KUZNIK    ANNE-LAURE GUENET   ANNE PERADOTTO   CHLOE CLAVEL  
3 Apport de la s&#233;mantique pour cat&#233;goriser un document 
L&#8217;objectif de cette partie est d&#8217;illustrer l&#8217;apport de la s&#233;mantique pour une t&#226;che de cat&#233;gorisation. Le 
corpus est constitu&#233; de 3.653 r&#233;ponses &#224; une question ouverte pos&#233;e aux clients sur leur intention de rester 
fid&#232;le &#224; EDF. Il est constitu&#233; de documents tr&#232;s courts, de une &#224; quelques phrases en moyenne. Les 
donn&#233;es ont &#233;t&#233; annot&#233;es manuellement par un expert en huit th&#233;matiques pr&#233;sent&#233;es dans le tableau 2.  
</p>
<p>Tableau 1- Cat&#233;gories utilis&#233;es pour la classification et exemple d'expressions caract&#233;ristiques de la cat&#233;gorie. 
</p>
<p>3.1 M&#233;thode 
</p>
<p>Le corpus est analys&#233; via une cartouche de connaissance appel&#233;e &#171; Fidelit&#233; &#187;, construite par nos soins afin 
de r&#233;cup&#233;rer les concepts m&#233;tier caract&#233;ristiques des diff&#233;rentes cat&#233;gories (premi&#232;re colonne du tableau 2). 
Pour cela, l&#8217;analyse des r&#233;sultats d&#8217;une classification non supervis&#233;e a permis de d&#233;tecter les th&#232;mes mal 
rep&#233;r&#233;es, comme par exemple s&#233;parer les marques de satisfaction et d&#8217;insatisfaction, ou encore mod&#233;liser 
la notion de confiance.  
</p>
<p>Cette cartouche a &#233;t&#233; construite en trois &#233;tapes : les concepts outils, les concepts lexicaux et les r&#232;gles.              
Les concepts outils permettent de faciliter le travail du d&#233;veloppeur en regroupant des &#233;l&#233;ments 
syntaxiques et s&#233;mantiques que l&#8217;on utilisera ensuite dans d&#8217;autres r&#232;gles. On retrouvera ici des 
regroupements sur les notions de fr&#233;quence (&#171; maintes reprises, d&#233;j&#224; 3 fois, continuellement, encore , 
toujours, tout le temps, &#8230;) , sur les adverbes intensifieurs (&#171; absolument, beaucoup, de plus en plus, trop, 
&#8230;) ou encore la mod&#233;lisation de la n&#233;gation. Les fichiers lexicaux regroupent &#233;galement du vocabulaire 
comme des noms qualifiant la qualit&#233; d&#8217;un service (&#171; amabilit&#233;, disponibilit&#233;, courtoisie, s&#233;rieux, &#8230; &#187;), ou 
encore des adjectifs ( &#171; conciliant, professionnel, &#8230; &#187;), mais aussi du vocabulaire propre &#224; EDF regroupant 
par exemple ses concurrents, ses services, ses offres, &#8230; Enfin, des r&#232;gles ont &#233;t&#233; cr&#233;&#233;es pour am&#233;liorer 
l&#8217;affectation des verbatims aux cat&#233;gories d&#233;finies par les experts. Par exemple, pour illustrer la cat&#233;gorie 
insatisfaction, on retrouve des r&#232;gles comme :  
</p>
<p> Description Exemples 
</p>
<p>Satisfaction globale 
 
</p>
<p>Clients satisfaits de mani&#232;re g&#233;n&#233;rale : ils n&#8217;estiment 
pas avoir de raison valable ou suffisante pour changer 
</p>
<p>de fournisseur. 
</p>
<p>&quot;Parce que ca fonctionne. Pourquoi 
changer ?&quot; , &quot;J'ai toutes les raisons de 
</p>
<p>rester fid&#232;le.&quot;                                 
</p>
<p>Satisfaction tarifs Ces clients mettent en avant les tarifs pr&#233;f&#233;rentiels dont ils b&#233;n&#233;ficient, ainsi que la r&#233;gulation des tarifs &#224; 
laquelle est soumise EDF. 
</p>
<p>&quot;EDF nous propose des tarifs jaunes et 
pas les autres fournisseurs.&quot;                          
</p>
<p>Confiance EDF Ces clients &#233;voquent leur confiance en EDF. &quot;On conna&#238;t EDF alors que les autres on 
ne les conna&#238;t pas.&quot;                                                                
</p>
<p>Attachement service 
public 
</p>
<p>Ces clients sont favorables &#224; la d&#233;fense du service 
public, des monopoles d&#8217;Etat et/ou &#224; la sauvegarde 
</p>
<p>des entreprises fran&#231;aises . 
&quot;Il faut un seul et unique fournisseur &quot;                         
&quot;Fid&#232;le aux services publics de EDF &quot; 
</p>
<p>Fid&#233;lit&#233; passive Ces clients n&#8217;ont pas envie de chercher un nouveau fournisseur d&#8217;&#233;lectricit&#233;. &quot;Je n'ai pas envie de me casser les pieds. &quot; 
</p>
<p>Ind&#233;cision Ces clients sont ind&#233;cis, ils n&#8217;ont pas pris le temps d&#8217;&#233;tudier d&#8217;autres offres et n&#8217;ont pas &#233;t&#233; d&#233;march&#233;s 
par les concurrents.  
</p>
<p>&quot;Je ne sais pas ce que font les autres&quot; ,                                                              
&quot;Je n&#8217;en sais rien&quot; 
</p>
<p>En attente propositions. Clients ouverts &#224; l&#8217;&#233;ventualit&#233; de changer de fournisseur si la concurrence propose mieux, 
notamment en termes de prix. 
</p>
<p>&quot;Si je trouve moins cher ailleurs je 
change &quot; 
</p>
<p>Insatisfaction Clients insatisfaits, qu&#8217;il s&#8217;agisse des tarifs, du 
manque de suivi ou de proximit&#233;, de la qualit&#233; de 
</p>
<p>l&#8217;accueil, etc. 
</p>
<p>&quot;Je ne suis pas satisfait des co&#251;ts&quot;            </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;APPORT DES CONCEPTS METIERS POUR LA CLASSIFICATION DES QUESTIONS OUVERTES D&#8217;ENQUETE. 
(1) ~negation-patt / ~satisfait-lex / (~negation-patt~contexte)? , bas&#233;e sur l&#8217;encha&#238;nement des trois 
</p>
<p>concepts de niveau inf&#233;rieur que sont la mod&#233;lisation de la n&#233;gation, une liste d&#8217;adjectifs concernant la 
satisfaction des personnes, et &#233;ventuellement l&#8217;expression &#171; du tout &#187;. Cette r&#232;gle permettra d&#8217;extraire 
par exemple &#171; pas satisfait du tout&#187;, &#171; vraiment pas acceptable &#187;, &#8230; 
</p>
<p>(2) (manque|~negation-patt|(il/#NEG/y/avoir/~negation-patt))/(#PREP_DE)?/ (conseil|contact|~services-
lex), bas&#233;e sur un des &#233;l&#233;ments entre parenth&#232;ses, &#224; savoir le lemme &#171; manque &#187;, un des termes du 
concept g&#233;rant la n&#233;gation (&#171; pas vraiment, pas du tout, n&#8217;a pas &#187;, par exemple) ou encore une 
expression de type &#171; il n&#8217;y a pas &#187; suivi &#233;ventuellement de la pr&#233;position de (&#233;tiquettes grammaticales 
issues de l&#8217;analyseur morphosyntaxique de TEMIS, Xelda), puis d&#8217;un des termes entre parenth&#232;ses (les 
lemmes conseil ou contact ou les termes regroup&#233;s pr&#233;c&#233;demment dans le concept services-lex). On y 
retrouvera des verbatims comme &#171; manque de qualit&#233; de service &#187;, &#171; il n&#8217;y a vraiment pas eu de 
contact &#187;, &#8230; 
</p>
<p>Cette cartouche de d&#233;tection de concepts a &#233;t&#233; coupl&#233;e &#224; une analyse morphosyntaxique (cartouche 
Analytics&#8482; de TEMIS&#174;) pour r&#233;cup&#233;rer &#233;galement les termes ne faisant pas partie des expressions 
mod&#233;lis&#233;es. C&#8217;est le lemme qui sera conserv&#233;, en filtrant sur la cat&#233;gorie grammaticale pour garder 
uniquement les noms, groupes nominaux, adjectifs et verbes.  
Une fois le traitement linguistique effectu&#233;, une cat&#233;gorisation est r&#233;alis&#233;e par une m&#233;thode bas&#233;e sur les 
r&#233;seaux bay&#233;siens4 fournie dans LUXID. 80% du corpus est utilis&#233; pour l&#8217;apprentissage et 20% pour le 
test. L&#8217;&#233;valuation de l&#8217;apport de la s&#233;mantique sur le r&#233;sultat de la cat&#233;gorisation est obtenu en comparant 
ces r&#233;sultats &#224; celui d&#8217;une analyse morphosyntaxique seule (cartouche Analytics&#8482;).  
</p>
<p>3.2 R&#233;sultats 
</p>
<p>La qualit&#233; des r&#233;sultats est &#233;valu&#233;e selon trois mesures : le rappel, la pr&#233;cision et la qualit&#233; (moyenne liss&#233;e 
des deux autres). Afin d&#8217;&#233;viter les biais engendr&#233;s par le tirage al&#233;atoire, le protocole a &#233;t&#233; it&#233;r&#233; 20 fois. Le 
tableau ci-dessous fournit une moyenne des vingt mesures obtenues.  
</p>
<p>Tableau 1- r&#233;sultats de la cat&#233;gorisation avec ou sans l'utilisation de la cartouche &quot;Fid&#233;lit&#233;&quot;. 
</p>
<p> Pr&#233;cision Rappel F-mesure 
</p>
<p>Sans la cartouche &#171; Fid&#233;lit&#233; &#187; 76,3% 69,6% 72,8% 
</p>
<p>Avec la cartouche &#171; Fid&#233;lit&#233; &#187; 79,0% 72,3% 75,5% 
</p>
<p>Les performances sont l&#233;g&#232;rement meilleures avec la cartouche &#171; Fid&#233;lit&#233; &#187; avec un gain de 2,7 points 
pour la F-mesure qui intervient de mani&#232;re quasi-&#233;gale sur la pr&#233;cision et le rappel. Il est int&#233;ressant de 
noter que l&#8217;am&#233;lioration des performances varie en fonction de la classe consid&#233;r&#233;e. La F-mesure par 
cat&#233;gorie oscille entre 44,1% et 86,1% lorsque la cat&#233;gorisation repose sur une analyse morphosyntaxique 
seule et entre 60,4% et 85,4% lorsque l&#8217;analyse morphosyntaxique est utilis&#233;e conjointement &#224; la 
cartouche &#171; Fid&#233;lit&#233; &#187;. Les r&#233;sultats avec cette cartouche sont particuli&#232;rement meilleurs pour les cat&#233;gories 
F8-Insatisfaction, F2-Satisfaction tarifs et F1-Satisfaction globale, avec une F-mesure qui passe 
respectivement de 44,1% &#224; 61,6% , de 52,8% &#224; 63,3% , et de 76,1% &#224; 79,8% . Ces trois cat&#233;gories sont les 
plus  sujettes au probl&#232;me de la n&#233;gation pr&#233;sent&#233; en introduction car elles permettent de discriminer le 
m&#233;contentement de la satisfaction. La mod&#233;lisation par une cartouche de connaissance est donc 
</p>
<p>                                                 
</p>
<p>4
 M&#233;thode d&#8217;apprentissage vectoriel assignant aux documents un score d&#8217;appartenance &#224; une cat&#233;gorie. Elle permet &#233;galement de 
</p>
<p>n&#8217;affecter aucune cat&#233;gorie &#224; un document si les scores sont trop faibles.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LUDIVINE KUZNIK    ANNE-LAURE GUENET   ANNE PERADOTTO   CHLOE CLAVEL  
particuli&#232;rement pertinente pour ces cat&#233;gories et permet une nette am&#233;lioration des r&#233;sultats. Cela permet 
notamment de r&#233;affecter correctement &#224; la cat&#233;gorie Insatisfaction des verbatims comme &#171; Pas contente &#187;, 
&#171; je n'ai pas eu de suivi sur mes demandes&#187;, &#171; manque de communication &#187;, ou &#224; la cat&#233;gorie Satisfaction 
&#171; On n'est pas insatisfait d'EDF &#187;, &#171; je n&#8217;ai rien &#224; leur reprocher &#187;. 
</p>
<p>Tableau 2-R&#233;sultats de la cat&#233;gorisation avec ou sans l'utilisation de la cartouche &quot;Fid&#233;lit&#233;&quot;. 
</p>
<p>Cat&#233;gories 
(1&#232;re colonne : avec Analytics,                                
2&#232;me colonne : avec notre cartouche Fid&#233;lit&#233; ) 
</p>
<p>Pr&#233;cision Rappel F-mesure 
</p>
<p>1.Satisfaction globale 80,6 85,5 72,1 74,8 76.1 79,8 
2.Satisfaction tarifs 86,5 67,2 38,0 59,8 52.8 63.3 
3. Confiance EDF 82,3 85,6 53,4 53,8 64.8 66.2 
</p>
<p>4. Attachement service public 90,6 92,9 82,0 79,1 86.1 85.5 
5. Fidelit&#233; passive 79,2 88.0 74,6 70,4 76.9 78.2 
</p>
<p>6. Ind&#233;cision 55,4 64,2 58,6 57,1 57.0 60.4 
7 En attente propositions 73,2 72,4 88,7 90,5 80.3 80.5 
</p>
<p>8. Insatisfaction 66,7 78,7 32,9 50,6 44.1 61.6 
</p>
<p>4 Conclusion 
Les besoins op&#233;rationnels concernant l&#8217;analyse de donn&#233;es textuelles pour une meilleure connaissance de 
la client&#232;le EDF sont sp&#233;cifiques et passent par la mod&#233;lisation s&#233;mantique de concepts m&#233;tiers 
concernant les motifs de satisfaction ou de m&#233;contentement des clients. Nous avons illustr&#233; l&#8217;apport de 
cette mod&#233;lisation - r&#233;alis&#233;e gr&#226;ce &#224; la technologie Skill CartridgeTM de l&#8217;&#233;diteur TEMIS - pour la 
classification des r&#233;ponses des clients &#224; une enqu&#234;te charg&#233;e d&#8217;analyser la fid&#233;lit&#233; des clients. Cette 
mod&#233;lisation a permis d&#8217;obtenir une F-mesure sup&#233;rieure &#224; 75% et de faire passer les performances les plus 
basses (obtenues pour la cat&#233;gorie li&#233;e &#224; l&#8217;insatisfaction) de 44.1% &#224; 60,4%.  
</p>
<p>La mod&#233;lisation s&#233;mantique des concepts est actuellement r&#233;alis&#233;e &#224; EDF par des experts linguistes. La 
suite envisag&#233;e pour cette &#233;tude concerne la recherche de m&#233;thodes statistiques capables d&#8217;aider le 
linguiste &#224; la mod&#233;lisation de ces concepts. 
</p>
<p>R&#233;f&#233;rences  
CHAUMIER J., DEJEAN M. (2003). Recherche et analyse d&#8217;information textuelle. Tendances des outils 
linguistiques. Documentaliste-Sciences de l&#8217;information vol. 40, 14-24. 
DEVAUX V., VIDAL S., FABRY C. (2005). Benchmarking outils de veille. Projet men&#233; au sein du service 
veille de l&#8217;INstitut de l&#8217;Information Scientifique et Technique, http://outils.veille.inist.fr/index.html 
</p>
<p>FILIPPONE D.  (2006). Les outils de Text Mining. Article publi&#233; sur Le Journal du Net, 
http://www.journaldunet.com/solutions/0606/060630-panorama-text-mining/1.shtml 
QUATRAIN Y., PERADOTTO A., NUGIER S. (2004). Evaluation d&#8217;outils de Text Mining dans un contexte 
industriel. Actes de CIFT 2004, 103-115. </p>

</div></div>
</body></html>