<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Fouille de donn&#233;es s&#233;quentielles d&#8217;itemsets pour l&#8217;apprentissage de patrons linguistiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Fouille de donn&#233;es s&#233;quentielles d&#8217;itemsets pour
l&#8217;apprentissage de patrons linguistiques
</p>
<p>Peggy Cellier Thierry Charnois
GREYC &#8211; CNRS UMR 6072
</p>
<p>Universit&#233; de Caen &#8211; Bd Mal Juin 14032 Caen, France
pr&#233;nom.nom@info.unicaen.fr
</p>
<p>R&#233;sum&#233;. Dans cet article nous pr&#233;sentons une m&#233;thode utilisant l&#8217;extraction de motifs s&#233;quentiels
d&#8217;itemsets pour l&#8217;apprentissage automatique de patrons linguistiques. De plus, nous proposons de nous
appuyer sur l&#8217;ordre partiel existant entre les motifs pour les &#233;num&#233;rer de fa&#231;on structur&#233;e et ainsi faciliter
leur validation en tant que patrons linguistiques.
</p>
<p>Abstract. In this paper, we present a method based on the extraction of itemset sequential patterns
in order to automatically generate linguistic patterns. In addition, we propose to use the partial ordering
between sequential patterns to enumerate and validate them.
</p>
<p>Mots-cl&#233;s : Fouille de donn&#233;es, motifs s&#233;quentiels, extraction d&#8217;information, apprentissage de pa-
trons linguistiques.
</p>
<p>Keywords: Data mining, sequential patterns, information extraction, linguistic pattern learning.
</p>
<p>1 Introduction
</p>
<p>Face &#224; l&#8217;abondance et &#224; la prolif&#233;ration des donn&#233;es textuelles, l&#8217;acc&#232;s &#224; l&#8217;information pertinente dans
les corpus est devenu un enjeu majeur avec des besoins dans diff&#233;rents domaines. On peut citer l&#8217;analyse
du discours &#233;valuatif qui conna&#238;t un int&#233;r&#234;t croissant pour des applications telles que la veille d&#8217;opinions,
l&#8217;analyse de tendances ou de march&#233;s (Pang &amp; Lee, 2007). Les approches symboliques du traitement
automatique des langues d&#233;di&#233;es &#224; l&#8217;extraction d&#8217;information reposent sur des ressources &#233;labor&#233;es ma-
nuellement dont le co&#251;t est important en temps de d&#233;veloppement, voire prohibitif lorsqu&#8217;il s&#8217;agit de les
adapter &#224; un nouveau domaine (Poibeau, 2003). C&#8217;est pourquoi les m&#233;thodes permettant d&#8217;apprendre auto-
matiquement les ressources connaissent un essor important. Certaines approches s&#8217;appuient sur des corpus
annot&#233;s (Califf &amp; Mooney, 2003) souvent difficiles &#224; obtenir. D&#8217;autres m&#233;thodes utilisent des corpus bruts
(Riloff, 1996) mais elles reposent sur une analyse syntaxique qui impacte la qualit&#233; des r&#233;sultats. On
peut aussi citer les approches dans la lign&#233;e de (Hearst, 1992) qui visent &#224; acqu&#233;rir des relations s&#233;man-
tiques d&#8217;un type particulier (hyperonymie) pour enrichir automatiquement des lexiques ou des ontologies.
Dans (Charnois et al., 2009) une approche a &#233;t&#233; propos&#233;e pour apprendre automatiquement des patrons
linguistiques pour la d&#233;couverte de relations entre entit&#233;s nomm&#233;es. Cette approche s&#8217;appuie sur l&#8217;utilisa-
tion de motifs s&#233;quentiels d&#8217;items, qui permettent de g&#233;n&#233;rer automatiquement des patrons linguistiques,
et sur la fouille de donn&#233;es r&#233;cursive des motifs qui permet de g&#233;rer la quantit&#233; de patrons extraits. Cette</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PEGGY CELLIER, THIERRY CHARNOIS
</p>
<p>Identifiant S&#233;quence
1 &#12296;(homme homme NOM)(de de PRP )(culture culture NOM)&#12297;
2 &#12296;(en en PRP )(vieux vieux ADJ)(farceur farceur NOM)(misanthrope misanthrope ADJ)&#12297;
3 &#12296;(re&#769;pute&#769; re&#769;puter V ER pper)(pour pour PRP )(sa son DET POS)(cruaute&#769; cruaute&#769; NOM)&#12297;
</p>
<p>TAB. 1 &#8211; Extrait d&#8217;une base de s&#233;quences pour les textes : &#8220;homme de culture, en vieux farceur misan-
thrope, r&#233;put&#233; pour sa cruaut&#233;&#8221;.
</p>
<p>approche a l&#8217;avantage de ne pas n&#233;cessiter d&#8217;analyse syntaxique ni de ressource ext&#233;rieure autre qu&#8217;un
corpus d&#8217;apprentissage brut, et n&#8217;est pas d&#233;di&#233;e &#224; l&#8217;apprentissage d&#8217;un type de patrons sp&#233;cifiques.
</p>
<p>Dans cet article, nous proposons une m&#233;thode bas&#233;e sur les motifs s&#233;quentiels d&#8217;itemsets. Cela signifie
qu&#8217;au lieu de d&#233;crire un mot par un seul item (son lemme ou sa cat&#233;gorie grammaticale ou la conjonction
des deux) comme dans (Charnois et al., 2009), un mot est d&#233;crit par un ensemble d&#8217;items. L&#8217;avantage de
cette description plus riche est de pouvoir g&#233;n&#233;rer automatiquement des patrons linguistiques sophistiqu&#233;s
contenant &#224; la fois des lemmes et des cat&#233;gories grammaticales, comme le patron &#171; homme de NOM &#187;. De
plus, pour g&#233;rer le probl&#232;me du grand nombre de motifs extraits &#224; valider par un expert, nous proposons de
nous appuyer sur l&#8217;ordre partiel existant entre ces motifs. Cela permet une &#233;num&#233;ration structur&#233;e des mo-
tifs et facilite leur exploration. Nous appliquons notre approche &#224; l&#8217;apprentissage de patrons linguistiques
pour la d&#233;couverte de constituants en position d&#233;tach&#233;e, extra-pr&#233;dicatifs, et porteurs de qualification, voire
de jugement, comme illustr&#233;e dans la table 1. Toutefois, le processus peut &#234;tre facilement adapt&#233; pour d&#233;-
couvrir d&#8217;autres types de patrons linguistiques Dans la section 2, la m&#233;thode propos&#233;e est d&#233;taill&#233;e. La
section 3 pr&#233;sente l&#8217;application de la m&#233;thode pour la d&#233;couverte d&#8217;expressions qualificatives.
</p>
<p>2 Apprentissage des patrons linguistiques
</p>
<p>L&#8217;extraction automatique des patrons linguistiques et leur validation s&#8217;effectuent en deux &#233;tapes : 1) les
motifs s&#233;quentiels fr&#233;quents sont extraits de la base d&#8217;exemples ; 2) ces motifs extraits sont ensuite struc-
tur&#233;s dans un diagramme de Hasse afin de faciliter leur s&#233;lection en tant que patrons linguistiques.
</p>
<p>2.1 Extraction de motifs s&#233;quentiels d&#8217;itemsets pour la d&#233;couverte de patrons
</p>
<p>L&#8217;extraction de motifs s&#233;quentiels d&#8217;itemsets a &#233;t&#233; introduite dans (Agrawal &amp; Srikant, 1995; Srikant &amp;
Agrawal, 1996). L&#8217;extraction de motifs s&#233;quentiels se fait &#224; partir d&#8217;une base de s&#233;quences, BDD, o&#249;
chaque s&#233;quence est d&#233;crite par une liste ordonn&#233;e d&#8217;ensembles de litt&#233;raux appel&#233;s items. Un ensemble
d&#8217;items est commun&#233;ment appel&#233; itemset, not&#233; (i1i2...im) o&#249; les ij sont des items. Une s&#233;quence est donc
une liste ordonn&#233;e d&#8217;itemsets, not&#233;e &#12296;s1...sn&#12297; o&#249; les sj sont des itemsets. Dans le cas de la d&#233;couverte de
patrons linguistiques, nous constituons une base de s&#233;quences (la base d&#8217;exemples) &#224; partir de morceaux
de texte. Chaque morceau de texte repr&#233;sente donc une s&#233;quence de la base et est d&#233;crit par l&#8217;ensemble
des mots qui le composent. Les mots1sont repr&#233;sent&#233;s par des itemsets qui d&#233;crivent le mot par sa forme
fl&#233;chie, son lemme et sa cat&#233;gorie grammaticale 2. Un extrait de base contenant 3 constituants en position
</p>
<p>1En fonction de l&#8217;application il est tout &#224; fait possible de choisir un grain diff&#233;rent, par exemple : syllabe, phrase, paragraphe.
2Notons que d&#8217;autres informations pourraient &#234;tre ajout&#233;es comme des traits s&#233;mantiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FOUILLE DE S&#201;QUENCES D&#8217;ITEMSETS POUR L&#8217;APPRENTISSAGE DE PATRONS LINGUISTIQUES
</p>
<p>FIG. 1 &#8211; Navigation dans les patrons lin-
guistiques pour les valider.
</p>
<p>FIG. 2 &#8211; Extrait du diagramme de Hasse contenant des motifs
s&#233;quentiels.
</p>
<p>d&#233;tach&#233;e de qualification est donn&#233; &#224; la table 1. Une s&#233;quence, S1 = &#12296;a1...an&#12297; est contenue dans une s&#233;-
quence S2 = &#12296;b1...bm&#12297; s&#8217;il existe des entiers i1 &lt; ... &lt; in tels que a1 &#8838; bi1 , ..., an &#8838; bin . S1 est alors
appel&#233;e sous-s&#233;quence de S2, not&#233; S1 &#8804; S2. Le support d&#8217;une s&#233;quence3, S, dans une base, BDD, est
le nombre de s&#233;quences de BDD qui contiennent S. Par exemple, pour le motif &#12296;(PRP )(ADJ)&#12297; son
support dans BDD est de 1 (S&#233;quence 2). Les motifs s&#233;quentiels ne sont pas n&#233;cessairement des suites
contigues. Par exemple, le motif &#12296;(PRP )(ADJ)&#12297; couvre aussi l&#8217;expression &#171; en homme courageux &#187;.
Un motif s&#233;quentiel fr&#233;quent dans BDD est une s&#233;quence dont le support est sup&#233;rieur &#224; un seuil fix&#233; :
minsup. Notons que l&#8217;utilisation des itemsets permet une description plus riche des mots que l&#8217;utilisa-
tion de simples items. Cet ajout d&#8217;information sur les mots donne la possibilit&#233; de d&#233;couvrir des patrons
linguistiques plus sophistiqu&#233;s, compos&#233;s d&#8217;information mixte comme &#224; la fois les lemmes mais aussi
les cat&#233;gories grammaticales. Par exemple, on trouve des patrons linguistiques de la forme : &#12296;(en PRP )
(homme NOM)(de PRP )(NOM)&#12297;. Pour diriger l&#8217;extraction des motifs s&#233;quentiels vers l&#8217;objectif de
l&#8217;utilisateur, on d&#233;finit des contraintes sur les motifs &#224; extraitre. Par exemple, la contrainte gap (Dong &amp;
Pei, 2007) impose que pour que S1 soit contenue dans S2 il faut que chaque couple d&#8217;itemsets adjacents
de S1 ne soit pas s&#233;par&#233; dans S2 par plus d&#8217;un certain nombre d&#8217;itemsets. Ce nombre est appel&#233; maxgap.
Les contraintes linguistiques permettent de d&#233;finir le type de patrons linguistiques recherch&#233;s.
</p>
<p>2.2 Ma&#238;trise du nombre de motifs
</p>
<p>Beaucoup de motifs s&#233;quentiels sont g&#233;n&#233;r&#233;s. Pour pallier &#224; ce probl&#232;me nous utilisons une repr&#233;sentation
condens&#233;e des motifs qui &#233;limine les redondances entre motifs : les motifs ferm&#233;s (Yan et al., 2003), et un
ordre partiel qui permet d&#8217;avoir une &#233;num&#233;ration des motifs structur&#233;e et de faciliter leur exploration.
</p>
<p>Un motif fr&#233;quent, S, est un motif ferm&#233; fr&#233;quent, s&#8217;il n&#8217;existe pas de motif fr&#233;quent S &#8242; tel que S &lt; S &#8242; et
sup(S) = sup(S &#8242;). Par exemple, soient S = &#12296;(homme NOM) (de) (NOM)&#12297; et S &#8242; = &#12296;(homme NOM)
</p>
<p>3Parfois le support normalis&#233; est utilis&#233; : sup(S) = nombre de sequences de la base qui contiennent S
nombre de sequences de la base</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PEGGY CELLIER, THIERRY CHARNOIS
</p>
<p>(de) (culture NOM)&#12297; deux s&#233;quences telles que sup(S) = sup(S &#8242;) = 10, alors S n&#8217;est pas un motif
ferm&#233;. En effet les 10 exemples couverts par le motif S sont aussi couverts par le motif S &#8242;.
</p>
<p>Les motifs ferm&#233;s fr&#233;quents extraits sont partiellement ordonn&#233;s entre eux. Afin de mieux visualiser cette
relation d&#8217;ordre on peut afficher les motifs dans un diagramme de Hasse qui est une repr&#233;sentation gra-
phique d&#8217;un ordre partiel (Davey &amp; Priestley, 1990). Un exemple de diagramme de Hasse est pr&#233;sent&#233; &#224; la
figure 2. La taille du diagramme de Hasse peut &#234;tre trop grande pour que le diagramme soit affich&#233; enti&#232;-
rement. Nous proposons donc d&#8217;utiliser un outil de navigation permettant de naviguer dans le diagramme
des motifs les plus g&#233;n&#233;raux aux plus sp&#233;cifiques afin de les valider en tant que patrons linguistiques.
&#192; la figure 1 nous donnons un exemple de navigation avec l&#8217;outil Camelis4 (Ferr&#233;, 2009). La navigation
se fait via &#171; l&#8217;arbre de navigation &#187; se trouvant &#224; gauche de l&#8217;outil. Notons que lorsqu&#8217;un motif, M , est
s&#233;lectionn&#233; par l&#8217;expert comme patron linguistique, tous les motifs dont M est une sous-s&#233;quence ne sont
plus &#224; examiner. En effet, lors de l&#8217;application des patrons, les morceaux de texte qu&#8217;ils reconnaissent
sont inclus dans les morceaux de texte reconnus par M . Camelis offre la possibilit&#233; de marquer les motifs
valid&#233;s comme patrons linguistiques et donc de ne plus les afficher ainsi que les motifs qui les contiennent
(cf &#171; not &#8217;Motif Valide&#8217; &#187; dans figure 1), r&#233;duisant l&#8217;espace des motifs &#224; v&#233;rifier et facilitant l&#8217;exploration.
</p>
<p>3 Cas d&#8217;&#233;tude : la reconnaissance d&#8217;expressions qualificatives
</p>
<p>Nous avons appliqu&#233; notre m&#233;thode &#224; l&#8217;apprentissage de patrons linguistiques d&#233;notant des expressions
porteuses de qualification et en position d&#233;tach&#233;e comme d&#233;crites dans (Jackiewicz et al., 2009a). Les
expressions en gras dans les exemples (1) et (2) illustrent le type d&#8217;expressions qui nous int&#233;ressent :
(1) Ni trop sentimental, ni trop &#233;nergique, il ma&#238;trise, avec une finesse quasi mozartienne, un [...]
(2) Figure l&#233;gendaire de l&#8217;opposition au r&#233;gime communiste, &#233;minent professeur d&#8217;histoire m&#233;di&#233;-
</p>
<p>vale, ministre des affaires &#233;trang&#232;res de la Pologne de 1997 &#224; 2000, Bronislaw Geremek avait [...]
Nous souhaitons apprendre des patrons linquistiques comme ceux d&#233;finis manuellement par (Jackiewicz
et al., 2009a), par exemple :
&#8211; Groupes nominaux (GN) : [det] N de GN (Femme de t&#234;te,X ; X, le maestro de la d&#233;sinflation).
&#8211; Adverbes (courageusement, X) ; groupes pr&#233;positionnels (en mauvaise posture, X).
&#8211; Constructions d&#233;tach&#233;es : groupes adjectivaux (impr&#233;visible et fantasque, X) ; constructions absolues
</p>
<p>(l&#8217;oeil vigilant, X) ; participes (r&#233;put&#233; pour son caract&#232;re bourru, X).
</p>
<p>3.1 Corpus d&#8217;apprentissage
</p>
<p>Deux corpus d&#8217;apprentissage ont &#233;t&#233; g&#233;n&#233;r&#233;s automatiquement pour pallier l&#8217;absence de corpus disponible.
Le corpus AXIOLO est issu des exp&#233;riences de (Jackiewicz et al., 2009a). Il est constitu&#233; d&#8217;expressions
reconnues par application d&#8217;une dizaine de patrons &#233;labor&#233;s manuellement sur des articles issus du journal
Le Monde, cat&#233;gorie &#171; Portraits &#187;, de la p&#233;riode juillet &#224; d&#233;cembre 2002 (soit 884 articles), ainsi que sur
la p&#233;riode 2003 &#224; 2006 de l&#8217;ensemble des articles du Monde pour deux autres patrons sp&#233;cifiques : en Adj
&lt;expansion&gt;5 et en N &lt;expansion&gt;6 (Jackiewicz et al., 2009b). Ce corpus d&#8217;expressions qualificatives
</p>
<p>4http ://www.irisa.fr/LIS/ferre/camelis/index.html
5avec Adj appartenant &#224; une liste d&#8217;adjectifs fix&#233;s (bon, vrai, authentique, ...) : en vrai professionnel
6avec N appartenant &#224; une liste de noms (homme, femme, virtuose, ...) : en homme sensible et g&#233;n&#233;reux</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FOUILLE DE S&#201;QUENCES D&#8217;ITEMSETS POUR L&#8217;APPRENTISSAGE DE PATRONS LINGUISTIQUES
</p>
<p>contient 4 063 expressions (i.e. s&#233;quences), ce qui repr&#233;sente 12 257 mots. Il est tr&#232;s peu bruit&#233;. Le corpus
ARTS a &#233;t&#233; g&#233;n&#233;r&#233; &#224; partir de r&#232;gles heuristiques sur les articles de la rubrique &quot;Art&quot; du journal Le Monde,
ann&#233;e 2006, soit 3 539 articles. Ces heuristiques sont destin&#233;es &#224; filtrer parmi les constituants p&#233;riph&#233;riques
ceux qui ne sont a priori pas porteurs de qualification (exemples : proposition de la phrase contenant
un verbe conjugu&#233;, groupe circonstanciel de temps, espace, but, causalit&#233;). Ce corpus est constitu&#233; de
13 576 expressions (i.e. s&#233;quences), ce qui repr&#233;sente 85 153 mots. Il contient des exemples n&#233;gatifs.
Nous estimons &#224; environ 32% le pourcentage d&#8217;expressions non qualificatives (bruit).
</p>
<p>3.2 Apprentissage des patrons de qualification
</p>
<p>Param&#232;tres de l&#8217;apprentissage. Pour le calcul des motifs ferm&#233;s d&#8217;itemsets, nous avons utilis&#233; l&#8217;impl&#233;-
mentation de Clospan (Yan et al., 2003) propos&#233;e dans Illimine7. Nous cherchons des patrons linguistiques
d&#233;crivant des expressions de qualification en position d&#233;tach&#233;e. Pour cela, nous fixons deux contraintes sur
les motifs &#224; extraire : 1) ils d&#233;butent l&#8217;expression ; 2) ils sont form&#233;s d&#8217;&#233;l&#233;ments contig&#252;s (maxgap=0). Pour
chacun des deux corpus nous avons calcul&#233; les motifs s&#233;quentiels en faisant varier les valeurs du seuil de
support, minsup, de 50% &#224; 0, 05%. On constate que des seuils de support &#233;lev&#233;s (50% ou 25%) ne four-
nissent que des motifs tr&#232;s g&#233;n&#233;raux o&#249; seuls les cat&#233;gories grammaticales apparaissent. Il est donc plus
int&#233;ressant de choisir des seuils de support tr&#232;s bas pour obtenir des motifs sp&#233;cifiques et capturer des
expressions, ou ph&#233;nom&#232;nes, linguistiques peu fr&#233;quents8.
</p>
<p>R&#233;sultats quantitatifs. Avec le corpus AXIOLO, pour minsup = 0, 05 (2 expressions), 8 264 motifs
ferm&#233;s fr&#233;quents sont extraits en moins d&#8217;une seconde. Apr&#232;s application des deux contraintes il reste
1 789 motifs. Avec le corpus ARTS, pour minsup = 0, 05 (6 expressions), environ 8 millions de motifs
ferm&#233;s fr&#233;quents sont extraits en 7h. Apr&#232;s application des contraintes il reste 7 818 motifs9.
</p>
<p>R&#233;sultats qualitatifs et discussion. Des exp&#233;riences ont &#233;t&#233; conduites en ne consid&#233;rant qu&#8217;un seul item
pour d&#233;crire un mot comme dans (Charnois et al., 2009). Sans surprise, on constate que les motifs d&#233;-
couverts sont soit tr&#232;s sp&#233;cifiques (par exemple : &#12296;homme de conviction&#12297; pour les s&#233;quences repr&#233;sent&#233;es
par les lemmes seuls), soit tr&#232;s g&#233;n&#233;riques (&#12296;NOM PRP NOM&#12297;) lorsque les s&#233;quences ne sont form&#233;es
que des cat&#233;gories grammaticales. Un motif comme &#12296;(homme)(de PRP )(NOM)&#12297; ne peut &#234;tre appris
qu&#8217;&#224; partir de s&#233;quences d&#8217;itemsets. De plus, l&#8217;analyse des motifs s&#233;quentiels d&#8217;itemsets extraits du corpus
AXIOLO montre la compl&#233;tude de la m&#233;thode. On retrouve en effet tous les motifs pr&#233;sent&#233;s pr&#233;c&#233;dem-
ment et qui ont servi &#224; g&#233;n&#233;rer ce corpus. Enfin, les exp&#233;riences r&#233;alis&#233;es sur le corpus ARTS ont permis
de tester la m&#233;thode &#224; une &#233;chelle relativement importante sur un corpus g&#233;n&#233;r&#233; automatiquement et non
annot&#233;. L&#8217;ensemble des motifs produits comporte des motifs inint&#233;ressants d&#251;s au bruit pr&#233;sent dans le
corpus. Face &#224; ce probl&#232;me, la navigation au sein de la hi&#233;rarchie des motifs est un point fort de la m&#233;-
thode permettant ais&#233;ment d&#8217;&#233;laguer des groupes de motifs inint&#233;ressants. Enfin, de nouveaux patrons sont
extraits au regard de ceux d&#233;j&#224; con&#231;us manuellement dans (Jackiewicz et al., 2009a). C&#8217;est le cas du motif
&#12296;(ADJ pour DET NOM)&#12297; (&quot;c&#233;l&#232;bre pour son monast&#232;re&quot;, &quot;baroque pour une histoire d&#8217;amour&quot;, ...) et
de ses variantes ou extensions : &#12296;(ADV )(ADJ)(pour)&#12297; (&quot;tr&#232;s c&#233;l&#232;bre pour...&quot;), &#12296;(ADJ)(pour)(V ER)&#12297;
(&quot;indispensable pour assurer...&quot;).
</p>
<p>7http ://illimine.cs.uiuc.edu/
8Les motifs obtenus sont consultables : http://users.info.unicaen.fr/~pcellier/taln2010/
9Soulignons que les indices classiques de rappel et de pr&#233;cision ne sont pas adapt&#233;s pour cette approche qui vise &#224; organiser
</p>
<p>et non &#224; &#233;laguer les motifs extraits. Cette m&#233;thode aurait donc un tr&#232;s bon rappel et une pr&#233;cision m&#233;diocre.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PEGGY CELLIER, THIERRY CHARNOIS
</p>
<p>4 Conclusion
</p>
<p>Dans cet article nous pr&#233;sentons une m&#233;thode utilisant l&#8217;extraction de motifs s&#233;quentiels d&#8217;itemsets pour
la g&#233;n&#233;ration automatique de patrons linguistiques. Cette approche a l&#8217;avantage d&#8217;&#233;viter un recoupement
manuel d&#8217;expressions pour d&#233;terminer des patrons. De plus, les patrons extraits sont compr&#233;hensibles
par un humain. L&#8217;avantage de d&#233;crire les mots non plus par un seul lemme comme dans (Charnois et al.,
2009), mais par un ensemble d&#8217;items, est une plus grande expressivit&#233; des patrons linguistiques d&#233;couverts
(combinant des informations h&#233;t&#233;rog&#232;nes). Nous proposons aussi une solution pour g&#233;rer le nombre de
motifs extraits en s&#8217;appuyant sur un ordre partiel qui existe entre ces motifs. Un utilisateur humain peut
ainsi facilement naviguer dans les motifs et les valider en tant que patrons linguistiques. Nous avons utilis&#233;
notre m&#233;thode pour l&#8217;apprentissage de patrons linguistiques pour la reconnaissance de constituants de
qualification en position d&#233;tach&#233;e. Le processus peut &#234;tre utilis&#233; pour apprendre d&#8217;autres types de patrons
linguistiques, comme les relations entre entit&#233;s nomm&#233;es, en d&#233;finissant des contraintes appropri&#233;es.
</p>
<p>R&#233;f&#233;rences
AGRAWAL R. &amp; SRIKANT R. (1995). Mining sequential patterns. In Int. Conf. on Data Engineering :
IEEE.
CALIFF M. E. &amp; MOONEY R. J. (2003). Bottom-up relational learning of pattern matching rules for
information extraction. J. Mach. Learn. Res., 4, 177&#8211;210.
CHARNOIS T., PLANTEVIT M., RIGOTTI C. &amp; CR&#201;MILLEUX B. (2009). Fouille de donn&#233;es s&#233;quen-
tielles pour l&#8217;extraction d&#8217;information. Traitement Automatique des Langues, 50(3).
DAVEY B. A. &amp; PRIESTLEY H. A. (1990). Introduction To Lattices And Order. Cambridge University
Press.
DONG G. &amp; PEI J. (2007). Sequence Data Mining. Springer.
FERR&#201; S. (2009). Camelis : a logical information system to organize and browse a collection of docu-
ments. Int. J. General Systems, 38(4).
HEARST M. (1992). Automatic acquisition of hyponyms from large text corpora. In Int. Conf. on
Computational Linguistics.
JACKIEWICZ A., CHARNOIS T. &amp; FERRARI S. (2009a). Jugements d&#8217;&#233;valuation et constituants p&#233;ri-
ph&#233;riques. In Conf&#233;rence sur le traitement automatique des langues naturelles.
JACKIEWICZ A., VIGIER D., CHARNOIS T. &amp; FERRARI S. (2009b). Vers une analyse automatique des
discours &#233;valuatifs. Le cas des constituants d&#233;tach&#233;s &quot;en N &lt;exp&gt;&quot;. In Linguistic and Psycholinguistic
Approaches to Text Structuring : ENS.
PANG B. &amp; LEE L. (2007). Opinion mining and sentiment analysis. Foundations and Trends in Infor-
mation Retrieval, 2(1-2), 1&#8211;135.
POIBEAU T. (2003). Extraction automatique d&#8217;information : Du texte brut au web s&#233;mantique. Lavoisier.
RILOFF E. (1996). Automatically generating extraction patterns from untagged text. In AAAI/IAAI&#8217;96.
SRIKANT R. &amp; AGRAWAL R. (1996). Mining sequential patterns : Generalizations and performance
improvements. In Int. Conf. on Extending Database Technology (EDBT), LNCS, p. 3&#8211;17 : Springer.
YAN X., HAN J. &amp; AFSHAR R. (2003). Clospan : Mining closed sequential patterns in large databases.
In Int. Conf. on Data Mining : SIAM.</p>

</div></div>
</body></html>