<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Convertir des d&#233;rivations TAG en d&#233;pendances</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Convertir des d&#233;rivations TAG en d&#233;pendances
</p>
<p>&#201;ric Villemonte de La Clergerie
Alpage, INRIA / Univ. Paris 7, 30 rue du Ch&#226;teau-des-rentiers, 75013 Paris
</p>
<p>eric.de_la_clergerie@inria.fr
</p>
<p>R&#233;sum&#233;. Les structures de d&#233;pendances syntaxiques sont importantes et bien adapt&#233;es comme point
de d&#233;part de diverses applications. Dans le cadre de l&#8217;analyseur TAG FRMG, nous pr&#233;sentons les d&#233;tails
d&#8217;un processus de conversion de for&#234;ts partag&#233;es de d&#233;rivations en for&#234;ts partag&#233;es de d&#233;pendances. Des
&#233;l&#233;ments d&#8217;information sont fournis sur un algorithme de d&#233;sambiguisation sur ces for&#234;ts de d&#233;pendances.
</p>
<p>Abstract. Syntactic dependency structures are important and adequate as starting point for various
NLP applications. In the context of the French TAG FRMG parser, we present the details of a conversion
process from shared derivation forests into shared dependency forests. Some information are also provided
about a disambiguisation algorithm for these dependency forests.
</p>
<p>Mots-cl&#233;s : d&#233;pendances, analyse syntaxique,TAG, for&#234;t partag&#233;e.
</p>
<p>Keywords: dependencies, parsing,TAG,shared forest.
</p>
<p>1 Introduction
</p>
<p>Les sorties d&#8217;analyse syntaxique sont potentiellement tr&#232;s utiles comme point de d&#233;part pour diverses ap-
plications, en particulier d&#8217;extraction d&#8217;information (&#201;ric de La Clergerie et al., 2009) ou d&#8217;acquisition de
connaissances, par exemple en tant que triplets de d&#233;pendances, de chemins entre mots ou de configura-
tions pr&#233;dicats-arguments. N&#233;anmoins, ces sorties sont parfois complexes et pas directement exploitables,
n&#233;cessitant par exemple de convertir une sortie &#171; concr&#232;te &#187; en une sortie plus abstraite. Cette t&#226;che, un
peu ingrate, est rarement document&#233;e, alors qu&#8217;elle n&#233;cessite une d&#233;finition claire des sorties trait&#233;es.
</p>
<p>Nous nous int&#233;ressons aux traitements des sorties de l&#8217;analyseur syntaxique FRMG. R&#233;sultant de la com-
pilation par le syst&#232;me DYALOG (Villemonte de la Clergerie, 2002) d&#8217;une grammaire TAG du fran&#231;ais &#224;
large couverture (Thomasset &amp; Villemonte de La Clergerie, 2005), FRMG retourne, sous forme de for&#234;t
partag&#233;e, l&#8217;ensemble (potentiellement exponentiel) des d&#233;rivations TAG couvrant compl&#232;tement ou par-
tiellement une phrase. En pratique, m&#234;me si les arbres de d&#233;rivations sont plus abstraits que les arbres
d&#8217;analyses et plus proches d&#8217;un niveau s&#233;mantique (Gardent &amp; Kallmeyer, 2003), ils ne sont pas forc&#233;-
ment adapt&#233;s pour de traitements ult&#233;rieurs, car mettant essentiellement en relation des arbres TAG de la
grammaire sous-jacente. Heureusement, le caract&#232;re fortement lexicalis&#233; des arbres TAG permet d&#8217;explo-
rer la conversion des arbres de d&#233;rivations en arbres de d&#233;pendances. Bien que ce fait soit relativement bien
connu (Candito &amp; Kahane, 1998; Joshi &amp; Rambow, 2003), nous pr&#233;cisons ici quelques points concrets de
cette conversion. L&#8217;originalit&#233; de notre approche est &#233;galement de g&#233;n&#233;raliser la conversion de mani&#232;re &#224;
obtenir des for&#234;ts partag&#233;es de d&#233;pendances et de proposer une repr&#233;sentation de ces for&#234;ts.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Les for&#234;ts ambigu&#235;s sont parfois int&#233;ressantes, par exemple pour des exp&#233;riences d&#8217;acquisition (Fernandez
et al., 2007). N&#233;anmoins, les applications s&#8217;appuyant sur l&#8217;analyse syntaxique requi&#232;rent g&#233;n&#233;ralement une
structure non-ambigu&#235; de d&#233;pendances, d&#8217;o&#249; la br&#232;ve pr&#233;sentation d&#8217;un algorithme de d&#233;sambiguisation.
</p>
<p>2 Quelques rappels sur les TAG
</p>
<p>Les grammaires d&#8217;arbres adjoints [TAG (Joshi, 1987)] s&#8217;appuient sur la combinaison d&#8217;arbres &#233;l&#233;mentaires
par les op&#233;rations de substitution ou d&#8217;adjonction pour construire des arbres d&#8217;analyse. En particulier,
l&#8217;op&#233;ration d&#8217;adjonction, qui ouvre un noeud interne pour y greffer le contenu d&#8217;un arbre auxiliaire, permet
la gestion de d&#233;pendances &#224; longue distance dans les phrases. Par ailleurs, l&#8217;utilisation d&#8217;arbres offre la
notion de domaine de localit&#233; &#233;tendu et permet plus directement la lexicalisation des grammaires. Un arbre
peut en effet &#234;tre ancr&#233; par une t&#234;te lexicale, les autres noeuds (&#233;ventuellement lexicalis&#233;s) formant son
domaine de localit&#233;. Typiquement, un arbre ancr&#233; par un verbe contient un noeud pour chaque argument
sous-cat&#233;goris&#233; par celui-ci.
</p>
<p>La figure 1 montre les arbres &#233;l&#233;mentaires permettant l&#8217;analyse de &#171; Yves donne un joli livre &#224; Sabine &#187;,
avec, en particulier, un arbre verbal ancr&#233; par donne sous-cat&#233;gorisant pour un verbe ditransitif et un arbre
ancr&#233; par joli venant modifier livre par adjonction. L&#8217;arbre d&#8217;analyse obtenu est donn&#233; par la figure 2a.
Mais, classiquement, l&#8217;information utile est fournie par l&#8217;arbre de d&#233;rivation de la figure 2b qui indique
l&#8217;ensemble des op&#233;rations de d&#233;rivations ayant pris place, en pr&#233;cisant, pour chaque op&#233;ration, l&#8217;arbre
et le noeud d&#8217;origine et l&#8217;arbre ajout&#233; (par substitution ou adjonction). Ainsi, l&#8217;arbre exemple stipule
qu&#8217;une substitution prend place sur le noeud NP1 de l&#8217;arbre tn1pn2 ancr&#233; par donne, introduisant l&#8217;arbre
np ancr&#233; par Yves. L&#8217;arbre de d&#233;rivation est pivot dans le sens o&#249; il permet la reconstruction de l&#8217;arbre
d&#8217;analyse, tout en se rapprochant d&#8217;un niveau de repr&#233;sentation plus s&#233;mantique (Candito &amp; Kahane, 1998;
Gardent &amp; Kallmeyer, 2003). Ce mod&#232;le de base est enrichi dans le cadre de FRMG.
</p>
<p>S tn1pn2(donne)
</p>
<p>NP &#8595; VP
</p>
<p>V
</p>
<p>donne
</p>
<p>NP &#8595; PP
</p>
<p>P
</p>
<p>&#224;
</p>
<p>NP &#8595;NP np(Yves)
</p>
<p>Yves
NP np(Sabine)
</p>
<p>Sabine
</p>
<p>NP npdn(livre)
</p>
<p>D &#8595; N
</p>
<p>livre
D d(un)
</p>
<p>un
</p>
<p>a(joli) N
</p>
<p>Adj
</p>
<p>joli
</p>
<p>N &#8902;
</p>
<p>subst
subst
</p>
<p>subst
</p>
<p>subst adj
</p>
<p>FIGURE 1 &#8211; Arbres &#233;l&#233;mentaires pour Yves donne un joli livre &#224; Sabine</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>S</p>
<p>NP
</p>
<p>Yves
</p>
<p>VP
</p>
<p>V
</p>
<p>donne
</p>
<p>NP
</p>
<p>NP
</p>
<p>D
</p>
<p>un
</p>
<p>N
</p>
<p>Adj
</p>
<p>joli
</p>
<p>N
</p>
<p>livre
</p>
<p>PP
</p>
<p>P
</p>
<p>&#224;
</p>
<p>NP
</p>
<p>Sabine
</p>
<p>(a) Arbre d&#8217;analyse
</p>
<p>tn1pn2(donne)
</p>
<p>np(Yves)
s NP1
</p>
<p>npdn(livre)
s NP2
</p>
<p>d(un)
s D
</p>
<p>a(joli)
a N
</p>
<p>np(Sabine)
s NP3
</p>
<p>(b) Arbre de d&#233;rivation
</p>
<p>FIGURE 2 &#8211; Arbres d&#8217;analyse et de d&#233;rivation
</p>
<p>3 FRMG
</p>
<p>L&#8217;analyseur FRMG est issu de la compilation par le syst&#232;me DYALOG d&#8217;une grammaire TAG large couver-
ture du fran&#231;ais g&#233;n&#233;r&#233;e par une m&#233;ta-grammaire (Thomasset &amp; Villemonte de La Clergerie, 2005). Une
de ses principales caract&#233;ristique est la gestion d&#8217;un petit nombre d&#8217;arbres (environ 200) gr&#226;ce &#224; l&#8217;emploi
d&#8217;op&#233;rateurs de factorisation sur les noeuds (disjonction, r&#233;p&#233;tition, optionalit&#233;, gardes, entrelacement).
Bien que la factorisation ne change ni le pouvoir expressif des TAG ni leur complexit&#233;, un arbre factoris&#233;
peut repr&#233;senter un nombre exponentiel d&#8217;arbres TAG classiques (Villemonte de la Clergerie, 2010).
</p>
<p>Au plus un noeud ancre est distingu&#233; par arbre correspondant &#224; la t&#234;te, ce noeud &#233;tant &#233;tiquet&#233; par une ca-
t&#233;gorie syntaxique pr&#233;-terminale (ou part-of-speech), comme v (verbe) ou nc (non commun). L&#8217;ancrage
d&#8217;un arbre &#964; par une forme f se fait par unification de structures de traits appel&#233;es hypertag (Kinyon,
2000), avec un hypertag pour &#964; sp&#233;cifiant les constructions syntaxiques couvertes par celui-ci et un hy-
pertag pour f indiquant les constructions autoris&#233;es pour celle-ci. L&#8217;unification des deux hypertags r&#233;alise
l&#8217;ancrage et permet de bloquer certaines travers&#233;es dans l&#8217;arbre factoris&#233;, &#233;vitant en autre des ph&#233;nom&#232;nes
de surg&#233;n&#233;ration. Au final, pour &#234;tre complet et permettre de reconstruire un arbre d&#8217;analyse, l&#8217;arbre de
d&#233;rivation doit non seulement se souvenir du nom des arbres mais &#233;galement des hypertags r&#233;sultant des
ancrages, de mani&#232;re &#224; pouvoir correctement identifier le parcours suivi dans chaque arbre factoris&#233;.
</p>
<p>En sus des noeuds ancre, FRMG introduit aussi des noeuds co-ancre. Ces noeuds feuilles sont &#233;galement
&#233;tiquet&#233;s par des cat&#233;gories pr&#233;-terminales, mais l&#8217;op&#233;ration de co-ancrage n&#8217;utilise pas d&#8217;hypertag. De tels
noeuds sont par exemple utilis&#233;s pour des cat&#233;gories tr&#232;s simples comme les clitiques (comme il, figure 5),
les pr&#233;positions ou certains pronoms. Sans trop entrer dans les d&#233;tails, un cas plus limite est donn&#233; par le
traitement de constructions verbales fig&#233;es comme prendre conscience o&#249; prendre sera l&#8217;ancre verbale et
conscience une co-ancre de cat&#233;gorie ncpred, avec un m&#233;canisme ad-hoc permettant de transf&#233;rer l&#8217;hy-
pertag du nom pr&#233;dicatif avec l&#8217;hypertag sous-sp&#233;cifi&#233; du verbe. Les op&#233;rations de co-ancrage laissent une
trace dans l&#8217;arbre de d&#233;rivation en sp&#233;cifiant non pas un arbre cible mais une forme cible. Les arbres FRMG
admettent aussi des noeuds feuilles lexicaux d&#233;cor&#233;s par des formes ou des lemmes (ou des disjonctions
de formes ou lemmes). La lexicalisation de ces noeuds avec des formes de la cha&#238;ne d&#8217;entr&#233;e se traduit
aussi par des traces dans l&#8217;arbre de d&#233;rivation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Une autre extension d&#233;coule du scanner utilis&#233; par FRMG qui permet, &#224; certains endroits, d&#8217;ignorer des
portions de la cha&#238;ne d&#8217;entr&#233;e consid&#233;r&#233;es comme &#233;tant du bruit. Ainsi, le pr&#233;-traitement effectu&#233; par
l&#8217;outil SXPipe (Sagot &amp; Boullier, 2008) assigne la cat&#233;gorie syntaxique _EPSILON &#224; des mots comme
euh ou &#224; des mots r&#233;p&#233;t&#233;s comme le dans &#171; le le chat mange &#187;. L&#8217;arbre de d&#233;rivation conserve une trace
des op&#233;rations de sauts, en les affectant de mani&#232;re arbitraire &#224; l&#8217;arbre en cours de reconnaissance pour le
pseudo-noeud nomm&#233; skip (euh, figure 5).
</p>
<p>Enfin, FRMG &#233;tant en fait une TAG avec d&#233;corations (F-TAG), les noeuds sont d&#233;cor&#233;s par des paires de
structures de traits, celles-ci pr&#233;cisant essentiellement des traits morpho-syntaxiques comme le genre ou
le nombre. Sans rentrer dans le d&#233;tail des op&#233;rations TAG, l&#8217;arbre de d&#233;rivation associe en cons&#233;quence
une d&#233;coration bot pour une substitution et une paire de d&#233;corations top et bot pour une adjonction.
</p>
<p>Le dernier &#233;l&#233;ment d&#8217;information concerne l&#8217;empan associ&#233; &#224; chaque op&#233;ration, c&#8217;est-&#224;-dire la portion de
la cha&#238;ne d&#8217;entr&#233;e couverte par l&#8217;arbre ou le mot cible. Dans le cadre d&#8217;analyse de treillis ambigus de mots
repr&#233;sent&#233;s par des automates &#224; &#233;tats finis, ces empans sont g&#233;n&#233;ralement donn&#233;s par une paire d&#8217;&#233;tats
(start, end) de l&#8217;automate et par un quadruplet (start, end, hstart, hend) pour l&#8217;adjonction d&#8217;un arbre
auxiliaire &#946; couvrant (start, end) avec un noeud pied couvrant un trou (hstart, hend). Pour FRMG, la
quasi-totalit&#233; des arbres auxiliaires sont en fait utilisables comme des arbres d&#8217;insertion (TIG - (Schabes
&amp; Waters, 1995)) n&#8217;adjoinant du mat&#233;riel que d&#8217;un seul cot&#233; du noeud d&#8217;adjonction, ce qui conduit, en
termes d&#8217;empan, &#224; des signatures de la forme (start, end, start, start) ou (start, end, end, end).
</p>
<p>En bref, la structure d&#8217;arbre de d&#233;rivation fournie par FRMG comprend des informations sur une op&#233;ration
effectu&#233;e sur le noeud source d&#8217;un arbre source. Une op&#233;ration se caract&#233;rise par son type (substitution,
adjonction, . . .), son empan, une ou deux d&#233;corations top et bot, l&#8217;arbre ou la forme cible, et l&#8217;hypertag de
l&#8217;arbre cible. Les arbres de d&#233;rivation correspondent &#224; des structures concr&#232;tes dans le sens o&#249; ils essaient
de conserver une trace compl&#232;te de tout ce qui s&#8217;est pass&#233;, dont de nombreux d&#233;tails pas n&#233;cessairement
utiles pour des traitements ult&#233;rieurs. 1
</p>
<p>4 Arbres de d&#233;pendances
</p>
<p>Les arbres de d&#233;rivation TAG se convertissent facilement en arbres de d&#233;pendances dans le cas de gram-
maires lexicalis&#233;es. L&#8217;id&#233;e de base est de transformer chaque &#233;tape de d&#233;rivation (symbolis&#233;e par un arc
dans l&#8217;arbre de d&#233;rivation) en une d&#233;pendance : une op&#233;ration de d&#233;rivation entre un arbre source &#964;1 et un
arbre cible &#964;2 se traduit par une d&#233;pendance entre la t&#234;te de &#964;1 comme gouverneur et la t&#234;te de &#964;2 comme
gouvern&#233;. Ainsi, l&#8217;arbre de d&#233;rivation de la figure 2b devient l&#8217;arbre de d&#233;pendance de la figure 3, o&#249; l&#8217;on
voit que le mot &#224; n&#8217;est pas, par d&#233;faut, rattach&#233; car correspondant &#224; un noeud lexical dans l&#8217;arbre tn1pn2
qui n&#8217;appara&#238;t pas comme op&#233;ration dans le mod&#232;le de base des arbres de d&#233;rivation.
</p>
<p>Dans le cadre de FRMG, la conversion est &#233;tendue naturellement aux cas o&#249; la cible est un noeud co-ancre
ou un noeud lexical (traitant ainsi le cas de &#224; qui appara&#238;t comme une co-ancre de cat&#233;gorie prep dans
l&#8217;arbre FRMG correspondant &#224; tn1pn2, donnant lieu &#224; la d&#233;pendance en pointill&#233;). Les labels des arcs sont
donn&#233;s par les labels des noeuds sources. Pour les noeuds feuilles de substitution ou de co-ancrage, le label
utilis&#233; dans FRMG traduit en g&#233;n&#233;ral leur fonction syntaxique comme sujet, objet ou xcomp (pour
les arguments phrastiques). Pour les noeuds internes sur lesquels sont appliqu&#233;es des adjonctions, le label
</p>
<p>1. Cependant, certains &#171; d&#233;tails &#187; sont parfois utiles pour certaines applications, par exemple le mode des verbes ou le
caract&#232;re satur&#233; ou non d&#8217;un groupe nominal (par un d&#233;terminant).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Yves Sabinelivre &#224;jolidonne un
NNP1
</p>
<p>P NP3 NP2D
</p>
<p>FIGURE 3 &#8211; arbre simple de d&#233;pendance
</p>
<p>correspond g&#233;n&#233;ralement &#224; la cat&#233;gorie syntaxique du noeud (plus un index) et n&#8217;est malheureusement pas
toujours tr&#232;s informatif.
</p>
<p>Certains arbres FRMG ne poss&#232;dent pas de noeud ancre, conduisant &#224; introduire une pseudo-ancre vide de
cat&#233;gorie syntaxique X positionn&#233;e en start pour un tel arbre &#964; non ancr&#233;, de racine X , et couvrant un
empan d&#233;marrant &#224; start.
</p>
<p>Par construction, l&#8217;ensemble des adjonctions portant sur n&#8217;importe quel noeud N d&#8217;un arbre &#964; sont vues
comme des d&#233;pendances ayant comme gouverneur l&#8217;ancre lexicale A de &#964; . En pratique, ce comportement
n&#8217;est pas toujours intuitif car on aimerait parfois prendre une valeur lexicale domin&#233;e par N comme
gouverneur. Ainsi, dans le cadre de la phrase &#171; il a pris pleine conscience du probl&#232;me &#187;, la th&#233;orie stipule
une d&#233;pendance pris &#8722;&#8594; pleine mais l&#8217;intuition une d&#233;pendance conscience &#8722;&#8594; pleine. Il a donc &#233;t&#233;
d&#233;cid&#233; qu&#8217;une adjonction portant sur un noeud co-ancre est transform&#233;e en une d&#233;pendance vers celui-ci,
tout en se rappelant le noeud ancre. 2
</p>
<p>Enfin, rappelons que, du fait des adjonctions, les structures de d&#233;pendance obtenus ne sont pas n&#233;cessai-
rement projectives. Il est aussi &#224; noter que l&#8217;utilisation d&#8217;arbres TIG conduit &#224; la possibilit&#233; d&#8217;adjonctions
multiples sur un noeud en place des adjonctions cha&#238;n&#233;es dans le cas des TAG (Schabes &amp; Shieber, 1994) 3.
En terme de d&#233;pendance, on obtient alors directement des d&#233;pendances multiples sur le bon gouverneur
(par exemple pour des adjectifs comme dans le joli petit chat noir) plut&#244;t que sur les ancres des arbres
auxiliaires interm&#233;diaires (cha&#238;nage d&#8217;adjectifs).
</p>
<p>5 For&#234;ts de d&#233;pendances
</p>
<p>FRMG retourne l&#8217;ensemble de toutes les d&#233;rivations possibles pour une phrase, en s&#8217;appuyant sur un al-
gorithme d&#8217;analyse tabulaire &#224; la Earley conservant des traces de calculs sous forme d&#8217;items pour r&#233;aliser
du partage de calculs. L&#8217;ensemble des arbres de d&#233;rivation est retourn&#233; sous forme d&#8217;une for&#234;t partag&#233;e,
extraite de ces items gr&#226;ce &#224; des pointeurs arri&#232;re permettant de remonter des items &#224; leurs parents (Billot
&amp; Lang, 1989). En oubliant les d&#233;corations, une telle for&#234;t est de taille polynomiale en la longueur n de
la phrase (O(n6) en &#233;tant efficace) mais peut repr&#233;senter un nombre exponentiel (voire infini) d&#8217;arbres. La
figure 4 sch&#233;matise les deux types de partage pr&#233;sents dans ces for&#234;ts, &#224; savoir le partage de sous-arbres et
le partage de contextes gr&#226;ce &#224; des graphes ET-OU.
</p>
<p>Concr&#232;tement, le partage par sous-arbre dans les arbres de d&#233;rivation se traduit par le fait qu&#8217;une m&#234;me
op&#233;ration comme la substitution d&#8217;un arbre cible &#964; couvrant un certain empan s peut s&#8217;effectuer sur dif-
</p>
<p>2. On peut envisager d&#8217;&#233;tendre ce m&#233;canisme pour d&#8217;autres cas par un syst&#232;me de r&#232;gles. Par contre, il para&#238;t plus difficile
de g&#233;rer des changements d&#8217;orientation des d&#233;pendances, parfois souhait&#233;s, par exemple pour des adjonctions pr&#233;dicatives.
</p>
<p>3. L&#8217;ordre des adjonctions est fourni par les empans, ce qui est potentiellement incomplet en cas d&#8217;empan vide.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>(a) par sous-arbre
</p>
<p>OU
</p>
<p>(b) par contexte
</p>
<p>OU
</p>
<p>(c) par sous-arbre et contexte
</p>
<p>FIGURE 4 &#8211; Type de partage d&#8217;arbres
</p>
<p>f&#233;rents noeuds sources. Le partage par contexte se traduit par le fait que, pour un certain arbre source
couvrant un certain empan, plusieurs ensembles alternatifs d&#8217;op&#233;rations sont possibles. La conversion en
for&#234;t partag&#233;e de d&#233;pendances traite ces deux cas. Le partage de contextes se traduit par le fait qu&#8217;un
gouverneur (ancre d&#8217;un arbre source) peut &#234;tre associ&#233; &#224; plusieurs ensembles alternatifs de d&#233;pendances,
ces ensembles pouvant partager des d&#233;pendances. Le partage de sous-arbres se traduit par plusieurs gou-
verneurs en comp&#233;tition pour un gouvern&#233;. Ces &#233;l&#233;ments se retrouvent dans la figure 5 qui donne une
forme visuelle de la for&#234;t de d&#233;pendance obtenue par conversion pour la phrase &#171; il observe euh une ma-
man [avec ses jumelles]PP &#187; avec une ambigu&#239;t&#233; de rattachement sur maman ou observe pour le groupe
pr&#233;positionnel PP et des ambigu&#239;t&#233;s lexicales sur jumelles (incluant la transcat&#233;gorisation d&#8217;un adjectif).
</p>
<p>La figure 5 correspond &#224; une approximation du format DEP XML de repr&#233;sentation des for&#234;ts partag&#233;es
de d&#233;pendance, format XML qui comprend :
</p>
<p>&#8211; des &#233;l&#233;ments cluster (mat&#233;rialis&#233;s par les rectangles ext&#233;rieurs) associ&#233;s aux mots de la phrase et carac-
t&#233;ris&#233;s par une paire de positions left et right dans l&#8217;automate. Du fait des ambigu&#239;t&#233;s de segmenta-
tion provenant de SXPipe, en particulier sur les mots compos&#233;s, un mot simple (token) peut se retrouver
dans plusieurs clusters.
</p>
<p>&#8211; des &#233;l&#233;ments node (mat&#233;rialis&#233;s par les rectangles int&#233;rieurs) pointant vers un cluster et d&#233;cor&#233;s
d&#8217;une forme form (rectifi&#233;e en cas de correction orthographique fournie par SXPipe), d&#8217;un lemme
lemma, d&#8217;une cat&#233;gorie syntaxique cat, un arbre ancr&#233; tree de cat&#233;gorie maximale xcat et d&#8217;un
ensemble de d&#233;rivations deriv. Plusieurs n&#339;uds peuvent &#234;tre associ&#233;s &#224; un m&#234;me cluster.
</p>
<p>&#8211; des &#233;l&#233;ments op (non mat&#233;rialis&#233;s), historiquement traces des op&#233;rations dans la for&#234;t de d&#233;rivation mais
intuitivement interpr&#233;tables comme des constituants. Ils portent une cat&#233;gorie syntaxique non-terminale
cat comme S, un empan span simple ou &#224; trou, et incluent une ou deux d&#233;corations top ou bot
introduites par les &#233;l&#233;ments narg. Un op O est aussi associ&#233; &#224; un ensemble de d&#233;rivations deriv,
en comp&#233;tition pour construire O. Chaque d&#233;rivation &#233;tant aussi associ&#233;e &#224; un noeud gouverneur, on
constate donc que O peut avoir plusieurs noeuds t&#234;te en comp&#233;tition.
</p>
<p>&#8211; des &#233;l&#233;ments edges (mat&#233;rialis&#233;s par les arcs) mettant en relation un n&#339;ud source gouverneur s avec
un n&#339;ud target gouvern&#233; t, &#233;galement d&#233;cor&#233;s par un label et un type (substitution, adjonction,
. . .). Plus finement, un arc e est utilis&#233; (travers&#233;) par un sous-ensemble De des d&#233;rivations Ds de son
n&#339;ud source s avecDe &#171; partitionn&#233; &#187; entre plusieurs sous-&#233;l&#233;ments deriv de e, chacun portant, en attri-
but names, un sous-ensembleD &#8834; De et permettant de relier un constituant source source_op (ancr&#233;
par s) avec un constituant cible target_op (ancr&#233; par t) dont l&#8217;empan est donn&#233; par span. Pour trai-
ter le cas particulier des affectations de d&#233;pendances sur les co-ancres, l&#8217;attribut reroot_source est
utilisable sur deriv pour conserver le lien vers le noeud ancre.
</p>
<p>&#8211; des &#233;l&#233;ments hypertags (non mat&#233;rialis&#233;s) portant des d&#233;rivations et incluant une structure de traits. Un
hypertag est associable, au travers des d&#233;rivations, &#224; plusieurs constituants et noeuds t&#234;te en comp&#233;tition.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>il
</p>
<p>observe
</p>
<p>euh
</p>
<p>une
</p>
<p>maman
</p>
<p>avec
</p>
<p>ses
</p>
<p>jumelles
</p>
<p>a
</p>
<p>jumeau:nc:59 (1)
</p>
<p>son:det: (1)
</p>
<p>maman:nc:59 (2)
</p>
<p>_:S:23 (1)
</p>
<p>avec:prep:42 (3)
</p>
<p>_:VMod:166 (1)
</p>
<p>cln:cln:lexical (0)
</p>
<p>observer:v:198 (2)
</p>
<p>avec:prep:4 (3)
</p>
<p>jumeau:adj:61 (1)
</p>
<p>_EPSILON:: (0)
</p>
<p>un:det: (1)
</p>
<p>jumelle:nc:59 (1)
</p>
<p>.:_:lexical (0)
</p>
<p>S (2)
</p>
<p>det (1)
</p>
<p>N2 (1)
</p>
<p>void (1)
</p>
<p>object (2)
</p>
<p>N2 (1)
</p>
<p>det (1)
</p>
<p>N2 (1) N2 (1)
</p>
<p>PP (1)
</p>
<p>N2 (1)
</p>
<p>det (2)
</p>
<p>N2 (1)
</p>
<p>subject (2)
</p>
<p>N2 (1)
</p>
<p>vmod (1)
</p>
<p>det (1)
</p>
<p>skip (1)
</p>
<p>bleu : substitution
pointill&#233; : adjonction
pourpre : co-ancre
vert : skip
</p>
<p>FIGURE 5 &#8211; For&#234;t partag&#233;e de d&#233;pendances pour &#171; il observe euh une maman avec ses jumelles. &#187;
</p>
<p>Les pseudo-ancres mentionn&#233;es pr&#233;c&#233;demment donnent lieu &#224; des &#233;l&#233;ments cluster lexicalement vides as-
soci&#233;s &#224; des &#233;l&#233;ments node &#233;galement lexicalement vides (cas de VMod:165 et de S:23 dans la figure 5),
mais n&#233;anmoins porteurs d&#8217;un arbre, d&#8217;une cat&#233;gorie maximale et d&#8217;un ensemble de d&#233;rivations.
</p>
<p>Le format DEP XML ne mat&#233;rialise pas explicitement les d&#233;rivations (en tant qu&#8217;&#233;l&#233;ments) mais celles-
ci forment le liant de l&#8217;ensemble des composants (n&#339;uds, arcs, op et hypertags). Il est aussi int&#233;ressant
de remarquer que les for&#234;ts de d&#233;pendances partagent moins bien que les for&#234;ts de d&#233;rivations. En effet,
la conversion tend &#224; ouvrir la for&#234;t de d&#233;rivation du fait qu&#8217;un constituant (symbolis&#233; par un &#233;l&#233;ment
op) peut avoir plusieurs noeud t&#234;tes. Ainsi, supposons un arbre &#964; ancr&#233; par h sur lequel les op&#233;rations
op1, . . . , opm ont &#233;t&#233; effectu&#233;es (correspondant &#224; une d&#233;rivation de &#964; ), chaque op&#233;ration opi &#233;tant associ&#233;es
&#224; ni t&#234;tes hi,j diff&#233;rentes. Alors, nous aurons toutes les d&#233;pendances h &#8722;&#8594; hij regroupables en n1. &#183; &#183; &#183; .nm
d&#233;rivations potentielles pour h. Le nombre de d&#233;rivations associ&#233;es &#224; un noeud gouverneur peut donc
cro&#238;tre de mani&#232;re exponentielle. Ceci est particuli&#232;rement vrai suite &#224; l&#8217;utilisation de l&#8217;adjonction multiple
des TIG qui peut fait cro&#238;tre le param&#232;tre m. De longues s&#233;quences d&#8217;attachements pr&#233;positionnels sont
ainsi parfois susceptibles de conduire &#224; de tr&#232;s grosses for&#234;ts de d&#233;pendances.
</p>
<p>La vue graphique fournie par la figure 5 permet de facilement rep&#233;rer les points d&#8217;ambiguit&#233;, sur avec (en
relation avec l&#8217;attachement sur maman ou observe) et sur jumelles. Le niveau d&#8217;ambiguit&#233; est pr&#233;cis&#233; gr&#226;ce</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>aux nombres entre parenth&#232;ses port&#233;s par les noeuds et les d&#233;pendances. Sur un noeud, ce nombre indique
combien de d&#233;rivations partent de celui-ci en tant que noeud gouverneur. Sur une d&#233;pendance d, il indique
combien de d&#233;rivations du gouverneur de d transitent par d. Ainsi, 2 d&#233;rivations partent de observe, les 2
deux utilisant les arcs object et subject, mais une seule utilisant l&#8217;arc vmod.
</p>
<p>Ces nombres permettent d&#8217;estimer le taux d&#8217;ambigu&#239;t&#233; d&#8217;une phrase ramen&#233; au niveau du mot. La premi&#232;re
mesure est le taux d&#8217;ambigu&#239;t&#233; moyen par mot d&#233;fini par &#945; = 1+#edges#clusters &#8722; 1. Ce taux indique le nombre
moyen d&#8217;arcs entrants en surnombre par mot, en consid&#233;rant qu&#8217;en cas de non-ambigu&#239;t&#233;, on a un et un
seul arc entrant par mot d&#8217;o&#249; &#945; = 0. Un taux de 1 indique 2 arcs entrants en moyenne par mots, donnant
normalement de l&#8217;ordre de 2n analyses pour une phrase de longueur n. N&#233;anmoins, cette mesure tr&#232;s
simple qui refl&#232;te la structure graphique des d&#233;pendances ne prend pas en compte les interactions entre
arcs donn&#233;es par les d&#233;rivations et a tendance &#224; sous-estimer le niveau r&#233;el d&#8217;ambigu&#239;t&#233;. Une mesure
</p>
<p>alternative est donn&#233;e par le nombre moyen de d&#233;rivations par mot &#946; =
&#931;
n&#8712;nodes|derivn|
</p>
<p>#nodes . Pour la figure 5,
nous obtenons ainsi &#945; = 0, 7 et &#946; = 1, 2.
</p>
<p>6 D&#233;sambiguisation
</p>
<p>Dans un contexte applicatif, il est souvent n&#233;cessaire de ne consid&#233;rer qu&#8217;une analyse par phrase (si pos-
sible la bonne !). Un d&#233;sambiguisateur, &#233;crit en DYALOG, existe et s&#8217;appuie sur un algorithme en pro-
grammation dynamique de recherche de l&#8217;analyse A de plus fort poids donn&#233; par la somme des poids des
arcs (et, dans une bien moindre mesure, des n&#339;uds) participant &#224; A. Le poids d&#8217;un arc s&#8217;exprime comme
somme des poids donn&#233;s par des r&#232;gles &#233;l&#233;mentaires exprim&#233;es sous forme de motifs prenant en compte
les composant de l&#8217;arc courant (n&#339;uds source et cible, type, label) et &#233;ventuellement des arcs fr&#232;res, fils ou
parents, voire des arcs en comp&#233;tition. Les poids sont choisis de mani&#232;re heuristique et donnent, pour l&#8217;ins-
tant, de meilleurs r&#233;sultats que ceux obtenus par apprentissage. &#192; ce jour, le d&#233;sambiguisateur comporte
environ 150 r&#232;gles &#233;l&#233;mentaires. Par exemple, citons l&#8217;existence de r&#232;gles favorisant les arcs remplissant
la valence d&#8217;un verbe (sujet, objet, . . .), la pr&#233;sence d&#8217;un sujet avant son verbe, l&#8217;inversion du sujet si
certaines conditions sont remplies, etc. D&#8217;autres r&#232;gles p&#233;nalisent les d&#233;pendances &#224; longue distance, les
transcat&#233;gorisations non n&#233;cessaires, certaines constructions possibles mais improbables, etc.
</p>
<p>e d g e _ c o s t _ e l e m ( Name : : &#8217;+ATTR &#8217; ,
edge { l a b e l =&gt; comp , s o u r c e =&gt; node { c a t =&gt; v } , t a r g e t =&gt; node { c a t =&gt; a d j } } ,
100 ) .
</p>
<p>La notion de d&#233;pendance se pr&#234;te naturellement bien &#224; la d&#233;finition de ces r&#232;gles de d&#233;sambiguisation
(comme la r&#232;gle ci-dessus favorisant l&#233;g&#232;rement (+100) les attributs adjectivaux par rapport &#224; d&#8217;autres
cat&#233;gories syntaxique). Elle permet aussi de prendre en compte des pr&#233;f&#233;rences bi-lexicalis&#233;es et m&#234;me
tri-lexicalis&#233;es pour des restrictions de s&#233;lection (obtenues sur comptage de d&#233;pendances sur de larges
corpus). Par contre, l&#8217;algorithme de d&#233;sambiguisation travaille sur une approximation de la for&#234;t dans le
sens o&#249; les poids sont calcul&#233;s sur les d&#233;pendances ind&#233;pendemment des d&#233;rivations associ&#233;es. En toute
logique, ce n&#8217;est pas correct dans le cas de r&#232;gles consultant une d&#233;pendance mais aussi des d&#233;pendances
soeurs, parentes ou filles, &#233;ventuellement non pr&#233;sentes pour certaines d&#233;rivations. N&#233;anmoins, le co&#251;t de
l&#8217;algorithme (table 1), est d&#233;j&#224; relativement &#233;lev&#233; et parfois tr&#232;s long sur certaines phrases tr&#232;s ambigu&#235;s.
</p>
<p>L&#8217;algorithme de d&#233;sambiguisation retourne un arbre de d&#233;pendance toujours repr&#233;sentable en format DEP
XML. Il est &#233;galement possible de convertir le r&#233;sultat dans les formats EASy ou PASSAGE (Paroubek</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>et al., 2009) utilis&#233;s par les campagnes d&#8217;&#233;valuation syntaxique du fran&#231;ais.
</p>
<p>7 &#201;valuation
</p>
<p>La table 1 donne les valeurs moyennes, m&#233;dianes, et maximales des mesures d&#8217;ambigu&#239;t&#233; &#945; et &#946; sur en-
viron 4000 phrases du corpus de r&#233;f&#233;rence EASy (Paroubek et al., 2008) couvrant divers styles (litt&#233;raire,
journalistique, m&#233;dical, oral, . . .). On observe un net d&#233;calage entre les &#233;volutions de &#945; et &#946;. Ces valeurs
peuvent aussi &#234;tre contrast&#233;es avec les distributions correspondantes pour les longueurs des phrases et les
temps d&#8217;analyse et de d&#233;sambiguisation (avec un timout de 110s). La table 2, calcul&#233;e sur 2,9 millions de
phrases de Wikisource avec des analyses compl&#232;tes et des longueurs n entre 1 et 231 (moyenne de 12, 74),
sugg&#232;re que la mesure &#946; est l&#233;g&#232;rement mieux corr&#233;l&#233;e pour les temps d&#8217;analyse, de conversion vers DEP
XML et de d&#233;sambiguisation (vers Passage), avec une excellente corr&#233;lation pour DEP XML (R2 = 0, 91).
Notons &#233;galement que la complexit&#233; de l&#8217;analyse par rapport &#224; la longueur n semble en moyenne moindre
que O(n2) et celle de la d&#233;sambiguisation moindre que lin&#233;aire, ce qui semble indiquer que le co&#251;t &#233;lev&#233;
de la d&#233;sambiguisation (table 1) est du &#224; un mauvais facteur constant peut-&#234;tre r&#233;ductible.
</p>
<p>type n avg median %90 %99 max
longueur 3879 19,30 16,00 40,00 69,00 136,00
&#945; 3869 1,06 0,90 2,00 4,00 9,10
&#946; 3869 7,32 2,30 11,90 101,00 967,40
t. analyse (s) 3879 0,58 0,14 0,95 5,26 110,00
t. d&#233;samb (s) 3869 0,92 0,24 1,23 11,35 110,00
</p>
<p>TABLE 1 &#8211; Quelques statistiques sur les niveaux d&#8217;ambiguit&#233; et les temps d&#8217;analyse et de d&#233;sambiguisation
</p>
<p>analyse xmldep desamb
na R2=0,77 a=1,61 R2=0,77 a=1,10 R2=0,62 a=0,80
</p>
<p>(&#931;n|derivn|)a R2=0,76 a=0,81 R2=0,91 a=0,60 R2=0,85 a=0,47
na(1 + &#945;)b R2=0,80 a=1,46 b=0,91 R2=0,90 a=0,92 b=1,12 R2=0,76 a=0,64 b=0,94
na&#946;b R2=0,82 a=1,19 b=0,54 R2=0,91 a=0,68 b=0,54 R2=0,83 a=0,37 b=0,55
</p>
<p>TABLE 2 &#8211; Indication de corr&#233;lation (sur 2.9Mphrases de Wikisource)
</p>
<p>8 Conclusion
</p>
<p>Nous avons repris et approfondi les relations existant entre arbres de d&#233;rivations TAG et arbres de d&#233;-
pendances, en les transposant en particulier au niveau de for&#234;ts partag&#233;es. Il en r&#233;sulte une description
associ&#233;e &#224; une repr&#233;sentation XML qui permet la conception d&#8217;applications exploitant des structures de
d&#233;pendances riches en information. La repr&#233;sentation propos&#233;e s&#8217;applique par construction aux for&#234;ts de
d&#233;pendances issue d&#8217;analyses TAG, mais est aussi utilisable pour de simples arbres apr&#232;s d&#233;sambiguisa-
tion. Nous pensons qu&#8217;elle est adaptable &#224; toute sorte de for&#234;ts de d&#233;pendances, permettant de combiner &#224;
la fois des informations strictement de d&#233;pendance mais aussi des informations de constituance. Ce choix
va dans le sens d&#8217;autres formats &#233;mergeants comme TIGER (Brants &amp; Hansen, 2002) ou la proposition de
norme ISO SynAF (Declerck, 2008), qui, eux, ne prennent cependant pas en compte la notion d&#8217;ambiguit&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R&#233;f&#233;rences
</p>
<p>BILLOT S. &amp; LANG B. (1989). The structure of shared forests in ambiguous parsing. In Proc. of the 27
Annual Meeting of the Association for Computational Linguistics.
</p>
<p>BRANTS S. &amp; HANSEN S. (2002). Developments in the TIGER annotation scheme and their realization
in the corpus. In Proceedings of the Third Conference on Language Resources and Evaluation (LREC
2002), p. 1643&#8211;1649, Las Palmas.
</p>
<p>CANDITO M.-H. &amp; KAHANE S. (1998). Can the derivation tree represent a semantic graph ? an answer
in the light of meaning-text theory. In In Proc. of TAG+4, Philadelphia.
</p>
<p>DECLERCK T. (2008). A framework for standardized syntactic annotation. In Proceedings of the Sixth
Conference on International Language Resources and Evaluation : European Language Resources As-
sociation (ELRA) ELRA/ELDA.
</p>
<p>FERNANDEZ M., VILLEMONTE DE LA CLERGERIE E. &amp; VILARES M. (2007). From text to knowledge.
In Proc. of EUROCAST&#8217;07 (Eleven international conference on Computer Aided Systems theory).
</p>
<p>GARDENT C. &amp; KALLMEYER L. (2003). Semantic construction in feature-based tree-adjoining gram-
mars. In Proc. of the 10th Conference of the European Chapter of ACL.
</p>
<p>JOSHI A. &amp; RAMBOW O. (2003). A formalism for dependency grammar based on tree adjoining gram-
mar. In Proceedings of the Conference on Meaning-Text Theory (MTT), Paris.
</p>
<p>JOSHI A. K. (1987). An introduction to tree adjoining grammars. In A. MANASTER-RAMER, Ed.,
Mathematics of Language, p. 87&#8211;115. Amsterdam/Philadelphia : John Benjamins Publishing Co.
</p>
<p>KINYON A. (2000). Hypertags. In Proc. of COLING, p. 446&#8211;452.
</p>
<p>PAROUBEK P., ROBBA I., VILNAT A. &amp; AYACHE C. (2008). Easy, evaluation of parsers of french : what
are the results ? In Proceedings of the 6th International Conference on Language Resources and Evalua-
tion (LREC), Marrakech, Morroco.
</p>
<p>PAROUBEK P., VILLEMONTE DE LA CLERGERIE &#201;., LOISEAU S., VILNAT A. &amp; FRANCOPOULO
G. (2009). The PASSAGE syntactic representation. In 7th International Workshop on Treebanks and
Linguistic Theories (TLT7), Groningen.
</p>
<p>SAGOT B. &amp; BOULLIER P. (2008). SxPipe 2 : architecture pour le traitement pr&#233;-syntaxique de corpus
bruts. Traitement Automatique des Langues, 49(2).
SCHABES Y. &amp; SHIEBER S. M. (1994). An alternative conception of tree-adjoining derivation. Compu-
tational Linguistics, 20(1), 91&#8211;124.
SCHABES Y. &amp; WATERS R. C. (1995). Tree insertion grammar : a cubic-time, parsable formalism that
lexicalizes context-free grammar without changing the trees produced. Fuzzy Sets Syst., 76(3), 309&#8211;317.
THOMASSET F. &amp; VILLEMONTE DE LA CLERGERIE E. (2005). Comment obtenir plus des m&#233;ta-
grammaires. In Proceedings of TALN&#8217;05, Dourdan, France : ATALA.
</p>
<p>VILLEMONTE DE LA CLERGERIE E. (2002). Construire des analyseurs avec DyALog. In Proc. of
TALN&#8217;02.
</p>
<p>VILLEMONTE DE LA CLERGERIE E. (2010). Building factorized tags with meta-grammars. In Proc. of
TAG+10, Yale University. To appear.
</p>
<p>&#201;RIC DE LA CLERGERIE, SAGOT B., STERN R., DENIS P., RECOURC&#201; G. &amp; MIGNOT V. (2009).
Extracting and visualizing quotations from news wires. In Proceedings of LTC 2009, Poznan, Pologne.</p>

</div></div>
</body></html>