<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Du TAL au TIL</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Du TAL au TIL 
</p>
<p>Michael Zock1  Guy Lapalme2 
(1) Equipe TALEP, LIF, CNRS, UMR 6166 
</p>
<p>Case 901 - 163 Avenue de Luminy 
F-13288 Marseille Cedex 9 
</p>
<p> 
(2) RALI-DIRO, Universit&#233; de Montr&#233;al,  
</p>
<p>CP 6128, Succ. Centre-Ville, 
Montr&#233;al, Qu&#233;bec, Canada H3C 3J7 
</p>
<p>So we need to be alert. It's not just that we may find ourselves putting 
the cart before the horse. We can get obsessed with the wheels, and 
finish up with uncritically reinvented, or square, or over-refined or 
otherwise unsatisfactory wheels, or even just unicycles.  
</p>
<p>Karen Sp&#228;rck Jones 
</p>
<p>R&#233;sum&#233; papier de prise de position. 
Historiquement deux types de traitement de la langue ont &#233;t&#233; &#233;tudi&#233;s: le traitement par le cerveau 
(approche psycholinguistique) et le traitement par la machine (approche TAL). Nous pensons qu&#8217;il y a 
place pour un troisi&#232;me type: le traitement interactif de la langue (TIL), l&#8217;ordinateur assistant le cerveau. 
Ceci correspond &#224; un besoin r&#233;el dans la mesure o&#249; les gens n&#8217;ont souvent que des connaissances 
partielles par rapport au probl&#232;me &#224; r&#233;soudre. Le but du TIL est de construire des ponts entre ces 
connaissances momentan&#233;es d&#8217;un utilisateur et la solution recherch&#233;e. &#192; l'aide de quelques exemples, 
nous essayons de montrer que ceci est non seulement faisable et souhaitable, mais &#233;galement d&#8217;un co&#251;t 
tr&#232;s raisonnable. 
Abstract position paper. 
Historically two types of NLP have been investigated: fully automated processing of language by 
machines (NLP) and autonomous processing of natural language by people, i.e. the human brain 
(psycholinguistics). We believe that there is room and need for another kind, INLP: interactive natural 
language processing. This intermediate approach starts from peoples&#8217; needs, trying to bridge the gap 
between their actual knowledge and a given goal. Given the fact that peoples&#8217; knowledge is variable and 
often incomplete, the aim is to build bridges linking a given knowledge state to a given goal. We present 
some examples, trying to show that this goal is worth pursuing, achievable and at a reasonable cost. 
</p>
<p>Mots-cl&#233;s :   traitement interactif de la langue, prise en compte de l'usager, outils de traitement de la 
langue, apprentissage des langues, dictionnaires, livres de phrases,  concordanciers, traduction. 
Keywords:   interactive NLP (INLP), user interaction, tools for NLP, language learning, dictionaries, 
phrase books, concordancers, translation. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MICHAEL ZOCK, GUY LAPALME 
 
</p>
<p>1 Besoins &#233;cologiques d'une discipline, l&#8217;exemple TAL 
Une discipline doit r&#233;guli&#232;rement se remettre en cause pour continuer non seulement &#224; avancer, mais 
surtout dans la bonne direction. Ceci suppose une r&#233;flexion concernant les objectifs et des moyens.  
</p>
<p>En effet, on peut se demander quel est le r&#244;le des chercheurs impliqu&#233;s dans l&#8217;&#233;laboration de produits 
destin&#233;s au traitement de la langue. Est-ce que leur mission consiste uniquement &#224; cr&#233;er des produits, 
permettant une prise en charge int&#233;grale du traitement, donc, sans aucune intervention d&#8217;un &#234;tre 
humain (traitement automatique, TAL), ou est-ce qu&#8217;ils ne devraient pas &#233;galement chercher &#224; 
construire des outils permettant &#224; l&#8217;&#234;tre humain de passer d&#8217;une solution partielle (connaissance 
disponible &#224; un moment donn&#233;) &#224; la solution compl&#232;te ? 1 Il s&#8217;agirait donc d&#8217;une prise en charge 
partielle (traitement interactif, TIL), on construirait donc des ponts : la machine venant &#224; l&#8217;aide de 
l&#8217;&#234;tre humain. 
</p>
<p>Voici une question m&#233;ritant qu&#8217;on s&#8217;y attarde un peu, car, nombreuses sont les situations o&#249; l&#8217;aide 
serait bien utile (qu&#8217;on soit en langue maternelle ou en langue &#233;trang&#232;re), les performances des &#234;tres 
humains n&#8217;&#233;tant pas toujours &#224; la hauteur de leurs intentions. Si les &#233;checs sont relatifs et susceptibles 
de passer inaper&#231;us, ils sont n&#233;anmoins r&#233;els, allant du silence (manque de mot) aux erreurs grossi&#232;res, 
en passant par des productions approximatives. 
</p>
<p>L'exp&#233;rience de correcteurs de fautes d'orthographe est r&#233;v&#233;latrice &#224; cet &#233;gard: d'un c&#244;t&#233;, les utilisateurs 
se trouvent submerg&#233;s/noy&#233;s de suggestions non pertinentes, d&#8217;un autre c&#244;t&#233; ils ne trouvent pas la 
r&#233;ponse aux questions qu&#8217;ils se posent. D&#8217;ailleurs, ceux qui ont propos&#233; de faire de la traduction 
interactive dans les ann&#233;es 70 se sont bien rendu compte qu'il &#233;tait souvent plus difficile de poser les 
bonnes questions que d&#8217;y r&#233;pondre ou de traduire le texte lui-m&#234;me. 
</p>
<p>C'est donc dire que le dilemme est loin d'&#234;tre r&#233;solu et nous aimerions ici amener quelques pistes de 
r&#233;flexion sur les aspects suivants : 
</p>
<p>&#8226; que le TIL est un secteur important, pas assez explor&#233;, correspondant &#224; un v&#233;ritable besoin et &#224; 
un march&#233; ; 
</p>
<p>&#8226; que malgr&#233; la qualit&#233; de certains programmes ou ressources, ceux-ci peuvent &#234;tre am&#233;lior&#233;s en 
prenant davantage en compte l&#8217;utilisateur final ; 
</p>
<p>&#8226; que l&#8217;int&#233;r&#234;t des ressources augmente avec leur int&#233;grabilit&#233; ; 
&#8226; qu'un moyen d&#8217;y arriver serait de partager les ressources dans un format commun. 
</p>
<p>Afin d&#8217;illustrer les deux premiers points, nous allons montrer quelques exemples, programmes 
existants ou en-cours d&#8217;&#233;laboration, afin d&#8217;assister l&#8217;apprentissage des langues, la r&#233;daction, la lecture 
ou l&#8217;acc&#232;s aux mots. Notre objectif est moins de convaincre le lecteur de la qualit&#233; des solutions 
envisag&#233;es, que de montrer qu&#8217;il y a des besoins et, qu&#8217;au prix d&#8217;efforts raisonnables, on pourrait faire 
bien plus qu&#8217;on ne fait actuellement pour assister l&#8217;&#234;tre humain. Ceci suppose, n&#233;anmoins qu&#8217;on tienne 
compte du facteur humain et qu&#8217;on l'inclue dans le d&#233;veloppement. Malgr&#233; le titre, l&#8217;id&#233;e n&#8217;est pas de 
faire du TIL &#224; partir du TAL, mais plut&#244;t de cr&#233;er des ponts permettant &#224; la personne en difficult&#233; de 
passer d&#8217;un point A (connaissances momentan&#233;ment disponibles) au point B (solution finale). Un 
exemple typique est l&#8217;acc&#232;s lexical. Aussi, il ne s&#8217;agit pas d&#8217;&#233;tudier l&#8217;apport du TAL pour 
l&#8217;apprentissage des langues, puisque celui-ci demande selon nous une approche du type TIL. Enfin, le 
                                                
1 On notera, que Vauquois qui avait introduit le terme de TAL en 1969 (voir Cori et L&#233;on, 2002) souhaitait distinguer deux 
</p>
<p>types de recherche : (a) celui des linguistes utilisant l&#8217;ordinateur comme outil pour mettre en place et tester des th&#233;ories, 
outils ou ressources (grammaires, dictionnaires, concordanciers, etc.) ; (b) celui d&#8217;&#233;quipes pluridisciplinaires s&#8217;int&#233;ressant 
aux applications. Celles-ci comprenaient la communication homme-machine, l&#8217;enseignement programm&#233;, la traduction 
automatique, etc. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DU TAL AU TIL 
 
</p>
<p>TIL n&#8217;est pas une alternative au TAL, mais plut&#244;t un autre axe de recherche, suppl&#233;mentaire, 
semblable, tout en &#233;tant diff&#233;rent puisqu&#8217;il n&#8217;est pas enti&#232;rement automatique et qu&#8217;il part (ou permet 
d&#8217;int&#233;grer) des connaissances de l&#8217;homme, connaissances qui sont variables. Ceci dit, les comp&#233;tences 
des chercheurs TAL peuvent s&#8217;av&#233;rer fort pr&#233;cieuses pour faire du TIL. C&#8217;est d&#8217;ailleurs pour cette 
raison que nous nous adressons &#224; cette communaut&#233;. 
</p>
<p>2 &#201;largissement du cadre en TIL 
Un des exemples les plus spectaculaires illustrant qu&#8217;on peut faire des choses utiles est le moteur de 
recherche de Google. Ce programme est capable de nous fournir presque instantan&#233;ment une longue 
liste de candidats, contenant souvent la r&#233;ponse &#224; notre requ&#234;te. Ce qui est frappant c&#8217;est que le 
programme poss&#232;de peu de connaissances linguistiques, qu&#8217;il est tr&#232;s rapide, et qu&#8217;il nous rend souvent 
d&#8217;&#233;normes services. C&#8217;est clairement un programme TIL. En m&#234;me temps, ce programme pose un 
certain nombre de probl&#232;mes : il ram&#232;ne trop d&#8217;informations, les bribes d'informations ne sont pas 
forc&#233;ment pertinentes ou dans le bon ordre; il faut admettre que l'usager ne fournit pas beaucoup 
d'indices sur l'ordre des r&#233;ponses souhait&#233;es. N&#8217;ayant pas une trace des buts cens&#233;s &#234;tre atteints, on n'a 
qu'une liste plate d'URLs visit&#233;s, il y a un r&#233;el danger r&#233;el d&#8217;oublier ce qu&#8217;on cherchait initialement. On 
part dans une mauvaise direction et au lieu de s&#8217;approcher du but, on s&#8217;en &#233;loigne sans s&#8217;en rendre 
compte. 
</p>
<p>Con&#231;u dans une optique TIL, WordNet (WN) a connu davantage de succ&#232;s aupr&#232;s des linguistes 
informaticiens (monde TAL) qu&#8217;aupr&#232;s du grand public (utilisateurs de dictionnaires) et des 
psychologues. On notera d&#8217;ailleurs que les deux mondes s&#8217;ignorent. Les psychologues ne citent pour 
ainsi dire jamais WN (Altmann, 1997), et la communaut&#233; WN fait l&#8217;impasse sur les travaux des 
psychologues travaillant sur le dictionnaire mental (Miller, 1990). D&#8217;autre part, si WN &#233;tait davantage 
d&#233;velopp&#233; dans une optique TIL les points suivants seraient davantage probl&#233;matis&#233;s : l&#8217;organisation 
du dictionnaire (structure des diff&#233;rentes cat&#233;gories lexicales) et la partie &#8220;sens&#8221;, ou les &#233;l&#233;ments de 
sens des mots. En absence de d&#233;finition syst&#233;matique, on constate qu&#8217;une recherche sur Google donne 
parfois des meilleurs r&#233;sultats qu&#8217;une recherche dans WN. C&#8217;est notamment le cas lorsque la d&#233;finition 
est absente dans la base de WN. 
</p>
<p>Le TIL correspond &#224; un besoin r&#233;el, car, si les gens ont pratiquement toujours quelques connaissances 
par rapport au probl&#232;me &#224; r&#233;soudre, il leur manque souvent quelque chose, pour y parvenir. Il faut donc 
leur fournir l(es) &#233;l&#233;ment(s) manquant(s). Autrement dit, il faut cr&#233;er des ponts liant les connaissances 
actuelles d&#8217;un utilisateur au but recherch&#233;. Le TIL pr&#233;sente donc &#224; la fois un d&#233;fi et une occasion. C&#8217;est 
un d&#233;fi, car il exige la prise en compte du facteur humain, aspect trop souvent ignor&#233; en TAL puisque 
non directement pertinent. Or c&#8217;est aussi une belle occasion de r&#233;aliser des choses fort utiles, car, 
contrairement &#224; la machine, on peut s&#8217;appuyer sur les connaissances et l&#8217;intelligence de l&#8217;&#234;tre humain. 
Le co&#251;t pour relever ce d&#233;fi est donc raisonnable. 
</p>
<p>3 &#201;tat des lieux 
Si les d&#233;buts du TAL ont &#233;t&#233; marqu&#233;s par la tentative de construire des syst&#232;mes complets (Sabah, 
1989 et 1990), on a chang&#233; d&#8217;approche depuis (Jurafsky, D. and J. H. Martin, 2008 ; Manning et 
Schuetze, 1999), en favorisant la construction de composants de ressources (outils, bases de donn&#233;es). 
En effet, il y a de nombreux sites contenant des outils (programmes) ou des donn&#233;es (corpus, 
dictionnaire). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MICHAEL ZOCK, GUY LAPALME 
 
</p>
<p>Beaucoup de choses ont &#233;t&#233; r&#233;alis&#233;es et souvent de bonne facture. On peut donc se demander ce qu&#8217;il 
nous faut de plus. Bien s&#251;r, il y a des probl&#232;mes qualitatifs et quantitatifs (couverture, ad&#233;quation et 
pertinence du corpus), des probl&#232;mes d'int&#233;gration et de combinaison.  
</p>
<p>Mais nous aimerions insister sur les aspects suivants : 
&#8226; si les outils existants sont bien adapt&#233;s au TAL, ils ne le sont pas toujours au TIL ;2 
&#8226; on peut faire des choses fort utiles avec des moyens relativement simples; 
&#8226; on doit &#234;tre plus sensible aux besoins des gens et les int&#233;grer d&#232;s le d&#233;but dans le cycle du 
</p>
<p>d&#233;veloppement. 
</p>
<p>4 Quelques exemples de TIL 
Une langue peut s'apprendre suite &#224; un effort d&#233;lib&#233;r&#233;. On &#233;tudie la langue et on fait des exercices 
(apprentissage volontaire). Ceci dit, on peut aussi l'apprendre de mani&#232;re involontaire (apprentissage 
incident). C&#8217;est un effet de bord qui se produit pour peu qu&#8217;on se livre &#224; des activit&#233;s comme, la 
lecture, l&#8217;&#233;criture, les jeux, etc. On apprend en parlant et en &#233;crivant tout en commettant des fautes dont 
la majorit&#233; sont d&#8217;ailleurs souvent sans cons&#233;quence sur la compr&#233;hension du message. Les enfants 
&#233;tant joueurs de nature ont moins de scrupules &#224; cet &#233;gard que les adultes, ils apprennent g&#233;n&#233;ralement 
les langues plus facilement. Or la possibilit&#233; d'interaction et la patience infinie d'un ordinateur peuvent 
&#234;tre des atouts pr&#233;cieux pour l'apprentissage des langues malgr&#233; le fait qu'il ne soit pas un tr&#232;s bon 
interlocuteur &#224; cause de sa compr&#233;hension limit&#233;e.  
</p>
<p>En limitant la port&#233;e du discours et le style d'interaction, il devient possible d'assister intelligemment le 
locuteur, comme le montrent les quelques exemples suivants. 
</p>
<p>4.1 Les livres de phrases  
Nous pr&#233;senterons trois exemples de livres de phrases d&#233;velopp&#233;s dans un &#233;tat d&#8217;esprit diff&#233;rent, mais 
tous int&#233;ressants par rapport &#224; notre propos. Leur conception repose en grande partie sur des techniques 
relativement simples. 
</p>
<p>Tatoeba [TATOEBA] est une plateforme collaborative visant &#224; rassembler une grande quantit&#233; de phrases  
traduites dans plusieurs langues, dont le japonais. &#201;tant un corpus align&#233; multilingue, Tatoeba peut 
assister l&#8217;apprentissage des langues via sa m&#233;moire de traduction. L&#8217;utilit&#233; de cette ressource d&#233;pend de 
la couverture, de la qualit&#233; et de l&#8217;ad&#233;quation des exemples par rapport aux besoins de l&#8217;utilisateur, 
mais comme il s&#8217;agit d&#8217;une ressource construite de mani&#232;re collaborative, cela devrait &#233;voluer dans le 
bon sens. Tatoeba int&#232;gre un translitt&#233;rateur permettant d&#8217;annoter les id&#233;ogrammes en termes de kana 
ou de convertir les kanas (syllabaires phon&#233;tiques) en lettres romanes. 
</p>
<p>CIFLI-SurviTra [SURVITRA] est une plate-forme destin&#233;e &#224; favoriser l'ing&#233;nierie et la mise au point de 
composants de traduction automatique, &#224; partir d'une m&#233;moire de traduction form&#233;e de livres de 
phrases multilingues avec variables lexicales. C&#8217;est aussi un livre de phrases digital multilingue, 
assistant linguistique pour voyageurs monolingues en situation de &quot;survie&quot;. Le corpus d&#8217;un domaine, le 
&quot;Restaurant&quot;, a &#233;t&#233; structur&#233; en sous-domaines avec des phrases align&#233;es et des classes lexicales de 
locutions quadrilingues (fran&#231;ais, hindi, tamoul, anglais). L&#8217;approche est g&#233;n&#233;rique, donc r&#233;utilisable 
                                                
2 D&#8217;ailleurs, m&#234;me des outils destin&#233;s &#224; des &#234;tres humains peuvent poser probl&#232;mes. Effectuer une requ&#234;te dans l&#8217;interface 
</p>
<p>du [TLF] qui rel&#232;ve non pas du TAL mais du TIL n&#8217;est pas toujours facile. Si l&#8217;interface est tol&#233;rante vis &#224; vis de 
l&#8217;orthographe (&#233;criture phon&#233;tique, erreurs d&#8217;accents, omission de tiret) et vis &#224; vis des mots fl&#233;chis (&#233;criront -&gt; &#233;crire), 
les choses deviennent nettement plus compliqu&#233;es en cas  d&#8217;une recherche assist&#233;e ou complexe. D&#8217;ailleurs, on vous 
pr&#233;vient : &#171; La pleine ma&#238;trise du formulaire ci-dessous n&#233;cessite la lecture des documents : (a) Les recherches complexes, 
(b) D&#233;finition du contenu et (c) Les types d'objets du TLF.&#187; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DU TAL AU TIL 
 
</p>
<p>pour d&#8217;autres langues et l&#8217;application est susceptible d&#8217;&#234;tre &#233;galement adapt&#233;e pour diff&#233;rents types 
d'appareils tels les t&#233;l&#233;phones portables et les assistants num&#233;riques. 
</p>
<p>L&#8217;objectif de DrillTutor [DRILLTUTOR] est d&#8217;assister des apprenants adultes &#224; acqu&#233;rir les automatismes 
n&#233;cessaires pour produire &#224; un d&#233;bit normal les structures fondamentales d&#8217;une langue. Le point de 
d&#233;part est une base de donn&#233;es contenant les phrases glan&#233;es dans des m&#233;thodes de langue ou un livre 
de phrases destin&#233; &#224; des touristes contenant les expressions de base pour survivre dans des situations 
courantes : faire des courses, demander un renseignement, etc. Ce genre d&#8217;ouvrage contient 
typiquement les structures fondamentales d'une langue et un lexique de base. Pour aider la navigation 
et la communication de l&#8217;intention de communication les structures sont index&#233;es en termes de but, et 
certains &#233;l&#233;ments sont g&#233;n&#233;ralis&#233;s sous forme de variables lexicales (je veux une bi&#232;re -&gt; &lt;PERSONNE&gt; 
vouloir &lt;BOISSON&gt;) pour permettre &#224; l&#8217;utilisateur d&#8217;exprimer sa pens&#233;e en plusieurs temps : d&#8217;abord en 
termes globaux (but, id&#233;e globale), puis successivement en termes lexicaux (instanciation des variables 
par des valeurs lexicales) et grammaticaux (choix morphologiques concernant le nombre et le temps). 
</p>
<p>4.2 Aide &#224; la lecture et &#224; la r&#233;daction 
S&#8217;il y a un domaine qui a &#233;norm&#233;ment chang&#233; ces derni&#232;res ann&#233;es, c&#8217;est bien celui des dictionnaires 
&#233;lectroniques. La lexicographie a grandement b&#233;n&#233;fici&#233; des avanc&#233;s th&#233;oriques et de la puissance des 
ordinateurs et de la richesse cach&#233;e des corpus. Malgr&#233; cela on ne tient pas toujours assez bien compte 
des besoins des utilisateurs. 
</p>
<p>Trouver des informations dans un dictionnaire n&#8217;est pas toujours chose ais&#233;e, d&#8217;abord cela demande 
souvent beaucoup de temps, et il peut y avoir des probl&#232;mes li&#233;s &#224; l&#8217;&#233;criture et &#224; la morphologie. 
Pourtant, les probl&#232;mes mentionn&#233;s pourraient trouver une solution simple et satisfaisante pour bon 
nombre de cas. Il suffirait d&#8217;ajouter au dictionnaire un translitt&#233;rateur et un lemmatiseur. En int&#233;grant 
ce type de fonctionnalit&#233; dans des applications courantes (traitement de texte ou navigateur internet), 
on pourrait d&#233;sormais lire et comprendre des textes &#233;crits dans une langue &#233;trang&#232;re (lecture active). Il 
suffirait alors de cliquer sur un mot pour voir appara&#238;tre un menu &#8220;pop up&#8221; permettant au lecteur de 
choisir parmi les informations celle qui l&#8217;int&#233;resse &#224; cet instant (traduction, d&#233;finition, information 
grammaticale, etc.).  La barre d'outils Google [GOOGLE] permet d&#233;j&#224; d'afficher la traduction d'un mot 
anglais dans une page web, mais ne tient pas compte du contexte pour d&#233;sambig&#252;iser le mot.  
</p>
<p>Antidote [ANTIDOTE], connu principalement pour son excellent correcteur d'orthographe et de 
grammaire, donne acc&#232;s &#224; son dictionnaire et &#224; d'autres outils comme des conjugueurs et la recherche 
de mots apparent&#233;s ou cooccurrents avec une interface intuitive et tol&#233;rante. Toutefois, la masse de 
donn&#233;es et l'interface sont ferm&#233;es aux autres applications de TAL sauf pour certains langages de script 
qui ne sont pas courants dans la communaut&#233; des chercheurs. Antidote permet un acc&#232;s au dictionnaire 
en contexte de lecture ou de r&#233;daction en s&#233;lectionnant un menu contextuel, mais ce dernier nous 
transporte alors dans un environnement de travail initial diff&#233;rent de notre lecture. 
</p>
<p>ELDIT [ELDIT] illustre qu&#8217;un dictionnaire, d&#8217;une taille aussi petite que 3000 &#224; 4000 entr&#233;es, peut rendre 
d&#8217;&#233;normes services &#224; des apprenants de langue &#224; certaines conditions. Le secret d&#8217;ELDIT r&#233;side dans le 
fait que c&#8217;est un environnement comprenant une base de donn&#233;es d'environ 400 textes interfac&#233;e avec 
des dictionnaires &#233;lectroniques allemand et italien. Tous les mots apparaissant dans le texte sont 
consultables soit via le dictionnaire soit via les textes dans lesquels ils apparaissent. En lan&#231;ant une 
requ&#234;te (on donne un mot dans la fen&#234;tre pr&#233;vue &#224; cet effet) ou en cliquant sur un mot apparaissant 
dans un texte on peut avoir acc&#232;s &#224; tout ce qu&#8217;on aimerait savoir &#224; son sujet : sens, traduction, 
usages/contextes, informations grammaticales, flexions, combinaison avec d&#8217;autres mots (collocation), 
etc. Int&#233;gr&#233; dans un tel environnement, ce dictionnaire est devenu une v&#233;ritable aubaine pour 
l&#8217;apprenant. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MICHAEL ZOCK, GUY LAPALME 
 
</p>
<p>4.3 Textes bilingues 
Un concordancier est un programme qui recherche des mots et des expressions dans un corpus de texte. 
Lorsqu'on soumet une requ&#234;te, le syst&#232;me fouille sa base de donn&#233;es et affiche toutes les occurrences 
trouv&#233;es, dans leur contexte : la phrase contenant la requ&#234;te ou un certain nombre de caract&#232;res avant et 
apr&#232;s les mots de la requ&#234;te. Un concordancier bilingue affichera &#233;galement la traduction de chaque 
passage contenant une occurrence dans une langue.  
</p>
<p>Un concordancier bilingue &#233;tant un outil destin&#233; &#224; des r&#233;dacteurs, des traducteurs ou des apprenants, il 
n'est pas encore envisageable d'utiliser des syst&#232;mes de traduction automatique pour traduire les 
passages &#224; la vol&#233;e. Les concordanciers bilingues qui suivent l'approche TAL, p.ex. [TRANSSEARCH], 
affichent donc des extraits de textes d&#233;j&#224; traduits. L'alignement automatique au niveau de la phrase 
&#233;tant en g&#233;n&#233;ral assez fiable, il est possible de cr&#233;er automatiquement des banques de millions de 
phrases parall&#232;les dans lesquelles le syst&#232;me cherche des occurrences dans une langue et affiche la 
phrase correspondante dans l'autre. Comme il y a en g&#233;n&#233;ral plusieurs occurrences d'une m&#234;me requ&#234;te 
et qu'elles n'ont pas toutes &#233;t&#233; traduites de la m&#234;me fa&#231;on, un r&#233;dacteur peut ainsi s'inspirer de solutions 
toutes faites &#224; des probl&#232;mes de traductions. Les m&#233;moires de traduction s'inspirent du m&#234;me principe 
et sont int&#233;gr&#233;es dans un environnement de r&#233;daction afin de d&#233;tecter automatiquement des phrases 
semblables &#224; des phrases d&#233;j&#224; traduites pour en sugg&#233;rer imm&#233;diatement la traduction. 
</p>
<p>Pour l'apprentissage des langues, il est tout &#224; fait possible d'utiliser cette banque de textes et n'afficher 
que la langue source. L'apprenant tente de comprendre les phrases et lorsqu'il bute sur une d&#8217;entre elles, 
il pourrait obtenir la traduction, c&#8217;est-&#224;-dire la phrase correspondante, par simple clic de souris.  
</p>
<p>Il existe bien des algorithmes d'alignement de mots utilis&#233;s, mais ils ne sont pas encore assez fiables 
pour identifier les traductions au niveau des mots ou des expressions tout en tenant compte des 
diff&#233;rentes acceptions pour un m&#234;me mot. Une autre possibilit&#233; qui symbolise plut&#244;t l'approche TIL, 
utilis&#233;e par ELex [ELEX], est de baliser manuellement chaque mot ou expression, comme pour ELDIT 
mentionn&#233; pr&#233;c&#233;demment, en effectuant une d&#233;sambig&#252;isation; m&#234;me aid&#233; par des dictionnaires ou des 
&#233;tiqueteurs qui peuvent limiter la gamme des choix, ce travail peut-&#234;tre assez complexe et fastidieux 
pour l'enseignant. 
</p>
<p>4.4 Traduction interactive 
Depuis la suggestion de M.Kay fin des ann&#233;es soixante (Kay, 1980), plusieurs syst&#232;mes de traduction 
automatique interactive ont vu le jour, avec souvent des d&#233;veloppements importants. Contrairement 
aux apparences, le terme n'est pas contradictoire dans le mesure o&#249; l&#8217;&#234;tre humain demande 
(interactivement) de l&#8217;aide qui lui est fournit automatiquement par la machine. Pour une &#233;tude tr&#232;s 
compl&#232;te voir H. Blanchon (2004) qui dans son &#233;tat de l&#8217;art d&#233;crit des syst&#232;mes interactifs comme 
TAO de Weidner/CAT, Transactive de ALPS avant de pr&#233;senter son propre syst&#232;me, LIDIA. A noter 
qu&#8217;&#224; l&#8217;&#233;poque il n&#8217;y avait pas encore la notion de m&#233;moire de traductions et que LIDIA int&#233;grait les 
aspects linguistiques, psychologiques et ergonomiques : le ma&#238;tre du jeu &#233;tait bel et bien l'&#234;tre humain 
(Boitet et Blanchon, 1994). 
 
Une approche un peu diff&#233;rente a &#233;t&#233; suivie par TransType [TRANSTYPE]. Dans ce projet on propose 
&#233;galement un outil d&#8217;aide &#224; la traduction misant sur l&#8217;interactivit&#233;. Le syst&#232;me observe le traducteur qui 
tape son texte cible et p&#233;riodiquement propose des extensions &#224; ce texte. Le traducteur peut accepter 
ces compl&#233;tions telles quelles, il peut les modifier, ou il peut d&#233;cider de ne pas en tenir compte en 
continuant simplement &#224; taper. Apr&#232;s chaque caract&#232;re entr&#233; ou &#233;limin&#233; par le traducteur, TransType 
recalcule ses pr&#233;dictions et en propose de nouvelles. Cette approche au TIL est tr&#232;s prometteuse, mais 
assez lourde &#224; mettre en place, car elle implique le d&#233;veloppement de mod&#232;les de traduction adapt&#233;s 
qui doivent &#234;tre appel&#233;s &#224; la vol&#233;e sur des ordinateurs rapides. Le projet initial visait une client&#232;le de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DU TAL AU TIL 
 
</p>
<p>traducteurs professionnels pour lesquels il a &#233;t&#233; assez difficile de mesurer des gains en productivit&#233; 
&#233;tant donn&#233; la nouveaut&#233; de l'outil. Or il serait int&#233;ressant d'adapter cette approche &#224; des contextes de 
r&#233;daction bilingue soit par des apprenants ou des r&#233;dacteurs qui doivent occasionnellement traduire 
leurs propres textes. D'autant plus que les usagers deviennent de plus en plus familiers avec des 
suggestions de compl&#233;tions offertes par des syst&#232;mes informatiques tels qu'on les retrouve lors du 
remplissage de formulaires web ou de la frappe sur des appareils &#224; clavier limit&#233;s. 
 
Dans les exemples ci-dessus il &#233;tait souvent question d&#8217;apprentissage. Qu&#8217;on ne s&#8217;y m&#233;prenne pas, ce 
qui vaut pour l&#8217;apprentissage d&#8217;une langue &#233;trang&#232;re vaut souvent &#233;galement pour la langue maternelle. 
On ne poss&#232;de jamais enti&#232;rement une langue, et m&#234;me en langue maternelle on op&#232;re souvent sur la 
base d&#8217;informations incompl&#232;tes. Par exemple, on cherche ses mots, d&#8217;o&#249; l&#8217;int&#233;r&#234;t d&#8217;un dictionnaire 
mettant &#224; la port&#233;e de la souris l&#8217;information convoit&#233;e. 
</p>
<p>5 Perspectives et conclusion 
Nous avons argument&#233; que le TIL correspond &#224; un vrai besoin, car il est important de capitaliser sur les 
acquis des connaissances disponibles des utilisateurs &#224; un moment donn&#233;. Nous avons soulign&#233; 
l'importance de construire des ponts entre les applications et les gens. Ce point nous para&#238;t capital, car, 
contrairement &#224; beaucoup de syst&#232;mes existants notamment dans le domaine de l&#8217;EAO nous nous 
appuyons sur les connaissances disponibles des gens, connaissances susceptibles de varier d&#8217;une 
personne &#224; l&#8217;autre et &#224; tout moment. C&#8217;est le syst&#232;me qui s&#8217;adapte aux besoins de l&#8217;utilisateur. Le 
chemin propos&#233; (ou possible) pour arriver &#224; la solution doit tenir compte de l&#8217;&#233;tat cognitif du moment. 
Il ne saurait donc &#234;tre question de suivre un chemin trac&#233; en avance, une fois pour tout et identique 
pour tout le monde. 
</p>
<p>Nous avons identifi&#233; quelques outils de TAL qui int&#232;grent d&#233;j&#224; ces passerelles et nous avons montr&#233; 
ainsi la possibilit&#233; de r&#233;aliser des choses tr&#232;s utiles m&#234;me avec des moyens du bord. Des dictionnaires 
&#233;lectroniques peuvent, par l&#8217;interm&#233;diaire du multifen&#234;trage et de liens hypertexte, augmenter 
consid&#233;rablement la quantit&#233; d&#8217;information accessible, mais ceci suppose une volont&#233; d'int&#233;gration d&#232;s 
leur conception alors qu'ils ont &#233;t&#233; trop souvent d&#233;velopp&#233;s comme des alternatives &#224; des versions 
papier. 
</p>
<p>On n&#8217;apprend pas seulement &#224; l&#8217;&#233;cole et de mani&#232;re volontaire,  on apprend pendant toute notre vie, 
m&#234;me notre langue maternelle. On apprend beaucoup de choses tout en travaillant sur autre chose : la 
lecture s&#8217;av&#233;rant b&#233;n&#233;fique &#224; l&#8217;expression orale. L&#8217;&#234;tre humain est toujours int&#233;ress&#233; par quelque chose, 
et en gardant intacte cette envie naturelle, voire pour la stimuler il sera utile de cr&#233;er des ponts, et c&#8217;est 
ici que les acteurs du monde TAL ont un r&#244;le important &#224; jouer. 
</p>
<p>Bien que beaucoup d'applications interactives aient &#233;t&#233; r&#233;alis&#233;es, il y a de nombreuses possibilit&#233;s qui 
n&#8217;ont pas encore &#233;t&#233; saisies. Aussi, si nous avons une bonne compr&#233;hension des fondements du TAL 
(ressources, m&#233;thodes), l&#8217;&#233;quivalent nous manque en TIL. Pour y parvenir il faudrait prendre du recul, 
ce qui suppose qu&#8217;il y ait une communaut&#233; s&#8217;int&#233;ressant &#224; ce type de probl&#232;mes. Or s&#8217;il y a des 
chercheurs s&#8217;int&#233;ressant &#224; l&#8217;EAO (enseignement assist&#233; par ordinateur), au e-Learning et &#224; la TAO 
(traduction assist&#233;e par ordinateur), il n&#8217;y a pas de communaut&#233; v&#233;ritable s&#8217;int&#233;ressant au TIL. Aussi, il 
y a ni ouvrage ni m&#233;thode d&#233;crivant comment tirer b&#233;n&#233;fice des points communs (principes). Pourtant, 
ceci tout comme l&#8217;interdisciplinarit&#233; sont des facteurs essentiels si l&#8217;on veut vraiment progresser sur 
cette voie qui nous para&#238;t importante. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MICHAEL ZOCK, GUY LAPALME 
 
</p>
<p>6 URLS 
</p>
<p>6.1 Outils 
[ATALA] http://www.atala.org/-Outils-pour-le-TAL-, R&#233;pertoire d'outils pour le TAL, plusieurs 
</p>
<p>pour le traitement du fran&#231;ais 
[NLTK] http://www.nltk.org/Home, Packages Python pour le TAL 
[OPENNLP] http://opennlp.sourceforge.net/projects.html, Organizational center for open source 
</p>
<p>projects related to natural language processing 
[STATNLP] http://nlp.stanford.edu/links/statnlp.html, Listes d'outils pour le traitement statistique de la 
</p>
<p>langue 
</p>
<p>6.2 Ressources 
[BLF] http://ilt.kuleuven.be/blf/, Base lexicale du fran&#231;ais 
[CNRTL] http://www.cnrtl.fr/, Centre National des Ressources Textuelles et Lexicales 
[ELDIT] http://www.eurac.edu/eldit, Environnement d'apprentissage en allemand et en italien bas&#233; 
</p>
<p>sur des textes balis&#233;s 
[EURALEX] http://www.euralex.org/resources/Resources.html, R&#233;pertoire de liens vers de 
</p>
<p>dictionnaires et textes 
[TLF] http://atilf.atilf.fr/tlf.htm, Tr&#233;sor de la langue fran&#231;aise informatis&#233; 
</p>
<p>6.3 Syst&#232;mes 
[ANTIDOTE] http://www.druide.com, Correcteur de fautes d'orthographe int&#233;gr&#233; des outils de 
</p>
<p>r&#233;daction (commercial) 
[GOOGLE] http://www.google.com/tools/firefox/toolbar/FT2/intl/fr/, Barre d'outils de 
</p>
<p>Google (Firefox ou IE) (gratuit dans un contexte commercial) 
[TRANSSEARCH] http://www.tsrali.com, Concordancier bilingue (commercial) 
[TRANSTYPE] http://rali.iro.umontreal.ca/Traduction/TransType.fr.html, Prototype de traduction 
</p>
<p>interactive 
</p>
<p>6.4 Apprentissage des langues 
[DRILLTUTOR] http://pageperso.lif.univ-mrs.fr/~michael.zock/DrillTutor, Livre de phrases 
</p>
<p>orient&#233;es par les buts 
[ELEX] http://tice.det.fundp.ac.be/clarolex/, D&#233;monstration de E-LEX pour 
</p>
<p>l'apprentissage de l'anglais par &#233;tiquetage 
[SURVITRA] http://aiakide.net/survitra-3/, Livre de phrases de survie dans un domaine 
[TATOEBA] http://tatoeba.org/fre, Livre de phrases interactif et collaboratif 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DU TAL AU TIL 
 
</p>
<p>7 R&#233;f&#233;rences 
ALTMANN, G.T.M. (ed) (1997). Cognitive models of speech processing: psycholinguistic and 
computational perspectives on the lexicon. Taylor &amp; Francis. 1997. 
</p>
<p>BLANCHON, H. (2004). Comment d&#233;finir, mesurer et am&#233;liorer la qualit&#233;, l'utilisabilit&#233; et l'utilit&#233; des 
syst&#232;mes de TAO de l'&#233;crit et de l'oral. Une bataille contre le bruit, l'ambigu&#239;t&#233;, et le manque de 
contexte. http://www-clips.imag.fr/geta/herve.blanchon/Docs/HDR%20HB.pdf 
</p>
<p>BOITET, C. &amp; H. BLANCHON (1994). Promesses et probl&#232;mes de la &#8220;TAO pour tous&#8221; apr&#232;s LIDIA-1, 
une premi&#232;re maquette. Langages, 116, pp. 20&#8212;47. 
</p>
<p>CORI M et LEON J, (2002). La constitution du TAL. Etude historique des d&#233;nominations et des 
concepts. Traitement Automatique des Langues, n&#176;43-3 :21-55. 
</p>
<p>JURAFSKY, D. &amp; J. H. MARTIN. (2008). Speech and Language Processing: An Introduction to Natural 
Language Processing, Computational Linguistics and Speech Recognition (2ed.). Prentice Hall. 
</p>
<p>KAY, M. (1980). The proper place of men and machines in language translation. Research report CSL-
80-11, Xerox Palo Alto Research Center, Palo Alto, CA. Reproduit dans Machine Translation 12 (1/2), 
1997, 3-23. 
</p>
<p>MANNING, C. &amp; H. SCHUETZE. (1999). Foundations of Statistical Natural Language Processing, MIT 
Press. Cambridge, MA: 1999. (http://nlp.stanford.edu/fsnlp/). 
</p>
<p>MILLER, G. (ed.) (1990): WordNet: An On-Line Lexical Database. International Journal of 
Lexicography, 3(4), 235-312.  
</p>
<p>SABAH, G. (1989 et 1990). L'intelligence artificielle et le langage : Repr&#233;sentations des connaissances  
(vol. 1); Processus de compr&#233;hension, (vol. 2). Herm&#232;s, Paris. </p>

</div></div>
</body></html>