<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Text-it /Voice-it Une application mobile de normalisation des SMS</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Text-it / Voice-it
Une application mobile de normalisation des SMS
</p>
<p>Richard Beaufort K&#233;vin Mac&#233; C&#233;drick Fairon
CENTAL, Universit&#233; catholique de Louvain, 1348 Louvain-la-Neuve, Belgique
</p>
<p>{richard.beaufort,kevin.mace,cedrick.fairon}@uclouvain.be
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente Text-it / Voice-it, une application de normalisation des SMS pour t&#233;l&#233;-
phone mobile. L&#8217;application permet d&#8217;envoyer et de recevoir des SMS normalis&#233;s, et offre le choix entre
un r&#233;sultat textuel (Text-it) et vocal (Voice-it).
</p>
<p>Abstract. This paper presents Text-it / Voice-it, an application that makes it possible to normalize
text messages directly from mobile phones. The application allows the user to both send and receive
normalized text messages, and gives the choice between a textual (Text-it) and a vocal (Voice-it) result.
</p>
<p>Mots-cl&#233;s : SMS, normalisation, application, plugin, serveur.
</p>
<p>Keywords: Text messages, normalization, application, plugin, server.
</p>
<p>1 Introduction
</p>
<p>Depuis la fin des ann&#233;es &#8217;90, les fournisseurs de t&#233;l&#233;phonie mobile proposent &#224; leurs utilisateurs de com-
muniquer en s&#8217;envoyant des messages &#233;crits : les textos ou SMS (du nom du service lui-m&#234;me, Short
Message Service). Comme le constatent Fairon et al. (2006), les SMS s&#8217;&#233;cartent significativement des
conventions orthographiques. Si bon nombre de ces &#233;carts peuvent certainement &#234;tre qualifi&#233;s de fautes
d&#8217;orthographe, la majorit&#233;, pourtant, rel&#232;ve plut&#244;t de la strat&#233;gie de codage, voire du cumul de strat&#233;gies.
Les utilisateurs exp&#233;riment&#233;s, par exemple, n&#8217;h&#233;sitent pas &#224; combiner jeux et transcriptions phon&#233;tiques
(&#8216;demain&#8217;&#8594; &#8216;2m1&#8217;), squelettes consonantiques (&#8216;toujours&#8217;&#8594; &#8216;tjrs&#8217;), ou s&#233;parateurs incorrects, manquants
et abusifs (&#8216;j esper&#8217; pour &#8216;j&#8217;esp&#232;re&#8217;) au sein d&#8217;une m&#234;me s&#233;quence (&#8216;j&#8217;croib1kcv&#8217; pour &#8216;je crois bien que &#231;a
va&#8217;). Quelles qu&#8217;en soient les raisons, ces &#233;carts par rapport aux conventions orthographiques compliquent
la gestion automatique des SMS par des applications telles que la synth&#232;se de la parole (&#224; destination, par
exemple, des personnes malvoyantes ou des automobilistes) et la recherche d&#8217;informations (par exemple,
l&#8217;extraction automatique de rendez-vous &#224; ajouter &#224; l&#8217;agenda).
</p>
<p>Dans un tel contexte, on peut d&#232;s lors faire l&#8217;hypoth&#232;se que la normalisation des SMS, c&#8217;est-&#224;-dire la
r&#233;&#233;criture des SMS en une orthographe plus conventionnelle, deviendra, dans un avenir proche, une &#233;tape
&#224; part enti&#232;re du processus de communication par SMS.
</p>
<p>Text-it / Voice-it a &#233;t&#233; con&#231;u dans cette perspective : l&#8217;application permet d&#8217;ajouter la normalisation des
SMS aux fonctionnalit&#233;s d&#233;j&#224; pr&#233;sentes sur le t&#233;l&#233;phone portable. Le syst&#232;me se divise en deux parties :
un serveur et un plugin. Le serveur, invisible pour les utilisateurs, r&#233;alise la normalisation. Le plugin,
install&#233; sur le t&#233;l&#233;phone mobile, donne acc&#232;s &#224; un certain nombre d&#8217;options de normalisation et commu-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R. BEAUFORT, K. MAC&#201;, C. FAIRON
</p>
<p>nique avec le serveur de normalisation. L&#8217;application permet aussi bien d&#8217;envoyer que de recevoir des
SMS normalis&#233;s, et offre le choix entre deux r&#233;sultats : le texte normalis&#233; (Text-it) ou la synth&#232;se vocale
correspondante (Voice-it). L&#8217;algorithme de normalisation a &#233;t&#233; pr&#233;sent&#233; dans le d&#233;tail dans Beaufort et al.
(2010) auquel nous renvoyons le lecteur.
</p>
<p>Cet article s&#8217;organise comme suit. Afin de faciliter la compr&#233;hension du fonctionnement du syst&#232;me dans
son ensemble, nous commen&#231;ons par pr&#233;senter en section 2 le plugin install&#233; sur le mobile, avant de
pr&#233;senter le serveur en section 3. La d&#233;monstration propos&#233;e dans le cadre de la conf&#233;rence est ensuite
bri&#232;vement d&#233;crite en section 4.
</p>
<p>2 Le plugin
</p>
<p>Le plugin est encore en cours de d&#233;veloppement et n&#8217;est actuellement finalis&#233; que pour les smartphones
utilisant le syst&#232;me d&#8217;exploitation Android. L&#8217;objectif est cependant de le d&#233;cliner pour le plus grand
nombre de plateformes possible. A terme, le plugin sera t&#233;l&#233;chargeable sur des sites web sp&#233;cialis&#233;s dans
la distribution d&#8217;applications pour t&#233;l&#233;phones mobiles, tels que l&#8217;Apple Store et l&#8217;Android Market.
</p>
<p>Une fois install&#233;, le plugin autorise deux modes de fonctionnement : en r&#233;ception et en &#233;mission. Le mode
r&#233;ception permet &#224; l&#8217;utilisateur de recevoir des SMS normalis&#233;s. Il peut &#234;tre configur&#233; au travers d&#8217;une
interface (figure 1a) qui donne acc&#232;s &#224; un certain nombre d&#8217;options :
&#8211; Activer : coch&#233;e, cette option assure que le plugin se d&#233;clenche &#224; la r&#233;ception d&#8217;un nouvel SMS.
&#8211; Auto text-it : par d&#233;faut, le plugin demande confirmation avant de normaliser un SMS re&#231;u (figure 1b).
</p>
<p>Lorsque cette option est coch&#233;e, la normalisation est r&#233;alis&#233;e d&#8217;office et affich&#233;e &#224; l&#8217;&#233;cran.
&#8211; Message original : cette option coch&#233;e, le SMS original est affich&#233; en plus du SMS normalis&#233; (figure 1c).
</p>
<p>(a) Panneau de (b) Demande de (c) Affichage du
configuration confirmation SMS normalis&#233;
</p>
<p>FIG. 1 &#8211; Quelques interfaces du plugin.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Text-it / Voice-it
</p>
<p>Actuellement, nous employons la biblioth&#232;que de synth&#232;se de la parole fournie par Eyes-free
(http://code.google.com/p/eyes-free/). La vocalisation d&#8217;un SMS est donc r&#233;alis&#233;e directement
sur le t&#233;l&#233;phone, &#224; partir du SMS normalis&#233;, et est accessible &#224; l&#8217;utilisateur via un bouton de l&#8217;interface
d&#8217;affichage (figure 1c). A terme, par contre, nous pr&#233;voyons d&#8217;utiliser le syst&#232;me de synth&#232;se pr&#233;sent&#233;
dans Beaufort et al. (2010), afin d&#8217;am&#233;liorer la d&#233;tection et la phon&#233;tisation des unit&#233;s linguistiques (URL,
num&#233;ros de t&#233;l&#233;phone, etc.) pr&#233;sentes dans le message &#224; synth&#233;tiser. La synth&#232;se sera alors r&#233;alis&#233;e sur le
serveur, ce qui pr&#233;servera la batterie du t&#233;l&#233;phone.
</p>
<p>Le mode &#233;mission est en cours de d&#233;veloppement. Il permettra d&#8217;envoyer des SMS normalis&#233;s. Dans
l&#8217;ensemble, la fonctionnalit&#233; devrait fortement ressembler &#224; l&#8217;envoi d&#8217;un SMS standard, si ce n&#8217;est que
l&#8217;utilisateur devra sp&#233;cifier le type de message : textuel (Text-it) ou vocal (Voice-it). Une fois le texte r&#233;dig&#233;,
le plugin l&#8217;enverra au serveur pour normalisation, et attendra le r&#233;sultat pour l&#8217;envoyer au destinataire. Un
message textuel (Text-it) sera bien s&#251;r envoy&#233; sous la forme d&#8217;un SMS. Le format d&#8217;envoi d&#8217;un message
vocal (Voice-it), par contre, reste encore &#224; d&#233;finir. Il pourrait s&#8217;agir d&#8217;un MMS ou d&#8217;un d&#233;p&#244;t sur la bo&#238;te
vocale du destinataire.
</p>
<p>3 Le serveur
</p>
<p>Le plugin communique avec l&#8217;application install&#233;e sur le serveur au travers d&#8217;un service web constitu&#233; de
deux parties : un client et l&#8217;application en elle-m&#234;me. Lorsqu&#8217;un plugin fait une requ&#234;te de normalisation,
un client sp&#233;cifique est cr&#233;&#233;, soumet une requ&#234;te &#224; l&#8217;application, en attend la r&#233;ponse et la renvoie au plugin.
Pour g&#233;rer l&#8217;ensemble des interactions possibles entre les clients et l&#8217;application, nous avons utilis&#233; des
&#171; pipes nomm&#233;s &#187;. Sous Linux, un pipe nomm&#233; fonctionne comme un pipe d&#8217;entr&#233;e/sortie classique, si ce
n&#8217;est qu&#8217;il porte un nom qui l&#8217;identifie de mani&#232;re univoque. Ceci offre plusieurs avantages :
</p>
<p>1. Plusieurs processus peuvent acc&#233;der au m&#234;me pipe nomm&#233; (&#233;criture/lecture multiple).
2. Les pipes nomm&#233;s se g&#232;rent comme des fichiers standard. Les &#233;critures simultan&#233;es sont donc trai-
</p>
<p>t&#233;es de mani&#232;re s&#233;quentielle, ce qui &#233;vite les risques de m&#233;lange de donn&#233;es.
3. Un pipe nomm&#233; peut &#234;tre ouvert en mode bloquant : tout processus qui y acc&#232;de en lecture est d&#232;s
</p>
<p>lors bloqu&#233; tant qu&#8217;aucune information n&#8217;y est &#233;crite, ce qui r&#233;duit la consommation CPU.
4. Un processus peut utiliser plusieurs pipes nomm&#233;s, en entr&#233;e et/ou en sortie.
</p>
<p>L&#8217;architecture pr&#233;sent&#233;e en figure 2 profite directement de ces avantages :
1. L&#8217;application poss&#232;de un seul pipe d&#8217;entr&#233;e, o&#249; tous les clients &#233;crivent. Elle traite s&#233;quentiellement
</p>
<p>les requ&#234;tes dans l&#8217;ordre d&#8217;arriv&#233;e, et se met en mode d&#8217;attente (pipe bloquant) d&#232;s que le pipe est
vide. Une requ&#234;te est un nom de fichier contenant un SMS. L&#8217;application lit donc le nom dans le
pipe, ouvre le fichier correspondant et traite le SMS qu&#8217;il contient.
</p>
<p>2. L&#8217;application poss&#232;de un pipe d&#8217;erreur commun, qui lui permet de signaler &#224; tous les clients actifs
qu&#8217;un probl&#232;me qui les concerne tous s&#8217;est produit (par exemple, une impossibilit&#233; de se charger).
</p>
<p>3. Tout client cr&#233;e deux pipes qui lui sont propres, et les ouvre en lecture. L&#8217;application, de son c&#244;t&#233;,
ouvre les deux m&#234;mes pipes en &#233;criture. Le premier pipe est un pipe de sortie qui permet d&#8217;&#233;crire le
nom du fichier-r&#233;sultat produit par le traitement. Le second pipe est un pipe d&#8217;erreur qui permet &#224;
l&#8217;application d&#8217;indiquer si une erreur est survenue lors du traitement du fichier d&#233;pos&#233; par le client.
</p>
<p>4. Lorsque le client a re&#231;u les r&#233;sultats attendus, il supprime les pipes qu&#8217;il a cr&#233;&#233;s et renvoie le r&#233;sultat
(texte ou son) vers le plugin (et donc le t&#233;l&#233;phone) qui l&#8217;a appel&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>R. BEAUFORT, K. MAC&#201;, C. FAIRON
</p>
<p>5. Lorsque l&#8217;application re&#231;oit une demande d&#8217;arr&#234;t, elle supprime ses pipes d&#8217;entr&#233;e et d&#8217;erreur avant
de s&#8217;arr&#234;ter.
</p>
<p>Par souci de robustesse et afin de s&#233;curiser le service, nous avons d&#233;velopp&#233; un module de surveillance,
dont le principe est illustr&#233; en figure 3. Ce module r&#233;alise trois op&#233;rations :
</p>
<p>1. Il v&#233;rifie la pr&#233;sence de l&#8217;application en m&#233;moire vive (fl&#232;ches pointill&#233;es). Si l&#8217;application a disparu,
le syst&#232;me de surveillance la relance.
</p>
<p>2. Il v&#233;rifie que l&#8217;application fonctionne correctement (fl&#232;ches pleines). Le test est r&#233;alis&#233; en four-
nissant &#224; l&#8217;application un fichier dont le temps de traitement est connu. Si l&#8217;application ne r&#233;pond
pas dans les temps requis, un embouteillage est en cours et l&#8217;application ainsi que tous les clients
associ&#233;s sont interrompus. L&#8217;application est ensuite relanc&#233;e.
</p>
<p>3. Lorsque l&#8217;application est relanc&#233;e 3 fois sans succ&#232;s, le module de surveillance red&#233;marre la ma-
chine, se relance lui-m&#234;me et initialise l&#8217;application en m&#233;moire.
</p>
<p>APPLICATION&#8233;
</p>
<p>CLIENT&#8233;
n&#8233;
</p>
<p>PIPE&#8233;DE&#8233;
SORTIE&#8233;
CLIENT&#8233;n&#8233;
</p>
<p>PIPE&#8233;
D'ERREUR&#8233;
COMMUN&#8233;
</p>
<p>PIPE&#8233;
D'ENTREE&#8233;
COMMUN&#8233;
</p>
<p>PIPE&#8233;
D'ERREUR&#8233;
CLIENT&#8233;n&#8233;
</p>
<p>CLIENT&#8233;
...&#8233;
</p>
<p>CLIENT&#8233;
1&#8233;
</p>
<p>PIPE&#8233;DE&#8233;
SORTIE&#8233;
CLIENT&#8233;...&#8233;
</p>
<p>PIPE&#8233;
D'ERREUR&#8233;
CLIENT...&#8233;
</p>
<p>PIPE&#8233;DE&#8233;
SORTIE&#8233;
CLIENT&#8233;1&#8233;
</p>
<p>PIPE&#8233;
D'ERREUR&#8233;
CLIENT&#8233;1&#8233;
</p>
<p>FIG. 2 &#8211; Architecture du serveur.
</p>
<p>SURVEILLANCE&#8233;
</p>
<p>PROCESSUS&#8233; MEMOIRE&#8233;
</p>
<p>FIG. 3 &#8211; Module de surveillance.
</p>
<p>4 La d&#233;monstration
</p>
<p>Dans le cadre de la session de d&#233;monstration, nous proposons de tester l&#8217;application Text-it / Voice-it en
mode r&#233;ception. Les participants qui le souhaitent auront l&#8217;occasion d&#8217;envoyer leurs propres SMS vers un
smartphone &#233;quip&#233; du plugin.
</p>
<p>Si une connexion SSH est disponible sur le lieu de la conf&#233;rence, il sera &#233;galement possible d&#8217;observer le
traitement r&#233;alis&#233; sur le serveur.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BEAUFORT R., ROEKHAUT S., COUGNON L.-A. &amp; FAIRON C. (2010). Une approche hybride traduc-
tion/correction pour la normalisation des SMS. In Actes de la Conf&#233;rence sur le Traitement Automatique
des Langues (TALN&#8217;10). A para&#238;tre.
FAIRON C., KLEIN J. R. &amp; PAUMIER S. (2006). Le langage SMS : &#233;tude d&#8217;un corpus informatis&#233; &#224;
partir de l&#8217;enqu&#234;te Faites don de vos SMS &#224; la science. Presses Universitaires de Louvain. 136 pages.</p>

</div></div>
</body></html>