<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>FipsColor : grammaire en couleur interactive pour l&#8217;apprentissage du fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p> 
</p>
<p>FipsColor : grammaire en couleur interactive                        
pour l&#8217;apprentissage du fran&#231;ais 
</p>
<p>Jean-Philippe Goldman, Kamel Nebhi, Christopher Laenzlinger 
</p>
<p>(1) LATL - Laboratoire d&#8217;Analyse et de Technologie du Langage, 
D&#233;partement de Linguistique, Facult&#233; des Lettres, 
</p>
<p>Universit&#233; de Gen&#232;ve 
 
</p>
<p>Jean-Philippe.Goldman@unige.ch, 
Kamel.Nebhi@unige.ch, 
</p>
<p>Christopher.Laenzlinger@unige.ch 
</p>
<p> 
</p>
<p>R&#233;sum&#233; L'analyseur multilingue FiPS permet de transformer une phrase en une structure syntaxique riche 
et accompagn&#233;e d'informations lexicales, grammaticales et th&#233;matiques. On d&#233;crit ici une application qui 
adapte les structures en constituants de l&#8217;analyseur FiPS &#224; une nomenclature grammaticale permettant la 
repr&#233;sentation en couleur. Cette application interactive et disponible en ligne (http://latl.unige.ch/fipscolor) 
peut &#234;tre utilis&#233;e librement par les enseignants et &#233;l&#232;ves de primaire. 
</p>
<p>Abstract The FiPS parser analyzes a sentence into a syntactic structure reflecting lexical, grammatical and 
thematic information. The present paper describes the adaptation of the structures in terms of constituents as 
existent in FiPS to a grammatical annotation, as well as its coloured representation. This online interactive 
application (available at http://latl.unige.ch/fipscolor) can be freely used by teachers and pupils of primary 
education. 
</p>
<p>Mots-cl&#233;s :   analyse syntaxique, grammaire g&#233;n&#233;rative, services web, tei 
Keywords:   chart parser, generative grammar, web services, tei </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>J-P GOLDMAN, K. NEBHI, C. LAENZLINGER 
</p>
<p> 
</p>
<p>1 Motivation 
Dans cet article, nous pr&#233;sentons une application web directement destin&#233;e au monde de l&#8217;enseignement et 
bas&#233;e sur l&#8217;analyseur syntaxique FiPS. FipsColor reprend les principes p&#233;dagogiques de la grammaire en 
couleur (Plan d&#8217;&#233;tudes et &#171; Ma&#238;trise du fran&#231;ais &#187; - Corome Suisse Romande) selon lesquels toute cat&#233;gorie 
grammaticale et fonction de constituant sera repr&#233;sent&#233;e par une couleur. L&#8217;application va permettre &#224; 
l&#8217;apprenant de diff&#233;rencier les cat&#233;gories grammaticales de mots (repr&#233;sent&#233;es par des mots colori&#233;s) d&#8217;une 
part, et les fonctions syntaxiques (repr&#233;sent&#233;es par des groupes de mots soulign&#233;s), d&#8217;autre part. Le syst&#232;me 
de couleur est un moyen mn&#233;motechnique efficace qui permet &#233;galement de mettre l&#8217;accent sur certains 
points probl&#233;matiques de la langue, comme par exemple les ambigu&#239;t&#233;s lexicales. La phrase suivante 
illustre ce cas : &#171; Paul ferme la porte et d&#233;clare haut et ferme qu&#8217;il va g&#233;rer la ferme. &#187; 
Dans cet exemple, &#171; ferme &#187; est verbe, adverbe puis nom commun. Les diff&#233;rentes colorations permettent &#224; 
l&#8217;&#233;l&#232;ve de distinguer clairement les cat&#233;gories grammaticales de mots. Outre les ambigu&#239;t&#233;s de la langue, le 
sous-lignage des fonctions syntaxiques a pour but de mieux pr&#233;senter les r&#232;gles d&#8217;accord et d&#8217;appr&#233;hender 
au mieux les structures les plus complexes (proposition relative, proposition conjonctive, etc.). Dans ce 
sens, FipsColor est un support didactique int&#233;ressant en milieu scolaire. 
</p>
<p>2 L&#8217;analyseur syntaxique FiPS 
L'analyseur syntaxique FiPS (Laenzlinger et Wehrli 1991, Wehrli 1997), d&#233;velopp&#233; depuis plusieurs 
ann&#233;es au LATL, est un outil linguistique capable d'associer &#224; chaque phrase d'un texte une structure 
syntaxique accompagn&#233;e d'informations lexicales, grammaticales et s&#233;mantiques (&#171; th&#233;matiques &#187;)1. Les 
applications de l'analyseur sont multiples: traduction automatique (ou aide &#224; la traduction) (Wehrli 2003), 
synth&#232;se et reconnaissance de la parole (Gaudinat et al. 1999 et Goldman et al. 2001), indexation et 
recherche 'intelligente' d'informations, extraction terminologique (Seretan 2008) et apprentissage des 
langues (L'Haire &amp; Vandeventer-Faltin 2003). FiPS a &#233;t&#233; d&#233;velopp&#233; sur la base de la th&#233;orie Principes &amp; 
Param&#232;tres de la Grammaire G&#233;n&#233;rative (Chomsky 1995 : chap. 1, Haegeman 1994, Laenzlinger 2003). La 
structure en constituants assign&#233;e aux phrases repose sur un sch&#233;ma X-barre r&#233;duit &#224; deux niveaux: [XP L X 
R ]. XP est une projection maximale de la t&#234;te X, alors que L (Sp&#233;cifieurs) et R (Compl&#233;ments) sont des 
listes (&#233;ventuellement vides) de projections maximales correspondant respectivement aux sous-
constituants gauches et droits de la t&#234;te X. X est une variable correspondant aux cat&#233;gories Adv (adverbe), 
A (adjectif), N (nom), D (d&#233;terminant), V (verbe), P (pr&#233;position), C (conjonction), T (temps). Une phrase 
compl&#232;te a donc la structure suivante :2 
[TP [AdvP Hier] [DP le [NP gar&#231;on]] a [VP recueilli [DP un [NP [AP petit] chat [AP noir] [AP affam&#233; ] ] ] ] 
La strat&#233;gie d'analyse est de type gauche &#224; droite avec traitement parall&#232;le des alternatives, combinant une 
approche incr&#233;mentale, essentiellement ascendante avec un filtre descendant. Selon cette strat&#233;gie dite du 
'coin droit', l'algorithme est dirig&#233; par les donn&#233;es (data-driven), c'est-&#224;-dire on cherche &#224; attacher un 
nouvel &#233;l&#233;ment au coin droit d'un constituant dans le contexte gauche d&#233;j&#224; existant. Ce dernier sp&#233;cifie un 
ensemble de n&#339;uds actifs auxquels le nouvel &#233;l&#233;ment est susceptible de s'attacher. Trois m&#233;canismes 
fondamentaux sont utilis&#233;s par l'analyseur : la projection, la combinaison et le d&#233;placement.  
L'impl&#233;mentation objet de FiPS consiste &#224; concevoir les objets linguistiques, tels que les structures 
lexicales et les projections syntaxiques, comme des structures abstraites dont l'impl&#233;mentation peut varier 
                                                 
</p>
<p>1
 Par contraste, les analyseurs 'superficiels' ne cherchent pas &#224; construire une repr&#233;sentation globale, ni a fortiori une forme 
</p>
<p>logique, mais restent &#224; un niveau de repr&#233;sentation morpho-syntaxique, avec un regroupement des constituants minimaux 
(groupes nominaux, groupes pr&#233;positionnels, etc.). 
</p>
<p>2
 Le groupe nominal est analys&#233; comme un syntagme d&#233;terminant (DP) contenant un syntagme nominal (NP). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FIPSCOLOR : GRAMMAIRE EN COULEUR INTERACTIVE POUR L&#8217;APPRENTISSAGE DU FRAN&#199;AIS 
</p>
<p> 
</p>
<p>d'une langue &#224; l'autre. Ces variations sont trait&#233;es par l'extension de type en ce qui concerne les structures 
de donn&#233;es et par la red&#233;finition des m&#233;thodes pour ce qui est des processus de traitement de ces donn&#233;es. 
Le niveau le plus abstrait dans la hi&#233;rarchie des objets d&#233;crit les propri&#233;t&#233;s fondamentales qui sont v&#233;rifi&#233;es 
dans toutes les langues. Ceci s'apparente d'une certaine mani&#232;re au concept chomskyen de 'grammaire 
universelle'. Cette approche syntaxique formelle et les avantages de l'impl&#233;mentation objet permettent un 
temps de traitement rapide (environ un million de mots par heure), une souplesse et une facilit&#233; de 
d&#233;veloppement. 
</p>
<p>3 Adaptation des &#233;tiquettes syntagmatiques et choix d&#8217;une sortie 
Parmi les deux niveaux de repr&#233;sentations consid&#233;r&#233;s : le niveau lexical concerne la cat&#233;gorie 
grammaticale des mots (ou part-of-speech): Nom Verbe, Adjectif, Pr&#233;position, D&#233;terminant, Adverbe, 
Conjonction, Pronom. La correspondance entre les &#233;tiquettes de FiPS et celles de la sortie FipsColor est 
univoque. Il est &#224; signaler que la richesse de l&#8217;analyse permet d&#8217;associer &#224; chaque mot des informations 
suppl&#233;mentaires, par exemple le genre et le nombre pour les noms et adjectifs, ou encore le temps, la 
personne et le nombre pour les verbes. Le niveau syntagmatique concerne les groupes ou syntagmes. La 
cat&#233;gorie de leur t&#234;te d&#233;termine g&#233;n&#233;ralement leur type : groupe pr&#233;positionnel, nominal, adjectival, 
adverbial ou verbal. Mais c&#8217;est la fonction des constituants qui est mis en valeur dans FipsColor. Seuls 
les constituants et fonctions majeurs de la phrase sont repr&#233;sent&#233;s. Sujet, Compl&#233;ment d'Objet Direct et 
Indirect, Attribut du Sujet, Compl&#233;ment Circonstanciel, et Pr&#233;dicat. La figure ci-dessous r&#233;sume les 
correspondances possibles entre constituants et fonctions et leurs &#233;quivalences dans l&#8217;analyse FiPS. 
</p>
<p>         
</p>
<p> 
</p>
<p>[TP [AdvP Hier] [DP le [NP gar&#231;on]] a [VP recueilli [DP un [NP [AP petit] chat [AP noir] [AP affam&#233;] ] ] ] 
</p>
<p> 
</p>
<p>En sortie de l&#8217;analyseur, les structures syntaxiques arborescentes sont repr&#233;sent&#233;es au format XML avec la 
recommandation TEI (&#171; Text Encoding Initiative &#187;). La TEI permet de construire un sch&#233;ma personnalis&#233; &#224; 
l&#8217;aide de diff&#233;rents modules dont l&#8217;utilisation forme une DTD particuli&#232;re. Notre formalisme utilise la 
version P5 de la TEI et plus particuli&#232;rement le module consacr&#233; &#224; l&#8217;analyse linguistique (&#171; Simple 
Analytic Mechanisms &#187;). 
                                                 
</p>
<p>3
 Certaines structures permettent le d&#233;placement du COD. Les phrases (ou TP) sont, pour l&#8217;instant, exclues de la fonction COD. 
</p>
<p>Sujet DP sp&#233;cifieur de TP 
Pr&#233;dicat T&#234;te de VP | T&#234;te de TP 
</p>
<p>Cod DP compl&#233;ment de VP3 
</p>
<p>Coi PP compl&#233;ment de VP 
</p>
<p>Attribut DP | PP | AP compl&#233;ment de VP 
Cc AdvP sp&#233;cifieur de TP | VP | CompVP 
</p>
<p>PP sp&#233;cifieur de TP | CompVP 
DP sp&#233;cifieur de TP |  CompVP 
</p>
<p>COD 
</p>
<p>Pr&#233;d 
</p>
<p>G Pr&#233;p 
</p>
<p>CC 
</p>
<p>COI 
</p>
<p>Attr 
G Nom 
</p>
<p>G Adj 
</p>
<p>G Adv 
</p>
<p>G Verb 
</p>
<p>SUJ 
</p>
<p>CC Sujet Pr&#233;dicat Cod 
</p>
<p>Figure 1 : Correspondances constituants/fonctions 
</p>
<p>Tableau 1 : Correspondances FipsColor/Fips </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>J-P GOLDMAN, K. NEBHI, C. LAENZLINGER 
</p>
<p> 
</p>
<p>4 Cr&#233;ation du service web et mise en place de la web application 
Notre sortie XML est produite par un module sp&#233;cifique agissant tel un service web. L&#8217;application 
consomme ce service et transforme le r&#233;sultat XML en HTML associ&#233; &#224; diverses technologies web pour 
cr&#233;er les interactions n&#233;cessaires. La figure ci-dessous est une vue de FipsColor : l&#8217;analyse montre que le 
pronom relatif &#171; que &#187; est bien interpr&#233;t&#233; comme &#233;tant Cod du verbe &#171; aimer &#187;. Dans le second exemple, 
les pronoms clitiques sont aussi correctement analys&#233;s : &#171; le &#187; est bien Cod et &#171; lui &#187; est Coi. FipsColor 
rend compte des propositions ench&#226;ss&#233;es en utilisant un soulignage multiple. La structure arborescente 
inh&#233;rente au XML mod&#233;lise au mieux cet ench&#226;ssement.  
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>5 Conclusion et perspectives 
Cet article propose un outil interactif d&#8217;aide &#224; l&#8217;apprentissage du fran&#231;ais qui permet &#224; l&#8217;apprenant de 
mieux prendre conscience des concepts grammaticaux de base dans un cadre ludique. FipsColor est une 
r&#233;ponse &#224; la cr&#233;ation de services web bas&#233;e sur une application provenant du TAL et directement 
exploitable par la communaut&#233; p&#233;dagogique.  
</p>
<p>R&#233;f&#233;rences  
CHOMSKY, N. 1995. The Minimalist Program, Cambridge, Mass., MIT Press. 
GAUDINAT, A, GOLDMAN J-P. &amp; WEHRLI E. 1999. &quot;Syntax-Based Speech Recognition: How a 
Syntactic Parser Can Help a Recognition System&quot;. EuroSpeech Conference, Budapest, Hungary, 1999, 
volA, p.1587-1590 
GOLDMAN J.-P, GAUDINAT A,. NERIMA L., WEHRLI E. 2001. &quot;FipsVox : a French TTS based on a 
syntactic parser&quot;. 4th Speech Synthesis Workshop. Edinburgh, 2001 
HAEGEMAN, L. 1994. Introduction to Government and Binding Theory, Oxford, Blackwell. 
LAENZLINGER, C. 2003. Initiation &#224; la Grammaire Formelle du Fran&#231;ais: Le Mod&#232;le Principes &amp; 
Param&#232;tres de la Grammaire G&#233;n&#233;rative Transformationnelle. Peter Lang, Berne/Berlin. 
LAENZLINGER, C. ET E. WEHRLI, 1991. &quot;FIPS : Un Analyseur interactif pour le fran&#231;ais&quot;. TA 
Informations, 32:2, 35-49. 
L'HAIRE, S. &amp; VANDEVENTER-FALTIN, A 2003. &quot;Enor diagnosis in the FreeText project&quot;. CAUCO 
20(3), T. Heift &amp; M. Schulze (&#233;ds.). Special Issue Error Analysis and Error Correction in Computer-
Assisted Language Learning 
SERETAN, V. 2008. &quot;Collocation extraction based on syntactic parsing&quot;. Ph.D. thesis, Univ. of Geneva.  
WEHRLI, E. 1997. L'analyse syntaxique des langues naturelles: Probl&#232;mes et m&#233;thodes, Paris, Masson 
WEHRLI, E. 2003. &quot;Translation of Words in Context&quot;. IXth MT Summit, New Orleans.
</p>
<p>Figure 2 : FipsColor, fen&#234;tre de r&#233;sultat et menus </p>

</div></div>
</body></html>