<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La traduction automatique des pronoms clitiques. Quelle approche pour quels r&#233;sultats?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>La traduction automatique des pronoms clitiques.
Quelle approche pour quels r&#233;sultats? &#8727;
</p>
<p>Lorenza Russo
Laboratoire d&#8217;Analyse et de Technologie du Langage
D&#233;partement de linguistique &#8211; Universit&#233; de Gen&#232;ve
</p>
<p>2, rue de Candolle &#8211; CH-1211 Gen&#232;ve 4
Lorenza.Russo@unige.ch
</p>
<p>R&#233;sum&#233;. Dans cet article, nous abordons la probl&#233;matique de la traduction automatique des pronoms
clitiques, en nous focalisant sur la traduction de l&#8217;italien vers le fran&#231;ais et en comparant les r&#233;sultats obte-
nus par trois syst&#232;mes : Its-2, d&#233;velopp&#233; au LATL (Laboratoire d&#8217;Analyse et de Technologie du Langage)
et bas&#233; sur un analyseur syntaxique profond ; Babelfish, bas&#233; sur des r&#232;gles linguistiques ; et Google Trans-
late, caract&#233;ris&#233; par une approche statistique.
</p>
<p>Abstract. In this article, we discuss the problem of automatic translation of clitic pronouns, focaly-
sing our attention on the translation from Italian to French and comparing the results obtained by three MT
systems : Its-2, developed at LATL (Language Technology Laboratory) and based on a syntactic parser ;
Babelfish, a rule-based system ; and Google Translate, caracterised by a statistical approach.
</p>
<p>Mots-cl&#233;s : Analyseur syntaxique, traduction automatique, pronoms clitiques, proclise, enclise.
</p>
<p>Keywords: Syntactic parser, automatic translation, clitic pronouns, proclisis, enclisis.
</p>
<p>1 Introduction
</p>
<p>Le syst&#232;me pronominal, en italien tout comme en fran&#231;ais, est constitu&#233; de pronoms dits forts et de pro-
noms dits faibles, atones ou clitiques. Parmi les pronoms faibles, on d&#233;finit un pronom clitique comme un
pronom non accentu&#233; qui n&#8217;occupe pas la m&#234;me place syntaxique qu&#8217;un pronom fort (1a), qui est conjoint
au verbe qui lui sert d&#8217;h&#244;te (1b) et qui ne peut pas subir de ph&#233;nom&#232;nes de coordination (1c) (Kayne,
1975).
</p>
<p>(1) a. Io voglio quella. b. Io lo (*adesso) dico. c. * Io ti e vi parlo.
Je veux celle-l&#224;. Je le (*maintenant) dis. * Je te et vous parle.
Je la veux. Je le dis maintenant. Je parle &#224; toi et &#224; vous.
</p>
<p>&#8727;. Nous remercions le Fonds National Suisse de la Recherche Scientifique qui a soutenu ce travail de recherche (No 100015-
130634) ainsi que le directeur du projet d&#233;crit dans cet article, le Prof. &#201;ric Wehrli, et Sandra Schwab pour une lecture attentive
de ce texte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LORENZA RUSSO
</p>
<p>Dans les deux langues qui font l&#8217;objet de ce travail &#8211; l&#8217;italien et le fran&#231;ais &#8211;, les pronoms clitiques
pr&#233;sentent des r&#233;alisations morphologiques diff&#233;rentes selon le cas qu&#8217;ils portent (accusatif ou datif) (TAB.
1) ainsi que des r&#233;alisations syntaxiques diff&#233;rentes par rapport &#224; leur mode d&#8217;attachement. Dans ce dernier
cas, on parle de position proclitique (pr&#233;verbale) ou de position enclitique (postverbale) du pronom clitique
par rapport au verbe auquel il s&#8217;attache.
</p>
<p>Clitiques accusatifs Clitiques datifs
Italien mi ti lo / la ci vi li / le mi ti gli / le ci vi loro
Fran&#231;ais me te le / la nous vous les me te lui nous vous leur
</p>
<p>TABLE 1 &#8211; R&#233;alisations morphologiques des pronoms clitiques en italien et en fran&#231;ais
</p>
<p>Ainsi, dans le cas des structures syntaxiques &#224; l&#8217;indicatif, l&#8217;italien et le fran&#231;ais pr&#233;sentent le clitique en
position proclitique (2a) 1, alors que dans les phrases pr&#233;sentant un g&#233;rondif l&#8217;italien pr&#233;f&#232;re l&#8217;enclise et le
fran&#231;ais la proclise (2b). De plus, dans les structures infinitives subordonn&#233;es, l&#8217;italien pr&#233;sente l&#8217;enclise
(2c) tout comme la proclise (2d) l&#224; o&#249; le fran&#231;ais n&#8217;accepte que la proclise.
</p>
<p>(2) a. Lo guardo. b. Mi addormento leggendoti una favola.
Je le regarde. Je m&#8217;endors en te lisant une fable.
</p>
<p>c. Voglio mangiarla. d. La voglio mangiare.
Je veux la manger. Je veux la manger.
</p>
<p>Consid&#233;r&#233; du point de vue de la traduction automatique, le ph&#233;nom&#232;ne des pronoms clitiques se r&#233;v&#232;le
difficile &#224; traiter parce qu&#8217;un traducteur automatique risque, par exemple, de confondre le pronom cli-
tique avec un d&#233;terminant en cas d&#8217;homographie (3a) ; de le g&#233;n&#233;rer dans une position d&#8217;attachement non
ad&#233;quate dans la langue cible (3b) ; ou encore, de mal identifier son cas ou son genre (3c).
</p>
<p>(3) a. L&#8217;annuncio ad alta voce. b. Le inizio a preparare. c. Paolo gli parla.
L&#8217;annonce &#224; haute voix. Je les commence &#224; pr&#233;parer. Paolo en parle.
Je l&#8217;annonce &#224; haute voix. Je commence &#224; les pr&#233;parer. Paolo lui parle.
</p>
<p>Tout en gardant &#224; l&#8217;esprit notre cadre de r&#233;f&#233;rence, &#224; savoir la traduction des pronoms clitiques de l&#8217;italien
vers le fran&#231;ais, nous nous sommes pos&#233; les questions suivantes : est-ce que les deux principales approches
en traduction automatique &#8211; linguistique et statistique &#8211; m&#232;nent &#224; des diff&#233;rences dans la qualit&#233; des
traductions propos&#233;es ? En cas de r&#233;ponse positive, est-ce que l&#8217;une des deux approches se r&#233;v&#232;le plus
efficace ? Afin de r&#233;pondre &#224; ces questions, nous avons test&#233; sur un m&#234;me corpus italien trois syst&#232;mes &#224;
notre avis repr&#233;sentatifs des deux principales approches en traduction automatique : Its-2 &#8211; sur lequel nous
travaillons au LATL &#8211; bas&#233; sur un analyseur syntaxique profond ; Babelfish, &#233;labor&#233; par Systran et bas&#233;
lui aussi sur des r&#232;gles linguistiques ou expertes ; et Google Translate 2, bas&#233; sur une approche statistique.
</p>
<p>1. Remarquons cependant que dans les phrases &#224; l&#8217;imp&#233;ratif positif le clitique est enclitique en italien tout comme en
fran&#231;ais (Digli la verit&#224; ! &#8211; Dis-lui la v&#233;rit&#233; !). Dans les phrases &#224; l&#8217;imp&#233;ratif n&#233;gatif, par contre, l&#8217;italien accepte les deux
positions proclitique et enclitique alors que le fran&#231;ais ne garde que la proclise (Non lo vendere ! / Non venderlo ! &#8211; Ne le vends
pas !).
</p>
<p>2. En fran&#231;ais Google traduction (http://translate.google.fr/#).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LA TRADUCTION AUTOMATIQUE DES PRONOMS CLITIQUES
</p>
<p>2 Description des syst&#232;mes et du corpus
</p>
<p>En ce qui concerne Its-2, il s&#8217;agit d&#8217;un traducteur automatique bas&#233; sur une repr&#233;sentation des constituants
de la phrase ainsi que des relations entre pr&#233;dicats et arguments. La strat&#233;gie de traduction de Its-2 se
compose de trois phases principales : 1) l&#8217;analyse lexicale et syntaxique de la phrase source ; 2) le transfert
lexical et syntaxique ; et 3) la g&#233;n&#233;ration morphologique et syntaxique de la phrase cible. Dans la premi&#232;re
phase, l&#8217;identification de la nature des &#233;l&#233;ments lexicaux et grammaticaux de la langue source se fait &#224;
l&#8217;aide de l&#8217;analyseur syntaxique Fips (Wehrli &amp; Nerima, 2009), inspir&#233; des th&#233;ories g&#233;n&#233;rativistes chom-
skyennes, qui produit une structure arborescente de la phrase source. Apr&#232;s avoir rep&#233;r&#233; la t&#234;te lexicale
de la structure arborescente cr&#233;&#233;e par Fips, Its-2 interroge, dans la deuxi&#232;me phase, le lexique bilingue
pour trouver une correspondance de cette t&#234;te lexicale dans la langue cible. Sur la base de la correspon-
dance lexicale trouv&#233;e, ainsi que des informations syntaxiques contenues dans le lexique bilingue et dans
le lexique monolingue cible, Its-2 projette une nouvelle structure cible, en consid&#233;rant les autres &#233;l&#233;ments
de la phrase, &#224; savoir les &#233;ventuels sous-arbres gauche et droit. Finalement, lors de la troisi&#232;me phase, il
g&#233;n&#232;re la bonne forme morphologique de chaque mot cible en tenant compte des contraintes locales telles
que le nombre, le cas, le genre, la personne, le temps ou le mode. 3
</p>
<p>Pour ce qui est des deux autres syst&#232;mes qui font l&#8217;objet de notre &#233;valuation, il est n&#233;cessaire de sou-
ligner que, puisque il s&#8217;agit de deux syst&#232;mes commercialis&#233;s, les informations disponibles relatives &#224;
leurs strat&#233;gies de traduction sont tr&#232;s peu nombreuses. Le premier syst&#232;me, Babelfish &#8211; une version de
Systran (http://www.systran.fr) &#8211; fait partie des syst&#232;mes de traduction automatique &#224; trans-
fert qui b&#233;n&#233;ficient de r&#232;gles linguistiques. Malheureusement, les informations disponibles concernant
Systran ne contiennent pas de d&#233;tails sp&#233;cifiques concernant l&#8217;approche linguistique et les r&#232;gles que
le syst&#232;me utilise. Quelques informations d&#8217;ordre g&#233;n&#233;ral sont disponibles &#224; la page http://wwwv5.
systransoft.com/IDC/26459.html et dans Yang &amp; Lange (2003). Quant au deuxi&#232;me syst&#232;me,
Google Translate, il est bas&#233;e sur une m&#233;thode statistique : des milliards de mots provenant de corpus mo-
nolingues ou de corpus align&#233;s &#8211; cr&#233;&#233;s &#224; partir de traductions r&#233;alis&#233;es par des traducteurs professionnels
&#8211; sont introduits dans le syst&#232;me. Des techniques d&#8217;apprentissage statistique sont ensuite appliqu&#233;es pour
cr&#233;er le mod&#232;le de traduction. 4
</p>
<p>Le corpus utilis&#233; pour notre &#233;valuation ne compte que des phrases en italien, afin de tester la traduction de
l&#8217;italien vers le fran&#231;ais. Il a &#233;t&#233; r&#233;dig&#233; manuellement afin d&#8217;&#234;tre en mesure de contr&#244;ler certains aspects
sp&#233;cifiques (Lehmann &amp; Oepen, 1996), tels que la structure syntaxique, le cas du clitique et sa position
dans la phrase, afin d&#8217;&#233;viter l&#8217;interaction entre diff&#233;rents ph&#233;nom&#232;nes linguistiques, vu la complexit&#233; des
phrases contenues dans des corpus plus d&#233;velopp&#233;s. Nous avons donc pris en consid&#233;ration les structures
syntaxiques que nous avons pr&#233;sent&#233;es dans la section 1 : les structures transitives non r&#233;fl&#233;chies &#224; l&#8217;indi-
catif (4a) ; les phrases pr&#233;sentant un g&#233;rondif (4b) ; les structures infinitives subordonn&#233;es &#224; proclise (4c) ;
et les structures infinitives subordonn&#233;es &#224; enclise (4d). Plus pr&#233;cisement, notre corpus se compose de cinq
phrases pour chaque pronom clitique 5 et pour chaque structure syntaxique consid&#233;r&#233;s (TAB. 2) pour un
total de 295 phrases 6.
</p>
<p>3. Compte tenu de l&#8217;ampleur du sujet ici trait&#233; et de l&#8217;espace limit&#233; &#224; notre disposition, nous invitons le lecteur &#224; consulter
Russo &amp; Wehrli (2010) pour plus d&#8217;informations sur la strat&#233;gie de traduction de Its-2 et Leoni de L&#233;on &amp; Michou (2006) pour
une description d&#233;taill&#233;e du traitement automatique des pronoms clitiques dans Fips.
</p>
<p>4. Consulter &#224; ce propos http://www.google.com/intl/fr/help/faq_translation.html.
5. La complexit&#233; du ph&#233;nom&#232;ne trait&#233; nous a oblig&#233; d&#8217;exclure de notre corpus les combinaisons de clitiques (glielo / le lui),
</p>
<p>ainsi que les clitiques locatifs (ci / y), r&#233;flexifs (se / se) et partitifs (ne / en).
6. Comme indiqu&#233; en (TAB. 2), les structures infinitives &#224; proclise comptent cinq phrases en moins parce que le clitique</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LORENZA RUSSO
</p>
<p>(4) a. Gli invier&#242; una cartolina. b. Sono felice guardandoti ballare.
Je lui enverrai une carte postale. Je suis heureux en te regardant danser.
</p>
<p>c. Lo potete fare domani. d. Maria vuole fare loro un disegno.
Vous pouvez le faire demain. Maria veut leur faire un dessin.
</p>
<p>Structures Clitiques accusatifs Clitiques datifs Total
mi ti lo la ci vi li le mi ti gli le ci vi loro
</p>
<p>transitives 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 75
g&#233;rondives 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 75
inf. procl. 5 5 5 5 5 5 5 5 5 5 5 5 5 5 0 70
inf. encl. 5 5 5 5 5 5 5 5 5 5 5 5 5 5 5 75
Total 20 20 20 20 20 20 20 20 20 20 20 20 20 20 15 295
</p>
<p>TABLE 2 &#8211; Nombre de phrases pour chaque clitique et pour chaque structure syntaxique consid&#233;r&#233;s
</p>
<p>3 R&#233;sultats et discussion
</p>
<p>&#201;tant donn&#233; la taille et la nature du corpus test&#233;, les r&#233;sultats que nous pr&#233;sentons dans cette section
ne peuvent &#234;tre consid&#233;r&#233;s que comme exploratoires. De plus, les pourcentages de traductions correctes
donn&#233;s ici sont le r&#233;sultat d&#8217;une &#233;valuation manuelle, motiv&#233;e par la taille du corpus ainsi que par la
n&#233;cessit&#233; de nous concentrer sur la traduction du ph&#233;nom&#232;ne des pronoms clitiques et non pas sur la
traduction de la phrase dans sa totalit&#233;. Nous avons consid&#233;r&#233; une traduction comme correcte seulement
dans le cas o&#249; le clitique &#233;tait pr&#233;sent dans la phrase cible, g&#233;n&#233;r&#233; correctement dans son cas, genre et
nombre ainsi qu&#8217;attach&#233; &#224; son r&#233;el n&#339;ud d&#8217;attachement dans la langue cible. Comme le montre le tableau
ci-dessous (TAB. 3), Its-2 pr&#233;sente un pourcentage &#233;lev&#233; de traductions correctes, soit des traductions bien
meilleures que Babelfish et Google Translate, que cela soit pour les clitiques accusatifs ou datifs. Pour ce
qui est de Babelfish, la traduction des pronoms accusatifs pr&#233;sente un pourcentage plus &#233;lev&#233; que celle des
clitiques datifs. Quant &#224; Google Translate, il pr&#233;sente un faible taux de traductions correctes que cela soit
pour les clitiques accusatifs ou datifs.
</p>
<p>Clitiques accusatifs datifs
Its-2 99.37% 90.71%
Babelfish 81.87% 59.28%
Google Translate 17.5% 15.71%
</p>
<p>TABLE 3 &#8211; Pourcentage de traductions correctes des pronoms clitiques
</p>
<p>Si on examine les d&#233;tails des r&#233;sultats obtenus pour chaque clitique pris en consid&#233;ration (TAB. 4 et
TAB. 5), Its-2 pr&#233;sente un pourcentage &#233;lev&#233; de traductions correctes, avec toutefois un taux plus bas pour
les pronoms clitiques datifs gli (85%), le et vi (80%) (TAB. 5). De m&#234;me, Babelfish pr&#233;sente davantage de
probl&#232;mes pour la traduction des pronoms clitiques datifs le (40%) et loro (0%), ce dernier n&#8217;&#233;tant jamais
traduit (TAB. 5).
</p>
<p>En ce qui concerne Google Translate, il pr&#233;sente un pourcentage tr&#232;s faible de traductions correctes des
</p>
<p>loro (leur) n&#8217;est pas accept&#233; dans ce type de constructions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LA TRADUCTION AUTOMATIQUE DES PRONOMS CLITIQUES
</p>
<p>Clitiques accusatifs mi ti lo la ci vi li le
Its-2 100% 100% 100% 100% 100% 95% 100% 100%
Babelfish 95% 95% 80% 80% 80% 90% 70% 65%
Google Translate 20% 0% 40% 15% 25% 25% 10% 25%
</p>
<p>TABLE 4 &#8211; Pourcentage de traductions correctes pour chaque clitique accusatif
</p>
<p>pronoms clitiques accusatifs la (15%), li (10%) et ti (0%) (TAB. 4) ainsi que des pronoms clitiques datifs
mi et ci (10%), gli et le (5%), et ti (0%) 7 (TAB. 5).
</p>
<p>Clitiques datifs mi ti gli le ci vi loro
Its-2 100% 100% 85% 80% 100% 80% 100%
Babelfish 70% 75% 75% 40% 75% 80% 0%
Google Translate 10% 0% 5% 5% 10% 35% 50%
</p>
<p>TABLE 5 &#8211; Pourcentage de traductions correctes pour chaque clitique datif
</p>
<p>Ces pourcentages se r&#233;percutent aussi sur les r&#233;sultats consid&#233;r&#233;s du point de vue des structures syn-
taxiques prises en compte dans notre corpus (TAB. 6 et TAB. 7). En g&#233;n&#233;ral, les diverses structures ne
posent pas de probl&#232;mes &#224; Its-2 qui dans la plupart des cas propose une traduction correcte. Cependant,
un pourcentage relativement plus bas est atteint pour la traduction des clitiques datifs dans les phrases
avec un g&#233;rondif (88.57%) et dans les structures infinitives &#224; enclise (74.28%) (TAB. 7). Babelfish, quant
&#224; lui, pr&#233;sente des pourcentages g&#233;n&#233;ralement &#233;lev&#233;s pour la traduction des pronoms clitiques accusatifs
et datifs, &#224; l&#8217;exception des structures infinitives &#224; proclise, en particulier pour les clitiques datifs (8.57%)
(TAB. 7).
</p>
<p>Structures transitives g&#233;rondives inf. &#224; proclise inf. &#224; enclise
Its-2 100% 100% 100% 97.5%
Babelfish 90% 87.5% 62.5% 87.5%
Google Translate 25% 10% 15% 30%
</p>
<p>TABLE 6 &#8211; Pourcentage de traductions correctes des clitiques accusatifs pour chaque structure syntaxique
</p>
<p>En ce qui concerne les r&#233;sultats obtenus par Google Translate, ce syst&#232;me n&#8217;atteint jamais plus de 40%
de traductions correctes, que cela soit pour les pronoms clitiques accusatifs ou datifs. En particulier, le
pourcentage de traductions correctes ne d&#233;passe pas 10% pour les clitiques accusatifs dans les phrases
pr&#233;sentant un g&#233;rondif (TAB. 6) et descend &#224; 0% pour la traduction des pronoms clitiques dans les struc-
tures infinitives &#224; proclise (TAB. 7).
</p>
<p>Structures transitives g&#233;rondives inf. &#224; proclise inf. &#224; enclise
Its-2 100% 88.57% 100% 74.28%
Babelfish 77.14% 74.28% 8.57% 77.14%
Google Translate 40% 11.42% 0% 14.28%
</p>
<p>TABLE 7 &#8211; Pourcentage de traductions correctes des clitiques datifs pour chaque structure syntaxique
</p>
<p>7. La raison pour laquelle la traduction de ti (te) &#8211; accusatif et datif &#8211; est &#224; 0% est que Google Translate le traduit dans la
plupart des cas par la forme de politesse vous.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LORENZA RUSSO
</p>
<p>Pour revenir aux deux questions que nous nous sommes pos&#233;es au d&#233;but de notre travail, les r&#233;sultats pr&#233;-
sent&#233;s ici nous permettent d&#8217;affirmer qu&#8217;une diff&#233;rence dans l&#8217;approche en traduction automatique m&#232;ne
aussi &#224; une diff&#233;rence dans la qualit&#233; des traductions propos&#233;es. De plus, les pourcentages tr&#232;s &#233;lev&#233;s
atteints par Its-2, ainsi que ceux relativement &#233;lev&#233;s de Babelfish, nous m&#232;nent &#224; consid&#233;rer l&#8217;approche
linguistique comme plus fructueuse par rapport &#224; une approche statistique comme celle de Google Trans-
late, du moins pour le genre de corpus utilis&#233;, compos&#233; de phrases simples et courtes, et pour la paire de
langues choisie.
</p>
<p>4 Conclusion
</p>
<p>Dans cet article, nous avons abord&#233; la probl&#233;matique de la traduction automatique des pronoms clitiques de
l&#8217;italien vers le fran&#231;ais, et ce, en nous focalisant en particulier sur la traduction des pronoms clitiques dans
diff&#233;rentes structures syntaxiques et en examinant l&#8217;influence sur les r&#233;sultats de l&#8217;approche &#8211; linguistique
ou statistique &#8211; utilis&#233;e. Les r&#233;sultats ont montr&#233; une nette diff&#233;rence dans la qualit&#233; des traductions des
syst&#232;mes &#233;tudi&#233;s : en particulier, un traducteur automatique b&#233;n&#233;ficiant de r&#232;gles linguistiques atteint de
meilleurs taux de traductions correctes qu&#8217;un syst&#232;me &#224; base statistique. Si une telle conclusion, bas&#233;e
sur une &#233;tude exploratoire, est difficile &#224; g&#233;n&#233;raliser vu la taille du corpus utilis&#233; ainsi que la nature de
l&#8217;&#233;valuation men&#233;e, et se doit d&#8217;&#234;tre confirm&#233;e au moyen d&#8217;un corpus plus large, sur d&#8217;autres ph&#233;nom&#232;nes
linguistiques et sur d&#8217;autres paires de langues, elle montre n&#233;anmoins la validit&#233; du recours &#224; des r&#232;gles
linguistiques notamment pour la traduction de ph&#233;nom&#232;nes linguistiques tr&#232;s pointus et complexes comme
celui qui a fait l&#8217;objet de cette evaluation.
</p>
<p>R&#233;f&#233;rences
</p>
<p>KAYNE R. S. (1975). French Syntax. The Transformational Cycle. Cambridge : MIT Press.
</p>
<p>LEHMANN S. &amp; OEPEN S. (1996). &#8220;TSNLP-Test Suites for Natural Language Processing.&#8221; dans Pro-
ceedings of the 16th Conference on Computational linguistics, volume 2, p. 711 &#8211; 716, Copenhagen :
Association for Computational Linguistics.
</p>
<p>LEONI DE L&#201;ON J. A. &amp; MICHOU A. (2006). &#8220;Traitement des clitiques dans un environnement multi-
lingue.&#8221; dans P. MERTENS, C. FAIRON, A. DISTER &amp; P. WATRIN, Eds., Verbum ex machina : Actes de
la 13e conf&#233;rence sur le traitement automatique des langues naturelles (TALN 2006), Cahiers du Cental
2.1, p. 541&#8211;550, Louvain-la-Neuve, Belgique : UCL Presses Universitaires de Louvain.
</p>
<p>RUSSO L. &amp; WEHRLI &#201;. (2010). &#8220;Traduction automatique et aide terminologique : le traducteur de mots
en contexte TWiC et le traducteur de phrases Its-2.&#8221; dans C. VALLINI, A. DE MEO &amp; V. CARUSO, Eds.,
Traduttori e traduzioni, Naples : Liguori.
</p>
<p>WEHRLI &#201;. &amp; NERIMA L. (2009). &#8220;L&#8217;analyseur syntaxique Fips.&#8221; dans Actes of the 11th Internatio-
nal Conference on Parsing Technologies (IWPT &#8217;09), sponsored by ACL/SIGPARSE : Universit&#233; Paris
Diderot - Paris 7.
</p>
<p>YANG J. &amp; LANGE E. (2003). &#8220;Going live on the Internet.&#8221; dans Computers and Translation. A trans-
lator&#8217;s guide, p. 191&#8211;210. John Benjamins Publishing Company.</p>

</div></div>
</body></html>