<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction de paraphrases s&#233;mantiques et lexico-syntaxiques de corpus parall&#232;les bilingues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
 
</p>
<p>Extraction de paraphrases s&#233;mantiques et lexico-syntaxiques 
de corpus parall&#232;les bilingues 
</p>
<p>Jasmina Mili&#263;evi&#263; 
</p>
<p>French Department, Dalhousie University  
6135 University Avenue, Halifax (N.S.) CANADA B3H 4P9 
</p>
<p>jmilicev@dal.ca 
</p>
<p>R&#233;sum&#233;  
Nous pr&#233;sentons le travail en cours effectu&#233; dans le cadre d&#8217;un projet d&#8217;extraction de paraphrases &#224; partir 
de textes parall&#232;les bilingues. Nous identifions des paraphrases s&#233;mantiques et lexico-syntaxiques, qui 
mettent en jeu des op&#233;rations relativement complexes sur les structures s&#233;mantiques et syntaxiques de 
phrases, et les d&#233;crivons au moyen de r&#232;gles de paraphrasage de type Sens-Texte, utilisables dans diverses 
applications de TALN. 
</p>
<p>Abstract  
We present work in progress done within a project of extracting paraphrases from parallel bilingual texts. 
We identify semantic  and lexical-syntactic paraphrases, which imply relatively complex operations on 
semantic  and syntactic structures of sentences, and describe them by means of paraphrasing rules of 
Meaning-Text type, usable in various NLP applications. 
</p>
<p>Mots-cl&#233;s : paraphrase lexico-syntaxique, paraphrase s&#233;manique, r&#232;gles de paraphrasage, corpus 
bilingues, th&#233;orie Sens-Texte 
Keywords: lexical-syntactic paraphrase, semantic paraphrase, paraphrasing rules, bilingual corpora, 
Meaning-Text theory </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JASMINA MILI&#262;EVI&#262; 
</p>
<p>1 Probl&#233;matique et cadre th&#233;orique 
Cet article pr&#233;sente le travail en cours effectu&#233; dans le cadre d&#8217;un projet visant l&#8217;extraction de r&#232;gles de 
paraphrasage &#224; partir de textes parall&#232;les bilingues. Nous analysons des textes litt&#233;raires et journalistiques 
et leurs traductions : l&#8217;espagnol/le fran&#231;ais vers l&#8217;anglais et l&#8217;espagnol/l&#8217;anglais/le russe vers le fran&#231;ais. La 
taille totale du corpus analys&#233; est de 100 000 mots environ. Pour le moment, l&#8217;extraction de r&#232;gles se fait 
manuellement, mais nous pr&#233;voyons de recourir dans une phase ult&#233;rieure &#224; des techniques automatiques 
d&#8217;analyse du corpus, ainsi qu&#8217;&#224; l&#8217;&#233;largissement de ce dernier.  
</p>
<p>Le cadre th&#233;orique que nous adoptons est la th&#233;orie linguistique Sens-Texte (Mel&#8217;&#269;uk 1974, Kahane 2003), 
notamment son syst&#232;me de paraphrasage (&#381;olkovskij &amp; Mel&#8217;&#269;uk 1967, Mel&#8217;&#269;uk 1974 et 1992, Mili&#263;evi&#263; 
2007a/b), qui a &#233;t&#233; utilis&#233; dans diverses applications de TALN (voir, par exemple, Iordanskaja et al. 1991, 
Lavoie et al. 2000, Kittredge 2002 et Apresjan et al. 2003). 
</p>
<p>Notre d&#233;marche repose sur le postulat que la traduction est un cas particulier de paraphrasage &#8211; le 
paraphrasage INTERlinguistique &#8211; qui utilise essentiellement les m&#234;mes proc&#233;d&#233;s que le paraphrasage 
INTRAlinguistique, se laissant d&#233;crire par les m&#234;mes r&#232;gles1. Nous consid&#233;rons des paires {PhraseL-SOURCE, 
PhraseL-CIBLE} au sein d&#8217;un corpus bilingue comme des &#233;quivalents paraphrastiques potentiels, et c&#8217;est &#224; 
partir de telles paires que nous extrayons des r&#232;gles de paraphrasage ; c&#8217;est la m&#234;me approche que celle 
adopt&#233;e, par exemple, dans Dorr et al. (2004). Une m&#233;thode diff&#233;rente consiste &#224; extraire d&#8217;un corpus 
bilingue des paraphrases intralinguistiques en se servant d&#8217;une des langues comme du &#171; pivot &#187; pour 
l&#8217;extraction (c&#8217;est ce que font, entre autres, Bannard &amp; Callison-Burch 2005, Zhao et al. 2009)2 ou encore 
&#224; utiliser des traductions multiples d&#8217;un texte en tant que source de paraphrases intralinguistiques (comme, 
par exemple, Barzilay &amp; McKeown 2001).  
</p>
<p>Nous nous concentrons sur le rep&#233;rage et la description de liens paraphrastiques complexes, qui impliquent 
des modifications importantes soit de l&#8217;organisation lexicale et syntaxique de la phrase de d&#233;part soit du 
sens de cette derni&#232;re. (Ceci explique notre int&#233;r&#234;t pour la traduction litt&#233;raire, o&#249; les interventions de ce 
type devraient &#234;tre courantes.) De tels liens se d&#233;crivent dans notre approche au moyen de deux types 
majeurs de r&#232;gles. 
</p>
<p>&#8226; Les r&#232;gles de paraphrasage lexico-syntaxiques sp&#233;cifient des (quasi-)&#233;quivalences entre lexies 
consid&#233;r&#233;es au sein de constructions syntaxiques. Trois r&#232;gles de ce type, sous-jacentes aux paraphrases 
(1a-b), sont donn&#233;es en (1c). (Les r&#232;gles op&#232;rent entre fragments de structures syntaxiques, qui sont des 
arbres de d&#233;pendance. Oper1, A1 et A2 sont des noms de fonctions lexicales : le verbe support d&#8217;un type 
particulier, l&#8217;adjectif d&#233;verbatif actif  et l&#8217;adjectif d&#233;verbatif passif ; II et ATTR sont des noms de relations 
syntaxiques particuli&#232;res.) 
</p>
<p>(1) espagnol ~ anglais 
a. Igualmente asombran los Coranes que se exhiben, &#8230; 
</p>
<p> &#8216;&#201;galement &#233;tonnent les Corans qui s&#8217;exposent, &#8230;&#8217; 
b. Equally astonishing is a display of Korans, &#8230; 
</p>
<p> &#8216;&#201;galement &#233;tonnant est l&#8217;exposition de Corans, &#8230;&#8217; 
</p>
<p>                                                
1  Bien entendu, l&#8217;&#233;quivalence paraphrastique n&#8217;est pas la m&#234;me chose que l&#8217;&#233;quivalence de traduction : certaines &#233;quivalences 
</p>
<p>de traduction ne sont pas de paraphrases mutuelles et, dans un contexte particulier, certaines paraphrases peuvent ne pas &#234;tre 
des &#233;quivalents de traduction. Cependant, dans la plupart des cas, les deux types d&#8217;&#233;quivalence co&#239;ncident. 
</p>
<p>2  Grosso modo, on cherche dans la langueCIBLE tous les alignements avec une expression E (= le pivot) de la langueSOURCE, ses 
alignements &#233;tant consid&#233;r&#233;s comme des &#233;quivalents paraphrastiques intra-linguistiques potentiels. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE R&#200;GLES DE PARAPHRASAGE  
 
</p>
<p> c.  R&#232;gleLEX-SYNT-1 R&#232;gleLEX-SYNT-2 R&#232;gleLEX-SYNT-3 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>La R&#232;gleLEX-SYNT-1 (une substitution synonymique avec introduction d&#8217;un verbe support) rend compte du lien 
paraphrastique X &#233;tonneV [Y par Z(X)] &#8776; X estOper1 &#233;tonnantA1(V) [pour Y &#224; cause de X de Z] ; la R&#232;gleLEX-SYN-2 (la 
translation &#171; proposition relative ~ participe pass&#233; &#187;) permet de passer de CoransN quiN s&#8217;exposentVfin &#224; 
CoransN expos&#233;sVpar.pass&#233; ; finalement, la R&#232;gleLEX-SYN-3 (une inversion de subordination) fait le passage entre 
CoransY&#180; expos&#233;sA2(X) et expositionX de CoransY.  
</p>
<p>&#8226; Les r&#232;gles de paraphrasage s&#233;mantiques d&#233;crivent des (quasi-)&#233;quivalences entre configurations 
de s&#233;mant&#232;mes ; elles peuvent impliquer la d&#233;composition de sens lexicaux (n&#233;cessaire pour &#171; mettre &#224; 
nu &#187; l&#8217;&#233;quivalence entre expressions linguistiques), la neutralisation s&#233;mantique (&#171; extinction &#187; 
contextuelle de diff&#233;rences s&#233;mantiques entre expressions quasi-synonymes ou m&#234;me non-synonymes, 
voir, par exemple, Mili&#263;evi&#263; 2007a : 119sqq), certaines connaissances pragmatiques ou des inf&#233;rences 
logiques. Deux r&#232;gles s&#233;mantiques de paraphrasage et les paraphrases qu&#8217;elles relient suivent. (Les r&#232;gles 
sont pr&#233;sent&#233;es de fa&#231;on informelle ; en r&#233;alit&#233;, elles op&#232;rent entre fragments de r&#233;seaux s&#233;mantiques, 
comme on le verra &#224; la section suivante). 
</p>
<p>(2) russe ~ fran&#231;ais 
 a. Takix romanov nyn&#269;e net. 
</p>
<p> &#8216;De.tels romans aujourd&#8217;hui il.n&#8217;y.a.pas.&#8217; 
 b. O&#249; trouver &#224; pr&#233;sent un roman de telle esp&#232;ce ? 
 c. R&#232;gleS&#201;M-1: &#8216;les X n&#8217;existent plus&#8217; &#8776; &#8216;trouver une instance d&#8217;X est impossible&#8217;  
</p>
<p>La R&#232;gleS&#201;M-1 se base sur l&#8217;inf&#233;rence triviale (faisant partie de nos connaissances pragmatiques de tous les 
jours) &#8216;inexistant&#8217; &#8658; &#8216;introuvable&#8217;. Cette r&#232;gle est int&#233;ressante en ce qu&#8217;elle met en relation deux types 
d&#8217;actes de parole diff&#233;rents : la d&#233;claration et la question rh&#233;torique (en tant qu&#8217;une des r&#233;alisations 
possibles de la partie droite de la r&#232;gle). 
</p>
<p>(3) fran&#231;ais ~ anglais 
 a. Tout &#224; coup, une voix lointaine [qu&#8217;il entendit] [...] fit p&#226;lir le T&#233;trarque.  
</p>
<p> b. Suddenly he heard the sound of a distant voice [...]. His cheek paled.  
 &#8216;Soudainement, il entendit le son d&#8217;une voix lointaine [...]. Sa joue p&#226;lit. 
</p>
<p> c. R&#232;gleS&#201;M-2: &#8216;P cause#1 Q&#8217; &#8776; &#8216;P ; (par cons&#233;quent,) Q3&#8217; 
</p>
<p>La R&#232;gleS&#201;M-2 &#233;tablit la quasi-&#233;quivalence entre la causation exprim&#233;e explicitement, au sein d&#8217;une 
proposition simple, au moyen du verbe FAIRE, et la cons&#233;quence exprim&#233;e implicitement &#8211; par une 
coordination asynd&#233;tique (= sans conjonction) de deux propositions simples. (Il s&#8217;agit en fait d&#8217;un combin&#233; 
de deux r&#232;gles s&#233;mantiques de paraphrasage de nature diff&#233;rente ; voir la section 2.) 
</p>
<p>                                                
3  Le s&#233;mant&#232;me &#8216;causer#1&#8217; repr&#233;sente la causation non-agentive ; son actant s&#233;mantique 1 est la Cause. Il s&#8217;oppose au 
</p>
<p>s&#233;mant&#232;me &#8216;causer#2&#8217;, qui repr&#233;sente la causation agentive et a le Causateur comme son actant s&#233;mantique 1; voir Kahane  
&amp; Mel&#8217;&#269;uk (2006). 
</p>
<p> 
</p>
<p>Y 
</p>
<p>II 
</p>
<p>X 
</p>
<p>&#8801; 
A2(X) 
</p>
<p>ATTR 
</p>
<p>Y&#180; 
</p>
<p>&#8801; 
A1(V) 
</p>
<p>II 
</p>
<p>Oper1 
V 
</p>
<p>N 
</p>
<p> 
</p>
<p>&#8801; 
II 
Vfin 
</p>
<p>ATTR 
N 
</p>
<p>Vpart.pass&#233; 
</p>
<p>ATTR 
</p>
<p>N </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JASMINA MILI&#262;EVI&#262; 
Nous voulons surtout rep&#233;rer et d&#233;crire des r&#232;gles s&#233;mantiques de paraphrasage, qui sont beaucoup moins 
connues, mais nous sommes &#233;galement &#224; la recherche de nouvelles r&#232;gles lexico-syntaxiques.  
</p>
<p>Les paraphrases que peuvent prendre en charge les r&#232;gles de type Sens-Texte sont, de fa&#231;on g&#233;n&#233;rale, plus 
complexes que la plupart des paraphrases trait&#233;es &#224; date dans le cadre du TALN4. Sur les perspectives 
d&#8217;automatisation de nos r&#232;gles et leur utilisabilit&#233; dans le cadre du TALN, voir la Conclusion. 
</p>
<p>2 Quelques r&#232;gles de paraphrasage extraites manuellement de notre 
corpus 
</p>
<p>Dans l&#8217;ensemble de notre corpus, nous avons constat&#233; l&#8217;application assez fr&#233;quente de r&#232;gles de 
paraphrasage lexico-syntaxiques. Pour la plupart, il s&#8217;agit des r&#232;gles d&#233;j&#224; connues, ce qui n&#8217;est pas 
&#233;tonnant &#233;tant donn&#233; la large couverture du syst&#232;me de paraphrasage lexico-syntaxique existant (le nombre 
de nouvelles r&#232;gles de ce type &#233;tait autour d&#8217;une dizaine). Pour ce qui est des r&#232;gles s&#233;mantiques, dont la 
plupart sont nouvelles, leur application semble plus fr&#233;quente dans les textes parall&#232;les impliquant les 
langues typologiquement plus &#233;loign&#233;es &#8212; comme on pouvait s&#8217;y attendre. Cependant, le nombre total de 
nouvelles r&#232;gles s&#233;mantiques de paraphrasage (une vingtaine) est inf&#233;rieur &#224; nos attentes. Souvent, une 
paire de paraphrases met en jeu plusieurs r&#232;gles de paraphrasage, qui peuvent &#234;tre de types mixtes. 
</p>
<p>Nous pr&#233;sentons ci-dessous cinq nouvelles r&#232;gles de paraphrasage d&#233;gag&#233;es de notre corpus : quatre r&#232;gles 
s&#233;mantiques et une r&#232;gle lexico-syntaxique.  
</p>
<p>2.1 R&#232;gles s&#233;mantiques de paraphrasage 
La plupart des r&#232;gles s&#233;mantiques de paraphrasage trouv&#233;es jusqu&#8217;ici mettent en jeu ce qu&#8217;on peut appeler 
les &#171; concepts logiques refl&#233;t&#233;s en langue &#187; &#8211; la causation, la cons&#233;quence, la condition, l&#8217;hypoth&#232;se, etc. 
Bien des r&#232;gles concernent l&#8217;organisation discursive &#8211; &#171; d&#233;coupage &#187; du texte en propositions, liens 
communicatifs et rh&#233;toriques entre propositions &#8211; et peuvent s&#8217;appliquer au-del&#224; des fronti&#232;res d&#8217;une seule 
phrase (pour des r&#232;gles traitant de tels cas, voir, notamment, Danlos 2006) ; certaines mettent en jeu des 
connaissances pragmatiques ou des inf&#233;rences (comme la R&#232;gleS&#201;M-1, pr&#233;sent&#233;e &#224; la section 1). 
CAUSE ~ CONS&#201;QUENCE 
</p>
<p>(4) fran&#231;ais ~ russe 
 a. Mais la conversation s&#8217;animaQ gr&#226;ce au champagne [= gr&#226;ce &#224; l&#8217;apparitionP du champagne] et 
</p>
<p>bient&#244;t tout le monde y prit part. 
 b. No &#353;ampanskoe javilosP &#180;, razgovor o&#382;ivilsjaQ i vse prinjali v nem u&#269;astie. 
</p>
<p> &#8216;Mais le champagne apparut, la conversation s&#8217;anima et tous y prirent part.&#8217; 
</p>
<p>                                                
4 Dorr et al. (2004) d&#233;crit un projet d&#8217;extraction automatique de paraphrases mettant en jeu des liens paraphrastiques assez 
</p>
<p>complexes, comparables &#224; ceux que peuvent traiter nos r&#232;gles de paraphrasage s&#233;mantiques ; par exemple: &#171; clause 
subordination vs. anaphorically linked sentences &#187; (This is Joe&#8217;s new car, which he bought in NY. ~ This is Joe&#8217;s new car. 
He bought it in NY.), &#171; different sentence types &#187; (Who did this ? ~ Tell me who did this.), &#171; inverse relationship &#187; (Only 
20% of the participants arrived on time. ~ Most of the participants arrived late.) et &#171; inference &#187; (The tight end caugth the 
ball in the end zone. ~ The tight end scored a touchdown.). &#192; titre de comparaison, les liens les plus complexes mentionn&#233;s 
dans Zhao et al. (2009), qui est repr&#233;sentatif de ce que peuvent faire les approches statistiques, sont de l&#8217;ordre lexico-
syntaxique ; par exemple, &#171; phrase replacement &#187; (to take steps ~ to adopt measures) et &#171; structural paraphrase &#187; (the N&#8217;s 
residents ~ the inhabitants of N). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE R&#200;GLES DE PARAPHRASAGE  
 
Les phrases en (4) affichent le lien paraphrastique &#171; causation (explicite) ~ cons&#233;quence (implicite) &#187;,  
c&#8217;est donc le m&#234;me lien que celui unissant les paraphrases en (3) ci-dessus. Ces deux paires de paraphrases 
ne se distinguent que par la r&#233;alisation du s&#233;mant&#232;me de causation : en (4a) il est exprim&#233; au moyen de la 
pr&#233;position causale GR&#194;CE &#192; et en (3a) au moyen du verbe causatif FAIRE. Cela veut dire que la partie 
gauche de r&#232;gle cit&#233;e en (1c) a deux variantes (conditionn&#233;es par des facteurs communicatifs, voir ci-
dessous) &#8211; &#8216;P cause#1 Q&#8217; et &#8216;Q &#224; cause de P&#8217; &#8211; dont les r&#233;alisations sont des paraphrases 
mutuelles 5. Comparer la phrase (4a), qui r&#233;alise la variante &#8216;Q &#224; cause de P&#8217;, avec la phrase (4c), qui, elle, 
est une r&#233;alisation de la variante &#8216;P cause#1 Q&#8217; : 
</p>
<p> c. Mais le champagne [qui apparutP] anima [= &#8216;causa#1  s&#8217;animerQ&#8217;] la conversation et bient&#244;t tout 
le monde y prit part6. 
</p>
<p>Donnons, pour fixer les id&#233;es, les repr&#233;sentations s&#233;mantiques des phrases en (4) ; seuls les fragments 
pertinents pour le paraphrasage sont repr&#233;sent&#233;s.  
</p>
<p>La repr&#233;sentation s&#233;mantique [= RS&#233;m] d&#8217;une phrase est (grosso modo) un appariement de deux 
structures. La structure s&#233;mantique [= SS&#233;m], formellement un r&#233;seau s&#233;mantique, sp&#233;cifie les 
s&#233;mant&#232;mes sous-jacents &#224; la phrase et les relations &#171; pr&#233;dicat ~ argument &#187; entre eux. La structure 
s&#233;mantico-communicative [= SS&#233;mCom] &#171; tourne &#187; la SS&#233;m en un message sp&#233;cifique, en marquant des 
sous-r&#233;seaux de cette derni&#232;re par des valeurs d&#8217;oppositions communicatives (Mel&#8217;&#269;uk 2001), telles que 
th&#232;me ~ rh&#232;me ~ sp&#233;cificateur ; donn&#233; ~ nouveau,  focalis&#233; ~ neutre, etc.  
</p>
<p> 
 
 
 
 
 
 
 
 
</p>
<p>  
</p>
<p>RS&#233;m 1, phrase (4a) RS&#233;m 2, phrase (4c) RS&#233;m 3, phrase (4b) 
</p>
<p>Les s&#233;mant&#232;mes &#8216;P causer#1 Q (par W)&#8217; et &#8216;Q (&#234;tre la) cons&#233;quence (de) P&#8217; ont la distribution converse 
d&#8217;actants ; ils sont des conversifs approximatifs puisque &#8216;causer#1&#8217; a un actant de plus : l&#8217;actant W, qui est 
optionnel et repr&#233;sente l&#8217;&#233;laboration de la cause. 
</p>
<p>Le soulignement identifie le n&#339;ud communicativement dominant d&#8217;un sous-r&#233;seau (Mel&#8217;&#269;uk 2001 : 31), 
c&#8217;est-&#224;-dire le n&#339;ud qui porte l&#8217;essentiel de l&#8217;information contenue dans ce dernier. Un sous-r&#233;seau 
articul&#233; en th&#232;me et en rh&#232;me secondaires (T2, R2) correspond &#224; une proposition syntaxique (= une 
expression ayant comme t&#234;te un verbe fini).  
                                                
5  Il est &#233;galement possible d&#8217;avoir des variantes communicativement conditionn&#233;es pour la partie droite de la r&#232;gle en (1c), 
</p>
<p>par exemple, &#8216;Comme cons&#233;quence (de P), Q&#8217; ; cependant, nous ne les consid&#233;rerons pas, faute d&#8217;espace.  
6  En (4a) et (4c), on voit l&#8217;ellipse d&#8217;une partie de la proposition P, qui, en (4c), est accompagn&#233;e d&#8217;une inversion de 
</p>
<p>subordination : gr&#226;ce &#224; l&#8217;apparition [P] du champagne &#8658; gr&#226;ce au champagne ; le champagne qui apparut [P] &#8658; le 
champagne. On observe le m&#234;me ph&#233;nom&#232;ne en (3a). De tels effacements sont effectu&#233;s par des r&#232;gles sp&#233;ciales, que nous 
ne pr&#233;sentons pas ici. 
</p>
<p> 
</p>
<p>&#8216;conversation&#8217; 
</p>
<p>&#8216;...&#8217; 
</p>
<p>&#8216;s&#8217;animer&#8217; 
</p>
<p>&#8216;champagne&#8217; 
</p>
<p>Th&#232;me 
</p>
<p>2 
</p>
<p>1 
</p>
<p>1 &#8216;...&#8217; 
&#8216;...&#8217; 
</p>
<p>Rh&#232;me &#8216;causer#1&#8217; 
1 &#8216;appara&#238;tre&#8217; 2 
</p>
<p>2 1 &#8216;conversation&#8217; 
</p>
<p>&#8216;cons&#233;quence&#8217; 2 
&#8216;appara&#238;tre&#8217; 
</p>
<p>&#8216;...&#8217; 
</p>
<p>&#8216;s&#8217;animer&#8217; 
</p>
<p>&#8216;champagne&#8217; 
</p>
<p>1 Th&#232;me-1 
</p>
<p>2 
</p>
<p>1 1 
</p>
<p>1 
&#8216;...&#8217; 
</p>
<p>&#8216;...&#8217; 
</p>
<p>2 
</p>
<p>Rh&#232;me-1 
</p>
<p>Sp&#233;cificateur 
</p>
<p>R-2 R-2 
</p>
<p>T-2 
</p>
<p>T-2 
</p>
<p>&#8216;conversation&#8217; 
</p>
<p>&#8216;...&#8217; 
</p>
<p>&#8216;s&#8217;animer&#8217; 
</p>
<p>&#8216;champagne&#8217; 
</p>
<p>Rh&#232;me 
</p>
<p>2 
</p>
<p>1 
</p>
<p>1 &#8216;...&#8217; 
&#8216;...&#8217; 
</p>
<p>Th&#232;me &#8216;causer#1&#8217; 
1 &#8216;appara&#238;tre&#8217; 2 
</p>
<p>2 1 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JASMINA MILI&#262;EVI&#262; 
Le passage de la RS&#233;m 1/2 &#224; la RS&#233;m 3 implique les &#171; transformations &#187; de deux  types diff&#233;rents, 
mod&#233;lis&#233;es dans notre approche au moyen de r&#232;gles de deux types :  
</p>
<p>&#8226; Un remplacement de s&#233;mant&#232;mes (&#8216;cause&#8217; ~ &#8216;cons&#233;quence&#8217;), qui permet de passer des SS&#233;m 1/2 &#224; 
la SS&#233;m 3 (et vice-versa) ; il est effectu&#233; par une r&#232;gle de quasi-&#233;quivalence propositionnelle (cette r&#232;gle a 
&#233;t&#233; pr&#233;sent&#233;e pour la premi&#232;re fois dans Mili&#263;evi&#263; 2007a : 195). 
</p>
<p>&#8226; Deux restructurations communicatives, qui permettent de passer de la SS&#233;m-Comm 1 &#224; la SS&#233;m-
Comm 2, puis de celle-ci &#224; la SS&#233;m-Comm 3 ; elles sont prises en charge par deux r&#232;gles de quasi-
&#233;quivalence communicative. 
</p>
<p>R&#232;gle S&#201;M (Communicative)-3 
</p>
<p> 
 
 
</p>
<p>La situation changea#I.1az gr&#226;ce &#224;x son interventiony. &#8776; Son interventiony  
changea#I.1bx+z la situation [= causa#I que la situation change#I.1a].  
J&#8217;ai rat&#233;z la correspondance &#224; cause dux retardy du &lt;qu&#8217;a eu le&gt;  premier 
train. &#8776; Le retardy du &lt;qu&#8217;a eu le&gt; premier train m&#8217;a faitx raterz la 
correspondance. 
</p>
<p>La r&#232;gle ci-dessus &#233;tablit la quasi-&#233;quivalence entre les SS&#233;mComm des RS&#233;m 1 et 2, qui ont des 
distributions assez similaires du mat&#233;riau propositionnel entre les sous r&#233;seaux th&#233;matique et rh&#233;matique ; 
notamment, le n&#339;ud communicativement dominant du rh&#232;me est le m&#234;me dans les deux cas. Les deux 
r&#232;gles suivantes assurent ensemble le passage vers la RS&#233;m 3.  
</p>
<p>R&#232;gle S&#201;M (Propositionnelle)-4 
</p>
<p> 
</p>
<p> 
</p>
<p>R&#232;gle S&#201;M (Propositionnelle)-5 
</p>
<p> 
</p>
<p>Son interventiony [= le fait qu&#8217;il intervint] changea#I.1bX=Z la situation. &#8776;  
(a) Il intervinty et, par cons&#233;quentx, la situation changea#I.1az. 
(b) Il intervinty. La situation changea#I.1az.  
Le retardy du &lt;qu&#8217;a eu&gt; le premier train m&#8217;a faitx raterz la 
correspondance. &#8776;  
(a) Le premier train a eu du retardy si bien quex j&#8217;ai rat&#233;z la correspondance.  
(b) Le premier train a eu du retardy, j&#8217;ai rat&#233;z la correspondance.  
Son comportement y bizarre m&#8217;a irrit&#233; x+z &#8776;  
(a) Il s&#8217;est comport&#233;y de fa&#231;on bizare alorsx, j&#8217;ai &#233;t&#233; irrit&#233;z. 
(b) Il s&#8217;est comport&#233;y de fa&#231;on bizarre ; j&#8217;ai &#233;t&#233; irrit&#233;y. 
</p>
<p>Comme on peut le constater, nos r&#232;gles permettent &#224; la fois l&#8217;expression explicite et implicite de la 
cons&#233;quence : nous croyons que le choix entre les deux variantes doit se faire par une r&#232;gle stylistique 
assez g&#233;n&#233;rale, qui, en outre, prendrait en charge d&#8217;autres relations discursives admettant les deux types 
d&#8217;expression7. 
</p>
<p>Nos r&#232;gles de paraphrasage ne sp&#233;cifient pas non plus les r&#233;alisations de s&#233;mant&#232;mes ; celles-ci sont prises 
en charge par les r&#232;gles de lexicalisation, qui exploitent l&#8217;information consign&#233;e dans les articles de 
dictionnaires de lexies correspondantes. Par exemple, la r&#232;gle de lexicalisation du s&#233;mant&#232;me &#8216;Q est une 
cons&#233;quence de P&#8217; doit sp&#233;cifier, pour le cas de r&#233;alisation implicite de celui-ci, les informations suivantes. 
1) L&#8217;ordre lin&#233;aire : les propositions syntaxiques r&#233;alisant &#8216;P&#8217; et &#8216;Q&#8217; doivent toujours appara&#238;tre 
exactement dans cet ordre, car, en absence d&#8217;un marqueur explicite, c&#8217;est l&#8217;ordre lin&#233;aire (ensemble avec la 
prosodie particuli&#232;re) qui signale la relation de cons&#233;cution entre &#8216;P&#8217; et &#8216;Q&#8217;8 ; 2) Prosodie/ponctuation : &#224; 
                                                
7  Par exemple, l&#8217;explication : Il ne tol&#233;rait pas le d&#233;sob&#233;issance ; &lt;, car&gt; c&#8217;&#233;tait un monarque absolu ; la causation : Le d&#233;ficit 
</p>
<p>s&#8217;aggrave : &lt;parce que&gt; le Canada importe plus qu&#8217;il n&#8217;exporte ; etc. 
8  Comme on le sait, la cons&#233;quence/la causation entretient un lien &#233;troit avec la succession temporelle : la succession de deux 
</p>
<p>&#233;v&#233;nements dans le temps est souvent interpr&#233;t&#233;e comme la pr&#233;sence d&#8217;un lien causal entre eux, m&#234;me si, dans les faits, il 
</p>
<p>T 
</p>
<p>R &#8216;x&#8217; 
</p>
<p>&#8216;y&#8217; &#8216;z&#8217; T R 
</p>
<p>&#8216;x&#180;&#8217; 
</p>
<p>&#8216;y&#8217; &#8216;z&#8217; &#8801; 
 
</p>
<p>&#8216;causer#1&#8217; 
</p>
<p>&#8216;P&#8217; &#8216;Q&#8217; 
&#8801; 
 
</p>
<p>1 2 
&#8216;cons&#233;quence&#8217; 
</p>
<p>&#8216;P&#8217; &#8216;Q&#8217; 
2 1 
</p>
<p>T R 
</p>
<p>&#8216;x&#8217; 
</p>
<p>&#8216;y&#8217; &#8216;z&#8217; 
&#8801; 
 
</p>
<p>R 
</p>
<p>Sp&#233;c &#8216;x&#180;&#8217; 
</p>
<p>&#8216;y&#8217; &#8216;z&#8217; T </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE R&#200;GLES DE PARAPHRASAGE  
 
l&#8217;&#233;crit, les propositions r&#233;alisant &#8216;P&#8217; et &#8216;Q&#8217; peuvent &#234;tre s&#233;par&#233;s par une virgule, un point-virgule ou un 
point ; 3) Niveau de langue : la construction appartient au style narratif. 
</p>
<p>Par contre, une r&#232;gle de paraphrasage doit sp&#233;cifier, le cas &#233;ch&#233;ant, les conditions sous lesquelles la 
substitution qu&#8217;elle d&#233;crit est  possible. (Nous ne le faisons pas ici pour nos r&#232;gles.) 
CONDITION SUIFFISANTE ~ SUCCESSION TEMPORELLE 
</p>
<p>(5) anglais ~ fran&#231;ais 
 a. He made up his mindQ immediately after lookingP at the results. 
</p>
<p> &#8216;Il prit une d&#233;cision imm&#233;diatement apr&#232;s avoir jet&#233; un coup d&#8217;oeil sur les r&#233;sultats.&#8217; 
 b. Il lui suffit d&#8217;un simple coupP d&#8217;&#339;il sur les r&#233;sultats pour prendre une d&#233;cisionQ. 
</p>
<p>Les paraphrases en (5) affichent le lien entre la condition suffisante, que nous repr&#233;sentons par le 
s&#233;mant&#232;me &#8216;P suffit pour que Q ait lieu&#8217; et la succession temporelle, repr&#233;sent&#233;e par &#8216;Q suit P&#8217;9. La 
condition suffisante se r&#233;alise par la lexie SUFFIRE ou par l&#8217;expression n&#8217;avoir qu&#8217;&#224; V-er ; la succession, 
quant &#224; elle, s&#8217;exprime typiquement au moyen de la lexie APR&#200;S (ou ang. AFTER), comme en (5a), mais 
peut &#233;galement s&#8217;exprimer au moyen d&#8217;une conjonction, comme en (5c) :  
</p>
<p> c. Il jetaP un coup d&#8217;&#339;il sur les r&#233;sultats puis &lt;et ensuite&gt; il se d&#233;cidaQ. 
</p>
<p>Voici les RS&#233;m (simplifi&#233;es) des phrases en (5) :  
</p>
<p> 
 
 
 
 
 
</p>
<p> 
 
 
</p>
<p> 
 
 
</p>
<p>RS&#233;m 4, phrase (5b) RS&#233;m 5, phrase (5a) RS&#233;m 6, phrase (5c) 
La r&#232;gle de quasi-&#233;quivalence propositionnelle n&#233;cessaire pour relier ces repr&#233;sentations suit. 
</p>
<p>R&#232;gle S&#201;M(Propositionnelle)-6 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
 
</p>
<p>(1) &#8216;P&#8217; de &#8216;suffire&#8217; s&#8217;exprime comme &#171; de V-inf &#187; : Il suffit de franchir la latitude du 
tropique pour constater imm&#233;diatement les am&#233;liorations sensibles c&#244;t&#233; confort. &#8776; 
Apr&#232;s avoir franchi la latitude tropique, on constate imm&#233;diatement ... | Il me suffisait 
de cliquer sur &#171; relever &#187; pour qu&#8217;il continue. &#8776; Apr&#232;s que je cliquais sur &#171; relever &#187;, il 
continuait. 
(2) &#8216;P&#8217; de &#8216;suffire&#8217; s&#8217;exprime comme &#171; de N &#187; : Il lui suffit d&#8217;un simple examen clinique 
pour constater l&#8217;&#233;tat de d&#233;shydratation. &#8776; Apr&#232;s un simple examen clinique, il constata 
... | Il lui suffit de quelques heures de repos par nuit pour reprendre le souffle [...] &#8776; 
Apr&#232;s seulement quelques heures de repos par nuit, il reprend le souffle [...] 
</p>
<p>                                                                                                                                                                      
n&#8217;en est rien (cf. Nazarenko 2000: 45, o&#249; il est question de &#171; propension [des humains] &#224; l&#8217;interpr&#233;tation causale &#187;). Un lien 
cons&#233;cutif implicite risque d&#8217;autant plus &#224; &#234;tre confondu avec la succession temporelle. Ceci est cependant un probl&#232;me 
d&#8217;analyse et concerne peu une approche comme la n&#244;tre, orient&#233;e vers la synth&#232;se. Notons par ailleurs qu&#8217;une r&#232;gle de 
paraphrasage reliant la cons&#233;quence/la causation et la succession temporelle (mais pas vice versa !) est parfaitement 
possible ; elle rend compte du fait que les phrases suivantes sont toutes des paraphrases acceptables de la phrase (4b) : Le 
champagne apparut et (ensuite) la conversation s&#8217;anima. ~ Apr&#232;s l&#8217;apparition du champagne, la conversation s&#8217;anima.  
</p>
<p>9  Ce s&#233;mant&#232;me correspond &#224; l&#8217;acception I.B2 du vocable SUIVRE du Nouveu Petit Robert : venir, se produire apr&#232;s dans le 
temps. 
</p>
<p>&#8216;suivre&#8217; 
</p>
<p>&#8216;P&#8217; &#8216;Q&#8217; 
2 1 &#8773; 
</p>
<p> 
</p>
<p>&#8216;suffire&#8217; 
</p>
<p>&#8216;P&#8217; &#8216;Q&#8217; 
1 2 
</p>
<p>&#8216;suivre&#8217; 
</p>
<p> 
</p>
<p>&#8216;regarder&#8217; 2 1 &#8216;se.d&#233;- 
 cider&#8217; 
</p>
<p>&#8216;lui&#8217; 
</p>
<p>2 1 &#8216;r&#233;sultats&#8217; 1 
</p>
<p>Rh&#232;me 
</p>
<p>Th&#232;me 
</p>
<p>2 
</p>
<p>&#8216;&#8230;&#8217; 
</p>
<p>&#8216;suffire&#8217; 
</p>
<p> 
&#8216;regarder&#8217; 1 2 &#8216;se.d&#233;-     
</p>
<p>cider&#8217; 
</p>
<p>&#8216;lui&#8217; 
</p>
<p>2 1 &#8216;r&#233;sultats&#8217; 
</p>
<p>Rh&#232;me 
</p>
<p>Th&#232;me 
</p>
<p>1 2 
&#8216;&#8230;&#8217; 
</p>
<p>&#8216;suivre&#8217; 
</p>
<p> 
&#8216;regarder&#8217; 1 2 &#8216;se.d&#233;- 
</p>
<p> cider&#8217; 
</p>
<p>&#8216;lui&#8217; 
</p>
<p>2 1 &#8216;r&#233;sultats&#8217; 
</p>
<p>Sp&#233;cificateur 
</p>
<p>1 
</p>
<p>Th&#232;me 
Rh&#232;me 
</p>
<p>2 
</p>
<p>&#8216;&#8230;&#8217; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JASMINA MILI&#262;EVI&#262; 
Cette r&#232;gle doit s&#8217;appliquer en conjonction avec les r&#232;gles de quasi-&#233;quivalence communicative ci-
dessus : R&#232;gleS&#201;M(Communicative)-3 (appliqu&#233;e de droite &#224; gauche) pour passer de la RS&#233;m-4 &#224; la RS&#233;m-5 et la 
R&#232;gleS&#201;M(Communicative)-5 pour assurer le passage vers la RS&#233;m-6. Seules des r&#233;alisations avec apr&#232;s (&#224; partir 
d&#8217;appariements comme celui de la RS&#233;m-5) sont illustr&#233;es. 
</p>
<p>Notons que simple et imm&#233;diatement/seulement sont des ajouts stylistiques, qui renforcent, respectivement, 
l&#8217;id&#233;e de condition suffisante et de succession temporelle ; bien qu&#8217;ils soient tr&#232;s fr&#233;quemment utilis&#233;s (ce 
que d&#233;montre une recherche Google), ils peuvent &#234;tre omis et donc ne font pas partie de la r&#232;gle10. 
</p>
<p>Des paraphrases avec D&#200;S QUE sont possibles dans le cas (1) ci-dessus : D&#232;s que je cliquais sur &#171; relever &#187; 
il continuait ; dans le cas (2), on peut avoir des paraphrases mettant en jeu AVEC, MOYENNANT : Avec 
&lt;Moyennant&gt; un simple examen clinique, il constata ... 
</p>
<p>2.2 R&#232;gles lexico-syntaxiques de paraphrasage 
Toutes les nouvelles r&#232;gles lexico-syntaxiques d&#233;gag&#233;es jusqu&#8217;&#224; maintenant de notre corpus sont des 
r&#232;gles relativement mineures, d&#233;crivant des &#171; transformations &#187; bien sp&#233;cifiques. Ainsi, la r&#232;gle ci-dessous 
met en jeu une restructuration syntaxique locale, d&#233;clench&#233;e par des facteurs communicatifs ou 
rh&#233;toriques, avec peu de changements lexicaux. 
FAIRE N, EN V-ANT ~ FAIRE N, QUI V-E   
</p>
<p> (6) anglais ~ fran&#231;ais 
a. ... it maintainedV1-fin an unrelenting embargo against Iraq, causing V2-non.fin the deaths of civilians ...  
</p>
<p>&#8216; ... en causant la mort de civiles ...&#8217; 
b. ... ils ont maintenuV1-fin un embargo implacable contre l&#8217;Irak, qui tue V2-.fin des innocents ... 
</p>
<p>En (6a), le participe pr&#233;sent causing &#8216;causant&#8217; d&#233;pend du verbe maintain  (on le voit parce que le participe 
peut &#234;tre paraphras&#233; par thereby [= by doing so] causing ; de plus, dans la traduction fran&#231;aise, on a un 
g&#233;rondif, qui d&#233;pend n&#233;cessairement d&#8217;un verbe). Ce participe est rendu en (6b) par  une relative qualifiant 
le nom embargo, l&#8217;objet direct du verbe maintenir. Donc, on a ici deux op&#233;rations (prises en charge par 
une seule r&#232;gle) : 1) une translation &#171; participe pr&#233;sent ~ proposition relative &#187; et 2) un transfert du sous-
arbre de la relative vers le nouveau gouverneur nominal. 
</p>
<p>La substitution illustr&#233;e en (6) n&#8217;est possible que si V1-fin est un verbe support : L&#8217;arm&#233;e a lanc&#233; 
[IncepOper1(ATTAQUE)] contre la ville une attaque d&#8217;envergure, en la r&#233;duisant &lt;qui l&#8217;a r&#233;duite&gt; en 
ruine vs. L&#8217;arm&#233;e a regard&#233; les bras crois&#233;s l&#8217;attaque contre la ville, en la sacrifiant &lt;*qui l&#8217;a sacrifi&#233;e&gt; 
&#224; l&#8217;ennemi. En (6), maintenir = ContOper1 (EMBARGO). 
</p>
<p>L&#8217;ant&#233;position de la relative par rapport au verbe principal (le premier exemple ci-dessous) est possible 
mais contrainte par la structure communicative. La r&#233;p&#233;tition du nom est souhaitable, voire obligatoire, 
pour des raisons stylistiques, si la relative en est s&#233;par&#233;e par un constituant relativement lourd : L'arm&#233;e 
y&#233;m&#233;nite a lanc&#233;, jeudi 10 septembre 2009 &#224; l'aube, une attaque massive contre les rebelles chiites, dans 
le nord du Y&#233;men, attaque qui &#224; repouss&#233; l&#8217;ennemi vers l&#8217;int&#233;rieur du pays. 
                                                
10  Il y a ici l&#8217;interf&#233;rence avec une autre r&#232;gle de paraphrasage, sous-jacente aux paraphrases de type L&#8217;examen &#233;tait tr&#232;s 
</p>
<p>simple ~ J&#8217;ai fait l&#8217;examen en un clin d&#8217;&#339;il, qui se base sur l&#8217;implication pragmatique &#171; X est simple &#224; faire &#8658; X se fait 
rapidement &#187;. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION DE R&#200;GLES DE PARAPHRASAGE  
 
</p>
<p>R&#232;gleLEX-SYNT-4 
</p>
<p> 
 
 
 
 
 
</p>
<p>r = I (V1 est de type Func0) 
Une cyberattaque a frapp&#233; l&#8217;Internet mardi, en provoquant la panne de plusieurs 
serveurs &lt;Une cyberattaque, qui a provoqu&#233; la panne de plusieurs serveurs, a 
frapp&#233; l&#8217;Internet mardi&gt;. 
r = II (V1 est de type Oper1) 
Nous avons pris des mesures concr&#232;tes, en apportant &lt;qui apportent&gt; de 
premi&#232;res r&#233;ponses aux attentes que vous avez formul&#233;es. | L&#8217;occident a fini par 
imposer des sanctions, en freinant gravement &lt;qui ont gravement frein&#233;&gt; 
l'assistance humanitaire. 
</p>
<p>3 Conclusion 
Par la couverture des ph&#233;nom&#232;nes linguistiques, nos r&#232;gles de paraphrasage, en particulier nos r&#232;gles 
s&#233;mantiques, vont au-del&#224; de celles ordinairement prises en charge par les syst&#232;mes de TALN.  Il est donc 
l&#233;gitime de se demander &#224; quel point leur automatisation et int&#233;gration &#224; de tels syst&#232;mes est r&#233;aliste en ce 
moment. (Nous prenons pour acquis que c&#8217;est quelque chose de d&#233;sirable, voire n&#233;cessaire, pour tout 
syst&#232;me de production automatique de textes qui se veut performant.) N&#8217;&#233;tant pas sp&#233;cialiste de TALN, 
nous ne sommes pas en mesure de donner une r&#233;ponse pr&#233;cise &#224; cette question. Il s&#8217;agit certainement d&#8217;un 
d&#233;fi de taille, puisque les r&#232;gles de paraphrasage que nous envisageons pr&#233;supposent le recours &#224; des 
formalismes complexes &#8212; les repr&#233;sentations s&#233;mantiques, incluant l&#8217;information communicative, et les 
d&#233;finitions lexicographiques pouss&#233;es &#8212; formalismes qui ne sont pas compl&#232;tement ma&#238;tris&#233;s eux-m&#234;mes. 
Cependant, on a d&#233;j&#224; vu des impl&#233;mentations robustes du syst&#232;me de paraphrasage lexico-syntaxique 
(certaines ont &#233;t&#233; mentionn&#233;es au d&#233;but de l&#8217;article), lui aussi assez complexe. Il y a donc lieu de croire 
qu&#8217;on ne tardera pas &#224; voir des impl&#233;mentations des r&#232;gles de paraphrasage s&#233;mantiques. 
</p>
<p>Remerciements 
Un grand merci &#224; Igor Mel&#8217;&#269;uk pour ses commentaires judicieux. Mes remerciements vont &#233;galement &#224; 
mes assistantes de recherche, Alexandra Tsedryk et Stephanie Doyle. 
</p>
<p>R&#233;f&#233;rences 
APRESJAN, J., BOGUSLAVSKIJ, I., IOMDIN. L., LAZURSKIJ, A., SANNIKOV, V., SIZOV, V. &amp; TSINMAN. L. (2003). 
ETAP-3 Linguistics Processor : A Full-fledged NPL Implementation of the MTT. In: KAHANE, S. &amp; NASR, A., eds, Actes de 
la Premi&#232;re conf&#233;rence internationale sur la th&#233;orie Sens-Texte. Paris, &#201;cole Normale Sup&#233;rieure, juin 16-18 2003; 279-288. 
</p>
<p>BANNARD, C. &amp; CALLISON-BURCH, C. (2005). Paraphrasing with Bilingual Parallel Corpora. In: Proceedings of ACL 2005. 
Ann Arbor, 25-30 June 2005; 597-604. 
</p>
<p>BARZILAY, R. &amp; MCKEOWN, K. (2001). Extracting Paraphrases from a Parallel Corpus. In: Proceedings of ACL/EACL 2001. 
Toulouse, July 6-11 2001; 50-58.  
</p>
<p>DORR, B., DREEN, R., DEVIN, L., DAMBOW, O., DARWELL, D., HABASH, N., HELMREICH, S., HOVY, E., MILLER, K., 
MITAMURA, T., REEDER, F. &amp; SIDDHARTHAN, A. (2004). Semantic Annotation and Lexico-Syntactic Paraphrase. In: 
Proceedings of the Workshop on Building Lexical Resources from Semantically Annotated Corpora, LREC, Portugal.  
</p>
<p>DANLOS, L. (2006). Discourse Verbs and Discourse Periphrastic Links. In: Proceedings of Constraints in Discurse &#8216;06, 
Maynooth, Ireland. 
</p>
<p>&#8801; 
V2-non.fin 
</p>
<p>ATTR 
</p>
<p>V1-fin 
r N 
</p>
<p> 
V2-fin 
</p>
<p>ATTR 
</p>
<p>r N 
</p>
<p> 
</p>
<p>V1-fin 
</p>
<p>N 
</p>
<p> 
</p>
<p>I </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JASMINA MILI&#262;EVI&#262; 
KAHANE, S. (2003). The Meaning-Text Theory. In: AGEL, V., EICHINGER L.M., EROMS, H-W., HELLWIG, P., HERINGER 
H.J. &amp; LOBIN, H., eds. Dependency and Valency. An International Handbook of Contemporary Research, vol. 1. Berlin/New 
York: De Gruyter; 546-570. 
</p>
<p>KAHANE, S. &amp; MEL&#8217;&#268;UK, I. (2006). Les s&#233;mant&#232;mes de causation en fran&#231;ais. In: HAMON, S. &amp; AMY, M., eds. La cause : 
approche pluridisciplinaire. Linx 54 ; 247-292. 
</p>
<p>KITTREDGE, R. (2002). Paraphrasing for Condensation in Journal Abstracting. Journal of Biomedical Informatics 35: 4; 265-
277.  
IORDANSKAJA, L., KITTREDGE, R. &amp; POLGU&#200;RE, A. (1991). Lexical Selection and Paraphrase in a Meaning-Text 
Generation Model. In: PARIS, C. L., SWARTOUT, W. R. &amp; MANN, W. C., eds. Natural Language Generation in Artificial 
Intelligence and Computational Linguistics. Boston: Kluwer; 293-312. 
</p>
<p>LAVOIE, B., KITTREGDE, R., KORELSKY, T. &amp; RAMBOW, O. (2000). A Framework for Machine Translation and 
Multilingual NLG Systems Based on Uniform Lexico-Structural Processing. In: Proceedings of the 6th Conference on Applied 
Natural Language Processing. Seattle. 
</p>
<p>MEL&#8217;&#268;UK, I. (1974). Opyt teorii lingvisti&#269;eskix modelej Smysl &#8660; Tekst. Moskva: Nauka. 
</p>
<p>MEL&#8217;&#268;UK, I. (1992). Paraphrase et lexique: la th&#233;orie Sens-Texte et le Dictionnaire explicatif et combinatoire. In: MEL&#8217;&#268;UK, 
I. et al. (1984, 1988, 1992, 2000), Dictionnaire explicatif et combinatoire du fran&#231;ais contemporain. Recherches lexico-
s&#233;mantiques I-IV. Montr&#233;al: Presses de l&#8217;Universit&#233; de Montr&#233;al; 9-59. 
</p>
<p>MEL&#8217;&#268;UK, I. (2001). Communicative Organization in Natural Language. Amsterdam/Philadelphia : Benjamins.  
</p>
<p>MILI&#262;EVI&#262;, J. (2007a). La paraphrase. Mod&#233;lisation de la paraphrase langagi&#232;re. Bern: Peter Lang.  
</p>
<p>MILI&#262;EVI&#262;, J. (2007b). Semantic Equivalence Rules in Meaning-Text Paraphrasing. In: WANNER, L., ed., Selected Lexical 
and Grammatical Issues in Meaning-Text Theory. In Honour of Igor Mel&#8217;&#269;uk. Amsterdam/Philadelphia: Benjamins; 267-297. 
</p>
<p>NAZARENKO, A. (2000). La cause et son expression en fran&#231;ais. Paris : Ophrys. 
</p>
<p>ZHAO, SH., WANG, H. &amp; LIU, T. (2009). Extracting Paraphrase Patterns from Bilingual Parallel Corpora. Natural Language 
Engineering 15/4: 503-526. 
</p>
<p>&#381;OLKOVSKIJ, A. &amp; MEL&#8217;&#268;UK, I. (1967). O semanti&#269;eskom sinteze. Problemy kibernetiki 19: 177-238. [Traduction fran&#231;aise : 
Sur la synth&#232;se s&#233;mantique (1970). TA Informations 2: 1-85]. </p>

</div></div>
</body></html>