<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse d&#8217;opinion : annotation s&#233;mantique de textes chinois</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Analyse d&#8217;opinion : annotation s&#233;mantique de textes chinois
</p>
<p>Lei Zhang, St&#233;phane Ferrari
GREYC - D&#233;partement Informatique
</p>
<p>Universit&#233; de Caen - Campus 2, 14032 Caen
{prenom.nom}@unicaen.fr
</p>
<p>R&#233;sum&#233;. Notre travail concerne l&#8217;analyse automatique des &#233;nonc&#233;s d&#8217;opinion en chinois. En nous
inspirant de la th&#233;orie linguistique de l&#8217;Appraisal, nous proposons une m&#233;thode fond&#233;e sur l&#8217;usage de
lexiques et de r&#232;gles locales pour d&#233;terminer les caract&#233;ristiques telles que la Force (intensit&#233;), le Focus
(prototypicalit&#233;) et la polarit&#233; de tels &#233;nonc&#233;s. Nous pr&#233;sentons le mod&#232;le et sa mise en &#339;uvre sur un
corpus journalistique. Si pour la d&#233;tection d&#8217;&#233;nonc&#233;s d&#8217;opinion, la pr&#233;cision est bonne (94 %), le taux de
rappel (67 %) pose cependant des questions sur l&#8217;enrichissement des ressources actuelles.
</p>
<p>Abstract. Our work concerns automatic analysis of opinion in texts. Based on the Appraisal linguis-
tic theory, our method uses lexical and syntactic resources to process such properties as the Force, the
Focus and the polarity of an opinion. We present our model and its implementation on a journalistic cor-
pus. The precision for detecting opinion expressions is high (94%), but the recall (67%) raises the question
of how to enhance the resources.
</p>
<p>Mots-cl&#233;s : Analyse d&#8217;opinion, th&#233;orie de l&#8217;Appraisal.
</p>
<p>Keywords: Opinion analysis, Appraisal theory.
</p>
<p>1 Introduction
</p>
<p>L&#8217;essor d&#8217;Internet a vu cro&#238;tre le nombre de documents mis &#224; disposition du grand public. Depuis main-
tenant une dizaine d&#8217;ann&#233;es s&#8217;est d&#233;velopp&#233;e en parall&#232;le de ce ph&#233;nom&#232;ne la discipline commun&#233;ment
appel&#233;e &#171; fouille d&#8217;opinion &#187;, combinant des travaux en traitement automatique des langues et en fouille
de donn&#233;es. Notre travail s&#8217;inscrit dans cette mouvance. Il vise &#224; caract&#233;riser les &#233;nonc&#233;s d&#8217;opinion au sein
de textes journalistiques en chinois, &#224; en rep&#233;rer les sources et les cibles ainsi que des propri&#233;t&#233;s telles que
leur polarit&#233;, leur intensit&#233;, leur prototypicalit&#233;.1
</p>
<p>Apr&#232;s un bref &#233;tat de l&#8217;art, nous pr&#233;sentons notre approche qui s&#8217;articule sur une analyse syntaxique du
chinois et une adaptation de la th&#233;orie linguistique de l&#8217;Appraisal du langage de l&#8217;&#233;valuation en anglais
(section 2). Nous d&#233;crivons notre m&#233;thode puis sa mise en &#339;uvre informatique, en d&#233;taillant le corpus et
les ressources exploit&#233;es. Nous pr&#233;sentons les premiers r&#233;sultats obtenus, validant notre approche, et nous
concluons en proposant quelques perspectives de poursuite de nos travaux visant notamment &#224; traiter les
cas encore probl&#233;matiques et questionnant le probl&#232;me de l&#8217;enrichissement des ressources.
</p>
<p>1Ce travail a b&#233;n&#233;fici&#233; d&#8217;une aide de l&#8217;Agence Nationale de la Recherche portant la r&#233;f&#233;rence ANR-08-CORD-009 &#8211; projet
OntOpiTex.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LEI ZHANG, ST&#201;PHANE FERRARI
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Fouille d&#8217;opinion en TAL Les travaux en TAL concernant la fouille d&#8217;opinion peuvent &#234;tre class&#233;s som-
mairement en trois cat&#233;gories principales : (i) constitution de ressources, (ii) classification, de textes ou de
phrases, (iii) analyse des &#233;nonc&#233;s d&#8217;opinion au sein des textes. Nous renvoyons &#224; la monographie (Pang
&amp; Lee, 2008) pour un panorama de ces approches, et au num&#233;ro &#171; Fouille de Donn&#233;es d&#8217;Opinions &#187; de
RNTI2 pour des travaux r&#233;cents en fran&#231;ais.
Dans (Hatzivassiloglou &amp; McKeown, 1997), un des premiers travaux concernant la constitution de res-
sources, les auteurs s&#8217;attachent &#224; d&#233;terminer la polarit&#233; d&#8217;adjectifs (positive ou n&#233;gative). D&#8217;autres tra-
vaux cherchent &#224; d&#233;terminer le caract&#232;re subjectif (versus objectif) d&#8217;entr&#233;es lexicales, comme la m&#233;thode
propos&#233;e par (Baroni &amp; Vegnaduzzo, 2004). Plus r&#233;cemment, (Esuli &amp; Sebastiani, 2006) proposent une
adaptation de la ressource &#171; SENTIWORDNET &#187;, combinant ces deux propri&#233;t&#233;s (subjectivit&#233; et polarit&#233;,
positive ou n&#233;gative) pour les associer aux Synsets de WordNet. De mani&#232;re connexe, notons les travaux
de (Whitelaw et al., 2005) proposant une m&#233;thode d&#8217;apprentissage pour caract&#233;riser des expressions com-
plexes selon des propri&#233;t&#233;s de l&#8217;Appraisal. La classification de textes et de phrases op&#232;re en g&#233;n&#233;ral de la
m&#234;me mani&#232;re, c&#8217;est-&#224;-dire en terme de subjectivit&#233; ou de polarit&#233;, en exploitant souvent les ressources
pr&#233;c&#233;dentes, et en faisant appel &#224; des techniques de la fouille de donn&#233;es et de l&#8217;apprentissage. Les do-
maines applicatifs sont vari&#233;s : analyses de critiques de film dans (Turney, 2002) ; pour le fran&#231;ais, la
campagne DEFT07 (Grouin et al., 2009) concernait quatre domaines applicatifs distincts, critiques de
produits culturels, critiques de jeux vid&#233;o, relectures d&#8217;articles scientifiques et textes politiques. L&#8217;analyse
au sein des textes consiste &#224; pr&#233;ciser d&#8217;autres caract&#233;ristiques des &#233;nonc&#233;s d&#8217;opinion. Citons par exemple
(Hu &amp; Liu, 2004) qui &#233;tudient les critiques &#233;mises par des consommateurs sur les caract&#233;ristiques de divers
produits. En fran&#231;ais, (Ferrari et al., 2009) proposent une approche fond&#233;e sur une &#233;tude linguistique des
&#233;nonc&#233;s &#233;valuatifs.
</p>
<p>Notre &#233;tude se situe dans ce dernier axe, s&#8217;appuyant sur la th&#233;orie de l&#8217;Appraisal. &#192; notre connaissance,
c&#8217;est la premi&#232;re tentative d&#8217;adaptation de cette th&#233;orie pour le chinois. Les travaux en chinois concernent
surtout la classification de texte, rarement l&#8217;analyse d&#8217;opinion au sein des textes. Notons toutefois le travail
de (Wu &amp; Oard, 2007), d&#233;tectant la polarit&#233; de phrases dans des articles journalistiques.
</p>
<p>Th&#233;orie de l&#8217;Appraisal La th&#233;orie linguistique de l&#8217;Appraisal (Martin &amp; White, 2005), &#233;labor&#233;e pour
la langue anglaise, propose un syst&#232;me d&#233;crivant les propri&#233;t&#233;s des &#233;nonc&#233;s d&#8217;opinion selon diff&#233;rents
</p>
<p>FIG. 1 &#8211; Syst&#232;me de l&#8217;Appraisal.
</p>
<p>aspects : l&#8217;attitude, l&#8217;engagement et la graduation. La figure 1 en
pr&#233;sente les grandes lignes. L&#8217;attitude contient trois grandes cat&#233;-
gories : affect, appr&#233;ciation (plut&#244;t esth&#233;tique) et jugement (plu-
t&#244;t &#233;tique), ainsi que la notion de polarit&#233; qui se combine avec
les pr&#233;c&#233;dentes. L&#8217;engagement concerne les notions de prise en
charge &#233;nonciative, dialogisme, polyphonie, etc. La graduation
concerne la force, li&#233;e &#224; l&#8217;intensit&#233; de l&#8217;opinion &#233;mise, et le fo-
cus, li&#233; en quelque sorte &#224; la prototypicalit&#233; des termes employ&#233;s.
La graduation peut agir tant sur l&#8217;attitude (un jugement tr&#232;s n&#233;-
gatif) que sur l&#8217;engagement (une distanciation accentu&#233;e).
</p>
<p>2Revue des Nouvelles Technologies de l&#8217;Information, RNTI-E-17, C&#233;padu&#232;s &#201;ditions, 2009</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE D&#8217;OPINION : ANNOTATION S&#201;MANTIQUE DE TEXTES CHINOIS
</p>
<p>3 Mod&#232;le d&#8217;analyse des &#233;nonc&#233;s d&#8217;opinion
</p>
<p>Notre objectif est d&#8217;analyser les &#233;nonc&#233;s d&#8217;opinion afin d&#8217;en d&#233;terminer les caract&#233;ristiques suivantes :
polarit&#233;, force et focus, et, &#224; terme, la cible et le type d&#8217;attitude correspondant. Nous n&#8217;&#233;tudions pas &#224;
ce stade la notion d&#8217;engagement. Notre approche articule ressources lexicales et grammaires d&#8217;analyse
locale. Nous en pr&#233;sentons dans cette section les grandes lignes, puis d&#233;crivons sa mise en &#339;uvre et les
r&#233;sultats obtenus dans la section suivante.
Notre mod&#232;le s&#8217;appuie en premier lieu sur une analyse syntaxique locale, n&#233;cessaire pour &#233;tablir comment
les diff&#233;rents &#233;l&#233;ments du texte interviennent dans le calcul des valeurs des propri&#233;t&#233;s polarit&#233;, force et
focus. La suite de l&#8217;analyse consiste &#224; produire une fiche r&#233;capitulant les propri&#233;t&#233;s que nous pouvons cap-
ter pour chaque opinion exprim&#233;e, avec possiblement plusieurs fiches pour une m&#234;me phrase, concernant
&#233;ventuellement la m&#234;me cible (C&#8217;est un personnage plut&#244;t antipathique, mais vraiment tr&#232;s intelligent.
donnera ainsi lieu &#224; deux fiches, l&#8217;une pour antipathique, l&#8217;autre pour intelligent), avec ici les propri&#233;t&#233;s :
polarit&#233; n&#233;gative et force r&#233;duite (plut&#244;t + mais) pour antipathique ; polarit&#233; positive, force accrue (tr&#232;s)
et focus aviv&#233; (vraiment) pour intelligent.
</p>
<p>Opinion, lexiques et syntaxe L&#8217;ensemble de notre approche exploite des ressources lexicales pour indi-
quer, a minima, le caract&#232;re potentiellement axiologique des mots du texte. D&#232;s la premi&#232;re &#233;tape de notre
mod&#232;le, pour all&#233;ger l&#8217;analyse syntaxique, seules les phrases d&#8217;opinion sont &#233;tudi&#233;es, c&#8217;est-&#224;-dire celles
contenant au moins une entr&#233;e lexicale pr&#233;sente dans nos lexiques.
L&#8217;analyse syntaxique que nous proposons pour le chinois se fonde sur des r&#232;gles de composition de
groupes de mots et de propositions. Nous renvoyons &#224; (Zhang, 2010) pour plus de d&#233;tails sur cette &#233;tape.
La proposition y est choisie comme unit&#233; d&#8217;analyse, car nous pensons qu&#8217;elle constitue l&#8217;unit&#233; maximale
du syst&#232;me de la grammaire du chinois. Nous d&#233;crivons plus particuli&#232;rement des r&#232;gles de groupes de
mots par rapport aux cinq cat&#233;gories principalement impliqu&#233;es dans l&#8217;expression d&#8217;opinion (adjectifs,
noms, verbes, adverbes et expressions proverbiales lexicalis&#233;es. La grammaire qui en r&#233;sulte se compose
actuellement d&#8217;une soixantaine de r&#232;gles simples. Nous pr&#233;sentons dans la section suivante des exemples
de r&#233;sultats (figure 2) de l&#8217;analyseur obtenu.
</p>
<p>Par nature, certaines entr&#233;es lexicales sont directement li&#233;es &#224; un type d&#8217;attitude et une polarit&#233; (aimer - af-
fect positif, beau - appr&#233;ciation positive, opini&#226;tre - jugement n&#233;gatif). Les ressources lexicales exploit&#233;es
codent aussi ce type d&#8217;information pour les entr&#233;es potentiellement subjectives, avec des ambigu&#239;t&#233;s pos-
sibles pour certaines entr&#233;es, polys&#233;miques ou sous-sp&#233;cifi&#233;es. Enfin, les analyses de la polarit&#233;, de la force
et du focus font intervenir d&#8217;autres indices cod&#233;s eux aussi dans des ressources adapt&#233;es : modificateurs
d&#8217;intensit&#233; (tr&#232;s, extr&#234;mement), marqueurs de focus (vrai, v&#233;ritablement, sorte de), n&#233;gation, etc.
</p>
<p>Fiches d&#8217;opinion La seconde &#233;tape du traitement consiste &#224; &#233;tablir pour chaque &#233;nonc&#233; d&#8217;opinion une
fiche synth&#233;tisant ses propri&#233;t&#233;s. Chaque proposition contenant au moins un mot d&#8217;opinion donne lieu &#224; la
construction d&#8217;autant de fiches que n&#233;cessaire. Chaque fiche est construite &#224; partir de l&#8217;analyse syntaxique
de la proposition dans laquelle appara&#238;t le mot d&#8217;opinion qui a d&#233;clench&#233; sa cr&#233;ation.
Une fiche synth&#233;tise les informations suivantes : la cat&#233;gorie de l&#8217;attitude (opinion et &#233;motion), la polarit&#233;
(positive ou n&#233;gative), l&#8217;intensit&#233; (de 1 &#224; 4) et le focus (aviv&#233; ou att&#233;nu&#233;), ainsi que la cible pour certaines
configurations. L&#8217;ensemble de ces informations sont directement extraites de la structure syntaxique, &#224;
l&#8217;aide de r&#232;gles locales pour calculer la polarit&#233;, la force et le focus r&#233;sultant de la combinaison &#233;ventuelle
de plusieurs indices. Ainsi, dans la phrase &#171; &#187; (trad. Je [suis] extr&#234;mement content, citation</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LEI ZHANG, ST&#201;PHANE FERRARI
</p>
<p>extraite de notre corpus d&#8217;&#233;tude, Le Quotidien du Peuple, 1998), l&#8217;analyse syntaxique en SujetNP Pre-
dicatAP (Adv Adj) permet de d&#233;duire directement les propri&#233;t&#233;s cible : je (structure de la proposition),
intensit&#233; : 4 (maximum, adverbe et structure de la proposition), polarit&#233; : + et cat&#233;gorie : &#233;motion (Affect)
directement li&#233;es &#224; l&#8217;adjectif d&#8217;opinion content. Le focus reste neutre, inchang&#233; par le contexte.
La n&#233;gation est actuellement trait&#233;e de telle fa&#231;on qu&#8217;elle peut modifier la polarit&#233; ou la force :
</p>
<p>&#171; Ce g&#226;teau n&#8217;est pas bon &#187; &#8658; polarit&#233; invers&#233;e
&#171; Ce g&#226;teau n&#8217;est pas tr&#232;s bon &#187; &#8658; polarit&#233; invers&#233;e et force r&#233;duite
</p>
<p>4 Mise en &#339;uvre et r&#233;sultats
</p>
<p>(a) (b) (c)
</p>
<p>FIG. 2 &#8211; Propositions analys&#233;es.
</p>
<p>(a) (b) (c)
</p>
<p>FIG. 3 &#8211; Fiches produites correspondant aux propositions analys&#233;es.
</p>
<p>Corpus et lexiques Notre corpus d&#8217;&#233;tude est constitu&#233; d&#8217;un mois d&#8217;articles du journal chinois &#171; Le quo-
tidien du peuple &#187; (janvier 1998). Il a &#233;t&#233; annot&#233; manuellement par l&#8217;institut informatique et linguistique de
P&#233;kin.3 Les mots sont s&#233;par&#233;s et annot&#233;s par leur classe grammaticale selon la fonction syntaxique qu&#8217;ils
r&#233;alisent en contexte (un m&#234;me mot chinois peut &#234;tre verbe ou nom ou adjectif, c&#8217;est un emploi particulier
qui fixe la cat&#233;gorie). Nous avons segment&#233; le corpus en articles et adapt&#233; l&#8217;annotation au format XML4
</p>
<p>3http://icl.pku.edu.cn/
43 293 fichiers XML (13,8Mo)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE D&#8217;OPINION : ANNOTATION S&#201;MANTIQUE DE TEXTES CHINOIS
</p>
<p>pour pouvoir l&#8217;exploiter avec LinguaStream,5 une plateforme de TAL d&#233;velopp&#233;e par notre &#233;quipe.
Nous avons adapt&#233; les lexiques chinois propos&#233;s par HowNet6 pour l&#8217;analyse du sentiment (Zhang, 2010).
Il y a six lexiques initiaux contenant 9 193 mots chinois : opinion positive, opinion n&#233;gative, &#233;motion posi-
tive, &#233;motion n&#233;gative, intensit&#233; et assertion. Ils peuvent &#234;tre mis en correspondance avec une partie de la
th&#233;orie d&#8217;Appraisal : jugement et appr&#233;ciation r&#233;unis (opinion), affect (&#233;motion) et intensit&#233;. Nous y avons
adjoint un lexique pour la n&#233;gation et un lexique pour le focus, cr&#233;&#233;s par nos soins.
Les mots d&#8217;opinions s&#8217;inscrivent d&#8217;une fa&#231;on g&#233;n&#233;rale dans les 5 classes grammaticales suivantes : adjec-
tifs, noms, verbes, adverbes et expressions proverbiales. Un traitement particulier a &#233;t&#233; n&#233;cessaire pour
g&#233;rer le probl&#232;me de certains mots polycat&#233;goriels qui portent une opinion selon leur classe. Par exemple,
le m&#234;me mot chinois &#171; &#187; est &#224; la fois un nom (trad. &#171; s&#233;curit&#233; &#187;) qui ne porte pas d&#8217;opinion et un
adjectif (trad. &#171; en s&#233;curit&#233; &#187;) qui porte une opinion positive.
</p>
<p>Rep&#233;rage des &#233;nonc&#233;s &#233;valuatifs L&#8217;analyseur syntaxique n&#8217;est d&#233;clench&#233; que pour les phrases conte-
nant au moins un mot des lexiques Opinion ou &#201;motion. La proposition analys&#233;e est repr&#233;sent&#233;e sous la
forme d&#8217;un sch&#233;ma, qui contient les information suivantes : la structure de la proposition (sujet, pr&#233;dicat) ;
les relations de d&#233;pendance des groupes de mots ; les annotations s&#233;mantiques (polarit&#233;, intensit&#233;, etc.)
issues des lexiques. La figure 2 montre l&#8217;analyse de trois propositions. Elles se traduisent : (a) Ils sont les
plus accueillants ; (b) J&#8217;aime vraiment votre site ; (c) Le r&#233;sultat de SunWenLin n&#8217;est pas assez bon. La
figure 3 montre les trois fiches produites &#224; l&#8217;&#233;tape suivante.
</p>
<p>&#201;valuation Afin d&#8217;obtenir une premi&#232;re &#233;valuation de nos outils, nous avons extrait manuellement les
&#233;nonc&#233;s d&#8217;opinion dans 5 articles longs de notre corpus et les avons compar&#233;es avec les sorties de notre
analyseur. 138 &#233;nonc&#233;s ont &#233;t&#233; rep&#233;r&#233;s par nos soins, r&#233;partis dans 111 phrases. Notre analyseur a construit
98 fiches automatiquement, dont 92 correspondent &#224; des &#233;nonc&#233;s rep&#233;r&#233;s manuellement. Ceci correspond
&#224; un rappel de 66,7 % (92/138) et une pr&#233;cision de 93,9 % (92/98), soit une F-mesure harmonique de 78 %.
Il y a deux causes principales de silence : (i) le mot d&#8217;opinion n&#8217;est pas dans notre lexique ; (ii) silence
ou erreur de l&#8217;analyseur syntaxique &#8211; mot d&#8217;opinion marqu&#233; mais &#224; l&#8217;ext&#233;rieur des propositions trait&#233;es,
propositions mal d&#233;coup&#233;es (point-virgule, guillemets. . .). Pour synth&#233;tiser, la couverture du lexique et des
r&#232;gles reste limit&#233;e, la difficult&#233; actuelle &#233;tant de savoir quelle quantit&#233; de mots et de r&#232;gles ajouter pour
quel gain.
</p>
<p>Pour compl&#233;ter cette &#233;tude de la qualit&#233;, nous avons &#233;valu&#233; manuellement 282 fiches produites par notre
syst&#232;me pour en v&#233;rifier la polarit&#233; (&#233;chantillonnage sur plusieurs articles au hasard). Nous obtenons sur
ce point une pr&#233;cision 96,8 %. Les erreurs sont caus&#233;es surtout par deux probl&#232;mes : pas de contexte
pour juger la polarit&#233; d&#8217;une opinion (p.ex. la polarit&#233; du mot chinois &#171; &#187; (trad. &#171; fier &#187;) d&#233;pend de
son utilisation : positive dans &#171; &#234;tre fier de quelqu&#8217;un &#187; mais n&#233;gative dans &#171; faire le fier &#187;) et lexique
de n&#233;gation encore incomplet (nous ne traitons que les adverbes de n&#233;gation pour l&#8217;instant, mais il peut
&#233;galement y avoir d&#8217;autres tournures n&#233;gatives : manquer de, l&#8217;oppos&#233; de).
</p>
<p>5 Conclusion et perspective
</p>
<p>Nous avons pr&#233;sent&#233; une approche symbolique pour l&#8217;analyse de l&#8217;opinion dans des textes chinois. Fon-
d&#233;e sur l&#8217;usage de lexiques et de r&#232;gles d&#8217;analyse syntaxique locale, notre m&#233;thode vise &#224; renseigner les
</p>
<p>5http://www.linguastream.org
6HowNet Knowledge Database, http://www.keenage.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LEI ZHANG, ST&#201;PHANE FERRARI
</p>
<p>propri&#233;t&#233;s d&#8217;&#233;nonc&#233;s d&#8217;opinion en s&#8217;inspirant de la th&#233;orie de l&#8217;Appraisal. Certaines configurations syn-
taxiques simples permettent d&#233;j&#224; de mettre en &#339;uvre des calculs pour d&#233;terminer la polarit&#233;, la force, le
focus et la cible des opinions exprim&#233;es avec une bonne pr&#233;cision en ce qui concerne le caract&#232;re subjectif
(94 %) et la polarit&#233; (93 %) mais un taux de rappel global de seulement 67 %.
Les erreurs actuelles et les cas non trait&#233;s posent une question de fond. L&#8217;enrichissement tant du lexique
que des r&#232;gles peut difficilement se poursuivre manuellement, car un tel processus est co&#251;teux et devient
de moins en moins rentable. Il nous para&#238;t plus utile de mettre en place des proc&#233;d&#233;s de fouille auto-
matique pour compl&#233;ter nos ressources. C&#8217;est pourquoi nous envisageons d&#233;sormais ce type d&#8217;approche,
&#233;ventuellement de mani&#232;re supervis&#233;e. Nous allons notamment &#233;tudier l&#8217;adaptation de ces techniques pour
les propri&#233;t&#233;s qui nous int&#233;ressent (force, focus et aussi attitude), les travaux ant&#233;rieurs s&#8217;&#233;tant focalis&#233;s
sur celles de subjectivit&#233; et de polarit&#233;.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BARONI M. &amp; VEGNADUZZO S. (2004). Identifying subjective adjectives through web-based mutual
information. In KONVENS&#8217;04, 7th Konferenz zur Verarbeitung Nat&#252;rlicher Sprache, p. 613&#8211;619.
</p>
<p>ESULI A. &amp; SEBASTIANI F. (2006). Sentiwordnet: A publicly available lexical resource for opinion
mining. In LREC&#8217;06: 5th Conference on Language Resources and Evaluation, p. 417&#8211;422.
</p>
<p>FERRARI S., CHARNOIS T., MATHET Y., RIOULT F. &amp; LEGALLOIS D. (2009). Analyse de discours
&#233;valuatif, mod&#232;le linguistique et applications. RNTI, E-17, 71&#8211;93.
GROUIN C., HURAULT-PLANTET M., PAROUBEK P. &amp; BERTHELIN J. (2009). Deft&#8217;07 : une campagne
d&#8217;&#233;valuation en fouille d&#8217;opinion. RNTI, E-17, 1&#8211;24.
HATZIVASSILOGLOU V. &amp; MCKEOWN K. (1997). Predicting the semantic orientation of adjectives.
In Proceedings of the eighth conference on European chapter of the Association for Computational Lin-
guistics, p. 174&#8211;181, Morristown, NJ, USA: Association for Computational Linguistics.
</p>
<p>HU M. &amp; LIU B. (2004). Mining and summarizing customer reviews. In KDD &#8217;04: Proceedings of the
tenth ACM SIGKDD international conference on Knowledge discovery and data mining, p. 168&#8211;177.
</p>
<p>MARTIN J. &amp; WHITE P. (2005). The Language of Evaluation: Appraisal in English. Palgrave.
</p>
<p>PANG B. &amp; LEE L. (2008). Opinion mining and sentiment analysis. Found. Trends Inf. Retr., 2(1-2),
1&#8211;135.
</p>
<p>TURNEY P. (2002). Thumbs Up or Thumbs Down? Semantic Orientation Applied to Unsupervised
Classification of Reviews. In Proceedings of the 40th Annual Meeting of the ACL (ACL&#8217;02), p. 417&#8211;424:
Philadelphia, Pennsylvania, USA ACL.
</p>
<p>WHITELAW C., GARG N. &amp; ARGAMON S. (2005). Using appraisal groups for sentiment analysis. In
CIKM &#8217;05: 14th ACM international conference on Information and knowledge management, p. 625&#8211;631,
New York, NY, USA: ACM.
</p>
<p>WU Y. &amp; OARD D. (2007). Ntcir-6 at maryland: Chinese opinion analysis pilot taskdouglas w. oard. In
NTCIR-6 Workshop Meeting.
</p>
<p>ZHANG L. (2010). Analyse d&#8217;opinion : application &#224; un corpus journalistique en chinois. In CEDIL2010 :
Colloque international des Etudiants chercheurs en Didactique des Langues et en Linguistique: 29 juin
au 2 juillet 2010, Grenoble, France. &#192; para&#238;tre.</p>

</div></div>
</body></html>