<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un &#233;tiqueteur de r&#244;les grammaticaux libre pour le fran&#231;ais int&#233;gr&#233; &#224; Apache UIMA</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010 &#8211; Session Posters, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Un &#233;tiqueteur de r&#244;les grammaticaux libre pour le fran&#231;ais int&#233;gr&#233; &#224;
Apache UIMA
</p>
<p>Charles Dejean Manoel Fortun Clotilde Massot Vincent Pottier
Fabien Poulard1 Matthieu Vernier1
</p>
<p>(1) LINA, UMR6241, 44322 Nantes
{Fabien.Poulard, Matthieu.Vernier}@univ-nantes.fr
</p>
<p>R&#233;sum&#233;. L&#8217;&#233;tiquetage des r&#244;les grammaticaux est une t&#226;che de pr&#233;-traitement r&#233;currente. Pour le
fran&#231;ais, deux outils sont majoritairement utilis&#233;s : TreeTagger et Brill. Nous proposons une d&#233;marche,
ne n&#233;cessitant aucune ressource, pour la cr&#233;ation d&#8217;un mod&#232;le de Markov cach&#233; (HMM) pour palier les
probl&#232;mes de ces outils, et de licences notamment. Nous distribuons librement toutes les ressources li&#233;es
&#224; ce travail.
</p>
<p>Abstract. Part-of-speech tagging is a common preprocessing task. For the French language, Brill
and TreeTagger are the most often used tools. We propose a method, requiring no resource, to create a
Hidden Markov Model to get rid of the problems and licences of these tools. We freely distribute all the
resources related to this work.
</p>
<p>Mots-cl&#233;s : &#233;tiquetage grammatical, Mod&#232;le de Markov cach&#233;, UIMA, Brill, TreeTagger.
</p>
<p>Keywords: grammatical tagging, Hidden Markov Model, UIMA, Brill, TreeTagger.
</p>
<p>1 Introduction et besoins
</p>
<p>Dans les travaux en traitement automatique des langues, l&#8217;&#233;tiquetage des r&#244;les grammaticaux dans les
textes est une t&#226;che de pr&#233;-traitement r&#233;currente. Les r&#233;sultats de l&#8217;&#233;tiquetage servent de support &#224; des
t&#226;ches plus complexes ou de plus haut niveau linguistique : l&#8217;extraction terminologique, la recherche d&#8217;in-
formations, la recherche de patrons grammaticaux et s&#233;mantiques, la fouille d&#8217;opinions, la cat&#233;gorisation
de textes, la d&#233;tection de d&#233;rivation de textes, etc. Autrement dit, de l&#8217;efficacit&#233; et de la qualit&#233; de cette
&#233;tiquetage d&#233;pendent une majorit&#233; des probl&#232;mes applicatifs ou de recherche. D&#8217;une part, les erreurs de
r&#233;solution des r&#244;les grammaticaux sont r&#233;percut&#233;es sur les t&#226;ches suivantes. D&#8217;autre part, la performance
des outils d&#8217;&#233;tiquetage grammatical ont un impact non-n&#233;gligeable sur le temps de calcul global des traite-
ments. Des temps de calcul trop importants sont un frein au passage &#224; l&#8217;&#233;chelle des prototypes d&#233;velopp&#233;s
dans un cadre scientifique vers des outils industriels.
</p>
<p>Pour le traitement du fran&#231;ais, deux outils sont majoritairement utilis&#233;s : TreeTagger (Schmid, 1994) et
Brill (Brill, 1992). Les motivations qui expliquent notre int&#233;r&#234;t pour d&#233;velopper un nouvel &#233;tiqueteur de
r&#244;les grammaticaux pour le fran&#231;ais sont essentiellement de trois types :
&#8211; La licence de TreeTagger est restreinte au cadre de la recherche acad&#233;mique. La version UNIX de Brill
</p>
<p>est distribu&#233;e librement mais &#224; notre connaissance les ressources pour le fran&#231;ais ne sont pas distribu&#233;es</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN &#201;TIQUETEUR DE R&#212;LES GRAMMATICAUX LIBRE POUR LE FRAN&#199;AIS
</p>
<p>sous une licence permissive, le droit par d&#233;faut (restrictif) s&#8217;applique alors. Dans ce contexte, il est
donc difficile de promouvoir des prototypes d&#8217;applications scientifiques dans un contexte industriel
sans trouver une alternative et revoir alors son int&#233;gration avec le reste de l&#8217;application.
</p>
<p>&#8211; L&#8217;utilisation automatis&#233;e de Brill et TreeTagger dans une cha&#238;ne de composants est d&#8217;ailleurs un aspect
critique du point de vue de l&#8217;interop&#233;rabilit&#233;. Les formats d&#8217;entr&#233;e/sortie de ces outils leurs sont propres
et requi&#232;rent le d&#233;veloppement de composants d&#8217;encapsulation. Par ailleurs, quelques cas de bogues
(ou des temps de calcul tr&#232;s long) existent notamment pour les textes tr&#232;s volumineux, peu ponctu&#233;s ou
encod&#233;s de mani&#232;re non-homog&#232;ne dans le format attendu par l&#8217;outil.
</p>
<p>&#8211; Enfin, d&#8217;un point de vue scientifique, nous souhaitons observer la faisabilit&#233; de tirer profit des d&#233;ci-
sions diff&#233;rentes prises par Brill et TreeTagger pour am&#233;liorer la qualit&#233; des r&#233;sultats en confrontant
et en apprenant de leurs erreurs. Nous n&#8217;utilisons aucune nouvelle ressource pour cela, mais annotons
automatiquement un corpus &#224; l&#8217;aide de ces derniers.
</p>
<p>Dans cet article, nous pr&#233;sentons deux exp&#233;rimentations. Premi&#232;rement, la comparaison de divergences
des &#233;tiqueteurs Brill et TreeTagger afin de les &#233;valuer comparativement (cf. section 3.1). Deuxi&#232;mement,
l&#8217;apprentissage d&#8217;un mod&#232;le de Markov cach&#233; pour le fran&#231;ais permettant d&#8217;annoter les r&#244;les grammati-
caux via l&#8217;outil HmmTagger1, &#233;crit en langage Java et disponible sous la forme d&#8217;un composant Apache
UIMA2 (cf section 3.2).
</p>
<p>2 Brill et TreeTagger
</p>
<p>Brill (Brill, 1992) est un des syst&#232;mes d&#8217;annotation de r&#244;les grammaticaux les plus souvent cit&#233; dans les
travaux francophones. Brill a fait l&#8217;objet d&#8217;un entra&#238;nement sp&#233;cifique pour le fran&#231;ais (Lecomte &amp; Parou-
bek, 1998) &#224; partir d&#8217;un corpus de 417 370 mots d&#233;velopp&#233; &#224; cette occasion, et qui a les caract&#233;ristiques
suivantes : (i) il n&#8217;est pas distribuable, il contient des morceaux de texte dont les ayant droits ne permettent
pas la diffusion. (ii) Il est essentiellement compos&#233; de textes litt&#233;raires en fran&#231;ais (Balzac, Zola, Dumas,
Flaubert, etc.). (iii) Chacun des mots de ces textes a &#233;t&#233; &#233;tiquet&#233; manuellement selon le jeux d&#8217;&#233;tiquettes
choisi pour le fran&#231;ais. Brill utilise un lexique et des fichiers de r&#232;gles. Le lexique contient une liste de
mots, chacun d&#8217;eux est associ&#233; &#224; une liste d&#8217;&#233;tiquettes class&#233;es dans l&#8217;ordre d&#233;croissant de fr&#233;quences
d&#8217;apparitions dans le corpus annot&#233;. Les r&#232;gles permettent de d&#233;terminer une &#233;tiquette probable &#224; partir
du contexte quand un mot n&#8217;est pas dans le lexique (ex : DTN :sg PRV :sg NEXTTAG VCJ :sg).
</p>
<p>Le TreeTagger (Schmid, 1994) remplit la m&#234;me t&#226;che avec un jeu d&#8217;&#233;tiquettes l&#233;g&#232;rement diff&#233;rent. Il est
constitu&#233; de deux parties : l&#8217;une pour l&#8217;apprentissage d&#8217;une langue et l&#8217;autre pour l&#8217;annotation &#224; propre-
ment parl&#233;. Le syst&#232;me d&#8217;apprentissage requiert, pour une langue donn&#233;e, un lexique de formes fl&#233;chies,
un jeu d&#8217;&#233;tiquettes et un corpus d&#8217;entra&#238;nement. L&#8217;apprentissage effectu&#233; par TreeTagger consiste ensuite
&#224; &#233;valuer la probablit&#233; d&#8217;une transition entre un mot (ou sa cat&#233;gorie grammaticale) et un autre mot (ou
sa cat&#233;gorie grammaticale), puis &#224; g&#233;n&#233;rer un arbre de d&#233;cision binaire &#224; partir des probalit&#233;s calcul&#233;es.
Pour le fran&#231;ais, le jeu est compos&#233; de 33 &#233;tiquettes grammaticales3. La phase d&#8217;entra&#238;nement permet de
produire un lexique contenant la liste des possibilit&#233;s d&#8217;&#233;tiquetage pour chaque mot. Il se scinde en trois
parties : un lexique de formes fl&#233;chies, un lexique de suffixes, une entr&#233;e par d&#233;faut. Pour chaque mot,
le TreeTagger s&#233;lectionne d&#8217;abord l&#8217;&#233;tiquette la plus probable selon le lexique des formes fl&#233;chies (ou la
d&#233;duit &#224; partir du suffixe), puis il la corrige en mesurant la probabilit&#233; que l&#8217;&#233;tiquette c suive une s&#233;quence
de deux autres &#233;tiquettes ab.
</p>
<p>1http://uima.apache.org/downloads/sandbox/hmmTaggerUsersGuide/hmmTaggerUsersGuide.html
2http://uima.apache.org
3http://www.ims.uni-stuttgart.de/~schmid/french-tagset.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN &#201;TIQUETEUR DE R&#212;LES GRAMMATICAUX LIBRE POUR LE FRAN&#199;AIS
</p>
<p>Commun Treetagger Brill D&#233;finition
</p>
<p>ABR ABR ABR Abr&#233;viation
</p>
<p>ADJ ADJ Adjectif
ADJ ADJ :sg Adjectif (sauf Participe pass&#233;) au singulier
ADJ ADJ :pl Adjectif (sauf Participe Pass&#233;) au pluriel
</p>
<p>NUM NUM Num&#233;ral
NUM CAR Cardinal (en chiffres ou en lettres)
</p>
<p>TAB. 1 &#8211; Extrait des correspondances consid&#233;r&#233;es entre les jeux d&#8217;&#233;tiquettes de Brill et TreeTagger
</p>
<p>3 Exp&#233;rimentations
</p>
<p>La plateforme UIMA (Unstructured Information Management Architecture) constitue notre paillasse.
UIMA est un environnement de d&#233;veloppement d&#233;di&#233; &#224; la structuration de documents initi&#233; par IBM
et repris par la communaut&#233; Apache. Elle permet notamment, gr&#226;ce &#224; la norme UIMA approuv&#233;e par
l&#8217;OASIS, d&#8217;assurer l&#8217;&#233;change des donn&#233;es entre les composants d&#8217;une m&#234;me cha&#238;ne de traitement et leur
interop&#233;rabilit&#233;, de r&#233;-utiliser des composants existants et de construire des applications robustes com-
plexes destin&#233;es &#224; la recherche ou &#224; l&#8217;industrie.
</p>
<p>Dans la boite &#224; outils de UIMA, le composantHMMTagger4 impl&#233;mente un mod&#232;le de Markov cach&#233;
(HMM) qui permet d&#8217;annoter les r&#244;les grammaticaux d&#8217;un texte pr&#233;alablement d&#233;coup&#233; en mots. Le
HMMTagger n&#233;cessite pour cela un mod&#232;le de Markov cach&#233; pour la langue &#224; traiter. Il n&#8217;existe pas
de tel mod&#232;le pour le fran&#231;ais. Notre objectif est d&#8217;entra&#238;ner un mod&#232;le HMM pour le fran&#231;ais et de l&#8217;uti-
liser avec le composant HMMTagger de UIMA. Nous ne disposons d&#8217;aucune ressource (corpus annot&#233;,
lexique, r&#232;gles) en amont de ce travail. D&#232;s lors, la m&#233;thode envisag&#233;e consiste &#224; construire un corpus
annot&#233; sans le co&#251;t d&#8217;une annotation manuelle en (i) annotant un corpus automatiquement &#224; l&#8217;aide du
TreeTagger et de Brill (encapsul&#233;s dans UIMA par le LINA (Hernandez et al., 2010)) ; (ii) en regroupant
les jeux d&#8217;&#233;tiquettes de ces deux outils sous un jeu commun afin de les comparer. Nous profitons de cet
objectif principal pour comparer la qualit&#233; des annotations de TreeTagger par rapport &#224; Brill, et comparer
leurs performances d&#8217;un point de vue du temps d&#8217;ex&#233;cution.
</p>
<p>Donn&#233;es exp&#233;rimentales : un corpus et un jeu d&#8217;&#233;tiquettes commun Nous avons extrait des articles
dits de qualit&#233; sur Wikip&#233;dia dans des th&#233;matiques vari&#233;es (31 documents). Ceux-ci correspondent selon
Wikip&#233;dia &#224; un contenu riche et r&#233;dig&#233; dans un bon fran&#231;ais. Nous ajoutons &#224; ce corpus, des cours extraits
de la Wikiversity (10 documents), et quelques news de Wikinews (3 documents). Le corpus constitu&#233;
est compos&#233; de 496 886 mots, soit une taille similaire &#224; celle du corpus utilis&#233; pour l&#8217;entra&#238;nement de
Brill pour le fran&#231;ais. Ces textes ont &#233;galement l&#8217;avantage d&#8217;&#234;tre librement utilisables et distribuables sous
licence CC-by-sa 3.05 pour Wikiversity et Wikipedia et CC-by 2.56 pour Wikinews.
</p>
<p>Afin de permettre une &#233;valuation comparative de Brill et TreeTagger, nous alignons au pr&#233;alable leur jeu
</p>
<p>4http://uima.apache.org/downloads/sandbox/hmmTaggerUsersGuide/hmmTaggerUsersGuide.html
5http://creativecommons.org/licenses/by-sa/3.0/deed.fr
6http://creativecommons.org/licenses/by/2.5/deed.fr</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN &#201;TIQUETEUR DE R&#212;LES GRAMMATICAUX LIBRE POUR LE FRAN&#199;AIS
</p>
<p>Exp. A Exp. B
Nombre pr&#233;dictions &#233;valu&#233;es 4453 2805
</p>
<p>(0,89% corpus ; 3,17% incoh&#233;rences) (0,55% du total ; 3,57% incoh&#233;rences)
</p>
<p>Nombre total d&#8217;&#233;valuations 5486 4921
. . . dont erreur de Brill 961 (17,52 %) 739 (15,02 %)
. . . dont erreur de TTg(A)/HMM(B) 3145 (57,33 %) 3177 (64,56 %)
. . . dont erreur des deux 801 (14,60 %) 618 (12,56 %)
. . . dont erreur d&#251; &#224; la tokenisation 579 (10,55 %) 387 (7,86 %)
</p>
<p>&#201;valuations qui se recouvrent 887 460
Kappa 0,99 0,96
</p>
<p>TAB. 2 &#8211; Synth&#232;se des &#233;valuations comparatives entre Brill et TreeTagger (Exp. A) et Brill et HMMTagger
(Exp. B) sur le jeu d&#8217;&#233;tiquettes commun.
</p>
<p>d&#8217;&#233;tiquettes respectif pour &#233;tablir un socle commun. Le tableau 1 pr&#233;sente un extrait7 de cette table de
correspondances. Il n&#8217;y a pas de probl&#232;me d&#8217;ambigu&#239;t&#233;, il s&#8217;agit en g&#233;n&#233;ral de renommer des &#233;tiquettes ou
d&#8217;enlever un niveau de sp&#233;cificit&#233; propre &#224; TreeTagger ou Brill selon les cas (par exemple, contrairement
&#224; TreeTagger, Brill ajoute l&#8217;information du nombre sur un adjectif).
</p>
<p>3.1 Exp&#233;rience A : Comparaison de TreeTagger et Brill
</p>
<p>&#201;valuation des incoh&#233;rences entre Brill et TreeTagger Une fois la projection vers le jeu commun
r&#233;alis&#233;e, deux cas peuvent se pr&#233;senter pour un mot donn&#233;. Premi&#232;rement, les pr&#233;dictions de Brill et de
TreeTagger sont coh&#233;rentes : les deux &#233;tiquettes sont identiques. Ceci ne garantit pas la justesse de la
pr&#233;diction, mais montre que, pour le mot concern&#233;, les deux outils concordent et qu&#8217;ils sont corrects
ou bien en erreur tous les deux. Deuxi&#232;mement, les pr&#233;dictions des deux outils sont incoh&#233;rentes : les
&#233;tiquettes sont diff&#233;rentes. Dans cette configuration, il est n&#233;cessaire d&#8217;&#233;valuer manuellement. Sur les 496
886 mots extraits de notre corpus, les outils sont en d&#233;saccord sur 103 598 (env. 20,30 %) soit un peu
plus de 5 mots par phrase. Six annotateurs humains ont &#233;valu&#233; ces incoh&#233;rences, en connaissance du mot
dans son contexte et des &#233;tiquettes du jeu commun pos&#233;es par les deux outils. Ils pouvaient d&#233;cider si l&#8217;un
ou l&#8217;autre &#233;tait correct, si les deux avaient tort ou bien si l&#8217;erreur avait &#233;t&#233; provoqu&#233;e par le d&#233;coupage
en mots. Au total l&#8217;&#233;valuation manuelle des 4 453 mots, soit 3,17 % des incoh&#233;rences identifi&#233;es, a &#233;t&#233;
r&#233;partie entre les annotateurs. L&#8217;accord inter-annotateur est excellent : l&#8217;indice Kappa est de 0,99. Il a &#233;t&#233;
calcul&#233; sur 887 instances &#233;valu&#233;es commun&#233;ment par deux des six annotateurs (cf. Tableau 2).
</p>
<p>Comparaison des r&#233;sultats Habituellement, l&#8217;&#233;valuation d&#8217;un outil se fait en absolu : on &#233;value l&#8217;outil
sur l&#8217;ensemble de son fonctionnement afin d&#8217;obtenir un score estimant le nombre d&#8217;erreurs ou de succ&#232;s.
Dans le cas pr&#233;sent, nous voulons &#233;valuer les outils l&#8217;un par rapport &#224; l&#8217;autre, nous avons donc besoin d&#8217;une
m&#233;trique permettant de comparer les performances des deux outils sans conna&#238;tre leur nombre d&#8217;erreurs
sur l&#8217;int&#233;gralit&#233; du corpus. Tout d&#8217;abord nous supposons que les r&#233;sultats du Tableau 2 sont valables pour
toutes les incoh&#233;rences (140 400 sur les 496 886 mots du corpus). Ainsi, le taux d&#8217;erreur de Brill sur les
incoh&#233;rences serait de &#948;Brill = 17, 52%+14, 60%+10, 55% = 42, 67% (erreurs de Brill, erreurs des deux
</p>
<p>7Le tableau de correspondances complet est disponible dans les ressources distribu&#233;es</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN &#201;TIQUETEUR DE R&#212;LES GRAMMATICAUX LIBRE POUR LE FRAN&#199;AIS
</p>
<p>et erreurs d&#251; &#224; la tokenisation). Sur le reste du corpus, les pr&#233;dictions &#233;tant coh&#233;rentes, le taux d&#8217;erreur de
Brill et de TreeTagger est identique et &#233;gal &#224; &#945;. Le taux d&#8217;erreur de Brill sur le corpus complet est donc,
avec Cc et Ci respectivement le nombre d&#8217;&#233;l&#233;ments coh&#233;rents et incoh&#233;rents, &#8710;Brill =
</p>
<p>(&#945;&#8727;Cc)+(&#948;Brill&#8727;Ci)
Cc+Ci
</p>
<p>,
</p>
<p>de mani&#232;re similaire &#8710;TTg =
(&#945;&#8727;Cc)+(&#948;TTg&#8727;Ci)
</p>
<p>Cc+Ci
, soit encore &#8710;TTg
</p>
<p>&#8710;Brill
=
</p>
<p>(&#945;&#8727;Cc)+(&#948;TTg&#8727;Ci)
(&#945;&#8727;Cc)+(&#948;Brill&#8727;Ci) . Or 0 &#8804; &#945; &#8804; 100,
</p>
<p>donc &#8710;TTg = &#946;&#8710;Brill avec 1.13 &#8804; &#946; &#8804; 1.93. En d&#8217;autres termes, le taux d&#8217;erreur de TreeTagger est entre
1,13 fois et 1,93 fois plus &#233;lev&#233; que celui de Brill. Ce r&#233;sultat est notamment pertinent pour l&#8217;&#233;valuation
des performances du HMMTagger (cf. section 3.2).
</p>
<p>Fusion plus fine des &#233;tiquettes vers le jeu commun &#192; partir des &#233;valuations manuelles des incoh&#233;-
rences, nous avons repris la m&#233;thode d&#8217;annotation automatique du corpus : lorsque Brill et TreeTagger
s&#8217;accordent sur une &#233;tiquette nous la retenons, lorsqu&#8217;ils sont en d&#233;saccord nous appliquons des r&#232;gles
ad-hoc issues de l&#8217;&#233;valuation manuelle. Cette fusion plus fine nous a permis de r&#233;duire le nombre d&#8217;inco-
h&#233;rences de pr&#232;s de 25 %, passant ainsi de 103 598 &#224; 78 578.
</p>
<p>Les r&#232;gles de r&#233;solution sont issues de r&#232;gles d&#8217;associations8 extraites de l&#8217;ensemble des &#233;valuations ma-
nuelles. Chaque mot dont l&#8217;&#233;tiquette a pu &#234;tre corrig&#233;e lors de l&#8217;&#233;valuation a &#233;t&#233; caract&#233;ris&#233; par les &#233;ti-
quettes du jeu commun pos&#233;es par Brill et TreeTagger, leurs &#233;tiquettes propres et le mot lui-m&#234;me (p. ex.
TagOrigBrill=ECJ :sg TagOrigTTG=VER :pres &#8594; TagRetenu=VER :ET). Nous n&#8217;avons conserv&#233; que
les r&#232;gles dont la confiance est de 1.0 afin de limiter l&#8217;introduction d&#8217;erreurs. Sur la soixantaine de r&#232;gles
extraites, nous en avons impl&#233;ment&#233; 11, les autres r&#232;gles subsumant les premi&#232;res.
</p>
<p>3.2 Exp&#233;rience B : &#201;valuation comparative du mod&#232;le HMM fran&#231;ais avec Brill
</p>
<p>&#192; des fins d&#8217;exp&#233;rimentations, nous scindons notre corpus en deux (90 %/10 %) : un corpus d&#8217;apprentis-
sage, et un corpus de test pour l&#8217;&#233;valuation comparative de Brill et HMMTagger.
</p>
<p>Apprentissage du mod&#232;le HMM pour le fran&#231;ais Il est &#224; noter que 15 % des mots ne sont pas &#233;tiquet&#233;s
lorsque Brill et TreeTagger ne sont pas d&#8217;accord et qu&#8217;aucune r&#232;gle de fusion pertinente n&#8217;a pu &#234;tre mise en
oeuvre. Nous avons choisi de ne pas adopter de strat&#233;gie par d&#233;faut de type dans le doute, faire confiance
&#224; Brill, pour ne pas biaiser notre approche. Le module d&#8217;apprentissage du HMMTagger utilise ensuite les
mots &#233;tiquet&#233;s apr&#232;s fusion (mot + &#233;tiquette) pour g&#233;n&#233;rer un mod&#232;le HMM.
</p>
<p>Tests et &#233;valuation &#192; l&#8217;image de l&#8217;exp&#233;rimentation A (cf. section 3.1), nous effectuons une &#233;valuation
comparative entre le HMMTagger d&#233;velopp&#233; et Brill, que nous consid&#233;rons alors comme une meilleure
r&#233;f&#233;rence que TreeTagger. Nous appliquons sur les r&#233;sultats pr&#233;sent&#233;s dans le Tableau 2 la m&#233;trique dis-
cut&#233;e pr&#233;c&#233;demment. Ainsi, le taux d&#8217;erreur du HMMTagger (&#8710;HMM
</p>
<p>&#8710;Brill
) est entre 1,03 fois et 2,4 fois plus
</p>
<p>&#233;lev&#233; que celui de Brill.
</p>
<p>4 Discussion
</p>
<p>Les r&#233;sultats de l&#8217;&#233;valuation comparative entre Brill et TreeTagger puis entre Brill et le HMMTagger sont
dans la m&#234;me fourchette (respectivement [1, 13..1, 93] et [1, 03..2, 4]). Brill est donc meilleur que les deux
</p>
<p>8Les r&#232;gles d&#8217;association ont &#233;t&#233; calcul&#233;es dans Weka &#224; l&#8217;aide de l&#8217;algorithme weka.associations.Apriori</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN &#201;TIQUETEUR DE R&#212;LES GRAMMATICAUX LIBRE POUR LE FRAN&#199;AIS
</p>
<p>Outil Treetagger Brill HMMTagger
</p>
<p>Temps de traitement sur notre corpus 5 min 42 s. 6 min 51 s. 11 s.
</p>
<p>TAB. 3 &#8211; Performance des composants Brill, TreeTagger et HMMTagger sur l&#8217;annotation du corpus test.
</p>
<p>autres outils, le HMMTagger faisant potentiellement un peu plus d&#8217;erreurs que le TreeTagger. Le choix
de ne pas apprendre les annotations incoh&#233;rentes a priv&#233; le HMMTagger de la connaissance de mots
fr&#233;quents pour lesquels il se r&#233;signe &#224; un choix par d&#233;faut (p. ex. la pr&#233;position &#224;, les flexions du verbe
avoir, . . .). L&#8217;impl&#233;mentation de r&#232;gles manuelles pour ces quelques cas devrait permettre d&#8217;am&#233;liorer
significativement les r&#233;sultats.
</p>
<p>Les outils TreeTagger et Brill utilis&#233;s dans ces exp&#233;rimentations sont des encapsulations en composants
UIMA des programmes originaux (Hernandez et al., 2010). De telles encapsulations posent des probl&#232;mes
d&#8217;interop&#233;rabilit&#233; (les programmes de Brill et TreeTagger ne sont pas pr&#233;sents sur toutes les plateformes),
et de performances (chargement des ressources et des programmes en m&#233;moire &#224; chaque traitement). Au
contraire le HMMTagger, nativement impl&#233;ment&#233; en Java et int&#233;gr&#233; &#224; UIMA, est de 29 &#224; 35 fois plus
rapide que les outils encapsul&#233;s (cf. Tableau 3).
</p>
<p>D&#8217;apr&#232;s Karl Popper (Popper, 1963), &#171; une th&#233;orie n&#8217;est scientifique si et seulement si elle peut &#234;tre r&#233;fu-
t&#233;e &#187;. Cette r&#233;futabilit&#233; n&#8217;est possible qu&#8217;en r&#233;it&#233;rant les exp&#233;rimentations. Dans ce sens, nous attachons
une importance particuli&#232;re &#224; distribuer librement nos ressources (le mod&#232;le, le code source et le corpus
permettant de le g&#233;n&#233;rer, ainsi que les r&#233;sultats interm&#233;diaires de nos exp&#233;rimentations)9Nous encoura-
geons d&#8217;ailleurs la g&#233;n&#233;ralisation de cette d&#233;marche dans le cadre des travaux scientifiques en traitement
automatique des langues.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BRILL E. (1992). A simple rule-based part of speech tagger. In Proceedings of the third conference on
Applied natural language processing, p. 152&#8211;155, Morristown, NJ, USA : Association for Computational
Linguistics.
</p>
<p>HERNANDEZ N., POULARD F., VERNIER M. &amp; ROCHETEAU J. (2010). New challenges for nlp fra-
meworks. In Proceedings of New Challenges for NLP Frameworks workshop in LREC&#8217;10, Marrakech,
Morocco : European Language Resources Association (ELRA).
</p>
<p>LECOMTE J. &amp; PAROUBEK P. (1998). Le cat&#233;goriseur d&#8217;Eric BRILL. mise en oeuvre de la version
entra&#238;n&#233;e &#224; l&#8217;INALF, rapport technique. Nancy.
</p>
<p>POPPER K. (1963). Conjectures and Refutations.
</p>
<p>SCHMID H. (1994). Probabilistic part-of-speech tagging using decision trees. In Proceedings of the
International Conference on New Methods in Language Processing, p. 44&#8211;49.
</p>
<p>9Tous ces &#233;l&#233;ments sont archiv&#233;s &#224; l&#8217;adresse http://recherche.fabienpoulard.info/taln2010. Le com-
posant HMMTagger pour UIMA est disponible &#224; l&#8217;adresse http://uima.apache.org/sandbox.html#tagger.
annotator, il suffit de le configurer pour utiliser notre mod&#232;le hmmtagger_model_fr_20100501.dat pr&#233;sent dans l&#8217;archive.</p>

</div></div>
</body></html>