<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>TransSearch : un moteur de recherche de traductions</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>TransSearch : un moteur de recherche de traductions
</p>
<p>Julien Bourdaillet Fabrizio Gotti St&#233;phane Huet
Philippe Langlais Guy Lapalme
</p>
<p>RALI - DIRO - Universit&#233; de Montr&#233;al
C.P. 6128, succursale centre-ville
</p>
<p>H3C 3J7, Montr&#233;al, Qu&#233;bec, Canada
{bourdaij,gottif,huetstep,felipe,lapalme}@iro.umontreal.ca
</p>
<p>R&#233;sum&#233;. Malgr&#233; les nombreuses &#233;tudes visant &#224; am&#233;liorer la traduction automatique, la traduction
assist&#233;e par ordinateur reste la solution pr&#233;f&#233;r&#233;e des traducteurs lorsqu&#8217;une sortie de qualit&#233; est recher-
ch&#233;e. Cette d&#233;monstration vise &#224; pr&#233;senter le moteur de recherche de traductions TransSearch. Cette
application commerciale, accessible sur le Web, repose d&#8217;une part sur l&#8217;exploitation d&#8217;un bitexte align&#233; au
niveau des phrases, et d&#8217;autre part sur des mod&#232;les statistiques d&#8217;alignement de mots.
</p>
<p>Abstract. Despite the impressive amount of studies devoted to improving the state of the art of
machine translation, computer assisted translation tools remain the preferred solution of human transla-
tors when publication quality is of concern. This demonstration presents the translation search engine
TransSearch. This web-based commercial application relies on a sentence-aligned bitext and a statis-
tical word alignment techniques.
</p>
<p>Mots-cl&#233;s : Traduction automatique statistique, rep&#233;rage de traductions, alignement de mots, re-
qu&#234;tes linguistiques.
</p>
<p>Keywords: Statistical machine translation, translation spotting, word alignment, linguistic queries.
</p>
<p>1 Introduction
</p>
<p>L&#8217;application TransSearch d&#233;velopp&#233;e au RALI et commercialis&#233;e par la soci&#233;t&#233; Terminotix1 offre &#224;
ses utilisateurs une m&#233;moire de traduction interrogeable &#224; travers le Web. De tels outils sont tr&#232;s popu-
laires dans la communaut&#233; des traducteurs professionnels et dans le domaine de la traduction assist&#233;e par
ordinateur (Macklovitch et al., 2008). Dans l&#8217;application actuellement commercialis&#233;e, lorsqu&#8217;un utilisa-
teur soumet une requ&#234;te l&#8217;application r&#233;pond en affichant l&#8217;ensemble des paires de phrases source-cible
qui contiennent la requ&#234;te. Il appartient alors &#224; l&#8217;utilisateur de fouiller dans ce mat&#233;riel afin d&#8217;identifier la
meilleure r&#233;ponse correspondant &#224; son besoin traductionnel. Nous avons d&#233;velopp&#233; au RALI une nouvelle
version de cette application qui tire profit de techniques d&#8217;alignement statistique de mots &#224; l&#8217;&#233;tat de l&#8217;art
(Huet et al., 2009; Bourdaillet et al., 2010). Cette version transforme TransSearch en un moteur de re-
</p>
<p>1www.terminotix.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN BOURDAILLET, FABRIZIO GOTTI, ST&#201;PHANE HUET, PHILIPPE LANGLAIS &amp; GUY LAPALME
</p>
<p>FIG. 1 &#8211; Interface utilisateur du moteur de recherche de traductions TransSearch suite &#224; la soumission
de la requ&#234;te subject to. Les 87 traductions rep&#233;r&#233;es s&#8217;affichent dans la colonne de gauche.
</p>
<p>cherche de traductions, offrant ainsi &#224; ses usagers de nouvelles perspectives d&#8217;utilisation. Nous pr&#233;sentons
ici cette application novatrice qui sera tr&#232;s prochainement commercialis&#233;e.
</p>
<p>2 Des mots aux requ&#234;tes
</p>
<p>La figure 1 pr&#233;sente une capture d&#8217;&#233;cran du nouveau TransSearch. Dans cet exemple, un utilisateur a
soumis la requ&#234;te subject to au syst&#232;me. Celui-ci r&#233;pond alors par une distribution des traductions de
la requ&#234;te (&#224; gauche) automatiquement identifi&#233;es par le syst&#232;me. Dans cet exemple, 87 traductions dif-
f&#233;rentes sont rep&#233;r&#233;es dans les textes des d&#233;bats parlementaires canadiens (Hansards). Chaque traduction
est accompagn&#233;e de sa fr&#233;quence d&#8217;association &#224; la requ&#234;te.
</p>
<p>&#192; l&#8217;instar du premier syst&#232;me, le nouveau TransSearch fait &#233;galement office de concordancier bilingue.
Pour chacune des traductions d&#8217;une requ&#234;te, il est en effet possible d&#8217;acc&#233;der &#224; l&#8217;ensemble de ses occur-
rences en corpus. Ainsi dans l&#8217;exemple de la figure 1, l&#8217;application montre &#224; l&#8217;utilisateur les 232 contextes
dans lesquels la traduction identifi&#233;e assujettis &#224; appara&#238;t. L&#8217;utilisateur peut bien s&#251;r s&#233;lectionner une
autre traduction afin d&#8217;en examiner les diff&#233;rents contextes d&#8217;occurrence.
</p>
<p>Il convient de souligner que la distribution des traductions retourn&#233;e par le nouveau syst&#232;me modifie</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TRANSSEARCH : UN MOTEUR DE RECHERCHE DE TRADUCTIONS
</p>
<p>FIG. 2 &#8211; R&#233;ponse de TransSearch &#224; la requ&#234;te raise .. awereness. L&#8217;ellipse indiqu&#233;e par
.. permet de rep&#233;rer des occurrences telles que raise our awareness ou raise the public&#8217;s
awareness.
</p>
<p>profond&#233;ment la nature m&#234;me de l&#8217;application. L&#8217;utilisateur peut de mani&#232;re tr&#232;s synth&#233;tique observer les
fr&#233;quences d&#8217;usage de toutes les traductions identifi&#233;es, ce qui n&#233;cessitait un effort manuel (tr&#232;s) co&#251;teux
dans la version actuellement commercialis&#233;e.
</p>
<p>L&#8217;exemple subject tomontre que le syst&#232;me est capable de r&#233;pondre &#224; des requ&#234;tes comptant plusieurs
mots. L&#8217;application est donc plus puissante qu&#8217;un simple dictionnaire bilingue o&#249; les entr&#233;es sont consti-
tu&#233;es uniquement de mots simples.2 Il est &#233;galement possible de soumettre au syst&#232;me des requ&#234;tes plus
&#233;volu&#233;es, qui autorisent la recherche d&#8217;expressions non n&#233;cessairement contigu&#235;s. Par exemple, la figure 2
pr&#233;sente la r&#233;ponse du syst&#232;me apr&#232;s la soumission de la requ&#234;te raise .. awareness. En s&#233;parant
les mots &#224; rechercher par le symbole .., l&#8217;utilisateur sp&#233;cifie au syst&#232;me que, lors de la recherche, les
occurrences des 2 mots de la requ&#234;te peuvent &#234;tre distantes d&#8217;au plus 5 mots au sein d&#8217;une m&#234;me phrase.
Un autre op&#233;rateur permettant des recherches sur une distance non limit&#233;e est &#233;galement disponible.
</p>
<p>D&#8217;un point de vue linguistique, ces op&#233;rateurs sont tr&#232;s int&#233;ressants puisqu&#8217;ils permettent &#224; l&#8217;utilisateur de
rep&#233;rer des expressions dont les mots pourraient &#234;tre s&#233;par&#233;s par des mots &#233;crans, par exemple their dans
l&#8217;occurrence raise their awareness. Enfin, un autre type de requ&#234;te &#233;volu&#233;e est accessible &#224; l&#8217;utili-
sateur de TransSearch : les requ&#234;tes avec expansion morphologique. La figure 3 pr&#233;sente la r&#233;ponse du
</p>
<p>2Dans certains dictionnaires bilingues, on trouve des expressions de plusieurs mots, mais celles-ci ne sont g&#233;n&#233;ralement pas
des entr&#233;es principales, mais uniquement des exemples d&#8217;usage.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN BOURDAILLET, FABRIZIO GOTTI, ST&#201;PHANE HUET, PHILIPPE LANGLAIS &amp; GUY LAPALME
</p>
<p>FIG. 3 &#8211; R&#233;ponse de TransSearch &#224; la requ&#234;te abroger+..loi+. L&#8217;op&#233;rateur + permet de rep&#233;rer les
d&#233;rivations morphologiques des mots qu&#8217;il qualifie, &#233;tendant ainsi la port&#233;e des recherches effectu&#233;es.
</p>
<p>syst&#232;me &#224; la requ&#234;te abroger+ .. loi+. Pour les termes auxquels est ajout&#233; le symbole +, le syst&#232;me
va consid&#233;rer l&#8217;ensemble de leurs d&#233;rivations morphologiques existantes dans la langue du terme. Ainsi,
&#224; cette requ&#234;te utilisateur correspondent toutes les expressions contenant une forme fl&#233;chie de abroger,
suivie d&#8217;une forme fl&#233;chie de loi. Cet op&#233;rateur sp&#233;cifiquement linguistique est particuli&#232;rement utile
pour des langues riches morphologiquement comme le fran&#231;ais ou l&#8217;espagnol, et permet &#224; l&#8217;utilisateur de
rep&#233;rer des expressions sans &#233;gard &#224; leur possibles flexions.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOURDAILLET J., HUET S., LANGLAIS P. &amp; LAPALME G. (2010). TransSearch : from a bilingual
concordancer to a translation finder. &#192; para&#238;tre dans Machine Translation.
</p>
<p>HUET S., BOURDAILLET J. &amp; LANGLAIS P. (2009). Int&#233;gration de l&#8217;alignement de mots dans le concor-
dancier bilingue TransSearch. In 16e Conf&#233;rence sur le Traitement Automatique des Langues Naturelles
(TALN), Senlis, Picardie, France.
</p>
<p>MACKLOVITCH E., LAPALME G. &amp; GOTTI F. (2008). TransSearch : What are translators looking for ?
In 18th Conference of the Association for Machine Translation in the Americas (AMTA), p. 412&#8211;419,
Waikiki, Hawai&#8217;i, &#201;tats-Unis d&#8217;Am&#233;rique.</p>

</div></div>
</body></html>