<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une &#233;tude des questions &#8220;complexes&#8221; en question-r&#233;ponse</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010 &#8211; Session Posters, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Une &#233;tude des questions &#8220;complexes&#8221; en question-r&#233;ponse
</p>
<p>V&#233;ronique Moriceau1, 2 Xavier Tannier1, 2 Mathieu Falco1
</p>
<p>(1) LIMSI-CNRS, B.P. 133, 91403 ORSAY, FRANCE
(2) Universit&#233; Paris-Sud 11, 91405 ORSAY
</p>
<p>prenom.nom@limsi.fr
</p>
<p>R&#233;sum&#233;. La plupart des syst&#232;mes de question-r&#233;ponse ont &#233;t&#233; con&#231;us pour r&#233;pondre &#224; des questions
dites &#8220;factuelles&#8221; (r&#233;ponses pr&#233;cises comme des dates, des lieux), et peu se sont int&#233;ress&#233;s au traitement
des questions complexes. Cet article pr&#233;sente une typologie des questions en y incluant les questions
complexes, ainsi qu&#8217;une typologie des formes de r&#233;ponses attendues pour chaque type de questions. Nous
pr&#233;sentons &#233;galement des exp&#233;riences pr&#233;liminaires utilisant ces typologies pour les questions complexes,
avec de bons r&#233;sultats.
</p>
<p>Abstract. Most question-answering systems have been designed to answer &#8220;factual&#8221; questions (short
and precise answers as dates, locations), and only a few researches concern complex questions. This article
presents a typology of questions, including complex questions, as well as a typology of answers that should
be expected for each type of questions. We also present preliminary experiments using these typologies
for answering complex questions and leading to good results.
</p>
<p>Mots-cl&#233;s : Syst&#232;me de question-r&#233;ponse, questions complexes.
</p>
<p>Keywords: Question-answering systems, complex questions.
</p>
<p>1 Introduction
</p>
<p>Les syst&#232;mes de question-r&#233;ponse (QR) ne seront pr&#234;ts &#224; &#234;tre utilis&#233;s par le grand public que lorsqu&#8217;ils
seront en mesure de r&#233;pondre de fa&#231;on satisfaisante &#224; tous les types de questions et en particulier aux
questions complexes tr&#232;s nombreuses &#224; &#234;tre pos&#233;es sur le Web (Yin, 2004). Or, la plupart des syst&#232;mes
de QR ont &#233;t&#233; con&#231;us pour r&#233;pondre &#224; des questions factuelles, et peu se sont int&#233;ress&#233;s au traitement des
questions complexes.
</p>
<p>Dans cet article, apr&#232;s un survol des travaux d&#233;finitoires et applicatifs sur le sujet (Section 2), nous pr&#233;sen-
tons une typologie de l&#8217;ensemble des questions que peut poser un utilisateur, ainsi qu&#8217;une typologie des
diff&#233;rentes formes que peut prendre un texte r&#233;pondant &#224; des questions (Sections 3 et 4). Ces deux typo-
logies sont ensuite reli&#233;es, dans le but de d&#233;finir des indices concrets sur les r&#233;ponses en fonction du type
de la question. Ainsi, gr&#226;ce &#224; la typologie des questions, un syst&#232;me de QR va savoir comment chercher et
gr&#226;ce &#224; la typologie des r&#233;ponses, il va savoir quoi/quelle forme chercher. Enfin, sont pr&#233;sent&#233;es une mise
en &#339;uvre de l&#8217;analyse des questions dans le syst&#232;me de question-r&#233;ponse FIDJI ainsi qu&#8217;une &#233;valuation
pr&#233;liminaire sur les donn&#233;es des campagnes ResPubliQA 2009 et Quaero 2009 (Section 5)1.
</p>
<p>1Ce travail a &#233;t&#233; partiellement financ&#233; par OSEO dans le cadre du projet Quaero.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V. MORICEAU, X. TANNIER ET M. FALCO
</p>
<p>2 D&#233;finition pr&#233;liminaire et travaux relatifs
</p>
<p>Le terme de question complexe est d&#233;fini comme regroupant les questions non factuelles, m&#234;me si ce
crit&#232;re varie. Certaines campagnes d&#8217;&#233;valuation proposent une premi&#232;re typologie de ces questions :
&#8211; La campagne NTCIR-7 (Mitamura et al., 2008) : biographie (Qui est H. Dean ?), liste/&#233;v&#233;nement
</p>
<p>(Lister les &#233;v&#233;nements li&#233;s &#224; ...) et relation (Quelles sont les relations entre S. Hussein et J. Chirac ?).
&#8211; La campagne ResPubliQA (Pe&#241;as et al., 2009) : questions raison (ou motivation : Pourquoi une no-
</p>
<p>menclature des marchandises a-t-elle &#233;t&#233; cr&#233;&#233;e ?), but (ou objectif : Quel est le but de ...), proc&#233;dure
(actions &#224; accomplir : Comment encourage-t-on la production ..., Quelle est la proc&#233;dure pour ...).
</p>
<p>&#8211; Les campagnes Quaero (Quintard, 2009) : comment et pourquoi.
On peut &#233;galement ajouter une cat&#233;gorie opinion : Que vous inspire Richard Wagner ?.
</p>
<p>Peu de travaux sont consacr&#233;s de fa&#231;on sp&#233;cifique &#224; la probl&#233;matique des questions complexes. (Lee et al.,
2008) pr&#233;sente un travail r&#233;alis&#233; dans le cadre de la campagne et de la typologie (relativement restreinte) de
NTCIR-7. Leur recherche des r&#233;ponses utilise une approche de fouille de textes ainsi que des connaissances
issues de l&#8217;encyclop&#233;die Wikipedia. Elle s&#8217;apparente au final &#224; une recherche de passages.
Verberne (2007) propose la classification suivante pour les questions de type &#8220;pourquoi&#8221; (why) en anglais :
Motivation (10 % : Why did NBC reject the first &quot;Star Trek&quot; episode ?) ; Physical Explanation (42 % :
Why can&#8217;t people sneeze with their eyes open ?) ; Non-physical Explanation (30 % : Why is the color
purple associated with royalty ?) ; Etymology (12 % : Why are chicken wings called Buffalo wings ?) ;
Trivial/Nonsense (6 % : Why is the word &quot;abbreviation&quot; so long ?). Cette classification concerne le contenu
s&#233;mantique des r&#233;ponses, tandis que notre ambition est d&#8217;orienter la recherche de la r&#233;ponse en fonction
du type de la question, ce que ne permettent les classes ci-dessus. Enfin, Verberne et al. (2008) montrent
que l&#8217;utilisation de l&#8217;analyse syntaxique, ainsi que d&#8217;un ensemble de mots-cl&#233;s r&#233;v&#233;lateurs d&#8217;une r&#233;ponse
&#224; une question &#8220;pourquoi&#8221;, am&#233;liore les r&#233;sultats d&#8217;un syst&#232;me bas&#233; sur une simple recherche de passages.
</p>
<p>La classification que nous proposons a pour but de permettre la mise en place de strat&#233;gies de recherche de
r&#233;ponses d&#233;di&#233;es &#224; certains types de questions. Nous introduisons &#224; la fois une typologie des questions et
des r&#233;ponses, en faisant le lien entre les deux. Nous ne pr&#233;sentons ici que les &#233;l&#233;ments impl&#233;ment&#233;s dans
le syst&#232;me de question-r&#233;ponse FIDJI (plus de d&#233;tails dans (Falco, 2009)).
</p>
<p>3 Typologie des questions
</p>
<p>La Figure 1 pr&#233;sente &#224; la fois la typologie des questions et celle des r&#233;ponses. Nous les avons &#233;labor&#233;es &#224;
partir de questions et r&#233;ponses imagin&#233;es et trouv&#233;es sur le Web. Les cat&#233;gories factuelle (questions boo-
l&#233;ennes ou sur des entit&#233;s) et d&#233;finition sont g&#233;n&#233;ralement admises dans le domaine. Les deux autres types
principaux, opinion et explication, sont moins trait&#233;s et entrent dans la cat&#233;gorie des questions dites com-
plexes, car elles attendent des r&#233;ponses souvent plus &#233;labor&#233;es que les autres questions. Les questions ex-
plication regroupent les questions dites &#8220;pourquoi&#8221; et &#8220;comment&#8221;. Cependant, elles ne correspondent pas
directement &#224; des questions introduites par ces deux pronoms interrogatifs. Notamment, d&#8217;autres formes
peuvent &#234;tre des questions explication (&#192; quoi bon &#233;crire des articles ?), et des questions en &#8220;comment&#8221;
peuvent &#234;tre factuelles (Comment s&#8217;appelle l&#8217;auteur de cet article ?). Pour ce dernier cas, un test manuel
simple permet de faire la distinction, il suffit d&#8217;ajouter &#8220;Expliquez&#8221; au d&#233;but de la question en &#8220;comment&#8221;
: Comment aller sur la Lune ?&#8594; Expliquez comment aller sur la Lune. (explication) ; Comment s&#8217;appelle
le petit de la vache ?&#8594; *Expliquez comment s&#8217;appelle le petit de la vache. (factuelle.). Nous proposons</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE &#201;TUDE DES QUESTIONS &#8220;COMPLEXES&#8221; EN QUESTION-R&#201;PONSE
</p>
<p>FIG. 1 &#8211; Liens entre typologies des questions et des r&#233;ponses. Les tirets pointent vers des r&#233;ponses simples,
les pointill&#233;s vers des r&#233;ponses &#233;labor&#233;es.
</p>
<p>de s&#233;parer la cat&#233;gorie explication en :
&#8211; Processus, ou s&#233;quence de processus, qui correspond &#224; la majorit&#233; des questions en &#8220;comment&#8221; : Com-
</p>
<p>ment va-t-on jusqu&#8217;au stade ?, Comment d&#233;clarer une variable en C ?.
&#8211; Cons&#233;quence, ou liste de cons&#233;quences : Quelles sont les cons&#233;quences du sommet de Copenhague ?,
</p>
<p>Que provoque le gel sur les routes ?.
&#8211; Raison, ou liste de raisons, auxquelles les questions de type &#8220;pourquoi&#8221; sont rattach&#233;es :
</p>
<p>&#8211; Cause : Pourquoi (comment se fait-il que) un enseignant-chercheur gagne-t-il moins qu&#8217;un trader ?
&#8211; But (motivation) : Pourquoi (dans quel but) le gouvernement a-t-il pr&#234;t&#233; de l&#8217;argent aux banques ?
&#8211; Obligation : Pourquoi doit-on ob&#233;ir aux lois ?</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V. MORICEAU, X. TANNIER ET M. FALCO
</p>
<p>4 Typologie des r&#233;ponses
</p>
<p>Le crit&#232;re de la longueur des r&#233;ponses, souvent utilis&#233; pour les classer, est discutable. D&#8217;une part, les
questions complexes peuvent souvent trouver des r&#233;ponses courtes (par exemple un adverbe pour une
question &#8220;comment&#8221;) ; d&#8217;autre part, il s&#8217;agit plus d&#8217;un moyen technique de r&#233;agir &#224; une question que
d&#8217;une classification v&#233;ritablement fond&#233;e. Plut&#244;t que de longueur, nous pr&#233;f&#233;rons donc parler de degr&#233;
d&#8217;&#233;laboration. Une r&#233;ponse peut &#234;tre simple ou &#233;labor&#233;e. Une r&#233;ponse simple est une r&#233;ponse pr&#233;cise, pas
ou peu sujette aux variations de la langue, et dont le type est facilement reconnaissable par l&#8217;utilisateur.
La r&#233;ponse peut &#234;tre juste ou fausse mais elle ne peut pas &#234;tre partielle. En ce qui concerne sa forme,
elle est g&#233;n&#233;ralement courte et compos&#233;e d&#8217;un simple syntagme nominal ou pr&#233;positionnel. Une r&#233;ponse
&#233;labor&#233;e, elle, peut se formuler de nombreuses fa&#231;ons ; elle peut se composer d&#8217;une ou plusieurs phrases,
m&#234;me si dans certains cas, un simple groupe de mots peut s&#8217;inscrire dans cette cat&#233;gorie (notamment un
&#233;v&#233;nement). Elle peut ne satisfaire l&#8217;utilisateur que de fa&#231;on partielle.
</p>
<p>Le second crit&#232;re est d&#8217;ordre plus s&#233;mantique. Ainsi, on peut distinguer, parmi les r&#233;ponses simples :
&#8211; La d&#233;finition simple, qui exprime la d&#233;finition d&#8217;un concept par rapport &#224; une propri&#233;t&#233; ou une entit&#233;,
</p>
<p>et qui peut s&#8217;exprimer par exemple par l&#8217;hyperonymie ou la synonymie.
&#8211; L&#8217;entit&#233;, une unit&#233; lexicale ou un syntagme. On peut parfois en d&#233;duire le type s&#233;mantique &#224; partir de
</p>
<p>la question (Quand eut lieu la prise de la Bastille ?&#8594; entit&#233; temporelle ; Quelle fus&#233;e est exploit&#233;e par
la soci&#233;t&#233; Arianespace ?&#8594; entit&#233; fus&#233;e), parfois non (Que peut-on installer sur un ordinateur ?&#8594; un
programme informatique, une plante ; Les entit&#233;s nomm&#233;es se placent dans la premi&#232;re cat&#233;gorie.
</p>
<p>&#8211; La mani&#232;re de r&#233;aliser un processus : Comment jugez-vous la prestation de T. Henry ?&#8594; habile, hon-
teuse ; Comment accroche-t-on un app&#226;t sur une ligne ?&#8594; avec d&#233;go&#251;t, en faisant bien attention.
</p>
<p>&#8211; La r&#233;ponse bool&#233;enne ou l&#8217;expression d&#8217;une opinion simple (Falco, 2009).
Dans les r&#233;ponses &#233;labor&#233;es, on trouve les opinions &#233;labor&#233;es, les Faits et les s&#233;quences de Faits. Le
Fait, englobant &#224; la fois l&#8217;&#233;tat et l&#8217;action, a pour forme pr&#233;f&#233;rentielle la proposition (ou un d&#233;verbatif).
Des questions factuelles peuvent avoir une r&#233;ponse &#233;labor&#233;e (Quand eut lieu la prise de la Bastille ? &#8594;
La Bastille fut prise apr&#232;s le vol des armes aux Invalides). Une s&#233;quence de Faits repr&#233;sente toutes les
r&#233;ponses qui d&#233;passent le cadre de la phrase, et donc toutes les explications longues.
</p>
<p>Enfin, la Figure 1 fait le lien entre les questions et les r&#233;ponses. Le point essentiel &#224; en retenir est que
le crit&#232;re de la complexit&#233; n&#8217;est pas suffisant pour partitionner l&#8217;ensemble des questions, puisqu&#8217;il est
possible de r&#233;pondre de fa&#231;on simple comme de fa&#231;on &#233;labor&#233;e &#224; la quasi-totalit&#233; des questions.
</p>
<p>5 Mise en &#339;uvre dans FIDJI et exp&#233;riences pr&#233;liminaires
</p>
<p>Le syst&#232;me FIDJI traitait jusqu&#8217;&#224; pr&#233;sent les questions factuelles et de d&#233;finition (Moriceau &amp; Tannier,
2010). Depuis, nous avons ajout&#233; le traitement des questions complexes de type explication. FIDJI d&#233;-
tecte les implications syntaxiques entre la question et les passages collect&#233;s par un moteur de recherche, &#224;
l&#8217;aide de l&#8217;analyseur robuste XIP (A&#239;t-Mokhtar et al., 2002) (d&#233;pendances syntaxiques et reconnaissance
en entit&#233;s nomm&#233;es). L&#8217;analyse des questions consiste entre autres &#224; identifier le type de la question corres-
pondant &#224; la typologie pr&#233;sent&#233;e &#224; la Section 3. Les constructions introductives des questions complexes
ainsi qu&#8217;un lexique d&#8217;une centaine de noms, verbes et adjectifs permettent de les orienter vers la classe
appropri&#233;e :
&#8211; Cause : Sous quelles conditions/Quelle est la cause..., Qu&#8217;est-ce qui d&#233;clenche/motive... ;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE &#201;TUDE DES QUESTIONS &#8220;COMPLEXES&#8221; EN QUESTION-R&#201;PONSE
</p>
<p>Cat&#233;gorie de la question d&#8217;apr&#232;s la typologie Explication/Raison Explication/Processus TOTAL
ResPubliQA 2009 Nombre de questions 170 86 256
</p>
<p>R&#233;ponses correctes 40 % 22,4 % 33,9 %
Reconnaissance du type 97,1 % 86 % 93,3 %
</p>
<p>Quaero 2009 Nombre de questions 24 39 63
R&#233;ponses (rang 1) 23,80 % 41,17 % 34,90 %
</p>
<p>R&#233;ponses (rang 1 &#224; 3) 42,85 % 58,82 % 52,40 %
Reconnaissance du type 70,80 % 100 % 88,9 %
</p>
<p>TAB. 1 &#8211; &#201;valuation de FIDJI pour les questions complexes .
</p>
<p>&#8211; But : Dans quel but/objectif/intention/finalit&#233;... ;
&#8211; Obligation : Pourquoi faut-il/doit-on/est-on oblig&#233; de ;
&#8211; Raison (sans sp&#233;cification de la sous-classe) : Pourquoi..., Pour quelle motif/raison... ;
&#8211; Processus : Comment, De quelle fa&#231;on, Quelle est la proc&#233;dure/m&#233;thode/&#233;tapes... de ;
&#8211; Cons&#233;quence : Quelle sont les cons&#233;quences/effets/r&#233;percussions....
Seules les trois cat&#233;gories principales de l&#8217;explication (raison, processus, cons&#233;quence) ont donn&#233; lieu &#224;
une strat&#233;gie de recherche des r&#233;ponses, diff&#233;rente de celle d&#233;finie pour les questions factuelles. Dans
un premier temps, une liste d&#8217;une centaine de mots-cl&#233;s d&#233;clencheurs de l&#8217;une des trois cat&#233;gories a &#233;t&#233;
cr&#233;&#233;e. Ces noms, verbes, adjectifs, pr&#233;positions ou conjonctions sont des indices suppl&#233;mentaires quant &#224;
la pertinence d&#8217;un passage. Par exemple :
&#8211; Cause : ainsi, lorsque, d&#8217;autant plus que, &#224; cause de, occasionner, engendrer, motif, raison...
&#8211; Cons&#233;quence : donc, par cons&#233;quence, de ce fait...
&#8211; But : but, intention, objectif...
&#8211; Obligation : devoir, falloir, contraindre, n&#233;cessit&#233;, imp&#233;ratif, indispensable, important...
Pour chaque question, les phrases contenant le plus de d&#233;pendances syntaxiques en commun avec la ques-
tion sont s&#233;lectionn&#233;es. &#192; partir de ces phrases, des passages plus longs sont construits et class&#233;s en
fonction des scores &#8220;classiques&#8221; de redondance, de nombre de mots-cl&#233;s, de nombre de d&#233;pendances re-
trouv&#233;es (Moriceau &amp; Tannier, 2010) et de la pr&#233;sence des mots d&#233;clencheurs.
</p>
<p>Nous avons effectu&#233; une premi&#232;re &#233;valuation de l&#8217;analyse des questions et de la recherche des r&#233;ponses
dans le syst&#232;me FIDJI sur les donn&#233;es des campagnes d&#8217;&#233;valuation ResPubliQA 2009 et Quaero 2009, ces
campagnes &#233;tant les seules qui int&#232;grent les questions complexes pour le fran&#231;ais. Les questions complexes
de ResPubliQA 2009 portent sur des textes de l&#8217;administration europ&#233;enne (corpus JRC-Acquis) et sont de
trois types : raison, but et proc&#233;dure (Pe&#241;as et al., 2009). Les questions complexes de Quaero 2009 sont de
deux types : pourquoi et comment2 et portent sur des pages Web (Quintard, 2009). Le Tableau 1 pr&#233;sente
les taux de questions correctement analys&#233;es (type de la question correctement identifi&#233;) par FIDJI ainsi
que le taux de bonnes r&#233;ponses associ&#233;. En ce qui concerne l&#8217;analyse des questions, les r&#233;sultats sont tr&#232;s
encourageants. Les erreurs d&#8217;analyse sont principalement dues &#224; :
&#8211; des formulations syntaxiques ou lexicales non reconnues par le module d&#8217;analyse de FIDJI,
&#8211; des fautes d&#8217;orthographe ou des constructions incorrectes dans les questions. FIDJI ne dispose pas de
</p>
<p>correcteur orthographique et les erreurs d&#8217;analyse sont quasiment syst&#233;matiques dans ces cas-l&#224;.
En ce qui concerne la recherche des r&#233;ponses, les r&#233;sultats obtenus sur les donn&#233;es de Quaero 2009 sont
encourageants mais les questions complexes restent peu nombreuses et leurs formulations peu vari&#233;es.
</p>
<p>2Les types raison et but de ResPubliQA et pourquoi de Quaero correspondent au type raison de notre typologie, les types
proc&#233;dure et comment &#224; processus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>V. MORICEAU, X. TANNIER ET M. FALCO
</p>
<p>&#192; l&#8217;inverse, les r&#233;sultats sur ResPubliQA 2009 sont moyens mais les questions sont plus nombreuses et
vari&#233;es et portent sur des textes sp&#233;cialis&#233;s.
</p>
<p>6 Conclusion
</p>
<p>Le fait de r&#233;pondre &#224; des questions complexes permet d&#8217;apporter un nouvel int&#233;r&#234;t aux syst&#232;mes de
question-r&#233;ponse. En effet, ces questions sont repr&#233;sentatives de r&#233;els besoins des utilisateurs, et sont
mal trait&#233;es par les moteurs de recherche classiques. Pourtant, le traitement des questions complexes est
une t&#226;che peu explor&#233;e, et tr&#232;s difficile. Nous avons malgr&#233; tout pu montrer qu&#8217;appliquer des techniques
particuli&#232;res, m&#234;me simples, pour ce type de questions &#233;tait int&#233;ressant. En effet, notre syst&#232;me a surclass&#233;
les autres de fa&#231;on tr&#232;s nette lors de la campagne Quaero 2009 pour ces questions (Tannier &amp; Moriceau,
2010). Les perspectives concernant ce travail sont nombreuses, notamment des &#233;tudes concernant la taille
attendue d&#8217;une r&#233;ponse, l&#8217;agr&#233;gation de r&#233;sultats ou une utilisation plus pouss&#233;e de notre typologie.
</p>
<p>R&#233;f&#233;rences
</p>
<p>A&#207;T-MOKHTAR S., CHANOD J.-P. &amp; ROUX C. (2002). Robustness beyond Shallowness: Incremental
Deep Parsing. Natural Language Engineering, 8, 121&#8211;144.
FALCO M. (2009). Analyse des questions dans un syst&#232;me de question-r&#233;ponse. Master&#8217;s thesis, Uni-
versit&#233; Paris Diderot-Paris 7.
LEE Y.-H., LEE C.-W., SUNG C.-L., TZOU M.-T., WANG C.-C., LIU S.-H., SHIH C.-W., YANG P.-
Y. &amp; HSU W.-L. (2008). Complex Question Answering with ASQA at NTCIR 7 ACLIA. In Proceeding
of the 7th NTCIR Workshop Meeting, p. 70&#8211;76, Tokyo, Japan.
MITAMURA T., NYBERG E., SHIMA H., KATO T., MORI T., LIN C.-Y., SONG R., LIN C.-J., SAKAI
T., JI D. &amp; KANDO N. (2008). Overview of the NTCIR-7 ACLIA Tasks: Advanced Cross-Lingual
Information Access. In Proceedings of NTCIR-7.
MORICEAU V. &amp; TANNIER X. (2010). FIDJI: Using Syntax for Validating Answers in Multiple Docu-
ments. Information Retrieval, Special Issue on Focused Information Retrieval.
PE&#209;AS A., FORNER P., SUTCLIFFE R., RODRIGO A., FORA&#774;SCU C., ALEGRIA I., GIAMPICCOLO D.,
MOREAU N. &amp; OSENOVA P. (2009). Overview of ResPubliQA 2009: Question Answering Evaluation
over European Legislation. In Working Notes for the CLEF 2009 Workshop, Corfu, Greece.
QUINTARD L. (2009). P2 Evaluation Report: Evaluation Design for Task 3.5 on Question Answering
systems. Rapport interne Internal Deliverable ID.CTC.12.S3.5.P2, Quaero program, CTC project.
TANNIER X. &amp; MORICEAU V. (2010). FIDJI: Web Question-Answering at Quaero 2009. In LREC
2010, Malte.
VERBERNE S. (2007). Evaluating Answer Extraction for Why-QA using RST-annotated Wikipedia texts.
In Proceedings of the Twelfth ESSLLI Student Session.
VERBERNE S., BOVES L., OOSTDIJK N. &amp; COPPEN P.-A. (2008). Using Syntactic Information for
Improving Why-Question Answering. In Proceedings of COLING 2008, Manchester, UK.
YIN L. (2004). Topic analysis and answering procedural questions. Rapport interne ITRI-04-14, Infor-
mation Technology Research Institute Technical Report Series.</p>

</div></div>
</body></html>