<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;veloppement de ressources pour le persan: lexique morphologique et cha&#238;ne de traitements de surface</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>D&#233;veloppement de ressources pour le persan:
lexique morphologique et cha&#238;ne de traitements de surface
</p>
<p>Beno&#238;t Sagot1 &amp; G&#233;raldine Walther2
</p>
<p>(1) Alpage, INRIA Paris&#8211;Rocquencourt &amp; Universit&#233; Paris 7, Rocquencourt, BP 105,
78153 Le Chesnay Cedex, France
</p>
<p>(2) LLF, Universit&#233; Paris 7, 30 rue du Ch&#226;teau des Rentiers, 75013 Paris, France
benoit.sagot@inria.fr, geraldine.walther@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons PerLex, un lexique morphologique du persan &#224; large couverture et libre-
ment disponible, accompagn&#233; d&#8217;une cha&#238;ne de traitements de surface pour cette langue. Nous d&#233;crivons
quelques caract&#233;ristiques de la morphologie du persan, et la fa&#231;on dont nous l&#8217;avons repr&#233;sent&#233;e dans le
formalisme lexical Alexina, sur lequel repose PerLex. Nous insistons sur la m&#233;thodologie que nous avons
employ&#233;e pour construire les entr&#233;es lexicales &#224; partir de diverses sources, ainsi que sur les probl&#232;mes li&#233;s
&#224; la normalisation typographique. Le lexique obtenu a une couverture satisfaisante sur un corpus de r&#233;f&#233;-
rence, et devrait donc constituer un bon point de d&#233;part pour le d&#233;veloppement d&#8217;un lexique syntaxique du
persan.
</p>
<p>Abstract. We introduce PerLex, a large-coverage and freely-available morphological lexicon for
the Persian language, as well as a corresponding surface processing chain. We describe the main features
of the Persian morphology, and the way we have represented it within the Alexina formalism, on which
PerLex is based. We focus on the methodology we used for constructing lexical entries from various
sources, as well as on the problems related to typographic normalisation. The resulting lexicon shows a
satisfying coverage on a reference corpus and should therefore be a good starting point for developing a
syntactic lexicon for the Persian language.
</p>
<p>Mots-cl&#233;s : Lexique morphologique, Persan, D&#233;veloppement de lexiques, Traitements de surface.
</p>
<p>Keywords: Morphological lexicon, Persian language, Lexical development, Surface processing.
</p>
<p>1 Introduction
</p>
<p>La majorit&#233; des t&#226;ches de traitement automatique des langues (TAL), comme l&#8217;analyse syntaxique et la
g&#233;n&#233;ration de langage naturel ainsi que la plupart de ses applications tels la fouille de textes, l&#8217;extraction
d&#8217;informations et la traduction automatique n&#233;cessitent, ou du moins b&#233;n&#233;ficient largement, de la disponi-
bilit&#233; de ressources lexicales &#224; large couverture et de traitements de surface de qualit&#233;.
</p>
<p>Parmi les ressources lexicales, les lexiques morphologiques constituent les plus simples, mais n&#233;anmoins
les plus indispensables. Ils associent &#224; chaque forme fl&#233;chie (ou forme) un lemme et une &#233;tiquette morpho-
syntaxique. Cependant, pour deux raisons au moins, ce type de ressources ne semble accessible que pour
un nombre bien restreint de langues convenablement d&#233;crites. D&#8217;une part, de nombreuses langues font</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BENO&#206;T SAGOT, G&#201;RALDINE WALTHER
</p>
<p>preuve d&#8217;un manque important de ressources et m&#234;me lorsqu&#8217;il arrive qu&#8217;il existe des ressources pour ces
langues, celles-ci ont le plus souvent une couverture limit&#233;e. D&#8217;autre part, les ressources existantes ne sont
pas toujours librement disponibles, et ce alors m&#234;me que l&#8217;exp&#233;rience montre que la libre disponibilit&#233;
repr&#233;sente le moyen le plus rapide pour le d&#233;veloppement de ressources de qualit&#233;.
</p>
<p>Les traitements de surface, quant &#224; eux, recouvrent l&#8217;ensemble des op&#233;rations que l&#8217;on peut effectuer sur un
texte brut pour en extraire un maximum d&#8217;informations sans avoir recours &#224; l&#8217;analyse syntaxique. On peut
donc les mettre en &#339;uvre en tant que tels ou en pr&#233;alable &#224; une analyse syntaxique voire s&#233;mantique. Parmi
les t&#226;ches g&#233;n&#233;ralement consid&#233;r&#233;es comme relevant des traitements de surface, on peut citer la correction
orthographique, l&#8217;identification des mots compos&#233;s ou la reconnaissance des nombreux types d&#8217;entit&#233;s
nomm&#233;es au sens large (des noms de personnes aux URL en passant par les adresses et les dates). Parmi
ces t&#226;ches, nombreuses sont celles qui b&#233;n&#233;ficient de la disponibilit&#233; d&#8217;informations lexicales, notamment
morphologiques. &#192; l&#8217;inverse, une cha&#238;ne de traitements de surface permet la mise en place de protocoles
efficaces d&#8217;am&#233;lioration des ressources lexicales.
</p>
<p>Dans cet article nous pr&#233;sentons PerLex, un lexique morphologique du persan &#224; large couverture, libre-
ment disponible et dont une version pr&#233;liminaire a d&#233;j&#224; &#233;t&#233; pr&#233;sent&#233;e &#224; la conf&#233;rence LREC en mai 2010
(Sagot &amp; Walther, 2010), ainsi qu&#8217;une version persane de la cha&#238;ne de traitements de surface SXPipe (Sa-
got &amp; Boullier, 2008). Apr&#232;s un bref &#233;tat de l&#8217;art du traitement automatique du persan (section 2), nous
pr&#233;sentons &#224; la section 3 quelques caract&#233;ristiques de cette langue, et notamment de sa morphologie. Nous
pr&#233;sentons ensuite le formalisme Alexina qui sous-tend le lexique PerLex (section 4) et notre description
dans ce formalisme de la morphologie du persan (section 5). Nous d&#233;crivons la m&#233;thodologie de construc-
tion de PerLex et le lexique obtenu &#224; la section 6. Enfin, nous pr&#233;sentons &#224; la section 7 le travail effectu&#233;
dans SXPipe pour permettre le traitement du persan, ainsi qu&#8217;une id&#233;e du taux de couverture de PerLex1.
</p>
<p>2 Le traitement automatique du persan : &#233;tat des lieux
</p>
<p>Le premier projet de traitement automatique ayant eu une importance notable pour le persan, le projet
Shiraz, a &#233;t&#233; consacr&#233; &#224; la traduction automatique du persan vers l&#8217;anglais (Amtrup et al., 2000). Il a eu
notamment pour r&#233;sultat la mise en place d&#8217;un lexique bilingue d&#8217;environ 50 000 entr&#233;es2 qui s&#8217;appuie
sur une description du persan au sein d&#8217;un mod&#232;le de grammaire d&#8217;unification (Megerdoomian, 2000). Ce
lexique a ensuite &#233;t&#233; adapt&#233; aux outils Xerox pour les automates &#224; &#233;tats finis (Megerdoomian, 2004).
</p>
<p>Outre les travaux r&#233;alis&#233;s dans le cadre du projet Shiraz, d&#8217;autres outils d&#8217;analyse morphologique ou de
lemmatisation ont &#233;t&#233; d&#233;velopp&#233;s, mais n&#8217;ont pas conduit &#224; la construction d&#8217;un lexique &#224; large couver-
ture. On peut citer les travaux de Dehdari &amp; Lonsdale (2008), et notamment leur lemmatiseur PerStem,
librement disponible3.
</p>
<p>Ces derni&#232;res ann&#233;es ont &#233;t&#233; d&#233;velopp&#233;s divers outils et ressources TAL pour le persan. Ils s&#8217;agit es-
</p>
<p>1Le d&#233;veloppement de PerLex s&#8217;inscrit dans un projet plus large d&#233;nomm&#233; PerGram (Projet Franco-Allemand ANR/DFG
MU 2822/3-1). Le but de PerGram est (1) d&#8217;&#233;tablir une mod&#233;lisation HPSG d&#8217;un certain nombre de ph&#233;nom&#232;nes syntaxiques du
persan (comme celui des pr&#233;dicats complexes), (2) d&#8217;impl&#233;menter une grammaire HPSG couvrant l&#8217;essentiel des ph&#233;nom&#232;nes
linguistiques du persan et (3) de mettre en place PerLex en tant que lexique associ&#233; &#224; cette grammaire et pour lequel il est pr&#233;vu
qu&#8217;il inclue &#224; terme aussi bien les informations morphologiques que syntaxiques des lex&#232;mes. PerGram est un projet dirig&#233;
conjointement par Pollet Samvelian (Universit&#233; Paris 3) et Stefan M&#252;ller (Freie Universit&#228;t Berlin).
</p>
<p>2Ce lexique ne semble cependant pas &#234;tre disponible librement.
3http://sourceforge.net/projects/perstem/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LEXIQUE MORPHOLOGIQUE ET TRAITEMENTS DE SURFACE POUR LE PERSAN
</p>
<p>sentiellement d&#8217;&#233;tiqueteurs morpho-syntaxiques (QasemiZadeh &amp; Rahimi, 2006; Tasharofi et al., 2007;
Shamsfard &amp; Fadaee, 2008), d&#8217;analyseurs syntaxiques (Hafezi, 2004; Dehdari &amp; Lonsdale, 2008) et de
syst&#232;mes de traduction automatique (Feili &amp; Ghassem-Sani, 2004; Saedi et al., 2009).
</p>
<p>3 Le persan
</p>
<p>Le persan est une langue indo-europ&#233;enne de la famille des langues indo-aryennes, et plus pr&#233;cis&#233;ment du
groupe des langues iraniennes occidentales. Le persan se caract&#233;rise par un ordre des mots de type SOV
relativement fixe. Son nombre de locuteurs avoisine les 130 millions, r&#233;partis majoritairement en Iran, en
Afghanistan, Tadjikistan et en Ouzb&#233;kistan.
</p>
<p>3.1 &#201;criture et translitt&#233;ration
</p>
<p>Le persan s&#8217;&#233;crit de droite &#224; gauche au moyen d&#8217;une variante de l&#8217;alphabet arabe, avec quelques caract&#232;res
en plus, d&#8217;autres en moins, et d&#8217;autres qui ont une forme l&#233;g&#232;rement modifi&#233;e. De m&#234;me qu&#8217;en arabe,
les voyelles br&#232;ves ne sont pas transcrites et la distinction entre majuscules et minuscules n&#8217;existe pas.
Par ailleurs, deux caract&#232;res cons&#233;cutifs peuvent &#234;tre li&#233;s (c&#8217;est-&#224;-dire &#233;crits d&#8217;un seul trait, ce qui n&#8217;est
possible que pour certains caract&#232;res), coll&#233;s (juxtapos&#233;s sans &#234;tre li&#233;s) ou s&#233;par&#233;s par un espace. Selon
qu&#8217;il est isol&#233; ou li&#233; au caract&#232;re pr&#233;c&#233;dent et/ou suivant, un m&#234;me caract&#232;re peut prendre jusqu&#8217;&#224; quatre
formes diff&#233;rentes.
</p>
<p>L&#8217;encodage de ces caract&#232;res au moyen de la norme Unicode peut ainsi se faire de deux fa&#231;ons : soit au
moyen de caract&#232;res contextuels, qui repr&#233;sentent la forme pr&#233;cise que doit prendre le caract&#232;re (li&#233; ou
non, &#224; droite et &#224; gauche), soit au moyen de caract&#232;res g&#233;n&#233;riques, dont la forme varie en fonction du
contexte. L&#8217;encodage au moyen des caract&#232;res contextuels est aujourd&#8217;hui consid&#233;r&#233; comme obsol&#232;te, car
il ne respecte pas l&#8217;unicit&#233; de repr&#233;sentation de chaque caract&#232;re. L&#8217;encodage au moyen des caract&#232;res
g&#233;n&#233;riques n&#233;cessite cependant parfois l&#8217;introduction d&#8217;espaces de longueur nulle (zero-width non-joiner,
ou ZWNJ) entre deux caract&#232;res pour indiquer qu&#8217;ils ne doivent pas &#234;tre li&#233;s alors qu&#8217;ils pourraient l&#8217;&#234;tre.
En effet, en persan, certains affixes s&#8217;&#233;crivent coll&#233;s mais non li&#233;s au morph&#232;me auquel ils se rattachent,
quand bien m&#234;me ce rattachement rapproche deux caract&#232;res qui seraient autrement li&#233;s.
</p>
<p>Certains outils et ressources d&#233;velopp&#233;s au cours de notre travail reposent sur une translitt&#233;ration du per-
san en caract&#232;res latins. Nous avons utilis&#233; la translitt&#233;ration bijective d&#233;velopp&#233;e dans le cadre du projet
PerGram, dont une variante ne fait usage que de caract&#232;res que l&#8217;on peut repr&#233;senter au moyen de l&#8217;en-
codage ISO-8859-2 (dit Latin-2). L&#8217;avantage est que l&#8217;on peut alors utiliser sans probl&#232;me des outils qui
ne g&#232;rent que les repr&#233;sentations 8-bits, c&#8217;est-&#224;-dire les repr&#233;sentation o&#249; les notions informatiques et
typographiques de caract&#232;re co&#239;ncident4.
</p>
<p>En plus d&#8217;un outil de translitt&#233;ration permettant de basculer des caract&#232;res persans aux caract&#232;res latins
correspondants dans un sens ou dans l&#8217;autre, nous avons d&#233;velopp&#233; deux outils de normalisation. Le pre-
mier remplace tout caract&#232;re contextuel par le caract&#232;re g&#233;n&#233;rique correspondant, en ins&#233;rant si besoin des
espaces de longueur nulle. Le second remplace tout caract&#232;re qui ne fait pas partie de l&#8217;alphabet persan
stricto sensu par sa contrepartie appropri&#233;e.
</p>
<p>4Pour plus de lisibilit&#233;, nous employons ici une transcription phon&#233;tique plus standard comprenant aussi les voyelles br&#232;ves.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BENO&#206;T SAGOT, G&#201;RALDINE WALTHER
</p>
<p>3.2 Aper&#231;u de la morphologie du persan
</p>
<p>La morphologie nominale du persan n&#8217;affiche qu&#8217;un nombre restreint de formes fl&#233;chies. Il n&#8217;y a pas
de flexion casuelle, pas de diff&#233;rence de genres (mis &#224; part pour quelques emprunts arabes anim&#233;s qui
prennent la marque arabe du f&#233;minin en -e). Le persan n&#8217;a que deux nombres, le singulier et le pluriel,
dont seul le pluriel se distingue par une marque morphologique sp&#233;cifique, soit le suffixe -h&#226; (possible
pour tous les noms comptables), soit, pour certains noms d&#233;signant principalement des anim&#233;s, le suffixe
-&#226;n, plus formel. S&#8217;ajoutent &#224; cela quelques marques de pluriel arabes, -&#226;t, -un, -in etc., qui ne s&#8217;attachent
qu&#8217;&#224; des emprunts arabes. Le persan a &#233;galement h&#233;rit&#233; d&#8217;un certain nombre de pluriels dits bris&#233;s, mais
ces derniers ne s&#8217;analysent plus directement en morphologie. Par ailleurs, il existe &#233;galement une particule
enclitique sp&#233;cifique, appel&#233;e &#201;zaf&#233;, qui fonctionne comme un marqueur de d&#233;pendance. Il peut marquer
aussi bien les noms que les SN en tant qu&#8217;&#233;l&#233;ments modifi&#233;s (Samvelian, 2007; Lazard et al., 2006).
</p>
<p>Par ailleurs, le persan dispose d&#8217;un d&#233;terminant ind&#233;fini enclitique -i, sans formes s&#233;par&#233;es pour le singu-
lier et le pluriel. Si cette particule se combine avec un nom modifi&#233; par un adjectif, il peut soit s&#8217;attacher
directement au nom, soit suivre l&#8217;adjectif. Les autres particules enclitiques du persan sont le -i qui se com-
bine avec le marqueur relatif ke, le marqueur optionnel de d&#233;finitude -(h)e et la postposition -r&#226; indiquant
l&#8217;objet direct d&#233;fini. Les adjectifs, quant &#224; eux, ne varient qu&#8217;en degr&#233;, prenant le suffixe -tar au compara-
tif et le suffixe -tarin au superlatif. Ils peuvent n&#233;anmoins &#234;tre suivi de l&#8217;&#201;zaf&#233; lorsqu&#8217;ils suivent un nom
modifi&#233; plus pr&#233;cis&#233;ment ou lorsqu&#8217;ils prennent eux-m&#234;mes un objet direct ou indirect. Ce dernier point
s&#8217;applique en particulier au adjectifs d&#233;riv&#233;s de verbes (Lazard et al., 2006).
</p>
<p>Les verbes simples du persan sont en nombre tr&#232;s r&#233;duit. Ils constituent une classe ferm&#233;e de seulement
200 unit&#233;s environ, la majorit&#233; des sens pris en charge par des verbes dans la plupart des langues du
monde &#233;tant ici exprim&#233;s par des locutions verbales complexes qui constituent un proc&#233;d&#233; tr&#232;s productif.
La morphologie verbale du persan est l&#233;g&#232;rement plus complexe que sa morphologie nominale, mais elle
suit n&#233;anmoins un sch&#233;ma assez simple. On admet habituellement (Lazard et al., 2006) l&#8217;existence de deux
radicaux par verbe, l&#8217;un servant &#224; la formation des temps du pr&#233;sent, du participe pr&#233;sent, du g&#233;rondif et
de l&#8217;imp&#233;ratif, l&#8217;autre aux temps du pass&#233; ainsi qu&#8217;aux participes pass&#233; et d&#8217;obligation/de possibilit&#233; et aux
infinitifs. Les temps compos&#233;s et la voie passive sont d&#233;riv&#233;s &#224; partir du participe pass&#233;. Les paradigmes
verbaux du persan s&#8217;appuient sur un mod&#232;le de type Pr&#233;fixe(s)-Rad-Suffixe(s).
</p>
<p>Dans ce mod&#232;le, les pr&#233;fixes possibles sont les deux pr&#233;fixes TAM5 mi- et be-, les suffixes les d&#233;sinences
personnelles -am, -i, -ad/-e/&#248;, -im, -id/-in et -and/-an. Les combinaisons que l&#8217;on peut ainsi obtenir g&#233;-
n&#232;rent sept temps/modes verbaux diff&#233;rents pour six personnes chacun, ainsi que cinq formes verbales
nominales pouvant &#224; leur tour se combiner avec les particules enclitiques cit&#233;es plus haut. Les pr&#233;fixes
de n&#233;gation n- ou m- (formel pour les formes de l&#8217;imp&#233;ratif notamment) peuvent &#233;galement se combiner
avec les formes verbales ainsi g&#233;n&#233;r&#233;es (Lazard et al., 2006). Par ailleurs, on note &#233;galement que le persan
poss&#232;de deux paradigmes de l&#8217;auxiliaire &#234;tre, l&#8217;un &#233;tant constitu&#233; de mots pleins, l&#8217;autre de formes encli-
tiques qui peuvent venir s&#8217;attacher &#224; des noms ou des adjectif, mais aussi &#224; la forme du participe pass&#233;
avec lequel elles forment par ce fait les paradigmes du parfait et de l&#8217;imparfait compos&#233; (Lazard et al.,
2006).
</p>
<p>Enfin, le persan poss&#232;de un paradigme de suffixes pronominaux qui peuvent se combiner aussi bien avec
des noms qu&#8217;avec des verbes, des pr&#233;positions, des adjectifs et certains adverbes (Lazard et al., 2006).
</p>
<p>5Temps-Aspect-Mode.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LEXIQUE MORPHOLOGIQUE ET TRAITEMENTS DE SURFACE POUR LE PERSAN
</p>
<p>4 Le formalisme lexical Alexina
</p>
<p>Nous avons d&#233;velopp&#233; le lexique morphologique PerLex dans le formalisme Alexina. Ce formalisme
couvre &#224; la fois le niveau morphologique et le niveau syntaxique (p.ex. la valence), ce qui sera utile pour
le d&#233;veloppement futur de PerLex 6. Alexina permet de repr&#233;senter les informations lexicales d&#8217;une fa&#231;on
compl&#232;te, efficace et lisible (Sagot, 2005; Danlos &amp; Sagot, 2008), tout en &#233;tant compatible avec la norme
ISO pour les lexiques TAL, la norme LMF (Lexical Markup Framework) (Francopoulo et al., 2006). Un
certain nombre de ressources lexicales existe dans ce formalisme, telles que le Lefff , un lexique morpho-
logique et syntaxique &#224; large couverture pour le fran&#231;ais (Sagot et al., 2006; Sagot, 2010), ainsi que des
ressources pour l&#8217;espagnol (le Leffe), le galicien, le polonais (Sagot, 2007), le slovaque (Sagot, 2005),
et bient&#244;t l&#8217;anglais, et aussi SoraLex, un lexique morphologique pour le kurde sorani (Walther &amp; Sagot,
2010), une langue typologiquement proche du Persan s&#8217;&#233;crivant avec une variante de l&#8217;alphabet arabe.
</p>
<p>Alexina utilise une repr&#233;sentation &#224; deux niveaux qui s&#233;pare la description du lexique de son utilisation :
&#8211; le lexique intensionnel factorise les informations lexicales en associant &#224; chaque lemme une classe mor-
phologique (d&#233;finie dans une description morphologique formalis&#233;e) et des informations syntaxiques
profondes ; il est utilis&#233; pour le d&#233;veloppement de la ressource ;
</p>
<p>&#8211; le lexique extensionnel, produit automatiquement par compilation du lexique intensionnel, associe &#224;
chaque forme fl&#233;chie une structure d&#233;taill&#233;e qui repr&#233;sente l&#8217;ensemble de ses propri&#233;t&#233;s morphologiques
et syntaxiques ; il est directement utilis&#233; par les outils TAL tels que les &#233;tiqueteurs ou les parseurs.
</p>
<p>5 Formalisation de la morphologie du persan
</p>
<p>Parmi les diverses particules enclitiques cit&#233;es &#224; la section 3.2, toutes n&#8217;ont pas &#233;t&#233; retenues pour &#234;tre
trait&#233;es en morphologie. PerLex suit les choix linguistiques adopt&#233;s au sein du projet PerGram, d&#233;finis
notamment dans (Samvelian, 2007) :
&#8211; les marques de pluriel, l&#8217;&#201;zaf&#233; -(y)e (d&#232;s lors qu&#8217;il est repr&#233;sent&#233; &#224; l&#8217;&#233;crit), le marqueur ind&#233;fini -i, le
comparatif et le superlatif -tar et -tarin, les suffixes personnels (les d&#233;sinences verbales) et les formes
enclitiques de l&#8217;auxiliaire &#234;tre sont consid&#233;r&#233;s comme des suffixes flexionnels,
</p>
<p>&#8211; dans sa combinaison avec le marqueur relatif ke, la particule enclitique -i est consid&#233;r&#233;e comme un mot
compos&#233; amalgam&#233; au mot pr&#233;c&#233;dent,
</p>
<p>&#8211; les autres enclitiques, y compris la copule lorsqu&#8217;elle ne sert pas &#224; former les temps du parfait et de
l&#8217;imparfait compos&#233;, et le -r&#226; marqueur de l&#8217;objet direct d&#233;fini, sont interpr&#234;t&#233;s comme des formes
ind&#233;pendantes quoique amalgam&#233;es.
</p>
<p>En ayant en t&#234;te ces choix linguistiques, nous avons d&#233;velopp&#233; une description compl&#232;te de la morphologie
du Persan dans le formalisme morphologique d&#8217;Alexina (Sagot, 2007), &#224; partir des donn&#233;es de (Lazard
et al., 2006). Dans ce formalisme, la flexion est mod&#233;lis&#233;e comme l&#8217;affixation d&#8217;un pr&#233;fixe et d&#8217;un suffixe
de part et d&#8217;autre d&#8217;un radical. Des ph&#233;nom&#232;nes de sandhi7 peuvent avoir lieu aux fronti&#232;res de ces unit&#233;s,
qui sont &#233;ventuellement conditionn&#233;s par des propri&#233;t&#233;s du radical.
</p>
<p>Notre description contient entre autres 27 tables verbales et 5 tables nominales.
6Dans cet article, nous ne prenons pas en compte les informations syntaxiques, puisque notre travail concerne la construction
</p>
<p>d&#8217;un lexique morphologique.
7Transformations sur le radical et/ou l&#8217;affixe provoqu&#233;es par la juxtaposition ce ces derniers. Ainsi en fran&#231;ais, lorsque le
</p>
<p>suffixe -ons est juxtapos&#233; au radical mang-, un ph&#233;nom&#232;ne de sandhi a lieu qui induit l&#8217;insertion d&#8217;un e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BENO&#206;T SAGOT, G&#201;RALDINE WALTHER
</p>
<p>6 Construction du lexique PerLex
</p>
<p>Nous avons exploit&#233; diff&#233;rentes sources d&#8217;informations lexicales librement disponibles, avec une impor-
tance respective qui varie d&#8217;une partie du discours &#224; l&#8217;autre :
&#8211; le corpus BijanKhan (BijanKhan, 2004; Amiri et al., 2007), un corpus annot&#233; automatiquement en
parties du discours ;
</p>
<p>&#8211; la Wikipedia Persane8,
&#8211; un lexique nominal du Persan en cours de construction par Mehdi Ghassemi &#224; l&#8217;Universit&#233; Paris-Est
(Ghassemi, c.p.),
</p>
<p>&#8211; la grammaire de r&#233;f&#233;rence de Lazard et al. (2006),
&#8211; l&#8217;introspection par des linguistes locuteurs natifs du Persan.
</p>
<p>Les entr&#233;es lexicales ont &#233;t&#233; cr&#233;&#233;es en trois &#233;tapes :
</p>
<p>1. construction d&#8217;entr&#233;es lexicales &#224; partir des ressources ci-dessus ;
</p>
<p>2. nettoyage des entr&#233;es obtenues ;
</p>
<p>3. ajout manuel d&#8217;entr&#233;es manquantes &#224; partir des formes trouv&#233;es dans le corpus BijanKhan mais non
couvertes par les entr&#233;es d&#233;j&#224; construites.
</p>
<p>Construction du lexique de base Dans un premier temps, nous avons d&#233;velopp&#233; et v&#233;rifi&#233; manuelle-
ment une liste de lemmes verbaux (&#224; l&#8217;infinitif) &#224; partir de conjugueurs en ligne librement disponibles sur
internet. Nous avons associ&#233; &#224; chacun de ces lemmes une des classes flexionnelles de notre description
morphologique (parfois plusieurs).
</p>
<p>La Wikipedia persane a &#233;t&#233; exploit&#233;e de la fa&#231;on suivante. Nous avons fait un inventaire des Cat&#233;gories
Wikipedia indiquant un article concernant une personne ou une ville. En r&#233;cup&#233;rant et normalisant les
titres de chaque article concern&#233;, ainsi que les titres de tous les articles redirigeant vers ce m&#234;me article,
nous avons pu constituer un lexique de noms de personnes et de noms de villes. Nous avons compl&#233;t&#233; ces
donn&#233;es par la liste des pays telle que disponible &#224; l&#8217;article correspondant. Le r&#233;sultat est un ensemble
de plus de 10 000 lemmes pour des noms propres, auxquels nous avons attribu&#233; une classe de flexion
nominale ne permettant pas la mise au pluriel.
</p>
<p>Par ailleurs, une liste de lemmes nominaux a &#233;t&#233; extraite &#224; partir de donn&#233;es de Mehdi Ghassemi. Pour
certains d&#8217;entre eux, la forme de base du pluriel &#233;tait mentionn&#233;e. Pour les autres, une recherche dans le
corpus BijanKhan a permis d&#8217;assigner une ou deux formes de base pour le pluriel.
</p>
<p>Enfin, nous avons pass&#233; le corpus BijanKhan &#224; travers notre normaliseur, et nous avons extrait du r&#233;sultat
d&#8217;autres entr&#233;es nominales, ainsi que des entr&#233;es pour les autres cat&#233;gories9. Ces entr&#233;es, notamment pour
les classes ferm&#233;es, ont &#233;t&#233; compl&#233;t&#233;es &#224; la main &#224; partir de (Lazard et al., 2006). Nous avons attribu&#233; &#224;
toutes les entr&#233;es adjectivales l&#8217;unique classe flexionnelle de cette cat&#233;gorie. Pour les cat&#233;gories restantes,
toutes les entr&#233;es ont &#233;t&#233; consid&#233;r&#233;es comme invariables, &#224; l&#8217;exception de certains adverbes qui peuvent
recevoir le marqueur ind&#233;fini -i, l&#8217;&#201;zaf&#233; ou les affixes personnels10.
</p>
<p>8LaWikipedia persane est accesible en ligne &#224; l&#8217;adresse http://fa.wikipedia.org. Nous avons exploit&#233; l&#8217;extraction
au format wiki en date du 16 f&#233;vrier 2010.
</p>
<p>9Pour les lemmes auxquels le corpus BijanKhan associe plusieurs cat&#233;gories, nous avons &#233;limin&#233; automatiquement les
entr&#233;es correspondant &#224; des cat&#233;gories concernant moins de 1% de ses occurrences. Cela permet de r&#233;duire le bruit qui provient
des erreurs d&#8217;annotation du corpus.
</p>
<p>10En Persan, quasiment tout adjectif peut &#234;tre employ&#233; comme adverbe. Par cons&#233;quent, les entr&#233;es adverbiales qui corres-
pondaient &#224; une entr&#233;e adjectivale pour le m&#234;me lemme ont &#233;t&#233; &#233;limin&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LEXIQUE MORPHOLOGIQUE ET TRAITEMENTS DE SURFACE POUR LE PERSAN
</p>
<p>Nettoyage du lexique de base &#192; ce stade, et malgr&#233; le filtrage &#233;voqu&#233; &#224; la note 9, de nombreuses entr&#233;es
lexicales sont incorrectes, notamment une proportion significative de celles extraites du corpus BijanKhan.
C&#8217;est l&#224; une cons&#233;quence imm&#233;diate du fait que ce dernier a &#233;t&#233; annot&#233; automatiquement, avec un taux
d&#8217;erreur non nul. Nous avons donc supprim&#233; un certain nombre d&#8217;entr&#233;es lexicales, et notamment toutes les
entr&#233;es nominales et adjectivales extraites du corpus BijanKhan correspondant &#224; des lemmes qui avaient
toutes les caract&#233;ristiques de surface d&#8217;un pluriel (suffixe -h&#226;, notamment, suivi ou non de l&#8217;&#201;zaf&#233;, du
suffixe de l&#8217;ind&#233;fini ou des suffixes personnels). Nous avons &#233;galement &#233;limin&#233; les nombreuses entr&#233;es
correspondant manifestement &#224; des erreurs typographiques, en particulier lorsqu&#8217;un espace de longueur
nulle a &#233;t&#233; supprim&#233;, ou &#224; l&#8217;inverse remplac&#233; par un espace (ainsi les entr&#233;es erronn&#233;es pour les pronoms
&#226;n h&#226; et &#226;nh&#226; en plus du correct &#226;n_h&#226;11). Enfin, nous avons supprim&#233; tous les caract&#232;res jug&#233;s superflus,
bien que correctement pris en compte par nos outils (signes de vocalisation, etc.). Le r&#233;sultat de ce lexique
de base constitue une premi&#232;re version de lexique morphologique du persan.
</p>
<p>Extension du lexique de base Une fois cette premi&#232;re version de PerLex construite, nous avons cher-
ch&#233; les formes attest&#233;es dans le corpus mais non couvertes par notre lexique. Naturellement, ces formes
peuvent correspondre &#224; des entr&#233;es manquantes, &#224; des entr&#233;es incorrectes, &#224; des erreurs orthographiques
ou &#224; des erreurs typographiques. Nous les avons donc class&#233;es par fr&#233;quence d&#8217;apparition, et avons com-
pl&#233;t&#233; manuellement le lexique &#224; partir de ces donn&#233;es. Les entr&#233;es manquantes &#233;taient principalement des
noms propres appartenant &#224; des cat&#233;gories diff&#233;rentes de celles cherch&#233;es dans Wikipedia (noms de conti-
nents, noms de r&#233;gions d&#8217;Iran, etc.), ainsi qu&#8217;&#224; des pluriels bris&#233;s. Nous avons cependant constat&#233; que de
tr&#232;s nombreuses formes inconnues &#233;taient li&#233;es &#224; la typographie, sans que cela n&#8217;ait &#233;t&#233; d&#233;tect&#233; pendant la
phase de nettoyage.
</p>
<p>Le lexique obtenu Le lexique obtenu contient 35 914 entr&#233;es intensionnelles (de niveau lemme) qui
produisent 524 700 entr&#233;es extensionnelles (de niveau forme) pour 494 488 formes distinctes. Quelques
informations compl&#233;mentaires sur la distribution par partie du discours sont fournies &#224; la table 1.
</p>
<p>Partie du discours entr&#233;es intensionnelles lemmes distincts entr&#233;es extensionnelles
verbes 171 139 19 776
</p>
<p>noms communs 9 553 9 106 177 988
noms propres 10 996 10 938 33 076
adjectifs 11 872 11 835 290 537
autres 3 322 3 120 3 323
total 35 914 33 454 524 700
</p>
<p>TAB. 1 &#8211; Donn&#233;es quantitatives sur PerLex
</p>
<p>7 Traitements de surface pour le persan
</p>
<p>SXPipe Dans (Sagot &amp; Boullier, 2008), les auteurs pr&#233;sentent SXPipe, une cha&#238;ne multilingue de traite-
ments de surface qui prend en entr&#233;e des textes bruts. SXPipe, originellement d&#233;velopp&#233; pour le fran&#231;ais,
a &#233;t&#233; &#233;tendu depuis &#224; d&#8217;autres langues. Avant les travaux rapport&#233;s ici, et outre le fran&#231;ais, SXPipe trai-
tait &#224; des degr&#233;s divers l&#8217;espagnol, l&#8217;anglais, le n&#233;erlandais, le polonais, le slovaque et l&#8217;italien. SXPipe
</p>
<p>11Le blanc soulign&#233; (_) indique un espace de longueur nulle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BENO&#206;T SAGOT, G&#201;RALDINE WALTHER
</p>
<p>est utilis&#233; pour le fran&#231;ais en pr&#233;liminaire &#224; divers analyseurs syntaxiques, mais &#233;galement pour diverses
langues en tant que tel, par exemple pour la d&#233;tection d&#8217;entit&#233;s nomm&#233;es, la correction et normalisation de
textes ou la d&#233;tection et l&#8217;attribution de citations verbatim.
</p>
<p>Le traitement d&#8217;un corpus par SXPipe peut se d&#233;composer en six &#233;tapes principales : (1) normalisation
typographique du corpus (p.ex. gestion des encodages) ; (2) reconnaissance de certaines entit&#233;s nomm&#233;es
de surface dans le texte brut (URL, dates, nombres en chiffre, adresses. . .) ; (3) d&#233;coupage du texte brut en
tokens et en phrases ; (4) reconnaissance de certaines entit&#233;s nomm&#233;es au niveau des tokens (s&#233;quences en
langue &#233;trang&#232;re. . .) ; (5) regroupement non-d&#233;terministe des tokens en formes (correction orthographique
et traitement des compos&#233;s et des amalgames), qui r&#233;sulte en un graphe de formes (outil TEXT2DAG) ;
(6) reconnaisance de certaines entit&#233;s nomm&#233;es au niveau du graphe de formes (nombres en toutes lettres,
noms de personnes, de lieux, d&#8217;organisations. . .).
</p>
<p>Traitement du persan dans SXPipe Jusqu&#8217;&#224; pr&#233;sent, SXPipe ne g&#233;rait que des langues utilisant des
variantes de l&#8217;alphabet latin. Nous avons donc adapt&#233; SXPipe, notamment au niveau de l&#8217;&#233;tape 1 et en ra-
joutant une &#233;tape &#224; la fin de la cha&#238;ne, pour qu&#8217;il soit en mesure de traiter les langues utilisant des variantes
de l&#8217;alphabet arabe. En particulier, nous avons ajout&#233; au d&#233;but de l&#8217;&#233;tape 1 les outils de normalisation
&#233;voqu&#233;s &#224; la section 3.1. Nous avons &#233;galement ins&#233;r&#233; dans la cha&#238;ne notre outil de translitt&#233;ration afin de
permettre aux modules qui en ont besoin de traiter un texte au format 8-bit. C&#8217;est notamment le cas de
TEXT2DAG, dont nous avons compil&#233; une version pour le persan &#224; partir de PerLex et de r&#232;gles (pond&#233;r&#233;es)
de correction orthographique dont certaines sont sp&#233;cifiquement adapt&#233;es &#224; cette langue.12 En revanche,
aucun travail d&#8217;adaptation des diff&#233;rents modules de reconnaissance des entit&#233;s nomm&#233;es n&#8217;a encore &#233;t&#233;
effectu&#233;. Seuls les nombres &#233;crits en chiffres sont reconnus, par le simple fait que la translitt&#233;ration de
nombres &#233;crits en persan donne pr&#233;cis&#233;ment des nombres similaires &#224; ceux rencontr&#233;s en fran&#231;ais, qui
sont donc reconnus par le module correspondant.
</p>
<p>&#201;valuer la couverture de PerLex L&#8217;outil de correction orthographique et de reconnaissance des amal-
games et des compos&#233;s ainsi construit pour le persan permet de faire la diff&#233;rence entre un token qui est
un vrai &#8220;mot inconnu&#8221; et un token qui ne correspond pas &#224; une forme connue du lexique mais que l&#8217;on
peut analyser comme des amalgames de formes connues du lexique. Ainsi, nous avons pu &#233;valuer le taux
de couverture de PerLex sur un corpus de taille importante. Nous avons pour cela converti le corpus Bi-
janKhan original en un corpus &#171; brut &#187;, en reconstituant les phrases &#224; partir des mots qui les composent, et
en recollant les signes de ponctuation aux mots qui les pr&#233;c&#232;dent. Nous avons ensuite essay&#233; de distinguer
les tokens analysables, les tokens contenant des imperfections typographiques r&#233;siduelles et les tokens
correspondant vraiment &#224; des mots inconnus. L&#8217;estimation que nous obtenons est la suivante : 97,0% de
couverture (96,2% de tokens analysables et 0,8% de tokens corrigibles en tokens analysables par normali-
sation typographique), et 3% de tokens hors couverture.
</p>
<p>8 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; la premi&#232;re version de PerLex, un lexique morphologique du persan &#224; large couver-
ture, ainsi qu&#8217;une version persane de la cha&#238;ne de traitements de surface SXPipe. PerLex est distribu&#233; sous
</p>
<p>12Aucune &#233;valuation de ce correcteur orthographique n&#8217;a pu &#234;tre effectu&#233;e pour l&#8217;instant.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LEXIQUE MORPHOLOGIQUE ET TRAITEMENTS DE SURFACE POUR LE PERSAN
</p>
<p>license libre LGPL-LR sur la page internet du projet Alexina13. SXPipe est distribu&#233; sous license libre
LGPL, en tant que sous-projet de la Cha&#238;ne Linguistique Alpage, par exemple sur la page de ce projet14.
</p>
<p>Pour l&#8217;instant, le lexique PerLex est uniquement morphologique et n&#233;cessite une validation manuelle com-
pl&#232;te, qui est actuellement en cours au sein du projet franco-allemand ANR/DFG PerGram. En parall&#232;le,
l&#8217;ajout des informations syntaxiques (y compris les cadres de sous-cat&#233;gorisation) est en cours sur les en-
tr&#233;es pour les verbes simples. Les autres cat&#233;gories devront voir &#233;galement leurs entr&#233;es compl&#233;t&#233;es par
des informations syntaxiques. Par ailleurs, PerLex sera &#233;tendu &#224; la description du ph&#233;nom&#232;ne des pr&#233;dicats
verbaux complexes, important en Persan. Ces deux t&#226;ches seront r&#233;alis&#233;es en tout ou partie au moyen de
techniques automatiques d&#233;j&#224; utilis&#233;es pour le d&#233;veloppement d&#8217;autres lexiques Alexina (Nicolas et al.,
2008), puis suivies d&#8217;&#233;tapes de validation manuelle.
</p>
<p>Quant &#224; la cha&#238;ne de traitements de surface SXPipe, elle n&#8217;effectue sur le persan qu&#8217;une partie des t&#226;ches
disponibles pour d&#8217;autres langues, &#224; savoir la normalisation typographique, la romanisation (si demand&#233;e),
la reconnaissance d&#8217;un nombre tr&#232;s limit&#233; de types d&#8217;entit&#233;s nomm&#233;es et la correction orthographique et
reconnaissance des mots compos&#233;s. Les entit&#233;s nomm&#233;es plus standard (noms de personnes, de lieux,
d&#8217;organisations, mais &#233;galement dates, adresses, etc.) devront &#234;tre g&#233;r&#233;es. Mais SXPipe constitue d&#233;j&#224; une
cha&#238;ne viable, que nous comptons compl&#233;ter par l&#8217;&#233;tiqueteur morphosyntaxique MElt (Denis &amp; Sagot,
2009) entra&#238;n&#233; sur le corpus BijanKhan et coupl&#233; avec PerLex. Ceci permettra d&#8217;am&#233;liorer le lexique
morphologique PerLex au moyen de techniques telles que d&#233;crites par exemple dans (Nicolas et al., 2008).
</p>
<p>R&#233;f&#233;rences
</p>
<p>AMIRI H., HOJJAT H. &amp; OROUMCHIAN F. (2007). Investigation on a Feasible Corpus for Persian POS
tagging. In Proceedings of the 12th International CSI Computer Conference (CSICC).
</p>
<p>AMTRUP J. W., RAD H. M., MEGERDOOMIAN K. &amp; ZAJAC R. (2000). Persian-English Machine
Translation : An Overview of the Shiraz Project. Memoranda in Computer and Cognitive Science MCCS-
00-319, NMSU, CRL.
</p>
<p>BIJANKHAN M. (2004). The Role of the Corpus in Writing a Grammar : An Introduction to a Software.
Iranian Journal of Linguistics, 19(2).
DANLOS L. &amp; SAGOT B. (2008). Constructions pronominales dans dicovalence et le lexique-
grammaire &#8212; int&#233;gration dans le Lefff . In Proceedings of the 27th Lexicon-Grammar Conference,
L&#8217;Aquila, Italie.
</p>
<p>DEHDARI J. &amp; LONSDALE D. (2008). A Link Grammar Parser for Persian. In S. KARIMI, V. SAMIIAN
&amp; D. STILO, Eds., Aspects of Iranian Linguistics, volume 1. Cambridge Scholars Press.
</p>
<p>DENIS P. &amp; SAGOT B. (2009). Coupling an annotated corpus and a morphosyntactic lexicon for state-
of-the-art POS tagging with less human effort. In Proceedings of PACLIC 2009, Hong Kong.
</p>
<p>FEILI H. &amp; GHASSEM-SANI G. (2004). An Application of Lexicalized Grammars in English-Persian
Translation. In Proceedings of the 16th European Conference on Artificial Intelligence (ECAI 2004),
Valence, Spain.
</p>
<p>FRANCOPOULO G., GEORGE M., CALZOLARI N., MONACHINI M., BEL N., MANDY PET &amp; SORIA
C. (2006). Lexical Markup Framework (LMF). In Proceedings of LREC&#8217;06, G&#234;nes, Italie.
13http://alexina.gforge.inria.fr
14http://lingwb.gforge.inria.fr</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BENO&#206;T SAGOT, G&#201;RALDINE WALTHER
</p>
<p>HAFEZI M. M. (2004). A Syntactic Parser of Persian Sentences. In Proceedings of the 1st Workshop of
the Persian Language and Computer, T&#233;h&#233;ran, Iran.
</p>
<p>LAZARD G., RICHARD Y., HECHMATI R. &amp; SAMVELIAN P. (2006). Grammaire du persan contempo-
rain. T&#233;h&#233;ran, Iran : Institut Fran&#231;ais de Recherche en Iran &amp; Farhang Moaser Edition.
</p>
<p>MEGERDOOMIAN K. (2000). Unification-Based Persian Morphology. In A. GELBUKH, Ed., Procee-
dings of CICLing 2000, Mexico, Mexique.
</p>
<p>MEGERDOOMIAN K. (2004). Finite-state morphological analysis of Persian. In Proceedings of the
CoLing Workshop on Computational Approaches to Arabic Script-based Languages, Gen&#232;ve, Suisse.
</p>
<p>NICOLAS L., SAGOT B., MOLINERO M. A., FARR&#201; J. &amp; VILLEMONTE DE LA CLERGERIE &#201;. (2008).
Computer aided correction and extension of a syntactic wide-coverage lexicon. In Proceedings of CO-
LING&#8217;08, Manchester, Royaume-Uni.
</p>
<p>QASEMIZADEH B. &amp; RAHIMI S. (2006). Persian in MULTEXT-East Framework. In FinTAL, p. 541&#8211;
551.
</p>
<p>SAEDI C., MOTAZADI Y. &amp; SHAMSFARD M. (2009). Automatic Translation between English and
Persian Texts. In Proceedings of the Third Workshop on Computational Approaches to Arabic Script-
based Languages, Ottawa, Ontario, Canada.
</p>
<p>SAGOT B. (2005). Automatic acquisition of a Slovak lexicon from a raw corpus. In Lecture Notes in
Artificial Intelligence 3658, Proceedings of TSD&#8217;05, p. 156&#8211;163, Karlovy Vary, R&#233;publique Tch&#232;que :
Springer-Verlag.
</p>
<p>SAGOT B. (2007). Building a morphosyntactic lexicon and a pre-syntactic processing chain for Polish.
In Proceedings of the 3rd Language &amp; Technology Conference, p. 423&#8211;427, Poznan&#769;, Pologne.
</p>
<p>SAGOT B. (2010). The Lefff , a freely available, accurate and large-coverage lexicon for French. In
Proceedings of the 7th Language Resource and Evaluation Conference, La Valette, Malte. &#192; para&#238;tre.
</p>
<p>SAGOT B. &amp; BOULLIER P. (2008). SXPipe 2 : architecture pour le traitement pr&#233;syntaxique de corpus
bruts. Traitement Automatique des Langues (T.A.L.), 49(2), 155&#8211;188.
SAGOT B., CL&#201;MENT L., DE LA CLERGERIE E. &amp; BOULLIER P. (2006). The Lefff 2 syntactic lexicon
for French : architecture, acquisition, use. In Proceedings of the 5th Language Resource and Evaluation
Conference, Lisbonne, Portugal.
</p>
<p>SAGOT B. &amp; WALTHER G. (2010). A Morphological Lexicon for the Persian Language. In Proceedings
of LREC 2010), La Valette, Malte. &#192; para&#238;tre.
</p>
<p>SAMVELIAN P. (2007). A phrasal affix analysis of the Persian Ezafe. Journal of Linguistics, 43(3),
605&#8211;645.
</p>
<p>SHAMSFARD M. &amp; FADAEE H. (2008). A Hybrid Morphology-Based POS Tagger for Persian. In
Proceedings of the 6th Language Resources and Evaluation Conference, Marrakech, Maroc.
</p>
<p>TASHAROFI S., RAJA F., OROUMCHIAN F. &amp; RAHGOZAR M. (2007). Evaluation of Statistical Part of
Speech Tagging of Persian Text. In International Symposium on Signal Processing and its Applications,
Sharjah, E.A.U.
</p>
<p>WALTHER G. &amp; SAGOT B. (2010). Developing a Large-Scale Lexicon for a Less-Resourced Language :
General Methodology and Preliminary Experiments on Sorani Kurdish. In Proceedings of the 7th SaLT-
MiL Workshop on Creation and use of basic lexical resources for less-resourced languages (LREC 2010
Workshop), La Valette, Malte. &#192; para&#238;tre.</p>

</div></div>
</body></html>