<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Ponctuations fortes abusives</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Ponctuations fortes abusives
</p>
<p>Laurence Danlos &amp; Beno&#238;t Sagot
Alpage, INRIA Paris&#8211;Rocquencourt &amp; Universit&#233; Paris 7
Rocquencourt, BP 105, 78153 Le Chesnay Cedex, France
laurence.danlos@linguist.jussieu.fr, benoit.sagot@inria.fr
</p>
<p>R&#233;sum&#233;. Certaines ponctuations fortes sont &#171; abusivement &#187; utilis&#233;es &#224; la place de ponctuations
faibles, d&#233;bouchant sur des phrases graphiques qui ne sont pas des phrases grammaticales. Cet article
pr&#233;sente une &#233;tude sur corpus de ce ph&#233;nom&#232;ne et une &#233;bauche d&#8217;outil pour rep&#233;rer automatiquement les
ponctuations fortes abusives.
</p>
<p>Abstract. Some strong punctuation signs are &#8220;wrongly&#8221; used instead of weak punctuation signs,
leading to graphic sentences which are not grammatical sentences. This paper presents a corpus study of
this phenomenon and a tool in the early stages to automatically detect wrong strong punctuation signs.
</p>
<p>Mots-cl&#233;s : pseudo-phrase, phrase averbale, analyse syntaxique et s&#233;mantique.
</p>
<p>Keywords: pseudo-sentence, verbless utterance, syntactic and semantic analysis.
</p>
<p>1 Introduction
</p>
<p>Pratiquement tout syst&#232;me de TAL pour l&#8217;&#233;crit commence par une segmentation en phrases du texte &#224;
traiter, segmentation qui s&#8217;appuie entre autres sur les ponctuations fortes1. Les phrases ainsi obtenues,
qualifi&#233;es de graphiques, ne correspondent pas toujours &#224; des phrases grammaticales2. Citons (Grevisse,
2007, page 124) : &#171; Les &#233;crivains contemporains emploient parfois le point (au lieu de la virgule) pour
d&#233;tacher de la phrase un membre auquel ils veulent donner un relief particulier &#187;. Grevisse illustre ce
ph&#233;nom&#232;ne par l&#8217;exemple donn&#233; en (1).
</p>
<p>(1) On avait donn&#233; dans le Nord un grand coup de pied dans la fourmili&#232;re, et les fourmis s&#8217;en allaient. Laborieu-
sement. Sans panique. Sans espoir. Sans d&#233;sespoir. Comme par devoir. [Saint Exup&#233;ry, Pilote de guerre]
</p>
<p>C&#8217;est ce ph&#233;nom&#232;ne, que nous appelons (abusivement) &#171; ponctuation forte abusive &#187;, qui est &#233;tudi&#233; dans
cet article3. Nous appelons &#171; pseudo-phrase &#187; une phrase pr&#233;c&#233;d&#233;e d&#8217;une ponctuation forte abusive. Ainsi
(1) encha&#238;ne cinq pseudo-phrases (de type adverbial). Notre objectif &#224; terme est de mettre au point un outil
</p>
<p>1Les ponctuations fortes sont le point, les points d&#8217;interrogation et d&#8217;exclamation, le point-virgule et les points de suspension
et les deux-points.
</p>
<p>2La notion de phrase grammaticale varie selon les th&#233;ories. Nous n&#8217;entrerons pas dans une discussion sur ce sujet, nous
contentant de consid&#233;rer en premi&#232;re approximation que cette notion correspond &#224; celle &#171; d&#8217;unit&#233; rectionnelle &#187; introduite dans
(Berrendonner, 2002) et (Benzitoun et al., 2010).
</p>
<p>3Dans les &#233;tudes sur l&#8217;oral, o&#249; les signes de ponctuation c&#232;dent la place aux marqueurs prosodiques, ce ph&#233;nom&#232;ne corres-
pond grosso modo &#224; &#171; l&#8217;&#233;pex&#233;g&#232;se &#187;, terme introduit dans (Bailly, 1944).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS &amp; BENO&#206;T SAGOT
</p>
<p>de d&#233;tection des pseudo-phrases afin de pouvoir les analyser syntaxiquement et surtout s&#233;mantiquement.
Ainsi en (1), on veut pouvoir dire que l&#8217;adverbe laborieusement porte sur le d&#233;part des fourmis.
</p>
<p>Si les pseudo-phrases sont identifi&#233;es, la prise en compte des ponctuations fortes abusives en vue de l&#8217;ana-
lyse syntaxique et s&#233;mantique peut se faire de fa&#231;on simple : il suffit de r&#233;&#233;tiqueter en ponctuation faible
la ponctuation forte abusive4, puis de &#171; recoller &#187; la pseudo-phrase &#224; la phrase qui la pr&#233;c&#232;de pour obtenir
une phrase grammaticale, dont l&#8217;analyse syntaxique et s&#233;mantique peut se faire de fa&#231;on standard.
</p>
<p>Les pseudo-phrases ne comportant souvent pas de verbe fini5, leur identification pose le probl&#232;me de
les distinguer des &#171; phrases averbales &#187; qui doivent elles recevoir une analyse syntaxique et s&#233;mantique
autonome (modulo les ph&#233;nom&#232;nes anaphoriques) : ce ne sont pas des membres d&#233;tach&#233;s de la phrase
qui pr&#233;c&#232;de, elles n&#8217;occupent aucune fonction syntaxique dans cette phrase. Pour illustrer la difficult&#233; de
distinguer les pseudo-phrases des phrases averbales, consid&#233;rons le paradigme en (2) o&#249; chaque seconde
phrase graphique ne comporte qu&#8217;un GN. En (2a), ce GN occupe la fonction d&#8217;apposition par rapport au
dernier GN de la phrase qui pr&#233;c&#232;de, il s&#8217;agit d&#8217;une pseudo-phrase. En (2b), ce GN n&#8217;a aucune fonction &#224;
l&#8217;int&#233;rieur de la phrase qui pr&#233;c&#232;de, il s&#8217;agit d&#8217;une phrase averbale. (2c) a deux lectures : soit le voyage de
Luc &#233;tait un &#233;chec total &#8212; on a alors affaire &#224; une apposition et &#224; un point abusif &#8212;, soit le r&#233;cit de Luc
&#233;tait un &#233;chec total &#8212; on a alors affaire &#224; une phrase averbale.
</p>
<p>(2) a. [Nous avons &#233;t&#233; oblig&#233;s de vendre une voiture.] Une jeep. [L&#8217;Est R&#233;publicain]
</p>
<p>b. [Nous avons &#233;t&#233; oblig&#233;s de vendre une voiture.] Un &#233;chec total.
</p>
<p>c. [Luc a racont&#233; son voyage en Islande.] Un &#233;chec total.
</p>
<p>Les phrases averbales ont fait l&#8217;objet de nombreuses &#233;tudes, pour le fran&#231;ais citons (Laurens, 2007). En re-
vanche, nous ne connaissons pas de travaux syst&#233;matiques sur les pseudo-phrases et les ponctuations fortes
abusives. Le travail pr&#233;sent&#233; ici est donc une &#233;bauche de l&#8217;&#233;tude de ce ph&#233;nom&#232;ne en vue de son traitement
automatique. Nous sommes partis d&#8217;un corpus, duquel nous avons extrait des phrases graphiques candi-
dates &#224; &#234;tre des pseudo-phrases (Section 2). Une &#233;tude manuelle des r&#233;sultats de cette extraction nous
a permis de proposer une classification automatique des pseudo-phrases en s&#8217;appuyant sur leur forme
(Section 3).
</p>
<p>2 &#201;tude sur corpus
</p>
<p>Nous avons commenc&#233; notre travail sur les ponctuations fortes abusives par une &#233;tude s&#8217;appuyant &#224; la
fois sur des connaissances linguistiques et sur un corpus, afin d&#8217;&#233;tudier la possibilit&#233; de les identifier
automatiquement, et notamment de les diff&#233;rencier des phrases averbales, d&#8217;en &#233;baucher une classification
et de d&#233;terminer leur fr&#233;quence.
</p>
<p>Nous sommes partis d&#8217;un corpus journalistique extrait d&#8217;un quotidien r&#233;gional, L&#8217;Est R&#233;publicain. Le
corpus a &#233;t&#233; pr&#233;alablement segment&#233; en phrases graphiques et tokenis&#233; par la cha&#238;ne de traitements de
surface SXPipe (Sagot &amp; Boullier, 2008)6 puis &#233;tiquet&#233; automatiquement &#224; l&#8217;aide de MElt (Denis &amp; Sagot,
</p>
<p>4Il est important de conserver telle quelle la ponctuation utilis&#233;e et de ne changer que sa cat&#233;gorie, afin de ne pas perdre les
nuances s&#233;mantiques ou pragmatiques apport&#233;es par la ponctuation forte abusive.
</p>
<p>5N&#233;anmoins, certaines pseudo-phrases commencent par une conjonction de subordination ou un pronom relatif et com-
portent au moins un verbe fini. Ces pseudo-phrases, qui constituent la classe CONJ, seront discut&#233;es &#224; la Section 2
</p>
<p>6SXPipe n&#8217;est utilis&#233; ici que comme tokeniseur. Pour reprendre les termes dans lesquels cette cha&#238;ne est d&#233;crite par (Sagot
&amp; Boullier, 2008), seules les deux premi&#232;res des cinq phases de traitement sont appliqu&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PONCTUATIONS FORTES ABUSIVES
</p>
<p>2009). MElt est un &#233;tiqueteur morphosyntaxique entra&#238;n&#233; sur le Corpus Arbor&#233; de Paris 7 (Abeill&#233; et al.,
2003), dans sa variante &#224; 29 &#233;tiquettes telle qu&#8217;utilis&#233;e dans (Candito et al., 2009). Le r&#233;sultat est un
ensemble de 20 millions de tokens, composant 1 212 659 phrases graphiques se terminant par au moins
une ponctuation forte.
</p>
<p>Les phrases qui commencent par une conjonction de subordination7 ou par un pronom relatif, avec &#224;
droite de cet &#233;l&#233;ment au plus un verbe fini, &#233;tant n&#233;cessairement des pseudo-phrases (3a-b), nous les avons
extraites du corpus (par des expressions r&#233;guli&#232;res) et nous les avons class&#233;es dans la Classe CONJ.
Ceci concernait 175 pseudo-phrases. N&#233;anmoins, nous avons affin&#233; nos expressions r&#233;guli&#232;res de fa&#231;on
&#224; int&#233;grer des exemples comme (3c) dans la Classe CONJ tout en &#233;liminant des exemples comme (3d) :
ces phrases comportent deux verbes finis dont le second est la t&#234;te d&#8217;une subordonn&#233;es (relative) en (3c)
et d&#8217;une principale en (3d) &#8212; (3d) est une phrase grammaticale construite sur le patron CONJ P2, P1
avec une subordonn&#233;e ant&#233;pos&#233;e. Les subordonn&#233;es peuvent &#234;tre distingu&#233;es des principales par le fait
qu&#8217;elles commencent par un &#233;l&#233;ment de la classe SUB comprenant les pronoms relatifs, les conjonctions
de subordination et le compl&#233;menteur que.
</p>
<p>(3) a. [Dimanche, je ferai un dessin et je marquerai dessus : bonne f&#234;te maman.] Parce que ma maman c&#8217;est la
plus jolie. . .
</p>
<p>b. [Qui ont &#233;t&#233; contr&#244;l&#233;s m&#234;me si non am&#233;nag&#233;s.] Parce que fr&#233;quent&#233;s.
</p>
<p>c. [Et il compte fort sur le Vosgien pour amener plus de service aux h&#244;teliers ind&#233;pendants.] Tandis que
Michel Philippe prend la t&#234;te de l&#8217;association r&#233;gionale de l&#8217;Est de la France, qui compte quarante &#233;tablis-
sements.
</p>
<p>d. [Son &#339;uvre est plus proche de la peinture.] Parce que la pagination est importante, le livre est d&#233;coup&#233; en
chapitres (...).
</p>
<p>Ayant &#233;cart&#233; les phrases de la classe CONJ de notre corpus, nous avons alors extrait toutes les phrases qui
ne comportaient pas de verbe fini ou qui comportaient un verbe fini apparaissant &#224; droite d&#8217;un &#233;l&#233;ment de
la classe SUB (et donc un verbe fini t&#234;te d&#8217;une subordonn&#233;e). Un examen manuel du sous-corpus obtenu
nous a permis de d&#233;limiter et d&#8217;&#233;carter quatre sous-ensembles :
</p>
<p>&#8211; les phrases qui, &#224; cause d&#8217;erreurs de l&#8217;&#233;tiqueteur MElt, comportaient un verbe fini ; c&#8217;est en particulier
le cas pour les phrases comportant certains imp&#233;ratifs ;
</p>
<p>&#8211; les phrases commen&#231;ant par un nombre ou contenant un deux-points qui correspondent presque toutes &#224;
des &#233;num&#233;rations (r&#233;sultats sportifs ou &#233;lectoraux) ; nous avons consid&#233;r&#233; de telles phrases comme non
pertinentes pour l&#8217;&#233;tude ;
</p>
<p>&#8211; les phrases dont la phrase pr&#233;c&#233;dente se termine par un point d&#8217;interrogation ou un point-virgule, que
nous r&#233;servons pour une &#233;tude ult&#233;rieure plus approfondie ;
</p>
<p>&#8211; les phrases qui sont clairement des phrases averbales, &#224; savoir :
&#8211; celles commen&#231;ant par une forme fl&#233;chie du lex&#232;me quel, ou par des s&#233;quences de mots particuli&#232;res
telles que gare &#224;, au programme, en avant, bon anniversaire. . . ;
</p>
<p>&#8211; celles de la forme N ADJ ou ADJ N ; en effet, nous faisons l&#8217;hypoth&#232;se que les pseudo-phrases qui
ne comportent qu&#8217;un GN incluent toutes un d&#233;terminant pr&#233;fixant le GN, comme en (2a), et que donc
les phrases de forme N ADJ ou ADJ N sont des phrases averbales. Cette hypoth&#232;se est justifi&#233;e par
</p>
<p>7Nous avons utilis&#233; la liste des conjonctions de subordination dress&#233;e dans le lexique LEXCONN (Roze et al., 2010) dont
nous avons enlev&#233; certains &#233;l&#233;ments (preuve/pourvu que) qui introduisent des phrases averbales lorsque pr&#233;c&#233;d&#233;s d&#8217;une ponc-
tuation forte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS &amp; BENO&#206;T SAGOT
</p>
<p>les faits suivants : le d&#233;terminant est obligatoire dans la pseudo-phrase (2a), facultatif dans la phase
averbale (2b), et (2c) sans d&#233;terminant n&#8217;a que la lecture averbale8.
</p>
<p>Le r&#233;sultat est un corpus de 9 276 phrases graphiques candidates &#224; &#234;tre des pseudo-phrases (Classe CONJ
exclue). Il reste donc &#224; distinguer parmi ces candidates lesquelles correspondent effectivement &#224; des
pseudo-phrases, et &#224; classer ces derni&#232;res. Pour mener &#224; bien ce travail, nous avons associ&#233; &#224; toute phrase
candidate la phrase qui pr&#233;c&#232;de.
</p>
<p>3 Classification des pseudo-phrases
</p>
<p>Suite &#224; un premier examen manuel du corpus de phrases candidates, nous les avons class&#233;es automatique-
ment en fonction des tests suivants appliqu&#233;s s&#233;quentiellement :
</p>
<p>Classe COORD : le premier mot est l&#8217;une des conjonctions de coordination suivantes : et, ou, mais, car,
puis (590 candidats) ;
</p>
<p>Classe PR&#201;P : la phrase candidate commence par un syntagme pr&#233;positionnel (1 232 candidats) ;
Classe PAS : la phrase candidate commence par le mot pas (202 candidats) ;
Les phrases restantes sont rassembl&#233;es dans une classe par d&#233;faut (Classe RESTE).
</p>
<p>Classe COORD Les phrases de cette classe sont quasiment toutes des pseudo-phrases, sauf certaines
familles :
&#8211; celles comme Et pour cause, Mais au contraire, Et pourtant ;
&#8211; des exclamatives en ConjCoo+quel, comme Et quel suspens ! ou Mais quelle efficacit&#233; lorsqu&#8217;il s&#8217;agit
</p>
<p>de brouter la pelouse sans effort (. . .) ;
&#8211; la tournure et+GN de type Et la solidarit&#233;, chauffard ! ;
&#8211; quelques cas particuliers comme Et aujourd&#8217;hui, place au jeu.
Les pseudo-phrases trouv&#233;es sont coordonn&#233;es avec un premier terme dans la phrase pr&#233;c&#233;dente qui est
g&#233;n&#233;ralement situ&#233; &#224; la fin de la phrase pr&#233;c&#233;dente et qui occupe des fonctions diverses, telles qu&#8217;objet
direct (4a), objet indirect (4b), compl&#233;ment oblique (4c), modifieur (4d).
(4) a. [Des d&#233;fis qui engagent son avenir.] Et son devenir.
</p>
<p>b. [Les enfants n&#8217;ont jamais manqu&#233; de rien.] Et surtout pas d&#8217;amour.
</p>
<p>c. [C&#8217;est essentiel pour sa renomm&#233;e.] Et pour les retomb&#233;es li&#233;es au tourisme.
</p>
<p>d. [La communaut&#233; de communes (. . .) [invite] le public &#224; venir nombreux &#224; ce spectacle extraordinaire.] Et
enti&#232;rement gratuit.
</p>
<p>Classe PR&#201;P Dans leur majorit&#233;, les phrases de cette classe sont bien des pseudo-phrases. On trouve
cependant un certain nombre de phrases averbales (5). On constate que la plupart d&#8217;entre elles sont
construites sur le mod&#232;le GP, GN &#8212; qui pourrait &#234;tre filtr&#233; automatiquement.
</p>
<p>(5) a. Apr&#232;s les cravates, les shorts.
</p>
<p>8Citons quelques phrases averbales de forme N ADJ trouv&#233;es dans le corpus : entr&#233;e libre, d&#233;paysement garanti, inscription
gratuite, pari tenu, peine perdue, mission accomplie, frissons garantis. Et quelques phrases averbales de forme ADJ N : joli
coup, triste journ&#233;e, vaste programme, s&#233;v&#232;re constat, mauvais pr&#233;sage, sacr&#233;e soir&#233;e, vaste d&#233;bat, bel objectif.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PONCTUATIONS FORTES ABUSIVES
</p>
<p>b. Chez les v&#233;t&#233;rans, sc&#233;nario inverse.
</p>
<p>Les pseudo-phrases de la Classe PR&#201;P sont principalement des compl&#233;ments obliques, des compl&#233;ments
locatifs, des arguments nominaux ou des adjoints (6). Nous n&#8217;avons pas trouv&#233; d&#8217;exemple d&#8217;objet indirect.
</p>
<p>(6) a. [La jeune togolaise a travaill&#233; quatre ans.] Sans salaire.
</p>
<p>b. [L&#8217;ASGE a d&#233;sormais une histoire.] Avec ses joies, multiples.
</p>
<p>c. [Un patrimoine dont on devrait tous &#234;tre les h&#233;ritiers.] Sans exception.
</p>
<p>d. [D&#232;s maintenant, la mobilisation est de mise.] Pour l&#8217;amour des mots.
</p>
<p>e. [Dominique va vivre ensuite un grand blanc.] De cinq ans.
</p>
<p>Classe PAS La majorit&#233; des exemples de cette classe sont ici aussi des pseudo-phrases (8). On trouve
cependant un certain nombre de phrases averbales (7). Certaines d&#8217;entre elles sont relativement fig&#233;es, ou
d&#233;butent par une locution fig&#233;e (7b).
</p>
<p>(7) a. Pas de probl&#232;me.
</p>
<p>b. Pas question que nos chauffeurs fassent les malins.
</p>
<p>(8) a. [(...) dit le r&#233;alisateur Chilien, qui tient &#224; garder de son pays la nationalit&#233; et l&#8217;accent.] Pas les mauvais
souvenirs.
</p>
<p>b. [Et suscite d&#233;j&#224; des commentaires.] Pas franchement chaleureux.
</p>
<p>c. [(...) rien ne manquait.] Pas m&#234;me le bruit des vagues, ni les cris des mouettes et des cormorans.
</p>
<p>Classe RESTE Certaines phrases de cette classe sont clairement des pseudo-phrases, par exemple celles
qui commencent par une forme fl&#233;chie de celui (9a), ou encore celles compos&#233;es d&#8217;un adverbe (voir labo-
rieusement dans (1)). Nous n&#8217;avons pas cr&#233;&#233; de classes pour ces exemples parce ils sont peu repr&#233;sent&#233;s
dans notre corpus. D&#8217;autres phrases de cette classe auraient pu &#234;tre identifi&#233;es comme des pseudo-phrases
si l&#8217;&#233;tiqueteur MElt indiquait le genre et le nombre (ce qui n&#8217;est pas le cas &#224; l&#8217;heure actuelle) : il s&#8217;agit de
celles compos&#233;es d&#8217;un GN pluriel (9b) ou d&#8217;un adjectif (&#233;ventuellement pr&#233;c&#233;d&#233; ou suivi d&#8217;un adverbe)
f&#233;minin et/ou pluriel (9c).
</p>
<p>(9) a. [Mais l&#224;, j&#8217;ai fait un dessin et je lui lirai une histoire.] Celle du lapin tout bleu !
</p>
<p>b. [Daniel Kuntz a expliqu&#233; la nature aux &#233;coliers.] Des enfants tr&#232;s attentifs.
</p>
<p>c. [(. . .) les choses sont parfois plus difficiles en zones rurales.] Plus d&#233;licates.
</p>
<p>Pour les phrases compos&#233;es d&#8217;un GN singulier (pr&#233;fix&#233; d&#8217;un d&#233;terminant) &#8212; ou d&#8217;un GAdj masculin sin-
gulier&#8212;, il est d&#233;licat de savoir s&#8217;il s&#8217;agit d&#8217;une pseudo-phrase ou d&#8217;une phrase averbale, car, rappelons-le,
ce cas conduit &#224; des ambigu&#239;t&#233;s telles que celle observ&#233;e en (2c) lorsque la t&#234;te du GN est un nom abs-
trait9. Il semble toutefois que l&#8217;usage permet de classer avec quasi-certitude certains de ces GN comme
des phrases averbales. Citons une excellente initiative, un grand moment, un comble, un bide, un r&#234;ve, une
grande/sale soir&#233;e, un jour inoubliable, une vraie/v&#233;ritable gal&#232;re, un petit r&#233;gal, ou du grand art, la tuile.
</p>
<p>9Lorsque la t&#234;te du GN ne peut d&#233;signer qu&#8217;un objet concret ou un anim&#233;, il s&#8217;agit d&#8217;une pseudo-phrase.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS &amp; BENO&#206;T SAGOT
</p>
<p>La classe RESTE contient toutefois des &#233;l&#233;ments qu&#8217;il semble difficile de classer en pseudo-phrases ou
phrases averbales en s&#8217;appuyant uniquement sur un &#233;tiquetage morpho-syntaxique et sur des expressions
r&#233;guli&#232;res.
</p>
<p>4 Conclusion et perspectives
L&#8217;outil rudimentaire d&#8217;extraction des pseudo-phrases que nous avons mis au point pour cette &#233;tude nous a
permis d&#8217;identifier plusieurs classes de pseudo-phrases (CONJ, COORD, PR&#201;P, PAS) qu&#8217;il semble pos-
sible de d&#233;tecter automatiquement. En effet, les faux positifs identifi&#233;s dans ces classes semblent pouvoir
&#234;tre &#233;cart&#233;s automatiquement au moyen de listes (et pour cause, pas de probl&#232;me), ou &#224; condition de re-
conna&#238;tre certaines structures (par exempleGP, GN), ce qui semble possible &#224; partir d&#8217;un simple &#233;tiquetage
morphosyntaxique. Par cons&#233;quent, le d&#233;veloppement d&#8217;un outil de d&#233;tection des pseudo-phrases (et donc
des ponctuations fortes abusives) qui aurait une bonne pr&#233;cision semble accessible. Toutefois, le rappel
d&#8217;un tel outil ne serait probablement pas aussi bon (cf. Classe RESTE).
</p>
<p>Une autre piste &#224; explorer consiste &#224; rep&#233;rer les pseudo-phrases apr&#232;s l&#8217;analyse syntaxique des phrases gra-
phiques et &#224; calculer les liens de d&#233;pendances syntaxico-s&#233;mantiques qui les relient &#224; la phrase pr&#233;c&#233;dente.
L&#8217;&#233;valuation d&#8217;une telle approche demande d&#8217;enrichir des corpus de r&#233;f&#233;rence tels que le Corpus arbor&#233;
de Paris 7 (Abeill&#233; et al., 2003) par des annotations sur les pseudo-phrases. Ces annotations manquent &#224;
l&#8217;heure actuelle, le ph&#233;nom&#232;ne de ponctuation forte abusive ayant &#233;t&#233; ignor&#233; dans la communaut&#233; TAL.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A., CL&#201;MENT L. &amp; TOUSSENEL F. (2003). Building a treebank for French. In A. ABEILL&#201;,
Ed., Treebanks. Kluwer, Dordrecht.
BAILLY C. (1944). Linguistique G&#233;n&#233;rale et linguistique fran&#231;aise (2&#232;me &#233;dition). Berne : Francke.
BENZITOUN C., DISTER A., K K. G., KAHANE S., PIETRANDREA P. &amp; F F. S. (2010). tu veux couper
l&#224; faut dire pourquoi propositions pour une segmentation syntaxique du fran&#231;ais parl&#233;. In Actes de CMLF
2010), La Nouvelle Orl&#233;ans, USA.
BERRENDONNER A. (2002). Les deux syntaxes. In M. CHAROLLES, P. L. GOFFIC &amp; M.-A. MOREL,
Eds., Y a-t-il une syntaxe au- del&#224; de la phrase ?, p. 23&#8211;36. Verbum, 24 (1-2).
CANDITO M., CRABB&#201; B. &amp; SEDDAH D. (2009). On statistical parsing of french with supervised and
semi-supervised strategies. In Proceedings of the EACL 2009 workshop : Grammatical Inference for
computational linguistics, Athens, Greece.
DENIS P. &amp; SAGOT B. (2009). Coupling an annotated corpus and a morphosyntactic lexicon for state-
of-the-art POS tagging with less human effort. In Proceedings of PACLIC 2009, Hong Kong.
GREVISSE M. (2007). Le Bon Usage (14&#232;me &#233;dition par Andr&#233; Goose). Paris-Louvain la Neuve :
Duculot.
LAURENS F. (2007). Analyse et formalisation des types de phrases averbales du fran&#231;ais. M&#233;moire de
Master, Universit&#233; Paris 7.
ROZE C., DANLOS L. &amp; MULLER P. (2010). LEXCONN : a french lexicon of discourse connectives.
In Proceedings of Multidisciplinary Approaches to Discourse (MAD 2010), Moissac, France.
SAGOT B. &amp; BOULLIER P. (2008). SXPipe 2 : architecture pour le traitement pr&#233;syntaxique de corpus
bruts. Traitement Automatique des Langues (T.A.L.), 49(2), 155&#8211;188.</p>

</div></div>
</body></html>