<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Restrictions de s&#233;lection et r&#233;alisations syntagmatiques dans DICOVALENCE Conversion vers un format utilisable en TAL</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Restrictions de s&#233;lection et r&#233;alisations syntagmatiques dans DICOVALENCE 
Conversion vers un format utilisable en TAL 
</p>
<p>Piet Mertens 
 
</p>
<p>D&#233;partement de Linguistique, Universit&#233; de Leuven, Belgique 
Piet.Mertens@arts.kuleuven.be 
</p>
<p> 
</p>
<p>R&#233;sum&#233; Cet article d&#233;crit des modifications du dictionnaire de valence des verbes du fran&#231;ais 
DICOVALENCE qui visent &#224; le rendre neutre par rapport aux mod&#232;les syntaxiques, &#224; expliciter certaines 
informations sur le cadre de sous-cat&#233;gorisation et &#224; le rendre ainsi directement utilisable en TAL. Les 
informations explicit&#233;es sont les suivantes : (a) les fonctions syntaxiques des arguments verbaux, (b) les 
restrictions de s&#233;lection portant sur ces arguments et (c) leurs r&#233;alisations syntagmatiques possibles. Les 
restrictions sont exprim&#233;es &#224; l&#8217;aide de traits s&#233;mantiques. L&#8217;article d&#233;crit aussi le calcul de ces traits 
s&#233;mantiques &#224; partir des paradigmes des pronoms (et d&#8217;&#233;l&#233;ments similaires) associ&#233;s aux arguments. On 
obtient un format ind&#233;pendant du mod&#232;le syntaxique, dont l&#8217;interpr&#233;tation est transparente. 
</p>
<p>Abstract This paper describes modifications to the verbal valency dictionary for French, known as 
DICOVALENCE, in order to obtain a theory-independent syntactic lexicon, to make explicit certain information 
about the slots in the valency frame, to facilitate the use of the lexicon in natural language processing. The 
modifications make explicit the following aspects: (a) the syntactic function of the slots, (b) the selection 
restrictions on these verbal arguments, (c) their possible phrasal realizations. Selection restrictions are 
expressed using semantic features. The article describes how these features are obtained from the paradigms 
of pronouns (and similar elements) associated with the valency slots. This results in a format which is theory-
independent, with a transparent interpretation. 
</p>
<p>Mots-cl&#233;s :   lexiques syntaxiques, restrictions de s&#233;lection, traits s&#233;mantiques 
Keywords:   lexical databases, selection restrictions, semantic features 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIET MERTENS 
</p>
<p>1 Introduction 
Depuis sa mise &#224; disposition en 2006, le lexique syntaxique DICOVALENCE (Eynde &amp; Mertens 2003) a 
suscit&#233; beaucoup d&#8217;int&#233;r&#234;t dans le domaine du TAL. Certaines &#233;tudes ont compar&#233; les donn&#233;es et les 
approches syntaxiques dans plusieurs lexiques syntaxiques tels que le Lexique-Grammaire (les tables du 
LADL, Lecl&#232;re 1990), DICOVALENCE, Synlex (Gardent et al. 2006) et le Lefff (Sagot et al. 2006). 
DICOVALENCE a &#233;t&#233; utilis&#233; comme r&#233;f&#233;rence pour valider l&#8217;acquisition automatique des cadres de sous-
cat&#233;gorisation (Falk et al. 2007, Gardent 2009). Il a &#233;t&#233; utilis&#233; pour valider et compl&#233;ter les informations 
dans d&#8217;autres lexiques, tel le Lefff (Danlos &amp; Sagot 2007a, 2007b; Sagot &amp; Danlos 2007). Il a &#233;t&#233; int&#233;gr&#233; 
dans des analyseurs syntaxiques pour le fran&#231;ais, mettant en &#339;uvre des approches syntaxiques vari&#233;es 
(Mertens 2008,  Nasr &amp; B&#233;chet 2009).  
Dans les travaux mentionnant DICOVALENCE, certaines critiques reviennent &#224; plusieurs reprises (Falk et al. 
2007, Kup&#347;&#263; &amp; Abeill&#233; 2008, Messiant et al. 2008, Nasr &amp; B&#233;chet 2009). D&#8217;abord, DICOVALENCE ne 
renseignerait pas sur les r&#233;alisations syntagmatiques possibles des arguments verbaux. Ensuite, 
l&#8217;information dans DICOVALENCE ne serait pas directement utilisable en TAL. Enfin DICOVALENCE serait 
d&#233;pendant du mod&#232;le syntaxique de l&#8217;approche pronominale, ce qui limiterait son utilisation. La plupart de 
ces critiques sont &#233;videmment li&#233;es. Comme le montrera cette &#233;tude, elles reposent le plus souvent sur une 
connaissance limit&#233;e de l&#8217;approche en question. (Falk et al. 2007) soul&#232;vent les questions de la couverture 
du dictionnaire, de son rappel et sa pr&#233;cision inconnues. Rappelons que les m&#233;thodes d&#8217;acquisition 
automatique actuelles amalgament les diff&#233;rents emplois d&#8217;un m&#234;me verbe, ce qui pose &#233;videmment des 
probl&#232;mes de rappel et de pr&#233;cision nettement plus graves. 
</p>
<p>La pr&#233;sente &#233;tude vise plusieurs objectifs : (1) de pr&#233;ciser sous quelle forme les informations (fonctions 
syntaxiques, r&#233;alisations syntagmatiques&#8230;) sont r&#233;pertori&#233;es dans DICOVALENCE et comment on peut les 
expliciter, (2) d&#8217;exploiter les paradigmes de pronoms pour calculer certains traits s&#233;mantiques fonctionnant 
comme des restrictions s&#233;lectionnelles, (3) de fournir un nouveau format de DICOVALENCE qui rend 
explicites tous ces aspects, et qui soit directement utilisable en TAL. La mise en &#339;uvre des lexiques 
syntaxiques les plus riches suppose en effet leur conversion pr&#233;alable (Constant &amp; Tolone 2008). 
</p>
<p>2 Rappel de quelques notions syntaxiques utilis&#233;es dans DICOVALENCE 
</p>
<p>2.1 Le cadre valenciel 
</p>
<p>L&#8217;ensemble des &#233;l&#233;ments r&#233;gis par un verbe constitue sa rection. Celle-ci regroupe les &#233;l&#233;ments valenciels 
(le sujet et les compl&#233;ments essentiels), les circonstants (de mani&#232;re, de temps, de lieu, de raison, etc.), des 
&#233;l&#233;ments de n&#233;gation (&#171; ne, pas, point... &#187;) et des &#233;l&#233;ments sans fonction s&#233;mantique, comme &#171; en &#187; dans 
&#171; elle lui en veut &#233;norm&#233;ment &#187;. Les constituants syntaxiques correspondent le plus souvent &#224; des 
arguments s&#233;mantiques, mais pas toujours : dans &#171; il pleut &#187; ou &#171; il s&#8217;agit de d&#233;cider &#187;, le sujet syntaxique 
&#171; il &#187; (dit impersonnel) n&#8217;a pas de fonction s&#233;mantique, ni de r&#244;le th&#233;matique, il ne fonctionne pas comme 
agent ou r&#233;f&#233;rent. 
</p>
<p>Le cadre valenciel ou cadre de sous-cat&#233;gorisation d&#233;signe l&#8217;ensemble des d&#233;pendants valenciels d&#8217;un 
verbe dans un emploi donn&#233;. Un m&#234;me lemme peut pr&#233;senter plusieurs emplois, chacun avec son propre 
cadre valenciel, comme dans les exemples suivants. 
</p>
<p>Il ne manifeste jamais ses vrais sentiments. 
Cette expression manifeste un d&#233;dain r&#233;el. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESTRICTIONS DE SELECTION  
Aucun candidat ne s&#8217;est manifest&#233; pour ce poste. 
Les &#233;tudiants manifestent pour la r&#233;duction des gaz &#224; effet de serre. 
</p>
<p>Le cadre valenciel comporte des places valencielles, appel&#233;es parfois positions, ou encore paradigmes dans 
l&#8217;approche pronominale et dans le DICOVALENCE. Dans cette derni&#232;re approche les cadres valenciels sont 
d&#233;finis sur base de crit&#232;res distributionnels, plut&#244;t que sur une base s&#233;mantique. Dans DICOVALENCE les 
&#233;ventuels d&#233;pendants sans statut s&#233;mantique sont indiqu&#233;s en dehors du cadre valenciel, par leur nom.  
</p>
<p>2.2 Les fonctions syntaxiques 
</p>
<p>Dans les lexiques syntaxiques, les places du cadre valenciel sont d&#233;sign&#233;es de fa&#231;ons vari&#233;es : le Lexique-
Grammaire les d&#233;signe par leur nature syntagmatique et leur rang (N0, N1, Pr&#233;p N2...), le Lefff et SynLex 
utilisent des fonctions syntaxiques. Cette derni&#232;re approche suppose un inventaire des fonctions retenues. 
Les lexiques syntaxiques reprennent g&#233;n&#233;ralement les fonctions syntaxiques classiques (sujet, objet direct, 
objet indirect, compl&#233;ment pr&#233;positionnel, attribut du sujet, attribut de l&#8217;objet...), avec quelques ajouts. 
Ainsi Lefff et SynLex distinguent deux objets indirects, selon la pr&#233;position utilis&#233;e dans le syntagme 
pr&#233;positionnel : &#224;-objet et de-objet.  
En revanche, l&#8217;approche pronominale (Blanche-Benveniste et al. 1984) d&#233;finit les places valencielles de 
fa&#231;on distributionnelle, &#224; partir du paradigme de pronoms attest&#233; dans la place en question. Le statut de 
place valencielle suppose en effet un paradigme comportant au moins deux pronoms, dont un interrogatif. 
Dans la plupart des cas, la correspondance entre paradigme et fonction syntaxique est transparente. Pour 
les exceptions, voir (Eynde &amp; Mertens 2003) et la documentation du DICOVALENCE.   
</p>
<p>DV Grammaire traditionnelle Synlex Lefff Remarques 
P0 sujet SUJ SUJ sauf il impersonnel et discontinu  
P1 objet direct OBJ OBJ  
P2 objet indirect AOBJ OBJA aussi clitique sans pr&#233;p. 
P3 objet indirect DEOBJ OBJDE aussi clitique sans pr&#233;p. 
PP compl&#233;ment pr&#233;positionnel POBJ OBL pr&#233;position fixe, pas de forme clitique 
PQ    quantitatif 
PMi attribut du sujet ATS ATT  
PMi attribut de l&#8217;objet ATO ATT  
PM (circonstant de mani&#232;re) POBJ OBL pour le type valenciel uniquement  
PL (circonstant locatif) POBJ LOC id. 
PDL (circonstant d&#233;locatif) POBJ DLOC id. 
PT (circonstant de temps) POBJ  id. 
AE - - - adjoint &#233;valuatif 
</p>
<p>Tableau 1 : Correspondance entre les termes utilis&#233;s dans plusieurs lexiques  
pour d&#233;signer les fonctions syntaxiques.  
</p>
<p>2.3. El&#233;ments sans statut s&#233;mantique 
</p>
<p>Les exemples suivants comportent un pronom sans statut s&#233;mantique. Celui-ci ne peut pas &#234;tre remplac&#233; 
par un autre pronom ou par un groupe nominal ; il n&#8217;admet pas les transformations applicables aux 
&#233;l&#233;ments valenciels (clivage, dislocation). Par cons&#233;quent, ce pronom ne sera pas consid&#233;r&#233; comme la 
r&#233;alisation d&#8217;un paradigme, mais plut&#244;t comme un comme un compl&#233;ment apparent (ou pseudo-
paradigme). 
</p>
<p>dehors il pleuvait      (pseudo-il, verbes m&#233;t&#233;orologiques) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIET MERTENS 
&#231;a caille ici      (pseudo-&#231;a) 
pour s&#8217;&#233;lancer, il faut plus de place    (pseudo-se, verbes pronominaux) 
je le prends sur moi ; j&#8217;emporte avec moi ce souvenir (pseudo-soi) 
il en arrive &#224; d&#233;m&#233;nager    (pseudo-en) 
il s&#8217;y conna&#238;t en math&#233;matiques   (pseudo-y) 
elle l&#8217;emporte sur son fr&#232;re     (pseudo-le) 
il vous la coupe      (pseudo-la) 
il planta l&#224; son travail      (pseudo-l&#224;) 
 
</p>
<p>Le traitement est analogue pour certaines notions de la grammaire traditionnelle. Pour les verbes pronomi-
naux, par exemple, on observe bien plusieurs pronoms alternatifs (&#171; je m&#8217;&#233;vanouis, tu t&#8217;&#233;vanouis... &#187;). 
Cependant le pronom r&#233;flechi est pr&#233;visible &#224; partir du sujet (&#171; *je t&#8217;&#233;vanouis &#187;, etc.) ou &#224; partir de la 
forme du verbe (&#171; &#233;lance-toi &#187;, &#171; pour s&#8217;&#233;lancer &#187;). Le DICOVALENCE le d&#233;signe comme le pseudo_se. 
Plusiers types de constructions impersonnelles rentrent dans la cat&#233;gorie mentionn&#233;e. Le sujet des verbes 
m&#233;t&#233;orologiques (&#171; il pleut, il neige... &#187;) est repr&#233;sent&#233; dans DICOVALENCE comme un pseudo_il. Les 
constructions du type &#171; il faut qu&#8217;elle parte &#187;, &#171; il s&#8217;agit de travailler &#187; sont repr&#233;sent&#233;es comme des verbes 
&#224; sujet discontinu, o&#249; le sujet est constitu&#233; de deux parties, d&#8217;une part le pronom &#171; il &#187;, d&#8217;autre part la 
compl&#233;tive (&#171; qu&#8217;elle parte &#187;) ou l&#8217;infinitive (&#171; de travailler &#187;). Cette analyse repose sur les observations 
suivantes : dans ces cas, &#171; il &#187; ne peut pas &#234;tre remplac&#233; par un autre pronom (&#171; *elle s&#8217;agit de travailler &#187;) 
ou par un pronom interrogatif (&#171; *qu&#8217;est-ce qu&#8217;il s&#8217;agit de travailler &#187;). 
</p>
<p>3 R&#233;alisations syntagmatiques des arguments valenciels 
Pour noter les r&#233;alisations syntagmatiques possibles de chaque place valencielle les lexiques syntaxiques 
utilis&#233;s en TAL distinguent g&#233;n&#233;ralement les cat&#233;gories syntaxiques majeures suivantes : pronoms 
clitiques, syntagme nominal, syntagme pr&#233;positionnel, syntagme adjectival, proposition infinitive 
(introduite ou non par une pr&#233;position), compl&#233;tive (introduite par la conjonction &#171; que &#187;, avec mention du 
mode utilis&#233;, indicatif ou subjonctif). 
Le nombre de cat&#233;gories retenues varie d&#8217;un lexique &#224; l&#8217;autre. Dans SynLex elles sont relativement peu 
nombreuses : sn (syntagme nominal), pinf (infinitive), pcompl (compl&#233;tive), qcompl (question indirecte). 
SynLex assimile donc les syntagmes nominal et pr&#233;positionnel, et fait abstraction de la pr&#233;sence de la 
pr&#233;position, information pr&#233;visible &#224; partir de la fonction syntaxique. Le Lefff propose un inventaire de 
cat&#233;gories syntaxiques tr&#232;s riche, qui distingue plusieurs types de pronoms (clitiques nominatifs, 
accusatifs, datifs, &#171; en &#187;, &#171; y &#187;, se r&#233;fl&#233;chi, se r&#233;ciproque...), plusieurs types de syntagmes nominaux (sn, 
de-sn, &#224;-sn, ...) et adjectivaux (sa, pour-sa, ...), qui reprennent la pr&#233;position &#233;ventuelle li&#233;e &#224; la fonction 
syntaxique. Il en est de m&#234;me des infinitives (inf, de-inf, ...) et de compl&#233;tives (scompl = que-phrase, &#224;-
scompl = &#224; ce que P, de-scompl = de ce que P, qcompl = question indirecte,...). Vu le caract&#232;re pr&#233;visible 
de la pr&#233;position, cet inventaire d&#233;taill&#233; semble en partie redondant. 
</p>
<p>Quelles sont les r&#233;alisations syntagmatiques pouvant &#234;tre d&#233;riv&#233;es des informations dans DICOVALENCE ? 
Pour chaque place valencielle, DICOVALENCE fournit une liste d&#8217;&#233;l&#233;ments pronominaux, &#224; la fois clitiques 
et non clitiques (&#171; &#231;a, celui-ci, celle-ci, &#224; lui, de lui, &#224; eux, &#224; &#231;a, de &#231;a, qui, quoi... &#187;). Notons que la classe 
est plus large que les pronoms de la grammaire traditionnelle et inclut &#233;galement des pronoms ind&#233;finis 
(&#171; autant, combien... &#187;) et des adverbes (&#171; comment, ainsi, l&#224;, ici, ailleurs, &#224; ce moment-l&#224; &#187;). 
Selon l&#8217;id&#233;e centrale de l&#8217;approche pronominale, l&#8217;existence d&#8217;un paradigme de pronoms implique toujours 
la possibilit&#233; de r&#233;alisations comportant des mots lexicaux, sous la forme d&#8217;un groupe nominal, d&#8217;un 
groupe pr&#233;positionnel ou autre, selon la fonction syntaxique : </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESTRICTIONS DE SELECTION  
{ qui, je, tu, il, elle... } &#8594; cet homme, cet objet, la table, Pierre.. 
{ &#224; qui, me, te, lui, leur, nous... } &#8594; &#224; cet homme, &#224; eux, &#224; Jean.. 
{ o&#249;, l&#224;, ici... } &#8594; ailleurs, nullepart, dans cette salle, &#224; Montr&#233;al, &#224; TALN... 
 
</p>
<p>Qui plus est, certains &#233;l&#233;ments de paradigme indiquent la r&#233;alisation non pronominale correspondant &#224; un 
pronom. Il s&#8217;agit tant&#244;t d&#8217;une proposition infinitive, &#233;ventuellement introduite par une pr&#233;position, tant&#244;t 
d&#8217;une subordonn&#233;e introduite par &#171; que &#187; (que-phrase) ou par &#171; si &#187;, ou d&#8217;une question indirecte. Dans le 
cas des subordonn&#233;es, le mode est &#233;galement explicit&#233;. Pour des limitations de place, on se limitera ici &#224; 
quelques exemples pour la fonction objet. 
</p>
<p>P1 : le(inf), &#231;a(inf)  il admet l&#8217;avoir tromp&#233;e 
P1 : le(de_inf)   je lui ai cri&#233; de revenir &#224; temps 
P1 : le(&#224;_inf)   il m&#8217;a demand&#233; &#224; voir ce que j&#8217;&#233;crivais 
P1 : le(qpind), &#231;a(qpind) Luc a remarqu&#233; qu&#8217;il manquait plusieurs documents 
P1 : le(qpsubj), &#231;a(qpsubj) elle exige qu&#8217;on lui rende son argent 
P1 : le(spind), &#231;a(spind) on me demande si elle est rentr&#233;e 
P1 : le(indirq), &#231;a(indirq) elle demande qui &#233;tait l&#224;, je sais comment faire, il sait de quoi parler 
 
</p>
<p>Gr&#226;ce &#224; ces &#233;l&#233;ments, le passage des paradigmes de pronoms aux r&#233;alisations syntagmatiques possible 
s&#8217;av&#232;re trivial. 
</p>
<p>4 Restrictions s&#233;lectionnelles 
</p>
<p>4.1 Les traits s&#233;mantiques, leur d&#233;finition et leur organisation 
</p>
<p>Le terme r&#233;f&#233;rent sera utilis&#233; ici pour d&#233;signer ce &#224; quoi renvoie un pronom ou un nom. Dans &#171; je la 
connais &#187;, le pronom &#171; la &#187; peut renvoyer &#224; une personne, &#224; un animal, &#224; une plante, &#224; un objet, &#224; un 
&#233;v&#233;nement, &#224; une notion abstraite (&#171; je la connais, cette religion &#187;), et ainsi de suite. Mais &#171; je &#187; ne d&#233;signe 
qu&#8217;un &#234;tre humain. Pour distinguer les types de r&#233;f&#233;rents, on se sert souvent de traits s&#233;mantiques, tels que 
[humain], [anim&#233;], [concret] (Flaux &amp; Van de Velde 2000). Ces m&#234;mes traits sont couramment utilis&#233;s 
pour repr&#233;senter des restrictions de s&#233;lection portant sur les arguments d&#8217;un pr&#233;dicat verbal dans un emploi 
donn&#233; (Lecl&#232;re 1990). Provisoirement on utilisera la notation suivante, qui sera comment&#233;e plus loin.  
</p>
<p>homme  (nom)   [+concret, +anim&#233;, +humain] 
chat  (nom)   [+concret, +anim&#233;, -humain] 
religion (nom)   [-concret] 
la  (pronom)  [&#177;concret, &#177;anim&#233;, &#177;humain] 
je  (pronom)  [+concret, +anim&#233;, +humain] 
ceci  (pronom)  [+concret, -anim&#233;, -humain] 
celui-ci  (pronom)  [&#177;concret, &#177;anim&#233;, &#177;humain] 
&#231;a  (pronom)  [&#177;concret, &#177;anim&#233;, &#177;humain] 
 
</p>
<p>Il existe plusieurs fa&#231;ons d&#8217;utiliser et de combiner les traits s&#233;mantiques. Certains lexiques syntaxiques, 
comme VerbNet pour l&#8217;anglais, adoptent une organisation hi&#233;rarchique des traits, comme dans une 
taxinomie, avec des classes embo&#238;t&#233;es les unes dans les autres. Chaque classe se d&#233;finit par un ou plusieurs 
traits. &#192; chaque fois qu&#8217;on applique &#224; une classe un trait suppl&#233;mentaire, elle se subdivise en plusieurs 
sous-classes, pour lesquelles le nouveau trait prend des valeurs alternatives. Dans cette approche, une sous-
classe h&#233;rite des traits de la super-classe, mais pr&#233;sente un (ou plusieurs) traits additionnels qui permettent </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIET MERTENS 
de la diff&#233;rencier des sous-classes compl&#233;mentaires. Ainsi la classe des r&#233;f&#233;rents (ou des &#233;l&#233;ments lexicaux 
correspondants) dot&#233;es du trait [+concret] comporte plusieurs sous-classes, parmi lesquelles celle avec le 
trait [+anim&#233;], qui &#224; son tour comporte la sous-classe [+humain], et ainsi de suite. Les traits seront utilis&#233;s 
pour contraindre les r&#233;alisations des places valencielles. Dans cette approche hi&#233;rarchique, lorsqu&#8217;un 
&#233;l&#233;ment valenciel pr&#233;sente le trait [+humain], par d&#233;finition il pr&#233;sente &#233;galement les traits [+anim&#233;] et 
[+concret], bien que seulement une partie des r&#233;f&#233;rents concrets soient accept&#233;s. 
</p>
<p>Karel van den Eynde (communication personnelle) propose &#233;galement un classement hi&#233;rarchique, mais 
organis&#233; autrement. Au premier niveau, le trait [humain] oppose les r&#233;f&#233;rents humains aux non-humains, et 
&#224; l&#8217;int&#233;rieur de la deuxi&#232;me classe le trait [concret] oppose les r&#233;f&#233;rents abstraits aux r&#233;f&#233;rents concrets non 
humains.  
</p>
<p>G. Gross (1994) montre les difficult&#233;s li&#233;es &#224; l&#8217;utilisation des traits s&#233;mantiques en g&#233;n&#233;ral, et implicite-
ment &#224; leur organisation hi&#233;rarchique. Mentionnons quelques objections majeures. D&#8217;abord les traits 
s&#233;mantiques ne sont pas assez pr&#233;cis pour repr&#233;senter les propri&#233;t&#233;s pertinentes sur le plan syntaxique. 
Ensuite, ils sont bas&#233;s sur des distinctions ontologiques, utilis&#233;es de fa&#231;on intuitive et d&#233;finies a priori. 
Certains &#233;l&#233;ments lexicaux sont &#224; cheval sur plusieurs crit&#232;res de classification ; ainsi la &#171; cotte de maille &#187; 
est &#224; la fois un objet m&#233;tallique et un v&#234;tement. Les d&#233;finitions des traits seraient insatisfaisantes &#224; la fois 
pour la description linguistique, et pour leur application en TAL. Selon l&#8217;auteur les classes devraient &#234;tre 
&#233;tablies &#171; de fa&#231;on interne, &#224; l&#8217;aide des moyens que la langue fournit elle-m&#234;me, c&#8217;est-&#224;-dire des outils 
syntaxiques &#187;. Des crit&#232;res distributionnels permettent en effet de d&#233;finir des classes d&#8217;objets, telles que 
&#171; moyen de transport, profession, fonction, collectif, maladie, locatif, lieu de travail, qualit&#233; &#187; (Gross 
1994:17). Cependant, &#224; un niveau pr&#233;alable aux classes d&#8217;objets, il maintient 8 classes majeures, d&#233;limit&#233;es 
par les traits suivants : humain, animal, v&#233;g&#233;tal, inanim&#233; concret, inanim&#233; abstrait, locatif, temps, 
&#233;v&#233;nement. Pour la classe majeure des humains il y aurait 54 classes d&#8217;objets, par exemple. Dans 
l&#8217;approche de Gross ces 8 traits ne pr&#233;sentent pas d&#8217;organisation hi&#233;rarchique, mais constituent un classe-
ment &#224; un niveau, comportant 8 classes ind&#233;pendantes, d&#233;finies &#224; partir de crit&#232;res syntaxiques. 
</p>
<p>L&#8217;organisation des traits a un impact sur leur repr&#233;sentation et sur leur utilisation. En effet, dans un 
syst&#232;me hi&#233;rarchique o&#249; [+humain] &#8834; [+anim&#233;] &#8834; [+concret] &#8834; [&#177;concret], les caract&#233;risations formul&#233;es 
plus haut doivent &#234;tre lues comme dans la colonne A du tableau ci-dessous. La notation sous B, plus 
concise et plus lisible, &#233;vite la redondance.  
</p>
<p> A B 
homme (nom) [+concret] &#8745; [+anim&#233;] &#8745; [+humain] [+humain] 
la (pronom) [&#177;concret] &#8746; [&#177;anim&#233;] &#8746; [&#177;humain] [] 
je (pronom) [+concret] &#8745; [+anim&#233;] &#8745; [+humain] [+humain] 
ceci (pronom) [+concret] &#8745; [-anim&#233;] &#8745; [-humain] [-humain] 
</p>
<p> 
</p>
<p>Les difficult&#233;s de notation se manifestent par exemple quand un terme de valence accepte &#224; la fois les 
r&#233;f&#233;rents [+humain] et les r&#233;f&#233;rents [-concret], comme pour l&#8217;objet indirect de &#171; s&#8217;accoutumer, se 
consacrer, c&#233;der &#187; ou l&#8217;objet direct de &#171; comprendre, d&#233;noncer &#187;. La notation &#171; [&#177;concret, +humain] &#187;, 
assez impr&#233;cise, devrait &#234;tre interpr&#233;t&#233;e comme &#171;  ([+concret] &#8745; [+humain]) &#8746; [-concret] &#187;. Cette 
difficult&#233; sera &#233;vit&#233;e avec le classement non hi&#233;rarchique, comme pour les 8 classes majeures de G. Gross.  
</p>
<p>4.2 Le calcul de traits dans DICOVALENCE 
</p>
<p>Notre objectif est d&#8217;obtenir automatiquement certains traits s&#233;mantiques &#224; partir d&#8217;informations d&#233;j&#224; 
pr&#233;sentes dans DICOVALENCE, plus particuli&#232;rement &#224; partir des paradigmes de pronoms associ&#233;s aux 
places de valence (Eynde et al. 1988). En effet, la pr&#233;sence de certains &#233;l&#233;ments dans le paradigme </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESTRICTIONS DE SELECTION  
permettra d&#8217;associer &#224; celui-ci un ou plusieurs traits. Lorsqu&#8217;un pronom peut d&#233;noter des r&#233;f&#233;rents 
pr&#233;sentant certaines propri&#233;t&#233;s, il est compatible avec ces propri&#233;t&#233;s et avec les traits s&#233;mantiques qui les 
explicitent. Ainsi les pronoms &#171; je, nous, qui &#187; d&#233;signent des &#234;tres humains, mais pas des objets. Ils portent 
donc le trait [+humain]. Le pronom &#171; ceci &#187;, en revanche, ne d&#233;signe que des r&#233;f&#233;rents concrets non 
humains. Ces informations seront mises &#224; profit dans le calcul des traits associ&#233;s aux places valencielles. 
</p>
<p>Dans cette approche, seuls peuvent &#234;tre calcul&#233;s les traits pour lesquels il existe des pronoms (ou des 
&#233;l&#233;ments, cf. infra) qui permettent de les identifier. Il n&#8217;existe pas de pronom r&#233;serv&#233; aux animaux ou aux 
v&#233;g&#233;taux ; aussi ces classes seront-elles regroup&#233;es avec les concrets non humains. On obtient ainsi 3 
classes majeures, sans hi&#233;rarchisation : [humain], [concret non humain], [abstrait]. On obtient &#233;galement le 
trait indiquant la propri&#233;t&#233; [complexe], qui rejoint la notion de collectif (cf. infra), et qui se combine avec 
les 3 classes majeures.  
La comparaison des classes propos&#233;es par G. Gross avec celles calculables &#224; partir des pronoms permet 
plusieurs observations : dans DICOVALENCE, (1) les classes locatif et temps de Gross sont r&#233;serv&#233;es aux 
fonctions syntaxiques correspondantes (&#224; savoir PL et PT) ; (2) la classe &#233;v&#233;nement est regroup&#233;e avec les 
r&#233;f&#233;rents abstraits ; (3) enfin, les classes v&#233;g&#233;tal et animal sont regroup&#233;es avec les concrets non humains. 
La qualit&#233; de l&#8217;attribution des traits d&#233;pend du trait envisag&#233;. Le trait [humain] peut &#234;tre attribu&#233; pour 
toutes les places valencielles de la quasi-totalit&#233; des entr&#233;es du lexique verbal. Pour [abstrait], l&#8217;attribution 
n&#8217;est possible que dans une partie des cas. 
</p>
<p>Les pronoms les plus importants pour l&#8217;attribution des traits sont &#233;num&#233;r&#233;s ci-dessous, avec leurs 
interpr&#233;tations possibles. (&#171; qui &#187; d&#233;signe le pronom interrogatif.) L&#8217;&#233;l&#233;ment EVENT est une macro qui 
accepte les diff&#233;rentes r&#233;alisations sous forme de subordonn&#233;e mentionn&#233;es plus haut : &#171; &#231;a(inf), 
&#231;a(de_inf), &#231;a(&#224;_inf), &#231;a(qpind), &#231;a(qpsubj)... &#187; 
</p>
<p>qui, je, nous, vous, te&#8230; &#8594; [humain] 
ceci    &#8594; [concret non humain] 
&#231;a   &#8594; [abstrait] &#8744; [concret non humain] &#8744; [humain] (d&#233;sindividualisant) 
&#231;a(inf), EVENT  &#8594; [abstrait] 
</p>
<p>4.2.1 Le trait [humain] 
</p>
<p>Si le paradigme sujet d&#8217;une entr&#233;e lexicale comporte le pronom &#171; je &#187;, &#171; nous &#187; ou &#171; qui &#187;, alors cette place 
admet des r&#233;f&#233;rents humains et elle re&#231;oit le trait [humain]. On le notera comme suit : 
</p>
<p>sujet : (je &#8744; nous &#8744; qui)    &#8594; [humain]  
 
</p>
<p>La disjonction (&#171; je &#187; &#8744; &#171; nous &#187;) permet de d&#233;tecter les sujets qui ne s&#8217;emploient qu&#8217;au pluriel 
(&#171; s&#8217;affronter, s&#8217;entraider, s&#8217;allier contre&#8230; &#187; ; cf., pour l&#8217;objet, &#171; accumuler, &#233;num&#233;rer, confondre&#8230; &#187;). 
Pour les sujets discontinus, on utilise une r&#232;gle similaire portant sur l&#8217;&#233;l&#233;ment discontinu &#171; il_de_qui &#187;. 
</p>
<p>sujet : (il_de_qui)     &#8594; [humain]  
 
</p>
<p>Pour les autres fonctions syntaxiques, les r&#232;gles sont identiques, sauf que les pronoms utilis&#233;s seront 
&#233;videmment ceux de la fonction syntaxique en question : 
</p>
<p>objet : (te &#8744; nous &#8744; qui)    &#8594; [humain]  
objet_&#224; : (qui &#8744; me)     &#8594; [humain]  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIET MERTENS 
objet_de : (qui)     &#8594; [humain]  
objet_prep : (qui)     &#8594; [humain]  
 
</p>
<p>4.2.2 Le trait [concret non humain] 
</p>
<p>La pr&#233;sence de &#171; ceci &#187; en position sujet d&#233;clenche l&#8217;attribution du trait [concret non humain]. Une 
deuxi&#232;me r&#232;gle (sans &#171; ceci &#187;) permet dans certains cas d&#8217;attribuer ce trait aux r&#233;f&#233;rents sujets concrets 
incompatibles avec &#171; ceci &#187;, comme dans &#171; le bateau accoste et rembarque des passagers &#187;, &#171; l&#8217;&#233;l&#233;phant 
barrit &#187;. Bien que le pronom &#171; il &#187; soit ambigu (il permet en effet les interpr&#233;tations [humain], [non 
humain] ou [abstrait]), l&#8217;absence de &#171; je, nous, qui &#187; dans les cas vis&#233;s exclut l&#8217;interpr&#233;tation de &#171; il &#187; 
comme [humain], et l&#8217;absence de &#171; &#231;a, EVENT &#187; celle de &#171; il &#187; comme [abstrait]. Des r&#232;gles analogues 
sont donn&#233;es pour l&#8217;objet direct (o&#249; &#171; que &#187; d&#233;signe aussi &#171; qu&#8217;est-ce que &#187;) et pour l&#8217;objet indirect. 
</p>
<p>sujet : (ceci &#8744; il_de_ceci)      &#8594; [concret non humain]  
sujet : (il &#8744; ils) &#8743; &#172; (je &#8744; nous &#8744; qui &#8744; &#231;a &#8744; EVENT)  &#8594; [concret non humain]  
objet, objet indirect : (ceci)      &#8594; [concret non humain]  
objet : (que) &#8743; &#172; (te &#8744; vous &#8744; qui &#8744; &#231;a &#8744; EVENT)   &#8594; [concret non humain]  
objet indirect : (&#231;a &#8744; y) &#8743; &#172; (qui &#8744; EVENT)    &#8594; [concret non humain]  
 
</p>
<p>La r&#232;gle sans &#171; ceci &#187; ne sera appliqu&#233;e que si la r&#232;gle avec &#171; ceci &#187; ne s&#8217;applique pas au paradigme 
analys&#233;. Cette situation demande l&#8217;application ordonn&#233;e des r&#232;gles, qui sera interrompue apr&#232;s la premi&#232;re 
r&#232;gle remplissant les conditions. 
</p>
<p>4.2.3 Le trait [abstrait] 
</p>
<p>Pour le calcul du trait [abstrait] on exploite les &#233;l&#233;ments EVENT, r&#233;serv&#233; aux abstraits, et &#171; &#231;a &#187;. Le 
pronom &#171; &#231;a &#187; &#233;tant ambigu, on v&#233;rifie l&#8217;absence d&#8217;&#233;l&#233;ments qui montrent l&#8217;interpr&#233;tation comme [humain] 
(&#224; savoir &#171; je, nous, qui &#187;) et comme [concret non humain] (&#224; savoir &#171; ceci &#187;). Pour les autres fonctions 
syntaxiques, les r&#232;gles sont analogues. On ajoute une troisi&#232;me r&#232;gle qui indique que l&#8217;interpr&#233;tation 
[abstrait] est probable &#233;tant donn&#233; la pr&#233;sence de &#171; &#231;a &#187;, sans &#234;tre certaine, vu la pr&#233;sence de &#171; ceci &#187;. 
</p>
<p>sujet, objet : (EVENT)     &#8594; [abstrait]  
sujet : (&#231;a) &#8743; &#172; (je &#8744; nous &#8744; qui &#8744; ceci)  &#8594; [abstrait]  
objet : (&#231;a) &#8743; &#172; (te &#8744; vous &#8744; qui &#8744; ceci)  &#8594; [abstrait]  
objet : (&#231;a) &#8743; (ceci)     &#8594; [?abstrait] 
  
</p>
<p>4.2.4 Le trait [complexe] 
</p>
<p>Ce trait sera attribu&#233; aux termes dont la r&#233;alisation se limite &#224; un r&#233;f&#233;rent au pluriel, &#224; la coordination de 
plusieurs r&#233;f&#233;rents ou &#224; un collectif : &#171; ces droites convergent &#187;, &#171; *cette droite converge &#187; (mais : &#171; elle 
converge avec celle-l&#224; &#187; et &#171; elle converge vers l&#8217;&#233;quation d&#8217;une droite &#187;), &#171; les preuves contre lui 
abondent &#187;, &#171; *la preuve contre lui abonde &#187;, &#171; on va accoler les mots &#187;, &#171; les cheveux collent ensemble &#187;.  
</p>
<p>sujet : (ils &#8744; elles) &#8743; &#172; (il &#8744; elle)  &#8594; [complexe] 
objet : (nous &#8744; les) &#8743; &#172; (le &#8744; la)  &#8594; [complexe] 
objet-&#224; : (leur) &#8743; &#172; (lui &#8744; lui_ton &#8744; ceci)  &#8594; [complexe] </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESTRICTIONS DE SELECTION  
objet-de : (eux) &#8743; &#172; (lui &#8744; lui_ton &#8744; ceci)  &#8594; [complexe] 
objet-prep : (eux) &#8743; &#172; (lui &#8744; lui_ton &#8744; ceci)  &#8594; [complexe] 
 
</p>
<p>5 Repr&#233;sentation des informations dans le lexique syntaxique 
L&#8217;extrait suivant illustre le r&#233;sultat obtenu. La cadre valenciel appara&#238;t entre chevrons. Pour chaque place 
de valence sont mentionn&#233;s la fonction syntaxique, la liste des r&#233;alisations syntagmatiques possibles 
(s&#233;par&#233;es par &#8216;|&#8217;), les traits s&#233;mantiques (hum, nhum (= concret non humain), abs (= abstrait), complex), y 
compris le mode de la subordonn&#233;e (indicatif ou subjonctif), si pr&#233;sente. Le point d&#8217;interrogation pr&#233;c&#233;dant 
la place indique son caract&#232;re facultatif. Celui qui pr&#233;c&#232;de un trait indique sa probabilit&#233; relative.  
</p>
<p>54980, manifester, pred, &lt; subj:pron|n:[hum], obj:pron|n:[abs], ?obj&#224;:pron|n:[hum] &gt; 
il ne manifeste jamais ses vrais sentiments 
</p>
<p>54990, manifester, pred, &lt; subj:pron|n:[abs], obj:pron|n|compl|indq:[abs,mood:ind] &gt; 
cette expression manifeste un d&#233;dain r&#233;el 
</p>
<p>55000, se manifester, pred, &lt; pseudo_se, subj:pron|n:[hum] &gt; 
aucun assistant ne s'est manifest&#233; pour ce poste 
</p>
<p>55010, manifester, pred, &lt; subj:pron|n:[hum], ?objp&lt;contre,pour&gt;:pron|n: [hum,?nhum,abs] &gt; 
on manifeste pour une terre plus verte et plus saine 
</p>
<p>55020, manigancer, pred, &lt; subj:pron|n:[hum], obj:pron|n:[abs] &gt; 
il parvient toujours &#224; manigancer quelque chose 
</p>
<p>55030, manipuler, pred, &lt; subj:pron|n:[hum], obj:pron|n:[nhum,?abs] &gt; 
il aime manipuler les gens 
</p>
<p>55040, manoeuvrer, pred, &lt; subj:pron|n:[hum], ?obj:pron|n:[nhum,?abs] &gt; 
 les officiers manoeuvrent le bateau 
55050, manquer, pred, &lt; subj:pron|n|compl|de_inf:[hum,nhum,abs,mood:subj], 
?obj&#224;:pron|n:[hum] &gt; 
 ma femme me manque beaucoup 
55060, manquer, pred, &lt; subj:pron|n:[hum], obj:pron|n:[hum], ?quant&lt;de&gt;:pron|n:[] &gt; 
</p>
<p>il a encore manque le car de 10 heures 
55070, manquer, pred, &lt; subj:pron|n:[hum,nhum,?abs], ?loc&lt;&gt;:pron|n:[] &gt; 
</p>
<p>ces produits manquent dans ce magasin 
55080, manquer, pred, &lt; subj:pron|n:[abs] &gt; 
 cette &#233;preuve a manqu&#233; totalement 
55100, manquer, pred, &lt; subj:pron|n:[hum], ?obj&#224;:pron|n:[hum,abs] &gt; 
 un honn&#234;te homme ne peut manquer &#224; ses obligations 
55117, manquer de, adjunct:5:plain, &lt;  &gt; 
</p>
<p>&#231;a ne manque jamais de me tomber dessus 
</p>
<p>6 Conclusion 
Dans cet article nous avons d&#233;crit un ensemble de modifications du DICOVALENCE qui faciliteront son 
utilisation en TAL, mais aussi, d&#8217;une fa&#231;on plus g&#233;n&#233;rale, dans la recherche en syntaxe. Ces modifications 
concernent trois propri&#233;t&#233;s des places valencielles : leur fonction syntaxique, leurs restrictions s&#233;lectionnel-
les et leurs r&#233;alisations syntagmatiques possibles. Des limitations de place emp&#234;chent qu&#8217;on d&#233;taille ici les 
autres modifications envisag&#233;es, pour la plupart d&#233;j&#224; r&#233;alis&#233;es.  
Une partie de l&#8217;article d&#233;crit comment les traits s&#233;mantiques, qui expriment les restrictions de s&#233;lection 
portant sur les arguments valenciels, sont calcul&#233;s &#224; partir des paradigmes des pronoms et d&#8217;autres 
&#233;l&#233;ments similaires, associ&#233;s &#224; ces arguments. Pour la plupart des utilisateurs actuels et futurs, ces ajouts 
appara&#238;tront comme une v&#233;ritable extension du dictionnaire. 
</p>
<p>Ces modifications ont r&#233;sult&#233; dans une nouvelle version du lexique, quasi-ind&#233;pendante du mod&#232;le 
syntaxique initial, o&#249; les informations apparaissent dans une forme transparente, et pour cette raison 
directement utilisable en TAL. Cependant, ce nouveau format r&#233;sulte d&#8217;une conversion automatique de la 
version originale du DICOVALENCE, qui reste donc la source unique et suffisante.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PIET MERTENS 
R&#233;f&#233;rences 
BLANCHE-BENVENISTE C., DELOFEU J., STEFANINI, J., EYNDE, K. VAN DEN (1984). Pronom et syntaxe. L&#8217;approche 
pronominale et son application au fran&#231;ais. Paris: SELAF, pp. 245. 
CONSTANT M., TOLONE E. (2010). A generic tool to generate a lexicon for NLP from Lexicon-Grammar tables. 
Actes 27e Colloque international sur le lexique et la grammaire (L'Aquila, 10-13 septembre 2008). 
</p>
<p>DANLOS L., SAGOT B. (2007). Comparaison du Lexique-Grammaire des verbes pleins et de Dicovalence : vers une 
int&#233;gration dans le Lefff. Actes TALN 2007, 229-238 (Toulouse, 5-8 juin 2007). 
DANLOS L., SAGOT B. (2007). Constructions pronominales dans Dicovalence et le Lexique-Grammaire : int&#233;gration 
dans le Leff. Actes Colloque Lexique et Grammaire 2008, L&#8217;Aquila. 
</p>
<p>EYNDE K. VAN DEN, BROEDERS E., EGGERMONT C., VANGILBERGEN, L. (1988). The pronominal approach in NLP: 
a pronominal feature analysis of coordination in French. Computers and Translation 3, 177-213. 
</p>
<p>EYNDE K. VAN DEN, MERTENS P. (2003). La valence : l&#8217;approche pronominale et son application au lexique verbal. 
French Language Studies 13, 63-104. 
</p>
<p>FALK I., FRANCOPOULO G., GARDENT CL. (2007). Evaluer Synlex. Actes TALN 2007, 335-344. 
</p>
<p>FLAUX N. &amp; VAN DE VELDE D. (2000). Les noms en fran&#231;ais : esquisse de classement. L'essentiel fran&#231;ais. Gap : 
Ophrys. 
</p>
<p>GARDENT C. (2009). Technique d&#8217;acquisition de connaissances lexicales &#224; partir de corpus analys&#233;s en syntaxe. 
Manuscrit : D&#233;livrable du projet Passage Passage/2009/D10/v1.0 
GARDENT C., GUILLAUME B., PERRIER G., FALK I. (2006). Extraction d&#8217;information de sous-cat&#233;gorisation &#224; partir 
des tables du LADL. Actes TALN 2006. 
</p>
<p>GROSS G. (1994). Classes d'objets et description des verbes. Langages 115, 15-30. 
KUPSC A., ABEILLE A. (2008). Growing TreeLex. in: GELBUKH A. (ed.), 9th Int. Conf., CICLing 2008, (Haifa, 
Israel, February 2008). Lecture Notes in Computational Linguistics no 4919, pp. 28-39. 
</p>
<p>LECLERE C. (1990). Organisation du Lexique-Grammaire des verbes fran&#231;ais. Langue fran&#231;aise 87, 112-122. 
</p>
<p>MESSIANT C., KORHONEN A., POIBEAU, TH. (2008) LexSchem: A Large Subcategorization Lexicon for French 
Verbs. Actes LREC (Marrakech). 
</p>
<p>MERTENS P. (2008). Factorisation des contraintes syntaxiques dans un analyseur de d&#233;pendance. Actes TALN 2008 
(Avignon, 9-13 juin 2008). 
NASR A., BECHET, F. (2009). Analyse syntaxique en d&#233;pendances de l'oral spontan&#233;. Actes TALN 2009. 
</p>
<p>SAGOT B., CL&#201;MENT L., DE LA CLERGERIE &#201;., BOULLIER P. (2006).The Lefff 2 syntactic lexicon for French: 
architecture, acquisition, use. Actes de LREC 06 (G&#234;nes, Italie). 
</p>
<p>SAGOT B., DANLOS L. (2007). Am&#233;liorer un lexique syntaxique &#224; l'aide des tables du lexique-grammaire: 
Constructions impersonnelles. Cahiers du Cental. </p>

</div></div>
</body></html>