<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L&#8217;&#233;valuation des paraphrases : pour une prise en compte de la t&#226;che</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>L&#8217;&#233;valuation des paraphrases :
pour une prise en compte de la t&#226;che
</p>
<p>Jonathan Chevelu1, 2 Yves Lepage1 Thierry Moudenc2 Ghislain Putois2
</p>
<p>(1) Universit&#233; de Caen, France
(2) Orange Labs, France
</p>
<p>{jonathan.chevelu, thierry.moudenc, ghislain.putois}@orange-ftgroup.com,
yves.lepage@info.unicaen.fr
</p>
<p>R&#233;sum&#233;. Les d&#233;finitions des paraphrases privil&#233;gient g&#233;n&#233;ralement la conservation du sens. Cet
article d&#233;montre par l&#8217;absurde qu&#8217;une &#233;valuation uniquement bas&#233;e sur la conservation du sens permet
&#224; un syst&#232;me inutile de production de paraphrase d&#8217;&#234;tre jug&#233; meilleur qu&#8217;un syst&#232;me au niveau de l&#8217;&#233;tat
de l&#8217;art. La conservation du sens n&#8217;est donc pas l&#8217;unique crit&#232;re des paraphrases. Nous exhibons les trois
objectifs des paraphrases : la conservation du sens, la naturalit&#233; et l&#8217;adaptation &#224; la t&#226;che. La production
de paraphrase est alors un compromis d&#233;pendant de la t&#226;che entre ces trois crit&#232;res et ceux-ci doivent &#234;tre
pris en compte lors des &#233;valuations.
</p>
<p>Abstract. Meaning preservation is generally rooted in the paraphrase definitions. This article proves
by reductio ad absurdum that an evaluation based only on the meaning preservation can rank a dummy and
useless system better than a state-of-the-art system. Meaning preservation is therefore not the one and only
criterion for a paraphrase system. We exhibit the three objectives of paraphrase : meaning preservation,
sentence naturalness and adequacy for the task. Paraphrase generation consists actually in reaching a task-
dependent compromise between these three criteria, and they have to be taken into account during each
evaluation process.
</p>
<p>Mots-cl&#233;s : G&#233;n&#233;rateur de paraphrase, &#233;valuation des paraphrases.
</p>
<p>Keywords: Paraphrase generator, paraphrase evaluation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JONATHAN CHEVELU, YVES LEPAGE, THIERRY MOUDENC, GHISLAIN PUTOIS
</p>
<p>1 Introduction
</p>
<p>Des d&#233;finitions vari&#233;es de la paraphrase existent dans le domaine de la g&#233;n&#233;ration automatique de para-
phrases. (Barzilay &amp; McKeown, 2001) d&#233;finissent &#171; Les paraphrases [comme] des moyens alternatifs de
transmettre la m&#234;me information &#187; 1 ou &#171; le m&#234;me sens &#187; 2 pour (Zhao et al., 2009). (Sekine, 2005) la
d&#233;finit ainsi : &#171; Une &#171; paraphrase &#187;, &#224; savoir un ensemble de phrases qui expriment la m&#234;me chose ou
le m&#234;me &#233;v&#232;nement &#187;3. Ces d&#233;finitions insistent sur une relation de conservation &#8211; qu&#8217;elle soit du sens,
de l&#8217;information, du message ou de l&#8217;intention communicative &#8211; entre la phrase d&#8217;origine et la paraphrase
produite.
</p>
<p>Cette focalisation sur la conservation du sens fait que les syst&#232;mes de g&#233;n&#233;ration et leurs &#233;valuations
oublient de prendre en compte la globalit&#233; des objectifs de la production automatique de paraphrases : la
conservation du sens, la naturalit&#233;, mais aussi l&#8217;adaptation &#224; la t&#226;che.
</p>
<p>Dans la section 2, nous d&#233;montrons par l&#8217;absurde que l&#8217;&#233;valuation d&#8217;un syst&#232;me qui ne prend pas en
compte l&#8217;ensemble des objectifs n&#8217;est pas pertinente. Dans la section 3, nous montrons que notre segmen-
tation des objectifs de la g&#233;n&#233;ration en trois cat&#233;gories couvre les principaux usages vis&#233;s par le domaine.
</p>
<p>2 Un (trop) bon g&#233;n&#233;rateur de paraphrases
</p>
<p>L&#8217;&#233;valuation de g&#233;n&#233;rateurs de paraphrase est un probl&#232;me difficile que beaucoup de travaux abordent par
des m&#233;thodes diff&#233;rentes et incompatibles entre elles (Callison-Burch et al., 2008).
</p>
<p>Un g&#233;n&#233;rateur de paraphrases est souvent un composant d&#8217;un syst&#232;me plus complexe. Une fa&#231;on de l&#8217;&#233;va-
luer est de mesurer les performances du syst&#232;me auquel il appartient au moyen d&#8217;un crit&#232;re global. Le
probl&#232;me est que pour les applications o&#249; la paraphrase est pr&#233;sent&#233;e &#224; l&#8217;utilisateur final, il n&#8217;est pas pos-
sible de se contenter d&#8217;une &#233;valuation orient&#233;e t&#226;che, comme dans (Cahill et al., 2009). Par exemple, un
g&#233;n&#233;rateur de paraphrases peut &#234;tre utilis&#233; conjointement &#224; un syst&#232;me de synth&#232;se vocale. Si celui-ci intro-
duit une n&#233;gation, il se peut que la synth&#232;se vocale soit am&#233;lior&#233;e, mais le g&#233;n&#233;rateur d&#233;nature le message
d&#8217;origine. Un tel message ne peut &#234;tre consid&#233;r&#233; comme paraphrase. De plus, une &#233;valuation comportant
uniquement un crit&#232;re li&#233; &#224; une t&#226;che ne permet pas de g&#233;n&#233;raliser les r&#233;sultats &#224; d&#8217;autres probl&#232;mes. Ceci
fait qu&#8217;il y a peu de protocoles d&#8217;&#233;valuation orient&#233;s t&#226;che (Callison-Burch et al., 2008).
</p>
<p>Lorsqu&#8217;ils ne sont pas &#233;valu&#233;s en fonction des performances globales d&#8217;un syst&#232;me, les g&#233;n&#233;rateurs sont
syst&#233;matiquement &#233;valu&#233;s selon le crit&#232;re de conservation du sens (Barzilay &amp; McKeown, 2001; Bannard
&amp; Callison-Burch, 2005; Max, 2008; Chevelu et al., 2009). La naturalit&#233; est, elle aussi, souvent &#233;valu&#233;e
pour s&#8217;assurer que les paraphrases sont syntaxiquement correctes (Bannard &amp; Callison-Burch, 2005; Max,
2008; Chevelu et al., 2009) .
</p>
<p>L&#8217;objectif de l&#8217;exp&#233;rience suivante est de d&#233;montrer qu&#8217;une &#233;valuation focalis&#233;e sur la conservation du sens
n&#8217;est pas pertinente. De plus, l&#8217;ajout d&#8217;un crit&#232;re d&#8217;&#233;valuation li&#233; &#224; la naturalit&#233; est certes appr&#233;ciable mais
pas suffisant. Nous proposons de r&#233;aliser cette d&#233;monstration par l&#8217;absurde, en comparant deux syst&#232;mes
uniquement sur des crit&#232;res de conservation de sens et de naturalit&#233;. Nous montrons qu&#8217;un syst&#232;me inutile
</p>
<p>1Paraphrases are alternative ways to convey the same information.
2the same meaning.
3&#8220;paraphrase&#8221;, i.e. a set of phrases which express the same thing or event.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;&#201;VALUATION DE PARAPHRASES : POUR UNE PRISE EN COMPTE DE LA T&#194;CHE
</p>
<p>Syst&#232;me R&#233;f&#233;rence Test
Sens pr&#233;serv&#233; 48/100 99 / 100
Syntaxe correcte 51/100 51/100
Syntaxe correcte et sens pr&#233;serv&#233; 35/100 50 / 100
</p>
<p>TAB. 1 &#8211; Le syst&#232;me Test est meilleur en termes de conservation du sens et aussi lorsque les deux crit&#232;res
sont combin&#233;s. Le coefficient Kappa d&#8217;accord entre les juges est de 0, 58.
</p>
<p>peut, dans une telle &#233;valuation, &#234;tre jug&#233; meilleur qu&#8217;un syst&#232;me au niveau de l&#8217;&#233;tat de l&#8217;art.
</p>
<p>Le premier syst&#232;me consid&#233;r&#233; est le g&#233;n&#233;rateur de paraphrase statistique de r&#233;f&#233;rence d&#233;crit dans (Chevelu
et al., 2009). Ce syst&#232;me R&#233;f&#233;rence est cens&#233; avoir des performances au niveau de l&#8217;&#233;tat de l&#8217;art (Callison-
Burch et al., 2008; Zhao et al., 2009). Le g&#233;n&#233;rateur de paraphrase repose sur un d&#233;codeur statistique et
sur une table de paraphrase construite &#224; l&#8217;aide d&#8217;une langue pivot. Nous utilisons l&#8217;anglais comme langue
pivot pour produire une table de paraphrases du fran&#231;ais.
</p>
<p>Le second syst&#232;me est con&#231;u sp&#233;cialement pour cette exp&#233;rience. Puisque les syst&#232;mes ne seront compar&#233;s
qu&#8217;en fonction du crit&#232;re de conservation du sens et de la correction syntaxique des paraphrases produites,
l&#8217;objectif est de concevoir un syst&#232;me prenant le moins de &#171; risques &#187; possibles. Nous imposons tout
de m&#234;me aux syst&#232;mes de proposer uniquement des paraphrases diff&#233;rentes de la phrase d&#8217;origine. Le
g&#233;n&#233;rateur de test consiste &#224; supprimer les virgules de la phrase origine s&#8217;il y en a. Si la phrase ne comporte
pas de virgule, nous utilisons un second syst&#232;me compos&#233; lui aussi du d&#233;codeur statistique Moses. La
table de paraphrases utilis&#233;e est celle du syst&#232;me de r&#233;f&#233;rence o&#249; sont conserv&#233;es uniquement les entr&#233;es
qui n&#8217;entra&#238;nent pas de modification du segment ou qui se contentent d&#8217;ajouter une virgule. Ce syst&#232;me
Test est donc capable de supprimer des virgules ou d&#8217;en ajouter &#224; la phrase d&#8217;origine.
</p>
<p>Le corpus d&#8217;entra&#238;nement est constitu&#233; de 1 576 897 phrases extraites des d&#233;bats au Parlement Europ&#233;en et
regroup&#233;es dans le corpus Europarl (Koehn, 2005). 100 phrases s&#233;lectionn&#233;es al&#233;atoirement sont retir&#233;es
du corpus d&#8217;entrainement pour constituer un corpus d&#8217;&#233;valuation.
</p>
<p>L&#8217;&#233;valuation est r&#233;alis&#233;e sur une plateforme en ligne d&#233;di&#233;e &#224; l&#8217;&#233;valuation des paraphrases comme pr&#233;sen-
t&#233;e dans (Chevelu et al., 2009). Les &#233;valuateurs peuvent r&#233;pondre par &#171; Oui &#187;, &#171; Non &#187; ou &#171; Ne sais pas &#187;.
Une paraphrase est jug&#233;e comme correcte pour une question uniquement si tous les &#233;valuateurs la jugent
correcte. Pour cette exp&#233;rience, chaque paraphrase est &#233;valu&#233;e par deux francophones.
</p>
<p>Les r&#233;sultats sont pr&#233;sent&#233;s dans le tableau 1. Le coefficient Kappa d&#8217;accord entre les juges est de 0, 58
(p-valeur &lt; 10&#8722;3), ce qui est traditionnellement interpr&#233;t&#233; comme &#171; mod&#233;r&#233; &#187;. Le corpus de test ex-
trait al&#233;atoirement semble plus difficile pour le g&#233;n&#233;rateur de paraphrase que ceux d&#8217;exp&#233;riences pr&#233;c&#233;-
dentes (Chevelu et al., 2009). Les r&#233;sultats montrent que le syst&#232;me Test est significativement meilleur que
le g&#233;n&#233;rateur de r&#233;f&#233;rence sur ce corpus de test en termes de conservation du sens. L&#8217;ajout du crit&#232;re de
naturalit&#233; r&#233;duit les performances des deux syst&#232;mes mais le g&#233;n&#233;rateur Test reste meilleur de 142%. On
peut tout de m&#234;me se demander si ces r&#233;sultats refl&#232;tent bien l&#8217;int&#233;r&#234;t de chaque syst&#232;me. &#201;videmment,
en minimisant les risques pris, le syst&#232;me qui manipule uniquement des virgules arrive &#224; produire de
meilleurs r&#233;sultats mais est probablement inutile pour la majorit&#233; des applications r&#233;elles de la g&#233;n&#233;ration
de paraphrase.
</p>
<p>Cette exp&#233;rience d&#233;montre qu&#8217;une &#233;valuation bas&#233;e uniquement sur la conservation du sens n&#8217;est pas
pertinente, m&#234;me en ajoutant un crit&#232;re sur la naturalit&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JONATHAN CHEVELU, YVES LEPAGE, THIERRY MOUDENC, GHISLAIN PUTOIS
</p>
<p>3 Les buts de la g&#233;n&#233;ration de paraphrase
</p>
<p>Si la conservation du sens et la naturalit&#233; seules ne permettent pas d&#8217;&#233;valuer un g&#233;n&#233;rateur de paraphrases
c&#8217;est que cette activit&#233; doit avoir d&#8217;autres buts. Nous posons les objectifs suivants comme les buts de la
production de paraphrase :
&#8211; la conservation du sens : c&#8217;est le but premier de la paraphrase. Ma phrase d&#8217;origine sert de r&#233;f&#233;rence en
</p>
<p>termes de sens &#224; produire ;
&#8211; la naturalit&#233; : il est n&#233;cessaire que la paraphrase soit syntaxiquement correcte, afin qu&#8217;elle ait un sens ;
&#8211; l&#8217;ad&#233;quation &#224; la t&#226;che : la g&#233;n&#233;ration automatique de paraphrase n&#8217;est pas une activit&#233; en soi (contrai-
</p>
<p>rement &#224; la traduction par exemple). La g&#233;n&#233;ration de paraphrase est toujours associ&#233;e &#224; une t&#226;che et
int&#233;gr&#233;e dans un processus plus vaste. Les paraphrases produites doivent &#234;tre adapt&#233;es &#224; l&#8217;usage qu&#8217;il
en sera fait.
</p>
<p>Nous d&#233;finissons la g&#233;n&#233;ration de paraphrase comme un compromis entre ces trois objectifs, le r&#233;glage de
ce compromis &#233;tant d&#233;pendant de la t&#226;che. &#192; ce compromis s&#8217;ajoute une s&#233;paration en deux classes selon
que le lieu des modifications est impos&#233; ou non.
</p>
<p>Ces trois objectifs se retrouvent dans les diff&#233;rentes classes d&#8217;applications qui utilisent ou pourraient utili-
ser un g&#233;n&#233;rateur de paraphrases. Nous segmentons ces applications en fonction des traitements r&#233;alis&#233;s,
apr&#232;s g&#233;n&#233;ration, sur les paraphrases propos&#233;es.
</p>
<p>La premi&#232;re cat&#233;gorie correspond aux cas o&#249; les paraphrases ne sont plus modifi&#233;es par le syst&#232;me apr&#232;s
g&#233;n&#233;ration. La paraphrase est une sortie du syst&#232;me global. Les applications fr&#233;quemment cit&#233;es sont :
&#8211; la compression de phrase (Zhao et al., 2009) : le but est de produire une phrase plus courte en nombre
</p>
<p>de caract&#232;res que la phrase d&#8217;origine. Cette application est une version simplifi&#233;e du r&#233;sum&#233; de texte ;
&#8211; la synth&#232;se de la parole (Boidin et al., 2009; Cahill et al., 2009) : le but est de modifier la phrase
</p>
<p>d&#8217;origine afin que la paraphrase produite, une fois vocalis&#233;e, ait une plus grande pertinence. Les travaux
actuels se concentrent sur l&#8217;am&#233;lioration de l&#8217;acoustique. Cette application appartient &#224; cette cat&#233;gorie
car le synth&#233;tiseur vocal ne modifie pas la phrase ni, en particulier, son sens.
</p>
<p>La seconde cat&#233;gorie comprend les syst&#232;mes o&#249; la paraphrase g&#233;n&#233;r&#233;e peut &#234;tre modifi&#233;e. Mais, la phrase
en sortie du syst&#232;me global doit conserver le sens de la phrase d&#8217;entr&#233;e du g&#233;n&#233;rateur de paraphrase. Pour
les applications de ce type, c&#8217;est souvent un op&#233;rateur humain qui r&#233;alise les modifications :
&#8211; l&#8217;aide &#224; l&#8217;&#233;criture (Max, 2008) : le but est de fournir des alternatives &#224; un r&#233;dacteur lorsque celui-ci n&#8217;est
</p>
<p>pas satisfait d&#8217;une partie de la phrase (r&#233;p&#233;tition, terminologie, . . .) ;
&#8211; l&#8217;aide &#224; la conception des messages dans un syst&#232;me de dialogue (Boidin et al., 2009) : le but est de
</p>
<p>proposer des alternatives &#224; un concepteur de syst&#232;me de dialogue humain-machine pour les messages
du syst&#232;me. Par exemple, ces alternatives peuvent prendre en compte l&#8217;ensemble des messages d&#233;j&#224;
construits pour conserver une certaine homog&#233;n&#233;it&#233;.
</p>
<p>Dans la troisi&#232;me cat&#233;gorie, la paraphrase n&#8217;est pas directement reli&#233;e &#224; la sortie du syst&#232;me global. Elle
est une &#233;tape de calcul interm&#233;diaire. En g&#233;n&#233;ral, la paraphrase sert d&#8217;entr&#233;e &#224; un syst&#232;me de traitement
automatique de la langue :
&#8211; un syst&#232;me de recherche d&#8217;information (Sekine, 2005) : le but est d&#8217;am&#233;liorer la couverture des sch&#233;mas
</p>
<p>que le syst&#232;me sait reconna&#238;tre dans un texte en &#171; normalisant &#187; les phrases d&#8217;entr&#233;e gr&#226;ce &#224; la relation
de paraphrase ;
</p>
<p>&#8211; un syst&#232;me de traduction automatique (Callison-Burch et al., 2006) : le but est de remplacer les s&#233;-
quences difficiles &#224; traduire pour le syst&#232;me en s&#233;quence de mots plus facile &#224; traduire. La majorit&#233; des
travaux actuels se concentrent sur le remplacement des mots hors vocabulaires.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;&#201;VALUATION DE PARAPHRASES : POUR UNE PRISE EN COMPTE DE LA T&#194;CHE
</p>
<p>Chacune de ces applications cherche &#224; conserver le sens de la phrase d&#8217;entr&#233;e. Les applications de la pre-
mi&#232;re cat&#233;gorie contraignent fortement la qualit&#233; syntaxique des paraphrases &#224; produire puisqu&#8217;elles sont
pr&#233;sent&#233;es directement &#224; un utilisateur final. La contrainte sur la conservation du sens et sur la naturalit&#233;
des paraphrases produites est en revanche moins forte pour les applications de la seconde cat&#233;gorie puisque
les paraphrases peuvent &#234;tre corrig&#233;es par la suite. Ceci est encore plus vrai pour la troisi&#232;me cat&#233;gorie o&#249;
les paraphrases ne sont pas des sorties du syst&#232;me. Le r&#233;glage du compromis servant &#224; d&#233;finir ce qu&#8217;est
une paraphrase correcte pour une application donn&#233;e est donc d&#233;pendant de la t&#226;che.
</p>
<p>De plus, nous distinguons deux types de probl&#232;mes de g&#233;n&#233;ration. En fonction de la t&#226;che, les mots mo-
difiables peuvent &#234;tre impos&#233;s (Sekine, 2005; Callison-Burch et al., 2006; Max, 2008). C&#8217;est le cas, par
exemple, pour le probl&#232;me de traduction automatique o&#249; ce sont les mots ou expressions hors vocabulaire
qui sont &#224; modifier. D&#8217;autres t&#226;ches n&#8217;imposent pas le lieu de la phrase d&#8217;origine &#224; modifier (Barzilay &amp;
McKeown, 2001; Chevelu et al., 2009; Zhao et al., 2009). C&#8217;est le cas de la compression de texte par
exemple. Ces deux types de probl&#232;mes engendrent deux types de g&#233;n&#233;rateurs potentiellement diff&#233;rents et
difficilement comparables entre eux. C&#8217;est pourquoi nous ne caract&#233;risons pas cette s&#233;paration comme un
objectif de la g&#233;n&#233;ration de paraphrase mais comme deux classes de probl&#232;mes distincts.
</p>
<p>4 Conclusion et discussion
Trop peu de travaux utilisent un crit&#232;re li&#233; &#224; la t&#226;che lors de l&#8217;&#233;valuation et se contentent g&#233;n&#233;ralement
d&#8217;une &#233;valuation de la conservation du sens et parfois de la naturalit&#233;. En comparant un syst&#232;me inutile,
manipulant uniquement des virgules, &#224; un syst&#232;me au niveau de l&#8217;&#233;tat de l&#8217;art, nous avons montr&#233; que
les &#233;valuations bas&#233;es principalement sur la conservation du sens ne sont pas pertinentes. Contrairement
&#224; d&#8217;autres probl&#232;mes de traitement automatique des langues, l&#8217;absence de crit&#232;re de t&#226;ches peut valori-
ser des syst&#232;mes aberrants. Cette sp&#233;cificit&#233; est due &#224; la phrase d&#8217;origine qui est optimale en termes de
conservation du sens mais n&#8217;est pas valide uniquement car les paraphrases doivent lui &#234;tre diff&#233;rentes.
</p>
<p>Nous avons mis en &#233;vidence trois objectifs communs aux probl&#232;mes de production de paraphrases qui
se retrouvent dans les applications. Nous avons pu d&#233;finir la g&#233;n&#233;ration de paraphrase comme la produc-
tion d&#8217;une phrase r&#233;alisant un compromis entre trois crit&#232;res : la conservation du sens, la naturalit&#233; et
l&#8217;adaptation &#224; une t&#226;che. Le lieu des modifications peut &#234;tre impos&#233; ou libre.
</p>
<p>Afin de pouvoir comparer diff&#233;rents syst&#232;mes, nous pensons qu&#8217;il est n&#233;cessaire d&#8217;utiliser un crit&#232;re g&#233;-
n&#233;rique de t&#226;che lors de la description des performances d&#8217;un syst&#232;me. De pr&#233;f&#233;rence, celui-ci doit &#234;tre le
plus simple possible et ne pas n&#233;cessiter de ressources externes. Nous envisageons d&#8217;utiliser la maximisa-
tion du taux d&#8217;erreur en caract&#232;res (CER) :
</p>
<p>CER(Paraphrase|Origine) = distance d&#8217;&#233;dition(Paraphrase,Origine)|Origine|
En effet, nous pensons que plus une paraphrase est diff&#233;rente de la phrase d&#8217;origine en termes de forme,
et plus il est difficile de s&#8217;assurer qu&#8217;elle soit correcte syntaxiquement et s&#233;mantiquement. Ainsi, un g&#233;-
n&#233;rateur capable d&#8217;avoir de bonnes performances sur ces trois crit&#232;res montrerait ses facult&#233;s &#224; produire
des paraphrases vari&#233;es mais serait aussi probablement capable de produire des paraphrases plus simples
si une t&#226;che applicative l&#8217;imposait. Notons qu&#8217;il ne semble pas pertinent de d&#233;finir un niveau minimal de
transformation en dehors de l&#8217;interdiction de l&#8217;identit&#233;. En effet, pour certaines t&#226;ches, comme la synth&#232;se
vocale ou la normalisation de texte, l&#8217;impact d&#8217;une virgule peut &#234;tre tr&#232;s important. Nous pr&#233;f&#232;rerons donc
une mesure continue comme le CER qu&#8217;un seuil arbitraire difficilement r&#233;glable. Pour les syst&#232;mes pr&#233;-
sent&#233;s dans cet article, le CER moyen du syst&#232;me R&#233;f&#233;rence est de 0,178&#177;0,094 contre 0,040&#177;0,036 pour</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JONATHAN CHEVELU, YVES LEPAGE, THIERRY MOUDENC, GHISLAIN PUTOIS
</p>
<p>le syst&#232;me Test. Comme attendu, le syst&#232;me Test affiche des performances plus faibles pour le crit&#232;re de
t&#226;che g&#233;n&#233;rique, ce qui le rend objectivement moins int&#233;ressant pour beaucoup d&#8217;applications.
</p>
<p>Nous avons montr&#233; que la prise en compte simultan&#233;e des trois crit&#232;res est n&#233;cessaire &#224; l&#8217;&#233;valuation cor-
recte des paraphrases. Nous pensons qu&#8217;il en est de m&#234;me avec la production de paraphrase et qu&#8217;il faut
adapter les mod&#232;les et les g&#233;n&#233;rateurs pour remplir conjointement les trois objectifs.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BANNARD C. &amp; CALLISON-BURCH C. (2005). Paraphrasing with bilingual parallel corpora. In Procee-
dings of the 43rd Annual Meeting on Association for Computational Linguistics, p. 597&#8211;604, Ann Arbor,
Michigan, USA : Association for Computational Linguistics.
</p>
<p>BARZILAY R. &amp; MCKEOWN K. R. (2001). Extracting paraphrases from a parallel corpus. In Pro-
ceedings of 39th Annual Meeting of the Association for Computational Linguistics, p. 50&#8211;57, Toulouse,
France : Association for Computational Linguistics.
</p>
<p>BOIDIN C., RIESER V., VAN DER PLAS L., OLIVER L. &amp; CHEVELU J. (2009). Predicting how it
sounds : Re-ranking dialogue prompts based on TTS quality for adaptive Spoken Dialogue Systems. In
Proceedings of the Interspeech Special Session : Machine Learning for Adaptivity in Spoken Dialogue,
p. 2487&#8211;2490, Brighton, UK : ISCA.
</p>
<p>CAHILL P., DU J., WAY A. &amp; JULIE C.-B. (2009). Using Same-Language Machine Translation to
Create Alternative Target Sequences for Text-To-Speech Synthesis. In Proceedings of the 10th Annual
Conference of the International Speech Communication Association (Interspeech 2009), Brighton, UK :
ISCA.
</p>
<p>CALLISON-BURCH C., COHN T. &amp; LAPATA M. (2008). Parametric : an automatic evaluation metric
for paraphrasing. In Proceedings of the 22nd International Conference on Computational Linguistics
(Coling 2008), p. 97&#8211;104, Manchester, UK : Coling 2008 Organizing Committee.
</p>
<p>CALLISON-BURCH C., KOEHN P. &amp; OSBORNE M. (2006). Improved statistical machine translation
using paraphrases. In Proceedings of the main conference on Human Language Technology Conference
of the North American Chapter of the Association of Computational Linguistics, p. 17&#8211;24, Morristown,
NJ, USA : Association for Computational Linguistics.
</p>
<p>CHEVELU J., LAVERGNE T., LEPAGE Y. &amp; MOUDENC T. (2009). Introduction of a new paraphrase
generation tool based on Monte-Carlo sampling. In Proceedings of the ACL-IJCNLP Conference Short
Papers, p. 249&#8211;252, Singapore : Association for Computational Linguistics.
</p>
<p>KOEHN P. (2005). Europarl : a parallel corpus for statistical machine translation. In Procedings of MT
summit X, the tenth machine translation summit, p. 79&#8211;86, Phuket, Thailand : Asia-Pacific Association
for Machine Translation.
</p>
<p>MAX A. (2008). G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision. In Actes de
TALN 2008 (Traitement automatique des langues naturelles), Avignon : ATALA.
</p>
<p>SEKINE S. (2005). Automatic paraphrase discovery based on context and keywords between ne pairs. In
Proceedings of International Workshop on Paraphrase (IWP2005).
</p>
<p>ZHAO S., LAN X., LIU T. &amp; LI S. (2009). Application-driven statistical paraphrase generation. In Pro-
ceedings of the Joint Conference of the 47th Annual Meeting of the ACL and the 4th International Joint
Conference on Natural Language Processing of the AFNLP, p. 834&#8211;842, Suntec, Singapore : Association
for Computational Linguistics.</p>

</div></div>
</body></html>