<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L&#8217;apport d&#8217;une approche hybride pour la reconnaissance des entit&#233;s nomm&#233;es en langue arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>L&#8217;apport d&#8217;une approche hybride pour la reconnaissance des entit&#233;s 
nomm&#233;es en langue arabe  
</p>
<p>In&#232;s Zribi, Souha Mezghani Hammami, Lamia Hadrich Belguith 
</p>
<p>ANLP Research Group &#8211; Laboratoire MIRACL 
Facult&#233; des Sciences Economiques et de Gestion de Sfax 
</p>
<p>B.P. 1088, 3018 - Sfax &#8211; TUNISIE 
T&#233;l&#233;phone (216) 74 278 777, Fax (216) 74 279 139 
</p>
<p>ineszribi@gmail.com, souha.mezghani@fsegs.rnu.tn, l.belguith@fsegs.rnu.tn 
</p>
<p>R&#233;sum&#233;. Dans cet article, nous proposons une m&#233;thode hybride pour la reconnaissance des entit&#233;s 
nomm&#233;es pour la langue arabe. Cette m&#233;thode profite, d&#8217;une part, des avantages de l&#8217;utilisation d&#8217;une 
m&#233;thode d&#8217;apprentissage pour extraire des r&#232;gles permettant l&#8217;identification et la classification des entit&#233;s 
nomm&#233;es. D&#8217;autre part, elle repose sur un ensemble de r&#232;gles extraites manuellement pour corriger et 
am&#233;liorer le r&#233;sultat de la m&#233;thode d&#8217;apprentissage. Les r&#233;sultats de l&#8217;&#233;valuation de la m&#233;thode propos&#233;e sont 
encourageants. Nous avons obtenu un taux global de F-mesure &#233;gal &#224; 79.24%. 
</p>
<p>Abstract. In this paper, we propose a hybrid method for Arabic named entities recognition. This method 
takes advantage of the use of a learning method to extract rules for the identification and classification of 
named entities. Moreover, it is based on a set of rules extracted manually to correct and improve the outcome 
of the learning method. The evaluation results are encouraging as we get an overall F-measure equal to 
79.24%. 
</p>
<p>Mots-cl&#233;s : Traitement de la langue arabe, reconnaissance des entit&#233;s nomm&#233;es, m&#233;thode 
d&#8217;apprentissage. 
Keywords: Arabic language processing, named entity recognition, learning method. 
</p>
<p>1 Introduction 
La reconnaissance des entit&#233;s nomm&#233;es (REN) est devenue une t&#226;che n&#233;cessaire pour plusieurs applications 
de TAL et plus particuli&#232;rement pour le processus de r&#233;solution automatique des anaphores. Un syst&#232;me de 
r&#233;solution automatique des anaphores n&#233;cessite, tout d&#8217;abord, l&#8217;identification des expressions anaphoriques et 
la liste des ant&#233;c&#233;dents candidats afin de r&#233;soudre le lien entre ces deux &#233;l&#233;ments. Donc, leur efficacit&#233; 
d&#233;pend de la bonne identification des ant&#233;c&#233;dents (Hammami et al., 2009). Et puisque la plupart des 
ant&#233;c&#233;dents sont des groupes nominaux, alors l&#8217;identification des entit&#233;s nomm&#233;es (EN) pour un syst&#232;me de 
r&#233;solution des anaphores est fondamentale pour assurer une bonne r&#233;solution.  
La reconnaissance des noms propres pour l&#8217;arabe diff&#232;re des autres langues telles que les langues indo-
europ&#233;ennes. Elle se heurte &#224; plusieurs probl&#232;mes dus aux particularit&#233;s de cette langue. Dans ce travail, nous 
proposons une m&#233;thode hybride qui se base sur des r&#232;gles g&#233;n&#233;r&#233;es automatiquement capables d&#8217;identifier les 
mots qui composent les EN et sur un ensemble de r&#232;gles g&#233;n&#233;riques extraites manuellement pour reconnaitre </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INES ZRIBI, SOUHA MEZGHANI HAMMAMI, LAMIA HADRICH BELGUITH 
les EN. Nous exposons, en premier lieu, un aper&#231;u sur les travaux qui ont &#233;t&#233; r&#233;alis&#233;s. Ensuite, nous exposons 
les probl&#232;mes de REN li&#233;s aux sp&#233;cificit&#233;s de la langue arabe. Puis, nous d&#233;crivons la m&#233;thode propos&#233;e pour 
r&#233;soudre la t&#226;che de REN pour l&#8217;arabe. Enfin, nous pr&#233;sentons une &#233;valuation et nous discutons les r&#233;sultats 
obtenus. 
</p>
<p>2 Les travaux ant&#233;rieurs 
Les travaux de REN sont class&#233;s principalement selon trois types d&#8217;approches : (i) l&#8217;approche linguistique qui 
se base sur des r&#232;gles g&#233;n&#233;riques &#233;crites &#224; la main, (ii) l&#8217;approche num&#233;rique qui se base sur un m&#233;canisme 
d&#8217;apprentissage &#224; partir d&#8217;un grand corpus de textes pr&#233;-&#233;tiquet&#233;s et (iii) l&#8217;approche hybride qui pr&#233;sente une 
combinaison de ces deux approches (Mansouri et al., 2008). Dans la litt&#233;rature, plusieurs travaux de REN ont 
&#233;t&#233; effectu&#233;s pour les langues indo-europ&#233;ennes. Dans le cadre de l&#8217;approche linguistique, nous signalons le 
syst&#232;me de REN propos&#233; par (Wacholder et al., 1997) qui ont d&#233;finit un ensemble d&#8217;heuristiques bas&#233;es sur 
des indicateurs sans l&#8217;utilisation ni de listes de noms propres ni d&#8217;informations syntaxiques pour la d&#233;tection 
des EN. Dans le cadre de l&#8217;approche num&#233;rique (Malouf, 2003) a utilis&#233; les mod&#232;les de Markov cach&#233; pour 
r&#233;soudre la t&#226;che de REN pour la langue anglaise. Par contre, peu de travaux ont &#233;tudi&#233; la t&#226;che de REN pour 
la langue arabe. Parmi ces travaux, nous notons celui Shaalan et Raza (Shaalan, Raza, 2008) ont con&#231;u leur 
syst&#232;me NERA qui permet de reconnaitre dix types des EN. Ce syst&#232;me se base sur un lexique form&#233; de listes 
de dictionnaires des EN et sur une grammaire sous forme d'expressions r&#233;guli&#232;res pour l&#8217;identification des 
EN. Les valeurs F-mesure obtenues par ce syst&#232;me varient entre 83.15% et 98.6%. De m&#234;me, (Zaghouani et 
al., 2010) ont pr&#233;sent&#233; un module de rep&#233;rage des EN &#224; base de r&#232;gles pour la langue arabe. Ce module est 
constitu&#233; de trois &#233;tapes : une &#233;tape de  pr&#233;traitement lexicale qui pr&#233;pare le texte pour son analyse 
linguistique, une &#233;tape de rep&#233;rage des EN reconnues gr&#226;ce &#224; un dictionnaire et une &#233;tape de rep&#233;rage des EN 
bas&#233;e sur des r&#232;gles &#233;crites &#224; la main sous forme d&#8217;expressions r&#233;guli&#232;res. Ce module a &#233;t&#233; &#233;valu&#233; sur un 
corpus compos&#233; d&#8217;articles de presse. Les valeurs de F-mesure apport&#233;es par ce syst&#232;me varient 
respectivement entre 47.35% pour le type organisation et 95.10% pour le type date. D&#8217;autre part, et dans le 
cadre de l&#8217;approche num&#233;rique, Benajiba et al (Benajiba et al., 2009) ont propos&#233; le mod&#232;le d&#8217;apprentissage 
SVM pour la r&#233;alisation de leur syst&#232;me de REN en exploitant un ensemble de caract&#233;ristiques. Certaines de 
ces caract&#233;ristiques sont sp&#233;cifiques &#224; la langue arabe et d&#8217;autres non. Ce syst&#232;me a rapport&#233; une F-mesure 
globale qui atteint 82.71%. De m&#234;me, Farber et al. (Farber et al., 2008) ont explor&#233; des caract&#233;ristiques 
morphologiques de l&#8217;arabe dans un mod&#232;le d&#8217;apprentissage bas&#233; sur le perceptron structur&#233;. L&#8217;exploitation de 
cette information a donn&#233; une valeur de F-mesure &#233;quivalente &#224; 71.5%. En tirant profit de l&#8217;approche 
linguistique et statistique, Abuleil (Abuleil, 2006) a adopt&#233; une approche hybride. En effet, il a exploit&#233; des 
r&#232;gles pour le marquage des syntagmes nominaux contenant des noms propres, des graphiques pour 
l&#8217;extraction des noms propres candidates et, enfin, des statistiques pour la classification des noms propres et 
ceci en exploitant des listes de mots d&#233;clencheurs. 
</p>
<p>3 Difficult&#233;s de la reconnaissance des entit&#233;s nomm&#233;es en arabe 
La REN est une t&#226;che complexe mais son niveau de complexit&#233; ne se limite pas seulement aux probl&#232;mes 
th&#233;oriques de REN tels que l&#8217;imbrication ou la coordination des EN si la langue &#233;tudi&#233;e est l&#8217;arabe, mais 
aussi &#224; certaines sp&#233;cificit&#233;s de cette langue &#224; savoir : 
</p>
<p>&#8226; L&#8217;absence des lettres majuscules : c&#8217;est un obstacle majeur pour la langue arabe. En fait, la REN 
pour certaines langues comme les langues indo-europ&#233;ennes se base principalement sur la pr&#233;sence 
des lettres majuscules.  
</p>
<p>&#8226; L&#8217;absence des voyelles : un mot non voyell&#233; pr&#233;sente de nombreuses ambigu&#239;t&#233;s au niveau du sens 
ou de la fonction syntaxique. Par exemple, le mot &#171; &#1592;&#1601;&#1575;&#1581; &#187; /HAfZ/ peut &#234;tre un verbe (sauvegarder) 
pour une voyellation ou un nom propre (Hafez) pour une autre. Donc, l&#8217;absence des voyelles est 
consid&#233;r&#233;e comme un autre obstacle pour la t&#226;che de REN.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;APPORT D&#8217;UNE APPROCHE HYBRIDE POUR LA RECONNAISSANCE DES ENTITES NOMMEES EN LANGUE ARABE 
&#8226; Morphologie complexe : l'arabe est une langue fortement flexionnelle. Elle utilise une strat&#233;gie 
</p>
<p>agglutinative pour former un mot. Si une EN apparait avec une forme agglutinative alors ceci pose 
une difficult&#233; pour l&#8217;identification de cette entit&#233;.  
</p>
<p>4 M&#233;thode propos&#233;e 
L&#8217;id&#233;e principale de notre m&#233;thode consiste &#224; utiliser un ensemble de r&#232;gles pour extraire et classer les EN. 
En effet, nous utilisons, d&#8217;une part, un ensemble de r&#232;gles g&#233;n&#233;r&#233;es automatiquement &#224; l&#8217;aide d&#8217;un algorithme 
d&#8217;apprentissage. Ces r&#232;gles doivent apprendre la structure et le contexte dans lequel apparaissent les EN. 
D&#8217;autre part, nous proposons un autre ensemble de r&#232;gles extraites manuellement pour corriger et am&#233;liorer 
le r&#233;sultat de l&#8217;application des r&#232;gles g&#233;n&#233;r&#233;es automatiquement. Notre m&#233;thode est compos&#233;e de trois 
principales &#233;tapes (voir Figure 1) : une &#233;tape d&#8217;extraction de r&#232;gles, une &#233;tape de validation de ces r&#232;gles et, 
enfin, une &#233;tape d&#8217;extraction des EN. Au niveau de ces trois &#233;tapes, nous choisissons d&#8217;appliquer une analyse 
morphologique afin de rem&#233;dier aux erreurs engendr&#233;es par la nature agglutinative de la langue arabe, et pour 
d&#233;terminer pour chaque mot du corpus les diff&#233;rentes caract&#233;ristiques morphosyntaxiques (genre, nombre, 
type, etc.). Par ailleurs, le module d&#8217;extraction des attributs se base sur des listes de lexique de noms propres 
et sur l&#8217;ensemble des caract&#233;ristiques morphologiques pour d&#233;terminer les valeurs des attributs dans les 
diff&#233;rents contextes pour chaque mot du corpus. Les deux modules (analyse morphologique et extraction 
d&#8217;attributs) constituent une &#233;tape de pr&#233;paration pour les trois &#233;tapes de notre m&#233;thode.  Pour standardiser 
notre travail de REN, nous avons adopt&#233; la d&#233;finition propos&#233;e par la conf&#233;rence CoNLL (Erik et al., 2003) 
pour les EN. Par cons&#233;quent, les EN appartiennent &#224; quatre classes : personne, lieu, organisation et divers. 
Cette derni&#232;re classe regroupe toutes les autres EN. De m&#234;me, nous avons utilis&#233; un corpus d&#8217;apprentissage 
annot&#233; selon le format propos&#233; par cette conf&#233;rence et le sch&#232;me d&#8217;annotation BIO1. Nous avons exploit&#233; le 
corpus ANERcorp2. Ce dernier est form&#233; de 150.000 mots extraits d&#8217;un ensemble d&#8217;articles de presse de 
types vari&#233;s. Il contient 10.519 EN de type lieu, organisation et personne. L&#8217;apprentissage a &#233;t&#233; r&#233;alis&#233; sur 
76.608 mots contenant 5.192 EN. Pour la validation des r&#232;gles, nous avons utilis&#233; 38.488 mots contenant 
2.778 EN et le reste du corpus a &#233;t&#233; utilis&#233; pour tester la performance du notre syst&#232;me. Actuellement, notre 
syst&#232;me se limite uniquement aux types personne, lieu et organisation.  
</p>
<p>4.1 Extraction de r&#232;gles 
</p>
<p>La premi&#232;re &#233;tape consiste &#224; extraire automatiquement des r&#232;gles capables de d&#233;tecter les mots qui 
composent les EN selon leur type. Ces r&#232;gles permettent la classification des mots selon trois types. Elles 
d&#233;terminent si un mot constitue le premier syntagme d&#8217;une EN (B-TYPE), ou s&#8217;il appartient &#224; une EN (I-
TYPE) ou s&#8217;il n&#8217;appartient pas &#224; une EN (O). Pour ce faire, nous avons utilis&#233; l&#8217;algorithme d&#8217;apprentissage 
des r&#232;gles RIPPER (Cohen, 1995). Cet algorithme s&#8217;av&#232;re efficace pour des donn&#233;es bruit&#233;es et il a une 
&#233;volutivit&#233; quasi lin&#233;aire avec le nombre d'exemples dans un corpus d&#8217;apprentissage. RIPPER (Cohen, 1995) 
a utilis&#233; un ensemble d&#8217;attributs qui pr&#233;sentent les &#233;l&#233;ments les plus influents sur le r&#233;sultat de 
l&#8217;apprentissage. Nous avons choisi d&#8217;utiliser deux types d&#8217;attributs pour l&#8217;extraction des r&#232;gles : attributs 
morphologiques et attributs &#224; base de lexique de noms propres. Pour ces attributs, nous avons exploit&#233; un 
contexte de +/- 5 mots ; c'est-&#224;-dire, on &#233;tudie les cinq mots qui sont situ&#233;s avant et apr&#232;s le mot &#224; classer. 
Nous avons s&#233;lectionn&#233; quatre caract&#233;ristiques morphologiques pour les inclure dans cette &#233;tude : la cat&#233;gorie 
et le type du mot,  le proclitique et le type du proclitique qui est rattach&#233; &#224; ce mot. Pour les attributs &#224; base de 
lexique de noms propres, nous avons utilis&#233; des listes contenant des EN connues auparavant (2.391, 615 et 
683 entr&#233;es respectivement pour le type personne, lieu et organisation) ainsi que des listes de mots 
d&#233;clencheurs (189, 122 et 50 entr&#233;es respectivement pour le type personne, lieu et organisation). De m&#234;me, 
nous avons employ&#233; des listes pour les nationalit&#233;s (250 nationalit&#233;s). Pour former ces listes, nous nous 
sommes bas&#233;s sur  ANERgazet2 utilis&#233;s par (Benajiba, Rosso, 2007) et les listes de nom propre et de mots 
d&#233;clencheurs d&#233;finis dans le cadre de logiciel GATE (Hepple et al., 2000). Nous les avons enrichies par 
                                                 
</p>
<p>1
  Le sch&#232;me d&#8217;annotation BIO ou IOB : on &#233;tiquette en tant que &#171;B&#187; le premier mot d'une EN, &#171;I&#187; pour le mot &#224; l'int&#233;rieur d'une 
</p>
<p>EN et les mots qui ne sont pas des EN  sont &#233;tiquet&#233;s comme &#171;O&#187;. 
2
  http://www1.ccls.columbia.edu/~ybenajiba/downloads.html </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INES ZRIBI, SOUHA MEZGHANI HAMMAMI, LAMIA HADRICH BELGUITH 
d&#8217;autres entr&#233;es &#224; partir du web. L&#8217;algorithme RIPPER a g&#233;n&#233;r&#233; 46 r&#232;gles pour le type personne, 48 pour le 
type lieu et 40 r&#232;gles pour le type organisation. Consid&#233;rons l&#8217;EN &#171;&#1577;&#1586;&#1594; &#1602;&#1585;&#1588;&#187; (Est de Gaza) /$rq gzp/. La 
d&#233;tection de cette EN se base sur les deux r&#232;gles suivantes :  
</p>
<p>&#8226; (Direction = y) and (POS+1 = &#1605;&#1587;&#1575;_&#1605;&#1604;&#1593; ) =&gt; Decision=B-LOC : si le mot &#224; classer d&#233;signe une 
direction et il est suivi par un nom propre alors ce mot pr&#233;sente le premier mot d&#8217;une EN de lieu. 
</p>
<p>&#8226; (Direction-1 = y) and (POS = &#1605;&#1587;&#1575;_&#1605;&#1604;&#1593; ) =&gt; Decision=I-LOC: si le mot &#224; classer est un nom propre et 
il est pr&#233;c&#233;d&#233; par une direction alors ce mot appartient &#224; une EN de type lieu.  
</p>
<p> 
</p>
<p>4.2 Validation des r&#232;gles 
</p>
<p>Apr&#232;s l&#8217;extraction des r&#232;gles, l&#8217;&#233;tape suivante a pour but de les raffiner afin d&#8217;assurer leurs validit&#233;s. Le 
processus de validation calcule pour chaque r&#232;gle le nombre de mots bien class&#233;s et le nombre de mots mal 
class&#233;s. Si le nombre de mots correctement class&#233;s (NBbc) par une r&#232;gle est sup&#233;rieur au nombre de mots mal 
class&#233;s (NBmc), alors cette r&#232;gle est dite valide et elle sera ajout&#233;e &#224; l&#8217;ensemble des r&#232;gles valides avec un 
score S= NBbc / (NBbc+NBmc). Dans le cas o&#249; une r&#232;gle n&#8217;est pas activ&#233;e dans le corpus de validation, elle 
est automatiquement ajout&#233;e &#224; l&#8217;ensemble des r&#232;gles valid&#233;es, mais avec un score &#233;gal &#224; 0. Selon les scores 
trouv&#233;s, nous trions ces r&#232;gles en ordre d&#233;croissant. Au niveau de cette &#233;tape, nous avons &#233;limin&#233; 11 r&#232;gles 
parmi 37 pour le type personne, 18 r&#232;gles parmi 48 pour le type lieu et 8 r&#232;gles parmi 43 pour le type 
organisation. 
</p>
<p>4.3 Extraction des entit&#233;s nomm&#233;es 
</p>
<p>L&#8217;&#233;tape d&#8217;extraction des EN se d&#233;roule en deux phases. La premi&#232;re vise &#224; identifier les mots qui composent 
les EN en appliquant les r&#232;gles g&#233;n&#233;r&#233;es automatiquement, issues de l&#8217;&#233;tape de validation. Une EN est bien 
class&#233;e si tous les mots qui la composent prennent les &#233;tiquettes correctes. Mais, dans certain cas, 
l&#8217;application de ces r&#232;gles ne suffisse pas pour reconnaitre les diff&#233;rents syntagmes qui composent une EN. 
Par exemple, l&#8217;application des r&#232;gles n&#8217;a pas pu reconnaitre le mot &#171; &#1604;&#1575;&#1605;&#1593;&#1604;&#1575; &#187; (ouvriers) /AlEmAl/ comme une 
partie de l&#8217;EN &#171;&#1610;&#1606;&#1575;&#1578;&#1587;&#1583;&#1585;&#1603;&#1604;&#1575; &#1604;&#1575;&#1605;&#1593;&#1604;&#1575; &#1576;&#1586;&#1581; &#187; (Parti des ouvriers Kurdistan) /Hzb AlEmAl AlkrdstAny/ et donc on 
obtient l&#8217;annotation (B-ORG O I-ORG) au lieu de (B-ORG I-ORG I-ORG).  La seconde phase de l&#8217;extraction 
des EN permet la correction des erreurs engendr&#233;es par la premi&#232;re phase. Par exemple, si on veut corriger 
l&#8217;erreur dans l&#8217;annotation (B-ORG O I-ORG) pour l&#8217;EN &#171;&#1610;&#1606;&#1575;&#1578;&#1587;&#1583;&#1585;&#1603;&#1604;&#1575; &#1604;&#1575;&#1605;&#1593;&#1604;&#1575; &#1576;&#1586;&#1581; &#187;, alors, on doit appliquer la 
r&#232;gle suivante : &#171; classe_mot= O and classe_mot-1=B-ORG and classe_mot+1= I-ORG =&gt; classe_mot=I-
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Phase d&#8217;extraction des r&#232;gles 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Phase d&#8217;extraction des entit&#233;s nomm&#233;es 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Phase de validation des r&#232;gles 
</p>
<p>Extraction des attributs Analyse  
Morphologique 
</p>
<p>Corpus 
d&#8217;apprentissage 
</p>
<p>annot&#233;  
</p>
<p>Application de  
l&#8217;algorithme RIPPER R&#232;gles  
</p>
<p>Corpus de  
validation 
</p>
<p>annot&#233;  
</p>
<p>Texte 
</p>
<p>Validation des r&#232;gles 
</p>
<p>Application des r&#232;gles 
</p>
<p>R&#232;gles  
</p>
<p>Texte annot&#233; 
</p>
<p>Analyse  
Morphologique 
</p>
<p>Analyse  
Morphologique 
</p>
<p>Extraction des attributs 
</p>
<p>Extraction des attributs 
</p>
<p>Correction des 
 r&#233;sultats 
</p>
<p>R&#232;gles de 
rectification 
</p>
<p>Lexique 
de noms 
propres 
</p>
<p> 
</p>
<p>Etape de pr&#233;paration 
</p>
<p>Figure 1 : Les &#233;tapes de la m&#233;thode propos&#233;e. 
</p>
<p> 
</p>
<p>Etape de pr&#233;paration 
</p>
<p> 
</p>
<p>Etape de pr&#233;paration </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;APPORT D&#8217;UNE APPROCHE HYBRIDE POUR LA RECONNAISSANCE DES ENTITES NOMMEES EN LANGUE ARABE 
ORG &#187;. Cette r&#232;gle signifie que si un mot porte l&#8217;&#233;tiquette O et s&#8217;il est pr&#233;c&#233;d&#233; par un mot qui porte 
l&#8217;&#233;tiquette B-ORG et suivi par un mot qui porte l&#8217;&#233;tiquette I-ORG, alors, ce mot appartient &#224; une EN de type 
organisation et l&#8217;&#233;tiquette O sera remplac&#233;e par l&#8217;&#233;tiquette I-ORG.  
</p>
<p>5 Evaluation 
Nous avons men&#233; deux &#233;valuations. Au niveau de la premi&#232;re &#233;valuation, nous avons utilis&#233; seulement les 
r&#232;gles g&#233;n&#233;r&#233;es automatiquement. A la seconde, nous avons ajout&#233; la phase de correction des r&#233;sultats qui 
utilise des r&#232;gles extraites manuellement. En examinant les mesures de rappel, pr&#233;cision et F-mesure 
calcul&#233;es sur le corpus d&#8217;&#233;valuation, nous remarquons que les r&#233;sultats sont tr&#232;s encourageants. En effet, 
l&#8217;utilisation d&#8217;un module de rectification a am&#233;lior&#233; les r&#233;sultats d&#8217;une mani&#232;re significative (&#224; peu pr&#233;s 9%). 
Cela justifie notre choix pour une m&#233;thode hybride.  
</p>
<p> Evaluation avec les r&#232;gles g&#233;n&#233;r&#233;es automatiquement Evaluation avec les deux phases 
</p>
<p>Rappel Pr&#233;cision F-mesure Rappel  Pr&#233;cision F-mesure 
</p>
<p>Personne 63.69% 76.94% 69.69% 74.86% 86.54% 80.28% 
</p>
<p>Lieu 81.95% 81.59% 81.77% 8494% 87.96% 86.42% 
</p>
<p>Organisation 45.361% 59.81% 51.61% 55.85% 75.36% 64.15% 
</p>
<p>Global  66.12% 75.54% 70.51% 74.22% 84.99% 79.24 
</p>
<p>Tableau 1 : R&#233;sultats de l&#8217;&#233;valuation. 
Notons qu&#8217;&#224; la diff&#233;rence de la m&#233;thode propos&#233;e par Abuleil (Abuleil, 2006), notre m&#233;thode utilise un 
ensemble des r&#232;gles g&#233;n&#233;r&#233;es automatiquement et d&#8217;autres extraites manuellement pour la classification et 
l&#8217;identification simultan&#233;e des EN, en profitant d&#8217;un ensemble de caract&#233;ristiques morphologiques et d&#8217;une 
liste de lexique de noms propres. De plus, nous avons compar&#233; notre syst&#232;me avec le syst&#232;me ANERsys2.0 
(Benajiba, Rosso, 2007) qui mod&#233;lise le probl&#232;me de REN avec l&#8217;entropie maximale comme une approche en 
deux &#233;tapes de classification s&#233;parant la d&#233;tection des fronti&#232;res de la classification des EN sans 
l&#8217;exploitation de l&#8217;information morphologique (ce syst&#232;me a obtenu une F-mesure &#233;gale &#224; 86.71%, 45.02% et 
52.13% respectivement pour les types lieu, organisation et personne). La comparaison de ces r&#233;sultats montre 
l&#8217;apport de l&#8217;utilisation des informations morphologiques pour la t&#226;che de REN pour l&#8217;arabe. Nous avons, 
aussi, compar&#233; notre syst&#232;me avec ceux d&#233;velopp&#233;s par (Benajiba et al., 2009) et (Zaghouani et al., 2010). 
Les r&#233;sultats de la comparaison sont utilis&#233;s &#224; des fins d'illustration uniquement et ils sont r&#233;sum&#233;s dans le 
tableau 2. Bien que les trois syst&#232;mes aient utilis&#233;s des corpus diff&#233;rents pour leurs &#233;valuations, nous pouvons 
affirmer que les r&#233;sultats obtenus par notre syst&#232;me sont, dans certains cas, meilleurs que celles obtenus par 
les deux autres syst&#232;mes. 
</p>
<p> 
</p>
<p>Notre syst&#232;me Syst&#232;me de (Benajiba et al., 2009) Syst&#232;me de (Zaghouani et al., 2010) 
</p>
<p>Personne 80.28% 81.55% 75.40 % 
</p>
<p>Lieu 86.42% 87.04% 82.33 % 
</p>
<p>Organisation 64.15% 54.36% 47.35 % 
</p>
<p>Tableau 2: Tableau comparatif des valeurs des F-mesures par les trois syst&#232;mes. 
L&#8217;&#233;chec d&#8217;identification et de la classification de quelques EN peut s&#8217;expliquer par la pr&#233;sence de quelques 
erreurs. Parmi ces erreurs, nous notons : (i) des erreurs dues &#224; la segmentation des mots avec l&#8217;analyse 
morphologique (certains noms propres &#233;trangers ressemblent &#224; des mots agglutin&#233;es lorsqu&#8217;ils sont 
translitt&#233;r&#233;s en arabe). Par exemple, le nom propre &#171; Virginie &#187; sera translitt&#233;r&#233; en &#171; &#1610;&#1606;&#1610;&#1580;&#1585;&#1610;&#1601;&#187; (et il esp&#232;re de 
moi) qui d&#233;signe un verbe auquel s&#8217;attache une conjonction de coordination &#171; &#1601;&#187; (et). Donc avec cette </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>INES ZRIBI, SOUHA MEZGHANI HAMMAMI, LAMIA HADRICH BELGUITH 
segmentation, on ne peut pas appliquer certaines r&#232;gles et l&#8217;EN ne sera pas reconnue) (ii) des erreurs dues &#224; 
des insuffisances dans le corpus d&#8217;apprentissage (la g&#233;n&#233;ration des r&#232;gles de REN se base sur la structure et le 
contexte de l&#8217;EN. Si une EN apparait dans un contexte diff&#233;rent &#224; celui du corpus d&#8217;apprentissage, alors elle 
ne sera pas reconnue). 
</p>
<p>6 Conclusion et perspectives 
Dans cet article, nous avons propos&#233; une m&#233;thode hybride pour la reconnaissance des entit&#233;s en arabe qui se 
base sur une m&#233;thode d&#8217;apprentissage automatique des r&#232;gles et sur un ensemble de r&#232;gles extraites 
manuellement. La m&#233;thode d&#8217;apprentissage permet la g&#233;n&#233;ration d&#8217;un ensemble de r&#232;gles permettant 
l&#8217;identification des entit&#233;s nomm&#233;es. Le r&#233;sultat de l&#8217;application de ces r&#232;gles est am&#233;lior&#233; par  un ensemble 
de r&#232;gles extraites manuellement. La valeur de F-mesure obtenue par la premi&#232;re &#233;tape de notre m&#233;thode a 
atteint une valeur F-mesure globale &#233;gale &#224; 70.51%. Cette valeur a &#233;t&#233; am&#233;lior&#233;e d&#8217;environ 9% par 
l&#8217;application de la deuxi&#232;me &#233;tape. Comme perspective, nous envisageons d'abord d&#8217;&#233;tudier d&#8217;autres attributs 
pour am&#233;liorer la qualit&#233; des r&#232;gles g&#233;n&#233;r&#233;es avec RIPPER. Ensuite, nous visons &#224; &#233;tendre les corpus 
d&#8217;apprentissage et de validation afin de couvrir le maximum d&#8217;EN.  
</p>
<p>R&#233;f&#233;rences   
ABULEIL S. (2006). Hybrid System for Extracting and Classifying Arabic Proper Names. Proceedings of the 
WSEAS Int.Conf. on Artificial Intelligence, Knowledge Engineering and Data Bases, Madrid-Spain, 205-210. 
BENAJIBA Y, DIAB M, ROSSO P. (2009). Using Language Independent and Language Specific Features to 
Enhance Arabic Named Entity Recognition. The International Arab Journal of Information Technology, Vol. 
6, No. 5, November 2009, 464-472. 
BENAJIBA Y, ROSSO P. (2007). ANERsys2.0: Conquering the NER Task for the Arabic Language by 
Combining the Maximum Entropy with POS-tag Information. The Proceedings of Workshop on Natural 
Language Independent Engineering IICAI, India, 36-40. 
COHEN W. (1995). Fast Effective Rule Induction. In Proceedings of the 12th International Conference on 
Machine Learning (ICML&#8217;95), Lake Tahoe, USA, Morgan Kaufmann, 115-123. 
ERIK F, TJONG KIM S, FIEN DE M. (2003). Introduction to the CoNLL-2003 Shared Task: Language-
Independent Named Entity Recognition. In Proc. of CoNLL-2003. 142-147. 
FARBER B, FREITAG D, HABASH N, RAMBOW O. (2008). Improving NER in Arabic using a morphological 
tagger. In Proceedings of LREC 2008, Marrakech, Marroc. 
HAMMAMI S, BELGUITH L, BEN HAMADOU A. (2009). Arabic Anaphora Resolution: Corpora Annotation with 
Coreferential links. The international Arab Journal of Information Technology, vol. 6, No.5, November 2009, 
pp481-489. 
HEPPLE M, HERRING P, MITCHELL B, OAKES M, PETERS W, SETZER A, STEVENSON M, TABLAN V, URSU C, 
WILKS Y.(2000). A Survey of Uses of GATE, Technical Report CS-00-06, Department of Computer Science, 
University of Sheffield. 
MALOUF R. (2003). Markov Models for Language-Independent Named Entity Recognition. In Proceedings of 
CoNLL-2003, Edmonton, Canada. 
MANSOURI A, SURIANI AFFENDEY L, MAMAT A. (2008). Named Entity Recognition Approaches. IJCSNS 
International Journal of Computer Science and Network Security, VOL.8 No.2, February 2008. 339-344. 
SHAALAN K, RAZA A. (2008). Arabic Named Entity Recognition from Diverse Text Types. In Eds. 
Nordstr&#246;m, B., and Ranta, A., (Eds.) GoTAL 2008: 6th International Conference on Natural Language 
Processing, Gothenburg, Sweden, August 25-27, Lecture Notes in Computer Science/Lecture Notes in 
Artificial Intelligence (LNCS/LNAI): Advances in Natural Language Proceedings, Vol. 5221, 440-451, 
Springer-Verlag, Berlin, Germany, 2008. 
WACHOLDER N, RAVIN Y, CHOI M. (1997). Disambiguation of Proper Names in Text. In Proceedings of the 
5th Conference on Applied Natural Language Processing, Washington, D.C, 202-208. 
ZAGHOUANI W, POULIQUEN B, EBRAHIM M, STEINBERGER R. (2010). Adapting a resource-light highly 
multilingual Named Entity Recognition system to Arabic. In Proceedings of LREC 2010, Valetta-Malta. </p>

</div></div>
</body></html>