<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Approche quantitative en syntaxe : l&#8217;exemple de l&#8217;alternance de position de l&#8217;adjectif &#233;pith&#232;te en fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Approche quantitative en syntaxe : l&#8217;exemple de l&#8217;alternance de
position de l&#8217;adjectif &#233;pith&#232;te en fran&#231;ais
</p>
<p>J. Thuilier&#8902;, G. Fox&#8900;, B. Crabb&#233;&#8902;
&#8902; Universit&#233; Paris VII Denis Diderot
</p>
<p>UFRL et INRIA (Alpage)
&#8900; Universit&#233; Paris III Sorbonne-Nouvelle
</p>
<p>ILPGA et EA 1483
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente une analyse statistique sur des donn&#233;es de syntaxe qui a pour but d&#8217;aider
&#224; mieux cerner le ph&#233;nom&#232;ne d&#8217;alternance de position de l&#8217;adjectif &#233;pith&#232;te par rapport au nom en fran&#231;ais.
Nous montrons comment nous avons utilis&#233; les corpus dont nous disposons (French Treebank et le corpus
de l&#8217;Est-R&#233;publicain) ainsi que les ressources issues du traitement automatique des langues, pour mener
&#224; bien notre &#233;tude. La mod&#233;lisation &#224; partir de 13 variables relevant principalement des propri&#233;t&#233;s du
syntagme adjectival, de celles de l&#8217;item adjectival, ainsi que de contraintes bas&#233;es sur la fr&#233;quence, permet
de pr&#233;dire &#224; plus de 93% la position de l&#8217;adjectif. Nous insistons sur l&#8217;importance de contraintes relevant
de l&#8217;usage pour le choix de la position de l&#8217;adjectif, notamment &#224; travers la fr&#233;quence d&#8217;occurrence de
l&#8217;adjectif, et la fr&#233;quence de contextes dans lesquels il appara&#238;t.
Abstract. This article presents a statistical analysis of syntactic data that aims to better understand
the phenomenon of position alternation displayed by attributive adjectives with respect to nouns in French.
We show how we used the corpora available for French (the French Treebank and the Est-R&#233;publicain cor-
pus) as well as ressources provided by Natural Language Processing for our study. The proposed model
contains 13 variables based on properties of the adjectival phrase, the adjectival item and on frequency
constraints. This model is capable to predict the position of adjectives at more than a 93% rate. We espe-
cially focus on the importance of constraints based on usage for the choice of position for the adjective, in
particular the frequency of contexts in which it appears.
</p>
<p>Mots-cl&#233;s : Syntaxe probabiliste, linguistique de corpus, adjectif &#233;pith&#232;te, r&#233;gression logistique.
Keywords: Probabilistic syntax, corpus linguistics, attributive adjective, logistic regression.
</p>
<p>1 Introduction
</p>
<p>La position de l&#8217;adjectif &#233;pith&#232;te par rapport au nom en fran&#231;ais est un probl&#232;me bien connu en linguis-
tique fran&#231;aise. Ce ph&#233;nom&#232;ne met en jeu plusieurs dimensions linguistiques : phonologie, morphologie,
syntaxe, s&#233;mantique et discours (voir notamment les travaux de (Forsgren, 1978; Wilmet, 1981; N&#248;lke,
1996; Noailly, 1999; Abeill&#233; &amp; Godard, 1999)). Cependant, &#224; notre connaissance, il n&#8217;existe pas de tra-
vaux qui rendent compte de l&#8217;interaction des contraintes qui sont associ&#233;es &#224; chacune des dimensions et
qui permettent de d&#233;terminer la position de l&#8217;adjectif dans un contexte pr&#233;cis. Une seule contrainte im-
pose cat&#233;goriquement une position sp&#233;cifique &#224; l&#8217;adjectif : la pr&#233;sence d&#8217;un d&#233;pendant post-adjectival. Les
autres contraintes participant &#224; l&#8217;alternance sont pr&#233;f&#233;rentielles, dans la mesure o&#249; elles n&#8217;expriment que
des tendances.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thuilier, Fox, Crabb&#233;
</p>
<p>Le but de notre travail est de quantifier ces contraintes pr&#233;f&#233;rentielles et de proposer une mod&#233;lisation qui
rende compte au mieux de la position des adjectifs &#224; partir de contraintes interpr&#233;tables. En &#233;tudiant les
contraintes pr&#233;f&#233;rentielles, nous faisons l&#8217;hypoth&#232;se, &#224; la suite de (Bresnan et al., 2007), que les donn&#233;es
qui rel&#232;vent de l&#8217;usage font partie de la connaissance de la langue et que les ph&#233;nom&#232;nes d&#8217;ordre des mots
ne sont pas uniquement guid&#233;s par des contraintes qui d&#233;cident de la grammaticalit&#233; d&#8217;une phrase.
Pour rendre compte des contraintes pr&#233;f&#233;rentielles intervenant dans le choix de la position de l&#8217;adjectif &#233;pi-
th&#232;te, nous pr&#233;sentons une &#233;tude quantitative s&#8217;appuyant sur le corpus French Tree Bank (d&#233;sormais FTB)
et le corpus de l&#8217;Est-R&#233;publicain (d&#233;sormais ER). Cette &#233;tude quantitative s&#8217;appuie sur la construction
d&#8217;un mod&#232;le de pr&#233;diction capable de d&#233;cider de la position de l&#8217;adjectif &#233;tant donn&#233; un certain nombre de
variables. Nous utilisons le caract&#232;re op&#233;ratoire des mod&#232;les de pr&#233;diction pour &#233;valuer l&#8217;importance de
groupes de contraintes. L&#8217;un des probl&#232;mes pos&#233;s par ce type d&#8217;approche en syntaxe est la n&#233;cessit&#233; d&#8217;un
volume important de donn&#233;es richement annot&#233;es, telles que celles utilis&#233;es par (Wasow, 2002; Bresnan
et al., 2007) pour l&#8217;anglais. Cet article est l&#8217;occasion de montrer comment combiner diff&#233;rentes ressources
et outils existants pour obtenir des informations quantitatives sur un probl&#232;me de syntaxe du fran&#231;ais.
Dans la section 2, nous d&#233;crirons les corpus et la m&#233;thode utilis&#233;s. Dans la section 3, les variables retenues
seront d&#233;crites et nous pr&#233;senterons les ressources et les outils utilis&#233;s pour obtenir ces variables. Dans la
section 4, nous d&#233;taillerons le mod&#232;le de pr&#233;diction de la position de l&#8217;adjectif et nous discuterons l&#8217;apport
des variables relatives &#224; la fr&#233;quence afin de montrer l&#8217;importance de l&#8217;usage dans le ph&#233;nom&#232;ne &#233;tudi&#233;.
</p>
<p>2 M&#233;thodologie
</p>
<p>French Treebank (FTB) Ce travail s&#8217;appuie sur diverses sources de donn&#233;es. La principale est le cor-
pus arbor&#233; de Paris 7 Abeill&#233; et al. (2003) dont nous utilisons la sous-partie annot&#233;e en constituants et
en fonctions syntaxiques (Abeill&#233; &amp; Barrier, 2004). Disponible depuis 2003, il est le r&#233;sultat d&#8217;un projet
d&#8217;annotation supervis&#233;e d&#8217;articles du journal Le Monde, men&#233; &#224; l&#8217;universit&#233; de Paris 7. Les annotations qui
nous int&#233;ressent sont de type morphologique et syntaxique. L&#8217;annotation morphologique associe chaque
forme &#224; une des 13 principales cat&#233;gories grammaticales (trait cat) comme par exemple N (nom) ou A
(adjectif). L&#8217;annotation syntaxique propose une analyse en constituants de chaque phrase. Notons &#224; ce
sujet que l&#8217;annotation de mots compos&#233;s a &#233;t&#233; neutralis&#233;e dans le cadre de notre &#233;tude : les mots compos&#233;s
sont trait&#233;s comme une forme unique non structur&#233;e1. Le corpus utilis&#233; comporte 12351 phrases pour 385
458 occurrences de formes et pour 24 098 types de mots distincts. Il contient 18 946 occurrences d&#8217;adjec-
tifs annot&#233;s comme &#233;pith&#232;te, parmis lesquelles 17762 accompagnent une t&#234;te nominale. Une fois &#233;cart&#233;s
les adjectifs num&#233;raux, les adjectifs contenus dans des dates, les abr&#233;viations et certaines occurrences pro-
bl&#233;matiques au niveau de l&#8217;annotation, il reste 15242 occurrences d&#8217;adjectifs &#233;pith&#232;tes qui constituent nos
donn&#233;es de travail. Ces occurrences repr&#233;sentent 1992 types de mots (ou lemmes).
Est r&#233;publicain (ER) Nous utilisons une version enrichie du corpus ER pour obtenir des comptes de
fr&#233;quence plus fiable sur de gros volumes. Le corpus utilis&#233; est celui distribu&#233; sur le site du CNRTL2. Il
a &#233;t&#233; superficiellement nettoy&#233; puis segment&#233; en utilisant la m&#233;thode d&#233;crite dans (Candito &amp; Crabb&#233;,
2009) ainsi qu&#8217;augment&#233; d&#8217;un jeu d&#8217;annotation en lemmes et en parties de discours d&#233;crites dans (Crabb&#233;
&amp; Candito, 2008). Une annotation en lemmes et en parties de discours est r&#233;alis&#233;e par une adaptation au
</p>
<p>1La raison vient du fait que la structure en constituants et l&#8217;annotation morphologique associ&#233;e aux composants de compos&#233;s
dans le corpus est plus pauvre que l&#8217;annotation des formes standard. Il n&#8217;aurait pas &#233;t&#233; &#233;vident d&#8217;extraire des donn&#233;es &#224; partir
des composants sans risquer d&#8217;induire un nombre important d&#8217;erreurs.
</p>
<p>2http ://www.cnrtl.fr/corpus/estrepublicain/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alternance de position de l&#8217;adjectif &#233;pith&#232;te
</p>
<p>fran&#231;ais de la m&#233;thode d&#8217;annotation conjointe d&#233;crite par (Chrupa&#322;a et al., 2008)3 reposant sur une clas-
sification par perceptrons. Le corpus ainsi enrichi comporte environ 148 000 000 occurrences de mots
pour environ 811 000 formes de mots qui se r&#233;partissent en 662 000 lemmes distincts. Parmi ceux-ci, on
recense environ 10 000 000 d&#8217;occurrences et 57500 lemmes d&#8217;adjectifs. Sur base de ce corpus, nous avons
consid&#233;r&#233; comme adjectifs en position &#233;pith&#232;te les mots &#233;tiquet&#233;s adjectifs adjacents aux mots &#233;tiquet&#233;s
noms communs.
</p>
<p>L&#8217;analyse que nous pr&#233;sentons s&#8217;appuie sur une table de donn&#233;es statistiques qui contient les 15242 occur-
rences d&#8217;adjectifs &#233;pith&#232;tes extraites du FTB et auxquelles est associ&#233;e une variable pr&#233;dite repr&#233;sentant la
position dans laquelle chaque occurrence appara&#238;t (ant&#233;position ou postposition). Chacune de ces occur-
rences est caract&#233;ris&#233;e par 13 variables pr&#233;dictrices qui ont &#233;t&#233; obtenues &#224; l&#8217;aide d&#8217;outils issus du traitement
automatique des langues et dont la s&#233;mantique est d&#233;taill&#233;e en section 3.
Inf&#233;rence statistique L&#8217;analyse qui suit s&#8217;appuie sur l&#8217;&#233;tude des propri&#233;t&#233;s de mod&#232;les de r&#233;gression
logistique multivari&#233;e4. Formellement, un tel mod&#232;le permet de pr&#233;dire &#960; la probabilit&#233; de succ&#232;s d&#8217;une
variable binaire, appel&#233;e variable pr&#233;dite, en fonction de n variables continues ou binaires X0 . . . Xn,
appel&#233;es variables pr&#233;dictrices. Dans ce qui suit, nous posons que la variable binaire pr&#233;dite comporte
deux valeurs : ant&#233;position et postposition de l&#8217;adjectif. Le succ&#232;s, not&#233; ante, correspond &#224; l&#8217;ant&#233;position
et l&#8217;&#233;chec &#224; la postposition. Dans notre cas, un mod&#232;le de r&#233;gression logistique multivari&#233; est un mod&#232;le
de la forme :
</p>
<p>&#960;ante =
e&#945;+&#946;0X0+...+&#946;nXn
</p>
<p>1 + e&#945;+&#946;0X0+...+&#946;nXn
(1)
</p>
<p>o&#249; &#960;ante repr&#233;sente la probabilit&#233; d&#8217;ant&#233;position &#233;tant donn&#233;es les variables pr&#233;dictrices. Entra&#238;ner un mo-
d&#232;le revient &#224; sp&#233;cifier les variables pr&#233;dictrices et &#224; calculer les valeurs des coefficients &#945; et &#946; par maxi-
mum de vraisemblance sur des donn&#233;es dans un espace logit (Agresti, 2007). En pratique, le calcul est
r&#233;alis&#233; par l&#8217;algorithme d&#8217;optimisation Newton-Raphson.
On interpr&#232;te un coefficient positif (resp. n&#233;gatif) &#946;i associ&#233; &#224; une variable Xi comme un coefficient qui
vote pour le succ&#232;s (resp. &#233;chec). Les valeurs num&#233;riques des coefficients ne peuvent pas &#234;tre compar&#233;es
telles quelles, par contre on peut tester (avec un test de Wald) si un coefficient &#946;i est significativement
diff&#233;rent du coefficient nul5. Les coefficients significatifs sont ceux que l&#8217;on cherche &#224; interpr&#233;ter. On
peut interpr&#233;ter les valeurs e&#946;i comme des rapports de chance. Ainsi le nombre e&#946;i s&#8217;interpr&#232;te comme la
multiplication du rapport de chance pour un incr&#233;ment unitaire de la variable Xi.
Tel quel, un mod&#232;le de r&#233;gression logistique donne une probabilit&#233; de succ&#232;s pour une variable binaire.
On augmente commun&#233;ment le mod&#232;le d&#8217;une proc&#233;dure de d&#233;cision, ce qui permet ainsi de le rendre
</p>
<p>3Ce travail a &#233;t&#233; r&#233;alis&#233; par D. Seddah et G . Chrupala qui ont adapt&#233; leur &#233;tiqueteur au fran&#231;ais. L&#8217;&#233;tiqueteur est &#233;tat de l&#8217;art
et a une exactitude en parties de discours proche de 98% (D. Seddah pc.). Pour la lemmatisation, l&#8217;algorithme de (Chrupa&#322;a
et al., 2008) repose sur des scripts d&#8217;&#233;dition ce qui entra&#238;ne quelques erreurs marginales. Par comparaison avec Flemm (Namer,
2000), l&#8217;int&#233;r&#234;t de ce lemmatiseur est son caract&#232;re d&#233;terministe.
</p>
<p>4Pour une introduction d&#233;taill&#233;e, voir (Agresti, 2007). On pr&#233;f&#232;re utiliser des mod&#232;les de r&#233;gression logistique aux analyses
discriminantes et &#224; l&#8217;analyse en composantes principales, dans la mesure o&#249; ces derniers supposent des hypoth&#232;ses de normalit&#233;
sur les donn&#233;es qui ne sont g&#233;n&#233;ralement pas satisfaites par les donn&#233;es portant sur le langage naturel. Nous avons par ailleurs
test&#233; l&#8217;utilisation de m&#233;thodes reposant sur l&#8217;usage d&#8217;arbres de d&#233;cision tirant parti de l&#8217;algorithme CART (Breiman et al.,
1984) en nous inspirant de la m&#233;thodologie sugg&#233;r&#233;e par (Baayen, 2008). Il est &#224; noter que cet algorithme ne s&#8217;est pas r&#233;v&#233;l&#233;
d&#8217;une granularit&#233; suffisante pour permettre une analyse fine des donn&#233;es : la n&#233;cessit&#233; de partitionner le domaine de variables
continues rend les r&#233;sultats difficilement interpr&#233;tables en pratique.
</p>
<p>5Ce test permet de d&#233;tecter les coefficients qui pr&#233;disent une valeur constante. Autrement dit, il permet de d&#233;tecter les
variables qui, prises individuellement, n&#8217;influencent pas significativement le r&#233;sultat de succ&#232;s ou d&#8217;&#233;chec.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thuilier, Fox, Crabb&#233;
</p>
<p>op&#233;rationnel. Ainsi, on pose que le r&#233;sultat est un succ&#232;s si &#960; &gt; 0.5, &#233;chec sinon. Cela permet de pr&#233;dire
effectivement la position de l&#8217;adjectif par rapport au nom sur des donn&#233;es pour lesquelles la valeur de la
variable pr&#233;dite est inconnue. A fin de comparaison, nous utilisons le caract&#232;re op&#233;rationnel du mod&#232;le
de r&#233;gression en nous appuyant syst&#233;matiquement sur une &#233;valuation 10 passes dont nous reportons la
moyenne (&#181;) et l&#8217;&#233;cart-type (&#963;). Cette &#233;valuation se fait en comparant la position pr&#233;dite par le mod&#232;le et
la position effectivement rencontr&#233;e dans le corpus FTB.
</p>
<p>3 Variables pr&#233;dictrices
</p>
<p>Dans cette section, nous pr&#233;sentons un ensemble des contraintes, synth&#233;tis&#233; dans le tableau 1, qui a &#233;t&#233;
propos&#233; dans la litt&#233;rature comme intervenant dans le ph&#233;nom&#232;ne d&#8217;alternance de position de l&#8217;adjectif
&#233;pith&#232;te6 et que nous avons pu capturer gr&#226;ce &#224; des ressources existantes. Il est important de noter que
nous restreignons l&#8217;objet de notre travail en ne prenant pas en compte les changements de sens li&#233;s &#224; la
position (comme dans : une ancienne usine vs. une usine ancienne) pour des raisons pratiques, la non
disponibilit&#233; de ressources ne permettant pas de capturer ces changements de sens.
</p>
<p>Variables Types Description
COORD bool&#233;en adjectif en coordination ou non
POST-ADJ bool&#233;en adjectif avec un d&#233;pendant post-adjectival ou non
ADJ-LONG r&#233;el longueur de l&#8217;adjectif en syllabes
SADJ-LONG r&#233;el longueur du SAdj en syllabes
FREQ r&#233;el fr&#233;quence de l&#8217;adjectif dans le corpus ER
DERIV&#201; bool&#233;en adjectif d&#233;riv&#233; ou non
NATIO bool&#233;en adjectif de nationalit&#233; ou non
COULEUR bool&#233;en adjectif de couleur ou non
INDEF bool&#233;en adjectif ind&#233;fini ou non
COLLOCANT r&#233;el score &#967;2 pour le bigramme &#8217;adjectif-nom&#8217;
COLLOCPOST r&#233;el score &#967;2 pour le bigramme &#8217;nom-adjectif&#8217;
ADJ-PREFANT bool&#233;en pr&#233;f&#233;rence statistique de l&#8217;adjectif pour l&#8217;ant&#233;position ou non
ADJ-PREFPOST bool&#233;en pr&#233;f&#233;rence statistique de l&#8217;adjectif pour la postposition ou non
</p>
<p>TAB. 1 &#8211; Les variables pr&#233;dictives, leur type et leur description
</p>
<p>D&#233;pendant post-adjectival La pr&#233;sence d&#8217;un d&#233;pendant post-adjectival est l&#8217;unique contrainte cat&#233;go-
rique intervenant dans le choix de la position de l&#8217;adjectif. Lorsque l&#8217;adjectif est suivi d&#8217;un compl&#233;ment
ou d&#8217;un modifieur, il est obligatoirement postpos&#233; comme le montre l&#8217;exemple 1.
</p>
<p>(1) a. un entretien long de deux heures
b. *un long de deux heures entretien
</p>
<p>Cette contrainte est captur&#233;e par l&#8217;interm&#233;diaire de la variable POST-ADJ. On extrait les valeurs de la
variable POST-ADJ par reconnaissance de motifs sur les arbres du treebank. Pour cela, nous enrichissons
dynamiquement le treebank d&#8217;annotations de t&#234;tes et de d&#233;pendants syntaxiques en r&#233;utilisant les tables
de propagation de (Arun, 2004). L&#8217;adjectif t&#234;te d&#8217;un AP d&#233;pendant du nom ayant un d&#233;pendant droit est
</p>
<p>6Dans un premier travail (Thuilier et al., soumis), nous avons test&#233; un nombre plus important de variables. Les variables
pr&#233;sent&#233;es ici ont &#233;t&#233; selectionn&#233;es en fonction de leur importance dans le ph&#233;nom&#232;ne.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alternance de position de l&#8217;adjectif &#233;pith&#232;te
</p>
<p>consid&#233;r&#233; comme un adjectif &#224; compl&#233;mentation. Dans nos donn&#233;es, les 438 adjectifs qui ont un d&#233;pendant
post-adjectival sont en postposition, conform&#233;ment &#224; ce que nous attendions.
Coordination Les approches en termes de comp&#233;tence du probl&#232;me de la position de l&#8217;adjectif &#233;pith&#232;te,
telle que celle de (Abeill&#233; &amp; Godard, 1999), montrent que la position des adjectifs apparaissant dans une
coordination simple n&#8217;est pas restreinte, comme le montre l&#8217;exemple 2.
</p>
<p>(2) une belle et longue table / une table belle et longue
</p>
<p>Cependant, dans nos donn&#233;es, 94,8% des occurrences adjectivales en coordination (c&#8217;est-&#224;-dire 788 oc-
currences) sont en postposition. Cela indique que des donn&#233;es bas&#233;es sur l&#8217;usage semblent mettre en avant
que la coordination est un facteur favorisant fortement la postposition. Les valeurs de la variable COORD
sont extraites par motifs en r&#233;utilisant le m&#234;me principe que pour la variable POST-ADJ.
Classes d&#8217;adjectif La position de l&#8217;adjectif peut &#233;galement &#234;tre influenc&#233;e par la s&#233;mantique lexicale de
l&#8217;adjectif (par exemple (Grevisse &amp; Goosse, 2007)). Les adjectifs appartenant aux classes s&#233;mantiques du
type couleur, forme, propri&#233;t&#233; physique, nationalit&#233;, termes techniques..., sont d&#233;crits comme postpos&#233;s.
Nous avons pu prendre en compte deux classes s&#233;mantiques repr&#233;sentatives. Ce sont deux classes pour
lesquelles on dispose de dictionnaires largement exhaustifs : la classe nationalit&#233; dont on extrait un dic-
tionnaire &#224; partir de ProlexBase (Tran &amp; Maurel, 2006) et la classe couleur dont on extrait les valeurs
&#224; partir du dictionnaire Chroma7. Un adjectif appartenant &#224; l&#8217;un de ces dictionnaires sera ainsi marqu&#233;
par la variable NATIO ou COULEUR. Nous prenons &#233;galement en consid&#233;ration la classe des adjectifs in-
d&#233;finis. La d&#233;finition de cette classe ne repose pas sur la s&#233;mantique lexicale, mais sur le comportement
syntaxique. En effet, les adjectifs ind&#233;finis ont des caract&#233;ristiques d&#8217;adjectifs (co-occurrence avec un d&#233;-
terminant, possibilit&#233; d&#8217;&#234;tre ant&#233;pos&#233; ou postpos&#233; au nom), mais ils peuvent se comporter comme des
d&#233;terminants dans certaines circonstances. Ils sont marqu&#233;s par la variable INDEF8. Pour d&#8217;autres classes
comme la forme ou les propri&#233;t&#233;s physiques, l&#8217;absence de dictionnaire nous contraint &#224; les ignorer.
Morphologie Certains adjectifs peuvent d&#233;river de verbes (participes pass&#233;s, participes pr&#233;sents, suffixes
-ible (pr&#233;dictible)/-able (faisable)/-uble (soluble)/-if (attractif)) ou de noms (m&#233;tallique, pr&#233;sidentiel, sco-
laire). Ces adjectifs sont g&#233;n&#233;ralement d&#233;crits comme pr&#233;f&#233;rant la postposition. Cette contrainte est captu-
r&#233;e par la variable DERIV&#201;, qui d&#233;termine si un adjectif est d&#233;riv&#233; de nom ou de verbe gr&#226;ce &#224; une &#233;tape
d&#8217;analyse morphologique d&#233;rivationnelle &#224; l&#8217;aide du logiciel DERIF (Namer, 2002). En pratique, nous
consid&#233;rons comme mots d&#233;riv&#233;s les mots pour lesquels DERIF trouve un lemme de base appartenant au
dictionnaire de cat&#233;gorie Verbe ou Nom.
Longueur La longueur est un facteur souvent utilis&#233; dans les &#233;tudes sur l&#8217;ordre des mots ou sur l&#8217;ordre des
constituants. En ce qui concerne les adjectifs, (Forsgren, 1978; Wilmet, 1981) ont chacun mis &#224; jour, dans
une &#233;tude sur corpus, la relation entre longueur de l&#8217;adjectif et position : les adjectifs les plus courts ont
tendance &#224; &#234;tre ant&#233;pos&#233;s9. De plus, &#233;tant donn&#233; que l&#8217;adjectif peut &#234;tre modifi&#233; qu&#8217;il soit en ant&#233;position
ou en postposition, nous supposons que la longueur du syntagme adjectival peut aussi &#234;tre pertinente. Nous
estimons la longueur de l&#8217;adjectif (ADJ-LONG) et du SAdj (SADJ-LONG) en termes de syllabes. Pour cela,
nous avons proc&#233;d&#233; &#224; une syllabation du corpus &#224; l&#8217;aide du logiciel industriel de synth&#232;se vocale ELITE qui
nous a permis de calculer le nombre de syllabes pour chaque forme de nom et d&#8217;adjectif en tenant compte
d&#8217;effets de liaison. A titre d&#8217;indication, nous avons rep&#233;r&#233; une vingtaine de r&#233;sultats aberrants produits par
</p>
<p>7Dictionnaire extrait du web : http ://pourpre.com/chroma/
8Les adjectifs consid&#233;r&#233;s comme ind&#233;finis sont : tel, autre, certain, quelques, divers, diff&#233;rent, maint, nul, quelconque, m&#234;me.
9Dans (Thuilier et al., soumis), nous avons montr&#233; que la longueur absolu de l&#8217;adjectif semble &#234;tre un facteur plus pertinent
</p>
<p>que la longueur relative entre l&#8217;adjectif et le nom.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thuilier, Fox, Crabb&#233;
</p>
<p>le syllabateur sur les 15242 occurrences de couples adjectifs/noms sur lesquels nous travaillons.
Fr&#233;quence La fr&#233;quence de l&#8217;item adjectival a aussi &#233;t&#233; point&#233;e comme un facteur intervenant dans le
choix de la position de l&#8217;adjectif. (Wilmet, 1981) observe une corr&#233;lation entre fr&#233;quence &#233;lev&#233;e du lemme
adjectival et ant&#233;position. Dans ce travail, nous estimons la fr&#233;quence des lemmes (variable FREQ) dans
l&#8217;Est-R&#233;publicain : on pr&#233;f&#232;re utiliser une grande masse de donn&#233;es m&#234;me imparfaite pour estimer la
fr&#233;quence, en nous fondant sur l&#8217;hypoth&#232;se qu&#8217;une grande taille d&#8217;&#233;chantillon nous permet d&#8217;estimer des
fr&#233;quences qui refl&#232;tent mieux la probabilit&#233; r&#233;elle des mots10.
Pr&#233;f&#233;rences statistiques de l&#8217;item adjectival La question de l&#8217;alternance a jusqu&#8217;ici &#233;t&#233; envisag&#233;e d&#8217;un
point de vue g&#233;n&#233;ral pour la cat&#233;gorie adjectivale : au sein du SN, deux positions sont disponibles pour
placer l&#8217;&#233;pith&#232;te. Si l&#8217;observation g&#233;n&#233;rale du ph&#233;nom&#232;ne montre effectivement cette possibilit&#233;, celle de
l&#8217;usage des lemmes sp&#233;cifiques dans notre table de donn&#233;es nous montre un tout autre &#233;tat de fait :
</p>
<p>ant&#233;pos&#233;s postpos&#233;s 2 positions Totaux
nombre de lemmes 122 1685 185 1992
</p>
<p>6.1% 84.6% 9.3% 100%
</p>
<p>TAB. 2 &#8211; R&#233;partition des lemmes du corpus FTB
</p>
<p>Comme le montre le tableau 2, sur les 1992 lemmes rencontr&#233;s dans le FTB, seuls 185 (9,3%) alternent
en position. Les 90,7% restant ont une position fixe. Ceci semble indiquer que, m&#234;me si les locuteurs ont
connaissance des possibilit&#233;s d&#8217;alternance, ils attribuent une position canonique &#224; chaque lemme sp&#233;ci-
fique et ne se servent des possibilit&#233;s d&#8217;alternance que dans un nombre de cas limit&#233;. La contrainte de la
fr&#233;quence, propos&#233;e dans le paragraphe pr&#233;c&#233;dent, peut ainsi &#234;tre restreinte &#224; la fr&#233;quence par position.
En effet, comme le notent entre autres (Bybee &amp; Mcclelland, 2005; Goldberg, 2006), la fr&#233;quence d&#8217;oc-
currence d&#8217;un item joue un r&#244;le dans la repr&#233;sentation mentale qu&#8217;en a le locuteur. Cependant, les items
n&#8217;apparaissent pas en isolation, ils sont ins&#233;r&#233;s dans une structure linguistique. Nous ne m&#233;morisons donc
pas simplement les occurrences, et ne constituons pas nos repr&#233;sentations mentales &#224; l&#8217;aide de l&#8217;item seul,
nous prenons aussi en compte son contexte d&#8217;apparition. En ce qui concerne les &#233;pith&#232;tes, cela sugg&#232;re
que nous enregistrons la position de l&#8217;adjectif par rapport au nom en m&#234;me temps que son occurrence.
Autrement dit, nous aurions deux repr&#233;sentations possibles de chaque adjectif : une en ant&#233;position et une
en postposition. Nous effecturions les comptes de fr&#233;quence pour chaque repr&#233;sentation s&#233;par&#233;ment. &#192;
l&#8217;instar de (Gries &amp; Stefanowitsch, 2004) qui &#233;tudient des ph&#233;nom&#232;nes d&#8217;alternance li&#233;s au verbe, nous
pensons qu&#8217;il y a un biais lexical dans l&#8217;alternance des adjectifs : les locuteurs sont sensibles au fait que
l&#8217;une des deux positions possibles est g&#233;n&#233;ralement bien plus fr&#233;quente selon l&#8217;item. Ainsi, on peut penser
que le choix m&#234;me de l&#8217;adjectif est, dans la majorit&#233; des cas, un &#233;l&#233;ment suffisant pour pr&#233;dire sa position.
Afin de tester la validit&#233; d&#8217;une telle contrainte, nous &#233;laborons deux dictionnaires, l&#8217;un regroupant les ad-
jectifs montrant une pr&#233;f&#233;rence pour l&#8217;ant&#233;position (DA) et l&#8217;autre pour ceux qui pr&#233;f&#233;rent la postposition
(DP). Pour qu&#8217;un lemme adjectival soit membre d&#8217;un de ces dictionnaires, le nombre d&#8217;occurrences dans
une position (ant&#233;position ou postposition) doit &#234;tre significativement diff&#233;rent (seuil &#945; = 0.05) du nombre
d&#8217;occurrences que l&#8217;on peut attendre th&#233;oriquement sur la base d&#8217;une loi binomiale11. Nous avons d&#233;fini 2
</p>
<p>10Depuis les travaux de (Zipf, 1932), on admet g&#233;n&#233;ralement que la longeur et la fr&#233;quence des mots entretiennent une
relation inverse. Pour nos donn&#233;es, le coefficient de corr&#233;lation rho de Spearman est rs = &#8722;0.44, ce qui indique qu&#8217;il existe
bien une corr&#233;lation. Cependant, comme nous le verrons dans la partie 4, les deux variables participent significativement au
mod&#232;le malgr&#233; les proc&#233;dures de maximisation, ce qui signifie que ce sont deux facteurs pertinents.
</p>
<p>11Plus formellement, soit n le nombre d&#8217;occurrences de l&#8217;adjectif en corpus et k le nombre de fois o&#249; il est ant&#233;pos&#233; (ou
postpos&#233;), l&#8217;adjectif appartient au dictionnaire des adjectifs anormalement ant&#233;pos&#233;s (ou postpos&#233;s) si P (K &#8805; k) &lt; 0.05 o&#249;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alternance de position de l&#8217;adjectif &#233;pith&#232;te
</p>
<p>variables : ADJ-PREFANT repr&#233;sente l&#8217;appartenance de l&#8217;adjectif au DA et ADJ-PREFPOST au DP.
Pr&#233;f&#233;rences statistiques de la combinaison nom/adjectif Prolongeant l&#8217;id&#233;e que l&#8217;on m&#233;morise une
occurrence dans son contexte d&#8217;apparition, on peut penser que, dans certains cas, l&#8217;item nominal sp&#233;cifique
influence la position de l&#8217;adjectif. Par exemple, l&#8217;expression collocative vibrant hommage contient un
adjectif dont les propri&#233;t&#233;s, telles que sa nature morphologique, favorisent la postposition (comme dans
voix vibrante, ton vibrant). Or, la pr&#233;sence du nom hommage permet de pr&#233;dire son ant&#233;position en raison
de la fr&#233;quence de leur apparition en co-occurrence dans cet ordre-l&#224;.
Pour obtenir une estimation statistique de la relation d&#8217;association entre l&#8217;item adjectival et l&#8217;item nominal,
nous avons utilis&#233; une m&#233;trique couramment utilis&#233;e pour identifier les collocations : le &#967;2 (Manning &amp;
Sch&#252;tze, 1999)12. Le calcul des collocations n&#233;cessite un gros volume de donn&#233;es, c&#8217;est pourquoi nous
utilisons le corpus ER. Nous avons proc&#233;d&#233; &#224; l&#8217;extraction des bigrammes de lemmes adjectif-nom et nom-
adjectif et cr&#233;&#233; 2 listes, l&#8217;une servant &#224; identifier les collocations avec adjectif ant&#233;pos&#233;, l&#8217;autre pour les
collocations avec adjectif postpos&#233;. A partir de ces listes, nous avons calcul&#233; la valeur de &#967;2 de chaque
bigramme. Nous avons attribu&#233; cette valeur aux variables COLLOCANT (pour les bigrammes &#224; adjectif
ant&#233;pos&#233;) et COLLOCPOST (pour les bigrammes &#224; adjectif postpos&#233;). Le r&#244;le de ces variables n&#8217;est pas
de d&#233;terminer si le bigramme constitue une collocation, mais plut&#244;t de donner une estimation de la force
de l&#8217;association de l&#8217;adjectif par rapport au nom (et r&#233;ciproquement). La table 3 cherche &#224; montrer que le
calcul du &#967;2 sur l&#8217;ER donne un r&#233;sultat satisfaisant d&#8217;un point de vue qualitatif 13.
</p>
<p>Adj-Nom haut niveau ; imm&#233;diat apr&#232;s-guerre ; vibrant hommage ; luxuriante v&#233;g&#233;tation ;
chaude eau ; vain mot ; lourd tribut ; majeure partie ; courte dur&#233;e ; profonde tristesse
</p>
<p>Nom-Adj poids lourd ; t&#233;l&#233;phone portable ; homicides involontaires ; R&#233;publique tch&#232;que ;
concurrence d&#233;loyale ; personne ag&#233;e ; an pass&#233; ; accident mortel ; sens inverse ; acier inoxidable
</p>
<p>TAB. 3 &#8211; Bigrammes adjectif-nom et nom-adjectif, pr&#233;sentant le score de &#967;2 le plus &#233;lev&#233; dans la table de
donn&#233;es
</p>
<p>4 Mod&#232;les de pr&#233;diction
</p>
<p>Le mod&#232;le de pr&#233;diction est construit &#224; partir de l&#8217;ensemble des variables et maximis&#233; &#224; l&#8217;aide d&#8217;une
proc&#233;dure par &#233;limination arri&#232;re dirig&#233;e par une heuristique AIC (Akaike Information Criterion) (Akaike,
1974). Par cette proc&#233;dure, les variables ADJ-LONG et COORD ont &#233;t&#233; &#233;limin&#233;es car elles ne participent pas
de fa&#231;on significative au mod&#232;le. Dans le mod&#232;le pr&#233;sent&#233; en figure 1, les variables ayant un coefficient
positif votent pour l&#8217;ant&#233;position, et celles ayant un coefficient n&#233;gatif votent pour la postposition. Ces
votes correspondent &#224; ce que nous attendions th&#233;oriquement. L&#8217;exactitude du mod&#232;le est &#181; = 93.1% (&#963;
= 0.007). Le d&#233;tail des capacit&#233;s de pr&#233;diction est pr&#233;sent&#233; dans le tableau 4. A titre de comparaison, un
mod&#232;le ne contenant aucune variable pr&#233;dictrice et pr&#233;disant syst&#233;matiquement la postposition (mod&#232;le
Nul), a une exactitude &#181; = 71.9% (&#963; = 0.018).
P (K &#8805; k) =
</p>
<p>&#8721;
n
</p>
<p>i=k
</p>
<p>(
n
</p>
<p>k
</p>
<p>)
pk(1&#8722; p)n&#8722;k avec une probabilit&#233; th&#233;orique p = 0.5.
</p>
<p>12Nous avons &#233;galement test&#233; la m&#233;trique d&#233;riv&#233;e du test exact de Fisher jug&#233;e plus satisfaisante pour le langage naturel car il
ne repose pas sur une hypoth&#232;se de normalit&#233;(Pedersen, 1996). Cependant, en pratique, sur de tr&#232;s gros corpus, celui-ci impose
le calcul de factorielles sur de tr&#232;s grands nombres, ce qui entra&#238;ne des probl&#232;mes importants d&#8217;arrondi.
</p>
<p>13A l&#8217;exception du bigramme chaude eau qui obtient une valeur &#967;2 tr&#232;s &#233;lev&#233;e car &#8220;Chaude Eau&#8221; est un nom propre fr&#233;-
quemment cit&#233; dans l&#8217;ER.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thuilier, Fox, Crabb&#233;
</p>
<p>&#960;ante =
e&#946;X
</p>
<p>1+e&#946;X
, o&#249;
</p>
<p>&#946;X = +0.29 *
&#8722;14.9 POST-ADJ = 1
&#8722;0.56 SADJ-LONG ***
</p>
<p>+0.000008 FREQ ***
&#8722;0.33 DERIV&#201; = 1 ***
+0.55 INDEF = 1 ***
&#8722;3.73 NATIO = 1 ***
&#8722;16.24 COULEUR = 1
+0.0001 COLLOCANT ***
&#8722;0.00005 COLLOCPOST ***
</p>
<p>+2.24 ADJ-PREFANT ***
&#8722;1.58 ADJ-PREFPOST ***
</p>
<p>FIG. 1 &#8211; Formule du mod&#232;le de pr&#233;diction (effets significatifs cod&#233;s *** p&lt;0.001, ** p&lt;0.01, * p&lt;0.1)
</p>
<p>Position pr&#233;dite % Correct
P A
</p>
<p>Position P 10493 522 95.3 %
observ&#233;e A 535 3692 87.3%
</p>
<p>Pr&#233;cision totale : &#181; = 93.1% (&#963; = 0.007)
TAB. 4 &#8211; Matrice de confusion du mod&#232;le de pr&#233;diction
</p>
<p>Afin d&#8217;illustrer l&#8217;importance de la fr&#233;quence d&#8217;usage des mots ainsi que de structures plus larges dans le
ph&#233;nom&#232;ne &#233;tudi&#233;, observons plus pr&#233;cis&#233;ment les variables relatives &#224; la fr&#233;quence. En s&#8217;appuyant sur
les discussions pr&#233;sent&#233;es dans les parties relatives aux pr&#233;f&#233;rences statistiques de la section 3, nous fai-
sons l&#8217;hypoth&#232;se que la fr&#233;quence d&#8217;occurrence d&#8217;un adjectif (estim&#233;e par la variable FREQ), ainsi que
sa fr&#233;quence d&#8217;apparition dans des contextes particuliers (estim&#233;e par les variables COLLOCANT, COL-
LOCPOST, ADJ-PREFANT et ADJ-PREFPOST) influent sur la repr&#233;sentation mentale qu&#8217;en a le locuteur.
Les capacit&#233;s de pr&#233;diction d&#8217;un mod&#232;le logistique contenant ces 5 variables relatives &#224; la fr&#233;quence,
permettraient donc d&#8217;estimer la pertinence de l&#8217;usage. L&#8217;exactitude d&#8217;un tel mod&#232;le est de &#181; = 92.5%
(&#963; = 0.008)14. La fr&#233;quence d&#8217;usage semble donc avoir un r&#244;le central dans le choix de la position de
l&#8217;adjectif &#233;pith&#232;te. Ce constat semble confirmer l&#8217;id&#233;e selon laquelle les connaissances des locuteurs dans
un ph&#233;nom&#232;ne d&#8217;alternance sont affect&#233;es par l&#8217;usage et plus particuli&#232;rement la fr&#233;quence. Notons que
ces 5 variables sont issues du corpus ER. Ainsi, malgr&#233; la pr&#233;sence de bruits dans ce corpus et les approxi-
mations faites pour le calcul des fr&#233;quences, les tendances obtenues gr&#226;ce &#224; un gros volume de donn&#233;es
sont des estimateurs satisfaisants pour un travail sur un probl&#232;me sp&#233;cifique de syntaxe.
</p>
<p>14Mod&#232;le maximis&#233; &#224; l&#8217;aide d&#8217;une proc&#233;dure par &#233;limination arri&#232;re dirig&#233;e par une heuristique AIC. A titre de comparai-
son, le mod&#232;le contenant les 8 autres variables (POST-ADJ, COORD, NATIO, COULEUR, INDEF, DERIV&#201;, ADJ-LONG, SADJ-
LONG), variables qui ne rel&#232;vent pas de l&#8217;usage, a une exactitude de &#181; = 80.7% (&#963; = 0.019).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Alternance de position de l&#8217;adjectif &#233;pith&#232;te
</p>
<p>5 Conclusion
</p>
<p>Notre travail s&#8217;inscrit dans la lign&#233;e des travaux sur des ph&#233;nom&#232;nes d&#8217;alternance en anglais (Bresnan,
2007; Wasow, 2002), qui introduisent l&#8217;id&#233;e de mener des &#233;tudes quantitatives fond&#233;es sur des donn&#233;es
empiriques richement annot&#233;es en syntaxe. Adopter cette vision a deux implications majeures sur les
plans th&#233;oriques et pratiques. Du point de vue de la th&#233;orie, ce type d&#8217;approche suppose que l&#8217;on consi-
d&#232;re que l&#8217;usage participe &#224; la construction des connaissances langagi&#232;res des locuteurs d&#8217;une langue. La
fr&#233;quence d&#8217;occurrence de formes sp&#233;cifiques et de structures est jug&#233;e comme l&#8217;une des propri&#233;t&#233;s cen-
trales de l&#8217;usage affectant la connaissance des locuteurs. L&#8217;importance de la contribution dans le mod&#232;le
de pr&#233;diction des contraintes li&#233;es &#224; cette notion (FREQ, ADJ-PREFANT, ADJ-PREFPOST, COLLOCANTet
COLLOCPOST) montre le r&#244;le certain de l&#8217;usage dans le ph&#233;nom&#232;ne d&#8217;alternance de l&#8217;adjectif et tend &#224;
confirmer cette vision.
D&#8217;un point de vue technique, (Wasow, 2002) note la difficult&#233; de mener &#224; bien ce type de travail pour
des langues ou des registres de langues dot&#233;s de peu de ressources. C&#8217;est le cas du fran&#231;ais : nous ne
disposons pour l&#8217;instant que d&#8217;un corpus arbor&#233;, qui est de taille trop r&#233;duite pour l&#8217;observation fiable
d&#8217;effets de fr&#233;quence. Cependant, le fait de le combiner avec d&#8217;autres ressources, comme le corpus ER et
les dictionnaires, nous a permis de proposer un mod&#232;le avec des r&#233;sultats am&#233;lior&#233;s et de mieux cerner le
probl&#232;me de l&#8217;alternance de l&#8217;adjectif &#233;pith&#232;te. Notre travail montre donc qu&#8217;il est envisageable, gr&#226;ce aux
outils et ressources existants, d&#8217;adopter une telle approche pour l&#8217;&#233;tude du fran&#231;ais.
Remerciements Les auteurs remercient Richard Beaufort et Sophie Roeckhoudt pour leur aide &#224; la syl-
labation du corpus, Fiametta Namer pour nous avoir donn&#233; acc&#232;s &#224; son logiciel DERIF, Djam&#233; Seddah,
Grezgorz Chrupala et Marie Candito pour leur aide lors du traitement du corpus l&#8217;Est R&#233;publicain.
</p>
<p>R&#233;f&#233;rences
ABEILL&#201; A. &amp; BARRIER N. (2004). Enriching a french treebank. In Proc. of LREC&#8217;04, Lisbon, Portugal.
ABEILL&#201; A., CL&#201;MENT L. &amp; TOUSSENEL F. (2003). Building a treebank for french. In Treebanks.
Dordrecht : Kluwer.
ABEILL&#201; A. &amp; GODARD D. (1999). La position de l&#8217;adjectif &#232;pith&#232;te en fran&#231;ais : le poids des mots.
Recherches linguistiques de Vincennes, 28, 9&#8211;32.
AGRESTI A. (2007). An introduction to categorical data analysis. Wiley interscience.
AKAIKE H. (1974). A new look at the statistical model identification. IEEE Transactions on Automatic
Control, 19(6), 716&#8211;723.
ARUN A. (2004). Statistical parsing of the french treebank. Master&#8217;s thesis, School of Informatics,
University of Edinburgh.
BAAYEN R. (2008). Analyzing Linguistic Data. A Practical Introduction to Statistics Using R. Cam-
bridge University Press.
BREIMAN L., FRIEDMAN J. H., OLSHEN R. A. &amp; STONE C. J. (1984). Classification and Regression
Trees. Belmont : Wadsworth.
BRESNAN J. (2007). Is syntactic knowledge probabilistic ? experiments with the english dative alter-
nation. In S. FEATHERSTON &amp; W. STERNEFELD, Eds., Roots : Linguistics in Search of Its Evidential
Base, p. 77&#8211;96. Berlin : Mouton de Gruyter.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Thuilier, Fox, Crabb&#233;
</p>
<p>BRESNAN J., CUENI A., NIKITINA T. &amp; BAAYEN. H. (2007). Predicting the dative alternation. In G.
BOUME, I. KRAEMER &amp; J. ZWARTS, Eds., Cognitive Foundations of Interpretation. Amsterdam : Royal
Netherlands Academy of Science.
BYBEE J. &amp; MCCLELLAND J. L. (2005). Alternatives to the combinatorial paradigm of linguistic theory
based on domain general principles of human cognition. The Linguistic Review, 22, 381&#8211;410.
CANDITO M. &amp; CRABB&#201; B. (2009). Improving generative statistical parsing with semi-supervised word
clustering. In Proceedings of International Workshop on Parsing Technologies, Paris.
CHRUPA&#321;A G., DINU G. &amp; VAN GENABITH J. (2008). Learning morphology with morfette. In In
Proceedings of LREC 2008, Marrakech, Morocco : ELDA/ELRA.
CRABB&#201; B. &amp; CANDITO M. (2008). Exp&#233;riences d&#8217;analyse syntaxique statistique du fran&#231;ais. In Actes
de la 15&#232;me Conf&#233;rence sur le Traitement Automatique des Langues Naturelles (TALN&#8217;08), p. 45&#8211;54,
Avignon, France.
FORSGREN M. (1978). La place de l&#8217;adjectif &#233;pith&#232;te en fran&#231;ais contemporain, &#233;tude quantitative et
s&#233;mantique. Stockholm : Almqvist &amp; Wilksell.
GOLDBERG A. (2006). Constructions at Work : the nature of generalization in language. Oxford
University Press.
GREVISSE M. &amp; GOOSSE A. (2007). Le bon usage. 14&#232;me &#233;dition : De Boeck Universit&#233;.
GRIES S. T. &amp; STEFANOWITSCH A. (2004). Extending collostructional analysis : A corpus-based
perspective on &#8217;alternations&#8217;. International Journal of Corpus Linguistics, 9 :1, 97&#8211;129.
MANNING C. D. &amp; SCH&#220;TZE H. (1999). Foundations of statistical natural language processing. Cam-
bridge : MIT Press.
NAMER F. (2000). Flemm : Un analyseur flexionnel de fran&#231;ais &#224; base de r&#232;gles. In C. JACQUEMIN,
Ed., Traitement automatique des Langues pour la recherche d&#8217;information, p. 523&#8211;547. Paris : Hermes.
NAMER F. (2002). Acquisition automatique de sens &#224; partir d&#8217;op&#233;rations morphologiques en fran&#231;ais :
&#233;tude de cas. In Traitement Automatique de la Langue Naturelle (TALN).
NOAILLY M. (1999). L&#8217;adjectif en fran&#231;ais. Ophrys.
N&#216;LKE H. (1996). O&#249; placer l&#8217;adjectif &#233;pith&#232;te ? focalisation et modularit&#233;. Langue fran&#231;aise, 111,
38&#8211;57.
PEDERSEN T. (1996). Fishing for exactness. In Proceedings of the South - Central SAS Users Group
Conference, p. 188&#8211;200, Austin (TX).
THUILIER J., FOX G. &amp; CRABB&#201; B. (soumis). Pr&#233;dire la position de l&#8217;adjectif &#233;pith&#232;te en fran&#231;ais :
approche quantitative. Lingvisticae Investigationes.
TRAN M. &amp; MAUREL D. (2006). Prolexbase : Un dictionnaire relationnel multilingue de noms propres.
Traitement automatique des langues, 47(3), 115&#8211;139.
WASOW T. (2002). Postverbal behavior. CSLI publications.
WILMET M. (1981). La place de l&#8217;&#233;pith&#232;te qualificative en fran&#231;ais contemporain : &#233;tude grammaticale
et stylistique. Revue de linguistique romane, 45, 17&#8211;73.
ZIPF G. K. (1932). Selected studies of the principle of relative frquency in language. Cambridge : Mass.</p>

</div></div>
</body></html>