<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Alignement de traductions rares &#224; l&#8217;aide de paires de phrases non align&#233;es</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Alignement de traductions rares
&#224; l&#8217;aide de paires de phrases non align&#233;es
</p>
<p>Julien Bourdaillet St&#233;phane Huet Philippe Langlais
RALI - DIRO - Universit&#233; de Montr&#233;al
</p>
<p>C.P. 6128, succursale centre-ville
H3C 3J7, Montr&#233;al, Qu&#233;bec, Canada
</p>
<p>{bourdaij,huetstep,felipe}@iro.umontreal.ca
</p>
<p>R&#233;sum&#233;. Bien souvent, le sens d&#8217;un mot ou d&#8217;une expression peut &#234;tre rendu dans une autre langue
par plusieurs traductions. Parmi celles-ci, certaines se r&#233;v&#232;lent tr&#232;s fr&#233;quentes alors que d&#8217;autres le sont
beaucoup moins, conform&#233;ment &#224; une loi zipfienne. La googlisation de notre monde n&#8217;&#233;chappe pas aux
m&#233;moires de traduction, qui mettent souvent &#224; mal ou simplement ignorent ces traductions rares qui sont
souvent de bonne qualit&#233;. Dans cet article, nous nous int&#233;ressons &#224; ces traductions rares sous l&#8217;angle du
rep&#233;rage de traductions. Nous argumentons qu&#8217;elles sont plus difficiles &#224; identifier que les traductions plus
fr&#233;quentes. Nous d&#233;crivons une approche originale qui permet de mieux les identifier en tirant profit de
l&#8217;alignement au niveau des mots de paires de phrases qui ne sont pas align&#233;es. Nous montrons que cette
approche permet d&#8217;am&#233;liorer l&#8217;identification de ces traductions rares.
</p>
<p>Abstract. There generally exist numerous ways to translate a word or a phrase in another language.
Among these translations, some are very common while others are far less so, according to a zipfian
law. As with the rest of the world, translation memories are googlized, leading to poorly handled or even
simply ignored rare translations, while they are often of good quality. In this paper, we tackle this problem
in a transpotting framework. We show that these rare translations are harder to identify than common
translations. We describe an original approach based on the word alignment of sentences which are not
aligned. We show that this approach significantly improves the identification of those rare translations.
</p>
<p>Mots-cl&#233;s : Traduction automatique statistique, alignement de mots, traduction rares, contr&#244;le de
pertinence.
</p>
<p>Keywords: Statistical machine translation, word alignment, rare translations, relevance feedback.
</p>
<p>1 Introduction
</p>
<p>Le rep&#233;rage de traduction, ou transpotting (diminutif de translation spotting), consiste &#224; identifier dans du
texte cible la traduction d&#8217;une requ&#234;te en langue source (Simard, 2003b; V&#233;ronis &amp; Langlais, 2000). Nous
appelons transpot l&#8217;ensemble des mots cibles automatiquement associ&#233;s &#224; une requ&#234;te dans une paire de
phrases gr&#226;ce &#224; un algorithme de transpotting.
</p>
<p>Dans (Huet et al., 2009a; Bourdaillet et al., 2010), nous avons pr&#233;sent&#233; la nouvelle version du concor-
dancier bilingue TransSearch. Gr&#226;ce &#224; des algorithmes de transpotting &#224; l&#8217;&#233;tat de l&#8217;art, celui-ci permet</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN BOURDAILLET, ST&#201;PHANE HUET &amp; PHILIPPE LANGLAIS
</p>
<p>FIG. 1 &#8211; Interface utilisateur du concordancier bilingue TransSearch suite &#224; la soumission de la requ&#234;te
wait and see.
</p>
<p>maintenant de r&#233;pondre &#224; une requ&#234;te utilisateur libre par un ensemble de traductions. La figure 1 pr&#233;sente
l&#8217;interface de l&#8217;application.
</p>
<p>Bien souvent, le sens d&#8217;un mot ou d&#8217;une expression peut &#234;tre rendu dans une autre langue par plusieurs
traductions. Parmi celles-ci, certaines se r&#233;v&#232;lent tr&#232;s fr&#233;quentes alors que d&#8217;autres le sont beaucoup moins,
conform&#233;ment &#224; une loi zipfienne. Par exemple, dans nos travaux nous utilisons le corpus bilingue du
Hansard constitu&#233; des actes des d&#233;bats du parlement canadien, soit plus de 8 millions de paires de phrases.
On y trouve 1558 paires contenant meanwhile, dont 964 contiennent la traduction pendant ce temps,
91 la traduction en attendant, mais une seule a la traduction sur ces entrefaites. De m&#234;me, la
requ&#234;te wait and see appara&#238;t dans 292 paires, soit 86 traductions par attendre pour voir, 60 par
attendre, mais seulement une par qui vivra verra. Or dans la version courante de l&#8217;application
TransSearch, ces deux traductions idiomatiques ne sont pas identifi&#233;es correctement par le syst&#232;me,
privant ainsi l&#8217;utilisateur de r&#233;sultats tr&#232;s int&#233;ressants.
</p>
<p>Dans cet article, nous nous int&#233;ressons &#224; un cas particulier de la t&#226;che de transpotting, &#224; savoir la recherche
de traductions rares. On peut consid&#233;rer une traduction comme rare quand on ne la trouve pas dans un
dictionnaire bilingue, ou bien quand son nombre d&#8217;occurrences dans un grand corpus parall&#232;le comme le
Hansard est tr&#232;s faible, soit &#8212; et c&#8217;est notre d&#233;finition ici &#8212; &#233;gal &#224; une seule occurrence.
</p>
<p>Ces traductions rares posent probl&#232;me aux mod&#232;les statistiques d&#8217;alignement de mots sur lesquels sont
bas&#233;s les algorithmes de transpotting. En effet, les distributions de transfert sont mal estim&#233;es du fait du
nombre tr&#232;s restreint de cooccurrences requ&#234;te/traduction (une seule) dans le bitexte d&#8217;entra&#238;nement. Dans
cet article, nous cherchons &#224; affiner ces distributions pour les traductions rares. Pour cela, nous faisons
l&#8217;hypoth&#232;se que des paires de phrases non align&#233;es, c&#8217;est-&#224;-dire qui ne sont pas en relation de traduction,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ALIGNEMENT DE TRADUCTIONS RARES &#192; L&#8217;AIDE DE PAIRES DE PHRASES NON ALIGN&#201;ES
</p>
<p>mais qui n&#233;anmoins contiennent la requ&#234;te et sa traduction rare, peuvent aider &#224; affiner ces distributions.
</p>
<p>Dans la suite de cet article, nous pr&#233;sentons en section 2 les diff&#233;rents algorithmes de transpotting que nous
utilisons. Nous adaptons en section 3 le concept de contr&#244;le de pertinence (ou relevance feedback) popu-
laire en recherche d&#8217;information &#224; la t&#226;che de transpotting. Ceci nous permet d&#8217;adapter les algorithmes
de transpotting &#224; la requ&#234;te &#224; transpotter. Nous pr&#233;sentons en section 4 l&#8217;id&#233;e originale sur laquelle notre
approche s&#8217;appuie pour am&#233;liorer la recherche de traductions rares. Nous d&#233;crivons en section 5 les gains
atteints par notre approche et dressons des perspectives de cette &#233;tude en section 6.
</p>
<p>2 Transpotting
</p>
<p>Le transpotting est un probl&#232;me d&#8217;alignement au niveau des mots. Il est donc tout &#224; fait appropri&#233; de
se baser sur les mod&#232;les d&#8217;alignement de mots IBM largement utilis&#233;s en traduction automatique statis-
tique (Brown et al., 1993).
</p>
<p>Formellement, &#224; partir d&#8217;une phrase S = s1...sn exprim&#233;e dans une langue dite source et de sa traduction
T = t1...tm, un alignement a = a1...am de type IBM consiste &#224; connecter chaque mot de T &#224; un mot de
S (aj &#8712; {1, ..., n}) ou au mot vide (aj = 0), ce dernier rendant compte des mots cibles non traduits. Pour
le mod&#232;le IBM 2, la probabilit&#233; jointe d&#8217;une phrase cible et de son alignement, &#233;tant donn&#233;e la phrase
source, est exprim&#233;e par :
</p>
<p>p(tm1 , a
m
1 |sn1 ) = p(m|n)
</p>
<p>m&#8719;
j=1
</p>
<p>p(tj|saj)&#215; p(aj|j,m, n) (1)
</p>
<p>o&#249; p(m|n) est la distribution de longueur des phrases, le premier terme du produit est la probabilit&#233; de
transfert et le second la probabilit&#233; d&#8217;alignement. Avec cette d&#233;composition, il est facile et efficace de
calculer l&#8217;alignement le plus probable entre deux phrases, argmaxam1 p(a
</p>
<p>m
1 |tm1 , sn1 ), appel&#233; (par abus de
</p>
<p>langage) l&#8217;alignement de Viterbi, en temps O(mn).
</p>
<p>Le mod&#232;le HMM est une g&#233;n&#233;ralisation du mod&#232;le IBM 2 (Vogel et al., 1996). Dans ce cas, la probabilit&#233;
d&#8217;alignement dans l&#8217;&#233;quation (1) est exprim&#233;e par p(aj|aj&#8722;1, n), o&#249; une d&#233;pendance du premier ordre est
introduite en mod&#233;lisant la probabilit&#233; d&#8217;alignement du mot cible courant en fonction de l&#8217;alignement du
mot cible pr&#233;c&#233;dent. L&#8217;alignement de Viterbi est obtenu par programmation dynamique en tempsO(mn2).
</p>
<p>Un algorithme simple de transpotting consiste &#224; calculer l&#8217;alignement de Viterbi d&#8217;une paire de phrases
avec un mod&#232;le IBM 2 ou HMM, puis &#224; extraire les mots cibles align&#233;s &#224; la requ&#234;te source pour s&#233;lec-
tionner le transpot recherch&#233;. On appelle ces algorithmes IBM2 et HMM respectivement. Cette approche a
tendance &#224; produire &#8212; le plus souvent &#224; tort &#8212; des transpots discontinus. Afin de rem&#233;dier &#224; cela, Simard
(2003b) a propos&#233; l&#8217;algorithme suivant ne g&#233;n&#233;rant que des transpots continus.
</p>
<p>Pour chaque paire &#12296;j1, j2&#12297; &#8712; [1,m]&#215; [1,m], j1 &lt; j2, deux alignements de Viterbi sont calcul&#233;s : l&#8217;un entre
la suite de mots tj2j1 et la requ&#234;te s
</p>
<p>i2
i1
, et l&#8217;autre entre les mots restants des phrases source s&#772;i2i1 &#8801; si1&#8722;11 sni2+1
</p>
<p>et cible t&#772;j2j1 &#8801; tj1&#8722;11 tmj2+1. Le transpotting revient alors &#224; trouver le transpot t&#770;j&#770;2j&#770;1 maximisant :
</p>
<p>argmax
(j1,j2)
</p>
<p>{
max
a
j2
j1
</p>
<p>p(aj2j1|si2i1 , tj2j1)&#215;max
a&#772;
j2
j1
</p>
<p>p(a&#772;j2j1|s&#772;i2i1 , t&#772;j2j1)
}
</p>
<p>(2)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN BOURDAILLET, ST&#201;PHANE HUET &amp; PHILIPPE LANGLAIS
</p>
<p>Cet algorithme a une complexit&#233; enO(m3n) en utilisant un mod&#232;le IBM2 pour calculer les alignements de
Viterbi, et en O(m3n2) avec un mod&#232;le HMM. Toutefois, certains calculs sont factorisables par program-
mation dynamique, comme d&#233;taill&#233; dans (Bourdaillet et al., 2010), ce qui donne une complexit&#233; enO(mn)
avec IBM 2 et O(mn2) avec HMM. On appelle ces algorithmes C-IBM2 et C-HMM respectivement.
</p>
<p>Finalement, cet algorithme (avec IBM 2 ou HMM) peut profiter des distributions de transfert obtenues en
entra&#238;nant les mod&#232;les dans les deux directions de traduction (les mod&#232;les IBM ne sont pas sym&#233;triques).
Pour cela, les probabilit&#233;s de transfert d&#8217;un mot cible t &#233;tant donn&#233; un mot source s sont reformul&#233;es en :
</p>
<p>pbi(t|s) = c(pS&#8594;T (t|s), pT&#8594;S(s|t)) (3)
</p>
<p>o&#249; c(&#183;) est une fonction &#224; sp&#233;cifier combinant les probabilit&#233;s de transfert des deux directions de traduc-
tion. Cette bidirectionnalisation de l&#8217;algorithme ne modifie pas la complexit&#233; temporelle. Pour HMM, on
appelle cet algorithme C-HMM-bi.
</p>
<p>Enfin, Callison-Burch et al. (2005) ont propos&#233; d&#8217;utiliser les mod&#232;les &#224; base de segments pour transpotter.
La trousse &#224; outils MOSES permet d&#8217;entra&#238;ner un tel mod&#232;le &#224; l&#8217;&#233;tat de l&#8217;art. Pour transpotter, on extrait de
la table de segments l&#8217;ensemble des paires candidates dont le segment source est &#233;gal &#224; la requ&#234;te et dont
le segment cible appara&#238;t dans la phrase &#224; transpotter. Afin de garder le meilleur candidat, ces paires sont
valu&#233;es en combinant leurs scores associ&#233;s dans la table de segments. On appelle cette m&#233;thode PBM.
</p>
<p>3 Pseudo contr&#244;le de pertinence
</p>
<p>Dans sa th&#232;se, Simard (2003a) a &#233;t&#233; le premier &#224; sugg&#233;rer que la t&#226;che de transpotting pouvait &#234;tre assi-
mil&#233;e &#224; une t&#226;che de recherche d&#8217;information, le transpot &#233;tant l&#8217;information &#224; extraire de la phrase cible.
La technique d&#233;crite ci-dessous s&#8217;inscrit dans cette continuit&#233; et renforce l&#8217;analogie entre transpotting et
recherche d&#8217;information.
</p>
<p>Principe. En recherche d&#8217;information, le pseudo contr&#244;le de pertinence (en anglais, pseudo relevance
feedback) est une technique permettant d&#8217;affiner les r&#233;sultats d&#8217;une recherche (Croft &amp; Harper, 1979).
Dans un premier temps, une requ&#234;te est soumise au syst&#232;me qui retourne une liste de documents, et dans
un second temps, on extrait de cette liste un ensemble de caract&#233;ristiques pertinentes permettant d&#8217;affiner
une seconde recherche.
</p>
<p>Dans (Huet et al., 2009b), nous avons propos&#233; une adaptation de cette id&#233;e pour am&#233;liorer nos techniques
de transpotting de la fa&#231;on suivante. Dans un premier temps, on recherche dans le bitexte index&#233; la requ&#234;te
req &#224; traduire, ce qui donne une liste de paires de phrases dont la phrase source contient req. Puis l&#8217;al-
gorithme de transpotting transpotte chacune de ces paires de phrases. Des phrases cibles transpott&#233;es, on
extrait la liste Treq des traductions obtenues (dans cette liste, une traduction appara&#238;t autant de fois qu&#8217;elle
a &#233;t&#233; transpott&#233;e dans la liste de paires de phrases). Ces traductions permettent d&#8217;adapter le syst&#232;me &#224; la
requ&#234;te lors de la seconde passe.
</p>
<p>Pour cela, on cr&#233;e un bitexte artificiel B1 = {&#12296;req, trad&#12297;|trad &#8712; Treq} o&#249; chaque paire de pseudo-phrases
est compos&#233;e : de req pour la partie source, et de l&#8217;une des ses traductions pour la partie cible. En d&#233;nom-
brant les alignements de mots, on peut alors estimer &#224; partir de B1 une distribution de transfert &#224; posteriori
locale &#224; la requ&#234;te. Cette distribution locale peut ensuite &#234;tre combin&#233;e &#224; la distribution globale (r&#233;sul-
tant de l&#8217;entra&#238;nement d&#8217;un mod&#232;le IBM sur tout le bitexte, soit la distribution utilis&#233;e lors de la premi&#232;re</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ALIGNEMENT DE TRADUCTIONS RARES &#192; L&#8217;AIDE DE PAIRES DE PHRASES NON ALIGN&#201;ES
</p>
<p>passe) de la fa&#231;on suivante :
</p>
<p>prf (t|s) =
{
</p>
<p>&#955;pglob(t|s) + (1&#8722; &#955;)ploc(t|s) si s &#8712; req
pglob(t|s) sinon (4)
</p>
<p>o&#249; &#955; est un param&#232;tre contr&#244;lant la combinaison lin&#233;aire. L&#8217;interpolation n&#8217;a lieu que pour les mots sources
de la requ&#234;te ; en effet, par construction de B1, la distribution locale est estim&#233;e uniquement pour ces mots
sources. La distribution de l&#8217;&#233;quation (4) est utilis&#233;e lors de la deuxi&#232;me phase de transpotting.
</p>
<p>R&#233;sultats exp&#233;rimentaux. Dans (Bourdaillet et al., 2010), nous avons test&#233; l&#8217;utilisation du contr&#244;le de
pertinence d&#233;crit ci-dessus afin d&#8217;am&#233;liorer l&#8217;application TransSearch. La m&#233;thode permet de corriger
certains transpots erron&#233;s. Par exemple pour la requ&#234;te way of life, les transpots qualit&#233; de vie
et mani&#232;re d&#8217;&#234;tre gagnent quelques rangs dans la distribution des traductions de la requ&#234;te. Malheu-
reusement, les gains num&#233;riques sont peu significatifs et les r&#233;sultats d&#233;cevants. N&#233;anmoins, nous pensons
que cette id&#233;e a un potentiel int&#233;ressant et nous avons cherch&#233; &#224; l&#8217;utiliser pour la t&#226;che qui nous int&#233;resse
dans cet article, le rep&#233;rage de traductions rares.
</p>
<p>4 Alignements de paires de phrases non align&#233;es
</p>
<p>La technique pr&#233;sent&#233;e dans la section 3 repose sur le fait qu&#8217;une paire requ&#234;te/traduction appara&#238;t plu-
sieurs fois dans le bitexte index&#233;. On esp&#232;re que les occurrences correctement transpott&#233;es vont aider &#224;
retranspotter correctement celles qui le furent mal. En effet, si les transpots corrects sont les plus fr&#233;quents
dans Treq, on peut supposer que la masse de probabilit&#233; de traduction soit correctement r&#233;partie dans la
distribution &#224; posteriori locale. Or dans le cas de la recherche de traductions rares, par d&#233;finition ces tra-
ductions n&#8217;apparaissent qu&#8217;une seule fois dans le bitexte index&#233; (bien que la requ&#234;te traduite puisse avoir
plusieurs autres traductions). Appliquer la technique de la section 3 &#224; ce cas reviendrait &#224; construire un
bitexte B1 compos&#233; d&#8217;une seule paire de pseudo-phrases, ce qui serait sans int&#233;r&#234;t. Il convient donc de
modifier cette m&#233;thode pour adapter les algorithmes de transpotting au cas des traductions rares.
</p>
<p>Pour cela, nous modifions la fa&#231;on de g&#233;n&#233;rer Treq l&#8217;ensemble des transpots associ&#233;s &#224; une requ&#234;te req.
Soit &#12296;Srare, Trare&#12297; une paire de phrases contenant la traduction rare tradrare, avec req &#8712; Srare et tradrare &#8712;
Trare. Par une simple recherche, on extrait du bitexte index&#233; l&#8217;ensemble Sreq des phrases sources contenant
req. Srare est n&#233;cessairement l&#8217;une d&#8217;elles, et c&#8217;est l&#8217;unique traduction de Trare. On cr&#233;e ensuite un bitexte
artificielB2 = {&#12296;S, Trare&#12297;|S &#8712; Sreq}. Aucune de ces paires (sauf une) n&#8217;a de sens linguistique, puisqu&#8217;elles
sont artificielles et que les phrases ne sont pas en relation de traduction ; elles peuvent &#234;tre consid&#233;r&#233;es
comme du bruit. En revanche, il existe une r&#233;gularit&#233; dans ce bruit, &#224; savoir le fait que chacune des paires
contient la requ&#234;te et sa traduction rare, qui elles par d&#233;finition sont en relation de traduction.
</p>
<p>On peut alors transpotter chacune des paires de phrases de B2 avec un des algorithmes pr&#233;sent&#233;s dans la
section 2. Les transpots obtenus sont tous des sous-s&#233;quences de Trare. &#201;tant donn&#233; la fa&#231;on dont sont
construites les paires de B2, les aligner avec un algorithme bas&#233; sur les mod&#232;les IBM constitue une utili-
sation discutable de ceux-ci ne correspondant que partiellement &#224; la fonction optimis&#233;e par l&#8217;algorithme
Esp&#233;rance-Maximisation durant leur entra&#238;nement. On peut donc s&#8217;attendre &#224; ce que le transpot identifi&#233;
dans chaque paire ne soit pas forc&#233;ment tr&#232;s bon. Toutefois, on peut &#233;galement esp&#233;rer qu&#8217;en accroissant
la taille de B2 et donc en accroissant les &#171; avis &#187; donn&#233;s sur l&#8217;identit&#233; du transpot rare, on arrive &#224; tirer
profit de la r&#233;gularit&#233; au sein de B2 pour mieux discriminer le transpot rare. L&#8217;intuition sous-jacente est</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN BOURDAILLET, ST&#201;PHANE HUET &amp; PHILIPPE LANGLAIS
</p>
<p>que, dans la mesure o&#249; la paire requ&#234;te/traduction rare est la seule r&#233;gularit&#233; dans le bruit, on peut esp&#233;rer
qu&#8217;elle &#171; ressorte &#187; ou &#233;merge de ce bruit.
</p>
<p>Finalement, on peut appliquer la technique du contr&#244;le de pertinence de la section 3. Une fois chaque paire
de phrases de B2 transpott&#233;e, on extrait l&#8217;ensemble Treq des transpots de la requ&#234;te. On cr&#233;e le bitexte
B1 afin d&#8217;estimer la distribution de traduction &#224; posteriori locale qui est r&#233;inject&#233;e dans l&#8217;algorithme de
transpotting conform&#233;ment &#224; l&#8217;&#233;quation (4). Puis, la paire &#12296;Srare, Trare&#12297; est transpott&#233;e &#224; nouveau durant
la seconde passe, o&#249; on esp&#232;re que le transpot trouv&#233; sera am&#233;lior&#233; par rapport &#224; la premi&#232;re passe.
</p>
<p>5 Exp&#233;riences
</p>
<p>5.1 Corpus
</p>
<p>Nos exp&#233;riences utilisent le corpus parall&#232;le fran&#231;ais-anglais du Hansard, les actes officiels des d&#233;bats
parlementaires canadiens, des ann&#233;es 1986 &#224; 2007. On dispose au total de plus de 8,3 millions de paires de
phrases. L&#8217;indexation de ce corpus avec le moteur Lucene1 permet de soumettre des requ&#234;tes auxquelles
le moteur r&#233;pond en retournant l&#8217;ensemble des paires de phrases contenant la requ&#234;te.
</p>
<p>Pour constituer le corpus de test de requ&#234;tes/traductions rares, nous avons proc&#233;d&#233; de mani&#232;re semi-
automatique, en extrayant automatiquement un ensemble de paires de phrases puis en les validant ma-
nuellement. Pour ce faire, &#224; partir des logs des requ&#234;tes soumises par les utilisateurs &#224; TransSearch,
nous avons extrait un sous-ensemble de ces requ&#234;tes r&#233;elles ayant une entr&#233;e dans un dictionnaire de
mots et d&#8217;expressions bilingues disponible au RALI. Nous avons ensuite interrog&#233; avec ces couples re-
qu&#234;te/traduction le bitexte index&#233; afin de compter leur nombre d&#8217;occurrences. Finalement, nous avons
gard&#233; les couples apparaissant dans une seule paire de phrases dans tout le corpus. Par exemple, la requ&#234;te
meanwhile appara&#238;t dans 1558 paires de phrases, mais le couple meanwhile/sur ces entrefaites
n&#8217;appara&#238;t que dans une seule paire. Nous avons ainsi retenu environ un millier de paires de phrases.
</p>
<p>Nous avons ensuite examin&#233; manuellement chacune de ces paires afin de v&#233;rifier que la traduction de
r&#233;f&#233;rence de la requ&#234;te &#233;tait effectivement exacte en contexte. Cette &#233;tape permet de filtrer diff&#233;rents cas
probl&#233;matiques : traduction en contexte incorrecte &#224; cause de la polys&#233;mie de la requ&#234;te ou de la traduc-
tion ; phrase contenant plusieurs mots s&#233;mantiquement proches de la requ&#234;te, la traduction de r&#233;f&#233;rence
traduisant un de ces mots et non la requ&#234;te ; bornes exactes du transpot ind&#233;cidables m&#234;me pour un humain.
</p>
<p>Au final, nous avons conserv&#233; 591 paires de phrases dont nous connaissons la requ&#234;te &#224; transpotter et la
traduction rare associ&#233;e. De celles-ci, nous avons extrait 115 paires pour constituer un corpus de d&#233;velop-
pement, appel&#233; DEV. Nous gardons le reste des 476 paires pour former le corpus de test, appel&#233; TEST.
</p>
<p>5.2 M&#233;triques
</p>
<p>Les m&#233;triques que nous utilisons pour &#233;valuer la t&#226;che de transpotting sont tr&#232;s simples. Dans le corpus
TEST, chaque paire de phrases contient la requ&#234;te et sa traduction. On souhaite qu&#8217;un algorithme de trans-
potting identifie cette traduction afin de la pr&#233;senter &#224; un utilisateur qui aurait soumis la requ&#234;te. Il convient
donc de calculer le ratio du nombre de fois o&#249; la traduction de r&#233;f&#233;rence a &#233;t&#233; identifi&#233;e correctement.
</p>
<p>1http ://lucene.apache.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ALIGNEMENT DE TRADUCTIONS RARES &#192; L&#8217;AIDE DE PAIRES DE PHRASES NON ALIGN&#201;ES
</p>
<p>Un second indicateur int&#233;ressant donne cr&#233;dit &#224; un transpot partiellement identifi&#233;. En effet, plut&#244;t que
d&#8217;identifier l&#8217;ensemble des mots de la traduction de r&#233;f&#233;rence, un algorithme de transpotting peut ne r&#233;us-
sir &#224; en identifier qu&#8217;un sous-ensemble. Bien qu&#8217;un tel r&#233;sultat soit insatisfaisant, cela indique que l&#8217;algo-
rithme a point&#233; dans la phrase cible la zone de la traduction de r&#233;f&#233;rence, mais qu&#8217;il subsiste un probl&#232;me
d&#8217;identification pr&#233;cise de ses bornes. On peut donc &#233;galement calculer le ratio du nombre de fois o&#249; au
moins un mot de la traduction de r&#233;f&#233;rence a &#233;t&#233; identifi&#233;.
</p>
<p>5.3 Entra&#238;nement des mod&#232;les statistiques et optimisation des param&#232;tres
</p>
<p>Les distributions d&#8217;alignement et de transfert des mod&#232;les IBM 2 et HMM d&#233;crits dans la section 2 sont
obtenues gr&#226;ce &#224; GIZA++. Les mod&#232;les sont entra&#238;n&#233;s sur le bitexte de 8,3 millions de paires de phrases
d&#233;crit dans la section 5.1 comprenant entre autre DEV et TEST.
</p>
<p>Afin d&#8217;am&#233;liorer tr&#232;s significativement les performances des algorithmes de transpotting, les distributions
de transfert des mod&#232;les IBM 2 et HMM sont remplac&#233;es par celles d&#8217;un mod&#232;le IBM 4. Pour cela,
GIZA++ utilise la s&#233;quence de mod&#232;les suivante avec 5 it&#233;rations pour chaque : 1, 2, HMM, 3 et 4.
</p>
<p>La table de segments n&#233;cessaires &#224; l&#8217;algorithme PBM est obtenue en utilisant MOSES sur le m&#234;me bitexte
et avec la m&#234;me s&#233;quence de mod&#232;les (mais jusqu&#8217;&#224; HMM seulement).
</p>
<p>L&#8217;&#233;quation (3) de combinaison des distributions de transfert des deux directions de traduction n&#233;cessite un
op&#233;rateur de combinaison. Les meilleurs r&#233;sultats sur DEV ont &#233;t&#233; obtenus avec la moyenne g&#233;om&#233;trique.
</p>
<p>L&#8217;&#233;quation (4) combinant les distributions de transfert globale et locale &#224; chaque requ&#234;te n&#233;cessite d&#8217;opti-
miser le param&#232;tre &#955; contr&#244;lant la combinaison lin&#233;aire. Nous l&#8217;avons optimis&#233; sur DEV s&#233;par&#233;ment pour
chaque algorithme de transpotting. Les valeurs obtenues sont discut&#233;es dans la section suivante.
</p>
<p>5.4 R&#233;sultats
</p>
<p>Capacit&#233; des algorithmes de transpotting &#224; identifier les traductions rares. La premi&#232;re exp&#233;rience
que nous pr&#233;sentons compare les performances des diff&#233;rents algorithmes de transpotting pr&#233;sent&#233;s dans
la section 2. Chacun de ces algorithmes doit transpotter les requ&#234;tes du corpus TEST ; les r&#233;sultats sont
pr&#233;sent&#233;s dans les colonnes 2 et 3 du tableau 1.
</p>
<p>Sans surprise, on constate que les algorithmes &#224; base de mod&#232;le HMM sont meilleurs que leur alter-ego
&#224; base de mod&#232;le IBM2, que ceux avec contrainte de contigu&#239;t&#233; sont meilleurs que sans, et que le mod&#232;le
HMM bidirectionnel est meilleur que le monodirectionnel. Dans (Bourdaillet et al., 2010), nous avons
constat&#233; des r&#233;sultats similaires sur un corpus de test beaucoup plus grand d&#8217;environ 1,4 million de paires
de phrases et non limit&#233; &#224; des couples requ&#234;te/traduction rare.
</p>
<p>Au premier abord, le mauvais score de PBM peut sembler plus &#233;tonnant. En fait il faut garder &#224; l&#8217;es-
prit, d&#8217;une part que tous les autres transpotteurs utilisent une table de transfert au niveau des mots IBM
4 (cf. section 5.3), ce qui am&#233;liore significativement leurs performances. D&#8217;autre part, les couples re-
qu&#234;te/traduction rare n&#8217;ont &#233;t&#233; vus qu&#8217;une seule fois &#224; l&#8217;entra&#238;nement du mod&#232;le &#224; base de segments, et
n&#8217;ont pas forc&#233;ment &#233;t&#233; conserv&#233;s dans la table de segments par l&#8217;heuristique grow-diag-final par
d&#233;faut de MOSES (Koehn et al., 2007). Ceci met en &#233;vidence le fait que les mod&#232;les &#224; base de segments sont
clairement insuffisants pour une recherche de traductions rares et justifie pleinement l&#8217;usage des diff&#233;rents</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN BOURDAILLET, ST&#201;PHANE HUET &amp; PHILIPPE LANGLAIS
</p>
<p>Algorithme
Sans contr&#244;le de pertinence Avec contr&#244;le de pertinence
</p>
<p>% r&#233;f. trouv&#233;e % 1 mot trouv&#233; % r&#233;f. trouv&#233;e % 1 mot trouv&#233; &#955;
PBM 32,5 47,9 - - -
IBM2 43,8 58,5 - - -
HMM 47,4 63,3 - - -
C-IBM2 51,3 70,4 58,4 79,0 0,99
C-HMM 54,3 73,6 60,9 83,2 0,98
C-HMM-bi 65,6 83,9 69,7 86,5 0,50
</p>
<p>TAB. 1 &#8211; Scores des algorithmes de transpotting sans contr&#244;le de pertinence (colonnes 2 et 3) et avec
(colonnes 4 et 5). Les colonnes 2 et 4 indiquent le pourcentage de traduction de r&#233;f&#233;rence trouv&#233;es exac-
tement, et les colonnes 3 et 5 le pourcentage de fois o&#249; au moins un mot de la traduction de r&#233;f&#233;rence est
identifi&#233;. La colonne 6 indique le meilleur param&#232;tre &#955; utilis&#233; pour combiner les distributions de transfert
globale et locale, conform&#233;ment &#224; l&#8217;&#233;quation (4) du contr&#244;le de pertinence.
</p>
<p>algorithmes de transpotting pr&#233;sent&#233;s dans la section 2.
</p>
<p>Enfin, on remarquera que les pourcentages de fois o&#249; l&#8217;on trouve au moins un mot de la traduction de
r&#233;f&#233;rence sont environ 20 points sup&#233;rieurs &#224; ceux o&#249; la traduction est identifi&#233;e exactement. Cela indique
que les algorithmes identifient souvent la zone de la traduction de r&#233;f&#233;rence dans la phrase cible, mais qu&#8217;il
reste un probl&#232;me d&#8217;identification pr&#233;cise des bornes. C&#8217;est un probl&#232;me de pr&#233;cision o&#249; les distributions
de transfert permettent g&#233;n&#233;ralement d&#8217;aligner &#224; la requ&#234;te les mots qui lui sont associ&#233;s, mais le rang
&#233;lev&#233; des mots grammaticaux dans ces distributions pose probl&#232;me comme le soulignait Moore (2004).
</p>
<p>Contr&#244;le de pertinence avec paires de phrases non align&#233;es. La seconde exp&#233;rience consiste &#224; tester
la validit&#233; de la m&#233;thode de transpotting en deux passes d&#233;crite dans la section 4, &#224; savoir le contr&#244;le de
pertinence gr&#226;ce &#224; des paires de phrases non align&#233;es.
</p>
<p>Pour ce faire, nous avons consid&#233;r&#233; les trois meilleurs algorithmes de transpotting relativement aux r&#233;-
sultats pr&#233;sent&#233;s dans le tableau 1, et appliqu&#233; la m&#233;thode d&#233;crite en section 4. Les colonnes 4 et 5 du
tableau 1 donnent les r&#233;sultats avec 200 paires artificielles. La figure 2 pr&#233;sente les r&#233;sultats obtenus en
fonction du nombre de paires artificielles utilis&#233;es.
</p>
<p>Au vu des r&#233;sultats, on constate les gains significatifs obtenus par la m&#233;thode, et ce pour les trois algo-
rithmes test&#233;s. En pourcentage de r&#233;f&#233;rences trouv&#233;es, on a un gain d&#8217;environ 6,5 points pour C-IBM2 et
C-HMM, et d&#8217;environ 4 points pour C-HMM-bi. Un tel gain de 4 points est du m&#234;me ordre de grandeur
que ceux entre IBM2 et HMM d&#8217;une part, ou C-IBM2 et C-HMM d&#8217;autre part.
</p>
<p>Un point tr&#232;s int&#233;ressant est le fait que le gain le plus important est obtenu avec les 10 premi&#232;res paires
de phrases (gain de 3,1 points pour C-HMM-bi). Cela implique qu&#8217;un petit nombre de paires de phrases
artificielles suffit &#224; adapter la distribution de transfert &#224; la requ&#234;te. En outre, cela signifie que le co&#251;t
de la m&#233;thode de contr&#244;le de pertinence est raisonnable et qu&#8217;elle peut &#234;tre d&#233;ploy&#233;e dans le syst&#232;me
commercial TransSearch.
</p>
<p>Enfin, la derni&#232;re colonne du tableau 1 donne la valeur optimale du param&#232;tre &#955; utilis&#233; pour combiner
les distributions de transfert globale et locale dans l&#8217;&#233;quation (4) du contr&#244;le de pertinence. Pour les deux
mod&#232;les monodirectionnels C-IBM2 et C-HMM, on observe que la confiance accord&#233;e au mod&#232;le local est</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ALIGNEMENT DE TRADUCTIONS RARES &#192; L&#8217;AIDE DE PAIRES DE PHRASES NON ALIGN&#201;ES
</p>
<p> 0.5
</p>
<p> 0.55
</p>
<p> 0.6
</p>
<p> 0.65
</p>
<p> 0.7
</p>
<p> 0.75
</p>
<p>0 10 25 50 100 200
</p>
<p>Tx
. r
</p>
<p>&#233;f
. t
</p>
<p>ro
uv
</p>
<p>&#233;e
</p>
<p>Nb. paires artificielles
</p>
<p>C&#8722;HMM&#8722;bi
C&#8722;HMM
C&#8722;IBM2
</p>
<p> 0.7
</p>
<p> 0.75
</p>
<p> 0.8
</p>
<p> 0.85
</p>
<p> 0.9
</p>
<p>0 10 25 50 100 200
</p>
<p>Tx
. 1
</p>
<p> m
ot
</p>
<p> r&#233;
f. 
</p>
<p>tro
uv
</p>
<p>&#233;
</p>
<p>Nb. paires artificielles
</p>
<p>C&#8722;HMM&#8722;bi
C&#8722;HMM
C&#8722;IBM2
</p>
<p>FIG. 2 &#8211; Pourcentage de fois o&#249; la traduction de r&#233;f&#233;rence est trouv&#233;e (&#224; gauche) et o&#249; au moins un mot
de la traduction de r&#233;f&#233;rence est trouv&#233; (&#224; droite) en fonction du nombre de paires de phrases non align&#233;es
utilis&#233;es pour le contr&#244;le de pertinence.
</p>
<p>tr&#232;s faible. En effet, nous avons constat&#233; que d&#232;s que la valeur de &#955; descend en-dessous de 0,95 les scores
baissent jusqu&#8217;&#224; annuler les gains du contr&#244;le de pertinence, avant de d&#233;grader les scores en dessous de
&#955; = 0,7. Au contraire, pour le mod&#232;le bidirectionnel C-HMM-bi le poids accord&#233; au mod&#232;le local est tr&#232;s
important. En fait, pour toutes les valeurs de &#955; que nous avons test&#233;es, le contr&#244;le de pertinence am&#233;liore
significativement les r&#233;sultats.
</p>
<p>Finalement, pour la requ&#234;te messy le contr&#244;le de pertinence avec paires artificielles et C-HMM-bi permet
ainsi d&#8217;obtenir la traduction fouillis au lieu de qui sans contr&#244;le de pertinence. De m&#234;me, pour la
requ&#234;te lead the way, on obtient &#234;tre en t&#234;te au lieu de t&#234;te au. Enfin, pour la requ&#234;te wait
and see, on obtient qui vivra verra au lieu de vivra verra.
</p>
<p>6 Conclusion
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; une m&#233;thode de transpotting d&#233;di&#233;e aux traductions rares. Celle-
ci repose sur le principe du contr&#244;le de pertinence en utilisant des paires de phrases non align&#233;es. Les
exp&#233;riences r&#233;alis&#233;es montrent des gains significatifs pour le rep&#233;rage de traductions rares.
</p>
<p>Ces gains sont observ&#233;s en utilisant seulement un petit nombre de paires de phrases non align&#233;es pour
chaque requ&#234;te. Ceci sugg&#232;re que la m&#233;thode pr&#233;sent&#233;e ici est industrialisable dans l&#8217;application commer-
ciale TransSearch. En effet, apr&#232;s la premi&#232;re passe de transpotting, on a, tr&#232;s approximativement, 1/3
des paires de phrases qui ont donn&#233; des transpots uniques dans la distribution des traductions de la re-
qu&#234;te. Ceux-ci sont soit des erreurs des algorithmes de transpotting, soit des traductions rares. On pourrait
appliquer le contr&#244;le de pertinence uniquement sur ces paires de phrases afin d&#8217;am&#233;liorer les r&#233;sultats. Le
co&#251;t est fonction de l&#8217;algorithme de transpotting utilis&#233;, &#224; un facteur constant pr&#232;s : le nombre de paires
non align&#233;es (par requ&#234;te) utilis&#233;es pour le contr&#244;le de pertinence.
</p>
<p>Dans l&#8217;avenir, nous souhaitons &#233;valuer la m&#233;thode d&#233;crite dans ce papier pour le transpotting de traductions
non rares. En effet, la m&#233;thode est suffisamment g&#233;n&#233;rale pour qu&#8217;on puisse esp&#233;rer obtenir des gains dans</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN BOURDAILLET, ST&#201;PHANE HUET &amp; PHILIPPE LANGLAIS
</p>
<p>la plupart des cas. En outre, on peut envisager d&#8217;appliquer cette m&#233;thode pour une t&#226;che de traduction
compl&#232;te. En effet, le contr&#244;le de pertinence par alignement de paires de phrases non align&#233;es pourrait &#234;tre
utilis&#233; pour valider ou corriger les paires de segments rares extraites par un mod&#232;le &#224; base de segments.
</p>
<p>Remerciements
</p>
<p>Cette &#233;tude est financ&#233;e par le Conseil National de Recherches du Canada, en collaboration avec l&#8217;entre-
prise canadienne Terminotix.2
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOURDAILLET J., HUET S., LANGLAIS P. &amp; LAPALME G. (2010). TransSearch : from a bilingual
concordancer to a translation finder. &#192; para&#238;tre dans Machine Translation.
</p>
<p>BROWN P., DELLA PIETRA V., DELLA PIETRA S. &amp; MERCER R. (1993). The mathematics of statistical
machine translation : parameter estimation. Computational Linguistics, 19(2), 263&#8211;311.
CALLISON-BURCH C., BANNARD C. &amp; SCHROEDER J. (2005). A compact data structure for searchable
translation memories. In 10th European Conference of the Association for Machine Translation (EAMT),
p. 59&#8211;65, Budapest, Hongrie.
</p>
<p>CROFT W. &amp; HARPER D. (1979). Using probabilistic models of information retrieval without relevance
information. Journal of Documentation, 35(4), 285&#8211;295.
HUET S., BOURDAILLET J. &amp; LANGLAIS P. (2009a). Int&#233;gration de l&#8217;alignement de mots dans le
concordancier bilingue TransSearch. In 16e Conf&#233;rence sur le Traitement Automatique des Langues
Naturelles (TALN), Senlis, France.
</p>
<p>HUET S., BOURDAILLET J., LANGLAIS P. &amp; LAPALME G. (2009b). Harnessing the redundant results
of translation spotting. In 12th Machine Translation Summit, Ottawa, Canada.
</p>
<p>KOEHN P., HOANG H., BIRCH A., CALLISON-BURCH C., FEDERICO M., BERTOLDI N., COWAN
B., SHEN W., MORAN C., ZENS R., DYER C., BOJAR O., CONSTANTIN A. &amp; HERBST E. (2007).
Moses : open source toolkit for statistical machine translation. In 45th Annual Meeting of the Association
for Computational Linguistics (ACL), Companion Volume, p. 177&#8211;180, Prague, R&#233;publique tch&#232;que.
</p>
<p>MOORE R. C. (2004). Improving IBM word alignment model 1. In 42th Annual Meeting of the Asso-
ciation for Computational Linguistics (ACL), p. 518&#8211;525, Barcelone, Espagne.
</p>
<p>SIMARD M. (2003a). M&#233;moires de traduction sous-phrastiques. PhD thesis, Universit&#233; de Montr&#233;al.
</p>
<p>SIMARD M. (2003b). Translation spotting for translation memories. In HLT-NAACL Workshop on
Building and Using Parallel Texts : Data Driven Machine Translation and Beyond, p. 65&#8211;72, Canada.
</p>
<p>V&#201;RONIS J. &amp; LANGLAIS P. (2000). Evaluation of parallel text alignment systems &#8212; The Arcade
project., chapter 19, p. 369&#8211;388. Kluwer Academic Publisher, Dordrecht, Pays-Bas.
</p>
<p>VOGEL S., NEY H. &amp; TILLMANN C. (1996). HMM-based word alignment in statistical translation. In
16th Conference on Computational Linguistics, p. 836&#8211;841, Copenhague, Danemark.
</p>
<p>2http ://www.terminotix.com</p>

</div></div>
</body></html>