<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Les entit&#233;s nomm&#233;es &#233;v&#233;nement et les verbes de cause-cons&#233;quence</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010 &#8211; Session Posters, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Les entit&#233;s nomm&#233;es &#233;v&#233;nement et les verbes de cause-cons&#233;quence
</p>
<p>B&#233;atrice Arnulphy1,2 Xavier Tannier1,2 Anne Vilnat1,2
</p>
<p>(1) Univ. Paris-Sud, Orsay, France
(2) LIMSI-CNRS, B.P. 133, 91403 Orsay Cedex, France
</p>
<p>{Beatrice.Arnulphy, Xavier.Tannier, Anne.Vilnat}@limsi.fr
</p>
<p>R&#233;sum&#233;. L&#8217;extraction des &#233;v&#233;nements d&#233;sign&#233;s par des noms est peu &#233;tudi&#233;e dans des corpus g&#233;n&#233;-
ralistes. Si des lexiques de noms d&#233;clencheurs d&#8217;&#233;v&#233;nements existent, les probl&#232;mes de polys&#233;mie sont
nombreux et beaucoup d&#8217;&#233;v&#233;nements ne sont pas introduits par des d&#233;clencheurs. Nous nous int&#233;ressons
dans cet article &#224; une hypoth&#232;se selon laquelle les verbes induisant la cause ou la cons&#233;quence sont de
bons indices quant &#224; la pr&#233;sence d&#8217;&#233;v&#233;nements nominaux dans leur cotexte.
</p>
<p>Abstract. Few researches focus on nominal event extraction in open-domain corpora. Lists of cue
words for events exist, but raise many problems of polysemy. In this article, we focus on the following
hypothesis : verbs introducing cause or consequence links have good chances to have an event noun around
them.
</p>
<p>Mots-cl&#233;s : Entit&#233; nomm&#233;e, &#233;v&#233;nement, rapports de cause et cons&#233;quence.
</p>
<p>Keywords: Named entity, event, cause and consequence links.
</p>
<p>1 Introduction
</p>
<p>L&#8217;analyse des entit&#233;s nomm&#233;es (EN) se focalise g&#233;n&#233;ralement sur les notions classiques de lieu, orga-
nisation, personne ou date. Les &#233;v&#233;nements sont rarement consid&#233;r&#233;s, alors m&#234;me qu&#8217;ils ont une grande
importance pour les applications habituelles comme la recherche d&#8217;information, l&#8217;extraction d&#8217;information
ou la veille technologique. Les &#233;v&#233;nements d&#233;sign&#233;s par des verbes sont trait&#233;s dans de nombreux travaux
comme (Vendler, 1967) ou dans le cadre de TimeML (Pustejovsky et al., 2003). En compl&#233;ment de ces
travaux, nous nous int&#233;ressons au r&#233;sultat de la nomination d&#8217;un &#233;v&#233;nement, aux noms donn&#233;s aux &#233;v&#233;ne-
ments, que nous appellerons &#8220;entit&#233;s nomm&#233;es &#233;v&#233;nement&#8221; (EN-E). Les &#233;v&#233;nements nominaux peuvent
&#234;tre de plusieurs types : des noms d&#233;verbaux, d&#233;riv&#233;s de verbes qui font &#233;v&#233;nement tels que f&#234;te (issu de
f&#234;ter) ; des &#233;l&#233;ments qui &#233;voquent des &#233;v&#233;nements de fa&#231;on non ambigu&#235; comme festival dans Festival du
film de Berlin ; ou encore des mots qui prennent un caract&#232;re &#233;v&#233;nementiel en contexte, par exemple salon
dans La cinqui&#232;me &#233;dition du Salon de l&#8217;&#233;ducation ou un nom de lieu comme Tchernobyl ou Copenhague,
d&#233;signant, par m&#233;tonymie, l&#8217;incident qui s&#8217;y est produit ou la conf&#233;rence qui s&#8217;y est tenue (Personne ne
veut d&#8217;un nouveau Tchernobyl ; Copenhague se solde par un &#233;chec).
</p>
<p>Une &#233;tape du travail d&#8217;extraction des EN-E est donc de d&#233;terminer les expressions d&#233;signant potentielle-
ment un &#233;v&#233;nement, puis de d&#233;terminer en contexte si c&#8217;est bien le cas. Nous formulons ici l&#8217;hypoth&#232;se
que certains verbes introduisant la notion de cause ou de cons&#233;quence sont des d&#233;clencheurs de noms</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#201;ATRICE ARNULPHY, XAVIER TANNIER, ANNE VILNAT
</p>
<p>d&#8217;&#233;v&#233;nements dans leur cotexte.
</p>
<p>Nous pr&#233;sentons un survol des d&#233;finitions donn&#233;es &#224; l&#8217;&#233;v&#233;nement et un aper&#231;u de quelques travaux en-
trepris pour le traitement des EN-E (Section 2), puis nous d&#233;veloppons le probl&#232;me li&#233; &#224; l&#8217;extraction des
EN-E, ainsi que notre hypoth&#232;se de travail (Section 3). Pour finir, nous pr&#233;sentons notre &#233;tude lexicale et
l&#8217;exp&#233;rimentation mise en &#339;uvre pour valider cette hypoth&#232;se (Section 4)1.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Quelques d&#233;finitions de l&#8217;&#233;v&#233;nement ont &#233;t&#233; avanc&#233;es en philosophie, histoire ou linguistique. Notons
celles d&#233;velopp&#233;es en journalisme et en linguistique.
</p>
<p>Une r&#233;flexion importante a &#233;t&#233; d&#233;velopp&#233;e depuis les ann&#233;es 70 sur la notion d&#8217;&#233;v&#233;nement m&#233;diatique2.
Ces travaux se sont int&#233;ress&#233;s &#224; &#8220;ce qui fait &#233;v&#233;nement&#8221; et comment les m&#233;dias le cr&#233;ent. Neveu &amp; Qu&#233;r&#233;
(1996) pr&#233;sente la notion d&#8217;&#233;v&#233;nement, comme une occurrence singuli&#232;re, impr&#233;vue, non r&#233;p&#233;table, pro-
duite &#8220;dans un pass&#233; plus ou moins proche&#8221;. Son actualit&#233; ou sa r&#233;alit&#233; pass&#233;e est tenue pour absolue,
singuli&#232;re, non r&#233;p&#233;table et contingente. En linguistique, quelques travaux se sont attach&#233;s &#224; aborder des
probl&#232;mes relatifs aux &#233;v&#233;nements et aux EN-E. Velde (2000) introduit la notion de &#8220;nom propre de
temps&#8221;, en faisant le parall&#232;le entre les noms propres et &#8220;la triade je-ici-maintenant&#8221;. Il existe bien des
noms propres de personnes et noms de lieux, et ceux de temps doivent donc exister &#233;galement. De plus,
des noms de lieux et des dates peuvent, par m&#233;tonymie, se charger du sens de l&#8217;&#233;v&#233;nement qui a eu lieu
en cet endroit ou &#224; cette date (Steimberg, 2006). C&#8217;est le cas par exemple du toponyme Tchernobyl (Le-
colle, 2004) qui d&#233;signe l&#8217;explosion du r&#233;acteur nucl&#233;aire de la centrale de Tchernobyl en 1986, ou de
l&#8217;h&#233;m&#233;ronyme 11 septembre (Steimberg, 2008) qui nomme les attentats de New York. De plus, les travaux
d&#8217;Ehrmann &amp; Hag&#232;ge (2009) d&#233;veloppent des indices pour l&#8217;extraction des expressions temporelles qui
ne sont pas des &#233;v&#233;nements. Par opposition, certains de ces indices peuvent permettre de reconna&#238;tre des
&#233;v&#233;nements. Ces d&#233;finitions et ces travaux restent pourtant th&#233;oriques et sont peu adaptables directement
au rep&#233;rage automatique des EN et &#224; leur extraction par la machine.
</p>
<p>Nombre de travaux se sont int&#233;ress&#233;s &#224; l&#8217;extraction d&#8217;EN (cf. Ehrmann (2008) pour un historique complet
sur la reconnaissance des EN), mais peu d&#8217;entre eux se sont focalis&#233;s sur la cat&#233;gorie des &#233;v&#233;nements. Il
est &#224; noter que deux campagnes d&#8217;&#233;valuation d&#8217;extraction d&#8217;EN ont abord&#233; le sujet : ACE (Doddington
et al., 2004) et Ester (Gravier et al., 2004). Un syst&#232;me de questions-r&#233;ponses ayant pour objectif la
communication homme-machine fond&#233;e sur l&#8217;oral est d&#233;velopp&#233; dans le cadre du projet Ritel (Rosset
et al., 2005). L&#8217;extraction des EN y a &#233;t&#233; mise au point, et en particulier celle des &#233;v&#233;nements. Les corpus
une fois transcrits sont analys&#233;s et enrichis, notamment en EN classiques (lieu, organisation, personne ou
date). Une entit&#233; nomm&#233;e y est d&#233;finie comme une &#8220;expression d&#233;crivant un mod&#232;le sp&#233;cifique d&#8217;un type
donn&#233;&#8221;. Dans ce cadre, le festival de Cannes est un &#233;v&#233;nement non d&#233;fini, une entit&#233; non-pr&#233;cise, tandis
que le festival de Cannes 2006 est lui une entit&#233; nomm&#233;e (&#233;v&#233;nement pr&#233;cis).
</p>
<p>Nous nous int&#233;ressons en priorit&#233; aux &#233;v&#233;nements sous leurs formes nominales, en tant qu&#8217;EN. Les entit&#233;s
uniques comme les noms d&#8217;&#233;v&#233;nements historiques (la Grande Guerre), celles plus r&#233;currentes (Festival
</p>
<p>1Ce travail a &#233;t&#233; partiellement financ&#233; par OSEO dans le cadre du programme Quaero.
2M&#234;me si notre corpus de travail est essentiellement constitu&#233; d&#8217;articles de presse, nous ne nous int&#233;ressons pas uniquement
</p>
<p>aux &#233;v&#233;nements m&#233;diatiques ou journalistiques. Notons tout de m&#234;me que ce sont les m&#233;dias qui en g&#233;n&#233;ral nomment les
&#233;v&#233;nements.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LES ENTIT&#201;S NOMM&#201;ES &#201;V&#201;NEMENT ET LES VERBES DE CAUSE-CONS&#201;QUENCE
</p>
<p>de Cannes), l&#8217;instanciation de ces ph&#233;nom&#232;nes (les JO de 1996), les noms de f&#234;te (No&#235;l). Nous souhaitons
aussi nous attarder sur les ph&#233;nom&#232;nes plus anodins comme la descente de police de demain ou moins
d&#233;finissables et plus flous comme le branle-bas de combat mondial, le d&#233;bat ou la d&#233;cision. Les entit&#233;s
recherch&#233;es peuvent &#234;tre pass&#233;es, futures ou hypoth&#233;tiques. Ainsi nous n&#8217;&#233;cartons pas l&#8217;analyse des noms
d&#8217;&#233;ventualit&#233;s au sens de Vendler.
</p>
<p>3 Utilisation des verbes de cause-cons&#233;quence
</p>
<p>Afin de d&#233;gager au mieux des groupes nominaux d&#233;signant des &#233;v&#233;nements, nous avons pr&#233;c&#233;demment
constitu&#233; une liste des d&#233;clencheurs de noms d&#8217;&#233;v&#233;nement. &#192; cette fin, deux lexiques ont &#233;t&#233; utilis&#233;s :
une liste de d&#233;clencheurs av&#233;r&#233;s et une liste form&#233;e &#224; partir des substantifs du lexique VerbAction (Ha-
thout et al., 2002). La premi&#232;re liste de d&#233;clencheurs (681 termes lemmatis&#233;s) a &#233;t&#233; constitu&#233;e &#224; partir
des mots &#233;v&#233;nements pr&#233;vus dans Wmatch (Galibert, 2009), un outil con&#231;u dans le cadre du projet Ri-
tel (cf. Section 2) : 39 termes pr&#233;sents dans des grammaires locales descriptives restrictives (permettant
par exemple de ne pas r&#233;cup&#233;rer guerre en d&#233;clencheur de nom d&#8217;&#233;v&#233;nement dans les cas o&#249; il appara&#238;t
dans l&#8217;expression navire de guerre). Cette liste est enrichie par quelque 588 lemmes du lexique Event-
Nominals de (Bittar, 2009), constitu&#233; par des lemmes de substantifs &#8220;ayant au moins une interpr&#233;tation
&#233;v&#233;nementielle&#8221;. De nombreux mots de ce lexique appartiennent &#224; des registres de langue particuliers,
comme anticoaguloth&#233;rapie.
</p>
<p>Concernant le lexique VerbAction, il est constitu&#233; d&#8217;une liste de verbes d&#8217;action accompagn&#233;e des noms
d&#233;verbaux morphologiquement apparent&#233;s &#224; ceux-ci (9393 couples verbe-nom, soit 9200 lemmes nomi-
naux uniques). Les verbes d&#8217;action impliquant que quelque chose se produit (f&#234;ter), les noms d&#233;verbaux
de ces verbes devraient donc d&#233;crire une action (f&#234;te) et donc potentiellement nommer l&#8217;&#233;v&#233;nement qui a
lieu lorsque cette action se produit (la f&#234;te de la musique).
</p>
<p>Il est possible d&#8217;utiliser des listes de mots d&#233;clencheurs &#233;v&#233;nementiels ou des d&#233;verbaux pour reconna&#238;tre
les EN-E. Cependant certaines EN-E ne sont pas d&#233;tectables par ce moyen, c&#8217;est le cas de certaines ex-
pressions qui ne renferment &#224; l&#8217;origine aucun trait &#233;v&#233;nementiel, comme le Watergate, les fr&#233;gates de
Taiwan, le sang contamin&#233; ou Clearstream. Ainsi, Copenhague, fin 2009-d&#233;but 2010, ne d&#233;signait plus
seulement aux yeux du monde la capitale du Danemark, mais surtout la conf&#233;rence des Nations Unies sur
le changement climatique qui s&#8217;y est tenue. La raret&#233; impliquant la qualit&#233;, il ne nous est pas possible de
concevoir passer &#224; c&#244;t&#233; de ces termes qui dans l&#8217;imaginaire collectif sont &#233;troitement li&#233;s (ne serait-ce que
sur une courte p&#233;riode) &#224; un &#233;v&#233;nement particulier. Dans le cas de mots polys&#233;miques, la t&#226;che est aussi
complexe. En effet, le mot salon d&#233;signe le mobilier et la pi&#232;ce qui le re&#231;oit, autant que le lieu d&#8217;exposi-
tion et l&#8217;&#233;v&#233;nement qui s&#8217;y d&#233;roule. Avec une majuscule, Salon est r&#233;guli&#232;rement analys&#233; en EN de type
lieu, car c&#8217;est un nom de ville. Dans une phrase comme Le Salon de l&#8217;Agriculture est organis&#233; Porte de
Versailles, on souhaite valider le groupe nominal Salon de l&#8217;Agriculture en tant que nom d&#8217;&#233;v&#233;nement.
</p>
<p>L&#8217;hypoth&#232;se que nous cherchons &#224; v&#233;rifier dans le travail pr&#233;sent&#233; ici est que l&#8217;utilisation des verbes qui
impliquent la cause ou la cons&#233;quence pourrait constituer un indice pour la reconnaissance de ces expres-
sions en EN-E et pour l&#8217;obtention d&#8217;expressions &#8220;candidates&#8221;. Nous appelons &#8220;expression candidate&#8221; une
expression qui ne repr&#233;sente pas un &#233;v&#233;nement en temps normal, mais qui dans un certain contexte en est
un (les h&#233;m&#233;ronymes, les toponymes ou les noms polys&#233;miques). Constituer une liste de ces expressions
peut bien entendu &#234;tre pr&#233;cieux pour faciliter l&#8217;extraction de ces &#233;v&#233;nements par la suite. Par exemple,
11 septembre, dans un titre d&#8217;article, peut &#234;tre un &#233;v&#233;nement, mais &#233;galement une simple date, tandis que</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#201;ATRICE ARNULPHY, XAVIER TANNIER, ANNE VILNAT
</p>
<p>12 septembre, ne peut &#234;tre a priori qu&#8217;une date.
</p>
<p>Une action ou un &#233;v&#233;nement peut &#234;tre la cause d&#8217;un autre &#233;v&#233;nement : un &#233;v&#233;nement &#8220;provoque&#8221; ainsi un
autre &#233;v&#233;nement en cons&#233;quence. Les verbes entra&#238;ner ou provoquer peuvent fonctionner de la sorte. Dans
La crise &#233;conomique entra&#238;nera la famine dans de nombreux pays sous-d&#233;velopp&#233;s, le verbe entra&#238;ner a
pour sujet la crise &#233;conomique et pour objet la famine. Famine est l&#8217;&#233;v&#233;nement cons&#233;quence de l&#8217;autre
EN-E de la phrase, la crise &#233;conomique. C&#8217;est aussi le mode de fonctionnement du verbe signer dans Le
11 septembre signe la fin de cette h&#233;g&#233;monie sur le reste du monde. Ici, signer pr&#233;sente deux &#233;v&#233;nements,
l&#8217;un (11 septembre) cause de l&#8217;autre (fin de cette h&#233;g&#233;monie sur le reste du monde).
</p>
<p>Nous souhaitons donc v&#233;rifier si les syntagmes nominaux en position sujet ou argument de certains verbes
de cause-cons&#233;quence sont g&#233;n&#233;ralement des &#233;v&#233;nements.
</p>
<p>4 Exp&#233;rimentations
</p>
<p>Pour mener &#224; bien notre &#233;tude sur l&#8217;int&#233;r&#234;t des verbes de cause-cons&#233;quence dans le cadre de l&#8217;extraction
d&#8217;EN-E, nous avons privil&#233;gi&#233; une approche lexicale du probl&#232;me. &#192; partir d&#8217;une liste de verbes d&#233;ga-
g&#233;e au cours d&#8217;&#233;tudes de corpus pr&#233;alables, nous avons pr&#233;lev&#233; des syntagmes nominaux (SN) issus des
contextes gauches et droits au moyen de grammaires locales d&#233;velopp&#233;es avec Wmatch. Deux annotateurs
(expert) ont ensuite filtr&#233; manuellement les SN extraits pour ne conserver que les groupes en position sujet
et argument, en tenant &#233;galement compte des sujets invers&#233;s. Ceci permet de s&#8217;affranchir des &#233;ventuelles
erreurs du syst&#232;me. Rappelons que le but n&#8217;est pas de tester un syst&#232;me (permettant ou non une analyse
syntaxique), mais d&#8217;&#233;valuer dans quelle mesure certains verbes sont accompagn&#233;s de noms d&#8217;&#233;v&#233;nements.
</p>
<p>En parall&#232;le, les annotateurs ont indiqu&#233; si le sujet du verbe (s&#8217;il existe) et si l&#8217;argument le plus proche de
ce verbe (si un argument a &#233;t&#233; extrait) repr&#233;sentent ou non des noms d&#8217;&#233;v&#233;nements. Au total, 4345 verbes
ont &#233;t&#233; annot&#233;s en une dizaine d&#8217;heures, pour un total de 5016 noms. L&#8217;accord inter-annotateur est jug&#233;
bon (kappa = 0,79 (Cohen, 1960)). Puis les verbes ont &#233;t&#233; regroup&#233;s en fonction de leur lemme, de leur
pr&#233;position et de leur pronominalisation (expliquer et s&#8217;expliquer par sont deux entit&#233;s distinctes &#233;tant
donn&#233; leur fonctionnement syntaxique diff&#233;rent). On obtient ainsi 89 unit&#233;s verbales.
</p>
<p>Les tableaux suivants pr&#233;sentent les verbes qui ont, pour au moins 75% de leurs occurrences dans le
corpus, un &#233;v&#233;nement en position sujet (Tableau 1.a) ou en argument (Tableau 1.b). Bien entendu, certains
de ces chiffres sont peu significatifs &#233;tant donn&#233; leur nombre d&#8217;occurrences, comme avoir pour origine
pr&#233;sent dans que les crises aient pour origine des probl&#232;mes de d&#233;faillance technique, de sant&#233; publique,
etc. ou tirer les le&#231;ons de dans le gouvernement se r&#233;unira pour tirer les le&#231;ons des &#233;lections. Nous avons
cependant choisi de les conserver dans cette liste parce qu&#8217;ils nous semblent particuli&#232;rement pertinents.
</p>
<p>Il est int&#233;ressant de constater que 305 noms d&#8217;&#233;v&#233;nements du corpus ne sont pas pr&#233;sents dans les listes
pr&#233;-&#233;tablies. Par exemple, si conflit y est pr&#233;sent (le conflit Danone peut donner naissance &#224; une forme
d&#8217; alliance entre salari&#233;s et consommateurs), ce n&#8217;est pas le cas de mise en sourdine dans cette &#233;lection
entra&#238;nera-t-elle la mise en sourdine des int&#233;r&#234;ts communaux ? ni de toll&#233; (provoqu&#233; un toll&#233; chez les
organisations am&#233;rindiennes) ou de revers (subissent un cuisant revers). Ces mots peuvent donc &#234;tre
int&#233;gr&#233;s dans nos lexiques.
</p>
<p>Par ailleurs, nous souhaitions &#233;galement v&#233;rifier une autre hypoth&#232;se selon laquelle &#8220;un &#233;v&#233;nement pro-
voque un &#233;v&#233;nement&#8221;, c&#8217;est-&#224;-dire la configuration dans laquelle sujet et argument d&#8217;un verbe sont tous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LES ENTIT&#201;S NOMM&#201;ES &#201;V&#201;NEMENT ET LES VERBES DE CAUSE-CONS&#201;QUENCE
</p>
<p>Pourcentage
Verbe infinitif Occurrences d&#8217;&#233;v&#233;nements
</p>
<p>&#224; gauche
avoir lieu 89 100%
se produire 45 94%
provoquer 42 76%
s&#8217;expliquer par 12 92%
se traduire par 12 80%
affecter 10 83%
aboutir &#224; 7 78%
pr&#233;cipiter 4 80%
se passer 4 80%
avoir pour origine 1 100%
&#234;tre entra&#238;ner 1 100%
rendre &#224; 1 100%
se donner 1 100%
</p>
<p>Pourcentage
Verbe infinitif Occurrences d&#8217;&#233;v&#233;nements
</p>
<p>&#224; droite
provoquer 134 87%
organiser 120 94%
permettre 85 79%
subir 84 76%
d&#233;clencher 56 100%
conduire &#224; 55 93%
assister &#224; 53 93%
contribuer &#224; 46 81%
aboutir &#224; 38 81%
se traduire par 34 87%
donner lieu &#224; 22 100%
perp&#233;trer 16 80%
inciter &#224; 5 100%
occasionner 1 100%
se pr&#233;cipiter &#224; 1 100%
tirer les
</p>
<p>cons&#233;quences de 1 100%
tirer les le&#231;ons de 1 100%
</p>
<p>a) Position sujet b) Position argument
</p>
<p>TAB. 1 &#8211; Pr&#233;sence &#224; 75% et plus d&#8217;un SN d&#233;signant un &#233;v&#233;nement en position sujet ou argument de verbes
de cause-cons&#233;quence
</p>
<p>les deux des &#233;v&#233;nements. Sur 670 verbes pr&#233;sentant une annotation des sujet et argument (31 verbes dif-
f&#233;rents), 181 occurrences seulement pr&#233;sentent la configuration &#233;v&#233;nement-verbe-&#233;v&#233;nement, et aucun
verbe ne se d&#233;tache vraiment pour d&#233;montrer notre hypoth&#232;se. Le meilleur exemple, le verbe provoquer,
compte 30 occurrences de ce type pour 45 triplets, comme son arrestation provoque des manifestations mi-
religieuses, mi-politiques. Le tiers a pour argument des cons&#233;quences mat&#233;rielles comme dans une autre
mini-tornade a provoqu&#233; des d&#233;g&#226;ts &#224; Villeneuve-l&#232;s-Maguelone ou pour sujet des personnes ou assimil&#233;s
personne, exemple : le Conseil de pr&#233;vention et de lutte contre le dopage avait provoqu&#233; une petite crise
avec l&#8217;Union cycliste. On peut aussi noter donner lieu &#224; qui 7 fois sur 10 v&#233;rifie cette hypoth&#232;se, le rachat
de USA Networks ne donnera lieu ni &#224; cr&#233;ation d&#8217;actions nouvelles ni &#224; d&#8217;importantes sorties d&#8217;argent
liquide.
</p>
<p>Enfin, les deux dates du corpus repr&#233;sentant des &#233;v&#233;nements ont &#233;t&#233; rep&#233;r&#233;es au moyen des verbes de
cause-cons&#233;quence. Il s&#8217;agit de 11 septembre (le 11 septembre aura pr&#233;cipit&#233; une r&#233;cession) et mai 68
(mai 68 a pr&#233;cipit&#233; sa disparition). M&#234;me si les occurrences sont peu nombreuses, ce r&#233;sultat est in-
t&#233;ressant. En effet, une m&#233;thode d&#8217;extraction bas&#233;e sur les verbes de cause-cons&#233;quence peut conduire &#224;
construire une liste de dates ou de lieux qui peuvent potentiellement se comporter comme des &#233;v&#233;nements,
et donc d&#8217;en am&#233;liorer l&#8217;extraction.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#201;ATRICE ARNULPHY, XAVIER TANNIER, ANNE VILNAT
</p>
<p>5 Conclusion et perspectives
</p>
<p>Nous envisageons dans un futur proche de mener &#224; terme une autre partie de cette &#233;tude qui consiste &#224;
v&#233;rifier la validit&#233; de nos listes de d&#233;clencheurs. Une perspective int&#233;ressante serait d&#8217;utiliser l&#8217;analyse
syntaxique afin de travailler sur les sujets et compl&#233;ments d&#8217;objet des verbes qui nous int&#233;ressent, &#224; la
suite de cette &#233;tude pr&#233;alable purement lexicale. Enfin nous pr&#233;voyons d&#8217;int&#233;grer l&#8217;utilisation des verbes
de cause-cons&#233;quence qui se sont d&#233;gag&#233;s de notre &#233;tude afin de collecter des mots d&#233;clencheurs d&#8217;&#233;v&#233;ne-
ments et d&#8217;extraire au mieux nos EN-E.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BITTAR A. (2009). Annotation of events and temporal expressions in french texts. In ACL-SIGANN.
COHEN J. (1960). A coefficient of agreement for nominal scales. Educational and Psychological Mea-
surement, 20, 37&#8211;46.
DODDINGTON G., MITCHELL A., PRZYBOCKI M., RAMSHAW L., STRASSEL S. &amp; WEISCHEDEL R.
(2004). The Automatic Content Extraction program - tasks, data, and evaluation. In LREC&#8217;04.
EHRMANN M. (2008). Les Entit&#233;s Nomm&#233;es, de la linguistique au Tal : Statut th&#233;orique et m&#233;thodes de
d&#233;sambigu&#239;sation. PhD thesis, Universit&#233; Paris 7.
EHRMANN M. &amp; HAG&#200;GE C. (2009). Proposition de caract&#233;risation et de typage des expressions tem-
porelles en contexte. In Actes de TALN 2009, Avignon.
GALIBERT O. (2009). Approches et m&#233;thodologies pour la r&#233;ponse automatique &#224; des questions adap-
t&#233;es &#224; un cadre interactif en domaine ouvert. PhD thesis, Universit&#233; Paris-Sud 11, Orsay, France.
GRAVIER G., BONASTRE J.-F., GEOFFROIS E., GALLIANO S., MCTAIT K. &amp; CHOUKRI K. (2004).
Ester, une campagne d&#8217;&#233;valuation des syst&#232;mes d&#8217;indexation automatique d&#8217;&#233;missions radiophoniques
en fran&#231;ais. In Proceedings of JEP&#8217;04, F&#232;z, Maroc.
HATHOUT N., NAMER F. &amp; DAL G. (2002). An Experimental Constructional Database: The MorTAL
Project. In P. BOUCHER, Ed., Many Morphologies, p. 178&#8211;209. Somerville, Mass.: Cascadilla.
LECOLLE M. (2004). Toponymes en jeu : Diversit&#233; et mixage des emplois m&#233;tonymiques de toponymes.
In Studii si cercetari filologice 3 / 2004, Universit&#233; de Pitesti, Roumanie.
NEVEU E. &amp; QU&#201;R&#201; L. (1996). Pr&#233;sentation. R&#233;seaux, 14(75), 7&#8211;21.
PUSTEJOVSKY J., CASTA&#209;O J., INGRIA R., SAUR&#205; R., GAIZAUSKAS R., SETZER A. &amp; KATZ G.
(2003). TimeML: Robust specification of event and temporal expressions in text. In IWCS-5.
ROSSET S., GALIBERT O., ILLOUZ G. &amp; MAX A. (2005). Interaction et recherche d&#8217;information : le
projet RITEL. TAL. Traitement automatique des langues, 46(3), 155&#8211;179.
STEIMBERG L. C. (2006). La construction de la m&#233;moire historico-m&#233;diatique &#224; travers les d&#233;signations
d&#8217;&#233;v&#233;nements. Studies van de BKL 2006 - Papers of the LSB 2006.
STEIMBERG L. C. (2008). Les h&#233;m&#233;ronymes. ces &#233;v&#232;nements qui font date, ces dates qui deviennent
&#233;v&#232;nements. Mots. Les langages du politique, 3, 115&#8211;128.
VELDE D. V. D. (2000). Existe-t-il des noms propres de temps ? Lexique, 15, 151.
VENDLER Z. (1967). Verbs and Times, In Linguistics in Philosophy, p. 97&#8211;121. Cornell University
Press: Ithaca, NY, USA.</p>

</div></div>
</body></html>