<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Recherche contextuelle d&#8217;&#233;quivalents en banque de terminologie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Recherche contextuelle d&#8217;&#233;quivalents en banque de terminologie  
</p>
<p>Caroline Barri&#232;re 
ITI-CNR, Gatineau, Canada 
</p>
<p>caroline.barriere@nrc-cnrc.gc.ca 
</p>
<p>R&#233;sum&#233; Notre recherche d&#233;montre que l&#8217;utilisation du contenu d&#8217;un texte &#224; traduire permet 
de mieux cibler dans une banque de terminologie les &#233;quivalents terminologiques pertinents &#224; 
</p>
<p>ce texte.  Une banque de terminologie a comme particularit&#233; qu&#8217;elle cat&#233;gorise ses entr&#233;es 
(fiches) en leur assignant un ou des domaines provenant d&#8217;une liste de domaines pr&#233;&#233;tablie.  
La strat&#233;gie ici pr&#233;sent&#233;e repose sur l&#8217;utilisation de cette information sur les domaines.  Un 
algorithme a &#233;t&#233; d&#233;velopp&#233; pour l&#8217;assignation automatique d&#8217;un profil de domaines &#224; un texte.  
Celui-ci est combin&#233; &#224; un algorithme d&#8217;appariement entre les domaines d&#8217;un terme pr&#233;sent 
dans la banque de terminologie et le profil de domaines du texte.  Pour notre exp&#233;rimentation, 
</p>
<p>des r&#233;sum&#233;s bilingues (fran&#231;ais et anglais) provenant de huit revues scientifiques nous 
</p>
<p>fournissent un ensemble de 1130 paires d&#8217;&#233;quivalents terminologiques et le Grand 
Dictionnaire Terminologique (Office Qu&#233;b&#233;cois de la Langue Fran&#231;aise) nous sert de 
</p>
<p>ressource terminologique.  Sur  notre ensemble, nous d&#233;montrons une r&#233;duction de 75% du 
</p>
<p>rang moyen de l&#8217;&#233;quivalent correct en comparaison avec un choix au hasard.  
</p>
<p>Abstract Our research shows the usefulness of taking into account the context of a term 
within a text to be translated to better find an appropriate term equivalent for it in a term bank.  
</p>
<p>A term bank has the particularity of categorising its records by assigning them one or more 
</p>
<p>domains from a pre-established list of domains. The strategy presented here uses this domain 
</p>
<p>information.  An algorithm has been developed to automatically assign a domain profile to a 
</p>
<p>source text.  It is then combined with another algorithm which finds a match between a term&#8217;s 
domains (as found in the term bank) and the text&#8217;s domain profile.  For our experimentation, 
bilingual abstracts (French-English) from eight scientific journals provide 1130 pairs of term 
</p>
<p>equivalents.  The Grand Dictionnaire Terminologique (Office Qu&#233;b&#233;cois de la Langue 
</p>
<p>Fran&#231;aise) is used as a terminological ressource. On our data set, we show a reduction of 75% 
</p>
<p>in the average rank of the correct equivalent, in comparison to a random choice. 
</p>
<p>   
</p>
<p>Mots-cl&#233;s :   recherche contextuelle, &#233;quivalents terminologiques, banque de 
terminologie, d&#233;sambigu&#239;sation par domaine 
</p>
<p>Keywords:   contextual search, term equivalents, term bank, domain-based 
disambiguation 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Barri&#232;re 
</p>
<p>1   Introduction 
</p>
<p>Une banque de terminologie contient un ensemble de fiches terminologiques.  Chaque fiche 
</p>
<p>repr&#233;sente un concept (une notion) et &#224; ce concept est associ&#233; un ou plusieurs termes dans une 
</p>
<p>ou plusieurs langues.  Une banque de terminologie est souvent multilingue.  Le Grand 
</p>
<p>Dictionnaire Terminologique (GDT) de l&#8217;Office Qu&#233;b&#233;cois de la Langue Fran&#231;aise1 qui nous 
servira pour notre exp&#233;rimentation a comme langues de base le fran&#231;ais et l&#8217;anglais.  Ainsi, 
nous dirons que pour un concept, il existe une fiche terminologique contenant des termes 
</p>
<p>&#233;quivalents en fran&#231;ais et anglais servant &#224; nommer ce concept dans chacune des langues. 
</p>
<p>Les banques de terminologie ont pour but de r&#233;pertorier les concepts appartenant &#224; divers 
</p>
<p>domaines de sp&#233;cialit&#233; (m&#233;canique automobile, finances, biologie mol&#233;culaire, etc), et ainsi, 
</p>
<p>elles cat&#233;gorisent leurs entr&#233;es (fiches terminologiques) en leur assignant un ou des domaines 
</p>
<p>provenant d&#8217;une liste de domaines pr&#233;&#233;tablie.  Ces banques sont utilis&#233;es par les r&#233;dacteurs, 
journalistes, enseignants ou autres langagiers &#224; la recherche de termes justes et les traducteurs 
</p>
<p>&#224; la recherche d&#8217;&#233;quivalents corrects. 
</p>
<p>M&#234;me si l&#8217;organisation sous-jacente de la banque de terminologie est onomasiologique (par 
concept), la recherche dans cette banque ne peut se faire que par terme.  Un terme &#233;tant 
</p>
<p>souvent polys&#233;mique, le traducteur doit alors consulter les diverses fiches correspondant &#224; ce 
</p>
<p>terme pour d&#233;couvrir laquelle exprime la notion recherch&#233;e. Cette recherche est essentielle car 
</p>
<p>les diff&#233;rentes notions sont souvent li&#233;es &#224; des &#233;quivalents diff&#233;rents dans les autres langues.  
</p>
<p>Par exemple, la fiche pour stem dans le domaine de l&#8217;emballage et conditionnement donnera 
tige de commande comme &#233;quivalent, tandis que celle dans le domaine de la linguistique 
</p>
<p>donnera racine, ou encore celle dans le domaine de l&#8217;a&#233;ronautique donnera &#233;trave. 
</p>
<p>Les interfaces aux banques terminologies varient, mais en g&#233;n&#233;ral, lorsqu&#8217;un traducteur 
cherche l&#8217;&#233;quivalent d&#8217;un terme, il peut consulter la banque de terminologie en regardant de 
fa&#231;on exhaustive toutes les fiches correspondantes au terme, ou il peut parcourir d&#8217;abord la 
liste des domaines r&#233;pertori&#233;s pour ce terme, choisir un domaine et ensuite consulter les fiches 
</p>
<p>de ce domaine.  Parcourir cette liste de domaine peut prendre du temps pour retrouver ceux 
</p>
<p>qui conviennent.  Le terme stem fera partie de 41 domaines, aussi vari&#233;s que a&#233;ronautique, 
</p>
<p>agriculture, horlogerie, cosm&#233;tologie, manutention et stockage, &#233;quipement m&#233;nager, loisir, 
</p>
<p>linguistique, marine, plomberie, emballage et conditionnement, sports, imprimerie ou tabac.   
</p>
<p>Id&#233;alement, le traducteur devrait pouvoir pr&#233;ciser &#224; l&#8217;avance le domaine de son texte et r&#233;duire 
ainsi la portion ad&#233;quate de la banque de terminologie.  Malheureusement les fronti&#232;res entre 
</p>
<p>les domaines sont floues (par exemple, environnement et agriculture, m&#233;tallurgie et mines), et 
</p>
<p>comme plusieurs notions recoupent plusieurs domaines, l&#8217;&#233;num&#233;ration &#224; l&#8217;avance de tous les 
domaines couverts par un texte &#224; traduire serait presque impossible. 
</p>
<p>Le but applicatif de notre projet est donc d&#8217;aider le traducteur &#224; faire plus rapidement la 
recherche de fiches terminologiques en filtrant l&#8217;ensemble des fiches r&#233;pertori&#233;es dans la 
banque pour lui proposer les fiches les plus pertinentes &#224; son texte.  Nos buts technologiques 
</p>
<p>sont alors (1) &#233;tablir automatiquement un profil de domaines pour un texte (ou une portion de 
</p>
<p>                                                 
1
 Le Grand Dictionnaire Terminologique est accessible gratuitement &#224; http://www.granddictionnaire.com, et il est 
</p>
<p>aussi accessible par le site officiel de l&#8217;Office qu&#233;b&#233;cois de la langue fran&#231;aise (http://www.oqlf.gouv.gc.ca). 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche contextuelle d&#8217;&#233;quivalents en banque de terminologie 
 
</p>
<p>celui-ci) en choisissant parmi les domaines de la banque de terminologie
2
, et (2) utiliser ce 
</p>
<p>profil pour apparier un terme pr&#233;sent dans le texte &#224; sa fiche terminologique et ainsi retrouver 
</p>
<p>son &#233;quivalent.  
</p>
<p>Notre t&#226;che est similaire &#224; une t&#226;che de d&#233;sambigu&#239;sation par sens mais adapt&#233;e &#224; la langue de 
</p>
<p>sp&#233;cialit&#233; et au contenu d&#8217;une banque terminologique qui est diff&#233;rent du contenu d&#8217;un 
dictionnaire.  Ainsi, quoique la d&#233;sambigu&#239;sation par sens ait &#233;t&#233; largement &#233;tudi&#233;e dans la 
</p>
<p>communaut&#233; en linguistique computationnelle, ayant m&#234;me donn&#233; lieu &#224; des comp&#233;titions 
</p>
<p>internationales (Senseval-3 Mihalcea and Edmonds 2004, SemEval-1 Agirre et al. 2007), la 
</p>
<p>d&#233;sambigu&#239;sation automatique de termes sp&#233;cialis&#233;s n&#8217;a pas beaucoup &#233;t&#233; &#233;tudi&#233;e, et nous ne 
retrouvons pas de travaux sur ce sujet.  Cela est peut-&#234;tre d&#251; &#224; une conception fausse que les 
</p>
<p>termes sp&#233;cialis&#233;s sont monos&#233;miques.  Il est vrai que les termes compos&#233;s sont souvent 
</p>
<p>monos&#233;miques, mais la langue de sp&#233;cialit&#233; est aussi remplie de termes simples ayant divers 
</p>
<p>sens dans divers domaines, en plus parfois d&#8217;avoir aussi un sens r&#233;pandu dans la langue 
g&#233;n&#233;rale.  Le terme stress en anglais par exemple est tr&#232;s r&#233;pandu et le plus souvent traduit par 
</p>
<p>stress en fran&#231;ais, mais ce terme prend soudainement un sens tr&#232;s particulier dans le domaine 
</p>
<p>de la construction et devra se traduire par fatigue.  Barri&#232;re (2007) pr&#233;sente une comparaison 
</p>
<p>entre les ressources lexicographiques et terminologiques en particulier quant &#224; leur utilit&#233; pour 
</p>
<p>la d&#233;sambigu&#239;sation du sens.  
</p>
<p>La majeure partie des travaux en d&#233;sambigu&#239;sation s&#233;mantique utilise la ressource WordNet 
</p>
<p>(de par sa large couverture et sa disponibilit&#233;).  Ces travaux proposent aussi l&#8217;utilisation du 
contexte d&#8217;usage des mots pour aider &#224; les d&#233;sambigu&#239;ser, mais leur point de comparaison 
repose sur les d&#233;finitions des divers sens r&#233;pertori&#233;s (algorithmes de type Lesk, r&#233;f&#233;rant &#224; Lesk 
</p>
<p>1986).  Malheureusement, m&#234;me si une ressource terminologique peut contenir de courtes 
</p>
<p>d&#233;finitions, cette information n&#8217;est pas obligatoire, contrairement &#224; un dictionnaire, rendant 
inutilisable tous ces algorithmes d&#233;velopp&#233;s pour WordNet.  En banque de terminologie, c&#8217;est 
plut&#244;t l&#8217;assignation d&#8217;un ou plusieurs domaines qui est l&#8217;information minimale d&#8217;une fiche. 
</p>
<p>Les travaux de Gliozzo et al. (2004) utilisent les &#171; subject codes &#187; ou domaines ajout&#233;s &#224; 
</p>
<p>WordNet (Magnini et Cavagli&#224; 2000) pour d&#233;terminer le domaine d&#8217;un texte dans lequel 
appara&#238;t un mot ambigu.  Ce domaine du texte sert alors de caract&#233;ristique additionnelle 
</p>
<p>(plut&#244;t qu&#8217;unique pour nous) pour la d&#233;sambigu&#239;sation du mot, en surplus des crit&#232;res 
habituels (comparaison aux d&#233;finitions) tel que mentionn&#233; ci-haut.  Ces domaines ajout&#233;s &#224; 
</p>
<p>certaines entr&#233;es de WordNet sont peu souvent utilis&#233;s comme crit&#232;res de d&#233;sambigu&#239;sation, 
</p>
<p>mais plut&#244;t comme syst&#232;me de cat&#233;gorisation des mots &#224; un niveau de granularit&#233; moins 
</p>
<p>pr&#233;cis. Par exemple, le terme bank a 10 sens, mais n&#8217;a que 5 domaines possibles car &#233;conomie 
regroupe 4 sens, g&#233;ographie regroupe 2 sens, architecture regroupe 2 sens, transport regroupe 
</p>
<p>1 sens et il reste un sens g&#233;n&#233;ral.  Dans les travaux de Suarez et Palomar (2006) par exemple, 
</p>
<p>il s&#8217;agit de comparer des algorithmes de d&#233;sambigu&#239;sation en produisant des r&#233;sultats pour 
deux niveaux de granularit&#233;, soit fine avec les sens et plus grossi&#232;re avec les domaines. 
</p>
<p>La ressource utilis&#233;e pour le travail pr&#233;sent est le Grand Dictionnaire Terminologique de  
</p>
<p>l&#8217;Office Qu&#233;b&#233;cois de la Langue Fran&#231;aise (GDT)3.  Le tableau 1 montre des exemples de 
</p>
<p>                                                 
2
 Il reste &#224; valider si ce premier but serait aussi un but applicatif et non-seulement un interm&#233;diaire algorithmique 
</p>
<p>pour le but ultime d&#8217;aider le traducteur &#224; &#234;tre plus productif en lui proposant le bon &#233;quivalent.   Un logiciel tel 
LogiTerm (http://www.terminotix.com) sugg&#232;re une &#171; analyse de domaine &#187; dans sa version Entreprise, ce qui 
porte &#224; croire que cette t&#226;che en elle-m&#234;me a une valeur ajout&#233;e. 
</p>
<p>3
 Nous remercions l&#8217;Office Qu&#233;b&#233;cois de la Langue Fran&#231;aise pour l&#8217;acc&#232;s gratuit &#224; la base de donn&#233;es du Grand 
</p>
<p>Dictionnaire Terminologique qu&#8217;il a accord&#233; au Groupe de Technologies Langagi&#232;res Interactives pour des 
buts de recherche. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Barri&#232;re 
</p>
<p>termes anglais extraits d&#8217;une revue scientifique traitant de biologie avec des statistiques sur 
leur pr&#233;sence dans le GDT.  Pour chaque terme anglais, on peut voir des exemples 
</p>
<p>d&#8217;&#233;quivalents fran&#231;ais, le nombre de fiches, de domaines et d&#8217;&#233;quivalents pr&#233;sents.  Le 
nombre d&#8217;&#233;quivalents n&#8217;est pas identique au nombre de fiches car deux notions diff&#233;rentes 
(deux fiches) peuvent avoir le m&#234;me terme &#233;quivalent.  Le nombre de domaines n&#8217;est pas non 
plus identique au nombre de fiches car une fiche peut &#234;tre assign&#233;e &#224; deux domaines, ou deux 
</p>
<p>fiches pourraient appartenir &#224; un seul domaine (dans le cas d&#8217;un terme polys&#233;mique m&#234;me &#224; 
l&#8217;int&#233;rieur d&#8217;un domaine).  Les relations entre fiches, domaines et &#233;quivalents ne sont pas de 
type un-&#224;-un mais plut&#244;t de type plusieurs-&#224;-plusieurs rendant le probl&#232;me plus complexe. 
</p>
<p>Terme anglais 
  
</p>
<p>Exemples de termes fran&#231;ais  
(GDT) 
</p>
<p>Nombre 
de fiches 
</p>
<p>Nombre de 
domaines 
</p>
<p>Nombre 
d&#8217;&#233;quivalents 
</p>
<p>stress contrainte, effort, fatigue, sollicitation, stress 46 36 16 
</p>
<p>activity activit&#233;, exercice, mouvementation 19 17 3 
</p>
<p>feather plume, aur&#233;ole, barbule, clavette, fouet 17 29 12 
</p>
<p>membrane membrane, feuillet de parchemin, paroi &#233;tanche 8 8 4 
</p>
<p>calcium calcium 5 6 1 
</p>
<p>infrared 
spectroscopy 
</p>
<p>spectroscopie infrarouge, spectroscopie de 
l&#8217;infrarouge 3 6 2 
</p>
<p>fibrosis fibrose 2 2 1 
</p>
<p>heat shock choc thermique 1 2 1 
</p>
<p>haloperidol halop&#233;ridol 1 1 1 
</p>
<p> 
</p>
<p>Tableau 1 &#8211; Exemples de termes d&#8217;une revue retrouv&#233;s dans le GDT 
 
</p>
<p>Ainsi, pour aider le traducteur, l&#8217;id&#233;al serait de lui proposer la bonne fiche correspondant &#224; 
son texte, ou du moins lui montrer les fiches en ordre de pertinence.  Dans notre 
</p>
<p>exp&#233;rimentation, pour pouvoir r&#233;ellement &#233;valuer notre succ&#232;s &#224; cette t&#226;che, nous aurions 
</p>
<p>besoin de textes annot&#233;s s&#233;mantiquement, ce qui serait long et co&#251;teux &#224; obtenir.  Nous avons 
</p>
<p>par contre acc&#232;s &#224; des paires d&#8217;&#233;quivalents en contexte (voir description &#224; la section 2) et nous 
pourrons ainsi &#233;valuer notre capacit&#233; &#224; retrouver le bon &#233;quivalent, sachant que ceci n&#8217;est 
qu&#8217;une approximation (tout de m&#234;me raisonnable) de la t&#226;che. 
</p>
<p>La section 2 pr&#233;sente l&#8217;ensemble des donn&#233;es utilis&#233;, la section 3 pr&#233;sente l&#8217;algorithme de 
d&#233;sambigu&#239;sation utilis&#233;, la section 4 pr&#233;sente les r&#233;sultats obtenus et une analyse des r&#233;sultats 
</p>
<p>et des difficult&#233;s, et finalement la section 5 nous permet de conclure et d&#8217;envisager des 
travaux futurs. 
</p>
<p>2   D&#233;finition du probl&#232;me et ensemble de donn&#233;es 
</p>
<p>Nous avons acc&#232;s &#224; huit revues scientifiques contenant chacune un ensemble d&#8217;articles4.  
Chaque article poss&#232;de un r&#233;sum&#233; en anglais et un r&#233;sum&#233; en fran&#231;ais tel que traduit par la 
</p>
<p>r&#233;daction.  Chaque article contient aussi de 2 &#224; 5 mots-cl&#233;s donn&#233;s par les auteurs et traduits 
</p>
<p>par la r&#233;daction.  L&#8217;alignement de ces mots-cl&#233;s dans les fichiers est suffisamment coh&#233;rent 
pour faire l&#8217;extraction automatique des paires correspondantes.  Il y a quelques anomalies 
(inversions, oublis), mais elles sont rares (moins de 1%).  Ainsi, la constitution de notre 
</p>
<p>ensemble de donn&#233;es, soit l&#8217;ensemble des paires de termes &#233;quivalents, peut se faire 
</p>
<p>                                                 
4
 Merci &#224; l&#8217;ICIST (Institut Canadien de l&#8217;Information Scientifique et Technique) pour l&#8217;obtention du contenu de 
</p>
<p>ces revues. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche contextuelle d&#8217;&#233;quivalents en banque de terminologie 
 
</p>
<p>enti&#232;rement automatiquement &#224; partir des listes de mots-cl&#233;s des auteurs.  De cette liste, nous 
</p>
<p>utilisons uniquement les mots-cl&#233;s se retrouvant dans le r&#233;sum&#233;
5
. 
</p>
<p> 
</p>
<p>Le tableau 2 montre sur l&#8217;ensemble des revues, le nombre d&#8217;articles associ&#233;s, et le nombre de 
paires de termes &#233;quivalents extraits.  Nous voyons que le GDT ne sera utile que pour une 
</p>
<p>petite portion des donn&#233;es.  Nous pouvons voir que des 10944 paires extraites de l&#8217;ensemble 
des revues scientifiques, seulement 13.6% sont pr&#233;sentes dans le GDT et contiennent 
</p>
<p>plusieurs &#233;quivalents.  Les termes qui ne poss&#232;dent qu&#8217;une seule fiche ne sont pas des 
candidats int&#233;ressants pour notre t&#226;che de d&#233;sambigu&#239;sation.  De plus, m&#234;me si plusieurs 
</p>
<p>fiches sont pr&#233;sentes dans le GDT, parfois l&#8217;&#233;quivalent d&#233;sir&#233; (tel que cit&#233; dans l&#8217;article 
scientifique) ne s&#8217;y retrouve pas.  Notre pourcentage d&#8217;int&#233;r&#234;t est alors r&#233;duit &#224; 10.3% pour un 
total de 1130 paires de termes polys&#233;miques dont l&#8217;&#233;quivalent d&#233;sir&#233; est r&#233;pertori&#233; et qui 
serviront donc &#224; notre exp&#233;rimentation. 
</p>
<p> 
Revue Scientifique Nombre 
</p>
<p>de 
r&#233;sum&#233;s 
</p>
<p>Nb de 
paires 
de 
termes 
</p>
<p>% paires 
ne se 
retrouvant 
pas dans le 
GDT 
</p>
<p>% paires 
n&#8217;ayant qu&#8217;un 
seul &#233;quivalent 
dans le GDT 
</p>
<p>% paires 
ayant plus 
d&#8217;un 
&#233;quivalent 
dans le GDT 
</p>
<p>Biochemistry and cell biology 472 736 64.9% 24.0% 11.0% 
</p>
<p>Canadian Geotechnical Journal 618 1047 54.8% 17.6% 28.6% 
</p>
<p>Canadian Journal of Botany 1002 1925 72.9% 15.6% 11.5% 
</p>
<p>Canadian journal of chemistry 1341 1846 73.1% 19.4% 7.4% 
</p>
<p>Canadian journal of civil engineering 608 1239 53.1% 17.8% 29.1% 
</p>
<p>Canadian journal of microbiology 852 1456 71.0% 19.4% 9.6% 
</p>
<p>Canadian journal of physiology and 
pharmacology 
</p>
<p>846 1504 63.5% 26.4% 10.1% 
</p>
<p>Genome 854 1191 76.2% 15.5% 8.2% 
</p>
<p>TOTAL 6593 10944 67.3% 19.2% 13.6% 
</p>
<p> 
</p>
<p>Tableau 2 &#8211; Pr&#233;sence des termes dans le GDT 
</p>
<p>3   Recherche contextuelle de fiche terminologique 
</p>
<p>Le processus se divise en 2 &#233;tapes, soit (1) d&#233;terminer le profil de domaines associ&#233;s au texte, 
</p>
<p>et (2) en fonction de ce profil, d&#233;terminer la fiche correspondant au terme en contexte. 
</p>
<p>Etape 1 - Assignation d&#8217;un profil de domaines &#224; un texte 
</p>
<p>1) Initialiser une liste de domaines (AllDomains) 
2) Extraire un ensemble de termes du contexte (T1 &#224; TN) 
3) Pour chacun des termes Tx 
</p>
<p>a. Chercher les domaines du GDT correspondant aux fiches r&#233;pertori&#233;es pour ce terme (D1 &#224; DZ ) 
b. Pour chacun de ces domaines  Dy 
</p>
<p>i. Assigner une valeur inversement proportionnelle au nombre de domaines que le terme 
couvre :  DValue(Dy)  =   1 / nbDomaines(Tx) + 0.5 
</p>
<p>ii. Si le domaine se retrouve dans la liste AllDomains, alors incr&#233;menter sa valeur dans la 
liste de DValue(Dy) 
</p>
<p>iii. Sinon, alors ajouter le domaine &#224; la liste AllDomains avec sa valeur DValue(Dy) 
4) Trier en ordre d&#233;croissant de valeurs (DValue) la liste AllDomains 
</p>
<p> 
</p>
<p>                                                 
5
 Les mots-cl&#233;s &#233;tant donn&#233;s par les auteurs, ils peuvent &#234;tre absents du r&#233;sum&#233; ou s&#8217;y retrouver sous une forme 
</p>
<p>diff&#233;rente. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Barri&#232;re 
</p>
<p>Pour illustrer ce premier algorithme, supposons 4 termes extraits d&#8217;un texte, soient : stand (55 
domaines), stem (41 domaines), ramet (5 domaines), et stand development (2 domaines).  La 
</p>
<p>contribution au poids d&#8217;un domaine par le mot stand sera de 0.518 (0.5 + 1/55), tandis que la 
contribution au poids d&#8217;un domaine par le mot ramet sera de 0.7 (0.5 + 1/2).  Le tableau 3 
montre le calcul du poids de divers domaines obtenus &#224; partir de ces 4 diff&#233;rents termes en 
</p>
<p>fonction de l&#8217;appartenance de chaque terme aux divers domaines. 
 
</p>
<p> stand stem ramet stand 
development 
</p>
<p>total 
</p>
<p>sylviculture 0.518 0.524 0.7 1.0 2.742 
</p>
<p>agriculture 0.518  0.7 1.0 2.218 
</p>
<p>forestry 0.518 0.524 0.7  1.742 
</p>
<p>botany  0.524 0.7  1.224 
</p>
<p>electric mixers 0.518 0.524   1.042 
</p>
<p>arboriculture   0.7  0.7 
</p>
<p>sea transport  0.524   0.524 
</p>
<p>dentistry 0.518    0.518 
</p>
<p> 
</p>
<p>Tableau 3 &#8211; Exemples de contribution des domaines au profil 
 
</p>
<p>Cet algorithme d&#233;pend du nombre de termes extraits, et les r&#233;sultats seront pr&#233;sent&#233;s &#224; la 
</p>
<p>section 4 en fonction de cette variable.  L&#8217;algorithme de recherche de collocations fr&#233;quentes 
(d&#233;crite dans Smadja 1993) est utilis&#233; pour l&#8217;extraction de termes.  Le tableau 4 montre 
quelques exemples de termes extraits et de profils de domaines obtenus par l&#8217;algorithme ci-
haut.  Il faut pr&#233;ciser que plusieurs des termes extraits ne se retrouveront pas dans le GDT et 
</p>
<p>ainsi ne pourront pas contribuer &#224; la d&#233;termination du profil du domaine.   
</p>
<p> 
Termes extraits du contexte Profil de domaines (top 5) 
</p>
<p>sedimentation, sediment, pH, Welland river, 
solid concentration 
</p>
<p>geology (1.69), paper industry (1.69), hydrology 
(1.12), water (1.12), bottoms and shores (1.1) 
</p>
<p>excavation, strain sections, plain strain, 
finite element, three-dimensional finite 
</p>
<p>physics (1.0), water (1.0), foundations (0.62), 
construction (0.62), mining industry (0.62) 
</p>
<p>hydraulic conductivity, sds, naphthalene, 
NaCl, flushing 
</p>
<p>chemistry (1.28), water (1.23), plastic additives 
(0.75), plastics (0.75), organic chemistry (0.75) 
</p>
<p> 
</p>
<p>Tableau 4 &#8211; Exemples de profils de domaine 
 
</p>
<p>Les &#233;tapes d&#8217;extraction de termes et d&#8217;assignation de domaine ne sont pas &#233;valu&#233;es en soi car 
elles n&#233;cessiteraient des &#233;valuations humaines (subjectives et co&#251;teuses).  Nous pr&#233;f&#233;rons les 
</p>
<p>&#233;valuer indirectement par leur impact sur la t&#226;che finale d&#8217;assignation d&#8217;un &#233;quivalent 
pertinent &#224; un terme, t&#226;che que nous pourrons &#233;valuer automatiquement.  Cette &#233;valuation 
</p>
<p>indirecte est aussi propos&#233;e par Gliozzo et al. 2004 auquel nous avons fait r&#233;f&#233;rence 
</p>
<p>pr&#233;c&#233;demment.  En effet, bien que nous puissions faire un parall&#232;le entre la t&#226;che 
</p>
<p>d&#8217;assignation de domaine &#224; un texte et l&#8217;ensemble (tr&#232;s vaste) de travaux en cat&#233;gorisation de 
documents, la plupart de ces travaux utilisent des approches de type apprentissage-machine 
</p>
<p>supervis&#233;, ayant acc&#232;s &#224; des ensembles de textes pr&#233;-assign&#233;s &#224; des cat&#233;gories, mais nos 
</p>
<p>travaux sont plut&#244;t de type non-supervis&#233; n&#8217;ayant pas acc&#232;s &#224; des textes &#233;tiquet&#233;s et ne 
permettant pas d&#8217;&#233;valuation directe.  Ainsi, comme Gliozzo et al. 2004, nous ne faisons pas 
une &#233;valuation directe mais mesurons indirectement le succ&#232;s par la t&#226;che de 
</p>
<p>d&#233;sambigu&#239;sation (ici recherche d&#8217;&#233;quivalent) qui utilise les r&#233;sultats de l&#8217;assignation de 
domaines. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche contextuelle d&#8217;&#233;quivalents en banque de terminologie 
 
</p>
<p>Une fois le profil du texte d&#233;termin&#233; (&#233;tape 1), l&#8217;algorithme suivant permet de d&#233;terminer le 
domaine appropri&#233; au terme. 
</p>
<p>Etape 2 - Assignation d&#8217;une fiche &#224; un terme 
</p>
<p>1) Soit la liste des domaines provenant du profil du texte (AllDomains) 
2) &#201;tablir la liste des domaines du terme (TermDomList) en parcourant toutes ses fiches dans le GDT 
3) Pour chaque domaine de TermDomList 
</p>
<p>a. Si le domaine est pr&#233;sent dans AllDomains 
i. Attribuer &#224; ce domaine une valeur &#233;gale &#224; sa valeur AllDomains 
</p>
<p>b. Sinon 
i. Retrouver la similarit&#233; entre le domaine et chacun des domaines de AllDomains 
</p>
<p>ii. Pond&#233;rer chacune des similarit&#233; par la valeur de chacun des domaines de AllDomains 
iii. Attribuer &#224; ce domaine une valeur &#233;gale &#224; la somme pond&#233;r&#233;e des similarit&#233; 
</p>
<p>4) Ordonnancer les valeurs des domaines dans TermDomList 
5) Attribuer au terme le domaine ayant la valeur maximale 
6) R&#233;cup&#233;rer la (ou les) fiches ayant ce domaine 
</p>
<p> 
</p>
<p>Afin d&#8217;&#234;tre utilis&#233;e dans cette &#233;tape 2, la similarit&#233; entre deux domaines du GDT est pr&#233;-
calcul&#233;e sur le GDT entier pour tous ses domaines en fonction des termes que les domaines 
</p>
<p>ont en commun, en utilisant la formule du coefficient Dice, soit : NbTermesEnCommun entre 
</p>
<p>Domaine1 et Domaine 2 / NbTermes du Domaine1 + NbTermes du Domaine 2.   Cette approche permettra 
</p>
<p>d&#8217;&#233;tablir automatique que le domaine psychology est plus pr&#232;s des domaines medecine (0.19), 
statistics (0.13), sociology (0.11), mathematics (0.01) et que des domaines photography 
</p>
<p>(0.04), graphic design (0.03) ou finance (0.03).  La ressource terminologique ne contenant ni 
</p>
<p>d&#233;finition, ni structure (les fiches ne sont pas li&#233;es entre elles dans une taxonomie), nous 
</p>
<p>n&#8217;avons point d&#8217;autre information que le recoupement de termes pour &#233;tablir les distances 
entre les domaines.  Le GDT poss&#232;de une organisation hi&#233;rarchique de ses domaines en 2 
</p>
<p>niveaux (domaines g&#233;n&#233;raux et domaines sp&#233;cifiques), mais l&#8217;utilisation de cette structure 
limiterait la transportabilit&#233; de notre m&#233;thode.  
</p>
<p> 
</p>
<p>Pour illustrer l&#8217;&#233;tape 2, nous montrons au Tableau 5, &#224; la premi&#232;re rang&#233;e, un profil de 
domaines.  Ensuite chaque rang&#233;e subs&#233;quente montre la similarit&#233; entre un domaine possible 
</p>
<p>pour un terme (aeronautics, agriculture, finance) et chacun des domaines du profil.  Par 
</p>
<p>exemple la similarit&#233; entre aeronautics et tobacco est de 0.0029.  Ainsi, pour aeronautics, nous 
</p>
<p>aurons une pond&#233;ration de 0.0053*3.266 + 0.0029*2.55 + 0.0058*2.27 + 0.0045*1.57 + 
</p>
<p>0.0065*1.57 = 0.055, ce qui le rend moins probable que le domaine agriculture qui a obtenu 
</p>
<p>un total de 3.396. 
</p>
<p> 
Profil de 
domaines 
pour un texte 
</p>
<p>agriculture 
(3.266) 
</p>
<p>tobacco 
(2.55) 
</p>
<p>forestry 
(2.27) 
</p>
<p>graphic 
design 
(1.57) 
</p>
<p>printing 
(1.57) 
</p>
<p>TOTAL 
</p>
<p>aeronautics 0.0053 0.0029 0.0058 0.0045 0.0065 0.055 
</p>
<p>agriculture 1.0 0.012 0.032 0.0078 0.0095 3.396 
</p>
<p>finance 0.0032 0.0029 0.0048 0.0039 0.0055 0.045 
</p>
<p> 
</p>
<p>Tableau 5 &#8211; Exemple de calcul pour la pond&#233;ration de 3 domaines 
</p>
<p>4   Analyse des r&#233;sultats 
</p>
<p>Notre algorithme d&#8217;assignation d&#8217;&#233;quivalent est &#233;valu&#233; sur l&#8217;ensemble de donn&#233;es d&#233;crites &#224; la 
section 2.  Tel que mentionn&#233; pr&#233;c&#233;demment, nous ne pouvons en fait mesurer 
</p>
<p>automatiquement si notre algorithme choisit la bonne fiche pour un terme car notre ensemble 
</p>
<p>n&#8217;est pas &#233;tiquet&#233; de cette fa&#231;on.  Nous pouvons plut&#244;t approximer cette d&#233;sambigu&#239;sation par </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Barri&#232;re 
</p>
<p>l&#8217;attribution d&#8217;un bon (ou non) &#233;quivalent &#224; un terme.  Il s&#8217;agit d&#8217;une approximation car tel 
qu&#8217;indiqu&#233; &#224; la section 1 (voir Tableau 1), un terme pourrait avoir plusieurs fiches mais un 
seul &#233;quivalent ou encore plusieurs &#233;quivalents et une seule fiche.  Tout de m&#234;me, pour faire 
</p>
<p>une &#233;valuation juste, nous comparons le rang moyen de l&#8217;&#233;quivalent correct tel qu&#8217;obtenu par 
notre algorithme au rang moyen de l&#8217;&#233;quivalent correct s&#8217;il &#233;tait choisi au hasard. 
 
</p>
<p>Le tableau 6 montre un exemple de r&#233;sultat pour une paire de termes provenant d&#8217;un article 
scientifique, soit le terme layering et son &#233;quivalent marcottage en contexte.  Le tableau 
</p>
<p>montre les termes extraits du contexte, le profil de domaines obtenu (r&#233;sultat de l&#8217;algorithme 
1) et les &#233;quivalents ordonn&#233;s (r&#233;sultat de l&#8217;algorithme 2).  Comme marcottage se retrouve en 
premi&#232;re place, il obtient le rang 1, et ce en comparaison avec le rang 5 si cet &#233;quivalent &#233;tait 
</p>
<p>choisi au hasard parmi les 10 candidats possibles. 
</p>
<p> 
Paire de termes  layering - marcottage 
</p>
<p>&#201;quivalents 
possibles dans le 
GDT 
</p>
<p>couchage, lit&#233;, marcottage , layering, pistes multicouches, dispersion, organisation en 
couches,  superposition, feuilletage, vibration des strates 
</p>
<p>Contexte ... Clonal fragments in clearcut stands were large, predating the year of stand establishment, 
with many dead, old ramets, but many young stems. Ramet recruitment and lateral meristem 
formation were highest in clearcut stands, which contributed to replacement of older ramets 
lost to the disturbance. Clonal fragments in young stands were few and small, consisting of a 
few ramets and short decumbent stems. In maturing stands, clonal fragments were numerous 
but consisted of few ramets with extensive decumbent stem connections. No devil's club 
seedlings were observed in any of the stands sampled. Devil's club populations are 
maintained by prolific basal stem sprouting following disturbance and continual layering 
and clonal fragmentation throughout stand development. 
</p>
<p>Termes extraits clonal fragments, stands, stand development, lateral meristem formation, ramets, stem, 
young stands, ramet recruitment, meristem formation, ...  
</p>
<p>Profil de 
domaines estim&#233; 
</p>
<p>agriculture 3.27, tobacco 2.55, forestry 2.27, sylviculture 2.22,  botany 1.75, graphic design 
1.57, marine activities 1.57, household equipment 1.57, electric mixers 1.57, printing 1.57 
</p>
<p>&#201;quivalents (en 
ordre d&#233;croissant 
de ressemblance 
de leur domaine 
au profil) 
</p>
<p>marcottage (agriculture : 0.682), marcottage (sylviculture : 0.443), lit&#233; (handling and storage 
: 0.021), superposition (art : 0.014), feuilletage (dairy industry : 0.009), organisation en 
couches (computer science : 0.008), vibration des strates (aeronautics : 0.008), pistes 
multicouches (audiovisual : 0.007), layering (finance : 0.006), superposition (music : 0.0), 
couchage (arboriculture : 0.0), pistes multicouches (digital post-production : 0.0)  
</p>
<p>Rang obtenu 1 
</p>
<p>Rang au hasard 5 (soit 10 &#233;quivalents / 2) 
</p>
<p> 
</p>
<p>Tableau 6 &#8211; Exemple de r&#233;sultat de notre algorithme 
 
</p>
<p> 
Revue Scientifique Nb 
</p>
<p>Paires  
Rang si 
choix au 
hasard 
</p>
<p>5 
termes 
</p>
<p>10 
termes 
</p>
<p>15 
termes 
</p>
<p>20 
termes 
</p>
<p>Biochemistry and cell biology 59 6.91 1.41 1.39 1.36 1.31 
</p>
<p>Canadian Geotechnical Journal 220 9.12 2.52 2.46 2.44 2.45 
</p>
<p>Canadian Journal of Botany 167 7.56 2.41 2.14 2.16 2.22 
</p>
<p>Canadian journal of chemistry 118 6.88 1.80 1.73 1.79 1.74 
</p>
<p>Canadian journal of civil engineering 255 10.32 2.55 2.53 2.59 2.59 
</p>
<p>Canadian journal of microbiology 116 6.66 1.54 1.57 1.49 1.52 
</p>
<p>Canadian journal of physiology and 
pharmacology 
</p>
<p>125 6.48 1.72 1.55 1.59 1.64 
</p>
<p>Genome 70 7.02 1.57 1.58 1.63 1.67 
</p>
<p>MOYENNE - TOTAL 1130 8.13 2.12 2.05 2.06 2.07 
</p>
<p> 
</p>
<p>Tableau 7 &#8211; R&#233;sultats d&#233;taill&#233;s par revue et globaux </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Recherche contextuelle d&#8217;&#233;quivalents en banque de terminologie 
 
</p>
<p>Le tableau 7 montre les r&#233;sultats agglom&#233;r&#233;s sur l&#8217;ensemble des termes.   Les colonnes (de 
gauche &#224; droite) indiquent : la revue scientifique, le nombre de paires d&#8217;&#233;quivalents tir&#233;s de 
cette revue, le rang moyen o&#249; se trouverait le bon &#233;quivalent si on prenait cet &#233;quivalent au 
</p>
<p>hasard, et diff&#233;rents r&#233;sultats du rang obtenu par nos algorithmes en fonction d&#8217;avoir extrait 5, 
10, 15 ou 20 termes du contexte entourant le terme &#224; l&#8217;&#233;tude.  L&#8217;am&#233;lioration est tout de m&#234;me 
marquante avec un rang moyen de 8 pour un choix au hasard et un rang moyen d&#8217;environ 2 
pour un choix fait avec l&#8217;assignation automatique de domaine.  Notre m&#233;thode fait une 
r&#233;duction de 75% du rang moyen (position du bon &#233;quivalent en supposant un acc&#232;s lin&#233;aire). 
</p>
<p>Bien que nous ayons mentionn&#233; &#224; la section 3 une variation possible des r&#233;sultats en fonction 
</p>
<p>du nombre de termes extraits, le tableau 7 montre que ce n&#8217;est pas vraiment le cas.     
</p>
<p>5   Conclusions, discussion et travail futur 
</p>
<p>Le pr&#233;sent travail propose un algorithme en 2 &#233;tapes pour la recherche en base terminologique 
</p>
<p>d&#8217;&#233;quivalents pertinents &#224; des termes en contexte. Sur un ensemble de 1130 paires de termes 
&#233;quivalents, notre algorithme permet de r&#233;duire le rang moyen de l&#8217;&#233;quivalent pertinent de 
75%.  Par exemple, dans le cas d&#8217;un terme ayant 16 &#233;quivalents inscrits dans la banque de 
terminologie, le traducteur arriverait plus certainement au bon choix apr&#232;s avoir consult&#233; 2 
</p>
<p>&#233;quivalents possibles plut&#244;t que 8.   
</p>
<p>Bien que ce gain soit d&#233;j&#224; important, diverses pistes pourront &#234;tre explor&#233;es pour tenter 
</p>
<p>d&#8217;am&#233;liorer les r&#233;sultats obtenus. Par exemple, l&#8217;&#233;tendue du contexte pourrait &#234;tre modifi&#233;e 
pour en mesurer l&#8217;impact, soit prendre une seule phrase, 2 phrases, le r&#233;sum&#233; en entier, voire 
m&#234;me l&#8217;article complet comme contexte.  Nous pouvons d&#233;j&#224; anticiper que dans un contexte 
plus large, le choix de l&#8217;extracteur de termes et le nombre de termes extraits auront un plus 
grand impact.  Une m&#233;thode pond&#233;rant le poids des termes extraits en fonction de leur 
</p>
<p>distance au terme &#224; l&#8217;&#233;tude serait intuitivement une bonne approche, mais cela reste &#224; valider.   
</p>
<p>Plusieurs explorations seraient possibles pour la sous-t&#226;che de similarit&#233; des domaines.  Par 
</p>
<p>exemple, plut&#244;t que d&#8217;utiliser une mesure de recoupement des listes de termes &#224; l&#8217;int&#233;rieur du 
GDT, une utilisation de ressources externes, voire m&#234;me le WWW nous permettrait de (a) 
</p>
<p>&#233;tablir la similarit&#233; des domaines en fonction de leur information mutuelle tel que donn&#233;e par 
</p>
<p>leur PMI-IR (Turney 2001), ou (b) augmenter le nombre de termes faisant partie de chaque 
</p>
<p>domaine en utilisant des approches de types &#171; topic signatures &#187; (Agirre et al. 2001) qui 
</p>
<p>recherchent des termes reli&#233;s &#224; partir de d&#233;finitions (ou dans notre cas de termes connus), 
</p>
<p>permettant par la suite d&#8217;utiliser nos mesures de similarit&#233; de domaines caract&#233;ris&#233;s par de 
plus grands ensembles de termes. 
</p>
<p>Une limite de notre algorithme est de ne pouvoir diff&#233;rencier les &#233;quivalents provenant du 
</p>
<p>m&#234;me domaine. Il est possible que des notions rapproch&#233;es utilisent le m&#234;me terme dans une 
</p>
<p>langue mais soient diff&#233;renci&#233;es dans une autre langue.  Le terme stem est un excellent 
</p>
<p>exemple car il poss&#232;de 14 fiches dans le domaine de la botanique avec des &#233;quivalents vari&#233;s 
</p>
<p>en fran&#231;ais tels tige, perche, pied ou p&#233;doncule qui d&#233;pendent du type de plante ou fleur, ce 
</p>
<p>que l&#8217;anglais ne diff&#233;rencie pas.  L&#8217;&#233;tat pr&#233;sent de notre approche ne permet pas cette 
diff&#233;rentiation car elle repose enti&#232;rement sur l&#8217;assignation du domaine qui lui ici est unique, 
soit botanique.  Uniquement si la banque de terminologie incluait des d&#233;finitions serait-il alors 
</p>
<p>possible de d&#233;velopper de nouveaux algorithmes utilisant l&#8217;information provenant des 
d&#233;finitions pour les combiner &#224; nos algorithmes utilisant les domaines. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Barri&#232;re 
</p>
<p>Les algorithmes d&#233;velopp&#233;s ont l&#8217;avantage d&#8217;&#234;tre transportables &#224; d&#8217;autres banques de 
terminologie pour autant que celles-ci utilisent une cat&#233;gorisation par domaine, ce que nous 
</p>
<p>pouvons anticiper car cela est fondamental &#224; la structure d&#8217;une base terminologique. 
</p>
<p>Du point de vue applicatif, notre travail futur sera la cr&#233;ation d&#8217;une interface d&#8217;acc&#232;s &#224; une 
ressource terminologique qui pr&#233;sentera en ordre d&#233;croissant de pertinence les fiches 
</p>
<p>associ&#233;es &#224; un terme.  Cette interface pourra &#234;tre mise &#224; l&#8217;essai dans un contexte d&#8217;aide au 
traducteur pour la recherche d&#8217;&#233;quivalents appropri&#233;s &#224; des termes provenant de textes &#224; 
traduire. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>AGIRRE E., MARQUEZ L., WICENTOWSKI R. (2007) Proceedings of the 4th International 
</p>
<p>Workshop on Semantic Evaluations. 
</p>
<p>AGIRRE E., ANSA O., MARTINEZ, D., HOVY E. (2001) Enriching WordNet concepts with topic 
</p>
<p>signatures. WordNet and Other Lexical Resources Workshop, NAACL 2001. 
</p>
<p>BARRI&#200;RE, C. (2007). La d&#233;sambigu&#239;sation du sens en traitement automatique des langues : 
</p>
<p>l&#8217;apport des ressources terminologiques et lexicographiques, dans L&#8217;Homme M.-C. et 
Vandaele S. (eds), Lexicographie et Terminologie : Compatibilit&#233; des mod&#232;les et des 
</p>
<p>m&#233;thodes, 113-140. 
</p>
<p>GLIOZZO A., MAGNINI B., STRAPPARAVA C. (2004) Unsupervised Domain Relevance 
</p>
<p>Estimation for Word Sense Disambiguation, Proceedings of EMNLP 2004, D. Lin and D. Wu 
</p>
<p>(eds), Barcelona, Spain, pages 380-387, 2004. 
</p>
<p>LESK M. (1986) Automatic Sense Disambiguation Using Machine Readable Dictionaries: 
</p>
<p>How to Tell a Pine Cone from and Ice Cream Cone, ACM SIGDOC&#8217;86, The Fifth 
International Conference on Systems Documentation, Proceedings of ACM Press.  
</p>
<p>MAGNINI B., CAVAGLI&#192; G. (2000) Integrating subject field codes into WordNet. Proceedings 
</p>
<p>of LREC-2000, Second International Conference on Language Resources and Evaluation, 
</p>
<p>Athens, Greece, June 2000. 
</p>
<p>MIHALCEA R., EDMONDS P. (2004) Proceeding of Senseval-3: The third International 
</p>
<p>Workshop on the Evaluation of Systems for the Semantic Analysis of Text. 
</p>
<p>SEBASTIANI F. (2002) Machine learning in automated text categorization.  ACM Computing 
</p>
<p>Surveys, 34(1): 1-47, 2002. 
</p>
<p>SMADJA F. (1993) Retrieving collocations from text: Xtract. Computational Linguistics 7(4): 
</p>
<p>143-177. 
</p>
<p>SUAREZ A., PALOMAR M. (2006) Word Sense vs. Word Domain Disambiguation: A Maximum 
</p>
<p>Entropy approach, Proceedings of the Human Language Technology Conference of the North 
</p>
<p>American Chapter of the ACL, pages 141-144, New York, June 2006.  
</p>
<p>TURNEY P.D. (2001) Mining the Web for synonyms: PMI-IR versus LSA on TOEFL.  
</p>
<p>Proceedings of the Twelfth European Conference on Machine Learning (ECML-2001), 
</p>
<p>Freiburg, Germany, pp. 491-502. </p>

</div></div>
</body></html>