<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>MACAON Une cha&#238;ne linguistique pour le traitement de graphes de mots</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>MACAON
Une cha&#238;ne linguistique pour le traitement de graphes de mots
</p>
<p>Alexis Nasr Fr&#233;d&#233;ric B&#233;chet Jean-Fran&#231;ois Rey &#8727;
</p>
<p>Laboratoire d&#8217;Informatique Fondamentale de Marseille
Universit&#233; Aix-Marseille
</p>
<p>(alexis.nasr,frederic.bechet,jean-francois.rey)@lif.univ-mrs.fr
</p>
<p>1 Introduction
</p>
<p>MACAON est une cha&#238;ne de traitement linguistique s&#233;quentielle compos&#233;e de plusieurs modules r&#233;alisant
des traitements classiques (d&#233;coupage en mots, &#233;tiquetage morpho-syntaxique, lemmatisation, analyse
morphologique, analyse syntaxique partielle) sur une entr&#233;e textuelle native (produite par un &#234;tre humain)
ou sur des hypoth&#232;ses multiples de mots, produits automatiquement. MACAON est distribu&#233; sous licence
GPL et t&#233;l&#233;chargeable &#224; partir de l&#8217;adresse macaon.lif.univ-mrs.fr.
</p>
<p>D&#8217;un point de vue g&#233;n&#233;ral, un module MACAON peut &#234;tre vu comme un module d&#8217;annotation1 qui ajoute
&#224; son entr&#233;e un niveau d&#8217;annotation qui d&#233;pend g&#233;n&#233;ralement des annotations produites par les modules
pr&#233;c&#233;dents. Les diff&#233;rents modules communiquent entre eux par l&#8217;interm&#233;diaire de fichiers XML qui per-
mettent de repr&#233;senter les diff&#233;rents niveaux d&#8217;annotation. De plus, la cha&#238;ne permet de conserver la struc-
turation initiale XML des documents trait&#233;s (structuration logique d&#8217;un document, informations provenant
d&#8217;un syst&#232;me de dialogue . . .).
</p>
<p>Une des principales caract&#233;ristiques de MACAON est la prise en compte d&#8217;ambigu&#239;t&#233;s en entr&#233;e et en sortie
des diff&#233;rents modules. La majorit&#233; des modules de MACAON acceptent des entr&#233;es ambigu&#235;s (plusieurs
hypoth&#232;ses d&#8217;annotation) et produisent &#224; leur tour des sorties ambigu&#235;s, de mani&#232;re &#224; repousser le plus
tard possible la t&#226;che de d&#233;sambigu&#239;sation. La repr&#233;sentation compacte des structures ambigu&#235;s constitue
un des fondements du format d&#8217;&#233;change MACAON, d&#233;crit en 2. De plus, chaque module peut pond&#233;rer les
solutions qu&#8217;il construit et limiter l&#8217;ambigu&#239;t&#233; produite &#224; un nombre donn&#233; de solutions, d&#233;termin&#233; par
l&#8217;utilisateur.
</p>
<p>2 Le format d&#8217;&#233;change de donn&#233;es
</p>
<p>Le format d&#8217;&#233;change de donn&#233;es repose sur quatre concepts, celui de segment, d&#8217;attribut, de niveau et de
segmentation.
</p>
<p>&#8727;Ces travaux sont en partie financ&#233;s par les projets ANR Sequoia ANR-08-EMER-013 et DECODA 2009-CORD-005-01
1Nous regroupons sous le vocable annotation aussi bien des t&#226;ches d&#8217;&#233;tiquetage que de segmentation ou de construction
</p>
<p>d&#8217;objets plus complexes, tel que des arbres syntaxiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NASR, B&#201;CHET, REY
</p>
<p>Un segment est, comme son nom l&#8217;indique, un segment du texte ou du signal de parole &#224; traiter, tel qu&#8217;une
phrase, une proposition, un constituant syntaxique, une unit&#233; lexicale, une entit&#233; nomm&#233;e . . .Un segment
poss&#232;de des attributs qui permettent d&#8217;en d&#233;crire diff&#233;rents aspects. Un constituant syntaxique, par exem-
ple, d&#233;finira l&#8217;attribut type qui pr&#233;cisera le type du syntagme (constituant verbal, nominal . . .). Un segment
est compos&#233; d&#8217;un ou plusieurs segments plus simples.
</p>
<p>Une s&#233;quence de segments qui couvre l&#8217;integralit&#233; d&#8217;une phrase dans le cas de l&#8217;&#233;crit ou d&#8217;un tour de
parole dans le cas de l&#8217;oral, est appel&#233; segmentation. Cette derni&#232;re peut &#234;tre affect&#233; d&#8217;un poids.
</p>
<p>Un niveau d&#8217;analyse regroupe des segments d&#8217;une nature donn&#233;e, ainsi que des segmentations d&#233;finies sur
ces segments. Quatre niveaux sont distingu&#233;s pour le moment dans MACAON : le niveau pr&#233;-lexical, le
niveau lexical, le niveau morpho-syntaxique et le niveau syntaxique.
</p>
<p>Les diff&#233;rents segments sont li&#233;s entre eux par deux types de relations, la relation de pr&#233;c&#233;dence qui
organise les segments lin&#233;airement pour constituer des segmentations et la relation de dominance qui d&#233;crit
comment un segment se d&#233;compose en segments plus petits du m&#234;me niveau ou d&#8217;un niveau inf&#233;rieur.
</p>
<p>Nous avons repr&#233;sent&#233; ci-dessous, sous la forme d&#8217;un tableau, un exemple d&#8217;analyse en quatre niveaux
de quelques hypoth&#232;ses d&#8217;un graphe de parole qui pourraient &#234;tre produites sur l&#8217;entr&#233;e Jean mange une
pomme de terre. Le tableau permet de visualiser les quatre niveaux d&#8217;analyse, les segments (un segment par
case) ainsi que les relations de pr&#233;c&#233;dence (le segment pr&#233;-lexical Jean peut &#234;tre suivi du segment lange
ou du segment mange) et de dominance (le segment lexical pomme de terre domine les trois segments
pr&#233;-lexicaux pomme, de et terre).
</p>
<p>SV
syntaxique SN SN SP
</p>
<p>SN SN SN
v nc
</p>
<p>morpho- np nc det nc v
syntaxique prep nc
</p>
<p>mange pomme de terre
lexical Jean lange une tome d&#233;terre
</p>
<p>pomme de terre
lange tome d&#233;terre
</p>
<p>pr&#233;-lexical Jean mange une pomme de terre
</p>
<p>Cet exemple nous permet d&#8217;illuster les diff&#233;rents cas d&#8217;ambigu&#239;t&#233; pris en compte ainsi que leur mode de
repr&#233;sentation.
</p>
<p>Le cas d&#8217;ambigu&#239;t&#233; le plus imm&#233;diat est celui de l&#8217;ambigu&#239;t&#233; de segmentation : diff&#233;rentes segmentations
sont possibles &#224; chaque niveau. Cette ambigu&#239;t&#233; est repr&#233;sent&#233;e de mani&#232;re compacte en factorisant les
segments communs &#224; plusieurs segmentations sous la forme d&#8217;un automate fini.
</p>
<p>Le second cas d&#8217;ambigu&#239;t&#233; est celui de l&#8217;ambigu&#239;t&#233; de dominance, o&#249; un segment peut se d&#233;composer de
diff&#233;rentes fa&#231;ons en segments de niveau inf&#233;rieur. Un tel cas appara&#238;t dans l&#8217;exemple pr&#233;c&#233;dent, o&#249; le
nom commun (nc) du niveau morpho-syntaxique (repr&#233;sent&#233; en gras), domine les deux segments lexicaux
pomme et tomme.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MACAON
</p>
<p>Mise en &#339;uvre en XML
Comme nous l&#8217;avons annonc&#233; dans l&#8217;introduction, le format d&#8217;&#233;change MACAON est impl&#233;ment&#233; en
</p>
<p>XML. Un segment est repr&#233;sent&#233; par une balise &lt;segment&gt;. Cette derni&#232;re poss&#232;de quatre attributs obliga-
toires :
</p>
<p>&#8211; type indique le type du segment, quatre types de segments sont d&#233;finis pour l&#8217;instant :atome (unit&#233;
pr&#233;-lexicale), ulex (unit&#233; lexicale), cat (partie de discours) et chunk (groupe syntaxique non r&#233;cursif).
</p>
<p>&#8211; id permet d&#8217;attribuer au segment un identifiant unique au sein du document, afin de pouvoir y faire
r&#233;f&#233;rence.
</p>
<p>&#8211; start et end permettent de pr&#233;ciser le d&#233;but et la fin du segment. Il s&#8217;agit de valeurs num&#233;riques qui
peuvent faire r&#233;f&#233;rence &#224; la position du premier et du dernier caract&#232;res du segment dans la cha&#238;ne
textuelle ou au temps de d&#233;but et de fin du segment dans le signal de parole.
</p>
<p>Un segment peut poss&#233;der tout autre attribut jug&#233; utile pour un certain niveau de description. On trouve en
particulier souvent l&#8217;attribut stype qui permet d&#8217;affiner la valeur de l&#8217;attribut type. La relation de domi-
nance est repr&#233;sent&#233;e par l&#8217;ench&#226;ssement de balises XML. Illustrons cela sur l&#8217;exemple donn&#233; pr&#233;c&#233;dem-
ment, o&#249; l&#8217;unit&#233; lexicale pomme de terre regroupe les trois atomes pomme, de et terre, ayant respectivement
pour id les valeurs a1, a2 et a3, au sein d&#8217;une s&#233;quence de 3 &#233;l&#233;ments (dans une balise &lt;sequence&gt;).
</p>
<p>&lt;segment type=&#8221;ulex&#8221; id=&#8221;u1&#8221;&gt; &lt;sequence&gt; &lt;elt segref=&#8221;a1&#8221;/&gt; &lt;elt segref=&#8221;a2&#8221;/&gt;
</p>
<p>&lt;elt segref=&#8221;a3&#8221;/&gt; &lt;/sequence&gt; &lt;/segment&gt;
</p>
<p>Le cas pr&#233;c&#233;demment &#233;voqu&#233; o&#249; la partie de discours nc domine les deux unites lexicales pomme et tome,
ayant respectivement pour id u3 et u4, est repr&#233;sent&#233; par une disjonction de s&#233;quences &#224; l&#8217;int&#233;rieur d&#8217;un
segment :
</p>
<p>&lt;segment type=&#8221;cat&#8221; stype=&#8221;nc&#8221; id=&#8221;c1&#8221;&gt; &lt;sequence&gt; &lt;elt segref=&#8221;u3&#8221; w=&#8221;3.37&#8221;/&gt;
</p>
<p>&lt;/sequence&gt; &lt;sequence&gt; &lt;elt segref=&#8221;u4&#8221; w=&#8221;4.53&#8221;/&gt; &lt;/sequence&gt; &lt;/segment&gt;
</p>
<p>La relation de dominance est associ&#233;e &#224; un poids mat&#233;rialis&#233; par la balise w. Ce poids permet de repr&#233;senter
dans l&#8217;exemple pr&#233;c&#233;dent la probabilit&#233; d&#8217;une unit&#233; lexicale &#233;tant donn&#233; une cat&#233;gorie, telles qu&#8217;on les
trouve dans un &#233;tiqueteur morpho-syntaxique &#224; base de cha&#238;nes de Markov cach&#233;es.
</p>
<p>Comme nous l&#8217;avons d&#233;j&#224; mentionn&#233;, les segmentations sont repr&#233;sent&#233;es sous la forme d&#8217;automates finis
pond&#233;r&#233;s. Ces derniers sont repr&#233;sent&#233;s classiquement comme une s&#233;rie de transitions entre &#233;tats plus la
sp&#233;cification d&#8217;un &#233;tat intial et des &#233;tats d&#8217;acceptation, comme dans l&#8217;exemple ci-dessous :
</p>
<p>&lt;fsm n=&quot;9&quot;&gt; &lt;start n=&quot;0&quot;/&gt; &lt;accept n=&quot;6&quot;/&gt; &lt;ltrans&gt;
</p>
<p>&lt;trans o=&quot;0&quot; d=&quot;1&quot; i=&quot;a1&quot; w=&quot;7.23&quot;/&gt; &lt;trans o=&quot;1&quot; d=&quot;2&quot; i=&quot;a2&quot; w=&quot;9.00&quot;/&gt;
</p>
<p>&lt;trans o=&quot;1&quot; d=&quot;2&quot; i=&quot;a3&quot; w=&quot;3.78&quot;/&gt; &lt;trans o=&quot;2&quot; d=&quot;3&quot; i=&quot;a4&quot; w=&quot;7.37&quot;/&gt;
</p>
<p>&lt;trans o=&quot;3&quot; d=&quot;4&quot; i=&quot;a5&quot; w=&quot;3.73&quot;/&gt; &lt;trans o=&quot;3&quot; d=&quot;4&quot; i=&quot;a6&quot; w=&quot;6.67&quot;/&gt;
</p>
<p>&lt;trans o=&quot;4&quot; d=&quot;5&quot; i=&quot;a7&quot; w=&quot;4.56&quot;/&gt; &lt;trans o=&quot;5&quot; d=&quot;6&quot; i=&quot;a8&quot; w=&quot;2.63&quot;/&gt;
</p>
<p>&lt;trans o=&quot;4&quot; d=&quot;6&quot; i=&quot;a9&quot; w=&quot;7.63&quot;/&gt; &lt;/ltrans&gt; &lt;/fsm&gt;
</p>
<p>La balise &lt;trans/&gt; mat&#233;rialise une transition, les champs o,d,i et w repr&#233;sentent respectivement l&#8217;&#233;tat
d&#8217;origine de la transition, son &#233;tat destination, son &#233;tiquette (une r&#233;f&#233;rence &#224; un segment) et un poids.
</p>
<p>Finalement, un niveau d&#8217;analyse est mat&#233;rialis&#233; par la balise &lt;section&gt; qui comporte une balise &lt;segments&gt;
qui regroupe tous les segments correpondant &#224; ce niveau d&#8217;analyse et une balise &lt;fsm&gt; qui repr&#233;sente
l&#8217;ensemble des segmentations.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NASR, B&#201;CHET, REY
</p>
<p>3 Les modules
</p>
<p>Diff&#233;rents modules standard ont &#233;t&#233; d&#233;velopp&#233;s dans le cadre de MACAON, ils sont bri&#232;vement decrits ci-
dessous. Tous les modules partagent un certain nombre de caract&#233;ristiques : ils v&#233;rifient tous, bien entendu,
le format d&#8217;&#233;change d&#233;crit ci-dessus. Ils laissent tous, sous la forme d&#8217;une balise &lt;maca_stamp&gt; une
trace de leur passage dans le fichier trait&#233; et reconnaissent un jeu d&#8217;options standard.
</p>
<p>maca_select est un module de pr&#233;-traitement, il parcours un fichier XML et ins&#232;re des balises &lt;macaon&gt;
sous les balises sp&#233;cifi&#233;es par l&#8217;utilisateur. Les modules suivants ne traiteront que les parties textuelles
comprises dans des balises &lt;macaon&gt;.
</p>
<p>maca_segmenter r&#233;alise la segmentation du texte en phrases en fonction du contexte dans lequel se trouve
un signe de ponctuation.
</p>
<p>maca_tokenizer r&#233;alise le d&#233;coupage d&#8217;une phrase en unit&#233;s pr&#233;-lexicales. Il repose sur une grammaire
r&#233;guli&#232;re qui d&#233;finit un ensemble de types d&#8217;atomes. Un analyseur lexical d&#233;tecte les s&#233;quences de
caract&#232;res (en fonction de la grammaire) et leur associe un type.
</p>
<p>maca_lexer permet le regroupement d&#8217;unit&#233;s pr&#233;-lexicales en unit&#233;s lexicales. Il repose sur le Lexique
des Formes Fl&#233;chies du Fran&#231;ais (lefff : http ://atoll.inria.fr/&#732;sagot/lefff.html). Il impl&#233;mente un al-
gorithme de programmation dynamique qui construit toutes les segmentations possibles en unit&#233;s
lexicales.
</p>
<p>maca_tagger associe &#224; toute unit&#233; lexicale une ou plusieurs parties de discours. Il repose sur une cha&#238;ne
de Markov cach&#233;e impl&#233;mentant un mod&#232;le trigramme entrain&#233; sur le corpus French Treebank
(http ://www.llf.cnrs.fr/Gens/Abeille/French-Treebank-fr.php).
</p>
<p>maca_anamorph r&#233;alise l&#8217;analyse morphologique d&#8217;unit&#233;s lexicales associ&#233;es &#224; une cat&#233;gorie morpho-
syntaxique. Les informations morphologiques proviennent du lefff.
</p>
<p>maca_chunker regroupe des s&#233;quences de parties de discours en unit&#233;s syntaxiques non r&#233;cursives.
maca_conv permet de convertir au format MACAON des graphes de mots produits par des syst&#232;mes de
</p>
<p>transcription automatiques repr&#233;sent&#233;s au format HTK (htk.eng.cam.ac.uk ) ou
FSM (www2.research.att.com/&#732;fsmtools/fsm).
</p>
<p>maca2txt permet une visualisation d&#8217;un fichier MACAON, au format textuel.
maca_view est une interface graphique permettant de visualiser des fichiers MACAON et de lancer la
</p>
<p>cha&#238;ne de traitement sur un fichier.
</p>
<p>4 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; dans cet article la cha&#238;ne de traitement MACAON qui permet de traiter aussi bien
du texte natif que des hypoth&#232;ses lexicales multiples produites automatiquement. Plusieurs &#233;volutions de
MACAON sont en cours, tel que l&#8217;ajout de nouveaux modules (analyse syntaxique partielle en d&#233;pendance,
d&#233;tecteur d&#8217;entit&#233; nomm&#233;es) et l&#8217;&#233;volution du format d&#8217;&#233;change afin de repr&#233;senter des segments non
contigus.</p>

</div></div>
</body></html>