<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Pr&#233;sentation du logiciel Antidote HD</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
 
</p>
<p>  Pr&#233;sentation du logiciel Antidote HD 
</p>
<p>&#201;ric BRUNELLE et Simon CHAREST 
</p>
<p>Druide informatique inc. 
1435, rue St-Alexandre, bureau 1040 
Montr&#233;al (Qu&#233;bec) H3A 2G4, Canada 
developpement@druide.com 
</p>
<p>Antidote HD est la septi&#232;me &#233;dition d&#8217;Antidote, un logiciel d&#8217;aide &#224; la r&#233;daction d&#233;velopp&#233; et 
commercialis&#233; par la soci&#233;t&#233; Druide informatique. Antidote HD comporte un correcteur 
grammatical avanc&#233;, douze dictionnaires de consultation et onze guides linguistiques. Il 
fonctionne sous les syst&#232;mes d&#8217;exploitation Windows, Mac OS X et Linux. 
</p>
<p>1 Correcteur 
</p>
<p> 
Figure 1 : le correcteur d&#8217;Antidote HD affiche le texte corrig&#233;, la liste des d&#233;tections et une s&#233;rie de filtres (la 
</p>
<p>bulle affich&#233;e ici d&#233;crit une erreur rep&#233;r&#233;e par r&#233;solution d&#8217;une anaphore interphrastique). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;ric Brunelle et Simon Charest 
</p>
<p>Fond&#233; sur un analyseur en d&#233;pendances, le correcteur d&#8217;Antidote transforme les r&#233;sultats de 
son analyse en diagnostics utilisables par le grand public. Il sugg&#232;re des corrections 
d&#8217;orthographe, de syntaxe, de grammaire, de style et plusieurs autres. Il propose en outre 
plusieurs dizaines de filtres de correction originaux, couvrant des aspects comme les 
r&#233;p&#233;titions, les entit&#233;s nomm&#233;es et les charni&#232;res logiques. L&#8217;&#233;dition HD apporte la correction 
d&#8217;erreurs d&#8217;accord bas&#233;e sur la r&#233;solution d&#8217;anaphores intraphrastiques et interphrastiques, 
ainsi qu&#8217;un filtre statistique des d&#233;tections appuy&#233; sur plusieurs classificateurs automatiques. 
</p>
<p>2 Dictionnaires 
Antidote HD r&#233;unit douze dictionnaires du fran&#231;ais en une interface unifi&#233;e. Des d&#233;finitions 
aux synonymes, des cooccurrences &#224; l&#8217;historique, les dictionnaires d&#8217;Antidote offrent une 
r&#233;f&#233;rence lexicale d&#8217;une richesse, d&#8217;une vari&#233;t&#233; et d&#8217;une coh&#233;sion fort int&#233;ressantes, dont une 
grande partie a &#233;t&#233; collig&#233;e automatiquement par des techniques de TAL. 
</p>
<p> 
</p>
<p>Figure 2 : le dictionnaire de cooccurrences d&#8217;Antidote HD compte 900 000 entr&#233;es, y compris des 
cooccurrences de plus de deux mots, illustr&#233;es par plus de 2 millions de phrases exemples. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Pr&#233;sentation du logiciel Antidote HD 
</p>
<p>Le dictionnaire de cooccurrences a &#233;t&#233; enti&#232;rement refait pour l&#8217;&#233;dition HD &#224; partir d&#8217;un 
corpus quatre fois plus vaste qu&#8217;auparavant (1,8 milliard de mots). Fait in&#233;dit, il traite 
d&#233;sormais les cooccurrences de plus de deux mots, comme passer la nuit &#224; la belle &#233;toile. 
L&#8217;analyseur syntaxique d&#8217;Antidote a extrait du corpus plus d&#8217;un milliard de combinaisons de 
mots li&#233;s par diverses relations syntaxiques. Les cooccurrences les plus significatives ont &#233;t&#233; 
d&#233;gag&#233;es &#224; l&#8217;aide d&#8217;un filtre statistique et d&#8217;une r&#233;vision manuelle. Des exemples de chaque 
cooccurrence ont aussi &#233;t&#233; s&#233;lectionn&#233;s automatiquement et r&#233;vis&#233;s manuellement. Le r&#233;sultat 
est un dictionnaire de 900 000 cooccurrences illustr&#233;es par plus de 2 millions d&#8217;exemples. 
</p>
<p>Antidote HD ajoute en outre un dictionnaire historique qui recense l&#8217;&#233;tymologie de 90 000 
mots et affiche une repr&#233;sentation chronologique de l&#8217;&#233;volution graphique des mots &#224; travers 
les si&#232;cles. Cette repr&#233;sentation chronologique a &#233;t&#233; constitu&#233;e par l&#8217;analyse syntaxique 
automatique d&#8217;un corpus de textes historiques suivie d&#8217;une r&#233;vision manuelle. 
</p>
<p> 
Figure 3 : le dictionnaire historique pr&#233;sente l&#8217;&#233;tymologie d&#233;taill&#233;e de 90 000 mots, ainsi qu&#8217;une repr&#233;sentation 
</p>
<p>de l&#8217;&#233;volution graphique des mots appuy&#233;e par plus de 200 000 sources historiques. 
</p>
<p> 
 </p>

</div></div>
</body></html>