<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitement des inconnus : une approche syst&#233;matique de l&#8217;incompl&#233;tude lexicale</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TRAITEMENT DES INCONNUS : UNE APPROCHE SYSTEMATIQUE DE L&#8217;INCOMPLETUDE LEXICALE 
</p>
<p>Traitement des inconnus :  
</p>
<p>une approche syst&#233;matique de l&#8217;incompl&#233;tude lexicale 
</p>
<p>Helena Blancafort
1,2
</p>
<p>, Ga&#235;lle Recourc&#233;
3
, Javier Couto
</p>
<p>1
, 
</p>
<p>Beno&#238;t Sagot
3
, Rosa Stern
</p>
<p>3,4
, Denis Teyssou
</p>
<p>4
 
</p>
<p>(1)  Syllabs, 15, rue Jean-Baptiste Berlier, 75013 Paris, France 
(2) Universitat Pompeu Fabra, Roc Boronat, 08013 Barcelona, Espagne 
</p>
<p>(3) Alpage, INRIA Paris&#8211;Rocquencourt &amp; Universit&#233; Paris 7, Rocquencourt, BP 105, 
78153 Le Chesnay Cedex, France 
</p>
<p>(4)  Agence France-Presse &#8211; Medialab, 2 place de la Bourse, 75002 Paris, France 
</p>
<p>R&#233;sum&#233; Cet article aborde le ph&#233;nom&#232;ne de l&#8217;incompl&#233;tude des ressources lexicales, c&#8217;est-&#224;-dire la 
probl&#233;matique des inconnus, dans un contexte de traitement automatique. Nous proposons tout d&#8217;abord 
une d&#233;finition op&#233;rationnelle de la notion d&#8217;inconnu. Nous d&#233;crivons ensuite une typologie des diff&#233;rentes 
classes d&#8217;inconnus, motiv&#233;e par des consid&#233;rations linguistiques et applicatives ainsi que par l&#8217;annotation 
des inconnus d&#8217;un petit corpus selon notre typologie. Cette typologie sera mise en &#339;uvre et valid&#233;e par 
l&#8217;annotation d&#8217;un corpus important de l&#8217;Agence France-Presse dans le cadre du projet EDyLex. 
</p>
<p>Abstract This paper addresses the incompleteness of lexical resources, i.e., the problem of unknown 
words, in the context of natural language processing. First, we put forward an operational definition of the 
</p>
<p>notion of unknown words. Next, we describe a typology of the various classes of unknown words, 
</p>
<p>motivated by linguistic and applicative considerations as well as the annotation of unknown words in a 
</p>
<p>small-scale corpus w.r.t. our typology. This typology shall be applied and validated through the annotation 
</p>
<p>of a large corpus from the Agence France-Presse as part of the EDyLex project. 
</p>
<p>Mots-cl&#233;s : mots inconnus, incompl&#233;tude lexicale, acquisition dynamique des ressources lexicales 
</p>
<p>Keywords: unknown words, lexical incompleteness, dynamic acquisition of lexical information 
</p>
<p>1 Introduction 
</p>
<p>L&#8217;enrichissement des ressources lexicales n&#233;cessaires aux applications de traitement automatique du 
langage est une t&#226;che souvent longue, fastidieuse et co&#251;teuse. L&#8217;exhaustivit&#233; de ces ressources est par 
ailleurs un objectif complexe &#224; atteindre. Le projet EDyLex
</p>
<p>1
 cherche &#224; proposer des solutions &#224; la 
</p>
<p>probl&#233;matique de l&#8217;incompl&#233;tude des ressources lexicales et de l&#8217;automatisation de leur enrichissement. 
Dans cette perspective, de premiers travaux se concentrent sur l&#8217;identification des causes de cette 
incompl&#233;tude. Un certain nombre de formes rencontr&#233;es dans les contenus &#224; analyser sont en effet 
</p>
<p>qualifiables d&#8217;inconnus en regard des ressources lexicales en jeu : ces formes ne correspondent &#224; aucune 
entr&#233;e dans le lexique, ou sont inanalysables par les modules d&#8217;analyse morphosyntaxique utilis&#233;s.  
</p>
<p>                                                 
1
  Enrichissement Dynamique de ressources Lexicales multilingues en contexte multimodal. Site internet du projet : 
</p>
<p>http://sites.google.com/site/projetedylex/. Ce projet (2009-2012) a &#233;t&#233; financ&#233; par l&#8217;ANR (ANR-09-CORD-008). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HELENA BLANCAFORT, GA&#203;LLE RECOURC&#201;, JAVIER COUTO, BENO&#206;T SAGOT, ROSA STERN, DENIS TEYSSOU 
</p>
<p>Un certain nombre d&#8217;&#233;tudes, pr&#233;sent&#233;es &#224; la section 2, ont &#233;t&#233; consacr&#233;es au probl&#232;me des inconnus. La 
particularit&#233; de notre approche &#233;tant l&#8217;exploitation d&#8217;une telle &#233;tude &#224; des fins de traitement automatique, 
nous proposons une d&#233;finition op&#233;rationnelle de la notion d&#8217;inconnu (section 3). La typologie d&#233;crite &#224; la 
section 4 &#233;tablit un cadre permettant de classer les inconnus d&#8217;un corpus donn&#233;, afin d&#8217;en proposer des 
traitements adapt&#233;s. La section 5 expose les modalit&#233;s de l&#8217;annotation, selon cette typologie, des inconnus 
d&#8217;un corpus de d&#233;p&#234;ches de l&#8217;Agence France-Presse, t&#226;che valid&#233;e lors d&#8217;une premi&#232;re exp&#233;rience &#224; petite 
&#233;chelle.  
</p>
<p>2 Travaux ant&#233;rieurs 
</p>
<p>Diff&#233;rents axes de recherche traitent de la probl&#233;matique des inconnus : les &#233;tudes linguistiques sur la 
</p>
<p>n&#233;ologie, d&#8217;une part, analysent les pratiques lexicographiques prenant en compte ce probl&#232;me ; la 
linguistique de corpus, d&#8217;autre part, propose une description de ce ph&#233;nom&#232;ne &#224; partir de donn&#233;es (corpus 
et lexiques) particuli&#232;res (Cartoni, 2006 ; Dister et Fairon, 2004 ; Maurel, 2004, Ren et Perrault, 1992) afin 
</p>
<p>d&#8217;en obtenir une typologie. Enfin, un certain nombre de travaux apportent des solutions de traitement 
automatique des inconnus (Nakov et al., 2003 ; Schone et Jurafsky, 2001 ; Mikheev, 1997). 
</p>
<p>Les travaux de linguistique de corpus (Cartoni, 2006 ; Dister et Fayron, 2004 ; Maurel, 2004, Ren et 
</p>
<p>Perrault, 1992) pr&#233;sentent pour le fran&#231;ais une classification des mots non reconnus par un lexique de 
</p>
<p>r&#233;f&#233;rence d&#233;termin&#233; et un corpus pr&#233;cis, souvent journalistique. Ces auteurs traitent souvent des mots 
</p>
<p>inconnus, d&#233;finis comme les unit&#233;s lexicales qui ne sont pas r&#233;pertori&#233;es dans le lexique utilis&#233; (Dister et 
</p>
<p>Fairon 2004). L&#8217;objet d&#8217;analyse est donc ici le mot : toute autre unit&#233; typographique pr&#233;sente dans un 
corpus est ignor&#233;e. Cartoni (2008) donne une d&#233;finition plus fine en pr&#233;cisant qu&#8217;un inconnu est une &#171; suite 
de caract&#232;res qui correspond &#224; la notion graphique d&#8217;unit&#233; lexicale &#187; et qui est absente du lexique de 
r&#233;f&#233;rence. Il souligne &#233;galement que l&#8217;on trouve parmi eux un nombre important d&#8217;hapax. Mais la question 
de savoir si un inconnu est n&#233;cessairement un mot simple ou si l&#8217;on peut parler de compos&#233;s inconnus reste 
ouverte dans la litt&#233;rature. Seuls Jonasson et Maurel (2004) d&#233;finissent les mots inconnus comme des mots 
</p>
<p>simples par opposition aux noms propres qui sont souvent des mots compos&#233;s. Par ailleurs, tous ces 
</p>
<p>auteurs soulignent les limites de la notion de lexique de r&#233;f&#233;rence, un lexique n&#8217;&#233;tant jamais une ressource 
exhaustive, et consid&#232;rent que la cl&#233; pour aborder les mots inconnus est de traiter la cr&#233;ativit&#233; lexicale en 
</p>
<p>tant que telle. Ainsi, pour le fran&#231;ais, Maurel (2004) explique que 40% des inconnus &#233;tudi&#233;s correspondent 
</p>
<p>&#224; des cr&#233;ations lexicales, tandis que Ren et Perrault (1992) pr&#233;cisent que 30% des inconnus sont des 
</p>
<p>d&#233;riv&#233;s. Les r&#233;sultats sont diff&#233;rents sur d&#8217;autres langues. Ainsi, en allemand, la plupart des mots inconnus 
sont des compos&#233;s ad hoc s&#233;mantiquement transparents, formant une unit&#233; typographique unique qui n&#8217;a 
pas &#224; &#233;t&#233; ajout&#233;e au lexique (Geyken, 2009). En chinois, l&#8217;enjeu principal est celui de la segmentation. 
Ainsi, une mauvaise segmentation des inconnus est responsable de 60% des erreurs de segmentation en 
</p>
<p>mots (Wong et al., 2009). Cela dit, la composition est aussi tr&#232;s productive en chinois (Tseng et al., 2005).  
</p>
<p>Concernant les travaux linguistiques sur la n&#233;ologie, on peut citer Sablayrolles (1997 ; 2002), qui illustre 
</p>
<p>bien la difficult&#233; du domaine : bien qu&#8217;il y ait un consensus au niveau de la d&#233;finition de la notion de 
n&#233;ologisme, on observe un d&#233;saccord d&#232;s lors qu&#8217;il s&#8217;agit de les cat&#233;goriser. Sablayrolles a compar&#233; plus 
de 100 typologies des n&#233;ologismes, montrant ainsi la difficult&#233; de la classification de ceux-ci, et m&#234;me de 
</p>
<p>d&#233;finir ce qui est un n&#233;ologisme et ce qui n&#8217;en est pas un. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TRAITEMENT DES INCONNUS : UNE APPROCHE SYSTEMATIQUE DE L&#8217;INCOMPLETUDE LEXICALE 
</p>
<p>3 Qu&#8217;est-ce qu&#8217;un inconnu ? 
</p>
<p>Comme le montre la probl&#233;matique des inconnus compos&#233;s &#233;voqu&#233;e &#224; la section pr&#233;c&#233;dente, la question de 
</p>
<p>la nature m&#234;me de ce que l&#8217;on consid&#232;re comme connu ou inconnu fait d&#233;bat. Avant de prendre position 
sur ce point, il est important de poser deux d&#233;finitions. En coh&#233;rence avec la norme ISO MAF (de la 
</p>
<p>Clergerie et Cl&#233;ment, 2005) et de nombreux travaux (Vilnat et al., 2008), nous d&#233;finissons comme suit les 
</p>
<p>notions de token et de forme. Un token est une unit&#233; typographique constitu&#233;e d&#8217;un caract&#232;re de 
ponctuation ou d&#8217;une s&#233;quence de caract&#232;res (sauf l&#8217;espace) d&#233;limit&#233;e par des espaces et/ou des caract&#232;res 
de ponctuation
</p>
<p>2
.. Ainsi, &#171; gratin aux pommes&#187; contient trois tokens. Par contraste, une forme (en anglais 
</p>
<p>wordform) est une unit&#233; lexicale susceptible de constituer une entr&#233;e dans le lexique de r&#233;f&#233;rence. La 
</p>
<p>correspondance entre tokens et formes n&#8217;est pas bijective : le token &#171; aux &#187; correspond aux deux formes &#224; 
et les, alors que les trois tokens &#171; pomme de terre &#187; correspondent (ici) &#224; une seule forme (compos&#233;e). 
</p>
<p>Notre d&#233;finition de token inconnu repose sur un lexique de r&#233;f&#233;rence et une cha&#238;ne de traitement 
</p>
<p>particuli&#232;re : il s&#8217;agit d&#8217;un token qui n&#8217;appartient pas au lexique et qui ne fait pas partie d&#8217;une s&#233;quence 
consid&#233;r&#233;e comme productive dans les ressources utilis&#233;es dans la cha&#238;ne de traitement (par exemple, une 
</p>
<p>entit&#233; nomm&#233;e). De ce fait, l&#8217;absence d&#8217;un module de reconnaissance des noms de personnes ou une erreur 
dans un tel module peut conduire &#224; rendre inconnu un token faisant partie d&#8217;une entit&#233; nomm&#233;e. 
</p>
<p>4 Proposition de typologie des inconnus 
</p>
<p>Afin de construire notre typologie des inconnus, nous avons &#233;tudi&#233; dans un corpus de d&#233;p&#234;ches de 
</p>
<p>l&#8217;Agence France Presse, en fran&#231;ais, anglais et espagnol3, les diff&#233;rents types de tokens inconnus. On 
observe les grandes distinctions suivantes (du plus fr&#233;quent au plus marginal) : 
</p>
<p>- Certains tokens facilement analysables, qui rel&#232;vent de la cr&#233;ation lexicale productive. 
</p>
<p>- Certains tokens difficilement d&#233;composables comme une forme lexicalis&#233;e (cupboard en anglais). 
</p>
<p>- Certains tokens inconnus font partie de s&#233;quences productives et auraient pu ou d&#251; &#234;tre analys&#233;s 
comme tels par un analyseur, comme une date ou un &#171; cybertoken &#187; (posts Twitter : #FT, ou 
</p>
<p>m@il), ou d&#8217;autres types de s&#233;quences productives. 
</p>
<p>- Certains tokens sont inconnus parce qu'erron&#233;s : des erreurs du scripteur (fautes, typo&#8230;) ou des 
erreurs de la cha&#238;ne de traitement (mauvais&#8230;).  
</p>
<p>La figure 1 illustre la typologie, les grands n&#339;uds repr&#233;sentent les cat&#233;gories principales d&#233;crites ci-apr&#232;s.  
</p>
<p>1. Entit&#233; nomm&#233;e : Les tokens faisant partie d&#8217;entit&#233;s nomm&#233;es forment une cat&#233;gorie de s&#233;quences 
productives tr&#232;s repr&#233;sent&#233;e, probablement majoritaire dans les corpus journalistiques. De nombreux 
</p>
<p>inconnus r&#233;sultent de l&#8217;absence ou de l&#8217;imperfection du module de reconnaissance des EN dans la 
cha&#238;ne de traitement. Pour annoter ces inconnus, nous diff&#233;rencions les EN simples et les EN 
</p>
<p>complexes, et donc les tokens faisant partie d&#8217;une EN complexe. Par exemple, si la cha&#238;ne de 
traitement n&#8217;a pas reconnu La Rochelle, une double annotation est appliqu&#233;e. &#171; Rochelle &#187; est d&#8217;abord 
annot&#233;e comme &#233;l&#233;ment d&#8217;une EN complexe, puis &#171; La Rochelle &#187; est annot&#233; comme EN. Par ailleurs, 
une sous-cat&#233;gorie &#171; abr&#233;viation &#187; est d&#233;di&#233;e aux sigles et acronymes et aux troncations (Sarko).  
</p>
<p>                                                 
2
 Sauf lorsque l&#8217;on consid&#232;re qu&#8217;ils ne servent pas &#224; la ponctuation, comme les points dans les URL. 
</p>
<p>3
 Il s&#8217;agit d&#8217;un corpus constitu&#233; dans le cadre du projet EDyLex mentionn&#233; auparavant. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HELENA BLANCAFORT, GA&#203;LLE RECOURC&#201;, JAVIER COUTO, BENO&#206;T SAGOT, ROSA STERN, DENIS TEYSSOU 
</p>
<p>2. Cr&#233;ation lexicale productive : Nous proposons la sous-classification suivante qui comprend trois 
classes principales cit&#233;es dans la litt&#233;rature (Ren et Perrault, 1992 ; Morel, 2004 ; Dister et Fairon, 
</p>
<p>2004 ; Cartoni, 2008) et plusieurs autres classes ajout&#233;es suite &#224; l'observation de divers corpus, comme 
</p>
<p>les n&#233;ographies. Cette classe regroupe des tokens issus de la cr&#233;ativit&#233; lexicale, des processus 
</p>
<p>morphologiques de cr&#233;ation des mots et peut &#234;tre subdivis&#233;e en sous-cat&#233;gories en fonction du type de 
</p>
<p>construction. Nous avons int&#233;gr&#233; la notion de &#171; transparent &#187; pour limiter cette cat&#233;gorie aux formes 
</p>
<p>r&#233;guli&#232;res et facilement analysables par un des proc&#233;d&#233;s cit&#233;s ci-dessous. 
</p>
<p>- Constructions d&#233;riv&#233;es par suffixation ou pr&#233;fixation (relire, tartinabilit&#233;), formes flexionnelles 
non conventionnelles comme la forme &#171; pleuvent &#187;, f&#233;minisations des noms comme &#171; professeure &#187; 
</p>
<p>mentionn&#233;es par Dister et Fairon (2004). 
</p>
<p>- Constructions ad hoc (52&#232;me, bleu-vert, internet-based en anglais) : ces tokens sont fr&#233;quemment 
construits en contexte. Leur caract&#232;re &#171; inconnu &#187; d&#233;pend fortement de la cha&#238;ne de traitement 
</p>
<p>utilis&#233;e. Ces &#233;l&#233;ments sont a priori exclus de l'enrichissement du lexique et rel&#232;vent de 
</p>
<p>l'enrichissement du module de segmentation. 
</p>
<p>- Constructions par composition (porte-b&#233;b&#233;, microclimat) dont une partie significative correspond &#224; 
des termes scientifiques. 
</p>
<p>- Constructions abr&#233;g&#233;es : abr&#233;viations, sigles et acronymes, troncations, n&#233;ographies (&#224;+, 4x4). 
</p>
<p>3. Forme non productive ou lexicalis&#233;e : Il s&#8217;agit des tokens correspondant &#224; des formes lexicalis&#233;es 
non transparentes et qu&#8217;il est difficile d&#8217;analyser par un des proc&#233;d&#233;s r&#233;pertori&#233;s ci-dessus. Cette 
cat&#233;gorie peut inclure des r&#233;gionalismes, des termes, ainsi que des mots argotiques, mais &#233;galement des 
</p>
<p>lacunes du lexique. Nous n&#8217;avons pas cr&#233;&#233; ces sous-cat&#233;gories explicites, car leurs fronti&#232;res nous 
semblent floues et li&#233;es &#224; des consid&#233;rations subjectives, comme l'origine sociale ou g&#233;ographique.  
</p>
<p>4. Variante graphique : Cette cat&#233;gorie contient les tokens qui sont une variante de graphie d&#8217;une forme 
connue du lexique. &#192; la diff&#233;rence de la cat&#233;gorie 5, il s&#8217;agit ici de graphies correctes. La variante peut 
&#234;tre justifi&#233;e par une r&#233;forme de l&#8217;orthographe (surement), par l&#8217;usage (cl&#233; vs. clef) ou par une variante 
g&#233;ographique (color en anglais am&#233;ricain). 
</p>
<p>FIG. 1 &#8211; Vue g&#233;n&#233;rale de la typologie des inconnus. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TRAITEMENT DES INCONNUS : UNE APPROCHE SYSTEMATIQUE DE L&#8217;INCOMPLETUDE LEXICALE 
</p>
<p>5. Erreur : Fautes d&#8217;orthographe et coquilles, erreurs du document (format ou encodage) et erreurs de la 
cha&#238;ne de traitement, en particulier les erreurs d&#8217;analyse de certains tokens qui en font des inconnus. 
</p>
<p>6. Emprunt : Tokens correspondant &#224; des formes &#233;trang&#232;res import&#233;es et utilis&#233;es dans la langue du texte 
de fa&#231;on similaire aux autres formes (cf. le mot anglais tagger). Lorsque la forme a subi une 
</p>
<p>modification pour &#234;tre int&#233;gr&#233;e dans la langue du document, les tokens correspondants appartiennent &#224; 
</p>
<p>la sous-cat&#233;gorie &#171; emprunt adapt&#233; &#187; (cf. taggu&#233;). 
</p>
<p>7. Token en langue &#233;trang&#232;re : C&#8217;est le cas des tokens en langue &#233;trang&#232;re mais non int&#233;gr&#233;s &#224; la langue 
(ce ne sont donc pas des emprunts). 
</p>
<p>8. Composant non autonome : Tokens pouvant exister comme partie d&#8217;une forme (simple ou complexe) 
mais qui ne constituent pas une forme &#224; eux seuls. C&#8217;est le cas d&#8217;un token comme &#171; priori &#187; s&#8217;il n&#8217;est 
pas reconnu comme faisant partie de la forme a priori.  
</p>
<p>9. Token num&#233;rique ou alphanum&#233;rique : Unit&#233;s compos&#233;es de chiffres ou de chiffres et de lettres, 
normalement non r&#233;pertori&#233;es dans un lexique, et lorsqu&#8217;elles ne sont pas reconnues en tant que 
s&#233;quences productives ; il peut s&#8217;agir par exemple de nombres (25 000), de mesures (7cm), etc. 
</p>
<p>10. Cybertoken : Cha&#238;ne li&#233;e aux nouvelles technologies de la communication, comme une URL ou une 
adresse &#233;lectronique. 
</p>
<p>11. Token inclassable : Token ne rentrant pas dans une des cat&#233;gories ci-dessus ; cette cat&#233;gorie pourra 
&#234;tre &#233;tendue au fil de l'annotation. 
</p>
<p>5 Annotation des inconnus en corpus et travaux futurs 
</p>
<p>L&#8217;ad&#233;quation de la typologie propos&#233;e &#224; la section 4 au probl&#232;me de l&#8217;incompl&#233;tude des ressources 
lexicales doit &#234;tre confront&#233;e &#224; des donn&#233;es constitu&#233;es en corpus, afin de mieux identifier les contours 
</p>
<p>qualitatifs et quantitatifs des inconnus. Une annotation &#224; &#233;chelle tr&#232;s r&#233;duite a &#233;t&#233; men&#233;e dans un premier 
</p>
<p>temps afin de v&#233;rifier la coh&#233;rence et la pertinence g&#233;n&#233;rale de la typologie face aux donn&#233;es. Conduite sur 
</p>
<p>le fran&#231;ais et l&#8217;anglais (deux documents d&#8217;environ 5000 mots chacun) par trois annotateurs, cette 
exp&#233;rience a permis d&#8216;introduire des modifications qui se sont av&#233;r&#233;es n&#233;cessaires durant l&#8217;annotation 
(notamment la prise en compte des NP simples vs complexes) et de valider la typologie comme guide pour 
</p>
<p>une exp&#233;rience &#224; plus grande &#233;chelle : l&#8217;annotation d&#8217;un corpus de d&#233;p&#234;ches de l&#8217;Agence France Presse, en 
fran&#231;ais, anglais et espagnol. Une centaine de d&#233;p&#234;ches pour chaque langue et align&#233;es pour former un 
</p>
<p>corpus parall&#232;le, afin de b&#233;n&#233;ficier d&#8217;une comparaison inter-langues utile pour l&#8217;adaptation ult&#233;rieure des 
outils &#224; am&#233;liorer. Ce corpus sera ensuite soumis &#224; un traitement automatique &#224; l&#8217;aide des ressources 
lexicales et des outils d&#8217;analyse utilis&#233;s dans le cadre du projet EDyLex : la cha&#238;ne d&#8217;analyse de surface 
SXPipe param&#233;tr&#233;e pour chaque langue et bas&#233;e sur les lexiques morphosyntaxiques Lefff pour le fran&#231;ais, 
</p>
<p>Leffe pour l&#8217;espagnol et EnLex pour l&#8217;anglais4. Le r&#233;sultat permettra l&#8217;identification des tokens, tels que 
d&#233;finis &#224; la section 3, qui demeurent inconnus pour les ressources de r&#233;f&#233;rence, gr&#226;ce &#224; l&#8217;attribution de la 
cat&#233;gorie ad&#233;quate fournie par la typologie. Cette exp&#233;rience doit &#233;galement servir &#224; identifier d&#8217;&#233;ventuels 
cas d&#8217;inconnus non pr&#233;vus par la typologie afin d&#8217;am&#233;liorer sa couverture et sa pertinence en termes de 
description du ph&#233;nom&#232;ne. Dans un souci de v&#233;rification de la coh&#233;rence de la typologie au cours de 
</p>
<p>l&#8217;annotation, les accords inter-annotateurs seront calcul&#233;s &#224; intervalles r&#233;guliers. 
</p>
<p>                                                 
4
 Toutes ces ressources sont librement disponibles sur les sites web des projets Lingwb pour SXPipe et Alexina pour les 
</p>
<p>lexiques : http://lingwb.gforge.inria.fr/ et http://alexina.gforge.inria.fr/ </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HELENA BLANCAFORT, GA&#203;LLE RECOURC&#201;, JAVIER COUTO, BENO&#206;T SAGOT, ROSA STERN, DENIS TEYSSOU 
</p>
<p>La typologie pr&#233;sent&#233;e dans cet article et le corpus annot&#233; qui r&#233;sultera de cette exp&#233;rience permettront le 
</p>
<p>d&#233;veloppement d&#8217;un outil automatique de d&#233;tection et de typage des inconnus. Ceci constitue le point de 
d&#233;part de travaux men&#233;s au sein du projet EDyLex permettant de rendre dynamique les ressources lexicales 
</p>
<p>et les cha&#238;nes de traitement. En effet, la classification automatique des inconnus permet de les traiter de 
</p>
<p>fa&#231;on adapt&#233;e en fonction de leur type. On peut alors proposer l&#8217;ajout temporaire ou d&#233;finitif dans le 
lexique d&#8217;entr&#233;es lexicales manquantes ou nouvelles, &#233;ventuellement valid&#233;es manuellement, puis 
imm&#233;diatement prises en compte dans une cha&#238;ne de traitement linguistique. Cet enrichissement 
</p>
<p>dynamique est particuli&#232;rement pertinent face &#224; flux riche en nouveaut&#233;s lexicales, comme c&#8217;est le cas avec 
des d&#233;p&#234;ches d&#8217;agence de presse. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>CARTONI B. (2006). Constance et variabilit&#233; de l&#8217;incompl&#233;tude lexicale. No&#251;s (3), pp. 10&#8211;13. 
</p>
<p>DE LA CLERGERIE &#201;., CLEMENT L. (2005). MAF: a Morphosyntactic Annotation Framework. Actes de 
</p>
<p>LTC&#8217;05 pp. 90&#8211;94, Pozna&#324;, Pologne. 
</p>
<p>DISTER A. ET FAIRON, C. (2004). Extension des ressources lexicales gr&#226;ce &#224; un corpus dynamique. 
</p>
<p>Lexicometrica. 
</p>
<p>JANSSEN, M. (2009). Detecci&#243;n de Neologismos: una perspectiva computacional. Debate Terminol&#243;gico, 
</p>
<p>5, p. 68&#8211;75. 
</p>
<p>GEYKEN, A. (2009). Automatische Wortschatzerschlie&#223;ung gro&#223;er Textkorpora am Beispiel des DWDS. 
</p>
<p>Linguistik online, n&#186; 39(3), pp. 97-108..ISSN 1615-3014. 
</p>
<p>JONASSON, K. (1994). Le nom propre. Constructions et interpr&#233;tations. Duculot. 
</p>
<p>MAUREL, D. (2004). Les mots inconnus sont-ils des noms propres ? Actes des JADT 2004. 
</p>
<p>NAKOV P., BONEV Y., ANGELOVA G., GIUS E., VON HAHN, W. (2003). Guessing Morphological Classes of 
</p>
<p>Unknown German Nouns. In Proceedings of RANLP&#8217;03. pp. 319-326. Borovets, Bulgarie. 
</p>
<p>MIKHEEV A., (1997). Automatic Rule Induction for Unknown-Word Guessing. In Computational 
</p>
<p>Linguistics 23(3), pp. 405&#8211;423. 
</p>
<p>REN X, PERRAULT F. (1992). The Typology of Unknown Words: An Experimental Study of Two Corpora. 
</p>
<p>In: Proceedings of COLING&#8217;92. Nantes; 1992.  
</p>
<p>SABLAYROLLES, J.F. (1997). N&#233;ologismes : Une typologie des typologies. Cahier du CIEL, pp. 11&#8211;48. 
</p>
<p>SABLAYROLLES, J.F. (2002). &#171; Fondements th&#233;oriques des difficult&#233;s pratiques du traitement des n&#233;ologis-
</p>
<p>mes &#187;, Revue fran&#231;aise de linguistique appliqu&#233;e, 7(1). &#171; Lexique : recherches actuelles &#187;, pp. 97&#8211;111. 
</p>
<p>SCHONE, P., JURAFSKY, D. (2001). Knowledge-Free Induction of Inflectional Morphologies. Proceedings of 
</p>
<p>the 2nd Meeting of the North American Chapter of the ACL (NAACL&#8217;01). 
</p>
<p>TSENG, H., JURAFSKY, D., MANNING, C. (2005). Morphological features help POS tagging of unknown 
</p>
<p>words across language varieties. Actes du 4th SIGHAN Workshop on Chinese Language Processing. 
</p>
<p>VILNAT A., FRANCOPOULO G., HAMON O., LOISEAU S., PAROUBEK P., VILLEMONTE DE LA CLERGERIE &#201;. 
</p>
<p>(2008). Large Scale Production of Syntactic Annotations to Move Forward. In : Proceedings of the 
</p>
<p>COLING 2008 Workshop on Cross-Framework and Cross-Domain Parser Evaluation. 
</p>
<p>WONG, K., LI, W., XU, R., ZHANG, Z. (2009). Introduction to Chinese natural language processing. 
</p>
<p>Synthesis lectures on human language technologies, Morgan &amp; Claypool Publishers. </p>

</div></div>
</body></html>