<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une approche cognitive de la fouille de grandes collections de documents</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Une approche cognitive de la fouille de grandes collections de
documents
</p>
<p>Adil El Ghali1 Yann Vigile Hoareau1, 2
</p>
<p>(1) Lutin User Lab, Cit&#233; des Sciences, Av C. Cariou, 75019 Paris
(2) Universit&#233; Paris 8, rue de la Libert&#233;, 93200 Saint Denis
</p>
<p>elghali@lutin-userlab.fr, hoareau@lutin-userlab.fr
</p>
<p>R&#233;sum&#233;. La r&#233;cente &#233;closion du Web2.0 engendre un accroissement consid&#233;rable de volumes tex-
tuels et intensifie ainsi l&#8217;importance d&#8217;une r&#233;flexion sur l&#8217;exploitation des connaissances &#224; partir de grandes
collections de documents. Dans cet article, nous pr&#233;sentons une approche de rechercher d&#8217;information qui
s&#8217;inspire des certaines recherches issues de la psychologie cognitive pour la fouille de larges collections
de documents. Nous utilisons un document comme requ&#234;te permettant de r&#233;cup&#233;rer des informations &#224;
partir d&#8217;une collection repr&#233;sent&#233;e dans un espace s&#233;mantique. Nous d&#233;finissons les notions d&#8217;identit&#233; s&#233;-
mantique et de pollution s&#233;mantique dans un espace de documents. Nous illustrons notre approche par
la description d&#8217;un syst&#232;me appel&#233; BRAT (Blogosphere Random Analysis using Texts) bas&#233; sur les no-
tions pr&#233;alablement introduites d&#8217;identit&#233; et de pollution s&#233;matique appliqu&#233;es &#224; une t&#226;che d&#8217;identification
des actualit&#233;s dans la blogosph&#232;re mondiale lors du concours TREC&#8217;09. Les premiers r&#233;sultats produits
sont tout &#224; fait encourageant et indiquent les pistes des recherches &#224; mettre en oeuvre afin d&#8217;am&#233;liorer les
performances de BRAT.
</p>
<p>Abstract. Mining Web 2.0 content become nowadays an important task in Information Retrieval and
Search communities. The work related in this paper present an original approach of blogs mining, inspired
from researches in cognitive psychology. We define the notions of semantic identity of blogs, and the
semantic pollution in a semantic space. Then, we describe a system called BRAT (Blogosphere Random
Analysis using Texts) based on these notions that has been applied to the Top Stories identification task of
the Blog Track at the TREC&#8217;09 contest. The performance of BRAT at TREC&#8217;09 in its preliminary stage
of development are very encouraging and the results of the experiences described here-after draw the lines
of the future researches that should be realized in order to upgrade its performances.
</p>
<p>Mots-cl&#233;s : Fouille de textes, Random-Indexing, Cognition, Marche al&#233;atoire.
</p>
<p>Keywords: Text-Mining, Random-Indexing, Cognition, Random walk.
</p>
<p>1 Introduction
</p>
<p>Dans le pr&#233;sent article, nous nous int&#233;ressons &#224; la recherche d&#8217;informations dans de grandes collections
de documents en utilisant un ou plusieurs documents comme requ&#234;te. Nous d&#233;finissons un syst&#232;me &#224; deux
modules pour r&#233;aliser cette t&#226;che. Le premier module distribue et repr&#233;sente les documents textuels dans
des espaces s&#233;mantiques construits avec la m&#233;thode Random Indexing (RI) (Kanerva et al., 2000). Le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADIL EL GHALI, YANN VIGILE HOAREAU
</p>
<p>deuxi&#232;me module r&#233;alise la recherche des documents en utilisant une marche al&#233;atoire 1 pour parcourir
l&#8217;espace s&#233;mantique et trouver les &#233;l&#233;ments en rapport avec une requ&#234;te donn&#233;e, compos&#233;e d&#8217;un ou plu-
sieurs documents. Le syst&#232;me a &#233;t&#233; construit en s&#8217;appuyant sur deux hypoth&#232;ses de travail que nous consi-
d&#233;rons importantes lorsqu&#8217;il est question de traiter la s&#233;mantique de grandes collections de documents :
les notions d&#8217;identit&#233; s&#233;mantique et de pollution s&#233;mantique.
</p>
<p>L&#8217;article est organis&#233; comme suit. Dans la premi&#232;re partie, nous pr&#233;sentons bri&#232;vement les mod&#232;les d&#8217;es-
paces s&#233;mantiques utilis&#233;s ainsi que leurs propri&#233;t&#233;s. Nous d&#233;finissons ensuite les notions d&#8217;identit&#233; s&#233;-
mantique et de pollution s&#233;mantique qui donnent quelques unes des propri&#233;t&#233;s principales de l&#8217;espace
s&#233;mantique. Nous d&#233;crivons &#233;galement dans cette partie comment utiliser des documents en tant que re-
qu&#234;tes. Dans la deuxi&#232;me partie, nous pr&#233;sentons une instanciation de notre syst&#232;me con&#231;u pour aborder la
t&#226;che d&#8217;identification des d&#233;p&#234;ches d&#8217;actualit&#233; 2 dans le cadre du TREC&#8217;09, nomm&#233; BRAT (Blogosphere
Random Analysis using Texts). La troisi&#232;me partie d&#233;crit les propri&#233;t&#233;s et les performances des diff&#233;rentes
ex&#233;cutions soumises dans le cadre du TREC&#8217;09.
</p>
<p>2 La cognition de la fouille de textes
</p>
<p>2.1 Les espaces s&#233;mantiques
</p>
<p>Les mod&#232;les de repr&#233;sentation vectorielle de la s&#233;mantique des mots sont une famille de mod&#232;les qui
repr&#233;sentent la similarit&#233; s&#233;mantique entre les mots en fonction de l&#8217;environnement textuel dans lequel
ces mots apparaissent. La distribution de co-occurrence des mots dans le corpus est rassembl&#233;e, analys&#233;e
puis transform&#233;e en espace s&#233;mantique dans lequel les mots sont repr&#233;sent&#233;s comme des vecteurs dans
un espace vectoriel de grande dimension. LSA (Landauer &amp; Dumais, 1997), HAL (Lund &amp; Burgess,
1996) et RI (Kanerva et al., 2000) en sont quelques exemples. Ces mod&#232;les sont bas&#233;s sur l&#8217;hypoth&#232;se
distributionnelle de (Harris, 1968) qui affirme que les mots qui apparaissent dans des contextes similaires
ont un sens similaire. La caract&#233;risation de l&#8217;unit&#233; de contexte est une probl&#232;matique commune &#224; toutes ces
m&#233;thodes, sa d&#233;finition est diff&#233;rente suivant les mod&#232;les. Par exemple, LSA construit une matrice mot-
document dans laquelle chaque cellule aij contient la fr&#233;quence d&#8217;un mot i dans une unit&#233; de contexte
j. HAL d&#233;finit une fen&#234;tre flottante de n mots qui parcourt chaque mot du corpus, puis construit une
matrice mot-mot dans laquelle chaque cellule aij contient la fr&#233;quence &#224; laquelle un mot i co-occure
avec un mot j dans la fen&#234;tre pr&#233;c&#233;demment d&#233;finie. Diff&#233;rentes m&#233;thodes math&#233;matiques et statistiques
permettant d&#8217;extraire la signification des concepts, en r&#233;duisant la dimensionnalit&#233; de l&#8217;espace de co-
occurence, sont appliqu&#233;es &#224; la distribution des fr&#233;quences stock&#233;es dans la matrice mot-document ou
mot-mot. Le premier objectif de ces traitements math&#233;matiques est d&#8217;extraire les &#171;patrons&#187; qui rendent
compte des variations de fr&#233;quences et qui permettent d&#8217;&#233;liminer ce qui peut &#234;tre consid&#233;r&#233; comme du
&#171; bruit &#187;. LSA emploie une m&#233;thode g&#233;n&#233;rale de d&#233;composition lin&#233;aire d&#8217;une matrice en composantes
ind&#233;pendantes : la d&#233;composition de valeur singuli&#232;re (SVD). Dans HAL la dimension de l&#8217;espace est
r&#233;duite en maintenant un nombre restreint de composantes principales de la matrice de co-occurrence. &#192; la
fin de ce processus de r&#233;duction de dimensionnalit&#233;, la similitude entre deux mots peut &#234;tre calcul&#233;e selon
diff&#233;rentes m&#233;thodes. Classiquement, la valeur du cosinus de l&#8217;angle entre deux vecteurs correspondant &#224;
deux mots ou &#224; deux groupes de mots est calcul&#233;e afin d&#8217;approximer leur similarit&#233; s&#233;mantique.
</p>
<p>1. Random Walk
2. Top-stories identification task</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FOUILLE DE GRANDES COLLECTIONS DE DOCUMENTS
</p>
<p>2.2 La notion d&#8217;identit&#233; s&#233;mantique
</p>
<p>Lors de l&#8217;utilisation de m&#233;thodes d&#8217;espaces s&#233;mantiques pour repr&#233;senter le sens, nous avons commenc&#233;
&#224; exposer ci-dessus la l&#8217;id&#233;e selon laquelle la s&#233;mantique produite pour un mot donn&#233; d&#233;pend de la distri-
bution des autres mots avec lesquels il co-occure. Par cons&#233;quent, quelque soit le mot, aucune s&#233;mantique
ne peut &#234;tre produite ex nihilo, c&#8217;est-&#224;-dire sans la r&#233;alisation d&#8217;une phase d&#8217;apprentissage appliqu&#233;e &#224;
une distribution de contextes ou d&#8217;&#233;pisodes donn&#233;e. La s&#233;mantique finale associ&#233;e &#224; un mot dispose ainsi
d&#8217;une identit&#233; forg&#233;e tout au long de la phase d&#8217;apprentissage, qui est r&#233;alis&#233;e par la SVD pour LSA ou
par le procesus d&#8217;accumulation pour RI. L&#8217;identit&#233; s&#233;mantique d&#8217;un mot donn&#233; change en fonction du
corpus dans lequel on le retrouve. En prenant l&#8217;exemple concret des espaces s&#233;mantiques de l&#8217;universit&#233;
du Colorado Boulder 3 disponibles en libre acc&#232;s. Les cinq plus proches voisins du mot &#171;table&#187; dans le
&#171;Biology HS betatest &#187; (articles scientifiques) sont : table (0.98), listed (0.80), summarized (0.68), detail
(0.47), following (0.46) 4. En revanche, le corpus du &#171;General Reading up to 1st year of college &#187; (ma-
nuels de lecture) donne comme voisins : table (0.98), tables (0.68), centerpiece (0.65), dinnerware (0.62),
tablecloth (0.61) 5. Il est ais&#233; de s&#8217;apercevoir que les identit&#233;s s&#233;mantiques du mot &#171;table&#187; dans les deux
corpus sont tr&#232;s diff&#233;rentes.
</p>
<p>La notion d&#8217;identit&#233; s&#233;mantique s&#8217;applique non seulement &#224; l&#8217;&#233;chelle des mots mais &#233;galement l&#8217;&#233;chelle
de l&#8217;espace s&#233;mantique. Un espace s&#233;mantique dispose d&#8217;une identit&#233; sp&#233;cifique qui lui est donn&#233; par la
distribution de la co-occurrence des mots dont il est compos&#233;.
</p>
<p>2.3 La notion de pollution s&#233;mantique
</p>
<p>La notion d&#8217;identit&#233; s&#233;mantique n&#8217;est pas r&#233;volutionnaire pour des chercheurs familiers avec les espaces
s&#233;mantiques et pourrait sembler quelque peu triviale si elle ne faisait pas ressortir une seconde notion
que nous appellerons &#171; pollution s&#233;mantique&#187;. Dans le pr&#233;c&#233;dent exemple d&#8217;un espace s&#233;mantique mixte,
scientifique et g&#233;n&#233;ral, l&#8217;identit&#233; s&#233;mantique du mot &#171;table&#187; est constitu&#233;e autant par la s&#233;mantique re-
lative &#224; la science que par celle de la vie quotidienne. Dans un espace s&#233;mantique g&#233;n&#233;ral, si un mot est
similaire au mot &#171;table&#187;, l&#8217;on peut supposer que ce mot n&#8217;est pas tr&#232;s &#233;loign&#233; du mot &#171;vaisselle&#187; dans l&#8217;es-
pace s&#233;mantique. Dans un espace s&#233;mantique mixte, une telle supposition para&#238;t moins raisonnable, car la
s&#233;mantique du mot &#171;table&#187; a &#233;t&#233; d&#8217;une certaine mani&#232;re &#171;pollu&#233;e&#187; par la partie scientifique du corpus.
</p>
<p>On pourrait soutenir que la pollution s&#233;mantique n&#8217;est autre que de la polys&#233;mie. Cela est vrai dans le cas
du mot &#171;table&#187; parce que c&#8217;est un mot polys&#233;mique, toutefois la pollution de l&#8217;identit&#233; du mot &#171;table&#187;
a pour effet de polluer l&#8217;identit&#233; de mots s&#233;mantiquement proches du mot &#171;table&#187; tels que &#171;r&#233;capitul&#233;&#187;,
&#171;&#233;num&#233;r&#233;&#187;, &#171;vaisselle&#187;, &#171;maison&#187;, etc. Ces mots ne sont pas des mots polys&#233;miques mais leurs identit&#233;s
s&#233;mantiques se retrouveront pollu&#233;es aussi. &#192; cause du mot &#171;table&#187;, des mots tels que &#171;r&#233;capitul&#233;&#187; peuvent
&#234;tre &#233;ventuellement semblables au mot &#171;vaisselle&#187; dans un espace s&#233;mantique mixte (Beyer et al., 1999;
Giannella, 2009). En conclusion, la pollution s&#233;mantique adresse non seulement l&#8217;&#233;chelle du mot mais
&#233;galement l&#8217;&#233;chelle de l&#8217;espace s&#233;mantique et de sa structure.
</p>
<p>3. http ://lsa.colorado.edu/
4. &#171;table&#187; (0,98), &#171;&#233;num&#233;r&#233;&#187; (0,80), &#171;r&#233;capitul&#233;&#187; (0,68), &#171;d&#233;tail&#187; (0,47), &#171;suivant&#187; (0,46)
5. &#171;table&#187; (0,98), &#171;tables&#187; (0,68), &#171;centre de table&#187; (0,65), &#171;vaisselle&#187; (0,62), &#171;nappe&#187; (0,61)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADIL EL GHALI, YANN VIGILE HOAREAU
</p>
<p>2.4 Des documents comme requ&#234;tes
</p>
<p>Dans de nombreuses applications, l&#8217;utilisateur qui recherche des documents dans une grande collection
dispose d&#8217;un ou plusieurs documents qui peuvent &#234;tre utilis&#233;s comme requ&#234;te. Dans l&#8217;application d&#233;crite
dans la section 4 : la t&#226;che d&#8217;identification des d&#233;p&#234;ches importantes 6 dans le cadre de la Blog-Track
du TREC&#8217;09, l&#8217;utilisateur cherche &#224; extraire les posts de blogs qui sont pertinentes &#233;tant donn&#233; une d&#233;-
p&#234;che d&#8217;actualit&#233;. Dans ce cas, la d&#233;p&#234;ches peut &#234;tre utilis&#233; comme requ&#234;te pour rechercher les &#233;l&#233;ments
pertinants dans l&#8217;espace s&#233;mantique repr&#233;sentant la blogosph&#232;re. Afin d&#8217;&#234;tre en mesure d&#8217;utiliser ces do-
cuments en tant que requ&#234;te, nous avons besoin pour repr&#233;senter documents dans l&#8217;espace de recherche.
Dans un espace s&#233;mantique, les mots sont repr&#233;sent&#233;s par des vecteurs dans un espace de dimension n.
Cette repr&#233;sentation peut &#234;tre &#233;tendu &#224; documents en associant &#224; chaque document le vecteur correspon-
dant &#224; la somme des mots qu&#8217;il contient (Rehder et al., 1998). Le vecteur d&#8217;un document est ainsi donn&#233;
par :
</p>
<p>~vd =
&#8721;
w&#8712;d
</p>
<p>~vw (1)
</p>
<p>Cette repr&#233;sentation permet de r&#233;aliser les m&#234;mes calculs sur les documents que sur les mots dans l&#8217;es-
pace s&#233;mantique. De plus, l&#8217;espace les documents compos&#233;s par les vecteurs des documents a les m&#234;mes
propri&#233;t&#233;s que l&#8217;espace les mots. Les notions de l&#8217;identit&#233; s&#233;mantique et de la pollution s&#233;mantique sont
naturellement &#233;tendues aux documents.
</p>
<p>3 BRAT
</p>
<p>BRAT repr&#233;sente dans un m&#234;me espace s&#233;mantique la production de la blogosph&#232;re et la production
journalistiques afin de permettre d&#8217;identifier pour chacune des d&#233;p&#234;ches, les posts de blogs pertinents.
Il construit des repr&#233;sentations l&#8217;identit&#233; s&#233;mantique li&#233;e &#224; l&#8217;actualit&#233; du point de vue de la blogosph&#232;re et
du point de vue de la production journalistique, puis &#233;tablit la pertinence des posts en fonction (i) de leur
similarit&#233; s&#233;mantique avec la d&#233;p&#234;che, (ii) de la proximit&#233; des posts par rapport &#224; l&#8217;identit&#233; s&#233;mantique
du point de vue de la blogosph&#232;re et (iii) de la proximit&#233; des posts par rapport &#224; l&#8217;identit&#233; s&#233;mantique du
point de vue de la production journalistique.
</p>
<p>3.1 Construction des espaces s&#233;mantiques
</p>
<p>La m&#233;thode de construction d&#8217;espace s&#233;mantique utilis&#233; est Random Indexing (RI), qui est relativement
&#233;loign&#233;e des autres m&#233;thodes de construction d&#8217;espaces s&#233;mantiques. Ses particularit&#233;s sont (i) qu&#8217;elle
ne construit pas de matrice de co-occurrence et (ii) qu&#8217;elle ne n&#233;cessite pas, contrairement aux autres
mod&#232;les vectoriels de repr&#233;sentation s&#233;mantique, des traitements statistiques lourds comme la SVD pour
LSA. RI est bas&#233;e sur la projection al&#233;atoire (Bingham &amp; Mannila, 2001), qui permet un meilleur passage
&#224; l&#8217;&#233;chelle pour grand nombre des documents. La construction d&#8217;un espace s&#233;mantique avec RI se d&#233;roule
comme suit :
&#8211; Cr&#233;er une matrice A(d &#215; n), contenant des vecteurs indexes, o&#249; d est le nombre de documents ou de
</p>
<p>contextes et n le nombre de dimensions choisies par l&#8217;exp&#233;rimentateur. Les vecteurs indexes sont des
vecteurs creux g&#233;n&#233;r&#233;s al&#233;atoirement.
</p>
<p>6. Top-stories identification task</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FOUILLE DE GRANDES COLLECTIONS DE DOCUMENTS
</p>
<p>&#8211; Cr&#233;er une matrice B(t&#215;n), contenant des vecteurs termes, o&#249; t est le nombre de termes diff&#233;rents dans
le corpus. Initialiser tous ces vecteurs avec des valeurs nulles pour d&#233;marrer la construction de l&#8217;espace
s&#233;mantique.
</p>
<p>&#8211; Pour tout document du corpus. Chaque fois qu&#8217;un terme &#964; appara&#238;t dans un document &#948;, accumuler le
vecteur index de &#948; au vecteur terme de &#964; .
</p>
<p>&#224; la fin du processus, les vecteurs termes qui appara&#238;ssent dans des contextes similaires ont accumul&#233; des
vecteurs indexes similaire.
</p>
<p>RI a &#233;t&#233; appliqu&#233; avec succ&#232;s au test de synonymie du TOEFL (Kanerva et al., 2000) ainsi que dans la
cat&#233;gorisation de textes (Sahlgren &amp; C&#246;ster, 2004; Hoareau et al., 2009b,a; El Ghali et al., 2009)
</p>
<p>Dans notre application, pour chaque dateD un espace s&#233;mantique SSD est construit en utilisant la librairie
Semantic Vectors 7 (Widdows &amp; Ferraro, 2008). Celui-ci contient toutes les d&#233;p&#234;ches de la journ&#233;e et tous
les posts dans une fen&#234;tre [D &#8722; 1, D + 1].
</p>
<p>3.2 Un random walk dans les espaces s&#233;mantiques
</p>
<p>Une fois l&#8217;espace s&#233;mantique SSD d&#8217;une journ&#233;e D construit, nous utilisons un algorithme de marche
al&#233;atoire pour naviguer dans l&#8217;espace afin de r&#233;cup&#233;rer pour chaque titre n posts pertinents.
</p>
<p>Nous appellons prototype d&#8217;un ensemble de documents d&#8217;une cat&#233;gorie (posts de blogs ou d&#233;p&#234;ches), c&#8217;est
un pseudo-document repr&#233;sent&#233; dans l&#8217;espace s&#233;mantique par la somme de tous les vecteurs de l&#8217;ensemble.
Par exemple, le prototype de toutes les d&#233;p&#234;ches est un document pseudo PH repr&#233;sent&#233;e par le vecteur :
</p>
<p>~PH =
&#8721;
h&#8712;H
</p>
<p>~h (2)
</p>
<p>avec H l&#8217;ensemble contenant toutes les d&#233;p&#234;ches de SSD.
</p>
<p>&#201;tant donn&#233; une d&#233;p&#234;che hi &#8712; SSD et &#951; &#8712; N , nous appelons &#951;-voisinage de hi pour un prototype P ,
l&#8217;ensemble des posts d&#233;fini comme suit :
</p>
<p>&#951;&#8722;voisinage(hi, P ) = {bj|d(bj, hi) &lt; d(P, hi)
&#951;
} (3)
</p>
<p>avec d(di, dj) la distance euclidienne entre les vecteurs ~di and ~dj .
</p>
<p>Afin de r&#233;cup&#233;rer les n posts pertinents pour la d&#233;p&#234;che hi, nous choisissons un seuil m &gt; n, et nous
parcourons al&#233;atoirement l&#8217;ensemble B contenant tous les posts de SSD, jusqu&#8217;&#224; trouverm posts candidats
dans l&#8217;&#951;-voisinage de hi pour le prototype PH de toutes les d&#233;p&#234;ches. Si nous avons trouv&#233; m posts
candidats, nous d&#233;finissons le score pi de hi comme le nombre de pas effectu&#233;s dans B. Si le nombre de
posts r&#233;cup&#233;r&#233;s est m&#8242; &lt; m, alors le score pi de ti est d&#233;finie par :
</p>
<p>pi = card(B)&#8722;m&#8242; (4)
</p>
<p>Le premi&#232;re application de BRAT dans le cadre du TREC&#8217;09 vise essentiellement &#224; tester l&#8217;effet du para-
m&#232;tre &#951;-voisinage. Une description en sera donn&#233;e dans la section suivante.
</p>
<p>7. http://code.google.com/p/semanticvectors/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADIL EL GHALI, YANN VIGILE HOAREAU
</p>
<p>4 Application &#224; la fouille de Blogs
</p>
<p>Le mod&#232;le BRAT a &#233;t&#233; appliqu&#233; &#224; la t&#226;che d&#8217;identification des d&#233;p&#234;ches dans le cadre du TREC&#8217;09. Les
objectifs sont de d&#233;tecter, pour une journ&#233;e de publication, les d&#233;p&#234;ches importantes du NewYork Times
(NYT) &#224; partir de l&#8217;analyse de la blogosph&#232;re et pour chacune des d&#233;p&#234;ches consid&#233;r&#233;e comme importante,
de proposer une dizaine de blogs pertinents.
</p>
<p>L&#8217;exp&#233;rience rapport&#233;e ci-apr&#232;s est le r&#233;sultat de la participation &#224; un concours, elle n&#8217;a donc pas pour
objectif d&#8217;&#233;valuer syst&#233;matiquement l&#8217;effet de chacun des param&#232;tres du mod&#232;le. Mais plut&#244;t &#224; v&#233;rifier
quelques hypoth&#232;ses et &#224; &#233;clairer des pistes de travail pour les recherches futures.
</p>
<p>4.1 Les hypoth&#232;ses
</p>
<p>Pour chaque journ&#233;e de publication un espace s&#233;mantique est construit &#224; partir des posts produits dans une
fen&#234;tre de trois jours et des titres du NYT pour la journ&#233;e. Une repr&#233;sentation de l&#8217;identit&#233; s&#233;mantique de
la blogosph&#232;re pour cette fen&#234;tre est approxim&#233;e en cr&#233;ant un prototype PB contenant tous les posts de la
fen&#234;tre. Une repr&#233;sentation de l&#8217;identit&#233; s&#233;mantique s&#233;mantique correspondant &#224; &#171;la vision&#187; de l&#8217;actualit&#233;
par le NYT est approxim&#233;e un prototype PH (cf. 3.2).
</p>
<p>Les ex&#233;cutions soumises correspondent &#224; diff&#233;rentes hypoth&#232;ses concernant l&#8217;organisation de la connais-
sance dans l&#8217;espace s&#233;mantique construit &#224; partir de la blogosph&#232;re. Les hypoth&#232;ses qui ont guid&#233; ce travail
sont les suivantes : (i) Le voisinage de PB est dense et pollu&#233;. Il est donc pr&#233;f&#233;rable de recruter des blogs
qui ne sont pas dans ce voisinage. De plus, diff&#233;rents facteurs devraient am&#233;liorer la pr&#233;cision de BRAT :
(ii) l&#8217;augmentation de la contrainte sur la proximit&#233; du voisinage de PH pour le recrutement des blogs (plus
&#951; est petit) ; (iii) la fusion des r&#233;sultats produits &#224; partir de l&#8217;augmentation successives de la contrainte sur
le voisinage au prototype (m&#233;thode d&#8217;adaptative) ; (iv) La combinaison de la contrainte sur le voisinage de
PB et sur le voisinage de PH ; (v) L&#8217;augmentation de la dimension de l&#8217;espace s&#233;mantique.
</p>
<p>Ces hypoth&#232;ses ont &#233;t&#233; implant&#233;s dans les diff&#233;rentes ex&#233;cutions d&#233;crites dans la sous-section 4.4.
</p>
<p>4.2 La collection
</p>
<p>La collection Blog08 (cf. Table 1) a &#233;t&#233; consrtuite par l&#8217;aspiration de la blogosph&#232;re pendant plus d&#8217;un an.
Elle est compos&#233;e de trois &#233;l&#233;ments : feeds correspondant &#224; l&#8217;ensemble des r&#233;sum&#233; des posts d&#8217;un blog,
permalinks correspondant aux posts de blogs et homepages contenant les pages d&#8217;accueil des auteurs.
</p>
<p>La collection # d&#8217;&#233;l&#233;ments Taille
Feeds 1.303.520 808GB
Permalinks 28.488.766 1445GB
Homepages 1.011.733 56GB
</p>
<p>TABLE 1 &#8211; Caract&#233;ristiques de la collection Blogs08
</p>
<p>Dans le cadre de nos exp&#233;riences, seuls les documents Permalink (i.e. les posts de blogs) ont &#233;t&#233; utilis&#233;s.
Les espaces s&#233;mantiques produits pour chaque journ&#233;es sont compos&#233;s en moyenne de plus de 150 000
posts pour une centaine de titres.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FOUILLE DE GRANDES COLLECTIONS DE DOCUMENTS
</p>
<p>4.3 L&#8217;&#233;valuation
</p>
<p>4.3.1 Description de la m&#233;thode
</p>
<p>Les ex&#233;cutions sont regroup&#233;es par les organisateurs puis redistribu&#233;es de telle fa&#231;on &#224; ce que les partici-
pants &#233;valuent la validit&#233; des ex&#233;cutions les uns des autres. L&#8217;&#233;valuation manuelle se d&#233;roule en plusieurs
phases.
</p>
<p>Dans la premi&#232;re phase, l&#8217;ensemble des titres propos&#233;s par l&#8217;ensemble des &#233;quipes sont soumis aux &#233;valua-
teurs afin qu&#8217;ils d&#233;terminent les titres qui leur paraissent les plus importants pour la journ&#233;e. Il est demand&#233;
aux &#233;valuateurs de se mettre &#224; la place d&#8217;un responsable de l&#8217;&#233;dition d&#8217;un journal et de d&#233;cider, en fonction
de leurs connaissances g&#233;n&#233;rales ou d&#8217;autres ressources (internet notamment), quels titres devraient &#234;tre
retenus comme important pour la journ&#233;e. &#192; partir des jugements sur l&#8217;importance des titres, une premi&#232;re
&#233;valuation des syst&#232;mes est r&#233;alis&#233;e.
</p>
<p>Dans la deuxi&#232;me phase, les jugements de l&#8217;importance des titres servent &#224; &#233;tablir la pertinence des blogs
propos&#233;s par les syst&#232;mes. Les organisateurs regroupent les blogs associ&#233;s aux titres ayant &#233;t&#233; jug&#233;s &quot;im-
portants&quot; lors de la premi&#232;re phase et les distribuent &#224; l&#8217;ensemble des participants pour une &#233;valuation
crois&#233;e. Pour chaque d&#233;p&#234;che, les &#233;valuateurs doivent juger de la pertinence des blogs qui lui ont &#233;t&#233; as-
soci&#233;s. La consigne par d&#233;faut est de consid&#233;rer comme pertinent, tout ce qui est en lien avec la d&#233;p&#234;che.
Autrement dit, un blog qui partage un lien, m&#234;me t&#233;nu, avec la d&#233;p&#234;che est consid&#233;rer comme &quot;pertinent&quot;.
</p>
<p>4.3.2 D&#233;calage entre la d&#233;finition de la t&#226;che et la consigne d&#8217;&#233;valuation
</p>
<p>L&#8217;&#233;valuation telle qu&#8217;elle a &#233;t&#233; conduite s&#8217;appuye sur l&#8217;avis des participants-&#233;valuateurs, &#224; qui il a &#233;t&#233;
demand&#233; de se positionner en tant que r&#233;dacteur-en-chef, pour d&#233;cider de l&#8217;importance des titres 8 :
</p>
<p>In essence, you should think like the editor of a newspaper or
news website. For each headline, make a decision about whether
the headline actually occurred on the query day, and whether you
would have placed it on the front page of your news website or
newspaper on that day
</p>
<p>alors que l&#8217;objectif de la t&#226;che &#233;tait explicitement d&#8217;indiquer les titres qui pourrait &#234;tre jug&#233;s importants
en tenant compte de ce que les blogeurs produisaient :
</p>
<p>For a given unit of time (e.g. date), systems will be asked to
identify the top news stories (similar to what is displayed on
the main page of Google Blog Search or Google News), and provide
a list of relevant blog posts discussing each news story.
</p>
<p>Il y a donc un d&#233;calage entre la consigne de la t&#226;che qui &#233;tait d&#8217;identifier les titres pertinents au regard
de ce qui est produit par la blogosph&#232;re et la consigne de l&#8217;&#233;valuation qui est de se mettre &#224; la place d&#8217;un
responsable de l&#8217;&#233;dition.
</p>
<p>Il est important de noter que l&#8217;&#233;valuation des blogs est d&#233;pendante de l&#8217;&#233;valuation de l&#8217;importance des
titres ; augmentant ainsi l&#8217;effet du d&#233;calage sur l&#8217;importance des d&#233;p&#234;ches pour une journ&#233;e &#224; l&#8217;&#233;valuation
des blogs &#233;tant associ&#233;s &#224; ces titres. Ainsi, les blogs associ&#233;s &#224; des titres ayant &#233;t&#233; jug&#233;s non-importants
</p>
<p>8. http://ir.dcs.gla.ac.uk/wiki/TREC-BLOG</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADIL EL GHALI, YANN VIGILE HOAREAU
</p>
<p>dans la premi&#232;re phase de l&#8217;&#233;valuation (du &quot;point de vue de l&#8217;&#233;diteur&quot;) ne sont jamais concern&#233;s par la
deuxi&#232;me phase d&#8217;&#233;valuation portant sur les blogs.
</p>
<p>Ce d&#233;calage entre la consigne de la t&#226;che et la consigne d&#8217;&#233;valuation n&#8217;est pas sans poser probl&#232;me.
Comme l&#8217;ont montr&#233; (Balog et al., 2009), pour des jours comme ceux de la f&#234;te des m&#232;res ou les lende-
mains de comp&#233;titions, les &#233;changes sur la blogosph&#232;re sont tr&#232;s fortement impact&#233;s par ces th&#232;matiques.
Or, il est tout &#224; fait probable qu&#8217;un &#233;v&#233;nement majeur tel qu&#8217;un s&#233;isme ou qu&#8217;un scandale politique se pro-
duise pour ces m&#234;mes jours. L&#8217;&#233;diteur (et donc l&#8217;&#233;valuateur) les consid&#233;rera comme important tandis qu&#8217;un
grand nombre de blogeurs souhaiteront de joyeuses f&#234;tes &#224; leur m&#232;re ou discuteront des performances de
leur &#233;quipe favorite.
</p>
<p>Ainsi, ce d&#233;calage, tout &#224; fait d&#233;pendant des choix des organisateurs, est de nature &#224; contrarier l&#8217;appr&#233;cia-
tion sereine des performances des &#233;quipes et des syst&#232;mes.
</p>
<p>4.4 Description des ex&#233;cutions
</p>
<p>Les ex&#233;cutions d&#233;crites ici correspondent aux diff&#233;rentes hypoth&#232;ses de travail d&#233;crites dans la sous-section
4.1. Les hypoth&#232;ses sur la constraintes de la restriction du voisinage au prototype des d&#233;p&#234;ches PH et au
prototype des blogs PB sont implant&#233;es en fonction des valeurs de &#951; qui leur est associ&#233;.
</p>
<p>Ainsi, ri1025rw2b correspond &#224; une ex&#233;cution qui choisit les blogs avec la seule contrainte qu&#8217;il soit
&#224; une certaine distance par rapport au voisinage du prototype des blogs PB, avec &#951; = 2. L&#8217;ex&#233;cution
ri1025rw5432 correspond &#224; un algorithme adaptatif utilisant le m&#234;me principe, et o&#249; les r&#233;sultats de la
marche al&#233;atoire avec &#951; = 5, 4, 3, 2 sont combin&#233;s. L&#8217;ex&#233;cution ri1025rw5h2b utilise un algorithme si-
milaire, mais utilisant une fonction de voisinage correspondant &#224; l&#8217;intersection du 5-voisinage par rapport
&#224; PT et du 2-voisinage par rapport &#224; PB. Tandis que les pr&#233;c&#233;dentes ex&#233;cutions utilisaient un espace s&#233;-
mantique &#224; 1025 dimensions, l&#8217;ex&#233;cution ri2049rw3 correspond &#224; une application de l&#8217;algorithme dans un
espace de 2049 dimensions en prenant pour unique contrainte la distance au voisinage du prototype des
d&#233;p&#234;ches PH avec &#951; = 3.
</p>
<p>4.5 R&#233;sultats
</p>
<p>Les r&#233;sultats qui sont pr&#233;sent&#233;s ci-apr&#232;s correspondent aux performances pour l&#8217;identification des titres
importants pour une journ&#233;e donn&#233;e. La mesure utilis&#233;es et R-pr&#233;cision@10 qui correspond &#224; la valeur de
pr&#233;cision calcul&#233;e pour 10 d&#233;p&#234;ches correctement identifi&#233;es. Les diff&#233;rentes caract&#233;ristiques des ex&#233;cu-
tions d&#233;crites ci-apr&#232;s ainsi que leur performances sont rappel&#233;es dans le Tableau 2.
</p>
<p>Parmi les diff&#233;rentes m&#233;thodes test&#233;s, le nombre de dimension de l&#8217;espace sur lequel est appliqu&#233; la marche
al&#233;atoire semble jouer un r&#244;le d&#233;terminant. Ainsi, l&#8217;ex&#233;cution ri2049rw3 donne les meilleurs r&#233;sultats. Par
ailleurs, la m&#233;thode adaptative qui combine les r&#233;sultats de plusieurs marches al&#233;atoires donne de meilleurs
r&#233;sultats que la m&#233;thode qui r&#233;alise la marche al&#233;atoire en prenant comme double contraintes les voisinage
&#224; PT et &#224; PB (respectivement ri1025rw5432 et ri1025rw5h2b) . Enfin, la seule contrainte sur le voisinage
de PB donne les moins bonnes performances (ri1025rw2b).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FOUILLE DE GRANDES COLLECTIONS DE DOCUMENTS
</p>
<p>Param&#232;tres de Brat Performance
Ex&#233;cution Dimension de RI Valeur de &#951; pour R-Precision@10 Position
</p>
<p>PT PB
</p>
<p>ri1025rw2b 1025 x 2 0,0964 &lt; Md
ri1025rw5h2b 1025 5 2 0,1145 &lt; Md
ri1025rw5432 1025 ada{5-2} x 0,1200 &gt; Md
ri2049rw3 2049 3 x 0,1182 &gt; Md
</p>
<p>TABLE 2 &#8211; Param&#232;tres des ex&#233;cutions, valeurs des R-Precision@10 et positionnement par rapport &#224; la
valeur m&#233;diane (Md) sur l&#8217;ensemble de participants &#224; la Blog-Track.
</p>
<p>5 Conclusion
</p>
<p>Nous avons d&#233;crit une approche qui permet la recherche d&#8217;information dans des grandes collections de
documents repr&#233;sent&#233;es dans un espace s&#233;mantique et interrog&#233;es en utilisant une marche al&#233;atoire. L&#8217;ap-
proche consiste &#224; construire avec RI un espace s&#233;mantique pour une journ&#233;e de publication &#224; partir des
posts de la blogosph&#232;re et des titres &#233;dit&#233;s par un journal pour le m&#234;me jour afin d&#8217;identifier les titres les
plus importants.
</p>
<p>BRAT construit une repr&#233;sentation de l&#8217;actualit&#233; du point de vue de la blogosph&#232;re et du point de vue
du journal et &#233;value la pertinence des titres et des blogs associ&#233;s en prenant en compte leurs similarit&#233;
s&#233;mantique et leur proximit&#233; avec la repr&#233;sentation de l&#8217;identit&#233; s&#233;mantique de l&#8217;actualit&#233; du point de vue
de la blogosph&#232;re ainsi qu&#8217;avec la repr&#233;sentation de l&#8217;identit&#233; s&#233;mantique de l&#8217;actualit&#233; du point de vue du
journal. BRAT r&#233;alise une marche al&#233;atoire dans l&#8217;espace s&#233;mantique et d&#233;termine l&#8217;importance d&#8217;un titre
en &#233;valuant le nombre de blogs qui lui sont similaires &#233;tant donn&#233;e certaines contraintes d&#233;pendantes de
la marche. Les exp&#233;riences r&#233;alis&#233;es ont montr&#233;es que les contraintes sur le voisinage li&#233; &#224; repr&#233;sentation
de l&#8217;actualit&#233; du point de vue du journal est plus efficace que les contraintes sur le voisinage li&#233;e &#224; la
repr&#233;sentation de l&#8217;actualit&#233; du point de vue de la blogosph&#232;re et que la conjugaison de contraintes sur
le voisinage li&#233;s au deux types de repr&#233;sentations am&#233;liore les r&#233;sultats, de m&#234;me que l&#8217;utilisation de
m&#233;thodes adaptatives ou l&#8217;augmentation de la dimension de l&#8217;espace construit avec RI.
</p>
<p>Ces diff&#233;rents &#233;l&#233;ments constituent autant de pistes de recherche qui nous permettrons d&#8217;am&#233;liorer notre
mod&#232;le.
</p>
<p>Remerciements
</p>
<p>Cette recherche a b&#233;n&#233;fici&#233; de l&#8217;aide g&#233;n&#233;reuse et solidaire des soci&#233;t&#233;s Thal&#232;s et Pertimn ainsi que du P&#244;le
de Comp&#233;titivit&#233; Cap-Digital de la R&#233;gion Ile de France. Nous leur adressons nos sinc&#232;res remerciements.
Nous remercions par ailleurs tous les coll&#232;gues du Lutin UserLab.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BALOG K., BRON M., HE J., HOFMANN K., MEIJ E. J., DE RIJKE M., TSAGKIAS E. &amp; WEERKAMP</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADIL EL GHALI, YANN VIGILE HOAREAU
</p>
<p>W. (2009). The University of Amsterdam at TREC 2009 : Blog, web, entity, and relevance feedback. In
TREC 2009 Working Notes : NIST.
</p>
<p>BEYER K. S., GOLDSTEIN J., RAMAKRISHNAN R. &amp; SHAFT U. (1999). When is &#8221;nearest neighbor&#8221;
meaningful ? In C. BEERI &amp; P. BUNEMAN, Eds., ICDT, volume 1540 of Lecture Notes in Computer
Science, p. 217&#8211;235 : Springer.
</p>
<p>BINGHAM E. &amp; MANNILA H. (2001). Random projection in dimensionality reduction : Applications to
image and text data. In in Knowledge Discovery and Data Mining, p. 245&#8211;250 : ACM Press.
</p>
<p>EL GHALI A., HOAREAU Y. &amp; EL GHALI K. (2009). The Episodic Memory Metaphor for Opinion
Judgment Categorization. In IADIS International Conference WWW/Internet (2), Rome.
</p>
<p>GIANNELLA C. (2009). New instability results for high-dimensional nearest neighbor search. Inf. Pro-
cess. Lett., 109(19), 1109&#8211;1113.
HARRIS Z. (1968). Mathematical Structures of Language. New York : John Wiley and Son.
</p>
<p>HOAREAU Y., EL GHALI A., LEGROS D. &amp; EL GHALI K. (2009a). Random Indexing and the episodic
memory metaphor. Application to text categorization. In A. ABDOLLAHZADEH &amp; H. PEDRAM, Eds.,
IEEE CSICC 2009. 14th International CSI, Teheran, Iran : IEEE.
</p>
<p>HOAREAU Y. V., EL GHALI A. &amp; TIJUS C. (2009b). Detection of opinions and facts. A cognitive
approach. In Recent Advance in Natural Language Processing (RANLP&#8217;09), Borovets, Bulgaria.
</p>
<p>KANERVA P., KRISTOFERSON J. &amp; HOLST A. (2000). Random Indexing of Text Samples for Latent
Semantic Analysis. In L. GLEITMAN &amp; A. JOSH, Eds., Proceedings of the 22nd Annual Conference of
the Cognitive Science Society, Mahwah : Lawrence Erlbaum Associates.
</p>
<p>LANDAUER T. K. &amp; DUMAIS S. T. (1997). A Solution to Plato&#8217;s Problem : The Latent Semantic
Analysis Theory of Acquisition, Induction and Representation of Knowledge. Psychological Review,
104(2), 211&#8211;240.
LUND K. &amp; BURGESS C. (1996). Producing high-dimensional semantic space from lexical co-
occurence. Behavior research methods, instruments &amp; computers, 28(2), 203&#8211;208.
REHDER B., SCHREINER M., WOLFE M., LAHAM D., LANDAUER T. &amp; KINTSCH W. (1998). Using
Latent Semantic Analysis to assess knowledge : Some technical considerations. Discourse Processes,
25(2), 337&#8211;354.
SAHLGREN M. &amp; C&#214;STER R. (2004). Using bag-of-concepts to improve the performance of support
vector machines in text categorization. In COLING &#8217;04 : Proceedings of the 20th international conference
on Computational Linguistics, p. 487, Morristown, NJ, USA : Association for Computational Linguistics.
</p>
<p>WIDDOWS D. &amp; FERRARO K. (2008). Semantic Vectors : A Scalable Open Source Package and Online
Technology Management Application. In Proceeding of the Sixth International Conference on Language
Resources and Evaluation (LREC&#8217;08).</p>

</div></div>
</body></html>