<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Adaptation d&#8217;un Syst&#232;me de Traduction Automatique Statistique avec des Ressources monolingues</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Adaptation d&#8217;un Syst&#232;me de Traduction Automatique Statistique
avec des Ressources monolingues
</p>
<p>Holger Schwenk
LIUM, Universit&#233; du Maine,
</p>
<p>72085 Le Mans cedex, France
Holger.Schwenk@lium.univ-lemans.fr
</p>
<p>R&#233;sum&#233;. Les performances d&#8217;un syst&#232;me de traduction statistique d&#233;pendent beaucoup de la qua-
lit&#233; et de la quantit&#233; des donn&#233;es d&#8217;apprentissage disponibles. La plupart des textes parall&#232;les librement
disponibles proviennent d&#8217;organisations internationales. Le jargon observ&#233; dans ces textes n&#8217;est pas tr&#232;s
adapt&#233; pour construire un syst&#232;me de traduction pour d&#8217;autres domaines. Nous pr&#233;sentons dans cet article
une technique pour adapter le mod&#232;le de traduction &#224; un domaine diff&#233;rent en utilisant des textes dans
la langue source uniquement. Nous obtenons des am&#233;liorations significatives du score BLEU dans des
syst&#232;mes de traduction de l&#8217;arabe vers le fran&#231;ais et vers l&#8217;anglais.
</p>
<p>Abstract. The performance of a statistical machine translation system depends a lot on the quality
and quantity of the available training data. Most of the existing, easily available parallel texts come from
international organizations and the jargon observed in those texts is not very appropriate to build a ma-
chine translation system for other domains. In this paper, we present a technique to automatically adapt the
translation model to a new domain using monolingual data in the source language only. We observe signi-
ficant improvements in the BLEU score in statistical machine translation systems from Arabic to French
and English respectively.
</p>
<p>Mots-cl&#233;s : Traduction statistique, adaptation du mod&#232;le de traduction, corpus monolingue, ap-
prentissage non-supervis&#233;.
</p>
<p>Keywords: Statistical machine translation, translation model adaptation, monolingual data, un-
supervised training.
</p>
<p>1 Introduction
</p>
<p>La traduction automatique statistique est aujourd&#8217;hui consid&#233;r&#233;e comme une alternative s&#233;rieuse aux sys-
t&#232;mes de traductions &#224; base de r&#232;gles. Ces derniers effectuent d&#8217;abord une analyse de la phrase source,
puis une &#233;tape de transfert et ensuite la g&#233;n&#233;ration de la phrase dans la langue cible. Le d&#233;veloppement
et le maintien d&#8217;un tel syst&#232;me n&#233;cessite g&#233;n&#233;ralement un travail humain important par des sp&#233;cialistes
(bilingues). Un syst&#232;me statistique, en revanche, peut en principe &#234;tre d&#233;velopp&#233; sans connaissance des
langues trait&#233;es. Consid&#233;rons la traduction d&#8217;une phrase en fran&#231;ais f vers l&#8217;anglais e :
</p>
<p>e&#8727; = argmax
e
p(e|f) = argmax
</p>
<p>e
p(f |e)P (e) (1)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HOLGER SCHWENK
</p>
<p>Le mod&#232;le de traduction p(f |e) est appris &#224; partir d&#8217;exemples de traductions, c&#8217;est-&#224;-dire des textes en
langue source et les traductions correspondantes, align&#233;s au niveau de la phrase. Ces textes sont commu-
n&#233;ment appel&#233;s &#171; textes parall&#232;les &#187; ou &#171; bitextes &#187; . Le mod&#232;le de langue P (e) est construit &#224; partir de
textes dans la langue cible. Cet apprentissage automatique &#224; partir d&#8217;exemples est g&#233;n&#233;ralement avanc&#233;
comme un grand avantage des syst&#232;mes de traduction statistique. Ceci a notamment permis de construire
rapidement des syst&#232;mes de traduction pour toutes les combinaisons de 22 langues europ&#233;ennes (Koehn
et al., 2009), gr&#226;ce &#224; l&#8217;utilisation des textes traduits par la Commission Europ&#233;enne. Ce corpus parall&#232;le
est connu sous le nom d&#8217;Europarl.
</p>
<p>En m&#234;me temps, il est clair que les performances de toute approche d&#8217;apprentissage automatique d&#233;-
pendent largement de la quantit&#233; et de la qualit&#233; des donn&#233;es d&#8217;apprentissage disponibles. On constate
souvent que les performances s&#8217;am&#233;liorent lorsque l&#8217;on utilise davantage de donn&#233;es d&#8217;apprentissage bien
que cet effet s&#8217;accentue rapidement. D&#8217;autre part, il s&#8217;av&#232;re souvent que le domaine des donn&#233;es d&#8217;ap-
prentissage correspond peu ou pas au domaine d&#8217;utilisation pr&#233;vu du syst&#232;me de traduction. Pour citer un
exemple, on comprend ais&#233;ment que les traductions apprises automatiquement &#224; partir des exemples de
traductions dans le domaine de la finance conviennent mal pour traduire des textes m&#233;dicaux. En effet,
les vocabulaires risquent d&#8217;&#234;tre diff&#233;rents et il y a des mots qui se traduisent diff&#233;remment en fonction du
domaine.
</p>
<p>Malheureusement, il se trouve que pratiquement tous les bitextes librement disponibles proviennent du
domaine parlementaire ou politique : le corpus Europarl, les comptes rendus en fran&#231;ais et en anglais du
parlement canadien ( &#171; Hansard &#187; ) ou des textes des Nations Unies. Le mod&#232;le de traduction appris sur
ces donn&#233;es risque donc de favoriser des traductions sp&#233;cifiques de ce domaine. On constate aussi que la
premi&#232;re personne n&#8217;est pas fr&#233;quemment utilis&#233;e dans ces textes. Cependant, on peut supposer qu&#8217;il y ait
suffisamment de textes monolingues pour une grande vari&#233;t&#233; de langues et domaines. Ces textes peuvent
souvent &#234;tre trouv&#233;s sur Internet ou sont disponibles aupr&#232;s de l&#8217;utilisateur du syst&#232;me de traduction. Il est
donc nettement plus facile de construire un mod&#232;le de langue sp&#233;cifique &#224; un domaine.
</p>
<p>Dans ce travail, nous proposons une m&#233;thode qui permet d&#8217;adapter un mod&#232;le de traduction g&#233;n&#233;rique &#224;
un domaine particulier en utilisant des donn&#233;es monolingues dans la langue source. Cet article est organis&#233;
comme suit. Dans la section suivante, nous r&#233;sumons d&#8217;abord d&#8217;autres recherches qui abordent le probl&#232;me
de ressources insuffisantes. La section 3 pr&#233;sente les syst&#232;mes de traduction de r&#233;f&#233;rence et la section 4
r&#233;sume nos exp&#233;riences. L&#8217;article termine avec une conclusion et une discussion de futures directions de
recherche.
</p>
<p>2 Recherches pr&#233;c&#233;dentes
</p>
<p>Plusieurs techniques ont &#233;t&#233; propos&#233;es dans la litt&#233;rature pour aborder le probl&#232;me de ressources bilingues
insuffisantes. On pourrait notamment essayer d&#8217;extraire des textes parall&#232;les &#224; partir de corpora compa-
rables. Un corpus comparable bilingue peut &#234;tre d&#233;fini comme une collection de textes dans deux langues
qui traitent le m&#234;me sujet sans &#234;tre des traductions parfaites. Wikipedia constitue un exemple bien connu
d&#8217;un grand corpus comparable.
</p>
<p>Une autre piste consiste &#224; adapter le mod&#232;le de traduction &#224; la t&#226;che sans utiliser des ressources bilingues
suppl&#233;mentaires. On peut distinguer deux fa&#231;ons d&#8217;effectuer cette adaptation : premi&#232;rement, on ajoute de
nouveaux mots en langue source ou de nouvelles traductions ; et deuxi&#232;mement, on modifie les distribu-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADAPTATION EN TRADUCTION AUTOMATIQUE STATISTIQUE
</p>
<p>tions de probabilit&#233; du mod&#232;le existant pour qu&#8217;elles conviennent mieux au domaine. Ces deux directions
sont compl&#233;mentaires et peuvent &#234;tre effectu&#233;es simultan&#233;ment.
</p>
<p>Une technique classique pour adapter un mod&#232;le statistique consiste &#224; utiliser un m&#233;lange de plusieurs
mod&#232;les et &#224; optimiser les coefficients d&#8217;interpolation &#224; la t&#226;che. Ceci a &#233;t&#233; &#233;tudi&#233; par plusieurs auteurs
dans le cadre de la traduction statistique, par exemple pour l&#8217;alignement des mots (Civera &amp; Juan, 2007),
pour la mod&#233;lisation linguistique (Zhao et al., 2004; Koehn &amp; Schroeder, 2007), et pour le mod&#232;le de
traduction (Foster &amp; Kuhn, 2007; Chen et al., 2008). L&#8217;avantage de cette approche consiste dans le fait que
peu de param&#232;tres sont modifi&#233;s, i.e. les coefficients des m&#233;langes. Cependant, beaucoup de probabilit&#233;s
sont modifi&#233;es en m&#234;me temps et il n&#8217;est pas possible de modifier s&#233;lectivement la probabilit&#233; d&#8217;une
traduction particuli&#232;re.
</p>
<p>L&#8217;extraction de textes align&#233;s &#224; partir de corpora comparables se fait souvent avec des techniques de
recherche d&#8217;information, voir par exemple (Hildebrand et al., 2005). R&#233;cemment, une technique similaire
a &#233;t&#233; mise en &#339;uvre pour adapter le mod&#232;le de traduction et de langage avec des textes monolingues dans la
langue source (Snover et al., 2008). Les auteurs ont utilis&#233; une recherche d&#8217;information interlingue pour
trouver des textes dans la langue cible qui correspondent au domaine des textes dans la langue source.
Cependant, il est difficile de trouver les alignements entre les phrases en langue source et cible, et un
simple mod&#232;le de type IBM-1 a &#233;t&#233; utilis&#233;.
</p>
<p>Une autre direction de recherche consiste dans l&#8217;auto-am&#233;lioration du mod&#232;le de traduction. Ceci a &#233;t&#233;
propos&#233; la premi&#232;re fois par (Ueffing, 2006). L&#8217;id&#233;e consiste &#224; traduire les donn&#233;es de test, &#224; filtrer les
traductions avec une mesure de confiance et &#224; utiliser les meilleures traductions pour entra&#238;ner un nouveau
(petit) mod&#232;le de traduction qui est utilis&#233; conjointement avec la table de traduction g&#233;n&#233;rique. Ceci est
en fait une approche par m&#233;lange de mod&#232;les dont un mod&#232;le est construit explicitement pour chaque jeu
de test. En pratique, ceci est uniquement possible lorsqu&#8217;une certaine quantit&#233; de donn&#233;es est disponible
pour &#234;tre traduite en une seule fois. Ceci est typiquement le cas lors des &#233;valuations du style NIST ou
WMT avec des jeux de test d&#8217;environ 50.000 mots, mais l&#8217;utilisation de cette m&#233;thode semble &#234;tre plus
difficile dans le cadre d&#8217;un service de traduction sur Internet. Dans une telle application, on ne demande
habituellement que la traduction de quelques phrases. Cette approche a &#233;t&#233; am&#233;lior&#233;e par la suite (Ueffing,
2007) et appliqu&#233;e aux autres mod&#232;les statistiques dans un syst&#232;me de traduction (Chen et al., 2008).
</p>
<p>Une autre approche comparable est l&#8217;apprentissage l&#233;g&#232;rement supervis&#233; (Schwenk, 2008). Dans ce tra-
vail, un syst&#232;me de traduction statistique est utilis&#233; pour traduire de grandes quantit&#233;s de donn&#233;es en
langue source. Ces traductions sont ensuite filtr&#233;es et les meilleures sont ajout&#233;es aux bitextes existants.
Cette technique semble &#234;tre tr&#232;s similaire &#224; l&#8217;auto-am&#233;lioration telle que propos&#233;e par (Ueffing, 2006),
mais il y a plusieurs diff&#233;rences conceptuelles. Premi&#232;rement, nous n&#8217;utilisons &#224; aucun moment le jeu de
test pour adapter le mod&#232;le de traduction, mais un grand corpus monolingue. Deuxi&#232;mement, nous cr&#233;ons
un tout nouveau mod&#232;le qui peut &#234;tre appliqu&#233; sur tout corpus de test sans modification suppl&#233;mentaire.
Ainsi, il est possible d&#8217;utiliser un syst&#232;me adapt&#233; de cette fa&#231;on dans un service de traduction sur Internet.
</p>
<p>Dans cet article, nous &#233;tudions l&#8217;utilit&#233; de cette approche pour adapter des syst&#232;mes de traduction de
l&#8217;arabe vers l&#8217;anglais et vers le fran&#231;ais. La traduction de l&#8217;arabe est int&#233;ressante puisqu&#8217;il s&#8217;agit d&#8217;une
langue morphologiquement riche. Ainsi, le texte en arabe est habituellement d&#233;compos&#233; pour s&#233;parer
les affixes et les suffixes d&#8217;un mot ce qui permet de diminuer consid&#233;rablement la taille du vocabulaire
de traduction. Plusieurs auteurs signalent une am&#233;lioration de la qualit&#233; des traductions gr&#226;ce &#224; cette
d&#233;composition morphologique, par exemple (Habash &amp; Sadat, 2006). Elle donne &#233;galement beaucoup
de groupes de mots peu fr&#233;quents, ce qui peut entra&#238;ner une mauvaise estimation des probabilit&#233;s de</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HOLGER SCHWENK
</p>
<p>traduction par fr&#233;quence relative. Notre but est d&#8217;am&#233;liorer l&#8217;estimation de ces probabilit&#233;s par l&#8217;utilisation
de textes monolingues.
</p>
<p>3 Syst&#232;mes de traduction de r&#233;f&#233;rence
</p>
<p>Dans cet article, un syst&#232;me de traduction statistique bas&#233; sur les segments est utilis&#233; (en anglais &#171; phrase-
based statistical machine translation system &#187; ) pour les deux paires de langues, en utilisant le logiciel
libre Moses (Koehn et al., 2007). L&#8217;&#233;quation 1 peut &#234;tre r&#233;&#233;crite afin de faire appara&#238;tre des fonctions
caract&#233;ristiques fi(e, f) :
</p>
<p>e&#8727; = argmax
e
p(f |e)P (e) = argmax
</p>
<p>e
</p>
<p>&#8719;
i
</p>
<p>fi(e, f)
&#955;i = argmax
</p>
<p>e
</p>
<p>&#8721;
i
</p>
<p>&#955;i log fi(e, f) (2)
</p>
<p>Nous utilisons quatorze fonctions caract&#233;ristiques : les probabilit&#233;s de traduction et lexicales dans les deux
directions, sept fonctions pour le mod&#232;le de distorsion lexicalis&#233;, une p&#233;nalit&#233; sur les mots et les groupes
de mots, et une fonction pour le mod&#232;le de langue. Les syst&#232;mes sont construits de la fa&#231;on suivante :
d&#8217;abord le logiciel GIZA++ est utilis&#233; afin d&#8217;obtenir les alignements mot &#224; mot dans les deux directions.
Il existe une version qui permet d&#8217;acc&#233;l&#233;rer le calcul sur des machines multi-c&#339;urs (Gao &amp; Vogel, 2008).1
</p>
<p>Ensuite les groupes de mots et les r&#233;ordonnements sont extraits, avec les valeurs de d&#233;faut de l&#8217;outil Moses.
Finalement, les coefficients des fonctions caract&#233;ristiques sont optimis&#233;s par l&#8217;outil CMERT.
</p>
<p>Les mod&#232;les de langage sont des quadri-grammes &#224; repli, construits avec l&#8217;outil SRILM (Stolcke, 2002).
Les donn&#233;es d&#8217;entra&#238;nement correspondent au c&#244;t&#233; anglais des bitextes plus une importante collection de
textes de journaux. Ces textes sont disponibles aupr&#232;s du LDC sous le nom corpus Gigaword.
</p>
<p>Dans la plupart des &#233;tudes des outils tels que l&#8217;analyseur de Buckwalter et les outils MADA et TOKAN
de l&#8217;universit&#233; de Columbia sont utilis&#233;s pour effectuer la d&#233;composition morphologique des textes en
arabe (Habash &amp; Sadat, 2006). Dans le pr&#233;sent travail, nous utilisons le module d&#8217;analyse du syst&#232;me de
traduction de l&#8217;entreprise SYSTRAN pour effectuer ce travail. Des r&#232;gles de d&#233;composition sont d&#8217;abord
appliqu&#233;es, assist&#233;es par un dictionnaire. La d&#233;composition la plus probable des mots absents du diction-
naire est effectu&#233;e. De fa&#231;on g&#233;n&#233;rale, toutes les d&#233;compositions possibles sont envisag&#233;es et puis filtr&#233;es
en utilisant le contexte dans la phrase. Cette &#233;tape se base sur une analyse globale de la phrase ainsi que
des connaissances lexicales. Les textes fran&#231;ais ont &#233;t&#233; tok&#233;nis&#233;s avec les outils de Moses. La casse et les
ponctuations sont pr&#233;serv&#233;es.
</p>
<p>3.1 Traduction arabe/anglais
</p>
<p>Le National Institute of Standards and Technology (NIST) organise depuis quelques ann&#233;es des campagnes
d&#8217;&#233;valuations internationales des syst&#232;mes de traduction automatique. Ces &#233;valuations sont commun&#233;ment
consid&#233;r&#233;es comme la r&#233;f&#233;rence dans le domaine. Le syst&#232;me de traduction arabe/anglais d&#233;crit ici fait
partie des meilleurs syst&#232;mes de l&#8217;&#233;valuation organis&#233;e en 2009. Les conditions et r&#233;sultats d&#233;taill&#233;s sont
disponibles sur le site Internet de NIST.2
</p>
<p>1Les sources sont disponibles &#224; http://www.cs.cmu.edu/~qing/
2http://www.itl.nist.gov/iad/mig/tests/mt/2009/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADAPTATION EN TRADUCTION AUTOMATIQUE STATISTIQUE
</p>
<p>Le mod&#232;le de traduction est appris sur divers textes parall&#232;les disponibles aupr&#232;s du LDC dans le cadre de
l&#8217;&#233;valuation NIST pour un total d&#8217;environ 56 millions de mots arabes. Nous avons &#233;galement ajout&#233; 133M
de mots du corpus des Nations Unies. Le mod&#232;le de langue est appris sur un total de plus de 3 milliards
de mots. Ces ressources &#233;taient les m&#234;mes pour tous les participants &#224; cette &#233;valuation ( &#171; condition
contrainte &#187; ).
</p>
<p>L&#8217;optimisation des param&#232;tres a &#233;t&#233; effectu&#233;e sur les donn&#233;es d&#8217;&#233;valuation de 2006. Nous donnons &#233;ga-
lement des r&#233;sultats sur les donn&#233;es d&#8217;&#233;valuation de 2008 qui ont &#233;t&#233; utilis&#233;es comme jeu de test interne.
Dans les deux cas, il s&#8217;agit de donn&#233;es du domaine des actualit&#233;s radio et t&#233;l&#233;vis&#233;es et des discussions sur
Internet. Quatre r&#233;f&#233;rences de traduction sont disponibles et la casse et la ponctuation sont pr&#233;serv&#233;es.
</p>
<p>Bitextes
Taille des Dev Test
bitextes Nist06 Nist08
</p>
<p>News + ISI bitextes 56M 42,69 42,06
+ donn&#233;es ONU 189M 43,51 42,19
</p>
<p>TAB. 1 &#8211; Scores BLEU du syst&#232;me de r&#233;f&#233;rence arabe/anglais.
</p>
<p>Les scores BLEU de ces syst&#232;mes de r&#233;f&#233;rence sont donn&#233;s dans le tableau 1. On note que les donn&#233;es
de l&#8217;ONU apportent un faible gain du score BLEU malgr&#233; une taille consid&#233;rable. Ceci s&#8217;explique par le
fait qu&#8217;il s&#8217;agit de donn&#233;es hors domaine. Bien que ce bitexte apporte beaucoup de traductions, il entra&#238;ne
&#233;galement une modification des probabilit&#233;s de traduction calcul&#233;es par fr&#233;quence relative. Les traductions
du domaine &#171; ONU &#187; semblent donc dominer les traductions plus adapt&#233;es des bitextes du domaine. Nous
montrerons dans cet article que ceci peut &#234;tre &#171; corrig&#233; &#187; en adaptant le mod&#232;le de traduction avec des
donn&#233;es monolingues.
</p>
<p>3.2 Traduction arabe/fran&#231;ais
</p>
<p>Nous consid&#233;rons &#233;galement la traduction de l&#8217;arabe vers le fran&#231;ais. Cette paire de langues nous semble
int&#233;ressante pour plusieurs raisons. Premi&#232;rement, il s&#8217;agit de deux langues morphologiquement riches,
par rapport &#224; la traduction habituelle vers l&#8217;anglais. Deuxi&#232;mement, il y a peu de bitextes bien adapt&#233;s
au domaine de traduction et un grand corpus hors domaine. Ce sont exactement les conditions qui ont
motiv&#233; notre approche d&#8217;adaptation du mod&#232;le de traduction. Finalement, on peut facilement identifier des
applications d&#8217;un syst&#232;me de traduction de l&#8217;arabe vers le fran&#231;ais.
</p>
<p>Le d&#233;veloppement des premiers syst&#232;mes de traduction statistiques pour cette paire de langues a probable-
ment d&#233;but&#233; avec le projet DGA TRAMES3 dont le but &#233;tait la traduction de la parole arabe vers le fran&#231;ais.
Dans le cadre de ce projet, environ 90 heures de discours radio et t&#233;l&#233;vis&#233;s ont &#233;t&#233; enregistr&#233;s, transcrits et
ensuite traduits en fran&#231;ais. La DGA nous a donn&#233; acc&#232;s &#224; ces textes parall&#232;les d&#8217;environ 260 mille mots.
Ces donn&#233;es sont parfaitement adapt&#233;es au domaine mais sont bien s&#251;r de taille trop limit&#233;e pour entra&#238;ner
un mod&#232;le de traduction statistique performant. Ainsi, nous les avons compl&#233;t&#233;s par 1,1 million mots de
textes t&#233;l&#233;charg&#233;s du site Internet du projet Syndicate4 et par environ 200 millions de mots de donn&#233;es de
l&#8217;ONU. Ce dernier corpus a &#233;t&#233; collect&#233; par l&#8217;entreprise SYSTRAN.
</p>
<p>3Traduction Automatique par M&#233;thodes Statistiques
4http://www.project-syndicate.org</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HOLGER SCHWENK
</p>
<p>La DGA a &#233;galement produit un jeu de test avec 4 traductions de r&#233;f&#233;rence. Ce corpus a &#233;t&#233; al&#233;atoirement
divis&#233; en jeu de d&#233;veloppement et test de 10 mille mots chacun environ. Les performances des syst&#232;mes de
r&#233;f&#233;rence sont donn&#233;es dans le tableau 2. Le mod&#232;le de langue est un quadri-grammes entra&#238;n&#233; sur un peu
plus de 1,3 milliard de mots (c&#244;t&#233; fran&#231;ais des bitextes, corpus Gigaword fran&#231;ais et d&#8217;autres journaux).
</p>
<p>Bitexts #mots Dev Test
TRAMES + Syndicate 858k 36,68 35,45
ONU 203M 40,02 37,91
TRAMES + Syndicate + ONU 204M 41,88 40,04
</p>
<p>TAB. 2 &#8211; Scores BLEU du syst&#232;me de r&#233;f&#233;rence arabe/fran&#231;ais.
</p>
<p>A notre connaissance, un seul autre syst&#232;me de traduction statistique arabe/fran&#231;ais a &#233;t&#233; d&#233;velopp&#233;, pr&#233;-
cis&#233;ment dans le cadre du projet TRAMES (Hasan &amp; Ney, 2008). Dans ce travail, le m&#234;me jeu de test a &#233;t&#233;
utilis&#233;, mais les bitextes sont diff&#233;rents : les textes parall&#232;les du projet TRAMES, des donn&#233;es de l&#8217;ONU
de la p&#233;riode 2001 &#224; avril 2007, les archives de Amnesty International et des articles du Monde Diploma-
tique. Les auteurs donnent un score BLEU de 41,1 sur le jeu de test complet d&#8217;environ vingt milles mots.
Ce syst&#232;me utilise donc d&#8217;autres ressources que le n&#244;tre et il n&#8217;est pas possible de comparer directement
les performances. Cependant, on peut probablement conclure que des scores BLEU sup&#233;rieurs &#224; 40 points
semblent correspondre &#224; l&#8217;&#233;tat de l&#8217;art pour cette paire de langues. Ceci correspond &#233;galement aux r&#233;sultats
observ&#233;s dans les &#233;valuations NIST pour la paire de langues arabe/anglais (cf. tableau 1). Dans les deux
cas il s&#8217;agit de la traduction de textes radio et t&#233;l&#233;vis&#233;s et quatre r&#233;f&#233;rences de traductions sont disponibles.
</p>
<p>4 Adaptation du mod&#232;le de traduction
</p>
<p>Le but de ce travail est l&#8217;adaptation du mod&#232;le de traduction sans bitextes suppl&#233;mentaires, mais avec des
donn&#233;es monolingues dans la langue source. Habituellement, il est bien plus facile de trouver de tels textes,
en particulier lorsqu&#8217;il s&#8217;agit de textes du domaine des actualit&#233;s comme dans ce travail. Nous utilisons ici
des parties du corpus Gigaword en arabe du LDC.
</p>
<p>Ces textes sont traduits par les syst&#232;mes de r&#233;f&#233;rence d&#233;crits ci-dessus. Ensuite, les traductions automa-
tiques sont filtr&#233;es afin de ne garder que les &#171; meilleures &#187; . Cette s&#233;lection pourrait &#234;tre bas&#233;e sur des
scores de confiance au niveau des mots (Ueffing, 2007). Dans notre cas, nous avons utilis&#233; le logarithme
de la vraisemblance fourni par le d&#233;codeur, normalis&#233; par le nombre de mots dans chaque phrase. Les
traductions filtr&#233;es sont ajout&#233;es aux bitextes existants et la proc&#233;dure compl&#232;te de construction d&#8217;un sys-
t&#232;me de traduction statistique est effectu&#233;e, c&#8217;est-&#224;-dire l&#8217;alignement des mots par GIZA++, l&#8217;extraction
des groupes de mots et l&#8217;optimisation des coefficients &#955;i. Alternativement, on pourrait r&#233;utiliser les ali-
gnements d&#233;termin&#233;s par le d&#233;codeur Moses. Ceci pourrait acc&#233;l&#233;rer le processus puisque nous omettons
l&#8217;&#233;tape effectu&#233;e par GIZA++.
</p>
<p>Les caract&#233;ristiques des corpora Gigaword de LDC sont donn&#233;es dans le tableau 3. Le syst&#232;me arabe/
fran&#231;ais n&#8217;a &#233;t&#233; adapt&#233; que sur le corpus AFP alors que nous avons utilis&#233; les corpora AFP, XIN et NHR
pour le syst&#232;me arabe/anglais. Notons que les textes de LDC en anglais et fran&#231;ais sont utilis&#233;s lors de la
construction du mod&#232;le de langue P (e). On peut supposer que ces textes contiennent les traductions de
quelques phrases des textes en arabe, ce qui devrait aider &#224; produire de bonnes traductions automatiques.
Ainsi nous parlons d&#8217;un apprentissage l&#233;g&#232;rement supervis&#233; par le mod&#232;le de langue (Schwenk, 2008).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADAPTATION EN TRADUCTION AUTOMATIQUE STATISTIQUE
</p>
<p>source arabe anglais fran&#231;ais
AFP 145M 527M 570M
</p>
<p>APW - 1011M 200M
ASB 7M - -
HYT 175M - -
NHR 188M - -
UMH 1M - -
</p>
<p>XIN 58M 280M -
</p>
<p>TAB. 3 &#8211; Caract&#233;ristiques des corpora Gigaword de LDC (nombre de mots).
</p>
<p>4.1 Adaptation du syst&#232;me arabe/anglais
</p>
<p>Les scores BLEU apr&#232;s adaptation du syst&#232;me arabe/anglais aux textes en arabe de l&#8217;AFP, XIN et HYT
respectivement sont donn&#233;s dans le tableau 4. Bien que les scores BLEU sur les donn&#233;es de d&#233;veloppe-
ment ne changent que peu, on constate une nette am&#233;lioration des performances sur les donn&#233;es de test.
On note aussi que les syst&#232;mes adapt&#233;s utilisent moins de bitextes que le syst&#232;me de r&#233;f&#233;rence. Ceci s&#8217;ex-
plique par le fait que les donn&#233;es de l&#8217;ONU ne sont plus utilis&#233;es dans les syst&#232;mes adapt&#233;s puisque ces
donn&#233;es hors-domaine sont remplac&#233;es par les traductions automatiques des corpora arabes du domaine.
Pour chaque corpus, nous avons essay&#233; diff&#233;rents seuils sur la vraisemblance normalis&#233;e du d&#233;codeur. Le
choix du meilleur seuil &#233;tait bien s&#251;r bas&#233; uniquement sur les performances obtenues sur les donn&#233;es de
d&#233;veloppement.
</p>
<p>Adaptation
Taille des Dev Test
bitextes Nist06 Nist08
</p>
<p>Aucune 189M 43,51 42,19
AFP 81M 43,64 43,10
XIN 48M 43,36 43,06
HYT 49M 43,77 43,00
Combinaison - 43,98 43,28
</p>
<p>TAB. 4 &#8211; Adaptation du syst&#232;me arabe/anglais.
</p>
<p>Finalement, nous avons effectu&#233; une simple combinaison des trois syst&#232;mes adapt&#233;s ind&#233;pendamment : les
listes des n meilleures hypoth&#232;ses sont concat&#233;n&#233;es et la meilleure hypoth&#232;se est extraite. Ceci a permis
d&#8217;obtenir un faible gain suppl&#233;mentaire (derni&#232;re ligne du tableau 4). Ce syst&#232;me a &#233;t&#233; tr&#232;s bien plac&#233; lors
des &#233;valuations NIST de 2009.5 Le syst&#232;me officiel inclut une autre composante que nous avons omise ici
par manque de place (la mod&#233;lisation linguistique dans l&#8217;espace continu (Schwenk, 2010)).
</p>
<p>4.2 Adaptation du syst&#232;me arabe/fran&#231;ais
</p>
<p>Les performances du syst&#232;me arabe/fran&#231;ais adapt&#233; sont r&#233;sum&#233;es dans le tableau 5. Ici, nous constatons
un gain en score BLEU tr&#232;s appr&#233;ciable de plus de 3,5 points BLEU sur les donn&#233;es de test. Cette am&#233;lio-
ration importante pourrait s&#8217;expliquer par le faible nombre de bitextes du domaine par rapport aux donn&#233;es
</p>
<p>5http://www.itl.nist.gov/iad/mig/tests/mt/2009/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HOLGER SCHWENK
</p>
<p>#mots
Dev Test
</p>
<p>arabe
R&#233;f&#233;rence 217M 41,88 40,04
Adapt&#233; 48M 45,44 43,68
</p>
<p>TAB. 5 &#8211; Adaptation du syst&#232;me de traductions arabe/fran&#231;ais.
</p>
<p>de l&#8217;ONU, tr&#232;s volumineuses mais hors domaine. Ce rapport &#233;tait plus &#233;quilibr&#233; pour la paire de langues
arabe/anglais.
</p>
<p>Nous avons analys&#233; la table de traduction pour ce syst&#232;me adapt&#233; et le syst&#232;me de r&#233;f&#233;rence qui a &#233;t&#233;
entra&#238;n&#233; sur plus de 200M de mots. Ceci est r&#233;sum&#233; dans le tableau 6. La table de traduction initiale avait
329M de lignes dont 22,9M pouvaient &#234;tre potentiellement appliqu&#233;es aux donn&#233;es de test. La table de
traduction du syst&#232;me adapt&#233;, d&#8217;autre part, n&#8217;utilise que 700k d&#8217;un total de 8,6M d&#8217;entr&#233;es. Il para&#238;t clair
que la table de traduction obtenue en entra&#238;nant sur les donn&#233;es de l&#8217;ONU contienne beaucoup d&#8217;entr&#233;es
qui ne sont pas utilis&#233;es, voire m&#234;me fausses. Il est surprenant de voir que la table de traduction du syst&#232;me
adapt&#233; soit plus petite et qu&#8217;elle contienne 11% de segments de la langue source en plus (18029 par rapport
&#224; 16263). Toutes ces entr&#233;es correspondent aux nouvelles s&#233;quences de mots puisque l&#8217;apprentissage non-
supervis&#233; ne permet pas d&#8217;augmenter le vocabulaire des mots source.
</p>
<p>R&#233;f&#233;rence Adapt&#233;
Nombre d&#8217;entr&#233;es 22,9M 700k
Nombre d&#8217;entr&#233;es diff&#233;rentes c&#244;t&#233; source 16263 18029
Nombre moyen de traductions 1406,4 38,8
Longueur moyenne d&#8217;une entr&#233;e c&#244;t&#233; source 2,65 2,81
</p>
<p>TAB. 6 &#8211; Caract&#233;ristiques de la table de traduction des deux syst&#232;mes. Dans les deux cas, la table a &#233;t&#233;
filtr&#233;e pour ne contenir que les groupes de mots qui peuvent &#234;tre appliqu&#233;s aux donn&#233;es de test.
</p>
<p>Nous supposons que ceci est particuli&#232;rement important avec la d&#233;composition morphologique de l&#8217;arabe.
Cette d&#233;composition permet de r&#233;duire consid&#233;rablement le vocabulaire, mais produit &#233;galement beaucoup
de s&#233;quences de tokens. Il semble &#234;tre important d&#8217;inclure dans la table de traduction des s&#233;quences qui
apparaissent dans les textes du domaine. Comme effet de bord, la plus petite table de traduction entra&#238;ne
un gain de vitesse de la traduction d&#8217;environ 40%.
</p>
<p>Nous avons compar&#233; les traductions du syst&#232;me avant et apr&#232;s adaptation : le TER6 est &#224; environ 30.
Les deux traductions diff&#232;rent donc significativement. Quelques exemples de traductions sont reproduits
dans la figure 1. Le syst&#232;me adapt&#233; produit manifestement de meilleures traductions pour ces exemples.
Il reste bien s&#251;r quelques erreurs dans ces phrases, mais la qualit&#233; des traductions permet largement de
comprendre le sens des phrases.
</p>
<p>6Translation Edit Rate (Snover et al., 2006)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADAPTATION EN TRADUCTION AUTOMATIQUE STATISTIQUE
</p>
<p>Source:  .&#1616;&#1602;&#1576;&#1575;&#1617;&#1587;&#1604;&#1575; &#1617;&#1616;&#1610;&#1602;&#1575;&#1614;&#1616;&#1585;&#1593;&#1614;&#1604;&#1575; &#1587;&#1616;&#1610;&#1574;&#1614;&#1585;&#1614;&#1604;&#1575; &#1617;&#1583;&#1616;&#1590;  &#1614;&#1605;&#1615;&#1607;&#1578; &#1616;&#1577;&#1614;&#1616;&#1581;&#1574;&#1614;&#1604; &#1616;&#1607;&#1610;&#1616;&#1580;&#1614;&#1608;&#1616;&#1578;&#1576; &#1604;&#1616;&#1610;&#1614;&#1604;&#1602; &#1615;&#1584;&#1606;&#1615;&#1605; &#1614;&#1578;&#1614;&#1571;&#1614;&#1583;&#1576;  &#1617;&#1577;&#1616;&#1610;&#1602;&#1575;&#1614;&#1616;&#1585;&#1593;&#1604;&#1575; &#1615;&#1577;&#1614;&#1614;&#1605;&#1603;&#1581;&#1614;&#1605;&#1614;&#1604;&#1575;
</p>
<p>Base: le tribunal irakien a commenc&#233; depuis peu par la direction du r&#232;glement des accusations contre l'ancien pr&#233;sident irakien.
</p>
<p>Adapt: le tribunal irakien a commenc&#233; depuis peu une liste d'accusations contre l'ancien pr&#233;sident irakien.
</p>
<p>Ref: La Cour irakienne a commenc&#233; &#224; dresser la liste des inculpations de l'ancien pr&#233;sident irakien.
</p>
<p>Source: &#1616;&#1610;&#1601; &#1617;&#1607;&#1604;&#1614;&#1604;&#1575; &#1605;&#1575;&#1614;&#1585; &#1616;&#1610;&#1601; &#1611;&#1575;&#1591;&#1616;&#1588;&#1614;&#1575;&#1606; &#1611;&#1604;&#1614;&#1610;&#1604; &#1614;&#1604;&#1614;&#1614;&#1602;&#1578;&#1616;&#1593;&#1575; &#1617;&#1616;&#1610;&#1604;&#1616;&#1610;&#1574;&#1575;&#1614;&#1585;&#1616;&#1587;&#1604;&#1575; &#1614;&#1588;&#1610;&#1614;&#1580;&#1604;&#1575; &#1617;&#1614;&#1606;&#1571; &#1617;&#1577;&#1616;&#1610;&#1604;&#1616;&#1610;&#1574;&#1575;&#1614;&#1585;&#1616;&#1587;&#1573; &#1612;&#1617;&#1577;&#1616;&#1610;&#1614;&#1585;&#1603;&#1614;&#1587;&#1593; &#1615;&#1616;&#1585;&#1583;&#1575;&#1614;&#1589;&#1614;&#1605; &#1614;&#1578;&#1583;&#1614;&#1575;&#1614;&#1601;&#1571;  &#1614;&#1606;&#1608;&#1615;&#1585;&#1617;&#1590;&#1614;&#1615;&#1581;&#1610; &#1575;&#1615;&#1608;&#1606;&#1614;&#1575;&#1603; &#1606;&#1610;&#1614;&#1585;&#1614;&#1582;&#1570; &#1616;&#1606;&#1614;&#1610;&#1591;&#1616;&#1588;&#1614;&#1575;&#1606; &#1615;&#1604;&#1575;&#1614;&#1616;&#1602;&#1578;&#1593;&#1575; &#1617;&#1614;&#1605;&#1578; &#1575;&#1614;&#1614;&#1605;&#1603;  &#1617;&#1577;&#1610;&#1616;&#1600;&#1576;&#1614;&#1585;&#1594;&#1604;&#1575; &#1616;&#1617;&#1577;&#1601;&#1617;&#1590;&#1604;&#1575;
</p>
<p>Base: De source militaire isra&#233;lienne a indiqu&#233; que l'arm&#233;e isra&#233;lienne a arr&#234;t&#233; dans la nuit militants &#224; Ramallah en Cisjordanie ont &#233;t&#233; arr&#234;t&#233;s autres militants qui ...
</p>
<p>Adapt: Selon des sources militaires isra&#233;liennes, l'arm&#233;e isra&#233;lienne a arr&#234;t&#233; dans la nuit de militants &#224; Ramallah, en Cisjordanie, a &#233;galement &#233;t&#233; arr&#234;t&#233; deux autres activistes qui ...
</p>
<p>Ref: Des sources militaires isra&#233;liennes ont indiqu&#233; que l'arm&#233;e isra&#233;lienne a arr&#234;t&#233; de nuit un activiste &#224; Ramallah en Cisjordanie, ainsi que deux autres activistes qui ...
</p>
<p>Source:  .&#1606;&#1614;&#1614;&#1605;&#1610;&#1614;&#1604;&#1575; &#1548;&#1614;&#1577;&#1601;&#1575;&#1614;&#1581;&#1617;&#1589;&#1604;&#1575; &#1615;&#1614;&#1577;&#1604;&#1608;&#1614;&#1580; &#1548;&#1616;&#1610;&#1585;&#1614;&#1575;&#1615;&#1576;&#1594;&#1604;&#1575; &#1615;&#1583;&#1617;&#1605;&#1614;&#1581;&#1615;&#1605;
Base: Mohammed du brouillard, le cycle de la presse, au Y&#233;men.
</p>
<p>Adapt: Mohammed, une tourn&#233;e de la presse  le Y&#233;men.
</p>
<p>Ref: Mohamed Al-Ghobari, tour de la presse, Y&#233;men.
</p>
<p>Source:  .&#1602;&#1575;&#1614;&#1616;&#1585;&#1593;&#1604;&#1575; &#1614;&#1606;&#1616;&#1605; &#1614;&#1575;&#1616;&#1607;&#1583;&#1615;&#1608;&#1606;&#1615;&#1580; &#1616;&#1576;&#1581;&#1614;&#1587; &#1616;&#1610;&#1601;  &#1611;&#1575;&#1590;&#1614;&#1610;&#1571; &#1583;&#1606;&#1614;&#1604;&#1610;&#1614;&#1575;&#1578; &#1614;&#1578;&#1593;&#1614;&#1585;&#1614;&#1588; &#1609;&#1614;&#1585;&#1615;&#1582;&#1571; &#1613;&#1614;&#1577;&#1607;&#1616;&#1580; &#1606;&#1616;&#1605; 
Base: d'autre part commenc&#233; aussi embarrass&#233;e &#224; retirer ses troupes d'Irak.
</p>
<p>Adapt: D'autre part, la Tha&#239;lande a commenc&#233; &#224; retirer ses troupes d'Irak.
</p>
<p>Ref: D'autre part, la Tha&#239;lande a &#233;galement commenc&#233; &#224; retirer ses troupes d'Irak.
</p>
<p>FIG. 1 &#8211; Exemples de traductions automatiques tir&#233;s du jeux de test (syst&#232;me de r&#233;f&#233;rence, syst&#232;me adapt&#233;
et r&#233;f&#233;rence de traduction humaine).
</p>
<p>5 Conclusion
</p>
<p>L&#8217;approche statistique &#224; la traduction automatique est aujourd&#8217;hui utilis&#233;e pour construire rapidement des
syst&#232;mes de traduction pour de nombreuses paires de langues. En g&#233;n&#233;ral, on se contente de prendre
tous les textes parall&#232;les disponibles pour entra&#238;ner le mod&#232;le de traduction. La plupart de ces textes
proviennent cependant d&#8217;un domaine bien sp&#233;cifique &#8211; les discours parlementaires &#8211; ce qui les rend peu
appropri&#233;s pour d&#8217;autres domaines. D&#8217;autre part, des textes monolingues existent g&#233;n&#233;ralement dans la
plupart des domaines d&#8217;int&#233;r&#234;t.
</p>
<p>Dans ce travail, nous avons propos&#233; une approche qui utilise des textes monolingues en langue source pour
adapter un mod&#232;le de traduction g&#233;n&#233;rique. Pour cela les textes sont traduits par un syst&#232;me g&#233;n&#233;rique
initial, filtr&#233;s et les plus fiables sont ajout&#233;s aux textes parall&#232;les. Apr&#232;s un nouveau cycle d&#8217;apprentissage,
nous obtenons un syst&#232;me adapt&#233;. Cette technique a permis d&#8217;obtenir des am&#233;liorations significatives du
score BLEU dans des syst&#232;mes de traduction arabe/anglais et arabe/fran&#231;ais.
</p>
<p>Plusieurs extensions de l&#8217;approche sont actuellement &#233;tudi&#233;es, notamment d&#8217;autres scores de confiance
pour filtrer les traductions automatiques, le traitement des n meilleures hypoth&#232;ses au lieu de la traduction
la plus probable, et l&#8217;utilisation des alignements fournis par le d&#233;codeur au lieu de relancer GIZA++.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HOLGER SCHWENK
</p>
<p>Remerciements
</p>
<p>Ces recherches ont &#233;t&#233; partiellement financ&#233;es par le gouvernement fran&#231;ais sous le projet INSTAR (ANR
JCJC06_143038) et la Commission Europ&#233;enne sous le projet EuromatrixPlus. Le corpus parall&#232;le arabe/
fran&#231;ais de donn&#233;es radio et t&#233;l&#233;vis&#233;es ainsi que les donn&#233;es de test correspondantes ont &#233;t&#233; mises &#224; dispo-
sition par la DGA. Une partie de ces travaux a &#233;t&#233; effectu&#233;e en collaboration avec l&#8217;entreprise SYSTRAN.
</p>
<p>R&#233;f&#233;rences
CHEN B., ZHANG M., AW A. &amp; LI H. (2008). Exploiting n-best hypotheses for SMT self-enhancement. In ACL,
p. 157&#8211;160.
</p>
<p>CIVERA J. &amp; JUAN A. (2007). Domain adaptation in statistical machine translation with mixture modelling. In
Second Workshop on SMT, p. 177&#8211;180.
</p>
<p>FOSTER G. &amp; KUHN R. (2007). Mixture-model adaptation for SMT. In EMNLP, p. 128&#8211;135.
</p>
<p>GAO Q. &amp; VOGEL S. (2008). Parallel implementations of word alignment tool. In Software Engineering, Testing,
and Quality Assurance for Natural Language Processing, p. 49&#8211;57, Columbus, Ohio : Association for Computa-
tional Linguistics.
</p>
<p>HABASH N. &amp; SADAT F. (2006). Arabic preprocessing schemes for statistical machine translation. In NAACL, p.
49&#8211;52.
</p>
<p>HASAN S. &amp; NEY H. (2008). A multi-genre SMT system for Arabic to French. In LREC, p. 2167&#8211;2170.
</p>
<p>HILDEBRAND A. S., ECK M., VOGEL S. &amp; WAIBEL A. (2005). Adaptation of the translation model for statistical
machine translation based on information retrieval. In EAMT, p. 133&#8211;142.
</p>
<p>KOEHN P., BIRCH A. &amp; STEINBERGER R. (2009). 462 machine translation systems for Europe. In MT Summit.
</p>
<p>KOEHN P., HOANG H., BIRCH A., CALLISON-BURCH C., FEDERICO M., BERTOLDI N., COWAN B., SHEN
W., MORAN C., ZENS R., DYER C., BOJAR O., CONSTANTIN A. &amp; HERBST E. (2007). Moses : Open source
toolkit for statistical machine translation. In ACL, demonstration session.
</p>
<p>KOEHN P. &amp; SCHROEDER J. (2007). Experiments in domain adaptation for statistical machine translation. In
Second Workshop on SMT, p. 224&#8211;227.
</p>
<p>SCHWENK H. (2008). Investigations on large-scale lightly-supervised training for statistical machine translation.
In IWSLT, p. 182&#8211;189.
</p>
<p>SCHWENK H. (2010). Continuous space language models for statistical machine translation. The Prague Bulletin
of Mathematical Linguistics, (93).
</p>
<p>SNOVER M., DORR B. &amp; SCHWARTZ R. (2008). Language and translation model adaptation using comparable
corpora. In EMNLP.
</p>
<p>SNOVER M., DORR B., SCHWARTZ R., MICCIULLA L. &amp; MAKHOUL J. (2006). A study of translation edit rate
with targeted human annotation. In ACL.
</p>
<p>STOLCKE A. (2002). SRILM - an extensible language modeling toolkit. In ICSLP, p. II : 901&#8211;904.
</p>
<p>UEFFING N. (2006). Using monolingual source-language data to improve MT performance. In IWSLT, p. 174&#8211;181.
</p>
<p>UEFFING N. (2007). Transductive learning for statistical machine translation. In ACL, p. 25&#8211;32.
</p>
<p>ZHAO B., ECK M. &amp; VOGEL S. (2004). Language model adaptation for statistical machine translation with
structured query models. In Coling.</p>

</div></div>
</body></html>