<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>TerminoWeb : recherche et analyse d&#8217;information th&#233;matique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TerminoWeb : recherche et analyse d&#8217;information th&#233;matique 
 
</p>
<p>TerminoWeb : recherche et analyse d&#8217;information th&#233;matique  
</p>
<p>Caroline Barri&#232;re 
ITI-CNR, Gatineau, Canada 
</p>
<p>caroline.barriere@nrc-cnrc.gc.ca 
</p>
<p>R&#233;sum&#233; Notre d&#233;monstration porte sur le prototype TerminoWeb, une plateforme Web qui 
permet (1) la construction automatique d&#8217;un corpus th&#233;matique &#224; partir d&#8217;une recherche de 
documents sur le Web, (2) l&#8217;extraction de termes du corpus, et (3) la recherche d&#8217;information 
d&#233;finitionnelle sur ces termes en corpus.  La plateforme int&#233;grant les trois modules, elle aidera 
</p>
<p>un langagier (terminologue, traducteur, r&#233;dacteur) &#224; d&#233;couvrir un nouveau domaine (th&#232;me) en 
</p>
<p>facilitant la recherche et l&#8217;analyse de documents informatifs pertinents &#224; ce domaine.   
</p>
<p>Abstract Our demonstration shows the TerminoWeb prototype, a Web platform which can 
(1) automatically assemble a thematic corpus from Web documents, (2) extract terms from 
</p>
<p>that corpus, and (3) find definitional information in the corpus about terms of interest.  As the 
</p>
<p>platform integrates all three modules, it can help a language worker (terminologist, translator, 
</p>
<p>writer) to explore a new domain (theme) as it facilitates the gathering and analysis of 
</p>
<p>informative documents about that domain.  
</p>
<p>Mots-cl&#233;s : information th&#233;matique, construction de corpus, extraction de termes, 
d&#233;couverte de contextes d&#233;finitionnels 
</p>
<p>Keywords:  thematic information, corpus construction, term extraction, definitional 
contexts discovery 
</p>
<p> 
</p>
<p>1  Introduction 
</p>
<p>Divers langagiers peuvent se retrouver en situation o&#249; ils ont besoin de ma&#238;triser la 
</p>
<p>terminologie d&#8217;un domaine auparavant peu connu.  Il leur faut alors se renseigner sur le sujet, 
mais de fa&#231;on efficace.  Ils pourront lire des documents pertinents &#224; la compr&#233;hension du 
</p>
<p>domaine, et tenteront, &#224; l&#8217;int&#233;rieur de ces documents, d&#8217;acc&#233;der rapidement &#224; l&#8217;information 
importante, soit celle qui met en relief les termes importants du domaine en contextes 
</p>
<p>d&#233;finitionnels.  Cette t&#226;che n&#8217;est ni facile, ni pr&#233;cise. Tout de m&#234;me, c&#8217;est &#224; cette t&#226;che que 
TerminoWeb
</p>
<p>1
 se voue pour &#234;tre un outil d&#8217;aide aux langagiers.  La version pr&#233;sente 2.0 de 
</p>
<p>TerminoWeb accommode deux langues soient le fran&#231;ais et l&#8217;anglais. 
</p>
<p>Les usagers envisag&#233;s sont multiples, soient : un terminologue devant g&#233;n&#233;rer un glossaire 
</p>
<p>d&#8217;un domaine sp&#233;cialis&#233;, un traducteur devant comprendre les notions importantes d&#8217;un 
domaine dans lequel il a &#224; traduire plusieurs documents, un sp&#233;cialiste de domaine devant 
</p>
<p>cr&#233;er une ontologie de ce domaine, un journaliste devant ma&#238;triser quelques concepts 
</p>
<p>                                                 
1
 Le prototype TerminoWeb est disponible gratuitement pour essais &#224; l&#8217;adresse http://terminoweb.iit.nrc.ca. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Barri&#232;re 
</p>
<p>importants d&#8217;un sujet dans lequel il enqu&#234;te, ou encore un enseignant de la langue sp&#233;cialis&#233;e 
devant proposer un lexique de termes &#224; apprendre aux &#233;tudiants pour un domaine pr&#233;cis. 
</p>
<p>2  Trois &#233;tapes vers l&#8217;analyse d&#8217;information th&#233;matique 
</p>
<p>Les trois modules principaux de TerminoWeb correspondent &#224; trois &#233;tapes d&#8217;une t&#226;che 
d&#8217;agglom&#233;ration d&#8217;information th&#233;matique, soit (1) la construction d&#8217;un corpus sp&#233;cialis&#233; &#224; 
partir de requ&#234;tes Web, (2) l&#8217;extraction de termes importants dans ce corpus, et (3) la 
recherche de contextes d&#233;finitionnels entourant des termes choisis.  Au-del&#224; de ces modules, 
</p>
<p>TerminoWeb permet aussi, entre autres : la gestion de corpora sp&#233;cialis&#233;s (un usager peut 
</p>
<p>conserver plusieurs corpora sur divers sujets), l&#8217;importation de textes d&#8217;une archive vers un 
corpus, la g&#233;n&#233;ration automatique de requ&#234;tes Web &#224; partir d&#8217;un ensemble de mots-cl&#233;s (voir 
Barri&#232;re 2009a), l&#8217;importation et exportation de listes de termes &#224; &#233;tudier, la d&#233;finition de 
nouveaux patrons linguistiques propres &#224; la compr&#233;hension de domaines sp&#233;cifiques (e.g. en 
</p>
<p>m&#233;decine &#171; may prevent &#187;, &#171; may reduce the risk of &#187;), la recherche de collocations et 
</p>
<p>concordances (Barri&#232;re 2009b).  Ces fonctionnalit&#233;s int&#233;ressantes de TerminoWeb sont 
</p>
<p>actives dans le prototype m&#234;me si elles ne sont pas pr&#233;sent&#233;es ici par souci d&#8217;espace. 
</p>
<p>&#201;tape 1 &#8211; Cr&#233;ation d&#8217;un corpus sp&#233;cialis&#233; 
</p>
<p>Le module de cr&#233;ation de corpus de TerminoWeb permet de recueillir des documents Web sur 
</p>
<p>un sujet d&#233;sir&#233; et de les mettre en m&#233;moire.  L&#8217;usager entre une requ&#234;te, par exemple diamond 
mining, et TerminoWeb lance la recherche de pages informatives et sp&#233;cialis&#233;es, ces pages 
</p>
<p>&#233;tant les plus susceptible de contenir des segments d&#233;finitionnels dans le domaine d&#8217;int&#233;r&#234;t.   
</p>
<p> 
</p>
<p>Figure 1 &#8211; Ensemble de pages r&#233;sultantes de la recherche &#171; diamond mining &#187; 
</p>
<p>Dans nos travaux pr&#233;c&#233;dents (Barri&#232;re et Agbago 2006), nous avons &#233;tabli, de fa&#231;on 
</p>
<p>empirique, divers crit&#232;res pour &#233;valuer si une page est informative ou non.  Le crit&#232;re 
</p>
<p>principal repose sur la pr&#233;sence de patrons de connaissances (Meyer 2001) qui sont des 
</p>
<p>patrons linguistiques exprimant diverses relations s&#233;mantiques li&#233;es &#224; la d&#233;finition, telles 
</p>
<p>l&#8217;hyperonymie (&#171; est une sorte de &#187;, &#171; est un type de &#187;), la synonymie (&#171; aussi appel&#233; &#187;, &#171; aussi 
connu sous le nom &#187;) ou la m&#233;ronymie (&#171; est une partie de&#187;, &#171; est compos&#233; de &#187;).  Une page </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TerminoWeb : recherche et analyse d&#8217;information th&#233;matique 
 
</p>
<p>doit de plus &#234;tre sp&#233;cialis&#233;e et le crit&#232;re pour cet aspect est la densit&#233; de termes connus du 
</p>
<p>domaine s&#8217;y retrouvant. Ainsi, TerminoWeb lancera une requ&#234;te au Yahoo API2 et analysera 
X pages (e.g. 50 pages) pour leur assigner une note en fonction des crit&#232;res &#233;tablis et 
</p>
<p>retournera les N pages (e.g. 10 pages) les plus informatives.  Ces param&#232;tres X (nombre de 
</p>
<p>pages &#224; analyser) et N (nombre de pages d&#233;sir&#233;es) ont des valeurs par d&#233;faut qui peuvent &#234;tre 
</p>
<p>modifi&#233;es par l&#8217;usager.  
</p>
<p>La Figure 1 montre le r&#233;sultat de la requ&#234;te diamond mining tel que vu dans TerminoWeb.  
</p>
<p>L&#8217;usager peut retrouver chaque document (en cliquant sur le lien dans la colonne Link) et 
d&#233;cider d&#8217;accepter ou non le document dans le corpus (changement du statut de &#171; Undefined &#187; 
&#224; &#171; Accepted &#187;).  La colonne [score] indique la note obtenue par le document et la colonne 
</p>
<p>[size] indique la taille du document en nombre de caract&#232;res. 
</p>
<p>&#201;tape 2 &#8211; Extraction de termes 
</p>
<p>TerminoWeb permet l&#8217;extraction de termes en utilisant un algorithme inspir&#233; de Smadja 
(1993).  L&#8217;extraction peut se faire sur diff&#233;rents sous-ensembles de documents d&#8217;un corpus 
&#233;tabli (le sous-ensemble de documents de statut &#171; Accepted &#187; par exemple). Dans l&#8217;exemple 
de l&#8217;exploitation du diamant, &#233;mergeront les termes: alluvial diamond (12), artisanal diamond 
mining (4), deposits (80), diamond deposits (20), diamond mine (67), extraction (14), gem 
</p>
<p>(168), gravel (29), kimberlite (65), lamproite (13), mining technology (5), open-cast mining 
</p>
<p>(4), open-pit (9), ore (427), placer diamond deposits (2), terrace gravels (3).  La fr&#233;quence de 
</p>
<p>chaque terme mise entre parenth&#232;ses est calcul&#233;e sur le corpus entier.  
</p>
<p>&#201;tape 3 &#8211; Recherche de contextes d&#233;finitionnels 
</p>
<p> 
</p>
<p>Figure 2 &#8211; contextes d&#233;finitionnels pour les termes kimberlite(s) et kimberlite pipes 
</p>
<p>TerminoWeb recherche des contextes potentiellement d&#233;finitionnels contenant, en proximit&#233; 
</p>
<p>des termes &#224; l&#8217;&#233;tude, des patrons de connaissances pr&#233;alablement d&#233;finis et encod&#233;s dans le 
logiciel.  Nous disons &#171; potentiellement d&#233;finitionnels &#187; pour deux raisons : (1) les patrons 
</p>
<p>                                                 
2
 Yahoo! fournit une interface de programmation  Java  pour l&#8217;utilisation de l&#8217;engin &#8220;Yahoo Search Engine&#8221; &#224; des 
</p>
<p>fins de recherche.  Cette interface est appel&#233;e &#224; partir du logiciel TerminoWeb. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Caroline Barri&#232;re 
</p>
<p>&#233;tant parfois bruit&#233;s, leur pr&#233;sence ne sera pas toujours indicative de la relation d&#233;sir&#233;e et (2) 
</p>
<p>la proximit&#233; entre un terme et un patron n&#8217;assure pas d&#8217;une relation entre eux.  Malgr&#233; le bruit, 
nous pr&#233;f&#233;rons tout de m&#234;me la simplicit&#233; de la proximit&#233; &#224; la complexit&#233; d&#8217;une analyse 
syntaxique qui rendrait le traitement d&#233;pendant de la langue (et non sans bruit lui-m&#234;me).  
</p>
<p>La figure 2 montre des contextes pour le th&#232;me de l&#8217;exploitation du diamant dans lequel les 
termes kimberlite(s) et kimberlite pipes seraient nouveaux pour le langagier.  Chaque contexte 
</p>
<p>peut &#234;tre &#233;largi (Figure 3), et un lien permet de retourner &#224; la page Web d&#8217;o&#249; vient la phrase.   
</p>
<p> 
</p>
<p>Figure 3 &#8211; Exemple d&#8217;un contexte d&#233;finitionnel plus &#233;tendu 
</p>
<p>Conclusion 
</p>
<p>Les trois modules principaux de la plateforme TerminoWeb ont &#233;t&#233; bri&#232;vement d&#233;crits.  Cette 
</p>
<p>plateforme permet non seulement de chercher sur le Web des documents informatifs sur un 
</p>
<p>th&#232;me &#224; explorer, mais aussi de cibler les segments d&#233;finitionnels dans ces documents pour 
</p>
<p>permettre au langagier d&#8217;acc&#233;der plus rapidement &#224; l&#8217;information pertinente et ainsi favoriser 
sa compr&#233;hension du domaine. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BARRI&#200;RE, C., AGBAGO, A. (2006). TerminoWeb: a software environment for term study in 
</p>
<p>rich contexts. Proceedings of the International Conference on Terminology, 
</p>
<p>Standardization and Technology Transfer, Beijing, 103-113. 
</p>
<p>BARRI&#200;RE, C. (2009a). The Web as a source of informative background knowledge, 
</p>
<p>Proccedings of the Workshop &#8220;Beyond Translation Memories: New Tools for Translators&#8221;, 
MT Summit 2009, Ottawa, Canada. 
</p>
<p>BARRI&#200;RE, C. (2009b). Finding domain specific collocations and concordances on the Web, 
</p>
<p>Proceedings of the Workshop &#8220;Natural Language Processing methods and corpora in 
translation, lexicography and language learning&#8221;, RANLP&#8217;2009, Borovets, Bulgaria. 
</p>
<p>MEYER, I. (2001). Extracting knowledge-rich contexts for terminography, in D. Bourigault, C. 
</p>
<p>Jacquemin, L'Homme M.C. (eds) Recent Advances in Computational Terminology, chapter 
</p>
<p>14, John Benjamins. 
</p>
<p>SMADJA F. (1993) Retrieving collocations from text: Xtract. Computational Linguistics 7(4): 
</p>
<p>143-177. </p>

</div></div>
</body></html>