<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Anatomie des structures &#233;num&#233;ratives</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Anatomie des structures &#233;num&#233;ratives
</p>
<p>Lydia-Mai Ho-Dac1 Marie-Paule P&#233;ry-Woodley2 Ludovic Tanguy2
(1) VALIBEL, UCL et FNRS
</p>
<p>(2) CLLE-ERSS, Universit&#233; de Toulouse
lydia.ho-dac@uclouvain.be, pery@univ-tlse2.fr, tanguy@univ-tlse2.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente les premiers r&#233;sultats d&#8217;une campagne d&#8217;annotation de corpus &#224; grande
&#233;chelle r&#233;alis&#233;e dans le cadre du projet ANNODIS. Ces r&#233;sultats concernent la partie descendante du dis-
positif d&#8217;annotation, et plus sp&#233;cifiquement les structures &#233;num&#233;ratives. Nous nous int&#233;ressons &#224; la struc-
turation &#233;num&#233;rative en tant que strat&#233;gie de base de mise en texte, apparaissant &#224; diff&#233;rents niveaux de
granularit&#233;, associ&#233;e &#224; diff&#233;rentes fonctions discursives, et signal&#233;e par des indices divers. Avant l&#8217;annota-
tion manuelle, une &#233;tape de pr&#233;-traitement a permis d&#8217;obtenir le marquage syst&#233;matique de traits associ&#233;s
&#224; la signalisation de l&#8217;organisation du discours. Nous d&#233;crivons cette &#233;tape de marquage automatique, ainsi
que la proc&#233;dure d&#8217;annotation. Nous proposons ensuite une premi&#232;re typologie des structures &#233;num&#233;ratives
bas&#233;e sur la description quantitative des donn&#233;es annot&#233;es manuellement, prenant en compte la couverture
textuelle, la composition et les types d&#8217;indices.
Abstract. This paper presents initial results from a large scale discourse annotation project, the
ANNODIS project. These results concern the top-down part of the annotation scheme, and more specif-
ically enumerative structures. We are interested in enumerative structures as a basic text construction
strategy, occurring at different levels of granularity, associated with various discourse functions, and sig-
nalled by a broad range of cues. Before manual annotation via a purpose-built interface, a pre-processing
phase produced a systematic mark-up of features associated to the signalling of discourse organisation. We
describe this markup phase and the annotation procedure. We then propose a first typology of enumerative
structures based on a quantitative description of the manually annotated data, taking into account textual
coverage, composition, types of cues.
Mots-cl&#233;s : Annotation de corpus, organisation du discours, structure &#233;num&#233;rative, signalisation.
Keywords: Corpus annotation, discourse organisation, enumerative structure, signalling text struc-
tures.
</p>
<p>1 ANNODIS : Annotations discursives
</p>
<p>1.1 Le projet ANNODIS
Le projet ANNODIS1 vise la constitution d&#8217;un corpus de fran&#231;ais &#233;crit enrichi d&#8217;annotations concernant
le niveau discursif. Tout en se situant dans le sillage de projets d&#8217;annotation de relations et structures
de discours pour l&#8217;anglais &#8211; e.g. Penn Discourse Treebank (Prasad et al., 2006) &#8211; il s&#8217;en d&#233;marque sur
plusieurs points : sa principale originalit&#233; est d&#8217;aborder l&#8217;organisation discursive &#224; partir de deux ap-
proches compl&#233;mentaires &#8211; ascendante et descendante ; deuxi&#232;mement, les annotations s&#8217;appliquent &#224; un
</p>
<p>1Projet financ&#233; pour 3 ans par l&#8217;ANR Programme Sciences Humaines et Sociales, appel 2007 Corpus et outils de la recherche
en sciences humaines et sociales : http ://w3.erss.univ-tlse2.fr/annodis.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HO-DAC, P&#201;RY-WOODLEY, TANGUY
</p>
<p>corpus diversifi&#233; pour permettre la prise en compte de r&#233;alisations discursives vari&#233;es ; ce corpus fait l&#8217;ob-
jet de pr&#233;-traitements automatiques pour guider les annotations ; enfin, le d&#233;veloppement d&#8217;outils d&#8217;aide
&#224; l&#8217;annotation et &#224; la navigation constitue un objectif majeur du projet. Cet article expose exclusivement
l&#8217;approche descendante de ce projet, offrant une premi&#232;re analyse des r&#233;sultats de la campagne d&#8217;annota-
tion des structures discursives de haut niveau2.
</p>
<p>1.2 Annoter des structures discursives multi-&#233;chelle
L&#8217;approche &#171; descendante &#187; du projet ANNODIS a pour objectif l&#8217;identification d&#8217;indices de surface sig-
nalant une segmentation &#224; diff&#233;rents niveaux de grain. Ces segments, qui vont du paragraphe au texte
entier, sont envisag&#233;s en relation avec une organisation fonctionnelle : segmentation rh&#233;torique, th&#233;ma-
tique ou selon diff&#233;rents axes s&#233;mantiques (temporalit&#233;, spatialit&#233;, points de vue, etc.). L&#8217;approche que
nous d&#233;veloppons pr&#233;sente les caract&#233;ristiques suivantes :
&#8211; elle consiste &#224; aborder le texte d&#8217;un point de vue global, &#224; partir de l&#8217;hypoth&#232;se que la prise en compte
</p>
<p>des structures de haut niveau a un impact sur l&#8217;interpr&#233;tation locale du texte ;
&#8211; elle adopte des m&#233;thodes de linguistique de corpus, ce qui implique de se donner les moyens d&#8217;ana-
</p>
<p>lyser un volume cons&#233;quent de textes et d&#8217;annoter un nombre de structures suffisant pour proposer des
g&#233;n&#233;ralisations ;
</p>
<p>&#8211; pour ce faire, elle fait appel &#224; des techniques issues du traitement automatique des langues permettant
d&#8217;effectuer un pr&#233;-marquage automatique des textes, afin de guider l&#8217;annotation manuelle des struc-
tures ;
</p>
<p>&#8211; elle s&#8217;int&#233;resse &#224; des textes longs non-narratifs, qui ne peuvent se contenter de la seule structuration
autour d&#8217;un r&#233;f&#233;rent principal, et o&#249; diff&#233;rents modes de structuration sont susceptibles d&#8217;&#234;tre sollicit&#233;s
et signal&#233;s (y compris la structuration dite &#171; logique &#187;, cf. &#171; document structure &#187; (Power et al., 2003)).
</p>
<p>Les structures discursives recherch&#233;es se caract&#233;risant par leur capacit&#233; &#224; &#234;tre per&#231;ues avant l&#8217;interpr&#233;tation
du contenu propositionnel qu&#8217;elles organisent, le r&#244;le de la signalisation &#224; la surface du texte est primor-
dial. De fait, l&#8217;existence m&#234;me des structures recherch&#233;es ne se con&#231;oit pas en dehors des indices visuels
ou lexicaux qui participent &#224; leur signalisation. Selon cette approche, la perception de l&#8217;organisation du
discours r&#233;sulte d&#8217;une interaction entre des patrons textuels de haut niveau et le contenu propositionnel.
Prenons par exemple un titre de section annon&#231;ant l&#8217;&#233;volution de X, suivi de titres de sous-sections lo-
calisant les diff&#233;rentes &#233;tapes de l&#8217;&#233;volution en question : cet ensemble constitue un patron textuel de
haut niveau signalant une organisation globale de la section autour de la dimension temporelle, les sous-
sections &#233;tant en discontinuit&#233; temporelle les unes par rapport aux autres et en continuit&#233; du point de vue
th&#233;matique et du point de vue &#171; textuel &#187; (appartenant &#224; une m&#234;me section).
Ce type de patron textuel est relativement difficile &#224; rep&#233;rer d&#232;s lors que l&#8217;on cherche &#224; d&#233;crire des struc-
tures ind&#233;pendantes du d&#233;coupage visuel. Il peut cependant se r&#233;aliser ind&#233;pendamment de tout alignement
sur la structure visuelle du document. Notre premier d&#233;fi a donc &#233;t&#233; de d&#233;finir une structure &#171; annotable &#187;
permettant de couvrir les m&#234;mes strat&#233;gies organisationnelles que celles observables entre (sous-)sections
i.e. des structures discursives construites &#224; la fois selon (1) une continuit&#233; th&#233;matique autour d&#8217;un crit&#232;re
X (un r&#233;f&#233;rent, une th&#233;matique, une entit&#233; spatiale-temporelle, un raisonnement, etc.), et (2) des disconti-
nuit&#233;s internes relatives &#224; un type de trait associable &#224; X (diff&#233;rents sous-th&#232;mes, propri&#233;t&#233;s, localisations
spatio-temporelles, diff&#233;rents points de vue, diff&#233;rentes &#233;tapes de construction, de raisonnement, etc.). La
structure &#233;num&#233;rative (ci-apr&#232;s SE) est rapidement apparue comme la structure id&#233;ale pour orienter et
</p>
<p>2Voir P&#233;ry-Woodley et al. (2009) pour une vue d&#8217;ensemble du projet et une pr&#233;sentation de l&#8217;approche ascendante qui vise
l&#8217;annotation des relations de discours entre unit&#233;s &#233;l&#233;mentaires de discours.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANATOMIE DES STRUCTURES &#201;NUM&#201;RATIVES
</p>
<p>mod&#233;liser l&#8217;annotation de ce type d&#8217;organisation.
</p>
<p>1.3 Les structures &#233;num&#233;ratives
La structuration &#233;num&#233;rative constitue un acte textuel fondamental qui consiste &#224; rassembler des &#233;l&#233;ments
dans un m&#234;me objet textuel en fonction d&#8217;une identit&#233; de statut. La structure &#233;num&#233;rative consiste ainsi &#224;
&#171; transposer textuellement la co&#233;num&#233;rabilit&#233; des entit&#233;s recens&#233;es par la co&#233;num&#233;rabilit&#233; des segments
linguistiques qui les d&#233;crivent, ceux-ci devenant les entit&#233;s constitutives de l&#8217;&#233;num&#233;ration (les items).
L&#8217;identit&#233; de statut des constituants au sein de l&#8217;&#233;num&#233;ration exprime l&#8217;identit&#233; de statut des entit&#233;s re-
cens&#233;es dans le monde (cette identit&#233; &#233;tant, dans les deux cas, la co&#233;num&#233;rabilit&#233;). &#187; (Luc et al., 2000, p
.25).
Une SE se compose n&#233;cessairement d&#8217;une &#233;num&#233;ration (succession d&#8217;items) entour&#233;e optionnellement
d&#8217;une amorce et d&#8217;une cl&#244;ture. Chaque item a ceci de caract&#233;ristique qu&#8217;il constitue un segment ho-
mog&#232;ne (i.e. une continuit&#233;) relativement &#224; un certain crit&#232;re d&#8217;interpr&#233;tation tout en se d&#233;finissant par
son appartenance &#224; un ensemble de segments entretenant explicitement une relation d&#8217;identit&#233; de statut.
Cette identit&#233; rel&#232;ve conjointement des niveaux textuel et propositionnel. Ainsi, les unit&#233;s co-&#233;num&#233;r&#233;es
apparaissent dans une relation d&#8217;&#233;galit&#233; vis-&#224;-vis d&#8217;un crit&#232;re X que nous appelons l&#8217;&#233;num&#233;raTh&#232;me.
Cet &#233;num&#233;raTh&#232;me correspond &#224; une entit&#233; hi&#233;rarchiquement sup&#233;rieure aux items, permettant de rassem-
bler les co-items sous un m&#234;me &#171; label &#187;. Si l&#8217;interpr&#233;tation de toute SE passe par l&#8217;identification d&#8217;un
&#233;num&#233;raTh&#232;me, celui-ci n&#8217;a pas besoin d&#8217;&#234;tre r&#233;alis&#233; explicitement pour exister, pouvant &#234;tre inf&#233;r&#233; &#224;
partir du contenu des items de l&#8217;&#233;num&#233;ration (Bras et al., 2008, p. 1960).
La figure 1 pr&#233;sente un exemple de plusieurs SE ench&#226;ss&#233;es dans une SE globale couvrant toute une section
de haut niveau. Les vues sont prises sur les lieux de l&#8217;annotation : l&#8217;interface GLOZZ (voir section 2.2).
Sur la gauche figurent le texte de la SE globale et le d&#233;tail de ses composants ; sur la droite sont d&#233;taill&#233;es
3 SE dans lesquelles les composants ont &#233;t&#233; surlign&#233;s (items en jaune et amorce/cl&#244;ture en rose/orange).
Dans cette figure, seules deux SE (surlign&#233;es en jaune dans le texte d&#233;zoom&#233;) correspondent &#224; l&#8217;id&#233;e
g&#233;n&#233;rale des SE, i.e. une liste format&#233;e. Le d&#233;tail de la premi&#232;re SE format&#233;e montre une amorce (Ces
&#233;l&#233;ments sont), 5 items puc&#233;s et une cl&#244;ture pr&#233;sentant une deuxi&#232;me expression de l&#8217;&#233;num&#233;raTh&#232;me (Ces
&#233;l&#233;ments se sont renforc&#233;s...). La SE la plus &#224; droite de la figure est &#233;galement une SE compl&#232;te i.e. compor-
tant une amorce ( Par ailleurs, une guerre contre l&#8217;Irak pouvait se faire selon trois sc&#233;narios.), trois items,
une cl&#244;ture (De fait, la premi&#232;re option semblait &#234;tre la seule...) et une expression de l&#8217;&#233;num&#233;raTh&#232;me
(trois sc&#233;narios). Ces deux SE, l&#8217;une &#224; cheval sur deux paragraphes, l&#8217;autre non format&#233;e couvrant un
paragraphe entier, montrent bien la vari&#233;t&#233; et la non sp&#233;cificit&#233; des indices pouvant signaler une SE : titres,
puces, expressions d&#233;tach&#233;es (adverbiaux circonstanciels e.g. Depuis quelques ann&#233;es, ou connecteurs e.g.
Enfin, De fait), expressions &#233;num&#233;rantes (Le premier, La derni&#232;re, etc.).
Comme le montre l&#8217;exemple de la figure 1, les SE ne se r&#233;duisent pas &#224; une simple question de for-
matage : la multiplicit&#233; de leurs r&#233;alisations (listes format&#233;es, d&#233;coupage en sections, en paragraphes,
listes &#171; plates &#187; sans alignement paragraphique) et de leurs r&#244;les fonctionnels (progressions th&#233;matiques,
segmentation spatio-temporelles, articulations rh&#233;toriques, etc.) en fait un bon point d&#8217;entr&#233;e dans la com-
plexit&#233; de l&#8217;organisation discursive. &#192; cette multiplicit&#233; s&#8217;associe une complexit&#233; de signalisation qui ne
peut &#234;tre pens&#233;e qu&#8217;en termes de faisceaux d&#8217;indices diversifi&#233;s, &#224; la fois lexicaux, syntaxiques et visuels
et non en termes de marqueurs lexicaux d&#233;di&#233;s (P&#233;ry-Woodley, 2005).
L&#8217;annotation des structures &#233;num&#233;ratives va nous permettre dans un premier temps d&#8217;&#233;valuer 4 de leurs
propri&#233;t&#233;s :
</p>
<p>1. les textes, surtout de type expositif, font fortement appel &#224; une organisation en SE ;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HO-DAC, P&#201;RY-WOODLEY, TANGUY
</p>
<p>FIG. 1 &#8211; Exemple de structures &#233;num&#233;ratives
</p>
<p>2. les SE sont pr&#233;sentes &#224; diff&#233;rents niveaux de grain, du tr&#232;s global (tout un chapitre ou section) au
local (quelques propositions) ;
</p>
<p>3. ce mode de structuration est associ&#233; &#224; une grande vari&#233;t&#233; de patrons textuels : du d&#233;coupage en
sections aux patrons d&#8217;amorce et s&#233;quences de marqueurs d&#8217;items en passant par les listes format&#233;es ;
</p>
<p>4. ce mode de structuration est ais&#233;ment identifiable par le lecteur (Turco &amp; Coltier, 1988, p. 57) et
donc l&#8217;annotateur.
</p>
<p>2 Campagne d&#8217;annotation
</p>
<p>2.1 Corpus ANNODIS : un corpus diversifi&#233; et pr&#233;par&#233;
Le corpus ANNODIS est un corpus diversifi&#233; constitu&#233; de textes longs de type expositif pr&#233;sentant une
structure visuelle relativement &#233;labor&#233;e. Le choix de textes longs de type expositif vise &#224; assurer la
pr&#233;sence de structures de haut niveau relativement complexes et signal&#233;es &#224; la surface du texte (voir &#167; 1.2).
La diversit&#233; du corpus nous permet de mesurer la sensibilit&#233; des SE &#224; diff&#233;rents usages textuels repr&#233;sent&#233;s
ici par trois sous-corpus :
&#8211; WIKI (199 858 mots) : 25 articles longs issus de l&#8217;encyclop&#233;die Wikipedia3 ;
&#8211; GEOPO (181 414 mots) : 31 articles plut&#244;t pol&#233;miques traitant de g&#233;opolitique et publi&#233;s par l&#8217;IFRI4 ;
&#8211; CMLF (133 515 mots) : 30 articles scientifiques issus des actes du premier Colloque Mondial de Lin-
</p>
<p>guistique Fran&#231;aise (CMLF 2008).
3fr.wikipedia.org.
4Institut Fran&#231;ais des Relations Internationales, www.ifri.org.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANATOMIE DES STRUCTURES &#201;NUM&#201;RATIVES
</p>
<p>Enfin, la pr&#233;sence d&#8217;une structure visuelle relativement &#233;labor&#233;e et pr&#233;serv&#233;e permet la prise en compte
d&#8217;&#233;l&#233;ments typodispositionnels jouant un r&#244;le &#233;vident dans la signalisation de l&#8217;organisation du discours
(cf. Power et al. (2003)).
La proc&#233;dure d&#8217;annotation manuelle est guid&#233;e par un pr&#233;marquage automatique de traits qui s&#8217;appuie
sur la structure de document et sur les sorties d&#8217;un &#233;tiquetage morpho-syntaxique (TreeTagger) et d&#8217;une
analyse syntaxique (SYNTEX, Bourigault (2007)). Les &#233;l&#233;ments pr&#233;marqu&#233;s correspondent &#224; la fois &#224; :
&#8211; des expressions associ&#233;es dans la litt&#233;rature aux SE : expressions &#233;num&#233;rantes (s&#233;quenceurs tels que
</p>
<p>premi&#232;rement, en second lieu, un troisi&#232;me X, d&#8217;une part, etc. d&#233;crits par (Turco &amp; Coltier, 1988), (Jack-
iewicz, 2005) et (Porhiel, 2007) entre autres, auxquels viennent s&#8217;ajouter certains connecteurs comme
d&#8217;abord, ensuite, enfin, finalement &#233;tudi&#233;s par (Bras et al., 2008)) ; &#233;l&#233;ments d&#8217;amorce (expressions in-
d&#233;finies plurielles ou &quot;prospectives&quot; e.g. selon plusieurs X, les X suivants) et de cl&#244;ture (encapsulations
e.g. ces trois sc&#233;narios/de telles propri&#233;t&#233;s et connecteurs conclusifs e.g. En conclusion)
</p>
<p>&#8211; des &#233;l&#233;ments participant de fa&#231;on plus g&#233;n&#233;rale &#224; la signalisation de l&#8217;organisation du discours : circon-
stants d&#233;tach&#233;s en initiale, expressions co-r&#233;f&#233;rentielles en position sujet et autres &#233;l&#233;ments d&#233;tach&#233;s en
initiale &#8211; e.g. tout connecteur, apposition, modalit&#233;, etc.
</p>
<p>&#8211; des patrons ponctuationnels et typo-dispositionnels (listes format&#233;es, patrons de type [...] : [...] ; [...]
et/ou [...]).
</p>
<p>Le pr&#233;marquage de ces &#233;l&#233;ments a un double int&#233;r&#234;t : (1) offrir &#224; l&#8217;annotateur la possibilit&#233; de se d&#233;-
gager d&#8217;une lecture lin&#233;aire pour aborder le texte avec plus de hauteur, en naviguant entre zones riches
en &#233;l&#233;ments pr&#233;marqu&#233;s ; (2) conduire l&#8217;annotateur &#224; prendre conscience de l&#8217;existence d&#8217;&#233;l&#233;ments pou-
vant signaler les structures recherch&#233;es (Ho-Dac et al., 2009), &#233;l&#233;ments qui pourront ensuite &#234;tre associ&#233;s
au statut d&#8217;indice de SE. En plus de ce marquage automatique, la structure visuelle du document est re-
transcrite dans l&#8217;interface d&#8217;annotation telle qu&#8217;elle appara&#238;t habituellement dans ce type de documents.
L&#8217;annotation manuelle peut ainsi se baser sur des traits typo-dispositionnels (titres, paragraphes, listes
format&#233;es) et lexico-syntaxiques.
</p>
<p>2.2 Protocole d&#8217;annotation
</p>
<p>La campagne d&#8217;annotation s&#8217;effectue gr&#226;ce &#224; l&#8217;interface GLOZZ cr&#233;&#233;e dans le cadre du projet ANNODIS
(Mathet &amp; Widl&#246;cher, 2009). GLOZZ permet de charger des textes enrichis d&#8217;annotations ou de pr&#233;mar-
quage pr&#233;alable. Gr&#226;ce &#224; une &#171; double vue &#187; du texte, l&#8217;annotateur peut alterner une approche locale
classique et une approche globale qui pr&#233;sente le texte &#171; de haut &#187;, lui permettant de visualiser rapidement
les diff&#233;rentes mises en forme mat&#233;rielles, les &#233;l&#233;ments pr&#233;marqu&#233;s et les annotations r&#233;alis&#233;es.
La proc&#233;dure d&#8217;annotation est guid&#233;e par un manuel d&#8217;annotation qui d&#233;finit et illustre chaque type d&#8217;unit&#233;
&#224; annoter et les indices qui peuvent y &#234;tre associ&#233;s. L&#8217;annotateur, apr&#232;s avoir lu enti&#232;rement le manuel
d&#8217;annotation, charge dans l&#8217;interface GLOZZ le texte enrichi, le mod&#232;le d&#8217;annotation relatif aux SE et les
feuilles de styles permettant de colorer les &#233;l&#233;ments pr&#233;marqu&#233;s. Il se met ensuite &#224; &#171; scanner &#187; le texte
&#224; la recherche de zones de concentration d&#8217;&#233;l&#233;ments pr&#233;marqu&#233;s pour, dans un second temps, d&#233;limiter
pr&#233;cis&#233;ment les segments par une lecture plus ou moins fine et associer aux SE rep&#233;r&#233;es les indices qui la
signalent. Ces indices correspondent soit &#224; un &#233;l&#233;ment pr&#233;marqu&#233; soit &#224; une nouvelle unit&#233;.
L&#8217;annotation distingue deux types d&#8217;objets : les &#171; unit&#233;s &#187; (amorce, item, cl&#244;ture, &#233;num&#233;raTh&#232;me, indice)
et les &#171; sch&#233;mas &#187; (SE) qui rassemblent plusieurs unit&#233;s. Les &#233;l&#233;ments issus de la structure visuelle ainsi
que les &#233;l&#233;ments pr&#233;marqu&#233;s ont &#233;galement le statut d&#8217;unit&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HO-DAC, P&#201;RY-WOODLEY, TANGUY
</p>
<p>2.3 Accord inter-annotateurs
</p>
<p>Trois annotateurs &#233;tudiants en sciences du langage (niveau master) ont particip&#233; &#224; la campagne d&#8217;anno-
tation qui a dur&#233; 2 mois, de d&#233;but septembre 2009 &#224; fin octobre 20095. La pr&#233;sente &#233;tude s&#8217;appuie sur
65 textes annot&#233;s dont 9 avec une annotation multiple. Ces derniers nous ont permis de mesurer l&#8217;accord
inter-annotateurs sur un total de 361 SE annot&#233;es (108+125+128). S&#8217;agissant d&#8217;une phase de s&#233;lection et
non de cat&#233;gorisation nous avons calcul&#233; la F-mesure pour comparer les SE identifi&#233;es par chacun des an-
notateurs. Sont consid&#233;r&#233;es comme appari&#233;es deux SE couvrant la m&#234;me zone du texte (avec une variation
de quelques caract&#232;res au d&#233;but et &#224; la fin) et poss&#233;dant les m&#234;mes &#233;l&#233;ments structurants (amorce, items,
cl&#244;ture6). Sur l&#8217;ensemble des 9 textes, le taux d&#8217;accord moyen est de 0,7. &#201;tant donn&#233; la complexit&#233; de la
t&#226;che, ce score est tout &#224; fait encourageant et montre la stabilit&#233; des ph&#233;nom&#232;nes vis&#233;s par cette phase du
projet.
Pour les 56 textes qui n&#8217;ont re&#231;u qu&#8217;une seule annotation, nous avons mesur&#233; la variation des principales
caract&#233;ristiques des SE (voir section suivante) entre les annotateurs (via des analyses de variance et des
tests du &#967;2). Aucune de ces caract&#233;ristiques n&#8217;est significativement li&#233;e &#224; l&#8217;annotateur, ce qui renforce
notre conclusion sur la stabilit&#233; de l&#8217;objet SE jusque dans ses aspects les plus fins.
</p>
<p>3 Analyse des annotations
</p>
<p>3.1 Premier inventaire
</p>
<p>Si l&#8217;on dresse un simple inventaire des annotations effectu&#233;es sur les 56 textes qui n&#8217;ont re&#231;u qu&#8217;une seule
annotation, les principales conclusions sont les suivantes :
&#8211; sur nos 56 textes, les annotateurs ont identifi&#233; un total de 708 SE ;
&#8211; tout texte, quel que soit le sous-corpus, contient des SE. Le nombre de SE par texte varie de 3 &#224; 34, avec
</p>
<p>une moyenne de 12,6 SE par texte ;
&#8211; la fr&#233;quence relative est de 16 SE pour 10 000 mots ;
&#8211; les SEs recouvrent une part importante des textes, avec une moyenne de 46% du texte compris dans au
</p>
<p>moins une SE7. Pour certains textes, ce taux atteint 92%.
Ces premi&#232;res observations montrent donc que les SE ne sont ni marginales, ni sporadiques, ni r&#233;serv&#233;es
&#224; un genre particulier.
</p>
<p>3.2 Taille, cardinalit&#233;, composition et niveau de grain des SE
Quatre caract&#233;ristiques des SE sont distingu&#233;es : leur taille (en nombre de mots), leur cardinalit&#233; (en
nombre d&#8217;items), leur composition (pr&#233;sence des &#233;l&#233;ments optionnels) et leur niveau de grain (interaction
avec la structure du document). On va ici examiner leurs variations et tester leur d&#233;pendance mutuelle.
Les SE apparaissent tout de suite comme des structures pr&#233;sentant des tailles tr&#232;s vari&#233;es : le nombre
de mots que recouvre une SE varie de 8 &#224; 8000 (suivant une distribution de type log-normal) avec une
moyenne aux alentours de 400 mots (voir la figure 2).
</p>
<p>5Ces trois annotateurs pouvaient &#224; tout moment partager leurs impressions sur la t&#226;che d&#8217;annotation.
6La pr&#233;sence d&#8217;un &#233;num&#233;raTh&#232;me explicite n&#8217;a pas &#233;t&#233; prise en compte pour mesurer l&#8217;accord.
7Les SE pouvant &#234;tre ench&#226;ss&#233;es, certaines zones du texte sont m&#234;me couvertes par plusieurs SE, mais cet aspect n&#8217;a pas
</p>
<p>&#233;t&#233; pris en compte dans le calcul.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANATOMIE DES STRUCTURES &#201;NUM&#201;RATIVES
</p>
<p>La cardinalit&#233; des SE pr&#233;sente, elle, moins de variation : le nombre d&#8217;items (seules unit&#233;s obligatoires)
varie de 2 &#224; 48, avec une moyenne de 3,4 items par SE. Malgr&#233; 4 monstres8 de plus de 15 items, la majorit&#233;
des SE comporte entre 2 et 5 items avec une forte proportion d&#8217;&#233;num&#233;rations &#224; 2 items.
</p>
<p>&lt;50
</p>
<p>50&#8722;100
</p>
<p>100&#8722;200
</p>
<p>200&#8722;500
500&#8722;2000
</p>
<p>&gt;2000
</p>
<p>Nombre de mots
</p>
<p>2
</p>
<p>3&#8722;5
</p>
<p>&gt;5
</p>
<p>Nombre d&#8217;items
</p>
<p>FIG. 2 &#8211; R&#233;partition des SE par taille (nombre de mots) et cardinalit&#233; (nombre d&#8217;items)
</p>
<p>Il n&#8217;appara&#238;t qu&#8217;une corr&#233;lation faiblement positive (r = 0,14) entre le nombre d&#8217;items et le nombre de
mots : ces deux caract&#233;ristiques sont relativement ind&#233;pendantes.
La composition d&#8217;une SE correspond &#224; la pr&#233;sence des &#233;l&#233;ments optionnels que sont l&#8217;amorce et la cl&#244;ture,
et montre clairement des variations sur l&#8217;ensemble de la population : 75% des SE ont une amorce, et 13%
une cl&#244;ture.
L&#224; aussi, aucune variation statistiquement significative n&#8217;appara&#238;t entre le nombre de mots et la pr&#233;sence
(ou absence) d&#8217;une amorce ou d&#8217;une cl&#244;ture, ni entre la composition et le nombre d&#8217;items.
Si l&#8217;on observe maintenant le niveau de grain des SE, mesur&#233; par rapport &#224; leur interaction avec la
structure visuelle du document, une grande vari&#233;t&#233; appara&#238;t. Notre premi&#232;re approximation s&#8217;appuie sur
trois crit&#232;res :
&#8211; le nombre de paragraphes sur lesquels s&#8217;&#233;tend (au moins en partie) une SE ;
&#8211; l&#8217;alignement ou non des items avec des titres de section ;
&#8211; l&#8217;alignement ou non des items avec ceux d&#8217;une liste format&#233;e.
Le nombre de paragraphes sur lesquels une SE s&#8217;&#233;tend varie de 1 &#224; 72, avec une moyenne de 4 paragraphes.
Seules 37% des SE se situent &#224; l&#8217;int&#233;rieur d&#8217;un unique paragraphe (grain minimal). A l&#8217;inverse, 13% des
SE sont align&#233;es sur un d&#233;coupage du texte en sections (grain maximal), c&#8217;est-&#224;-dire que leurs items sont
des sections titr&#233;es, et plus du quart correspondent &#224; des listes format&#233;es (26,2%).
Des tests statistiques simples (&#967;2 et test de Student) permettent de mettre en &#233;vidence les liaisons suivantes
entre ces niveaux de grain et les autres caract&#233;ristiques d&#8217;une SE :
&#8211; le nombre de mots varie &#233;videmment avec le niveau de grain (p &lt;10-12) : les SE align&#233;es sur les sections
</p>
<p>sont les plus longues, les listes format&#233;es sont plus courtes que la moyenne, et pour les autres la taille
est proportionnelle au nombre de paragraphes ;
</p>
<p>&#8211; les SE align&#233;es sur les sections ont plus d&#8217;items que les autres (p &lt; 0,01), plus souvent une amorce
(p &lt; 0,001), mais moins souvent une cl&#244;ture (p &lt; 0,01) ;
</p>
<p>&#8211; les SE format&#233;es en listes pr&#233;sentent plus d&#8217;items (p &lt; 0,01) et plus souvent une amorce (p &lt; 10-12) ;
&#8211; le nombre de paragraphes est significativement plus important pour les SE sans cl&#244;ture que pour celles
</p>
<p>qui en ont une (p &lt; 10-5).
Il semble donc que le niveau de grain, qui pr&#233;sente une r&#233;partition assez &#233;quilibr&#233;e des SE de notre cor-
pus, soit la propri&#233;t&#233; qui poss&#232;de la plus forte liaison avec les autres caract&#233;ristiques (taille, cardinalit&#233;,
composition). C&#8217;est donc sur lui que va se baser notre premi&#232;re typologie des structures &#233;num&#233;ratives.
</p>
<p>8La SE de 48 items correspond &#224; une longue liste relatant toutes les &#233;tapes du scandale du Watergate, article Wikipedia.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HO-DAC, P&#201;RY-WOODLEY, TANGUY
</p>
<p>3.3 Typologie des SE
Notre proposition de typologie, bas&#233;e sur le niveau de grain des SE, est la suivante :
&#8211; Type 1 : dont les items correspondent &#224; des sections titr&#233;es (93 SE, 13,1%) ;
&#8211; Type 2 : dont les items correspondent &#224; des listes format&#233;es (186 SE, 26,3%) ;
&#8211; Type 3 : couvrant plus d&#8217;un paragraphe sans marques visuelles sp&#233;cifiques (164 SE, 23,2%) ;
&#8211; Type 4 : intra-paragraphiques (265 SE, 37,4%).
Cette typologie &#233;tablie, nous pouvons maintenant nous int&#233;resser aux fonctionnements des autres carac-
t&#233;ristiques des SE : les &#233;num&#233;raTh&#232;mes et les indices.
Pour les &#233;num&#233;raTh&#232;mes, les SE de type 1 en comportent significativement moins souvent que les autres
(p &lt; 10-7). En effet, pour ces SE les titres de sections sp&#233;cifient le crit&#232;re de co&#233;num&#233;rabilit&#233; des diff&#233;rents
items. &#192; l&#8217;inverse, celles de type 2 en comportent plus souvent (p &lt; 10-6). Le type 2 appara&#238;t alors comme
une sorte d&#8217;alternative plus locale au type 1 : le titre de section y &#233;tant remplac&#233; par une puce ou un
symbole qui n&#8217;a pas la capacit&#233; d&#8217;exprimer le crit&#232;re de co&#233;num&#233;rabilit&#233; des items, ce second type requiert
davantage l&#8217;expression explicite de l&#8217;&#233;num&#233;raTh&#232;me.
Concernant les autres types de SE, il semble que leur sp&#233;cification se fasse de fa&#231;on moins affich&#233;e (&#224;
l&#8217;image du saut de paragraphe qui ne signale rien d&#8217;autre qu&#8217;un acte de segmentation). Il nous faut alors
regarder les indices qui ont &#233;t&#233; associ&#233;s &#224; ces SE pour trouver une indication quant &#224; leur construction.
Pour cela, nous concentrons notre analyse sur les indices trouv&#233;s en initiale d&#8217;items, consid&#233;r&#233;s comme
des alternatives lexico-syntaxiques aux titres et puces des SE de type 1 et 2. Au total, 3 225 indices ont &#233;t&#233;
ainsi associ&#233;s &#224; une SE : 1 952 &#233;l&#233;ments pr&#233;marqu&#233;s et 1 273 indices ajout&#233;s par les annotateurs.
Le tableau 1 montre pour chaque type la proportion des items introduits par un indice quel qu&#8217;il soit
(i.e. dont le d&#233;but correspond avec un indice pr&#233;marqu&#233; ou ajout&#233;) et la r&#233;partition des diff&#233;rents types
d&#8217;indices associ&#233;s, en distinguant 6 groupes : les titres de sections (Titres), les puces et patrons ponctu-
ationnels (Ponct.), les expressions &#233;num&#233;rantes (s&#233;quenceurs et connecteurs = S+C), les adverbiaux en
initiale exprimant une circonstance (temporelle, spatiale ou notionnelle = Circ.) et enfin les parall&#233;lismes
syntaxiques(Parall.). La cat&#233;gorie Autres recouvre un grand nombre de ph&#233;nom&#232;nes trop isol&#233;s pour &#234;tre
pris en compte, ainsi que certains indices non sp&#233;cifi&#233;s par les annotateurs. Le total par ligne peut d&#233;passer
100, certains items &#233;tant introduits par plusieurs indices &#224; la fois.
</p>
<p>Nombre d&#8217;items D&#233;tails des indices (%)
Total Introduits % Titres Ponct. S+C Circ. Parall. Autres
</p>
<p>Type 1 314 297 94,6 94,6 0,7 0,7 0,7 6,1 4,0
Type 2 741 732 98,8 0,0 98,0 2,2 1,6 14,9 5,7
Type 3 599 446 74,5 0,0 14,6 27,8 37,2 15,0 9,9
Type 4 720 478 66,4 0,0 13,2 46,7 14,2 20,1 11,9
Total 2374 1953 82,3 14,4 43,4 18,7 12,7 14,8 7,9
</p>
<p>TAB. 1 &#8211; Signalisation des SE : fr&#233;quence des items introduits par un indice et d&#233;tail des indices
</p>
<p>Plus de 80% des items sont introduits par un indice et tous les types d&#8217;indices sont repr&#233;sent&#233;s, ce qui
confirme le r&#244;le de la signalisation dans la d&#233;finition des SE et la vari&#233;t&#233; des indices impliqu&#233;s. Si les puces
et patrons ponctuationnels constituent le type d&#8217;indice pr&#233;dominant, les autres cat&#233;gories sont &#233;galement
bien pr&#233;sentes. La quatri&#232;me colonne du tableau 1 montre que la progression choisie dans notre typologie
scalaire s&#8217;associe avec une progression dans la signalisation : pour les types 1 et 2, la signalisation par des</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANATOMIE DES STRUCTURES &#201;NUM&#201;RATIVES
</p>
<p>indices visuels est d&#233;finitoire9 ; les SE de type 3 et surtout de type 4 font l&#8217;objet d&#8217;une signalisation moins
forte, si l&#8217;on prend en compte tous les types d&#8217;indices.
Si l&#8217;on regarde maintenant le d&#233;tail des indices, diff&#233;rentes r&#233;partitions apparaissent : les expressions
&#233;num&#233;rantes (S+C) constituent le type d&#8217;indice le plus utilis&#233; pour introduire les SE de type 4 ; elles
s&#8217;associent aux circonstants pour introduire les SE de type 3. Le parall&#233;lisme syntaxique est davantage
pr&#233;sent dans les SE de type 4.
Quatre conclusions d&#233;coulent de ces r&#233;sultats :
&#8211; le niveau de grain des SE (traduit par son type) implique des strat&#233;gies diff&#233;rentes pour leur insertion
</p>
<p>dans le texte, avec alternance des marques visuelles (titres, listes) et des marques lexico-syntaxiques ;
&#8211; les expressions &#233;num&#233;rantes, qui indiquent essentiellement le statut d&#8217;item plus que le crit&#232;re de co&#233;nu-
</p>
<p>m&#233;rabilit&#233;, apparaissent &#224; tous les niveaux ;
&#8211; les circonstants, qui sp&#233;cifient le crit&#232;re de co&#233;num&#233;rabilit&#233; sans en indiquer explicitement le statut,
</p>
<p>s&#8217;associent davantage &#224; des SE de haut niveau, multiparagraphiques ;
&#8211; les parall&#233;lismes signalent de fa&#231;on beaucoup plus locale le crit&#232;re de co&#233;num&#233;rabilit&#233; et le statut d&#8217;item,
</p>
<p>sans alignement sur la structure visuelle du document.
Il est important de noter que les &#233;l&#233;ments pr&#233;marqu&#233;s utilis&#233;s lors de cette campagne ont pour vocation
d&#8217;&#234;tre affin&#233;s. Ces premiers r&#233;sultats nous permettent d&#233;j&#224; d&#8217;envisager un pr&#233;marquage plus pr&#233;cis des
textes, voire de viser un rep&#233;rage automatis&#233; de ces structures dans la prochaine &#233;tape de notre travail.
Ils nous encouragent &#233;galement &#224; examiner d&#8217;encore plus pr&#232;s ces structures textuelles. La typologie pro-
pos&#233;e, comme on le voit, n&#8217;est qu&#8217;une premi&#232;re fa&#231;on d&#8217;identifier des variations pertinentes dans leur
fonctionnement. Une deuxi&#232;me &#233;tape consistera &#224; dresser une typologie fonctionnelle des SE (SE rh&#233;-
toriques, th&#233;matiques, temporelles, etc.). Le croisement de ces deux typologies nous permettra de corr&#233;ler
configurations d&#8217;indices, fonctions discursives et niveau de grain.
</p>
<p>4 Conclusion
Les premiers r&#233;sultats de notre projet d&#8217;annotation manuelle syst&#233;matique des structures &#233;num&#233;ratives
dans un corpus diversifi&#233; nous ont permis de proposer une typologie pr&#233;liminaire bas&#233;e sur l&#8217;analyse
quantitative des structures et de leurs constituants. Au-del&#224; de cette typologie, nous pouvons &#224; ce stade
porter un regard sur l&#8217;exp&#233;rience d&#8217;annotation dans son ensemble. Le choix des structures &#233;num&#233;ratives
comme point d&#8217;entr&#233;e dans la complexit&#233; de l&#8217;organisation des textes s&#8217;av&#232;re fructueux : en tant que struc-
tures fondamentalement multi-&#233;chelle, elles constituent un objet privil&#233;gi&#233; pour l&#8217;&#233;tude de l&#8217;organisation
textuelle &#224; diff&#233;rents niveaux de grain ; en tant qu&#8217;objets textuels facilement identifiables, elles permettent
de r&#233;aliser une annotation fiable et stable ; enfin, la couverture textuelle de ces structures montre que loin
d&#8217;&#234;tre un ph&#233;nom&#232;ne marginal, elles repr&#233;sentent bien une strat&#233;gie de base pour la mise en texte. La mise
en place d&#8217;une m&#233;thodologie et d&#8217;un outillage permettant la prise en compte des aspects visuels et de la
structuration &#171; logique &#187; des documents, indispensable pour ces structures, est un pas en avant pour l&#8217;ana-
lyse et l&#8217;exploitation de l&#8217;organisation textuelle d&#8217;une fa&#231;on g&#233;n&#233;rale. Signalons &#233;galement, toujours sur
le plan des m&#233;thodes, la mise en &#339;uvre de techniques de traitement automatique pour le pr&#233;-marquage,
ainsi que les possibilit&#233;s de visualisation de ce pr&#233;-marquage gr&#226;ce &#224; l&#8217;interface GLOZZ. Les indices
annot&#233;s vont maintenant faire l&#8217;objet d&#8217;analyses statistiques pour mettre en &#233;vidence les configurations
r&#233;currentes qui sont les marqueurs de SE &#224; proprement parler. Ces configurations seront ensuite &#233;valu&#233;es
</p>
<p>9Seuls les indices valid&#233;s manuellement sont compt&#233;s : certains ont &#233;chapp&#233; aux annotateurs, ce qui explique les pourcent-
ages d&#8217;indices inf&#233;rieurs &#224; 100%. Le typage est par contre bas&#233; sur l&#8217;exploitation syst&#233;matique de la structure du document.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>HO-DAC, P&#201;RY-WOODLEY, TANGUY
</p>
<p>en tant que marqueurs de segmentation pour rep&#233;rer des structures hi&#233;rarchiques. Par ailleurs, d&#8217;autres
configurations impliquant d&#8217;autres &#233;l&#233;ments (temps verbaux, expressions (co-)r&#233;f&#233;rentiels, constructions
sp&#233;ciales, longueur des paragraphes, etc.) seront d&#233;finies permettant de d&#233;limiter diff&#233;rents items et par
extrapolation diff&#233;rents segments de discours. Enfin, nous esp&#233;rons corr&#233;ler ces investigations &#224; d&#8217;autres
&#233;tudes linguistiques gr&#226;ce &#224; la mise &#224; disposition prochaine du corpus annot&#233; et des outils et ressources
construits au cours du projet.
</p>
<p>Remerciements
Les auteurs tiennent &#224; remercier les autres membres du projet ANNODIS, et plus sp&#233;cifiquement : C&#233;cile
Fabre et Josette Rebeyrolle pour leur participation centrale &#224; ces travaux, Nikola Tulechki pour le pr&#233;-
traitement des corpus, sans oublier nos fid&#232;les annotateurs de SE : Maud Colleter, Guillaume Carbou et
Fran&#231;ois Morlane-Hond&#232;re.
</p>
<p>R&#233;f&#233;rences
BOURIGAULT D. (2007). Un analyseur syntaxique op&#233;rationnel : Syntex. M&#233;moire d&#8217;HDR, Universit&#233;
de Toulouse.
BRAS M., PR&#201;VOT L. &amp; VERGEZ-COURET M. (2008). Quelle(s) relation(s) de discours pour les struc-
tures &#233;num&#233;ratives ? In Actes du Congr&#232;s Mondial de Linguistique Fran&#231;aise, p. 1945&#8211;1964, Paris.
HO-DAC L.-M., FABRE C., P&#201;RY-WOODLEY M.-P. &amp; REBEYROLLE J. (2009). Corpus annotation of
macro-discourse structures. In Proceeding of CILC09, Murcia, Spain.
JACKIEWICZ A. (2005). Les s&#233;ries lin&#233;aires dans le discours. Langue fran&#231;aise, 148, 95&#8211;110.
LUC C., MOJAHID M., P&#201;RY-WOODLEY M.-P. &amp; VIRBEL J. (2000). Les &#233;num&#233;rations : structures
visuelles, syntaxiques et rh&#233;toriques. In Actes de CIDE 2000 (Colloque International sur le Document
&#201;lectronique), p. 21&#8211;40.
MATHET Y. &amp; WIDL&#214;CHER A. (2009). La plate&#8211;forme GLOZZ : environnement d&#8217;annotation et d&#8217;ex-
ploration de corpus. In Actes de TALN 2009 (Traitement automatique des langues naturelles), Senlis :
ATALA LIPN.
P&#201;RY-WOODLEY M.-P. (2005). Discours, corpus, traitements automatiques. In A. CONDAMINES, Ed.,
S&#233;mantique et corpus, p. 177&#8211;210. Paris : Herm&#232;s.
P&#201;RY-WOODLEY M.-P., ASHER N., ENJALBERT P., BENAMARA F., BRAS M., FABRE C., FERRARI
S., HO-DAC L.-M., DRAOULEC A. L., MATHET Y., MULLER P., PR&#201;VOT L., REBEYROLLE J., TAN-
GUY L., VERGEZ-COURET M., VIEU L. &amp; WIDL&#214;CHER A. (2009). Annodis : une approche outill&#233;e
de l&#8217;annotation de structures discursives. In Actes de TALN 2009 (Traitement automatique des langues
naturelles), Senlis : ATALA LIPN.
PORHIEL S. (2007). Les structures &#233;num&#233;ratives &#224; deux temps. Revue Romane, 1(42), 103&#8211;135.
POWER R., SCOTT D. &amp; BOUAYAD-AGHA N. (2003). Document structure. Computational Linguistics,
2(29), 211&#8211;260.
PRASAD A., MILTSAKAKI R., DINESH E., LEE N., JOSHI A. &amp; WEBBER B. (2006). Penn Discourse
TreeBank 1.0 Annotation Manual. www.seas.upenn.edu/&#732;pdtb/.
TURCO G. &amp; COLTIER D. (1988). Des agents doubles de l&#8217;organisation textuelle, les marqueurs d&#8217;int&#233;-
gration lin&#233;aire. Pratiques, 57, 57&#8211;79.</p>

</div></div>
</body></html>