<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>MeTAE : Plate-forme d&#8217;annotation automatique et d&#8217;exploration s&#233;mantiques pour le domaine m&#233;dical</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>MeTAE : Plate-forme d&#8217;annotation automatique et d&#8217;exploration
s&#233;mantiques pour le domaine m&#233;dical
</p>
<p>Asma Ben Abacha1 Pierre Zweigenbaum1
</p>
<p>(1) LIMSI - CNRS, B.P. 133 91403 ORSAY CEDEX FRANCE
{asma.benabacha, pz}@limsi.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons une plate-forme d&#8217;annotation s&#233;mantique et d&#8217;exploration de textes m&#233;-
dicaux, appel&#233;e &#171; MeTAE &#187;. Le processus d&#8217;annotation automatique comporte une premi&#232;re &#233;tape de
reconnaissance des entit&#233;s m&#233;dicales pr&#233;sentes dans les textes suivie d&#8217;une &#233;tape d&#8217;identification des re-
lations s&#233;mantiques qui les relient. Cette identification se fonde sur des patrons linguistiques construits
manuellement pour chaque type de relation. MeTAE g&#233;n&#232;re des annotations RDF &#224; partir des informa-
tions extraites et offre une interface d&#8217;exploration des textes annot&#233;s avec des requ&#234;tes sous forme de
formulaire. La plate-forme peut &#234;tre utilis&#233;e pour analyser s&#233;mantiquement les textes m&#233;dicaux ou inter-
roger la base d&#8217;annotation disponible pour avoir une/des r&#233;ponses &#224; une requ&#234;te donn&#233;e (e.g. &#171; ?X pr&#233;vient
maladie d&#8217;Alzheimer &#187;, &#233;quivalent &#224; la question &#171; comment pr&#233;venir la maladie d&#8217;Alzheimer ? &#187;). Cette
application peut &#234;tre la base d&#8217;un syst&#232;me de questions-r&#233;ponses pour le domaine m&#233;dical.
</p>
<p>Abstract. This paper presents MeTAE, a platform for semantic annotation and exploration of medi-
cal texts. The annotation process encompasses medical entity recognition and semantic relationship iden-
tification between the retrieved entities. This identification is based on linguistic patterns constructed
manually for each type of relation. MeTAE generates RDF annotations from the extracted information
and allows semantic exploration of the annotated texts through a form-based interface. The platform can
be used to semantically analyze medical texts or to explore the available annotation base through struc-
tured queries (e.g. &#8220;?X Prevents Alzheimer&#8217;s disease&#8221; for its natural-language equivalent: &#8220;how to prevent
Alzheimer&#8217;s disease?&#8221;). MeTAE can be a basis for a medical question-answering system.
</p>
<p>Mots-cl&#233;s : Annotation s&#233;mantique, interrogation s&#233;mantique, domaine m&#233;dical.
</p>
<p>Keywords: Semantic annotation, semantic querying, medical domain.
</p>
<p>1 Introduction
</p>
<p>Avec la grande quantit&#233; d&#8217;informations m&#233;dicales num&#233;ris&#233;es, le domaine m&#233;dical a besoin d&#8217;outils d&#8217;aide
&#224; la recherche d&#8217;information plus pr&#233;cis que les moteurs de recherche classiques. La recherche d&#8217;infor-
mation pr&#233;cise n&#233;cessite une analyse s&#233;mantique des documents desquels l&#8217;information va &#234;tre extraite.
L&#8217;analyse s&#233;mantique des textes m&#233;dicaux passe g&#233;n&#233;ralement par une &#233;tape de reconnaissance des entit&#233;s
m&#233;dicales (e.g. cancer, aspirin, blood test). Pour une analyse plus profonde, certains travaux s&#8217;int&#233;ressent
aux relations s&#233;mantiques reliant les entit&#233;s reconnues (e.g. causalit&#233;, traitement, diagnostic). Dans cette
d&#233;monstration, nous pr&#233;sentons une plate-forme d&#8217;annotation automatique de textes m&#233;dicaux en anglais</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ASMA BEN ABACHA, PIERRE ZWEIGENBAUM
</p>
<p>qui extrait les entit&#233;s m&#233;dicales et les relations s&#233;mantiques les reliant. Cette plate-forme offre aussi une
interface d&#8217;exploration des annotations faites pour r&#233;pondre aux requ&#234;tes utilisateur1.
</p>
<p>2 Processus automatique d&#8217;annotation s&#233;mantique
</p>
<p>Notre m&#233;thode d&#8217;annotation comporte une succession de 3 &#233;tapes : (i) la reconnaissances des entit&#233;s m&#233;-
dicales, (ii) l&#8217;identification des relations s&#233;mantiques entre les entit&#233;s reconnues et (iii) la transformation
des annotations en RDF2 (Resource Description Framework).
</p>
<p>La reconnaissance des entit&#233;s m&#233;dicales se fait gr&#226;ce &#224; :
&#8211; un pr&#233;traitement des textes : segmentation en phrases (outil LingPipe sp&#233;cialis&#233; pour les ressources
</p>
<p>Medline) et extraction de syntagmes nominaux (TreeTagger-chunker) ;
&#8211; une identification des termes m&#233;dicaux (e.g. Doxorubicin, Myocardial scintigraphy) et de leurs types
</p>
<p>s&#233;mantiques (Antibiotic, Diagnostic Procedure) gr&#226;ce &#224; l&#8217;outil MetaMap (Aronson, 2001) ;
&#8211; un filtrage des r&#233;sultats de MetaMap (filtre sur les erreurs et sur certains types s&#233;mantiques).
</p>
<p>L&#8217;extraction des relations s&#233;mantiques se fonde sur une approche linguistique utilisant des patrons (&#224; l&#8217;ins-
tar de (Hearst, 1992)). Ces patrons permettent de typer la relation entre deux entit&#233;s m&#233;dicales en prenant
comme r&#233;f&#233;rence le r&#233;seau s&#233;mantique de l&#8217;UMLS3 (Unified Medical Language System). Pour chaque
relation, un ensemble de patrons linguistiques a &#233;t&#233; construit manuellement (cf. tableau 1). Afin d&#8217;am&#233;lio-
rer l&#8217;exploration ult&#233;rieure des informations extraites nous structurons ces patrons de fa&#231;on hi&#233;rarchis&#233;e
dans une ontologie. Les relations de sp&#233;cialisation/g&#233;n&#233;ralisation &#233;tablies entre patrons permettent de cal-
culer un degr&#233; de sp&#233;cificit&#233; qui pourra &#234;tre utilis&#233; pour associer des valeurs de confiance aux relations
m&#233;dicales extraites.
</p>
<p>Relation Nombre de patrons* Exemples de patrons
causes 28 . . .E1 may trigger E2 . . .
</p>
<p>diagnoses 12 E1 is the best test for (the diagnoses of) ? E2
treats 46 . . .E1 was found to reduce E2 . . .
</p>
<p>prevents 13 . . .E1 for prophylaxis against E2 . . .
</p>
<p>TAB. 1 &#8211; Exemples de patrons de relations (* : nombres en cours d&#8217;&#233;volution)
</p>
<p>Notre m&#233;thode d&#8217;annotation est d&#233;taill&#233;e et &#233;valu&#233;e pour extraire les relations de type &#171; treats &#187; dans (Aba-
cha &amp; Zweigenbaum, 2010). Actuellement notre plate-forme permet d&#8217;annoter les 6 relations s&#233;mantiques
pr&#233;sent&#233;es dans la figure 1 et les termes m&#233;dicaux associ&#233;s aux 5 cat&#233;gories s&#233;mantiques (Therapeutic
Procedure, Drug, Medical Problem, Medical Test et Sign or Symptom). Chaque cat&#233;gorie regroupe un en-
semble de types s&#233;mantiques du r&#233;seau s&#233;mantique de l&#8217;UMLS. Le Tableau 2 contient quelques exemples
de types s&#233;mantiques associ&#233;s &#224; certaines cat&#233;gories pr&#233;sent&#233;es dans l&#8217;ontologie.
</p>
<p>1Ce travail a &#233;t&#233; partiellement financ&#233; par OSEO dans le cadre du programme Quaero.
2http ://www.w3.org/TR/rdf-primer/
3http ://www.nlm.nih.gov/research/umls/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PLATE-FORME D&#8217;ANNOTATION AUTOMATIQUE ET D&#8217;EXPLORATION S&#201;MANTIQUES
</p>
<p>FIG. 1 &#8211; Ontologie des relations cibl&#233;es
</p>
<p>Cat&#233;gorie Types s&#233;mantiques associ&#233;s
Medical Test Diagnostic Procedure, Laboratory Procedure, Pharmacologic Substance, etc.
</p>
<p>Medical Problem Anatomical Abnormality, Injury or Poisoning, Disease or Syndrome, etc.
Therapeutic Procedure Antibiotic, Pharmacologic Substance, Therapeutic or Preventive Procedure, etc.
</p>
<p>TAB. 2 &#8211; Exemples de cat&#233;gories et types s&#233;mantiques associ&#233;s
</p>
<p>3 D&#233;roulement de la d&#233;monstration
</p>
<p>Notre d&#233;monstration consiste &#224; :
</p>
<p>1. Ajouter des documents/textes m&#233;dicaux &#224; l&#8217;application et visualiser les informations extraites par le
syst&#232;me sous forme d&#8217;annotations s&#233;mantiques. Les entr&#233;es consisteront en des fichiers au format Medline
ou des textes m&#233;dicaux.
</p>
<p>2. Explorer les textes m&#233;dicaux via leurs annotations s&#233;mantiques. L&#8217;utilisateur pourra formuler des re-
qu&#234;tes de la forme &#171; ?X relation ?Y &#187; en tapant librement les entit&#233;s ?X et ?Y et en choisissant la relation
dans une liste. Le corpus interrog&#233; sera un corpus de r&#233;sum&#233;s d&#8217;articles scientifiques extraits &#224; partir de
PubMed et pr&#233;alablement annot&#233;s via la plate-forme.
</p>
<p>La figure 2 pr&#233;sente un aper&#231;u de la phase d&#8217;exploration de MeTAE. Cet aper&#231;u montre l&#8217;exemple de
l&#8217;ex&#233;cution de la requ&#234;te &#171; ?X treats erysipelas &#187; avec dans le premier volet les r&#233;ponses (phrases) ex-
traites comme &#233;tant pertinentes &#224; cette requ&#234;te. Le deuxi&#232;me volet contient le document correspondant &#224;
la r&#233;ponse s&#233;lectionn&#233;e par l&#8217;utilisateur.
</p>
<p>Environnement requis : Syst&#232;me d&#8217;exploitation Linux, JRE 6.0.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ASMA BEN ABACHA, PIERRE ZWEIGENBAUM
</p>
<p>FIG. 2 &#8211; Interface d&#8217;exploration - MeTAE
</p>
<p>4 Conclusion et Perspectives
</p>
<p>Nous avons pr&#233;sent&#233; MeTAE, une plate-forme d&#8217;annotation et d&#8217;exploration de textes m&#233;dicaux. L&#8217;anno-
tation comporte la reconnaissance des entit&#233;s m&#233;dicales en utilisant entre autre l&#8217;UMLS et l&#8217;identification
des relations reliant ces termes en appliquant des patrons linguistiques. Une version de la plate-forme est
accessible en ligne &#224; http://www.limsi.fr/Individu/abacha/metae.html.
</p>
<p>Comme perspectives, nous envisageons d&#8217;am&#233;liorer l&#8217;annotation avec l&#8217;extraction d&#8217;information sur les
patients, les m&#233;dicaments (e.g. dosage), etc. Une seconde et derni&#232;re &#233;tape pour la mise en &#339;uvre d&#8217;un
syst&#232;me de questions-r&#233;ponses m&#233;dical sera le d&#233;veloppement d&#8217;un module d&#8217;analyse des questions pos&#233;es
en language naturel. Dans le cadre d&#8217;un syst&#232;me translingue, nous envisageons aussi de r&#233;pondre &#224; des
questions &#233;crites en fran&#231;ais &#224; partir de textes m&#233;dicaux en anglais.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABACHA A. B. &amp; ZWEIGENBAUM P. (2010). Annotation et interrogation s&#233;mantiques de textes m&#233;di-
caux. In Atelier Web S&#233;mantique M&#233;dical, IC.
</p>
<p>ARONSON A. (2001). Effective mapping of biomedical text to the UMLS Metathesaurus : the MetaMap
program. In Proc. AMIA Symp, p. 17&#8211;21.
</p>
<p>HEARST M. A. (1992). Automatic acquisition of hyponyms from large text corpora. In Proceedings of
the 14th International Conference on Computational Linguistics (COLING), p. 539&#8211;545.</p>

</div></div>
</body></html>