<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;termination et pond&#233;ration des raffinements d&#8217;un terme &#224; partir de son arbre des usages nomm&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>D&#233;termination et pond&#233;ration des raffinements d&#8217;un terme 
&#224; partir de son arbre des usages nomm&#233;s 
</p>
<p>Mathieu Lafourcade, Alain Joubert                                                                     
</p>
<p>LIRMM &#8211; Univ. Montpellier 2 - CNRS 
Laboratoire d&#8217;Informatique, de Robotique et de Micro&#233;lectronique de Montpellier 
</p>
<p>161, rue Ada &#8211; 34392 Montpellier C&#233;dex 5 &#8211; France 
{lafourcade, joubert}@lirmm.fr 
</p>
<p>R&#233;sum&#233; Gr&#226;ce &#224; la participation d&#8217;un grand nombre de personnes via des jeux accessibles sur le web, 
nous avons construit un r&#233;seau lexical &#233;volutif de grande taille pour le Fran&#231;ais. A partir de cette 
ressource, nous avons abord&#233; la question de la d&#233;termination des sens d&#8217;usage d&#8217;un terme, puis apr&#232;s 
avoir introduit la notion de similarit&#233; entre ces diff&#233;rents usages, nous avons pu obtenir pour un terme 
son arbre des usages : la racine regroupe tous les usages du terme et une descente dans l&#8217;arbre 
correspond &#224; un raffinement de ces usages. Le nommage des diff&#233;rents n&#339;uds est effectu&#233; lors d&#8217;une 
descente en largeur. En simplifiant l&#8217;arbre des usages nomm&#233;s, nous d&#233;terminons les diff&#233;rents sens 
d&#8217;un terme, sens que nous introduisons dans le r&#233;seau lexical en tant que n&#339;uds de raffinement du terme 
consid&#233;r&#233;. Nous terminons par une &#233;valuation empirique des r&#233;sultats obtenus. 
</p>
<p>Abstract Thanks to the participation of a large number of persons via web-based games, a large-
sized evolutionary lexical network is available for French. With this resource, we approached the 
question of the determination of the word usages of a term, and after introducing the notion of similarity 
between these various word usages, we were able to build for a term its word usage tree: the root groups 
together all possible usages of this term and a search in the tree corresponds to a refinement of these 
word usages. The labelling of the various nodes is made during a width-first search. From its labelled 
word usage tree, we obtain the different meanings of a term, which can be inserted in the lexical network 
as refinement nodes for this term. Lastly, we present an evaluation of the results we obtain.   
</p>
<p>Mots-cl&#233;s :   r&#233;seau lexical, arbre des usages nomm&#233;s d&#8217;un terme, pond&#233;ration des sens d&#8217;un terme 
Keywords:   lexical network, tree of labelled word usages for a term, weighting of the meanings  
 
</p>
<p>1. Introduction 
Dans cet article, nous rappelons comment nous avons exploit&#233; un r&#233;seau obtenu gr&#226;ce &#224; deux jeux 
accessibles sur le Web pour d&#233;terminer les diff&#233;rents sens d&#8217;usage des termes qui le constituent et ainsi 
construire pour chaque terme son arbre des usages nomm&#233;s. Dans une deuxi&#232;me partie, consid&#233;rant 
l&#8217;arbre des usages d&#8217;un terme, nous faisons l&#8217;hypoth&#232;se qu&#8217;il est possible d&#8217;en d&#233;terminer les diff&#233;rents 
sens : cela nous conduit &#224; obtenir les raffinements du terme consid&#233;r&#233;, que nous impl&#233;mentons sous 
forme de n&#339;uds dans le r&#233;seau lexical. Ces n&#339;uds de raffinement peuvent &#234;tre reli&#233;s aux n&#339;uds d&#233;j&#224; 
existants dans notre r&#233;seau, participant ainsi &#224; son accroissement. Nous abordons ensuite la notion de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATHIEU LAFOURCADE, ALAIN JOUBERT 
 
</p>
<p>pond&#233;ration relative des sens d&#8217;un terme, avant de conclure en pr&#233;sentant les premiers &#233;l&#233;ments d&#8217;une 
&#233;valuation empirique des r&#233;sultas obtenus. 
</p>
<p>2. Construction de l&#8217;arbre des usages nomm&#233;s d&#8217;un terme 
2.1. Construction du r&#233;seau lexical 
</p>
<p>La construction progressive du r&#233;seau lexical selon un principe contributif gr&#226;ce &#224; deux jeux accessibles 
sur le web, JeuxDeMots1 et PtiClic1, a d&#233;j&#224; pr&#233;c&#233;demment &#233;t&#233; d&#233;crite par (Lafoucade et Joubert, 2009). 
Ces deux jeux reposent sur les propositions faites par les joueurs de termes destination &#224; partir de termes 
origine et de types de relation, selon un principe qui rappelle celui utilis&#233; par (Lieberman et al., 2007) 
pour la collecte de &#8243;connaissances de bon sens&#8243;. La structure du r&#233;seau lexical obtenu s&#8217;appuie sur les 
notions de n&#339;uds et de relations entre ces n&#339;uds, selon un mod&#232;le propos&#233; par (Collins et Quillian, 
1969) et plus r&#233;cemment d&#233;crit par (Polgu&#232;re, 2006). Chaque n&#339;ud de notre r&#233;seau est constitu&#233; par un 
terme ou raffinement d&#8217;un terme et les relations2 entre ces n&#339;uds traduisent des fonctions lexicales, 
telles que pr&#233;sent&#233;es par (Mel&#8217;&#269;uk et al., 1995) . Nous avons conserv&#233; pour la construction du r&#233;seau 
tous les types de relation propos&#233;s y compris la relation d&#8217;antinomie, car deux termes antinomiques 
appartiennent au m&#234;me champ lexical.  
</p>
<p>2.2. D&#233;termination des usages 
</p>
<p>Lorsqu&#8217;un terme est polys&#233;mique, les termes qui lui sont directement reli&#233;s dans le r&#233;seau lexical 
forment plusieurs groupes distincts, chacun de ces groupes constituant un sens d&#8217;usage de ce terme. La 
notion de sens d&#8217;usage, plus commun&#233;ment appel&#233;e usage, est beaucoup plus fine que celle de sens 
rencontr&#233;e dans les dictionnaires traditionnels, comme l&#8217;a montr&#233; (V&#233;ronis, 2001). Nous avons fait 
l&#8217;hypoth&#232;se que les usages d&#8217;un terme correspondent dans le r&#233;seau aux diff&#233;rentes cliques auxquelles 
appartient ce terme ; deux termes appartiennent &#224; une m&#234;me clique s&#8217;il existe au moins une relation de 
l&#8217;un vers l&#8217;autre et au moins une relation de l&#8217;autre vers l&#8217;un. Notre approche est analogue &#224; celle 
d&#233;velopp&#233;e par (Ploux et Victorri, 1998) &#224; partir de dictionnaires de synonymes. Nous avons d&#233;j&#224; 
introduit la notion de pertinence d&#8217;une clique dans (Lafourcade et Joubert, 2009). Rappelons que la 
pertinence d&#8217;une clique, not&#233;e Rel pour &#171; Relevance &#187; en Anglais, est la moyenne des poids des relations 
entre les termes de la clique, valeur qui en exprime la coh&#233;rence, que multiplie le logarithme du nombre 
de termes impliqu&#233;s dans cette clique, afin de tenir compte de l&#8217;importance de sa couverture lexicale. 
</p>
<p>La notion de similarit&#233; &#171; fine &#187; entre deux usages d&#8217;un m&#234;me terme a r&#233;cemment &#233;t&#233; introduite par 
(Lafourcade et Joubert, 2010) en se basant sur les principes &#233;nonc&#233;s par (Tversky, 1977) et leur 
application en TALN faite par (Fairon et Ho, 2004). Nous avons d&#233;fini la similarit&#233; comme &#233;gale au 
rapport du poids des relations liant deux cliques sur le poids total des relations liant l&#8217;ensemble des 
termes de ces deux cliques : elle correspond &#224; l&#8217;indice de Jaccard d&#233;fini en statistiques.  
</p>
<p>2.3. Construction de l&#8217;arbre des usages nomm&#233;s 
</p>
<p>L&#8217;arbre des usages d&#8217;un terme polys&#233;mique est une repr&#233;sentation structur&#233;e de ces diff&#233;rents usages. La 
racine de l&#8217;arbre regroupe tous les sens de ce terme et, plus on s&#8217;&#233;loigne de la racine, plus on rencontre 
                                                 
</p>
<p>1
 JeuxDeMots et PtiClic sont accessibles &#224; l&#8217;adresse http://jeuxdemots.org et http://pticlic.org. Le r&#233;seau lexical r&#233;sultant est 
</p>
<p>disponible &#224; l&#8217;adresse http://www.lirmm.fr/jeuxdemots/rezo.php et le &#171; dictionnaire &#187; qui en a &#233;t&#233; obtenu est disponible &#224; 
l&#8217;adresse http://www.lirmm.fr/jeuxdemots/diko.php . 
2
 Dans le r&#233;seau lexical obtenu, une relation peut &#234;tre consid&#233;r&#233;e comme un quadruplet : terme origine, terme destination, 
</p>
<p>type et poids de la relation; entre deux m&#234;mes termes, plusieurs relations de types diff&#233;rents peuvent donc exister. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RAFFINEMENTS D&#8217;UN TERME A PARTIR DE SON ARBRE DES USAGES NOMMES 
 
</p>
<p>des distinctions fines d&#8217;usages. La construction de l&#8217;arbre des usages d&#8217;un terme s&#8217;effectue par fusions 
successives des cliques selon une m&#233;thode de type &#171; bottom-up &#187;. Pour cela, nous fusionnons les 
cliques, deux &#224; deux, en commen&#231;ant par celles dont le coefficient de similarit&#233; est le plus &#233;lev&#233; : nous 
constituons ainsi des quasi-cliques, regroupements de cliques, repr&#233;sentant donc des regroupements 
d&#8217;usages, proches lors des premi&#232;res fusions, de moins en moins proches lors des fusions successives. 
L&#8217;algorithme de fusions s&#8217;arr&#234;te lorsque tous les coefficients de similarit&#233; sont nuls. 
</p>
<p>Le nommage des n&#339;uds de l&#8217;arbre des usages d&#8217;un terme est effectu&#233; selon une m&#233;thode &#171; top-down &#187;. 
La racine est &#233;tiquet&#233;e par le terme lui-m&#234;me. Chaque n&#339;ud de l&#8217;arbre est &#233;tiquet&#233; par le terme issu de la 
clique (ou quasi-clique) qu&#8217;il repr&#233;sente dont la somme des poids des relations le liant au terme racine 
est la plus &#233;lev&#233;e, apr&#232;s &#233;limination des termes d&#233;j&#224; utilis&#233;s pour nommer les n&#339;uds pr&#233;c&#233;demment 
trait&#233;s dans le nommage de l&#8217;arbre. Certains n&#339;uds peuvent ne pas &#234;tre &#233;tiquetables : dans ce cas, nous 
r&#233;alisons un &#233;lagage de l&#8217;arbre. La figure 1 repr&#233;sente l&#8217;arbre des usages nomm&#233;s ainsi construit pour le 
terme sapin. 
</p>
<p> 
</p>
<p>Figure 1 : Arbre des usages nomm&#233;s pour le terme sapin. 
</p>
<p>3. Sens d&#8217;un terme 
</p>
<p>3.1. D&#233;termination des sens d&#8217;un terme 
</p>
<p>Nous avons fait l&#8217;hypoth&#232;se que les n&#339;uds de profondeur &#233;gale &#224; 1 dans l&#8217;arbre des usages, 
correspondant &#224; des cliques (ou quasi-cliques)3 dont la similarit&#233; est nulle, correspondent aux sens de ce 
terme tels qu&#8217;on les rencontre dans un dictionnaire ainsi que parfois &#224; des champs lexicaux &#171; forts &#187;. Par 
exp&#233;rience, cette hypoth&#232;se s&#8217;est trouv&#233;e largement v&#233;rifi&#233;e. Comme nous l&#8217;avons vu ci-dessus, dans 
l&#8217;arbre des usages, il est possible de nommer les n&#339;uds : &#224; la profondeur 1, le terme nommant un n&#339;ud 
constitue un raffinement du terme racine : il correspond &#224; l&#8217;un de ses sens. 
</p>
<p>3.2. Utilisation des sens dans le r&#233;seau 
</p>
<p>Chaque raffinement, actuellement apr&#232;s validation par un expert, conduit &#224; la cr&#233;ation d&#8217;un n&#339;ud dans le 
r&#233;seau lexical. Ainsi, par exemple, les n&#339;uds voile (bateau)4, voile (plaisance) et voile (coiffure) ont &#233;t&#233; 
cr&#233;&#233;s. Chaque n&#339;ud de raffinement est reli&#233; dans le r&#233;seau au terme racine par une relation typ&#233;e 
est_raffinement, mais il est &#233;galement possible de relier directement &#224; ce nouveau n&#339;ud non seulement 
les termes (initialement reli&#233;s au terme racine) faisant partie des cliques constituant le sous arbre 
                                                 
</p>
<p>3
 Pour simplifier, pour la suite de cette section, nous utiliserons le terme de clique pour d&#233;signer des cliques ou des quasi-
</p>
<p>cliques r&#233;sultant de la fusion de cliques. 
4
 Le n&#339;ud d&#233;nomm&#233; voile (bateau) repr&#233;sente le sens bateau du terme voile. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATHIEU LAFOURCADE, ALAIN JOUBERT 
 
</p>
<p>correspondant &#224; ce raffinement, mais &#233;galement les n&#339;uds de raffinement de ces termes dont la clique 
comprend le terme racine initial. Il est ainsi possible d&#8217;obtenir des relations entre n&#339;uds de raffinement.  
Par exemple, les termes voile et vaisseau &#233;taient d&#233;j&#224; reli&#233;s dans le r&#233;seau lexical par une relation de 
type &#171; association libre &#187;; de plus, le terme vaisseau appartient &#224; la clique du terme voile nomm&#233;e 
bateau et le terme voile appartient &#224; la clique du terme vaisseau nomm&#233;e navire ; apr&#232;s processus de 
raffinement de ces deux termes voile et vaisseau, les n&#339;uds voile (bateau) et vaisseau (navire) sont &#224; 
pr&#233;sent reli&#233;s. La figure 2 illustre cet exemple en montrant un extrait des arbres des usages des termes 
voile et vaisseau, ainsi que la relation entre ces deux termes dans le r&#233;seau lexical. Les nouvelles 
relations cr&#233;&#233;es sortant de voile (bateau) et vaisseau (navire) y sont &#233;galement illustr&#233;es. 
</p>
<p> 
</p>
<p>Figure 2 : Extraits des arbres des usages nomm&#233;s des termes voile et vaisseau. Les liens repr&#233;sent&#233;s ici 
entre voile et vaisseau, ainsi qu&#8217;entre voile (bateau) et vaisseau (navire) sont des relations dans le r&#233;seau 
</p>
<p>lexical. Cette derni&#232;re relation, automatiquement cr&#233;&#233;e, relie deux n&#339;uds de raffinement. 
</p>
<p>3.3. R&#233;injection des sens dans JDM 
Afin d&#8217;am&#233;liorer la qualit&#233; de notre r&#233;seau en vue d&#8217;une utilisation en d&#233;sambigu&#239;sation, il a &#233;t&#233; d&#233;cid&#233; 
de r&#233;injecter ces n&#339;uds de raffinement dans JDM. Lorsqu&#8217;un joueur propose un terme polys&#233;mique dont 
les raffinements ont &#233;t&#233; valid&#233;s, ces raffinements lui seront automatiquement propos&#233;s, et il aura la 
possibilit&#233; soit de conserver sa proposition (polys&#233;mique) initiale, soit d&#8217;indiquer parmi les raffinements 
propos&#233;s celui qui lui semble le plus appropri&#233; &#224; son id&#233;e. Cela permet d&#8217;obtenir des relations entrantes 
sur le terme raffin&#233;. Les termes raffin&#233;s sont &#233;galement utilis&#233;s dans JDM en tant que termes origine : 
cela permet alors d&#8217;en obtenir des relations sortantes. Nous avons donc ainsi &#224; la fois des relations 
entrantes et des relations sortantes de termes raffin&#233;s (apr&#232;s validation du raffinement par un expert). 
Par exemple, sur une partie sp&#233;cifiques de fruit, un joueur peut proposer baie. Lui seront alors indiqu&#233;s 
les raffinements existant dans notre r&#233;seau : baie (fen&#234;tre), baie (golfe) et baie (fruit). Il peut &#233;galement 
&#234;tre demand&#233; &#224; un joueur de proposer des synonymes de baie (fen&#234;tre), restreignant ainsi les propositions 
qu&#8217;il peut faire &#224; ce raffinement de baie. 
</p>
<p>4. Pond&#233;ration relative des sens d&#8217;un terme 
Compte tenu de la pond&#233;ration des relations dans notre r&#233;seau lexical, il est possible de d&#233;finir un poids 
relatif pour chacun des sens d&#8217;un terme. Pour cela, nous consid&#233;rons uniquement les cliques 
correspondant aux n&#339;uds de profondeur 1 dans l&#8217;arbre des usages. Le i&#232;me sens du terme T est repr&#233;sent&#233; 
par la clique Ci. Cette clique Ci peut &#234;tre une clique (clique effective et non une quasi-clique) 
initialement d&#233;tect&#233;e dans notre r&#233;seau lexical : sa pertinence Rel(Ci) est alors celle d&#233;finie dans 
(Lafourcade et Joubert, 2009). Plus fr&#233;quemment, Ci est une quasi-clique r&#233;sultant de la fusion de 
cliques initialement d&#233;tect&#233;es dans le r&#233;seau : dans ce cas, nous d&#233;finirons sa pertinence Rel(Ci) comme </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RAFFINEMENTS D&#8217;UN TERME A PARTIR DE SON ARBRE DES USAGES NOMMES 
 
</p>
<p>&#233;tant la somme des pertinences des cliques initiales dont elle est la fusion. Le poids relatif du i&#232;me sens 
du terme T, repr&#233;sent&#233; par la clique Ci, aura pour valeur le rapport entre la pertinence de la clique Ci et 
la somme des pertinences de l&#8217;ensemble des cliques repr&#233;sentant les diff&#233;rents sens du terme T. Ce poids 
relatif peut s&#8217;&#233;crire : 
</p>
<p>PR(Ci) = Rel(Ci) / &#8721;j=1,nRel(Cj) 
o&#249; Rel(C) correspond &#224; la pertinence du sens repr&#233;sent&#233; par la clique C et n est le nombre de sens que 
poss&#232;de le terme T . La figure 3 montre l&#8217;arbre des usages nomm&#233;s du terme palais, avec pour chacun de 
ses n&#339;uds son poids relatif. 
</p>
<p> 
</p>
<p>Figure 3 : Arbre des usages nomm&#233;s du terme palais montrant le poids relatif de chaque clique. 
</p>
<p>5. Evaluation empirique des r&#233;sultats 
5.1. Principe de l&#8217;&#233;valuation 
</p>
<p>Nous avons r&#233;alis&#233; une &#233;valuation sommaire sur pr&#232;s de 700 termes polys&#233;miques dont les raffinements 
ont &#233;t&#233; valid&#233;s par un expert. Les termes retenus pour cette &#233;valuation sont tous des noms communs 
poss&#233;dant au moins deux sens repr&#233;sent&#233;s par des cliques de pertinence sup&#233;rieure &#224; un certain seuil (50 
pour cette &#233;valuation). 
</p>
<p>L&#8217;&#233;valuation des sens d&#233;tect&#233;s dans notre r&#233;seau est quelque peu d&#233;licate : &#224; notre connaissance, il 
n&#8217;existe pas une telle ressource, du moins pour la langue fran&#231;aise. Nous avons donc fait appel &#224; une 
trentaine de personnes, non expertes a priori, auxquelles il a &#233;t&#233; demand&#233; quatre t&#226;ches diff&#233;rentes sur 
deux ensembles distincts d&#8217;une cinquantaine de termes chacun, un premier ensemble constitu&#233; de termes 
courants et un deuxi&#232;me compos&#233; de termes plus rares. Sur certains ensembles de termes, les testeurs 
n&#8217;avaient pas le droit de consulter une quelconque ressource (t&#226;ches nomm&#233;es Dict -), alors que pour 
d&#8217;autres ensembles ils avaient la possibilit&#233; de consulter un dictionnaire (t&#226;ches nomm&#233;es Dict +) ; nous 
leur avons sugg&#233;r&#233; le dictionnaire en ligne Wiktionnaire, mais n&#8217;importe quel dictionnaire pouvait &#234;tre 
utilis&#233;. Par exemple, il &#233;tait demand&#233; aux testeurs : 
Pour le terme palais, nous proposons les sens suivants (par ordre de pertinence d&#233;croissante) : 
</p>
<p>&#8226; palais (ch&#226;teau) 
&#8226; palais (palais de justice) 
&#8226; palais (bouche) 
</p>
<p>Pensez-vous que certains sens soient absents de cette liste5, et si oui combien ? Pensez-vous que parmi 
les sens propos&#233;s certains soient inappropri&#233;s, et si oui combien ? 
Les &#233;valuateurs interrog&#233;s ont un niveau d&#8217;&#233;tudes d&#8217;approximativement Bac + 2 : nous pensons que cela 
correspond au profil moyen des joueurs de JDM. Les tableaux suivants synth&#233;tisent les r&#233;sultats obtenus. 
                                                 
</p>
<p>5
 Le sens palais (s&#233;rail) n&#8217;&#233;tait pas propos&#233; dans cette liste, sa pertinence &#233;gale &#224; 17 dans notre r&#233;seau est inf&#233;rieure au seuil 
</p>
<p>de 50. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
Mots courants Dict -  Dict + 
</p>
<p>Sens absents 0.45 1.52 
Sens inappropri&#233;s 0.66 0.37 
 
</p>
<p>Mots peu courants Dict -  Dict + 
</p>
<p>Sens absents 0.25 1.67 
Sens inappropri&#233;s 0.76 0.28 
</p>
<p>Tableaux 1 et 2 : R&#233;sultats de l&#8217;&#233;valuation sans (Dict -) et avec (Dict +) utilisation d&#8217;un dictionnaire. 
</p>
<p>5.2. Interpr&#233;tation des r&#233;sultats 
</p>
<p>Sans l&#8217;aide de dictionnaire (Dict -), il y a syst&#233;matiquement moins d&#8217;un sens d&#8217;&#233;cart en plus ou en 
moins. Dans les &#233;valuations avec l&#8217;aide de dictionnaire (Dict +), les sens absents sont plus nombreux, 
alors que les sens inappropri&#233;s sont moins nombreux. Il semble que globalement il manque plus de sens 
dans notre r&#233;seau lexical que nous n&#8217;introduisons de sens erron&#233;s. Les sens absents dans notre r&#233;seau 
sont soit des sens tr&#232;s peu connus, soit des sens tr&#232;s sp&#233;cifiques (exemples : apparence, pr&#233;texte pour le 
terme voile ou absence de contraste en parlant du voile d&#8217;une photographie). Les sens jug&#233;s 
inappropri&#233;s suppl&#233;mentaires dans notre r&#233;seau diminuent lorsque les &#233;valuateurs utilisent un 
dictionnaire : ils correspondent selon leurs dires &#224; des sens particuliers qui leur &#233;taient inconnus 
(exemple : sapin(fiacre)). Les sens suppl&#233;mentaires r&#233;siduels (t&#226;che Dict +), inf&#233;rieurs &#224; 0,4, 
correspondent le plus souvent &#224; des champs lexicaux forts (exemple : No&#235;l comme sens du terme sapin). 
</p>
<p>6. Conclusion 
A partir de l&#8217;arbre des usages d&#8217;un terme, construit gr&#226;ce au r&#233;seau lexical obtenu par JDM, nous avons 
pu en d&#233;terminer les sens. Ceci nous a permis de cr&#233;er des n&#339;uds de raffinement et ainsi d&#8217;&#233;tablir de 
nouvelles relations entre ces n&#339;uds dans le r&#233;seau. L&#8217;&#233;valuation r&#233;alis&#233;e a montr&#233; que les r&#233;sultats 
obtenus sont dans l&#8217;ensemble corrects si l&#8217;on tient compte du fait que le r&#233;seau lexical 
construit correspond &#224; des connaissances relatives &#224; une culture g&#233;n&#233;rale commune ; il ne s&#8217;agissait pas 
ici de rivaliser avec les dictionnaires traditionnels qui indiquent &#233;galement des sens peu usit&#233;s auxquels 
les joueurs de JDM ne pensent pas spontan&#233;ment. Notre r&#233;seau lexical constitue une sorte de 
dictionnaire &#233;lectronique g&#233;n&#233;raliste, utilisable pour l&#8217;enseignement, l&#8217;aide &#224; la r&#233;daction &#8230; 
</p>
<p>En outre, nous avons remarqu&#233; que les dictionnaires traditionnels proposent g&#233;n&#233;ralement une 
hi&#233;rarchisation des sens. Par exemple, pour le terme bouteille, notre r&#233;seau propose les sens bouteille en 
verre, bouteille de gaz et bouteille de plong&#233;e ; dans un dictionnaire traditionnel, il est g&#233;n&#233;ralement 
indiqu&#233; le sens de r&#233;cipient qui se subdivise en trois sous sens (qui sont effectivement ceux que nous 
proposons). Ce n&#8217;est pas (pas encore) le cas avec la m&#233;thode propos&#233;e ici. A suivre&#8230; 
</p>
<p>R&#233;f&#233;rences 
COLLINS A., QUILLIAN M.R. (1969) Retrieval time from semantic memory, Journal of verbal learning 
</p>
<p>and verbal behaviour, 8 (2), pp. 240-248 
FAIRON C., HO N.D. (2004) Quantit&#233; d&#8217;information &#233;chang&#233;e : une nouvelle mesure de la similarit&#233; des 
</p>
<p>mots, Journ&#233;es internationales d&#8217;Analyses statistiques des Donn&#233;es Textuelles (JADT&#8217;04), Louvain-
la-Neuve (Belgique) 
</p>
<p>LAFOURCADE M., JOUBERT A. (2009)  Similitude entre les sens d&#8217;usage d&#8217;un terme dans un r&#233;seau 
lexical, Traitement Automatique des Langues, vol.50/1, pp. 177-200 
</p>
<p>LAFOURCADE M., JOUBERT A. (2010) Construction de l&#8217;arbre des usages nomm&#233;s d&#8217;un terme dans un 
r&#233;seau lexical &#233;volutif, Journ&#233;es internationales d&#8217;Analyses statistiques des Donn&#233;es Textuelles 
(JADT&#8217;10), Rome (&#224; para&#238;tre) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RAFFINEMENTS D&#8217;UN TERME A PARTIR DE SON ARBRE DES USAGES NOMMES 
 
</p>
<p>LIEBERMAN H., SMITH D.A., TEETERS A. (2007) Common Consensus: a web-based game for collecting 
commonsense goals, International Conference on Intelligent User Interfaces (IUI&#8217;07), Hawaii, USA 
</p>
<p>MEL&#8217;CUK I.A., CLAS A., POLGUERE A. (1995) Introduction &#224; la lexicologie explicative et combinatoire, 
Editions Duculot AUPELF-UREF 
</p>
<p>PLOUX S., VICTORRI B.  (1998) Construction d&#8217;espaces s&#233;mantiques &#224; l&#8217;aide de dictionnaires de 
synonymes, Traitement Automatique des Langues, vol.39/1, pp. 161-182 
</p>
<p>POLGUERE A. (2006) Structural properties of Lexical Systems: Monolingual and Multilingual 
Perspectives, Proceedings of the Workshop on Multilingual Language Resources and Interoperability 
(COLING/ACL 2006), Sydney, pp. 50-59. 
</p>
<p>TVERSKY A. (1977) Features of similarity, Psychological Review, 84, pp. 327-352 
V&#201;RONIS J. (2001) Sense tagging: does it make sense?, Corpus linguistics&#8217; 2001 Conference, Lancaster, 
</p>
<p>U.K. </p>

</div></div>
</body></html>