<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Apprentissage non supervis&#233; de la morphologie d&#8217;une langue par g&#233;n&#233;ralisation de relations analogiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Apprentissage non supervis&#233; de la morphologie d&#8217;une langue par
g&#233;n&#233;ralisation de relations analogiques
</p>
<p>Jean-Fran&#231;ois Lavall&#233;e et Philippe Langlais
Universit&#233; de Montr&#233;al
</p>
<p>C.P. 6128, succ. Centre-ville
Montr&#233;al, Qc, Canada, H3C 3J7
{lavalljf,felipe}@iro.umontreal.ca
</p>
<p>R&#233;sum&#233;. Bien que les approches fond&#233;es sur la th&#233;orie de l&#8217;information sont pr&#233;dominantes dans
le domaine de l&#8217;analyse morphologique non supervis&#233;e, depuis quelques ann&#233;es, d&#8217;autres approches ont
gagn&#233; en popularit&#233;, dont celles bas&#233;es sur l&#8217;analogie formelle. Cette derni&#232;re reste tout de m&#234;me margi-
nale due notamment &#224; son co&#251;t de calcul &#233;lev&#233;. Dans cet article, nous proposons un algorithme bas&#233; sur
l&#8217;analogie formelle capable de traiter les lexiques volumineux. Nous introduisons pour cela le concept de
r&#232;gle de cofacteur qui permet de g&#233;n&#233;raliser l&#8217;information captur&#233;e par une analogie tout en contr&#244;lant les
temps de traitement. Nous comparons notre syst&#232;me &#224; 2 syst&#232;mes : Morfessor (Creutz &amp; Lagus, 2005),
un syst&#232;me de r&#233;f&#233;rence dans de nombreux travaux sur l&#8217;analyse morphologique et le syst&#232;me analogique
d&#233;crit par Langlais (2009). Nous en montrons la sup&#233;riorit&#233; pour 3 des 5 langues &#233;tudi&#233;es ici : le finnois,
le turc, et l&#8217;allemand.
</p>
<p>Abstract. Although approaches based on information theory are prominent in the field of unsuper-
vised morphological analysis, in recent years, other approaches have gained in popularity. Those based on
formal analogy remain marginal partly because of their high computational cost. In this paper we propose
an algorithm based on formal analogy able to handle large lexicons. We introduce the concept of cofactor
rule which allows the generalization of the information captured by analogy, while controlling the proces-
sing time. We compare our system to 2 others : Morfessor (Creutz &amp; Lagus, 2005), a reference in many
studies on morphological analysis and the analogical system described by Langlais (2009). We show the
superiority of our approach for 3 out of the 5 languages studied here : Finnish, Turkish, and German.
</p>
<p>Mots-cl&#233;s : Analyse morphologique non supervis&#233;e, Analogie formelle, Approche &#224; base de graphe.
</p>
<p>Keywords: Unsupervised Learning of Morphology, Formal Analogy, Graph-Based Approach.
</p>
<p>1 Introduction
</p>
<p>Dans le domaine de l&#8217;analyse morphologique, il existe 4 grandes familles d&#8217;approches solidement &#233;tablies.
La plus r&#233;pandue consiste &#224; utiliser des statistiques fond&#233;es sur l&#8217;entropie, un concept tr&#232;s connu en th&#233;orie
de l&#8217;information, pour identifier la segmentation la plus probable. L&#8217;id&#233;e de base exploit&#233;e par ce type
d&#8217;approche est qu&#8217;une lettre difficile &#224; pr&#233;dire dans un mot marque vraisemblablement une fronti&#232;re de
morph&#232;me. Harris (1955) a d&#233;crit un syst&#232;me bas&#233; sur cette id&#233;e il y a plus de 50 ans. La deuxi&#232;me</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEAN-FRAN&#199;OIS LAVALL&#201;E, PHILIPPE LANGLAIS
</p>
<p>approche courante consiste &#224; regrouper les mots en paradigme et &#224; enlever les affixes communs &#224; ces
groupes. Paramor (Monson et al., 2007) qui utilise une variante de cette approche obtient r&#233;guli&#232;rement
de bons r&#233;sultats aux ateliers Morpho Challenge1. D&#8217;autres chercheurs abordent l&#8217;analyse morphologique
comme un probl&#232;me de compression. Ils d&#233;composent les mots de fa&#231;on &#224; permettre l&#8217;encodage optimal
du lexique. Les syst&#232;mes les plus connus du domaine, Linguistica (Goldsmith, 2001) etMorfessor (Creutz
&amp; Lagus, 2005) utilisent cette technique. Finalement, la quatri&#232;me approche &#233;tablie consiste &#224; utiliser le
contexte des mots &#224; analyser dans un corpus. L&#8217;id&#233;e &#233;tant que les mots ayant des contextes similaires
ont souvent des morph&#232;mes en commun. Yarowsky &amp; Wicentowski (2000) utilisent cette technique pour
faire le lien entre un verbe irr&#233;gulier et sont lex&#232;me. L&#8217;apprentissage analogique a r&#233;cemment fait l&#8217;objet
de plusieurs &#233;tudes en traitement automatique des langues (Lepage &amp; Denoual, 2005; Denoual, 2007;
Langlais &amp; Patry, 2007). En particulier, plusieurs auteurs ont appliqu&#233; l&#8217;analogie formelle (ou analogie
pour simplifier) &#224; l&#8217;analyse morphologique. Stroppa &amp; Yvon (2005) ont d&#233;montr&#233; que l&#8217;apprentissage
analogique permet d&#8217;apprendre de mani&#232;re supervis&#233;e &#224; identifier la racine d&#8217;un mot et ses caract&#233;ristiques
morphologiques. Hathout montre qu&#8217;il est possible de regrouper automatiquement les mots d&#8217;un lexique
en familles morphologiques en combinant l&#8217;analogie &#224; des donn&#233;es s&#233;mantiques (Hathout, 2002, 2008).
Langlais (2009) a utilis&#233; l&#8217;analogie pour analyser morphologiquement les mots de la base de donn&#233;es
anglaise et allemande de Celex.
</p>
<p>L&#8217;approche d&#233;crite dans (Langlais, 2009) ne permet pas de traiter des lexiques de la taille de ceux que nous
manipulons dans cette &#233;tude. Nous introduisons le concept de r&#232;gle de cofacteur (RC) qui permet &#224; notre
syst&#232;me de g&#233;n&#233;raliser l&#8217;information captur&#233;e par l&#8217;analogie tout en r&#233;duisant significativement les temps
de calculs. Nous d&#233;crivons un algorithme de regroupement de mots bas&#233; sur les graphes qui fait usage
des RCs apprises en corpus. Les mots regroup&#233;s sont alors d&#233;compos&#233;s automatiquement en morph&#232;mes
&#224; l&#8217;aide d&#8217;un algorithme d&#233;di&#233;. Nous appliquons notre syst&#232;me sur diff&#233;rentes langues, dont des langues
&#224; morphologie riche et montrons sa sup&#233;riorit&#233; sur le syst&#232;me d&#233;crit par Langlais (2009). Nous montrons
&#233;galement que notre syst&#232;me produit des r&#233;sultats comp&#233;titifs avec ceux deMorfessor.
</p>
<p>La suite de cet article est structur&#233;e comme suit. Nous d&#233;crivons en section 2 le mod&#232;le qui d&#233;compose
de mani&#232;re non supervis&#233;e les mots d&#8217;un lexique en leurs morph&#232;mes. Nous pr&#233;sentons en section 3 notre
protocole exp&#233;rimental et les r&#233;sultats obtenus. Nous concluons ce travail en section 4 et proposons des
pistes de d&#233;veloppements futurs.
</p>
<p>2 Mod&#232;le
</p>
<p>Le syst&#232;me que nous pr&#233;sentons ici est bas&#233; sur le moteur analogique d&#233;velopp&#233; par Langlais (2009).
En particulier, nous continuons &#224; nous appuyer sur l&#8217;analogie formelle pour extraire de mani&#232;re non su-
pervis&#233;e l&#8217;information morphologique d&#8217;un lexique. Bien qu&#8217;il existe plusieurs d&#233;finitions de l&#8217;analogie
formelle (voir par exemple (Pirrelli &amp; Yvon, 1999)), nous reprenons celle utilis&#233;e par l&#8217;auteur, initiale-
ment propos&#233;e par Yvon et al. (2004) qui lient la d&#233;finition d&#8217;une analogie entre formes &#224; celle de leur
factorisation.
</p>
<p>Le lecteur int&#233;ress&#233; trouvera dans ces &#233;tudes les d&#233;tails de cette d&#233;finition. Nous l&#8217;illustrons simplement
&#224; l&#8217;aide d&#8217;un exemple. La relation entre les 4 mots cordially, cordial, lovely et love est une
analogie, ce que l&#8217;on note [cordially : cordial = lovely : love], car il existe une factorisation
</p>
<p>1http://www.cis.hut.fi/morphochallenge2009/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>APPRENTISSAGE NON SUPERVIS&#201; DE LA MORPHOLOGIE D&#8217;UNE LANGUE PAR G&#201;N&#201;RALISATION DE
RELATIONS ANALOGIQUES
</p>
<p>de ces 4 cha&#238;nes qui met en jeu des alternances. La figure 1 illustre deux factorisations de ces cha&#238;nes.
Celle de gauche met en &#339;uvre 4 facteurs par factorisation, tandis que celle de droite n&#8217;en utilise que 2,
illustrant les alternances love/cordial et ly/&#15; captur&#233;es par cette analogie. Le nombre de facteurs de
la plus petite factorisation est appel&#233; le degr&#233; de l&#8217;analogie ; soit 2 dans l&#8217;exemple.
</p>
<p>fcordially &#8801; cordia l l y fcordially &#8801; cordial ly
fcordial &#8801; cordia &#15; l &#15; fcordial &#8801; cordial &#15;
flovely &#8801; love l &#15; y flovely &#8801; love ly
flove &#8801; love &#15; &#15; &#15; flove &#8801; love &#15;
</p>
<p>FIG. 1 &#8211; Deux factorisations de l&#8217;analogie [cordially : cordial = lovely : love].
</p>
<p>L&#8217;hypoth&#232;se fondatrice de notre syst&#232;me est que les analogies identifient implicitement deux paires de
formes qui sont morphologiquement li&#233;es. Par exemple, l&#8217;analogie de la figure 1 relie love &#224; lovely et
cordial &#224; cordially. Le syst&#232;me d&#233;crit par Langlais (2009) repose enti&#232;rement sur cette hypoth&#232;se.
Chaque fois qu&#8217;un mot est impliqu&#233; dans une analogie, sa factorisation est calcul&#233;e et une distribution des
factorisations observ&#233;es est maintenue. L&#8217;analyse morphologique r&#233;sultante pour un mot du lexique est la
segmentation la plus fr&#233;quemment observ&#233;e. Ce syst&#232;me requiert donc de calculer toutes les analogies im-
pliquant les mots d&#8217;un lexique L, ce qui requiert de v&#233;rifierO(|L|4) analogies. M&#234;me en utilisant plusieurs
optimisations (Stroppa, 2005; Langlais &amp; Yvon, 2008), les temps de calculs sont trop importants lorsque
le lexique d&#233;passe quelques dizaines de milliers de mots.
</p>
<p>Le probl&#232;me est que l&#8217;information captur&#233;e par ce syst&#232;me est fortement lexicale. Ainsi, l&#8217;analogie [love :
lovely = cordial : cordially ] ne nous donne aucune information sur la relation entre love et
loved ou entre live et lively. Le c&#339;ur de notre syst&#232;me consiste &#224; introduire un proc&#233;d&#233; capable de
g&#233;n&#233;raliser l&#8217;information captur&#233;e par une analogie.
</p>
<p>2.1 CoFacteur et RC
</p>
<p>Les cofacteurs d&#8217;une analogie de degr&#233;e d [x : y = z : t] sont les d alternances intervenant dans
les factorisations des termes de l&#8217;analogie (Langlais &amp; Patry, 2007). Dans notre exemple, nous avons 2
cofacteurs : love/cordial et ly/&#15;. Il est important de noter que ces paires de facteurs ne sont pas
dirig&#233;es, c&#8217;est-&#224;-dire que la paire ly/&#15; est &#233;gale &#224; la paire &#15;/ly. Le cofacteur ly/&#15; capture en anglais le
ph&#233;nom&#232;ne productif o&#249; un adverbe est d&#233;riv&#233; d&#8217;un substantif ou d&#8217;un adjectif en lui ajoutant le suffixe
ly. Il permettrait par exemple de rendre compte de la forme flabbergastedly &#224; partir de la forme
flabbergasted (ou l&#8217;inverse) m&#234;me si cette derni&#232;re n&#8217;est pas pr&#233;sente dans le lexique. Il permet
malheureusement de lier &#224; tort les formes flyable et fable.
</p>
<p>La g&#233;n&#233;ralisation offerte par les cofacteurs peut donc introduire du bruit si on l&#8217;applique aveugl&#233;ment. Ceci
nous a amen&#233; &#224; introduire le concept de r&#232;gle de cofacteur (RC), une r&#232;gle de r&#233;&#233;criture contextualis&#233;e.
Plus pr&#233;cis&#233;ment, une RC est une r&#232;gle de r&#233;&#233;criture &#12296;&#945; &#8594; &#946;&#12297; o&#249; &#945; et &#946; sont les deux facteurs d&#8217;un
cofacteur et tel que |&#945;| &#8805; |&#946;|2, de sorte que l&#8217;application d&#8217;une RC &#224; un mot produise toujours un mot de
taille inf&#233;rieure ou &#233;gale. Afin de r&#233;duire le bruit inh&#233;rent &#224; l&#8217;application d&#8217;une telle r&#232;gle, nous ajoutons
le symbole ? &#224; gauche et/ou &#224; droite de ces facteurs pour indiquer l&#8217;existence d&#8217;un facteur non vide &#224;
</p>
<p>2Si les deux facteurs sont de la m&#234;me taille, l&#8217;ordre alphab&#233;tique est utilis&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEAN-FRAN&#199;OIS LAVALL&#201;E, PHILIPPE LANGLAIS
</p>
<p>gauche et/ou &#224; droite de l&#8217;alternance consid&#233;r&#233;e. Ceci est fait dans le but de distinguer les op&#233;rations de
pr&#233;fixation, de suffixation et d&#8217;infixation communes &#224; de nombreuses langues. Dans notre exemple, les
RCs &#12296;?ly &#8594; ?&#15;&#12297; et &#12296;love? &#8594; cordial?&#12297; sont produites. La pr&#233;sence du symbole ? &#224; gauche de ly
dans la premi&#232;re RC interdit par exemple de lier les formes flyable et fable.
</p>
<p>Nous notons R(x), l&#8217;application de la RC R sur une forme x. Par exemple, si R est &#12296;?ly &#8594; ?&#15;&#12297;, alors
R(elderly) = elder. Par extension directe, [R1, . . . ,Rn](x) d&#233;note la forme3 r&#233;sultante de l&#8217;appli-
cation de n RCs :Rn(. . .R2(R1(x)) . . .). Dans le cas o&#249; la r&#232;gle ne s&#8217;applique pas, on aR(x) = x.
</p>
<p>2.2 Extraction des RCs
</p>
<p>Obtenir les RCs requiert d&#8217;identifier un ensemble d&#8217;analogies mettant en &#339;uvre les mots du lexique. Dans
la mesure o&#249; les RCs op&#232;rent une g&#233;n&#233;ralisation de l&#8217;information captur&#233;e par analogie, il n&#8217;est pas n&#233;-
cessaire d&#8217;identifier l&#8217;ensemble de ces analogies. En pratique cependant, nous en avons calcul&#233; un grand
nombre par lexique (voir la section 3).
</p>
<p>Nous avons consid&#233;r&#233; diff&#233;rentes fa&#231;on d&#8217;associer un score &#224; une RC. Se baser seulement sur la fr&#233;quence
cr&#233;e un biais envers les RCs compos&#233;es de facteurs courts. Par exemple, en anglais, la RC &#12296;anti-? &#8594; &#15;?&#12297;
est observ&#233;e 2 472 fois. Cependant la RC &#12296;ka? &#8594; &#15;?&#12297;, qui est fort probablement fortuite, est vue 13 839
fois. Pour r&#233;soudre ce probl&#232;me, nous utilisons une deuxi&#232;me m&#233;trique : la productivit&#233; d&#8217;une r&#232;gle R,
not&#233;e prod(R), est d&#233;finie par le ratio du nombre de fois o&#249; l&#8217;application de cette r&#232;gle m&#232;ne &#224; une forme
valide du lexique L au nombre de formes de L auxquelles elle peut-&#234;tre appliqu&#233;e. Formellement :
</p>
<p>prod(R) = |{x &#8712; L : R(x) &#8712; L}||{x &#8712; L : R(x) 6= x}|
</p>
<p>Les RCs &#12296;anti-? &#8594; &#15;?&#12297; et &#12296;ka? &#8594; &#15;?&#12297; ont des productivit&#233;s respectives de 0,9490 et 0,2472. La
productivit&#233; et la fr&#233;quence de quelques RCs extraites d&#8217;un lexique anglais utilis&#233; dans nos exp&#233;riences
sont rapport&#233;es en table 1. Comme le nombre de RCs rencontr&#233;es est tr&#232;s &#233;lev&#233;, nous appliquons un filtre
qui &#233;limine celles ayant une productivit&#233; inf&#233;rieure &#224; &#961; (voir la section 3) en esp&#233;rant qu&#8217;elles ne jouent
pas un r&#244;le important dans la morphologie de la langue &#233;tudi&#233;e.
</p>
<p>TAB. 1 &#8211; Fr&#233;quence et productivit&#233; de RCs extraites d&#8217;un lexique anglais.
</p>
<p>RCs Fr&#233;quence Productivit&#233;
&#12296;?&#8217;s&#8594; ?&#15;&#12297; 2 225 258 0.93
&#12296;?a? &#8594; ?&#15;?&#12297; 288 743 0.04
&#12296;?ing&#8594; ?ed&#12297; 4 669 0.54
&#12296;?-based&#8594; ?&#15;&#12297; 3 226 0.98
&#12296;?co&#8594; ?as&#12297; 68 0.10
&#12296;?able&#8217;s&#8594; ?able&#12297; 65 1.00
</p>
<p>3Afin de simplifier l&#8217;expos&#233;, nous omettons le cas o&#249; l&#8217;application d&#8217;une RC peut g&#233;n&#233;rer plusieurs formes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>APPRENTISSAGE NON SUPERVIS&#201; DE LA MORPHOLOGIE D&#8217;UNE LANGUE PAR G&#201;N&#201;RALISATION DE
RELATIONS ANALOGIQUES
</p>
<p>2.3 Construction des arbres de d&#233;rivation de mots (ADM)
</p>
<p>L&#8217;ensemble des RCs collect&#233;es &#224; l&#8217;&#233;tape pr&#233;c&#233;dente constitue la mati&#232;re premi&#232;re de notre syst&#232;me. &#192;
l&#8217;aide de ces RCs, nous formons des regroupements de mots partageant la m&#234;me racine. Nos regroupe-
ments sont structur&#233;s hi&#233;rarchiquement sous la forme d&#8217;arbres (ADM) comme celui de la figure 2. Les
noeuds de ces arbres sont les mots du lexique. Un arc entre deux noeuds na et nb, not&#233; na &#8594; nb, est &#233;ti-
quet&#233; d&#8217;une s&#233;quence de RCs qui lorsque appliqu&#233;es au mot na r&#233;sultent en le mot nb. Dans notre exemple,
les s&#233;quences de RCs sont toutes des singletons.
</p>
<p>arm
unarm[un? &#8594; &#15;?]
</p>
<p>armed disarmed disarming
[?ing &#8594; ?ed][dis? &#8594; &#15;?]
</p>
<p>[?ed &#8594; ?&#15;
]
</p>
<p>1
.
</p>
<p>FIG. 2 &#8211; ADM des mots anglais d&#233;riv&#233;s de arm.
</p>
<p>La construction des ADMs est un processus glouton qui applique les trois &#233;tapes suivantes jusqu&#8217;&#224; ce que
tous les mots du lexique soient trait&#233;s. Le r&#233;sultat de ce processus est une for&#234;t d&#8217;ADMs o&#249; chaque arbre
regroupe, du moins nous l&#8217;esp&#233;rons, les mots du lexique reli&#233;s morphologiquement.
</p>
<p>1. Choisir un mot n du lexique L qui n&#8217;a pas encore &#233;t&#233; trait&#233;.4
2. Calculer S(n) : l&#8217;ensemble des mots de L qui peuvent &#234;tre atteints en appliquant un nombre stricte-
</p>
<p>ment positif de RCs au mot n.
</p>
<p>3. Ajouter un arc n &#8594; b, o&#249; b &#8801; argmaxw&#8712;S(n) score(n,w) est le mot de S(n) maximisant un score
(d&#233;crit ci-apr&#232;s) , si ce score est sup&#233;rieur &#224; un seuil donn&#233; &#964; (voir section 3).
</p>
<p>La figure 3 illustre la construction de S(n &#8801; disarmed) &#224; l&#8217;&#233;tape 2. Comme on peut l&#8217;observer, il est
fr&#233;quent que plusieurs chemins (s&#233;quences de RCs) entre deux mots existent. Le score d&#8217;un lien entre deux
mots n et w est donc calcul&#233; en sommant le score de chacun des chemins entre ces deux mots :
</p>
<p>score(n,w) =
&#8721;
</p>
<p>[R1,...,Rm](n)&#8801;w
score([R1, . . . ,Rm])
</p>
<p>o&#249; le score d&#8217;une s&#233;quence de RCs [R1, . . . ,Rm] est calcul&#233; par le produit des productivit&#233;s de chaque
RC :
</p>
<p>score([R1, . . . ,Rm]) =
m&#8719;
i=1
</p>
<p>prod(Ri)
</p>
<p>Le mot b retenu &#224; l&#8217;&#233;tape 3 est ajout&#233; &#224; l&#8217;ADM et l&#8217;arc entre n et b est &#233;tiquet&#233; par la s&#233;quence de RCs
[R1, . . . ,Rm] du chemin entre n et b ayant le plus haut score. Dans notre exemple, la forme disarm
totalisant un score de 0, 96 est celle qui est s&#233;lectionn&#233;e &#224; l&#8217;&#233;tape 3, et la s&#233;quence [&#12296;?med &#8594; ?m&#12297;]
&#233;tiquette dans l&#8217;ADM l&#8217;arc disarmed&#8594; disarm.
</p>
<p>4L&#8217;ordre dans lequel les mots de L sont choisis n&#8217;a pas d&#8217;importance.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEAN-FRAN&#199;OIS LAVALL&#201;E, PHILIPPE LANGLAIS
</p>
<p>disarmeddis
</p>
<p>disarmarmed
</p>
<p>disa
</p>
<p>arm
</p>
<p>&#12296;?armed&#8594; ?&#15;&#12297; 0.52
</p>
<p>&#12296;?med&#8594; ?m&#12297; 0.49
&#12296;?armed&#8594; ?arm&#12297; 0.47
</p>
<p>&#12296;?rmed&#8594; ?&#15;&#12297; 0.37
</p>
<p>&#12296;dis?
&#8594; &#15;?
</p>
<p>&#12297; 0.4
3
</p>
<p>&#12296;dis? &#8594; &#15;?&#12297; 0.43&#12296;?med&#8594; ?m&#12297; 0.49
1
</p>
<p>.
</p>
<p>FIG. 3 &#8211; Graphe des mots atteignables depuis le mot anglais disarmed. Les arcs en pointill&#233;s sont ceux
consid&#233;r&#233;s lors du calcul du score entre disarmed et arm.
</p>
<p>2.3.1 Segmentation en morph&#232;mes
</p>
<p>Chaque noeud de l&#8217;ADM contient la segmentation en morph&#232;mes (potentiels) du mot qui lui est associ&#233;.
Dans le cas de la racine, le seul morph&#232;me est le mot lui-m&#234;me. Pour tout autre noeud n, l&#8217;ensemble des
morph&#232;mes est constitu&#233; en regroupant les morph&#232;mes du noeud parent p et de ceux des RCs &#233;tiquetant
l&#8217;arc p &#8594; n. Par exemple, dans le cas d&#8217;un ADM qui contient l&#8217;arc disarmed &#8594; arm &#233;tiquet&#233; par
[&#12296;dis? &#8594; &#15;?&#12297;,&#12296;?ed &#8594; ?&#15;&#12297;], les morph&#232;mes de disarmed sont [arm,dis,ed] ; dis et ed provenant
de leur RC respective. Ce proc&#233;d&#233; simple en apparence implique un algorithme assez compliqu&#233; que nous
ne d&#233;taillons pas, faute de place. Un point int&#233;ressant de notre approche est qu&#8217;elle permet de g&#233;rer des
cas plus complexes que la simple segmentation. Par exemple, l&#8217;analyse fournie pour le mot abilities
est [ability,ies] car l&#8217;arc entre abilities et ability est &#233;tiquet&#233; par [&#12296;?ies&#8594; ?y&#12297;].
</p>
<p>3 Exp&#233;riences
</p>
<p>3.1 T&#226;che
</p>
<p>Les exp&#233;riences d&#233;crites ici ont &#233;t&#233; r&#233;alis&#233;es en partie dans le cadre de notre participation &#224; Morpho Chal-
lenge 2009. La t&#226;che &#224; laquelle nous nous int&#233;ressons (t&#226;che 1 de Morpho Challenge) consiste &#224; identifier
dans un lexique les paires de mots reli&#233;s morphologiquement, c&#8217;est-&#224;-dire les mots partageant au moins
un morph&#232;me. Un lexique de r&#233;f&#233;rence connu des seuls organisateurs liste l&#8217;ensemble des paires de mots
reli&#233;s et le nombre de morph&#232;mes qu&#8217;ils partagent. La qualit&#233; des syst&#232;mes est &#233;valu&#233;e en terme de pr&#233;ci-
sion, rappel et f-mesure selon une proc&#233;dure d&#8217;&#233;chantillonnage d&#233;crite dans (Kurimo &amp; Varjokallio, 2008).
Un cr&#233;dit sup&#233;rieur est donn&#233; au syst&#232;me lorsqu&#8217;il identifie le m&#234;me nombre de morph&#232;mes partag&#233;s par
une paire de mots que dans la r&#233;f&#233;rence. Cette proc&#233;dure d&#8217;&#233;valuation ne fait aucunement usage de l&#8217;iden-
tit&#233; des morph&#232;mes puisque les approches &#233;valu&#233;es sont non supervis&#233;es, ce qui exclue &#224; priori un jeu de
morph&#232;mes commun aux diff&#233;rentes approches.
</p>
<p>Cette t&#226;che diff&#232;re d&#8217;une t&#226;che de segmentation en morph&#232;mes. Par exemple, les segmentations chien+s
et hibou+x seraient valides dans le cas d&#8217;une &#233;valuation par segmentation, tandis qu&#8217;ici, il faut recon-
na&#238;tre que s et x sont 2 repr&#233;sentations du m&#234;me morph&#232;me &#8220;pluriel d&#8217;un nom&#8221;. De plus, il faut diff&#233;-
rencier les morph&#232;mes partageant la m&#234;me repr&#233;sentation comme s qui marque aussi bien le pluriel d&#8217;un
nom en fran&#231;ais que la deuxi&#232;me personne du singulier d&#8217;un verbe.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>APPRENTISSAGE NON SUPERVIS&#201; DE LA MORPHOLOGIE D&#8217;UNE LANGUE PAR G&#201;N&#201;RALISATION DE
RELATIONS ANALOGIQUES
</p>
<p>3.2 Donn&#233;es
</p>
<p>Nous avons &#233;tudi&#233; notre syst&#232;me sur les lexiques de 5 langues (anglais, allemand, turc, finnois et arabe)
mis &#224; disposition aux participants de Morpho Challenge 2009. Comme le montre la table 2, la taille de ces
lexiques est tr&#232;s variable. Le lexique finnois comporte plus de 2 millions de mots alors que le lexique arabe
en contient un peu moins de 15 000. Nous signalons que ces lexiques, extraits de textes r&#233;els, contiennent
de nombreux noms propres ainsi que des erreurs typographiques qui compliquent la t&#226;che d&#8217;analyse.
</p>
<p>TAB. 2 &#8211; Taille des lexiques de Morpho Challenge 2009.
</p>
<p>ANG. ALL. TUR. FIN. ARB.
Nb. de mots 384 903 1 266 159 617 298 2 206 719 14 957
</p>
<p>L&#8217;&#233;valuation de notre syst&#232;me pour ces 5 langues a &#233;t&#233; effectu&#233;e par les organisateurs deMorpho Challenge
2009. Apr&#232;s la campagne, nous avons &#233;valu&#233; l&#8217;impact des m&#233;ta-param&#232;tres contr&#244;lant notre mod&#232;le &#224;
l&#8217;aide de r&#233;f&#233;rences extraites de la base de donn&#233;es de Celex (Baayen et al., 1995) pour l&#8217;allemand et
l&#8217;anglais. La table 3 fait &#233;tat des principales caract&#233;ristiques des deux r&#233;f&#233;rences que nous avons mises au
point.
</p>
<p>TAB. 3 &#8211; Principales caract&#233;ristiques de la r&#233;f&#233;rence Celex. De gauche &#224; droite : la taille en nombre de
mots du lexique, le nombre de morph&#232;mes distincts, la moyenne du nombre d&#8217;analyses possibles pour un
mot, le nombre de morph&#232;mes moyens pour une analyse, le nombre moyen de mots avec lequel un mot
partage au moins 1 morph&#232;me.
</p>
<p>Nb. Mots Nb. de type de morph&#232;me analyses/mot morph&#232;mes/analyse paires/mot
ANG. 72 628 16 388 1.07 2.15 21.93
ALL. 311 000 13 102 1.23 3.35 327.75
</p>
<p>3.3 R&#233;sultats
</p>
<p>Pour chaque langue, nous avons ex&#233;cut&#233; notre moteur analogique pendant une semaine sur les lexiques
fournis par les organisateurs de Morpho Challenge 2009. Nous avons ainsi recueilli un grand nombre
d&#8217;analogies : de 11 (arabe) &#224; 52 (turc) millions d&#8217;analogies ont ainsi &#233;t&#233; extraites par langue. Bien que ces
quantit&#233;s puissent para&#238;tre &#233;lev&#233;es, il est important de noter que les analogies que nous avons calcul&#233;es ne
constituent qu&#8217;une faible partie de celles existant au sein d&#8217;un lexique. De ces ensembles d&#8217;analogies ont
ensuite &#233;t&#233; extraites les RCs utilis&#233;es par notre syst&#232;me.
</p>
<p>La table 4 montre les r&#233;sultats obtenus par notre syst&#232;me pour la r&#233;f&#233;rence Celex (anglais et allemand)
selon les diff&#233;rentes valeurs de m&#233;ta-param&#232;tres qui le contr&#244;lent : &#961; (la productivit&#233; minimale d&#8217;une RC)
et &#964; (le score minimum qu&#8217;un chemin entre deux mots doit avoir pour que ces mots soient regroup&#233;s
dans un m&#234;me ADM). Comme on pouvait s&#8217;y attendre, augmenter le seuil &#964; ou la productivit&#233; minimale
&#961; am&#233;liore la pr&#233;cision au d&#233;triment du rappel. La valeur optimale du seuil &#964; pour l&#8217;anglais est de 0,3</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEAN-FRAN&#199;OIS LAVALL&#201;E, PHILIPPE LANGLAIS
</p>
<p>contrairement &#224; 0,25 pour l&#8217;allemand. Cette diff&#233;rence s&#8217;explique par le fait qu&#8217;en moyenne, le nombre de
mots en relation est plus &#233;lev&#233; pour l&#8217;allemand que pour l&#8217;anglais (voir la table 3). Donc en r&#233;duisant le
seuil, plus de relations sont cr&#233;&#233;s ce qui avantage les langues morphologiquement plus complexes.
</p>
<p>TAB. 4 &#8211; Impact des m&#233;ta-param&#232;tres &#961; et &#964; sur la Pr&#233;cision (Pr.), le Rappel (Rp.) et la F-Mesure (F1) de
notre syst&#232;me. Les analyses soumises &#224; Morpho Challenge 2009 sont soulign&#233;s et les meilleurs r&#233;sultats
sont en gras.
</p>
<p>&#961; = 0.20 &#961; = 0.25 &#961; = 0.30
Pr. Rc. F1 Pr. Rc. F1 Pr. Rc. F1
</p>
<p>&#964; = 0.20
ANG. 51.98 52.13 51.81 59.55 47.94 52.92 66.43 44.8 53.32
ALL. 60.01 42.59 49.39 66.99 37.71 47.81 70.72 32.11 43.71
</p>
<p>&#964; = 0.25
ANG. 61.02 48.85 54.04 60.59 47.9 53.31 65.67 44.76 53.05
ALL. 68.89 41.66 52.24 67.07 40.15 49.61 70.56 32.11 43.70
</p>
<p>&#964; = 0.30
ANG. 65.97 46.75 54.52 66.20 45.29 53.59 66.97 44.72 53.46
ALL. 68.89 41.66 51.38 69.87 36.24 47.02 71.03 32.11 43.82
</p>
<p>&#964; = 0.35
ANG. 71.46 43.09 53.54 71.27 40.81 51.65 72.45 39.62 50.94
ALL. 70.66 33.42 44.75 72.14 30.01 41.60 74.05 25.99 37.89
</p>
<p>&#964; = 0.40
ANG. 74.22 41.15 52.76 76.10 38.88 51.26 76.72 37.61 50.25
ALL. 71.48 32.43 44.00 74.99 28.98 41.09 75.99 24.38 36.30
</p>
<p>La table 5 donne les r&#233;sultats officiels obtenus &#224; Morpho Challenge 2009 par les deux syst&#232;mes Rali-Cof
et Rali-Ana que nous avons soumis aux organisateurs pour les 5 langues, ainsi que le syst&#232;meMorfessor5,
un syst&#232;me jouissant d&#8217;une large distribution et qui est fr&#233;quemment employ&#233; comme r&#233;f&#233;rence dans le
domaine. Le premier syst&#232;me est celui que nous avons d&#233;crit dans cette &#233;tude avec un seuil de productivit&#233;
&#961; de 0.25 et un seuil de score &#964; de 0,3 pour toutes les langues. Le deuxi&#232;me syst&#232;me est celui propos&#233;
par Langlais (2009). Nous soulignons que ces deux syst&#232;mes font usage du m&#234;me ensemble d&#8217;analogies
d&#233;crit plus haut.
</p>
<p>On observe que notre syst&#232;me Rali-Cof surpasse Rali-Ana et Morfessor sur trois des cinq langues : l&#8217;alle-
mand, le finnois et le turc. Le faible rappel obtenu par Rali-Ana s&#8217;explique par le fait qu&#8217;une petite partie
seulement des analogies a &#233;t&#233; calcul&#233;e (voir la section 3.2).
</p>
<p>Nous observons aussi que les r&#233;sultats de Rali-Cof sont similaires pour toutes les langues &#224; l&#8217;exception
de l&#8217;arabe qui a un rappel tr&#232;s faible. Il se pourrait que ce soit caus&#233; par la tr&#232;s petite taille du lexique
fourni. Comme l&#8217;apprentissage analogique se base sur les sch&#233;mas observ&#233;s pour identifier les morph&#232;mes,
plusieurs morph&#232;mes valides ont pu &#234;tre mis de cot&#233; d&#251; &#224; leur faible fr&#233;quence dans l&#8217;ensemble de test.
</p>
<p>Il est difficile d&#8217;attribuer un rang global &#224; un syst&#232;me dans la comp&#233;tition Morpho Challenge, mais nous
pouvons tout de m&#234;me faire les observations suivantes. Premi&#232;rement, aucun comp&#233;titeur n&#8217;a r&#233;ussi &#224; ob-
tenir des r&#233;sultats satisfaisants sur l&#8217;arabe. Deuxi&#232;mement, notre approche a termin&#233; parmi les meilleures
pour les autres langues ; exception faite de l&#8217;anglais o&#249; plusieurs syst&#232;mes (dontMorfessor) sont tr&#232;s bons.
Paramor est le seul syst&#232;me nous ayant surpass&#233; sur ces 4 langues6. Troisi&#232;mement, Rali-Cof a obtenu des
r&#233;sultats sup&#233;rieurs &#224; ceux du syst&#232;me &#224; base de grapheMorphoNet (Bernhard, 2010) sur toutes les langues
</p>
<p>5Nous avons utilis&#233; la version 1.0 disponible sur http ://www.cis.hut.fi/projects/morpho/.
6Nos r&#233;sultats ont &#233;t&#233; produits sans ajustement des m&#233;ta-param&#232;tres.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>APPRENTISSAGE NON SUPERVIS&#201; DE LA MORPHOLOGIE D&#8217;UNE LANGUE PAR G&#201;N&#201;RALISATION DE
RELATIONS ANALOGIQUES
</p>
<p>autre que l&#8217;arabe. Comme ces deux syst&#232;mes se rejoignent sur plusieurs points, ceci laisse pr&#233;sager que
l&#8217;analogie prodigue un gain r&#233;el. Finalement, malgr&#233; le fait que Morfessor a de meilleurs r&#233;sultats pour
l&#8217;anglais, notre approche le surpasse sur les langues morphologiquement plus complexes. Ceci est parti-
culi&#232;rement important car les b&#233;n&#233;fices potentiels de l&#8217;analyse morphologique sont plus importants pour
ces langues.
</p>
<p>TAB. 5 &#8211; Pr&#233;cision (Pr.), Rappel (Rp.) et f-mesure (F1) des syst&#232;mes analogiques et du syst&#232;me de r&#233;f&#233;-
rence Morfessor &#224; l&#8217;atelier Morpho Challenge 2009.
</p>
<p>Rali-Cof Rali-Ana Morfessor
Pr. Rp. F1 Pr. Rp. F1 Pr. Rp. F1
</p>
<p>ANG. 68.32 46.45 55.30 64.61 33.48 44.10 74.93 49.81 59.84
FIN. 74.76 26.20 38.81 60.06 10.33 17.63 89.41 15.73 26.75
TUR. 48.43 44.54 46.40 69.52 12.85 21.69 89.68 17.78 29.67
ALL. 67.53 34.38 45.57 61.39 15.34 24.55 81.70 22.98 35.87
ARB. 94.56 2.13 4.18 92.40 4.40 8.41 91.77 6.44 12.03
</p>
<p>4 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; le syst&#232;me Rali-Cof que nous avons d&#233;velopp&#233; dans le cadre de Morpho Challenge
2009. Bien que Rali-Cof et Rali-Ana soient tous les deux bas&#233;s sur le principe d&#8217;analogie formelle, Rali-
Cof se diff&#233;rencie par sa capacit&#233; &#224; g&#233;n&#233;raliser l&#8217;information captur&#233;e passivement par une analogie. Un
des avantages de cette abstraction op&#233;r&#233;e par les RCs est que Rali-Cof n&#8217;utilise qu&#8217;un (petit) sous-ensemble
des analogies impliquant les mots d&#8217;un lexique et est donc applicable &#224; des lexiques beaucoup plus volu-
mineux que ceux analysables par le syst&#232;me de segmentation sugg&#233;r&#233; par Langlais (2009).
</p>
<p>Notre syst&#232;me surpasse le syst&#232;me Morfessor pour le turc, le finnois et l&#8217;allemand, trois langues &#224; la
morphologie complexe. Ces r&#233;sultats appuient donc notre hypoth&#232;se que l&#8217;analogie formelle peut &#234;tre
utilis&#233;e efficacement pour r&#233;aliser de mani&#232;re non supervis&#233;e l&#8217;analyse morphologique d&#8217;une langue.
</p>
<p>Nous avons &#233;galement montr&#233; qu&#8217;il est possible d&#8217;influencer le niveau de pr&#233;cision et de rappel de notre
syst&#232;me en modifiant les valeurs de ses m&#233;ta-param&#232;tres. Ceci permet d&#8217;adapter nos analyses &#224; la t&#226;che &#224;
accomplir.
</p>
<p>Plusieurs pistes de recherche restent &#224; explorer &#224; l&#8217;issue de ce travail. Premi&#232;rement, m&#234;me si les RCs cap-
turent plus d&#8217;information contextuelle que les cofacteurs, d&#8217;autres alternatives pourraient &#234;tre consid&#233;r&#233;es,
comme les expressions r&#233;guli&#232;res utilis&#233;es par Bernhard (2010). Il reste cependant &#224; v&#233;rifier que ce type
de r&#232;gle n&#8217;introduit pas trop de bruit. Deuxi&#232;mement, nous avons observ&#233; une tendance &#224; la sursegmenta-
tion des ADM que nous produisons. Nous sommes confiants que nous pouvons am&#233;liorer la qualit&#233; de ces
regroupements. Enfin, nous souhaitons &#233;tudier l&#8217;impact de la quantit&#233; d&#8217;analogies extraites d&#8217;un lexique
sur les performances de notre syst&#232;me.
</p>
<p>Remerciements
Cette &#233;tude a &#233;t&#233; partiellement financ&#233;e par le programme MITACS.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JEAN-FRAN&#199;OIS LAVALL&#201;E, PHILIPPE LANGLAIS
</p>
<p>R&#233;f&#233;rences
BAAYEN R. H., PIEPENBROCK R. &amp; GULIKERS L. (1995). The CELEX lexical database (release 2).
CD-ROM, Linguistic Data Consortium, Univ. of Pennsylvania, USA.
BERNHARD D. (2010). Morphonet : Exploring the use of community structure for unsupervised mor-
pheme analysis. In 10th CLEF Workshop, Corfu,Greece.
CREUTZ M. &amp; LAGUS K. (2005). Unsupervised morpheme segmentation and morphology induction
from text corpora using morfessor 1.0. In Publications in Computer and Information Science, Report
A81, Helsinki University of Technology.
DENOUAL E. (2007). Analogical translation of unknown words in a statistical machine translation fra-
mework. In MT Summit, XI, Copenhagen.
GOLDSMITH J. (2001). Unsupervised learning of the morphology of a natural language. Computational
Linguistics, 27, 153&#8211;198.
HARRIS Z. S. (1955). From phoneme to morpheme. Language, 31(2), 190&#8211;222.
HATHOUT N. (2002). From wordnet to celex : acquiring morphological links from dictionaries of syno-
nyms. In 3rd LREC, p. 1478&#8211;1484, Las Palmas de Gran Canaria.
HATHOUT N. (2008). Acquistion of the morphological structure of the lexicon based on lexical similarity
and formal analogy. In 3rd Textgraphs workshop, p. 1&#8211;8, Manchester, United Kingdom.
KURIMO M. &amp; VARJOKALLIO M. (2008). Unsupervised morpheme analysis evaluation by a comparison
to a linguistic gold standard &#8211; Morpho Challenge 2008. In CLEF 2008 Workshop.
LANGLAIS P. (2009). &#201;tude quantitative de liens entre l&#8217;analogie formelle et la morphologie construc-
tionnelle. In 16&#232; Conf&#233;rence sur le Traitement Automatique des Langues Naturelles (TALN&#8217;09), Senlis,
France.
LANGLAIS P. &amp; PATRY A. (2007). Translating unknown words by analogical learning. In EMNLP-
CoNLL, p. 877&#8211;886, Prague, Czech Republic.
LANGLAIS P. &amp; YVON F. (2008). Scaling Up Analogical Learning. Rapport interne, Paritech, INFRES,
IC2, Paris, France.
LEPAGE Y. &amp; DENOUAL E. (2005). Purest ever example-based machine translation : Detailed presenta-
tion and assessment. Machine Translation, 29, 251&#8211;282.
MONSON C., CARBONELL J., LAVIE A. &amp; LEVIN L. (2007). Paramor : Minimally supervised induction
of paradigm structure and morphological analysis. In Proceedings of 9th SIGMORPHON Workshop, p.
117&#8211;125, Prague, Czech Republic : ACL.
PIRRELLI V. &amp; YVON F. (1999). The hidden dimension : a paradigmatic view of data-driven NLP.
Journal of Experimental &amp; Theroretical Artifical Intelligence, 11, 391&#8211;408.
STROPPA N. (2005). D&#233;finitions et caract&#233;risations de mod&#232;les &#224; base d&#8217;analogies pour l&#8217;apprentissage
automatique des langues naturelles. PhD thesis, ENST, ParisTech, T&#233;l&#233;com, Paris, France.
STROPPA N. &amp; YVON F. (2005). An analogical learner for morphological analysis. In CoNLL, p.
120&#8211;127, Ann Arbor, MI.
YAROWSKY D. &amp; WICENTOWSKI R. (2000). Minimally supervised morphological analysis by multimo-
dal alignment. In ACL &#8217;00 : Proceedings of the 38th Annual Meeting on Association for Computational
Linguistics, p. 207&#8211;216, Morristown, NJ, USA : Association for Computational Linguistics.
YVON F., STROPPA N., DELHAY A. &amp; MICLET L. (2004). Solving analogical equations on words.
Rapport interne D005, ENST, Paris, France.</p>

</div></div>
</body></html>