<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Adapter un syst&#232;me de question-r&#233;ponse en domaine ouvert au domaine m&#233;dical</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Adapter un syst&#232;me de question-r&#233;ponse en domaine ouvert au
domaine m&#233;dical
</p>
<p>Mehdi Embarek Olivier Ferret
CEA, LIST, Laboratoire Vision et Ing&#233;nierie des Contenus,
</p>
<p>Fontenay-aux-Roses, F-92265 France.
{mehdi.embarek@cea.fr,olivier.ferret}@cea.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons Esculape, un syst&#232;me de question-r&#233;ponse en fran&#231;ais
d&#233;di&#233; aux m&#233;decins g&#233;n&#233;ralistes et &#233;labor&#233; &#224; partir d&#8217;&#338;dipe, un syst&#232;me de question-r&#233;ponse en domaine
ouvert. Esculape ajoute &#224; &#338;dipe la capacit&#233; d&#8217;exploiter la structure d&#8217;un mod&#232;le du domaine, le domaine
m&#233;dical dans le cas pr&#233;sent. Malgr&#233; l&#8217;existence d&#8217;un grand nombre de ressources dans ce domaine (UMLS,
MeSH ...), il n&#8217;est pas possible de se reposer enti&#232;rement sur ces ressources, et plus sp&#233;cifiquement sur
les relations qu&#8217;elles abritent, pour r&#233;pondre aux questions. Nous montrons comment surmonter cette
difficult&#233; en apprenant de fa&#231;on supervis&#233;e des patrons linguistiques d&#8217;extraction de relations et en les
appliquant &#224; l&#8217;extraction de r&#233;ponses.
</p>
<p>Abstract. In this article, we present Esculape, a question-answering system for French dedicated to
family doctors and built from &#338;dipe, an open-domain system. Esculape adds to &#338;dipe the capability to
exploit the concepts and relations of a domain model, the medical domain in the present case. Although a
large number of resources exist in this domain (UMLS, MeSH ...), it is not possible to rely only on them,
and more specifically on the relations they contain, to answer questions. We show how this difficulty can
be overcome by learning linguistic patterns for identifying relations and applying them to extract answers.
</p>
<p>Mots-cl&#233;s : syst&#232;mes de question-r&#233;ponse, extraction de relations, domaine m&#233;dical.
</p>
<p>Keywords: question-answering systems, relation extraction, medical domain.
</p>
<p>1 Introduction
</p>
<p>Bien que les syst&#232;mes de question-r&#233;ponse (SQR) soient revenus sur le devant de la sc&#232;ne au travers
des syst&#232;mes en domaine ouvert, les SQR en domaine de sp&#233;cialit&#233; n&#8217;en sont pas moins n&#233;cessaires.
Comme l&#8217;ont montr&#233; les r&#233;sultats de la campagne d&#8217;&#233;valuation EQueR pour les SQR en fran&#231;ais (Ayache
et al., 2006), les performances des SQR en domaine ouvert chutent en effet de mati&#232;re notable lorsqu&#8217;ils
sont appliqu&#233;s en domaine de sp&#233;cialit&#233;, en l&#8217;occurrence le domaine m&#233;dical. Une des sp&#233;cificit&#233;s des
domaines de sp&#233;cialit&#233; est la disponibilit&#233; d&#8217;ontologies mod&#233;lisant les entit&#233;s et les relations du domaine
consid&#233;r&#233; avec une bonne couverture. C&#8217;est particuli&#232;rement le cas pour le domaine m&#233;dical pour lequel de
nombreuses ressources telles que l&#8217;UMLS ou le MeSH sont d&#233;velopp&#233;es depuis longtemps. &#192; l&#8217;exception
de quelques syst&#232;mes comme MedQA (Lee et al., 2006), la plupart des SQR m&#233;dicaux travaillent donc &#224;
un niveau s&#233;mantique (Niu &amp; Hirst, 2004; Demner-Fushman &amp; Lin, 2007; Jacquemart &amp; Zweigenbaum,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MEHDI EMBAREK, OLIVIER FERRET
</p>
<p>2003), ou m&#234;me logique (Terol et al., 2007), et s&#8217;appuient fortement sur des ontologies m&#233;dicales. On se
reportera &#224; (Athenikos &amp; Han, 2010) pour en avoir un panorama plus complet.
</p>
<p>Le travail que nous pr&#233;sentons dans cet article prend comme point de d&#233;part un SQR en domaine ouvert,
&#338;dipe, et l&#8217;adapte au domaine m&#233;dical en int&#233;grant une ontologie de ce domaine &#224; la fois pour l&#8217;analyse
des questions et l&#8217;extraction des r&#233;ponses. Plus pr&#233;cis&#233;ment, le syst&#232;me r&#233;sultant Esculape, d&#233;crit plus
extensivement dans (Embarek &amp; Ferret, 2010), s&#8217;appuie sur la structure de cette ontologie pour guider le
processus d&#8217;extraction des r&#233;ponses sans en exploiter le contenu en tant que source directe de r&#233;ponses.
</p>
<p>2 D&#8217;&#338;dipe &#224; Esculape
</p>
<p>2.1 Fondations d&#8217;Esculape
</p>
<p>&#338;dipe (Besan&#231;on et al., 2007) est un SQR monolingue fran&#231;ais reprenant l&#8217;architecture classique d&#8217;un
SQR mais con&#231;u comme une extension assez minimaliste d&#8217;un moteur de recherche. Le passage d&#8217;&#338;dipe
&#224; Esculape s&#8217;appuie sur le constat, partag&#233; avec Jacquemart &amp; Zweigenbaum (2003), qu&#8217;une part significa-
tive des questions dans le domaine m&#233;dical peuvent &#234;tre mod&#233;lis&#233;es sous la forme d&#8217;une relation unissant
une ou plusieurs entit&#233;s explicitement instanci&#233;es dans la question et une entit&#233; absente correspondant &#224; la
r&#233;ponse cherch&#233;e. D&#232;s lors, la premi&#232;re &#233;tape de l&#8217;adaptation d&#8217;&#338;dipe est donc pass&#233;e par la construction
d&#8217;une ontologie repr&#233;sentant les entit&#233;s et les relations les plus commun&#233;ment manipul&#233;es en m&#233;decine
g&#233;n&#233;rale. Cette ontologie a &#233;t&#233; d&#233;finie dans le cadre du projet ATONANT par l&#8217;interview de m&#233;decins et
l&#8217;analyse de leurs questions les plus typiques (Ely et al., 1999). L&#8217;ontologie produite comporte environ 20
types d&#8217;entit&#233;s et 30 types de relations proches de ceux apparaissant dans (Niu &amp; Hirst, 2004). La Fig-
ure 1 montre le sous-ensemble de cette ontologie que nous avons s&#233;lectionn&#233; pour nos exp&#233;rimentations
en question-r&#233;ponse. Bien que de nombreuses ressources soient disponibles dans le domaine m&#233;dical, leur
</p>
<p>MALADIE
</p>
<p>SYMPT&#212;ME
</p>
<p>TRAITEMENT
</p>
<p>M&#201;DICAMENT
</p>
<p>traite
</p>
<p>signesoigne
</p>
<p>d&#233;tecte EXAMEN
</p>
<p>Figure 1: Concepts et relations consid&#233;r&#233;s dans Esculape
</p>
<p>couverture tend g&#233;n&#233;ralement &#224; &#234;tre plus large concernant les entit&#233;s que les relations, en particulier pour
ce qui est des relations syntagmatiques. De ce fait, nous avons choisi de nous appuyer sur ces ressources
pour la reconnaissance des entit&#233;s m&#233;dicales dans les textes, en construisant un outil sp&#233;cifique pour le
fran&#231;ais (Embarek &amp; Ferret, 2007) (F1-mesure moyenne de 86%), mais nous avons adopt&#233; une approche
plus dynamique concernant les relations en apprenant des patrons linguistiques pour leur identification.
</p>
<p>2.2 Analyse des questions
</p>
<p>En accord avec les principes d&#233;finis &#224; la section pr&#233;c&#233;dente, l&#8217;analyse des questions op&#233;r&#233;e par Esculape
repr&#233;sente chaque question factuelle sous la forme d&#8217;un triplet (FE,R,AE), avec
</p>
<p>R la relation, uniquement binaire dans Esculape, sous-jacente &#224; la question ;
FE le focus, i.e. l&#8217;entit&#233; deR simultan&#233;ment pr&#233;sente dans la question et dans la phrase r&#233;ponse ;
AE le type de l&#8217;entit&#233; r&#233;ponse, i.e. l&#8217;entit&#233; li&#233;e &#224; FE par le biais de R.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADAPTER UN SYST&#200;ME DE QUESTION-R&#201;PONSE AU DOMAINE M&#201;DICAL
</p>
<p>Pour la question Quel est le traitement du ch&#233;rubisme ?, le module d&#8217;analyse des questions construit ainsi
la repr&#233;sentation : (Maladie:ch&#233;rubisme, TRAITE, Traitement:X), avec X , la r&#233;ponse &#224; trouver. Comme
dans &#338;dipe, l&#8217;analyse des questions dans Esculape est mise en &#339;uvre par un ensemble de r&#232;gles d&#233;finies
manuellement et compil&#233;es sous forme d&#8217;automates pour l&#8217;analyseur LIMA. Plus pr&#233;cis&#233;ment, 119 r&#232;gles
ont &#233;t&#233; d&#233;velopp&#233;es pour les quatre relations apparaissant &#224; la Figure 1. La relation TRAITE est ainsi
identifi&#233;e dans la question ci-dessus par la r&#232;gle :
</p>
<p>[Quel]::[&#234;tre$L_V] [$L_DET] [@Traitement] [$L_DET] *{1-10} [\?]:
</p>
<p>Cette r&#232;gle, d&#233;clench&#233;e par une occurrence du pronom interrogatif Quel au d&#233;but d&#8217;une phrase, illustre les
diff&#233;rents types d&#8217;information que ces r&#232;gles exploitent : forme fl&#233;chie des mots (Quel), forme lemmatis&#233;e
(&#234;tre), cat&#233;gorie morpho-syntaxique ($L_DET) et classe s&#233;mantique (@Traitement, i.e. tous les mots
faisant r&#233;f&#233;rence &#224; la notion de traitement).
</p>
<p>2.3 Extraction des r&#233;ponses
</p>
<p>&#192; l&#8217;instar d&#8217;&#338;dipe, l&#8217;extraction des r&#233;ponses dans Esculape est r&#233;alis&#233;e en se focalisant sur les entit&#233;s dont
le type est compatible avec le type attendu de la r&#233;ponse tel qu&#8217;il est trouv&#233; par l&#8217;analyse de la question.
N&#233;anmoins, alors que le score d&#8217;une r&#233;ponse dans &#338;dipe est fonction du nombre d&#8217;&#233;l&#233;ments de la question
trouv&#233;e dans son voisinage, Esculape &#233;value sa pertinence en testant si cette r&#233;ponse est li&#233;e au focus de
la question par la relation sous-jacente &#224; cette question. Cette v&#233;rification est r&#233;alis&#233;e par l&#8217;application de
patrons linguistiques identifiant chaque type de relations.
</p>
<p>Ces patrons, appel&#233;s patrons multi-niveaux, sont des expressions r&#233;guli&#232;res pouvant faire r&#233;f&#233;rence &#224;
trois niveaux d&#8217;information sur les mots fournis par l&#8217;analyseur LIMA : leur forme fl&#233;chie, leur cat&#233;-
gorie morpho-syntaxique et leur lemme. Ils sont appris de fa&#231;on supervis&#233;e en appliquant l&#8217;algorithme
d&#8217;induction de patrons d&#233;crit dans (Pantel et al., 2004) &#224; chaque couple de phrases contenant un exemple
de la relation vis&#233;e (exemple = partie de la phrase entre les deux entit&#233;s de la relation). Cet algorithme
construit le patron multi-niveau le plus sp&#233;cifique g&#233;n&#233;ralisant deux exemples en calculant d&#8217;abord la
distance d&#8217;&#233;dition entre ces deux exemples, &#233;gale au nombre minimal d&#8217;op&#233;rations d&#8217;&#233;dition (insertion,
suppression et substitution) pour passer d&#8217;un exemple &#224; l&#8217;autre. La matrice des distances entre sous-
s&#233;quences issue de ce calcul est ensuite utilis&#233;e pour &#233;tablir l&#8217;alignement optimal entre les deux exemples.
L&#8217;algorithme classique pour trouver un tel alignement est ici &#233;tendu en permettant la mise en correspon-
dance de deux mots lors d&#8217;une substitution selon les trois niveaux d&#8217;information possibles. Finalement, les
patrons sont construits en compl&#233;tant si n&#233;cessaire les alignements par des op&#233;rateurs (*s*), repr&#233;sentant
0 ou 1 mot quelconque, et (*g*), repr&#233;sentant exactement un mot quelconque. Pour &#233;viter les surg&#233;n&#233;ral-
isations (pr&#233;sence de trop de (*s*) ou de (*g*)), le nombre de ces op&#233;rateurs est limit&#233; &#224; 2 et les patrons
ne sont pas g&#233;n&#233;ralis&#233;s entre eux. L&#8217;exemple suivant illustre cette g&#233;n&#233;ralisation pour deux exemples de la
relation TRAITE, avec une substitution et une insertion pour passer du premier au second (distance = 2) :
</p>
<p>&lt;maladie&gt;&#160;est&#160;trait&#233;e&#160;efficacement&#160;par&#160;le&#160;&lt;traitement&gt;
</p>
<p>&lt;maladie&gt;&#160;se&#160;traite&#160;par&#160;une&#160;&lt;traitement&gt;
</p>
<p>&lt;maladie&gt;&#160;(*g*)&#160;traiter$L_V&#160;(*s*)&#160;par&#160;$L_DET&#160;&lt;traitement&gt;&#8658;
</p>
<p>niveau&#160;lemme
niveau&#160;cat&#233;gorie
</p>
<p>niveau&#160;forme&#160;fl&#233;chie
</p>
<p>niveau&#160;op&#233;rateur&#160;(*g*)
</p>
<p>Les patrons trop sp&#233;cifiques sont &#233;limin&#233;s en ne retenant que les N (avec N = 50) patrons les plus
fr&#233;quents pour un type de relation donn&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MEHDI EMBAREK, OLIVIER FERRET
</p>
<p>Ces patrons sont ensuite utilis&#233;s pour extraire les r&#233;ponses des passages r&#233;ponses s&#233;lectionn&#233;s. Chacun de
ces passages est confront&#233; &#224; chacun des patrons appris pour le type de relations sous-jacent &#224; la question.
Ce test commence par l&#8217;alignement du passage et du patron sur les entit&#233;s de la relation : F , le focus de
la question et A, une entit&#233; avec le type attendu de la r&#233;ponse. La distance d&#8217;&#233;dition ci-dessus est ensuite
calcul&#233;e entre le patron et la partie du passage entre F et A. Si elle est nulle, A est consid&#233;r&#233;e comme une
r&#233;ponse possible. Toutes les r&#233;ponses extraites sont finalement tri&#233;es en fonction de leur fr&#233;quence.
</p>
<p>3 R&#233;sultats et &#233;valuation
</p>
<p>Pour l&#8217;&#233;valuation d&#8217;Esculape, nous avons utilis&#233; un corpus constitu&#233; de documents collect&#233;s &#224; partir de
sites Web m&#233;dicaux r&#233;f&#233;renc&#233;s par le portail CISMeF (www.cismef.org). Ce corpus, d&#8217;une taille de
400 Mo environ, a &#233;t&#233; divis&#233; entre 3 sous-corpus de m&#234;me taille : l&#8217;un pour l&#8217;apprentissage des patrons de
relations, le deuxi&#232;me pour l&#8217;&#233;valuation de leur capacit&#233; d&#8217;extraction de nouvelles relations et le dernier
pour l&#8217;&#233;valuation globale d&#8217;Esculape. Un ensemble de 100 questions a par ailleurs &#233;t&#233; cr&#233;&#233; sur la base
du contenu de notre corpus en utilisant comme mod&#232;le les questions de la t&#226;che m&#233;dicale de l&#8217;&#233;valuation
EQueR et les questions des m&#233;decins g&#233;n&#233;ralistes analys&#233;es dans (Ely et al., 1999), questions telles que :
</p>
<p>[M&#233;dicament] Que peut-on prescrire contre les mycoses ?
[Sympt&#244;me] Quels sont les signes cliniques de l&#8217;enc&#233;phalopathie ?
[Examen] Comment peut-on diagnostiquer un lymphome ?
</p>
<p>3.1 Extraction de relations
</p>
<p>Afin de tester le pouvoir discriminant des patrons de relations appris, nous avons choisi de les &#233;valuer dans
un cadre moins complexe que celui d&#8217;un SQR en les appliquant d&#8217;abord &#224; l&#8217;extraction de nouvelles rela-
tions. Plus pr&#233;cis&#233;ment, ces patrons ont &#233;t&#233; utilis&#233;s comme dans Esculape pour valider la pr&#233;sence d&#8217;une
relation relevant des quatre types consid&#233;r&#233;s ici dans des phrases contenant un couple d&#8217;entit&#233;s compatibles
avec les arguments de ces types de relations. Le Tableau 1 montre les r&#233;sultats de cette &#233;valuation et per-
</p>
<p>Types de relations # exemples # patrons Pr&#233;cision Rappel F1-mesure
Maladie &#8211; Examen 419 66 81% 54% 65%
Maladie &#8211; M&#233;dicament 149 33 85% 58% 69%
Maladie &#8211; Traitement 1457 131 90% 61% 73%
Maladie &#8211; Sympt&#244;me 1697 156 77% 47% 58%
</p>
<p>Moyenne 930 96 83% 55% 66%
</p>
<p>Table 1: R&#233;sultats de l&#8217;&#233;valuation concernant l&#8217;extraction de relations
</p>
<p>met en premier lieu de constater que les nombres d&#8217;exemples et de patrons varient sensiblement d&#8217;un type
de relations &#224; l&#8217;autre sans n&#233;anmoins observer de corr&#233;lation avec le niveau des r&#233;sultats. Globalement,
les patrons d&#8217;Esculape sont caract&#233;ris&#233;s par une forte pr&#233;cision mais un rappel plus moyen. Abstraction
faite des insuffisances de notre outil de reconnaissance des entit&#233;s m&#233;dicales, ces r&#233;sultats sont tout &#224; fait
compatibles avec la nature assez sp&#233;cifique, donc orient&#233;e vers une grande pr&#233;cision, des patrons appris et
de leur faible niveau de g&#233;n&#233;ralisation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADAPTER UN SYST&#200;ME DE QUESTION-R&#201;PONSE AU DOMAINE M&#201;DICAL
</p>
<p>3.2 Esculape
</p>
<p>Notre &#233;valuation d&#8217;Esculape a commenc&#233; par l&#8217;&#233;valuation de son module d&#8217;analyse des questions. Nos
100 questions de test se r&#233;partissant en 5 cat&#233;gories compos&#233;es chacune de 20 questions, les r&#233;sultats de
ce module se sont av&#233;r&#233;s corrects pour les 20 questions de d&#233;finition de cet ensemble et dans le cas des
questions factuelles, pour 19 questions ayant comme r&#233;ponse un traitement, 16 questions relatives &#224; un
m&#233;dicament, 14 concernant un sympt&#244;me et enfin, 14 relatives &#224; un examen, soit un taux global assez
&#233;lev&#233; de 83% de bonnes analyses. Ce taux est &#224; comparer aux 90% obtenus sur les 200 questions de la
t&#226;che m&#233;dicale d&#8217;EQueR qui ont servi au d&#233;veloppement de ce module d&#8217;analyse de questions et aux 21%
obtenus sur ces m&#234;mes 200 questions par le module &#233;quivalent d&#8217;&#338;dipe.
</p>
<p>Le Tableau 2 donne quant &#224; lui le r&#233;sultat de l&#8217;&#233;valuation globale d&#8217;Esculape sur la derni&#232;re partie de notre
corpus de test pour les 100 questions ci-dessus. En se focalisant sur les questions factuelles, qui sont au
c&#339;ur de notre travail d&#8217;adaptation, nous constatons que les r&#233;sultats sont assez homog&#232;nes, m&#234;me si de
l&#233;g&#232;res variations corr&#233;l&#233;es avec nos r&#233;sultats sur l&#8217;extraction de relations tendent &#224; montrer l&#8217;int&#233;r&#234;t de
la qualit&#233; des patrons linguistiques de relation. Ces r&#233;sultats sont difficilement comparables &#224; d&#8217;autres
travaux mais la similitude des questions et des documents avec ceux de la t&#226;che m&#233;dicale de l&#8217;&#233;valuation
EQueR permet de rapprocher avec prudence nos 33% de r&#233;ponses correctes au rang 1 et le Mean Re-
ciprocal Rank de 0,31 sur les 5 premi&#232;res r&#233;ponses du meilleur syst&#232;me de cette &#233;valuation (en ignorant
toutefois son degr&#233; d&#8217;adaptation au domaine m&#233;dical). Sachant que ce syst&#232;me est bien meilleur qu&#8217;&#338;dipe
en domaine ouvert, ce r&#233;sultat tend &#224; valider la m&#233;thode que nous avons adopt&#233;e pour construire Esculape.
</p>
<p>Types de questions # r&#233;ponses correctes % r&#233;ponses correctes # r&#233;ponses partielles
D&#233;finition 13 65% 4
</p>
<p>Factuelle - Traitement 6 30% 3
Factuelle - M&#233;dicament 5 25% 1
Factuelle - Sympt&#244;me 4 20% 0
Factuelle - Examen 5 25% 0
</p>
<p>Toutes 33 33% 8
</p>
<p>Table 2: R&#233;sultats de l&#8217;&#233;valuation globale d&#8217;Esculape
</p>
<p>Une analyse plus fine de ces r&#233;sultats permet de constater que les composants issus d&#8217;&#338;dipe ont une res-
ponsabilit&#233; importante dans les mauvaises r&#233;ponses trouv&#233;es. On constate ainsi que la recherche initiale
des documents ne renvoie un document contenant la r&#233;ponse &#224; la question pos&#233;e que pour 72% des ques-
tions. Cette &#233;tape pourrait &#234;tre nettement am&#233;lior&#233;e en ayant une m&#233;thode plus &#233;labor&#233;e de g&#233;n&#233;ration des
requ&#234;tes pour le moteur de recherche. La perte de r&#233;ponses &#224; l&#8217;issue de l&#8217;&#233;tape d&#8217;extraction des passages
est quant &#224; elle moins importante puisqu&#8217;&#224; ce stade, 59% des questions peuvent encore avoir une r&#233;ponse.
Au final, le module d&#8217;extraction des r&#233;ponses d&#8217;Esculape est donc capable de trouver une bonne r&#233;ponse
pour 56% de ces questions. Les pertes &#224; ce niveau viennent en partie d&#8217;une mauvaise analyse des questions
mais s&#8217;expliquent surtout par le niveau de rappel moyen des patrons de relations. L&#8217;ajout de patrons plus
g&#233;n&#233;raux est une voie d&#8217;am&#233;lioration possible, en particulier pour les relations &#224; plus longue distance.
</p>
<p>4 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; Esculape, un SQR construit pour les m&#233;decins g&#233;n&#233;ralistes en adaptant un syst&#232;me en
domaine ouvert afin de prendre en compte un mod&#232;le du domaine m&#233;dical. Un tel mod&#232;le &#233;tant toujours</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MEHDI EMBAREK, OLIVIER FERRET
</p>
<p>incomplet au niveau des instances, Esculape s&#8217;int&#233;resse plus sp&#233;cifiquement &#224; la recherche d&#8217;une r&#233;ponse
lorsque celle-ci n&#8217;est pas d&#233;j&#224; pr&#233;sente dans une base de connaissances existante et propose de l&#8217;extraire
de textes en appliquant des patrons linguistiques d&#8217;extraction de relations apprises de fa&#231;on supervis&#233;e.
</p>
<p>Nous envisageons de prolonger ce travail exploratoire selon deux directions. La premi&#232;re vise &#224; augmenter
significativement le nombre d&#8217;entit&#233;s et de relations consid&#233;r&#233;es dans Esculape pour le transformer en un
syst&#232;me plus op&#233;rationnel. Dans ce cadre, nous nous focaliserons plus particuli&#232;rement sur la minimisation
du nombre d&#8217;exemples &#224; fournir pour chaque nouveau type de relations. La seconde extension concerne
la prise en compte de relations plus complexes, allant au-del&#224; de deux arguments. De telles relations
permettent par exemple de repr&#233;senter la double d&#233;pendance d&#8217;un traitement ou d&#8217;un m&#233;dicament vis-&#224;-
vis d&#8217;une maladie et de certaines caract&#233;ristiques du patient qui en est atteint.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ATHENIKOS S. J. &amp; HAN H. (2010). Biomedical question answering: A survey. Computer Methods
and Programs in Biomedicine, 99(1), 1&#8211;24.
</p>
<p>AYACHE C., GRAU B. &amp; VILNAT A. (2006). EQueR: the French Evaluation campaign of Question-
Answering Systems. In LREC 2006, p. 1157&#8211;1160, Genova, Italy.
</p>
<p>BESAN&#199;ON R., EMBAREK M. &amp; FERRET O. (2007). Finding answers in the&#338;dipe system by extracting
and applying linguistic patterns. In Evaluation of Multilingual and Multi-modal Information Retrieval -
7th Workshop of the Cross-Language Evaluation Forum (CLEF 2006), p. 395&#8211;404. Springer Verlag.
</p>
<p>DEMNER-FUSHMAN D. &amp; LIN J. (2007). Answering clinical questions with knowledge-based and
statistical techniques. Computational Linguistics, 33(1), 63&#8211;103.
</p>
<p>ELY J., OSHEROFF J., EBELL M., BERGUS G., LEVY B., CHAMBLISS M. &amp; EVANS E. (1999).
Analysis of questions asked by family doctors regarding patient care. BMJ, 319, 358&#8211;361.
</p>
<p>EMBAREK M. &amp; FERRET O. (2007). Une exp&#233;rience d&#8217;extraction de relations s&#233;mantiques &#224; partir de
textes dans le domaine m&#233;dical. In TALN 2007, p. 37&#8211;46, Toulouse, France.
</p>
<p>EMBAREK M. &amp; FERRET O. (2010). Can Esculape cure the complex of &#338;dipe in the medical domain?
In 9th RIAO Conference (RIAO&#8217;2010), short paper session, Paris, France.
</p>
<p>JACQUEMART P. &amp; ZWEIGENBAUM P. (2003). Towards a medical question answering system : a feasi-
bility study. Studies in Health Technology and Informatics.
</p>
<p>LEE M., CIMINO J., ZHU H. R., SABLE C., SHANKER V., ELY J. &amp; YU H. (2006). Beyond informa-
tion retrieval - medical question answering. In 2006 AMIA Annual Symposium, Washington, DC.
</p>
<p>NIU Y. &amp; HIRST G. (2004). Analysis of semantic classes in medical text for question answering. In
ACL 2004 Workshop on Question Answering in Restricted Domains, p. 54&#8211;61, Barcelona, Spain.
</p>
<p>PANTEL P., RAVICHANDRAN D. &amp; HOVY E. (2004). Towards terascale knowledge acquisition. In 20th
</p>
<p>International Conference on Computational Linguistics (COLING 2004), p. 771&#8211;777, Geneva.
</p>
<p>TEROL R. M., MART&#205;NEZ-BARCO P. &amp; PALOMAR M. (2007). A knowledge based method for the
medical question answering problem. Computers in Biology and Medicine, 37(10), 1511&#8211;1521.</p>

</div></div>
</body></html>