<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;tection hors contexte des &#233;motions &#224; partir du contenu linguistique d&#8217;&#233;nonc&#233;s oraux : le syst&#232;me EmoLogus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010 &#8212;Session Posters, Montr&#233;al, 19-23 juillet 2010
</p>
<p>D&#233;tection hors contexte des &#233;motions &#224; partir du contenu 
linguistique d&#8217;&#233;nonc&#233;s oraux : le syst&#232;me EmoLogus
</p>
<p>Marc Le Tallec1, Jeanne Villaneau2, Jean-Yves Antoine1, Agata Savary1, Arielle Syssau-
Vaccarella3
</p>
<p>(1) Universit&#233; Fran&#231;ois Rabelais Tours &#8211; LI 
(2) Universit&#233; Europ&#233;enne de Bretagne &#8211; VALORIA
</p>
<p>(3) Universit&#233; Montpellier 3
</p>
<p>R&#233;sum&#233; Le projet EmotiRob, soutenu par l'agence nationale de la recherche, s'est  donn&#233; pour objectif de 
d&#233;tecter  des  &#233;motions  dans  un  contexte  d'application  original  :  la  r&#233;alisation  d'un  robot  compagnon 
&#233;motionnel pour des enfants fragilis&#233;s. Nous pr&#233;sentons dans cet article le syst&#232;me qui caract&#233;rise l'&#233;motion 
induite par le contenu linguistique des propos de l'enfant. Il se base sur un principe de compositionnalit&#233; des  
&#233;motions, avec une valeur &#233;motionnelle fixe attribu&#233;e aux mots lexicaux, tandis que les verbes et les adjectifs 
agissent comme des fonctions dont le r&#233;sultat d&#233;pend de la valeur &#233;motionnelle de leurs arguments. L'article 
pr&#233;sente la m&#233;thode de calcul utilis&#233;e,  ainsi que la norme lexicale &#233;motionnelle correspondante. Une analyse 
quantitative et qualitative des premi&#232;res exp&#233;rimentations pr&#233;sente les diff&#233;rences entre les sorties du module 
de d&#233;tection et  l'annotation d'experts,  montrant  des r&#233;sultats satisfaisants,  avec la bonne d&#233;tection  de la 
valence &#233;motionnelle dans plus de 90% des cas. 
</p>
<p>Abstract  The  ANR Emotirob  project  aims  at  detecting  emotions  in  an  original  application  context: 
realizing an emotional companion robot for weakened children. This paper presents a system which aims at 
characterizing emotions by only considering linguistic content. It is based on the assumption that emotions 
can  be  compound:  simple  lexical  words  have  an  intrinsic  emotional  value,  while  verbal  and adjectival 
predicates act as a function on the emotional values of their arguments. The paper describes the algorithm of 
compositional  computation  of  the  emotion  and  the  lexical  emotional  norm  used  by  this  algorithm.  A 
quantitative and qualitative analysis  of the differences between system outputs and expert  annotations is 
given, which shows satisfactory results, with a good detection of emotional valency in 90.0% of the test  
utterances.
</p>
<p>Mots-cl&#233;s :   Emotion ; valence &#233;motionnelle ; norme lexicale &#233;motionnelle ;  robot compagnon ; 
compr&#233;hension de parole
Keywords:   Emotion; Emotional valency; Emotional lexical standard; companion robot; spoken 
language understanding</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MARC LE TALLEC, JEAN-YVES ANTOINE, JEANNE VILLANEAU, AGATA SAVARY, ARIELLE SYSSAU-VACCARELLA
</p>
<p>1 Introduction
Un nouveau champ d'&#233;tude en robotique est  celui  des robots  compagnons susceptibles  d'ex&#233;cuter  des 
t&#226;ches complexes et dou&#233;s d'un syst&#232;me d'interaction enrichi avec les &#234;tres vivants. Le projet EmotiRob,  
soutenu par l'Agence nationale de la Recherche, fait partie de ce domaine de recherche : il s'est fix&#233; pour 
objectif  de  concevoir  un  robot  peluche  compagnon,  autonome  et  r&#233;actif,  capable  d'interagir 
&#233;motionnellement  avec  des  enfants  fragilis&#233;s  afin  de  leur  apporter  un  peu  de  r&#233;confort.  Des 
exp&#233;rimentations ant&#233;rieures (Saint-Aim&#233; et al., 2007) ont montr&#233; l'apport de ces robots dans ce type de 
situation. 
</p>
<p>Dans ce projet le robot peut exprimer des &#233;motions &#224; l'aide de mouvements faciaux. Pour produire une 
interaction &#233;motionnelle pertinente, le robot doit tout d&#8217;abord reconna&#238;tre l'&#233;tat  &#233;motionnel de l'enfant. 
Cette d&#233;tection peut se faire &#224; partir d&#8217;indices visuels (analyse de visage) ou par analyse des productions  
orales  (indices  prosodiques  et/ou contenu linguistique des  &#233;nonc&#233;s).  Le  syst&#232;me EmoLogus que nous 
avons  d&#233;velopp&#233;  se  concentre  pr&#233;cis&#233;ment  sur  la  d&#233;tection  des  &#233;motions  &#224;  partir  du  contenu 
propositionnel. Cet article pr&#233;sente le syst&#232;me ainsi que ses premiers r&#233;sultats.  
</p>
<p>2 D&#233;tection des &#233;motions
Il n&#8217;existe pas de r&#233;el consensus sur la d&#233;finition et la repr&#233;sentation des &#233;motions. Disons simplement 
qu&#8217;il s&#8217;agit d'un &#233;tat cognitif complexe influenc&#233; par le contexte &#224; court-terme (contexte et historique de 
l&#8217;interaction) comme &#224; long terme (v&#233;cu personnel et socioculturel) et dont la perception varie de mani&#232;re  
sensible d'une personne &#224; l'autre. Afin d&#8217;objectiver la caract&#233;risation des &#233;motions, deux grandes approches 
ont &#233;t&#233; &#233;tudi&#233;es par le pass&#233;. La premi&#232;re &#233;tablit une  cat&#233;gorisation nominale des &#233;motions en classes 
appel&#233;es modalit&#233;s &#233;motionnelles. (Ekman, 1999; Cowie, Cornelius, 2003): outre l'&#233;tat &#233;motionnel neutre, 
on distingue ainsi la col&#232;re, la joie, le d&#233;gout, la peur, la surprise et la tristesse.  La seconde approche 
r&#233;alise  une  cat&#233;gorisation ordinale dans  un espace  multidimensionnel.  Parmi les  &#233;chelles  de  valeurs 
retenues,  on  trouve le  degr&#233;  d&#8217;excitation  ou  la  valence  &#233;motionnelle  (&#233;motion  positive  vs.  n&#233;gative).  
Quelle que soit  l'approche suivie, les travaux sur l&#8217;&#233;motion aboutissent &#224; deux constats (Forbes-Riley,  
Litman, 2004; Devillers et al., 2005; Lee, Narayanan, 2005; Callejas, Lopez-Cozar, 2008) :
</p>
<p>1. En interaction r&#233;elle, les tours de parole ne portent majoritairement aucune &#233;motion perceptible : 
plus de 80% des &#233;nonc&#233;s peuvent ainsi &#234;tre qualifi&#233;s de neutres 
</p>
<p>2. Toutes les exp&#233;riences d&#8217;annotation pr&#233;sentent un faible accord inter-annotateurs, avec des valeurs 
de Kappa (Landis, Koch, 1977) comprises entre 0,32 et 0,55. Au final, une annotation de r&#233;f&#233;rence 
ne peut &#234;tre obtenue que par vote majoritaire entre plusieurs experts.
</p>
<p>La plupart des recherches concernant la d&#233;tection des &#233;motions en situation de dialogue s'appuient sur des 
indices prosodiques. Notre objectif est d'&#233;tudier ce que peut apporter une d&#233;tection linguistique. Cet axe 
ayant &#233;t&#233; tr&#232;s peu explor&#233;, nous nous limitons dans un premier temps &#224; une caract&#233;risation des &#233;motions en 
valence (positive, nulle ou n&#233;gative) associ&#233;e &#224; un degr&#233; d'intensit&#233;.
</p>
<p>3 D&#233;tection des &#233;motions avec EmoLogus : principe de compositionnalit&#233;
Une premi&#232;re approche envisageable pour la d&#233;tection linguistique des &#233;motions consiste &#224; attribuer une 
valence &#233;motionnelle &#224; chaque mot et &#224; calculer la valence &#233;motionnelle globale d&#8217;un &#233;nonc&#233; comme la 
somme (&#233;ventuellement normalis&#233;e) des valences lexicales de ses termes. Cette premi&#232;re approche, qui ne 
consid&#232;re pas la structure de l&#8217;&#233;nonc&#233;, sera utilis&#233;e comme baseline par la suite.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#201;TECTION DES &#201;MOTIONS &#192; PARTIR DU CONTENU LINGUISTIQUE D'&#201;NONC&#201;S ORAUX
</p>
<p>Figure 1: Exemple de calcul d'&#233;motion sur la phrase &#171; le gentil cochon n&#8217;a pas d&#8217;amis &#187;
</p>
<p>&#192; l&#8217;oppos&#233;,  le  syst&#232;me EmoLogus repose sur  le  principe  que l'&#233;motion contenue dans un &#233;nonc&#233; est 
compositionnelle : elle d&#233;pend &#224; la fois de l'ensemble des valeurs &#233;motionnelles des mots et de la structure 
s&#233;mantique qui d&#233;crit pr&#233;cis&#233;ment les relations des mots entre eux. En pratique, les mots non pr&#233;dicatifs du 
vocabulaire  poss&#232;dent  une  valeur  &#233;motionnelle  intrins&#232;que  (valence),  tandis  que  les  mots  pr&#233;dicatifs 
(essentiellement les verbes ou les adjectifs) sont associ&#233;s &#224; des fonctions qui donnent une &#233;motion &#224; partir 
des valences &#233;motionnelles des arguments du pr&#233;dicat. Pour illustrer ce m&#233;canisme, consid&#233;rons la phrase 
de la figure 1 et la formule logique qui la repr&#233;sente. Le calcul commence par la prise en compte de la 
valence &#233;motionnelle des mots cochon (E=0) et  amis (E=1), qui ne sont que de simples arguments de la 
formule.  L'adjectif  petit et  le  verbe  avoir fonctionnent  comme  des  pr&#233;dicats.  Gentil ayant  comme 
d&#233;finition  E = X &#0;  X +1,  le  groupe nominal  petit  cochon va avoir  pour  valeur  E =1.  L'application 
successive de ces pr&#233;dicats nous permet d'arriver au r&#233;sultat final pour l'&#233;nonc&#233; E= -1. On trouve dans 
notre lexique une dizaine de fonctions &#233;motionnelles, comme celles pr&#233;sent&#233;es en exemple ci dessous : 
</p>
<p>&#8226; D&#233;calage positif E : x &#10139; x+1 (exemple : mignon)
&#8226; D&#233;calage n&#233;gatif E : x &#10139; x-1 (exemple : &#233;nerv&#233;)
&#8226; Emotion d&#233;pendante des deux arguments E : (x,y) &#10139; x * y (exemple : perdre)
&#8226; Emotion inverse &#224; l&#8217;objet E : (x,y) &#10139; -y (exemple : casser)
</p>
<p>Le principe de compositionnalit&#233; sur lequel repose notre syst&#232;me est assez simple. Il n&#233;cessite toutefois :
</p>
<p>1. une compr&#233;hension robuste de la parole spontan&#233;e pour fournir la structure pr&#233;dicative correcte,
2. une base lexicale &#233;motionnelle propre sur laquelle se basera le calcul des &#233;motions.
</p>
<p>Ces deux &#233;l&#233;ments font l'objet des deux paragraphes suivants.
</p>
<p>4 Normes &#233;motionnelles et d&#233;finition des pr&#233;dicats
La premi&#232;re  ressource  n&#233;cessaire  &#224;  EmoLogus  est  la  valeur  &#233;motionnelle de  chacun des  lex&#232;mes  du 
vocabulaire.  La psychologie exp&#233;rimentale a de longue date d&#233;fini  des normes lexicales &#233;motionnelles 
associant &#224; un mot sa valence. 
</p>
<p>A notre connaissance, il n'existe que deux &#233;tudes de ce type sp&#233;cifiques aux enfants : (Vasa et al, 2006) 
pour l'anglais et (Syssau et Monnier, 2009) pour le fran&#231;ais. Ces &#233;tudes ont montr&#233; que si les normes 
&#233;motionnelles sont stables chez l&#8217;adulte et l&#8217;adolescent, elles varient fortement au cours des premi&#232;res 
&#233;tapes du d&#233;veloppement cognitif de l&#8217;enfant. La norme &#233;motionnelle de Syssau et Monnier repose sur une 
cat&#233;gorisation ordinale en trois modalit&#233;s (n&#233;gatif, neutre, positif). Nous avons compl&#233;t&#233; ces travaux par 
l'&#233;valuation de 80 mots absents de la norme et pr&#233;sents dans notre lexique qui couvre globalement le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MARC LE TALLEC, JEAN-YVES ANTOINE, JEANNE VILLANEAU, AGATA SAVARY, ARIELLE SYSSAU-VACCARELLA
</p>
<p>vocabulaire d&#8217;un enfant de 7 ans. Cette nouvelle norme a &#233;t&#233; &#233;tablie pour deux &#226;ges diff&#233;rents (5 et 7 ans) 
par exp&#233;rimentation dans 4 &#233;coles primaires. 
</p>
<p>La baseline repose enti&#232;rement sur cette norme lexicale.  Par contre, dans EmoLogus,  la norme lexicale 
associ&#233;e aux mots pr&#233;dicatifs est remplac&#233;e par un pr&#233;dicat &#233;motionnel, comme nous l'avons pr&#233;sent&#233; au 
paragraphe pr&#233;c&#233;dent. Une seconde norme, portant sur ces pr&#233;dicats, a &#233;t&#233; obtenue suivant une proc&#233;dure 
d'annotation r&#233;alis&#233;e par 5 experts adultes. Chacun d'entre eux a propos&#233; au plus deux d&#233;finitions pour 
chaque pr&#233;dicat, avant qu&#8217;une proc&#233;dure de consensus ne d&#233;finisse la fonction retenue &#224; chaque fois. Il est 
int&#233;ressant  de  noter  qu'il  a  finalement  &#233;t&#233;  possible  d'arriver  &#224;  un accord  total.  La  notion de  fonction 
pr&#233;dicative &#233;motionnelle semble donc paradoxalement &#234;tre plus stable que celle de valence &#233;motionnelle : 
les sujets semblent arriver plus facilement &#224; un accord sur l&#8217;&#233;motion port&#233;e par un pr&#233;dicat (comme par 
exemple  tuer)  que  sur  des  mots  simples  (banane,  &#233;cole),  o&#249; le  v&#233;cu personnel  de  chacun  entre  plus 
facilement en jeu.
</p>
<p>5 Exp&#233;rimentations et r&#233;sultats : &#233;tude quantitative
A l&#8217;heure  actuelle,  EmoLogus  est  capable  de  caract&#233;riser  l'&#233;motion  contenue  dans  un  &#233;nonc&#233;  hors-
contexte  :  nous  n&#8217;avons  pas  encore  d&#233;velopp&#233;  de  strat&#233;gie  pour  mod&#233;liser  l&#8217;influence  de  l&#8217;&#233;motion 
courante sur l&#8217;appr&#233;hension de chaque nouvel &#233;nonc&#233;.  Le comportement hors contexte du syst&#232;me a &#233;t&#233; 
&#233;valu&#233;  sur  le  corpus  Brassens  (Le  Tallec  et  al.,  2009)  comportant  173 &#233;nonc&#233;s  enfantins  annot&#233;s  en 
&#233;motions. 
</p>
<p>Pour  r&#233;aliser  une  annotation  hors-contexte  des  &#233;nonc&#233;s,  ces  derniers  ont  &#233;t&#233;  pr&#233;sent&#233;s  dans  un  ordre 
al&#233;atoire &#224; 5 annotateurs adultes qui devaient leur attribuer une modalit&#233; parmi 5, de -2 (tr&#232;s n&#233;gatif) &#224; +2 
(tr&#232;s positif). Cette annotation combinait donc valence &#233;motionnelle (positif/neutre/n&#233;gatif) et intensit&#233; de 
l&#8217;&#233;motion port&#233;e. La valeur r&#233;f&#233;rence de chaque phrase a &#233;t&#233; d&#233;termin&#233;e par un vote majoritaire sur les 
d&#233;cisions des experts. Les r&#233;sultats de cette annotation ont &#233;t&#233; pr&#233;sent&#233;s dans (Le Tallec et al., 2009). Le 
tableau 1 compare la pr&#233;cision d&#8217;annotation du syst&#232;me EmoLogus et de la baseline sur le corpus de test. 
</p>
<p>EmoLogus
 (avec intensit&#233;)
</p>
<p>Baseline
(avec intensit&#233;)
</p>
<p>EmoLogus
(sans intensit&#233;)
</p>
<p>Baseline
(sans intensit&#233;)
</p>
<p>Pr&#233;cision 90,00% 68,80% 94,00% 72,83%
</p>
<p>Tableau 1: Pr&#233;cision d'annotation du syst&#232;me EmoLogus et de la baseline.
</p>
<p>EmoLogus pr&#233;sente des r&#233;sultats encourageants avec un taux de bonne r&#233;ponse &#224; 90%, bien sup&#233;rieur &#224; ce 
que donnerait une proc&#233;dure basique de calcul des &#233;motions.
</p>
<p>-2 -1 0 1 2 -2 -1 0 1 2
</p>
<p>-2 4 2 0 0 0 -2 4 0 0 1 0
</p>
<p>EmoLogus : -1 2 18 0 0 0 Baseline : -1 3 12 7 0 0
</p>
<p>0 1 5 116 2 0 0 0 6 90 4 0
</p>
<p>1 0 0 3 16 1 1 0 4 18 11 1
</p>
<p>2 0 0 0 1 2 2 0 0 7 3 2
</p>
<p>Tableau 2: Matrice de confusion des erreurs.
</p>
<p>Le tableau 2 pr&#233;sente la matrice de confusion des erreurs pour les deux syst&#232;mes test&#233;s. Pour chaque case, 
on trouve l'annotation humaine en abscisse et celles des syst&#232;mes en ordonn&#233;. L'erreur la plus grave que </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#201;TECTION DES &#201;MOTIONS &#192; PARTIR DU CONTENU LINGUISTIQUE D'&#201;NONC&#201;S ORAUX
peut commettre un syst&#232;me est de d&#233;tecter une valence &#233;motionnelle oppos&#233;e &#224; celle attendue. Ce type 
d'erreur n'est jamais observ&#233; avec EmoLogus, &#224; la diff&#233;rence de la baseline. La majorit&#233; des erreurs (47%) 
consiste &#224; attribuer une &#233;motion neutre &#224; un &#233;nonc&#233; annot&#233; comme positif ou n&#233;gatif. On pourrait qualifier  
cette situation de probl&#232;me de rappel, si le neutre ne constituait pas un &#233;tat &#233;motif propre. Enfin, l'insertion 
d'une &#233;motion inexistante aux yeux des experts ne concerne que 18% des erreurs d&#8217;EmoLogus.
</p>
<p>Une  part  significative  des  erreurs  observ&#233;es  ne  concerne  par  ailleurs  que  l&#8217;estimation  de  l&#8217;intensit&#233; 
&#233;motionnelle, la valence &#233;tant correctement d&#233;tect&#233;e (exemple : positif vs. tr&#232;s positif). Si on se limite &#224; la 
d&#233;tection de la valence &#233;motionnelle, la pr&#233;cision du syst&#232;me EmoLogus atteint alors 94%.
</p>
<p>L&#8217;analyse qualitative des erreurs montre que notre syst&#232;me rencontre des difficult&#233;s &#224; mod&#233;liser ce que 
nous  pourrions  qualifier  d&#8217;isotopie  &#233;motionnelle.  Prenons  l&#8217;exemple  du  verbe  &#234;tre enferm&#233;.  En  toute 
logique, nos experts ont associ&#233; &#224; ce pr&#233;dicat la fonction E : x &#10139; -x. Si le sujet est associ&#233; &#224; une valence 
positive (exemple :  princesse), son enfermement est per&#231;u n&#233;gativement. Si on adopte cette fonction, un 
sujet  non  porteur  d&#8217;&#233;motion,  ou  mal  identifi&#233;  (E=0)  entrainera  donc  le  calcul  d&#8217;une  &#233;motion  neutre. 
Pourtant,  il  semble que les  annotateurs  ressentent  une l&#233;g&#232;re &#233;motion n&#233;gative dans  ces  situations.  Il 
semble  donc  n&#233;cessaire  d'attribuer  une  valeur  n&#233;gative  par  d&#233;faut  &#224;  ces  pr&#233;dicats  lorsque  la  valeur 
&#233;motionnelle  de  leur  argument  est  inconnue  ou neutre.  C&#8217;est  l&#8217;&#233;motion  port&#233;e  par  les  arguments  qui 
modifie le comportement &#233;motionnel du pr&#233;dicat, un peu comme, en s&#233;mantique, les s&#232;mes isotopiques 
sont activ&#233;s en contexte.
</p>
<p>Un autre probl&#232;me, circonscrit principalement &#224; certains adjectifs, r&#233;sulte de ce qu&#8217;on pourrait qualifier de 
polys&#233;mie &#233;motionnelle. Prenons le cas de l'adjectif  petit.  Globalement cet adjectif a tendance &#224; changer 
l'argument  qu'il  qualifie  pour  le  rendre  plus  positif  (exemple :  le  petit  loup) :  x  &#10139; x+1.  D&#8217;autres 
comportement &#233;motionnels doivent toutefois &#234;tre consid&#233;r&#233;s. Par exemple, nos annotateurs ne per&#231;oivent 
pas  de d&#233;calage  vers  le  positif  sur  un exemple comme  la petite  maison.  Il  semble donc que certains 
pr&#233;dicats doivent se voir attribuer plusieurs comportements &#233;motionnels qui seront &#224; d&#233;sambig&#252;iser dans le 
contexte local de l&#8217;&#233;nonc&#233;.
</p>
<p>Il reste enfin &#224; aborder la question de l&#8217;influence du contexte g&#233;n&#233;ral du discours sur la perception des 
&#233;motions, qui n&#8217;a pas &#233;t&#233; &#233;valu&#233;e dans le cadre de ces premi&#232;res exp&#233;rimentations.
</p>
<p>6 Conclusion et perspectives
Les premi&#232;res  &#233;valuations  du  syst&#232;me de  d&#233;tection  des  &#233;motions  EmoLogus  sont  encourageants.  Les 
r&#233;sultats obtenus semblent en effet montrer qu&#8217;il est possible de d&#233;tecter la bonne &#233;motion dans un &#233;nonc&#233; 
dans 90% des cas. Un des points les plus importants est que le syst&#232;me n'annote jamais un &#233;nonc&#233; avec 
une  &#233;motion  inverse  &#224;  celle  attendue.  Nous  avons  modifi&#233;  certains  pr&#233;dicats  afin  de  r&#233;pondre  aux 
probl&#232;mes rencontr&#233;s lors de nos exp&#233;rimentations, en particulier dans les cas li&#233;s &#224; une &#233;motion sur un 
objet neutre &#233;motionnellement. 
Nous travaillons d&#233;sormais sur la d&#233;tection des &#233;motions en contexte (Liscombe et al., 2005). Outre les 
probl&#232;mes classiques de r&#233;solution des anaphores, cette d&#233;tection soul&#232;ve deux probl&#232;mes.
</p>
<p>1. La dynamique des &#233;motions dans un r&#233;cit, qui d&#233;finit comment la valeur &#233;motionnelle d'un &#233;nonc&#233; 
d&#233;pend de celle des &#233;nonc&#233;s pr&#233;c&#233;dents.
</p>
<p>2. Le suivi de la valeur &#233;motionnelle des &#171; personnages &#187; : si &#171; mon petit fr&#232;re est m&#233;chant &#187;, il le 
reste probablement dans les &#233;nonc&#233;s suivants.
</p>
<p>Par ailleurs, nous &#233;tudions actuellement l&#8217;influence des erreurs de la reconnaissance de la parole sur le 
comportement du syst&#232;me. Enfin, nous pr&#233;voyons de coupler notre module de d&#233;tection linguistique des 
&#233;motions avec un syst&#232;me s&#8217;appuyant sur la prosodie du signal de parole (Chetouani, 2009).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MARC LE TALLEC, JEAN-YVES ANTOINE, JEANNE VILLANEAU, AGATA SAVARY, ARIELLE SYSSAU-VACCARELLA
</p>
<p>Remerciements
Ce projet est financ&#233; par l&#8217;Agence Nationale de la Recherche (projet PSIROB06_174281).
</p>
<p>R&#233;f&#233;rences 
BASSANO D.,  LABRELL F.,  CHAMPAUD C.,  et  al. (2005).  Le  DLPF,  un  nouvel  outil  pour  l'&#233;valuation  du 
d&#233;veloppement du langage de production en fran&#231;ais. Enfance, 2(5):171&#8211;208.
</p>
<p>CALLEJAS Z., LOPEZ-COZAR R. (2008). Influence of contextual information in emotion annotation for spoken 
dialogue systems. Speech Communication. 50. 416-433.
</p>
<p>CHETOUANI M., (2009). Mutlisensory Signal Processing for Emotion Recognition .Workshop on &quot;Current 
Challenges and Future Perspectives of Emotional Humanoid Robotics&quot;, IEEE International Conference on 
Robotics and Automation (ICRA'09).
</p>
<p>COWIE R.,  CORNELIUS R.  (2003). Describing the emotional  states  that  are  expressed in  speech. Speech 
Communication. 40. 5-32.
</p>
<p>DEVILLERS L., VIDRASCU L., VASILESCU I. (2005). Emotion detection in task-oriented spoken dialogs. Journal 
of Neural Networks. 18(4). 
</p>
<p>EKMAN P. (1999) Patterns of  emotions: New Analysis of Anxiety and Emotion . Plenum Press.
</p>
<p>EL MAAROUF I., LE TALLEC M., VILLANEAU J. (2009),  Ontologies naturelles et coercion : formalisation de 
connaissances &#224; partir d'observations en corpus. Journ&#233;es de linguistiques de corpus, Lorient, France.
</p>
<p>FORBES-RILEY K.,  LITMAN L.  (2004).  Predicting  emotion  in  spoken  dialogue  from multiple  knowledge 
sources. Actes de HLT/NAACL&#8217;2004. 161-176.
</p>
<p>LANDIS J., AND KOCH G. (1977). The measurement of observer agreement for categorical data. Biometrics, 
33. 159-174.
</p>
<p>LEE C.M., NARAYANAN S. (2005). Towards detecting emotions in spoken dialogs.  IEEE Transactions On 
Speech and Audio Processing. 13(3). 293-303.9
</p>
<p>LE TALLEC M.,  VILLANEAU J., ANTOINE J-Y., SAVARY A., ARIELLE SYSSAU-VACCARELLA A. (2009). D&#233;tection des 
&#233;motions  &#224;  partir  du  contenu  linguistique d&#8217;&#233;nonc&#233;s  oraux  :  application  &#224;  un  robot  compagnon  pour 
enfants fragilis&#233;s. Actes de TALN 2009.
</p>
<p>LISCOMBE J., RICCARDI G., HAKKANI-T&#220;R D. (2005). Using context to improve emotion detection in spoken 
dialogue. Actes INTERSPEECH 2005. 
</p>
<p>SAINT-AIM&#201; S., LE-P&#201;V&#201;DIC B., DUHAUT D., SHIBATA T. (2007). Emotirob : Companion Robot Project. Actes 
de  RO-MAN 2007.
</p>
<p>SYSSAU A.,  MONNIER C. (2009).  Children's  emotional  norms  for  six  hundred French  words.  Behavior, 
Research, and Methods, 41, 213-219. 
</p>
<p>VASA R. A., CARLINO A. R., LONDON K., MIN C.  (2006).  Valence ratings of emotional and non-emotional 
words in children. Personality and Individual Differences, 41, 1169-1180.
VILLANEAU J., ANTOINE J-Y.  (2009). Deeper spoken language understanding for man-machine dialogue on 
broader application domains: a logical alternative to concept spotting. Workshop SRSL09 in EACL 2009. </p>

</div></div>
</body></html>