<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Pseudo-racinisation de la langue amazighe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Pseudo-racinisation de la langue amazighe 
</p>
<p>Fadoua Ataa Allah   Siham Boulaknadel 
</p>
<p> CEISIC, IRCAM 
Avenue Allal El Fassi, Madinat Al Irfane, Rabat, Morocco 
</p>
<p>{ataaallah, boulaknadel}@ircam.ma 
</p>
<p>R&#233;sum&#233; Dans le cadre de la promotion de la langue amazighe, nous avons voulu lui apporter des 
ressources et outils linguistiques pour son traitement automatique et son int&#233;gration dans le domaine des 
nouvelles technologies de l'information et de la communication. Partant de ce principe, nous avons opt&#233;, au 
sein de l&#8217;Institut Royal de la Culture Amazighe, pour une d&#233;marche innovante de r&#233;alisations progressives de 
ressources linguistiques et d&#8217;outils de base de traitement automatique, qui permettront de pr&#233;parer le terrain 
pour d&#8217;&#233;ventuelles recherches scientifiques. 
</p>
<p>Dans cette perspective, nous avons entrepris de d&#233;velopper, dans un premier temps, un outil de pseudo-
racinisation bas&#233; sur une approche relevant du cas de la morphologie flexionnelle et reposant sur 
l&#8217;&#233;limination d&#8217;une liste de suffixes et de pr&#233;fixes de la langue amazighe. Cette approche permettra de 
regrouper les mots s&#233;mantiquement proches &#224; partir de ressemblances afin d&#8217;&#234;tre exploit&#233;s dans des 
applications tel que la recherche d&#8217;information et la classification. 
</p>
<p>Abstract In the context of promoting the Amazigh language, we would like to provide this language with 
linguistic resources and tools in the aim to enable its automatic processing and its integration in the field of 
Information and Communication Technology. Thus, we have opted, in the Royal Institute of Amazigh 
Culture, for an innovative approach of progressive realizations of linguistic resources and basic natural 
language processing tools that will pave the way for further scientific researches. 
</p>
<p>In this perspective, we are trying initially to develop a light stemmer based on an approach dealing with 
inflectional morphology, and on stripping a list of Amazigh suffixes and prefixes. This approach will conflate 
word variants into a common stem that will be used in many applications such as information retrieval and 
classification. 
</p>
<p>Mots-cl&#233;s :   Langue amazighe, Pseudo-racinisation, Morphologie flexionnelle.  
Keywords:   Amazigh language, Light stemming, Inflectional morphology. 
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADOUA ATAA ALLAH, SIHAM BOULAKNADEL 
</p>
<p>1 Introduction 
Depuis quelques ann&#233;es, la langue amazighe au Maroc a joui d&#8217;un statut institutionnel par la cr&#233;ation de 
l&#8217;Institut Royal de la Culture Amazighe (IRCAM). Cette cr&#233;ation lui a permis d&#8217;avoir une graphie 
officielle, un codage propre dans le standard Unicode, des normes appropri&#233;es pour la disposition d&#8217;un 
clavier amazigh et des structures linguistiques qui sont en phase d&#8217;&#233;laboration avec une d&#233;marche 
progressive. Cette d&#233;marche a &#233;t&#233; initi&#233;e et entreprise par la construction des lexiques (Kamel, 2006 ; 
Ameur et al., 2009), l&#8217;homog&#233;n&#233;isation de l&#8217;orthographe et la mise en place des r&#232;gles de segmentation de 
la cha&#238;ne parl&#233;e (Ameur et al., 2006) et par l&#8217;&#233;laboration des r&#232;gles de grammaire (Boukhris et al., 2008). 
N&#233;anmoins, toutes ces &#233;tapes de standardisation ne sont pas suffisantes pour qu&#8217;une langue peu dot&#233;e 
informatiquement telle que l&#8217;amazighe puisse rejoindre ses consoeurs dans le domaine des nouvelles 
technologies de l'information et de la communication. Dans ce contexte, de nombreuses recherches 
scientifiques sont lanc&#233;es au niveau national pour am&#233;liorer la situation actuelle. Principalement, elles se 
focalisent sur la correction orthographique (Es Saady et al., 2009), la traduction automatique (Rachidi et 
Mammas, 2007) et la reconnaissance optique des caract&#232;res (Fakir et al., 2009). Or, celles qui occupent 
une position prioritaire dans la voie de la conception et la r&#233;alisation des ressources et outils linguistiques 
sont peu nombreuses (Iazzi et Outahajala, 2008 ; Ataa Allah et Jaa, 2009 ; Boulaknadel, 2009). 
Cet article s&#8217;inscrit dans un mouvement innovant et progressif qui vise l&#8217;&#233;laboration des ressources et 
outils linguistiques, sp&#233;cialement, la r&#233;alisation des racineurs (stemmers). En effet, la racinisation 
(stemming) est un processus fortement exploit&#233; dans plusieurs domaines bas&#233;s sur le traitement 
automatique des langues, tel que la recherche d&#8217;information, la traduction automatique et la classification. 
Il consiste &#224; regrouper les mots s&#233;mantiquement proches &#224; partir de mots de forme apparent&#233;e relevant de 
la flexion et de la d&#233;rivation. Cette approche a &#233;t&#233; utilis&#233;e dans diff&#233;rentes langues &#224; travers plusieurs 
algorithmes,  tels que l&#8217;algorithme de Porter (Porter, 1980) pour l&#8217;anglais, l&#8217;algorithme de Savoy (Savoy, 
1993) pour le fran&#231;ais et l&#8217;algorithme de Larkey (Larkey et al., 2002) pour l&#8217;arabe. Ces divers algorithmes 
proc&#232;dent de mani&#232;res diff&#233;rentes: ceux bas&#233;s sur une &#233;tape de d&#233;suffixation qui consiste &#224; &#244;ter aux mots 
les suffixes les plus longs possibles, suivie par une &#233;tape de recodage qui ajoute aux racines obtenues des 
terminaisons pr&#233;d&#233;finies. Et ceux qui reposent sur la d&#233;suffixation et la d&#233;pr&#233;fixation. 
Il est un fait que la langue amazighe ayant une morphologie assez complexe, la simple suppression des 
suffixes ne peut suffire &#224; regrouper des familles de mots. Le plus souvent, les outils s'int&#233;ressant aux 
langues riches morphologiquement font appel &#224; de lourds dictionnaires ou &#224; un &#233;tiquetage 
morphosyntaxique pr&#233;alable des mots pr&#233;sents dans les documents. Or, &#233;tant donn&#233; que l&#8217;amazighe fait 
partie des langues peu dot&#233;es informatiquement et vu que jusqu&#8217;&#224; ce jour nous ne disposons ni de 
dictionnaire ni d'analyseur morphosyntaxique pour la langue amazighe standard du Maroc, nous avons 
entrepris de d&#233;velopper un algorithme de pseudo-racinisation (light stemming) se basant sur une analyse 
&#8216;simpliste&#8217; prenant en compte le cas relevant de la morphologie flexionnelle. Dans la suite de cet article, 
nous pr&#233;sentons dans la section 2 un descriptif  des caract&#233;ristiques de la langue amazighe standard du 
Maroc. Puis, nous d&#233;taillons dans la section 3 l&#8217;approche propos&#233;e et son &#233;valuation. Alors que nous 
consacrons la section 4 &#224; la conclusion et aux perspectives. 
</p>
<p>2 Caract&#233;ristiques de la langue amazighe  
L&#8217;amazighe (berb&#232;re) fait partie des langues afro-asiatiques (Greenberg, 1966). Son syst&#232;me d&#8217;&#233;criture date 
de plus de 25 si&#232;cles. Il a assimil&#233; des changements afin de fournir &#224; cette langue un syst&#232;me alphab&#233;tique 
ad&#233;quat et utilisable pour tous les parlers amazighs actuels. Ainsi en 2003, partant d&#8217;un h&#233;ritage aussi bien 
ancien que moderne et contemporain, l&#8217;IRCAM a d&#233;velopp&#233; un syst&#232;me d&#8217;alphabet sous le nom de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PSEUDO-RACINISATION POUR LA LANGUE AMAZIGHE 
Tifinaghe-Ircam. Il est orient&#233; horizontalement de gauche &#224; droite et compos&#233; de : 27 consonnes, 2 semi-
consonnes, 4 voyelles. Par ses propri&#233;t&#233;s morphologiques, l&#8217;amazighe est consid&#233;r&#233;e comme une langue 
complexe, dont les mots peuvent &#234;tre class&#233;s en trois cat&#233;gories morpho-syntaxiques: 
</p>
<p>2.1 Verbe  
</p>
<p>Le verbe peut appara&#238;tre sous une forme simple ou d&#233;riv&#233;e. La forme simple est compos&#233;e d'une racine et 
d'un radical. Alors que la forme d&#233;riv&#233;e est obtenue &#224; partir des verbes simples par la pr&#233;fixation d&#8217;un 
morph&#232;me ou d&#8217;une combinaison de deux morph&#232;mes de valeur diff&#233;rente. Ces morph&#232;mes sont : &#11609; &#8216;s&#8217; / 
&#11609;&#11609; &#8216;ss&#8217; qui indique la forme factitive, &#11612;&#11612; &#8216;tt&#8217; qui marque la forme passive et &#11598; &#8216;m&#8217; / &#11598;&#11598; &#8216;mm&#8217; qui d&#233;signe 
la forme r&#233;ciproque. Le verbe, qu&#8217;il soit simple ou d&#233;riv&#233;, se conjugue selon quatre aspects : l&#8217;aoriste, 
l&#8217;accompli, l&#8217;inaccompli et l&#8217;accompli n&#233;gatif. En g&#233;n&#233;ral, le passage du verbe de l&#8217;aoriste &#224; l&#8217;accompli ne 
subit pas de changement dans le cas des verbes r&#233;guliers. Alors que dans le cas des verbes irr&#233;guliers, ce 
passage est accompagn&#233; d&#8217;une alternance vocalique qui peut &#234;tre suivi d&#8217;une tension consonantique. Or, 
l'inaccompli est d&#233;riv&#233; de l'aoriste par l'application de la pr&#233;fixation &#11612;&#11612; &#8216;tt&#8217;, la g&#233;mination, ou la tension 
d'une consonne radicale et l'insertion d'une voyelle. Selon le type du verbe, un ou plusieurs proc&#233;d&#233;s 
peuvent &#234;tre employ&#233;s. Par ailleurs, la caract&#233;ristique principale de l&#8217;accompli n&#233;gatif est l'apparition de la 
voyelle &#11593; &#8216;i&#8217; devant ou apr&#232;s la consonne finale du radical, en fonction du type du verbe (monolit&#232;re, 
bilit&#232;re, etc.). Cependant, les formes de certains verbes &#224; l&#8217;accompli positif et n&#233;gatif sont identiques. 
</p>
<p>2.2 Nom  
</p>
<p>Le nom est une unit&#233; lexicale form&#233;e d'une racine et d'un sch&#232;me, qui indique un substantif ou un adjectif. 
Il peut &#234;tre sous une forme simple, compos&#233;e ou d&#233;riv&#233;e. Il varie en genre, en nombre et en &#233;tat. Le nom 
existe en deux genres : le masculin et le f&#233;minin. Le masculin commence en g&#233;n&#233;ral par une des voyelles 
initiales &#11568; &#8216;a&#8217;, &#11593; &#8216;i&#8217; ou &#11603; &#8216;u&#8217;. Quant au f&#233;minin, il est g&#233;n&#233;ralement form&#233; &#224; base du masculin par l&#8217;ajout du 
morph&#232;me discontinu &#11612;&#8230;&#11612; &#8216;t...t&#8217;. Cependant, il poss&#233;de un singulier et un pluriel qui se r&#233;alise selon trois 
types. Le pluriel externe est form&#233; par une alternance vocalique et par la suffixation de l'indice &#11599; &#8216;n&#8217; ou 
l&#8217;une de ses variantes (&#11593;&#11598;&#11587;&#11577;&#11568;&#11605;&#11599; &#8216;imh &#61479;d &#61479;arn&#8217; &#233;l&#232;ves en mas., &#11612;&#11593;&#11598;&#11587;&#11577;&#11568;&#11605;&#11593;&#11599; &#8216;timh &#61479;d &#61479;arin&#8217; &#233;l&#232;ves en f&#233;m.). Le 
pluriel interne est constitu&#233; d&#8217;une alternance vocalique accompagn&#233;e d&#8217;un changement de voyelles 
internes (&#11612;&#11593;&#11606;&#11598;&#11609;&#11612; &#8216;ti&#947;mst&#8217; dent &#8594; &#11612;&#11593;&#11606;&#11598;&#11568;&#11609; &#8216;ti&#947;mas&#8217; dents). Le pluriel mixte est form&#233; par l&#8217;alternance 
d'une voyelle interne et/ou finale accompagn&#233;e par une suffixation de &#11599; &#8216;n&#8217; (&#11593;&#11619;&#11593; &#8216;izi&#8217; mouche &#8594;  &#11593;&#11619;&#11568;&#11599; 
&#8216;izan&#8217; mouches) ; ou une alternance vocalique initiale accompagn&#233;e d'un changement vocalique final &#11568; &#8216;a&#8217; 
et d'une alternance interne (&#11568;&#11598;&#11571;&#11571;&#11568;&#11604;&#11603; &#8216;amggaru&#8217; dernier &#8594;  &#11593;&#11598;&#11571;&#11571;&#11603;&#11604;&#11568; &#8216;imggura&#8217; derniers). En outre, le 
nom a deux &#233;tats : l'&#233;tat libre ou il ne subit aucune modification et l&#8217;&#233;tat d&#8217;annexion qui se manifeste par 
une variation des noms &#224; initiale vocalique (&#11568;&#11604;&#11571;&#11568;&#11619; &#8216;argaz&#8217; &#8594;  &#11603;&#11604;&#11571;&#11568;&#11619; &#8216;urgaz&#8217; homme). L'&#233;tat d&#8217;annexion 
est r&#233;alis&#233; quand le nom a la fonction de sujet lexical postpos&#233; au verbe et est pr&#233;c&#233;d&#233; d&#8217;un coordonnant, 
de termes d'attribution, de termes d'appartenance et de filiation, de nom de nombre ou d&#8217;une pr&#233;position &#224; 
l&#8217;exception de &#11568;&#11597;/&#11568;&#11604; &#8216;al/ar&#8217; jusqu&#8217;&#224; et &#11569;&#11597;&#11568; &#8216;bla&#8217; sans. 
</p>
<p>2.3 Particules  
</p>
<p>Les particules sont un ensemble de mots, en g&#233;n&#233;ral, assez courts qui jouent le r&#244;le d'indicateurs 
grammaticaux au sein d&#8217;une phrase. Cet ensemble contient les particules d&#8217;aspect, d&#8217;orientation et de 
n&#233;gation ; les pronoms ind&#233;finis, d&#233;monstratifs, possessifs et interrogatifs ; les pronoms personnels 
autonomes, affixes sujet, affixes d&#8217;objet direct et indirect, compl&#233;ments du nom ordinaire et de parent&#233;, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADOUA ATAA ALLAH, SIHAM BOULAKNADEL 
compl&#233;ments de pr&#233;positions ;  les adverbes de lieu, de temps, de quantit&#233; et de mani&#232;re ; les pr&#233;positions ; 
les subordonnants et les conjonctions (Boukhris et al., 2008). G&#233;n&#233;ralement, les particules sont invariables. 
Or, dans le cas de l&#8217;amazighe similairement au cas du fran&#231;ais, il existe des particules flexionnelles telles 
que les pronoms possessifs (&#11617;&#11593;&#11599;&#11599;&#11609; &#8216;winns&#8217; le sien  &#8594;  &#11617;&#11593;&#11599;&#11599;&#11609;&#11599; &#8216;winnsn&#8217; le leur). 
</p>
<p>3 Pseudo-racinisation de l&#8217;amazighe 
Malgr&#233; l'int&#233;r&#234;t accord&#233; &#224; l&#8217;amazighe, il n'existe pas jusqu&#8217;&#224; ce jour, &#224; notre connaissance, des travaux 
publi&#233;s concernant le traitement automatique de la morphologie de la langue amazighe standard du Maroc. 
Ainsi, nous proposons &#224; travers ce papier de consacrer plus d&#8217;importance &#224; un tel type de travaux, 
particuli&#232;rement la pseudo-racinisation qui consiste &#224; &#233;liminer une liste pr&#233;d&#233;finie de pr&#233;fixes et / ou de 
suffixes flexionnels, sans tenter d&#8217;&#233;liminer les infixes ou de r&#233;cup&#233;rer le sch&#232;me ou la racine du mot trait&#233;. 
</p>
<p>3.1 L&#8217;approche propos&#233;e 
</p>
<p>En g&#233;n&#233;ral, la structure des racineurs varie consid&#233;rablement selon les caract&#233;ristiques morphologiques 
d&#8217;une langue. Pour les langues indo-europ&#233;ennes, principalement le fran&#231;ais et l&#8217;anglais, la majorit&#233; des 
techniques exploit&#233;es ne passent que par une &#233;tape d&#8217;&#233;limination de suffixes. Tandis que pour les langues 
afro-asiatiques, dont la langue amazighe fait partie, ces techniques sont cens&#233;es passer aussi par une &#233;tape 
de d&#233;pr&#233;fixation. En effet, dans la pratique les affixes peuvent alt&#233;rer le sens d&#8217;un mot. Par cons&#233;quent, le 
fait de les exclure peut impliquer une grande perte d&#8217;information. Dans les langues indo-europ&#233;ennes, les 
pr&#233;fixes modifient le signifi&#233; des mots ce qui rend leur suppression porteuse d&#8217;erreurs. Alors que dans le 
cas des langues afro-asiatiques, les pr&#233;fixes sont aussi utilis&#233;s pour exprimer la flexion. Ainsi, nous 
proposons dans ce travail une approche l&#233;g&#232;re de racinisation (pseudo-racinisation, light stemming), qui 
traite la morphologie flexionnelle sans se baser sur un dictionnaire ou un &#233;tiqueteur morphosyntaxique, 
mais en se limitant seulement &#224; la structure du mot amazighe qui est compos&#233;e d&#8217;un pr&#233;fixe, d&#8217;un noyau et 
d&#8217;un suffixe. Cette approche se d&#233;roule en deux &#233;tapes : d&#233;pr&#233;fixation et d&#233;suffixation. Similairement &#224; la 
m&#233;thode de Larkey (Larkey et al., 2002), notre algorithme reconna&#238;t le pr&#233;fixe et le suffixe de la liste et il 
les supprime. Dans le cas o&#249; plusieurs affixes sont d&#233;tect&#233;s, c'est toujours le suffixe ou le pr&#233;fixe le plus 
long qui est choisi. La liste des pr&#233;fixes et suffixes est compos&#233;e des morph&#232;mes flexionnels communs de 
genre, de nombre et d&#8217;&#233;tats pour les noms ; d&#8217;indices de personnes, de l&#8217;aspect et de type pour les verbes ; 
et des pronoms personnels affixes compl&#233;ments du nom de parent&#233; et de pr&#233;positions. Cette liste est 
regroup&#233;e en cinq classes variant d&#8217;un &#224; cinq caract&#232;res. 
</p>
<p>- Les pr&#233;fixes : {{&#11568; &#8216;a&#8217;, &#11593; &#8216;i&#8217;, &#11599; &#8216;n&#8217;, &#11603; &#8216;u&#8217;, &#11612; &#8216;t&#8217;} ; {&#11599;&#11568; &#8216;na&#8217;, &#11599;&#11593; &#8216;ni&#8217;, &#11599;&#11603; &#8216;nu&#8217;,  &#11612;&#11568; &#8216;ta&#8217;, &#11612;&#11593; &#8216;ti&#8217;, &#11612;&#11603; &#8216;tu&#8217;, &#11612;&#11612; 
&#8216;tt&#8217;, &#11617;&#11568; &#8216;wa&#8217;, &#11617;&#11603;  &#8216;wu&#8217;, &#11618;&#11568; &#8216;ya&#8217;, &#11618;&#11593; &#8216;yi&#8217;, &#11618;&#11603; &#8216;yu&#8217;} ; {&#11593;&#11612;&#11612; &#8216;itt&#8217;, &#11599;&#11612;&#11612; &#8216;ntt&#8217;, &#11612;&#11612;&#11568; &#8216;tta&#8217;, &#11612;&#11612;&#11593; &#8216;tti&#8217;} ; {&#11593;&#11612;&#11612;&#11568; 
&#8216;itta&#8217;, &#11593;&#11612;&#11612;&#11593; &#8216;itti&#8217;, &#11599;&#11612;&#11612;&#11568; &#8216;ntta&#8217;, &#11599;&#11612;&#11612;&#11593; &#8216;ntti&#8217;, &#11612;&#11579;&#11612;&#11612; &#8216;tett&#8217;} ; {&#11612;&#11579;&#11612;&#11612;&#11568; &#8216;tetta&#8217;, &#11612;&#11579;&#11612;&#11612;&#11593; &#8216;tetti&#8217;}}.  
</p>
<p>- Les suffixes : {{&#11568; &#8216;a&#8217;, &#11575; &#8216;d&#8217;, &#11593; &#8216;i&#8217;, &#11581; &#8216;k&#8217;, &#11598; &#8216;m&#8217;, &#11599; &#8216;n&#8217;, &#11606; &#8216;&#947;&#8217;, &#11609; &#8216;s&#8217;, &#11612; &#8216;t&#8217;} ; {&#11568;&#11599; &#8216;an&#8217;, &#11568;&#11612; &#8216;at&#8217;, &#11593;&#11575; 
&#8216;id&#8217;, &#11593;&#11598; &#8216;im&#8217;, &#11593;&#11599; &#8216;in&#8217;, &#11593;&#11606; &#8216;i&#947;&#8217;, &#11598;&#11612; &#8216;mt&#8217;, &#11599;&#11606; &#8216;n&#947;&#8217;, &#11599;&#11612; &#8216;nt&#8217;, &#11603;&#11599; &#8216;un&#8217;, &#11609;&#11599; &#8216;sn&#8217;, &#11612;&#11599; &#8216;tn&#8217;, &#11617;&#11598; &#8216;wm&#8217;, &#11617;&#11599; &#8216;wn&#8217;, 
&#11618;&#11599; &#8216;yn&#8217;} ; {&#11568;&#11598;&#11612; &#8216;amt&#8217;, &#11568;&#11599;&#11612; &#8216;ant&#8217;, &#11568;&#11617;&#11599; &#8216;awn&#8217;, &#11593;&#11598;&#11612; &#8216;imt&#8217;, &#11593;&#11599;&#11612; &#8216;int&#8217;, &#11593;&#11617;&#11599; &#8216;iwn&#8217;,  &#11599;&#11593;&#11599; &#8216;nin&#8217;, &#11603;&#11599;&#11612; &#8216;unt&#8217;, &#11612;&#11593;&#11599; 
&#8216;tin&#8217;, &#11612;&#11599;&#11606; &#8216;tn&#947;&#8217;, &#11612;&#11603;&#11599; &#8216;tun&#8217;, &#11612;&#11609;&#11599; &#8216;tsn&#8217;, &#11609;&#11599;&#11612; &#8216;snt&#8217;, &#11617;&#11598;&#11612; &#8216;wmt&#8217;} ; {&#11612;&#11603;&#11599;&#11612; &#8216;tunt&#8217;, &#11612;&#11609;&#11599;&#11612; &#8216;tsnt&#8217;}}. 
</p>
<p>3.2 Evaluation 
</p>
<p>L&#8217;&#233;valuation des algorithmes de pseudo-racinisation ou de racinisation est bas&#233;e sur le calcul des mesures 
de pr&#233;cision et de rappel qui sont utilis&#233;es particuli&#232;rement dans le contexte de la recherche d&#8217;information. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PSEUDO-RACINISATION POUR LA LANGUE AMAZIGHE 
N&#233;anmoins, ces mesures ne montrent pas les causes sp&#233;cifiques des erreurs, ce qui n'aide pas les 
concepteurs &#224; optimiser leurs algorithmes. Ainsi, Paice a propos&#233; une m&#233;thode d'&#233;valuation par 
l&#8217;introduction de deux mesures : la sous-racinisation qui survient quand deux termes apparent&#233;s ne sont 
pas r&#233;duits &#224; la m&#234;me pseudo-racine et la sur-racinisation qui appara&#238;t lorsque deux termes non apparent&#233;s 
sont associ&#233;s &#224; la m&#234;me pseudo-racine par erreur (Paice, 1994). Cette m&#233;thode n&#233;cessite un &#233;chantillon de 
w mots class&#233;s dans g groupes de concepts, dont les ng attributs de chaque groupe sont morphologiquement 
et s&#233;mantiquement li&#233;s les un aux autres. Ainsi, les taux d&#8217;erreurs de sous-racinisation et sur-racinisation 
sont calcul&#233;s respectivement selon les formules suivantes : GDMTGUMTUS =  et GDNTGWMTOS =  ; o&#249; 
</p>
<p>&#8721; &#8721; &#8722;= g n ggg nnGDMT )1(5.0 , &#8721; &#8721; &#8722;= g n ggg nwnGDNT )(5.0 , &#8721; &#8721; &#8722;= g s sgsg gg unuGUMT )(5.0  et 
</p>
<p>&#8721; &#8721; &#8722;= s t tsts ss vnvGWMT )(5.0  ; o&#249; s est le nombre total des pseudo-racines distinctes, sg est le nombre 
des pseudo-racines dans un groupe, ts et ns sont respectivement le nombre de concepts et de mots r&#233;duits &#224; 
la m&#234;me pseudo-racine, 
</p>
<p>gs
u est le nombre de mots r&#233;duits &#224; la m&#234;me pseudo-racine dans le groupe g et 
</p>
<p>st
v est le nombre des mots r&#233;duits &#224; la m&#234;me pseudo-racine et appartenant au concept t. 
</p>
<p>Dans le but d&#8217;&#233;valuer notre approche, nous avons &#233;labor&#233; un &#233;chantillon de vocabulaire bas&#233; sur la 
cat&#233;gorie des noms extrait de l&#8217;ouvrage de (Ameur et al., 2009). Le vocabulaire de cet ouvrage est 
constitu&#233; principalement des formes de pluriel, de l&#8217;&#233;tat libre et d&#8217;annexion des noms et des formes de 
verbes aux quatre aspects. Afin d&#8217;&#233;viter de biaiser l&#8217;&#233;valuation de notre algorithme, nous n&#8217;avons utilis&#233; 
que la cat&#233;gorie nom, puisque les verbes ne sont repr&#233;sent&#233;s que par une seule forme relative &#224; un aspect. 
Ainsi, notre &#233;chantillon se compose de 2171 formes distinctes, que nous avons regroup&#233; manuellement en 
750 concepts o&#249; chaque groupe contient la forme du masculin et du f&#233;minin en plus des formes de pluriel, 
de l&#8217;&#233;tat libre et d&#8217;annexion si elles existent dans l&#8217;ouvrage. 
</p>
<p>Par l&#8217;application de notre algorithme &#224; cet &#233;chantillon, nous avons &#233;tabli 1015 pseudo-racines ce qui nous a 
permis de r&#233;duire la taille de l&#8217;&#233;chantillon &#233;labor&#233; de 53.2%. Par ailleurs, en se basant sur les mesures de 
Paice pour le calcul des erreurs de sur-racinisation et sous-racinisation, nous avons abouti &#224; un taux 
d&#8217;erreur de 33.7% pour la sous-racinisation et de 0.4% pour la sur-racinisation. Suite &#224; l&#8217;analyse des 
r&#233;sultats obtenus par notre algorithme nous avons constat&#233; que le taux d&#8217;erreur de la sous-racinisation est 
d&#251; principalement au pourcentage &#233;lev&#233; de 64.6% du pluriel irr&#233;gulier par rapport aux formes de pluriel, 
qui constituent &#224; leur tour 40.7% de l&#8217;ensemble des mots distincts de l&#8217;&#233;chantillon. Par contre, le taux 
d&#8217;erreur de la sur-racinisation est d&#251; essentiellement aux probl&#232;mes de l&#8217;&#233;limination de certains affixes qui 
font partie du mot. A titre d&#8217;exemple, nous citons le cas du mot &#11568;&#11599;&#11568;&#11580;&#11606;&#11568;&#11599; &#8216;anaf&#947;an&#8217; d&#233;riv&#233; qui se termine par 
le morph&#232;me &#11568;&#11599; &#8216;an&#8217; du pluriel. 
</p>
<p>4 Conclusion 
Le pr&#233;sent article s&#8217;inscrit dans une strat&#233;gie progressive qui vise &#224; encourager le traitement automatique 
de la langue amazighe &#224; travers l&#8217;&#233;laboration d&#8217;outils de base et de ressources linguistiques. Ainsi, nous 
avons entrepris de r&#233;aliser un pseudo-racineur de la langue amazighe standard du Maroc. L&#8217;approche 
propos&#233;e est simple et l&#233;g&#232;re. Elle se base sur l&#8217;&#233;limination d&#8217;une liste pr&#233;d&#233;termin&#233;e de pr&#233;fixes et de 
suffixes flexionnels, sans recours ni &#224; des dictionnaires ni &#224; des &#233;tiqueteurs morphosyntaxiques. Elle 
permet de regrouper les mots li&#233;s s&#233;mantiquement. Cependant, l&#8217;analyse r&#233;alis&#233;e a permis de  remarquer 
l&#8217;existence de deux types d&#8217;erreurs la sous-racinisation et la sur-racinisation. Dans la perspective 
d&#8217;am&#233;liorer ce travail, nous visons d&#8217;&#233;tendre l&#8217;approche par l&#8217;int&#233;gration d&#8217;un module de recodage bas&#233; sur 
des r&#232;gles linguistiques. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADOUA ATAA ALLAH, SIHAM BOULAKNADEL 
R&#233;f&#233;rences  
AMEUR M., BOUHJAR A., BOUKHRIS F., BOUKOUSS A., BOUMALK A., ELMEDLAOUI M., IAZZI E., SOUIFI H. 
(2004). Initiation &#224; la langue amazighe. Rabat, Maroc : IRCAM. 
</p>
<p>AMEUR M., BOUHJAR A., BOUKHRIS F., BOUKOUSS A., BOUMALK A., ELMEDLAOUI M., IAZZI E. (2006). 
Graphie et orthographe de l&#8217;amazighe. Rabat, Maroc : IRCAM. 
</p>
<p>AMEUR M., BOUHJAR A., BOUMALK A., EL AZRAK N., LAABDELAOUI R. (2009). Vocabulaire de la langue 
amazighe (amazighe-arabe). Rabat, Maroc : IRCAM. 
</p>
<p>ATAA ALLAH F., JAA H. (2009). Etiquetage morphosyntaxique : Outil d&#8217;assistance d&#233;di&#233; &#224; la langue 
Amazighe. Actes du 1er symposium international sur le traitement automatique de la culture amazighe. 
110-119. 
</p>
<p>BOUKHRIS F., BOUMALK A., ELMOUJAHID E., SOUIFI H. (2008). La nouvelle grammaire de l'amazighe. 
Rabat, Maroc : IRCAM. 
</p>
<p>BOULAKNADEL S. (2009).  Amazigh ConCorde: an appropriate concordance for Amazigh. Actes du 1er 
symposium international sur le traitement automatique de la culture amazighe. 176-182.   
</p>
<p>ES SAADY Y., AIT OUGUENGAY Y., RACHIDI A., EL YASSA M., MAMMASS D. (2009). Adaptation d'un 
correcteur orthographique existant &#224; la langue Amazighe : cas du correcteur Hunspell. Actes du 1er 
symposium international sur le traitement automatique de la culture amazighe. 149-158. 
</p>
<p>FAKIR M., BOUIKHALENE B., MORO K. (2009). Skeletonization methods evaluation for the recognition of 
printed tifinaghe characters. Actes du 1er symposium international sur le traitement automatique de la 
culture amazighe. 33-47. 
</p>
<p>GREENBERG J. (1966). The Languages of Africa. Mouton, USA : The Hague.  
IAZZI E., OUTAHAJALA M. (2008). Amazigh Data Base. Actes de L&#8217;atelier HLT &amp; NLP within the Arabic 
world: Arabic language and local languages processing status updates and prospects. 36-39. 
</p>
<p>KAMEL S. (2006). Lexique Amazighe de g&#233;ologie. Rabat, Maroc : IRCAM. 
</p>
<p>LARKEY L. S., BALLESTEROS L., CONNELL M. (2002). Improving stemming for arabic information retrieval: 
light stemming and cooccurrence analysis. Actes de the 25th annual international conference on research 
and development in information retrieval. 275-282. 
PAICE C.D. (1994). An evaluation  method for stemming algorithms. Actes de the 17th ACM SIGIR 
conference. 42-50. 
PORTER M.F. (1980). An algorithm for suffix stripping. Program 14, 130-137. 
</p>
<p>RACHIDI A., MAMMAS M. (2007). Vers un syst&#232;me de traduction automatique en ligne des documents 
amazighs fond&#233; sur les graphes UNL. La revue &#233;lectronique des technologies de l'information 4. 
SAVOY, J. (1993). Stemming of French words based on grammatical categories. The American society for 
information science 44, 1-9. </p>

</div></div>
</body></html>