<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction semi-automatique d&#8217;un vocabulaire savant de base pour l&#8217;indexation automatique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Extraction semi-automatique d&#146;&#8217;un vocabulaire savant de base pour 
l&#146;&#8217;indexation automatique 
</p>
<p>Lyne Da Sylva1 
</p>
<p>(1)  &#201;cole de biblioth&#233;conomie et des sciences de l'information, Universit&#233; de 
Montr&#233;al, C.P. 6128, succ. Centre-ville, Montr&#233;al, Canada H3C 3J7 
</p>
<p>lyne.da.sylva@umontreal.ca  
</p>
<p>R&#233;sum&#233; Le projet d&#233;crit vise &#224; soutenir les efforts de constitution de ressources lexicales utiles &#224; 
l&#146;&#8217;indexation automatique. Un type de vocabulaire utile &#224; l&#146;&#8217;indexation est d&#233;fini, le vocabulaire savant de 
base, qui peut s&#146;&#8217;articuler avec le vocabulaire sp&#233;cialis&#233; pour constituer des entr&#233;es d&#146;&#8217;index structur&#233;es. 
On pr&#233;sente les r&#233;sultats d&#146;&#8217;une exp&#233;rimentation d&#146;&#8217;extraction (semi-)automatique des mots du 
vocabulaire savant de base &#224; partir d&#146;&#8217;un corpus cibl&#233;, constitu&#233; de r&#233;sum&#233;s d&#146;&#8217;articles scientifiques en 
fran&#231;ais et en anglais. La t&#226;che d&#146;&#8217;extraction a r&#233;ussi &#224; doubler une liste originale constitu&#233;e 
manuellement pour le fran&#231;ais. La comparaison est &#233;tablie avec une exp&#233;rimentation similaire effectu&#233;e 
pour l&#146;&#8217;anglais sur un corpus plus grand et contenant des r&#233;sum&#233;s d&#146;&#8217;articles non seulement en sciences 
pures mais aussi en sciences humaines et sociales.  
</p>
<p>Abstract This project aims to help develop lexical resources useful for automatic indexing. A type of 
useful vocabulary for indexing is defined, the basic scholarly vocabulary, which can combine with 
specialized vocabulary items to form evocative, structured index entries. The article presents the results 
of an experiment of (semi-)automatic extraction of the basic scholarly vocabulary lexical items from a 
large corpus. The corpus is especially suited to the task; it consists of abstracts of scientific articles in 
French and English. The extraction task was successful in doubling the size of a previously manually 
compiled list. A comparison is made with a similar experiment conducted for English on a larger corpus 
which also contained summaries of articles in the humanities and social sciences. 
</p>
<p>Mots-cl&#233;s :   classes de vocabulaire ; indexation automatique ; extraction automatique ; corpus ; 
approche bas&#233;e sur les corpus ; vocabulaire savant de base ; ressources lexicales ; fran&#231;ais 
</p>
<p>Keywords:   vocabulary classes; automatic indexing; automatic extraction; corpus; corpus-based 
approach; basic scholarly vocabulary; lexical resources; French 
</p>
<p>1 Introduction 
Le pr&#233;sent article s&#146;&#8217;inscrit dans des travaux li&#233;s &#224; l&#146;&#8217;indexation automatique. Il vise &#224; soutenir les efforts 
de constitution de ressources lexicales utiles &#224; l&#146;&#8217;indexation automatique. Dans notre approche &#224; l&#146;&#8217;indexa-
tion, nous reconnaissons l&#146;&#8217;apport de deux types de vocabulaires utiles : le vocabulaire scientifique et 
technique sp&#233;cialis&#233; d&#146;&#8217;une part, et le vocabulaire &#171; savant de base &#187;, qui s&#146;&#8217;articule avec le premier pour 
constituer des entr&#233;es d&#146;&#8217;index structur&#233;es complexes, plus utiles dans certains contextes d&#146;&#8217;indexation. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LYNE DA SYLVA 
Nous pr&#233;sentons les r&#233;sultats d&#146;&#8217;une exp&#233;rimentation ayant pour but de cr&#233;er une ressource lexicale, la 
liste du vocabulaire savant de base en fran&#231;ais, constitu&#233;e de mots r&#233;pondant &#224; des crit&#232;res s&#233;mantiques 
sp&#233;cifiques, esquiss&#233;s ci-dessous. La cr&#233;ation s&#146;&#8217;est appuy&#233;e sur l&#146;&#8217;extraction semi-automatique de 
donn&#233;es &#224; partir d&#146;&#8217;un corpus cibl&#233;. L&#146;&#8217;article pr&#233;sente la probl&#233;matique, d&#233;crit l&#146;&#8217;exp&#233;rimentation et ses 
r&#233;sultats, et &#233;tablit une comparaison avec une exp&#233;rimentation similaire effectu&#233;e pour l&#146;&#8217;anglais. 
</p>
<p>2 Probl&#233;matique 
L&#146;&#8217;indexation traditionnelle peut s&#146;&#8217;envisager selon les deux approches suivantes : l&#146;&#8217;indexation macrosco-
pique (database indexing en anglais, ou indexation pour les bases de donn&#233;es), o&#249; les documents sont 
d&#233;crits globalement par quelques termes d&#146;&#8217;indexation, permet de rep&#233;rer un document dans une collec-
tion; l&#146;&#8217;indexation microscopique (back-of-the-book indexing, ou indexation de livres) sert &#224; pr&#233;ciser pour 
un document donn&#233; les sujets abord&#233;s dans celui-ci et, surtout, dans quel passage les trouver. Dans cha-
cune, la distinction ci-dessus entre le vocabulaire sp&#233;cialis&#233; et celui dit g&#233;n&#233;ral se remarque, bien que de 
mani&#232;re diff&#233;rente. Dans l&#146;&#8217;indexation macroscopique, des mots-cl&#233;s th&#233;matiques comme &#171; jurispru-
dence &#187; ou &#171; droit communautaire &#187; (voir l&#146;&#8217;exemple (1) ci-dessous) sont &#224; interpr&#233;ter directement; alors 
que certains mots g&#233;n&#233;raux, comme &#171; application &#187;, doivent &#234;tre interpr&#233;t&#233;s en relation avec les mots 
th&#233;matiques (le document en question traite de l&#146;&#8217;application de la jurisprudence ou du droit commu-
nautaire, et non de la notion d&#146;&#8217;&#171; application &#187; en soi). Ces mots &#171; g&#233;n&#233;raux &#187; seront d&#233;finis comme le 
vocabulaire savant de base, ou VSB. Leur contribution doit ainsi &#234;tre interpr&#233;t&#233;e diff&#233;remment. 
</p>
<p>(1) Droit communautaire, Application, Jurisprudence 1  
 
</p>
<p>L&#146;&#8217;indexation microscopique formalise cette interpr&#233;tation dans la structuration des entr&#233;es : une entr&#233;e 
d&#146;&#8217;index qui exprimerait la m&#234;me notion que ci-dessus pourrait se pr&#233;senter comme &#224; l&#146;&#8217;exemple (2). 
</p>
<p>(2) droit communautaire, 186-189 
   application, 138, 141, 227 
 
</p>
<p>C&#146;&#8217;est dans le but de permettre la cr&#233;ation d&#146;&#8217;entr&#233;es structur&#233;es que nous avons &#233;tudi&#233; les caract&#233;ristiques 
des vedettes principales et secondaires, et que nous avons d&#233;gag&#233; cette distinction dans les types de mots 
qui y apparaissent. 
</p>
<p>L&#146;&#8217;utilisation diff&#233;renci&#233;e des mots issus des diff&#233;rentes classes de vocabulaire est pr&#233;conis&#233;e dans 
l&#146;&#8217;enseignement de l&#146;&#8217;indexation aux indexeurs professionnels. Le vocabulaire savant de base (VSB) est 
pr&#233;sent&#233; chez Waller (1999). Elle le d&#233;crit comme &#233;tant situ&#233; entre le vocabulaire commun (acquis au 
cours de l&#146;&#8217;enfance) et le vocabulaire scientifique et technique sp&#233;cialis&#233; (relevant de la terminologie). Le 
VSB est acquis au cours des &#233;tudes secondaires et sert &#224; exprimer le discours savant. On retrouve 
&#233;galement une notion similaire dans les sections &#171; mots-outils &#187; des th&#233;saurus documentaires, qui ne 
servent qu&#146;&#8217;&#224; exprimer des aspects des termes du th&#233;saurus. Les caract&#233;ristiques linguistiques du 
VSB peuvent &#234;tre &#233;num&#233;r&#233;es comme suit : ce sont des mots abstraits pour la plupart, ne d&#233;signant pas 
des objets concrets; ils appartiennent au vocabulaire savant, relevant d&#146;&#8217;un certain niveau d&#146;&#8217;&#233;rudition; 
enfin, ils sont  tr&#232;s largement transdisciplinaires, avec un sens g&#233;n&#233;ral et non sp&#233;cifique &#224; un domaine 
disciplinaire. Cette derni&#232;re caract&#233;ristique a inspir&#233; notre exp&#233;rimentation. Ces crit&#232;res, bien que vagues 
et g&#233;n&#233;raux, nous ont permis de d&#233;cider si un mot doit &#234;tre inclus dans le VSB ou non.  
</p>
<p>                                                 
</p>
<p>1 Notice tir&#233;e de la base de donn&#233;es RESSAC, http://194.199.119.234/Ressac.htm, correspondant &#224; l&#146;&#8217;article &#171; Dans quelle 
situation, le droit de l'Union europ&#233;enne trouve-t-il &#224; s'appliquer en droit interne ? &#187;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION SEMI-AUTOMATIQUE D&#146;&#8217;UN VSB POUR L&#146;&#8217;INDEXATION AUTOMATIQUE 
Ce vocabulaire est difficile &#224; circonscrire. On ne peut facilement se baser sur sa fr&#233;quence relative 
d&#146;&#8217;apparition dans les corpus : les termes &#171; aspectuels &#187; ne se distinguent pas a priori par leur fr&#233;quence 
d&#146;&#8217;apparition mais par leurs propri&#233;t&#233;s s&#233;mantiques. De plus, ils pr&#233;sentent la difficult&#233; d&#146;&#8217;&#234;tre 
polys&#233;miques et ambigus : des mots comme &#171; application &#187; ont plusieurs d&#233;finitions (notamment, le sens 
de &#171; logiciel &#187;) en plus de leur sens g&#233;n&#233;ral (soit ici la nominalisation du verbe &#171; appliquer &#187;, exprimant 
son processus ou son r&#233;sultat). Leur fr&#233;quence d&#146;&#8217;utilisation peut donc &#234;tre fauss&#233;e par la coexistence des 
deux sens dans un document donn&#233;. L&#146;&#8217;objectif de la pr&#233;sente recherche est donc de trouver un moyen 
d&#146;&#8217;identifier un ensemble de mots qui rel&#232;vent de cette classe du VSB afin de guider un logiciel 
d&#146;&#8217;indexation automatique dans l&#146;&#8217;attribution d&#146;&#8217;entr&#233;es d&#146;&#8217;indexation. 
</p>
<p>3 Travaux ant&#233;rieurs 
Un certain nombre de chercheurs ont &#233;tudi&#233; la notion de classes de vocabulaire dans le but de 
caract&#233;riser un vocabulaire de base. Beaucoup d'entre eux rel&#232;vent du cadre de &#171;l'anglais &#224; des fins 
sp&#233;cifiques &#187; (Johns et Dudley-Evans, 1991). Certaines listes sp&#233;cifiques ont &#233;t&#233; publi&#233;es. Ogden (1930) 
a d&#233;velopp&#233; le Basic English (anglais de base), pour les apprenants de l&#146;&#8217;anglais, constitu&#233; de 600 noms, 
150 adjectifs, 100 mots outils et 18 verbes. La Academic Word List (AWL) (Coxhead, 2000) est con&#231;ue 
comme un vocabulaire sp&#233;cifique de l&#146;&#8217;anglais pour fins acad&#233;miques: Elle exclut les mots qui 
apparaissent dans les 2000 les plus fr&#233;quents de l'anglais, dont &#171; capacity &#187;, &#171; absence &#187; ou &#171; study &#187; 
(que nous consid&#233;rons du VSB).  Certains chercheurs ont identifi&#233; les caract&#233;ristiques de l'anglais &#233;crit 
scientifique et technique (ex. Swales, 1971). Celles-ci d&#233;passent la notion de vocabulaire, abordant aussi 
des questions de style et de grammaire. Des travaux similaires ont &#233;t&#233; faits sur le fran&#231;ais. Le 
&#171; Vocabulaire g&#233;n&#233;ral d'orientation scientifique &#187; de Phal (1971) identifie un vocabulaire g&#233;n&#233;ral ax&#233; sur 
la science, qui contient 1160 mots, dont des noms, adjectifs, verbes, etc., y compris des mots du 
vocabulaire commun. Drouin (2007) travaille &#224; la d&#233;finition d'un &#171; lexique transdisciplinaire 
scientifique &#187;, utile pour les travaux de terminologie. Pour l&#146;&#8217;indexation, une liste du VSB ne doit 
contenir aucun mot du vocabulaire commun, ni sp&#233;cialis&#233;; il doit &#234;tre limit&#233; aux noms (seuls utilis&#233;s en 
indexation), et les mots doivent couvrir toutes les disciplines, pas seulement les scientifiques (puisque 
l'indexation se fait autant dans les sciences sociales et humaines que dans les sciences pures et 
appliqu&#233;es).  
</p>
<p>Tr&#232;s peu de travaux ont &#233;t&#233; consacr&#233;s &#224; la nature des entr&#233;es d'index (c.f. Jones &amp; Paynter, 2003; 
Wacholder &amp; Song, 2003). Ces travaux n&#146;&#8217;ont cependant pas examin&#233; les caract&#233;ristiques s&#233;mantiques ou 
lexicales des entr&#233;es d'index utiles. D&#146;&#8217;un point de vue th&#233;orique, Flaux et Van de Velde (2000) 
proposent une classification des noms, d&#146;&#8217;abord s&#233;par&#233;s en noms &#171; v&#233;ritables &#187; (d&#233;notant des choses) et 
noms &#171; d&#233;riv&#233;s &#187; (form&#233;s &#224; partir de verbes ou d&#146;&#8217;adjectifs). Les mots du VSB appartiendraient 
vraisemblablement &#224; la deuxi&#232;me classe. Une &#233;tude plus approfondie de leurs crit&#232;res de classement 
pourra apporter un &#233;clairage sur les r&#233;sultats obtenus par notre exp&#233;rimentation. 
</p>
<p>Divers travaux portent sur l&#146;&#8217;extraction automatique de ressources lexicales, dont plusieurs en extraction 
terminologique (dont Vergne, 2005; Jacquemin et Bourigault, 2003; Daille, 1996). Cette optique est en 
fait &#224; l&#146;&#8217;oppos&#233; de notre d&#233;marche, puisque nous cherchons des mots partag&#233;s par toutes les disciplines. 
Par ailleurs, les expressions &#224; plusieurs mots renvoient davantage aux termes qu&#146;&#8217;au VSB, ce qui nous a 
orient&#233; vers la recherche de mots simples (malgr&#233; l&#146;&#8217;existence d&#146;&#8217;exceptions comme &#171; point de vue &#187;,  
multi-lex&#233;mique mais appartenant plut&#244;t au VSB). Certaines approches opposent un corpus de r&#233;f&#233;rence 
(ou g&#233;n&#233;ral) couvrant divers domaines &#224; un corpus sp&#233;cialis&#233;, dont on veut extraire les termes (ou les 
expressions sp&#233;cifiques) (voir par exemple Drouin, 2007). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LYNE DA SYLVA 
</p>
<p>4 M&#233;thodologie exp&#233;rimentale 
</p>
<p>Nous avons fait le pari qu&#146;&#8217;il &#233;tait possible, au moins en partie, d&#146;&#8217;extraire automatiquement les &#233;l&#233;ments 
lexicaux qui nous int&#233;ressent &#224; partir d&#146;&#8217;un grand corpus. Encore fallait-il le cibler de mani&#232;re appropri&#233;e. 
&#201;tant donn&#233; le type de mots vis&#233;s, soit des mots du vocabulaire savant, d&#146;&#8217;application g&#233;n&#233;rale et de 
nature abstraite, nous avons cherch&#233; un corpus savant transdisciplinaire. Celui-ci devait &#234;tre de taille 
suffisamment grande pour profiter des effets de nombre. Des travaux pr&#233;c&#233;dents effectu&#233;s pour l&#146;&#8217;anglais 
(Da Sylva, 2010) nous avaient d&#233;j&#224; men&#233;e sur la piste des bases de donn&#233;es bibliographiques. 
</p>
<p>Le corpus que nous avions constitu&#233; pour l&#146;&#8217;anglais comprenait des fiches bibliographiques contenant des 
titres et des r&#233;sum&#233;s, de revues savantes vari&#233;es: en beaux-arts, sciences sociales et humaines, sciences 
pures et appliqu&#233;es. Le corpus &#233;tait constitu&#233; d&#146;&#8217;environ 14 millions de mots anglais tir&#233;s de sept bases de 
donn&#233;es bibliographiques. Nous avons compt&#233; les fr&#233;quences d&#146;&#8217;occurrences des noms lemmatis&#233;s (&#224; 
l&#146;&#8217;aide d&#146;&#8217;un dictionnaire et de r&#232;gles morphologiques) dans ce corpus. Les noms dont la dispersion n&#146;&#8217;&#233;tait 
pas suffisante parmi les sous-corpus ont &#233;t&#233; &#233;limin&#233;s, ainsi que ceux qui sont exclusivement concrets 
dans WordNet. Les r&#233;sultats obtenus sont tr&#232;s satisfaisants: sur les 1000 plus fr&#233;quents extraits, 664 mots 
ont &#233;t&#233; &#233;valu&#233;s comme appartenant effectivement &#224; la classe du VSB selon nos crit&#232;res s&#233;mantiques. 
Cette exp&#233;rimentation nous a permis de quadrupler la liste initiale (166 mots) construite &#224; partir de la 
caract&#233;risation th&#233;orique du VSB anglais manuellement (par introspection et recherche de synonymes et 
analogies), de mani&#232;re plus ais&#233;e. Pour le fran&#231;ais, nous avons pu profiter d&#146;&#8217;un corpus similaire &#224; celui 
que nous avions construit pour l&#146;&#8217;anglais, soit un ensemble de revues scientifiques publi&#233;es par l'ICIST2. 
Il s&#146;&#8217;agit de la m&#234;me collection que celle d&#233;crite dans Nadeau et al. (2005). Elle couvre divers domaines 
scientifiques (voir le tableau 1). Bien que moins volumineux que celui pour l&#146;&#8217;anglais, il s&#146;&#8217;agit quand 
m&#234;me d&#146;&#8217;un corpus savant transdisciplinaire, d&#146;&#8217;environ 2,5 millions de mots. 
</p>
<p>Tableau 1 : Taille du corpus en nombre de mots 
</p>
<p>Pour identifier les noms concrets fran&#231;ais, en l&#146;&#8217;absence d&#146;&#8217;une ressource comme WordNet (qui ne nous 
&#233;tait pas disponible), nous avons combin&#233; trois listes : la liste de mots concrets de Bonin et al. (2003), 
liste issue de travaux sur la &#171; valeur d&#146;&#8217;imagerie &#187; en psychologie et qui correspondrait selon les auteurs &#224; 
</p>
<p>                                                 
</p>
<p>2 Institut canadien de l'information scientifique et technique. Nous remercions Caroline Barri&#232;re, du Conseil national de 
recherche du Canada, d&#146;&#8217;avoir rendu possible le traitement de ce corpus. 
</p>
<p>  
Corpus 
</p>
<p>fran&#231;ais 
% du corpus 
fran&#231;ais 
</p>
<p>Corpus 
anglais 
</p>
<p>% du corpus 
anglais 
</p>
<p>Biochimie et biologie cellulaire 98 004 3.9% 86 668 4.0%
Revue canadienne de g&#233;otechnique 122 767 4.9% 105 624 4.9%
Revue canadienne de botanique 218 682 8.7% 196 278 9.1%
Revue canadienne de chimie 220 386 8.8% 192 165 9.0%
Revue canadienne de g&#233;nie civil 121 500 4.8% 104 023 4.8%
Revue canadienne des sciences de la Terre 156 469 6.2% 132 521 6.2%
Journal canadien des sc. alieutiques et aquatiques 297 392 11.9% 255 171 11.9%
Revue canadienne de recherche foresti&#232;re 345 294 13.8% 269 999 12.6%
Revue canadienne de microbiologie 173 754 6.9% 153 323 7.1%
Revue canadienne de physique 7 628 0.3% 10 470 0.5%
Revue canadienne de physiologie et pharmacologie 215 879 8.6% 183 357 8.5%
Revue canadienne de zoologie 343 125 13.7% 290 745 13.5%
Dossiers environnement 4 853 0.2% 6 421 0.3%
G&#233;ome 182 542 7.3% 160 705 7.5%
Total 2 508 275 100.00% 2 147 470 100.00%</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION SEMI-AUTOMATIQUE D&#146;&#8217;UN VSB POUR L&#146;&#8217;INDEXATION AUTOMATIQUE 
la notion de concr&#233;tude (866 noms); une liste de noms d&#146;&#8217;animaux (Les bestioles, insectes et animaux, 
http://www.bestioles.ca/, 584 noms); et une liste de noms de m&#233;tiers (pour identifier des humains) tir&#233;e 
de Wikip&#233;dia (Liste des m&#233;tiers, http://fr.wikipedia.org/wiki/Liste_des_m&#233;tiers, 781 noms). Ainsi, une 
liste de 2167 noms concrets a &#233;t&#233; cr&#233;&#233;e (quelques doublons pr&#233;sents dans deux listes ont &#233;t&#233; &#233;limin&#233;s). 
</p>
<p>Le corpus scientifique fran&#231;ais fait 2 508 275 mots (environ 1/6 de celui utilis&#233; dans l&#146;&#8217;exp&#233;rience 
pr&#233;c&#233;dente &#150;&#8211; m&#234;me ordre de grandeur bien que plus petit). Il est disponible en fran&#231;ais et en anglais 
(traductions humaines), ce qui permet de comparer l&#146;&#8217;application de la m&#233;thode &#224; notre corpus pr&#233;c&#233;dent. 
La m&#233;thodologie ci-dessus a &#233;t&#233; appliqu&#233;e au corpus anglais: comptage des fr&#233;quences des noms 
lemmatis&#233;s du corpus (10 465 occurrences), en ne conservant que les noms pr&#233;sents dans au moins la 
moiti&#233; des revues et en &#233;liminant les concrets (apr&#232;s le filtrage final: 1637 mots). 
</p>
<p>5. R&#233;sultats 
</p>
<p>Il est int&#233;ressant d&#146;&#8217;abord d&#146;&#8217;examiner les r&#233;sultats par revue, puis ceux du corpus total, et enfin d&#146;&#8217;&#233;tablir 
des comparaisons entre les diff&#233;rents corpus (en fran&#231;ais, et pour les deux corpus en langue anglaise). 
</p>
<p>Revue canadienne de 
zoologie 
1496 femelle 
1219 esp&#232;ce 
1216 m&#226;le 
1039 r&#233;daction 
971 population 
916 taille 
755 cour 
583 &#233;tude 
567 taux 
541 comportement 
535 masse 
529 r&#233;sultat 
528 nourriture 
524 effet 
511 habitat 
497 groupe 
484 petit 
476 nombre 
469 site 
468 &#234;tre 
464 reproduction 
454 p&#233;riode 
445 diff&#233;rence 
422 zone 
419 moyenne 
</p>
<p>Revue canadienne de 
recherche foresti&#232;re 
1593 arbre 
1475 croissance 
1360 peuplement 
1201 for&#234;t 
1047 esp&#232;ce 
1020 r&#233;daction 
972 sol 
729 pin 
726 effet 
726 semis 
724 mod&#232;le 
682 site 
638 bois 
599 hauteur 
579 coupe 
578 faible 
567 densit&#233; 
566 taux 
564 &#233;tude 
538 surface 
537 &#234;tre 
523 racine 
516 r&#233;sultat 
515 &#233;pinette 
506 feu  
</p>
<p>Revue canadienne des sciences 
alieutiques et aquatiques 
1449 poisson 
1428 eau 
1022 lac 
984 r&#233;daction 
970 mod&#232;le 
814 taux 
788 population 
711 croissance 
707 taille 
678 effet 
678 esp&#232;ce 
670 donn&#233;e 
643 p&#234;che 
628 concentration 
594 cour 
537 saumon 
506 &#234;tre 
493 ann&#233;e 
475 stock 
473 &#226;ge 
463 &#233;tude 
454 abondance 
453 densit&#233; 
435 habitat 
414 changement 
 
</p>
<p>Figure 1. 25 mots les plus fr&#233;quents de trois des sous-corpus scientifiques 
</p>
<p>Pour chaque revue, les mots les plus fr&#233;quents correspondent assez largement &#224; des th&#233;matiques impor-
tantes du domaine (voir un &#233;chantillon &#224; la figure 1). Bien s&#251;r, certains de ces mots n&#146;&#8217;appartiennent pas 
au VSB. On trouve principalement ici trois types d&#146;&#8217;intrus : des mots sp&#233;cialis&#233;s ou sp&#233;cifiques (ex. 
&#171; temp&#233;rature &#187;, &#171; population &#187;), des concrets non identifi&#233;s comme tels &#224; cause de la pauvret&#233; de nos 
ressources (ex. &#171; eau &#187;, &#171; site &#187;) et des mots ambigus avec une autre cat&#233;gorie grammaticale (ex. 
&#171; &#234;tre &#187;). Cette derni&#232;re classe a &#233;t&#233; trait&#233;e de mani&#232;re sp&#233;ciale, en l&#146;&#8217;absence d&#146;&#8217;un &#233;tiqueteur (POS 
tagger) : les mots &#224; cat&#233;gorie morphosyntaxique ambigu&#235; ont &#233;t&#233; pour l&#146;&#8217;instant exclus de la liste extraite. 
</p>
<p>Si l&#146;&#8217;on consid&#232;re maintenant l&#146;&#8217;ensemble du corpus, soit toutes les revues confondues, les mots les plus 
fr&#233;quents transcendent les th&#233;matiques disciplinaires et se g&#233;n&#233;ralisent, tel qu&#146;&#8217;esp&#233;r&#233;. Les 25 premiers </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LYNE DA SYLVA 
sont donn&#233;s &#224; la figure 2, avec leur fr&#233;quence. &#201;videmment l&#146;&#8217;identification des concrets laisse &#224; d&#233;sirer : 
non seulement n&#146;&#8217;est-ce pas exhaustif (&#171; eau &#187; est un concret, comme l&#146;&#8217;indique WordNet pour &#171; water &#187;), 
mais aussi certains mots sont ambigus entre concret et abstrait; par exemple le nom d&#146;&#8217;animal &#171; &#233;lan &#187; est 
exclu sur la base qu&#146;&#8217;il appara&#238;t dans la liste des concrets. Apr&#232;s analyse, sur les 1637 noms ainsi extraits, 
682 mots sont jug&#233;s comme appartenant au VSB d&#146;&#8217;apr&#232;s les crit&#232;res th&#233;oriques; cela repr&#233;sente pr&#232;s de 
60% des mots non ambigus extraits (1150 mots sur 1637). Des statistiques: le VSB repr&#233;sente 100% des 
6 premiers non ambigus; 90% des 100 premiers non ambigus; plus de 80% des 58 premiers (m&#234;me avec 
ambigus); voir la figure 7.  
</p>
<p>4061 &#233;tude 
3860 r&#233;sultat 
3813 effet 
3689 esp&#232;ce 
2865 analyse 
2817 eau 
2615 donn&#233;e 
</p>
<p>2564 type 
2505 faible 
2224 croissance 
2197 taux 
2186 groupe 
2184 mod&#232;le 
2060 site 
</p>
<p>2048 r&#233;gion 
2046 structure 
2013 concentration 
1961 population 
1869 valeur 
1843 niveau 
1824 condition 
</p>
<p>1802 pr&#233;sence 
1757 m&#233;thode 
1728 temp&#233;rature 
1676 augmentation 
</p>
<p>Figure 2. 25 mots les plus fr&#233;quents du corpus scientifique fran&#231;ais total 
</p>
<p>4061 &#233;tude 
3860 r&#233;sultat 
3813 effet 
3689 esp&#232;ce 
2865 analyse 
2615 donn&#233;e 
2564 type 
2224 croissance 
2197 taux 
2186 groupe 
2184 mod&#232;le 
2048 r&#233;gion 
2046 structure 
2013 concentration 
1869 valeur 
1843 niveau 
1824 condition 
1802 pr&#233;sence 
1757 m&#233;thode 
1728 temp&#233;rature 
1676 augmentation 
1662 syst&#232;me 
1656 surface 
1631 rapport 
1583 fonction 
</p>
<p>1561 nombre 
1546 variation 
1484 forme 
1417 diff&#233;rence 
1365 changement 
1354 fa&#231;on 
1333 produit 
1313 activit&#233; 
1291 moyenne 
1260 relation 
1225 zone 
1201 caract&#233;ristique 
1199 d&#233;veloppement 
1195 mesure 
1185 base 
1184 temps 
1126 fait 
1122 densit&#233; 
1121 p&#233;riode 
1073 r&#233;action 
1029 cas 
1026 partie 
 973 &#233;chantillon 
 967 processus 
 965 taille 
</p>
<p>957 moyen 
948 longueur 
935 milieu 
929 corr&#233;lation 
923 production 
893 masse 
858 exp&#233;rience 
850 hypoth&#232;se 
845 technique 
843 formation 
836 capacit&#233; 
836 interaction 
833 ensemble 
825 distribution 
811 potentiel 
809 traitement 
807 m&#233;canisme 
798 utilisation 
784 variable 
775 fr&#233;quence 
773 suite 
764 comportement 
757 r&#233;sistance 
754 &#233;tat 
746 r&#244;le
</p>
<p>Figure 3. 75 premiers mots du VSB extrait 
</p>
<p>La nouvelle liste de mots du VSB ainsi obtenue contient 682 mots, dont les 75 premiers sont pr&#233;sent&#233;s &#224; 
la figure 3 (avec leur fr&#233;quence dans le corpus). Ces mots sont d&#146;&#8217;application g&#233;n&#233;rale, non sp&#233;cialis&#233;e. 
En fait, cette liste doit &#234;tre combin&#233;e &#224; notre liste pr&#233;alable, &#233;tant donn&#233; la faible couverture du corpus : 
seulement 1637 mots survivent &#224; l&#146;&#8217;&#233;limination des mots n&#146;&#8217;appartenant pas &#224; au moins une moiti&#233; des 
revues; 64 mots originalement identifi&#233;s comme VSB n&#146;&#8217;&#233;taient pas pr&#233;sents dans le corpus. La liste 
finale contient donc 746 mots. Notons que la liste originale (construite manuellement) faisait 430 mots.  
</p>
<p>Puisque le corpus que nous avons utilis&#233; contient des r&#233;sum&#233;s fran&#231;ais et des r&#233;sum&#233;s anglais pour les 
m&#234;mes articles, nous avons compar&#233; les r&#233;sultats obtenus pour chacune des deux langues. Il sera ensuite 
int&#233;ressant de comparer les r&#233;sultats obtenus ici pour l&#146;&#8217;anglais avec ceux que nous avions obtenus pour 
notre corpus anglais de 14 millions de mots, dans lequel davantage de disciplines sont repr&#233;sent&#233;es. La 
liste des 25 mots les plus fr&#233;quents du corpus scientifique anglais est donn&#233;e au tableau 2, premi&#232;re 
colonne. Parmi les mots n&#146;&#8217;appartenant pas au VSB, on note &#171; species &#187; et &#171; population &#187; (&#171; found &#187;, </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION SEMI-AUTOMATIQUE D&#146;&#8217;UN VSB POUR L&#146;&#8217;INDEXATION AUTOMATIQUE 
&#171; high &#187; et &#171; present &#187; sont des intrus ambigus). En comparaison, les 25 mots les plus fr&#233;quents du grand 
corpus anglais y sont donn&#233;s en deuxi&#232;me colonne. On voit que les mots n&#146;&#8217;apparaissent pas aux m&#234;mes 
rangs; en outre, 11 mots seulement appartiennent aux deux listes (&#171; study &#187;, &#171; result &#187;, &#171; effect &#187;, 
&#171; analysis &#187;, &#171; datum &#187;, &#171; time &#187;, &#171; structure &#187;, &#171; group &#187;, &#171; change &#187;, &#171; system &#187;, et &#171; type &#187;). 
</p>
<p>Corpus scientifique anglais Grand corpus anglais 
Fr&#233;q. ajust&#233;e Mot VSB? Fr&#233;q. ajust&#233;e Mot VSB? 
</p>
<p>4703 study 1 17806 system 1 
4362 result 1 17482 study 1 
3817 species 0 15522 use 1 
3776 effect 1 14569 analysis 1 
3004 analysis 1 12894 reference 1 
2754 level 1 11228 problem 1 
2722 datum 1 11177 time 1 
2659 rate 1 11081 process 1 
2321 found 0 10987 form 1 
2127 high 0 10682 datum 1 
2082 concentration 1 10366 research 1 
2079 population 0 10290 result 1 
2068 time 1 9751 change 1 
2059 structure 1 9697 relationship 1 
2047 group 1 9690 effect 1 
2032 change 1 9576 group 1 
2008 system 1 9401 structure 1 
1959 condition 1 9230 method 1 
1956 increase 1 8702 present 0 
1874 type 1 8658 source 1 
1742 value 1 8483 information 1 
1733 present 0 8004 theory 1 
1719 temperature 1 7866 type 1 
1664 area 1 7758 role 1 
1648 region 1 7698 show 0 
</p>
<p>Tableau 2. 25 mots les plus fr&#233;quents du corpus scientifique anglais et du grand corpus anglais 
</p>
<p>Dans les premiers rangs de fr&#233;quence du corpus scientifique apparaissent plusieurs mots d&#146;&#8217;usage g&#233;n&#233;ral 
dans un corpus scientifique et technique (plusieurs faisant r&#233;f&#233;rence &#224; des calculs ou mesures : &#171; rate &#187;, 
&#171; concentration &#187;, &#171; increase &#187;, &#171; value &#187;) qui ne sont pas &#233;galement r&#233;pandus dans des textes en 
sciences humaines et sociales ou en arts. Ceci renforce notre position que, pour identifier le VSB, il faut 
tenir compte de toutes les disciplines o&#249; l&#146;&#8217;on retrouve des publications savantes. 
</p>
<p>Regardons maintenant comment se comparent les corpus fran&#231;ais et anglais &#233;quivalents. La figure 5 
illustre que l&#146;&#8217;on trouve des pourcentages assez comparables au m&#234;me rang dans l&#146;&#8217;analyse du corpus des 
deux langues (mais pour l&#146;&#8217;anglais, au rang 1176, 53% des mots sont du VSB, contre 63% pour le 
fran&#231;ais). La figure 4 pr&#233;sente les 75 premiers mots (avec fr&#233;quence) extraits du corpus scientifique 
anglais et qui ont &#233;t&#233; jug&#233;s comme appartenant au VSB. On peut la comparer &#224; la figure 3. Plusieurs 
&#233;quivalents traductionnels se retrouvent ou bien au m&#234;me rang, ou bien &#224; des rangs proches (notamment, 
les 3 premiers rangs re&#231;oivent les m&#234;mes mots). D&#146;&#8217;autres, dont la traduction est ambigu&#235;, sont s&#233;par&#233;s 
(c&#146;&#8217;est le cas de &#171; time &#187;, qui peut se traduire par &#171; temps &#187; ou &#171; fois &#187;). Le mot &#171; structure &#187; a presque la 
m&#234;me fr&#233;quence d&#146;&#8217;occurrence dans les deux langues (2046 vs. 2059). Enfin, comparons les trois 
exp&#233;riences. La figure 5 pr&#233;sente, par rang, le pourcentage des mots du VSB extraits du grand corpus 
anglais et des deux corpus scientifiques. L&#146;&#8217;analyse s&#146;&#8217;y &#233;tait limit&#233;e aux 1000 premiers mots. Les </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LYNE DA SYLVA 
premiers rangs du grand corpus anglais &#233;taient exempts de VSB, contrairement aux deux corpus 
scientifiques, ce qui en a fait un outil plus efficace de rep&#233;rage de mots due VSB anglais. Les 
performances sur le corpus fran&#231;ais sont meilleures que sur le scientifique anglais, sans doute d&#251; &#224; 
l&#146;&#8217;ambigu&#239;t&#233; plus grande des mots anglais. 
</p>
<p>4703 study 
4362 result 
3776 effect 
3004 analysis 
2754 level 
2722 datum 
2659 rate 
2082 concentration 
2068 time 
2059 structure 
2047 group 
2032 change 
2008 system 
1959 condition 
1956 increase 
1874 type 
1742 value 
1719 temperature 
1664 area 
1648 region 
1645 response 
1633 method 
1633 number 
1578 difference 
1456 control 
</p>
<p>1455 activity 
1407 factor 
1391 size 
1275 pattern 
1246 potential 
1245 distribution 
1234 range 
1225 variation 
1185 process 
1180 relationship 
1119 treatment 
1110 mean 
1101 use 
1079 density 
1076 mass 
1056 length 
1053 presence 
1052 function 
1036 addition 
1025 period 
1021 ratio 
1009 experiment 
957 field 
911 interaction 
872 sequence 
</p>
<p>855 production 
847 content 
840 characteristic 
818 component 
801 evidence 
794 form 
775 parameter 
762 technique 
759 behavior 
740 influence 
735 estimate 
732 role 
709 approach 
709 formation 
691 frequency 
688 decrease 
688 reduction 
679 correlation 
675 variable 
670 source 
664 part 
655 comparison 
652 average 
633 stage 
610 contrast 
</p>
<p>Figure 4. 75 premiers mots du VSB extrait &#150;&#8211; corpus scientifique anglais 
</p>
<p>Pourcentage de vrai VSB parmi les non-ambigus
</p>
<p>60
65
70
75
80
85
90
95
</p>
<p>100
105
</p>
<p>1 51 101 151 201 251 301 351 401 451 501 551 601 651 701 751 801 851 901 951
</p>
<p>Rang
</p>
<p>%
</p>
<p>Corpus scientif ique anglais
Corpus scientique f ran&#231;ais
Grand corpus anglais
</p>
<p> 
</p>
<p>Figure 5. Pourcentage de vrai VSB par rang des noms extraits &#150;&#8211; comparaison des trois corpus 
</p>
<p>Avec le grand corpus anglais initial, 636 mots appartenant au VSB avaient &#233;t&#233; extraits (sur 1000 
examin&#233;s). Avec le corpus scientifique anglais, 550 mots ont &#233;t&#233; extraits de la sorte (sur 1176 examin&#233;s); 
pour le corpus scientifique fran&#231;ais, 682 (sur 1637 examin&#233;s). Sur ces deux derniers plus petits corpus, le 
VSB extrait est moindre en proportion. Le travail d&#146;&#8217;&#233;limination de candidats non retenus a &#233;t&#233; plus 
grand, m&#234;me pour l&#146;&#8217;anglais. En partie, les candidats examin&#233;s puis &#233;limin&#233;s repr&#233;sentaient souvent des 
termes plus typiques des corpus scientifiques que des textes savants en g&#233;n&#233;ral. 
</p>
<p>Il est int&#233;ressant de noter que dans tous les cas, on trouve parmi les hautes fr&#233;quences surtout des termes 
g&#233;n&#233;raux; les termes th&#233;matiques ou disciplinaires sont beaucoup moins pr&#233;sents, ce qui est encore plus 
vrai dans le cas du grand corpus initial de l&#146;&#8217;anglais. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION SEMI-AUTOMATIQUE D&#146;&#8217;UN VSB POUR L&#146;&#8217;INDEXATION AUTOMATIQUE 
</p>
<p>6. Discussion 
</p>
<p>On voit par l&#146;&#8217;analogie avec les r&#233;sultats pour l&#146;&#8217;anglais que la liste obtenue pour le fran&#231;ais est incom-
pl&#232;te et biais&#233;e par la nature scientifique et technique du corpus. Cependant, elle nous est quand m&#234;me 
tr&#232;s utile, car elle constitue un excellent point de d&#233;part pour combler la liste manuelle &#233;tablie jusqu&#146;&#8217;&#224; 
pr&#233;sent. La liste extraite automatiquement contient en effet des mots absents de la premi&#232;re liste et en 
sugg&#232;re d&#146;&#8217;autres, par analogie, d&#233;rivation, synonymes ou antonymes. Plus de la moiti&#233; des mots extraits 
appartiennent au VSB. Pour utiliser cette nouvelle liste, un travail de d&#233;sambigu&#239;sation sera n&#233;cessaire : 
les mots ainsi identifi&#233;s ont souvent plusieurs sens. Cela a d&#146;&#8217;ailleurs compliqu&#233; la t&#226;che de d&#233;terminer si 
ces mots devaient ou non &#234;tre conserv&#233;s dans le VSB. Notre exp&#233;rimentation pourrait b&#233;n&#233;ficier de la 
comparaison avec un corpus de langue g&#233;n&#233;rale (par exemple, journalistique). Nous sommes sceptique, 
cependant, quant &#224; la distribution respective de mots tels que &#171; application &#187; et &#171; d&#233;but &#187; dans chacun 
des corpus : elle risque de n&#146;&#8217;&#234;tre pas tr&#232;s diff&#233;rente dans les deux. Mais l&#146;&#8217;hypoth&#232;se reste &#224; v&#233;rifier. Il est 
possible par ailleurs que l&#146;&#8217;approche par comparaison de corpus puisse &#234;tre utilis&#233;e &#171; &#224; l&#146;&#8217;inverse &#187; : les 
mots qui sont exclus d&#146;&#8217;un corpus parce que n&#146;&#8217;appartenant pas au domaine pourraient &#234;tre de bons 
candidats au statut de VSB. Diverses m&#233;thodes de calcul sont utilis&#233;es dans les recherches sur 
l&#146;&#8217;extraction de ressources lexicales. Pour le calcul de sp&#233;cificit&#233; d&#146;&#8217;un mot par rapport &#224; un corpus, une 
mesure comme le tf&#149;&#8226;idf peut &#234;tre utilis&#233;e. Notre exp&#233;rience n&#146;&#8217;a eu recours qu&#146;&#8217;&#224; de simples fr&#233;quences et 
calculs de distribution, et pourrait &#234;tre am&#233;lior&#233;e en consid&#233;rant d&#146;&#8217;autres m&#233;triques.  
</p>
<p>Nous reconnaissons que la d&#233;termination de quels mots appartiennent au VSB constitue un travail 
subjectif, sans m&#233;trique objective de r&#233;f&#233;rence. Nous pr&#233;tendons que cette classe de vocabulaire se 
d&#233;finit en grande partie par son utilit&#233; dans l&#146;&#8217;indexation (&#224; titre de vedette secondaire utile). Le r&#233;el 
travail d&#146;&#8217;&#233;valuation de la justesse de ce VSB construit ne pourra se faire qu&#146;&#8217;en situation r&#233;elle, c&#146;&#8217;est-&#224;-
dire &#224; l&#146;&#8217;int&#233;rieur d&#146;&#8217;un index. Da Sylva (2009) pr&#233;sente les situations d&#146;&#8217;utilisation des termes du VSB 
pour l&#146;&#8217;indexation. Il reste maintenant &#224; construire un sc&#233;nario d&#146;&#8217;&#233;valuation qui permette de juger de la 
pertinence de distinguer les mots du VSB des mots du lexique technique et sp&#233;cialis&#233; d&#146;&#8217;un document. 
C&#146;&#8217;est la prochaine &#233;tape de notre programme de recherche. 
</p>
<p>7. Conclusion 
</p>
<p>Nous avons pr&#233;sent&#233; les motivations derri&#232;re la cr&#233;ation d&#146;&#8217;une ressource lexicale nouvelle ainsi qu&#146;&#8217;une 
exp&#233;rimentation visant &#224; la constitution semi-automatique de celle-ci. Force est de constater que l&#146;&#8217;apport 
de la pr&#233;sente exp&#233;rimentation a &#233;t&#233; essentiellement d&#146;&#8217;acc&#233;l&#233;rer le processus de constitution de la liste 
du vocabulaire savant de base, et non pas de l&#146;&#8217;automatiser enti&#232;rement. L&#146;&#8217;exp&#233;rimentation a &#233;t&#233; un 
processus utile de d&#233;couverte des &#233;l&#233;ments de vocabulaire utiles &#224; l&#146;&#8217;indexation. Elle nous a permis 
&#233;galement d&#146;&#8217;&#233;valuer partiellement une liste obtenue pour l&#146;&#8217;anglais dans une exp&#233;rimentation pr&#233;alable. 
</p>
<p>Bibliographie 
</p>
<p>AUTEUR  BONIN P., M&#201;OT A., AUBERT L., MALARDIER N., NIEDENTHAL P., CAPELLE-TOCZEK M.-C. 
(2003). Normes de concr&#233;tude, de valeur d&#146;&#8217;imagerie, de fr&#233;quence subjective et de valence 
&#233;motionnelle pour 866 mots. L'ann&#233;e psychologique, 103(103-4), 655-694. 
</p>
<p>COXHEAD A. (2000). A New Academic Word List. TESOL Quarterly, 34(2), 213-238.  
</p>
<p>DAILLE B. (1996). &#147;&#8220;Study and Implementation of Combined Techniques for Automatic Extraction of 
Terminology&#148;&#8221;. In Klavans J., Resnik P. (&#233;ds): The Balancing Act: Combining Symbolic and 
Statistical Approaches to Language, 49&#150;&#8211;66. The MIT Press, Cambridge, Massachusetts.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LYNE DA SYLVA 
DA SYLVA L. (2010). Corpus-based derivation of a &quot;basic scientific vocabulary&quot; for indexing purposes. 
</p>
<p>In Proceedings of the Corpus Linguistics Conference, Univ. Liverpool, 21-23 juillet 2009. 
</p>
<p>DA SYLVA L. (2009). &#147;&#8220;Classes de vocabulaire et indexation automatique : le cas des index de livres&#148;&#8221;. In 
Premier Workshop international sur la Terminologie et la s&#233;mantique lexicale (TLS&#146;&#8217;09), Universit&#233; 
de Montr&#233;al, Montr&#233;al, 19-06-2009, 67-76. http://olst.ling.umontreal.ca/pdf/ProceedingsTLS09.pdf. 
</p>
<p>DROUIN P. (2007). Identification automatique du lexique scientifique transdisciplinaire. Revue fran&#231;aise 
de linguistique appliqu&#233;e, 12(2), 45-64. 
</p>
<p>FLAUX N., VAN DE VELDE D. (2000). Les noms en fran&#231;ais : esquisse de classement. Gap (France); 
Paris : Ophrys. 
</p>
<p>JACQUEMIN C., BOURIGAULT D. (2003). &#147;&#8220;Term Extraction and Automatic Indexing&#148;&#8221;. In The Oxford 
Handbook of Computational Linguistics, Oxford University Press. 
</p>
<p>JOHNS A.M., DUDLEY-EVANS T. (1991). English for Specific Purposes: International in Scope, Specific 
in Purpose. TESOL Quarterly, 25(2), 297-314. 
</p>
<p>JONES S., PAYNTER G.W. (2003). An Evaluation of Document Keyphrase Sets. Journal of Digital 
Information, 4(1). http://journals.tdl.org/jodi/article/view/93/92. 
</p>
<p>NADEAU D., BARRI&#200;RE C., FOSTER G. (2005) Bike: Bilingual Keyphrase Experiments. In RANLP 
Workshop on Modern Approaches in Translation Technologies, Borovets, Bulgaria. 
</p>
<p>OGDEN CK. (1930). Basic English: A General Introduction with Rules and Grammar. London: Paul 
Treber &amp; Co., Ltd. 
</p>
<p>PHAL A. (1971). Vocabulaire g&#233;n&#233;ral d&#146;&#8217;orientation scientifique (V.G.O.S.) &#150;&#8211; Part du lexique commun 
dans l&#146;&#8217;expression scientifique. Paris: Didier. 
</p>
<p>SWALES J. (1971). Writing scientific English. New York: Nelson. 
</p>
<p>VERGNE J. (2005). Une m&#233;thode ind&#233;pendante des langues pour indexer les documents de l&#146;&#8217;internet par 
extraction de termes de structure contr&#244;l&#233;e. In Actes de la Conf&#233;rence Internationale sur le 
Document &#201;lectronique (CIDE 8), Beyrouth, Liban.  
</p>
<p>WACHOLDER N., SONG P. (2003). Toward a task-based gold standard for evaluation of np chunks and 
technical terms. In Proceedings of HLT-NAACL 2003, Edmonton, Canada, 189-196. 
</p>
<p>WALLER S. (1999). L&#146;&#8217;analyse documentaire : une approche m&#233;thodologique. Paris: ADBS. </p>

</div></div>
</body></html>