<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une &#233;valuation de l&#8217;impact des types de textes sur la t&#226;che de segmentation th&#233;matique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Une &#233;valuation de l&#8217;impact des types de textes sur la t&#226;che de
segmentation th&#233;matique
</p>
<p>Cl&#233;mentine Adam 1 Philippe Muller 2 C&#233;cile Fabre 1
</p>
<p>(1) CLLE / Universit&#233; de Toulouse
(2) IRIT / Universit&#233; de Toulouse &amp; Alpage / INRIA
</p>
<p>adam@univ-tlse2.fr, muller@irit.fr, cfabre@univ-tlse2.fr
</p>
<p>R&#233;sum&#233;. Cette &#233;tude a pour but de contribuer &#224; la d&#233;finition des objectifs de la segmentation th&#233;ma-
tique (ST), en incitant &#224; prendre en consid&#233;ration le param&#232;tre du type de textes dans cette t&#226;che. Notre
hypoth&#232;se est que, si la ST est certes pertinente pour traiter certains textes dont l&#8217;organisation est bien
th&#233;matique, elle n&#8217;est pas adapt&#233;e &#224; la prise en compte d&#8217;autres modes d&#8217;organisation (temporelle, rh&#233;to-
rique), et ne peut pas &#234;tre appliqu&#233;e sans pr&#233;caution &#224; des textes tout-venants. En comparant les perfor-
mances d&#8217;un syst&#232;me de ST sur deux corpus, &#224; organisation th&#233;matique &quot;forte&quot; et &quot;faible&quot;, nous montrons
que cette t&#226;che est effectivement sensible &#224; la nature des textes.
</p>
<p>Abstract. This paper aims to contribute to a better definition of the requirements of the text seg-
mentation task, by stressing the need for taking into account the types of texts that can be appropriately
considered. Our hypothesis is that while TS is indeed relevant to analyse texts with a thematic organi-
sation, this task is ill-fitted to deal with other modes of text organisation (temporal, rhetorical, etc.). By
comparing the performance of a TS system on two corpora, with either a &quot;strong&quot; or a &quot;weak&quot; thematic
organisation, we show that TS is sensitive to text types.
</p>
<p>Mots-cl&#233;s : Segmentation th&#233;matique, organisation textuelle, coh&#233;sion lexicale, voisins distribu-
tionnels.
</p>
<p>Keywords: Text segmentation, textual organisation, lexical cohesion, distributional neighbours.
</p>
<p>1 Introduction
</p>
<p>La t&#226;che de segmentation th&#233;matique (ST), qui consiste &#224; d&#233;limiter des segments textuels de contenu ho-
mog&#232;ne sur la base d&#8217;indices de rupture lexicale, a fait la preuve de sa faisabilit&#233; et de son apport dans
diff&#233;rentes t&#226;ches de TAL (Hearst, 1997; Chen et al., 2009). M&#234;me si certains travaux ont cherch&#233; &#224; prendre
en compte des indices de rupture (cue-phrases) de diff&#233;rentes natures &#8211; par exemple (Litman &amp; Passon-
neau, 1995) &#8211;, cette t&#226;che repose g&#233;n&#233;ralement sur l&#8217;hypoth&#232;se que les textes s&#8217;organisent principalement
selon un plan th&#233;matique, chaque th&#232;me se singularisant par le recours &#224; un vocabulaire suffisamment sp&#233;-
cifique pour le distinguer des autres. Cette hypoth&#232;se est pourtant loin de faire consensus dans les travaux
men&#233;s sur le discours, qui montrent au contraire que l&#8217;organisation th&#233;matique n&#8217;est qu&#8217;un mode d&#8217;orga-
nisation des textes parmi d&#8217;autres (P&#233;ry-Woodley &amp; Scott, 2006). Elle n&#8217;est pas pertinente pour tous les
types de textes, et elle n&#8217;est pas exclusive, pour un m&#234;me texte, d&#8217;autres types d&#8217;organisation alternatifs.
En particulier, de nombreux travaux ont &#233;tudi&#233; les textes sous l&#8217;angle de leur organisation rh&#233;torique, qui</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CL&#201;MENTINE ADAM, PHILIPPE MULLER, C&#201;CILE FABRE
</p>
<p>s&#8217;articule autour de segments identifi&#233;s comme des unit&#233;s fonctionnelles d&#233;termin&#233;es par des buts argu-
mentatifs sp&#233;cifiques, &#8216;argumentative moves&#8217; (Swales, 1990), &#8216;argumentative zoning&#8217; (Teufel, 1999). Ces
&#233;tudes ont montr&#233; que diff&#233;rents segments sont caract&#233;risables par des faisceaux de traits linguistiques de
nature essentiellement grammaticale, et ne consid&#232;rent pas forc&#233;ment la r&#233;partition du vocabulaire comme
un crit&#232;re discriminant (Biber et al., 2007). De fait, il ne va pas du tout de soi que l&#8217;on puisse aborder par
les m&#234;mes m&#233;thodes de segmentation des textes organis&#233;s th&#233;matiquement, rh&#233;toriquement, temporelle-
ment, voire par une combinaison de ces modes, et que les indices lexicaux soient toujours discriminants
pour placer des ruptures entre segments textuels. Les tableaux 1 et 2 donnent des exemples de textes tir&#233;s
de Wikip&#233;dia de mani&#232;re &#224; illustrer cette diversit&#233; des modes d&#8217;organisation. La liste des titres de section
de premier niveau donne un bon aper&#231;u de la fa&#231;on dont le texte s&#8217;organise. Le tableau 1 montre des textes
dont l&#8217;organisation th&#233;matique est manifeste.
</p>
<p>Le Malawi Le panda g&#233;ant
- Histoire - Historique
- Politique - L&#233;gende
- G&#233;ographie - Alimentation
- &#201;conomie - Reproduction
- D&#233;mographie - Protection
- Culture
</p>
<p>TABLE 1 &#8211; Exemples d&#8217;organisation textuelle th&#233;matique
</p>
<p>Le tableau 2 montre d&#8217;abord un exemple d&#8217;organisation temporelle, typique des biographies, qui se cl&#244;t par
une partie bilan. Les deux autres textes (leadership et mythe) illustrent un mode de progression rh&#233;torique
(sur le principe des &#8217;moves&#8217; de Swales) qui permet dans ces deux cas d&#8217;organiser la pr&#233;sentation d&#8217;une
notion selon un sch&#233;ma argumentatif similaire : d&#8217;abord d&#233;finir la notion, puis pr&#233;senter une typologie,
enfin d&#233;tailler certaines de ses instances.
</p>
<p>Laurent Truguet Leadership Mythe
- Jeunesse jusqu&#8217;&#224; la R&#233;v. - Terminologie - D&#233;finition
- sous la R&#233;volution - Types de leadership - Aspects du mythe
- L&#8217;Empire - Caract&#233;ristiques du leadership - Typologie et &#233;l&#233;ments du mythe
- sous la Monarchie - Le leadership de droit et de fait - Post&#233;rit&#233; du mythe
- Le bilan - Le paradigme des leaderships multiples
</p>
<p>TABLE 2 &#8211; Exemples d&#8217;organisation textuelle non th&#233;matique
</p>
<p>L&#8217;impact des types de textes sur la proc&#233;dure de ST a rarement &#233;t&#233; pris en consid&#233;ration par les travaux qui
mettent en oeuvre cette t&#226;che &#8211; exception faite de (Ferret et al., 1998) &#8211;, au point que, comme le d&#233;plorent
(Bestgen &amp; Pi&#233;rard, 2006), les m&#234;mes algorithmes sont parfois appliqu&#233;s &#224; une t&#226;che de segmentation de
texte et de d&#233;limitation de textes concat&#233;n&#233;s. Les exp&#233;riences de ST sont g&#233;n&#233;ralement men&#233;es sur des
types de textes qui se pr&#234;tent intuitivement &#224; cette approche &#8211; par exemple les articles encyclop&#233;diques sur
les villes chez (Chen et al., 2009) ou (Adam &amp; Morlane-Hond&#232;re, 2009) &#8211;, sans qu&#8217;on cherche &#224; &#233;tablir
explicitement la nature des textes qui sont adapt&#233;s &#224; la t&#226;che.
</p>
<p>Notre objectif est d&#8217;int&#233;grer le param&#232;tre du type de textes dans la t&#226;che de segmentation en comparant
les performances d&#8217;un syst&#232;me de ST sur deux groupes de textes, d&#233;termin&#233;s selon leur propension &#224;
s&#8217;organiser plut&#244;t th&#233;matiquement ou &#224; ob&#233;ir &#224; d&#8217;autres principes de pr&#233;sentation - rh&#233;torique, temporelle.
Nous montrons dans cet article que la t&#226;che de ST est effectivement sensible &#224; la nature des textes, en</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IMPACT DES TYPES DE TEXTES SUR LA T&#194;CHE DE SEGMENTATION TH&#201;MATIQUE
</p>
<p>montrant que m&#234;me une approche relativement na&#239;ve de la notion de type de texte permet de faire &#233;merger
des diff&#233;rences significatives de performances. Apr&#232;s avoir bross&#233; un panorama des m&#233;thodes actuelles en
ST (section 2), nous d&#233;crivons le syst&#232;me de ST que nous avons mis en oeuvre pour cette &#233;tude (section
3) ; nous pr&#233;sentons ensuite l&#8217;exp&#233;rimentation qui vise &#224; comparer ses performances selon les deux types
de textes (section 4), et discutons les r&#233;sultats obtenus (section 5).
</p>
<p>2 La segmentation th&#233;matique : un panorama des m&#233;thodes
</p>
<p>La segmentation th&#233;matique a pour but le d&#233;coupage lin&#233;aire d&#8217;un texte en unit&#233;s pr&#233;sentant une coh&#233;rence
autour d&#8217;un sujet. La grande majorit&#233; des approches de ST se fondent sur la m&#233;thode initi&#233;e par (Hearst,
1997) : le texte est divis&#233; en blocs contigus correspondant &#224; une unit&#233; fix&#233;e &#224; l&#8217;avance (un nombre n de
mots, de phrases ou de paragraphes), puis on d&#233;finit une fen&#234;tre glissante qui parcourt le texte lin&#233;airement
et permet de calculer un score de similarit&#233; &#224; chaque intersection entre blocs dans le texte. Une m&#233;thode de
segmentation s&#8217;attache alors &#224; trouver les points o&#249; la similarit&#233; pr&#233;sente des &#233;volutions fortes, interpr&#233;t&#233;es
comme des indications de rupture de la continuit&#233; th&#233;matique. Une alternative &#224; cette approche par pavage
(tiling) est de supposer des th&#232;mes sous-jacents qu&#8217;il s&#8217;agit de d&#233;tecter : chaque unit&#233; du texte consid&#233;r&#233;
est rapport&#233;e &#224; un ou plusieurs th&#232;mes, et la segmentation consiste &#224; trouver ces th&#232;mes (Chen et al., 2009;
Ferret, 2007). Les th&#232;mes peuvent &#234;tre pr&#233;dits par des &#171; topic models &#187; (Chen et al., 2009), une forme
d&#8217;Allocation de Dirichlet Latente (ADL), qui sont associ&#233;s &#224; des distributions lexicales diff&#233;rentes, ou
bien par des associations lexicales calcul&#233;es &#224; partir des textes, par exemple par un clustering en amont
(Ferret, 2007). Une fois les th&#232;mes identifi&#233;s pour chaque unit&#233; de texte, les segments correspondent aux
blocs d&#8217;unit&#233;s contigu&#235;s partageant le m&#234;me th&#232;me.
</p>
<p>Dans les approches par pavage, la mesure de similarit&#233; entre blocs la plus simple est bas&#233;e sur le nombre de
r&#233;p&#233;titions lexicales (souvent uniquement les noms), rapport&#233; au nombre des unit&#233;s pr&#233;sentes.Les variantes
consistent alors &#224; jouer sur le lissage de l&#8217;&#233;volution de la similarit&#233; en prenant en compte des contextes
diff&#233;rents (plus de blocs voisins, et plus d&#8217;interactions entre eux) ou sur la normalisation des liens de
coh&#233;sion lexicale, avec des mesures de tf.idf locales par exemple (Malioutov &amp; Barzilay, 2006). Mais la
similarit&#233; peut &#233;galement d&#233;river d&#8217;autres sources : collocations (Ferret, 2002), similarit&#233; dans un espace
lexical de dimension r&#233;duite par exemple par analyse s&#233;mantique latente (Choi et al., 2001; Bestgen &amp;
Pi&#233;rard, 2006) &#8211; proche de l&#8217;ADL mentionn&#233;e ci-dessus &#8211;, ou bien similarit&#233; de distribution des unit&#233;s
lexicales (Adam &amp; Morlane-Hond&#232;re, 2009), toutes m&#233;thodes qui sont cens&#233;es apporter une forme de
lissage pour pr&#233;venir d&#8217;&#233;ventuels foss&#233;s dans les r&#233;p&#233;titions de forme, dans la mesure o&#249; elles font &#233;merger
une large gamme de liens de proximit&#233; s&#233;mantique.
</p>
<p>Dans le syst&#232;me que nous avons d&#233;velopp&#233; et que nous d&#233;crivons dans la section suivante, nous comparons
deux types de similarit&#233;, en utilisant d&#8217;une part les r&#233;p&#233;titions simples et d&#8217;autre part une mesure de
similarit&#233; distributionnelle. Nous aurions pu faire appel &#224; d&#8217;autres approches utilisant des similarit&#233;s plus
riches, mais pour notre propos (la comparaison des performances d&#8217;un syst&#232;me de ST en fonction des
types de textes), il est suffisant que notre syst&#232;me ait des performances comparables &#224; celles de l&#8217;&#233;tat de
l&#8217;art. Par ailleurs les approches g&#233;n&#233;ratives (topics models) ont l&#8217;inconv&#233;nient de devoir &#234;tre entra&#238;n&#233;es sur
des textes repr&#233;sentatifs des th&#232;mes &#224; retrouver, ce qui rend la technique un peu circulaire dans le cadre de
ce que nous cherchons &#224; &#233;tudier 1.
</p>
<p>1. Nous pourrons de toute fa&#231;on &#233;tendre la port&#233;e de la comparaison dans une &#233;tude plus large, notamment en transposant
l&#8217;approche de Ferret au r&#233;seau lexical induit par la similarit&#233; distributionnelle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CL&#201;MENTINE ADAM, PHILIPPE MULLER, C&#201;CILE FABRE
</p>
<p>3 Description du syst&#232;me de segmentation th&#233;matiquemis en oeuvre
</p>
<p>Notre syst&#232;me de ST, d&#233;velopp&#233; dans le cadre du projet VOILADIS 2, utilise une approche lin&#233;aire, &#224; la
mani&#232;re de (Hearst, 1997), et fait appel pour le calcul des scores de similarit&#233; lexicale &#224; une base de
voisins distributionnels. La base de voisins distributionnels utilis&#233;e a &#233;t&#233; g&#233;n&#233;r&#233;e &#224; partir d&#8217;un corpus
constitu&#233; de l&#8217;ensemble des articles de la version francophone de Wikip&#233;dia, soit plus de 470000 articles
pour 194 millions de mots. Le programme d&#8217;analyse distributionnelle est lanc&#233; en aval des sorties de
l&#8217;analyse SYNTEX (Bourigault, 2007). Les triplets syntaxiques &lt;gouverneur, relation, d&#233;pendant&gt; (ex :
&lt;d&#233;part,POUR,destination&gt;) fournissent les donn&#233;es permettant de rapprocher les paires de voisins en
utilisant la mesure de Lin.
</p>
<p>Nous donnons ci-dessous le d&#233;tail de notre cha&#238;ne de traitement :
&#8211; Les liens de voisinage, &#233;ventuellement pond&#233;r&#233;s par leur score de Lin, sont projet&#233;s sur les textes ; les
</p>
<p>r&#233;p&#233;titions sont &#233;galement prises en compte, et dot&#233;es d&#8217;un score de 1. Quelques param&#232;tres de filtrage
des voisins sont test&#233;s : seuils sur le nombre de voisins que peut avoir un mot, et sur l&#8217;&#233;cart quadratique
moyen de ces voisins &#224; la position du mot (ainsi, les mots ayant peu de voisins ou des voisins proches
de leur position dans le texte seront favoris&#233;s)
</p>
<p>&#8211; Le texte est parcouru par une fen&#234;tre glissante, afin de calculer localement des scores de coh&#233;sion.
L&#8217;unit&#233; de segmentation, ainsi que la taille de la fen&#234;tre en nombre d&#8217;unit&#233;s, sont param&#233;trables. Les
unit&#233;s de segmentation possibles sont : (i) la phrase ; (ii) le bloc de mots de taille fixe. Par exemple, si
l&#8217;unit&#233; choisie est la phrase, et que la taille de la fen&#234;tre est fix&#233;e &#224; 6, on calculera &#224; la fin de chaque
phrase un score bas&#233; sur le nombre de liens entretenus par le groupe de trois phrases qui pr&#233;c&#232;de, et le
groupe de trois phrases qui suit (fig. 1) ; ce nombre est normalis&#233; par le nombre de liens possibles (le
produit des noms, verbes et adjectifs situ&#233;s &#224; gauche et &#224; droite de la fen&#234;tre).
</p>
<p>FIGURE 1 &#8211; Repr&#233;sentation de la fen&#234;tre glissante avec -fen=3 et -unit=phrase
</p>
<p>&#8211; La courbe des scores obtenue est liss&#233;e ; nous avons opt&#233; pour un lissage gaussien 3, avec deux para-
m&#232;tres ajustables : le nombre d&#8217;it&#233;rations et le degr&#233; du lissage. La figure 2 pr&#233;sente les courbes brute
et liss&#233;e pour l&#8217;article Wikip&#233;dia Bulgarie. Les barres verticales indiquent la segmentation de r&#233;f&#233;rence
(c&#8217;est-&#224;-dire les positions des titres de section).
</p>
<p>&#8211; Les vall&#233;es (creux de la courbe) dont la profondeur d&#233;passe un &#233;cart-type &#224; la moyenne des profondeurs
sont consid&#233;r&#233;es comme correspondant aux ruptures du texte. Ces ruptures, qui, selon l&#8217;unit&#233; choisie,
se trouvent dans le meilleur des cas &#224; la fronti&#232;re d&#8217;une phrase, mais peuvent &#233;galement intervenir en
plein milieu d&#8217;une phrase, sont ramen&#233;es &#224; la fronti&#232;re de paragraphe la plus proche, ce qui produit le
texte segment&#233; final.
</p>
<p>On constate que de nombreux param&#232;tres sont ajustables dans notre syst&#232;me ; nous les r&#233;capitulons dans
le tableau 3. C&#8217;est pourquoi dans la phase exp&#233;rimentale de notre &#233;tude, qui fait l&#8217;objet de la prochaine
section, nous recourons &#224; un corpus de d&#233;veloppement pour optimiser ces param&#232;tres.
</p>
<p>2. Projet financ&#233; par le PRES de Toulouse
3. En fait une estimation par noyau, le noyau &#233;tant gaussien ; il correspond ici &#224; une moyenne sur le voisinage de chaque</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IMPACT DES TYPES DE TEXTES SUR LA T&#194;CHE DE SEGMENTATION TH&#201;MATIQUE
</p>
<p>FIGURE 2 &#8211; Exemple de courbe avec lissage
</p>
<p>Param&#232;tre Description Valeurs
-unit unit&#233; de segmentation phrase / bloc
-bloc taille du bloc &lt;nb mots&gt;
-fen taille de la demi-fen&#234;tre glissante &lt;nb blocs&gt;
-it nb d&#8217;it&#233;rations du lissage &lt;nb&gt;
</p>
<p>-deg degr&#233; du lissage &lt;nb&gt;
-lin pond&#233;ration des liens par score de Lin oui / non
</p>
<p>-filtNb seuil sur le nb max de voisins diff&#233;rents par item non ou &lt;nb voisins&gt;
-filtPos seuil sur l&#8217;&#233;cart moyen des voisins &#224; la position de l&#8217;item non ou &lt;nb tokens&gt;
</p>
<p>TABLE 3 &#8211; Param&#232;tres de notre syst&#232;me de ST
</p>
<p>4 Proc&#233;dure et &#233;valuation
</p>
<p>L&#8217;hypoth&#232;se que nous souhaitons valider par cette exp&#233;rience est que le recours &#224; la ST se justifie pour
des textes dont la structuration est effectivement ressentie comme th&#233;matique, mais n&#8217;est pas motiv&#233; pour
aborder d&#8217;autres modes d&#8217;organisation textuelle. Ainsi, nous voulons inciter &#224; mieux d&#233;finir quel peut &#234;tre
l&#8217;objet de la t&#226;che de ST, et &#224; ne pas appliquer cette t&#226;che sans pr&#233;caution &#224; des textes tout-venant.
</p>
<p>Caract&#233;risation du corpus utilis&#233; Nous avons pour cette exp&#233;rience constitu&#233; deux sous-corpus &#224; par-
tir de la version d&#8217;avril 2007 de l&#8217;encyclop&#233;die en ligne Wikip&#233;dia (nous avons choisi de s&#233;lectionner des
textes qui appartiennent tous au corpus sur lequel la ressource lexicale a &#233;t&#233; construite). Les articles ont
&#233;t&#233; extraits de mani&#232;re automatique, sur la base de crit&#232;res de s&#233;lection fix&#233;s par nous. Les crit&#232;res de
s&#233;lection sont les suivants : pour &#234;tre retenu, un article doit avoir au minimum 1000 mots, au moins 4 titres
de sections (qui fournissent la segmentation de r&#233;f&#233;rence), et un maximum de 2 niveaux de profondeur de
titres (une profondeur trop importante aurait amen&#233; &#224; faire des choix d&#233;licats quant aux titres retenus pour
la segmentation de r&#233;f&#233;rence) ; il doit &#233;galement appartenir &#224; une liste de cat&#233;gories &#233;tablie. Nous avons
en effet pris le niveau des cat&#233;gories d&#233;finies dans l&#8217;encyclop&#233;die comme crit&#232;re de r&#233;partition des textes
dans les deux sous-corpus. Le sous-corpus &#224; organisation th&#233;matique forte (corpus THEM) rassemble des
textes consacr&#233;s &#224; la description de pays, de villes et d&#8217;animaux, dont on sait qu&#8217;ils se pr&#234;tent g&#233;n&#233;ralement
</p>
<p>point, pond&#233;r&#233;e selon la distance au point selon une gaussienne.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CL&#201;MENTINE ADAM, PHILIPPE MULLER, C&#201;CILE FABRE
</p>
<p>bien &#224; une organisation th&#233;matique. Le sous-corpus &#224; organisation th&#233;matique faible (corpus NON-THEM)
r&#233;unit des biographies, dont l&#8217;organisation est typiquement temporelle, et des textes pr&#233;sentant des notions
abstraites, des concepts, pour lesquels nous avons montr&#233; (tab. 2) que l&#8217;approche th&#233;matique est g&#233;n&#233;-
ralement mal adapt&#233;e. L&#8217;intervention humaine se concentre donc en amont de la constitution du corpus,
par la d&#233;finition des crit&#232;res de s&#233;lection et de r&#233;partition dans les sous-corpus. Aucun traitement n&#8217;est
effectu&#233; en aval (post-s&#233;lection, nettoyage, etc.). La caract&#233;risation des corpus obtenus est donn&#233;e dans le
tableau 4. Nous pr&#233;cisons pour chaque sous-corpus le nombre de paragraphes, qui correspond au nombre
de segments potentiels pour notre syst&#232;me de ST et le nombre de titres de premier niveau, c&#8217;est-&#224;-dire le
nombre de ruptures dans notre segmentation de r&#233;f&#233;rence.
</p>
<p>nb textes nb mots nb para. nb seg. (titre niv=1) nb seg/txt nb seg/para
corpus THEM 344 578346 10953 3051 8, 869 0, 279
corpus NON-THEM 210 387941 6454 1182 5, 629 0, 183
</p>
<p>TABLE 4 &#8211; Caract&#233;risation des corpus THEM et NON-THEM
</p>
<p>Corpus de d&#233;veloppement et optimisation des param&#232;tres La proc&#233;dure de segmentation d&#233;crite sec-
tion 3 d&#233;pend de nombreux param&#232;tres dont les cons&#233;quences ne sont pas toujours pr&#233;dictibles a priori.
Beaucoup d&#8217;auteurs fixent des param&#232;tres similaires selon des crit&#232;res empiriques pas toujours explicites.
Nous avons choisi d&#8217;isoler une partie du corpus de d&#233;part pour l&#8217;utiliser comme un corpus de d&#233;veloppe-
ment explicite, sur lequel nous avons fait varier un certain nombre de param&#232;tres afin d&#8217;ajuster la segmen-
tation. Pour cela, nous avons extrait au hasard un peu moins de 10% du corpus rassembl&#233; initialement,
en prenant autant (i.e. 21) de textes des sous-corpus THEM et NON-THEM (rappelons que le corpus initial
n&#8217;est pas tout &#224; fait &#233;quilibr&#233; ; nous avons &#233;quilibr&#233; celui de d&#233;veloppement pour ne pas favoriser la classe
majoritaire). Les variations faites sur les 8 param&#232;tres sujet de l&#8217;optimisation ont g&#233;n&#233;r&#233; plus de 2000
configurations.Nous avons conserv&#233; la configuration ayant obtenu les meilleurs r&#233;sultats selon l&#8217;indice
classique WindowDiff (not&#233; WD) de comparaison de segmentation ; elle est donn&#233;e dans le tableau 5.
</p>
<p>-unit -bloc -fen -it -deg -lin -filtNb -filtPos
bloc 10 mots 10 blocs 2 3 non 10 voisins max. 500 tokens
</p>
<p>TABLE 5 &#8211; Configuration de param&#232;tres retenue
</p>
<p>&#201;valuation Pour &#233;valuer les r&#233;sultats de la segmentation, nous prenons comme r&#233;f&#233;rence les positions
des titres de premier niveau au sein des articles ; pour comparer les r&#233;sultats du syst&#232;me de ST &#224; cette
r&#233;f&#233;rence, nous appliquons les mesures classiques pour cette t&#226;che : les indices Pk et WindowDiff. Ces
mesures sont moins strictes sur les positions des bornes de segments que la pr&#233;cision et le rappel, qui ne
permettent pas de juger de la proximit&#233; d&#8217;une pr&#233;diction avec la borne r&#233;elle. Les deux mesures Pk et
WD &#171; adoucissent &#187; l&#8217;&#233;valuation en estimant le nombre moyen de bornes correctes dans une fen&#234;tre de
taille donn&#233;e projet&#233;e sur le texte. Nous avons ajout&#233; une mesure propos&#233;e par (Bestgen, 2009), appel&#233;e
par lui &#171; distance de Hamming g&#233;n&#233;ralis&#233; &#187; et qui est en fait une distance d&#8217;&#233;dition avec des coefficients
particuliers pour les co&#251;ts d&#8217;insertion/d&#8217;effacement/de d&#233;placement, rapport&#233;e au nombre de points de
coupure possibles. Elle est not&#233;e &#8220;edit&#8221; dans nos tables de r&#233;sultats. La distance d&#8217;&#233;dition est cens&#233;e
corriger certains biais de WD, elle-m&#234;me cens&#233;e corriger certains biais de Pk ; nous ne rentrons pas dans
les d&#233;tails ici, les mesures &#233;tant relativement coh&#233;rentes entre elles sur nos r&#233;sultats 4. Ces mesures &#233;tant
</p>
<p>4. On peut se r&#233;f&#233;rer &#224; (Georgescul et al., 2006) pour une discussion de la pertinence des proc&#233;dures d&#8217;&#233;valuation de la ST.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IMPACT DES TYPES DE TEXTES SUR LA T&#194;CHE DE SEGMENTATION TH&#201;MATIQUE
</p>
<p>souvent difficiles &#224; interpr&#233;ter et &#224; comparer, la table 6 donne les r&#233;sultats pour la pire configuration, la
configuration moyenne et la meilleure configuration, que nous allons appliquer au reste de notre corpus. Il
faut noter que ces mesures sont des mesures de distance, la distance de la r&#233;f&#233;rence &#224; elle-m&#234;me est donc
0., et un score plus bas indique une plus grande proximit&#233; avec la r&#233;f&#233;rence.
</p>
<p>configuration pk wd edit nb seg/txt
r&#233;f&#233;rence 0,000 0,000 0,000 7,67
meilleure 0,294 0,299 1,611 5,27
moyenne 0,321 0,329 1,787 5,18
pire 0,352 0,369 1,983 6,47
</p>
<p>TABLE 6 &#8211; R&#233;sultats sur le corpus de d&#233;veloppement avec diff&#233;rentes configurations de param&#232;tres
</p>
<p>5 R&#233;sultats et analyse
</p>
<p>Nous avons appliqu&#233; notre syst&#232;me de ST, avec la configuration de param&#232;tres optimis&#233;e sur le corpus de
d&#233;veloppement, sur les deux sous-corpus THEM et NON-THEM. Les tables 7 et 8 synth&#233;tisent les r&#233;sultats.
Nous donnons deux r&#233;sultats pour notre syst&#232;me, selon les types de liens de coh&#233;sion lexicale pris en
compte : r&#233;p&#233;titions simples de lemmes, ou voisinage distributionnel. Nous avons en outre g&#233;n&#233;r&#233; deux
baselines simplifi&#233;es qui permettent de donner une id&#233;e des &#233;carts que l&#8217;on peut avoir sur les mesures
Pk et WD, qui ne sont pas n&#233;cessairement simples &#224; interpr&#233;ter. La premi&#232;re baseline (nomm&#233;e plus bas
&#171; hasard exact &#187;) place des ruptures au hasard, mais en nombre correspondant &#224; la r&#233;f&#233;rence. Elle permet de
contr&#244;ler la facilit&#233; de se rapprocher des vraies bornes par rapport au nombre moyen de segments rapport&#233;
&#224; la taille du texte. Une deuxi&#232;me baseline (&#171; hasard bruit&#233; &#187;) proche consiste &#224; perturber le nombre exact
de ruptures, en le faisant varier au hasard dans un intervalle de 30% du vrai nombre de ruptures.
</p>
<p>M&#233;thode Pk WD edit nb seg/txt
r&#233;f&#233;rence 0 0 0 7,89
baseline &quot;hasard bruit&#233;&quot; 0,3659 0,3738 1,6492 9,46
baseline &quot;hasard exact&quot; 0,3417 0,3452 1,5789 7,89
r&#233;p&#233;titions 0,3114 0,3144 1,5907 4,93
voisins 0,3091 0,3129 1,5837 5,09
</p>
<p>TABLE 7 &#8211; R&#233;sultats pour le sous-corpus THEM
</p>
<p>M&#233;thode Pk WD edit nb seg/txt
r&#233;f&#233;rence 0 0 0 8,07
baseline &quot;hasard bruit&#233;&quot; 0,3569 0,3616 1,8032 6,68
baseline &quot;hasard exact&quot; 0,3149 0,3181 1,5645 8,07
r&#233;p&#233;titions 0,3612 0,3662 1,8846 5,08
voisins 0,3613 0,3676 1,9291 5,16
</p>
<p>TABLE 8 &#8211; R&#233;sultats pour le sous-corpus NON-THEM
</p>
<p>Une autre indication de la repr&#233;sentativit&#233; des scores pourrait &#234;tre prise dans la litt&#233;rature, m&#234;me si la
vari&#233;t&#233; des approches, des entr&#233;es et des &#233;valuations (vrai textes ou concat&#233;nations artificielles) doit inciter
&#224; la prudence. Si l&#8217;on se r&#233;f&#232;re au tr&#232;s r&#233;cent (Chen et al., 2009), qui op&#232;re sur un corpus similaire &#224; une
partie du n&#244;tre (les articles de villes dans le Wikip&#233;dia anglais), l&#8217;&#233;tat de l&#8217;art pr&#233;c&#233;dent repr&#233;sent&#233; par</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CL&#201;MENTINE ADAM, PHILIPPE MULLER, C&#201;CILE FABRE
</p>
<p>(Eisenstein &amp; Barzilay, 2008) atteint un Pk de 0,317 et un WD de 0,376 sur ce corpus, avec la connaissance
du nombre de segments ; l&#8217;approche de (Chen et al., 2009) &#224; base de topic models enrichis de contraintes
globales atteint quant &#224; elle sur leur meilleure configuration les tr&#232;s bons scores de 0,28 pour le Pk et
de 0,25 pour le WD, sans connaissance du nombre de segments, mais en posant une borne sup&#233;rieure
sur le nombre de th&#232;mes pr&#233;sents dans tout le corpus (fix&#233;e &#224; 10 ou 20 th&#232;mes), ce qui limite un peu la
g&#233;n&#233;ralisation.
</p>
<p>Au vu de nos r&#233;sultats, on constate que l&#8217;hypoth&#232;se globale d&#8217;une diff&#233;rence entre les deux types de
textes THEM et NON-THEM se v&#233;rifie assez nettement, quelle que soit la m&#233;trique consid&#233;r&#233;e, et que
les algorithmes de segmentation choisis sont meilleurs sur les textes du sous-corpus THEM, m&#234;me si les
variances (non rapport&#233;es dans le tableau) sont importantes.
</p>
<p>Pour &#233;valuer les diff&#233;rences entre m&#233;thodes, (Chen et al., 2009) affirment que les tests de significativit&#233;
statistique sur cette t&#226;che ne sont pas standardis&#233;s, et ils n&#8217;en reportent pas. Ceux qui font de tels tests
utilisent un t-test sans pr&#233;ciser s&#8217;il est appari&#233; ou pas, (Choi et al., 2001; Galley et al., 2003; Ferret, 2007).
Nous avons pour notre part fait le test des rangs sign&#233;s de Wilcoxon entre les s&#233;ries de scores des baselines
et des m&#233;thodes par coh&#233;sion, appari&#233;es par texte, test qui ne suppose rien sur la distribution a priori
des scores, au contraire du t-test. Alors qu&#8217;on observe des valeurs de p&lt;0,01 pour la diff&#233;rence entre les
baselines et les algorithmes de segmentation sur l&#8217;exp&#233;rience THEM, la diff&#233;rence n&#8217;est pas significative
pour les textes du sous-corpus NON-THEM (et on constate que les variances sont plus fortes). La baseline
exacte dans le cas NON-THEM pr&#233;sente des r&#233;sultats &#233;tonnants, dont il faudrait v&#233;rifier s&#8217;ils ne sont pas
directement li&#233;s au nombre de pr&#233;dictions plus &#233;lev&#233; que fait cette m&#233;thode (il s&#8217;agirait alors d&#8217;un effet
secondaire ind&#233;sirable des mesures de comparaison de segmentation).
</p>
<p>Une hypoth&#232;se secondaire de ce travail &#233;tait que les liens induits par similarit&#233; distributionnelle &#233;taient
plus informatifs et devaient avoir un impact sur l&#8217;&#233;valuation globale. Concernant cet aspect, on ne peut
que constater la proximit&#233; des scores sur les deux sous-corpus (et le test de Wilcoxon n&#8217;indique pas de
diff&#233;rence significative).
</p>
<p>&#201;tant donn&#233;e la forte variance que nous avons observ&#233;e sur les r&#233;sultats, y compris sur le sous-corpus
THEM, nous avons &#233;valu&#233; les r&#233;sultats par cat&#233;gories Wikip&#233;dia &#224; l&#8217;int&#233;rieur des corpus THEM et NON-
THEM (ces r&#233;sultats sont r&#233;capitul&#233;s dans le tableau 9). On constate que les r&#233;sultats des deux sous-corpus
</p>
<p>th&#232;me Pk WD edit nb par./seg. nb par. nb textes
animaux 0,2794 0,2803 1,4076 0,1651 25,5724 145
pays 0,3443 0,3472 1,7695 0,1223 40,7353 136
concepts 0,3488 0,3510 1,8377 0,1632 30,4706 68
villes 0,3508 0,3541 1.7610 0,1348 31,1250 32
personnes 0,3738 0,3777 1.9062 0,1778 26,6132 106
autres NON-THEM 0,4041 0,4112 1,7337 0,1655 31,7333 15
</p>
<p>TABLE 9 &#8211; R&#233;sultats par sous-cat&#233;gories par Pk/WD croissant
</p>
<p>se reportent sur les cat&#233;gories qui les composent, &#224; l&#8217;exception de la cat&#233;gorie concepts qui obtient des
r&#233;sultats l&#233;g&#232;rement meilleurs que ceux de la cat&#233;gorie villes. Encore une fois les variances sont fortes.
Il s&#8217;av&#232;re que notre d&#233;coupage volontairement grossier a priori (dans un souci de ne pas trop biaiser
l&#8217;&#233;tude) pourrait s&#8217;affiner &#8211; &#224; condition de poser clairement les param&#232;tres de ce que nous avons appel&#233;
pour l&#8217;instant le caract&#232;re th&#233;matique fort ou faible des textes &#8211;, mais qu&#8217;il semble valide.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IMPACT DES TYPES DE TEXTES SUR LA T&#194;CHE DE SEGMENTATION TH&#201;MATIQUE
</p>
<p>6 Conclusion et perspectives
</p>
<p>Nous avons montr&#233; dans cette &#233;tude que les types de textes ont un impact important sur la ST, et qu&#8217;il s&#8217;agit
donc d&#8217;un param&#232;tre &#224; ne pas n&#233;gliger dans le cadre de cette t&#226;che. N&#233;anmoins, le bilan de l&#8217;exp&#233;rience
men&#233;e, s&#8217;il comporte la confirmation de l&#8217;hypoth&#232;se de d&#233;part, doit &#234;tre mitig&#233; par des r&#233;sultats effectifs
sur la t&#226;che. M&#234;me si les r&#233;sultats sont proches de ceux de l&#8217;&#233;tat de l&#8217;art sur le corpus THEM (surtout
si on tient compte du fait que le nombre de segments n&#8217;est jamais donn&#233;), ils montrent des variances
tr&#232;s fortes sur les textes, et n&#8217;ont pu confirmer le r&#244;le d&#8217;une similarit&#233; lexicale plus riche que la simple
r&#233;p&#233;tition de formes. Il ressort de l&#8217;observation du corpus que les donn&#233;es que nous avons recueillies
&#233;taient finalement assez h&#233;t&#233;rog&#232;nes, avec des sections de longueurs tr&#232;s diff&#233;rentes qui ont pos&#233; de gros
probl&#232;mes aux approches qui se basent sur un niveau de variation moyen. La diversit&#233; des niveaux de
finalisation des articles de Wikip&#233;dia explique en particulier la succession de paragraphes tr&#232;s d&#233;velopp&#233;s
et de paragraphes r&#233;duits &#224; une seule phrase.
</p>
<p>Concernant la segmentation de r&#233;f&#233;rence, la subdivision par sections n&#8217;est pas toujours le bon mode de
segmentation. On trouve beaucoup de sections h&#233;t&#233;rog&#232;nes sur le plan th&#233;matique parce que la r&#233;partition
th&#233;matique est faite au niveau des sous-sections (ex : une section &#171; Domaines influenc&#233;s par le positi-
visme &#187; se d&#233;cline en sous-sections : &#171; m&#233;decine &#187;, &#171; philosophie &#187;, &#171; enseignement &#187;, &#171; droit &#187;, etc.).
L&#8217;int&#233;r&#234;t de prendre la structuration en titres comme segmentation de r&#233;f&#233;rence &#233;tait de fournir facilement
des donn&#233;es annot&#233;es, et nous avions bien s&#251;r conscience du bruit que cela devait entra&#238;ner par rapport &#224;
la t&#226;che &#233;valu&#233;e. Cela nous a fourni une premi&#232;re analyse qui nous incite &#224; reprendre ces donn&#233;es pour
aller vers une &#233;valuation moins artificielle. Mais au-del&#224; d&#8217;un simple nettoyage qui court le risque d&#8217;&#234;tre
biais&#233; par l&#8217;objectif, on peut aussi poser le probl&#232;me autrement et partir de l&#8217;observation des endroits o&#249;
les programmes coupent, pour chercher &#224; d&#233;terminer si ces lieux sont &#171; interpr&#233;tables &#187;, plut&#244;t que de
chercher un alignement avec une segmentation de r&#233;f&#233;rence probl&#233;matique.
</p>
<p>Enfin, la question du mode de diff&#233;renciation des textes &#224; traiter se pose &#233;galement. Le fait de choisir de
comparer des textes appartenant &#224; un m&#234;me genre textuel (l&#8217;article d&#8217;encyclop&#233;die), limite leur diversit&#233;.
La distinction que nous avons consid&#233;r&#233;e se situe au niveau du sujet trait&#233;. C&#8217;est un premier point d&#8217;entr&#233;e,
qui n&#8217;est pas enti&#232;rement satisfaisant. Le rapport que nous avons pos&#233; au pr&#233;alable entre cat&#233;gorie de sujet
et type d&#8217;organisation n&#8217;est pas syst&#233;matiquement v&#233;rifi&#233; : si les articles traitant de personnalit&#233;s sont
quasi syst&#233;matiquement organis&#233;s temporellement, certaines notions sont malgr&#233; tout trait&#233;es de mani&#232;re
au moins partiellement th&#233;matique. Une &#233;tude privil&#233;giant cette fois une distinction par genre de textes
permettrait d&#8217;&#233;tablir un classement sur des crit&#232;res plus fiables, et d&#8217;opposer des textes au fonctionnement
plus marqu&#233;, renfor&#231;ant sans doute le contraste d&#233;j&#224; observ&#233;.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ADAM C. &amp; MORLANE-HOND&#200;RE F. (2009). D&#233;tection de la coh&#233;sion lexicale par voisinage distribu-
tionnel : application &#224; la segmentation th&#233;matique. In Actes du colloque RECITAL, Senlis, France.
</p>
<p>BESTGEN Y. (2009). Quel indice pour mesurer l&#8217;efficacit&#233; en segmentation de textes ? In Actes de
TALN&#8217;09, Senlis, France.
</p>
<p>BESTGEN Y. &amp; PI&#201;RARD S. (2006). Comment &#233;valuer les algorithmes de segmentation automatiques ?
Essai de construction d&#8217;un mat&#233;riel de r&#233;f&#233;rence. Actes de TALN : Verbum ex machina, Louvain-la-neuve,
6, 407&#8211;414.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CL&#201;MENTINE ADAM, PHILIPPE MULLER, C&#201;CILE FABRE
</p>
<p>BIBER D., CONNOR U. &amp; UPTON T. (2007). Discourse on the move : Using corpus analysis to describe
discourse structure. John Benjamins Publishing Co.
BOURIGAULT D. (2007). Un analyseur syntaxique operationnel : Syntex. CNRS &amp; Universit&#233; de
Toulouse-Le Mirail.
CHEN H., BRANAVAN S., BARZILAY R. &amp; KARGER D. (2009). Content Modeling Using Latent Per-
mutations. Journal of Artificial Intelligence Research, 36, 129&#8211;163.
CHOI F. Y. Y., WIEMER-HASTINGS P. &amp; MOORE J. (2001). Latent semantic analysis for text segmen-
tation. In Proceedings of the 2001 Conference on Empirical Methods in Natural Language Processing,
p. 109&#8211;117, Pittsburgh.
EISENSTEIN J. &amp; BARZILAY R. (2008). Bayesian unsupervised topic segmentation. In EMNLP &#8217;08 :
Proceedings of the Conference on Empirical Methods in Natural Language Processing, p. 334&#8211;343,
Morristown, NJ, USA : Association for Computational Linguistics.
FERRET O. (2002). Segmenter et structurer th&#233;matiquement des textes par l&#8217;utilisation conjointe de
collocations et de la r&#233;currence lexicale. In TALN&#8217;02 : 9e conf&#233;rence sur le Traitement Automatique des
Langues Naturelles, p. 155&#8211;164, Nancy, France.
FERRET O. (2007). Finding document topics for improving topic segmentation. In Proceedings of
the 45th Annual Meeting of the Association of Computational Linguistics, p. 480&#8211;487, Prague, Czech
Republic : Association for Computational Linguistics.
FERRET O., GRAU B. &amp; MASSON N. (1998). Thematic segmentation of texts : two methods for two
kinds of texts. In Proceedings of the 36th Annual Meeting of the Association for Computational Linguis-
tics and 17th International Conference on Computational Linguistics-Volume 1, p. 392&#8211;396 : Association
for Computational Linguistics.
GALLEY M., MCKEOWN K. R., FOSLER-LUSSIER E. &amp; JING H. (2003). Discourse segmentation of
multi-party conversation. In E. HINRICHS &amp; D. ROTH, Eds., Proceedings of the 41st Annual Meeting of
the Association for Computational Linguistics (ACL&#8211;03), p. 562&#8211;569, Sapporo, Japan.
GEORGESCUL M., CLARK A. &amp; ARMSTRONG S. (2006). An Analysis of Quantitative Aspects in
the Evaluation of Thematic Segmentation Algorithms. In Proceedings of the 7th SIGdial Workshop on
Discourse and Dialogue, p. 144&#8211;151, Sydney, Australia : Association for Computational Linguistics.
HEARST M. A. (1997). TextTiling : segmenting text into multi-paragraph subtopic passages. Computa-
tional Linguistics, 23(1), 33&#8211;64.
LITMAN D. &amp; PASSONNEAU R. (1995). Combining multiple knowledge sources for discourse seg-
mentation. In Proceedings of the 33rd annual meeting on Association for Computational Linguistics, p.
108&#8211;115 : Association for Computational Linguistics.
MALIOUTOV I. &amp; BARZILAY R. (2006). Minimum cut model for spoken lecture segmentation. In ACL-
44 : Proceedings of the 21st International Conference on Computational Linguistics and the 44th annual
meeting of the Association for Computational Linguistics, p. 25&#8211;32, Morristown, NJ, USA : Association
for Computational Linguistics.
P&#201;RY-WOODLEY M.-P. &amp; SCOTT (2006). Discours et Document : traitements automatiques. Num&#233;ro
th&#233;matique. revue T.A.L., 47(2), 7&#8211;19.
SWALES J. (1990). Genre analysis : English in academic and research settings. New York :Cambridge
University Press.
TEUFEL S. (1999). Argumentative Zoning : Information Extraction from Scientific Text. PhD thesis,
University of Edinburgh.</p>

</div></div>
</body></html>