<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traduction de requ&#234;tes bas&#233;e sur Wikip&#233;dia</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p> 
</p>
<p>Traduction de requ&#234;tes bas&#233;e sur Wikip&#233;dia  
 
</p>
<p>Beno&#238;t Gaillard, Olivier Collin, Malek Boualem 
</p>
<p> 
</p>
<p> Orange Labs &#8211; 2, Avenue Pierre Marzin, 22300 Lannion, France, 
benoit.gaillard@univ-tlse2.fr, olivier.collin, malek.boualem@orange-
</p>
<p>ftgroup.com 
</p>
<p> 
</p>
<p>R&#233;sum&#233; Cet article s'inscrit dans le domaine de la recherche d'information multilingue. Il 
propose une m&#233;thode de traduction automatique de requ&#234;tes bas&#233;e sur Wikip&#233;dia. Une phase 
</p>
<p>d'analyse permet de segmenter la requ&#234;te en syntagmes ou unit&#233;s lexicales &#224; traduire en 
</p>
<p>s'appuyant sur les liens multilingues entre les articles de Wikip&#233;dia. Une deuxi&#232;me phase 
</p>
<p>permet de choisir, parmi les traductions possibles, celle qui est la plus coh&#233;rente en s'appuyant 
</p>
<p>sur les informations d'ordre s&#233;mantique fournies par les cat&#233;gories associ&#233;es &#224; chacun des 
</p>
<p>articles de Wikip&#233;dia. Cet article justifie que les donn&#233;es issues de Wikip&#233;dia sont 
</p>
<p>particuli&#232;rement pertinentes pour la traduction de requ&#234;tes, d&#233;taille l'approche propos&#233;e et son 
</p>
<p>impl&#233;mentation, et en d&#233;montre le potentiel par la comparaison du taux d'erreur du prototype 
</p>
<p>de traduction avec celui d'autres services de traduction automatique. 
</p>
<p>Abstract This work investigates query translation using only Wikipedia-based resources 
in a two steps approach: analysis and disambiguation. After arguing that data mined from 
</p>
<p>Wikipedia is particularly relevant to query translation, we detail the implementation of the 
</p>
<p>approach. In the analysis phase, queries are segmented into lexical units that are associated to 
</p>
<p>several possible translations using a bilingual dictionary extracted from Wikipedia. During the 
</p>
<p>second phase, one translation is chosen amongst the various candidates, based on consistency, 
</p>
<p>asserted with the help of semantic information carried by categories associated to Wikipedia 
</p>
<p>articles. These two steps take advantage of data mined from Wikipedia, which is very rich and 
</p>
<p>detailed, constantly updated but also easy and free to access. We report promising results 
</p>
<p>regarding translation accuracy. 
</p>
<p>Mots-cl&#233;s : recherche d'information multilingue, traduction de requ&#234;tes, Wikip&#233;dia. 
</p>
<p>Keywords: cross language information retrieval, query translation, Wikipedia.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p> 
</p>
<p>1 Introduction de notre approche compar&#233;e &#224; l'&#233;tat de l'art 
</p>
<p>1.1 Approches lexicales de la traduction et de l'analyse de requ&#234;tes 
</p>
<p>Les approches lexicales de traduction de requ&#234;tes pour la recherche d'information multilingue 
</p>
<p>se heurtent &#224; des difficult&#233;s de couverture lexicale et d'ambigu&#239;t&#233;. L'encyclop&#233;die en ligne 
</p>
<p>Wikip&#233;dia permet de proposer des solutions &#224; ces deux probl&#232;mes car d'une part elle met &#224; 
</p>
<p>disposition une quantit&#233; cons&#233;quente de connaissances, constamment mises &#224; jour et 
</p>
<p>accessibles, ce qui permet d'en extraire ais&#233;ment des lexiques dont la couverture est optimale 
</p>
<p>et d'autre part ces connaissances sont organis&#233;es s&#233;mantiquement par le biais de cat&#233;gories 
</p>
<p>fournies par les contributeurs (Zesh et al., 2007). Nous montrons que les donn&#233;es issues de 
</p>
<p>Wikip&#233;dia ont des propri&#233;t&#233;s adapt&#233;es au traitement des requ&#234;tes et exposons une m&#233;thode de 
</p>
<p>segmentation des requ&#234;tes en unit&#233;s lexicales et une strat&#233;gie de choix de traduction parmi 
</p>
<p>plusieurs alternatives, par homog&#233;n&#233;it&#233; th&#233;matique s'appuyant sur les cat&#233;gories. Beaucoup 
</p>
<p>d'approches de traduction lexicale de requ&#234;tes s'appuient accessoirement sur Wikip&#233;dia, 
</p>
<p>contrairement &#224; notre approche qui en utilise exclusivement l'apport lexical et s&#233;mantique. Par 
</p>
<p>exemple, Ballesteros et al. (1997) utilisent des syntagmes extraits d'un corpus parall&#232;le traduit 
</p>
<p>manuellement, alors que (Jones et al., 2008) utilisent un lexique de syntagmes issus de 
</p>
<p>Wikip&#233;dia. Pour extraire les syntagmes de la requ&#234;te,  ces auteurs utilisent la m&#233;thode dite de 
</p>
<p>&quot;Maximum forward matching&quot; qui consiste &#224; d&#233;tecter le plus long syntagme possible dans la 
</p>
<p>requ&#234;te, en partant du d&#233;but, puis &#224; r&#233;p&#233;ter r&#233;cursivement l'op&#233;ration. Notre approche pour la 
</p>
<p>d&#233;tection de syntagmes, en revanche, s'appuie sur le seul lexique issu des titres d'articles de 
</p>
<p>Wikip&#233;dia et maximise la taille des unit&#233;s lexicales extraites sur la requ&#234;te dans son ensemble. 
</p>
<p>1.2 Approches s&#233;mantiques pour la d&#233;sambigu&#239;sation des requ&#234;tes 
</p>
<p>Des mesures telles que la &quot;similarit&#233; s&#233;mantique&quot; initialement d&#233;velopp&#233;es par (Resnik, 1995)  
</p>
<p>peuvent &#234;tre appliqu&#233;es &#224; des requ&#234;tes en s'appuyant sur Wikip&#233;dia (Strube, Ponzetto, 2006). 
</p>
<p>(Bunescu, Pasca, 2006) proposent une m&#233;thode de reconnaissance et de d&#233;sambigu&#239;sation 
</p>
<p>d'entit&#233;s nomm&#233;es (EN) &#224; l'aide d'un dictionnaire extrait de Wikip&#233;dia et de la similarit&#233; 
</p>
<p>cosinus entre les mots du contexte autour de l'EN et les mots de l'article correspondant &#224; l'EN 
</p>
<p>candidate. Nous fondons notre mesure de proximit&#233; uniquement sur les cat&#233;gories, qui offrent 
</p>
<p>une repr&#233;sentation plus concise du th&#232;me s&#233;mantique d'un article que celle issue du texte car 
</p>
<p>c'est l'objectif m&#234;me de leur ajout. (Sch&#246;nhofen et al., 2008) s'appuient sur les articles, 
</p>
<p>consid&#233;r&#233;s comme des concepts, de Wikip&#233;dia en langue cible pour d&#233;sambig&#252;iser les 
</p>
<p>requ&#234;tes par homog&#233;n&#233;it&#233; th&#233;matique (topic homogeneity) (Gledson, Keane, 2008) pour 
</p>
<p>ensuite les reformuler. Notre approche s'appuie aussi sur l'homog&#233;n&#233;it&#233; th&#233;matique, mais nos 
</p>
<p>alternatives sont des traductions directes, alors que les leurs sont des concepts qui, une fois 
</p>
<p>s&#233;lectionn&#233;s, sont utilis&#233;s pour g&#233;n&#233;rer les requ&#234;tes en langue cible, comme &#224; l'aide d'un pivot. 
</p>
<p>2 Wikip&#233;dia: une ressource pour le traitement des requ&#234;tes 
</p>
<p>Propri&#233;t&#233;s lexicales et s&#233;mantiques des titres et cat&#233;gories  d'articles: Les conventions 
</p>
<p>relatives au nommage des articles sont d&#233;finies sur la page explicative de Wikip&#233;dia
1
. En 
</p>
<p>particulier,  le titre id&#233;al est le titre le plus concis, ne commen&#231;ant pas par un article. Si 
</p>
<p>plusieurs titres sont possibles, le plus commun est utilis&#233;, par application du principe de 
</p>
<p>moindre surprise
 
</p>
<p>(http://fr.wikipedia.org/wiki/Principe_de_moindre_surprise). Ces 
</p>
<p>                                               
1 http://en.wikipedia.org/wiki/Wikipedia:Naming_conventions accessed Feb. 2010 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p> 
</p>
<p>conventions ont pour cons&#233;quence qu'une forte proportion de titres sont des EN et des groupes 
</p>
<p>nominaux et ne comportent que quelques mots, comme la grande majorit&#233; des requ&#234;tes (Jones 
</p>
<p>et al., 2008). Un utilisateur a tendance &#224; formuler la requ&#234;te la plus courte possible. La 
</p>
<p>d&#233;nomination d'un sujet la plus commune, choisie pour le titre d'un article, est aussi la plus 
</p>
<p>commune dans un corpus de requ&#234;tes. Les requ&#234;tes pr&#233;sentent donc des propri&#233;t&#233;s 
</p>
<p>linguistiques qui correspondent  &#224; celles des titres d'articles de Wikip&#233;dia. (Strube et al., 2006) 
</p>
<p>appellent folksonomie la structure r&#233;sultant de cat&#233;gorisation des articles de Wikip&#233;dia. Par 
</p>
<p>ailleurs Zesh et al., (2007) montrent que le graphe constitu&#233; par les cat&#233;gories de Wikip&#233;dia 
</p>
<p>partage de nombreuses propri&#233;t&#233;s avec des r&#233;seaux s&#233;mantiques lexicaux tels que WordNet. 
</p>
<p>Cela permet de penser que le graphe des cat&#233;gories de Wikip&#233;dia est une ressource 
</p>
<p>s&#233;mantique valide pour des applications de TALN, tout en &#233;tant beaucoup plus riche que des 
</p>
<p>th&#233;saurus co&#251;teux &#224; cr&#233;er et &#224; maintenir manuellement. 
</p>
<p>G&#233;n&#233;ration de donn&#233;es issues de Wikip&#233;dia: Nous avons extrait de la page de ressources de 
</p>
<p>Wikip&#233;dia
 
(http://download.wikimedia.org/enwiki/latest/ downloaded Nov. 2009) un lexique 
</p>
<p>bilingue dans lequel les titres fran&#231;ais d'articles de Wikip&#233;dia sont associ&#233;s aux titres anglais 
</p>
<p>correspondants par des liens multilingues entre articles traitant du m&#234;me sujet. Ce lexique 
</p>
<p>contient 540.920 traductions, dont un grand nombre d'ENs et de syntagmes, comme par 
</p>
<p>exemple: &quot;Avocat du diable&quot; &#61683; Devil's advocate&quot;; &quot;L'Avocat du diable (film)&quot; &#61683; &quot;Guilty as 
Sin&quot;. Les contributeurs de Wikip&#233;dia associent des cat&#233;gories &#224; chaque article ainsi qu'&#224; 
</p>
<p>d'autres cat&#233;gories par des relations hi&#233;rarchiques (th&#233;matique ou hyperonymique).  Les 
</p>
<p>hi&#233;rarchies de cat&#233;gories associ&#233;es aux articles de Wikip&#233;dia ont &#233;t&#233; extraites du site de 
</p>
<p>ressources de Wikip&#233;dia. Elles ne constituent pas une taxonomie rigoureuse car elles sont 
</p>
<p>librement construites par des contributeurs vari&#233;s, ce qui fait toute la richesse de cette 
</p>
<p>folksonomie (Strube, Ponzetto, 2007). C'est pourquoi, pour ne pas en subir les in&#233;vitables 
</p>
<p>inexactitudes ou redondances, nous avons s&#233;lectionn&#233; environ 20 cat&#233;gories parmi la ou les 
</p>
<p>centaines de cat&#233;gories associ&#233;es &#224; un article directement ou par filiation. Cette s&#233;lection  
</p>
<p>d&#233;taill&#233;e dans (Collin et al. 2010) s'appuie sur l'heuristique selon laquelle le chemin le plus 
</p>
<p>court parmi les chemins reliant les articles &#224; des cat&#233;gories pseudo-terminales serait le plus 
</p>
<p>pertinent. Cette 20aine de cat&#233;gories est utilis&#233;e de mani&#232;re non pond&#233;r&#233;e. 
</p>
<p>3 Mise en &#339;uvre du prototype de traduction de requ&#234;tes 
</p>
<p>Les deux phases cons&#233;cutives de la traduction des requ&#234;tes sont illustr&#233;es Figure 1: D'abord la 
</p>
<p>segmentation en unit&#233;s lexicales, ensuite la d&#233;sambig&#252;isation &#224; l'aide des cat&#233;gories. 
</p>
<p> 
</p>
<p>Figure 1: Sch&#233;ma synoptique de la traduction de requ&#234;tes bas&#233;e sur les titres et les articles de Wikip&#233;dia. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p> 
</p>
<p>3.1 Segmentation des requ&#234;tes &#224; l'aide des titres d'articles traduits 
</p>
<p>Une requ&#234;te est fr&#233;quemment constitu&#233;e de plusieurs mots qui forment une unit&#233; lexicale qui 
</p>
<p>se traduit de mani&#232;re non litt&#233;rale. Par exemple, &quot;Amicalement v&#244;tre&quot; se traduit en anglais par 
</p>
<p>&quot;The Persuaders&quot;. Une requ&#234;te compos&#233;e de plusieurs mots doit &#234;tre segment&#233;e en unit&#233;s 
</p>
<p>lexicales. Par exemple, la requ&#234;te ABCD (compos&#233;e des Quatre mots A,B, C et D) peut se 
</p>
<p>d&#233;composer en: &quot;ABCD&quot;; &quot;ABC,D&quot;; &quot;AB,CD&quot;; &quot;A,BCD&quot;; &quot;A,BC,D&quot;;&quot;AB,C,D&quot;;&quot;A,B,CD&quot; 
</p>
<p>ou &quot;A,B,C,D&quot;. Le choix de la meilleure segmentation se base sur l'hypoth&#232;se que lorsque 
</p>
<p>plusieurs mots successifs peuvent se traduire comme une unit&#233;, cette traduction est la plus 
</p>
<p>correcte. La m&#233;thode consiste &#224; v&#233;rifier, pour chacune des segmentations candidates, si les 
</p>
<p>unit&#233;s qui la composent appartiennent au lexique bilingue extrait de Wikip&#233;dia, dans l'ordre 
</p>
<p>d&#233;fini par les trois r&#232;gles R1 &#224; R3: 
</p>
<p>&#8226; (R1) Minimiser le nombre d'unit&#233;s lexicales (&quot;A,B,CD&quot; plut&#244;t que &quot;A,B,C,D&quot;). 
&#8226; (R2) Pour le m&#234;me nombre d'unit&#233;s, Maximiser la taille de la plus grande unit&#233; lexicale 
(&quot;ABC,D&quot; plut&#244;t que &quot; AB,CD&quot;). 
</p>
<p>&#8226; (R3) Pour la m&#234;me taille d'unit&#233;, privil&#233;gier les unit&#233;s lexicales en d&#233;but de requ&#234;te 
(&quot;ABC,D&quot; plut&#244;t que &quot;A,BCD&quot;). 
</p>
<p> 
</p>
<p>Une segmentation est accept&#233;e si un pourcentage suffisant (80%, dans ce travail) de mots (de 
</p>
<p>la requ&#234;te en langue source) se trouvent dans des unit&#233;s lexicales qui donnent lieu &#224; une 
</p>
<p>traduction non vide. Par exemple, si le d&#233;coupage [AB][C][DE] se traduit par [A'B'][][D'E'], 
</p>
<p>alors ce pourcentage est de 80%. Si les r&#232;gles R1 et R2 correspondent bien &#224; l'intuition, le 
</p>
<p>crit&#232;re de la r&#232;gle R3 et celui des 80% sont choisis empiriquement et leur optimalit&#233; 
</p>
<p>m&#233;riteraient d'&#234;tre  &#233;valu&#233; lors de travaux poursuivant le travail pr&#233;sent&#233; ici. 
</p>
<p>3.2 D&#233;sambigu&#239;sation des requ&#234;tes traduites par homog&#233;n&#233;it&#233; th&#233;matique 
</p>
<p>Chaque unit&#233; d'une requ&#234;te peut &#234;tre traduite par plusieurs alternatives. Nous choisissons la 
</p>
<p>traduction qui maximise l'homog&#233;n&#233;it&#233; th&#233;matique. Chacune des alternatives en langue cible 
</p>
<p>est repr&#233;sent&#233;e, dans l'espace vectoriel d&#233;fini par les cat&#233;gories, par un vecteur de coordonn&#233;e 
</p>
<p>1 selon chacune des cat&#233;gories associ&#233;es &#224; l'article correspondant (environs 20, comme 
</p>
<p>expliqu&#233; section 2), 0 selon chacune des autres cat&#233;gories. La proximit&#233; s&#233;mantique de deux 
</p>
<p>alternatives est d&#233;finie par la similarit&#233; cosinus de leurs vecteurs de cat&#233;gories, comme illustr&#233; 
</p>
<p>par la Figure 2. Les proximit&#233;s s&#233;mantiques de toutes les paires d'unit&#233;s traduites sont 
</p>
<p>calcul&#233;es puis ajout&#233;es, mesurant ainsi l'homog&#233;n&#233;it&#233; th&#233;matique de la requ&#234;te traduite. 
</p>
<p> 
</p>
<p>Figure 2:Choix de la traduction de &#171; lock &#187; par &quot;&#233;cluse&quot;  par homog&#233;n&#233;it&#233; th&#233;matique  avec &quot;bateau&quot;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p> 
</p>
<p>4 Evaluation de la traduction des requ&#234;tes et perspectives 
</p>
<p>Le tableau 1 illustre des r&#233;sultats satisfaisants. Les lignes 1 et 2 illustrent la bonne couverture 
</p>
<p>lexicale des ENs et termes en montrant que notre prototype est le seul &#224; traduire correctement 
</p>
<p>le titre de film ou le terme. Les lignes 2 et 4  illustrent les bonnes capacit&#233;s de 
</p>
<p>d&#233;sambigu&#239;sation par homog&#233;n&#233;it&#233; th&#233;matique: le fruit avocat est plus probablement li&#233; &#224; 
</p>
<p>l'agriculture biologique que l'homme de loi avocat, car ils partagent le th&#232;me de l'agriculture. 
</p>
<p>Source Traduction Wikip&#233;dia Traduction Systran Traduction Google 
</p>
<p>Maman, j'ai rat&#233; 
</p>
<p>l'avion 
</p>
<p>Home Alone Mom, I missed the 
</p>
<p>plane 
</p>
<p>Mom, I missed the plane 
</p>
<p> v&#233;lo tout terrain  mountain bike  bicycle any ground  road bike 
</p>
<p>juge avocat Judge Lawyer judge lawyer Judge Advocate 
</p>
<p>avocat agriculture 
</p>
<p>biologique 
</p>
<p>Avocado Organic 
</p>
<p>Farming 
</p>
<p>lawyer organic farming Advocate farming 
</p>
<p>Tableau 1: Illustration de la segmentation, de la traduction des EN et  syntagmes et de la d&#233;sambigu&#239;sation. 
</p>
<p>La traduction a &#233;t&#233; &#233;valu&#233;e sur un corpus d'environs 7000 requ&#234;tes saisies sur un moteur de 
</p>
<p>recherche d'un portail multim&#233;dia monolingue publique d'Orange
2
, se rapportant au domaine 
</p>
<p>des actualit&#233;s. Les requ&#234;tes, compos&#233;es en g&#233;n&#233;ral  de quelques mots, comportent de 
</p>
<p>nombreuses ENs et erreurs orthographiques, comme report&#233; dans (Bouraoui et al. 2010). 
</p>
<p>Nous avons compar&#233; les traductions du prototype avec celles de 3 logiciels de traduction 
</p>
<p>automatique du march&#233;, en libre service
3
: Systran, ProMT et Google. Le taux d'erreur (ER) est 
</p>
<p>&#233;valu&#233; par 1  humain qui assigne une note &#224; chaque traduction (0: mauvaise traduction, 0.5: 
</p>
<p>partiellement correcte, 1: bonne traduction). La moyenne M de ces scores est calcul&#233;e sur la 
</p>
<p>base des 7000 requ&#234;tes, m&#234;me r&#233;p&#233;t&#233;es car la performance d'un moteur se mesure par l'usage. 
</p>
<p>Le taux d'erreur est d&#233;fini par la formule: ER=1-M. Notre prototype ne proposant aucune 
</p>
<p>correction orthographique ou traitement grammatical, nous avons distingu&#233; les requ&#234;tes 
</p>
<p>comportant des erreurs ou des structures telles que des dates ou des phrases (environ le tiers 
</p>
<p>de toutes les requ&#234;tes). Ainsi, le Tableau 2 pr&#233;sente 2 ER diff&#233;rents: pour toutes les requ&#234;tes 
</p>
<p>(ER),  et pour celles sans erreur ni structure (ER-og). 
</p>
<p> Wikip&#233;dia Systran ProMT Google 
</p>
<p>ER 0,131 0,132 0,170 0,077 
</p>
<p>ER-og 0,100 0,118 0,156 0,064 
</p>
<p>Tableau 2: Comparaison des Taux d'Erreurs de plusieurs traducteurs appliqu&#233;s aux  requ&#234;tes. 
</p>
<p>La traduction par lexique et cat&#233;gories de Wikip&#233;dia uniquement est meilleure que celle de 2 
</p>
<p>des 3 traducteurs test&#233;s. Nos r&#233;sultats inf&#233;rieurs &#224; ceux de Google s'expliquent par le fait que 
</p>
<p>nous traitons mal de nombreuses requ&#234;tes comportant des op&#233;rateurs bool&#233;ens, des mots 
</p>
<p>                                               
2http://www.2424actu.fr 
</p>
<p>3 http://www.systran.fr/;  http://tr.voila.fr/; http://www.google.fr/language_tools?hl=fr </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p> 
</p>
<p>simples tels que &#171;de&#187;, ou des verbes conjugu&#233;s. L'&#233;valuation d'un moteur de CLIR tirant parti 
</p>
<p>de cette approche d&#233;passe le cadre de ce travail, mais la qualit&#233; relative des traductions 
</p>
<p>obtenues malgr&#233; son impl&#233;mentation minimaliste permet de penser que, lors de travaux futurs, 
</p>
<p>notre approche sera en mesure de contribuer &#224; l'&#233;laboration de moteurs de recherche 
</p>
<p>multilingues performants. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BALLESTEROS L., CROFT W. B. (1997). Phrasal translation and Query Expansion Techniques 
</p>
<p>for Cross Language Information Retrieval. Actes de 20th annual international ACM SIGIR 
</p>
<p>conference on research and development in information retrieval, SIGIR 1997, 84-91. 
</p>
<p>BOURAOUI J.L., GAILLARD B., GUIMIER DE NEEF E., BOUALEM M. (2010). Annotation of 
</p>
<p>linguistic phenomena in query logs. Actes de Congreso Internacional de Ling&#252;&#237;stica de 
</p>
<p>Corpus, May 2010, University of A Coru&#241;a. 
</p>
<p>BUNESCU R. C., PASCA M. (2006). Using encyclopedic knowledge for named entity 
</p>
<p>disambiguation. Actes de 11th conference of the European Chapter of the Association for 
</p>
<p>Computational Linguistics (EACL-2006), Trento, Italy, 9-16. 
</p>
<p>COLLIN O., GAILLARD B., BOURAOUI J.L., GIRAULT, T. (2010). Constitution d'une resource 
</p>
<p>s&#233;mantique issue du treillis des cat&#233;gories de Wikip&#233;dia. Actes de 17&#232; conference sur le 
</p>
<p>Traitement Automatique des Langues Naturelles (TALN 2010), Montr&#233;al, Canada. 
</p>
<p>GLEDSON A., KEANE J. (2008). Measuring Topic Homogeneity and its Application to 
</p>
<p>Dictionary-Based Word-Sense Disambiguation. COLING 2008,  Manchester, UK 273&#8211;280. 
</p>
<p>JONES, G.J.F., FANTINO F., NEWMAN E., ZHANG Y. (2008). Domain-specific query translation 
</p>
<p>for multilingual information access using machine translation augmented with dictionaries 
</p>
<p>mined from Wikipedia. 2nd International Workshop on Cross Lingual Information Access: 
</p>
<p>Addressing the Information Need of Multilingual Societies, Hyderabad, India, 34-41. 
</p>
<p>LESK M. E. (1996). Automatic sense disambiguation using machine readable dictionaries: 
</p>
<p>How to tell a pine cone from and ice cream cone. 5th Annual Conference on Systems 
</p>
<p>Documentation, Toronto, Ontario, Canada, 24-26. 
</p>
<p>RESNIK P. (1995). Using information content to evaluate semantic similarity in a taxonomy.  
</p>
<p>International Joint Conference for Artificial Intelligence (IJCAI-95), 1, 448-453. 
</p>
<p>SCH&#214;NHOFEN P., BENCZUR A., BIRO I., AND CSALOGANY K. (2008). Cross-Language Retrieval 
</p>
<p>with Wikipedia. Lecture Notes in Computer Science: Advances in Multilingual and 
</p>
<p>Multimodal Information Retrieval, 5152, (CLEF 2007) 72-79. 
</p>
<p>STRUBE  M., PONZETTO S. P. (2006). WikiRelate!: Computing Semantic Relatedness Using 
</p>
<p>Wikipedia. Actes de  AAAI 2006, 1419-1424. 
</p>
<p>ZESCH. T., GUREVYCH  I.,M&#220;HLH&#196;USER  M. (2007). Analysing and Accessing Wikipedia as a 
</p>
<p>Lexical Semantic Resource. Actes de Data Structures for Linguistic Resources and 
</p>
<p>Applications, 197-205. </p>

</div></div>
</body></html>