<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction automatique d'un lexique &#224; connotation g&#233;ographique &#224; des fins ontologiques dans un corpus de r&#233;cits de voyage</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Extraction automatique d'un lexique &#224; connotation 
</p>
<p>g&#233;ographique &#224; des fins ontologiques dans un corpus de 
</p>
<p>r&#233;cits de voyage 
</p>
<p> 
</p>
<p>Marie-No&#235;lle BESSAGNET (1), Mauro GAIO (2),  
</p>
<p>Eric KERGOSIEN (2), Christian SALLABERRY (1) 
</p>
<p> 
</p>
<p>(1) Laboratoire LIUPPA, UPPA, IAE, Avenue du doyen Poplawski, 
64012 PAU marie-noelle.bessagnet@univ-pau.fr, 
</p>
<p>christian.sallaberry@univ-pau.fr 
</p>
<p>(2) Laboratoire LIUPPA, UPPA, Facult&#233; des Sciences, D&#233;partement 
</p>
<p>Informatique, 64000 PAU, mauro.gaio@univ-pau.fr 
</p>
<p>eric.kergosien@univ-pau.fr 
</p>
<p>R&#233;sum&#233; Le but de ces travaux est d&#8217;extraire un lexique en analysant les relations 
entre des syntagmes nominaux et des syntagmes verbaux dans les textes de notre 
</p>
<p>corpus, essentiellement des r&#233;cits de voyage. L&#8217;hypoth&#232;se que nous &#233;mettons est de 
pouvoir &#233;tablir une cat&#233;gorisation des syntagmes nominaux associ&#233;s &#224; des Entit&#233;s 
</p>
<p>Nomm&#233;es de type lieu &#224; l&#8217;aide de l&#8217;analyse des relations verbales. En effet, nous 
disposons d&#8217;une chaine de traitement automatique qui extrait, interpr&#232;te et valide des 
Entit&#233;s Nomm&#233;es de type lieu dans des documents textuels. Ce travail est compl&#233;t&#233; 
</p>
<p>par l&#8217;analyse des relations verbales associ&#233;es &#224; ces EN, candidates &#224; l&#8217;enrichissement 
d&#8217;une ontologie. 
</p>
<p>Abstract The aim of this research work is to extract a lexicon by analyzing the 
relationship between nominal syntagms and verb construction within our corpus, 
</p>
<p>namely travel stories. We would like to establish a categorization of nominal 
</p>
<p>syntagms linked to Named Entity (NE) (type space) thanks to verbal relationships 
</p>
<p>analysis. In fact, we develop a computerized process flow in order to extract, to 
</p>
<p>interpret and to validate NE of type space in textual documents. This research work is 
</p>
<p>completed by the analyze of verbal relationships linked to these EN which could 
</p>
<p>enrich our ontology. 
</p>
<p>Mots-cl&#233;s : Entit&#233; nomm&#233;e, ontologie, relations verbales, patrons linguistiques 
</p>
<p>Keywords: Named Entity, ontology, verbal relations, language patterns </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BESSSAGNET, GAIO, KERGOSIEN ET SALLABERRY 
</p>
<p>1. Introduction 
</p>
<p>Les fonds documentaires patrimoniaux mobilisent de gros efforts de num&#233;risation. Leur 
</p>
<p>valorisation se fait g&#233;n&#233;ralement via des outils de gestion documentaire classiques (notices 
</p>
<p>descriptives, catalogues th&#233;matiques) int&#233;grant g&#233;n&#233;ralement des moteurs d&#8217;indexation plein-
texte. Le travail que nous pr&#233;sentons s&#8217;int&#232;gre dans un tel cadre visant la constitution et la 
gestion de fonds documentaires compos&#233;s de versions &#233;lectroniques de documents. Ce fonds 
</p>
<p>documentaire du XIX&#232;me si&#232;cle est consacr&#233; aux Pyr&#233;n&#233;es (en particulier des r&#233;cits de 
</p>
<p>voyages). Ces documents contiennent de tr&#232;s nombreuses r&#233;f&#233;rences au territoire pyr&#233;n&#233;en. 
</p>
<p>Ainsi, une cha&#238;ne de traitement compl&#232;te de construction d'index particuli&#232;rement adapt&#233;e &#224; 
</p>
<p>l'aspect g&#233;ographique des contenus a &#233;t&#233; propos&#233;e (Sallaberry et al, 2007). 
</p>
<p>Au sein de cette cha&#238;ne, une des premi&#232;res &#233;tapes est constitu&#233;e par l&#8217;annotation automatique 
d&#8217;Entit&#233;s Nomm&#233;es (EN) particuli&#232;res : les toponymes. En accord avec (Fort et al, 2009), 
&#171; Au regard du contenu tout d&#8217;abord, il importe de se focaliser non pas tant sur comment 
annoter, mais sur quoi annoter, en fonction de l&#8217;application vis&#233;e &#187;. Dans nos applications 
li&#233;es &#224; la constitution d'index g&#233;ographiques, nous sommes confront&#233;s &#224; l&#8217;ambig&#252;it&#233; 
r&#233;f&#233;rentielle (Leidner Jochen L., 2004). Aussi, pour lever cette ambig&#252;it&#233;, nous nous 
</p>
<p>int&#233;ressons &#224; la probl&#233;matique du marquage des toponymes selon un couple Nom propre et 
</p>
<p>expressions ant&#233;pos&#233;es d&#233;crivant des relations spatiales ou &#171; indirections &#187;. Par exemple, dans 
</p>
<p>la phrase, &#171;je traversais un affleurement de roches carbonat&#233;es au centre de la partie 
</p>
<p>m&#233;ridionale de la Montagne Pel&#233;e&#187;, la cha&#238;ne de traitement automatique que nous avons mise 
</p>
<p>en &#339;uvre permet de construire, apr&#232;s d&#233;tection des &#171;noms toponymiques&#187; : ici &#171;Montagne 
Pel&#233;e&#187;, et apr&#232;s interpr&#233;tation s&#233;mantique de l'indirection : ici l'expression &#171;au centre de la 
</p>
<p>partie m&#233;ridionale&#187;, une repr&#233;sentation g&#233;om&#233;trique, brique essentielle pour notre processus 
</p>
<p>de construction des index spatiaux. 
</p>
<p>L'objectif de ce papier est de proposer une &#233;tape suppl&#233;mentaire dans ce processus afin 
</p>
<p>d'exploiter l'information contenue dans l'expression &#171;affleurement de roches carbonat&#233;es&#187; qui 
</p>
<p>comme les syntagmes nominaux exprimant une indirection peut &#234;tre consid&#233;r&#233;e comme 
</p>
<p>faisant partie int&#233;grale du toponyme que nous souhaitons interpr&#233;ter. Cette nouvelle &#233;tape 
</p>
<p>n&#233;cessite d'extraire automatiquement ce type d'expression et de v&#233;rifier si elle est porteuse 
</p>
<p>d'un sens g&#233;ographique. Nous proposons, d'une part, une nouvelle cha&#238;ne de traitement 
</p>
<p>automatique permettant d'isoler le syntagme nominal pouvant se trouver ant&#233;pos&#233; &#224; la 
</p>
<p>premi&#232;re forme toponymique marqu&#233;e, repr&#233;sent&#233;e par le couple [indirection ?, nom 
</p>
<p>propre]que l&#8217;on appellera d&#233;sormais Entit&#233; Nomm&#233;e Spatiale (ES), et d'autre part une 
</p>
<p>premi&#232;re proposition afin de v&#233;rifier s'il y a un rapport suffisamment fort entre sa participation 
</p>
<p>&#224; une relation linguistique particuli&#232;re du type [verbe de d&#233;placement, 
</p>
<p>pr&#233;position ?, syntagme candidat, ES
 1] et sa capacit&#233; &#224; &#233;voquer un sens 
</p>
<p>g&#233;ographique. L'objectif est d'utiliser ce syntagme nominal, apr&#232;s validation de son sens 
</p>
<p>g&#233;ographique, dans deux options : soit comme terme pr&#233;cisant le type lors de la r&#233;cup&#233;ration 
</p>
<p>de la g&#233;om&#233;trie du toponyme (par exemple dans des ressources de type BD g&#233;ographique ou 
</p>
<p>gazetteer) car une correspondance a &#233;t&#233; trouv&#233;e via l'ontologie g&#233;ographique ; soit comme 
</p>
<p>proposition &#224; l&#8217;enrichissement de cette m&#234;me ontologie si celui-ci y est absent. 
</p>
<p>L&#8217;&#233;tude de notre corpus relatif aux r&#233;cits de voyages a montr&#233; que dans les cas o&#249; une ES est 
&#233;voqu&#233;e dans une phrase comportant un verbe dit de &#171; d&#233;placement &#187; alors les syntagmes 
</p>
<p>                                                 
1
 Le point d'interrogation indique une pr&#233;sence optionnelle </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION AUTOMATIQUE D'UN LEXIQUE A CONNOTATION GEOGRAPHIQUE A DES FINS 
</p>
<p>ONTOLOGIQUES DANS UN CORPUS DE RECITS DE VOYAGE 
</p>
<p>nominaux pr&#233;sents entre le verbe et l'ES ont fr&#233;quemment une connotation g&#233;ographique 
</p>
<p>(environ 50 % des termes sont issus de l&#8217;ontologie initiale). Ainsi, compte tenu de la 
</p>
<p>sp&#233;cificit&#233; de notre corpus nous &#233;mettons l'hypoth&#232;se que la relation linguistique [verbe de 
</p>
<p>d&#233;placement, pr&#233;position ?, syntagme candidat, ES] est un  indicateur  
</p>
<p>discriminant quant &#224; la connotation g&#233;ographique des syntagmes ant&#233;pos&#233;s aux toponymes. 
</p>
<p>Dans une premi&#232;re partie, nous exposerons les travaux connexes. Ensuite, nous aborderons 
</p>
<p>notre m&#233;thodologie g&#233;n&#233;rale et nous l&#8217;exemplifierons. Nous pr&#233;senterons apr&#232;s la chaine de 
traitement du langage naturel mise en &#339;uvre dans ces travaux en montrant comment elle 
permet d&#8217;analyser les entit&#233;s nomm&#233;es et leurs termes associ&#233;s ainsi que les verbes de 
d&#233;placement. La partie suivante abordera la construction du lexique par le biais de la 
</p>
<p>cat&#233;gorisation des termes candidats &#224; l&#8217;enrichissement de l&#8217;ontologie via le patron 
(V,P?,_,ES). Enfin, nous pr&#233;senterons les limites et perspectives de notre approche. 
</p>
<p>2. Travaux connexes 
</p>
<p>De nombreux travaux traitent de l&#8217;identification et de l&#8217;annotation des entit&#233;s nomm&#233;es (Fort 
et al, 2009). Le plus grand nombre est bas&#233; sur des m&#233;thodes par apprentissage exploitant des 
</p>
<p>propri&#233;t&#233;s de type patrons morphosyntaxiques de surface. L&#8217;approche ici pr&#233;sent&#233;e se focalise 
sur deux points : l&#8217;annotation fine et la d&#233;sambigu&#239;sation des EN de type g&#233;ographique d&#8217;une 
part, et l&#8217;assistance &#224; l&#8217;enrichissement d&#8217;une ontologie d&#8217;autre part. En accord avec (Erman et 
Jacquet, 2006), nous distinguerons trois types de travaux : &#171; ceux dont le but est de 
</p>
<p>d&#233;sambigu&#239;ser les EN, ceux cherchant &#224; construire une ressource sp&#233;cifique pour le traitement 
</p>
<p>des EN, et enfin ceux combinant les deux pr&#233;c&#233;dents, c&#8217;est &#224; dire cherchant &#224; faire de la 
d&#233;sambigu&#239;sation tout en exploitant une ressource sp&#233;cifique &#187;. Nous nous pla&#231;ons dans le 
</p>
<p>troisi&#232;me groupe. 
</p>
<p>Dans notre approche, nous tentons de traiter finement les EN en nous appuyant sur des 
</p>
<p>ressources sp&#233;cifiques, tels qu&#8217;une ontologie initiale, un th&#233;saurus, des gazetteers. Ceci est 
proche des travaux de (Bunescu et al., 2006) qui pr&#233;sentent une approche de d&#233;sambigu&#239;sation 
</p>
<p>d&#8217;EN qui exploite la ressource encyclop&#233;dique Wikip&#233;dia. Nous pourrions &#233;galement nous 
rapprocher du travail de (Pa&#351;ca M., 2004) concernant la construction d&#8217;une ressource &#224; partir 
de corpus pour annoter finement les EN. Cependant, ici, la ressource n&#8217;est pas construite mais 
enrichie. 
</p>
<p>De plus, le fait d&#8217;avoir des toponymes aussi pr&#233;cis nous permet de lever des ambig&#252;it&#233;s dans 
le processus de r&#233;solution g&#233;om&#233;trique de ces derniers (Leidner Jochen L., 2004). 
</p>
<p>3. M&#233;thodologie g&#233;n&#233;rale 
</p>
<p>3.1. D&#233;marche : pr&#233;sentation g&#233;n&#233;rale 
</p>
<p>La m&#233;thodologie propos&#233;e (figure 1) se d&#233;compose selon quatre &#233;tapes: </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BESSSAGNET, GAIO, KERGOSIEN ET SALLABERRY 
</p>
<p> 
</p>
<p>Figure 1. La d&#233;marche g&#233;n&#233;rale 
</p>
<p>Le but est d'utiliser une succession de patrons lexico-syntaxiques et un ensemble de 
</p>
<p>transducteurs mod&#233;lisant les verbes de d&#233;placement afin de nous aider &#224; filtrer des termes 
</p>
<p>candidats &#224; l&#8217;enrichissement de l&#8217;ontologie g&#233;ographique selon les propositions d&#233;crites dans 
(Kergosien et al, 2009). A cette fin, nous poss&#233;dons plusieurs ressources : un lexique des 
</p>
<p>termes exprimant les indirections, une ontologie g&#233;ographique initiale, un lexique 
</p>
<p>toponymique, le th&#233;saurus Rameau2. Nous utilisons ici Rameau comme une source de 
</p>
<p>connaissance g&#233;n&#233;raliste ; elle comporte plus de 400000 termes. 
</p>
<p>En recherche d'information, les EN sont g&#233;n&#233;ralement s&#233;par&#233;es en quatre classes : personnes, 
</p>
<p>lieux, organisations et expressions temporelles.  Dans le contexte du travail pr&#233;sent&#233; ici nous 
</p>
<p>nous int&#233;ressons exclusivement aux EN de type lieu. Dans ce cadre, il est important de 
</p>
<p>distinguer lac de Crabioules et pic de Crabioules, car leurs repr&#233;sentations g&#233;om&#233;triques dans 
</p>
<p>une ressource de type base de donn&#233;es g&#233;ographiques peuvent fortement diff&#233;rer. Comme 
</p>
<p>d&#233;j&#224; mentionn&#233;, notre chaine de traitement a notamment pour but de rep&#233;rer et d&#8217;analyser les 
syntagmes associ&#233;s au &#171; nom toponymique &#187;, ici Crabioules, diff&#233;renciant ainsi au sein de la 
</p>
<p>base de donn&#233;es g&#233;ographique, le toponyme lac de Crabioules de type hydronyme du 
</p>
<p>toponyme pic de Crabioules de type oronyme. Dans le processus propos&#233;, l'ontologie 
</p>
<p>g&#233;ographique descriptive de la BD g&#233;ographique est utilis&#233;e comme ressource pour cette 
</p>
<p>diff&#233;renciation des ES, mais dans certains cas, cette ontologie ne permet pas une telle 
</p>
<p>distinction, il est alors fait appel &#224; des ressources plus g&#233;n&#233;riques (comme le th&#233;saurus 
</p>
<p>Rameau). 
</p>
<p>Prenons les quatre exemples suivants : 
</p>
<p>1-j'ai remont&#233; &#224; pied la vall&#233;e d'Ossau          2- j'ai march&#233; jusqu'au pas des Echelles 
</p>
<p>                                                 
2
  R&#233;pertoire d'autorit&#233;-mati&#232;re encyclop&#233;dique et alphab&#233;tique unifi&#233;. Rameau est utilis&#233;, en France, par 
</p>
<p>la Biblioth&#232;que Nationale de France, les m&#233;diath&#232;ques r&#233;gionales ou locales, les biblioth&#232;ques universitaires,  
</p>
<p>ainsi que plusieurs organismes priv&#233;s. Voir  http://rameau.bnf.fr/informations/rameauenbref.htm 
</p>
<p> 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION AUTOMATIQUE D'UN LEXIQUE A CONNOTATION GEOGRAPHIQUE A DES FINS 
</p>
<p>ONTOLOGIQUES DANS UN CORPUS DE RECITS DE VOYAGE 
</p>
<p>3-  J&#8217;ai mang&#233; mes provisions &#224; Marsous        4- j'ai travers&#233; le gave de Pau 
</p>
<p>Seul le premier est &#233;tiquet&#233; gr&#226;ce &#224; la ressource que constitue notre ontologie g&#233;ographique. 
</p>
<p>Les termes pas, provisions, gave ne figurent pas dans l&#8217;ontologie. Or, pas des Echelles et gave 
de Pau sont bien des ES dans lesquelles les termes associ&#233;s pas et gave ont un sens 
</p>
<p>g&#233;ographique et nous devons essayer de les typer &#224; l&#8217;aide de ressources externes 
compl&#233;mentaires. 
</p>
<p>Notre m&#233;thodologie, de type patrons lexico-syntaxiques, permet, d&#8217;une part, de rep&#233;rer l'ES 
c&#8217;est &#224; dire l'ensemble du syntagme relatif au toponyme [Indirection?, Nom propre] et, d&#8217;autre 
part de rep&#233;rer le syntagme nominal candidat &#224; &#234;tre lexique. L&#8217;analyse de son emploi dans une 
</p>
<p>construction de type [verbe_d&#233;placement/pr&#233;position?/syntagme nominal 
</p>
<p>?/ ES], soit (V,P ?,_,ES), permet ensuite d'en supposer l'emploi g&#233;ographique. Alors est 
</p>
<p>mobilis&#233;e la ressource de type th&#233;saurus, afin d'associer au syntagme un ensemble 
</p>
<p>d'informations permettant de mieux caract&#233;riser son champ lexical. 
</p>
<p>D&#233;taillons sur des exemples tir&#233;s de notre corpus le processus dans sa globalit&#233;. 
</p>
<p>3.2. Exemplification sur un extrait de notre corpus 
</p>
<p>Dans un objectif de simplification, les exemples ne comportent pas d'indirections, mais 
</p>
<p>comme dit pr&#233;c&#233;demment, si celles-ci avaient &#233;t&#233; pr&#233;sentes, elles auraient &#233;t&#233; pr&#233;alablement 
</p>
<p>isol&#233;es. 
</p>
<p>Nous allons d&#233;tailler les quatre &#233;tapes sur un corpus-exemple compos&#233; de six phrases : 
</p>
<p>a. &#171; j'ai remont&#233; &#224; pied la vall&#233;e d'Ossau &#187; ; 
</p>
<p>b. &#171; A droite se trouve la route des Eaux-Chaudes &#187; ; 
</p>
<p>c. &#171; j'ai march&#233; jusqu'au pas des Echelles &#187; ;  
</p>
<p>d. &#171; J&#8217;ai mang&#233; mes provisions &#224; Marsous &#187; ;  
</p>
<p>e.  &#171; j'ai travers&#233; le gave de Pau &#187; ; 
</p>
<p>f. &#171; J'ai march&#233; jusqu'&#224; la fontaine de Visos avant le d&#233;jeuner &#187; 
</p>
<p>(i) Identification des ES dans le texte et des syntagmes nominaux associ&#233;s 
Dans une premi&#232;re &#233;tape, notre chaine de traitement rep&#232;re les entit&#233;s nomm&#233;es et leurs 
</p>
<p>syntagmes nominaux associ&#233;s, soient : &#171;vall&#233;e d'Ossau&#187;, &#171;route des Eaux-
Chaudes&#187;, &#171;pas des Echelles&#187;, &#171;provisions &#224; Marsous&#187;, &#171;gave de Pau&#187;, 
</p>
<p>&#171;fontaine de Visos&#187;. Pour les syntagmes nominaux associ&#233;s, leur classe 
</p>
<p>d&#8217;appartenance est &#233;galement marqu&#233;e : ils peuvent &#234;tre connus dans l&#8217;ontologie 
g&#233;ographique initiale, ils peuvent &#234;tre connus dans le th&#233;saurus Rameau, ils peuvent &#234;tre de 
</p>
<p>source inconnue. Ainsi, nous obtenons une liste d'ES candidates. 
</p>
<p>(ii) Validation des ES dans le texte 
Dans une deuxi&#232;me &#233;tape, les noms_toponymiques composant les ES candidates sont trait&#233;s 
</p>
<p>pour validation. Ainsi, &#171;Ossau&#187;, &#171;Eaux-Chaudes&#187;, &#171;Echelles&#187;, &#171;Marsous&#187;, 
</p>
<p>&#171;Pau&#187; sont valid&#233;s et &#171;Visos&#187; ne l&#8217;est pas. Ainsi, seuls les cas a), b) c) d) et e) 
comprennent des toponymes consid&#233;r&#233;s pour la suite du traitement. 
</p>
<p>cas Toponyme candidat Nom_toponymique 
valid&#233; 
</p>
<p>Source du syntagme nominal qualifiant 
</p>
<p>a vall&#233;e d'Ossau Oui Ontologie 
</p>
<p>b route des Eaux-Chaudes Oui Ontologie </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BESSSAGNET, GAIO, KERGOSIEN ET SALLABERRY 
</p>
<p>c pas des Echelles Oui Rameau 
</p>
<p>d provisions &#224; Marsous Oui Rameau 
</p>
<p>e gave de Pau Oui Inconnu 
</p>
<p>f fontaine de Visos Non Ontologie 
</p>
<p>Les cas a) et b) ne nous poseront aucun probl&#232;me pour la suite car ce sont des toponymes 
</p>
<p>valid&#233;s dont le syntagme nominal est connu dans notre ontologie initiale. Ces deux cas ne 
</p>
<p>seront pas consid&#233;r&#233;s dans les deux prochaines &#233;tapes. 
</p>
<p>(iii) Identification et filtre des syntagmes nominaux li&#233;s aux ES gr&#226;ce au patron 
(V,P ?,_,ES) 
</p>
<p>Nous allons, dans cette &#233;tape, nous baser sur le patron (V,P ?,_,ES) pour un dernier filtre. 
</p>
<p>Dans les phrases c), d) et e), nous allons consid&#233;rer les verbes de d&#233;placement afin de ne 
</p>
<p>garder que les toponymes de ce type de construction syntaxique. Dans la phrase c), nous 
</p>
<p>avons bien une structure (V,P ?,_,ES) &lt;marcher, jusqu&#8217;au, pas, des Echelles&gt;. 
</p>
<p>De plus, le terme pas est connu du th&#233;saurus Rameau. Ce terme pourra donc &#234;tre conserv&#233; 
</p>
<p>comme un candidat potentiel &#224; l&#8217;enrichissement de l&#8217;ontologie. Dans la phrase d), nous avons 
</p>
<p>le terme provisions connu du th&#233;saurus Rameau mais aucunement une structure 
</p>
<p>(V,P ?,_,ES). Ce terme ne sera donc pas conserv&#233; pour &#234;tre un candidat &#224; l&#8217;enrichissement de 
</p>
<p>l&#8217;ontologie. Dans la phrase e), nous avons bien une structure (V,P ?,_,ES) &lt;traverser, 
</p>
<p>gave, de Pau&gt;. Le terme gave est de source inconnue et ce terme pourra donc &#234;tre 
</p>
<p>conserv&#233; comme un candidat potentiel &#224; l&#8217;enrichissement de l&#8217;ontologie. 
</p>
<p>(iv)  Enrichissement de l&#8217;ontologie avec les termes candidats 
Sur les six cas du d&#233;part, gr&#226;ce &#224; la mise en &#339;uvre de notre processus, seuls deux termes 
</p>
<p>seront consid&#233;r&#233;s dans cette &#233;tape : &#171;pas&#187; et &#171;gave&#187;. Le terme &#171;pas&#187; appartient au 
</p>
<p>th&#233;saurus Rameau dans un sens g&#233;ographique. Dans ce cas, notre approche permet d&#8217;exploiter 
de fa&#231;on automatis&#233;e ce type de termes, en v&#233;rifiant d&#8217;&#233;ventuelles approximations de sens 
avec les concepts de l&#8217;ontologie. Pour le terme &#171; gave &#187;, cette &#233;tape est plus d&#233;licate. Nous 
devons faire appel &#224; d&#8217;autres ressources externes, du type Dictionnaire Larousse. Cependant, 
le terme &#171; gave &#187; doit &#234;tre valid&#233;. Le processus automatis&#233; trouvera ici ses limites. 
</p>
<p>Abordons la chaine de traitement mise en &#339;uvre dans nos travaux. 
</p>
<p>4. Op&#233;rationnalisation du processus 
</p>
<p>Le contexte dans lequel nous nous pla&#231;ons du point de vue du TAL est celui de l'extraction 
</p>
<p>d'informations cibl&#233;es (l'information g&#233;ographique) dans un corpus relativement homog&#232;ne. 
</p>
<p>4.1. Analyse des EN et des termes associ&#233;s 
</p>
<p>La chaine de traitement que nous proposons a &#233;t&#233; impl&#233;ment&#233;e gr&#226;ce &#224; l'utilisation de 
</p>
<p>LinguaStream
3
 (figure 2). Elle s&#8217;appuie sur une d&#233;marche de &#171; tokenisation &#187; classique (1). 
</p>
<p>                                                 
3
 http://www.linguastream.org/ 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION AUTOMATIQUE D'UN LEXIQUE A CONNOTATION GEOGRAPHIQUE A DES FINS 
</p>
<p>ONTOLOGIQUES DANS UN CORPUS DE RECITS DE VOYAGE 
</p>
<p> 
</p>
<p>Figure 2. Chaine de traitement 
</p>
<p>Nous marquons rapidement des ES  candidates puis nous appliquons les &#233;tapes suivantes de 
</p>
<p>l&#8217;analyse &#224; ces ES uniquement. Un marqueur de token spatial candidat (2) utilise des r&#232;gles 
lexicales (lexiques d&#8217;introducteurs d&#8217;information spatiales) et typographiques (majuscule en 
d&#233;but de token par exemple). Puis, un analyseur morpho-syntaxique associe un lemme et une 
</p>
<p>nature &#224; chaque token spatial candidat (i.e. Crabioules, nom). Un analyseur s&#233;mantique (4) 
</p>
<p>associ&#233; &#224; des r&#232;gles de grammaire DCG (Definite Clause Grammar) exprim&#233;es en Prolog 
</p>
<p>qualifie les entit&#233;s spatiales avec indirections d'entit&#233;s spatiales relatives. Rappelons que, pour 
</p>
<p>celles-ci dans le cadre du processus ici pr&#233;sent&#233; la partie marqu&#233;e comme &#233;tant une 
</p>
<p>indirection est &#233;cart&#233;e. La fin du processus donnera donc des ES  accompagn&#233;es d'un terme : 
</p>
<p>(mont, Crabioules), (ville, Pau), (vall&#233;e, Ossau), (roche carbonat&#233;e, Montagne Pel&#233;e), etc. 
</p>
<p>Les ES sont valid&#233;es et g&#233;olocalis&#233;es (5) automatiquement &#224; l&#8217;aide de ressources externes ou 
de gazetteers contributives internes. 
</p>
<p>La liste des termes associ&#233;s &#224; des ES est marqu&#233;e gr&#226;ce &#224; l'ontologie g&#233;ographique initiale et &#224; 
</p>
<p>l&#8217;aide de ressources externes de type th&#233;saurus (ici Rameau).  Nous avons montr&#233; dans 
(Kergosien et al, 2009) que sur un ensemble de 14 r&#233;cits, nous obtenons des termes pr&#233;sents 
</p>
<p>dans l&#8217;ontologie g&#233;ographique initiale ou pas. Parmi ces autres termes, gr&#226;ce &#224; la ressource 
externe Rameau, nous savons que certains ont un caract&#232;re g&#233;ographique et pourraient 
</p>
<p>enrichir la taxonomie (comme &#171; gave &#187; trouv&#233; dans &#171; le gave de Pau &#187; qui pourrait aider &#224; 
</p>
<p>identifier une repr&#233;sentation spatiale ad&#233;quate &#224; &#171; Pau &#187;), contrairement &#224; d&#8217;autres (comme 
&#171; maire &#187; trouv&#233; dans &#171; le maire de Pau &#187;). 
</p>
<p>4.2. Analyse des verbes 
</p>
<p>Le sous-ensemble des verbes auxquels nous nous int&#233;ressons ici sont ceux qui entrent dans 
</p>
<p>une construction [verbe de d&#233;placement, pr&#233;position ?, syntagme 
</p>
<p>nominal ?, ES], que nous notons (V,P ?,_,ES) (Loustau et al, 2007). Dans les travaux 
</p>
<p>linguistiques, nous trouvons une classification des verbes dits de d&#233;placement (Vandeloise, 
</p>
<p>1987), (Laur, 1991), (Borillo, 1998), (Aurnague, 2008). Cette construction permet dans une 
</p>
<p>certaine mesure de lever une grande partie des probl&#232;mes d'ambigu&#239;t&#233; que l'on peut trouver 
</p>
<p>dans des propositions comme &#171; quitter son mari &#187;, &#171; traverser une mauvaise p&#233;riode &#187;, etc. 
</p>
<p>Conform&#233;ment &#224; la notion de polarit&#233; aspectuelle (Boons, 1987) que nous avons retenue, les 
</p>
<p>verbes de d&#233;placement qui interviennent dans l'&#233;vocation d'un d&#233;placement seront selon </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BESSSAGNET, GAIO, KERGOSIEN ET SALLABERRY 
</p>
<p>(Borillo, 1998), (Garcia-Debanc et al, 2009) : des &#171; verbes initiaux &#187; ou de polarit&#233; initiale, 
</p>
<p>comme quitter, partir, sortir, s&#8217;&#233;chapper, s&#8217;&#233;loigner, etc. ; des &#171; verbes finaux &#187; ou de polarit&#233; 
finale, comme arriver &#224;, atteindre, entrer dans, regagner, etc ; et des &#171; verbes m&#233;dians &#187; ou 
</p>
<p>de polarit&#233; m&#233;diane, comme traverser, franchir, parcourir, passer par, se d&#233;placer dans, etc.. 
</p>
<p>Ces divers travaux nous ont aid&#233;s &#224; caract&#233;riser les verbes de d&#233;placement dans la mise en 
</p>
<p>place de transducteurs. En effet, dans notre processus, le mode op&#233;ratoire pour le rep&#233;rage et 
</p>
<p>l'identification des syntagmes verbaux de type d&#233;placement est mis en &#339;uvre gr&#226;ce au 
principe des transducteurs. Nous rappelons que les transducteurs sont bas&#233;s sur des machines 
</p>
<p>&#224; &#233;tats finis mettant en correspondance deux langages r&#233;guliers. Compte tenu des observations 
</p>
<p>faites sur notre corpus, la construction des syntagmes verbaux de d&#233;placement peut &#234;tre 
</p>
<p>apparent&#233;e &#224; un langage r&#233;gulier. Cette mod&#233;lisation du d&#233;placement sous forme de 
</p>
<p>transducteurs est g&#233;n&#233;rique &#224; tout d&#233;placement exprim&#233; principalement sous forme verbale. 
</p>
<p>Cette analyse &#224; base de transducteurs s&#8217;appuie sur les r&#233;sultats d&#8217;analyses plus en amont dans 
la cha&#238;ne auparavant pr&#233;sent&#233;e.  Pour des raisons de facilit&#233; et de compatibilit&#233; avec les autres 
</p>
<p>modules de la cha&#238;ne, les transducteurs ont &#233;t&#233; traduits en r&#232;gles de grammaire dans lesquelles 
</p>
<p>nous retrouvons les principaux objets du mod&#232;le : le verbe avec sa polarit&#233;, la pr&#233;position et 
</p>
<p>l&#8217;ES (Figure 3). 
</p>
<p> 
</p>
<p>Figure3. Un exemple de transducteur 
</p>
<p>5. Cat&#233;gorisation des termes candidats &#224; l&#8217;enrichissement  
</p>
<p>Le graphique suivant (figure 4) donne diverses statistiques sur notre corpus vis-&#224;-vis de 
</p>
<p>l&#8217;ontologie initiale, du th&#233;saurus Rameau et de source inconnue. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION AUTOMATIQUE D'UN LEXIQUE A CONNOTATION GEOGRAPHIQUE A DES FINS 
</p>
<p>ONTOLOGIQUES DANS UN CORPUS DE RECITS DE VOYAGE 
</p>
<p>  
</p>
<p>Figure 4. Une premi&#232;re cat&#233;gorisation des termes 
</p>
<p>Ainsi, la validation des ES permet quasiment de diviser par 2 la liste initiale de toponymes 
</p>
<p>candidats : sur les 13685 occurrences de d&#233;part, nous avons 6816 occurrences de termes 
</p>
<p>associ&#233;es &#224; des noms toponymiques valid&#233;s (Figure 4). 
</p>
<p>Gr&#226;ce &#224; la chaine de traitement, nous avons donc mis en &#233;vidence dans le texte les 
</p>
<p>constructions (V,P ?,_,ES). Parmi les 6816 occurrences de termes identifi&#233;s qualifiant un nom 
</p>
<p>toponymique valid&#233;, 4189 sont pr&#233;sentes dans Rameau dont 2688 ne sont pas partag&#233;s avec 
</p>
<p>l&#8217;ontologie initiale, 2252 occurrences de termes sont de source inconnue. Elles sont donc 
candidates &#224; son enrichissement. Nous devrions donc a priori les traiter. Gr&#226;ce &#224; l&#8217;application 
du patron (V,P ?, _,ES) nous allons &#233;liminer un ensemble cons&#233;quent de s&#233;quences pour 
</p>
<p>lesquelles des termes de source Rameau ou de source inconnue sont associ&#233;s &#224; des noms 
</p>
<p>toponymiques. Ainsi, nous r&#233;duisons notre champ d&#8217;analyse puisque, nous aurons au final 628 
occurrences de termes identifi&#233;es participant &#224; un patron (V,P ?, _,ES) et au final 300 
</p>
<p>occurrences de termes identifi&#233;es ne seront pas pr&#233;sentes dans l&#8217;ontologie initiale (plus de 200 
termes distincts). Les verbes de d&#233;placement de notre corpus pour les 628 occurrences sont 
</p>
<p>class&#233;s selon les polarit&#233;s suivantes : 67% de polarit&#233; finale, 26% de polarit&#233; m&#233;diane et 7% 
</p>
<p>de polarit&#233; initiale. L&#8217;usage des relations verbales tel que d&#233;crit dans cet article nous permet 
de mieux cibler la proposition des termes candidats &#224; l&#8217;enrichissement. 
</p>
<p>6. Limites et perspectives 
</p>
<p>L'hypoth&#232;se que nous avons &#233;mise sur la pr&#233;sence de verbes de d&#233;placement comme 
</p>
<p>indicateur quant &#224; la connotation g&#233;ographique des syntagmes ant&#233;pos&#233;s aux toponymes est 
</p>
<p>v&#233;rifi&#233;e. La m&#233;thodologie propos&#233;e nous permet d&#8217;extraire de notre corpus de r&#233;cits de 
voyage un lexique d&#8217;&#233;tiquettes s&#233;mantiques, &#233;l&#233;ment de pr&#233;cision lors de la r&#233;cup&#233;ration de la 
g&#233;om&#233;trie ou candidat &#224; l&#8217;enrichissement de l&#8217;ontologie. 
</p>
<p>Cependant, dans notre corpus, nous avons &#233;galement des constructions [verbe de 
</p>
<p>d&#233;placement, pr&#233;position (facultative), syntagme nominal, entit&#233; nomm&#233;e spatiale ] qui posent 
</p>
<p>probl&#232;me et qui m&#233;ritent donc d&#8217;autres analyses : (a) &#171; j&#8217;ai march&#233; jusqu&#8217;au maire 
</p>
<p>d&#8217;Accous &#187;, (b)&#171; Je pus p&#233;n&#233;trer dans les solitudes des Landes &#187;  et 
</p>
<p>(c) &#171; Je suis parti &#224; cheval pour Gavarnie &#187;. Le cas a) est retenu dans notre 
</p>
<p>analyse via le patron (V,P ?, _,ES) avec un terme de source Rameau. Mais ce cas s&#8217;av&#232;re 
erron&#233; du fait de la signification du terme &#171; maire &#187; qui n&#8217;est en aucun cas g&#233;ographique. Le 
cas b) est retenu dans notre analyse via le patron (V,P ?, _,ES) avec un terme de source 
</p>
<p>inconnue. Mais ce cas s&#8217;av&#232;re erron&#233; du fait de la signification du terme solitudes qui n&#8217;est en 
aucun cas g&#233;ographique. Le cas (c) pourra &#234;tre correctement analys&#233; : le syntagme nominal &#224; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BESSSAGNET, GAIO, KERGOSIEN ET SALLABERRY 
</p>
<p>cheval, gr&#226;ce &#224; un nouveau patron lexico-syntaxique identifiant ces syntagmes comme une 
</p>
<p>modalit&#233; de d&#233;placement, va permettre ainsi de lever l&#8217;ambig&#252;it&#233;. 
</p>
<p>Nous travaillons actuellement sur ces points en &#233;tudiant d&#8217;autres ressources (EuroWordNet, 
Larrousse) qui pourraient nous permettre, de la m&#234;me fa&#231;on que Rameau, d'am&#233;liorer encore 
</p>
<p>plus l'inventaire du lexique &#224; connotation g&#233;ographique. Nous travaillons &#233;galement sur une 
</p>
<p>analyse plus fine des pr&#233;positions accompagnant les verbes intransitifs afin de savoir si nous 
</p>
<p>pouvons rep&#233;rer des patrons [verbe, pr&#233;position, compl&#233;ment] o&#249; le compl&#233;ment serait 
</p>
<p>n&#233;cessairement &#224; connotation g&#233;ographique.  
</p>
<p>Remerciements 
</p>
<p>Cette recherche a &#233;t&#233; r&#233;alis&#233;e dans le cadre du projet GeOnto &#8220;Constitution, alignement et 
exploitation d&#8217;ontologies g&#233;ographiques &#187; (http://geonto.lri.fr/), en partie financ&#233; par 
l&#8217;Agence Nationale de la Recherche (ANR-O7-MDCO-005). 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>AURNAGUE M. (2008), Qu'est-ce qu'un verbe de d&#233;placement ? : Crit&#232;res spatiaux pour une 
</p>
<p>classification des verbes de d&#233;placement intransitifs du fran&#231;ais, CONGRES MONDIAL DE 
</p>
<p>LINGUISTIQUE FRAN&#199;AISE, PARIS, FRANCE, 2008 DOI: 10.1051/CMLF08041. 
</p>
<p>BOONS, J.-P. (1987). `La notion s&#233;mantique de d&#233;placement dans une classification syntaxique 
</p>
<p>des verbes locatifs'. LANGUE FRAN&#199;AISE 76, 5 &#8211; 40. 
BUNESCU R., PA&#350;CA M. (2006), Using Encyclopedic Knowledge for Named entity 
</p>
<p>Disambiguation, in  EACL The Association for Computer Linguistics (2006), Dernier acc&#232;s 
</p>
<p>Web le 10/02/2010 http://www.aclweb.org/anthology/E/E06/E06-1002.pdf 
</p>
<p>EHRMANN M., JACQUET G. (2006), Vers une double annotation des Entit&#233;s Nomm&#233;es, 
</p>
<p>Traitement Automatique des Langues 2006 Volume 47 Num&#233;ro 3 
</p>
<p>FORT K., EHRMANN M., NAZARENKO A., (2009) Vers une m&#233;thodologie d&#8217;annotation des 
entit&#233;s nomm&#233;es en corpus ?, TALN 2009,  
</p>
<p>GARCIA-DEBANC C., DUVIGNAU K., DUTRAIT C., GANGNEUX M. (2009). &#171;Enseignement du 
</p>
<p>lexique et production &#233;crite. Un travail sur les verbes de d&#233;placement &#224; la fin de l&#8217;&#233;cole 
primaire &#187;. Pratiques 141-142, Juin 2009 (Masseron &amp; Lecolle, coord.), pp. 208-232. 
</p>
<p>KERGOSIEN E, KAMEL M, SALLABERRY C, BESSAGNET MN, AUSSENAC N., GAIO M, (2009), 
</p>
<p>Construction automatique d'ontologie et enrichissement &#224; partir de ressources externes, JFO 
</p>
<p>2009, ISBN 978 1 60558 842 1, pp11-20 
</p>
<p>LAUR D. (1991). S&#233;mantique du d&#233;placement et de la localisation en fran&#231;ais : une &#233;tude des 
</p>
<p>verbes, des  pr&#233;positions et de leur relation dans la phrase simple. PhD thesis, Universit&#233; de 
</p>
<p>Toulouse II. 
</p>
<p>LEIDNER JOCHEN L.(2004). Toponym resolution in text: &#8221;which Sheffield is it?&#8221;. In 
Proceedings of the the 27th, Annual International ACM SIGIR Conference (SIGIR 2004), 
</p>
<p>pages 602&#8211;606, Sheffield, UK. ACM Press 
LOUSTAU P. , GAIO M., NODENOT T. (2007), Des d&#233;placements &#224; l'itin&#233;raire, du syntagme au 
</p>
<p>discours. Extraction d'itin&#233;raires d'un corpus de r&#233;cits de voyages. SAGEO 2007, ISBN : 978-
</p>
<p>2-85710-078-2  
</p>
<p>PA&#350;CA M., 2004. Acquisition of categorized named entities for web search,  In Proc. of CIKM, 
</p>
<p>2004. 
</p>
<p>SALLABERRY Y C., GAIO M., LESBEGUERIE J., LOUSTAU P. (2007) A Semantic Approach for 
</p>
<p>Geospatial Information Extraction from Unstructured Documents. Chapitre du livre The 
</p>
<p>Geospatial Web book, Springer, The Advanced Information and Knowledge Processing 
</p>
<p>Series. ISBN 1-84628-826-6. pp. 93-105. 2007 </p>

</div></div>
</body></html>