<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extension d&#8217;un syst&#232;me d&#8217;&#233;tiquetage d&#8217;entit&#233;s nomm&#233;es en &#233;tiqueteur s&#233;mantique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Extension d&#8217;un syst&#232;me d&#8217;&#233;tiquetage d&#8217;entit&#233;s nomm&#233;es en
&#233;tiqueteur s&#233;mantique&#8727;
</p>
<p>Eric Charton1 Michel Gagnon1 Benoit Ozell1
</p>
<p>(1) &#201;cole Polytechnique, 2900 boul. Edouard Montpetit, Montr&#233;al, Canada H3T 1J4
{eric.charton, michel.gagnon, benoit.ozell}@polymtl.ca
</p>
<p>R&#233;sum&#233;. L&#8217;&#233;tiquetage s&#233;mantique consiste &#224; associer un ensemble de propri&#233;t&#233;s &#224; une s&#233;quence de
mots contenue dans un texte. Bien que proche de la t&#226;che d&#8217;&#233;tiquetage par entit&#233;s nomm&#233;es, qui revient &#224;
attribuer une classe de sens &#224; un mot, la t&#226;che d&#8217;&#233;tiquetage ou d&#8217;annotation s&#233;mantique cherche &#224; &#233;tablir
la relation entre l&#8217;entit&#233; dans son texte et sa repr&#233;sentation ontologique. Nous pr&#233;sentons un &#233;tiqueteur
s&#233;mantique qui s&#8217;appuie sur un &#233;tiqueteur d&#8217;entit&#233;s nomm&#233;es pour mettre en relation un mot ou un groupe
de mots avec sa repr&#233;sentation ontologique. Son originalit&#233; est d&#8217;utiliser une ontologie interm&#233;diaire de
nature statistique pour &#233;tablir ce lien.
</p>
<p>Abstract. Semantic labelling consist to associate a set of properties to a sequence of words from a
text. Although its proximity with the named entity labelling task, which is equivalent to associate a class
meaning to a sequence of word, the task of semantic labelling try to establish the relation between the
entity in the text and it&#8217;s ontological representation. We present a semantic labelling system based on a
named entity recognition step. The originality of our system is that the link between named entity and its
semantic representation is obtained trough the use of an intermediate statistical ontology.
</p>
<p>Mots-cl&#233;s : &#201;tiqueteur s&#233;mantique, Entit&#233;s nomm&#233;es, Analyse s&#233;mantique, Ontologie.
</p>
<p>Keywords: Semantic parser, Named entities, Semantic annotation.
</p>
<p>1 Introduction
</p>
<p>L&#8217;acquisition de masses de m&#233;tadonn&#233;es depuis les contenus rendus disponibles sur le web a favoris&#233;
l&#8217;&#233;mergence de nouvelles formes d&#8217;applications s&#233;mantiques. Les th&#233;matiques des m&#233;tadonn&#233;es disponibles
sont larges : elles peuvent concerner des personnes, des objets, des lieux, mais aussi des notions plus ab-
straites telles que des concepts, des modalit&#233;s, ou de simples donn&#233;es num&#233;riques (le chiffre d&#8217;affaire
d&#8217;une entreprise, la date de naissance d&#8217;une personne). Ces repr&#233;sentations conceptuelles jouent un r&#244;le
essentiel dans les applications s&#233;mantiques du TAL. Elles sont notamment d&#233;ploy&#233;es dans deux activit&#233;s
d&#8217;automatisation bien distinctes que sont l&#8217;analyse s&#233;mantique et l&#8217;&#233;tiquetage s&#233;mantique. L&#8217;analyse s&#233;-
mantique consiste &#224; attribuer un sens aux composants d&#8217;une phrase (la nature des &#233;v&#233;nements verbaux, les
circonstances de l&#8217;&#233;v&#233;nement, les acteurs impliqu&#233;s) (Zouaq &amp; Gagnon, 2010) . L&#8217;activit&#233; d&#8217;&#233;tiquetage
s&#233;mantique diff&#232;re de l&#8217;analyse, en associant des propri&#233;t&#233;s au mot ou au groupe de mots.
</p>
<p>Ainsi, ces deux t&#226;ches, bien que tr&#232;s compl&#233;mentaires et visant toutes deux &#224; associer une m&#233;ta-connaissance
&#224; des objets textuels, attribuent du sens sur des registres diff&#233;rents. Dans un composant de compr&#233;hension
</p>
<p>&#8727;(*) Ce travail s&#8217;inscrit dans le cadre du projet Gitan, soutenu par Unima Inc et Prompt Qu&#233;bec</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>{ERIC.CHARTON, MICHEL.GAGNON, BENOIT.OZELL}@POLYMTL.CA
</p>
<p>d&#8217;un syst&#232;me de dialogue par exemple, il est aussi important de connaitre l&#8217;objectif s&#233;mantique (je souhaite
r&#233;server dans l&#8217;h&#244;tel Beau Soleil le mois prochain, soit Action :R&#233;server ;Temps :30j), qui rel&#232;ve de l&#8217;-
analyse (les informations sont contenues dans le texte), que le d&#233;tail des entit&#233;s concern&#233;es (EN :H&#244;tel
Beau Soleil ;Propri&#233;t&#233;s :types de chambres,prix des chambres) qui rel&#232;ve d&#8217;une mise en relation d&#8217;une
&#233;tiquette avec des connaissances externes (les informations sont ext&#233;rieures au texte).
</p>
<p>Nous proposons de compl&#233;ter un syst&#232;me d&#8217;&#233;tiquetage par entit&#233;s nomm&#233;es (EEN) par un syst&#232;me d&#8217;&#233;-
tiquetage s&#233;mantique (ES). L&#8217;originalit&#233; du syst&#232;me pr&#233;sent&#233; r&#233;side dans l&#8217;utilisation d&#8217;une ontologie de
liaison pour relier l&#8217;entit&#233; dans son texte &#224; son instance d&#8217;une ontologie descriptive. Pour nos besoins
exp&#233;rimentaux, notre &#233;tiqueteur est reli&#233; &#224; des ontologies existantes et normalis&#233;es.
</p>
<p>L&#8217;article est structur&#233; comme suit. Dans un premier temps nous examinons les propositions existantes
de mise en relation d&#8217;une entit&#233; nomm&#233;e avec sa description s&#233;mantique. Dans un second temps nous
d&#233;crivons notre syst&#232;me et son ontologie de liaison. Dans un troisi&#232;me temps nous proc&#233;dons &#224; une &#233;valu-
ation et mesurons la capacit&#233; de notre syst&#232;me &#224; mettre en relation une instance ontologique avec un terme
contenu dans un texte. Le cadre exp&#233;rimental retenu est celui de la campagne EEN d&#8217;ESTER 2. Enfin,
nous concluons cet article en commentant les r&#233;sultats que nous avons obtenus.
</p>
<p>2 &#201;tiquetage d&#8217;entit&#233;s nomm&#233;es versus &#233;tiquetage s&#233;mantique
La masse de connaissances inter-connect&#233;es et normalis&#233;es disponibles sur le web, par exemple &#224; travers
le r&#233;seau LinkedData1 permet aujourd&#8217;hui de d&#233;crire avec pr&#233;cision les attributs de nombreux objets ou
concepts. On pourrait envisager que la mise en relation de ces connaissances avec des mots dans un texte
est le prolongement de la t&#226;che d&#8217;EEN. Pourtant il existe une diff&#233;rence essentielle entre l&#8217;entit&#233; nom-
m&#233;e (EN) dans son texte et sa repr&#233;sentation ontologique : affecter un taxon2 &#224; un objet textuel se fait en
observant son contexte. L&#8217;information qui est pr&#233;sente autour de lui (les mots, la nature des lettres - ma-
juscules, minuscules ) permettent de caract&#233;riser sa nature. Il en va tout autrement pour une repr&#233;sentation
s&#233;mantique de ce m&#234;me objet qui fait intervenir une masse de caract&#233;ristiques qui sont justement absentes
du texte. Avec la phrase Un Airbus A380 a d&#233;coll&#233; de Roissy ce matin, un syst&#232;me d&#8217;EEN correctement
entrain&#233; et configur&#233;, sait que Roissy d&#233;crit un a&#233;roport et non une ville ou une station de m&#233;tro, que l&#8217;Air-
bus est un v&#233;hicule. Mais rien ne nous indique dans cette phrase la date d&#8217;ouverture de l&#8217;a&#233;roport, le nom
des compagnies qui l&#8217;utilisent ou les caract&#233;ristiques de l&#8217;avion.
</p>
<p>2.1 Am&#233;liorations de l&#8217;arbre taxonomique d&#8217;&#233;tiquetage
Une premi&#232;re &#233;tape d&#8217;am&#233;lioration de la description s&#233;mantique des EN a consist&#233; &#224; am&#233;liorer les arbres
taxonomiques d&#8217;&#233;tiquetage, principalement pour r&#233;pondre &#224; des t&#226;ches de Question R&#233;ponses. Si nous
reprenons l&#8217;exemple plus haut Un Airbus A380 a d&#233;coll&#233; de Roissy ce matin., nous obtenons selon la
norme taxonomique d&#8217;EEN l&#8217;&#233;tiquetage suivant :
</p>
<p>Un &lt;ent=prod.vehicule&gt;Airbus A380&lt;ent/&gt; a d&#233;coll&#233; de &lt;ent=loc.fac&gt;Roissy&lt;ent/&gt; ce matin.
</p>
<p>Soit l&#8217;&#233;tiquette (prod.vehicule) attribu&#233;e &#224; un avion, (loc.fac) &#224; un a&#233;roport. On peut envisager un accroisse-
ment de la granularit&#233; taxonomique (la qualit&#233; du lieu loc.fac.airport, ou du v&#233;hicule prod.vehicule.plane).
</p>
<p>1LinkedData est un projet qui vise &#224; exposer sur le Web des donn&#233;es structur&#233;es avec les technologies du Web s&#233;mantique,
en particulier RDF, suivant les principes propos&#233;s par Tim Berners-Lee.
</p>
<p>2Dans cet article, le terme taxon d&#233;crit une &#233;tiquette compl&#232;te d&#8217;une norme d&#8217;&#233;tiquetage d&#8217;entit&#233; nomm&#233;es : pers.hum,
loc.fac, org.com sont des exemples de taxons.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTENSION D&#8217;UN SYST&#200;ME D&#8217;&#201;TIQUETAGE D&#8217;ENTIT&#201;S NOMM&#201;ES EN &#201;TIQUETEUR S&#201;MANTIQUE
</p>
<p>Plusieurs auteurs se sont engag&#233;s dans cette voie. La proposition de (Sekine et al., 2002) consistait &#224;
d&#233;velopper un arbre taxonomique de 150 types. Aujourd&#8217;hui, des arbres de 200 types et plus sont couram-
ment utilis&#233;s (voir par exemple (Rosset et al., 2007)) dans le cadre des campagnes d&#8217;&#233;valuation (Turmo
et al., 2009). La diversit&#233; de nature des entit&#233;s utiles conduit aussi des auteurs &#224; exploiter des taxonomies
d&#233;riv&#233;es de contenus encyclop&#233;diques. Un des premiers syst&#232;mes d&#8217;&#233;tiquetage permettant de mettre en
relation un objet textuel et sa cat&#233;gorie taxonomique dans Wikip&#233;dia est pr&#233;sent&#233; dans (Bunescu &amp; Pasca,
2006). Dans cette exp&#233;rience, sur les 59759 cat&#233;gories de la version de Wikip&#233;dia utilis&#233;e, 2037 sont con-
serv&#233;es. Les travaux de (Kazama &amp; Torisawa, 2007) sont de nature similaire : ils consistent &#224; exploiter, en
utilisant le m&#234;me processus d&#8217;extraction lexicale que Bunescu, un ensemble de 2000 labels de cat&#233;gories
issus de Wikip&#233;dia pour &#233;tiqueter le corpus de la campagne EEN de Conll (Tjong &amp; Meulder, 2003).
D&#8217;abord avec les 4 classes normalis&#233;es de cette campagne (Per, Loc, Org, Misc), puis en appliquant la to-
talit&#233; des classes. Les auteurs prennent n&#233;anmoins soin de pr&#233;ciser3 que cette taxonomie &#233;tendue n&#8217;est pas
forc&#233;ment tr&#232;s fiable &#224; l&#8217;usage. Finalement, bien que ces recherches conduisent &#224; am&#233;liorer la granularit&#233;
des classes attribu&#233;es &#224; des entit&#233;s - donc, de facto, &#224; affiner la compr&#233;hension de leur sens - elles n&#8217;en de-
meurent pas moins des applications de classification de mots, selon un arbre taxonomique restreint, con&#231;u
le plus souvent souvent pour r&#233;pondre aux besoins formul&#233;s dans les campagnes d&#8217;&#233;valuation (Charton &amp;
Torres-Moreno, 2009). Et cette augmentation se heurte &#224; deux limitations : elle risque de rendre la mise au
point d&#8217;&#233;tiqueteurs d&#8217;EN tr&#232;s d&#233;licate4 et un arbre taxonomique ne permet pas de repr&#233;senter les pr&#233;dicats
d&#8217;ordre sup&#233;rieurs permis par les standards de d&#233;finition actuels des ontologies.
</p>
<p>2.2 Etiquetage s&#233;mantique
Une entit&#233; d&#233;crite s&#233;mantiquement dans une ontologie a pour particularit&#233; d&#8217;&#234;tre associ&#233;e &#224; un ensemble de
propri&#233;t&#233;s d&#233;crites par des pr&#233;dicats de premier ordre (par exemple le triplet {sujet :nom de ville ;pr&#233;dicat :
population ;objet :valeur num&#233;rique}) et par des graphes lorsque les propri&#233;t&#233;s sont d&#8217;ordre sup&#233;rieur (ex-
emple, une relation entre toutes les villes de plus de 100 000 habitants). L&#8217;instance de DBpedia repr&#233;sen-
tant l&#8217;a&#233;roport de Roissy contient &#224; elle seule une centaine d&#8217;informations compl&#233;mentaires sous forme
de triplets RDF5{sujet, pr&#233;dicat, objet} (des coordonn&#233;es g&#233;ographiques, des noms de compagnies). La
particularit&#233; de l&#8217;&#233;tiquetage s&#233;mantique est qu&#8217;il consiste donc en une mise en relation d&#8217;un terme avec un
graphe, alors que l&#8217;&#233;tiquetage d&#8217;une entit&#233; nomm&#233;e rel&#232;ve de la classification de ce terme. La perspective
de transformer directement un &#233;tiqueteur d&#8217;EN en &#233;tiqueteur s&#233;mantique est donc tr&#232;s hypoth&#233;tique pour
le domaine applicatif que nous d&#233;crivons.
</p>
<p>En revanche, on peut envisager un module de compl&#233;ment s&#233;mantique d&#8217;un syst&#232;me d&#8217;EEN qui soit en
mesure de relier un objet textuel dans son document avec une description formelle et conceptuelle de cet
objet. On retrouve cette id&#233;e dans le syst&#232;me SemTAG (Dill et al., 2003). L&#8217;id&#233;e de SemTAG est de mettre
en relation automatiquement un terme contenu dans un document, avec sa description conceptuelle, via
une URI6. Le probl&#232;me du rep&#233;rage et de la d&#233;sambiguisation de l&#8217;entit&#233; dans le texte et de sa mise en
</p>
<p>3&#8220;These category labels seem to be usefull, altough there is no guarantee that the extracted category label is correct for
each candidate&#8221;.
</p>
<p>4Par exemple en augmentant le nombre de micro-classes. Les micro-classes rendent la mise au point de classifieurs
num&#233;riques difficiles pour des raisons th&#233;oriques mais aussi pratiques, lorsque le ph&#233;nom&#232;ne &#224; mod&#233;liser est trop rare pour
apparaitre suffisamment dans un corpus d&#8217;apprentissage.
</p>
<p>4http ://DBpedia.org/page/Paris-Charles_de_Gaulle_Airport
5Un triplet RDF est un pr&#233;dicat normalis&#233; par le W3C pour les applications d&#238;tes du Web S&#233;mantique.
6Un URI, de l&#8217;anglais Uniform Resource Identifier, soit Identifiant Uniforme de Ressource, est une courte cha&#238;ne de carac-
</p>
<p>t&#232;res identifiant une ressource sur un r&#233;seau, par exemple le web.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>{ERIC.CHARTON, MICHEL.GAGNON, BENOIT.OZELL}@POLYMTL.CA
</p>
<p>FIG. 1 &#8211; Le syst&#232;me propos&#233; : l&#8217;entit&#233; nomm&#233;e est associ&#233;e &#224; ses descriptions dans une ou plusieurs
ontologies du r&#233;seau LinkedData. Ici DBpedia et G&#233;onames sont reli&#233;s &#224; l&#8217;entit&#233; nomm&#233;e Montr&#233;al du
texte.
</p>
<p>relation avec une ontologie, est r&#233;solu en une seule fois par un algorithme qui combine une mesure de
similarit&#233; cosinus et un calcul de probabilit&#233; bay&#233;sienne entre les mots contextuels de l&#8217;entit&#233; candidate et
des mots contextuels probables conserv&#233;s dans l&#8217;ontologie. Ce syst&#232;me diff&#232;re de celui que nous pr&#233;sen-
tons car il hybride la t&#226;che d&#8217;EEN et celle d&#8217;&#233;tiquetage s&#233;mantique, en conservant les mots contextuels
dans la fiche ontologique. Mais les mots contextuels associ&#233;s aux objets d&#233;crits ne sont que tr&#232;s rarement
pr&#233;sents dans une ontologie standard. Ce mod&#232;le n&#8217;est donc pas adaptables aux nouvelles donn&#233;es OWL7
</p>
<p>qui apparaissent r&#233;guli&#232;rement. Ailleurs, (Kiryakov et al., 2004) argumente de mani&#232;re convaincante, en
pr&#233;sentant la plateforme KIM, que le processus d&#8217;annotation s&#233;mantique fait n&#233;cessairement entrer en jeu
un dispositif d&#8217;EEN, une ontologie (ou une base de donn&#233;es), et des normes taxonomiques. Pour cet au-
teur, la fonction d&#8217;extraction de l&#8217;entit&#233; dans son texte ne peut &#234;tre r&#233;alis&#233;e avec des &#233;l&#233;ments ontologiques.
D&#8217;autres syst&#232;mes plus r&#233;cent adoptent une architecture &#224; plusieurs niveaux qui fait entrer en jeu une pre-
mi&#232;re &#233;tape d&#8217;EEN, comme le projet ALVIS (Nazarenko et al., 2006). Face &#224; cette architecture dominante
d&#8217;&#233;tiqueteurs s&#233;mantiques associ&#233;s &#224; un &#233;tiqueteur d&#8217;EN qui semble progressivement se dessiner, des al-
ternatives sont propos&#233;es. Le syst&#232;me de (Brun &amp; Hag&#232;ge, 2009) ne cherche plus &#224; &#233;tablir un lien entre
entit&#233; et ontologie, mais &#224; relier entre elles plusieurs EN pour cr&#233;er une information tr&#232;s proche de celle
que l&#8217;on retrouve dans un triplet RDF.
</p>
<p>3 Syst&#232;me propos&#233;
L&#8217;id&#233;e principale que nous proposons dans cet article consiste &#224; relier une EN dans son texte avec sa
repr&#233;sentation s&#233;mantique. Notre contribution consiste &#224; s&#233;parer les deux t&#226;ches d&#8217;EEN et d&#8217;ES, en intro-
duisant un degr&#233; de connaissance interm&#233;diaire que nous appelons ontologie de liaison, entre l&#8217;&#233;tiqueteur
d&#8217;entit&#233;s nomm&#233;es et l&#8217;ontologie. La nature de cette ontologie de liaison est &#224; la fois statistique et con-
ceptuelle. Nous appellerons les instances de l&#8217;ontologie de liaison des m&#233;tadonn&#233;es pour les distinguer
des instances de l&#8217;ontologie descriptive. La nature statistique des m&#233;tadonn&#233;es indique qu&#8217;elles repr&#233;sen-
</p>
<p>7OWL est le format de description d&#8217;ontologies complexes regroupant des triplets RDF, d&#233;fini par le W3C dans le cadre du
Web d&#238;t S&#233;mantique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTENSION D&#8217;UN SYST&#200;ME D&#8217;&#201;TIQUETAGE D&#8217;ENTIT&#201;S NOMM&#201;ES EN &#201;TIQUETEUR S&#201;MANTIQUE
</p>
<p>L'avion d&#233;colle de Roissy
D&#233;tection de classe d'EEN 
par approche statistique
</p>
<p>loc.fac
</p>
<p>M&#233;tadonn&#233;es
DBp&#233;dia
Yago, 
...
</p>
<p>Mots contextuels:
</p>
<p>contexte
</p>
<p>Ontologie de liaison
EEN
</p>
<p>Utilisation du contexte pour
mesurer la similarit&#233;
</p>
<p>Roissy
</p>
<p>avion
d&#233;colle
a&#233;roport
...
</p>
<p>Liens vers des 
instances 
ontologiques
</p>
<p>dbpedia.Roissy
geoname.roissy
</p>
<p>...
Coordonn&#233;es
Compagnies
Nombre de vols
Chiffre d'affaire
...
</p>
<p>loc.fac
</p>
<p>FIG. 2 &#8211; Sch&#233;ma de principe de l&#8217;&#233;tiqueteur s&#233;mantique propos&#233;
</p>
<p>tent chacune un objet et lui associent des informations telles que des sacs de mots, des poids pour ces
mots, des r&#233;seaux lexicaux et non des attributs s&#233;mantiques. Ces informations permettront d&#8217;&#233;tablir un
lien entre une entit&#233; d&#233;tect&#233;e dans un texte et sa repr&#233;sentation ontologique. Chaque m&#233;tadonn&#233;e est ex-
traite depuis une fiche de encyclop&#233;dique de Wikip&#233;dia. Elle contient les mots qui composent le texte de
cette fiche avec leurs poids Tf.Idf calcul&#233; sur l&#8217;ensemble du corpus, et un ensemble de formes de surfaces
(c&#8217;est &#224; dire les &#233;critures possibles) : par exemple le lieu A&#233;roport Charles de Gaulle peut aussi &#234;tre &#233;crit
Roissy Charles de Gaulle, Roissy, CDG. Les m&#233;tadonn&#233;es sont enrichies d&#8217;un lien vers une instance de
l&#8217;ontologie descriptive, c&#8217;est &#224; dire repr&#233;sentant un objet par les attributs descriptifs de sa nature (la hauteur
d&#8217;un immeuble, la population d&#8217;une ville, etc). Dans le cadre exp&#233;rimental de cet article, nous avons reli&#233;
chaque m&#233;tadonn&#233;es avec son instance correspondante dans DBpedia (Auer et al., 2007). Mais le principe
de notre syst&#232;me est que l&#8217;ontologie de liaison doit &#234;tre consid&#233;r&#233;e comme un pivot permettant de relier
l&#8217;EN dans son texte &#224; n&#8217;importe quelle source ontologique de description la mieux appropri&#233;e (DBpedia
pour une personne, ou Bio2RDF pour un g&#232;ne, par exemple). Nous voyons plusieurs avantages &#224; cette
architecture : elle permet tout d&#8217;abord de mettre en valeur les standards &#233;mergents (RDF, OWL) propos&#233;s
par le W3C en mati&#232;re de description ontologiques. Elle permet ensuite de s&#233;parer les t&#226;ches d&#8217;EEN et
d&#8217;ES, qui rel&#232;vent d&#8217;une compr&#233;hension diff&#233;rente du texte, mais se compl&#232;tent : le syst&#232;me d&#8217;EEN est
efficace pour localiser l&#8217;entit&#233; dans le texte mais pauvre en informations, le syst&#232;me d&#8217;ES est performant
pour attribuer de l&#8217;information &#224; l&#8217;EN localis&#233;e mais est mal adapt&#233; &#224; la d&#233;tection.
</p>
<p>Le syst&#232;me que nous proposons commence par &#233;tiqueter les EN contenues dans un texte libre, selon un
proc&#233;d&#233; statistique. Il utilise pour cela une impl&#233;mentation d&#8217;un syst&#232;me de d&#233;tection d&#8217;EN &#224; base de
CRF8. Puis il met en relation les formes de surface correspondant aux EN d&#233;tect&#233;es dans le texte, avec
l&#8217;ontologie de liaison.
</p>
<p>Pour finir, un algorithme de calcul de similarit&#233; associe &#224; chaque EN localis&#233;e dans le texte, sa m&#233;tadonn&#233;e
correspondante exacte et d&#233;sambigu&#239;s&#233;e dans l&#8217;ontologie de liaison, ce qui permet d&#8217;&#233;tablir un lien direct
entre l&#8217;EN et son instance de l&#8217;ontologie descriptive (voir figure 2).
</p>
<p>8Le CRF ou Champ Conditionnel Al&#233;atoire est un mod&#232;le de graphe non orient&#233; dans lequel chaque arr&#234;te repr&#233;sente une
variable al&#233;atoire et ou chaque sommet repr&#233;sente une relation de d&#233;pendance entre deux variables al&#233;atoires. Ce mod&#232;le est
bien adapt&#233; &#224; l&#8217;identification de s&#233;quences de texte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>{ERIC.CHARTON, MICHEL.GAGNON, BENOIT.OZELL}@POLYMTL.CA
</p>
<p>3.1 Construction de l&#8217;ontologie de liaison
Consid&#233;rons le corpus Wikip&#233;dia qui est compos&#233; de plusieurs &#233;ditions linguistiques9. Chaque &#233;dition
linguistique de Wikipedia contient des articles compos&#233;s de mots, et qui sont identifi&#233;s par un titre non am-
bigu (par exemple Paris (France) ou Paris (Texas)). Ces articles peuvent &#234;tre reli&#233;s &#224; des pages d&#8217;homonymie
qui listent tous les articles correspondant &#224; un m&#234;me nom, &#224; des pages de redirections (qui associent &#224; un
article un nom alternatif, par exemple Ville lumi&#232;re&#8594;Paris). Ils peuvent &#233;galement &#234;tre reli&#233;s via des liens
dits Interwikis &#224; leurs &#233;quivalents dans d&#8217;autres &#233;ditions linguistiques. La construction d&#8217;une m&#233;tadonn&#233;e
consiste &#224; collecter toutes ces informations pour construire une repr&#233;sentation lexicale et statistique d&#8217;un
article. Une description formelle de l&#8217;algorithme de construction d&#8217;une m&#233;tadonn&#233;e E d&#8217;apr&#232;s un article
encyclop&#233;dique D peut &#234;tre r&#233;sum&#233;e comme suit10.
</p>
<p>&#8211; Nous appellerons le corpus Wikip&#233;dia C, une &#233;dition linguistique C l, les articles d&#8217;une &#233;dition linguis-
tique de Wikipedia D. Les propri&#233;t&#233;s des articles seront d&#233;crites par D = (D.t,D.w,D.l) telles que
D.t contient le titre, D.w est la collection des mots contenus dans D, et D.l est un ensemble de liens
qui relie D &#224; d&#8217;autres pages de C. Les liens de D.l correspondent aux liens de D vers des pages de
synonymes, d&#8217;homonymie, de redirection de C l ou vers C (un lien Interwiki vers l&#8217;&#233;quivalent de D dans
une autre &#233;dition linguistique de Wikip&#233;dia).
</p>
<p>&#8211; La m&#233;tadonn&#233;e E poss&#232;de les propri&#233;t&#233;s E = (E.t, E.w,E.r, E.rdf). On consid&#232;re que E et D sont
en relation si et seulement si E.t = D.t. E.w contient des duplets compos&#233;s de tous les mots de D.w
et de leur poids Tf.Idf calcul&#233;s d&#8217;apr&#232;s le corpus C l. E.r contient l&#8217;ensemble des formes de surfaces
obtenues en appliquant des heuristiques d&#8217;extractions de ces formes aux pages reli&#233;es &#224; D par D.l .
</p>
<p>L&#8217;attribut E.rdf de la m&#233;tadonn&#233;e contient un lien vers le point d&#8217;entr&#233;e au format RDF d&#8217;une instance
d&#8217;ontologie disponible sur le r&#233;seau LinkedData11. L&#8217;adoption de ce format pour E permet de rendre
l&#8217;ontologie de liaison universelle et capable de mettre en relation une EN avec n&#8217;importe quel descriptif
LinkedDdata. Pour les besoins de cette exp&#233;rience E.rdf , est d&#233;fini d&#8217;apr&#232;s D.t en utilisant le fichier de
correspondance12 entre DBpedia et Wikipedia, que nous appellons R. Pour une instance de DBpedia B, R
d&#233;crit tous les B.t = D.t. Nous savons que de E &#8594; D donc E.t = D.t, en cons&#233;quence E.rdf &#8594; B.t.
</p>
<p>3.2 Modules d&#8217;&#233;tiquetage et de mise en relation
Consid&#233;rons une norme taxonomique d&#8217;&#233;tiquetage compos&#233; d&#8217;un ensemble L de labels l. Consid&#233;rons une
phrase S contenant une s&#233;quence de mots s1...n. Dans un premier temps le syst&#232;me d&#8217;EEN recherche pour
tout sn ou suite de mots s[n,m], un label l &#8712; L. On intitule fs la forme de surface compos&#233;e du mot ou de la
suite de mots &#233;tiquet&#233;s par l. Nous savons que EN (entit&#233; nomm&#233;e) est &#233;quivalente &#224; un duplet compos&#233;
de l et de fs. Notre syst&#232;me fonctionne selon un processus en trois &#233;tapes successives que nous intitulons
EEN , REN et LEN :
</p>
<p>&#8211; 1 EEN : D&#233;tection et &#233;tiquetage de EN dans le texte en utilisant un &#233;tiqueteur.
&#8211; 2 REN : Identification dans l&#8217;ontologie de liaison de l&#8217;entr&#233;e correspondante &#224; la forme de surface fs
</p>
<p>associ&#233;e &#224; EN , par un algorithme de mesure de similarit&#233; cosinus appliqu&#233; au contexte textuel s1...n de
fs dans S.
</p>
<p>&#8211; 3 LEN : &#201;tablissement du lien entre l&#8217;entit&#233; dans le texte et son instance dans DBpedia en utilisant la
r&#233;f&#233;rence contenue dans une des metadonn&#233;es de l&#8217;ontologie de liaison.
9fr.wikipedia.org, en.wikipedia.org, par exemple, sont des &#233;ditions linguistiques diff&#233;rentes et forment des sous corpus
</p>
<p>ind&#233;pendants au sein de l&#8217;ensemble Wikip&#233;dia.
10On pourra se reporter &#224; (Charton, 2009) pour une description d&#233;taill&#233;e
11Par exemple http ://dbpedia.org/data/Spain.rdf est le point d&#8217;entr&#233;e de l&#8217;instance Espagne de DBpedia)
12wiki.DBpedia.org/Downloads34 fichier intitul&#233; Links to Wikipedia articles</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTENSION D&#8217;UN SYST&#200;ME D&#8217;&#201;TIQUETAGE D&#8217;ENTIT&#201;S NOMM&#201;ES EN &#201;TIQUETEUR S&#201;MANTIQUE
</p>
<p>Etiqueteur d&#8217;entit&#233;s nomm&#233;s (EEN )
Pour les besoins d&#8217;un syst&#232;me complet d&#8217;&#233;tiquetage s&#233;mantique, l&#8217;&#233;tiqueteur d&#8217;entit&#233;s nomm&#233;es (EEN )
peut &#234;tre n&#8217;importe quel syst&#232;me capable de localiser fs et de lui attribuer une &#233;tiquette l. Dans le d&#233;mon-
strateur13 qui d&#233;coule de la pr&#233;sente communication, le syst&#232;me utilis&#233; est une impl&#233;mentation du syst&#232;me
d&#8217;EEN robuste utilis&#233; par le LIA14 lors de la campagne ESTER 2(Galliano et al., 2009). On s&#8217;en remetra
&#224; (B&#233;chet &amp; Charton, 2010) pour une description d&#233;taill&#233;e de EEN .
</p>
<p>Mise en relation de l&#8217;EN avec Ontologie de Liaison (REN )
REN est le syst&#232;me de mise en relation de fs avec sa metadonn&#233;e repr&#233;sentante dans l&#8217;ontologie de
liaison. REN utilise les duplets {mots,Tf.Idf} contenus dans E.w d&#8217;une m&#233;tadonn&#233;e E afin de calculer
le degr&#233; de similarit&#233; entre E.w et le contexte textuel de fs dans S.
</p>
<p>Le syst&#232;me de d&#233;tection est divis&#233; en 3 algorithmes intitul&#233;s REN.1, REN.2 et REN.3 :
</p>
<p>1. REN.1 : La fonction Rm = fsynsets(fs) recherche dans les m&#233;tadonn&#233;es tous les &#233;l&#233;ments E.r =
fs et retourne une liste de E dans Rm. Nous consid&#233;rerons que si |Rm| = 1, Rm propose une
unique metadonn&#233;e candidate Ec correspondant &#224; EN (pas d&#8217;ambiguit&#233; de sens).
</p>
<p>2. REN.2 : La fonction fsimcos(Rm,S) calcule la similarit&#233; cosinus entre les s de S et tout lesE.w des
E deRm. Consid&#233;rant que la fonction de similarit&#233; cosinus cos(E.w, S) existe, nous pouvons d&#233;ter-
miner le score de l&#8217;entit&#233; candidate Ec de Rm en mesurant le cosinus de l&#8217;angle entre les vecteurs de
poids des mots correspondant &#224; Ec.w.Tf.Idf de Rm et les s.Tf.Idf de S. Nous obtenons alors une
liste tri&#233;e contenant toutes les m&#233;tadonn&#233;es candidateEc pourEN &#8712; S avec leur score de similarit&#233;.
</p>
<p>3. REN.3 : D&#233;termine la meilleure m&#233;tadonn&#233;e correspondant &#224; EN en utilisant la formule
E&#770; = argmaxEc score(cos(Ec.w, S)). Si |Rm| &gt; 1, un ensemble de m&#233;tadonn&#233;es homonymes sont
disponibles : REN.3 recherche alors E&#770;.
</p>
<p>On observe les cas suivants dans lesquels aucun lien s&#233;mantique n&#8217;est &#233;tabli entre EN et E. C&#8217;est le cas
si REN.1 n&#8217;identifie pas de m&#233;tadonn&#233;e candidate pour fsm (la forme de surface &#233;tiquet&#233;e dans le texte
n&#8217;existe pas dans les m&#233;tadonn&#233;es). C&#8217;est &#233;galement le cas quand nous appliquons un seuil de d&#233;tection
d &#224;REN.3. Seuls les r&#233;sultats de d &lt; argmaxEc score(cos(Ec.w, S.s)) seront alors retenus pour &#233;tablir
le lien entre EN et E. Ce dispositif de seuil permet notamment de rejeter les propositions d&#8217;&#233;tiquetage de
lien s&#233;mantique peu fiables dues &#224; un score final de similarit&#233; cosinus faible.
</p>
<p>&#201;tablissement du lien s&#233;mantique(LEN )
LEN est la derni&#232;re &#233;tape triviale qui consiste &#224; &#233;tablir le lien entre l&#8217;entit&#233; dans le texte et son instance
dans DBpedia en associant E.rdf de la metadonn&#233;e E&#770; de l&#8217;ontologie de liaison avec EN de S. Ce qui
permet de relier EN &#224; son instance dans l&#8217;ontologie descriptive
</p>
<p>4 Exp&#233;riences et r&#233;sultats
Nous proposons pour &#233;valuer notre syst&#232;me d&#8217;&#233;tiquetage s&#233;mantique d&#8217;associer &#224; des EN d&#233;tect&#233;es dans
un fichier de transcription de dialogues radiophoniques un lien vers leurs instances contenues dans une on-
tologie descriptive. C&#8217;est l&#8217;&#233;tablissement de ce lien qui caract&#233;rise le principe de l&#8217;&#233;tiquetage s&#233;mantique.
</p>
<p>13Consulter www.nlgbase.org/perl/nlgetiq.pl
14Ce syst&#232;me a &#233;t&#233; mis au point au LIA par Fr&#233;d&#233;ric B&#233;chet avec la contribution du premier auteur de cet article</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>{ERIC.CHARTON, MICHEL.GAGNON, BENOIT.OZELL}@POLYMTL.CA
</p>
<p>NE Test ESTER 2 m&#233;tadonn&#233;es Couverture (%)
Pers 1096 483 44%
Org 1204 764 63%
Loc 1218 1017 83%
Prod 59 23 39%
Total 3577 2287 64%
</p>
<p>TAB. 1 &#8211; Mesure de couverture des entit&#233;s contenues dans les m&#233;tadonn&#233;es en regard du corpus d&#8217;&#233;valua-
tion ESTER 2.
</p>
<p>Nous utilisons le corpus d&#8217;&#233;valuation EEN de la campagne ESTER 2 pour mener ces exp&#233;riences. La
campagne d&#8217;&#233;valuation ESTER 2 (Galliano et al., 2009) a &#233;t&#233; organis&#233;e en 2009 conjointement par l&#8217;as-
sociation Fran&#231;aise de la communication parl&#233;e (AFCP) et la DGA, avec la collaboration de l&#8217;agence de
distribution de ressources ELDA. Cette campagne &#233;tait divis&#233;e en trois t&#226;ches, segmentation, transcription
et &#233;tiquetage d&#8217;entit&#233;s nomm&#233;es. La t&#226;che d&#8217;EEN &#233;tait elle m&#234;me divis&#233;e en 4 sous t&#226;ches, la premi&#232;re con-
sistant &#224; &#233;tiqueter un syst&#232;me corrig&#233; manuellement (absence d&#8217;erreur de transcription) dit ref trancript.
Les trois autres t&#226;ches recouraient &#224; des syst&#232;mes contenant des erreurs de transcriptions d&#8217;importance
croissante afin de mesurer la robustesse des &#233;tiqueteurs d&#8217;EN. Nous utilisons comme support de nos ex-
p&#233;riences le corpus de test manuellement corrig&#233; de la premi&#232;re sous-t&#226;che, la question de la robustesse
d&#8217;EEN sortant du champs de cet article.
</p>
<p>Nous compl&#233;tons la t&#226;che d&#8217;EEN d&#8217;ESTER 2 en &#233;valuant la capacit&#233; de notre syst&#232;me &#224; associer correcte-
ment une identit&#233; s&#233;mantique &#224; une entit&#233; nomm&#233;e d&#233;j&#224; d&#233;tect&#233;e par un syst&#232;me d&#8217;EEN. Ceci revient &#224;
affecter &#224; une EN reconnue dans le corpus de test d&#8217;&#233;tiquetage d&#8217;ESTER un lien vers sa description on-
tologique dans DBpedia. Nous v&#233;rifions plusieurs aspects de notre syst&#232;me. En premier lieu que confront&#233;
&#224; un homonyme, le syst&#232;me d&#8217;&#233;tiquetage s&#233;mantique relie correctement l&#8217;EN &#224; son instance ontologique
exacte, via l&#8217;ontologie de liaison gr&#226;ce &#224; l&#8217;algorithme de d&#233;sambigu&#239;sation par mesure de similarit&#233; cosi-
nus. En second lieu, la capacit&#233; de la constante de seuil d permette bien de rejeter les propositions de lien
s&#233;mantiques non pertinents.
</p>
<p>Prise en compte du taux de couverture
</p>
<p>On doit aussi v&#233;rifier que lorsqu&#8217;il n&#8217;existe pas de donn&#233;es s&#233;mantiques &#224; relier &#224; une EEN le syst&#232;me ex-
ploite correctement sa constante de seuil et ne propose aucun lien. En effet, la couverture d&#8217;une ressource
ontologique ne peut &#234;tre compl&#232;te : certaines entit&#233;s pr&#233;sentes dans le texte du corpus ESTER 2 ne seront
pas repr&#233;sent&#233;s dans l&#8217;ontologie de liaison (principe des mots hors vocabulaires ou OOV). Ces m&#234;mes
entit&#233;s, pr&#233;sentes dans le texte mais absentes de la connaissance ontologique, peuvent pourtant &#234;tre cor-
rectement &#233;tiquet&#233;es lors de l&#8217;&#233;tape d&#8217;EEN qui agit par inf&#233;rence d&#8217;apr&#232;s un contexte, et peut donc &#233;tiqueter
correctement un groupe de mots sans le connaitre au pr&#233;alable. Pour ces EN, il existe une impossibilit&#233;
mat&#233;rielle &#224; &#234;tre correctement associ&#233;es &#224; un lien s&#233;mantique puisque ce dernier n&#8217;existe pas. Pour &#233;valuer
ce degr&#233; d&#8217;impossibilit&#233; nous avons calcul&#233; le taux de couverture des objets connus dans les m&#233;tadon-
n&#233;es de l&#8217;ontologie de liaison pour toutes les EN pr&#233;sentes dans le corpus d&#233;valuation d&#8217;ESTER 2. Nous
obtenons le r&#233;sultat indiqu&#233; par le tableau 1.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTENSION D&#8217;UN SYST&#200;ME D&#8217;&#201;TIQUETAGE D&#8217;ENTIT&#201;S NOMM&#201;ES EN &#201;TIQUETEUR S&#201;MANTIQUE
</p>
<p>M&#233;thode
La mesure de pr&#233;cision et de rappel est r&#233;alis&#233;e d&#8217;apr&#233;s un compl&#233;ment d&#8217;&#233;tiquetage de la r&#233;f&#233;rence du
corpus d&#233;valuation d&#8217;ESTER 2, indiquant pour chaque EN son lien vers les m&#233;tadonn&#233;es. Ce compl&#233;ment
a &#233;t&#233; r&#233;alis&#233; par m&#233;thode semi-automatique. Notre &#233;valuation consiste &#224; mesurer dans un premier temps
pour les 64% d&#8217;entit&#233;s du corpus de test EEN ESTER 2 poss&#233;dant une repr&#233;sentation correspondante dans
l&#8217;ontologie de liaison la capacit&#233; du syst&#232;me &#224; &#233;tablir un lien entre une m&#233;tadonn&#233;e de l&#8217;ontologie de
liaison et la forme de surface de l&#8217;EN dans son texte. C&#8217;est &#224; dire le bon fonctionnement de l&#8217;algorithme
REN . Dans un second temps, nous &#233;valuons la capacit&#233; de REN avec la constante de seuil d &#224; rejeter les
EN qui ne poss&#232;dent pas de repr&#233;sentation ontologique.
</p>
<p>4.1 R&#233;sultats
Les r&#233;sultats obtenus sont indiqu&#233;s dans le tableau 2. Les r&#233;sultats de mise en relation d&#8217;une entit&#233; d&#233;j&#224;
correctement &#233;tiquet&#233;e, avec sa repr&#233;sentation dans DBpedia, en utilisant la ressource ontologique de
liaison sont pr&#233;cis &#224; 95%. Ce r&#233;sultat indique que la m&#233;thode de calcul de similarit&#233; cosinus d&#233;sambigu&#239;se
correctement l&#8217;entit&#233; dans son contexte. Les r&#233;sultats de mise en relation d&#8217;une entit&#233; dans un texte ouvert,
c&#8217;est &#224; dire dans lequel toutes les repr&#233;sentations ontologiques ne sont pas forc&#233;ment disponibles, laisse
appara&#238;tre une l&#233;g&#232;re baisse de pr&#233;cision et un rappel affaibli de 1 &#224; 5% pour les trois entit&#233;s principales
(Pers, Org, Loc). L&#8217;affectation d&#8217;un lien s&#233;mantique &#224; l&#8217;entit&#233; Prod est particuli&#232;rement difficile en milieu
ouvert. Ce dernier cas peut &#234;tre consid&#233;r&#233; comme particulier, &#233;tant &#224; la fois sous-repr&#233;sent&#233; dans le corpus
ESTER 2 et d&#233;j&#224; connu comme pr&#233;sentant une difficult&#233; d&#8217;apprentissage15.
</p>
<p>NE [TEP] Pr&#233;cision Rappel [TEC] Pr&#233;cision Rappel
Pers 483 0,96 0,96 1096 0,94 0,91
Org 764 0,93 0,91 1204 0,96 0,90
Loc 1017 0,97 0,94 1218 0,94 0,92
Prod 23 0,96 0,60 59 0,61 0,50
Total 2287 0,95 0,93 3577 0,94 0,9
</p>
<p>TAB. 2 &#8211; [TEP] R&#233;sultats de l&#8217;&#233;tiqueteur s&#233;mantique appliqu&#233; uniquement aux &#233;tiquettes de r&#233;f&#233;rence de
ESTER 2 ayant une correspondance dans les m&#233;tadonn&#233;es - [TEC] R&#233;sultats avec application au corpus
d&#8217;&#233;valuation de ESTER 2 complet.
</p>
<p>5 Conclusion et perspectives
Nous avons pr&#233;sent&#233; un syst&#232;me d&#8217;&#233;tiquetage s&#233;mantique (SE) utilisable pour compl&#233;ter un syst&#232;me d&#8217;&#233;ti-
quetage par entit&#233;s nomm&#233;es (EEN). Ce syst&#232;me 16 utilise des m&#233;tadonn&#233;es de nature statistique contenues
dans une ontologie de liaison construite d&#8217;apr&#232;s la ressource encyclop&#233;dique Wikip&#233;dia. Une mesure de
similarit&#233; cosinus a &#233;t&#233; mise en oeuvre pour &#233;tablir un lien entre une entit&#233; nomm&#233;e (EN) &#233;tiquet&#233;e dans
sa phrase et sa repr&#233;sentation ontologique standardis&#233;e dans la ressource DBpedia. Cette m&#233;thode nous
a permis d&#8217;associer &#224; 94% des entit&#233;s nomm&#233;es (EN) du corpus d&#8217;&#233;valuation de la campagne ESTER 2,
connues dans Wikip&#233;dia, un lien vers leur description ontologique dans DBpedia. Nous envisageons main-
tenant d&#8217;int&#233;grer dans un syst&#232;me complet, un &#233;tiqueteur d&#8217;EN associ&#233; &#224; l&#8217;&#233;tiqueteur s&#233;mantique pr&#233;sent&#233;
ici, compl&#233;t&#233;s par un un analyseur s&#233;mantique.
</p>
<p>15Voir les r&#233;sultats d&#233;taill&#233;s de la campagne ESTER sur ce sujet.
16Utilisable en ligne sur www.nlgbase.org/perl/nlgetiq.pl.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>{ERIC.CHARTON, MICHEL.GAGNON, BENOIT.OZELL}@POLYMTL.CA
</p>
<p>R&#233;f&#233;rences
</p>
<p>AUER S., BIZER C., KOBILAROV G., LEHMANN J. &amp; IVES Z. (2007). DBpedia : A Nucleus for a Web
of Open Data. In In 6th Int&#8217;l Semantic Web Conference, Busan, Korea, p. 11&#8211;15 : Springer.
</p>
<p>B&#201;CHET F. L. &amp; CHARTON E. (2010). Unsupervised knowledge acquisition for extracting named enti-
ties from speech. In ICASSP 2010, Dallas : ICASSP.
</p>
<p>BRUN C. &amp; HAG&#200;GE C. (2009). Semantically-Driven Extraction of Relations between Named Entities.
In Cicling 2009, Mexico : Cicling.
</p>
<p>BUNESCU R. &amp; PASCA M. (2006). Using encyclopedic knowledge for named entity disambiguation. In
Proceedings of EACL, volume 6.
</p>
<p>CHARTON E. (2009). Combinaison de contenus encyclop&#233;diques multilingues pour une reconnaissance
d&#8217;entit&#233;s nomm&#233;es en contexte. In Recital, number 1, p. 24&#8211;26.
</p>
<p>CHARTON E. &amp; TORRES-MORENO J. (2009). Classification d&#8217;un contenu encyclop&#233;dique en vue d&#8217;un
&#233;tiquetage par entit&#233;s nomm&#233;es. In Taln 2010, volume 1, p. 24&#8211;26 : TALN.
</p>
<p>DILL S., EIRON N., GIBSON D., GRUHL D., GUHA R., JHINGRAN A., KANUNGO T., RAJAGOPALAN
S., TOMKINS A., TOMLIN J. &amp; OTHERS (2003). SemTag and Seeker : Bootstrapping the semantic web
via automated semantic annotation. In Proceedings of the 12th international conference on World Wide
Web, p. 186 : ACM.
</p>
<p>GALLIANO S., GRAVIER G. &amp; CHAUBARD L. (2009). The ESTER 2 Evaluation Campaign for the
Rich Transcription of French Radio Broadcasts. In European Conference on Speech Communication and
Technology, p. 2583&#8211;2586 : Interspeech 2010.
</p>
<p>KAZAMA J. &amp; TORISAWA K. (2007). Exploiting Wikipedia as external knowledge for named entity
recognition. In Proceedings of the 2007 Joint Conference on Empirical Methods in Natural Language
Processing and Computational Natural Language Learning (EMNLP-CoNLL), p. 698&#8211;707.
</p>
<p>KIRYAKOV A., POPOV B., TERZIEV I., MANOV D. &amp; OGNYANOFF D. (2004). Semantic annotation,
indexing, and retrieval. Web Semantics : Science, Services and Agents on the World Wide Web, 2(1),
49&#8211;79.
</p>
<p>NAZARENKO A., NEDELLEC C., ALPHONSE E., AUBIN S., HAMON T. &amp; MANINE A. P. (2006).
Semantic annotations in the Malvis Project. In International Workshop on Intelligent Information Access,
Helsinky.
</p>
<p>ROSSET S., GALIBERT O., ADDA G. &amp; BILINSKI E. (2007). The LIMSI participation to the QAst
track. In Working Notes of CLEF Workshop, ECDL conference, number System 1, p. 414&#8211;423 : Springer.
</p>
<p>SEKINE S., SUDO K. &amp; NOBATA C. (2002). Extended named entity hierarchy. In Proceedings of the
LREC-2002 Conference, p. 1818&#8211;1824 : Citeseer.
</p>
<p>TJONG E. &amp; MEULDER F. D. (2003). Introduction to the conll-2003 shared task : Language-independent
named entity recognition. In In CoNLL.
</p>
<p>TURMO J., COMAS P., ROSSET S., GALIBERT O., MOREAU N., MOSTEFA D., ROSSO P. &amp; BUS-
CALDI D. (2009). Overview of QAST 2009. In Proceedings of the CLEF 2009 Workshop on Cross-
Language Information Retrieval and Evaluation.
</p>
<p>ZOUAQ A. &amp; GAGNON M. (2010). Semantic Analysis using Dependency-based Grammars and Upper-
Level Ontologies. In CICLING 2010 : CICLING.</p>

</div></div>
</body></html>