<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>The iMAG concept: multilingual access gateway to an elected Web sites with incremental quality increase through collaborative post-edition of MT pretranslations</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>The iMAG concept: multilingual access gateway to an elected Web sites with incremental
quality increase through collaborative post-edition of MT pretranslations
</p>
<p>Demo presentation (French version included, obtained by MT + postediting with an iMAG)
Christian BOITET, HUYNH Cong Phap, NGUYEN Hong Thai, Val&#233;rie BELLYNCK
</p>
<p>{ Christian.Boitet, Cong-Phap.Huynh, Hong-Thai.Nguyen, Valerie.Bellynck}@imag.fr
</p>
<p>GETALP, LIG-campus (UJF, CNRS, INPG, INRIA, UPMF)
BP 53, 38041 GRENOBLE cedex 9, France
</p>
<p>TALN-2010, Montr&#233;al, 19-23/7/10
Abstract
We will demonstrate iMAGs (interactive Multilingual Access Gateways), in particular on a scientific laboratory web site and
on the Greater Grenoble (La M&#233;tro) web site.
Keywords
Interactive translation gateway, iMAG, MT post-editing, collaborative translation
Presentation
The iMAG concept has been proposed by Ch.!Boitet and V. Bellynck in 2006 (Boitet &amp;!al. 2008, Boitet
&amp;!al. 2005), and reached prototype status in November 2008, with a first demonstration on the LIG
laboratory Web site.  It has been adapted to the DSR (Digital Silk Road) Web site in April 2009, and then to
30 other Web sites.  These first prototypes are extensions of the SECTra_w (Huynh &amp;!al. 2008) online
translation corpora support system.
An iMAG is an interactive Multilingual Access Gateway very much like Google Translate at first sight: one
gives it a URL (starting Web site) and an access language and then navigates in that access language. When
the cursor hovers over a segment (usually a sentence or a title), a palette shows the source segment and
proposes to contribute by correcting the target segment, in effect post-editing an MT result. With Google
Translate, the page does not change after contribution, and if another page contains the same segment, its
translation is still the rough MT result, not the polished post-edited version.  The more recent Google
Translation Toolkit enables one to MT-translate and then post-edit online full Web pages from sites such as
Wikipedia, but again the corrected segments don't appear when one later browses the Wikipedia page in the
access language.
By contrast, an iMAG is dedicated to an elected Web site, or rather to the elected sublanguage defined by
one or more URLs and their textual content.  It contains a translation memory (TM) and a specific,
preterminological dictionary (pTD), both dedicated to the elected sublanguage.  Segments are pretranslated
not by a unique MT system, but by a (selectable) set of MT systems. Systran and Google are mainly used
now, but specialized systems developed from the postedited part of the TM will be also used in the future.
The powerful online contributive platforms SECTra_w and PIVAX (Nguyen &amp;!al. 2007) are used to support
the TMs and pTDs.  Translated pages are built with the best segment translations available so far. While
reading a translated page, it is possible not only to contribute to the segment under the cursor, but also to
seamlessly switch to SECTra_w online post-edition environment, equipped with proactive dictionary help
and good filtering and search-and-replace functions, and then back to the reading context.
A translation relay is being implemented to define the iMAGs or other translation gateways used by an
elected Web site, select and parameterize the MT systems and translation routes used for various language
pairs, and manage users, groups, projects (some contributions may be organized, other opportunistic), and
access rights.  Finally, MT systems tailored to the selected sublanguage can be built (by combinations of
empirical and expert methods) from the TM and the pTD dedicated to a given elected Web site.  That
approach will inherently raise the linguistic and terminological quality of the MT results, hopefully</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Demo on iMAGs (interactive Multilingual Access Gateways) Ch. Boitet, C. P. Phap, H. T. Nguyen, V.!Bellynck
</p>
<p>converting them from rough into raw translations.  The demonstration will use some iMAGs created by the
AXiMAG startup for various Web sites, such as  those o f  the  LIG lab
(http://service.aximag.fr:8180/xwiki/bin/view/imag/liglab) and of La Metro (Greater Grenoble) web site
(http://service.aximag.fr:8180/xwiki/bin/view/imag/lametro), where access in Chinese and English is enabled
for the Shanghai Expo.  
In this written presentation, we will apply the iMAG technique to the presentation itself. It was first written in
English under Word, in file TALN-2010-Demo-iMAG-v2_en.rtf. We then saved it in html and put the result
(TALN-2010-Demo-iMAG-v2_en.htm) online (www-clips.imag.fr/geta/User/christian.boitet/iMAGs-tests/en).
We accessed it through the corresponding iMAG (http://service.aximag.fr:8180/xwiki/bin/view/imag/xan-en).
Choosing French as access language, and tuning some parameters, we got the following view.
</p>
<p>Figure 1!: &#233;cran d'une iMAG apr&#232;s TA, pr&#233;sentation parall&#232;le
</p>
<p>Note the colored curly brackets enclosing the French segments. They appear on demand (&#8220;reliability&#8221;
checkbox). Red indicates an MT output, green an postedition by a certified translator, and orange a
postedition by somebody knowing the two languages to a certain level, and usually contributing on an
occasional and volunteer basis. After postediting some segments directly on the Web page, we obtain the
following state (notice some green brackets).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Demo on iMAGs (interactive Multilingual Access Gateways) Ch. Boitet, C. P. Phap, H. T. Nguyen, V.!Bellynck
</p>
<p>Figure 2!: &#233;cran d'une iMAG apr&#232;s post&#233;dition directe de quelques segments sur une page Web
</p>
<p>Having logged on as a &#8220;certified&#8221; contributor, we could continue in &#8220;advanced mode&#8221;, switching to the
SECTra_w online postedition environment, under which postedition is much faster (specialized lexical help
is not available until the corpus of postedited segments is large enough, so that it is not shown here).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Demo on iMAGs (interactive Multilingual Access Gateways) Ch. Boitet, C. P. Phap, H. T. Nguyen, V.!Bellynck
</p>
<p>Figure 3!: &#233;cran d'une iMAG apr&#232;s post&#233;dition indirecte sous SECTra_w d&#8217;autres segments
</p>
<p>After having postedited the whole presentation, we extracted the current French version from SECtra_w.
After a simple manipulation (to be automated in the future), the text was obtained in a bilingual table:
By contrast, an iMAG is dedicated to an elected Web
site, or rather to the elected sublanguage defined by
one or more URLs and their textual content.
</p>
<p>En revanche, une IMAG est d&#233;di&#233;e &#224; un site Web &#233;lu,
ou plut&#244;t au sous-langage &#233;lu d&#233;fini par une ou
plusieurs URL et leur contenu textuel.
</p>
<p>   It contains a translation memory (TM) and a
specific, preterminological dictionary (pTD), both
dedicated to the elected sublanguage.
</p>
<p>Elle contient une m&#233;moire de traductions (MT) et un
dictionnaire sp&#233;cifique preterminologique (pTD), les
deux d&#233;di&#233;s au sous-langage &#233;lu.
</p>
<p>   Segments are pretranslated not by a unique MT
system, but by a (selectable) set of MT systems.
Systran and Google are mainly used now, but
specialized systems developed from the postedited
part of the TM will be also used in the future.
</p>
<p>Les segments sont pr&#233;traduits non pas par un syst&#232;me
de TA unique, mais par un ensemble (s&#233;lectionnable)
de syst&#232;mes de TA. Systran et Google sont
principalement utilis&#233;s aujourd'hui, mais des syst&#232;mes
sp&#233;cialis&#233;s d&#233;velopp&#233;s &#224; partir de la MT post&#233;dit&#233;e
seront &#233;galement utilis&#233;s dans l'avenir.
</p>
<p>Figure 4!: excerpt of a bilingual aligned text extracted from an iMAG-translated target Web page
</p>
<p>After 15 more minutes of formatting, we got the French text that follows. References are factorized after the
French version as the custom is not to translate them when translating between English and French.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Demo on iMAGs (interactive Multilingual Access Gateways) Ch. Boitet, C. P. Phap, H. T. Nguyen, V.!Bellynck
</p>
<p>Le concept d'iMAG: passerelle d'acc&#232;s multilingue &#224; un site Web &#233;lu avec accroissement
incr&#233;mental de la qualit&#233; par post-&#233;dition collaborative de pr&#233;traductions automatiques
</p>
<p>Pr&#233;sentation d'une d&#233;monstration (version fran&#231;aise obtenue par TA + post&#233;dition avec une iMAG)
Christian BOITET, HUYNH Cong Phap, NGUYEN Hong Thai, Val&#233;rie BELLYNCK
</p>
<p>{Christian.Boitet, Cong-Phap.Huynh, Hong-Thai.Nguyen, Valerie.Bellynck}@imag.fr
</p>
<p>GETALP, LIG-campus (UJF, CNRS, INPG, INRIA, UPMF)
BP 53, 38041 GRENOBLE cedex 9, France
</p>
<p>TALN-2010, Montr&#233;al, 19-23/7/10
R&#233;sum&#233;
Nous pr&#233;senterons des iMAG (interactive multilingual Access Gateways), en particulier sur un site Web d'un
laboratoire scientifique et sur le site Web de l'agglom&#233;ration grenobloise (La M&#233;tro). Cette pr&#233;sentation
bilingue a &#233;t&#233; obtenue en utilisant une iMAG.
Mots-cl&#233;s
Passerelle de traduction interactive, IMAG, post-&#233;dition de TA, traduction collaborative
Pr&#233;sentation
Le concept d'IMAG a &#233;t&#233; propos&#233; par M. Ch. Boitet et V. Bellynck en 2006 (Boitet &amp;!al. 2008, Boitet &amp;!al.
2005), et a atteint l'&#233;tat de prototype en novembre 2008, avec une premi&#232;re d&#233;monstration sur le site Web du
laboratoire LIG. Il a &#233;t&#233; adapt&#233; au site Web DSR (Digital Silk Road) en avril 2009, puis &#224; 30 autres sites
Web. Ces premiers prototypes sont des extensions du syst&#232;me SECTra_w (Huynh &amp;!al. 2008) de support en
ligne de corpus de traductions.
Une iMAG est une passerelle interactive d'acc&#232;s multilingue (interactive Multilingual Access Gateway),
ressemblant beaucoup &#224; Google Translate, &#224; premi&#232;re vue: on donne une URL (site Web de d&#233;part) et une
langue d'acc&#232;s, et on navigue ensuite dans cette langue d'acc&#232;s. Lorsque le curseur passe sur un segment (le
plus souvent une phrase ou un titre), une palette montre le segment source et propose de contribuer en
corrigeant le segment cible, en fait en post-&#233;ditant un r&#233;sultat de TA. Avec Google Translate, la page ne
change pas apr&#232;s la contribution, et si une autre page contient le m&#234;me segment, sa traduction est toujours le
r&#233;sultat de TA grossi&#232;re, pas la version polie post-&#233;dit&#233;e. La bo&#238;te &#224; outils de traduction plus r&#233;cente Google
Translation Toolkit permet de traduire par TA et ensuite de post&#233;diter en ligne des pages Web compl&#232;tes
tir&#233;es de sites tels que Wikipedia, mais de nouveau, les segments corrig&#233;s n'apparaissent pas quand on
regarde plus tard la page de Wikipedia dans la langue d'acc&#232;s.
En revanche, une IMAG est d&#233;di&#233;e &#224; un site Web &#233;lu, ou plut&#244;t au sous-langage &#233;lu d&#233;fini par une ou
plusieurs URL et leur contenu textuel. Elle contient une m&#233;moire de traductions (MT) et un dictionnaire
sp&#233;cifique preterminologique (pTD), les deux d&#233;di&#233;s au sous-langage &#233;lu. Les segments sont pr&#233;traduits non
pas par un syst&#232;me de TA unique, mais par un ensemble (s&#233;lectionnable) de syst&#232;mes de TA. Systran et
Google sont principalement utilis&#233;s aujourd'hui, mais des syst&#232;mes sp&#233;cialis&#233;s d&#233;velopp&#233;s &#224; partir de la MT
post&#233;dit&#233;e seront &#233;galement utilis&#233;s dans l'avenir.
Les plates-formes contributives puissantes SECTra_w et PIVAX (Nguyen &amp;!al. 2007) sont utilis&#233;es pour
supporter les MT et les pTD. Les pages traduites sont construites avec les meilleures traductions des
segments disponibles &#224; ce jour. Pendant la lecture d'une page traduite, il est possible non seulement de
contribuer au segment sous le curseur, mais aussi de passer de fa&#231;on transparente sous l'environnement de
post&#233;dition en ligne de SECTra_w, muni d'une aide dictionnairique proactive et de bonnes fonctions de
filtrage et de recherche-remplacement, et ensuite de revenir dans le contexte de lecture.
Un relais de traduction est en cours d'impl&#233;mentation pour d&#233;finir les iMAG ou d'autres passerelles de
traduction utilis&#233;es par un site Web &#233;lu, pour s&#233;lectionner et param&#233;trer les syst&#232;mes de TA et les itin&#233;raires
utilis&#233;s pour la traduction des diff&#233;rentes paires de langues, et pour g&#233;rer les utilisateurs, les groupes, les</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Demo on iMAGs (interactive Multilingual Access Gateways) Ch. Boitet, C. P. Phap, H. T. Nguyen, V.!Bellynck
</p>
<p>projets (certaines contributions peuvent &#234;tre organis&#233;es, d'autres opportunistes), et les droits d'acc&#232;s. Enfin,
des syst&#232;mes de TA faits sur mesure pour le sous-langage s&#233;lectionn&#233; peuvent &#234;tre construits (par la
combinaison de m&#233;thodes empiriques et expertes) &#224; partir de la MT et la du pTD d&#233;di&#233;s &#224; un site Web &#233;lu
donn&#233;. Cette approche accro&#238;tra intrins&#232;quement la qualit&#233; linguistique et terminologique des r&#233;sultats de
TA, en les transformant de traductions grossi&#232;res en traductions brutes. La d&#233;monstration utilisera des iMAG
cr&#233;&#233;es par la jeune pousse AXiMAG pour divers sites Web, tels que ceux du laboratoire LIG
(http://service.aximag.fr:8180/xwiki/bin/view/imag/liglab) et du site Web de La M&#233;tro (agglom&#233;ration
grenobloise) (http://service.aximag.fr:8180/xwiki/bin/view/imag/lametro), o&#249; l'acc&#232;s en chinois et en anglais
est activ&#233; pour l'Expo de Shanghai.
Dans cette pr&#233;sentation &#233;crite, nous allons appliquer la technique iMAG &#224; la pr&#233;sentation elle-m&#234;me. Elle a
d'abord &#233;t&#233; &#233;crite en anglais sous Word, dans le fichier TALN-2010-Demo-IMAG-v2_en.rtf. Nous l'avons
ensuite sauv&#233;e en format html, et avons mis le r&#233;sultat (TALN-2010-Demo-IMAG-v2_en.htm) en ligne
(www-clips.imag.fr/geta/User/christian.boitet/iMAGs-tests/en). Nous y avons acc&#233;d&#233; par l'interm&#233;diaire de
l'iMAG correspondante (http://service.aximag.fr:8180/xwiki/bin/view/imag/xan-en).
Apr&#232;s avoir choisi le fran&#231;ais comme langue d'acc&#232;s, et r&#233;gl&#233; certains param&#232;tres, nous avons obtenu la vue
suivante &#8212;!voir Figure 1.
Notez les accolades de couleur entourant les segments fran&#231;ais. Elles apparaissent &#224; la demande (case &#224;
cocher &quot;fiabilit&#233;&quot;). Le rouge indique une sortie de TA, le vert une post&#233;dition par un traducteur certifi&#233;, et
l'orange une post&#233;dition par quelqu'un connaissant les deux langues &#224; un certain niveau, et de contribuant
g&#233;n&#233;ralement de fa&#231;on occasionnelle et &#224; titre b&#233;n&#233;vole. Apr&#232;s avoir post&#233;dit&#233; certains segments directement
sur la page Web, on obtient l'&#233;tat suivant (notez certains crochets verts) &#8212; voir Figure 2.
Apr&#232;s nous &#234;tre connect&#233; en tant que contributeur &quot;certifi&#233;&quot;, nous avons pu continuer en mode &quot;avanc&#233;&quot;, en
passant sous l'environnement de post&#233;dition en ligne de SECTra_w, sous lequel la post&#233;dition est beaucoup
plus rapide (l'aide lexicale sp&#233;cialis&#233;e n'est pas disponible jusqu'&#224; ce que le corpus de segments postedit&#233;s
soit assez grand, donc elle n'est pas montr&#233;e ici) &#8212;!voir Figure 3.
Apr&#232;s avoir post&#233;dit&#233; toute la pr&#233;sentation, nous avons extrait la version fran&#231;aise courante de SECtra_w,.
Apr&#232;s une manipulation simple (qui sera automatis&#233;e dans le futur), le texte a &#233;t&#233; dans un tableau bilingue!:
By contrast, an iMAG is dedicated to an elected Web
site, or rather to the elected sublanguage defined by
one or more URLs and their textual content.
</p>
<p>En revanche, une IMAG est d&#233;di&#233;e &#224; un site Web &#233;lu,
ou plut&#244;t au sous-langage &#233;lu d&#233;fini par une ou
plusieurs URL et leur contenu textuel.
</p>
<p>   It contains a translation memory (TM) and a
specific, preterminological dictionary (pTD), both
dedicated to the elected sublanguage.
</p>
<p>Elle contient une m&#233;moire de traductions (MT) et un
dictionnaire sp&#233;cifique preterminologique (pTD), les
deux d&#233;di&#233;s au sous-langage &#233;lu.
</p>
<p>   Segments are pretranslated not by a unique MT
system, but by a (selectable) set of MT systems.
Systran and Google are mainly used now, but
specialized systems developed from the postedited
part of the TM will be also used in the future.
</p>
<p>Les segments sont pr&#233;traduits non pas par un syst&#232;me
de TA unique, mais par un ensemble (s&#233;lectionnable)
de syst&#232;mes de TA. Systran et Google sont
principalement utilis&#233;s aujourd'hui, mais des syst&#232;mes
sp&#233;cialis&#233;s d&#233;velopp&#233;s &#224; partir de la MT post&#233;dit&#233;e
seront &#233;galement utilis&#233;s dans l'avenir.
</p>
<p>Figure 5!: partie d'un texte bilingue align&#233; extrait d'une page Web cible traduite par une iMAG
</p>
<p>Les r&#233;f&#233;rences ont &#233;t&#233; factoris&#233;es apr&#232;s la version en fran&#231;ais car la coutume est de ne pas traduire les
r&#233;f&#233;rences entre anglais et fran&#231;ais.
References
BOITET, C., Y. BEY et K. KAGEURA (2005) Main research issues in building web services for mutualized, non-commercial translation.
</p>
<p>Proc. SNLP-05, Bangkok, Chulalongkorn university, 13 p.
BOITET, C., V. BELLYNCK, M. MANGEOT et C. RAMISCH (2008) Towards Higher Quality Internal and Outside Multilingualization of
</p>
<p>Web Sites. Proc. ONII-08 (Summer Workshop on Ontology, NLP, Personalization and IE/IR), Mumbai, Centre for Indian
Language Technology (CFILT), IITB (Indian Institute of Technology Bombay), 9 p.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Demo on iMAGs (interactive Multilingual Access Gateways) Ch. Boitet, C. P. Phap, H. T. Nguyen, V.!Bellynck
</p>
<p>HUYNH, C.-P., C. BOITET et H. BLANCHON (2008) SECTra_w : an Online Collaborative System for Evaluating, Post-editing and
Presenting MT Translation Corpora. Proc. LREC-08, Marrakech, 8 p.
</p>
<p>NGUYEN, H.-T., C. BOITET et G. S&#201;RASSET (2007) PIVAX, an online contributive lexical database for heterogeneous MT systems
using a lexical pivot. Proc. SNLP-07, Pattaya, Kasetsart University, 6 p.
</p>
<p>Appendix: screenshots of two other iMAGs / images d'&#233;cran de deux autres iMAG
</p>
<p>Figure 6: demonstration on the LIG (Grenoble Informatics Laboratory &#8212; Laboratoire d'Informatique de Grenoble) web site</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Demo on iMAGs (interactive Multilingual Access Gateways) Ch. Boitet, C. P. Phap, H. T. Nguyen, V.!Bellynck
</p>
<p>Figure 7: demonstration on the La M&#233;tro (Greater Grenoble) web site</p>

</div></div>
</body></html>