<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L'int&#233;gration d'un outil de rep&#233;rage d'entit&#233;s nomm&#233;es pour la langue arabe dans un syst&#232;me de veille</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>L'int&#233;gration d'un outil de rep&#233;rage d'entit&#233;s nomm&#233;es pour la langue arabe 
dans un syst&#232;me de veille 
</p>
<p> 
Wajdi Zaghouani    
</p>
<p> Linguistic Data Consortium, 3600 Market street suite 810, Philadelphia, USA 
wajdiz@ldc.upenn.edu  
</p>
<p> 
</p>
<p>R&#233;sum&#233;.  Dans cette d&#233;monstration, nous pr&#233;sentons l'impl&#233;mentation d'un outil de rep&#233;rage d'entit&#233;s 
nomm&#233;es &#224; base de r&#232;gle pour la langue arabe dans le syst&#232;me de veille m&#233;diatique EMM (Europe Media 
Monitor). 
</p>
<p>Abstract.  We will present in this demo an Arabic rule-based named entity recogntion tool which is 
integrated within the news monitoring system EMM (Europe Media Montior).  
</p>
<p> 
</p>
<p>Mots-cl&#233;s :   &#201;tiquetage des entit&#233;s nomm&#233;es, langue arabe, syst&#232;me de veille m&#233;diatique. 
Keywords:   Named entity recognition, Arabic language, news monitoring system. 
 
</p>
<p>1 Pr&#233;sentation du syst&#232;me de veille m&#233;diatique EMM 
</p>
<p>Le syst&#232;me de veille m&#233;diatique EMM parcourt quotidiennement une moyenne de 100 000 articles en 50 
langues diff&#233;rentes provenant de plus de 900 sites Web (Steinberger et al., 2009). Il permet de regrouper les 
articles couvrant le m&#234;me sujet, fusionnant ces articles automatiquement en un seul groupe afin d&#8217;&#233;viter la 
redondance des nouvelles en n&#8217;affichant qu&#8217;un seul &#233;v&#233;nement pour plusieurs articles traitant le m&#234;me sujet. 
Le syst&#232;me fonctionne comme un syst&#232;me d&#8217;information et d&#8217;alerte m&#233;diatique en temps r&#233;el permettant 
d&#8217;avoir un aper&#231;u quotidien des nouvelles &#224; travers le monde, tout en affichant les informations sous un format 
lisible et permettant l&#8217;acc&#232;s rapide au contenu pertinent d&#8217;un article donn&#233; (cf. figure 1). Derri&#232;re le syst&#232;me 
EMM il existe une panoplie d&#8217;outils et de modules multilingues, comme les modules de repr&#233;sentation 
graphique, les outils d&#8217;analyse statistique, le g&#233;n&#233;rateur du r&#233;seau social des personnes ou le module de 
rep&#233;rage des entit&#233;s nomm&#233;es (EN). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Wajdi Zaghouani 
</p>
<p> 
</p>
<p>Figure 1 : L'environnement EMM 
</p>
<p>2 Pr&#233;sentation de RENAR 
</p>
<p>RENAR est un outil de rep&#233;rage des EN &#224; base de r&#232;gles que nous avons cr&#233;&#233; sp&#233;cifiquement pour la langue 
arabe (Zaghouani et al., 2010). Il est totalement int&#233;gr&#233; dans l'environnement EMM &#224; l'instar des autres 
langues (Pouliquen et al., 2005). Le processus de rep&#233;rage (cf. figure 2) commence par une &#233;tape de 
pr&#233;traitement lexical qui permet de pr&#233;parer le texte brut &#224; l'analyse linguistique en segmentant tout d'abord le 
texte en phrases, puis en normalisant son orthographe. Par la suite, l&#8217;op&#233;ration d&#8217;extraction des EN se fait sur 
deux &#233;tapes : la premi&#232;re &#233;tape est bas&#233;e sur la consultation directe du lexique qui se compose de plusieurs 
dictionnaires. Lors de cette &#233;tape, le syst&#232;me commence par la comparaison de chaque entr&#233;e dans le texte 
brut avec chacune des entr&#233;es des diff&#233;rents dictionnaires que nous avons construits. Une fois une EN 
reconnue gr&#226;ce &#224; un dictionnaire, elle sera automatiquement retenue sans passer par la deuxi&#232;me &#233;tape, qui est 
r&#233;serv&#233;e exclusivement &#224; la d&#233;tection des EN ne figurant pas dans le lexique. La deuxi&#232;me &#233;tape repose sur 
des fichiers de r&#232;gles &#233;crites &#224; la main sous forme d&#8217;expressions r&#233;guli&#232;res qui permettent de d&#233;tecter les EN 
gr&#226;ce aux dictionnaires et &#224; la liste des marqueurs lexicaux qui sont des indices textuels permettant de localiser 
les EN dans un texte.  
</p>
<p>3 Disponibilit&#233; 
</p>
<p>L'acc&#232;s &#224; l'environnement EMM y compris l'outil RENAR est propos&#233; gratuitement &#224; la communaut&#233; sous 
forme de page Web1. Par contre, EMM et RENAR ne sont pas disponibles sous forme de source pour le 
grand public.  
</p>
<p>                                               
1 L'environnement EMM et RENAR sont accessible sur :  &lt;http://emm.newsexplorer.eu/NewsExplorer/home/ar/latest.html&gt; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L'int&#233;gration d'un outil de rep&#233;rage d'entit&#233;s nomm&#233;es pour la langue arabe dans un syst&#232;me de veille 
</p>
<p> 
</p>
<p>Figure 2 : Architecture de RENAR 
</p>
<p>4 Aper&#231;u de la d&#233;monstration et &#233;quipement n&#233;cessaire 
</p>
<p>La d&#233;monstration ne demandera pas d&#8217;&#233;quipement particulier mis &#224; part un ordinateur et une connexion 
Internet. Les participants auront le mat&#233;riel n&#233;cessaire pour naviguer sur le portail EMM et d&#233;couvrir les 
diff&#233;rentes fonctionnalit&#233;s du module RENAR.  
</p>
<p>La figure 3 illustre l'environnement EMM avec la page en langue arabe qui int&#232;gre l'outil RENAR, les EN 
de type pays et personnes sont affich&#233;es dans des sections r&#233;serv&#233;es &#224; la droite de l'&#233;cran.  La figure 4 
illustre des d&#233;tails sur un exemple d'une entit&#233; nomm&#233;e trouv&#233;e. 
</p>
<p> 
</p>
<p>Figure 3 : L'environnement EMM avec RENAR </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>WAJDI ZAGHOUANI 
 
</p>
<p> 
</p>
<p>Figure 4 : Illustration d'un exemple d'entit&#233; nomm&#233;e 
</p>
<p> 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>POULIQUEN B., STEINBERGER R., IGNAT C., TEMNIKOVA I., WIDIGER A., ZAGHOUANI W. &amp; &#381;I&#381;KA J. (2005). 
Multilingual person name recognition and transliteration. CORELA, Poitiers, France, CERLICO. ISSN 
1638-5748. Volume 3/3, num&#233;ro 2, pp. 115-123. 
</p>
<p>STEINBERGER R., POULIQUEN B. &amp;  VAN DER GOOT E. (2009). An Introduction to the Europe Media 
Monitor Family of Applications. In Gey F., Kando N. &amp; Karlgren J. (eds.): Information Access in a 
Multilingual World - dans Proceedings of the SIGIR 2009 Workshop (SIGIR-CLIR'2009). Boston, USA. 
</p>
<p>ZAGHOUANI W., POULIQUEN B., EBRAHIM M. &amp; STEINBERGER R. (2010). Adapting a resource-light highly 
multilingual Named Entity Recognition system to Arabic, dans Proceedings of LREC 2010, Valetta, Malta. </p>

</div></div>
</body></html>