<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Th&#233;saurus et corpus de sp&#233;cialit&#233; sciences du langage : approches lexicom&#233;triques appliqu&#233;es &#224; l&#8217;analyse de termes en corpus</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010
</p>
<p>Th&#233;saurus et corpus de sp&#233;cialit&#233; sciences du langage : approches 
lexicom&#233;triques appliqu&#233;es &#224; l&#8217;analyse de termes en corpus
</p>
<p>Evelyne Jacquey, Laurence Kister, Mick Grzesitchak, Bertrand Gaiffe, Coralie 
Reutenauer, Sandrine Ollinger, Mathieu Valette1
</p>
<p>UMR ATILF-CNRS-Nancy Universit&#233;, 44 avenue de la lib&#233;ration 54000 NANCY
Evelyne.Jacquey@atilf.fr, Laurence.Kister@atilf.fr
</p>
<p>R&#233;sum&#233;  Cet article  s'inscrit  dans les recherches sur l'exploitation de ressources terminologiques pour 
l'analyse de textes de sp&#233;cialit&#233;, leur annotation et leur indexation. Les ressources en pr&#233;sence sont, d'une 
part, un thesaurus des Sciences du Langage, le Thesaulangue et, d'autre part, un corpus d&#8217;&#233;chantillons issus 
de cinq ouvrages relevant du m&#234;me domaine. L'article a deux objectifs. Le premier est de d&#233;terminer dans 
quelle mesure les termes de Thesaulangue sont repr&#233;sent&#233;s dans les textes. Le second est d'&#233;valuer si les 
occurrences  des  unit&#233;s  lexicales  correspondant  aux  termes  de  Thesaulangue  rel&#232;vent  majoritairement 
d'emplois terminologiques ou de langue courante. A cette fin, les travaux pr&#233;sent&#233;s utilisent une mesure de 
richesse lexicale telle qu'elle a &#233;t&#233; d&#233;finie par Brunet (rapport&#233; dans Muller, 1992) dans le domaine de la 
lexicom&#233;trie, l'indice W. Cette mesure est adapt&#233;e afin de mesurer la richesse terminologie (co-occurrents 
lexicaux et s&#233;mantiques qui apparaissent dans Thesaulangue).
</p>
<p>Abstract This article aims to contribute to the field of the exploitation of terminological resources for the 
analysis of technical and scientific texts, their annotation and their indexation. The available resources are on 
one hand a thesaurus, Thesaulangue, which deals with Linguistics, and on the other hand, a corpus made of 
samples extracted from five books about Linguistics. More precisely, the article has two goals: first, studying 
how to determine which terms of Thesaulangue occur in texts. Second, attempting to measure if the lexical 
units which correspond to terms of Thesaulangue are used in texts in a terminological way or not. In this 
perspective, the presented work uses and adapts the Brunet&#8217;s W-index designed in the area of lexicometry.
</p>
<p>Mots-cl&#233;s :   s&#233;mantique lexicale, terminologie, corpus, richesse lexicale, lexicom&#233;trie
Keywords:   lexical semantics, terminology, corpora, lexical richness, lexicometry
</p>
<p>1 Nous tenons &#224; remercier chaleureusement les trois &#233;valuateurs de cet article qui, par leurs remarques pr&#233;cises et argument&#233;es, ont su nous aiguiller pour 
am&#233;liorer, nous l'esp&#233;rons, la pr&#233;cision du contenu et de la structure de celui-ci. Tout &#233;l&#233;ment faux ou incompr&#233;hensible r&#233;siduel est, bien s&#251;r, de notre enti&#232;re 
responsabilit&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JACQUEY ET. AL
</p>
<p>1 Probl&#233;matique et d&#233;marche de travail
L'augmentation de la quantit&#233; de donn&#233;es textuelles scientifiques, notamment gr&#226;ce &#224; l'accroissement des 
publications en ligne et via le recensement des publications dans la base HAL, ouvrent de nombreuses 
perspectives dont la  classification et  l'indexation d'articles et/ou d'ouvrages scientifiques,  notamment &#224; 
destination des centres de documentation. De plus, chaque domaine scientifique est en constante &#233;volution 
et  de  plus  en  plus  d&#8217;interp&#233;n&#233;trations  entre  domaines  apparaissent  car  de  nombreuses  questions  sont 
abord&#233;es de mani&#232;re multi- ou interdisciplinaire. La difficult&#233; bien connue associ&#233;e &#224; ces &#233;volutions r&#233;side 
dans la faible pr&#233;cision de l&#8217;information obtenue, lors d'une recherche bibliographique, par exemple, sa 
non  exhaustivit&#233;  et  sa  r&#233;sistance  &#224;  une  repr&#233;sentation  synth&#233;tique.  Dans  la  lign&#233;e  des  travaux  de 
(Aussenac-Gilles et al. 2000), qui ont montr&#233; la possibilit&#233; d&#8217;indexer et de classifier des documents &#224; partir  
de ressources terminologiques, nous nous proposons d&#8217;exploiter un th&#233;saurus en Sciences du Langage, le 
Thesaulange2, sur un corpus de linguistique. L'objectif est de d&#233;finir une m&#233;thodologie d&#8217;utilisation de ce 
th&#233;saurus pour contribuer &#224; l'indexation et &#224; la classification de documents du m&#234;me domaine. Cependant, 
pour atteindre cet objectif, il est n&#233;cessaire de r&#233;aliser une d&#233;sambigu&#239;sation des occurrences des unit&#233;s 
lexicales  dans  les  textes  lorsque  celles-ci  correspondent  &#224;  des  termes  de  Thesaulangue.  En  effet,  le 
thesaurus utilis&#233; est compos&#233; de formes lexicales de termes, non d&#233;finies, organis&#233;es hi&#233;rarchiquement 
dans 19 micro-domaines. Lorsque dans un texte, m&#234;me de sp&#233;cialit&#233;, appara&#238;t une unit&#233; lexicale dont la 
forme correspond &#224; celle d'un terme de Thesaulangue, on peut se demander &#224; la suite de (L'Homme, 2004) 
si cette occurrence rel&#232;ve du langage courant ou s&#8217;il est de nature terminologique. Lorsque l'emploi &#233;tudi&#233; 
est  terminologique,  on  peut  consid&#233;rer  que  l'on  est  face  &#224;  une  occurrence  de  terme.  Dans  les  deux 
exemples ci-dessous &#224; l'inverse, transformation et moyen ne sont pas des occurrences de termes bien que 
leur forme puisse correspondre &#224; deux termes de Thesaulangue dans le micro-domaine de la syntaxe. Ils 
sont employ&#233;s ici comme des lex&#232;mes non sp&#233;cialis&#233;s.
</p>
<p>1. L&#8217;apparition  de  la  grammaire  th&#233;orique  proc&#232;de  d&#8217;un  besoin  de  r&#233;gularit&#233;  ;  mais  la 
transformation qu&#8217;elle op&#232;re est plus illusoire que r&#233;elle. [Bally, Le langage et la vie, 1952]
</p>
<p>2. D&#8217;une part, l&#8217;emploi constant du m&#234;me mot au milieu d&#8217;un contexte identique risque d&#8217;&#233;garer 
l&#8217;esprit, qui, n&#8217;ayant pas le moyen de pr&#233;ciser par comparaison la valeur du mot, est expos&#233; &#224; la 
modifier. [Vendryes, Langage, 1921]
</p>
<p>Pour d&#233;terminer la nature terminologique des occurrences d'unit&#233;s lexicales correspondant &#224; des termes de 
Thesaulangue,  la  d&#233;marche  g&#233;n&#233;rale  consiste  &#224;  les  rep&#233;rer  automatiquement  dans  les  textes,  puis  &#224; 
examiner  leur  environnement  lexical  &#224;  l'&#233;chelle  du  paragraphe.  Nous  y  mesurons  la  quantit&#233;  d'unit&#233;s 
lexicales  de  formes  diff&#233;rentes  correspondant  &#224;  d'autres  termes  de  Thesaulangue.  Nous  faisons  alors 
l'hypoth&#232;se que plus cette quantit&#233; est importante (nous reviendrons par la suite sur la mani&#232;re dont cette 
quantit&#233; est mesur&#233;e), plus les unit&#233;s lexicales &#233;tudi&#233;es se rapprochent d'un emploi terminologique, donc 
peuvent  &#234;tre  consid&#233;r&#233;es  comme  des  occurrences  de  termes.  Enfin,  pour  un  terme  donn&#233;,  plus  les 
occurrences de sa forme lexicale sont consid&#233;r&#233;es comme terminologiques, plus ce terme sera consid&#233;r&#233; 
comme un indice fiable pour l'indexation du texte, et plus pr&#233;cis&#233;ment pour l'indexation des paragraphes 
dans lesquels ce terme appara&#238;t.
Enfin, puisque le thesaurus utilis&#233; comporte uniquement des formes lexicales de termes non d&#233;finies, nous  
utilisons une seconde ressource terminologique. Cette seconde ressource (Gaiffe et al. 2009) est le r&#233;sultat 
de l'extraction des d&#233;finitions  du dictionnaire de langue g&#233;n&#233;rale,  le TLFi,  lorsque celles-ci d&#233;pendent 
directement  ou  par  h&#233;ritage  de  l'un  des  domaines  suivants  :  grammaire,  lexicographie,  lexicologie, 
linguistique,  philologie,  phon&#233;tique,  phonologie,  rh&#233;torique,  s&#233;miologie,  s&#233;miotique,  stylistique, 
toponymie3.  La comparaison entre les deux ressources terminologiques, le Thesaulangue qui est structur&#233; 
et l'extraction du TLFi qui comporte des d&#233;finitions,  permet d'associer une d&#233;finition &#224; 307 termes de 
2 Ce th&#233;saurus a &#233;t&#233; int&#233;gr&#233; au portail Termsciences accessible sur le site de l'INIST : http://www.termsciences.fr/. Il comporte 872 termes organis&#233;s dans 19 
</p>
<p>micro-domaines  dont  par  exemple  &quot;syntaxe&quot;,  &quot;s&#233;mantique&quot;,  &quot;s&#233;miotique&quot;,  etc.  Dans  la  suite,  nous avons choisi,  par  commodit&#233;,   d'appeler  &quot;micro-
thesaurus&quot; chaque ensemble de termes relevant d'un des micro-domaines de Thesaulangue. 
</p>
<p>3 Les domaines dont nous parlons sont des &#233;l&#233;ments balis&#233;s dans la micro-structure des entr&#233;es du TLFi donc ais&#233;ment rep&#233;rables.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>THESAURUS ET CORPUS
Thesaulangue, tous micro-domaines confondus. Dans la lign&#233;e de travaux pr&#233;c&#233;dents comme (Bourigault 
et Slodzian 1999) ou (Poibeau 2005), nous situons notre probl&#233;matique &#224; l&#8217;intersection de la terminologie 
et de la linguistique textuelle. Pour l&#8217;annotation s&#233;mantique de notre corpus, nous utilisons les d&#233;finitions 
comme une ressource de traits s&#233;mantiques qualifiant les 307 termes de Thesaulangue. Cette ressource est 
d&#233;sormais appel&#233;e TermTLF. Pour pouvoir &#224; nouveau examiner l'environnement, non plus lexical, mais 
infra-lexical  (traits  s&#233;mantiques)  des  unit&#233;s  lexicales  dont  la  forme  correspond  &#224;  un  terme  de 
Thesaulangue, les textes du corpus sont annot&#233;s s&#233;mantiquement &#224; l&#8217;aide des traits s&#233;mantiques issus de 
l'ensemble  du  TLFi.  Pour  d&#233;terminer  la  nature  terminologique  ou  non  des  occurrences  des  formes 
correspondant &#224; des termes de Thesaulangue, la m&#234;me hypoth&#232;se est appliqu&#233;e mais cette fois en mesurant 
la quantit&#233; de traits s&#233;mantiques de TermTLF qui figurent dans les paragraphes environnants : la mesure de 
richesse est calcul&#233;e avec N, le nombre d'occurrences de traits s&#233;mantiques issus du TLFi et sp&#233;cifiques 
dans  l'environnement  et  V,  parmi  ces  traits  s&#233;mantiques,  ceux  qui  appartiennent  &#224;  la  ressource 
terminologique, TermTLF. 
</p>
<p>2 Donn&#233;es et outils de la d&#233;marche 
Le corpus utilis&#233; comporte 150.000 occurrences environ et correspond au regroupement de cinq &#339;uvres : 
Cours de Linguistique G&#233;n&#233;rale (F. de Saussure, 1916 [1965], Payot),  Le langage et la vie (Ch. Bally, 
1913 [1952], Droz),  Le Langage (A. Martinet, &#233;d.,  1968, Gallimard),  La linguistique (J.  Perrot, 1963, 
PUF) et Langage (Vendryes, 1921, La Renaissance du Livre). Ces &#339;uvres ont &#233;t&#233; choisies car elles sont 
disponibles et  balis&#233;es dans la base FRANTEXT. Bien que ce corpus soit  peu &#233;tendu et relativement 
ancien (1913-1968), il est suffisant pour mettre au point la m&#233;thodologie g&#233;n&#233;rale de notre approche4.
Le thesaurus utilis&#233; est un extrait de Thesaulangue. Nous avons choisi de consid&#233;rer cinq micro-thesaurus 
parmi les 19 que compte Thesaulangue : s&#233;miotique (201 termes) et syntaxe (185 termes) parce qu'ils 
comportent un tr&#232;s grand nombre de termes - lexicologie, phon&#233;tique et s&#233;mantique (29, 46 et 43 termes) 
parce qu'ils comportent relativement peu de termes. De plus, ces cinq micro-thesaurus ont des structures 
diff&#233;rentes  dans  Thesaulangue.  Phon&#233;tique  et  s&#233;miotique  sont  faiblement  structur&#233;s  (4  niveaux  de 
profondeur maximum et une concentration de termes respectivement aux niveaux 3 et 4). A l'inverse pour 
syntaxe,  lexicologie  et  s&#233;mantique,  on  observe  une  courbe  en  cloche  atteignant  son  maximum au(x) 
niveau(x) interm&#233;diaire(s).  Enfin,  les termes de ces micro-thesaurus ont des pourcentages de pr&#233;sence 
dans les textes assez diff&#233;rents : de 48 &#224; 41% des termes des trois plus petits micro-thesaurus sont pr&#233;sents  
(lexicologie, phon&#233;tique, s&#233;mantique) alors que les termes des deux plus grands sont pr&#233;sents &#224; environ 
26%.
</p>
<p>L'annotation s&#233;mantique est effectu&#233;e par la plateforme SEMY (Grzesitchak et al., 2008) qui utilise les 
traits  s&#233;mantiques  issus  des  d&#233;finitions  du  TLFi  par  s&#233;lection  des  formes  lemmatis&#233;es  des  lex&#232;mes 
s&#233;mantiquement  pleins,  &#224;  savoir  les  adjectifs,  les  adverbes,  les  noms et  les  verbes.  Pour  toute  forme 
lemmatis&#233;e d'un texte et de m&#234;me cat&#233;gorie que les traits s&#233;mantiques du lexique, l'annotation consiste &#224; 
adjoindre &#224; cette forme l'ensemble des traits s&#233;mantiques de l'entr&#233;e du dictionnaire correspondante. Ainsi, 
la  forme  transformation re&#231;oit  comme  &#233;tiquettes  s&#233;mantiques  l'ensemble  des  traits  s&#233;mantiques  des 
d&#233;finitions de la vedette TRANSFORMATION dans le TLFi : /passage/, /phrase/, /forme/, /grammatical/, /r&#232;gle/, 
etc. 
</p>
<p>Le degr&#233; de pr&#233;sence de toute forme lexicale, celle d'un terme ou celle de n'importe quel lex&#232;me de la 
langue, est obtenue par le biais d'un calcul de sp&#233;cificit&#233;, calcul lui aussi r&#233;alis&#233; par SEMY dans la ligne 
des travaux de (Lafon, 1980) et qui fournit des r&#233;sultats comparables &#224; ceux obtenus par le logiciel de 
lexicom&#233;trie  Lexico3  (Lebart  &amp; Salem,  1994).  Le  calcul  de  sp&#233;cificit&#233;  &#233;tant  &#233;tabli  au  niveau  lexical 
(formes) et infra-lexical (traits s&#233;mantiques), les r&#233;sultats obtenus sont les co-occurrents sp&#233;cifiques du 
&quot;voisinage&quot; d'un terme, au niveau lexical et infra-lexical. Le voisinage d'un terme correspond l&#8217;ensemble 
des  paragraphes  qui  contiennent  un  terme donn&#233;,  par  texte  et  sur  l&#8217;ensemble  du  corpus.  L&#8217;int&#233;r&#234;t  de 
</p>
<p>4 Dans un futur proche, celle-ci sera appliqu&#233;e sur un corpus scientifique et contemporain des sciences du langage (en particulier &#224; l'aide des r&#233;sultats du 
projet ANR Scientext qui a r&#233;cemment mis &#224; disposition le corpus scientifique constitu&#233; avec notamment 143 documents relevant de la linguistique, HDR,  
th&#232;ses,  articles  scientifiques  et  communication)  ainsi  que sur  un corpus contemporain de  vulgarisation en Sciences  du Langage (revue des Sciences 
Humaines, convention en cours de discussion).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JACQUEY ET. AL
disposer de listes de co-occurrents sp&#233;cifiques est de pouvoir se focaliser sur l&#8217;analyse de l&#8217;information 
lexicale et infra-lexicale (les traits s&#233;mantiques) qui est la plus significative5. 
La mesure de la quantit&#233; de formes ou de traits s&#233;mantiques de Thesaulangue au voisinage d&#8217;un 
terme est &#233;tablie, &#224; la suite de (Ollinger et Valette, 2010), sur la base de l&#8217;indice W de Brunet rapport&#233;  
dans (Muller, 1992) et initialement destin&#233; &#224; comparer la richesse lexicale de plusieurs textes. A la lumi&#232;re 
des travaux de (Mouelhi, 2007), l&#8217;indice de Brunet fournit des r&#233;sultats significativement proches de la loi  
binomiale de Muller, mais est d&#8217;une r&#233;alisation nettement plus simple. De plus, comme la m&#233;thode de 
Muller, celle de Brunet permet de r&#233;duire l&#8217;influence des disparit&#233;s de taille entre les textes &#224; comparer. Or, 
dans le corpus que nous utilisons, les textes de Martinet et de Saussure repr&#233;sentent environ 80% de la  
totalit&#233;, le texte de Bally repr&#233;sente 12% et ceux de Perrot et Vendryes, respectivement 3 et 4%. 
Le calcul de la richesse lexicale selon la m&#233;thode de Brunet passe par le calcul de l'indice W avec W = NV-&#0;  
:  W est  &#233;gal  au  nombre  d'occurrences  d'un  texte  (N)  &#233;lev&#233;  &#224;  la  puissance  V, le  nombre  de  formes  
diff&#233;rentes de ce texte, lui-m&#234;me &#233;lev&#233; &#224; la puissance (- &#945;), un coefficient estim&#233; par Brunet &#224; (- 0,172) 
pour les r&#233;sultats les plus fiables. La richesse lexicale Rlex est alors &#233;gale &#224; l'inverse de l'indice W, r&#233;sultat  
que nous multiplions par 100 pour faciliter la lecture.  On trouvera dans le tableau suivant, le relev&#233; des 
donn&#233;es observ&#233;es6.
</p>
<p>Bally Martinet Perrot Saussure Vendryes Totaux
Occurrences 8358 17437 2110 37508 2803 68216
Formes 3393 3593 1081 9654 1466 19187
Lexicologie 7 8 5 10 5 35
Phon&#233;tique 10 10 6 16 1 43
S&#233;mantique 7 10 4 9 4 34
S&#233;miotique 21 31 5 24 11 92
Syntaxe 38 34 15 45 17 149
Nb_termes 83 93 35 104 38 353
</p>
<p>Fig.1 - Fr&#233;quences et types observ&#233;s de termes pr&#233;sents par micro-thesaurus et par texte
</p>
<p>En adaptant la m&#233;thode de Brunet, nous avons ainsi calcul&#233; une mesure de richesse terminologique  Rterm, 
avec  N  correspondant  au  nombre  de  formes  diff&#233;rentes  du  texte  et  V  correspondant  au  nombre 
d'occurrences de formes de termes dans Thesaulangue ou de traits s&#233;mantiques appartenant &#224; la seconde 
ressource terminologique TermTLF7. 
</p>
<p>3 R&#233;sultats
Richesse terminologique des textes du corpus et contributions respectives des micro-thesaurus : la 
comparaison de la richesse lexicale et de la richesse terminologique (Fig. 2) fait appara&#238;tre un contraste 
marqu&#233;  entre  deux  extr&#234;mes  :  Saussure  est  le  plus  riche  lexicalement,  mais  le  plus  pauvre 
terminologiquement, tandis qu&#8217;on observe l&#8217;inverse pour Martinet.
</p>
<p>5 Afin d'&#233;clairer la n&#233;cessit&#233; de choisir l'information analys&#233;e, nous dirons simplement que le corpus annot&#233; en traits s&#233;mantiques est environ 23 fois plus  
&#233;tendu que le corpus brut. Un simple jeu de fr&#233;quences ne permet pas d'analyser le contenu lexical et s&#233;mantique sur l'unique s&#233;lection des co-occurrents 
fr&#233;quents.
</p>
<p>6 Le total est occurrences du corpus est inf&#233;rieur &#224; la taille initialement mentionn&#233;e de 150.000 car nous avons indiqu&#233; uniquement le nombre d'occurrences  
&#233;tiquet&#233;es en traits s&#233;mantiques par SEMY. Nous rappelons que SEMY ignore toutes les occurrences de mots grammaticaux et n'&#233;tiquette que les adjectifs,  
les adverbes, les noms et les verbes.
</p>
<p>7 Pour l'&#339;uvre de Bally par exemple, Rterm est calcul&#233;e avec N=3393 et V=83.
</p>
<p> Bally Martinet Perrot Saussure Vendryes
Rlex 10,8 9,1 10,0 11,3 10,4
</p>
<p>Rterm 2,2 2,3 2,2 1,6 2,0
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>THESAURUS ET CORPUS
Fig.2 - Richesse lexicale et terminologique des cinq textes du corpus
</p>
<p>Pour expliquer ce premier r&#233;sultat, on peut tout d'abord noter que 50 ans environ s&#233;parent ces deux textes. 
Le  Cours  de Saussure a &#233;t&#233; en r&#233;alit&#233; &#233;crit par ses &#233;diteurs &#224; partir  des notes du troisi&#232;me cours (1910-
1911) prises par un de ses &#233;tudiants, Albert Riedlinger. D'autre part,  Thesaulangue a d&#233;but&#233; en m&#234;me 
temps que la r&#233;alisation du TLFi et la constitution du fonds documentaire de l'InalF. Il en r&#233;sulte une mise 
au point  de Thesaulangue allant de 1960 &#224; nos jours, puisque le thesaurus est r&#233;guli&#232;rement maintenu et 
compl&#233;t&#233;. Par cons&#233;quent, la disparit&#233; de la richesse terminologique observ&#233;e peut s'expliquer par un &#233;cart 
tant  en  terme  de  temps  qu&#8217;en  terme  de  maturit&#233;  scientifique,  entre  les  &#339;uvres.  A l'appui  de  cette 
explication, on peut ajouter que le second texte le moins riche terminologiquement du point de vue du 
calcul pr&#233;sent&#233; est celui de Vendryes, tr&#232;s ancien lui aussi puisque nous travaillons avec une &#233;dition de 
1921.
De mani&#232;re transversale, les richesses terminologiques par texte et par micro-thesaurus (Fig. 3) montrent 
que le micro-thesaurus de la syntaxe est le plus pr&#233;sent globalement et en particulier pour Bally, Martinet 
et Perrot. A l&#8217;autre extr&#234;me, le micro-thesaurus de la lexicologie est le moins pr&#233;sent, en particulier chez 
Saussure.
</p>
<p>Bally
</p>
<p>Martinet
</p>
<p>Perrot
</p>
<p>Saussure
</p>
<p>Vendryes
</p>
<p>corpus
</p>
<p>0 0,2 0,4 0,6 0,8 1 1,2 1,4
</p>
<p>lexicologie
Phon&#233;tique
s&#233;mantique
s&#233;miotique
syntaxe
</p>
<p>Fig. 3 - Richesse terminologique des cinq micro-thesaurus dans les cinq textes du corpus
</p>
<p>Cependant, comme pr&#233;cis&#233; pr&#233;c&#233;demment, les mesures pr&#233;sent&#233;es sont &#233;tablies sur la base de la pr&#233;sence 
ou non des formes des termes des cinq micro-thesaurus. Or, les occurrences de ces formes peuvent ou non 
relever d'un emploi terminologique. La section suivante a pour objectif de contribuer &#224; discriminer entre 
emplois terminologiques et emplois de langue courante.
</p>
<p>Caract&#232;re terminologique des occurrences de formes de termes dans les textes : afin de d&#233;terminer 
dans  quelle  mesure  les  occurrences  de  formes  de  termes  de  Thesaulangue  rel&#232;vent  d'un  emploi 
terminologique ou non, nous avons fait l'hypoth&#232;se suivante : plus les occurrences de la forme d'un terme 
sont  environn&#233;es  d'autres  formes  de  termes  dans  le  m&#234;me  paragraphe,  plus  ces  occurrences  seront  
consid&#233;r&#233;es  comme  terminologiques,  de  m&#234;me  sur  le  plan  des  traits  s&#233;mantiques. Nous  adaptons 
maintenant cette hypoth&#232;se en disant que  le caract&#232;re terminologique des occurrences d'une forme de  
terme peut &#234;tre approch&#233; par la richesse terminologique des paragraphes qui contiennent cette forme. Afin 
d'&#233;valuer  cette  hypoth&#232;se,  nous  proc&#233;dons  comme  pr&#233;c&#233;demment  &#224;  une  mesure  de  la  richesse 
terminologique des paragraphes contenant chaque occurrence de forme de terme pour les deux micro-
thesaurus de la lexicologie et de la syntaxe, respectivement le moins pr&#233;sent et le plus pr&#233;sent dans les 
textes (cf. Fig. 3).
La mesure de richesse est obtenue &#224; partir de l'indice W de Brunet avec N, le nombre total de formes co-
occurrentes sp&#233;cifiques autour des formes de termes de chaque micro-thesaurus pr&#233;sentes dans les textes, 
et V, le nombre de ces formes qui sont des termes dans Thesaulangue. De m&#234;me, pour mesurer la richesse 
terminologique  au  niveau  infra-lexical  (traits  s&#233;mantiques),  le  m&#234;me  calcul  est  appliqu&#233;  mais  en 
confrontant les traits s&#233;mantiques sp&#233;cifiques co-occurrents (N) et parmi eux, ceux qui appartiennent &#224; 
TermTLF, la ressource terminologique en traits s&#233;mantiques. 
</p>
<p>Pour  la  lexicologie  (Fig.  4),  on  observe  ainsi  que  des  termes  potentiellement  peu  ambigus  comme 
dictionnaire ont une richesse terminologique forte par rapport &#224; la moyenne. De mani&#232;re plus &#233;tonnante, le </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JACQUEY ET. AL
terme notions figure en bonne place. Comme le montre l'exemple &#171;  Et d'abord on se souviendra que les  
notions sur lesquelles op&#232;re la linguistique &#187;, provenant de Bally, cette occurrence ou forme peut &#234;tre 
employ&#233;e comme terme. En revanche, la position du terme mots est peu &#233;tonnante &#233;tant donn&#233; le nombre 
de contextes non terminologiques dans  lesquels  il  peut  appara&#238;tre.  Pour la  syntaxe8,  les  r&#233;sultats  sont 
comparables : des termes comme transformation (R_formes = 4,55) ou moyen (R_formes = 4,2), dont la 
forme est tr&#232;s ambigu&#235; entre occurrences de terme et de langue g&#233;n&#233;rale, ont une richesse terminologique 
fortement  n&#233;gative  par  rapport  &#224;  la  moyenne (Moy_R_formes  =  9,44).  A l'inverse,  un  terme comme 
pr&#233;position (R_formes = 16,67), moins ambigu potentiellement et de mani&#232;re av&#233;r&#233;e dans les textes, se 
trouve dans une position sym&#233;trique, c'est-&#224;-dire caract&#233;ris&#233; par une richesse terminologique fortement 
positive par rapport &#224; la moyenne.  
</p>
<p>dictionnaire
</p>
<p>notions
</p>
<p>syntagmatique
</p>
<p>rapports
</p>
<p>analogie
</p>
<p>exemple
</p>
<p>mots
</p>
<p>-10 -5 0 5 10 15
</p>
<p>Ecart_Moy_Fo
Ecart_Moy_Tr
</p>
<p>Fig 4 - Richesse terminologique des termes de la lexicologie
</p>
<p>4 Conclusion
A l'aide des mesures de richesse terminologique, adapt&#233;es de la mesure de richesse lexicale de Brunet, 
nous pouvons  &#233;tablir  une  &#233;chelle  de fiabilit&#233;  de la  pr&#233;sence  d'une  forme de  terme selon  l'heuristique 
suivante :  plus les richesses terminologiques, au niveau lexical et infra-lexical, sont au-dessus de leur  
moyenne respective pour les paragraphes contenant une forme de terme T, plus les occurrences de ce  
terme dans les textes pourront &#234;tre consid&#233;r&#233;es comme un bon indicateur du micro-domaine dans lequel ce  
terme est positionn&#233; dans Thesaulangue.  Cependant, ces travaux pourraient &#234;tre poursuivis dans deux 
directions. D'une part, il serait utile de pouvoir mesurer le caract&#232;re terminologique de chaque occurrence 
de  forme  de  terme  :  pour  cela,  la  mesure  de  richesse  pr&#233;sent&#233;e  pourrait  &#234;tre  calcul&#233;e  pour  chaque 
paragraphe et compar&#233;e avec la m&#233;thode de d&#233;sambigu&#239;sation lexicale adapt&#233;e de (V&#233;ronis 2003). D'autre 
part, la ressource terminologique lexicale, Thesaulangue, n'est pas satisfaisante en l'&#233;tat pour l'indexation 
et la classification manuelle par les documentalistes, notamment du fait de l'absence &#233;tonnante de certains 
termes. Ainsi, le terme moyen ne figure pas dans les valeurs possibles de voix dans le micro-thesaurus de la 
syntaxe,  mais  il  appara&#238;t  uniquement  comme  un  type  possible  du  terme  r&#233;f&#233;rant  aux  subordonn&#233;es 
circonstancielles. Or, comme le montre l'extrait de Saussure ci-dessous, cette lecture est possible et elle est 
de nature terminologique.
</p>
<p>3. Dans le parfait grec, &#224; c&#244;t&#233; de l&#8217;actif  *P&#233;pheuga,  *P&#233;pheugas, *Peph&#233;ugamen, etc.,   tout le  
moyen se fl&#233;chit sans *A :  * * , et la langue d&#8217;*Hom&#232;re nous montre que cet *A manquait  
anciennement au pluriel et au duel de l&#8217;actif / * * /.
</p>
<p>Par  cons&#233;quent,  il  pourrait  &#234;tre  int&#233;ressant  d'adapter  la  m&#233;thodologie  pr&#233;sent&#233;e  afin  de  proposer  de 
nouveaux  termes  pour  int&#233;gration  dans  Thesaulangue.  Mais  pour  pouvoir  proposer  une  int&#233;gration 
accompagn&#233;e d&#8217;une proposition de position,  il  serait  n&#233;cessaire  de calculer  la  richesse terminologique 
relativement  &#224;  un  m&#234;me  micro-thesaurus  et  non  plus  seulement  relativement  &#224;  Thesaulangue  ou  &#224; 
TermTLF dans son ensemble.
</p>
<p>8 Ce micro-thesaurus comporte 185 termes dont 59 sont pr&#233;sents de mani&#232;re sp&#233;cifique dans le corpus. Faute de place, les donn&#233;es  ne sont pas  reproduites  
ici.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>THESAURUS ET CORPUS
R&#233;f&#233;rences
AUSSENAC-GILLES N.,  BOURIGAULT D.  (2000).  The  Th(IC)2  Initiative  :  Corpus-Based  Thesaurus  Construction  for 
Indexing WWW Documents.  Proceedings  EKAW&#8217;2000 workshop :   Ontologies and texts, Juan-Les-Pins, octobre, 
71-78.
</p>
<p>BOURIGAULT D., SLODZIAN M. (1999). Pour une terminologie textuelle. Terminologies nouvelles, 19, 29-32.
GAIFFE B., JACQUEY E. &amp; KISTER L. (2009). Approche lexico-s&#233;mantique de l&#8217;extraction termino- logique : utilisation 
de ressources lexicographiques et validation sur corpus. In Actes de la conf&#233;rence Toth&#8217;09, Annecy.
</p>
<p>GRZESITCHAK M., JACQUEY E.,  BAIDER,  F. (2008).  Annotation s&#233;mantique : profilage textuel et lexical.  Actes de la 
conf&#233;rence Lexicographie et Informatique : Bilan et Perspectives. Nancy, France.
</p>
<p>LAFON P. (1980). Sur la variabilit&#233; de la fr&#233;quence des formes dans un corpus. MOTS, 1, 128&#8211;165.
</p>
<p>Presses de la Fondation Nationale des Sciences Politiques.
</p>
<p>LEBART L. &amp; SALEM, A. (1994). Statistique Textuelle, Dunod, 344 p.
L&#8217;HOMME M.C., (2004), La terminologie : Principes et Techniques. Presses Universitaires de Montr&#233;al.
MOUELHI, Z. (2007).  La richesse lexicale dans une perspective de lexicom&#233;trie arabe. Etude de cinq m&#233;thodes de 
mesure. Texte et Corpus, Actes de la journ&#233;e Corpus 2007, 271-284.
MULLER CH. (1992). Principes et m&#233;thodes de statistique lexicale, Larousse, 1977, r&#233;impression Champion-Slatkine, 
1992, 211p. 
</p>
<p>OLLINGER S.,  VALETTE M.  (2010), &#171; La cr&#233;ativit&#233; lexicale : des pratiques sociales aux textes &#187;,  Actes del I 
Congr&#233;s Internacional  de Neologia de les lleng&#252;es romaniques  (CINEO&#8217;08) (Barcelona, 07-10 maig 
2008), M. Teresa Cabr&#233; i Castellv&#237;, Ona Dom&#232;nech Bagaria, R. Estop&#224; Bagot, Judit Freixa Aymerich, Mer-
c&#232; Lorente Casafont (Ed.), Publicacions de l'Institut Universitari de Ling&#252;&#237;stica Aplicada (IULA) de la 
Universitat Pompeu Fabra (UPF),  pp. 965-876.
</p>
<p>POIBEAU T. (2005). Parcours interpr&#233;tatifs et terminologie. Actes TIA 2005. Rouen.
V&#201;RONIS J.  (2003).  Hyperlex  :  Cartographie  lexicale  pour  la  recherche  d&#8217;information.  http://www.up.univ-
mrs.fr/veronis/pdf/2003-hyperlex-rapport.pdf.</p>

</div></div>
</body></html>