<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traitement des disfluences dans le cadre de la compr&#233;hension automatique de l&#8217;oral arabe spontan&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Traitement des disfluences dans le cadre de la compr&#233;hension 
automatique de l&#8217;oral arabe spontan&#233; 
</p>
<p>Youn&#232;s Bahou, Abir Masmoudi, Lamia Hadrich Belguith 
</p>
<p>ANLP Research Group &#8211; Laboratoire MIRACL 
Facult&#233; des Sciences Economiques et de Gestion de Sfax 
</p>
<p>B.P. 1088, 3018 - Sfax &#8211; TUNISIE 
T&#233;l&#233;phone (216) 74 278 777, Fax (216) 74 279 139 
</p>
<p>bahou_younes@yahoo.fr, masmoudiabir@gmail.com, l.belguith@fsegs.rnu.tn 
</p>
<p> 
</p>
<p>R&#233;sum&#233;. Les disfluences inh&#233;rents de toute parole spontan&#233;e sont un vrai d&#233;fi pour les syst&#232;mes de 
compr&#233;hension de la parole. Ainsi, nous proposons dans cet article, une m&#233;thode originale pour le 
traitement des disfluences (plus pr&#233;cis&#233;ment, les autocorrections, les r&#233;p&#233;titions, les h&#233;sitations et les 
amorces) dans le cadre de la compr&#233;hension automatique de l&#8217;oral arabe spontan&#233;. Notre m&#233;thode est 
bas&#233;e sur une analyse &#224; la fois robuste et partielle, des &#233;nonc&#233;s oraux arabes. L&#8217;id&#233;e consiste &#224; combiner 
une technique de reconnaissance de patrons avec une analyse s&#233;mantique superficielle par segments 
conceptuels. Cette m&#233;thode a &#233;t&#233; test&#233;e &#224; travers le module de compr&#233;hension du syst&#232;me SARF, un 
serveur vocal interactif offrant des renseignements sur le transport ferroviaire tunisien (Bahou et al., 
2008). Les r&#233;sultats d&#8217;&#233;valuation de ce module montrent que la m&#233;thode propos&#233;e est tr&#232;s prometteuse. 
En effet, les  mesures de rappel, de pr&#233;cision et de F-Measure sont respectivement de 79.23%, 74.09% et 
76.57%. 
</p>
<p>Abstract. The disfluencies inherent in spontaneous speaking are a real challenge for speech 
understanding systems. Thus, we propose in this paper, an original method for processing disfluencies 
(more precisely, self-corrections, repetitions, hesitations and word-fragments) in the context of automatic 
spontaneous Arabic speech understanding. Our method is based on a robust and partial analysis of Arabic 
oral utterances. The main idea is to combine a pattern matching technique and a surface semantic analysis 
with conceptual segments. This method has been evaluated through the understanding module of SARF 
system, an interactive vocal server offering Tunisian railway information (Bahou et al., 2008). The 
evaluation results of this module show that the proposed method is very promising. Indeed, the measures 
of recall, precision and F-Measure are respectively 79.23%, 74.09% and 76.57%. 
</p>
<p>Mots-cl&#233;s : disfluences, segment conceptuel, reconnaissance de patrons, parole arabe spontan&#233;e. 
</p>
<p>Keywords: disfluencies, conceptual segment, pattern matching, spontaneous Arabic speech. 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Abir Masmoudi, Lamia Hadrich Belguith 
</p>
<p>1 Introduction 
Dans ce papier, nous proposons une m&#233;thode originale pour le traitement des disfluences (en particulier, 
les autocorrections, les r&#233;p&#233;titions, les h&#233;sitations et les amorces) dans le cadre de la compr&#233;hension 
automatique de la parole arabe spontan&#233;e. Cette m&#233;thode est bas&#233;e sur une analyse robuste et partielle par 
segments conceptuels des &#233;nonc&#233;s oraux arabes. L&#8217;originalit&#233; de la m&#233;thode r&#233;side dans l&#8217;utilisation &#224; la 
fois de segments conceptuels et d&#8217;une technique de reconnaissance de patrons (pattern matching) pour le 
traitement des disfluences. Ainsi, un &#233;nonc&#233; &#233;tiquet&#233; s&#233;mantiquement passe par trois &#233;tapes de traitement 
&#224; savoir, une &#233;tape de d&#233;coupage en segments conceptuels, une &#233;tape de d&#233;limitation des segments 
disfluents contenant les disfluences et une &#233;tape de d&#233;tection et de correction des disfluences bas&#233;e sur la 
technique de la reconnaissance de patrons. 
</p>
<p>Ce travail entre dans le cadre de la r&#233;alisation du serveur vocal interactif SARF (Bahou et al., 2008 ; 
Hadrich Belguith et al., 2009) offrant des renseignements sur le transport ferroviaire tunisien en langue 
arabe standard moderne (e.g., horaire d&#8217;un train, tarification, etc.). Nous visons, &#224; travers le pr&#233;sent 
travail, &#224; appliquer et &#224; tester notre m&#233;thode de traitement des disfluences dans l&#8217;oral arabe et ce &#224; travers 
le module de compr&#233;hension du syst&#232;me SARF. 
</p>
<p>Cet article s&#8217;articule autour de cinq sections principales. La section 2 explique les principaux types de 
disfluences. La section 3 expose un aper&#231;u sur les approches de traitement des disfluences. La section 4 
d&#233;taille la m&#233;thode que nous proposons pour le traitement des disfluences de l&#8217;arabe parl&#233; et la section 5 
pr&#233;sente la mise en &#339;uvre et l&#8217;&#233;valuation de la m&#233;thode propos&#233;e ainsi qu&#8217;une discussion des r&#233;sultats 
obtenus. 
</p>
<p>2 Les disfluences dans l&#8217;oral spontan&#233; 
Comme indique leur &#233;tymologie, les disfluences correspondent &#224; toute interruption ou perturbation de la 
fluence, c'est-&#224;-dire du cours normal de la production orale spontan&#233;e (Bove, 2008). Dans ce qui suit, 
nous mettons l&#8217;accent sur les principaux ph&#233;nom&#232;nes de disfluences &#224; savoir, les autocorrections, les 
r&#233;p&#233;titions, les h&#233;sitations et les amorces. 
</p>
<p>&#8226; Autocorrection : il s&#8217;agit du cas o&#249; le locuteur fait une ou plusieurs erreurs et se corrige dans le 
m&#234;me &#233;nonc&#233;. Dans ce cas le mot (ou les mots) erron&#233; est prononc&#233; compl&#232;tement (Bouraoui, 
2009). 
</p>
<p>&#8226; R&#233;p&#233;tition : il s&#8217;agit du cas de la r&#233;p&#233;tition d&#8217;un mot ou d&#8217;une s&#233;rie de mots. Elle est d&#233;finie sur 
des crit&#232;res purement morphologiques (Kurdi, 2003). 
</p>
<p>&#8226; H&#233;sitation : il s&#8217;agit du cas d&#8217;une pause remplie dans la production orale qui peut se manifester 
de diverses mani&#232;res : soit par le recours &#224; un morph&#232;me sp&#233;cifique (e.g., euh, hum, etc.), soit en 
prenant la forme d&#8217;un allongement de syllabe (Bove, 2008). 
</p>
<p>&#8226; Amorce : il s&#8217;agit du cas de l&#8217;arr&#234;t de la production d&#8217;un mot avant la fin normale de celui-ci. 
Dans sa terminologie, une amorce correspond toujours &#224; un fragment de mot qui peut &#234;tre 
identifi&#233; gr&#226;ce &#224; la connaissance de la phras&#233;ologie (Bouraoui, 2009). 
</p>
<p>3 Travaux ant&#233;rieurs 
Dans la litt&#233;rature, les disfluences sont trait&#233;es soit au niveau de la reconnaissance vocale soit au niveau 
de la compr&#233;hension de la parole. Ainsi, nous avons r&#233;pertori&#233; les travaux existants selon ces deux 
niveaux de traitement &#224; savoir, niveau reconnaissance et niveau compr&#233;hension. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement des disfluences dans le cadre de la compr&#233;hension automatique de l&#8217;oral arabe spontan&#233; 
</p>
<p>3.1 Niveau reconnaissance 
</p>
<p>La reconnaissance automatique de la parole consiste &#224; extraire la liste des mots contenue dans un signal 
vocal. &#192; ce niveau de traitement et &#224; notre connaissance, il y a une seule approche qui a &#233;t&#233; propos&#233;e pour 
le traitement des disfluences &#224; savoir, l&#8217;approche de SRI propos&#233;e par Bear et al. au sein de Standford 
Research Instute (SRI) (Bear et al., 1992). 
</p>
<p>Le travail de Bear et al. consiste, en premi&#232;re &#233;tape, &#224; proposer un sch&#232;me d&#8217;annotation des disfluences 
qui combine la simplicit&#233; &#224; la finesse n&#233;cessaire pour la repr&#233;sentation des diff&#233;rentes formes de 
disfluences (Bear et al., 1992). Il s&#8217;agit, ensuite, de combiner l&#8217;analyse syntaxique et s&#233;mantique (afin de 
r&#233;duire la surg&#233;n&#233;ration de patrons) avec la technique de la reconnaissance de patrons. Le but &#233;tant de 
d&#233;tecter et de corriger les r&#233;p&#233;titions simples et les anomalies syntaxiques simples comme &#171; a the &#187; (Bear 
et al., 1992). L&#8217;inconv&#233;nient de cette combinaison est qu&#8217;elle est incompatible avec les approches 
d&#8217;analyse partielle qui sont les plus adapt&#233;es au traitement de l&#8217;oral. Ainsi, l&#8217;approche de SRI rend le 
module de traitement des disfluences compl&#232;tement d&#233;pendant de l&#8217;analyseur syntaxique et par 
cons&#233;quent elle r&#233;duit consid&#233;rablement sa portabilit&#233;. 
</p>
<p>Heeman et Allen ont adopt&#233; cette approche dans le cadre du projet TRAINS au sein de l&#8217;universit&#233; de 
Rochester (Heeman, Allen, 1996). La premi&#232;re &#233;tape de ce travail consiste &#224; proposer une version 
modifi&#233;e du sch&#232;me d&#8217;annotation des chercheurs de SRI. Ainsi, le sch&#232;me propos&#233; ne permet pas le 
partage de la zone remplac&#233;e dans le cas de disfluences imbriqu&#233;es. L&#8217;id&#233;e principale de ce travail est 
bas&#233;e sur l&#8217;usage de certains types de disfluences comme indices des occurrences des autocorrections. 
Pour cela, les auteurs mettent en place un mod&#232;le statistique (n-grammes) permettant d&#8217;associer &#224; la 
probabilit&#233; d&#8217;occurrence d&#8217;une disfluence donn&#233;e, la probabilit&#233; d&#8217;apparition d&#8217;une autocorrection. Il 
s&#8217;agit ensuite de d&#233;tecter et de corriger les disfluences en utilisant des patrons et des r&#232;gles. 
L&#8217;inconv&#233;nient principal du travail de Heeman et Allen est que l&#8217;utilisation des tags comme source 
unique de connaissance morphologique est trop limitative. En effet, dans certains cas on a besoin 
d&#8217;informations morphologiques d&#233;taill&#233;es (e.g., personne, fonction syntaxique, etc.) afin de pouvoir 
analyser correctement un cas de disfluences. 
</p>
<p>3.2 Niveau compr&#233;hension 
</p>
<p>La compr&#233;hension se situe en aval de la reconnaissance vocale. Son r&#244;le est d&#8217;interpr&#233;ter s&#233;mantiquement 
et d&#8217;attribuer une repr&#233;sentation s&#233;mantique de l&#8217;ensemble d&#8217;&#233;l&#233;ments lexicaux (habituellement un ou 
plusieurs &#233;nonc&#233;s) qui ont &#233;t&#233; produits par le syst&#232;me de reconnaissance. &#192; ce niveau de traitement, nous 
distinguons deux principales approches pour le traitement des disfluences &#224; savoir, l&#8217;approche &#224; base de 
patrons et l&#8217;approche &#224; base de m&#233;ta-r&#232;gles syntaxiques. 
</p>
<p>&#8226; Approche &#224; base de patrons 
L&#8217;avantage de cette approche est la simplicit&#233; de sa mise en &#339;uvre, puisque les algorithmes de d&#233;tection 
des disfluences &#224; base de patrons sont relativement simples &#224; concevoir. De plus, elle est g&#233;n&#233;ralisable &#224; 
plusieurs types de corpus, de t&#226;ches et aussi de langues. 
</p>
<p>Le travail de Kurdi porte sur le traitement du langage oral spontan&#233; dans le contexte du dialogue oral 
Homme-machine &#224; travers le syst&#232;me CORRECTOR (Kurdi, 2003). Dans son travail, Kurdi a d&#233;sign&#233; les 
disfluences par le terme &#171; extragrammaticalit&#233;s &#187;. Ainsi, l&#8217;auteur tente de m&#234;ler deux tendances : i) la 
premi&#232;re tendance consiste &#224; utiliser les deux techniques de n-grammes et de la reconnaissance de patrons 
pour traiter certains ph&#233;nom&#232;nes comme les r&#233;p&#233;titions et les autocorrections, ii) la deuxi&#232;me tendance 
consiste &#224; mod&#233;liser syntaxiquement les amorces et les inach&#232;vements. 
</p>
<p>Le travail de Bove s&#8217;inscrit dans le cadre d&#8217;un travail d&#8217;&#233;quipe sur l&#8217;analyse morphologique et syntaxique 
du fran&#231;ais parl&#233; (Bove, 2008). Il adopte une m&#233;thode &#171; hybride &#187; de reconnaissance de patrons (bas&#233;e </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Abir Masmoudi, Lamia Hadrich Belguith 
</p>
<p>sur les cat&#233;gories morpho-syntaxiques du corpus) coupl&#233;e &#224; un calcul de n-grammes pour d&#233;tecter les 
diff&#233;rents ph&#233;nom&#232;nes de disfluences. Ensuite, les &#233;nonc&#233;s disfluents pr&#233;c&#233;demment analys&#233;s seront 
d&#233;coup&#233;s en syntagmes minimaux non r&#233;cursifs (ou chunks). Le corpus final est ainsi segment&#233; en chunks 
habituels (qu&#8217;on retrouve lors de l&#8217;analyse de l&#8217;&#233;crit) &#224;-c&#244;t&#233; des chunks disfluents d&#233;gag&#233;s lors de 
l&#8217;analyse (Bove, 2008). Dans son travail, l&#8217;auteur n&#8217;a pas propos&#233; une m&#233;thode pour la correction des 
disfluences d&#233;tect&#233;es. 
</p>
<p>L&#8217;approche &#224; base de patrons pr&#233;sente certaines limites. Parmi ces limites, la stabilit&#233; des patrons obtenus. 
Le terme de stabilit&#233; d&#233;signe le nombre de patrons diff&#233;rents pouvant &#234;tre d&#233;riv&#233;s &#224; partir d&#8217;un 
ph&#233;nom&#232;ne donn&#233;. Dans la plupart des &#233;tudes sur les disfluences, un tr&#232;s grand nombre de patrons 
diff&#233;rents est obtenu pour repr&#233;senter les disfluences, ou m&#234;me un seul type de disfluences, telles que les 
autocorrections. Ainsi, la prise en compte extensive de cette multiplicit&#233; de patrons implique un 
algorithme complexe et difficile &#224; mettre en &#339;uvre. 
</p>
<p>&#8226; Approche &#224; base de m&#233;ta-r&#232;gles syntaxiques 
Cette approche est propos&#233;e par Core et Schubert dans le cadre de l&#8217;analyse robuste des dialogues au sein 
du groupe de dialogue de l&#8217;universit&#233; de Rochester (Core, Schubert, 1999). La particularit&#233; principale de 
ce travail est l&#8217;introduction des informations linguistiques (notamment syntaxiques) dans le traitement des 
disfluences, d&#8217;une mani&#232;re originale. 
</p>
<p>Dans le travail de Core et Schubert, le traitement de disfluences se fait en deux &#233;tapes. La premi&#232;re &#233;tape 
consiste &#224; d&#233;tecter les disfluences &#224; l&#8217;aide d&#8217;un mod&#232;le de langage statistique. Par ailleurs, la fonction 
principale de ce module est de d&#233;tecter les disfluences et de proposer une premi&#232;re d&#233;limitation de 
chacune d&#8217;entre elles. Alors que la deuxi&#232;me &#233;tape consiste &#224; donner une interpr&#233;tation couvrant la 
totalit&#233; des mots de l&#8217;&#233;nonc&#233; d&#8217;entr&#233;e. Pour cela, les disfluences d&#233;tect&#233;es par le module statistique sont 
analys&#233;es &#224; l&#8217;aide de m&#233;ta-r&#232;gles d&#233;di&#233;es sp&#233;cialement &#224; cette t&#226;che (Core, Schubert, 1999). 
</p>
<p>Le travail de Mckelvie (Mckelvie, 1998) adopte cette approche dans le cadre d&#8217;un projet qui vise 
l&#8217;analyse syntaxique des dialogues oraux spontan&#233;s au sein de l&#8217;universit&#233; d&#8217;Edinburgh. Compar&#233; au 
travail de Core et Schubert, Mckelvie ajoute deux cat&#233;gories syntaxiques outres celles qui sont classiques 
&#224; savoir, les syntagmes d&#8217;&#233;ditions (sp&#233;cifiques aux disfluences) et les marqueurs discursifs (e.g., oui, bon, 
etc.). L&#8217;id&#233;e principale de ce travail reste semblable &#224; celle de Core et Schubert. Le plus apport&#233; par 
l&#8217;auteur est le fait d&#8217;ignorer tous les syntagmes d&#8217;&#233;ditions et les marqueurs discursifs qui apparaissent 
apr&#232;s un constituant de confiance (pertinent et correct pour l&#8217;auteur). Ainsi, l&#8217;analyseur syntaxique 
propos&#233; pour le traitement des dialogues oraux garanti une certaine robustesse face aux disfluences. 
</p>
<p>L&#8217;inconv&#233;nient principal de cette approche r&#233;side dans l&#8217;utilisation des m&#233;ta-r&#232;gles syntaxiques. D&#8217;un 
c&#244;t&#233;, les m&#233;ta-r&#232;gles syntaxiques sont difficiles &#224; recenser et &#224; mettre en &#339;uvre. D&#8217;un autre c&#244;t&#233;, 
l&#8217;utilisation de m&#233;ta-r&#233;gles syntaxiques dans une analyse multiplie le temps de calcul d&#8217;environ trois fois. 
</p>
<p>4 M&#233;thode propos&#233;e pour le traitement des disfluences 
Avant d&#8217;exposer la m&#233;thode que nous proposons, nous jugeons n&#233;cessaire de pr&#233;senter le corpus d&#8217;&#233;tude 
que nous avons utilis&#233;. 
</p>
<p>4.1 Corpus d&#8217;&#233;tude 
</p>
<p>Vu que les ressources linguistiques arabes sont tr&#232;s rares, nous &#233;tions amen&#233;s &#224; cr&#233;er notre propre corpus 
d&#8217;&#233;tude constitu&#233; de 300 dialogues (soit 11 heures d&#8217;enregistrements) selon la technique de Magicien 
d&#8217;Oz. Cette technique fait simuler le comportement de la machine par un comp&#232;re humain (i.e., le 
magicien) &#224; l&#8217;insu de l&#8217;utilisateur. Ce corpus nous a permis d&#8217;&#233;tudier quantitativement et qualitativement 
les diff&#233;rents types de disfluences que nous envisageons de traiter. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement des disfluences dans le cadre de la compr&#233;hension automatique de l&#8217;oral arabe spontan&#233; 
</p>
<p>Par l&#8217;&#233;tude quantitative, nous visons &#224; &#233;tudier les occurrences d&#8217;apparition des diff&#233;rents types de 
disfluences dans le corpus d&#8217;&#233;tude. Parmi les types de disfluences, nous nous sommes int&#233;ress&#233;s aux 
quatre types suivants : les autocorrections, les r&#233;p&#233;titions, les h&#233;sitations et les amorces vu leur fr&#233;quence 
dans les dialogues oraux arabes. Notons que cette &#233;tude nous est utile pour comparer les caract&#233;ristiques 
de l&#8217;oral arabe spontan&#233; par rapport &#224; d&#8217;autres langues, pr&#233;cis&#233;ment le fran&#231;ais. La figure 1 r&#233;sume les 
r&#233;sultats obtenus. 
</p>
<p> 
Figure 1 : Distribution des types de disfluences dans le corpus d&#8217;&#233;tude 
</p>
<p>&#192; la lumi&#232;re de cette distribution et en comparaison avec l&#8217;&#233;tude men&#233;e par Bove (Bove, 2008) sur le 
fran&#231;ais parl&#233;, nous avons constat&#233; que les autocorrections dans l&#8217;oral arabe spontan&#233; sont plus fr&#233;quentes 
que celles dans l&#8217;oral fran&#231;ais spontan&#233; (i.e., Bove a trouv&#233; 13% d&#8217;autocorrections dans son corpus 
d&#8217;&#233;tude) alors que les r&#233;p&#233;titions et les amorces sont moins fr&#233;quentes (i.e., Bove a trouv&#233; respectivement 
44% et 15%). 
</p>
<p>Par l&#8217;&#233;tude qualitative, nous visons &#224; recenser les diff&#233;rentes ressources linguistiques utilis&#233;es par la 
m&#233;thode que nous proposons dans la section suivante &#224; savoir, les segments conceptuels et les patrons. 
Ainsi, nous avons d&#233;gag&#233; 104 segments conceptuels et 201 patrons avec ou sans marqueurs de 
rectification. Les r&#233;sultats de cette &#233;tude qualitative nous donne une id&#233;e d&#8217;une part, sur la complexit&#233; et 
la vari&#233;t&#233; des structures syntaxiques de l&#8217;arabe parl&#233;, et d&#8217;autre part sur la complexit&#233; et la vari&#233;t&#233; des 
disfluences dans l&#8217;arabe parl&#233;. 
</p>
<p>4.2 Principe de la m&#233;thode 
</p>
<p>Nous proposons de traiter les disfluences au niveau de la compr&#233;hension de la parole vu que nous ne 
disposons pas d&#8217;un logiciel open source pour la reconnaissance vocale arabe. Ainsi, la m&#233;thode propos&#233;e 
est bas&#233;e sur l&#8217;approche &#224; base de patrons et combine la technique de la reconnaissance de patrons &#224; une 
segmentation conceptuelle des &#233;nonc&#233;s. L&#8217;originalit&#233; de cette m&#233;thode r&#233;side dans l&#8217;utilisation des 
segments conceptuels et la technique de la reconnaissance de patrons pour le traitement des disfluences. 
G&#233;n&#233;ralement, les travaux qui se basent sur une analyse partielle des &#233;nonc&#233;s utilisent les chunks 
(purement syntaxiques) qui ont prouv&#233; leur performance dans le traitement de l&#8217;&#233;crit. Cependant, pour le 
traitement de l&#8217;oral et pour un domaine limit&#233;, comme le notre, nous jugeons que l&#8217;utilisation des 
segments conceptuels (purement s&#233;mantiques) est plus int&#233;ressante que l&#8217;utilisation des chunks et peut 
donner de bons r&#233;sultats. Par ailleurs, nous sommes convaincus que la segmentation conceptuelle peut 
aussi jouer un r&#244;le important dans la r&#233;solution des disfluences imbriqu&#233;es. 
</p>
<p>Par ailleurs, notre m&#233;thode consiste en trois principales &#233;tapes &#224; savoir, l&#8217;&#233;tape de d&#233;coupage des &#233;nonc&#233;s 
arabes en segments conceptuels, l&#8217;&#233;tape de d&#233;limitation des segments disfluents et l&#8217;&#233;tape de d&#233;tection des 
disfluences ainsi que leur correction. Afin de bien expliquer notre m&#233;thode, nous proposons de prendre &#224; 
titre d&#8217;exemple l&#8217;&#233;nonc&#233; &#233;tiquet&#233; s&#233;mantiquement (1). Cet &#233;nonc&#233; contient des disfluences qui seront 
d&#233;tect&#233;es puis corrig&#233;es &#224; travers les &#233;tapes de la m&#233;thode propos&#233;e. 
</p>
<p>&#1731;&#1845;&#1872;&#1853;&#1872;&#1861;&#1867;&#1866;,&#1587;&#1602;&#1575;&#1601;&#1589;&#1732;&#160;&#1731;&#1839;&#1853;&#1870;&#1869;_&#1845;&#1872;&#1853;&#1872;&#1861;&#1867;&#1866;_&#1830;&#233;&#1868;&#1853;&#1870;&#1872;, &#1606;&#1605;&#1732;&#160;&#1731;&#1846;&#1877;&#1868;&#1857;_&#1828;&#1861;&#1864;&#1864;&#1857;&#1872;,&#1576;&#1575;&#1726;&#1584;&#1732;&#160;&#1731;&#1839;&#1853;&#1870;&#1869;_&#1828;&#1861;&#1864;&#1864;&#1857;&#1872;, &#1577;&#1585;&#1603;&#1584;&#1578;&#1732;&#160;&#1731;&#1839;&#1867;&#1872;_&#1844;&#1857;&#1858;_&#1842;&#1870;&#1861;&#1876;, &#1606;&#1605;&#1579;&#1732;&#160;&#1731;&#1830;&#1857;&#1865;&#1853;&#1866;&#1856;&#1857;, &#1583;&#1575;&#1585;&#1571;&#1732;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2778;&#4667; 
&#160;&#1731;&#1845;&#1872;&#1853;&#1872;&#1861;&#1867;&#1866;,&#1587;&#1602;&#1575;&#1601;&#1589;&#1732;&#160;&#160;&#160;&#1731;&#1839;&#1853;&#1870;&#1869;_&#1845;&#1872;&#1853;&#1872;&#1861;&#1867;&#1866;_&#1830;&#233;&#1868;&#1853;&#1870;&#1872;, &#1606;&#1605;&#1732;&#160;&#160;&#160;&#1731;&#1846;&#1877;&#1868;&#1857;_&#1828;&#1861;&#1864;&#1864;&#1857;&#1872;,&#1576;&#1617;&#1575;&#1610;&#1573; &#3398; &#1576;&#1575;&#1726;&#1584;&#1732;&#160;&#160;&#160;&#1731;&#1839;&#1853;&#1870;&#1869;_&#1828;&#1861;&#1864;&#1864;&#1857;&#1872;, &#1577;&#1585;&#1603;&#1584;&#1578;&#1732;&#160;&#1731;&#1839;&#1853;&#1870;&#1869;_&#1844;&#1857;&#1855;&#1872;&#1861;&#1858;&#1861;&#1855;&#1853;&#1872;&#1861;&#1867;&#1866;, &#1608;&#1601;&#1593;&#1732;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; 
&#1731;&#1839;&#1853;&#1870;&#1869;_&#1839;&#1861;&#1866;&#1873;&#1872;&#1857;, &#1577;&#1602;&#1610;&#1602;&#1583;&#1732;&#160;&#1731;&#1840;&#1867;&#1865;&#1854;&#1870;&#1857;, 33&#1732;&#160;&#1731;&#1840;&#1867;&#1865;&#1854;&#1870;&#1857;, 11&#1732;&#160;&#1731;&#1839;&#1853;&#1870;&#1869;_&#1834;&#1857;&#1873;&#1870;&#1857;, &#1577;&#1593;&#1575;&#1587; &#3398; &#1609;&#1604;&#1593;&#1732;&#160;&#1731;&#1845;&#1872;&#1853;&#1872;&#1861;&#1867;&#1866;,&#1587;&#1606;&#1608;&#1578;&#1732;&#160;&#1731;&#1839;&#1853;&#1870;&#1869;_&#1845;&#1872;&#1853;&#1872;&#1861;&#1867;&#1866;_&#1827;&#1870;&#1870;&#1861;&#1874;&#233;&#1857;,&#1609;&#1604;&#1573;&#1732;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Abir Masmoudi, Lamia Hadrich Belguith 
</p>
<p>&#8226; D&#233;coupage en segments conceptuels 
Cette &#233;tape consiste &#224; d&#233;couper l&#8217;&#233;nonc&#233; en segments conceptuels. Par segment conceptuel, nous 
entendons la succession des classes de mots dans un seul segment r&#233;f&#233;rant &#224; un concept bien d&#233;termin&#233; ; 
c&#8217;est-&#224;-dire, la s&#233;quence de classes de mots exprimant une m&#234;me unit&#233; de sens (Bousquet-Vernhettes, 
2002). Ainsi, une s&#233;quence de mots r&#233;alisant un segment conceptuel est une instance de ce segment 
conceptuel. Par exemple, la s&#233;quence de mots &#171; &#1587;&#1606;&#1608;&#1578; &#1606;&#1605; &#187; [mn twns] (de Tunis) est une instance du 
segment conceptuel D&#233;part et fait r&#233;f&#233;rence au concept D&#233;part. Les segments conceptuels se divisent en 
trois types &#224; savoir, les illocutoires, les r&#233;f&#233;rentiels et les rebuts (Bousquet-Vernhettes, 2002). Le type 
illocutoire fait r&#233;f&#233;rence &#224; la th&#233;orie des actes du langage (e.g., Demande, D&#233;but_Dialogue, etc.). Le 
segment &#171; &#1575;&#1576;&#1581;&#1585;&#1605; &#187; [mrHbA] (salut) est le segment conceptuel D&#233;but_Dialogue. Quant au type r&#233;f&#233;rentiel, 
il permet de repr&#233;senter le domaine de l&#8217;application (e.g., Heure_D&#233;part, D&#233;part, Destination, etc.). Le 
segment &#171; &#1587;&#1602;&#1575;&#1601;&#1589; &#1609;&#1604;&#1573; &#187; [IlY SfAqs] (&#224; Sfax) est un segment conceptuel Station_Arriv&#233;e. Le type rebut 
regroupe les mots et les groupes de mots consid&#233;r&#233;s comme inutiles pour la compr&#233;hension de l&#8217;&#233;nonc&#233; 
(e.g., Bruit, Digression, etc.). 
</p>
<p>La premi&#232;re phase dans cette &#233;tape consiste &#224; rep&#233;rer les diff&#233;rents marqueurs qui figurent dans un 
&#233;nonc&#233;. Ces marqueurs se d&#233;finissent comme &#233;tant des indicateurs permettant l&#8217;identification d&#8217;un 
segment conceptuel. G&#233;n&#233;ralement, les marqueurs ne portent pas d&#8217;informations pertinentes mais ils 
facilitent l&#8217;extraction de ces informations. En langue arabe, un marqueur peut &#234;tre un pr&#233;-marqueur, un 
post-marqueur ou un pr&#233;-post marqueur &#224; la fois. 
</p>
<p>Un pr&#233;-marqueur est suivi par l&#8217;information pertinente (i.e., le cas s&#233;mantique) qu&#8217;il marque. Par 
exemple, le pr&#233;-marqueur &#171; &#1609;&#1604;&#1593;-&#1577;&#1593;&#1575;&#1587;  &#187; [ElY-sAEp] (&#224;-heure) marque le cas s&#233;mantique Nombre_Heure 
d&#8217;o&#249; il sera suivi d&#8217;une information sur le nombre d&#8217;heures. De la m&#234;me fa&#231;on, un post-marqueur est 
pr&#233;c&#233;d&#233; par le cas s&#233;mantique qu&#8217;il marque. Par exemple, le post-marquer &#171; &#1577;&#1602;&#1610;&#1602;&#1583; &#187; [dqyqp] (minute) est 
toujours pr&#233;c&#233;d&#233; par le cas s&#233;mantique Nombre_Minute. Un pr&#233;-post marqueur est &#224; la fois pr&#233;c&#233;d&#233; et 
suivi par deux cas s&#233;mantiques. Par exemple, le pr&#233;-post marqueur &#171; &#1577;&#1585;&#1603;&#1584;&#1578; &#187; [t*krp] (billet) est 
g&#233;n&#233;ralement pr&#233;c&#233;d&#233; par le cas s&#233;mantique Nombre_Billet et suivi par le cas s&#233;mantique Type_Billet. 
Ainsi, le rep&#233;rage des marqueurs permet l&#8217;identification et la d&#233;limitation des segments conceptuels 
puisque ces derniers sont constitu&#233;s par les marqueurs et les cas s&#233;mantiques qu&#8217;ils marquent. Par 
exemple, le marqueur de station de d&#233;part &#171; &#1606;&#1605; &#187; [mn] (de) et le cas s&#233;mantique Station &#171; &#1587;&#1602;&#1575;&#1601;&#1589; &#187; [SfAqs] 
(Sfax) constituent ensemble le segment conceptuel D&#233;part dans l&#8217;&#233;nonc&#233; (1). 
</p>
<p>La deuxi&#232;me phase dans cette &#233;tape consiste &#224; raffiner les &#233;tiquettes s&#233;mantiques des mots composant les 
segments conceptuels. Ce raffinement est bas&#233; essentiellement sur l&#8217;&#233;tiquette s&#233;mantique non raffin&#233;e du 
mot ainsi que le segment conceptuel o&#249; se trouve ce mot. En effet, la m&#233;thode propos&#233;e prend en 
consid&#233;ration le contexte du mot au sein du segment conceptuel. Ainsi, l&#8217;&#233;tiquette s&#233;mantique non 
raffin&#233;e Station peut avoir plusieurs raffinements possibles selon le segment conceptuel o&#249; se trouve le 
mot qui a cette &#233;tiquette (i.e., Station_D&#233;part, Station_Arriv&#233;e ou Station_Escale). Par exemple, le mot 
&#171; &#1587;&#1602;&#1575;&#1601;&#1589; &#187; [SfAqs] (Sfax) du segment conceptuel D&#233;part de l&#8217;&#233;nonc&#233; (1) aura comme &#233;tiquette s&#233;mantique 
raffin&#233;e Station_D&#233;part au lieu de Station, ce qui pr&#233;cise exactement le r&#244;le s&#233;mantique jou&#233; par ce mot 
(dans ce cas, la station de d&#233;part). L&#8217;&#233;nonc&#233; (2) est le r&#233;sultat du d&#233;coupage en segments conceptuels de 
l&#8217;&#233;nonc&#233; (1). 
</p>
<p>&#4688;
&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;
&#4670;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#4671;
&#4666;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#4667;
</p>
<p>&#4718;&#1830;&#233;&#1868;&#1853;&#1870;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#160;&#1576;&#1575;&#1726;&#1584;&#160;&#1577;&#1585;&#1603;&#1584;&#1578;&#160;
</p>
<p>&#4670;&#1872; &#1499; &#1863;&#1870;&#1868;&#160; &#1499; &#1860;&#1827;&#1854;&#4671;&#160;
&#4666;&#1854;&#1861;&#1864;&#1864;&#1857;&#1872;&#160;&#1853;&#1864;&#1864;&#1857;&#1870;&#160;&#1871;&#1861;&#1865;&#1868;&#1864;&#1857;&#160;&#4667;
</p>
<p>&#4718;&#1846;&#1877;&#1868;&#1857;_&#1828;&#1861;&#1864;&#1864;&#1857;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#1606;&#1605;&#1579;&#160;&#1583;&#1575;&#1585;&#1571;&#160;
</p>
<p>&#4670;&#1841;&#1870;&#1827;&#1856;&#160;&#1874;&#1865;&#1866;&#4671;
&#4666;&#1874;&#1867;&#1873;&#1864;&#1867;&#1861;&#1870;&#160;&#1868;&#1870;&#1861;&#1876;&#4667;
</p>
<p>&#4718;&#1830;&#1857;&#1865;&#1853;&#1866;&#1856;&#1857;_&#1842;&#1870;&#1861;&#1876;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &#4666;&#2779;&#4667;&#160;&#160;&#160; 
</p>
<p>&#4688;
&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;
</p>
<p>&#4670;&#160;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#4671;
&#4666;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#160;&#4667;
</p>
<p>&#4718;&#1830;&#233;&#1868;&#1853;&#1870;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#160;&#1576;&#1575;&#1610;&#1573;&#160; &#3398; &#1576;&#1575;&#1726;&#1584;&#160;&#160;&#1577;&#1585;&#1603;&#1584;&#1578;&#160;
</p>
<p>&#4670;&#1872; &#1499; &#1863;&#1870;&#1868;&#160; &#1499; &#1860;&#1827;&#1854; &#3398; &#1835;&#1877;~&#1827;&#1854;&#160;&#4671;
&#4666;&#1854;&#1861;&#1864;&#1864;&#1857;&#1872;&#160;&#160;&#160;&#1853;&#1864;&#1864;&#1857;&#1870; &#3398; &#1870;&#1857;&#1872;&#1867;&#1873;&#1870;&#4667;
</p>
<p>&#4718;&#1846;&#1877;&#1868;&#1857;_&#1828;&#1861;&#1864;&#1864;&#1857;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#1608;&#1601;&#1593;&#160;&#160;&#160;&#160;&#160;&#160;
&#4670;&#1831;&#1858;&#1875;&#4671;
</p>
<p>&#4666;&#1868;&#1853;&#1870;&#1856;&#1867;&#1866;&#4667;
&#4718;&#1844;&#1857;&#1855;&#1872;&#1861;&#1858;&#1861;&#1855;&#1853;&#1872;&#1861;&#1867;&#1866;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
</p>
<p>&#4688;
&#1577;&#1602;&#1610;&#1602;&#1583;&#160;&#160;33
</p>
<p>&#4670;33&#160;&#1856;&#1869;&#1877;&#1869;&#1868;&#4671;
&#4666;33&#160;&#1865;&#1861;&#1866;&#1873;&#1872;&#1857;&#1871;&#4667;
</p>
<p>&#4718;&#1839;&#1861;&#1866;&#1873;&#1872;&#1857;_&#1830;&#233;&#1868;&#1853;&#1870;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#160;11&#160;&#1577;&#1593;&#1575;&#1587; &#3398; &#1609;&#1604;&#1593;
</p>
<p>&#4670;&#1831;&#1864;&#1851; &#3398; &#1871;&#1827;&#1831;&#1868;&#160;11&#4671;
&#4666;&#224; &#3398; &#1860;&#1857;&#1873;&#1870;&#1857;&#160;11&#4667;
</p>
<p>&#4718;&#1834;&#1857;&#1873;&#1870;&#1857;_&#1830;&#233;&#1868;&#1853;&#1870;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#1587;&#1606;&#1608;&#1578;&#160;&#1609;&#1604;&#1573;
</p>
<p>&#4670;&#1835;&#1864;&#1851;&#160;&#1872;&#1875;&#1866;&#1871;&#4671;
&#4666;&#1874;&#1857;&#1870;&#1871;&#160;&#1846;&#1873;&#1866;&#1861;&#1871;&#4667;
</p>
<p>&#4718;&#1830;&#1857;&#1871;&#1872;&#1861;&#1866;&#1853;&#1872;&#1861;&#1867;&#1866;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement des disfluences dans le cadre de la compr&#233;hension automatique de l&#8217;oral arabe spontan&#233; 
</p>
<p>&#8226; D&#233;limitation des segments disfluents 
L&#8217;&#233;tape pr&#233;c&#233;dente g&#233;n&#232;re, comme r&#233;sultat, un &#233;nonc&#233; qui est soit compl&#232;tement segment&#233; soit 
partiellement segment&#233; (i.e., il contient des mots isol&#233;s n&#8217;appartenant &#224; aucun segment conceptuel, 
comme le cas du mot &#171; &#1608;&#1601;&#1593; &#187; [Efw] (pardon) dans l&#8217;&#233;nonc&#233; (2)). Dans le cas d&#8217;une segmentation compl&#232;te, 
l&#8217;&#233;nonc&#233; est soit correct (i.e., ne contient pas de disfluences) soit incorrect (i.e., contient des disfluences). 
Ces disfluences ne peuvent &#234;tre que des autocorrections ou des r&#233;p&#233;titions (les cas d&#8217;h&#233;sitations ou 
d&#8217;amorces sont exclus). Dans le cas d&#8217;une segmentation partielle, la pr&#233;sence des mots isol&#233;s est due &#224; la 
pr&#233;sence d&#8217;une ou de plusieurs disfluences. En effet, ces mots ne peuvent &#234;tre que des marqueurs de 
rectification, des h&#233;sitations, des amorces ou des mots corrigeant un segment. Pour expliquer ce dernier 
cas, nous prenons &#224; titre d&#8217;exemple le segment &#171; &#1587;&#1602;&#1575;&#1601;&#1589; &#1606;&#1605; &#187; [mn SfAqs] (de Sfax) corrig&#233; par le mot 
&#171; &#1587;&#1606;&#1608;&#1578; &#187; [twns] (Tunis) dans l&#8217;&#233;nonc&#233; (3). 
</p>
<p>&#4688;
&#160;&#1587;&#1606;&#1608;&#1578;
&#4670;&#1872;&#1875;&#1866;&#1871;&#4671;
&#4666;&#1846;&#1873;&#1866;&#1861;&#1871;&#4667;
</p>
<p>&#4718;&#1845;&#1872;&#1853;&#1872;&#1861;&#1867;&#1866;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#1608;&#1601;&#1593;&#160;
</p>
<p>&#4670;&#1831;&#1858;&#1875;&#4671;
&#4666;&#1868;&#1853;&#1870;&#1856;&#1867;&#1866;&#4667;
</p>
<p>&#4718;&#1844;&#1857;&#1855;&#1872;&#1861;&#1858;&#1861;&#1855;&#1853;&#1872;&#1861;&#1867;&#1866;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;
&#4670;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#4671;
&#4666;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#4667;
</p>
<p>&#4718;&#1830;&#233;&#1868;&#1853;&#1870;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2780;&#4667; 
</p>
<p>Ainsi, l&#8217;objectif de cette &#233;tape est de d&#233;limiter les disfluences et de les regrouper dans un segment que 
nous avons nomm&#233; segment disfluent. Cette d&#233;limitation facilite par la suite le rep&#233;rage et la correction 
des disfluences dans l&#8217;&#233;tape en aval. Le segment (4) repr&#233;sente le segment disfluent de l&#8217;&#233;nonc&#233; (3). 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#160;&#1587;&#1606;&#1608;&#1578;&#160;&#1608;&#1601;&#1593;&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;
</p>
<p>&#4670;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#160;&#1831;&#1858;&#1875;&#160;&#1872;&#1875;&#1866;&#1871;&#4671;
&#4666;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#160;&#160;&#1868;&#1853;&#1870;&#1856;&#1867;&#1866;&#160;&#1846;&#1873;&#1866;&#1861;&#1871;&#4667;
</p>
<p>&#4718;&#1830;&#1861;&#1871;&#1858;&#1864;&#1873;&#1857;&#1866;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2781;&#4667; 
</p>
<p>Pour d&#233;limiter le segment disfluent, notre m&#233;thode se base sur des r&#232;gles de d&#233;limitation ainsi que sur la 
pr&#233;sence ou non de mots isol&#233;s. Les r&#232;gles de d&#233;limitation prennent en consid&#233;ration les mots au sein des 
segments, les &#233;tiquettes s&#233;mantiques des mots, ainsi que les types des segments conceptuels. Dans le cas 
de pr&#233;sence des mots isol&#233;s, les fronti&#232;res du segment disfluent sont faciles &#224; rep&#233;rer. En effet, le segment 
disfluent est compos&#233; du mot isol&#233; et des segments qui l&#8217;entourent. Le segment (5) repr&#233;sente le segment 
disfluent dans l&#8217;&#233;nonc&#233; (2). Ce segment est compos&#233; d&#8217;une r&#233;p&#233;tition du mot &#171; &#1577;&#1585;&#1603;&#1584;&#1578; &#187; [t*krp] (billet) et du 
segment &#171; &#1587;&#1602;&#1575;&#1601;&#1589; &#1606;&#1605; &#187; [mn SfAqs] (de Sfax), et d&#8217;une autocorrection du type de billet &#171; &#1576;&#1575;&#1726;&#1584; &#187; [*hAb] 
(aller simple) par &#171; &#1576;&#1575;&#1726;&#1584;-&#1576;&#1575;&#1610;&#1573;  &#187; [*hAb-Iy~Ab] (aller-retour). 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;&#1576;&#1575;&#1610;&#1573;&#160; &#3398; &#1576;&#1575;&#1726;&#1584;&#160; &#1585;&#1603;&#1584;&#1578;&#1608;&#1601;&#1593;&#1577; &#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;&#1576;&#1575;&#1726;&#1584;&#160;&#1577;&#1585;&#1603;&#1584;&#1578;&#160;
</p>
<p>&#4670;&#1872; &#1499; &#1863;&#1870;&#1868; &#1499; &#1860;&#1827;&#1854;&#160;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#160;&#1831;&#1858;&#1875;&#160; &#1499; &#1872; &#1499; &#1863;&#1870;&#1868; &#1499; &#1860;&#1827;&#1854; &#3398; &#1835;&#1877;~&#1827;&#1854;&#160;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#4671;
&#4666;&#1854;&#1861;&#1864;&#1864;&#1857;&#1872;&#160;&#1853;&#1864;&#1864;&#1857;&#1870;&#160;&#1871;&#1861;&#1865;&#1868;&#1864;&#1857;&#160;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#160;&#1868;&#1853;&#1870;&#1856;&#1867;&#1866;&#160;&#160;&#1854;&#1861;&#1864;&#1864;&#1857;&#1872;&#160;&#1853;&#1864;&#1864;&#1857;&#1870; &#3398; &#1870;&#1857;&#1872;&#1867;&#1873;&#1870;&#160;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#4667;
</p>
<p>&#4718;&#1830;&#1861;&#1871;&#1858;&#1864;&#1873;&#1857;&#1866;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2782;&#4667; 
</p>
<p>Dans le cas de non pr&#233;sence de mots isol&#233;s qui ciblent l&#8217;analyse, les r&#232;gles de d&#233;limitation sont appliqu&#233;es 
sur tout l&#8217;&#233;nonc&#233; afin de v&#233;rifier l&#8217;existence ou non de segments disfluents. Ces segments disfluents, s&#8217;ils 
existent, sont constitu&#233;s par des autocorrections (segments corrig&#233;s par d&#8217;autres segments) et/ou par des 
r&#233;p&#233;titions. L&#8217;&#233;nonc&#233; (6) repr&#233;sente l&#8217;autocorrection du segment &#171; &#1583;&#1575;&#1585;&#1571; &#1606;&#1605;&#1579;  &#187; [OrAd vmn] (vouloir prix) par 
le segment &#171; &#1585;&#1575;&#1591;&#1602; &#1578;&#1602;&#1608; &#1583;&#1575;&#1585;&#1571; &#187; [OrAd wqt qTAr] (vouloir horaire train). Cette autocorrection est faite sans la 
pr&#233;sence d&#8217;un marqueur de rectification, d&#8217;une amorce ou m&#234;me d&#8217;une h&#233;sitation. 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#160;&#1585;&#1575;&#1591;&#1602;&#160;&#1578;&#1602;&#1608;&#160;&#1583;&#1575;&#1585;&#1571;
</p>
<p>&#4670;&#160;&#1841;&#1870;&#1827;&#1856;&#160;&#1875;&#1869;&#1872;&#160;&#1869;&#1846;&#1827;&#1870;&#4671;
&#4666;&#1874;&#1867;&#1873;&#1864;&#1867;&#1861;&#1870;&#160;&#1860;&#1867;&#1870;&#1853;&#1861;&#1870;&#1857;&#160;&#1872;&#1870;&#1853;&#1861;&#1866;&#160;&#4667;
</p>
<p>&#4718;&#1830;&#1857;&#1865;&#1853;&#1866;&#1856;&#1857;_&#1834;&#1867;&#1870;&#1853;&#1861;&#1870;&#1857;&#4689;&#160;&#160;&#160;&#4688;
&#1606;&#1605;&#1579;&#160;&#1583;&#1575;&#1585;&#1571;&#160;
</p>
<p>&#4670;&#1841;&#1870;&#1827;&#1856;&#160;&#1874;&#1865;&#1866;&#4671;
&#4666;&#1874;&#1867;&#1873;&#1864;&#1867;&#1861;&#1870;&#160;&#1868;&#1870;&#1861;&#1876;&#4667;
</p>
<p>&#4718;&#1830;&#1857;&#1865;&#1853;&#1866;&#1856;&#1857;_&#1842;&#1870;&#1861;&#1876;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &#4666;&#2783;&#4667;&#160;&#160; 
</p>
<p>Le segment (7) est le segment disfluent de l&#8217;&#233;nonc&#233; (6) apr&#232;s l&#8217;utilisation des r&#232;gles de d&#233;limitation. 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;&#160;
&#1585;&#1575;&#1591;&#1602;&#160;&#1578;&#1602;&#1608;&#160;&#1583;&#1575;&#1585;&#1571;&#160;&#1606;&#1605;&#1579;&#160;&#1583;&#1575;&#1585;&#1571;
</p>
<p>&#4670;&#1841;&#1870;&#1827;&#1856;&#160;&#1874;&#1865;&#1866;&#160;&#1841;&#1870;&#1827;&#1856;&#160;&#1875;&#1869;&#1872;&#160;&#1869;&#1846;&#1827;&#1870;&#4671;
&#4666;&#1874;&#1867;&#1873;&#1864;&#1867;&#1861;&#1870;&#160;&#1868;&#1870;&#1861;&#1876;&#160;&#1874;&#1867;&#1873;&#1864;&#1867;&#1861;&#1870;&#160;&#1860;&#1867;&#1870;&#1853;&#1861;&#1870;&#1857;&#160;&#1872;&#1870;&#1853;&#1861;&#1866;&#4667;
</p>
<p>&#4718;&#1830;&#1861;&#1871;&#1858;&#1864;&#1873;&#1857;&#1866;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2784;&#4667;&#160;&#160; 
</p>
<p>Le r&#233;sultat de cette &#233;tape est un &#233;nonc&#233; d&#233;coup&#233; &#224; la fois en segments conceptuels et en segments 
disfluents (si ces derniers existent). Les segments disfluents seront trait&#233;s au niveau de l&#8217;&#233;tape suivante. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Abir Masmoudi, Lamia Hadrich Belguith 
</p>
<p>&#8226; D&#233;tection et correction des disfluences 
L&#8217;objectif de cette &#233;tape est de d&#233;tecter les disfluences existantes dans les segments disfluents d&#233;j&#224; 
rep&#233;r&#233;s dans l&#8217;&#233;tape pr&#233;c&#233;dente, ensuite, de les corriger. Pour se faire, la reconnaissance de patrons est 
appliqu&#233;e. Cette technique consiste &#224; parcourir l&#8217;ensemble des patrons afin de d&#233;terminer, pour chaque 
segment disfluent, le patron qui lui correspond. &#192; ce stade d&#8217;analyse, nous tenons &#224; signaler que la 
reconnaissance de patrons se fait d&#8217;une mani&#232;re robuste. En effet, lors de la reconnaissance, un patron 
peut &#234;tre retenu m&#234;me si le segment disfluent comporte un ou plusieurs mots consid&#233;r&#233;s inutiles et qui 
n&#8217;ont pas de correspondants dans le patron. Cette robustesse permet de r&#233;duire le nombre de patrons 
utilis&#233;s et de surmonter un probl&#232;me sp&#233;cifique &#224; la langue arabe &#224; savoir, la grande taille des &#233;nonc&#233;s. 
</p>
<p>Les patrons utilis&#233;s concernent les cas de r&#233;p&#233;titions, d&#8217;autocorrections, d&#8217;h&#233;sitations, d&#8217;amorces ou de 
combinaison des quatre types de disfluences. Ces patrons permettent l&#8217;identification i) de suites de mots 
r&#233;p&#233;t&#233;s (de mani&#232;re identique : M), repris (mots diff&#233;rents jouant le m&#234;me r&#244;le s&#233;mantique : R) ou ajout&#233;s 
(mots neutres : X), ii) d&#8217;un terme d&#8217;&#233;dition (marqueur de reprise : ET) et iii) d&#8217;un point d&#8217;interruption 
not&#233; par une barre verticale (|). Ainsi, le patron correspondant au segment disfluent (5) est le suivant : 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;
M3
</p>
<p>&#160; &#1606;&#1605;
M2
</p>
<p>&#160;&#160;&#160;&#1576;&#1617;&#1575;&#1610;&#1573;&#3398; &#1576;&#1575;&#1726;&#1584;
R1
</p>
<p>&#160;&#160;&#160;&#1577;&#1585;&#1603;&#1584;&#1578;
M1
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#1608;&#1601;&#1593;
ET
</p>
<p>&#160;&#160;&#160;&#160; | &#160;&#160;
&#1587;&#1602;&#1575;&#1601;&#1589;&#160;
M3
</p>
<p>&#160;&#160; &#1606;&#1605;
M2
</p>
<p>&#160;&#160;&#160;&#1576;&#1575;&#1726;&#1584;
R1
</p>
<p>&#160;&#160;&#1577;&#1585;&#1603;&#1584;&#1578;
M1
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2785;&#4667;&#160; 
</p>
<p>Le segment disfluent est alors d&#233;crit comme la succession d&#8217;un reparandum (partie du segment qui sera 
corrig&#233;e par la suite), d&#8217;un interregnum optionnel (marqueur de reprise) et d&#8217;un repair (partie qui corrige 
le reparandum) comme illustr&#233; par l&#8217;exemple (9). 
</p>
<p>&#4686;
&#160;&#160;&#160;&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;&#1576;&#1575;&#1610;&#1573;&#3398; &#1576;&#1575;&#1726;&#1584;&#160;&#1577;&#1585;&#1603;&#1584;&#1578;&#160;
</p>
<p>&#4670;&#1872; &#1499; &#1863;&#1870;&#1868; &#1499; &#1860;&#1827;&#1854; &#3398; &#1835;&#1877;~&#1827;&#1854;&#160;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#4671;
&#4666;&#1854;&#1861;&#1864;&#1864;&#1857;&#1872;&#160;&#1853;&#1864;&#1864;&#1857;&#1870; &#3398; &#1870;&#1857;&#1872;&#1867;&#1873;&#1870;&#160;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#4667;
</p>
<p>&#4687;
</p>
<p>&#3019;&#3032;&#3043;&#3028;&#3036;&#3045;
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4686;
&#1608;&#1601;&#1593;
</p>
<p>&#4670;&#1831;&#1858;&#1875;&#4671;
&#4666;&#1868;&#1853;&#1870;&#1856;&#1867;&#1866;&#4667;
</p>
<p>&#4687;
</p>
<p>&#3010;&#3041;&#3047;&#3032;&#3045;&#3045;&#3032;&#3034;&#3041;&#3048;&#3040;
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4686;
&#160;&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;&#1576;&#1575;&#1726;&#1584;&#160;&#1577;&#1585;&#1603;&#1584;&#1578;&#160;&#160;&#160;
</p>
<p>&#4670;&#1872; &#1499; &#1863;&#1870;&#1868; &#1499; &#1860;&#1827;&#1854;&#160;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#160;&#4671;
&#4666;&#1854;&#1861;&#1864;&#1864;&#1857;&#1872;&#160;&#1853;&#1864;&#1864;&#1857;&#1870;&#160;&#1871;&#1861;&#1865;&#1868;&#1864;&#1857;&#160;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#4667;
</p>
<p>&#4687;
</p>
<p>&#3019;&#3032;&#3043;&#3028;&#3045;&#3028;&#3041;&#3031;&#3048;&#3040;
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2786;&#4667; 
</p>
<p>Pour la correction proprement dite, le repair est gard&#233; ; cependant l&#8217;interregnum ainsi que le reparandum 
sont supprim&#233;s. Le segment r&#233;sultat subit une analyse similaire &#224; celle de l&#8217;&#233;tape de d&#233;coupage en 
segments conceptuels afin de le segmenter en segments conceptuels et de raffiner les &#233;tiquettes 
s&#233;mantiques des mots qui les composent. Les deux segments conceptuels (10) repr&#233;sentent le segment 
disfluent (5) apr&#232;s correction et d&#233;coupage en segments conceptuels. 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;
</p>
<p>&#4670;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#4671;
&#4666;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#4667;
</p>
<p>&#4718;&#1830;&#233;&#1868;&#1853;&#1870;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4688;
&#1576;&#1617;&#1575;&#1610;&#1573; &#3398;&#1576;&#1575;&#1726;&#1584;&#160;&#160;&#160; &#1578;&#1577;&#1585;&#1603;&#1584;
</p>
<p>&#4670;&#1872; &#1499; &#1863;&#1870;&#1868; &#1499; &#1860;&#1827;&#1854; &#3398; &#1835;&#1877;~&#1827;&#1854;&#4671;
&#4666;&#1854;&#1861;&#1864;&#1864;&#1857;&#1872;&#160;&#1853;&#1864;&#1864;&#1857;&#1870; &#3398; &#1870;&#1857;&#1872;&#1867;&#1873;&#1870;&#4667;
</p>
<p>&#4718;&#1846;&#1877;&#1868;&#1857;_&#1828;&#1861;&#1864;&#1864;&#1857;&#1872;&#4689;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2778;&#2777;&#4667; 
</p>
<p>5 Mise en &#339;uvre et &#233;valuation de la m&#233;thode propos&#233;e 
Nous avons impl&#233;ment&#233; la m&#233;thode propos&#233;e avec le langage JAVA sous l&#8217;environnement JBuilder 2007. 
Les patrons et les segments conceptuels sont regroup&#233;s dans des fichiers XML. Pour valider notre 
proposition, nous avons int&#233;gr&#233; notre syst&#232;me de traitement des disfluences dans le module de 
compr&#233;hension du syst&#232;me SARF (Serveur vocal Arabe des Renseignements sur le transport Ferroviaire). 
Nous signalons qu&#8217;avant l&#8217;int&#233;gration de notre syst&#232;me au sein du module de compr&#233;hension, ce dernier 
ne traitait pas les disfluences. Par ailleurs, lors de l&#8217;&#233;valuation du syst&#232;me SARF, ce dernier a obtenu 
71.79% comme taux de F-Measure et 18.54% comme taux d&#8217;erreurs (Hadrich Belguith et al., 2009). 
</p>
<p>Pour montrer l&#8217;efficacit&#233; de notre syst&#232;me de traitement des disfluences et son apport vis-&#224;-vis du syst&#232;me 
SARF, nous avons pris le m&#234;me corpus utilis&#233; lors de sa derni&#232;re &#233;valuation. Ce corpus a &#233;t&#233; construit 
selon la technique du Magicien d&#8217;Oz. Il est constitu&#233; de 2535 &#233;nonc&#233;s (soit 32520 mots) prononc&#233;s d&#8217;une 
mani&#232;re spontan&#233;e. Les occurrences d&#8217;apparition des diff&#233;rents types de disfluences dans ce corpus 
d'&#233;valuation sont : 859 autocorrections, 738 r&#233;p&#233;titions, 388 h&#233;sitations et 342 amorces. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Traitement des disfluences dans le cadre de la compr&#233;hension automatique de l&#8217;oral arabe spontan&#233; 
</p>
<p>La nouvelle &#233;valuation du module de compr&#233;hension de SARF a montr&#233; que les taux de rappel, de 
pr&#233;cision et de F-Measure sont respectivement de 79.23%, 74.09% et 76.57%. Le temps moyen 
d&#8217;ex&#233;cution d&#8217;un &#233;nonc&#233;, de 12 mots, est d&#8217;environ 0.394 secondes. Le taux d&#8217;erreurs est de 12.63% ; ce 
qui repr&#233;sente une diminution de 5.91% d&#8217;erreurs. &#192; la lumi&#232;re de ces r&#233;sultats encourageants, nous 
jugeons que la m&#233;thode propos&#233;e est efficace pour le traitement des disfluences dans l&#8217;oral arabe m&#234;me 
s&#8217;il reste &#224; &#233;tudier les cas d&#8217;&#233;chec en vue d&#8217;am&#233;liorer les r&#233;sultats obtenus. Ces cas d&#8217;&#233;chec (12.63%) 
peuvent &#234;tre r&#233;sum&#233;s comme suit : 
</p>
<p>&#8226; Le premier cas d&#8217;&#233;chec est caus&#233; par la pr&#233;sence de mots hors-vocabulaire dans les &#233;nonc&#233;s 
trait&#233;s. Ce ph&#233;nom&#232;ne est d&#251; &#224; la performance du syst&#232;me de reconnaissance utilis&#233; et non pas au 
syst&#232;me de traitement de disfluences que nous avons r&#233;alis&#233;. Prenons &#224; titre d&#8217;exemple le mot 
&#171; &#1601;&#1602;&#1587; &#187; [sqf] (toit) dans l&#8217;&#233;nonc&#233; (11). Ce mot repr&#233;sente un mot hors-vocabulaire et aura 
&#171; HV &#187; comme &#233;tiquette s&#233;mantique puisqu&#8217;il n&#8217;appartient pas &#224; notre domaine applicatif. Les 
mots hors-vocabulaire sont difficiles &#224; comprendre par le module de compr&#233;hension, ce qui 
entrave l&#8217;&#233;tiquetage s&#233;mantique et complique la t&#226;che de segmentation conceptuelle. La pr&#233;sence 
de ce type de mots lors de la segmentation entra&#238;ne une perturbation dans la s&#233;lection du bon 
segment conceptuel ; ce qui fausse la d&#233;limitation des segments disfluents et par cons&#233;quent rend 
la d&#233;tection des types de disfluences impossible. 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4686;
&#160;&#160;&#160;&#160;&#160;&#1601;&#1602;&#1587;&#160;&#160;&#1606;&#1605;&#160;&#160;&#1608;&#1601;&#1593;&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;
</p>
<p>&#4670;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#160;&#1831;&#1858;&#1875;&#160;&#1865;&#1866;&#160;&#1871;&#1869;&#1858;&#4671;&#160;
&#4666;&#160;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#160;&#1868;&#1853;&#1870;&#1856;&#1867;&#1866;&#160;&#1856;&#1857;&#160;&#1872;&#1867;&#1861;&#1872;&#160;&#4667;
</p>
<p>&#4687;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2778;&#2778;&#4667; 
</p>
<p>&#8226; Le deuxi&#232;me cas d&#8217;&#233;chec est caus&#233; par des erreurs au niveau &#233;tiquetage s&#233;mantique des &#233;nonc&#233;s 
et non pas par le syst&#232;me de traitement des disfluences. En effet, une mauvaise assignation des 
&#233;tiqu&#232;tes s&#233;mantiques, aux mots d&#8217;un &#233;nonc&#233;, peut entrainer un mauvais d&#233;coupage de ce dernier 
et par suite provoquer des erreurs de d&#233;tection des disfluences. Ce cas d&#8217;ambigu&#239;t&#233; est d&#251; 
principalement &#224; la non distinction entre les marqueurs de n&#233;gation et les marqueurs de 
rectification. &#192; titre d&#8217;exemple, le mot &#171; &#1604;&#1575; &#187; [lA] (non) de l&#8217;&#233;nonc&#233; (12) peut jouer deux r&#244;les 
s&#233;mantiques &#224; savoir, un marqueur de n&#233;gation ou un marqueur de rectification. Ce type 
d&#8217;ambigu&#239;t&#233; est r&#233;solu au niveau raffinement des &#233;tiquettes s&#233;mantiques lors de la premi&#232;re &#233;tape 
du traitement des disfluences. Cependant, &#224; l&#8217;&#233;tat actuel, notre syst&#232;me est incapable d&#8217;affecter 
au mot &#171; &#1604;&#1575; &#187; [lA] (non) la bonne &#233;tiquette s&#233;mantique. En effet, le syst&#232;me de traitement des 
disfluences doit avoir des informations sur le contexte de l&#8217;&#233;nonc&#233; (12) au sein du dialogue. 
Chose qui n&#8217;est pas encore prise en consid&#233;ration dans la m&#233;thode propos&#233;e. 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4686;
&#160;&#160;&#160;&#160;&#160;&#1587;&#1606;&#1608;&#1578;&#160;&#160;&#1606;&#1605;&#160;&#160;&#1604;&#1575;&#160;&#160;&#1587;&#1602;&#1575;&#1601;&#1589;&#160;&#1606;&#1605;&#160;
&#4670;&#1865;&#1866;&#160;&#1845;&#1858;&#1827;&#1869;&#1871;&#160;&#1864;&#1827;&#160;&#1865;&#1866;&#160;&#1872;&#1875;&#1866;&#1871;&#4671;
&#4666;&#160;&#1856;&#1857;&#160;&#1845;&#1858;&#1853;&#1876;&#160;&#160;&#1866;&#1867;&#1866;&#160;&#1856;&#1857;&#160;&#1846;&#1873;&#1866;&#1861;&#1871;&#160;&#4667;
</p>
<p>&#4687;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2778;&#2779;&#4667; 
</p>
<p>&#8226; Le troisi&#232;me cas d&#8217;&#233;chec est d&#251; &#224; la pr&#233;sence d&#8217;&#233;num&#233;rations dans les &#233;nonc&#233;s. En effet, l&#8217;aspect 
structurel d&#8217;une &#233;num&#233;ration est tr&#232;s proche de celui d&#8217;une autocorrection. &#192; titre d&#8217;exemple, 
l&#8217;&#233;nonc&#233; (13) pr&#233;sente une &#233;num&#233;ration de deux types de billet &#224; savoir, &#171; &#1576;&#1575;&#1726;&#1584; &#187; [*hAb] (aller 
simple) et &#171; &#1576;&#1575;&#1726;&#1584;-&#1576;&#1575;&#1610;&#1575;  &#187; [*hAb-AyAb] (aller retour) que notre syst&#232;me a consid&#233;r&#233; comme &#233;tant un 
cas d&#8217;autocorrection. Ce ph&#233;nom&#232;ne fausse les r&#233;sultats et reste non encore r&#233;solu dans la plupart 
des syst&#232;mes de traitement des disfluences. 
</p>
<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4686;
&#160;&#160;&#160;&#1576;&#1575;&#1610;&#1575;&#3398; &#1576;&#1575;&#1726;&#1584;&#160;&#160;&#1576;&#1575;&#1726;&#1584;&#160;&#160;&#1606;&#1610;&#1578;&#1585;&#1603;&#1584;&#1578;&#160;&#1585;&#1593;&#1587;&#160;&#1608;&#1726;&#1575;&#1605;&#160;&#160;&#160;
</p>
<p>&#4670;&#1865;&#1827;&#1860;&#1875;&#160;&#1871;&#1831;&#1870;&#160;&#1872; &#1499; &#1863;&#1870;&#1872;&#1877;&#1866;&#160; &#1499; &#1860;&#1827;&#1854; &#1499; &#1860;&#1827;&#1854; &#3398; &#1827;&#1877;&#1827;&#1854;&#4671;
&#4666;&#160;&#1843;&#1873;&#1857;&#1864;&#160;&#1857;&#1871;&#1872;&#160;&#1864;&#1857;&#160;&#1868;&#1870;&#1861;&#1876;&#160;&#1856;&#1857;&#160;&#1856;&#1857;&#1873;&#1876;&#160;&#1872;&#1861;&#1855;&#1863;&#1857;&#1872;&#1871;&#160;&#1853;&#1864;&#1864;&#1857;&#1870;&#160;&#1871;&#1861;&#1865;&#1868;&#1864;&#1857;&#160;&#160;&#1853;&#1864;&#1864;&#1857;&#1870;&#160;&#1870;&#1857;&#1872;&#1867;&#1873;&#1870;&#160;&#4667;
</p>
<p>&#4687;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#4666;&#2778;&#2780;&#4667; 
</p>
<p>6 Conclusion et perspectives 
La compr&#233;hension de la parole spontan&#233;e est un th&#232;me de recherche tr&#232;s riche m&#234;me s&#8217;il reste encore de 
nombreux progr&#232;s &#224; faire. En particulier, la parole arabe qui n&#8217;a pas fait l&#8217;objet de plusieurs travaux de </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Youn&#232;s Bahou, Abir Masmoudi, Lamia Hadrich Belguith 
</p>
<p>recherche (compar&#233;e &#224; d&#8217;autres langues comme l&#8217;anglais et le fran&#231;ais). Cela est d&#251; d&#8217;une part, au 
manque d&#8217;outils n&#233;cessaires (i.e., principalement les corpus oraux) et d&#8217;autre part, aux sp&#233;cificit&#233;s de 
l&#8217;oral arabe (i.e., diversit&#233; dialectale de l&#8217;arabe parl&#233;, irr&#233;gularit&#233; de l&#8217;ordre des mots, etc.). 
</p>
<p>Dans cet article, nous avons propos&#233; une m&#233;thode originale pour le traitement des disfluences dans le 
cadre de la compr&#233;hension de la parole arabe spontan&#233;e. Cette m&#233;thode repose sur une approche &#224; base de 
patrons et combine la technique de la reconnaissance de patrons &#224; une segmentation conceptuelle. Ainsi, 
un &#233;nonc&#233; &#233;tiquet&#233; s&#233;mantiquement passe par trois &#233;tapes de traitement : &#233;tape du d&#233;coupage en segments 
conceptuels, &#233;tape de d&#233;limitation des segments disfluents et &#233;tape de d&#233;tection et de correction des 
disfluences. Les r&#233;sultats que nous avons obtenus sont encourageants (F-Measure &#233;gale &#224; 76.57%). 
</p>
<p>Comme perspectives, nous envisageons d&#8217;&#233;tudier les ph&#233;nom&#232;nes de n&#233;gation et d&#8217;&#233;num&#233;ration en vue 
d&#8217;apporter des solutions quant &#224; leur d&#233;tection. Cela &#233;vitera de les confondre avec les disfluences. Aussi, 
nous projetons de traiter les mots hors-vocabulaire (i.e., les mots inconnus par le syst&#232;me de 
compr&#233;hension et les mots mal-reconnus par le syst&#232;me de la reconnaissance vocale). 
</p>
<p>R&#233;f&#233;rences 
Bahou Y., Hadrich Belguith L., Ben Hamadou A. (2008). Towards a Human-Machine Spoken Dialogue 
in Arabic. LREC&#8217;08, Workshop HLT within the Arabic World: Arabic Language and local languages 
processing Status Updates and Prospects, Marrakech, Morocco. 
</p>
<p>Bear J., Dowding J., Shriberg E. (1992). Integrating Multiple Knowledge Sources for Detection and 
Correction of Repairs in Human-Computer Dialog, In Proceedings of the 30th Annual Meeting of the 
Association for Computational Linguistics, Newark, Deleware, USA. 
</p>
<p>Bouraoui J.-L. (2009). Traitement automatique de dysfluences dans un corpus linguistiquement 
constraint, Actes de la 16&#232;me Conf&#233;rence sur le Traitement Automatique des Langues Naturelles, 
TALN&#8217;09, Senlis, France. 
</p>
<p>Bousquet-Vernhettes C. (2002). Compr&#233;hension Robuste de la Parole Spontan&#233;e dans le Dialogue Oral 
Homme-Machine &#8211; D&#233;codage Conceptuel Stochastique, Th&#232;se de doctorat &#224; l&#8217;Universit&#233; de Toulouse III&#8211;
Paul SABATIER, France. 
</p>
<p>Bove R. (2008). A Tagged Corpus-Based Study for Repeats and Self-Repairs Detection in French 
Transcribed Speech, Proceedings of the 11th International Conference on Text, Speech and Dialogue, 
TSD&#8217;08, Brno, Czech Republic. 
</p>
<p>Core M., Schubert L. (1999). A Model of Speech Repairs and Other Disruptions, AAAI Fall Symposium 
on Psychological Models of Communication in Collaborative Systems, Cape Cod, MA, USA. 
</p>
<p>Hadrich Belguith L., Bahou Y., Ben Hamadou A. (2009). Une m&#233;thode guid&#233;e par la s&#233;mantique pour la 
compr&#233;hension automatique des &#233;nonc&#233;s oraux arabes. International journal of information sciences for 
decision making, ISDM&#8217;09, volume 35. 
</p>
<p>Heeman P.A., Allen J.F. (1996). Combining the Detection and Correction of Speech Repairs, In 
Proceedings of International Conference of Spoken Language Processing, Philadelphia, PA, USA. 
</p>
<p>Kurdi Z. (2003). Contribution &#224; l&#8217;analyse du langage oral spontan&#233;, th&#232;se de doctorat &#224; l&#8217;universit&#233; 
Joseph Fourier, France. 
</p>
<p>Mckelvie D. (1998). The syntax of disfluency in spontaneous spoken language. Technical Report 
HCRC/RP-95, Edinburgh University, Edinburgh, Scotland. </p>

</div></div>
</body></html>