<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La phras&#233;ologie en langue, en dictionnaire et en TALN</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Le 9 juillet 2010 
La phras&#233;ologie en langue, en dictionnaire et en TALN 
</p>
<p>Igor Mel&#8217;&#269;uk, OLST, Universit&#233; de Montr&#233;al 
</p>
<p>1 Introduction 
Je n&#8217;ai pas besoin d&#8217;insister sur l&#8217;importance de la phras&#233;ologie pour la linguistique en g&#233;n&#233;ral et 
</p>
<p>pour le TALN en particulier. Cela serait essayer d&#8217;enfoncer une porte ouverte : sur ce point, la 
</p>
<p>communaut&#233; linguistique est d&#8217;accord. Ce sur quoi on n&#8217;est pas tellement d&#8217;accord est le contenu 
</p>
<p>exact de la notion &#171; phras&#233;ologie &#187;, la fa&#231;on dont les expressions phras&#233;ologiques doivent &#234;tre 
</p>
<p>d&#233;crites et, enfin, qu&#8217;est-ce qu&#8217;on peut faire avec ces expressions dans le traitement automatique 
</p>
<p>de langues. Je vais me pencher sur ces trois points. Par cons&#233;quent, mon expos&#233; sera divis&#233; en 
</p>
<p>quatre sections (sans compter cette Introduction). La section 2 propose la d&#233;finition rigoureuse du 
</p>
<p>concept &#8216;phras&#232;me&#8217; et offre une typologie exhaustive des phras&#232;mes, en &#233;tablissant de ce fait les 
</p>
<p>fronti&#232;res de la phras&#233;ologie. La section 3 pr&#233;sente les fondements de description lexicographique 
</p>
<p>des phras&#232;mes dans un Dictionnaire Explicatif et Combinatoire. C&#8217;est en fait la partie centrale de 
</p>
<p>la pr&#233;sentation : je propose qu&#8217;une paire de bons dictionnaires est n&#233;cessaire et (presque) suffi-
</p>
<p>sante pour assurer &#8211; bien entendu, ensemble avec une grammaire &#8211; la traduction automatique de 
</p>
<p>qualit&#233; acceptable. Bien entendu, une description syst&#233;matique et formelle de la phras&#233;ologie sera 
</p>
<p>b&#233;n&#233;fique pour d&#8217;autres t&#226;ches du TALN (l&#8217;analyse et la g&#233;n&#233;ration des textes, entre autres). 
</p>
<p>Dans la section 4, j&#8217;examine trois exemples difficiles de traduction automatique o&#249; les solutions 
</p>
<p>viennent surtout du dictionnaire. Finalement, la section 5 r&#233;sume les points les plus importants de 
</p>
<p>la pr&#233;sentation. 
</p>
<p>La discussion est men&#233;e dans le cadre th&#233;orique Sens-Texte. Je suis oblig&#233; d&#8217;utiliser certaines 
</p>
<p>notions et formalismes sans explication pr&#233;alable. Pour des renseignements additionnels sur 
</p>
<p>l&#8217;approche Sens-Texte, le lecteur est pri&#233; de s&#8217;adresser &#224; Mel&#8217;&#269;uk 1981, 1988a: 43-91, 1997, Ka-
</p>
<p>hane 2003a. Les termes techniques apparaissent en Helvetica. 
</p>
<p>2 La phras&#233;ologie en langue 
Une expression phras&#233;ologique &#8211; on dit aussi &#171; fig&#233;e &#187;, &#171; fixe &#187;, ou &#171; idiomatique &#187; &#8211; est un 
</p>
<p>syntagme, expression constitu&#233;e de plusieurs lex&#232;mes (au moins deux) li&#233;s par des liens synta-
xiques r&#233;guliers. Ainsi, l&#8217;expression casser sa pipe &#8776; &#8216;mourir&#8217; est syntaxiquement et morphologi-
</p>
<p>quement organis&#233;e comme tous les syntagmes fran&#231;ais du type &#171; Verbe transitif&#8212;COdir &#187; : casser </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 2 
</p>
<p>son jouet, aimer ses parents ou voir un tigre. M&#234;me la s&#233;quence casser sa pipe peut signifier 
</p>
<p>&#8216;casser sa pipe&#8217; ! Ce qui rend cette expression sp&#233;ciale est la pr&#233;sence du sens impr&#233;visible : 
</p>
<p>&#8216;mourir&#8217;. Une expression phras&#233;ologique, qui sera appel&#233;e dor&#233;navant phras&#232;me, est un syn-
tagme phras&#233;ologis&#233;, ou bien non libre. Il faut donc commencer par d&#233;finir le syntagme libre. 
Syntagme libre 
</p>
<p>Un syntagme est libre si et seulement si [= ssi] chacun de ses composants Li est s&#233;lectionn&#233; 
par le locuteur de fa&#231;on non contrainte : strictement pour son sens, respectant les propri&#233;-
t&#233;s du Li choisi, mais ind&#233;pendamment des autres composants. 
</p>
<p>Corollaire : chacun de composants d&#8217;un syntagme libre peut &#234;tre remplac&#233; par n&#8217;importe quel sy-
</p>
<p>nonyme sans affecter le sens du syntagme (en tenant compte, bien entendu, des propri&#233;t&#233;s parti-
</p>
<p>culi&#232;res des synonymes substitu&#233;s). 
</p>
<p>Syntagme non libre &#12296;= phras&#233;ologis&#233;&#12297; 
Un syntagme est non libre si et seulement si [= ssi] au moins un de ses composants est s&#233;-
lectionn&#233; de fa&#231;on contrainte : en fonction des autres composants. 
</p>
<p>Un syntagme non libre s&#8217;appelle phras&#232;me. 
Corollaire : aucun composant d&#8217;un phras&#232;me ne peut &#234;tre remplac&#233; par n&#8217;importe quel synonyme 
</p>
<p>(m&#234;me si quelques synonymes peuvent &#234;tre admis : louper/manquer/rater le coche &#8216;perdre une 
</p>
<p>occasion de faire qqch de profitable&#8217;). 
</p>
<p>Un phras&#232;me viole donc la libert&#233; de s&#233;lection (de ses composants). Cette violation peut 
survenir soit dans le passage entre la R(epr&#233;sentation)Concept(uelle) et la RS&#233;m(antique) d&#8217;une ex-
</p>
<p>pression linguistique, soit dans le passage entre la RS&#233;m et l&#8217;expression elle-m&#234;me. 
</p>
<p>Dans le premier cas (o&#249; le locuteur choisit une RS&#233;m pour une RConcept de d&#233;part), on ob-
</p>
<p>tient des phras&#232;mes pragmatiques, ou pragmat&#232;mes : dans une situation de communication 
langagi&#232;re donn&#233;e, la s&#233;lection du sens pour exprimer la RConcept donn&#233;e est contrainte, de sorte 
</p>
<p>qu&#8217;il faut utiliser un sens particulier et l&#8217;exprimer avec des moyens particuliers. Par exemple, soit 
</p>
<p>le contenu informationnel &#8216;l&#8217;auteur de ce texte fait ressortir ce fragment de la citation en cause&#8217;, 
</p>
<p>la situation d&#8217;&#233;nonciation &#233;tant la suivante : le locuteur veut mettre la remarque correspondante 
</p>
<p>dans le texte imprim&#233;. En fran&#231;ais on &#233;crit dans ce cas C&#8217;est moi qui souligne, en anglais Ita-
</p>
<p>lics/Emphasis mine lit. &#8216;Italique/Emphase &#224;.moi&#8217; et en allemand, Hervorhebung des Autors lit. 
</p>
<p>&#8216;Rehaussement de l&#8217;auteur&#8217;. Par les gloses, on voit que les sens exprim&#233;s sont diff&#233;rents dans les </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 3 
</p>
<p>trois langues et qu&#8217;ils sont fix&#233;s dans chaque langue par la situation extralinguistique o&#249; le prag-
</p>
<p>mat&#232;me en cause est utilis&#233;. 
</p>
<p>Le deuxi&#232;me cas (le locuteur choisit une expression langagi&#232;re pour une RS&#233;m) donne des 
</p>
<p>phras&#232;mes s&#233;mantiques : ici, le sens &#8211; c&#8217;est &#224; dire, la RS&#233;m &#8211; est s&#233;lectionn&#233; librement, mais 
dans le syntagme qui l&#8217;exprime au moins un composant ne l&#8217;est pas. Les phras&#232;mes s&#233;mantiques 
</p>
<p>incluent les clich&#233;s, les collocations et les locutions, qu&#8217;on distingue selon deux dimensions, 
paradigmatique et syntagmatique : le degr&#233; de non-libert&#233; de s&#233;lection et la compositionnalit&#233;. 
</p>
<p>Pour caract&#233;riser de fa&#231;on plus pr&#233;cise ces types de phras&#232;mes, nous avons besoin de la notion 
</p>
<p>de compositionnalit&#233; de signes linguistiques. Un signe linguistique s est un triplet 
s = &#12296; &#8216;&#963;&#8217; ; /s/ ; &#931; &#12297;, o&#249; : 
</p>
<p>&#8211; &#8216;&#963;&#8217; est le signifi&#233;, ou un contenu informationnel, le plus souvent un sens linguistique ; 
&#8211; /s/ est le signifiant, ou un signal physique, le plus souvent une cha&#238;ne de phon&#232;mes (ou de 
</p>
<p>caract&#232;res &#8211; &#224; l&#8217;&#233;crit) ; 
</p>
<p>&#8211; &#931; est le syntactique, ou un ensemble d&#8217;informations sp&#233;cifiant la cooccurrence de s avec 
d&#8217;autres signes. 
</p>
<p>Ainsi, le nom MONTAGNE est repr&#233;sent&#233; en tant que signe comme suit : 
</p>
<p>&#12296; &#8216;importante &#233;l&#233;vation du terrain&#8217; ; /m&#596;&#771;t&#227;&#626;/ ; &#931; = nom, commun, f&#233;m, ...&#12297; 
</p>
<p>Les signes simples se combinent en signes complexes par l&#8217;op&#233;ration d&#8217;union linguistique &#8853;. 
Cette op&#233;ration est repr&#233;sent&#233;e par un ensemble de r&#232;gles qui disent comment, dans une langue 
</p>
<p>donn&#233;e, r&#233;unir les signes : les signifi&#233;s (en mettant les RS&#233;m des arguments dans les positions 
</p>
<p>argumentales des pr&#233;dicats, ...), les signifiants (en juxtaposant les cha&#238;nes de phon&#232;mes et en ap-
</p>
<p>pliquant les op&#233;rations linguistiques, ...) et les syntactiques (en retenant les donn&#233;es valables pour 
</p>
<p>le signe complexe r&#233;sultant). 
</p>
<p>Signe linguistique complexe compositionnel 
Un signe linguistique complexe AB est compositionnel ssi AB = A &#8853; B. 
</p>
<p>Cela signifie que, pour le signe AB = &#12296; &#8216;AB&#8217; ; /AB/ ; &#931;AB &#12297;, le signifi&#233; &#8216;AB&#8217; = &#8216;A&#8217; &#8853; &#8216;B&#8217;, le signi-
</p>
<p>fiant /AB/ = /A/ &#8853; /B/ et le syntactique &#931;AB = &#931;A &#8853; &#931;B. 
</p>
<p>De cette d&#233;finition, il d&#233;coule que la compositionnalit&#233; est une notion absolue, qui ne conna&#238;t 
</p>
<p>pas de degr&#233;s : un signe complexe est compositionnel ou pas. La propri&#233;t&#233; d&#8217;&#234;tre compositionnel </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 4 
</p>
<p>concerne les trois composants du signe de fa&#231;on ind&#233;pendante ; dans ce qui suit nous n&#8217;allons 
</p>
<p>consid&#233;rer que la compositionnalit&#233; du signifi&#233;, soit la compositionnalit&#233; s&#233;mantique. 
Un syntagme libre est n&#233;cessairement compositionnel : c&#8217;est gr&#226;ce &#224; cette propri&#233;t&#233; que la 
</p>
<p>communication langagi&#232;re est possible. En fait, ma&#238;triser la langue L veut dire avoir dans son 
</p>
<p>cerveau tous les signes simples de L et toutes les r&#232;gles de l&#8217;op&#233;ration &#8853; pour L.  
</p>
<p>La s&#233;lection de lexies se fait sur l&#8217;axe paradigmatique de la langue, alors que leur combinaison 
</p>
<p>se passe sur l&#8217;axe syntagmatique. Ainsi notre caract&#233;risation des phras&#232;mes est exhaustive.  
</p>
<p>Donnons maintenant les d&#233;finitions des trois types majeurs de phras&#232;mes s&#233;mantiques. 
</p>
<p>Clich&#233; 
Un phras&#232;me s&#233;mantique est un clich&#233; ssi 1) aucun de ses composants n&#8217;est s&#233;lectionn&#233; li-
brement (tous les composants sont pris en bloc, comme un tout ; le clich&#233; est donc compl&#232;-
</p>
<p>tement contraint) et 2) il est compositionnel. 
</p>
<p>Exemples : Ce qu&#8217;il fallait d&#233;montrer (et non pas, par ex., *Ce qu&#8217;il &#233;tait n&#233;cessaire de prouver) ; 
</p>
<p>Autrement dit ; C&#8217;est moi qui te/vous le dis ! ; dans huit jours (plut&#244;t que dans une semaine) ; 
</p>
<p>Dans le doute, abstiens-toi. 
</p>
<p>Collocation 
Un phras&#232;me s&#233;mantique est une collocation ssi 1) un de ses composants est s&#233;lectionn&#233; li-
brement et l&#8217;autre non, &#233;tant choisi en fonction du premier (la collocation est donc mi-
</p>
<p>contrainte) et 2) il est compositionnel. 
</p>
<p>Exemples : AGILE comme un singe, AIMER &#224; la folie, HOMMAGE vibrant, IGNORANCE crasse, JACAS-
</p>
<p>SER comme une pie, ... ; attacher la CEINTURE DE S&#201;CURIT&#201;, &#233;tablir &#12296;libeller&#12297; un CH&#200;QUE, tenir sa 
</p>
<p>PAROLE, battre (le) PAVILLON, d&#233;cerner un PRIX, exercer une PROFESSION, ... 
</p>
<p>Une collocation est constitu&#233;e d&#8217;une base, lexie choisie librement par le locuteur (en petites 
majuscules dans nos exemples), et d&#8217;un collocatif, choisi en fonction de la base. Elle est s&#233;manti-
quement compositionnelle, car son sens est divisible en deux parties telles que la premi&#232;re cor-
</p>
<p>respond &#224; la base et la deuxi&#232;me est exprim&#233;e par le collocatif. 
</p>
<p>Locution 
Un phras&#232;me s&#233;mantique est une locution ssi 1) aucun de ses composants n&#8217;est s&#233;lectionn&#233; 
librement (il est donc compl&#232;tement contraint) et 2) il est non compositionnel. 
</p>
<p> Une locution est indiqu&#233;e par des coins sur&#233;lev&#233;s : &#761; &#8230; &#762;. 
Exemples : &#761;par acquit de conscience&#762; &#8216;pour en &#234;tre absolument s&#251;r&#8217;, &#761;Un ange passe&#762; &#8216;Un silence 
soudain s&#8217;&#233;tablit dans une compagnie&#8217;, &#761;nager entre deux eaux&#762; &#8216;se maintenir entre les opinions </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 5 
</p>
<p>oppos&#233;es&#8217;, &#761;s&#8217;en mordre la langue&#762; &#8216;regretter d&#8217;avoir dit quelque chose&#8217;, &#761;vache &#224; lait&#762; &#8216;personne 
dont on tire profit&#8217;, &#761;aller au charbon&#762; &#8216;devoir accomplir un travail d&#233;sagr&#233;able&#8217;, &#761;rendre son ta-
blier&#762; &#8216;quitter un poste&#8217;, ... 
</p>
<p>Une locution est caract&#233;risable par le degr&#233; de sa transparence : la propri&#233;t&#233; de son sens 
d&#8217;inclure, dans un certain degr&#233;, les sens de ses composants. Trois cas de figure sont &#224; distin-
</p>
<p>guer ici ; pour les caract&#233;riser, nous allons introduire la notion de pivot s&#233;mantique. 
</p>
<p>Pivot s&#233;mantique (d&#8217;une sens) 
Posons qu&#8217;un sens &#8216;S&#8217; peut &#234;tre divis&#233; en deux parties, &#8216;s1&#8217; et &#8216;s2&#8217; (&#8216;S&#8217; = &#8216;s1&#8217; &#8853; &#8216;s2&#8217;). 
</p>
<p> La partie &#8216;s1&#8217; du sens &#8216;S&#8217; est appel&#233; le pivot s&#233;mantique de &#8216;S&#8217; ssi l&#8217;autre partie &#8216;s2&#8217; est un 
pr&#233;dicat dont &#8216;s1&#8217; est l&#8217;argument : &#8216;S&#8217; = &#8216;s2&#8217;(&#8216;s1&#8217;). 
</p>
<p>Soulignons que le pivot s&#233;mantique d&#8217;un sens &#8216;S&#8217; est logiquement diff&#233;rent du composant 
communicativement dominant de &#8216;S&#8217;. Ainsi, pour le sens &#8216;r&#233;ussir un examen&#8217;, le pivot s&#233;man-
tique est &#8216;examen&#8217;, alors que le composant dominant est &#8216;r&#233;ussir&#8217;. Cependant, dans beaucoup de 
</p>
<p>cas, les deux peuvent co&#239;ncider. Le pivot s&#233;mantique sera identifi&#233; dans nos exemples par les ha-
</p>
<p>chures. 
</p>
<p>&#8226; La quasi-locution : son sens inclut les sens de tous ses composants mais aussi un sens addi-
</p>
<p>tionnel &#171; impr&#233;visible &#187; qui est le pivot s&#233;mantique ; c&#8217;est la locution la plus transparente. 
</p>
<p>Exemples : &#761;donner le sein &#224; Y&#762; &#8216;nourrir le b&#233;b&#233; Y de fa&#231;on &#224; mettre le mamelon d&#8217;un sein dans la 
bouche de Y&#8217;, &#761;tache solaire&#762; &#8216;r&#233;gion sur la surface du soleil &#8230; per&#231;ue comme une tache&#8217;, &#761;p&#226;te 
dentifrice&#762; &#8216;substance fabriqu&#233;e sous forme de p&#226;te destin&#233;e &#224; nettoyer les dents&#8217;, &#8230;  
</p>
<p>&#8226; La semi-locution : son sens inclut le sens seulement d&#8217;un de ses composants, mais non pas 
</p>
<p>dans le r&#244;le de pivot s&#233;mantique ; c&#8217;est la locution mi-transparente. 
</p>
<p>Exemples : &#761;fruits de mer&#762; &#8216;animaux de mer comestibles qui ne sont pas des poissons&#8217;, &#761;bain de fou-
le&#762; &#8216;acte  qui consiste &#224; se m&#234;ler &#224; la foule&#8217;, &#761;eau lourde&#762; &#8216;compos&#233; chimique &#224; base d&#8217;eau o&#249; les 
deux atomes d&#8217;hydrog&#232;ne sont remplac&#233;s par deux atomes de deut&#233;rium&#8217;, &#761;prendre l&#8217;eau&#762; &#8216;[les 
chaussures] &#234;tre d&#233;fectueux de fa&#231;on &#224; laisser passer l&#8217;eau&#8217;, &#761;casser les oreilles [&#224; Y] &#8216;[sons continus 
d&#233;plaisants] causer des sensations d&#233;plaisantes dans les oreilles de Y&#8217;, &#8230; 
</p>
<p>&#8226; La locution compl&#232;te : son sens n&#8217;inclut le sens d&#8217;aucun de ses composants ; c&#8217;est la locu-
</p>
<p>tion la moins transparente, qui parfois n&#8217;est pas transparente du tout. 
</p>
<p>Exemples : &#761;river son clou [&#224; Y]&#762; &#8216;remettre Y &#224; sa place, en le r&#233;duisant au silence&#8217;, &#761;faire table ra-
se&#762; &#8216;d&#233;cider de ne tenir aucun compte de ce qui existait auparavant&#8217;, &#761;au fur et &#224; mesure&#762; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 6 
</p>
<p>[que Y] &#8216;en m&#234;me temps que Y et successivement&#8217;, &#761;hors pair&#762; &#8216;exceptionnel&#8217;, &#761;en tenue 
&#12296;costume, habit&#12297; d&#8217;Adam/d&#8217;&#200;ve&#762; &#8216;compl&#232;tement nu/e&#8217;, &#761;s&#8217;envoyer en l&#8217;air&#762; &#8216;&#233;prouver le plaisir 
sexuel&#8217;, &#8230; 
</p>
<p>Une typologie exhaustive de phras&#232;mes (les types majeurs) est pr&#233;sent&#233;e dans la Figure 1 ci-
</p>
<p>dessous. 
</p>
<p> 
</p>
<p> 
 
</p>
<p> 
</p>
<p>   
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1. Typologie des phras&#232;mes 
</p>
<p>3 La phras&#233;ologie en dictionnaire 
Le dictionnaire consid&#233;r&#233; ici est le Dictionnaire Explicatif et Combinatoire [= DEC] ; ses princi-
</p>
<p>pes, sa structure et ses notions de base sont pris pour acquises (voir Mel&#8217;&#269;uk 1988b, Mel&#8217;&#269;uk et 
</p>
<p>al. 1984-1999, Mel&#8217;&#269;uk et al. 1995, Mel&#8217;&#269;uk 2006). 
</p>
<p>Une locution est une unit&#233; lexicale, ou une lexie, tout comme un lex&#232;me. Les locutions sont 
donc d&#233;crites dans le DEC de la m&#234;me fa&#231;on que les lex&#232;mes : chacune poss&#232;de son propre arti-
</p>
<p>cle de dictionnaire, ayant la m&#234;me structure que l&#8217;article d&#8217;un lex&#232;me, avec quand m&#234;me une dif- 
</p>
<p>f&#233;rence importante : puisqu&#8217;une locution est un syntagme, elle est munie de l&#8217;arbre de sa S(struc-
</p>
<p>ture)Synt(axique)P(rofonde). Par exemple: 
</p>
<p>&#761;S&#8217;ENVOYER EN L&#8217;AIR&#762; &#8216;&#233;prouver un plaisir sexuel&#8217;, locution verbale 
SSyntP : ENVOYERREFL&#8211;II&#8594;EN&#8211;II&#8594;AIRDEF, SG 
</p>
<p>Le nombre de locutions (= phras&#232;mes non compositionnels) dans une langue est entre 10 000 
</p>
<p>et 20 000 (ainsi, le dictionnaire Rey &amp; Chanterau 1993 en contient &#224; peu pr&#232;s 9 000) ; elles peu-
</p>
<p>vent &#234;tre tout simplement stock&#233;es comme telles dans le dictionnaire, dont elles ne gonflent pas le 
</p>
<p>volume de fa&#231;on trop visible. 
</p>
<p>clich&#233;s collocations 
</p>
<p>phras&#232;mes s&#233;mantiques non compositionnels 
</p>
<p> 
</p>
<p>semi-locutions locutions compl&#232;tes 
</p>
<p>pragmat&#232;mes 
</p>
<p>phras&#232;mes 
</p>
<p>phras&#232;mes pragmatiques 
</p>
<p> 
</p>
<p>phras&#232;mes s&#233;mantiques 
</p>
<p> 
</p>
<p>locutions 
</p>
<p>quasi-locutions 
</p>
<p>phras&#232;mes s&#233;mantiques compositionnels 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 7 
</p>
<p>Par contre, les phras&#232;mes compositionnels, en particulier les collocations, ne sont pas des 
</p>
<p>lexies : ils n&#8217;ont pas d&#8217;articles de dictionnaires propres et sont d&#233;crits &#224; l&#8217;int&#233;rieur des articles de 
</p>
<p>leurs bases. Par exemple, applaudir &#224; tout rompre ne doit pas appara&#238;tre comme une entr&#233;e s&#233;pa-
</p>
<p>r&#233;e, mais sous APPLAUDIR ; tirer un ch&#232;que, non plus : on le met sous CH&#200;QUE ; et ainsi de suite. 
</p>
<p>Le nombre de collocations dans les langues de type SAE (Standard Average European) est tr&#232;s 
</p>
<p>&#233;lev&#233; : au moins dix fois le nombre de lex&#232;mes. Leur description lexicographique exige donc un 
</p>
<p>appareil formel qui permette leur pr&#233;sentation syst&#233;matique, &#233;l&#233;gante et se pr&#234;tant facilement au 
</p>
<p>traitement automatique. Un tel appareil, ce sont les fonctions lexicales [= FL] . 
Il n&#8217;est pas bien entendu possible de pr&#233;senter ici la notion de FL ni d&#8217;en offrir un tour d&#8217;hori-
</p>
<p>zon assez d&#233;taill&#233; (voir Mel&#8217;&#269;uk 1974: 78-109, 1982, 1996, 2003a, b, Kahane 2003b, Kahane &amp; 
</p>
<p>Polgu&#232;re 2001, Wanner (ed.) 1996). Je vais me limiter &#224; donner ici quelques exemples de FL syn-
</p>
<p>tagmatiques standard  et non standard, pour d&#233;montrer ensuite comment les FL peuvent &#234;tre mi-
</p>
<p>ses &#224; profit dans le TALN. 
FL syntagmatiques standard 
</p>
<p>&#8226; FL verbales 
&#8211; Verbes supports 
</p>
<p> RESPONSABILIT&#201; 
[d&#8217;avoir fait Y] 
</p>
<p>SOINS ACCUSATION AIDE 
</p>
<p>Oper1 porter [ART ~] donner [ART ~s &#224; NY] lancer [ART ~ contre NY] venir [&#224; l&#8217;~(&#8594;de NY)] 
Func1  ~ incombe [&#224; NX] ~s s&#8217;adressent [&#224; NY] &#8212;&#8212;&#8212; ~ parvient [&#224; NY de NX] 
Labor12 &#8212;&#8212;&#8212; entourer [NY de ~s]
</p>
<p>  
</p>
<p>mettre [NY en ~] venir [en ~ &#224; NY] 
</p>
<p>&#8211; Verbes de r&#233;alisation 
</p>
<p> PRIX [r&#233;compense] M&#201;DECIN PI&#200;GE ASPHALTE 
Real2 obtenir [ART ~] voir [ART ~] tomber [dans ART ~] &#8212;&#8212;&#8212; 
Fact2  ~ va [&#224; NY] ~ voit [NY] ~ prendre [NY] ~ couvre [NY] 
Labreal12  r&#233;compenser [NY de ART ~] &#8212;&#8212;&#8212; prendre [NY au ~] couvrir [NY d&#8217;~] 
 
</p>
<p>&#8226; FL adjectivales (intensificateurs et att&#233;nuateurs) 
 TREMP&#201; BOURR&#201; &#8216;so&#251;l&#8217; RESPIRER R&#212;LE RIRE 
</p>
<p>Magn  ~ comme une soupe raide ~ ~ &#224; pleins poumons ~ crucial ~ &#224; se rouler par terre 
 
</p>
<p> BLESS&#201;N DIFF&#201;RENCE SALAIRE REGARDER SOMMEIL &#194;GE 
AntiMagn ~ l&#233;ger  ~ t&#233;nue  ~ maigre  ~ du  coin de l&#8217;&#339;il ~ de chat bas ~  
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 8 
</p>
<p>FL syntagmatiques non standard 
</p>
<p>CAF&#201; &#8216;boisson chaude...&#8217; 
sans ajout de produit laitier : noir | postpos&#233; 
BOIRE [l&#8217;alcool] 
un verre d&#8217;un trait : //faire cul sec 
PRIER 
Autorit&#233;s pertinentes 
</p>
<p> vous P. de Y-er : Merci [de V(&#8216;Y&#8217;)INF] [sur un panneau] 
</p>
<p>4 La phras&#233;ologie en TALN 
Les pragmat&#232;mes, les clich&#233;s et les locutions doivent &#234;tre list&#233;s dans le dictionnaire, et nous 
</p>
<p>avons montr&#233;, comment. 
</p>
<p>Ce sont les collocations qui repr&#233;sentent le plus gros probl&#232;me dans le traitement automatique, 
</p>
<p>vu leur nombre et leur vari&#233;t&#233;. Je pense que la seule solution raisonnable de ce probl&#232;me est 
</p>
<p>l&#8217;usage des fonctions lexicales. 
</p>
<p>Les FL peuvent &#234;tre utilis&#233;es en TALN &#8211; surtout dans la traduction automatique et la g&#233;n&#233;ra-
</p>
<p>tion de textes &#8211; des deux fa&#231;ons suivantes. 
</p>
<p>&#8226; Les FL assurent la s&#233;lection lexicale correcte dans les cas de type grave maladie ~ russe 
tja&#382;&#235;laja bolezn&#180; lit. &#8216;lourde maladie&#8217;, mettre [NY] en danger ~ russe podvergat&#180; [NY] opasnos-
tiDAT lit. &#8216;soumettre [NY] au danger&#8217; ou prendre la fuite ~ russe obratit&#180;sja v begstvo lit. &#8216;se 
transformer en fuite&#8217;. De telles &#233;quivalences &#171; exotiques &#187; sont facilement couvertes par des 
paires de dictionnaires du type DEC. 
</p>
<p>&#8226; Les FL sont sous-jacentes au paraphrasage du niveau syntaxique profond, ce qui permet de 
construire la SSyntP acceptable pour la phrase de sortie dans la situation de distorsion entre 
le vocabulaire de la phrase et sa SSyntP. Par exemple, soit la phrase anglaise (1a) et ses 
traductions russe et fran&#231;aise (1b-c) : 
</p>
<p>(1 ) a. anglais She competes internationally. 
b. russe Ona u&#269;astvuet v me&#382;dunarodnyx sorevnovanijax. 
c. fran&#231;ais Elle participe &#224; des comp&#233;titions internationales. 
</p>
<p>Le verbe signifiant &#8216;[to] compete&#8217; (dans le sens vis&#233;) n&#8217;existe ni en russe ni en fran&#231;ais. Ce-
</p>
<p>pendant, un verbe V peut toujours &#234;tre paraphras&#233; par le nom d&#233;verbatif et son verbe support : 
</p>
<p>V &#8660; S0(V)&#8592;II&#8211;Oper1(S0(V)), ce qui donne compete &#8660; participate in competition(s) ; competition 
a des &#233;quivalents russe et fran&#231;ais directs. 
</p>
<p> Pour le syst&#232;me universel de paraphrasage SyntP, voir Mel&#180;&#269;uk 1974: 141-176, 1988c, 1992 
</p>
<p>and 2004, Mel&#8217;&#269;uk &amp; Wanner  2006, and Mili&#263;evi&#263; 2007 ; l&#8217;utilisation des FL dans la g&#233;n&#233;ration </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 9 
</p>
<p>de textes est d&#233;crite dans Iordanskaja et al. 1996 et Lareau &amp; Wanner. Le syst&#232;me de paraphrasa-
</p>
<p>ge pour le russe a &#233;t&#233; impl&#233;ment&#233; et test&#233; dans une s&#233;rie d&#8217;exp&#233;riences : Apresjan &amp; Cinman 
</p>
<p>1998 and 2002. 
</p>
<p>Je vais maintenant pr&#233;senter trois exemples de traduction qui sont difficiles &#224; cause des collo-
</p>
<p>cations impliqu&#233;es, pour montrer comment les FL permettent d&#8217;assurer de bons r&#233;sultats. 
NB : Pour &#234;tre s&#251;r de mes traductions, je ne consid&#232;re que la traduction vers le russe, en fournissant des gloses 
</p>
<p>d&#233;taill&#233;es. 
</p>
<p>Exemple 1 : le verbe anglais STRIKE &#8216;frapper&#8217; 
</p>
<p>Soit la phrase anglaise (2) : 
</p>
<p>(2 ) The book thief struck again lit. &#8216;Le voleur de.livres a.frapp&#233; de.nouveau&#8217;. 
</p>
<p>Sa traduction russe, la plus litt&#233;rale dont je suis capable, est 
</p>
<p>(3 ) Kni&#382;nyj vor snova sover&#353;il kra&#382;u lit. &#8216;Le voleur de.livres de.nouveau a.commis un.vol&#8217;. 
</p>
<p>Pas question de traduire le verbe STRIKE &#8216;frapper&#8217; par quelque chose comme UDARJAT&#180; &#8216;frap-
</p>
<p>per&#8217; : le r&#233;sultat serait absolument incompr&#233;hensible. Il faut traduire par la collocation sover&#353;it&#180; 
</p>
<p>kra&#382;u &#8216;commettre un vol&#8217;. Mais comment &#233;tablir l&#8217;&#233;quivalence strike &#8801; sover&#353;it&#180; kra&#382;u ? D&#8217;autant 
</p>
<p>plus que dans de nombreux contextes STRIKE a d&#8217;autres &#233;quivalences : 
</p>
<p>The hurricane struck the island again lit. &#8216;L&#8217;ouragan a.frapp&#233; l&#8217;&#238;le de nouveau&#8217;. &#8801; 
Uragan snova obru&#353;ilsja na ostrov lit. &#8216;L&#8217;ouragan de nouveau s&#8217;est.abattu sur l&#8217;&#238;le&#8217;. 
</p>
<p>The bullet struck him in the shoulder lit. &#8216;La balle l&#8217;a.frapp&#233; dans l&#8217;&#233;paule&#8217;. &#8801; 
Pulja popala emu v ple&#269;o ... lit. &#8216;La balle l&#8217;a.atteint &#224; l&#8217;&#233;paule ...&#8217; 
</p>
<p>A suicide bomber struck in the market lit. &#8216;Un terroriste kamikaze a.frapp&#233; au march&#233;&#8217;. &#8801; 
Terrorist-smertnik podorval sebja na rynke lit. &#8216;Un terroriste kamikaze a.fait.exploser soi au march&#233;&#8217;. 
</p>
<p>Dans le cas sous consid&#233;ration la r&#233;ponse vient imm&#233;diatement : tous ces emplois de STRIKE 
</p>
<p>sont des valeurs de la FL Fact0 : Fact0(L) = &#8216;faire ce que (la d&#233;notation de) L est cens&#233; faire 
</p>
<p>d&#8217;apr&#232;s sa nature&#8217;. Dans le DEC russe, on doit avoir:  
</p>
<p>Fact0(VOR &#8216;voleur&#8217;) : krast&#180; &#8216;voler&#8217;, sover&#353;at&#180; kra&#382;u &#8216;commettre un vol&#8217; 
Fact0(URAGAN &#8216;ouragan&#8217;) : obru&#353;it&#180;sja &#8216;s&#8217;abattre&#8217; 
Fact0(PULJA &#8216;balle&#8217;) : popast&#180; &#8216;atteindre&#8217; 
Fact0(TERRORIST-SMERT- 
</p>
<p>NIK &#8216;terroriste kamikaze&#8217;) : podorvat&#180; sebja &#8216;se faire exploser&#8217; 
</p>
<p>Dans le DEC anglais, on indiquera la m&#234;me chose pour les emplois de STRIKE en cause : 
Fact0(THIEF &#8216;voleur&#8217;) = strike &#8216;frapper&#8217;, etc.  
 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 10 
</p>
<p>Exemple 2 : le verbe polonais OBOWJ&#260;ZYWAC &#8216;obliger&#8217; 
</p>
<p>Consid&#233;rons le texte d&#8217;un panneau vu dans le hall d&#8217;un immeuble &#224; Varsovie : 
</p>
<p>(4 ) polonais 
Meszkanc&#243;w budynku obowj&#261;zuje cisza nocna 
habitant-PL.ACC immeuble-SG.G&#201;N obliger-PR&#201;S.3SG silence-SG.NOM nocturne 
lit. &#8216;Le silence nocturne oblige les habitants de l&#8217;immeuble&#8217;. 
</p>
<p>Le sens en est imm&#233;diatement clair : on prie les habitants de ne pas faire de bruit pendant la nuit. 
</p>
<p>La traduction russe est par cons&#233;quent aussi imm&#233;diatement claire : 
</p>
<p>(5 ) russe 
&#381;iteli doma objazany no&#269;&#180;ju sobljudat&#180; ti&#353;inu 
habitant-PL.NOM immeuble-SG.G&#201;N sont.oblig&#233;s la.nuit observer silence-SG.ACC 
&#8216;Les habitants de l&#8217;immeuble sont oblig&#233;s d&#8217;observer la nuit le silence&#8217;. 
</p>
<p>On peut obtenir cette traduction &#224; partir de (4) en n&#8217;utilisant que des informations dictionnairi-
</p>
<p>ques en ce qui concerne les phras&#232;mes. Nous y voyons deux difficult&#233;s : la traduction du verbe 
</p>
<p>OBOWJ&#260;ZYWAC &#8216;obliger&#8217; et de l&#8217;expression cisza nocna &#8216;silence nocturne&#8217;. 
</p>
<p>La premi&#232;re difficult&#233; est li&#233;e au r&#233;gime particulier du verbe polonais, que ne poss&#232;de pas son 
</p>
<p>&#233;quivalent russe, tout &#224; fait comme son &#233;quivalent fran&#231;ais : *ti&#353;ina objazyvaet&#8230; *&#8216;le silence 
</p>
<p>oblige&#8230;&#8217;. Le DEC polonais doit avoir, pour OBOWJ&#260;ZYWAC &#8216;obliger&#8217; l&#8217;indication suivante : 
</p>
<p>X obowj&#261;zuje Y-a &#8660; Y est oblig&#233; de Real1(X)&#8211;II&#8594;X 
Cette indication assure la bonne construction de la phrase1. Dans un DEC russe, on trouve, sous 
</p>
<p>TI&#352;INA, que Real1(TI&#352;INA &#8216;silence&#8217;) = sobljudat&#180; &#8216;observer&#8217;, ce qui permet de construire la partie 
</p>
<p>initiale de la phrase russe : &#381;iteli doma objazany sobljudat&#180; ti&#353;inu. 
</p>
<p>La deuxi&#232;me difficult&#233; rel&#232;ve du fait qu&#8217;en russe, le nom TI&#352;INA &#8216;silence&#8217; a le collocatif no&#269;-
</p>
<p>naja &#8216;nocturne&#8217; qui correspond exactement &#224; l&#8217;adjectif polonais nocna &#8216;nocturne&#8217; ; cependant, on 
</p>
<p>ne peut pas dire *sobljudat&#180; no&#269;nuju ti&#353;inu ! Pour pallier cela, il suffit d&#8217;indiquer, dans le sous-
</p>
<p>article de Real1(TI&#352;INA &#8216;silence&#8217;), que le modificateur temporel ou locatif du nom doit &#234;tre trans-
</p>
<p>f&#233;r&#233; vers le verbe SOBLJUDAT&#180; : 
</p>
<p>*SOBLJUDAT&#180;-II&#8594;TI&#352;INA-ATTR&#8594;&#926;(&#171;temp&#187;, &#171; loc&#187;)    &#8658;  &#926;(&#171;temp&#187;, &#171; loc&#187;)&#8592;ATTR-SOBLJUDAT&#180;-II&#8594;TI&#352;INA 
</p>
<p>(Cette r&#232;gle particuli&#232;re correspond &#224; la r&#232;gle g&#233;n&#233;rale de paraphrasage syntaxique profond : 
</p>
<p>Mel&#8217;&#269;uk 1992: 50, R&#232;gle n&#186; 19.) Le r&#233;sultat est sobljudat&#180; no&#269;&#180;ju ti&#353;inu. Une bonne traduction a 
</p>
<p>ainsi &#233;t&#233; obtenue. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 11 
</p>
<p>Exemple 3 : le nom fran&#231;ais APPOINT &#8216;montant exact pay&#233; par X &#224; Y pour Z et qui n&#8217;exige pas de 
</p>
<p>donner l&#8217;argent en retour&#8217; 
</p>
<p>&#201;criteau dans un autobus fran&#231;ais : 
</p>
<p>(6 ) Merci de faire l&#8217;appoint. 
</p>
<p>Sa traduction russe n&#8217;est pas &#233;vidente, mais en voici une variante possible : 
</p>
<p>(7 ) Platite za proezd bez sda&#269;i lit. &#8216;Payez pour le trajet sans monnaie rendue&#8217; 
[la traduction a &#233;t&#233; propos&#233;e par M. Glovinskaja]. 
</p>
<p>Consid&#233;rons pas &#224; pas comment une telle &#233;quivalence peut &#234;tre produite par une paire de bons 
</p>
<p>dictionnaires. 
</p>
<p>&#8226; Merci de Y est d&#233;crit dans un DEC fran&#231;ais comme une FL non standard sous PRIER : 
autorit&#233;s pertinentes 
</p>
<p>vous prient de Y-er : Merci [de V(&#8216;Y&#8217;)INF [sur un &#233;criteau ou panneau] 
</p>
<p>Dans un DEC russe, on trouve sous PROSIT&#180; &#8216;prier&#8217; la m&#234;me FL non standard : 
autorit&#233;s pertinentes 
</p>
<p>vous prient de Y-er : V(&#8216;Y&#8217;)IMP&#201;R.2PL [sur un &#233;criteau ou panneau] 
</p>
<p>&#8226; Faire est d&#233;crit dans un DEC fran&#231;ais comme Real1 de APPOINT : 
</p>
<p>Real1(APPOINT)  : faire [l&#8217;~] 
</p>
<p>&#8226; APPOINT est traduit comme PLATA BEZ SDA&#268;I lit. &#8216;paiement sans monnaie rendue&#8217;. 
</p>
<p>&#8226; Real1(PLATA &#8216;montant&#8217;) : //platit&#180; &#8216;payer&#8217; 
</p>
<p>Les quatre pas indiqu&#233;s permettent d&#8217;obtenir Platite bez sda&#269;i &#8216;Payez sans monnaie rendue&#8217;. 
</p>
<p>Mais le russe exige ici une pr&#233;cision : platit&#180; za &#269;to? &#8216;payer pour quoi ?&#8217; &#8211; za proezd &#8216;pour le tra-
</p>
<p>jet&#8217;. Cette pr&#233;cision doit venir de l&#8217;information concernant la situation d&#8217;&#233;nonciation : si l&#8217;&#233;cri-
</p>
<p>teau est plac&#233; dans un moyen de transport publique, on ajoute za proezd ; si c&#8217;est pr&#232;s d&#8217;un gui-
</p>
<p>chet d&#8217;une billeterie, za bilet &#8216;pour le billet&#8217; est de mise ; si c&#8217;est &#224; la caisse d&#8217;une cantine, cela 
</p>
<p>sera za edu &#8216;pour la nourriture&#8217;. 
</p>
<p>Il existe aussi une voie plus simple d&#8217;&#233;tablir l&#8217;&#233;quivalence en cause, notamment d&#233;crire faire 
</p>
<p>l&#8217;appoint comme une FL non standard de PAYER : 
de sorte que Y ne doit pas 
</p>
<p>rendre la monnaie &#224; X : //faire l&#8217;appoint 
</p>
<p>La FL non standard correspondante en russe serait : 
</p>
<p>PLATIT&#180; &#8216;payer&#8217; 
de sorte que Y ne doit pas 
</p>
<p>rendre la monnaie &#224; X : bez sda&#269;i &#8216;sans monnaie rendue&#8217; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 12 
</p>
<p>L&#8217;&#233;quivalence s&#8217;obtient imm&#233;diatement. J&#8217;ai voulu quand m&#234;me indiquer les pistes multiples qui 
</p>
<p>peuvent mener vers le m&#234;me reesultat. 
</p>
<p>5 Conclusions 
Voici les cinq points les plus importants de cette communication : 
</p>
<p>1. Les phras&#232;mes constituent une partie importante du lexique d&#8217;une langue. Ils doivent donc 
</p>
<p>&#234;tre pr&#233;sent&#233;s dans un dictionnaire formel (du type DEC) de fa&#231;on d&#233;taill&#233;e et syst&#233;matique. 
</p>
<p>2. La cl&#233; pour la production automatique du texte d&#8217;une qualit&#233; relativement &#233;lev&#233;e est le dic-
</p>
<p>tionnaire du type DEC. 
</p>
<p>3. Ce dictionnaire doit r&#233;server une place d&#8217;honneur aux collocations d&#233;crites en termes de 
</p>
<p>fonctions lexicales. 
</p>
<p>4. Les fonctions lexicales doivent &#234;tre exploit&#233;es sous deux angles : pour la s&#233;lection lexicale 
</p>
<p>et pour le paraphrasage syntaxique profond. 
</p>
<p>5. Le syst&#232;me de paraphrasage doit faire partie de tout syst&#232;me r&#233;ussi de TALN. 
</p>
<p>Remerciements 
Le texte de la pr&#233;sente communication a &#233;t&#233; lu et critiqu&#233; par L. Iordanskaja, Ph. Langlais, S. 
</p>
<p>Mille, A. Polgu&#232;re et L. Wanner, que je remercie de tout mon c&#339;ur. J&#8217;ai fait de mon mieux pour 
</p>
<p>prendre en charge leurs remarques et suggestions ; tous les d&#233;fauts et erreurs survivants ne sont 
</p>
<p>imputables qu&#8217;&#224; moi-m&#234;me. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>Apresjan, Jurij &amp; Cinman, Leonid (1998) Perifrazirovanie na komp&#180;jutere [Paraphrasing with 
Computer]. Semiotika i informatika, 36, 177-202. 
</p>
<p>Apresjan, Jurij &amp; Cinman, Leonid (2002) Formal&#180;naja model&#180; perefrazirovanija predlo&#382;enij dlja 
sistem pererabotki tekstov na estestvennyx jazykax [A Formal Model of Sentence Paraphras-
ing for Natural Language Text Processing Systems]. Russkij jazyk v nau&#269;nom osve&#353;&#269;enii, No. 
2 [= 4], 102-146. 
</p>
<p>Grossmann, Francis &amp; Tutin, Agn&#232;s (eds.) (2003)  Les collocations : analyse et traitement. [= 
Travaux et recherches en linguistique appliqu&#233;e, S&#233;rie E : Lexicologie et lexicographie, n&#186; 1]. 
Amsterdam: De Werelt. 
</p>
<p>Iordanskaja, Lidija, Kim, Myunghee &amp; Polgu&#232;re, Alain (1996) Some Procedural Problems in the 
Implementation of Lexical Functions for Text Generation. In: Wanner (ed.) 1996: 279-297. 
</p>
<p>Kahane, Sylvain (2003a) The Meaning-Text Theory. In: Agel, Vilmos, Eichinger, Ludwig, 
Eroms, Hans-Werner, Hellwig, Peter, Heringer, Hans J&#252;rgen, &amp; Lobin, Henning (eds.) De-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 13 
</p>
<p>pendency and Valency. An International Handbook of Contemporary Research, vol. 1. Ber-
lin&#8212;New York: W. de Gruyter, 546-570. 
</p>
<p>Kahane, Sylvain (2003b) Sur le lien entre la d&#233;finition lexicographique et les fonctions lexicales: 
une blessure profonde dans le DEC. In: Grossman &amp; Tutin (eds.) 2003: 61-73. 
</p>
<p>Kahane, Sylvain &amp; Polgu&#232;re, Alain (2001) Formal Foundations of Lexical Functions. In: Pro-
ceedings of &#8220;COLLOCATION: Computational Extraction, Analysis and Exploitation&#8221;, 39th 
Annual Meeting and 10th Conference of the European Chapter of the Association for Compu-
tational Linguistics, Toulouse, 8-15. 
</p>
<p>Lareau, Fran&#231;ois &amp; Wanner, Leo (2007) Towards a Generic Multilingual Dependency Grammar 
for Text Generation. In: Tracy Holloway King &amp; Emily M. Bender (eds.), Proceedings of the 
Grammar Engineering Across Frameworks 2007 Workshop. CSLI Publications, Stanford, CA: 
Stanford University, http://csli-publications.stanford.edu. 
</p>
<p>Mel&#180;&#269;uk, Igor (1974) Opyt teorii lingvisti&#269;eskix modelej Smysl - Tekst [Outline of a Theory 
Meaning-Text Type Linguistic Models]. Moskva: Nauka. [Reprint: 1999.] 
</p>
<p>Mel&#8217;&#269;uk, Igor (1981) Meaning-Text Models: A Recent Trend in Soviet Linguistics. Annual Re-
view of Anthropology, 10, 27-62. 
</p>
<p>Mel&#8217;&#269;uk, Igor (1988a) Dependency Syntax: Theory and Practice. Albany, N.Y.: State University 
of New York Press. 
</p>
<p>Mel&#8217;&#269;uk, Igor (1988b) Semantic Description of Lexical Units in an Explanatory Combinatorial 
Dictionary: Basic Principles and Heuristic Criteria. International Journal of Lexicography, 1: 
3, 165-188. 
</p>
<p>Mel&#8217;&#269;uk, Igor (1988c) Paraphrase et lexique dans la th&#233;orie linguistique Sens-Texte. In: B&#232;s, Ga-
briel &amp; Fuchs, Catherine (eds),  1988, Lexique et paraphrase [= Lexique 6]. Lille: Presses 
Universitaires de Lille, 13-54. 
</p>
<p>Mel&#8217;&#269;uk, Igor (1992) 1992  Paraphrase et lexique: Vingt ans apr&#232;s. In: Mel&#8217;&#269;uk et al. 1992: 9-58. 
Mel&#8217;&#269;uk, Igor (1996) Lexical Functions: A Tool for the Description of Lexical Relations in a 
</p>
<p>Lexicon. In: Wanner, Leo (ed.), Lexical Functions in Lexicography and Natural Language 
Processing. Amsterdam/Philadelphia: Benjamins, 37-102. 
</p>
<p>Mel&#8217;&#269;uk, Igor (1997) Vers une linguistique Sens-Texte. Le&#231;on inaugurale. Paris: Coll&#232;ge de 
France. 
</p>
<p>Mel&#8217;&#269;uk, Igor (2003a) Collocations dans le dictionnaire. In: Szende, Thomas (ed.), Les &#233;carts 
culturels dans les dictionnaires bilingues. Paris: Honor&#233; Champion, 19-64. 
</p>
<p>Mel&#8217;&#269;uk, Igor (2003b) Les collocations : d&#233;finition, r&#244;le et utilit&#233;. In: Grossmann &amp; Tutin (eds.) 
2003: 23-31. 
</p>
<p>Mel&#8217;&#269;uk, Igor (2004) Verbes supports sans peine. Lingvisticae Investigationes, 27: 2, 203-217 
Mel&#8217;&#269;uk, Igor (2006) Explanatory Combinatorial Dictionary. In: G. Sica, ed., Open Problems in 
</p>
<p>Linguistics and Lexicography, 2006, Monza (Italy): Polimetrica Publisher, 225-355. Voir aussi 
http://www.polimetrica.com/?p=productsList&amp;sWord=lexicography 
</p>
<p>Mel&#8217;&#269;uk, Igor, Clas, Andr&#233; &amp; Polgu&#232;re, Alain (1995) Introduction &#224; la lexicologie explicative et 
combinatoire. Bruxelles : Duculot. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> 14 
</p>
<p>Mel&#8217;&#269;uk, Igor &amp; Polgu&#232;re, Alain (1991) Aspects of the Implementation of the Meaning-Text 
Model for English Text Generation. In: N. Lancashire (ed.), Research in Humanities 1, Ox-
ford: Clarendon Press, 204-215. 
</p>
<p>Mel&#8217;&#269;uk, Igor &amp; Polgu&#232;re, Alain (2007) Lexique actif du fran&#231;ais. L&#8217;apprentissage du vocabu-
laire fond&#233; sur 20 000 d&#233;rivations s&#233;mantiques et collocations du fran&#231;ais. Bruxelles: De 
Boeck. 
</p>
<p>Mel&#8217;&#269;uk, Igor &amp; Wanner, Alain (2006) Syntactic Mismatches in Machine Translation. Machine 
Translation, 21: 81-138. 
</p>
<p>Mel&#8217;&#269;uk, Igor, et al. (1984, 1988, 1992, 1999) Dictionnaire explicatif et combinatoire du fran&#231;ais 
contemporain. Recherches lexico-s&#233;mantiques I-IV. Montr&#233;al: Les Presses de l&#8217;Universit&#233; de 
Montr&#233;al. 
</p>
<p>Mili&#263;evi&#263;, Jasmina (2007) La paraphrase. Mod&#233;lisation de la paraphrase langagi&#232;re. Bern etc.: 
Peter Lang. 
</p>
<p>Rey, Alain &amp; Chantereau, Sophie (1993) Dictionnaire des expressions et locutions. Paris: Dic-
tionnaires LE ROBERT. 
</p>
<p>Wanner, Leo (ed.) (1996)  Lexical Functions in Lexicography and Natural Language Processing. 
Amsterdam/Philadelphia: Benjamins. 
</p>
<p>Notes 
 
1 Voici encore trois exemples du m&#234;me type pour le verbe polonais OBOWJ&#260;ZYWAC &#8216;obliger&#8217; (je 
</p>
<p>remericie G. Sekunda qui me les a fournis) : 
</p>
<p>(i) Czy s&#261;du w tej sprawie nie obowi&#261;zuje tajemnica lekarska? 
lit. &#8216;Est-ce que le secret m&#233;dical n&#8217;oblige pas le tribunal dans cette affaire ?&#8217; = 
&#8216;Est-ce que le tribunal n&#8217;est pas oblig&#233;, dans cette affaire, de garder le secret m&#233;dical ?&#8217; 
</p>
<p>(ii) Kodeks obowi&#261;zue tak&#380;e osoby zatrudnione na podstawie um&#243;w prawa prywatnego 
lit. &#8216;Le code oblige &#233;galement les personnes employ&#233;es dans le cadre de contrats de droit priv&#233;&#8217;. = 
&#8216;Les personnes employ&#233;es dans le cadre de contrats de droit priv&#233; sont &#233;galement oblig&#233;es de res-
pecter le code&#8217;. 
</p>
<p>(iii) Uczestnik&#243;w obowi&#261;zuje noszenie na czapkach bia&#322;ych pokrowc&#243;w 
lit. &#8216;Le port de couverture blanche sur leur casquette oblige les participants&#8217;. = 
&#8216;Les participants sont oblig&#233;s de faire le port d&#8217;une couverture &#12296;&#8658; porter une couverture&#12297; blanche 
sur leur casquette&#8217;. </p>

</div></div>
</body></html>