<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>RefGen : un module d&#8217;identification des cha&#238;nes de r&#233;f&#233;rence d&#233;pendant du genre textuel</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010 &#8212;Session Posters, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>RefGen : un module d&#8217;identification des cha&#238;nes de r&#233;f&#233;rence d&#233;pendant du 
genre textuel 
</p>
<p>Laurence Longo   Amalia Todira&#351;cu 
</p>
<p>Laboratoire LiLPa, EA 1339, Universit&#233; de Strasbourg, 67000 Strasbourg Cedex, France 
longo@unistra.fr, todiras@unistra.fr  
</p>
<p>R&#233;sum&#233;  
Dans cet article, nous pr&#233;sentons RefGen, un module d&#8217;identification des cha&#238;nes de r&#233;f&#233;rence pour le 
fran&#231;ais. RefGen effectue une annotation automatique des expressions r&#233;f&#233;rentielles puis identifie les 
relations de cor&#233;f&#233;rence &#233;tablies entre ces expressions pour former des cha&#238;nes de r&#233;f&#233;rence. Le calcul de la 
r&#233;f&#233;rence utilise des propri&#233;t&#233;s des cha&#238;nes de r&#233;f&#233;rence d&#233;pendantes du genre textuel, l&#8217;&#233;chelle 
d&#8217;accessibilit&#233; d&#8217;(Ariel, 1990) et une s&#233;rie de filtres lexicaux, morphosyntaxiques et s&#233;mantiques. Nous 
&#233;valuons les premiers r&#233;sultats de RefGen sur un corpus issu de rapports publics. 
</p>
<p>Abstract  
We present RefGen, a reference chain identification module for French. RefGen automatically annotates 
referential expressions then identifies coreference relations between these expressions to make reference 
chains. Reference calculus uses textual genre specific properties of reference chains, (Ariel, 1990)&#8217;s 
accessibility theory and applies lexical, morphosyntactic and semantic filters. We evaluate the first results 
obtained by RefGen from a public reports corpus.  
</p>
<p>Mots-cl&#233;s :   Cha&#238;nes de r&#233;f&#233;rence, relation de cor&#233;f&#233;rence, saillance, genre textuel 
Keywords:   Reference chain identification, coreference relation, salience, genre 
</p>
<p>1 Contexte et motivation 
L&#8217;identification automatique des cha&#238;nes de r&#233;f&#233;rence est un probl&#232;me difficile, vu la vari&#233;t&#233; des 
expressions linguistiques intervenant dans leur construction et la n&#233;cessit&#233; d&#8217;en d&#233;tenir des connaissances 
linguistiques et extra-linguistiques approfondies. Les expressions r&#233;f&#233;rentielles (noms propres, descriptions 
d&#233;finies, d&#233;monstratifs, pronoms) ont fait l'objet de nombreuses &#233;tudes qui se sont focalis&#233;es sur leur 
description linguistique (Kleiber, 1994), ou sur leur r&#244;le dans l&#8217;organisation du texte (Charolles, 1997). 
</p>
<p>Les cha&#238;nes de r&#233;f&#233;rence constituent des marques linguistiques de la coh&#233;rence du texte permettant 
d&#8217;identifier la continuit&#233; ou la rupture th&#233;matique. De plus, (Schnedecker, 2005) montre que la structure 
des  cha&#238;nes  de  r&#233;f&#233;rence  et  le choix des expressions r&#233;f&#233;rentielles qui les constituent sont d&#233;pendants du  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE LONGO, AMALIA TODIRASCU 
genre textuel. Pour une identification automatique de ces cha&#238;nes, plusieurs travaux proposent des mod&#232;les 
cognitifs pour le calcul de la cor&#233;f&#233;rence (Salmon-Alt, 2001) ou exploitent des indices linguistiques de 
surface (Hernandez, 2006), mais peu de mod&#232;les op&#233;rationnels rendent compte des propri&#233;t&#233;s des cha&#238;nes 
de r&#233;f&#233;rence suivant le genre textuel. L'identification des cha&#238;nes de r&#233;f&#233;rence n&#233;cessite d&#8217;abord 
l'identification des relations de cor&#233;f&#233;rence entre les expressions anaphoriques et leurs ant&#233;c&#233;dents. 
Ensuite, la construction des cha&#238;nes de r&#233;f&#233;rence s&#8217;appuie sur la transitivit&#233; de la relation de cor&#233;f&#233;rence. 
Les m&#233;thodes de r&#233;solution de la cor&#233;f&#233;rence appliquent soit des r&#232;gles de s&#233;lection d&#8217;ant&#233;c&#233;dents d&#233;finies 
manuellement, soit des r&#232;gles apprises &#224; partir de corpus annot&#233;s. Malgr&#233; l'existence de quelques corpus 
fran&#231;ais annot&#233;s en cor&#233;f&#233;rence (Manu&#233;lian, 2003), (Salmon-Alt, 2001), il est difficile d'utiliser ces 
ressources pour l&#8217;apprentissage automatique, vu la taille r&#233;duite et l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; des ph&#233;nom&#232;nes annot&#233;s 
(pronoms personnels, descriptions d&#233;finies, cor&#233;f&#233;rence, anaphores associatives)1.  
</p>
<p>De ce fait, notre travail se situe dans la lign&#233;e des m&#233;thodes symboliques (Hartrumpf, 2001), (Bontcheva et 
al, 2002), (Mitkov, 2001) qui se montrent plus facilement adaptables aux nouveaux domaines ou 
applications. Pour ces syst&#232;mes, la relation de cor&#233;f&#233;rence est &#233;tablie en appliquant des r&#232;gles qui rep&#232;rent 
les ant&#233;c&#233;dents possibles, apr&#232;s v&#233;rification de crit&#232;res de compatibilit&#233; des propri&#233;t&#233;s (morphosyntaxiques, 
syntaxiques, s&#233;mantiques) des candidats. Pour chaque candidat anaphorique, le choix des ant&#233;c&#233;dents 
possibles s&#8217;effectue selon un calcul de saillance (Victorri, 2005), la v&#233;rification des propri&#233;t&#233;s de coh&#233;rence 
locale et globale du discours, l'application de contraintes (Beaver, 2004) ou un calcul d'accessibilit&#233; des 
expressions r&#233;f&#233;rentielles (Ariel, 1990). Notre module d&#8217;identification des cha&#238;nes de r&#233;f&#233;rence RefGen 
applique une nouvelle m&#233;thode de calcul de la r&#233;f&#233;rence qui, en plus de l&#8217;accessibilit&#233; et de la v&#233;rification 
de contraintes, applique des param&#232;tres d&#233;pendants du genre textuel (pr&#233;f&#233;rence pour une cat&#233;gorie 
d&#8217;expressions r&#233;f&#233;rentielles, distance moyenne entre les maillons). D&#233;velopp&#233; dans un cadre industriel2, 
RefGen est int&#233;gr&#233; &#224; un outil de d&#233;tection de th&#232;mes qui utilise des marqueurs linguistiques (les cha&#238;nes de 
r&#233;f&#233;rence) pour optimiser les r&#233;sultats des moteurs de recherche et la navigation dans les documents. 
</p>
<p>Dans cet article, nous pr&#233;sentons les propri&#233;t&#233;s des cha&#238;nes de r&#233;f&#233;rence et pr&#233;cisons leurs caract&#233;ristiques 
pour le genre textuel de rapports publics. Nous nous focalisons ensuite sur les pr&#233;traitements mis en place 
(&#233;tiquetage, identification des expressions r&#233;f&#233;rentielles) pour RefGen et pr&#233;sentons l&#8217;algorithme 
d&#8217;identification des cha&#238;nes de r&#233;f&#233;rence. Nous &#233;valuons RefGen sur un corpus de rapports publics fran&#231;ais 
et montrons la plus-value apport&#233;e par la prise en compte des param&#232;tres sp&#233;cifiques au genre. 
</p>
<p>2 Les cha&#238;nes de r&#233;f&#233;rence 
En suivant (Schnedecker, 2005), nous consid&#233;rons qu&#8217;une cha&#238;ne de r&#233;f&#233;rence est une relation qui s&#8217;&#233;tablit 
entre trois maillons au moins (trois expressions cor&#233;f&#233;rentielles). Ainsi, l&#8217;exemple suivant compte une 
seule cha&#238;ne de r&#233;f&#233;rence compos&#233;e de trois maillons (en gras) : M. Pons rappelle que Jacques Chirac lui 
appara&#238;t comme &#171; le candidat l&#233;gitime &#187; de son parti. (Le Monde Diplomatique, 1980-1988). 
</p>
<p>Les cha&#238;nes de r&#233;f&#233;rence comprennent trois types de constituants &#224; fonction r&#233;f&#233;rentielle : les noms propres 
(Np), les groupes nominaux (d&#233;fini, ind&#233;fini, possessif ou d&#233;monstratif) et les pronoms. Les Np jouent un 
r&#244;le important dans la structuration du discours car ils se trouvent souvent en t&#234;te d&#8217;une cha&#238;ne de r&#233;f&#233;rence 
dans les portraits journalistiques (Schnedecker, 2005). En dehors des cas de comp&#233;tition r&#233;f&#233;rentielle o&#249; la 
r&#233;p&#233;tition du Np &#233;limine une ambig&#252;it&#233; entre deux r&#233;f&#233;rents, la red&#233;nomination d&#8217;un Np marque une 
rupture dans la cha&#238;ne (un changement d&#8217;acteur). Lorsqu&#8217;une expression r&#233;f&#233;rentielle est utilis&#233;e, elle 
d&#233;clenche un &#171; processus de recrutement &#187; particulier du r&#233;f&#233;rent. De ce fait, le d&#233;monstratif (e.g. ce 
                                                 
</p>
<p>1
  La campagne SemEval 2010 Coreference Resolution in Multiple Languages ne propose pas de donn&#233;es pour le fran&#231;ais. 
</p>
<p>2
  Le projet de d&#233;tection automatique de th&#232;mes s&#8217;effectue en collaboration avec l&#8217;entreprise RBS (Strasbourg). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>REFGEN : UN MODULE D&#8217;IDENTIFICATION DES CHAINES DE REFERENCE DEPENDANT DU GENRE TEXTUEL 
pr&#233;sident) renvoie directement au r&#233;f&#233;rent sur la base d&#8217;un crit&#232;re de proximit&#233; alors que le pronom &#171; il &#187; 
indique de recruter un r&#233;f&#233;rent qui soit l&#8217;argument d&#8217;une proposition saillante (Kleiber, 1994). Ainsi, un 
indice est donn&#233; quant au r&#233;f&#233;rent &#224; &#171; garder en m&#233;moire &#187; et qui constitue alors un th&#232;me local dans cette 
portion du discours. En revanche, l&#8217;emploi d&#8217;expressions nominales alors que le contexte ne le n&#233;cessite 
pas (e.g. lorsqu&#8217;un pronom aurait suffit), constitue un indice de rupture. Ces indices seront exploit&#233;s par le 
syst&#232;me de d&#233;tection de th&#232;mes.  
</p>
<p>Dans notre approche, nous travaillons sur les relations mono r&#233;f&#233;rentielles (&#224; l'exclusion d'anaphores 
plurielles) s&#8217;&#233;tablissant entre des expressions co-r&#233;f&#233;rentes inter et intra phrases. Aussi, sont consid&#233;r&#233;es 
les situations de cor&#233;f&#233;rence directe (Manu&#233;lian, 2002) o&#249; les groupes nominaux cor&#233;f&#233;rents poss&#232;dent la 
m&#234;me t&#234;te nominale (e.g. &#171; le changement climatique / ce changement &#187;) ainsi que les relations de 
cor&#233;f&#233;rence entre les noms de personne et les noms de fonction3. Nous faisons l&#8217;hypoth&#232;se que les cha&#238;nes 
de r&#233;f&#233;rence poss&#232;dent des caract&#233;ristiques d&#233;pendantes du genre textuel (Longo, Todira&#351;cu, 2010). En 
suivant la typologie de (Schnedecker, 2005), nous avons compar&#233; les cha&#238;nes de r&#233;f&#233;rence pr&#233;sentes dans 
un corpus de genres divers (journaux, &#233;ditoriaux, rapports publics, romans, normes europ&#233;ennes) de 50 000 
mots4. Ainsi, cinq crit&#232;res de comparaison ont &#233;t&#233; &#233;tablis et appliqu&#233;s pour chaque genre &#233;tudi&#233; : la 
longueur de la cha&#238;ne, la distance moyenne entre les maillons, la cat&#233;gorie du premier maillon, la cat&#233;gorie 
la plus fr&#233;quente des maillons, la position th&#233;matique. Pour les rapports publics, nous avons remarqu&#233; que 
la longueur moyenne des cha&#238;nes &#233;tait de 3-4 maillons, alors qu&#8217;elle &#233;tait en moyenne trois fois plus &#233;lev&#233;e 
pour un roman. La distance moyenne entre les maillons des rapports publics est de deux phrases, mais 
seulement d&#8217;une phrase pour le roman, tant les r&#233;flexifs et possessifs sont utilis&#233;s dans ce dernier genre. 
Aussi, de m&#234;me que (Schnedecker, 2005), nous avons constat&#233; que la cat&#233;gorie des noms propres &#233;tait 
privil&#233;gi&#233;e dans les premiers maillons des cha&#238;nes des textes journalistiques (39,5%) alors qu&#8217;il s&#8217;agissait 
plut&#244;t des descriptions d&#233;finies pour les rapports publics (45%). Ce sont aussi les descriptions d&#233;finies qui 
repr&#233;sentent un tiers des maillons dans les rapports publics alors qu&#8217;il s&#8217;agit des pronoms (50%) dans le 
roman. Enfin, un dernier crit&#232;re utile pour identifier le th&#232;me du document, le premier maillon d&#8217;une 
cha&#238;ne, co&#239;ncide peu avec le th&#232;me phrastique (40%) pour les rapports publics mais tr&#232;s souvent (80%) 
pour les textes journalistiques. A l&#8217;issue de cette &#233;tude, nous avons d&#233;gag&#233; des propri&#233;t&#233;s des cha&#238;nes de 
r&#233;f&#233;rence issues d&#8217;un genre textuel particulier. Nous pr&#233;sentons dans les sections suivantes le module 
RefGen qui tient compte de ces propri&#233;t&#233;s. 
</p>
<p>3 Annotations des expressions r&#233;f&#233;rentielles dans RefGen 
Pour identifier les expressions r&#233;f&#233;rentielles, le texte est tout d&#8217;abord &#233;tiquet&#233; par TTL (Ion, 2007). En plus 
de la segmentation en chunks simples (groupes nominaux (Np), groupes pr&#233;positionnels (Pp), groupes 
adjectivaux (Ap)), cet &#233;tiqueteur fournit des informations morpho-syntaxiques (temps, mode, personne, 
genre, nombre). Partant de la sortie XML, nous appliquons une base de patrons symboliques pour identifier 
des expressions plus complexes susceptibles d&#8217;&#234;tre pr&#233;sentes au d&#233;but des cha&#238;nes de r&#233;f&#233;rence (car plus 
informatives) : les groupes nominaux complexes (CNp)5 (e.g. l&#8217;&#233;l&#233;vation du niveau moyen global de la 
mer) et les entit&#233;s nomm&#233;es (nom de fonction, d&#8217;organisation ou de personne). Les emplois impersonnels 
du pronom &#171; il &#187; sont aussi annot&#233;s (e.g. &#171; il pleut &#187;), afin d&#8217;ignorer ces emplois dans le calcul des cha&#238;nes. 
Voici un exemple d&#8217;annotations comprenant les lemmes, chunks simples (non-r&#233;cursifs) et complexes 
                                                 
</p>
<p>3
  Nous ne traitons que quelques cas de cor&#233;f&#233;rence indirecte parce que nous ne faisons pas appel &#224; des connaissances externes. 
</p>
<p>4
  Nous avons travaill&#233; sur des extraits de notre corpus de d&#233;part (de 500 000 tokens), tant l&#8217;annotation manuelle des cha&#238;nes de 
</p>
<p>r&#233;f&#233;rence est une activit&#233; fastidieuse. Nous comptons poursuivre l&#8217;annotation de ce corpus de r&#233;f&#233;rence, vu qu&#8217;il n&#8217;en existe 
pas encore pour le fran&#231;ais. 
</p>
<p>5
  Un CNp est un groupe nominal modifi&#233; par deux groupes pr&#233;positionnels au plus, ou bien un groupe nominal modifi&#233; par une 
</p>
<p>proposition relative (une proposition simple contenant un pr&#233;dicat et un compl&#233;ment d&#8217;objet direct ou indirect). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE LONGO, AMALIA TODIRASCU 
(CNp), propri&#233;t&#233;s morpho-syntaxiques (ana), entit&#233;s nomm&#233;es (NER) et il impersonnel (imp) (voir Figure 1). 
Nous exploitons ces annotations automatiques pour construire les cha&#238;nes de r&#233;f&#233;rence. 
</p>
<p> 
</p>
<p>Figure 1 : exemple de sortie enrichie en annotations dans RefGen 
</p>
<p>4 Algorithme d&#8217;identification des cha&#238;nes de r&#233;f&#233;rence dans RefGen 
Le texte enrichi en annotations (section 3) est trait&#233; pour extraire les cha&#238;nes de r&#233;f&#233;rence. Connaissant le 
genre du texte (le genre doit &#234;tre pr&#233;cis&#233; par l&#8217;utilisateur), RefGen va alors s&#233;lectionner pr&#233;f&#233;rentiellement 
les candidats correspondant aux param&#232;tres identifi&#233;s dans (Longo et Todirascu, 2010). Pour les rapports 
publics, RefGen va ainsi privil&#233;gier les descriptions d&#233;finies comme premiers maillons, les cha&#238;nes de 
r&#233;f&#233;rence courtes (3 &#224; 4 maillons) et les ant&#233;c&#233;dents situ&#233;s &#224; une distance moyenne de 2 phrases. Le calcul 
de la r&#233;f&#233;rence (CalcRef) s'effectue en plusieurs &#233;tapes. 
</p>
<p>S&#233;lection du premier maillon. La s&#233;lection des candidats susceptibles de constituer le premier maillon de 
la cha&#238;ne d&#233;pend de l&#8217;accessibilit&#233; globale (AG) du candidat, de la fonction syntaxique (la fonction sujet est 
privil&#233;gi&#233;e) et du type privil&#233;gi&#233; (pour le 1er maillon) d&#233;pendant du genre. En effet, sont s&#233;lectionn&#233;s les 
candidats ayant l&#8217;AG la plus &#233;lev&#233;e : les noms propres ou les CNp. L&#8217;AG est calcul&#233;e &#224; partir de l&#8217;&#233;chelle 
d&#8217;accessibilit&#233; d&#8217;(Ariel, 1990) qui classe les expressions r&#233;f&#233;rentielles suivant leur degr&#233; d&#8217;informativit&#233;, 
de rigidit&#233; et d&#8217;att&#233;nuation. Pour chacun des degr&#233;s, nous attribuons un score de 10 &#224; 110. Ainsi, l&#8217;AG 
d&#8217;une expression r&#233;f&#233;rentielle constitue la somme des trois scores. Par exemple, l&#8217;AG d&#8217;un nom propre 
complet (&quot;le pr&#233;sident Barack Obama&quot;) est de 220 (100+100+20), l&#8217;AG du pronom elle est de 150. La 
fonction syntaxique est attribu&#233;e &#224; l&#8217;aide de r&#232;gles heuristiques qui d&#233;terminent la position du candidat par 
rapport au verbe principal (sujet, objet direct, objet indirect, compl&#233;ment du nom). Un poids 
suppl&#233;mentaire &#224; l&#8217;AG est alors affect&#233; pour la fonction (e.g. 100 pour la position sujet, 50 pour la position 
d&#8217;objet) et pour le type (50 si type privil&#233;gi&#233;). Le candidat ayant le score total le plus &#233;lev&#233; est s&#233;lectionn&#233;. 
S&#233;lection des autres maillons. Ensuite, pour d&#233;terminer les autres maillons des cha&#238;nes de r&#233;f&#233;rence 
(rangs 2, 3 et suivants), nous recherchons des liens de cor&#233;f&#233;rence s&#8217;&#233;tablissant entre les candidats 
d&#8217;accessibilit&#233; haute (les premiers maillons potentiels) et ceux d&#8217;accessibilit&#233; basse (les autres maillons 
candidats). Nous proc&#233;dons &#224; une identification des paires ant&#233;c&#233;dent-anaphore pr&#233;sentes dans un 
intervalle correspondant &#224; la distance moyenne entre les maillons (param&#232;tre d&#233;pendant du genre). Puis, 
pour d&#233;partager les ant&#233;c&#233;dents potentiels, nous adaptons l&#8217;approche de (Gegg-Harrison et Byron, 2004) 
qui ont propos&#233; une liste de contraintes (morpho-syntaxiques, s&#233;mantiques) &#224; satisfaire pour chaque paire 
de candidats ant&#233;c&#233;dent-anaphore. Nous d&#233;finissons deux types de filtres &#224; appliquer : des filtres forts et </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>REFGEN : UN MODULE D&#8217;IDENTIFICATION DES CHAINES DE REFERENCE DEPENDANT DU GENRE TEXTUEL 
des filtres faibles. Les filtres forts permettent d&#8217;&#233;liminer certaines paires impossibles. N&#233;anmoins, ces 
filtres forts ne s&#8217;appliquent pas &#224; certaines anaphores, comme les pronoms r&#233;fl&#233;chis. Par exemple, le filtre 
fort d&#8217;imbrication permet d&#8217;&#233;liminer des paires o&#249; les deux candidats sont imbriqu&#233;s (e.g. une description 
d&#233;finie et son compl&#233;ment de nom : &#171;[ les r&#233;percussions [du changement climatique]] &#187;) car ils ne 
peuvent pas &#234;tre cor&#233;f&#233;rents. Les filtres faibles permettent d&#8217;identifier les candidats qui valident le plus de 
filtres. On v&#233;rifie par exemple la compatibilit&#233; en termes de fonction syntaxique ou en genre et nombre 
entre un candidat nominal et une anaphore pronominale. Une fois les relations anaphoriques &#233;tablies, nous 
regroupons les anaphores ayant un ant&#233;c&#233;dent commun dans une m&#234;me cha&#238;ne de r&#233;f&#233;rence.  
</p>
<p>Exemple. Nous appliquons l&#8217;algorithme suivant les param&#232;tres sp&#233;cifiques au genre de rapports publics :   
Pour soutenir [la coop&#233;ration en mati&#232;re d'adaptation]i et guider [les progr&#232;s du cadre d'action europ&#233;en]j, [la 
Commission]k a [l'intention]l de cr&#233;er [un groupe de pilotage consacr&#233; [aux incidences du changement 
climatique]p]m. [Ce groupe]r r&#233;unira [des repr&#233;sentants des &#201;tats membres de l'UE]s qui participent [&#224; la formulation 
de programmes d'adaptation nationaux]t et [il]w consultera [des repr&#233;sentants de la communaut&#233; scientifique]y.  
Apr&#232;s le calcul de saillance des candidats, nous obtenons 5 premiers maillons potentiels : i, j, m, s et y. 
Ensuite, nous g&#233;n&#233;rons toutes les paires ant&#233;c&#233;dent-anaphore possibles. Certaines paires sont &#233;limin&#233;es d&#232;s 
le d&#233;but, comme par exemple (i, r) car la t&#234;te lexicale est diff&#233;rente, ou (m, p) car les groupes sont 
imbriqu&#233;s. Pour le candidat il, parmi les paires (i, il) (j, il), (k, il), (l, il), (m, il)&#8230;, le maximum de filtres 
satisfaits est r&#233;alis&#233; pour [ce groupe]r. De plus, comme (m, r) est une paire valide (t&#234;te lexicale identique), 
nous obtenons ainsi une cha&#238;ne possible : {un groupe de pilotage [&#8230;], ce groupe, il}.  
</p>
<p>5 Evaluation du module RefGen 
Nous avons &#233;valu&#233; RefGen en comparant les annotations (entit&#233;s nomm&#233;es, groupes nominaux complexes 
et il impersonnel) et le calcul de la r&#233;f&#233;rence (CalcRef) obtenus par rapport &#224; une annotation manuelle. Le 
corpus d&#8217;&#233;valuation est compos&#233; de rapports publics issus de la Commission Europ&#233;enne. L&#8217;extrait choisi 
porte sur le changement climatique et compte 7230 mots. Il contient 118 relations anaphoriques 
(impliquant surtout des anaphores nominales, d&#233;monstratives ou d&#233;finies) et 24 cha&#238;nes de r&#233;f&#233;rence. Nous 
avons report&#233; les mesures de rappel, pr&#233;cision et performance (f-mesure) (Tableau 1) pour chacune des 
annotations et le calcul de la r&#233;f&#233;rence pour les paires ant&#233;c&#233;dent-anaphore et les cha&#238;nes retrouv&#233;es.  
</p>
<p> Ner CNp Il imp CalcRef (paires) CalcRef (cha&#238;nes) 
rappel 
</p>
<p>pr&#233;cision 
f-mesure 
</p>
<p>0,85 
0,91 
0,88 
</p>
<p>0,87 
0,91 
0,89 
</p>
<p>0,91 
1 
</p>
<p>0,95 
</p>
<p>0,69 
0,78 
0,73 
</p>
<p>0,58 
0,70 
0,63 
</p>
<p>Tableau 1 : Evaluation de RefGen 
Pour les Ner, les erreurs ont port&#233; essentiellement sur des abr&#233;viations de CNp (e.g. GES : gaz &#224; effet de 
serre) qui ont &#233;t&#233; consid&#233;r&#233;es comme des sigles et qui ont de ce fait &#233;t&#233; &#233;tiquet&#233;es &lt;Org&gt;. Les erreurs de 
CNp sont dues &#224; une sous-sp&#233;cification (les patrons ne prenaient pas en compte les groupes nominaux 
modifi&#233;s par plus de deux groupes pr&#233;positionnels). Du c&#244;t&#233; des il impersonnels, nous observons de 
bonnes performances car le corpus contenait peu d&#8217;occurrences ambig&#252;es. Concernant CalcRef, les erreurs 
pour les paires r&#233;sultent de probl&#232;mes d&#8217;&#233;tiquetage (erreur dans le genre/nombre) ou parce que plusieurs 
ant&#233;c&#233;dents d&#8217;un m&#234;me candidat ont satisfait le m&#234;me nombre de filtres mais qu&#8217;ils n&#8217;&#233;taient pas 
cor&#233;f&#233;rents. Les erreurs d&#8217;identification des cha&#238;nes sont par cons&#233;quent li&#233;es aux fausses paires 
ant&#233;c&#233;dent-anaphore retrouv&#233;es ainsi qu&#8217;aux erreurs d&#8217;&#233;tiquetage (sigles). Nous avons mis en place des 
patrons de correction pour les erreurs r&#233;currentes de TTL. Aussi, nous pensons rajouter des listes de 
synonymes et des relations ontologiques qui permettraient d&#8217;&#233;liminer certaines paires ant&#233;c&#233;dent-anaphore. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE LONGO, AMALIA TODIRASCU 
Nous avons ensuite test&#233; l&#8217;importance de la prise en compte des param&#232;tres li&#233;s au genre textuel dans 
CalcRef. Si nous appliquons les param&#232;tres du genre journalistique &#224; notre corpus d&#8217;&#233;valuation, nous 
obtenons une performance similaire pour les paires (f-mesure=0,7) mais une baisse significative pour les 
cha&#238;nes de r&#233;f&#233;rence (f-mesure=0,54). Sans aucun param&#232;tre (la longueur des cha&#238;nes n'est pas limit&#233;e ni la 
distance entre les maillons), nous obtenons une performance comparable pour les paires (f-mesure=0,71) 
mais une baisse importante de la f-mesure pour la d&#233;tection des cha&#238;nes (0,51). Le nombre de paires est 
sensiblement le m&#234;me (quelques paires sont rajout&#233;es entre des candidats &#233;loign&#233;s). En revanche, parce que 
certaines cha&#238;nes identifi&#233;es regroupent des cha&#238;nes plus courtes, nous obtenons peu de cha&#238;nes valides. 
</p>
<p>6 Conclusion et perspectives 
Dans cet article, nous avons pr&#233;sent&#233; le module RefGen qui identifie automatiquement les cha&#238;nes de 
r&#233;f&#233;rence &#224; partir d&#8217;indices linguistiques de surface, mais de peu de connaissances externes. Notre module 
emploie divers pr&#233;traitements linguistiques pour annoter les expressions r&#233;f&#233;rentielles contenues dans les 
cha&#238;nes de r&#233;f&#233;rence. Pour le calcul de la r&#233;f&#233;rence, RefGen utilise des param&#232;tres li&#233;s au genre textuel et 
une s&#233;rie de filtres forts et faibles. L&#8217;&#233;valuation est encourageante et permet d&#8217;appr&#233;cier la plus-value 
apport&#233;e par la prise en compte des param&#232;tres li&#233;s au genre. Nous poursuivons notre travail en ce sens sur 
des corpus de genres diff&#233;rents, dans le but de fournir &#224; la communaut&#233; un outil de pr&#233;-annotation des 
cha&#238;nes de r&#233;f&#233;rence. Nous projetons aussi d&#8217;appliquer notre m&#233;thode &#224; d&#8217;autres langues. 
</p>
<p>R&#233;f&#233;rences 
ARIEL M. (1990). Accessing Noun-Phrase Antecedents, Londres : Routledge. 
BONTCHEVA K., DIMITROV M., MAYNARD D., TABLAN V., CUNNINGHAM H. (2002). Shallow methods for named 
entity coreference resolution. Actes de TALN 2002. 
BEAVER D. (2004). The optimization of discourse anaphora. Linguistics and Philosophy, 27(1) : 3&#8211;56. 
CHAROLLES M. (1997). L&#8217;encadrement du discours : univers, champs, domaines et espaces. Cahier de 
Recherche Linguistique 6, 1-73. 
GEGG-HARRISON W., BYRON D. (2004). PYCOT: An Optimality Theory-based Pronoun Resolution Toolkit. 
Actes de LREC 2004, Lisbonne. 
HARTRUMPF S. (2001). Coreference Resolution with Syntactico-Semantic Rules and Corpus Statistics. Actes de 
CoNLL (Computational Natural Language Learning Workshop). 
HERNANDEZ N. (2006). Description et D&#233;tection Automatique de Structures de Textes. Th&#232;se d&#8217;Universit&#233;, 
Paris Sud XI. 
ION R. (2007). TTL: A portable framework for tokenization, tagging and lemmatization of large corpora. 
Bucharest : Romanian Academy.  
KLEIBER G. (1994). Anaphores et Pronoms. Louvain-la-Neuve : Duculot. 
LONGO L., TODIRASCU A. (2010). Une &#233;tude de corpus pour la d&#233;tection automatique de th&#232;mes. Actes des 
6&#232;mes journ&#233;es de linguistique de corpus (JLC 09), Lorient. 
MANUELIAN H. (2003). Description D&#233;finies et D&#233;monstratives : Analyses de Corpus pour la G&#233;n&#233;ration de 
Textes. Th&#232;se de doctorat, Nancy 2. 
MITKOV R. (2001). Towards a more consistent and comprehensive evaluation of anaphora resolution 
algorithms and systems. Applied Artificial Intelligence: An International Journal, 15, 253-276. 
SCHNEDECKER C. (2005). Les cha&#238;nes de r&#233;f&#233;rence dans les portraits journalistiques : &#233;l&#233;ments de description. 
Travaux de Linguistique 51, 85-133. Duculot. 
SALMON-ALT S. (2001). R&#233;f&#233;rence et Dialogue finalis&#233; : de la linguistique &#224; un mod&#232;le op&#233;rationnel. Th&#232;se 
d'Universit&#233;, Universit&#233; H. Poincar&#233;, Nancy. 
VICTORRI B. (2005). Le calcul de la r&#233;f&#233;rence. S&#233;mantique et TAL, Herm&#232;s. </p>

</div></div>
</body></html>