<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Expressive : G&#233;n&#233;ration automatique de parole expressive &#224; partir de donn&#233;es non linguistiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Expressive : G&#233;n&#233;ration automatique de parole expressive &#224; partir
de donn&#233;es non linguistiques
</p>
<p>Olivier Blanc1 No&#233;mi Boubel1 Jean-Philippe Goldman2 Sophie Roekhaut3
</p>
<p>Anne Catherine Simon2 C&#233;drick Fairon1 Richard Beaufort1
</p>
<p>(1) CENTAL, Universit&#233; catholique de Louvain, 1348 Louvain-la-Neuve, Belgique
(2) Valibel, Universit&#233; catholique de Louvain, 1348 Louvain-la-Neuve, Belgique
</p>
<p>(3) TCTS Lab, Universit&#233; de Mons, 7000 Mons, Belgique
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons Expressive, un syst&#232;me de g&#233;n&#233;ration de parole expressive &#224; partir de
donn&#233;es non linguistiques. Ce syst&#232;me est compos&#233; de deux outils distincts : Taittingen, un g&#233;n&#233;rateur au-
tomatique de textes d&#8217;une grande vari&#233;t&#233; lexico-syntaxique produits &#224; partir d&#8217;une repr&#233;sentation concep-
tuelle du discours, et StyloPhone, un syst&#232;me de synth&#232;se vocale multi-styles qui s&#8217;attache &#224; rendre le
discours produit attractif et naturel en proposant diff&#233;rents styles vocaux.
</p>
<p>Abstract. We present Expressive, a system that converts non-linguistic data into expressive speech.
This system is made of two distinct parts : Taittingen, a natural language generation tool able to produce
lexically and syntactically rich texts from a discourse abstract representation, and StyloPhone, a text-
to-speech synthesis system that proposes varying speaking styles, to make the speech sound both more
attractive and natural.
</p>
<p>Mots-cl&#233;s : G&#233;n&#233;ration de texte, synth&#232;se vocale, expressivit&#233;.
</p>
<p>Keywords: Natural language generation, text-to-speech synthesis, expressiveness.
</p>
<p>1 Introduction
</p>
<p>La d&#233;mocratisation de l&#8217;acc&#232;s &#224; une masse d&#8217;informations toujours croissante, combin&#233;e &#224; l&#8217;&#233;mergence
de nouvelles formes de m&#233;dias, am&#232;ne &#224; inventer de nouvelles formes de transmission de l&#8217;information,
capables notamment de tenir compte du profil de l&#8217;utilisateur. Le projet Expressive 1 s&#8217;inscrit dans ces
consid&#233;rations. Son objectif est de d&#233;velopper un outil permettant de transmettre de l&#8217;information sous
la forme d&#8217;une parole expressive adapt&#233;e aux besoins de l&#8217;utilisateur. &#192; cette fin, Expressive combine
deux outils de traitement automatique des langues : un syst&#232;me de g&#233;n&#233;ration automatique de texte et un
syst&#232;me de synth&#232;se de la parole &#224; partir du texte.
</p>
<p>Le module de g&#233;n&#233;ration produit un texte fran&#231;ais compr&#233;hensible et bien structur&#233; &#224; partir d&#8217;une repr&#233;-
sentation conceptuelle et non linguistique d&#8217;un discours. Le syst&#232;me g&#232;re les variations aux niveaux de la
structure du discours, des formes syntaxiques et du lexique et est ainsi capable de produire de nombreux
</p>
<p>1. Projet de recherche subsidi&#233; par la R&#233;gion wallonne de Belgique, convention no. 616422.
Voir : http://cental.fltr.ucl.ac.be/team/projects/expressive/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>O. BLANC, N. BOUBEL, J.-P. GOLDMAN, S. ROEKHAUT, A.C. SIMON, C. FAIRON, R. BEAUFORT
</p>
<p>textes diff&#233;rents &#224; partir des m&#234;mes donn&#233;es de d&#233;part, &#233;vitant ainsi la monotonie souvent probl&#233;matique
dans les textes automatiquement g&#233;n&#233;r&#233;s. Le texte obtenu est ensuite trait&#233; par le synth&#233;tiseur vocal, qui
convertit le texte en parole en veillant &#224; respecter un style expressif pr&#233;d&#233;fini, afin de rendre le discours
plus vivant et naturel tout en conservant son intelligibilit&#233;.
</p>
<p>La cha&#238;ne de traitement compl&#232;te, en cours de finalisation, est actuellement test&#233;e sur une base de donn&#233;es
biographiques dont dispose le CENTAL (Kevers &amp; Fairon, 2007). L&#8217;id&#233;e, dans le cadre de ce test, est de
g&#233;n&#233;rer automatiquement la biographie vocale d&#8217;une personnalit&#233; &#224; partir des informations disponibles
dans la base. Les deux modules sont adaptables plus largement, ensemble ou s&#233;par&#233;ment, &#224; de nombreux
autres domaines et applications. Ces composants ne sont pas actuellement mis &#224; la disposition de la com-
munaut&#233; ; les modalit&#233;s de distribution seront d&#233;cid&#233;es d&#8217;ici la fin du projet, pr&#233;vue pour d&#233;cembre 2010.
</p>
<p>2 Taittingen : syst&#232;me de g&#233;n&#233;ration automatique de textes
</p>
<p>D&#233;velopp&#233; en Python, Taittingen est un syst&#232;me de g&#233;n&#233;ration complet : il produit un texte fran&#231;ais &#224;
partir d&#8217;une repr&#233;sentation conceptuelle et non linguistique d&#8217;un discours, proche de celle utilis&#233;e dans
la Th&#233;orie de la structure rh&#233;torique (Mann &amp; Thompson, 1988). Son architecture modulaire reprend les
grandes lignes des architectures en pipeline classique (Reiter &amp; Dale, 2000) et a &#233;t&#233; d&#233;crite en d&#233;tails dans
(Blanc &amp; Boubel, 2009).
</p>
<p>Le syst&#232;me est actuellement test&#233; en s&#8217;appuyant sur les donn&#233;es d&#8217;une base de donn&#233;es biographiques.
Cette base est r&#233;guli&#232;rement aliment&#233;e par un syst&#232;me d&#8217;extraction d&#8217;informations, qui analyse les articles
de presse en ligne et r&#233;pertorie automatiquement un certain nombre d&#8217;&#233;v&#232;nements biographiques typiques :
naissance, mort, professions exerc&#233;es, dipl&#244;mes obtenus, etc. Notre application permet ainsi de g&#233;n&#233;rer un
court texte sur la vie d&#8217;une personne r&#233;pertori&#233;e dans la base.
</p>
<p>Taittingen est capable de produire un tr&#232;s grand nombre de textes diff&#233;rents &#224; partir des m&#234;mes donn&#233;es de
base. Actuellement, le syst&#232;me est pr&#233;vu de sorte que le texte g&#233;n&#233;r&#233; pour une entr&#233;e donn&#233;e soit diff&#233;rent
&#224; chaque relance du programme. &#192; terme, l&#8217;objectif est de choisir parmi ces variantes en fonction des don-
n&#233;es disponibles et des desiderata de l&#8217;utilisateur : demande d&#8217;un texte bref, d&#8217;informations particuli&#232;res &#224;
mettre en avant, etc. L&#8217;&#233;tude en cours sur un corpus de biographies nous a permis de d&#233;gager des sources
de variabilit&#233; &#224; diff&#233;rents niveaux.
</p>
<p>Durant la g&#233;n&#233;ration, le syst&#232;me utilise un dictionnaire de transfert d&#233;crivant les possibilit&#233;s de traduc-
tion de chaque concept propre au domaine de la biographie vers une repr&#233;sentation lexico-syntaxique.
La vari&#233;t&#233; est ainsi rendue possible principalement par enrichissement manuel de ces ressources linguis-
tiques. &#192; titre d&#8217;exemple, les &#233;v&#232;nements &#233;ducations et professions regroupent chacun une trentaine de
patrons lexico-syntaxiques diff&#233;rents permettant d&#8217;exprimer la m&#234;me id&#233;e. De la m&#234;me mani&#232;re, le sys-
t&#232;me exploite une ressource de connecteurs discursifs, ce qui permet de faire varier la fa&#231;on d&#8217;exprimer
les relations qui lient les segments d&#8217;un discours.
</p>
<p>Enfin, nous travaillons actuellement &#224; l&#8217;ajout de variantes au niveau de la planification du discours. L&#8217;id&#233;e
est d&#8217;adapter la structure g&#233;n&#233;rale du texte g&#233;n&#233;r&#233; en fonction des informations disponibles dans la base
et du profil de l&#8217;auditeur ou du lecteur. D&#8217;apr&#232;s nos observations, les textes biographiques ne pr&#233;sentent
pas une &#233;norme libert&#233; stylistique et suivent g&#233;n&#233;ralement une structure assez fig&#233;e. Ici, quatre plans du
discours ont &#233;t&#233; envisag&#233;s : textes courts, textes structur&#233;s par ordre chronologique, textes structur&#233;s par
th&#233;matiques et textes sous forme de listes &#233;num&#233;ratives.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#201;N&#201;RATION AUTOMATIQUE DE PAROLE EXPRESSIVE
</p>
<p>3 StyloPhone : Syst&#232;me de synth&#232;se multi-styles
</p>
<p>Le syst&#232;me de synth&#232;se &#224; la base du projet est eLite (Beaufort &amp; Ruelle, 2006) qui, dans sa derni&#232;re
version, produit de la parole par s&#233;lection d&#8217;unit&#233;s non-uniformes (NUU, Non-Uniform Units). Dans ce
type de syst&#232;me, la prosodie originale a &#233;t&#233; conserv&#233;e. Si cette approche facilite l&#8217;obtention d&#8217;une courbe
m&#233;lodique relativement naturelle, elle complique, par contre, l&#8217;int&#233;gration de variations m&#233;lodiques, parce
que le style de la synth&#232;se est fortement d&#233;pendant de la voix enregistr&#233;e.
</p>
<p>D&#233;velopp&#233; autour d&#8217;eLite, StyloPhone est un synth&#233;tiseur multi-styles : il cherche &#224; introduire des varia-
tions de style tout en conservant le naturel de la voix de synth&#232;se. Trois styles vocaux sont actuellement
mod&#233;lis&#233;s : journalistique, politique et conversationnel.
Pour obtenir un style vocal donn&#233;, StyloPhone modifie les valeurs de certains param&#232;tres prosodiques de
la parole. Les param&#232;tres prosodiques exploit&#233;s appartiennent &#224; diff&#233;rentes cat&#233;gories :
&#8211; les variations phonologiques : pourcentage de e muets finaux prononc&#233;s et pourcentage de pauses
</p>
<p>pleines (respirations, h&#233;sitations) ;
&#8211; les dur&#233;es : dur&#233;e des syllabes, dur&#233;e des pauses, nombre de syllabes entre deux pauses ;
&#8211; l&#8217;intonation et l&#8217;accentuation : variation de la F0, nombre de syllabes pro&#233;minentes, nombre de syllabes
</p>
<p>avec accent initial, nombre de syllabes avec accent final.
Selon les param&#232;tres, les modifications sont r&#233;alis&#233;es soit au c&#339;ur d&#8217;eLite, soit en post-traitement. Les mo-
difications r&#233;alis&#233;es au c&#339;ur d&#8217;eLite sont les variations phonologiques et la mod&#233;lisation des dur&#233;es. Elles
sont effectu&#233;es avant la s&#233;lection des unit&#233;s, afin de conserver une courbe prosodique naturelle. Les modi-
fications appliqu&#233;es en post-traitement sur le signal de parole produit par eLite concernent l&#8217;intonation et
l&#8217;accentuation (Roekhaut et al., 2010). Elles sont r&#233;alis&#233;es &#224; l&#8217;aide d&#8217;un script Praat (Boersma &amp; Weenink,
2010) lanc&#233; en ligne de commande. Au cours de ce traitement, en fonction des variations observ&#233;es dans
un style donn&#233;, certaines syllabes initialement non-pro&#233;minentes peuvent devenir pro&#233;minentes.
</p>
<p>Afin de d&#233;terminer les modifications &#224; r&#233;aliser, les valeurs des param&#232;tres prosodiques ont &#233;t&#233; &#233;tudi&#233;es
sur un corpus de parole expressive, et compar&#233;es aux valeurs produites par eLite en synth&#232;se neutre. Le
corpus de parole que nous avons utilis&#233; est C-PROM, qui contient l&#8217;enregistrement de plusieurs locuteurs
et de plusieurs styles (Avanzi et al., 2010). L&#8217;extraction des valeurs des param&#232;tres est r&#233;alis&#233;e &#224; l&#8217;aide des
outils ProsoReport (Goldman et al., 2007a) et ProsoProm (Goldman et al., 2007b).
</p>
<p>Les modifications r&#233;alis&#233;es permettent de g&#233;n&#233;rer 3 styles de synth&#232;se qui reproduisent les param&#232;tres
observ&#233;s dans chaque style original. Cependant, ces modifications ne sont pas encore totalement satisfai-
santes. Afin de se rapprocher le plus possible d&#8217;une production orale naturelle et r&#233;aliste, il nous semble
par exemple utile d&#8217;orienter les recherches vers la mod&#233;lisation du style d&#8217;un seul locuteur, parce que les
variations entre plusieurs locuteurs au sein d&#8217;un m&#234;me style sont trop importantes.
Nous constatons &#233;galement une perte de naturel due aux modifications en post-traitement. Pour pallier cet
inconv&#233;nient, nous avons l&#8217;intention de favoriser les modifications au c&#339;ur du syst&#232;me, avant la s&#233;lection
des unit&#233;s de parole.
</p>
<p>4 D&#233;monstration
</p>
<p>Dans le cadre de la d&#233;monstration, nous pr&#233;senterons une application qui int&#232;gre, sous une m&#234;me in-
terface graphique, le module de g&#233;n&#233;ration automatique de textes et le module de synth&#232;se vocale. Le</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>O. BLANC, N. BOUBEL, J.-P. GOLDMAN, S. ROEKHAUT, A.C. SIMON, C. FAIRON, R. BEAUFORT
</p>
<p>programme permet d&#8217;acc&#233;der aux informations pr&#233;sentes dans la base de donn&#233;es biographiques. Pour
chaque personne r&#233;f&#233;renc&#233;e dans cette base, l&#8217;interface pr&#233;sente diff&#233;rentes variantes possibles de courtes
biographies sur sa vie et permet d&#8217;&#233;couter les discours correspondants oralis&#233;s, dans les trois styles pr&#233;d&#233;-
finis. Parmi ceux-ci, le style qui semble actuellement le plus appropri&#233; pour pr&#233;senter les biographies est
le style journalistique. Nous envisageons d&#8217;&#233;tudier un autre style de parole qui nous semble plus pertinent
pour la pr&#233;sentation de ce type de texte : l&#8217;expos&#233; oral.
</p>
<p>La pr&#233;sentation du syst&#232;me se fera sur les machines apport&#233;es par les participants et ne n&#233;cessitera pas de
moyens techniques particuliers.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AVANZI M., SIMON A.-C., GOLDMAN J. &amp; AUCHLIN A. (2010). C-PROM : Un corpus de
fran&#231;ais parl&#233; annot&#233; pour l&#8217;&#233;tude des pro&#233;minences. In Proceedings of JEP, Mons, Belgium.
http ://sites.google.com/site/corpusprom.
</p>
<p>BEAUFORT R. &amp; RUELLE A. (2006). eLite : syst&#232;me de synth&#232;se de la parole &#224; orientation linguistique.
In Proceedings of JEP, p. 509&#8211;512.
</p>
<p>BLANC O. &amp; BOUBEL N. (2009). Taittingen : A Biographical Text Generation System. In Z. VETU-
LANI, Ed., Proceedings of 4th Language &amp; Technology Conference, p. 375&#8211;379.
</p>
<p>BOERSMA P. &amp; WEENINK D. (2010). Praat : doing phonetics by computer (Version 5.1.24).
http ://www.praat.org.
</p>
<p>GOLDMAN, J.-PH. AUCHLIN A., SIMON A.-C. &amp; AVANZI M. (2007a). Phonostylographe : un outil
de description prosodique. Comparaison du style radiophonique et lu. Nouveaux cahiers de linguistique
fran&#231;aise, 28, 219&#8211;237.
GOLDMAN J.-P., AVANZI M., SIMON A.-C., LACHERET A. &amp; AUCHLIN A. (2007b). A methodo-
logy for the automatic detection of perceived prominent syllables in spoken French. In Proceedings of
Interspeech 2007, p. 98&#8211;101.
</p>
<p>KEVERS L. &amp; FAIRON C. (2007). Vers une base de connaissances biographiques : extraction d&#8217;informa-
tion et ontologies. In Actes des 7&#232;mes Journ&#233;es Francophones Extraction et Gestion des Connaissances,
volume / of Revue des Nouvelles Technologies de l&#8217;Information - S&#233;rie Extraction et gestion des connais-
sances, p. 373&#8211;378.
</p>
<p>MANN W. C. &amp; THOMPSON S. A. (1988). Rhetorical structure theory : Toward a functional theory of
text organization. Text, 8(3), 243&#8211;281.
REITER E. &amp; DALE R. (2000). Building Natural Language Generation Systems. Cambridge.
</p>
<p>ROEKHAUT S., GOLDMAN J.-P. &amp; SIMON A.-C. (2010). A Model for Varying Speaking Style in TTS
systems. In Proceedings of Speech Prosody 2010, Chicago, Illinois, USA.</p>

</div></div>
</body></html>