<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Des cartes dialectologiques num&#233;ris&#233;es pour le TALN</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Des cartes dialectologiques num&#233;ris&#233;es pour le TALN
</p>
<p>Yves Scherrer
Universit&#233; de Gen&#232;ve
</p>
<p>Rue de Candolle 5, 1211 Gen&#232;ve 4, Suisse
yves.scherrer@unige.ch
</p>
<p>R&#233;sum&#233;. Cette d&#233;monstration pr&#233;sente une interface web pour des donn&#233;es num&#233;ris&#233;es de l&#8217;atlas lin-
guistique de la Suisse allemande. Nous pr&#233;sentons d&#8217;abord l&#8217;int&#233;gration des donn&#233;es brutes et des donn&#233;es
interpol&#233;es de l&#8217;atlas dans une interface bas&#233;e sur Google Maps. Ensuite, nous montrons des prototypes
de syst&#232;mes de traduction automatique et d&#8217;identification de dialectes qui s&#8217;appuient sur ces donn&#233;es dia-
lectologiques num&#233;ris&#233;es.
</p>
<p>Abstract. This demonstration presents a web interface for digitized data of the linguistic atlas of
German-speaking Switzerland. First, we present the integration of raw and interpolated atlas data with an
interface based on Google Maps. Then, we show prototypes of machine translation and dialect identifica-
tion systems which rely on the digitized dialectological data.
</p>
<p>Mots-cl&#233;s : Dialectologie, atlas linguistique, traduction automatique, identification de dialectes.
</p>
<p>Keywords: Dialectology, linguistic atlas, machine translation, dialect identification.
</p>
<p>1 Introduction : Atlas dialectologiques et traitement du langage
</p>
<p>Depuis la fin du 19&#232;me si&#232;cle, des &#233;tudes dialectologiques ont &#233;t&#233; entreprises dans de nombreuses r&#233;gions
linguistiques. Dans la plupart des cas, ces recherches ont donn&#233; lieu &#224; des atlas linguistiques qui pr&#233;sentent
les diff&#233;rences dialectales sous formes de cartes. Mis &#224; part les projets les plus r&#233;cents, ces ouvrages ont &#233;t&#233;
r&#233;alis&#233;s sans l&#8217;apport technique de l&#8217;ordinateur, avec des cartes dessin&#233;es &#224; la main. Cependant, de nom-
breuses &#233;tudes dialectologiques r&#233;centes (dialectom&#233;trie) font appel &#224; un traitement de donn&#233;es quantitatif
par ordinateur, avec l&#8217;objectif d&#8217;inf&#233;rer des distances dialectales et des classifications de dialectes (Ner-
bonne &amp; Heeringa, 2001; S&#233;guy, 1973). L&#8217;utilisation de ressources dialectologiques pour des recherches
quantitatives passe donc souvent par une &#233;tape de num&#233;risation. 1 Dans la premi&#232;re partie de cette d&#233;mons-
tration (Sections 2 et 3), nous discutons les enjeux de la num&#233;risation partielle de l&#8217;atlas linguistique de la
Suisse allemande et pr&#233;sentons ces donn&#233;es sur un site web dynamique.
</p>
<p>Dans le champ du TALN, on constate &#233;galement un int&#233;r&#234;t accru pour les dialectes, avec des travaux
sur l&#8217;identification de dialectes (Biadsy et al., 2009), sur l&#8217;analyse syntaxique de dialectes (Chiang et al.,
2006; Vaillant, 2008) et sur la traduction automatique (Scherrer, 2009). Toutefois, dans la plupart de ces
travaux, les dialectes sont con&#231;us comme des entit&#233;s scalaires et bien distinctes. En r&#233;alit&#233;, cette hypoth&#232;se
</p>
<p>1. Pour une vue d&#8217;ensemble de donn&#233;es dialectologiques disponibles en format num&#233;rique, voir http://www.
ericwheeler.ca/atlaslist.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YVES SCHERRER
</p>
<p>est rarement valide, et on a affaire le plus souvent &#224; un continuum dialectal avec des zones plus stables et
des zones de transition. L&#8217;int&#233;gration de donn&#233;es g&#233;ographiques permet donc de mieux tenir compte de
ces r&#233;alit&#233;s. Dans la deuxi&#232;me partie de la d&#233;monstration, nous proposons donc un syst&#232;me de traduction
automatique vers les dialectes suisse allemands (section 4) et un syst&#232;me d&#8217;identification de dialectes
(section 5) bas&#233;s sur les cartes dialectologiques num&#233;ris&#233;es. Ces syst&#232;mes sont accessibles sur internet.
</p>
<p>2 Num&#233;risation de l&#8217;atlas linguistique de la Suisse allemande
</p>
<p>Le Sprachatlas der deutschen Schweiz (SDS) (Hotzenk&#246;cherle et al., 1962 1997) est constitu&#233; de 8 vo-
lumes publi&#233;s entre 1962 et 1997 ; la collection des donn&#233;es s&#8217;est effectu&#233;e entre 1939 et 1959. Les deux
premiers volumes couvrent les principales diff&#233;rences phon&#233;tiques et phonologiques. Le troisi&#232;me vo-
lume est d&#233;di&#233; &#224; la morphologique flexionnelle et d&#233;rivationnelle, tandis que les cinq volumes restants
couvrent le lexique dialectal. Au total, le SDS contient plus de 1500 cartes dessin&#233;es &#224; la main, pr&#233;sentant
des donn&#233;es r&#233;colt&#233;es dans 573 localit&#233;s de la partie germanophone de la Suisse (et dans quelques il&#244;ts
germanophones du Pi&#233;mont italien).
</p>
<p>Le projet de num&#233;risation pr&#233;sent&#233; ici ne couvre qu&#8217;une partie de ce mat&#233;riel. La s&#233;lection du mat&#233;riel a &#233;t&#233;
guid&#233;e par l&#8217;objectif initial de nos travaux de recherche (voir sections 4 et 5). Il s&#8217;est notamment av&#233;r&#233; que
les cartes lexicales du SDS concernent en grande partie la vie rurale des ann&#233;es 1940 et tendent &#224; devenir
obsol&#232;tes. &#192; l&#8217;heure actuelle, nous avons num&#233;ris&#233; une cinquantaine de cartes phon&#233;tiques (15% des cartes
phon&#233;tiques du SDS), une centaine de cartes morphologiques (37%), et une trentaine de cartes lexicales
(3%). Afin d&#8217;acc&#233;lerer le processus, la complexit&#233; des cartes a &#233;t&#233; r&#233;duite de deux mani&#232;res. Premi&#232;rement,
les variantes dialectales apparaissant dans moins de 10 points d&#8217;enqu&#234;te ont &#233;t&#233; &#233;cart&#233;es. Deuxi&#232;mement,
certaines variantes phon&#233;tiques ont &#233;t&#233; regroup&#233;es puisque les conventions orthographiques que nous uti-
lisons ne permettaient pas de les distinguer.
</p>
<p>La num&#233;risation proprement dite est effectu&#233;e &#224; l&#8217;aide du logiciel ArcMap, un syst&#232;me d&#8217;informations
g&#233;ographiques. En prenant comme mod&#232;le une carte originale scann&#233;e ou photographi&#233;e (les cartes du
SDS d&#233;passent le format A3), un fichier est cr&#233;&#233; pour chacune des variantes dialectales y pr&#233;sente. Ce
fichier contient les coordonn&#233;es des points d&#8217;enqu&#234;te auxquels cette variante est recens&#233;e.
</p>
<p>Dans la d&#233;monstration, nous montrerons comment ces donn&#233;es peuvent &#234;tre consult&#233;es de mani&#232;re inter-
active sur une page web. Un script Python lit les fichiers ArcMap et affiche les variantes dialectales sous
forme de marqueurs sur une carte Google Maps. Toutes les d&#233;monstrations pr&#233;sent&#233;es ici sont accessibles
&#224; l&#8217;adresse http://latlcui.unige.ch/~yves/.
</p>
<p>3 Interpolation des cartes num&#233;ris&#233;es
</p>
<p>Les cartes originales du SDS ainsi que les cartes num&#233;ris&#233;es d&#233;crites ci-dessus repr&#233;sentent les ph&#233;no-
m&#232;nes linguistiques sous forme de points ; chaque point repr&#233;sente une localit&#233; d&#8217;enqu&#234;te. Si cette repr&#233;-
sentation en points est plus fid&#232;le aux donn&#233;es initiales, une repr&#233;sentation en surfaces est plus proche de
la r&#233;alit&#233;. Par exemple, si trois points d&#8217;enqu&#234;te adjacents pr&#233;sentent la m&#234;me forme dialectale, on peut
admettre que cette forme est valable &#233;galement dans les villages et hameaux qui se trouvent &#224; l&#8217;int&#233;rieur
de ce triangle.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DES CARTES DIALECTOLOGIQUES NUM&#201;RIS&#201;ES POUR LE TALN
</p>
<p>Le passage d&#8217;une repr&#233;sentation en points vers une repr&#233;sentation en surfaces est appel&#233; interpolation.
L&#8217;objectif de l&#8217;interpolation est d&#8217;estimer la probabilit&#233; de chaque variante linguistique &#224; chaque endroit
de la Suisse allemande en fonction des informations collect&#233;es aux points d&#8217;enqu&#234;te. Par exemple, si une
observation A appara&#238;t au milieu d&#8217;une zone uniforme d&#8217;observations B, on peut en d&#233;duire que A est
une observation aberrante avec une probabilit&#233; basse. En revanche, m&#234;me dans les endroits o&#249; B a &#233;t&#233;
observ&#233;, il existe une probabilit&#233; infime que la variante A y apparaisse. En somme, l&#8217;interpolation permet
de g&#233;n&#233;raliser les donn&#233;es obtenues dans un nombre restreint de points d&#8217;enqu&#234;te, par un nombre restreint
d&#8217;informateurs (en g&#233;n&#233;ral, un seul informateur par point d&#8217;enqu&#234;te).
</p>
<p>Concr&#232;tement, nous adaptons la m&#233;thode de Rumpf et al. (2009). Ils estiment un champ d&#8217;intensit&#233; continu
pour chaque variante dialectale. Ainsi, &#224; chaque pixel de la carte r&#233;sultante, l&#8217;intensit&#233; d&#8217;une variante
indique la vraisemblance que cette variante est utilis&#233;e au pixel donn&#233;. Le champ d&#8217;intensit&#233; est calcul&#233; &#224;
l&#8217;aide d&#8217;une estimation par noyau. Cette proc&#233;dure est implant&#233;e &#224; l&#8217;aide d&#8217;outils existants dans le logiciel
ArcMap.
</p>
<p>La d&#233;monstration permettra aux spectateurs de voir ces donn&#233;es interpol&#233;es sous forme d&#8217;images semi-
transparentes, superposables sur une carte Google Maps. Cette application est accessible par l&#8217;adresse
donn&#233;e ci-dessus.
</p>
<p>4 Traduction automatique
</p>
<p>Les donn&#233;es dialectologiques d&#233;crites ci-dessus sont int&#233;gr&#233;es dans un syst&#232;me de traduction automatique
bas&#233; sur des r&#232;gles. Ce syst&#232;me traduit un texte en allemand standard vers un dialecte suisse allemand
choisi sur une carte (Scherrer, 2009).
</p>
<p>La traduction commence par une analyse syntaxique et morphologique du texte source. Chaque mot est
lemmatis&#233; (analyse de mots compos&#233;s comprise) et annot&#233; avec des traits morphologiques et syntaxiques.
Ensuite, le texte annot&#233; est traduit mot par mot. 2 Partant de la forme de base d&#8217;un mot allemand stan-
dard, des r&#232;gles phon&#233;tiques et lexicales sont utilis&#233;es pour cr&#233;er une nouvelle forme de base dialectale.
Un g&#233;n&#233;rateur morphologique dialectal cr&#233;e ensuite les formes fl&#233;chies correctes. La plupart des r&#232;gles
phon&#233;tiques et lexicales, ainsi que les r&#232;gles du g&#233;n&#233;rateur morphologique, sont li&#233;es &#224; des cartes dialec-
tologiques. Elles s&#233;lectionnent diff&#233;rentes variantes dialectales selon les coordonn&#233;es du dialecte cible.
</p>
<p>Dans la d&#233;monstration, nous montrerons une page web permettant &#224; l&#8217;utilisateur de s&#233;lectionner un dialecte
cible sur une carte et de traduire un texte allemand dans ce dialecte.
</p>
<p>5 Identification de dialecte
</p>
<p>L&#8217;identification de dialecte, ou plus g&#233;n&#233;ralement l&#8217;identification de langue, est habituellement bas&#233;e sur
la distribution de caract&#232;res ou de n-grammes de caract&#232;res. Cette approche peut &#234;tre probl&#233;matique pour
les dialectes dont les inventaires de phon&#232;mes et de graph&#232;mes sont tr&#232;s similaires, ou pour lesquelles des
</p>
<p>2. Des r&#232;gles syntaxiques permettant des accords &#224; longue distance et des changements d&#8217;ordre de mots seront int&#233;gr&#233;es
prochainement. Ces r&#232;gles seront bas&#233;es sur les donn&#233;es de l&#8217;atlas syntaxique du suisse allemand, actuellement en cours de
r&#233;daction (Bucheli &amp; Glaser, 2002).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YVES SCHERRER
</p>
<p>corpus d&#8217;entra&#238;nement ne sont pas disponibles.
</p>
<p>Nous proposons une alternative bas&#233;e sur une approche &#171; sac de mots &#187; : nous essayons d&#8217;identifier des
mots dans un texte et de d&#233;terminer dans quelles r&#233;gions ces formes apparaissent. Pour ce faire, nous
g&#233;n&#233;rons d&#8217;abord une liste de mots dialectaux &#224; partir d&#8217;une liste de mots-occurrences allemands standards,
&#224; l&#8217;aide du syst&#232;me de traduction automatique. En faisant cela, nous gardons la trace des cartes dialectales
impliqu&#233;es dans la traduction, ce qui nous permet de localiser g&#233;ographiquement chacun de ces mots.
</p>
<p>Ensuite, les mots du texte &#224; identifier sont recherch&#233;s dans la base de donn&#233;es, et les cartes de chacun
des mots sont combin&#233;s. En fin de compte, chaque phrase est repr&#233;sent&#233;e par une carte qui visualise la
distribution de probabilit&#233;s de la phrase dans les diff&#233;rentes r&#233;gions suisses. Nous montrerons &#224; l&#8217;aide de
quelques exemples comment diff&#233;rents dialectes suisse allemands peuvent &#234;tre identifi&#233;s gr&#226;ce &#224; cet outil
en ligne.
</p>
<p>Remerciements
</p>
<p>Une partie de ces travaux a &#233;t&#233; r&#233;alis&#233;e durant mon s&#233;jour &#224; l&#8217;Universit&#233; Columbia de New York, financ&#233;
par le Fonds National Suisse de la Recherche Scientifique (bourse No. PBGEP1-125929). Je tiens &#224; re-
mercier Owen Rambow pour les nombreuses discussions stimulantes au sujet de mes recherches.
</p>
<p>R&#233;f&#233;rences
BIADSY F., HIRSCHBERG J. &amp; HABASH N. (2009). Spoken Arabic dialect identification using phono-
tactic modeling. In EACL 2009 Workshop on Computational Approaches to Semitic Languages, Ath&#232;nes.
BUCHELI C. &amp; GLASER E. (2002). The Syntactic Atlas of Swiss German Dialects : empirical and
methodological problems. In S. BARBIERS, L. CORNIPS &amp; S. VAN DER KLEIJ, Eds., Syntactic Micro-
variation, volume II. Amsterdam : Meertens Institute Electronic Publications in Linguistics.
CHIANG D., DIAB M., HABASH N., RAMBOW O. &amp; SHAREEF S. (2006). Parsing Arabic dialects.
In EACL&#8217;06 : Proceedings of the Eleventh Conference of the European Chapter of the Association for
Compuational Linguistics, p. 369&#8211;376, Trento.
HOTZENK&#214;CHERLE R., SCHL&#196;PFER R., TR&#220;B R. &amp; ZINSLI P., Eds. (1962-1997). Sprachatlas der
deutschen Schweiz. Bern : Francke.
NERBONNE J. &amp; HEERINGA W. (2001). Computational comparison and classification of dialects. In W.
VIERECK &amp; H. GWOSDEK, Eds., Dialectologia et Geolinguistica. Journal of the International Society
for Dialectology and Geolinguistics, volume 9, p. 69&#8211;83. Alessandria : Edizioni dell&#8217;Orso.
RUMPF J., PICKL S., ELSPASS S., K&#214;NIG W. &amp; SCHMIDT V. (2009). Structural analysis of dialect
maps using methods from spatial statistics. Zeitschrift f&#252;r Dialektologie und Linguistik, 76(3).
SCHERRER Y. (2009). Un syst&#232;me de traduction automatique param&#233;tr&#233; par des atlas dialectologiques.
In Actes de TALN 2009, Senlis.
S&#201;GUY J. (1973). La dialectom&#233;trie dans l&#8217;atlas linguistique de la Gascogne. Revue de linguistique
romane, 37, 1&#8211;24.
VAILLANT P. (2008). Grammaires factoris&#233;es pour des dialectes apparent&#233;s. In Actes de TALN&#8217;08, p.
159&#8211;168, Avignon.</p>

</div></div>
</body></html>