<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Identification des actants et circonstants par apprentissage machine</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19-23 juillet 2010 
</p>
<p>Identification des actants et circonstants par apprentissage machine 
</p>
<p>Fadila Hadouche1   Guy Lapalme1   Marie-Claude L&#8217;Homme2 
</p>
<p>(1)  RALI, (2) OLST,  
Universit&#233; de Montr&#233;al,  
</p>
<p>C.P. 6128, succursale Centre-ville,  
Montr&#233;al, Qu&#233;bec,  
Canada H3C 3J7 
</p>
<p>hadouchf@iro.umontreal.ca, lapalme@iro.umontreal, mc.lhomme@umontreal.ca 
</p>
<p> 
</p>
<p>R&#233;sum&#233;  
Dans cet article, nous traitons de l&#8217;identification automatique des participants actants et circonstants de 
lexies pr&#233;dicatives verbales tir&#233;es d&#8217;un corpus sp&#233;cialis&#233; en langue fran&#231;aise. Les actants contribuent &#224; la 
r&#233;alisation du sens de la lexie alors que les circonstants sont optionnels : ils ajoutent une information 
suppl&#233;mentaire qui ne fait pas partie int&#233;grante du s&#233;mantisme de la lexie. Nous proposons une 
classification de ces participants par apprentissage machine bas&#233;e sur un corpus de lexies verbales du 
domaine de l&#8217;informatique, lexies qui ont &#233;t&#233; annot&#233;es manuellement avec des r&#244;les s&#233;mantiques. Nous 
pr&#233;sentons des features qui nous permettent d&#8217;identifier les participants et de distinguer les actants des 
circonstants. 
</p>
<p>Abstract  
In this paper we discuss the identification of participants actants and circumstants of specialized verbal 
lexical units in a French specialised corpus. The actants are linguistic units that contribute to the sense of 
the verbal lexical unit while circumstants are optional: they add extra information that is not part of the 
meaning of the verbal unit. In this work, we propose a classification of participants using machine 
learning based on a specialized corpus of verbal lexical items in the field of computing which are 
annotated manually with semantic roles labels. We defined features to identify participants and 
distinguish actants from circumstants.  
</p>
<p>Mots-cl&#233;s :   Structure actancielle, actants et circonstants, features de classification 
Keywords:   Actantial structure, actants and circumstants, classification features 
 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADILA HADOUCHE, GUY LAPALME, MARIE-CLAUDE L&#8217;HOMME 
</p>
<p>1 Introduction 
Identifier la fronti&#232;re entre les actants et les circonstants reste une t&#226;che difficile en linguistique et 
pr&#233;sente des d&#233;fis d&#8217;automatisation encore plus &#233;lev&#233;s. Entre autres difficult&#233;s, nous pouvons 
&#233;voquer le fait que certains actants et circonstants peuvent occuper les m&#234;mes positions syntaxiques 
et il arrive que les actants soient omis dans les phrases1. Dans la phrase suivante, Vous voulez 
simplement AFFECTER une valeur &#224; une variable que vous avez d&#233;clar&#233;e: les actants sont vous, 
valeur et variable que vous avez d&#233;clar&#233;e ; simplement est un circonstant. 
</p>
<p>Les actants permettent de d&#233;finir le sens de la lexie verbale, contrairement aux circonstants qui ne 
contribuent pas au sens de la lexie. Par exemple, la lexie ABANDONNER signifiant &#171; cesser une activit&#233; 
sans la finir &#187; est d&#233;finie en faisant appel aux actants agent (celui &#224; l&#8217;origine de l&#8217;action) et patient 
(subissant l&#8217;action exprim&#233;e par le verbe). L&#8217;unit&#233; linguistique qui joue le r&#244;le d&#8217;agent ou le r&#244;le de 
patient est un actant. On voit bien qu&#8217;avec ces actants le sens de la lexie est rempli et complet. Les 
autres participants de cette m&#234;me lexie dans d&#8217;autres contextes qui ne jouent pas les r&#244;les d&#8217;agent ou 
de patient seront consid&#233;r&#233;s comme des circonstants. Dans l&#8217;exemple le programmeur ABANDONNE 
l&#8217;op&#233;ration &#224; ce stade, programmeur et op&#233;ration sont des actants (respectivement agent et patient) et 
stade est un circonstant de temps.  
</p>
<p>Notre travail consiste pr&#233;cis&#233;ment &#224; distinguer ces deux formes de participants. Nous avons divis&#233; la 
t&#226;che en deux : identification des participants de la lexie verbale et leur classification en actant et 
circonstant. Dans notre travail, aucune ressource lexicale de sous-cat&#233;gorisation des verbes ou 
dictionnaire n&#8217;est utilis&#233; pour identifier les participants actants et circonstants des verbes. Nous nous 
basons sur un corpus fran&#231;ais de lexies verbales annot&#233;es manuellement avec des r&#244;les s&#233;mantiques. 
Nous nous sommes inspir&#233;s des travaux bas&#233;s sur l&#8217;extraction des features pour la classification des 
participants. Nous avons propos&#233; des features bas&#233;s sur deux approches : 1) les relations de 
d&#233;pendance trouv&#233;es par un analyseur syntaxique, en consid&#233;rant les mots en d&#233;pendance avec la 
lexie comme participants candidats; 2) les cat&#233;gories grammaticales des mots de la phrase o&#249; 
appara&#238;t la lexie verbale susceptibles d&#8217;&#234;tre des participants de cette lexie. Aucune de ces deux 
strat&#233;gies ne permettant d&#8217;effectuer une distinction parfaite entre les deux types de participants, nous 
souhaitons &#233;valuer jusqu&#8217;&#224; quel point ces strat&#233;gies peuvent y contribuer. Nous cherchons &#224; proposer 
&#224; des annotateurs humains des phrases pr&#233;-annot&#233;es afin d&#8217;acc&#233;l&#233;rer l&#8217;annotation manuelle.  
</p>
<p>2 Travaux connexes 
Plusieurs crit&#232;res d&#8217;identification des actants ont &#233;t&#233; sugg&#233;r&#233;s en linguistique th&#233;orique [1] mais 
certains sont extr&#234;mement difficiles &#224; automatiser. Le crit&#232;re obligatoire pour les actants et optionnel 
pour les circonstants n&#8217;est pas toujours facile &#224; appliquer lors de l&#8217;analyse de phrases r&#233;elles. Un 
autre crit&#232;re, celui de la mobilit&#233; de position, veut que seuls les circonstants peuvent changer de 
position dans la phrase. Or, on trouve des cas o&#249; les actants peuvent &#234;tre d&#233;plac&#233;s, comme le 
remarque Anne Lacheret-Dujour [2] dans son exemple &#171; le chocolat, j&#8217;adore &#187;. Par ailleurs, les sujets 
et compl&#233;ments d&#8217;objet direct correspondent g&#233;n&#233;ralement &#224; des actants, tandis que certains 
compl&#233;ments introduits par des pr&#233;positions peuvent avoir les deux r&#244;les. Enfin, la fr&#233;quence peut 
jouer un r&#244;le important dans la distinction entre actants et circonstants [3]. C&#233;cile Fabre et C&#233;cile 
Fr&#233;rot proposent une combinaison de deux mesures de productivit&#233;2 pour distinguer sur corpus, au 
sein des groupes pr&#233;positionnels rattach&#233;s au verbe, des types de compl&#233;ments diff&#233;rents [4].  
</p>
<p>                                                 
1  Certains auteurs d&#233;signent les actants par arguments et les circonstants par adjoints. 
2  Productivit&#233; recteur-pr&#233;position : nombre de r&#233;gis diff&#233;rents que le couple (verbe, pr&#233;position) gouverne. Productivit&#233; 
</p>
<p>pr&#233;position-r&#233;gi : nombre de verbes diff&#233;rents qui gouvernent le couple (pr&#233;position, r&#233;gi) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFICATION DES ACTANTS ET CIRCONSTANTS PAR APPRENTISSAGE MACHINE 
Des ressources telles que Framenet3, Verbnet4 ou Propbank5 sont des ressources qui fournissent une 
annotation des verbes et de leurs actants (et, dans certaines d&#8217;entre elles, de leur circonstants) en 
&#233;tiquetant ces derniers au moyen de r&#244;les s&#233;mantiques6. Ces ressources ont &#233;t&#233; construites 
manuellement et ont servi de point de d&#233;part pour la mise au point de m&#233;thodes d'annotation 
automatiques des pr&#233;dicats (dont certaines s'appuient sur les informations syntaxiques pour identifier 
la structure argumentale d&#8217;un pr&#233;dicat verbal). Dans ce cadre, Gildea et Jurafsky ont propos&#233; 
l&#8217;extraction de features7 syntaxiques qui permettent d&#8217;identifier les participants d&#8217;un pr&#233;dicat [5]. 
Richard Johansson et Pierre Nugues ont propos&#233; d&#8217;utiliser les relations de d&#233;pendance syntaxique 
comme un feature [6]. D&#8217;autres travaux se basent sur des informations syntaxiques : Surdeanu [7] a 
utilis&#233; le corpus TreeBank et PropBank ainsi que Li [8] , Che [9], T&#228;ckstr&#246;m [10] et Maria Liakata et 
al. [11]. Ces travaux proposent des mod&#232;les pour identifier les participants d&#8217;un pr&#233;dicat verbal mais 
ne distinguent pas les actants des circonstants. 
</p>
<p>D&#8217;autres propositions, qui s&#8217;appuient sur les sch&#233;mas de sous-cat&#233;gorisation des verbes, utilisent des 
informations sur la transitivit&#233; du verbe. Nasr et B&#233;chet proposent un analyseur syntaxique ax&#233; sur la 
d&#233;tection des cadres valenciels8 tels que recens&#233;s par Dicovalence [12].  
</p>
<p>3 Les participants et l&#8217;analyseur syntaxique 
Dans notre travail, nous utilisons l&#8217;analyseur syntaxique Syntex [13] qui effectue une analyse en 
d&#233;pendance pour d&#233;terminer les liens entre les mots de la phrase. La Figure 1 illustre le parall&#232;le 
entre l&#8217;analyse syntaxique faite par Syntex (liens au-dessus de la phrase) et l&#8217;annotation manuelle des 
participants de la lexie verbale (liens sous la phrase). La lexie ACCEPTER est li&#233;e syntaxiquement ou 
gouverne le mot cartouches. Ce dernier est li&#233; &#224; la lexie par le lien fonctionnel objet et il est 
consid&#233;r&#233; comme un participant de cette lexie. Dans d&#8217;autres cas, la lexie est elle m&#234;me gouvern&#233;e 
par un mot de la phrase. 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>une unit&#233; qui doit ACCEPTER des cartouches en proc&#233;dant de cette mani&#232;re 
Det Nom ProR VConj VInf Det Nom Prep VPpr Prep Det Nom 
</p>
<p> 
</p>
<p>DET 
SUJ 
</p>
<p>OBJ 
</p>
<p>DET 
</p>
<p>PARTICIPANT ACTANT ANT&#201;C&#201;DENT 
</p>
<p>OBJ 
</p>
<p>Lien entre ACCEPTER et unit&#233; Lien entre ACCEPTER et cartouches 
</p>
<p>PARTICIPANT ACTANT 
</p>
<p>REL 
</p>
<p>PARTICIPANT CIRCONSTANT 
</p>
<p>Pas de Lien entre ACCEPTER et groupe 
</p>
<p>Figure 1 : Exemple de contexte de la lexie verbale ACC&#201;PTER et ses participants 
</p>
<p>Dans la Figure 1, la lexie ACCEPTER est gouvern&#233;e par le verbe devoir (doit dans la phrase) par le lien 
fonctionnel objet. Dans ce cas, nous consid&#233;rons que le sujet de doit, r&#233;alis&#233; ici sous la forme d&#8217;un 
pronom relatif, est un participant de la lexie ACCEPTER. Toutefois, la r&#232;gle consistant &#224; consid&#233;rer 
comme participants tous les mots gouvern&#233;s par un gouvernant de la lexie n&#8217;est pas toujours 
applicable. Dans l&#8217;exemple cancel demande au serveur d&#8217;ABANDONNER le traitement, le sujet cancel 
du verbe demander n&#8217;est pas un participant de la lexie ABANDONNER. Suivre uniquement les liens 
                                                 
3  http://framenet.icsi.berkeley.edu/ 
4  http://verbs.colorado.edu/~mpalmer/projects/verbnet.html 
5  http://verbs.colorado.edu/~mpalmer/projects/ace.html 
6  &#192; noter que la ressource FrameNet pr&#233;f&#232;re l&#8217;appellation Frame elements (FE) (qui comprennent les FE obligatoires &#8211; 
</p>
<p>core - et optionnels &#8211; non core) &#224; celle de r&#244;le s&#233;mantique. Cette pr&#233;f&#233;rence terminologique refl&#232;te &#233;galement une 
distinction th&#233;orique importante. 
</p>
<p>7  Les features d&#233;finis par Gildea sont : pr&#233;dicat, cat&#233;gorie grammaticale du pr&#233;dicat et du mot candidat, t&#234;te, arbre-
syntaxique, voie passive ou active, position du mot candidat par rapport au pr&#233;dicat.  
</p>
<p>8  Un cadre valenciel d&#8217;un verbe d&#233;crit ses compl&#233;ments. Les informations donn&#233;es sont le nombre de compl&#233;ments 
avec leurs fonctions,  que n&#233;cessite un verbe dans sa r&#233;alisation.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADILA HADOUCHE, GUY LAPALME, MARIE-CLAUDE L&#8217;HOMME 
donn&#233;s par Syntex sans crit&#232;res suppl&#233;mentaires n&#8217;est pas suffisant. Il arrive &#233;galement que Syntex 
omette certains liens entre des &#233;l&#233;ments de la phrase et la lexie. Syntex ne d&#233;tecte aucun lien entre la 
lexie et &#171; en proc&#233;dant de cette mani&#232;re &#187; (Figure 1). Ce dernier est consid&#233;r&#233; comme le participant 
circonstant qui indique le mode. Dans notre corpus, 975 &#233;l&#233;ments consid&#233;r&#233;s comme des participants 
(environ 22 %) n&#8217;ont pas &#233;t&#233; d&#233;tect&#233;s par Syntex comme d&#233;pendant syntaxiquement de la lexie &#224; 
l&#8217;&#233;tude.  
</p>
<p>Dans [14], nous avons test&#233; une approche &#224; base de r&#232;gles en interpr&#233;tant ces liens syntaxiques. Les 
r&#233;sultats montrent 69 % de d&#233;termination correcte des participants. L&#8217;inconv&#233;nient de cette m&#233;thode 
&#224; base de r&#232;gles est l&#8217;impossibilit&#233; de pr&#233;voir toutes les r&#232;gles. Nous proposons l&#8217;utilisation de 
l&#8217;apprentissage machine pour une classification supervis&#233;e bas&#233;e sur ces informations syntaxiques 
dont les features correspondants sont d&#233;finis dans le Tableau 2. 
</p>
<p>4 Classification des participants par Weka9  
Nous avons utilis&#233; Weka qui fournit des impl&#233;mentations des algorithmes d&#8217;apprentissage les plus 
connus que nous pouvons appliquer sur les contextes des lexies verbales de notre corpus, en utilisant 
des features construits &#224; partir des informations syntaxiques pour retrouver les participants. Nous 
avons test&#233; plusieurs de ses classificateurs pour d&#233;finir celui qui offre le meilleur r&#233;sultat. Nous 
avons divis&#233; notre travail en deux t&#226;ches : 1) identifier les participants de la lexie verbale ; et 2) 
distinguer les actants des circonstants. Cette division nous aidera &#224; filtrer les mots candidats en tant 
qu'actants ou circonstants et nous &#233;vitera de traiter les nombreux mots qui ne sont pas participants et 
qui bruitent la performance de la classification. Deux exp&#233;rimentations pour chaque t&#226;che sont 
r&#233;alis&#233;es. Une premi&#232;re utilise les relations de d&#233;pendance syntaxique entre les mots de la phrase et 
la lexie verbale ; la seconde fait appel aux cat&#233;gories grammaticales des mots de la phrase. Nous 
notons que ce sont les mots simples des phrases o&#249; appara&#238;t la lexie qui sont des candidats &#224; &#234;tre des 
participants et non pas des syntagmes. Chaque mot candidat est d&#233;crit par des features dans le but de 
le classifier comme participant (OUI) ou non-participant (NON). Le Tableau 1 montre cette description 
correspondant &#224; certains mots de la phrase de la Figure 1 
</p>
<p>     Feature   
 
Participants    
</p>
<p>Lexie Cat-
Lexie 
</p>
<p>Mot Cat-
Mot 
</p>
<p>Position Dist-
ance 
</p>
<p>Lien-
syntaxique-
cg 
</p>
<p>Lien-
syntaxique-fn 
</p>
<p>Part 
</p>
<p>unit&#233; ACCEPTER Vinf CN Nom avant 2 doit, ProRel OBJ, SUJ, REL OUI 
</p>
<p>qui ACCEPTER VInf qui ProRel avant 1 doit OBJ, SUJ OUI 
</p>
<p>doit ACCEPTER VInf doit VConj avant 0 nul OBJ NON 
</p>
<p>cartouches ACCEPTER VInf CN Nom apr&#232;s 1 Nul OBJ OUI 
</p>
<p>Tableau 1 : Participants de l&#8217;exemple de la Figure 1 d&#233;crits par les features : cat&#233;gorie grammaticale de la lexie, la classe 
du mot en traitement (&#224; classifier), sa cat&#233;gorie grammaticale, sa position et sa distance par rapport &#224; la lexie, les 
cat&#233;gories et les fonctions grammaticales des mots rencontr&#233;s sur les liens allant de la lexie au mot. Ces features sont 
d&#233;crits au Tableau 2. 
</p>
<p>4.1 Corpus 
</p>
<p>Nous avons utilis&#233; un corpus d&#8217;informatique et d&#8217;Internet contenant une centaine de lexies verbales 
sp&#233;cialis&#233;es de langue fran&#231;aise (ex. acc&#233;der, configurer, t&#233;l&#233;charger). La structure actancielle de 
ces lexies est annot&#233;e manuellement au moyen d&#8217;&#233;tiquettes de r&#244;les s&#233;mantiques (ex. agent, patient, 
instrument) [15]. Nous avons utilis&#233; 2/3 du corpus pour l&#8217;entra&#238;nement des classificateurs et le 1/3 
</p>
<p>                                                 
9  Weka est d&#233;velopp&#233; &#224; l&#8217;Universit&#233; de Waikato en Nouvelle-Z&#233;lande. www.cs.waikato.ac.nz/ml/weka  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFICATION DES ACTANTS ET CIRCONSTANTS PAR APPRENTISSAGE MACHINE 
restant pour le test. Le corpus d&#8217;entra&#238;nement est compos&#233; de 72 lexies diff&#233;rentes et de 1512 
contextes; et le corpus de test, est compos&#233; de 36 lexies et de 756 contextes. Le corpus global est 
compos&#233; d&#8217;environ 3464 actants et de 1151 circonstants. Selon la terminologie de Weka, nous avons 
14860 instances pour l&#8217;entrainement et 6526 instances pour le test. Chaque instance correspond &#224; un 
mot pouvant &#234;tre un participant. 
</p>
<p>5 Identification des participants 
Bien que d&#8217;autres lexies soient de nature pr&#233;dicative, nous ne consid&#233;rons que les verbes dans les 
exp&#233;rimentations d&#233;crites ci-dessous : les verbes sont plus susceptibles que les noms d&#8217;&#234;tre 
accompagn&#233;s par des actants r&#233;alis&#233;s dans les phrases. Les participants d&#8217;une lexie verbale annot&#233;e 
manuellement dans le corpus prennent la forme : 1. d&#8217;un groupe nominal dont la r&#233;alisation est un 
nom ou pronom, 2.d&#8217;un groupe pr&#233;positionnel dont la r&#233;alisation est un nom ; 3. d&#8217;un groupe 
adverbial dont la r&#233;alisation est un adverbe. Nous r&#233;partissons les mots dans les cat&#233;gories classiques 
de &#171; mots pleins &#187; et &#171; mots vides &#187; [16]. Dans notre travail, nous consid&#233;rons comme participants 
candidats aux lexies verbales les groupes nominaux, les adverbes et les pronoms relatifs. Nous 
traitons les pronoms relatifs comme des participants dans notre corpus annot&#233; manuellement et 
indiquons une r&#233;f&#233;rence &#224; un groupe nominal annot&#233; ant&#233;c&#233;dent. C&#8217;est le cas d&#8217;une unit&#233; de la 
phrase de la Figure 1. Pour r&#233;aliser cette t&#226;che d&#8217;identification, nous avons extrait des features 
d&#233;crits dans Tableau 2 en nous inspirant de ceux de base d&#233;finis par Gildea &amp; Jurafsky.  
</p>
<p>Nom Features Signification 
</p>
<p>Lexie 
Catlexie 
Mot 
 
Catmot 
Position 
 
Distance 
</p>
<p>Unit&#233; lexicale verbale en &#233;tude (c.-&#224;-d. : ACC&#201;DER, IMPRIMER, etc.) 
Cat&#233;gorie grammaticale de Lexie (c.-&#224;-d. : VInf, VConj, VPpa, etc.) 
Unit&#233; lexicale de la phrase en liaison avec la lexie par des liens syntaxiques 
de Syntex.  
Cat&#233;gorie grammaticale du Mot (c.-&#224;-d.  Nom, Adverbe, Pronom, etc.) 
Position du Mot par rapport &#224; Lexie. sa valeur est &#171; avant &#187; si Mot appara&#238;t 
avant Lexie et elle est &#171; apr&#232;s &#187; si Mot est apr&#232;s Lexie. 
Le nombre de mots qui s&#233;parent Lexie du Mot en empruntant les liens 
syntaxiques qui existent entre eux  
</p>
<p>Tableau 2 : Features de classification 
</p>
<p>Le feature Mot du Tableau 2 peut prendre soit des valeurs r&#233;elles comme le verbe permettre on 
doit prendre la valeur permettre comme contenu du mot. Dans d&#8217;autres cas, nous pouvons 
prendre la classe correspondant &#224; la cat&#233;gorie grammaticale. Ces deux cas sont donn&#233;s selon les 
crit&#232;res suivants :  
</p>
<p>&#8226; Si le mot est un nom, peu importe sa valeur, sa classification reste la m&#234;me. Nous proposons 
dans ce cas la classe des noms not&#233;e CN comme valeur du feature Mot.  
</p>
<p>&#8226; Si le mot est pronom personnel dont la cat&#233;gorie grammaticale est not&#233;e Pro, nous prenons sa 
valeur r&#233;elle, car les pronoms tels que je, tu, il, etc., peuvent &#234;tre des participants r&#233;alis&#233;s 
sous forme de sujet du verbe, qui diff&#232;rent des pronoms le, les, etc., qui peuvent &#234;tre des 
participants r&#233;alis&#233;s sous forme d&#8217;objet direct. En outre, d&#8217;autres pronoms tels que se  ne sont 
pas toujours annot&#233;s comme participants. 
</p>
<p>&#8226; Si le mot est un pronom relatif nous prenons sa valeur r&#233;elle, sachant que le pronom relatif qui 
pointe sur un participant ant&#233;c&#233;dent de cat&#233;gorie grammaticale Nom de fonction SUJET et le 
pronom relatif que pointe sur un participant ant&#233;c&#233;dent de cat&#233;gorie grammaticale Nom de 
fonction OBJET.  
</p>
<p>&#8226; Nous avons constat&#233; dans notre corpus que certains adverbes (simultan&#233;ment, 
directement, etc.) sont annot&#233;s par les linguistes comme des participants, mais d&#8217;autres ne le 
sont pas (puis, ne pas, m&#234;me, etc.). Nous avons pris toutes les valeurs des adverbes </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADILA HADOUCHE, GUY LAPALME, MARIE-CLAUDE L&#8217;HOMME 
rencontr&#233;s dans notre corpus et si un adverbe n&#8217;a jamais &#233;t&#233; rencontr&#233;, nous avons d&#233;fini une 
classe inconnue not&#233;e INCADV. 
</p>
<p>Dans notre &#233;tude, nous avons propos&#233; d&#8217;autres features &#224; ajouter &#224; ceux du Tableau 2 qui diff&#232;rent 
selon leur utilisation des relations de d&#233;pendance syntaxique entre la lexie et les autres mots de la 
phrase. 
</p>
<p>5.1 Features de classification bas&#233;s sur les relations de d&#233;pendance de Syntex 
</p>
<p>Nous sugg&#233;rons de prendre en compte les relations de d&#233;pendance syntaxique entre la lexie verbale 
et les autres mots de la phrase. Nous nous sommes bas&#233;s sur l&#8217;analyseur syntaxique Syntex &#224; partir 
duquel  nous avons extrait ces relations de d&#233;pendance. Ces derni&#232;res constituent un autre crit&#232;re de 
classification. Deux autres features d&#233;finis dans le Tableau 3 sont ajout&#233;s &#224; ceux du Tableau 2. 
</p>
<p>Nom Features Signification 
</p>
<p>Lien-syntaxique-cg 
 
 
 
Lien-syntaxique-fn 
 
</p>
<p>Chemin de Lexie &#224; Mot. Ce chemin est un ensemble de liens syntaxiques 
trouv&#233; par Syntex allant de Lexie jusqu&#8217;&#224; Mot. Il est une combinaison de 
toutes les cat&#233;gories grammaticales des mots qui se retrouvent sur ce 
chemin (ie : Nom, Prep, Adv, etc.).  
Dans ce cas le chemin de liens syntaxiques entre Lexie et Mot est une 
combinaison de toutes les fonctions syntaxiques de ces liens (SUJ, OBJ, etc.) 
Tableau 3 : Features de la classification en se basant sur Syntex 
</p>
<p>Les valeurs possibles du feature Lien-syntaxique-cg d&#233;pendent de certains crit&#232;res : 
</p>
<p>&#8226; Si la cat&#233;gorie grammaticale du mot se trouvant sur le chemin des liens entre la lexie et le mot est 
un verbe, alors nous proposons de prendre pour certains verbes leurs valeurs r&#233;elles. Ce sont les 
verbes qu&#8217;on appelle verbes modaux dont nous devons tenir compte. Nous avons d&#233;fini une liste 
de ces verbes, rencontr&#233;s aussi dans notre corpus (faire, aller, vouloir, pouvoir, permettre, 
demander, devoir, etc.). Ces verbes n&#8217;identifient pas les m&#234;mes participants et ils attribuent des 
statuts diff&#233;rents, soit actant ou circonstant, aux participants. Par exemple, X tente de Lexie, X est 
consid&#233;r&#233; comme actant. Par contre dans X permet &#224; Y de Lexie, X est un circonstant. Dans le 
cas, X demande &#224; Y de Lexie, X n&#8217;est pas un participant. Pour d&#8217;autres verbes une classe des 
verbes CV  est d&#233;finie. 
</p>
<p>&#8226; Si la cat&#233;gorie du mot se trouvant sur le chemin est une pr&#233;position, nous prenons sa valeur et 
non pas sa cat&#233;gorie. La pr&#233;position &#224; et de n&#8217;identifie pas les m&#234;mes participants.  
</p>
<p> 
</p>
<p>5.2 Features de classification sans l&#8217;analyseur Syntex 
</p>
<p>Dans l&#8217;approche pr&#233;c&#233;dente faisant appel &#224; Syntex, nous remarquons que les noms qui sont 
participants de la lexie verbale peuvent &#234;tre directs (ayant un lien syntaxique av&#233;r&#233; dans la phrase) 
ou indirects (apparaissant dans la phrase, mais n&#8217;ayant pas de lien syntaxique avec la lexie verbale). 
Ils peuvent &#234;tre r&#233;gis par une pr&#233;position, une relative ou une coordination. Ils peuvent aussi &#234;tre li&#233;s 
&#224; un autre verbe pr&#233;c&#233;dant la lexie verbale annot&#233;e r&#233;gie par une pr&#233;position. &#201;tant donn&#233;e que, dans 
cette deuxi&#232;me approche, nous n&#8217;utilisons pas les liens de d&#233;pendance syntaxiques, nous proposons 
des features qui permettent de restituer ces informations en testant la nature des mots qui 
apparaissent entre la lexie et le mot candidat. Nous proposons de consid&#233;rer en plus des features du 
Tableau 2, d&#8217;autres features tels que : 1) les cat&#233;gories grammaticales des mots s&#233;parant le mot 
candidat de la lexie, 2) le nombre de verbes entre la lexie et le mot candidat s&#8217;ils existent, 3) la 
valeur du verbe ou sa cat&#233;gorie, 4) la distance, 5) la position, 6) la valeur de la pr&#233;position, du 
pronom relatif et de la coordination s&#8217;ils existent entre la lexie et le mot candidat. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFICATION DES ACTANTS ET CIRCONSTANTS PAR APPRENTISSAGE MACHINE 
</p>
<p>5.3 R&#233;sultats des classificateurs Weka et comparaison des deux cas  
</p>
<p>Nous avons test&#233; plusieurs classificateurs de Weka (un classificateur de chaque classe d&#8217;algorithmes 
pr&#233;sent&#233; par Weka : bayesian, trees, rules, lazy etc.). Dans la Figure 2, nous pr&#233;sentons les 
classificateurs avec un taux de classification &#233;lev&#233;, sup&#233;rieur &#224; 78%. Le tableau de gauche de la 
Figure 2 montre le taux de classification sur les 8376 instances en utilisant l&#8217;analyseur syntaxique 
Syntex compar&#233; &#224; celui sans analyseur syntaxique : c&#8217;est la proportion de participants bien classifi&#233;s 
tant de la classe OUI que de la classe NON. Par exemple, avec Syntex le taux 87 % bien class&#233;s (13 % 
mal class&#233;s) indique que, sur les 3413 de la classe OUI, 541 participants sont mal class&#233;s dans la 
classe NON et, sur les 4963 de la classe NON, 489 participants sont mal class&#233;s dans la classe OUI. 
Ainsi le tableau de droite indique la F-measure de la classe OUI dans les deux cas d&#8217;utilisation (avec 
ou sans les d&#233;pendances fournis par l&#8217;analyseur syntaxique). Ces taux ont &#233;t&#233; calcul&#233;s en comparant 
les r&#233;sultats des classificateurs sur le corpus de test avec les annotations manuelles.  
</p>
<p> 
Taux de biens classifi&#233;s 
</p>
<p> 
Classifier 
</p>
<p>avec 
Syntex 
</p>
<p>sans 
Syntex 
</p>
<p>IB5 87.39 83.56 
RFTree 87.70 84.53 
RTree 81.72 80.70 
BFTree 86.01 82.50                   
</p>
<p>      
F-mesure de la classe OUI 
</p>
<p> 
Classifier
</p>
<p>avec 
Syntex 
</p>
<p>sans 
Syntex 
</p>
<p>IB5 85.2 73.70 
RFTree 84.8 73.00 
RTree 78.6 69.60 
BFTree 82.4 71.00  
</p>
<p>Figure 2 : R&#233;sultats des classificateurs. IB5 : classifieur IBk avec k=5 plus proches voisins  qui utilise la distance 
euclidienne convertie en poids ; RFTree : Random Forest Tree qui consiste en un ensemble d&#8217;arbres de d&#233;cision. Dans 
notre cas, nous avons utilis&#233; un nombre de 10 arbres ; il fait comme la cross validation, il prend un et teste sur les 9 
restant ainsi de suite ; RTree : RandomTree est sous forme d&#8217;une arborescence ; BFTree : Best First Decision Tree. Il 
choisit la racine de l&#8217;arbre et pour les branches, il divise l&#8217;ensemble d&#8217;entrainement en sous ensembles et choisit les 
meilleurs sous ensembles &#224; mettre sous les n&#339;uds. Ce processus est r&#233;p&#233;t&#233; pour tous les n&#339;uds. Ce classificateur a pris 
&#233;norm&#233;ment de temps sur notre corpus que les autres. 
</p>
<p>Les r&#233;sultats de la Figure 2 montrent que la F-mesure de la t&#226;che d&#8217;identification des participants en 
utilisant uniquement les cat&#233;gories grammaticales (sans Syntex), qui se situe autour de 80 %, ne 
propose pas d&#8217;aussi bons r&#233;sultats que celle faisant appel &#224; un analyseur en d&#233;pendance (avec 
Syntex), qui se situe autour de 93 %. Mais un taux de 80 % reste int&#233;ressant, et laisse supposer que 
les features que nous avons propos&#233;s pour cette approche sont prometteurs. Le feature distance que 
nous avons d&#233;fini joue un r&#244;le particuli&#232;rement important dans cette classification. Cette notion de 
distance entre le mot candidat et la lexie permet de d&#233;sambigu&#239;ser des mots candidats qui peuvent 
avoir plus ou moins les m&#234;mes caract&#233;ristiques les s&#233;parant de la lexie.  
</p>
<p>6 Distinction entre actant et circonstant 
Syntex ne permet pas de distinguer les actants des circonstants. Il permet d&#8217;affecter des fonctions 
syntaxiques telles que sujet ou objet qui peuvent &#234;tre le plus souvent des actants. Par contre le 
probl&#232;me se pose pour des mots introduits par des pr&#233;positions. Syntex affecte dans tous les cas la 
fonction NOMPREP (par exemple On ABANDONNE l&#8217;op&#233;ration &#224; ce stade et on ACC&#200;DE &#224; cette 
information). Dans ces deux exemples, Syntex annote stade et information par NOMPREP et aucune 
autre information n&#8217;est ajout&#233;e. Pourtant, stade et information ne sont pas du m&#234;me type : stade est 
consid&#233;r&#233; comme un circonstant de la lexie ABANDONNER et information est consid&#233;r&#233;e comme un 
actant de la lexie ACC&#201;DER. Les participants identifi&#233;s &#224; la section 5 sont soit des noms, des pronoms 
ou des adverbes. Pour attribuer le type actant ou circonstant &#224; ces participants, nous consid&#233;rons : 
</p>
<p>&#8226; Les noms ou les pronoms occupant les fonctions de sujet ou d&#8217;objet direct sont s&#233;lectionn&#233;s ; 
s&#8217;ils ne sont pas r&#233;gis par d&#8217;autres &#233;l&#233;ments dans la phrase, alors on peut les consid&#233;rer comme 
des actants. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADILA HADOUCHE, GUY LAPALME, MARIE-CLAUDE L&#8217;HOMME 
</p>
<p>&#8226; Selon notre corpus annot&#233; manuellement, les adverbes sont g&#233;n&#233;ralement des circonstants.  
&#8226; Les noms r&#233;gis par des verbes modaux, voir section 5.1, sont consid&#233;r&#233;s actants ou circonstants 
</p>
<p>selon le verbe modal employ&#233;. Pour certains verbes comme devoir, pouvoir, vouloir, etc., ces 
noms sont consid&#233;r&#233;s comme des actants. Par contre, pour d&#8217;autres verbes tels que permettre, 
servir, etc. ces noms sont des circonstants. Nous tenons donc compte d&#8217;une liste de verbes 
modaux pour d&#233;cider de la classe de ces noms. 
</p>
<p>&#8226; Les noms r&#233;gis par un pronom relatif qui ou que sont des actants &#224; condition que ces pronoms 
relatifs ne soient pas r&#233;gis par des pr&#233;positions ou des verbes modaux. 
</p>
<p>&#8226; Les noms r&#233;gis par les pr&#233;positions (introduisant un compl&#233;ment du verbe) peuvent &#234;tre des 
actants pour certaines lexies verbales, et des circonstants pour d&#8217;autres. Nous entendons par l&#224; 
que ces noms ne d&#233;pendent pas uniquement de leur position syntaxique mais qu&#8217;ils d&#233;pendent 
aussi de la lexie verbale. Dans ces cas, l&#8217;annotation exige l&#8217;acc&#232;s &#224; plus d&#8217;informations sur la 
lexie verbale. Puisqu&#8217;on n&#8217;utilise pas un dictionnaire nous informant des sch&#233;mas de sous-
cat&#233;gorisation de cette lexie verbale, nous proposons de calculer la fr&#233;quence relative de ces 
noms, r&#233;gis par une pr&#233;position, avec la lexie &#224; partir de notre connaissance des contextes dans 
lesquels est employ&#233;e cette lexie. 
</p>
<p>6.1 Calcul de la fr&#233;quence relative 
</p>
<p>La notion de la fr&#233;quence relative est utilis&#233;e par Messiant [17] dans la r&#233;alisation du lexique 
&#171; LexSchem &#187; pr&#233;sentant la sous-cat&#233;gorisation des verbes fran&#231;ais. Dans notre cas, La fr&#233;quence 
relative constitue le rapport entre le nombre de contextes o&#249; est apparue la lexie verbale avec les 
noms r&#233;gis par une pr&#233;position et le nombre total de contextes o&#249; la lexie est apparue. Nous faisons 
l&#8217;hypoth&#232;se que cette fr&#233;quence traduira l&#8217;importance du participant et son r&#244;le quant au s&#233;mantisme 
de la lexie verbale. Cette fr&#233;quence relative est donn&#233;e par la formule suivante 
</p>
<p>)(#
),(#
</p>
<p>lexie
featureLexierelativefrequence =&#8722; 10 
</p>
<p>Si cette fr&#233;quence est &#233;lev&#233;e, elle peut indiquer que la relation s&#233;mantique entre la lexie verbale et ce 
participant est tr&#232;s &#233;troite, et donc que ce participant est vraisemblablement un actant. Mais si elle est 
faible, elle indique que la relation s&#233;mantique n&#8217;est pas &#233;troite, donc ce participant est peut &#234;tre un 
circonstant. Dans cette t&#226;che aussi, nous avons test&#233; les classificateurs Weka. Dans ce cas, nous 
avons ajout&#233; le feature -fr&#233;quence relative- aux features d&#233;finis dans les sections pr&#233;c&#233;dentes.  
</p>
<p>6.2 Les r&#233;sultats de la classification en actant et en circonstant 
</p>
<p>La classification en actant et circonstant fonctionne mieux lorsque nous faisons appel &#224;  Syntex 
comme le montrent les r&#233;sultats de la Figure 3 : une F-mesure de 96 % pour les actants et de 83 % 
pour les circonstants. Dans le cas o&#249; Syntex n&#8217;est pas utilis&#233;, la classe actant est classifi&#233;e avec une 
F-mesure pour le meilleur classificateur de 94 %, ce qui est acceptable. Nous avons remarqu&#233;, que 
dans le corpus d&#8217;entra&#238;nement, les circonstants n&#8217;&#233;taient pas nombreux repr&#233;sentant environ 1/3 des 
participants actants. La F-mesure de la classe des circonstants est autour de 79 % pour le meilleur 
classificateur. Le calcul de la fr&#233;quence relative pour distinguer les actants des circonstants donne de 
bons r&#233;sultats. La diff&#233;rence de performance avec ou sans Syntex est due au fait que Syntex fournit 
la fonction grammaticale sujet et objet du participant.  
</p>
<p>                                                 
10   feature repr&#233;sente les noms r&#233;gis par une pr&#233;position. Par exemple &#224; une variable, son feature est &#171; pr&#233;position, nom &#187; 
</p>
<p>qui  correspond &#224; &#171; &#224;, variable &#187;.  #(lexie,feature) est le nombre de fois que la lexie et ce feature sont apparus 
ensemble et #(lexie) est le nombre total de fois que la lexie est apparue (avec ou sans ce feature). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFICATION DES ACTANTS ET CIRCONSTANTS PAR APPRENTISSAGE MACHINE 
 
</p>
<p>Taux de biens classifi&#233;s 
 
Classifier 
</p>
<p>avec 
Syntex 
</p>
<p>sans 
Syntex 
</p>
<p>IB5 92.99 88.17 
RFTree 93.55 91.38 
RTree 89.48 87.24 
BFTree 91.97 89.80  
</p>
<p> 
F-mesure de la classe ACT 
 
Classifier
</p>
<p>avec 
Syntex
</p>
<p>sans 
Syntex 
</p>
<p>IB5 95.60 92.60 
RFTree 96.00 94.60 
RTree 93.50 91.90 
BFTree 95.00 93.50  
</p>
<p> 
F-mesure de la classe CIRC 
</p>
<p> 
Classifier 
</p>
<p>avec 
Syntex 
</p>
<p>sans 
Syntex 
</p>
<p>IB5 82.20 70.90 
RFTree 83.00 79.00 
RTree 71.70 69.80 
BFTree 79.00 76.10  
</p>
<p>Figure 3 : Tableaux de r&#233;sultats des classificateurs sur la classe actant et la classe circonstant. &#192; gauche, nous avons le 
taux des biens classifi&#233;s de la classe actant ou de la classe circonstant. Ces classificateurs sont les m&#234;mes que ceux 
utilis&#233;s &#224; la Figure 2 
</p>
<p>Les r&#233;sultats de l&#8217;identification des participants qui sont pour le meilleur classificateur de 87 % et de 
84 % selon qu&#8217;on utilise Syntex ou non sont analogues &#224; ceux obtenus dans les diff&#233;rents travaux sur 
l&#8217;anglais qui varient entre 80 % et 90 % utilisant une approche similaire de features sur le Penn 
Treebank, plus riche et plus grand en taille. Quant &#224; la t&#226;che de distinction entre actant et circonstant, 
une t&#226;che propre &#224; notre objectif, les r&#233;sultats sont satisfaisants. Ils sont semblables aux 76 % trouv&#233;s 
par Fabre [4] qui utilise une autre approche sur le fran&#231;ais pour distinguer les arguments des adjoints 
pour un autre objectif que le n&#244;tre. 
</p>
<p>Conclusion 
Nous avons pr&#233;sent&#233; une approche d&#8217;identification de participants, actant et circonstant, en langue 
fran&#231;aise, afin de pouvoir par la suite annoter ces actants par des r&#244;les s&#233;mantiques. Cette t&#226;che 
facilitera la distinction entre les participants obligatoires et optionnels quant &#224; leur annotation par des 
r&#244;les s&#233;mantiques. Cette approche d&#8217;utilisation de features, une premi&#232;re pour le fran&#231;ais dans ce 
contexte, est inspir&#233;e de celle r&#233;alis&#233;e en anglais dans le cadre de FrameNet pour l&#8217;annotation de 
r&#244;les s&#233;mantiques. Nos r&#233;sultats montrent que les features que nous avons propos&#233;s sont appropri&#233;s &#224; 
la t&#226;che d&#8217;identification et de distinction d&#8217;actants et circonstants. On peut tirer avantage d&#8217;un 
analyseur syntaxique automatique tel que Syntex, dont les r&#233;sultats sont meilleurs sur les 78 % unit&#233;s 
lexicales qu&#8217;il d&#233;tecte pouvant avoir une relation avec la lexie verbale. Mais dans les 22 % d&#8217;unit&#233;s 
qui restent et que Syntex ne d&#233;tecte aucune relation entre eux et la lexie, l&#8217;approche sans Syntex 
vient y rem&#233;dier. Avec cette derni&#232;re, plusieurs participants non d&#233;tect&#233;s par Syntex sont bien 
rep&#233;r&#233;s.  
</p>
<p>Nous avons rencontr&#233; certaines difficult&#233;s dans le cas de participants propositionnels comme dans si 
vous essayez d'installer une application qui affiche ce type d'alerte, ABANDONNEZ l'installation. Toute 
la proposition &#171; si vous essayez d'installer une application qui affiche ce type d'alerte &#187; est prise 
comme un participant circonstant de la lexie verbale ABANDONNER. Avec notre syst&#232;me, nous 
n'identifions qu&#8217;une seule unit&#233; de toute la proposition, par exemple si, car le vecteur de feature que 
nous avons d&#233;fini ne correspond qu'&#224; une seule unit&#233;. Dans ce cas, nous avons propos&#233; de soumettre 
le verbe de la proposition en question &#224; notre syst&#232;me pour en identifier les participants. Nous 
g&#233;n&#233;rons la proposition en nous basant sur le verbe et ses participants. Quant aux participants qui se 
r&#233;alisent sous forme de mots compos&#233;s de la forme NN (nom suivi d&#8217;un nom) ou de NA (nom suivi 
d&#8217;un adjectif), nous proposons de v&#233;rifier que si ces compos&#233;s sont en une seule entr&#233;e dans 
DicoInfo11 alors nous pourrons les consid&#233;rer comme une entit&#233;.  
</p>
<p>                                                 
11 Dictionnaire de l&#8217;Informatique et de l&#8217;Internet, base de notre corpus http://olst.ling.umontreal.ca/cgi-
</p>
<p>bin/dicoinfo/search.cgi </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADILA HADOUCHE, GUY LAPALME, MARIE-CLAUDE L&#8217;HOMME 
L&#8217;identification et la distinction entre actants et circonstants ont &#233;t&#233; test&#233;es sur des lexies verbales 
annot&#233;es manuellement. Nous avons &#233;galement annot&#233; de nouvelles lexies verbales et leur validation 
manuelle est en cours.  
</p>
<p>R&#233;f&#233;rences  
1. MEL'&#268;UK I. (2004) Actants in Semantic and Syntax, in Actants in Semantics. Linguistics 
</p>
<p>42(2).  p. 1-66. 
2. LACHERET-DUJOUR A., FRAN&#199;OIS J. (2004) Circonstance et pr&#233;dication verbale en fran&#231;ais 
</p>
<p>parl&#233; : contraintes s&#233;mantico-pragmatiques et filtrage prosodique, Syntaxe &amp; s&#233;mantique  
2004. 6: p. 35-56 
</p>
<p>3. V&#193;ZQUEZ G., MONTRAVETA A.F. (2008) Annotation de corpus : Sur la d&#233;limitation des 
arguments et des adjoints. SKY Journal of Linguistics 2008. 21: p. 243-269. 
</p>
<p>4. FABRE C., FR&#201;ROT C. (2002) Groupes pr&#233;positionnels arguments ou circonstants : vers un 
rep&#233;rage automatique en corpus, in TALN. 2002: Nancy. 
</p>
<p>5. GILDEA D., JURAFSKY D., (2002) Automatic labeling of semantic roles. Computational 
Linguistics,  
</p>
<p>6. JOHANSON R., NUGUES P. (2005) Sparse Bayesian Classification of Predicate Arguments. In 
Procs of CoNLL-2005. Ann Arbor, Michigan. 
</p>
<p>7. SURDEANU M., HARABAGIU S.,WILLIAMS J., AARSETH P. (2003) Using predicate-argument 
structures for information extraction. Langage Computer Corp. USA. 
</p>
<p>8. LI L., FAN S., WANG X., WANG XI. (2008) Discriminative Learning of Syntactic and Semantic 
Dependencies, In Procs of CoNLL-2008. p. 218-222. 
</p>
<p>9. CHE W., LI Z., LI Y., GUO Y., QIN B., LIU T. (2009) Multilingual Dependency-based Syntactic 
and Semantic Parsing, In Proceedings of CoNLL-2009: Boulder, Colorado. p. 49-54. 
</p>
<p>10. T&#196;CKSTR&#214;M O. (2009) Multilingual semantic parsing with a pipeline of linear classifiers In 
Proceeding of CoNLL-2009: Boulder, Colorado. p. 103-108. 
</p>
<p>11. LIAKATA M., PULMAN S. (2003) Using Predicate-Argument Structures for Information 
Extraction, In Proceedings of ACL-2003. p. 8-15. 
</p>
<p>12. NASR A., B&#201;CHET F. (2009) Analyse syntaxique en d&#233;pendances de l&#8217;oral spontan&#233; in TALN-
2009, Senlis. 
</p>
<p>13. BOURIGAULT D., FABRE C. (2005) L'analyseur syntaxique de corpus Syntex. 
14. HADOUCHE F., L'HOMME M-C., LAPALME G. (2009) Automatic annotation of actants, 
</p>
<p>eLexicography in the 21st century 2009, Universit&#233; catholique de Louvain, Belgique. 
15. HADOUCHE F., L'HOMME M-C., LAPALME G., LE SERREC A. (2009) Int&#233;gration d'informations 
</p>
<p>syntaxico-s&#233;mantiques dans les bases de donn&#233;es terminologiques: m&#233;thodologie 
d'annotation et perspectives d'automatisation, TLS'09 : Workshop international sur la 
Terminologie s&#233;mantique lexicale, Montr&#233;al, Qu&#233;bec 
</p>
<p>16. TESNI&#200;RE L. &#201;l&#233;ments de syntaxe structurale 1966, Paris, Klincksieck. 
17. MESSIANT C., KORHONEN A., POIBEAU T. (2008) LexSchem: A Large Subcategorization 
</p>
<p>Lexicon for French Verbs, in LREC Proceedings, Marrakech, Maroc. </p>

</div></div>
</body></html>