<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>L&#8217;antonymie observ&#233;e avec des m&#233;thodes de TAL : une relation &#224; la fois syntagmatique et paradigmatique ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>L&#8217;antonymie observ&#233;e avec des m&#233;thodes de TAL : une relation &#224; la
fois syntagmatique et paradigmatique ?
</p>
<p>Fran&#231;ois Morlane-Hond&#232;re C&#233;cile Fabre
CLLE-ERSS, Universit&#233; de Toulouse
</p>
<p>francois.morlane@univ-tlse2.fr, cecile.fabre@univ-tlse2.fr
</p>
<p>R&#233;sum&#233;. Cette &#233;tude utilise des outils de TAL pour tester l&#8217;hypoth&#232;se avanc&#233;e par plusieurs &#233;tudes
linguistiques r&#233;centes selon laquelle la relation antonymique, classiquement d&#233;crite comme une relation
paradigmatique, a la particularit&#233; de fonctionner &#233;galement sur le plan syntagmatique, c&#8217;est-&#224;-dire de
r&#233;unir des mots qui sont non seulement substituables mais qui apparaissent &#233;galement r&#233;guli&#232;rement dans
des relations contextuelles. Nous utilisons deux m&#233;thodes &#8211; l&#8217;analyse distributionnelle pour le plan para-
digmatique, la recherche par patrons antonymiques pour le plan syntagmatique. Les r&#233;sultats montrent que
le diagnostic d&#8217;antonymie n&#8217;est pas significativement meilleur lorsqu&#8217;on croise les deux m&#233;thodes, puis-
qu&#8217;une partie des antonymes identifi&#233;s ne r&#233;pondent pas au test de substituabilit&#233;, ce qui semble confirmer
la pr&#233;pond&#233;rance du plan syntagmatique pour l&#8217;&#233;tude et l&#8217;acquisition de cette relation.
</p>
<p>Abstract. In this paper, we use NLP methods to test the hypothesis, suggested by several linguistic
studies, that antonymy is not only a paradigmatic but also a syntagmatic relation : antonym pairs, that have
been classically described by their ability to be substituted for each other, also tend to frequently co-occur
in texts. We use two methods &#8211; distributional analysis on the paradigmatic level, lexico-syntactic pattern
recognition on the syntagmatic level. Results show that antonym detection is not significantly improved
by combining the two methods : a set of antonyms do not satisfy the test for substitutability, which tends
to confirm the predominance of the syntagmatic level for studying and identifying antonymy.
</p>
<p>Mots-cl&#233;s : s&#233;mantique lexicale, antonymie, analyse distributionnelle, patrons lexico-syntaxiques.
</p>
<p>Keywords: lexical semantics, antonymy, distributional analysis, lexico-grammatical patterns.
</p>
<p>1 Introduction
</p>
<p>Nous nous int&#233;ressons &#224; la relation d&#8217;antonymie et &#224; son rep&#233;rage automatique dans les textes, sur la
base de travaux r&#233;cents qui renouvellent les descriptions de cette relation lexicale. Les travaux de (Jones
&amp; Murphy, 2005), (Murphy, 2006), (Murphy et al., 2009) se sont en effet int&#233;ress&#233;s &#224; la fa&#231;on dont les
antonymes cooccurrent dans les textes, s&#8217;appuyant sur les observations ant&#233;rieures de (Charles &amp; Miller,
1989), (Justeson &amp; Katz, 1991) et (Fellbaum, 1995), selon lesquelles les antonymes ont la particularit&#233;
d&#8217;appara&#238;tre fr&#233;quemment ensemble &#8211; et m&#234;me de marquer une opposition d&#8217;autant plus forte qu&#8217;ils cooc-
current significativement. L&#8217;ensemble de ces auteurs d&#233;finissent ainsi l&#8217;antonymie comme une relation &#224; la
fois paradigmatique et syntagmatique. Paradigmatique, bien s&#251;r, parce que deux antonymes s&#8217;opposent &#224;
l&#8217;int&#233;rieur d&#8217;un champ s&#233;mantique d&#233;termin&#233; et se conforment donc au principe de substituabilit&#233;. Syntag-
matique aussi parce que deux mots consid&#233;r&#233;s comme antonymes tendent &#224; appara&#238;tre ensemble dans des
relations aussi bien inter qu&#8217;intrapropositionnelles et plus particuli&#232;rement dans des constructions contras-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FRAN&#199;OIS MORLANE-HOND&#200;RE, C&#201;CILE FABRE
</p>
<p>tives &#233;tudi&#233;es par (Jones, 2002). Cette capacit&#233; des couples antonymiques &#224; fonctionner simultan&#233;ment sur
ces deux plans est remarquable et, selon Murphy, ne serait pas partag&#233;e par les autres relations lexicales
(synonymie, hyperonymie, co-hyponymie), pour lesquelles le plan paradigmatique pr&#233;vaut.
</p>
<p>Dans une exp&#233;rience tr&#232;s r&#233;cente, (Lobanova et al., 2010) ont confirm&#233; l&#8217;int&#233;r&#234;t d&#8217;explorer cette dimen-
sion syntagmatique en montrant la possibilit&#233; d&#8217;acqu&#233;rir des couples d&#8217;antonymes &#224; partir d&#8217;une approche
&#224; base de patrons, sur le mod&#232;le de Hearst. Ce faisant, les auteurs signalent &#233;galement les limites de cette
approche : les patrons utilis&#233;s, pour &#234;tre suffisamment pr&#233;cis, doivent &#234;tre tr&#232;s sp&#233;cifiques, ce qui limite
le rappel. Et malgr&#233; cela, le taux de pr&#233;cision reste relativement r&#233;duit (entre 16% et 27% des paires de
mots extraites sont jug&#233;es v&#233;ritablement antonymiques). Notre objectif est donc de voir comment ce type
de m&#233;thode peut se combiner avec une approche qui vise &#224; v&#233;rifier l&#8217;appartenance du couple &#224; un m&#234;me
paradigme distributionnel. Nous combinons l&#8217;approche par patrons, qui permet de d&#233;tecter les cas de co-
pr&#233;sence des antonymes, et l&#8217;approche distributionnelle, qui teste leur tendance &#224; la substituabilit&#233;. Notre
hypoth&#232;se est que la combinaison des deux m&#233;thodes devrait fournir la configuration optimale pour ac-
qu&#233;rir des couples d&#8217;antonymes. Ces deux m&#233;thodes de TAL offrent ainsi des moyens d&#8217;observer &#224; grande
&#233;chelle le comportement des couples antonymiques du point de vue paradigmatique et syntagmatique.
</p>
<p>Dans la section suivante, nous pr&#233;sentons d&#8217;abord les deux m&#233;thodes de rep&#233;rage des couples &#8211; par projec-
tion de patrons (2.1) puis par analyse distributionnelle automatique (2.2). Nous pr&#233;sentons ensuite l&#8217;&#233;va-
luation de la m&#233;thode, qui combine une comparaison avec une ressource lexicale (3.1) et le recours &#224; des
jugements de locuteurs (3.2). Nous analysons enfin (3.3) les r&#233;sultats obtenus, qui montrent que le crit&#232;re
de la similarit&#233; distributionnelle ne semble pas am&#233;liorer le taux de d&#233;tection de la relation d&#8217;antonymie
obtenu par la technique par patrons, sugg&#233;rant une pr&#233;dominance du fonctionnement syntagmatique pour
une partie des couples.
</p>
<p>2 Combiner deux modes de rep&#233;rage de l&#8217;antonymie
</p>
<p>Cette exp&#233;rience est men&#233;e sur l&#8217;antonymie adjectivale, &#224; partir d&#8217;un grand corpus d&#8217;articles encyclop&#233;-
diques en fran&#231;ais1 tir&#233;s de Wikip&#233;dia.
</p>
<p>2.1 Plan syntagmatique : paires d&#8217;adjectifs li&#233;s par des patrons antonymiques
</p>
<p>Nous avons s&#233;lectionn&#233; un ensemble de constructions antonymiques, d&#233;crites sous la forme de patrons
lexico-syntaxiques2, en nous appuyant sur des travaux ant&#233;rieurs, en particulier (Jones, 2002). Notre ap-
proche consiste &#224; projeter automatiquement ces patrons sur l&#8217;ensemble du corpus Wikipedia, et &#224; extraire
les couples qui occupent les positions X et Y (cf. tableau 1). Ainsi traduites en patrons de surface, ces
constructions ram&#232;nent une certaine quantit&#233; de bruit, en particulier le patron X ou Y, X et Y pouvant
&#233;galement entretenir une relation d&#8217;&#233;quivalence. Du fait de la pr&#233;dominance de ce patron ambigu X ou Y
&#8211; quasiment 74% des couples rapport&#233;s le sont dans cette structure &#8211; et de la bonne pr&#233;cision des relations
minoritaires, nous avons d&#233;cid&#233; de nous limiter &#224; un sous-ensemble de couples : ceux qui sont reli&#233;s par au
moins deux patrons de type distinct, soit 907 couples diff&#233;rents (sur les 13 295 couples adjectivaux extraits
</p>
<p>1Le corpus constitu&#233; de l&#8217;ensemble des articles de la version francophone de Wikipedia (avril 2007), soit plus de 470 000
articles pour 194 millions de mots. Son traitement ainsi que la cr&#233;ation de la base de voisins sont dus au travail de Franck Sajous
(CLLE-ERSS).
</p>
<p>2Nous avons impos&#233; un certain nombre de contraintes aux patrons &#8211; en termes de distance, ou en nous appuyant sur des
informations morpho-syntaxiques disponibles dans le corpus annot&#233;, que nous ne d&#233;taillons pas ici.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;ANTONYMIE OBSERV&#201;E AVEC DES M&#201;THODES DE TAL
</p>
<p>au total).
</p>
<p>Malgr&#233; la rigueur du filtrage que nous avons impos&#233;, toutes les paires de mots qui apparaissent dans deux
patrons diff&#233;rents ne peuvent pas &#234;tre consid&#233;r&#233;es comme des paires d&#8217;antonymes. Tout d&#8217;abord, la m&#233;-
thode produit des erreurs dues &#224; l&#8217;analyse syntaxique : le syst&#232;me extrait la paire ancien/international &#224;
partir du segment Le recrutement de nombreux internationaux ou anciens internationaux reconnus, dans
lequel international est analys&#233; comme un adjectif. On peut &#233;galement &#233;voquer le cas des locutions ad-
jectivales comme bon march&#233;, qui ne sont pas trait&#233;es comme telles par Syntex. Par ailleurs, comme l&#8217;ont
montr&#233; (Jones, 2002) et (Lobanova et al., 2010), les patrons peuvent rep&#233;rer des oppositions ponctuelles,
non lexicalis&#233;es, entre deux mots. Dans l&#8217;exemple ci-dessous, l&#8217;opposition entre les deux adjectifs admi-
nistratif et humain est induite discursivement par la construction contrastive :
</p>
<p>Le terme, n&#233;anmoins, refl&#232;te des connotations plus humaines qu&#8217;administratives.
</p>
<p>On conna&#238;t de fait la capacit&#233; du discours d&#8217;instaurer des relations non lexicalis&#233;es (Hoey, 1991). Nous
introduisons donc avec la m&#233;thode distributionnelle une contrainte suppl&#233;mentaire, qui vise &#224; s&#8217;assurer de
la proximit&#233; s&#233;mantique entre les deux adjectifs.
</p>
<p>PATRON EXEMPLE
X ou Y Cette connexion peut &#234;tre temporaire ou d&#233;finitive.
</p>
<p>&#224; la fois X et Y Sa production est &#224; la fois fermi&#232;re et industrielle.
entre X et Y les diff&#233;rences entre les vins blancs et les vins rouges
</p>
<p>plus/plut&#244;t/moins/autant/aussi (bien) X que Y Il se d&#233;guste aussi bien chaud que froid.
X plut&#244;t que Y Il d&#233;crit une Terre sph&#233;rique plut&#244;t que plate.
</p>
<p>soit X soit Y Les coups francs sont soit directs soit indirects.
ni X ni Y Il n&#8217;est donc ni explicite ni implicite.
</p>
<p>TAB. 1 &#8211; Patrons retenus pour la projection sur corpus.
</p>
<p>2.2 Plan paradigmatique : paires d&#8217;adjectifs voisins sur le plan distributionnel
</p>
<p>Nous utilisons une base de voisins distributionnels g&#233;n&#233;r&#233;e par le programme d&#233;velopp&#233; par (Bourigault,
2002), en aval de l&#8217;analyseur Syntex (Bourigault, 2007), &#224; partir du corpus Wikip&#233;dia. L&#8217;analyse distri-
butionnelle automatique consiste &#224; rapprocher les mots qui partagent les m&#234;mes contextes syntaxiques,
conform&#233;ment &#224; l&#8217;hypoth&#232;se selon laquelle la proximit&#233; distributionnelle est un bon indice de proximit&#233;
s&#233;mantique (voir en particulier (Baroni &amp; Lenci, 2009) pour une pr&#233;sentation r&#233;cente des principes de
l&#8217;analyse distributionnelle automatique). Le processus d&#8217;extraction des voisins distributionnels prend en
entr&#233;e les triplets &lt;gouverneur, relation, d&#233;pendant&gt; qui sont g&#233;n&#233;r&#233;s par Syntex (par exemple &lt;voiture,
ADJ, rapide&gt;). Ces triplets fournissent les donn&#233;es &#224; partir desquelles sont rapproch&#233;s les couples de mots,
en utilisant la mesure de similarit&#233; de Lin, qui permet d&#8217;ordonner les 4 millions de couples g&#233;n&#233;r&#233;s. Il a
&#233;t&#233; montr&#233;, notamment par (Geffet &amp; Dagan, 2005), que les paires de mots constitu&#233;es &#224; l&#8217;aide de cette
m&#233;thode entretiennent des relations s&#233;mantiques de nature tr&#232;s diverse. Les relations lexicales (synonymie,
hyperonymie, antonymie) se m&#234;lent &#224; des relations de nature associative au sens large.
</p>
<p>&#192; ce stade, nous disposons donc de deux m&#233;thodes qui d&#233;tectent l&#8217;une et l&#8217;autre des relations antonymiques
mais sont toutes les deux, bien qu&#8217;&#224; des degr&#233;s divers, bruit&#233;es. L&#8217;&#233;valuation qui suit cherche &#224; mesurer
leur compl&#233;mentarit&#233;, et plus particuli&#232;rement &#224; d&#233;terminer si les couples rep&#233;r&#233;s conjointement par les
deux m&#233;thodes pr&#233;sentent un degr&#233; d&#8217;antonymie plus marqu&#233;. Sur les 907 couples retenus par la technique</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FRAN&#199;OIS MORLANE-HOND&#200;RE, C&#201;CILE FABRE
</p>
<p>des patrons, 612 sont &#233;galement des voisins (environ 67%). L&#8217;hypoth&#232;se est que le fait que deux adjectifs
soient proches distributionnellement permettrait de filtrer les cas de contrastes occasionnels produits en
discours.
</p>
<p>3 &#201;valuation des r&#233;sultats
</p>
<p>Nous proposons deux m&#233;thodes compl&#233;mentaires pour juger du caract&#232;re antonymique des paires d&#8217;ad-
jectifs extraites : la premi&#232;re passe par l&#8217;utilisation d&#8217;une ressource de r&#233;f&#233;rence, la deuxi&#232;me consiste &#224;
solliciter des locuteurs en leur demandant d&#8217;identifier la relation s&#233;mantique entre les paires d&#8217;adjectifs.
</p>
<p>3.1 Comparaison &#224; une ressource de r&#233;f&#233;rence
</p>
<p>Nous utilisons le dictionnaire d&#8217;antonymes et de synonymes du CRISCO, Dicosyn, disponible en ligne3.
Nous montrons dans le tableau 2 la r&#233;partition des 907 paires d&#8217;adjectifs en trois cat&#233;gories selon qu&#8217;ils
sont recens&#233;s comme antonymes, comme synonymes, ou absents du dictionnaire. Le taux d&#8217;antonymes
d&#233;tect&#233; est plus &#233;lev&#233; 4 lorsque les deux adjectifs sont d&#233;tect&#233;s conjointement par les deux techniques.
N&#233;anmoins, le calcul du chi2 montre que cette diff&#233;rence n&#8217;est pas significative5. En d&#8217;autres termes, la
propension des adjectifs &#224; la substituabilit&#233; n&#8217;est pas une propri&#233;t&#233; d&#233;cisive pour cat&#233;goriser les paires
comme antonymes.
</p>
<p>Antonyme Synonyme Absent
Voisins 32% 4% 64% 100%
</p>
<p>Non-voisins 27% 6% 67% 100%
</p>
<p>TAB. 2 &#8211; Proportion des voisins et non voisins pr&#233;sents ou absents du dictionnaire.
</p>
<p>3.2 Questionnaires
</p>
<p>Nous avons extrait al&#233;atoirement trois jeux de 100 paires dans notre ensemble de d&#233;part. La seule contrainte
a port&#233; sur le fait que chacun de ces jeux devait &#234;tre compos&#233; pour moiti&#233; de couples apparaissant parmi
les voisins. Afin de fournir des &#233;l&#233;ments contextuels aux sujets (pour la plupart &#233;tudiants en linguistique),
chaque paire &#233;tait accompagn&#233;e d&#8217;une s&#233;rie de noms modifi&#233;s par les adjectifs en question s&#233;lectionn&#233;s
al&#233;atoirement dans le corpus (ex. : formation, &#233;tudes, licence pour la paire g&#233;n&#233;ral/professionnel). Chaque
jeu de donn&#233;es a &#233;t&#233; soumis &#224; deux sujets diff&#233;rents qui avaient pour consigne de classer chaque paire
selon les relations s&#233;mantiques propos&#233;es, &#224; savoir : opposition forte, opposition faible, synonymie, autre
relation, pas de relation, ne sais pas. Le fait de diviser la relation d&#8217;opposition en deux (opposition forte
et faible) vise &#224; tenir compte de la distinction faite en linguistique cognitive entre des antonymes dits ca-
noniques ou directs &#8211; associations binaires et conventionnelles (gai/triste) &#8211; et des paires de mots ayant
des sens oppos&#233;s, mais ne pr&#233;sentant pas ce caract&#232;re conventionnel (gai/d&#233;prim&#233;) (Murphy, 2006).
</p>
<p>Le recours &#224; deux sujets par jeu de donn&#233;es nous a permis d&#8217;&#233;valuer le taux d&#8217;accord. Sur les trois jeux,
le kappa moyen pour la relation d&#8217;opposition forte est de 0.64 alors qu&#8217;il est de 0.27 pour l&#8217;opposition
</p>
<p>3http ://www.crisco.unicaen.fr/cgi-bin/cherches.cgi
4Nos r&#233;sultats sont nettement meilleurs que ceux de (Lobanova et al., 2010), qui ne retrouvent dans leurs r&#233;sultats que 1% &#224;
</p>
<p>3% d&#8217;antonymes recens&#233;s dans les ressources lexicales qu&#8217;ils utilisent pour le n&#233;erlandais. Mais cela s&#8217;explique avant tout par
le fait que nous disposons, avec Dicosyn, d&#8217;une ressource bien plus compl&#232;te.
</p>
<p>5chi2 = 2.24 ; ddl = 1 ; p &lt; 0.05</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L&#8217;ANTONYMIE OBSERV&#201;E AVEC DES M&#201;THODES DE TAL
</p>
<p>faible. Par cons&#233;quent, nous ne retenons que les r&#233;sultats obtenus pour le jugement d&#8217;opposition forte.
Le tableau 3 rapporte, pour chaque jeu, la proportion des paires sur lesquelles les deux sujets ont tous
les deux indiqu&#233; une opposition forte. Les r&#233;sultats montrent qu&#8217;il n&#8217;y a pas de diff&#233;rence significative
de jugement chez les locuteurs, ce qui corrobore le constat que nous avons fait lors de l&#8217;utilisation du
dictionnaire d&#8217;antonymes : le fait que deux adjectifs trouv&#233;s dans des patrons antonymiques soient des
voisins distributionnels ne semble pas influer sur leurs chances de porter une relation d&#8217;antonymie.
</p>
<p>Jeu 1 Jeu 2 Jeu 3
Patrons seuls Patrons + voisins Patrons seuls Patrons + voisins Patrons seuls Patrons + voisins
</p>
<p>12 % 11 % 16 % 16 % 14 % 16 %
</p>
<p>TAB. 3 &#8211; R&#233;sultats obtenus pour la cat&#233;gorie opposition forte apr&#232;s d&#233;pouillement des questionnaires.
</p>
<p>3.3 Analyse des r&#233;sultats
</p>
<p>Les r&#233;sultats obtenus semblent contre-intuitifs : ils indiquent que le crit&#232;re de substituabilit&#233; ne renforce
pas, comme on aurait pu s&#8217;y attendre, la stabilit&#233; du contraste observ&#233; par le biais des patrons lexico-
syntaxiques. Nous pouvons &#224; ce stade proposer plusieurs &#233;l&#233;ments d&#8217;explication &#224; ce constat.
</p>
<p>Tout d&#8217;abord, une partie des paires d&#8217;adjectifs ne sont pas d&#233;tect&#233;s par l&#8217;analyse distributionnelle parce
qu&#8217;il s&#8217;agit de mots rares dans le corpus, qui ne passent pas le seuil de similarit&#233;6 que nous avons im-
pos&#233; aux paires de voisins extraites. C&#8217;est ainsi le cas de paires comme dio&#239;que/mono&#239;que (resp. 50 et 62
occurrences dans le corpus). Cette remarque vaut &#233;galement pour les couples dont l&#8217;un des membres a
une fr&#233;quence trop faible pour que le score de la paire ne d&#233;passe ce seuil. Ce constat signale une limite
&#233;vidente de l&#8217;analyse distributionnelle : l&#8217;exp&#233;rience ne peut &#234;tre concluante que pour les mots ayant une
fr&#233;quence importante dans le corpus.
</p>
<p>Deux autres constats int&#233;ressent par contre directement l&#8217;&#233;tude de l&#8217;antonymie. Deux antonymes peuvent
s&#8217;opposer lorsqu&#8217;ils qualifient un ensemble tr&#232;s limit&#233; de noms. C&#8217;est notamment le cas de annuel et
vivace, qui ne s&#8217;opposent que lorsqu&#8217;ils portent sur les noms plante ou esp&#232;ce, ou de ras et long, qui
modifient poil. Ils partagent d&#232;s lors tr&#232;s peu de contextes et ne sont pas consid&#233;r&#233;s comme des voisins
distributionnels. Un dernier cas de figure nous place au c&#339;ur de l&#8217;hypoth&#232;se de Murphy, Jones et leurs
coll&#232;gues, &#224; savoir le comportement syntagmatique de la relation d&#8217;antonymie : en effet, le fait que cer-
taines paires d&#8217;antonymes ne soient pas rep&#233;r&#233;es par l&#8217;analyse distributionnelle permet de d&#233;gager un
sous-ensemble de couples qui privil&#233;gient la relation de cooccurrence &#224; la relation de substituabilit&#233;. On
a alors affaire &#224; des couples qui fonctionnent sur un mode quasi locutionnel. C&#8217;est en particulier le cas de
paires comme coupable/innocent, pur/impur, officiel/officieux. Si la combinaison des deux m&#233;thodes ne
permet pas de d&#233;tecter plus efficacement les antonymes, cette m&#233;thode fournit des &#233;l&#233;ments d&#8217;observation
qui permettent d&#8217;affiner la description de la relation d&#8217;antonymie, en distinguant des paires pour lesquelles
le double plan paradigmatique et syntagmatique fonctionne &#224; plein, et d&#8217;autres pour lesquelles c&#8217;est le plan
syntagmatique qui prime.
</p>
<p>4 Conclusion
</p>
<p>Notre objectif &#233;tait d&#8217;apporter de nouveaux &#233;l&#233;ments d&#8217;exp&#233;rimentation issus de techniques de TAL pour
tester l&#8217;hypoth&#232;se d&#8217;un double fonctionnement paradigmatique et syntagmatique de l&#8217;antonymie, formu-
</p>
<p>6Score de Lin &lt; 0.1</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FRAN&#199;OIS MORLANE-HOND&#200;RE, C&#201;CILE FABRE
</p>
<p>l&#233;e par une s&#233;rie de travaux r&#233;cents en linguistique cognitive et linguistique de corpus. Les r&#233;sultats que
nous avons obtenus semblent en effet corroborer cette hypoth&#232;se, en montrant que des paires de mots trou-
v&#233;es dans des contextes contrastifs n&#8217;ont pas plus de chance d&#8217;&#234;tre per&#231;ues comme antonymes lorsqu&#8217;elles
appartiennent &#224; une m&#234;me classe distributionnelle. Cela va &#224; l&#8217;encontre de l&#8217;intuition qui consisterait &#224;
penser que le test de substituabilit&#233; fournirait un filtre efficace pour s&#233;parer les vrais antonymes des paires
de mots qui entretiennent une relation d&#8217;opposition tr&#232;s &#233;ph&#233;m&#232;re sugg&#233;r&#233;e par des contextes discursifs
particuliers. Cette m&#233;thode met ainsi au jour des paires d&#8217;antonymes qui ne sont pas voisins distribution-
nels, ce qui permet de d&#233;gager des cas prototypiques d&#8217;association purement syntagmatique, qui tranchent
avec l&#8217;hypoth&#232;se classique d&#8217;un fonctionnement paradigmatique. Ces premiers r&#233;sultats nous encouragent
&#224; poursuivre ce type d&#8217;analyse pour essayer de d&#233;gager une typologie au sein de la relation d&#8217;antonymie
&#8211; ou peut-&#234;tre un continuum entre fonctionnement paradigmatique et syntagmatique. Une autre perspec-
tive consisterait &#224; v&#233;rifier l&#8217;hypoth&#232;se d&#8217;un comportement particulier de l&#8217;antonymie au sein des relations
lexicales, et &#224; s&#8217;int&#233;resser cette fois &#224; l&#8217;articulation entre les dimension syntagmatique et paradigmatique
pour les relations de synonymie et d&#8217;hyperonymie.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BARONI M. &amp; LENCI A. (2009). One distributional memory, many semantic spaces. In Proceedings of
the Workshop on Geometrical Models of Natural Language Semantics, p. 1&#8211;8, Ath&#232;nes.
</p>
<p>BOURIGAULT D. (2002). UPERY : un outil d&#8217;analyse distributionnelle &#233;tendue pour la construction
d&#8217;ontologies &#224; partir de corpus. In Actes de la 9econf&#233;rence sur le Traitement Automatique de la Langue
Naturelle, p. 75&#8211;84, Nancy.
</p>
<p>BOURIGAULT D. (2007). Un analyseur syntaxique op&#233;rationnel : SYNTEX. M&#233;moire d&#8217;habilitation &#224;
diriger des recherches. Universit&#233; Toulouse II &#8211; Le Mirail.
</p>
<p>CHARLES W. &amp; MILLER G. (1989). Context of antonymous adjectives. Applied psycholinguistics, 10.
FELLBAUM C. (1995). Co-occurrence and antonymy. International journal of lexicography, 8.
GEFFET M. &amp; DAGAN I. (2005). The distributional inclusion hypotheses and lexical entailment. In
Proceedings of the 43rd Annual Meeting on Association for Computational Linguistics, p. 107&#8211;114.
</p>
<p>HOEY M. (1991). Patterns of lexis in text. Oxford University Press (Oxford).
</p>
<p>JONES S. (2002). Antonymy : a corpus-based perspective. Routledge.
</p>
<p>JONES S. &amp; MURPHY L. (2005). Using corpora to investigate antonym acquisition. International
Journal of Corpus Linguistics, 10(3), 401&#8211;422.
JUSTESON J. &amp; KATZ S. (1991). Co-occurrence of antonymous adjectives and their contexts. Compu-
tational linguistics, 17.
LOBANOVA A., VAN DER KLEIJ T. &amp; SPENADER J. (2010). Defining antonymy : a corpus-based study
of opposites by lexico-syntactic patterns. International Journal of Lexicography, 23(1), 19&#8211;53.
MURPHY L. (2006). Antonyms as lexical constructions : or, why paradigmatic construction is not an oxy-
moron. Constructions all over : case studies and theoretical implications. Special volume of Construc-
tions, SV1(8).
MURPHY M. L., PARADIS C., WILLNERS C. &amp; JONES S. (2009). Discourse functions of antonymy : a
cross-linguistic investigation of Swedish and English. Journal of Pragmatics, 41(11), 2159&#8211;2184.</p>

</div></div>
</body></html>