<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Adjectifs relationnels et langue de sp&#233;cialit&#233; : v&#233;rification d&#8217;une hypoth&#232;se linguistique en corpus comparable m&#233;dical</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010 &#8211; Session Posters, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Adjectifs relationnels et langue de sp&#233;cialit&#233; : v&#233;rification d&#8217;une
hypoth&#232;se linguistique en corpus comparable m&#233;dical
</p>
<p>Louise Del&#233;ger Bruno Cartoni
LIMSI-CNRS, BP 133, 91403 Orsay Cedex, France
</p>
<p>{louise.deleger,bruno.cartoni}@limsi.fr
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente une &#233;tude en corpus comparable m&#233;dical pour confirmer la pr&#233;f&#233;rence
d&#8217;utilisation des adjectifs relationnels dans les langues de sp&#233;cialit&#233; et examiner plus finement l&#8217;alternance
entre syntagmes nominaux avec adjectifs relationnels et syntagmes avec compl&#233;ment pr&#233;positionnel.
</p>
<p>Abstract. This paper presents a study in medical comparable corpora that aims to confirm the pre-
ferred use of relational adjectives in specialised languages and to examine in a more fine-grained manner
the alternance between phrases with adjective and noun phrases with prepositional complement.
</p>
<p>Mots-cl&#233;s : corpus comparables monolingues, morphologie constructionnelle, langue de sp&#233;cialit&#233;.
</p>
<p>Keywords: monolingual comparable corpora, constructional morphology, specialised language.
</p>
<p>1 Introduction : adjectifs relationnels et corpus comparables
</p>
<p>Il est souvent &#233;nonc&#233;, mais rarement valid&#233; empiriquement, que les adjectifs relationnels sont l&#8217;apanage
des langues de sp&#233;cialit&#233; (cancer mammaire), et que la langue courante pr&#233;f&#233;rera une construction pr&#233;po-
sitionnelle (cancer du sein). Nous proposons ici de confirmer cette hypoth&#232;se en comparant les emplois de
ces deux types de construction dans des corpus comparables du domaine m&#233;dical s&#8217;adressant &#224; des publics
diff&#233;rents (sp&#233;cialistes d&#8217;une part, grand public d&#8217;autre part).
</p>
<p>Les adjectifs relationnels sont r&#233;put&#233;s &#234;tre un type d&#8217;adjectifs &#224; part, qui poss&#232;de des propri&#233;t&#233;s bien
connues (M&#233;lis-Puchulu, 1991)1. Syntaxiquement, ils ne peuvent &#234;tre utilis&#233;s comme attribut et sont consi-
d&#233;r&#233;s comme non-gradables. Morphologiquement, ils sont le plus souvent construits sur une base nomi-
nale par suffixation, parfois avec la forme suppl&#233;tive (pr&#233;sident&#8594; pr&#233;sidentiel, ou coeur&#8594; cardiaque), et
peuvent &#234;tre utilis&#233;s comme base formelle dans des pr&#233;fixations nominales, le pr&#233;fixe portant alors sur la
base nominale de l&#8217;adjectif (anticanc&#233;reux = qui est contre le cancer). S&#233;mantiquement, ils instaurent une
relation entre l&#8217;entit&#233; d&#233;not&#233;e par leur nom base et l&#8217;entit&#233; modifi&#233;e, nom recteur du syntagme2. D&#8217;un point
de vue discursif, les syntagmes impliquant un adjectif relationnel (N+Adj_rel) peuvent donc &#234;tre glos&#233;s
par un syntagme avec compl&#233;ment pr&#233;positionnel (N+prep+N, la pr&#233;position pouvant varier). Enfin, les
adjectifs relationnels, de part leur pr&#233;dominance dans certains discours de langue de sp&#233;cialit&#233; (comme
le domaine m&#233;dical (L&#8217;Homme, 2004)) permettent &#233;galement de caract&#233;riser le degr&#233; de sp&#233;cialit&#233; d&#8217;un
discours (Maniez, 2009).
</p>
<p>1Certaines de ces propri&#233;t&#233;s, bien que souvent nuanc&#233;es, sont g&#233;n&#233;ralement reconnues par la majorit&#233; des linguistes.
2Dans &#233;lection pr&#233;sidentielle, l&#8217;adjectif permet de d&#233;signer la relation entre &#233;lection et pr&#233;sident.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOUISE DEL&#201;GER, BRUNO CARTONI
</p>
<p>Les adjectifs relationnels sont au coeur de nombreuses applications de TAL, comme l&#8217;acquisition de termi-
nologie, particuli&#232;rement lorsqu&#8217;il s&#8217;agit d&#8217;acqu&#233;rir diff&#233;rentes variantes d&#8217;un m&#234;me terme (Daille, 1999;
Morin &amp; Daille, 2010). D&#8217;autres travaux &#233;tudient les adjectifs relationnels en discours, mais sans unit&#233;
th&#233;matique (comme (Maniez, 1995)), ou sans opposer langue de sp&#233;cialit&#233; et langue g&#233;n&#233;rale (L&#8217;Homme,
2004). L&#8217;utilisation des corpus comparables a d&#233;j&#224; fait ses preuves dans de nombreux champs d&#8217;&#233;tude. Tra-
ditionnellement, ils sont multilingues et utilis&#233;s pour l&#8217;extraction de lexiques bilingues. Mais ils peuvent
&#233;galement &#234;tre monolingues et sont alors g&#233;n&#233;ralement employ&#233;s pour l&#8217;acquisition de paraphrases : par
exemple, Elhadad &amp; Sutaria (2007) et Del&#233;ger &amp; Zweigenbaum (2009) recherchent des paraphrases entre
expressions sp&#233;cialis&#233;es et grand public. La distinction sp&#233;cialis&#233;/grand public est aussi &#233;tudi&#233;e par Goeu-
riot et al. (2008) qui d&#233;finissent des crit&#232;res de distinction des deux types de discours utilis&#233;s par des al-
gorithmes d&#8217;apprentissage ; ainsi que par Morin et al. (2007) dans des corpus multilingues pour y extraire
des lexiques bilingues. Ici, nous exploitons des corpus comparables monolingues de discours sp&#233;cialis&#233; et
grand public dans le domaine m&#233;dical pour valider l&#8217;hypoth&#232;se linguistique pr&#233;alablement pos&#233;e. L&#8217;int&#233;-
r&#234;t de ces corpus est qu&#8217;ils portent sur une m&#234;me th&#233;matique tout en pr&#233;sentant une variation de type de
discours.
</p>
<p>2 Exp&#233;rience
</p>
<p>2.1 Mat&#233;riel de d&#233;part : listes de paires Adj_rel-Nom et corpus m&#233;dicaux
</p>
<p>Pour rechercher des syntagmes N+Adj_rel ou N+prep+N, nous avons &#233;labor&#233; des listes de paires Adj_rel-
Nom, &#224; partir des adjectifs relationnels pr&#233;sents dans l&#8217;UMLF (lexique sp&#233;cialis&#233; du fran&#231;ais m&#233;dical
(Zweigenbaum et al., 2003)), analys&#233;s avec l&#8217;analyseur D&#233;rif (Namer, 2009) pour r&#233;cup&#233;rer leur base
nominale. Une v&#233;rification manuelle a &#233;t&#233; effectu&#233;e. Deux listes ont &#233;t&#233; cr&#233;&#233;es : une liste de 2091 paires
Adj_rel - Nom (cardiaque | c&#339;ur) et une liste de 864 paires Adj_rel pr&#233;fix&#233; - Nom (anticanc&#233;reux | cancer).
</p>
<p>Nous avons utilis&#233; trois corpus comparables m&#233;dicaux (Del&#233;ger &amp; Zweigenbaum, 2009), avec des textes
&#224; destination de sp&#233;cialistes et des textes &#224; destination du grand public, portant sur les th&#233;matiques du
diab&#232;te, du tabac et du cancer. Le corpus cancer provient d&#8217;une m&#234;me source (le site Standard Options Re-
commandations3) qui fournit des documents comparables (recommandations pour les m&#233;decins et guides
pour le grand public). Les autres corpus ont &#233;t&#233; construits &#224; travers une recherche guid&#233;e sur le web : nous
avons interrog&#233; des moteurs sp&#233;cialis&#233;s (CISMeF, HON4) &#224; l&#8217;aide de mots-cl&#233;s, en sp&#233;cifiant le public vis&#233;
(ces deux portails le permettant), et effectu&#233; une recherche sur des sites institutionnels et des sites de sant&#233;
d&#233;di&#233;s au grand public. Les tailles des corpus sont report&#233;es dans le tableau 1.
</p>
<p>Diab&#232;te Tabac Cancer
S G S G S G
</p>
<p>Documents 135 600 62 620 22 16
Occurrences 580 712 461 066 595 733 603 257 641 584 228 742
</p>
<p>TAB. 1 &#8211; Taille des corpus (Nombre de documents et mots ; S=sp&#233;cialis&#233;, G=grand public)
</p>
<p>3http://www.sor-cancer.fr ; NB : les guides grand public incluent des glossaires qui n&#8217;ont pas &#233;t&#233; conserv&#233;s ici
4http://www.cismef.org et http://www.hon.ch</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADJECTIFS RELATIONNELS ET LANGUE DE SP&#201;CIALIT&#201;
</p>
<p>2.2 Identification de paires N+Adj_rel / N+prep+N avec m&#234;me nom recteur
</p>
<p>Le but est donc de rechercher en corpus des correspondances entre syntagmes impliquant un adjectif
relationnel dans la partie sp&#233;cialis&#233;e et syntagmes impliquant le nom dont cet adjectif est d&#233;riv&#233; dans la
partie grand public, tous les deux avec le m&#234;me nom recteur. Le patron lexico-syntaxique suivant, construit
autour des paires Adj_rel-Nom d&#233;crites pr&#233;c&#233;demment, a &#233;t&#233; d&#233;fini5:
&#8211; N2+A1&#8596; N2+Prep+(Det)+N1 (ex : atteinte ganglionnaire&#8596; atteinte des ganglions)
Dans une 1&#232;re phase, la partie gauche du patron est appliqu&#233;e du c&#244;t&#233; sp&#233;cialis&#233;6, et la partie droite
correspondante du c&#244;t&#233; grand public. Ceci nous fournit une liste de paires de syntagmes &#233;quivalents, sur
laquelle repose nos mesures. Dans une 2&#232;me phase, chaque syntagme est recherch&#233; dans les deux parties
des corpus pour pouvoir comparer leurs proportions. Ainsi, si la paire &#171; myocarde-myocardique &#187; permet
de trouver &#171; infarctus du myocarde &#187; dans la partie grand public et son &#233;quivalent &#171; infarctus myocardique &#187;
dans la partie sp&#233;cialis&#233;e (phase I), la phase II recherche &#171; infarctus myocardique &#187; du c&#244;t&#233; grand public
et &#171; infarctus du myocarde &#187; du c&#244;t&#233; sp&#233;cialis&#233;, et mesure leur fr&#233;quence.
Cette m&#233;thode automatique de rep&#233;rage de paires N+Adj_rel / N+prep+N rel&#232;ve &#233;galement quelques paires
qui ne sont pas &#233;quivalentes (sens non strictement identiques (nombre annuel / nombre d&#8217;ans) ou syntagme
N+prep+N issu d&#8217;un syntagme plus &#233;tendu7) et la comparaison n&#8217;est donc pas pertinente, nous les avons
exclus manuellement (respectivement 7,4%, 18,7% et 7,5% pour les corpus diab&#232;te, tabac et cancer).
</p>
<p>2.3 Analyses quantitatives et qualitatives
</p>
<p>Nous examinons d&#8217;abord les r&#233;sultats &#224; travers un indice de pr&#233;f&#233;rence qui repr&#233;sente la proportion de
syntagmes du type N+Adj_rel par rapport &#224; l&#8217;ensemble des cas possibles (N+Adj_rel et N+prep+N). Pour
chaque paire de syntagmes identifi&#233;e, l&#8217;indice se calcule ainsi : I = FNA
</p>
<p>FNA+FNN
avec FNA la fr&#233;quence du
</p>
<p>syntagme N+Adj_rel et FNN la fr&#233;quence du syntagme N+prep+N. Nous calculons l&#8217;ensemble des indices
pour chaque paire dans chaque partie des corpus, et leur moyenne. Suivant notre hypoth&#232;se de d&#233;part (le
discours sp&#233;cialis&#233; emploie plus volontiers les constructions avec adjectif que le grand public), l&#8217;indice
devrait &#234;tre fort (proche de 1) dans la partie sp&#233;cialis&#233;e et faible (proche de 0) dans la partie grand public.
Nous &#233;tablissons ensuite une comparaison entre les indices de pr&#233;f&#233;rence des deux parties des corpus, en
calculant pour chaque paire de syntagmes l&#8217;&#233;cart entre l&#8217;indice de la partie sp&#233;cialis&#233;e (Is) et celui de la
partie grand public (Ig): E = Is &#8722; Ig. Plus l&#8217;&#233;cart est grand (et positif), plus la diff&#233;rence entre les deux
types de discours est marqu&#233;e, ce qui confirme l&#8217;hypoth&#232;se.
D&#8217;un point de vue qualitatif, nous examinons d&#8217;une part les cas o&#249; l&#8217;&#233;cart entre indices de pr&#233;f&#233;rence
va &#224; l&#8217;encontre de l&#8217;hypoth&#232;se (&#233;cart nul ou n&#233;gatif), et d&#8217;autre part les pr&#233;positions utilis&#233;es dans les
syntagmes nominaux (particuli&#232;rement lorsqu&#8217;il s&#8217;agit de gloser un adjectif relationnel pr&#233;fix&#233;). L&#8217;analyse
de ces pr&#233;positions permettrait l&#8217;am&#233;lioration des patrons pour la recherche de paraphrases ou de gloses
de mots morphologiquement construits.
</p>
<p>5Les indices indiquent les mots en correspondance (Adj_rel-Nom=indice 1) ; aucune restriction n&#8217;est mise sur la pr&#233;position.
6Chaque corpus est pr&#233;alablement &#233;tiquet&#233; morphosyntaxiquement et lemmatis&#233;.
7Dans la paire carie dentaire / carie de dents, le deuxi&#232;me syntagme provient en fait de carie de dents de lait.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOUISE DEL&#201;GER, BRUNO CARTONI
</p>
<p>3 R&#233;sultats
</p>
<p>Les moyennes des indices de pr&#233;f&#233;rence pour l&#8217;ensemble des corpus sont report&#233;es dans le tableau 2. On
constate que, dans tous les corpus, l&#8217;indice moyen est fort pour la partie sp&#233;cialis&#233;e et faible pour la partie
grand public8, ce qui vient confirmer l&#8217;hypoth&#232;se de d&#233;part. Des exemples de paires de syntagmes avec
leurs indices sont donn&#233;s dans le tableau 3. La ligne (4) montre un cas o&#249;, contrairement &#224; ce qu&#8217;on at-
tendrait, l&#8217;indice de pr&#233;f&#233;rence est faible dans la partie sp&#233;cialis&#233;. La ligne (5) constitue &#233;galement un cas
inverse, avec un fort indice dans la partie grand public.
</p>
<p>Diab&#232;te (150 paires) Tabac (74 paires) Cancer (86 paires)
Sp&#233;cialis&#233; 0,78 0,69 0,82
Grand public 0,32 0,25 0,14
</p>
<p>TAB. 2 &#8211; Indice de pr&#233;f&#233;rence moyen dans chaque partie (sp&#233;cialis&#233;, grand public) des corpus
</p>
<p>Indice de pr&#233;f&#233;rence Ecart
Sp&#233;cialis&#233; Grand public
</p>
<p>(1) risque infectieux / risque d&#8217;infection 1 0 1
(2) vaccination antigrippale / vaccination contre la grippe 0,62 0 0,62
(3) &#233;chographie abdominale / &#233;chographie de l&#8217;abdomen 1 0,47 0,53
(4) traitement antidiab&#233;tique / traitement du diab&#232;te 0,16 0,04 0,12
(5) rythme cardiaque / rythme du coeur 1 0,94 0,06
(6) campagne publicitaire / campagne de publicit&#233; 0,33 0,5 -0,17
(7) greffe r&#233;nale / greffe du rein 0,71 0,8 -0,09
</p>
<p>TAB. 3 &#8211; Exemples d&#8217;indices calcul&#233;s pour quelques paires
</p>
<p>Le calcul des &#233;carts entre les indices de chaque paire nous permet d&#8217;observer de mani&#232;re plus fine la pr&#233;-
f&#233;rence. La figure 1 pr&#233;sente le nombre de paires de syntagmes par tranche d&#8217;&#233;cart pour l&#8217;ensemble des
corpus, avec en abscisse la valeur de l&#8217;&#233;cart entre les indices de pr&#233;f&#233;rences (regroup&#233;s par tranches de 0,1)
et en ordonn&#233;e le nombre de paires pour chacune de ces tranches de valeur. Des exemples d&#8217;&#233;carts sont
report&#233;s dans la derni&#232;re colonne du tableau 3. Dans l&#8217;ensemble, une majorit&#233; de paires pr&#233;sente un &#233;cart
positif, ce qui va dans le sens de l&#8217;hypoth&#232;se et montre une diff&#233;rence entre les deux types de discours
(lignes (1) &#224; (3) du tableau 3). Il est int&#233;ressant de noter le fort nombre de paires dont l&#8217;&#233;cart est de 1 (ou
proche), donc o&#249; la pr&#233;f&#233;rence est tr&#232;s nettement marqu&#233;e. Il existe &#233;galement un nombre assez important
de cas o&#249; l&#8217;&#233;cart est (quasi-)nul, donc o&#249; l&#8217;on n&#8217;observe aucune diff&#233;rence entre les deux types de discours.
Parmi les &#233;carts nuls, on distingue deux cas : soit les deux types de discours pr&#233;f&#232;rent une construction
N+Adj_rel (ex. (4) du tableau 3) ; soit ils pr&#233;f&#232;rent une construction N+prep+N (ex. (5)). Dans un cas,
les exemples semblent t&#233;moigner de syntagmes fr&#233;quents couramment utilis&#233;s dans la langue g&#233;n&#233;rale. Le
deuxi&#232;me cas montre que l&#8217;usage d&#8217;un syntagme N+Adj_rel n&#8217;est pas automatique dans la langue sp&#233;cia-
lis&#233;e ; &#224; premi&#232;re vue, il est difficile d&#8217;identifier une raison &#233;vidente au choix du syntagme N+prep+N. En
outre, pour quelques rares cas, l&#8217;&#233;cart est n&#233;gatif, montrant ainsi une pr&#233;f&#233;rence inverse (plus forte dans le
</p>
<p>8La diff&#233;rence des moyennes des indices, test&#233;e avec un T-test unilat&#233;ral appari&#233;, est statistiquement significative (p&lt;0.01).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ADJECTIFS RELATIONNELS ET LANGUE DE SP&#201;CIALIT&#201;
</p>
<p>FIG. 1 &#8211; Nombre de paires de syntagmes par tranches d&#8217;&#233;carts entre indices de pr&#233;f&#233;rence
</p>
<p>discours grand public, comme dans les lignes (6) &#224; (7) du tableau 3). Il s&#8217;agit essentiellement d&#8217;adjectifs
ne faisant pas partie du vocabulaire de sp&#233;cialit&#233;, comme publicitaire (ex. (6)), ce qui semble indiquer
que les adjectifs relationnels sont l&#8217;apanage de la langue de sp&#233;cialit&#233; seulement quand ils rel&#232;vent de la
terminologie de la langue en question. Enfin, il existe une poign&#233;e d&#8217;exemples d&#8217;&#233;cart n&#233;gatif impliquant
des adjectifs relationnels appartenant bien au vocabulaire sp&#233;cialis&#233; (ex. (7)), difficilement explicables.
</p>
<p>Concernant les pr&#233;positions, sur les 296 syntagmes N+prep+N rep&#233;r&#233;s sur la base des paires Adj_rel-Nom,
on constate &#233;videmment la grande fr&#233;quence de la pr&#233;position de (78%). Ensuite on trouve les pr&#233;positions
par (5,1%), dans (4,1%), et &#224; (3,7%). Comme on peut s&#8217;y attendre, l&#8217;utilisation d&#8217;une pr&#233;position locative
(ex. dans) renvoie &#224; un &#233;quivalent N+Adj_rel o&#249; l&#8217;adjectif est pr&#233;fix&#233; (injection intraveineuse&#8596; injection
dans la veine), mais pas uniquement (m&#233;tastase c&#233;r&#233;bral &#8596; m&#233;tastase dans le cerveau). Certains syn-
tagmes compos&#233;s d&#8217;adjectifs relationnels pr&#233;fix&#233;s n&#8217;ont pas uniquement des &#233;quivalents impliquant une
pr&#233;position s&#233;mantiquement proche de l&#8217;instruction de la r&#232;gle de pr&#233;fixation. Ainsi, nous avons d&#233;couvert
des cas o&#249; l&#8217;emploi d&#8217;une pr&#233;position semble beaucoup plus flexible, comme dans traitement anticanc&#233;-
reux, pour lequel on trouve traitement du cancer ou traitement contre le cancer. Pour d&#8217;autres cas, nous
n&#8217;avons trouv&#233; aucun &#233;quivalent avec une pr&#233;position &#171; li&#233;e &#187; au pr&#233;fixe de l&#8217;adjectif (tumeur intrapros-
tatique mais tumeur de la prostate). La disparit&#233; d&#8217;utilisation des pr&#233;fixes ou des pr&#233;positions semblent
souligner le besoin de pr&#233;cision de la langue de sp&#233;cialit&#233;, l&#224; o&#249; la langue g&#233;n&#233;rale para&#238;t plus souple.
</p>
<p>4 Discussion et conclusion
</p>
<p>Nous avons montr&#233; les possibilit&#233;s qu&#8217;offrent les corpus comparables monolingues pour la validation
d&#8217;hypoth&#232;ses linguistiques et d&#233;crit diff&#233;rentes mesures permettant d&#8217;obtenir une analyse de l&#8217;alternance
entre deux r&#233;alisations linguistiques. Globalement, malgr&#233; quelques exemples r&#233;calcitrants, les donn&#233;es
extraites par notre &#233;tude semblent confirmer l&#8217;hypoth&#232;se d&#8217;une pr&#233;f&#233;rence pour les constructions avec ad-
jectifs relationnels dans la langue de sp&#233;cialit&#233; : pour une m&#234;me id&#233;e, un syntagme nominal avec adjectif</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOUISE DEL&#201;GER, BRUNO CARTONI
</p>
<p>relationnel est pr&#233;f&#233;r&#233; dans un corpus sp&#233;cialis&#233;, et son &#171; &#233;quivalent &#187; avec pr&#233;position et nom est da-
vantage pr&#233;sent dans un corpus grand public. En outre, cette tendance se retrouve dans les trois corpus
&#233;tudi&#233;s. Cependant nous avons &#233;galement montr&#233; que cette pr&#233;f&#233;rence n&#8217;&#233;tait pas toujours aussi marqu&#233;e :
il existe des cas o&#249; l&#8217;on n&#8217;observe pas de diff&#233;rence entre les deux types de discours que ce soit parce que
les deux pr&#233;f&#232;rent une construction avec adjectif ou parce que le syntagme avec pr&#233;position et nom est
utilis&#233; majoritairement dans les deux. Les rares cas o&#249; la pr&#233;f&#233;rence est invers&#233;e montrent en g&#233;n&#233;ral des
syntagmes nominaux beaucoup moins sp&#233;cialis&#233;s (campagne publicitaire). Ces r&#233;sultats sont &#224; nuancer
au vu de la taille relativement petite des corpus &#233;tudi&#233;s et de la restriction &#224; trois th&#232;mes particuliers par
rapport &#224; l&#8217;ensemble du domaine m&#233;dical. Nous envisageons donc de constituer des corpus plus larges,
pour donner plus de g&#233;n&#233;ralit&#233; &#224; la v&#233;rification de l&#8217;hypoth&#232;se. Une autre perspective int&#233;ressante serait
d&#8217;effectuer la m&#234;me &#233;tude dans des corpus comparables d&#8217;autres domaines de sp&#233;cialit&#233;.
En outre, cette exp&#233;rience n&#8217;est qu&#8217;une premi&#232;re &#233;tape pour la compr&#233;hension du r&#244;le et de l&#8217;usage de l&#8217;ad-
jectif relationnel. Son appartenance &#224; la langue de sp&#233;cialit&#233; n&#8217;est qu&#8217;un des aspects qui le caract&#233;risent,
et les m&#233;thodes pr&#233;sent&#233;es ici permettrait sans doute d&#8217;explorer d&#8217;autres de ses caract&#233;ristiques, comme
l&#8217;alternance dans les constructions pr&#233;fix&#233;es : accord interuniversit&#233; vs. accord interuniversitaire.
</p>
<p>R&#233;f&#233;rences
</p>
<p>DAILLE B. (1999). Identification des adjectifs relationnels en corpus. In TALN 1999, p. 105&#8211;114.
DEL&#201;GER L. &amp; ZWEIGENBAUM P. (2009). Extracting lay paraphrases of specialized expressions from
monolingual comparable medical corpora. In Proceedings of the 2nd Workshop on Building and Using
Comparable Corpora: from Parallel to Non-Parallel Corpora, p. 2&#8211;10.
ELHADAD N. &amp; SUTARIA K. (2007). Mining a lexicon of technical terms and lay equivalents. In ACL
BioNLP Workshop, p. 49&#8211;56, Prague, Czech Republic.
GOEURIOT L., GRABAR N. &amp; DAILLE B. (2008). Characterization of scientific and popular science
discourse in French, Japanese and Russian. In Proceedings of LREC, p. 2933&#8211;2937.
L&#8217;HOMME M. (2004). Adjectifs d&#233;riv&#233;s s&#233;mantiques (ADS) dans la structuration des terminologies. In
Terminologie, ontologie et repr&#233;sentation des connaissances, Universit&#233; Jean-Moulin Lyon-3.
MANIEZ F. (1995). Rep&#233;rage des collocations adjectivales en anglais m&#233;dical. Revue Informatique et
Statistique dans les Sciences Humaines, 1 &#224; 4, 113&#8211;127.
MANIEZ F. (2009). L&#8217;adjectif relationnel en langue de sp&#233;cialit&#233; : utilisations terminologiques et phra-
s&#233;ologiques. Revue Fran&#231;aise de Linguistique Appliqu&#233;e, XIV-2, 117&#8211;130.
MORIN E. &amp; DAILLE B. (2010). Compositionality and lexical alignment of multi-word terms. Language
Resources and Evaluation (LRE), 44(1-2), 79&#8211;95.
MORIN E., DAILLE B., TAKEUCHI K. &amp; KAGEURA K. (2007). Bilingual terminology mining - using
brain, not brawn comparable corpora. In Proceedings of ACL, Prague, Czech Republic.
M&#201;LIS-PUCHULU A. (1991). Les adjectifs d&#233;nominaux: des adjectifs de &quot;relation&quot;. Lexique, 10, 33&#8211;60.
NAMER F. (2009). Morphologie, lexique et traitement automatique des langues : l&#8217;analyseur D&#233;riF.
Paris: Lavoisier.
ZWEIGENBAUM P., BAUD R., BURGUN A., NAMER F., JARROUSSE E., GRABAR N., RUCH P., LE
DUFF F., THIRION B. &amp; DARMONI S. (2003). UMLF : construction d&#8217;un lexique m&#233;dical francophone
unifi&#233;. In Proceedings of the 10th French Language Medical Informatics Conference, Tunis.</p>

</div></div>
</body></html>