<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Reconnaissance d&#8217;entit&#233;s nomm&#233;es : enrichissement d&#8217;un syst&#232;me &#224; base de connaissances &#224; partir de techniques de fouille de textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2010, Montr&#233;al, 19&#8211;23 juillet 2010
</p>
<p>Reconnaissance d&#8217;entit&#233;s nomm&#233;es : enrichissement d&#8217;un syst&#232;me &#224;
base de connaissances &#224; partir de techniques de fouille de textes
</p>
<p>Damien Nouvel Arnaud Soulet Jean-Yves Antoine
Nathalie Friburger Denis Maurel
</p>
<p>Universit&#233; Fran&#231;ois Rabelais Tours, LI
Antenne Universitaire de Blois, 3 place Jean Jaur&#232;s, F-41000 Blois, France
</p>
<p>{pr&#233;nom.nom}@univ-tours.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons et analysons les r&#233;sultats du syst&#232;me de reconnaissance
d&#8217;entit&#233;s nomm&#233;es CasEN lors de sa participation &#224; la campagne d&#8217;&#233;valuation Ester2. Nous identifions
quelles ont &#233;t&#233; les difficult&#233;s pour notre syst&#232;me, essentiellement : les mots hors-vocabulaire, la m&#233;to-
nymie, les fronti&#232;res des entit&#233;s nomm&#233;es. Puis nous proposons une approche pour am&#233;liorer les perfor-
mances de syst&#232;mes &#224; base de connaissances, en utilisant des techniques exhaustives de fouille de donn&#233;es
s&#233;quentielles afin d&#8217;extraire des motifs qui repr&#233;sentent les structures linguistiques en jeu lors de la re-
connaissance d&#8217;entit&#233;s nomm&#233;es. Enfin, nous d&#233;crivons l&#8217;exp&#233;rimentation men&#233;e &#224; cet effet, donnons les
r&#233;sultats obtenus &#224; ce jour et en faisons une premi&#232;re analyse.
</p>
<p>Abstract. In this paper, we present and analyze the results obtained by our named entity recognition
system, CasEN, during the Ester2 evaluation campaign. We identify on what difficulties our system was the
most challenged, which mainly are : out-of-vocabulary words, metonymy and detection of the boundaries
of named entities. Next, we propose a direction which may help us for improving performances of our
system, by using exhaustive hierarchical and sequential data mining algorithms. This approach aims at
extracting patterns corresponding to useful linguistic constructs for recognizing named entities. Finaly, we
describe our experiments, give the results we currently obtain and analyze those results.
</p>
<p>Mots-cl&#233;s : Reconnaissance d&#8217;Entit&#233;s Nomm&#233;es, S&#233;quences Hi&#233;rarchiques, Motifs, Ester2.
</p>
<p>Keywords: Named Entity Recognition, Hierarchical Sequences, Patterns, Ester2.
</p>
<p>1 Introduction
</p>
<p>La campagne d&#8217;&#233;valuation Ester2, organis&#233;e par l&#8217;AFCP1 et la DGA2, a port&#233; sur la transcription, la seg-
mentation et l&#8217;extraction d&#8217;informations de flux de parole en langue fran&#231;aise radiodiffus&#233;s (Galliano et al.,
2009). La t&#226;che d&#8217;extraction d&#8217;information portait sur la reconnaissance d&#8217;Entit&#233;s Nomm&#233;es (EN) dans les
transcriptions de ces flux (manuelles ou issues de syst&#232;mes de reconnaissance de parole). Les EN d&#233;tect&#233;es
devaient &#234;tre cat&#233;goris&#233;es selon sept cat&#233;gories : personnes (pers), lieux (loc), organisations (org), produc-
tions humaines (prod), montants (amount), mesures de temps (time) et fonctions (fonc). Cette typologie
</p>
<p>1Association Francophone de la Communication Parl&#233;e
2Direction G&#233;n&#233;rale de l&#8217;Armement</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NOUVEL D., SOULET A., ANTOINE J.Y., FRIBURGER N., MAUREL D.
</p>
<p>a &#233;t&#233; sous-divis&#233;e en 38 cat&#233;gories fine (qui n&#8217;ont pas &#233;t&#233; &#233;valu&#233;es). La mesure des performances &#233;tait le
&#171; Slot Error Rate &#187; (SER) (Makhoul et al., 1999) ; la pr&#233;cision, le rappel et la f-mesure &#233;taient aussi fournis.
Sept syst&#232;mes (dont le n&#244;tre, CasEN) ont particip&#233; &#224; cette campagne, reposant sur des m&#233;thodes vari&#233;es :
apprentissage par CRF, syst&#232;mes &#224; base de r&#232;gles, avec analyses syntaxiques de surface ou profondes.
</p>
<p>Dans cet article, nous analysons les r&#233;sultats de la campagne et les performances de notre syst&#232;me. Nous
pr&#233;sentons ensuite une technique de fouille de textes exp&#233;riment&#233;e dans le but de compl&#233;ter de mani&#232;re
semi-automatique la base de connaissance du syst&#232;me.
</p>
<p>2 Le syst&#232;me CasEN dans la campagne Ester2
</p>
<p>CasEN est d&#233;velopp&#233; sur la plateforme CasSys (Friburger, 2002) d&#8217;analyse de textes par cascades de trans-
ducteurs. Reposant sur la plateforme Unitex3, CasSys applique les transducteurs dans un ordre pr&#233;d&#233;fini,
pour d&#233;tecter des &#238;lots de certitude (Abney, 1991), tout en r&#233;duisant progressivement l&#8217;espace de recherche.
CasSys peut &#234;tre utilis&#233; pour toute t&#226;che d&#8217;analyse de texte, CasEN en est une application &#224; la reconnais-
sance d&#8217;EN, initialement d&#233;di&#233;e aux textes &#233;crits (Friburger &amp; Maurel, 2004; Friburger, 2006). Elle utilise
des transducteurs pour impl&#233;menter des motifs de surface qui reconnaissent des EN dans des textes. Le
syst&#232;me a &#233;t&#233; adapt&#233; &#224; la langue parl&#233;e pour l&#8217;annotation du corpus Eslo dans le cadre du projet ANR
VariLing (Maurel et al., 2009), puis pour notre participation &#224; Ester2.
</p>
<p>R&#233;f&#233;rence ASR
Participant (approche) SER P R SER
</p>
<p>LIA (CRF) 23,9 86,4 71,8 43,4 (-19,5)
LIMSI (syntaxe surface) 30,9 81,1 70,9 45,3 (-14,4)
LINA (syntaxe surface) 37,1 80,7 55,4 54,0 (-16,9)
</p>
<p>LI Tours (syntaxe surface) 33,7 79,3 65,8 50,7 (-17,0)
LSIS (CRF) 35 82,6 73 55,3 (-20,3)
</p>
<p>Synapse (syntaxe profonde) 9,9 93 89,3 44,9 (-35,0)
Xerox (syntaxe profonde) 9,8 93,6 91,5 44,6 (-34,8)
</p>
<p>Tableau 1 &#8211; Reconnaissance d&#8217;EN lors d&#8217;Ester2 sur les transcription
de r&#233;f&#233;rence (SER, Pr&#233;cision, Rappel) et automatiques (ASR)
</p>
<p>Le tableau 1 pr&#233;sente les r&#233;sul-
tats officiels de la campagne Ester2
(Galliano et al., 2009) pour la t&#226;che
de reconnaissance des EN. Les sys-
t&#232;mes centr&#233;s connaissances effec-
tuant une analyse syntaxique pro-
fonde obtiennent les meilleurs r&#233;-
sultats pour la transcription de r&#233;-
f&#233;rence. Pour la transcription au-
tomatique (ASR, fournie par le
LIMSI), une approche &#224; base d&#8217;ap-
prentissage l&#8217;emporte.
</p>
<p>Les performances de CasEN (LI Tours) sont proches de celles des autres syst&#232;mes non industriels (&#224;
l&#8217;exception de celui du LIA), ce qui est rassurant pour un syst&#232;me initialement d&#233;velopp&#233; pour l&#8217;&#233;crit. La
d&#233;gradation des performances de CasEN sur les transcriptions automatiques est satisfaisante : en cela notre
syst&#232;me s&#8217;av&#232;re &#234;tre relativement tol&#233;rant aux erreurs de transcription, probablement gr&#226;ce &#224; la robustesse
des analyses syntaxiques partielles et &#224; la faible d&#233;pendance des motifs aux lexiques.
</p>
<p>Afin d&#8217;analyser le comportement du syst&#232;me, nous avons caract&#233;ris&#233; chaque erreur de CasEN (1180 erreurs
pour 2512 EN) par sa localisation, le type d&#8217;erreur (suppression, insertion, cat&#233;gorie erron&#233;e, erreur de
fronti&#232;re, etc.) et la r&#232;gle de la convention Ester2 concern&#233;e. A cette occasion, nous avons remarqu&#233; un
nombre non-n&#233;gligeable d&#8217;incoh&#233;rences dans l&#8217;annotation manuelle : de fausses erreurs d&#8217;insertions (EN
omises dans la r&#233;f&#233;rence mais correctement d&#233;tect&#233;es par CasEN), des annotations de r&#233;f&#233;rence qui ne
respectent pas les r&#232;gles sp&#233;cifi&#233;es dans le guide d&#8217;annotation, etc. Au final, nous observons une r&#233;duction
</p>
<p>3http ://www-igm.univ-mlv.fr/&#732;unitex/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RECONNAISSANCE D&#8217;ENTIT&#201;S NOMM&#201;ES : ENRICHISSEMENT D&#8217;UN SYST&#200;ME &#192; BASE DE
CONNAISSANCES &#192; PARTIR DE TECHNIQUES DE FOUILLE DE TEXTES
</p>
<p>de presque 10% du SER, apr&#232;s avoir corrig&#233; manuellement la r&#233;f&#233;rence.
</p>
<p>Par ailleurs, avec 7 types d&#8217;EN, Ester2 introduit une cat&#233;gorisation plus fine que celles mise en place lors
des campagnes ant&#233;rieures, rendant la cat&#233;gorisation plus subtile (ce qui explique en partie les difficult&#233;s
qu&#8217;ont rencontr&#233;es les annotateurs humains). Certaines difficult&#233;s sont int&#233;ressantes, car elles rel&#232;vent du
ph&#233;nom&#232;ne de m&#233;tonymie (Markert &amp; Hahn, 2002). Dans d&#8217;autres cas, on peut au contraire estimer que
des sous-cat&#233;gorisations artificielles ont eu une influence directe sur les r&#233;sultats (Nouvel et al., 2010).
</p>
<p>Figure 1 &#8211; R&#233;sultats de CasEN par type d&#8217;entit&#233;s nomm&#233;es
</p>
<p>La figure 1 pr&#233;sente les performances de
CasEN par cat&#233;gories. Globalement sa-
tisfaisante, la pr&#233;cision est m&#233;diocre pour
la cat&#233;gorie prod (h&#233;t&#233;rog&#232;ne, elle a aussi
g&#234;n&#233; les autres participants). Le rappel
varie significativement d&#8217;une cat&#233;gorie &#224;
une autre. Nos difficult&#233;s sont en par-
tie dues au relatif manque de couver-
ture de notre lexique de noms propres
(notamment pour ceux d&#8217;origine afri-
caine dans les enregistrements de la radio
Africa1). Face &#224; ce probl&#232;me (Charton &amp;
Torres-Moreno, 2009) propose l&#8217;extrac-
</p>
<p>tion d&#8217;EN d&#8217;encyclop&#233;dies. Il n&#8217;en reste pas moins que dans ce type d&#8217;application, le probl&#232;me des mots
hors-vocabulaire sera toujours pr&#233;sent, notamment du fait de la d&#233;pendance des EN au contexte du docu-
ment &#224; analyser (Favre et al., 2005).
</p>
<p>Nous avons estim&#233; la part de chaque transducteur (qui impl&#233;mente une famille de motifs) dans le taux d&#8217;er-
reurs du syst&#232;me (Nouvel et al., 2010). Huit transducteurs g&#233;n&#232;rent 54% des erreurs, mais ils reconnaissent
60% des EN : nous ne remarquons pas de transducteurs d&#233;faillants. Les transducteurs qui reconnaissent
des lieux font des erreurs li&#233;es &#224; des usages m&#233;tonymiques (par ex. &#171; Egypte &#187; pour une &#233;quipe sportive,
&#171; Paris &#187; pour le gouvernement fran&#231;ais). Ceux qui reconnaissent des personnes ont des difficult&#233;s avec
les EN imbriqu&#233;es : certaines fonctions s&#8217;&#233;tendent sur plusieurs mots et CasEN ne parvient pas &#224; en d&#233;-
tecter la fronti&#232;re droite. Ceci concerne &#233;galement les expressions de temps ou les organisations (par ex.
&#171; [chambre r&#233;gionale des comptes d&#8217;Ile-de-France] [...] &#187;). Pour surmonter ce probl&#232;me, nous envisageons
de parenth&#233;ser l&#8217;&#233;nonc&#233; &#224; l&#8217;aide d&#8217;un &#171; chunker &#187; (Antoine et al., 2008), afin de fournir une segmentation
utile et consistante.
</p>
<p>3 Application de la fouille de texte &#224; la reconnaissance d&#8217;EN
</p>
<p>Une cause majeure d&#8217;erreurs du syst&#232;me CasEN est donc l&#8217;insuffisance de la couverture de son dictionnaire
lors de la recherche des EN. Ce constat nous a conduit &#224; d&#233;velopper des techniques semi-automatiques
d&#8217;extension des bases de connaissances &#224; l&#8217;aide de techniques de fouille de textes. Notre objectif est d&#8217;ex-
traire des motifs qui, &#224; partir des lemmes ou des cat&#233;gories morphosyntaxiques, caract&#233;risent des &#171; struc-
tures linguistiques &#187; pertinentes pour la reconnaissance d&#8217;EN. Par exemple, le motif &#171; DET pr&#233;sident
ADJ NP NP &#187; est appropri&#233; pour d&#233;crire une EN telle que &#171; le pr&#233;sident am&#233;ricain Barack Obama &#187;.
Les &#233;l&#233;ments constituant les s&#233;quences, nomm&#233;s items, pourront donc &#234;tre issus de niveaux hi&#233;rarchiques
diff&#233;rents. L&#8217;objectif &#233;tant, &#224; terme, d&#8217;enrichir la base de transducteurs de CasEN &#224; l&#8217;aide de ces motifs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NOUVEL D., SOULET A., ANTOINE J.Y., FRIBURGER N., MAUREL D.
</p>
<p>3.1 M&#233;thode d&#8217;extraction des r&#232;gles s&#233;quentielles hi&#233;rarchiques
</p>
<p>Le processus d&#8217;extraction de r&#232;gles se d&#233;compose en trois phases : transformation du corpus en s&#233;quences
hi&#233;rarchiques ; extraction et groupement de s&#233;quences fr&#233;quentes ; s&#233;lection des meilleures r&#232;gles.
</p>
<p>Le corpus est segment&#233; en phrases, gr&#226;ce aux tours de parole et aux &#233;tiquettes morphosyntaxiques : cha-
cune sera consid&#233;r&#233;e comme une s&#233;quence. Les annotations d&#8217;EN du corpus de r&#233;f&#233;rence sont d&#233;limit&#233;es,
pour un type donn&#233;, par des balises &quot;&lt;typeBEG&gt;&quot; et &quot;&lt;typeEND&gt;&quot;. Nous utilisons l&#8217;&#233;tiqueteur TreeTagger
(Schmid, 1994) pour transformer le corpus de r&#233;f&#233;rence, en associant &#224; chaque terme sa cat&#233;gorie (POS1),
sa sous-cat&#233;gorie (POS2) morphosyntaxiques, et son lemme. Ainsi, le corpus est repr&#233;sent&#233; comme suites
d&#8217;items, chaque item appartenant &#224; une taxonomie, nous les notons POS1/POS2/LEMME. Enfin, nous
omettons les lemmes pour ce qui est reconnu par TreeTagger comme un nom propre (POS1 = &quot;NAM&quot;),
afin d&#8217;&#233;viter (en premi&#232;re approche) de construire des motifs reposant sur des &#233;l&#233;ments lexicaux.
</p>
<p>Consid&#233;rons l&#8217;exemple suivant : &#171; Le nouveau &lt;PERSBEG&gt; pr&#233;sident Barack Obama
&lt;PERSEND&gt; est arriv&#233; &#224; &lt;LOCBEG&gt; Moscou &lt;LOCEND&gt;. Il y a vu le nouveau
&lt;PERSBEG&gt; pr&#233;sident Dimitri Medvedev &lt;PERSEND&gt;[...] &#187;
Il est transform&#233; en s&#233;quences d&#8217;items, dont la premi&#232;re est : &#171; DET/ART/le ADJ/nouveau
&lt;PERSBEG&gt; NOM/pr&#233;sident NAM NAM &lt;PERSEND&gt; VER/pres/&#234;tre VER/pper/arriver
PRP/&#224; &lt;LOCBEG&gt; NAM &lt;LOCEND&gt; &#187;.
</p>
<p>La seconde &#233;tape extrait, &#224; travers la taxonomie, toutes les s&#233;quences d&#8217;items fr&#233;quentes (selon un seuil
donn&#233;) (Mannila et al., 1997), qui contiennent au moins une balise d&#8217;EN. La recherche &#233;tant exhaustive
et tenant compte d&#8217;une hi&#233;rarchie, l&#8217;extraction g&#233;n&#232;re une grande richesse de descriptions, mais aussi de
nombreux motifs redondants. Nous groupons les motifs de m&#234;me longueur et de m&#234;me fr&#233;quence, lorsque
l&#8217;un est g&#233;n&#233;ralisation de l&#8217;autre. Par exemple, le motif &#171; ADJ/nouveau &lt;PERSBEG&gt; NOM &#187; est plus
g&#233;n&#233;ral que &#171; ADJ/nouveau &lt;PERSBEG&gt; NOM/pr&#233;sident &#187; : s&#8217;ils ont m&#234;mes fr&#233;quences, ils couvrent
alors les m&#234;mes occurrences et un seul des deux suffirait, &#224; priori, &#224; reconna&#238;tre la forme d&#8217;EN qu&#8217;ils
couvrent. Nous avons &#233;valu&#233; les motifs obtenus avec ou sans ce groupement et n&#8217;avons pas observ&#233; de
diff&#233;rence significative des performances. Voici des groupes que l&#8217;on obtiendrait sur l&#8217;exemple pr&#233;c&#233;dent :
</p>
<p>Groupe A :
DET/ART ADJ &lt;PERSBEG&gt; NOM/pr&#233;sident NAM NAM &lt;PERSEND&gt;
DET ADJ/nouveau &lt;PERSBEG&gt; NOM NAM NAM &lt;PERSEND&gt;
DET/ART/le ADJ/nouveau &lt;PERSBEG&gt; NOM/pr&#233;sident NAM NAM &lt;PERSEND&gt;
Groupe B :
PRP/&#224; &lt;LOCBEG&gt; NAM &lt;LOCEND&gt;
PRP &lt;LOCBEG&gt; NAM &lt;LOCEND&gt;
</p>
<p>La derni&#232;re &#233;tape est la s&#233;lection des motifs selon leur confiance : la proportion de s&#233;quences, parmi
celles o&#249; le motif a &#233;t&#233; observ&#233;, qui comportent effectivement les annotations d&#8217;EN &#224; d&#233;tecter. Par groupe,
nous s&#233;lectionnons le motif qui a la meilleure confiance, si celle-ci d&#233;passe un seuil donn&#233;. Ainsi, nous
obtenons les motifs qui, &#224; priori, conduiraient, selon une bonne probabilit&#233; (la confiance), &#224; la d&#233;couverte
d&#8217;une annotation d&#8217;EN. Ceci peut-&#234;tre mis en parall&#232;le, en fouille de donn&#233;es, aux r&#232;gles d&#8217;association.
Pour notre exemple, nous conservons les motifs suivants :
</p>
<p>R&#232;gle s&#233;lectionn&#233;e pour le groupe A : DET ADJ NOM/pr&#233;sident NAM NAM
=&gt;DET ADJ &lt;PERSBEG&gt; NOM/pr&#233;sident NAM NAM &lt;PERSEND&gt;
R&#232;gle s&#233;lectionn&#233;e pour le groupe B : PRP/&#224; NAM =&gt; PRP/&#224; &lt;LOCBEG&gt; NAM &lt;LOCEND&gt;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RECONNAISSANCE D&#8217;ENTIT&#201;S NOMM&#201;ES : ENRICHISSEMENT D&#8217;UN SYST&#200;ME &#192; BASE DE
CONNAISSANCES &#192; PARTIR DE TECHNIQUES DE FOUILLE DE TEXTES
</p>
<p>3.2 Utilisation des r&#232;gles pour la reconnaissance des EN
</p>
<p>Les r&#232;gles que nous obtenons par cette m&#233;thode nous permettent de d&#233;terminer dans quels contextes ap-
paraissent une ou plusieurs annotations d&#8217;EN. Cependant, l&#8217;objectif est d&#8217;obtenir des paires d&#8217;annotations
(ouvrantes et fermantes), correctement ordonn&#233;es et sans chevauchements, qui d&#233;limitent des EN. A cet
effet, nous mettons en &#339;uvre, pour le moment, une strat&#233;gie simple, qui consiste &#224; ne conserver que les
paires d&#8217;annotations &#224; l&#8217;empan le plus large possible dans une fen&#234;tre consid&#233;r&#233;e.
</p>
<p>3.3 R&#233;sultats et am&#233;liorations envisag&#233;es
</p>
<p>Figure 2 &#8211; Dispersion pr&#233;cision / rappel pour l&#8217;&#233;valuation des
motifs &#224; diverses confiances et selon le seuil fr&#233;quence
</p>
<p>La mise en application donne de nom-
breux motifs, qui sont souvent des
m&#233;langes de lemmes et de cat&#233;go-
ries morphosyntaxiques : ceci nous
conforte dans l&#8217;id&#233;e qu&#8217;il est utile de
s&#8217;appuyer sur une taxonomie pour re-
conna&#238;tre une EN. La figure 2 pr&#233;sente
la dispersion pr&#233;cision /rappel des mo-
tifs, extraits puis &#233;valu&#233;s sur Ester2 en
validation crois&#233;e (12 groupes). Nous
obtenons des motifs d&#8217;une bonne pr&#233;-
cision, mais le rappel demeure assez
faible. Comme attendu, baisser le seuil
de fr&#233;quence ou de confiance am&#232;ne &#224;
une s&#233;lection plus large de motifs, fai-
sant baisser la pr&#233;cision et augmenter
le rappel. La courbe &#224; confiance 0,6
nous para&#238;t &#234;tre la plus int&#233;ressante en
termes de compromis pr&#233;cision / rappel pour l&#8217;extraction des motifs. Mais ce param&#232;tre est sp&#233;cifique au
corpus utilis&#233;, &#224; la m&#233;thode d&#8217;extraction et d&#8217;utilisation des r&#232;gles de reconnaissance d&#8217;EN. Nous exp&#233;ri-
mentons actuellement une extraction sur un corpus &#233;largi (Ester2 + Eslo, 250 Kmots).
</p>
<p>Nous envisageons des am&#233;liorations sur ce proc&#233;d&#233; d&#8217;extraction de motifs. D&#8217;une part, afin d&#8217;&#233;viter la
redondance entre motifs extraits, nous cherchons &#224; mieux les grouper, ind&#233;pendamment de leur taille,
&#224; fr&#233;quence &#171; proche &#187;. Par ailleurs, nous remarquons que certains motifs gagneraient &#224; contenir des
&#233;l&#233;ments optionnels ou disjonctifs (&#171; pr&#233;sident &#187;, &#171; ministre &#187;, &#171; gouverneur &#187;, etc.), ce que nous comptons
autoriser dans les motifs. L&#8217;objectif &#233;tant de constituer des groupes coh&#233;rents de motifs, qui correspondent
&#224; des structures linguistiques &#224; confronter aux transducteurs impl&#233;ment&#233;s dans CasEN.
</p>
<p>4 Conclusions et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; les r&#233;sultats du syst&#232;me CasEN dans la campagne d&#8217;&#233;valuation Ester2, que nous avons
analys&#233;s pour d&#233;terminer les faiblesses r&#233;elles de notre syst&#232;me. Celles-ci se r&#233;partissent essentiellement
en trois cat&#233;gories : r&#233;solution de la m&#233;tonymie, d&#233;limitation des fronti&#232;res, couverture du syst&#232;me.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NOUVEL D., SOULET A., ANTOINE J.Y., FRIBURGER N., MAUREL D.
</p>
<p>La direction que nous avons prise, plus particuli&#232;rement pour le manque de couverture, a &#233;t&#233; d&#8217;adopter
une approche semi-automatique, syst&#233;matique et exhaustive, afin de trouver les structures linguistiques
correspondant &#224; des EN. Par des techniques de fouille de donn&#233;es, nous pensons apporter de nouveaux
&#233;l&#233;ments, jusque l&#224; non impl&#233;ment&#233;s par CasEN, qui nous donneront des pistes pour am&#233;liorer le syst&#232;me.
</p>
<p>Nous cherchons actuellement &#224; estimer les gains &#224; esp&#233;rer en int&#233;grant les motifs trouv&#233;s par fouille de
textes dans CasEN, afin d&#8217;&#233;valuer les perspectives que nous ouvrent cette approche. Par ailleurs, nous
menons des exp&#233;riences pour d&#233;terminer la d&#233;pendance de cette extraction au corpus, autant du point de
vue du domaine et des th&#233;matiques que des dates d&#8217;enregistrement du corpus.
</p>
<p>5 Remerciements
</p>
<p>Ce travail a &#233;t&#233; r&#233;alis&#233; dans le cadre des projets Variling (ANR-06-CORP-023), Epac (ANR-00-MDCA-
006-03), cr&#233;&#233;s par l&#8217;Agence Nationale de la Recherche (ANR) et FEDER R&#233;gion Centre.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABNEY S. P. (1991). Parsing by Chunks, In Principle-Based Parsing, p. 257&#8211;278. Kluwer.
ANTOINE J.-Y., MOKRANE A. &amp; FRIBURGER N. (2008). Automatic rich annotation of large corpus of
conversational transcribed speech : the chunking task of the epac project. In LREC&#8217;08.
CHARTON E. &amp; TORRES-MORENO J. M. (2009). Classification d&#8217;un contenu encyclop&#233;dique en vue
d&#8217;un &#233;tiquetage par entit&#233;s nomm&#233;es. In TALN&#8217;2009.
FAVRE B., B&#201;CHET F. &amp; NOCERA P. (2005). Robust named entity extraction from large spoken ar-
chives. In HLT/EMNLP&#8217;05.
FRIBURGER N. (2002). Reconnaissance automatique des noms propres : application &#224; la classification
automatique de textes journalistiques. PhD thesis, Universit&#233; Fran&#231;ois-Rabelais Tours, France.
FRIBURGER N. (2006). Linguistique et reconnaissance automatique des noms propres. Meta : Transla-
tors&#8217; Journal, 51-4, 637&#8211;650.
FRIBURGER N. &amp; MAUREL D. (2004). Finite-state transducer cascades to extract named entities in
texts. Theoretical Computer Sciences, 313, 93&#8211;104.
GALLIANO S., GRAVIER G. &amp; CHAUBARD L. (2009). The ester 2 evaluation campaign for the rich
transcription of french radio broadcasts. In Interspeech&#8217;09, p. 2583&#8211;2586.
MAKHOUL J., KUBALA F., SCHWARTZ R. &amp; WEISCHEDEL R. (1999). Performance measures for
information extraction. In DARPA Broadcast News Workshop, p. 249&#8211;252.
MANNILA H., TOIVONEN H. &amp; VERKAMO A. I. (1997). Discovery of frequent episodes in event
sequences. Data Mining and Knowledge Discovery, 1, 259&#8211;289.
MARKERT K. &amp; HAHN U. (2002). Understanding metonymies in discourse. AI, 135, 145&#8211;198.
MAUREL D., FRIBURGER N. &amp; ESHKOL I. (2009). Who are you, you who speak ? In LTC&#8217;09.
NOUVEL D., ANTOINE J.-Y., FRIBURGER N. &amp; MAUREL D. (2010). An analysis of the performances
of the casen named entities recognition system in the ester2 evaluation campaign. In LREC&#8217;10.
SCHMID H. (1994). Probabilistic part-of-speech tagging using decision trees. In NEMLP&#8217;94, p. 44&#8211;49.</p>

</div></div>
</body></html>