<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;valuation et consolidation d&#8217;un r&#233;seau lexical via un outil pour retrouver le mot sur le bout de la langue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUATION ET OUTIL DE MOT SUR LE BOUT DE LA LANGUE
</p>
<p>&#201;valuation et consolidation d&#8217;un r&#233;seau lexical 
via un outil pour retrouver
</p>
<p>le mot sur le bout de la langue
</p>
<p>Alain Joubert (1), Mathieu Lafourcade (1), Didier Schwab (2), Michael Zock (3)
</p>
<p>(1) LIRMM, Universit&#233; Montpellier II (2) LIG, Universit&#233; Grenoble II   (3) LIF-CNRS, Marseille 
{alain.joubert, mathieu.lafourcade}@lirmm.fr, didier.schwab@imag.fr, michael.zock@lif.univ-mrs.fr
</p>
<p>R&#233;sum&#233; Depuis septembre 2007, un r&#233;seau lexical de grande taille pour le Fran&#231;ais est en cours de
construction &#224; l'aide de m&#233;thodes fond&#233;es sur des formes de consensus populaire obtenu via des jeux (projet
JeuxDeMots). L&#8217;intervention d&#8217;experts humains est marginale en ce qu'elle repr&#233;sente moins de 0,5% des
relations du r&#233;seau et se limite &#224; des corrections, &#224; des ajustements ainsi qu&#8217;&#224; la validation des sens de
termes. Pour &#233;valuer la qualit&#233; de cette ressource construite par des participants de jeu (utilisateurs non
experts) nous adoptons une d&#233;marche similaire &#224; celle de sa construction, &#224; savoir, la ressource doit &#234;tre
valid&#233;e sur un vocabulaire de classe ouverte, par des non-experts, de fa&#231;on stable (persistante dans le
temps). Pour ce faire, nous proposons de v&#233;rifier si notre ressource est capable de servir de support &#224; la
r&#233;solution du probl&#232;me nomm&#233; 'Mot sur le Bout de la Langue' (MBL). A l'instar de JeuxdeMots, l'outil
d&#233;velopp&#233; peut &#234;tre vu comme un jeu en ligne. Tout comme ce dernier, il permet d&#8217;acqu&#233;rir de nouvelles
relations, constituant ainsi un enrichissement de notre r&#233;seau lexical.
</p>
<p>Abstract Since September 2007, a large scale lexical network for French is under construction through
methods based on some kind of popular consensus by means of games (JeuxDeMots project). Human
intervention can be considered as marginal. It is limited to corrections, adjustments and validation of the
senses of terms, which amounts to less than 0,5 % of the relations in the network. To appreciate the quality
of this resource built by non-expert users (players of the game), we use a similar approach to its
construction. The resource must be validated by laymen, persistent in time, on open class vocabulary. We
suggest to check whether our tool is able to solve the Tip of the Tongue (TOT) problem. Just like
JeuxDeMots, our tool can be considered as an on-line game. Like the former, it allows the acquisition of
new relations, enriching thus the (existing) network.
</p>
<p>Mots-cl&#233;s   R&#233;seau lexical, JeuxDeMots, &#233;valuation, outil de MBL, mot sur le bout de la langue
Keywords   Lexical network, JeuxDeMots, evaluation, TOT software, tip of the tongue
</p>
<p>Introduction
</p>
<p>Gr&#226;ce &#224; un nombre important de participants &#224; des jeux en ligne (notamment JeuxDeMots et PtiClic), nous
avons obtenu un r&#233;seau lexical de grande taille pour la langue fran&#231;aise (actuellement plus de 220000
termes1, reli&#233;s par plus d&#8217;un million de relations s&#233;mantiques) repr&#233;sentant une connaissance g&#233;n&#233;rale
commune. La communaut&#233; dispose donc d&#8217;une ressource lexicale dont nous souhaitons &#233;valuer la qualit&#233;.
Une &#233;valuation manuelle pose au moins deux probl&#232;mes : d&#8217;une part, elle peut &#234;tre biais&#233;e par les
comp&#233;tences de l&#8217;&#233;valuateur, et d&#8217;autre part, elle n&#233;cessite un temps prohibitif d&#232;s que l&#8217;on souhaite
effectuer une &#233;valuation quelque peu cons&#233;quente. Nous aurions pu envisager une &#233;valuation automatique
par comparaison avec une r&#233;f&#233;rence, mais &#224; notre connaissance une telle r&#233;f&#233;rence n&#8217;existe pas, du moins
</p>
<p>1
 Un terme peut &#234;tre constitu&#233; de plusieurs mots (par exemple : &#233;toile de mer)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JOUBERT, LAFOURCADE, SCHWAB, ZOCK
</p>
<p>pour la langue fran&#231;aise, ayant une couverture et un nombre de types de relation suffisant. L'&#233;valuation
manuelle par &#233;chantillonnage ne nous semble pas satisfaisante car elle est n&#233;cessairement trop r&#233;duite, trop
ponctuelle et d'une qualit&#233; difficile &#224; appr&#233;cier. Nous avons donc d&#233;cid&#233; d'&#233;valuer notre ressource, via un
logiciel de d&#233;termination du &#171; mot sur le bout de la langue &#187; (MBL), &#233;valuation qui pourrait &#234;tre faite de
fa&#231;on permanente et avec un grand nombre d'&#233;valuateurs en simple aveugle (ces derniers ne sachant pas
qu'ils &#233;valuent). Notre r&#233;seau lexical repr&#233;sentant des connaissances g&#233;n&#233;rales, un tel logiciel doit
s&#8217;appliquer &#224; un domaine ouvert, &#224; savoir du vocabulaire tout venant, y compris des termes peu courants.
Compte tenu du caract&#232;re s&#233;mantique du r&#233;seau lexical, l&#8217;outil de MBL op&#232;rera exclusivement de mani&#232;re
quasi-s&#233;mantique, utilisant essentiellement des associations d&#8217;id&#233;es, des relations ontologiques ou celles de
typicalit&#233;. Un mode d'acc&#232;s par la phon&#233;tique, voire la notion de r&#233;bus, est donc exclu.
</p>
<p>Nous commencerons cet article en pr&#233;sentant d&#8217;abord la probl&#233;matique du MBL, pour rappeller ensuite
bri&#232;vement le processus de constitution de notre r&#233;seau lexical, avant de pr&#233;senter notre outil de MBL,
d&#233;nomm&#233; AKI2. Enfin, nous commenterons les r&#233;sultats obtenus gr&#226;ce &#224; AKI pour &#233;valuer notre r&#233;seau
lexical. 
</p>
<p>1 Probl&#233;matique
</p>
<p>Difficult&#233; de l'&#233;valuation - Nous sommes confront&#233;s au probl&#232;me d'&#233;valuation de donn&#233;e lexicale, o&#249;
aucun standard de r&#233;f&#233;rence n'est disponible et o&#249; une l'&#233;valuation manuelle n'est pas envisageable. Dans un
premier temps, on serait tent&#233; de r&#233;pondre aux questions de compl&#233;tude et de pr&#233;cision (exactitude) : 
</p>
<p>&#8226; notre r&#233;seau lexical est-il &#171; complet &#187;, &#224; savoir comporte-t-il &#171; tous &#187; les termes et &#171; toutes &#187; les
relations ? 
</p>
<p>&#8226; n&#8217;y a-t-il pas dans notre r&#233;seau des termes ou des relations erron&#233;s ?
</p>
<p>Bien &#233;videmment, la r&#233;ponse stricte &#224; ces deux questions est n&#233;gative, ne serait-ce qu&#8217;en raison du caract&#232;re
&#233;volutif de la langue ; par exemple, le terme r&#233;volution de jasmin n&#8217;est apparu qu&#8217;en janvier 2011.
Cependant, nous pouvons d&#233;gager une question plus r&#233;aliste :
</p>
<p>&#8226; pour chaque terme de notre r&#233;seau lexical, l'ensemble des relations qu'il entretient avec d'autres
termes suffit-il &#224; le caract&#233;riser de fa&#231;on unique ?
</p>
<p>Dans l'affirmative, tout terme est susceptible d'&#234;tre retrouv&#233; via un ensemble r&#233;duit de termes indices. Ceci
&#233;tant, nous avons cr&#233;&#233; un outil de &quot;mot sur le bout de la langue&quot; (MBL) pour r&#233;aliser cette &#233;valuation.
</p>
<p>2 Le probl&#232;me du &#8216;mot sur le bout de la langue&#8217; (MBL)
Le terme &quot;manque de mot&quot; d&#233;signe &#224; la fois l'absence de terme dans le dictionnaire mental (Aitchison,
2003) d'un locuteur, ainsi que l'incapacit&#233; de pouvoir y acc&#233;der &#224; temps. Nous nous int&#233;ressons ici
uniquement &#224; ce dernier cas. Le manque de mot, est une situation connue par tout producteur de langue
notamment &#224; l'oral (discours spontan&#233;). Cette d&#233;faillance sera qualifi&#233;e d'anomie, d'Alzheimer, ou de mot
sur le bout de la langue (MBL), selon la dur&#233;e et la fr&#233;quence du blocage et selon la nature d'information
accessible (s&#233;mantique, phonologique) au moment crucial, la production &#233;crite ou orale.
</p>
<p>L&#8217;expression &#171; avoir le mot sur le bout de la langue &#187; (MBL) &#187; ou, son analogue anglais, &#171; it&#8217;s on the tip of
my tongue &#187; (TOT), d&#233;crivent une forme de blocage tr&#232;s particulier. Un locuteur cherchant &#224; exprimer une
id&#233;e est conscient de conna&#238;tre le terme, il sent sa production imminente (le plus gros du travail &#233;tant
accompli), pourtant, il &#233;choue tout pr&#232;s de la fin. La derni&#232;re partie est inaccessible. Tel un &#233;ternuement non
consomm&#233;, la forme sonore reste bloqu&#233;e, et la traduction du sens en forme linguistique n&#8217;aboutit pas. Ce
qui caract&#233;rise le MBL et ce qui le distingue d'autres formes de manque de mot3 c&#8217;est que le locuteur conna&#238;t
2 http://www.lirmm.fr/jeuxdemots/AKI.php
3 Comme indiqu&#233;, il y a d&#8217;autres cas de figure d&#8217;&#233;chec lexical. L&#8217;un, o&#249; le locuteur ignore tout simplement
</p>
<p>le mot recherch&#233; (cas fr&#233;quent en langue &#233;trang&#232;re), et l&#8217;autre, o&#249; il conna&#238;t le terme, mais il n&#8217;arrive pas
&#224; l&#8217;&#233;voquer &#224; temps : c&#8217;est le blanc ou le vide total, situation typique pour des mots rares ou tr&#232;s
techniques. D'ailleurs, beaucoup de gens utilisent le terme de MBL de mani&#232;re g&#233;n&#233;rique, voulant lui faire
endosser tout type de manque de mot. Ceci est impropre, car il peut y avoir diff&#233;rentes raisons pour</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUATION ET OUTIL DE MOT SUR LE BOUT DE LA LANGUE
</p>
<p>le terme, qu&#8217;il en est conscient et que le terme recherch&#233; est imminent, d&#8217;o&#249; l&#8217;expression, &#8216;sur le bout de la
langue&#8217; (Brown &amp; McNeill, 1966). Que le locuteur connaisse le terme est d&#233;montrable. Soit il le produit
spontan&#233;ment peu de temps apr&#232;s (en g&#233;n&#233;ral dans la journ&#233;e), reconnaissant par ailleurs, et souvent avec
soulagement, que c&#8217;est bien le terme recherch&#233;, soit il l&#8217;identifie dans une liste, t&#226;che qu&#8217;il effectue avec une
vitesse et certitude &#233;tonnante (taux d&#8217;erreurs extr&#234;mement faible).
</p>
<p>D'autres particularit&#233;s du MBL sont le fait que le locuteur, sait &#233;norm&#233;ment de choses concernant le mot-cible
bien qu'il soit incapable de le produire : fragments de sens ou fonctions pratiques (&#8216;cela sert &#224; s&#8217;orienter lors
d'une navigation en mer&#8217;), informations syntaxiques (cat&#233;gorie lexicale : nom/verbe ; genre grammatical :
masculin/f&#233;minin), informations morphologiques (type et origine de l&#8217;affixe) ; informations phonologiques
(contour intonatif, nombre de syllabes, premi&#232;re et derni&#232;re syllabe).
</p>
<p>Les informations donn&#233;es par les personnes se trouvant dans cet &#233;tat ont souvent &#233;t&#233; utilis&#233;es par des
psychologues comme argument pour construire et justifier un mod&#232;le de production lexicale. La plupart des
chercheurs s&#8217;accordent pour dire qu&#8217;il y a deux &#233;tapes se succ&#233;dant avec, ou sans, chevauchement (Levelt et
al. 1999; Ferrand, 1998 ; mais voir &#233;galement Caramazza, 1997). L&#8217;une consiste &#224; d&#233;terminer le lemme
(pour un sens donn&#233; on choisit une forme lexicale, qui elle est abstraite), l&#8217;autre a pour fonction de
d&#233;terminer la forme concr&#232;te (forme morphologique, graph&#233;mique ou phonologique), le lex&#232;me. Si
l&#8217;encha&#238;nement de ces deux &#233;tapes se fait g&#233;n&#233;ralement en continu, donc sans interruption, des probl&#232;mes
peuvent survenir. Ainsi, il se peut que la premi&#232;re &#233;tape se d&#233;roule correctement mais pas la seconde, auquel
cas on aboutit &#224; l&#8217;&#233;tat nomm&#233; MBL : l&#8217;information s&#233;mantique et grammaticale &#233;tant disponibles
int&#233;gralement, mais pas l&#8217;information graphique ou phonologique. Bien entendu, on peut aussi imaginer que
l'acc&#232;s s&#233;mantique soit d&#233;ficient, auquel cas il est logiquement impossible d'acc&#233;der &#224; la forme
phonologique, car, &#224; moins de ne r&#233;p&#233;ter un mot, il est impossible d'avoir acc&#232;s &#224; sa forme phonologique
sans en avoir d&#233;termin&#233; le sens.
</p>
<p>Etant donn&#233; la faiblesse de la trace phonologique on pourrait &#234;tre tent&#233; &#224; vouloir renforcer celle-ci, et c'est
bien ce que certains psychologues ont sugg&#233;r&#233; (Abrams et al., 2007). Pourtant, ce n'est pas la voie que nous
allons emprunter ici et il y a pour cela plusieurs raisons.
</p>
<p>L'analyse d'erreurs (Rossi, 2001)4 et l'&#233;tude du ph&#233;nom&#232;ne du MBL sugg&#232;rent que l'acc&#232;s lexical se fait par
deux voies : par le sens et par la forme (notamment les sons, phon&#232;mes). Ceci dit, l'acc&#232;s par le sens
(boisson-vin) n'exclut nullement l'acc&#232;s par des termes associ&#233;s, par exemple, le terme 'vin' activant le terme
'fromage'. Pourtant, le terme 'vin' n'est pas un &#233;l&#233;ment de sens du terme 'fromage'. C'est une co-occurrence,
ou si l'on pr&#233;f&#232;re, c'est une association sur l'axe syntagmatique. Outre cette co-occurrence, les deux termes
entretiennent une relation s&#233;mantique (ou encyclop&#233;dique : 'en mangeant du fromage on boit du vin'). Deux
autres points m&#233;ritant &#234;tre rappel&#233;s sont l'aspect relationnel des termes (ils sont du type associatifs : un
terme x pouvant &#233;voquer un terme y avec une probabilit&#233; z) et leur organisation sous forme de graphe. Ces
deux caract&#233;ristiques sont capitales, et elles offrent plusieurs avantages :
</p>
<p>&#8226; le fait que des termes soient li&#233;s &#233;largit le champ de recherche : chaque terme source (mot donn&#233; en
entr&#233;e) active un ensemble de termes associ&#233;s (termes cibles potentiels), ensemble susceptible de
contenir le terme recherch&#233;;
</p>
<p>&#8226; le fait que les termes soient organis&#233;s sous forme de graphe permet leur acc&#232;s par diff&#233;rents
chemins. Si cette forme de repr&#233;sentation introduit une certaine redondance dans la repr&#233;sentation
des donn&#233;es, elle a l'immense m&#233;rite de permettre de retrouver le bon chemin, au cas o&#249; l'on se
serait tromp&#233; &#224; un certain embranchement, situation gu&#232;re possible, ou du moins beaucoup plus
compliqu&#233;e, dans le cas d'arborescences.
</p>
<p>causer cette forme de blocage. Produire un mot suppose avoir effectu&#233; des traitements &#224; diff&#233;rents
niveaux (conceptuels, s&#233;mantiques, phonologiques). Or, l'&#233;chec (erreur, incompl&#233;tude) &#224; n'importe
lequel de ces niveaux peut bloquer la machine et produire ce qu'on appelle manque de mot. Le terme MBL
ne d&#233;crit qu'une situation tr&#232;s particuli&#232;re : le blocage se situe uniquement au niveau phonologique
(informations erron&#233;es, informations manquantes), les informations venant des autres niveaux &#233;tant
g&#233;n&#233;ralement disponibles dans leur int&#233;gralit&#233;.
</p>
<p>4 Des erreurs comme '&#224; ma gauche' au lieu de '&#224; ma droite' et '&#233;lision' &#224; la place de 'illusion' illustrent ces
deux voies d'acc&#232;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JOUBERT, LAFOURCADE, SCHWAB, ZOCK
</p>
<p>En somme, lorsqu'on est en &#233;tat de MBL on peut essayer de retrouver un terme via d'autres termes
phonologiquement proches (acc&#232;s par la forme, Abrams, 2007; Zock; 2002), mais aussi via des termes ayant
un lien s&#233;mantique. Nous nous sommes int&#233;ress&#233;s ici uniquement &#224; cette derni&#232;re solution.
</p>
<p>2.1 Hypoth&#232;ses de travail
</p>
<p>Il semble difficile de distinguer les deux usages suivants d'une application de MBL : 1) l'utilisation comme un
utilitaire afin de retrouver un terme, 2) l'usage ludique de type devinette. Les motivations pour le second
usage sont variables, mais en g&#233;n&#233;ral visent &#224; &#171;mettre en difficult&#233; le syst&#232;me &#187;.
</p>
<p>Il semble a priori difficile de savoir si les utilisateurs abordent notre outil de fa&#231;on utilitaire ou ludique.
Plut&#244;t qu'effectuer une &#233;tude approfondie sur cette question (&#233;tude sans doute longue, difficile et co&#251;teuse),
nous allons donc consid&#233;rer ces deux activit&#233;s comme identiques. Plus pr&#233;cis&#233;ment, nous partons des deux
hypoth&#232;ses suivantes :
</p>
<p>&#8226; Hypoth&#232;se 1 : les termes recherch&#233;s par les utilisateurs de notre jeu MBL sont des termes de
fr&#233;quence moyenne ou faible (termes de difficult&#233;5 moyenne ou importante). Les utilisateurs sont
vraiment int&#233;ress&#233;s &#224; trouver le terme recherch&#233;.
</p>
<p>&#8226; Hypoth&#232;se 2 : le vocabulaire cibl&#233; est de basse et de moyenne fr&#233;quence (termes de difficult&#233;
moyenne ou importante). Les joueurs cherchent &#224; v&#233;rifier l'efficacit&#233; de l'outil.
</p>
<p>Etant donn&#233; que le vocabulaire qui d&#233;clenche le MBL et celui avec lequel les joueurs de MBL jouent sont
identiques, cela nous am&#232;ne &#224; postuler que &#171; l'&#233;valuation d'un outil de MBL peut se faire gr&#226;ce &#224; des
joueurs &#187;.
</p>
<p>Par ailleurs, une seconde hypoth&#232;se de travail consiste &#224; dire que l'&#233;ventail de comportements des joueurs
est comparable &#224; celui des personnes ayant r&#233;ellement besoin de retrouver un mot. A savoir, leur motivation
consiste &#224; essayer de pi&#233;ger l'outil soit avec un terme simple et des indices &#224; la marge, soit avec un terme
rare, improbable, ou r&#233;cent, et des indices plus directs. On peut donc raisonnablement conclure qu'une telle
&#233;valuation est plus d&#233;favorable que celle portant sur des cas r&#233;els de MBL et qu'elle caract&#233;rise une ligne
basse : l'&#233;valuation d'un outil de MBL via  un jeu fournit une valeur plancher de ses performances.
</p>
<p>Ce sont ces deux hypoth&#232;ses que nous tenterons de v&#233;rifier dans la suite de cet article.
</p>
<p>3 Constitution du r&#233;seau lexical
</p>
<p>3.1 JeuxDeMots6 : construction du r&#233;seau
</p>
<p>Le principe de base conduisant gr&#226;ce &#224; un jeu en ligne &#224; la construction progressive du r&#233;seau lexical, &#224;
partir d&#8217;une base de termes pr&#233;existante, a d&#233;j&#224; &#233;t&#233; d&#233;crit par (Lafourcade et Joubert, 2009). Une partie se
d&#233;roule entre deux joueurs, en double aveugle et en asynchrone. Pour un m&#234;me terme cible T et une m&#234;me
consigne C (synonymes, domaines, association libre&#8230;), les deux joueurs proposent des termes
correspondant, selon eux, &#224; cette consigne C appliqu&#233;e &#224; ce terme T. Ces propositions sont limit&#233;es en
nombre, ce qui a pour effet d&#8217;augmenter leur pertinence, mais &#233;galement dans le temps pour favoriser leur
caract&#232;re spontan&#233;. Nous m&#233;morisons alors les r&#233;ponses communes &#224; ces deux joueurs7. Les validations sont
5 Nous faisons &#233;galement l&#8217;hypoth&#232;se que ce que nous appelons la difficult&#233; d&#8217;un terme est contra-variante
</p>
<p>&#224; sa fr&#233;quence, la difficult&#233; d&#8217;un terme exprimant &#224; la fois la difficult&#233; &#224; trouver des indices s&#8217;y
rapportant mais &#233;galement la difficult&#233; &#224; faire &#233;merger ce terme chez un interlocuteur.
</p>
<p>6 http://jeuxdemots.org
7 La limitation dans le temps de la saisie des propositions des joueurs peut favoriser les fautes
</p>
<p>d&#8217;orthographe, mais, comme nous ne m&#233;morisons que les r&#233;ponses communes aux deux joueurs d&#8217;une
m&#234;me partie, l&#8217;exp&#233;rience montre que ce risque est tr&#232;s limit&#233; et que seules subsistent les fautes
d&#8217;orthographes qui de toutes fa&#231;ons auraient &#233;t&#233; faites par les joueurs (par exemple : beau pour bot, en
parlant de pied).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUATION ET OUTIL DE MOT SUR LE BOUT DE LA LANGUE
</p>
<p>donc faites par concordance des propositions entre paires de joueurs pour un m&#234;me couple (C,T). Ce
processus de validation rappelle celui utilis&#233; par (von Ahn et Dabbish, 2004) pour l&#8217;indexation d&#8217;images ou
plus r&#233;cemment par (Lieberman et al., 2007) pour la collecte de &#171; connaissances de bon sens &#187;. &#192; notre
connaissance, il n&#8217;avait jamais &#233;t&#233; mis en &#339;uvre dans le domaine de la construction des r&#233;seaux lexicaux.
</p>
<p>La structure du r&#233;seau lexical ainsi obtenu s&#8217;appuie sur les notions de n&#339;uds et de relations entre n&#339;uds,
selon un mod&#232;le initialement pr&#233;sent&#233; par (Collins et Quillian, 1969) et davantage explicit&#233; par (Polgu&#232;re,
2006). Chaque n&#339;ud du r&#233;seau est constitu&#233; d&#8217;une unit&#233; lexicale (terme, raffinement d&#8217;un terme ou segment
textuel) li&#233;e aux autres termes via des relations des fonctions lexicales, telles que pr&#233;sent&#233;es par (Mel&#8217;&#269;uk et
al., 1995). Les relations obtenues gr&#226;ce &#224; l&#8217;activit&#233; des joueurs sont typ&#233;es et pond&#233;r&#233;es8 : elles sont typ&#233;es
par la consigne impos&#233;e aux joueurs, elles sont pond&#233;r&#233;es en fonction du nombre de paires de joueurs qui
les ont propos&#233;es, comme indiqu&#233; dans (Lafourcade et Joubert, 2009). Plusieurs exemples de relations
acquises ont &#233;t&#233; donn&#233;s dans (Lafourcade et Joubert, 2009). Au moment du lancement de JeuxDeMots en
juillet 2007, le r&#233;seau comportait 152 000 termes (non reli&#233;s entre eux, c'est-&#224;-dire aucune relation
n'existait). Courant mars 2011, &#224; l&#8217;issue d'environ 900 000 parties jou&#233;es par plus de 2500 joueurs, notre
r&#233;seau compte 229 000 termes et plus de 1 100 000 relations.
</p>
<p>3.2 PtiClic : consolidation du r&#233;seau
</p>
<p>De mani&#232;re analogue &#224; JeuxDeMots (JDM), une partie de PtiClic (http://pticlic.org) se d&#233;roule, en double
aveugle et asynchrone, entre deux joueurs. Un premier joueur se voit proposer un terme cible T, origine de
relations, ainsi qu&#8217;un nuage de mots provenant de l&#8217;ensemble des termes reli&#233;s &#224; T dans le r&#233;seau lexical
produit par JDM. Plusieurs consignes correspondant &#224; des types de relations sont &#233;galement affich&#233;es. Le
joueur associe, par cliquer-glisser, des mots du nuage aux consignes auxquelles il pense qu&#8217;ils
correspondent. Ce m&#234;me terme T, ainsi que le m&#234;me nuage de mots et les m&#234;mes consignes, sont &#233;galement
propos&#233;s &#224; un deuxi&#232;me joueur. Selon un principe analogue &#224; celui mis en place pour JDM, seules les
propositions communes aux deux joueurs sont prises en compte, renfor&#231;ant ainsi les relations du r&#233;seau
lexical.
</p>
<p>Contrairement &#224; JDM, PtiClic est un jeu ferm&#233; o&#249; les utilisateurs ne peuvent pas proposer de nouveaux
termes, mais sont contraints de choisir parmi ceux affich&#233;s. Ce choix de conception a pour but de r&#233;duire le
bruit d&#251; aux termes mal orthographi&#233;s ou aux confusions de sens. PtiClic r&#233;alise donc une consolidation des
relations produites par JDM et permet de densifier le r&#233;seau lexical. Notons &#233;galement que PtiClic permet
de cr&#233;er de nouvelles relations entre termes pr&#233;c&#233;demment reli&#233;s par au moins une relation d&#8217;un autre type
(m&#234;me si ce n&#8217;est pas l&#8217;objectif premier de ce logiciel). Afin de r&#233;duire le silence correspondant aux termes
non propos&#233;s par les utilisateurs de JDM, (Zampa et Lafourcade, 2009) ont sugg&#233;r&#233; de g&#233;n&#233;rer le nuage de
mots &#224; l&#8217;aide de la LSA, en utilisant un corpus externe de grand volume (l&#8217;exp&#233;rimentation r&#233;alis&#233;e utilise
un corpus comportant une ann&#233;e du journal &#171; Le Monde &#187;.). Cette solution permet d&#8217;augmenter le r&#233;seau
lexical par ajout de nouvelles relations, en proposant aux joueurs de nouveaux termes cibles sans liens &#224; T
dans le r&#233;seau. 
</p>
<p>3.3 Raffinement des termes : enrichissement du r&#233;seau
</p>
<p>Le processus permettant d&#8217;aboutir aux raffinements de termes est d&#233;crit dans (Lafourcade et Joubert, 2010).
Nous avons fait l&#8217;hypoth&#232;se que les sens d&#8217;usage, plus commun&#233;ment appel&#233;s usages, d&#8217;un terme
correspondent dans le r&#233;seau aux diff&#233;rentes cliques auxquelles ce terme appartient. Cette approche est
analogue &#224; celle d&#233;velopp&#233;e par (Ploux et Victorri, 1998) &#224; partir de dictionnaires de synonymes. En
calculant la similarit&#233; entre les diff&#233;rentes cliques d&#8217;un m&#234;me terme, nous pouvons construire son arbre des
usages nomm&#233;s. La racine de l&#8217;arbre regroupe tous les sens de ce terme. Plus on s&#8217;&#233;loigne de la racine,
c&#8217;est-&#224;-dire plus la profondeur des n&#339;uds dans l&#8217;arbre est importante, plus on rencontre des distinctions
fines d&#8217;usages. Les n&#339;uds de profondeur 1 dans cet arbre correspondent g&#233;n&#233;ralement aux diff&#233;rents sens de
ce terme r&#233;pertori&#233;s dans les dictionnaires traditionnels. Apr&#232;s un processus de validation par un expert
</p>
<p>8 Une relation peut donc &#234;tre consid&#233;r&#233;e comme un quadruplet : terme source, terme cible, type et poids
de la relation. Entre deux m&#234;mes termes, plusieurs relations de types (et de poids) diff&#233;rents peuvent
exister.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JOUBERT, LAFOURCADE, SCHWAB, ZOCK
</p>
<p>lexicographe de ces diff&#233;rents sens, nous les int&#233;grons dans le r&#233;seau en tant que n&#339;uds de raffinement du
terme consid&#233;r&#233; ; le r&#233;seau est ainsi enrichi de nouveaux n&#339;uds &#224; partir desquels ou vers lesquels les joueurs
de JDM peuvent cr&#233;er des relations. Actuellement, sur les 229 000 termes connus par le r&#233;seau, pr&#232;s de
5 000 ont &#233;t&#233; raffin&#233;s.
</p>
<p>4 Un algorithme et un outil de MBL
</p>
<p>AKI est un outil d'acc&#232;s lexical accessible sur le Web &#224; partir du portail JeuxDeMots ou directement &#224;
http://www.lirmm.fr/jeuxdemots/AKI.php. AKI peut &#234;tre envisag&#233; comme un jeu : l&#8217;utilisateur fait &#8243;deviner&#8243;
un terme cible &#224; l&#8217;ordinateur (esp&#233;rant, &#233;ventuellement, de mani&#232;re secr&#232;te, de mettre en d&#233;faut sa capacit&#233; &#224;
trouver un terme &#224; partir d&#8217;indices). AKI peut &#233;galement &#234;tre consid&#233;r&#233; comme une assistance, pour
retrouver un terme qu&#8217;on a sur le bout de la langue. L&#8217;utilisateur est invit&#233; &#224; fournir, un par un, une
succession de termes indices qui lui paraissent pertinents pour trouver le terme cible recherch&#233;. Ce
m&#233;canisme est comparable &#224; celui de certains jeux t&#233;l&#233;vis&#233;s. Apr&#232;s chacun de ces termes indices AKI fait
une proposition. Si elle correspond au terme recherch&#233;, l&#8217;utilisateur valide la proposition, sinon il introduit
un nouvel indice. Ce dialogue se poursuit jusqu&#8217;&#224; ce que l&#8217;une des deux situations se produise : AKI trouve
le terme cible ou il abandonne et demande &#224; l&#8217;utilisateur de fournir la solution.
</p>
<p>4.1 AKI : principe et r&#233;alisation
</p>
<p>L&#8217;utilisateur saisit un premier terme indice i1. En utilisant le r&#233;seau lexical, l&#8217;algorithme calcule la signature
lexicale de i1 : S(i1) = S1 = t1, t2, &#8230; o&#249; les ti sont tri&#233;s par activation d&#233;croissante. Autrement dit, t1 est le
terme pour lequel la somme des poids des relations le liant &#224; i1 est la plus &#233;lev&#233;e. La premi&#232;re proposition
d&#8217;AKI, p1, correspond &#224; ce terme : p1 = t1. Si c&#8217;est le terme cible, l&#8217;utilisateur le valide et la partie est
termin&#233;e, sinon, il est retir&#233; de la signature S1, ainsi que i1 (qui ne peut pas &#234;tre le terme cible). Donc, &#224; ce
stade, la signature courante est : S&#8217;1 = S1 &#8211; {p1, i1}. L&#8217;utilisateur est alors invit&#233; &#224; saisir un deuxi&#232;me terme
indice i2. L&#8217;algorithme calcule une deuxi&#232;me signature lexicale par intersection entre la signature courante et
celle de i2 : S2 = (S&#8217;1 &#8745; S(i2)) &#8211; i2.
</p>
<p>Le terme propos&#233; p2 est celui de S2 dont l&#8217;activation est la plus forte. Autrement dit, parmi les termes reli&#233;s &#224;
la fois &#224; i1 et &#224; i2, AKI affiche celui pour lequel la somme des poids des relations le reliant &#224; i1 et &#224; i2 est la
plus &#233;lev&#233;e, exception faite des termes d&#233;j&#224; propos&#233;s par AKI pour cette partie (ainsi que des termes
indices !). La signature courante est alors S&#8217;2 = S2 &#8211; p2. D&#8217;une fa&#231;on g&#233;n&#233;rale, &#224; l&#8217;&#233;tape n, nous avons : 
</p>
<p>Sn = (S&#8217;n-1 &#8745; S(in)) &#8211; in   et   S&#8217;n = Sn &#8211; pn
o&#249; in est le n-i&#232;me indice fourni par l&#8217;utilisateur et pn la n-i&#232;me proposition de AKI. Le nombre de termes
constituant la signature diminue donc au fur et &#224; mesure de l&#8217;insertion d&#8217;indices. Il est fr&#233;quent que la
signature devienne vide, avant m&#234;me que le terme cible n&#8217;ait &#233;t&#233; trouv&#233; ; dans ce cas l&#224;, AKI ne peut plus
proposer de terme. Le processus pourrait s&#8217;arr&#234;ter l&#224;, mais afin d&#8217;am&#233;liorer le taux de rappel, une
&#8243;proc&#233;dure de rattrapage&#8243; est mise en &#339;uvre : au lieu d'effectuer des intersections de signatures, on utilise
leur somme :
</p>
<p>Sn = (S&#8217;n-1 + S(in)) &#8211; in   et   S&#8217;n = Sn &#8211; pn
Cette proc&#233;dure favorise l&#8217;apprentissage en cr&#233;ant des relations entre des termes isol&#233;s. Aussi utile soit elle,
cette astuce doit n&#233;anmoins &#234;tre utilis&#233;e avec pr&#233;caution. En effet, au-del&#224; de quelques it&#233;rations, le nombre
de termes constituant la nouvelle signature devient vite prohibitif ; notre exp&#233;rience tend &#224; montrer qu&#8217;il ne
faut pas d&#233;passer deux it&#233;rations. Au del&#224;, l'algorithme donne des propositions trop &#233;loign&#233;es des mots
propos&#233;s. Le processus se termine lorsque AKI a trouv&#233; le terme cible recherch&#233;, ou lorsque la signature
lexicale courante devient vide (ce qui est relativement rare, compte tenu de la proc&#233;dure de rattrapage). &#192;
partir de 5 indices (cette limite de 5 &#233;tant un param&#232;tre modifiable) l'utilisateur a la possibilit&#233; d'abandonner
en indiquant &#224; AKI qu'il fait fausse route. En effet, nous avons estim&#233; que si, au bout de 5 indices, AKI n&#8217;a
pas trouv&#233; le terme recherch&#233;, cela signifie probablement que ces indices ne sont pas pertinents. La figure 1
pr&#233;sente quelques exemples de parties.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUATION ET OUTIL DE MOT SUR LE BOUT DE LA LANGUE
</p>
<p>Les utilisateurs d'AKI ont la possibilit&#233; de faire pr&#233;c&#233;der leur indice de mot-cl&#233; faisant r&#233;f&#233;rence &#224; des
fonctions lexico-s&#233;mantiques. Actuellement il est possible d'utiliser dix fonctions : hyperonymie,
hyponymie, synonymie, antonymie, domaine, mati&#232;re, lieu (lieu typique o&#249; l'on peut trouver ce que l'on
cherche), caract&#233;ristique, holonymie, m&#233;ronymie. Elles correspondent toutes &#224; un type de relation existant
dans le r&#233;seau JeuxDeMots.
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1 : Quelques exemples de parties. Dans les trois premiers cas, AKI a trouv&#233; le terme cible. Dans le
quatri&#232;me cas, ne pouvant plus faire de proposition, AKI a abandonn&#233; et l&#8217;utilisateur a saisi la bonne
</p>
<p>r&#233;ponse (il s&#8217;agissait donc d&#8217;une utilisation ludique de AKI).
</p>
<p>4.2 Consolidation du r&#233;seau
</p>
<p>Dans l&#8217;hypoth&#232;se jeu, quand le terme cible n&#8217;a pas &#233;t&#233; trouv&#233; par AKI, l&#8217;utilisateur est invit&#233; &#224; le saisir. Il y
a alors cr&#233;ation dans le r&#233;seau lexical de relations typ&#233;es &#171; AKI &#187; avec un poids tr&#232;s faible (+1 &#224; chaque
occurrence). Ces relations sont r&#233;guli&#232;rement v&#233;rifi&#233;es et valid&#233;es (ou non) par un expert lexicographe. En
effet, dans la mesure o&#249; c&#8217;est l&#8217;utilisateur lui-m&#234;me qui choisit le terme cible, ainsi que les termes indices, la
s&#233;curit&#233; de la pertinence de telles relations peut difficilement &#234;tre garantie (un joueur peut toujours
commettre des erreurs, sans parler d&#8217;&#233;ventuels joueurs malveillants). Ceci est diff&#233;rent de JeuxDeMots o&#249;
les relations sont cr&#233;&#233;es par intersections de propositions de joueurs. Ici, il arrive fr&#233;quemment qu&#8217;un
utilisateur joue plusieurs fois le m&#234;me terme, avec des indices diff&#233;rents mais &#233;galement avec des indices
communs. Nous sommes en train de r&#233;fl&#233;chir comment s&#233;curiser ces relations typ&#233;es &#171; AKI &#187;.
</p>
<p>5 Evaluation du r&#233;seau via AKI
</p>
<p>&#201;valuation informelle - Nous avons men&#233; une &#233;valuation informelle des performances d'AKI &#224; partir du
jeu de soci&#233;t&#233; Tabou invers&#233;. Le principe du jeu de soci&#233;t&#233; Tabou est de faire deviner un terme &#224; des
personnes &#224; l'aide d'indices, en excluant certains termes dits tabous. La version commerciale de ce jeu
fournit une collection de 500 fiches comprenant chacune un terme cible et 5 termes tabous. La version
invers&#233;e de ce jeu consiste &#224; faire deviner le mot cible en &#233;num&#233;rant ces termes tabous, l'hypoth&#232;se &#233;tant que
ces termes sont particuli&#232;rement &#233;vocateurs du terme cible lorsqu&#8217;ils apparaissent ensemble. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JOUBERT, LAFOURCADE, SCHWAB, ZOCK
</p>
<p>Ceci &#233;tant, nous avons soumis cette collection de 500 fiches &#224; AKI ainsi qu&#8217;&#224; trois personnes (&#224; des fins de
comparaisons). AKI a retrouv&#233; le terme cible au plus tard au bout des 5 indices dans 494 cas (soit 98,8% de
r&#233;ussite). Les personnes prises comme r&#233;f&#233;rences, ont globalement trouv&#233; (dans les m&#234;mes conditions) 402
fois (soit 80,4% de r&#233;ussite). Ce dernier chiffre n&#8217;est qu&#8217;une indication, vue la faible taille de l&#8217;&#233;chantillon
consid&#233;r&#233;, de trois participants.
</p>
<p>5.1 Protocole
</p>
<p>L&#8217;&#233;valuation, tout comme l&#8217;apprentissage, ne se fait qu&#8217;en fonction de ce que les joueurs ont renseign&#233;. Elle
se fait donc sur du vocabulaire appartenant &#224; la classe ouverte. Comme d&#233;j&#224; mentionn&#233;, AKI peut &#234;tre
envisag&#233; comme un jeu ou un outil de MBL. A priori, notre logiciel ne sait pas faire la distinction entre les
deux usages. En effet, sur une seule partie et si AKI trouve la solution, nous ne pouvons pas savoir a priori
si l&#8217;utilisateur connaissait ou s'il recherchait le terme cible. Par contre, si dans un laps de temps relativement
court (de l&#8217;ordre de quelques minutes) un m&#234;me terme est jou&#233; plusieurs fois, nous pouvons faire
l&#8217;hypoth&#232;se qu&#8217;il s&#8217;agit d&#8217;une utilisation de type jeu (au moins &#224; partir de la deuxi&#232;me partie) o&#249; l&#8217;utilisateur
essaie de faire trouver le terme cible par AKI, en proposant g&#233;n&#233;ralement des indices diff&#233;rents. Dans
chacun des deux cas, jeu ou outil de MBL, les termes cibles sont majoritairement des termes de fr&#233;quence
moyenne, voire faible. En effet, jouer pour trouver un mot fr&#233;quent ne pr&#233;sente pas un grand int&#233;r&#234;t, et
g&#233;n&#233;ralement on ne recherche pas gr&#226;ce &#224; un outil de MBL un terme courant. Les graphiques ci-apr&#232;s
montrent l&#8217;&#233;volution dans le temps du rapport entre le nombre de parties gagn&#233;es par AKI, parties o&#249;
l&#8217;utilisateur a indiqu&#233; que le logiciel a trouv&#233; le terme cible, et le nombre de parties jou&#233;es. Les graphiques
de cette section refl&#232;tent 6522 parties r&#233;alis&#233;es entre le 30/12/2010 et le 24/01/2011.
</p>
<p>5.2 Analyse quantitative et &#233;volution dans le temps
</p>
<p>Le premier graphique (figure 2) pr&#233;sente l'&#233;volution du rapport entre le nombre de parties gagn&#233;es et le
nombre de parties jou&#233;es par fen&#234;tre glissante de 500. Par exemple, &#224; l'abscisse 100 (correspondant &#224; 2000
parties), la courbe correspond &#224; la moyenne des valeurs entre les parties 1501 et 2000. Lorsqu'il y a moins
de 500 valeurs, la courbe pr&#233;sente la moyenne des n premi&#232;res valeurs. Ce graphique montre globalement
une l&#233;g&#232;re am&#233;lioration des r&#233;sultats au cours du temps, avec un passage de 60% de r&#233;ussite &#224; 80%.
</p>
<p>Nous avons analys&#233; le type de mots jou&#233;s par les utilisateurs. Nous avons consid&#233;r&#233; comme courants les
mots issus de l'&#233;chelle orthographique Dubois Buyse9, c'est-&#224;-dire, ceux connus par un enfant de 12 ans.
Nous consid&#233;rions les autres comme normaux. Par exemple, fourchette, pie, &#233;cureuil, restaurant sont
courants, tandis que s&#233;quoia g&#233;ant, Rabat ou m&#234;me Akinator sont consid&#233;r&#233;s comme des termes normaux.
On peut consid&#233;rer que globalement, les termes normaux ont une fr&#233;quence d'utilisation allant de moyen &#224;
rare (les mots courants ayant une fr&#233;quence d'utilisation &#233;lev&#233;e). L'analyse des parties jou&#233;es, ainsi que le
nombre de mots diff&#233;rents nous r&#233;v&#232;le que dans les deux cas, environ 25% concerne des mots courants : sur
1701 mots diff&#233;rents jou&#233;s, 435 sont courants (soit 25,6%) et sur 6488 parties, 1565 concernent des mots
courants (24,1%). Il est important de noter que les mots sont ceux qui &#233;taient d&#233;j&#224; bien complets dans le
r&#233;seau lexical de JDM. On remarquera que l'addition pond&#233;r&#233;e par le nombre de parties des deux courbes
(figures 3 et 4) donne la courbe de la figure 2.
</p>
<p>Sur les parties jou&#233;es sur des mots courants, on observe globalement une stagnation des r&#233;sultats, preuve
que le r&#233;seau &#233;tait d&#233;j&#224; bien complet. Ce qui n&#8217;exclut pas que le r&#233;seau ait &#233;t&#233; enrichi de nouveaux r&#233;sultats,
bien que ceux-ci soient tr&#232;s peu visibles. En revanche, en ce qui concerne les mots normaux (ceux qui ne
sont pas consid&#233;r&#233;s comme courants), la progression est bien plus claire. Alors qu'au d&#233;part, la moyenne &#224;
1000 &#233;tait inf&#233;rieure &#224; 60%, elle atteint 80% &#224; la fin. &#192; quoi est due cette progression ? Une premi&#232;re
explication possible serait que les joueurs d&#233;couvrent AKI ; et ce n&#8217;est que petit &#224; petit qu&#8217;ils r&#233;ussissent &#224;
proposer des indices pertinents. Ceci est quelque peu contredit par l&#8217;exp&#233;rience : en effet, il semble que les
joueurs essaient de plus en plus de proposer des indices indirects afin de &#171;mettre le syst&#232;me en d&#233;faut &#187;. Il
9 L'&#233;chelle orthographique Dubois Buyse permet d'indiquer les mots normalement acquis par 75% des
</p>
<p>enfants d'une classe d'&#226;ge. Nous consid&#233;rons donc comme vocabulaire courant les mots bien
orthographi&#233;s par 75% des enfants de 12 ans. On peut trouver cette liste, entres autres, &#224;
http://o.bacquet.free.fr/db2.htm </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUATION ET OUTIL DE MOT SUR LE BOUT DE LA LANGUE
</p>
<p>nous parait plus plausible que cette progression serait due &#224; la capacit&#233; d&#8217;apprentissage du syst&#232;me. Cette
hypoth&#232;se serait bien entendu &#224; v&#233;rifier sur un plus long terme mais le nombre de relations acquises lors de
cette exp&#233;rience semble la corroborer.  
</p>
<p>Figure 2 : Graphique montrant l&#8217;&#233;volution dans le temps du rapport entre le nombre de parties AKI gagn&#233;es 
et le nombre de parties jou&#233;es (moyenne glissante sur les 500 derni&#232;res parties jou&#233;es)
</p>
<p>Figure 3 et 4 : A gauche, l&#8217;&#233;volution dans le temps du rapport entre le nombre de parties gagn&#233;es et le
nombre de parties jou&#233;es sur des mots courants  (moyenne glissante sur les 500 derni&#232;res parties jou&#233;es) -
A droite, l&#8217;&#233;volution dans le temps du rapport entre le nombre de parties gagn&#233;es et le nombre de parties
</p>
<p>jou&#233;es sur des mots de fr&#233;quence moyenne &#224; faible (moyenne glissante sur les 500 derni&#232;res parties
jou&#233;es)
</p>
<p>Acquisition de termes. Depuis le 1er janvier 2011, 208 nouveaux termes ont &#233;t&#233; ins&#233;r&#233;s dans le r&#233;seau
lexical via AKI. Ils r&#233;sultent de 724 parties jou&#233;es. La quasi-totalit&#233; (90%) de ces termes sont des entit&#233;s
nomm&#233;es (DCRI, R&#233;volution de jasmin, Noob, ...), ou (10%) des termes compos&#233;s et des n&#233;ologismes divers
(sexe par surprise, gaz lacrymog&#232;ne,&#8230;), souvent li&#233;s &#224; l'actualit&#233;.  
</p>
<p>Acquisition de relations. Depuis le 1er janvier 2011, 11434 relations on &#233;t&#233; acquises &#224; l'aide de AKI (6546
parties). Si on ne compte que celles absentes du r&#233;seau, ce nombre tombe &#224; 2105. Donc, en moyenne le
r&#233;seau acquiert 1 nouvelle relation toutes les trois parties.
</p>
<p>5.3 Analyse qualitative des parties
</p>
<p>Sur le type de vocabulaire. Le vocabulaire (apr&#232;s une premi&#232;re analyse) se d&#233;coupe en nombre de parties
jou&#233;es en 24% de mots courants, le reste se divisant en 50% de mots de fr&#233;quence moyenne ou faible, et
26% de termes souvent nouveaux et li&#233;s &#224; l'actualit&#233;. On peut consid&#233;rer que ce dernier groupe est &#224;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JOUBERT, LAFOURCADE, SCHWAB, ZOCK
</p>
<p>rapprocher des 50% si on partitionne les termes entre mots courants et les autres. Les termes li&#233;s &#224; l'actualit&#233;
conduisent souvent (69%) &#224; un &#233;chec ce qui semble normal, &#233;tant donn&#233; qu'il s'agit de termes nouveaux (par
exemple : R&#233;volution de jasmin, Jean-Luc M&#233;lenchon, M&#233;diator - essentiellement des entit&#233;s nomm&#233;es) ou
de termes d&#233;j&#224; connus, mais recherch&#233;s via des indices nouveaux (pr&#233;sident, Tunisie, fuite =&gt; Ben Ali).
Certains mots d&#233;j&#224; connus de AKI, c'est-&#224;-dire pr&#233;sents dans le r&#233;seau lexical, sont r&#233;actualis&#233;s par
l'actualit&#233; : trafic d'organes, Lance Armstrong, aspartame. Le compte sur l'ensemble des termes jou&#233;s
(ind&#233;pendamment du nombre de parties) donne environ la m&#234;me r&#233;partition de 1/4 de vocabulaire courant et
de 3/4 de termes rares ou r&#233;cents.
</p>
<p>Sur les indices propos&#233;s. Le nombre moyen d'indices pour trouver un mot est de 2,8. Dans 40% des cas, un
terme courant est trouv&#233; d&#232;s le premier indice. Un peu moins de 3% des parties sont poursuivies au-del&#224; de
5 indices, les 97% se divisant entre les trois cas suivants : a) le mot est trouv&#233; avant, b) AKI &#233;choue avant,
ou c) l'utilisateur abandonne. Quand la recherche va au del&#224; de 5 indices, la partie aboutit &#224; une r&#233;ussite
dans 60% des cas. Il s'agit de termes de domaine fortement lexicalis&#233;s, et AKI est sur la bonne voie.
</p>
<p>Une analyse des indices donn&#233;s lors des parties indique que moins de 0,3% des parties comporte au moins
un indice apparemment non coh&#233;rent. Soit l'utilisateur a voulu volontairement mettre le syst&#232;me en d&#233;faut en
donnant un indice sans rapport, soit il s'agit d'une erreur ou d'une confusion. On remarquera (avec
satisfaction) que la quasi totalit&#233; des parties sont jou&#233;es &quot;honn&#234;tement&quot; (ce qui peut s'expliquer par le
manque d'int&#233;r&#234;t &#224; mettre en d&#233;faut le syst&#232;me avec des indices absurdes). On peut grouper les indices
propos&#233;s en deux cat&#233;gories :
</p>
<p>&#8226; les indices frontaux (not&#233; F) sont ceux qui am&#232;nent rapidement &#224; la solution (trois indices au
maximum). Dans le r&#233;seau, ils sont fortement connect&#233;s &#224; la solution, en g&#233;n&#233;ral de fa&#231;on
bidirectionnelle. Par exemple : f&#233;lin pour chat.
</p>
<p>&#8226; les indices lat&#233;raux (not&#233;s L) sont ceux qui sont tr&#232;s faiblement connect&#233;s &#224; la solution et par
ailleurs beaucoup plus fortement connect&#233;s &#224; d'autres termes. Par exemple : lisse, blanc, froid pour
lavabo.
</p>
<p>Les parties concernant les mots courants correspondent &#224; des parties dont la s&#233;quence type est : L+ (une
succession d'indices lat&#233;raux). Plus le terme cible devient rare ou r&#233;cent, plus la s&#233;quence type se rapproche
de F+ (une succession d'indices frontaux). Il existe quelques autres sch&#233;mas de parties, mais qui restent fort
minoritaires. Les sch&#233;mas les plus notables sont :
</p>
<p>&#8226; L+ : uniquement des indices lat&#233;raux : gar&#231;on, caillou, oiseau, miette pour Le Petit Poucet.
&#8226; F+ : uniquement des indices frontaux : sang ou couleur pour rouge ou encore mammif&#232;re, marin,
</p>
<p>d&#233;fense pour morse.
&#8226; L+, F : une s&#233;rie d'indices lat&#233;raux puis un dernier indice de type frontal permettant de trouver la
</p>
<p>solution : blanc, lisse, dur, &#233;l&#233;phant pour ivoire.
On peut raisonnablement supposer que le sch&#233;ma L+, F correspond &#224; une activit&#233; ludique, plut&#244;t qu'&#224; une
activit&#233; utilitaire. C'est sans doute &#233;galement le cas pour le premier sch&#233;ma, lorsqu'il s'agit de termes
fr&#233;quents.
</p>
<p>Sur le type d'activit&#233;. Pouvons nous d&#233;duire de l'activit&#233; enregistr&#233;e qu'il s'agit d'une activit&#233; ludique ou
d'un usage MBL ? Sans doute seulement partiellement. En revanche, de nombreux indices nous portent &#224;
croire que la plupart des parties enregistr&#233;es lors de notre exp&#233;rience rel&#232;vent du jeu. Nous savons que les
liens partag&#233;s par nous ou des joueurs des r&#233;seaux sociaux Facebook et Twitter10, ont g&#233;n&#233;r&#233; 60% de
l'activit&#233; de AKI. Ces liens proposaient de jouer tel ou tel mot. L'envoi du lien vers AKI &#224; des listes de
diffusion professionnelles (laboratoires, enseignements, soci&#233;t&#233;s savantes) g&#233;n&#233;rait une forte augmentation
du trafic (pratiquement les autres 40%). &#192; moins de ne penser que toutes ces personnes cherchaient le m&#234;me
mot &#224; ce moment pr&#233;cis, on peut supposer que l'immense majorit&#233; de l'activit&#233; de AKI rel&#232;ve du jeu.
Toujours pour aller dans ce sens, nous n'avons eu directement que deux t&#233;moignages attestant une utilisation
non ludique ; dans ces deux cas, AKI s&#8217;est r&#233;v&#233;l&#233; fort utile puisqu&#8217;il a donn&#233; satisfaction aux utilisateurs. 
</p>
<p>10 Pour voir en temps r&#233;el le compte des parties d'AKI, http://twitter.com/#!/Tot_aki </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUATION ET OUTIL DE MOT SUR LE BOUT DE LA LANGUE
</p>
<p>5.4 Conclusion de l'&#233;valuation
</p>
<p>&#192; l'aune des r&#233;sultats ci-dessus, il ne nous est pas permis de conclure avec certitude que les hypoth&#232;ses 1 et
2 pr&#233;sent&#233;es au d&#233;but de cet article sont globalement valides, mais elles ne sont pas invalid&#233;es pour autant.
De nombreux indices nous laissent penser que quasiment toutes les parties analys&#233;es proviennent du jeu et
non d'une utilisation r&#233;elle. Nous avons &#233;galement montr&#233; que le vocabulaire utilis&#233; durant ces jeux &#233;tait le
m&#234;me vocabulaire que celui faisant l&#8217;objet du MBL. Ceci permet de valider notre premi&#232;re hypoth&#232;se de
travail, &#224; savoir, que l'&#233;valuation d'un outil de MBL peut se faire gr&#226;ce &#224; des joueurs. En revanche, notre
seconde hypoth&#232;se de travail &#8212;(l'&#233;ventail des comportements des utilisateurs jouant avec un outil de MBL
inclut le comportement de ceux ayant r&#233;ellement besoin de retrouver un mot)&#8212; demanderait une analyse
plus fine.
</p>
<p>Le r&#233;seau et sa consolidation via l'activit&#233; g&#233;n&#233;r&#233;e avec AKI permettent, dans le cas de vocabulaire
compl&#232;tement ouvert, de trouver le terme dans 78% des cas. Dans le cas de vocabulaire consid&#233;r&#233; comme
courant, on se situe aux alentours de 82%. Enfin, dans le cas de vocabulaire filtr&#233; (issu du jeu Tabou
invers&#233;), on atteint 98,8%. On notera que, dans ce dernier cas, la performance des &#234;tres humains se situe aux
alentours de 80%.
</p>
<p>Nous avons &#233;valu&#233; les performances de cinq personnes sur du vocabulaire tout venant. A cette fin, nous
avons choisi au hasard pour chacun d'eux 100 termes parmi ceux jou&#233;s dans AKI et pour lesquels ce dernier
avait soit majoritairement trouv&#233; (50 termes) soit &#233;chou&#233; (50 termes). Les indices donn&#233;s &#233;taient les 5
termes les plus fortement associ&#233;s dans le r&#233;seau. La performance globale a &#233;t&#233; de 46%, chiffre &#224; comparer
avec les 75-80% d'AKI.
</p>
<p>Conclusion
</p>
<p>Nous avons construit un r&#233;seau lexical &#233;volutif de grande taille gr&#226;ce &#224; l&#8217;activit&#233; d&#8217;utilisateurs jouant en
ligne (projet JeuxDeMots). Ces joueurs n&#8217;&#233;tant a priori pas des sp&#233;cialistes, ce r&#233;seau repr&#233;sente un
ensemble de connaissances g&#233;n&#233;rales communes. Avec des joueurs experts, il serait envisageable d&#8217;&#233;tendre
ces connaissances, et donc le r&#233;seau, &#224; des domaines sp&#233;cialis&#233;s (n&#8217;est-ce pas d&#233;j&#224; en partie le cas ?).
L&#8217;intervention d&#8217;experts lexicographes, limit&#233;e &#224; certaines corrections ainsi qu&#8217;&#224; la validation des
raffinements de termes, est &#8243;n&#233;gligeable&#8243; compte tenu de la taille du r&#233;seau. Les questions concernant
l'&#233;valuation de la qualit&#233; d'une telle ressource, celles concernant son utilit&#233;, et la forme que peut prendre
cette &#233;valuation  restent cependant ouvertes.
</p>
<p>Le but poursuivi ici &#233;tait d&#8217;&#233;valuer la ressource lexicale ainsi produite &#224; l'aide d'un logiciel (d&#233;nomm&#233; AKI).
Celui-ci peut &#234;tre consid&#233;r&#233; soit comme un jeu, soit comme un outil de MBL avec une approche
exclusivement s&#233;mantique et lexicale. A l'heure actuelle, il n'y a aucune prise en compte de facteurs
morphologiques ou phonologiques. AKI permet donc une &#233;valuation &#224; grande &#233;chelle du r&#233;seau par les
utilisateurs eux-m&#234;mes, qu'ils soient ou non des joueurs ayant contribu&#233; via JeuxDeMots. Quel que soit
l&#8217;ensemble des termes consid&#233;r&#233;s (termes courants ou termes de fr&#233;quence plus r&#233;duite) les performances
d&#8217;AKI sont d&#8217;environ 80% &#177; 5%. Les r&#233;sultats montrent par ailleurs que AKI est r&#233;ellement utile,
permettant de trouver des termes dans une ressource existante, tout en &#233;tant susceptible de l'enrichir gr&#226;ce &#224;
sa capacit&#233; d'apprentissage.
</p>
<p>On peut d&#233;duire des performance de AKI que 75% des termes pour lesquels il a &#233;t&#233; sollicit&#233; sont bien
index&#233;s, en tout cas suffisamment bien pour permettre le bon choix en cas de d&#233;sambigu&#239;sation lexicale
(avocat: profession vs. fruit). L'&#233;valuation se poursuit au long cours et les participants cherchant
constamment &#224; mettre en d&#233;faut AKI renforcent l'indexation, mais &#233;galement l'&#233;valuation avec une s&#233;v&#233;rit&#233;
croissante &#8211; les deux se compensant. Il y a un auto-ajustement des joueurs en faveur d'indices faisant partie
de la longue tra&#238;ne. Une question restant cependant ouverte est de savoir &#224; quel taux de r&#233;ussite AKI va
asymptotiquement plafonner. Cette valeur pourrait &#234;tre un indice concernant une performance maximale en
d&#233;sambigu&#239;sation lexicale en utilisant notre ressource.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JOUBERT, LAFOURCADE, SCHWAB, ZOCK
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABRAMS L., TRUNK D. L., &amp; MARGOLIN S. J. (2007). Resolving tip-of-the-tongue states in young and older
adults: The role of phonology. IN L. O. RANDAL (ED.), Aging and the Elderly: Psychology, Sociology, and
Health (pp. 1-41). HAUPPAUGE, NY: NOVA SCIENCE PUBLISHERS, INC.
VON AHN L., DABBISH L. (2004). Labelling Images with a Computer Game. ACM Conference on Human
Factors in Computing Systems (CHI). pp. 319-326
AITCHISON J. (2003). Words in the Mind: an Introduction to the Mental Lexicon. OXFORD, BLACKWELL.
BROWN R. &amp; MCNEILL D. (1966). The &quot;tip-of-the-tongue&quot; phenomenon. Journal of Verbal Learning and
Verbal Behavior, 5, pp. 325-337.
CARAMAZZA A. (1997). &#171; How many levels of processing are there in lexical access ? &#187; Cognitive
Neuropsychology, 14, pp. 177-208. 
COLLINS A, QUILLIAN M.R. (1969). Retrieval time from semantic memory. Journal of verbal learning and
verbal behaviour, 8(2), pp. 240-248.
FERRAND L. (1998). Encodage phonologique et production de la parole. L'ann&#233;e psychologique. vol. 98, n&#176;3.
pp. 475-509.
JI H., PLOUX S. AND WEHRLI E. (2003) Lexical knowledge representation with contexonyms. In Proceedings
of the 9th MT summit, pp. 194-201
LAFOURCADE M., JOUBERT A. (2009). Similitude entre les sens d&#8217;usage d&#8217;un terme dans un r&#233;seau lexical.
Traitement Automatique des Langues, vol.50/1, pp. 177-200
LAFOURCADE M., JOUBERT A. (2010). D&#233;termination et pond&#233;ration des raffinements d&#8217;un terme &#224; partir de
son arbre des usages nomm&#233;s. Traitement Automatique des Langues Naturelles (TALN&#8217;10). Montr&#233;al, 6 p.
LEVELT W., ROELOFS A. &amp; A. MEYER. (1999). A theory of lexical access in speech production. Behavioral
and Brain Sciences, 22, 1-75. 
LIEBERMAN H., SMITH D.A., TEETERS A. (2007). Common Consensus: a web-based game for collecting
commonsense goals. International Conference on Intelligent User Interfaces (IUI&#8217;07). Hawa&#239;, USA.
MEL&#8217;&#268;UK I.A., CLAS A., POLGU&#200;RE A. (1995). Introduction &#224; la lexicologie explicative et combinatoire.
Editions Duculot AUPELF-UREF
MILLER G.A., BECKWITH R., FELLBAUM C., GROSS D. AND MILLER K.J. (1990). Introduction to WordNet: an on-
line lexical database , International Journal of Lexicography, 3 (4), pp. 235-244.
PLOUX S., VICTORRI B. (1998). Construction d&#8217;espaces s&#233;mantiques &#224; l&#8217;aide de dictionnaires de synonymes.
Traitement Automatique des Langues, vol.39/1, 161-182
POLGU&#200;RE A. (2006). Structural properties of Lexical Systems : Monolingual and Multilingual Perspectives.
Proceedings of the Workshop on Multilingual Language Resources and Interoperability (Coling/ACL),
Sydney, pp. 50-59.
ROSSI M. (2001) : Les lapsus et la production de la parole. Psychologie Fran&#231;aise, n&#176; 46, pp. 27-41.
SITBON L. (2007). Combinaisons de ressources linguistiques pour l'aide &#224; l'acc&#232;s lexical : &#233;tudes de
faisabilit&#233;, actes de RECITAL 2007, 5-8 juin 2007, Toulouse, France
SOWA J. (1992). Semantic networks, Encyclopedia of Artificial Intelligence, edited by S.C. Shapiro, Wiley,
New York
SPENCE D.P. &amp; OWENS K.C. (1990). Lexical co-occurrence and association strength, Journal of
Psycholinguistic Research, 19 (5)
ZAMPA V., LAFOURCADE M. (2009). Evaluations compar&#233;es de deux m&#233;thodes d&#8217;acquisition lexicale et
ontologique : JeuxDeMots vs Latent Semantic Analysis. XVI&#232;mes rencontre de Rochebrune : ontologie et
dynamique des syst&#232;mes complexes, perspectives interdisciplinaires
ZOCK M., FERRET O., SCHWAB D. (2010) Deliberate word access : an intuition, a roadmap and some prelimin-
ary empirical results, In A. Neustein (&#233;d.) &#8216;International Journal of Speech Technology&#8217;, 13(4):107-117,
2010. Springer Verlag.
ZOCK M. (2002). Sorry, what was your name again, or how to overcome the tip-of-the tongue problem with
the help of a computer? SemaNet workshop (Building and Using Semantic Networks), Coling, Taipei, pp.
107-112.</p>

</div></div>
</body></html>