<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;couverte de patrons paraphrastiques en corpus comparable: une approche bas&#233;e sur les n-grammes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>D&#233;couverte de patrons paraphrastiques en corpus comparable: une
approche bas&#233;e sur les n-grammes
</p>
<p>Bruno Cartoni1 Louise Del&#233;ger2
(1)D&#233;partement de Linguistique, Universit&#233; de Gen&#232;ve
</p>
<p>(2)Division of Biomedical Informatics, Cincinnati Children&#8217;s Hospital Medical Center
bruno.cartoni@unige.ch, louise.deleger@cchmc.org
</p>
<p>R&#233;sum&#233;. Cet article pr&#233;sente l&#8217;utilisation d&#8217;un corpus comparable pour l&#8217;extraction de patrons de para-
phrases. Nous pr&#233;sentons une m&#233;thode empirique bas&#233;e sur l&#8217;appariement de n-grammes, permettant d&#8217;extraire
des patrons de paraphrases dans des corpus comparables d&#8217;une m&#234;me langue (le fran&#231;ais), du m&#234;me domaine (la
m&#233;decine) mais de registres de langues diff&#233;rents (sp&#233;cialis&#233; ou grand public). Cette m&#233;thode confirme les r&#233;sul-
tats pr&#233;c&#233;dents bas&#233;s sur des m&#233;thodes &#224; base de patrons, et permet d&#8217;identifier de nouveaux patrons, apportant
&#233;galement un regard nouveau sur les diff&#233;rences entre les discours de langue g&#233;n&#233;rale et sp&#233;cialis&#233;e.
</p>
<p>Abstract. This paper presents the use of a comparable corpus for extracting paraphrase patterns. We present
an empirical method based on n-gram matching and ordering, to extract paraphrase pattern in comparable corpora
of the same language (French) and the same domaine, but of two different registers (lay and specialised). This
method confirms previous results from pattern-based methods, and identify new patterns, giving fresh look on the
difference between specialised and lay discourse.
</p>
<p>Mots-cl&#233;s : Identification de paraphrases, extraction de patrons, type de discours, domaine m&#233;dical, corpus
comparable monolingue.
</p>
<p>Keywords: paraphrase identification, lexico-syntactic pattern discovery, discourse type, medical domain,
monolingual comparable corpora.
</p>
<p>1 Introduction
</p>
<p>Cet article pr&#233;sente une &#233;tude bas&#233;e sur un corpus comparable compos&#233; de textes de deux types de discours diff&#233;-
rents (sp&#233;cialis&#233; ou grand public) mais d&#8217;un m&#234;me domaine (m&#233;decine) et dans une m&#234;me langue (fran&#231;ais) per-
mettant d&#8217;explorer empiriquement le ph&#233;nom&#232;ne de la paraphrase et de valider des travaux ant&#233;rieurs. On peut d&#233;-
finir les paraphrases comme des expressions linguistiques poss&#233;dant une signification similaire. La compr&#233;hension
des m&#233;canismes de paraphrase est un &#233;l&#233;ment-cl&#233; de nombreuses applications du TALN comme l&#8217;extraction d&#8217;in-
formation (Shinyama &amp; Sekine, 2003), le r&#233;sum&#233; automatique (Barzilay, 2003) et la simplification de textes (El-
hadad &amp; Sutaria, 2007). Diff&#233;rentes approches ont &#233;t&#233; employ&#233;es pour la d&#233;tection de paraphrases : elles peuvent
varier au niveau du type de corpus utilis&#233;s (parall&#232;le (Barzilay &amp; McKeown, 2001), comparable (Shinyama &amp;
Sekine, 2003)), du type de paraphrases recherch&#233;es (phrastique (Barzilay &amp; Lee, 2003), sous-phrastique (Elhadad
&amp; Sutaria, 2007)) et du type de technique employ&#233;e (alignement de graphes lexicaux (Barzilay &amp; Lee, 2003),
similarit&#233; distributionnelle (Elhadad &amp; Sutaria, 2007), patrons lexico-syntaxiques (Jacquemin, 1999)). Parmi les
approches en corpus comparable, beaucoup s&#8217;appuient sur des corpus journalistiques relatant les m&#234;mes informa-
tions mais provenant de diff&#233;rentes sources (Barzilay &amp; Lee, 2003; Shinyama &amp; Sekine, 2003). Dans le domaine
m&#233;dical, (Elhadad &amp; Sutaria, 2007) travaillent sur un corpus comparable presque parall&#232;le, compos&#233; d&#8217;articles
scientifiques et de leur version &quot;grand public&quot;, pour extraire des paraphrases entre deux types de discours, grand
public vs. sp&#233;cialis&#233;. Dans nos pr&#233;c&#233;dents travaux (Del&#233;ger &amp; Zweigenbaum, 2008; Del&#233;ger &amp; Cartoni, 2010),
nous avons &#233;galement &#233;tudi&#233; l&#8217;extraction de paraphrases entre ces deux types de discours, &#224; l&#8217;aide de patrons
lexicaux pr&#233;-d&#233;finis bas&#233;s sur des ancrages de type morphos&#233;mantique (verbe / nom d&#233;verbal, adjectif relationnel
/ nom). Dans la pr&#233;sente &#233;tude, nous prolongeons ces travaux en adoptant une approche moins &quot;supervis&#233;e&quot; per-
mettant de d&#233;couvrir de nouveaux patrons de paraphrases, et de confirmer la pertinence des paraphrases utilis&#233;es
dans nos approches &#224; base de patrons. Cette approche se fonde sur le rep&#233;rage d&#8217;identit&#233; entre des n-grammes</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BRUNO CARTONI, LOUISE DEL&#201;GER
</p>
<p>lexicaux racinis&#233;s. Une fois rep&#233;r&#233; les paraphrases candidates, une &#233;tape de g&#233;n&#233;ralisation est effectu&#233;e, bas&#233;e sur
les parties du discours, pour identifier des patrons. Ces patrons sont ensuite &#233;valu&#233;s en terme de fr&#233;quence et de
qualit&#233;, ainsi que dans leur sp&#233;cialisation, dans le discours sp&#233;cialis&#233; (ci-apr&#232;s sp&#233;) ou grand public (gp).
</p>
<p>2 Description de la m&#233;thode
</p>
<p>Corpus comparable utilis&#233; : Le terme &quot;corpus comparable&quot; d&#233;finit une collection de textes partageant des
caract&#233;ristiques communes. Il s&#8217;agit souvent de textes r&#233;dig&#233;s dans deux langues diff&#233;rentes mais sur des sujets
identiques. Mais les corpus comparables peuvent &#233;galement &#234;tre monolingues (Barzilay &amp; Lee, 2003; Shinyama &amp;
Sekine, 2003; Elhadad &amp; Sutaria, 2007). Ici nous utilisons un corpus comparable monolingue en fran&#231;ais compos&#233;
de textes de deux types de discours (sp&#233;cialis&#233; ou grand public) appartenant au m&#234;me domaine (la m&#233;decine). Ce
corpus porte sur trois sous-domaines pr&#233;cis : le diab&#232;te, le cancer et le tabac (la constitution du corpus est d&#233;crite
plus en d&#233;tail dans (Del&#233;ger &amp; Zweigenbaum, 2008)). Le tableau 1 pr&#233;sente les informations statistiques sur le
corpus. Le corpus a &#233;galement &#233;t&#233; &#233;tiquet&#233; morpho-syntaxiquement et lemmatis&#233;, en utilisant le Treetagger 1 et le
lemmatiseur du fran&#231;ais Flemm 2.
</p>
<p>Diab&#232;te Tabac Cancer Corpus total
S G S G S G S G
</p>
<p>phrases 29,692 44,799 25,460 40,840 10,838 13,389 65,990 99,028
occurrences 581,100 581,712 604,206 604,309 228,784 228,793 1,414,090 1,414,805
</p>
<p>TABLE 1 &#8211; Tailles des corpus (Nbr. de mots ; S=Sp&#233;cialis&#233;, G=grand public)
</p>
<p>Extraction des n-grammes : Nous avons tout d&#8217;abord extrait des n-grammes dans chaque partie du corpus
(sp&#233; et gp) en utilisant le &quot;Ngram Statistics Package&quot; (Banerjee &amp; Pedersen, 2003). Nous n&#8217;avons conserv&#233; que
des n-grammes de longueur 2 &#224; 6, que nous avons ensuite filtr&#233;s en fonction de crit&#232;res linguistiques pour qu&#8217;ils
puissent correspondre &#224; un groupe syntaxique (exclusion des ponctuations, des n-grammes se terminant par une
pr&#233;position ou un d&#233;terminant, des n-grammes contenant moins de 2 mots pleins).
</p>
<p>Correspondance lexicale : Nous avons racinis&#233; tous les mots pleins en nous basant sur le package perl Lin-
gua : :Stem 3 (phase de &quot;stemming&quot;). Nous avons ensuite mis en correspondance les n-grammes de deux parties
du corpus, en nous basant sur leur identit&#233; de cha&#238;nes de caract&#232;res, en utilisant une approche &quot;sac de mot&quot; (sans
prendre en compte l&#8217;ordre d&#8217;apparition des mots dans les n-grammes), et en nous restreignant &#224; une identit&#233; exacte
entre les racines. Nous obtenons ainsi un ensemble de paires de n-grammes qui sont nos paraphrases candidates.
</p>
<p>Identification de patrons de paraphrases : L&#8217;&#233;tape suivante consiste &#224; g&#233;n&#233;raliser les paires de n-grammes
pour obtenir des patrons bas&#233;s sur les parties du discours, en gardant une trace du lien entre les mots pleins (par
des indices num&#233;riques). Dans l&#8217;exemple ci-dessous, nous montrons une paire compos&#233;e d&#8217;un n-gramme de la
partie sp&#233;cialis&#233; (&#224; gauche) et d&#8217;un n-gramme de la partie grand public (&#224; droite), et le patron qui en est extrait :
</p>
<p>traitement du patient&#8594; traiter un patient
N1 Prep N2&#8594; V1 Det N2
</p>
<p>L&#8217;orientation des patrons est conserv&#233;e (la partie gauche correspond toujours &#224; la partie sp&#233;cialis&#233;e), ce qui signifie
que nous pouvons trouver des patrons qui pr&#233;sentent une configuration invers&#233;e d&#8217;un autre patron.
</p>
<p>Filtrage et classification des patrons : Les patrons ont ensuite &#233;t&#233; tri&#233;s en fonction de leur fr&#233;quence, c&#8217;-&#224;-d.
le nombre de paraphrases sur lequel ils sont bas&#233;s. Nous avons conserv&#233; uniquement les patrons bas&#233;s sur plus de
10 paraphrases, consid&#233;rant les autres comme peu significatifs. Chaque patron a ensuite &#233;t&#233; soigneusement &#233;valu&#233;
par deux annotateurs ind&#233;pendants (les co-auteurs), en comptant le nombre de paraphrases correctes sur lequel le
</p>
<p>1. http://www.ims.uni-stuttgart.de/projekte/corplex/TreeTagger
2. http://www.univ-nancy2.fr/pers/namer/Telecharger_Flemm.htm
3. http://search.cpan.org/~snowhare/Lingua-Stem-0.83</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#201;COUVERTE DE PATRONS PARAPHRASTIQUES EN CORPUS COMPARABLE
</p>
<p>patron &#233;tait bas&#233;. Cette &#233;valuation fournit une mesure de pr&#233;cision de chaque patron, permettant ainsi d&#8217;exclure
ceux dont la pr&#233;cision est nulle. Ensuite, nous avons class&#233; les patrons selon 4 cat&#233;gories, en fonction du type de
modification mise en &#339;uvre entre les deux parties du patrons, &#224; savoir : une &quot;modification morphos&#233;mantique&quot;
(comme la d&#233;rivation) , une &quot;inversion simple&quot;, une &quot;flexion verbale&quot; (incluant la modification passif-actif), et
une &quot;variation z&#233;ro&quot; (qui comprend les patrons o&#249; seules les terminaisons des mots varient, donc essentiellement
des variations de type flexionnel). Enfin, nous nous sommes &#233;galement int&#233;ress&#233;s &#224; l&#8217;orientation des patrons (sp&#233;
&#8594; gp et/ou gp &#8594; sp&#233;), en distinguant les patrons dont le patron &quot;invers&#233;&quot; avait &#233;galement &#233;t&#233; trouv&#233; (p.ex. N
Adj &#8594; N Prep N et N Prep N &#8594; N Adj ont tous deux &#233;t&#233; extraits), des patrons apparaissant dans un seul sens
(p.ex. seul le sens de patron N Adj &#8594; V Adv a &#233;t&#233; trouv&#233; dans le corpus, dans le sens sp&#233; &#8594; gp). Pour les
patrons bi-directionnels, nous mesurons la diff&#233;rence de fr&#233;quence entre les deux directions, permettant d&#8217;&#233;valuer
la pr&#233;f&#233;rence d&#8217;orientation des patrons de paraphrases, et parfois une pr&#233;f&#233;rence significative dans l&#8217;un des deux
types de discours.
</p>
<p>3 R&#233;sultats
</p>
<p>L&#8217;extraction des n-grammes et l&#8217;appariement lexical, tel que d&#233;crit &#224; la section 2, a permis d&#8217;extraire 10 123
patrons, dont une grande partie provenait d&#8217;un tr&#232;s petit nombre de paires de n-grammes 4. En excluant les patrons
bas&#233;s sur moins de 10 paraphrases, nous obtenons un total de 119 patrons, &#233;tablis &#224; partir d&#8217;un total de 4 976
paraphrases. Cette extraction a &#233;t&#233; soigneusement &#233;valu&#233;e, comme d&#233;crit pr&#233;c&#233;demment.
</p>
<p>3.1 Identification des patrons : tri et classification
</p>
<p>L&#8217;&#233;valuation des patrons en terme de pr&#233;cision nous a permis d&#8217;exclure les patrons dont la pr&#233;cision &#233;tait nulle
(dans 10 cas). Nous obtenons ainsi 109 patrons, regroupant 4 800 paraphrases diff&#233;rentes. La plupart des patrons
sont compos&#233;s de bi-grammes, avec quelques tri-grammes. Nous avons ensuite tri&#233; les patrons en fonction du
nombre de paragraphes correctes, et en fonction de la typologie pr&#233;sent&#233;e &#224; la section 2. Le tableau 2 pr&#233;sente les
r&#233;sultats de la classification et le tableau 3 pr&#233;sente les 20 premiers patrons. 5
</p>
<p>Type de patrons de paraphrase Nombre % Pr&#233;cision moyenne
Morphos&#233;mantique (M) 43 39.55 0.65
Inversion simple (I) 32 29.36 0.63
Flexion verbale (V) 25 22.95 0.76
Variation z&#233;ro (N) 9 8.26 0.55
Total 109 100% 0.66
</p>
<p>TABLE 2 &#8211; 4 cat&#233;gories de patrons de paraphrases
</p>
<p>La cat&#233;gorie la plus importante est celle des patrons &quot;morphos&#233;mantiques&quot; (ce qui n&#8217;est pas surprenant pour une
approche bas&#233;e sur des racines), suivi des &quot;variations simples&quot; et des &quot;flexions verbales&quot;. De plus, cette cat&#233;gorie
est la plus fr&#233;quente dans les patrons les plus haut class&#233;s. Ces patrons &quot;morphos&#233;mantiques&quot; impliquent un chan-
gement de cat&#233;gorie lexicale pour un (ou plusieurs) &#233;l&#233;ment(s) du patron, souvent d&#251; &#224; un proc&#233;d&#233; d&#233;rivationnel,
dans la plupart des cas une d&#233;rivation verbe&#8594;nom et dans une proportion plus faible, une d&#233;rivation nom&#8594;adj.
La cat&#233;gorie &quot;flexion verbale&quot; contient principalement des paraphrases o&#249; le verbe est simplement fl&#233;chi diff&#233;-
remment, mais &#233;galement des variations plus complexes, quand le participe pass&#233; est employ&#233; comme adjectif
(provoquant une inversion, comme dans le patron de rang 10 dans le tableau 3) ou des cas de variations passif-
actif. Les cas d&#8217;inversion simple ont tous une relativement bonne pr&#233;cision, et les erreurs sont principalement dues
&#224; la pr&#233;position employ&#233;e entre les deux &#233;l&#233;ments intervertis, qui peut mener &#224; une paraphrase erron&#233;e. Ce type
de patrons pourrait donc &#234;tre employ&#233; &#224; condition d&#8217;appliquer des contraintes ad&#233;quates sur les pr&#233;positions. Les
variations &quot;z&#233;ro&quot; ne pr&#233;sentent aucune variation particuli&#232;re et leur pr&#233;cision se r&#233;v&#232;le tr&#232;s peu satisfaisante.
</p>
<p>4. 7 492 patrons n&#8217;&#233;taient &#233;tablis qu&#8217;&#224; partir d&#8217;une seule paire
5. Les patrons sont pr&#233;sent&#233;s selon les abr&#233;viations standard, &#224; savoir N=nom, V=verbe, Vpper=participe pass&#233; des verbes, p=pr&#233;position,
</p>
<p>A=adjectif, ADV=adverbe. Les indices (1, 2) indiquent quels &#233;l&#233;ments ont &#233;t&#233; mis en correspondance dans les deux parties du patrons.
Rappelons &#233;galement que les d&#233;terminants ne sont pas pris en compte dans les patrons</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BRUNO CARTONI, LOUISE DEL&#201;GER
</p>
<p>Rang Para. Pr&#233;c. Patrons (sp&#233;c./grand public) Exemple Cat.
corr.
</p>
<p>1 331 0.88 N_1 P N_2 / V_1 N_2 retard de cicatrisation / retarder la cicatrisation M
2 183 0.94 V_1 N_2 / N_1 p N_2 calculer les co&#251;ts / calcul de co&#251;t M
3 177 0.66 N_1 p N_2 / N_1 p N_2 infirmi&#232;re &#224; domicile / infirmiers &#224; domicile N
4 140 0.82 N_1 p N_2 / V_1 p N_2 traitement de l&#8217; affection / traiter des affections M
5 121 0.72 N_1 A_2 / N_1 p N_2 apports caloriques / apport en calories M
6 116 0.92 N_1 Vpper_2 / V_2 N_1 moyens adapt&#233;s / adapter les moyens V
7 96 0.64 N_2 p N_1 / N_1 A_2 complexit&#233; du probl&#232;me / probl&#232;me complexe M
8 92 0.81 N_1 p N_2 / N_2 Vpper_1 administration de produit / produit administr&#233; M
9 88 0.98 V ADV_2 Vpper_1/V_1 A_2 a aussi permis / permettra aussi V
</p>
<p>10 85 1 V_2 N_1 / N_1 Vpper_2 restreindre l&#8217; acc&#232;s / acc&#232;s restreints V
11 83 0.99 V1 ADV2/V ADV2 Vpper1 fournit aussi / &#234;tre aussi fournie V
12 76 0.65 N_1 p N_2 / N_1 A_2 contr&#244;les de la gly&#233;mie / contr&#244;les glyc&#233;miques M
13 67 0.61 V_1 p N_2 / N_1 p N_2 importer des produits / importation de produits M
14 65 0.9 V_2 N_1 / N_1 V Vpper_2 calculer les doses / doses sont calcul&#233;es V
15 62 0.91 V_2 ADV_1 / ADV_1 V_2 am&#233;liore encore / encore am&#233;liorer I
16 60 0.67 N_2 Vpper_1 / N_1 p N_2 aliments transform&#233;s / transformation des aliments M
17 54 0.82 N_1 Vpper_2 / V_2 p N_1 exp&#233;rience acquise / acqu&#233;rir de l&#8217; exp&#233;rience V
18 52 0.95 N_1 A_2 / V_1 ADV_2 traitement ad&#233;quat / traiter ad&#233;quatement M
19 51 0.81 ADV_1 V_2 / V_2 ADV_1 ainsi faciliter / facilite ainsi I
20 51 0.74 N_1 V Vpper_2 / V_2 N_1 efficacit&#233; est renforc&#233;e / renforcer son efficacit&#233; V
</p>
<p>TABLE 3 &#8211; Les 20 patrons les plus fr&#233;quents - Les cat&#233;gories de paraphrases sont : M = morphos&#233;mantique, N =
Variation z&#233;ro, I = inversion , V= flexion verbale
</p>
<p>Notons &#233;galement que la pr&#233;cision moyenne de tous les patrons est de 0,66 (avec une m&#233;diane &#224; 0,69), ce qui est
satisfaisant pour des patrons extraits automatiquement. De plus, il faut souligner que 29 patrons ont une pr&#233;cision
entre 0.9 et 1 (dont 15 qui ont une pr&#233;cision &#224; 1).
</p>
<p>3.2 Les patrons bi-directionnels
</p>
<p>Parmis tous les patrons extraits et &#233;valu&#233;s, nous avons distingu&#233; les patrons qui apparaissaient dans les deux
directions (sp&#233; &#8594; gp et gp &#8594; sp&#233;) des patrons qui n&#8217;apparaissaient que dans une direction. Environ 70% des
patrons (76) apparaissent dans les deux sens, et pour les autres, il se peut que l&#8217;&#233;quivalent dans le sens inverse existe
mais ait &#233;t&#233; exclu dans les &#233;tapes de filtrage pr&#233;c&#233;dentes. Parmi les patrons bi-directionnels, certains montrent une
pr&#233;f&#233;rence pour une direction, comme nous pouvons le constater en regardant le pourcentage des diff&#233;rences entre
le nombre des paraphrases acquises dans l&#8217;une et l&#8217;autre des directions. Le tableau 4 montre les patrons qui ont
les diff&#233;rences les plus significatives (les pourcentages n&#233;gatifs indiquent une pr&#233;f&#233;rence pour la direction gp&#8594;
sp&#233;, et les positifs une pr&#233;f&#233;rence pour la direction sp&#233;&#8594; gp). Ces diff&#233;rences permettent de mettre en &#233;vidence
des patrons particuli&#232;rement ad&#233;quats pour l&#8217;acquisition de paraphrases entre types de discours. Parmi eux, nous
trouvons un certain nombre de variations nom-verbe (comme N_1 P N_2 / N_2 V_1, N_1 P N_2 / V_1 P N_2
etc.) pour la direction sp&#233;cialis&#233;&#8594; grand public, ce qui confirme les hypoth&#232;ses sur lesquelles &#233;taient fond&#233;es nos
pr&#233;c&#233;dents travaux (Del&#233;ger &amp; Zweigenbaum, 2008). Le patron adjectif-nom (N_1 A_2 / N_1 P N_2), &#233;galement
utilis&#233; dans notre &#233;tude (Del&#233;ger &amp; Cartoni, 2010) montre une diff&#233;rence de 37.19%, ce qui reste une pr&#233;f&#233;rence
pour l&#8217;adjectif dans la partie sp&#233;cialis&#233;e, bien que la pr&#233;f&#233;rence ne soit pas aussi importante qu&#8217;attendue 6.
</p>
<p>4 Discussion
</p>
<p>Comme nous l&#8217;avons d&#233;j&#224; mentionn&#233;, l&#8217;extraction de paraphrases en corpus comparable (et particuli&#232;rement de
deux types de discours diff&#233;rents) peut s&#8217;effectuer sur la base de patrons lexicaux pr&#233;-d&#233;finis. La m&#233;thode bas&#233;e
</p>
<p>6. Bien qu&#8217;au del&#224; de notre seuil, ce patron est inclus dans le tableau 4.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#201;COUVERTE DE PATRONS PARAPHRASTIQUES EN CORPUS COMPARABLE
</p>
<p>Patrons diff&#233;rence (%)
N_1 PROrel V_2 / V_2 N_1 -180.00%
N_1 V_2 / Vpper_2 P N_1 -176.92%
ADV_1 N_2 / N_2 A_1 -142.86%
N_1 A_2 / N_2 P N_1 -140.00%
N_1 Vpper_2 / V Vpper_2 P N_1 -90.00%
N_1 P N_2 / N_2 P V_1 -66.67%
N_1 Vpper_2 / Vpper_2 P N_1 -63.64%
N_1 A_2 / V_2 P N_1 -60.00%
N_1 A_2 / N_1 P N_2 37.19 %
N_1 P N_2 / N_2 V_1 50.00%
N_1 P N_2 / V_1 P N_2 52.14%
N_1 P N_2 / V Vpper_1 N_2 62.50%
A_1 N_2 / V_2 P A_1 66.67%
N_1 P N_2 / N_1 P V_2 70.00%
N_1 A_2 / V_1 ADV_2 73.08 %
</p>
<p>TABLE 4 &#8211; Patrons bidirectionnels avec diff&#233;rence significative
</p>
<p>Rank Pr&#233;c. Patrons Exemples
1 0.88 N_1 P N_2 / V_1 N_2 application de principes / appliquer le principe
2 0.94 V_1 N_2 / N_1 P N_2 aggraver une pathologie / aggravation de pathologie
4 0.82 N_1 P N_2 / V_1 P N_2 ajout d&#8217;insuline / ajouter de l&#8217;insuline
8 0.81 N_1 P N_2 / N_2 Vpper_1 administration de produit / produit administr&#233;
</p>
<p>13 0.61 V_1 P N_2 / N_1 P N_2 adopter des strat&#233;gies / adoption d&#8217; une strat&#233;gie
</p>
<p>TABLE 5 &#8211; Exemples de patrons impliquant une variation nom-verbe
</p>
<p>sur les n-grammes pr&#233;sent&#233;e ici permet de valider empiriquement les intuitions qui &#233;taient &#224; l&#8217;origine des patrons
lexicaux pr&#233;-d&#233;finis, et de d&#233;couvrir de nouveaux patrons de paraphrases.
</p>
<p>Validation de patrons pr&#233;-d&#233;finis : Cette m&#233;thode permet de confirmer les patrons pr&#233;-d&#233;finis, non seulement
en terme de fr&#233;quences mais &#233;galement en terme de pr&#233;f&#233;rences. Pour les variations de type nom-verbe, diff&#233;rents
types de patrons ont &#233;t&#233; trouv&#233;s, surtout parmi les patrons les mieux class&#233;s, comme montr&#233; dans le tableau 3.
Le tableau 5 reprend les patrons les plus fr&#233;quents impliquant une variation nom-verbe et montre clairement que
la variation nom-verbe appara&#238;t dans une grande vari&#233;t&#233; de cas, soit avec le verbe/nom dans la position de t&#234;te,
ou avec un changement d&#8217;ordre quand le verbe est un participe pass&#233; qui prend la place de l&#8217;adjectif (p.ex dans
l&#8217;exemple au rang 8).
</p>
<p>Concernant les patrons impliquant des variations adjectif-nom, les adjectifs relationnels semblent favoris&#233;s dans la
partie sp&#233;cialis&#233;e du corpus (la direction N_1 A_2&#8594; N_1 P N_2 est 37.19% plus fr&#233;quent que le patron inverse),
ce qui confirme nos travaux ant&#233;rieurs (Del&#233;ger &amp; Cartoni, 2010).
</p>
<p>D&#233;couverte de nouveaux patrons : Compar&#233; &#224; une approche bas&#233;e sur des patrons pr&#233;d&#233;finis, la m&#233;thode d&#233;-
crite ici permet de mettre en &#233;vidence des nouveaux patrons morphos&#233;mantiques fr&#233;quents. Le tableau 6 pr&#233;sente
quelques uns de ces nouveaux patrons, qui impliquent un adjectif qualificatif (deux premiers exemples) ou deux
variations morphos&#233;mantiques, &#224; savoir une variation nom-verbe impliquant &#233;galement un changement au niveau
du &quot;modifieur&quot; : le nom &#233;tant modifi&#233; par un adjectif, le verbe doit &#234;tre modifi&#233; par l&#8217;adverbe correspondant (total
&#8594; totalement, rang 18). Le patron impliquant un adjectif qualificatif (au rang 23 du tableau 6) montre une pr&#233;-
f&#233;rence d&#8217;orientation : l&#8217;adjectif qualificatif est clairement pr&#233;f&#233;r&#233; dans la partie grand public, alors que la partie
sp&#233;cialis&#233;e pr&#233;f&#232;re la nominalisation de l&#8217;adjectif.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BRUNO CARTONI, LOUISE DEL&#201;GER
</p>
<p>Rang Pr&#233;c. Patrons Exemples
7 0.64 N_2 P N_1 / N_1 A_2 efficacit&#233; d&#8217; un soutien / soutien efficace
23 0.33 N_1 A_2 / N_2 P N_1 acc&#232;s facile / facilit&#233; d&#8217; acc&#232;s
18 0.95 N_1 A_2 / V_1 ADV_2 traitement ad&#233;quat / traiter ad&#233;quatement
53 0.82 V_1 ADV_2 / N_1 A_2 arr&#234;ter totalement / arr&#234;t total
</p>
<p>TABLE 6 &#8211; Exemples de nouveaux patrons
</p>
<p>5 Conclusion
</p>
<p>Nous avons pr&#233;sent&#233; une m&#233;thode d&#8217;extraction de patrons de paraphrases en corpus comparable monolingue,
qui permet d&#8217;une part de valider d&#8217;autres m&#233;thodes d&#8217;extraction bas&#233;es sur des patrons (construits &#224; partir d&#8217;in-
tuitions linguistiques) et d&#8217;autres part de d&#233;couvrir d&#8217;autres patrons. Cette m&#233;thode confirme la fr&#233;quence des
patrons investigu&#233;s pr&#233;c&#233;demment et permet d&#8217;&#233;tudier de mani&#232;re tr&#232;s large les pr&#233;f&#233;rences de direction des pa-
trons (specialis&#233;&#8594; grand public et/ou grand public&#8594; sp&#233;cialis&#233;), apportant un nouveau regard sur la distinction
entre ces diff&#233;rents types de discours. Nous avons ainsi pu confirmer la pertinence des patrons impliquant une
variation nom-verbe, et la pr&#233;f&#233;rence pour la nominalisation dans la partie sp&#233;cialis&#233;e, l&#224; o&#249; la partie grand public
pr&#233;f&#232;re les verbes. Dans une moindre mesure, la pr&#233;f&#233;rence pour l&#8217;adjectif relationnel dans la partie sp&#233;cialis&#233;e a
&#233;galement &#233;t&#233; confirm&#233;e. D&#8217;un point de vue plus large, cette m&#233;thode confirme &#233;galement l&#8217;importance de la mor-
phologie d&#233;rivationnelle dans le ph&#233;nom&#232;ne de la paraphrase. Le nombre important de patrons mettant en jeu un
adverbe doit &#233;galement &#234;tre soulign&#233;. A notre connaissance, aucune &#233;tude ne s&#8217;est pench&#233;e sur l&#8217;adverbialisation
dans un tel contexte.
</p>
<p>L&#8217;approche pr&#233;sent&#233;e ici est bas&#233;e sur l&#8217;appariement de n-grammes ayant le m&#234;me nombre de mots pleins (le
m&#234;me &quot;n&quot;). A l&#8217;avenir, nous envisageons d&#8217;&#233;tendre cette m&#233;thode &#224; des appariements non-univoques (comme pour
des paires 2-grammes=3-grammes, et vice versa). &#201;videmment, cette m&#233;thode pourrait &#233;galement &#234;tre appliqu&#233;e &#224;
d&#8217;autres types de corpus comparable monolingue, construits autour d&#8217;autres distinctions que celle sp&#233;cialis&#233;/grand
public, permettant ainsi de d&#233;couvrir d&#8217;autres patrons de paraphrases sp&#233;cifiques &#224; d&#8217;autres types de discours.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BANERJEE S. &amp; PEDERSEN T. (2003). The design, implementation, and use of the ngram statistics package. In
Proceedings of the Fourth International Conference on Intelligent Text Processing and Computational Linguis-
tics, p. 370&#8211;381, Mexico City.
BARZILAY R. (2003). Information Fusion for Multidocument Summarization : Paraphrasing and Generation.
PhD thesis, Columbia University.
BARZILAY R. &amp; LEE L. (2003). Learning to paraphrase : An unsupervised approach using multiple-sequence
alignment. In HLT-NAACL, p. 16&#8211;23, Edmonton, Canada.
BARZILAY R. &amp; MCKEOWN K. (2001). Extracting paraphrases from a parallel corpus. In ACL/EACL, p. 50&#8211;57.
DEL&#201;GER L. &amp; CARTONI B. (2010). Adjectifs relationnels et langue de sp&#233;cialit&#233; : v&#233;rification d&#8217;une hypoth&#232;se
linguistique en corpus comparable m&#233;dical. In Proceedings of TALN 2010.
DEL&#201;GER L. &amp; ZWEIGENBAUM P. (2008). Paraphrase acquisition from comparable medical corpora of specia-
lized and lay texts. In Proceedings of the AMIA Annual Fall Symposium, p. 146&#8211;150, Washington, DC.
ELHADAD N. &amp; SUTARIA K. (2007). Mining a lexicon of technical terms and lay equivalents. In ACL BioNLP
Workshop, p. 49&#8211;56, Prague, Czech Republic.
IBRAHIM A., KATZ B. &amp; LIN J. (2003). Extracting structural paraphrases from aligned monolingual corpora.
In Proceedings of the second international workshop on Paraphrasing, p. 57&#8211;64, Sapporo, Japan.
JACQUEMIN C. (1999). Syntagmatic and paradigmatic representations of term variation. In Proceedings of the
37th annual meeting of the Association for Computational Linguistics on Computational Linguistics, p. 341&#8211;348,
College Park, Maryland.
SHINYAMA Y. &amp; SEKINE S. (2003). Paraphrase acquisition for information extraction. In Proceedings of the
second international workshop on Paraphrasing (IWP), p. 65&#8211;71, Sapporo, Japan.</p>

</div></div>
</body></html>