<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;veloppement de ressources pour le persan : PerLex 2, nouveau lexique morphologique et MEltfa, &#233;tiqueteur morphosyntaxique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8212; 1er juillet 2011
</p>
<p>D&#233;veloppement de ressources pour le persan : PerLex 2, nouveau lexique
morphologique et MEltfa, &#233;tiqueteur morphosyntaxique
</p>
<p>Beno&#238;t Sagot1 G&#233;raldine Walther2, 3 Pegah Faghiri3 Pollet Samvelian3
(1) Alpage, INRIA &amp; Univ. Paris 7, Rocquencourt, BP 105, 78153 Le Chesnay Cedex, France
</p>
<p>(2) LLF, CNRS &amp; Univ. Paris 7, 5 rue Thomas Mann, 75205 Paris Cedex 13, France
(3) MII, CNRS &amp; Univ. Paris 3, 27 rue Paul Bert, 94204 Ivry-sur-Seine, France
</p>
<p>benoit.sagot@inria.fr, geraldine.walther@linguist.jussieu.fr,
pegah.faghiri@etud.sorbonne-nouvelle.fr, pollet.samvelian@univ-paris3.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons une nouvelle version de PerLex, lexique morphologique du persan, une version
corrig&#233;e et partiellement r&#233;annot&#233;e du corpus &#233;tiquet&#233; BijanKhan (BijanKhan, 2004) et MEltfa, un nouvel &#233;tique-
teur morphosyntaxique librement disponible pour le persan. Apr&#232;s avoir d&#233;velopp&#233; une premi&#232;re version de PerLex
(Sagot &amp; Walther, 2010), nous en proposons donc ici une version am&#233;lior&#233;e. Outre une validation manuelle par-
tielle, PerLex 2 repose d&#233;sormais sur un inventaire de cat&#233;gories linguistiquement motiv&#233;. Nous avons &#233;galement
d&#233;velopp&#233; une nouvelle version du corpus BijanKhan : elle contient des corrections significatives de la tokenisation
ainsi qu'un r&#233;&#233;tiquetage &#224; l'aide des nouvelles cat&#233;gories. Cette nouvelle version du corpus a enfin &#233;t&#233; utilis&#233;e pour
l'entra&#238;nement de MEltfa, notre &#233;tiqueteur morphosyntaxique pour le persan librement disponible, s'appuyant &#224; la
fois sur ce nouvel inventaire de cat&#233;gories, sur PerLex 2 et sur le syst&#232;me d'&#233;tiquetage MElt (Denis &amp; Sagot, 2009).
Abstract. We present a new version of PerLex, the morphological lexicon for the Persian language, a cor-
rected and partially re-annotated version of the BijanKhan corpus (BijanKhan, 2004) and MEltfa, a new freely
available POS-tagger for the Persian language. After PerLex's first version (Sagot &amp; Walther, 2010), we propose
an improved version of our morphological lexicon. Apart from a partial manual validation, PerLex 2 now relies on
a set of linguistically motivated POS. Based on these POS, we also developped a new version of the BijanKhan
corpus with significant corrections of the tokenisation. It has been re-tagged according to the new set of POS. The
new version of the BijanKhan corpus has been used to develop MEltfa, our new freely-available POS-tagger for the
Persian language, based on the new POS set, PerLex 2 and the MElt tagging system (Denis &amp; Sagot, 2009).
Mots-cl&#233;s : Ressource lexicale, validation, &#233;tiqueteur morphosyntaxique, persan, cat&#233;gories, PerLex, MElt.
Keywords: Lexical resource, validation, tagger, Persian, POS, PerLex, MElt.
</p>
<p>1 Introduction
Les ressources lexicales et les outils de pr&#233;-traitement automatique des langues comme les &#233;tiqueteurs morpho-
syntaxiques sont des ressources indispensables pour d&#233;velopper des ressources plus complexes et progresser ra-
pidement dans la description th&#233;orique des langues en donnant acc&#232;s &#224; un nombre plus cons&#233;quent de donn&#233;es.
Malheureusement, ils ne sont que trop rarement librement disponibles, et ce m&#234;me pour des langues ayant un grand
nombre de locuteurs et donc de b&#233;n&#233;ficiaires potentiels. Pour le persan, ce n'est qu'en 2010 que les premiers lexiques
librement disponibles ont commenc&#233; &#224; appara&#238;tre. Notre lexique morphologique PerLex en est un des pr&#233;curseurs.
Nous avions d&#233;velopp&#233; une premi&#232;re version de PerLex (Sagot &amp; Walther, 2010) dont nous proposons desormais
une deuxi&#232;me version partiellement valid&#233;e. PerLex 2 poss&#232;de un nouvel inventaire de cat&#233;gories fond&#233; sur des
choix linguistiques discut&#233;s au sein du projet ANR/DFG franco-allemand PerGram. Le d&#233;veloppement de PerLex 2
s'accompagne de celui d'un &#233;tiqueteur morphosyntaxique, MEltfa, qui s'appuie sur l'&#233;tiqueteur MElt (Denis &amp; Sa-
got, 2009) et sur une nouvelle version du corpus BijanKhan (BijanKhan, 2004), r&#233;sultat de corrections significatives
de la tokenisation et d'un r&#233;&#233;tiquetage selon les nouvelles cat&#233;gories.
Dans cet article, nous exposons les diff&#233;rentes facettes de ce triple travail dans leur succession et leur interaction.
Apr&#232;s une rapide pr&#233;sentation des sp&#233;cificit&#233;s du traitement du persan, nous d&#233;crivons les am&#233;liorations de PerLex</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#63333;&#63342;&#63343;&#63470;&#63348; S&#63329;&#63335;&#63343;&#63348;, G&#63465;&#63346;&#63329;&#63340;&#63332;&#63337;&#63342;&#63333; W&#63329;&#63340;&#63348;&#63336;&#63333;&#63346;, P&#63333;&#63335;&#63329;&#63336; F&#63329;&#63335;&#63336;&#63337;&#63346;&#63337;, P&#63343;&#63340;&#63340;&#63333;&#63348; S&#63329;&#63341;&#63350;&#63333;&#63340;&#63337;&#63329;&#63342;
</p>
<p>effectu&#233;es depuis sa premi&#232;re version, les cat&#233;gories linguistiques retenues et l'inventaire des &#233;tiquettes morpho-
syntaxiques utilis&#233;es par MEltfa. Nous d&#233;taillons ensuite le travail de retokenisation et de r&#233;&#233;tiquetage effectu&#233; sur
le corpus BijanKhan et enfin le d&#233;veloppement et l'entra&#238;nement de notre &#233;tiqueteur morphosyntaxique MEltfa.
</p>
<p>2 Le traitement automatique du persan
Le persan, langue indo-europ&#233;enne du groupe iranien occidental, est parl&#233; par environ 130 millions de locuteurs.
Il s'&#233;crit de droite &#224; gauche avec une variante de l'alphabet arabe. Langue iranienne, le persan se distingue par un
nombre tr&#232;s r&#233;duit de verbes simples (classe ferm&#233;e de 200 unit&#233;s environ). La majorit&#233; des sens habituellement
exprim&#233;s par des pr&#233;dicats verbaux sont exprim&#233;s par des locutions verbales complexes qui constituent un proc&#233;d&#233;
tr&#232;s productif (Samvelian, 2001), et dont la partie verbale subit une flexion parfois simplifi&#233;e par rapport &#224; celle
de verbes simples, n&#233;cessitant ainsi un traitement et une mod&#233;lisation particuli&#232;res. La morphologie nominale
du persan affiche assez peu de formes fl&#233;chies : nombre, &#201;zaf&#233; (marqueur de d&#233;pendance), d&#233;terminant ind&#233;fini,
marqueur enclitique de d&#233;finitude optionnel, postposition &#1575;&#1585;- -r&#226;. Les adjectifs ne varient qu'en degr&#233;. Ils peuvent
n&#233;anmoins &#234;tre suivis de l'&#201;zaf&#233; lorsqu'ils suivent un nom modifi&#233; ou lorsqu'ils prennent eux-m&#234;mes un objet. En
fin de groupe nominal ils peuvent adopter la flexion des noms. La morphologie verbale du persan est l&#233;g&#232;rement
plus complexe. On consid&#232;re habituellement qu'il y a deux radicaux verbaux en persan, l'un pour les formes du
pr&#233;sent, l'autre pour les formes du pass&#233;. Autour de ces radicaux se placent les pr&#233;fixes de temps, aspect et mode
et les d&#233;sinences personnelles. Les pr&#233;fixes temps-aspect-mode peuvent &#234;tre pr&#233;c&#233;d&#233;s du marqueur de n&#233;gation.
Enfin, le persan poss&#232;de un paradigme de pronoms personnels enclitiques qui se combinent autant avec des noms
qu'avec des verbes, des pr&#233;positions, des adjectifs et certains adverbes (Lazard et al., 2006).
Le projet Shiraz constitue le premier projet important de traitement automatique du persan. Essentiellement consa-
cr&#233; &#224; la traduction automatique du persan vers l'anglais (Amtrup et al., 2000), il a &#233;galement permis la construction
d'un lexique bilingue d'environ 50 000 entr&#233;es. Il a ensuite &#233;t&#233; adapt&#233; aux outils Xerox pour les automates &#224; &#233;tats
finis (Megerdoomian, 2004). D'autres ressources lexicales &#233;lectroniques du persan ont &#233;galement vu le jour ces
derni&#232;res ann&#233;es. On peut citer la version &#233;lectronique du Persian Pronunciation Dictionary (Deyhime, 2000), un
dictionnaire de formes fl&#233;chies avec leurs transcriptions phon&#233;tiques en acc&#232;s limit&#233;. En mai 2010 a &#233;t&#233; rendue
librement disponible la 4&#232;me version de MULTEXT-East (Erjavec, 2010) qui comporte d&#233;sormais le persan (Qa-
semiZadeh &amp; Rahimi, 2006). &#192; la m&#234;me p&#233;riode a &#233;t&#233; d&#233;velopp&#233; le lexique PerLex dans sa premi&#232;re version
(Sagot &amp; Walther, 2010). Outre ces ressources, d'autres outils d'analyse morphologique ou de lemmatisation ont
&#233;t&#233; d&#233;velopp&#233;s, mais sans conduire &#224; la construction d'un lexique &#224; large couverture (cf. les travaux de (Dehdari
&amp; Lonsdale, 2008), et notamment leur lemmatiseur PerStem, librement disponible). R&#233;cemment, ont &#233;t&#233; d&#233;ve-
lopp&#233;s divers outils et ressources TAL pour le persan, comme des &#233;tiqueteurs morphosyntaxiques (QasemiZadeh
&amp; Rahimi, 2006; Tasharofi et al., 2007; Shamsfard &amp; Fadaee, 2008) 1, des analyseurs syntaxiques (Hafezi, 2004;
Dehdari &amp; Lonsdale, 2008) et des syst&#232;mes de traduction automatique (Saedi et al., 2009).
</p>
<p>3 PerLex
D&#232;s la premi&#232;re version de PerLex, nous avions d&#233;velopp&#233; une description formelle de la morphologie persane dans
le formalisme Alexina (Sagot, 2010). Alexina utilise une repr&#233;sentation &#224; deux niveaux qui s&#233;pare la description
du lexique de son utilisation : un lexique intensionnel (de lemmes) et un lexique extensionnel (de formes), produit
automatiquement par compilation du lexique intensionnel. Comme d&#233;taill&#233; dans (Sagot &amp; Walther, 2010), les
entr&#233;es lexicales de PerLex 1 proviennent de diverses sources, et notamment du corpus BijanKhan (BijanKhan,
2004). &#192; l'&#233;t&#233; 2010, PerLex contenait 35 914 entr&#233;es intensionnelles produisant 524 700 entr&#233;es extensionnelles
pour 494 488 formes distinctes. Des donn&#233;es compl&#233;mentaires sur PerLex 1 sont indiqu&#233;es au tableau 1 plus bas.
Ces donn&#233;es sont mises en regard des donn&#233;es pour la nouvelle version de PerLex, dont nous allons d&#233;crire la
construction et notamment les &#233;tapes de validation et de conversion vers un nouveau jeu de cat&#233;gories.
La validation du lexique PerLex a &#233;t&#233; r&#233;alis&#233;e par deux moyens compl&#233;mentaires : la comparaison et si possible
la fusion avec deux autres ressources, puis une validation manuelle partielle. Pour optimiser le co&#251;t de l'&#233;tape
manuelle, nous avons d&#233;fini des heuristiques permettant de pr&#233;senter aux validateurs les entr&#233;es lexicales dont
</p>
<p>1. &#192; notre connaissance, ces &#233;tiqueteurs ne sont pas librement disponibles, ce qui ne permet pas leur comparaison avec l'&#233;tiqueteur MEltfa
pr&#233;sent&#233; ici.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#63465;&#63350;&#63333;&#63340;&#63343;&#63344;&#63344;&#63333;&#63341;&#63333;&#63342;&#63348; &#63332;&#63333; &#63346;&#63333;&#63347;&#63347;&#63343;&#63349;&#63346;&#63331;&#63333;&#63347; &#63344;&#63343;&#63349;&#63346; &#63340;&#63333; &#63344;&#63333;&#63346;&#63347;&#63329;&#63342;: PerLex 2 &#63333;&#63348; MEltfa
</p>
<p>la validation semble prioritaire. Ces heuristiques de pr&#233;-validation s'appuient notamment sur de nouveaux poids
associ&#233;s aux entr&#233;es lexicales pendant l'&#233;tape automatique : les entr&#233;es de poids sup&#233;rieur &#224; un certain seuil sont
jug&#233;es fiables et ne sont pas pr&#233;sent&#233;es &#224; la validation manuelle.
La pr&#233;-validation a &#233;t&#233; op&#233;r&#233;e &#224; l'aide de deux lexiques du persan existants. (1) Le Persian Pronunciation Dic-
tionary (Deyhime, 2000) est un dictionnaire de 23 168 formes fl&#233;chies distinctes associ&#233;es &#224; une ou plusieurs
phon&#233;tisations possibles (pour un total de 34 967 entr&#233;es). Outre qu'il n'est pas librement redistribuable, les en-
tr&#233;es lexicales n'y comportent ni cat&#233;gorie ni lemme. Ce lexique ne nous a donc pas fourni de nouvelles entr&#233;es
lexicales. Nous l'avons toutefois utilis&#233; pour attribuer un poids suppl&#233;mentaire &#224; chaque entr&#233;e lexicale de PerLex :
le poids ajout&#233; au poids pr&#233;c&#233;dent d'une entr&#233;e lexicale donn&#233;e (en g&#233;n&#233;ral, la valeur par d&#233;faut, c'est-&#224;-dire 100)
repr&#233;sente le pourcentage de formes fl&#233;chies associ&#233;es par PerLex &#224; cette entr&#233;e lexicale qui ont une phon&#233;tisation
dans le Persian Pronunciation Dictionary. (2) Le lexique persan distribu&#233; dans la version 4 de MULTEXT-East
(MTE4-fa) (QasemiZadeh &amp; Rahimi, 2006; Erjavec, 2010), ressource libre, nous a permis d'aller plus loin. Il s'agit
d'un lexique morphologique dont les 13 006 entr&#233;es comportent une forme fl&#233;chie, son lemme, une phon&#233;tisation
de la forme fl&#233;chie et du lemme, et une &#233;tiquette positionnelle respectant les conventions MULTEXT habituelles, et
qui inclut donc naturellement une cat&#233;gorie. Apr&#232;s avoir d&#233;fini un tableau de correspondance entre l'inventaire des
cat&#233;gories utilis&#233;es par MTE4-fa et celui du corpus BijanKhan et donc de PerLex 1, nous avons converti MTE4-fa
dans le formalisme Alexina afin de mettre en &#339;uvre les outils de fusion de lexiques Alexina dont nous disposions.
La fusion a permis de rajouter un poids de 100 &#224; toutes les entr&#233;es de PerLex 1 ayant fusionn&#233; avec une entr&#233;e de
MTE4-fa, et aussi d'ajouter de nouvelles entr&#233;es &#224; PerLex depuis les autres entr&#233;es de MTE4-fa. Ces entr&#233;es ont
toutefois n&#233;cessit&#233; un travail manuel ult&#233;rieur pour leur assigner une classe flexionnelle.
Pour toutes les cat&#233;gories autres que les noms et les adjectifs, dont nous sommes raisonnablement s&#251;rs de la classe
flexionnelle, le simple fait que la forme canonique ait &#233;t&#233; trouv&#233;e dans un de ces deux lexiques suffit &#224; pr&#233;-valider
une entr&#233;e. Pour les noms et les adjectifs, nous avons d&#233;fini un seuil emprique sur le poids qui lui est d&#233;sormais
associ&#233;, au dessus duquel une entr&#233;e est pr&#233;-valid&#233;e et n'est donc pas pr&#233;sent&#233;e &#224; la validation manuelle.
&#192; ce jour, deux campagnes de validation manuelle ont eu lieu. Lors de la premi&#232;re, toutes les entr&#233;es lexicales
qui n'&#233;taient pas &#233;cart&#233;es par l'heuristique ci-dessus &#233;taient accessibles dans l'interface de validation. Lors de la
seconde campagne de validation, certaines entr&#233;es pourtant d&#233;j&#224; valid&#233;es ont &#233;t&#233; pr&#233;sent&#233;es &#224; nouveau, notamment
lorsque leur classe flexionnelle avait chang&#233; entre temps (naturellement, uniquement des entr&#233;es dont la validation
n'avait pas indiqu&#233; qu'elles &#233;taient enti&#232;rement correctes). L'interface de validation est une interface en ligne. Elle
utilise une base de donn&#233;es qui stocke &#224; la fois la version de PerLex en cours de validation et l'ensemble des
&#171; tickets de validation &#187; d&#233;j&#224; enregistr&#233;s. Elle se pr&#233;sente sous la forme de tableaux affichant un ensemble de 30
entr&#233;es lexicales non encore valid&#233;es et appartenant &#224; une m&#234;me cat&#233;gorie pr&#233;alablement choisie par le validateur.
Chaque ligne correspond &#224; une entr&#233;e lexicale, repr&#233;sent&#233;e par sa forme canonique et par un ensemble minimum,
souvent vide, de formes fl&#233;chies permettant d'&#234;tre certain que la classe flexionnelle associ&#233;e &#224; l'entr&#233;e lexicale est
correcte : le validateur n'a pas besoin de conna&#238;tre le nom ni le contenu des classes flexionnelles utilis&#233;es pour
valider l'entr&#233;e lexicale. Par ailleurs, chaque colonne correspond &#224; un statut attribuable par le validateur &#224; l'unit&#233;
lexicale, lui permettant d'indiquer la correction ou le type d'erreur concernant une entr&#233;e lexicale donn&#233;es. Lors
de la deuxi&#232;me campagne de validation, suite &#224; la prise en compte des r&#233;sultats de la premi&#232;re, 1097 tickets de
validation ont &#233;t&#233; cr&#233;&#233;s (818 entr&#233;es lexicales correctes, 17 cat&#233;gorie correcte mais une flexion incorrecte, 26
avaient une cat&#233;gorie incorrecte, 129 totalement erronn&#233;es 2 et 11 entr&#233;es famili&#232;res).
Concernant les cat&#233;gories, la grammaire de r&#233;f&#233;rence (Lazard et al., 2006) qui nous avait guid&#233; dans nos premiers
travaux de d&#233;veloppement de PerLex se limitait aux cat&#233;gories de substantifs, adjectifs, adverbes, noms de nombre,
pronoms, verbes, interjections et particules . Cet inventaire n'&#233;tait cependant pas assez pr&#233;cis pour le d&#233;veloppement
d'outils de traitement automatique comme un &#233;tiqueteur morphosyntaxique. Nous ne l'avions donc pas conserv&#233;.
En 2010, notre lexique comportait les &#233;tiquettes reprises directement du corpus BijanKhan (BijanKhan, 2004;
Amiri et al., 2007) 3, dont certaines nous semblaient n&#233;anmoins insuffisantes en termes de pertinence th&#233;orique.
Afin d'am&#233;liorer le lexique et permettre la construction d'un &#233;tiquetteur morphosyntaxique compatible autant avec
de futures t&#226;ches traitement automatique du persan que d'analyse linguistique, nous avons, en un premier temps
fix&#233; un inventaire des cat&#233;gories du persan. Ces cat&#233;gories sont le fruit d'une r&#233;flexion th&#233;orique pr&#233;alable au sein
du projet PerGram. Les cat&#233;gories retenues sont les suivantes : noms, noms propres, adjectifs, adverbes ; verbes,
pr&#233;positions, conjonctions, classifieurs, pronoms, d&#233;terminants, interjections. PerLex 2 comporte d&#233;sormais un
nouveau jeu de cat&#233;gories en accord avec ces choix th&#233;oriques. Nous avons effectu&#233; une conversion automatique
</p>
<p>2. Dont des membres de l'ancienne cat&#233;gorie MORP dans le corpus BijanKhan, voir section 3.
3. ADJ, ADV, AR, CON, DELM, DET, IF, INT, MORP, MQUA, MS, PN, OH, OHH, P, PP, PRO, PS, QUA, SPEC, N, V.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#63333;&#63342;&#63343;&#63470;&#63348; S&#63329;&#63335;&#63343;&#63348;, G&#63465;&#63346;&#63329;&#63340;&#63332;&#63337;&#63342;&#63333; W&#63329;&#63340;&#63348;&#63336;&#63333;&#63346;, P&#63333;&#63335;&#63329;&#63336; F&#63329;&#63335;&#63336;&#63337;&#63346;&#63337;, P&#63343;&#63340;&#63340;&#63333;&#63348; S&#63329;&#63341;&#63350;&#63333;&#63340;&#63337;&#63329;&#63342;
</p>
<p>des anciennes cat&#233;gories vers notre nouvel inventaire de cat&#233;gories. Pour les noms (N), verbes (V), noms propres
(PN), pronoms (PRO), interjections (INT) ponctuations (DELM) la conversion &#233;tait directe. Pour les autres cat&#233;gories,
des crit&#232;res pr&#233;cis ont d&#251; &#234;tre appliqu&#233;s manuellement pour redistribuer les mots qui s'y trouvaient vers l'une ou
l'autre des cat&#233;gories du nouvel inventaire. Ainsi, les &#233;l&#233;ments des classes QUA et MQUA (quantifieurs) sont d&#233;sormais
&#233;tiquet&#233;s DET (d&#233;terminant), ADV (adverbes) ou PRO (pronoms). La classe MORP qui comprenait des &#233;l&#233;ments de
morphologie constructionnelle a disparue. Dans le corpus, ses &#233;l&#233;ments ont &#233;t&#233; recoll&#233;s &#224; leurs bases au cours des
op&#233;rations de retokenisation (section 4.1). Une nouvelle cat&#233;gorie de classifieurs (CLASS) a &#233;t&#233; ajout&#233;e comportant
une partie des &#233;l&#233;ments pr&#233;c&#233;demment &#233;tiquet&#233;s SPEC (sp&#233;cifieurs) les autres &#233;tant d&#233;sormais dans DET et ADV.
Le tableau 1 oppose PerLex 1 et 2, globalement et pour quelques cat&#233;gories importantes. Quantativement, dif-
f&#233;rence entre les deux versions du lexique n'est pas tr&#232;s visible, la suppression d'entr&#233;es &#233;tant all&#233;e &#224; l'oppos&#233;e
des ajouts d'entr&#233;es manquantes. De plus, le travail de conversion vers le nouveau jeu de cat&#233;gories, et les autres
am&#233;liorations (cf. la description morphologique) ne sont pas de nature &#224; se refl&#233;ter quantitativement.
</p>
<p>Partie du discours entr&#233;es intensionnelles lemmes distincts entr&#233;es extensionnelles
PerLex 1 PerLex 2 PerLex 1 PerLex 2 PerLex 1 PerLex 2
</p>
<p>verbes 171 176 139 140 19 776 20 373
noms communs 9 553 9 546 9 106 9 073 177 988 165 345
noms propres 10 996 10 965 10 938 10 954 33 076 31 777
adjectifs 11 872 12 322 11 835 12 284 290 537 302 574
autres 3 322 3 706 3 120 3 622 3 323
total 35 914 36 397 33 454 35 924 524 700 525 074
</p>
<p>T&#63329;&#63330;&#63340;&#63333; 1 &#8211; Donn&#233;es quantitatives sur PerLex
</p>
<p>4 MEltfa : un analyseur morphosyntaxique du persan
PerLex 2 nous a permis de construire un analyseur morphosyntaxique du persan, en b&#233;n&#233;ficiant de la disponibilit&#233;
du corpus BijanKhan. Apr&#232;s la d&#233;finition du jeu d'&#233;tiquettes morphosyntaxiques, et avant d'entra&#238;ner le syst&#232;me
MElt (Denis &amp; Sagot, 2009), nous avons toutefois d&#251; appliquer au corpus BijanKhan des proc&#233;dures automatiques
de correction de corpus (sa qualit&#233; en termes de tokenisation et d'&#233;tiquetage est insuffisante) et de conversion vers
notre jeu d'&#233;tiquettes. &#192; partir de l'inventaire de cat&#233;gories d&#233;crit en section 2, nous avons construit un jeu de 79
&#233;tiquettes morphosyntaxiques pour notre &#233;tiqueteur MEltfa. Pour les 12 cat&#233;gories de notre inventaire, il contient :
37 &#233;tiquettes verbales, 9 pronominales, 8 nominales, 5 pour les pr&#233;positions, 3 pour les adjectifs, conjonctions,
d&#233;terminants et interjections et 2 pour les adverbes et les classifieurs. Les noms propres ont une &#233;tiquette unique.
Nous avons &#233;galement ajout&#233; une &#233;tiquette pour les expressions arabes compl&#232;tes emprunt&#233;es et cit&#233;es telles quelles
dans les textes persans, une pour les nombres et l'&#233;tiquette indispensable pour les ponctuations.
</p>
<p>4.1 Am&#233;lioration du corpus BijanKhan
</p>
<p>Le corpus BijanKhan est un corpus librement disponible de 2 597 937 tokens, r&#233;sultat d'une tokenisation et d'un
&#233;tiquetage automatiques de textes journalistiques et g&#233;n&#233;raux. Il n'est segment&#233; ni en phrases ni en articles. Nous
sommes partis de la version translitt&#233;r&#233;e du corpus d&#233;velopp&#233;e dans (Sagot &amp; Walther, 2010), puis nous l'avons
segment&#233; en 88 885 phrases de fa&#231;on simple en d&#233;coupant sur les ponctuations fortes standard. Nous avons alors
appliqu&#233; un certain nombre de r&#232;gles syst&#233;matiques de correction, afin de r&#233;gler un inventaire assez large d'erreurs
et d'incoh&#233;rences trouv&#233;es dans le corpus, dont voici quatre exemples dans leur ordre d'application :
&#8211; d&#233;collage des pr&#233;verbes (maintenant &#233;tiquet&#233;s P) des verbes auxquels ils sont parfois coll&#233;s par erreur, et donc
int&#233;gr&#233;s dans le token verbal, produisant des formes verbales &#224; juste titre inconnues de PerLex ;
</p>
<p>&#8211; normalisation de la typographie des pr&#233;fixes flexionnels verbaux : p.ex., le pr&#233;fixe -&#1576; be- doit &#234;tre li&#233; au caract&#232;re
suivant, alors que les pr&#233;fixes -&#1740;&#1605;(&#1606;) (n)mi- doivent &#234;tre coll&#233;s mais non li&#233;s (ni s&#233;par&#233;) ;
</p>
<p>&#8211; correction des erreurs typographiques li&#233;es &#224; la marque du pluriel nominal &#1575;&#1726;- -h&#226; possiblement suivie de
marques d'ind&#233;fini ou personnelles ;
</p>
<p>&#8211; restauration de pr&#233;positions compos&#233;es tokenis&#233;es par erreur en un &#171;nom&#187; et une pr&#233;position ( &#1586;&#1575; +&#1587;&#1662; pas + az) ;
Une fois ces corrections effectu&#233;es, il nous a encore fallu convertir le corpus BijanKhan de son propre jeu d'&#233;ti-
quettes vers celui d&#233;crit &#224; la section 4. Toutefois, &#233;tant donn&#233; la qualit&#233; imparfaite de l'&#233;tiquetage du corpus, nous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#63465;&#63350;&#63333;&#63340;&#63343;&#63344;&#63344;&#63333;&#63341;&#63333;&#63342;&#63348; &#63332;&#63333; &#63346;&#63333;&#63347;&#63347;&#63343;&#63349;&#63346;&#63331;&#63333;&#63347; &#63344;&#63343;&#63349;&#63346; &#63340;&#63333; &#63344;&#63333;&#63346;&#63347;&#63329;&#63342;: PerLex 2 &#63333;&#63348; MEltfa
</p>
<p>avons fait le choix de nous appuyer autant que possible sur PerLex, ou, parfois, sur certaines g&#233;n&#233;ralisations mor-
phologiques (infra), pour &#171; valider &#187; l'&#233;tiquette BijanKhan en m&#234;me temps que de proposer une ou plusieurs &#233;ti-
quettes de notre propre jeu. Il a parfois &#233;t&#233; impossible de convertir l'&#233;tiquette de certains tokens, soit parce que
ni PerLex ni les quelques r&#232;gles morphologiques ne nous la confirment (aucune &#233;tiquette n'est propos&#233;e), soit au
contraire parce que plusieurs &#233;tiquettes sont compatibles. Une fois l'ensemble de ces r&#232;gles de conversions appli-
qu&#233;es (nous n'en donnons pas le d&#233;tail faute de place), certains tokens ont re&#231;u une &#233;tiquette venant de notre propre
jeu d'&#233;tiquettes, d'autres ont conserv&#233; celle du BijanKhan. La conversion a pu fonctionner dans 92,4% des cas,
produisant ainsi une annotation compl&#232;te dans notre jeu d'&#233;tiquettes pour 18 763 phrases (21% de l'ensemble).
Nous avons alors partag&#233; le corpus en trois parties : (1) les 100 derni&#232;res phrases du corpus (dont 32 int&#233;gralement
converties) ont &#233;t&#233; s&#233;par&#233;es des autres en vue de la construction d'un corpus d'&#233;valuation (4.2) ; (2) Les phrases
int&#233;gralement converties restantes, soit 18 731 phrases (pour 302 690 tokens), ont &#233;t&#233; rassembl&#233;es en un corpus
d'entra&#238;nement pour MElt ; (3) les autres phrases seront utilis&#233;es ult&#233;rieurement, notamment pour comparer les
annotations cr&#233;&#233;es avec celles que produira MEltfa, et pour des t&#226;ches d'acquisition automatique d'unit&#233;s lexicales.
</p>
<p>4.2 Entra&#238;nement et &#233;valuation de l'&#233;tiqueteur morphosyntaxique MEltfa
La conversion de PerLex 2 en un lexique simple associant &#224; chaque forme une ou plusieurs &#233;tiquettes du jeu
d'&#233;tiquettes d&#233;fini en 4 n'a pas pos&#233; de probl&#232;me, PerLex fournissant des informations morphologiques riches, et
le jeu d'&#233;tiquettes ayant &#233;t&#233; con&#231;u pour permettre cette conversion. Nous avons donc entra&#238;n&#233; le syst&#232;me d'analyse
morphosyntaxique MElt (Denis &amp; Sagot, 2009), en lui donnant en entr&#233;e le lexique extrait de PerLex 2 et notre
corpus d'entra&#238;nement de 18 731 phrases. Le r&#233;sultat est un &#233;tiqueteur morphosyntaxique du persan, MEltfa.
Pour &#233;valuer cet &#233;tiqueteur, nous avons valid&#233; et compl&#233;t&#233; manuellement l'&#233;tiquetage des 100 derni&#232;res phrases du
corpus BijanKhan, apr&#232;s qu'elles ont &#233;t&#233; corrig&#233;es et pr&#233;-annot&#233;es comme le reste du corpus (section pr&#233;c&#233;dente).
Ce corpus de r&#233;f&#233;rence est constitu&#233; de 1 707 tokens. La conversion vers notre jeu d'&#233;tiquettes a pu s'appliquer
pour 1 568 (91,6%) d'entre eux. Nous avons compar&#233; les r&#233;sultats de MEltfa &#224; ce corpus de r&#233;f&#233;rence. Nous les
avons &#233;galement compar&#233;s au r&#233;sultat brut de la correction et pr&#233;-annotation, sur les 1 568 tokens dont l'&#233;tiquette
a &#233;t&#233; effectivement convertie. Sur l'ensemble de la r&#233;f&#233;rence, nous obtenons une pr&#233;cision de 90,3% avec notre jeu
de 79 &#233;tiquettes, et 93,3% sur les seules cat&#233;gories (y compris AR et NUM). Sur les tokens dont l'&#233;tiquette a pu &#234;tre
convertie, nous montons &#224; 93,9% et 95,3% respectivement. Ce score constitue certainement une borne inf&#233;rieure
de la pr&#233;cision que nous obtiendrions si tous les tokens &#233;taient convertis : en effet, les tokens non convertis ne l'ont
pas &#233;t&#233; non plus dans les donn&#233;es d'entra&#238;nement, et MEltfa n'a donc pu apprendre &#224; leur sujet des informations
contextuelles sp&#233;cifiques, d'o&#249; un taux d'erreur sup&#233;rieur. De plus, ces erreurs sont susceptibles de se r&#233;percuter
au voisinage de ces tokens.
Nous avons cherch&#233; &#224; comparer la qualit&#233; des annotations produites par MEltfa &#224; celles r&#233;sultant de la correction
et conversion du corpus BijanKhan &#8212; d&#233;j&#224; am&#233;lior&#233;es par rapport au corpus d'origine. Nous avons calcul&#233; la
pr&#233;cision de ce corpus, restreint aux 1 568 tokens effectivement convertis, par rapport &#224; la r&#233;f&#233;rence. Le r&#233;sultat
en pr&#233;cision est exactement identique &#224; celui de MEltfa, bien que les erreurs ne concernent les m&#234;mes tokens que
dans 48% des cas. Autrement dit, MEltfa a r&#233;ussi &#224; produire, sur les 91,6% de tokens correctement convertis, un
r&#233;sultat aussi bon que le corpus sur lequel il s'est entra&#238;n&#233;, lui m&#234;me meilleur que le corpus BijanKhan. Nous
pensons que ce r&#233;sultat est li&#233; &#224; la fois &#224; l'utilisation de PerLex, qui l'aide &#224; ignorer certaines donn&#233;es aberrentes
du corpus d'apprentissage, et au fait que le mod&#232;le produit par MEltfa en lisse nombre d'erreurs (avec un effet de
type co-training). Cette derni&#232;re hypoth&#232;se est confirm&#233;e par le fait que sur ces 1 568 tokens, MEltfa produit des
r&#233;sultats l&#233;g&#232;rement plus proches de la r&#233;f&#233;rence (93,9% de pr&#233;cision) que du corpus converti (93,4%).
</p>
<p>5 Conclusion
Nous avons d&#233;velopp&#233; une nouvelle version de PerLex (Sagot &amp; Walther, 2010) corrig&#233;e et modifi&#233;e qui, gr&#226;ce
&#224; l'int&#233;gration de r&#233;flexions th&#233;oriques, pourra notamment &#234;tre plus adapt&#233;e aux besoins de ressources pour des
travaux d'analyse linguistique. Cette nouvelle version de PerLex repose sur un nouvel inventaire de cat&#233;gories, a
&#233;t&#233; partiellement valid&#233;e (semi-automatiquement et manuellement) et corrig&#233;e. PerLex est librement disponible
sous http://alexina.gforge.inria.fr. Nous avons &#233;galement d&#233;velopp&#233; une version corrig&#233;e partielle du
corpus BijanKhan qui comporte notamment une retokenisation compl&#232;te. Enfin, nous disposons d'un &#233;tiqueteur
morphosyntaxique du persan MEltfa, librement disponible &#224; l'adresse http://lingwb.gforge.inria.fr. Cet</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#63333;&#63342;&#63343;&#63470;&#63348; S&#63329;&#63335;&#63343;&#63348;, G&#63465;&#63346;&#63329;&#63340;&#63332;&#63337;&#63342;&#63333; W&#63329;&#63340;&#63348;&#63336;&#63333;&#63346;, P&#63333;&#63335;&#63329;&#63336; F&#63329;&#63335;&#63336;&#63337;&#63346;&#63337;, P&#63343;&#63340;&#63340;&#63333;&#63348; S&#63329;&#63341;&#63350;&#63333;&#63340;&#63337;&#63329;&#63342;
</p>
<p>&#233;tiqueteur compl&#232;te notre ensemble d'outils de TAL du persan qui comportait d&#233;j&#224; la cha&#238;ne de pr&#233;-traitement
S&#63352;Pipefa (Sagot &amp;Walther, 2010) librement disponible &#224; la m&#234;me adresse. Entra&#238;n&#233; sur des donn&#233;es bruit&#233;es, il est
encore am&#233;liorable, bien qu'un score de 90,3% sur un jeu de 79 &#233;tiquettes soit tout &#224; fait honorable. MEltfa pourra
d'ores et d&#233;j&#224; &#234;tre utile pour enrichir PerLex et rechercher des motifs dans des corpus &#224; des fins linguistiques.
Nous comptons, &#224; l'avenir, terminer le volet syntaxique de PerLex, y compris l'int&#233;gration des pr&#233;dicats complexes
et de leur structure argumentale. Ce lexique doit &#234;tre int&#233;gr&#233; &#224; la grammaire HPSG (Pollard &amp; Sag, 1994) d&#233;ve-
lopp&#233;e au sein de PerGram. Cette grammaire HPSG a vocation a &#234;tre impl&#233;ment&#233; dans le syst&#232;me &#63348;&#63346;&#63329;&#63340;&#63333; (Penn,
2004), (M&#252;ller &amp; Ghayoomi, 2010). Des travaux d'int&#233;gration du formalisme Alexina dans &#63348;&#63346;&#63329;&#63340;&#63333; sont en cours.
Une fois l'int&#233;gration de PerLex dans &#63348;&#63346;&#63329;&#63340;&#63333; termin&#233;e, nous disposerons d'un parser HPSG pour le persan qui pourra
notamment servir au d&#233;veloppement d'un corpus arbor&#233; du persan.
</p>
<p>R&#233;f&#233;rences
A&#63341;&#63337;&#63346;&#63337; H., H&#63343;&#63338;&#63338;&#63329;&#63348; H. &amp; O&#63346;&#63343;&#63349;&#63341;&#63331;&#63336;&#63337;&#63329;&#63342; F. (2007). &#1740;&#1587;&#1585;&#1575;&#1601; &#1606;&#1575;&#1576;&#1586; &#1585;&#1583; &#1578;&#1575;&#1605;&#1604;&#1603; &#1740;&#1606;&#1586; &#1576;&#1587;&#1670;&#1585;&#1576; &#1740;&#1575;&#1585;&#1576; &#1576;&#1587;&#1575;&#1606;&#1605; &#1740;&#1575; &#1607;&#1585;&#1603;&#1740;&#1662; &#1740;&#1587;&#1585;&#1585;&#1576; (Investi-
gation on a feasible corpus for Persian POS tagging). In 12th Int. CSI computer conference, T&#233;h&#233;ran, Iran.
A&#63341;&#63348;&#63346;&#63349;&#63344; J. W., R&#63329;&#63332; H. M., M&#63333;&#63335;&#63333;&#63346;&#63332;&#63343;&#63343;&#63341;&#63337;&#63329;&#63342; K. &amp; Z&#63329;&#63338;&#63329;&#63331; R. (2000). Persian-English Machine Translation : An
Overview of the Shiraz Project. Memoranda in Computer and Cognitive Science MCCS-00-319, NMSU, CRL.
B&#63337;&#63338;&#63329;&#63342;K&#63336;&#63329;&#63342; M. (2004). The role of the corpus in writing a grammar : An introduction to a software. Iranian
Journal of Linguistics, 19(2).
D&#63333;&#63336;&#63332;&#63329;&#63346;&#63337; J. &amp; L&#63343;&#63342;&#63347;&#63332;&#63329;&#63340;&#63333; D. (2008). A Link Grammar Parser for Persian. In S. K&#63329;&#63346;&#63337;&#63341;&#63337;, V. S&#63329;&#63341;&#63337;&#63337;&#63329;&#63342; &amp; D. S&#63348;&#63337;&#63340;&#63343;,
Eds., Aspects of Iranian Linguistics, volume 1. Cambridge Scholars Press.
D&#63333;&#63342;&#63337;&#63347; P. &amp; S&#63329;&#63335;&#63343;&#63348; B. (2009). Coupling an annotated corpus and a morphosyntactic lexicon for state-of-the-art
pos tagging with less human effort. In Proc. of PACLIC 2009, Hong-Kong, China.
D&#63333;&#63353;&#63336;&#63337;&#63341;&#63333; G. (2000). Farhang-i Avayi-i Farsi (Persian Pronunciation Dictionary). T&#233;h&#233;ran, Iran : Farhang Moaser
Publishers.
E&#63346;&#63338;&#63329;&#63350;&#63333;&#63331; T. (2010). Multext-east version 4 : Multilingual morphosyntactic specifications, lexicons and corpora.
In Proc. of LREC'10, La Valette, Malte : European Language Resources Association (ELRA).
H&#63329;&#63334;&#63333;&#63354;&#63337; M. M. (2004). A syntactic parser of Persian sentences. In Proc. of the 1st Workshop of the Persian
Language and Computer, T&#233;h&#233;ran, Iran.
L&#63329;&#63354;&#63329;&#63346;&#63332; G., R&#63337;&#63331;&#63336;&#63329;&#63346;&#63332; Y., H&#63333;&#63331;&#63336;&#63341;&#63329;&#63348;&#63337; R. &amp; S&#63329;&#63341;&#63350;&#63333;&#63340;&#63337;&#63329;&#63342; P. (2006). Grammaire du persan contemporain. T&#233;h&#233;ran,
Iran : Institut Fran&#231;ais de Recherche en Iran &amp; Farhang Moaser Edition.
M&#63333;&#63335;&#63333;&#63346;&#63332;&#63343;&#63343;&#63341;&#63337;&#63329;&#63342; K. (2004). Finite-state morphological analysis of Persian. In Proc. of the CoLing Workshop on
Computational Approaches to Arabic Script-based Languages, Gen&#232;ve, Suisse.
M&#63484;&#63340;&#63340;&#63333;&#63346; S. &amp; G&#63336;&#63329;&#63353;&#63343;&#63343;&#63341;&#63337; M. (2010). PerGram : A TRALE Implementation of an HPSG Fragment of Persian. In
Proceedings of the International Multiconference on Computer Science and Information Technology.
P&#63333;&#63342;&#63342; G. (2004). Balancing clarity and efficiency in typed feature logic through delaying. In Proc. of ACL 2004,
p. 239&#8211;246.
P&#63343;&#63340;&#63340;&#63329;&#63346;&#63332; C. &amp; S&#63329;&#63335; I. (1994). Head-driven Phrase Structure Grammar. Stanford, USA : CSLI Publications.
Q&#63329;&#63347;&#63333;&#63341;&#63337;Z&#63329;&#63332;&#63333;&#63336; B. &amp; R&#63329;&#63336;&#63337;&#63341;&#63337; S. (2006). Persian in MULTEXT-East Framework. In FinTAL, p. 541--551.
S&#63329;&#63333;&#63332;&#63337; C., M&#63343;&#63348;&#63329;&#63354;&#63329;&#63332;&#63337; Y. &amp; S&#63336;&#63329;&#63341;&#63347;&#63334;&#63329;&#63346;&#63332; M. (2009). Automatic Translation between English and Persian Texts. In
Proc. of the Third Workshop on Computational Approaches to Arabic Script-based Languages, Ottawa, Canada.
S&#63329;&#63335;&#63343;&#63348; B. (2010). The Lefff, a freely available, accurate and large-coverage lexicon for French. In Proc. of the
7th Language Resource and Evaluation Conference, La Valette, Malte.
S&#63329;&#63335;&#63343;&#63348; B. &amp;W&#63329;&#63340;&#63348;&#63336;&#63333;&#63346; G. (2010). D&#233;veloppement de ressources pour le persan : lexique morphologique et cha&#238;ne
de traitements de surface. In Actes de TALN 2010, Montr&#233;al, Canada.
S&#63329;&#63341;&#63350;&#63333;&#63340;&#63337;&#63329;&#63342; P. (2001). Le statut syntaxique des objets nus en persan. Bulletin de la Soci&#233;t&#233; de Linguistique de
Paris, XCVI(1), 349--388.
S&#63336;&#63329;&#63341;&#63347;&#63334;&#63329;&#63346;&#63332; M. &amp; F&#63329;&#63332;&#63329;&#63333;&#63333; H. (2008). A hybrid morphology-based pos tagger for Persian. In N. C&#63329;&#63340;&#63354;&#63343;&#63340;&#63329;&#63346;&#63337;, Ed.,
Proc. of the Sixth International Language Resources and Evaluation (LREC'08), Marrakech, Maroc.
T&#63329;&#63347;&#63336;&#63329;&#63346;&#63343;&#63334;&#63337; S., R&#63329;&#63338;&#63329; F., O&#63346;&#63343;&#63349;&#63341;&#63331;&#63336;&#63337;&#63329;&#63342; F. &amp;R&#63329;&#63336;&#63335;&#63343;&#63354;&#63329;&#63346;M. (2007). Evaluation of Statistical Part of Speech Tagging
of Persian Text. In International Symposium on Signal Processing and its Applications, Sharjah, E.A.U.</p>

</div></div>
</body></html>