<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>GlozzQL : un langage de requ&#234;tes incr&#233;mental pour les textes annot&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>PROPOSITION DE DEMONSTRATION TALN 2011 
 
</p>
<p>GlozzQL : un langage de requ&#234;tes incr&#233;mental pour les textes annot&#233;s 
</p>
<p>Yann Mathet1, Antoine Widl&#246;cher1  
(1)  GREYC, UMR CNRS 6072, Universit&#233; de Caen, 14032 Caen Cedex  
</p>
<p>{prenom.nom}@unicaen.fr 
</p>
<p>GlozzQL est un langage de requ&#234;tes coupl&#233; &#224; un moteur d&#8217;interrogation d&#233;di&#233; et int&#233;gr&#233; &#224; la plateforme 
d&#8217;annotation Glozz. Ses deux points forts sont : (1) son immersion au coeur du processus d&#8217;annotation, 
permettant de requ&#234;ter en m&#234;me temps que l&#8217;on annote, et vice-versa (la figure 2 montre comment on peut 
naviguer entre les r&#233;sultats de requ&#234;tes et les annotations du texte en deux clics successifs) ; (2) son 
caract&#232;re incr&#233;mental, au sens o&#249; des requ&#234;tes peuvent &#234;tre construites sur la base d&#8217;autres requ&#234;tes (on 
cherche les annotations r&#233;pondant &#224; telle contrainte parmi celles r&#233;pondant d&#233;j&#224; &#224; telle autre contrainte). 
</p>
<p> figure 1 
</p>
<p> 
</p>
<p> figure 2 
</p>
<p>Ce langage repose sur deux concepts inter-d&#233;pendants, les Constraints, d&#233;finissant chacune une condition 
qu&#8217;une annotation doit v&#233;rifier pour &#234;tre s&#233;lectionn&#233;e, et les ConstrainedAnnotations. ensemble 
d&#8217;annotations satisfaisant une contrainte donn&#233;e. C&#8217;est parce qu&#8217;une Constraint peut elle-m&#234;me s&#8217;appuyer 
sur une ConstrainedAnnotation que des constructions incr&#233;mentales peuvent &#234;tre peu &#224; peu constitu&#233;es, et 
produire ainsi un pouvoir expressif fort. S&#8217;adressant &#224; un public large, ce langage est int&#233;gr&#233; sous forme 
enti&#232;rement graphique au sein de Glozz, permettant de constituer des requ&#234;tes aussi complexes que 
souhait&#233; &#224; la souris, comme illustr&#233; en figure 1 : les fen&#234;tre 1 et 4 permettent respectivement de cr&#233;er des 
ConstrainedAnnotations et des Constraints, lesquelles apparaissent respectivement en 2 et 5, tandis que 
l&#8217;ensemble des r&#233;sultats relatifs &#224; une ConstrainedAnnotation de 2 appara&#238;t au-dessous en fen&#234;tre 3. 
</p>
<p>La d&#233;monstration abordera GlozzQL de fa&#231;on pratique et s&#8217;appuiera sur 3 exemples concrets de constitution 
de requ&#234;tes. Le premier, la simple d&#233;tection d&#8217;annotations disposant d&#8217;une valeur de trait particuli&#232;re, &#224; 
savoir genre=f&#233;minin. Le second mettra en oeuvre la constitution progressive de contraintes complexes, 
comme la recherche d&#8217;une annotation constitu&#233;e d&#8217;une relation allant d&#8217;une annotation de genre=f&#233;minin &#224; 
une annotation de genre=masculin. Le troisi&#232;me permettra d&#8217;entrevoir des concepts avanc&#233;s de Glozz tels 
que l&#8217;unification, permettant de consid&#233;rer les ConstrainedAnnotations comme des variables d&#8217;un syst&#232;me 
d&#8217;&#233;quation, et ainsi de pouvoir d&#233;tecter des configuration complexes telles que des relations en triangle, ou 
des relations orient&#233;es dans le sens inverse du sens de lecture. Enfin, la notion de panier permettant de 
collecter s&#233;lectivement des r&#233;sultats de requ&#234;tes afin soit de les enregistrer, soit au contraire de les retirer du 
texte annot&#233;, sera illustr&#233;e &#224; partir des r&#233;sultats pr&#233;c&#233;dents. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>MATHET Y. ,WIDL&#214;CHER A. (2011), Strat&#233;gie d&#8217;exploration de corpus multi-annot&#233;s avec GlozzQL. TALN 
2011, &#224; para&#238;tre (soumission 186). </p>

</div></div>
</body></html>