<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une approche holiste et unifi&#233;e de l&#8217;alignement et de la mesure d&#8217;accord inter-annotateurs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Une approche holiste et unifi&#233;e de l&#8217;alignement et de la mesure d&#8217;accord
inter-annotateurs
</p>
<p>Yann Mathet1 Antoine Widl&#246;cher1
</p>
<p>(1) GREYC, UMR CNRS 6072, Universit&#233; de Caen, 14032 Caen Cedex
{prenom.nom}@unicaen.fr
</p>
<p>R&#233;sum&#233;. L&#8217;alignement et la mesure d&#8217;accord sur des textes multi-annot&#233;s sont des enjeux majeurs pour la
constitution de corpus de r&#233;f&#233;rence. Nous d&#233;fendons dans cet article l&#8217;id&#233;e que ces deux t&#226;ches sont par essence
interd&#233;pendantes, la mesure d&#8217;accord n&#233;cessitant de s&#8217;appuyer sur des annotations align&#233;es, tandis que les choix
d&#8217;alignements ne peuvent se faire qu&#8217;&#224; l&#8217;aune de la mesure qu&#8217;ils induisent. Nous proposons des principes formels
relevant cette gageure, qui s&#8217;appuient notamment sur la notion de d&#233;sordre du syst&#232;me constitu&#233; par l&#8217;ensemble
des jeux d&#8217;annotations d&#8217;un texte. Nous posons que le meilleur alignement est celui qui minimise ce d&#233;sordre,
et que la valeur de d&#233;sordre obtenue rend compte simultan&#233;ment du taux d&#8217;accord. Cette approche, qualifi&#233;e
d&#8217;holiste car prenant en compte l&#8217;int&#233;gralit&#233; du syst&#232;me pour op&#233;rer, est algorithmiquement lourde, mais nous
sommes parvenus &#224; produire une impl&#233;mentation d&#8217;une version l&#233;g&#232;rement d&#233;grad&#233;e de cette derni&#232;re, et l&#8217;avons
int&#233;gr&#233;e &#224; la plate-forme d&#8217;annotation Glozz.
</p>
<p>Abstract. Building reference corpora makes it necessary to align annotations and to measure agreement
among annotators, in order to test the reliability of the annotated ressources. In this paper, we argue that alignment
and agreement measure are interrelated : agreement measure applies to pre-aligned data and alignment assumes a
prior agreement measure. We describe here a formal and computational framework which takes this interrelation
into account, and relies on the notion of disorder of annotation sets available for a text. In this framework, the
best alignment is the one which has the minimal disorder, and this disorder reflects an agreement measure of these
data. This approach is said to be holistic insofar as alignment and measure depend on the system as a whole and
cannot be locally determined. This holism introduces a computational cost which has been reduced by a heuristic
strategy, implemented within the Glozz annotation platform.
</p>
<p>Mots-cl&#233;s : Alignement d&#8217;annotations, mesure d&#8217;accord inter-annotateurs, linguistique de corpus.
</p>
<p>Keywords: Alignment, inter-coder agreement measure, corpus linguistics.
</p>
<p>1 Contexte
</p>
<p>La multiplication des travaux sur corpus, en linguistique computationnelle et en TAL conduit naturellement &#224; la
multiplication des campagnes d&#8217;annotation et rend n&#233;cessaire la mise en place de m&#233;thodes et d&#8217;outils permet-
tant d&#8217;interpr&#233;ter le fruit de ces campagnes. Pour &#233;tablir des corpus annot&#233;s de r&#233;f&#233;rence, ou simplement pour
mieux comprendre les ph&#233;nom&#232;nes linguistiques que ces campagnes prennent pour objets, il est notamment n&#233;-
cessaire de mettre en correspondance (d&#8217;aligner) les annotations produites par diff&#233;rents annotateurs (humains ou
automatiques), sur un m&#234;me jeu de donn&#233;es, et de prendre la mesure de leurs accords et d&#233;saccords.
</p>
<p>Dans cet article, nous nous int&#233;ressons aux questions d&#8217;alignement et d&#8217;accord inter-annotateurs, en nous limitant
&#224; des annotations de textes consistant, de fa&#231;on tr&#232;s g&#233;n&#233;rale, &#224; d&#233;limiter et &#224; cat&#233;goriser des unit&#233;s. Il est important
de noter que la m&#233;thode que nous cherchons &#224; d&#233;finir doit permettre d&#8217;aligner et de comparer des objets textuels
relativement vari&#233;s, distribu&#233;s dans le texte de mani&#232;res elles aussi vari&#233;es, et qu&#8217;&#224; ce titre, nous devons nous
&#233;carter de nombreux travaux eux aussi consacr&#233;s &#224; l&#8217;alignement et &#224; la mesure d&#8217;accord (cf. section 2).
</p>
<p>Nous cherchons &#224; aligner et &#224; comparer des unit&#233;s, segments de texte commen&#231;ant et s&#8217;achevant en des positions
d&#233;termin&#233;es. Insistons sur le fait que la segmentation du texte, i.e. le positionnement des unit&#233;s, n&#8217;est pas consi-
d&#233;r&#233;e comme acquise. En effet, dans certains cas, les annotateurs n&#8217;auront pas exclusivement &#224; caract&#233;riser des
donn&#233;es d&#233;j&#224; d&#233;limit&#233;es, mais devront &#233;galement d&#233;terminer leur position dans le texte et leur taille. Concernant ce</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>positionnement des unit&#233;s, pr&#233;cisons de plus qu&#8217;il ne conduit pas n&#233;cessairement &#224; un pavage complet du texte, la
sporadicit&#233; des ph&#233;nom&#232;nes &#233;tant m&#234;me parfois assez grande. Concernant leur taille, ajoutons que celle-ci pourra
varier fortement d&#8217;une unit&#233; &#224; l&#8217;autre, et cela, &#233;ventuellement, pour un m&#234;me type d&#8217;objet linguistique. Pour le
positionnement relatif des unit&#233;s, nous souhaitons de plus offrir une grande souplesse : les unit&#233;s pourront se
succ&#233;der, s&#8217;inclure, se chevaucher. Chaque unit&#233; poss&#232;de par ailleurs une cat&#233;gorie choisie parmi un ensemble
pr&#233;d&#233;fini pour une campagne d&#8217;annotation donn&#233;e. Ajoutons que les couches d&#8217;annotations correspondant aux
diff&#233;rentes cat&#233;gories ne doivent pas &#234;tre regard&#233;es comme ind&#233;pendantes, l&#8217;attribution d&#8217;une mauvaise cat&#233;gorie
&#224; un objet pouvant &#234;tre parfois, dans une certaine mesure, acceptable.
</p>
<p>Les raisons pour lesquelles nous devons privil&#233;gier la tol&#233;rance tiennent dans une large mesure &#224; la nature des ob-
jets linguistiques sur lesquels nous travaillons par ailleurs. En effet, nous op&#233;rons souvent dans le champ discipli-
naire de l&#8217;analyse du discours et explorons des structures textuelles vari&#233;es, telles qu&#8217;envisag&#233;es par des approches
aussi h&#233;t&#233;rog&#232;nes que l&#8217;Argumentative Zoning (Teufel et al., 1999), l&#8217;encadrement du discours (Charolles, 1997)
ou encore la SDRT (Segmented Discourse Relation Theory) (Asher, 1993). &#192; titre d&#8217;exemple, pr&#233;cisons que ce tra-
vail prend place dans la continuit&#233; du projet ANR Annodis (P&#233;ry-Woodley et al., 2009), qui vise la mise en place
d&#8217;un corpus de r&#233;f&#233;rence pour le fran&#231;ais, en analyse de discours. Comme on le verra, il entretient par ailleurs
de nombreuses relations avec la plate-forme d&#8217;annotation et d&#8217;exploration de corpus Glozz (Widl&#246;cher &amp; Mathet,
2009), plate-forme permettant de produire des annotations h&#233;t&#233;rog&#232;nes exigeant cette tol&#233;rance.
</p>
<p>La m&#233;thode que nous proposons ici n&#8217;est n&#233;anmoins pas d&#233;di&#233;e &#224; l&#8217;&#233;valuation d&#8217;annotations discursives. Elle se
veut aussi g&#233;n&#233;rique que possible et nous pouvons r&#233;sumer ainsi son objectif : nous recherchons &#224; la fois un
alignement et une mesure d&#8217;accord multi-annotateurs portant sur des annotations compos&#233;es d&#8217;unit&#233;s marqu&#233;es
par leur possible vari&#233;t&#233; de grain, leur possible vari&#233;t&#233; cat&#233;gorielle, leur possible sporadicit&#233; et la souplesse de
leurs distributions relatives.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Parmi les travaux dans la continuit&#233; desquels notre &#233;tude prend position, nous pouvons distinguer ceux qui portent
leur attention sur la question de l&#8217;attribution de cat&#233;gories &#224; des unit&#233;s pr&#233;d&#233;finies (la caract&#233;risation) d&#8217;une part
et ceux qui privil&#233;gient la question de la segmentation des unit&#233;s d&#8217;autre part.
</p>
<p>Pour les premiers, l&#8217;accord entre annotateurs concerne principalement l&#8217;affectation, par chacun, d&#8217;une cat&#233;gorie
choisie parmi un ensemble d&#233;fini pour une campagne d&#8217;annotation donn&#233;e, &#224; des unit&#233;s dont la d&#233;limitation est
consid&#233;r&#233;e comme non probl&#233;matique, souvent le mot. Dans cette perspective, de nombreux travaux se r&#233;f&#232;rent
notamment aux coefficients que sont pi (Scott, 1955) et &#954; (Cohen, 1960) ainsi qu&#8217;&#224; des variantes multi-annotateurs
tel le K de (Siegel &amp; Castellan, 1988) et aux coefficients pond&#233;r&#233;s &#945; (Krippendorff, 1980) et &#954;w (Cohen, 1968)1.
Non sp&#233;cifiquement issues du TAL ou de la linguistique, ces diff&#233;rentes approches de la mesure d&#8217;accord font
l&#8217;objet de travaux qui visent &#224; &#233;tudier leur pertinence et leurs limites dans ces domaines d&#8217;accueil et &#224; en comparer
les retomb&#233;es. Nous pensons ici en particulier &#224; l&#8217;excellente synth&#232;se de (Artstein &amp; Poesio, 2008), sur laquelle
nous nous appuyons fortement ici. Si la pr&#233;sente &#233;tude apporte, comme on le verra, au probl&#232;me de la caract&#233;-
risation une r&#233;ponse provisoire relativement l&#233;g&#232;re, la fr&#233;quentation de ces travaux nous ouvre toutefois d&#8217;ores
et d&#233;j&#224; des perspectives essentielles, dont l&#8217;influence sera encore accrue dans nos travaux futurs. En particulier,
l&#8217;importance que ces travaux accordent &#224; la confrontation entre les accords observ&#233;s et ceux que le seul hasard
peut engendrer est tout &#224; fait &#233;clairante, de m&#234;me que l&#8217;est leur r&#233;flexion sur l&#8217;obtention du &#171; meilleur hasard
possible &#187;, qui tiendra compte des propri&#233;t&#233;s particuli&#232;res de la campagne engag&#233;e et de son corpus, ainsi, le cas
&#233;ch&#233;ant, que des tendances des annotateurs. Une autre avanc&#233;e importante concerne la proposition de solutions,
intimement li&#233;e &#224; la r&#233;flexion sur les coefficients pond&#233;r&#233;s, permettant de rendre compte du fait important que
tous les d&#233;saccords ne se valent pas. Ce point sera &#233;videmment au c&#339;ur de la question de la segmentation, mais,
dans la continuit&#233; de ces travaux, nous y accorderons aussi une large place en ce qui concerne la caract&#233;risation
des unit&#233;s. Enfin, mentionnons la place m&#233;rit&#233;e que ces travaux accordent &#224; la d&#233;licate question de l&#8217;interpr&#233;tation
qualitative des r&#233;sultats quantitatifs. Dans le prolongement de leur effort, nous serons aussi amen&#233;s &#224; envisager
des &#171; grilles &#187; permettant l&#8217;interpr&#233;tation des mesures que nous proposons.
</p>
<p>Naturellement, la principale limite de ces travaux, du point de vue qui nous occupe, est le fait que la segmentation y
</p>
<p>1Comme le note (Artstein &amp; Poesio, 2008), certains flottements de d&#233;nomination perturbent souvent les discussions relatives &#224; ces coeffi-
cients. Nous retenons la clarification qu&#8217;ils proposent.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE APPROCHE HOLISTE ET UNIFI&#201;E DE L&#8217;ALIGNEMENT ET DE LA MESURE D&#8217;ACCORD
</p>
<p>soit globalement consid&#233;r&#233;e comme acquise. Il convient toutefois de remarquer, et (Artstein &amp; Poesio, 2008) nous
y invitent, que ces approches peuvent fournir un cadre pour l&#8217;estimation de l&#8217;accord sur des t&#226;ches de segmentation.
Ainsi, (Teufel et al., 1999) envisagent par exemple l&#8217;accord obtenu sur l&#8217;attribution de r&#244;les argumentatifs &#224; des
phrases, en utilisant le coefficient de (Siegel &amp; Castellan, 1988), phrases dont l&#8217;ajacence conduit &#224; l&#8217;&#233;mergence
de segments. Les mesures d&#8217;accord sur l&#8217;attribution de cat&#233;gories peuvent encore &#234;tre utilis&#233;es, comme c&#8217;est le
cas dans (Hearst, 1997), non plus sur le contenu des segments, mais pour mesurer l&#8217;accord sur l&#8217;identification
des bornes, c&#8217;est-&#224;-dire sur l&#8217;attribution d&#8217;une cat&#233;gorie borne. Toutefois, l&#8217;utilisation de ces approches pour des
t&#226;ches de segmentation se heurte &#224; la difficult&#233; majeure suivante : une d&#233;limitation d&#8217;unit&#233; n&#8217;est regard&#233;e comme
faisant consensus que si les annotateurs sont parfaitement d&#8217;accord sur le positionnement exact des bornes. Or en
la mati&#232;re, et en particulier aux &#233;chelles discursives, une plus grande souplesse est n&#233;cessaire, pour que de l&#233;gers
d&#233;saccords dans le positionnement des bornes soient moins lourdement p&#233;nalis&#233;s.
</p>
<p>La m&#233;thode propos&#233;e par (Grouin et al., 2011), adoss&#233;e &#224; la mesure d&#8217;erreur slot error rate (Makhoul et al.,
1999), permet de combiner alignement et mesure d&#8217;erreur et d&#8217;aborder simultan&#233;ment positionnement des unit&#233;s
et attribution de cat&#233;gories. Certes, elle permet d&#8217;aligner des unit&#233;s dont les positions ne sont pas identiques, mais
les diff&#233;rentes raisons suivantes la rendent peu adapt&#233;e &#224; notre perspective : tous les &#233;carts sont sanctionn&#233;s de
mani&#232;re identique ; elle est pr&#233;vue pour comparer seulement deux annotations, dont l&#8217;une fait office de r&#233;f&#233;rence ;
enfin, elle op&#232;re &#224; l&#8217;&#233;chelle de la phrase et non du texte.
</p>
<p>D&#8217;autres travaux visent &#224; prendre sp&#233;cifiquement en charge les probl&#232;mes de segmentation, en particulier dans le
domaine de la segmentation th&#233;matique. Dans ce domaine, un consensus s&#8217;est &#233;tabli autour de la mesure Win-
dowDiff (Pevzner &amp; Hearst, 2002), qui consiste &#224; d&#233;placer une fen&#234;tre glissante le long du texte, et &#224; comparer
le nombre de ruptures pr&#233;sentes dans une annotation consid&#233;r&#233;e comme r&#233;f&#233;rence et dans une annotation &#233;valu&#233;e.
Aux limites de cette m&#233;thode &#233;voqu&#233;es par exemple par (Lamprier et al., 2007) et (Bestgen, 2009) (difficult&#233; &#224;
interpr&#233;ter les r&#233;sultats, d&#233;pendance &#224; l&#8217;&#233;gard de la taille de la fen&#234;tre glissante, erreurs p&#233;nalis&#233;es diff&#233;remment
selon leur position dans le texte, erreurs l&#233;g&#232;res parfois trop p&#233;nalis&#233;es...) s&#8217;ajoute dans notre perspective le fait que
cette m&#233;thode ne fournit pas &#224; proprement d&#8217;alignement, limite qui s&#8217;applique &#233;galement aux am&#233;nagements de
WindowDiff propos&#233;s par (Lamprier et al., 2007). (Bestgen, 2009) pr&#233;conise pour sa part le recours &#224; la distance
de Hamming g&#233;n&#233;ralis&#233;e (DHG) (Bookstein et al., 2002), distance d&#8217;&#233;dition entre deux annotations, qui ajoute
&#224; la distance de Hamming l&#8217;op&#233;ration de d&#233;placement qui permet de donner la souplesse n&#233;cessaire &#224; la prise
en compte d&#8217;erreurs l&#233;g&#232;res dans le positionnement des bornes. Offrant un r&#233;sultat plus facile &#224; interpr&#233;ter que
d&#8217;autres indices, cette m&#233;thode souffre selon nous de limites qui s&#8217;appliquent du reste &#233;galement &#224; WindowDiff.
Pens&#233;es (dans le cas de WindowDiff) ou d&#233;tourn&#233;es (dans le cas de DHG) pour l&#8217;&#233;valuation de la segmentation
th&#233;matique, ces m&#233;thodes sont intimement li&#233;es d&#8217;une part &#224; l&#8217;id&#233;e de pavage complet du texte (ce qui enfreint
notre contrainte d&#8217;&#233;ventuelle sporadicit&#233;) et d&#8217;autre part &#224; l&#8217;unicit&#233; du ph&#233;nom&#232;ne envisag&#233;, i.e. le ph&#233;nom&#232;ne de
rupture th&#233;matique (ce qui enfreint notre contrainte de prise en charge d&#8217;annotation multi-cat&#233;gorielles). Ajoutons
que ces m&#233;thodes n&#8217;int&#232;grent pas de correction par le hasard. La solution &#945;U propos&#233;e par (Krippendorff, 1995),
qui repose sur la mesure du recouvrement entre les annotations de diff&#233;rents annotateurs r&#233;pond &#224; beaucoup des
exigences que nous avons fix&#233;es et nous devrons l&#8217;&#233;valuer davantage. Elle impose toutefois, comme l&#8217;indiquent
(Artstein &amp; Poesio, 2008), que les annotations d&#8217;un m&#234;me annotateur ne se recouvrent pas, ce qui contredit la
contrainte de souplesse positionnelle que nous nous sommes fix&#233;e.
</p>
<p>3 Quelle mesure d&#8217;accord ?
</p>
<p>3.1 Difficult&#233; majeure : interd&#233;pendance de la mesure d&#8217;accord et de l&#8217;alignement
</p>
<p>Pour un &#171; m&#234;me ph&#233;nom&#232;ne &#187; rep&#233;r&#233; par plusieurs annotateurs, il est n&#233;cessaire de pr&#233;voir une mesure d&#8217;accord
suffisamment souple pour pouvoir rendre compte d&#8217;une double divergence, la premi&#232;re portant sur le choix de
cat&#233;gorie attribu&#233;e au ph&#233;nom&#232;ne, la seconde portant sur son positionnement. Il n&#8217;est pas rare, en particulier, que
le positionnement diff&#232;re de fa&#231;on substantielle sur l&#8217;une, l&#8217;autre, ou m&#234;me les deux bornes. Du fait de ces diver-
gences de positionnement, la mesure d&#8217;accord est assujettie &#224; la d&#233;termination d&#8217;un alignement inter-annotateurs,
un tel alignement consistant &#224; d&#233;terminer quelle unit&#233; de tel annotateur correspond &#224; telle autre de tel autre an-
notateur. Si l&#8217;on dispose d&#8217;un alignement complet des annotations de l&#8217;ensemble des annotateurs, il est possible,
pour chaque unit&#233; rep&#233;r&#233;e, de d&#233;terminer dans quelle mesure les annotateurs se sont entendus sur son position-
nement et sur sa qualification. Cette quantification sera &#233;tablie au moyen d&#8217;une mesure de &#171; dissimilarit&#233; &#187; entre</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>unit&#233;s annot&#233;es : plus les unit&#233;s seront consid&#233;r&#233;es comme &#171; proches &#187;, plus cette mesure devra &#234;tre faible. Des
propositions relatives &#224; l&#8217;&#233;tablissement de telles mesures seront faites ci-apr&#232;s.
</p>
<p>Mais comment obtenir un tel alignement ? Aligner une unit&#233; ua de l&#8217;annotateur A avec une unit&#233; ub de l&#8217;annotateur
B consiste &#224; consid&#233;rer que les propri&#233;t&#233;s (cat&#233;gorie, position) de ua et de ub sont suffisamment &#171; proches &#187; pour
pouvoir &#234;tre assimil&#233;es : l&#8217;annotateur A et l&#8217;annotateur B ont rendu compte d&#8217;un &#171; m&#234;me ph&#233;nom&#232;ne &#187;, bien que
de fa&#231;on &#233;ventuellement (et l&#233;g&#232;rement) diff&#233;rente. La m&#233;thode d&#8217;alignement doit donc pour sa part s&#8217;appuyer sur
une &#171; distance &#187; entre unit&#233;s pour pouvoir op&#233;rer.
</p>
<p>D&#232;s lors, mesure d&#8217;accord et alignement sont inter-d&#233;pendants : on ne peut mesurer sans disposer d&#8217;un alignement,
ni l&#8217;on ne peut aligner sans disposer d&#8217;une mesure, si bien que ces deux processus ne peuvent constituer deux
&#233;tapes successives. Cette interd&#233;pendance renvoie simplement &#224; l&#8217;unicit&#233; de l&#8217;objectif effectivement pos&#233; : &#233;tablir
dans quelle mesure des &#233;l&#233;ments &#233;ventuellement diff&#233;rents peuvent malgr&#233; tout &#234;tre consid&#233;r&#233;s comme semblables,
soit pour quantifier ces diff&#233;rences (dans le cas de la mesure), soit pour assimiler des unit&#233;s &#171; similaires &#187; (dans le
cas de l&#8217;alignement). Il est donc n&#233;cessaire de disposer d&#8217;une m&#233;thode unifi&#233;e pour la mesure et l&#8217;alignement.
</p>
<p>3.2 Le d&#233;saccord comme cr&#233;ateur de d&#233;sordre
</p>
<p>Consid&#233;rons un ensemble de n annotateurs travaillant sur un m&#234;me texte et une m&#234;me t&#226;che d&#8217;annotation. Id&#233;a-
lement, si la t&#226;che d&#8217;annotation &#233;tait rigoureusement &#233;tablie, et si elle relevait de ph&#233;nom&#232;nes ne pr&#234;tant pas &#224;
confusion, les n annotateurs devraient d&#233;livrer le m&#234;me ensemble d&#8217;&#233;l&#233;ments annot&#233;s. C&#8217;est cependant bien en-
tendu un constat que nous ne faisons jamais. Pour autant, les diff&#233;rentes propositions des annotateurs devraient en
grande partie converger, &#224; d&#233;faut de quoi la t&#226;che propos&#233;e devrait &#234;tre consid&#233;r&#233;e comme un &#233;chec (t&#226;che trop peu
sp&#233;cifi&#233;e, ph&#233;nom&#232;nes &#233;tudi&#233;s ne permettant aucun consensus...). Ainsi, pour une campagne d&#8217;annotation donn&#233;e,
on constatera un &#171; taux d&#8217;accord &#187; inter-annotateurs situ&#233; entre l&#8217;id&#233;al constitu&#233; par une annotation unique (les
n annotateurs ont annot&#233; exactement le m&#234;me ensemble d&#8217;unit&#233;s) et le cas le pire constitu&#233; par n g&#233;n&#233;rateurs
al&#233;atoires d&#8217;annotations. L&#8217;enjeu de la mesure d&#8217;accord est de situer ce jeu d&#8217;annotations entre ces deux extr&#234;mes.
</p>
<p>Notre proposition est de consid&#233;rer que l&#8217;annotation multiple est potentiellement g&#233;n&#233;ratrice de d&#233;sordre. Le cas
id&#233;al (dans lequel tous les annotateurs ont d&#233;livr&#233; exactement le m&#234;me jeu d&#8217;annotations) peut &#234;tre consid&#233;r&#233;
comme parfaitement ordonn&#233; : l&#8217;information port&#233;e par les annotations d&#8217;un annotateur donn&#233; est parfaitement
confirm&#233;e par les annotations de chacun des autres annotateurs. Par rapport &#224; cette situation id&#233;ale, op&#233;rons un
ensemble de transformations &#233;l&#233;mentaires sur un certain nombre d&#8217;unit&#233;s : d&#233;placement de l&#8217;une des deux bornes
d&#8217;une unit&#233;, requalification de sa cat&#233;gorie, ou encore, suppression pure et simple. Chacune de ces transformations
va engendrer un certain d&#233;sordre au sein de ce syst&#232;me. Le d&#233;sordre total obtenu pour un ensemble de transforma-
tions &#233;l&#233;mentaires sera la r&#233;sultante de l&#8217;ensemble des d&#233;sordres &#233;l&#233;mentaires ainsi cr&#233;&#233;s. Nous d&#233;finirons ci-apr&#232;s
un cadre formel et une m&#233;thode de calcul de ce d&#233;sordre, et poserons que le taux d&#8217;accord inter-annotateurs cor-
respond au niveau d&#8217;ordre du syst&#232;me relativement au niveau d&#8217;ordre d&#8217;un syst&#232;me construit al&#233;atoirement.
</p>
<p>4 Dissimilarit&#233;, alignement, entropie et accord
</p>
<p>4.1 D&#233;finitions : unit&#233;, annotateur, jeu d&#8217;annotations
</p>
<p>Nous d&#233;finissons tout d&#8217;abord A l&#8217;ensemble des annotateurs, T l&#8217;ensemble des textes et U l&#8217;ensemble des unit&#233;s.
Unit&#233; : une unit&#233; u poss&#232;de une cat&#233;gorie not&#233;e cat(u), et une position donn&#233;e par ses deux bornes, correspondant
chacune &#224; un indice de caract&#232;re du texte, not&#233;es respectivement start(u) et end(u), start et end &#233;tant donc des
fonctions de U vers N+. Nous d&#233;finissons l&#8217;&#233;galit&#233; entre deux unit&#233;s comme suit :
</p>
<p>&#8704;(u, v) &#8712; U2, u = v &#8660; ((cat(u) = cat(v)) &#8743; (start(u) = start(v)) &#8743; (end(u) = end(v)))
</p>
<p>Une unit&#233; est produite par un annotateur donn&#233;, et est relative &#224; un texte donn&#233; (dans le cadre d&#8217;une campagne
donn&#233;e). L&#8217;unit&#233; &#233;manant de l&#8217;annotateur a et de rang i est not&#233;e uia.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE APPROCHE HOLISTE ET UNIFI&#201;E DE L&#8217;ALIGNEMENT ET DE LA MESURE D&#8217;ACCORD
</p>
<p>Jeu d&#8217;Annotations : un jeu d&#8217;annotations j est un ensemble d&#8217;unit&#233;s relatives &#224; un m&#234;me texte et produites par
un ensemble donn&#233; d&#8217;annotateurs. Un tel jeu est dit al&#233;atoire quand ses annotateurs sont des processus al&#233;atoires.
</p>
<p>4.2 Dissimilarit&#233; entre deux unit&#233;s
</p>
<p>Une dissimilarit&#233; est une fonction d : U2 &#8594; R+, telle que :
</p>
<p>&#8704;(u, v) &#8712; U2,
{
d(u, v) = d(v, u) (d est sym&#233;trique)
d(u, v) = 0&#8660; u = v
</p>
<p>Une dissimilarit&#233; n&#8217;est pas n&#233;cessairement une distance au sens math&#233;matique dans la mesure o&#249; l&#8217;in&#233;galit&#233; trian-
gulaire n&#8217;est pas impos&#233;e. Nous verrons pourquoi.
</p>
<p>4.2.1 Dissimilarit&#233; positionnelle dpos
</p>
<p>Il est possible de proposer diff&#233;rentes mesures de dissimilarit&#233;s positionnelles pour diff&#233;rents paradigmes d&#8217;anno-
tation. Nous nous en tiendrons ici &#224; la dissimilarit&#233; suivante, bien adapt&#233;e &#224; des annotations sporadiques :
</p>
<p>dpos&#8722;sporadique(u, v) =
</p>
<p>&#63723;&#63725; |start(u)&#8722; start(v)|+ |end(u)&#8722; end(v)|(
(end(u)&#8722;start(u))+(end(v)&#8722;start(v))
</p>
<p>2
</p>
<p>)
&#63734;&#63736;2 (1)
</p>
<p>Cette dissimilarit&#233; rend compte des diff&#233;rences entre les bornes gauches des deux unit&#233;s ainsi qu&#8217;entre leurs
bornes droites. Sa croissance est quadratique par rapport &#224; la somme de ces diff&#233;rences, si bien que l&#8217;on p&#233;nalise
d&#8217;autant plus les &#233;carts importants. Elle ne respecte pas l&#8217;in&#233;galit&#233; triangulaire pour cette raison. Par ailleurs, le
fait de diviser les diff&#233;rences par la moyenne des deux longueurs des unit&#233;s (cf. d&#233;nominateur) permet de rendre
la dissimilarit&#233; insensible aux changements d&#8217;&#233;chelle. C&#8217;est un choix qui peut &#234;tre discut&#233; selon la campagne
d&#8217;annotation envisag&#233;e. A titre d&#8217;exemple, une seconde dissimilarit&#233; positionnelle est actuellement exp&#233;riment&#233;e
pour &#233;muler la distance de Hamming g&#233;n&#233;ralis&#233;e, bas&#233;e sur la longueur moyenne des unit&#233;s not&#233;e k :
</p>
<p>dpos&#8722;Hamming(u, v) =
|end(u)&#8722; end(v)|
</p>
<p>k/2
(2)
</p>
<p>4.2.2 Dissimilarit&#233; cat&#233;gorielle dcat
</p>
<p>Soit C l&#8217;ensemble des cat&#233;gories. Pour une campagne d&#8217;annotation donn&#233;e, n cat&#233;gories distinctes sont d&#233;finies.
</p>
<p>Nous d&#233;finissons tout d&#8217;abord la distance cat&#233;gorielle entre cat&#233;gories distcat au moyen d&#8217;une matrice carr&#233;e
de taille n, prenant l&#8217;ensemble des cat&#233;gories &#224; la fois sur les lignes et sur les colonnes. Chaque case indique
la distance entre deux cat&#233;gories par une valeur situ&#233;e dans l&#8217;intervalle [0, 1]. La valeur 0 signifie l&#8217;&#233;galit&#233; des
cat&#233;gories (du fait des propri&#233;t&#233;s d&#8217;une distance), tandis que la valeur 1, maximale, signifie que les deux cat&#233;gories
sont incompatibles (l&#8217;une ne peut en aucun cas se substituer &#224; l&#8217;autre). Une telle matrice est n&#233;cessairement
sym&#233;trique et poss&#232;de une diagonale nulle, du fait, l&#224; encore, des propri&#233;t&#233;s d&#8217;une distance. Voici un exemple de
matrice rendant compte d&#8217;un ensemble de 3 cat&#233;gories. Elle permet une correspondance possible entre une unit&#233;
de type cat1 avec une unit&#233; de type cat2, avec un co&#251;t de 0.5 (qui sera &#224; mettre en balance avec les co&#251;ts issus des
dissimilarit&#233;s positionnelles), et elle interdit les autres correspondances :
</p>
<p>cat1 cat2 cat3
cat1 0 0.5 1
cat2 0.5 0 1
cat3 1 1 0
</p>
<p>TAB. 1 &#8211; Exemple de matrice pour 3 cat&#233;gories</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>On d&#233;finit alors la dissimilarit&#233; cat&#233;gorielle entre deux unit&#233;s par :
</p>
<p>dcat(u, v) = distcat(cat(u), cat(v)).&#8710;&#8709; (3)
</p>
<p>&#8710;&#8709; est une constante qui sera d&#233;finie ult&#233;rieurement et qui assure ici notamment que deux unit&#233;s de cat&#233;gories
distinctes ne seront jamais align&#233;es.
</p>
<p>4.2.3 Dissimilarit&#233;s combin&#233;e dcombi
</p>
<p>Soient deux dissimilarit&#233;s d1 et d2 donn&#233;es. On d&#233;finit dcombi(d1,d2,&#945;,&#946;) par :
</p>
<p>dcombi(d1,d2,&#945;,&#946;)(u, v) = &#945;.d1(u, v) + &#946;.d2(u, v) (4)
</p>
<p>Cette combinaison lin&#233;aire de dissimilarit&#233;s est elle-m&#234;me une dissimilarit&#233;. Elle permet notamment, dans le cas
o&#249; &#945; = 0.5 et &#946; = 0.5, de donner un poids &#233;gal &#224; deux dissimilarit&#233;s (par ex. positionnelle et cat&#233;gorielle).
</p>
<p>4.3 Alignement
</p>
<p>4.3.1 Alignement unitaire a&#775;
</p>
<p>Un alignement unitaire a&#775; est un i-uplet, i &#233;tant compris entre 1 et n, n &#233;tant le nombre d&#8217;annotateurs, contenant
au plus une unit&#233; de chaque annotateur. Pour des raisons d&#8217;homog&#233;n&#233;it&#233; facilitant notamment son impl&#233;mentation
informatique, nous cr&#233;ons une unit&#233; fictive vide, not&#233;e u&#8709;, correspondant &#224; la r&#233;ification du fait qu&#8217;un alignement
unitaire ne contienne aucune unit&#233; pour un annotateur donn&#233;. Nous ferons comme si cet alignement contenait cette
unit&#233; fictive pour cet annotateur l&#224;, si bien que tout alignement unitaire devient finalement, dans tous les cas, un
n-uplet, contenant au moins une unit&#233; non vide, et, pour chaque annotateur, soit l&#8217;une de ses unit&#233;s, soit u&#8709;. Pour
n annotateurs num&#233;rot&#233;s de 1 &#224; n, et ayant respectivement annot&#233; cardi unit&#233;s, le nombre d&#8217;alignement unitaires
qu&#8217;il est possible de g&#233;n&#233;rer est de (
</p>
<p>&#8719;n
i=1 cardi)&#8722; 1 (en retirant l&#8217;alignement ne contenant que des u&#8709;).
</p>
<p>4.3.2 Alignement a&#772;
</p>
<p>Pour un jeu d&#8217;annotations donn&#233;, un alignement a&#772; est d&#233;fini comme un2 ensemble d&#8217;alignements unitaires tel que
chaque unit&#233; de chaque annotateur appara&#238;t dans un et un seul de ses alignements unitaires.
</p>
<p>4.4 Alignement et entropie3
</p>
<p>4.4.1 Entropie d&#8217;un alignement unitaire
</p>
<p>L&#8217;entropie d&#8217;un alignement unitaire a&#775;, not&#233;e e&#775;(a&#775;), est d&#233;finie pour une dissimilarit&#233; dx donn&#233;e comme la valeur
moyenne des dissimilarit&#233;s deux &#224; deux de ses unit&#233;s constituantes :
</p>
<p>e&#775;(a&#775;) =
1
C2n
&#183;
&#8721;
</p>
<p>(u,v)&#8712;a&#775;2
dx(u, v) (5)
</p>
<p>Cependant, &#233;tant donn&#233; qu&#8217;un alignement unitaire peut comporter des unit&#233;s fictives u&#8709;, il est n&#233;cessaire de d&#233;finir
la dissimilarit&#233; entre une unit&#233; r&#233;elle et l&#8217;unit&#233; fictive u&#8709;.
</p>
<p>Pour toute dissimilarit&#233; dx, pour toute unit&#233; u, dx(u, u&#8709;) = dx(u&#8709;, u) = &#8710;&#8709;, constante qui est &#224; d&#233;finir pour
une campagne donn&#233;e. En effet, cette valeur indique jusqu&#8217;&#224; quel seuil de dissimilarit&#233; il convient de pr&#233;f&#233;rer
aligner une unit&#233; avec une autre plut&#244;t qu&#8217;avec u&#8709;. Par exemple, si on choisit comme dissimilarit&#233; positionnelle
</p>
<p>2Notons que, pour n annotateurs qui auraient chacun cr&#233;&#233; le m&#234;me nombre p d&#8217;unit&#233;s, le nombre d&#8217;alignements qu&#8217;il est possible de
g&#233;n&#233;rer est sup&#233;rieur &#224; (p!)n&#8722;1, ce qui d&#233;passe tr&#232;s rapidement les capacit&#233;s de stockage et de traitement des machines.
</p>
<p>3Le terme entropie est ici quelque peu usurp&#233;, pris seulement pour &#233;voquer la notion de d&#233;sordre.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE APPROCHE HOLISTE ET UNIFI&#201;E DE L&#8217;ALIGNEMENT ET DE LA MESURE D&#8217;ACCORD
</p>
<p>dpos&#8722;sporadique, et que l&#8217;on souhaite que deux unit&#233;s de m&#234;me longueur soient alignables tant qu&#8217;elles se touchent
(et en faisant abstraction de la dissimilarit&#233; cat&#233;gorielle &#233;ventuelle), on calcule la dissemblance d&#8217;une telle confi-
guration (unit&#233; u positionn&#233;e de x &#224; x + l et v positionn&#233;e de x + l &#224; x + 2l, soit dpos&#8722;sporadique(u, v) =
((l + l)/l)2 = 22 = 4) et on pose donc &#8710;&#8709; = 4. Par ailleurs, concernant la dissimilarit&#233; cat&#233;gorielle, la formule
(3) montre qu&#8217;une valeur de 1 dans la matrice des distances fait syst&#233;matiquement pr&#233;f&#233;rer le choix de u&#8709; (va-
leur &#8710;&#8709;) &#224; une unit&#233; de la cat&#233;gorie concern&#233;e (valeur &#8710;+&#8709; ), m&#234;me si la dissimilarit&#233; positionnelle est nulle. Bien
s&#251;r, lorsque l&#8217;on combine dpos et dcat, les &#233;cart positionnels et cat&#233;goriels s&#8217;ajoutant, on en vient d&#8217;autant plus
rapidement &#224; d&#233;passer la valeur &#8710;&#8709; et &#224; pr&#233;f&#233;rer u&#8709; &#224; une unit&#233; r&#233;elle.
</p>
<p>Enfin, le choix de la valeur moyenne des dissimilarit&#233; plut&#244;t que leur somme permet de s&#8217;abstraire du nombre
d&#8217;annotateurs.
</p>
<p>4.4.2 Entropie d&#8217;un alignement
</p>
<p>L&#8217;entropie d&#8217;un alignement a&#772;, not&#233;e e&#772;(a&#772;), est la valeur moyenne de l&#8217;entropie de ses alignements unitaires :
</p>
<p>e&#772;(a&#772;) =
1
|a&#772;| &#183;
</p>
<p>|a&#772;|&#8721;
i=1
</p>
<p>e&#775;(a&#775;i) (6)
</p>
<p>Nous faisons le choix de consid&#233;rer la valeur moyenne des entropies unitaires plut&#244;t que leur somme afin par
exemple que l&#8217;entropie d&#8217;un jeu multiple d&#8217;annotations qui serait constitu&#233; de la duplication d&#8217;un jeu donn&#233; pos-
s&#232;de la m&#234;me entropie que ce dernier et non pas son double.
</p>
<p>4.5 Alignement id&#233;al et mesure d&#8217;accord
</p>
<p>Alignement id&#233;al a&#770; . Un alignement a&#772; d&#8217;un jeu d&#8217;annotation j est consid&#233;r&#233; comme id&#233;al vis-&#224;-vis d&#8217;une fonction
de dissimilarit&#233; dx donn&#233;e s&#8217;il minimise son entropie parmi tous les alignements possibles de j. Il est alors not&#233; a&#770;.
</p>
<p>Entropie d&#8217;un jeu d&#8217;annotations e(j). L&#8217;entropie d&#8217;un jeu d&#8217;annotations j, not&#233;e e(j), pour une fonction de
dissimilarit&#233; dx donn&#233;e, est d&#233;finie comme l&#8217;entropie de son ou de ses alignements id&#233;aux e&#772;(a&#770;). Par prudence,
nous sommes contraints de parler de &#171; ses alignements id&#233;aux &#187; et non pas de son alignement id&#233;al car, m&#234;me si
c&#8217;est peu probable, plusieurs alignements distincts peuvent minimiser l&#8217;entropie d&#8217;un jeu d&#8217;annotations.
</p>
<p>Nous venons d&#8217;&#233;tablir les deux d&#233;finitions cruciales de notre approche, qui rendent compte en particulier de son
caract&#232;re unifi&#233;. En effet, le choix de l&#8217;alignement id&#233;al se fait sur la base de l&#8217;entropie, donc de la mesure d&#8217;accord
(cf. ci-dessous) entre annotateurs, et, r&#233;ciproquement et parall&#232;lement, la mesure d&#8217;accord se fait sur la base de
l&#8217;alignement id&#233;al.
</p>
<p>Corpus : un corpus c est un ensemble donn&#233; de textes et l&#8217;ensemble des jeux d&#8217;annotations relatifs &#224; ces textes.
</p>
<p>Entropie al&#233;atoire ealeatoire. Pour un corpus c donn&#233;, soit P l&#8217;ensemble des processus al&#233;atoires d&#8217;annotation
actuellement disponibles4. &#8704;p &#8712; P , soit eAvg(p) la moyenne des entropies obtenues sur un ensemble significatif
de jeux d&#8217;annotations produits par p. L&#8217;entropie al&#233;atoire de ce corpus, not&#233;e ealeatoire(c), est d&#233;finie comme
min({eAvg(p)/p &#8712; P}). C&#8217;est une valeur qui sera susceptible de s&#8217;am&#233;liorer (diminuer) au fil des avanc&#233;es en
termes de g&#233;n&#233;ration al&#233;atoire astucieuse.
</p>
<p>Mesure d&#8217;accord. La mesure d&#8217;accord inter-annotateurs d&#8217;un jeu d&#8217;annotations est alors donn&#233;e par :
</p>
<p>&#8704;j &#8712; c, accord(j) = ealeatoire(c)&#8722; e(j)
ealeatoire(c)
</p>
<p>(7)
</p>
<p>Si les annotateurs sont parfaitement d&#8217;accord, comme dans le cas id&#233;al &#233;voqu&#233; au d&#233;but de cet article, l&#8217;entropie
r&#233;sultante est nulle, si bien que la mesure d&#8217;accord est &#233;gale &#224; 1. Au contraire, si les annotateurs ne font pas mieux
que le hasard, leur taux d&#8217;accord est nul, voire n&#233;gatif.
</p>
<p>4Nous proposons deux tels processus de g&#233;n&#233;ration al&#233;atoire en section suivante.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>La m&#233;thode propos&#233;e peut &#234;tre qualifi&#233;e d&#8217;holiste dans la mesure o&#249; c&#8217;est la consid&#233;ration de l&#8217;ensemble des
annotations qui permet de d&#233;terminer les alignements unitaires. Il est impossible de partir d&#8217;alignements unitaires
&#171; s&#251;rs &#187; pour constituer, de fa&#231;on ascendante, l&#8217;alignement id&#233;al complet.
</p>
<p>5 Op&#233;rationalisation : vers une m&#233;thode d&#8217;impl&#233;mentation de l&#8217;aligne-
ment et de la mesure d&#8217;accord holistes
</p>
<p>Pour toute la suite de cet article, nous allons utiliser la dissimilarit&#233; positionnelle dpos&#8722;sporarique, et une dissi-
milarit&#233; cat&#233;gorielle d&#233;finie par une matrice remplie de 1, &#224; l&#8217;exception de la diagonale qui est, comme toujours,
nulle. Son r&#244;le est ici limit&#233; &#224; l&#8217;interdiction des couplages entre unit&#233;s de cat&#233;gories distinctes, afin de limiter
les ph&#233;nom&#232;nes entrant en jeu dans le cadre de cet article. Enfin, nous combinons ces deux dissimilarit&#233;s en les
sommant via dcombi(dpos&#8722;sporadique,dcat,1,1).
</p>
<p>Les d&#233;finitions que nous venons de poser ont valeur d&#8217;un point de vue th&#233;orique, mais leur impl&#233;mentation infor-
matique pose un important probl&#232;me de complexit&#233;, en raison du caract&#232;re holiste de la m&#233;thode propos&#233;e. Un
parcours de toutes les possibilit&#233;s est en effet inenvisageable, l&#8217;espace de recherche &#233;tant minor&#233; par (p!)n&#8722;1. A
titre d&#8217;illustration, mentionnons que pour 5 annotateurs ayant simplement annot&#233; chacun 5 unit&#233;s, cette minoration
est de (5!)4 = 1204, soit plus de 207 millions.
</p>
<p>Nous allons &#233;tablir des principes permettant de r&#233;duire cet espace de recherche de fa&#231;on &#224; obtenir une m&#233;thode
utilisable avec des jeux de donn&#233;es r&#233;els, tels que 4 annotateurs ayant chacun annot&#233; une centaine d&#8217;unit&#233;s.
</p>
<p>5.1 Une r&#233;duction de l&#8217;espace de recherche
</p>
<p>Parmi les innombrables possibilit&#233;s d&#8217;alignements qu&#8217;offre l&#8217;espace de recherche, une immense majorit&#233; reposent
sur des alignements unitaires improbables. Nous allons d&#233;montrer qu&#8217;il est possible d&#8217;&#233;liminer un grand nombre
d&#8217;entre eux sans &#233;carter l&#8217;alignement id&#233;al.
</p>
<p>En effet, consid&#233;rons l&#8217;alignement id&#233;al a&#770;, de cardinalit&#233; m. Soit a&#775; l&#8217;un quelconque de ses alignements unitaires.
Par commodit&#233;, nous lui donnons l&#8217;indice 1 (a&#775; = a&#775;1), les autres ayant donc les indices de 2 &#224; m. Cet alignement
unitaire a&#775; contient n unit&#233;s (r&#233;elles ou u&#8709;). Pour chacune de ces unit&#233;s ui (avec 1 &#8804; i &#8804; n), cr&#233;ons l&#8217;alignement
unitaire a&#775;m+i = (ui, u&#8709;, ..., u&#8709;) de cardinalit&#233; n. Il est possible de cr&#233;er un alignement a&#772; constitu&#233; de l&#8217;ensemble
des alignements unitaires de a&#770; \ {a&#775;}, auquel on ajoute les alignements unitaires a&#775;m+1 &#224; a&#775;m+n que l&#8217;on vient de
cr&#233;er5. Il est de cardinalit&#233; m+ n&#8722; 1. On a, du fait que a&#770; minimise l&#8217;entropie :
</p>
<p>e&#772;(a&#770;) &#8804; e&#772;(a&#772;)&#8658; 1
m
</p>
<p>m&#8721;
i=1
</p>
<p>e&#775;(a&#775;i) &#8804; 1
m+ n&#8722; 1
</p>
<p>m+n&#8721;
i=2
</p>
<p>e&#775;(a&#775;i)&#8658;
m&#8721;
i=1
</p>
<p>e&#775;(a&#775;i) &#8804; m
m+ n&#8722; 1
</p>
<p>m+n&#8721;
i=2
</p>
<p>e&#775;(a&#775;i) &#8804;
m+n&#8721;
i=2
</p>
<p>e&#775;(a&#775;i)
</p>
<p>&#8658; e&#775;(a&#775;1) &#8804;
m+n&#8721;
i=m+1
</p>
<p>e&#775;(a&#775;i)
</p>
<p>et comme &#8704;i &gt; m, a&#775;i = &#8710;&#8709;, et que l&#8217;on a pos&#233; a&#775; = a&#775;1,
</p>
<p>&#8658; e&#775;(a&#775;) &#8804; n &#183;&#8710;&#8709; (8)
On a donc major&#233; l&#8217;entropie unitaire de tout alignement unitaire candidat &#224; l&#8217;alignement id&#233;al. Ainsi, sur exemple
r&#233;el, pour 3 annotateurs cr&#233;ant chacun 25 unit&#233;s, on passe d&#8217;environ 19000 &#224; 1000 alignements unitaires.
</p>
<p>5.2 Un algorithme rapide pour l&#8217;obtention d&#8217;une solution approch&#233;e
</p>
<p>Une fois l&#8217;ensemble des alignements unitaires (restreint aux seuls alignements susceptibles d&#8217;appartenir &#224; la so-
lution, cf. point pr&#233;c&#233;dent) g&#233;n&#233;r&#233;, trions ce dernier, et obtenons ainsi la liste Linitial. L&#8217;algorithme 1 permet
</p>
<p>5a&#772; est bien un alignement, puisque chacune des unit&#233;s appara&#238;t dans un et un seul alignement unitaire.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE APPROCHE HOLISTE ET UNIFI&#201;E DE L&#8217;ALIGNEMENT ET DE LA MESURE D&#8217;ACCORD
</p>
<p>d&#8217;obtenir une solution approch&#233;e de la recherche d&#8217;un alignement id&#233;al. Sa complexit&#233; observ&#233;e est telle qu&#8217;il est
utilisable en des temps raisonnables, comme le montre le tableau 2.
</p>
<p>Algorithm 1 Algorithme rapide pour une solution approch&#233;e
Require: Linitial, L, L&#8722; des listes, i &#8712; N, a&#775; un alignement unitaire
</p>
<p>1: L&#8592; Linitial
2: i&#8592; 0
3: while i &lt; size(L)&#8722; 1 do
4: a&#775;&#8592; L [i]
5: L&#8722; &#8592; L [i+ 1, (size(L)&#8722; 1)]
6: Retirer de L&#8722; tous les alignements contenant (au moins) l&#8217;une des unit&#233;s de a&#775;
7: i&#8592; i+ 1
8: end while
</p>
<p>Nb. d&#8217;annotateurs Nb. d&#8217;unit&#233;s par annotateur
Espace de recherche
(alignements unitaires
apr&#232;s filtrage)
</p>
<p>Temps d&#8217;ex&#233;cution
</p>
<p>Cas 1 3 25 1145 Instantan&#233;
Cas 2 3 100 4347 &lt; 1 sec.
Cas 3 4 100 38624 5 sec.
Cas 4 4 200 69994 16 sec.
Cas 5 5 25 96794 9 sec.
</p>
<p>TAB. 2 &#8211; Temps d&#8217;ex&#233;cution de l&#8217;algorithme 1
</p>
<p>Les alignements r&#233;sultant de cette m&#233;thode ont &#233;t&#233; &#233;valu&#233;s qualitativement, par observation graphique de sorties
telles que sur la figure 1. Si l&#8217;on observe localement quelques croisements, on notera toutefois qu&#8217;ils sont rares
et de faible amplitude. Nous consid&#233;rons que le degr&#233; de pr&#233;cision obtenu sur le calcul d&#8217;entropie qui en r&#233;sulte
suffira aux exp&#233;riences men&#233;es dans la pr&#233;sente &#233;tude.
</p>
<p>FIG. 1 &#8211; Exemple de r&#233;sultat d&#8217;alignement avec l&#8217;algorithme 1 (un annotateur par ligne)
</p>
<p>5.3 Vers une valeur minimale de ealeatoire
</p>
<p>En l&#8217;absence provisoire de l&#8217;alignement id&#233;al, nous nous contenterons, pour la suite de cette &#233;tude, de l&#8217;approxi-
mation obtenue ci-dessus. Il reste &#224; calculer la mesure d&#8217;accord, c&#8217;est-&#224;-dire &#224; situer l&#8217;entropie des annotations
observ&#233;es par rapport &#224; ce que pourrait produire le hasard. Pour ce faire, nous chercherons &#224; simuler le travail
d&#8217;un observateur judicieux qui annoterait en aveugle un nouveau texte (en connaissant sa taille, mais sans pouvoir
le lire), en s&#8217;inspirant des annotations faites par d&#8217;autres sur d&#8217;autres textes et en cherchant minimiser l&#8217;entropie.
</p>
<p>Une premi&#232;re strat&#233;gie (random1) de g&#233;n&#233;ration al&#233;atoire d&#8217;annotations a consist&#233;, tout simplement, &#224; observer
des donn&#233;es r&#233;elles, en tenant compte du nombre (plages) d&#8217;annotations par annotateur, puis &#224; g&#233;n&#233;rer des anno-
tations conformes &#224; ces observations, et de taille al&#233;atoire. Il nous a toutefois sembl&#233; qu&#8217;un hasard bien entendu
devrait prendre en compte des r&#233;gularit&#233;s plus fines observables sur un corpus donn&#233;, telles que (et de fa&#231;on non
limitative) : telle cat&#233;gorie conduit &#224; un pavage complet du texte, telle autre donne lieu &#224; des tailles relativement
stables, les textes commencent ou se terminent toujours par tel type particulier... La strat&#233;gie random2 vise &#224;
prendre en compte de telles r&#233;gularit&#233;s. Elle consiste &#224; assembler, au sein d&#8217;un m&#234;me texte virtuel, des annota-
tions &#233;manant de textes r&#233;els diff&#233;rents, en respectant la r&#232;gle suivante : pour g&#233;n&#233;rer une annotation virtuelle
de n annotateurs, on utilise n textes diff&#233;rents dans chacun desquels on puise les annotations d&#8217;un et d&#8217;un seul
annotateur6. Nous obtenons ainsi un jeu d&#8217;annotations qui respecte par construction la distribution des unit&#233;s dans
</p>
<p>6Une m&#233;thode permettant de pallier les diff&#233;rences de taille entre les diff&#233;rents textes a &#233;t&#233; mise en place.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>les textes (r&#233;gularit&#233; de position, de quantit&#233;...). Il est d&#8217;autre part effectivement al&#233;atoire, puisque les annotations
sont assembl&#233;es en aveugle : elles sont issues de textes sans rapport entre eux et ni avec le texte virtuel7. L&#8217;exp&#233;-
rience rapport&#233;e ci-dessous confirme la sup&#233;riorit&#233; de cette strat&#233;gie random2 : nous obtenons en effet des tirages
al&#233;atoires ayant une entropie plus faible que celle provenant d&#8217;un tirage r&#233;alis&#233; selon random1 (3.48 au lieu de
3.67 pour un maximum possible de 4, soit 57 % de d&#233;sordre en moins).
</p>
<p>6 Observations exp&#233;rimentales
</p>
<p>6.1 Exp&#233;rimentations sur un jeu de donn&#233;es factices
</p>
<p>Afin de disposer d&#8217;une grille de lecture permettant de savoir &#224; quoi correspondent les valeurs d&#8217;accord situ&#233;es entre
0 et 1 (1 &#233;tant l&#8217;accord parfait, et 0 ce qu&#8217;est capable de faire le hasard), nous avons proc&#233;d&#233; &#224; l&#8217;&#233;tablissement em-
pirique de deux courbes correspondant &#224; deux modes de lecture parall&#232;les. En premier lieu, nous cherchons &#224;
savoir comment fluctue le taux d&#8217;accord d&#8217;un jeu de donn&#233;es &#224; partir d&#8217;un &#233;tat parfait vers un &#233;tat de plus en plus
d&#233;grad&#233; du seul point de vue du placement des unit&#233;s. Pour ce faire, un algorithme cr&#233;e al&#233;atoirement les annota-
tions d&#8217;un premier annotateur (25 unit&#233;s r&#233;parties al&#233;atoirement et de tailles al&#233;atoires), puis cr&#233;e des annotations
pour deux autres annotateurs par d&#233;gradation du premier jeu d&#8217;annotation selon un facteur k, selon le principe sui-
vant : chaque unit&#233; de l&#8217;annotateur 1 est dupliqu&#233;e pour chacun des annotateurs 2 et 3, et modifi&#233;e al&#233;atoirement
par translation de chacune de ses deux bornes d&#8217;un vecteur compris entre &#8722;k2 et +k2 fois la longueur de l&#8217;unit&#233;
dupliqu&#233;e. En second lieu, nous nous int&#233;ressons aux fluctuations relatives &#224; un jeu de donn&#233;es poss&#233;dant de plus
en plus de faux n&#233;gatifs. Cette fois, l&#8217;algorithme cr&#233;e les annotations des annotateurs 2 et 3 en dupliquant chacune
des unit&#233;s de l&#8217;annotateur 1 avec une probabilit&#233; p d&#8217;oubli (faux n&#233;gatif). Avec p = 0.5, il y aura en moyenne
une unit&#233; sur deux non pr&#233;sente dans les jeux 2 et 3 par rapport au jeu 1. Par contre, les entit&#233;s conserv&#233;es restent
parfaitement align&#233;es avec les originales. Les fluctuations obtenues sont report&#233;es dans les graphes suivants.
</p>
<p>0 1 2 3 4
</p>
<p>0.
2
</p>
<p>0.
4
</p>
<p>0.
6
</p>
<p>0.
8
</p>
<p>1.
0
</p>
<p>D&#233;gradation positionnelle
</p>
<p>A
cc
</p>
<p>or
d
</p>
<p>0.0 0.2 0.4 0.6 0.8 1.0
</p>
<p>0.
0
</p>
<p>0.
2
</p>
<p>0.
4
</p>
<p>0.
6
</p>
<p>0.
8
</p>
<p>1.
0
</p>
<p>D&#233;gradation par omission
</p>
<p>A
cc
</p>
<p>or
d
</p>
<p>FIG. 2 &#8211; &#201;volution du taux d&#8217;accord selon la d&#233;gradation appliqu&#233;e
</p>
<p>Il est ainsi possible de voir quel est l&#8217;&#233;quivalent d&#8217;une valeur d&#8217;accord donn&#233;e soit en termes de d&#233;gradation
positionnelle, soit en termes d&#8217;oublis (faux n&#233;gatifs). &#192; titre d&#8217;illustration, la figure 3 donne deux exemples issus
de ces deux paradigmes d&#8217;interpr&#233;tation correspondant &#224; la m&#234;me valeur d&#8217;accord de 0.5.
</p>
<p>6.2 Exp&#233;rimentation sur un jeu de donn&#233;es r&#233;elles
</p>
<p>Une premi&#232;re exp&#233;rimentation sur des donn&#233;es r&#233;elles a &#233;t&#233; r&#233;alis&#233;e sur la base du corpus &#233;tabli par (Labadi&#233; et al.,
2010), dont les annotations portent sur la segmentation th&#233;matique des textes, comportent plusieurs cat&#233;gories, et
comprennent des unit&#233;s superpos&#233;es au sein m&#234;me des annotations d&#8217;un annotateur.
</p>
<p>7Ajoutons que cette m&#233;thode permet de g&#233;n&#233;rer &#224; moindre co&#251;t des donn&#233;es al&#233;atoires en quantit&#233; importante. Pour a annotateurs et t
textes (t &#8805; a), on peut en effet g&#233;n&#233;rer jusqu&#8217;&#224; Cat &#183; aa combinaisons diff&#233;rentes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE APPROCHE HOLISTE ET UNIFI&#201;E DE L&#8217;ALIGNEMENT ET DE LA MESURE D&#8217;ACCORD
</p>
<p>Accord de 0.5 par d&#233;gradation positionnelle Accord de 0.5 par d&#233;gradation par omissions
</p>
<p>FIG. 3 &#8211; Illustrations d&#8217;un accord de 0.5
</p>
<p>Nb. annot. eobs erandom1 a1 erandom2 a2
Texte 31 3 3.44 3.76 0.09 3.48 0.01
Texte 121 3 3.20 3.76 0.15 3.48 0.08
Texte 20 4 2.81 3.72 0.24 3.34 0.16
Texte 14 3 2.79 3.76 0.25 3.48 0.20
Texte 1 3 2.67 3.76 0.29 3.48 0.23
Texte 13 3 2.37 3.76 0.36 3.48 0.32
Texte 6 3 2.18 3.76 0.42 3.48 0.37
</p>
<p>TAB. 3 &#8211; R&#233;sultats obtenus sur donn&#233;es r&#233;elles
</p>
<p>Le tableau 3 rapporte les r&#233;sultats obtenus sur 7 de ces textes (en utilisant la m&#234;me dissimilarit&#233; que pr&#233;c&#233;dem-
ment), en donnant pour chacun son entropie (eobs), celles obtenues par random1 (erandom1) et par random2
(erandom2) pour le corpus correspondant, et les mesures d&#8217;accord respectives qui en r&#233;sultent.
</p>
<p>On constate que random2 est sensiblement plus efficace que random1, faisant passer le meilleur accord de 0.42
&#224; 0.37, et que la baseline ainsi obtenue est relativement s&#233;v&#232;re dans la mesure o&#249; dans le cas le pire, l&#8217;accord
obtenu n&#8217;est que de 0.01, soit d&#8217;un niveau &#233;quivalent &#224; random2. Une observation visuelle, donc qualitative,
des 7 textes annot&#233;s, confirme l&#8217;ordre obtenu par le calcul. Mentionnons que le texte 6 donnant lieu au meilleur
accord a2 = 0.37 correspond respectivement &#224; une valeur k = 1.2 (translation des bornes jusqu&#8217;&#224; &#177;0.6 fois la
largeur des unit&#233;s associ&#233;es, mais aucune omission) et p = 0.46 (omission d&#8217;une unit&#233; dans 46% des cas, mais
positionnements parfaits) de nos deux grilles de lecture.
</p>
<p>7 Conclusions et perspectives
</p>
<p>Nous avons propos&#233; une m&#233;thode r&#233;alisant alignement et mesure d&#8217;accord dans un processus commun. Tr&#232;s g&#233;-
n&#233;rale, cette m&#233;thode autorise les variations positionnelles et cat&#233;gorielles, et ne d&#233;pend pas de la taille des entit&#233;s
annot&#233;es. Elle peut &#234;tre configur&#233;e pour chaque paradigme d&#8217;annotation, par le choix des formules de calcul de
la dissimilarit&#233; positionnelle et par l&#8217;indication des similarit&#233;s entre cat&#233;gories. Nous la disons holiste dans la
mesure o&#249; elle s&#8217;appuie sur l&#8217;int&#233;gralit&#233; des donn&#233;es pour faire des choix, l&#224; o&#249; des m&#233;thodes fen&#234;tr&#233;es comme
WindowDiff op&#232;rent localement. Par ailleurs, elle n&#8217;exige pas de jeu d&#8217;annotations de r&#233;f&#233;rence pour fonctionner
ou s&#8217;amorcer. Nous travaillons actuellement &#224; la mise en place de m&#233;thodes permettant de calculer automatique-
ment les valeurs optimales de &#8710;&#8709; et des coefficients des matrices cat&#233;gorielles (pour ce second point, voir aussi
(Fort et al., 2010)). Un algorithme permettant d&#8217;approcher la solution optimale a &#233;t&#233; d&#233;fini et nous avons proc&#233;d&#233; &#224;
une impl&#233;mentation compl&#232;te du syst&#232;me, avec rendu graphique des alignements effectu&#233;s. Cette impl&#233;mentation
sera distribu&#233;e avec la prochaine version de la plate-forme Glozz (1.1.0), devenant ainsi publiquement accessible,
et directement exploitable par les utilisateurs de cette plate-forme. Un travail est actuellement men&#233;, en partenariat
avec Jean-Philippe M&#233;tivier (GREYC), qui vise &#224; calculer dans un temps raisonnable la solution optimale. &#192; cette
fin, un syst&#232;me &#224; base de CSP (Constraint Satisfaction Problem) prend en entr&#233;e l&#8217;ensemble des alignements uni-
taires candidats &#224; la solution. Nous pourrons ainsi d&#8217;une part quantifier la diff&#233;rence d&#8217;entropie entre la solution
approch&#233;e et la solution id&#233;ale, et d&#8217;autre part proposer, mais dans un temps &#233;ventuellement beaucoup plus long,
la solution id&#233;ale.
</p>
<p>Remerciements
</p>
<p>Nous tenons &#224; remercier J&#233;r&#244;me Chauveau qui a r&#233;cemment rejoint l&#8217;&#233;quipe de d&#233;veloppement de Glozz et contri-
bu&#233; aux d&#233;veloppements n&#233;cessaires aux exp&#233;rimentations dont il est fait mention ici.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>R&#233;f&#233;rences
</p>
<p>ARTSTEIN R. &amp; POESIO M. (2008). Inter-coder agreement for computational linguistics. Computational Lin-
guistics, 34(4), 555&#8211;596.
ASHER N. (1993). Reference to Abstract Objects in Discourse. Kluwer.
</p>
<p>BESTGEN Y. (2009). Quel indice pour mesurer l&#8217;efficacit&#233; en segmentation de textes ? In Actes de TALN 2009
(Traitement automatique des langues naturelles), Senlis : ATALA LIPN.
</p>
<p>BOOKSTEIN A., KULYUKIN V. A. &amp; RAITA T. (2002). Generalized Hamming distance. Information Retrieval,
(5), 353&#8211;375.
</p>
<p>CHAROLLES M. (1997). L&#8217;encadrement du discours : Univers, champs, domaines et espaces. Cahier de Re-
cherche Linguistique, (6).
</p>
<p>COHEN J. (1960). A coefficient of agreement for nominal scales. Educational and Psychological Measurement,
20(1), 37&#8211;46.
COHEN J. (1968). Weighted kappa : Nominal scale agreement with provision for scaled disagreement or partial
credit. Psychological Bulletin, 70(4), 213&#8211;220.
FORT K., FRAN&#199;OIS C. &amp; GHRIBI M. (2010). Evaluer des annotations manuelles dispers&#233;es : les coefficients
sont-ils suffisants pour estimer l&#8217;accord inter-annotateurs ? In Traitement Automatique des Langues Naturelles
(TALN) Traitement Automatique des Langues Naturelles (TALN), p.0&#771;, Montr&#233;al France. Quaero.
</p>
<p>GROUIN C., GALIBERT O., ROSSET S., QUINTARD L. &amp; ZWEIGENBAUM P. (2011). Mesures d&#8217;&#233;valuation
pour entit&#233;s nomm&#233;es structur&#233;es. In &#201;valuation des m&#233;thodes d&#8217;Extraction de Connaissances dans les Donn&#233;es,
Brest, France.
</p>
<p>HEARST M. (1997). Texttiling : segmenting text into multi-paragraph subtopic passages. Computational Lin-
guistics, 23(1), 33&#8211;64.
KRIPPENDORFF K. (1980). Content Analysis : An Introduction to Its Methodology, chapter 12. Sage : Beverly
Hills, CA.
</p>
<p>KRIPPENDORFF K. (1995). On the reliability of unitizing contiguous data. Sociological Methodology, (25),
47&#8211;76.
</p>
<p>LABADI&#201; A., ENJALBERT P., MATHET Y. &amp; WIDL&#214;CHER A. (2010). Discourse structure annotation : Creating
reference corpora. In Workshop on Language Resource and Language Technology Standards - state of the art,
emerging needs, and future developments, La Valetta, Malta : Conference LREC 2010.
</p>
<p>LAMPRIER S., AMGHAR T., LEVRAT B. &amp; SAUBION F. (2007). On evaluation methodologies for text segmen-
tation algorithms. In , Ed., Proceedings of ICTAI 2007, p. 19&#8211;26 : .
</p>
<p>MAKHOUL J., KUBALA F., SCHWARTZ R. &amp; WEISCHEDEL R. (1999). Performance measures for information
extraction. In Proceedings of DARPA Broadcast News Workshop, p. 249&#8211;252.
</p>
<p>P&#201;RY-WOODLEY M.-P., ASHER N., ENJALBERT P., BENAMARA F., BRAS M., FABRE C., FERRARI S.,
HO-DAC L.-M., LE DRAOULEC A., MATHET Y., MULLER P., PR&#201;VOT L., REBEYROLLE J., TANGUY L.,
VERGEZ-COURET M., VIEU L. &amp; WIDL&#214;CHER A. (2009). ANNODIS : une approche outill&#233;e de l&#8217;annota-
tion de structures discursives. In Actes de la 16e Conf&#233;rence Traitement Automatique des Langues Naturelles
(TALN&#8217;09), session posters, Senlis, France.
</p>
<p>PEVZNER L. &amp; HEARST M. (2002). A critique and improvement of an evaluation metric for text segmentation.
Computational Linguistics, 28(1), 19&#8211;36.
SCOTT W. (1955). Reliability of content analysis : The case of nominal scale coding. Public Opinion Quarterly,
19(3), 321&#8211;325.
SIEGEL S. &amp; CASTELLAN N. J. (1988). Nonparametric Statistics for the Behavioral Sciences. McGraw-Hill,
New York, 2nd edition.
</p>
<p>TEUFEL S., CARLETTA J. &amp; MOENS M. (1999). An annotation scheme for discourse-level argumentation in
research articles. In Proceedings of Ninth Conference of the EACL, p. 110&#8211;117, Bergen.
</p>
<p>WIDL&#214;CHER A. &amp; MATHET Y. (2009). La plate-forme Glozz : environnement d&#8217;annotation et d&#8217;exploration de
corpus. In Actes de TALN 2009 (Traitement automatique des langues naturelles), Senlis, France : ATALA LIPN.</p>

</div></div>
</body></html>