<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers une prise en charge approfondie des ph&#233;nom&#232;nes it&#233;ratifs par TimeML</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Vers une prise en charge approfondie des ph&#233;nom&#232;nes it&#233;ratifs par
TimeML
</p>
<p>Julien Lebranchu, Yann Mathet
Universit&#233; de Caen Basse-Normandie, UMR 6072 GREYC, F-14032 Caen, France
</p>
<p>Pr&#233;nom.Nom@unicaen.fr
</p>
<p>R&#233;sum&#233;. Les travaux men&#233;s ces derni&#232;res ann&#233;es autour de l&#8217;it&#233;ration en langue, tant par la communaut&#233;
linguistique que par celle du TAL, ont mis au jour des ph&#233;nom&#232;nes particuliers, non r&#233;ductibles aux repr&#233;sen-
tations temporelles classiques. En particulier, une it&#233;ration ne saurait structurellement &#234;tre r&#233;duite &#224; une simple
&#233;num&#233;ration de proc&#232;s, et du point de vue de l&#8217;aspect, met en jeu simultan&#233;ment deux vis&#233;es aspectuelles ind&#233;-
pendantes. Le formalisme TimeML, qui a vocation &#224; annoter les informations temporelles port&#233;es par un texte,
int&#232;gre d&#233;j&#224; des &#233;l&#233;ments relatifs aux it&#233;rations, mais ne prend pas en compte ces derni&#232;res avanc&#233;es. C&#8217;est ce que
nous entreprenons de faire dans cet article, en proposant une extension &#224; ce formalisme.
</p>
<p>Abstract. The work that has recently been done concerning the iterative phenomena in language, which was
performed by the linguistic and TAL communities, has illuminated specific phenomena, not reducible to classical
time representations. In particular, an iteration can not structurally be reduced to a simple listing of process, and
involves simultaneously two independent referred aspectual. The TimeML formalism, which aims to annotate
temporal information of a given text, includes already relative elements to iterations but does not take into account
recent advances. That is the reason why in this paper, we propose to extend this formalism.
</p>
<p>Mots-cl&#233;s : TimeML, discours, s&#233;mantique, ph&#233;nom&#232;nes it&#233;ratifs.
Keywords: TimeML, discourse, semantics, iterative phenomena.
</p>
<p>1 Introduction
</p>
<p>Le travail que nous menons actuellement se place dans le contexte de la s&#233;mantique temporelle, et plus pr&#233;cis&#233;ment
dans celui des ph&#233;nom&#232;nes it&#233;ratifs en corpus. Si plusieurs &#233;tudes linguistiques se sont attach&#233;es &#224; d&#233;crire les
m&#233;canismes it&#233;ratifs autour de la proposition ou de la phrase, nos travaux se positionnent quant &#224; eux au niveau
du discours (rep&#233;rage des donn&#233;es it&#233;ratives au sein d&#8217;un texte, d&#233;termination de l&#8217;&#233;tendue de chaque it&#233;ration,
etc., cf. (Lebranchu, 2009)). C&#8217;est dans ce contexte que nous nous attachons &#224; d&#233;terminer le plus pr&#233;cis&#233;ment les
informations temporelles et it&#233;ratives d&#8217;un texte, et que nous portons un int&#233;r&#234;t particulier &#224; TimeML.
</p>
<p>L&#8217;it&#233;ration en langue est un ph&#233;nom&#232;ne menant &#224; la construction de diff&#233;rents proc&#232;s r&#233;partis dans le temps et
consid&#233;r&#233;s comme &#233;tant la r&#233;p&#233;tition d&#8217;un m&#234;me &#233;v&#233;nement. De fa&#231;on typique, ce ph&#233;nom&#232;ne peut se manifester
&#224; partir d&#8217;une seule proposition telle que &#171; Nous sommes all&#233;s 7 fois &#224; la montagne. &#187; o&#249; le proc&#232;s &#171; nous aller &#224; la
montagne &#187; est it&#233;r&#233; par l&#8217;adverbe de quantification &#171; 7 fois &#187;. Elle peut &#234;tre circonscrite &#224; une seule proposition,
mais peut aussi s&#8217;&#233;taler sur plusieurs propositions ou phrases, successives ou non, comme dans l&#8217;exemple qui suit.
</p>
<p>Chaque lundi matin, le brocanteur qui logeait sous l&#8217;all&#233;e &#233;talait par terre ses ferrailles. Vers
midi, au plus fort du march&#233;, on voyait para&#238;tre sur le seuil un vieux paysan de haute taille. Peu de
temps apr&#232;s, c&#8217;&#233;tait Li&#233;bard, le fermier de Toucques, [. . .]
</p>
<p>Ainsi, le circonstanciel chaque lundi matin d&#233;clenche l&#8217;it&#233;ration du proc&#232;s &#171; le brocanteur &#233;taler par terre ses
ferrailles &#187;, &#224; raison d&#8217;une fois par semaine sur une certaine p&#233;riode. Les deux propositions &#171; Vers midi, . . ., on
voir para&#238;tre &#187;, et &#171; Peu de temps apr&#232;s, ce &#234;tre Li&#233;bard &#187; sont elles des constituants de cette it&#233;ration, qu&#8217;elles
viennent successivement enrichir. Nous noterons en revanche que la subordonn&#233;e (qui logeait sous l&#8217;all&#233;e) n&#8217;est
pas incluse dans l&#8217;it&#233;ration.
</p>
<p>Afin de repr&#233;senter les informations li&#233;es aux ph&#233;nom&#232;nes it&#233;ratifs, nous avons opt&#233; pour ISO-TimeML (ci-apr&#232;s
TimeML), un formalisme XML d&#233;fini par Lee et al. (2007), dont l&#8217;objectif est d&#8217;annoter des textes avec l&#8217;ensemble
de leurs informations temporelles. Il permet d&#8217;annoter les unit&#233;s linguistiques r&#233;alisant des proc&#232;s, les expressions
temporelles, les relations aspectuelles, temporelles ou de subordination qui peuvent exister entre &#233;v&#233;nements et
expressions temporelles ainsi que les marqueurs de ces relations.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN LEBRANCHU, YANN MATHET
</p>
<p>TimeML offre cependant une prise en charge assez limit&#233;e des ph&#233;nom&#232;nes it&#233;ratifs, et l&#8217;objet de cet article
est donc d&#8217;enrichir ce formalisme en cons&#233;quence. Nous exposons dans la section 2 les entit&#233;s n&#233;cessaires &#224; la
repr&#233;sentation dans notre approche des ph&#233;nom&#232;nes it&#233;ratifs. La section 3 pr&#233;sente une introduction &#224; TimeML,
ses enjeux, sa fa&#231;on actuelle de formaliser des it&#233;rations, et en &#233;tudie les limites. Enfin nous exposons &#224; la section 4
nos propositions d&#8217;extension de ce formalisme.
</p>
<p>2 Tour d&#8217;horizon des ph&#233;nom&#232;nes it&#233;ratifs en langue
</p>
<p>La litt&#233;rature sur les ph&#233;nom&#232;nes it&#233;ratifs est principalement orient&#233;e vers la source de ces ph&#233;nom&#232;nes. Citons
notamment les travaux de Condamines (1990) sur les subordonn&#233;es temporelles qui font une distinction entre la
phrase simple et la phrase complexe &#224; subordonn&#233;e temporelle. Plus r&#233;cemment, Lim (2002) a &#233;tudi&#233; la notion de
fr&#233;quence en fran&#231;ais, en pr&#233;sentant de fa&#231;on approfondie les diff&#233;rents m&#233;canismes mis en place dans les ph&#233;no-
m&#232;nes it&#233;ratifs. Nous orientons nos travaux selon deux approches compl&#233;mentaires, une approche aspectuelle et
une approche orient&#233;e objet, que nous allons bri&#232;vement pr&#233;senter.
</p>
<p>L&#8217;approche aspectuelle se fonde sur le mod&#232;le de la s&#233;mantique de la temporalit&#233; (ci-apr&#232;s &#171; SdT &#187;) en fran&#231;ais
de Gosselin (1996). Ce mod&#232;le n&#233;o-Reichenbachien int&#232;gre les diff&#233;rents param&#232;tres explicatifs de la temporalit&#233;
verbale en fran&#231;ais. Il repose sur une repr&#233;sentation du temps linguistique au moyen d&#8217;une ligne temporelle et
quatre intervalles temporels, dont en particulier l&#8217;intervalle de r&#233;f&#233;rence qui en constitue la pierre angulaire. Il
propose un ensemble de r&#232;gles permettant de rendre compte des ph&#233;nom&#232;nes linguistiques li&#233;s &#224; la temporalit&#233;,
en se basant sur deux concepts linguistiques : le temps qui situe le proc&#232;s dans le pass&#233;, le pr&#233;sent ou le futur,
et l&#8217;aspect qui pr&#233;cise la fa&#231;on dont est pr&#233;sent&#233; le proc&#232;s. Le traitement des ph&#233;nom&#232;nes it&#233;ratifs se fonde sur
les m&#234;mes principes mais un nouveau concept a &#233;t&#233; introduit pour pouvoir repr&#233;senter les it&#233;rations : la s&#233;rie
it&#233;rative. Elle est con&#231;ue comme un macro-proc&#232;s englobant une s&#233;rie d&#8217;occurrences d&#8217;un m&#234;me &#233;l&#233;ment it&#233;r&#233;,
ce dernier &#233;tant consid&#233;r&#233; comme &#171; mod&#232;le &#187; (ou prototype) de chacun des it&#233;r&#233;s. Un aspect important de ce
dispositif est qu&#8217;il permet de rendre compte du fait que l&#8217;it&#233;ration peut faire l&#8217;objet, simultan&#233;ment, de deux
vis&#233;es aspectuelles &#233;ventuellement diff&#233;rentes, comme dans &#171; Depuis deux mois, il mangeait en dix minutes. &#187;, o&#249;
la vis&#233;e est aoristique sur le proc&#232;s mod&#232;le, et inaccomplie sur la s&#233;rie (d&#8217;o&#249; la compatibilit&#233; de circonstanciels
apparemment contradictoires : en dix minutes &#233;value la dur&#233;e du proc&#232;s mod&#232;le, tandis que depuis deux mois, porte
sur le d&#233;but de la s&#233;rie et le moment consid&#233;r&#233;). Cette approche a fait l&#8217;objet d&#8217;adaptations &#224; d&#8217;autres langues et
notamment l&#8217;anglais.
</p>
<p>La seconde approche, qui a une vis&#233;e cognitive, propose une Mod&#233;lisation Objet des Ph&#233;nom&#232;nes It&#233;ratifs (MOPI),
cf. (Mathet, 2007). En particulier, la notion de mod&#232;le it&#233;ratif (comprenant un ou plusieurs proc&#232;s mod&#232;les) servant
de support &#224; l&#8217;it&#233;ration, et le processus menant &#224; l&#8217;instanciation multiple de ce mod&#232;le en diff&#233;rents it&#233;r&#233;s (la s&#233;rie
it&#233;rative &#233;voqu&#233;e supra) ont &#233;t&#233; mod&#233;lis&#233;s de fa&#231;on orient&#233;e objet. Par ailleurs, la notion d&#8217;It&#233;rateur rend compte
des &#233;l&#233;ments d&#233;clencheurs d&#8217;une it&#233;ration (comme par exemple un circonstanciel), et sont r&#233;partis en 4 classes :
les it&#233;rateurs calendaires (tous les jours, le jeudi, . . .), les it&#233;rateurs fr&#233;quentiels (souvent, rarement, parfois, . . .),
les it&#233;rateurs quantificationnels (3 fois, &#224; cinq reprises, . . .), et les it&#233;rateurs &#233;v&#233;nementiels qui correspondent aux
subordonn&#233;es temporelles.
</p>
<p>Mod&#232;le Iteratif
aller &#224; la montagne
</p>
<p>It&#233;r&#233;s r&#233;sultant de :
7 fois x aller &#224; la montagne
</p>
<p>7 fois
</p>
<p>FIGURE 1: Le mod&#232;le it&#233;ratif aller &#224; la montagne et ses it&#233;r&#233;s.
</p>
<p>Parall&#232;lement, en plus de l&#8217;it&#233;ration, le mod&#232;le distingue une seconde structure it&#233;rative : la s&#233;lection. Les s&#233;-
lections, via un s&#233;lecteur (adverbe de fr&#233;quence, . . .), viennent s&#233;lectionner certains it&#233;r&#233;s d&#8217;une it&#233;ration afin
d&#8217;enrichir ou de modifier ces derniers. Dans &#171; Nous sommes all&#233;s 7 fois &#224; la montagne. Parfois, des amis nous ont
accompagn&#233;s &#187;, le proc&#232;s mod&#232;le aller &#224; la montagne est r&#233;p&#233;t&#233; par le d&#233;clencheur quantificationnel. Puis s&#8217;op&#232;re
une s&#233;lection, rattach&#233;e &#224; l&#8217;it&#233;ration du proc&#232;s pr&#233;c&#233;dent, qui se voit enrichie du proc&#232;s mod&#232;le des amis nous
accompagner. Notons qu&#8217;une s&#233;lection constitue elle-m&#234;me une it&#233;ration au sens o&#249; elle est constitu&#233;e d&#8217;it&#233;r&#233;s
provenant d&#8217;un m&#234;me mod&#232;le.
</p>
<p>&#192; la lumi&#232;re de ces &#233;tudes, nous souhaitons donc que soient prises en charge les informations it&#233;ratives suivantes :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VERS UNE PRISE EN CHARGE APPROFONDIE DES PH&#201;NOM&#200;NES IT&#201;RATIFS PAR TIMEML
</p>
<p>&#8211; le mod&#232;le de l&#8217;it&#233;ration (l&#8217;it&#233;rant) ;
&#8211; la s&#233;rie associ&#233;e (les it&#233;r&#233;s) ;
&#8211; la vis&#233;e aspectuelle propre au mod&#232;le d&#8217;une part, et &#224; la s&#233;rie d&#8217;autre part ;
&#8211; les it&#233;rateurs et la cat&#233;gorie &#224; laquelle ils appartiennent ;
&#8211; la notion de s&#233;lection op&#233;rant sur une it&#233;ration.
La Figure 2 pr&#233;sente autour d&#8217;un exemple un certain nombre de ces informations.
</p>
<p>type : d&#233;clencheur calendaire
valeur : lundi matin
</p>
<p>type : circonstanciel
valeur : midi type : s&#233;rie
</p>
<p>valeur : inaccompli
</p>
<p>type : circonstanciel
valeur : peu de temps apr&#232;s
</p>
<p>type : proc&#232;s
temps : imparfait
valeur : inaccompli
iteration : non
</p>
<p>type : proc&#232;s
temps : imparfait
valeur : aoristique
iteration : oui
</p>
<p>type : proc&#232;s
temps : imparfait
valeur : aoristique
iteration : oui
</p>
<p>type : proc&#232;s
temps : imparfait
valeur : aoristique
iteration : oui
</p>
<p>Chaque lundi matin, le brocanteur qui logeait sous l'all&#233;e &#233;talait par terre ses ferrailles. Vers midi, au plus fort du march&#233;, on 
voyait para&#238;tre sur le seuil un vieux paysan de haute taille. Peu de temps apr&#232;s, c'&#233;tait Li&#233;bard, le fermier de Toucques, ... 
</p>
<p>FIGURE 2: Structures de traits relatives aux informations temporelles.
</p>
<p>3 TimeML
</p>
<p>Pr&#233;sentation
</p>
<p>TimeML est le fruit d&#8217;un groupe de travail dirig&#233; par James Pustejovsky qui vise &#224; standardiser les annotations
s&#233;mantiques ayant trait &#224; la temporalit&#233; dans un texte en langage naturel. Originellement, il fut con&#231;u pour r&#233;-
pondre &#224; quatre probl&#232;mes li&#233;s &#224; l&#8217;annotation des &#233;v&#233;nements et des expressions temporelles : l&#8217;identification
d&#8217;un &#233;v&#233;nement et son ancrage dans le temps, l&#8217;ordonnancement des &#233;v&#233;nements les uns par-rapport aux autres
(ordonnancement lexical ou discursif), le raisonnement sur des expressions temporelles en prenant en compte le
contexte (la semaine derni&#232;re) et le raisonnement sur la persistance des &#233;v&#233;nements (combien dure un &#233;v&#233;nement).
Le guide d&#8217;annotation issu des premiers travaux est tourn&#233; vers l&#8217;anglais, mais les &#233;l&#233;ments du standard sont a
priori ind&#233;pendants de la langue consid&#233;r&#233;e. Il existe notamment des travaux sur l&#8217;italien ou encore sur le cor&#233;en,
et, plus r&#233;cemment, un guide d&#8217;annotation pour le fran&#231;ais a &#233;t&#233; &#233;labor&#233; (Bittar, 2010).
</p>
<p>Les entit&#233;s de TimeML
</p>
<p>Actuellement, afin de couvrir l&#8217;essentiel des informations temporelles que l&#8217;on peut associer &#224; un texte, le standard
pr&#233;voit les fonctionnalit&#233;s suivantes : l&#8217;annotation des &#233;v&#233;nements, l&#8217;&#233;tiquetage des expressions temporelles et
la normalisation de leurs valeurs, ainsi que la mise en &#233;vidence des relations aspectuelles, temporelles ou de
subordination qui peuvent exister entre ces deux types d&#8217;entit&#233;s temporelles. Le standard propose trois types
d&#8217;entit&#233;s annotables : les adverbiaux (TIMEX3), les &#233;ventualit&#233;s (EVENT), et les signaux (SIGNAL).
</p>
<p>Les TIMEX3 repr&#233;sentent les expressions temporelles, et sont ordonn&#233;es selon quatre classes : les dates (le 23 mars
2011, 23/03/2011, . . .), les heures (11H29, le matin, . . .), les dur&#233;es (4 jours, deux ans et demi, . . .) et les ensembles
(annuellement, le jeudi, . . .), correspondant respectivement aux types DATE, TIME, DURATION et SET. Il est
possible d&#8217;annoter les expressions temporelles comme l&#8217;ann&#233;e prochaine, le lundi pr&#233;c&#233;dent dont les valeurs sont
sp&#233;cifi&#233;es par rapport un autre point de r&#233;f&#233;rence. Les EVENT correspondent aux &#233;v&#233;nements d&#8217;un &#233;nonc&#233; dans
une acception large puisque int&#233;grant les &#233;tats. On retrouve cette acception dans diff&#233;rents travaux sous la notion
d&#8217;&#233;ventualit&#233; (Vendler, 1967), ou encore proc&#232;s que nous reprenons &#224; notre compte. Ces proc&#232;s sont marqu&#233;s
textuellement soit par un verbe soit par un nom, et sont class&#233;s selon une ontologie pr&#233;d&#233;finie compos&#233;e de 7
classes : occurrence (la plupart des &#233;v&#233;nements), &#233;tat, action ou &#233;tat intensionnel (ceux-ci supposent un second
&#233;v&#233;nement qui ne se r&#233;alise pas n&#233;cessairement, comme dans je voudrais qu&#8217;il vienne), action d&#8217;&#233;nonciation ou de
perception (dire, r&#233;v&#233;ler, entendre, voir, . . .) et les aspectuels (commencer, finir de, continuer, . . .). Le formalisme
permet de distinguer l&#8217;&#233;v&#233;nement lui-m&#234;me de sa r&#233;alisation en attribuant un identifiant &#224; l&#8217;&#233;v&#233;nement et un &#224;
l&#8217;instance. L&#8217;entit&#233; EVENT permet &#233;galement de repr&#233;senter les informations telles que le temps grammatical,
la forme (nom, verbe, adjectif), l&#8217;aspect (Progressive, Imperfective, Perfective,. . .) ou encore la pr&#233;sence d&#8217;une
n&#233;gation. Enfin, la balise SIGNAL sert &#224; identifier une forme (g&#233;n&#233;ralement une pr&#233;position) marquant une relation
temporelle entre &#233;v&#233;nements et localisations temporelles, telle que apr&#232;s dans l&#8217;exemple Il viendra apr&#232;s le 3 avril.
Le standard pr&#233;voit, en plus des entit&#233;s, la formalisation des relations existantes entre ces entit&#233;s. Ces relations
sont de trois types : TLINK, repr&#233;sentant les relations temporelles entre des &#233;v&#233;nements, des marqueurs temporels
ou entre l&#8217;un et l&#8217;autre (ces relations sont issues des travaux d&#8217;Allen (1983) sur les intervalles, entre autres la
succession, l&#8217;ant&#233;riorit&#233; et le recouvrement) ; ALINK, repr&#233;sentant les relations entre les verbes aspectuels et</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN LEBRANCHU, YANN MATHET
</p>
<p>les &#233;v&#233;nements auxquels ils r&#233;f&#233;rent ; et SLINK, introduisant les relations entre deux instances d&#8217;&#233;v&#233;nements.
L&#8217;exemple suivant pr&#233;sente une annotation TimeML de la phrase &#171; Bill veut enseigner le lundi &#187;
</p>
<p>Bill &lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; class=&quot;I_STATE&quot; pos=&quot;VERB&quot; tense=&quot;PRESENT&quot; aspect=&quot;NONE&quot;
polarity=&quot;POS&quot;&gt;veut&lt;/EVENT&gt; &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot; class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot;
aspect=&quot;NONE&quot; tense=&quot;NONE&quot; vform=&quot;INFINITIVE&quot; polarity=&quot;POS&quot;&gt; enseigner&lt;/EVENT&gt;
&lt;TIMEX3 tid=&quot;t1&quot; type=&quot;SET&quot; value=&quot;XXXX-WXX-1&quot;&gt; le lundi&lt;/TIMEX3&gt;
&lt;TLINK eventInstanceID=&quot;ei2&quot; relatedToTime=&quot;t1&quot; relType=&quot;IS_INCLUDED&quot;/&gt;
&lt;SLINK eventInstanceID=&quot;ei1&quot; relType=&quot;INTENSIONAL&quot; subordinatedEventInstance=&quot;ei2&quot;/&gt;
</p>
<p>Les it&#233;rations dans TimeML
</p>
<p>Actuellement, le standard repr&#233;sente les it&#233;rations au niveau d&#8217;un &#233;v&#233;nement, c&#8217;est-&#224;-dire via l&#8217;entit&#233; EVENT
en renseignant l&#8217;attribut CARDINALITY. De plus, il est &#233;galement possible de cr&#233;er l&#8217;ensemble des instances en
cr&#233;ant n entit&#233;s. Le standard formalise les s&#233;lections d&#8217;une sous-s&#233;rie d&#8217;&#233;v&#233;nements en utilisant les cardinalit&#233;s
respectives des entit&#233;s EVENT et une relation TLINK de type INCLUDES ou IS_INCLUDED. Quant aux d&#233;clen-
cheurs, il est uniquement possible d&#8217;annoter des &#171; quantificateurs &#187;, via l&#8217;entit&#233; EVENT, et des &#171; calendaires &#187;,
par l&#8217;entit&#233; TIMEX. Dans ce dernier cas, l&#8217;entit&#233; TIMEX repr&#233;sente l&#8217;ensemble des unit&#233;s temporelles d&#233;crivant
l&#8217;expression temporelle. L&#8217;exemple ci-dessus pr&#233;sente l&#8217;annotation d&#8217;une it&#233;ration dont le d&#233;clencheur calendaire
est &#171; le lundi &#187;, repr&#233;sent&#233; par le patron &#171; XXX-WXX-1 &#187; associ&#233; &#224; TIMEX.
</p>
<p>Les limites actuelles
</p>
<p>Compte-tenu de ce que nous venons de pr&#233;senter, les limites de TimeML relativement aux ph&#233;nom&#232;nes it&#233;ratifs
sont de deux ordres.
Premi&#232;rement, il n&#8217;y pas de distinction entre l&#8217;instance d&#8217;un &#233;v&#233;nement et l&#8217;instance d&#8217;une it&#233;ration, hormis l&#8217;at-
tribut cardinality. Or, nous avons montr&#233; qu&#8217;il est possible d&#8217;affecter des valeurs aspectuelles diff&#233;rentes &#224; la s&#233;rie
it&#233;rative et au proc&#232;s. De plus, il est n&#233;cessaire de d&#233;terminer si le rattachement d&#8217;un proc&#232;s se fait au niveau de
l&#8217;it&#233;ration (J&#8217;allais souvent &#224; la mer. C&#8217;&#233;tait des moments magnifiques.) ou de l&#8217;&#233;v&#233;nement (Marie tomba plusieurs
fois en t&#226;chant d&#8217;atteindre la barri&#232;re, puis parvint &#224; la franchir.).
</p>
<p>Deuxi&#232;mement, le standard, par choix des concepteurs, ne permet pas de prendre en compte les adverbes de
fr&#233;quences (&#171; rarement &#187;, &#171; souvent &#187;, . . .) ou bien les conjonctions de subordination (&#171; quand &#187;, &#171; lorsque &#187;, &#171; &#224;
chaque fois que &#187;, . . .), c&#8217;est-&#224;-dire les it&#233;rateurs de type &#171; fr&#233;quentiel &#187; et &#171; &#233;v&#233;nementiel &#187;. De plus, le formalisme
de repr&#233;sentation des expressions temporelles n&#8217;est pas complet. Il ne permet pas de couvrir des expressions telles
que &#171; Un mardi sur deux &#187;, &#171; tous les troisi&#232;mes mardis du mois &#187;, &#171; trois jours ouvrables &#187;, ou encore &#171; le 4&#232;me
des 6 jours de campagne &#187;.
</p>
<p>4 Extension de TimeML aux ph&#233;nom&#232;nes it&#233;ratifs
</p>
<p>Nous allons proposer dans cette section un certain nombre d&#8217;extensions au standard TimeML relatives aux ph&#233;-
nom&#232;nes it&#233;ratifs. Pour distinguer du standard TimeML les extensions que nous proposons, nous avons choisi
d&#8217;utiliser l&#8217;espace de nom &#171; iteration &#187; qui pr&#233;c&#232;de les entit&#233;s que nous introduisons. Nous proposons donc l&#8217;entit&#233;
ITERATION:STRUCTURE pour les structures it&#233;ratives, et l&#8217;entit&#233; ITERATION:TRIGGER pour les d&#233;clencheurs. 1
</p>
<p>4.1 Les structures it&#233;ratives
Nous proposons de repr&#233;senter les structures it&#233;ratives via une entit&#233; STRUCTURE dans laquelle nous int&#233;grons un
attribut obligatoire TYPE, permettant de distinguer une it&#233;ration et une s&#233;lection. Pour rendre compte de l&#8217;ensemble
des informations n&#233;cessaires, nous avons les attributs suivants :
&#8211; l&#8217;attribut STID attribue un identifiant &#224; l&#8217;entit&#233; STRUCTURE ;
&#8211; l&#8217;attribut TYPE permet de distinguer l&#8217;it&#233;ration de la s&#233;lection (&#171; it&#233;ration &#187;, &#171; s&#233;lection &#187;) ;
&#8211; l&#8217;attribut TRIGGERID permet d&#8217;identifier le d&#233;clencheur associ&#233; &#224; la structure ;
&#8211; l&#8217;attribut ASPECT renseigne la valeur aspectuelle de la structure (aoristique, accompli, inaccompli et prospectif) ;
&#8211; l&#8217;attribut STRUCTUREINSTANCEID permet de repr&#233;senter les liens entre deux structures it&#233;ratives, notamment
</p>
<p>dans les cas d&#8217;imbrication d&#8217;it&#233;rations et de s&#233;lections.
Nous avons montr&#233; pr&#233;alablement qu&#8217;une structure it&#233;rative est compos&#233;e de proc&#232;s. Nous conservons la repr&#233;-
sentation existante, c&#8217;est-&#224;-dire l&#8217;entit&#233; EVENT, en lui ajoutant un attribut (nomm&#233; STRUCTUREINSTANCEID) qui
permet d&#8217;identifier la structure it&#233;rative &#224; laquelle elle est rattach&#233;e. L&#8217;exemple qui suit illustre la repr&#233;sentation
</p>
<p>1. Par souci de lisibilit&#233;, dans la suite de l&#8217;article, nous ne mentionnons pas l&#8217;espace de noms.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>VERS UNE PRISE EN CHARGE APPROFONDIE DES PH&#201;NOM&#200;NES IT&#201;RATIFS PAR TIMEML
</p>
<p>des structures it&#233;ratives, o&#249; nous retrouvons le d&#233;clencheur de l&#8217;it&#233;ration 7 fois (dont nous d&#233;taillons la balise
TRIGGER dans la suite de cet article), et l&#8217;&#233;v&#233;nement it&#233;r&#233; aller &#224; la montagne. Puis le d&#233;clencheur parfois qui
op&#232;re une s&#233;lection de certains it&#233;r&#233;s, pour les enrichir du proc&#232;s mod&#232;le des amis nous accompagner.
Nous
&lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; aspect=&quot;aoristique&quot; structureInstanceID=&quot;st1&quot;&gt;sommes all&#233;s&lt;/EVENT&gt;
&lt;TRIGGER tid=&quot;t1&quot;...&gt;7 fois&lt;/TRIGGER&gt; &#224; la montagne.
&lt;STRUCTURE type=&quot;iteration&quot; stid=&quot;st1&quot; triggerID=&quot;t1&quot; aspect=&quot;aoristique&quot;/&gt;
&lt;TRIGGER tid=&quot;t2&quot;...&gt;Parfois,&lt;/TRIGGER&gt; des amis nous &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot;
aspect=&quot;aoristique&quot; structureInstanceID=&quot;st2&quot;&gt;ont accompagn&#233;s&lt;/EVENT&gt;.
&lt;STRUCTURE type=&quot;selection&quot; stid=&quot;st2&quot; triggerID=&quot;t2&quot; aspect=&quot;aoristique&quot;
structureInstanceID=&quot;st1&quot;/&gt;
</p>
<p>4.2 Les d&#233;clencheurs
Nous proposons de cr&#233;er une nouvelle entit&#233; pour couvrir l&#8217;ensemble des d&#233;clencheurs d&#8217;it&#233;rations tels que nous
avons pu les d&#233;finir en pr&#233;sentant le mod&#232;le MOPI. Nous repr&#233;sentons donc ces derniers par l&#8217;entit&#233; TRIGGER &#224;
laquelle est adjoint un ensemble de couples d&#8217;attributs et valeurs pour notamment distinguer les diff&#233;rents types
de d&#233;clencheurs. L&#8217;entit&#233; est donc compos&#233;e d&#8217;un identifiant TRID, d&#8217;un attribut TYPE et d&#8217;un attribut VALUE
contenant la valeur port&#233;e par le d&#233;clencheur analys&#233; qui sont tous trois obligatoires, et en fonction du d&#233;clencheur,
nous avons un certain nombre d&#8217;attributs optionnels que nous d&#233;taillons.
</p>
<p>Les d&#233;clencheurs aspectuels
Les d&#233;clencheurs de type aspectuel, tels que encore, pr&#233;supposent l&#8217;existence d&#8217;autres instances de l&#8217;&#233;v&#233;nement.
Nous proposons de sp&#233;cifier le nombre d&#8217;it&#233;r&#233;s au moyen d&#8217;un patron simple, correspondant &#224; un nombre mini-
mum de r&#233;p&#233;titions pr&#233;suppos&#233;es suivi du symbole &quot;+&quot;. Dans l&#8217;exemple suivant, nous avons donc au minimum
deux instances de casser une vitre.
Il a &lt;TRIGGER tid=&quot;t1&quot; type=&quot;ASP&quot; value=&quot;2+&quot;&gt;encore&lt;/TRIGGER&gt; cass&#233; une vitre.
</p>
<p>Les d&#233;clencheurs quantificationnels
Les d&#233;clencheurs de type quantificationnel, pour rappel, correspondent &#224; des syntagmes tels que &#171; &#224; trois reprises &#187;,
&#171; 5 fois &#187;, &#171; quelques fois &#187;. L&#8217;attribut TYPE se voit affecter la valeur QUANT, et l&#8217;attribut VALUE contient la
valeur de la r&#233;p&#233;tition port&#233;e par le quantifieur. Dans les cas o&#249; la s&#233;mantique associ&#233;e au quantifieur n&#8217;est pas
pr&#233;cise, comme pour &#171; plusieurs fois &#187;, la valeur VALUE est unspecified.
Marie tomba &lt;TRIGGER trid=&quot;n1&quot; value=&quot;3&quot; type=&quot;QUANT&quot;&gt;&#224; trois reprises&lt;/TRIGGER&gt;.
Nos &lt;TRIGGER trid=&quot;n2&quot; value=&quot;2&quot; type=&quot;QUANT&quot;&gt;2 voyages&lt;/TRIGGER&gt; &#224; Hawaii furent merveilleux.
</p>
<p>Les d&#233;clencheurs &#233;v&#233;nementiels
Les d&#233;clencheurs &#233;v&#233;nementiels correspondent aux conjonctions introduisant des subordonn&#233;es temporelles telles
que lorsque, &#224; chaque fois que, d&#232;s que. Nous attribuons la valeur EV &#224; l&#8217;entit&#233; TYPE tandis que l&#8217;attribut VALUE
sp&#233;cifie la relation temporelle existant entre la subordonn&#233;e introduite par le marqueur &#233;v&#233;nementiel et la propo-
sition principale. L&#8217;exemple suivant illustre une repr&#233;sentation du marqueur lorsque qui sp&#233;cifie une relation de
simultan&#233;it&#233; entre les deux propositions, sur l&#8217;&#233;nonc&#233; Lorsque John enseigne &#224; l&#8217;IUT, il d&#233;pose d&#8217;abord les enfants
&#224; l&#8217;&#233;cole. Remarquons qu&#8217;il existe une contradiction apparente entre la valeur de l&#8217;introducteur et la principale qui
s&#8217;explique par le fait que le proc&#232;s principal peut dans certains cas, comme ici avec &#171; John enseigne &#187;, &#234;tre en fait
une partie seulement d&#8217;un sc&#233;nario it&#233;r&#233; plus large infer&#233; &#224; partir de ce proc&#232;s.
&lt;TRIGGER trid=&quot;ev1&quot; type=&quot;EV&quot; value=&quot;SIMULTANEOUS&quot;&gt;Lorsque&lt;/TRIGGER&gt; John
&lt;EVENT eid=&quot;e1&quot; eiid=&quot;ei1&quot; structureInstanceID=&quot;sci1&quot; aspect=&quot;aoristique&quot;&gt;enseigne&lt;/EVENT&gt;
&#224; l&#8217;IUT, &lt;STRUCTURE type=&quot;iteration&quot; structureID=&quot;sci1&quot; triggerID=&quot;ev1&quot; aspect=&quot;inaccompli&quot;/&gt;
il &lt;EVENT eid=&quot;e2&quot; eiid=&quot;ei2&quot; structureInstanceID=&quot;sci1&quot; aspect=&quot;accompli&quot; &gt;d&#233;pose&lt;/EVENT&gt;
&lt;signal sid=&quot;s2&quot;&gt;d&#8217;abord&lt;/signal&gt; les enfants &#224; l&#8217;&#233;cole.
&lt;TLINK eiid=&quot;ei2&quot; relatedToEvent=&quot;ei1&quot; relType=&quot;BEFORE&quot; signalID=&quot;s2&quot; /&gt;
</p>
<p>Les d&#233;clencheurs calendaires
Les d&#233;clencheurs calendaires sont actuellement repr&#233;sent&#233;s par l&#8217;entit&#233; TIMEX, permettant de formaliser des
formes telles que chaque lundi, tous les jeudis. Cependant certaines expressions ne sont pas exprimables dans
ce formalisme, notamment pour des exemples tels que un mardi sur deux, tous les troisi&#232;mes mardis du mois.
Par souci d&#8217;homog&#233;n&#233;it&#233;, nous repr&#233;sentons &#233;galement ces d&#233;clencheurs par l&#8217;entit&#233; TRIGGER, en sp&#233;cifiant le
type par la valeur CAL et rendant la valeur SET de TIMEX obsol&#232;te, dans le cadre de notre extension. Afin de
couvrir tous les expressions calendaires, nous utilisons la formalisation alg&#233;brique d&#233;velopp&#233;e par P. Enjalbert et
G. Becher (&#192; para&#238;tre) qui poss&#232;de un ensemble de m&#233;canismes permettant de calculer les s&#233;ries associ&#233;es &#224; une
expression calendaire it&#233;rative. La fonction permet d&#8217;obtenir la s&#233;rie correspondant &#224; la valeur de l&#8217;attribut VALUE,
et nous obtenons les repr&#233;sentations suivantes pour les expressions associ&#233;es :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JULIEN LEBRANCHU, YANN MATHET
</p>
<p>&#8211; un mardi sur deux&#8658; SUR(1, 2, MARDI)
&#8211; tous les troisi&#232;mes mardis du mois&#8658; TOUSLESN(3, MARDI)
Par ailleurs, il est possible de se r&#233;f&#233;rer temporellement au d&#233;clencheur calendaire soit &#224; un niveau global (J&#8217;allais
&#224; la piscine tous les mardis. Maintenant, j&#8217;y vais le jeudi.), soit au niveau mod&#232;le (Tous les jeudis, John enseigne
pendant 3 heures puis il va manger au RU.). Afin de distinguer les deux niveaux, nous ajoutons un identifiant au
niveau mod&#232;le, TMID, auquel il pourra &#234;tre fait r&#233;f&#233;rence.
&lt;TRIGGER trid=&quot;t1&quot; tmid=&quot;tmi1&quot; type=&quot;CAL&quot; value=&quot;TousLesN(jeudi)&quot;&gt;Tous les jeudis&lt;/TRIGGER&gt;,
des habitu&#233;s venaient faire une partie de boston.
</p>
<p>Les d&#233;clencheurs fr&#233;quentiels
Nous finissons par la repr&#233;sentation des d&#233;clencheurs fr&#233;quentiels (rarement, parfois, . . .), qui s&#8217;av&#232;re &#234;tre plus
complexe que pour les d&#233;clencheurs pr&#233;c&#233;dents. En effet, le calcul de la fr&#233;quence d&#233;pend de nombreux param&#232;tres
tels que l&#8217;agent mis en &#339;uvre dans l&#8217;&#233;nonc&#233;, le contexte ou bien encore l&#8217;action r&#233;alis&#233;e. Par exemple, dans les
deux exemples suivants : Elizabeth T. s&#8217;est souvent mari&#233;e et Elizabeth T. a souvent tourn&#233; des films, l&#8217;adverbe
souvent aura une fr&#233;quence diff&#233;rente. Dans notre premier exemple, la fr&#233;quence est de huit mariages au cours de
sa vie tandis que le second fait r&#233;f&#233;rence &#224; 70 tournages. Ce calcul de la fr&#233;quence d&#233;passe cependant le cadre de
cet article. Nous proposons donc de repr&#233;senter la valeur s&#233;mantique associ&#233;e par une fonction. Dans nos deux
exemples pr&#233;c&#233;dents, nous repr&#233;sentons donc la fr&#233;quence par la fonction often comme suit :
</p>
<p>E.T. a&lt;TRIGGER trid=&quot;tr1&quot; type=&quot;FREQ&quot; value=&quot;often()&quot;&gt;souvent&lt;/TRIGGER&gt; tourn&#233; des films.
</p>
<p>5 Conclusion
</p>
<p>Une extension 2 du langage TimeML s&#8217;est av&#233;r&#233;e n&#233;cessaire pour une annotation enrichie des ph&#233;nom&#232;nes it&#233;ra-
tifs. Premi&#232;rement, pour rendre compte de la double vis&#233;e aspectuelle, de la s&#233;rie it&#233;rative et du proc&#232;s ; deuxi&#232;me-
ment, pour capturer l&#8217;ensemble des structures it&#233;ratives, it&#233;rations et s&#233;lections ; et troisi&#232;mement, pour repr&#233;senter
les diff&#233;rents d&#233;clencheurs existants. De fait, nous avons &#233;labor&#233; deux nouvelles entit&#233;s STRUCTURE et TRIGGER
repr&#233;sentant respectivement les structures it&#233;ratives et les d&#233;clencheurs. Dans la perspective d&#8217;une meilleure int&#233;-
gration, il nous reste &#224; d&#233;finir une repr&#233;sentation des d&#233;clencheurs de type conflits comme dans l&#8217;exemple &#171; Depuis
deux mois, il mangeait en dix minutes. &#187; que nous avons pr&#233;sent&#233; ci-dessus. Actuellement, notre annotation s&#8217;est
limit&#233;e &#224; quelques articles du journal Le Monde, notre prochaine &#233;tape se consacrera donc &#224; r&#233;aliser une annotation
sur un corpus plus cons&#233;quent.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALLEN J. F. (1983). Maintaining knowledge about temporal intervals. Commun. ACM, 26(11), 832&#8211;843.
BITTAR A. (2010). Building a TimeBank for French : A Reference Corpus Annotated According to the ISO-
TimeML Standard. PhD thesis, Universit&#233; Paris Diderot (Paris 7).
CONDAMINES A. (1990). Les conjonctions de subordination temporelle en fran&#231;ais. Cahiers de Grammaires,
15, 25&#8211;54.
ENJALBERT P. &amp; BECHER G. (&#224; para&#238;tre). It&#233;rations, chapter L&#8217;it&#233;ration dans le mod&#232;le SdT : une formalisation
alg&#233;brique.
GOSSELIN L. (1996). S&#233;mantique de la temporalit&#233; en fran&#231;ais : un mod&#232;le calculatoire et cognitif du temps et
de l&#8217;aspect. Duculot.
LEBRANCHU J. (2009). Vers une analyse automatique des ph&#233;nom&#232;nes it&#233;ratifs en corpus. In G. WILLIAMS,
Ed., Actes des 6&#232;mes Journ&#233;es de la Linguistique de Corpus, Lorient, France : Universit&#233; de Bretagne-Sud.
LEE K., PUSTEJOVSKY J., BUNT H., BOGURAEV B. &amp; IDE N. (2007). Language resource management -
Semantic annotation framework (SemAF) - Part 1 : Time and events. Rapport interne, International Organization
for Standardization, Geneva, Switzerland.
LIM J.-H. (2002). La fr&#233;quence et son expression en fran&#231;ais. Honor&#233; Champion.
MATHET Y. (2007). Une approche cognitive de l&#8217;it&#233;ration et sa mod&#233;lisation objet. RTE.
VENDLER Z. (1967). Linguistics in Philosophy. Cornell U. P.
</p>
<p>2. La syntaxe compl&#232;te associ&#233;e &#224; l&#8217;extension que nous venons de pr&#233;senter est d&#233;crite au sein d&#8217;une DTD accessible &#224; l&#8217;adresse :
http://jlebranc.perso.info.unicaen.fr/TimeML/timeml-iter.dtd.</p>

</div></div>
</body></html>