<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>EASYTEXT : un syst&#232;me op&#233;rationnel de g&#233;n&#233;ration de textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>EASYTEXT : un syst&#232;me op&#233;rationnel de g&#233;n&#233;ration de textes
</p>
<p>Fr&#233;d&#233;ric Meunier1 Laurence Danlos2 Vanessa Combet1
(1) Watch System Assistance
</p>
<p>(2) Universit&#233; Paris Diderot, ALPAGE
frederic.meunier@watchsystance.com, laurence.danlos@linguist.jussieu.fr,
</p>
<p>vanessa.combet@watchsystance.com
</p>
<p>EASYTEXT est un syst&#232;me de g&#233;n&#233;ration de textes op&#233;rationnel aupr&#232;s de Kantar Media, une filiale de TNS-
Sofres. Cette soci&#233;t&#233; compile pour ses clients des donn&#233;es chiffr&#233;es sur leurs investissements publicitaires et
envoie &#224; chaque client sept tableaux tous les mois, comme celui de la Figure 1. Avant EASYTEXT, ces tableaux
&#233;taient accompagn&#233;s d&#8217;un commentaire g&#233;n&#233;ral r&#233;dig&#233; par un charg&#233; d&#8217;&#233;tude. Le besoin s&#8217;est fait sentir d&#8217;assortir
ce commentaire g&#233;n&#233;ral de commentaires sp&#233;cifiques &#224; chaque tableau. La charge de r&#233;daction &#233;tant alors trop
lourde pour les charg&#233;s d&#8217;&#233;tude, l&#8217;id&#233;e a surgi de faire g&#233;n&#233;rer ces commentaires sp&#233;cifiques par un syst&#232;me
automatique.
</p>
<p>EASYTEXT repose sur le formalisme G-TAG, un formalisme lexicalis&#233; reposant sur les grammaires d&#8217;arbres
adjoins (TAG) (Danlos, 1998). Ce formalisme a &#233;t&#233; &#233;tendu en amont pour les t&#226;ches de d&#233;termination du contenu
et de structuration du texte, en suivant l&#8217;architecture d&#233;crite dans (Danlos &amp; Ghali, 2002). La d&#233;termination du
contenu revient &#224; surligner certaines cellules du tableau. Cette t&#226;che a &#233;t&#233; guid&#233;e par les r&#232;gles m&#233;tier indiqu&#233;es
par les charg&#233;s d&#8217;&#233;tude de TNS-Sofres. La structuration du texte consiste &#224; introduire des relations rh&#233;toriques
(e.g. Contraste ou Paralle&#768;le) entre le contenu s&#233;mantique des cellules surlign&#233;es, voir (Danlos et al., 2001)).
</p>
<p>G-TAG avait &#233;t&#233; impl&#233;ment&#233; dans les ann&#233;es 90&#8217; en ADA par F. Meunier (1997). Celui-ci a re-impl&#233;ment&#233; G-
TAG (avec les extensions en amont d&#233;crites ci-dessus) en .NET, ce qui permet &#224; EASYTEXT d&#8217;&#234;tre int&#233;gr&#233; au
syst&#232;me d&#8217;information de TNS-Sofres. La g&#233;n&#233;ration d&#8217;un commentaire comme celui de la Figure 1 demande en
moyenne 400ms de CPU-Times. Cette impl&#233;mentation int&#232;gre des outils ergonomiques pour renseigner les bases
lexicales TAG et pour visualiser les diff&#233;rentes structures arborescentes dynamiquement construites ou en cours
de construction.
</p>
<p>Les bases lexicales ont &#233;t&#233; renseign&#233;es par une linguiste, V. Combet, qui a travaill&#233; en &#233;troite collaboration avec
les charg&#233;s d&#8217;&#233;tude de TNS-Sofres. Une attention particuli&#232;re a &#233;t&#233; port&#233;e sur la variation linguistique afin de ne
pas produire des textes monotones qui auraient lass&#233; les clients de TNS-Sofres. Cette variation concerne princi-
palement les choix lexicaux (e.g. augmenter, &#234;tre en (forte/moyenne/faible) augmentation/hausse, (presque/plus
que) doubler/tripler) et l&#8217;ordre des syntagmes &#224; position plus ou moins libre.
</p>
<p>TNS-Sofres a &#233;t&#233; satisfait des r&#233;sultats de EASYTEXT (m&#234;me au del&#224; de ses esp&#233;rances), et donc commercialise
ce service &#224; ses clients depuis Avril 2010. EASYTEXT est donc un des tous premiers syst&#232;mes de g&#233;n&#233;ration de
textes op&#233;rationnel en France, et il en existe peu en dehors de l&#8217;hexagone.
</p>
<p>Figure 1 : Exemple de tableau et de commentaire g&#233;n&#233;r&#233; automatiquement
</p>
<p>R&#233;f&#233;rences
</p>
<p>DANLOS L. (1998). G-TAG : un formalisme lexicalis&#233; pour la g&#233;n&#233;ration de textes inspir&#233; de TAG. Revue TAL,
39(2).
DANLOS L., GAIFFE B. &amp; ROUSSARIE L. (2001). Document structuring &#224; la SDRT. In International workshop
on text generation - ACL, p. 94&#8211;102, Toulouse.
DANLOS L. &amp; GHALI A. E. (2002). A completed and integrated NLG system using NLU and AI tools. In
Proceedings of COLING&#8217;02, Tapei, Taiwan.
MEUNIER F. (1997). Impl&#233;mentation du formalisme G-TAG. Th&#232;se de doctorat en informatique, Universit&#233;
Denis Diderot, Paris 7.</p>

</div></div>
</body></html>