<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Construction d&#8217;une grammaire d&#8217;arbres adjoints pour la langue arabe</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>CONSTRUCTION D&#8217;UNE GRAMMAIRE D&#8217;ARBRES ADJOINTS POUR LA LANGUE ARABE 
</p>
<p>Construction d&#8217;une grammaire d&#8217;arbres adjoints pour la langue arabe 
</p>
<p>F&#233;riel Ben Fraj 
</p>
<p>(1)  Laboratoire RIADI, &#201;cole Nationale des Sciences de l'Informatique, 2010 Manouba, Tunisie.  
Feriel.BenFraj@riadi.rnu.tn 
</p>
<p>R&#233;sum&#233;. La langue arabe pr&#233;sente des sp&#233;cificit&#233;s qui la rendent plus ambig&#252;e que d&#8217;autres 
langues naturelles. Sa morphologie, sa syntaxe ainsi que sa s&#233;mantique sont en corr&#233;lation et se 
compl&#232;tent l&#8217;une l&#8217;autre. Dans le but de construire une grammaire qui soit adapt&#233;e &#224; ces 
sp&#233;cificit&#233;s, nous avons con&#231;u et d&#233;velopp&#233; une application d&#8217;aide &#224; la cr&#233;ation des r&#232;gles 
syntaxiques licites suivant le formalisme d&#8217;arbres adjoints. Cette application est modulaire et 
enrichie par des astuces de contr&#244;le de la cr&#233;ation et aussi d&#8217;une interface conviviale pour assister 
l&#8217;utilisateur final dans la gestion des cr&#233;ations pr&#233;vues. 
</p>
<p>Abstract. The Arabic language consists of a set of specificities. Thus, it is more ambiguous than 
other natural languages. Its morphology, syntax and semantic are correlated to each other. We have 
constructed an application for the construction of a tree adjoining grammar which respects the 
characteristics of the Arabic language. This tool allows constructing the grammatical rules as 
elementary trees enriched by different feature structures. It helps the user by its interface and 
control system to manage correct and uniform rules.  
</p>
<p>Mots-cl&#233;s : Outil semi-automatique, grammaire d&#8217;arbres adjoints, langue arabe, traits d&#8217;unification 
Keywords:   semi-automatic tool, tree adjoining grammar, Arabic language, feature structures  
</p>
<p>1 Introduction 
</p>
<p>La langue arabe pr&#233;sente des caract&#233;ristiques qui la rendent plus ambig&#252;e que d&#8217;autres langues naturelles, 
sp&#233;cialement les langues indo-europ&#233;ennes. Pour cette langue, il y a un entrelacement fort entre les 
diff&#233;rents niveaux du traitement linguistique ; &#224; savoir morphologique, syntaxique et aussi s&#233;mantique. 
Ainsi, la syntaxe ne peut &#234;tre bien g&#233;r&#233;e qu&#8217;avec l&#8217;intervention de donn&#233;es &#224; la fois morphologiques et 
aussi s&#233;mantiques. Cette corr&#233;lation se manifeste, par exemple, dans l&#8217;accord en genre et en nombre entre 
les noms et les adjectifs ou encore l&#8217;accord entre les noms et les verbes. Ces accords d&#233;pendent, 
intimement, de l&#8217;animation et/ou de l&#8217;humanit&#233; du nom en question. Citons alors l&#8217;exemple des phrases 
suivantes :  &#1576;&#1604;&#1575;&#1603;&#1604;&#1575;&#1577;&#1593;&#1574;&#1575;&#1580;  (les chiens sont affam&#233;s) : le mot &#1576;&#1604;&#1575;&#1603;&#1604;&#1575; (les chiens) &#233;tant un nom masculin pluriel 
inhumain ne s&#8217;accorde pas en nombre et en genre avec l&#8217;adjectif &#1577;&#1593;&#1574;&#1575;&#1580; (est affam&#233;e) qui est au f&#233;minin 
singulier. Ceci n&#8217;est pas le cas avec la phrase &#1604;&#1575;&#1601;&#1591;&#1604;&#1571;&#1575; &#1580;&#1593;&#1575;&#1740;  (les enfants sont affam&#233;s), o&#249; l&#8217;accord entre le 
nom et l&#8217;adjectif existe, vu que &#1604;&#1575;&#1601;&#1591;&#1604;&#1571;&#1575; (les enfants) est un nom anim&#233; humain, et ainsi l&#8217;adjectif &#1593;&#1575;&#1740;&#1580; (sont 
affam&#233;s) est au masculin pluriel. D&#8217;autant plus, le sch&#232;me )&#1606;&#1586;&#1608;&#1604;&#1575;(  de l&#8217;item lexical qui est une information 
morphologique aide &#224; sp&#233;cifier l&#8217;utilisation syntaxique de cet outil voire m&#234;me son sens, tel par exemple le 
sch&#232;me &#1604;&#1600;&#1600;&#1593;&#1575;&#1601; (Fa&#226;ilun) qui indique le r&#233;alisateur de l&#8217;action.  
</p>
<p>Par cons&#233;quent, la construction d&#8217;une grammaire formelle pour la langue arabe doit, obligatoirement, faire 
intervenir diff&#233;rents types d&#8217;informations utiles afin de mieux g&#233;rer la bonne composition des agencements 
syntaxiques. Dans ce papier, nous dressons le probl&#232;me de cette construction. Il existe diff&#233;rentes 
grammaires formelles ; &#224; savoir : les grammaires g&#233;n&#233;ratives (Chomsky, 1965) et celles </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FERIEL BEN FRAJ 
</p>
<p>transformationnelles (Lecomte, 2004) de Chomsky, les grammaires d&#8217;unification (Kahane, 2002) et aussi 
les grammaires &#224; la fois g&#233;n&#233;ratives et d&#8217;unification, comme par exemple la grammaire de clauses d&#233;finies 
(DCG) (Pereira et Warren, 1980). Parmi toute cette panoplie, nous avons choisi d&#8217;utiliser le formalisme 
grammatical d&#8217;arbres adjoints (TAG : Tree Adjoining Grammar) (Joshi et al., 1975). C&#8217;est un formalisme 
d&#8217;unification qui manipule les r&#232;gles grammaticales sous forme de structures arborescentes dites &#171; arbres 
&#233;l&#233;mentaires &#187; pouvant &#234;tre reli&#233;es entre elles par des op&#233;rations de jointure bien d&#233;finies dans  (Joshi et 
al., 1975). La justification de ce choix a &#233;t&#233; discut&#233;e dans l&#8217;article (Ben Fraj et al., 2008). N&#233;anmoins, 
nous n&#8217;&#233;tions pas les premiers &#224; choisir ce formalisme. Nous devons mentionner qu&#8217;un travail ant&#233;rieur a 
&#233;t&#233; &#233;labor&#233; par (Habash et Rambow, 2004) pour g&#233;n&#233;rer une grammaire TAG pour la m&#234;me langue par 
extraction des r&#232;gles (ou arbres &#233;l&#233;mentaires) &#224; partir d&#8217;un corpus arbor&#233; (Maamouri et al., 2004). Pour 
notre part, nous visons une construction, plut&#244;t th&#233;orique qui touche une granularit&#233; informationnelle 
assez riche et fine &#224; la fois, et ce dans le but d&#8217;obtenir des arbres &#233;l&#233;mentaires exacts, uniformes et &#224; large 
couverture. La grammaire, ainsi, construite constitue une adaptation de TAG aux sp&#233;cificit&#233;s de l&#8217;arabe 
(Ben Fraj, 2010).   
</p>
<p>Le pr&#233;sent papier est structur&#233; comme suit. La seconde section pr&#233;sente un &#233;tat de l&#8217;art des grammaires 
formelles d&#233;j&#224; construites pour la langue arabe. Nous nous y focalisons sur les grammaires d&#8217;unification 
&#233;tant donn&#233; que c&#8217;est le m&#234;me courant que nous suivons. La troisi&#232;me section est r&#233;serv&#233;e &#224; la description 
de la grammaire que nous visons construire ; &#224; savoir ses caract&#233;ristiques, ses arbres &#233;l&#233;mentaires ainsi 
que les structures de traits qui y sont incarn&#233;es. Une quatri&#232;me section pr&#233;sentera l&#8217;application d&#233;velopp&#233;e 
pour assister l&#8217;utilisateur final &#224; bien g&#233;rer les agencements syntaxiques. Une &#233;valuation succincte de 
l&#8217;outil pr&#233;sente la premi&#232;re version de la grammaire construite. Nous concluons cet article par la 
pr&#233;sentation d&#8217;un ensemble de perspectives concernant l&#8217;am&#233;lioration de l&#8217;outil d&#233;velopp&#233; et l&#8217;utilisation 
de notre grammaire. 
</p>
<p>2  Grammaires pour la langue arabe : Etat de l&#8217;art 
</p>
<p>La construction d&#8217;une grammaire pr&#233;sente une t&#226;che primordiale pour diff&#233;rentes applications 
linguistiques. Ainsi, pour la langue arabe, diff&#233;rentes grammaires suivant diff&#233;rents formalismes 
grammaticaux ont &#233;t&#233; b&#226;ties. Le but principal est de servir la t&#226;che d&#8217;analyse syntaxique. Dans cette 
section, nous pr&#233;sentons, bri&#232;vement, les diff&#233;rentes grammaires qui ont &#233;t&#233; con&#231;ues pour repr&#233;senter la 
syntaxe de l&#8217;arabe. Tous ces travaux constituent des tentatives pour couvrir la plupart des r&#232;gles 
syntaxiques de la langue arabe ainsi que les ph&#233;nom&#232;nes linguistiques assez riches qui leurs sont attach&#233;s. 
</p>
<p>La TAG a &#233;t&#233; d&#233;j&#224; utilis&#233;e pour la repr&#233;sentation de la syntaxe arabe. (Habash et Rambow, 2004) ont 
construit une grammaire d&#8217;arbres adjoints par extraction d&#8217;arbres &#233;l&#233;mentaires &#224; partir d&#8217;un corpus arbor&#233;. 
Pour ce faire, ils ont utilis&#233; la partie 1 de la version 2.0 de PATB (Penn Arabic TreeBank) (Maamouri et 
al., 2004). Cette partie contient 160,000 mots annot&#233;s qui composent des textes du style journalistique. 
L&#8217;extraction passe par une r&#233;interpr&#233;tation du corpus en des structures de d&#233;pendances. Les chercheurs ont 
pu extraire des structures avec variation des positions de leurs composants vu que la langue arabe est &#224; 
ordre semi-fixe. Ils ont, alors, obtenu des phrases &#224; composition VSO (Verbe Sujet Objet) et d&#8217;autres &#224; 
SVO, alors qu&#8217;ils ont &#233;chou&#233; &#224; obtenir la composition VOS. Cet &#233;chec est d&#251; &#224; l&#8217;absence de ce genre de 
structures dans le corpus utilis&#233; pour l&#8217;extraction (Habash et Rambow, 2004). Le probl&#232;me de couverture 
est pos&#233; vu que cette construction est li&#233;e aux styles de textes contenus dans le corpus. 
</p>
<p>La grammaire LFG (Lexical Functional Grammar) (Kaplan et Bresnan, 1982), a aussi &#233;t&#233; utilis&#233;e pour 
repr&#233;senter la syntaxe de la langue arabe. Un travail a &#233;t&#233; &#233;labor&#233; par Attia (Attia, 2008). La grammaire 
qui a &#233;t&#233; cr&#233;&#233;e met en relief diff&#233;rentes sp&#233;cificit&#233;s de la langue arabe, sp&#233;cialement les phrases 
nominales ; c'est-&#224;-dire les phrases sans verbes, les phrases &#224; sujet cach&#233;, les phrases nominales &#224; 
propos )&#1585;&#1576;&#1582;(  phrase verbale, etc. Il a, aussi, sp&#233;cifi&#233; les &#233;quations d&#8217;accord entre les diff&#233;rents composants 
des structures syntaxiques. Pour toute phrase repr&#233;sent&#233;e par cette grammaire, les deux structures (la c-
structure et la f-structure) de la LFG ont &#233;t&#233; construites. 
</p>
<p>La HPSG (Head driven Phrase Structure Grammar) (Pollard et Sag, 1987) a fait aussi l&#8217;objet d&#8217;une 
recherche pour la description de la syntaxe arabe. Cette recherche a &#233;t&#233; &#233;labor&#233;e au sein du laboratoire 
LARIS (Haddar et al., 2010). L&#8217;id&#233;e de base consiste &#224; construire une grammaire qui poss&#232;de 
suffisamment de contraintes afin de l&#8217;utiliser pour la t&#226;che d&#8217;analyse syntaxique. Les chercheurs ont 
essay&#233; de couvrir plusieurs ph&#233;nom&#232;nes linguistiques de la langue manipul&#233;e. Ils ont, alors, construit les 
structures des phrases simples et aussi celles modifi&#233;es (par des mots outils) ainsi que les structures </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CONSTRUCTION D&#8217;UNE GRAMMAIRE D&#8217;ARBRES ADJOINTS POUR LA LANGUE ARABE 
</p>
<p>repr&#233;sentant des syntagmes nominaux simples et aussi &#224; compositions r&#233;cursives (comportant des 
subordonn&#233;es relatives). 
</p>
<p>3 ArabTAG : une adaptation de TAG &#224; la langue arabe 
</p>
<p>La grammaire que nous avons con&#231;ue est baptis&#233;e ArabTAG (Arabic Tree Adjoining Grammar). Elle 
h&#233;rite tous les fondements de base de TAG qui ont &#233;t&#233; accommod&#233;s aux sp&#233;cificit&#233;s de la langue arabe. 
Notre grammaire d&#233;crit hi&#233;rarchiquement diff&#233;rents composants syntaxiques de diff&#233;rents niveaux : 
phrases, syntagmes et mots (Ben Fraj et al., 2008) ainsi que les diff&#233;rentes informations qui leurs sont 
relatives (morphologiques, syntaxiques et aussi s&#233;mantiques). ArabTAG admet aussi un ensemble de 
caract&#233;ristiques que nous d&#233;crivons succinctement, dans ce qui suit. 
</p>
<p>3.1 ArabTAG est g&#233;n&#233;rique 
</p>
<p>En ArabTAG, seules les structures syntaxiques g&#233;n&#233;riques sont repr&#233;sent&#233;es ; c'est-&#224;-dire les structures qui 
sont form&#233;es par seulement les &#233;l&#233;ments n&#233;cessaires &#224; leur bonne formation. Ces &#233;l&#233;ments sont des sous-
cat&#233;gories syntaxiques (syntagme, verbe, adjectif, etc) affect&#233;s par des r&#244;les qu&#8217;ils jouent au sein de la 
structure m&#232;re o&#249; ils co-occurrent (Abeill&#233;, 1993). Ainsi, pour une phrase verbale, par exemple, ce sont : 
le verbe, le sujet et le(s) compl&#233;ment(s) d&#8217;objet qui sont mis en valeur. Dans le cas d&#8217;une phrase nominale, 
</p>
<p>&#1604;&#1575;&#1571;&#1583;&#1578;&#1576;&#1605;  (le th&#232;me) et &#1604;&#1575;&#1585;&#1600;&#1600;&#1600;&#1576;&#1582;  (le propos) sont les &#233;l&#233;ments &#224; repr&#233;senter. Il y a aussi description des structures 
g&#233;n&#233;riques correspondant aux syntagmes nominaux et ceux pr&#233;positionnels. Les compl&#233;ments de ces 
composants syntaxiques, comme par exemple &#1585;&#1592; &#1601;&#1604;&#1575;&#1606;&#1575;&#1605;&#1586;  (le C.C. de temps) et  &#1601;&#1585;&#1592;&#1604;&#1575;&#1606;&#1575;&#1603;&#1605;  (le C.C. de lieu) 
ou encore &#1604;&#1575;&#1581;&#1604;&#1575; (le mode), peuvent &#234;tre li&#233;s aux arbres &#233;l&#233;mentaires d&#8217;ArabTAG en utilisant les op&#233;rations 
appropri&#233;es d&#8217;association de structures (Joshi, 1975). Le but de cette g&#233;n&#233;ricit&#233; consiste &#224; &#233;viter 
l&#8217;explosion du nombre des arbres &#233;l&#233;mentaires possibles qui risquent d&#8217;&#234;tre ind&#233;nombrables, sachant que 
la langue arabe est &#224; ordre semi-fixe (Blach&#232;re et Gaudefroy-demombynes, 1975). L&#8217;explosion est 
in&#233;vitable si nous prenons en consid&#233;ration toutes les compositions possibles des &#233;l&#233;ments syntaxiques, par 
variation de l&#8217;ordre des &#233;l&#233;ments co-occurrents qu&#8217;ils soient obligatoires ou facultatifs. Par cons&#233;quent, 
ArabTAG renforce la notion de partage de structures, qui constitue un des avantages de TAG.  
</p>
<p>3.2 Richesse des structures de traits 
</p>
<p>Dans ArabTAG, nous avons d&#233;fini diff&#233;rents types d&#8217;informations sous forme de traits : morphologiques, 
syntaxiques, s&#233;mantiques et compositionnels. Tous ces traits sont n&#233;cessaires pour la bonne gestion des 
compositions syntaxiques. Ils sont organis&#233;s au sein de structures dites &#171; traits d&#8217;unification &#187;. Chaque 
n&#339;ud, au sein d&#8217;un arbre &#233;l&#233;mentaire, poss&#232;de sa propre structure de traits lui permettant de g&#233;rer ses 
associations ult&#233;rieures possibles avec d&#8217;autres arbres (Joshi, 1975). A chaque cat&#233;gorie de n&#339;uds est 
associ&#233; un ensemble pr&#233;cis de traits. A chacun de ces traits, nous avons d&#233;fini un ensemble de valeurs qui 
d&#233;crivent les relations du composant syntaxique cible avec son contexte. Le tableau 1 englobe un ensemble 
exemple et non exhaustif des traits d&#8217;unification.  
</p>
<p>Trait Description N&#339;uds concern&#233;s 
Gen Sp&#233;cifie l&#8217;accord en genre. N, Adj, Dem ou SN 
Nombr Pr&#233;cise l&#8217;accord en nombre. N, Adj, Dem ou SN 
Cas D&#233;finit le type du cas : Nominatif, Accusatif, G&#233;n&#233;tif ou 
</p>
<p>G&#233;mination. 
N, Adj ou SN 
</p>
<p>TestCas V&#233;rifie l&#8217;accord en cas. N, Adj, SN 
Def Sp&#233;cifie l&#8217;obligation (+) ou non (-) de la d&#233;finition de l&#8217;item cible N, SN 
TypeDef Deux types de d&#233;finition en arabe : d&#233;finition par l&#8217;article &quot;&#1600;&#1600;&#1604;&#1575;&quot;  
</p>
<p>(A) ou par annexion (B). 
N, SN 
</p>
<p>TestDef V&#233;rifie la n&#233;cessit&#233; (+) ou non (-) d&#8217;un accord du nom cible en 
d&#233;finition avec son contexte. 
</p>
<p>N 
</p>
<p>Pronom Pronom = Genre+Nombre. Sp&#233;cifie l&#8217;accord entre le verbe et son 
sujet (resp. suppl&#233;ant du sujet1) en genre et/ou en nombre, 
</p>
<p>V 
</p>
<p>                                                        
1. Le suppl&#233;ant du sujet (&#1604;&#1593;&#1575;&#1601; &#1576;&#1574;&#1575;&#1606;) remplace le sujet dans les phrases de la voix passive </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FERIEL BEN FRAJ 
</p>
<p>Trans V&#233;rifie la n&#233;cessit&#233; de l&#8217;existence des compl&#233;ments d&#8217;objet (TI, 
TD, I). 
</p>
<p>V 
</p>
<p>Voix Indique la voix de conjugaison du verbe. PV, V 
Temps Indique le temps de conjugaison du verbe. V 
Proc Caract&#233;rise les types de proclitiques permis pour l&#8217;item cible. Tous les n&#339;uds  
Enc Sp&#233;cifie si le composant syntaxique n&#233;cessite (+) ou non (-) 
</p>
<p>d&#8217;&#234;tre agglutin&#233; &#224; un enclitique. 
Tous les n&#339;uds  
</p>
<p>OmissionTheme D&#233;finit une obligation (+) ou non (-) de l&#8217;omission du th&#232;me 
d&#8217;une phrase nominale. 
</p>
<p>PN 
</p>
<p>OmissionSujet D&#233;finit une obligation (+) ou non (-) de l&#8217;omission du sujet. PV 
OmissionCOD D&#233;finit une obligation (+) ou non (-) de l&#8217;omission du COD. PV 
OmissionCOI D&#233;finit une obligation (+) ou non (-) de l&#8217;omission du COI. PV 
OmissionComp D&#233;finit une obligation (+) ou non (-) de l&#8217;omission du 
</p>
<p>compl&#233;ment du nom dans un SN d&#8217;annexion (dans le cas o&#249; le 
nom &#224; compl&#233;ter est agglutin&#233; &#224; un enclitique). 
</p>
<p>SN-Annexion 
</p>
<p>Propre Sp&#233;cifie si le nom est propre (P) ou commun (C). N, SN 
R&#244;le Le r&#244;le du composant courant au sein de l&#8217;arbre &#233;l&#233;mentaire. Tous les n&#339;uds  
Anim&#233; Indique si l&#8217;&#233;l&#233;ment linguistique est anim&#233; (+) ou non (-). N et tous les SN  
Humain Indique si l&#8217;&#233;l&#233;ment correspond &#224; un &#234;tre humain (+) ou non (-). N et tous les SN  
</p>
<p>Tableau 1 : Pr&#233;sentation des traits d&#8217;unification dans ArabTAG 
</p>
<p>Dans ce tableau les symboles miss en gras entre parenth&#232;ses correspondent &#224; des exemples de valeurs 
associ&#233;es aux diff&#233;rents traits. En plus de ces traits d&#8217;unification, nous avons d&#233;fini un second ensemble : 
celui des traits d&#8217;instanciation. Ce sont des informations morphosyntaxiques et s&#233;mantiques n&#233;cessaires 
lors de la lexicalisation de la grammaire. 
</p>
<p>3.3 ArabTAG est partiellement lexicalis&#233;e 
</p>
<p>Une grammaire d&#8217;arbres adjoints lexicalis&#233;e est une grammaire dans laquelle tout arbre &#233;l&#233;mentaire est 
muni d'au moins un symbole terminal qui est un item lexical. ArabTAG n&#8217;est pas compl&#232;tement 
lexicalis&#233;e, mais elle l&#8217;est partiellement. L&#8217;objectif de ce choix consiste, encore une fois, &#224; factoriser au 
maximum les structures &#233;l&#233;mentaires. De ce fait, nous mentionnons qu&#8217;ArabTAG contient un ensemble 
d&#8217;arbres &#233;l&#233;mentaires lexicalis&#233;s r&#233;serv&#233;s pour repr&#233;senter les contextes possibles des mots outils jouant le 
r&#244;le de &#171; modificateurs &#187; de phrases et/ou de syntagmes. En outre, notre grammaire poss&#232;de d&#8217;autres 
structures non lexicalis&#233;es, appel&#233;es aussi &#171; mod&#232;les d&#8217;arbres &#187;. Ces mod&#232;les comportent des n&#339;uds dits 
&#171; ancres &#187;. Ces n&#339;uds sont susceptibles de recevoir des entit&#233;s lexicales. La figure 1 pr&#233;sente ces deux 
types d&#8217;arbres.  
</p>
<p>Figure 1 : Exemples d&#8217;arbres &#233;l&#233;mentaires d&#8217;ArabTAG : (1) sch&#232;me et (2) arbre lexicalis&#233;2 
</p>
<p>                                                        
2 Les valeurs du trait proc pr&#233;sentent les classes des proclitiques pouvant s&#8217;agglutiner aux mots (+D : &#1601;&#1591;&#1593;&#1604;&#1575; &#1601;&#1608;&#1585;&#1581; 
(proclitiques de coordination). 
</p>
<p>PV 
</p>
<p>V&#61624; 
</p>
<p>: r&#244;le : P. verbale 
: omissionCOD : + 
: omissionCOI : + 
: omissionSujet : - 
</p>
<p>: r&#244;le : verbe 
: pron : +/*1 
: trans : I 
: voix : ACT 
: temps : PAS/PRE 
: proc : +B, +D, +E 
: enc : - 
 
</p>
<p>: r&#244;le : sujet 
: gen : + 
: nombr : * 
: testCas : ? 
: cas : N 
: proc : +C 
: enc : ? 
: def : ? 
: typeDef : ? 
: testDef : ? 
: anim&#233; : + 
: humain : + 
</p>
<p>SN&#8595;  
</p>
<p>PV 
</p>
<p>PV* &#1604;&#1575;  
(ne pas) 
</p>
<p>: r&#244;le : P. verbale 
: omissionCOD : +/- 
: omissionCOI : +/- 
: omissionSujet : + 
</p>
<p>: r&#244;le : P. verbale 
: omissionCOD : +/- 
: omissionCOI : +/- 
: omissionSujet : + 
</p>
<p>(1) (2) 
</p>
<p>: r&#244;le : &#1577;&#1740;&#1726;&#1575;&#1606;&#1604;&#1575; &#1604;&#1575; (outil 
d&#8217;inhibition)  
</p>
<p>: proc : +D, +H 
: enc : - </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CONSTRUCTION D&#8217;UNE GRAMMAIRE D&#8217;ARBRES ADJOINTS POUR LA LANGUE ARABE 
</p>
<p>Dans cette figure, alors que les traits correspondants aux racines sont compositionnels, les autres 
permettent plut&#244;t la gestion des correspondances d&#8217;informations &#224; l&#8217;int&#233;rieur de la structure du composant 
syntaxique. Dans l&#8217;arbre (1), nous mettons l&#8217;accent sur les valeurs &#224; associer aux traits. Si l&#8217;on commence 
&#224; partir de la racine, nous remarquons que les attributs omissionCOD et omissionCOI sont &#224; &#171; + &#187; ; c'est-&#224;-
dire que ces deux omissions sont obligatoires vu que le verbe dans la structure est intransitif &#171; I &#187;. Pour la 
m&#234;me raison, le trait enc du verbe est &#224; &#171; - &#187; ; c'est-&#224;-dire que ce verbe ne doit pas &#234;tre agglutin&#233; &#224; un 
enclitique. Pourtant, l&#8217;omission du sujet dans cette structure n&#8217;est pas permise car un sujet existe 
r&#233;ellement dans la structure. Le symbole &#171; ? &#187; veut dire que la valeur est ind&#233;finie &#224; ce stade et elle peut 
l&#8217;&#234;tre dans les d&#233;rivations suivantes du composant. Pour le genre du c&#244;t&#233; du SN, sa valeur (+) veut dire 
qu&#8217;il y a obligatoirement un accord en genre avec le verbe. Concernant la valeur du nombre (*), l&#8217;accord 
est conditionn&#233; par le fait que le verbe soit conjugu&#233; avec un pronom singulier ou non. Ceci nous m&#232;ne &#224; 
exploiter la valeur associ&#233;e au pronom du c&#244;t&#233; verbe (&#171; +/*1 &#187;). Cette quantit&#233; veut dire que l&#8217;accord en 
genre est obligatoire et que la conjugaison du verbe doit &#234;tre seulement r&#233;alis&#233;e avec des pronoms 
singuliers (&#1608;&#1726; (Il) ou bien &#1610;&#1726; (Elle)). Cette r&#232;gle d&#8217;accord est bas&#233;e sur les valeurs des deux traits 
s&#233;mantiques : anim&#233; et humain. Lorsque ces deux traits sont actifs (&#171; + &#187;), le verbe au d&#233;but de la phrase 
doit &#234;tre toujours au singulier et seul son genre change. Cette structure peut repr&#233;senter les deux phrases 
suivantes: &#1604;&#1601;&#1591;&#1604;&#1575; &#1605;&#1575;&#1606; (L&#8217;enfant s&#8217;est endormi) et &#1578;&#1576;&#1593;&#1604; &#1578;&#1606;&#1576;&#1604;&#1575;  (La fille a jou&#233;). Le second arbre (2) de la figure 
constitue un arbre &#233;l&#233;mentaire lexicalis&#233; et auxiliaire (Joshi, 1975). Elle met l&#8217;accent sur les traits 
compositionnels qui d&#233;pendent fortement de la composition interne de la phrase verbale (PV).  
</p>
<p>4 Pr&#233;sentation de l&#8217;outil de construction d&#8217;ArabTAG  
</p>
<p>4.1 Description 
</p>
<p>Dans le but de construire ArabTAG tout en respectant ses caract&#233;ristiques, d&#233;j&#224; d&#233;crites, nous avons choisi 
de concevoir et d&#233;velopper une application informatique qui consiste &#224; aider un grammairien de la langue 
arabe lors de la construction des arbres &#233;l&#233;mentaires d&#8217;ArabTAG. Cet outil est &#224; la fois modulaire et 
enrichi d&#8217;un syst&#232;me de contr&#244;le du processus de cr&#233;ation. De ce fait, il permet de garantir l&#8217;exactitude et 
l&#8217;uniformit&#233; des r&#232;gles (ou arbres &#233;l&#233;mentaires) construites. Ladite application pr&#233;sente une interface 
conviviale qui &#233;labore la structure hi&#233;rarchique de l&#8217;arbre.  
</p>
<p>La construction d&#8217;un arbre &#233;l&#233;mentaire passe obligatoirement par la construction de ses diff&#233;rents n&#339;uds 
qui d&#233;tiennent toutes les informations n&#233;cessaires pour sa bonne formation. La construction des n&#339;uds se 
fait selon un mode en profondeur. Ainsi, un nouveau n&#339;ud ne peut &#234;tre construit que si son pr&#233;d&#233;cesseur 
(son n&#339;ud fr&#232;re) est compl&#232;tement cr&#233;&#233; avec tous ses niveaux hi&#233;rarchiques internes pr&#233;vus. Le n&#339;ud 
racine est le premier &#224; &#234;tre construit. La bo&#238;te de dialogue &#224; droite de la figure 2, permet d&#8217;attribuer &#224; cette 
racine les traits compositionnels qui lui sont relatifs. Ces traits autorisent ou refusent &#224; la racine 
d&#8217;admettre certains composants internes comme le montre l&#8217;exemple (1) de la figure 1. Cette m&#234;me bo&#238;te 
de dialogue affecte &#224; chaque n&#339;ud l&#8217;ensemble qui lui correspond de traits d&#8217;unification. Cet ensemble 
varie selon que le type du n&#339;ud (nominal, verbal ou particule). L&#8217;affectation des traits et de leurs valeurs 
aux n&#339;uds est contr&#244;l&#233;e par l&#8217;outil. Ainsi, selon le type du n&#339;ud, le bon ensemble de traits est activ&#233; alors 
que les autres traits sont d&#233;sactiv&#233;s. 
</p>
<p>D&#8217;autant plus, un arbre peut accepter un (ou plusieurs) n&#339;ud(s) ancre(s). Tout n&#339;ud ancre admet, en plus 
des traits d&#8217;unification, le second ensemble de traits que nous venons de nommer d&#8217;instanciation.  
L&#8217;ensemble de ces traits sont illustr&#233;s dans la  bo&#238;te de dialogue &#224; gauche de la figure 2. Cette bo&#238;te est 
appel&#233;e lors de la cr&#233;ation d&#8217;un n&#339;ud ancre au sein d&#8217;une structure &#233;l&#233;mentaire g&#233;n&#233;rique ou encore lors 
de la cr&#233;ation d&#8217;un arbre lexicalis&#233;. Elle permet d&#8217;associer des traits divers de type morphosyntaxiques et 
s&#233;mantiques au n&#339;ud en question. 
</p>
<p>Chaque information ajout&#233;e &#224; la structure &#233;l&#233;mentaire est repr&#233;sent&#233;e d&#8217;une fa&#231;on litt&#233;raire sur l&#8217;interface 
principale de l&#8217;application (au milieu de la figure 2), et ce en attente de son codage &#224; la fin de la 
construction avec le m&#233;talangage XML.  Nous avons choisi XML dans le but de bien structurer les 
donn&#233;es contenues dans la grammaire et de standardiser leur repr&#233;sentation et ce afin de les exploiter par 
la suite ais&#233;ment et ind&#233;pendamment des applications.  
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FERIEL BEN FRAJ 
</p>
<p>Figure 2 : Diff&#233;rentes interfaces de l&#8217;application de construction d&#8217;ArabTAG 
</p>
<p>4.2 Evaluation de l&#8217;outil : la version 1.0 d&#8217;ArabTAG en chiffres 
</p>
<p>L&#8217;application, &#233;tant construite, nous a permis de construire une premi&#232;re version d&#8217;ArabTAG. Elle est 
compos&#233;e de diff&#233;rentes structures syntaxiques r&#233;parties entre phrases et syntagmes. Nous avons tenu 
compte de la diversit&#233; des structures syntagmatiques, sp&#233;cialement nominales. Nous avons, alors, obtenu 
380 arbres &#233;l&#233;mentaires diff&#233;rents, r&#233;partis entre quatre grandes familles comme le montre la figure 3. 
</p>
<p>Figure 3 : R&#233;partition des structures &#233;l&#233;mentaires d&#8217;ArabTAG en familles de structures  
</p>
<p>Lors de la cr&#233;ation de cette version d&#8217;ArabTAG, les bases th&#233;oriques que nous avons suivies sont les livres 
de Dahdah (Dahdah, 1992) et de Kouloughli (Kouloughli, 1992). La grammaire, ainsi construite couvre 
des structures elliptiques, d&#8217;autres anaphoriques et aussi des structures renfermant des subordonn&#233;es. Elle 
prend en consid&#233;ration la variation des positions des &#233;l&#233;ments au sein des composants syntaxiques et le 
ph&#233;nom&#232;ne d&#8217;agglutination.  
</p>
<p>5 Conclusion et perspectives 
</p>
<p>Afin de construire une grammaire d&#8217;arbres adjoints pour la langue arabe, nous avons choisi de d&#233;velopper 
un outil pour assister et aider les linguistes &#224; &#233;laborer des arbres &#233;l&#233;mentaires corrects, suffisamment 
riches et uniformes. L&#8217;application est &#224; interface conviviale et elle poss&#232;de des astuces pour contr&#244;ler la 
proc&#233;dure de construction les r&#232;gles sur le plan hi&#233;rarchisation ou sur le plan structures de traits. Suite &#224; 
l&#8217;utilisation de cet outil, nous avons pu obtenir la version 1.0 de notre grammaire contenant 380 arbres 
&#233;l&#233;mentaires. Toutefois, notre outil peut &#234;tre am&#233;lior&#233; par ajout d&#8217;un syst&#232;me de pr&#233;diction pour la cr&#233;ation 
qui se base sur la version, d&#233;j&#224; construite, d&#8217;ArabTAG pour mieux assister l&#8217;utilisateur &#224; mener les 
constructions ult&#233;rieures. D&#8217;autant plus, la version construite n&#8217;est que premi&#232;re et peut facilement &#234;tre 
aliment&#233;e par de nouveaux arbres &#233;l&#233;mentaires, comme elle peut &#234;tre transform&#233;e en une version 
compl&#232;tement lexicalis&#233;e. La grammaire, ainsi obtenue, peut &#234;tre utilis&#233;e dans diff&#233;rentes applications </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CONSTRUCTION D&#8217;UNE GRAMMAIRE D&#8217;ARBRES ADJOINTS POUR LA LANGUE ARABE 
</p>
<p>linguistiques, sp&#233;cialement l&#8217;analyse syntaxique de la langue arabe, et ce &#233;tant donn&#233;e la richesse de ses 
structures. Notre outil d&#8217;aide &#224; la construction peut aussi &#234;tre am&#233;lior&#233; par d&#8217;autres modules comme ceux 
de conversion de la TAG &#224; d&#8217;autres formalismes grammaticaux. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>ABEILLE A. (1993). Les nouvelles syntaxes, Armand Colin.  
</p>
<p>ATTIA MOHAMMED A. (2008). Handling Arabic Morphological and Syntactic Ambiguity within the LFG 
Framework with a View to Machine Translation, Th&#232;se de doctorat, Faculty of humanities, University of 
Manchester. 
</p>
<p>BEN FRAJ F. (2010). Un analyseur syntaxique pour les textes en langue arabe &#224; base d&#8217;un apprentissage &#224; 
partir de patrons d&#8217;arbres syntaxiques, Th&#232;se de doctorat, Ecole Nationale des Sciences de l&#8217;Informatique, 
Universit&#233; de La Manouba. 
</p>
<p>BEN FRAJ F., BEN OTHMANE ZRIBI C., BEN AHMED M. (2008). Ensemble Classification for Parsing Arabic 
Texts: A Theoretical Approach, In Proceedings of the AIPR 2008 multi-conference, Orlando, Florida, 
USA, 51-57. 
</p>
<p>BLACH&#200;RE R., and GAUDEFROY-DEMOMBYNES M. (1975). Grammaire de la langue arabe, Maisonneuve et 
Larose. 
</p>
<p>CHOMSKY N. (1965) Aspects of the theory of syntax, Cambridge, Massachusetts: MIT Press. 
</p>
<p>DAHDAH A. (1992). &#1578;&#1575;&#1581;&#1608;&#1604;&#1608; &#1604;&#1608;&#1575;&#1583;&#1580; &#1610;&#1601; &#1577;&#1740;&#1576;&#1585;&#1593;&#1604;&#1575; &#1577;&#1594;&#1604;&#1604;&#1575;  &#1583;&#1593;&#1575;&#1608;&#1602; &#1605;&#1580;&#1593;&#1605;, Librairie de Nachirun Lebanon, 5&#232;me edition, 
1992. 
</p>
<p>HABASH N., RAMBOW O. (2004). Extracting Tree Adjoining Grammar from the Penn Arabic Treebank, 
JEP-TALN 2004, Session Traitement Automatique de l&#8217;Arabe, F&#232;s. 
</p>
<p>HADDAR K., BOUKEDI S., ZALILA I. (2010). Construction of an HPSG grammar for the Arabic language 
and its specification in TDL, International Journal on Information and Communication Technologies, vol. 
3, n&#176; 3.  
</p>
<p>JOSHI A. K., LEVY L. S., TAKAHASHI M. (1975). Tree adjunct grammars, Journal of the Computer and 
System Sciences, vol. 10, n&#176; 1, 136-163.  
</p>
<p>KAHANE S. (2002). Grammaire d'Unification Sens-Texte &#8211; Vers un mod&#232;le math&#233;matique articul&#233; de la 
langue, Hdr de l'Universit&#233; Paris 7, 82. 
</p>
<p>KAPLAN R. M., BRESNAN J. (1982). Lexical functional grammar: A formal system for grammatical 
representation, In J. BRESNAN, Ed., The Mental Representation of Grammatical Relations. Cambridge, 
Mass.: MIT Press, 173-281. 
</p>
<p>KOULOUGHLI J. (1992). La grammaire Arabe pour tous, Edition Presses Pocket. 
</p>
<p>LECOMTE A., M&#233;thodes pour le Traitement Automatique des Langues, cours Ing&#233;nierie de la 
Communication Personne-Syst&#232;me, Universit&#233; Pierre Mend&#232;s-France, France, 2004. 
</p>
<p>MAAMOURI M., BIES A., BUCKWALTER T., MEKKI W. (2004). The Penn Arabic Treebank: Building a 
Large-Scale Annotated Arabic Corpus, In NEMLAR International Conference on Arabic Language 
Resources and Tools, 102-109. 
</p>
<p>PEREIRA F. C. N. and WARREN D. H. D. (1980). Definite clause grammars for language analysis : a 
survey of the formalism and a comparison with augmented transition networks. Artificial Intelligence 13, 
pp. 231 &#8211; 278. 
</p>
<p>POLLARD C., and SAG I. (1994). Head-driven Phrase Structure Grammar, CLSI series, University of 
Chicago. 
</p>
<p> </p>

</div></div>
</body></html>