<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction non-supervis&#233;e de relations bas&#233;e sur la dualit&#233; de la repr&#233;sentation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211;1er juillet 2011
</p>
<p>Extraction non-supervis&#233;e de relations bas&#233;e sur la dualit&#233; de la
repr&#233;sentation
</p>
<p>Yayoi Nakamura-Delloye1
(1) ALPAGE, INRIA-Rocquencourt
</p>
<p>Domaine de Voluceau Rocquencourt B.P.105 78153 Le Chesnay
yayoi@yayoi.fr
</p>
<p>R&#233;sum&#233;. Nous proposons dans cet article une m&#233;thode non-supervis&#233;e d&#8217;extraction des relations entre enti-
t&#233;s nomm&#233;es. La m&#233;thode propos&#233;e se caract&#233;rise par l&#8217;utilisation de r&#233;sultats d&#8217;analyses syntaxiques, notamment
les chemins syntaxiques reliant deux entit&#233;s nomm&#233;es dans des arbres de d&#233;pendance. Nous avons &#233;galement
exploit&#233; la dualit&#233; de la repr&#233;sentation des relations s&#233;mantiques et le r&#233;sultat de notre exp&#233;rience comparative a
montr&#233; que cette approche am&#233;liorait les rappels.
</p>
<p>Abstract. We propose in this paper an unsupervised method for relation and pattern extraction. The pro-
posed method is characterized by using parsed corpora, especially by leveraging syntactic paths that connect two
named entities in dependency trees. We also use the dual representation of semantic relations and the result of our
comparative experiment showed that this approach improves recall.
</p>
<p>Mots-cl&#233;s : Extraction des connaissances, relations entre entit&#233;s nomm&#233;es, dualit&#233; relationnelle.
</p>
<p>Keywords: Knowledge extraction, named entity relationships, relational duality.
</p>
<p>1 Introduction
</p>
<p>L&#8217;extraction de relations entre entit&#233;s nomm&#233;es (EN ci-apr&#232;s) est une op&#233;ration importante pour beaucoup d&#8217;ap-
plications et de nombreuses &#233;tudes ont &#233;t&#233; propos&#233;es dans diff&#233;rents cadres de travail tels que la conception
d&#8217;un syst&#232;me de question-r&#233;ponse (Iftene &amp; Balahur-Dobrescu, 2008), l&#8217;extraction d&#8217;information (Banko et al.,
2007) ou l&#8217;extraction de r&#233;seaux sociaux (Matsuo et al., 2006). Nous proposons dans cet article une m&#233;thode
non-supervis&#233;e d&#8217;extraction de relations entre EN &#224; partir de r&#233;sultats d&#8217;analyses syntaxiques. Nos travaux ont &#233;t&#233;
men&#233;s en vue du peuplement du r&#233;f&#233;rentiel ontologique constitu&#233; dans le cadre d&#8217;exp&#233;riences d&#8217;enrichissement
s&#233;mantique de d&#233;p&#234;ches de l&#8217;Agence France Presse (Stern &amp; Sagot, 2010).
</p>
<p>De nombreuses m&#233;thodes supervis&#233;es d&#8217;acquisition de relations bas&#233;es sur des grands corpus annot&#233;s telles que
(Zelenko et al., 2002), ont &#233;t&#233; propos&#233;es. Un de leurs plus grands d&#233;fauts est le co&#251;t &#233;lev&#233; pour la r&#233;alisation de
l&#8217;annotation. Les approches semi-supervis&#233;es se fondent g&#233;n&#233;ralement sur un principe d&#8217;&#171; induction &#187; qui recourt
&#224; un petit ensemble d&#8217;exemples de relations (Hearst, 1992) (Brin, 1998) (Agichtein &amp; Gravano, 2000). Mais,
les difficult&#233;s de d&#233;terminer pr&#233;alablement des relations int&#233;ressantes, et de trouver des exemples pertinents pour
ces relations constituent des inconv&#233;nients de ces m&#233;thodes semi-supervis&#233;es. Les travaux de (Hasegawa et al.,
2004) ont propos&#233; une m&#233;thode non-supervis&#233;e qui &#233;carte ces probl&#232;mes de pr&#233;d&#233;finition des relations &#224; extraire.
Elle est constitu&#233;e de deux grandes &#233;tapes : clustering selon les contextes partag&#233;s et &#233;tiquetage des clusters par</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YAYOI NAKAMURA-DELLOYE
</p>
<p>d&#233;termination des mots repr&#233;sentatifs &#224; partir de contextes. Diff&#233;rentes am&#233;liorations ont &#233;t&#233; propos&#233;es par la
suite (Zhang et al., 2005) (He et al., 2006) (Bollegala et al., 2010). La m&#233;thode que nous proposons se fonde sur
le m&#234;me principe. Mais elle se distingue de ces travaux ant&#233;rieurs notamment par l&#8217;exploitation des r&#233;sultats de
l&#8217;analyse syntaxique permettant d&#8217;extraire non pas les contextes lin&#233;aires de surface mais structurels. Par ailleurs,
afin d&#8217;am&#233;liorer l&#8217;efficacit&#233; de la classification, nous avons pleinement exploit&#233; la dualit&#233; de la repr&#233;sentation
des relations s&#233;mantiques, comme propos&#233; dans (Bollegala et al., 2010), et nous avons men&#233; une exp&#233;rience
comparative de diff&#233;rentes m&#233;thodes de calcul de similarit&#233;.
</p>
<p>Nous allons d&#8217;abord introduire deux notions principales : dualit&#233; de la repr&#233;sentation des relations et chemins de
relations (&#167; 2) avant de d&#233;crire notre m&#233;thode non-supervis&#233;e d&#8217;extraction de relations (&#167; 3) avec les diff&#233;rentes
similarit&#233;s que nous avons employ&#233;es. La section suivante sera consacr&#233;e &#224; la pr&#233;sentation du r&#233;sultat d&#8217;&#233;valuation
(&#167; 4), avant de conclure notre expos&#233; par les perspectives de nos travaux (&#167; 5).
</p>
<p>2 Deux notions principales
</p>
<p>Une relation s&#233;mantique existant entre deux &#233;l&#233;ments peut &#234;tre d&#233;finie de deux mani&#232;res : d&#233;finition extension-
nelle et d&#233;finition intensionnelle. Une d&#233;finition extensionnelle de la relation R consiste &#224; cr&#233;er la liste compl&#232;te
des instances de cette relation, not&#233;e C(R). Par exemple, la d&#233;finition extensionnelle de la relation EstPr&#233;sident
entre un individu X et une organisation Y &#233;num&#232;re toutes les paires d&#8217;EN entretenant cette relation comme :
C(EstPr&#233;sident) = {(Joseph S. Blatter, FIFA), (Martin Hirsch, Emma&#252;s France), ...}. Une d&#233;finition intension-
nelle de la relation R sp&#233;cifie un ensemble de propri&#233;t&#233;s permettant d&#8217;identifier cette relation, not&#233; P (R). Ainsi,
la m&#234;me relation EstPr&#233;sident peut &#234;tre d&#233;finie de mani&#232;re intensionnelle par des patrons lexicaux tels que :
P (EstPr&#233;sident) = {&quot;X est le pr&#233;sident de Y&quot;, &quot;X, pr&#233;sident de Y&quot;, ...}. Comme nous utilisons des r&#233;sultats
d&#8217;analyse syntaxique, cette liste est constitu&#233;e, non pas de ces patrons textuels, mais de ce que nous appelons des
&#171; chemins syntaxiques de relations &#187;.
</p>
<p>Nous consid&#233;rons les chemins reliant deux EN dans un arbre syntaxique comme repr&#233;sentant leur relation et
nous les appelons chemins syntaxiques de relations. Comme dans notre m&#233;thode semi-supervis&#233;e (Nakamura-
Delloye &amp; Villemonte de La Clergerie, 2010), la premi&#232;re op&#233;ration de notre extraction consiste &#224; identifier tous
les couples d&#8217;EN et les chemins qui les relient dans les arbres syntaxiques de d&#233;pendance. Par exemple, dans
la phrase &#171; Xavier Bertrand succ&#232;de officiellement &#224; Patrick Devedjian &#187;, on identifie un couple d&#8217;EN (Xavier
Bertrand, Patrick Devedjian), et le chemin de relation qui les relie, (X)&#8594;suj-v succ&#233;derv &#8592;cpl-v(&#224;)(Y ).
</p>
<p>3 M&#233;thode non-supervis&#233;e d&#8217;acquisition des relations entre EN
</p>
<p>Tous les couples d&#8217;EN qui partagent le m&#234;me chemin de relation pi sont regroup&#233;s pour constituer des couples tels
que (P,C), P un ensemble de chemins {pi} (contenant initialement un seul chemin) et C l&#8217;ensemble des couples
d&#8217;EN regroup&#233;s {c1, ...cn}. On consid&#232;re ces ensembles comme des sous-ensembles de relations et l&#8217;op&#233;ration
d&#8217;acquisition de relations se d&#233;finit alors comme la constitution, par fusions de ces sous-ensembles, des ensembles
complets pour diff&#233;rentes relations, Ri = (P (Ri), C(Ri)). Ces fusions sont r&#233;alis&#233;es par la classification de ces
sous-ensembles &#224; l&#8217;aide de leur similarit&#233;. &#201;tant donn&#233; la dualit&#233; de repr&#233;sentation de ces relations, leur similarit&#233;
peut &#233;galement &#234;tre &#233;valu&#233;e sur deux plans, en termes de d&#233;finitions intensionnelle (c&#8217;est-&#224;-dire la similarit&#233; des
chemins partag&#233;s) ou extensionnelle (c&#8217;est-&#224;-dire la similarit&#233; des instances de relations).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION NON-SUPERVIS&#201;E DE RELATIONS BAS&#201;E SUR LA DUALIT&#201; DE LA REPR&#201;SENTATION
</p>
<p>Calcul des similarit&#233;s La similarit&#233; des chemins est calcul&#233;e selon la similarit&#233; lexicale des mots composant les
chemins. Chaque chemin est d&#8217;abord repr&#233;sent&#233; dans un espace vectoriel par ses composants lexicaux pond&#233;r&#233;s
avec la mesure tf.idf. Dans nos travaux, seuls les verbes (sauf &#234;tre et avoir) et les noms sont pris en compte. La
valeur du mot i est donc calcul&#233;e comme suit : mi = tfi &#183; idfi o&#249; tfi correspond &#224; la fr&#233;quence du mot, et idfi est
calcul&#233; &#224; partir du nombre de chemins o&#249; le terme i n&#8217;appara&#238;t pas, compte tenu du nombre total de chemins. Les
similarit&#233;s entre les vecteurs repr&#233;sentant les chemins sont ensuite calcul&#233;es selon la similarit&#233; cosinus.
</p>
<p>La similarit&#233; des instances de relations est calcul&#233;e selon le nombre de couples d&#8217;EN communs. Deux mesures ont
&#233;t&#233; exp&#233;riment&#233;es. La premi&#232;re est bas&#233;e sur l&#8217;indice de Jaccard. La similarit&#233; entre deux ensembles Ci et Cj est
alors calcul&#233;e comme : sim(Ci, Cj) =
</p>
<p>nb(Ci,Cj)
nb(Ci)+nb(Cj)
</p>
<p>o&#249; nb(X) est le nombre de couples d&#8217;EN dans l&#8217;ensemble
X et nb(X,Y ) le nombre de couples d&#8217;EN communs dans les ensembles X,Y . Le second type est bas&#233; sur la
similarit&#233; cosinus avec les vecteurs des couples d&#8217;EN. La valeur du couple i de l&#8217;ensembleCj est calcul&#233;e comme :
cji = tf
</p>
<p>j
i &#183; idfi o&#249; tf ji correspond &#224; la fr&#233;quence du couple dans cet ensemble, et idfi est calcul&#233; &#224; partir du nombre
</p>
<p>de chemins qui ne relient pas le couple i, compte tenu du nombre total de chemins.
</p>
<p>Classification des chemins et &#233;tiquetage des classes Avec ces similarit&#233;s, la classification des sous-ensembles
est r&#233;alis&#233;e par une m&#233;thode de classification en deux temps. Dans un premier temps, les sous-ensembles sont
fusionn&#233;s selon la similarit&#233; lexicale des chemins. &#192; ce stade, les couples (Pi, Ci) dont les chemins appartenant &#224;
l&#8217;ensemble Pi ont une similarit&#233; significative sont regroup&#233;s par une m&#233;thode de classification ascendante hi&#233;rar-
chique (CAH). Dans un deuxi&#232;me temps, les &#233;l&#233;ments de l&#8217;ensemble Ci sont examin&#233;s pour regrouper ces couples
selon la similarit&#233; des instances calcul&#233;e par une des deux m&#233;thodes d&#233;crites pr&#233;c&#233;demment.
</p>
<p>&#192; la fin de cette classification en deux temps, nous obtenons un ensemble de couples repr&#233;sentant les relations Ri,
constitu&#233;s d&#8217;un ensemble de chemins P (Ri) correspondant &#224; la d&#233;finition intensionnelle, et d&#8217;un ensemble d&#8217;ins-
tances C(Ri) correspondant &#224; la d&#233;finition extensionnelle. Ces classes ainsi construites sont ensuite &#233;tiquet&#233;es par
le terme le plus repr&#233;sentatif des chemins partag&#233;s. La repr&#233;sentabilit&#233; du terme i dans cette classe j est la somme
des valeurs de ses n occurrences : rep(tji ) = &#931;
</p>
<p>n
i=1val(t
</p>
<p>s
i ), o&#249; la valeur de chaque occurrence val(t
</p>
<p>s
i ) correspond
</p>
<p>au nombre de couples d&#8217;EN que relie le chemin s dans lequel le terme appara&#238;t.
</p>
<p>4 &#201;valuation
</p>
<p>Une &#233;valuation de notre m&#233;thode a &#233;t&#233; r&#233;alis&#233;e avec le r&#233;sultat d&#8217;extraction d&#8217;un corpus constitu&#233; d&#8217;un mois de
d&#233;p&#234;ches AFP (janvier 2007) contenant 41 731 phrases. Le corpus comporte les r&#233;sultats non v&#233;rifi&#233;s de l&#8217;analyse
syntaxique avec &#233;tiquetage des EN, fournis par l&#8217;analyseur FRMG (Villemonte de La Clergerie et al., 2009),
utilisant lui-m&#234;me pour l&#8217;&#233;tiquetage d&#8217;entit&#233;s nomm&#233;es SxPipe (Sagot &amp; Boullier, 2008).
</p>
<p>4.1 M&#233;thode d&#8217;&#233;valuation
</p>
<p>La longueur maximum de chemins est fix&#233;e &#224; cinq. Cette valeur a &#233;t&#233; d&#233;finie suite &#224; l&#8217;&#233;tude de la productivit&#233; des
chemins (i.e. nombre de couples d&#8217;EN qu&#8217;ils relient) selon la longueur, et du temps de calcul selon la longueur
maximum d&#233;finie. De plus, nous n&#8217;avons trait&#233; que les chemins reliant au moins deux couples d&#8217;EN diff&#233;rents.
Nous avons &#233;galement &#233;limin&#233; les chemins sans n&#339;ud interm&#233;diaire, correspondant &#224; la relation syntaxique r&#233;a-
lis&#233;e par une juxtaposition. En effet, les relations s&#233;mantiques repr&#233;sent&#233;es par ces chemins telles que &#171; apparte-
nance &#187; sont tellement larges qu&#8217;elles englobent des sous-classes telles que &#171; est pr&#233;sident de &#187;, &#171; est porte-parole</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YAYOI NAKAMURA-DELLOYE
</p>
<p>de &#187;, qui sont utiles pour le peuplement de notre r&#233;f&#233;rentiel ontologique. Contrairement aux travaux comme (Ha-
segawa et al., 2004) qui ne prenaient en compte que des couples ayant plus de trente cooccurrences, nous n&#8217;avons
d&#233;fini aucun seuil pour les couples, en supposant que l&#8217;utilisation des chemins syntaxiques permettait de rep&#233;rer
de mani&#232;re efficace et fiable les couples d&#8217;EN entretenant une certaine relation s&#233;mantique. L&#8217;extraction des rela-
tions a &#233;t&#233; r&#233;alis&#233;e pour deux types de relations : relations individu-organisation (IND-ORG) et individu-individu
(IND-IND). Pour la mesure de dissimilarit&#233; inter-classe lors de la classification, nous avons test&#233; deux strat&#233;gies :
l&#8217;une consiste &#224; d&#233;finir la similarit&#233; de la classe nouvellement constitu&#233;e avec chaque autre classe par la plus petite
similarit&#233; des deux classes regroup&#233;es (Min), et l&#8217;autre par la plus grande similarit&#233; des deux (Max). Le seuil pour
l&#8217;arr&#234;t des agr&#233;gations est d&#233;fini &#224; la similarit&#233; 0 comme dans les travaux ant&#233;rieurs. Nous avons &#233;galement test&#233;
trois types de classifications : un premier type r&#233;alis&#233; uniquement avec la similarit&#233; des chemins, les deux autres
r&#233;alis&#233;s en deux temps avec la similarit&#233; des chemins puis celle des instances calcul&#233;e par indice de Jaccard ou
par similarit&#233; cosinus.
</p>
<p>Apr&#232;s avoir obtenu les r&#233;sultats avec des configurations diff&#233;rentes, nous avons pr&#233;par&#233; manuellement une r&#233;-
f&#233;rence des instances pour 6 relations qui ont &#233;t&#233; extraites par toutes les m&#233;thodes exp&#233;riment&#233;es : pr&#233;sident,
directeur, secr&#233;taire pour la relation IND-ORG et avocat, porte-parole, remplacer pour IND-IND. Les nombres
d&#8217;instances rep&#233;r&#233;es et v&#233;rifi&#233;es manuellement sont 336 pour IND-ORG et 83 pour IND-IND. Les instances de
relations extraites par nos m&#233;thodes sont ensuite &#233;valu&#233;es manuellement en correcte ou incorrecte. Les rappel,
pr&#233;cision et F-mesure sont calcul&#233;s comme suit :
Rappel : nombre de couples d&#233;tect&#233;s parmi ceux qui figurent dans la liste des couples de r&#233;f&#233;rence, calcul&#233; par la
formule suivante : R = NcorrectNcouples_de_refe&#769;rence
Pr&#233;cision : nombre de couples corrects parmi l&#8217;ensemble des couples d&#233;tect&#233;s, calcul&#233; par la formule suivante :
P = NcorrectNcorrect+Nincorrect
F-mesure : score calcul&#233; par la combinaison du rappel et de la pr&#233;cision comme suit : F = 2RPR+P
</p>
<p>4.2 R&#233;sultats et discussion
</p>
<p>Le tableau 1 pr&#233;sente les r&#233;sultats de l&#8217;&#233;valuation de nos quatre m&#233;thodes : 1) similarit&#233; des chemins avec crit&#232;re
d&#8217;agr&#233;gation Max (Max-Chem), 2) similarit&#233; des chemins avec crit&#232;re d&#8217;agr&#233;gation Min (Min-Chem), 3) similarit&#233;
des chemins puis similarit&#233; des instances calcul&#233;e avec l&#8217;indice de Jaccard (Min-Jac), et 4) similarit&#233; des chemins
puis similarit&#233; des instances calcul&#233;e avec similarit&#233; cosinus des vecteurs de couples d&#8217;EN (Min-Vec).
</p>
<p>Toutes les m&#233;thodes ont &#233;t&#233; exp&#233;riment&#233;es avec crit&#232;re d&#8217;agr&#233;gation Max, mais comme on peut le constater dans
le r&#233;sultat (Max-Chem) cette mesure entra&#238;ne un bruit trop important, constat&#233; &#233;galement dans des r&#233;sultats non-
pr&#233;sent&#233;s ici. Les rappels sup&#233;rieurs &#224; 1 signifient que ces m&#233;thodes ont identifi&#233; certaines instances de relations
que nous n&#8217;avions pas pu rep&#233;rer &#224; la main lors de la constitution de la r&#233;f&#233;rence. La bonne pr&#233;cision que nous
avons eue, tout en traitant des couples de fr&#233;quence tr&#232;s peu &#233;lev&#233;e, semble confirmer notre hypoth&#232;se et montrer
la fiabilit&#233; des relations entre deux EN reli&#233;es par un chemin syntaxique. Un autre avantage de l&#8217;utilisation des
chemins syntaxiques est que malgr&#233; la longueur maximum fix&#233;e &#224; cinq n&#339;uds interm&#233;diaires, les instances de
relations tr&#232;s &#233;loign&#233;es (comme par une incise) dans la repr&#233;sentation lin&#233;aire peuvent &#234;tre extraites.
</p>
<p>La m&#233;thode Min-Chem a fourni de tr&#232;s bonnes pr&#233;cisions, mais les regroupements r&#233;alis&#233;s par cette m&#233;thode
ne d&#233;passaient jamais ceux entre les classes des chemins partageant les m&#234;mes unit&#233;s lexicales, ce qui explique
ses taux de rappel limit&#233;s. Les deux autres m&#233;thodes permettaient les fusions des classes dont les chemins ne
pr&#233;sentaient aucune similarit&#233; lexicale, comme par exemple les classes comportant le terme leader et le terme
chef ou encore les classes portant les termes patron et PDG. De m&#234;me, les classes dont la similarit&#233; &#233;tait nulle &#224;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXTRACTION NON-SUPERVIS&#201;E DE RELATIONS BAS&#201;E SUR LA DUALIT&#201; DE LA REPR&#201;SENTATION
</p>
<p>Type IND-ORG IND-IND
M&#233;thode Max-Chem Min-Chem Min-Jac Min-Vec Max-Chem Min-Chem Min-Jac Min-Vec
Rappel 0,732 0,711 0,937 1,022 0,835 0,973 1,038 1,038
Pr&#233;cision 0,682 0,964 0,944 0,834 0,926 0,944 0,887 0,887
F-mesure 0,686 0,732 0,934 0,911 0,872 0,958 0,952 0,952
</p>
<p>TABLE 1 &#8211; R&#233;sultats d&#8217;&#233;valuation
</p>
<p>cause d&#8217;une mauvaise analyse syntaxique ont &#233;galement &#233;t&#233; fusionn&#233;es par ces m&#233;thodes.
</p>
<p>Les erreurs d&#8217;analyse syntaxique &#233;taient en effet la source principale des erreurs. Par exemple, les syntagmes &#171; Le
pr&#233;sident du Sinn F&#233;in, Gerry Adams &#187;, &#171; le pr&#233;sident palestinien Mahmoud Abbas, du Fatah &#187; ont &#233;t&#233; analys&#233;s
par la m&#234;me structure. Mais Mahmoud Abbas n&#8217;est pas pr&#233;sident du Fatah et ce dernier aurait d&#251; &#234;tre rattach&#233;
directement &#224; ce premier et non au terme pr&#233;sident. Le terme pr&#233;sident, lorsqu&#8217;il est utilis&#233; dans le sens de chef
de l&#8217;&#233;tat, constitue souvent un pr&#233;dicat unaire et n&#8217;attend pas deux arguments.
</p>
<p>Par ailleurs, l&#8217;extraction des relations entre EN du m&#234;me type pose des probl&#232;mes sp&#233;cifiques. En effet, les classes
form&#233;es pour IND-IND sont pour l&#8217;instant sym&#233;triques, c&#8217;est-&#224;-dire qu&#8217;on sait seulement que les instances de la
classe remplacer, par exemple, sont des couples en relation de rempla&#231;ant et remplac&#233; sans savoir le r&#244;le exact de
chacun. Afin de r&#233;soudre ce probl&#232;me il faudrait introduire une op&#233;ration qui examine la similarit&#233; en inversant
le sens de la relation de l&#8217;une des deux classes &#224; comparer. Mais il existe aussi d&#8217;autres types de probl&#232;mes. Par
exemple, dans la plupart des cas, le sujet est le rempla&#231;ant et le COD le remplac&#233;, comme dans &#171; Alain M&#233;ar rem-
place Philippe Levrier, qui pr&#233;side la commission Audiovisuel num&#233;rique terrestre &#187;, mais dans &#171; Bush remplace
Garner par Paul Bremer &#187; le sujet et le COD ne sont pas en cette relation et les informations contenues dans le
chemin qui les relie ne suffit pas pour traiter correctement leur relation. Il existe &#233;galement d&#8217;autres cas nous fai-
sant ressentir la n&#233;cessit&#233; de plus d&#8217;information. Dans &#171; Nonce Paolini, directeur g&#233;n&#233;ral de Bouygues Telecom &#187;
&#171; Nicolas Boutaud, directeur commercial de Brittany Ferries &#187;, les EN individu et organisation sont reli&#233;es par le
m&#234;me chemin. Ces couples d&#8217;EN sont donc consid&#233;r&#233;s comme appartenant &#224; la m&#234;me classe de relation, alors que
le directeur g&#233;n&#233;ral peut tout &#224; fait appartenir &#224; la classe patron mais pas le directeur commercial.
</p>
<p>5 Conclusion
</p>
<p>Nous avons propos&#233; une m&#233;thode non-supervis&#233;e d&#8217;extraction des relations entre entit&#233;s nomm&#233;es. Nous avons
&#233;galement pr&#233;sent&#233; le r&#233;sultat d&#8217;une exp&#233;rience d&#8217;&#233;valuation permettant de comparer quatre m&#233;thodes combinant
diff&#233;rentes similarit&#233;s. Le r&#233;sultat montre l&#8217;efficacit&#233; des m&#233;thodes exploitant la dualit&#233; de la repr&#233;sentation des
relations, mais pour d&#233;terminer la meilleure m&#233;thode du calcul de la similarit&#233;, il nous faudra r&#233;aliser l&#8217;&#233;valuation
d&#8217;un plus grand nombre de r&#233;sultats. Nos prochains travaux porteront &#233;galement sur l&#8217;int&#233;gration des relations
extraites dans notre ontologie et l&#8217;am&#233;lioration de la m&#233;thode &#224; cet effet.
</p>
<p>Remerciements
</p>
<p>Les travaux d&#233;crits dans cet article ont d&#233;but&#233; avec le projet SCRIBO (Semi-automatic and Collaborative Retrieval
of Information Based on Ontologies), labellis&#233; par le p&#244;le de comp&#233;titivit&#233; System@tic et financ&#233; par la DGE, et se
sont poursuivis dans le cadre du projet EDyLex (Enrichissement Dynamique de ressources Lexicales multilingues</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YAYOI NAKAMURA-DELLOYE
</p>
<p>en contexte multimodal), financ&#233; par l&#8217;ANR (ANR-09-CORD-008).
Site internet du projet : http://sites.google.com/site/projetedylex/.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AGICHTEIN E. &amp; GRAVANO L. (2000). Snowball : Extracting relations from large plain-text collections. In
Proceedings of the 5th ACM International Conference on Digital Libraries, p. 85&#8211;94.
</p>
<p>BANKO M., CAFARELLA M. J., SODERLAND S., BROADHEAD M. &amp; ETZIONI O. (2007). Open information
extraction from the web. In IJCAI&#8217;07, p. 2670&#8211;2676.
</p>
<p>BOLLEGALA D., MATSUO Y. &amp; ISHIZUKA M. (2010). Relational duality : Unsupervised extraction of semantic
relations between entities on the web. In Proc. of the 19th International Conference on World Wide Web (WWW
2010), p. 151&#8211;160.
</p>
<p>BRIN S. (1998). Extracting patterns and relations from the world wide web. In WebDB Workshop at 6th Inter-
national Conference on Extending Database Technology, EDBT&#8217;98, p. 172&#8211;183.
</p>
<p>HASEGAWA T., SEKINE S. &amp; GRISHMAN R. (2004). Discovering relations among named entities from large
corpora. In Proceedings of the 42nd Meeting of the Association for Computational Linguistics (ACL&#8217;04), Main
Volume, p. 415&#8211;422, Barcelona, Spain.
</p>
<p>HE T., ZHAO J. &amp; LI J. (2006). Discovering relations among named entities by detecting community structure.
In Proceedings of the 20th Pacific Asia Conference on Language, Information and Computation, p. 42&#8211;48.
</p>
<p>HEARST M. A. (1992). Automatic acquisition of hyponyms from large text corpora. In Proceedings of the 14th
International Conference on Computational Linguistics, p. 539&#8211;545.
</p>
<p>IFTENE A. &amp; BALAHUR-DOBRESCU A. (2008). Named entity relation mining using wikipedia. In Proceedings
of the Sixth International Language Resources and Evaluation (LREC&#8217;08), Marrakech, Morocco : European
Language Resources Association (ELRA).
</p>
<p>P. LANGLAIS &amp; M. GAGNON, Eds. (2010). Actes de TALN 2010 (Traitement automatique des langues natu-
relles), Montr&#233;al. ATALA, RALI-WeST.
</p>
<p>MATSUO Y., MORI J., HAMASAKI M., ISHIDA K., NISHIMURA T., TAKEDA H., HASIDA K. &amp; ISHIZUKA
M. (2006). Polyphonet : An advanced social network extraction system from the web. In Proc. of the 15th
International Conference on World Wide Web (WWW 2006).
</p>
<p>NAKAMURA-DELLOYE Y. &amp; VILLEMONTE DE LA CLERGERIE E. (2010). Exploitation de r&#233;sultats d&#8217;analyse
syntaxique en vue d&#8217;acquisition de relations entre entit&#233;s nomm&#233;es. In (Langlais &amp; Gagnon, 2010).
</p>
<p>SAGOT B. &amp; BOULLIER P. (2008). Sxpipe 2 : architecture pour le traitement pr&#233;syntaxique de corpus bruts.
Traitement Automatique des Langues, 49(2), 155&#8211;188.
STERN R. &amp; SAGOT B. (2010). D&#233;tection et r&#233;solution d&#8217;entit&#233;s nomm&#233;es dans des d&#233;p&#234;ches d&#8217;agence. In
(Langlais &amp; Gagnon, 2010).
</p>
<p>VILLEMONTE DE LA CLERGERIE E., SAGOT B., NICOLAS L. &amp; GU&#201;NOT M.-L. (2009). FRMG : &#233;volutions
d&#8217;un analyseur syntaxique tag du fran&#231;ais. In Journ&#233;e ATALA &quot;Quels analyseurs syntaxiques pour le fran&#231;ais ?&quot;.
</p>
<p>ZELENKO D., AONE C. &amp; RICHARDELLA A. (2002). Kernel methods for relation extraction. In Proc. of the
Conference on Empirical Methods in Natural Language Processing (EMNLP-2002), p. 71&#8211;78.
</p>
<p>ZHANG M., SU J., WANG D., ZHOU G. &amp; TAN C. L. (2005). Discovering relations between named entities
from a large raw corpus using tree similarity-based clustering. In IJCNLP, p. 378&#8211;389.</p>

</div></div>
</body></html>