<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une analyse bas&#233;e sur la S-DRT pour la mod&#233;lisation de dialogues pathologiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211;1er juillet 2011
</p>
<p>Une analyse bas&#233;e sur la S-DRT pour la mod&#233;lisation de dialogues pathologiques
</p>
<p>Maxime Amblard 1,4 Michel Musiol2,4 Manuel Rebuschi3,4
(1) LORIA - UMR 7503
</p>
<p>(2) InterPSY - EA 4432 / MSH Lorraine USR 3261
(3) Archives Poincar&#233; - UMR 7117 / MSH Lorraine USR 3261
</p>
<p>(4) Universit&#233; Nancy 2 &#8211; 54000 Nancy
{maxime.amblard, michel.musiol, manuel.rebuschi}@univ-nancy2.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous pr&#233;sentons la d&#233;finition et l&#8217;&#233;tude d&#8217;un corpus de dialogues entre un schizophr&#232;ne et un inter-
locuteur ayant pour objectif la conduite et le maintien de l&#8217;&#233;change. Nous avons identifi&#233; des discontinuit&#233;s significatives chez les
schizophr&#232;nes parano&#239;des. Une repr&#233;sentation issue de la S-DRT (sa partie pragmatique) permet de rendre compte des ces usages
non standards.
</p>
<p>Abstract. In this article, we present a corpus of dialogues between a schizophrenic speaker and an interlocutor who drives
the dialogue. We had identified specific discontinuities for paranoid schizophrenics. We propose a modeling of these discontinuities
with S-DRT (its pragmatic part).
</p>
<p>Mots-cl&#233;s : S-DRT, interaction verbale, schizophr&#233;nie, dialogue pathologique, incoh&#233;rence pragmatique.
</p>
<p>Keywords: S-DRT, verbal interaction, schizophrenia, pathological dialogue, pragmatical incoherence .
</p>
<p>1 Contexte Scientifique
</p>
<p>La pathologie schizophr&#233;nique constitue aujourd&#8217;hui encore une entit&#233; clinique complexe et mal d&#233;finie. Elle suscite de nombreuses
controverses relativement aux caract&#233;ristiques symptomatologiques (ou regroupements syndromiques) susceptibles de la d&#233;finir. Il
est difficile de trouver des caract&#233;ristiques ou traits partag&#233;s par les individus pr&#233;sentant ce diagnostic et nous ne disposons d&#8217;aucun
signe pathognomonique clairement d&#233;fini dans la litt&#233;rature scientifique qui puisse la sp&#233;cifier. Ce constat th&#233;orique est relay&#233; par la
multiplicit&#233; des manifestations cliniques pr&#233;sent&#233;es. Quant &#224; la manifestation objective des sympt&#244;mes, il est encore impossible de
rapporter sans risque des traits de comportements manifestes et identifiables &#224; des caract&#233;ristiques syndromiques circonscrites.
</p>
<p>Nous estimons que les productions et manifestations comportementales de tout sujet, &quot;normal&quot; ou pathologique, sont n&#233;cessaire-
ment soumises &#224; l&#8217;&#233;preuve d&#8217;un cadre interactionnel et discursif, f&#251;t-il exp&#233;rimental ou clinique. Nous formulons l&#8217;hypoth&#232;se selon
laquelle le comportement verbal de tout (inter)-locuteur est susceptible de refl&#233;ter des sp&#233;cificit&#233;s syndromiques ; ce comportement
s&#8217;&#233;taye sur un ensemble de contraintes sociales et cognitives qui sont la condition de l&#8217;usage naturel de la langue. L&#8217;interaction
verbale est alors consid&#233;r&#233;e comme le &quot;lieu naturel d&#8217;expression des sympt&#244;mes&quot; (Trognon &amp; Musiol, 1996). Nous envisageons de
mettre au jour le plus objectivement possible, c&#8217;est-&#224;-dire de mani&#232;re &quot;d&#233;cisive&quot; 1, les discontinuit&#233;s apparaissant dans le discours et
le dialogue, discontinuit&#233;s dont on discutera ensuite la relation &#224; de possibles sp&#233;cificit&#233;s syndromiques. Ce programme de recherche
a aussi pour ambition de traiter de l&#8217;interpr&#233;tation de ces discontinuit&#233;s en termes d&#8217;incoh&#233;rences ou de dysfonctionnements. Sur le
plan m&#233;thodologique, nous nous proposons de sp&#233;cifier la notion d&#8217;incoh&#233;rence en types ou mod&#232;les de discontinuit&#233; de l&#8217;interaction
verbale. Et nous proposons plus globalement un programme d&#8217;analyse de l&#8217;interaction verbale d&#8217;inspiration pragmatique, cognitive
et formelle (Musiol &amp; Rebuschi, 2007; Rebuschi &amp; Musiol, 2010; Amblard et al., 2010) tel que le rep&#233;rage et la description de ces
sp&#233;cificit&#233;s (ou discontinuit&#233;s), quand il y en a, devrait am&#233;liorer &#224; moyen terme &#224; la fois les strat&#233;gies de diagnostic usuelles et les
tentatives de sp&#233;cification des troubles sur le plan des op&#233;rations cognitives et de pens&#233;e complexes. Les modalit&#233;s d&#8217;expression du
trouble sont appr&#233;hend&#233;es dans la structure intentionnelle du dialogue. Ainsi, &#224; condition de disposer d&#8217;une strat&#233;gie de mod&#233;lisa-
tion et de formalisation ad&#233;quate, cette structure intentionnelle du dialogue nous livre en filigrane les principales propri&#233;t&#233;s de la
rationalit&#233; du trouble dans sa modalit&#233; inf&#233;rentielle et computo-repr&#233;sentationnelle.
</p>
<p>1. Cf plus bas. Les s&#233;quences conversationnelles &#224; ruptures d&#233;cisives ne r&#233;sistent pas &#224; l&#8217;&#233;preuve du principe logique de non-contradiction. Les s&#233;quences
conversationnelles &#224; ruptures non d&#233;cisives pr&#233;sentent des caract&#233;ristiques incongrues ou des formes d&#8217;incoh&#233;rences &#233;tayant des infractions comportementales de
type &quot;normatives&quot;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le programme de recherche d&#8217;inspiration pragmatique, dialogique et cognitive dont on pr&#233;sente certains aspects a donc pour objectif :
</p>
<p>&#8211; d&#8217;une part, d&#8217;&#233;laborer une m&#233;thodologie pr&#233;cise de rep&#233;rage et d&#8217;analyse des troubles de la communication compte tenu des
caract&#233;ristiques de leur contexte naturel d&#8217;expression &#8211; &quot;l&#8217;interaction verbale&quot; &#8211; et compte tenu des variations de leur intensit&#233; ;
cette m&#233;thodologie initiale est dite pragmatico-dialogique.
</p>
<p>&#8211; d&#8217;autre part, d&#8217;enrichir la formalisation de mani&#232;re &#224; acc&#233;der &#224; une repr&#233;sentation th&#233;orique de ces troubles de la communication en
termes de &quot;troubles de la pens&#233;e&quot;, en tant que ces troubles de la pens&#233;e correspondent &#224; des faits psychologiques, en l&#8217;occurrence
des processus mentaux qui sp&#233;cifient le dysfonctionnement aux plans syntaxique, repr&#233;sentationnel et inf&#233;rentiel ; cette seconde
&#233;tape m&#233;thodologique est dite s&#233;mantico-formelle.
</p>
<p>Le cadre formel utilis&#233; est celui de la S-DRT (Asher &amp; Lascarides, 2003). Il s&#8217;agit de combiner deux niveaux d&#8217;analyse pour
pouvoir rendre compte des processus interpr&#233;tatifs &#224; l&#8217;&#339;uvre dans les conversations : l&#8217;analyse du contenu s&#233;mantique et l&#8217;analyse
pragmatique conversationnelle. La premi&#232;re est prise en charge par les Structures de repr&#233;sentation de discours segment&#233; (S-DRS)
inspir&#233;es des DRS de la DRT, qui sont une construction syntaxique mise &#224; jour au fil du flux conversationnel (Kamp &amp; Reyle, 1993).
La conversation suppose en outre des relations pragmatiques entre actes de langage des interlocuteurs, dont la complexit&#233; donne lieu &#224;
une structuration hi&#233;rarchique appr&#233;hend&#233;e d&#232;s les ann&#233;es 1980 en linguistique (Roulet et al., 1985). Nous proposons ici de formaliser
ces relations &#224; l&#8217;aide des relations rh&#233;toriques de la S-DRT. Une conversation est alors interpr&#233;t&#233;e par une double construction : celle
d&#8217;un arbre hi&#233;rarchique reliant les actes, et celle des DRS repr&#233;sentant le contenu s&#233;mantique des actes. L&#8217;hypoth&#232;se que nous faisons
est que l&#8217;interlocuteur schizophr&#232;ne ne se conforme pas toujours aux r&#232;gles devant pr&#233;valoir lors de cette double construction, ce qui
explique le ph&#233;nom&#232;ne de rupture conversationnelle per&#231;u par l&#8217;interlocuteur normal. Dans la suite de cette pr&#233;sentation, nous nous
focaliserons sur l&#8217;arbre hi&#233;rarchique, laissant hors de notre analyse la partie s&#233;mantique.
</p>
<p>2 Pr&#233;sentation du corpus
</p>
<p>Pour sous-tendre ce travail, nous avons travaill&#233; sur un corpus recueilli aupr&#232;s de schizophr&#232;nes. Nous revenons sur le protocole
de d&#233;finition de ce corpus. Un total de 30 participants est inclus dans cette recherche, 18 hommes et 12 femmes (&#226;ge : 41,5 &#177; 16).
Tous les sujets sont de langue maternelle fran&#231;aise. 22 participants pr&#233;sentent un diagnostic de schizophr&#233;nie (SCH), 14 hommes et 8
femmes (&#226;ge : 45,0&#177; 15.4). 8 participants ne pr&#233;sentent aucun diagnostic psychiatrique et ne prennent aucun traitement psychotrope ;
ils constituent notre groupe contr&#244;le (HC), il s&#8217;agit de 4 hommes et de 4 femmes (&#226;ge : 32,1 &#177; 14,3). Parmi les 22 schizophr&#232;nes, 15
d&#8217;entre eux prennent un traitement antipsychotique (SCH-A : moyenne en &#233;quivalent chlorpromazine en milligrammes par jour : 281
&#177; 118) et 7 ne prennent aucun traitement (SCH-S). La r&#233;partition en fonction des sous-types cliniques du DSM-IV 2 pour les patients
schizophr&#232;nes est la suivante : 14 schizophr&#232;nes de type parano&#239;de (SCH-P) (dont 5 ne prennent aucun traitement antipsychotique)
et 8 schizophr&#232;nes de type d&#233;sorganis&#233; (SCH-D) (dont 2 ne prennent aucun traitement antipsychotique). Les patients sont rencontr&#233;s
dans deux structures hospitali&#232;res distinctes (Centres Hospitaliers Sp&#233;cialis&#233;s de Troyes et de La Rochelle). Enfin, les 8 participants
de notre groupe contr&#244;le (HC) ont &#233;t&#233; rencontr&#233;s dans des lieux publics. Ils n&#8217;ont jamais pr&#233;sent&#233; de pathologie psychiatrique et
n&#8217;ont fait aucun usage de m&#233;dicaments psychotropes par le pass&#233;.
</p>
<p>Le contexte des conversations. Les 30 entretiens sont r&#233;alis&#233;s par un interlocuteur psychologue-chercheur confront&#233; soit &#224; un
interlocuteur diagnostiqu&#233; schizophr&#232;ne, soit &#224; un interlocuteur ne pr&#233;sentant pas de diagnostic psychiatrique. L&#8217;interaction est
autant que possible non dirig&#233;e, la th&#233;matique concerne globalement les occupations et/ou les pr&#233;occupations des interview&#233;s. Tous
les entretiens ont &#233;t&#233; retranscrits. L&#8217;analyse exhaustive de l&#8217;ensemble de notre corpus d&#8217;investigations empiriques nous a permis
d&#8217;extraire 403 s&#233;quences conversationnelles (ou transactions 3). La table 1 ci-dessous rend &#233;galement compte de cette r&#233;partition.
</p>
<p>Pour ce qui est des variables sociod&#233;mographiques, les comparaisons entre nos trois populations (SCH-P, SCH-D, HC) n&#8217;indiquent
aucune diff&#233;rence significative en ce qui concerne le nombre d&#8217;ann&#233;es d&#8217;&#233;tudes (Fcal = 1,813 ; p = 0,189), l&#8217;&#226;ge (Fcal = 2,060 ; p =
0,147) ou le sexe (&#967;2 corrig&#233; = 0,454 ; p = 0,80). Les facteurs &quot;&#226;ge&quot;, &quot;sexe&quot; et &quot;niveau d&#8217;&#233;ducation&quot; n&#8217;interf&#232;rent donc pas avec les
r&#233;sultats. La comparaison des deux populations de schizophr&#232;nes (SCH-P et SCH-D) quant aux traitements neuroleptiques auxquels
elles sont soumises (moyenne en &#233;quivalent chlorpromazine en milligrammes par jour) ne montre aucune diff&#233;rence significative
(Fcal = 0,113 ; p = 0,740). Chacune de ces deux populations comporte des patients trait&#233;s par neuroleptiques et des patients non
trait&#233;s. La comparaison entre les populations schizophr&#232;nes de type parano&#239;de avec traitement (SCH-P-A) et schizophr&#232;nes de type
d&#233;sorganis&#233; avec traitement (SCH-D-A), ne montre pas non plus de diff&#233;rence significative (Fcal = 0,588 ; p = 0,711) (Table 1). Le
facteur &quot;m&#233;dication&quot; n&#8217;interf&#232;re donc pas avec les r&#233;sultats.
</p>
<p>2. Manuel diagnostique et statistique des troubles mentaux, 4e &#233;dition, r&#233;f&#233;rence principale en psychologie et psychiatrie.
3. une transaction conversationnelle correspond &#224; un nombre variable de tours de parole qui d&#233;ploient une m&#234;me th&#233;matique</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>schiz. parano&#239;des schiz. d&#233;sorganis&#233;s groupe contr&#244;le
SCH-P (n=14) SCH-D (n=8) HC (n=8)
</p>
<p>(SCH-P-A / SCH-P-S) (SCH-D-A / SCH-D-S)
M&#177;DS M&#177;DS M&#177;DS
</p>
<p>Sexe (H-F) (10-4) (4-4) (4-4)
Age en ann&#233;es 45,6 &#177; 17,0 43,9 &#177; 13,4 32,1 &#177; 14,3
Education (nombre d&#8217;ann&#233;es 9,4 &#177; 1,7 7,3 &#177; 3,5 9,1 &#177; 1,4d&#8217;&#233;tudes &#224; compter du CP)
Equivalent Chlorpromazine 173 &#177; 164 200 &#177; 183 0en mg par jour (281 &#177; 107 / 0) (280 &#177; 148 / 0)
Nombre d&#8217;entretiens 14 8 8 30(9 / 5) (6 / 2)
Nombre de transactions 208 150 45 403conversationnelles (146 / 62) (108 / 42)
</p>
<p>n : nombre de sujets ; M : moyenne ; DS : d&#233;viation standard.
</p>
<p>TABLE 1 &#8211; Caract&#233;ristiques biographiques de la population &#233;tudi&#233;e et caract&#233;ristiques du corpus d&#8217;investigations empiriques.
</p>
<p>Ruptures. La r&#233;partition des s&#233;quences conversationnelles &quot;discontinues&quot; ou &quot;non discontinues&quot; varie selon la population &#224; laquelle
appartient l&#8217;interlocuteur. Les deux populations de schizophr&#232;nes produisent des ruptures pragmatiques et conversationnelles comme
le montre la table 2 contrairement aux sujets de contr&#244;le. Par ailleurs, les deux populations de schizophr&#232;nes (parano&#239;des vs d&#233;sor-
ganis&#233;s) ne sont pas significativement distinctes relativement &#224; la production de ruptures non d&#233;cisives. Lorsque les schizophr&#232;nes
ne sont soumis &#224; aucun traitement (SCH-S), on constate plus de discontinuit&#233;s non d&#233;cisives chez les schizophr&#232;nes d&#233;sorganis&#233;s
(SCH-D) que chez les schizophr&#232;nes parano&#239;des (SCH-P) (&#967;2 de croisement = 22,015, p &lt; 0,001). Par contre, lorsqu&#8217;ils sont sou-
mis &#224; un traitement antipsychotique (SCH-A), il y a plus de discontinuit&#233;s non d&#233;cisives chez les parano&#239;des (SCH-P) que chez les
d&#233;sorganis&#233;s (SCH-D) (&#967;2-deux de croisement = 13,141, p &lt; 0,001). (cf table 3)
</p>
<p>SCH-P SCH-D HC
p-values
</p>
<p>SCH SCH-P SCH-D SCH-P
vs HC vs HC vs HC vs SCH-D
</p>
<p>S&#233;quences non discontinues 128 (62%) 100 (67%) 44 (98%) &lt;.001 &lt;.001 &lt;.001 .319
S&#233;quences avec discontinuit&#233; 80 (38%) 50 (33%) 1 (2%)
</p>
<p>- S&#233;quences avec discontinuit&#233; non d&#233;cisive 71 (34%) 50 (33%) 1 (2%) &lt;.001 &lt;.001 &lt;.001 .649
- S&#233;quences avec discontinuit&#233;s d&#233;cisives 9 (4%) 0 0
</p>
<p>Total 208 150 45
</p>
<p>TABLE 2 &#8211; Pr&#233;sence ou non de discontinuit&#233;s en fonction de la population &#224; laquelle l&#8217;interlocuteur appartient.
</p>
<p>SCH-P SCH-D
</p>
<p>SCH-S
</p>
<p>S&#233;quences avec discontinuit&#233; non d&#233;cisive 12 (20%) 28 (67%)
S&#233;quences non discontinues (33%) 47 (80%) 14
Total 59 42
</p>
<p>SCH-A
</p>
<p>S&#233;quences avec discontinuit&#233; non d&#233;cisive 59 (42%) 22 (20%)
S&#233;quences non discontinues (80%) 81 (58%) 86
Total 140 108
</p>
<p>TABLE 3 &#8211; Pr&#233;sence de discontinuit&#233;s non d&#233;cisives en fonction de la forme clinique de l&#8217;interlocuteur-patient et de la m&#233;dication.
</p>
<p>R&#233;partition des s&#233;quences conversationnelles pr&#233;sentant ou non une discontinuit&#233; d&#233;cisive selon la population &#224; laquelle ap-
partient l&#8217;interlocuteur. Seul le sous-corpus des schizophr&#232;nes parano&#239;des (SCH-P) pr&#233;sente des s&#233;quences &#224; discontinuit&#233; d&#233;cisive.
Cette population se distingue donc significativement de la population des schizophr&#232;nes d&#233;sorganis&#233;s (SCH-D) (test binomial, p =
0,002) ou des sujets ne pr&#233;sentant aucun diagnostic psychiatrique &#8211; HC &#8211; (test binomial, p = 0,002). Parmi les neufs s&#233;quences &#224;
discontinuit&#233; d&#233;cisive mises au jour, trois sont issues du sous-corpus &quot;schizophr&#232;nes parano&#239;des sans traitement&quot; (SCH-P-S) et les
six autres sont issues du sous-corpus &quot;schizophr&#232;nes parano&#239;des avec traitement&quot; (SCH-P-A). Il est donc raisonnable de focaliser
l&#8217;&#233;tude sur les discontinuit&#233;s d&#233;cisives des schizophr&#232;nes parano&#239;des dans la suite de la formalisation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Le choix des extraits. L&#8217;analyse des transactions conversationnelles au sein desquelles on reconna&#238;t des ruptures non d&#233;cisives oblige
le plus souvent &#224; une interpr&#233;tation pragmatique faisant intervenir le contexte conversationnel ou situationnel d&#8217;une mani&#232;re telle
que le patient schizophr&#232;ne pourrait tr&#232;s bien n&#8217;&#234;tre consid&#233;r&#233; comme responsable du caract&#232;re incoh&#233;rent de l&#8217;interaction verbale
qu&#8217;en termes d&#8217;infraction &#224; la coop&#233;ration. Ces discontinuit&#233;s affectent des relations entre actes continus au niveau intra-intervention
ou bien des relations inter-interventions au sein d&#8217;&#233;changes confirmatifs. En l&#8217;&#233;tat actuel du d&#233;veloppement de notre mod&#232;le, deux
sortes de ruptures peuvent &#234;tre consid&#233;r&#233;es comme d&#233;cisives. La premi&#232;re progresse au fil de transactions conversationnelles qui
prennent la forme d&#8217;un &#233;change. La distribution des actions (actes de langage) et la progression argumentative s&#8217;accomplissent
de mani&#232;re sym&#233;trique. Nous avons qualifi&#233; ce type de discontinuit&#233; de d&#233;brayage conversationnel (Trognon &amp; Musiol, 1996).
Le second type de discontinuit&#233; d&#233;cisive affecte la rationalit&#233; de l&#8217;intervention complexe ; il s&#8217;agit d&#8217;un cas de d&#233;fectuosit&#233; de
l&#8217;initiative conversationnelle. Les s&#233;quences conversationnelles &#224; ruptures d&#233;cisives ne r&#233;sistent pas &#224; l&#8217;&#233;preuve du principe logique
de non-contradiction alors que les s&#233;quences conversationnelles &#224; ruptures non d&#233;cisives pr&#233;sentent des caract&#233;ristiques incongrues
ou des formes d&#8217;incoh&#233;rences &#233;tayant des infractions comportementales de type &quot;normatives&quot;. Les discontinuit&#233;s de type d&#233;cisives
affectent l&#8217;organisation et la progression du cours de transactions conversationnelles qui comptent toujours au moins trois tours
de parole et la plupart du temps beaucoup plus. Elles impliquent trois constituants &#224; chaque fois, c&#8217;est-&#224;-dire trois constituants de
rang &quot;intervention&quot; dans le cas du d&#233;brayage conversationnel ou trois constituants de rang &quot;acte&quot; dans le cas de la d&#233;fectuosit&#233; de
l&#8217;initiative conversationnelle (Musiol, 2009).
</p>
<p>3 Pr&#233;sentation du formalisme
</p>
<p>La formalisation des conversations est r&#233;duite aux &#233;l&#233;ments pertinents pour notre analyse, ce qui signifie que nous d&#233;laissons ce
qui ne para&#238;t pas devoir jouer de r&#244;le explicatif dans les ruptures. Ainsi la repr&#233;sentation du contenu s&#233;mantique est-elle r&#233;duite au
minimum, &#224; savoir le th&#232;me conversationnel. Cela est justifi&#233; par le fait que nombre de ruptures prennent corps autour d&#8217;expressions
sous-sp&#233;cifi&#233;es dont la valeur est param&#233;tr&#233;e, le plus souvent par le th&#232;me contextuel. Dans une repr&#233;sentation compl&#232;te, l&#8217;indice
th&#233;matique pourrait figurer parmi les marqueurs syntaxiques de l&#8217;univers de la S-DRS. Cet indice &#233;tant constant sur une succession
d&#8217;&#233;changes, nous pouvons regrouper les actes en classes selon le th&#232;me.
</p>
<p>Les relations sont de diff&#233;rents types. A c&#244;t&#233; des relations usuelles de la S-DRT (narration, &#233;laboration), les conversations &#233;tu-
di&#233;es nous ont conduits &#224; int&#233;grer des relations d&#8217;autres types incluant celles correspondant aux ajustements m&#233;ta-conversationnels.
Comme dans la S-DRT, les relations sont coordonnantes (comme la narration, la r&#233;ponse &#224; une question, etc.) ou subordonnantes
(comme l&#8217;explication, la requ&#234;te de clarification, etc.). Nous r&#233;capitulons les types de relation utilis&#233;s dans le tableau suivant :
</p>
<p>Subordonnantes Coordonnantes
</p>
<p>Conversationnelles
Question R&#233;ponse
Elaboration Narration
Contre-&#233;laboration
</p>
<p>M&#233;ta-conversationnelles
Requ&#234;te de clarification Clarification
Conduite C-R&#233;ponse
Phatique
</p>
<p>Pour l&#8217;analyse des conversations pathologiques, nous proposons syst&#233;matiquement la construction simultan&#233;e de deux repr&#233;senta-
tions, une par interlocuteur. Du c&#244;t&#233; du sujet schizophr&#232;ne, nous faisons un postulat de rationalit&#233; analogue au principe de charit&#233;
(Quine, 1960) ce qui signifie que la repr&#233;sentation est d&#233;pourvue de contradictions au niveau s&#233;mantique ; s&#8217;il y a ruptures, elles
interviennent donc au niveau pragmatique, par l&#8217;infraction de r&#232;gles de construction des arbres de la S-DRT. La situation n&#8217;est pas
la m&#234;me en face. Dans les conversations qui constituent les corpus &#233;tudi&#233;s, l&#8217;interlocuteur normal est un psychologue en charge de
poursuivre l&#8217;entretien : il fait ainsi en sorte de &quot;r&#233;parer&quot; la structure conversationnelle apr&#232;s une rupture, m&#234;me si cette derni&#232;re est
telle qu&#8217;elle aurait provoqu&#233; l&#8217;interruption d&#8217;une conversation analogue dans une autre situation. On a alors un postulat correspon-
dant &#224; cette prescription, &#224; savoir la construction d&#8217;une repr&#233;sentation respectant les contraintes pragmatiques ; cette option entra&#238;ne
l&#8217;apparition d&#8217;inconsistances au niveau s&#233;mantique. La dualit&#233; des repr&#233;sentations conversationnelles exprime une dualit&#233; de points
de vue sur la conversation : le sujet schizophr&#232;ne est apparemment contradictoire &#224; l&#8217;&#233;preuve du comportement dialogique du sujet
normal, si bien que la conversation fonctionne mais que la repr&#233;sentation du monde co-construite est inconsistante ; &#224; l&#8217;inverse, le
dysfonctionnement du sujet schizophr&#232;ne r&#233;sidant dans sa gestion des relations pragmatiques, la repr&#233;sentation du monde construite
par la conversation ne souffre pas de ce d&#233;faut.
</p>
<p>Le traitement des extraits du corpus sont des dialogues dont l&#8217;un des participants n&#8217;a d&#8217;autres intentions que de continuer l&#8217;&#233;change.
Nous consid&#233;rons donc ces &#233;changes comme un discours, port&#233; par le schizophr&#232;ne. Les interventions de l&#8217;interlocuteur non-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>schizophr&#232;ne sont alors souvent des relances ou des phatiques, d&#8217;o&#249; l&#8217;arborescence particuli&#232;re des repr&#233;sentations. Nous nous
attachons &#224; suivre les structures usuelles de la S-DRT. Cependant, comme nous nous attachons uniquement &#224; la structure pragma-
tique de la repr&#233;sentation, nous &#233;vacuons toutes repr&#233;sentations s&#233;mantiques. Seule la notion de th&#232;me est conserv&#233;e. Pour marquer
la coh&#233;rence th&#233;matique dans l&#8217;&#233;change, nous incluons les items dans une bo&#238;te en pointill&#233;s.
</p>
<p>Nous assumons que les &#233;changes sont des extraits d&#8217;&#233;changes plus larges, dont le point de d&#233;part est un noeud particulier &#224; s&#233;mantique
vide. Ainsi, quel que soit le traitement choisi, il est toujours possible de rattacher un &#233;l&#233;ment, au pire &#224; cette racine. L&#8217;analyse des
extraits nous conduit &#224; mettre en avant deux transgressions de l&#8217;usage standard de la S-DRT : d&#8217;une part des ruptures de la fronti&#232;re
droite (rattachement &#224; l&#8217;int&#233;rieur de la structure alors que la S-DRT suppose qu&#8217;ils se font sur la fronti&#232;re droite) et d&#8217;autre part, des
mont&#233;es au travers de la structure sans cl&#244;ture basse acceptable (inconsistance de la repr&#233;sentation). Il est en effet fr&#233;quent dans le
corpus d&#8217;identifier des items qui servent &#224; clore une partie de l&#8217;&#233;change et &#224; ouvrir un nouveau th&#232;me.
</p>
<p>De mani&#232;re globale, sur le corpus, nous avons identifi&#233; trois ruptures de la fronti&#232;re droite et cinq mont&#233;es sans compl&#233;tude de la sous-
structure. Nous pr&#233;sentons l&#8217;analyse de deux exemples pr&#233;sentant les deux types de discontinuit&#233;s. Dans le premier, le schizophr&#232;ne
change deux fois de th&#232;me passant d&#8217;une interpr&#233;tation de la mort symbolique dans le cadre de la politique, et la mort usuelle. Il est
clair que ces deux interpr&#233;tations de la mort sont directement reli&#233;es, mais elles expriment deux r&#233;alit&#233;s diff&#233;rentes.
</p>
<p>B124 : Oh ouais (&#8593;) et pis compliqu&#233; (&#8595;) et c&#8217;est vrai-
ment tr&#232;s tr&#232;s compliqu&#233; (&#8594;) la politique c&#8217;est
quelque chose quand on s&#8217;en occupe faut &#234;tre ga-
gnant parce qu&#8217;autrement quand on est perdant
c&#8217;est fini quoi (&#8595;)
</p>
<p>A125 : oui
B126 : J. C. D. est mort, L. est mort, P. est mort euh
</p>
<p>(...)
A127 : Ils sont morts parce qu&#8217;ils ont perdu &#224; votre
</p>
<p>avis (&#8593;)
B128 : Non ils gagnaient mais si ils sont morts, c&#8217;est
</p>
<p>la maladie quoi c&#8217;est c&#8217;est (&#8594;)
A129 : Ouais c&#8217;est parce qu&#8217;ils &#233;taient malades, c&#8217;est
</p>
<p>pas parce qu&#8217;ils faisaient de la politique (&#8593;)
B130 : Si enfin (&#8594;)
A131 : Si vous pensez que c&#8217;est parce qu&#8217;ils faisaient
</p>
<p>de la politique (&#8593;)
B132 : Oui tiens oui il y a aussi C. qui a accompli un
</p>
<p>meurtre l&#224; (&#8594;) il &#233;tait pr&#233;sent lui aussi qui est &#224; B.
mais enfin (&#8594;) c&#8217;est encore &#224; cause de la politique
&#231;a
</p>
<p>G82 : (...) l&#8217;an dernier euh (&#8594;) j&#8217;savais pas comment
faire j&#8217;&#233;tais perdue et pourtant j&#8217;avais pris mes
m&#233;dicaments j&#8217;suis dans un &#233;tat vous voyez m&#234;me
ma bouche elle est s&#232;che j&#8217;suis dans un triste &#233;tat
</p>
<p>V83 : Vous &#234;tes quand m&#234;me bien (&#8593;)
G84 : J&#8217;pense que ma t&#234;te est bien mais on croirait &#224;
</p>
<p>moiti&#233; (&#8595;) la moiti&#233; qui va et la moiti&#233; qui va pas
j&#8217;ai l&#8217;impression de &#231;a vous voyez (&#8593;)
</p>
<p>V85 : D&#8217;accord
G86 : Ou alors c&#8217;est la conscience peut &#234;tre la
</p>
<p>conscience est ce que c&#8217;est &#231;a (&#8593;)
V87 : Vous savez &#231;a arrive &#224; tout le monde d&#8217;avoir des
</p>
<p>moments biens et des moments o&#249; on est perdu
G88 : Oui j&#8217;ai peur de perdre tout le monde
V89 : Mais ils vont plut&#244;t bien vos enfants (&#8593;)
G90 : Ils ont l&#8217;air ils ont l&#8217;air mais ils ont des allergies
</p>
<p>ils ont (&#8594;) mon petit fils il s&#8217;est cass&#233; le bras &#224;
l&#8217;&#233;cole tout &#231;a
</p>
<p>V91 : C&#8217;est des petits incidents de la vie quotidienne
vous savez (&#8593;)
</p>
<p>G92 : Oui oui
</p>
<p>FIGURE 1 &#8211; Deux extraits du corpus.
</p>
<p>La repr&#233;sentation de cet extrait est donn&#233;e dans la figure 2. L&#8217;intervention B126 ouvre une nouvelle bo&#238;te th&#233;matique passant de
la mort symbolique &#224; la mort r&#233;elle sans poser de probl&#232;me, la premi&#232;re partie de la d&#233;rivation ayant &#233;t&#233; correctement close. La
d&#233;rivation se poursuit jusqu&#8217;&#224; l&#8217;intervention B130 qui est ambigu&#235; et dont le contenu s&#233;mantique est faible. Quel que soit le choix
fait, pour le rattachement, l&#8217;intervention B132 r&#233;sout l&#8217;ambigu&#239;t&#233;. Et c&#8217;est l&#224; que se pose un premier probl&#232;me. La contrainte de
la fronti&#232;re droite sur cette structure ne permet pas le rattachement de B130 sur A125, pourtant, c&#8217;est en ce point que B130 doit
th&#233;matiquement &#234;tre rattach&#233;e. Nous avons une premi&#232;re discontinuit&#233;. Un probl&#232;me similaire se pose sur l&#8217;intervention B3132 qui
cette fois doit arbitrairement &#234;tre rattach&#233;e sur la seconde bo&#238;te th&#233;matique, ce qui n&#8217;est pas possible.
</p>
<p>Dans le second arbre de la figure 2, la patient utilise l&#8217;ambigu&#239;t&#233; sur l&#8217;interpr&#233;tation de la perte. Le psychologue donne un exemple
de mont&#233;e au travers de la structure en V87, ouvrant une nouvelle partie de l&#8217;&#233;change. L&#8217;intervention en G88, la r&#233;ponse du patient,
est alors une mont&#233;e dans la d&#233;rivation, mais sans fermeture de la sous-d&#233;rivation. C&#8217;est le second type de probl&#232;me identifi&#233; dans
ces &#233;changes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B1124
</p>
<p>B2124 A125phatic
A127 B1128
</p>
<p>B126
</p>
<p>B2128
</p>
<p>A129 B130
</p>
<p>question.Meta
</p>
<p>ans
</p>
<p>B130
</p>
<p>A131 B1132
</p>
<p>question.Meta
</p>
<p>answer
</p>
<p>B2132
</p>
<p>B3132
</p>
<p>el
quest
</p>
<p>ans
</p>
<p>G182
</p>
<p>G282
</p>
<p>G382
</p>
<p>G482
</p>
<p>V83 G184
</p>
<p>G284
</p>
<p>V85
</p>
<p>G186
</p>
<p>G286
</p>
<p>V87
</p>
<p>G290
</p>
<p>G88
</p>
<p>V89 G190
</p>
<p>V87
</p>
<p>el
</p>
<p>narr
</p>
<p>el
</p>
<p>question
</p>
<p>rep
</p>
<p>el
</p>
<p>phatic
quest
</p>
<p>eval
</p>
<p>drive
</p>
<p>ans
</p>
<p>el
</p>
<p>FIGURE 2 &#8211; Repr&#233;sentations sous forme d&#8217;arbre de S-DRS des deux discours.
</p>
<p>4 Discussion
</p>
<p>Nous avons discut&#233; plus haut de la n&#233;cessit&#233; de construire deux repr&#233;sentations conversationnelles, une pour le sujet schizophr&#232;ne,
l&#8217;autre pour le sujet normal. La dualit&#233; des repr&#233;sentations conversationnelles se traduit par une dualit&#233; des repr&#233;sentations s&#233;man-
tiques (ou repr&#233;sentations du monde construite dans la conversation) : contradictoire chez le sujet normal, elle est en revanche
parfaitement consistante pour le sujet schizophr&#232;ne.
</p>
<p>Il y a donc du jeu dans la localisation de l&#8217;inconsistance chez les sujets schizophr&#232;nes. Nous aurions pu choisir de calquer la
repr&#233;sentation conversationnelle du schizophr&#232;ne sur celle du sujet normal. Cela aurait cependant produit une continuit&#233; entre les
deux interlocuteurs, l&#224; o&#249; nous pensons qu&#8217;il n&#8217;y en a pas : ce qui se manifeste pour le sujet normal, qui rel&#232;ve de la pathologie du
schizophr&#232;ne, a toutes les chances de se manifester diff&#233;remment pour ce dernier. Nous avons donc fait le choix de postuler que le
sujet schizophr&#232;ne est rationnel au sens le plus commun du terme, est qu&#8217;il se conforme aux normes de la logique tout autant que
le sujet normal : il n&#8217;y a pas plus de contradictions dans la repr&#233;sentation du monde d&#8217;un schizophr&#232;ne que dans celle d&#8217;un sujet
normal &#8211; m&#234;me si du point de vue de ce dernier, il y a des contradictions (ce qui rejoint certains traits symptomatiques habituels
de la pathologie). L&#8217;inconsistance est localis&#233;e dans la hi&#233;rarchie pragmatique, qui rel&#232;ve de l&#8217;interaction entre les deux sujets en
conversation. Fondamentalement c&#8217;est un d&#233;ficit interactionnel, plut&#244;t qu&#8217;un dysfonctionnement rationnel, qui est ici en jeu.
</p>
<p>La suite de ce projet de recherche est d&#8217;augmenter le nombre d&#8217;&#233;changes dans le corpus. Actuellement, les &#233;changes sont en cours
de recueillement et de transcription. Ces nouveaux &#233;l&#233;ments permettront de valider l&#8217;hypoth&#232;se de d&#233;part quant &#224; l&#8217;utilisation non
usuelle de la pragmatique du discours du groupe de schizophr&#232;nes parano&#239;des. Enfin, la validation de ces travaux exp&#233;rimentaux
valide r&#233;ciproquement l&#8217;ad&#233;quation des structures produites par la S-DRT aux mod&#232;les mis en oeuvre dans les &#233;changes standards.
</p>
<p>R&#233;f&#233;rences
AMBLARD M., MUSIOL M. &amp; REBUSCHI M. (2010). An S-DRT based analysis of pathological dialogues. pr&#233;sentation CAuLD.
ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation. Cambridge University Press.
KAMP H. &amp; REYLE U. (1993). From Discourse to Logic. Kluwer Academic Publishers.
MUSIOL M. (2009). Incoh&#233;rences et formes psychopathologiques dans l&#8217;interaction verbale schizophr&#233;nique. Psychose, langage
et action, p. 219&#8211;238.
MUSIOL M. &amp; REBUSCHI M. (2007). La rationalit&#233; de l&#8217;incoh&#233;rence en conversation schizophr&#232;ne. Psychologie fran&#231;aise, 52(2).
QUINE W. V. O. (1960). Word and Object. Cambridge, Mass, MIT Press.
REBUSCHI M. &amp; MUSIOL M. (2010). Underspecification and pathological conversation : a S-DRT based formalization. In
Journ&#233;es de S&#233;mantique Formelle : Nancy-Universit&#233; LORIA-CNRS.
ROULET E., AUCHLIN A., MOESCHLER J., RUBATTEL C. &amp; SCHELLING M. (1985). L&#8217;articulation du discours en fran&#231;ais
contemporain. Peter Lang, Berne.
TROGNON A. &amp; MUSIOL M. (1996). L&#8217;accomplissement interactionnel du trouble schizopr&#233;nique. Raisons Pratiques, 7(N &#9702;
sp&#233;cial &quot;la folie dans la place&quot; (I. Joseph &amp; J. Proust (Eds), Editions de l&#8217;Ecole des Hautes Etudes en Sciences Sociales)), 179&#8211;209.</p>

</div></div>
</body></html>