<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un lexique pond&#233;r&#233; des noms d&#8217;&#233;v&#233;nements en fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Un lexique pond&#233;r&#233; des noms d&#8217;&#233;v&#233;nements en fran&#231;ais
</p>
<p>B&#233;atrice Arnulphy1, 2 Xavier Tannier1, 2 Anne Vilnat1, 2
</p>
<p>(1) Univ. Paris-Sud 11, 91405 Orsay
(2) LIMSI-CNRS, 91403 Orsay
</p>
<p>prenom.nom@limsi.fr
</p>
<p>R&#233;sum&#233;. Cet article d&#233;crit une &#233;tude sur l&#8217;annotation automatique des noms d&#8217;&#233;v&#233;nements dans les textes en
fran&#231;ais. Plusieurs lexiques existants sont utilis&#233;s, ainsi que des r&#232;gles syntaxiques d&#8217;extraction, et un lexique com-
pos&#233; de fa&#231;on automatique, permettant de fournir une valeur sur le niveau d&#8217;ambigu&#239;t&#233; du mot en tant qu&#8217;&#233;v&#233;ne-
ment. Cette nouvelle information permettrait d&#8217;aider &#224; la d&#233;sambigu&#239;sation des noms d&#8217;&#233;v&#233;nements en contexte1.
</p>
<p>Abstract. This article describes a study on automatic extraction of event nominals in French texts. Some
existing lexicons are used, as well as some syntactic extraction rules, and a new, automatically built lexicon is
presented. This lexicon gives a value concerning the level of ambiguity of each word as an event.
</p>
<p>Mots-cl&#233;s : extraction d&#8217;information, &#233;v&#233;nements nominaux, lexiques.
</p>
<p>Keywords: information extraction, nominal events, lexicons.
</p>
<p>1 Introduction
</p>
<p>La plupart des &#233;v&#233;nements dans la langue est exprim&#233;e par les verbes et les noms. La forme verbale a &#233;t&#233; lar-
gement trait&#233;e, dans une approche formelle notamment par Vendler (1967) ou encore en traitement automatique
des langues par le biais de TimeML (Pustejovsky et al., 2005). Si les &#233;v&#233;nements verbaux sont plus nombreux,
plus simples &#224; identifier et &#224; lier aux autres informations temporelles, ils expriment souvent des &#233;v&#233;nements plus
communs et moins pertinents, tandis que la nominalisation d&#8217;un &#233;v&#233;nement indique souvent son importance.
</p>
<p>Les &#233;v&#233;nements nominaux peuvent &#234;tre construits de trois mani&#232;res diff&#233;rentes. Certains sont construits &#224; partir
de noms d&#233;verbaux (la f&#234;te de la musique ou l&#8217;adoption d&#8217;une r&#233;glementation), sachant qu&#8217;ils peuvent d&#233;signer
l&#8217;&#233;v&#233;nement ou le r&#233;sultat de l&#8217;action indiqu&#233;e par le verbe dont il est issu (construction). D&#8217;autres sont form&#233;s &#224;
partir de noms autres que d&#233;verbaux et qui d&#233;crivent intrins&#232;quement des &#233;v&#233;nements (le festival de Cannes ou le
match PSG-OM), ces mots pouvant &#234;tre ambigus (le salon du livre). Enfin, des syntagmes nominaux (SN) sans
valeur &#233;v&#233;nementielle peuvent par le r&#233;sultat d&#8217;une m&#233;tonymie, en contexte, r&#233;f&#233;rer &#224; l&#8217;&#233;v&#233;nement li&#233; par exemple
&#224; un lieu (Tchernobyl), une date (le 11 septembre) ou l&#8217;objet d&#8217;une affaire (les fr&#233;gates de Ta&#239;wan). Au vu de
ces trois types d&#8217;&#233;v&#233;nements, on se rend compte que le recours au lexique est n&#233;cessaire, mais pas suffisant ; une
d&#233;sambigu&#239;sation par le contexte est indispensable.
</p>
<p>L&#8217;&#233;v&#233;nement est ce qui survient, le changement d&#8217;&#233;tat op&#233;r&#233;. Il peut &#234;tre r&#233;current ou unique, pr&#233;vu ou non, durer
ou &#234;tre instantan&#233;, se produire dans le pass&#233;, le pr&#233;sent ou le futur. Nous pr&#233;sentons une &#233;tude pr&#233;alable d&#233;taill&#233;e
des noms qui les caract&#233;risent, par l&#8217;utilisation d&#8217;un corpus manuellement annot&#233;. Apr&#232;s un bref &#233;tat de l&#8217;art
du domaine (section 2), nous pr&#233;senterons les ressources dont nous disposons (section 3) et l&#8217;&#233;tude en vue de
l&#8217;extraction des noms d&#8217;&#233;v&#233;nements (section 4).
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Quelques d&#233;finitions des &#233;v&#233;nements ont &#233;t&#233; propos&#233;es en philosophie, histoire, linguistique ou encore journa-
lisme. Ces deux derni&#232;res disciplines nous int&#233;ressent tout particuli&#232;rement, parce que nous travaillons sur des
</p>
<p>1Ce travail a &#233;t&#233; partiellement financ&#233; par OSEO dans le cadre du programme Quaero.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#201;ATRICE ARNULPHY, XAVIER TANNIER ET ANNE VILNAT
</p>
<p>corpus d&#8217;articles et que les m&#233;dias sont des inventeurs prolifiques de noms d&#8217;&#233;v&#233;nements. Dans les ann&#233;es 70, &#224; la
suite de la th&#233;orie de Davidson concernant l&#8217;&#233;v&#233;nement mental2, ces travaux se focalisent sur &#171; ce qui fait l&#8217;&#233;v&#233;-
nement &#187; et comment les m&#233;dias le cr&#233;ent. Neveu &amp; Qu&#233;r&#233; (1996) pr&#233;sentent l&#8217;&#233;v&#233;nement comme une simple
occurrence, non planifi&#233;e, qui ne se r&#233;p&#232;te pas et qui se produit &#171; dans un pass&#233; plus ou moins proche &#187;. Rien n&#8217;y
est dit au sujet des noms donn&#233;s &#224; ces &#233;v&#233;nements. En linguistique, par contre, quelques recherches ont essay&#233;
de traiter le probl&#232;me des &#233;v&#233;nements du point de vue des noms qu&#8217;on leur donne. Velde (2006) introduit par le
parall&#232;le entre les noms propres et la &#171; triade je-ici-maintenant &#187;, la notion de nom propre de temps. De plus, les
noms de lieux et les dates peuvent par le biais de la m&#233;tonymie d&#233;signer des &#233;v&#233;nements. C&#8217;est le cas pour le
toponyme Tchernobyl (Lecolle, 2004) ou encore l&#8217;h&#233;m&#233;ronyme 11 septembre (Calabrese, 2008).
</p>
<p>En TAL, la d&#233;finition des &#233;v&#233;nements semble fortement d&#233;pendante de l&#8217;application &#224; laquelle elle est d&#233;di&#233;e.
TimeML (Pustejovsky et al., 2003) est un formalisme d&#8217;annotation des &#233;v&#233;nements principalement d&#233;di&#233; aux
&#233;v&#233;nements verbaux. &#171; &#201;v&#233;nement &#187; est un &#171; terme g&#233;n&#233;rique pour d&#233;signer les situations qui se produisent &#187;.
Dans nos travaux et par opposition &#224; TimeML, nous n&#8217;acceptons pas les &#233;tats et nous focalisons notre attention
essentiellement sur les nominalisations. Par ailleurs, des campagnes d&#8217;&#233;valuation ont int&#233;gr&#233; les &#233;v&#233;nements.
Automatic Content Evalution, ACE (Doddington et al., 2004) a pr&#233;sent&#233; un projet d&#8217;extraction, d&#233;taill&#233; et pr&#233;cis,de
cat&#233;gories d&#8217;&#233;v&#233;nements particuliers, li&#233;s &#224; la vocation militaire du projet. Dans ESTER (Gravier et al., 2004), on
distingue les &#233;v&#233;nements &#171; historiques et uniques &#187; et les &#171; r&#233;p&#233;titifs &#187;, m&#234;me si l&#8217;annotation des &#233;v&#233;nements fut
annul&#233;e. Plus r&#233;cemment, en 2010, SemEval-23 s&#8217;est interess&#233; aux &#233;v&#233;nements.
</p>
<p>L&#8217;extraction automatique des noms d&#8217;&#233;v&#233;nement en fran&#231;ais n&#8217;est pas encore &#233;tudi&#233;e. Pour d&#8217;autres langues,
quelques recherches ont &#233;t&#233; vou&#233;es &#224; cette th&#233;matique : Russo et al. (2011) s&#8217;est focalis&#233;e sur les moyens de
rep&#233;rer la lecture &#233;v&#233;nementielle des noms d&#233;verbaux en italien et Creswell et al. (2006) se sont focalis&#233;s sur la
d&#233;sambiguisation des noms &#233;v&#233;nementiels dans la version anglophone de WordNet. Dans la suite de ces travaux
sur l&#8217;italien et l&#8217;anglais, nous proposons une &#233;tude pour l&#8217;extraction automatique des &#233;v&#233;nements nominaux en
fran&#231;ais en nous aidant de ressources existantes et de celles &#233;labor&#233;es pour les besoins de la t&#226;che.
</p>
<p>3 Description des ressources utilis&#233;es
</p>
<p>3.1 Les corpus
</p>
<p>Pour cette &#233;tude, deux corpus annot&#233;s ont &#233;t&#233; utilis&#233;s. Le premier, le FR-TimeBank, a &#233;t&#233; r&#233;alis&#233; par Bittar (2010)
dans le cadre de sa th&#232;se, l&#8217;autre a &#233;t&#233; annot&#233; par deux des auteurs m&#234;me.
</p>
<p>Le corpus FR-TimeBank est un ensemble de 109 articles du journal L&#8217;Est R&#233;publicain (ER), annot&#233; selon le for-
malisme TimeML. Comme not&#233; pr&#233;c&#233;demment, le formalisme d&#8217;annotation TimeML ne s&#8217;arr&#234;te pas uniquement
aux &#233;v&#233;nements nominaux, mais ce corpus en compte tout de m&#234;me 663.
</p>
<p>Notre corpus manuellement annot&#233; en &#233;v&#233;nements nominaux Nous avons annot&#233; manuellement 192 articles
de presse des journaux Le Monde (LM &#8211; 83 articles) et L&#8217;Est R&#233;publicain (ER &#8211; les 109 articles utilis&#233;s dans le
FR-TimeBank). Ce corpus repr&#233;sente 1844 noms d&#8217;&#233;v&#233;nements4. Les annotations ont &#233;t&#233; conduites en fonction
d&#8217;un guide d&#8217;annotation &#233;labor&#233; par nos soins. Ce document, qui n&#8217;est pas pr&#233;sent&#233; ici, propose une typologie des
&#233;v&#233;nements ainsi que des instructions pour d&#233;cider de l&#8217;&#233;v&#233;nementialit&#233; d&#8217;un nom ou pas. Le but de ce corpus
est d&#8217;annoter les SN utilis&#233;s pour nommer les &#233;v&#233;nements. Pourtant dans le cadre de cette &#233;tude, nous ne nous
concentrerons que sur les t&#234;tes de SN. En ce qui concerne les annotations de celles-ci, les deux annotateurs experts
ont un bon accord (kappa = 0,808), sachant qu&#8217;environ 75 % du corpus a &#233;t&#233; annot&#233; par les deux annotateurs.
</p>
<p>Afin de comparer l&#8217;annotation Bittar et la n&#244;tre, une sous-partie de notre corpus est le corpus FR-TimeBank.
L&#8217;accord inter-annotateur calcul&#233; entre les deux annotations est bon : 0,704 (kappa). 79.8 % des t&#234;tes de SN
d&#8217;&#233;v&#233;nements sont &#233;tiquet&#233;es en commun dans nos deux corpus.
</p>
<p>Enfin, &#224; des fins d&#8217;exp&#233;rimentation que nous d&#233;taillerons plus tard, nous avons eu recours &#224; un corpus non-annot&#233;
compos&#233; de 60 112 articles de presse du Monde de l&#8217;ann&#233;e 2002, ne comptant aucun article du corpus annot&#233;.
</p>
<p>2Mental Events (1970), republi&#233; dans (Davidson, 1980)
3http://semeval2.fbk.eu/
4&#192; titre de comparaison, le corpus italien IT-TimeBank (Russo et al., 2011) compte 3695 &#233;v&#233;nements, le FR-TimeBank 663 et le corpus
</p>
<p>(Creswell et al., 2006) 1579.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN LEXIQUE POND&#201;R&#201; DES NOMS D&#8217;&#201;V&#201;NEMENTS
</p>
<p>3.2 Les lexiques
</p>
<p>Deux lexiques ont &#233;t&#233; utilis&#233;s lors de nos exp&#233;rimentations, il s&#8217;agit du VerbAction (Tanguy &amp; Hathout, 2002) et
du lexique alternatif des noms &#233;v&#233;nementiels de Bittar (Bittar, 2010).
</p>
<p>Le lexique VerbAction est constitu&#233; d&#8217;une liste de verbes d&#8217;action accompagn&#233;e des noms d&#233;verbaux morpho-
logiquement apparent&#233;s &#224; ceux-ci (9 393 couples verbe-nom, soit 9 200 lemmes nominaux uniques). Les verbes
d&#8217;action impliquant que quelque chose se produise (f&#234;ter), les noms d&#233;verbaux de ces verbes devraient donc d&#233;-
crire une action (f&#234;te) et donc potentiellement nommer l&#8217;&#233;v&#233;nement qui a lieu lorsque cette action se produit (la
f&#234;te de la musique). Par ailleurs, ces mots peuvent donc &#234;tre ambigus, principalement parce qu&#8217;ils servent aussi &#224;
r&#233;f&#233;rer au r&#233;sultat des actions d&#233;sign&#233;es par ces verbes (a&#233;ration, &#233;talage).
</p>
<p>Le lexique alternatif des noms &#233;v&#233;nementiels 5 se pr&#233;sente comme compl&#233;mentaire au VerbAction dans la re-
cherche de noms d&#8217;&#233;v&#233;nements. Il contient 804 noms qui ne sont pas des d&#233;verbaux, comme anniversaire ou
gr&#232;ve. Ces mots ont au moins une lecture &#233;v&#233;nementielle dans le corpus &#233;tudi&#233; par leur auteur. Comme les d&#233;ver-
baux, certains mots sont ambigus : ils peuvent d&#233;signer l&#8217;&#233;v&#233;nement / le proc&#232;s aussi bien que le r&#233;sultat ou l&#8217;objet
de celui-ci, c&#8217;est le cas de ap&#233;ro et feu. De plus, certains de ces noms pr&#233;sentent un &#233;tat (absence), or les &#233;tats ne
font pas partie de notre d&#233;finition de l&#8217;&#233;v&#233;nement en tant que tel, nous envisageons l&#8217;&#233;v&#233;nement sous le biais du
changement d&#8217;&#233;tat. Enfin, de nombreux noms appartiennent &#224; des registres de langue sp&#233;cifiques (anticoaguloth&#233;-
rapie). Ce lexique a &#233;t&#233; utilis&#233; comme indice pour l&#8217;annotation en TimeML du corpus FR-TimeBank.
</p>
<p>3.3 Les r&#232;gles d&#8217;extraction
</p>
<p>La possibilit&#233; d&#8217;utiliser des verbes d&#8217;&#233;v&#233;nements et de cause/cons&#233;quence pour l&#8217;extraction des noms d&#8217;&#233;v&#233;ne-
ments a &#233;t&#233; &#233;tudi&#233;e par (Arnulphy et al., 2010). Des verbes qui d&#233;clenchent des &#233;v&#233;nements (en position sujet ou
argument) ont &#233;t&#233; collect&#233;s. Nous reprenons les 15 verbes ayant une utilisation &#233;v&#233;nementielle &#224; plus de 90 %
(VB90), en utilisant une approche syntaxique, contrairement &#224; l&#8217;&#233;tude cit&#233;e. Ces verbes sont : avoir lieu, se pro-
duire, s&#8217;expliquer par, avoir pour origine, &#234;tre entra&#238;ner (en position sujet), et organiser, d&#233;clencher, conduire &#224;,
assister &#224;, donner lieu &#224;, inciter &#224;, occasionner, se pr&#233;cipiter &#224;, tirer les cons&#233;quences de, tirer les le&#231;ons de (en
position d&#8217;argument).
</p>
<p>De plus, les &#233;v&#233;nements sont ancr&#233;s dans le temps et les noms donn&#233;s &#224; ces &#233;v&#233;nements peuvent &#234;tre utilis&#233;s
comme des entit&#233;s temporelles et &#234;tre par cons&#233;quent introduits par des indicateurs temporels. C&#8217;est pourquoi
nous nous sommes int&#233;ress&#233;s &#224; certains introducteurs temporels pour extraire des noms qui ne sont pas des dates
et qui sont susceptibles d&#8217;indiquer des noms d&#8217;&#233;v&#233;nements. Trois types de pr&#233;positions ont &#233;t&#233; utilis&#233;s. Elles in-
diquent le fait qu&#8217;un &#233;v&#233;nement se produise : &#224; l&#8217;occasion de, lors de (&#192; J&#233;rusalem, lors de la r&#233;union du gouver-
nement isra&#233;lien) ; l&#8217;usage r&#233;f&#233;rentiel de l&#8217;&#233;v&#233;nement : pendant, apr&#232;s, la veille de, le lendemain de (La population
a &#233;t&#233; &#233;vacu&#233;e avant l&#8217;arriv&#233;e de la lave.) ; encore un moment de l&#8217;&#233;v&#233;nement : &#224; l&#8217;issue de, au commencement de
(les activistes qu&#8217;ils ont lib&#233;r&#233;s au d&#233;but de l&#8217;Intifada.) . Les r&#232;gles d&#8217;extraction utilisant les indicateurs temporels
sont nomm&#233;es r&#232;gles IT.
</p>
<p>4 Exp&#233;rimentations
</p>
<p>Nous avons utilis&#233; l&#8217;analyseur syntaxique XIP pour mener &#224; bien nos exp&#233;rimentations sur les lexiques et r&#232;gles
d&#8217;extraction verbes et indicateurs temporels.
</p>
<p>XIP (A&#239;t-Mokhtar et al., 2002) est un analyseur syntaxique robuste qui permet une analyse pour le fran&#231;ais et
l&#8217;anglais des relations de d&#233;pendances et de la reconnaissance d&#8217;entit&#233;s nomm&#233;es classiques. Les &#233;v&#233;nements
n&#8217;y sont pas trait&#233;s. Ce produit d&#233;velopp&#233; par Xerox Research Centre Europe est distribu&#233; avec des grammaires
encrypt&#233;es, inaccessibles &#224; l&#8217;utilisateur. Pourtant, il est possible d&#8217;enrichir l&#8217;analyse par l&#8217;ajout de ressources et la
cr&#233;ation de ses propres r&#232;gles de grammaire.
</p>
<p>5Nous remercions Andr&#233; Bittar d&#8217;avoir mis &#224; notre disposition son lexique compl&#233;mentaire de noms d&#8217;&#233;v&#233;nements.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#201;ATRICE ARNULPHY, XAVIER TANNIER ET ANNE VILNAT
</p>
<p>4.1 &#201;valuation des lexiques
</p>
<p>Les deux lexiques d&#233;crits en section 3.2 sont utilis&#233;s pour annoter les textes. Nous ne marquons comme &#233;v&#233;ne-
ments que les mots du lexique qui ont le m&#234;me lemme et qui sont de nature nominale. Les r&#233;sultats sur notre
corpus annot&#233; sont pr&#233;sent&#233;s dans le tableau 1.
</p>
<p>Pr&#233;cision Rappel F-mesure
LM 43,7 % 65,1 % 0,52
ER 58,3 % 69,1 % 0,63
LM + ER 48,7 % 66,8 % 0,56
</p>
<p>Pr&#233;cision Rappel F-mesure
LM 43,9 % 84,3 % 0,58
ER 57,0 % 84,0 % 0,68
LM + ER 48,3 % 84,1 % 0,61
</p>
<p>a) VerbAction b) VerbAction + Bittar
</p>
<p>TAB. 1 &#8211; R&#233;sultats avec les lexiques VerbAction et Bittar
</p>
<p>Nous observons tout d&#8217;abord que pour les diff&#233;rents corpus (LM ou ER) les r&#233;sultats en termes de pr&#233;cision et
de rappel sont homog&#232;nes. VerbAction, appliqu&#233; seul, obtient 48,7 % de pr&#233;cision sur notre corpus entier ce qui
nous montre que les d&#233;verbaux ont plus souvent une lecture non-&#233;v&#233;nementielle. Le rappel s&#8217;&#233;levant pour ce
lexique &#224; 66,8 %, nous pouvons conclure qu&#8217;environ un tiers des noms d&#8217;&#233;v&#233;nements de notre corpus ne sont
pas construits &#224; partir de d&#233;verbaux. Lors de la combinaison du VerbAction avec le lexique alternatif de Bittar, le
rappel est augment&#233; (de 66,8 % &#224; 84,1 %) sans affecter la pr&#233;cision (de 48,7 % &#224; 48,3 %). Mais 15 % des noms
d&#8217;&#233;v&#233;nements sont toujours absents et la pr&#233;cision est plut&#244;t basse.
</p>
<p>4.2 Utilisation des r&#232;gles d&#8217;extraction (sans lexique)
</p>
<p>Le tableau 2 donne les r&#233;sultats de l&#8217;exp&#233;rimentation sur les r&#232;gles pr&#233;sent&#233;es dans la section 3.3, impl&#233;ment&#233;es
au moyen de XIP.
</p>
<p>Pr&#233;cision Rappel F-mesure
IT 81,2 % 6,1 % 0,11
VB90 84,0 % 1,1 % 0,02
VB90 + IT 81,6 % 7,2 % 0,13
VB75 68,2 % 3,2 % 0,06
VB75 + IT 76,2 % 9,2 % 0,16
</p>
<p>TAB. 2 &#8211; R&#233;sultats avec les r&#232;gles d&#8217;extraction IT et VB sur notre corpus annot&#233;
</p>
<p>&#201;tant donn&#233; que les r&#232;gles sont extr&#234;mement restrictives et les verbes utilis&#233;s des d&#233;clencheurs s&#251;rs &#224; 90%, il
n&#8217;est pas &#233;tonnant que contrairement &#224; l&#8217;approche motiv&#233;e par les lexiques, les r&#232;gles d&#8217;extraction ont une bonne
pr&#233;cision (toujours sup&#233;rieure &#224; 80 %) et un mauvais rappel (entre 1 % pour les r&#232;gles &#224; base de VB90 suivant leur
configuration &#233;v&#233;nementielle pr&#233;f&#233;r&#233;e et 7,2 % pour la combinaison IT et VB90). &#192; titre de comparaison, nous
avons men&#233; la m&#234;me exp&#233;rience en utilisant les verbes qui ont pr&#233;sent&#233; des groupes nominaux &#233;v&#233;nementiels &#224;
plus de 75 % (dans l&#8217;&#233;tude pr&#233;c&#233;demment cit&#233;e). Nous pouvons nous rendre compte que les r&#233;sultats ne sont pas
meilleurs : un rappel de 2 points plus &#233;lev&#233; pour une pr&#233;cision de 16 points de moins pour les verbes seuls et 5 de
moins pour la combinaison avec les r&#232;gles IT.
</p>
<p>4.3 Combinaison des r&#232;gles et des lexiques
</p>
<p>Comme nous le voyons, l&#8217;utilisation des lexiques et des r&#232;gles est a priori destin&#233;e &#224; deux buts distincts. Les
r&#232;gles, appliqu&#233;es sur le corpus de test, n&#8217;ont pas vocation &#224; extraire de nouveaux mots qui seraient absents des
lexiques, mais plut&#244;t &#224; confirmer qu&#8217;un mot appartenant &#224; un lexique est bien un &#233;v&#233;n&#233;ment. Ceci est confirm&#233;
par le fait qu&#8217;ajouter les r&#232;gles aux lexiques dans la phase de test n&#8217;am&#233;liore que tr&#232;s peu le rappel : de 48,3 % de
pr&#233;cision &#224; 48 % et de 84,1 % de rappel &#224; 85,9 %. Cependant, comme nous allons le voir &#224; la section suivante, ces
r&#232;gles peuvent permettre la constitution d&#8217;un lexique enrichi et pond&#233;r&#233;, lorsqu&#8217;elles sont utilis&#233;es sur un nombre
&#233;lev&#233; de documents.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN LEXIQUE POND&#201;R&#201; DES NOMS D&#8217;&#201;V&#201;NEMENTS
</p>
<p>4.4 Un lexique pond&#233;r&#233; des noms d&#8217;&#233;v&#233;nements potentiels
</p>
<p>L&#8217;&#233;valuation des r&#232;gles impl&#233;ment&#233;es avec XIP &#233;tant tout &#224; fait satisfaisante (pr&#233;cision sup&#233;rieure &#224; 80 %), celles-
ci peuvent servir &#224; constituer un lexique de fa&#231;on automatique, &#224; condition d&#8217;&#234;tre appliqu&#233;es sur un grand corpus,
en l&#8217;occurrence un an du Monde (pr&#233;sent&#233; &#224; la section 3.1). Qui plus est, ce nouveau lexique contient &#233;galement
une information concernant le degr&#233; d&#8217;ambigu&#239;t&#233; (&#233;v&#233;nement vs non-&#233;v&#233;nement) de chaque mot pour le corpus.
</p>
<p>Apr&#232;s avoir appliqu&#233; les r&#232;gles sur le corpus, nous notons, pour chaque nom, le nombre d&#8217;occurrences &#233;tiquet&#233;es
par les r&#232;gles, et le nombre d&#8217;occurrences total dans les documents. Nous obtenons un ratio qui, s&#8217;il ne repr&#233;sente
bien s&#251;r pas une proportion ou une probabilit&#233; de l&#8217;usage &#233;v&#233;nementiel du mot (les r&#232;gles conduisant &#224; un faible
rappel), permet, en comparaison des ratios de l&#8217;ensemble des mots, d&#8217;estimer son degr&#233; d&#8217;ambigu&#239;t&#233;.
</p>
<p>Ceci est illustr&#233; par les exemples donn&#233;s dans le tableau 3. Beaucoup de ces mots sont pr&#233;sents dans les lexiques
VerbAction ou Bittar (colonne de gauche), d&#8217;autres en sont absents (colonne de droite). On voit que les noms peu
ou pas du tout ambigus (ceux d&#233;clenchant toujours un &#233;v&#233;nement) ont un ratio relativement &#233;lev&#233; (sup&#233;rieur au
rappel moyen d&#233;crit dans la section pr&#233;c&#233;dente). C&#8217;est le cas de chute, &#233;lection ou krach. On note que cl&#244;ture,
fortement ambigu dans le cas g&#233;n&#233;ral, l&#8217;est semble-t-il beaucoup moins dans des articles de journaux, o&#249; l&#8217;objet
est bien moins &#233;voqu&#233; que le fait de clore. En revanche, des mots comme tension, subvention ou acc&#232;s sont tr&#232;s
ambigus et obtiennent un ratio peu &#233;lev&#233;. C&#8217;est &#233;galement le cas de la date 11 septembre, mais celle-ci est une des
seules dates du lexique obtenu, et a de loin le meilleur ratio.
</p>
<p>D&#233;clencheur Nb. d&#233;tect&#233; Nb. Ratio
des lexiques par les r&#232;gles total
</p>
<p>chute 434 2620 16,6 %
cl&#244;ture 63 470 13,4 %
&#233;lection 1243 9713 12,8 %
guerre 1126 11542 9,8 %
crise 286 6185 4,6 %
</p>
<p>exp&#233;rience 63 2878 2,2 %
tension 16 1595 1,0 %
</p>
<p>coop&#233;ration 5 1631 0,3 %
subvention 2 867 0,2 %
</p>
<p>D&#233;clencheur Nb. d&#233;tect&#233; Nb. Ratio
(absent des lexiques) par les r&#232;gles total
</p>
<p>Anschluss 3 4 75 %
m&#233;choui 3 5 60 %
</p>
<p>krach 20 169 11,8 %
RTT 14 166 8,4 %
</p>
<p>demi-finale 35 553 6,3 %
cessez-le-feu 15 440 3,4 %
</p>
<p>difficult&#233; 16 3894 0,4 %
acc&#232;s 9 2828 0,3 %
</p>
<p>11 septembre 12 4354 0,3 %
</p>
<p>TAB. 3 &#8211; Exemples de d&#233;clencheurs potentiels collect&#233;s par les r&#232;gles d&#8217;extraction.
</p>
<p>Dans une derni&#232;re exp&#233;rimentation, nous avons appliqu&#233; ce nouveau lexique obtenu automatiquement, pour le
comparer aux lexiques VerbAction et Bittar. Nous avons utilis&#233; diff&#233;rentes &#171; tranches &#187; de ce lexique, selon les
ratios obtenus, pour observer l&#8217;&#233;volution des performances : tous les mots ayant un ratio sup&#233;rieur &#224; 10 %, puis
tous ceux ayant un ratio sup&#233;rieur &#224; 8 %, 6%, etc. Les r&#233;sultats sont pr&#233;sent&#233;s dans le tableau 4.
</p>
<p>Mots dont le ratio Pr&#233;cision Rappel F-mesure
est sup&#233;rieur &#224;
</p>
<p>10 % 84,1 % 16,6 % 0,28
8 % 83,6 % 24,3 % 0,38
6 % 79,8 % 31,5 % 0,45
1 % 56,3 % 71,0 % 0,63
</p>
<p>0,5 % 43,4 % 80,1 % 0,56
</p>
<p>TAB. 4 &#8211; Application du lexique automatique par &#171; tranches &#187; de ratio.
</p>
<p>La pr&#233;cision et le rappel &#233;voluent bien entendu de mani&#232;re oppos&#233;e (lorsque le lexique est moins s&#233;lectif, le rappel
augmente et la pr&#233;cision diminue), et la meilleure F-mesure (pour 1 %) est de 0,63, soit une valeur similaire
&#224; la F-mesure des deux lexiques VerbAction et Bittar combin&#233;s (0,61). Nous obtenons donc, automatiquement,
un lexique de qualit&#233; comparable aux deux lexiques compos&#233;s de fa&#231;on semi-automatique, en ajoutant en plus
l&#8217;information du degr&#233; d&#8217;ambigu&#239;t&#233; sur la lecture &#233;v&#233;nementielle des noms.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>B&#201;ATRICE ARNULPHY, XAVIER TANNIER ET ANNE VILNAT
</p>
<p>5 Conclusion
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; plusieurs exp&#233;rimentations dans le cadre d&#8217;une &#233;tude sur les &#233;v&#233;nements
nominaux dans les textes en fran&#231;ais. Nous avons notamment utilis&#233; les lexiques disponibles et cr&#233;&#233; un nouveau
lexique d&#8217;&#233;v&#233;nements &#171; potentiels &#187;, qui associe &#224; chaque nom une valeur indiquant &#224; quel point ce mot peut avoir
une lecture &#233;v&#233;nementielle. Ceci devrait aider &#224; la phase de d&#233;sambigu&#239;sation en contexte, qui est indispensable
pour une extraction efficace des &#233;v&#233;nements nominaux. Cette phase de d&#233;sambigu&#239;sation est notre prochaine &#233;tape
de travail, gr&#226;ce &#224; l&#8217;ensemble des lexiques et des indices contextuels collect&#233;s dans nos diff&#233;rentes &#233;tudes.
</p>
<p>R&#233;f&#233;rences
</p>
<p>A&#207;T-MOKHTAR S., CHANOD J.-P. &amp; ROUX C. (2002). Robustness beyond Shallowness : Incremental Deep
Parsing. Natural Language Engineering, 8, 121&#8211;144.
ARNULPHY B., TANNIER X. &amp; VILNAT A. (2010). Les entit&#233;s nomm&#233;es &#233;v&#233;nement et les verbes de cause-
cons&#233;quence. In Actes de TALN 2010, Montreal, Canada.
</p>
<p>BITTAR A. (2010). Construction d&#8217;un TimeBank du fran&#231;ais : Un corpus de r&#233;f&#233;rence annot&#233; selon la norme
ISO-TimeML. PhD thesis, Universit&#233; Paris Diderot - &#201;cole doctorale de Sciences du Langage / Laboratoire
ALPAGE.
</p>
<p>CALABRESE L. (2008). Les h&#233;m&#233;ronymes. Ces &#233;v&#232;nements qui font date, ces dates qui deviennent &#233;v&#232;nements.
Mots. Les langages du politique, 3, 115&#8211;128.
CRESWELL C., BEAL M. J., CHEN J., CORNELL T. L., NILSSON L. &amp; SRIHARI R. K. (2006). Automatically
extracting nominal mentions of events with a bootstrapped probabilistic classifier. In Proceedings of the CO-
LING/ACL on Main conference poster sessions, COLING-ACL &#8217;06, p. 168&#8211;175, Sydney, Australia : Association
for Computational Linguistics.
</p>
<p>DAVIDSON D. (1980). Essays on Actions and Events, chapter 11 &quot;Mental Events&quot; (1970). Psychology as
Philosophy. Calendron Press : Oxford, UK.
</p>
<p>DODDINGTON G., MITCHELL A., PRZYBOCKI M., RAMSHAW L., STRASSEL S. &amp; WEISCHEDEL R. (2004).
The Automatic Content Extraction (ACE) Program - Tasks, Data, and Evaluation. In Proceedings of LREC&#8217;04,
Lisbonne, Portugal.
</p>
<p>GRAVIER G., BONASTRE J.-F., GEOFFROIS E., GALLIANO S., MCTAIT K. &amp; CHOUKRI K. (2004). ESTER,
une campagne d&#8217;&#233;valuation des syst&#232;mes d&#8217;indexation automatique d&#8217;&#233;missions radiophoniques en fran&#231;ais. In
Proceedings of JEP&#8217;04, F&#232;z, Maroc.
</p>
<p>LECOLLE M. (2004). Toponymes en jeu : Diversit&#233; et mixage des emplois m&#233;tonymiques de toponymes. In
Studii si cercetari filologice 3 / 2004, Universit&#233; de Pitesti, Roumanie.
</p>
<p>NEVEU E. &amp; QU&#201;R&#201; L. (1996). Pr&#233;sentation. R&#233;seaux, 14(75), 7&#8211;21.
PUSTEJOVSKY J., CASTA&#209;O J., INGRIA R., SAUR&#205; R., GAIZAUSKAS R., SETZER A. &amp; KATZ G. (2003).
TimeML : Robust Specification of Event and Temporal Expressions in Text. In IWCS-5, Fifth International
Workshop on Computational Semantics.
</p>
<p>PUSTEJOVSKY J., KNIPPEN R., LITTMAN J. &amp; SAUR&#205; R. (2005). Temporal and Event Information in Natural
Language Text. Language Resources and Evaluation, 39(2-3), 123&#8211;164.
RUSSO I., CASELLI T. &amp; RUBINO F. (2011). Recognizing deverbal events in context. In Proceedings of 12th
International Conference on Intelligent Text Processing and Computational Linguistics (CICLing 2011), poster
session, Tokyo, Japan : Springer.
</p>
<p>TANGUY L. &amp; HATHOUT N. (2002). Webaffix : un outil d&#8217;acquisition morphologique d&#233;rivationnelle &#224; partir
du Web. In J.-M. PIERREL, Ed., Actes de TALN 2002, p. 245&#8211;254, Nancy : ATALA ATILF.
</p>
<p>VELDE D. V. D. (2006). Grammaire des &#233;v&#233;nements. Sens et structures. Presses Universitaires du Septentrion.
</p>
<p>VENDLER Z. (1967). Facts and events, chapter Verbs and Times, p. 97&#8211;121. Cornell University Press : Ithaca,
NY, USA.</p>

</div></div>
</body></html>