<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Exploitation d'un corpus arbor&#233; pour non sp&#233;cialistes par des requ&#234;tes guid&#233;es et des requ&#234;tes s&#233;mantiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>Exploitation d'un corpus arbor&#233; pour non sp&#233;cialistes par des requ&#234;tes guid&#233;es et 
des requ&#234;tes s&#233;mantiques 
</p>
<p>Achille Falaise (1), Agn&#232;s Tutin (2), Olivier Kraif (2)
</p>
<p>(1) GETALP-LIG
(2) LIDILEM 
</p>
<p>achille.falaise@imag.fr, agnes.tutin@u-grenoble3.fr, olivier.kraif@u-grenoble3.fr
</p>
<p>R&#233;sum&#233;
</p>
<p>L'exploitation  de  corpus  analys&#233;s  syntaxiquement  (ou  corpus  arbor&#233;s)  pour  le  public  non  sp&#233;cialiste  n'est  pas  un 
probl&#232;me trivial.  Si  la  communaut&#233;  du TAL souhaite  mettre &#224;  la  disposition des  chercheurs  non-informaticiens  des 
corpus comportant des annotations linguistiques complexes, elle doit imp&#233;rativement d&#233;velopper des interfaces simples &#224;  
manipuler mais permettant des recherches fines. Dans cette communication, nous pr&#233;sentons les modes de recherche 
&#171; grand public &#187; d&#233;velopp&#233;(e)s dans le cadre du projet Scientext, qui met &#224; disposition un corpus d'&#233;crits scientifiques 
interrogeable par partie textuelle, par partie du discours et par fonction syntaxique. Les modes simples sont d&#233;crits : un  
mode  libre  et  guid&#233;,  o&#249;  l'utilisateur  s&#233;lectionne  lui-m&#234;me les  &#233;l&#233;ments  de  la  requ&#234;te,  et  un  mode  s&#233;mantique,  qui  
comporte des grammaires locales pr&#233;&#233;tablies &#224; l'aide des fonctions syntaxiques.
</p>
<p>Abstract
</p>
<p>The exploitation of syntactically analysed corpora (or treebanks) by non-specialist is not a trivial problem. If the NLP 
community  wants  to  make publicly available  corpora  with  complex annotations,  it  is  imperative  to  develop  simple  
interfaces able to handle advanced queries. In this paper, we present queries methods for the general public developed 
during the Scientext project, which provides a searchable corpus of scientific texts searchable from textual part, part of  
speech and syntactic relation. The simple query modes are described: a guided query mode, where the user easily selects  
the elements of the query, and a semantic mode which includes local pre-established grammars using syntactic functions.
</p>
<p>Mots-cl&#233;s : environnement d'&#233;tude de corpus, corpus &#233;tiquet&#233;s et arbor&#233;s, cr&#233;ation de grammaires assist&#233;e, 
visualisation d'information linguistique
Keywords: corpus study environment, treebanks, assisted grammars creation, visualization of linguistic 
information
</p>
<p>1 Introduction
</p>
<p>Les  outils  d'exploration  de  corpus  annot&#233;s,  en  particulier  de  corpus  arbor&#233;s  (c'est-&#224;-dire  comportant  des  relations 
syntaxiques), sont souvent complexes &#224; utiliser, a fortiori pour des utilisateurs non initi&#233;s &#224; la linguistique-informatique. 
L&#8217;ergonomie et la facilit&#233; d&#8217;utilisation des outils sont cependant des enjeux majeurs en TAL, surtout si l&#8217;on souhaite 
diffuser des traitements et des annotations linguistiques complexes dans la communaut&#233; des linguistes. Pour &#233;largir le 
nombre d&#8217;utilisateurs  des  corpus annot&#233;s,  il  est  essentiel  de d&#233;velopper  des outils  d'exploration  de corpus faciles  &#224;  
manipuler mais puissants.  C'est ce qui nous a amen&#233;s  &#224; proposer un environnement de recherche simple, adapt&#233; aux 
linguistes, didacticiens, lexicographes ou &#233;pist&#233;mologues.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>Nous pr&#233;sentons ici l'outil d&#233;velopp&#233; dans le cadre du projet ANR Scientext (http://scientext.msh-alpes.fr), qui propose 
des modes de recherche simples pour non sp&#233;cialistes sur un corpus d'&#233;crits scientifiques analys&#233; syntaxiquement.  Il  
s'agit d'un outil  d'&#233;tude en ligne de corpus arbor&#233;s construit  &#224; partir  d'un sc&#233;nario de recherche simple : choix d'un 
corpus, recherche de ph&#233;nom&#232;nes linguistiques, et enfin affichage KWIC (Key Word In Context). Ce sc&#233;nario de base est 
facile &#224; appr&#233;hender, et se d&#233;compose en plusieurs &#233;crans simples qui peuvent s&#8217;enrichir de fonctions plus complexes 
&#171; en douceur &#187;. 
</p>
<p>Dans un premier temps, nous pr&#233;sentons les outils existants pour l'&#233;tude de corpus arbor&#233;s, en particulier pour le fran&#231;ais,  
rares et peu conviviaux. Nous d&#233;taillons ensuite les fonctionnalit&#233;s de notre outil (recherche libre guid&#233;e et recherche 
s&#233;mantique), et effectuons enfin un premier bilan de son utilisation apr&#232;s quelques mois d'existence publique qui r&#233;v&#232;le 
une nette pr&#233;f&#233;rence des utilisateurs pour les modes de recherche simples.
</p>
<p>2 Des annotations linguistiques riches mais des outils de recherche encore trop complexes pour le non 
sp&#233;cialiste
</p>
<p>2.1 Les corpus arbor&#233;s du fran&#231;ais
</p>
<p>Peu de corpus arbor&#233;s sont actuellement disponibles pour le fran&#231;ais. Le Corpus arbor&#233; du fran&#231;ais (French Treebank) 
(Abeill&#233; et al. 2003)1, est un corpus d&#8217;un million de mots de textes journalistiques, annot&#233;s en constituants , disponible 
pour des travaux de recherche mais non consultable en ligne. Parmi les corpus arbor&#233;s du fran&#231;ais consultables en ligne,  
il n&#8217;existe, &#224; notre connaissance qu&#8217;un outil, Corpuseye, d&#233;velopp&#233; par (Bick,  2005) dans le cadre du projet VISL et qui  
propose une analyse syntaxique dans le cadre de la grammaire de contrainte (Constraint grammar)2. Ce projet donne 
acc&#232;s  &#224;  de  nombreux  corpus  arbor&#233;s  dans  12  langues  europ&#233;ennes,  tous  trait&#233;s  syntaxiquement.  Ces  corpus  sont  
interrogeables en ligne gr&#226;ce &#224; un environnement d'&#233;tude, qui se base toutefois sur un langage de requ&#234;tes complexe, et  
appara&#238;t donc difficilement utilisable par un non-sp&#233;cialiste.
</p>
<p>2.2 Les environnements de recherche sur corpus
</p>
<p>Il existe plusieurs environnements d'&#233;tude de corpus annot&#233;s linguistiquement, bas&#233;s sur des langages de requ&#234;te. Parfois, 
un environnement graphique facilite la formulation des requ&#234;tes. Si ces formulations sous mode graphique clarifient la 
syntaxe du langage, elles en conservent n&#233;anmoins g&#233;n&#233;ralement toute la capacit&#233; expressive. Cependant, m&#234;me en mode 
graphique, ces environnements restent difficiles &#224; &#171; apprivoiser &#187; pour l'utilisateur non sp&#233;cialiste, et peut demander un 
investissement qu'il ne jugera pas acceptable.
</p>
<p>La majorit&#233; des outils d'&#233;tude de corpus ne traitent pas le niveau syntaxique. Ainsi le Corpus Query Processor (CQP) 
(Christ, 1994), d&#233;velopp&#233; &#224; l'Institut f&#252;r Maschinelle Sprachverarbeitung de Stuttgart, qui est devenu un standard dans la 
communaut&#233; du TAL, permet de faire des recherches en ligne3 dans des corpus &#233;tiquet&#233;s et lemmatis&#233;s, mais ne prend 
pas en charge les corpus arbor&#233;s. Une interface graphique a exist&#233;, mais n'est plus maintenue &#224; ce jour. Il faut donc 
passer  par  un  langage  &#224;  base  d'expressions  r&#233;guli&#232;res,  qui  reste  complexe  pour  un  non-sp&#233;cialiste.  En  revanche, 
l'interface du corpus &#233;tiquet&#233; et lemmatis&#233; Elicop4(Mertens, 2002) nous semble particuli&#232;rement int&#233;ressante et a &#233;t&#233; une 
source d&#8217;inspiration pour notre interface. Elle est  bas&#233;e sur un formulaire facile &#224; remplir ne n&#233;cessitant pas de conna&#238;tre 
un langage de requ&#234;tes (cf. figure 1). Le syst&#232;me ne permet toutefois pas de restreindre le corpus d'&#233;tude; il est en outre  
limit&#233; &#224; une recherche sur quatre mots et, l&#224; encore, les relations syntaxiques ne sont pas prises en compte.
</p>
<p>Tigersearch5 (Lezius, K&#246;nig, 2000) est l'un des seuls environnements graphique (mais hors ligne) permettant d'interroger  
des corpus arbor&#233;s (de type syntagmatique) mais l'outil n'est plus maintenu &#224; l&#8217;heure actuelle. 
1 http://www.llf.cnrs.fr/Gens/Abeille/French-Treebank-fr.php  
2 http://corp.hum.sdu.dk/  
3 http://www.ims.uni-stuttgart.de/projekte/CQPDemos/cqpdemo.html   
4 http://bach.arts.kuleuven.be/elicop/   
5 http://www.ims.uni-stuttgart.de/projekte/TIGER/TIGERSearch/   </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>Figure 1: L'interface de requ&#234;te du projet Elicop : 
recherche sur le verbe avoir au conditionnel suivi d'un adverbe et d'un participe
</p>
<p>En conclusion, nous ne pouvons que d&#233;plorer le manque d'environnements en ligne conviviaux pour la recherche dans  
des corpus annot&#233;s en fran&#231;ais, en particulier pour les corpus arbor&#233;s. Cette lacune est l'une des raisons qui a pouss&#233; &#224; la  
r&#233;alisation de l'environnement Scientext, destin&#233; &#224; l&#8217;&#233;tude linguistique des &#233;crits scientifiques.
</p>
<p>3 Fonctionnalit&#233;s de Scientext
</p>
<p>L'utilisation de Scientext se compose de trois grandes &#233;tapes : choix d'un corpus, recherche de ph&#233;nom&#232;nes linguistiques, 
et enfin affichage KWIC. Les exemples donn&#233;s ci-apr&#232;s sont bas&#233;s sur le corpus de textes scientifiques fran&#231;ais du projet  
Scientext, un corpus arbor&#233; trait&#233; avec l'analyseur Syntex de (Bourigault, 2007).
</p>
<p>3.1 S&#233;lection d'un sous-corpus
</p>
<p>Par d&#233;faut, le syst&#232;me travaille sur un corpus entier. La premi&#232;re &#233;tape consiste soit &#224; simplement accepter de travailler  
sur la totalit&#233; du corpus, soit &#224; s&#233;lectionner un sous-corpus. Il est possible de combiner des groupes de textes pr&#233;&#233;tablis  
suivant  diff&#233;rents  crit&#232;res  (par  exemple  discipline  et  type  de  texte  scientifique).  Les  textes  du  corpus  disposent  
d'annotations structurales (d&#233;coupage en parties, titres, etc.), et il est &#233;galement possible de restreindre la recherche &#224; l'un 
de ces &#233;l&#233;ments. Une fois le corpus s&#233;lectionn&#233; (cf. exemple figure 2), l&#8217;utilisateur peut ensuite affiner la s&#233;lection en 
excluant certains textes.
</p>
<p>3.2 Fonctionnalit&#233;s de recherche
</p>
<p>Une fois le corpus d&#233;limit&#233;, l'utilisateur est invit&#233; &#224; choisir entre trois modes de recherche (cf. figure 3). Quel que soit le 
mode choisi, le r&#233;sultat sera une grammaire locale, dont nous pr&#233;senterons le langage plus loin dans ce papier. Cette  
grammaire locale est compil&#233;e vers le langage de requ&#234;te utilis&#233; par le moteur de recherche ConcQuest, d&#233;velopp&#233; par  
(Kraif, 2008), qui effectue la recherche dans le corpus.
</p>
<p>Figure 3: Architecture des modes de recherche dans Scientext
</p>
<p>Figure 2: Un exemple de s&#233;lection du corpus Scientext : les introductions 
et les conclusions des articles et communications en sciences humaines</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>3.2.1 Recherche s&#233;mantique : utilisation d'une grammaire locale pr&#233;&#233;tablie
</p>
<p>Un ensemble de grammaires locales a &#233;t&#233; &#233;labor&#233; pour permettre une 
recherche s&#233;mantique dans les textes, de fa&#231;on &#224; ce que l'utilisateur n'ait 
pas  &#224;  se  soucier  de  la  syntaxe  complexe  des  requ&#234;tes.  L'utilisateur 
choisit ainsi  un premier type s&#233;mantique, par exemple l'&#233;valuation et 
l'opinion, puis dans un second temps, comme dans la copie d'&#233;cran ci-
contre (figure 4), un type sp&#233;cifique les adjectifs d'opinion.
</p>
<p>Une quinzaine de grammaires locales a &#233;t&#233; d&#233;velopp&#233;e, principalement 
autour  du  th&#232;me  du  positionnement,  th&#232;me  privil&#233;gi&#233;  dans  le  cadre  du  projet  Scientext  (Tutin  et  al.  2009).  Nous 
envisageons de d&#233;velopper davantage de grammaires locales autour d'autres th&#232;mes, en particulier dans une perspective 
didactique,  pour  la  recherche  d'expressions  st&#233;r&#233;otyp&#233;es  correspondant  &#224;  des  fonctions  s&#233;mantiques  et  discursives,  
comme l&#8217;expression de la cause, le positionnement par rapport &#224; d&#8217;autres auteurs, la formulation des probl&#233;matiques.
</p>
<p>3.2.2 Recherche guid&#233;e : un assistant pour effectuer des recherches libres
</p>
<p>En mode recherche guid&#233;e, l'interface se pr&#233;sente d'abord de mani&#232;re minimaliste,  
avec un champ de saisie pour une seule contrainte sur un seul mot (cf. figure 5). Des 
boutons permettent d'ajouter des mots et des contraintes sur les formes, les lemmes, 
les  parties  du  discours  (et  &#233;ventuellement  des  sous-cat&#233;gories).  Les  expressions 
r&#233;guli&#232;res sont accept&#233;es. En l'absence de relations syntaxiques, l'ordre des mots dans 
le formulaire est pris en compte lors de la recherche.
</p>
<p>Lorsqu'au moins deux mots sont pr&#233;sents, la possibilit&#233; est offerte de sp&#233;cifier une relation syntaxique entre ces mots. Si  
une relation est choisie, l'ordre des mots n'est alors plus pris en compte (cf. figure 6).
</p>
<p>Lors de la recherche, le contenu du formulaire est automatiquement converti en grammaire locale. Le mode guid&#233; permet 
d'effectuer des recherches suffisamment complexes pour la plupart des utilisateurs. Il est volontairement limit&#233;, afin de  
ne  pr&#233;senter  qu'un  sous-ensemble  facilement  compr&#233;hensible  de  fonctionnalit&#233;s  utilisables  de  fa&#231;on  intuitive,  sans 
recourir  &#224;  une  documentation.  Pour  exploiter  toute  l'expressivit&#233;  de  l'outil  de recherche,  il  faut  passer  en mode de 
recherche avanc&#233;e.
</p>
<p>3.2.3 Recherche avanc&#233;e : un langage de requ&#234;tes pour les corpus arbor&#233;s
</p>
<p>Le mode recherche avanc&#233;e permet de cr&#233;er directement une grammaire locale, en suivant la documentation fournie. Ce 
mode est &#233;videmment destin&#233; aux utilisateurs sp&#233;cialistes, c'est pourquoi nous n'en pr&#233;sentons dans cet article que les  
principales caract&#233;ristiques. Le langage de grammaire locale permet de sp&#233;cifier des contraintes sur les mots (forme,  
lemme, partie du discours, flexion), un ordre entre mots, et des relations syntaxiques entre mots. Il est aussi possible de 
sp&#233;cifier des listes de mots et des variables.
</p>
<p>Certaines  fonctionnalit&#233;s  innovantes  sont  sp&#233;cifiques  au  traitement  des  corpus  arbor&#233;s,  en  particulier  la  possibilit&#233;  
d'&#233;tendre  les  relations  syntaxiques  pr&#233;sentes  dans  le  corpus.  Par  exemple,  l'analyseur  Syntex  effectue  une  analyse  
syntaxique de surface et ainsi ne cr&#233;e pas de relation de d&#233;pendance directe entre un verbe &#224; un temps compos&#233; et son 
sujet ; mais cr&#233;e &#224; la place une relation SUJ (sujet) entre le sujet et l'auxiliaire, et une relation AUX (auxiliaire) entre  
</p>
<p>Figure 5 :  &#233;tat initial de la 
recherche guid&#233;e
</p>
<p>Figure 6: recherche guid&#233;e pour deux mots reli&#233;s par une relation syntaxique
</p>
<p>Figure 4: recherche s&#233;mantique</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>l'auxiliaire et le verbe. Dans Scientext, il est possible de d&#233;finir une relation &#171; sujet &#187; g&#233;n&#233;rique qui prend en compte ce 
cas de figure. La grammaire ci-dessous pr&#233;sente ainsi une grammaire d&#233;tectant les verbes d'opinion et leur sujet  en 
syntaxe profonde (par exemple la relation entre je et penser dans nous avons pens&#233;, nous pouvons penser).
</p>
<p>// Verbes d&#8217;opinion se rapportant &#224; l&#8217;auteur, selon le sch&#233;ma : verbe_opinion &#8211;(agent)--&gt;auteur
// Ex : Je pense, j&#8217;ai consid&#233;r&#233;, nous pouvons penser 
</p>
<p>(SUJINF,#2,#1) = (SUJ,#3,#1)(OBJ,#3,#2)     // Pour traiter les structures avec infinitives
(SUJCOMP,#2,#1) = (SUJ,#3,#1) (AUX,#3,#2)     // Pour traiter les structures avec auxiliaires
(SUJGENERIQUE,#2,#1) = (SUJINF,#2,#1) OR (SUJ,#1,#2) OR (SUJCOMP,#2,#1)     // Relation &quot;Sujet&quot; g&#233;n&#233;rique
$pron_auteur = nous, je, on    // Liste de pronoms pouvant d&#233;signer l'auteur
$v_opinion = adh&#233;rer, admettre, adopter, affirmer, avancer, consid&#233;rer, contredire, convenir, critiquer, croire, d&#233;fendre, d&#233;noncer,  
douter, esp&#233;rer, estimer, juger, justifier, penser, postuler, pr&#233;f&#233;rer, privil&#233;gier, reconna&#238;tre, r&#233;cuser, r&#233;futer, regretter, rejeter, souhaiter,  
souligner, souscrire, soutenir, sugg&#233;rer    // Liste de verbes d'opinion
Main = &lt;lemma=$v_opinion,#1&gt; &amp;&amp; &lt;lemma=$pron_auteur,#2&gt;  :: (SUJGENERIQUE,#1,#2)   // R&#232;gle principale
</p>
<p>3.3 Visualisation des r&#233;sultats
</p>
<p>Les r&#233;sultats d'une recherche sont ensuite consultables en affichage KWIC (figure 7), qui int&#232;gre les informations sur le  
type de texte. L&#8217;utilisateur peut en outre d&#233;sactiver les r&#233;sultats incorrects, qui ne seront pas extraits par la suite. Ces 
r&#233;sultats sont exportables en CSV et en HTML. Il est possible d'&#233;largir le contexte pour une ligne donn&#233;e ; le texte source 
est alors affich&#233;, en respectant, lorsque l&#8217;information est disponible, le style du texte original (paragraphe, italique, etc.). 
Les d&#233;pendances syntaxiques de la phrase affich&#233;e peuvent &#234;tre visualis&#233;es.
</p>
<p>Des statistiques sur les occurrences trouv&#233;es sont disponibles (cf. figure 8), par exemple le nombre d'occurrences et le 
pourcentage des lemmes et des formes et leur distribution par discipline, genre textuel, partie textuelle, et par texte. Il  
s'agit d'un type de fonctionnalit&#233; encore peu pr&#233;sent dans les outils d'&#233;tude de corpus, particuli&#232;rement int&#233;ressant pour 
l&#8217;&#233;tude des structures rh&#233;toriques dans l&#8217;&#233;crit scientifique.
</p>
<p>4 Premier bilan et conclusion
</p>
<p>L'utilisation du syst&#232;me Scientext d&#233;passe aujourd'hui le cadre du projet ANR 
dont il est issu. Il est par exemple utilis&#233; en didactique du FLE dans le cadre du projet FULS (http://scientext.msh-
</p>
<p>Figure 8: r&#233;partition des expressions de l'opinion de l'auteur dans le corpus 
suivant la partie textuelle (ci-contre : visualisation graphique)
</p>
<p>Figure 7: visualisation des r&#233;sultats</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011
</p>
<p>alpes.fr/fuls/),  et  int&#232;gre  de  nouveaux  corpus,  trait&#233;s  avec  un  analyseur  diff&#233;rent,  pour  le  projet  ANR  EMOLEX 
(http://scientext.msh-alpes.fr/emolex/).
</p>
<p>Sur la p&#233;riode allant du d&#233;but du lancement public du site fin juin 2010 &#224; aujourd'hui (d&#233;but avril 2011), 4432 requ&#234;tes  
ont &#233;t&#233; effectu&#233;es (en 662 sessions). Le mode guid&#233; est utilis&#233; pour 75% des requ&#234;tes, le mode s&#233;mantique (grammaires 
locales pr&#233;d&#233;finies) pour 23% et le mode avanc&#233; pour 2% ; cela d&#233;montre bien selon nous l'int&#233;r&#234;t de ces deux premiers 
modes de recherche.  Malgr&#233; tout,  il  reste que les connaissances d&#8217;ordre syntaxique,  en particulier  sur  les  fonctions 
(exemple : sujet, objet, &#233;pith&#232;te) pr&#233;sentent une complexit&#233; inh&#233;rente qui freine quelque peu l&#8217;utilisation grand public de 
tels corpus, puisque seulement 47% des requ&#234;tes guid&#233;es comportaient des contraintes d'ordre syntaxique. 
</p>
<p>Plusieurs am&#233;liorations du syst&#232;me sont pr&#233;vues : l&#8217;ajout de nouveaux corpus, pour le mode guid&#233; l&#8217;ajout de nouvelles 
fonctionnalit&#233;s (par exemple une pr&#233;selection des relations syntaxiques &#224; partir des parties du discours choisies). Ces  
am&#233;liorations seront test&#233;es sur un ensemble d&#8217;utilisateurs non sp&#233;cialistes. L&#8217;utilisation des outils de TAL par les non 
sp&#233;cialistes ne pourra pas faire l&#8217;&#233;conomie d&#8217;une r&#233;flexion sur l&#8217;ergonomie de ces outils.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A., CL&#201;MENT L., TOUSSENEL F. (2003).  Building a treebank for French. A. Abeill&#233; (ed)  Treebanks. Dordrecht : 
Kluwer.
</p>
<p>BICK ECKHARD (2004).  Parsing and evaluating the French Europarl corpus, Patrick Paroubek, Isabelle Robba &amp; Anne 
Vilnat (ed.): M&#233;thodes et outils pour l'&#233;valuation des analyseurs syntaxiques (Journ&#233;e ATALA, 15 mai 2004). pp. 4-9. 
Paris: ATALA.
</p>
<p>BICK ECKHARD (2005). Live use of Corpus data and Corpus annotation tools in CALL: Some new developments in VISL. 
Henrik Holmboe (ed.),  Nordic Language Technology,  &#197;rbog for Nordisk Sprogteknologisk Forskningsprogram 2000-
2004 (Yearbook 2004), pp.171-186. Copenhague, Danemark : Museum Tusculanum.
</p>
<p>BOURIGAULT DIDIER (2007). Un analyseur syntaxique op&#233;rationnel : SYNTEX. M&#233;moire de HDR. Toulouse.
</p>
<p>CHRIST OLI (1994). A modular and flexible architecture for an integrated corpus query system. Actes de COMPLEX'94,  
Budapest.
</p>
<p>CHRIST OLI,  SCHULZE,  B.M.  (1995).  Ein flexibles  und modulares Anfragesystem f&#252;r Textcorpora. Tagungsbericht des  
Arbeitstreffen Lexikon + Text. T&#252;bingen, Allemagne : Niemeyer.
</p>
<p>KRAIF OLIVIER (2008), Comment allier la puissance du TAL et la simplicit&#233; d'utilisation ? l'exemple du concordancier  
bilingue ConcQuest, Actes des  9&#232;me Journ&#233;es d'analyse statistique des donn&#233;es textuelles, JADT 2008, pp. 625-634. 
Lyon: Presses universitaires de Lyon. 
</p>
<p>LEZIUS WOLFGANG,  K&#214;NIG ESTHER (2000).  Towards  a  search  engine  for  syntactically  annotated  corpora.  In Ernst  G. 
Schukat-Talamazzini, Werner Z&#252;hlke (ed.): KONVENS-2000 Sprachkommunikation, pp. 113-116. Ilmenau, Allemagne : 
VDE-Verlag.
</p>
<p>MERTENS PIET (2002). Les corpus de fran&#231;ais parl&#233; ELICOP : consultation et exploitation. Jean Binon, Piet Desmet, Jan 
Elen,  Piet  Mertens,  Lies  Sercu  (ed.)  Tableaux  vivants,  Opstellen  over  taal-  en  onderwijs,  aangeboden  aan  Mark  
Debrock,  Symbolae,  Facultatis  Litterarum  Lovaniensis,  Series  A,  vol.  28.  383-415.  Louvain,  Belgique :  Leuven 
Universitaire Pers.
</p>
<p>SILBERZTEIN MAX. (2006). NooJ&#8217;s Linguistic Annotation Engine. S. Koeva, D. Maurel, M. Silberztein (ed.), INTEX/NooJ 
pour le Traitement Automatique des Langues. Cahiers de la MSH Ledoux. Presses Universitaires de Franche-Comt&#233;, pp. 
9-26.
</p>
<p>TUTIN AGN&#200;S, GROSSMANN FRANCIS, FALAISE ACHILLE, KRAIF OLIVIER (2009). Autour du projet Scientext   : &#233;tude des marques   
linguistiques  du  positionnement  de  l&#8217;auteur  dans  les  &#233;crits  scientifiques    .  Journ&#233;es  Linguistique  de  Corpus.  10-12 
septembre 2009, Lorient.</p>

</div></div>
</body></html>