<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Cat&#233;goriser les r&#233;ponses aux interruptions dans les d&#233;bats politiques</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Cat&#233;goriser les r&#233;ponses aux interruptions dans les d&#233;bats politiques
</p>
<p>Brigitte Bigi1 Cristel Portes1 Agn&#232;s Steuckardt1 Marion Tellier1
</p>
<p>(1) Laboratoire Parole &amp; Langage, CNRS &amp; Aix-Marseille Universit&#233;s
5, avenue Pasteur, BP 80975, 13604 Aix en Provence, France
</p>
<p>brigitte.bigi@lpl-aix.fr, cristel.portes@lpl-aix.fr, Agnes.Steuckardt@univ-provence.fr, marion.tellier@lpl-aix.fr
</p>
<p>R&#233;sum&#233;. Cet article traite de l&#8217;analyse de d&#233;bats politiques selon une orientation multimodale. Nous &#233;tu-
dions plus particuli&#232;rement les r&#233;ponses aux interruptions lors d&#8217;un d&#233;bat &#224; l&#8217;Assembl&#233;e nationale. Nous propo-
sons de proc&#233;der &#224; l&#8217;analyse via des annotations syst&#233;matiques de diff&#233;rentes modalit&#233;s. L&#8217;analyse argumentative
nous a amen&#233;e &#224; proposer une typologie de ces r&#233;ponses. Celle-ci a &#233;t&#233; mise &#224; l&#8217;&#233;preuve d&#8217;une classification
automatique. La difficult&#233; dans la construction d&#8217;un tel syst&#232;me r&#233;side dans la nature m&#234;me des donn&#233;es : multi-
modales, parfois manquantes et incertaines.
</p>
<p>Abstract. This work was conducted to analyze political debates, with a multimodal point of view. Parti-
cularly, we focus on the answers produced by a main speakers after he was disrupted. Our approach relies on
the annotations of each modality and on their review. We propose a manual categorization of the observed disrup-
tions. A categorization method was applied to validate the manual one. The difficulty is to deal with multimodality,
missing values and uncertainty in the automatic classification system.
</p>
<p>Mots-cl&#233;s : corpus, annotations, multimodalit&#233;, classification supervis&#233;e.
</p>
<p>Keywords: corpus, annotations, multimodality, classification.
</p>
<p>1 Introduction
</p>
<p>Quelque pr&#233;par&#233; qu&#8217;il ait pu &#234;tre, le discours d&#8217;un d&#233;put&#233; comporte, lorsqu&#8217;il est prononc&#233; au sein de l&#8217;Assembl&#233;e
nationale, une part d&#8217;improvisation. L&#8217;orateur y est expos&#233; aux interruptions, rarement am&#232;nes, de ses coll&#232;gues,
prises de parole qui ne b&#233;n&#233;ficient pas d&#8217;une autorisation formelle du Pr&#233;sident de s&#233;ance. Le regard du d&#233;put&#233;,
alors, quitte les notes, l&#8217;intonation change, la parole spontan&#233;e prend le relai de la d&#233;clamation. Si l&#8217;analyse
de discours s&#8217;est int&#233;ress&#233;e traditionnellement aux d&#233;bats politiques retransmis par la t&#233;l&#233;vision (Bonnafous &amp;
Tournier, 2001), en revanche les interactions &#224; l&#8217;&#339;uvre dans les assembl&#233;es d&#233;lib&#233;ratives (Assembl&#233;e nationale et
S&#233;nat), ont &#233;t&#233; moins &#233;tudi&#233;es, faute de mat&#233;riau ad&#233;quat. Or l&#8217;Assembl&#233;e nationale met aujourd&#8217;hui &#224; disposition
sur internet la retransmission des vid&#233;os des s&#233;ances. Cette ressource nouvelle ouvre &#224; la recherche l&#8217;opportunit&#233;
de mieux comprendre les m&#233;canismes de la d&#233;lib&#233;ration politique. Nous nous proposons d&#8217;aborder, selon une
approche multimodale, les strat&#233;gies mises en &#339;uvre pour contrer la r&#233;partie dans les d&#233;bats politiques.
</p>
<p>On retrouve dans de nombreux domaines les termes modalit&#233; et multimodalit&#233;. Cependant, leur usage et leur
d&#233;finition sont variables tant par le sens que par le formalisme de la d&#233;finition. Par essence, cependant, la multi-
modalit&#233; est l&#8217;utilisation d&#8217;au moins deux des cinq sens pour l&#8217;&#233;change d&#8217;informations. De cette d&#233;finition, on peut
directement d&#233;duire l&#8217;importance de la mutimodalit&#233; dans la question du langage et de la parole. Les annotations
multimodales de corpus ont soulev&#233; de nombreuses questions. La cr&#233;ation et l&#8217;annotation de corpus multimodaux
pr&#233;sentent des difficult&#233;s li&#233;es aux choix de logiciel, &#224; des d&#233;cisions concernant la d&#233;coupe et l&#8217;alignement pa-
role/transcription, &#224; la pertinence des m&#233;thodes automatiques, etc. Nous avons donc &#233;t&#233; confront&#233;s aux grands
probl&#232;mes pos&#233;s par l&#8217;annotation de ce type de ressource. Cet article pr&#233;sente en premier lieu la m&#233;thodologie
qui a &#233;t&#233; conduite pour l&#8217;annotation multimodale d&#8217;une partie de la s&#233;ance publique du 4 mai 2010 &#224; l&#8217;Assembl&#233;e
nationale durant laquelle Yves Cochet intervient. Le corpus contient de nombreux niveaux d&#8217;annotations automa-
tiques (&#233;ventuellement r&#233;vis&#233;s manuellement), ou manuels. Cette approche s&#8217;appuie sur celle qui a &#233;t&#233; propos&#233;e
pour le corpus CID - Corpus of Interactional Data (Blache et al., 2010). &#192; ces annotations, nous ajoutons l&#8217;in-
dication des segments durant lesquels le locuteur r&#233;pond (ou choisit de ne pas r&#233;pondre) &#224; une interpellation. En
effet, c&#8217;est non pas aux interruptions elles-m&#234;mes, peu audibles dans la vid&#233;o et incompl&#232;tement enregistr&#233;es par</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BRIGITTE BIGI CRISTEL PORTES AGN&#200;S STEUCKARDT MARION TELLIER
</p>
<p>le compte rendu &#233;crit, mais aux r&#233;ponses &#224; ces interruptions que l&#8217;on s&#8217;int&#233;resse ici. L&#8217;analyse argumentative de
ces donn&#233;es nous a amen&#233; &#224; proposer une typologie de ces r&#233;ponses aux interruptions. Trois grands types de stra-
t&#233;gies ont &#233;t&#233; relev&#233;es : la d&#233;cision d&#8217;ignorer l&#8217;interruption, la r&#233;ponse sur la pr&#233;dication avanc&#233;e par celui qui
interrompt, et la r&#233;plique, &#171; pas de c&#244;t&#233; &#187; m&#233;ta-discursif ou m&#233;ta-interactionnel.
</p>
<p>Cette typologie est mise &#224; l&#8217;&#233;preuve d&#8217;une classification automatique. On fait l&#8217;hypoth&#232;se que si une structure de
classe existe au sein des nos donn&#233;es et qu&#8217;elle correspond &#224; la typologie propos&#233;e, le syst&#232;me de classification
automatique peut la caract&#233;riser et effectuer une cat&#233;gorisation correcte. L&#8217;&#233;laboration d&#8217;un tel classifieur implique
de traiter des donn&#233;es h&#233;t&#233;rog&#232;nes et asynchrones, du fait de leur nature multimodale. De plus, certaines annota-
tions ne peuvent pas &#234;tre r&#233;alis&#233;es (cam&#233;ra qui se d&#233;place ou bruit de fond) car ce sont des donn&#233;es r&#233;elles (par
opposition &#224; des enregistrements de laboratoire). De ce fait &#233;galement, il subsiste un certain degr&#233; d&#8217;incertitude
sur les annotations produites qui m&#233;rite d&#8217;&#234;tre pris en consid&#233;ration par le classifieur.
</p>
<p>2 Corpus et annotations
</p>
<p>2.1 Le corpus
</p>
<p>Nous avons choisi d&#8217;exploiter une ressource rendue disponible par le site de l&#8217;Assembl&#233;e nationale1 : la vid&#233;o des
s&#233;ances publiques. Le d&#233;bat sur le &#171; Grenelle II de l&#8217;environnement &#187; a &#233;t&#233; s&#233;lectionn&#233; en raison de la controverse
importante qu&#8217;il a d&#233;clench&#233;e. La premi&#232;re intervention sur le projet de loi du gouvernement a &#233;t&#233; pr&#233;sent&#233;e le
4 mai 2010 par le d&#233;put&#233; Vert Yves Cochet, d&#233;&#231;u de la timidit&#233; de ce Grenelle II ; dans son intervention, de 45
minutes, on a retenu le moment le plus vif de la controverse, o&#249; le d&#233;put&#233;, fr&#233;quemment interrompu, quitte ses
notes, et o&#249; la parole spontan&#233;e prend le relais de la d&#233;clamation. Le passage qui a &#233;t&#233; extrait dure 4 minutes et
commence apr&#232;s 19 minutes de d&#233;bat. Le fichier vid&#233;o peut &#234;tre t&#233;l&#233;charg&#233; apr&#232;s demande d&#8217;autorisation2. La
vid&#233;o est au format FLV (Flash Video), de qualit&#233; suffisante, mais de petite r&#233;solution (320x256). La piste audio
a &#233;t&#233; extraite &#224; partir de cette derni&#232;re. Un compte rendu au format HTML est &#233;galement disponible. Durant le
passage s&#233;lectionn&#233;, Yves Cochet prononce pr&#232;s de 800 mots, 136 contours prosodiques ont &#233;t&#233; relev&#233;s ainsi que
122 gestes principaux. De plus, il est interrompu &#224; onze reprises.
</p>
<p>2.2 Les annotations
</p>
<p>Dans un premier temps, le signal de parole a &#233;t&#233; d&#233;coup&#233; automatiquement en unit&#233;s inter-pausales (Interpausal
Unit - d&#233;sormais IPU). Les IPUs sont des blocs de parole born&#233;s par des pauses silencieuses d&#8217;au moins 200 ms.
</p>
<p>Transcription Orthographique Enrichie (TOE) : Nous avons adopt&#233; les conventions de transcriptions &#233;tablies
pour le corpus CID. Si elle est essentiellement orthographique, la TOE sp&#233;cifie toutefois les ph&#233;nom&#232;nes typiques
de l&#8217;oral tels que les pauses pleines (euh, hum, etc.), les faux-d&#233;parts, les amorces, les mots tronqu&#233;s, les r&#233;p&#233;-
titions, etc. La TOE a &#233;t&#233; choisie afin de garantir &#224; la fois un meilleur rendement de l&#8217;alignement phon&#233;tique
n&#233;cessaire &#224; l&#8217;analyse du module phon&#233;tique, et le meilleur rendement pour les modules morpho-syntaxique et
syntaxique qui ne peuvent &#234;tre faits que sur des transcriptions orthographiques standard.
</p>
<p>Phon&#233;tisation : La phon&#233;tisation consiste &#224; d&#233;terminer les phon&#232;mes qui ont &#233;t&#233; produits lors d&#8217;un &#233;nonc&#233; oral. Le
convertisseur graph&#232;me-phon&#232;me fournit une suite de mots phon&#233;tis&#233;s en SAMPA - Speech Assessment Methods
Phonetic Alphabet. Les phon&#232;mes sont ensuites align&#233;s automatiquement sur le signal. Une v&#233;rification manuelle
des alignements a &#233;t&#233; effectu&#233;e. La syllabation a &#233;t&#233; r&#233;alis&#233;e &#224; partir des s&#233;quences de phon&#232;mes avec le syst&#232;me
d&#233;crit dans (Bigi et al., 2010). Les syllabes ont &#233;galement &#233;t&#233; r&#233;vis&#233;es manuellement.
</p>
<p>Syntaxe : Les annotations syntaxiques et morpho-syntaxiques ont &#233;t&#233; r&#233;alis&#233;es automatiquement par le syst&#232;me
d&#233;crit dans (Blache &amp; Rauzy, 2008).
</p>
<p>Auto-r&#233;p&#233;titions : Elles ont &#233;t&#233; r&#233;alis&#233;es manuellement. Trois cat&#233;gories sont associ&#233;es au r&#233;p&#233;table et au r&#233;p&#233;t&#233; :
DIS (ennonc&#233; disfluent) ; RHE (ennonc&#233; de type rh&#233;torique) ; LIST (effet de liste).
</p>
<p>1http ://www.assembleenationale.fr/13/seance/vod/grenelle-2-20100504-2.asp
2La demande peut &#234;tre faite aupr&#232;s de la Cellule GILDA - Gestion des Images en Ligne des D&#233;bats de l&#8217;Assembl&#233;e, de l&#8217;Assembl&#233;e
</p>
<p>nationale, via la Division de l&#8217;information multim&#233;dia (en charge de la mise en ligne des documents parlementaires) : dim@assemblee-
nationale.fr.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Prosodie : Le terme de prosodie renvoie &#224; l&#8217;&#233;tude linguistique de ce qui peut &#234;tre con&#231;u intuitivement comme
le rythme et la m&#233;lodie de la parole. Les variations m&#233;triques (rythme) et intonatives (m&#233;lodie) de la parole rem-
plissent d&#8217;abord une fonction d&#8217;organisation du flux de parole en associant plusieurs mots dans des &#171; groupes de
sens &#187; (Di Cristo, 1999). Dans cette &#233;tude, nous nous sommes concentr&#233;s sur les contours intonatifs. Ces sch&#233;-
mas m&#233;lodiques associ&#233;s aux groupes de sens diff&#232;rent selon les langues mais la plupart des langues poss&#232;dent
un paradigme de contours contrastifs. Ceux-ci jouent un r&#244;le pragmatique important, notamment en v&#233;hiculant
l&#8217;attitude des interlocuteurs vis-&#224;-vis des contenus transmis (Beyssade &amp; Marandin, 2007). Leur importance argu-
mentative est donc av&#233;r&#233;e. Pour le fran&#231;ais, nous avons adapt&#233; l&#8217;inventaire propos&#233; dans (Bertrand et al., 2007).
Cet inventaire non exhaustif comporte deux cat&#233;gories de contour mineur (montant et descendant), g&#233;n&#233;ralement
associ&#233;s &#224; des constituants de l&#8217;ordre du syntagme, et quatre cat&#233;gories de contours majeurs (descendant, montant,
montant-descendant, descendant depuis la p&#233;nulti&#232;me), subordonnant les contours mineurs dans la structure pro-
sodique, et correspondant plut&#244;t au niveau de la phrase ou de l&#8217;&#233;nonc&#233;. Au sein des contours majeurs montants,
notre inventaire distingue en outre trois vari&#233;t&#233;s fonctionnelles : montant continuatif, montant de liste, montant
final. Leur annotation repose sur une identification auditive r&#233;alis&#233;e par des experts.
</p>
<p>Gestes : Les gestes co-verbaux (ici les gestes des mains qui accompagnent spontan&#233;ment la parole) ont &#233;t&#233;
annot&#233;s manuellement. Pour classer les co-verbaux, nous avons utilis&#233; la typologie de McNeill (McNeill, 1992,
2005) qui d&#233;finit quatre dimensions du geste : les gestes iconiques (qui illustrent des concepts concrets), les gestes
m&#233;taphoriques (qui illustrent des concepts abstraits), les d&#233;ictiques (qui pointent vers un r&#233;f&#233;rent pr&#233;sent ou absent)
et les battements (qui rythment le discours, sans valeur s&#233;mantique). &#192; cette typologie, la plus fr&#233;quemment
utilis&#233;e dans les &#233;tudes de la gestuelle aujourd&#8217;hui, nous avons ajout&#233; deux types de gestes : les gestes interactifs
(qui ont une fonction de r&#233;gulation de l&#8217;interaction selon (Bavelas et al., 1995) et les embl&#232;mes (qui appartiennent
&#224; un r&#233;pertoire fixe et propre &#224; une culture, un peu comme des expressions idiomatiques). Enfin, nous avons
&#233;galement annot&#233; les gestes avort&#233;s, c&#8217;est-&#224;-dire esquiss&#233;s mais non achev&#233;s. Certains gestes pouvant parfois
pr&#233;senter deux dimensions nous avons ajout&#233; une annotation &#171; type de geste secondaire &#187;. De plus, pour l&#8217;analyse
de ce corpus particulier, nous avons choisi d&#8217;annoter la manualit&#233;, c&#8217;est-&#224;-dire la main utilis&#233;e pour former le geste
selon 4 cat&#233;gories : main droite, main gauche, deux mains asym&#233;triques, deux mains sym&#233;triques.
</p>
<p>R&#233;ponses aux interruptions : Leur rep&#233;rage a consist&#233; &#224; mettre en correspondance ce que nous observons sur la
vid&#233;o et l&#8217;audio, la transcription et le compte rendu, dans le but de d&#233;terminer avec pr&#233;cision les segments de la
transcription qui correspondent aux moments o&#249; Y. Cochet r&#233;pond (ou choisi de ne pas r&#233;pondre) aux interruptions.
</p>
<p>3 Typologie des r&#233;ponses aux interruptions
</p>
<p>Dans le passage analys&#233;, Yves Cochet soutient la th&#232;se que les voitures &#233;lectriques, loin de constituer une panac&#233;e
&#233;cologique, ne font que d&#233;placer le probl&#232;me &#233;nerg&#233;tique vers le nucl&#233;aire, dont il souhaite que la France sorte.
Cette attaque des voitures &#233;lectriques suscite des r&#233;actions hostiles de la part des d&#233;put&#233;s et des ministres de
la majorit&#233;. Interrompu, le d&#233;put&#233; vert met en &#339;uvre plusieurs strat&#233;gies pour retrouver sa position d&#8217;orateur et
reprendre le fil de son argumentation.
</p>
<p>La strat&#233;gie du m&#233;pris : Elle est utilis&#233;e deux fois dans le corpus. Sur la vid&#233;o, la d&#233;cision d&#8217;ignorer peut &#234;tre
per&#231;ue par des indices convergents : une courte pause, un mouvement de t&#234;te vers le c&#244;t&#233; droit d&#8217;o&#249; provient l&#8217;in-
terruption, suivi d&#8217;un recentrage, une mimique de m&#233;pris (fermeture prolong&#233;e des yeux, pincement des l&#232;vres).
Ces interruptions sont enregistr&#233;es par le compte rendu &#233;crit : avec l&#8217;interruption &quot;Passons au v&#233;lo !&quot;, le d&#233;put&#233;
Maxime Bono caricature la pens&#233;e d&#8217;Yves Cochet en poussant ses cons&#233;quences &#224; des extr&#233;mit&#233;s susceptibles de
faire rire l&#8217;h&#233;micycle ; la seconde interruption est enregistr&#233;e par la didascalie &quot;Rires et exclamations sur les bancs
de l&#8217;UMP&quot;.
</p>
<p>La r&#233;ponse frontale : La deuxi&#232;me strat&#233;gie oppose &#224; l&#8217;interruption une r&#233;ponse sur la pr&#233;dication. Deux sous-
cat&#233;gories apparaissent dans le corpus. Dans le premier cas, Yves Cochet se contente d&#8217;une n&#233;gation de la pr&#233;-
dication de l&#8217;adversaire. Avec ce degr&#233; z&#233;ro de la r&#233;ponse contradictoire, aucune r&#233;futation n&#8217;est engag&#233;e, soit
parce que l&#8217;orateur est arr&#234;t&#233; par une nouvelle interruption, soit parce que le d&#233;put&#233; se contente d&#8217;asserter une
pr&#233;dication oppos&#233;e &#224; la pr&#233;c&#233;dente. La seconde sous-cat&#233;gorie de r&#233;ponse sur la pr&#233;dication se d&#233;compose en
deux moments. Dans un premier temps, l&#8217;orateur reprend, en dialogisme interlocutif imm&#233;diat l&#8217;&#233;nonc&#233; de son
contradicteur. Cette reprise s&#8217;op&#232;re avec une modalit&#233; prosodique sp&#233;cifique : l&#8217;intonation d&#8217;arri&#232;re-plan. &#192; cette
h&#233;t&#233;ro-r&#233;p&#233;tition, le locuteur oppose ensuite un contre-argument.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BRIGITTE BIGI CRISTEL PORTES AGN&#200;S STEUCKARDT MARION TELLIER
</p>
<p>Le pas de c&#244;t&#233; : La troisi&#232;me strat&#233;gie consiste &#224; r&#233;pliquer &#224; l&#8217;interruption par un commentaire m&#233;ta-discursif
ou m&#233;ta-interactionnel, au lieu de r&#233;pondre sur le fond. Les &#233;tudes interactionnelles appellent ce type de r&#233;par-
tie r&#233;plique, &#171; intervention r&#233;active portant sur l&#8217;&#233;nonciation et non sur l&#8217;&#233;nonc&#233; de l&#8217;intervention pr&#233;c&#233;dente &#187;
(Traverso, 2002). Les r&#233;pliques m&#233;ta-discursives d&#8217;Yves Cochet &#233;valuent la qualit&#233; du propos de l&#8217;adversaire :
l&#8217;&#233;valuation positive sert &#224; retourner l&#8217;&#233;nonc&#233; de l&#8217;adversaire contre lui, sur le mode d&#8217;un vous ne croyez pas si
bien dire. Les r&#233;pliques m&#233;ta-interactionnelles s&#8217;adressent non &#224; l&#8217;h&#233;micycle mais &#224; la seule Pr&#233;sidente. Lass&#233;
d&#8217;&#234;tre continuellement interrompu, Yves Cochet tente de ren&#233;gocier le cadre de l&#8217;interaction et demande l&#8217;appui
de la Pr&#233;sidente par deux fois. Ces r&#233;pliques-l&#224; sont prononc&#233;es avec un niveau de registre tonal bas et une orien-
tation du corps en direction du &#171; perchoir &#187;. La ren&#233;gociation du cadre interactionnel fait partie des techniques de
d&#233;bat utilis&#233;es par les politiques : la sc&#233;nette jou&#233;e en apart&#233; avec la Pr&#233;sidente permet &#224; l&#8217;orateur de se poser en
victime d&#8217;adversaires irrespectueux des r&#232;gles de l&#8217;Assembl&#233;e nationale.
</p>
<p>&#192; l&#8217;examen de d&#233;tail, la typologie argumentative para&#238;t pouvoir &#234;tre mise en correspondance avec la prosodie et
le geste, sans toutefois que les descriptions prosodiques et gestuelles d&#233;gagent des caract&#232;res absolument sp&#233;ci-
fiques pour chaque type argumentatif ; il faudrait, pour parvenir &#224; une convergence des trois approches, raffiner la
typologie argumentative, au risque de la rendre peu lisible. Malgr&#233; cette relative approximation, on se propose de
mettre la classification argumentative &#224; l&#8217;&#233;preuve du traitement automatique.
</p>
<p>4 Classification d&#8217;annotations multimodales
</p>
<p>On proc&#232;de &#224; une classification automatique des donn&#233;es en vue d&#8217;une objectivation de l&#8217;analyse manuelle, en
confrontant les interpr&#233;tations de l&#8217;annotateur avec une classification automatique des r&#233;ponses du locuteur aux
interruptions. La classification automatique ainsi &#233;tablie vise &#224; valider/v&#233;rifier la classification manuelle des r&#233;-
ponses aux interruptions en ne faisant pas intervenir la subjectivit&#233; de l&#8217;exp&#233;rimentateur par autre chose que le
choix des repr&#233;sentations qui sont utilis&#233;es. Nous rappelons que la classification automatique supervis&#233;e consiste &#224;
caract&#233;riser des groupes d&#8217;objets ayant un comportement homog&#232;ne. On doit y d&#233;finir un ensemble T d&#8217;exemples
caract&#233;ris&#233;s par des descripteurs, et y associer la classe durant la phase d&#8217;apprentissage. La construction d&#8217;un
classifieur dans l&#8217;ensemble C des cat&#233;gories consiste en la d&#233;finition d&#8217;une fonction qui, pour chaque exemple
st, t &#8712; T , renvoie une cat&#233;gorie ci &#8712; C &#224; laquelle il est assign&#233;. Les r&#233;sultats pr&#233;sent&#233;s dans (Lavesson &amp; Da-
vidsson, 2006) indiquent que les param&#232;tres (et leur optimisation) sont souvent plus importants que le choix de
l&#8217;algorithme de classification. Nous supposons que cet assertion est &#233;galement pertinente en cas de donn&#233;es multi-
modales. Nous avons choisi le classifieur bas&#233; sur l&#8217;algorithme C4.5, reposant sur des arbres de d&#233;cisions, propos&#233;
dans (Quinlan, 1993) et impl&#233;ment&#233; dans le logiciel Weka (Holmes et al., 1994). Les exp&#233;riences sont men&#233;es
selon le principe de la validation crois&#233;e, avec un processus bas&#233; sur 100 it&#233;rations.
</p>
<p>En cas de corpus multimodal, la difficult&#233; vient de l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233;, et de l&#8217;absence d&#8217;alignement entre les donn&#233;es
(ici, des annotations). La premi&#232;re &#233;tape consiste donc &#224; choisir comment op&#233;rer la fusion des descripteurs afin
d&#8217;obtenir un vecteur de caract&#233;ristiques multimodal. La litt&#233;rature - notamment (Snoek et al., 2005), est essentiel-
lement fond&#233;e sur l&#8217;opposition entre deux strat&#233;gies de fusion des donn&#233;es multimodales : la fusion de d&#233;cisions
(ou fusion tardive), la fusion de descripteurs (autrement nomm&#233;e fusion pr&#233;coce). La fusion de d&#233;cisions consiste
&#224; cr&#233;er autant de syst&#232;mes de classification que de modalit&#233;s et &#224; fusionner les d&#233;cisions prises s&#233;par&#233;ment pour
chacune de ces modalit&#233;s. Dans cette technique le caract&#232;re multimodal de l&#8217;information n&#8217;est que peu pris en
compte. L&#8217;objectif de la fusion de descripteurs est d&#8217;obtenir, &#224; partir de vecteurs de descripteurs extraits de cha-
cune des modalit&#233;s impliqu&#233;es, un vecteur de caract&#233;ristiques multimodal. La fusion pr&#233;coce implique d&#8217;effectuer
le choix d&#8217;une m&#233;thode pour fusionner les descripteurs et obtenir ainsi un vecteur multimodal. Le plus simple,
qui est assez largement utilis&#233;, consiste &#224; simplement concat&#233;ner les vecteurs unimodaux (La Cascia et al., 1998).
D&#8217;autre part, compte tenu de l&#8217;aspect asynchrone des donn&#233;es, &#224; la mani&#232;re de (Zhi et al., 2001), nous avons
choisi de surchantilloner les annotations multimodales en choisissant de g&#233;n&#233;rer un vecteur de descripteurs pour
chaque phon&#232;me car le phon&#232;me est la plus petite de nos unit&#233;s annot&#233;es. Notre corpus est alors constitu&#233; de 2488
exemples. &#192; chaque exemple, on associe 0 ou 1 annotation par modalit&#233;, dans la liste suivante :
</p>
<p>1. Contour Prosodique : aucun, F, RMC, RF1, mc, RT, RL, RF2, L
</p>
<p>2. Type de geste principal : aucun, beat, metaphoric, deictic, interactive, beat_beat, iconic, emblem, aborted
</p>
<p>3. Type de geste secondaire : aucun, beat, interactive, emblem, deictic, metaphoric, iconic
</p>
<p>4. Manualit&#233; : aucune, right_hand, both_hands_symmetric, left_hand, both_hands_non_symmetric</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>5. R&#233;p&#233;tition : aucune, RHEreptable, RHEreptition, DISreptable, DISreptition, LISTreptable, LISTreptition
</p>
<p>6. Cat&#233;gorie morpho-syntaxique : aucune, adverb, determiner, noun, adjective, preposition, pronoun, verb,
conjunction, interjection, auxiliary
</p>
<p>7. Groupe syntaxique : aucun, GR, GN, GA, GP, NV, PV
</p>
<p>8. Classe : Discours, Pr&#233;dication, MetaInteractionnel, Ignor&#233;e, MetaDiscursif
</p>
<p>Soit un exemple st, et st son vecteur de descripteurs multimodaux tel que : st = (s1t , s2t , &#183; &#183; &#183; , smt , &#183; &#183; &#183; , sMT ).
Chaque modalit&#233; m de l&#8217;exemple smt est repr&#233;sent&#233;e par un vecteur d&#8217;annotations s
</p>
<p>m
t tel que :
</p>
<p>smt = (a
m,1
t , a
</p>
<p>m,2
t , &#183; &#183; &#183; , am,nt , &#183; &#183; &#183; , am,N
</p>
<p>m
</p>
<p>t ) o&#249; a
m,n
t = 1 si l&#8217;annotation est affect&#233;e &#224; cet exemple dans cette
</p>
<p>modalit&#233; et am,nt = 0 sinon. Le taux de bonnes classifications de ce classifieur est de 90,63 %.
</p>
<p>Ce premier syst&#232;me, s&#8217;il obtient d&#233;j&#224; des r&#233;sultats encourageants, souffre de deux probl&#232;mes, li&#233;s au fait que
nous traitons des donn&#233;es r&#233;elles. Le premier point concerne le fait qu&#8217;il ne consid&#232;re pas diff&#233;remment l&#8217;absence
d&#8217;annotation car aucun &#233;v&#233;nement ne se produit, et l&#8217;absence d&#8217;annotation car aucun &#233;v&#233;nement ne peut &#234;tre ob-
serv&#233; (cas des donn&#233;es manquantes). (Saar-Tsechansky &amp; Provost, 2007) comparent de nombreuses solutions de
m&#233;thodes d&#8217;emputations pour l&#8217;algorithme C4.5 ; cependant, celle propos&#233;e dans Weka ne permet qu&#8217;une faible
am&#233;lioration des performances (91,08 %). Pourtant, dans nos donn&#233;es, 117 exemples ne contiennent pas d&#8217;anno-
tation des contours prosodiques, car le bruit de fond ne permet pas cette annotation. De m&#234;me, 74 exemples n&#8217;ont
aucune des trois modalit&#233;s gestuelles car la cam&#233;ra n&#8217;est pas dirig&#233;e vers l&#8217;orateur mais vers l&#8217;Assembl&#233;e. Pour
traiter ces donn&#233;es, nous proposons simplement d&#8217;affecter un poids &#233;gal &#224; chacune des annotations de la modalit&#233;
manquante : am,nt =
</p>
<p>1
|Nm| . Le score de bonnes classifications en est nettement am&#233;lior&#233;, passant &#224; 94,33 %.
</p>
<p>Le second point concerne la notion d&#8217;incertitude, qui est un probl&#232;me tr&#232;s r&#233;cemment abord&#233; en classification.
Nous citerons les travaux pr&#233;sent&#233;s dans (Chau et al., 2005) avec un classifieur &#224; base des k plus proches voisins,
ceux de (Ren et al., 2009) avec des &#171; Naives Bayes &#187;, (Qin et al., 2010) avec un syst&#232;me &#224; base de r&#232;gles, ou (Liang
et al., 2010) avec des arbres de d&#233;cision. N&#233;anmoins, dans (Chau et al., 2005; Liang et al., 2010), l&#8217;incertitude
est simul&#233;e. De plus, tous ces travaux concernent une seule modalit&#233;. Nous proposons d&#8217;introduire un degr&#233;
d&#8217;incertitude au niveau des param&#232;tres de chaque modalit&#233;. On consid&#232;re ainsi que chaque annotation peut exister,
m&#234;me si elle n&#8217;est pas mentionn&#233;e par l&#8217;annotateur (expert humain ou syst&#232;me automatique). On affecte une
valeur &#178; &#224; chaque annotation non-observ&#233;e. Dans un syst&#232;me multimodal, il va de soi que cette valeur doit &#234;tre
sp&#233;cifi&#233;e diff&#233;remment selon la modalit&#233;. En l&#8217;absence d&#8217;un corpus de d&#233;veloppement qui permettrait d&#8217;estimer
les valeurs optimales, nous avons attribu&#233; une valeur empirique &#178;m. Celle-ci a &#233;t&#233; fix&#233;e &#224; &#178;m = 0, 001 pour les
modalit&#233;s annot&#233;es manuellement, et &#178;m = 0, 015 pour les modalit&#233;s annot&#233;s automatiquement. Puisqu&#8217;on affecte
une valeur aux annotations non observ&#233;es, les valeurs des annotations observ&#233;es en sont d&#8217;autant r&#233;duites. Ainsi
am,nt = &#178;m en l&#8217;absence d&#8217;annotation, sinon a
</p>
<p>m,n
t = a
</p>
<p>m,n
t &#8722; &#955;m&#178;m o&#249; &#955;m est le nombre des annotations non
</p>
<p>observ&#233;es pour la modalit&#233; m de l&#8217;exemple st. Ce syst&#232;me permet une am&#233;lioration de la classification avec un
score de 94,98 %, soit un gain relatif de 11,46 % par rapport au syst&#232;me pr&#233;c&#233;dent.
</p>
<p>5 Conclusion
</p>
<p>Cet article se situe dans le cadre de l&#8217;&#233;tude multimodale sur corpus des strat&#233;gies mises en &#339;uvre pour contrer la
r&#233;partie dans les d&#233;bats politiques. Nous avons s&#233;lectionn&#233; et richement annot&#233; 4 minutes de l&#8217;intervention d&#8217;Y.
Cochet &#224; l&#8217;Assembl&#233;e nationale le 4 mai 2010, dans un d&#233;bat sur &#171; Le Grenelle II de l&#8217;environnement &#187;. L&#8217;analyse
argumentative, mise en correspondance avec l&#8217;analyse prosodique et gestuelle nous ont amen&#233;es &#224; proposer une
typologie des r&#233;ponses aux interruptions. Nous avons valid&#233; cette hypoth&#232;se par une classification automatique
bas&#233;e sur les annotations multimodales. Un param&#233;trage particulier a &#233;t&#233; propos&#233; pour prendre en consid&#233;ration
la sp&#233;cificit&#233; de ces donn&#233;es : multimodales, parfois manquantes et incertaines. Au terme de cette exploration
m&#233;thodologique, appara&#238;t clairement la possibilit&#233; d&#8217;asseoir la compr&#233;hension des fonctionnements argumentatifs
&#224; l&#8217;&#339;uvre dans le d&#233;bat politique sur une analyse multimodale syst&#233;matique. Bien que les annotations manuelles
soient fastidieuses, nous nous effor&#231;ons de reproduire cette approche afin de valider nos propositions sur un cor-
pus plus important. Le corpus, les annotations r&#233;alis&#233;es et une description d&#233;taill&#233;e sont d&#8217;ores et d&#233;j&#224; diffus&#233;s
librement sur le site internet du Centre de Ressources pour la Description de l&#8217;Oral d&#8217;Aix-en-Provence3.
</p>
<p>3Fiche 000729 &#224; l&#8217;adresse : http ://www.crdo.fr/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BRIGITTE BIGI CRISTEL PORTES AGN&#200;S STEUCKARDT MARION TELLIER
</p>
<p>R&#233;f&#233;rences
BAVELAS J.-B., CHOVIL N., COATES L. &amp; ROE L. (1995). Gestures specialized for dialogue. Personality and
Social Psychology Bulletin, 21, 394&#8211;405.
BERTRAND R., PORTES C. &amp; SABIO F. (2007). Distribution syntaxique, discursive et interactionnelle des
contours intonatifs du fran&#231;ais dans un corpus de conversation. Travaux neuch&#226;telois de linguistique, 47, 59&#8211;77.
BEYSSADE C. &amp; MARANDIN J.-M. (2007). French intonation and attitude attribution. In Texas Linguistics So-
ciety Conference : Issues at the Semantics-Pragmatics Interface, Somerville, MA : Denis et al. (eds.), Cascadilla
Press.
BIGI B., MEUNIER C., NESTERENKO I. &amp; BERTRAND R. (2010). Automatic detection of syllable boundaries
in spontaneous speech. In Language Resource and Evaluation Conference, La Valetta, Malte.
BLACHE P., BERTRAND R., BIGI B., BRUNO E., CELA E., ESPESSER R., FERR&#201; G., GUARDIOLA M., HIRST
D., MAGRO E.-P., MARTIN J.-C., MEUNIER C., MOREL M.-A., MURISASCO E., NESTERENKO I., NOCERA
P., PALLAUD B., PR&#201;VOT L., PRIEGO-VALVERDE B., SEINTURIER J., TAN N., TELLIER M. &amp; RAUZY S.
(2010). Multimodal annotation of conversational data. In The Fourth Linguistic Annotation Workshop, Uppsala,
Su&#232;de.
BLACHE P. &amp; RAUZY S. (2008). Influence de la qualit&#233; de l&#8217;&#233;tiquetage sur le chunking : une corr&#233;lation
d&#233;pendant de la taille des chunks. In Actes de TALN, p. 290&#8211;299, Avignon.
BONNAFOUS S. &amp; TOURNIER M. (2001). Discours et gestes t&#233;l&#233;vis&#233;s : quelles m&#233;thodes ? Mots. Les langages
du politique, 67, 110&#8211;128.
CHAU M., CHENG R. &amp; KAO B. (2005). Uncertain data mining : A new research direction. In Workshop on
the Sciences of the Artificial, Hualien, Taiwan.
DI CRISTO A. (1999). Le cadre accentuel du fran&#231;ais contemporain. Langues, 3(2), 184-205, Langues, 4(2),
258-267.
HOLMES G., DONKIN A. &amp; WITTEN I.-H. (1994). Weka : a machine learning workbench. In Second Aus-
tralian and New Zealand Conference on In Intelligent Information Systems, p. 357&#8211;361 : Intelligent Information
Systems.
LA CASCIA M., SETHI S. &amp; SCLAROFF S. (1998). Combining textual and visual cues for content-based image
retrieval on the world wide web. In IEEE Workshop on Content - Based Access of Image and Video Libraries,
Washington, DC, USA.
LAVESSON N. &amp; DAVIDSSON P. (2006). Quantifying the impact of learning algorithm parameter tuning. In The
Twenty-First National Conference on Artificial Intelligence.
LIANG C., ZHANG Y. &amp; SONG Q. (2010). Decision tree for dynamic and uncertain data streams. In 2nd Asian
Conference on Machine Learning, volume 3, p. 209&#8211;224, Tokyo, Japon.
MCNEILL D. (1992). Hand and Mind : What gestures reveal about thought. Chicago : The University of
Chicago Press.
MCNEILL D. (2005). Gesture &amp; thought. Chicago : The University of Chicago Press.
QIN B., XIA Y., SATHYESH R., PRABHAKAR S. &amp; TU Y. (2010). urule : A rule-based classification system
for uncertain data. In 10th IEEE International Conference on Data Mining Workshops, p. 1415&#8211;1418, Sydney,
Australia.
QUINLAN J.-R. (1993). C4.5 : Programs for Machine Learning. Morgan Kaufman ed.
REN J., LEE S.-D., CHEN X., KAO B., CHENG R. &amp; CHEUNG D.-W.-L. (2009). Naive bayes classification
of uncertain data. In Ninth IEEE International Conference on Data Mining, p. 944&#8211;949.
SAAR-TSECHANSKY M. &amp; PROVOST F. (2007). Handling missing values when applying classification models.
Journal of Machine Learning Research, 8, 1625&#8211;1657.
SNOEK C.-G.-M., WORRING M. &amp; SMEULDERS A.-W.-M. (2005). Early versus late fusion in semantic video
analysis. In 13th annual ACM international conference on Multimedia, p. 399&#8211;402, New York, USA.
TRAVERSO V. (2002). R&#233;plique, p. 502. Dictionnaire d&#8217;analyse de discours. Patrick Charaudeau et Dominique
Maingueneau (&#233;ds), Paris : Seuil.
ZHI Q., KAYNAK M. N., SENGUPTA K., CHEOK A.-D. &amp; KO C.-C. (2001). HMM modeling for audio-visual
speech recognition. In IEEE International Conference on Multimedia and Expo (ICME&#8217;01), p. 136&#8211;139, Los
Alamitos, CA, USA : IEEE Computer Society.</p>

</div></div>
</body></html>