<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse automatique de la modalit&#233; et du niveau de certitude : application au domaine m&#233;dical</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Analyse automatique de la modalit&#233; et du niveau de certitude :
application au domaine m&#233;dical
</p>
<p>Delphine Bernhard1 Anne-Laure Ligozat1, 2
(1) LIMSI-CNRS, B.P. 133, 91403 Orsay Cedex
</p>
<p>(2) ENSIIE, 1 square de la r&#233;sistance, 91000 &#201;vry
bernhard@limsi.fr, annlor@limsi.fr
</p>
<p>R&#233;sum&#233;. De nombreux ph&#233;nom&#232;nes linguistiques visent &#224; exprimer le doute ou l&#8217;incertitude de l&#8217;&#233;noncia-
teur, ainsi que la subjectivit&#233; potentielle du point de vue. La prise en compte de ces informations sur le niveau de
certitude est primordiale pour de nombreuses applications du traitement automatique des langues, en particulier
l&#8217;extraction d&#8217;information dans le domaine m&#233;dical. Dans cet article, nous pr&#233;sentons deux syst&#232;mes qui analysent
automatiquement les niveaux de certitude associ&#233;s &#224; des probl&#232;mes m&#233;dicaux mentionn&#233;s dans des compte-rendus
cliniques en anglais. Le premier syst&#232;me proc&#232;de par apprentissage supervis&#233; et obtient une f-mesure de 0,93. Le
second syst&#232;me utilise des r&#232;gles d&#233;crivant des d&#233;clencheurs linguistiques sp&#233;cifiques et obtient une f-mesure de
0,90.
</p>
<p>Abstract. Many linguistic phenomena aim at expressing the speaker&#8217;s doubt or incertainty, as well as
the potential subjectivity of the point of view. Most natural language processing applications, and in particular
knowledge extraction in the medical domain, need to take this type of information into account. In this article,
we describe two systems which automatically analyse the levels of certainty associated with medical problems
mentioned in English clinical reports. The first system uses supervised machine learning and obtains an f-measure
of 0.93. The second system relies on a set of rules decribing specific linguistic triggers and reaches an f-measure
of 0.90.
</p>
<p>Mots-cl&#233;s : Modalit&#233; &#233;pist&#233;mique, Niveau de certitude, Domaine m&#233;dical.
</p>
<p>Keywords: Epistemic modality, Certainty level, Medical domain.
</p>
<p>1 Introduction
</p>
<p>En traitement automatique des langues, les informations contenues dans les textes sont souvent consid&#233;r&#233;es comme
affirm&#233;es et v&#233;rifi&#233;es. Or, de nombreux ph&#233;nom&#232;nes linguistiques visent &#224; exprimer le doute ou l&#8217;incertitude de
l&#8217;&#233;nonciateur, ainsi que la subjectivit&#233; potentielle du point de vue. Il y a ainsi une gradation dans les niveaux de
certitude associ&#233;s &#224; une information : elle peut &#234;tre vraie, possible ou fausse. Une information peut &#233;galement
n&#8217;&#234;tre vraie que dans certaines conditions, ou &#234;tre hypoth&#233;tique.
</p>
<p>Dans certains domaines, il est particuli&#232;rement important de savoir si l&#8217;information donn&#233;e dans un document est
certaine ou pas. Par exemple dans le domaine m&#233;dical, si l&#8217;on tente d&#8217;analyser des relations entre un m&#233;dicament
et des sympt&#244;mes d&#233;crites dans un texte, il est n&#233;cessaire de savoir si le sympt&#244;me est pr&#233;sent ou pas, ou encore s&#8217;il
est susceptible d&#8217;&#234;tre d&#233;velopp&#233; par le patient. En questions-r&#233;ponses, notamment sur des corpus de documents
issus du web, le niveau de certitude d&#8217;une information peut &#233;galement &#234;tre utile : une r&#233;ponse comme &#171;La tour
Eiffel est une tour de 327 m&#232;tres de hauteur&#187; &#224; la question &#171;Quelle est la taille de la tour Eiffel&#187; est plus pr&#233;cise
que la r&#233;ponse &#171;Je pense que la tour Eiffel fait environ 300 m&#232;tres&#187; et devra &#234;tre consid&#233;r&#233;e comme plus fiable.
</p>
<p>Ces divers aspects ne sont encore que tr&#232;s rarement pris en compte dans les applications d&#233;velopp&#233;es actuellement
en traitement automatique des langues, m&#234;me s&#8217;il existe des travaux r&#233;cents visant &#224; d&#233;tecter l&#8217;incertitude, la
modalit&#233; &#233;pist&#233;mique, la sp&#233;culation ou encore les opinions.
</p>
<p>Dans cet article, nous nous int&#233;ressons &#224; l&#8217;analyse automatique de la modalit&#233; et du niveau de certitude dans
le domaine m&#233;dical. Plus particuli&#232;rement, nous nous attachons &#224; &#233;tudier ces ph&#233;nom&#232;nes lorsqu&#8217;ils portent sur
des probl&#232;mes m&#233;dicaux (maladies, syndromes, virus, bact&#233;ries, sympt&#244;mes) mentionn&#233;s dans des compte-rendus</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, ANNE-LAURE LIGOZAT
</p>
<p>cliniques en anglais afin de savoir si le probl&#232;me est pr&#233;sent, absent, hypoth&#233;tique, soumis &#224; certaines conditions,
ou encore associ&#233; &#224; une personne diff&#233;rente du patient dont il est question. Nous utilisons pour ce faire des donn&#233;es
produites et annot&#233;es dans le cadre du challenge international i2b2/VA 2010 1.
</p>
<p>L&#8217;article est organis&#233; comme suit : nous d&#233;taillons dans un premier temps l&#8217;&#233;tat de l&#8217;art (section 2). Puis nous
d&#233;crivons les donn&#233;es utilis&#233;es (section 3). Dans la section 4, nous pr&#233;sentons nos deux syst&#232;mes et exposons les
r&#233;sultats de leur &#233;valuation dans la section 5.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>Les notions de modalit&#233; et de niveau de certitude couvrent des ph&#233;nom&#232;nes linguistiques vari&#233;s qu&#8217;il est n&#233;ces-
saire de prendre en compte pour effectuer une analyse s&#233;mantique profonde des textes. Apr&#232;s une mise au point
terminologique, nous d&#233;taillons le traitement de ces probl&#233;matiques pour la fouille d&#8217;opinion et l&#8217;extraction d&#8217;in-
formations dans le domaine m&#233;dical.
</p>
<p>2.1 Mise au point terminologique
</p>
<p>La modalit&#233; est d&#233;finie par Lapaire &amp; Rotg&#233; (1998) comme &#171; une prise de position concernant la valeur de v&#233;rit&#233;
d&#8217;une proposition &#187; et &#171; la mani&#232;re dont un sujet pensant et parlant se prononce sur un contenu propositionnel &#187;.
Dans cet article, nous nous int&#233;ressons plus particuli&#232;rement &#224; la modalit&#233; &#233;pist&#233;mique qui traduit le niveau de
certitude de l&#8217;&#233;nonciateur par rapport &#224; l&#8217;&#233;nonc&#233;. Cette notion est &#224; rapprocher des proc&#233;d&#233;s euph&#233;mistiques (en
anglais, hedging) qui visent &#224; att&#233;nuer ou &#224; moduler la force d&#8217;une assertion.
</p>
<p>De nombreux marqueurs textuels servent &#224; exprimer le degr&#233; de certitude de l&#8217;&#233;nonciateur : adjectifs &#233;pist&#233;miques
(&#171; possible &#187;, &#171; impossible &#187;), adverbes &#233;pist&#233;miques (&#171; probablement &#187;), verbes (&#171; savoir &#187;, &#171; croire &#187;) et locutions
verbales (&#171; il est possible que &#187;), propositions conditionnelles, etc (Rubin et al., 2006; Rubin, 2007; Saur&#237; &amp;
Pustejovsky, 2009).
</p>
<p>Rubin (2010) distingue cinq niveaux de certitude : absolue, &#233;lev&#233;e, mod&#233;r&#233;e, faible et incertaine. &#192; ces niveaux
de certitude sont associ&#233;es diverses dimensions contextuelles : perspective (point de vue de l&#8217;auteur / discours
rapport&#233;), focus (opinion / faits) et temporalit&#233; (pass&#233;, pr&#233;sent, futur, hors de propos ou ambigu). L&#8217;annotation
manuelle de 2 243 phrases issues d&#8217;articles de journaux en anglais selon cette typologie a montr&#233; que plus de
la moiti&#233; des phrases contiennent des marqueurs de modalit&#233; &#233;pist&#233;mique, avec 1 727 occurrences de marqueurs,
class&#233;s dans 47 classes syntaxico-s&#233;mantiques (Rubin, 2010). Les marqueurs les plus fr&#233;quents sont les auxiliaires
modaux (&#171; must &#187;, &#171; could &#187;), les adjectifs superlatifs et les adverbes intensifieurs (&#171; much &#187;, &#171; so &#187;).
</p>
<p>Saur&#237; &amp; Pustejovsky (2009) d&#233;finissent quant &#224; eux les notions de fait av&#233;r&#233; (fact) et fait non av&#233;r&#233; (counterfact),
modul&#233;s par un niveau de certitude (certain, probable, possible). Ces cat&#233;gories ont &#233;t&#233; utilis&#233;es pour l&#8217;annotation
du corpus anglais FactBank.
</p>
<p>2.2 Fouille d&#8217;opinion
</p>
<p>La fouille d&#8217;opinion vise &#224; d&#233;tecter de mani&#232;re automatique les unit&#233;s textuelles (mots, syntagmes, phrases ou
textes) qui portent une marque de subjectivit&#233; et &#224; d&#233;terminer leur polarit&#233; ou orientation (positive, n&#233;gative ou
mixte) (Pang &amp; Lee, 2008). Les syst&#232;mes de fouille d&#8217;opinion utilisent souvent des lexiques affectifs regroupant
des mots et expressions subjectifs, associ&#233;s &#224; leur polarit&#233; et &#233;ventuellement l&#8217;intensit&#233; de leur orientation. L&#8217;uti-
lisation en contexte de tels lexiques n&#233;cessite la prise en compte des ph&#233;nom&#232;nes linguistiques pouvant modifier
l&#8217;orientation a priori des expressions subjectives. Ces ph&#233;nom&#232;nes incluent notamment la modification adver-
biale, conduisant &#224; une modulation de l&#8217;intensit&#233; d&#8217;une opinion (&#171; bon &#187;, &#171; tr&#232;s bon &#187;), voire son inversion par des
adverbes de n&#233;gation (&#171; bien &#187;, &#171; pas bien &#187;). En pratique, les ph&#233;nom&#232;nes de n&#233;gation sont identifi&#233;s par diverses
heuristiques. Ainsi, Pang et al. (2002) marquent les mots modifi&#233;s par une n&#233;gation s&#8217;ils apparaissent entre un n&#233;-
gateur et une marque de ponctuation. Na et al. (2005) utilisent quant &#224; eux des patrons syntaxiques pour identifier
de mani&#232;re plus pr&#233;cise les expressions incluant un n&#233;gateur.
</p>
<p>1. https://www.i2b2.org/NLP/Relations/Main.php</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE AUTOMATIQUE DE LA MODALIT&#201; ET DU NIVEAU DE CERTITUDE
</p>
<p>L&#8217;analyse automatique de la subjectivit&#233; est &#233;galement influenc&#233;e par d&#8217;autres ph&#233;nom&#232;nes, tels que la pr&#233;sence
d&#8217;une proposition conditionnelle (Narayanan et al., 2009). Une phrase conditionnelle peut contenir des expressions
subjectives sans pour autant formuler une opinion (ex : &#171; Si cet auteur &#233;crit un bon livre, je l&#8217;ach&#232;terai &#187;). D&#8217;autre
part, l&#8217;opinion exprim&#233;e est souvent d&#233;termin&#233;e conjointement par la proposition conditionnelle et le cons&#233;quent
(ex : &#171; Si tu veux lire un bon livre, je te conseille celui-ci &#187;). L&#8217;analyse de phrases conditionnelles en fouille
d&#8217;opinion repose en g&#233;n&#233;ral sur des crit&#232;res sp&#233;cifiques, tels que le temps des verbes ou la pr&#233;sence de connecteurs
conditionnels.
</p>
<p>2.3 Extraction d&#8217;information en domaine biom&#233;dical
</p>
<p>En domaine biom&#233;dical, il est particuli&#232;rement important d&#8217;analyser la modalit&#233; et le niveau de certitude car les
formes modalisatrices sont tr&#232;s largement utilis&#233;es dans les documents biom&#233;dicaux pour indiquer des impres-
sions, des explications possibles ou des r&#233;sultats n&#233;gatifs (Vincze et al., 2008), comme le montrent les exemples
suivants :
&#8211; &#171;These findings that may be from an acute pneumonia include minimal bronchiectasis as well.&#187;
&#8211; &#171;Stable appearance the right kidney without hydronephrosis.&#187;
&#8211; &#171;The treatment seems to be successful.&#187;
&#8211; &#171;Right upper lobe volume loss and probably pneumonia.&#187;
Diff&#233;rents niveaux de certitude peuvent &#234;tre distingu&#233;s. Le niveau le plus trait&#233; est celui de la n&#233;gation, mais une
gradation plus fine peut &#233;galement &#234;tre utilis&#233;e avec, par exemple, des niveaux signalant une possibilit&#233; ou une
condition. La d&#233;tection du niveau de certitude peut se faire soit au niveau global de la phrase, soit &#224; l&#8217;int&#233;rieur
d&#8217;une phrase.
</p>
<p>Concernant la n&#233;gation, sa d&#233;tection dans les documents biom&#233;dicaux a &#233;t&#233; largement &#233;tudi&#233;e. Chapman et al.
(2001) ont propos&#233; un algorithme appel&#233; NegEx d&#233;tectant les n&#233;gations et identifiant les termes m&#233;dicaux dans
la port&#233;e d&#8217;une n&#233;gation 2. Le principe est le suivant : les d&#233;clencheurs de n&#233;gation sont annot&#233;s dans la phrase
(comme par exemple &#171;no&#187; ou &#171;denies&#187;) et r&#233;partis en deux classes selon qu&#8217;ils apparaissent avant ou apr&#232;s les
termes dans leur port&#233;e (les deux d&#233;clencheurs pr&#233;c&#233;dents apparaissent par exemple avant les termes qu&#8217;ils qua-
lifient) ; des pseudo-d&#233;clencheurs sont &#233;galement annot&#233;s, c&#8217;est-&#224;-dire des termes contenant des d&#233;clencheurs de
n&#233;gation, mais qui n&#8217;en sont pas, comme &#171;no increase&#187;. Puis les port&#233;es de ces d&#233;clencheurs sont d&#233;finies : par d&#233;-
faut, la port&#233;e d&#8217;un d&#233;clencheur va de ce d&#233;clencheur &#224; la fin (ou au d&#233;but) de la phrase, mais peut &#234;tre interrompue
par la pr&#233;sence d&#8217;un autre d&#233;clencheur ou d&#8217;un d&#233;clencheur de fin de clause (comme par exemple &#171;presenting&#187;,
qui marque la fin de port&#233;e de &#171;History&#187; dans la phrase &#171;History of COPD, presenting with shortness of breath&#187;).
</p>
<p>Mutalik et al. (2001) ont &#233;galement propos&#233; un outil de d&#233;tection des n&#233;gations dans des documents m&#233;dicaux. Des
marqueurs de n&#233;gation sont rep&#233;r&#233;s puis une grammaire associe ces marqueurs avec des concepts. Enfin, Huang &amp;
Lowe (2007) ont utilis&#233; une approche mixte combinant des expressions r&#233;guli&#232;res et une analyse syntaxique. Le
traitement de la n&#233;gation est &#233;galement inclus dans certains syst&#232;mes plus g&#233;n&#233;raux comme le syst&#232;me Medical
Language Extraction and Encoding (MedLEE) (Friedman et al., 1994).
</p>
<p>D&#8217;autres travaux concernent de fa&#231;on plus g&#233;n&#233;rale le traitement de la modalit&#233;. La premi&#232;re &#233;tude analysant ce
probl&#232;me d&#8217;un point de vue linguistique et informatique est celle de Light et al. (2004) ; les auteurs ont analys&#233;
les marqueurs de modalit&#233; dans des r&#233;sum&#233;s d&#8217;articles scientifiques m&#233;dicaux issus de PubMed 3, annot&#233; manuel-
lement des phrases selon la pr&#233;sence de modalisation et entra&#238;n&#233; un classifieur &#224; d&#233;tecter de telles phrases dans
des r&#233;sum&#233;s d&#8217;articles. Plusieurs travaux se sont &#233;galement int&#233;ress&#233;s &#224; la classification de phrases en fonction de
la pr&#233;sence de modalit&#233;. Medlock &amp; Briscoe (2007) se fondent sur une approche faiblement supervis&#233;e pour cette
classification, et utilisent uniquement les mots des phrases comme attributs. Leur classification obtient un point
d&#8217;&#233;quilibre (break-even point ou BEP) entre rappel et pr&#233;cision de 0,76. Ils ont par ailleurs rendu public le cor-
pus d&#8217;articles scientifiques biologiques qu&#8217;ils utilisent dans leurs travaux. Szarvas (2008) a &#233;tendu cette approche
en ajoutant les bigrammes et trigrammes aux attributs du classifieur, en s&#233;lectionnant les attributs pour r&#233;duire le
nombre de mots-cl&#233;s candidats et en ajoutant des listes de mots-cl&#233;s externes, pour obtenir un BEP de 0,85. Kilico-
glu &amp; Bergler (2008) soulignent le r&#244;le de la syntaxe dans la d&#233;tection des marqueurs de modalit&#233;, et ajoutent aux
attributs des informations syntaxiques sur les relations de d&#233;pendance afin de tenir compte du contexte syntaxique
des marqueurs.
</p>
<p>2. Cet outil nous a servi de syst&#232;me de r&#233;f&#233;rence lors de notre &#233;valuation.
3. http://www.ncbi.nlm.nih.gov/pubmed</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, ANNE-LAURE LIGOZAT
</p>
<p>Une limitation des ces travaux est qu&#8217;ils ne consid&#232;rent la modalit&#233; qu&#8217;au niveau des phrases, alors que plusieurs
modalit&#233;s peuvent en r&#233;alit&#233; &#234;tre pr&#233;sentes dans une m&#234;me phrase comme le notent par exemple Wilbur et al.
(2006). Un niveau de d&#233;tection plus pr&#233;cis consiste &#224; identifier des marqueurs de modalit&#233; et leur port&#233;e. Ainsi,
dans l&#8217;exemple &#171;Right upper lobe volume loss and probably pneumonia.&#187;, &#171;probably&#187; est un marqueur de mo-
dalit&#233; dont la port&#233;e est le seul terme &#171;pneumonia&#187;. Le corpus BioScope (Vincze et al., 2008) a &#233;t&#233; utilis&#233; pour
&#233;valuer la reconnaissance de telles informations, notamment dans le cadre de la t&#226;che d&#8217;&#233;valuation &#171;Learning
to detect hedges and their scope in natural language text&#187; &#224; CoNLL 2010 4. Morante &amp; Daelemans (2009) par
exemple ont consid&#233;r&#233; la d&#233;tection des marqueurs et de leur port&#233;e comme un probl&#232;me de classification super-
vis&#233;e, en entra&#238;nant et combinant plusieurs classifieurs. Ils obtiennent une f-mesure de 0,85 pour la d&#233;tection des
marqueurs, et de 0,66 pour la d&#233;tection des port&#233;es de ces marqueurs.
</p>
<p>Comme nous venons de le montrer, l&#8217;analyse de la modalit&#233; et du niveau de certitude a fait l&#8217;objet de divers
travaux dans le domaine biom&#233;dical. Les m&#233;thodes utilis&#233;es sont soit &#224; base de r&#232;gles et de lexiques, soit &#224; base
d&#8217;apprentissage, lorsqu&#8217;il existe des donn&#233;es annot&#233;es en quantit&#233; suffisante. Dans cet article, nous d&#233;crivons
et comparons de mani&#232;re d&#233;taill&#233;e deux m&#233;thodes diff&#233;rentes pour une t&#226;che pr&#233;cise, &#224; savoir la classification
d&#8217;assertions portant sur des probl&#232;mes m&#233;dicaux en anglais.
</p>
<p>3 Description des donn&#233;es
</p>
<p>Nous nous sommes int&#233;ress&#233;es &#224; la d&#233;tection de modalit&#233; et du niveau de certitude intra-phrases dans le cadre
de la campagne d&#8217;&#233;valuation i2b2 2010 5. L&#8217;objectif d&#8217;une des t&#226;ches de cette campagne &#233;tait la classification
d&#8217;assertions relatives &#224; des probl&#232;mes m&#233;dicaux. Il s&#8217;agissait donc de donner une valeur de certitude ou de modalit&#233;
&#224; des concepts m&#233;dicaux qui avaient &#233;t&#233; pr&#233;alablement annot&#233;s dans des compte-rendus de patients.
</p>
<p>Plut&#244;t que de calculer la port&#233;e de chaque marqueur possible de modalit&#233;, l&#8217;accent est mis ici sur les concepts
&#233;tudi&#233;s, pour lequels on cherche &#224; conna&#238;tre une modalit&#233;. Nous d&#233;taillerons dans cette section les donn&#233;es que
nous avons utilis&#233;es pour nos exp&#233;riences, puis pr&#233;senterons dans la section suivante les deux syst&#232;mes d&#8217;analyse
d&#233;velopp&#233;s.
</p>
<p>3.1 Corpus
</p>
<p>Les corpus sont compos&#233;s de 826 compte-rendus m&#233;dicaux en langue anglaise provenant de trois h&#244;pitaux am&#233;ri-
cains. Ils ont pr&#233;alablement &#233;t&#233; annot&#233;s en concepts 6, qui sont :
&#8211; les probl&#232;mes m&#233;dicaux, d&#233;finis comme les observations concernant le corps ou l&#8217;esprit du patient et consid&#233;-
</p>
<p>r&#233;es comme anormales ou provoqu&#233;es par une maladie, ce qui englobe les maladies, syndromes, virus, bact&#233;ries,
sympt&#244;mes...
</p>
<p>&#8211; les traitements, regroupant les proc&#233;dures, interventions ou m&#233;dicaments donn&#233;s au patient pour r&#233;soudre un
probl&#232;me m&#233;dical ;
</p>
<p>&#8211; les tests, c&#8217;est-&#224;-dire les proc&#233;dures ou mesures faites sur le patient pour trouver des informations sur un pro-
bl&#232;me m&#233;dical.
</p>
<p>Ces compte-rendus ont &#233;galement &#233;t&#233; anonymis&#233;s, afin de supprimer les noms de personne, de lieu, les adresses,
et autres informations g&#233;ographiques pr&#233;cises, les dates relatives &#224; un individu comme une date de naissance, les
num&#233;ros de t&#233;l&#233;phone et fax, les courriels, les num&#233;ros de s&#233;curit&#233; sociale etc. Dans les documents, toutes ces
informations sont remplac&#233;es par des balises g&#233;n&#233;riques comme &#171;NAME&#187;, &#171;ADDRESS&#187;, ou encore &#171;AGE&#187;.
</p>
<p>3.2 Cat&#233;gories d&#8217;assertions
</p>
<p>Une classe d&#8217;assertion a &#233;t&#233; attribu&#233;e &#224; chaque probl&#232;me m&#233;dical du corpus. Six cat&#233;gories d&#8217;assertions ont &#233;t&#233;
d&#233;finies :
</p>
<p>4. http://www.inf.u-szeged.hu/rgai/conll2010st/
5. https://www.i2b2.org/NLP/Relations/Main.php
6. Pour une m&#233;thode d&#8217;annotation automatique des concepts, voir (Minard et al., 2011).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE AUTOMATIQUE DE LA MODALIT&#201; ET DU NIVEAU DE CERTITUDE
</p>
<p>&#8211; pr&#233;sent : le probl&#232;me associ&#233; au patient est pr&#233;sent. C&#8217;est &#233;galement la cat&#233;gorie par d&#233;faut pour les probl&#232;mes
m&#233;dicaux qui n&#8217;ont pu &#234;tre class&#233;s dans une autre cat&#233;gorie.
Exemples : &#171;the wound was noted to be clean with mild serious drainage&#187;, &#171;history of chest pain&#187;
</p>
<p>&#8211; absent : le patient ne pr&#233;sente pas ce probl&#232;me. Cette cat&#233;gorie inclut les probl&#232;mes r&#233;solus.
Exemples : &#171;patient denies pain&#187;, &#171;history inconsistent with stroke&#187;
</p>
<p>&#8211; possible : le patient peut avoir le probl&#232;me, mais ce n&#8217;est pas certain.
Exemples : &#171;this is very likely to be an asthma exacerbation&#187;, &#171;We suspect this is not pneumonia&#187;
</p>
<p>&#8211; conditionnel : le patient ne rencontre le probl&#232;me que dans certaines conditions, comprenant en particulier les
allergies.
Exemples : &#171;Penicillin causes a rash&#187;, &#171;patient reports shortness of breath upon climbing stairs&#187;
</p>
<p>&#8211; hypoth&#233;tique : le patient est susceptible de d&#233;velopper le probl&#232;me dans le futur.
Exemples : &#171;if you experience wheezing or shortness of breath&#187;, &#171;ativan 0.25 to 0.5 mg IV q 4 to 6 hours prn
anxiety&#187;
</p>
<p>&#8211; associ&#233; &#224; quelqu&#8217;un d&#8217;autre : le probl&#232;me concerne quelqu&#8217;un d&#8217;autre que le patient.
Exemples : &#171;Family history of prostate cancer&#187;, &#171;brother had asthma&#187;
</p>
<p>Cat&#233;gorie d&#8217;assertion Corpus d&#8217;entra&#238;nement Corpus d&#8217;&#233;valuation
Pr&#233;sent 8 052 13 025
Absent 2 536 3 609
Possible 535 883
Conditionnel 103 171
Hypoth&#233;tique 651 717
Associ&#233; &#224; qqun d&#8217;autre 92 145
Total 11 969 18 550
</p>
<p>TABLE 1 &#8211; Nombre d&#8217;assertions par cat&#233;gorie dans les corpus d&#8217;entra&#238;nement et d&#8217;&#233;valuation
</p>
<p>La table 1 d&#233;taille le nombre d&#8217;assertions annot&#233;es pour chaque cat&#233;gorie dans les corpus d&#8217;entra&#238;nement et d&#8217;&#233;va-
luation. La majorit&#233; des probl&#232;mes m&#233;dicaux &#233;voqu&#233;s dans les documents sont pr&#233;sents : 67% des assertions
appartiennent &#224; cette cat&#233;gorie. La r&#233;partition des diverses cat&#233;gories est donc tr&#232;s d&#233;s&#233;quilibr&#233;e.
</p>
<p>Les organisateurs d&#8217;i2b2 ont calcul&#233; l&#8217;accord inter-annotateur sur le corpus d&#8217;entra&#238;nement, annot&#233; par 12 annota-
teurs. Cette information, pr&#233;sent&#233;e dans la table 2, est int&#233;ressante car elle montre que pour certaines cat&#233;gories,
les annotateurs ont fait des choix d&#8217;annotation relativement diff&#233;rents. L&#8217;accord inter-annotateurs sur l&#8217;ensemble
des cat&#233;gories est &#233;lev&#233;, mais pour certaines cat&#233;gories notamment &#171;conditionnel&#187;, il est tr&#232;s faible. On peut donc
supposer que les r&#233;sultats obtenus par des syst&#232;mes automatiques seront &#233;galement plus faibles pour ces cat&#233;go-
ries.
</p>
<p>Cat&#233;gorie d&#8217;assertion Accord
Pr&#233;sent 0,89
Absent 0,94
Possible 0,60
Conditionnel 0,44
Hypoth&#233;tique 0,79
Associ&#233; &#224; qqun d&#8217;autre 0,89
Total 0,91
</p>
<p>TABLE 2 &#8211; Accords inter-annotateurs pour chaque cat&#233;gorie d&#8217;assertion
</p>
<p>4 Description des syst&#232;mes
</p>
<p>Dans cette section, nous d&#233;crivons tout d&#8217;abord les syst&#232;mes de r&#233;f&#233;rence (ou baseline) et les r&#233;sultats qu&#8217;ils
obtiennent. Puis nous d&#233;taillons les syst&#232;mes que nous avons d&#233;velopp&#233;s afin d&#8217;identifier de mani&#232;re automatique
la cat&#233;gorie d&#8217;assertion associ&#233;e &#224; un probl&#232;me m&#233;dical.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, ANNE-LAURE LIGOZAT
</p>
<p>4.1 R&#233;f&#233;rences
</p>
<p>Nous avons consid&#233;r&#233; plusieurs r&#233;f&#233;rences pour &#233;valuer l&#8217;apport de nos syst&#232;mes :
&#8211; la premi&#232;re m&#233;thode de r&#233;f&#233;rence consiste &#224; tout &#233;tiqueter comme &#171; pr&#233;sent &#187;, ce qui donne une f-mesure totale
</p>
<p>de 0,67 (proportion de pr&#233;sents dans le corpus) ;
&#8211; la deuxi&#232;me r&#233;f&#233;rence consiste &#224; utiliser le syst&#232;me NegEx 7 sans aucune modification, qui n&#8217;annote donc que
</p>
<p>les cat&#233;gories &#171;pr&#233;sent&#187; et &#171;absent&#187;, ce qui donne une f-mesure de 0,83 ;
&#8211; la troisi&#232;me r&#233;f&#233;rence consiste &#224; utiliser le syst&#232;me ConText (extension de NegEx pour tenir compte de la
</p>
<p>cat&#233;gorie associ&#233; &#224; quelqu&#8217;un d&#8217;autre) sans aucune modification, donc sans les cat&#233;gories &#171;possible&#187;, &#171;condi-
tionnel&#187; et &#171;hypoth&#233;tique&#187;, ce qui donne une f-mesure de 0,86.
</p>
<p>4.2 Pr&#233;traitements
</p>
<p>4.2.1 Annotation des concepts
</p>
<p>Nous avions &#224; notre disposition l&#8217;annotation en concepts faite manuellement par les organisateurs d&#8217;i2b2. Nous
avons donc annot&#233; les documents en balisant les termes qui correspondaient &#224; un concept m&#233;dical reconnu, c&#8217;est-
&#224;-dire &#224; un probl&#232;me, un traitement ou un test.
</p>
<p>4.2.2 Traitement des coordinations
</p>
<p>L&#8217;&#233;tude des donn&#233;es de d&#233;veloppement a montr&#233; que de nombreux concepts sont coordonn&#233;s &#224; l&#8217;aide de virgules
ou de conjonctions de coordination, comme par exemple &#171; pleural effusion or pneumothorax &#187;. Nos deux syst&#232;mes
utilisent les contextes directs des concepts, sous forme de fen&#234;tre de mots, afin d&#8217;identifier la cat&#233;gorie de l&#8217;as-
sertion. La pr&#233;sence de s&#233;quences de concepts coordonn&#233;s peut donc conduire &#224; la prise en compte d&#8217;un contexte
gauche ou droit r&#233;duit, comportant principalement d&#8217;autres probl&#232;mes coordonn&#233;s. Dans ce cas, des indices es-
sentiels pour l&#8217;identification de la cat&#233;gorie de l&#8217;assertion peuvent se trouver en dehors de la fen&#234;tre contextuelle
consid&#233;r&#233;e. Le r&#244;le important de la coordination a &#233;galement &#233;t&#233; d&#233;montr&#233; pour une autre t&#226;che d&#8217;extraction d&#8217;in-
formation, l&#8217;extraction d&#8217;&#233;v&#233;nements (Kilicoglu &amp; Bergler, 2009). Nous avons donc pr&#233;-tra&#238;t&#233; les donn&#233;es pour
identifier les s&#233;quences de concepts coordonn&#233;s et ainsi red&#233;finir les fen&#234;tres contextuelles utilis&#233;es : les fen&#234;tres
gauches se terminent au d&#233;but d&#8217;une s&#233;quence de concepts coordonn&#233;s tandis que les fen&#234;tres droites d&#233;butent &#224;
la fin d&#8217;une s&#233;quence de concepts. Ces fen&#234;tres contextuelles sont partag&#233;es par tous les concepts qui apparaissent
dans la m&#234;me s&#233;quence. Plus de la moiti&#233; des concepts &#233;taient inclus dans une coordination de concepts dans le
corpus d&#8217;entra&#238;nement.
</p>
<p>4.3 Syst&#232;me par apprentissage supervis&#233;
</p>
<p>Le syst&#232;me par apprentissage supervis&#233; consid&#232;re l&#8217;identification d&#8217;assertions comme une t&#226;che de classification.
Nous avons entra&#238;n&#233; une machine &#224; vecteurs de support (SVM) avec libsvm (Chang &amp; Lin, 2001) sur la base d&#8217;at-
tributs binaires et d&#8217;un noyau RBF 8. Les param&#232;tres optimaux ont &#233;t&#233; s&#233;lectionn&#233;s automatiquement par validation
crois&#233;e en 5 sous-ensembles 9. Pour le d&#233;veloppement du syst&#232;me, nous avons utilis&#233; un corpus d&#8217;entra&#238;nement de
241 fichiers et un corpus de test de 54 fichiers.
</p>
<p>Nous avons utilis&#233; quatre types d&#8217;attributs :
&#8211; attributs contextuels lexicalis&#233;s : mots et mots d&#233;suffix&#233;s dans une fen&#234;tre de cinq mots &#224; gauche et &#224; droite
</p>
<p>du concept cible. Nous avons &#233;galement effectu&#233; des exp&#233;riences compl&#233;mentaires avec les &#233;tiquettes morpho-
syntaxiques mais celles-ci n&#8217;apportent pas d&#8217;am&#233;liorations significatives ;
</p>
<p>7. http://code.google.com/p/negex/
8. Il aurait &#233;galement &#233;t&#233; possible d&#8217;utiliser les CRF (Conditional Random Fields) afin d&#8217;&#233;tiqueter de mani&#232;re plus pr&#233;cise les d&#233;clencheurs
</p>
<p>et leur port&#233;e. Toutefois, ces annotations n&#8217;&#233;taients pas fournies dans le corpus d&#8217;apprentissage et il aurait donc &#233;t&#233; n&#233;cessaire d&#8217;utiliser un
corpus externe, comme Bioscope par exemple (Vincze et al., 2008). Or, seules les cat&#233;gories de n&#233;gation et de sp&#233;culation sont annot&#233;es dans
Bioscope. Nous avons donc renonc&#233; &#224; cette possibilit&#233;.
</p>
<p>9. Cette &#233;tape a &#233;t&#233; r&#233;alis&#233;e de mani&#232;re automatique en utilisant le script easy.py fourni avec libsvm.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE AUTOMATIQUE DE LA MODALIT&#201; ET DU NIVEAU DE CERTITUDE
</p>
<p>&#8211; d&#233;clencheurs : nous avons utilis&#233; les d&#233;clencheurs d&#233;finis pour le syst&#232;me &#224; base de r&#232;gles (voir section sui-
vante), avec quelques d&#233;clencheurs suppl&#233;mentaires. Ces d&#233;clencheurs sont identifi&#233;s dans une fen&#234;tre de cinq
mots &#224; gauche et &#224; droite du concept cible. Nous avons &#233;galement identifi&#233; quelques d&#233;clencheurs internes au
concept, tels que &#171; on exertion &#187; (&#171; &#224; l&#8217;effort &#187;) qui indique la cat&#233;gorie conditionnel ;
</p>
<p>&#8211; attributs internes au concept cible : mots et mots d&#233;suffix&#233;s formant le concept et pr&#233;sence du pr&#233;fixe &#171; non &#187;
dans un des mots ;
</p>
<p>&#8211; attributs sp&#233;cifiques &#224; une s&#233;quence de concepts coordonn&#233;s. Dans le cas o&#249; le concept cible appara&#238;t dans
une s&#233;quence de concepts coordonn&#233;s, nous utilisons des attributs sp&#233;cifiques qui correpondent aux mots et aux
mots d&#233;suffix&#233;s de la s&#233;quence. Par exemple, pour la s&#233;quence &#171; pleural effusion or pneumothorax &#187;, les mots
&#171; pneumothorax &#187;, &#171; pleural &#187; et &#171; effusion &#187; ainsi que la racine &#171; effus &#187; sont utilis&#233;s comme attributs.
</p>
<p>4.4 Syst&#232;me &#224; base de r&#232;gles
</p>
<p>L&#8217;algorithme utilis&#233; est tr&#232;s proche de celui de NegEx (voir section 2.3) mais est &#233;tendu aux six cat&#233;gories d&#8217;asser-
tions &#224; d&#233;tecter. Quatre types de d&#233;clencheurs ont &#233;t&#233; d&#233;finis (les exemples suivants sont donn&#233;s pour la cat&#233;gorie
&#171;absent&#187;) :
&#8211; ceux qui pr&#233;c&#232;dent le probl&#232;me comme &#171;denies&#187;, &#171;never had&#187; ou &#171;negative for&#187; ;
&#8211; ceux qui suivent le probl&#232;me comme &#171;was ruled out&#187;, &#171;is absent&#187; ou &#171;was stopped&#187; ;
&#8211; ceux qui sont inclus dans le probl&#232;me comme &#171;afebrile&#187; (dans le cas, le d&#233;clencheur est le probl&#232;me lui-m&#234;me)
</p>
<p>ou &#171;allergy&#187; ;
&#8211; ceux qui limitent la port&#233;e d&#8217;un des d&#233;clencheurs pr&#233;c&#233;dents, comme &#171;but&#187;.
Un m&#234;me terme peut &#234;tre de plusieurs types : ainsi, &#171;ruled out&#187; peut pr&#233;c&#233;der ou suivre le probl&#232;me associ&#233;. Les
termes de &#171;pseudo-n&#233;gation&#187; de NegEx (qui ressemblent &#224; des termes de n&#233;gation mais n&#8217;en sont pas comme la
double n&#233;gation &#171;not ruled out&#187;) ne constituent pas un type distinct dans notre syst&#232;me, mais sont &#233;limin&#233;s en
v&#233;rifiant le contexte des termes de n&#233;gation (par exemple on v&#233;rifiera que le mot &#171;not&#187; ne pr&#233;c&#232;de pas &#171;ruled
out&#187;).
</p>
<p>Les d&#233;clencheurs ont d&#8217;abord &#233;t&#233; d&#233;finis manuellement par une &#233;tude de corpus, puis les listes ont &#233;t&#233; compl&#233;t&#233;es
gr&#226;ce aux r&#233;sultats du syst&#232;me par apprentissage : les attributs les plus utiles &#224; la classification ont &#233;t&#233; &#233;tudi&#233;s,
et &#233;ventuellement ajout&#233;s aux listes. Le nombre moyen de d&#233;clencheurs par cat&#233;gorie d&#8217;assertion varie d&#8217;une
cinquantaine pour les d&#233;clencheurs pr&#233;c&#233;dant le probl&#232;me &#224; une quizaine pour les d&#233;clencheurs inclus dans le
probl&#232;me.
</p>
<p>Trois expressions r&#233;guli&#232;res sont utilis&#233;es pour rechercher des d&#233;clencheurs avant, apr&#232;s ou &#224; l&#8217;int&#233;rieur des pro-
bl&#232;mes, sachant que des mots non d&#233;clencheurs peuvent &#234;tre autoris&#233;s entre le d&#233;clencheur et le probl&#232;me (le
nombre de ces mots a &#233;t&#233; fix&#233; par une &#233;tude du corpus d&#8217;entra&#238;nement pour chaque cat&#233;gorie d&#8217;assertion) :
&#8211; &lt;d&#233;clencheur&gt; &lt;mots non d&#233;clencheurs&gt; {0,n} &lt;probl&#232;me&gt; ;
&#8211; &lt;probl&#232;me&gt; &lt;mots non d&#233;clencheurs&gt; {0,n} &lt;d&#233;clencheur&gt; ;
&#8211; &lt;probl&#232;me&gt; &lt;d&#233;clencheur&gt; &gt;.
Ainsi, dans la phrase &#171;Also with multiple masses consistent with metastasis&#187;, &#171;consistent with&#187; est un d&#233;clencheur
de la cat&#233;gorie &#171;possible&#187; suivi directement du probl&#232;me &#171;metastasis&#187;. La premi&#232;re expression r&#233;guli&#232;re sera donc
d&#233;clench&#233;e, et donnera la cat&#233;gorie &#171;possible&#187; &#224; ce probl&#232;me.
</p>
<p>Ces listes de d&#233;clencheurs et expressions r&#233;guli&#232;res ont &#233;t&#233; impl&#233;ment&#233;s avec l&#8217;outil WMatch (Rosset et al., 2008;
Galibert, 2009) 10 qui pr&#233;sente une vitesse d&#8217;ex&#233;cution bien sup&#233;rieure &#224; celle de NegEx.
</p>
<p>Une priorit&#233; a &#233;t&#233; attribu&#233;e &#224; chaque cat&#233;gorie d&#8217;assertion, en fonction du guide d&#8217;annotation i2b2 : associ&#233; &#224;
quelqu&#8217;un d&#8217;autre &gt; absent &gt; possible &gt; conditionnel &gt; hypoth&#233;tique.
</p>
<p>5 &#201;valuation et discussion
</p>
<p>Le corpus d&#8217;&#233;valuation comporte 18 550 assertions (voir table 1). Les r&#233;sultats ont &#233;t&#233; &#233;valu&#233;s en termes de rappel,
pr&#233;cision et f-mesure pour chaque cat&#233;gorie d&#8217;assertion, ainsi que pour toutes les cat&#233;gories :
</p>
<p>10. Moteur d&#8217;expressions r&#233;guli&#232;res d&#233;velopp&#233; au LIMSI, disponible sur demande.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, ANNE-LAURE LIGOZAT
</p>
<p>rappel = #probl&#232;mes correctement attribu&#233;s &#224; la cat&#233;gorie d&#8217;assertion i
#probl&#232;mes de la cat&#233;gorie d&#8217;assertion i
</p>
<p>pr&#233;cision = #probl&#232;mes correctement attribu&#233;s &#224; la cat&#233;gorie d&#8217;assertion i
#probl&#232;mes attribu&#233;s &#224; la cat&#233;gorie d&#8217;assertion i
</p>
<p>f-mesure = 2&#8727;rappel&#8727;pr&#233;cisionrappel+pr&#233;cision
</p>
<p>5.1 R&#233;sultats de l&#8217;&#233;valuation
</p>
<p>Les r&#233;sultats obtenus par les deux syst&#232;mes sur le corpus d&#8217;&#233;valuation 11 sont d&#233;taill&#233;s dans la table 3.
</p>
<p>Apprentissage R&#232;gles
Cat&#233;gorie Rappel Pr&#233;cision F-mesure Rappel Pr&#233;cision F-mesure
Toutes 0,93 0,93 0,93 0,90 0,90 0,90
Pr&#233;sent 0,97 0,94 0,96 0,95 0,92 0,93
Absent 0,95 0,93 0,94 0,85 0,93 0,89
Possible 0,54 0,74 0,62 0,57 0,61 0,59
Hypoth&#233;tique 0,83 0,93 0,88 0,74 0,86 0,80
Conditionnel 0,24 0,74 0,36 0,27 0,29 0,28
Associ&#233; &#224; quelqu&#8217;un d&#8217;autre 0,78 0,86 0,82 0,95 0,76 0,84
</p>
<p>TABLE 3 &#8211; R&#233;sultats pour le corpus d&#8217;&#233;valuation
</p>
<p>Les deux syst&#232;mes d&#233;velopp&#233;s obtiennent des r&#233;sultats significativement 12 meilleurs que les trois syst&#232;mes de r&#233;-
f&#233;rence. Le syst&#232;me par apprentissage supervis&#233; obtient de tr&#232;s bons r&#233;sultats, et s&#8217;est class&#233; 5e sur 21 participants
&#224; i2b2 2010.
</p>
<p>Si l&#8217;on compare plus en d&#233;tails les deux syst&#232;mes, on constate que le syst&#232;me par apprentissage a tendance &#224;
privil&#233;gier la pr&#233;cision sur le rappel. La pr&#233;cision qu&#8217;il obtient est g&#233;n&#233;ralement sup&#233;rieure ou &#233;gale &#224; celle du
syst&#232;me &#224; base de r&#232;gles. En outre, le syst&#232;me par apprentissage se caract&#233;rise par une f-mesure sup&#233;rieure &#224;
celle du syst&#232;me &#224; base de r&#232;gles, sauf pour la cat&#233;gorie &#171;associ&#233; &#224; quelqu&#8217;un d&#8217;autre&#187;. Dans ce dernier cas,
les d&#233;clencheurs utilis&#233;s par le syst&#232;me &#224; base de r&#232;gles permettent d&#8217;obtenir un tr&#232;s bon rappel de 0,95. Cette
comparaison d&#233;montre la compl&#233;mentarit&#233; des deux syst&#232;mes, qui gagneraient &#224; &#234;tre combin&#233;s.
</p>
<p>Lors du challenge i2b2, le meilleur score &#224; cette t&#226;che a &#233;t&#233; obtenu par l&#8217;&#233;quipe du National Research Council
Canada, avec une f-mesure de 0,9362 (contre 0,9311 pour notre syst&#232;me par apprentissage). Les m&#233;thodes des
meilleurs syst&#232;mes sont assez proches de celle utilis&#233;e par notre syst&#232;me par apprentissage. Les SVM sont g&#233;n&#233;-
ralement utilis&#233;s pour la classification, avec des attributs portant sur les mots, l&#8217;annotation s&#233;mantique des mots,
l&#8217;&#233;tiquetage morpho-syntaxique ou encore des d&#233;clencheurs sp&#233;cifiques. On trouve &#233;galement des attributs diff&#233;-
rents, qu&#8217;ils serait int&#233;ressant d&#8217;int&#233;grer aux futures versions de notre syst&#232;me : n-grammes de caract&#232;res, attributs
sp&#233;cifiques &#224; la phrase tels que le temps du verbe principal ou encore attributs sp&#233;cifiques au document consid&#233;r&#233;
(longueur).
</p>
<p>5.2 Analyse des erreurs
</p>
<p>La table 4 d&#233;taille la matrice de confusion pour le syst&#232;me par apprentissage. Le syst&#232;me pr&#233;sente une tendance &#224;
sur-annoter les cat&#233;gories &#171;pr&#233;sent&#187; et &#171;absent&#187;. Ce r&#233;sultat &#233;tait pr&#233;visible dans la mesure o&#249; il s&#8217;agit &#233;galement
des cat&#233;gories les plus repr&#233;sent&#233;es dans le corpus d&#8217;apprentissage. La cat&#233;gorie &#171;pr&#233;sent&#187; est &#233;galement celle
qui compte le plus grand nombre de faux positifs. Pour les classes plus rares dans le corpus d&#8217;apprentissage, et
notamment la classe &#171;conditionnel&#187;, le syst&#232;me se caract&#233;rise par un rappel r&#233;duit, corr&#233;l&#233; &#224; une bonne pr&#233;cision,
de 0,74 &#224; 0,93 en fonction de la classe consid&#233;r&#233;e.
</p>
<p>11. Ces r&#233;sultats sont tr&#232;s l&#233;g&#232;rement diff&#233;rents de ceux obtenus &#224; l&#8217;&#233;valuation i2b2 pour le syst&#232;me par r&#232;gles, du fait d&#8217;un changement de
syst&#232;me d&#8217;annotation : lors de l&#8217;&#233;valuation, nous avions utilis&#233; GenConText, alors que les r&#233;sultats pr&#233;sent&#233;s dans cet article sont obtenus avec
WMatch.
</p>
<p>12. p&lt;0,05 selon le test de Student</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE AUTOMATIQUE DE LA MODALIT&#201; ET DU NIVEAU DE CERTITUDE
</p>
<p>Apprentissage
Pr&#233;sent Absent Possible Cond. Hypo. Assoc. autre Total
</p>
<p>Pr&#233;sent 12629 199 134 13 34 16 13025
Absent 168 3418 20 0 2 1 3609
Possible 381 16 475 1 10 0 883
</p>
<p>R&#233;f&#233;rence Cond. 117 12 1 41 0 0 171
Hypo. 94 12 14 0 595 2 717
Assoc. autre 16 16 0 0 0 113 145
Total 13405 3673 644 55 641 132 18550
</p>
<p>TABLE 4 &#8211; Matrice de confusion pour le syst&#232;me &#224; base d&#8217;apprentissage
</p>
<p>La matrice de confusion de la table 5 pr&#233;sente les erreurs de cat&#233;gorisation d&#233;taill&#233;es du syst&#232;me &#224; base de r&#232;gles.
Les confusions les plus fr&#233;quentes concernent principalement les cat&#233;gories &#171;pr&#233;sent&#187; et &#171;absent&#187; ; le syst&#232;me a
&#233;galement tendance &#224; surannoter en &#171;possible&#187;. Enfin, le tr&#232;s bon rappel sur la cat&#233;gorie &#171;associ&#233; &#224; quelqu&#8217;un
d&#8217;autre&#187; se traduit par tr&#232;s peu de confusion dans cette cat&#233;gorie.
</p>
<p>R&#232;gles
Pr&#233;sent Absent Possible Cond. Hypo. Assoc. autre Total
</p>
<p>Pr&#233;sent 12352 167 285 110 73 38 13025
Absent 514 3077 9 2 1 6 3609
Possible 331 34 505 3 10 0 883
</p>
<p>R&#233;f&#233;rence Cond. 117 6 1 47 0 0 171
Hypo. 152 9 23 2 531 0 717
Assoc. autre 5 2 0 0 0 138 145
Total 13471 3295 823 164 615 182 18550
</p>
<p>TABLE 5 &#8211; Matrice de confusion pour le syst&#232;me &#224; base de r&#232;gles
</p>
<p>Les erreurs du syst&#232;me &#224; base de r&#232;gles ont de multiples causes (dans les exemples suivants, les probl&#232;mes m&#233;di-
caux &#224; analyser sont remplac&#233;s par le mot PROBLEM) :
&#8211; les listes de d&#233;clencheurs sont incompl&#232;tes : ainsi, pour la cat&#233;gorie &#171;associ&#233; &#224; quelqu&#8217;un d&#8217;autre&#187;, les cas de
</p>
<p>dons d&#8217;organes anonymes n&#8217;avaient pas &#233;t&#233; pris en compte (&#171;The liver was from a gentleman who had died
from PROBLEM&#187; 13) et donc les d&#233;clencheurs associ&#233;s (&#171;gentleman&#187; ici) n&#8217;&#233;taient pas dans les listes ;
</p>
<p>&#8211; le d&#233;clencheur peut &#234;tre trop loin du probl&#232;me pour que les deux soient associ&#233;s, notamment dans le cas d&#8217;ana-
phores ; ainsi pour la phrase &#171;The patient declined the procedure stating that her mother had mitral valve re-
gurgitation and she lived for many years without PROBLEM&#187;, le d&#233;clencheur &#171;her mother&#187; de la cat&#233;gorie
&#171;associ&#233; &#224; quelqu&#8217;un d&#8217;autre&#187; est trop loin du probl&#232;me &#224; analyser ; l&#8217;utilisation d&#8217;un outil de r&#233;solution d&#8217;ana-
phore pourrait ici &#234;tre utile ;
</p>
<p>&#8211; un d&#233;clencheur est d&#233;tect&#233;, mais il n&#8217;est en r&#233;alit&#233; pas reli&#233; au probl&#232;me, notamment lorsque l&#8217;avis de la famille
est &#233;voqu&#233; (&#171;According to the family&#187;) ; un contexte gauche au d&#233;clencheur &#171;family&#187; pourrait ici &#234;tre pr&#233;cis&#233;
pour &#233;liminer ces cas, mais les formulations plus complexes comme &#171;The family is confident in any decision
the doctor would make concerning her PROBLEM&#187; sont plus difficiles &#224; traiter ;
</p>
<p>&#8211; la port&#233;e du marqueur est trop importante ou trop faible : dans la phrase &#171;The patient is on no specific medica-
tions for his PROBLEM&#187;, le marqueur &#171;no&#187; est rep&#233;r&#233;, mais ne s&#8217;applique en r&#233;alit&#233; pas au probl&#232;me ;
</p>
<p>&#8211; deux marqueurs sont d&#233;tect&#233;s, et l&#8217;ambig&#252;it&#233; est mal r&#233;solue, comme par exemple dans la phrase &#171;PROBLEM
was less likely given her negative angiogram.&#187; o&#249; &#171;likely&#187; est bien d&#233;clencheur de la cat&#233;gorie &#171;possible&#187;, mais
le d&#233;clencheur &#171;negative&#187; est favoris&#233; du fait des priorit&#233;s entre cat&#233;gories ;
</p>
<p>&#8211; quelques erreurs sont li&#233;es &#224; des probl&#232;mes d&#8217;anonymisation des donn&#233;es, qui perturbent l&#8217;application des
r&#232;gles ;
</p>
<p>&#8211; quelques incoh&#233;rences d&#8217;annotation ont &#233;galement &#233;t&#233; not&#233;es, ce que pr&#233;voyait l&#8217;accord inter-annotateur.
</p>
<p>Enfin, la matrice de confusion de la table 6 permet de comparer les annotations r&#233;alis&#233;es par les deux syst&#232;mes.
</p>
<p>13. Les exemples pr&#233;sent&#233;s sont issus d&#8217;exemples r&#233;els, mais sont g&#233;n&#233;ralement simplifi&#233;s pour &#234;tre plus lisibles.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, ANNE-LAURE LIGOZAT
</p>
<p>R&#232;gles
Pr&#233;sent Absent Possible Cond. Hypo. Assoc. autre Total
</p>
<p>Pr&#233;sent 12711 125 312 129 87 41 13405
Absent 497 3142 11 2 2 19 3673
Possible 129 22 491 0 2 0 644
</p>
<p>Apprentissage Cond. 22 1 1 31 0 0 55
Hypo. 99 5 8 2 524 3 641
Assoc. autre 13 0 0 0 0 119 132
Total 13471 3295 823 164 615 182 18550
</p>
<p>TABLE 6 &#8211; Matrice de confusion pour les deux syst&#232;mes
</p>
<p>Les syst&#232;mes sont fortement en d&#233;saccord pour la cat&#233;gorie &#171;conditionnel&#187; : seules 31 annotations sont partag&#233;es.
C&#8217;est &#233;galement la cat&#233;gorie qui obtient les moins bons r&#233;sultats globalement. La deuxi&#232;me cat&#233;gorie la plus
probl&#233;matique correspond aux assertions du type &#171;possible&#187;. Le syst&#232;me par apprentissage tend &#224; sous-annoter
cette cat&#233;gorie et par cons&#233;quent de nombreuses assertions annot&#233;es comme &#171;possible&#187; par le syst&#232;me &#224; base de
r&#232;gles sont associ&#233;es &#224; la cat&#233;gorie &#171;pr&#233;sent&#187; par le syst&#232;me par apprentissage.
</p>
<p>6 Conclusion et perspectives
</p>
<p>Nous nous sommes int&#233;ress&#233;es &#224; l&#8217;analyse de la modalit&#233; et du niveau de certitude dans des textes m&#233;dicaux, et
avons d&#233;velopp&#233; deux syst&#232;mes dans le cadre de la campagne d&#8217;&#233;valuation i2b2 2010. Le premier proc&#232;de par
apprentissage supervis&#233; et s&#8217;appuie sur des attributs lexicaux, morphologiques et s&#233;mantiques. Le second est un
syst&#232;me &#224; base de listes et de r&#232;gles. Ces deux syst&#232;mes obtiennent des r&#233;sultats significativement meilleurs que
les trois r&#233;f&#233;rences consid&#233;r&#233;es, et au niveau de l&#8217;&#233;tat de l&#8217;art : environ 0,93 et 0,90 de f-mesure.
</p>
<p>Les perspectives de poursuite de ces travaux sont nombreuses. Ces syst&#232;mes pourraient notamment &#234;tre &#233;tendus
afin de travailler &#233;ventuellement sur plusieurs phrases, et de tenir compte des ph&#233;nom&#232;nes discursifs. Il serait
&#233;galement souhaitable de combiner les deux syst&#232;mes, en particulier pour profiter du tr&#232;s bon niveau de rappel du
syst&#232;me &#224; base de r&#232;gles pour la cat&#233;gorie &#171;associ&#233; &#224; quelqu&#8217;un d&#8217;autre&#187;.
</p>
<p>Nous envisageons &#233;galement d&#8217;adapter les syst&#232;mes pr&#233;sent&#233;s au fran&#231;ais. Pour le syst&#232;me &#224; base de r&#232;gles, il
sera n&#233;cessaire d&#8217;identifier les d&#233;clencheurs correspondant ou aditionnels pour le fran&#231;ais. Le syst&#232;me &#224; base
d&#8217;apprentissage requiert quant &#224; lui de larges quantit&#233;s de donn&#233;es annot&#233;es. Dans la mesure o&#249; ceci constitue une
t&#226;che n&#233;cessitant des annotateurs experts humains, nous nous appuierons sur la m&#233;thode de l&#8217;apprentissage actif
(active learning).
</p>
<p>Nous souhaitons &#233;galement g&#233;n&#233;raliser ces travaux &#224; d&#8217;autres domaines, afin d&#8217;analyser la modalit&#233; et les niveaux
de certitude dans des contextes plus larges. En particulier, nous envisageons l&#8217;&#233;tude des ph&#233;nom&#232;nes similaires
dans les textes journalistiques et, plus globalement, les textes subjectifs visant &#224; exprimer des opinions.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; partiellement financ&#233; par le projet Qu&#230;ro (financement Oseo, agence fran&#231;aise pour l&#8217;innovation
et la recherche). Les donn&#233;es m&#233;dicales utilis&#233;es proviennent du consortium Informatics for Integrating Biology
to the Bedside (i2b2) gr&#226;ce aux financements num&#233;ros U54LM008748 de la National Library of Medicine, VA
HSR HIR 08-374 du Consortium for Healthcare Informatics Research (CHIR), et VA HSR HIR 08-204 du VA
Informatics and Computing Infrastructure (VINCI).
</p>
<p>R&#233;f&#233;rences
</p>
<p>CHANG C.-C. &amp; LIN C.-J. (2001). LIBSVM : a library for support vector machines. Outil disponible &#224; l&#8217;adresse</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE AUTOMATIQUE DE LA MODALIT&#201; ET DU NIVEAU DE CERTITUDE
</p>
<p>suivante : http://www.csie.ntu.edu.tw/~cjlin/libsvm.
</p>
<p>CHAPMAN W., BRIDEWELL W., HANBURY P., COOPER G. &amp; BUCHANAN B. (2001). A simple algorithm
for identifying negated findings and diseases in discharge summaries. Journal of biomedical informatics, 34(5),
301&#8211;310.
</p>
<p>FRIEDMAN C., ALDERSON P. O., AUSTIN J. H., CIMINO J. J. &amp; JOHNSON S. B. (1994). A general natural-
language text processor for clinical radiology. Journal of the American Medical Informatics Association, 1(2),
161.
</p>
<p>GALIBERT O. (2009). Approches et m&#233;thodologies pour la r&#233;ponse automatique &#224; des questions adapt&#233;es &#224;
un cadre interactif en domaine ouvert. PhD thesis, Th&#232;se de doctorat en informatique, Universit&#233; Paris-Sud 11,
Orsay, France.
</p>
<p>HUANG Y. &amp; LOWE H. (2007). A Novel Hybrid Approach to Automated Negation Detection in Clinical Radio-
logy Reports. Journal of the American Medical Informatics Association, 14, 304&#8211;311.
KILICOGLU H. &amp; BERGLER S. (2008). Recognizing speculative language in biomedical research articles : a
linguistically motivated perspective. BMC Bioinformatics, 9(Suppl 11).
KILICOGLU H. &amp; BERGLER S. (2009). Syntactic dependency based heuristics for biological event extraction.
In BioNLP &#8217;09 : Proceedings of the Workshop on BioNLP, p. 119&#8211;127.
</p>
<p>LAPAIRE J.-R. &amp; ROTG&#201; W. (1998). Linguistique et grammaire de l&#8217;anglais, 3e &#233;dition. Amphi 7. Presses
Universitaires du Mirail.
</p>
<p>LIGHT M., QIU X. &amp; SRINIVASAN P. (2004). The language of bioscience : Facts, speculations, and statements
in between. In Proceedings of BioLink 2004 workshop on linking biological literature, ontologies and databases :
tools for users, p. 17&#8211;24.
</p>
<p>MEDLOCK B. &amp; BRISCOE T. (2007). Weakly supervised learning for hedge classification in scientific literature.
In Proceedings of the 45th Annual Meeting of the Association of Computational Linguistics, p. 992&#8211;999, Prague,
Czech Republic.
</p>
<p>MINARD A.-L., LIGOZAT A.-L., BEN ABACHA A., BERNHARD D., CARTONI B., DEL&#201;GER L., GRAU B.,
ROSSET S., ZWEIGENBAUM P. &amp; GROUIN C. (2011). Hybrid methods for improving information access in
clinical documents : Concept, assertion, and relation identification. Journal of the American Medical Informatics
Association. &#192; para&#238;tre.
</p>
<p>MORANTE R. &amp; DAELEMANS W. (2009). Learning the scope of hedge cues in biomedical texts. In Proceedings
of the Workshop on BioNLP, p. 28&#8211;36.
</p>
<p>MUTALIK P., DESHPANDE A. &amp; NADKARNI P. (2001). Use of general-purpose negation detection to augment
concept indexing of medical documents. Journal of the American Medical Informatics Association, 8(6), 598.
NA J.-C., KHOO C. &amp; WU P. H. J. (2005). Use of negation phrases in automatic sentiment classification of
product reviews. Library Collections, Acquisitions, and Technical Services, 29(2), 180 &#8211; 191.
NARAYANAN R., LIU B. &amp; CHOUDHARY A. (2009). Sentiment analysis of conditional sentences. In Procee-
dings of the 2009 Conference on Empirical Methods in Natural Language Processing, volume 1 of EMNLP &#8217;09,
p. 180&#8211;189, Stroudsburg, PA, USA.
</p>
<p>PANG B. &amp; LEE L. (2008). Opinion mining and sentiment analysis, volume 2 of Foundations and Trends in
Information Retrieval. Now Publishers Inc.
</p>
<p>PANG B., LEE L. &amp; VAITHYANATHAN S. (2002). Thumbs up ? Sentiment Classification using Machine Lear-
ning Techniques. In Proceedings of the 2002 Conference on Empirical Methods in Natural Language Processing
(EMNLP), p. 79&#8211;86.
</p>
<p>ROSSET S., GALIBERT O., BERNARD G., BILINSKI E. &amp; ADDA G. (2008). The LIMSI participation to the
QAst track. In Working Notes of CLEF 2008 Workshop, Aarhus, Danemark.
</p>
<p>RUBIN V., LIDDY E. &amp; KANDO N. (2006). Certainty Identification in Texts : Categorization Model and Manual
Tagging Results. In W. B. CROFT, J. SHANAHAN, Y. QU &amp; J. WIEBE, Eds., Computing Attitude and Affect in
Text : Theory and Applications, volume 20 of The Information Retrieval Series, p. 61&#8211;76. Springer Netherlands.
</p>
<p>RUBIN V. L. (2007). Stating with Certainty or Stating with Doubt : Intercoder Reliability Results for Manual
Annotation of Epistemically Modalized Statements. In Proceedings of the Human Language Technologies Confe-
rence : The Annual Conference of the North American Chapter of the Association for Computational Linguistics
(NAACL-HLT 2007) ; Companion Volume, Short Papers, p. 141&#8211;144.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, ANNE-LAURE LIGOZAT
</p>
<p>RUBIN V. L. (2010). Epistemic modality : From uncertainty to certainty in the context of information seeking
as interactions with texts. Information Processing &amp; Management, 46(5), 533 &#8211; 540.
SAUR&#205; R. &amp; PUSTEJOVSKY J. (2009). FactBank : a corpus annotated with event factuality. Language Resources
and Evaluation, 43, 227&#8211;268.
SZARVAS G. (2008). Hedge classification in biomedical texts with a weakly supervised selection of keywords.
In Proceedings of ACL-08 : HLT, p. 281 &#8211; 289, Colombus, Ohio, USA.
</p>
<p>VINCZE V., SZARVAS G., FARKAS R., MORA G. &amp; CSIRIK J. (2008). The bioscope corpus : biomedical texts
annotated for uncertainty, negation and their scopes. BMC Bioinformatics, 9(Suppl 11), S9.
WILBUR W., RZHETSKY A. &amp; SHATKAY H. (2006). New directions in biomedical text annotation : definitions,
guidelines and corpus construction. BMC bioinformatics, 7(1), 356.</p>

</div></div>
</body></html>