<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La traduction automatique des s&#233;quences clitiques dans un traducteur &#224; base de r&#232;gles</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>La traduction automatique des s&#233;quences clitiques
dans un traducteur &#224; base de r&#232;gles. &#8727;
</p>
<p>Lorenza Russo, &#201;ric Wehrli
Laboratoire d&#8217;Analyse et de Technologie du Langage (LATL)
</p>
<p>D&#233;partement de linguistique &#8211; Universit&#233; de Gen&#232;ve
2, rue de Candolle &#8211; CH-1211 Gen&#232;ve 4
{Lorenza.Russo, Eric.Wehrli}@unige.ch
</p>
<p>R&#233;sum&#233;. Dans cet article, nous discutons la m&#233;thodologie utilis&#233;e par Its-2, un syst&#232;me de traduction &#224;
base de r&#232;gles, pour la traduction des pronoms clitiques. En particulier, nous nous focalisons sur les s&#233;quences
clitiques, pour la traduction automatique entre le fran&#231;ais et l&#8217;anglais. Une &#233;valuation bas&#233;e sur un corpus de
phrases construites montre le potentiel de notre approche pour des traductions de bonne qualit&#233;.
</p>
<p>Abstract. In this paper we discuss the methodology applied by Its-2, a rule-based MT system, in order to
translate clitic pronouns. In particular, we focus on French clitic clusters, for automatic translation between French
and English. An evaluation based on a corpus of constructed sentences shows the potential of this approach for
high-quality translation.
</p>
<p>Mots-cl&#233;s : Analyseur syntaxique, traduction automatique, pronom clitique, s&#233;quences clitiques.
</p>
<p>Keywords: Syntactic parser, automatic translation, clitic pronoun, clitic clusters.
</p>
<p>1 Introduction
</p>
<p>Le ph&#233;nom&#232;ne de la cliticisation des pronoms a suscit&#233; l&#8217;attention de tr&#232;s nombreux linguistes, en particulier suite
aux travaux de Kayne (1975). Mais les pronoms clitiques sont importants aussi du point de vue du traitement
automatique du langage naturel (TALN) en g&#233;n&#233;ral et de la traduction automatique en particulier. Les syst&#232;mes
de traduction automatique actuellement disponibles ne sont pas toujours capables de reconna&#238;tre les pronoms
clitiques dans la langue source 1. Ainsi, par exemple, dans le cas de s&#233;quences de pronoms clitiques, c&#8217;est-&#224;-dire
de l&#8217;occurrence de deux (ou plus) pronoms clitiques attach&#233;s au m&#234;me h&#244;te verbal, les syst&#232;mes de traduction
automatique actuellement disponibles g&#233;n&#232;rent fr&#233;quemment des phrases cibles dans lesquelles seulement un des
deux clitiques est traduit (1). Google Translate 2, par exemple, atteint un pourcentage tr&#232;s bas de traductions
correctes des s&#233;quences clitiques sur un corpus d&#8217;exemples construits 3.
</p>
<p>Au vu de ces r&#233;sultats et compte tenu aussi de l&#8217;absence de travaux de recherche &#224; ce sujet, notre but est celui de
souligner ici l&#8217;importance de l&#8217;information lexicale et syntaxique pour le traitement de telles constructions afin
d&#8217;obtenir des traductions automatiques syntaxiquement correctes et compl&#232;tes. Pour cela, nous pr&#233;sentons dans cet
article la m&#233;thodologie utilis&#233;e par Its-2 &#8211; un traducteur automatique multilingue &#224; base de r&#232;gles d&#233;velopp&#233; dans
notre laboratoire - en nous focalisant en particulier sur la paire de langues fran&#231;ais&#8211;anglais et sur les s&#233;quences
clitiques.
</p>
<p>&#8727;. Le travail de recherche pr&#233;sent&#233; ici a b&#233;n&#233;fici&#233; du support du Fond National Suisse de la Recherche Scientifique (No 100015-130634).
Cet article a &#233;t&#233; en partie adapt&#233; de l&#8217;article de Russo (2010).
</p>
<p>1. Consid&#233;rons, de plus, que dans la traduction de deux langues typologiquement diff&#233;rentes, comme c&#8217;est le cas pour le
fran&#231;ais et l&#8217;anglais ou aussi pour le fran&#231;ais et l&#8217;allemand, par exemple, le probl&#232;me principal est d&#251; au fait que l&#8217;an-
glais et l&#8217;allemand standard n&#8217;ont pas de pronoms clitiques &#224; proprement parler. Dans ce cas, un syst&#232;me de traduction au-
tomatique doit transformer le pronom clitique fran&#231;ais (ia) dans un compl&#233;ment du verbe en anglais (ib) et en allemand (ic).
</p>
<p>(i) a. Je lui parle. b. I talk to him. c. Ich spreche mit ihm.
2. En fran&#231;ais Google traduction (http://translate.google.com).
3. Pour plus de d&#233;tails sur cette &#233;valuation et sur le type de corpus utilis&#233;, nous renvoyons le lecteur &#224; la section 3 de cet article.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LORENZA RUSSO, &#201;RIC WEHRLI
</p>
<p>(1) Je le lui donne.
I give him. (traduction propos&#233;e par Google Translate)
I give it to him.
</p>
<p>Cet article comprend trois parties. Suite &#224; cette br&#232;ve introduction, la section 2 d&#233;crit la strat&#233;gie de traduction de
Its-2 appliqu&#233;e aux s&#233;quences clitiques ; la section 3 est consacr&#233;e &#224; l&#8217;&#233;valuation des traductions propos&#233;es par
notre syst&#232;me, ainsi que celles propos&#233;es par Google Translate et par Systran 4, sur un corpus de phrases contenant
des s&#233;quences clitiques. Finalement, la section 4 contient les conclusions de notre travail.
</p>
<p>2 Its-2
</p>
<p>Its-2 (Russo &amp; Wehrli, 2011) est un syst&#232;me de traduction bas&#233; sur l&#8217;analyseur syntaxique profond Fips (Wehrli,
2007). Le processus de traduction se compose de trois phases principales : lors de la premi&#232;re phase, l&#8217;analyse
lexicale et syntaxique de la phrase source, &#224; l&#8217;aide de Fips, d&#233;termine la nature des &#233;l&#233;ments lexicaux et produit
une repr&#233;sentation abstraite de la phrase source avec sa structure arborescente, ainsi qu&#8217;une repr&#233;sentation des
relations entre pr&#233;dicat (le verbe) et arguments (son sujet et ses compl&#233;ments). Pendant la deuxi&#232;me phase, le
syst&#232;me traverse it&#233;rativement la structure arborescente source cr&#233;&#233;e par Fips, rep&#232;re les t&#234;tes lexicales et interroge
le lexique bilingue pour trouver des correspondances de ces t&#234;tes lexicales dans la langue cible. Sur la base de la
correspondance lexicale trouv&#233;e, ainsi que des informations syntaxiques contenues dans le lexique bilingue et dans
le lexique monolingue cible, Its-2 projette une structure abstraite cible. Finalement, lors de la troisi&#232;me phase, celle
de la g&#233;n&#233;ration de la phrase cible, des transformations syntaxiques peuvent s&#8217;appliquer &#224; la structure abstraite,
par exemple pour d&#233;placer des constituants, cliticiser des pronoms, d&#233;terminer les temps et modes verbaux, etc.
Le processus de g&#233;n&#233;ration s&#8217;ach&#232;ve par la g&#233;n&#233;ration morphologique, qui s&#233;lectionne la forme morphologique
appropri&#233;e pour chaque mot cible en tenant compte des valeurs morpho-syntaxiques telles que le nombre, le cas,
le genre, la personne, le temps ou le mode, etc.
</p>
<p>2.1 Traitement des pronoms clitiques en Its-2
</p>
<p>Dans les lexiques mono et bilingues, l&#8217;information associ&#233;e aux pronoms clitiques est relativement simple. Etant
donn&#233; leur distribution particuli&#232;re, nous assignons aux pronoms clitiques une cat&#233;gorie lexicale sp&#233;cifique, celle
de clitique. En plus des valeurs morpho-syntaxiques de genre, nombres et personnes, les clitiques appartiennent
&#224; des sous-cat&#233;gories distinctes, qui d&#233;terminent en partie leur interpr&#233;tation mais surtout l&#8217;ordre dans lequel ils
apparaissent au sein d&#8217;une cha&#238;ne. En fran&#231;ais, nous distinguons 5 sous-cat&#233;gories de clitiques (se, le, lui, y, en).
Dans le dictionnaire bilingue fran&#231;ais-anglais, les pronoms clitiques du fran&#231;ais sont mis en correspondance avec
des pronoms forts de l&#8217;anglais, par exemple le est en correspondance avec it.
</p>
<p>Pour ce qui est de l&#8217;analyse et de la traduction des pronoms clitiques, par contre, l&#8217;id&#233;e principale pour leur
traitement se base sur une notion emprunt&#233;e &#224; la grammaire g&#233;n&#233;rative, celle de la formation d&#8217;une cha&#238;ne clitique
reliant un pronom clitique &#224; une cat&#233;gorie vide postverbale. Autrement dit, les pronoms clitiques &#8211; &#224; l&#8217;exception
des clitiques inh&#233;rents 5 &#8211; sont associ&#233;s &#224; une cat&#233;gorie vide en position d&#8217;argument ou d&#8217;ajout. Le m&#233;canisme
d&#8217;analyse des clitiques se fait en deux &#233;tapes : l&#8217;attachement et l&#8217;interpr&#233;tation (Leoni de L&#233;on &amp; Michou, 2006;
Wehrli, 2007). Quand le pronom clitique est lu &#8211; soit comme &#233;l&#233;ment graphiquement s&#233;par&#233; du verbe (2a) soit
comme &#233;l&#233;ment graphiquement attach&#233; &#224; celui-ci (2b) &#8211; on l&#8217;attache &#224; la t&#234;te verbale qui le suit (proclise) (2a) ou
qui le pr&#233;c&#232;de (enclise) (2b). La t&#234;te verbale correspond soit au verbe principal, dans le cas d&#8217;une phrase &#224; temps
simple (2a-b), soit au premier auxiliaire, dans le cas d&#8217;une phrase &#224; temps compos&#233; (2c).
</p>
<p>(2) a. Tu le manges. b. Dimmi la verit&#224; ! c. Tu l&#8217;as cass&#233;.
You eat it. Dis-moi la v&#233;rit&#233; ! You have broken it.
</p>
<p>Afin d&#8217;analyser au mieux les pronoms clitiques, on utilise une structure de donn&#233;es temporaire pour les stocker
jusqu&#8217;&#224; ce que l&#8217;analyseur syntaxique identifie le verbe principal de la phrase. Cette structure temporaire est aussi
utilis&#233;e pour contr&#244;ler la bonne formation de la s&#233;quence clitique. Une fois que le verbe principal de la phrase est
</p>
<p>4. Disponible &#224; la page :http://www.systran.fr.
5. Un clitique inh&#233;rent ou lexical est un clitique qui ne correspond pas &#224; un compl&#233;ment ou &#224; un ajout du verbe h&#244;te, comme par exemple
</p>
<p>le clitique se associ&#233; &#224; un verbe essentiellement pronominal, comme se suicider ou se lever. &#192; ce propos, voir Wehrli (1986) et Russo (2010).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LA TRADUCTION AUTOMATIQUE DES S&#201;QUENCES CLITIQUES DANS UN TRADUCTEUR &#192; BASE DE R&#200;GLES
</p>
<p>identifi&#233;, le processus d&#8217;interpr&#233;tation commence. Les pronoms clitiques dans la structure de donn&#233;es temporaire
peuvent donc &#234;tre interpr&#233;t&#233;s comme arguments du verbe (3a) ; comme ajouts du verbe (3b) ; comme compl&#233;ments
d&#8217;un argument nominal (3c), ou encore comme arguments d&#8217;un adjectif pr&#233;dicatif (3d) 6.
</p>
<p>(3) a. Je lui donne un paquet.
[
TP
</p>
<p>[
DP
</p>
<p>Je ] luii donne [VP [DP un [NP paquet ] [PP ei ] ] ] ]
</p>
<p>b. Tu y vas souvent.
[
TP
</p>
<p>[
DP
</p>
<p>Tu ] yi vas [VP [AdvP souvent ] [AdvP ei ] ] ]
</p>
<p>c. Elle en conna&#238;t la cause.
[
TP
</p>
<p>[
DP
</p>
<p>Elle ] eni conna&#238;t [VP [DP la [NP cause [PP ei ] ] ] ] ]
</p>
<p>d. Nous en sommes heureux.
[
TP
</p>
<p>[
DP
</p>
<p>Nous ] eni sommes [VP [AP heureux [PP ei ] ] ] ]
</p>
<p>2.2 Les modules de transfert et g&#233;n&#233;ration
</p>
<p>Une fois l&#8217;analyse syntaxique achev&#233;e, Its-2 commence le processus de traduction, notamment avec le transfert
de la t&#234;te verbale en cherchant dans le lexique bilingue une correspondance de celle-ci dans la langue cible. Quant
aux pronoms clitiques, ils ne sont pas traduits directement, mais exclusivement par le biais de la trace qui leur est
associ&#233;e. Consid&#233;rons par exemple la phrase (4a).
</p>
<p>(4) a. Tu nous as parl&#233;. b. Tu as parl&#233; PronomClitique(ObjetIndirect).
[
TP
</p>
<p>[
DP
</p>
<p>Tu ] nousi as [VP parl&#233; ] [PP ei ] ] [TP [DP Tu ] as [VP parl&#233; ] [PP Pronom ] ]
</p>
<p>Sur la base de la sous-cat&#233;gorisation du verbe, le pronom clitique &#8220;nous&#8221; est analys&#233; comme l&#8217;objet indirect du
verbe &#8220;parler&#8221; (4b). Autrement dit, la trace associ&#233;e au pronom clitique est trait&#233;e comme une sorte de pronom
abstrait en position d&#8217;objet indirect. Au cours du processus de transfert, ce pronom abstrait est transf&#233;r&#233; dans
la structure cible, la correspondance lexicale &#233;tant d&#233;termin&#233;e par le clitique ant&#233;c&#233;dent de ce pronom abstrait.
Si la langue cible est une langue &#224; pronoms clitiques, il est possible que ce pronom subisse le processus de
cliticisation. Cela est le cas, par exemple, pour la plupart des clitiques dans la traduction du fran&#231;ais vers l&#8217;italien.
&#192; titre d&#8217;exemple, la trace du pronom clitique dans la structure source (4a) est utilis&#233;e pour g&#233;n&#233;rer un pronom en
position d&#8217;objet dans la langue cible (5a). Ce pronom est ensuite cliticis&#233; lors de la g&#233;n&#233;ration, afin d&#8217;obtenir une
phrase cible grammaticalement correcte (5b).
</p>
<p>(5) a. Hai parlato Pronom(OI). b. Ci hai parlato.
[
TP
</p>
<p>[
DP
</p>
<p>] Hai [
VP
</p>
<p>parlato ] [
PP
</p>
<p>Pronom ] ] [
TP
</p>
<p>[
DP
</p>
<p>] Cii hai [VP parlato ] [PP ei ] ]
</p>
<p>Pour ce qui est de la traduction du fran&#231;ais vers l&#8217;anglais, par contre, l&#8217;objet indirect de la phrase en (4a) sera
traduit par le pronom fort us, compl&#233;ment de la pr&#233;position to, comme illustr&#233; en (6).
</p>
<p>(6) Tu as parl&#233; PronomClitique(OI).
[
TP
</p>
<p>[
DP
</p>
<p>Tu ] as [
VP
</p>
<p>parl&#233; ] [
PP
</p>
<p>Pronom ] ]
</p>
<p>Tu as parl&#233; Pronom(OI).
You spoke to Pronom(OI).
You spoke to us.
</p>
<p>Consid&#233;rons maintenant la traduction de l&#8217;anglais vers le fran&#231;ais, c&#8217;est-&#224;-dire d&#8217;une langue sans pronoms clitiques
vers une langue &#224; clitiques. Pour la phrase (7a), le pronom anglais &#8220;it&#8221; est d&#8217;abord transf&#233;r&#233; dans la langue cible
en tant que pronom objet direct (7b) et ensuite cliticis&#233; (7c). Le processus de cliticisation fait partie du module de
g&#233;n&#233;ration du fran&#231;ais qui est soumis &#224; des contraintes de placement et d&#8217;ordre comme celle, entre autres, sur les
s&#233;quences clitiques, discut&#233;e dans la section suivante.
</p>
<p>(7) a. She will read it. b. Elle lira Pronom(OD). c. Elle le lira.
[
TP
</p>
<p>[
DP
</p>
<p>She ] will [
VP
</p>
<p>read [
DP
</p>
<p>it ] ] ]
</p>
<p>6. Dans ces deux derniers cas de figure (3c-d), le pronom clitique sera interpr&#233;t&#233; quand le syntagme nominal ou l&#8217;adjectif de la phrase est
identifi&#233; par le parseur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LORENZA RUSSO, &#201;RIC WEHRLI
</p>
<p>2.3 Traduction des s&#233;quences clitiques
</p>
<p>Comme d&#233;j&#224; mentionn&#233; dans l&#8217;introduction, on peut d&#233;finir une s&#233;quence clitique comme l&#8217;occurrence de plus
d&#8217;un clitique associ&#233; au m&#234;me h&#244;te verbal. En ce qui concerne la traduction des s&#233;quences clitiques du fran&#231;ais
vers l&#8217;anglais et vice versa, les strat&#233;gies d&#8217;analyse et de transfert utilis&#233;es par Its-2 sont en grande partie similaires
&#224; celles d&#233;j&#224; discut&#233;es dans les sections 2.1 et 2.2. En guise d&#8217;exemple, consid&#233;rons l&#8217;exemple donn&#233; en (9a). Lors
du transfert, le syst&#232;me consid&#232;re d&#8217;abord la trace associ&#233;e au pronom clitique &#224; fonction d&#8217;objet direct (&#8220;le&#8221;) et
ensuite la trace associ&#233;e au pronom clitique &#224; fonction d&#8217;objet indirect (&#8220;te&#8221;) (9b). La trace associ&#233;e au pronom
clitique objet direct est transf&#233;r&#233;e comme un pronom objet direct en anglais, alors que la trace associ&#233;e au pronom
clitique objet indirect est transf&#233;r&#233;e comme un pronom objet indirect (9c).
</p>
<p>(9) a. Il te le donnera.
b. [
</p>
<p>TP
[
DP
</p>
<p>Il ] tej lei donnera [VP [DP ei ] [PP j ] ] ]
</p>
<p>c. [
TP
</p>
<p>[
DP
</p>
<p>He ] will [
VP
</p>
<p>give [
DP
</p>
<p>it ] [
PP
</p>
<p>to [
DP
</p>
<p>you ] ] ] ]
</p>
<p>Pour ce qui est du processus de g&#233;n&#233;ration, ce dernier devient l&#233;g&#232;rement plus compliqu&#233; quand il existe des
contraintes syntaxiques sur les s&#233;quences clitiques. En fran&#231;ais c&#8217;est le cas, par exemple, des contraintes sur les
pronoms clitiques objet indirect, ces derniers ne pouvant pas &#234;tre cliticis&#233;s s&#8217;ils se retrouvent avec un pronom
clitique objet de premi&#232;re ou de deuxi&#232;me personne (10a) (Perlmutter, 1971). Consid&#233;rons, en particulier, le cas
du verbe &#8220;pr&#233;senter quelqu&#8217;un &#224; quelqu&#8217;un &#8221;. Comme montr&#233; en (10b), il n&#8217;est pas correct en fran&#231;ais de cliticiser
les deux pronoms.
</p>
<p>(10) a. * Mon p&#232;re me lui promet. b. * Jean nous lui a pr&#233;sent&#233;s.
Mon p&#232;re me promet &#224; lui/&#224; elle. Jean nous a pr&#233;sent&#233;s &#224; lui.
</p>
<p>Cette contrainte syntaxique est pr&#233;sente dans l&#8217;analyseur Fips et permet de bloquer l&#8217;interpr&#233;tation de phrases
telles que celles donn&#233;es en (10) (et de les signaler comme agrammaticales). Dans l&#8217;autre sens de traduction,
c&#8217;est-&#224;-dire de l&#8217;anglais vers le fran&#231;ais, les contraintes sur les s&#233;quences de pronoms clitiques sont int&#233;gr&#233;es
au processus de cliticisation, dans le module de g&#233;n&#233;ration de la structure cible. En simplifiant quelque peu les
choses, la contrainte dit simplement qu&#8217;un compl&#233;ment d&#8217;object indirect ne peut pas &#234;tre cliticis&#233; en pr&#233;sence
d&#8217;un clitique de la classe se 7. C&#8217;est ce qui se passe dans la traduction de l&#8217;exemple (11a). Apr&#232;s cliticisation de
l&#8217;objet direct, la pr&#233;sence du clitique me emp&#234;che la cliticisation du pronom objet indirect, qui donnerait la phrase
agrammaticale (11b). Ce dernier reste donc dans sa position postverbale et nous obtenons la phrase grammaticale
(11c) 8.
</p>
<p>(11) a. Luka introduces me to you. b. * Luka me te pr&#233;sente. c. Luka me pr&#233;sente &#224; toi.
</p>
<p>3 L&#8217;&#233;valuation
</p>
<p>Afin d&#8217;&#233;valuer Its-2 sur la traduction des s&#233;quences clitiques, nous avons r&#233;dig&#233; un petit corpus d&#8217;exemples
construits pour la traduction du fran&#231;ais vers l&#8217;anglais. Chaque phrase dans le corpus pr&#233;sente une s&#233;quence
de deux clitiques en position proclitique (pr&#233;verbale) dans une structure syntaxique compos&#233;e par sujet&#8211;s&#233;quence
clitique&#8211;verbe. Les verbes sont conjugu&#233;s au pr&#233;sent ou au futur. Dans la Table 1, on a sch&#233;matis&#233; les types de s&#233;-
quences clitiques pr&#233;sentes dans le corpus, ainsi que le nombre de phrases pour chaque s&#233;quence clitique. Comme
on l&#8217;a mentionn&#233; dans l&#8217;introduction, nous avons test&#233; sur le m&#234;me corpus deux syst&#232;mes de traduction commer-
cial diff&#233;rents du n&#244;tre, Google Translate et Systran, afin de comparer les r&#233;sultats obtenus. Comme montr&#233; dans la
Table 2, Google Translate atteint un pourcentage total de traductions correctes des s&#233;quences clitiques de 15.3%.
</p>
<p>7. Les r&#232;gles de cliticisation sont ordonn&#233;es, la cliticisation de l&#8217;objet direct pr&#233;c&#233;dant celle de l&#8217;objet indirect.
8. Remarquons qu&#8217;il serait beaucoup plus difficile de traduire automatiquement les s&#233;quences clitiques dans des contextes plus sp&#233;cifiques,
</p>
<p>comme par exemple les constructions causatives telles que &#8220;faire + infinitif&#8221;. Dans ce cas, la combinaison d&#8217;un clitique objet direct de
premi&#232;re/deuxi&#232;me personne avec un clitique objet indirect de troisi&#232;me personne est permis en fran&#231;ais seulement si les deux clitiques
sont s&#233;par&#233;s par un autre clitique (iia). Comme observ&#233; par Postal (1981), en fran&#231;ais la s&#233;quence clitique &#8220;me lui&#8221; est possible seulement si
un clitique objet direct est &#224; l&#8217;int&#233;rieur de la s&#233;quence et seulement si le pronom clitique &#8220;me&#8221; peut &#234;tre interpr&#233;t&#233; comme l&#8217;agent du verbe &#224;
l&#8217;infinitif. La s&#233;quence &#8220;me lui&#8221; peut aussi &#234;tre accept&#233;e dans une phrase comme celle en (iib) parce que les deux pronoms ne fonctionnent pas
comme arguments du m&#234;me pr&#233;dicat, comme soulign&#233; par Laenzlinger (1998) : en fait, &#8220;me&#8221; est l&#8217;argument du verbe &#8220;sembler&#8221; (&#8220;seems&#8221;),
alors que &#8220;lui&#8221; est l&#8217;argument de l&#8217;adjectif &#8220;infid&#232;le&#8221; (&#8220;unfaithful&#8221;).
</p>
<p>(ii) a. Il me le lui a fait apporter. b. Elle me lui semble infid&#232;le.
He let me give it to him. She seems to me to be unfaithful to him.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LA TRADUCTION AUTOMATIQUE DES S&#201;QUENCES CLITIQUES DANS UN TRADUCTEUR &#192; BASE DE R&#200;GLES
</p>
<p>Souvent, ce syst&#232;me traduit seulement un des deux clitiques dans la s&#233;quence (70.6%), alors que parfois il n&#8217;en
traduit aucun (14%). 9. Quant &#224; Systran, il traduit correctement 75.3% des s&#233;quences clitiques, en atteingnant un
pourcentage de 12.63% de traductions correctes d&#8217;un seul pronom clitique dans la s&#233;quence. Remarquons encore
que Systran ne produit aucune phrase cible sans pronom clitique, mais il a une tendance &#224; mal traduire la phrase
enti&#232;re dans 12% des cas.
</p>
<p>Types de s&#233;quences clitiques Total
le la les y en en lui leur lui leur y
</p>
<p>me 5 5 5 5 5 lui 5 le 5 5 les 5 5 5
te 5 5 5 5 5 leur 5 la 5 5
</p>
<p>nous 5 5 5 5 5 y 5
vous 5 5 5 5 5
</p>
<p>150
</p>
<p>TABLE 1 &#8211; Type de s&#233;quences clitiques et nombre de phrases pour chaque s&#233;quence.
</p>
<p>s&#233;q. cl. traduites 1 seul clitique traduit aucun clitique traduit phrases incorrectes
Google Tr. 15.3% 70.6% 14% &#8211;
</p>
<p>Systran 75.3% 12.6% &#8211; 12%
Its-2 97.3% &#8211; &#8211; 2.7%
</p>
<p>TABLE 2 &#8211; Pourcentages de traductions correctes des s&#233;quences clitiques.
</p>
<p>En ce qui concerne Its-2, il atteint un pourcentage total de traductions correctes des s&#233;quences clitiques de 97.3%
(Table 2). De plus, il ne g&#233;n&#232;re jamais de phrases cibles dans lesquelles seulement un des deux clitiques de la
s&#233;quence est r&#233;alis&#233; ou aucun des deux clitiques de la s&#233;quence n&#8217;est traduit. Soulignons, cependant, que dans
2.7% des cas, Its-2 ne traduit pas correctement une phrase source fran&#231;aise contenant des clitiques. C&#8217;est le cas,
par exemple, de la phrase en (12), dans laquelle Its-2 ne traduit pas correctement le pronom clitique &#8220;y&#8221;.
</p>
<p>(12) Tu les y laisses.
* You leave them to there. (Traduction propos&#233;e par Its-2.)
</p>
<p>You leave them there.
</p>
<p>C&#8217;est encore le cas de phrases comme en (13), o&#249; le syst&#232;me rencontre des difficult&#233;s pour d&#233;terminer le genre du
pronom clitique &#8220;le&#8221; sans aucune information sur son ant&#233;c&#233;dent. Dans ce cas de figure, Its-2 traduit le pronom
clitique fran&#231;ais par le pronom neutre &#8220;it&#8221; en anglais par d&#233;faut.
</p>
<p>(13) Il le lui pr&#233;sentera.
? He will introduce it to him. (Traduction propos&#233;e par Its-2.)
</p>
<p>He will introduce him to him/her.
</p>
<p>Ce probl&#232;me du rep&#233;rage de l&#8217;ant&#233;c&#233;dent d&#8217;un pronom (clitique ou plein) constitue une des am&#233;liorations que
nous entendons porter &#224; notre syst&#232;me, notamment sur la base de travaux tels que ceux de Lappin &amp; Leass (1994)
et de Mitkov (2002), entre autres. Une deuxi&#232;me piste de recherche concerne l&#8217;exploitation des traits s&#233;lectionnels
des verbes, ces traits &#233;tant d&#233;j&#224; pr&#233;sents et utilis&#233;s dans nos lexiques. Pour ce qui est de la premi&#232;re am&#233;lioration,
consid&#233;rons par exemple la phrase en (14a).
</p>
<p>(14) a. I want it. b. Je le veux. c. Je la veux.
</p>
<p>D&#8217;apr&#232;s le contexte, le pronom objet direct en anglais &#8220;it&#8221; pourrait &#234;tre traduit en fran&#231;ais par le pronom clitique
objet direct &#8220;le&#8221;, pour le masculin (14b), ainsi que par le pronom clitique objet direct &#8220;la&#8221;, pour le f&#233;minin (14c).
En absence d&#8217;informations sur le r&#233;f&#233;rent du pronom, il n&#8217;y a aucun moyen de pr&#233;voir la traduction correcte. En
ce qui concerne la deuxi&#232;me am&#233;lioration, consid&#233;rons les phrases en (15).
</p>
<p>(15) a. Je le rencontre. b. Je le lis.
I meet him. I read it.
</p>
<p>Le traits s&#233;lectionnels associ&#233;s aux verbes pourraient &#234;tre tr&#232;s utiles pour la traduction de ces deux phrases. Un
</p>
<p>9. Ces pourcentages confirment des r&#233;sultats similaires discut&#233;s dans les travaux de Russo (2011).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LORENZA RUSSO, &#201;RIC WEHRLI
</p>
<p>verbe comme &#8220;rencontrer&#8221; en (15a) s&#233;lectionne de pr&#233;f&#233;rence un objet direct ayant le trait [+ humain], alors qu&#8217;un
verbe comme &#8220;lire&#8221; in (15b) s&#233;lectionne de pr&#233;f&#233;rence un objet direct ayant le trait [- humain]. 10 Gr&#226;ce &#224; ces
informations, on pourrait traduire en anglais le pronom clitique &#8220;le&#8221; par le masculin &#8220;him&#8221; dans le premier cas de
figure, et par la forme neutre &#8220;it&#8221; dans le deuxi&#232;me. Une telle information est d&#233;j&#224; pr&#233;sente dans notre base de
donn&#233;es lexicale, mais elle n&#8217;est pas encore exploit&#233;e.
</p>
<p>4 Conclusion
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; les probl&#232;mes que les pronoms clitiques posent &#224; un traducteur automatique.
En particulier, nous nous sommes focalis&#233;s sur la paire de langues fran&#231;ais&#8211;anglais, afin de traiter la traduction
des s&#233;quences clitiques tout en exposant la strat&#233;gie utilis&#233;e par notre syst&#232;me pour ce ph&#233;nom&#232;ne linguistique
sp&#233;cifique. Une &#233;valuation sur un petit corpus d&#8217;exemples construits montre que notre syst&#232;me traduit correcte-
ment dans plus de 90% des cas. Bien que les r&#233;sultats obtenus doivent &#234;tre confirm&#233;s par une &#233;valuation sur un
corpus de taille plus importante, ainsi que sur d&#8217;autres syst&#232;mes de traduction automatique, ce que cette &#233;valuation
sugg&#232;re est qu&#8217;un traitement correcte de la cliticisation n&#233;cessite une description syntaxique tr&#232;s fine bas&#233;e sur une
information lexicale d&#233;taill&#233;e.
</p>
<p>R&#233;f&#233;rences
</p>
<p>KAYNE R. S. (1975). French Syntax. The Transformational Cycle. Cambridge : MIT Press.
LAENZLINGER C. (1998). Pronouns. In Comparative Studies in Word Order Variation. Adverbs, Pronouns and
Clause structure in Romance and Germanic, chap. 3, pp. 123&#8211;241. Amsterdam - Philadelphia : John Bejnamins
Publishing Company.
LAPPIN S. &amp; LEASS, H.J. (1994). An algorithm for pronominal anaphora resolution. In Computational Lin-
guistics, 20(4), pp. 535&#8211;561.
LEONI DE L&#201;ON J. A. &amp; MICHOU A. (2006). Traitement des clitiques dans un environement multilingue. In
P. MERTENS, C. FAIRON, A. DISTER &amp; P. WATRIN, Eds., Verbum ex machina : Actes de la 13e conf&#233;rence sur
le traitement automatique des langues naturelles (TALN 2006), Cahiers du Cental 2.1, pp. 541&#8211;550, Louvain-la-
Neuve, Belgique : UCL Presses Universitaires de Louvain.
MITKOV R. &amp;, EVANS, R. &amp; ORA&#774;SAN, C (2002). A new, fully automatic version of Mitkov&#8217;s knowledge-poor
pronoun resolution method. In Proceedings of CICLing &#8217;02, Mexico City.
PERLMUTTER D. M. (1971). Deep and Surface Constraints in Syntax. New York : Holt, Rinehart and Wilson.
POSTAL P. M. (1981). The French Cohesive Infinitive Construction. In Linguistic Analysis, vol. 8.3, pp. 281&#8211;
323.
RUSSO L. (2010). The Automatic Translation of Clitic Pronouns : The Its-2 System. In T. IHSANE &amp; C.
LAENZLINGER, Eds., GG@G - Generative Grammar in Geneva, vol 6 (2010), pp. 201&#8211;220, Gen&#232;ve : Universit&#233;
de Gen&#232;ve.
RUSSO L. (2011). La traduction automatique entre langues proches : les pronoms clitiques en italien et en
fran&#231;ais. In GENEVI&#200;VE BERNARD BARBEAU &amp; CAROLINE GAGN&#201; &amp; GUILLAUME LEBLANC, Eds., Actes
des XXIVes Journ&#233;es de linguistique, pp. 141-153, Qu&#233;bec : CIRAL.
RUSSO L. &amp; WEHRLI &#201;. (2011). Traduction automatique et aide terminologique : le traducteur de mots en
contexte TWiC et le traducteur de phrases Its-2. In C. VALLINI, A. DE MEO &amp; V. CARUSO, Eds., Traduttori e
traduzioni, pp. 301&#8211;310, Napoli : Liguori.
WEHRLI &#201;. (1986). On some properties of French clitic se. In Syntax and Semantics, vol. 19, pp. 263-283, H.
Borer (eds), Academic Press Inc.
WEHRLI &#201;. (2007). Fips, a &quot;Deep&quot; Linguistic Multilingual Parser. In Proceedings of the ACL 2007 Workshop on
Deep Linguistic Processing, pp. 120&#8211;127, Prague, Czech Republic : Association for Computational Linguistics.
</p>
<p>10. Remarquons que les verbes &#8220;rencontrer&#8221; et &#8220;lire&#8221; pourraient aussi s&#233;lectionner des objets directs ayant respectivement le trait [-humain]
(iiia) et le trait [+ humain] (iiib). On consid&#232;re, cependant, ce deuxi&#232;me type de s&#233;lection moins fr&#233;quent par rapport &#224; la s&#233;lection discut&#233;e
dans le texte &#224; l&#8217;exemple (15).
</p>
<p>(iii) a. Ce probl&#232;me, je le rencontre souvent. b. Baudelaire, je le lis avec plaisir.</p>

</div></div>
</body></html>