<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Attribution de r&#244;les s&#233;mantiques aux actants des lexies verbales</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
 
</p>
<p>Attribution de r&#244;les s&#233;mantiques aux actants des lexies verbales 
 
</p>
<p>Fadila Hadouche1   Guy Lapalme1  Marie-Claude L&#8217;Homme2 
 
</p>
<p>(1)  RALI, (2) OLST 
Universit&#233; de Montr&#233;al, C.P 6128 Succursale Centre-ville, Montr&#233;al, Qu&#233;bec, Canada H3C 3J7 
</p>
<p>hadouchf@iro.umontreal.ca, lapalme@iro.umontreal.ca, mc.lhomme@umontreal.ca 
 
</p>
<p>R&#233;sum&#233; 
</p>
<p>Dans cet article, nous traitons de l&#8217;attribution des r&#244;les s&#233;mantiques aux actants de lexies verbales en corpus 
sp&#233;cialis&#233; en fran&#231;ais. Nous proposons une classification de r&#244;les s&#233;mantiques par apprentissage machine 
bas&#233;e sur un corpus de lexies verbales annot&#233;es manuellement du domaine de l&#8217;informatique et d&#8217;Internet. 
Nous proposons &#233;galement une m&#233;thode de partitionnement semi-supervis&#233; pour prendre en compte 
l&#8217;annotation de nouvelles lexies ou de nouveaux r&#244;les s&#233;mantiques et de les int&#233;gr&#233;s dans le syst&#232;me. Cette 
m&#233;thode de partitionnement permet de regrouper les instances d&#8217;actants selon les valeurs communes 
correspondantes aux traits de description des actants dans des groupes d&#8217;instances d&#8217;actants similaires. La 
classification de r&#244;les s&#233;mantique a obtenu une F-mesure de 93% pour Patient, de 90% pour Agent, de 
85% pour Destination et de 76% pour les autres r&#244;les pris ensemble. Quand au partitionnement en 
regroupant les instances selon leur similarit&#233; donne une F-mesure de 88% pour Patient, de 81% pour 
Agent, de 58% pour Destination et de 46% pour les autres r&#244;les. 
</p>
<p>Abstract 
</p>
<p>In this paper, we discuss assigning semantic roles to actants of verbal lexical units in French specialized 
corpus. We propose a machine learning classification of semantic roles based on a corpus of verbal lexical 
units, which are annotated manually in the Informatics and Internet domain. We also propose a semi 
supervised clustering method to consider the annotation of new verbal lexical units or new semantic roles 
and integrated them in the system. Clustering is used to group instances of actants according to their 
common values corresponding to the features describing these actants into groups of similar instances of 
actants. The classification model give an F-measure of  93% for Patient, 90% for Agent, 85% for 
Destination and 76% for other roles. When partitioning by grouping instances according to their similarity 
gives an F-measure of 88% for Patient, 81% for Agent, 58% for Destination and 46% for other roles. 
</p>
<p>Mots-cl&#233;s :   R&#244;les s&#233;mantiques, traits syntaxiques, classification, partitionnement semi-supervis&#233; 
Keywords:   Semantic roles, syntactic features, classification, semi supervised partitioning 
 
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADILA HADOUCHE, GUY LAPALME, MARIE-CLAUDE L&#8217;HOMME 
 
</p>
<p>1 Introduction 
</p>
<p>L&#8217;annotation automatique des structures actantielles joue un r&#244;le important dans les applications du 
traitement automatique des langues naturelles telles que l&#8217;extraction d&#8217;informations, la traduction 
automatique, les questions/r&#233;ponses et le r&#233;sum&#233; automatique. Ainsi Gerhard Fliedner a montr&#233; que 
l&#8217;utilisation d&#8217;annotations automatiques am&#233;liore les performances de ces applications et propose des outils 
de construction d&#8217;un lexique d&#8217;annotation s&#233;mantique [2]. Plusieurs techniques ont &#233;t&#233; explor&#233;es pour 
induire automatiquement des r&#244;les s&#233;mantiques : m&#233;thodes d&#8217;apprentissage non supervis&#233; employant des 
informations lexicales pour d&#233;velopper le classificateur ou m&#233;thodes d&#8217;apprentissage supervis&#233; se basant 
sur les donn&#233;es d&#8217;entra&#238;nement extraites des ressources lexicales PropBank1 ou FrameNet2, particuli&#232;rement 
pour l&#8217;anglais, qui ont aussi servi comme corpus pour entra&#238;ner le classificateur. En langue fran&#231;aise, des 
travaux sont bas&#233;s sur un transfert d&#8217;annotation cross-linguistique [7, 8]  
</p>
<p>Dans notre travail, nous traitons les unit&#233;s lexicales ou lexies3 verbales du fran&#231;ais apparaissant dans des 
contextes, c.-&#224;-d. des phrases tir&#233;es d&#8217;un corpus de textes fran&#231;ais des domaines de l&#8217;informatique et de 
l&#8217;Internet. L&#8217;annotation assigne aux actants de ces lexies verbales des &#233;tiquettes de r&#244;les s&#233;mantiques par 
exemple Agent, Patient, Destination, Instrument, Source, Lieu, Moyen, etc.  Par exemple 
</p>
<p>[Agent Vous]    CLIQUEZ    sur   [Patient le bouton] 
Dans cette phrase, Vous et le bouton r&#233;alisent les deux actants de la lexie verbale CLIQUER. Le premier actant, 
le pronom personnel Vous, le sujet de la lexie verbale joue le r&#244;le s&#233;mantique d&#8217;Agent et le deuxi&#232;me 
actant, le bouton, qui occupe la place du compl&#233;ment joue le r&#244;le de Patient. L&#8217;identification de r&#244;les 
s&#233;mantiques peut aussi concerner les circonstants4 mais, nous nous limitons ici aux actants. Les actants se 
distinguent des circonstants en ce sens qu&#8217;ils participent au sens d&#8217;une lexie pr&#233;dicative. Certains r&#244;les dans 
notre corpus tels que Assaillant, Lieu, Instrument, Source, R&#233;cipient, Cause, Environnement et 
Mat&#233;riau ne sont pas suffisamment repr&#233;sent&#233;s par des exemples. Ceci nous a conduit &#224; rassembler ces 
r&#244;les dans une seule classe appel&#233;e Autre. Dans notre corpus, nous avons un nombre d&#8217;exemples 
respectivement de 1992 Patient, 756 Agent, 370 Destination et 325 les autres r&#244;les. Nous avons ainsi 
restreint la liste des r&#244;les &#224; prendre en compte dans l&#8217;apprentissage machine. La liste finale des r&#244;les &#233;tudi&#233;s 
ici est donc Patient, Agent, Destination et Autre. 
</p>
<p>Nous voulons automatiser la t&#226;che d&#8217;attribution automatique de r&#244;les s&#233;mantiques aux actants des termes 
sp&#233;cialis&#233;s. Nous nous sommes bas&#233;s sur des descriptions actancielles (arguments) existantes r&#233;alis&#233;es &#224; la 
main et enrichies de r&#244;les s&#233;mantiques inspir&#233;s du mod&#232;le de Frame Semantics [1]. Ce corpus est constitu&#233; 
de phrases du fran&#231;ais tir&#233;es d&#8217;un dictionnaire sp&#233;cialis&#233; dans le domaine de l&#8217;informatique (DicoInfo5) 
construit sur la base de la Lexicologie Explicative et combinatoire (LEC). Les unit&#233;s lexicales verbales 
apparaissant dans ces phrases sont annot&#233;es manuellement [5, 6]. L&#8217;annotation manuelle de phrases reste 
une t&#226;che fastidieuse pour les annotateurs et tr&#232;s exigeante en temps, en moyenne 2 heures par lexie. Nous 
proposons un mod&#232;le d&#8217;annotation automatique pour acc&#233;l&#233;rer le temps d&#8217;annotation et faciliter la t&#226;che de 
l&#8217;annotateur. Cette t&#226;che d&#8217;annotation devient une validation des annotations faites par notre syst&#232;me 
automatique. En &#233;vitant une grande partie du travail routinier pour la majorit&#233; des cas simples, le linguiste 
pourra se concentrer sur les cas plus difficiles et plus int&#233;ressants. 
</p>
<p>Dans cet article, nous pr&#233;sentons les traits syntaxiques qui d&#233;crivent les actants extraits &#224; partir de 
l&#8217;analyseur syntaxique du fran&#231;ais Syntex6 sur lesquels sont bas&#233;es la classification et une m&#233;thode de 
partitionnement semi-supervis&#233;.  
</p>
<p>2 D&#233;finition des traits d&#8217;attribution de r&#244;les s&#233;mantiques 
L&#8217;annotation automatique des r&#244;les s&#233;mantiques est bas&#233;e essentiellement sur des traits ou caract&#233;ristiques 
syntaxiques qui d&#233;crivent les actants d&#8217;une lexie verbale dans une phrase. Pour d&#233;finir ces traits, nous nous 
sommes inspir&#233;s des traits utilis&#233;s pour l&#8217;annotation de r&#244;les s&#233;mantiques des unit&#233;s lexicales de l&#8217;anglais 
</p>
<p>                                                          
</p>
<p>1
 PropBank http://verbs.colorado.edu/~mpalmer/projects/ace.html 
</p>
<p>2
 FrameNet http://framenet.icsi.berkeley.edu 
</p>
<p>3
 Dans le pr&#233;sent article, lexie et unit&#233; lexicale sont utilis&#233;es dans le m&#234;me sens.  
</p>
<p>4
 Certains auteurs d&#233;signent les actants par arguments et les circonstants par adjoints. 
</p>
<p>5
 DicoInfo : Dictionnaire fondamental de l&#8217;informatique (http://olst.ling.umontreal.ca/dicoinfo) 
</p>
<p>6
 Analyseur en d&#233;pendances,  Bourigault et al., (http://w3.erss.univ-tlse2.fr/textes/pagespersos/bourigault/syntex.html) </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ATTRIBUTION DE R&#212;LES S&#201;MANTIQUES AUX ACTANTS DES LEXIES VERBALES 
</p>
<p>[4] et des descriptions des donn&#233;es dans notre corpus annot&#233; manuellement. Autre que les fonctions et 
groupes syntaxiques, nous avons d&#233;fini d&#8217;autres caract&#233;ristiques compl&#233;mentaires d&#233;crites au Tableau 1 qui 
construisent les traits sur lesquels est bas&#233; notre mod&#232;le. 
</p>
<p>Caract&#233;ristique Signification Ag Pa De Au 
Lexie Une lexie peut affecter un r&#244;le s&#233;mantique &#224; ses actants : 
</p>
<p>ex. une lexie L1 peut affecter un r&#244;le R1 pour son actant 
sujet alors qu&#8217;une autre lexie L2 lui affectera un r&#244;le R2. 
</p>
<p>14 77 40 37 
</p>
<p>T&#234;te de la lexie La t&#234;te est sous forme d&#8217;une pr&#233;position quand la lexie est 
pr&#233;c&#233;d&#233;e par une pr&#233;position telle que de ou &#224;. Un actant 
sujet d&#8217;une lexie pr&#233;c&#233;d&#233;e par la pr&#233;position &#224; est patient. 
</p>
<p>0 75 0 0 
</p>
<p>Cat&#233;gorie lexie La cat&#233;gorie grammaticale de la lexie (conjugu&#233;, participe 
pass&#233;, participe pr&#233;sent, etc.) 
</p>
<p>0 72 0 0 
</p>
<p>Mot actant La r&#233;alisation de l&#8217;actant de la lexie.  75 81 42 42 
T&#234;te de l&#8217;actant Les actants pr&#233;positionnels jouent des r&#244;les s&#233;mantiques 
</p>
<p>selon la t&#234;te (pr&#233;position utilis&#233;e) : &#224;, avec, dans, sur, pour, 
etc.  
</p>
<p>0 72 0 0 
</p>
<p>Fonct-synt-act Ce sont les fonctions syntaxiques (sujet, objet, lien-
indirect, modificateur, t&#234;te, compl&#233;ment) rencontr&#233;es dans 
notre corpus 
</p>
<p>35 81 55 0 
</p>
<p>Group-synt-act Sont telles que SN (syntagme nominal), SP (syntagme 
pr&#233;positionnel), etc.   
</p>
<p>61 76 0 0 
</p>
<p>Position Position o&#249; appara&#238;t l&#8217;actant par rapport &#224; la lexie. 
&#171; avant ou apr&#232;s &#187; 
</p>
<p>0 72 0 0 
</p>
<p>Distance Le nombre de mots plein qui s&#233;parent un actant de sa lexie 5 72 0 2 
Ordre  Ordre de l&#8217;actant par rapport aux autres actants de la lexie 
</p>
<p>dans une m&#234;me phrase. C.-&#224;-d., s&#8217;il est 1er actant, 2&#232;me 
actant, etc. 
</p>
<p>50 75 60 40 
</p>
<p>Nombre_actant Nombre d&#8217;actants que poss&#232;de la lexie dans le contexte en 
question 
</p>
<p>0 72 2 0 
</p>
<p>Verbe  De pr&#233;ciser le verbe qui apparait entre la lexie et le mot 
actant. Ce verbe peut &#234;tre l&#8217;auxiliaire &#234;tre ou avoir. Il peut 
&#234;tre aussi un verbe modal tel que permettre, demander, 
pouvoir, vouloir etc. qui affectent des r&#244;les s&#233;mantiques 
sp&#233;cifiques. 
</p>
<p>44 74 5 0 
</p>
<p>Nombre_verbe Nombre de verbes qui apparaissent entre la lexie et son 
actant 
</p>
<p>37 87 0 0 
</p>
<p>Tableau 1 Caract&#233;ristiques ou traits d&#233;crivant les actants d&#8217;une lexie verbale. Les 4 derni&#232;res colonnes 
pr&#233;sentent la contribution de ces traits &#224; la classification des r&#244;les s&#233;mantiques en termes de F_mesure en 
pourcentage (%) pour les r&#244;les Agent, Patient, Destination et Autres. Les r&#233;sultats dans ces colonnes sont 
obtenus en testant le syst&#232;me sur un seul trait &#224; la fois. Ainsi la valeur 0 indique que si un trait est utilis&#233; 
</p>
<p>seul ne contribue pas &#224; la pr&#233;diction d&#8217;un r&#244;le mais pourra &#234;tre utile quand il est utilis&#233; avec d&#8217;autres traits 
combin&#233;s. Les r&#233;sultats du syst&#232;me sur tous les traits combin&#233;s sont donn&#233;s au tableau 3 
</p>
<p>Ces traits d&#233;crivent les actants de lexies verbales dans des contextes. Par exemple, dans la phrase 
</p>
<p> [Agent Vous]  CLIQUEZ    sur   [Patient le bouton] 
les actants Vous et le bouton de la lexie CLIQUEZ sont d&#233;crits par les traits du Tableau 2 comme suit  
</p>
<p>lexie t&#234;te Cat. mot t&#234;te FS GS Pos dist ord Verb NbrA NbrV 
Vous ? sujet Pro avant 0 1 ? 2 0 CLIQUER ? Vconj 
bouton ? Objet SP apr&#232;s 1 2 0 2 0 
</p>
<p>Tableau 2 Description des r&#233;alisations d&#8217;actants Vous et bouton de la lexie cliquer 
</p>
<p>Chaque ligne de ce type d&#233;crit un actant d&#8217;une lexie. Nous disposons de 3301 lignes ou instances 
correspondant &#224; chacun des actants de diff&#233;rentes lexies dans des contextes diff&#233;rents rencontr&#233;s dans notre 
corpus. La valeur &#171; ? &#187; ou valeur absente indique que ce trait ne concerne pas l&#8217;actant en question dans ce 
contexte.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADILA HADOUCHE, GUY LAPALME, MARIE-CLAUDE L&#8217;HOMME 
 
</p>
<p>3 Classification de r&#244;les s&#233;mantiques par Weka7 
</p>
<p>Apr&#232;s avoir test&#233; plusieurs classificateurs, il s&#8217;est av&#233;r&#233; que RandomForest est celui qui a donn&#233; les 
meilleurs r&#233;sultats sur nos donn&#233;es d&#233;crites par les traits du Tableau 1. Nous avons d&#8217;abord test&#233; ce 
classificateur en tenant compte des traits individuellement dont les r&#233;sultats sont donn&#233;s dans le Tableau 1. 
Nous constatons que s&#8217;il est assez facile d&#8217;identifier le r&#244;le Patient, les autres r&#244;les sont beaucoup plus 
difficiles &#224; d&#233;partager. La combinaison de ces traits permet de distinguer ou de d&#233;marquer ces r&#244;les 
s&#233;mantiques plus efficacement que de les prendre individuellement. Dans le Tableau 3, nous donnons les 
r&#233;sultats en pr&#233;cision, rappel et F-mesure, du classificateur RandomForest en consid&#233;rant tous les traits. Ces 
r&#233;sultats sont calcul&#233;s sur la validation crois&#233;e (10 folds) du corpus d&#8217;entra&#238;nement compos&#233; de 3301 
actants de lexies diff&#233;rentes. 
</p>
<p>RandomForest  
Pr&#233;cision Rappel F_mesure 
</p>
<p>Agent 0,94 0,86 0,90 
Patient 0,90 0,97 0,93 
Destination 0,90 0,82 0,85 
Autre 0,85 0,69 0,76 
</p>
<p>Tableau 3 Combinaison de tous les traits dans la classification des r&#244;les 
</p>
<p>La classification des r&#244;les s&#233;mantiques donne donc de tr&#232;s bons r&#233;sultats sur les r&#244;les propos&#233;s pour les 
3301 actants rencontr&#233;s dans le corpus. Or nous savons que les r&#244;les s&#233;mantiques ne constituent pas une 
liste finie. Ces derniers sont d&#233;couverts au fur et &#224; mesure que l&#8217;annotation de nouvelles lexies ou donn&#233;es 
est r&#233;alis&#233;e. De nouveaux r&#244;les peuvent appara&#238;tre. L&#8217;objectif premier de notre travail &#233;tait d&#8217;accompagner 
le linguiste annotateur pendant l&#8217;annotation des r&#244;les s&#233;mantiques, notre syst&#232;me devrait donc &#234;tre capable 
de donner &#224; l&#8217;annotateur la possibilit&#233; non seulement de choisir le r&#244;le propos&#233; mais aussi d&#8217;en d&#233;finir un 
nouveau. Pour int&#233;grer cette fa&#231;on de faire dans le syst&#232;me d&#8217;annotation manuel, nous proposons donc de 
classifier les instances d&#8217;actants d&#233;crites &#224; l&#8217;aide des traits d&#233;finis ci-dessus, au lieu de simplement classifier 
les r&#244;les s&#233;mantiques. Nous regroupons toutes les instances proches ou qui partagent les m&#234;mes valeurs des 
traits sugg&#233;r&#233;s dans les m&#234;mes groupes. Nous proposons de faire un partitionnement semi-supervis&#233; sur 
l&#8217;ensemble de nos donn&#233;es pour traiter des lexies verbales non d&#233;j&#224; vu dans le corpus. C'est-&#224;-dire nous 
regroupons les instances dans des partitions selon leur similarit&#233; et ensuite classifions les r&#244;les s&#233;mantiques 
dans ces groupes. Pendant le regroupement, les r&#244;les s&#233;mantiques sont ignor&#233;s. 
</p>
<p>4 Partitionnement semi-supervis&#233; 
</p>
<p>Le partitionnement est un processus de regroupement des donn&#233;es dans des groupes afin que des objets 
dans un m&#234;me groupe aient une similarit&#233; plus &#233;lev&#233;e entre eux qu&#8217;avec les instances d&#8217;un autre groupe. 
Dans notre cas, nous proc&#233;dons au regroupement semi supervis&#233; dont les instances &#224; regrouper poss&#232;dent 
des &#233;tiquettes qui sont les r&#244;les s&#233;mantiques. Dans les regroupements et la mesure de similarit&#233;, les 
&#233;tiquettes de r&#244;les s&#233;mantiques sont ignor&#233;es. Une fois les groupes form&#233;s, nous affectons aux instances 
leurs &#233;tiquettes ainsi nous classifions les &#233;tiquettes dans chaque groupe. Nous regroupons nos donn&#233;es selon 
leur mesure de similarit&#233;. Cette notion de similarit&#233; est bas&#233;e sur les caract&#233;ristiques ou traits communs 
entre les instances. Elle est &#233;gale au nombre de valeurs communes pour ces caract&#233;ristiques divis&#233; par le 
nombre de valeurs de ces caract&#233;ristiques pour les deux actants en comparaison. 
</p>
<p>Nous avons utilis&#233; l&#8217;algorithme CHAM&#201;L&#201;ON (Hierarchical Clustering Using Dynamic Modeling) 
[Karipys 1999] qui fusionne les diff&#233;rents groupements trouv&#233;s dans sa phase de partitionnement de 
mani&#232;re dynamique. Il assure la r&#233;alisation de deux conditions: maximiser la similarit&#233; intra-groupe et 
minimiser la similarit&#233; inter-groupes. Il  op&#232;re en deux phases partitionnement ensuite fusion.  
</p>
<p>5 Exp&#233;rimentation 
</p>
<p>Dans notre exp&#233;rimentation, nous avons divis&#233; notre ensemble de donn&#233;es (3301 instances d&#8217;actant) en 
deux parties. Nous en avons utilis&#233; les 2/3 (2200 instances) pour la formation des groupes, et 1/3 (1101 
instances) pour tester si les groupements sont bien form&#233;s.  
</p>
<p>                                                          
</p>
<p>7
 Weka est d&#233;velopp&#233; &#224; l&#8217;Universit&#233; de Waikato en Nouvelle-Z&#233;lande (www.cs.waikato.ac.nz/ml/weka). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ATTRIBUTION DE R&#212;LES S&#201;MANTIQUES AUX ACTANTS DES LEXIES VERBALES 
</p>
<p>Nous avons appliqu&#233; les deux phases de partitionnement et de fusion de l&#8217;algorithme CHAM&#201;L&#201;ON pour 
former les groupes. Nous avons calcul&#233; les similarit&#233;s de toutes les instances d&#8217;actants, deux &#224; deux en 
utilisant la similarit&#233; d&#233;finie pr&#233;c&#233;demment et nous avons form&#233; une matrice de similarit&#233; qui correspond au 
graphe initial. Ce dernier est partitionn&#233; en sous-graphes en utilisant l&#8217;algorithme de partitionnement du 
package Metis (Karypis 1998) bas&#233; sur k-way partitioning. Ces diff&#233;rentes partitions ou groupes sont 
fusionn&#233;s en mesurant la similarit&#233; entre eux. Ceci est interpr&#233;t&#233; par le calcul de deux mesures entre ces 
groupes : interconnectivit&#233; relative (RI) qui est obtenue par le rapport entre la somme des poids minimaux 
des arcs qui ont permis le partitionnement de ce groupe par rapport &#224; la somme des poids des arcs dans 
chaque groupe; et proximit&#233; relative (RC) qui est obtenu plut&#244;t par la moyenne des poids au lieu de leur 
somme. La fusion se base sur ces deux mesures qui consiste &#224; maximiser RI(Ci,Cj)* RC(Ci,Cj)&#945;. Le choix 
de ces param&#232;tres k nombre de partitions et &#945; est fait en testant plusieurs valeurs. Avec chacune de ces 
valeurs de k (5, 10, 15, 20) et de &#945; (0.5, 1, 1.5, 2, 2.5, 3), nous avons form&#233; des groupements &#224; base des 
2200 instances en appliquant l&#8217;algorithme CHAM&#201;L&#201;ON. Une fois les groupes form&#233;s avec ces valeurs, 
nous avons essay&#233; de classifier les 1101 instances de test dans ces groupes. Nous avons &#233;valu&#233; le r&#233;sultat en 
termes de pr&#233;cision, d&#233;finie par le rapport entre le nombre d&#8217;instances de test correctement classifi&#233;es et la 
somme du nombre d&#8217;instances correctement classifi&#233;es et du nombre d&#8217;instances incorrectement classifi&#233;es; 
et de rappel d&#233;fini par le rapport entre le nombre d&#8217;instances de test correctement classifi&#233;es et le nombre 
total d&#8217;instances de chaque classe. Nous avons pris les valeurs des param&#232;tres qui maximisent la F-mesure. 
Nous avons choisi un nombre de partitions k=20, ce qui permet &#224; CHAM&#201;L&#201;ON de fusionner les partitions 
qui se ressemblent. Si ce nombre est faible, CHAM&#201;L&#201;ON risque de ne pas trouver les groupes naturels. 
Nous avons choisi  &#945;=1 qui donne une m&#234;me importance aux deux mesures RI et RC. 
</p>
<p>Pour chaque groupe form&#233;, nous cherchons des repr&#233;sentants qui peuvent mieux d&#233;crire l&#8217;ensemble des 
&#233;l&#233;ments pouvant appartenir &#224; ce groupe. Ces repr&#233;sentants sont les instances portant un r&#244;le s&#233;mantique &#224; 
associer &#224; chaque groupe. Nous avons propos&#233; de calculer un seuil qui permet de s&#233;lectionner les instances 
repr&#233;sentantes du groupe. Nous avons calcul&#233; pour chaque instance d&#8217;actant son importance ou son poids 
dans le groupe. Ce poids est calcul&#233; en utilisant la mesure de similarit&#233;. Le poids Pi d&#8217;une instance i dans un 
groupe C  est donn&#233; par la somme des similarit&#233;s de cette instance i avec les autres instances j du groupe C 
divis&#233; par la somme des similarit&#233;s entre toutes les paires d&#8217;instances k, j du groupe C. Le poids Pi est 
donn&#233; par : 
</p>
<p>&#8721;
&#8721;
&#8712;
</p>
<p>&#8712;
=
</p>
<p>Cj,k
</p>
<p>Cj
i )j,k(Sim
</p>
<p>)j,i(Sim
P                   
</p>
<p>Le seuil est d&#233;fini par la moyenne des poids de toutes les instances du groupe C. Nous s&#233;lectionnons toutes 
les instances ayant un poids sup&#233;rieur ou &#233;gal &#224; ce seuil comme instances repr&#233;sentantes du groupe C. les 
groupes obtenus sont form&#233;s de ces instances repr&#233;sentantes. 
</p>
<p>Nous avons pris les instances de notre ensemble de test et nous avons cherch&#233; &#224; identifier le groupe dans 
lequel on devrait les classifier en utilisant la m&#234;me similarit&#233; d&#233;finie pr&#233;c&#233;demment. Le Tableau 4, montre 
les r&#233;sultats obtenus par CHAM&#201;L&#201;ON vs classification en utilisant les mesures de pr&#233;cision, de rappel et 
de F-mesure. 
</p>
<p>RandomForest CHAM&#201;L&#201;ON R&#244;les 
s&#233;mantiques Pr&#233;cision Rappel F-mes Pr&#233;cision Rappel F-mes 
Patient 0,90 0,97 0,93 0,88 0,89 0,88 
Agent 0,94 0,86 0,90 0,75 0,88 0,81 
Destination 0,90 0,82 0,85 0,66 0,53 0,58 
Autre 0,85 0,69 0,76 0,62 0,37 0,46 
</p>
<p>Tableau 4 r&#233;sultats de la classification vs partitionnement semi-supervis&#233; 
</p>
<p>La classification donne de meilleurs r&#233;sultats que le partitionnement semi-supervis&#233;. La classification est la 
meilleure pour classifier les r&#244;les s&#233;mantiques et pr&#233;dire des r&#244;les, d&#233;j&#224; existants pour de nouvelles 
instances des lexies d&#233;j&#224; vues. Par contre, elle ne permet pas de prendre en compte de nouveaux r&#244;les et de 
nouvelles lexies.  
</p>
<p>Afin d&#8217;annoter de nouvelles lexies ou de nouveaux r&#244;les, nous avons propos&#233; une approche de 
partitionnement semi supervis&#233;, qui permet de regrouper les instances semblables dans des groupes, afin 
d&#8217;int&#233;grer les nouveaux r&#244;les sugg&#233;r&#233;s par l&#8217;annotateur dans des groupes correspondants. F&#252;rstenau et </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FADILA HADOUCHE, GUY LAPALME, MARIE-CLAUDE L&#8217;HOMME 
 
</p>
<p>Lapata ont aussi propos&#233; un mod&#232;le semi-supervis&#233; d&#8217;annotation de r&#244;les s&#233;mantiques des verbes non d&#233;j&#224; 
vus bas&#233; sur l&#8217;alignement de graphe [3].  
</p>
<p>Nous estimons avoir obtenu des taux de pr&#233;cision et rappel acceptables. Notre mod&#232;le a donn&#233; une F-
mesure de 88% pour Patient, de 81% pour Agent dont le nombre d&#8217;exemples est respectivement de 1992 
et de 792. Les r&#233;sultats obtenus sont comparables &#224; certains travaux similaires effectu&#233;s pour d&#8217;autres 
langues. Pad&#242; et Pitel se sont bas&#233;s sur le FrameNet anglais pour annoter les r&#244;les s&#233;mantiques en fran&#231;ais. 
Ils ont test&#233; en 2007 une projection anglais-fran&#231;ais [7] et ils ont obtenu une F-mesure de 69%. La 
diff&#233;rence avec nos r&#233;sultats est d&#251; au corpus de sp&#233;cialit&#233; que nous avons utilis&#233;, annot&#233; par des 
annotateurs sp&#233;cialistes, dont la variation lexicale est minimale que celle de la langue g&#233;n&#233;rale. Quand aux 
r&#244;les dont le nombre d&#8217;exemples ne d&#233;passe pas les 300, ce mod&#232;le de partitionnement donne une F-mesure 
de 58% pour Destination et de 46% pour Autre. Nous constatons dans ce cas que le nombre d&#8217;exemples 
est important pour atteindre de bons r&#233;sultats tels que le cas de Patient et Agent. 
</p>
<p>Conclusion 
</p>
<p>Nous avons test&#233;  le classificateur RandomForest sur nos donn&#233;es qui a obtenu de bons r&#233;sultats &#224; savoir 
une F-mesure de 93% pour Patient, de 90% pour Agent, de 85% pour Destination et de 76% pour la 
classe Autre. Le corpus annot&#233; et v&#233;rifi&#233; par des linguistes a &#233;t&#233; un grand avantage par rapport &#224; des &#233;tudes 
similaires effectu&#233;es par d&#8217;autres &#233;quipes pour d&#8217;autres langues. Le mod&#232;le de classification permet 
d&#8217;annoter de nouvelles instances de lexies d&#233;j&#224; trait&#233;es,  mais  nous ne pouvons donner que le r&#244;le le plus 
proche dans le cas  d&#8217;une nouvelle lexie avec de nouveaux r&#244;les. Afin d&#8217;int&#233;grer de nouveaux r&#244;les, nous 
avons propos&#233; un partitionnement semi-supervis&#233; pour lesquels nous recalculons les repr&#233;sentants de ces 
groupes en tenant compte des r&#244;les int&#233;gr&#233;s. Ce mod&#232;le de partitionnement a donn&#233; une F-mesure de 88% 
pour Patient, de 81% pour Agent. Quand aux r&#244;les dont le nombre d&#8217;exemples ne d&#233;passe pas les 300 la F-
mesure est de 58% pour Destination et de 46% pour Autre. Nous avons utilis&#233; un corpus bas&#233; sur 
DicoInfo, une ressource construite sur la base de la LEC, une th&#233;orie diff&#233;rente de celle de FrameNet 
d&#233;montrant ainsi qu&#8217;il est possible d&#8217;affecter des r&#244;les s&#233;mantiques dans d&#8217;autres langues sans pour autant 
structurer les donn&#233;es sous la forme ou la hi&#233;rarchie de Framenet ou en passant par la notion de frames. 
</p>
<p>Remerciements 
</p>
<p>Nous tenons &#224; remercier les annotateurs de l&#8217;OLST, particuli&#232;rement Anna&#239;ck Le Serrec, Janine Pimentel, 
Marie-&#200;ve Lanville et Susanne Desgroseilliers, d&#8217;avoir mis &#224; notre disposition le corpus d&#8217;annotation sur 
lequel nous avons travaill&#233; et qui ont valid&#233; les annotations de notre syst&#232;me. Nous remercions &#233;galement le 
CRSH pour le support financier. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>1. FILLMORE C.J. (1982). Frame semantics. Linguistics in the Morning Calm, Seoul:Hanshin, 111-37. 
2. FLIEDNER G. (2003). Tools for building a lexical semantic annotation. Proceedings of  Lorraine-
</p>
<p>Saarland Workshop on Prospects and Advances in the Syntax/Semantic Interface, Loria, Nancy, 
France, 5-9. 
</p>
<p>3. F&#220;RSTENAU H., LAPATA H. (2009). Graph Alignment For Semi-Supervised Semantic role labeling 
In Proceedings of the Conference on Empirical Methods in Natural Language Processing 
(EMNLP 2009), Singapore. 
</p>
<p>4. GILDEA D., JURAFSKY D. (2002). Automatic labeling of semantic roles. Computational 
Linguistics, 28(3): 245-288 
</p>
<p>5. HADOUCHE F. (2011). Annotation syntaxico-s&#233;mantique des actants en corpus sp&#233;cialis&#233;. Th&#232;se de 
Ph.D, Universit&#233; de Montr&#233;al, 148 p. 
</p>
<p>6. HADOUCHE F., L'HOMME M.C., LAPALME G., LE SERREC A. (2009). Int&#233;gration d'informations 
syntaxico-s&#233;mantiques dans les bases de donn&#233;es terminologiques: M&#233;thodologie d'annotation et 
perspectives d'automatisation. First International Workshop on Terminology and Lexical 
Semantics (TLS'09), Montr&#233;al, Canada, 22-31 
</p>
<p>7. PAD&#210; S., PITEL G. (2007). Annotation pr&#233;cise du fran&#231;ais en s&#233;mantique de r&#244;les par projection 
cross-linguistique. Actes de la conf&#233;rence Traitement Automatique des Langues Naturelles 
(TALN), Toulouse, France. 
</p>
<p>8. VAN DER PLAS L, MERLO P., HENDERSON J. (2011). Scaling up Cross-Lingual Semantic Annotation 
Transfer. Actes de la conf&#233;rence ACL/HLT, Portland, &#201;tats-unis. </p>

</div></div>
</body></html>