<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;monstration de l'API de NLGbAse</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#233;monstration de l'API de NLGbAse 
</p>
<p>Fran&#231;ois-Xavier Desmarais, &#201;ric Charton 
</p>
<p>&#201;cole Polytechnique de Montr&#233;al, 2900 boul. Edouard Montpetit, Montr&#233;al, Canada H3T 1J4 
</p>
<p>{francois-xavier.desmarais, eric.charton}@polymtl.ca 
</p>
<p>Description 
</p>
<p>Le syst&#232;me NLGbAse transforme des contenus encyclop&#233;diques en m&#233;tadonn&#233;es. Il utilise ensuite ces 
</p>
<p>m&#233;tadonn&#233;es pour entrainer et faire fonctionner des syst&#232;mes d'&#233;tiquetage de textes [1]. NLGbAse permet 
</p>
<p>d'&#233;tiqueter les entit&#233;s nomm&#233;es (EN) d'un texte en reprenant la taxonomie ESTER [2]. Il peut ensuite &#233;tablir un 
</p>
<p>lien s&#233;mantique entre l'EN identifi&#233;e et sa repr&#233;sentation sur le web s&#233;mantique, notamment son point d'entr&#233;e 
</p>
<p>dans le r&#233;seau LinkedData [3]. Le syst&#232;me NLGbAse est multilingue et peut &#233;tiqueter un texte en fran&#231;ais, 
</p>
<p>anglais ou espagnol. Il peut &#234;tre utilis&#233; en utilisant soit une interface en ligne, soit un API. Notre d&#233;monstration 
</p>
<p>consiste &#224; pr&#233;senter ses fonctionnalit&#233;s. 
</p>
<p>Dans un texte, chaque entit&#233; nomm&#233;e est associ&#233;e &#224; son &#233;tiquette de classe et &#224; des liens. Les liens relient l'EN 
</p>
<p>avec sa page descriptive de Wikipedia (libell&#233; wp) et &#224; un point d'entr&#233;e sur le r&#233;seau LinkedData,  au format 
</p>
<p>&#171; Resource Description Framework &#187; (libell&#233; rdf). 
</p>
<p>L'utilisation de l'interface en ligne n'est appropri&#233;e que pour l'&#233;tiquetage de courts textes et n'autorise qu'une 
</p>
<p>&#233;tude rudimentaire. Pour l'obtention d'un corpus plus large et &#233;tiquet&#233;, une API est disponible. Cette API permet 
</p>
<p>d'envoyer une s&#233;quence de texte depuis un programme PERL et de recevoir en retour une sortie &#233;tiquet&#233;e par 
</p>
<p>NLGbAse, fournie sous la forme de lignes compos&#233;es de cinq colonnes, s&#233;par&#233;es par des tabulations. 
</p>
<p> Le mot (ou ponctuation), la nature du mot (POS), son &#233;tiquette taxonomique (EN), son lien avec sa 
</p>
<p>m&#233;tadonn&#233;es repr&#233;sentative de NLGbAse et un lien vers Dbpedia (qui permet de collecter tous les points 
</p>
<p>d'entr&#233;es disponibles pour un terme sur le r&#233;seau LinkedData). 
</p>
<p>L'API de NLGbAse est disponible gratuitement pour &#233;tiqueter, par p&#233;riode de 24 heures, un maximum de 100 documents  
</p>
<p>d'au plus 10000 caract&#232;res chacun. Des volumes plus importants peuvent &#234;tre allou&#233;s sur demande pour des recherches 
</p>
<p>acad&#233;miques. 
</p>
<p> 
</p>
<p>Bibliographie : 
</p>
<p>[1] Charton, E. &amp; Torres-Moreno, J. (2010). NLGbAse: a free linguistic resource for Natural Language 
</p>
<p>Processing systems. ( Eds.)English, (1), 2621-2625. Proceedings of LREC 2010. 
</p>
<p>[2]  Charton, E. &amp; Torres-Moreno, J. (2009). Classification d'un contenu encyclop&#233;dique en vue d'un &#233;tiquetage 
</p>
<p>par entit&#233;s nomm&#233;es. Dans Taln 2009 , volume 1, pages 24&#8211;26. TALN. 
</p>
<p>[3] Charton, E., Gagnon, M., &amp; Ozell, B. (2010). Extension d&#700;un syst&#232;me d'&#233;tiquetage d'entit&#233;s nomm&#233;es en 
</p>
<p>&#233;tiqueteur s&#233;mantique. Actes de TALN 2010, 1(1), 19-23. </p>

</div></div>
</body></html>