<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Vers la d&#233;tection des dislocations &#224; gauche dans les transcriptions automatiques du Fran&#231;ais parl&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Vers la d&#233;tection des dislocations &#224; gauche dans les transcriptions
automatiques du Fran&#231;ais parl&#233;
</p>
<p>Corinna Anderson1 Christophe Cerisara1 Claire Gardent1
</p>
<p>(1) LORIA-CNRS UMR 7503, Campus Scientifique, Vandoeuvre-les-Nancy
{andersoc,cerisara,gardent}@loria.fr
</p>
<p>R&#233;sum&#233;. Ce travail prend place dans le cadre plus g&#233;n&#233;ral du d&#233;veloppement d&#8217;une plate-forme d&#8217;analyse
syntaxique du fran&#231;ais parl&#233;. Nous d&#233;crivons la conception d&#8217;un mod&#232;le automatique pour r&#233;soudre le lien ana-
phorique pr&#233;sent dans les dislocations &#224; gauche dans un corpus de fran&#231;ais parl&#233; radiophonique. La d&#233;tection de
ces structures devrait permettre &#224; terme d&#8217;am&#233;liorer notre analyseur syntaxique en enrichissant les informations
prises en compte dans nos mod&#232;les automatiques. La r&#233;solution du lien anaphorique est r&#233;alis&#233;e en deux &#233;tapes :
un premier niveau &#224; base de r&#232;gles filtre les configurations candidates, et un second niveau s&#8217;appuie sur un mod&#232;le
appris selon le crit&#232;re du maximum d&#8217;entropie. Une &#233;valuation exp&#233;rimentale r&#233;alis&#233;e par validation crois&#233;e sur
un corpus annot&#233; manuellement donne une F-mesure de l&#8217;ordre de 40%.
</p>
<p>Abstract. Left dislocations are an important distinguishing feature of spoken French. In this paper, we
present a hybrid approach for detecting the coreferential link that holds between left-dislocated elements and
the coreferential pronoun occurring further on in the sentence. The approach combines a symbolic graph rewrite
step with a maximum entropy classifier and achieves around 40% F-score. We conjecture that developing such
approaches could contribute to the general anaphora resolution task and help improve parsers trained on corpora
enriched with left dislocation anaphoric links.
</p>
<p>Mots-cl&#233;s : D&#233;tection des dislocations &#224; gauche, Maximum Entropy, fran&#231;ais parl&#233;.
</p>
<p>Keywords: Left dislocation detection, Maximum Entropy, spoken French.
</p>
<p>1 Introduction
Les dislocations sont consid&#233;r&#233;es depuis longtemps comme des caract&#233;ristiques importantes du Fran&#231;ais parl&#233; (De Cat,
2007; Delais-Roussarie et al., 2004; Hirschbuhler, 1975; Lambrecht, 1994). Bien qu&#8217;elles apparaissent plus fr&#233;-
quemment dans la parole spontan&#233;e, il n&#8217;est pas rare de les trouver &#233;galement dans de nombreux autres registres
du fran&#231;ais oral, et ce depuis au moins le XVII&#232;me si&#232;cle (De Cat, 2007; Blanche-Benveniste, 1997).
</p>
<p>Une caract&#233;ristique li&#233;e &#224; la d&#233;finition des dislocations &#224; gauche est qu&#8217;elles impliquent un lien cor&#233;f&#233;rentiel entre
l&#8217;&#233;l&#233;ment disloqu&#233; and un pronom situ&#233; plus loin dans la phrase. Ainsi, le traitement des dislocations &#224; gauche
contribue au domaine plus g&#233;n&#233;ral qui est celui de la r&#233;solution des anaphores. De plus, l&#8217;annotation automatique
ou semi-automatique de ces liens cor&#233;f&#233;rentiels constitue une information potentiellement utile pour am&#233;liorer la
qualit&#233; des analyseurs syntaxiques automatiques de l&#8217;oral.
</p>
<p>Nous nous int&#233;ressons dans cet article &#224; ce probl&#232;me et pr&#233;sentons une approche hybride de r&#233;solution des liens
de cor&#233;f&#233;rence entre les &#233;l&#233;ments disloqu&#233;s &#224; gauche et le pronom correspondant. Nous d&#233;crivons au paragraphe 2
la syntaxe des dislocations &#224; gauche en l&#8217;illustrant avec des exemples extraits du corpus radiophonique ESTER
du fran&#231;ais parl&#233;, initialement con&#231;u pour les campagnes d&#8217;&#233;valuation nationales des syst&#232;mes de transcription
automatique de la parole (Gravier et al., 2004). Notre m&#233;thodologie est ensuite d&#233;crite au paragraphe 3, ainsi que
les r&#233;sultats exp&#233;rimentaux. Le paragraphe 4 conclut l&#8217;article en pr&#233;sentant notamment quelques perspectives.
</p>
<p>2 Dislocation &#224; gauche : syntaxe et cor&#233;f&#233;rence
Une dislocation &#224; gauche peut &#234;tre d&#233;finie comme une expression situ&#233;e dans un voisinage gauche d&#8217;une proposi-
tion qui contient un pronom pr&#233;sentant un lien de cor&#233;f&#233;rence avec cette expression, comme l&#8217;illustre l&#8217;exemple (Ex.1)
dans le cas d&#8217;une phrase simple, et les exemples (Ex.2,3) pour une proposition subordonn&#233;e. Notons qu&#8217;une s&#233;pa-
ration hi&#233;rarchique entre le constituant disloqu&#233; et le pronom comme dans (Ex.3) n&#8217;a aucun effet sur la cor&#233;f&#233;rence.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C. ANDERSON, C. CERISARA ET C. GARDENT
</p>
<p>Ex.1 : [ ma question ] elle est simplement par rapport au respect des uns et des autres
Ex.2 : je crois que [ l&#8217; &#233;tat d&#8217; esprit que &#231;a d&#233;note ] c&#8217; est pousse toi de l&#224; que je m&#8217; y mette quoi
Ex.3 : et tous les jours je constate que [ le v&#233;hicule qui me suit ] quelques fois j&#8217; ai bien du mal &#224; lire [ sa plaque
d&#8217; immatriculation] car je ne le voit pas il est trop pr&#232;s
</p>
<p>La dislocation &#224; gauche pr&#233;sente souvent un contour intonatif caract&#233;ristique avec une pro&#233;minence prosodique de
l&#8217;&#233;l&#233;ment disloqu&#233;, &#233;ventuellement per&#231;ue comme &#233;tant suivie d&#8217;un court silence (De Cat, 2007). Toutefois, nous
ne nous traiterons dans le reste de cet article que des aspects syntaxiques des dislocations.
</p>
<p>Syntaxe Nous noterons dans la suite respectivement l&#8217;&#233;l&#233;ment disloqu&#233; &#224; gauche et l&#8217;expression interne &#224; la
proposition par les acronymes EDG et EIP. En fran&#231;ais, l&#8217;&#233;l&#233;ment disloqu&#233; &#224; gauche, bien qu&#8217;il soit typiquement
nominal, peut appartenir &#224; diff&#233;rentes cat&#233;gories syntaxiques : phrase/syntagme simple (Ex.4,6) ou complexe
(Ex.5,7), pronom demonstratif ou &quot;emphatique&quot; (Ex.8,9), syntagme pr&#233;positionel (Ex.10), proposition infinitive
(Ex.11), adjectif, voire un mot d&#8217;une toute autre cat&#233;gorie comme dans (Ex.12).
</p>
<p>Ex.4 : oh [ cette vague ] effectivement elle existe
Ex.5 : mais [ ce qui est euh tr&#232;s dangereux ] c&#8217; est de ne pas avoir son attention euh sur la route
Ex.6 : tout n&#8217; est pas rose entre guillemets euh [ l&#8217; &#233;clatement du Front National ] je m&#8217; en r&#233;jouis
Ex.7 : et pour elle [le seul partenaire euh qui existe qui soit digne de consid&#233;ration que se soit en terme d&#8217; ennemi
ou en terme plus positif] ce sont les Etats-Unis
Ex.8 : et [ &#231;a ] par contre on ne le verbalise pas
Ex.9 : donc euh [ moi ] j&#8217; ai vraiment appris &#224; avoir confiance en moi &#224; travers euh le th&#233;&#226;tre quoi
Ex.10 : eh ben [ &#224; France-Inter ] en effet vous y &#234;tes
Ex.11 : [ payer ces m&#234;mes imp&#244;ts ] c&#8217; est d&#233;j&#224; possible sur le net
Ex.12 : [ universel ] c&#8217; est notre mot du jour
</p>
<p>L&#8217;EDG peut &#234;tre li&#233; avec un (Ex.14) ou plusieurs (Ex.13) pronoms parmi ceux apparaissant dans une m&#234;me phrase.
Ex.13 : je sens que [cette d&#233;cision] je dois vous la donner rapidement puisque vous l&#8217;attendez depuis longtemps
Ex.14 : mais [ la situation sociale ] on le voit bien elle est tr&#232;s tendue avec un appel &#224; la gr&#232;ve g&#233;n&#233;rale
</p>
<p>L&#8217;&#233;l&#233;ment EIP est en g&#233;n&#233;ral un pronom personnel ou d&#233;monstratif, mais ce r&#244;le peut &#233;galement &#234;tre tenu par un
&#233;pith&#232;te, nom commun (Ex.15), ou article possessif (Ex.3).
</p>
<p>Ex.15 : [ Droits de l&#8217;Homme ] le num&#233;ro un chinois aborde pr&#233;cis&#233;ment le sujet dans une interview
</p>
<p>Dans nos exp&#233;rimentations, nous nous focalisons sur les dislocations &#224; gauche dont l&#8217;&#233;l&#233;ment disloqu&#233; est nominal,
pronominal ou infinitif. De plus, l&#8217;&#233;l&#233;ment EIP doit &#234;tre un pronom personnel, possessif ou d&#233;monstratif 1, ce qui
repr&#233;sente 92 % des instances de dislocations &#224; gauche dans notre corpus. Les 8 % de dislocations &#224; gauche
restantes, comme (Ex.8,9), seront comptabilis&#233;es comme des erreurs syst&#233;matiques pour nos approches.
</p>
<p>payer ces m&#234;mes imp&#244;ts c&#8217; est d&#233;j&#224; possible sur le netq
</p>
<p>D
IS
</p>
<p>L
O
</p>
<p>C
</p>
<p>qDET qMODq OB
J
</p>
<p>qSUJq
</p>
<p>JU
X
</p>
<p>T
</p>
<p>qMODq ATTS q MOD qDETq COMP
</p>
<p>FIG. 1 &#8211; Exemple d&#8217;annotation d&#8217;une dislocation &#224; gauche : les d&#233;pendances au-dessus de la phrase correspondent
aux d&#233;pendances syntaxiques obtenues automatiquement ; l&#8217;annotation de la dislocation &#224; gauche appara&#238;t sous la
phrase. Le petit rond noir &#224; l&#8217;extr&#233;mit&#233; des arcs repr&#233;sentent la t&#234;te, ou gouverneur, de la relation.
</p>
<p>Cor&#233;f&#233;rence Dans une phrase avec dislocation, l&#8217;EDG et l&#8217;EIP partagent une seule r&#233;f&#233;rence, mais avec des
fonctions differentes : lorsque l&#8217;EDG exprime l&#8217;identit&#233; r&#233;f&#233;rentielle en l&#8217;annon&#231;ant comme topic, l&#8217;EIP marque
le r&#244;le syntaxique dans la phrase (Lambrecht, 1994). L&#8217;EIP peut avoir un r&#244;le quelconque ; on a vu des exemples
d&#8217;objet direct (Ex.3,8,13), indirect (Ex.6) et modifieur (Ex.10). N&#233;anmoins, 89 % des dislocations &#224; gauche dans
</p>
<p>1De m&#234;me, nous ne consid&#233;rons pas non plus les inversions de sujet complexes comme des instances de dislocations &#224; gauche, car &#224; la
diff&#233;rence des v&#233;ritables dislocations, il n&#8217;existe pas de phrase &#233;quivalente contenant l&#8217;expression nominale complexe sans le pronom.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#201;TECTION DES DISLOCATIONS &#192; GAUCHE DANS LE FRAN&#199;AIS PARL&#201;
</p>
<p>notre corpus correspondent au sujet d&#8217;une proposition principale ou subordonn&#233;e ; des chiffres similaires (82.5 %
&#224; 85,5 %) ont &#233;t&#233; d&#233;couverts par Antoine et Goulian (2001) pour tout type d&#8217;ant&#233;position, dislocation et extraction
&#224; gauche dans les dialogues, sans distinguer les dislocations des autres structures.
</p>
<p>&#192; la diff&#233;rence de la plupart des relations de cor&#233;f&#233;rence dans la phrase, il y a peu de contraintes quant au r&#244;le
ou la position &#224; laquelle le pronom doit appara&#238;tre. Les deux &#233;l&#233;ments EDG et EIP peuvent &#234;tre s&#233;par&#233;s par une
distance arbitraire, &#224; la fois lin&#233;airement et structurellement (c&#8217;est-&#224;-dire qu&#8217;ils peuvent appara&#238;tre &#224; tous les ni-
veaux d&#8217;une hi&#233;rarchie de la phrase). Ainsi, il n&#8217;existe pas d&#8217;indices structurels simples, comme par exemple le
fait d&#8217;&#234;tre argument ou d&#233;pendant d&#8217;un certain verbe, permettant d&#8217;identifier les pronoms participant &#224; la disloca-
tion &#224; gauche. En fait, le pronom r&#233;f&#233;rentiel d&#8217;une dislocation se comporte exactement comme d&#8217;autres pronoms
cor&#233;f&#233;rents d&#8217;expressions introduites pr&#233;c&#233;demment dans le discours ou dans un contexte extralinguistique ; leur
domaine est la phrase enti&#232;re.
</p>
<p>3 M&#233;thodologie et validation exp&#233;rimentale
</p>
<p>Notre objectif est de r&#233;soudre automatiquement les liens de cor&#233;f&#233;rence entre les &#233;l&#233;ments EDG et EIP &#224; partir des
seules transcriptions de la parole en fran&#231;ais, annot&#233;es par un analyseur syntaxique automatique. Nous proc&#233;dons
en deux &#233;tapes. Tout d&#8217;abord, un filtre symbolique est appliqu&#233; pour extraire automatiquement un ensemble de
candidats possibles pour les dislocations &#224; gauche &#224; partir du corpus initial. Ensuite, un classifieur bas&#233; sur le
principe de maximum d&#8217;entropie, qui ne requiert pas d&#8217;hypoth&#232;se d&#8217;ind&#233;pendance entre les indices en entr&#233;e, est
utilis&#233; pour s&#233;lectionner, parmi ces candidats, ceux correspondant le plus vraisemblablement &#224; des dislocations &#224;
gauche. Il y a donc deux classes possibles, selon qu&#8217;il s&#8217;agisse d&#8217;une dislocation &#224; gauche ou non.
</p>
<p>3.1 Corpus et annotations
</p>
<p>Corpus de travail Le corpus choisi pour entra&#238;ner et tester notre syst&#232;me est extrait du corpus ESTER, qui
contient des enregistrements de radios francophones et est utilis&#233; dans les campagnes d&#8217;&#233;valuation nationale des
syst&#232;mes de transcription automatique (Gravier et al., 2004). Une analyse r&#233;alis&#233;e sur un &#233;chantillon de 10 000
mots de ce corpus montre qu&#8217;il contient environ 60 % de parole &quot;pr&#233;par&#233;e&quot;, c&#8217;est-&#224;-dire prononc&#233;e par un journa-
liste, et 40 % de parole plus spontan&#233;e, correspondant &#224; des interviews et commentaires de personnes invit&#233;es ou
enregistr&#233;es par t&#233;l&#233;phone. Les dislocations &#224; gauche sont en r&#232;gle g&#233;n&#233;ral consid&#233;r&#233;es comme caract&#233;ristiques de
la parole spontan&#233;e, mais nous observons que 4 &#8240; des mots de notre corpus font partie d&#8217;une dislocation, quel
que soit le type de parole.
</p>
<p>Ponctuation, annotations syntaxiques et cor&#233;f&#233;rentielles Dans une grande partie du corpus ESTER original,
les transcriptions sont manuellement annot&#233;es avec de la ponctuation. Nous utilisons donc les trois symboles de
ponctuation [. ? !] caract&#233;ristiques des fins de phrase pour segmenter automatiquement le corpus en phrases. En-
suite, nous supprimons tous les symboles de ponctuation du texte, afin de se rapprocher le plus possible des condi-
tions obtenues en sortie d&#8217;un syst&#232;me de transcription automatique, qui ne produit aucun symbole de ponctuation.
Nous utilisons alors le Treetagger (Schmid, 1994) pour annoter automatiquement les classes morphosyntaxiques
des mots et le MaltParser (Nivre et al., 2007) pour ajouter les arbres de d&#233;pendances. Le MaltParser a pr&#233;alable-
ment &#233;t&#233; entra&#238;n&#233; sur 50 000 mots du corpus ESTER annot&#233;s manuellement en d&#233;pendances syntaxiques (Cerisara
et al., 2010). Les performances de cet analyseur atteignent un LAS (Labeled Attachment Score) de 76 % sur
un corpus de test &#233;galement extrait de ESTER. Les phrases ainsi pr&#233;par&#233;es sont alors annot&#233;es manuellement en
dislocations, en ajoutant un lien de cor&#233;f&#233;rence de la t&#234;te du syntagme disloqu&#233; vers le pronom r&#233;f&#233;rentiel ; ainsi,
les mots payer et c&#8217; sont li&#233;s (Fig.1), alors que l&#8217;&#233;l&#233;ment disloqu&#233; est en fait le syntagme entier payer ces memes
impots. Cette t&#226;che d&#8217;annotation est r&#233;alis&#233;e gr&#226;ce au logiciel JSafran (Cerisara et al., 2010), qui g&#232;re des graphes
d&#8217;annotation sur plusieurs niveaux. Les dislocations &#224; gauche et &#224; droite sont toutes deux ainsi annot&#233;es, mais
seules les dislocations &#224; gauche sont utilis&#233;es dans la suite de ce travail.
</p>
<p>Le corpus final obtenu est compos&#233; de 1735 phrases contenant 35 000 mots. Il contient 84 dislocations &#224; gauche
dans 79 phrases. Toutes les exp&#233;riences suivantes sont r&#233;alis&#233;es par validation crois&#233;e en 10 parties, qui est une
configuration standard fr&#233;quemment utilis&#233;e lorsque la taille du corpus ne permet pas d&#8217;extraire deux corpus
ind&#233;pendants pour l&#8217;apprentissage et le test.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C. ANDERSON, C. CERISARA ET C. GARDENT
</p>
<p>3.2 D&#233;tection des liens cor&#233;f&#233;rentiels des dislocations &#224; gauche
</p>
<p>Filtre symbolique Nous avons con&#231;u des r&#232;gles de r&#233;&#233;criture de graphes pour identifier les candidats EDG-EIP
possibles et ajouter pour chaque candidat un lien cor&#233;f&#233;rentiel de EDG vers EIP. Ces r&#232;gles s&#8217;appuient sur des
expressions r&#233;guli&#232;res sur les graphes exploitant les mots, leur position, leur classe morphosyntaxique et leurs
d&#233;pendances syntaxiques. Intuitivement, ces r&#232;gles comparent les classes morphosyntaxiques des mots avec une
liste pr&#233;d&#233;finie pour ne retenir que les &#233;l&#233;ments EDG potentiels, puis cherchent des pronoms situ&#233;s plus loin dans la
phrase. Les classes retenues sont : les noms propres et communs, les verbes &#224; l&#8217;infinitif, les pronoms d&#233;monstratifs
(&quot;&#231;a&quot;) et possessifs (&quot;le sien&quot;). Notons que les classes morphosyntaxiques sont obtenues automatiquement, et
certaines d&#8217;entre elles sont donc erron&#233;es, ce qui constitue une source d&#8217;erreur pour notre syst&#232;me de d&#233;tection et
pour l&#8217;analyseur syntaxique. Une autre condition concerne l&#8217;existence d&#8217;un sujet apr&#232;s l&#8217;&#233;l&#233;ment EDG, sujet qui
peut pr&#233;c&#233;der ou co&#239;ncider avec le pronom EIP. Ce sujet permet de situer la fronti&#232;re gauche d&#8217;une proposition
finie, et donc du domaine du pronom candidat de la dislocation qui le pr&#233;c&#232;de. Cette approche est motiv&#233;e par
plusieurs observations. En premier lieu, toutes les phrases en fran&#231;ais ont un sujet explicite qui marque la fronti&#232;re
gauche de la proposition. De plus, les sujets sont relativement bien identifi&#233;s par l&#8217;analyseur syntaxique, ce qui
limite l&#8217;impact de cette source d&#8217;erreurs. Les sujets potentiels multiples, notamment avec les dislocations &#224; gauche
et les clitiques compl&#233;ments d&#8217;objet ambigus, ainsi que les modifieurs contenant un nom, sont une source de sur-
identification de candidats de dislocation, mais aussi l&#8217;un des indicateurs importants pour l&#8217;identification des EDG.
Ce premier filtre identifie environ 20 000 candidats potentiels qui sont transmis &#224; la seconde &#233;tape.
</p>
<p>Classification automatique des candidats disloqu&#233;s &#224; gauche Nous avons utilis&#233; la librairie OpenNLP 2 pour
entra&#238;ner un mod&#232;le &#224; maximum d&#8217;entropie sur le corpus d&#233;crit pr&#233;c&#233;demment. Seuls les candidats retenus par le
premier filtre sont consid&#233;r&#233;s dans ce mod&#232;le, afin d&#8217;exploiter au mieux les param&#232;tres du mod&#232;le en n&#8217;apprenant
que les exemples ambigus et pertinents. De fait, des exp&#233;riences pr&#233;liminaires ont montr&#233; que, sans ce premier
filtre, les performances du mod&#232;le chutent de pr&#232;s de 10 % absolus. Le r&#244;le du premier filtre est donc important,
car il permet au classifieur de se focaliser sur les zones importantes de l&#8217;espace des donn&#233;es. Les observations
utilis&#233;es dans le mod&#232;le &#224; maximum d&#8217;entropie sont les suivantes : (1) Les classes morphosyntaxiques de EDG et
EIP ; (2) Les &#233;tiquettes des d&#233;pendances partant de EDG de EIP ; (3) La distance lin&#233;aire entre EDG et EIP ; et
(4) La position relative du gouverneur syntaxique de EDG.
</p>
<p>Les observations (1) sont triviales. Les indices (2) exploitent la structure arborescente en d&#233;pendances syntaxiques.
La distance lin&#233;aire entre EDG et EIP est exprim&#233;e en nombre de mots : elle repr&#233;sente intuitivement le fait
que les dislocations proches, comme celles impliquant des sujets et objets clitiques, sont plus fr&#233;quentes que les
dislocations lointaines. Afin de limiter le nombre de param&#232;tres du mod&#232;le, ces distances sont &#233;chantillonn&#233;es et
peuvent prendre seulement 4 valeurs : 1, 2, 3 ou 4+. L&#8217;indice (4) est calcul&#233; en comparant la position du gouverneur
GOVEDG relativement &#224; EDG et EIP, et peut prendre 4 valeurs :
</p>
<p>GOVEDG &lt; EDG EDG &lt; GOVEDG &lt; EIP GOVEDG = EIP GOVEDG &gt; EIP
</p>
<p>0
</p>
<p>0.2
</p>
<p>0.4
</p>
<p>0.6
</p>
<p>0.8
</p>
<p>1
</p>
<p>0 0.2 0.4 0.6 0.8 1
</p>
<p>FIG. 2 &#8211; Courbe DET (Detection Error Tradeoff) de la d&#233;tection des dislocations &#224; gauche. L&#8217;axe des X repr&#233;sente
le taux de faux rejets et l&#8217;axe des Y celui des fausses acceptations.
</p>
<p>2http://incubator.apache.org/opennlp</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>D&#201;TECTION DES DISLOCATIONS &#192; GAUCHE DANS LE FRAN&#199;AIS PARL&#201;
</p>
<p>3.3 R&#233;sultats exp&#233;rimentaux
Les m&#233;triques d&#8217;&#233;valuation choisies sont (1) le rappel-pr&#233;cision classique, (2) la courbe DET (Detection Error
Tradeoff (Martin et al., 1997)), qui donne un aper&#231;u global des performances pour tous les seuils possibles, et (3)
l&#8217;erreur &#233;gale (EER) qui repr&#233;sente le point de la courbe DET pour lequel sp&#233;cificit&#233; et sensibilit&#233; sont &#233;gales.
</p>
<p>Performance globales La figure 2 affiche la courbe DET de d&#233;tection des dislocations &#224; gauche &#224; la sortie du
classifieur. Cette courbe est d&#8217;autant meilleure qu&#8217;elle se rapproche des axes. La partie de la courbe en bas &#224; droite
correspond &#224; des seuils de d&#233;tection tr&#232;s s&#233;lectifs qui ne retiennent que tr&#232;s peu de dislocations, mais seulement les
plus vraisemblables. La partie de la courbe en haut &#224; gauche correspond &#224; des seuils tr&#232;s permissifs qui acceptent
de nombreux candidats, mais qui n&#8217;en omettent id&#233;alement aucun. En pratique, la partie gauche de la courbe est
translat&#233;e de 8 % vers la droite, ce qui correspond aux erreurs (faux n&#233;gatifs) syst&#233;matiques du premier filtre.
</p>
<p>Une valeur de rappel et pr&#233;cision peut &#234;tre calcul&#233;e en chaque point de la courbe. Nous donnons les trois valeurs
les plus int&#233;ressantes dans le tableau suivant :
</p>
<p>Position sur la figure 2 Pr&#233;cision Rappel F-mesure
Pr&#232;s de l&#8217;extr&#233;mit&#233; gauche 1 % 92 % 2 %
Au centre 43 % 43 % 43 %
Pr&#232;s de l&#8217;extr&#233;mit&#233; droite 50 % 10 % 17 %
</p>
<p>La F-mesure obtenue en choisissant au hasard pour chaque candidat si c&#8217;est une dislocation ou non, selon la
probabilit&#233; a priori de chaque cas, est de 2 %. D&#8217;autre part, le faible nombre de dislocations cr&#233;e un intervalle de
confiance statistique assez large : la F-mesure au centre de la courbe est ainsi comprise entre 32 % et 53 %.
</p>
<p>Utilit&#233; des observations Le tableau suivant pr&#233;sente les performances du d&#233;tecteur en taux d&#8217;erreurs &#233;gales
selon les types des observations.
</p>
<p>Observations Equal Error Rate
Classes morphosyntaxiques de EDG et EIP 27.7%
+ &#233;tiquettes des d&#233;pendances 23.2%
+ distance entre EDG et EIP 17.6%
+ position relative du gouverneur de EDG 13.5%
</p>
<p>TAB. 1 &#8211; Performances de d&#233;tection selon le type des observations.
</p>
<p>Cette exp&#233;rience est utile pour valider les diff&#233;rentes cat&#233;gories d&#8217;indices propos&#233;s, et montrer qu&#8217;aucun d&#8217;entre
eux n&#8217;est inutile. Elle permet &#233;galement de montrer que chaque type d&#8217;indices apporte une information diff&#233;rente
des autres, au moins en partie. Ces r&#233;sultats confirment ainsi exp&#233;rimentalement l&#8217;intuition selon laquelle les
dislocations &#224; gauche affectent et/ou d&#233;pendent de mani&#232;re significative d&#8217;au moins trois niveaux diff&#233;rents : la
morphosyntaxe, les structures syntaxiques et l&#8217;ordre et la position des mots dans la phrase.
</p>
<p>Discussion La d&#233;tection des dislocations &#224; gauche est relativement similaire &#224; la probl&#233;matique de r&#233;solution
des anaphores, notamment parce qu&#8217;il n&#8217;y a pas de relation syntaxique directe entre les &#233;l&#233;ments cor&#233;f&#233;rents. C&#8217;est
pourquoi l&#8217;architecture du syst&#232;me propos&#233; dans ce travail suit les principes g&#233;n&#233;raux des syst&#232;mes les plus r&#233;cents
con&#231;us pour la r&#233;solution des pronoms, tels que d&#233;crits dans (Poesio et al., 2010). Toutefois, il existe &#233;galement des
diff&#233;rences fondamentales entre la t&#226;che de d&#233;tection des dislocations &#224; gauche et les autres syst&#232;mes de r&#233;solution
d&#8217;anaphores. En particulier :
&#8211; Alors que la r&#233;solution d&#8217;anaphores vise &#224; lier ensemble toutes les instances de la m&#234;me entit&#233;, nous nous
</p>
<p>focalisons seulement sur une r&#233;solution locale au sein d&#8217;une m&#234;me phrase en liant l&#8217;&#233;l&#233;ment disloqu&#233; au pronom
r&#233;f&#233;rentiel associ&#233; dans la phrase.
</p>
<p>&#8211; Tout comme dans le probl&#232;me g&#233;n&#233;ral de r&#233;solution des pronoms, nous voulons &#233;galement discriminer les
diff&#233;rents pronoms qui font r&#233;f&#233;rence au m&#234;me ant&#233;c&#233;dent des autres pronoms qui, soit ne poss&#232;dent aucun
r&#233;f&#233;rent, comme dans &quot;il y a du pain&quot;, ou alors poss&#232;dent un ant&#233;c&#233;dent implicite. Mais nous voulons de plus
discriminer les pronoms qui sont impliqu&#233;s dans une dislocation de ceux qui ne le sont pas.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>C. ANDERSON, C. CERISARA ET C. GARDENT
</p>
<p>&#8211; (Poesio et al., 2010) identifie trois types d&#8217;indices utiles pour la r&#233;solution d&#8217;anaphore : la syntaxe, des connais-
sances de &quot;sens commun&quot; et la saillance cognitive. Dans ce travail, nous &#233;laborons des indices similaires en nous
contraignant &#224; exploiter uniquement ceux qui peuvent &#234;tre produits &#224; la sortie d&#8217;un syst&#232;me de reconnaissance
automatique de la parole en fran&#231;ais, et en particulier issus d&#8217;une analyse syntaxique.
</p>
<p>4 Conclusions
Nous avons pr&#233;sent&#233; dans cet article la conception et l&#8217;impl&#233;mentation d&#8217;un syst&#232;me de r&#233;solution des liens de
cor&#233;f&#233;rence pour les cas de dislocations &#224; gauche dans un corpus de fran&#231;ais parl&#233;. Ce syst&#232;me d&#233;tecte les dis-
locations &#224; gauche en deux &#233;tapes. La premi&#232;re &#233;tape utilise des r&#232;gles de transformation de graphes d&#233;finies de
mani&#232;re experte pour filtrer les &#233;l&#233;ments candidats de la phrase pouvant potentiellement constituer une dislocation
&#224; gauche. Ce filtre utilise essentiellement des contraintes sur les classes morphosyntaxiques des candidats et leurs
positions dans l&#8217;&#233;nonc&#233; decoup&#233; / la phrase d&#233;coup&#233;e. La deuxi&#232;me &#233;tape utilise un mod&#232;le bas&#233; sur le principe
du maximum d&#8217;entropie pour classifier chacun de ces candidats comme relevant effectivement d&#8217;une dislocation
ou non. Ce mod&#232;le exploite seulement des indices syntaxiques et lexicaux. Les exp&#233;riences r&#233;alis&#233;es sur une
sous-partie du corpus radiophonique fran&#231;ais ESTER montrent que notre syst&#232;me atteint une F-mesure de 43 %.
</p>
<p>Ce syst&#232;me peut &#234;tre am&#233;lior&#233; de nombreuses fa&#231;ons. Tout d&#8217;abord, d&#8217;autres indices classiquement utilis&#233;s pour la
r&#233;solution de cor&#233;f&#233;rence peuvent &#234;tre ajout&#233;s, notamment la prosodie ainsi que les pr&#233;f&#233;rences lexicales des argu-
ments des pr&#233;dicats. Augmenter la taille du corpus d&#8217;apprentissage devrait &#233;galement am&#233;liorer les performances
du mod&#232;le, notamment en y incluant plus d&#8217;exemples r&#233;presentatifs et plusieurs sous-types connus de dislocation
qui ne figurent pas dans notre &#233;chantillon de corpus. Une fois que des performances satisfaisantes auront ainsi
&#233;t&#233; atteintes, nous envisagerons alors d&#8217;int&#233;grer les informations produites par le syst&#232;me de d&#233;tection des dislo-
cations &#224; gauche en tant que nouveaux indices dans notre mod&#232;le d&#8217;analyse syntaxique, ce qui devrait avoir un
impact positif sur les performances d&#8217;analyse syntaxique du fran&#231;ais parl&#233; spontan&#233;. Le processus r&#233;sultant, de
l&#8217;analyse vers la d&#233;tection des dislocations, puis &#224; nouveau vers l&#8217;analyse pourrait &#234;tre it&#233;r&#233; jusqu&#8217;&#224; convergence.
Finalement, nous pourrons enfin tester ce syst&#232;me int&#233;gr&#233; sur de v&#233;ritables transcriptions automatiques de la pa-
role. Mais ces objectifs &#224; long terme requi&#232;rent de mener auparavant &#224; bien des recherches visant &#224; am&#233;liorer la
robustesse de l&#8217;analyse syntaxique aux erreurs de reconnaissance de la parole.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BLANCHE-BENVENISTE (1997). Approches de la langue parl&#233;e en fran&#231;ais. Paris : Ophry.
CERISARA C., GARDENT C. &amp; ANDERSON C. (2010). Building and exploiting a dependency treebank for
French radio broadcasts. In Proc. Intl Workshop on Treebanks and Linguistic Theories (TLT), Tartu, Estonia.
DE CAT C. (2007). French Dislocation. Interpretation, Syntax, Acquisition. Oxford :OUP.
DELAIS-ROUSSARIE E., DOETJES J. &amp; SLEEMAN P. (2004). Handbook of French Semantics, chapter Dislo-
cation, p. 501&#8211;529. Stanford : CLSI Publications.
GRAVIER G., BONASTRE J.-F., GALLIANO S., GEOFFROIS E., TAIT K. M. &amp; CHOUKRI K. (2004). ESTER,
une campagne d&#8217;&#233;valuation des syst&#232;mes d&#8217;indexation d&#8217;&#233;missions radiophoniques. In Proc. JEP, Fez.
HIRSCHBUHLER P. (1975). On the source of lefthand NPs in French. Linguistic Inquiry, p. 155&#8211;165.
LAMBRECHT K. (1994). Information Structure and Sentence Form : Topic, Focus and the Mental Representa-
tions of Discourse Referents. Cambridge University Press.
MARTIN A., DODDINGTON G., KAMM T., ORDOWSKI M. &amp; PRZYBOCKI M. (1997). The DET curve in
assessment of detection task performance. In Proc. Eurospeech, p. 1895&#8211;1898.
NIVRE J., HALL J., NILSSON J., CHANEV A., ERYIGIT G., K&#220;BLER S., MARINOV S. &amp; MARSI E. (2007).
MaltParser : a language-independent system for data-driven dependency parsing. Natural Language Engineering,
13(2), 95&#8211;135.
POESIO M., PONZETTO S. P. &amp; VERSLEY Y. (2010). Computational models of anaphora resolution : A
survey. to be published ; available at http://clic.cimec.unitn.it/massimo/Publications/
lilt.pdf.
SCHMID H. (1994). Probabilistic Part-of-Speech Tagging Using Decision Trees. In Proc. International Confe-
rence on New Methods in Language Processing, p. 44&#8211;49.</p>

</div></div>
</body></html>