<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Extraction d&#8217;informations m&#233;dicales au LIMSI</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Extraction d&#8217;informations m&#233;dicales au LIMSI
</p>
<p>Cyril Grouin1, Louise Del&#233;ger1, Anne-Lyse Minard1,
Anne-Laure Ligozat1, Asma Ben Abacha1, Delphine Bernhard1,
</p>
<p>Bruno Cartoni2, Brigitte Grau1, Sophie Rosset1, Pierre Zweigenbaum1
</p>
<p>(1) LIMSI-CNRS, BP133, 91403 Orsay Cedex, France
(2) D&#233;partement de Linguistique, Universit&#233; de Gen&#232;ve, Suisse
</p>
<p>{prenom.nom}@limsi.fr, bruno.cartoni@unige.ch, louise.deleger@cchmc.org
</p>
<p>Les textes pr&#233;sents dans les dossiers de patients dans les h&#244;pitaux contiennent des informations pr&#233;cieuses pour
diverses t&#226;ches m&#233;dicales comme par exemple la prise de d&#233;cision diagnostique et th&#233;rapeutique. Il est de ce
fait utile de chercher &#224; extraire automatiquement ces informations. R&#233;cemment, des &#233;valuations internationales
annuelles de syst&#232;mes d&#8217;extraction d&#8217;informations &#224; partir de documents cliniques en anglais ont &#233;t&#233; organis&#233;es
par l&#8217;institut i2b2 aux &#201;tats-Unis (Uzuner et al., 2010). Cette d&#233;monstration pr&#233;sente de fa&#231;on concr&#232;te les outils
mis en place au LIMSI pour participer aux &#233;valuations i2b2 2009 et i2b2/VA 2010. Ces outils prennent en entr&#233;e
les phrases d&#8217;un texte en anglais, et utilisent au besoin les annotations r&#233;alis&#233;es par des outils pr&#233;c&#233;demment
appliqu&#233;s, pour d&#233;tecter les informations requises, fournies sous la forme d&#8217;annotations d&#233;port&#233;es. R&#233;sultats en
2009 : F=0.773, 8e/20 ; en 2010 : F=0.773, 12e/22 (piste 1), F=0.931, 5e/21 (piste 2), F=0.709, 3e/16 (piste 3).
</p>
<p>La t&#226;che 2009 consistait &#224; extraire les prescriptions m&#233;dicamenteuses (m&#233;dicament, dosage, fr&#233;quence, quantit&#233;,
mode d&#8217;administration, dur&#233;e, et raison de la prescription). Notre m&#233;thode repose sur des lexiques et l&#8217;observation
des r&#233;gularit&#233;s d&#8217;expression de ces prescriptions, impl&#233;ment&#233;es sous la forme de patrons fond&#233;s sur les classes
s&#233;mantiques correspondant aux types d&#8217;informations recherch&#233;es (Del&#233;ger et al., 2010; Grouin et al., 2011).
</p>
<p>Trois t&#226;ches &#233;taient propos&#233;es en 2010 : (i) d&#233;tection de trois types de concepts m&#233;dicaux : probl&#232;mes (maladies,
sympt&#244;mes), traitements (y compris m&#233;dicamenteux) et examens ; (ii) d&#233;termination du statut d&#8217;un probl&#232;me
m&#233;dical (pr&#233;sent, absent, hypoth&#233;tique, etc.) ; et (iii) d&#233;tection de sept types de relations entre probl&#232;mes, traite-
ments et examens. Nous avons mis en place des m&#233;thodes &#224; base de connaissances expertes et de TAL (lexiques,
patrons, &#233;tiquetage morphosyntaxique, analyse syntaxique) ainsi que des m&#233;thodes &#224; base d&#8217;apprentissage super-
vis&#233; (SVM, CRF) entra&#238;n&#233;es sur les corpus annot&#233;s fournis par les organisateurs de la campagne (Bernhard &amp;
Ligozat, 2011; Grouin et al., 2011; Minard et al., 2011a,b), et cherch&#233; &#224; combiner ces deux types de m&#233;thodes.
</p>
<p>Ce travail a &#233;t&#233; partiellement financ&#233; par les projets Akenaton (ANR-07-TecSan-001), InterSTIS (ANR-07-TecSan-
010) et Qu&#230;ro (financement Oseo, agence fran&#231;aise pour l&#8217;innovation et la recherche).
</p>
<p>R&#233;f&#233;rences
</p>
<p>BERNHARD D. &amp; LIGOZAT A.-L. (2011). Analyse automatique de la modalit&#233; et du niveau de certitude :
application au domaine m&#233;dical. In TALN 2011, Montpellier. &#192; para&#238;tre.
DEL&#201;GER L., GROUIN C. &amp; ZWEIGENBAUM P. (2010). Extracting medical information from narrative patient
records : the case of medication-related information. J Am Med Inform Assoc, 17, 555&#8211;558.
GROUIN C., DEL&#201;GER L., CARTONI B., ROSSET S. &amp; ZWEIGENBAUM P. (2011). Acc&#232;s au contenu s&#233;man-
tique en langue de sp&#233;cialit&#233; : extraction des prescriptions et concepts m&#233;dicaux. In TALN 2011. &#192; para&#238;tre.
MINARD A.-L., LIGOZAT A.-L., BEN ABACHA A., BERNHARD D., CARTONI B., DEL&#201;GER L., GRAU B.,
ROSSET S., ZWEIGENBAUM P. &amp; GROUIN C. (2011a). Hybrid methods for improving information access in
clinical documents : Concept, assertion, and relation identification. J Am Med Inform Assoc. &#192; para&#238;tre.
MINARD A.-L., LIGOZAT A.-L. &amp; GRAU B. (2011b). Extraction de relations dans des comptes rendus hospi-
taliers. In Actes des 22emes Journ&#233;es francophones d&#8217;Ing&#233;nierie des Connaissances.
UZUNER O., SOLTI I. &amp; CADAG E. (2010). Extracting medication information from clinical text. J Am Med
Inform Assoc, 17(5), 514&#8211;518.</p>

</div></div>
</body></html>