<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Strat&#233;gie d&#8217;exploration de corpus multi-annot&#233;s avec GlozzQL</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Strat&#233;gie d&#8217;exploration de corpus multi-annot&#233;s avec GlozzQL
</p>
<p>Yann Mathet1 Antoine Widl&#246;cher1
</p>
<p>(1) GREYC, UMR CNRS 6072, Universit&#233; de Caen, 14032 Caen Cedex
{pr&#233;nom.nom}@unicaen.fr
</p>
<p>R&#233;sum&#233;. La multiplication des travaux sur corpus, en linguistique computationnelle et en TAL, conduit
&#224; la multiplication des campagnes d&#8217;annotation et des corpus multi-annot&#233;s, porteurs d&#8217;informations relatives &#224;
des ph&#233;nom&#232;nes vari&#233;s, envisag&#233;s par des annotateurs multiples, parfois automatiques. Pour mieux comprendre les
ph&#233;nom&#232;nes que ces campagnes prennent pour objets, ou pour contr&#244;ler les donn&#233;es en vue de l&#8217;&#233;tablissement d&#8217;un
corpus de r&#233;f&#233;rence, il est n&#233;cessaire de disposer d&#8217;outils permettant d&#8217;explorer les annotations. Nous pr&#233;sentons
une strat&#233;gie possible et son op&#233;rationalisation dans la plate-forme Glozz par le langage GlozzQL.
</p>
<p>Abstract. More and more works in compuational linguistics and NLP rely on corpora. They lead to an
increasing number of annotation campaigns and multi-annotated corpora, providing informations on various lin-
guistic phenomena, annotated by several annotators or computational processes. In order to understand these lin-
guistic phenomena, or to control annotated data, tools dedicated to annotated data mining are needed. We present
here an exploration strategy and its implementation within the Glozz platform, GlozzQL.
</p>
<p>Mots-cl&#233;s, Keywords: Corpus, Annotation, Exploration, GlozzQL.
</p>
<p>1 Besoins en exploration de corpus
</p>
<p>De nombreux travaux sur corpus, en linguistique computationnelle et en TAL, donnent lieu &#224; des campagnes d&#8217;an-
notation et &#224; la production de corpus multi-annot&#233;s. Pour mieux comprendre les ph&#233;nom&#232;nes que ces campagnes
prennent pour objets, pour assister le processus d&#8217;annotation et pour contr&#244;ler son r&#233;sultat, il est n&#233;cessaire de dis-
poser d&#8217;outils et de m&#233;thodes permettant d&#8217;interroger les annotations. Avant d&#8217;introduire le langage GlozzQL, qui
en permet l&#8217;exploration, nous commencerons par indiquer les caract&#233;ristiques des donn&#233;es auxquelles il s&#8217;applique
et pr&#233;senter le m&#233;ta-mod&#232;le sur lequel il repose.
</p>
<p>1.1 Corpus multi-annot&#233;s
</p>
<p>Apr&#232;s avoir insist&#233; sur le fait que nous ne visons pas la mise en place d&#8217;un environnement d&#233;di&#233; &#224; l&#8217;&#233;tude
d&#8217;une configuration linguistique particuli&#232;re, mais la d&#233;finition de strat&#233;gies permettant l&#8217;exploration combin&#233;e
de ph&#233;nom&#232;nes h&#233;t&#233;rog&#232;nes, nous pouvons en particulier mettre en avant les propri&#233;t&#233;s suivantes. Donn&#233;es multi-
annotateurs : Les donn&#233;es explor&#233;es sont le fruit d&#8217;annotations r&#233;alis&#233;es par plusieurs annotateurs. Elles peuvent
porter sur les m&#234;mes textes et sur les m&#234;mes objets et on souhaitera souvent pouvoir les confronter. Vari&#233;t&#233;
cat&#233;gorielle : Ces corpus annot&#233;s sont porteurs d&#8217;informations linguistiques et infra-linguistiques (par exemple
typo-dispositionnelles) h&#233;t&#233;rog&#232;nes correspondant &#224; diff&#233;rents points de vue sur le mat&#233;riau textuel. Ainsi, par
exemple, on pourra disposer d&#8217;un &#233;tiquetage morpho-syntaxique, d&#8217;indications de d&#233;pendance r&#233;sultant d&#8217;une
analyse syntaxique, du rep&#233;rage d&#8217;occurrences d&#8217;&#233;l&#233;ments de lexiques... Configurations structurellement va-
ri&#233;es : Les diff&#233;rents ph&#233;nom&#232;nes annotables rel&#232;vent de modes de structuration fortement h&#233;t&#233;rog&#232;nes. Certaines
approches identifient ainsi, par exemple, des segments textuels (unit&#233;s morphologiques, entit&#233;s nomm&#233;es, seg-
ments th&#233;matiques...), l&#224; o&#249; d&#8217;autres se concentrent sur l&#8217;identification de relations entre des objets plus ou moins
distants (relations syntaxiques, relations s&#233;mantiques de coh&#233;rence...) ou sur la reconnaissance de dispositifs plus
complexes (cha&#238;nes de cor&#233;f&#233;rence, structures &#233;num&#233;ratives...). Granularit&#233; variable : Ces diff&#233;rentes structures
op&#232;rent &#224; des &#233;chelles pouvant varier fortement. Si le mot constitue ainsi souvent l&#8217;&#233;chelle &#233;l&#233;mentaire, les annota-
tions syntaxiques prendront place &#224; l&#8217;&#233;chelle de la phrase et les annotations discursives (par exemple th&#233;matiques)
pourront d&#233;border les &#233;chelles phrastiques. Topologies vari&#233;es : La distribution des diff&#233;rents ph&#233;nom&#232;nes r&#233;pond
&#224; des &#171; topologies &#187; vari&#233;es : parfois juxtapos&#233;s, les objets pourront aussi &#234;tre imbriqu&#233;s ou se chevaucher.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>1.2 Exploration de corpus annot&#233;s
</p>
<p>En quoi l&#8217;exploration de corpus annot&#233;s peut-elle alors consister ? Du point de vue de sa finalit&#233; et de ses usages,
disons qu&#8217;elle vise souvent &#224; nous assister dans la recherche d&#8217;une meilleure compr&#233;hension de ph&#233;nom&#232;nes
&#233;tudi&#233;s. Dans d&#8217;autres cas, elle permettra, une fois le ph&#233;nom&#232;ne bien connu et annot&#233;, de naviguer entre ses
occurrences, par exemple pour analyser leur population (analyse de fr&#233;quence, de corr&#233;lations...) ou v&#233;rifier que
les occurrences ont &#233;t&#233; annot&#233;es conform&#233;ment au mod&#232;le d&#8217;annotation fix&#233;. Dans la plupart des cas, l&#8217;exploration
doit nous permettre de valider certaines hypoth&#232;ses relatives &#224; des ph&#233;nom&#232;nes, ou nous mettre sur la voie de
leur formulation. On pourra alors distinguer des t&#226;ches d&#8217;exploration, en fonction du degr&#233; de supervision dont
elles font l&#8217;objet, de la pure &#171; d&#233;couverte &#187; &#224; la validation d&#8217;une hypoth&#232;se d&#233;j&#224; finement formul&#233;e. Au-del&#224;
de la diversit&#233; des usages, nous proposons de d&#233;finir l&#8217;exploration de corpus comme la confrontation entre les
donn&#233;es d&#8217;un corpus et un mod&#232;le (&#233;ventuellement partiel) de ph&#233;nom&#232;ne exploitant des informations disponibles
(donn&#233;es textuelles brutes, annotations pr&#233;alables, informations typo-dispositionnelles...), mod&#232;le visant &#224; isoler
les propri&#233;t&#233;s r&#233;currentes des configurations vis&#233;es et pouvant &#234;tre aussi peu contraignant que possible dans le cas
de l&#8217;exploration ouverte (fouille de texte, certaines approches statistiques...) ou au contraire tr&#232;s contraint dans le
cas de la validation d&#8217;un mod&#232;le th&#233;orique ou op&#233;ratoire bien &#233;tabli.
</p>
<p>Explorer un corpus c&#8217;est alors exprimer un mod&#232;le d&#8217;un ph&#233;nom&#232;ne observ&#233;, mod&#232;le faisant r&#233;f&#233;rence aux donn&#233;es
disponibles. L&#8217;expression de ce mod&#232;le devra s&#8217;appuyer sur un formalisme permettant de le d&#233;crire, en fixant les
contraintes que devront v&#233;rifier des configurations textuelles pour &#234;tre regard&#233;es comme instances dudit mod&#232;le.
La question se pose d&#232;s lors de savoir quel formalisme permettra de proc&#233;der &#224; cette description. Pour r&#233;pondre &#224;
cette question, il est n&#233;cessaire d&#8217;interroger l&#8217;ad&#233;quation entre tel ou tel formalisme de repr&#233;sentation et telle ou
telle famille de configurations linguistiques. Pour une m&#233;thode d&#8217;exploration de corpus d&#233;di&#233;e &#224; un ph&#233;nom&#232;ne
particulier, on pourra s&#8217;appuyer sur un formalisme permettant la repr&#233;sentation de configurations structurellement
homog&#232;nes (motifs s&#233;quentiels, arbres syntaxiques...). Pour l&#8217;exploration combin&#233;e de structures h&#233;t&#233;rog&#232;nes, on
s&#8217;appuiera id&#233;alement sur un formalisme suffisamment versatile autorisant la repr&#233;sentation, dans un langage uni-
fi&#233;, d&#8217;objets structurellement tr&#232;s diff&#233;rents. Ajoutons que le choix du formalisme d&#8217;interrogation doit &#233;galement
&#234;tre guid&#233;, en plus de son expressivit&#233;, par sa d&#233;clarativit&#233; et son aptitude &#224; masquer l&#8217;appareil proc&#233;dural qui
prendra en charge l&#8217;analyse effective des donn&#233;es.
</p>
<p>Se pose &#233;galement la question de la place que doit occuper l&#8217;exploration de corpus au sein du dispositif exp&#233;ri-
mental. Si un usage classique des outils d&#8217;exploration est d&#8217;&#233;tudier un corpus apr&#232;s annotation de ce dernier, leur
utilisation au sein m&#234;me du processus d&#8217;annotation peut aussi se r&#233;v&#233;ler pertinente. En effet, l&#8217;annotation manuelle
de corpus consiste souvent &#224; op&#233;rer de fa&#231;on incr&#233;mentale en alternant phases d&#8217;observation et d&#8217;annotation.
</p>
<p>Enfin, il est important de pr&#233;ciser que le syst&#232;me d&#8217;exploration de corpus devra &#234;tre coupl&#233; &#224; un m&#233;canisme de
retour au texte permettant, &#233;tant donn&#233;e une liste d&#8217;occurrences correspondant aux contraintes exprim&#233;es, de les
consulter in situ.
</p>
<p>1.3 &#201;tat de l&#8217;art
</p>
<p>Guid&#233;e par l&#8217;expression d&#8217;un mod&#232;le, l&#8217;exploration de corpus pourra s&#8217;appuyer sur des outils d&#233;di&#233;s &#224; une famille
tr&#232;s sp&#233;cifique de configurations linguistiques. De ce point de vue, tout formalisme d&#8217;expression de r&#232;gles et de
contraintes consacr&#233; &#224; un domaine d&#8217;&#233;tude particulier ou &#224; un paradigme formel particulier, coupl&#233; &#224; un analyseur
automatique1, pourrait &#234;tre utilis&#233; pour une exploration ainsi orient&#233;e. Il permet en effet par nature de mettre en
relation des informations pr&#233;existantes (par exemple morphologiques) pour d&#233;couvrir des configurations d&#8217;ordre
sup&#233;rieur (par exemple syntaxiques) et pourra donc &#234;tre exploit&#233; pour interroger le corpus. Toutefois, de tels
dispositifs ont principalement pour objectif d&#8217;annoter automatiquement un corpus et ne visent pas prioritairement
&#224; produire des repr&#233;sentations synth&#233;tiques (liste d&#8217;occurrences, concordanciers...). De plus, souvent d&#233;di&#233;s &#224;
un type d&#8217;objet, il ne permettent pas d&#8217;interroger conjointement des &#233;l&#233;ments h&#233;t&#233;rog&#232;nes, pour explorer leurs
&#233;ventuelles corr&#233;lations avec les structures vis&#233;es. Enfin, et plus g&#233;n&#233;ralement, ces structures vis&#233;es ne pourront
appartenir qu&#8217;&#224; des cat&#233;gories restreintes : un formalisme d&#233;di&#233; &#224; l&#8217;analyse syntaxique ne permettra souvent pas
d&#8217;explorer des structures th&#233;matiques ou des cha&#238;nes de cor&#233;f&#233;rence.
</p>
<p>Le besoin d&#8217;interroger des donn&#233;es relatives &#224; des ph&#233;nom&#232;nes linguistiques vari&#233;s et structurellement h&#233;t&#233;rog&#232;nes
</p>
<p>1&#201;voquons par exemple le cas d&#8217;Unitex (Paumier, 2003), pour les approches orient&#233;es-automates.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>STRAT&#201;GIE D&#8217;EXPLORATION DE CORPUS MULTI-ANNOT&#201;S AVEC GLOZZQL
</p>
<p>pourra trouver une r&#233;ponse partielle dans l&#8217;utilisation d&#8217;environnements int&#233;gr&#233;s d&#8217;exp&#233;rimentation et d&#8217;annota-
tion automatique tels que GATE (Cunningham et al., 2002), LinguaStream (Widl&#246;cher &amp; Bilhaut, 2008), ou encore
UIMA, dans l&#8217;utilisation qui en est faite en TAL, par exemple par (Hernandez et al., 2010). De tels environne-
ments reposent en effet sur des mod&#232;les d&#8217;annotation suffisamment abstraits pour qu&#8217;il soit possible de repr&#233;senter
des objets linguistiques vari&#233;s et de les interroger de mani&#232;re unifi&#233;e, conform&#233;ment &#224; notre programme. De plus,
ces environnements proposent des formalismes de repr&#233;sentation de r&#232;gles vari&#233;s (r&#232;gles s&#233;quentielles, automates,
grammaires de contraintes...) permettant d&#8217;encoder des mod&#232;les linguistiques tr&#232;s h&#233;t&#233;rog&#232;nes, afin de les projeter
sur corpus. S&#8217;il est souvent possible, en aval d&#8217;une cha&#238;ne de traitement, de visualiser et d&#8217;explorer les donn&#233;es
annot&#233;es, et si les formalismes propos&#233;s peuvent &#234;tre mis au service d&#8217;un travail d&#8217;exploration, il convient cepen-
dant de noter que ces outils sont prioritairement destin&#233;s &#224; l&#8217;annotation automatique et qu&#8217;ils exigent un travail de
mise en &#339;uvre trop important pour la seule exploration de donn&#233;es pr&#233;-constitu&#233;es.
</p>
<p>D&#8217;autres travaux s&#8217;orientent davantage vers la mise en place d&#8217;environnements d&#8217;exploration de corpus multi-
annot&#233;s. Si CorpusReader (Loiseau, 2008) prend place sur ce terrain de l&#8217;exploration de corpus, il convient de
noter qu&#8217;il se situe en amont de l&#8217;exploration proprement dite, davantage charg&#233; de la constitution des observables
que de leur interrogation. Il vise en effet principalement &#224; int&#233;grer des annotations issues de plusieurs niveaux de
description linguistique et d&#8217;analyseurs vari&#233;s, en pr&#233;alable de l&#8217;&#233;tude des corr&#233;lations entre ces niveaux. Du reste,
la pr&#233;paration des donn&#233;es pour laquelle il a &#233;t&#233; initialement pens&#233; l&#8217;oriente de mani&#232;re privil&#233;gi&#233;e vers des &#233;tudes
statistiques, au demeurant non int&#233;gr&#233;es &#224; l&#8217;outil lui-m&#234;me. La plate-forme Annis (Chiarcos et al., 2008) offre
l&#8217;environnement d&#8217;exploration de corpus multi-annot&#233;s le plus proche de nos pr&#233;occupations. Elle s&#8217;appuie sur le
mod&#232;le g&#233;n&#233;rique Paula qui permet d&#8217;exploiter des annotations provenant d&#8217;outils vari&#233;s, proc&#233;dant &#224; des niveaux
d&#8217;analyse &#233;ventuellement diff&#233;rents, et est directement op&#233;rationnelle avec nombre de documents d&#233;j&#224; annot&#233;s.
Elle dispose d&#8217;un langage d&#8217;interrogation unifi&#233;, AnnisQL, qui permet d&#8217;adresser des requ&#234;tes &#224; ces annotations
h&#233;t&#233;rog&#232;nes. Cependant, ces travaux privil&#233;gient l&#8217;interop&#233;rabilit&#233; et l&#8217;interrogation d&#8217;annotations pr&#233;existantes,
l&#224; o&#249; nous souhaitons permettre d&#8217;interroger les donn&#233;es pendant le processus d&#8217;annotation, pour le guider.
</p>
<p>2 Cadre th&#233;orique et op&#233;rationnel
</p>
<p>La mulitpliciti&#233; des ph&#233;nom&#232;nes linguistiques observables conduit assez naturellement &#224; la multiplicit&#233; des mo-
d&#232;les, des th&#233;ories, formalismes et formats permettant d&#8217;en rendre compte. Or nous souhaitons pouvoir &#233;tudier de
mani&#232;re unifi&#233;e ces ph&#233;nom&#232;nes h&#233;t&#233;rog&#232;nes, pouvoir explorer leurs combinaisons et interactions.
</p>
<p>Afin d&#8217;uniformiser la repr&#233;sentation des ph&#233;nom&#232;nes observables et annotables, nous nous appuyons sur le m&#233;ta-
mod&#232;le URS (pour Unit&#233;-Relation-Sch&#233;ma), issu de (Widl&#246;cher, 2008), qui propose un cadre th&#233;orique abstrait,
non d&#233;di&#233; &#224; telle ou telle th&#233;orie ou &#224; tel ou tel type d&#8217;objet, et permettant cons&#233;quemment la description de
mod&#232;les linguistiques vari&#233;s. Dans le cadre fix&#233; par le m&#233;ta-mod&#232;le, des mod&#232;les sp&#233;cifiques, relatifs &#224; telle ou
telle th&#233;orie, peuvent &#234;tre exprim&#233;s, en d&#233;clarant les classes d&#8217;objets linguistiques identifiables et en explicitant la
mani&#232;re sont leurs instances doivent &#234;tre caract&#233;ris&#233;es.
</p>
<p>!&quot;#$%&amp;'()*&amp;&quot;+
</p>
<p>,-&amp;.&amp;$%
</p>
<p>&quot;# % '( &quot;
</p>
<p>-
</p>
<p>!&quot;#$%&amp;'()*&amp;&quot;+
</p>
<p>/$#%
</p>
<p>&quot;# % '( &quot;
</p>
<p>#
</p>
<p>!&quot;#$%&amp;'()*&amp;&quot;+
</p>
<p>0&amp;-)%#1$
</p>
<p>&quot;# % '( &quot;
</p>
<p>- #
</p>
<p>!&quot;#$%&amp;'()*&amp;&quot;+
</p>
<p>2*3&amp;.)
</p>
<p>&quot;# % '( &quot;
</p>
<p>4
</p>
<p>5667
8&amp;)%9'&amp;2&amp;%
</p>
<p>5
</p>
<p>FIG. 1 &#8211; Diagramme de classes UML du m&#233;ta-mod&#232;le URS
</p>
<p>Repr&#233;sent&#233; par la figure 1, ce m&#233;ta-mod&#232;le repose sur l&#8217;articulation de trois cat&#233;gories abstraites d&#8217;&#233;l&#233;ments, qui
repr&#233;sentent l&#8217;ensemble des objets manipulables. Ces &#233;l&#233;ments peuvent &#234;tre plus sp&#233;cifiquement des unit&#233;s, des re-
lations ou des sch&#233;mas. Tous sont caract&#233;ris&#233;s par un type, qui explicite typiquement leur cat&#233;gorie linguistique, et
par un ensemble de traits qui repr&#233;sentent leurs propri&#233;t&#233;s. Les cat&#233;gories manipulables, les traits disponibles pour
un type donn&#233; et les valeurs qu&#8217;ils peuvent prendre d&#233;pendent d&#8217;un mod&#232;le d&#8217;annotation sp&#233;cifique d&#233;fini pour
une campagne donn&#233;e. La notion d&#8217;unit&#233; renvoie &#224; des segments textuels, de taille quelconque : mots, syntagmes,
phrases, segments th&#233;matiques... Une relation d&#233;signe un lien, orient&#233; ou non, entre deux &#233;l&#233;ments. Si les relations</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>entre unit&#233;s sont les plus utilis&#233;es, notons que l&#8217;expressivit&#233; du m&#233;ta-mod&#232;le autorise &#233;galement la d&#233;finition de
relations portant sur des sch&#233;mas ou des relations. Relations syntaxiques de d&#233;pendance et relations s&#233;mantiques
de coh&#233;rence consituent des exemples bien connus de telles relations. Les sch&#233;mas peuvent pour leur part &#234;tre
utilis&#233;s pour repr&#233;senter des configurations complexes, &#233;ventuellement r&#233;cursives, impliquant une combinaison
quelconque d&#8217;&#233;lements de plus bas niveau (unit&#233;s, relations ou sch&#233;mas imbriqu&#233;s). Une cha&#238;ne de cor&#233;f&#233;rence
pourra par exemple &#234;tre repr&#233;sent&#233;e par un ensemble de relations binaires group&#233;es au sein d&#8217;un sch&#233;ma dont les
traits caract&#233;riseront la r&#233;f&#233;rence commune. Les structures &#233;num&#233;ratives constituent un autre exemple de struc-
ture complexe exigeant une telle expressivit&#233;. Il est important de remarquer que ce m&#233;ta-mod&#232;le abstrait peut &#234;tre
utilis&#233; pour repr&#233;senter une grande diversit&#233; de structures, que celle-ci soient du reste strictement linguistiques
ou non. Ainsi, la structure d&#8217;un document (sections, titres...) et les indications typographiques (graisse, italique,
listes...), &#233;l&#233;ments dont on sait l&#8217;importance pour l&#8217;exploration de certains ph&#233;nom&#232;nes de langue, peuvent &#234;tre
encod&#233;es sans sortir de ce cadre. Repr&#233;sent&#233;es de mani&#232;re homog&#232;ne, toutes les informations disponibles pourront
&#234;tre explor&#233;es de mani&#232;re unifi&#233;e.
</p>
<p>La plate-forme d&#8217;annotation et d&#8217;exploration de corpus Glozz (Widl&#246;cher &amp; Mathet, 2009) utilise ce m&#233;ta-mod&#232;le.
La m&#233;thode d&#8217;exploration pr&#233;sent&#233;e ci-apr&#232;s y a &#233;t&#233; impl&#233;ment&#233;e.
</p>
<p>3 Paradigme des contraintes et GlozzQL2
</p>
<p>Le paradigme des contraintes offre un cadre adapt&#233; &#224; la prise en consid&#233;ration de l&#8217;h&#233;t&#233;rog&#233;n&#233;it&#233; des donn&#233;es
&#233;voqu&#233;es en section 1.13. En effet, ce paradigme permet en particulier de repr&#233;senter de mani&#232;re uniforme des
cat&#233;gories de structures irr&#233;ductibles les unes aux autres (unit&#233;s, relations et sch&#233;mas), pouvant op&#233;rer &#224; des
&#233;chelles tr&#232;s vari&#233;es, en s&#8217;abstrayant si n&#233;cessaire de leur inscription textuelle effective, de l&#8217;ordre des &#233;l&#233;ments
du texte et des distances qui les s&#233;parent. Le Langage GlozzQL repose sur ce paradigme4.
</p>
<p>3.1 GlozzQL, un langage de requ&#234;tes incr&#233;mental et &#224; fort pouvoir expressif
</p>
<p>GlozzQL ayant vocation &#224; &#234;tre utilis&#233; par un public large, il repose sur des concepts simples et une interface gra-
phique pour la construction des requ&#234;tes, des assemblages incr&#233;mentaux permettant de parvenir progressivement
&#224; l&#8217;expressivit&#233; n&#233;cessaire. Il repose sur deux concepts interd&#233;pendants, la notion de contrainte (Constraint), et
la notion d&#8217;annotation contrainte (ConstrainedAnnotation).
</p>
<p>Constraint : Une contrainte exprime une condition que doit satisfaire une annotation pour &#234;tre s&#233;lectionn&#233;e. 20
types de contraintes sont pr&#233;d&#233;finis, couvrant un large spectre de requ&#234;tes. Certaines contraintes peuvent s&#8217;appli-
quer sp&#233;cifiquement &#224; un type d&#8217;&#233;l&#233;ment particulier (unit&#233;, relation, sch&#233;ma), d&#8217;autres sont universelles, et enfin 3
contraintes portent sur d&#8217;autres contraintes afin de les modifier ou de les combiner (Not, Or, And).
</p>
<p>Parmi les contraintes universelles, mentionnons notamment Feature qui permet de contraindre des valeurs de
traits, Author qui permet de contraindre l&#8217;identifiant de l&#8217;annotateur dans le cas de corpus multi-annot&#233;s, et
quelques autres qui ont trait &#224; la position relative d&#8217;entit&#233;s par rapport &#224; d&#8217;autres (Distance, After, Before).
</p>
<p>Parmi les requ&#234;tes sp&#233;cifiques aux unit&#233;s, TextContains permet de sp&#233;cifier une s&#233;quence de texte que l&#8217;entit&#233;
doit contenir, RegExp d&#233;finit une expression r&#233;guli&#232;re &#224; laquelle le texte contenu dans l&#8217;unit&#233; doit se conformer,
tandis que Covers et CoveredBy sont relatives &#224; d&#8217;autres unit&#233;s, et imposent respectivement le fait que l&#8217;unit&#233;
contrainte recouvre un certain type d&#8217;unit&#233;, et la r&#233;ciproque. Par exemple, C1 = textContains(&#8221;isotope&#8221;) est
une contrainte portant sur une unit&#233; et imposant que cette derni&#232;re contienne le texte &quot;isotope&quot;.
</p>
<p>Concernant les sch&#233;mas, la contrainte Contains sp&#233;cifie que ce dernier doit contenir un type d&#8217;entit&#233; particulier,
par exemple une unit&#233; contenant le texte &quot;isotope&quot;. Cette contrainte est doublement param&#233;trable, d&#8217;une part en
autorisant ou non la recherche en profondeur, d&#8217;autre part en contraignant le nombre d&#8217;entit&#233;s concern&#233;es.
</p>
<p>Enfin, deux contraintes sont sp&#233;cifiques aux relations, Start et Target, qui permettent respectivement de sp&#233;cifier
</p>
<p>2Manuel et vid&#233;os de d&#233;monstration de GlozzQL sont disponibles sur http://www.glozz.org.
3Ce point a &#233;t&#233; amplement discut&#233; dans (Widl&#246;cher, 2008).
4Selon une autre strat&#233;gie d&#8217;exploration, assez opportuniste, il est &#233;galement possible, depuis Glozz, d&#8217;exporter simplement les donn&#233;es
</p>
<p>annot&#233;es vers un SGBDR et de b&#233;n&#233;ficier de l&#8217;expressivit&#233; et de la puissance de SQL pour les interroger.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>STRAT&#201;GIE D&#8217;EXPLORATION DE CORPUS MULTI-ANNOT&#201;S AVEC GLOZZQL
</p>
<p>la source ou la cible d&#8217;une relation de fa&#231;on similaire &#224; la contrainte Contains des sch&#233;mas.
</p>
<p>Constrained Annotation : De fa&#231;on corollaire, on appelle &quot;annotation contrainte&quot; un ensemble d&#8217;annotations sa-
tisfaisant une contrainte donn&#233;e. Par exemple, Unit1 : C1 d&#233;finit l&#8217;ensemble des unit&#233;s qui satisfont la contrainte
C1, c&#8217;est-&#224;-dire qui contiennent le texte &quot;isotope&quot;.
</p>
<p>Construction incr&#233;mentale et interd&#233;pendante des Constraints et des ConstrainedAnnotations : Une an-
notation contrainte d&#233;pend, par d&#233;finition, d&#8217;une contrainte. La r&#233;ciproque peut &#234;tre vraie, dans la mesure o&#249;,
comme nous l&#8217;avons vu, certaines contraintes s&#8217;appuient sur des annotations contraintes. C&#8217;est par exemple le cas
de C2 = Contains(Unit1), qui est une contrainte exprimant le fait, pour un sch&#233;ma, de contenir une unit&#233; de
Unit1, c&#8217;est-&#224;-dire contenant le texte &quot;isotope&quot;. Pour obtenir l&#8217;ensemble des sch&#233;mas correspondants, il suffit de
d&#233;finir l&#8217;annotation contrainte correspondante Schema1 : C2. De la sorte, il est possible de construire de fa&#231;on
incr&#233;mentale des contraintes et des annotations contraintes de plus en plus riches. L&#8217;avantange est double : d&#8217;une
part, chaque &#233;tape du processus de construction de requ&#234;tes est &#233;l&#233;mentaire ; d&#8217;autre part, chacune de ces &#233;tapes
constitue elle-m&#234;me un r&#233;sultat partiel &#233;ventuellement int&#233;ressant et exploitable en soi (en cherchant tous les sch&#233;-
mas contenant une unit&#233; contenant le texte &quot;isotope&quot;, on a aussi et d&#8217;abord trouv&#233; l&#8217;ensemble des unit&#233;s contenant
&quot;isotope&quot;).
</p>
<p>3.2 Exemple r&#233;el de constitution de requ&#234;tes
</p>
<p>Observons un exemple issu d&#8217;une campagne d&#8217;annotation dans laquelle des sch&#233;mas appel&#233;s SE (structures &#233;nu-
m&#233;ratives) peuvent contenir, entre autres, des unit&#233;s appel&#233;es &quot;amorces&quot;. Nous souhaitons acc&#233;der d&#8217;une part &#224;
tous les sch&#233;mas comportant une amorce, et d&#8217;autre part &#224; tous ceux qui n&#8217;en comportent pas.
</p>
<p>Constraints Constrained Annotations
</p>
<p>FIG. 2 &#8211; Exemple de construction de requ&#234;tes GlozzQL
</p>
<p>Pour ce faire, comme illustr&#233; par la figure 2, nous cr&#233;ons Unit1 comme l&#8217;ensemble des unit&#233;s de type amorce, qui
s&#8217;appuie sur la contrainte C1. Nous cr&#233;ons ensuite la contrainte C2 imposant qu&#8217;un sch&#233;ma contienne un &#233;l&#233;ment
de Unit1, et sa contrapos&#233;e C3. Comme nous souhaitons obtenir uniquement les sch&#233;mas de type SE, nous
cr&#233;ons la contrainte idoine C4. Il reste alors &#224; cr&#233;er C5 par conjonction de C2 et C4, imposant qu&#8217;un sch&#233;ma
soit de type SE et comporte une amorce, et C6 par conjonction de C3 et C4. Nous en tirons respectivement
Schema1 et Schema2, qui r&#233;pondent au probl&#232;me pos&#233;. La derni&#232;re colonne &quot;Matches&quot; indique pour chacune
des ConstrainedAnnotations quel en est le nombre d&#8217;occurrences dans le texte annot&#233; en cours. Rappelons que
par ce processus incr&#233;mental, nous obtenons des r&#233;sultats interm&#233;diaires &#224; chacune des &#233;tapes, comme Unit1 qui
nous donne l&#8217;ensemble des unit&#233;s &quot;Amorces&quot;, au nombre de 6 dans cet exemple.
</p>
<p>3.3 Exploration et exploitation des r&#233;sultats
</p>
<p>Navigation : &#192; tout moment, chacune des ConstrainedAnnotations se voit attribuer l&#8217;ensemble des occur-
rences correspondantes dans le texte actif, et un clic sur l&#8217;une d&#8217;entre elles permet d&#8217;acc&#233;der &#224; son contenu. Dans
l&#8217;exemple de la figure 3, un clic sur Schema1 fait appara&#238;tre dans la fen&#234;tre du dessous les 6 occurrences de
sch&#233;mas concern&#233;es (fl&#232;che 1 de la figure 3). D&#232;s lors, un clic sur l&#8217;une de ces occurrences permet de s&#233;lectionner
et d&#8217;acc&#233;der imm&#233;diatement &#224; son contenu dans la fen&#234;tre principale (fl&#232;che 2 de la figure 3), ce qui rend possible
son observation dans le texte ainsi que, &#233;ventuellement, sa modification imm&#233;diate.
</p>
<p>Panier : Un syst&#232;me de panier permet de collecter s&#233;lectivement des paquets de r&#233;sultats (par exemple tous les
&#233;lements de Schema1 et de Schema2). Il est alors notamment possible d&#8217;enregistrer le contenu du panier en tant
que nouveau fichier d&#8217;annotation, ou au contraire de demander &#224; ce que les annotations contenues dans le panier
soient supprim&#233;es du texte en cours d&#8217;annotation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>YANN MATHET, ANTOINE WIDL&#214;CHER
</p>
<p>1
</p>
<p>2
</p>
<p>FIG. 3 &#8211; Exploration des r&#233;sultats d&#8217;une requ&#234;te GlozzQL au sein du processus d&#8217;annotation
</p>
<p>Unification : Un m&#233;canisme optionnel appel&#233; &quot;unification&quot;, dans le d&#233;tail duquel nous ne pouvons entrer dans le
cadre de cet article, permet de consid&#233;rer chaque ConstrainedAnnotation comme une variable entrant dans le
syst&#232;me d&#8217;&#233;quations constitu&#233; par l&#8217;ensemble des contraintes. De la sorte, il est notamment possible de recher-
cher des configurations telles que trois unit&#233;s li&#233;es par des relations triangulaires, de chercher toutes les relations
orient&#233;es du bas vers le haut, etc. (ce qui serait impossible par d&#233;faut).
</p>
<p>Usages de l&#8217;outil au sein d&#8217;une campagne d&#8217;annotation : Les requ&#234;tes cr&#233;&#233;es avec GlozzQL peuvent &#234;tre sauve-
gard&#233;es (dans un format sp&#233;cifique XML), et des jeux de requ&#234;tes peuvent donc faire partie int&#233;grante du mat&#233;riau
fourni aux annotateurs d&#8217;une campagne donn&#233;e. Par ailleurs, le fait de disposer d&#8217;un tel outil au sein m&#234;me du
processus d&#8217;annotation permet notamment : 1) d&#8217;acc&#233;der &#224; tout moment &#224; des configurations particuli&#232;res pouvant
servir de base &#224; la suite du processus d&#8217;annotation et 2) de contr&#244;ler &#224; tout moment la conformit&#233; des annotations
produites. Il suffit pour cela de cr&#233;er des ConstrainedAnnotations correspondant &#224; des configurations interdites
pour la campagne d&#8217;annotation en cours.
</p>
<p>R&#233;f&#233;rences
</p>
<p>CHIARCOS C., DIPPER S., G&#214;TZE M., LESER U., L&#220;DELING A., RITZ J. &amp; STEDE M. (2008). A Flexible
Framework for Integrating Annotations from Different Tools and Tag Sets. Revue Traitement Automatique des
Langues (TAL), 49(2), 189&#8211;215.
CUNNINGHAM H., MAYNARD D., BONTCHEVA K. &amp; TABLAN V. (2002). GATE : A framework and graphical
development environment for robust NLP tools and applications. In Proceedings of the 40th Anniversary Meeting
of the Association for Computational Linguistics.
</p>
<p>HERNANDEZ N., POULARD F., VERNIER M. &amp; ROCHETEAU J. (2010). Building a French-speaking commu-
nity around UIMA, gathering research, education and industrial partners, mainly in Natural Language Processing
and Speech Recognizing domains. In Workshop Abstracts LREC 2010 Workshop &#8217;New Challenges for NLP Fra-
meworks&#8217;, p. p64, La Valleta Malta.
</p>
<p>LOISEAU S. (2008). CorpusReader : construction et interrogation de corpus multiannot&#233;s. Revue Traitement
Automatique des Langues (TAL), 49(2), 189&#8211;215.
PAUMIER S. (2003). De la reconnaissance de formes linguistiques &#224; l&#8217;analyse syntaxique, volume 2, Manuel
d&#8217;Unitex. PhD thesis, Universit&#233; de Marne la Vall&#233;e.
</p>
<p>WIDL&#214;CHER A. (2008). Analyse macro-s&#233;mantique des structures rh&#233;toriques du discours - Cadre th&#233;orique et
mod&#232;le op&#233;ratoire. PhD thesis, Universit&#233; de Caen Basse-Normandie.
</p>
<p>WIDL&#214;CHER A. &amp; BILHAUT F. (2008). Articulation des traitements en TAL - Principes m&#233;thodologiques et
mise en &#339;uvre dans la plate-forme LinguaStream. Revue Traitement Automatique des Langues (TAL), 49(2),
73&#8211;101.
</p>
<p>WIDL&#214;CHER A. &amp; MATHET Y. (2009). La plate-forme Glozz : environnement d&#8217;annotation et d&#8217;exploration de
corpus. In Actes de TALN 2009 (Traitement automatique des langues naturelles), Senlis, France : ATALA LIPN.</p>

</div></div>
</body></html>