<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une application de la grammaire structurelle: L&#8217;analyseur syntaxique du fran&#231;ais SYGFRAN</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Une application de la grammaire structurelle: L&#8217;analyseur syntaxique du
fran&#231;ais SYGFRAN
</p>
<p>Jacques Chauch&#233;1
(1) LIRMM, 161, rue ADA 34392 Montpellier Cedex 5
</p>
<p>jacques.chauche@lirmm.fr
</p>
<p>R&#233;sum&#233;. La d&#233;monstration pr&#233;sent&#233;e produit une analyse syntaxique du fran&#231;ais. Elle est &#233;crite en SYG-
MART, fournie avec les actes, ex&#233;cutable &#224; l&#8217;adresse : http ://www.lirmm.fr/ chauche/ExempleAnl.html et t&#233;l&#233;-
chargeable &#224; l&#8217;adresse : http ://www.sygtext.fr.
</p>
<p>Abstract. The software produces a syntactic analysis of french. It is written in SYGMART, including acts,
runable at http ://www.lirmm.fr/ chauche/ExempleAnl.html and downlodable at : http ://www.sygtext.fr.
</p>
<p>Mots-cl&#233;s : Analyse syntaxique.
</p>
<p>Keywords: syntactic analysis.
</p>
<p>1 Mod&#232;le de traitement
</p>
<p>Les algorithmes de Markov ont la puissance d&#8217;une machine de Turing. Ils peuvent donc repr&#233;senter n&#8217;importe
quel algorithme. Ces traitements se font &#224; partir d&#8217;un traitement de cha&#238;ne par la substitution d&#8217;infixes. La gram-
maire structurelle transforme des structures arborescentes. Elle correspond donc &#224; une extension des algorithmes
de Markov appliqu&#233;e aux structures arborescentes : au lieu de remplacer un infixe d&#8217;une cha&#238;ne on remplace une
sous-structure d&#8217;une arborescence. La grammaire structurelle permet de d&#233;finir des r&#233;currences ou des compo-
sitions d&#8217;applications. Le syst&#232;me SYGMART est un outil qui permet l&#8217;&#233;criture et l&#8217;ex&#233;cution de grammaires
structurelles. Ce syst&#232;me a comme entr&#233;e soit une structure d&#233;j&#224; produite par ailleurs, soit un texte quelconque. Il
produit soit un texte soit une structure. Par exemple une application r&#233;cente concernait la manipulation de fichiers
xml afin de modifier et/ou de composer leurs structures. D&#8217;autres applications textuelles permettent d&#8217;&#233;crire un
traducteur, un taggeur, un compresseur de texte, un classifieur, ....
</p>
<p>2 Caract&#233;ristiques de SYGFRAN
</p>
<p>L&#8217;analyse s&#8217;effectue en deux temps :
&#8211; une analyse morphologique produisant l&#8217;ensemble des solutions possibles pour chaque mot dans une abrores-
</p>
<p>cence simple. Cette arborescence comporte deux niveaux. Dans le premier niveau chaque point correspond &#224; un
mot du texte. Chaque point de ce niveau est la racine des diff&#233;rentes solutions pour le mot associ&#233;. Cette &#233;tape
est bas&#233;e sur un automate d&#8217;&#233;tats finis.
</p>
<p>&#8211; Une analyse syntaxique bas&#233;e sur la grammaire structurelle. La grammaire comprend environ 250 parties et
20000 r&#232;gles.
</p>
<p>Sur un PC ou un Mac comprenant au moins 2 GO de m&#233;moire l&#8217;analyse supporte le traitement d&#8217;un texte repr&#233;-
sentant une arborescence syntaxique de 200000 points. L&#8217;analyse du livre &quot;Le petit prince&quot; de Saint Exupery traite
et produit une structure d&#8217;environ 35000 points et mets 3mn sur un ordinateur MacBookPro Intel core 2 Duo, 4GO
de m&#233;moire.</p>

</div></div>
</body></html>