<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Le TAL au service de l&#8217;ALAO/ELAO L&#8217;exemple des exercices de dict&#233;e automatis&#233;s</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Le TAL au service de l&#8217;ALAO/ELAO
L&#8217;exemple des exercices de dict&#233;e automatis&#233;s
</p>
<p>Richard Beaufort Sophie Roekhaut
CENTAL, UCLouvain, Place Blaise Pascal 1, B-1348 Louvain-la-Neuve
</p>
<p>{richard.beaufort,sophie.roekhaut}@uclouvain.be
</p>
<p>R&#233;sum&#233;. Ce papier s&#8217;inscrit dans le cadre g&#233;n&#233;ral de l&#8217;Apprentissage et de l&#8217;Enseignement des Langues
Assist&#233;s par Ordinateur, et concerne plus particuli&#232;rement l&#8217;automatisation des exercices de dict&#233;e. Il pr&#233;sente une
m&#233;thode de correction des copies d&#8217;apprenants qui se veut originale en deux points. Premi&#232;rement, la m&#233;thode
exploite la composition d&#8217;automates &#224; &#233;tats finis pour d&#233;tecter et pour analyser les erreurs. Deuxi&#232;mement, elle
repose sur une analyse morphosyntaxique automatique de l&#8217;original de la dict&#233;e, ce qui facilite la production de
diagnostics.
</p>
<p>Abstract. This paper comes within the scope of the Computer Assisted Language Learning framework,
and addresses more especially the automation of dictation exercises. It presents a correction method of learners&#8217;
copies that is original in two ways. First, the method exploits the composition of finite-state automata, to both
detect and analyze the errors. Second, it relies on an automatic morphosyntactic analysis of the original dictation,
which makes it easier to produce diagnoses.
</p>
<p>Mots-cl&#233;s : ALAO/ELAO, exercices de dict&#233;e, alignement, diagnostic, machines &#224; &#233;tats finis.
</p>
<p>Keywords: CALL, dictation exercises, alignment, diagnosis, finite-state machines.
</p>
<p>1 Introduction
</p>
<p>L&#8217;Apprentissage et l&#8217;Enseignement des Langues Assist&#233;s par Ordinateur (ALAO/ELAO) ont pour objectif premier
d&#8217;am&#233;liorer l&#8217;acquisition des langues par les apprenants. Pourtant, force est de constater qu&#8217;actuellement, l&#8217;inves-
tissement dans le domaine a plus &#233;t&#233; technologique que didactique : pour l&#8217;essentiel, la num&#233;risation des cours
n&#8217;a pas modifi&#233; leur contenu ni leurs m&#233;thodes d&#8217;&#233;valuation (Desmet &amp; H&#233;roguel, 2005). Selon les sp&#233;cialistes,
l&#8217;am&#233;lioration de l&#8217;apprentissage et de l&#8217;enseignement implique de d&#233;passer les sempiternels exercices ferm&#233;s,
tels que les textes &#224; trous et les choix multiples qui, s&#8217;ils sont faciles &#224; corriger, limitent consid&#233;rablement les pos-
sibilit&#233;s d&#8217;&#233;valuation des connaissances. Il faudrait au moins proposer des exercices semi-ouverts, qui autorisent
plusieurs r&#233;ponses relativement pr&#233;visibles, pour autant que la correction automatique de ces exercices soit fiable :
apprentissage et enseignement, en effet, ne tol&#232;rent pas l&#8217;approximation (Antoniadis et al., 2009).
La dict&#233;e, o&#249; l&#8217;enseignant lit &#224; haute voix un passage que les &#233;tudiants doivent copier, est typiquement l&#8217;un de
ces exercices semi-ouverts qui, s&#8217;il &#233;tait automatis&#233;, pourrait consid&#233;rablement am&#233;liorer l&#8217;apprentissage et l&#8217;en-
seignement des langues. La dict&#233;e est ainsi un tr&#232;s bon moyen d&#8217;estimer le niveau d&#8217;un &#233;tudiant (Coniam, 1996).
Sa pratique, en outre, permet d&#8217;am&#233;liorer des comp&#233;tences telles que la ma&#238;trise de la grammaire, les capacit&#233;s
de lecture, la connaissance du vocabulaire et le niveau de compr&#233;hension (Rahimi, 2008). Actuellement pourtant,
rares ont &#233;t&#233; les essais d&#8217;automatisation de cet exercice. Or, gr&#226;ce aux synth&#233;tiseurs de la parole, lire automati-
quement un texte inconnu n&#8217;est plus un probl&#232;me. Mais la correction d&#8217;une copie d&#8217;apprenant, par contre, est une
&#233;tape beaucoup plus d&#233;licate &#224; automatiser, parce qu&#8217;elle pose deux questions sensibles : la d&#233;tection de la place
r&#233;elle des erreurs et leur classification.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RICHARD BEAUFORT, SOPHIE ROEKHAUT
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>L&#8217;importance d&#8217;exercices semi-ouverts en ALAO/ELAO a souvent &#233;t&#233; mise en avant. Des tests ont en outre mon-
tr&#233; l&#8217;int&#233;r&#234;t de la dict&#233;e comme moyen d&#8217;&#233;valuation et d&#8217;am&#233;lioration de la ma&#238;trise de la langue, qu&#8217;il s&#8217;agisse
d&#8217;apprenants natifs ou d&#8217;allophones, pour autant que ceux-ci pr&#233;sentent un niveau de ma&#238;trise avanc&#233; de la langue
&#233;tudi&#233;e (niveaux C1 ou C2 du Cadre europ&#233;en commun de r&#233;f&#233;rence pour les langues). Pourtant, peu de travaux
ont directement concern&#233; l&#8217;automatisation de cet exercice et de sa correction.
Le travail le plus significatif dans le domaine est certainement celui de Santiago-Oriola (1998). La partie de ce tra-
vail qui nous int&#233;resse ici est la m&#233;thode de correction propos&#233;e : elle repose sur le fait que le lien entre graphie et
prononciation n&#8217;est pas ais&#233; &#224; acqu&#233;rir en fran&#231;ais : seuls 80 &#224; 85% des lettres d&#8217;un texte transcrivent un phon&#232;me,
ce qui est la cause de nombreuses fautes d&#8217;orthographe. Sur cette base, la correction propos&#233;e se divise en deux
modules : un premier module s&#8217;occupe de la d&#233;tection des erreurs en r&#233;alisant un alignement de l&#8217;original et de la
copie dirig&#233; par des r&#232;gles de transformation phonologiques ; un second module ne produit pas un diagnostic, mais
s&#233;lectionne un diagnostic pr&#233;-&#233;tabli, associ&#233; dans les ressources du syst&#232;me &#224; une ou plusieurs erreurs recens&#233;es
dans la langue. Hormis une &#233;valuation de l&#8217;outil qui a montr&#233; que 80% des 24 enfants l&#8217;ayant test&#233; l&#8217;ont appr&#233;ci&#233;,
ce travail tr&#232;s int&#233;ressant n&#8217;a malheureusement pas &#233;t&#233; poursuivi.
Plus r&#233;cemment, le logiciel de dict&#233;es La Dict&#233;e interactive a &#233;t&#233; pr&#233;sent&#233; dans la revue Alsic, d&#233;di&#233;e &#224; l&#8217;appren-
tissage des langues (Ruggia, 2000). Cet article, centr&#233; sur la pr&#233;sentation du potentiel de l&#8217;outil, ne donne qu&#8217;une
seule information concernant la m&#233;thode de correction des erreurs : elle cible les erreurs courantes chez les appre-
nants italophones de niveau faux-d&#233;butant en fran&#231;ais. Cette m&#233;thode est donc probablement peu g&#233;n&#233;rique.
Ces derni&#232;res ann&#233;es, la dict&#233;e a compl&#232;tement disparu de la litt&#233;rature scientifique. Dans le domaine des exer-
cices semi-ouverts, on peut cependant encore noter les travaux de Desmet &amp; H&#233;roguel (2005), dont la plateforme
d&#8217;apprentissage des langues &#233;trang&#232;res autorise entre autres la r&#233;alisation de traductions de phrases d&#8217;une langue
source vers une langue cible. Le principe de correction propos&#233; se rapproche de l&#8217;exercice de dict&#233;e dans lequel
l&#8217;original est disponible : l&#8217;id&#233;e, ici, est de produire plusieurs formulations (les &#171; originaux &#187;), et de s&#233;lectionner,
par approximate string matching, la formulation dont la r&#233;ponse de l&#8217;apprenant se rapproche le plus. Le syst&#232;me,
qui travaille au niveau du mot, signale ensuite les erreurs &#224; l&#8217;apprenant en rempla&#231;ant un mauvais mot par XXX,
un mot superflu par (XXX) et un mot manquant, par (. . .). Par contre, aucun diagnostic n&#8217;est produit.
</p>
<p>3 Le syst&#232;me de correction propos&#233;
</p>
<p>Notre m&#233;thode de correction partage deux similarit&#233;s avec celle de Santiago-Oriola (1998). Premi&#232;rement, elle
comprend deux &#233;tapes, une phase de d&#233;tection pr&#233;c&#233;dant une phase de diagnostic. Deuxi&#232;mement, la phase de
d&#233;tection repose sur un alignement de l&#8217;original et de la copie.
Un aspect distingue particuli&#232;rement notre approche : la totalit&#233; de la correction repose sur une analyse morpho-
syntaxique de l&#8217;original de la dict&#233;e. Cette analyse est produite par le syst&#232;me eLite (Beaufort &amp; Ruelle, 2006),
qui r&#233;alise successivement un pr&#233;-traitement, une analyse morphologique et une d&#233;sambigu&#239;sation contextuelle
du texte. La d&#233;sambigu&#239;sation est obtenue par l&#8217;application d&#8217;un mod&#232;le de langue probabiliste (Beaufort et al.,
2002). Les informations morphosyntaxiques sont ensuite stock&#233;es dans une structure de donn&#233;es qui contient,
entre autres, une couche Sent correspondant aux phrases, et une couche Word correspondant aux mots.
Une fois l&#8217;analyse de l&#8217;original d&#8217;une dict&#233;e termin&#233;e, la structure de donn&#233;es correspondante est sauvegard&#233;e
dans un fichier XML, qui sera charg&#233; par notre module de correction lorsqu&#8217;il devra traiter une copie de cette
dict&#233;e. Au-del&#224; des informations morphosyntaxiques qui seront utilis&#233;es par le module de correction, il faut noter
que le processus de correction dans son ensemble est influenc&#233; par cette structure de donn&#233;es : la couche Sent, qui
identifie les phrases du texte, permet en effet d&#8217;appliquer le module de correction phrase par phrase, ce qui r&#233;duit
consid&#233;rablement la complexit&#233; du processus.
</p>
<p>D&#233;tection. Comme dans l&#8217;&#233;tat de l&#8217;art, la d&#233;tection des erreurs de l&#8217;apprenant se fait sur la base d&#8217;un alignement
de la phrase originale et de la copie. Classiquement, cet alignement est obtenu en calculant la distance d&#8217;&#233;dition
des deux s&#233;quences (Damerau, 1964; Levenshtein, 1966). Or, la distance d&#8217;&#233;dition classique n&#8217;autorise que des
op&#233;rations de base : substitution, insertion et suppression d&#8217;un caract&#232;re, et transposition de deux caract&#232;res conti-
gus. Ceci est g&#234;nant dans le cas qui nous occupe, parce que les erreurs des apprenants correspondent souvent &#224; des
substitutions n-m, o&#249; n caract&#232;res se substituent &#224; m caract&#232;res : -es&#8596; -ent, -ait&#8596; -aient, -er&#8596; -&#233;es, etc. Dans</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXERCICES DE DICT&#201;E AUTOMATIS&#201;S
</p>
<p>2) vectorisation de l'alignement
... d e m a n d e r u n _ e n t r e t i e n ...
... d e m a n d &#233; _ u n n e n t r e t i e n ...
... 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 ...
</p>
<p>3) insertion de marqueurs d'erreurs
... d e m a n d [ e r ] u n [ _ ] e n t r e t i e n ...
... d e m a n d [ &#233; _ ] u n [ n ] e n t r e t i e n ...
</p>
<p>4) insertion des limites de mots
... [ _ ] { e n t r e t i e n } ... ... { [ _ ] e n t r e t i e n } ...
... [ n ] { e n t r e t i e n } ... ... { [ n ] e n t r e t i e n } ...
</p>
<p>FIGURE 1 &#8211; Illustration des &#233;tapes 2 &#224; 4 de la d&#233;tection des erreurs
</p>
<p>le cadre de la distance d&#8217;&#233;dition classique, la substitution n-m se mod&#233;lise sous la forme de plusieurs op&#233;rations
d&#8217;&#233;dition, ce qui tend &#224; l&#8217;&#233;carter des solutions pertinentes, &#233;tant donn&#233; que la distance qui lui est attribu&#233;e est la
somme de plusieurs op&#233;rations. Afin de d&#233;passer cette limite, nous avons eu recours aux machines &#224; &#233;tats finis et &#224;
une m&#233;thode que nous avons d&#233;crite dans (Beaufort, 2010) : &#233;tant donn&#233; deux s&#233;quences x et y repr&#233;sent&#233;es sous la
forme des automates &#224; &#233;tats finis X et Y , nous construisons le transducteur pond&#233;r&#233; E correspondant &#224; l&#8217;ensemble
E des alignements possibles entre x pour y. Cet ensemble est obtenu au travers de la cascade de compositions :
</p>
<p>E = X &#9702; F &#9702; Y (1)
</p>
<p>o&#249; F est un transducteur pond&#233;r&#233; qui mod&#233;lise les op&#233;rations d&#8217;&#233;dition accept&#233;es. Le meilleur alignement entre
x et y correspond au meilleur chemin de E , obtenu par calcul du plus court chemin d&#8217;un graphe. La m&#233;thode est
appel&#233;e composition filtr&#233;e, parce que le transducteur pond&#233;r&#233;F peut &#234;tre consid&#233;r&#233; comme un filtre qui d&#233;termine
la taille de l&#8217;intersection entre x et y. Le filtre F est compil&#233; sous la forme d&#8217;un transducteurF &#224; partir d&#8217;un fichier
de r&#232;gles de r&#233;&#233;criture de la forme :
</p>
<p>&#966; ?&#8594; &#968; / w (2)
o&#249; la s&#233;quence &#966; peut se r&#233;&#233;crire &#968; et se voit dans ce cas attribuer le poids w. Il s&#8217;agit donc de r&#232;gles facultatives,
ce qui permet &#224; &#966; soit de rester inchang&#233;, soit de se voir appliquer plusieurs r&#233;&#233;critures.
</p>
<p>L&#8217;algorithme de d&#233;tection des erreurs, illustr&#233; en Figure 1, est enti&#232;rement construit autour de ce principe :
</p>
<p>1. la phrase originale x et la copie y sont converties en automates &#224; &#233;tats finis X et Y . Les deux automates sont
compos&#233;s au travers du filtre F qui repr&#233;sente les op&#233;rations d&#8217;&#233;dition classiques ainsi que la substitution
n-m des s&#233;quences graphiques couramment confondues en fran&#231;ais. Actuellement, le filtre autorise surtout
la substitution des terminaisons nominales et verbales, telles que celles que nous avons cit&#233;es pr&#233;c&#233;dem-
ment. Le transducteur E des alignements possibles entre x et y est ensuite r&#233;duit &#224; son meilleur chemin E &#8242;,
correspondant au meilleur alignement de x et y ;
</p>
<p>2. le transducteur E &#8242; est parcouru et converti en trois vecteurs : un pour la phrase originale, un pour la copie,
et un pour les poids associ&#233;s aux op&#233;rations r&#233;alis&#233;es. Dans le vecteur de poids, un poids positif indique le
d&#233;but d&#8217;une op&#233;ration d&#8217;&#233;dition ;
</p>
<p>3. les trois vecteurs sont parcourus en parall&#232;le afin d&#8217;entourer les erreurs de marqueurs [ et ] qui en indiquent
les limites. Le syst&#232;me consid&#232;re qu&#8217;une erreur commence quand le poids est diff&#233;rent de 0, et qu&#8217;elle finit
lorsque le poids redevient 0 et que les deux vecteurs de lettres pr&#233;sentent des caract&#232;res identiques ;
</p>
<p>4. il reste &#224; identifier les fronti&#232;res de mots &#224; l&#8217;aide de marqueurs { et }. &#192; ce niveau, l&#8217;algorithme est guid&#233;
par l&#8217;analyse linguistique, qui parcourt successivement les &#233;l&#233;ments de la couche Word. Sur cette base,
le syst&#232;me identifie le mot courant dans le vecteur de la phrase originale. Ensuite, il adapte les fronti&#232;res
au besoin, pour inclure dans le mot courant les erreurs contigu&#235;s qui correspondent &#224; des insertions de
caract&#232;res alphab&#233;tiques. C&#8217;est le cas du n dans la forme nentretien ;
</p>
<p>5. chaque erreur est ensuite sauvegard&#233;e dans le Word ad&#233;quat de la structure de donn&#233;es. Cette sauvegarde
s&#8217;accompagne de calculs permettant de cat&#233;goriser l&#8217;erreur : dans ou en fronti&#232;re d&#8217;&#233;l&#233;ment, &#233;l&#233;ment man-
quant, &#233;l&#233;ment superflu, erreur ne contenant que des s&#233;parateurs. Ces indices guideront l&#8217;&#233;tablissement du
diagnostic.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RICHARD BEAUFORT, SOPHIE ROEKHAUT
</p>
<p>Diagnostic. &#192; ce stade, toutes les informations disponibles sont sauvegard&#233;es dans les &#233;l&#233;ments Word de la
structure de donn&#233;es : l&#8217;analyse morphosyntaxique de la forme correcte et, s&#8217;il y a eu erreur, la forme erron&#233;e et les
indices pr&#233;lev&#233;s. Le diagnostic n&#8217;est d&#233;clench&#233; que sur les &#233;l&#233;ments Word contenant une erreur. Dans l&#8217;ensemble,
les erreurs concernent (1) un s&#233;parateur, (2) un mot simple ou (3) une s&#233;quence d&#8217;&#233;l&#233;ments (mots et s&#233;parateurs).
L&#8217;orientation du diagnostic vers une erreur sur s&#233;quence d&#233;pend de l&#8217;indice associ&#233; &#224; l&#8217;erreur : un s&#233;parateur
manquant peut indiquer une fusion en une forme du lexique (quoi que &#8594; quoique, d&#8217;avantage &#8594; davantage),
un s&#233;parateur superflu, une segmentation en plusieurs formes du lexique (quoique &#8594; quoi que, davantage &#8594;
d&#8217;avantage). Si les indices l&#8217;y poussent, l&#8217;algorithme de diagnostic commence donc par tester une erreur sur
s&#233;quence, et ne propose un autre diagnostic que si ces tests &#233;chouent. Pour des raisons de clart&#233; cependant, nous
commen&#231;ons par d&#233;tailler le fonctionnement du diagnostic sur s&#233;parateur et sur mot simple.
</p>
<p>1) Le diagnostic relatif &#224; une erreur sur s&#233;parateur (ponctuation ou espace) est tr&#232;s simple &#224; produire : si l&#8217;indice
sauvegard&#233; est superflu ou manquant, le diagnostic est identique. Sinon, le s&#233;parateur existe mais est erron&#233;, et le
diagnostic signale simplement que l&#8217;on attendait un s&#233;parateur diff&#233;rent.
</p>
<p>2) Une erreur sur mot simple peut &#234;tre lexicale et/ou grammaticale. Une erreur est lexicale si la forme erron&#233;e est
hors-vocabulaire (nentretien) ou appartient &#224; la m&#234;me cat&#233;gorie que la forme correcte, mais poss&#232;de un lemme
diff&#233;rent (sceptique&#8596; septique). Une erreur est grammaticale si la forme erron&#233;e pr&#233;sente des traits grammaticaux
diff&#233;rents de ceux de la forme correcte (parle &#8596; parles diff&#232;rent au niveau de la personne). Une forme erron&#233;e
peut bien s&#251;r cumuler erreur lexicale et grammaticale (diff&#233;rent &#8596; diff&#233;rant cumulent erreur de lemme et erreur
de cat&#233;gorie). Pour poser l&#8217;un de ces diagnostics, nous commen&#231;ons par rechercher la forme erron&#233;e dans le
lexique. Si la forme n&#8217;y figure pas, elle est consid&#233;r&#233;e comme hors-vocabulaire. Dans le cas contraire, l&#8217;id&#233;e est
de comparer l&#8217;analyse linguistique retenue pour la forme correcte lors de la pr&#233;paration de la dict&#233;e, &#224; l&#8217;ensemble
d&#8217;analyses possibles propos&#233;es par le lexique pour la forme erron&#233;e, et de retenir l&#8217;analyse de la forme erron&#233;e la
plus proche de celle de la forme correcte.
Qu&#8217;il s&#8217;agisse d&#8217;une forme correcte ou erron&#233;e, une analyse linguistique est toujours constitu&#233;e d&#8217;un lemme et des
traits grammaticaux suivants : temps/mode, genre, nombre, personne.
La m&#233;thode de comparaison d&#8217;analyse que nous utilisons est fort proche de la m&#233;thode d&#8217;alignement que nous
avons pr&#233;sent&#233;e pr&#233;c&#233;demment. Elle est illustr&#233;e en Figure 2 : on compile l&#8217;analyse de la forme correcte (a1) et
l&#8217;ensemble d&#8217;analyses de la forme erron&#233;es (a2) sous la forme d&#8217;automates &#224; &#233;tats finis (resp. A1 et A2). Sur
cette base, la meilleure analyse &#224; conserver pour la forme erron&#233;e (A&#8242;2) correspond au meilleur chemin de la
composition de ces deux automates au travers d&#8217;un filtre Ft :
</p>
<p>A&#8242;2 = Best(A1 &#9702; Ft &#9702; A2) (3)
o&#249; le filtre autorise des conversions pond&#233;r&#233;es entre traits grammaticaux. Par exemple, un infinitif peut &#234;tre converti
en participe pass&#233; moyennant un co&#251;t de 1 et en nom moyennant un co&#251;t de 5. Le meilleur chemin entre les deux
analyses est donc celui qui r&#233;alise les transformations de traits les moins co&#251;teuses.
Lorsque les lemmes des deux formes diff&#232;rent (sceptique &#8596; septique), la composition des automates &#233;choue.
Dans ce cas, l&#8217;erreur est au moins lexicale. Il reste cependant &#224; choisir l&#8217;analyse de la forme erron&#233;e et &#224; tester
une &#233;ventuelle erreur grammaticale. Le m&#234;me calcul est de ce fait reproduit sur deux nouveaux automates, ne
pr&#233;sentant que les traits grammaticaux des deux formes &#224; comparer. Cette composition donne toujours un r&#233;sultat.
</p>
<p>3) Dans le principe, l&#8217;analyse d&#8217;une erreur sur s&#233;quence se d&#233;roule comme celle d&#8217;un mot simple : la s&#233;quence
erron&#233;e est recherch&#233;e dans un lexique. S&#8217;il n&#8217;y a pas de r&#233;sultat cependant, la s&#233;quence n&#8217;est pas consid&#233;r&#233;e
comme hors-vocabulaire ; le diagnostic s&#8217;oriente simplement vers l&#8217;un des deux autres types d&#8217;erreurs.
La recherche de la s&#233;quence erron&#233;e dans le lexique diff&#232;re en deux points de la recherche d&#8217;un mot simple : il
faut construire la s&#233;quence &#224; rechercher et choisir un lexique appropri&#233;.
En cas de s&#233;parateur manquant (quoique pour quoi que, davantage pour d&#8217;avantage), on suppose que la forme
erron&#233;e est un mot simple. Les mots corrects (par exemple, quoi et que) sont dans ce cas concat&#233;n&#233;s sans s&#233;parateur
(quoique) et recherch&#233;s dans le m&#234;me lexique que celui utilis&#233; pour l&#8217;analyse des erreurs sur mots simples.
En cas de s&#233;parateur superflu (quoi que pour quoique, d&#8217;avantage pour davantage), on suppose que la forme
erron&#233;e contient plusieurs formes correctes simples. Les segments de mots (par exemple, d et avantage) sont
dans ce cas concat&#233;n&#233;s autour du s&#233;parateur superflu (d&#8217;avantage) et recherch&#233;s dans un lexique correspondant &#224;
l&#8217;expression r&#233;guli&#232;re suivante :
</p>
<p>(WordApo | (Word Sep))+ Word (4)
o&#249; WordApo est un mot termin&#233; par une apostrophe (d&#8217;, qu&#8217;, etc.) et Sep est un espace ou un trait d&#8217;union. Cette
expression autorise donc simplement une suite de mots respectant les conventions typographiques du fran&#231;ais.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EXERCICES DE DICT&#201;E AUTOMATIS&#201;S
</p>
<p>demander
</p>
<p>INFINIT
</p>
<p>INFINIT:SPACE/20
</p>
<p>INFINIT:SYMBOL/20
INFINIT:ADJ/20
</p>
<p>INFINIT:ADV/20
INFINIT:DET/20
INFINIT:NOUN/5
</p>
<p>INFINIT:PARTPASSE/1
</p>
<p>INFINIT:PARTPRES/1
</p>
<p>INFINIT:AUX/1
</p>
<p>INFINIT:VERB/1
</p>
<p>IfPr
</p>
<p>IfPr:IdPr/2
</p>
<p>IfPr:IdPa/2
</p>
<p>IfPr:SbPr/2
IfPr:SbIm/2
IfPr:CdPr/2
IfPr:PtPr/2
IfPr:PtPa/2
</p>
<p>IfPr:TND
</p>
<p>GND
GND:Msc
GND:Fem
</p>
<p>PND
</p>
<p>PND:1st
PND:2nd
PND:3rd
</p>
<p>NND
NND:Sg
NND:Pl
</p>
<p>1. Automate A1 repr&#233;sentant l&#8217;analyse de la forme correcte.
Ici, l&#8217;analyse est augment&#233;e par composition avec le filtre Ft
</p>
<p>demand
e
&#233;
</p>
<p>r
</p>
<p>NOUN/500
</p>
<p>ADJ
</p>
<p>PARTPASSE
VERB/500
</p>
<p>TND
</p>
<p>TND
</p>
<p>PtPa
</p>
<p>IdPr
SbPr
</p>
<p>Fem
Msc
</p>
<p>GND
</p>
<p>PND
1st
3rd
</p>
<p>Sg
</p>
<p>2. Automate A2 repr&#233;sentant l&#8217;ensemble des analyses de la forme erron&#233;e
</p>
<p>demander
INFINIT:PARTPASSE/1
</p>
<p>INFINIT:VERB/501
</p>
<p>IfPr:PtPa/2
</p>
<p>IfPr:IdPr/2
IfPr:SbPr/2
</p>
<p>GND:Msc PND
NND:Sg
</p>
<p>GND
PND:1st
PND:3rd
</p>
<p>3. Intersection des deux automates. Le chemin rouge correspond &#224; la meilleure analyse
</p>
<p>FIGURE 2 &#8211; Aide au diagnostic : composition des analyses
</p>
<p>4 Premi&#232;re &#233;valuation et travaux futurs
</p>
<p>Nous avons r&#233;alis&#233; une premi&#232;re &#233;valuation sur le corpus de dict&#233;es de Lenoble-Pinson, num&#233;ris&#233; et &#233;tiquet&#233; par
Fairon &amp; Simon (2009). Ce corpus comprend 1 300 dict&#233;es r&#233;alis&#233;es sur une p&#233;riode de 40 ann&#233;es (1969&#8211;2008)
aux Facult&#233;s Universitaires Saint-Louis (Bruxelles, Belgique) par des &#233;tudiants de 1re et 2e baccalaur&#233;at. Dans
le corpus original, les erreurs &#233;taient r&#233;parties en trois cat&#233;gories : usage, grammaire et ponctuation. La version
num&#233;ris&#233;e raffine ce classement en ajoutant trois cat&#233;gories : homophone, nouvelle orthographe et transcription.
Les fautes r&#233;pertori&#233;es nouvelle orthographe signifient que l&#8217;&#233;tudiant a signal&#233; employer une convention (l&#8217;or-
thographe traditionnelle ou la nouvelle orthographe), mais a malgr&#233; tout utilis&#233; des formes de l&#8217;autre convention.
Les erreurs de transcription correspondent &#224; des passages (un ou plusieurs mots complets) manquants ou ajout&#233;s
par l&#8217;&#233;tudiant. Il faut noter que le classement dans les diff&#233;rentes cat&#233;gories est probablement &#224; uniformiser : par
exemple, la confusion quelquefois &#8594; quelle que fois est class&#233;e dans usage, alors que quelque &#8596; quel que est
class&#233;e dans homophone. Notre &#233;valuation, r&#233;alis&#233;e sur un sous-ensemble de 441 dict&#233;es pr&#233;sentant 5 152 erreurs,
a port&#233; sur la qualit&#233; du syst&#232;me de d&#233;tection d&#8217;une part, et sur la qualit&#233; du syst&#232;me de diagnostic d&#8217;autre part.
</p>
<p>1) Globalement, 99% des erreurs (5 111 sur 5 152) sont correctement d&#233;tect&#233;es et align&#233;es. Toutes les erreurs
de d&#233;tection sont dues &#224; des probl&#232;mes de transcription, qu&#8217;il s&#8217;agisse de passages superflus ou manquants. Le
syst&#232;me est alors peu performant, puisqu&#8217;il ne g&#232;re correctement que 59% de ces erreurs. Pour comprendre le
ph&#233;nom&#232;ne, voici un exemple de passage tronqu&#233; :
</p>
<p>. . . fran&#231;aise [, quels qu&#8217;en puissent &#234;tre la gravit&#233; et le nombre] .</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RICHARD BEAUFORT, SOPHIE ROEKHAUT
</p>
<p>Contre toute attente, le syst&#232;me a favoris&#233; l&#8217;alignement du e final de fran&#231;aise sur le ent de puissent. Apr&#232;s analyse
des poids des diff&#233;rents alignements possibles, cette erreur est en fait due au filtre, &#224; qui l&#8217;on demande de favoriser
la substitution ent&#8596; e. Ce point ne manquera pas d&#8217;&#234;tre &#233;tudi&#233;.
2) &#201;valuation du diagnostic. L&#8217;&#233;valuation a port&#233; ici sur l&#8217;ensemble des erreurs, sauf celles de transcription, dont
la d&#233;tection-m&#234;me pose probl&#232;me. Le corpus de test est de ce fait r&#233;duit &#224; 5 052 erreurs. Nous ne g&#233;n&#233;rons pas le
m&#234;me classement que celui de Fairon &amp; Simon (2009). L&#8217;&#233;valuation a de ce fait consist&#233; &#224; valider manuellement
les analyses produites, et ce &#224; deux niveaux : en surface (s&#233;parateur superflu ou manquant, erreur lexicale et/ou
grammaticale, etc.) et en profondeur (mot hors-vocabulaire, erreur de lemme, erreur sur un trait grammatical, etc.).
Toute erreur d&#8217;analyse, quel que soit son niveau, a donn&#233; lieu au rejet du diagnostic dans son ensemble.
En l&#8217;&#233;tat actuel, le syst&#232;me a &#233;t&#233; capable d&#8217;analyser correctement 83% des erreurs (4 200 sur 5 052). Ce r&#233;sultat est
&#224; nuancer. 51,4% des erreurs d&#8217;analyse se r&#233;partissent entre les cat&#233;gories nouvelle orthographe, usage et homo-
phone. Actuellement, nous ne g&#233;rons pas la nouvelle orthographe, ce qui explique les erreurs dans cette cat&#233;gorie :
toute orthographe nouvelle, absente de nos lexiques, a &#233;t&#233; &#224; tort class&#233;e comme hors-vocabulaire. Les erreurs re-
cens&#233;es dans les cat&#233;gories usage et homophone concernent toutes des s&#233;quences sur-segment&#233;es, comme quel
que pour quelque ou d&#8217;avantage pour davantage. Ceci est d&#251; au fait que le syst&#232;me, au moment de l&#8217;&#233;valuation,
n&#8217;utilisait pas encore le lexique multi-mot d&#233;crit &#224; l&#8217;&#201;quation 4. Dans l&#8217;ensemble, ces erreurs devraient donc &#234;tre
facilement corrig&#233;es.
41,4% des erreurs concernent l&#8217;analyse grammaticale. L&#8217;erreur, dans ce cas, est souvent d&#233;j&#224; pr&#233;sente dans l&#8217;ana-
lyse de la forme correcte. Il s&#8217;agit soit de confusions de cat&#233;gories entre nom et adjectif, soit de confusions de
modes entre indicatif, subjonctif et imp&#233;ratif, soit de confusions de personnes au singulier. Ce type d&#8217;erreurs in-
dique clairement que l&#8217;analyse syntaxique r&#233;alis&#233;e sur la dict&#233;e doit &#234;tre am&#233;lior&#233;e. Actuellement, nous pensons
aborder le probl&#232;me &#224; l&#8217;aide de grammaires locales, qui guideront le mod&#232;le de langue.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ANTONIADIS G., GRANGER S., KRAIF O., PONTON C. &amp; ZAMPA V. (2009). NLP and CALL : integration is
working. In Proceedings of TaLC7, 7th Conference of Teaching and Language Corpora.
</p>
<p>BEAUFORT R. (2010). Composition filtr&#233;e et marqueurs de r&#232;gles de r&#233;&#233;criture pour une distance d&#8217;&#233;dition
flexible. Application &#224; la correction des mots hors-vocabulaire. Traitement Automatique des Langues (T.A.L.),
51(1), 11&#8211;40.
BEAUFORT R., DUTOIT T. &amp; PAGEL V. (2002). Analyse syntaxique du fran&#231;ais. Pond&#233;ration par trigrammes
liss&#233;s et classes d&#8217;ambigu&#239;t&#233;s lexicales. In Proc. JEP, p. 133&#8211;136.
</p>
<p>BEAUFORT R. &amp; RUELLE A. (2006). eLite : Syst&#232;me de synth&#232;se de la parole &#224; orientation linguistique. In
Proc. JEP, p. 509&#8211;512.
</p>
<p>CONIAM D. (1996). Computerized dictation for assessing listening proficiency. Calico Journal, 13, 73&#8211;86.
DAMERAU F. (1964). A technique for computer detection and correction of spelling errors. Communications of
the ACM, 7(3), 171&#8211;176.
DESMET P. &amp; H&#201;ROGUEL A. (2005). Les enjeux de la cr&#233;ation d&#8217;un environnement d&#8217;apprentissage &#233;lectro-
nique ax&#233; sur la compr&#233;hension orale &#224; l&#8217;aide du syst&#232;me auteur IDIOMA-TIC. Alsic. Apprentissage des Langues
et Syst&#232;mes d&#8217;Information et de Communication, 8(1), 281&#8211;303.
FAIRON C. &amp; SIMON A. (2009). Informatisation d&#8217;un corpus de dict&#233;es : 40 ann&#233;es de pratique orthographique
(1967-2008). In Pour l&#8217;amour des mots. Glanures lexicales, dictionnairiques, grammaticales et syntaxiques.
Hommage &#224; Mich&#232;le Lenoble-Pinson., p. 131&#8211;154.
</p>
<p>LEVENSHTEIN V. (1966). Binary codes capable of correcting deletions, insertions and reversals. Soviet Physics,
10, 707&#8211;710.
RAHIMI M. (2008). Using Dictation to Improve Language Proficiency. Asian EFL Journal.
</p>
<p>RUGGIA S. (2000). La dict&#233;e interactive. Alsic. Apprentissage des Langues et Syst&#232;mes d&#8217;Information et de
Communication, 3(1), 99&#8211;108.
SANTIAGO-ORIOLA C. (1998). Syst&#232;me vocal interactif pour l&#8217;apprentissage des langues - la synth&#232;se de la
parole au service de la dict&#233;e. PhD thesis, Toulouse III.</p>

</div></div>
</body></html>