<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une cha&#238;ne d&#8217;analyse des e-mails pour l&#8217;aide &#224; la gestion de sa messagerie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE CHAINE D&#8217;ANALYSE DES E-MAILS POUR L&#8217;AIDE A LA GESTION DE SA MESSAGERIE 
</p>
<p>Une cha&#238;ne d&#8217;analyse des e-mails pour l&#8217;aide &#224; la gestion de sa 
messagerie 
</p>
<p>Ga&#235;lle Recourc&#233;1 
(1)  Kwaga SAS, 15 rue J-B. Berlier, 75013 Paris, France 
</p>
<p>recource@kwaga.com  
 
</p>
<p>Au sein de la soci&#233;t&#233; Kwaga, une &#233;quipe d&#8217;ing&#233;nieurs a r&#233;alis&#233; une cha&#238;ne d&#8217;analyse des e-mails 
utilis&#233;e dans des applications d&#8217;aide &#224; la gestion de sa messagerie pour les particuliers et les professionnels. 
Ce c&#339;ur technologique int&#232;gre au travers d&#8217;un cha&#238;nage UIMA, plusieurs composants de TAL issus de la 
recherche universitaire ou r&#233;alis&#233;s en interne.  
</p>
<p>1 Une cha&#238;ne d&#8217;analyse des mails 
</p>
<p>1.1 Import des messages 
</p>
<p>La premi&#232;re &#233;tape de la cha&#238;ne d&#8217;analyse des mails consiste &#224; se connecter &#224; un serveur IMAP pour 
importer une bo&#238;te mail (messages entrants et sortants). Les mails sont caract&#233;ris&#233;s par une en-t&#234;te 
(exp&#233;diteur(s), destinataire(s) directs ou en copie, date), un contenu (sujet et corps) et par leur organisation 
en conversations : un ensemble de messages &#233;chang&#233;s sous un m&#234;me sujet par un ensemble de participants 
peut &#234;tre consid&#233;r&#233; comme une s&#233;quence de r&#233;pliques dans une conversation int&#233;grant des apart&#233;s 
(transferts).  
</p>
<p>1.2 UIMA &#8211; annotation des mails 
</p>
<p>Le corps de la cha&#238;ne d&#8217;analyse de Kwaga est impl&#233;ment&#233; dans le cadre d&#8217;une s&#233;quence d&#8217;annotations 
UIMA (Unstructured Information Management Architecture). Cette cha&#238;ne se subdivise en trois &#233;tapes, la 
d&#233;tection du corps textuel, l&#8217;analyse linguistique, et l&#8217;interpr&#233;tation. 
</p>
<p>1. Par le jeu des r&#233;ponses et transferts, le corps d&#8217;un e-mail se structure par des niveaux de reprises 
successifs, indiquant le degr&#233; de nouveaut&#233; dans la conversation.  Cette premi&#232;re annotation (CAS) 
consiste &#224; rep&#233;rer le texte nouveau, i.e. effectivement produit par le dernier exp&#233;diteur dans la 
conversation. Ce texte est par ailleurs soumis &#224; la reconnaissance de langue (gr&#226;ce &#224; un module 
adapt&#233; de TextCat) et diverses expressions r&#233;guli&#232;res sont appliqu&#233;es sur les champs structur&#233;s et sur 
le corps de message permettant de calculer des informations caract&#233;risant le message qui seront 
utilis&#233;es dans la phase d&#8217;interpr&#233;tation.  
</p>
<p>2.  La phase d&#8217;analyse linguistique est r&#233;alis&#233;e par l&#8217;application de graphes sur le corps et le sujet du 
mail par le biais d&#8217;une librairie JNI d&#8217;Unitex. Ces grammaires locales permettent d&#8217;une part de 
rep&#233;rer les &#233;l&#233;ments de la structure du message (formules introductives,  salutations finales, et 
signatures) et d&#8217;autre part des &#233;l&#233;ments du texte utilis&#233;s pour l&#8217;interpr&#233;tation : phrases prototypiques 
(demandes d&#8217;action, proposition de rencontre, facturation&#8230;) ou &#233;l&#233;ments d&#8217;information assimilables 
&#224; des entit&#233;s (dates, mots de passe...). Ces automates sont appliqu&#233;s en une passe unique, les sorties 
constituant une nouvelle annotation du CAS UIMA. 
</p>
<p>3. Derni&#232;re phase d&#8217;annotation UIMA, l&#8217;interpr&#233;tation exploite les informations contextuelles (data, 
exp&#233;diteurs, destinataires, &#8230;) et les combine avec les indices linguistiques d&#233;couverts dans le corps 
du texte, la signature ou le sujet pour calculer la cat&#233;gorie du mail et les &#233;ventuelles informations 
associ&#233;es telles les informations de contact. Ces informations d&#233;pendent aussi du contexte de 
conversation : un mail en r&#233;ponse peut, dans certaines conditions, h&#233;riter certaines propri&#233;t&#233;s du mail 
qui l&#8217;a pr&#233;c&#233;d&#233;.  
</p>
<p>2 D&#233;monstrations (en ligne) 
</p>
<p>&#8226; Analyse d&#8217;e-mails &#224; la demande (en fran&#231;ais ou en anglais). 
&#8226; Pr&#233;sentation de la cr&#233;ation &#224; la vol&#233;e de corpus d&#8217;e-mails (serveur IMAP Gmail) 
&#8226; Extraction d&#8217;information dans les e-mails &#8211; factures, mots de passe,  fiches contact 
&#8226; Cat&#233;gorisation des e-mails : mail importants et Bac&#8217;n.  </p>

</div></div>
</body></html>