<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Analyse discursive et informations de factivit&#233;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Analyse discursive et informations de factivit&#233;
</p>
<p>Laurence Danlos
ALPAGE, Universit&#233; Paris Diderot (Paris 7), 175 rue du Chevaleret, 750013 Paris
</p>
<p>Laurence.Danlos@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. Les annotations discursives propos&#233;es dans le cadre de th&#233;ories discursives comme RST (Rhetori-
cal Structure Theory) ou SDRT (Segmented Dicourse Representation Theory) ont comme point fort de construire
une structure discursive globale liant toutes les informations donn&#233;es dans un texte. Les annotations discursives
propos&#233;es dans le PDTB (Penn Discourse Tree Bank) ont comme point fort d&#8217;identifier la &#8220;source&#8221; de chaque in-
formation du texte &#8212; r&#233;pondant ainsi &#224; la question qui a dit ou pense quoi ? Nous proposons une approche unifi&#233;e
pour les annotations discursives alliant les points forts de ces deux courants de recherche. Cette approche unifi&#233;e
repose crucialement sur des information de factivit&#233;, telles que celles qui sont annot&#233;es dans le corpus (anglais)
FactBank.
</p>
<p>Abstract. Discursive annotations proposed in theories of discourse such as RST (Rhetorical Structure
Theory) or SDRT (Segmented Representation Theory Dicourse) have the advatange of building a global discourse
structure linking all the information in a text. Discursive annotations proposed in PDTB (Penn Discourse Tree
Bank) have the advatange of identifying the &#8220;source&#8221; of each information &#8212; thereby answering to questions such
as who says or thinks what ? We propose a unified approach for discursive annotations combining the strengths
of these two streams of research. This unified approach relies crucially on factivity information, as encoded in the
English corpus FactBank.
</p>
<p>Mots-cl&#233;s : Discours, Analyse discursive, Factivit&#233; (v&#233;racit&#233;), Interface syntaxe-s&#233;mantique, RST, SDRT,
PDTB, FactBank.
</p>
<p>Keywords: Discourse, Discursive analysis, Factuality (vericity), Syntax-semantic interface, RST, SDRT,
PDTB, FactBank.
</p>
<p>1 Introduction
</p>
<p>L&#8217;analyse discursive d&#8217;un texte s&#8217;effectue g&#233;n&#233;ralement en deux &#233;tapes : la premi&#232;re consiste &#224; segmenter le texte
en &#8220;unit&#233;s de discours &#233;l&#233;mentaires&#8221; (EDU, Elementary Discourse Unit), la seconde consiste &#224; construire la &#8220;struc-
ture du discours &#8221;, cette structure reposant sur les &#8220;relations de discours&#8221; (&#8220;relations rh&#233;toriques&#8221;) qui relient deux
segments de discours en sp&#233;cifiant le r&#244;le d&#8217;un segment par rapport &#224; l&#8217;autre, sp&#233;cifiant par l&#224;-m&#234;me l&#8217;intention
communicative de l&#8217;auteur du texte. Un segment de discours est soit une EDU soit un segment complexe groupant
plusieurs EDU avec r&#233;cursivement leur structure discursive. C&#8217;est cette approche de l&#8217;analyse discursive qui est
adopt&#233;e dans les deux principales th&#233;ories du discours, RST (Rhetorical Structure Theory, (Mann &amp; Thompson,
1988; Taboada &amp; Mann, 2006)) et SDRT (Segmented Dicourse Representation Theory, (Asher, 1993; Asher &amp;
Lascarides, 2003)) pour lesquelles des corpus ont &#233;t&#233; annot&#233;s manuellement, RST-corpus pour RST en anglais
(Carlson et al., 2003), et ANNODIS pour SDRT en fran&#231;ais (P&#233;ry Woodley et al., 2009).
</p>
<p>Parall&#232;lement &#224; ces travaux, des applications r&#233;centes du TAL comme la d&#233;tection d&#8217;opinion ou les syst&#232;mes de
question/r&#233;ponse ont fait surgir le besoin de savoir qui pense quoi ou qui a dit quoi. Ceci n&#233;cessite en premier
lieu de pouvoir identifier la &#8220;source&#8221; d&#8217;une information se trouvant dans un texte : est-elle attribu&#233;e &#224; l&#8217;auteur
du texte (le &#8220;locuteur&#8221;) ou &#224; une autre personne mentionn&#233;e dans le texte ? De plus, il faut pouvoir d&#233;terminer
si une information concernant un &#233;v&#233;nement (une &#233;ventualit&#233;) pr&#233;sente cet &#233;v&#233;nement comme correspondant &#224;
une situation du monde ou comme une simple possibilit&#233; ou hypoth&#232;se ; en termes techniques, il faut pouvoir
d&#233;terminer la &#8220;factivit&#233; des &#233;v&#233;nements&#8221;. Ces deux aspects sont intrins&#232;quement li&#233;s dans la mesure o&#249; la factivit&#233;
d&#8217;un &#233;v&#233;nement peut &#234;tre &#233;valu&#233;e diff&#233;remment, par exemple, par le locuteur et par une source autre que le
locuteur. Ainsi, dans Fred a dit que Jane &#233;tait la plus belle, la source de l&#8217;information &#8220;Jane est la plus belle&#8220;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS
</p>
<p>est Fred, la source de l&#8217;information que Fred a &#233;mis des propos est le locuteur. L&#8217;information subjective &#8220;Jane est
la plus belle&#8220; est prise en charge par Fred qui est pr&#234;t &#224; d&#233;fendre son point de vue tandis qu&#8217;elle n&#8217;est pas prise en
charge par le locuteur (voir la notion de &#8220;commitment&#8221; (Hamblin, 1970)). Ce courant de recherche a donn&#233; lieu
&#224; des corpus annot&#233;s pour la factivit&#233;, principalement FactBank pour l&#8217;anglais (Saur&#237;, 2008; Saur&#237; &amp; Pustejovsky,
2009) (Section 3).
</p>
<p>Le PDTB (Penn Discourse Tree Bank, (PDTB Group, 2008)) est un corpus annot&#233; pour l&#8217;anglais qui allie tant des
informations sur la structure discursive du texte que des informations sur la source et le degr&#233; de factivit&#233; des
&#233;ventualit&#233;s pr&#233;sent&#233;es dans le texte. C&#8217;est donc un effort notable pour aller vers une compr&#233;hension profonde
d&#8217;un texte. Le travail pr&#233;sent&#233; dans cet article s&#8217;inscrit dans la lign&#233;e du PDTB : il vise &#224; jeter les bases th&#233;oriques
d&#8217;un manuel pour annoter tant la structure discursive que les informations de factivit&#233; (relativement &#224; une source)
d&#8217;un texte fran&#231;ais. Il se d&#233;partit n&#233;anmoins du PDTB sur les points suivants :
</p>
<p>&#8211; Le PDTB ne repose pas sur une th&#233;orie du discours mais sur un formalisme D-LTAG (Discourse Lexicalized Tree
Adjoining Grammar, (Webber, 2004; Forbes-Riley et al., 2006) qui &#233;tend un formalisme d&#8217;analyse syntaxique
(LTAG) au discours. L&#8217;objectif du PDTB n&#8217;est pas d&#8217;annoter la structure discursive globale d&#8217;un texte. L&#8217;objectif
principal est d&#8217;annoter pour chaque connecteur de discours explicite (lexicalement marqu&#233;) et pour certains
(mais pas tous) connecteurs implicites (phonologiquement vides) leurs arguments (Section 2). A l&#8217;inverse,
notre travail s&#8217;inscrit dans la perspective d&#8217;annoter une analyse discursive compl&#232;te d&#8217;un texte comme en RST
ou SDRT.
</p>
<p>&#8211; Dans le PDTB, les informations de factivit&#233; sont annot&#233;es apr&#232;s que les arguments des connecteurs de discours
ont &#233;t&#233; identifi&#233;s. Nous montrerons &#224; l&#8217;inverse que les informations de factivit&#233; doivent &#234;tre annot&#233;es en premier
car elles sont primordiales pour d&#233;terminer les arguments des connecteurs (Section 4.1).
</p>
<p>&#8211; Dans le PDTB, les informations sur les sources d&#8217;un connecteur de discours et de ses arguments sont aussi an-
not&#233;es apr&#232;s que les arguments de la relation de discours ont &#233;t&#233; identifi&#233;s et avant les informations de factivit&#233;.
Nous montrerons &#224; nouveau que les informations de factivit&#233; doivent &#234;tre annot&#233;es en premier car elles sont
primordiales pour d&#233;terminer la source des relations de discours et par l&#224;-m&#234;me la source de leurs arguments
(Section 4.2).
</p>
<p>Pour pr&#233;senter les diff&#233;rentes positions th&#233;oriques que nous d&#233;fendons, nous nous concentrons dans cet article sur
des discours dont au moins une phrase (la premi&#232;re ou la seconde) est de forme N0hum V W que P = : Fred a dit
&#224; Marie que Zo&#233; allait venir pour No&#235;l, c&#8217;est-&#224;-dire une phrase complexe contenant un segment N0hum V W dont
la t&#234;te est un verbe V qui sous-cat&#233;gorise une compl&#233;tive P. Le symbole N0 d&#233;signe le sujet de V qui est consid&#233;r&#233;
ici comme humain, W d&#233;signe un ensemble &#233;ventuellement vide de compl&#233;ments (en incluant les clitiques) ou
d&#8217;ajouts (en incluant les particules n&#233;gatives).
</p>
<p>La Section 2 discute de la relation de discours Attribution qui est utilis&#233;e en RST et SDRT et que nous adoptons
pour relier N0hum V W &#224; la compl&#233;tive P dans une phrase de forme N0hum V W que P. La relation Attribution
n&#8217;&#233;tant pas utilis&#233;e dans le PDTB, nous pr&#233;sentons dans cette section les choix alternatifs effectu&#233;s dans le PDTB.
La Section 3 pr&#233;sente les informations de factivit&#233; telles qu&#8217;elle son annot&#233;es dans le corpus FactBank et que
nous adoptons. La Section 4 met en avant les positions th&#233;oriques que nous d&#233;fendons en examinant les analyses
discursives des discours dont la premi&#232;re phrase est de forme N0hum V W que P (Section 4.1) et de ceux dont la
seconde phrase est de cette forme (Section 4.2). La Section 5 montre qu&#8217;il n&#8217;est pas n&#233;cessaire d&#8217;annoter la source
des arguments des relations de discours : ces informations peuvent &#234;tre d&#233;duites des annotations sur la source
des relations de discours (lorsqu&#8217;on a recours &#224; la relation Attribution). La Section 6 conclut en pr&#233;sentant des
perspectives pour une annotation de corpus (fran&#231;ais) suivant les principes th&#233;oriques d&#233;fendus dans cet article.
</p>
<p>2 Relation de discours Attribution
</p>
<p>Consid&#233;rons le discours (1) qui encha&#238;ne deux phrases &#224; compl&#233;tive. Les deux compl&#233;tives (soulign&#233;es) sont
li&#233;es par la relation Re&#769;sultat marqu&#233;e par le connecteur adverbial du coup. Par cons&#233;quent, il faut que ces deux
compl&#233;tives soient consid&#233;r&#233;es comme des EDU.
</p>
<p>(1) Fred a dit &#224; Marie que Zo&#233; allait venir pour No&#235;l. Ensuite, Marc a ajout&#233; que du coup Sue ne viendrait pas.
</p>
<p>Il y a donc consensus pour consid&#233;rer que, dans un discours indirect de forme N0hum V W que P, la compl&#233;tive
P forme un EDU. Il en est de m&#234;me pour les discours directs (&#8220;Zo&#233; va venir pour No&#235;l&#8221;, a dit Fred &#224; Marie) o&#249;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE DISCURSIVE ET INFORMATIONS DE FACTIVIT&#201;
</p>
<p>la citation forme un EDU. Par contre, les positions divergent sur la question de savoir si le segment attributif &#8212; la
s&#233;quence N0hum V W dans un discours indirect ou l&#8217;incise de citation dans un discours direct &#8212; forme un EDU
ou non. Examinons les diff&#233;rentes positions.
</p>
<p>&#8211; En RST, il est pos&#233; que le segment attributif forme un EDU li&#233; au segment attribu&#233; par la relation Attribution
(Wolf &amp; Gibson, 2006; Redeker &amp; Egg, 2006). Cette relation de discours n&#8217;est pas standard puisque le segment
attributif ne forme pas un segment autonome (syntaxiquement et s&#233;mantiquement) et que Attribution ne joue
aucun r&#244;le rh&#233;torique.
</p>
<p>&#8211; La SDRT adopte la relation Attribution comme la RST mais avec une diff&#233;rence de taille : le segment attributif
est consid&#233;r&#233; comme complet (Hunter et al., 2006). En effet, il est pos&#233; qu&#8217;il contient une variable existentiel-
lement quantifi&#233;e correspondant &#224; l&#8217;argument phrastique du verbe du segment attributif, cette variable &#233;tant une
anaphore li&#233;e par (le contenu s&#233;mantique de) le segment attribu&#233;. Sans entrer dans des d&#233;tails trop techniques,
retenons que cette position revient &#224; analyser un discours indirect tel que Fred a dit &#224; Marie que Zo&#233; allait venir
comme Fred l&#8217;a dit &#224; Marie, que Zo&#233; allait venir et un discours direct tel que &#8220;Zo&#233; va venir pour No&#235;l&#8221;, a dit
Fred comme &#8220;Zo&#233; va venir pour No&#235;l&#8221;, Fred l&#8217;a dit.
La diff&#233;rence d&#8217;utilisation de Attribution en RST et SDRT est illustr&#233;e sur l&#8217;exemple (2a) avec segmentation en
EDU : (2b) pr&#233;sente l&#8217;analyse discursive en RST, (2c) celle en SDRT. Ces deux analyses s&#8217;accordent sur le point
suivant : le premier argument de Re&#769;sultat n&#8217;est pas le segment 2 ; ceci est exclu car la cause du segment 3 il l&#8217;a
&#233;nerv&#233;e construit autour du verbe causatif &#233;nerver ne peut &#234;tre qu&#8217;un acte de Fred (Pustejovsky, 1995; Danlos,
2000). Les analyses (2b) et (2c) ne diff&#232;rent que par le contenu s&#233;mantique qui est &#233;ventuellement donn&#233; au
premier argument de Attribution : non existant en RST qui pose que le premier argument de Re&#769;sultat est le
segment complexe form&#233; par l&#8217;ensemble segment attributif et segment attribu&#233;, not&#233; [1, 2] ; en revanche, SDRT
consid&#232;re que le premier argument de Re&#769;sultat est le segment 1 dont le contenu s&#233;mantique est consid&#233;r&#233;
comme &#233;quivalent &#224; Fred l&#8217;a dit &#224; Marie.
</p>
<p>(2)a. (Fred a dit &#224; Marie)1 que (Zo&#233; allait venir pour No&#235;l)2. (Il l&#8217;a &#233;nerv&#233;e)3.
b. Attribution(1, 2) &#8743; Re&#769;sultat([1, 2], 3)
c. Attribution(1, 2) &#8743; Re&#769;sultat(1, 3)
</p>
<p>Par contre, les deux th&#233;ories proposent la m&#234;me analyse pour (3a), voir (3b).
</p>
<p>(3)a. (Fred est tr&#232;s &#233;nerv&#233; en ce moment)1. (Jane dit)2 qu&#8217;(il est gravement malade)3.
b. Attribution(2, 3) &#8743; Explication(1, 3)
</p>
<p>&#8211; Dans le PDTB, la relation Attribution n&#8217;est pas utilis&#233;e car ce n&#8217;est pas une relation de discours standard (Pra-
sad et al., 2006). Les annotations effectu&#233;es dans le PDTB sont d&#233;taill&#233;es ci-dessous, mais, en faisant abstraction
du format particulier utilis&#233;, elles sont pr&#233;sent&#233;es en (4) et (5) pour (2a) et (3a) respectivement. En (4), les argu-
ments de Re&#769;sultat correspondent aux deux phrases. En (5), le second argument de Explication est le segment
2 (qui comporte un trait sp&#233;cifiant son segment attributif Jane dit que, cf ci-dessous).
</p>
<p>(4)a. (Fred a dit &#224; Marie que Zo&#233; allait venir pour No&#235;l)1. (Il l&#8217;a &#233;nerv&#233;e)2.
b. Re&#769;sultat(1, 2)
</p>
<p>(5)a. (Fred est tr&#232;s &#233;nerv&#233; en ce moment)1. Jane dit qu&#8217;(il est gravement malade)2.
b. Explication(1, 2)
</p>
<p>Les analyses propos&#233;es en RST et dans le PDTB peuvent &#234;tre consid&#233;r&#233;es comme &#233;quivalentes : nous laissons au
lecteur le soin de se convaincre que les analyses (2b) et (4b) ou (3b) et (5b) reviennent fondamentalement au m&#234;me,
ne diff&#233;rant que par l&#8217;utilisation ou non de Attribution. Par contre, la position prise en SDRT est radicalement
diff&#233;rente : les analyses (2b) &#224; la RST et (2c) &#224; la SDRT divergent sur le premier argument de Re&#769;sultat. Nous
&#233;cartons la position de SDRT pour deux raisons : la premi&#232;re est que l&#8217;analyse propos&#233;e en (2c) est contre-intuitive
et peut donc amener &#224; des erreurs d&#8217;annotation ; la seconde est qu&#8217;elle n&#8217;est pas linguistiquement justifi&#233;e pour
des discours directs 1 dont l&#8217;incise de citation a pour t&#234;te un verbe comme mentir qui ne permet pas de discours
indirect, (6a). Il est donc linguistiquement injustifi&#233; d&#8217;analyser (6b) comme *&#8220;Zo&#233; va venir pour No&#235;l&#8221;, Fred le
mentit car la citation en (6b) ne correspond pas &#224; un argument du verbe mentir. Celui-ci &#8212; comme plus de 500
autres verbes &#8212; demande une entr&#233;e lexicale sp&#233;ciale pour prendre en compte son emploi comme t&#234;te d&#8217;une incise
de citation (Danlos et al., 2010).
</p>
<p>(6)a. *Fred a menti que Zo&#233; allait venir pour No&#235;l.
b. &#8220;Zo&#233; va venir pour No&#235;l&#8221;, mentit Fred.
</p>
<p>1. Rappelons que les positions prises en RST, SDRT et dans le PDTB s&#8217;appliquent tant aux discours indirects qu&#8217;aux discours directs.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS
</p>
<p>Entre les positions quasiment &#233;quivalentes prises en RST et dans le PDTB, nous pr&#233;f&#233;rons celle prise en RST qui
a recours &#224; Attribution. En effet, le recours &#224; Attribution permet de construire la structure discursive globale
d&#8217;un texte en int&#233;grant tout fragment de texte, y compris tout segment attributif 2. En r&#233;sum&#233;, nous adoptons la
position prise en RST et donc des analyses comme (2b) et (3b) 3.
</p>
<p>La relationAttribution est utilis&#233;e en RST (ou SDRT) pour relier le segment attributif N0hum V W et la compl&#233;tive
lorsque V est un verbe de discours rapport&#233; comme dire mais aussi lorsque V est un verbe d&#8217;attitude proposition-
nelle comme craindre, croire, douter ou r&#233;aliser. De ce fait, Attribution ne prend pas en compte les diff&#233;rences
s&#233;mantiques entre tous ces verbes (leur factivit&#233;, par exemple) ni d&#8217;ailleurs le fait que le verbe soit sous la port&#233;e
d&#8217;une n&#233;gation. Il faut donc avoir recours &#224; d&#8217;autres m&#233;canismes pour prendre en compte ces diff&#233;rentes propri&#233;t&#233;s
du segment attributif qui influent sur l&#8217;analyse discursive. De tels m&#233;canismes seront pr&#233;sent&#233;s &#224; la Section 3.
</p>
<p>Auparavant, examinons la solution adopt&#233;e dans le PDTB o&#249; la relationAttribution n&#8217;est pas utilis&#233;e. Pour chaque
connecteur de discours explicite, sont annot&#233;s non seulement ses arguments mais aussi la source de la relation de
discours marqu&#233;e par le connecteur et la source de chacun de ses arguments. Ainsi, pour l&#8217;exemple (7a) de (Prasad
et al., 2006) o&#249; le connecteur while est soulign&#233;, ses argument Arg1 et Arg2 sont rep&#233;r&#233;s par les segments de texte
respectivement en italiques et en gras. Le segment attributif, purchasing agent said, plac&#233; dans une bo&#238;te, ne fait
partie d&#8217;aucun de ces arguments. Ces annotations sont compl&#233;t&#233;es par le tableau en (7b) qui indique la valeur
du trait [Source] pour les sources de la relation REL (marqu&#233;e par while et identifi&#233;e comme &#233;tant Contraste),
de Arg1 et de Arg2. La valeur &quot;Wr&quot; est utilis&#233;e pour l&#8217;auteur (&#8220;writer&#8221;) du texte, &quot;Inh&quot; indique que la valeur de
[Source] est h&#233;rit&#233;e de celle de REL, &quot;Ot&quot; (&#8220;other&#8221;) est utilis&#233;e pour un (ou des) individu(s) autre(s) que l&#8217;auteur (il
s&#8217;agit des purchasing agents pour Arg2). Comme la valeur du trait [Source] de Arg2 est &quot;Ot&quot;, cet argument poss&#232;de
un trait qui sp&#233;cifie son segment attributif, ici purchasing agent said. Le tableau comporte d&#8217;autres informations
relatives &#224; la factivit&#233; et la polarit&#233;, les traits [Type], [Polarity] et [Determinacy], mais nous ne les d&#233;taillerons pas
ici, non pas parce que nous les consid&#233;rons comme non pertinentes mais parce que, d&#8217;une part, nous pr&#233;f&#233;rons
celles mises au point dans FactBank qui sont plus sophistiqu&#233;es (Section 3) et que, d&#8217;autre part, nous pensons que
les informations de factivit&#233; doivent &#234;tre d&#233;termin&#233;es avant d&#8217;&#233;tablir quels sont les arguments d&#8217;un connecteur de
discours (Section 4.1) et quelle est sa source (Section 4.2).
</p>
<p>(7)a. Factory orders and construction outlays were largely flat in December while purchasing agents said
manufacturing shrank further in October.
</p>
<p>b.
</p>
<p>REL Arg1 Arg2
[Source] Wr Inh Ot
[Type] Comm Null Comm
[Polarity] Null Null Null
[Determinacy] Null Null Null
</p>
<p>Le PDTB apporte donc un grand soin &#224; des annotations permettant de d&#233;terminer qui a dit quoi, ce qui est effecti-
vement une question importante pour de nombreuses applications du TAL. Nous nous inspirons de leur approche
pour cet aspect de l&#8217;annotation discursive. Par contre, dans le PDTB, seuls les arguments de certains connecteurs
implicites (phonologiquement vides) sont annot&#233;s. Ainsi sont prises en compte les relations de discours qui doivent
&#234;tre inf&#233;r&#233;es entre deux phrases adjacentes juxtapos&#233;es &#224; l&#8217;int&#233;rieur d&#8217;un m&#234;me paragraphe, mais pas celles entre
deux phrases adjacentes s&#233;par&#233;es par une marque de paragraphe (PDTB Group, 2008). Il n&#8217;y a donc pas anno-
tation de la structure discursive globale du texte, alors que c&#8217;est l&#8217;ambition affich&#233;e dans le RST-corpus (Carlson
et al., 2003) et ANNODIS (P&#233;ry Woodley et al., 2009) 4. De plus, rien ne garantit qu&#8217;on puisse d&#233;duire la structure
discursive globale d&#8217;un paragraphe &#224; partir des annotations faites sur les arguments des connecteurs (explicites ou
implicites) figurant &#224; l&#8217;int&#233;rieur de ce paragraphe. Le probl&#232;me ne vient pas des segments attributifs qui peuvent
</p>
<p>2. Signalons toutefois que le recours &#224; Attribution pose un l&#233;ger probl&#232;me technique lorsque des compl&#233;ments ou ajouts du segment
attributif apparaissent apr&#232;s la compl&#233;tive, voir Fred a pr&#233;venu Marie que Zo&#233; allait venir pour No&#235;l par fax et par e-mail. De tels exemples
seront ignor&#233;s dans cet article.
</p>
<p>3. La relationAttribution est consid&#233;r&#233;e par tous les auteurs qui l&#8217;utilisent comme satellite-nucleus (dans les termes de la RST) ou subor-
donnante (dans les termes de la SDRT). N&#233;anmoins, en RST, les auteurs ne sont pas d&#8217;accord sur le nucleus de cette relation subordonnante :
(Wolf &amp; Gibson, 2006) consid&#232;rent que c&#8217;est le segment attributif tandis que (Redeker &amp; Egg, 2006) consid&#232;rent que c&#8217;est le segment attribu&#233;.
En SDRT, il est pos&#233; que c&#8217;est parfois l&#8217;un parfois l&#8217;autre, selon par exemple l&#8217;emploi intensionnel versus &#233;videntiel de dire, voir (2) versus
(3). Cette position de la SDRT nous para&#238;t tout &#224; fait justifi&#233;e, mais, faute de place, nous ne discuterons pas de la question du nucleus de
Attribution dans cet article.
</p>
<p>4. L&#8217;annotation effectu&#233;e dans ANNODIS pour le fran&#231;ais est donc nettement plus ambitieuse que celle effectu&#233;e dans le PDTB. Mais elle
ne concerne que 4000 relations de discours contre plus de 40 000 dans le PDTB.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE DISCURSIVE ET INFORMATIONS DE FACTIVIT&#201;
</p>
<p>&#234;tre facilement int&#233;gr&#233;s &#224; l&#8217;analyse discursive en faisant appel &#224; la relation Attribution telle qu&#8217;utilis&#233;e en RST. Il
vient de ce qu&#8217;un fragment de texte qui n&#8217;est int&#233;gr&#233; dans aucun argument d&#8217;aucun connecteur du paragraphe est
tout bonnement et simplement ignor&#233;. En d&#8217;autres termes, l&#8217;approche du PDTB &#8212; identifier les connecteurs expli-
cites et certains connecteurs implicites puis annoter leurs arguments &#8212; est orthogonale &#224; l&#8217;approche incr&#233;mentale
pr&#233;conis&#233;e en RST ou SDRT &#8212; identifier un nouveau segment de discours et l&#8217;int&#233;grer &#224; l&#8217;analyse discursive d&#233;j&#224;
construite. Nous nous inspirons de cette approche incr&#233;mentale, qui s&#8217;inscrit dans le courant de la s&#233;mantique
dynamique, pour cet aspect de l&#8217;analyse discursive visant &#224; construire la structure discursive globale d&#8217;un texte.
</p>
<p>En conclusion, comme pr&#233;conis&#233; en RST (ou SDRT), il semble justifier d&#8217;utiliser la relation Attribution tout
en ayant recours &#224; d&#8217;autres m&#233;canismes pour indiquer les propri&#233;t&#233;s s&#233;mantiques de son premier argument, un
segment attributif. N&#233;anmoins, en RST ou SDRT, la question de savoir quelles sont les sources d&#8217;une relation de
discours et de ses arguments est &#224; tort pass&#233;e sous silence. Nous consid&#233;rons qu&#8217;il doit &#234;tre inscrit dans les objectifs
de l&#8217;analyse discursive de d&#233;terminer quelles sont ces sources. Plus pr&#233;cis&#233;ment, nous consid&#233;rons que l&#8217;analyse
discursive doit indiquer la source de chaque relation de discours ; pour indiquer qu&#8217;une relation de discours R est
attribu&#233;e &#224; la source sj , nous utilisons la notation Rsj dans l&#8217;analyse discursive. Pour les arguments d&#8217;une relation
de discours, nous montrerons &#224; la Section 5 qu&#8217;il n&#8217;est pas n&#233;cessaire d&#8217;annoter leur source car celle-ci peut &#234;tre
d&#233;duite des informations contenues dans la structure discursive, &#224; savoir les sources des relations de discours et la
pr&#233;sence de relation(s) Attribution.
</p>
<p>Une des difficult&#233;s rencontr&#233;es dans l&#8217;analyse discursive pour des exemples mettant en jeu Attribution est de
savoir si c&#8217;est le segment attribu&#233; ou l&#8217;ensemble segment attributif et segment attribu&#233; qui est argument d&#8217;une
relation de discours donn&#233;e, voir le contraste entre (2b) et (3b). C&#8217;est &#224; cette difficult&#233; que nous allons nous
attaquer, entre autres, dans la Section 4. Auparavant, pr&#233;sentions les informations de factivit&#233; annot&#233;es dans le
corpus FactBank.
</p>
<p>3 Pr&#233;sentation de FactBank
</p>
<p>FactBank est un corpus (anglais) annot&#233; pour la factivit&#233; &#233;v&#233;nementielle. Pour chaque &#233;v&#233;nement (&#233;ventualit&#233;)
ei d&#8217;une phrase, les informations de factivit&#233; sont donn&#233;es relativement &#224; une source donn&#233;e, soit l&#8217;auteur soit
un (ou des) individu(s) &#224; qui est attribu&#233;e les informations concernant ei. Par exemple, dans une construction
&#224; compl&#233;tive de forme N0hum V W que P, les informations de factivit&#233; concernant l&#8217;&#233;v&#233;nement d&#233;crit dans la
compl&#233;tive P sont donn&#233;es par rapport &#224; l&#8217;auteur et au r&#233;f&#233;rent de N0 (si diff&#233;rent de l&#8217;auteur). D&#8217;une mani&#232;re
g&#233;n&#233;rale, une information de factivit&#233; est de la forme f(ei, sj) = x, o&#249; sj d&#233;signe l&#8217;auteur ou la source des
informations concernant ei 5. La valeur x d&#8217;une information de factivit&#233; est une paire Mod(x)Pol(x) contenant
une valeur de modalit&#233; et une valeur de polarit&#233;. Les valeurs de modalit&#233; sont au nombre de quatre : certain
(CT), probable (PR), possible (PS), non-sp&#233;cifi&#233; (U), avec une relation d&#8217;ordre entre ces valeurs. Les valeurs de
polarit&#233; sont au nombre de trois : positive (+), n&#233;gative (-) et non-sp&#233;cifi&#233; (u) 6. A titre d&#8217;illustration, pour la
phrase en (8) avec sa segmentation en deux EDU, les informations de factivit&#233; &#224; la FactBank sont donn&#233;es en (i).
L&#8217;&#233;v&#233;nement not&#233; ei est l&#8217;&#233;v&#233;nement d&#233;crit dans le segment i sans les &#233;ventuelles informations de modalit&#233; ou
de polarit&#233; n&#233;gative ; par exemple, pour le segment 2, e2 correspond &#224; Fred ira &#224; Dax. Pour e1, la seule source
pertinente est l&#8217;auteur qui affirme que cet &#233;v&#233;nement est vrai (l&#8217;auteur a assert&#233; la phrase donc le segment 1),
d&#8217;o&#249; f(e1, auteur) = CT+. Pour e2, les informations de factivit&#233; sont &#233;valu&#233;es relativement &#224; l&#8217;auteur et &#224; Jane.
Concernant l&#8217;auteur, la s&#233;mantique du verbe penser implique que l&#8217;auteur ne s&#8217;engage pas 7, ce qui veut dire qu&#8217;il
ne se prononce pas ou ne veut pas se prononcer sur le contenu propositionnel de P, d&#8217;o&#249; f(e2, auteur) = Uu.
Concernant Jane, penser implique que Jane juge le contenu propositionnel de P comme possible (PS) ; comme P
en (8) est sous une polarit&#233; n&#233;gative, f(e2, Jane) = PS&#8722;.
</p>
<p>(8) (Jane pense)1 que (Fred n&#8217;ira pas &#224; Dax)2.
(i) f(e1, auteur) = CT+ &#8743; f(e2, auteur) = Uu &#8743; f(e2, Jane) = PS&#8722;
</p>
<p>5. En fait, il peut y avoir plusieurs sources quand, par exemple, il y a ench&#226;ssement d&#8217;une compl&#233;tive dans une compl&#233;tive, voir Luc pense
que Zo&#233; a dit que P. N&#233;anmoins, nous laissons de c&#244;t&#233; pour l&#8217;instant ces cas complexes.
</p>
<p>6. Les paires Mod(x)Pol(x) sont cependant au nombre de 8 et non de 12 car certaines combinaisons de modalit&#233; et polarit&#233; ne font pas
sens, par exemple U+ ou U&#8722;
</p>
<p>7. Nous utilisons s&#8217;engager comme traduction de commit commun&#233;ment utilis&#233; dans la litt&#233;rature anglophone.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS
</p>
<p>FactBank n&#8217;est pas concern&#233; par les relations de discours et par l&#8217;analyse discursive : les annotations de factivit&#233;
sont effectu&#233;es phrase par phrase, sans tenir compte du contexte discursif ni des connaissances du monde, m&#234;me
celles concernant &#8220;l&#8217;autorit&#233; morale&#8221; d&#8217;une source d&#8217;information. Ces annotations proviennent uniquement de
connaissances en s&#233;mantique lexicale, en particulier des propri&#233;t&#233;s s&#233;mantiques des verbes &#224; compl&#233;tive, et de la
pr&#233;sence de marqueurs de modalit&#233; (&#233;pist&#233;mique) ou de polarit&#233;, l&#8217;interaction entre ces diff&#233;rents facteurs ayant
&#233;t&#233; mod&#233;lis&#233;e. Nous allons montrer que dans une approche de s&#233;mantique dynamique, la mise &#224; jour de l&#8217;analyse
discursive par un nouveau segment de discours doit se d&#233;rouler en trois &#233;tapes :
</p>
<p>(i) d&#233;termination des informations de factivit&#233; &#233;v&#233;nementielle dans le nouveau segment sur la seule base de
connaissances linguistiques,
</p>
<p>(ii) mise &#224; jour de la structure discursive en s&#8217;appuyant d&#8217;une part sur ces informations de factivit&#233; &#233;v&#233;nemen-
tielle d&#8217;autre part sur d&#8217;autres connaissances linguistiques, des connaissances pragmatiques et des connais-
sances du monde ; cette mise &#224; jour doit int&#233;grer l&#8217;identification de la source des relations de discours
introduites dans la structure discursive,
</p>
<p>(iii) r&#233;vision et/ou compl&#233;tion des informations de factivit&#233; &#233;v&#233;nementielle en fonction de l&#8217;analyse discursive.
</p>
<p>FactBank n&#8217;&#233;tant pas concern&#233; par les relations discursive, celles-ci ne sont pas annot&#233;es d&#8217;informations de facti-
vit&#233;. N&#233;anmoins, il est n&#233;cessaire de disposer de telles annotations, qui existent d&#8217;ailleurs dans le PDTB (Section 2).
Nous ajoutons donc dans les t&#226;ches de l&#8217;annotation de l&#8217;analyse discursive l&#8217;annotation des informations de facti-
vit&#233; concernant les relations de discours (t&#226;che qui doit &#234;tre effectu&#233;e &#224; l&#8217;&#233;tape ii).
</p>
<p>4 Analyse discursive de discours comportant Attribution
</p>
<p>Nous allons examiner l&#8217;analyse discursive de discours comprenant une phrase &#224; compl&#233;tive de forme N0hum V W
que P, mettant donc en jeu une relation Attribution. Dans un premier temps, nous discutons du cas o&#249; la phrase
&#224; compl&#233;tive appara&#238;t &#224; l&#8217;initiale du discours et est suivie d&#8217;une phrase simple (i.e. sans relation Attribution)
introduite par un connecteur de discours Conn &#233;ventuellement pr&#233;c&#233;d&#233; d&#8217;un signe de ponctuation (Ponct), soit
des discours de forme N0hum V W que P (Ponct) Conn P&#8217;. Nous montrerons que les informations de factivit&#233;
sont primordiales pour d&#233;terminer l&#8217;argument gauche de Conn. Dans un second temps, nous discutons du cas o&#249;
la phrase &#224; compl&#233;tive appara&#238;t apr&#232;s une autre phrase (avec ou sans relation Attribution), soit des discours de
forme P. (Conn) N0hum V W que (Conn) P&#8217;. Nous montrerons que les informations de factivit&#233; sont primordiales
pour identifier la source de la relation de discours marqu&#233;e par Conn.
</p>
<p>Avant d&#8217;entrer dans le vif du sujet, pr&#233;sentons nos conventions de segmentation en EDU, qui s&#8217;harmonisent avec
celles du PDTB. Un connecteur de discours, qu&#8217;il soit de type adverbial ou conjonction, n&#8217;est pas consid&#233;r&#233; comme
faisant partie d&#8217;une EDU. Cette convention n&#8217;est pas celle adopt&#233;e dans le projet ANNODIS (P&#233;ry Woodley et al.,
2009) o&#249; un connecteur est int&#233;gr&#233; &#224; l&#8217;EDU correspondant &#224; sa phrase h&#244;te. Ce choix effectu&#233; dans ANNODIS
pr&#233;juge de la port&#233;e s&#233;mantique des connecteurs. Ainsi, pour le discours en (9a) &#8212; dont il sera longuement
question &#224; la Section 4.2 &#8212;, la segmentation d&#8217;ANNODIS donn&#233;e en (9b) pr&#233;juge &#224; tort que ensuite a port&#233;e
s&#233;mantique sur Jane croit, contrairement &#224; la n&#244;tre donn&#233;e en (9c).
</p>
<p>(9)a. Fred ira &#224; Dax pour No&#235;l. Ensuite, Jane croit qu&#8217;il ira &#224; Pau.
b. (Fred ira &#224; Dax pour No&#235;l)1. (Ensuite, Jane croit)2 (qu&#8217;il ira &#224; Pau)3.
c. (Fred ira &#224; Dax pour No&#235;l)1. Ensuite, (Jane croit)2 qu&#8217;(il ira &#224; Pau)3.
</p>
<p>Lorsqu&#8217;un connecteur adverbial ne se trouve pas en t&#234;te de l&#8217;EDU qui correspond &#224; sa phrase h&#244;te, comme dans
l&#8217;exemple (10a) o&#249; ensuite se trouve au milieu du noyau verbal de sa phrase h&#244;te, il est possible d&#8217;avoir recours
&#224; une &#8220;forme normalis&#233;e de discours&#8221; (Danlos, 2009) qui fait abstraction de la position de l&#8217;adverbial &#8212; tout
en gardant une trace de cette position car il existe de cas o&#249; elle induit une diff&#233;rence de sens (Bras, 2008). La
segmentation de (10a) est alors celle donn&#233;e en (10b).
</p>
<p>(10)a. Fred ira &#224; Dax pour No&#235;l. Il ira ensuite &#224; Pau.
b. (Fred ira &#224; Dax pour No&#235;l)1. ensuiteinterne (Il ira &#224; Pau)2.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE DISCURSIVE ET INFORMATIONS DE FACTIVIT&#201;
</p>
<p>4.1 Attribution dans la premi&#232;re phrase (N0hum V W que P (Ponct) Conn P&#8217;)
</p>
<p>Pour ne pas introduire de bruit dans l&#8217;analyse des donn&#233;es, nous allons nous concentrer principalement sur des
discours Fred V W qu&#8217;il d&#233;testait les gr&#233;vistes (Ponct) Conn il est syndicaliste, en nous contentant de faire varier V
W, soit les propri&#233;t&#233;s du segment attributif, et de faire varier Conn entre la conjonction de subordination alors que
et l&#8217;adverbial pourtant, ces deux connecteurs marquant la relation Contraste. Nous allons montrer qu&#8217;il existe
trois interpr&#233;tations pour ces discours de forme N0hum V W que P (Ponct) Conn P&#8217;.
</p>
<p>Dans la premi&#232;re interpr&#233;tation, observ&#233;e uniquement avec Conn = alors que, soit une conjonction de subordina-
tion et non un connecteur adverbial, le segment attribu&#233; est P alors que P&#8217;, ce qui se traduit en discours direct par
&quot;P alors que P&#8217;&quot;, V N0 W, voir (11b). La citation de (11b) ou le discours rapport&#233; de (11a) met en jeu une &#8220;violation
d&#8217;attente&#8221;, &#224; savoir l&#8217;attente syndicaliste(x) &gt; &#172;de&#769;testerLesGre&#769;vistes(x). C&#8217;est cette violation d&#8217;attente qui
l&#233;gitime la relation Contraste marqu&#233;e lexicalement par alors que et dont la source est Fred. Avec cette interpr&#233;-
tation, l&#8217;analyse discursive de (11a) est celle donn&#233;e en (11c). Les informations de factivit&#233; sont donn&#233;es en (11d).
La relation Contraste pos&#233;e par Fred doit &#234;tre &#233;valu&#233;e par rapport &#224; l&#8217;auteur : la s&#233;mantique de dire implique que
l&#8217;auteur ne s&#8217;engage pas sur les propos de Fred, soit f(ContrasteFred(2, 3), auteur) = Uu, ce qui implique a
priori f(e2, auteur) = Uu&#8743;f(e3, auteur) = Uu. Par contre, f(ContrasteFred(2, 3), F red) = CT+ implique
a priori f(e2, F red) = CT + &#8743; f(e3, F red) = CT+.
</p>
<p>(11)a. (Fred a dit)1 qu&#8217;(il d&#233;testait les gr&#233;vistes)2 alors qu&#8217;(il est syndicaliste)3.
b. &quot;Je d&#233;teste les gr&#233;vistes alors que je suis syndicaliste&quot;, a dit Fred.
c. Attributionauteur(1, [2, 3]) &#8743; ContrasteFred(2, 3)
d. f(ContrasteFred(2, 3), auteur) = Uu &#8743; f(e2, auteur) = Uu &#8743; f(e3, auteur) = Uu
f(ContrasteFred(2, 3), F red) = CT + &#8743; f(e2, F red) = CT + &#8743; f(e3, F red) = CT+.
</p>
<p>Nous &#233;cartons d&#233;sormais cette interpr&#233;tation, en ne retenant pour les exemples suivants que celles mettant en jeu
Attributionauteur(1, 2), interpr&#233;tations privil&#233;gi&#233;es avec Conn = pourtant. Il reste alors deux possibilit&#233;s pour
l&#8217;argument gauche de Contraste : Contrasteauteur(2, 3) ou Contrasteauteur([1, 2], 3) avecAttribution(1, 2).
Nous allons montrer que le choix entre l&#8217;une ou l&#8217;autre de ces possibilit&#233;s d&#233;pend des informations de factivit&#233;
venant du segment attributif N0 V W.
</p>
<p>Commen&#231;ons par examiner des exemples o&#249; e2 et e3 mettent en jeu une violation d&#8217;attente, e.g. (Fred d&#233;teste les
gr&#233;vistes)2 et (Fred est syndicaliste)3. Consid&#233;rons (12a) construit autour du verbe r&#233;aliser qualifi&#233; de &quot;factif&quot;
dans la litt&#233;rature. Les informations &#224; la FactBank sont donn&#233;es en (12b). L&#8217;auteur croit en la v&#233;racit&#233; de e2 et
e3 qui mettent en jeu la violation d&#8217;attente syndicaliste(x) &gt; &#172;de&#769;testerLesGre&#769;vistes(x). Il peut donc poser
la relation Contraste entre les segments 2 et 3, ce qui d&#233;bouche sur l&#8217;analyse donn&#233;e en (12c). L&#8217;intention
communicative de l&#8217;auteur est de montrer que Fred est incoh&#233;rent avec lui-m&#234;me.
</p>
<p>(12)a. (Fred a r&#233;alis&#233;)1 qu&#8217;(il d&#233;testait les gr&#233;vistes)2. Pourtant (il est syndicaliste)3.
b. f(e1, auteur) = CT+
f(e2, F red) = CT + &#8743; f(e2, auteur) = CT+
f(e3, auteur) = CT+
</p>
<p>c. Attributionauteur(1, 2) &#8743; Contrasteauteur(2, 3)
</p>
<p>Passons maintenant &#224; (13a) construit autour de pr&#233;tendre qui est un &#8220;factif n&#233;gatif&#8221;, voir les informations de facti-
vit&#233; concernant e2 en (13b) o&#249; f(e2, auteur) = CT&#8722; indique que d&#8217;apr&#232;s l&#8217;auteur ce n&#8217;est certainement pas le cas
que Fred d&#233;teste les gr&#233;vistes. L&#8217;auteur ne peut donc pas poser qu&#8217;il y a violation de l&#8217;attente syndicaliste(x) &gt;
&#172;de&#769;testerLesGre&#769;vistes(x). Il ne peut donc poser qu&#8217;un contraste entre le fait que Fred a pr&#233;tendu qu&#8217;il d&#233;testait
les gr&#233;vistes et e3, ce qui d&#233;bouche sur l&#8217;analyse donn&#233;e en (13c). L&#8217;intention communicative de l&#8217;auteur est de
montrer que Fred a menti.
</p>
<p>(13)a. (Fred a pr&#233;tendu)1 qu&#8217;(il d&#233;testait les gr&#233;vistes)2. Pourtant (il est syndicaliste)3.
b. f(e2, F red) = CT + &#8743; f(e2, auteur) = CT&#8722;
c. Attributionauteur(1, 2) &#8743; Contrasteauteur([1, 2], 3)
</p>
<p>Finalement, consid&#233;rons (14a) construit autour de dire avec les informations de factivit&#233; pour e2 donn&#233;es en (14b) :
l&#8217;auteur ne se prononce pas sur la v&#233;racit&#233; de e2. Le discours (14a) ne suffit pas &#224; lui-seul pour d&#233;terminer l&#8217;opinion</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS
</p>
<p>de l&#8217;auteur, qui peut d&#8217;ailleurs &#234;tre h&#233;sitant comme en t&#233;moigne le fait que (14a) peut &#234;tre prolong&#233; par une phrase
qui indique explicitement son h&#233;sitation, (14c). Nous consid&#233;rons donc (14a) comme ambigu, ambigu&#239;t&#233; traduite
dans l&#8217;analyse discursive en (14d) comportant une disjonction. Cette disjonction se traduit par les informations de
factivit&#233; donn&#233;es en (14e).
</p>
<p>(14)a. (Fred a dit)1 qu&#8217;(il d&#233;testait les gr&#233;vistes)2. Pourtant (il est syndicaliste)3.
b. f(e2, F red) = CT + &#8743; f(e2, auteur) = Uu
c. Fred a dit qu&#8217;il d&#233;testait les gr&#233;vistes. Pourtant il est syndicaliste. Soit il est incoh&#233;rent avec lui-m&#234;me soit
</p>
<p>il a menti.
d. Attributionauteur(1, 2) &#8743; (Contrasteauteur([1, 2], 3) &#8744; Contrasteauteur(2, 3))
e. f(Contrasteauteur([1, 2], 3), auteur) = PS + &#8743; f(Contrasteauteur(2, 3)), auteur) = PS+
</p>
<p>Tournons-nous rapidement vers des exemples o&#249; le segment 2 est le contraire de 3, e.g. (il pleuvait)2 et (il
ne pleuvait pas)3. Comme un individu ne peut pas croire simultan&#233;ment en une chose et son contraire 8, on a
POL(f(e2, sj)) = &#8722;POL(f(e3, sj)) avec &#8722;u = u. Cette r&#232;gle explique l&#8217;incoh&#233;rence de #Fred a r&#233;alis&#233; qu&#8217;il
pleuvait. Pourtant, il ne pleuvait pas. construit avec le verbe factif r&#233;aliser. Cette r&#232;gle explique aussi que le dis-
cours en (15a) construit avec dire est non ambigu, contrairement au discours en (14a) construit aussi avec dire. En
effet, l&#8217;auteur ne pouvant poser Contraste(2, 3), il pose Contraste([1, 2], 3), voir l&#8217;analyse en (15b) qui indique
que l&#8217;intention communicative de l&#8217;auteur est de montrer que Fred a menti.
</p>
<p>(15)a. (Fred a dit)1 qu&#8217;(il pleuvait)2. Pourtant (il ne pleuvait pas)3.
b. Attributionauteur(1, 2) &#8743; Contrasteauteur([1, 2], 3)
</p>
<p>Cette discussion sur les analyses discursives des discours de forme (N0 V W)1 que (P)2 (Ponct) Conn (P&#8217;)3 am&#232;ne
les remarques suivantes respectivement sur le PDTB et SDRT :
</p>
<p>1) PDTB : Tout annotateur &#8220;na&#239;f&#8221; se reposant sur son intuition imm&#233;diate se jetterait probablement sur la violation
d&#8217;attente syndicaliste(x) &gt; &#172;de&#769;testerLesGre&#769;vistes(x) pour poser syst&#233;matiquement Contraste(2, 3) dans
les exemples (12)-(14). Or cette analyse est fausse pour (13) et (14). Ce point est &#224; relier au suivant : dans le PDTB,
les arguments Arg1 et Arg2 d&#8217;une relation de discours REL sont annot&#233;s avant les informations de factivit&#233; (qui
sont ajout&#233;es sur REL, Arg1 et Arg2, voir le tableau en (7b)). Les exemples (12)-(14) montrent qu&#8217;&#224; l&#8217;inverse il
faut annoter les informations de factivit&#233; avant d&#8217;annoter les arguments d&#8217;une relation de discours donn&#233;e.
</p>
<p>2) SDRT : En SDRT, la relation Contraste est consid&#233;r&#233;e comme &#8220;v&#233;ridique&#8221;, ce qui est d&#233;fini dans (Asher &amp;
Lascarides, 2003) comme une relation impliquant la v&#233;racit&#233; (du contenu propositionnel) de ces deux arguments.
N&#233;anmoins, les discours mis en avant par ces auteurs ne sont que des discours simples dans la mesure o&#249; ils ne
mettent jamais en jeu la relationAttribution. En d&#8217;autres termes, dans ces discours, tout est attribu&#233; &#224; l&#8217;auteur, les
relations de discours et leurs arguments, ce qui permet d&#8217;ignorer le fait que les informations de v&#233;racit&#233; (factivit&#233;)
doivent &#234;tre &#233;valu&#233;es relativement &#224; plusieurs sources. Il faut donc r&#233;viser la notion de relation de discours v&#233;ri-
dique en prenant en compte l&#8217;&#233;valuation des informations de factivit&#233; relativement &#224; plusieurs sources (Danlos,
2011).
</p>
<p>4.2 Attribution dans la seconde phrase (P. (Conn) N0hum V W que (Conn) P&#8217;.)
</p>
<p>Pour ne pas introduire de bruit dans l&#8217;analyse des donn&#233;es, nous allons nous concentrer uniquement sur des
discours avec Conn = ensuite, ce connecteur marquant la relation Narration de succession temporelle entre
deux &#233;v&#233;nements. Consid&#233;rons d&#8217;abord des phrases Ensuite, N0 V W que P (avec une relation Attribution) qui
sont &#233;nonc&#233;es dans un contexte gauche comprenant aussi une relationAttribution, par exemple (16a) (le contexte
gauche, i.e. P, est mis en italiques). Dans cet exemple, ensuite a port&#233;e sur elle a cru : c&#8217;est un ajout syntaxique
et s&#233;mantique sur le noyau verbal, qui peut &#234;tre d&#233;plac&#233; &#224; l&#8217;int&#233;rieur de celui-ci sans changement de sens, (16b),
mais qui ne peut pas &#234;tre d&#233;plac&#233; &#224; l&#8217;int&#233;rieur la compl&#233;tive sans induire un changement de sens important, (16c).
</p>
<p>(16)a. Jane a (d&#8217;abord) cru que Fred irait &#224; Dax pour No&#235;l. Ensuite, elle a cru qu&#8217;il irait &#224; Pau.
b. = Jane a (d&#8217;abord) cru que Fred irait &#224; Dax pour No&#235;l. Elle a ensuite cru qu&#8217;il irait &#224; Pau.
</p>
<p>8. Citons (Prabhakaran et al., 2010) : &#8220;We cannot both believe something and not believe it : #John won&#8217;t be here, but nevertheless I think
he may be here.&#8221;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE DISCURSIVE ET INFORMATIONS DE FACTIVIT&#201;
</p>
<p>c. 6= Jane a (d&#8217;abord) cru que Fred irait &#224; Dax pour No&#235;l. Elle a cru qu&#8217;ensuite il irait &#224; Pau.
</p>
<p>Le discours (16a) d&#233;crit la succession temporelle de croyances de Jane. En suivant sa segmentation donn&#233;e en
(17a), il doit donc &#234;tre analys&#233; avec Narration([1, 2], [3, 4]). La relation Narration est pos&#233;e par l&#8217;auteur, tout
comme les deux relations Attribution. Au total, l&#8217;analyse discursive de (16a) est celle pr&#233;sent&#233;e en (17b).
</p>
<p>(17)a. (Jane a (d&#8217;abord) cru)1 que (Fred irait &#224; Dax pour No&#235;l)2. Ensuite, (elle a cru)3 qu&#8217;(il irait &#224; Pau)4.
b. Attributionauteur(1, 2) &#8743; Attributionauteur(3, 4) &#8743; Narration([1, 2], [3, 4])
</p>
<p>Consid&#233;rons maintenant des phrases Ensuite, N0 V W que P qui sont &#233;nonc&#233;es dans un contexte gauche ne com-
prenant pas de relation Attribution, par exemple (18a). Dans cet exemple, le d&#233;placement de ensuite &#224; droite de
croit d&#233;bouche sur une incoh&#233;rence, (18b), mais le d&#233;placement de ensuite &#224; l&#8217;int&#233;rieur de la compl&#233;tive n&#8217;induit
pas de diff&#233;rence de sens majeur, (18c).
</p>
<p>(18)a. Fred ira &#224; Dax pour No&#235;l. Ensuite, Jane croit qu&#8217;il ira &#224; Pau.
b. # Fred ira &#224; Dax pour No&#235;l. Jane croit ensuite qu&#8217;il ira &#224; Pau.
c. = Fred ira &#224; Dax pour No&#235;l. Jane croit qu&#8217;ensuite il ira &#224; Pau.
</p>
<p>L&#8217;analyse syntaxique de (18a) pose probl&#232;me pour l&#8217;interface syntaxe-s&#233;mantique mais nous n&#8217;aborderons pas ce
sujet ici (Dinesh et al., 2005). En (18a) et (18c), l&#8217;&#233;v&#233;nement du segment 1 (le voyage de Fred &#224; Dax) est pr&#233;sent&#233;
comme pr&#233;c&#233;dant dans le temps l&#8217;&#233;v&#233;nement du segment 3 (le voyage de Fred &#224; Pau), on a doncNarration(1, 3).
Il reste &#224; examiner quelle est la source de Narration. Commen&#231;ons par un exemple comme (18c) o&#249; ensuite se
situe dans la compl&#233;tive. Une source, que ce soit l&#8217;auteur ou non, ne peut poser de relation de succession temporelle
entre deux &#233;v&#233;nements que si cette personne est au courant des deux &#233;v&#233;nements en jeu, ou tout du moins si
elle pense qu&#8217;ils se sont pass&#233;s (ou vont se passer) certainement, probablement ou peut-&#234;tre 9. Examinons les
cons&#233;quences de cette affirmation pour (18c), r&#233;p&#233;t&#233; en (19a) avec segmentation en EDU et dont les informations
de factivit&#233; concernant e3 sont donn&#233;es en (19b). L&#8217;auteur ne peut pas poser une relation de succession temporelle
entre e1 et e3 car il ne s&#8217;engage pas sur le statut factuel de e3. En revanche, Jane peut poser une telle relation car
elle juge e3 probable. L&#8217;analyse discursive est donc celle donn&#233;e en (19c) o&#249; la source de la relation Narration
est Jane. L&#8217;auteur ne prend pas en charge cette relation, (19d). Il peut d&#8217;ailleurs la mettre en question dans une
troisi&#232;me phrase, voir (19e), qui am&#232;ne &#224; une r&#233;vision de la valeur de factivit&#233; donn&#233;e en (19d). Par ailleurs, les
informations de factivit&#233; &#233;v&#233;nementielle ne disent rien sur f(e1, Jane) puisque la source de 1 est l&#8217;auteur, mais
l&#8217;analyse discursive avec NarrationJane(1, 3) am&#232;ne &#224; poser f(e1, Jane) = CT+ (ou &#224; la rigueur PR+ou
PS+). Ces donn&#233;es montrent que les informations de factivit&#233; &#233;v&#233;nementielle doivent &#234;tre r&#233;vis&#233;es ou compl&#233;t&#233;es
apr&#232;s l&#8217;analyse discursive.
</p>
<p>(19)a. (Fred ira &#224; Dax pour No&#235;l)1. (Jane croit)2 qu&#8217;ensuite (il ira &#224; Pau)3.
b. f(e3, Jane) = PR+ &#8743; f(e3, auteur) = Uu
c. Attributionauteur(2, 3) &#8743; NarrationJane(1, 3)
d. f(NarrationJane(1, 3), auteur) = Uu
e. Fred ira &#224; Dax voir sa m&#232;re. Jane croit qu&#8217;ensuite il ira &#224; Pau voir son p&#232;re. Mais je pense qu&#8217;il ira voir
</p>
<p>son p&#232;re avant d&#8217;aller voir sa m&#232;re.
</p>
<p>Passons &#224; (20a) dont les informations factuelles pour e3 sont donn&#233;es en (20b). La m&#232;re de Fred n&#8217;&#233;tant pas au
courant de l&#8217;&#233;v&#233;nement e3, elle ne peut pas poser de succession temporelle entre e1 et e3. La relation de succession
temporelle ne peut donc &#234;tre pos&#233;e que par l&#8217;auteur, voir l&#8217;analyse en (20c).
</p>
<p>(20)a. (Fred ira &#224; Dax pour No&#235;l voir sa m&#232;re)1. (Celle-ci ne sait pas)2 qu&#8217;ensuite (il ira &#224; Pau voir son p&#232;re)3.
b. f(e3,Me&#768;redeFred) = Uu &#8743; f(e3, auteur) = CT+
c. Attributionauteur(2, 3) &#8743; Narrationauteur(1, 3)
</p>
<p>L&#8217;exemple (20a) contredit une id&#233;e qu&#8217;on aurait pu avoir a priori, &#224; savoir qu&#8217;un adverbial qui se situe dans une
compl&#233;tive P introduite par N0 V W a pour source le r&#233;f&#233;rent de N0 10. Le contraste entre (19c) et (20c) montre que
</p>
<p>9. Par souci de simplification, nous ignorons dans cette discussion la succession temporelle d&#8217;&#233;v&#233;nements dont un au moins est sous la
port&#233;e d&#8217;une polarit&#233; n&#233;gative.
</p>
<p>10. (Bonami &amp; Godard, 2008) mettent aussi en avant des exemples o&#249; un adverbe &#233;valuatif tel que bizarrement se situe dans une compl&#233;tive
sans avoir pour source le r&#233;f&#233;rent de N0.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS
</p>
<p>les informations de factivit&#233; sont n&#233;cessaires pour d&#233;terminer la source des relations de discours (en plus d&#8217;&#234;tre
n&#233;cessaires pour d&#233;terminer leurs arguments, comme montr&#233; &#224; la section pr&#233;c&#233;dente).
</p>
<p>Examinons (21a) o&#249; la seconde phrase comporte une coordination. Son analyse discursive, construite par analogie
avec celle de (19a), est donn&#233;e en (21a). Celle-ci est un contre-exemple &#224; la contrainte de la fronti&#232;re droite pos&#233;e
en SDRT (Asher &amp; Lascarides, 2003). Rappelons que ces auteurs &#233;tudient seulement des discours ne comportant
que des assertions de l&#8217;auteur et que donc toutes les relations de discours sont attribu&#233;es &#224; l&#8217;auteur. La contrainte de
la fronti&#232;re droite a pour effet d&#8217;interdire R(&#945;, &#946;) &#8743; R&#8242;(&#945;, &#947;) lorsque R est coordonnante. Si cette interdiction est
probablement valable lorsque seules sont consid&#233;r&#233;es des assertions de l&#8217;auteur, soit Rauteur et R&#8242;auteur, elle ne
l&#8217;est plus lorsqu&#8217;on consid&#232;re des sources autres que l&#8217;auteur : voir l&#8217;analyse en (21b) avecNarrationJane(1, 3)&#8743;
NarrationZoe&#769;(1, 5) o&#249; Narration est sans conteste coordonnante. Il est donc n&#233;cessaire d&#8217;&#233;tudier la validit&#233; de
la contrainte de la fronti&#232;re droite dans des discours mettant en jeu la relation Attribution.
</p>
<p>(21)a. (Fred ira &#224; Dax pour No&#235;l)1. (Jane croit)2 qu&#8217;ensuite (il ira &#224; Pau)3 et (Zo&#233; croit)4 qu&#8217;(ensuite) (il ira &#224;
Bayonne)5.
</p>
<p>b. Attributionauteur(2, 3) &#8743; NarrationJane(1, 3) &#8743; Attributionauteur(4, 5) &#8743; NarrationZoe&#769;(1, 5)
</p>
<p>Tournons-nous maintenant vers la source de ensuite dans des exemples de forme Ensuite, N0 V W que P en
consid&#233;rant les trois discours obtenus &#224; partir de (19a)-(21a) en d&#233;pla&#231;ant ensuite en t&#234;te de la phrase, voir (22).
En (22a), qui r&#233;p&#232;te (18a), la source de ensuite n&#8217;est pas claire : on peut h&#233;siter entre l&#8217;auteur ou Jane 11. En (22b),
la source de ensuite est l&#8217;auteur comme en (20a). Enfin, en (22c), la source de ensuite est l&#8217;auteur alors que c&#8217;est
Jane ou Zo&#233; en (21a).
</p>
<p>(22)a. Fred ira &#224; Dax pour No&#235;l. Ensuite, Jane croit qu&#8217;il ira &#224; Pau.
b. Fred ira &#224; Dax pour No&#235;l. Ensuite, Jane ne sait pas qu&#8217;il ira &#224; Pau.
c. Fred ira &#224; Dax pour No&#235;l. Ensuite, Jane croit qu&#8217;il ira &#224; Pau et Zo&#233; croit qu&#8217;il ira &#224; Bayonne.
</p>
<p>En conclusion, la position du connecteur, en t&#234;te de la phrase complexe ou en t&#234;te de la compl&#233;tive, n&#8217;induit pas
de diff&#233;rence de sens majeur &#224; l&#8217;exception du fait qu&#8217;elle peut &#233;ventuellement influer sur la source du connecteur
(et donc sur la source de la relation de discours qu&#8217;il exprime).
</p>
<p>5 Source des arguments d&#8217;une relation de discours
</p>
<p>Montrons bri&#232;vement qu&#8217;une structure discursive faisant appel &#224; Attribution et compos&#233;e d&#8217;une conjonction de
formules Rsj (&#945;, &#946;) o&#249; les sources sj des relations R sont annot&#233;es suffit &#224; d&#233;terminer la source des arguments &#945;
et &#946; de Rsj , quelle que soit R, et par l&#224;-m&#234;me r&#233;cursivement la source de chaque EDU du texte.
</p>
<p>1)R = Attribution. Le premier argument &#945; est alors forc&#233;ment une EDU. En effet,Attribution am&#232;ne &#224; d&#233;com-
poser un ench&#226;ssement de plusieurs compl&#233;tives : (23a) re&#231;oit la segmentation en (23b) et l&#8217;analyse discursive en
(23c).
</p>
<p>(23)a. Fred pense que Zo&#233; a dit qu&#8217;il neigeait.
b. (Fred pense)1 que (Zo&#233; a dit)2 qu&#8217;(il neigeait)3.
c. Attributionauteur(1, [2, 3]) &#8743; AttributionFred(2, 3)
</p>
<p>Attributionsj (&#945;, &#946;) indique que la source de &#945; est sj . Le second argument &#946; peut &#234;tre une EDU ou un segment
complexe. Lorsque &#946; est une EDU, sa source est d&#233;termin&#233;e par le segment attributif &#945;. Si celui-ci est de forme
N0 V W alors la source de &#946; est le r&#233;f&#233;rent de N0. Lorsque &#946; est un segment complexe, la structure discursive de
ce segment permet r&#233;cursivement de d&#233;terminer la source de ses EDU. Ainsi, en (23a), la source de 1 est l&#8217;auteur,
celle de 2 Fred et celle de 3 Zo&#233;.
</p>
<p>2) R 6= Attribution. Si les arguments &#945; et &#946; de R sont des EDU, alors soit ils apparaissent l&#8217;un et/ou l&#8217;autre dans
la structure discursive comme argument d&#8217;une relation Attribution, par exemple Attributionsk(&#947;, &#946;), et l&#8217;&#233;tape
pr&#233;c&#233;dente s&#8217;applique alors pour d&#233;terminer leur source, soit ce n&#8217;est pas le cas et leur source est alors l&#8217;auteur. Si
les arguments &#945; et &#946; ne sont pas des EDU, le m&#233;canisme s&#8217;applique r&#233;cursivement.
</p>
<p>11. Ce type d&#8217;h&#233;sitation sur la source d&#8217;un connecteur a amen&#233; les auteurs du PDTB &#224; faire un choix par d&#233;faut, &#224; savoir l&#8217;auteur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANALYSE DISCURSIVE ET INFORMATIONS DE FACTIVIT&#201;
</p>
<p>6 Conclusion et perspectives
</p>
<p>En nous inspirant de th&#233;ories sur le discours (RST et SDRT) d&#8217;une part, et du corpus annot&#233; PDTB d&#8217;autre part, nous
avons mis en &#233;vidence que le calcul ou l&#8217;annotation de l&#8217;analyse discursive d&#8217;un texte devait produire une structure
hi&#233;rarchique connexe o&#249; tous les &#233;l&#233;ments d&#8217;information devaient &#234;tre reli&#233;s &#8212; ce qui n&#8217;est pas le cas dans le PDTB
&#8212; et o&#249; les sources des diff&#233;rentes relations de la structure discursive devaient &#234;tre calcul&#233;es ou annot&#233;es &#8212; ce
qui n&#8217;est pas le cas en RST ou SDRT. En corollaire, nous avons montr&#233; qu&#8217;une structure discursive qui utilise la
relationAttribution et qui d&#233;finit la source de chaque relation de discours est suffisante pour d&#233;terminer la source
de chaque EDU du texte (Section 5).
</p>
<p>Nous avons montr&#233; de plus que les informations de factivit&#233; &#224; la FactBank &#233;taient primordiales non seulement
pour identifier les arguments d&#8217;une relation de discours donn&#233;e (Section 4.1) mais aussi pour identifier sa source
(Section 4.2), et donc, d&#8217;apr&#232;s notre corollaire, identifier la source de chaque EDU du texte. A rebours, nous avons
montr&#233; que les informations de factivit&#233; &#224; la FactBank devaient &#234;tre r&#233;vis&#233;es ou compl&#233;t&#233;es apr&#232;s le calcul ou
l&#8217;annotation de la structure discursive.
</p>
<p>Dans nos perspectives de recherche, nous incluons :
</p>
<p>1) L&#8217;extension du travail pr&#233;sent&#233; ici &#224; d&#8217;autres constructions que les discours indirects de forme N0hum V W
que P discut&#233;es dans cet article. Nous avons d&#233;j&#224; amorc&#233; l&#8217;&#233;tude des discours directs dans (Danlos et al., 2010).
Il reste les constructions &#224; infinitive (avec des &#8220;verbes &#224; mont&#233;e&#8221; ou &#8220;des verbes &#224; contr&#244;le&#8221;), les constructions
impersonnelles et les constructions mettant en jeu un &#8220;verbe de discours&#8221; dont le sujet r&#233;f&#232;re &#224; un &#233;v&#233;nement
(Ceci a pr&#233;c&#233;d&#233;/expliqu&#233;/prouv&#233; que P) (Danlos, 2006). Pour chacune de ces constructions, qui pr&#233;sentent un
&#233;v&#233;nement ench&#226;ss&#233; sous un autre, il faut en premier lieu d&#233;terminer quelle est la segmentation en EDU &#8212; en se
posant la question de savoir si cette segmentation peut &#234;tre obtenue &#224; partir d&#8217;une analyse syntaxique profonde.
Il faut ensuite d&#233;terminer les diff&#233;rentes analyses discursives possibles, en s&#8217;appuyant sur les informations de
factivit&#233; comme nous l&#8217;avons fait ici pour les discours indirects.
</p>
<p>2) La r&#233;alisation d&#8217;un corpus annot&#233; discursivement pour le fran&#231;ais qui combine les avantages de RST, de SDRT
et du PDTB en suivant les conclusions de cet article. Pour cette t&#226;che, nous pouvons b&#233;n&#233;ficier du corpus French
TimeBank (Bittar, 2010) qui peut servir de premi&#232;re &#233;tape pour fournir un corpus French FactBank &#8212; le corpus
anglais FactBank a &#233;t&#233; r&#233;alis&#233; comme une seconde couche d&#8217;annotations sur TimeBank (Saur&#237; &amp; Pustejovsky,
2009). Les informations de factivit&#233; du French FactBank recevant ultimement une autre couche d&#8217;annotations
concernant la structure discursive. Cette t&#226;che est de longue haleine et ne saurait &#234;tre confi&#233;e &#224; des annotateurs
&#8220;naifs&#8221;, mais est-il besoin de rappeler que seuls des corpus annot&#233;s proprement permettront aux techniques d&#8217;ap-
prentissage (supervis&#233;es) de fournir des r&#233;sultats dignes d&#8217;int&#233;r&#234;t ?
</p>
<p>Remerciements
</p>
<p>Je remercie chaleureusement Owen Rambow avec qui j&#8217;ai eu des discussions tout &#224; fait &#233;clairantes sur diff&#233;rents
th&#232;mes abord&#233;s dans cet article, Sylvain Kahane et Philippe Muller pour leur relecture attentive, et les reviewers
anonymes de TALN.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ASHER N. (1993). Reference to Abstract Objects in Discourse. Dordrecht : Kluwer.
ASHER N. &amp; LASCARIDES A. (2003). Logics of Conversation. Cambridge : Cambridge University Press.
BITTAR A. (2010). Building a TimeBank for French : A Reference Corpus Annotated According to the ISO-
TimeML Standard. PhD thesis, Universit&#233; Paris Diderot (Paris 7).
BONAMI O. &amp; GODARD D. (2008). Lexical semantics and pragmatics of evaluative adverbs. In L. MCNALLY &amp;
C. KENNEDY, Eds., Adverbs and Adjectives : Syntax, Semantics, and Discourse, p. 274&#8211;304. Oxford University
Press.
BRAS M. (2008). Entre relations temporelles et relations de discours. Universit&#233; de Toulouse le Mirail : Dossier
d&#8217;HDR.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LAURENCE DANLOS
</p>
<p>CARLSON L., MARCU D. &amp; OKUROWSKI M. E. (2003). Building a discourse-tagged corpus in the framework
of Rhetorical Structure Theory. In J. VAN KUPPEVELT &amp; R. SMITH, Eds., Current Directions in Discourse and
Dialogue, p. 85&#8211;112. Kluwer Academic Publishers.
</p>
<p>DANLOS L. (2000). Event coreference in causal discourses. In P. BOUILLON &amp; F. BUSA, Eds., The Language
of Word Meaning, p. 216&#8211;241. Cambridge University Press.
</p>
<p>DANLOS L. (2006). Discourse verbs and discourse periphrastic links. In Proceedings of the second workshop
on Constraints in Discourse (CID), Maynooth, Ireland.
</p>
<p>DANLOS L. (2009). D-STAG : un formalisme d&#8217;analyse automatique de discours bas&#233; sur les TAG synchrones.
Revue TAL, 50(1), 111&#8211;143.
DANLOS L. (2011). Factivity information and veridicality of discourse relations. In Proceedings of the
Constraints in Discourse workshop CID 2011, Agay-Roches rouges, France.
</p>
<p>DANLOS L., SAGOT B. &amp; STERN R. (2010). Analyse discursive des incises de citations. In Actes du Second
Colloque Mondial de Linguistique Fran&#231;aise&quot;, New-Orleans, USA.
</p>
<p>DINESH N., LEE A., MILTSAKAKI E., PRASAD R., JOSHI A. &amp; WEBBER B. (2005). Attribution and the
(non)alignment of syntactic and discourse arguments of connectives. In Proceedings of the Workshop on Fron-
tiers in Corpus Annotations II : Pie in the Sky, p. 29&#8211;36, Ann Arbor, Michigan : Association for Computational
Linguistics.
</p>
<p>FORBES-RILEY K., WEBBER B. &amp; JOSHI A. (2006). Computing discourse semantics : The predicate-argument
semantics of discourse connectives in D-LTAG. Journal of Semantics, 23(1).
HAMBLIN C. L. (1970). Fallacies. London : Methuen.
</p>
<p>HUNTER J., ASHER N., REESE B. &amp; DENIS P. (2006). Evidentiality and intensionality : Two uses of reporta-
tive constructions in discourse. In Proceedings of the Constraints in Discourse Workshop (CID&#8217;06), Maynoth,
Ireland.
</p>
<p>MANN W. C. &amp; THOMPSON S. A. (1988). Rhetorical Structure Theory : Toward a functional theory of text
organization. Text, 8(3), 243&#8211;281.
PDTB GROUP (2008). The Penn Discourse Treebank 2.0 Annotation Manual. Rapport interne, Institute for
Research in Cognitive Science, University of Philadelphia.
</p>
<p>P&#201;RY WOODLEY M.-P., ASHER N., ENJALBERT P., BENAMARA F., BRAS M., FABRE C., FERRARI S.,
HO DAC L.-M., LE DRAOULEC A., MATHET Y., MULLER P., PR&#201;VOT L., REBEYROLLE J., TANGUY L.,
VERGEZ COURET M., VIEU L. &amp; WIDL&#214;CHER A. (2009). ANNODIS : une approche outill&#233;e de l&#8217;annotation
de structures discursives. In Proceedings of TALN 2009, p. 190&#8211;196, Senlis, France.
</p>
<p>PRABHAKARAN V., RAMBOW O. &amp; DIAB M. (2010). Automatic committed belief tagging. In Proceedings of
COLING 2010, P&#233;kin, Chine.
</p>
<p>PRASAD R., DINESH N., LEE A., JOSHI A. &amp; WEBBER B. (2006). Attribution and its annotation in the Penn
Discourse Treebank. Revue TAL, 47(2).
PUSTEJOVSKY J. (1995). The generative Lexicon. Cambridge : The MIT Press.
</p>
<p>REDEKER G. &amp; EGG M. (2006). Says who ? on the treatment of speech attributions in discourse structure. In
Proceedings of the Constraints in Discourse Workshop (CID&#8217;06), Maynoth, Ireland.
</p>
<p>SAUR&#205; R. (2008). A Factuality Profiler for Eventualities in Text. PhD thesis, Brandeis University.
</p>
<p>SAUR&#205; R. &amp; PUSTEJOVSKY J. (2009). FactBank : A corpus annotated with event factuality. Language Resources
and Evaluation, 43, 227&#8211;268.
TABOADA M. &amp; MANN W. (2006). Rhetorical Structure Theory : Looking back and moving ahead. Discourse
Studies, 8(3), 423&#8211;459.
WEBBER B. (2004). D-LTAG : extending lexicalized TAG to discourse. Cognitive Science, 28(5), 751&#8211;779.
WOLF F. &amp; GIBSON E. (2006). Coherence in Natural Language : Data Structures and Applications. London :
The MIT Press.</p>

</div></div>
</body></html>