<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Paraphrases et modifications locales dans l&#8217;historique des r&#233;visions deWikip&#233;dia</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211;1er juillet 2011
</p>
<p>Paraphrases et modifications locales
dans l&#8217;historique des r&#233;visions de Wikip&#233;dia
</p>
<p>Camille Dutrey1 Houda Bouamor2,3 Delphine Bernhard2 Aur&#233;lien Max2,3
</p>
<p>(1) INALCO, Paris, France
(2) LIMSI-CNRS, Orsay, France
</p>
<p>(3) Univ. Paris-Sud, Orsay, France
camille@dutrey.fr {pr&#233;nom.nom}@limsi.fr
</p>
<p>R&#233;sum&#233;. Dans cet article, nous analysons les modifications locales disponibles dans l&#8217;historique des r&#233;vi-
sions de la version fran&#231;aise de Wikip&#233;dia. Nous d&#233;finissons tout d&#8217;abord une typologie des modifications fond&#233;e
sur une &#233;tude d&#233;taill&#233;e d&#8217;un large corpus de modifications. Puis, nous d&#233;taillons l&#8217;annotation manuelle d&#8217;une par-
tie de ce corpus afin d&#8217;&#233;valuer le degr&#233; de complexit&#233; de la t&#226;che d&#8217;identification automatique de paraphrases
dans ce genre de corpus. Enfin, nous &#233;valuons un outil d&#8217;identification de paraphrases &#224; base de r&#232;gles sur un
sous-ensemble de notre corpus.
</p>
<p>Abstract. In this article, we analyse the modifications available in the French Wikip&#233;dia revision history.
We first define a typology of modifications based on a detailed study of a large corpus of modifications. Moreover,
we detail a manual annotation study of a subpart of the corpus aimed at assessing the difficulty of automatic
paraphrase identification in such a corpus. Finally, we assess a rule-based paraphrase identification tool on a
subset of our corpus.
</p>
<p>Mots-cl&#233;s : Wikip&#233;dia, r&#233;visions, identification de paraphrases.
</p>
<p>Keywords: Wikipedia, revisions, paraphrase identification.
</p>
<p>1 Introduction
</p>
<p>Wikip&#233;dia ne cesse de cro&#238;tre et est actuellement l&#8217;encyclop&#233;die libre la plus volumineuse et la plus fr&#233;quen-
t&#233;e au monde. Ses articles sont &#233;crits et maintenus de mani&#232;re collaborative et b&#233;n&#233;vole. Les &#233;normes quantit&#233;s
de donn&#233;es pr&#233;sentes dans cette encyclop&#233;die ont motiv&#233; de nombreux travaux sur l&#8217;acquisition automatique de
ressources comme par exemple l&#8217;acquisition des connaissances lexico-s&#233;mantiques (Zesch et al., 2008). Cepen-
dant, la majorit&#233; de ces &#233;tudes n&#8217;utilisent que la version la plus r&#233;cente des articles de l&#8217;encyclop&#233;die. Wikip&#233;dia
met &#233;galement &#224; disposition l&#8217;historique des r&#233;visions de chacun de ses articles qui sont it&#233;rativement modifi&#233;s
et affin&#233;s par de multiples utilisateurs du Web. Ces r&#233;visions rendent possible l&#8217;extraction de certains types de
modifications locales refl&#233;tant l&#8217;&#233;volution, la maturation et la correction de la forme linguistique des articles, et
constituent donc une importante source de connaissances encore peu exploit&#233;e &#224; ce jour.
</p>
<p>Dans cet article, nous d&#233;taillons une typologie des modifications locales pr&#233;sentes dans le corpus WICOPACO 1
</p>
<p>1. Librement t&#233;l&#233;chargeable sur http://wicopaco.limsi.fr</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAMILLE DUTREY, HOUDA BOUAMOR, DELPHINE BERNHARD ET AUR&#201;LIEN MAX
</p>
<p>de r&#233;visions extraites automatiquement de la version fran&#231;aise de Wikip&#233;dia. Notre &#233;tude met l&#8217;accent sur le
ph&#233;nom&#232;ne de paraphrases locales, qui sont de plus en plus utilis&#233;es pour am&#233;liorer les performances de plusieurs
applications de TAL comme les syst&#232;mes de traduction automatique (Max, 2010) ou de question-r&#233;ponse (Duclaye
et al., 2003), ainsi qu&#8217;en g&#233;n&#233;ration, pour aider des auteurs &#224; trouver des formulations plus adapt&#233;es (Max, 2008).
</p>
<p>Cet article est organis&#233; comme suit : dans la section 2, nous passons tout d&#8217;abord en revue les principaux travaux
portant sur l&#8217;utilisation de l&#8217;historique des r&#233;visions de Wikip&#233;dia, puis nous d&#233;crivons le corpus WiCoPaCo utilis&#233;
dans cette &#233;tude dans la section 3. Nous pr&#233;sentons la typologie des modifications locales que nous proposons
dans la section 4. Dans la section 5 nous exposons nos premi&#232;res exp&#233;riences sur l&#8217;identification automatique
de paraphrases dans ce corpus, et enfin nous pr&#233;sentons nos observations et d&#233;crivons nos travaux futurs dans la
section 6.
</p>
<p>2 Exploitation des r&#233;visions de Wikip&#233;dia : &#233;tat de l&#8217;art
</p>
<p>Les r&#233;visions de Wikip&#233;dia ont d&#233;j&#224; &#233;t&#233; exploit&#233;es pour diff&#233;rentes t&#226;ches et applications. Nelken &amp; Yamangil
(2008) exploitent l&#8217;historique des r&#233;visions de Wikip&#233;dia pour acqu&#233;rir une grande quantit&#233; de donn&#233;es d&#8217;appren-
tissage en comparant les versions adjacentes d&#8217;un m&#234;me article pour trois t&#226;ches &#224; diff&#233;rents niveaux de granularit&#233;
linguistique : collecte des fautes d&#8217;orthographe et de leur correction (niveau du mot), donn&#233;es d&#8217;apprentissage pour
les algorithmes de compression de phrases (niveau phrase) et d&#8217;amor&#231;age pour les syst&#232;mes de r&#233;sum&#233; automa-
tique (niveau document). Yatskar et al. (2010) utilisent l&#8217;historique des modifications dans la version anglaise
simplifi&#233;e de Wikip&#233;dia pour en extraire des simplifications lexicales.
</p>
<p>Max &amp; Wisniewski (2010) d&#233;crivent WICOPACO (Wikip&#233;dia Correction and Paraphrase Corpus), une ressource
construite en explorant automatiquement l&#8217;historique des r&#233;visions de Wikip&#233;dia et en extrayant les modifications
locales effectu&#233;es par les contributeurs. Ce corpus comprend diff&#233;rents types de corrections et de r&#233;&#233;critures. Le
travail de Wisniewski et al. (2010) montre par exemple comment cette ressource peut &#234;tre utilis&#233;e pour am&#233;liorer la
performance d&#8217;un syst&#232;me de correction orthographique automatique. Zanzotto &amp; Pennacchiotti (2010) exploitent
quant &#224; eux l&#8217;historique des r&#233;visions de Wikip&#233;dia pour extraire un grand nombre de paires d&#8217;unit&#233;s textuelles
en relation d&#8217;implication et appliquent des m&#233;thodes d&#8217;apprentissage semi-supervis&#233; pour rendre l&#8217;ensemble des
donn&#233;es extraites coh&#233;rentes par rapport aux donn&#233;es existantes.
</p>
<p>Dans la mesure o&#249; l&#8217;utilisation et la popularit&#233; des wikis ainsi que d&#8217;autres syst&#232;mes collaboratifs s&#8217;accro&#238;t, les
questions concernant la fiabilit&#233; de ces informations gagnent en importance. Hu et al. (2007) ont par exemple
d&#233;velopp&#233; un mod&#232;le de confiance bas&#233; sur l&#8217;historique des &#233;ditions des articles de Wikip&#233;dia afin de calculer et
contr&#244;ler leur fiabilit&#233;. D&#8217;autres travaux ont propos&#233; des visualisations originales des r&#233;visions de Wikip&#233;dia, tels
que History Flow (Vi&#233;gas et al., 2004) ou WikiDashboard (Suh et al., 2008). WikipediaViz (F. Chevalier, S. Huot
et J-D. Fekete, 2010) propose un ensemble de visualisations bas&#233; sur un m&#233;canisme de collecte et d&#8217;aggr&#233;gation
de donn&#233;es d&#8217;&#233;ditions de Wikip&#233;dia pour aider le lecteur &#224; appr&#233;hender la maturit&#233; d&#8217;un article.
</p>
<p>Comme nous l&#8217;avons montr&#233;, la plupart des travaux de recherche ant&#233;rieurs sur l&#8217;historique des r&#233;visions de
Wikip&#233;dia se concentrent sur des aspects sp&#233;cifiques de la ressource et se fixent pour objectif des applications
bien d&#233;finies telles que la simplification de texte, la compression de phrases ou encore la visualisation des infor-
mations. &#192; notre connaissance, il n&#8217;y a pas de vision globale des ph&#233;nom&#232;nes de modifications locales disponibles
dans les r&#233;visions de Wikipedia, bien qu&#8217;il existe une grande vari&#233;t&#233; de types de modifications qui sont d&#8217;int&#233;r&#234;t
pour de nombreuses applications de traitement automatique des langues, et en particulier les paraphrases locales.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PARAPHRASES ET MODIFICATIONS LOCALES DANS L&#8217;HISTORIQUE DES R&#201;VISIONS DE WIKIP&#201;DIA
</p>
<p>3 WICOPACO, un corpus de modifications locales de Wikip&#233;dia
</p>
<p>L&#8217;acquisition de paires de segments textuels ayant le m&#234;me sens (paraphrases locales) a &#233;t&#233; &#224; l&#8217;origine d&#8217;un
nombre important de travaux sur l&#8217;exploitation automatique de corpus de textes (voir par exemple (Madnani
&amp; Dorr, 2010)). Les corpus utilis&#233;s peuvent &#234;tre organis&#233;s par le degr&#233; de correspondance entre deux unit&#233;s de
texte : des paires de paraphrases phrastiques, obtenues par exemple par traduction multiple (corpus parall&#232;les
monolingues) ; les paires de phrases ayant le m&#234;me sens, obtenues &#224; partir de corpus compos&#233;s de textes dans la
m&#234;me langue partageant une partie du vocabulaire employ&#233;, ce qui implique g&#233;n&#233;ralement que les textes parlent
d&#8217;un m&#234;me sujet durant la m&#234;me p&#233;riode (corpus monolingues comparables) ; les paires de phrases partageant
des traductions dans d&#8217;autres langues (corpus parall&#232;les multilingues). Les corpus monolingues parall&#232;lles sont
les corpus les plus appropri&#233;s pour observer et acqu&#233;rir automatiquement des segments de texte en relation de
paraphrase locale de haute qualit&#233; (Bouamor et al., 2010). Or ce type de corpus existe en tr&#232;s faible quantit&#233;, et
leur construction est une t&#226;che compliqu&#233;e et co&#251;teuse. A contrario, un des principaux d&#233;fauts des autres types de
corpus est que les paraphrases potentielles n&#8217;y sont observ&#233;es qu&#8217;indirectement, par exemple par l&#8217;interm&#233;diaire
d&#8217;une traduction commune ou d&#8217;un contexte jug&#233; similaire.
</p>
<p>Une autre source potentielle de paraphrases locales r&#233;side dans les nombreuses modifications que les r&#233;dacteurs
font lors de la r&#233;vision d&#8217;un texte, certaines d&#8217;entre elles &#233;tant destin&#233;es &#224; ne pas modifier le sens du texte, mais &#224;
am&#233;liorer sa qualit&#233;, le rendre plus coh&#233;rent, ou limiter sa redondance. Des brouillons d&#8217;&#233;crivains ont &#233;t&#233; notam-
ment utilis&#233;s dans les critiques g&#233;n&#233;tiques textuelles qui &#233;tudient les processus de cr&#233;ation de textes (Bourdaillet
&amp; Ganascia, 2007). Ces documents annot&#233;s sont malheureusement disponibles en petites quantit&#233;s et sont de
plus difficiles &#224; encoder en format &#233;lectronique. En outre, ces projets contiennent souvent des r&#233;organisations
textuelles importantes qui sont tr&#232;s difficiles &#224; exploiter pour l&#8217;acquisition de paraphrases. L&#8217;&#233;mergence et l&#8217;adop-
tion des wikis a fait de l&#8217;&#233;criture collaborative une pratique tr&#232;s courante. L&#8217;encyclop&#233;die en ligne Wikip&#233;dia, en
particulier, attire de nombreuses contributions sur un large &#233;ventail de sujets et dans de nombreuses langues. Bien
que certaines contributions consistent en des changements importants (par exemple la cr&#233;ation d&#8217;un article, la
suppression d&#8217;une section, la r&#233;&#233;criture compl&#232;te d&#8217;un paragraphe), une proportion importante des modifications
textuelles sont effectu&#233;es sur des textes courts pour corriger, am&#233;liorer ou enrichir le contenu de l&#8217;encyclop&#233;die.
L&#8217;historique des r&#233;visions de cette ressources constitue donc une source importante de ph&#233;nom&#232;nes de r&#233;&#233;criture
naturelle, y compris des paraphrases locales dans leur contexte.
</p>
<p>WICOPACO (Max &amp; Wisniewski, 2010) est un corpus de modifications locales, extrait &#224; partir de l&#8217;historique des
r&#233;visions des articles de Wikip&#233;dia, et disponible pour le moment pour le fran&#231;ais. Ce corpus a &#233;t&#233; construit en 4
&#233;tapes :
</p>
<p>1. S&#233;lection de paires de versions d&#8217;articles.
2. Normalisation du texte (segmentation, suppression du &#171; wikitexte &#187;, etc.).
3. Alignement des modifications par une recherche de plus longues sous-s&#233;quences communes.
4. Filtrage des modifications retenues (s&#233;quences initiales de 7 mots ou plus) et extraction du contexte avant
</p>
<p>et apr&#232;s modification (paragraphe englobant).
</p>
<p>Le corpus que nous avons utilis&#233; contient 408 816 entr&#233;es uniques. Celui-ci est disponible sous forme d&#8217;un fichier
au format XML associant un &#233;l&#233;ment &#224; chaque modification. Une modification y est d&#233;crite par un contexte avant
modification et un contexte apr&#232;s modification, ainsi que par un ensemble de m&#233;tadonn&#233;es donnant des infor-
mations sur le contributeur de la r&#233;vision et permettant de localiser le texte extrait dans la ressource Wikip&#233;dia
d&#8217;origine. Un exemple d&#8217;un tel &#233;l&#233;ment, correspondant &#224; une simplification lexicale, est donn&#233; &#224; la figure 1.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAMILLE DUTREY, HOUDA BOUAMOR, DELPHINE BERNHARD ET AUR&#201;LIEN MAX
</p>
<p>&lt;modif id=&quot;407851&quot; wp_page_id=&quot;1830844&quot; wp_before_rev_id=&quot;20691183&quot; wp_after_rev_id=&quot;20691225&quot; 
wp_user_id=&quot;287861&quot; wp_user_num_modif=&quot;81&quot; wp_comment=&quot;&quot;&gt;
&lt;before&gt;Le genre Archaeopteris poss&#232;de plus de caract&#233;ristiques communes avec les plantes &#224; graines que toute autre 
&lt;m num_words=&quot;1&quot;&gt;pt&#233;ridophyte&lt;/m&gt; connue et les analyses cladistiques r&#233;centes le placent en groupe-fr&#232;re des 
plantes &#224; graines .&lt;/before&gt;
&lt;after&gt;Le genre Archaeopteris poss&#232;de plus de caract&#233;ristiques communes avec les plantes &#224; graines que toute autre 
&lt;m num_words=&quot;2&quot;&gt;plante fossile&lt;/m&gt; connue et les analyses cladistiques r&#233;centes le placent en groupe-fr&#232;re des 
plantes &#224; graines .&lt;/after&gt;
&lt;/modif&gt;
</p>
<p>FIGURE 1 &#8211; Exemple d&#8217;une modification dans le corpus WICOPACO.
</p>
<p>4 Typologie des modifications locales
</p>
<p>Nous avons analys&#233; le corpus WICOPACO afin de d&#233;velopper une typologie d&#233;taill&#233;e des modifications locales 2
</p>
<p>dans les r&#233;visions de Wikip&#233;dia. Cette typologie permet de repr&#233;senter tous les ph&#233;nom&#232;nes observables dans
WICOPACO et d&#8217;indiquer le degr&#233; de variation s&#233;mantique entre les segments correspondant &#224; des paires de mod-
ifications locales. Elle se compose de deux cat&#233;gories distinguant deux grandes classes de variation s&#233;mantique :
la classe des faibles variations s&#233;mantiques et la classe des corrections factuelles et vandalismes. Ces deux classes
peuvent contenir des modifications locales pour lesquelles il n&#8217;existe pas de relation s&#233;mantique stricte entre le
segment avant la modification et le segment apr&#232;s modification, ce qui est par exemple le cas pour les modifica-
tions typographiques 3.
</p>
<p>4.1 Modifications &#224; faible variation s&#233;mantique
</p>
<p>La classe des modifications &#224; faible variation s&#233;mantique comporte les corrections et les reformulations (voir
Table 1).
</p>
<p>Les corrections de surface font r&#233;f&#233;rence aux changements de surface qui visent &#224; am&#233;liorer le texte afin qu&#8217;il
soit conforme aux normes linguistiques, et se d&#233;composent de la mani&#232;re suivante :
</p>
<p>&#8211; Corrections typographiques : changement de la disposition et du format du texte, par exemple, ajout ou sup-
pression d&#8217;espaces ou de signes de ponctuation, changement de casse d&#8217;un caract&#232;re, modification du format
d&#8217;une date ou d&#8217;une heure, &#233;criture d&#8217;un nombre en toutes lettres ou en chiffres, etc.
</p>
<p>&#8211; Corrections orthographiques : corrections affectant les fautes d&#8217;orthographe. Elles se r&#233;f&#232;rent &#224; la transfor-
mation d&#8217;un mot inexistant en un mot attest&#233; dans le lexique, comme la modification de diacritiques ou le
remplacement d&#8217;un ou plusieurs caract&#232;res.
</p>
<p>&#8211; Corrections grammaticales : r&#233;solution des fautes d&#8217;orthographe qui ne peuvent &#234;tre d&#233;tect&#233;es et corrig&#233;es que
par la prise en compte du contexte.
</p>
<p>2. Ici nous h&#233;ritons de la d&#233;finition suivie dans la ressource utilis&#233;e pour la localit&#233; des modifications observ&#233;es : il s&#8217;agit de segments d&#8217;au
plus 7 mots (ponctuations et autres signes non inclus).
</p>
<p>3. La typologie compl&#232;te est disponible sous forme de document technique du LIMSI (Dutrey et al., 2011) et est accessible &#224; l&#8217;adresse
suivante : http://wicopaco.limsi.fr/pub/typologie-modifications-wikipedia.pdf</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PARAPHRASES ET MODIFICATIONS LOCALES DANS L&#8217;HISTORIQUE DES R&#201;VISIONS DE WIKIP&#201;DIA
</p>
<p>CORRECTIONS DE SURFACE
Corrections typographiques
&#8658; ex. une espace remplac&#233;e par un trait d&#8217;union pour corriger une erreur typographique :
Le triceps brachial est un muscle extenseur de l&#8217; [avant bras&#8594; avant-bras] sur le bras.
Corrections orthographiques
&#8658; ex. un caract&#232;re alphab&#233;tique supprim&#233; pour transformer un non-mot en un mot attest&#233; dans le lexique :
Ces trois parties se [rejoingnent&#8594; rejoignent] pour former une &#233;paisse masse.
&#8658; ex. un diacritique remplac&#233; par un autre pour transformer un non-mot en un mot attest&#233; dans le lexique :
L&#8217; [&#235;glise&#8594; &#233;glise] gothique Sainte-Marie. . .
Corrections grammaticales
&#8658; ex. un diacritique remplac&#233; par un autre pour corriger une erreur portant sur un mot attest&#233; dans le lexique :
L&#8217;anath&#232;me pour le [p&#234;cheur&#8594; p&#233;cheur] : ce dernier est priv&#233; de s&#233;pulture chr&#233;tienne.
&#8658; ex. un mot remplac&#233; par un autre pour corriger une erreur portant sur un mot attest&#233; dans le lexique :
Il chante avec une [voie&#8594; voix] de troubadour.
</p>
<p>REFORMULATIONS
Reformulations lexicales
&#8658; ex. un emprunt remplac&#233; par la forme correspondante en fran&#231;ais standard :
[L&#8217;impl&#233;mentation&#8594; La mise en &#339;uvre] de l&#8217;algorithme. . .
Reformulations syntaxiques
&#8658; ex. une permutation entre deux segments sur l&#8217;axe syntagmatique :
Source : [l&#8217;Invention de l&#8217;Europe d&#8217;Emmanuel Todd&#8594; Emmanuel Todd, L&#8217;Invention de l&#8217;Europe].
&#8658; ex. une proposition circonstancielle transform&#233;e en une proposition relative :
Un infomercial pseudo-scientifique [en exposant&#8594; qui expose] grossi&#232;rement. . .
Reformulations s&#233;mantiques
&#8658; ex. un mot remplac&#233; par un autre appartenant au m&#234;me champ lexical (hyponymie) :
Il fonde le [journal&#8594; quotidien] francophone &#171; Le Tunisien &#187;en 1907.
&#8658; ex. une paraphrase servant diff&#233;rents propos (infra pr&#233;cision de sens) :
Ce vers de Nuit rh&#233;nane d&#8217;Apollinaire [qui para&#238;t presque sans structure rythmique&#8594; dont la c&#233;sure est comme
masqu&#233;e]. . .
</p>
<p>TABLE 1 &#8211; Types de modifications &#224; faible variation s&#233;mantique
</p>
<p>Les reformulations correspondent &#224; des changements plus importants qui modifient les choix lexicaux et syn-
taxiques faits par le contributeur pr&#233;c&#233;dent sans modifier profond&#233;ment la signification du texte :
&#8211; Reformulations lexicales consistant, par exemple, &#224; remplacer un acronyme avec son nom complet, traduire un
</p>
<p>mot &#233;tranger ou un emprunt, remplacer une variante r&#233;gionale par sa version standard, etc.
&#8211; Reformulations syntaxiques permettant, par exemple, de modifier l&#8217;ordre des propositions, de transformer une
</p>
<p>phrase &#224; la voix active ou passive ou de changer le type de proposition.
&#8211; Reformulations s&#233;mantiques comme l&#8217;utilisation d&#8217;hyperonymes ou d&#8217;hyponymes, la normalisation encyclop&#233;dique, l&#8217;u-
</p>
<p>tilisation de synonymes ou l&#8217;ajout d&#8217;informations additionnelles peu significatives.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAMILLE DUTREY, HOUDA BOUAMOR, DELPHINE BERNHARD ET AUR&#201;LIEN MAX
</p>
<p>4.2 Corrections factuelles et vandalismes
</p>
<p>CORRECTIONS FACTUELLES
&#8658; ex. un mot remplac&#233; par son antonyme :
Un catalyseur solide (phase [liquide&#8594; solide]) avec de l&#8217;hydrog&#232;ne (phase gazeuse).
&#8658; ex. un segment remplac&#233; par un autre n&#8217;ayant aucun lien s&#233;mantique avec le premier :
repr&#233;sente pour eux [l&#8217;Occident chr&#233;tien&#8594; la sup&#233;riorit&#233; de la race celto-germanique].
</p>
<p>VANDALISMES
&#8658; ex. une cha&#238;ne ins&#233;r&#233;e produisant un non-mot (vandalisme manifeste) :
L&#8217;Autriche a &#233;t&#233; occup&#233;e [par&#8594; psh ! ! ar] les Romains.
&#8658; ex. un mot remplac&#233; par un autre qui ne produit aucun sens compte tenu du contexte (vandalisme subtil) :
Devant la Cour de [Cassation&#8594; Castration]. . .
</p>
<p>TABLE 2 &#8211; Corrections factuelles et vandalismes
</p>
<p>Cette classe se d&#233;compose en deux sous-types (voir la Table 2), les corrections factuelles et les vandalismes, pour
lesquels le sens du texte est fortement affect&#233; et peut &#234;tre totalement chang&#233;.
</p>
<p>Les corrections factuelles correspondent soit &#224; une modification qui induit une forte variation de sens, soit &#224; une
modification ne pr&#233;sentant aucun lien s&#233;mantique avec le texte initial. Elles consistent, par exemple, &#224; remplacer
un mot par un antonyme ou &#224; changer le temps d&#8217;un verbe de sorte &#224; ce que le sens de la phrase soit modifi&#233;. Ce
genre de modifications vise &#224; am&#233;liorer le contenu de Wikip&#233;dia.
</p>
<p>Le vandalisme fait r&#233;f&#233;rence aux modifications qui, d&#233;lib&#233;r&#233;ment, modifient ou d&#233;truisent le contenu afin de
nuire &#224; la qualit&#233; de Wikip&#233;dia. Le vandalisme manifeste se caract&#233;rise par l&#8217;insertion de non-mots ou d&#8217;insultes
tandis que le vandalisme subtil se caract&#233;rise par des reformulations grammaticales mais dont l&#8217;interpr&#233;tation est
en compl&#232;te contradiction avec le sens initial. Il est particuli&#232;rement important de d&#233;tecter ce dernier type, puisque
dans certains cas un lecteur peu attentif ou cr&#233;dule pourra consid&#233;rer &#224; tort l&#8217;information d&#233;crite comme fiable.
</p>
<p>4.3 Annotation manuelle
</p>
<p>Nous avons con&#231;u un sch&#233;ma d&#8217;annotation bas&#233; sur la typologie d&#233;crite pr&#233;c&#233;demment. L&#8217;objectif de cette anno-
tation est d&#8217;&#233;valuer le degr&#233; de complexit&#233; de l&#8217;identification manuelle des paraphrases dans les modifications lo-
cales. L&#8217;annotation est guid&#233;e par notre application cible qui est l&#8217;identification automatique des paraphrases dans
WICOPACO. Dans notre typologie, les paraphrases correspondent aux reformulations pr&#233;sentes dans la classe des
r&#233;&#233;critures &#224; faible variation s&#233;mantique. Elles doivent &#234;tre distingu&#233;es des corrections de surface et des reformu-
lations qui induisent un changement s&#233;mantique majeur. Cette annotation a donc deux buts principaux : rep&#233;rer
des ph&#233;nom&#232;nes li&#233;s &#224; une r&#233;&#233;criture &#224; faible variation s&#233;mantique et rep&#233;rer les vandalismes, notamment dans
une optique ult&#233;rieure d&#8217;apprentissage supervis&#233;.
</p>
<p>Afin de faciliter cette t&#226;che, nous avons &#233;labor&#233; un sch&#233;ma d&#8217;annotation compos&#233; de quatre classes principales :
&#8211; Les corrections de surface, qui englobent toutes les modifications visant &#224; rendre le texte conforme aux normes
</p>
<p>de la langue.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PARAPHRASES ET MODIFICATIONS LOCALES DANS L&#8217;HISTORIQUE DES R&#201;VISIONS DE WIKIP&#201;DIA
</p>
<p>&#8211; Les reformulations, qui correspondent aux diff&#233;rents types de paraphrases, y compris les pr&#233;cisions et les sim-
plifications.
</p>
<p>&#8211; Les corrections factuelles et les vandalismes
&#8211; Les d&#233;fauts d&#8217;alignement qui correspondent aux cas o&#249; les modifications locales identifi&#233;es pr&#233;sentent un d&#233;faut
</p>
<p>dans leur alignement (voir Figure 2). Cependant, m&#234;me avec un d&#233;faut d&#8217;alignement un segment peut contenir
une modification locale.
</p>
<p>Henri IV fut assassin&#233; par Ravaillac en 1610.
A partir de la conversion d&#8217; Henri IV la fid&#233;lit&#233; au roi l&#8217; a emport&#233; sur l&#8217; appartenance religieuse.
</p>
<p>FIGURE 2 &#8211; Exemple d&#8217;un d&#233;faut d&#8217;alignement dans le corpus WICOPACO.
</p>
<p>Une annotation couvre l&#8217;ensemble du segment identifi&#233; comme une modification locale (not&#233;e par une balise
XML m dans le corpus WICOPACO, comme illustr&#233; dans la Figure 1) : l&#8217;objectif est de d&#233;terminer le type de la
modification de partir d&#8217;une paire de segments, mais pas de r&#233;aligner les mots dans ces segments. En outre, il &#233;tait
possible d&#8217;attribuer plusieurs &#233;tiquettes &#224; la m&#234;me modification.
</p>
<p>Pour r&#233;aliser cette annotation, nous avons utilis&#233; l&#8217;outil d&#8217;alignement Yawat (Germann, 2008) con&#231;u &#224; l&#8217;origine
pour l&#8217;alignement de textes parall&#232;les bilingues au niveau du mot. Nous avons adapt&#233; le sch&#233;ma d&#8217;annotation de
cet outil pour notre annotation multi-niveaux. L&#8217;annotation a &#233;t&#233; r&#233;alis&#233;e par quatre annotateurs 4 sur 200 paires
de segments tir&#233;es d&#8217;une version filtr&#233;e du corpus WICOPACO. Comme les modifications de ponctuation sont
fr&#233;quentes, seules les modifications d&#8217;une distance d&#8217;&#233;dition (Levenshtein) d&#8217;au moins 4 ont &#233;t&#233; consid&#233;r&#233;es pour
l&#8217;annotation.
</p>
<p>4.4 R&#233;sultats de l&#8217;annotation
</p>
<p>La Table 3 d&#233;crit l&#8217;accord inter-annotateur de notre annotation, calcul&#233; &#224; l&#8217;aide de la mesure du Kappa (&#954;) 5.
L&#8217;accord inter-annotateur varie de mod&#233;r&#233; &#224; fort, en fonction de la classe. Globalement, les valeurs du &#954; sont
proches des valeurs d&#233;clar&#233;es par Dolan &amp; Brockett (2005) pour l&#8217;identification de paraphrases (&#954; de 0,62) et par
Glickman et al. (2005) (&#954; de 0,6) pour l&#8217;implication textuelle.
</p>
<p>Type &#954; moy Interpr&#233;tation &#954; maximum &#954; minimum
Corrections factuelles et vandalismes 0,65 Accord fort 0,71 0,61
</p>
<p>Reformulation 0,60 Accord mod&#233;r&#233; 0,71 0,51
Correction 0,54 Accord mod&#233;r&#233; 0,81 0,40
</p>
<p>D&#233;faut d&#8217;alignement 0,48 Accord mod&#233;r&#233; 0,62 0,28
</p>
<p>TABLE 3 &#8211; Accord inter-annotateur pour l&#8217;annotation des r&#233;visions de Wikip&#233;dia.
</p>
<p>Nous indiquons &#233;galement le nombre d&#8217;annotations identiques attribu&#233;es par 1 &#224; 4 annotateurs (voir la Table 4)
ainsi que les annotations uniques, attribu&#233;es par un seul annotateur. Cela permet de quantifier approximativement
les ph&#233;nom&#232;nes pr&#233;sents dans le corpus. Les paraphrases ont le plus grand nombre d&#8217;occurrences, suivies par
les corrections factuelles et vandalismes. Ceci montre que les r&#233;visions de Wikip&#233;dia constituent un corpus bien
</p>
<p>4. Co-auteurs du pr&#233;sent article.
5. Nous avons utilis&#233; le calculateur &#954; en ligne pour annotateurs et classes multiples diponible sur http://cosmion.net/jeroen/
</p>
<p>software/kappa/.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAMILLE DUTREY, HOUDA BOUAMOR, DELPHINE BERNHARD ET AUR&#201;LIEN MAX
</p>
<p>adapt&#233; pour l&#8217;acquisition automatique de paraphrases 6. En outre, les d&#233;fauts d&#8217;alignement sont assez rares, ce qui
montre que la m&#233;thode d&#8217;alignement utilis&#233;e pour la construction de WICOPACO est suffisamment pr&#233;cise pour
fournir des modifications utiles.
</p>
<p>4 ann. 3 ann. 2 ann. unique ann. Total
Correction de surface 9 2 7 23 41
Reformulation 60 33 24 15 132
Corrections factuelles et vandalismes 47 15 13 32 107
D&#233;faut d&#8217;alignement 2 4 8 6 20
</p>
<p>TABLE 4 &#8211; Nombre d&#8217;annotations identiques attribu&#233;s par 1, 2, 3 ou 4 annotateurs.
</p>
<p>L&#8217;&#233;tude des annotations a soulign&#233; certains probl&#232;mes potentiels pour l&#8217;identification automatique des classes
d&#233;crites dans notre typologie. Tout d&#8217;abord, plusieurs ph&#233;nom&#232;nes peuvent se produire simultan&#233;ment, par exem-
ple une transformation de diath&#232;se (voix grammaticale) peut inclure une correction d&#8217;un non-mot (erreur). Dans ce
cas, un classifieur automatique devrait &#234;tre en mesure d&#8217;assigner plusieurs classes &#224; une modification. Deuxi&#232;me-
ment le contexte phrastique fourni par le corpus WICOPACO n&#8217;est parfois pas suffisant pour prendre une d&#233;cision
sur un type de modification sp&#233;cifique. Un contexte plus large pourrait &#234;tre utile aux classifieurs automatiques.
Troisi&#232;mement, le typage correct d&#8217;une modification n&#233;cessite parfois une certaine connaissance des intentions
du contributeur. Ce type d&#8217;information est parfois disponible dans les commentaires associ&#233;s &#224; une r&#233;vision, mais
peut &#234;tre difficile &#224; interpr&#233;ter de fa&#231;on automatique.
</p>
<p>5 Identification de paraphrases : une m&#233;thode &#224; base de r&#232;gles
</p>
<p>Nous avons mis en &#339;uvre une m&#233;thode automatique destin&#233;e &#224; distinguer les paraphrases des autres modifications
dans WICOPACO, en adaptant l&#8217;outil de reconnaissance de variantes de termes Fastr (Christian Jacquemin,
1994). L&#8217;op&#233;ration d&#8217;indexation contr&#244;l&#233;e de ce syst&#232;me d&#233;finit les variations acceptables par un syst&#232;me de
m&#233;tar&#232;gles s&#8217;appliquant &#224; des r&#232;gles de termes. Elles permettent d&#8217;exprimer les r&#233;&#233;critures morphosyntaxiques
possibles, ainsi que les relations d&#8217;ordre morphologique ou s&#233;mantique contenues dans des ressources pr&#233;exis-
tantes.
</p>
<p>Nous avons d&#251; cr&#233;er un nouvel ensemble de m&#233;tar&#232;gles pour la reconnaissance de paraphrases car le jeu de
m&#233;tar&#232;gles original s&#8217;est r&#233;v&#233;l&#233; innapropri&#233; pour notre &#233;tude, cet ensemble ayant &#233;t&#233; d&#233;velopp&#233; avec l&#8217;objectif de
reconnaissance de variantes de termes qui recouvrent une d&#233;finition beaucoup plus permissive de la paraphrase.
Nous avons cependant pu r&#233;utiliser les familles morphologiques et les familles s&#233;mantiques fournies par Fastr,
pour exprimer des contraintes s&#233;mantiques et morphologiques. L&#8217;utilisation de Fastr nous permet d&#8217;&#233;valuer si un
syst&#232;me &#224; base de r&#232;gles est adapt&#233; pour l&#8217;identification des paraphrases dans un corpus tel que le n&#244;tre, pr&#233;sentant
une riche vari&#233;t&#233; de ph&#233;nom&#232;nes.
</p>
<p>Nous avons utilis&#233; un autre type de corpus pour le d&#233;veloppement des nouvelles m&#233;tar&#232;gles, afin de v&#233;rifier
si les r&#232;gles sont suffisamment g&#233;n&#233;rales pour &#234;tre appliqu&#233;es sur un corpus de type diff&#233;rent. Ce corpus est
extrait de MULTITRAD (Bouamor, 2010), un corpus construit par collecte de paraphrases d&#8217;&#233;nonc&#233;s par traduction
multiple multilingue, et annot&#233; au niveau des mots. Ce corpus de d&#233;veloppement a permis l&#8217;extraction de patrons
</p>
<p>6. Cet article ne pr&#233;sente pas d&#8217;usage concret de paraphrases extraites de la ressource utilis&#233;e, mais il est &#233;vident que diff&#233;rentes paraphrases
ne seront pas n&#233;cessairement adapt&#233;es pour les m&#234;mes usages.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PARAPHRASES ET MODIFICATIONS LOCALES DANS L&#8217;HISTORIQUE DES R&#201;VISIONS DE WIKIP&#201;DIA
</p>
<p>de reformulations exprim&#233;s sous forme de s&#233;quences de cat&#233;gories morphosyntaxiques. La Table 5 montre par
exemple les principaux patrons de reformulations observ&#233;s pour le patron initial NOM VER VER.
</p>
<p>R&#233;&#233;criture Fr&#233;quence Exemple
NOM VER VER 7 orateurs ont estim&#233; &#8594; locuteurs ont jug&#233;
</p>
<p>NOM VER VER PRP NOM CONJ 2 Parlement a demand&#233; &#8594; Parlement a fait des demandes pour
NOM VER PRP DET NOM 1 lois sont &#233;crites&#8594; lois restent dans les livres
</p>
<p>TABLE 5 &#8211; Principaux patrons de r&#233;&#233;criture associ&#233;s &#224; la s&#233;quence NOM VER VER dans MULTITRAD
</p>
<p>La Table 6 illustre un exemple de nouvelle m&#233;tar&#232;gle pour FASTR. Cette m&#233;tar&#232;gle a pour nom NAtoVASyn car
elle porte sur un segment source dont la structure est un Nom suivi d&#8217;un Adjectif r&#233;&#233;crit (to) en un segment dont
la structure est au minimum un Verbe suivi d&#8217;un Nom suivi d&#8217;Adjectif. La m&#233;tar&#232;gle int&#232;gre &#233;galement certaines
contraintes morphologiques et s&#233;mantiques qui pr&#233;cisent que (i) le nom du segment source et le verbe du segment
cible ont une racine morphologique commune et (ii) les adjectifs des segments source et cible sont synonymes.
Il est &#224; noter que l&#8217;utilisation d&#8217;un moteur de d&#233;tection de variante est comparable aux travaux de Del&#233;ger &amp;
Zweigenbaum (2009) sur l&#8217;extraction de paraphrases de vulgarisation en langue de sp&#233;cialit&#233;.
</p>
<p>Metarule NAtoVAsyn( X1 &#8594; N1 A1) = X1 &#8594; V1 {ART ? | PRON ? | PREP ?} N A2 :
&lt;N1 root&gt; = &lt;V1 root&gt;
&lt;A1 syn&gt; = &lt;A2 syn&gt;
</p>
<p>&lt;X1 metaLabel&gt; = &#8217;XX&#8217;.
protection constante &#8594; prot&#233;ger de fa&#231;on permanente
</p>
<p>TABLE 6 &#8211; Exemple d&#8217;une m&#233;tar&#232;gle de Fastr
</p>
<p>Un ensemble de 83 m&#233;tar&#232;gles a &#233;t&#233; d&#233;velopp&#233; pour la reconnaissance de paraphrases. Nous avons d&#8217;abord &#233;valu&#233;
la couverture des r&#232;gles construites manuellement &#224; l&#8217;aide de 206 paires de paraphrases d&#8217;&#233;nonc&#233;s issues du corpus
MULTITRAD n&#8217;ayant pas &#233;t&#233; utilis&#233;s pour le d&#233;veloppement des m&#233;tar&#232;gles. Fastr a &#233;t&#233; en mesure d&#8217;identifier
185 paraphrases candidates, dont certaines sont illustr&#233;es dans la table 7.
</p>
<p>MultiTrad WiCoPaCo
d&#233;crit dans la proposition &#8596; propos&#233; d&#233;c&#233;da &#8596; mourut
</p>
<p>objectif ultime &#8596; but ultime abritant &#8596; qui abrite
reste &#8596; demeure standardisation &#8596; normalisation
</p>
<p>TABLE 7 &#8211; Exemples de paires de paraphrases locales identifi&#233;es par Fastr avec le jeu de m&#233;tar&#232;gles d&#233;velopp&#233;.
</p>
<p>Afin d&#8217;&#233;valuer les r&#232;gles sur les r&#233;visions de Wikip&#233;dia, nous avons construit manuellement un corpus de 200 para-
phrases positives (paires de modifications en relation de paraphrases) et 200 n&#233;gatives (paires de modifications sans
lien de paraphrase) &#224; partir du corpus WICOPACO. Fastr a identifi&#233; 31 paires de paraphrases candidates dans le
corpus positif. Parmi elles 22 (70%) sont correctes (la modification est identifi&#233;e enti&#232;rement comme paraphrase),
7 (22,5%) correspondent &#224; une sous-partie de la modification et 2 (6%) n&#8217;existent pas dans la r&#233;f&#233;rence (c&#8217;est-&#224;-
dire qu&#8217;elles couvrent une autre partie du contexte). Dans le corpus n&#233;gatif, seulement 4 paraphrases candidates
ont &#233;t&#233; trouv&#233;es, parmi lesquelles une seulement se trouve dans le corpus de r&#233;f&#233;rence.
</p>
<p>Ces r&#233;sultats pr&#233;liminaires montrent que les patrons de r&#233;&#233;criture morphosyntaxiques peuvent atteindre une bonne
pr&#233;cision pour identifier des paraphrases locales dans les r&#233;visions de Wikip&#233;dia, mais que parfois des informations</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAMILLE DUTREY, HOUDA BOUAMOR, DELPHINE BERNHARD ET AUR&#201;LIEN MAX
</p>
<p>plus fines sur le contexte syntaxique et s&#233;mantique sont n&#233;cessaires. La couverture obtenue est tr&#232;s limit&#233;e du fait
de la grande vari&#233;t&#233; de ph&#233;nom&#232;nes concern&#233;s, en outre difficilement captur&#233;s par les r&#232;gles d&#233;velopp&#233;es sur un
corpus de d&#233;veloppement diff&#233;rent du corpus sur lequel a port&#233; notre &#233;valuation. Par ailleurs, l&#8217;&#233;tude de plusieurs
exemples a r&#233;v&#233;l&#233; que les ressources morphologiques et s&#233;mantiques utilis&#233;es par Fastr pourraient &#234;tre enrichies
afin d&#8217;assurer une meilleure couverture pour notre t&#226;che.
</p>
<p>6 Conclusions et perspectives
</p>
<p>Dans cet article, nous avons d&#233;crit une typologie des modifications locales pr&#233;sentes dans les r&#233;visions des articles
de Wikip&#233;dia. Cette typologie pourra servir de rep&#232;re utile pour des travaux ult&#233;rieurs sur cet ensemble de donn&#233;es.
Si nous ne l&#8217;avons pas formellement d&#233;montr&#233;, nous pensons que la structure de haut niveau de notre typologie
s&#8217;applique assez directement quelle que soit la langue &#233;tudi&#233;e. Nous travaillerons prochainement sur une version
anglaise du corpus WICOPACO et testerons alors cette hypoth&#232;se.
</p>
<p>Nous avons &#233;galement effectu&#233; une annotation manuelle d&#8217;un sous-ensemble du corpus &#233;tudi&#233;. Cette &#233;tude a
montr&#233; qu&#8217;une quantit&#233; importante de modifications correspondent &#224; des reformulations avec de faibles varia-
tions s&#233;mantiques. Ceci constitue donc un r&#233;sultat encourageant dans l&#8217;optique d&#8217;exploiter les r&#233;visions d&#8217;une
ressource importante et dynamique telle que Wikip&#233;dia pour l&#8217;acquisition de paraphrases. Nos premi&#232;res exp&#233;ri-
ences exploitant un moteur de reconnaissance de variantes de termes adapt&#233; &#224; nos besoins ont r&#233;v&#233;l&#233; des r&#233;sultats
encourageants, permettant avant tout d&#8217;obtenir une bonne pr&#233;cision sur les paraphrases identifi&#233;es. Les diff&#233;rentes
limites de l&#8217;outil utilis&#233; que nous avons identifi&#233;es nous ont permis de sp&#233;cifier un nouveau moteur d&#8217;identifica-
tion par r&#232;gles plus adapt&#233; &#224; nos besoins, permettant l&#8217;expression de r&#232;gles avec une combinaison quelconque de
contraintes portant sur le lexique, les constituants, ou les d&#233;pendances syntaxiques.
</p>
<p>Cependant, la richesse des types de r&#233;&#233;criture possibles rendent difficile l&#8217;obtention d&#8217;un jeu de r&#232;gles suffisam-
ment couvrant. Nous comptons donc par la suite &#233;tudier diff&#233;rents types de classifieurs automatiques avec dif-
f&#233;rents jeux de traits, portant sur les caract&#233;ristiques linguistiques des modifications mais &#233;galement sur les m&#233;ta-
donn&#233;es des r&#233;visions. Ce type d&#8217;apprentissage se fondera vraisemblablement sur une quantit&#233; de donn&#233;es impor-
tante dont nous ne disposions pas encore &#224; ce stade de notre &#233;tude. Les donn&#233;es qui pourraient &#234;tre prochainement
disponible via un jeu en ligne d&#233;velopp&#233; dans notre laboratoire 7 seraient ici particuli&#232;rement utiles, puisqu&#8217;elles
incluent des paraphrases candidates en contexte propos&#233;es par des joueurs et des &#233;valuations chiffr&#233;es attribu&#233;es
par d&#8217;autres joueurs. Il pourrait donc par exemple s&#8217;agir d&#8217;un cadre d&#8217;annotation original pour les donn&#233;es de
WICOPACO.
</p>
<p>Le pr&#233;sent travail a montr&#233; que les r&#233;visions de Wikip&#233;dia contiennent de nombreuses r&#233;&#233;critures &#224; faible variation
s&#233;mantique, incluant de nombreuses paraphrases locales. Nos propositions pour l&#8217;identification de paraphrases
ainsi que nos travaux en cours produiront des listes de paires de paraphrases candidates en contexte, possiblement
associ&#233;es &#224; un score de confiance. Nous comptons par la suite &#233;valuer les paraphrases extraites par la t&#226;che,
en b&#233;n&#233;ficiant des travaux en recherche d&#8217;information pr&#233;cise et en traduction automatique men&#233;s dans notre
laboratoire, qui correspondent &#224; des applications du TAL tr&#232;s sensibles &#224; la variation en langue.
</p>
<p>Un autre type d&#8217;application sur lequel nous comptons travailler porte sur l&#8217;exploitation des patrons de r&#233;&#233;criture
acquis (incluant les patrons de corrections orthographiques et grammaticaux obtenus par Wisniewski et al. (2010))
pour l&#8217;aide &#224; la r&#233;daction d&#8217;articles sous Wikip&#233;dia. Une interface efficace permettrait notamment d&#8217;anticiper cer-
taines corrections ult&#233;rieures par d&#8217;autres contributeurs et ainsi de rendre plus efficace le travail d&#8217;un contributeur,
</p>
<p>7. Voir (Bouamor et al., 2009) pour une description initiale.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>PARAPHRASES ET MODIFICATIONS LOCALES DANS L&#8217;HISTORIQUE DES R&#201;VISIONS DE WIKIP&#201;DIA
</p>
<p>et de r&#233;duire globalement le nombre de r&#233;visions n&#233;cessaires &#224; l&#8217;&#233;chelle de l&#8217;encyclop&#233;die. Par exemple, une
normalisation fr&#233;quemment apport&#233;e aux textes de l&#8217;encyclop&#233;die pourrait &#234;tre sugg&#233;r&#233;e de fa&#231;on interactive au
contributeur qui l&#8217;introduirait dans une nouvelle contribution.
</p>
<p>Remerciements
</p>
<p>Les auteurs tiennent &#224; remercier Julien Boulet, Martine Hurault-Plantet et Guillaume Wisniewski pour leur partic-
ipation &#224; la cr&#233;ation du corpus WICOPACO utilis&#233; dans ce travail, ainsi que les tr&#232;s nombreux contributeurs &#224; la
cr&#233;ation du corpus MULTITRAD.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOUAMOR H. (2010). Construction d&#8217;un corpus de paraphrases d&#8217;&#233;nonc&#233;s par traduction multiple multilingue.
In Actes de R&#201;CITAL 2010, Montr&#233;al, Canada.
</p>
<p>BOUAMOR H., MAX A. &amp; VILNAT A. (2009). Amener des utilisateurs &#224; cr&#233;er et &#233;valuer des paraphrases par le
jeu. In Actes de TALN, session de d&#233;monstrations, Senlis, France.
</p>
<p>BOUAMOR H., MAX A. &amp; VILNAT A. (2010). Comparison of Paraphrase Acquisition Techniques on Sentential
Paraphrases. In Proceedings of the 7th International Conference on NLP, IceTAL 2010, volume 6233 of Lecture
Notes in Computer Science, Advances in Natural Language Processing : Springer Berlin / Heidelberg.
</p>
<p>BOURDAILLET J. &amp; GANASCIA J.-G. (2007). Machine Assisted Study of Writers&#8217; Rewriting Processes. In
Proceedings of the International Workshop on Natural Language Processing and Cognitive Science (NLPCS
2007).
</p>
<p>CHRISTIAN JACQUEMIN (1994). Recycling terms into a partial parser. In Proceedings of the fourth conference
on Applied natural language processing, Stuttgart, Germany.
</p>
<p>DEL&#201;GER L. &amp; ZWEIGENBAUM P. (2009). Extracting lay paraphrases of specialized expressions from monolin-
gual comparable medical corpora. In Proceedings of the Workshop on Building and Using Comparable Corpora :
from Parallel to Non-parallel Corpora, Singapore.
</p>
<p>DOLAN W. B. &amp; BROCKETT C. (2005). Automatically Constructing a Corpus of Sentential Paraphrases. In
Proceedings of the Third International Workshop on Paraphrasing (IWP2005).
</p>
<p>DUCLAYE F., COLLIN O. &amp; YVON F. (2003). Apprentissage automatique de paraphrases pour l&#8217;am&#233;lioration
d&#8217;un syst&#232;me de questions-r&#233;ponses. In Actes de TALN, Batz-sur-mer, France.
</p>
<p>DUTREY C., BOUAMOR H., BERNHARD D. &amp; MAX A. (2011). Typologie des modifications dans les r&#233;visions
de Wikip&#233;dia. Notes et documents du LIMSI 2011-01, LIMSI-CNRS.
</p>
<p>F. CHEVALIER, S. HUOT ET J-D. FEKETE (2010). Visualisation de mesures agr&#233;g&#233;s pour l&#8217;estimation de
la qualit&#233; des articles Wikip&#233;dia. In Extraction et gestion des connaissances (EGC&#8217;2010), Actes, Hammamet,
Tunisie, 26 au 29 janvier 2010.
</p>
<p>GERMANN U. (2008). Yawat : Yet Another Word Alignment Tool. In Proceedings of the ACL-08 : HLT Demo
Session.
</p>
<p>GLICKMAN O., DAGAN I. &amp; KOPPEL M. (2005). A probabilistic classification approach for lexical textual
entailment. In Proceedings of the 20th national conference on Artificial intelligence (AAAI&#8217;05) : AAAI Press.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAMILLE DUTREY, HOUDA BOUAMOR, DELPHINE BERNHARD ET AUR&#201;LIEN MAX
</p>
<p>HU M., LIM E.-P., SUN A. &amp; LAUW, HADY WIRAWANAND VUONG B.-Q. (2007). Measuring article quality
in Wikipedia : models and evaluation. In CIKM &#8217;07 : Proceedings of the sixteenth ACM conference on Conference
on information and knowledge management, Lisbon, Portugal : ACM.
</p>
<p>MADNANI N. &amp; DORR B. J. (2010). Generating Phrasal &amp; Sentential Paraphrases : A Survey of Data-Driven
Methods. Computational Linguistics, 36(3).
MAX A. (2008). G&#233;n&#233;ration de reformulations locales par pivot pour l&#8217;aide &#224; la r&#233;vision. In Actes de TALN,
Avignon, France.
</p>
<p>MAX A. (2010). Example-based paraphrasing for improved phrase-based statistical machine translation. In
Proceedings of the 2010 Conference on Empirical Methods in Natural Language Processing.
</p>
<p>MAX A. &amp; WISNIEWSKI G. (2010). Mining Naturally-occurring Corrections and Paraphrases from Wikipedia&#8217;s
Revision History. In Proceedings of LREC 2010, Valletta, Malta.
</p>
<p>NELKEN R. &amp; YAMANGIL E. (2008). Mining Wikipedia&#8217;s Article Revision History for Training Computa-
tional Linguistic Algorithms. In Proceedings of the AAAI Workshop on Wikipedia and Artificial Intelligence :An
Evolving Synergy.
</p>
<p>SUH B., CHI E., KITTUR A. &amp; PENDLETON B. (2008). Lifting the veil : improving accountability and social
transparency in Wikipedia with Wikidashboard. In Proceeding of the twenty-sixth annual SIGCHI conference
on Human factors in computing systems : ACM.
</p>
<p>VI&#201;GAS F., WATTENBERG M. &amp; DAVE K. (2004). Studying Cooperation and Conflict Between Authors With
History FlowVisualization. Proceedings of the SIGCHI conferenceonHuman Factors in Computing Systems
(CHI&#8217;04).
</p>
<p>WISNIEWSKI G., MAX A. &amp; YVON F. (2010). Recueil et analyse d&#8217;un corpus &#233;cologique de corrections
orthographiques extrait des r&#233;visions de Wikip&#233;dia. In Actes de TALN 2010, Montr&#233;al, Canada.
</p>
<p>YATSKAR M., PANG B., DANESCU-NICULESCU-MIZIL C. &amp; LEE L. (2010). For the sake of simplicity :
Unsupervised extraction of lexical simplifications from Wikipedia. In Proceedings of the NAACL.
</p>
<p>ZANZOTTO F. M. &amp; PENNACCHIOTTI M. (2010). Expanding textual entailment corpora from Wikipedia using
co-training. In Proceedings of the 2nd Workshop on Collaboratively Constructed Semantic Resources.
</p>
<p>ZESCH T., M&#220;LLER C. &amp; GUREVYCH I. (2008). Extracting lexical semantic knowledge from Wikipedia and
Wiktionary. In Proceedings of the Sixth International Language Resources and Evaluation(LREC&#8217;08), Mar-
rakech, Morocco.</p>

</div></div>
</body></html>