<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>RefGen, outil d&#8217;identification automatique des cha&#238;nes de r&#233;f&#233;rence en fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p> 
</p>
<p>RefGen, outil d&#8217;identification automatique des cha&#238;nes de r&#233;f&#233;rence en fran&#231;ais 
</p>
<p>Laurence Longo   Amalia Todirascu 
</p>
<p>Universit&#233; de Strasbourg, 22 avenue Ren&#233; Descartes, 67084 Strasbourg Cedex, France 
longo@unistra.fr, todiras@unistra.fr 
</p>
<p>Nous pr&#233;sentons RefGen, un outil d&#8217;identification automatique des cha&#238;nes de r&#233;f&#233;rence (CR) en fran&#231;ais. Les CR sont 
compos&#233;es d'au moins trois expressions r&#233;f&#233;rentielles (Schnedecker, 1997). D&#233;velopp&#233; dans un cadre industriel1, RefGen 
est un prototype (d&#233;velopp&#233; en Perl et en Java) pouvant &#234;tre int&#233;gr&#233; dans un syst&#232;me de d&#233;tection automatique de th&#232;mes. 
L'architecture de RefGen est modulaire et compos&#233;e d&#8217;un &#233;tiquetage fin, d&#8217;un module d'annotation des expressions 
r&#233;f&#233;rentielles (groupes nominaux simples et complexes, entit&#233;s nomm&#233;es) et d&#8217;un module de calcul de la r&#233;f&#233;rence. 
RefGen utilise aussi une s&#233;rie de param&#232;tres sp&#233;cifiques au genre textuel pour calculer les relations de r&#233;f&#233;rence (distance 
entre les maillons d&#8217;une CR, nombre de maillons d&#8217;une CR, etc). 
</p>
<p>Pour l&#8217;&#233;tiquetage, RefGen utilise le cat&#233;goriseur TTL2 (Ion, 2007) dans sa version fran&#231;aise. D&#233;velopp&#233; en Perl, TTL 
utilise le jeu d&#8217;&#233;tiquettes morphosyntaxiques fin propos&#233; dans le projet Multext (Ide et V&#233;ronis, 1994), permettant de 
pr&#233;ciser des informations comme le genre, le nombre, le mode, le temps, etc. En plus de cet &#233;tiquetage fin, TTL identifie 
certains noms propres et fournit une analyse syntaxique partielle en chunks (groupes nominaux, groupes pr&#233;positionnels, 
groupes adjectivaux et groupes verbaux). Les sorties &#233;tiquet&#233;es sont disponibles en format XML. 
</p>
<p>Pour identifier les relations de r&#233;f&#233;rence entre les diff&#233;rentes entit&#233;s du discours, RefGen annote d&#8217;abord les diverses 
expressions r&#233;f&#233;rentielles contenues dans les CR (groupes nominaux, entit&#233;s nomm&#233;es) avec RefAnnot. Ainsi, le module 
d&#8217;annotations RefAnnot (d&#233;velopp&#233; en Java) applique un ensemble de r&#232;gles morphosyntaxiques pour identifier les 
expressions r&#233;f&#233;rentielles. Ces r&#232;gles sont d&#233;finies dans un format XML facilement transformable vers un autre format. 
RefAnnot identifie les groupes nominaux complexes (CNp, groupes nominaux modifi&#233;s par deux groupes 
pr&#233;positionnels au plus), plus informatifs, qui introduisent de nouveaux &#233;l&#233;ments dans le discours ainsi que certaines 
entit&#233;s nomm&#233;es (noms de personnes, organisations, lieux et fonctions). Pour faciliter le tri des divers candidats 
anaphoriques, les emplois impersonnels du pronom &#171; il &#187; sont aussi annot&#233;s. Ainsi, RefGen ne les prendra pas en compte 
lors de son calcul. Les sorties de RefAnnot sont disponibles en format xml mais aussi en html (pour faciliter la lisibilit&#233;). 
</p>
<p>Le texte enrichi en annotations passe alors dans le module de calcul de la r&#233;f&#233;rence CalcRef (d&#233;velopp&#233; en Java). 
L&#8217;algorithme mis en place utilise des param&#232;tres li&#233;s au genre textuel pour s&#233;lectionner les premiers maillons des cha&#238;nes 
de r&#233;f&#233;rence mais aussi un score d&#8217;accessibilit&#233; global calcul&#233; &#224; partir de l&#8217;&#233;chelle d&#8217;accessibilit&#233; d&#8217;(Ariel, 1990). Puis, la 
s&#233;lection des paires ant&#233;c&#233;dent-anaphore s&#8217;effectue par la validation d&#8217;une s&#233;rie de contraintes (lexicales, syntaxiques, 
s&#233;mantiques) fortes et faibles. Une fois les paires identifi&#233;es, RefGen construit les CR suivant la propri&#233;t&#233; de transitivit&#233;. 
</p>
<p>Outre son utilisation premi&#232;re (l&#8217;identification des CR), RefGen peut aussi &#234;tre utilis&#233; comme outil de pr&#233;-annotation de 
corpus. D&#8217;autres r&#232;gles morphosyntaxiques peuvent &#234;tre facilement ajout&#233;es &#224; RefAnnot suivant les besoins 
(identification de dates, d&#8217;&#233;v&#232;nements, ou typage plus fin des entit&#233;s nomm&#233;es (fonction administrative, fonction 
politique, etc.). Une interface graphique est en cours de r&#233;alisation pour faciliter l&#8217;utilisation de l&#8217;outil. 
</p>
<p>ARIEL M. (1990). Accessing Noun-Phrase Antecedents. Londres : Routledge. 
</p>
<p>IDE N., VERONIS J. (1994). MULTEXT (Multilingual Tools and Corpora). Actes de IAACL, Kyoto. 
</p>
<p>ION R. (2007). Word Sense Disambiguation Method Applied to English and Romanian. Th&#232;se de doctorat, Bucharest. 
</p>
<p>SCHNEDECKER C. (1997). &#171; Nom propre et cha&#238;nes de r&#233;f&#233;rence &#187;, Recherches Linguistiques, 21, Paris, Klincksiek.
</p>
<p>                                                          
1  L&#8217;outil a &#233;t&#233; d&#233;velopp&#233; dans le cadre d&#8217;une convention CIFRE avec la soci&#233;t&#233; RBS, Strasbourg (www.rbs.fr). 
2  TTL est disponible comme service Web sur la plate-forme Weblicht (https://weblicht.sfs.uni-tuebingen.de/). Un code 
</p>
<p>d&#8217;acc&#232;s est n&#233;cessaire (disponible sur simple demande). </p>

</div></div>
</body></html>