<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Cr&#233;ation de clusters s&#233;mantiques dans des familles morphologiques &#224; partir du TLFi</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Cr&#233;ation de clusters s&#233;mantiques dans des familles morphologiques &#224;
partir du TLFi
</p>
<p>Nuria Gala1 Nabil Hathout2 Alexis Nasr1 V&#233;ronique Rey3 Selja Sepp&#228;l&#228;1
(1) LIF-TALEP, 163, Av. de Luminy case 901, 13288 Marseille Cedex 9
(2) CLLE-ERSS, 5, all&#233;es Antonio Machado, 31058 Toulouse Cedex 9
</p>
<p>(3) EHESS, 2, rue de la Charit&#233;, 13002 Marseille
{nuria.gala, alexis.nasr, selja.seppala}@lif.univ-mrs.fr, nabil.hathout@univ-tlse2.fr,
</p>
<p>veronique.rey-lafay@univmed.fr
</p>
<p>R&#233;sum&#233;. La constitution de ressources linguistiques est une t&#226;che longue et co&#251;teuse. C&#8217;est notamment le
cas pour les ressources morphologiques. Ces ressources d&#233;crivent de fa&#231;on approfondie et explicite l&#8217;organisation
morphologique du lexique compl&#233;t&#233;e d&#8217;informations s&#233;mantiques exploitables dans le domaine du TAL. Le travail
que nous pr&#233;sentons dans cet article s&#8217;inscrit dans cette perspective et, plus particuli&#232;rement, dans l&#8217;optique d&#8217;af-
finer une ressource existante en s&#8217;appuyant sur des informations s&#233;mantiques obtenues automatiquement. Notre
objectif est de caract&#233;riser s&#233;mantiquement des familles morpho-phonologiques (des mots partageant une m&#234;me
racine et une continuit&#233; de sens). Pour ce faire, nous avons utilis&#233; des informations extraites du TLFi annot&#233;
morpho-syntaxiquement. Les premiers r&#233;sultats de ce travail seront analys&#233;s et discut&#233;s.
</p>
<p>Abstract. Building lexical resources is a time-consuming and expensive task, mainly when it comes to
morphological lexicons. Such resources describe in depth and explicitly the morphological organization of the
lexicon, completed with semantic information to be used in NLP applications. The work we present here goes on
such direction, and especially, on refining an existing resource with automatically acquired semantic information.
Our goal is to semantically characterize morpho-phonological families (words sharing a same base form and se-
mantic continuity). To this end, we have used data from the TLFi which has been morpho-syntactically annotated.
The first results of such a task will be analyzed and discussed.
</p>
<p>Mots-cl&#233;s : Ressources lexicales, familles morphologiques, clusters s&#233;mantiques, mesure de Lesk.
</p>
<p>Keywords: Lexical resources, morphological families, semantic clusters, Lesk measure.
</p>
<p>1 Introduction
</p>
<p>Les ressources linguistiques sont indispensables aussi bien dans une perspective de traitement automatique de la
langue que dans le cadre d&#8217;une utilisation humaine (apprentissage des langues, th&#233;rapie orthophoniste, etc.). Une
des probl&#233;matiques saillantes dans ce domaine concerne leur constitution : elle s&#8217;av&#232;re longue et co&#251;teuse, sp&#233;cia-
lement lorsqu&#8217;on vise des informations fines comme la description de l&#8217;organisation d&#233;rivationnelle du lexique.
La cr&#233;ation de ce type de ressource peut &#234;tre r&#233;alis&#233;e soit manuellement comme (Gala &amp; Rey, 2008), soit &#224; partir
d&#8217;informations morphologiques d&#233;rivationnelles acquises automatiquement. Pour le fran&#231;ais, citons le projet Mor-
TAL (Hathout et al., 2002; Dal et al., 2004), les travaux en informatique m&#233;dicale qui portent sur l&#8217;apprentissage
de relations morphologiques en corpus sp&#233;cialis&#233;s (Zweigenbaum et al., 2003; Langlais et al., 2009). Signalons
&#233;galement que plusieurs travaux portent sur l&#8217;acquisition automatique de familles morphologiques du fran&#231;ais
comme (Gaussier, 1999; Bernhard, 2007; Hathout, 2009; Lavall&#233;e &amp; Langlais, 2010). Notre objectif &#224; terme est
de cr&#233;er une ressource comparable &#224; la base CELEX 1 (Baayen et al., 1995), c&#8217;est-&#224;-dire, un lexique avec des
informations morpho-s&#233;mantiques fines pour au moins 50 000 mots du fran&#231;ais.
</p>
<p>Dans cet article, nous pr&#233;sentons une m&#233;thodologie de cr&#233;ation de sous-familles ou clusters s&#233;mantiques dans des
</p>
<p>1. CELEX d&#233;crit la phonologie et la morphologie de trois langues germaniques, l&#8217;anglais, l&#8217;allemand et le n&#233;erlandais. Elle contient no-
tamment une analyse morphologique d&#233;rivationnelle fine pour l&#8217;ensemble des lex&#232;mes : 52 447 entr&#233;es pour l&#8217;anglais, 51 728 pour l&#8217;allemand
et 124 136 pour le n&#233;erlandais</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NURIA GALA, NABIL HATHOUT, ALEXIS NASR, V&#201;RONIQUE REY, SELJA SEPP&#196;L&#196;
</p>
<p>familles morpho-phonologiques existantes. La section 2 d&#233;crit les principes th&#233;oriques et la ressource &#224; la base
de notre travail. Dans les sections 3 et 4, nous d&#233;crivons les crit&#232;res utilis&#233;s et la m&#233;thode mise en &#339;uvre pour le
partitionnement automatique. Enfin, la derni&#232;re section analyse et discute les r&#233;sultats obtenus.
</p>
<p>2 Principes th&#233;oriques et justifications m&#233;thodologiques
</p>
<p>2.1 Familles morpho-phonologiques
</p>
<p>Ce travail s&#8217;inscrit dans le cadre d&#8217;une approche paradigmatique de la morphologie. Dans ce contexte, deux notions
peuvent &#234;tre utilis&#233;es pour rendre compte de la construction des unit&#233;s lexicales : la notion de &#171; famille &#187; et celle de
&#171; s&#233;rie &#187; (Roch&#233; et al., 2011). En synchronie, la notion de &#171; famille morphologique &#187; ne r&#233;f&#232;re pas &#224; une filiation
historique mais &#224; une relation de forme et de sens. La famille constitue alors un ensemble d&#8217;unit&#233;s associ&#233;es
en raison d&#8217;un &#233;l&#233;ment commun appel&#233; &#171; racine &#187; et permettant le classement des mots du lexique en familles
morphologiques (Gaussier, 1999; Hathout, 2005). Une famille morphologique est donc un ensemble de mots
partageant une m&#234;me racine (base) et une continuit&#233; de sens comme on peut le voir pour boule en figure 1 :
</p>
<p>aboulie, dysboulie, abouler, boule, bouler, boulet, bouletage, bouleter, boulet&#233;, boulette,
boulier, boulisme, bouliste, boulocher, boulodrome, boulotter, d&#233;bouler, rabouler, boulon,
boulonnage, boulonner, boulonnerie, d&#233;boulonnage, d&#233;boulonnement, d&#233;boulonner,
ind&#233;boulonnable, chamboulement, chambouler, &#233;boulement, &#233;bouler, &#233;boulis
</p>
<p>FIGURE 1 &#8211; Famille morphologique de boule dans la base Polymots.
</p>
<p>En fran&#231;ais, une base a g&#233;n&#233;ralement plusieurs th&#232;mes (Roch&#233;, 2010) qui pr&#233;sentent des alternances vocaliques,
par exemple, &#339;/ou (c&#339;ur/courage), eu/o (fleur/floraison), etc. Il existe aussi des alternances consonantiques,
comme d/t (verdure/verte) ou f /v (actif /activit&#233;), et des ph&#233;nom&#232;nes de consonne latente (long/longuement ;
tapis/tapissier ; petit/petitesse). On observe par ailleurs que la taille des familles peut aussi varier de fa&#231;on si-
gnificative car certains mots sont morphologiquement isol&#233;s (genou, intrigue, moment, etc.), alors que d&#8217;autres
appartiennent &#224; des familles tr&#232;s nombreuses (acte/ag-, fil, port, etc.).
</p>
<p>Polymots 2 (Gala &amp; Rey, 2008) est une base lexicale pour le fran&#231;ais qui d&#233;crit de telles familles morphologiques.
Elle a &#233;t&#233; construite manuellement &#224; partir du Petit Larousse 2000 (20 000 mots pleins ont &#233;t&#233; extraits et analys&#233;s
morphologiquement : 2 004 familles ont &#233;t&#233; identifi&#233;es). L&#8217;objectif de Polymots &#233;tant la description du lexique en
terme de d&#233;rivation, une partie des entr&#233;es du dictionnaire a &#233;t&#233; exclue en faisant une hypoth&#232;se a priori sur la
rentabilit&#233; des bases : exclusion de mots qui construisent tr&#232;s peu de d&#233;riv&#233;s 3. Sont exclus :
</p>
<p>&#8211; les noms propres (et leurs d&#233;riv&#233;s) ;
&#8211; les noms compos&#233;s qui ne sont pas graphiquement simples (qui contiennent, par exemple, un tiret) ;
&#8211; les termes techniques comme les noms de maladies, de champignons ou d&#8217;animaux, &#224; l&#8217;exception des noms des
</p>
<p>animaux familiers comme chien, chat, vache qui eux figurent dans la base.
</p>
<p>Le premier principe du regroupement en familles est le partage d&#8217;un radical morpho-phonologique. Une v&#233;rifica-
tion dans deux dictionnaires &#233;tymologiques a permis de confirmer ou d&#8217;infirmer ces rapprochements. Par exemple,
le mot pause a &#233;t&#233; rapproch&#233; de la forme poser (et donc inclu dans la m&#234;me famille) et ce malgr&#233; une graphie
diff&#233;rente. A l&#8217;issue d&#8217;une validation manuelle, nous avons exclu des mots comportant des marques de flexion
(opposition de genre ou de nombre) sauf dans les cas o&#249; cette marque est significative (par exemple, allumette,
annales, fian&#231;ailles, etc.). Par ailleurs, aucune information grammaticale (partie du discours) ou sociolinguistique
(registre) n&#8217;&#233;tait initialement fournie pour les mots. Des &#233;tiquettes grammaticales &#8212; extraites du Larousse &#8212; ont
cependant &#233;t&#233; ajout&#233;es dans la nouvelle version de la base, qui sera mise en ligne dans le courant de l&#8217;&#233;t&#233; 2011.
</p>
<p>2. http://polymots.lif.univ-mrs.fr
3. Par exemple, dans le Petit Larousse, France n&#8217;a dans sa famille que franciser et fran&#231;ais, girafe que girafon et pot-au-feu est seul dans
</p>
<p>sa famille d&#233;rivationnelle. Ce crit&#232;re est en cours d&#8217;&#233;tude suite aux r&#233;sultats obtenus lors des analyses : environ 15 % des bases de Polymots
ont une rentabilit&#233; &lt; 3 mots (antenne, hangar, paupi&#232;re, etc.)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CR&#201;ATION DE CLUSTERS S&#201;MANTIQUES DANS DES FAMILLES MORPHOLOGIQUES &#192; PARTIR DU TLFI
</p>
<p>2.2 Caract&#233;risation s&#233;mantique
</p>
<p>Le regroupement des mots sur la base de crit&#232;res morphophonologiques et &#233;tymologiques produit souvent des
familles h&#233;t&#233;rog&#232;ne du point de vue s&#233;mantique, et rend leur exploitation pour le TAL difficile. Pour r&#233;duire cette
difficult&#233;, plusieurs directions ont &#233;t&#233; explor&#233;es. La premi&#232;re par (Gala et al., 2009) qui pr&#233;sentent un premier
enrichissement de Polymots par un ensemble d&#8217;unit&#233;s de sens associ&#233; &#224; chaque mot. Ces unit&#233;s ont &#233;t&#233; acquises
dans des corpus structur&#233;s librement accessibles comme Wikip&#233;dia ou Wiktionnaire et ont permis une premi&#232;re
caract&#233;risation en termes de coh&#233;sion et de dispersion s&#233;mantique 4.(Gala et al., 2009) ont ainsi mis en &#233;vidence
que pour certaines familles la coh&#233;sion s&#233;mantique est tr&#232;s forte (par exemple, le mot terre est pr&#233;sent dans les
d&#233;finitions lexicographiques de aterrir, enterrer, extraterrestre, terrain, terrasse, etc.), dans d&#8217;autres, il existe une
dispersion s&#233;mantique plus grande : une ou plusieurs composantes du mot base sont pr&#233;sentes dans les mots
d&#233;riv&#233;s. Par ailleurs, il est difficile dans certains cas de percevoir en synchronie les liens s&#233;mantiques entre des
mots d&#8217;une m&#234;me famille (par exemple, dispenser et dispendieux, dans la famille de penser, le premier d&#233;riv&#233; est
li&#233; &#224; l&#8217;id&#233;e d&#8217;autoriser, le deuxi&#232;me &#224; la sph&#232;re du p&#233;cunier).
</p>
<p>&#201;tant donn&#233; que les informations s&#233;mantiques peuvent &#234;tre utiles dans les applications en traitement automatique
des langues, nous avons jug&#233; n&#233;cessaire de mieux caract&#233;riser s&#233;mantiquement les familles morphologiques de
Polymots. Ansi, il nous a paru important de d&#233;limiter, dans chaque famille, des ensembles de mots partageant
une m&#234;me notion s&#233;mantique. Nous avons alors partitionn&#233; des familles sous des clusters s&#233;mantiques, que nous
d&#233;finissons comme des sous-familles morphologiques o&#249; les mots pr&#233;sentent une forte coh&#233;sion s&#233;mantique autour
d&#8217;une notion commune. Par exemple, la famille de boule qui contient initialement 31 mots d&#233;riv&#233;s peut &#234;tre divis&#233;s
en six clusters homog&#232;nes comme en figure 2 :
</p>
<p>Composante commune Cluster
trouble aboulie, dysboulie
boule abouler, boule, bouler, boulet, bouletage, bouleter, boulet&#233;, boulette, boulier,
</p>
<p>boulisme, bouliste, boulocher, boulodrome, d&#233;bouler, rabouler
boulon boulon, boulonnage, boulonner, boulonnerie, d&#233;boulonnage, d&#233;boulonnement,
</p>
<p>d&#233;boulonner, ind&#233;boulonnable
chambouler chamboulement, chambouler
&#233;bouler &#233;boulement, &#233;bouler, &#233;boulis
</p>
<p>TABLE 1 &#8211; Clusters s&#233;mantiques dans la famille morphologique de boule.
</p>
<p>3 Cr&#233;ation automatique de clusters s&#233;mantiques
</p>
<p>Nous avons retenu trois crit&#232;res pour la cr&#233;ation des clusters s&#233;mantiques : le premier est morphologique (partage
d&#8217;affixes), le deuxi&#232;me lexico-s&#233;mantique(partage de mots communs dans les d&#233;finitions du TLFi) et le troisi&#232;me
lexico-morphologique (pr&#233;sence de mots de la m&#234;me famille dans les d&#233;finitions du Larousse). La d&#233;coupage des
familles en clusters a &#233;t&#233; r&#233;alis&#233; &#224; partir d&#8217;un corpus de 658 mots appartenant &#224; 20 familles morpho-phonologiques
de Polymots. Chacune de ces familles a &#233;t&#233; initialement partitionn&#233; &#224; la main, en fonction du partage d&#8217;une unit&#233;
de sens &#224; tous les membres du cluster (voir colonne 1 dans la table 1).
</p>
<p>3.1 Crit&#232;re morphologique
</p>
<p>Le crit&#232;re morphlogique retenu est le nombre d&#8217;affixes communs que chaque mot partage avec les autres mots
de sa famille morpho-phonologique. Pour chaque paire de mots d&#233;riv&#233;s (ei, ej) dans une famille, notre syst&#232;me
calcule le score s1(ei, ej), qui n&#8217;est autre que le nombre d&#8217;affixes communs, par exemple : s1(d&#233;boulonner, in-
d&#233;boulonnable) = |{d&#233;-, -on}| = 2 ; s1(boulonner, d&#233;boulonner) = 1 ; s1(boulonner, d&#233;boulonnement) = 1 ;
s1(chamboulement, boulonner) = 0, etc.
</p>
<p>4. Pour des raisons d&#8217;espace, il est impossible de d&#233;crire ici la m&#233;thode utlis&#233;e. Les auteurs renvoyent le lecteur &#224; l&#8217;article (Gala et al.,
2009)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NURIA GALA, NABIL HATHOUT, ALEXIS NASR, V&#201;RONIQUE REY, SELJA SEPP&#196;L&#196;
</p>
<p>Les affixes n&#8217;ont &#233;t&#233; compar&#233;s que pour les membres d&#8217;une m&#234;me famille. Dans certains cas le score s1 peut
induire en erreur comme pour s1(chamboulement, d&#233;boulonnement) = 1 alors qu&#8217;on cherche &#224; s&#233;parer ces deux
mots de la famille boule dans deux clusters s&#233;mantiques diff&#233;rents (li&#233;s aux composantes &#8216;chambouler&#8217; et &#8216;boulon&#8217;
respectivement).
</p>
<p>3.2 Crit&#232;re lexico-s&#233;mantique
</p>
<p>Le deuxi&#232;me crit&#232;re mesure la similarit&#233; s&#233;mantique sur la base des mots partag&#233;s par les d&#233;finitions lexicographiques.
Cette technique initialement propos&#233;e par (Lesk, 1986) a &#233;t&#233; reprise par de nombreux auteurs, notamment (Ba-
nerjee &amp; Pedersen, 2002). Nous avons utilis&#233; les unit&#233;s lexicales pr&#233;sentes dans les d&#233;finitions du Tr&#233;sor de la
Langue Fran&#231;aise informatis&#233; (TLFi) annot&#233;es avec l&#8217;analyseur syntaxique MACAON (Nasr et al., 2010). Dans
le TLFi, chaque mot correspond &#224; un vocable (ou plusieurs, en cas d&#8217;homonymie) et chaque vocable peut avoir
diff&#233;rents sens (lexies). Lorsqu&#8217;une lexie est accompagn&#233;e d&#8217;une d&#233;finition, celle-ci est extraite et envoy&#233;e dans la
cha&#238;ne de traitement de MACAON. Le texte est tout d&#8217;abord segment&#233; en phrases, puis en unit&#233;s pr&#233;-lexicales et
en mots. Les mots se voient ensuite associer une cat&#233;gorie morpho-syntaxique, avant d&#8217;&#234;tre lemmatis&#233;s. Chaque
mot de la d&#233;finition ainsi annot&#233; est pr&#233;sent&#233; sous la forme suivante : forme|cat&#233;gorie|lemme (voir figure 2). Pour
la cr&#233;ation des clusters, seules les d&#233;finitions du vocable sont retenues (pas celles des expressions fig&#233;es li&#233;es au
vocable) et seuls les lemmes des mots pleins (en gras dans l&#8217;exemple) sont gard&#233;s.
</p>
<p>&lt;VOCABLE id=&quot;28590&quot; text=&quot;&#201;BOULEMENT, &quot; cat=&quot;subst. masc.&quot;&gt; &lt;S n=&quot;1&quot;&gt;
</p>
<p>&lt;DEFI id=&quot;28590-1&quot;&gt;Chute|nc|chute de|prep|de ce|pro|ce qui|prorel|qui s&#8217;|clr|s&#8217;
&#233;boule|v|&#233;bouler .|poncts|. &lt;/DEFI&gt; &lt;DEFI id=&quot;28590-2&quot; ind=&quot;P. m&#233;ton.&quot;&gt;Amas/nc/amas
de/prep/de mat&#233;riaux/nc/mat&#233;riau &#233;boul&#233;s/vppart/&#233;bouler ./poncts/. &lt;/DEFI&gt;
</p>
<p>FIGURE 2 &#8211; D&#233;finition d&#8217;&#233;boulement dans le TLFi, &#233;tiquet&#233;e et lemmatis&#233;e.
</p>
<p>Pour chaque paire de mots d&#233;riv&#233;s appartenant &#224; une m&#234;me famille, nous attribuons un score lexical s2(ei, ej)
correspondant &#224; l&#8217;indice de Jaccard (rapport entre le nombre de lemmes communs aux d&#233;finitions des deux mots
dans le TLFi et le nombre total de lemmes qui apparaissent dans ces d&#233;finitions). Par exemple : s2(&#233;boulement,
&#233;bouler) = 0.000 ; s2(&#233;boulement, &#233;boulis) = 0.222 ; s2(&#233;bouler, &#233;boulis) = 0.036, etc. Pour ces exemples, s2 a
&#233;t&#233; calcul&#233; &#224; partir des ensembles de mots suivants extraits des d&#233;finitions du TLFi pr&#233;sent&#233;es en figure3 :
</p>
<p>&#201;BOULEMENT chute, &#233;bouler, amas, mat&#233;riau
&#201;BOULER faire, tomber, d&#233;sagr&#233;gation, affaisser, formation, naturel, artificiel, &#233;crouler,
</p>
<p>effondrer, laisser, roulant
&#201;BOULIS chute, &#233;bouler, amas, mat&#233;riau, g&#233;n&#233;ralement, naturel, ensemble, d&#233;bris, rocheux,
</p>
<p>d&#233;tacher, abrupt, former, talus, inclin&#233;, plan, conique, fort, pente
</p>
<p>FIGURE 3 &#8211; Mots pleins des d&#233;finitions du TLFi utilis&#233;s pour le calcul de s2 entre mots de la m&#234;me famille
morphologique.
</p>
<p>3.3 Crit&#232;re lexico-morphologique
</p>
<p>Le troisi&#232;me crit&#232;re est l&#8217;apparition de mots de la m&#234;me famille morphologique dans les d&#233;finitions du dictionnaire
Larousse. On trouve par exemple boule dans les d&#233;finitions de boulet, boulier, boulisme, bouliste, boulocher, etc.
Nous avons ainsi d&#233;fini un trait binaire s3(ei, ej) qui vaut 1 si un mot de la famille apparait dans l&#8217;une des
d&#233;finitions de l&#8217;entr&#233;e et 0 sinon (ei est le mot trait&#233;, ej un mot de sa famille pr&#233;sent ou non dans la d&#233;fintion) :
s3(boulet, boule) = 1 ; s3(bouletage, boulette) = 1 ; s3(boulet&#233;, boulet) = 1 ; s3(boulette, boule) = 1 ; etc.
</p>
<p>4 Clustering
</p>
<p>Le regroupement d&#8217;&#233;l&#233;ments d&#8217;une m&#234;me famille au sein de sous-familles (ou clusters) a &#233;t&#233; r&#233;alis&#233; &#224; l&#8217;aide d&#8217;un
algorithme de clustering hi&#233;rarchique. Son principe est simple : &#233;tant donn&#233; une famille F = {l1, . . . ln}, et une</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CR&#201;ATION DE CLUSTERS S&#201;MANTIQUES DANS DES FAMILLES MORPHOLOGIQUES &#192; PARTIR DU TLFI
</p>
<p>Famille Taille famille Rand index Famille Taille famille Rand index
mode 42 0.90 paille 26 0.54
pot 15 0.68 ten 55 0.91
val 58 0.79 meuble 28 0.68
onde 24 0.74 pens 27 0.79
presse 58 0.81 terre 37 0.62
</p>
<p>TABLE 2 &#8211; Evaluation du partitionnement automatique sur un ensemble de 10 familles
</p>
<p>mesure de similarit&#233; s(&#183;, &#183;), on commence par r&#233;aliser une partition initiale de F , qui consiste &#224; cr&#233;er une partie
pour tout &#233;l&#233;ment de F : {{l1}, . . . {ln}}. Les deux parties Px et Py les plus proches au sens de la mesure de
similarit&#233; s sont alors fusionn&#233;es au sein d&#8217;une m&#234;me partie. Le processus est r&#233;it&#233;r&#233; sur la nouvelle partition.
Le processus prend fin lorsque tous les &#233;l&#233;ments de F ont &#233;t&#233; regroup&#233;s au sein d&#8217;une seule partie ou lorsque la
similarit&#233; entre les deux parties les plus proches est inf&#233;rieure &#224; un seuil &#964; .
</p>
<p>La mesure de similarit&#233; que nous avons utilis&#233;e est une combinaison lin&#233;aire des trois crit&#232;res s1, s2 et s3. Ainsi la
similarit&#233; entre les deux &#233;l&#233;ments ei et ej est s(ei, ej) = &#945;s1(ei, ej)+&#946;s2(ei, ej)+&#947;s3(ei, ej) avec &#945;+&#946;+&#947; = 1.
Cette mesure est &#233;tendue &#224; la mesure entre deux parties Px et Py en r&#233;alisant simplement la moyenne sur tous les
couples (ei, ej) &#8712; Px &#215; Py :
</p>
<p>s(Px,Py) = 1|Px &#215; Py|
&#8721;
</p>
<p>(ei,ej)&#8712;Px&#215;Py
s(ei, ej)
</p>
<p>5 &#201;valuation
</p>
<p>L&#8217;&#233;valuation a &#233;t&#233; r&#233;alis&#233;e sur un ensemble de 20 familles pour lesquelles la partition de r&#233;f&#233;rence a &#233;t&#233; r&#233;alis&#233;e
manuellement. Les dix premi&#232;res familles ont &#233;t&#233; utilis&#233;es comme ensemble de d&#233;veloppement et ont permis
d&#8217;optimiser les coefficients &#945;, &#946; et &#947; ainsi que le seuil &#964; .
</p>
<p>Les param&#232;tres optimaux ainsi obtenus ont ensuite &#233;t&#233; utilis&#233;s pour &#233;valuer le partitionnement sur l&#8217;ensemble de
test, compos&#233; des dix derni&#232;res familles. La mesure d&#8217;&#233;valuation utilis&#233;e est le rand index, qui est une mesure de
comparaison de partitions d&#8217;un m&#234;me ensemble. Etant donn&#233; deux partitions X et Y de l&#8217;ensemble E, on d&#233;finit :
</p>
<p>&#8211; a comme le nombre de paires d&#8217;&#233;l&#233;ments de E qui appartiennent &#224; la m&#234;me partition dans X et dans Y
&#8211; b comme le nombre de paires d&#8217;&#233;l&#233;ments de E qui n&#8217;appartiennent pas &#224; la m&#234;me partition dans X ni dans Y
&#8211; c comme le nombre de paires d&#8217;&#233;l&#233;ments de E qui appartiennent &#224; la m&#234;me partition dans X mais n&#8217;appar-
</p>
<p>tiennent pas &#224; la m&#234;me partition dans Y
&#8211; d comme le nombre de paires d&#8217;&#233;l&#233;ments de E qui n&#8217;appartiennent pas &#224; la m&#234;me partition dans X mais
</p>
<p>appartiennent &#224; la m&#234;me partition dans Y .
</p>
<p>Le rand index de X et Y est alors :
a+ b
</p>
<p>a+ b+ c+ d
</p>
<p>La valeur maximale que peut prendre le rand index est 1, lorsque les deux partitions sont identiques, et 0 lorsqu&#8217;il
n&#8217;existe aucun couple dont les deux &#233;l&#233;ments appartiennent &#224; la m&#234;me partie dans X mais n&#8217;appartiennent pas &#224;
une m&#234;me partie dans Y ou inversement.
</p>
<p>Les r&#233;sultats de l&#8217;&#233;valuation sur notre ensemble de test sont pr&#233;sent&#233;s dans la table 2. Cette table montre une
grande disparit&#233; dans les r&#233;sultats obtenus pour les diff&#233;rentes familles : la moyenne du rand index sur l&#8217;ensemble
de 10 familles est de 74, 6 pour un &#233;cart type de 9, 4. Cela s&#8217;explique en partie par le manque de stabilit&#233; des
r&#233;sultats obtenus lors de l&#8217;optimisation des param&#232;tres sur l&#8217;ensemble d&#8217;&#233;valuation. En effet, lors de cette &#233;tape,
la recherche des param&#232;tres optimaux est effectu&#233;e par famille. La moyenne de chacun des param&#232;tres est ensuite
effectu&#233;e pour obtenir les param&#232;tres qui seront utilis&#233;s dans la phase de test. Or les param&#232;tres optimaux lors de
la premi&#232;re &#233;tape pr&#233;sentent une grande disparit&#233;. Les param&#232;tres optimaux pour une famille sont par cons&#233;quent
&#233;loign&#233;s des param&#232;tres d&#233;finitifs. Pour illuster cela, nous avons calcul&#233; la moyenne du rand index sur l&#8217;ensemble</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NURIA GALA, NABIL HATHOUT, ALEXIS NASR, V&#201;RONIQUE REY, SELJA SEPP&#196;L&#196;
</p>
<p>de d&#233;veloppement en utilisant les param&#232;tres d&#233;finitifs, le r&#233;sultat est de 64, 4, qu&#8217;il convient de comparer avec
une moyenne de 81, 5, obtenue en utilisant les param&#232;tres optimaux pour chaque famille.
</p>
<p>6 Conclusions et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; une m&#233;thode de partitionnement automatique de familles morpho-phonologiques en clusters
s&#233;mantiques. &#192; l&#8217;aide de trois crit&#232;res (morphologique, lexico-s&#233;mantique et lexico-morphologique) nous avons
calcul&#233; une mesure qui a permis le regroupement des mots d&#8217;une m&#234;me famille en clusters autour d&#8217;une m&#234;me
notion s&#233;mantique. Malgr&#233; la disparit&#233; de r&#233;sultats entre les familles et l&#8217;&#233;chantillon r&#233;duit choisi pour ce pre-
mier travail, les r&#233;sultats obtenus sont encourageants. Les perspectives de ce travail concernent la g&#233;n&#233;ralisation
du clustering pour l&#8217;ensemble de familles existantes dans Polymots (2 004 familles &#224; ce jour). Nous comptons,
&#233;galement, rajouter des crit&#232;res plus fins, comme la prise en compte d&#8217;informations syntaxiques, afin d&#8217;obtenir de
meilleurs r&#233;sultats pour l&#8217;ensemble des familles.
</p>
<p>R&#233;f&#233;rences
BAAYEN R. H., PIEPENBROCK R. &amp; VAN RIJN H. (1995). The Celex lexical database (release 1) [cd-rom].
BANERJEE S. &amp; PEDERSEN T. (2002). An adapted lesk algorithm for word sense disambiguation using wordnet. In
Proceedings of the Third International Conference on Computational Linguistics and Intelligent Text Processing, CICLing
&#8217;02, p. 136&#8211;145, London, UK : Springer-Verlag.
BERNHARD D. (2007). Apprentissage non supervis&#233; de familles morphologiques par classification ascendante hi&#233;rarchique.
In F. BENARMARA, N. HATOUT, P. MULLER &amp; S. OZDOWSKA, Eds., Actes de TALN 2007 (Traitement automatique des
langues naturelles), p. 367&#8211;376, Toulouse : ATALA IRIT.
DAL G., HATHOUT N. &amp; NAMER F. (2004). Morphologie constructionnelle et traitement automatique des langues : le projet
mortal. Lexique, 16, 199&#8211;229.
GALA N. &amp; REY V. (2008). Polymots : une base de donn&#233;es de constructions d&#233;rivationnelles en fran&#231;ais &#224; partir de radicaux
phonologiques. In Actes de TALN 2008 (Traitement automatique des langues naturelles), Avignon : ATALA LIA.
GALA N., REY V. &amp; TICHIT L. (2009). Dispersion s&#233;mantique dans des familles morpho-phonologiques : &#233;l&#233;ments th&#233;o-
riques et empiriques. In Actes de TALN 2009 (Traitement automatique des langues naturelles), Senlis : ATALA LIPN.
GAUSSIER E. (1999). Unsupervised learning of derivational morphology from inflectional lexicons. In ACL Workshop on
Unsupervised Learning in Natural Language Processing, College Park, MD.
HATHOUT N. (2005). Exploiter la structure analogique du lexique construit : une approche computationnelle. Cahiers de
Lexicologie, 87(2).
HATHOUT N. (2009). Acquisition of morphological families and derivational series from a machine readable dictionary. In
F. MONTERMINI, G. BOY&#201; &amp; J. TSENG, Eds., Selected Proceedings of the 6th D&#233;cembrettes : Morphology in Bordeaux,
Somerville, Mass. : Cascadilla Proceedings Project.
HATHOUT N., NAMER F. &amp; DAL G. (2002). An experimental constructional database : The mortal project. Many Morpho-
logies, p. 179&#8211;209.
LANGLAIS P., YVON F. &amp; ZWEIGENBAUM P. (2009). Improvements in analogical learning : application to translating
multi-terms of the medical domain. In Proceedings of the 12th Conference of the European Chapter of the Association for
Computational Linguistics, EACL &#8217;09, p. 487&#8211;495, Stroudsburg, PA, USA : Association for Computational Linguistics.
LAVALL&#201;E J.-F. &amp; LANGLAIS P. (2010). Analyse morphologique non supervis&#233;e par analogie formelle. In Actes de TALN
2010 (Traitement automatique des langues naturelles), Montr&#233;al : ATALA RALI.
LESK M. (1986). Automatic sense disambiguation using machine readable dictionaries : how to tell a pine code from an
ice cream cone. In Proceedings of the 5th annual international conference on Systems documentation, p. 24&#8211;26, Toronto,
Canada.
NASR A., B&#201;CHET F. &amp; REY J. (2010). Macaon une cha&#238;ne linguistique pour le traitement de graphes de mots. In Actes de
TALN 2010 (Traitement automatique des langues naturelles), Montr&#233;al : ATALA RALI.
ROCH&#201; M. (2010). Base, th&#232;me, radical. Revue linguistique de Vincennes, 39, 95&#8211;134.
ROCH&#201; M., BOY&#201; G., HATHOUT N., LIGNON S. &amp; PL&#201;NAT M. (2011). Une approche topologique de la construction des
mots : propositions th&#233;oriques et application &#224; la pr&#233;fixation en anti-, In Des unit&#233;s morphologiques au lexique, p. 251&#8211;318.
Hermes Science-Lavoisier : Paris. Chapitre r&#233;dig&#233; par N. Hathout.
ZWEIGENBAUM P., HADOUCHE F. &amp; GRABAR N. (2003). Apprentissage de relations morphologiques en corpus. In B.
DAILLE, Ed., Actes de TALN 2003 (Traitement automatique des langues naturelles), Batz-sur-mer : ATALA IRIN.</p>

</div></div>
</body></html>