<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;tude inter-langues de la distribution et des ambigu&#239;t&#233;s syntaxiques des pronoms</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>&#201;tude inter-langues de la distribution et
des ambigu&#239;t&#233;s syntaxiques des pronoms. &#8727;
</p>
<p>Lorenza Russo, Yves Scherrer, Jean-Philippe Goldman,
Sharid Lo&#225;iciga, Luka Nerima, &#201;ric Wehrli
</p>
<p>Laboratoire d&#8217;Analyse et de Technologie du Langage
D&#233;partement de Linguistique &#8211; Universit&#233; de Gen&#232;ve
</p>
<p>2, rue de Candolle &#8211; CH-1211 Gen&#232;ve 4
</p>
<p>{lorenza.russo, yves.scherrer, jean-philippe.goldman,
sharid.loaiciga, luka.nerima, eric.wehrli}@unige.ch
</p>
<p>R&#233;sum&#233;. Ce travail d&#233;crit la distribution des pronoms selon le style de texte (litt&#233;raire ou journalistique) et
selon la langue (fran&#231;ais, anglais, allemand et italien). Sur la base d&#8217;un &#233;tiquetage morpho-syntaxique effectu&#233;
automatiquement puis v&#233;rifi&#233; manuellement, nous pouvons constater que la proportion des diff&#233;rents types de
pronoms varie selon le type de texte et selon la langue. Nous discutons les cat&#233;gories les plus ambigu&#235;s de mani&#232;re
d&#233;taill&#233;e. Comme nous avons utilis&#233; l&#8217;analyseur syntaxique Fips pour l&#8217;&#233;tiquetage des pronoms, nous l&#8217;avons
&#233;galement &#233;valu&#233; et obtenu une pr&#233;cision moyenne de plus de 95%.
</p>
<p>Abstract. This paper compares the distribution of pronouns according to the text genre (literary or news)
and to the language (French, English, German and Italian). On the basis of manually verified part-of-speech tags,
we find that the proportion of different pronoun types depends on the text and on the language. We discuss the
most ambiguous cases in detail. As we used the Fips parser for the tagging of pronouns, we have evaluated it and
obtained an overall precision of over 95%.
</p>
<p>Mots-cl&#233;s : Pronoms, ambigu&#239;t&#233; pronominale, &#233;tiquetage morpho-syntaxique.
</p>
<p>Keywords: Pronouns, pronominal ambiguity, part-of-speech tagging.
</p>
<p>1 Introduction
</p>
<p>En traitement automatique du langage (TAL), la plupart des recherches sur les pronoms se sont focalis&#233;es sur la
r&#233;solution des anaphores. Dans ce domaine, de tr&#232;s nombreux travaux traitent d&#8217;algorithmes capables de d&#233;tecter
des cha&#238;nes anaphoriques inter- et intra-phrastiques, de leur impl&#233;mentation et de leur &#233;valuation (Lappin &amp; Leass,
1994; Mitkov et al., 2002; Trouilleux, 2002). Beaucoup moins nombreux sont les travaux qui ont &#233;tudi&#233; l&#8217;impact
de la r&#233;solution anaphorique sur des syst&#232;mes de TAL (Mitkov et al., 2007; Hardmeier &amp; Federico, 2010). Enfin,
des &#233;tudes sur corpus ont &#233;t&#233; effectu&#233;es afin de quantifier la fr&#233;quence des pronoms anaphoriques dans diff&#233;rents
types de texte (Tutin, 2002; Laurent, 2001).
</p>
<p>Le travail que nous pr&#233;sentons dans cet article vise &#224; r&#233;pondre &#224; trois questions plus g&#233;n&#233;rales, ind&#233;pendantes du
caract&#232;re anaphorique des pronoms : &#224; quelle fr&#233;quence rencontre-t-on les pronoms dans les textes ? Est-ce que la
distribution des pronoms change par rapport au type de texte et aussi par rapport &#224; la langue utilis&#233;e ? Quelles sont
les ambigu&#239;t&#233;s pour chaque type de pronom ? Nous avons effectu&#233; une &#233;tude sur corpus afin d&#8217;&#233;tudier la distribu-
tion des pronoms dans deux textes diff&#233;rents (un texte litt&#233;raire et un corpus de communiqu&#233;s de presse) et dans
quatre langues (fran&#231;ais, anglais, allemand et italien). Notre but principal est de mieux comprendre la distribution
des pronoms en fonction du style du texte 1 et de la langue concern&#233;e et d&#8217;&#233;valuer l&#8217;&#233;tiquetage de notre syst&#232;me
</p>
<p>&#8727;. Le travail de recherche ici pr&#233;sent&#233; a b&#233;n&#233;fici&#233; du support du Fonds National Suisse de la Recherche Scientifique (No 100015-130634).
1. Nous pr&#233;f&#233;rons parler ici de style de texte plut&#244;t que de genre de texte, car le texte litt&#233;raire que nous analysons ne peut pas &#234;tre consid&#233;r&#233;
</p>
<p>comme un &#233;chantillon repr&#233;sentatif du genre litt&#233;raire.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. RUSSO, Y. SCHERRER, J.-P. GOLDMAN, S. LO&#193;ICIGA, L. NERIMA, &#201;. WEHRLI
</p>
<p>d&#8217;analyse syntaxique. Un meilleur &#233;tiquetage syntaxique permettra &#233;galement d&#8217;am&#233;liorer les performances de
traducteurs automatiques &#224; base de r&#232;gles linguistiques (Scherrer et al., 2011).
</p>
<p>Cet article est structur&#233; ainsi : dans les sections 2 et 3, notre &#233;tude plurilingue d&#233;crit la distribution des pronoms par
langues, par style de texte et par cat&#233;gorie grammaticale. &#192; la section 4, nous d&#233;taillons les ambigu&#239;t&#233;s pronomi-
nales inh&#233;rentes &#224; chaque langue, alors que dans la section 5 nous discutons le probl&#232;me des analyses incompl&#232;tes.
La section 6 contient nos conclusions ainsi que de futures pistes de recherche.
</p>
<p>2 Les corpus
</p>
<p>Pour comparer la distribution des pronoms dans diff&#233;rents styles de texte et langues, nous avons choisi deux corpus
disponibles dans quatre langues, &#224; savoir un corpus litt&#233;raire &#8211; le Petit Prince en fran&#231;ais, ainsi que ses traductions
en anglais, allemand et italien 2 &#8211; et un corpus de communiqu&#233;s de presse de l&#8217;Administration F&#233;d&#233;rale Suisse 3,
&#233;galement disponible dans ces quatres langues.
</p>
<p>Pour une telle &#233;tude, nous avions le choix entre des corpus annot&#233;s &#224; la main &#8211; comme des banques d&#8217;arbres &#8211; et
des corpus annot&#233;s automatiquement. Dans le premier cas, la qualit&#233; des annotations est garantie, mais le choix des
documents est restreint. Il l&#8217;est encore plus lorsqu&#8217;on exige des corpus comparables dans plusieurs langues afin
d&#8217;obtenir des g&#233;n&#233;ralisations &#224; travers les langues. Dans le deuxi&#232;me cas, la qualit&#233; d&#8217;annotation est moindre, mais
le choix des textes est ouvert. Nous avons choisi d&#8217;&#233;tiqueter nos corpus automatiquement &#224; l&#8217;aide de l&#8217;analyseur
Fips (Wehrli, 2007) et de corriger manuellement ces annotations. Ces derni&#232;res nous permettent de discuter la
distribution des pronoms en fonction du style du texte et de la langue, ainsi que d&#8217;&#233;valuer la performance de Fips
et de recenser les cas d&#8217;ambigu&#239;t&#233;s les plus marqu&#233;es.
</p>
<p>Au total, nous avons v&#233;rifi&#233; et corrig&#233; l&#8217;annotation automatique de 1000 phrases pour chaque langue, 500 du Petit
Prince et 500 du corpus de Presse. En particulier, nous nous int&#233;ressons &#224; toutes les t&#234;tes lexicales &#233;tiquet&#233;es par
Fips comme pronoms personnels (je, eux, nous), 4 clitiques (te, la), d&#233;monstratifs (&#231;a, cela), relatifs (qui, que),
ind&#233;finis (chacun, personne), interrogatifs (qui) et d&#233;terminants possessifs (ma, leurs).
</p>
<p>3 Distribution des pronoms par corpus et par langue
</p>
<p>La Table 1 montre la distribution des pronoms selon les langues et les corpus. Si on consid&#232;re les nombres de
pronoms pr&#233;sents dans les phrases annot&#233;es, les chiffres montrent qu&#8217;un texte peut contenir jusqu&#8217;&#224; 17,6% de
pronoms, soit presque un mot sur cinq. Leur fr&#233;quence change par rapport au style de texte, notre corpus litt&#233;raire
pr&#233;sentant un nombre total de pronoms bien plus &#233;lev&#233; que notre corpus de Presse. En effet, le Petit Prince contient
de nombreux passages de dialogue et en cons&#233;quence beaucoup de pronoms de premi&#232;re et deuxi&#232;me personne. A
l&#8217;oppos&#233;, le nombre &#233;lev&#233; de concepts diff&#233;rents introduits dans un communiqu&#233; de presse emp&#234;che l&#8217;utilisation
massive de pronoms anaphoriques.
</p>
<p>Le style du texte a aussi une influence sur la longueur des phrases et donc sur leur complexit&#233;. Si les phrases du
Petit Prince contiennent en moyenne 10 mots, celles de la Presse contiennent environ 20 mots. La proportion de
pronoms relatifs peut &#234;tre prise comme un indice de la complexit&#233; d&#8217;une phrase (Table 2). Ainsi, dans le Petit
Prince, jusqu&#8217;&#224; 9% de tous les pronoms sont des pronoms relatifs (en italien). Dans le corpus de Presse, ce chiffre
va jusqu&#8217;&#224; 29,7% (en italien).
</p>
<p>Pour ce qui est des pronoms personnels, par contre, leur proportion est plus &#233;lev&#233;e dans le Petit Prince que dans le
corpus de Presse, atteignant un maximum de 69,1% pour l&#8217;anglais et de 72,1% pour l&#8217;allemand. En ce qui concerne
l&#8217;italien, les pourcentages plus bas de pronoms personnels sont dus au ph&#233;nom&#232;ne du pro-drop, ou pronom sujet
nul. En d&#8217;autres mots, en italien, le pronom personnel sujet peut ne pas &#234;tre exprim&#233; gr&#226;ce &#224; la richesse flexionnelle
des verbes qui permettent de d&#233;terminer la personne et le nombre du sujet m&#234;me quand celui-ci est absent.
</p>
<p>2. Les textes en fran&#231;ais, anglais et allemand sont disponibles sur http://wikilivres.info. Le texte en italien est disponible &#224; la
page : http://www.macchianera.net/files/ilpiccoloprincipe.pdf.
</p>
<p>3. Il s&#8217;agit de phrases extraites des communiqu&#233;s de presse de 2007, tels que disponibles &#224; l&#8217;addresse : http://www.news.admin.ch.
Nous appelons ce texte d&#233;sormais corpus de Presse.
</p>
<p>4. Fips consid&#232;re comme pronoms personnels &#224; la fois les pronoms personnels forts (moi et lui ) et les clitiques sujet (je ou il ).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;TUDE INTER-LANGUES DE LA DISTRIBUTION ET DES AMBIGU&#207;T&#201;S SYNTAXIQUES DES PRONOMS
</p>
<p>Corpus Phrases Mots Mots/Phrase Pronoms Pronoms/Mots
Petit Prince
EN 500 5361 10,7 910 17,0%
FR 500 5109 10,2 891 17,4%
DE 500 5684 11,4 998 17,6%
IT 500 4553 9,1 479 10,5%
Presse
EN 500 10399 20,8 259 2,5%
FR 500 11715 23,4 279 2,4%
DE 500 8968 17,9 192 2,1%
IT 500 11399 22,8 222 1,9%
</p>
<p>TABLE 1 &#8211; Distribution des pronoms selon les langues et les corpus. Les chiffres des pronoms proviennent de
l&#8217;annotation manuelle.
</p>
<p>Corpus CLI PERS POSS DEM REL INDEF INTER
Petit Prince
EN 69,1% 15,6% 4,5% 4,1% 5,4% 1,3%
FR 19,5% 48,9% 11,1% 11,4% 5,3% 2,1% 1,6%
DE 72,1% 10,3% 5,6% 3,7% 6,7% 1,5%
IT 50,5% 13,4% 20,3% 4,0% 9,0% 0,8% 2,1%
Presse
EN 39,0% 27,8% 7,3% 18,9% 6,9% 0,0%
FR 11,8% 24,7% 25,1% 11,5% 22,2% 3,9% 0,7%
DE 51,6% 21,4% 13,5% 9,9% 3,6% 0,0%
IT 35,6% 5,0% 20,3% 8,1% 29,7% 0,9% 0,5%
</p>
<p>TABLE 2 &#8211; Pourcentages des diff&#233;rentes cat&#233;gories de pronoms par rapport &#224; l&#8217;ensemble des pronoms trouv&#233;s dans
le texte.
</p>
<p>Quant aux pronoms d&#233;monstratifs, ils atteignent un pourcentage assez &#233;lev&#233; en fran&#231;ais dans le corpus litt&#233;raire
(11,4%) tout comme dans le corpus de Presse (11,5%). Cela est d&#251; &#224; l&#8217;utilisation de pronoms d&#233;monstratifs tels
que c&#8217; et &#231;a l&#224; o&#249; d&#8217;autres langues utiliseraient plut&#244;t un pronom expl&#233;tif (par exemple, it ou there en anglais).
Mais les chiffres les plus saillants concernent les pourcentages tr&#232;s &#233;lev&#233;s de pronoms clitiques en italien (50,5%
et 35,6%) par rapport au fran&#231;ais (19,5% et 11,8%) dans les deux corpus. Ces chiffres sont en partie motiv&#233;s par
des raisons linguistiques et en partie par des raisons de style. En ce qui concerne les raisons linguistiques, il y a
plus de verbes pronominaux en italien qu&#8217;en fran&#231;ais (1a, b). Pour ce qui est des raisons de style, au lieu du passif
classique en fran&#231;ais, on utilise plut&#244;t des tournures verbales pronominales en italien (1c, d).
</p>
<p>(1) a. Non posso muovermi. b. Ci piace leggere.
Je ne peux pas bouger. Nous aimons lire.
</p>
<p>c. 43 d&#233;fauts ont &#233;t&#233; constat&#233;s. d. Il parlait d&#8217;&#233;v&#233;nements survenus hier.
Si sono constatati 43 difetti. Parlava di avvenimenti verificatisi ieri.
</p>
<p>Les pourcentages obtenus pour le fran&#231;ais peuvent &#234;tre compar&#233;s avec ceux de Tutin (2002). Elle a notamment
compt&#233; les expressions anaphoriques dans dix articles &#233;conomiques du Monde (style de texte se rapprochant de
notre corpus de Presse) et dans le romanDe la Terre &#224; la Lune de Jules Verne (style litt&#233;raire se rapprochant du Petit
Prince). D&#8217;apr&#232;s ses comptages, entre 87% et 93,5% des expressions anaphoriques sont des pronoms personnels
(clitiques ou pleins) et des d&#233;terminants possessifs. M&#234;me si ses d&#233;finitions des classes de pronoms ne co&#239;ncident
pas compl&#232;tement avec les n&#244;tres, nous obtenons des chiffres comparables : entre 61,6% et 79,5% des pronoms
sont des pronoms personnels (clitiques ou pleins) et des d&#233;terminants possessifs (voir Table 2). Contrairement &#224;
nos corpus, Tutin ne trouve pas d&#8217;effet de style de texte dans le nombre de pronoms personnels et clitiques. Elle
ne comptabilise pas les pronoms de premi&#232;re et deuxi&#232;me personne, n&#8217;&#233;tant pas anaphoriques et n&#8217;&#233;tant pas aussi
fr&#233;quents dans son corpus que dans d&#8217;autres textes litt&#233;raires.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. RUSSO, Y. SCHERRER, J.-P. GOLDMAN, S. LO&#193;ICIGA, L. NERIMA, &#201;. WEHRLI
</p>
<p>4 Les ambigu&#239;t&#233;s d&#8217;analyse
</p>
<p>Dans les sections pr&#233;c&#233;dentes, la distribution des types de pronoms a &#233;t&#233; discut&#233;e sur la base de la r&#233;vision ma-
nuelle de l&#8217;&#233;tiquetage automatique de Fips. Dans cette section, nous comparons les annotations automatiques de
Fips aux r&#233;visions manuelles. La Table 3 montre la pr&#233;cision et le rappel pour les quatre langues. Elle doit &#234;tre lue
comme suit : la pr&#233;cision d&#233;crit le pourcentage de pronoms &#233;tiquet&#233;s correctement par Fips. Le rappel d&#233;crit le
pourcentage de pronoms corrects trouv&#233;s par Fips. Par exemple, 86% des pronoms d&#233;monstratifs anglais d&#233;tect&#233;s
par Fips ont &#233;t&#233; confirm&#233; par les annotateurs humains (pr&#233;cision). Parmi tous les pronoms d&#233;monstratifs trouv&#233;s
par les annotateurs humains, 98% ont d&#233;j&#224; &#233;t&#233; &#233;tiquet&#233;s comme tels par Fips (rappel).
</p>
<p>Certaines cat&#233;gories, comme les possessifs anglais ou les d&#233;monstratifs italiens (Table 3), ne posent aucun pro-
bl&#232;me d&#8217;analyse, &#233;tant des formes non ambig&#252;es. En revanche, d&#8217;autres cat&#233;gories posent plus de probl&#232;mes,
comme les interrogatifs en italien avec seulement 16% de pr&#233;cision. Cela est principalement d&#251; &#224; des ambigu&#239;t&#233;s
linguistiques que Fips n&#8217;arrive pas &#224; r&#233;soudre. Nous d&#233;crivons maintenant, langue par langue, ces cas probl&#233;ma-
tiques.
</p>
<p>Anglais Allemand Fran&#231;ais Italien
Pr&#233;cision Rappel Pr&#233;cision Rappel Pr&#233;cision Rappel Pr&#233;cision Rappel
</p>
<p>CLI 96% 98% 96% 100%
PERS 97% 100% 99% 100% 93% 99% 99% 99%
POSS 100% 100% 97% 99% 99% 99% 96% 99%
DEM 86% 98% 76% 82% 100% 99% 100% 100%
REL 100% 90% 36% 89% 92% 84% 92% 84%
INDEF 86% 55% 72% 99% 92% 100% 67% 100%
INTER 55% 100% 83% 100% 33% 81% 16% 82%
</p>
<p>TABLE 3 &#8211; Pr&#233;cision et rappel des &#233;tiquetages propos&#233;es par Fips, les deux corpus confondus.
</p>
<p>En anglais, le mauvais rappel dans la cat&#233;gorie des ind&#233;finis (55%) est d&#251; au pronom expl&#233;tif there (par exemple,
dans l&#8217;expression there is. . . &#8216;il y a . . .&#8217;). Fips l&#8217;&#233;tiquette comme un pronom personnel, alors que nous l&#8217;avons
annot&#233; plut&#244;t comme un ind&#233;fini. Ici, il ne s&#8217;agit donc pas d&#8217;une ambigu&#239;t&#233; &#224; proprement parler, mais plut&#244;t d&#8217;une
divergence dans l&#8217;interpr&#233;tation linguistique.
</p>
<p>Le faible pourcentage de la pr&#233;cision des pronoms interrogatifs (55%) provient des pronoms ind&#233;finis comme
nobody, anybody &#8216;personne&#8217;, class&#233;s par Fips comme des pronoms interrogatifs. De m&#234;me, what est &#233;tiquet&#233;
comme un interrogatif dans des phrases telles que (2) alors qu&#8217;il introduit une phrase relative.
</p>
<p>(2) But he was in Turkish costume, and so nobody would believe what he said.
Mais il portait un costume turc, et personne n&#8217;avait cru ce qu&#8217;il disait.
</p>
<p>Une derni&#232;re difficult&#233; concerne le mot that, pour lequel Fips confond les fonctions de pronom relatif (90% de
rappel) et de pronom d&#233;monstratif (86% de pr&#233;cision, 98% de rappel).
</p>
<p>En allemand, il existe plusieurs cas d&#8217;ambigu&#239;t&#233; entre d&#233;terminants et pronoms. Le d&#233;terminant d&#233;fini (der, die,
das, den, . . .) (3a) est homographe au pronom relatif (3b), et les m&#234;mes formes peuvent aussi &#234;tre utilis&#233;es dans
certains cas comme pronom d&#233;monstratif (3c). 5 Cela explique les pourcentages particuli&#232;rement bas des pronoms
relatifs et d&#233;monstratifs (36% et 76% de pr&#233;cision, 89% et 82% de rappel).
</p>
<p>(3) a. Das Bundesamt f&#252;r Verkehr.
L&#8217; office f&#233;d&#233;ral des transports.
</p>
<p>b. Ich habe ein Haus gesehen, das hunderttausend Franken wert ist.
J&#8217;ai vu une maison qui vaut cent mille francs.
</p>
<p>c. Das ist ein Hut.
Ceci est un chapeau.
</p>
<p>Quant au d&#233;terminant ind&#233;fini (ein, eine, einen, . . .), certaines formes fl&#233;chies sont communes avec un pronom
</p>
<p>5. Le pronom relatif en allemand est obligatoirement pr&#233;c&#233;d&#233; d&#8217;une virgule ou d&#8217;une pr&#233;position elle-m&#234;me pr&#233;c&#233;d&#233;e d&#8217;une virgule. Cet
indice typographique pourrait &#234;tre mis &#224; profit dans une proc&#233;dure de d&#233;sambigu&#239;sation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;TUDE INTER-LANGUES DE LA DISTRIBUTION ET DES AMBIGU&#207;T&#201;S SYNTAXIQUES DES PRONOMS
</p>
<p>ind&#233;fini. Fips a tendance &#224; surg&#233;n&#233;rer des analyses comme pronom ind&#233;fini et &#224; sous-g&#233;n&#233;rer des analyses comme
d&#233;terminant. Cela explique des valeurs de pr&#233;cision basses (72%).
</p>
<p>En fran&#231;ais et en italien, la difficult&#233; principale concerne l&#8217;ambigu&#239;t&#233; orthographique des pronoms relatifs (4a, b)
et des pronoms interrogatifs (4c) (que et qui en fran&#231;ais, che en italien). 6 Les formes que et che peuvent encore
&#234;tre des conjonctions introduisant une phrase subordonn&#233;e (4d). Dans les deux langues, Fips surg&#233;n&#232;re des pro-
noms interrogatifs &#224; la place de pronoms relatifs ou de conjonctions, d&#8217;o&#249; des chiffres de pr&#233;cision tr&#232;s bas (33%
en fran&#231;ais, 16% en italien).
</p>
<p>(4) a. Il repr&#233;sentait un serpent boa qui dig&#233;rait un &#233;l&#233;phant.
Era il disegno di un boa che digeriva un elefante.
</p>
<p>b. Voil&#224; le meilleur portrait que j&#8217;ai r&#233;ussi &#224; faire de lui.
Ecco il migliore ritratto che riuscii a fare di lui.
</p>
<p>c. Que fais-tu ?
Che fai ?
</p>
<p>d. Crois-tu qu&#8217;il faille beaucoup d&#8217;herbe &#224; ce mouton ?
Pensi che questa pecora necessiti di una gran quantit&#224; d&#8217;erba ?
</p>
<p>5 Les analyses incompl&#232;tes
</p>
<p>L&#8217;avantage principal de l&#8217;utilisation d&#8217;un analyseur syntaxique comme Fips pour l&#8217;&#233;tiquetage des pronoms est
l&#8217;acc&#232;s &#224; des structures syntaxiques. En effet, si beaucoup d&#8217;&#233;tiqueteurs basent leurs d&#233;cisions sur un contexte local
(par exemple, des trigrammes de mots), Fips utilise la structure globale de la phrase pour l&#8217;&#233;tiquetage. Lorsque
Fips n&#8217;arrive pas &#224; construire un arbre syntaxique pour la phrase enti&#232;re, il construit plusieurs arbres syntaxiques
partiels et d&#233;rive les &#233;tiquettes morpho-syntaxiques &#224; partir de ceux-ci. &#201;videmment, ces analyses incompl&#232;tes
peuvent avoir un impact n&#233;gatif sur la qualit&#233; de l&#8217;&#233;tiquetage. C&#8217;est sur cet aspect que nous nous focalisons dans
cette section.
</p>
<p>Plus pr&#233;cisement, nous consid&#233;rons ici toutes les phrases qui ont &#233;t&#233; analys&#233;es compl&#232;tement. Ceci correspond &#224;
approximativement 80% des phrases du corpus pour l&#8217;anglais, le fran&#231;ais et l&#8217;italien, et &#224; 60% des phrases pour
l&#8217;allemand. Les chiffres que nous pr&#233;sentons dans la Table 4 se r&#233;f&#232;rent donc &#224; ce sous-ensemble du corpus.
</p>
<p>Anglais Allemand Fran&#231;ais Italien
Pr&#233;cision Rappel Pr&#233;cision Rappel Pr&#233;cision Rappel Pr&#233;cision Rappel
</p>
<p>CLI 99% 97% 98% 100%
PERS 98% 100% 99% 100% 95% 100% 100% 98%
POSS 100% 100% 100% 98% 100% 100% 99% 100%
DEM 95% 97% 92% 86% 100% 100% 100% 100%
REL 100% 86% 60% 100% 95% 100% 81% 93%
INDEF 96% 69% 90% 97% 100% 100% 67% 100%
INTER 60% 100% 100% 100% 86% 86% 50% 80%
</p>
<p>TABLE 4 &#8211; Pr&#233;cision et rappel des &#233;tiquetages propos&#233;es par Fips, en tenant compte uniquement des phrases
analys&#233;es compl&#232;tement.
</p>
<p>On constate que la pr&#233;cision des &#233;tiquetages augmente de mani&#232;re importante dans certaines cat&#233;gories. En parti-
culier, Fips trouve moins de pronoms interrogatifs et de pronoms relatifs et la pr&#233;cision de leur &#233;tiquetage est plus
&#233;lev&#233;e (de 33% &#224; 86% pour les interrogatifs fran&#231;ais, de 16% &#224; 50% pour les interrogatifs italiens, si l&#8217;on compare
les Tables 3 et 4.). Dans le cas d&#8217;une analyse incompl&#232;te, Fips n&#8217;arrive souvent pas &#224; identifier l&#8217;ant&#233;c&#233;dent d&#8217;un
pronom relatif. En cons&#233;quence, il pr&#233;f&#232;re une lecture interrogative (par exemple pour qui/que en fran&#231;ais) ou une
lecture d&#233;monstrative (par exemple pour der/die/das en allemand).
</p>
<p>Ces r&#233;sultats sugg&#232;rent aussi que dans les phrases non analys&#233;es, beaucoup de mots &#233;tiquet&#233;s comme pronoms sont
</p>
<p>6. Contrairement au fran&#231;ais, qui a deux formes distinctes du pronom relatif en fonction de sujet (qui ) et d&#8217;objet direct (que), en italien il
n&#8217;existe qu&#8217;une seule forme (che) pour les deux cas. Pour une &#233;tude plus d&#233;taill&#233;e des diff&#233;rences linguistiques entre ces deux langues, voir
par exemple Arcaini (2000).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. RUSSO, Y. SCHERRER, J.-P. GOLDMAN, S. LO&#193;ICIGA, L. NERIMA, &#201;. WEHRLI
</p>
<p>en r&#233;alit&#233; des conjonctions, comme d&#233;j&#224; expliqu&#233; dans l&#8217;exemple (4d). Une piste de recherches futures concernera
donc l&#8217;am&#233;lioration des analyses afin de limiter ce type d&#8217;erreurs lors de l&#8217;&#233;tiquetage.
</p>
<p>6 Conclusion
</p>
<p>Le travail que nous avons pr&#233;sent&#233; s&#8217;est donn&#233; comme but de r&#233;pondre &#224; trois questions concernant la distribu-
tion des pronoms. Nous avons &#233;tiquet&#233; deux corpus diff&#233;rents dans quatre langues et nous avons trouv&#233; que le
nombre de pronoms varie selon le texte et selon la langue. En particulier, notre corpus litt&#233;raire est caract&#233;ris&#233;
par un nombre &#233;lev&#233; de pronoms personnels, tandis que le corpus de Presse contient des phrases plus longues et
plus complexes, avec des pronoms relatifs plus fr&#233;quents. Nous avons &#233;galement discut&#233; des erreurs d&#8217;annotation
faites par l&#8217;analyseur syntaxique Fips. Il en est ressorti que certaines cat&#233;gories de pronoms sont plus ambigu&#235;s
que d&#8217;autres et que la compl&#233;tude de l&#8217;analyse est un facteur crucial pour une d&#233;sambiguisation correcte. Nous
envisageons donc d&#8217;am&#233;liorer la qualit&#233; des analyses syntaxiques.
</p>
<p>Certains cas d&#8217;ambigu&#239;t&#233;s inter-cat&#233;gories ont &#233;t&#233; aussi discut&#233;s. Il existe, cependant, des cas o&#249; un pronom peut
avoir diff&#233;rentes lectures dans la m&#234;me cat&#233;gorie pronominale (ambigu&#239;t&#233;s intra-cat&#233;gories). Par exemple, &#224; l&#8217;in-
t&#233;rieur de ce que nous avons nomm&#233; pronoms personnels, on trouve en fran&#231;ais &#224; la fois le il impersonnel et le
il anaphorique. 7 On ne fait pas non plus de distinctions entre les diff&#233;rentes interpr&#233;tations du sie allemand (3e
personne singulier du f&#233;minin, 3e personne pluriel, et forme de politesse). Pourtant, ces diff&#233;rences sont cruciales
pour la r&#233;solution des anaphores et pour la traduction automatique. Elles vont faire l&#8217;objet d&#8217;une &#233;tude future.
</p>
<p>De plus, nous aimerions examiner plus en d&#233;tail l&#8217;impact du style de texte. D&#8217;une part, l&#8217;analyse d&#8217;autres textes
litt&#233;raires nous permettra d&#8217;obtenir des g&#233;n&#233;ralisations concernant les diff&#233;rences de genre. D&#8217;autre part, il s&#8217;agira
d&#8217;examiner s&#8217;il existe un effet de traduction, comme en partie d&#233;j&#224; mis en &#233;vidence par les exemples en (1). On
pourrait par exemple s&#8217;attendre &#224; des diff&#233;rences dans la distribution de pronoms selon que l&#8217;original du texte est
en fran&#231;ais ou en allemand.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ARCAINI E. (2000). Italiano e francese. Un&#8217;analisi comparativa. Turin : Paravia/Scriptorium.
DANLOS L. (2005). ILIMP : Outil pour rep&#233;rer les occurrences du pronom impersonnel il. In Actes de TALN&#8217;05,
p. 123&#8211;132, Dourdan.
HARDMEIER C. &amp; FEDERICO M. (2010). Modelling pronominal anaphora in statistical machine translation. In
Proceedings of the 7th International Workshop on Spoken Language Translation, Paris.
LAPPIN S. &amp; LEASS H. J. (1994). An algorithm for pronominal anaphora resolution. Computational Linguistics,
20(4), 535&#8211;561.
LAURENT D. (2001). De la r&#233;solution des anaphores. Rapport interne, Synapse D&#233;veloppement.
MITKOV R., EVANS R. &amp; ORA&#774;SAN C. (2002). A new, fully automatic version of Mitkov&#8217;s knowledge-poor
pronoun resolution method. In Proceedings of CICLing&#8217;02, Mexico City.
MITKOV R., EVANS R., ORA&#774;SAN C., HA L. &amp; PEKAR V. (2007). Anaphora resolution : To what extent does it
help NLP applications ? In A. BRANCO, Ed., Anaphora : Analysis, Algorithms and Applications, p. 179 &#8211; 190 :
Springer.
SCHERRER Y., RUSSO L., GOLDMAN J.-P., LO&#193;ICIGA S., NERIMA L. &amp; WEHRLI E. (2011). La traduction
automatique des pronoms. Probl&#232;mes et perspectives. In Actes de TALN&#8217;11, Montpellier.
TROUILLEUX F. (2002). A rule based pronoun resolution system for French. In Proceedings of Discourse
Anaphora and Anaphor Resolution Colloquium (DAARC 2002), Lisbonne.
TUTIN A. (2002). A corpus-based study of pronominal anaphoric expressions in French. In Proceedings of
DAARC 2002 (Discourse Anaphora and Anaphora Resolution), Lisbonne.
WEHRLI E. (2007). Fips, a &#8220;deep&#8221; linguistic multilingual parser. In Proceedings of the ACL 2007 Workshop on
Deep Linguistic Processing, p. 120&#8211;127, Prague.
</p>
<p>7. Nous renvoyons, &#224; ce propos, aux trauvaux de Danlos (2005) sur un syst&#232;me qui r&#233;cup&#232;re les occurrences du pronom impersonnel il.</p>

</div></div>
</body></html>