<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Syst&#232;me d&#8217;analyse de la polarit&#233; de d&#233;p&#234;ches financi&#232;res</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Syst&#232;me d&#8217;analyse de la polarit&#233; de d&#233;p&#234;ches financi&#232;res
</p>
<p>Michel G&#233;n&#233;reux
Centro de Lingu&#237;stica da Universidade de Lisboa
</p>
<p>Av. Prof. Gama Pinto, 2
1649-003 Lisboa - Portugal
</p>
<p>genereux@clul.ul.pt
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons un syst&#232;me pour la classification en continu de d&#233;p&#234;ches financi&#232;res selon une
polarit&#233; positive ou n&#233;gative. La d&#233;monstration permettra ainsi d&#8217;observer quelles sont les d&#233;p&#234;ches les plus &#224;
m&#234;me de faire varier la valeur d&#8217;actions cot&#233;es en bourse, au moment m&#234;me de la d&#233;monstration. Le syst&#232;me
traitera de d&#233;p&#234;ches &#233;crites en anglais et en fran&#231;ais.
</p>
<p>Abstract. We present a system for classifying on-line financial news items into a positive or negative po-
larity. The demonstration will therefore allow us to observe which news are most likely to influence the price of
shares traded at the time of the demonstration. The system will cover news items written in English and French.
</p>
<p>Mots-cl&#233;s : Analyse de Sentiments, Linguistique de Corpus, D&#233;p&#234;ches Financi&#232;res.
</p>
<p>Keywords: Sentiment Analysis, Corpus Linguistics, Financial News Items.
</p>
<p>Description
</p>
<p>Nous avons men&#233; des travaux sur l&#8217;analyse de sentiments en utilisant comme domaine d&#8217;investigation celui de la
finance (G&#233;n&#233;reux et al., 2011). Nous faisions l&#8217;hypoth&#232;se que la r&#233;action du march&#233; suite &#224; la publication d&#8217;une
d&#233;p&#234;che reli&#233;e &#224; une action particuli&#232;re est un bon indicateur de la polarit&#233; de la nouvelle, et qu&#8217;un algorithme
d&#8217;apprentissage &#224; partir de ces d&#233;p&#234;ches permet de construire un syst&#232;me qui donne &#224; l&#8217;investisseur une source
d&#8217;information suppl&#233;mentaire qui peut &#234;tre exploit&#233;e de fa&#231;on avantageuse dans une strat&#233;gie d&#8217;investissement.
Dans cette d&#233;monstration, nous voulons donner un aper&#231;u des possibilit&#233;s offertes par ce genre d&#8217;analyse dans une
situation concr&#232;te o&#249; des d&#233;p&#234;ches sont examin&#233;es et class&#233;es d&#232;s leur publication. Notre syst&#232;me effectue l&#8217;ap-
prentissage d&#8217;un mod&#232;le pour la classification polaire (positif ou n&#233;gatif) &#224; partir de d&#233;p&#234;ches d&#233;j&#224; annot&#233;es selon
qu&#8217;elles pr&#233;c&#232;dent une hausse ou une baisse de la valeur d&#8217;une action particuli&#232;re. Selon cette perspective, toute
d&#233;p&#234;che pr&#233;c&#233;dent une hausse significative de la valeur d&#8217;une action sera annot&#233;e comme positive, n&#233;gative dans
le cas contraire. Ces d&#233;p&#234;ches annot&#233;es nous permettent d&#8217;&#233;tablir un lexique de termes financiers discriminants
servant &#224; construire un classifieur SVM. Notre d&#233;monstrateur classifie les d&#233;p&#234;ches en continu, i.e. qu&#8217;il analyse
les flots de d&#233;p&#234;ches en format RSS telles que fournies par des sites sp&#233;cialis&#233;s dans la finance (e.g. Financial
Times, Les &#201;chos). Lorsqu&#8217;une d&#233;p&#234;che pr&#233;sente une orientation non-neutre, elle est mise en &#233;vidence par le sys-
t&#232;me, permettant &#224; un investisseur potentiel de se concentrer sur les d&#233;p&#234;ches ayant, en principe, une plus grande
probabilit&#233; de faire varier la valeur de l&#8217;action vis&#233;e par la d&#233;p&#234;che. Certes, la taille restreinte de certaines d&#233;p&#234;ches
que l&#8217;on retrouve sur les flux RSS limite la port&#233;e d&#8217;une approche comme la n&#244;tre bas&#233;e sur la s&#233;lection de traits
lexicaux, et les co&#251;ts de transaction requi&#232;rent que les gains potentiels soient significativement au-del&#224; de la mise
de d&#233;part. N&#233;anmoins, la d&#233;monstration permettra &#224; l&#8217;utilisateur de se faire une id&#233;e du potentiel d&#8217;exploitation de
l&#8217;analyse de sentiments comme strat&#233;gie (partielle) d&#8217;investissement financier.
</p>
<p>R&#233;f&#233;rences
</p>
<p>G&#201;N&#201;REUX M., POIBEAU T. &amp; KOPPEL M. (2011). Sentiment analysis using automatically labelled finan-
cial news items, In Affective Computing and Sentiment Analysis : Metaphor, Ontology, Affect and Terminology,
chapter 9, p. 111&#8211;126. Springer Verlag.</p>

</div></div>
</body></html>