<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Communaut&#233;s Internet comme sources de pr&#233;terminologie</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>Communaut&#233;s Internet comme sources de pr&#233;terminologie  
</p>
<p>Mohammad Daoud, Christian Boitet 
</p>
<p>Laboratoire LIG &#8212; Universit&#233; Joseph Fourier &#8212; 385, rue de la Biblioth&#232;que, 38041 Grenoble, France 
{Mohammad.Daoud, Christian.Boitet }@imag.fr 
</p>
<p>R&#233;sum&#233;  
Cet article d&#233;crit deux exp&#233;riences sur la construction de ressources terminologiques multilingues (preterminologies) 
pr&#233;liminaires, mais grandes, gr&#226;ce &#224; des communaut&#233;s Internet, et s'appuie sur ces exp&#233;riences pour cibler des donn&#233;es 
terminologiques plus raffin&#233;es venant de communaut&#233;s Internet et d'applications Web 2.0. La premi&#232;re exp&#233;rience est 
une passerelle de contribution pour le site Web de la Route de la Soie num&#233;rique (DSR). Les visiteurs contribuent en 
effet &#224; un r&#233;f&#233;rentiel lexical multilingue d&#233;di&#233;, pendant qu'ils visitent et lisent les livres archiv&#233;s, parce qu'ils sont 
int&#233;ress&#233;s par le domaine et ont tendance &#224; &#234;tre polygottes. Nous avons recueilli 1400 contributions lexicales en 4 mois. 
La seconde exp&#233;rience est bas&#233;e sur le JeuxDeMots arabe, o&#249; les joueurs en ligne contribuent &#224; un r&#233;seau lexical arabe. 
L'exp&#233;rience a entra&#238;n&#233; une croissance r&#233;guli&#232;re du nombre de joueurs et de contributions, ces derni&#232;res contenant des 
termes absents et des mots de dialectes oraux.  
</p>
<p>Mots-cl&#233;s: terminologie, pr&#233;terminologie, approches collaboratives, r&#233;seaux lexicaux, DSR, jeux s&#233;rieux.  
</p>
<p>Abstract 
</p>
<p>This paper describes two experiments on building preliminary but large multilingual terminological resources 
(preterminologies) through Internet communities, and draws on these experiments to target more refined terminological 
data from Internet communities and Web 2.0 applications. The first experiment is a contribution gateway for the Digital 
Silk Road (DSR) website. Visitors indeed contribute to a dedicated multilingual lexical repository while they visit and 
read the archived books, because they are interested in the domain and tend to be multilingual. We collected 1400 
lexical contributions in 4 months. The second experiment is based on the Arabic JeuxDeMots, where online players 
contribute to an Arabic lexical network. The experiment resulted in a steady growth of number of players and 
contributions, the latter containing absent terms and spoken dialectic words. 
</p>
<p>Keywords: terminology, preterminology, collaborative approaches, lexical networks, DSR, serious games.  
</p>
<p>1 Introduction  
</p>
<p>Construire des ressources terminologiques multilingue pour un domaine est une t&#226;che difficile et compliqu&#233;e, car la 
terminologie repr&#233;sente la structure conceptuelle d'un domaine en utilisant un ensemble d'unit&#233;s lexicales dans une 
langue particuli&#232;re. Cette structure conceptuelle est plus dynamique et change plus vite que sa repr&#233;sentation 
symbolique (terminologie). En outre, toutes les communaut&#233;s de langues diff&#233;rentes ne partagent pas le m&#234;me int&#233;r&#234;t 
dans un domaine donn&#233;. Par exemple, l'arabe est consid&#233;r&#233; comme une langue pauvrement dot&#233;e en ressources 
linguistiques (Yassin, 2003) (Diab, Habash, 2009), en particulier dans les domaines de la science et de la technologie, 
tandis que l'anglais et le fran&#231;ais ont une terminologie beaucoup plus riche dans ces domaines. Classiquement, pour 
construire des ressources terminologiques, une banque de termes est construite par des terminologues: le domaine 
consid&#233;r&#233; est &#233;tudi&#233; et des documents sont consult&#233;s pour en extraire les termes pertinents. Cette approche d&#233;pend 
fortement de terminologues et de financement par de grandes organisations, elle est donc tr&#232;s co&#251;teuse.  
</p>
<p>De nombreux chercheurs ont &#233;t&#233; &#224; la recherche d'alternatives (Kageura, Umino, 1998) (Joubert, Lafourcade, 2008) 
(Nagata et al., 2001). Les approches contributives (Ahn, 2005) &#224; la collecte de connaissances semblent prometteuses &#224; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MOHAMMAD DAOUD, CHRISTIAN BOITET 
</p>
<p> 
</p>
<p>beaucoup d'entre eux, mais ne sont pas pratiques, car elles n&#233;cessitent des b&#233;n&#233;voles motiv&#233;s qui sont capables de 
participer &#224; un processus de construction d'une base lexicale. Nous avons propos&#233; d'abaisser les attentes (1) en nous 
appuyant sur des volontaires en ligne et (2) en collectant de la pr&#233;terminologie (Daoud et al., 2009) plut&#244;t que de la 
terminologie. Nous avons essay&#233; de motiver les internautes &#224; contribuer par des interactions directes et indirectes avec 
une communaut&#233; Internet. Nous avons exp&#233;riment&#233; cette solution avec le site Web de la Route de la Soie Num&#233;rique 
(Digital Silk Road), et le JeuxDeMots arabe. La section suivante montre bri&#232;vement l'approche contributive propos&#233;e. 
La section 3 d&#233;crit les r&#233;sultats exp&#233;rimentaux de l'approche directe de collaboration sur DSR. Et la section 4 pr&#233;sente 
l'exp&#233;rience faite avec JeuDeMots arabe.  
</p>
<p>2 Projet d'expansion de ressources multilingues terminologiques  
</p>
<p>2.1 Objectif  
</p>
<p>La figure 1 montre une estimation simplifi&#233;e des ressources disponibles dans plusieurs langues.  Nous essayons d'&#233;largir 
la sph&#232;re terminologique, en trouvant la &#171; terminologie cach&#233;e &#187; &#224; partir de la zone bleue (unit&#233;s lexicales utilis&#233;es par 
les communaut&#233;s comme des termes techniques).  
</p>
<p>Parce qu'il est difficile de produire une information terminologique compl&#232;te &#224; partir de la sph&#232;re lexicale, nous visons 
une ressource pr&#233;liminaire appel&#233;e pr&#233;terminologie (Daoud et al., 2009), et nous la repr&#233;sentons &#224; l'aide d'une structure 
de graphe appel&#233;e MPG (Multilingual Preterminological Graph). Un n&#339;ud repr&#233;sente un pr&#233;terme et un arc repr&#233;sente 
une relation non confirm&#233;e entre deux termes.  
</p>
<p> 
</p>
<p> 
</p>
<p> 
</p>
<p>Figure 1: objectif principal (expansion de la sph&#232;re terminologique) 
</p>
<p>2.2 Ressources non classiques  
</p>
<p>Traditionnellement, une base de termes est construite par des terminologues, qui &#233;tudient le domaine, construisent sa 
taxonomie, consultent des documents pertinents pour extraire les termes (manuellement ou semi-automatiquement), 
puis traduisent les termes extraits. Le processus est difficile et influe sur la couverture de la base produite. Pour agrandir 
la sph&#232;re terminologique, nous proposons d'exploiter des ressources non conventionnelles, &#224; partir de ce qui est 
disponible et ce qui peut &#234;tre extrait &#224; partir de ressources num&#233;riques, telles que des bases terminologiques, des corpus, 
des dictionnaires lisibles par machine (MRD), des syst&#232;mes de traduction automatique, des encyclop&#233;dies et des 
glossaires locaux.  
</p>
<p>A c&#244;t&#233; de cela, nous nous concentrons sur la communaut&#233; Internet comme une source de pr&#233;terminologie multilingue. 
Comme les internautes interagissent avec des sites Web sur une base quotidienne, ces interactions peuvent conduire &#224; 
des contributions. Nous classons ces interactions en:  
</p>
<p>&#8226; Explicites:  
&#8226; Interaction directe: PanImages (Etzioni et al. 2007)  
&#8226; Interaction indirecte: JeuxDeMots (www.lirmm.fr/jeuxdemots)  
</p>
<p>&#8226; Implicites:  
&#8226; Analyse de fichiers de log  
&#8226; Analyse du Web 2.0  
</p>
<p>L'initialisation du graphe pr&#233;terminologique multilingue en utilisant des ressources num&#233;riques s'est r&#233;v&#233;l&#233;e utile et 
essentielle. Toutefois, pour d&#233;couvrir la terminologie cach&#233;e, l'intervention humaine est n&#233;cessaire. Comme les 
professionnels co&#251;tent cher et ne sont pas disponibles, nous ciblons les contributions de b&#233;n&#233;voles. Nous avons &#233;tudi&#233; 
</p>
<p>Unit&#233;s lexicales, jusqu&#8217;&#224; 6M, ATLAS-II, The Translator&#8230; Lex&#232;mes 
techniques utilis&#233;s informellement 
</p>
<p>Terminologie multilingue 100-200K : IATE, UNTerm, FAOTerm&#8230; 
</p>
<p>Phras&#233;ologie </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>COMMUNAUT&#201;S INTERNET COMME SOURCES DE PR&#201;TERMINOLOGIE 
</p>
<p> 
</p>
<p>deux sc&#233;narios de contribution explicite (directe et indirecte), o&#249; les internautes sont activement impliqu&#233;s dans le 
processus de contribution lexicale.  
</p>
<p>2.3 Communaut&#233; Internet du Web 2.0  
</p>
<p>La deuxi&#232;me proposition d'intervention humaine dans la construction de banques de termes d&#233;pend des sites de partage 
et des r&#233;seaux sociaux. Cette participation n'est pas forc&#233;ment explicite, ce qui signifie que les contributeurs peuvent ne 
pas &#234;tre au courant du processus de contribution. En effet, leurs interactions sur Internet peuvent &#234;tre analys&#233;es en 
arri&#232;re-plan pour en extraire des connaissances terminologiques multilingues.  
</p>
<p>Cette approche est inspir&#233;e par le fait que les sites Web de partage produisent un nouveau type de corpus, et que les 
communaut&#233;s implicites qu'ils cr&#233;ent fa&#231;onnent dynamiquement des domaines de connaissance et cr&#233;ent des centaines 
de termes chaque semaine. Les approches automatiques actuelles ne sont pas suffisantes pour g&#233;rer cette grande 
quantit&#233; de connaissances produites quotidiennement, et les approches collaboratives ne peuvent pas y arriver non plus. 
Par exemple, chaque semaine, plus de 2 millions de microblogs (tweets) sont soumis &#224; twitter.com. Ces tweets 
contiennent de nombreux termes techniques, et certains d'entre eux sont marqu&#233;s par un di&#232;se (hashtag). Ces termes 
peuvent &#234;tre retrouv&#233;s et li&#233;s les uns aux autres dans un MPG en analysant en les contributions en ligne et les messages 
aux sites de partage. De cette fa&#231;on, les utilisateurs contribuent implicitement. Plus l'instant, nous n'avons exp&#233;riment&#233; 
nos approches &#224; la contribution active que sur des sites Web traditionnels.  
</p>
<p>3 Passerelle contributive au site DSR (Route de la Soie num&#233;rique)  
</p>
<p>3.1 Exp&#233;rimentation 
</p>
<p>Le projet Digital Silk Road (Ono et al., 2008) est une initiative lanc&#233;e par le National Institute of Informatics (Tokyo) et 
l'Organisation des Nations Unies (ONU) en 2002, pour archiver les ressources culturelles historiques concernant la 
Route de la Soie, en les num&#233;risant et les rendant accessibles et disponibles en ligne. Le projet comprend plusieurs sous-
projets, chacun d'entre eux travaillant sur un type de donn&#233;es sp&#233;cifique &#224; num&#233;riser. L'un des plus importants sous-
projets est l'archivage num&#233;rique des livres rares de la biblioth&#232;que Toyo Bunko. Dans le cadre de ce projet, beaucoup 
de livres anciens rares disponibles &#224; la biblioth&#232;que Toyo Bunko ont &#233;t&#233; num&#233;ris&#233;s en utilisant la technologie OCR 
(Optical Character Recognition). La collection num&#233;ris&#233;e en ligne contient 113 livres dans 11 langues diff&#233;rentes 
(anglais, fran&#231;ais, russe...), tous li&#233;s &#224; la Route de la Soie historique, comme les deux volumes de l'Ancien Khotan par 
Marc Aurel Stein. Il est souhaitable de construire une base multilingue de termes pour les ressources de la DSR, car elle 
a une communaut&#233; d'utilisateurs multilingue. Les approches traditionnelles collaboratives d&#233;pendent de professionnels 
ou de non-professionnels dans le d&#233;veloppement de ressources lexicales. Toutefois, l'activit&#233; de contribution elle-m&#234;me 
est g&#233;n&#233;ralement une activit&#233; linguistique ou lexicale au cours de laquelle un contributeur apporte de la connaissance 
terminologique en le voulant, dans un souci de contribution. L'approche propos&#233;e pour la contribution active &#224; la 
pr&#233;terminologie d&#233;pend de la possibilit&#233; de lier l'activit&#233; de contribution &#224; une activit&#233; tr&#232;s attrayante.  
</p>
<p>A titre exp&#233;rimental, la base pr&#233;terminologique MPG-DSR a &#233;t&#233; construite par des approches automatiques et a ensuite 
&#233;t&#233; &#233;tendue (1) par une passerelle contributive qui offre des activit&#233;s attrayantes aux visiteurs de la DSR, et (2) en 
recevant des contributions par le biais de ces services, en particulier, par les activit&#233;s Contribuer en Cherchant ((CWS, 
Contribute While Searching)), et Contribuer en Lisant ((CWR, Contribute While Reading)).  
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MOHAMMAD DAOUD, CHRISTIAN BOITET 
</p>
<p> 
</p>
<p>Figure 2: passerelle contributive pour la DSR  
La figure 2 montre une capture d'&#233;cran de la passerelle contributive, o&#249; un utilisateur peut s&#233;lectionner un terme du 
livre, le traduire et offrir de nouvelles traductions directement &#224; partir du m&#234;me &#233;cran.  
</p>
<p>3.2 R&#233;sultats et &#233;valuation 
</p>
<p>La figure 3 montre le nombre total de visites de la passerelle jusqu'&#224; la fin de chaque mois. D'avril 2010 &#224; ao&#251;t 2010, la 
passerelle a re&#231;u environ 580 visites, dont 180 (31%) ont conduit &#224; une contribution.  
</p>
<p>0
</p>
<p>100
</p>
<p>200
</p>
<p>300
</p>
<p>400
</p>
<p>500
</p>
<p>600
</p>
<p>700
</p>
<p>A pri l May June Jul y August
</p>
<p>Visi ts
</p>
<p> 
</p>
<p> Figure 3: Nombre cumul&#233; de visites &#224; la passerelle contribution de la DSR-MPG  
</p>
<p>0
</p>
<p>200
</p>
<p>400
</p>
<p>600
</p>
<p>800
</p>
<p>1000
</p>
<p>April May June July August
</p>
<p>Contributed Nodes
</p>
<p> 
</p>
<p>Figure 4: Nombre cumul&#233; de n&#339;uds contribu&#233;s sur la p&#233;riode  
Dans une session de contribution, plusieurs unit&#233;s lexicales peuvent &#234;tre contribu&#233;es. C'est pourquoi 920 unit&#233;s lexicales 
ont &#233;t&#233; recueillies en 180 sessions de contribution (figure 4). Cela repr&#233;sente environ 5,1 contributions lexicales par 
session de contribution.  
</p>
<p>Au cours d'une p&#233;riode de 4 mois, CWS ((Contribuer en Cherchant)) a re&#231;u 156 requ&#234;tes. La performance est similaire 
&#224; la performance du syst&#232;me actuel, quand les termes de recherche sont en anglais. Toutefois, le CWS a re&#231;u 68 
requ&#234;tes dans d'autres langues que l'anglais et le japonais. 44 de ces requ&#234;tes ont &#233;t&#233; traduits par MPG-DSR avec succ&#232;s, 
et des r&#233;sultats ont &#233;t&#233; trouv&#233;s, alors que la recherche monolingue n'avait trouv&#233; aucun r&#233;sultat pour ces requ&#234;tes. Le 
taux d'acc&#232;s est donc 44/68 = ~ 65%.  
</p>
<p>Les contributions en arabe ont &#233;t&#233; &#233;valu&#233;es: 345 termes sur 390 ont &#233;t&#233; correctement traduits (88,4%). La plupart des 
termes &#233;taient des termes multimots, et les 900 contributions ont ajout&#233; 540 nouveaux n&#339;uds au MPG.  
</p>
<p>Comme les 345 contributions provenaient d'environ 61 sessions contributives, 70 termes arabes de diff&#233;rentes s&#233;ances 
(environ 1 terme de chaque session contributive) ont &#233;t&#233; s&#233;lectionn&#233;s et cherch&#233;s dans Alburaq et dans Google 
Dictionary. Les r&#233;sultats ont &#233;t&#233; les suivants (tableau 1): Les r&#233;sultats ont &#233;t&#233; les suivants (tableau 1):  
 
</p>
<p>Exemples de pr&#233;termes contribu&#233;s &#224; partir de DSR-MPG  Dictionnaire 
Google  
</p>
<p>Alburaq  
</p>
<p>Nombre de pr&#233;termes Nombre de pr&#233;termes  70 19 
Pourcentage  100%  37,1% 27,1% 
</p>
<p>Tableau 1: r&#233;sultats de la recherche d'un l'&#233;chantillon de pr&#233;termes contribu&#233;s  
</p>
<p>4 JeuxDeMots arabe  
</p>
<p>4.1 Exp&#233;rimentation  
</p>
<p>JeuxDeMots est un jeu en ligne qui vise &#224; recueillir des unit&#233;s lexicales, et &#224; construire des fonctions lexicales entre 
elles gr&#226;ce &#224; un processus de divertissement ; les donn&#233;es collect&#233;es sont stock&#233;es sous forme d'un graphe. Les joueurs </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>COMMUNAUT&#201;S INTERNET COMME SOURCES DE PR&#201;TERMINOLOGIE 
</p>
<p> 
</p>
<p>cr&#233;ent un compte pour jouer &#224; ce jeu. Apr&#232;s cela, au premier niveau du jeu, le jeu propose au joueur un terme et il a 1 
minute pour entrer autant qu'il le peut d'unit&#233;s lexicales associ&#233;es au terme donn&#233;. Si sa r&#233;ponse correspond &#224; la r&#233;ponse 
d'un joueur pr&#233;c&#233;dent sur m&#234;me terme, les deux gagnent des points et leur classement monte.  
</p>
<p>JeuxDeMots arabe a &#233;t&#233; initialis&#233; en utilisant un MPG bas&#233; sur l'arabe, en esp&#233;rant cela &#233;largirait le graphe et 
enrichirait son contenu. Ce paragraphe d&#233;crit les d&#233;tails techniques de l'int&#233;gration de notre syst&#232;me, SEpT (Syst&#232;me 
pour l'&#201;licitation de Pr&#233;terminologie), avec un jeu s&#233;rieux en ligne. Le JeuxDeMots arabe initial (JDMAR) 
(javalig.imag.fr/ jdmar/) a &#233;t&#233; localis&#233; par la traduction de ses interfaces en novembre 2009; et le public a commenc&#233; &#224; y 
jouer en janvier 2010.  
</p>
<p>4.2 R&#233;sultats  
</p>
<p>Le jeu a &#233;t&#233; &quot;ensemenc&#233;&quot; avec environ 750 termes arabes, choisis dans Alburaq.net. Il y a eu une croissance r&#233;guli&#232;re du 
nombre des joueurs inscrits, &#224; partir de janvier 2010. Notez que les visiteurs en ligne peuvent &#233;galement jouer sans 
inscription &#224; titre d'invit&#233;s. Jusqu'&#224; pr&#233;sent, nous avons environ 55 joueurs. La figure 5 montre la croissance du nombre 
de termes contribu&#233;s au cours de la p&#233;riode de 8 mois partant du 1er janvier 2010. La figure 6 montre la croissance du 
nombre de relations ajout&#233;es au graphe au cours de la m&#234;me p&#233;riode de 8 mois.  
</p>
<p>0
</p>
<p>200
</p>
<p>400
</p>
<p>600
</p>
<p>800
</p>
<p>1000
</p>
<p>1200
</p>
<p>1400
</p>
<p>1600
</p>
<p>Jan-10 Feb-10 Mar-10 Apr-10 May-10 Jun-10 Jul-10 Aug-10
</p>
<p>Relations
</p>
<p> 
</p>
<p>Figure 5: Nombre cumul&#233; de termes contribu&#233;s chaque mois  
</p>
<p>0
</p>
<p>500
</p>
<p>1000
</p>
<p>1500
</p>
<p>2000
</p>
<p>2500
</p>
<p>Jan-10 Feb-10 Mar-10 Apr-10 May-10 Jun-10 Jul-10 Aug-10
</p>
<p>Terms
</p>
<p> 
</p>
<p>Figure 6: nombre cumul&#233; de relations contribu&#233;es  
JDMAR a prouv&#233; le potentiel des contributions indirectes actives &#224; la pr&#233;terminologie d'une langue peu dot&#233;e telle que 
l'arabe, en maintenant un taux de croissance acceptable tout au long de l'exp&#233;rience, par rapport &#224; d'autres instances de 
JeuxDeMots, comme le JDM japonais.  
</p>
<p>Il a atteint son objectif de collecte de pr&#233;terminologie &#224; travers une activit&#233; non linguistique (non lexicale). Le deuxi&#232;me 
objectif, secondaire, &#233;tait d'attirer et de divertir des utilisateurs arabes. Le jeu a eu des joueurs fid&#232;les (et des invit&#233;s) de 
18 pays diff&#233;rents. 20 joueurs inscrits ont r&#233;pondu &#224; une question d'enqu&#234;te demandant s'ils jouent pour se divertir, ou 
seulement pour contribuer &#224; une ressource lexicale : 3/20 ont r&#233;pondu qu'ils jouent pour se divertir, 16/20 ont dit qu'ils 
jouent pour se divertir et pour contribuer, et 1/20 a dit qu'il ne joue que pour contribuer. Sur les 1400 relations 
contribu&#233;es, 200 relations ont &#233;t&#233; s&#233;lectionn&#233;es. Pr&#232;s de 175 sur 200 correspondaient &#224; une relation fonctionnelle ou 
ontologique significative, et 25 &#233;taient inexactes.  
</p>
<p>Pour tester la disponibilit&#233; du nouveau contenu dans la pr&#233;terminologie produite, 200 pr&#233;termess de JDMAR-MPG ont 
&#233;t&#233; s&#233;lectionn&#233;s au hasard. Seulement 125 ont &#233;t&#233; trouv&#233;s dans Alburaq.net, et seulement 65 ont &#233;t&#233; trouv&#233;s dans le 
WordNet arabe. La raison en est que la contribution active &#224; travers des jeux s&#233;rieux apporte de nouveaux pr&#233;termes et 
des termes dialectaux qui ne sont pas disponibles dans les ressources traditionnelles, comme par exemple les termes 
montr&#233;s dans le tableau 2.  
</p>
<p>Pr&#233;-termes en arabe  Translit&#233;ration  Traduction en anglais  
&#1603;&#1608;&#1576;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#1587;&#1610;&#1601;     feesbuk    facebook  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MOHAMMAD DAOUD, CHRISTIAN BOITET 
</p>
<p> 
</p>
<p> &#1585;&#1578;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#1610;&#1608;&#1578;     tweeter    twitter  
&#1591;&#1610;&#1585;&#4;&#4;&#4;&#4;&#4;&#1588; &#1578;&#1610;&#4;&#4;&#4;&#4;&#4;&#4;&#1587;&#1575;&#1603;    Kasit shareet    cassette  
&#1601;&#1610;&#1575;&#4;&#4;&#4;&#4;&#4;&#1591;&#1602;    qatayef    une sorte de cr&#234;pe sucr&#233;e  
&#1610;&#4;&#4;&#4;&#4;&#4;&#4;&#1726;&#1610;&#1580;&#1608;&#1578;    tawjeehi    l'&#233;cole secondaire  
&#1586;&#1608;&#4;&#4;&#4;&#4;&#4;&#4;&#1604;&#1601;&#1605;    mfalwez    quelqu'un qui a la grippe  
&#1607;&#1585;&#1575;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#4;&#1610;&#1610;&#1576;     bayyara     plantation d'agrumes  
</p>
<p>Tableau 2: Exemple de pr&#233;termes  
</p>
<p>Conclusions  
</p>
<p>Traditionnellement, les terminologues sont charg&#233;s d'&#233;laborer la terminologie. Leur travail sur un terme consiste &#224; 
construire la correspondance entre la repr&#233;sentation symbolique, le concept et l'information terminologique, pour placer 
le terme dans la &quot;sph&#232;re terminologique&quot; (gr&#226;ce &#224; des informations telles que les d&#233;finitions). Construire ces 
correspondances est une t&#226;che &#233;puisante qui influe sur le co&#251;t et la couverture. D'autre part, les approches collaboratives 
essayent de pr&#233;parer le travail des terminologues par des b&#233;n&#233;voles amateurs, ce qui est une tendance prometteuse dans 
l'acquisition de connaissances. Cependant, il peut &#234;tre difficile d'amener les b&#233;n&#233;voles &#224; participer &#224; une activit&#233; 
linguistique, m&#234;me s'ils sont r&#233;ellement familiers avec le domaine.  
</p>
<p>Les approches automatiques utilisent des ressources textuelles et lexicales pour d&#233;velopper la terminologie, mais elles 
sont limit&#233;es aux ressources disponibles et aux techniques classiques. Aussi, toutes les connaissances terminologiques 
ne sont pas disponibles en format textuel (terminologie latente). D'ailleurs, m&#234;me lorsque les approches automatiques 
sont efficaces pour trouver des termes, il est difficile de construire les m&#234;mes correspondances que celles &#233;tablies par 
des terminologues.  
</p>
<p>Cet article d&#233;crit deux exp&#233;riences pr&#233;liminaires sur la cr&#233;ation de ressources terminologiques multilingues 
pr&#233;liminaires (pr&#233;terminologie) &#224; travers une approche alternative (la &quot;soci&#233;t&#233; Internet&quot;). Le JeuxDeMots arabe a atteint 
son but qui &#233;tait de divertir des joueurs en ligne quelconques tout en recueillant une quantit&#233; importante de pr&#233;termes et 
de relations. Son contenu (pr&#233;termes, et correspondances monolingues) est unique et contient des mots du langage parl&#233; 
qui ne sont pas disponibles dans les bases de donn&#233;es standard, et le taux de croissance a &#233;t&#233; stable et prometteur.  
</p>
<p>L'autre contribution technique active d'autres est directe, bien que le processus de contribution s'inscrive dans une 
activit&#233; non linguistique qui est une activit&#233; normale de la communaut&#233; en ligne elle-m&#234;me. Les activit&#233;s Contribuer en 
Lisant ((CWR)) et Contribuer en Cherchant ((CWS)) ont montr&#233; un bon potentiel pour attirer des contributions 
d'experts du domaine dans la moyenne. Les donn&#233;es contribu&#233;es ont un caract&#232;re distinctif parce qu'elles ne figuraient 
pas dans des ressources num&#233;riques, et qu'un faible pourcentage des termes contribu&#233;s &#233;tait couvert par les dictionnaires 
classiques.  
</p>
<p>References  
</p>
<p>AHN, L. V. (2005). Human Computation. Computer Science. Pittsburgh, Carnegie Mellon University PhD degree, 87 p. 
DAOUD, M., C. BOITET, ET AL. (2009). Constructing multilingual preterminological graphs using various online 
community resources. SNLP2009, Thailand, 116-121.  
</p>
<p>DIAB, M. AND N. HABASH (2009). Arabic Dialect Processing. MEDAR09. April, 2009, Cairo, Egypt. Tutorial. 
ETZIONI, O., K. REITER, ET AL. (2007). Lexical translation with application to image searching on the web. MT Summit 
XI, Copenhagen, Denmark, 175-182. 
JOUBERT, A. AND M. LAFOURCADE (2008). JeuxDeMots : un prototype ludique pour l&#8217;&#233;mergence de relations entre 
termes. JADT'2008, Ecole normale sup&#233;rieure Lettres et sciences humaines, Lyon, France, 657-666. 
KAGEURA, K. AND B. UMINO (1998). Methods of automatic term recognition. Terminology: International Journal of 
Theoretical and Applied Issues in Specialized Communication, vol. 3 (2), 259-289. 
NAGATA, M., T. SAITO, ET AL. (2001). Using the web as a bilingual dictionary. Proceedings of the workshop on Data-
driven methods in machine translation, vol. 14, 1-8. 
ONO, K., A. KITAMOTO, ET AL. (2008). Memory of the Silk Road &#8212; The Digital Silk Road Project. Proceedings of 
(VSMM08), Project Papers, Limassol, Cyprus, 437-444. 
YASSIN, Y. A. (2003). Why Arabic Is the Most Difficult Language for Localization. Globalization Insider, Vol. XII, 5 p. </p>

</div></div>
</body></html>