<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;veloppement d&#8217;un syst&#232;me de d&#233;tection des infections associ&#233;es aux soins &#224; partir de l&#8217;analyse de comptes-rendus d&#8217;hospitalisation</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
 
</p>
<p>D&#233;veloppement d&#8217;un syst&#232;me de d&#233;tection des infections associ&#233;es aux soins &#224; 
par tir  de l&#8217;analyse de comptes-rendus d&#8217;hospitalisation 
</p>
<p>Caroline Hag&#232;ge1 Denys Proux1 Quentin Gicquel2 Stefan Darmoni3 
Suzanne Pereira4  Fr&#233;d&#233;rique Segond1 Marie-Hel&#232;ne Metzger2 
</p>
<p>(1)  XRCE, 6 Chemin de Maupertuis, 38240 Meylan, France 
(2) UCBL-CNRS, UMR 5558 Lyon, France  
</p>
<p>(3) CISMEF, Rouen, France  
(4) VIDAL, Issy les Moulineaux, France 
</p>
<p>Caroline.Hagege@xrce.xerox.com, Denys.Proux@xrce.xerox.com, Quentin.Gicquel@chu-lyon.fr,  
Stefan.Darmoni@cismef.fr, Suzanne.Pereira@vidal.fr, Frederique.Segond@xrce.xerox.com,  
</p>
<p>Marie-Helene.Metzger@chu-lyon.fr 
</p>
<p>R&#233;sum&#233; 
</p>
<p>Cet article d&#233;crit la premi&#232;re version et les r&#233;sultats de l&#8217;&#233;valuation d&#8217;un syst&#232;me de d&#233;tection des &#233;pisodes d&#8217;infections 
associ&#233;es aux soins. Cette d&#233;tection est bas&#233;e sur l&#8217;analyse automatique de comptes-rendus d&#8217;hospitalisation provenant de 
diff&#233;rents h&#244;pitaux et diff&#233;rents services. Ces comptes-rendus sont sous forme de texte libre. Le syst&#232;me de d&#233;tection a 
&#233;t&#233; d&#233;velopp&#233; &#224; partir d&#8217;un analyseur linguistique que nous avons adapt&#233; au domaine m&#233;dical et extrait &#224; partir des 
documents des indices pouvant conduire &#224; une suspicion d&#8217;infection. Un traitement de la n&#233;gation et un traitement 
temporel des textes sont effectu&#233;s permettant de restreindre et de raffiner l&#8217;extraction d&#8217;indices. Nous d&#233;crivons dans cet 
article le syst&#232;me que nous avons d&#233;velopp&#233; et donnons les r&#233;sultats d&#8217;une &#233;valuation pr&#233;liminaire. 
</p>
<p>Abstract  
</p>
<p>This paper describes the first version and the results obtained by a system which detects occurrences of healthcare-
associated infections. The system automatically analyzes hospital discharge summaries coming from different hospitals 
and from different care units. The output of the system consists in stating for each document, if there is a case of 
healthcare-associated infection. The linguistic processor which analyzes hospital discharge summaries is a general 
purpose tool which has been adapted for the medical domain. It extracts textual elements that may lead to an infection 
suspicion. Jointly with the extraction of suspicious terms, the system performs a negation and temporal processing of texts 
in order to refine the extraction. We first describe the system that has been developed and give then the results of a 
preliminary evaluation. 
</p>
<p>Mots-cl&#233;s :   Extraction d&#8217;information m&#233;dicale, compte-rendus d&#8217;hospitalisation, infection 
nosocomiale, analyse syntaxique 
Keywords:   Information extraction in medical domain, hospital discharge summar ies, hospital 
acquired infections, parsing 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAROLINE HAGEGE,  DENYS PROUX, QUENTIN GICQUEL  , STEFAN DARMONI, SUZANNE PEREIRA, FREDERIQUE 
SEGOND, MARIE-HELENE METZGER 
</p>
<p>1 Introduction 
</p>
<p>Les infections acquises en milieu hospitalier (infections nosocomiales) sont un enjeu important pour les 
&#233;tablissements de soins. On estime en effet qu&#8217;en France ce type d&#8217;infections touche entre 5% et 10% des 
patients hospitalis&#233;s. Il a aussi &#233;t&#233; estim&#233; qu&#8217;environ 30% de ces infections pourraient &#234;tre &#233;vit&#233;es. On 
comprend donc sans peine que ce probl&#232;me soit au c&#339;ur des pr&#233;occupations du milieu m&#233;dical comme en 
t&#233;moignent les nombreuses &#233;tudes &#233;pid&#233;miologiques et les actions de surveillances r&#233;alis&#233;es dans ce 
domaine (voir l&#8217;activit&#233; des CCLIN1 par exemple). Le travail d&#233;crit ici est d&#233;velopp&#233; dans le cadre du projet 
ANR ALADIN DTH2
</p>
<p>2 Descr iption du syst&#232;me 
</p>
<p> (se r&#233;f&#233;rer &#224; (Proux et. al., 2009) pour une description g&#233;n&#233;rale du projet) et a pour 
but de d&#233;velopper un outil qui, &#224; partir de comptes-rendus d&#8217;hospitalisation r&#233;dig&#233;s par des m&#233;decins, est 
capable de d&#233;terminer si ce compte-rendu relate un &#233;pisode relevant d&#8217;une infection nosocomiale (IN). Cet 
outil sp&#233;cifique a &#233;t&#233; d&#233;velopp&#233; &#224; partir d&#8217;un outil plus g&#233;n&#233;ral permettant d&#8217;extraire de l&#8217;information 
syntaxique et s&#233;mantique &#224; partir de textes tout-venant (A&#239;t-Mokhtar et al., 2002). Dans la suite de cet 
article, nous d&#233;crivons d&#8217;abord les adaptations de l&#8217;outil linguistique g&#233;n&#233;ral pour notre domaine applicatif. 
Puis, dans un deuxi&#232;me temps, nous d&#233;taillons les d&#233;veloppements sp&#233;cifiques r&#233;alis&#233;s. Enfin, nous 
concluons en indiquant quels sont les d&#233;veloppements en cours et ceux envisag&#233;s dans un futur proche.  
</p>
<p>Nous consid&#233;rons deux &#233;tapes principales dans le d&#233;veloppement du syst&#232;me. La premi&#232;re consiste en 
l&#8217;adaptation d&#8217;un outil de traitement linguistique relevant du domaine g&#233;n&#233;ral au nouveau domaine des 
comptes-rendus d&#8217;hospitalisation. La seconde &#233;tape consiste en un ensemble de d&#233;veloppements sp&#233;cifiques 
pour la finalit&#233; applicative. Nous d&#233;crivons ci-dessous ces deux &#233;tapes.  
</p>
<p>2.1 Adaptation au domaine m&#233;dical de l&#8217;outil de traitement linguistique g&#233;n&#233;ral 
</p>
<p>XIP (A&#239;t-Mokhtar et al., 2002) est un outil de traitement linguistique g&#233;n&#233;ral qui proc&#232;de &#224; l&#8217;analyse 
syntaxique fine en d&#233;pendances de textes tout venant (aux formats txt ou xml). Un module de 
reconnaissance des entit&#233;s nomm&#233;es (EN) relevant du domaine g&#233;n&#233;ral (presse d&#8217;information g&#233;n&#233;rale, 
encyclop&#233;die g&#233;n&#233;rale etc.) est int&#233;gr&#233; dans cette analyse. Les textes que nous traitons dans le cadre du 
projet ALADIN rel&#232;vent cependant du domaine particulier des comptes-rendus d&#8217;hospitalisation (que nous 
d&#233;signerons d&#233;sormais par CR) provenant de services de r&#233;animation, de chirurgie digestive, de chirurgie 
orthop&#233;dique et de neurochirurgie de divers h&#244;pitaux. Un enrichissement lexical a donc &#233;t&#233; n&#233;cessaire pour 
que notre outil puisse traiter correctement ces textes. Par ailleurs, les CR sont des textes libres, qui, selon les 
services ou les r&#233;dacteurs peuvent pr&#233;senter des particularit&#233;s comme des emplois de style t&#233;l&#233;graphique, 
des abr&#233;viations, certaines fautes d&#8217;orthographe r&#233;currentes etc. Enfin, ces textes ont un type de format et 
d&#8217;organisation particuliers. L&#8217;adaptation au domaine a &#233;t&#233; organis&#233;e selon deux axes qui sont d&#8217;une part 
l&#8217;enrichissement lexical et terminologique et d&#8217;autre part la prise en compte des particularit&#233;s de la 
collection de documents que nous traitons.   
</p>
<p>Le traitement des textes sp&#233;cialis&#233;s a n&#233;cessit&#233; un apport important de ressources lexicales et 
terminologiques. Ces ressources ont &#233;t&#233; int&#233;gr&#233;es dans les lexiques &#224; &#233;tats-finis utilis&#233;s par l&#8217;analyseur. Nous 
avons choisi dans un premier temps cette approche par rapport &#224; une approche qui aurait consist&#233; &#224; int&#233;grer 
dans le flux des traitements l&#8217;utilisation d&#8217;outils d&#8217;indexation terminologique d&#233;j&#224; existants pour deux 
raisons principales : La premi&#232;re est qu&#8217;il n&#8217;existe pas de terminologie sp&#233;cifique aux probl&#232;mes 
d&#8217;infections acquises &#224; l&#8217;h&#244;pital3
</p>
<p>                                                          
1  http ://www.cclin-france.fr 
</p>
<p>2  http://www.aladin-project.eu 
</p>
<p>3  Une telle terminologie est actuellement en cours de d&#233;veloppement au CISMEF dans le cadre du projet. 
</p>
<p> et que nous aurions du utiliser des terminologies vastes et plus g&#233;n&#233;rales. 
Les essais pr&#233;liminaires que nous avons effectu&#233;s dans ce sens ont montr&#233; que nous obtenions une 
couverture bien trop large pour nos besoins d&#8217;extraction d&#8217;information. Ces outils d&#8217;indexation sont en effet 
destin&#233;s &#224; favoriser le rappel (l&#8217;id&#233;e sous-jacente est de permettre d&#8217;extraire TOUS les textes pertinents &#224; 
partir d&#8217;une recherche par mots-cl&#233;s) et nous souhaitons insister dans ce contexte sur la pr&#233;cision. Par </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
 
</p>
<p>ailleurs, l&#8217;int&#233;gration directe des ressources lexicales et terminologiques dans nos automates lexicaux permet 
d&#8217;obtenir un temps de traitement plus court. Ces deux raisons ont fait que nous avons opt&#233; pour le codage 
des termes dans l&#8217;analyseur lexical4
</p>
<p>2.2 D&#233;veloppements sp&#233;cifiques &#224; l&#8217;application 
</p>
<p>. Nous avons int&#233;gr&#233; environ 4000 termes et &#233;l&#233;ments du vocabulaire 
m&#233;dical &#224; notre syst&#232;me (correspondant approximativement &#224; 11000 formes fl&#233;chies).  Cet apport lexical et 
le fait de travailler dans un domaine particulier a une influence sur le traitement de l&#8217;ambig&#252;it&#233; du syst&#232;me 
g&#233;n&#233;ral. Par exemple, l&#8217;ajout du terme Candida dans le lexique a pour effet de cr&#233;er une nouvelle ambig&#252;it&#233; 
entre nom de personne (Candida est un pr&#233;nom f&#233;minin) et un nom de germe (levure). Les nouveaux termes 
ont &#233;t&#233; analys&#233;s par le syst&#232;me g&#233;n&#233;ral avant leur introduction dans le lexique et les nouvelles ambig&#252;it&#233;s 
dues &#224; cet apport lexical ont &#233;t&#233; examin&#233;es et parfois r&#233;solues. Dans le cas pr&#233;cis de Candida, dans la 
mesure o&#249; nous travaillons sur les CR anonymis&#233;s (donc sans nom propre), nous avons syst&#233;matiquement 
privil&#233;gi&#233; un &#233;tiquetage par un nouveau terme par rapport &#224; un &#233;tiquetage en nom de personne.  
</p>
<p>Le deuxi&#232;me &#233;l&#233;ment important est l&#8217;adaptation linguistique de l&#8217;analyseur au traitement des documents 
particuliers que sont les CR. Ces documents sont r&#233;dig&#233;s de mani&#232;re synth&#233;tique par des m&#233;decins et 
contiennent des coquilles, des manques de ponctuation et un emploi du style t&#233;l&#233;graphique qui viennent 
troubler le comportement habituel de l&#8217;analyseur. Ainsi, il est courant de trouver des phrases sans verbe 
comme fracture jambe gauche. Pour un syst&#232;me d&#8217;analyse linguistique g&#233;n&#233;ral, le mot fracture sera 
d&#233;sambig&#252;is&#233; comme Verbe &#224; l&#8217;imp&#233;ratif, alors que dans le contexte des CR, il s&#8217;agit d&#8217;un nom. De plus, 
des erreurs orthographiques fr&#233;quentes sur des termes ont &#233;t&#233; relev&#233;es dans les corpus et cod&#233;es dans les 
automates lexicaux (par exemple, graphie incorrecte cytrobacter au lieu de citrobacter).   
</p>
<p>L&#8217;outil que nous avons d&#233;velopp&#233; prend en entr&#233;e un compte-rendu d&#8217;hospitalisation et produit en sortie ce 
m&#234;me compte-rendu annot&#233;. L&#8217;annotation consiste en l&#8217;extraction des indices potentiels pouvant conduire &#224; 
une suspicion d&#8217;IN accompagn&#233;e de l&#8217;information finale concernant le statut de ce document par rapport &#224; 
l&#8217;infection (suspicion ou non suspicion). L&#8217;outil est d&#233;velopp&#233; en JAVA et utilise l&#8217;API Java de notre 
analyseur ce qui nous permet d&#8217;avoir acc&#232;s et de stocker l&#8217;information linguistique calcul&#233;e par l&#8217;analyseur 
lors de l&#8217;ex&#233;cution du programme. Nous avons d&#233;velopp&#233; le syst&#232;me selon les axes suivants :  
</p>
<p>&#8226; Extraction d&#8217;indices avec traitement de la n&#233;gation 
</p>
<p>&#8226; Traitement temporel 
</p>
<p>&#8226; Heuristiques pour la d&#233;tection des infections 
</p>
<p>2.2.1 Extraction d&#8217;indices 
</p>
<p>Le but de cette extraction est de d&#233;tecter et de typer toute l&#8217;information qui rel&#232;ve du probl&#232;me des IN dans 
les textes. Ce travail d&#8217;extraction se situe dans la lign&#233;e de travaux d&#8217;extraction d&#8217;information dans le 
domaine du m&#233;dical (voir par exemple (Del&#233;ger et al., 2010)). Cette extraction est comparable &#224; une 
reconnaissance d&#8217;entit&#233;s nomm&#233;es classique pour laquelle de nouvelles EN et de nouveaux types 
s&#233;mantiques sont consid&#233;r&#233;s. Pour notre application, nous consid&#233;rons les types suivants : BACTERIES, 
VIRUS et LEVURES qui constituent trois sous-types d&#8217;un type g&#233;n&#233;ral GERME_INFECTIEUX. 
ANTISEPTIQUE correspond &#224; des mentions de produits antiseptiques utilis&#233;s en chirurgie. 
TEMPERATURE marque des expressions simples ou phrastiques indiquant qu&#8217;un patient a de la fi&#232;vre. 
DISPOSITIF type les occurrences de dispositifs invasifs (ex. cath&#233;ters) qui sont souvent des points d&#8217;entr&#233;e 
pour les IN. INFECTION correspond &#224; un diagnostic &#233;tabli d&#8217;infection. Il peut s&#8217;agir d&#8217;une maladie 
infectieuse (comme une pneumopathie par exemple) ou de la pr&#233;sence de pus. ANTIBIOTIQUE d&#233;signe la 
classe des antibiotiques. Enfin, EXAMENS subsume les sous-types EXAMEN_BIOLOGIQUE, 
EXAMEN_BACTERIOLOGIQUE et EXAMEN_RADIOLOGIQUE. La reconnaissance de ces nouveaux 
types d&#8217;entit&#233;s se base sur l&#8217;information lexicale et terminologique du domaine qui a &#233;t&#233; int&#233;gr&#233;e dans le 
lexique, mais aussi sur une s&#233;rie de r&#232;gles (contextuelles ou plus larges utilisant des d&#233;pendances 
syntaxiques). Il est important d&#8217;avoir une tr&#232;s bonne pr&#233;cision pour la reconnaissance de ces types car ils 
</p>
<p>                                                          
4  Nous avons utilis&#233; les termes des CR annot&#233;s manuellement par les m&#233;decins partenaires que nous avons 
</p>
<p>enrichis par des ressources mis &#224; notre disposition par les partenaires CISMEF et Vidal. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAROLINE HAGEGE,  DENYS PROUX, QUENTIN GICQUEL  , STEFAN DARMONI, SUZANNE PEREIRA, FREDERIQUE 
SEGOND, MARIE-HELENE METZGER 
</p>
<p>vont &#234;tre utilis&#233;s par les heuristiques de d&#233;tection des infections. Nous avons par ailleurs rajout&#233; la 
reconnaissance des types DIAGNOSTIC (autres que maladie infectieuse) et 
INTERVENTION_CHIRURGICALE, qui interviennent de mani&#232;re moins directe dans la d&#233;tection des 
suspicions d&#8217;infection mais que les m&#233;decins souhaitent voir annot&#233;s dans les documents car ils vont aider &#224; 
donner le contexte de l&#8217;histoire du patient et faciliter la relecture des CR. L&#8217;extraction de ces indices est 
accompagn&#233;e d&#8217;un traitement fin de la n&#233;gation int&#233;gr&#233; &#224; l&#8217;analyseur linguistique. Nous avons pr&#233;sent&#233; et 
&#233;valu&#233; (Hag&#232;ge, 2011) une m&#233;thode pour le traitement de la n&#233;gation dans le sous-domaine des CR  
d&#8217;hospitalisation qui nous montre qu&#8217;environ 8% des indices potentiels apparaissant dans les textes 
comportent une n&#233;gation. Cette m&#233;thode permet de d&#233;tecter ces n&#233;gations avec une pr&#233;cision de 95,6% et un 
rappel de 96,6%. 
</p>
<p>2.2.2 Traitement temporel 
</p>
<p>Un module de traitement de la temporalit&#233; est int&#233;gr&#233; dans l&#8217;analyseur. On doit pouvoir associer &#224; chaque 
indice extrait une coordonn&#233;e temporelle calcul&#233;e en terme de distance par rapport &#224; la date d&#8217;entr&#233;e dans le 
service (cas de la r&#233;animation) et &#224; la date de l&#8217;intervention (cas de la chirurgie). En effet, la prise en compte 
du facteur temps, date d&#8217;apparition de l&#8217;infection par rapport &#224; la date de l&#8217;hospitalisation ou de 
l&#8217;intervention chirurgicale,  est un param&#232;tre capital pour la d&#233;tection correcte des infections acquises &#224; 
l&#8217;h&#244;pital. Le traitement de la temporalit&#233; dans les comptes-rendus d&#8217;hospitalisation est d&#233;crit dans (Hag&#232;ge 
et. al., 2010). Il permet de d&#233;couper le compte-rendu initial en blocs temporels, chacun de ces blocs ayant 
un attribut temporel exprim&#233; en termes de distance temporelle avec une date T0 (date d&#8217;hospitalisation ou 
d&#8217;intervention chirurgicale). Tout indice extrait &#224; l&#8217;int&#233;rieur d&#8217;un bloc temporel aura une coordonn&#233;e 
temporelle correspondant &#224; la valeur de l&#8217;attribut temporel du bloc d&#8217;o&#249; il est extrait.  
</p>
<p>2.2.3 Ensemble d&#8217;heuristiques pour la d&#233;tection des infections 
</p>
<p>Une des principales difficult&#233;s vient du fait que la survenue d&#8217;une IN est rarement mentionn&#233;e de mani&#232;re 
totalement explicite dans les CR5
</p>
<p>Nous consid&#233;rons qu&#8217;un CR provenant d&#8217;un service de r&#233;animation comporte une suspicion d&#8217;IN si l&#8217;une 
des conditions ci-dessous est remplie :  
- On trouve dans le texte une mention explicite &#224; une infection nosocomiale (suite de caract&#232;re &#171; infection 
nosocomiale &#187; ou entit&#233; de type INFECTION modifi&#233;e par l&#8217;adjectif &#171; nosocomial &#187;  
- On trouve dans le texte conjointement  au moins deux entit&#233;s INFECTION et ANTIBIOTIQUE et les 
ancrages temporels de ces entit&#233;s sont sup&#233;rieurs ou &#233;gal &#224; deux jours apr&#232;s T0 (date d&#8217;hospitalisation) ET 
le patient ne pr&#233;sente pas d&#8217;infection a l&#8217;entr&#233;e dans le service (entit&#233; INFECTION, 
GERME_INFECTIEUX avec coordonn&#233;e temporelle &#233;gale &#224; T0) ET le patient n&#8217;est pas d&#233;c&#233;d&#233; lors de 
l&#8217;hospitalisation
</p>
<p>.  De plus, nous constatons que nous trouvons rarement dans les CR la 
mention de toutes les directives m&#233;dicales permettant de d&#233;finir les IN et ISO (voir par exemple (Horan et 
al. 2008)).  En effet, si nous &#233;tudions les CR dans lesquels les m&#233;decins ont consid&#233;r&#233; un risque d&#8217;infection, 
nous v&#233;rifions que seul un sous-ensemble de ces conditions d&#233;finissant l&#8217;infection est annot&#233; dans ces textes. 
Enfin, alors que nous avons souhait&#233; favoriser la pr&#233;cision dans l&#8217;extraction des indices suspects pour 
l&#8217;infection, nous souhaitons pour l&#8217;extraction des CR, et &#224; la demande des m&#233;decins, favoriser un bon 
rappel. Gr&#226;ce &#224; un ensemble de CR annot&#233;s par les m&#233;decins investigateurs du projet et mis &#224; notre 
disposition nous avons d&#233;velopp&#233; et test&#233; diff&#233;rentes heuristiques. Ces heuristiques utilisent l&#8217;extraction des 
indices et de l&#8217;information temporelle d&#233;crites aux points pr&#233;c&#233;dents. Elles ont &#233;t&#233; d&#233;termin&#233;es gr&#226;ce &#224; 
l&#8217;&#233;tude de CR annot&#233;s par les m&#233;decins investigateurs, &#224; l&#8217;utilisation des algorithmes de d&#233;tection formalis&#233;s 
par les partenaires m&#233;dicaux, ainsi que par transmission des connaissances m&#233;dicales n&#233;cessaires &#224; la 
compr&#233;hension de la th&#233;matique par ces m&#234;me partenaires. La d&#233;tection des infections nosocomiales a &#233;t&#233; 
&#233;tudi&#233;e en r&#233;animation et en chirurgie (neurochirurgie, chirurgie digestive, orthop&#233;die) o&#249; l&#8217;objectif &#233;tait la 
d&#233;tection de l&#8217;infection du site op&#233;ratoire (ISO). Voici diff&#233;rents exemples d&#8217;heuristiques :  
</p>
<p>6
</p>
<p>                                                          
5  Nous n&#8217;avons trouv&#233; sur 64 CR de r&#233;animation contenant des &#233;pisodes d&#8217;IN qui ont &#233;t&#233; utilis&#233;s pour la 
</p>
<p>mise au point de l&#8217;outil que 11 CR o&#249; une forme du mot &#171; nosocomial &#187; appara&#238;t.  
</p>
<p> 
</p>
<p>6  En effet, en cas de d&#233;c&#232;s du patient lors de l&#8217;hospitalisation, des &#233;ventuelles limitations th&#233;rapeutiques 
font que souvent moins d&#8217;indices pour la detection des IN apparaissent dans les textes (par exemple, une 
infection peut-etre d&#233;tect&#233;e mais non soign&#233;e par des antibiotiques). Cette condition a pour r&#233;sultat 
d&#8217;ajouter des contraintes suppl&#233;mentaires aux heuristiques de detection des l&#8217;infection. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
 
</p>
<p>- On trouve dans le texte conjointement  au moins deux entit&#233;s GERME_INFECTIEUX et 
ANTIBIOTIQUE dont les ancrages temporels sont sup&#233;rieurs ou &#233;gal &#224; deux jours apr&#232;s T0 ET que le 
patient ne pr&#233;sente pas d&#8217;infection a l&#8217;entr&#233;e dans le service (entit&#233; INFECTION, GERME_INFECTIEUX 
avec coordonn&#233;e temporelle &#233;gale &#224; T0) ET le patient n&#8217;est pas d&#233;c&#233;d&#233; lors de l&#8217;hospitalisation 
- Le patient a une infection &#224; l&#8217;entr&#233;e dans le service (INFECTION ou GERME_INFECTIEUX avec 
coordonn&#233;e temporelle &#233;gale &#224; T0) ou il d&#233;c&#232;de lors de l&#8217;hospitalisation ET l&#8217;on trouve au moins deux 
entit&#233;s INFECTION, GERME_INFECTIEUX, ANTIBIOTIQUE, TEMPERATURE, DISPOSITIF avec 
une coordonn&#233;e temporelle sup&#233;rieure ou &#233;gale &#224; T0+2jours 
</p>
<p>Nous consid&#233;rons qu&#8217;un CR provenant d&#8217;un service de chirurgie comporte une suspicion d&#8217;ISO si l&#8217;une des 
conditions ci-dessous est remplie : 
- on trouve une mention explicite &#224; une infection du site op&#233;ratoire dans le texte 
- on trouve au moins une des entit&#233;s INFECTION, ANTIBIOTIQUE, ANTISEPTIQUE, 
GERME_INFECTIEUX, EXAMEN_BACTERIOLOGIQUE post&#233;rieure &#224; la date d&#8217;intervention dans le 
document. 
</p>
<p>3 Evaluation et futurs d&#233;veloppements 
</p>
<p>Une &#233;valuation pr&#233;liminaire des performances de d&#233;tection a &#233;t&#233; effectu&#233;e par nos partenaires m&#233;dicaux 
UCBL sur 205 CR du jeu d&#8217;apprentissage (avant leur utilisation pour d&#233;veloppement) (Berrouane et al., 
2011). Le but de cette &#233;valuation est de d&#233;terminer dans quelle mesure le syst&#232;me est capable de classer les 
documents dans les deux cat&#233;gories, infect&#233;s ou non infect&#233;s. Ces CR proviennent des diff&#233;rentes sp&#233;cialit&#233;s 
(R&#233;animation, chirurgie digestive, orthop&#233;die et neurochirurgie) des diff&#233;rents &#233;tablissements de sant&#233; 
(Rouen, Lyon et Nice). Sur ces 205 CR, 128 contiennent une occurrence d&#8217;infection. Cette r&#233;partition entre 
CR infect&#233;s et non infect&#233;s ne correspond pas &#224; la r&#233;alit&#233; de la proportion des cas d&#8217;infection dans les 
services hospitaliers et il est important de le signaler car il explique pourquoi nous n&#8217;avons pas calcul&#233; la 
pr&#233;cision. Un des &#233;l&#233;ments importants dans le d&#233;veloppement &#233;tait d&#8217;estimer le rappel ainsi que nous 
l&#8217;avons indiqu&#233; au point 2.2.3. Cet &#233;chantillonnage, bien que non repr&#233;sentatif de la r&#233;alit&#233; dans les 
&#233;tablissement de sant&#233;, nous permet de l&#8217;&#233;valuer. Nous donnons &#233;galement les r&#233;sultats du calcul de la  
sp&#233;cificit&#233;. Les formules utilis&#233;es pour les calculs sont rappel&#233;es dans le tableau o&#249; VP, VN, FP et FN 
repr&#233;sentent respectivement les vrais positifs, vrais n&#233;gatifs, faux positifs et faux n&#233;gatifs obtenus lors de la 
comparaison entre l&#8217;annotation manuelle et l&#8217;annotation automatique.  
</p>
<p> 
</p>
<p>  VP VN FP FN total 
Rappel 
</p>
<p>VP/(VP+FN) Sp&#233;cificit&#233; 
VN/(VN+FP) 
</p>
<p>Tous 113 74 2 16 205 87,6%  97.4%  
</p>
<p>R&#233;a. 10 12 1 6 29 62,5% 92.3% 
</p>
<p>Ch. Dig. 35 28 0 4 67 89,7% 100% 
</p>
<p>Ch. Orth. 14 4 1 2 21 87,5% 80% 
</p>
<p>Neurochir. 54 30 0 4 88 93,1% 100% 
</p>
<p>Tableau 1 : R&#233;sultats de l&#8217;&#233;valuation par sp&#233;cialit&#233;s 
</p>
<p>Ces r&#233;sultats ont montr&#233; que l&#8217;objectif d&#8217;un rappel &#233;lev&#233; &#233;tait atteint (87,6%]) avec toutefois des variations 
selon la sp&#233;cialit&#233; m&#233;dicale, le rappel &#233;tant plus faible en r&#233;animation (62,5), et le plus &#233;lev&#233; en 
neurochirurgie (93.1%). L&#8217;analyse des r&#233;sultats montre que les erreurs du syst&#232;me proviennent de 
diff&#233;rentes sources. La premi&#232;re source d&#8217;erreur, la moins fr&#233;quente cependant, est due &#224; du codage 
insuffisant de termes. La seconde source d&#8217;erreur (concernant la d&#233;tection d&#8217;ISO) est la pr&#233;sence possible de 
cas d&#8217;IN dans des CR de chirurgie. Or, pour la chirurgie, &#224; la demande des m&#233;decins, seules les occurrences 
d&#8217;ISO doivent &#234;tre prises en consid&#233;ration. Enfin, la source d&#8217;erreur la plus importante est celle qui est li&#233;e 
au traitement temporel (pour les CR de r&#233;animation). En effet, ainsi qu&#8217;on peut le constater dans les 
heuristiques pr&#233;sent&#233;es plus haut, dans le contexte de la r&#233;animation, la d&#233;tection des IN est tr&#232;s d&#233;pendante </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAROLINE HAGEGE,  DENYS PROUX, QUENTIN GICQUEL  , STEFAN DARMONI, SUZANNE PEREIRA, FREDERIQUE 
SEGOND, MARIE-HELENE METZGER 
</p>
<p>du calcul correct des coordonn&#233;es temporelles des entit&#233;s extraites du texte. La poursuite de l&#8217;analyse des 
CR d&#8217;apprentissage (800 CR mis &#224; disposition au total) devrait permettre l&#8217;am&#233;lioration de ces 
performances, notamment en r&#233;animation.  
</p>
<p>Par ailleurs, nous sommes actuellement en train de raffiner les r&#232;gles de d&#233;tection des ISO afin de 
d&#233;terminer si l&#8217;infection est superficielle ou profonde. Nous souhaitons &#233;galement d&#233;velopper une interface 
qui pr&#233;sentera aux m&#233;decins les comptes-rendus annot&#233;s par le syst&#232;me ainsi que l&#8217;heuristique qui a &#233;t&#233; 
utilis&#233;e pour d&#233;terminer s&#8217;il s&#8217;agit d&#8217;un cas d&#8217;IN. La mise en &#339;uvre de l&#8217;outil est actuellement pr&#233;vue au 
centre hospitalier universitaire de Lyon. Nous souhaitons &#233;galement utiliser les CR ayant servi &#224; 
l&#8217;apprentissage de notre outil pour entrainer des arbres de d&#233;cisions (en cours d&#8217;&#233;laboration par nos 
partenaires UCBL), afin de les comparer &#224; nos heuristiques et &#233;ventuellement les am&#233;liorer. Une fois tous 
ces d&#233;veloppements r&#233;alis&#233;s, une &#233;valuation de l&#8217;outil sera r&#233;alis&#233;e par nos partenaires m&#233;dicaux UCBL 
avec un nouveau jeu de 800 CR.  
</p>
<p>Remerciements 
</p>
<p>Nous remercions l&#8217;ANR pour le financement du projet ANR-08-TecSan-001-01 ALADIN- DTH qui 
s&#8217;inscrit dans le cadre de la recherche partenariale en  technologies pour la sant&#233; et l&#8217;autonomie (TecSan). 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>AIT-MOKHTAR S., CHANOD J-P., ROUX C. (2002). Robustness beyond Shallowness : Incremental Deep 
Parsing. Natural Language Engineering 8, 121-144. 
</p>
<p>BERROUANE Y., HAG&#200;GE C., GICQUEL Q.,, KERGOULAY I., PEREIRA S., PROUX D., DARMONI S., SEGOND F., 
METZGER M-H. (2011) Preliminary evaluation of an automated detection tool for healthcare-associated 
infections, based on screening natural language medical reports. 21st European Congress of Clinical 
Microbiology and Infectious Diseases, Milan, May 2011 -  (Affiche topic 52). 
</p>
<p>DELEGER L., GROUIN C., ZWEIGENBAUM P. (2010). Extracting medication information from French clinical 
texts. Proceedings of MEDINFO 2010, Vol 160. 949-953. 
</p>
<p>HAG&#200;GE C., MARCHAL P., GICQUEL Q., DARMONI S., PEREIRA S., METZGER M-H. (2010). Linguistic and 
Temporal Processing for Discovering Hospital Acquired Infections from Patient Records. Proceedings of 
the ECAI 2010 Conference Workshop on Knowledge Representation for Health-Care (KRHC&#8217;10). 
</p>
<p>HAGEGE C. (2011). Linguistically Motivated Negation Processing. Proceedings CiCLing 2011, to appear. 
</p>
<p>HORAN T., ANDRUS M., DUDECK A. (2008). CDC/NHSN Surveillance Definition of Health Care-Associated 
Infection and Criteria for Specific Types of Infections in the Acute Care Setting. AJIC: American Journal of 
Infection Control, Volume 36, Issue 5, 309-332,  AJIC: AMERICAN JOURNAL OF INFECTION CONTROL 
</p>
<p>PROUX D., MARCHAL P., SEGOND F., KERGOULAY I., DARMONI S., PEREIRA S., GICQUEL Q., METZGER M-H. 
(2009). Natural Language Processing to detect Risk Patterns related to Hospital Acquired Infections. 
Proceedings of  RANLP 2009, Borovetz, Bulgaria, 865-881. 
</p>
<p> 
</p>
<p> 
</p>
<p> </p>

</div></div>
</body></html>