<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>La traduction automatique des pronoms. Probl&#232;mes et perspectives</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>La traduction automatique des pronoms. Probl&#232;mes et perspectives. &#8727;
</p>
<p>Yves Scherrer, Lorenza Russo, Jean-Philippe Goldman,
Sharid Lo&#225;iciga, Luka Nerima, &#201;ric Wehrli
</p>
<p>Laboratoire d&#8217;Analyse et de Technologie du Langage
D&#233;partement de Linguistique &#8211; Universit&#233; de Gen&#232;ve
</p>
<p>2, rue de Candolle &#8211; CH-1211 Gen&#232;ve 4
</p>
<p>{yves.scherrer, lorenza.russo, jean-philippe.goldman,
sharid.loaiciga, luka.nerima, eric.wehrli}@unige.ch
</p>
<p>R&#233;sum&#233;. Dans cette &#233;tude, notre syst&#232;me de traduction automatique, Its-2, a fait l&#8217;objet d&#8217;une &#233;valuation
manuelle de la traduction des pronoms pour cinq paires de langues et sur deux corpus : un corpus litt&#233;raire et
un corpus de communiqu&#233;s de presse. Les r&#233;sultats montrent que les pourcentages d&#8217;erreurs peuvent atteindre
60% selon la paire de langues et le corpus. Nous discutons ainsi deux pistes de recherche pour l&#8217;am&#233;lioration des
performances de Its-2 : la r&#233;solution des ambigu&#239;t&#233;s d&#8217;analyse et la r&#233;solution des anaphores pronominales.
</p>
<p>Abstract. In this work, we present the results of a manual evaluation of our machine translation system,
Its-2, on the task of pronoun translation for five language pairs and in two corpora : a litterary corpus and a corpus
of press releases. The results show that the error rates reach 60% depending on the language pair and the corpus.
Then we discuss two proposals for improving the performances of Its-2 : resolution of source language ambiguities
and resolution of pronominal anaphora.
</p>
<p>Mots-cl&#233;s : Pronoms, traduction automatique, analyse syntaxique, anaphores pronominales.
</p>
<p>Keywords: Pronouns, machine translation, parsing, pronominal anaphora.
</p>
<p>1 Introduction
</p>
<p>Il y a un quart de si&#232;cle, Kay (1986) affirmait : &#171; We know a good deal more about programming techniques
and have larger machines to work with ; we have more elegant theories of syntax and what modern linguists are
pleased to call semantics ; and there has been some exploratory work on anaphora. But, we still have little idea
how to translate into a closely related language like French or German, English sentences containing such words
as he, she, it, not, and, and of. &#187; La recherche que nous pr&#233;sentons dans cet article prend comme point de d&#233;part
l&#8217;affirmation de M. Kay et se donne comme objectif l&#8217;&#233;valuation de la traduction automatique des pronoms. La
plupart des recherches r&#233;centes portant sur la r&#233;solution des anaphores &#8211; pas forc&#233;ment dans une perspective
de traduction (Mitkov et al., 2007) &#8211;, nous avons lanc&#233; une &#233;valuation plus vaste concernant plusieurs paires de
langues. Notre objectif principal est d&#8217;am&#233;liorer notre syst&#232;me de traduction automatique sur ce ph&#233;nom&#232;ne : nous
en avons donc rep&#233;r&#233; les principaux probl&#232;mes ainsi que des pistes de recherche pour les r&#233;soudre.
</p>
<p>Dans la section 2, nous pr&#233;sentons rapidement une pr&#233;-&#233;tude sur la distribution des pronoms dans la langue source,
pour ensuite donner, dans la section 3, les d&#233;tails de l&#8217;&#233;tude des pronoms dans la langue cible. La section 4
pr&#233;sente les r&#233;sultats obtenus ; enfin, dans la section 5, nous discutons les pistes de recherche pour de futures
impl&#233;mentations.
</p>
<p>&#8727;. Le travail de recherche ici pr&#233;sent&#233; a b&#233;n&#233;fici&#233; du support du Fonds National Suisse de la Recherche Scientifique (No 100015-130634).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y. SCHERRER, L. RUSSO, J.-P. GOLDMAN, S. LO&#193;ICIGA, L. NERIMA, &#201;. WEHRLI
</p>
<p>2 Les pronoms dans la langue source
</p>
<p>Une partie du probl&#232;me de la traduction des pronoms d&#233;pend de la bonne identification des formes pronominales
dans la langue source. Pour ce qui concerne le fran&#231;ais, Tutin (2002) et Laurent (2001), entre autres, ont men&#233; des
&#233;tudes sur corpus pour d&#233;terminer la distribution des pronoms dans diff&#233;rents genres de textes. Dans une optique
similaire, mais orient&#233;e vers la traduction automatique et donc plurilingue, nous avons fait une pr&#233;-&#233;tude pour
mieux d&#233;terminer les distributions des pronoms dans la langue source (Russo et al., 2011). Nous voulions quan-
tifier l&#8217;influence du style de texte, de la langue et du type de pronom. Dans ce but, nous avons annot&#233; &#224; l&#8217;aide de
l&#8217;analyseur syntaxique Fips (Wehrli, 2007) deux corpus diff&#233;rents : un corpus litt&#233;raire, le Petit Prince, en fran&#231;ais,
anglais, allemand et italien (environ 1600 phrases) 1 et un corpus de communiqu&#233;s de presse de l&#8217;Administration
F&#233;d&#233;rale Suisse, disponible dans les m&#234;mes langues (environ 1000 phrases) 2. Nous avons rep&#233;r&#233; tous les mots qui
ont &#233;t&#233; &#233;tiquet&#233;s par Fips comme pronoms personnels (je, eux, nous) 3, clitiques (y, la), d&#233;monstratifs (&#231;a, cela),
relatifs (qui, que), ind&#233;finis (chacun, personne), interrogatifs (qui ) et d&#233;terminants possessifs (ma, leurs).
</p>
<p>Petit Prince Presse
Langue Mots Pronoms Dont PERS Dont CLI Mots Pronoms Dont PERS Dont CLI
FR 14 864 20,1% 47,5% 21,8% 26 995 3,1% 23,9% 24,1%
EN 16 495 17,9% 71,3% 23 079 2,4% 38,8%
IT 13 197 11,0% 15,8% 48,7% 26 286 2,2% 5,4% 40,2%
DE 14 007 19,2% 69,9% 20 882 2,9% 37,2%
</p>
<p>TABLE 1 &#8211; Distribution des pronoms selon les langues et les corpus.
</p>
<p>La Table 1 montre les pourcentages d&#8217;occurrence des pronoms. On constate d&#8217;une part que notre corpus litt&#233;raire
contient sensiblement plus de pronoms que notre corpus journalistique, principalement en ce qui concerne les
pronoms personnels. On remarque &#233;galement que les corpus italiens contiennent moins de pronoms personnels &#224;
cause du ph&#233;nom&#232;ne de pro-drop 4. Le nombre de pronoms personnels est plus &#233;lev&#233; en anglais et en allemand
parce qu&#8217;il n&#8217;existe pas de clitiques dans ces langues. Quant aux clitiques, l&#8217;italien pr&#233;sente des pourcentages plus
&#233;lev&#233;s que le fran&#231;ais parce qu&#8217;il y a plus de verbes pronominaux en italien et parce qu&#8217;on utilise des tournures
verbales pronominales l&#224; o&#249; le fran&#231;ais utilise le passif (Russo et al., 2011). Au vu de ces donn&#233;es, on observe que
les pronoms prennent une place consid&#233;rable dans un corpus et que leur traduction constitue donc un probl&#232;me &#224;
ne pas n&#233;gliger.
</p>
<p>3 Les pronoms dans la langue cible
</p>
<p>Pour &#233;valuer la qualit&#233; des traductions, nous avons fait traduire les deux corpus par Its-2 (Wehrli et al., 2009),
traducteur &#224; base de r&#232;gles linguistiques fond&#233; sur l&#8217;analyseur syntaxique Fips. &#192; titre de comparaison, nous avons
&#233;galement traduit les cinq cent premi&#232;res phrases du corpus du Petit Prince 5 par Google Translate, traducteur
&#224; base statistique disponible en ligne 6. Nous avons consid&#233;r&#233; les cinq paires de langues suivantes : allemand-
fran&#231;ais ; fran&#231;ais-anglais ainsi qu&#8217;anglais-fran&#231;ais ; fran&#231;ais- italien ainsi qu&#8217;italien-fran&#231;ais. Les traductions des
pronoms ont &#233;t&#233; ensuite &#233;valu&#233;es manuellement. En particulier, parmi les pronoms mal traduits, nous distinguons
plusieurs cas de figure : i) mauvais type de pronom (1a) ; ii) forme pronominale incompatible avec la r&#233;f&#233;rence
anaphorique (1b) ; iii) mauvaise position du pronom (1c) ; iv) ajout d&#8217;un pronom non requis dans la langue cible
(1d) ; et v) absence d&#8217;un pronom requis dans la langue cible (1e).
</p>
<p>1. Les textes en fran&#231;ais, anglais et allemand sont disponibles sur http://wikilivres.info ; celui en italien sur http://www.
macchianera.net/files/ilpiccoloprincipe.pdf.
</p>
<p>2. Il s&#8217;agit des communiqu&#233;s de 2007, tels que disponibles &#224; l&#8217;addresse : http://www.news.admin.ch. Ce corpus est d&#233;sormais
appel&#233; corpus de Presse ou Presse tout court.
</p>
<p>3. Fips consid&#232;re comme pronoms personnels &#224; la fois les pronoms personnels forts (moi et lui ) et les clitiques sujet (je ou il ).
4. On d&#233;finit le ph&#233;nom&#232;ne du pro-drop comme l&#8217;absence du pronom personnel sujet, qui peut ne pas &#234;tre exprim&#233; en italien gr&#226;ce &#224; la
</p>
<p>richesse de la morphologie verbale.
5. Ce choix a &#233;t&#233; dict&#233; par le nombre consid&#233;rable de pronoms pr&#233;sent dans le texte litt&#233;raire par rapport au texte de la presse.
6. http://translate.google.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LA TRADUCTION AUTOMATIQUE DES PRONOMS. PROBL&#200;MES ET PERSPECTIVES
</p>
<p>(1) a. Qui parle ? b. L&#8217;homme et son chien. c. Il me r&#233;pond.
* That speaks ? * The man and her dog. * Risponde mi.
</p>
<p>d. Il s&#8217;est suicid&#233;. e. Je savais le reconna&#238;tre.
* He committed himself suicide. * Knew to recognize it.
</p>
<p>Dans la Table 2, nous sch&#233;matisons les r&#233;sultats obtenus en termes de pourcentages de pronoms bien traduits, mal
traduits et de pronoms manquants dans la langue cible.
</p>
<p>Its-2 Presse Its-2 Petit Prince Google Petit Prince
Bon Mauvais Manquant Bon Mauvais Manquant Bon Mauvais Manquant
</p>
<p>EN-FR 54% 42% 4% 73% 24% 3% 93% 5% 2%
IT-FR 36% 43% 20% 51% 24% 26% 66% 18% 16%
DE-FR 42% 53% 5% 73% 21% 6% 75% 18% 7%
FR-EN 52% 43% 5% 76% 17% 7% 91% 5% 4%
FR-IT 57% 29% 14% 65% 26% 8% 58% 21% 20%
</p>
<p>TABLE 2 &#8211; Comparaison des paires de langues. Les corpus &#233;valu&#233;s, traduits par Its-2, contiennent environ 1000
phrases (Presse) et environ 1600 phrases (Petit Prince). &#192; titre d&#8217;illustration, on a &#233;valu&#233; 500 phrases du Petit
Prince traduites par Google Translate.
</p>
<p>Globalement, ces r&#233;sultats montrent que le pourcentage d&#8217;erreurs en traduction automatique est assez &#233;lev&#233;, pou-
vant atteindre des valeurs de 63% (pronoms mal traduits et manquants dans Its-2 Presse, pour la paire italien-
fran&#231;ais) ou de 41% (dans Google Petit Prince, pour la paire fran&#231;ais-italien). Le corpus de Presse est plus difficile
&#224; traduire, avec des baisses de performance entre 7% et 31% par rapport au corpus Petit Prince. Cette tendance est
confirm&#233;e par une mini-&#233;tude annexe, non pr&#233;sent&#233;e ici, pour Google Translate, avec une baisse de performance
du m&#234;me ordre de grandeur pour le corpus Presse par rapport au corpus litt&#233;raire.
</p>
<p>Cela confirme en partie l&#8217;affirmation de Kay (1986), en sugg&#233;rant qu&#8217;il y a encore beaucoup &#224; faire en traduction
automatique des pronoms. Une difficult&#233; majeure est caus&#233;e par la diff&#233;rence entre les syst&#232;mes pronominaux de
deux langues. Consid&#233;rons, par exemple, la paire italien-fran&#231;ais. &#192; cause du pro-drop en italien, le syst&#232;me de
traduction doit &#234;tre capable de g&#233;n&#233;rer le pronom personnel sujet en fran&#231;ais. Si ce n&#8217;est pas le cas, la phrase cible
en fran&#231;ais sera agrammaticale (2). Cela explique en partie les pourcentages &#233;lev&#233;s de pronoms manquants atteint
par les deux syst&#232;mes.
</p>
<p>(2) [. . .] e dormono durante i sei mesi che la digestione richiede.
* [. . .] et dort pendant les six mois que la digestion demande. (Its-2)
* [. . .] et dormir pendant les six mois qui n&#233;cessite la digestion. (Google Translate)
</p>
<p>&#8216;[. . .] et ils dorment pendant les six mois que la digestion demande.&#8217;
</p>
<p>Une autre difficult&#233; r&#233;side dans la traduction des pronoms clitiques. Leur mauvaise traduction, voire l&#8217;absence
de leur traduction, dans la langue cible est une erreur fr&#233;quente pour les traducteurs automatiques, comme d&#233;j&#224;
montr&#233; par les travaux de Russo (2011). Un exemple de ce probl&#232;me est fourni en (3), o&#249; &#8211; dans la traduction du
fran&#231;ais vers l&#8217;italien &#8211; les deux syst&#232;mes ne traduisent pas le clitique lui (gli en italien).
</p>
<p>(3) Alors je ne lui parlais ni de serpents boa, ni de for&#234;ts vierges, ni d&#8217;&#233;toiles.
* Allora io parlavo n&#233; d&#8217; serpenti boa, n&#233; di foreste vergini, n&#233; di stelle. (Its-2)
* Allora non avrei mai parlare o boa constrictor, o primordiali foreste, o le stelle. (Google Translate)
</p>
<p>&#8216;Allora non gli parlavo n&#232; di boa constrictor, n&#232; di foreste vergini, n&#232; di stelle.&#8217;
</p>
<p>4 &#201;valuation des r&#233;sultats en Its-2
</p>
<p>Pour mieux comprendre les difficult&#233;s que notre syst&#232;me rencontre lors de la traduction des pronoms, nous avons
analys&#233; dans les d&#233;tails la traduction effectu&#233;e par Its-2 sur les deux corpus. Un avantage consid&#233;rable d&#8217;un
syst&#232;me de traduction automatique linguistique comme Its-2 est qu&#8217;il fournit directement les &#233;tiquetages morpho-
syntaxiques des mots de la phrase cible. Un premier r&#233;sultat constitue donc la distribution des cat&#233;gories prono-
minales dans les diff&#233;rentes langues cibles (Table 3).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y. SCHERRER, L. RUSSO, J.-P. GOLDMAN, S. LO&#193;ICIGA, L. NERIMA, &#201;. WEHRLI
</p>
<p>En particulier, les paires de langues ayant le fran&#231;ais comme langue cible sont instructives : comme il s&#8217;agit des
m&#234;mes textes, la distribution des pronoms devrait &#234;tre similaire. Or, beaucoup moins de pronoms apparaissent
en italien-fran&#231;ais (2982 occurrences, Table 3) que dans les deux autres paires de langues (3910 occurrences en
anglais-fran&#231;ais). Cela est d&#251; &#224; l&#8217;omission du pronom personnel sujet et des pronoms clitiques en fran&#231;ais &#8211; comme
d&#233;j&#224; montr&#233; en (2) et en (3) &#8211;, mais aussi &#224; la non-g&#233;n&#233;ration en fran&#231;ais des pronoms d&#233;monstratifs c&#8217; et &#231;a (4).
On remarque aussi que, globalement, on g&#233;n&#232;re davantage de pronoms d&#233;monstratifs en partant du fran&#231;ais (0,99%
en fran&#231;ais-italien) qu&#8217;en traduisant vers le fran&#231;ais (0,23% en italien-fran&#231;ais). Ceci est &#224; nouveau en rapport avec
les d&#233;monstratifs faibles c&#8217; et &#231;a, qu&#8217;on retrouve plut&#244;t sous forme de pronom personnel neutre en allemand (es)
et en anglais (it). En ce qui concerne la paire anglais-fran&#231;ais, il peut arriver que l&#8217;analyseur syntaxique d&#233;tecte
des phrases relatives &#224; pronom relatif nul de mani&#232;re erronn&#233;e. Par cons&#233;quent, Its-2 g&#233;n&#232;re des pronoms relatifs
dans la langue cible alors qu&#8217;il ne s&#8217;agit pas d&#8217;une phrase relative.
</p>
<p>(4) &#200; il mio aeroplano.
* Mon avion est. (Its-2)
</p>
<p>&#8216;C&#8217;est mon avion.&#8217;
</p>
<p>Paire CLI PERS POSS DEM REL INDEF INTER Total Pronoms Mots
EN-FR 1,73% 4,08% 1,2% 0,45% 0,82% 0,34% 0,33% 8,96% 3910 43654
IT-FR 1,58% 3,76% 0,79% 0,23% 0,08% 0,09% 0,68% 7,21% 2982 41337
DE-FR 1,98% 4,39% 0,94% 0,53% 0,28% 0,39% 0,81% 9,31% 3450 37049
FR-EN 0% 4,47% 1,05% 0,94% 0,66% 0,16% 0,2% 7,47% 3135 41954
FR-IT 1,71% 3,8% 1,1% 0,99% 0,07% 0,15% 0,75% 8,57% 3394 39611
</p>
<p>TABLE 3 &#8211; Distribution des pronoms g&#233;n&#233;r&#233;s par Its-2 dans la langue cible. Les chiffres repr&#233;sentent des pourcen-
tages de tous les mots dans les corpus Petit Prince et Presse cumul&#233;s.
</p>
<p>CLI PERS POSS DEM REL INDEF INTER Moyenne
EN-FR 77% 79% 81% 76% 75% 84% 61% 78%
IT-FR 75% 69% 68% 75% 75% 71% 60% 69%
DE-FR 52% 45% 52% 52% 50% 43% 29% 46%
FR-EN 71% 64% 74% 58% 75% 65% 69%
FR-IT 70% 70% 64% 74% 56% 66% 60% 69%
</p>
<p>TABLE 4 &#8211; Pourcentage de pronoms &#233;valu&#233;s comme corrects pour chaque type de pronom.
</p>
<p>Nous avons d&#233;j&#224; montr&#233; les chiffres globaux de notre &#233;valuation manuelle (Table 2). En distinguant les diff&#233;rentes
cat&#233;gories des pronoms, on obtient les chiffres d&#233;taill&#233;s de la Table 4. Globalement, on voit que la paire allemand-
fran&#231;ais est en retrait par rapport aux autres (&#224; l&#8217;exception des pronoms relatifs en fran&#231;ais-italien et en fran&#231;ais-
anglais). Cela est d&#251; principalement &#224; la plus grande distance linguistique entre ces deux langues. 7
</p>
<p>5 Pistes de recherche
</p>
<p>L&#8217;objectif de notre recherche &#233;tant l&#8217;am&#233;lioration de notre syst&#232;me de traduction automatique sur les pronoms,
nous avons rep&#233;r&#233; les deux principales difficult&#233;s qui subsistent pour notre syst&#232;me : l&#8217;ambigu&#239;t&#233; des formes
pronominales dans la langue source et l&#8217;ambigu&#239;t&#233; du transfert vers la langue cible. Nous avons donc identifi&#233;
deux pistes de recherche principales pour r&#233;soudre ces probl&#232;mes : la premi&#232;re consiste &#224; am&#233;liorer la d&#233;tection des
pronoms, pour distinguer, par exemple, les formes homographes telles que les d&#233;terminants et les pronoms relatifs
en allemand (der, die, das, den, . . .) 8. La deuxi&#232;me piste concerne l&#8217;int&#233;gration d&#8217;un module d&#8217;identification des
r&#233;f&#233;rences pronominales, en suivant l&#8217;exemple de travaux tels que celui de Le Nagard &amp; Koehn (2010) sur un
syst&#232;me de traduction automatique statistique (TAS).
</p>
<p>7. Pour une &#233;tude portant sur la mesure de la distance linguistique ainsi que sur leur influence sur la traduction automatique, voir Birch
et al. (2008).
</p>
<p>8. Dans ce cas sp&#233;cifique, le pronom relatif en allemand est obligatoirement pr&#233;c&#233;d&#233; d&#8217;une virgule ou d&#8217;une pr&#233;position elle-m&#234;me pr&#233;c&#233;-
d&#233;e d&#8217;une virgule. Des contraintes suppl&#233;mentaires dans l&#8217;analyse pourraient donc r&#233;duire cette ambigu&#239;t&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LA TRADUCTION AUTOMATIQUE DES PRONOMS. PROBL&#200;MES ET PERSPECTIVES
</p>
<p>R&#233;solution des ambigu&#239;t&#233;s d&#8217;analyse Une &#233;valuation suppl&#233;mentaire de l&#8217;&#233;tiquetage au niveau de la langue
source montre que le pourcentage de pronoms mal &#233;tiquet&#233;s peut &#234;tre assez &#233;lev&#233;. Les chiffres se situent entre
2,74% (Petit Prince anglais), pouvant aller jusqu&#8217;&#224; 34,27% (Presse allemand). 9 Parmi ces erreurs, on trouve des
cas d&#8217;&#233;tiquetage de la mauvaise partie du discours. Au-del&#224; de l&#8217;exemple allemand mentionn&#233; ci-dessus, on peut
citer l&#8217;ambigu&#239;t&#233; de formes telles que la, le et li en italien, qui peuvent &#234;tre des d&#233;terminants ou des pronoms
clitiques. On trouve &#233;galement des cas d&#8217;&#233;tiquetage dans la mauvaise cat&#233;gorie pronominale. Par exemple, qui
en fran&#231;ais peut &#234;tre analys&#233; comme un pronom interrogatif ou par un pronom relatif, tout comme che en italien
(Russo et al., 2011).
</p>
<p>Des erreurs d&#8217;&#233;tiquetage plus fines, non comptabilis&#233;es dans les chiffres ci-dessus, concernent l&#8217;&#233;tiquetage mor-
phologique. Par exemple, le pronom personnel allemand sie est soit singulier f&#233;minin, soit pluriel (tous genres). 10
</p>
<p>En cas de pronom sujet, il peut &#234;tre d&#233;sambigu&#239;s&#233; facilement &#224; l&#8217;aide de l&#8217;analyse syntaxique. Nos r&#233;sultats pour
la paire allemand-fran&#231;ais confirment aussi les r&#233;sultats obtenus par Hardmeier &amp; Federico (2010), qui ont &#233;tudi&#233;
la performance d&#8217;un traducteur automatique &#224; base statistique sur les pronoms personnels pour la traduction de
l&#8217;allemand vers l&#8217;anglais. Ils ont montr&#233; que les pronoms de politesse et les r&#233;flexifs, de par leur ambigu&#239;t&#233; de
genre et nombre, posent probl&#232;me lors de la traduction.
</p>
<p>Un autre exemple concerne l&#8217;ambigu&#239;t&#233; du pronom il en fran&#231;ais, qui peut &#234;tre un pronom personnel ou imper-
sonnel selon la construction syntaxique dans laquelle il appara&#238;t. S&#8217;il appara&#238;t comme pronom personnel, il faudra
rechercher son ant&#233;cedent pour pouvoir le traduire correctement dans la langue cible. S&#8217;il appara&#238;t comme pro-
nom impersonnel, la recherche de son ant&#233;cedent dans le texte est inutile. 11 En ce qui concerne l&#8217;italien, on peut
souligner encore l&#8217;ambigu&#239;t&#233; de la forme loro, qui peut &#234;tre un pronom personnel sujet de troisi&#232;me personne du
pluriel, mais aussi un pronom faible et un d&#233;terminant possessif. La distinction entre ces diff&#233;rentes formes peut
&#234;tre faite en fonction du groupe verbal ou du groupe nominal.
</p>
<p>R&#233;solution des anaphores pronominales Sur notre corpus, nous avons aussi sp&#233;cifi&#233; quelles erreurs &#233;taient
dues &#224; l&#8217;absence d&#8217;une r&#233;solution anaphorique. 12 En ce qui concerne le corpus de Presse, les erreurs d&#8217;anaphores
occupent une partie importante. Par contre, dans le corpus du Petit Prince, les erreurs d&#8217;anaphores sont rares (Table
5), sauf en italien-fran&#231;ais et en fran&#231;ais-italien, o&#249; certains mots tr&#232;s fr&#233;quents dans le Petit Prince montrent une
diff&#233;rence de genre : c&#8217;est le cas de plan&#232;te et fleur (masculins en italien, f&#233;minins en fran&#231;ais) ou renard (f&#233;minin
en italien, masculin en fran&#231;ais). En l&#8217;absence d&#8217;un module capable d&#8217;identifier les ant&#233;c&#233;dents des pronoms, le
syst&#232;me traduit un pronom f&#233;minin de la langue source par un pronom f&#233;minin de la langue cible. Ce probl&#232;me
est accentu&#233; par la surg&#233;n&#233;ration du pronom personnel sujet en fran&#231;ais-italien, non requis &#224; cause du pro-drop.
Les phrases g&#233;n&#233;r&#233;es restent grammaticalement correctes, mais dans certains cas la r&#233;f&#233;rence anaphorique n&#8217;est
pas correcte.
</p>
<p>Mauvaise r&#233;f&#233;rence anaphorique
Petit Prince Presse
</p>
<p>EN-FR 1,58% 22,38%
DE-FR 1,34% 16,94%
IT-FR 6,27% 3,66%
FR-IT 8,19% 3,68%
</p>
<p>TABLE 5 &#8211; Nombre de pronoms annot&#233;s comme faux &#224; cause d&#8217;une r&#233;f&#233;rence anaphorique mal choisie.
</p>
<p>Des syst&#232;mes de TAS &#224; segments permettent une r&#233;solution d&#8217;anaphores basique : si la table de traduction
contiennent des segments de longueur maximale n au niveau de la langue source, elle peut encoder des cha&#238;nes
anaphoriques dont la distance entre le pronom et l&#8217;ant&#233;c&#233;dent est inf&#233;rieure ou &#233;gale &#224; n. Les exemples en (5a-b),
</p>
<p>9. Les erreurs d&#8217;&#233;tiquetage plus nombreux en allemand constituent une explication suppl&#233;mentaire des mauvais r&#233;sultats observ&#233;s dans la
Table 4.
</p>
<p>10. Nous ne tenons pas compte ici d&#8217;une troisi&#232;me possibilit&#233;, la forme de politesse Sie, qui ne peut &#234;tre distingu&#233; syntaxiquement de la
troisi&#232;me personne du pluriel.
</p>
<p>11. &#192; ce propos, nous renvoyons le lecteur aux travaux de Danlos (2005) sur un syst&#232;me qui permet de r&#233;cup&#233;rer les occurrences du pronom
impersonnel il.
</p>
<p>12. Nous n&#8217;avons pas fait cette annotation pour la paire fran&#231;ais-anglais. Ce comptage concerne les erreurs, pas les cas de r&#233;f&#233;rences
anaphoriques en g&#233;n&#233;ral. En effet, en utilisant une r&#232;gle par d&#233;faut qui traduit l&#8217;anglais it par le fran&#231;ais il, on arrive &#224; r&#233;soudre un bon nombre
de cas de mani&#232;re correcte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>Y. SCHERRER, L. RUSSO, J.-P. GOLDMAN, S. LO&#193;ICIGA, L. NERIMA, &#201;. WEHRLI
</p>
<p>pris de nos exp&#233;riences avec Google Translate, illustrent ce ph&#233;nom&#232;ne, o&#249; l&#8217;introduction d&#8217;un adverbe emp&#234;che
le syst&#232;me de retrouver la cha&#238;ne anaphorique. &#192; l&#8217;oppos&#233;, la distance de surface entre anaphore et ant&#233;c&#233;dent
n&#8217;est pas pertinente pour des syst&#232;mes de TA linguistiques.
</p>
<p>(5) a. Elle choisissait avec soin ses couleurs.&#8594; her colors
b. Elle choisissait avec &#233;norm&#233;ment de soin ses couleurs&#8594; its colors
</p>
<p>Les chiffres pr&#233;sent&#233;s ci-dessus montrent que le probl&#232;me de la r&#233;solution d&#8217;anaphores est fortement d&#233;pendant
du registre du texte et que l&#8217;inclusion d&#8217;un tel module dans un syst&#232;me de TA &#8211; dans la ligne des travaux de Lappin
&amp; Leass (1994) et Mitkov et al. (2002) &#8211; pourrait sensiblement am&#233;liorer sa qualit&#233;. M&#234;me si des travaux r&#233;cents
sur l&#8217;inclusion d&#8217;un module de r&#233;f&#233;rences anaphoriques dans un syst&#232;me de traduction automatique statistique
n&#8217;ont pas montr&#233; de gains substantiels (Hardmeier &amp; Federico, 2010; Le Nagard &amp; Koehn, 2010), l&#8217;approche
fondamentalement diff&#233;rente de notre syst&#232;me de TA linguistique pourrait plaider en faveur d&#8217;une telle extension.
</p>
<p>6 Conclusion
</p>
<p>Dans ce travail, nous avons montr&#233; l&#8217;importance des pronoms dans la traduction automatique. Apr&#232;s avoir &#233;tabli
la fr&#233;quence &#233;lev&#233;e des pronoms dans les corpus et dans les langues consid&#233;r&#233;es, nous avons discut&#233; les limites et
les faiblesses des syst&#232;mes de traduction automatique et en particulier du n&#244;tre, Its-2. Nous avons &#233;valu&#233; dans les
d&#233;tails les traductions de notre syst&#232;me pour proposer quelques pistes de recherche qui devraient nous permettre
d&#8217;am&#233;liorer ses performances.
</p>
<p>R&#233;f&#233;rences
BIRCH A., OSBORNE M. &amp; KOEHN P. (2008). Predicting success in machine translation. In Actes de EMNLP
2008, Honolulu.
DANLOS L. (2005). ILIMP : Outil pour rep&#233;rer les occurrences du pronom impersonnel il. In Actes de TALN&#8217;05,
p. 123&#8211;132, Dourdan.
HARDMEIER C. &amp; FEDERICO M. (2010). Modelling pronominal anaphora in statistical machine translation. In
Proceedings of the 7th International Workshop on Spoken Language Translation, Paris.
KAY M. (1986). Machine translation will not work. In Proceedings of ACL&#8217;86, p. 286.
LAPPIN S. &amp; LEASS H. J. (1994). An algorithm for pronominal anaphora resolution. Computational Linguistics,
20(4), 535&#8211;561.
LAURENT D. (2001). De la r&#233;solution des anaphores. Rapport interne, Synapse D&#233;veloppement.
LE NAGARD R. &amp; KOEHN P. (2010). Aiding pronoun translation with co-reference resolution. In Proceedings
of the Joint Fifth Workshop on Statistical Machine Translation and MetricsMATR, p. 252&#8211;261, Uppsala.
MITKOV R., EVANS R. &amp; ORA&#774;SAN C. (2002). A new, fully automatic version of Mitkov&#8217;s knowledge-poor
pronoun resolution method. In Proceedings of CICLing&#8217;02, Mexico City.
MITKOV R., EVANS R., ORA&#774;SAN C., HA L. &amp; PEKAR V. (2007). Anaphora resolution : To what extent does
it help NLP applications ? In A. BRANCO, Ed., Anaphora : Analysis, Algorithms and Applications : Springer.
RUSSO L. (2011). La traduction automatique entre langues proches : les pronoms clitiques en italien et en
fran&#231;ais. In G. B. BARBEAU, C. GAGN&#201; &amp; G. LEBLANC, Eds., Actes des XXIVes Journ&#233;es de linguistique, p.
141&#8211;153, Qu&#233;bec : CIRAL.
RUSSO L., SCHERRER Y., GOLDMAN J.-P., LO&#193;ICIGA S., NERIMA L. &amp; WEHRLI E. (2011). &#201;tude inter-
langues de la distribution et des ambigu&#239;t&#233;s syntaxiques des pronoms. In Actes de TALN&#8217;11, Montpellier.
TUTIN A. (2002). A corpus-based study of pronominal anaphoric expressions in French. In Proceedings of
DAARC 2002 (Discourse Anaphora and Anaphora Resolution), Lisbonne.
WEHRLI E. (2007). Fips, a &#8220;deep&#8221; linguistic multilingual parser. In Proceedings of the ACL 2007 Workshop on
Deep Linguistic Processing, p. 120&#8211;127, Prague.
WEHRLI E., NERIMA L. &amp; SCHERRER Y. (2009). Deep linguistic multilingual translation and bilingual dictio-
naries. In Proceedings of the Fourth Workshop on Statistical Machine Translation, p. 90&#8211;94, Ath&#232;nes.</p>

</div></div>
</body></html>