<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>LOL : Langage objet d&#233;di&#233; &#224; la programmation linguistique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>LOL : LANGAGE OBJET DEDIE A LA PROGRAMMATION LINGUISTIQUE 
 
</p>
<p>LOL : Langage objet d&#233;di&#233; &#224; la programmation linguistique 
</p>
<p> 
</p>
<p>Jimmy Ma, Micka&#235;l Mounier, Helena Blancafort, Javier Couto, Claude de Loupy  
</p>
<p> 
</p>
<p>(1) Syllabs, 15 rue Jean-Baptiste Berlier, 75013 Paris, France 
{ma, mounier, blancafort, couto, loupy}@syllabs.com 
</p>
<p>LOL (Linguistic Object Language) est un langage d&#233;di&#233; &#224; la description d&#8217;objets linguistiques d&#233;velopp&#233; 
par la soci&#233;t&#233; Syllabs. Ce langage s&#8217;int&#232;gre dans une plateforme industrielle et permet aux linguistes  
d&#8217;&#233;crire des r&#232;gles d&#8217;extraction d&#8217;information ainsi que des r&#232;gles de correction d&#8217;&#233;tiquetage 
morphosyntaxique. Lors de la conception de ce langage, l&#8217;id&#233;e &#233;tait de proposer un vrai langage de 
programmation qui soit &#224; la fois puissant au niveau de l&#8217;expression et &#224; la fois simple &#224; utiliser par des 
linguistes. De plus, ce langage permet une manipulation de plus haut niveau sans nuire aux performances du 
syst&#232;me produit.  
</p>
<p>LOL est un langage d&#233;claratif qui permet de visualiser la langue sous la forme d&#8217;un langage de description 
de connaissances linguistiques plut&#244;t que d&#8217;un langage de programmation. LOL est aussi un langage objet 
avec des objets pr&#233;d&#233;finis comme les tokens (mots, pr&#233;fixes, etc.), les phrases, etc. Les linguistes peuvent 
d&#233;finir leurs propres objets, des listes d'&#233;l&#233;ments, ou des objets plus complexes reconnus &#224; l&#8217;aide de patrons. 
Les sp&#233;cifications &#233;crites par les linguistes sont interpr&#233;t&#233;es et mises en relation avec l&#8217;ensemble des 
ressources et outils de base d&#233;velopp&#233;s par Syllabs (un lexique morphosyntaxique, un segmenteur, un 
&#233;tiqueteur morphosyntaxique, un guesser). Cette plateforme inclut &#233;galement un outil de visualisation en 
html. La sortie peut actuellement &#234;tre fournie sous format txt, XML ou JSON. Les analyseurs ainsi produits 
sont mis &#224; disposition via des APIs REST (web services) sur les plateformes de Syllabs.  
</p>
<p>Concernant la manipulation des objets linguistiques, le linguiste manipule des tokens et ses diff&#233;rents 
attributs. Il peut ainsi acc&#233;der &#224; diff&#233;rentes informations du token: 1) classe du token (mot, url, etc.), 2) 
information lexicales et morphosyntaxiques, 3) information graphique (typographie, nombre de caract&#232;res, 
etc.), 4) informations sur le guessing (s&#8217;il s&#8217;agit d&#8217;un token inconnu et si oui, s&#8217;il a &#233;t&#233; devin&#233;) ; 5) 
positionnelles pour faire des conditions en fonction de la position dans le texte (ex : d&#233;but de phrase ou de 
paragraphe). Ci-dessous un exemple de r&#232;gle de correction et de r&#232;gle d&#8217;extraction. 
</p>
<p>correction_rule  { 
// correction d&#8217;erreur   
//due &#224; l&#8217;ambigu&#239;t&#233; Nom-Adjectif   
 [conditions] 
</p>
<p> token.POS(D) | token.POS(X)  
</p>
<p> token.POS(A)&amp; token.ambig(N)
</p>
<p> token.POS(Sp)  
 [actions] 
 match[2].POS=N 
}  
</p>
<p>extraction_rule { 
[conditions] 
!left_filter_potentialPN | token.class(begin) 
f: FirstNameCap{1,2} 
l: (PREMOD_NOM)? FamilyNameCap //(token.string(&quot;-&quot;)? FamilyNameCap)? 
[actions] 
 create Person[f,l] : priority(1); confidence = 1.0 { 
  firstname = match[f]  
  lastname  = match[l]  
 } 
} 
</p>
<p>Figure 1 : Exemples de r&#232;gles 
</p>
<p>Aujourd&#8217;hui LOL est utilis&#233; dans plusieurs applications industrielles commercialis&#233;es, notamment pour des 
applications bas&#233;e sur l&#8217;extraction d&#8217;information (par ex. analyse de tonalit&#233;) et pouvant s&#8217;int&#233;grer dans un 
processus de veille ou de tagging automatique de textes. Le linguiste peut &#233;galement utiliser l&#8217;outil pour 
am&#233;liorer l&#8217;&#233;tiqueteur morphosyntaxique, voire le sp&#233;cialiser sur le corpus du client en jouant sur les 
diff&#233;rentes propri&#233;t&#233;s du token (par ex. : conditions d&#8217;application d&#8217;une r&#232;gle en fonction de la classe du 
token, la position dans le texte, le contexte et graphie). LOL est ind&#233;pendant de la langue et est utilis&#233; dans 
des applications industrielles ou de recherche en 8 langues, dont le chinois et le russe. Nous pr&#233;voyons 
d&#8217;ouvrir la plateforme de mani&#232;re &#224; permettre &#224; des utilisateurs de cr&#233;er leurs propres analyseurs.  </p>

</div></div>
</body></html>