<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Ordonner un r&#233;sum&#233; automatique multi-documents fond&#233; sur une classification des phrases en classes lexicales</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Ordonner un r&#233;sum&#233; automatique multi-documents fond&#233; sur une
classification des phrases en classes lexicales
</p>
<p>Aur&#233;lien Bossard &#201;milie Guimier De Neef
Orange Labs
</p>
<p>2 av. Pierre Marzin
22300 Lannion, France
</p>
<p>prenom.nom@orange-ftgroup.com
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons diff&#233;rentes m&#233;thodes de r&#233;ordonnancement de phrases pour le r&#233;sum&#233; automa-
tique fond&#233; sur une classification des phrases &#224; r&#233;sumer en classes th&#233;matiques. Nous comparons ces m&#233;thodes &#224;
deux baselines : ordonnancement des phrases selon leur pertinence et ordonnancement selon la date et la position
dans le document d&#8217;origine. Nous avons fait &#233;valuer les r&#233;sum&#233;s obtenus sur le corpus RPM2 par 4 annotateurs et
pr&#233;sentons les r&#233;sultats.
</p>
<p>Abstract. We present several sentence ordering methods for automatic summarization which are specific
to multi-document summarizers, based on sentences subtopic clustering. These methods are compared to two ba-
selines : sentence ordering according to pertinence and according to publication date and inner document position.
The resulting summaries on RPM2 corpus have been evaluated by four judges.
</p>
<p>Mots-cl&#233;s : R&#233;sum&#233; automatique, ordonnancement de phrases.
</p>
<p>Keywords: Automatic summarization, sentence ordering.
</p>
<p>1 Introduction
</p>
<p>Les syst&#232;mes de r&#233;sum&#233; automatique multi-documents par extraction fond&#233;s sur une classification pr&#233;alable des
phrases en classes lexicales (CL) ont r&#233;cemment prouv&#233; leur efficacit&#233; lors des campagnes d&#8217;&#233;valuation interna-
tionales TAC 1. Ces syst&#232;mes offrent une mod&#233;lisation du corpus &#224; r&#233;sumer diff&#233;rente de celles traditionnellement
utilis&#233;es . La redondance dans les corpus multi-documents est plus importante que dans des documents simples.
Une telle mod&#233;lisation le prend en compte, et s&#8217;appuie sur la redondance pour cibler l&#8217;information pertinente
tout en &#233;vitant la r&#233;p&#233;tition d&#8217;&#233;l&#233;ments d&#8217;information dans le r&#233;sum&#233;. Nous avons montr&#233; que cette mod&#233;lisation
pouvait &#234;tre utile afin d&#8217;affiner la s&#233;lection de phrases (Bossard &amp; De Neef, 2011).
</p>
<p>La probl&#233;matique du r&#233;ordonnancement de phrases pour le r&#233;sum&#233; multi-documents est plus complexe que pour
le r&#233;sum&#233; mono-document. En effet, dans un document unique, les phrases sont toutes issues de la m&#234;me structure
discursive, et peuvent &#234;tre restitu&#233;es dans l&#8217;ordre du document source. En revanche, en multi-documents, les
phrases peuvent &#234;tre extraites de documents &#233;pars, et une structure discursive doit &#234;tre recompos&#233;e. Nous montrons
ici que la mod&#233;lisation en classes lexicales peut &#233;galement servir &#224; r&#233;ordonner les phrases du r&#233;sum&#233;, et pr&#233;sentons
une &#233;valuation de notre m&#233;thode de r&#233;ordonnancement. Dans un premier temps, nous dressons un &#233;tat de l&#8217;art
de l&#8217;ordonnancement de phrases pour le r&#233;sum&#233; automatique. Cet &#233;tat de l&#8217;art vise &#224; renseigner le lecteur sur
les diff&#233;rentes strat&#233;gies de r&#233;ordonnancement de r&#233;sum&#233;, non sur les m&#233;thodes de r&#233;sum&#233; en soi. Pour plus de
renseignements sur les m&#233;thodes de r&#233;sum&#233; automatique, le lecteur pourra se r&#233;f&#233;rer &#224; (Mani, 1999) ou &#224; (Das
&amp; Martins, 2007). Dans un second temps, nous pr&#233;sentons notre m&#233;thode d&#8217;ordonnancement et son &#233;valuation
r&#233;alis&#233;e sur le corpus RPM2 (de Loupy et al., 2010). Enfin, nous discutons les r&#233;sultats obtenus
</p>
<p>1. Text Analysis Conference, organis&#233;e par le National Institute of Science and Technology : http://www.nist.gov/tac</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AUR&#201;LIEN BOSSARD, &#201;MILIE GUIMIER DE NEEF
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>&#192; c&#244;t&#233; de mod&#233;lisations chronologiques ou rh&#233;toriques, peu robustes et non g&#233;n&#233;riques (Lin et al., 2008; Rutledge
et al., 2000), des auteurs ont privil&#233;gi&#233; des approches fond&#233;es uniquement sur des indices lexicaux, tentant de
maximiser le vocabulaire commun de deux phrases voisines dans le r&#233;sum&#233; (Wang, 2002), ou fond&#233;es sur la
position des phrases dans leur document d&#8217;origine et la date de ce dernier (Saggion &amp; Gaizauskas, 2004). Ces
approches ne garantissent cependant pas la coh&#233;rence logique ni chronologique du r&#233;sum&#233;. La position d&#8217;une
phrase dans un document permet difficilement d&#8217;en d&#233;duire la position dans un texte diff&#233;rent.
</p>
<p>Pour r&#233;pondre &#224; ce probl&#232;me, Regina Barzilay et al. (2002) g&#233;n&#232;rent des r&#233;sum&#233;s fond&#233;s sur la d&#233;tection de pa-
raphrases. Une phrase est extraite de chacun des groupes paraphrastiques, et ces m&#234;mes groupes sont utilis&#233;s afin
de d&#233;terminer un ordre entre les phrases. Ainsi, ce ne sont plus les caract&#233;ristiques d&#8217;une phrase isol&#233;e qui d&#233;ter-
minent sa position dans le r&#233;sum&#233;, mais les caract&#233;ristiques des phrases d&#8217;un groupe paraphrastique. L&#8217;algorithme
MO &#8211; Majority Ordering &#8211; construit un graphe orient&#233; des groupes paraphrastiques. Le poids du lien d&#8217;un groupe
G1 vers un groupe G2 est &#233;gal au nombre de documents dans lequel une phrase class&#233;e dans G1 pr&#233;c&#232;de une
phrase class&#233;e dansG2. Ordonner les phrases du r&#233;sum&#233; revient alors &#224; ordonner les groupes paraphrastiques dont
elles sont issues.
</p>
<p>Notre approche est semblable &#224; ce dernier algorithme. Cependant, nous ne fondons pas le r&#233;sum&#233; automatique sur
la d&#233;tection de paraphrases au sens strict &#8211; (Regina Barzilay et al., 2002) d&#233;tectent les paraphrases par comparaison
d&#8217;arbres syntaxiques et ajout d&#8217;informations s&#233;mantiques &#8211; mais sur la classification lexicale des phrases. Par
cons&#233;quent, les classes que nous utilisons sont plus &#233;tendues, et les documents comportant plusieurs phrases d&#8217;au
moins deux CL sont plus nombreux, ce qui oblige &#224; revoir les approches de cr&#233;ation du graphe et du parcours de
celui-ci.
</p>
<p>3 Notre m&#233;thode d&#8217;ordonnancement
</p>
<p>3.1 Le r&#233;sum&#233; par classification en classes lexicales &#8211; CBSEAS
</p>
<p>Nous fondons notre approche de r&#233;sum&#233; automatique sur le syst&#232;me CBSEAS, pr&#233;sent&#233; en d&#233;tails dans (Bossard
&amp; De Neef, 2011). Celui-ci proc&#232;de en deux &#233;tapes : regrouper les phrases en CL, puis s&#233;lectionner les phrases &#224;
extraire, &#224; raison d&#8217;une phrase par classe au maximum. Dans le syst&#232;me utilis&#233; pour l&#8217;article, le nombre de classes
est fix&#233; &#224; 8 2. L&#8217;intuition derri&#232;re ce syst&#232;me est que la classification des phrases permet d&#8217;une part d&#8217;&#233;viter la
redondance dans les r&#233;sum&#233;s g&#233;n&#233;r&#233;s, d&#8217;autre part de disposer de deux crit&#232;res d&#8217;extraction : la pertinence d&#8217;une
phrase vis-&#224;-vis du contenu global des documents (centralit&#233; globale) et la pertinence d&#8217;une phrase vis-&#224;-vis de sa
CL (centralit&#233; locale). La campagne d&#8217;&#233;valuation TAC 2009 t&#233;moigne de l&#8217;efficacit&#233; de ce syst&#232;me de r&#233;sum&#233; pour
ce qui est de l&#8217;extraction d&#8217;informations essentielles (Bossard &amp; Poibeau, 2009). Ces r&#233;sultats sont corrobor&#233;s par
une exp&#233;rience sur un corpus fran&#231;ais (Bossard &amp; De Neef, 2011) . En revanche, les campagnes TAC ont r&#233;v&#233;l&#233;
des probl&#232;mes de lisibilit&#233; chez les utilisateurs. Nous supposons que ceci est d&#251; pour une grande partie au manque
de coh&#233;rences logique et chronologique des r&#233;sum&#233;s (ordre des faits cit&#233;s inappropri&#233;), m&#234;me si d&#8217;autres aspects
entrent en ligne de compte : anaphores non r&#233;solues, conjonction de coordination ind&#233;sirables... La section qui
suit propose une strat&#233;gie pour r&#233;soudre ce probl&#232;me.
</p>
<p>3.2 Ordonner les phrases &#224; l&#8217;aide des classes lexicales
</p>
<p>Nous faisons l&#8217;hypoth&#232;se que les phrases du r&#233;sum&#233; peuvent &#234;tre ordonn&#233;es dans le m&#234;me ordre que les classes
dont elles sont issues. Nous faisons &#233;galement l&#8217;hypoth&#232;se que l&#8217;ordre des phrases dans les documents d&#8217;origine
refl&#232;te un ordre logico-temporel, partag&#233; par l&#8217;ensemble des documents &#224; r&#233;sumer, et qu&#8217;il est possible de projeter
sur les phrases du r&#233;sum&#233;. Les m&#233;thodes d&#8217;ordonnancement que nous proposons se veulent les plus g&#233;n&#233;riques
possible, ne faisant appel &#224; aucune technique linguistique d&#233;pendante de la langue. Cependant, cette hypoth&#232;se
contraint les documents sur lesquels la m&#233;thode est applicable. Dans l&#8217;exp&#233;rience que nous avons men&#233;e, les
</p>
<p>2. Le syst&#232;me cr&#233;e ainsi 8 classes pour extraire 8 phrases d&#8217;une longueur moyenne suppos&#233;e de 22 mots.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ORDONNER UN R&#201;SUM&#201; AUTOMATIQUE MULTI-DOCUMENTS
</p>
<p>documents en entr&#233;e sont tous des d&#233;p&#234;ches de presse, majoritairement organis&#233;es autour de la m&#234;me structuration
de l&#8217;information, en pyramide invers&#233;e.
</p>
<p>Les m&#233;thodes que nous proposons sont fortement semblables &#224; celle d&#233;crite dans (Regina Barzilay et al., 2002).
Cependant, celle-ci compte seulement le nombre de documents dans lesquels une phrase d&#8217;une classe B suit une
phrase d&#8217;une classe A, tandis que nous calculons la proportion de phrases de B situ&#233;es apr&#232;s des phrases de A,
transposables sous formes de probabilit&#233;s. De plus, nous proposons une &#233;valuation diff&#233;rente, en comparant nos
m&#233;thodes avec une baseline plus performante.
</p>
<p>3.2.1 G&#233;n&#233;ration du graphe d&#8217;ordonnancement
</p>
<p>Lors d&#8217;une premi&#232;re &#233;tape, un graphe orient&#233; d&#8217;ordonnancement des phrases est &#233;tabli, dans lequel les n&#339;uds
sont les CL. Le poids des ar&#234;tes est calcul&#233; de deux mani&#232;res diff&#233;rentes. Dans la premi&#232;re (m&#233;thode DU, pour
&#171; Distance Unique &#187;), le poids de l&#8217;ar&#234;te d&#8217;une CL A &#224; une CL B est &#233;gal &#224; :
</p>
<p>nA&gt;B &#8722; nB&gt;A
nA&gt;B + nB&gt;A
</p>
<p>(1)
</p>
<p>o&#249; nX&gt;Y est le nombre couples de phrases (pX , pY ) tels que :
&#8211; pX appartient &#224; la classe th&#233;matique X ;
&#8211; pY appartient &#224; la classe th&#233;matique Y ;
&#8211; pX et pY sont extraites du m&#234;me document ;
&#8211; pX est situ&#233;e apr&#232;s pY .
Dans la seconde (m&#233;thode DR pour, &#171; Distance Relative &#187;), le poids de l&#8217;ar&#234;te d&#8217;une CL A &#224; une CL B est &#233;gal &#224; :&#8721;
</p>
<p>(pA,pB)&#8712;Cp(A,B) &#948;pos(pA, pB)&#8721;
(pA,pB)&#8712;Cp(A,B) |&#948;pos(pA, pB)|
</p>
<p>(2)
</p>
<p>o&#249; :
&#8211; Cp(X,Y ) est l&#8217;ensemble des couples de phrases telles qu&#8217;elles appartiennent au m&#234;me document, la premi&#232;re
</p>
<p>appartient &#224; la classe X et la seconde &#224; la classe Y.
&#8211; &#948;pos(pX , pY ) est le nombre de phrases s&#233;parant pX de pY si pX est situ&#233; apr&#232;s pY , et l&#8217;oppos&#233; du nombre de
</p>
<p>phrases s&#233;parant pX de pY si pX pr&#233;c&#232;de pY .
</p>
<p>A la diff&#233;rence de DR, DU ne prend pas en compte la distance entre les phrases d&#8217;un m&#234;me document mais
uniquement leur position relative. L&#8217;id&#233;e derri&#232;re ces calculs est d&#8217;obtenir non seulement l&#8217;ordre pr&#233;sum&#233; entre
deux groupes de phrases, mais &#233;galement la probabilit&#233; qu&#8217;il soit correct.
</p>
<p>3.2.2 Parcours du graphe et ordonnancement
</p>
<p>Ordonner les n&#339;uds d&#8217;un tel graphe est un probl&#232;me NP-complet. Nous avons donc utilis&#233; une heuristique pour
r&#233;soudre ce probl&#232;me : le parcours du graphe d&#233;bute &#224; partir du n&#339;ud qui minimise la somme des valeurs de
ses ar&#234;tes sortantes, c&#8217;est-&#224;-dire le n&#339;ud dont les phrases maximisent la probabilit&#233; de pr&#233;c&#233;der celles des autres
n&#339;uds. Les phrases de ce n&#339;ud pr&#233;c&#232;dent donc majoritairement les phrases des autres n&#339;uds. Tant qu&#8217;il existe un
n&#339;ud non visit&#233;, dont le lien du n&#339;ud courant vers celui-ci est strictement n&#233;gatif, le parcours se poursuit depuis
le n&#339;ud qui minimise ce lien (donc celui dont le poids est le plus proche de &#8722;1). S&#8217;il n&#8217;existe pas de tel n&#339;ud,
l&#8217;algorithme parcourt le n&#339;ud non visit&#233; qui minimise la somme des valeurs de ses ar&#234;tes sortantes. L&#8217;algorithme
se poursuit tant que tous les n&#339;uds du graphe n&#8217;ont pas &#233;t&#233; visit&#233;s. Les phrases du r&#233;sum&#233; sont ordonn&#233;es dans
l&#8217;ordre de parcours du graphe.
</p>
<p>Au cours des premi&#232;res exp&#233;riences que nous avons men&#233;es, nous avons constat&#233; que la premi&#232;re phrase choisie
par un tel parcours de graphe est souvent inappropri&#233;e. Dans un r&#233;sum&#233; de d&#233;p&#234;ches, la premi&#232;re phrase doit
d&#233;crire l&#8217;&#233;v&#233;nement cl&#233; afin de faciliter la lecture du reste du document. Nous avons donc impl&#233;ment&#233; une seconde
m&#233;thode de parcours, qui d&#233;bute par la phrase dont le score calcul&#233; par CBSEAS est le plus important. Cette phrase
devrait contenir les mots-cl&#233;s les plus discriminantants du th&#232;me trait&#233;, et nous faisons l&#8217;hypoth&#232;se qu&#8217;elle est la
plus pertinente comme accroche du r&#233;sum&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AUR&#201;LIEN BOSSARD, &#201;MILIE GUIMIER DE NEEF
</p>
<p>4 &#201;valuation
</p>
<p>4.1 Baselines
</p>
<p>Nous avons impl&#233;ment&#233; deux baselines. La premi&#232;re ordonne les phrases selon le score que CBSEAS leur a
attribu&#233;. Ainsi, les phrases &#233;ventuellement &#171; hors sujet &#187;, c&#8217;est-&#224;-dire ne correspondant pas &#224; une composante
informationnelle importante des documents d&#8217;origine, sont repouss&#233;es &#224; la fin du r&#233;sum&#233; et n&#8217;en perturbent pas la
lecture. Les phrases contenant le vocabulaire le plus fr&#233;quent appara&#238;tront en premier ; dans le cadre de r&#233;sum&#233;s
de d&#233;p&#234;ches, cela peut &#234;tre b&#233;n&#233;fique, car les premi&#232;res phrases auront une probabilit&#233; &#233;lev&#233;e d&#8217;introduire tous
les acteurs des &#233;v&#233;nements trait&#233;s. La deuxi&#232;me baseline consiste &#224; ordonner les phrases selon la date d&#8217;&#233;mission
des documents dont elles sont issues. Si plusieurs phrases appartiennent au m&#234;me document, elles sont ordonn&#233;es
selon leur position dans celui-ci.
</p>
<p>4.2 Protocole d&#8217;&#233;valuation
</p>
<p>Nous avons &#233;valu&#233; trois syst&#232;mes :
&#8211; un qui utilise la m&#233;thode de g&#233;n&#233;ration de graphe DU ;
&#8211; un qui utilise la m&#233;thode de g&#233;n&#233;ration de graphe DR ;
&#8211; un dernier qui utilise DU et le parcours de graphe d&#233;butant par la phrase la mieux class&#233;e par CBSEAS
</p>
<p>(DU+score).
Ces syst&#232;mes ont &#233;t&#233; compar&#233;s aux deux baselines pr&#233;sent&#233;es en Section 4.1.
</p>
<p>L&#8217;&#233;valuation a &#233;t&#233; r&#233;alis&#233;e sur le corpus RPM2, compos&#233; de 200 d&#233;p&#234;ches de presse, et divis&#233; en 20 th&#232;mes de 10
documents. Chacun des th&#232;mes a &#233;t&#233; utilis&#233; afin de g&#233;n&#233;rer un r&#233;sum&#233; par CBSEAS, ordonn&#233; selon les m&#233;thodes
DU, DR, DU+score, et les deux baselines. Les r&#233;sum&#233;s ont &#233;t&#233; &#233;valu&#233;s par quatre &#233;valuateurs diff&#233;rents, en
aveugle, selon deux axes : leur coh&#233;rence &#8211; sur une &#233;chelle de 0 &#224; 3, la qualit&#233; de l&#8217;encha&#238;nement des phrases &#8211; et
la pertinence de leur premi&#232;re phrase &#8211; pertinente (1) ou non (0) 3.
</p>
<p>Score Date+pos DU DR DU+score
Pourc. accord 35.8% 46.7% 50.8% 44.2% 38.3%
Ecart type moy. 0.74 0.58 0.52 0.69 0.7
Coef. var. moy. 0.68 1.24 0.79 1.08 0.64
Annotateur 1 1.55 0.35 0.85 0.95 1.4
Annotateur 2 1.6 0.75 1.0 0.9 1.5
Annotateur 3 1.35 0.7 0.85 0.95 1.1
Annotateur 4 1.35 0.58 0.75 0.9 0.75
Moyenne 1.46 0.58 0.86 0.93 1.19
</p>
<p>TABLE 1 &#8211; Scores de coh&#233;rence
</p>
<p>Score Date+pos DU DR DU+score
Pourc. accord 66.7% 73.3% 70.8% 66.7% 66.7%
Annotateur 1 0.6 0.1 0.45 0.55 0.6
Annotateur 2 0.65 0.25 0.45 0.45 0.65
Annotateur 3 0.75 0.45 0.6 0.7 0.75
Annotateur 4 0.4 0.1 0.35 0.4 0.4
Moyenne 0.6 0.23 0.46 0.53 0.6
</p>
<p>TABLE 2 &#8211; &#201;valuation de la pertinence de la premi&#232;re phrase
</p>
<p>Pour effectuer cette annotation, les &#233;valuateurs avaient &#233;galement pour consigne de ne pas tenir compte de la
rh&#233;torique, c&#8217;est-&#224;-dire des marqueurs de discours qui assurent le lien logique entre phrases (typiquement des
adverbes tels que n&#233;anmoins, en outre, cependant...). Ils ne devaient pas non plus p&#233;naliser la redondance inter-
phrastique. En revanche, la pr&#233;sence d&#8217;expressions non r&#233;f&#233;rentielles (anaphores, p&#233;riphrases...) ininterpr&#233;tables
&#233;tait &#224; p&#233;naliser.
</p>
<p>3. Nous remercions Aleksandra Guerraz et Philippe Fabien pour leur participation &#224; l&#8217;&#233;valuation de notre travail.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ORDONNER UN R&#201;SUM&#201; AUTOMATIQUE MULTI-DOCUMENTS
</p>
<p>score Date+pos DU DR
175 mots 1.35 0.7 0.85 0.95
100 mots 1.6 1 1.4 1.65
</p>
<p>TABLE 3 &#8211; Comparaison des &#233;valuations avec 175 et 100 mots.
</p>
<p>4.3 R&#233;sultats
</p>
<p>Le Tableau 1 pr&#233;sente les r&#233;sultats de l&#8217;&#233;valuation de la coh&#233;rence globale des r&#233;sum&#233;s. Les annotateurs ont
consid&#233;r&#233; qu&#8217;ordonner les phrases selon leur score produisait les r&#233;sum&#233;s les plus coh&#233;rents. La deuxi&#232;me m&#233;thode
est DU+score, et la moins bonne la m&#233;thode Date+pos. Il est int&#233;ressant de constater que le r&#233;ordonnancement
selon le score produit &#233;galement les accords inter-annotateurs les plus importants. Si le pourcentage d&#8217;accord
pour cette m&#233;thode est faible (le nombre de notations identiques), les notes des annotateurs sont parmi les moins
divergentes, avec un coefficient de variation moyen &#8211; l&#8217;&#233;cart type moyen rapport&#233; &#224; la moyenne &#8211; de 0.68. La
m&#233;thode d&#8217;ordonnancement la moins probante est la baseline 2.
</p>
<p>Les r&#233;sultats t&#233;moignent de l&#8217;importance du choix de la premi&#232;re phrase. En effet, la m&#233;thode DU+score obtient
des r&#233;sultats sup&#233;rieurs &#224; ceux de la m&#233;thode DU seule. Seule changeait dans cette m&#233;thode le choix de la premi&#232;re
phrase, qui a paru plus judicieux aux annotateurs (cf Tableau 2). Les r&#233;sultats de la m&#233;thode DU+score n&#8217;&#233;galent
toutefois pas ceux de la baseline 1, quoique deux annotateurs sur quatre aient jug&#233; les deux m&#233;thodes sensiblement
de m&#234;me valeur.
</p>
<p>4.4 Conclusion
</p>
<p>Les r&#233;sultats de cette &#233;valuation sont d&#233;cevants, puisqu&#8217;aucun des syst&#232;mes pr&#233;sent&#233;s n&#8217;est meilleur que la baseline
1. De plus, les notes sont assez faibles, puisqu&#8217;aucun syst&#232;me de r&#233;ordonnancement n&#8217;obtient de note sup&#233;rieure
&#224; la moyenne. Cependant, les r&#233;sultats obtenus sont &#224; mettre en rapport avec le nombre &#233;lev&#233; de mots par r&#233;sum&#233;
utilis&#233; lors de cette exp&#233;rience &#8211; 175. Ce nombre &#233;lev&#233; de mots, associ&#233; &#224; un nombre de CL &#233;galement important
&#8211; 8 &#8211; a pour effet d&#8217;augmenter le rappel des informations extraites dans les r&#233;sum&#233;s, tout en en diminuant la
pr&#233;cision. Ainsi, certaines phrases sont hors-sujet et perturbent la lisibilit&#233; du r&#233;sum&#233;. La Figure 1 pr&#233;sente un
m&#234;me r&#233;sum&#233; ordonn&#233; selon les m&#233;thodes baseline 1, DU, DU+score et Baseline 2. On constate bien le ph&#233;nom&#232;ne
d&#8217;interposition de phrases qui perturbent le discours (ici, la phrase &#171; La tension monte encore d&#8217;un cran entre
Rachida Dati et les magistrats. &#187;).
</p>
<p>Une &#233;valuation pr&#233;liminaire, r&#233;alis&#233;e avec une configuration diff&#233;rente, avait livr&#233; des conclusions diff&#233;rentes.
Les r&#233;sum&#233;s &#233;taient limit&#233;s &#224; 100 mots, et g&#233;n&#233;r&#233;s &#224; partir de 5 CL. Un seul annotateur avait particip&#233; &#224; cette
&#233;tude. Le Tableau 3 montre que la m&#233;thode DU avait &#233;t&#233; jug&#233;e la plus efficace, l&#233;g&#232;rement devant la baseline
1. Pour comparaison, nous avons pr&#233;sent&#233; dans ce tableau l&#8217;&#233;valuation de cet annotateur sur les r&#233;sum&#233;s de 175
mots. On constate que la t&#226;che se complexifie rapidement avec l&#8217;accroissement du nombre de phrases ; la seule
m&#233;thode qui reste stable est la baseline 1. Afin d&#8217;&#233;viter, comme c&#8217;est le cas dans beaucoup des r&#233;sum&#233;s de 175
mots g&#233;n&#233;r&#233;s pour notre exp&#233;rience, que des phrases trop marginales ne perturbent la lecture du r&#233;sum&#233;, on peut
imaginer prendre en compte le score des phrases du r&#233;sum&#233; lors du calcul du graphe, de mani&#232;re &#224; affaiblir les
ar&#234;tes qui relient les n&#339;uds dont la phrase repr&#233;sentative est mal not&#233;e par CBSEAS. Ainsi, la probabilit&#233; que de
telles phrases soient rel&#233;gu&#233;es en fin de r&#233;sum&#233; sera plus importante.
</p>
<p>Bien que les r&#233;sultats de cette &#233;tude soient d&#233;cevants, nous avons identifi&#233; le principal probl&#232;me relatif aux m&#233;-
thodes propos&#233;es, et sugg&#233;r&#233; une mani&#232;re d&#8217;y rem&#233;dier, qu&#8217;il conviendra que nous &#233;valuions.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOSSARD A. &amp; DE NEEF E. (2011). Etude du regroupement automatique de phrases sur un syst&#232;me de r&#233;sum&#233;
automatique. In Actes de CORIA 2011, Avignon, France.
</p>
<p>BOSSARD A. &amp; POIBEAU T. (2009). Description of the LIPN Systems at TAC 2009. In TAC 2009, Summariza-
tion Track, Gaithersburg, USA.
</p>
<p>DAS D. &amp; MARTINS, ANDR&#201; F. T. (2007). A survey on automatic text summarization.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>AUR&#201;LIEN BOSSARD, &#201;MILIE GUIMIER DE NEEF
</p>
<p>M&#233;thode : baseline 1, score : 2.25
Irrit&#233;s par la politique de la garde des Sceaux, les deux principaux syndicats ont saisi le Conseil sup&#233;rieur de la magistrature (CSM) pour &#171; l&#8217;alerter &#187; sur &#171; les
attaques &#187; de la ministre &#171; contre l&#8217;ind&#233;pendance de l&#8217;autorit&#233; judiciaire &#187;.
L&#8217;organe supr&#234;me de la magistrature &#233;tait saisi par les deux principaux syndicats de magistrats, l&#8217;Union syndicale des magistrats (USM, majoritaire) et le Syndicat
de la magistrature (SM, gauche).
A la suite du suicide d&#8217;un d&#233;tenu mineur &#224; la maison d&#8217;arr&#234;t de Metz, le garde des Sceaux a diligent&#233; une enqu&#234;te administrative qui selon les magistrats &quot;vise &#224;
trouver un bouc &#233;missaire&quot;.
Les magistrats et les organisations du monde p&#233;nitentiaire ont manifest&#233; ce jeudi pour protester contre la politique de la Garde des Sceaux Rachida Dati. Comme
d&#8217;autres syndicats et les p&#233;titionnaires d&#8217;Agen, l&#8217;USM fait le lien entre l&#8217;histoire de Bernard Blais et la r&#233;cente convocation au minist&#232;re du vice-procureur de
Nancy.
La tension monte encore d&#8217;un cran entre Rachida Dati et les magistrats.
</p>
<p>M&#233;thode : DU, score : 0.75
Irrit&#233;s par la politique de la garde des Sceaux, les deux principaux syndicats ont saisi le Conseil sup&#233;rieur de la magistrature (CSM) pour &#171; l&#8217;alerter &#187; sur &#171; les
attaques &#187; de la ministre &#171; contre l&#8217;ind&#233;pendance de l&#8217;autorit&#233; judiciaire &#187;.
Comme d&#8217;autres syndicats et les p&#233;titionnaires d&#8217;Agen, l&#8217;USM fait le lien entre l&#8217;histoire de Bernard Blais et la r&#233;cente convocation au minist&#232;re du vice-procureur
de Nancy.
L&#8217;organe supr&#234;me de la magistrature &#233;tait saisi par les deux principaux syndicats de magistrats, l&#8217;Union syndicale des magistrats (USM, majoritaire) et le Syndicat
de la magistrature (SM, gauche).
A la suite du suicide d&#8217;un d&#233;tenu mineur &#224; la maison d&#8217;arr&#234;t de Metz, le garde des Sceaux a diligent&#233; une enqu&#234;te administrative qui selon les magistrats &quot;vise &#224;
trouver un bouc &#233;missaire&quot;.
La tension monte encore d&#8217;un cran entre Rachida Dati et les magistrats.
Les magistrats et les organisations du monde p&#233;nitentiaire ont manifest&#233; ce jeudi pour protester contre la politique de la Garde des Sceaux Rachida Dati.
</p>
<p>M&#233;thode : DU+score, score : 1.75
Irrit&#233;s par la politique de la garde des Sceaux, les deux principaux syndicats ont saisi le Conseil sup&#233;rieur de la magistrature (CSM) pour &#171; l&#8217;alerter &#187; sur &#171; les
attaques &#187; de la ministre &#171; contre l&#8217;ind&#233;pendance de l&#8217;autorit&#233; judiciaire &#187;.
Comme d&#8217;autres syndicats et les p&#233;titionnaires d&#8217;Agen, l&#8217;USM fait le lien entre l&#8217;histoire de Bernard Blais et la r&#233;cente convocation au minist&#232;re du vice-procureur
de Nancy.
L&#8217;organe supr&#234;me de la magistrature &#233;tait saisi par les deux principaux syndicats de magistrats, l&#8217;Union syndicale des magistrats (USM, majoritaire) et le Syndicat
de la magistrature (SM, gauche).
A la suite du suicide d&#8217;un d&#233;tenu mineur &#224; la maison d&#8217;arr&#234;t de Metz, le garde des Sceaux a diligent&#233; une enqu&#234;te administrative qui selon les magistrats &quot;vise &#224;
trouver un bouc &#233;missaire&quot;.
La tension monte encore d&#8217;un cran entre Rachida Dati et les magistrats.
Les magistrats et les organisations du monde p&#233;nitentiaire ont manifest&#233; ce jeudi pour protester contre la politique de la Garde des Sceaux Rachida Dati.
</p>
<p>M&#233;thode : Date+pos, score : 0
L&#8217;organe supr&#234;me de la magistrature &#233;tait saisi par les deux principaux syndicats de magistrats, l&#8217;Union syndicale des magistrats (USM, majoritaire) et le Syndicat
de la magistrature (SM, gauche).
La tension monte encore d&#8217;un cran entre Rachida Dati et les magistrats.
Irrit&#233;s par la politique de la garde des Sceaux, les deux principaux syndicats ont saisi le Conseil sup&#233;rieur de la magistrature (CSM) pour &#171; l&#8217;alerter &#187; sur &#171; les
attaques &#187; de la ministre &#171; contre l&#8217;ind&#233;pendance de l&#8217;autorit&#233; judiciaire &#187;.
Comme d&#8217;autres syndicats et les p&#233;titionnaires d&#8217;Agen, l&#8217;USM fait le lien entre l&#8217;histoire de Bernard Blais et la r&#233;cente convocation au minist&#232;re du vice-procureur
de Nancy.
Les magistrats et les organisations du monde p&#233;nitentiaire ont manifest&#233; ce jeudi pour protester contre la politique de la Garde des Sceaux Rachida Dati. A la suite
du suicide d&#8217;un d&#233;tenu mineur &#224; la maison d&#8217;arr&#234;t de Metz, le garde des Sceaux a diligent&#233; une enqu&#234;te administrative qui selon les magistrats &quot;vise &#224; trouver un
bouc &#233;missaire&quot;.
</p>
<p>FIGURE 1 &#8211; R&#233;sum&#233;s ordonn&#233;s selon les m&#233;thodes baseline 1, DU, DU+score et Baseline 2.
</p>
<p>DE LOUPY C., GU&#201;GAN M., AYACHE C., SENG S. &amp; TORRES MORENO J.-M. (2010). A french human
reference corpus for multi-document summarization and sentence compression. In LREC&#8217;10.
</p>
<p>LIN Z., HOANG H. H., QIU L., YE S. &amp; KAN M.-Y. (2008). NUS at TAC 2008 : Augmenting timestam-
ped Graphs with event information and selectively expanding opinion contexts. In Proceedings of TAC 2008
Workshop on Automatic Summarization.
</p>
<p>MANI I. (1999). Advances in Automatic Text Summarization. Cambridge, MA, USA : MIT Press.
</p>
<p>REGINA BARZILAY, NOEMIE ELHADAD &amp; KATHLEEN MCKEOWN (2002). Inferring Strategies for Sentence
Ordering in Multidocument News Summarization. J. Artif. Intell. Res. (JAIR), 17, 35&#8211;55.
RUTLEDGE L., BAILEY B., OSSENBRUGGEN J. V., HARDMAN L. &amp; GEURTS J. (2000). Generating presen-
tation constraints from rhetorical structure. In In Proceedings of the 11th ACM conference on Hypertext and
Hypermedia.
</p>
<p>SAGGION H. &amp; GAIZAUSKAS R. (2004). Multi-document summarization by cluster/profile relevance and re-
dundancy removal. In Proceedings of the Document Understanding Conference 2004 : NIST.
</p>
<p>WANG Y.-W. (2002). Sentence Ordering for Multi-Document Summarization in Response to Multiple queries.</p>

</div></div>
</body></html>