<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une mod&#233;lisation des dites alternances de port&#233;e des quantifieurs par des op&#233;rations de combinaison des groupes nominaux</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>Une mod&#233;lisation des dites alternances de port&#233;e des quantifieurs 
par des op&#233;rations de combinaison des groupes nominaux 
</p>
<p>Sylvain Kahane 
</p>
<p>Modyco, Universit&#233; Paris Ouest Nanterre &amp; CNRS / Alpage, INRIA 
sylvain@kahane.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233;. 
</p>
<p>Nous montrons que les diff&#233;rentes interpr&#233;tations d&#8217;une combinaison de plusieurs GN peuvent &#234;tre 
mod&#233;lis&#233;es par deux op&#233;rations de combinaison sur les r&#233;f&#233;rents de ces GN, appel&#233;es combinaison 
cumulative et combinaison distributive. Nous &#233;tudions aussi bien les GN d&#233;finis et ind&#233;finis que les GN 
quantifi&#233;s ou pluriels et nous montrons comment la combinaison d&#8217;un GN avec d&#8217;autres &#233;l&#233;ments peut 
induire des interpr&#233;tations collective ou individualisante. Selon la fa&#231;on dont un GN se combine avec 
d&#8217;autres GN, le calcul de son r&#233;f&#233;rent peut &#234;tre fonction de ces derniers ; ceci d&#233;finit une relation d&#8217;ancrage 
de chaque GN, qui induit un ordre partiel sur les GN. Consid&#233;rer cette relation plut&#244;t que la relation 
converse de port&#233;e simplifie le calcul de l&#8217;interpr&#233;tation des GN et des &#233;nonc&#233;s. Des repr&#233;sentations 
s&#233;mantiques graphiques et alg&#233;briques sans consid&#233;ration de la port&#233;e sont propos&#233;es pour les dites 
alternances de port&#233;e. 
</p>
<p>Abstract. 
</p>
<p>We show that the various interpretations of a combination of several Noun Phrases can be modeled by two 
operations of combination on the referent of these NPs, called cumulative and distributive combinations. 
We study definite and indefinite NPs as well as quantified and plural NPs and we show how the 
combination of an NP with other NPs can induce collective or individualizing interpretations. According to 
the way a NP combine with another NP, the calculation of its referent can be a function of the latter; this 
defines an anchoring relation for each NP, which induces a partial order on NPs. Considering this relation 
rather than the converse scope relation simplifies the calculation of the interpretation of NPs and utterances. 
Graphic and algebraic semantic representations without considering scope are proposed for the so-called 
scope alternations. 
</p>
<p>Mots-cl&#233;s : port&#233;e des quantifieurs, cumulatif, collectif, distributif, r&#233;f&#233;rent de discours, ancrage. 
</p>
<p>Keywords: quantifier scope alternation, cumulative, collective, distributive, discourse referent, anchoring. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SYLVAIN KAHANE 
</p>
<p> 
</p>
<p>1 Introduction 
</p>
<p>Nous nous int&#233;ressons dans cet article &#224; l&#8217;interpr&#233;tation des GN d&#233;finis, ind&#233;finis et quantifi&#233;s notamment 
lorsqu&#8217;ils se trouvent dans la port&#233;e d&#8217;un autre GN, comme dans les exemples suivants : 
</p>
<p>(1) a. Les invit&#233;s ont trouv&#233; un chat. 
b. Au moins la moiti&#233; des profs pense qu&#8217;aucun &#233;tudiant ne parle deux des langues &#233;tudi&#233;es cette 
    ann&#233;e. 
c. Les trois filles ont donn&#233; deux pommes &#224; deux gar&#231;ons. 
</p>
<p>Il est bien connu que de tels &#233;nonc&#233;s sont ambigus et une abondante litt&#233;rature concerne le calcul de leurs 
interpr&#233;tations possibles (cf. Link 1997, Corblin 2002, Dobrovie-Sorin &amp; Beyssade 2004, Nickel &#224; par., 
pour des analyses d&#233;taill&#233;es de la litt&#233;rature). 
</p>
<p>L&#8217;objectif de cet article est de faire une pr&#233;sentation unifi&#233;e du calcul des interpr&#233;tations possibles de ces 
GN, alors que ces questions sont souvent abord&#233;es s&#233;par&#233;ment selon qu&#8217;on s&#8217;int&#233;resse aux GN ind&#233;finis 
plut&#244;t qu&#8217;aux GN d&#233;finis, aux GN pluriels ou aux GN coordonn&#233;es ou encore aux GN quantifi&#233;s. La 
r&#233;solutions de chacun de ces cas tend &#224; faire appel &#224; des concepts diff&#233;rents : la r&#233;solution d&#8217;anaphore et la 
recherche d&#8217;un ant&#233;c&#233;dent pour les GN d&#233;finis, les interpr&#233;tations r&#233;f&#233;rentielles ou non pour les GN 
ind&#233;finis, les possibilit&#233;s d&#8217;interpr&#233;tations collectives ou individualisantes1 pour les GN pluriels, des 
parall&#233;lismes pour les GN coordonn&#233;s (d&#233;clench&#233;s par un adverbe comme respectivement), ou encore les 
questions de port&#233;e pour les GN quantifi&#233;s. 
</p>
<p>L&#8217;un des contributions de notre article est de montrer que le probl&#232;me de l&#8217;interpr&#233;tation des GN n&#8217;est pas 
tant de calculer la port&#233;e des GN que de d&#233;cider si un GN doit ou non &#234;tre interpr&#233;t&#233; comme &#233;tant dans la 
port&#233;e d&#8217;un autre GN. Autrement dit, nous proposons de renverser le calcul de la port&#233;e : il ne s&#8217;agit plus 
d&#8217;associer une port&#233;e &#224; un GN, mais d&#8217;associer un ancrage &#224; un GN. Cette relation d&#8217;ancrage est la relation 
converse de la relation de port&#233;e (X s&#8217;ancre sur Y si et seulement si X est interpr&#233;t&#233; comme &#233;tant dans la 
port&#233;e de Y). On peut penser que ceci ne change rien au probl&#232;me et pourtant cela change beaucoup de 
choses : cela change la repr&#233;sentation s&#233;mantique des &#233;nonc&#233;s, puisque les GN quantifi&#233;s et les 
quantifieurs2 n&#8217;ont plus &#224; proprement parler une port&#233;e, alors que tout GN poss&#232;de un ancrage. 
</p>
<p>L&#8217;autre contribution de notre article est de montrer que l&#8217;on peut mod&#233;liser les diff&#233;rentes interpr&#233;tation 
d&#8217;une pr&#233;dication sur plusieurs GN par deux op&#233;rations de combinaisons sur les r&#233;f&#233;rents de ces GN : la 
combinaison cumulative et la combinaison distributive. Nous verrons que le choix d&#8217;une op&#233;ration plut&#244;t 
qu&#8217;une autre est directement d&#233;ductible de la relation d&#8217;ancrage entre les r&#233;f&#233;rents des GN, relation qui 
d&#233;finit un ordre partiel sur les GN, et nous en d&#233;duirons diverses repr&#233;sentations s&#233;mantiques d&#8217;une 
pr&#233;dication sur plusieurs GN. Sans relever directement du cadre de la DRT (Kamp &amp; Reyle 1993), notre 
travail s&#8217;inscrit dans les horizons ouverts par la s&#233;mantique dynamique, consistant &#224; introduire pour chaque 
GN un r&#233;f&#233;rent de discours et &#224; calculer dynamiquement la valeur de ce r&#233;f&#233;rent. 
</p>
<p>Dans cet article, nous commencerons par pr&#233;senter les diff&#233;rentes interpr&#233;tations que peuvent avoir des GN 
d&#233;finis lorsqu&#8217;ils sont combin&#233;s et nous d&#233;finirons les notions d&#8217;interpr&#233;tations collective, individualisante 
et synchrone (Section 2). Nous &#233;tendrons ensuite ces notions &#224; l&#8217;interpr&#233;tation des GN ind&#233;finis et nous 
introduirons les op&#233;rations de combinaison cumulative et distributive, ainsi que la notion d&#8217;ancrage (Section 
3). Nous verrons comment ces op&#233;rations se combinent lorsqu&#8217;on consid&#232;re trois GN et nous montrerons 
l&#8217;&#233;quivalence entre les diff&#233;rentes configurations d&#8217;op&#233;rations et les diff&#233;rentes relations d&#8217;ancrage entre ces 
GN (Section 4). Nous &#233;tudierons ensuite la mod&#233;lisation des GN quantifi&#233;s sans introduire de port&#233;e et nous 
reviendrons sur les ind&#233;finis pluriels et singuliers (Section 5). 
</p>
<p>                                                           
1  On oppose g&#233;n&#233;ralement collectif &#224; distributif, mais le m&#234;me distributif est aussi utilis&#233; pour un autre 
</p>
<p>concept o&#249; il s&#8217;oppose &#224; cumulatif. Nous utiliserons le terme distributif uniquement en opposition &#224; 
cumulatif et individualisant en opposition &#224; collectif. 
</p>
<p>2  Nous appellerons quantifieurs les objets linguistiques comme chaque et quantificateurs les objets 
math&#233;matiques de la logique fr&#233;g&#233;enne. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE MODELISATION DES DITES ALTERNANCES DE PORTEE 
</p>
<p>2 Interpr&#233;tations collectives, individualisantes et synchrones des GN 
</p>
<p>Nous allons commencer notre &#233;tude par les combinaisons de GN d&#233;finis comme en (2) : 
</p>
<p>(2) Les trois filles ont d&#233;plac&#233; les quatre pianos.  
</p>
<p>L&#8217;&#233;nonc&#233; (2) indique que les quatre pianos ont &#233;t&#233; d&#233;plac&#233;s et que les agents de ce d&#233;placement sont les 
trois filles. Cet &#233;nonc&#233; est fondamentalement vague : il n&#8217;indique pas si les filles ont agi individuellement 
ou collectivement, ni quelle fille a particip&#233; &#224; quel d&#233;placement de piano. Une formalisation des diff&#233;rentes 
interpr&#233;tations d&#8217;un &#233;nonc&#233; tel que (2) a &#233;t&#233; propos&#233;e par Gillon (1987, 1996) : soit A l&#8217;ensemble des trois 
filles et B l&#8217;ensemble des quatre pianos. Alors l&#8217;&#233;nonc&#233; (2) implique qu&#8217;il existe un recouvrement3 (Ai)1&#8804;i&#8804;n 
de A et un recouvrement (Bi)1&#8804;i&#8804;n de B tel que pour chaque i de 1 &#224; n, l&#8217;ensemble des filles de Ai aient 
collectivement d&#233;plac&#233; l&#8217;ensemble des pianos de Bi (l&#8217;&#233;nonc&#233; d&#233;crivant ainsi un ensemble de n 
&#233;v&#232;nements). Pour des pianos, notre connaissance du monde nous incite &#224; consid&#233;rer que chaque piano a &#233;t&#233; 
d&#233;plac&#233; s&#233;par&#233;ment (et que donc les Bi sont des singletons), mais pour un &#233;nonc&#233; tel que (3), on imagine 
facilement une situation o&#249; chaque fille doit soulever &#224; son tour l&#8217;ensemble des quatre chaises. 
</p>
<p>(3) Les trois filles ont soulev&#233; les quatre chaises. 
</p>
<p>Parler ici des diff&#233;rentes interpr&#233;tations est assez commode, mais en fait abusif, pour ne pas dire erron&#233;. En 
effet, l&#8217;interpr&#233;tation que l&#8217;on fait d&#8217;un &#233;nonc&#233; tel que (2) peut fort bien rester vague. Plus pr&#233;cis&#233;ment, ce 
que nous d&#233;crivons lorsque nous parlons des diff&#233;rentes interpr&#233;tations sont les diff&#233;rentes situations que 
peut recouvrir l&#8217;interpr&#233;tation proprement dite de l&#8217;&#233;nonc&#233;. Cela reste vrai lorsqu&#8217;on s&#8217;int&#233;resse &#224; la 
synth&#232;se : le locuteur peut avoir une id&#233;e plus ou moins pr&#233;cise du proc&#232;s qu&#8217;il d&#233;crit et des situations 
exactes qu&#8217;il recouvre. 
</p>
<p>Parmi les interpr&#233;tations de (2)-(3), on distingue certaines interpr&#233;tations &#171; extr&#234;mes &#187; : l&#8217;interpr&#233;tation du 
GN sujet est dite collective si tous les Ai sont &#233;gaux &#224; A et individualisantes si tous les Ai sont des 
singletons (contrairement &#224; certains usages, nous r&#233;servons le terme distributif &#224; un autre type 
d&#8217;interpr&#233;tation dont il va &#234;tre question ensuite). Trois remarques s&#8217;imposent :  
</p>
<p>1) Les interpr&#233;tations &#171; extr&#234;mes &#187; semblent de loin les plus accessibles, mais des contraintes lexicales ou 
pragmatiques peuvent permettre des interpr&#233;tations interm&#233;diaires (Gillon 1987). On peut forcer les inter-
pr&#233;tations collective, individualisante ou interm&#233;diaire d&#8217;un des actants (sujet ou objet) par l&#8217;ajout de 
modifieurs : 
</p>
<p>(4) Les trois filles ont d&#233;plac&#233; les quatre pianos ensemble/l&#8217;un(e) apr&#232;s l&#8217;autre/deux par deux. 
</p>
<p>Lorsque A et B ont le m&#234;me nombre d&#8217;&#233;l&#233;ments, les interpr&#233;tations doublement individualisantes 
minimales4 reviennent &#224; aligner les &#233;l&#233;ments de A et de B. Une telle interpr&#233;tation sera dite synchrone. Elle 
est forc&#233;e par l&#8217;ajout de l&#8217;adverbe respectivement et favoris&#233;e par le parall&#233;lisme syntaxique des deux 
groupes (cf. (5)b qui d&#233;clenchera moins imm&#233;diatement cette interpr&#233;tation que (5)a) : 
</p>
<p>(5) a. Adi et B&#233;a ont (respectivement) mang&#233; la tartelette aux fraises et la tartelette aux poires. 
b. Les jumelles ont (??respectivement) mang&#233; les deux tartelettes. 
</p>
<p>2) Comme il a &#233;t&#233; fort bien montr&#233; dans la litt&#233;rature (Landman 1989, Link 1997), ce n&#8217;est pas le GN qui 
poss&#232;de une interpr&#233;tation collective ou individualisante, mais c&#8217;est le proc&#232;s qui induit une interpr&#233;tation 
collective ou individualisante du GN &#224; l&#8217;int&#233;rieur du proc&#232;s. Autrement dit, un m&#234;me GN impliqu&#233; dans 
deux proc&#232;s peut tr&#232;s bien avoir une interpr&#233;tation collective &#224; l&#8217;int&#233;rieur d&#8217;un proc&#232;s et individualisante &#224; 
l&#8217;int&#233;rieur de l&#8217;autre : 
</p>
<p>                                                           
3  (Ai)1&#8804;i&#8804;n est un recouvrement de A si la r&#233;union des Ai est &#233;gale &#224; A (A = &#8746;1&#8804;i&#8804;n Ai). Cette notion ne 
</p>
<p>suppose pas que les Ai sont deux &#224; deux disjoints. 
4  Il existe aussi une interpr&#233;tation doublement individualisante maximale o&#249; chaque &#233;l&#233;ment de A agit sur 
</p>
<p>chaque &#233;l&#233;ment de B. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SYLVAIN KAHANE 
</p>
<p>(6) a. Adi et B&#233;a se sont rencontr&#233;es dans un bar et ont bu une bi&#232;re (Dowty 1986, Lasersohn 1989) 
b. Les trois filles ont amen&#233; une chaise chacune et une table (ensemble). 
</p>
<p>Ceci am&#232;ne un certain nombre d&#8217;auteurs &#224; dire que l&#8217;interpr&#233;tation collective ou individualisante du GN 
n&#8217;est pas une propri&#233;t&#233; du GN, mais est d&#233;clench&#233; par une propri&#233;t&#233; du GV. Bien qu&#8217;il soit pr&#233;f&#233;rable 
d&#8217;associer cette propri&#233;t&#233; au GV plut&#244;t qu&#8217;au GN, cela n&#8217;est pas non plus satisfaisant. En effet, le probl&#232;me 
ne concerne pas seulement le GN sujet (celui qui se combine avec le GV), mais tous les GN quelle que soit 
leur position, et les donn&#233;es montrent une certaine sym&#233;trie entre GN sujet et objet. Nous consid&#233;rons pour 
notre part que l&#8217;interpr&#233;tation collective ou individualisante d&#8217;un GN est la projection sur le GN d&#8217;une 
propri&#233;t&#233; de la combinaison de ce GN avec le verbe et d&#8217;autres GN. Autrement dit, le GN n&#8217;a pas, pris 
isol&#233;ment, d&#8217;interpr&#233;tation collective ou individualisante ; c&#8217;est au sein d&#8217;une combinaison avec un autre 
&#233;l&#233;ment (un GN, mais aussi un pr&#233;dicat verbal) que le GN est consid&#233;r&#233; collectivement ou individu par 
individu et cette interpr&#233;tation particuli&#232;re du GN reste localis&#233;e au sein de cette combinaison. 
</p>
<p>3) Nous avons illustr&#233; l&#8217;interpr&#233;tation des GN d&#233;finis avec un proc&#232;s &#224; deux participants, mais les m&#234;mes 
remarques valent quel que soit le nombre de participants : cf. (7)a et b qui mettent respectivement en jeu 1 
et 3 participants, pour lesquels il y a le m&#234;me flou sur la participation collective ou individualisante de 
chaque participant : 
</p>
<p>(7) a. Les &#233;tudiants sont arriv&#233;s en retard. 
b. Les enfants ont donn&#233; des jouets de b&#233;b&#233; &#224; leurs petits cousins. 
</p>
<p>La d&#233;finition donn&#233;e pour deux GN peut &#234;tre &#233;tendue &#224; un nombre quelconque de dimensions. 
</p>
<p>3 Combinaisons cumulative et distributive des GN 
</p>
<p>Consid&#233;rons maintenant des variantes de (2) o&#249; l&#8217;objet et/ou le sujet sont ind&#233;finis : 
</p>
<p>(8) a. Les trois filles ont d&#233;plac&#233; quatre pianos. 
b. Trois filles ont d&#233;plac&#233; les quatre pianos. 
c. Trois filles ont d&#233;plac&#233; quatre pianos. 
</p>
<p>Chacun de ces trois &#233;nonc&#233;s poss&#232;dent, parmi d&#8217;autres, une s&#233;rie d&#8217;interpr&#233;tations o&#249; il y a seulement trois 
filles et quatre pianos en jeu comme en (2), &#224; la diff&#233;rence que les GN en question sont ind&#233;finis, c&#8217;est-&#224;-
dire qu&#8217;ils ne sont pas pr&#233;sent&#233;s comme r&#233;f&#233;rents &#224; un groupe identifiable par l&#8217;interlocuteur. Les 
interpr&#233;tations de ce type, o&#249; aucun GN n&#8217;est dans la port&#233;e de l&#8217;autre, sont appel&#233;es cumulatives (Scha 
1981, Schwarzschild 1996, Nickel &#224; par.). Nous allons donner une d&#233;finition formelle des interpr&#233;tations 
cumulatives. Si GN est un groupe nominal, on note GN son r&#233;f&#233;rent. Pour l&#8217;instant nous consid&#233;rons des 
cas simples o&#249; GN poss&#232;de un r&#233;f&#233;rent fixe GN, qui est donc un ensemble d&#8217;objets du monde5. Soit P un 
pr&#233;dicat binaire mod&#233;lisant un verbe bi-actanciel ; P(A , B) signifie qu&#8217;il existe une P-&#233;v&#233;nement 
impliquant l&#8217;ensemble des individus de A et l&#8217;ensemble des individus de B. Nos &#233;nonc&#233;s d&#233;notent en 
g&#233;n&#233;ral une s&#233;rie d&#8217;&#233;v&#233;nements (cf. Krifka 1990 pour la relation entre quantification nominale et 
&#233;v&#233;nements). 
</p>
<p>D&#233;finition 1. GN1 et GN2 se combinent cumulativement (par le pr&#233;dicat P) s&#8217;il existe des 
recouvrements (Ai)1&#8804;i&#8804;n et (Bi)1&#8804;i&#8804;n de GN1 et GN2 tel que pour chaque i de 1 &#224; n, on ait P(Ai , Bi). 
On note GN1 &#8855; GN2 une combinaison cumulative de GN1 et GN2 et P(GN1 &#8855; GN2) une 
interpr&#233;tation cumulative de P. 
</p>
<p>La combinaison cumulative est commutative et chaque GN poss&#232;de un r&#233;f&#233;rent ind&#233;pendant du r&#233;f&#233;rent de 
l&#8217;autre GN. Comme on l&#8217;a vu, il y a parmi les interpr&#233;tations cumulatives des interpr&#233;tations collectives ou 
individualisantes, pour le sujet et/ou l&#8217;objet, et d&#8217;autres qui ne le sont pas, n&#233;anmoins la combinaison 
n&#8217;affecte pas le calcul des r&#233;f&#233;rents des GN : les interpr&#233;tations collectives ou idividualisantes ne valent 
qu&#8217;au sein de la combinaison et pour l&#8217;application du pr&#233;dicat P. Notons encore que P s&#8217;applique &#224; un objet 
plus riche que le produit cart&#233;sien GN1 &#215; GN2 ou le couple (GN1 , GN2). 
                                                           
5  Ce qu&#8217;on appelle le monde est en fait une repr&#233;sentation du monde dans le savoir partag&#233; des 
</p>
<p>interlocuteurs. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE MODELISATION DES DITES ALTERNANCES DE PORTEE 
</p>
<p>Du fait du caract&#232;re ind&#233;fini du GN, il existe un autre type d&#8217;interpr&#233;tation. En (8)a, le GN quatre pianos 
peut ne pas avoir un r&#233;f&#233;rent absolu, mais relatif au GN sujet les trois filles. Autrement dit, il est possible 
d&#8217;interpr&#233;ter (8)a comme d&#233;crivant une situation o&#249; chacune des trois filles a d&#233;plac&#233; quatre pianos a priori 
diff&#233;rents &#224; chaque fois (la question de savoir si ce sont les quatre m&#234;mes pianos n&#8217;est tout simplement pas 
exprim&#233;e et est ind&#233;cidable et non pertinente dans l&#8217;interpr&#233;tation). Cette interpr&#233;tation est dite distributive 
et elle met en jeu potentiellement 3&#215;4 pianos6. 
</p>
<p>D&#233;finition 2. GN2 se combine distributivement avec GN1 (par le pr&#233;dicat P) si pour tout individu 
ai dans GN1, il existe un r&#233;f&#233;rent Bi de GN2 tel que P({ai} &#8855; Bi)7. On note GN1 &#10688; GN2 une 
combinaison distributive de GN2 par rapport &#224; GN1 et P(GN1 &#10688; GN2) une interpr&#233;tation 
distributive de P. 
</p>
<p>Comme on le voit, dans une interpr&#233;tation distributive, le r&#233;f&#233;rent de GN2 est une fonction sur les individus 
du r&#233;f&#233;rent de GN1.  
</p>
<p>D&#233;finition 3. GN2 s&#8217;ancre sur GN1 si le r&#233;f&#233;rent de GN2 est fonction (des individus) du r&#233;f&#233;rent 
de GN1. Le r&#233;f&#233;rent de GN2 est dit relatif (&#224; celui de GN1). Lorsqu&#8217;un GN ne s&#8217;ancre sur aucun 
autre GN, nous dirons que le r&#233;f&#233;rent du GN est absolu et nous consid&#233;rons que le GN s&#8217;ancre dans 
le contexte. 
</p>
<p>On peut, &#224; l&#8217;instar de Steedman 2009, mod&#233;liser de tels r&#233;f&#233;rents par des fonctions de Skolem g&#233;n&#233;ralis&#233;es. 
Nous verrons plus loin une repr&#233;sentation en termes d&#8217;ancrage plus ou moins &#233;quivalente. 
</p>
<p>Revenons &#224; nos exemples et &#224; leurs diff&#233;rentes interpr&#233;tations. L&#8217;interpr&#233;tation distributive (du sujet par 
rapport &#224; l&#8217;objet) en (8)b est beaucoup plus difficile qu&#8217;en (8)a (o&#249; il s&#8217;agissait de la distribution de l&#8217;objet 
par rapport au sujet), mais pas totalement exclue. Par exemple dans le cadre d&#8217;une enqu&#234;te, on pourrait 
dire : Trois filles ont d&#233;plac&#233; ces deux pianos. Voici les traces des trois qui ont d&#233;plac&#233; le piano de gauche 
et ici les traces des trois qui ont d&#233;plac&#233; le piano de droite. Plus g&#233;n&#233;ralement il a d&#233;j&#224; &#233;t&#233; not&#233; qu&#8217;un GN 
ind&#233;fini sujet pouvait &#234;tre dans la port&#233;e du GN objet (on parle alors de port&#233;e invers&#233;e, Beyssade 2006) : 
</p>
<p>(9) a. Un guide accompagne chaque visiteur dans la crypte. 
b. Un guide accompagne la plupart des visiteurs dans la crypte. 
c. Un guide n&#8217;accompagne aucun visiteur dans la crypte. 
</p>
<p>L&#8217;&#233;nonc&#233; (8)c, avec deux GN ind&#233;finis, poss&#232;de a priori les deux interpr&#233;tations distributives : distributivit&#233; 
de l&#8217;objet par rapport au sujet et distributivit&#233; (beaucoup moins probable) du sujet par rapport &#224; l&#8217;objet. Pour 
chacune de ces interpr&#233;tations distributives, l&#8217;un des GN s&#8217;ancre sur l&#8217;autre et le calcul de ses r&#233;f&#233;rents 
possibles se fait par rapport &#224; l&#8217;autre GN. 
</p>
<p>Nous estimons que les interpr&#233;tations cumulatives et distributives sont les seules possibles pour les &#233;nonc&#233;s 
en (8) et qu&#8217;il n&#8217;existe pas d&#8217;interpr&#233;tations interm&#233;diaires (voir juste apr&#232;s pour des cas o&#249; elles sont 
possibles). Par exemple, l&#8217;&#233;nonc&#233; (8)a ne peut couvrir une situation o&#249; deux filles ont d&#233;plac&#233; ensemble 
quatre pianos et la troisi&#232;me a d&#233;plac&#233; s&#233;par&#233;ment quatre autres pianos ; soit certaines filles ont agi 
collectivement et alors l&#8217;interpr&#233;tation est obligatoirement cumulative et il n&#8217;y a qu&#8217;un jeu de quatre piano, 
soit il y a plusieurs jeux de quatre pianos et alors toutes les filles ont agi individuellement. 
</p>
<p>Notons encore une difficult&#233; suppl&#233;mentaire. Nous avons fait comme si l&#8217;interpr&#233;tation distributive &#233;tait 
n&#233;cessairement individualisante, c&#8217;est-&#224;-dire comme si le GN devait se distribuer par rapport aux individus 
du GN sur lequel il s&#8217;ancre. Plus qu&#8217;individualisante, l&#8217;interpr&#233;tation distributive est s&#233;parative : elle s&#233;pare 
le GN ancre en un certain nombre de paquets par rapport auquel le deuxi&#232;me GN se distribue8. Une telle 
</p>
<p>                                                           
6  Les situations o&#249; chacune des trois filles a d&#233;plac&#233; les quatre m&#234;mes pianos sont &#224; la fois distributive et 
</p>
<p>cumulative. Autrement, les deux notions recouvrent des situations diff&#233;rentes. 
7  On notera que, si les interpr&#233;tations distributives forcent une interpr&#233;tation individualisante de GN1, 
</p>
<p>elles restent par contre floues sur l&#8217;interpr&#233;tation collective ou non de GN2 et c&#8217;est pourquoi on a a 
priori P({ai} &#8855; Bi) et non P({ai}, Bi). 
</p>
<p>8  C&#8217;est l&#8217;occasion de revenir sur notre premi&#232;re note concernant l&#8217;emploi du terme distributif dans la 
litt&#233;rature : les interpr&#233;tations distributives &#233;tant la plupart du temps individualisantes, notamment dans </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SYLVAIN KAHANE 
</p>
<p>distribution dite partielle (c&#8217;est-&#224;-dire o&#249; la s&#233;paration ne se fait pas au niveau individuel) n&#8217;est possible 
qu&#8217;avec une structure syntaxique particuli&#232;re du GN indiquant la partition (et est donc impossible dans des 
exemples comme (8)). Ainsi en (10)a, une interpr&#233;tation possible est que les filles d&#8217;une part et les gar&#231;ons 
d&#8217;autre part aient d&#233;plac&#233; chacun un piano : 
</p>
<p>(10) a. Les filles et les gar&#231;ons ont d&#233;plac&#233; un piano. 
b. Les filles et les gar&#231;ons ont d&#233;plac&#233; quatre pianos. 
c. Les filles et les gar&#231;ons ont (respectivement) d&#233;plac&#233; le piano et l&#8217;armoire. 
</p>
<p>Comme on peut s&#8217;en convaincre avec (10)b, dans une interpr&#233;tation &#224; distribution partielle, pour chaque 
groupe ayant d&#233;plac&#233; quatre pianos toutes les situations d&#8217;une interpr&#233;tation cumulative sont possibles. Ce 
qu&#8217;il est important de dire sur l&#8217;interpr&#233;tation exacte de tels &#233;nonc&#233;s, c&#8217;est que le flou sur la situation exacte 
ne vise pas &#234;tre lev&#233; et que ce qui est dit alors c&#8217;est que chacun des deux groupes a d&#233;plac&#233; quatre pianos et 
que la fa&#231;on dont chacun des deux groupes s&#8217;y est pris n&#8217;importe pas dans ce qui est dit et ce qu&#8217;on doit en 
d&#233;duire. Notons &#233;galement que l&#8217;interpr&#233;tation synchrone d&#8217;un &#233;nonc&#233; comme en (10)c est possible sans 
qu&#8217;il y ait une interpr&#233;tation individualisante des GN : il suffit d&#8217;une interpr&#233;tation s&#233;parative du GN, 
sugg&#233;r&#233;e par la syntaxe du GN, pour permettre l&#8217;alignement filles-piano et gar&#231;ons-armoire. 
</p>
<p>4 Ancrage, combinaisons et repr&#233;sentation s&#233;mantique 
</p>
<p>Nous allons maintenant nous int&#233;resser &#224; des &#233;nonc&#233;s combinant trois GN. Ceci nous permettra de faire le 
lien entre les diff&#233;rentes configurations d&#8217;ancrage et la composition de nos deux op&#233;rations de combinaison, 
&#8855; et &#10688;. 
</p>
<p>(11) a. Les trois filles ont donn&#233; deux pommes aux deux gar&#231;ons. 
b. Les trois filles ont donn&#233; deux pommes &#224; deux gar&#231;ons. 
</p>
<p>Nous allons d&#233;crire les diff&#233;rentes interpr&#233;tations de ces &#233;nonc&#233;s. Les r&#233;f&#233;rents des trois GN sont not&#233;s X = 
les trois filles, Y = deux pommes, Z = (les) deux gar&#231;ons, tandis que &#937; d&#233;signe le contexte. Pour chaque 
interpr&#233;tation de l&#8217;&#233;nonc&#233;, nous proposons trois repr&#233;sentations s&#233;mantiques.  
</p>
<p>&#8226; La premi&#232;re indique uniquement les ancrages des GN : chaque ancrage est repr&#233;sent&#233; par une 
fl&#232;che &#8901;&#8901;&#8901;&gt; pointant sur l&#8217;ancre du GN. Cette repr&#233;sentation, similaire &#224; celle propos&#233;e par Lesmo &amp; 
Robaldo (2004) et Robaldo (2007), n&#8217;indique pas les combinaisons cumulatives. Elle est 
&#233;quivalente aux suivantes &#224; la condition qu&#8217;on sache s&#8217;il y a combinaison ou non entre les GN. 
</p>
<p>&#8226; Nous avons vu que, si un GN s&#8217;ancre sur un autre, c&#8217;est qu&#8217;il se combine distributivement avec ce 
dernier. A l&#8217;oppos&#233;, s&#8217;il n&#8217;y a pas de relations d&#8217;ancrage entre deux GN et que ces GN sont pris 
sous le m&#234;me pr&#233;dicat et doivent donc se combiner, la combinaison est n&#233;cessairement cumulative. 
Notre deuxi&#232;me repr&#233;sentation indique pour chaque couple de GN s&#8217;il se combine cumulativement 
ou distributivement. Nous gardons la fl&#232;che &#8901;&#8901;&#8901;&gt; pour la combinaison distributive et nous notons la 
combinaison cumulative par un rectangle         incluant les &#233;l&#233;ments combin&#233;s. 
</p>
<p>&#8226; Notre troisi&#232;me repr&#233;sentation est une formule alg&#233;brique indiquant comment les r&#233;f&#233;rents des GN 
se combinent par les op&#233;rations &#8855; et &#10688;. 
</p>
<p>L&#8217;&#233;nonc&#233; (11)a poss&#232;dent deux GN d&#233;finis (de r&#233;f&#233;rents X et Z) qui se combinent n&#233;cessairement 
cumulativement ; il poss&#232;de alors quatre interpr&#233;tations selon l&#8217;ancrage de Y. La Fig. 1 donne les trois 
repr&#233;sentations s&#233;mantiques de chacune des interpr&#233;tations. Une quatri&#232;me ligne indique le nombre de filles 
(X), de pommes (Y) et de gar&#231;ons (Z) mis en jeu. 
</p>
<p>Dans l&#8217;interpr&#233;tation 1, Y s&#8217;ancre dans le contexte et les trois GN se combinent cumulativement : il y a 3 
filles, 2 pommes et 2 gar&#231;ons et on ne sait pas exactement qui a donn&#233; quoi &#224; qui. La d&#233;finition de la 
combinaison cumulative peut facilement &#234;tre g&#233;n&#233;ralis&#233;e &#224; un nombre quelconque de GN et nous notons 
X &#8855; Y &#8855; Z la combinaison cumulative de trois GN. 
                                                                                                                                                                             
</p>
<p>des exemples comme en (8) qui servent de base aux &#233;tudes, on peut comprendre les raisons de la 
confusion entre les deux notions. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE MODELISATION DES DITES ALTERNANCES DE PORTEE 
</p>
<p> 
</p>
<p>    
</p>
<p> 
 
</p>
<p>  
</p>
<p>X &#8855; Y &#8855; Z Z &#8855; (X &#10688; Y) X &#8855; (Z &#10688; Y) (X &#8855; Z) &#10688; Y 
(3, 2, 2) (3, 6, 2) (3, 4, 2) (3, 12, 2) 
</p>
<p>Interpr&#233;tation 1 Interpr&#233;tation 2 Interpr&#233;tation 3 Interpr&#233;tation 4 
</p>
<p>Figure 1. Les quatre interpr&#233;tations de (11)a 
</p>
<p>Dans l&#8217;interpr&#233;tation 2, Y s&#8217;ancre sur X : il s&#8217;ensuit que chacune des 3 filles a donn&#233; 2 pommes et qu&#8217;il y a 
potentiellement 6 pommes (on ne peut exclure que la m&#234;me pomme ait &#233;t&#233; donn&#233;e plusieurs fois). Y se 
combine donc distributivement avec X (qui re&#231;oit ainsi une interpr&#233;tation individualisante) tout en se 
combinant de mani&#232;re cumulative avec Z. Nous notons cela Z &#8855; (X &#10688; Y). La situation est analogue dans 
l&#8217;interpr&#233;tation 3 : Y s&#8217;ancre sur Z et chaque gar&#231;on re&#231;oit 2 pommes.  
</p>
<p>L&#8217;interpr&#233;tation 4 est plus complexe : chacune des 3 filles donne 2 pommes &#224; chacun des 2 gar&#231;ons et il y a 
potentiellement 12 pommes. Il y a dans ce cas un double ancrage de Y simultan&#233;ment sur X et Z. Le double 
ancrage n&#8217;est en fait possible que parce que X et Z se combinent cumulativement, et on peut consid&#233;rer de 
mani&#232;re &#233;quivalente que Y s&#8217;ancre sur la combinaison cumulative X &#8855; Z. Il est &#224; noter qu&#8217;&#224; chaque fois que 
Z s&#8217;ancre sur une GN ou une combinaison de GN, il induit une interpr&#233;tation individualisante de ces GN. 
Dans le cas du double ancrage, il y a donc une interpr&#233;tation doublement individualisante de X et Z 
(maximale ou minimale).  
</p>
<p>L&#8217;&#233;nonc&#233; (11)b poss&#232;de a priori six interpr&#233;tations suppl&#233;mentaires. Trois de ces interpr&#233;tations sont les 
sym&#233;triques des interpr&#233;tations 2, 3, 4, o&#249; X et Y sont combin&#233;s cumulativement et o&#249; les valeurs de (X, Y, 
Z) sont (3, 2, 6), (3, 2, 4) et (3, 2, 12). Ces interpr&#233;tations sont pragmatiquement peu probables puisqu&#8217;elles 
supposent que les 2 pommes aient &#233;t&#233; donn&#233;es plusieurs fois. La Fig. 2 donne les repr&#233;sentations 
s&#233;mantiques des trois derni&#232;res interpr&#233;tations : 
</p>
<p>  
 
</p>
<p> 
</p>
<p>   
</p>
<p>X &#10688; Y &#10688; Z X &#10688; Z &#10688; Y X &#10688; (Y &#8855;  Z) 
(3, 6, 12) (3, 12, 6) (3, 6, 6) 
</p>
<p>Interpr&#233;tation 8 Interpr&#233;tation 9 Interpr&#233;tation 10 
</p>
<p>Figure 2. Trois interpr&#233;tations de (18)b. 
</p>
<p>Comme on le voit, il est possible de s&#8217;ancrer sur un GN qui est lui-m&#234;me ancr&#233; sur un autre GN 
(interpr&#233;tations 8 et 9). Bien que non commutative, l&#8217;op&#233;ration &#10688; est associative et nous notons X &#10688; Y &#10688; Z 
la double combinaison distributive de X avec Y et de Y avec Z. Dans l&#8217;interpr&#233;tation 10, Y et Z s&#8217;ancrent 
tous les deux sur X ; ils se combinent donc cumulativement et on peut consid&#233;rer que c&#8217;est la combinaison 
Y &#8855; Z qui s&#8217;ancre sur X, d&#8217;o&#249; la formule alg&#233;brique X &#10688; (Y &#8855;  Z). En effet, dans ce cas, chacune des 3 filles 
donne 2 pommes &#224; 2 gar&#231;ons sans qu&#8217;on sache pr&#233;cis&#233;ment si le don est collectif ou individuel. 
</p>
<p>X           Z          Y 
</p>
<p>&#937; 
</p>
<p>Y           X          Z 
</p>
<p>&#937; 
</p>
<p>X           Y          Z 
</p>
<p>&#937; 
</p>
<p>X           Z          Y 
</p>
<p>X           Y          Z Y           X          Z X           Z          Y 
</p>
<p>&#937;                         Y 
X 
</p>
<p>Z 
</p>
<p>X           Y          Z X           Z          Y 
</p>
<p>&#937;          X 
Y 
</p>
<p>Z 
&#937;          X           Y          Z &#937;          X           Z          Y 
</p>
<p>X           Z          Y </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SYLVAIN KAHANE 
</p>
<p>Pour conclure cette section, nous allons dire quelques mots sur la relation d&#8217;ancrage. La relation d&#8217;ancrage 
d&#233;finit un ordre partiel sur l&#8217;ensemble {X, Y, Z}. Dans la mesure o&#249; X est un GN d&#233;fini (et en plus sujet 
syntaxique), il ne peut s&#8217;ancrer sur un autre GN et est donc n&#233;cessairement un plus petit &#233;l&#233;ment pour cet 
ordre partiel. Comme on peut le voir, il y a autant d&#8217;interpr&#233;tations que d&#8217;ordres partiels sur cet ensemble &#224; 
3 &#233;l&#233;ments avec X comme plus petit &#233;l&#233;ment. A chaque configuration de la relation d&#8217;ancrage, nous 
associons de mani&#232;re biunivoque une combinaison de X, Y et Z. Le fait que les relations de port&#233;e entre GN 
forme un ordre partiel a &#233;t&#233; soulign&#233; par les travaux d&#8217;Hinkitta (1976), ce qui a entrain&#233; un courant de 
recherche sur les formules logiques avec un ordre partiel sur les quantificateurs (Barwise 1979, Sher 1990, 
Robaldo 2007). Notre op&#233;ration &#8855; d&#233;finit en quelque sorte l&#8217;op&#233;ration de combinaison de deux 
quantificateurs qui ne sont pas dans la port&#233;e l&#8217;un de l&#8217;autre et fait la connexion entre ces travaux et les 
travaux de Gillon (1987, 1996). 
</p>
<p>Il est g&#233;n&#233;ralement consid&#233;r&#233; qu&#8217;on ne peut indiquer la port&#233;e d&#8217;un &#233;l&#233;ment X dans une repr&#233;sentation 
uniquement sous forme de graphe (cf. Sowa (1987) pour un inventaire pr&#233;cis de ce qui peut et ne peut pas 
&#234;tre repr&#233;sent&#233; par un graphe en s&#233;mantique). En un sens, on peut le faire en ajoutant un lien vers chaque 
&#233;l&#233;ment qui est dans la port&#233;e de X. Dire qu&#8217;on ne peut pas, c&#8217;est en fait dire qu&#8217;on ne peut pas repr&#233;senter 
la port&#233;e par des moyens finis (puisqu&#8217;un nombre potentiellement illimit&#233; d&#8217;&#233;l&#233;ment peut &#234;tre dans la port&#233;e 
de X, chacun n&#233;cessitant un lien) et qu&#8217;on ne saisit pas le fait que LA port&#233;e de X est UNE caract&#233;ristique 
de X que l&#8217;on souhaite mod&#233;liser par UN objet. Dans notre cas, nous repr&#233;sentons la relation converse 
qu&#8217;est la relation d&#8217;ancrage. Cette relation d&#8217;ancrage peut &#234;tre repr&#233;sent&#233;e par des liens dans un graphe. 
Comme, en plus, chaque &#233;l&#233;ment poss&#232;de g&#233;n&#233;ralement une ancre, deux au plus, on a de ce point de vue 
une condition de finitude que ne respectent pas les relations de port&#233;e. On peut &#233;galement repr&#233;senter les 
relations pr&#233;dicatives entre les signifi&#233;s sous forme de graphe et obtenir ainsi une repr&#233;sentation s&#233;mantique 
enti&#232;rement bas&#233;e sur des graphes (Mel&#8217;&#269;uk 1988, Kahane 2005, Robaldo 2007, Copestake 2009). 
</p>
<p>5 Quantifieurs, ancrage et port&#233;e 
</p>
<p>Nous n&#8217;avons pas jusque-l&#224; abord&#233; frontalement la question des quantifieurs. Rappelons que Frege 
proposait un traitement distinct des d&#233;finis d&#8217;un part, mod&#233;lis&#233;s par des constantes, et des ind&#233;finis d&#8217;autre 
part, mod&#233;lis&#233;s par des variables introduites par des quantifieurs. La s&#233;mantique dynamique a d&#233;fendu une 
distinction entre les ind&#233;finis et les GN quantifi&#233;s comme chaque N et oppos&#233; les GN r&#233;f&#233;rentiels 
comportant les d&#233;finis et certains emplois des ind&#233;finis aux GN quantifi&#233;s (Kamp &amp; Reyle 1993, Corblin 
2002). 
</p>
<p>Nous proposons de consid&#233;rer que tous les GN introduisent un r&#233;f&#233;rent de discours. Certains GN 
introduisent par d&#233;faut un r&#233;f&#233;rent fixe comme les d&#233;finis et les ind&#233;finis. Les calculs de ce r&#233;f&#233;rent 
diff&#232;rent ensuite, puisque l&#8217;ind&#233;fini va pointer sur un nouveau r&#233;f&#233;rent de discours, tandis que le d&#233;fini va 
pointer vers un r&#233;f&#233;rent de discours connu ou identifiable9. Les GN quantifi&#233;s introduisent au contraire un 
r&#233;f&#233;rent mobile, que l&#8217;on peut mod&#233;liser par une variable ou un parcours d&#8217;un certain ensemble 
contextuellement inf&#233;rable. A part leur caract&#232;re intrins&#232;quement mobile, ces r&#233;f&#233;rents de discours restent 
de nature comparable aux r&#233;f&#233;rents fixes et peuvent &#234;tre repris anaphoriquement par des pronoms, m&#234;me si 
leur accessibilit&#233; est plus restreinte : 
</p>
<p>(12) Chaque candidat remplit un questionnaire. Il le rend avant de partir. (Corblin 2002 : 238) 
</p>
<p>On peut comparer le fonctionnement du GN quantifi&#233; chaque candidat &#224; celui du GN pluriel les candidats. 
</p>
<p>(13) Les candidats remplissent un questionnaire. Ils le rendent avant de partir. 
</p>
<p>Les phrases (12) et (13) sont synonymes et dans les deux cas, le GN un questionnaire s&#8217;ancre sur le GN 
sujet. Il y a n&#233;anmoins une diff&#233;rence importante : les candidats poss&#232;de un r&#233;f&#233;rent pluriel (et est repris par 
un pronom pluriel), tandis que chaque candidat poss&#232;de un r&#233;f&#233;rent singulier. Lorsque un questionnaire se 
combine distributivement avec les candidats, son r&#233;f&#233;rent est une fonction sur les individus du r&#233;f&#233;rent de 
                                                           
9  Une des raisons qui justifie, &#224; notre avis, un traitement unifi&#233; des d&#233;finis et des ind&#233;finis est que dans de 
</p>
<p>nombreuses langues, comme le russe ou le mandarin, cette distinction n&#8217;est pas grammaticalis&#233;e. 
Autrement dit, il est possible de construire un GN sans que ni le locuteur, ni l&#8217;interlocuteur n&#8217;aient &#224; 
d&#233;cider si le r&#233;f&#233;rent de ce GN est identifiable ou non. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE MODELISATION DES DITES ALTERNANCES DE PORTEE 
</p>
<p>les candidats. Lors de l&#8217;ancrage sur chaque candidat, c&#8217;est le caract&#232;re intrins&#232;quement mobile du r&#233;f&#233;rent 
de ce GN qui donne &#224; un questionnaire un r&#233;f&#233;rent de nature fonctionnelle. Nous utiliserons le m&#234;me 
op&#233;rateur &#10688; pour d&#233;signer la combinaison entre un GN quantifi&#233; et un GN s&#8217;ancrant sur lui, mais la 
d&#233;finition est un peu diff&#233;rente. 
</p>
<p>D&#233;finition 3. GN2 se combine distributivement avec le GN quantifi&#233; &#224; GN1 (par le pr&#233;dicat P) si 
pour tout toute valeur ai de GN1, il existe un r&#233;f&#233;rent Bi de GN2 tel que P({ai} &#8855; Bi) et la 
combinaison sera not&#233;e GN1 &#10688; GN2. La combinaison sera dite cumulative si GN2 ne d&#233;pend pas 
des valeurs de GN1 et la combinaison sera not&#233;e GN1 &#8855; GN2. 
</p>
<p>Une cons&#233;quence de la similarit&#233; de fonctionnement des GN pluriels et quantifi&#233;s est qu&#8217;il n&#8217;y a pas plus de 
raison de parler de port&#233;e pour chaque candidat que pour les candidats. Les deux GN permettent &#224; un autre 
GN de s&#8217;ancrer sur eux et de d&#233;clencher un parcours de l&#8217;ensemble des candidats. Nous consid&#233;rons, en 
cons&#233;quence, qu&#8217;un quantifieur n&#8217;introduit pas de port&#233;e ; il poss&#232;de un unique argument s&#233;mantique qui est 
sa restriction, c&#8217;est-&#224;-dire l&#8217;ensemble que parcourt son r&#233;f&#233;rent mobile, et qui est d&#233;termin&#233; par la 
d&#233;notation du GN. Rappelons que dans la Th&#233;orie des Quantifieurs G&#233;n&#233;ralis&#233;s (Mostowski 1957, Barwise 
&amp; Cooper 1981), un quantifieur est associ&#233; &#224; un op&#233;rateur &#224; deux arguments, qui sont respectivement sa 
restriction (P) et sa port&#233;e (Q) : 
</p>
<p>(14) a. Tout homme est mortel : &#8704;x [homme(x) &#8594; mortel(x)] 
b. tout : &#955;P&#955;Q.(&#8704;x [P(x) &#8594; Q(x)]) 
</p>
<p>Nous pensons que le calcul du sens d&#8217;un &#233;nonc&#233; comme (14)a est plus simple et plus proche de la syntaxe 
de la langue que ne le sugg&#232;re la mod&#233;lisation en (14)b : le lex&#232;me tout se combine syntaxiquement avec 
homme, et donc son signifi&#233; &#8216;tout&#8217; est un pr&#233;dicat prenant &#8216;homme&#8217; comme argument. Le pr&#233;dicat &#8216;tout&#8217; 
appliqu&#233; &#224; &#8216;homme&#8217; a pour effet de construire un r&#233;f&#233;rent mobile qui parcourt l&#8217;ensemble des hommes. Le 
tout est ensuite argument de &#8216;mortel&#8217;, c&#8217;est-&#224;-dire que chacun des r&#233;f&#233;rents potentiels de tout homme 
poss&#232;de la propri&#233;t&#233; &#8216;mortel&#8217;. Le quantifieur est un s&#233;mant&#232;me comme les autres et il peut lui-m&#234;me &#234;tre 
argument d&#8217;un autre s&#233;mant&#232;me (presque tout homme ou tout homme sauf J&#233;s). 
</p>
<p>Terminons notre &#233;tude en revenant aux GN ind&#233;finis. Consid&#233;rons les &#233;nonc&#233;s suivants : 
</p>
<p>(15) a. Les invit&#233;s ont trouv&#233; un chat. 
b. Les filles ont d&#233;plac&#233; un piano. 
</p>
<p>L&#8217;&#233;nonc&#233; (15)a poss&#232;de deux interpr&#233;tations : un interpr&#233;tation distributive o&#249; chaque invit&#233; a trouv&#233; un 
chat et une interpr&#233;tation o&#249; il y a un chat que les invit&#233;s ont trouv&#233;. Il existe une analyse traditionnelle de 
cette ambigu&#239;t&#233; en terme d&#8217;inversion de port&#233;e, o&#249; X = les invit&#233;s et Y = un chat sont respectivement trait&#233;s 
comme des quantifications universelle et existentielle : 
</p>
<p>(16) a. Pour tout invit&#233; x, il existe un chat y tel que x a trouv&#233; y. 
b. Il existe un chat y tel que pour tout invit&#233; x, x a trouv&#233; y. 
</p>
<p>Cette mod&#233;lisation n&#8217;est pas satisfaisante : si (16)a correspond bien &#224; la premi&#232;re interpr&#233;tation, (16)b, par 
contre, ne prend pas en compte que les invit&#233;s ont collectivement trouv&#233; le chat. Cette inad&#233;quation devient 
&#233;vidente avec des exemples comme (15)b qui suppose un effort collectif. 
</p>
<p>Une autre mod&#233;lisation consiste &#224; consid&#233;rer que, pour la deuxi&#232;me interpr&#233;tation, il n&#8217;y a pas d&#8217;inversion 
de port&#233;e, mais que l&#8217;ind&#233;fini Y &#233;chappe &#224; la port&#233;e de X sans que pour autant X se retrouve dans la port&#233;e 
de Y (Sag &amp; Fodor 1982, Beyssade 2006). C&#8217;est ce que d&#233;crit la combinaison cumulative. Notre 
mod&#233;lisation ne traitent plus les ind&#233;finis ou les pluriels comme des quantificateurs et nous ne g&#233;rons pas 
les diff&#233;rences d&#8217;interpr&#233;tation de (15)a par des diff&#233;rences de port&#233;e, mais par des diff&#233;rences d&#8217;op&#233;rations 
de combinaison. Notons que pour les GN singuliers, on ne peut pas distinguer combinaisons distributive et 
cumulative : si GN1 = un N, GN1 &#10688; GN2 = GN1 &#8855; GN2 quel que soit GN2. Nous consid&#233;rons n&#233;anmoins 
que pour la deuxi&#232;me interpr&#233;tation il s&#8217;agit d&#8217;une interpr&#233;tation cumulative, car l&#8217;ancrage du sujet sur 
l&#8217;objet est un ph&#233;nom&#232;ne marginal (cf. la discussion sur les exemples en (8) et (9)). 
</p>
<p>D&#8217;autres arguments encore vont dans le sens du rejet d&#8217;une mod&#233;lisation de ces GN par des quantifieurs 
avec une port&#233;e. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SYLVAIN KAHANE 
</p>
<p>1) Le premier est la base de th&#233;ories comme la DRT (Kamp &amp; Reyle 1993, Corblin 2002), qui ont 
d&#233;velopp&#233;es la notion de r&#233;f&#233;rent de discours sur laquelle se base notre analyse en termes d&#8217;ancrage. 
Consid&#233;rons les fameuses &#171; donkey sentences &#187; : 
</p>
<p>(17) a. Jil poss&#232;de un &#226;ne. Elle le bat. 
b. Si une fermi&#232;re poss&#232;de un &#226;ne, elle le bat. 
</p>
<p>En (17)a, si on formalise un &#226;ne par une variable introduite dans la port&#233;e d&#8217;un quantificateur existentiel, on 
est confront&#233; au probl&#232;me de pouvoir r&#233;utiliser cette variable et donc de devoir prolonger la port&#233;e de ce 
quantifieur au del&#224; des bornes de la premi&#232;re proposition (il existe un &#226;ne y tel que Jil poss&#232;de y et tel que 
Jil bat y). En (17)b, la seule solution en terme de port&#233;e est de sortir les quantificateurs existentiels 
introduits par les ind&#233;finis de la port&#233;e de si et d&#8217;en faire des quantificateurs universels (pour tout fermi&#232;re x 
et tout &#226;ne y, si x poss&#232;de y, alors x bat y). 
</p>
<p>En termes d&#8217;ancrage et de construction de r&#233;f&#233;rents de discours, les probl&#232;mes s&#8217;effacent : un GN ind&#233;fini 
cr&#233;e un nouveau r&#233;f&#233;rent de discours, ce r&#233;f&#233;rent de discours &#233;tant ensuite accessible pour un pronom ou un 
GN d&#233;fini qui voudrait pointer sur lui. Lorsque le GN ind&#233;fini Y ne s&#8217;ancre pas directement dans l&#8217;univers 
de discours, il cr&#233;e quand m&#234;me un r&#233;f&#233;rent de discours, lequel est assujetti &#224; l&#8217;univers de l&#8217;&#233;l&#233;ment sur 
lequel il s&#8217;est ancr&#233;. En (17)b, les deux GN ind&#233;finis sont dans la port&#233;e de si : il vont donc s&#8217;ancrer dans 
l&#8217;univers de discours hypoth&#233;tique ouvert par cet &#233;l&#233;ment. En dehors de cela, ils fonctionnent comme 
n&#8217;importe quel r&#233;f&#233;rent de discours et sont accessibles &#224; la reprise par un pronom, tant qu&#8217;on reste dans le 
sous-univers hypoth&#233;tique ouvert par si.  Plus g&#233;n&#233;ralement, un pronom peut tr&#232;s bien reprendre (par le 
biais d&#8217;une relation anaphorique), un &#233;l&#233;ment li&#233; &#224; un autre r&#233;f&#233;rent de discours (voir aussi les exemples 
(12) et (13)) : 
</p>
<p>(18) Tous mes amis avaient une voiture, mais plusieurs l&#8217;ont vendue. 
</p>
<p>2) Il existe d&#8217;autres situations o&#249; un GN ind&#233;fini &#233;chappe &#224; la port&#233;e d&#8217;un &#233;l&#233;ment. Consid&#233;rons l&#8217;exemple 
suivant propos&#233; par Fodor &amp; Sag (1982) :  
</p>
<p>(19) If a friend of mine from Texas had died in the fire, I would have inherited a fortune. 
</p>
<p>Il y a deux interpr&#233;tations possibles de (19) : une o&#249; a friend of mine from Texas poss&#232;de une r&#233;f&#233;rence 
absolue (favoris&#233;e ici par le contexte) et une autre o&#249; ce GN est dans la port&#233;e de if. Pour que le GN ind&#233;fini 
&#233;chappe &#224; la port&#233;e de if, il faut que le locuteur ait en t&#234;te quelqu&#8217;un de bien pr&#233;cis, mais qu&#8217;il pr&#233;sente par 
un ind&#233;fini, car il le consid&#232;re comme non identifiable par l&#8217;interlocuteur. Ceci argumente, &#224; notre avis, 
davantage pour un ancrage direct dans l&#8217;univers de discours que pour une inversion de port&#233;e.  
</p>
<p>3) Tous les ind&#233;finis ne fonctionnent pas de la m&#234;me fa&#231;on. Comparons : 
</p>
<p>(20) a. Au moins la moiti&#233; des &#233;tudiants parlent deux des langues &#233;tudi&#233;es cette ann&#233;e. 
b. Au moins la moiti&#233; des &#233;tudiants parlent deux langues &#233;tudi&#233;es cette ann&#233;e. 
</p>
<p>L&#8217;exemple (20)a peut avoir deux interpr&#233;tations dont l&#8217;une dite &#224; port&#233;e large, c&#8217;est-&#224;-dire o&#249;, selon notre 
point de vue, l&#8217;ind&#233;fini deux des langues s&#8217;ancre directement dans l&#8217;univers de discours. Par contraste, 
(20)b peut beaucoup plus difficilement avoir cette deuxi&#232;me interpr&#233;tation. Comment mod&#233;liser cette 
diff&#233;rence ? Si nous raisonnons en terme de port&#233;e, alors il faut consid&#233;rer qu&#8217;un ind&#233;fini pur comme deux 
langues peut plus difficilement prendre dans sa port&#233;e un autre quantifieur qu&#8217;un partitif comme deux des 
langues qui combine un ind&#233;fini et un d&#233;fini (deux de [les langues]). On ne voit pas tr&#232;s bien en quoi le 
d&#233;fini renforcerait la port&#233;e du GN. Par contre, si on raisonne en terme d&#8217;ancrage, cela devient nettement 
plus motiv&#233; : un GN comportant une part de d&#233;fini s&#8217;ancrera plus facilement directement dans l&#8217;univers de 
discours, comme le fait g&#233;n&#233;ralement un d&#233;fini. 
</p>
<p>6 Conclusion 
</p>
<p>La principale contribution de cet article r&#233;side dans l&#8217;introduction des op&#233;rations de combinaison 
cumulative et distributive et dans le lien fait entre la composition de ces op&#233;rations et les relations 
d&#8217;ancrage. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE MODELISATION DES DITES ALTERNANCES DE PORTEE 
</p>
<p>Le probl&#232;me de l&#8217;interpr&#233;tation des GN est tentaculaire. Nous sommes loin d&#8217;avoir abord&#233; toutes les 
questions qu&#8217;il soul&#232;ve et nous avons probablement voulu en couvrir trop dans cet article en consid&#233;rant 
aussi bien les GN d&#233;finis et ind&#233;finis que les GN pluriels ou quantifi&#233;s. Nous avons &#233;tudi&#233; la combinaison 
de GN pris dans une m&#234;me pr&#233;dication, mais nous n&#8217;avons pas &#233;tudi&#233; des combinaisons &#224; l&#8217;int&#233;rieur d&#8217;un 
GN comme pour un repr&#233;sentant de chaque village o&#249; l&#8217;article ind&#233;fini sert &#224; saisir un individu d&#8217;une classe 
(&#8216;repr&#233;sentant de chaque village&#8217;) dont la d&#233;finition contient un quantifieur et induit ainsi un r&#233;f&#233;rent 
mobile10. Ceci nous am&#232;nerait &#224; d&#233;finir le fonctionnement de la modification (c&#8217;est-&#224;-dire le cas o&#249; l&#8217;un des 
arguments d&#8217;un pr&#233;dicat est son gouverneur syntaxique) et son interaction avec le calcul des r&#233;f&#233;rents. 
</p>
<p>Consid&#233;rer l&#8217;ancrage plut&#244;t que la port&#233;e simplifie, &#224; notre avis, aussi bien la repr&#233;sentation s&#233;mantique que 
son calcul. D&#8217;autres auteurs ont consid&#233;r&#233; l&#8217;ancrage plut&#244;t que la port&#233;e. Dobrovie-Sorin &amp; Beyssade 
(2004 : 141) parle de d&#233;pendance r&#233;f&#233;rentielle, mais elles ne vont pas jusqu&#8217;&#224; substituer cette relation &#224; la 
port&#233;e dans leurs repr&#233;sentations s&#233;mantiques. Nous n&#8217;avons pas retenu le terme de d&#233;pendance qui est d&#233;j&#224; 
souvent utilis&#233; pour d&#233;signer les relations pr&#233;dicat-argument (Mel&#8217;&#269;uk 1988), lesquelles correspondent 
assez naturellement aux d&#233;pendances syntaxiques. Robaldo 2007 propose des repr&#233;sentations en termes 
d&#8217;ancrage similaire aux n&#244;tres, mais les GN sont repr&#233;sent&#233;s par des quantifieurs et les repr&#233;sentations sont 
interpr&#233;t&#233;es par des formules logiques. Une autre repr&#233;sentation de l&#8217;ancrage est propos&#233;e par Steedman 
2009 gr&#226;ce &#224; des fonctions de Skolem g&#233;n&#233;ralis&#233;es, mais la combinaison cumulative n&#8217;est pas clairement 
d&#233;gag&#233;e, me semble-t-il. 
</p>
<p>Nous avons propos&#233;s trois modes de repr&#233;sentation de la composition des GN, mais il reste &#224; int&#233;grer cela 
dans une repr&#233;sentation globale des &#233;nonc&#233;s et &#224; formaliser pleinement la s&#233;mantique de nos op&#233;rations de 
combinaison. On aura not&#233; que nous ne faisons pas usage de variables dans nos repr&#233;sentations, qu&#8217;elles 
soient sous forme graphique ou alg&#233;brique. L&#8217;introduction de variables dans les expressions alg&#233;briques est 
un moyen pratique de noter le point d&#8217;articulation entre deux objets s&#233;mantiques que l&#8217;on compose (par 
exemple entre un quantificateur et un pr&#233;dicat), mais ce moyen peut &#234;tre contourn&#233; par l&#8217;introduction 
d&#8217;op&#233;rateurs de composition (cf. Descl&#233;s &amp; Kye-Seop 2006 pour des notations alg&#233;briques de formules du 
premier ordre &#224; l&#8217;aide d&#8217;op&#233;rateurs plut&#244;t que de variables). L&#8217;autre cons&#233;quence de la mod&#233;lisation par des 
op&#233;rations de combinaison est de ne plus avoir &#224; raisonner en termes de port&#233;e. Les cons&#233;quences sont 
importantes : les quantifieurs et les GN en g&#233;n&#233;ral n&#8217;ont plus de port&#233;e, mais &#224; l&#8217;inverse chaque GN poss&#232;de 
une ancre. La repr&#233;sentation de ces &#233;l&#233;ments s&#8217;en trouve grandement simplifi&#233;e et le calcul de 
l&#8217;ancrage/port&#233;e peut &#234;tre rapproch&#233; du calcul des relations anaphoriques. 
</p>
<p>Aborder le probl&#232;me de la combinaison des GN en terme d&#8217;ancrage et d&#8217;op&#233;rations de combinaison ouvre &#224; 
notre avis des perspectives nouvelles pour le calcul de l&#8217;interpr&#233;tation des &#233;nonc&#233;s. Nous aimerions en 
particulier souligner que les combinaisons cumulatives sont courantes et m&#233;rite un mode de repr&#233;sentation 
&#233;l&#233;mentaire que ne permet pas la logique classique, m&#234;me avec des repr&#233;sentations sous-sp&#233;cifi&#233;es pour la 
port&#233;e. De plus, la combinaison cumulative subsume un grand nombre d&#8217;interpr&#233;tations particuli&#232;res et il 
serait n&#233;cessaire d&#8217;&#233;tudier comment diff&#233;rents facteurs lexicaux, prosodiques11 et pragmatiques r&#233;duisent 
l&#8217;espace des interpr&#233;tations possibles.  
</p>
<p>Remerciements 
</p>
<p>L&#8217;article a subi de profondes modifications entre sa soumission et sa version finale. Il s&#8217;agit d&#8217;un travail de 
longue haleine commenc&#233; il y a au moins trois ans et dont la version actuelle n&#8217;est certainement pas aboutie. 
Je remercie pour leurs nombreux commentaires Claire Beyssade, Laurence Danlos, Paola Pietrandrea et 
Alain Polgu&#232;re, et tout particuli&#232;rement les quatre relecteurs de la conf&#233;rence. 
</p>
<p>                                                           
10  Il semble aussi que les phrases g&#233;n&#233;riques attribuent &#224; un N un r&#233;f&#233;rent mobile : 
 (i) Une baleine mange plusieurs tonnes de planctons en une journ&#233;e. 
11  La prosodie d&#233;pend en partie de la structure communicative (ou information packaging) de l&#8217;&#233;nonc&#233;, qui 
</p>
<p>joue elle-m&#234;me un r&#244;le important dans les relations d&#8217;ancrage/port&#233;e, mais aussi dans les interpr&#233;tations 
cumulatives. L&#8217;interpr&#233;tation synchrone est par exemple favoris&#233;e par un parall&#233;lisme prosodique. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>SYLVAIN KAHANE 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>BARWISE J., COOPER R. (1981). Generalized quantifiers and natural language. Linguistics and Philosophy 4, 
159-219. 
</p>
<p>BARWISE J. (1979) On Branching Quantifiers in English, Journal of Philosophical Logic 8, 47-80. 
BEYSSADE C. (2006). Port&#233;e. In D. Godard, L. Roussarie, F. Corblin (&#233;d.), S&#233;manticlop&#233;die: dictionnaire de 
s&#233;mantique, GDR S&#233;mantique &amp; Mod&#233;lisation, CNRS, http://www.semantique-gdr.net/dico/. 
CORBLIN F. (2002). Repr&#233;sentation du discours et s&#233;mantique formelle. Paris : PUF. 
</p>
<p>DESCLES J.-P., KYE-SEOP CH. (2006), Analyse critique de la notion de variable : points de vue s&#233;miotique et 
formel, Math&#233;matiques et sciences humaines, 43-102. 
</p>
<p>DOBROVIE-SORIN C., BEYSSADE C. (2004). D&#233;finir les ind&#233;finis. Paris : CNRS Editions. 
</p>
<p>FODOR J., SAG I. (1982). Referential and Quantificational Indefinites. Linguistics and Philosophy 5, 355-
398. 
</p>
<p>GILLON B. (1987). The readings of plural noun phrases. Linguistics and Philosophy 10:2, 199-219. 
</p>
<p>GILLON B. (1996). Collectivity and distributivity internal to English noun phrases. Language Sciences, 
18:1-2, 443-468. 
</p>
<p>HINTIKKA J. (1976) Partially Ordered Quantifiers vs. Partially Ordered Ideas, Dialectica 30, 89-99. 
KAHANE S. (2005). Structure des repr&#233;sentations logiques, polarisation et sous-sp&#233;cification. Actes de 
TALN, Dourdan, 153-162. 
</p>
<p>KAMP H., REYLE U. (1993). From Discourse to Logic. Dordrecht : Kluwer. 
</p>
<p>KRIFKA M. (1990). Four thousand ships passed through the lock: object-induced measure functions on 
&#233;vents. Linguistics and Philosophy 13: 487-520, 1990. 
LANDMAN F. (1989). Groups. Linguistics and Philosophy 12:5-6, 559-605 (Partie I), 723-744 (Partie II). 
LASERSOHN P. (1989). On the Readings of Plural Noun Phrases. Linguistic Inquiry 20:1, 130-134. 
LESMO L., ROBALDO L. (2004) Dependency Tree Semantics and Underspecification. Proc. of  International     
Conference On Natural language processing (ICON2004), Hyderabad, India. 
LINK G. (1997). Ten Years of Research on Plurals &#8211; Where Do We Stand? In F. Hamm, E. Hinrichs (&#233;d.) 
Plurality and Quantification, Dordrecht: Kluwer, 19-54. 
MEL&#8217;&#268;UK I. (1988). Dependency Syntax: Theory and Practice. Albany : SUNY Press. 
</p>
<p>MOSTOWSKI A. (1957). On a generalization of quantifiers. Fundamenta Mathematica 44, 12-36. 
NICKEL B. (&#224; par.). Plurals. In Graff-Fara D., Russell G. (&#233;d.), The Routledge Handbook for Philosophy of 
Language. Manuscrit en ligne. 
</p>
<p>ROBALDO L. (2007) Dependency Tree Semantics. Ph. D Thesis, Universit&#233; de Turin. 
</p>
<p>SCHA R. (1981). Distributive, Collective, and Cumulative Quantification. In J. Groenendijk, T. Janssen, M. 
Stokhof (&#233;ds), Formal Methods in the Study of Language, Amsterdam : University of Amsterdam, 483-512. 
SCHWARZSCHILD R. (1996). Pluralities. Kluwer. 
SHER G. (1990) Ways of Branching Quantifiers. Linguistics and Philosophy 13, 393-422. 
STEEDMAN M. (2009). Surface-Compositional Scope-Alternation Without Existential Quantifiers. 
Manuscrit en ligne (draft 5.2). 
</p>
<p>SOWA J. (1987). Semantics networks. In S. C. Shapiro (&#233;d.), Encyclopedia of Artificial Intelligence, New 
York : Wiley ; version mise &#224; jour en ligne. </p>

</div></div>
</body></html>