<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Evaluation de la d&#233;tection des &#233;motions, des opinions ou des sentiments : dictature de la majorit&#233; ou respect de la diversit&#233; d&#8217;opinions ?</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>EVALUATION DE LA DETECTION DES EMOTIONS, OPINONS OU SENTIMENTS 
</p>
<p> 
</p>
<p>Evaluation de la d&#233;tection des &#233;motions, des opinions ou des sentiments : 
</p>
<p>dictature de la majorit&#233; ou respect de la diversit&#233; d&#8217;opinions ? 
</p>
<p>Jean-Yves Antoine
1
, Marc Le Tallec
</p>
<p>1
, Jeanne Villaneau
</p>
<p>2
 
</p>
<p> 
</p>
<p>(1)  Universit&#233; Fran&#231;ois Rabelais de Tours, LI, 37000 Blois 
(2) Universit&#233; Europ&#233;enne de Bretagne, VALORIA, 56100 Lorient 
</p>
<p>Jean-Yves.Antoine@univ-tours.fr, Marc.Le-Tallec@univ-tours.fr, Jeanne.Villaneau@univ-ubs.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233; - D&#233;tection d&#8217;&#233;motion, fouille d&#8217;opinion et analyse des sentiments sont g&#233;n&#233;ralement &#233;valu&#233;s par 
comparaison des r&#233;ponses du syst&#232;me concern&#233; par rapport &#224; celles contenues dans un corpus de r&#233;f&#233;rence. 
</p>
<p>Les questions pos&#233;es dans cet article  concernent &#224; la fois la d&#233;finition de la r&#233;f&#233;rence et la fiabilit&#233; des 
</p>
<p>m&#233;triques les plus fr&#233;quemment utilis&#233;es pour cette comparaison. Les exp&#233;rimentations men&#233;es pour &#233;valuer 
</p>
<p>le syst&#232;me de d&#233;tection d&#8217;&#233;motions EmoLogus servent de base de r&#233;flexion pour ces deux probl&#232;mes. 
L&#8217;analyse des r&#233;sultats d&#8217;EmoLogus et  la comparaison entre les diff&#233;rentes m&#233;triques remettent en cause le 
choix du vote majoritaire comme r&#233;f&#233;rence. Par ailleurs elles montrent &#233;galement la n&#233;cessit&#233; de recourir &#224; 
</p>
<p>des outils statistiques plus &#233;volu&#233;s que ceux g&#233;n&#233;ralement utilis&#233;s pour obtenir des &#233;valuations fiables de 
</p>
<p>syst&#232;mes qui travaillent sur des donn&#233;es intrins&#232;quement subjectives et incertaines. 
</p>
<p>Abstract - Emotion detection, opinion identification and sentiment analysis are generally assessed by means 
of the comparison of a reference corpus with the answers of the system. This paper addresses the problem of 
</p>
<p>the definition of the reference and the reliability of the metrics which are commonly used for this comparison. 
</p>
<p>We present some experiments led with EmoLogus, a system of emotion detection, to investigate these two 
</p>
<p>problems. A detailed analysis of the quantitative results obtained by EmoLogus on various metrics questions 
</p>
<p>the choice of a majority vote among several human judgments to build a reference. Besides, it shows the 
</p>
<p>necessity of using more sophisticated statistical tools to obtain a reliable evaluation of such systems which 
</p>
<p>are working on intrinsically subjective and uncertain data. 
</p>
<p>Mots-cl&#233;s :   D&#233;tection d&#8217;&#233;motion, analyse de sentiments, fouille d&#8217;opinion ; Evaluation : m&#233;trique 
d&#8217;&#233;valuation, constitution de r&#233;f&#233;rence, analyse statistique des r&#233;sultats. 
</p>
<p>Keywords:   Detection of emotion, sentiment analysis, opinion mining, Evaluation: objective measures, test 
reference, statistical analysis of the results. 
</p>
<p>1 Evaluation en d&#233;tection des &#233;motions / opinions / sentiments 
</p>
<p>La d&#233;tection d&#8217;&#233;motions, la fouille d&#8217;opinion ou l&#8217;analyse des sentiments sont des t&#226;ches tr&#232;s proches qui 
consistent &#224; trouver et cat&#233;goriser dans des flux langagiers oraux ou &#233;crits des passages porteurs d&#8217;un &#233;tat 
&#233;motionnel ou traduisant un jugement. La granularit&#233; de la d&#233;tection est variable suivant l&#8217;application : il 
peut s&#8217;agir d&#8217;un document ou d&#8217;un discours complet, d&#8217;un paragraphe, d&#8217;une phrase (qui peut &#234;tre 
sp&#233;cifiquement un titre, par exemple) ou d&#8217;un tour de parole dans le cas du dialogue oral homme-machine. 
Le grain de cat&#233;gorisation recherch&#233; peut &#233;galement varier d&#8217;une t&#226;che &#224; l&#8217;autre. On peut ainsi ne consid&#233;rer 
que trois classes principales (valence positive, n&#233;gative ou neutre) ou rechercher une caract&#233;risation plus fine 
</p>
<p>sous la forme de modalit&#233;s correspondant aux &#233;motions principales d&#233;finies en psychologie : col&#232;re, joie, 
</p>
<p>d&#233;gout, peur, surprise,  tristesse et &#233;motion neutre (Ekman 1999). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANTOINE J.-Y., LE TALLEC M., VILLANEAU J. 
</p>
<p> 
</p>
<p>Quelle que soit la t&#226;che consid&#233;r&#233;e, l&#8217;&#233;valuation suit toujours le m&#234;me paradigme : celui de la comparaison 
des r&#233;ponses du syst&#232;me &#224; une r&#233;f&#233;rence pr&#233;d&#233;finie. Les diff&#233;rentes campagnes d&#8217;&#233;valuation qui ont &#233;t&#233; 
men&#233;es &#224; bien se diff&#233;rencient essentiellement par le choix de la m&#233;trique de comparaison. Soit C le nombre 
</p>
<p>de classifications correctes (identiques &#224; la r&#233;f&#233;rence) effectu&#233;es par le syst&#232;me et E le nombre de ses erreurs.  
</p>
<p>- La robustesse (accuracy en anglais) correspond &#224; la proportion de r&#233;ponses correctes du syst&#232;me sur 
</p>
<p>l&#8217;ensemble du corpus de test. On a : R = C / (C+E). Cette mesure est surtout utilis&#233;e pour l&#8217;&#233;valuation 
individuelle des performances d&#8217;un syst&#232;me comme dans (Callejas et Lopez-Cozar 2008). 
</p>
<p>- La pr&#233;cision et le rappel sont souvent utilis&#233;s en d&#233;tection d&#8217;opinion et d&#8217;&#233;motion. Le syst&#232;me peut 
choisir la valence neutre qui peut &#234;tre interpr&#233;t&#233;e comme une non-d&#233;cision de la part de classifieurs 
</p>
<p>entra&#238;n&#233;s pour identifier une expression &#233;motive donn&#233;e. La pr&#233;cision quantifie la justesse des d&#233;cisions 
</p>
<p>prises par le syst&#232;me (P = C/(C+E)), tandis que le rappel estime sa part d&#8217;ind&#233;cision (R = C/CR, , o&#249; CR 
est le nombre d&#8217;&#233;nonc&#233;s class&#233;s dans la r&#233;f&#233;rence). Ces deux indices peuvent &#234;tre calcul&#233;s globalement 
(macro-moyenne) ou &#234;tre la moyenne d&#8217;un calcul fait pour chacune des classes (micro-moyenne).  La F-
mesure correspond &#224; la moyenne harmonique de la pr&#233;cision et du rappel. Elle estime le compromis 
</p>
<p>entre une prise de risque se traduisant par un fort rappel mais une faible pr&#233;cision, et inversement. On a  
</p>
<p>F = 2.P.R / (P+R). Ces m&#233;triques ont &#233;t&#233; adopt&#233;es lors de l&#8217;Emotion Challenge d&#8217;Interspeech 2009 
(Schuller et. al. 2009) et pour l&#8217;&#233;valuation de la valence dans t&#226;che Affective Text de la campagne 
SemEval-2 (Straparava &amp; Mihalceva 2007). La campagne DEfi Fouille de Texte innove quelque peu en 
</p>
<p>d&#233;finissant un indice de confiance qui correspond &#224; une F-mesure pond&#233;r&#233;e lorsque les r&#233;ponses du 
</p>
<p>syst&#232;me sont une distribution de probabilit&#233;s sur chaque classe (Grouin et. al. 2007). 
</p>
<p>- D&#8217;usage moins fr&#233;quent, le coefficient de corr&#233;lation de Pearson est une autre mani&#232;re d&#8217;estimer la 
</p>
<p>proximit&#233; des r&#233;ponses avec la r&#233;f&#233;rence. On a CP = &#61555;sr/(&#61555;s.&#61555;r) o&#249; &#61555;sr est la covariance entre les r&#233;ponses 
</p>
<p>du syst&#232;me et la r&#233;f&#233;rence, et &#61555;s et &#61555;r correspondent &#224; la variance des r&#233;ponses du syst&#232;me et des juges 
qui ont &#233;tabli la r&#233;f&#233;rence sur le corpus de test. Cette mesure est utilis&#233;e dans la campagne SemEval-2 
</p>
<p>pour l&#8217;&#233;valuation de la cat&#233;gorisation en modalit&#233; &#233;motionnelle (Straparava &amp; Mihalceva 2007). 
</p>
<p>- Enfin, certaines &#233;valuations choisissent d&#8217;&#233;valuer le syst&#232;me comme un expert humain, on cherchant &#224; 
estimer l&#8217;accord inter-annotateur observ&#233; entre les r&#233;ponses du syst&#232;me et la r&#233;f&#233;rence. Le plus 
souvent, cet accord est estim&#233; par un calcul de Kappa (Cohen 1960) : soit Po la proportion d&#8217;accord 
observ&#233;e effectivement et Pa celle correspondant &#224; une annotation al&#233;atoire, on a K = Po - Pa / (1 &#8211; Pa).  
</p>
<p>La diversit&#233; des situations de test fait qu&#8217;il est malais&#233; de comparer les r&#233;sultats d&#8217;une campagne &#224; une autre. 
Il n&#8217;en reste pas moins que peu de travaux ont &#233;tudi&#233; l&#8217;influence des pratiques de test sur les r&#233;sultats. Les 
multiples mesures de Kappa pour estimer l&#8217;accord inter-annotateur ont fait l&#8217;objet d&#8217;exp&#233;rimentations 
critiques (Callejas &amp; Lopez-Cozar 2008, Hayes &amp; Krippendorf 2007). Mais en dehors de cette r&#233;flexion 
</p>
<p>m&#233;thodologique (souvent le fait de psycholinguistes ou statisticiens), aucune campagne d&#8217;&#233;valuation n&#8217;a par 
exemple utilis&#233; de concert plusieurs m&#233;triques. Ce papier s&#8217;appuie pr&#233;cis&#233;ment sur l&#8217;&#233;valuation d&#8217;un syst&#232;me 
de d&#233;tection des &#233;motions pour r&#233;pondre aux questions suivantes : 
</p>
<p>1) Quelles influences ont les m&#233;triques d&#8217;&#233;valuation sur l&#8217;estimation des syst&#232;mes ? 
2) Comment interpr&#233;ter clairement les r&#233;sultats en termes de performances ? 
3) Quelle est l&#8217;influence de l&#8217;utilisation syst&#233;matique du vote majoritaire sur l&#8217;&#233;valuation ? Rend-elle 
</p>
<p>bien compte de la diversit&#233; des jugements humains et donc des attentes utilisateurs ?  
</p>
<p>2 Cas d&#8217;&#233;cole : &#233;valuation du syst&#232;me de d&#233;tection des &#233;motions EmoLogus 
</p>
<p>Pour r&#233;pondre &#224; ces questions, nous avons men&#233; plusieurs exp&#233;rimentations avec un syst&#232;me de d&#233;tection 
</p>
<p>des &#233;motions, EmoLogus d&#233;velopp&#233; dans le cadre du projet ANR EmotiRob. Ce projet intervient dans un 
</p>
<p>contexte d'application original: la r&#233;alisation d'un robot compagnon &#233;motionnel pour des enfants fragilis&#233;s. 
</p>
<p>EmoLogus est un composant qui sert &#224; caract&#233;riser l'&#233;motion du locuteur en se basant sur le contenu 
</p>
<p>linguistique de ces messages oraux, et non, comme c&#8217;est souvent le cas, en conduisant une analyse 
acoustique du signal de parole. Il se base sur le principe de compositionnalit&#233; des &#233;motions: les mots lexicaux 
</p>
<p>poss&#232;dent une valeur &#233;motionnelle fixe d&#233;finie par une norme psycholinguistique, tandis que les verbes et les 
</p>
<p>adjectifs agissent comme des pr&#233;dicats, dont le r&#233;sultat d&#233;pend de la valeur &#233;motionnelle de leurs arguments 
</p>
<p>(LeTallec et al. 2010). EmoLogus analyse ainsi la structure de l&#8217;&#233;nonc&#233; pour identifier l&#8217;&#233;motion qu&#8217;il porte. 
Il a &#233;t&#233; compar&#233; avec un syst&#232;me de base (baseline) qui ne consid&#232;re l&#8217;&#233;nonc&#233; que comme un sac de mots: 
on se contente ici de sommer les valences &#233;motionnelles des mots qui le composent. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EVALUATION DE LA DETECTION DES EMOTIONS, OPINONS OU SENTIMENTS 
</p>
<p> 
</p>
<p>Notre objectif &#233;tant de comparer les performances des deux syst&#232;mes d&#8217;un point de vue purement 
linguistique (i.e. sans int&#233;grer l&#8217;influence des erreurs de reconnaissance de la parole), les exp&#233;rimentations 
ont &#233;t&#233; men&#233;es sur un conte enfantin (Le Grand Nord), comme souvent sur ce type d&#8217;applications (Volkova 
et al. 2010). Le corpus de test est de taille limit&#233;e (93 phrases) mais la r&#233;f&#233;rence a &#233;t&#233; obtenue, &#224; la 
</p>
<p>diff&#233;rence de la plupart des campagnes d&#8217;&#233;valuation, par un nombre &#233;lev&#233; de juges (31 en pratique). Notre 
objectif est en effet d&#8217;&#233;tudier l&#8217;influence de la dispersion des jugements sur l&#8217;&#233;valuation. L&#8217;annotation a 
consist&#233; &#224; attribuer &#224; chaque &#233;nonc&#233; une valeur &#233;motionnelle sur une &#233;chelle de 5 classes variant de -2 
</p>
<p>(&#233;motion tr&#232;s n&#233;gative) &#224; +2 (tr&#232;s positif). Deux &#233;valuations ont donc &#233;t&#233; conduites qui ont port&#233; sur : 
</p>
<p>&#61607; la valence + intensit&#233; &#233;motionnelle &#8211;  Les cinq classes d&#8217;annotation sont consid&#233;r&#233;es. 
</p>
<p>&#61607; la valence  seule &#8211; on ne consid&#232;re ici que trois classes : &#233;motion positive, n&#233;gative et neutre 
</p>
<p>Enfin, nous avons &#233;valu&#233; l&#8217;influence du contexte de discours en r&#233;alisant deux annotations manuelles 
successives. Dans un premier cas (&#233;valuation hors contexte), les &#233;nonc&#233;s &#233;taient pr&#233;sent&#233;s dans un ordre 
</p>
<p>al&#233;atoire. Dans le second, l&#8217;ordre de pr&#233;sentation respectait le fil du conte. Les tableaux 1 et 2 pr&#233;sentent les 
performances des deux syst&#232;mes suivant les m&#233;triques pr&#233;sent&#233;es pr&#233;c&#233;demment, &#224; la fois pour l&#8217;annotation 
en valence seule ou celle en valence et intensit&#233;. 
</p>
<p>Hors-contexte Robustesse F-mesure Pearson Kappa 
</p>
<p>EmoLogus 82,8 % 0,77 0,77 0,69 
</p>
<p>Baseline 64,6%  0,69 0,67 0,5 
</p>
<p>En-contexte Robustesse F-mesure Pearson Kappa 
</p>
<p>EmoLogus 75,3% 0,62 0,73 0,58 
</p>
<p>Baseline 53,8 % 0,39 0,42 0,31 
</p>
<p>Tableau 1 : Evaluation des performances en annotation en valence (3 classes). 
</p>
<p>Hors-contexte Robustesse F-mesure Pearson Kappa 
</p>
<p>EmoLogus 69,9 % 0,59 0,82 0,56 
</p>
<p>Baseline 52,7 % 0,41 0,69 0,30 
</p>
<p>En-contexte Robustesse F-mesure Pearson Kappa 
</p>
<p>EmoLogus 59,2% 0,47 0,79 0,48 
</p>
<p>Baseline 39,8 % 0,25 0,5 0,22 
</p>
<p>Tableau 2 : Evaluation des performances en annotation en valence et intensit&#233; (5 classes). 
</p>
<p>Fait rassurant, certaines conclusions se retrouvent sur toutes les m&#233;triques retenues : on observe dans tous 
</p>
<p>les cas une d&#233;gradation des performances lors de la prise en compte du contexte. L&#8217;analyse des r&#233;ponses des 
syst&#232;mes nous montre que ceux-ci peinent &#224; int&#233;grer aussi finement qu&#8217;un sujet humain le contexte dans 
l&#8217;appr&#233;ciation des &#233;motions, l&#8217;enchainement des actions cr&#233;ant une ambiance difficile &#224; mod&#233;liser. Par 
ailleurs, trois des m&#233;triques sur quatre semblent indiquer que, sans surprise, la cat&#233;gorisation est plus difficile 
</p>
<p>avec un nombre de classes sup&#233;rieur : les performances des syst&#232;mes sont  meilleures sur la t&#226;che de 
</p>
<p>classification en valence seule. Seul le coefficient de corr&#233;lation de Pearson se distingue ici. Cette 
</p>
<p>particularit&#233; nous am&#232;ne &#224; consid&#233;rer avec r&#233;serve cette m&#233;trique comme indicateur de performance. Il est 
</p>
<p>d&#8217;ailleurs malais&#233; de rapprocher corr&#233;lation et identit&#233; de r&#233;ponses comme le fait l&#8217;usage de cette m&#233;trique &#224; 
fin d&#8217;&#233;valuation. Dans les autres cas, nos observations, corrobor&#233;es par d&#8217;autres &#233;tudes (Grouin et al. 2009) 
posent la question de la mise en place d&#8217;une m&#233;trique qui serait moins sensible au nombre de classes afin de 
faciliter les comparaisons entre &#233;valuations.  
</p>
<p>On note enfin que le syst&#232;me de base pr&#233;sente des performances inf&#233;rieures &#224; EmoLogus pour toutes les 
</p>
<p>m&#233;triques. Ce r&#233;sultat montre l&#8217;int&#233;r&#234;t d&#8217;une prise en compte de la structure des &#233;nonc&#233;s. Cette coh&#233;rence 
des r&#233;sultats pourrait laisser croire &#224; l&#8217;absence d&#8217;influence de la m&#233;trique sur le classement des syst&#232;mes 
d&#8217;une campagne d&#8217;&#233;valuation. Les r&#233;sultats pr&#233;sent&#233;s ci-apr&#232;s montrent qu&#8217;il n&#8217;en est rien. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANTOINE J.-Y., LE TALLEC M., VILLANEAU J. 
</p>
<p> 
</p>
<p>3 Prise en compte de la diversit&#233; des opinions dans l&#8217;&#233;valuation des syst&#232;mes 
</p>
<p>Les r&#233;sultats pr&#233;c&#233;dents sugg&#232;rent que les m&#233;triques utilis&#233;es couramment sont d&#8217;assez bons indicateurs de 
la performance relative des syst&#232;mes. Leurs indications restent toutefois difficiles &#224; interpr&#233;ter en termes de 
</p>
<p>qualit&#233; absolue, avant tout du fait de la dispersion des jugements humains. Les &#233;motions, les opinions 
</p>
<p>correspondent en effet &#224; des &#233;tats cognitifs complexes influenc&#233;s par le contexte &#224; court-terme (historique de 
</p>
<p>l&#8217;interaction, situation d&#8217;&#233;nonciation) comme &#224; long terme (v&#233;cu personnel et socioculturel) et dont la 
perception varie de mani&#232;re sensible d'une personne &#224; l'autre. Il n&#8217;est donc pas &#233;tonnant que toutes les &#233;tudes 
montrent que l&#8217;accord inter-annotateur est bien plus faible sur ce type de t&#226;che que sur, par exemple, 
l&#8217;annotation en cat&#233;gories morpho-syntaxique. L&#8217;annotation du corpus de test que nous avons r&#233;alis&#233;e s&#8217;est 
ainsi traduit par des valeurs de Kappa assez faibles entre les 31 juges : 0,48 en contexte et 0,51 hors 
</p>
<p>contexte. Plut&#244;t que de discuter de la pertinence des mesures de Kappa, la figure 1 donne la r&#233;partition des 
</p>
<p>votes des 31 juges pour la phrase &#171;c&#8217;est court comme belle saison, je sais, mais les jours seront tr&#232;s longs&#187;. 
</p>
<p>0
</p>
<p>2
</p>
<p>4
</p>
<p>6
</p>
<p>8
</p>
<p>10
</p>
<p>12
</p>
<p>-2 -1 0 1 2
</p>
<p> 
</p>
<p>Figure 1 : Exemple de distribution des votes sur un &#233;nonc&#233; du corpus 
</p>
<p>On voit que les votes des experts se distribuent sur l&#8217;ensemble de l&#8217;&#233;chelle d&#8217;annotation. Face &#224; une telle 
dispersion, on peut s&#8217;interroger sur la pertinence d&#8217;une r&#233;f&#233;rence obtenue par vote majoritaire. Dans le cas 
pr&#233;sent, la cat&#233;gorie retenue ne repr&#233;sente que 38,7% des votes ! La r&#233;f&#233;rence en valence et intensit&#233; peut 
</p>
<p>ainsi repr&#233;senter moins de la majorit&#233; des votes dans 25,6% des annotations en contexte. Face &#224; cette 
</p>
<p>observation, deux questions se posent d&#232;s lors : 1) comment situer les performances des syst&#232;mes face aux 
</p>
<p>capacit&#233;s des sujets humains et 2) comment int&#233;grer la dispersion des jugements dans l&#8217;&#233;valuation. 
</p>
<p>3.1 Evaluation des syst&#232;mes et performances humaines 
</p>
<p>Compte-tenu de la dispersion des jugements humains observ&#233;s, il est clair qu&#8217;aucun juge humain ne peut 
&#233;galer la r&#233;f&#233;rence de test, qui ne repr&#233;sente qu&#8217;une approximation de l&#8217;opinion moyenne d&#8217;une population 
donn&#233;e. D&#232;s lors, les performances des syst&#232;mes ne devraient pas &#234;tre estim&#233;es en termes de m&#233;triques 
</p>
<p>absolues, mais compar&#233;es &#224; celles des sujets humains. Aussi avons-nous repris les jugements des 31 
</p>
<p>annotateurs que nous avons soumis aux m&#234;mes m&#233;triques que les syst&#232;mes test&#233;s. En ordonnant les r&#233;sultats, 
</p>
<p>nous avons d&#233;termin&#233; le classement des syst&#232;mes parmi les annotateurs humains (tableaux 3 et 4). 
</p>
<p>Hors-contexte Robustesse F-mesure Pearson Kappa 
</p>
<p>EmoLogus 9 &#232;me 22 &#232;me 23 &#232;me 10 &#232;me 
</p>
<p>Baseline 31 &#232;me 31 &#232;me 33 &#232;me 31 &#232;me 
</p>
<p>En-contexte Robustesse F-mesure Pearson Kappa 
</p>
<p>EmoLogus 19 &#232;me 32 &#232;me 24 &#232;me 24 &#232;me 
</p>
<p>Baseline 33 &#232;me 33 &#232;me 33 &#232;me 33 &#232;me 
</p>
<p>Tableau 3 : Classement des syst&#232;mes face aux 31 experts humains : annotation en valence (3 classes) 
</p>
<p>Plusieurs conclusions peuvent &#234;tre tir&#233;es de ces classements. Tout d&#8217;abord, les difficult&#233;s des deux syst&#232;mes 
&#224; consid&#233;rer le contexte se retrouvent, sans doute d&#8217;une mani&#232;re plus visible ici. Par ailleurs, si le syst&#232;me de 
base a des performances m&#233;diocres, il est amusant de constater que, pour certaines m&#233;triques, ses 
</p>
<p>performances d&#233;passent celles des juges les plus atypiques. A l&#8217;oppos&#233;, EmoLogus pr&#233;sente un classement 
tr&#232;s honorable (3&#176; sur 33) sur la t&#226;che d&#8217;&#233;tiquetage hors-contexte en valence et intensit&#233;. Performance que ne 
traduisait pas vraiment les 75,3% de robustesse donn&#233;es au tableau 2. Il semblerait que, sur une t&#226;che assez 
</p>
<p>complexe (5 classes), le syst&#232;me, bas&#233; sur une norme &#233;motionnelle &#233;quilibr&#233;e, soit plus &#224; m&#234;me d&#8217;adopter un 
comportement moyen repr&#233;sentatif de la population qu&#8217;un individu particulier.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>EVALUATION DE LA DETECTION DES EMOTIONS, OPINONS OU SENTIMENTS 
</p>
<p> 
</p>
<p>Hors-contexte Robustesse F-mesure Pearson Kappa 
</p>
<p>EmoLogus 3 &#232;me 13 &#232;me 11 &#232;me 9 &#232;me 
</p>
<p>Baseline 31 &#232;me 31 &#232;me 30 &#232;me 32 &#232;me 
</p>
<p>En-contexte Robustesse F-mesure Pearson Kappa 
</p>
<p>EmoLogus 27 &#232;me 28 &#232;me 23 &#232;me 18 &#232;me 
</p>
<p>Baseline 33 &#232;me 33 &#232;me 33 &#232;me 33 &#232;me 
</p>
<p>Tableau 4 : Classement des syst&#232;mes face aux 31 experts : annotation en valence+ intensit&#233; (5 classes) 
</p>
<p>Il nous semble ainsi qu&#8217;une &#233;valuation par classement par rapport &#224; des juges humains est plus &#224; m&#234;me de 
faire ressortir les qualit&#233;s et faiblesses des syst&#232;mes. On remarque toutefois que ces classements varient 
</p>
<p>significativement suivant la m&#233;trique utilis&#233;e. Cette observation est de nature &#224; jeter un doute sur les 
</p>
<p>&#233;valuations comp&#233;titives ne prenant en consid&#233;ration qu&#8217;une seule m&#233;trique, comme c&#8217;est g&#233;n&#233;ralement le 
cas en d&#233;tection d&#8217;&#233;motions ou d&#8217;opinion. Elle nous incite par ailleurs &#224; proposer une m&#233;trique qui prenne 
mieux en compte, &#224; la base, la dispersion des jugements lors de l&#8217;&#233;tablissement de la r&#233;f&#233;rence. 
</p>
<p>3.2 Int&#233;grer la distribution des jugements pour &#233;viter une dictature de la majorit&#233; 
</p>
<p>Les calculs de taux de robustesse, de pr&#233;cision ou de rappel reposent tous sur une &#233;valuation binaire : une 
</p>
<p>r&#233;ponse est consid&#233;r&#233;e comme bonne ou erron&#233;e au vu de la r&#233;f&#233;rence. Compte tenu de la fragilit&#233; d&#8217;une 
r&#233;f&#233;rence obtenue par vote majoritaire, nous avons voulu pond&#233;rer ces calculs &#233;valuatifs en tenant compte de 
</p>
<p>la distribution des jugements humains. Consid&#233;rons une annotation en valence (3 classes). Pour un &#233;nonc&#233; 
</p>
<p>donn&#233;, supposons que les jugements se sont r&#233;partis suivant la distribution suivante : 
</p>
<p> N&#233;gatif : 35% Neutre : 48 % Positif : 17% &#61537; Emotion choisie pour la r&#233;f&#233;rence : Neutre  
</p>
<p>Si le syst&#232;me propose la classe Neutre, sa r&#233;ponse est consid&#233;r&#233;e correcte &#224; 48% dans notre &#233;valuation 
</p>
<p>pond&#233;r&#233;e. S&#8217;il choisit la classe N&#233;gatif, sa r&#233;ponse est consid&#233;r&#233;e comme correcte &#224; 35%. Ce qui &#224; nos yeux 
repr&#233;sente une &#233;valuation plus proche de la r&#233;alit&#233; qu&#8217;une d&#233;cision binaire. Par ailleurs, notre objectif est 
d&#8217;estimer la performance des syst&#232;mes par rapport aux capacit&#233;s humaines, et non pas vis-&#224;-vis d&#8217;une 
r&#233;f&#233;rence quelque peu id&#233;ale. D&#232;s lors, le poids d&#8217;un &#233;nonc&#233; n&#8217;est plus de 1 dans le calcul du score global, 
mais pond&#233;r&#233; par le poids de la classe qui a re&#231;u le maximum de votes : 0,48 dans le cas pr&#233;sent. Cette 
</p>
<p>normalisation nous assure par ailleurs qu&#8217;un syst&#232;me qui choisirait syst&#233;matiquement la classe de r&#233;f&#233;rence 
atteindrait par un score maximal de 100%. Ce mod&#232;le de calcul fait dispara&#238;tre en pratique la notion de prise 
</p>
<p>de d&#233;cision : tr&#232;s peu d&#8217;&#233;nonc&#233;s sont jug&#233;s sans &#233;motion par la totalit&#233; des juges (dans notre exemple : 1 
&#233;nonc&#233; hors contexte et 0 en contexte) et la grande majorit&#233; des &#233;nonc&#233;s (82 sur 93 hors contexte et 76 en 
</p>
<p>contexte) sont class&#233;s comme neutres par au moins l&#8217;un des juges. La notion de pr&#233;cision et rappel ne se 
distingue donc plus d&#8217;un calcul en robustesse. De m&#234;me, les indices de Pearson et Kappa deviennent, tels 
quels, inutilisables. 
</p>
<p>Hors-contexte Robustesse : valence seule Robustesse : valence + intensit&#233;  
</p>
<p>EmoLogus  87,4% (18 &#232;me) 85,6% (9 &#232;me) 
</p>
<p>Baseline 80,7% (32 &#232;me)  71,9% (31 &#232;me) 
</p>
<p>En-contexte Robustesse Robustesse 
</p>
<p>EmoLogus 79,3% (30 &#232;me) 74,7%(28 &#232;me) 
</p>
<p>Baseline 64,9 % (33 &#232;me) 59,9%(33 &#232;me) 
</p>
<p>Tableau 5 : Evaluation pond&#233;r&#233;e des syst&#232;mes : r&#233;sultats et classements. 
</p>
<p>Parmi les indices pr&#233;c&#233;dents, seule la robustesse reste donc significative. Le tableau 5 donne les r&#233;sultats de 
</p>
<p>ce calcul pond&#233;r&#233;. Ces r&#233;sultats nous semblent repr&#233;senter plus fid&#232;lement les performances intrins&#232;ques des </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANTOINE J.-Y., LE TALLEC M., VILLANEAU J. 
</p>
<p> 
</p>
<p>syst&#232;mes de deux points de vue. D&#8217;une part, les valeurs de performances se sont l&#233;g&#232;rement accrues, ce qui 
correspond au ressenti d&#8217;une analyse qualitative des r&#233;ponses. En effet, en cas d&#8217;erreur, le syst&#232;me propose 
souvent la classe arriv&#233;e en seconde position au sein de la population de juges, ce que prend en compte cette 
</p>
<p>m&#233;trique pond&#233;r&#233;e. A l&#8217;oppos&#233;, le classement du syst&#232;me par rapport aux juges humains s&#8217;est d&#233;grad&#233;. Une 
fois encore, cette observation montre la d&#233;pendance &#224; la m&#233;trique d&#8217;&#233;valuation d&#8217;une campagne de test de 
type comp&#233;titif. 
</p>
<p>4 Conclusion 
</p>
<p>L&#8217;analyse de ce &#171; cas d&#8217;&#233;cole &#187; montre les difficult&#233;s li&#233;es &#224; l&#8217;&#233;valuation de ces donn&#233;es subjectives que sont 
les opinions et les &#233;motions. Elle montre &#233;galement que les indices d&#8217;&#233;valuation classiquement utilis&#233;s 
donnent des r&#233;sultats instables donc peu fiables. Ce constat &#233;tant &#233;tabli, il reste &#224; &#233;tudier des pistes pour 
</p>
<p>pallier cette insuffisance. Le coefficient alpha de Krippendorff ouvre des perspectives int&#233;ressantes par sa 
</p>
<p>plasticit&#233; : dans l'exemple d'&#233;valuation pr&#233;sent&#233; dans ce papier, il permet en effet d'introduire des m&#233;triques 
</p>
<p>entre les classes et de mesurer de fa&#231;on fine l'&#233;cart entre la notation propos&#233;e par un expert et la r&#233;f&#233;rence 
</p>
<p>compl&#232;te dans sa dispersion, sans recours au vote majoritaire. Une autre piste &#224; &#233;tudier est celle des 
</p>
<p>ensembles flous : la r&#233;f&#233;rence que constitue l&#8217;ensemble des avis des experts correspond &#224; des probabilit&#233;s 
d&#8217;appartenance floue (Milleman et Scholl 1996). Le meilleur syst&#232;me est celui qui donne l&#8217;ensemble net le 
plus proche de cet ensemble flou. 
</p>
<p>Remerciements : ce travail a &#233;t&#233; pour partie r&#233;alis&#233; dans le cadre de l&#8217;ANR EmotiRob (PSIROB&#8217;06). 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>CALLEJAS Z., LOPEZ-COZAR R. (2008) Influence of contextual information in emotion annotation for spoken 
</p>
<p>dialogue systems. Speech Communication. 50 (2008), 416-433 
</p>
<p>COHEN J. (1960) A coefficient of agreement for nominal scales. Educational &amp; Psycho. Meas., 20, 37-46. 
</p>
<p>EKMAN P. (1999) Patterns of  emotions: New Analysis of Anxiety and Emotion . Plenum Press. 
</p>
<p>GROUIN C., HURAULT-PLANTET M., PAROUBEK P., BERTHELIN J.B. (2009)  DEFT&#8217;07: une campagne 
d&#8217;&#233;valuation en fouille d&#8217;opinion. Revue des Nouvelles Technologies de l'Information. vol.E-17.1-24. 
</p>
<p>HAYES A.F, KRIPPENDORFF K. (2007) Answering the Call for a Standard Reliability Measure for Coding 
</p>
<p>Data. Communication Methods and Measures 1,1: 77-89. 
</p>
<p>LE TALLEC M., VILLANEAU J., ANTOINE J.-Y., SAVARY A., SYSSAU-VACCARELLA A. (2010) Emologus, a 
</p>
<p>compostional model of emotion detection based on the propositionnal content of spoken utterances Proc. 
</p>
<p>Text, Speech and Dialogue, TSD'2010, Brno, Tch&#233;quie, sept. 2010. In. LNCS/LNAI 6231, Springer 
</p>
<p>MILLEMANN S., SCHOLL P. (1996) Estimation de quantit&#233;s subjectives floues par des techniques 
</p>
<p>connexionnistes. Application &#224; l'&#233;valuation du confort automobile. In. MODULAD, num&#233;ro 17, Juin 1996. 
</p>
<p>SCHULLER B., STEIDL S., BATLINER A. (2009)  The INTERSPEECH 2009 Emotion Challenge. Proc. 
</p>
<p>Interspeech&#8217;2009, Brighton, UK. 
</p>
<p>STRAPPARAVA C., MIHALCEVA R. (2007). SemEval-2007 Task 14: Affective Tex. Proc. 4th International 
</p>
<p>Workshop on Semantic Evaluations (SemEval-2007), Prague, Juin 2007, 70&#8211;74. 
</p>
<p>VOLKOVA E., MOHLER B., MEURES D., GERDEMANN D. AND B&#220;LTHOFF,H. (2010) Emotional perception of 
</p>
<p>fairy tales: achieving agreement in emotion annotation of   text, Proc. NAACL HLT&#8217; 2010 
</p>
<p> </p>

</div></div>
</body></html>