<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un calcul de termes typ&#233;s pour la pragmatique lexicale: chemins et voyageurs fictifs dans un corpus de r&#233;cits de voyage</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Un calcul de termes typ&#233;s pour la pragmatique lexicale:
chemins et voyageurs fictifs dans un corpus de r&#233;cits de voyage
</p>
<p>Richard Moot1, Laurent Pr&#233;vot2, Christian Retor&#233;1
(1) Universit&#233; de Bordeaux, LaBRI &amp; INRIA
</p>
<p>(2) Universit&#233; de Provence, LPL
richard.moot@labri.fr, laurent.prevot@lpl-aix.fr, christian.retore@labri.fr
</p>
<p>R&#233;sum&#233;. Ce travail s&#8217;inscrit dans l&#8217;analyse automatique d&#8217;un corpus de r&#233;cits de voyage. &#192; cette fin, nous
raffinons la s&#233;mantique de Montague pour rendre compte des ph&#233;nom&#232;nes d&#8217;adaptation du sens des mots au
contexte dans lequel ils apparaissent. Ici, nous mod&#233;lisons les constructions de type &#8217;le chemin descend pendant
une demi-heure&#8217; o&#249; ledit chemin introduit un voyageur fictif qui le parcourt, en &#233;tendant des id&#233;es que le dernier
auteur a d&#233;velopp&#233; avec Bassac et Mery. Cette introduction du voyageur utilise la mont&#233;e de type afin que le
quantificateur introduisant le voyageur porte sur toute la phrase et que les propri&#233;t&#233;s du chemin ne deviennent pas
des propri&#233;t&#233;s du voyageur, f&#251;t-il fictif. Cette analyse s&#233;mantique (ou plut&#244;t sa traduction en lambda-DRT) est
d&#8217;ores et d&#233;j&#224; implant&#233;e pour une partie du lexique de Grail.
</p>
<p>Abstract. This work is part of the automated analysis of travel stories corpus. To do so, we refine Mon-
tague semantics, to model the adaptation of word meaning to the context in which they appear. Here we study
construction like &#8217;the path goes down for half an hour&#8217; in which the path introduces a virtual traveller following
it, extending ideas of the last author with Bassac, Mery. The introduction of a traveller relies on type raising sa-
tisfies the following requirements : the quantification binding the traveller has the widest scope, and properties of
the path do not apply to the traveller, be it virtual. This semantical analysis (actually its translation in &#955;-DRT) is
already implemented for a part of the Grail lexicon.
</p>
<p>Mots-cl&#233;s : S&#233;mantique lexicale, pragmatique, s&#233;mantique compositionnelle.
</p>
<p>Keywords: Lexical semantics, pragmatics, compositional semantics.
</p>
<p>1 Le sens compositionnel en contexte
</p>
<p>Suivant une tradition initi&#233;e par (Pustejovsky, 1995) et poursuivie par (Asher &amp; Pustejovsky, 2005; Asher, 2009),
et d&#8217;autres (Nunberg, 1995; Jacquey, 2006; Jayez, 2008) nous souhaitons rendre compte du sens des mots en
contexte dans un cadre compositionnel, et analyser correctement les pr&#233;dications accept&#233;es tout en rejetant celles
qui ne le sont pas. Les ph&#233;nom&#232;nes pris en compte jusqu&#8217;ici sont illustr&#233;s par les exemples suivants :
</p>
<p>(1) Le d&#238;ner &#233;tait sympathique, pourtant l&#8217;entr&#233;e &#233;tait br&#251;l&#233;e.
Ici, on r&#233;f&#232;re &#224; deux aspects d&#8217;un &#233;v&#233;nement complexe, le d&#238;ner.
</p>
<p>(2) Ce livre est volumineux mais int&#233;ressant.
Copr&#233;dication correcte entre les deux facettes de livre : contenu informationnel et objet physique.
</p>
<p>(3) J&#8217;ai mis les livres au grenier, je les avais tous lus.
Les livres sont compt&#233;s en tant qu&#8217;objets physiques, puis repris par les en tant que contenus
informationnels par le second pr&#233;dicat.
</p>
<p>(4) Washington borde le Potomac et a attaqu&#233; l&#8217;Irak.
Copr&#233;dication incorrecte (sauf trait d&#8217;humour) sur le pr&#233;sident si&#233;geant &#224; Washington et le lieu
g&#233;ographique de cette m&#234;me ville.
</p>
<p>Pour ces ph&#233;nom&#232;nes, nous avons con&#231;u une structure de lexique et un algorithme qui permettent de calculer les
repr&#233;sentations s&#233;mantiques de telles phrases, de rendre compte des copr&#233;dications correctes (1, 2, 3) et d&#8217;&#233;chouer</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RICHARD MOOT, LAURENT PR&#201;VOT, CHRISTIAN RETOR&#201;
</p>
<p>lorsqu&#8217;elles ne le sont pas (4), de quantifier correctement. Bien s&#251;r, la r&#233;solution ou non de ces conflits ne peut
&#234;tre mod&#233;lis&#233;e que par un syst&#232;me de types ou de cat&#233;gorisation s&#233;mantique plus riche que celui de Montague o&#249;
toutes les entit&#233;s sont de type e.
</p>
<p>Le mod&#232;le que nous avons d&#233;fini pr&#233;c&#233;demment (Bassac et al., 2010; Mery, 2011) et auquel cet article fait suite
s&#8217;apparente &#224; (Nunberg, 1995), mais s&#8217;inscrit encore mieux dans la direction ouverte par (Asher &amp; Pustejovsky,
2005; Asher, 2009). Comme ce dernier, nous essayons de nous placer int&#233;gralement dans le cadre de la th&#233;orie
des types sans utiliser de structures exotiques ou composites, et nous souhaitons, surtout en raison des objectifs
applicatifs d&#233;crits ci-dessous, obtenir un processus automatisable : pour ce faire, nous avons d&#251; expliciter &#224; la fois
la structure des donn&#233;es et les modes de composition, que l&#8217;ouvrage initial (Pustejovsky, 1995) laissait assez flous.
</p>
<p>Nous nous &#233;loignons du point de vue de Asher sur la question suivante. Les relations entre les sens des mots sont
un sous-ensemble strict de tous les possibles qu&#8217;offre le monde ou l&#8217;univers du discours. Le prix &#224; payer est une
(trop ?) grande souplesse : les types ne conditionnent pas les glissements de sens possibles. Notre mod&#232;le insiste
sur l&#8217;arbitraire de ces glissements de sens, possibles ou non dans la langue.
</p>
<p>Par comparaison avec de pr&#233;c&#233;dents articles (Bassac et al., 2010; Mery, 2011), nous traitons ici d&#8217;un autre genre
de ph&#233;nom&#232;nes qui requiert une mont&#233;e de type (type raising), comme par exemple : 1
</p>
<p>(5) Le chemin descend pendant un kilom&#232;tre.
On peut h&#233;siter &#224; mod&#233;liser cette situation par la s&#233;mantique attribu&#233;e &#224; descend. Soit ce verbe admet
effectivement un chemin statique dans l&#8217;espace comme sujet, et son altitude d&#233;croit &#224; partir de l&#8217;origine
pendant un kilom&#232;tre, soit on fait appel &#224; un voyageur fictif qui suivrait ce chemin et descendrait pendant
un kilom&#232;tre.
</p>
<p>(6) le chemin descend pendant une demi-heure
Cette fois, nul doute n&#8217;est permis, il faut consid&#233;rer un voyageur fictif qui suit le chemin, et m&#234;me sans
doute son mode de locomotion, si on veut inf&#233;rer l&#8217;endroit atteint en une demi-heure.
</p>
<p>Ce type de ph&#233;nom&#232;nes n&#233;cessite d&#8217;introduire une personne qui suive le chemin. Il faut aussi s&#8217;inscrire dans le
cadre d&#233;fini pr&#233;c&#233;demment (&#955;-calcul du second ordre) pour ne pas perdre les acquis obtenus pr&#233;c&#233;demment. Du
reste, tous ces ph&#233;nom&#232;nes sont simultan&#233;ment pr&#233;sents. Expliquons d&#233;j&#224; d&#8217;o&#249; ils proviennent.
</p>
<p>2 Corpus et objectifs applicatifs : itin&#233;raires pyr&#233;n&#233;ens
</p>
<p>L&#8217;&#233;tude de ce ph&#233;nom&#232;ne nous a &#233;t&#233; sugg&#233;r&#233;e par l&#8217;&#233;tude d&#8217;un corpus de 576 334 mots, constitu&#233; de r&#233;cits de
voyage dans les Pyr&#233;n&#233;es, et propri&#233;t&#233; de la m&#233;diath&#232;que de Pau. Notre projet, Itipy, financ&#233; par la r&#233;gion Aquitaine
a pour objectif la reconstruction automatique d&#8217;itin&#233;raires passant par certains lieux &#224; partir de ces r&#233;cits. Le texte
est annot&#233; et les paragraphes pertinents sont isol&#233;s par nos partenaires palois (Loustau, 2008).
</p>
<p>Nous intervenons ensuite sur l&#8217;analyse profonde syntaxique et s&#233;mantique, mais aussi pragmatique et discursive,
des fragments de r&#233;cits identifi&#233;s comme pertinents. L&#8217;analyseur syntaxique utilis&#233; est l&#8217;analyseur syntaxique et
s&#233;mantique Grail dont la grammaire a &#233;t&#233; acquise automatiquement sur corpus. La partie s&#233;mantique est plus
difficile &#224; acqu&#233;rir, elle a &#233;t&#233; saisie directement. Les repr&#233;sentations s&#233;mantiques sont calcul&#233;es gr&#226;ce &#224; la &#955;-DRT,
qui cadre bien avec l&#8217;analyseur cat&#233;goriel. (Moot, 2010a,b)
</p>
<p>Une partie de ce travail a d&#8217;ores et d&#233;j&#224; &#233;t&#233; implant&#233;e dans Grail par Emeric Kien (Kien, 2010) sur un sous
ensemble du lexique &#8212; comme il l&#8217;a fait &#224; la main, il ne l&#8217;a fait que sur une petite partie du lexique &#8212; tandis
que la grammaire lexicalis&#233;e est beaucoup plus vaste, ayant &#233;t&#233; acquise automatiquement sur corpus. En fait c&#8217;est
l&#8217;analogue en &#955;-DRT qui a &#233;t&#233; programm&#233;, mais cela ne change par grand chose hormis une pr&#233;sentation plus
lourde, celle des &#955;-DRS du second ordre...
</p>
<p>1. Ces deux exemples parall&#232;les ne sont pas directement issus du corpus, voir ci-apr&#232;s pour des exemples similaires issus du corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN CALCUL DE TERMES TYP&#201;S POUR LA PRAGMATIQUE LEXICALE
</p>
<p>3 Types et termes
</p>
<p>Le point de d&#233;part : la s&#233;mantique de Montague Notre mod&#232;le se voit comme un prolongement de la s&#233;man-
tique de Montague, de la partie qui conduit de l&#8217;analyse syntaxique &#224; des formules logiques &#8212; nous ne parlons
pas ici de l&#8217;interpr&#233;tation dans un ou des mondes possible. Ceci repose sur la correspondance entre cat&#233;gories syn-
taxiques et types s&#233;mantiques. Grosso modo, l&#8217;analyse syntaxique de type S (qui correspond au type s&#233;mantique
des phrases, les valeurs de v&#233;rit&#233;s t) est un &#955;-terme dont les variables libres correspondent aux mots, et le lexique
fournit des &#955;-termes du m&#234;me type s&#233;mantique : en les substituant et en r&#233;duisant le terme obtenu (c&#8217;est l&#224; que
se niche la compositionnalit&#233;) on obtient un terme normal de type t : c&#8217;est une formule logique, la repr&#233;sentation
s&#233;mantique. N&#233;anmoins il faut au minimum partager le type e, les individus (aussi appel&#233;s entit&#233;s), en diverses
sortes, pour que le calcul de la s&#233;mantique bloque &#224; juste titre lorsque le type d&#8217;un argument ne correspond pas au
type attendu par la fonction. Par exemple on peut demander que le type du sujet de descend soit un objet anim&#233;.
</p>
<p>Types et termes du second ordre Pour le genre de ph&#233;nom&#232;nes que nous souhaitons &#233;tudier et en particulier
lorsqu&#8217;il y a copr&#233;dication, nous nous pla&#231;ons dans le cadre du &#955;-calcul du second ordre appel&#233; syst&#232;me F (Girard,
1971). C&#8217;est absolument essentiel, sinon nous ne pourrions pas poursuivre un discours ni faire la conjonction de
propri&#233;t&#233;s portant sur des aspects diff&#233;rents d&#8217;une m&#234;me entit&#233;, comme dans les copr&#233;dications ci-dessus.
</p>
<p>Les types du second ordre sont d&#233;finis comme suit :
</p>
<p>&#8211; Sont des types de base :
&#8211; t les valeurs de v&#233;rit&#233;, v les &#233;v&#233;nements,
&#8211; quelques types constants correspondant aux diff&#233;rentes sortes d&#8217;individus, par exemple chemin,
&#8211; des variables de type, not&#233;es par des lettres grecques (issues d&#8217;un ensemble d&#233;nombrable P )
</p>
<p>&#8211; Lorsque T est un type et &#945; une variable de type, qui peut ou non appara&#238;tre dans T , &#923;&#945;. T est un type (dit
polymorphe).
</p>
<p>&#8211; Lorsque T1 et T2 sont des types, T1 &#8594; T2 est aussi un type.
Pour d&#233;finir les termes, on se donne une infinit&#233; d&#233;nombrable de variables de chaque type, ainsi que des constantes
en nombre fini pour chaque type : 2
</p>
<p>&#8211; Une variable de type T c&#8217;est-&#224;-dire x : T (ce qu&#8217;on &#233;crit aussi xT ) est un terme de type T .
&#8211; Une constante de type T c&#8217;est-&#224;-dire c : T (ce qu&#8217;on &#233;crit aussi cT ) est un terme de type T .
&#8211; (f &#964;) est un terme de type U quant &#964; est de type T et f de type T &#8594; U .
&#8211; &#955;xT. &#964; est un terme de type T &#8594; U si x est une variable de type T , et &#964; un terme de type U .
&#8211; &#964;{U} est un terme de type T [U/&#945;] quand &#964; : &#923;&#945;. T , et U est un type.
&#8211; &#923;&#945;.&#964; est un terme de type &#923;&#945;.T quand &#945; est une variable de type &#964; : T sans occurrence de &#945; dans le type d&#8217;une
</p>
<p>variable libre.
Lorsque les constantes sont celles de la logique multisorte d&#8217;ordre sup&#233;rieur (op&#233;rateurs &amp; : t &#8594; t &#8594; t,&#8704;i :
(ei &#8594; t) &#8594; t,&#8704;i,j : (ei &#8594; (ej &#8594; t) &#8594; t, , . . ., et constantes du langage logique regarde : eh &#8594; eh &#8594; t) ce
syst&#232;me est appel&#233; &#923;Tyn.
</p>
<p>Les r&#233;ductions pour &#955; et &#923; sont d&#233;finies de mani&#232;res similaires :
&#8211; (&#923;&#945;.&#964;){U} se r&#233;duit en &#964; [U/&#945;] (rappelons que &#945; et U sont des types).
&#8211; (&#955;x.&#964;)u se r&#233;duit en &#964; [u/x] (r&#233;duction habituelle).
On a les r&#233;sultats bien connus suivants :
&#8211; Tout terme du syst&#232;me F admet une et une seule forme normale (Girard, 1971).
&#8211; Corollaire : si les constantes (du &#955;-calcul) correspondent au langage L multisorte d&#8217;une logique d&#8217;ordre n
</p>
<p>(op&#233;rations logiques, pr&#233;dicats, fonctions et constantes), tout terme normal de type t correspond &#224; une formule
de L.
</p>
<p>Que signifient-ces r&#233;sultats ? L&#8217;analyse syntaxique d&#8217;une phrase m1 &#183; &#183; &#183;mn &#233;tant de type S, sa contrepartie s&#233;-
mantique est un terme u[x1, . . . , xn] de type t dont les variables libres xi : Xi correspondent aux types des mots.
En rempla&#231;ant dans u les xi : Xi par les termes principaux fournis par le lexique, on va obtenir un terme de type
t 3, dont on calcule la forme normale t&#9702; : les r&#233;sultats ci-dessus nous garantisse que t&#9702; est bel et bien une formule
</p>
<p>2. cette finitude n&#8217;est pas n&#233;cessaire, mais raisonnable aussi bien d&#8217;un point de vue applicatif que cognitif : les constantes sont intro-
duites dans le lexique, qui comporte un nombre fini d&#8217;entr&#233;es, chacune ne contenant qu&#8217;un nombre fini de termes finis : par opposition aux
mod&#233;lisations en termes de mondes possibles, nous restons ici dans le champ des r&#232;gles et du calculable.
</p>
<p>3. Comme nous prenons en compte les glissements de sens, et donc les changement de type de base, ce n&#8217;est pas aussi imm&#233;diat que dans</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RICHARD MOOT, LAURENT PR&#201;VOT, CHRISTIAN RETOR&#201;
</p>
<p>logique du langage L : c&#8217;est la repr&#233;sentation s&#233;mantique de la phrase.
</p>
<p>Structure du lexique et d&#233;rivation de repr&#233;sentations s&#233;mantiques Le lexique contient un terme principal,
qui s&#8217;apparente &#224; celui de la s&#233;mantique de Montague, hormis qu&#8217;il est &#233;crit dans &#923;Tyn. Il contient aussi des
termes optionnels, qu&#8217;on utilise au besoin en cas de conflit de types, ceux-ci correspondant aux glissements de
sens &#233;voqu&#233;s dans les exemples. Une bonne partie de ces termes sont de simples fonctions qui transforment un
objet de type x en un objet de type y lorsque x est un sous-type de y (par exemple g : voiture&#8594; v&#233;hicule).
Les repr&#233;sentations s&#233;mantiques de la phrase sont obtenues comme suit :
</p>
<p>1. Obtenir une analyse s&#233;mantique qui soit au minimum un arbre pr&#233;cisant pour chaque n&#339;ud interne quel
sous arbre s&#8217;applique &#224; quel autre sous-arbre. 4
</p>
<p>2. L&#8217;&#233;crire comme un &#955;-terme de &#923;Tyn.
</p>
<p>3. R&#233;soudre les conflits de types en utilisant les &#955;-termes de &#923;Tyn comme indiqu&#233; ci-apr&#232;s, plusieurs solutions
sont possibles, ce sont tous les termes correctement typ&#233;s de type t.
</p>
<p>4. R&#233;duire ces &#955;-termes, en vertu des r&#233;sultats ci-dessus mentionn&#233;s des formules logiques, ce sont les repr&#233;-
sentations s&#233;mantiques de l&#8217;&#233;nonc&#233; analys&#233;.
</p>
<p>Les conflits se pr&#233;sentent sous la forme (&#955;xA.u)wW : un terme de typeA est attendu par la fonction (&#955;xA.u) mais
l&#8217;argument fourni est de type W . Pour r&#233;soudre les conflits, on proc&#232;de de l&#8217;une des deux mani&#232;res suivantes :
</p>
<p>transformation rigide Le lexique fournit, pour un mot impliqu&#233; dans u ou pour un mot impliqu&#233; dans w un
terme g de type W &#8594; A : le terme se r&#233;sout en (&#955;xA.u)(gw)A.
</p>
<p>transformation flexible Les diverses occurrences de xA dans u sont utilis&#233;es avec des types diff&#233;rentsA1, . . . , An :
on peut utiliser, si le lexique en fournit, des termes diff&#233;rents de types gi : W &#8594; Ai pour chaque occurrence
de x et remplacer comme le veut la &#946;-r&#233;duction chaque occurrence de x par (gi(w)) : Ai.
</p>
<p>Le m&#233;canisme ci-dessus est effectif, il a &#233;t&#233; implant&#233; dans Grail par Emeric Kien (Kien, 2010), mais en &#955;-DRT et
non en s&#233;mantique de Montague.
</p>
<p>4 Du chemin au voyageur fictif : mont&#233;e de type puis transformation
</p>
<p>Venons-en au ph&#233;nom&#232;ne en question, illustr&#233; par de nombreux exemples de notre corpus Itipy :
</p>
<p>(7) (...) cette route monte jusqu&#8217;&#224; Lux o&#249; l&#8217;on arrive par une jolie avenue de peupliers.
</p>
<p>(8) (...) cette route qui monte sans cesse pendant deux heures
</p>
<p>(9) Le chemin monte (...) Non extrait du corpus, mais similaire, et plus rapide &#224; traiter ci-apr&#232;s.
</p>
<p>Dans l&#8217;exemple 7 on pourrait penser que la phrase signifie simplement que l&#8217;altitude de la route est une fonction
croissante de l&#8217;abscisse curviligne, du point de r&#233;f&#233;rence jusqu&#8217;&#224; Lux. Mais le second exemple 8 montre clairement
que cette interpr&#233;tation n&#8217;est pas convenable : pour l&#8217;exemple 8 il faut consid&#233;rer un voyageur qui suit cette route,
pendant deux heures. On observe dans le corpus que ce genre de constructions o&#249; la route devient le voyageur
qui la suit, peut tr&#232;s bien s&#8217;appliquer alors que le narrateur, lui m&#234;me en voyage ne suit pas la route ainsi d&#233;crite !
Il faut m&#234;me parfois suivre assez longtemps la description avant de pouvoir dire si le voyageur la suit ou non.
Le voyageur en question n&#8217;est donc pas forc&#233;ment l&#8217;un des r&#233;f&#233;rents de discours : il peut &#234;tre fictif et doit &#234;tre
introduit dans le terme et li&#233; par une quantification (existentielle en hypoth&#232;se ou universelle en conclusion).
</p>
<p>Comme dans les cas pr&#233;c&#233;dents, le mod&#232;le d&#233;tecte la n&#233;cessit&#233; d&#8217;un glissement de sens par un conflit de types,
dont la nature diff&#232;re des pr&#233;c&#233;dents :(
</p>
<p>Phumain&#8594;t
(
uchemin
</p>
<p>))
humain 6= chemin
</p>
<p>la s&#233;mantique de Montague.
4. Dans notre cas, cette &#233;tape est r&#233;alis&#233;e par l&#8217;analyseur cat&#233;goriel Grail.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN CALCUL DE TERMES TYP&#201;S POUR LA PRAGMATIQUE LEXICALE
</p>
<p>un groupe verbal requiert un sujet humain, ou en tout cas mobile, tandis que le dit sujet est une route, un che-
min, etc. &#192; la diff&#233;rence des ph&#233;nom&#232;nes trait&#233;s ant&#233;rieurement, il n&#8217;est pas possible que le terme assurant le
changement de type soit une simple constante de changement de type, puisqu&#8217;il doit contenir la variable corres-
pondant au voyageur (li&#233;e par une quantification existentielle n&#233;gative, ins&#233;r&#233;e dans une conditionnelle ou par une
quantification universelle).
</p>
<p>Clairement, c&#8217;est uchemin qui produit un xhumain, mais si u restait argument de P devenu humain on serait
confront&#233; aux deux probl&#232;mes suivants :
</p>
<p>1. D&#8217;une part, le quantificateur correspondant au voyageur fictif ne pourrait avoir la port&#233;e sur le pr&#233;dicat.
</p>
<p>2. D&#8217;autre part les propri&#233;t&#233;s du chemin, comme par exemple, goudronn&#233;, deviendraient des propri&#233;t&#233;s du
voyageur fictif ! 5 On notera que la route agr&#233;able 6 peut &#234;tre trait&#233; dans ce m&#234;me cadre, puisqu&#8217;une variable
d&#8217;&#233;v&#233;nement appara&#238;t aussi.
</p>
<p>Le premier point &#233;voque la mont&#233;e de type (type raising) des grammaires cat&#233;gorielles ou les d&#233;placements furtifs
(covert movement) de la grammaire g&#233;n&#233;rative. C&#8217;est pourquoi, la transformation va s&#8217;appliquer non au type
chemin, mais au type &#233;lev&#233; de chemin (chemin &#8594; t) &#8594; t, pour donner non un humain mais le type &#233;lev&#233;
correspondant (humain &#8594; t) &#8594; t. En raison des variables d&#8217;&#233;v&#233;nement, on fait cette transformation non avec
t mais avec t&#772; := v &#8594; t. Les deux probl&#232;mes possibles mentionn&#233;s ci-dessus se trouvent r&#233;solus par cette m&#234;me
id&#233;e. Donnons ici les lambda-termes de l&#8217;exemple (9), et calculons la forme logique :
</p>
<p>le : &#923;&#945;&#955;P&#945;&#8594;t(&#964; (&#945;&#8594;t)&#8594;&#945; P ) &#8212; pour toute propri&#233;t&#233; des objets de type &#945;, le en choisit un qui la satisfait, d&#233;ter-
min&#233; par le contexte.
</p>
<p>chemin : &#955;xcheminchemin(x)
</p>
<p>(le chemin) : ((&#923;&#945;&#955;P&#945;&#8594;t(&#964; (&#945;&#8594;t)&#8594;&#945; P )){chemin} &#955;xcheminchemin(x)))
=&#946; (&#955;P chemin&#8594;t(&#964; (chemin&#8594;t)&#8594;chemin P ))&#955;xcheminchemin(x)))
</p>
<p>=&#946; (&#964; &#955;xcheminchemin(x)) : chemin
</p>
<p>&#8658; &#955;P chemin&#8594;v&#8594;t&#955;ev(P (&#964; &#955;xcheminchemin(x)) e) (mont&#233;e de type)
h : &#955;Q(chemin&#8594;v&#8594;t)&#8594;v&#8594;t&#955;Phumain&#8594;v&#8594;t
</p>
<p>(Q (&#955;cchemin&#955;ev &#8704;(&#955;vhumain suivre(e, v, c)&#8658; ((P v) e)))) (coercion de type)
(h (le chemin)) :
</p>
<p>((&#955;Q(chemin&#8594;v&#8594;t)&#8594;v&#8594;t&#955;Phumain&#8594;v&#8594;t
</p>
<p>(Q (&#955;cchemin&#955;ev &#8704;(&#955;vhumain suivre(e, v, c)&#8658; ((P v) e)))))
(&#955;P chemin&#8594;v&#8594;t&#955;ev(P (&#964; &#955;xcheminchemin(x)) e)))
</p>
<p>=&#946; &#955;Phumain&#8594;v&#8594;t&#955;ev &#8704;(&#955;yhumainsuivre(e, y, (&#964; &#955;xcheminchemin(x)))&#8658; ((P x) e))
monte : &#955;xhumain&#955;evmonte(e, x)
</p>
<p>((h (le chemin)) monte) :
</p>
<p>((&#955;Phumain&#8594;v&#8594;t&#955;ev &#8704;(&#955;yhumainsuivre(e, y, (&#964; &#955;xcheminchemin(x)))&#8658; ((P x) e)))
(&#955;xhumain&#955;evmonte(e, x)))
</p>
<p>=&#946; &#955;ev&#8704;(&#955;yhumainsuivre(e, y, (&#964; &#955;xcheminchemin(x)))&#8658; monte(e, y))
Ce qui est bien la repr&#233;sentation s&#233;mantique attendue, sous forme de &#955;-terme. Une paraphrase possible serait : si
un &#234;tre humain suit ce chemin, alors il monte. Vu le type de ce terme, on peut lui appliquer des modifieurs comme
pendant deux heures ou pendant trois kilom&#232;tres de la mani&#232;re usuelle.
</p>
<p>5 Conclusions et perspectives
</p>
<p>On trouve aussi dans le corpus des constructions du type la route conduit &#224; et la route nous conduit &#224;
</p>
<p>5. Ce qui est rarement le cas, hormis chez Morris et Goscinny !
6. Merci au relecteur anonyme de cet exemple.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RICHARD MOOT, LAURENT PR&#201;VOT, CHRISTIAN RETOR&#201;
</p>
<p>(10) La lune, qui &#233;claire notre marche, nous fait d&#233;couvrir sur la droite un sentier qui serpente. Il nous conduit
sur un petit plateau, au milieu de sapins, au-dessus et &#224; quelque distance du torrent de Ramun.
</p>
<p>(11) Nous part&#238;mes pour Bar&#232;ges &#224; 8 heures du matin par une fort jolie route qui nous conduisit &#224; Lourdes.
</p>
<p>(12) La route qui y conduit est des plus rapide, quoiqu&#8217;assez carrossable.
</p>
<p>Serait-il raisonnable de traiter conduire et mener comme nous l&#8217;avons fait pour monter, descendre,. . . ? Nous ne le
pensons pas : il s&#8217;agit plut&#244;t d&#8217;un ph&#233;nom&#232;ne de diath&#232;se : l&#8217;agent est au second plan dans la construction avec un
nous objet de conduire, pour &#234;tre omis dans les constructions sans ce nous.
</p>
<p>Dans ce cadre unifi&#233; &#8212; m&#234;me l&#8217;analyse syntaxique se fait en th&#233;orie des types &#8212; il nous reste plusieurs points &#224;
&#233;tudier outre celui ci-dessus :
</p>
<p>&#8211; &#233;criture ou acquisition du lexique s&#233;mantique y compris avec les termes optionnels
&#8211; conversion du temps en espace et r&#233;ciproquement :
</p>
<p>&#8211; deux heures apr&#232;s .... o&#249; sont-ils ?
&#8211; trois kilom&#232;tres plus loin ... quelle heure est-il ?
&#8211; deux heures apr&#232;s .... trois kilom&#232;tres plus loin .... une heure apr&#232;s .... quatre kilom&#232;tres plus loin .... o&#249;
</p>
<p>sont-ils ? quelle heure est-il ?
&#8211; Comment ouvrir des cadres de discours, spatiaux ou temporels, et surtout, comment les refermer ?
&#8211; Comment &#233;tablir automatiquement les relations de discours (SDRT) en particulier de narration et d&#8217;&#233;laboration
</p>
<p>(cette derni&#232;re complique consid&#233;rablement la reconstitution de l&#8217;itin&#233;raire).
&#8211; Comment g&#233;rer la contrainte entre transformations flexibles et rigides &#224; l&#8217;int&#233;rieur du &#955;-calcul, qui est jusqu&#8217;ici
</p>
<p>une indication sur chaque transformation ? Ce dernier point est quasi r&#233;solu, en utilisant des types lin&#233;aires qui
permettent de dire dans le type m&#234;me des transformations les facettes qui sont compatibles (copr&#233;dicables).
</p>
<p>R&#233;f&#233;rences
</p>
<p>ASHER N. (2009). A web of words : Lexical meaning in context. (forthcoming book).
</p>
<p>ASHER N. &amp; PUSTEJOVSKY J. (2005). Word meaning and commonsense metaphysics. (revised version of the
2000 paper : The Metaphysics of Words in Context).
</p>
<p>BASSAC C., MERY B. &amp; RETOR&#201; C. (2010). Towards a Type-Theoretical Account of Lexical Semantics.
Journal of Logic Language and Information, 19(2), 229&#8211;245.
GIRARD J. Y. (1971). Une extension de l&#8217;interpr&#233;tation de g&#246;del &#224; l&#8217;analyse et son application : l&#8217;&#233;limination des
coupures dans l&#8217;analyse et la th&#233;orie des types. In J. E. FENSTAD, Ed., Proceedings of the Second Scandinavian
Logic Symposium, volume 63 of Studies in Logic and the Foundations of Mathematics, p. 63&#8211;92, Amsterdam :
North Holland.
</p>
<p>JACQUEY E. (2006). Un cas de &#171; polys&#233;mie logique &#187; : mod&#233;lisation de noms d&#8217;action en fran&#231;ais ambigus entre
processus et artefact. Traitement Automatique des Langues, 47(1), 137&#8211;166.
JAYEZ J. (2008). Quel(s) r&#244;le(s) pour les &#8220;facettes&#8221; ? Langages, 172(4), 53&#8211;68.
KIEN E. (2010). Du sens des mots &#224; l&#8217;analyse automatique d&#8217;une phrase. M&#233;moire de stage d&#8217;initiation &#224; la
recherche, ENS-Cachan &amp; INRIA Bordeaux.
</p>
<p>LOUSTAU P. (2008). Interpr&#233;tation automatique d&#8217;itin&#233;raires dans des r&#233;cits de voyages D&#8217;une information
g&#233;ographique du syntagme &#224; une information g&#233;ographique du discours. Th&#232;se de doctorat, Universit&#233; de Pau
et des Pays de l&#8217;Adour.
</p>
<p>MERY B. (2011). Mod&#233;lisation de la s&#233;mantique lexicale dans le cadre de la th&#233;orie des types. PhD thesis,
Universit&#233; de Bordeaux 1.
</p>
<p>MOOT R. (2010a). Semi-automated extraction of a wide-coverage type-logical grammar for French. In Procee-
dings of Traitement Automatique des Langues Naturelles (TALN), Montreal.
</p>
<p>MOOT R. (2010b). Wide-coverage French syntax and semantics using Grail. In Proceedings of Traitement
Automatique des Langues Naturelles (TALN), Montreal.
</p>
<p>NUNBERG G. (1995). Transfers of meaning. Journal of semantics, 12(2), 109&#8211;132.
PUSTEJOVSKY J. (1995). The generative lexicon. M.I.T. Press.</p>

</div></div>
</body></html>