<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>D&#233;monstration d&#8217;un outil de &#171; Calcul Litt&#233;raire &#187;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>MODELE DE DOCUMENT POUR TALN 2011 
 
</p>
<p>D&#233;monstration d&#8217;un outil de &#171; Calcul Litt&#233;raire &#187; 
</p>
<p>Jean Rohmer 1 
</p>
<p>(1) Ecole Sup&#233;rieure d'Ing&#233;nieurs L&#233;onard de Vinci  92916  Paris La D&#233;fense Cedex 
jean.rohmer@devinci.fr 
</p>
<p>Sous le nom de &#171; Calcul Litt&#233;raire &#187; (ou &#171; Litteratus Calculus &#187;) nous avons d&#233;velopp&#233; un d&#233;monstrateur de 
repr&#233;sentation de connaissances en langage naturel, qui peut &#234;tre vu &#224; la fois comme un gestionnaire de 
connaissances exprim&#233;es en langage naturel, et comme une infrastructure utile pour l&#8217;analyse de documents 
ou de corpus de textes. Ce travail fait suite &#224; la r&#233;alisation d&#8217;un produit industriel &#224; base de r&#233;seaux 
s&#233;mantiques, Ideiance, qui a &#233;t&#233; commercialis&#233; par la soci&#233;t&#233; &#233;ponyme &#224; partir de 1996, et utilis&#233; dans de 
grandes entreprises, ainsi que par les Arm&#233;es pour le Renseignement Militaire, en particulier &#224; partir du 
moment o&#249; il a &#233;t&#233; repris par la soci&#233;t&#233; Thales en 2004. Pr&#233;curseur du Web S&#233;mantique, Id&#233;liance permet 
de cr&#233;er et d&#8217;exploiter collectivement, sur un serveur, des r&#233;seaux s&#233;mantiques, c'est-&#224;-dire des &#233;nonc&#233;s de 
la forme Sujet / Verbe / Compl&#233;ment, le tout assorti de la notion de Cat&#233;gorie. L&#8217;exp&#233;rience a montr&#233; qu&#8217;un 
formalisme aussi &#233;l&#233;mentaire reste rebutant pour au moins 95% des utilisateurs, qui refusent l&#8217;effort 
minimal de mod&#233;lisation correspondant, m&#234;me habill&#233; d&#8217;&#233;diteurs et visualiseurs graphiques ergonomiques. 
</p>
<p>Ceci nous a conduit &#224; imaginer un outil o&#249; les &#233;nonc&#233;s ne seraient en rien contraints, mais exprim&#233;s sous 
forme de phrases en langage naturel, sans autre restriction. Il sera en effet difficile &#224; un utilisateur potentiel 
de dire &#171; faire une phrase, c&#8217;est trop compliqu&#233; ou trop abstrait pour moi &#187;, comme ils le disent d&#232;s qu&#8217;il 
s&#8217;agit de cr&#233;er un graphe s&#233;mantique et ses cat&#233;gories. Le principe du &#171; calcul litt&#233;raire &#187; est le suivant : 
</p>
<p>On constitue un ensemble d&#8217;&#233;nonc&#233;s ou phrases ind&#233;pendantes les unes des autres, appel&#233;es inf&#233;rons. Plus 
pr&#233;cis&#233;ment un inf&#233;ron est une phrase minimale et autonome compr&#233;hensible par une certaine communaut&#233; 
de personnes. Pour tout couple d&#8217;inf&#233;rons, on construit leur intersection en terme de mots &#8211;apr&#232;s &#233;ventuelle 
lemmatisation-. Ces intersections s&#8217;appellent des interlogos. On constitue ainsi automatiquement un graphe 
biparti d&#8217;inf&#233;rons et d&#8217;interlogos. A ce graphe, on peut applique un ensemble d&#8217;op&#233;rateurs visuels de 
navigation et contraintes ensemblistes, que nous appelons &#171; azimuts &#187;,  qui se rapprochent de la projection 
des graphes conceptuels, et plus g&#233;n&#233;ralement de la logique du premier ordre. Il faut noter que le calcul 
automatique des interlogos s&#8217;apparente &#224; un m&#233;canisme d&#8217;extraction d&#8217;entit&#233;s nomm&#233;es, mais sans la 
contrainte de disposer au pr&#233;alable d&#8217;ontologies. Une fois le graphe d&#8217;inf&#233;rons et d&#8217;interlogos constitu&#233;, on 
peut lui appliquer des outils de requ&#234;te, de g&#233;n&#233;ration de tableaux et de rapports, de mise &#224; jour habituels 
pour des informations structur&#233;es, aboutissant &#224; une sorte de &#171; tableur litt&#233;raire &#187;. 
</p>
<p>Nous d&#233;montrerons sur une base de plus de 50 000 &#233;nonc&#233;s  qu&#8217;une utilisation &#171; brutale &#187; du langage 
naturel comme format de repr&#233;sentation apportait un &#171; retour sur investissement &#187; tr&#232;s significatif &#224; 
l&#8217;utilisateur.  
</p>
<p>Une seconde approche introduisant plus de composants linguistiques a &#233;t&#233; exp&#233;riment&#233;e et sera d&#233;montr&#233;e : 
elle consiste &#224; enrichir chaque &#233;nonc&#233; d&#8217;une analyse syntaxique et s&#233;mantique avec des analyseurs comme 
XIP de Xerox XRCE, ou ceux utilis&#233;s dans le projet ANR PASSAGES. On obtient des interlogos plus 
riches, qui permettent des navigations de phrase en phrase plus sophistiqu&#233;es, reposant sur la s&#233;lection des 
r&#244;les syntaxiques ou s&#233;mantiques des interlogos. 
</p>
<p>Enfin, l&#8217;outil pr&#233;sent&#233; peut aussi &#234;tre vu comme un outil de g&#233;nie linguistique, en particulier en linguistique 
des corpus, pour explorer un ensemble de phrases et/ou de documents, et y d&#233;couvrir, par &#233;mergence,  des 
r&#233;gularit&#233;s ou des diff&#233;rences.  
</p>
<p>Notre objectif &#224; court terme est de d&#233;velopper un produit industriel, dans un cadre appropri&#233;. </p>

</div></div>
</body></html>