<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Proxem Ubiq : une solution d&#8217;e-re&#769;putation par analyse de feedbacks clients</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011 
</p>
<p>Proxem Ubiq : une solution d&#8217;e-r&#233;putation par analyse de feedbacks clients 
</p>
<p>Fran&#231;ois-R&#233;gis Chaumartin 
Proxem, 19 bd de Magenta, 75010 Paris 
</p>
<p>frc@proxem.com 
</p>
<p>Mots-cl&#233;s : e-r&#233;putation, reconnaissance d&#8217;entit&#233;s nomm&#233;es, classification, clustering, analyse syntaxique, apprentissage 
</p>
<p>&#202;tre &#224; l&#8217;&#233;coute de ses clients est un enjeu majeur pour toute grande marque. Les verbatims d&#8217;expression spontan&#233;e des 
consommateurs se trouvent le plus souvent sur des sources externes (blogs, forums, news, RSS, tweets&#8230;) et internes 
(mails envoy&#233;s spontan&#233;ment, r&#233;ponses aux questions ouvertes de sondages). Ubiq permet aux entreprises de calculer leur 
e-r&#233;putation en analysant ces diff&#233;rents feedbacks. Ubiq identifie les attentes des consommateurs, d&#233;tecte les tendances, 
analyse les opinions et permet d&#8217;anticiper des probl&#232;mes. En un coup d'&#339;il, on visualise les &#171; sujets chauds &#187; du moment. 
</p>
<p>La plateforme de TAL Antelope est au c&#339;ur d'Ubiq. L&#8217;analyse s&#233;mantique effectu&#233;e encha&#238;ne plusieurs op&#233;rations.  
</p>
<p>(1) La qualit&#233; des documents trait&#233;s &#233;tant tr&#232;s variable, une correction orthographique est souvent n&#233;cessaire ; n&#233;anmoins, 
cette op&#233;ration doit &#234;tre effectu&#233;e avec une connaissance du contexte m&#233;tier ; par exemple, les noms de marques qui 
viennent d&#8217;appara&#238;tre (et ne figurent pas encore dans un lexique) ne doivent pas &#234;tre &#171; corrig&#233;s &#187; vers un mot proche.  
</p>
<p>(2) La reconnaissance d&#8217;entit&#233;s nomm&#233;es vise classiquement &#224; identifier des personnes, lieux et organisation. Dans un 
contexte d&#8217;enseigne de grande distribution, les entit&#233;s int&#233;ressantes &#224; d&#233;tecter sont plut&#244;t les produits, marques et 
concurrents cit&#233;s, ainsi que des concepts li&#233;s au m&#233;tier (le risque sanitaire ou le risque juridique, par exemple). Nous 
avons d&#233;velopp&#233; une nouvelle approche d&#8217;acquisition &#224; large &#233;chelle d&#8217;entit&#233;s nomm&#233;es. (2a) Une premi&#232;re phase 
d&#8217;extraction terminologique permet d&#8217;amorcer la liste des concepts du domaine. (2b) Une seconde phase utilise deux 
ressources de large couverture (la Wikip&#233;dia et un WordNet pour le fran&#231;ais) pour cr&#233;er des gazettes ; en cas d&#8217;ambigu&#239;t&#233; 
possible (orange fruit ou Orange marque), les termes des gazettes sont automatiquement associ&#233;s &#224; des mots cl&#233;s 
activateurs ou inhibiteurs (pour les deux sens d&#8217;orange : jus, fruit, pulpe&#8230; ou internet, contrat, carte sim, op&#233;rateur&#8230;). 
(2c) L&#8217;application de ces gazettes permet de constituer un premier corpus annot&#233; selon les entit&#233;s nomm&#233;es du domaine. 
Un apprentissage (par CRF) est alors effectu&#233; sur le corpus, pour identifier de nouvelles instances d&#8217;entit&#233;s. (2d) Chaque 
document fait aussi l&#8217;objet d&#8217;une classification multi-motifs (dont une analyse d&#8217;opinion pour en d&#233;terminer la valence). 
</p>
<p>(3) L&#8217;ensemble des documents est partitionn&#233; en sous-ensemble homog&#232;nes, pour d&#233;terminer les tendances du moment ; 
l&#8217;utilisation de techniques de clustering spectral permet de traiter en quelques minutes plusieurs milliers de documents. 
</p>
<p> 
</p>
<p>Figure 1 : Une capture d&#8217;&#233;cran d&#8217;Ubiq, montrant d&#8217;une fa&#231;on synth&#233;tique ce qui s&#8217;est pass&#233; pendant deux semaines dans 
une enseigne de la grande distribution. La partie centrale est le &#171; r&#233;sum&#233; s&#233;mantique &#187; de plus de 10 000 feedbacks. </p>

</div></div>
</body></html>