<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Qui &#234;tes-vous ? Cat&#233;goriser les questions pour d&#233;terminer le r&#244;le des locuteurs dans des conversations orales</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Qui &#234;tes-vous ? Cat&#233;goriser les questions pour d&#233;terminer le r&#244;le des
locuteurs dans des conversations orales &#8727;
</p>
<p>Thierry Bazillon1, Benjamin Maza2, Mickael Rouvier2, Frederic Bechet1, Alexis Nasr1
(1) Aix Marseille Universit&#233;, LIF-CNRS, Marseille, France
</p>
<p>(2) Universit&#233; d&#8217;Avignon, LIA-CERI, Avignon, France
</p>
<p>R&#233;sum&#233;. La fouille de donn&#233;es orales est un domaine de recherche visant &#224; caract&#233;riser un flux audio
contenant de la parole d&#8217;un ou plusieurs locuteurs, &#224; l&#8217;aide de descripteurs li&#233;s &#224; la forme et au contenu du signal.
Outre la transcription automatique en mots des paroles prononc&#233;es, des informations sur le type de flux audio trait&#233;
ainsi que sur le r&#244;le et l&#8217;identit&#233; des locuteurs sont &#233;galement cruciales pour permettre des requ&#234;tes complexes
telles que : &#171; chercher des d&#233;bats sur le th&#232;me X &#187;, &#171; trouver toutes les interviews de Y &#187;, etc. Dans ce cadre, et en
traitant des conversations enregistr&#233;es lors d&#8217;&#233;missions de radio ou de t&#233;l&#233;vision, nous &#233;tudions la mani&#232;re dont
les locuteurs expriment des questions dans les conversations, en partant de l&#8217;intuition initiale que la forme des
questions pos&#233;es est une signature du r&#244;le du locuteur dans la conversation (pr&#233;sentateur, invit&#233;, auditeur, etc.). En
proposant une classification du type des questions et en utilisant ces informations en compl&#233;ment des descripteurs
g&#233;n&#233;ralement utilis&#233;s dans la litt&#233;rature pour classer les locuteurs par r&#244;le, nous esp&#233;rons am&#233;liorer l&#8217;&#233;tape de
classification, et valider par la m&#234;me occasion notre intuition initiale.
</p>
<p>Abstract. Speech Data Mining is an area of research dedicated to characterize audio streams containing
speech of one or more speakers, using descriptors related to the form and the content of the speech signal. Besides
the automatic word transcription process, information about the type of audio stream and the role and identity of
speakers is also crucial to allow complex queries such as : &#8220; seek debates on X ,&#8221;&#8220; find all the interviews of Y&#8221;,
etc. In this framework we present a study done on broadcast conversations on how speakers express questions
in conversations, starting with the initial intuition that the form of the questions uttered is a signature of the role
of the speakers in the conversation (anchor, guest, expert, etc.). By classifying these questions thanks to a set of
labels and using this information in addition to the commonly used descriptors to classify users&#8217; role in broadcast
conversations, we want to improve the role classification accuracy and validate our initial intuition.
</p>
<p>Mots-cl&#233;s : Fouille de donn&#233;es orales, Traitement Automatique de la Parole, Annotation de corpus oraux,
Classification en r&#244;les de locuteurs.
</p>
<p>Keywords: Speech data mining, Automatic Speech Processing, Speech Corpus Annotation, Speaker role
classification.
</p>
<p>&#8727;. Ce travail a &#233;t&#233; effectu&#233; dans le cadre du projet ANR DECODA (2009 CORD 005 01) http://decoda.univ-avignon.fr</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAZILLON ET AL.
</p>
<p>1 Introduction
</p>
<p>La fouille de donn&#233;es orales est un domaine de recherche visant &#224; caract&#233;riser un flux audio contenant de la
parole d&#8217;un ou plusieurs locuteurs &#224; l&#8217;aide de descripteurs li&#233;s &#224; la forme et au contenu du signal. Parmi ces
descripteurs, le plus important est bien &#233;videmment la transcription automatique en mots des paroles prononc&#233;es.
Dans le cas de la parole multi-locuteurs, telle qu&#8217;on peut en trouver dans les &#233;missions de radio ou de t&#233;l&#233;vision,
ces descripteurs peuvent aussi porter sur l&#8217;identit&#233; ou le r&#244;le du locuteur, mais aussi sur le type de conversations
enregistr&#233;es : d&#233;bat, interview, journal d&#8217;information, etc. Ces informations peuvent permettre de r&#233;pondre &#224; des
requ&#234;tes complexes telles que : &#8220;chercher des d&#233;bats sur le th&#232;me X&#8221;, &#8220;trouver toutes les interviews de Y&#8221;, mais
aussi d&#8217;aider le processus de transcription automatique en choisissant des mod&#232;les adapt&#233;s au type d&#8217;&#233;missions
consid&#233;r&#233;.
</p>
<p>L&#8217;&#233;tude pr&#233;sent&#233;e dans cet article a &#233;t&#233; r&#233;alis&#233;e sur le corpus EPAC contenant la transcription et l&#8217;annotation
d&#8217;une centaine d&#8217;heures de parole essentiellement spontan&#233;e 1. Il est notamment constitu&#233; d&#8217;&#233;missions ou de d&#233;-
bats radiophoniques tels que Le T&#233;l&#233;phone sonne, Quartiers d&#8217;&#201;t&#233;, Sous les &#233;toiles exactement, Culture vive ou
Les Matins de France Culture. Toutes ces &#233;missions ont &#233;t&#233; segment&#233;es en locuteurs et transcrites manuellement.
En compl&#233;ment de ces annotations, d&#8217;autres annotations sur les r&#244;les des locuteurs et les formes interrogatives
utilis&#233;es ont &#233;t&#233; ajout&#233;es sur une partie du corpus. Nous avons choisi de nous int&#233;resser sp&#233;cifiquement au do-
maine de l&#8217;interrogation car il nous semble que la structure m&#234;me des questions, &#224; l&#8217;int&#233;rieur d&#8217;un discours, est
repr&#233;sentative d&#8217;un certain type d&#8217;oral. Des travaux comme ceux de (Garcia-Fernandez &amp; Lailler, 2008), tendant
&#224; d&#233;finir une &quot;morphosyntaxe de l&#8217;interrogation&quot;, vont d&#233;j&#224; en ce sens. Pour notre part, nous essaierons de voir si
les questions peuvent &#234;tre associ&#233;es &#224; des classes de locuteurs sp&#233;cifiques, dans un contexte d&#8217;oral radiophonique
pr&#233;cis. Un arbre de cat&#233;gorisation des questions a donc &#233;t&#233; cr&#233;&#233; a priori, et une vingtaine d&#8217;heures de donn&#233;es
issues de l&#8217;&#233;mission Le T&#233;l&#233;phone sonne ont &#233;t&#233; &#233;tiquet&#233;es selon cet arbre.
</p>
<p>Nous pr&#233;sentons dans la section 2 une &#233;tude descriptive des formes interrogatives et leur r&#233;partition en diff&#233;rents
types ou cat&#233;gories. Nous tentons en 3 d&#8217;&#233;tablir un lien entre les types de questions et les r&#244;les des locuteurs qui
les ont pos&#233;es. L&#8217;apport de la prise en compte du type des questions pos&#233;es pour la segmentation automatique en
r&#244;les de locuteurs est pr&#233;sent&#233;e dans la section 4. Enfin la d&#233;tection et la classification automatique des questions
et leur int&#233;gration dans le classifieur en r&#244;le de locuteurs est pr&#233;sent&#233;e dans la section 5.
</p>
<p>2 Un corpus &#233;tiquet&#233; en questions
</p>
<p>&#192; l&#8217;int&#233;rieur du corpus EPAC, l&#8217;&#233;mission Le T&#233;l&#233;phone sonne repr&#233;sente pr&#232;s de 20 heures de donn&#233;es, r&#233;parties
en 32 &#233;missions. Dans chacune d&#8217;entre elles, chaque question a &#233;t&#233; annot&#233;e manuellement gr&#226;ce &#224; un syst&#232;me de
balises sp&#233;cifiques. Les questions ont &#233;t&#233; cat&#233;goris&#233;es selon diff&#233;rentes cat&#233;gories et sous-cat&#233;gories linguistiques.
Tout d&#8217;abord, une distinction de premier niveau a &#233;t&#233; &#233;tablie entre les questions directes (comment vas-tu ? )
et les questions indirectes (je voudrais savoir comment tu vas ?). Ensuite, &#224; l&#8217;int&#233;rieur de ces deux ensembles,
trois sous-cat&#233;gories ont &#233;t&#233; isol&#233;es : les interrogations totales, les interrogations partielles et les interrogations
alternatives (vous voulez une r&#233;ponse pr&#233;cise ou pas ?). Enfin, un troisi&#232;me et dernier niveau d&#8217;analyse concernant
les marqueurs interrogatifs a &#233;t&#233; pris en compte. Ces marqueurs peuvent &#234;tre :
</p>
<p>&#8211; des pronoms interrogatifs (qui, que)
&#8211; des adverbes interrogatifs (quand, comment, pourquoi)
&#8211; des d&#233;terminants interrogatifs (quel, quelle)
&#8211; des structures complexes (qu&#8217;est-ce que, qu&#8217;est-ce qui, &#224; qui, depuis quand...)
&#8211; la forme est-ce que
&#8211; l&#8217;adverbe si (je voudrais savoir si vos intervenants sont d&#8217;accord ?)
&#8211; l&#8217;inversion du sujet
&#8211; l&#8217;intonation seule (tu viens ?)
</p>
<p>La nomenclature ci-dessus est certes un peu diff&#233;rente de celle propos&#233;e notamment par (Stolcke et al., 2000),
mais les principales distinctions y sont pr&#233;serv&#233;es. Ainsi, notre crit&#232;re &#171; intonation seule &#187; correspond aux ques-
tions &#171; d&#233;claratives &#187; de Stolcke, et ce qu&#8217;il nomme les wh- questions est ici transpos&#233; en pronoms, adverbes
</p>
<p>1. nous renvoyons le lecteur &#224; (Est&#232;ve et al., 2010) pour une description d&#233;taill&#233;e des t&#226;ches de transcription et d&#8217;annotation du corpus
EPAC</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAT&#201;GORISER LES QUESTIONS POUR D&#201;TERMINER LE R&#212;LE DES LOCUTEURS
</p>
<p>et d&#233;terminants interrogatifs. Enfin, les questions avec la locution est-ce que ou l&#8217;inversion sujet-verbe (soit les
interrogations dites &#171; totales &#187;) correspondent aux &#171; yes-no-question &#187; de la terminologie de Stolcke.
</p>
<p>Type de questions Nombre d&#8217;occurrences Fr&#233;quence (%)
est-ce que 214 13,76
</p>
<p>totale intonation 178 11,45
inversion 154 9,9
intonation 404 25,98
adverbe 198 12,73
</p>
<p>directe partielle complexe 117 7,52
pronom 88 5,66
d&#233;terminant 76 4,89
inversion 10 0,64
</p>
<p>alternative intonation 5 0,32
est-ce que 1 0,06
</p>
<p>totale si 46 2,96
adverbe 26 1,67
complexe 17 1,09
</p>
<p>indirecte partielle d&#233;terminant 17 1,09
groupe nominal 3 0,19
pronom 1 0,06
</p>
<p>TABLE 1 &#8211; R&#233;partition des questions par type
</p>
<p>Sur les 48 cat&#233;gories possibles, 17 sont attest&#233;es dans le corpus du T&#233;l&#233;phone sonne. La table 1 pr&#233;sente ces 17
cat&#233;gories avec leur fr&#233;quence absolue et relative. Cette table met en relief plusieurs &#233;l&#233;ments : en premier lieu,
les questions directes sont beaucoup plus nombreuses que les questions indirectes. Cet &#233;cart s&#8217;explique par le fait
que Le T&#233;l&#233;phone sonne est avant tout un d&#233;bat, donc avec des propos essentiellement spontan&#233;s. En cons&#233;quence,
les locuteurs posent la plupart de leurs questions de la fa&#231;on la plus directe qui soit, c&#8217;est-&#224;-dire avec un nombre
r&#233;duit de mots. En cons&#233;quence, ils ont tr&#232;s peu recours aux structures telles que je voudrais savoir si... ou je me
demandais si.... &#192; la place de je voudrais savoir si vos invit&#233;s sont d&#8217;accord avec &#231;a, on trouvera ainsi beaucoup
plus souvent la forme oralis&#233;e vos invit&#233;s sont d&#8217;accord avec &#231;a ?.
</p>
<p>Ce dernier exemple nous am&#232;ne &#224; une autre observation, qui peut &#234;tre faite &#224; la lecture de la table 1 : les questions
avec l&#8217;intonation pour seul marqueur interrogatif sont les plus repr&#233;sent&#233;es (plus de 37% en cumulant interroga-
tions totales et partielles). L&#8217;explication est directement li&#233;e &#224; ce que nous &#233;crivions plus haut au sujet du type
de parole utilis&#233; dans Le T&#233;l&#233;phone sonne. En effet, la parole spontan&#233;e est souvent synonyme de structures in-
terrogatives r&#233;duites, notamment dans les d&#233;bats. Pour &#234;tre plus en phase avec des situations discursives souvent
mouvement&#233;es (parole simultan&#233;e, locuteurs qui se coupent la parole, temps d&#8217;antenne r&#233;duit), les locuteurs se
doivent d&#8217;&#234;tre les plus concis possibles. En cons&#233;quence, en plus d&#8217;utiliser essentiellement des structures inter-
rogatives directes, ils font aussi abstraction des marqueurs interrogatifs traditionnels (Est-ce que vous y croyez ?
deviendra vous y croyez ?, par exemple). Il en va de m&#234;me pour les constructions syntaxiques avec inversion du
sujet (voulez-vous poser une autre question ?), qui sont assez peu nombreuses dans notre relev&#233;. Bien qu&#8217;elles ne
rallongent pas &#224; proprement parler la longueur d&#8217;une question (aucun mot suppl&#233;mentaire n&#8217;est n&#233;cessaire pour
passer de vous avez une autre question ? &#224; avez-vous une autre question ?), elles ne correspondent pas au mod&#232;le
canonique fran&#231;ais sujet + verbe + compl&#233;ment.
</p>
<p>3 Un corpus &#233;tiquet&#233; en r&#244;les
</p>
<p>Le r&#244;le d&#8217;un locuteur correspond &#224; son statut et &#224; sa fonction dans une &#233;mission donn&#233;e : pr&#233;sentateur principal,
invit&#233;, consultant, journaliste hors studio, etc. Identifier le r&#244;le de chaque locuteur est une &#233;tape indispensable &#224;
la compr&#233;hension d&#8217;une &#233;mission. Le format de chaque &#233;mission d&#233;finit le nombre et les r&#244;les de chaque inter-
venant. Pour cette &#233;tude, nous avons privil&#233;gi&#233; une segmentation en r&#244;les relativement g&#233;n&#233;rique. Par exemple,
les &#233;ventuels changements de r&#244;le d&#8217;un locuteur &#224; l&#8217;int&#233;rieur d&#8217;une m&#234;me &#233;mission n&#8217;ont pas &#233;t&#233; pris en compte.
Cette distinction, pertinente dans le cadre d&#8217;un d&#233;coupage en actes de dialogue, ne nous a pas sembl&#233; n&#233;cessaire
ici. Ainsi, dans l&#8217;&#233;mission Le T&#233;l&#233;phone sonne, nous avons donc identifi&#233; 4 r&#244;les de locuteurs :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAZILLON ET AL.
</p>
<p>1. le pr&#233;sentateur : c&#8217;est l&#8217;animateur de l&#8217;&#233;mission, il a comme r&#244;le de distribuer la parole aux diff&#233;rents
intervenants en animant le d&#233;bat ;
</p>
<p>2. les experts : ce sont les invit&#233;s, sur le plateau ou par t&#233;l&#233;phone, ils ont pour r&#244;le &#224; la fois de r&#233;pondre aux
questions des auditeurs mais aussi de d&#233;battre entre eux sur le sujet du jour ;
</p>
<p>3. les auditeurs : toujours au t&#233;l&#233;phone, ils sont s&#233;lectionn&#233;s avant l&#8217;&#233;mission et sont appel&#233;s pour qu&#8217;ils
puissent poser leur questions, sans pour autant participer au d&#233;bat ;
</p>
<p>4. le rapporteur : il a pour r&#244;le de lire les questions &#233;crites des auditeurs ; ce r&#244;le est g&#233;n&#233;ralement assum&#233; par
le pr&#233;sentateur.
</p>
<p>Nous pr&#233;sentons dans les lignes suivantes une analyse du type des questions exprim&#233;es par les diff&#233;rents r&#244;les de
locuteurs. C&#8217;est cette &#233;tude qui nous a conduit &#224; utiliser les questions comme indices ou marqueurs du r&#244;le des
locuteurs, comme nous le verrons dans la partie exp&#233;rimentale de cet article.
</p>
<p>3.1 Les questions comme marqueurs des r&#244;les des locuteurs
</p>
<p>La table 2 pr&#233;sente les premiers r&#233;sultats de l&#8217;annotation des r&#244;les des locuteurs, coupl&#233;e avec celle des questions.
Il appara&#238;t ainsi que c&#8217;est le pr&#233;sentateur qui pose plus de la moiti&#233; des questions lors d&#8217;une &#233;mission comme Le
T&#233;l&#233;phone sonne. Cette pr&#233;dominance tient essentiellement &#224; sa fonction de m&#233;diateur que nous avons &#233;voqu&#233;e
pr&#233;c&#233;demment, et que nous expliciterons plus pr&#233;cis&#233;ment avec d&#8217;autres chiffres dans le paragraphe suivant.
</p>
<p>R&#244;le Nombre de questions Fr&#233;quence (%)
Pr&#233;sentateur 791 50,87
Expert 323 20,77
Auditeur 307 19,74
Rapporteur 134 8,62
TOTAL 1555 100
</p>
<p>TABLE 2 &#8211; R&#233;partition du nombre de questions en fonction du r&#244;le des locuteurs
</p>
<p>Il est &#233;galement int&#233;ressant de constater que les auditeurs, pourtant suppos&#233;s &#234;tre au c&#339;ur du programme, posent
en moyenne moins de questions que les experts pr&#233;sents en studio lors de chaque &#233;mission. Toutefois, ces chiffres
doivent &#234;tre nuanc&#233;s par quelques pr&#233;cisions. Tout d&#8217;abord, les questions de la cat&#233;gorie rapporteur peuvent &#234;tre
associ&#233;es &#224; celles des auditeurs, dans la mesure o&#249; ce sont eux qui les r&#233;digent puis les envoient au standard de
l&#8217;&#233;mission. Elles sont certes lues par le pr&#233;sentateur, mais il n&#8217;en est jamais l&#8217;auteur. Ainsi, on peut consid&#233;rer que
pr&#232;s de 30% des questions de notre corpus sont, directement ou non, pos&#233;es par des auditeurs.
</p>
<p>Ensuite, beaucoup de questions de la cat&#233;gorie expert sont des interrogations n&#8217;attendant pas v&#233;ritablement de
r&#233;ponses. Sans &#234;tre rh&#233;toriques (au sens linguistique du terme), elles permettent plut&#244;t au locuteur d&#8217;&#233;tayer sa
r&#233;ponse en s&#8217;appuyant plus ou moins explicitement sur la question qui lui a &#233;t&#233; pos&#233;e :
</p>
<p>Quand tout cela va cesser ? &#199;a madame je n&#8217;en sais rien, mais ce qui s&#251;r...
Alors est-ce qu&#8217;il doit d&#233;missionner ? Oui, bien s&#251;r, puisque la situation actuelle du pays...
</p>
<p>Enfin, et c&#8217;est souvent le cas dans les &#233;missions dites de d&#233;bat, le temps de parole allou&#233; &#224; chaque participant
est loin d&#8217;&#234;tre &#233;quitablement r&#233;parti. Les auditeurs, n&#8217;&#233;tant pas pr&#233;sents physiquement sur le plateau, sont les
premiers &#224; &#234;tre coup&#233;s, interrompus ou parfois m&#234;me exclus du d&#233;bat faute de temps. Ils ne posent d&#8217;ailleurs
qu&#8217;une seule voire deux questions, jamais plus. &#192; l&#8217;inverse, les experts b&#233;n&#233;ficient d&#8217;une libert&#233; d&#8217;expression tr&#232;s
large. Celle-ci leur permet certes de r&#233;pondre aux auditeurs, mais aussi d&#8217;&#233;tayer le d&#233;bat en se posant mutuellement
de nombreuses questions :
</p>
<p>Monsieur XX, vous pensez vraiment que &#231;a va changer les choses ?
Comment pouvez-vous en &#234;tre s&#251;rs, madame YY ?
</p>
<p>Afin d&#8217;envisager une analyse plus fine, la table 3 indique, pour chaque type de questions recens&#233;es dans notre
corpus, leur r&#233;partition selon le r&#244;le des locuteurs. Ces r&#233;sultats sont notamment l&#8217;occasion de revenir sur la
pr&#233;pond&#233;rance du r&#244;le du pr&#233;sentateur, que nous &#233;voquions pr&#233;c&#233;demment. Comme on le voit, celle-ci est majo-
ritairement due aux questions ayant l&#8217;intonation pour seul marqueur interrogatif. En effet, en tant que responsable</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAT&#201;GORISER LES QUESTIONS POUR D&#201;TERMINER LE R&#212;LE DES LOCUTEURS
</p>
<p>des d&#233;bats qu&#8217;il instaure, le pr&#233;sentateur du T&#233;l&#233;phone sonne est celui qui distribue la parole &#224; ses invit&#233;s et &#224;
ses auditeurs. Pour ce faire, il recourt abondamment &#224; des questions elliptiques tant&#244;t partielles (sur la guerre en
Irak, votre sentiment ?), tant&#244;t totales (vous &#234;tes d&#8217;accord avec &#231;a, monsieur Gorce ?). Ces deux cat&#233;gories r&#233;unies
repr&#233;sentent ainsi pr&#232;s de 70% des questions assimil&#233;es au r&#244;le de pr&#233;sentateur. Les 30% restants concernent prin-
cipalement des questions qui sont pos&#233;es au d&#233;but de chaque &#233;mission, lors d&#8217;un monologue servant &#224; introduire
le sujet du jour. Manifestement &#233;crites, elles sont toujours tr&#232;s structur&#233;es sur le plan grammatical, que ce soit avec
la locution est-ce que, l&#8217;inversion du sujet ou des pronoms ou adverbes interrogatifs.
</p>
<p>Type question Pr&#233;sentateurs (%) Experts (%) Auditeurs (%) Rapporteurs (%)
est-ce que (214) 28,5 34,58 33,64 3,27
</p>
<p>totale intonation (178) 80,9 16,3 2,81 0
inversion (154) 33,12 7,14 21,43 38,31
intonation (404) 98,51 1,24 0,25 0
adverbe (198) 18,69 43,94 21,72 15,66
</p>
<p>directe partielle complexe (117) 21,37 48,72 19,66 10,26
pronom (88) 34,1 35,23 19,32 11,36
d&#233;terminant (76) 44,74 19,74 19,74 15,79
inversion (10) 20 70 0 10
</p>
<p>alternative intonation (5) 80 20 0 0
est-ce que (1) 100 0 0 0
</p>
<p>global (1445) 54,46 21,94 14,46 9,13
totale si (46) 4,35 2,18 93,48 0
</p>
<p>adverbe (26) 0 3,85 88,46 7,69
complexe (17) 5,88 11,76 82,35 0
</p>
<p>indirecte partielle d&#233;terminant (17) 0 11,76 88,24 0
groupe nominal (3) 0 0 100 0
pronom (1) 100 0 0 0
</p>
<p>global (110) 3,64 5,45 89,1 1,82
</p>
<p>TABLE 3 &#8211; R&#233;partition du type de questions en fonction du r&#244;le des locuteurs
</p>
<p>Les experts, outre le fait d&#8217;occuper la deuxi&#232;me place au niveau du nombre global de questions pos&#233;es (table 2), uti-
lisent &#233;galement de nombreuses structures interrogatives diff&#233;rentes. S&#8217;il n&#8217;y a pas une cat&#233;gorie aussi dominante
que chez les pr&#233;sentateurs, on notera toutefois qu&#8217;ils utilisent beaucoup les questions directes &#224; base d&#8217;adverbes,
de pronoms, de est-ce que et de structures complexes (pronoms ou d&#233;terminants : qu&#8217;est-ce que, qu&#8217;est-ce qui,
duquel, lequel, etc.). Cela t&#233;moigne d&#8217;un certain soin quant &#224; la formulation et l&#8217;expression, puisque les questions
bas&#233;es sur l&#8217;intonation sont ici beaucoup moins employ&#233;es. Cela est d&#8217;autant plus remarquable que dans un cadre
&#233;nonciatif spontan&#233;, les structures les plus simples sont souvent les plus utilis&#233;es (vous pensez vraiment que... en
lieu et place de pensez-vous vraiment que... ou est-ce que vous pensez vraiment que...). Mais il ne faut pas oublier
que nous sommes ici dans le cadre d&#8217;une &#233;mission radiophonique &#233;cout&#233;e, jug&#233;e et aussi soumise &#224; des directives
&#233;ditoriales pr&#233;cises. Les personnes qui y participent n&#8217;apportent donc sans doute pas le m&#234;me soin &#224; leurs propos
dans la vie quotidienne, ni m&#234;me peut-&#234;tre lorsqu&#8217;elles s&#8217;expriment dans d&#8217;autres medias.
</p>
<p>C&#8217;est sans doute ce qui explique que le constat soit sensiblement identique du c&#244;t&#233; des auditeurs, o&#249; l&#8217;on constate
que les questions sans marqueur interrogatif grammatical sont moins fr&#233;quentes encore. &#192; l&#8217;inverse, la structure
est-ce que est fortement utilis&#233;e par les auditeurs, de m&#234;me que les constructions indirectes (quel que soit leur
marqueur interrogatif). Les incises telles que j&#8217;aimerais savoir, j&#8217;aurais voulu savoir ou je voulais savoir sont
en effet presque exclusivement employ&#233;es par les auditeurs, sans doute parce qu&#8217;elles permettent une sorte de
transition entre l&#8217;invitation &#224; la prise de parole du pr&#233;sentateur (Posez votre question, nous vous &#233;coutons) et la
question &#224; proprement parler, qu&#8217;il serait assez brutal de formuler au style direct. Ainsi, en r&#233;ponse aux deux
exemples ci-dessus, on trouvera beaucoup plus souvent des formes comme je voulais savoir si la droite avait une
chance plut&#244;t que est-ce que la droite a une chance ?. De leur c&#244;t&#233;, les questions commen&#231;ant par la locution
est-ce que sont souvent pr&#233;c&#233;d&#233;es d&#8217;un t&#233;moignage de l&#8217;auditeur, plus ou moins long, mais qui lui permet de
contextualiser sa demande (j&#8217;ai lu dans un journal que [...] Est-ce que vos experts sont d&#8217;accord avec &#231;a ?). De
fa&#231;on plus g&#233;n&#233;rale, et pour en revenir &#224; notre id&#233;e de d&#233;part, les questions pos&#233;es par les auditeurs sont elles aussi
particuli&#232;rement soign&#233;es sur le plan de la syntaxe, d&#8217;une part parce qu&#8217;elles sont pr&#233;s&#233;lectionn&#233;es par le standard
du T&#233;l&#233;phone sonne, et d&#8217;autre part parce que beaucoup de personnes les &#233;crivent avant de les lire &#224; l&#8217;antenne,
craignant de les oublier ou de mal les formuler sinon.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAZILLON ET AL.
</p>
<p>4 Segmentation automatique en r&#244;les de locuteurs
</p>
<p>La segmentation automatique en r&#244;les de locuteurs est une t&#226;che relativement nouvelle qui vient en compl&#233;ment
des t&#226;ches de segmentation en locuteurs effectu&#233;es en pr&#233;alable de tout processus de transcription automatique
de parole. En effet, la parole &#233;tant un flux, il convient de la segmenter en tours de parole correspondant &#224; chaque
locuteur de la conversation &#224; transcrire, puis en segments (correspondant g&#233;n&#233;ralement &#224; des groupes de souffle)
sur lesquels les processus de transcription automatique sont appliqu&#233;s. La segmentation en r&#244;le correspond &#224; une
t&#226;che d&#8217;&#233;tiquetage des tours de parole attribu&#233;s aux diff&#233;rents locuteurs en fonction d&#8217;une liste de r&#244;les possibles
dans le document sonore &#224; traiter.
</p>
<p>Une des premi&#232;re &#233;tudes sur le sujet a &#233;t&#233; publi&#233;e en 2000 (Barzilay et al., 2000) et de nombreuses &#233;tudes r&#233;centes
ont popularis&#233; cette t&#226;che dans la communaut&#233; du traitement automatique de la parole (Bigot et al., 2010; Hutchin-
son et al., 2010; Yaman et al., 2010; Damnati &amp; Charlet, 2011). Les approches diff&#232;rent de par le nombre de r&#244;les
consid&#233;r&#233;s (de 3 &#224; 6), le type d&#8217;&#233;missions (d&#233;bats, reportages, interviews, etc.) et le niveau de segmentation utilis&#233;
pour l&#8217;&#233;valuation : les segments, les tours de parole ou bien directement les locuteurs. Diff&#233;rents types de para-
m&#232;tres sont utilis&#233;s dans la phase de classification : param&#232;tres acoustiques et prosodiques (Bigot et al., 2010) ;
param&#232;tres lexicaux (Barzilay et al., 2000; Hutchinson et al., 2010) ou encore combinaison des deux (Damnati &amp;
Charlet, 2011).
</p>
<p>Les &#233;tudes se distinguent &#233;galement par le degr&#233; de supervision n&#233;cessaire &#224; la production des param&#232;tres utilis&#233;s
dans l&#8217;&#233;tape de classification : depuis une supervision compl&#232;te en utilisant les segmentations et transcriptions
manuelles des &#233;missions comme dans (Yaman et al., 2010) ; ou bien sans supervision aucune avec des processus
automatiques de segmentation et de transcription comme dans (Damnati &amp; Charlet, 2011).
</p>
<p>Par rapport aux &#233;tudes pr&#233;c&#233;dentes, nous nous proposons ici d&#8217;apporter un nouveau type de param&#232;tres afin de
caract&#233;riser les r&#244;les de locuteurs, bas&#233; sur la cat&#233;gorisation des questions pr&#233;sent&#233;e dans le paragraphe pr&#233;c&#233;dent.
Le but de cette &#233;tude est de valider l&#8217;int&#233;r&#234;t de ces param&#232;tres gr&#226;ce &#224; des exp&#233;riences contrastives que nous
allons effectuer sur le corpus EPAC pr&#233;c&#233;demment d&#233;crit. Les exp&#233;riences sont faites sur les segmentations et
les transcriptions manuelles du corpus EPAC afin de d&#233;montrer l&#8217;int&#233;r&#234;t de notre approche ind&#233;pendamment des
erreurs faites durant les &#233;tapes de transcription par un syst&#232;me automatique. N&#233;anmoins il nous restera dans
une prochaine &#233;tude &#224; valider ces r&#233;sultats en montrant qu&#8217;ils restent pertinents m&#234;me en pr&#233;sence d&#8217;erreurs de
segmentation et de transcription.
</p>
<p>4.1 Un classifieur pour la segmentation en r&#244;le
</p>
<p>Nous utilisons ici une m&#233;thode de classification supervis&#233;e bas&#233;e sur un algorithme de combinaison de classifieurs
simples (m&#233;thode de boosting dans la terminologie de l&#8217;apprentissage automatique). Ce type de classifieur dis-
criminant a donn&#233; des r&#233;sultats comparables aux approches bas&#233;es sur les machines &#224; vecteur de support (SVM)
sur un grand nombre de t&#226;ches de classification tout en apportant un certain nombre d&#8217;avantages : d&#8217;une part une
grande libert&#233; est donn&#233;e dans la d&#233;finition des classifieurs simples, ce qui permet de prendre en compte tr&#232;s faci-
lement des param&#232;tres h&#233;t&#233;rog&#232;nes tels que des symboles, des s&#233;quences de symboles ou bien encore des valeurs
num&#233;riques ; d&#8217;autre part il est possible de conna&#238;tre facilement quels classifieurs simples ont &#233;t&#233; choisis comme
&#233;tant les plus discriminants pour la classification durant la phase d&#8217;apprentissage, et quel est leur poids dans le
mod&#232;le final.
</p>
<p>Dans toutes nos exp&#233;riences l&#8217;impl&#233;mentation ICSIBOOST (Favre et al., 2007) de l&#8217;algorithme AdaBoost a &#233;t&#233;
choisie comme m&#233;thode d&#8217;apprentissage et de classification. Ce classifieur est appliqu&#233; &#224; chaque tour de parole
de notre corpus en utilisant la segmentation en locuteur de r&#233;f&#233;rence produite manuellement. Il calcule un score
pour chaque r&#244;le possible pour chaque segment. En choisissant l&#8217;hypoth&#232;se ayant re&#231;u le score maximum, nous
obtenons une classification en r&#244;le des diff&#233;rents tours de parole des locuteurs, chaque tour &#233;tant class&#233; ind&#233;pen-
damment des autres tours de parole du m&#234;me locuteur.
</p>
<p>Nous avons test&#233; 3 types de param&#232;tres pour cette phase de classification :
</p>
<p>&#8211; la dur&#233;e du tour de parole : ce param&#232;tre est relatif &#224; la structure de la conversation, il est pertinent car les
diff&#233;rents r&#244;les sont souvent caract&#233;ris&#233;s par des temps de parole tr&#232;s diff&#233;rents ;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAT&#201;GORISER LES QUESTIONS POUR D&#201;TERMINER LE R&#212;LE DES LOCUTEURS
</p>
<p>&#8211; les 2-gram de mots : les choix lexicaux sont bien &#233;videmment des param&#232;tres majeurs dans l&#8217;attribution des
r&#244;les aux locuteurs ; nous consid&#233;rons ici toutes les s&#233;quences de 2-gram de mots ;
</p>
<p>&#8211; les labels des questions pr&#233;sentes dans le tour de parole ; ces labels repr&#233;sentent &#224; la fois le nombre de questions
se trouvant dans le tour, mais aussi leurs caract&#233;ristiques (directe/indirecte, totale/partielle, type).
</p>
<p>Il est &#224; noter que nous n&#8217;utilisons pas ici d&#8217;optimisation globale de la segmentation en r&#244;les sur toute l&#8217;&#233;mission,
ni d&#8217;informations connues a priori sur la structure de cette &#233;mission. notre but est d&#8217;effectuer une exp&#233;rience
contrastive de classification en r&#244;le, sans pour autant chercher &#224; obtenir les meilleurs taux possibles de classifica-
tion sur ce corpus. En effet on peut grandement am&#233;liorer les r&#233;sultats en utilisant des connaissances a priori sur
le format de l&#8217;&#233;mission telles que : les auditeurs sont toujours au t&#233;l&#233;phone ; le pr&#233;sentateur est toujours celui qui
parle en premier ; apr&#232;s un auditeur il y a toujours une reprise de la parole du pr&#233;sentateur ; etc. Ces informations
relatives &#224; la structure connue de l&#8217;&#233;mission Le T&#233;l&#233;phone Sonne sont ignor&#233;es dans nos exp&#233;riences.
</p>
<p>4.2 Protocole exp&#233;rimental et premiers r&#233;sultats
</p>
<p>Etant donn&#233; le nombre limit&#233; d&#8217;&#233;missions Le T&#233;l&#233;phone Sonne dans le corpus EPAC, nous avons utilis&#233; un pro-
tocole exp&#233;rimental bas&#233; sur la validation crois&#233;e par la m&#233;thode du Leave-One-Out. Ce protocole consiste, sur
un jeu C de n exemples &#224; classer, &#224; retirer un exemple e du jeu d&#8217;exemples, &#224; apprendre un classifieur B sur
l&#8217;ensemble C &#8722; {e}, puis &#224; tester B sur l&#8217;exemple e pour obtenir l&#8217;hypoth&#232;se e&#8242; que l&#8217;on ajoute &#224; l&#8217;ensemble C &#8242;,
initalement vide. &#192; l&#8217;issue de n it&#233;rations de cet algorithme, l&#8217;ensemble C &#8242; contient tous les exemples de C avec
les hypoth&#232;ses pr&#233;dites par les n classifieurs. En comparant les hypoth&#232;ses pr&#233;dites dans C &#8242; aux hypoth&#232;ses de
r&#233;f&#233;rence de C nous obtenons une estimation de la qualit&#233; du processus de classification sur l&#8217;ensemble du corpus,
sans le probl&#232;me du biais de la s&#233;lection de corpus s&#233;par&#233;s pour l&#8217;apprentissage et le test.
</p>
<p>Nous avons adapt&#233; le principe du Leave-One-Out &#224; notre corpus d&#8217;&#233;missions de la mani&#232;re suivante :
</p>
<p>&#8211; le corpus C contient 32 enregistrements de l&#8217;&#233;mission Le T&#233;l&#233;phone Sonne : C = {e1, e2, . . . , e32} ;
&#8211; &#224; chaque it&#233;ration i on s&#233;lectionne l&#8217;&#233;mission ei comme &#233;tant le corpus de test Ti, l&#8217;&#233;mission ei+1 comme
</p>
<p>&#233;tant le corpus de d&#233;veloppement Di et les 30 &#233;missions restantes Ai = C &#8722; {ei, ei+1} constituent le corpus
d&#8217;apprentissage Ai ;
</p>
<p>&#8211; un classifieur Bi est entra&#238;n&#233; sur les tours de parole du corpus Ai ; le nombre d&#8217;it&#233;rations de l&#8217;algorithme de
boosting est choisi sur Di et enfin les tours de parole du corpus Ti sont &#233;tiquet&#233;s automatiquement par Bi et
rang&#233;s dans T &#8242;i ;
</p>
<p>&#8211; &#224; l&#8217;issue des 32 it&#233;rations, le corpus C &#8242; =
&#8899;32
</p>
<p>i=1 T
&#8242;
i contient toutes les hypoth&#232;ses de classification en r&#244;les des
</p>
<p>tours de parole du corpus C.
</p>
<p>En comparant les annotations manuelles de C et celles automatiques de C &#8242;, nous pouvons &#233;valuer la qualit&#233; de nos
pr&#233;dictions selon plusieurs m&#233;triques soit au niveau des tours de parole, soit au niveau des locuteurs. &#201;tant donn&#233;
que la r&#233;partition en r&#244;les n&#8217;est pas uniforme (le nombre de tours de parole du pr&#233;sentateur est bien sup&#233;rieur
&#224; celui des auditeurs ; inversement il y a bien plus d&#8217;auditeurs diff&#233;rents que de pr&#233;sentateurs), les m&#233;triques
utilis&#233;es sont la pr&#233;cision, le rappel, la F-mesure 2 pour chaque type de r&#244;les en compl&#233;ment de l&#8217;erreur totale de
classification.
</p>
<p>Notre premi&#232;re s&#233;rie d&#8217;exp&#233;riences vise &#224; conforter notre hypoth&#232;se initiale concernant la pertinence de la clas-
</p>
<p>2. La pr&#233;cision, le rappel et la F-mesure sont calcul&#233;es de la mani&#232;re suivante :
&#8211; Soit un &#233;chantillon e &#8712; C correspondant &#224; un tour de parole (ou &#224; un locuteur selon le niveau d&#8217;&#233;valuation choisi) avec r = ref(e)
</p>
<p>l&#8217;&#233;tiquette en r&#244;le de r&#233;f&#233;rence contenue dans C et r&#8242; = hyp(e) l&#8217;&#233;tiquette hypoth&#232;se pr&#233;dites par les classifieurs B et contenue dans
C&#8242;. Nous avons r, r&#8242; &#8712; {pr&#233;sentateur,auditeur,expert,rapporteur}.
</p>
<p>&#8211; Si r = r&#8242; alors correct(r)=correct(r)+1
&#8211; Si r 6= r&#8242; alors :
</p>
<p>&#8211; erreur_totale=erreur_totale+1
&#8211; suppression(r)=suppression(r)+1
&#8211; insertion(r&#8217;)=insertion(r&#8217;)+1
</p>
<p>&#8211; La mesure de pr&#233;cision pour l&#8217;&#233;tiquette r est : P (r) = (correct(r)&#215; 100)&#247; (correct(r)+insertion(r))
&#8211; La mesure de rappel pour l&#8217;&#233;tiquette r est : R(r) = (correct(r)&#215; 100)&#247; (correct(r)+suppression(r))
&#8211; La F-mesure pour l&#8217;&#233;tiquette r est : F (r) = (P &#215;R&#215; 2)&#247; (P +R)
&#8211; La mesure d&#8217;erreur totale est d&#233;finie par : E = erreur_totale&#247; |C|</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAZILLON ET AL.
</p>
<p>sification des questions pour caract&#233;riser les r&#244;les des locuteurs. Pour cela nous avons effectu&#233; une exp&#233;rience
contrastive consistant &#224; ajouter dans la liste des classifieurs simples utilis&#233;s par l&#8217;algorithme d&#8217;apprentissage, des
param&#232;tres li&#233;s &#224; la pr&#233;sence ou non de questions dans les tours des locuteurs, puis des param&#232;tres sur la forme et
le type des questions pos&#233;es. Nous obtenons 5 exp&#233;riences contrastives d&#233;finies de la mani&#232;re suivante :
</p>
<p>1. dur&#233;e+2-grams : les seuls classifieurs utilis&#233;s ici sont l&#8217;absence ou la pr&#233;sence de bigrammes de mots dans
les transcriptions des tours de parole ainsi qu&#8217;un classifieur sur la dur&#233;e des tours de parole.
</p>
<p>2. dur&#233;e+2-grams+question : on ajoute aux classifieurs pr&#233;c&#233;dents un classifieur sur la pr&#233;sence ou l&#8217;absence
de questions dans un tour de parole.
</p>
<p>3. dur&#233;e+2-grams+question+directe/indirecte : le label directe/indirecte est ajout&#233; aux &#233;tiquettes question.
</p>
<p>4. dur&#233;e+2-grams+question+directe/indirecte+totale/partielle : m&#234;me chose mais avec l&#8217;indication de port&#233;e
de la question.
</p>
<p>5. dur&#233;e+2-grams+question+directe/indirecte+totale/partielle+type : on consid&#232;re maintenant tous les types
de questions, tels qu&#8217;ils sont d&#233;finis dans le tableau 1.
</p>
<p>param&#232;tres nb tests dur&#233;e+2-grams (1) +question (2) +directe/indir. (3) +totale/part. (4) +type (5)
F(auditeur) 500 66,4 67,0 66,9 65,4 67,1
F(expert) 1443 73,7 74,6 74,0 73,9 74,2
F(pr&#233;sentateur) 1860 81,2 81,5 81,3 81,5 81,9
F(rapporteur) 163 37,2 42,2 41,9 36,4 57,3
Erreur totale (E) 3966 24,7% 23,9% 24,2% 24,5% 23,5%
</p>
<p>TABLE 4 &#8211; R&#233;sultats sur l&#8217;&#233;tiquetage de chaque tour de parole (annotation manuelle des questions et types de
questions)
</p>
<p>param&#232;tres nb tests dur&#233;e+2-grams (1) +question (2) +directe/indir. (3) +totale/part. (4) +type (5)
F(auditeur) 220 88,2 89,6 89,2 89,7 90,4
F(expert) 118 83,9 83,0 82,4 81,2 84,4
F(pr&#233;sentateur) 35 66,7 67,4 67,3 64,7 68,8
F(rapporteur) 27 45,7 45,7 36,4 36,4 74,4
Erreur totale (E) 400 17,8% 17,3% 18,0% 18,5% 15,0%
</p>
<p>TABLE 5 &#8211; R&#233;sultats sur l&#8217;&#233;tiquetage de chaque locuteur (annotation manuelle des questions et types de questions)
</p>
<p>Les r&#233;sultats sont donn&#233;s dans le tableau 4 pour les tours de parole et dans le tableau 5 pour les locuteurs. Les
r&#233;sultats sur les locuteurs sont obtenus &#224; partir de l&#8217;&#233;tiquette en r&#244;le majoritaire de tous les tours de parole de
ce m&#234;me locuteur dans une &#233;mission donn&#233;e. Comme nous pouvons le voir, l&#8217;introduction du classifieur binaire
question/non question am&#233;liore l&#233;g&#232;rement les r&#233;sultats de classification en r&#244;le, par contre l&#8217;ajout des labels
directe/indirecte et totale/partielle n&#8217;am&#233;liore pas, voir d&#233;grade les r&#233;sultats.
</p>
<p>Les meilleurs r&#233;sultats sont obtenus en rajoutant le type des questions dans les param&#232;tres de classification, ce qui
conforte les analyses descriptives faites &#224; partir de la table 3. On obtient une r&#233;duction significative de l&#8217;erreur
totale, &#224; la fois sur les tours de parole et les locuteurs, gr&#226;ce &#224; cette cat&#233;gorisation. Ces r&#233;sultats valident notre
hypoth&#232;se initiale sur la pertinence des formes interrogatives pour caract&#233;riser les r&#244;les des locuteurs dans des
conversations.
</p>
<p>Cependant, dans une perspective de r&#233;alisation d&#8217;un syst&#232;me enti&#232;rement automatique, il appartient maintenant de
v&#233;rifier dans quelle mesure le type d&#8217;une question peut &#234;tre d&#233;termin&#233; automatiquement, et quel est l&#8217;impact des
in&#233;vitables erreurs d&#8217;&#233;tiquetage en questions et en types de questions sur la t&#226;che de segmentation en r&#244;le. Comme
pr&#233;cis&#233; en d&#233;but de paragraphe, nous utilisons dans cette &#233;tude les segmentations en locuteurs, en tours de parole
ainsi que les transcriptions de r&#233;f&#233;rence (manuelles) de notre corpus. Nous limitons ainsi l&#8217;&#233;tude aux seules erreurs
d&#8217;&#233;tiquetage en question, l&#8217;impact des erreurs de transcription et de segmentation en locuteurs est l&#8217;objet d&#8217;une
&#233;tude en cours. Le paragraphe suivant pr&#233;sente une m&#233;thode d&#8217;&#233;tiquetage de questions dans des transcriptions de
parole, utilisant &#224; la fois des param&#232;tres lexicaux et prosodiques. Les r&#233;sultats de la segmentation en r&#244;le utilisant
ces &#233;tiquettes automatiques sont pr&#233;sent&#233;s dans le paragraphe 5.3.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAT&#201;GORISER LES QUESTIONS POUR D&#201;TERMINER LE R&#212;LE DES LOCUTEURS
</p>
<p>5 D&#233;tection et classification automatique des questions
</p>
<p>La t&#226;che de d&#233;tection automatique de questions dans des &#233;nonc&#233;s oraux a principalement &#233;t&#233; abord&#233;e dans des
corpus de parole conversationnelles (Yuan &amp; Jurafsky, 2005) et des enregistrements de r&#233;unions (Boakye et al.,
2009). Dans les deux cas les &#233;tudes se basent sur une segmentation a priori des &#233;nonc&#233;s, effectu&#233;e manuellement
sur les transcriptions de r&#233;f&#233;rence. La t&#226;che revient &#224; une classification binaire des segments de parole : segment
interrogatif ou affirmatif. Elle constitue ainsi une sous-t&#226;che d&#8217;un &#233;tiquetage plus g&#233;n&#233;ral des conversations en
actes de dialogue qui consiste &#224; segmenter un dialogue en unit&#233;s discursives telles que : affirmation, question,
appr&#233;ciation, confirmation, n&#233;gation, etc. Diff&#233;rentes listes d&#8217;actes de dialogue ont &#233;t&#233; propos&#233;es, comme par
exemple la liste DAMSL (Core &amp; Allen, 1997). Les param&#232;tres utilis&#233;s sont principalement des indices lexicaux,
prosodiques, &#233;galement coupl&#233;s &#224; une analyse syntaxique dans (Boakye et al., 2009).
</p>
<p>Nous allons enrichir cette t&#226;che dans nos exp&#233;riences en rajoutant &#224; cette classification binaire la classification
en types de questions, en consid&#233;rant les 8 types de questions suivants : adverbe, complexe, d&#233;terminant, est-
ce-que, inversion, pronom, si et intonation. Les marqueurs des 7 premiers types de question sont des marqueurs
&#8220;syntaxiques&#8221; dans la mesure o&#249; c&#8217;est la structure syntaxique des &#233;nonc&#233;s qui permet de les consid&#233;rer comme
des questions. Pour le dernier type, intonation, ce sont uniquement des marqueurs prosodiques qui permettent de
qualifier les &#233;nonc&#233;s. Deux types de traitement ont donc &#233;t&#233; mis en oeuvre sur ces deux familles de questions : un
classifieur bas&#233; sur des marqueurs syntaxiques, un classifieur bas&#233; sur des marqueurs acoustiques.
</p>
<p>5.1 Caract&#233;risation des questions avec marqueurs syntaxiques
</p>
<p>Nous avons utilis&#233; pour les 7 types de questions avec marqueurs syntaxiques la m&#234;me m&#233;thodologie que pour
la classification en r&#244;le pr&#233;sent&#233;e dans le paragraphe 4. Cette fois chaque &#233;chantillon d&#8217;apprentissage ou de test
correspond &#224; un segment ou &#224; une &#171; phrase &#187; manuellement annot&#233; sur les transcriptions de r&#233;f&#233;rence du corpus.
Est consid&#233;r&#233;e comme phrase toute s&#233;quence de mots, &#224; l&#8217;int&#233;rieur d&#8217;un tour de parole, s&#233;par&#233;e par un signe de
ponctuation forte (point, point d&#8217;interrogation, point d&#8217;exclamation) ajout&#233; par les annotateurs humains durant
la phase de transcription manuelle 3. Nous avons, sur les 32 &#233;missions Le T&#233;l&#233;phone Sonne de cette &#233;tude, un
ensemble de 13224 segments dont 973 questions avec marqueurs syntaxiques et 562 questions intonation. Le
classifieur ICSIBOOST a &#233;t&#233; entra&#238;n&#233; sur ces &#233;chantillons en utilisant la m&#233;thodologie de validation crois&#233;e Leave-
One-Out pr&#233;sent&#233;e dans le paragraphe 4.2. Les r&#233;sultats sont pr&#233;sent&#233;s dans la table 6 en utilisant comme seuls
param&#232;tres des bigrammes de mots. Nous n&#8217;avons pas pour l&#8217;instant int&#233;gr&#233; d&#8217;informations relatives aux structures
syntaxiques des &#233;nonc&#233;s, ce travail fait partie d&#8217;une &#233;tude en cours.
</p>
<p>Classification nb de segments Pr&#233;cision Rappel F-mesure
segments interrogatifs 995 94,2 85,1 89,4
autres segments 12229 98,8 99,6 99,2
question type=adverbe 223 96,1 87,9 91,8
question type=complexe 139 79,0 67,6 72,9
question type=d&#233;terminant 99 87,6 78,8 83,0
question type=est-ce-que 209 96,7 97,6 97,1
question type=inversion 159 82,5 53,5 64,9
question type=pronom 94 80,9 58,5 67,9
question type=si 45 83,3 66,7 74,1
segments non interrogatifs 12229 98,4 99,7 99,1
</p>
<p>TABLE 6 &#8211; R&#233;sultats sur l&#8217;&#233;tiquetage des segments en question et type de question
</p>
<p>Comme nous pouvons le voir le taux de d&#233;tection moyen des questions est satisfaisant (environ 90% de F-mesure),
cependant de grandes disparit&#233;s sont constat&#233;es selon le type de questions. De mani&#232;re assez pr&#233;visible les ques-
tions de type inversion et pronom sont les plus difficiles &#224; classer, ce qui justifie l&#8217;int&#233;r&#234;t de disposer de param&#232;tres
li&#233;s &#224; la structure syntaxique des &#233;nonc&#233;s et non pas seulement &#224; leur lexicalisation. Cependant l&#8217;analyse syn-
taxique automatique de l&#8217;oral spontan&#233; est encore un domaine de recherche largement ouvert.
</p>
<p>3. Bien &#233;videmment tout symbole de ponctuation a &#233;t&#233; supprim&#233; des transcriptions des segments dans toutes les exp&#233;riences de classifica-
tion</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>BAZILLON ET AL.
</p>
<p>5.2 Caract&#233;risation des questions avec intonation
</p>
<p>Nous avons choisi de traiter les questions &#8220;purement&#8221; intonatives de notre corpus uniquement avec des param&#232;tres
prosodiques bas&#233;s sur la courbe de fr&#233;quence fondamentale, ou F0 (Yuan &amp; Jurafsky, 2005; Quang et al., 2007).
Ces param&#232;tres sont obtenus directement &#224; partir du signal de parole avec une fen&#234;tre temporelle de 10 millise-
condes. &#192; partir de cette courbe nous proposons d&#8217;extraire un ensemble de 15 param&#232;tres divis&#233;s en 3 classes :
param&#232;tres statistiques (6 param&#232;tres), param&#232;tres de trajectoire (5 param&#232;tres) et param&#232;tres de formes (4 pa-
ram&#232;tres). Voici une description rapide de ces param&#232;tres qui sont calcul&#233;s sur la fin de chaque phrase sur des
p&#233;riodes de 300 et 700 millisecondes :
</p>
<p>&#8211; Statistique : nous avons 6 param&#232;tres num&#233;riques sur la courbe de F0 : minimum, maximum, intervalle,
moyenne, m&#233;diane et d&#233;viation standard de la F0 sur nos fen&#234;tres de 300 et 700 millisecondes.
</p>
<p>&#8211; Trajectoire : ces 5 param&#232;tres d&#233;crivent si la courbe de fr&#233;quence fondamentale monte ou descend en fin de
phrase.
</p>
<p>&#8211; Forme : Les 4 param&#232;tres de formes constituent l&#8217;une des originalit&#233;s de cette &#233;tude. Ils consistent &#224; mod&#233;liser la
forme de la courbe de F0 gr&#226;ce &#224; une interpolation polynomiale Lagrangienne. Diff&#233;rents degr&#233;s de polyn&#244;mes
ont &#233;t&#233; test&#233;s et des r&#233;sultats empiriques ont montr&#233; qu&#8217;un degr&#233; de 2 &#233;tait satisfaisant pour la t&#226;che. Nous
utilisons donc les 3 param&#232;tres a, b, c du polyn&#244;me a &#8727; x2 + b &#8727; x + c ainsi que l&#8217;erreur d&#8217;interpolation de la
fonction approch&#233;e comme quatri&#232;me param&#232;tre.
</p>
<p>Une fois les 15 param&#232;tres extraits, un classifieur est entra&#238;n&#233;, en utilisant le m&#234;me protocole que d&#233;crit pr&#233;c&#233;-
demment, pour s&#233;parer les segments &#8220;question&#8221; des segments &#8220;autre&#8221;.
</p>
<p>question/non question Pr&#233;cision Rappel F-Mesure
Forme+Statistique 0,62 0,37 0,46
Forme+Trajectoire 0,58 0,32 0,41
</p>
<p>Statistique+Trajectoire 0,58 0,33 0,42
Combinaison 0,58 0,41 0,48
</p>
<p>TABLE 7 &#8211; Combinaison des param&#232;tres prosodiques bas&#233;s sur la F0 pour la classification binaire question/non
question de segments de parole
</p>
<p>Une &#233;valuation de ces param&#232;tres est donn&#233;e dans la table 7 sur la classification binaire question/non question des
segments du corpus. Comme nous pouvons le voir les meilleurs r&#233;sultats sont obtenus en combinant les diff&#233;rents
param&#232;tres avec une F-mesure d&#8217;environ 50%. Dans notre syst&#232;me de classification du type des questions, ce clas-
sifieur est utilis&#233; de la mani&#232;re suivante : si un segment n&#8217;est pas consid&#233;r&#233; comme une question par le classifieur
bas&#233; sur les marqueurs syntaxiques mais qu&#8217;il est class&#233; question par le classifieur prosodique, alors le segment
re&#231;oit l&#8217;&#233;tiquette question intonation.
</p>
<p>5.3 &#201;valuation sur la segmentation en r&#244;le
</p>
<p>niveau tours de parole locuteurs
param&#232;tres nb tests type question (ref) type question (aut) nb tests type question (ref) type question (aut)
F(auditeur) 500 65,9 66,5 220 90,2 90,2
F(expert) 1443 74,8 73,8 118 83,6 83,3
F(pr&#233;sentateur) 1860 82,5 81,2 35 77,7 71,7
F(rapporteur) 163 56,7 52,4 27 68,3 57,9
Erreur totale (E) 3966 23,1% 24,2% 400 14,5% 15,8%
</p>
<p>TABLE 8 &#8211; R&#233;sultats sur l&#8217;&#233;tiquetage en r&#244;le des tours de parole et des locuteurs. Comparaison annotation ma-
nuelle/automatique des questions avec leurs types
</p>
<p>La table 8 pr&#233;sente les r&#233;sultats obtenus sur la t&#226;che de segmentation en r&#244;le en comparant l&#8217;utilisation des &#233;ti-
quettes de type de question de r&#233;f&#233;rence (manuelles) &#224; celles produites automatiquement par les deux classifieurs
pr&#233;sent&#233;s dans ce paragraphe. Comme nous pouvons le voir, m&#234;me si une d&#233;gradation est constat&#233;e dans les per-
formances &#224; cause des erreurs de d&#233;tection et de classification des questions, les r&#233;sultats restent meilleurs que</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAT&#201;GORISER LES QUESTIONS POUR D&#201;TERMINER LE R&#212;LE DES LOCUTEURS
</p>
<p>ceux obtenus sans ces param&#232;tres : &#8722;0.5% d&#8217;erreur totale pour les tours de parole et &#8722;2% d&#8217;erreur totale pour les
locuteurs.
</p>
<p>6 Conclusion
</p>
<p>Nous avons propos&#233; dans cette &#233;tude une analyse du type des questions exprim&#233;es dans un corpus de conversation
d&#8217;&#233;missions de radio. Nous avons montr&#233; que le typage des questions pouvait &#234;tre un indicateur du r&#244;le du locuteur
&#224; l&#8217;int&#233;rieur de la conversation. Nous avons valid&#233; cette hypoth&#232;se sur une t&#226;che de segmentation automatique en
r&#244;le des locuteurs de notre corpus, en constatant une am&#233;lioration significative des r&#233;sultats apr&#232;s ajout de para-
m&#232;tres li&#233;s au typage des questions dans le processus de classification automatique. Enfin nous avons valid&#233; la
mise en pratique de ces param&#232;tres en montrant qu&#8217;on pouvait les obtenir de mani&#232;re compl&#232;tement automatique
au prix d&#8217;une l&#233;g&#232;re d&#233;gradation des r&#233;sultats. Il nous reste cependant &#224; nous attaquer au d&#233;fi que constitue la
segmentation automatique en unit&#233;, ou &#171; pseudo-phrases &#187; de l&#8217;oral spontan&#233;. Se baser uniquement sur les pauses
ou les groupes de souffle ne permet pas de segmenter de mani&#232;re coh&#233;rente les &#233;nonc&#233;s, et les r&#233;sultats des sys-
t&#232;mes de segmentation automatiques en phrases bas&#233;s sur la prosodie et des indices syntaxiques, s&#8217;ils obtiennent
des r&#233;sultats int&#233;ressants sur de la parole lue ou pr&#233;par&#233;e, sont encore tr&#232;s insuffisants pour &#234;tre utilis&#233; directement
sur des conversations spontan&#233;es. &#192; terme, une solution pourrait consister &#224; utiliser des m&#233;thodes et param&#232;tres
syntaxiques qui se passeraient d&#8217;une segmentation en phrases ou &#171; pseudo-phrases &#187;, afin de ne pas &#234;tre expos&#233;
aux limites que sous-entend cette t&#226;che sur la parole spontan&#233;e.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BARZILAY R., COLLINS M., HIRSCHBERG J. &amp; WHITTAKER S. (2000). The rules behind roles : Identifying
speaker role in radio broadcasts. In Proc. of AAAI.
</p>
<p>BIGOT B., PINQUIER J., FERRAN&#201; I. &amp; ANDR&#201;-OBRECHT R. (2010). Looking for relevant features for speaker
role recognition. In Proc. of Interspeech.
</p>
<p>BOAKYE K., FAVRE B. &amp; HAKKANI-T&#220;R D. (2009). Any Questions ? Automatic Question Detection in Mee-
tings. In ASRU, Merano (Italy).
</p>
<p>CORE M. &amp; ALLEN J. (1997). Coding dialogs with the DAMSL annotation scheme. In AAAI Fall Symposium
on Communicative Action in Humans and Machines, p. 28&#8211;35 : Citeseer.
</p>
<p>DAMNATI G. &amp; CHARLET D. (2011). Robust speaker turn role labeling of tv broadcast news shows. In
ICASSP&#8217;2011.
</p>
<p>EST&#200;VE Y., BAZILLON T., ANTOINE J.-Y., B&#201;CHET F. &amp; FARINAS J. (2010). The EPAC corpus : manual and
automatic annotations of conversational speech in French broadcast news. In LREC, Malta.
</p>
<p>FAVRE B., HAKKANI-T&#220;R D. &amp; CUENDET S. (2007). Icsiboost. http://code.google.come/p/
icsiboost.
</p>
<p>GARCIA-FERNANDEZ A. &amp; LAILLER C. (2008). Morphosyntaxe de l&#8217;interrogation pour le syst&#232;me question-
r&#233;ponse ritel. In RECITAL 2008.
</p>
<p>HUTCHINSON B., ZHANG B. &amp; OSTENDORF M. (2010). Unsupervised broadcast conversation speaker role
labeling. In Proc. of ICASSP.
</p>
<p>QUANG V., BESACIER L. &amp; CASTELLI E. (2007). Automatic question detection : prosodic-lexical features and
cross-lingual experiments. In Proc. Interspeech, volume 2007, p. 2257&#8211;2260.
</p>
<p>STOLCKE A., RIES K., COCCARO N., SHRIBERG E., BATES R., JURAFSKY D., TAYLOR P., MARTIN R.,
ESS-DYKEMA C. &amp; METEER M. (2000). Dialogue act modeling for automatic tagging and recognition of
conversational speech. Computational linguistics, 26(3), 339&#8211;373.
YAMAN S., HAKKANI-TUR D. &amp; TUR G. (2010). Social role discovery from spoken language using dynamic
bayesian networks. In Proc. of Interspeech.
</p>
<p>YUAN J. &amp; JURAFSKY D. (2005). Detection of questions in Chinese conversational speech. In 2005 IEEE
Workshop on Automatic Speech Recognition and Understanding, p. 47&#8211;52.</p>

</div></div>
</body></html>