<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>French TimeBank : un corpus de r&#233;f&#233;rence sur la temporalit&#233; en fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>French TimeBank : un corpus de r&#233;f&#233;rence sur la temporalit&#233; en fran&#231;ais
</p>
<p>Andr&#233; Bittar1 Pascal Amsili2 Pascal Denis3
</p>
<p>(1) Xerox Research Centre Europe
(2) LLF, Universit&#233; Paris Diderot, UMR CNRS 7110
</p>
<p>(3) EPI Alpage, INRIA Rocquencourt et Universit&#233; Paris Diderot
andre.bittar@xrce.xerox.com,
</p>
<p>pascal.amsili@linguist.jussieu.fr,
pascal.denis@inria.fr
</p>
<p>R&#233;sum&#233;. Cet article a un double objectif : d&#8217;une part, il s&#8217;agit de pr&#233;senter &#224; la communaut&#233; un corpus
r&#233;cemment rendu public, le French Time Bank (FTiB), qui consiste en une collection de textes journalistiques
annot&#233;s pour les temps et les &#233;v&#233;nements selon la norme ISO-TimeML ; d&#8217;autre part, nous souhaitons livrer les
r&#233;sultats et r&#233;flexions m&#233;thodologiques que nous avons pu tirer de la r&#233;alisation de ce corpus de r&#233;f&#233;rence, avec
l&#8217;id&#233;e que notre exp&#233;rience pourra s&#8217;av&#233;rer profitable au-del&#224; de la communaut&#233; int&#233;ress&#233;e par le traitement de la
temporalit&#233;.
</p>
<p>Abstract. This article has two objectives. Firstly, it presents the French TimeBank (FTiB) corpus, which
has recently been made public. The corpus consists of a collection of news texts annotated for times and events
according to the ISO-TimeML standard. Secondly, we wish to present the results and methodological conclusions
that we have drawn from the creation of this reference corpus, with the hope that our experience may also prove
useful to others outside the community of those interested in temporal processing.
</p>
<p>Mots-cl&#233;s : Annotation temporelle, corpus, ISO-TimeML.
</p>
<p>Keywords: Temporal annotation, corpus, ISO-TimeML.
</p>
<p>1 Introduction
</p>
<p>Le rep&#233;rage des entit&#233;s temporelles comme les &#233;v&#233;nements et les dates, ainsi que le calcul des relations entre ces
entit&#233;s (pr&#233;c&#233;dence, inclusion...), est un aspect important de la compr&#233;hension des textes en langue naturelle. Plus
sp&#233;cifiquement, la d&#233;termination automatique de ces entit&#233;s et de leurs relations est clairement susceptible d&#8217;ap-
porter un plus aussi bien au niveau de diverses t&#226;ches du TAL (r&#233;sum&#233; automatique, r&#233;solution des anaphores...)
qu&#8217;au niveau d&#8217;applications g&#233;n&#233;rales (extraction d&#8217;information, syst&#232;mes de question-r&#233;ponse...). Durant les der-
ni&#232;res ann&#233;es, de nombreux progr&#232;s ont &#233;t&#233; enregistr&#233;s dans le traitement automatique de ces ph&#233;nom&#232;nes, mais
la plupart de ces progr&#232;s concernent l&#8217;anglais. Ces am&#233;liorations ont &#233;t&#233; en large part dues au d&#233;veloppement de
la norme ISO-TimeML (ISO, 2008) et &#224; la mise &#224; disposition des corpus TimeBank (Pustejovsky et al., 2003,
2006). Il s&#8217;agit de corpus de r&#233;f&#233;rence annot&#233;s pour les &#233;v&#233;nements, les expressions temporelles et leur relations.
Dans cet article, nous pr&#233;sentons le French TimeBank (FTiB) (Bittar, 2010a), qui comme son nom l&#8217;indique, est
un corpus annot&#233; du fran&#231;ais et se base &#233;galement sur la norme ISO-TimeML. Au-del&#224; de la ressource elle-m&#234;me,
que nous pr&#233;sentons bri&#232;vement, nous mentionnons &#233;galement les points principaux de notre m&#233;thodologie, qui,
nous semble-t-il, sont partiellement transf&#233;rables &#224; d&#8217;autres t&#226;ches d&#8217;annotation. En particulier, nous avons tent&#233;
de mesurer de mani&#232;re syst&#233;matique l&#8217;impact d&#8217;une phase de pr&#233;-annotation automatique sur la qualit&#233; finale du
corpus et sur le temps d&#8217;annotation.
</p>
<p>L&#8217;article est organis&#233; de la mani&#232;re suivante. Dans une premi&#232;re section, nous pr&#233;sentons la norme ISO-TimeML,
non sans lui apporter un certain nombre de modifications, certaines li&#233;es &#224; l&#8217;adaptation au fran&#231;ais, mais d&#8217;autres
ayant une port&#233;e plus g&#233;n&#233;rale (section 3). Est ensuite d&#233;crite, en section 4, la m&#233;thodologie mise en &#339;uvre :
celle-ci se fonde sur une phase de pr&#233;-annotation automatique, suivie par une phase de correction manuelle. La
section 5 est consacr&#233;e &#224; la description des caract&#233;ristiques quantitatives et qualitatives du corpus produit, avant
de revenir en conclusion sur les le&#231;ons &#224; tirer de notre exp&#233;rience, et les perspectives ouvertes par notre travail.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANDR&#201; BITTAR, PASCAL AMSILI, PASCAL DENIS
</p>
<p>2 ISO-TimeML
</p>
<p>ISO-TimeML est un langage d&#8217;annotation des informations temporelles pour les textes en langue naturelle. Il
permet de baliser, avec un point de vue surfacique, les &#233;v&#233;nements et les expressions temporelles (ou &#171; mar-
quables &#187;), ainsi que les diff&#233;rentes relations qui existent entre ceux-ci. Le langage comporte six balises : deux
pour les marquables, trois pour les relations, et enfin une pour les marqueurs (ou &#8220;signaux&#8221;) de relations. Celles-ci
sont bri&#232;vement d&#233;crites ci-dessous1 et illustr&#233;es par l&#8217;exemple suivant :
</p>
<p>Jean est &lt;EVENT id=&quot;e1&quot; class=&quot;OCCURRENCE&quot; pos=&quot;VERB&quot; tense=&quot;PAST&quot; vform=&quot;PASTPART&quot;&gt;n&#233;
&lt;/EVENT&gt; &lt;SIGNAL id=&quot;s1&quot;&gt;avant&lt;/SIGNAL&gt; l&#8217;&lt;EVENT id=&quot;e2&quot; class=&quot;OCCURRENCE&quot;
pos=&quot;NOUN&quot;&gt;introduction&lt;/EVENT&gt; de l&#8217;euro.
&lt;TLINK id=&quot;l1&quot; eventID=&quot;e1&quot; relatedToEvent=&quot;e2&quot; signalID=&quot;s1&quot; relType=&quot;BEFORE&quot;/&gt;
</p>
<p>Le premier type de marquable utilis&#233; en ISO-TimeML est &lt;EVENT&gt;. La notion d&#8217;&#233;v&#233;nement correspond ici &#224; la
notion &#233;largie d&#8217;&#233;ventualit&#233; de Bach (1986) et recouvre tous les types de situations (&#233;tats, activit&#233;s, ach&#232;vements,
etc.). Cette balise comporte un ensemble d&#8217;attributs pour les traits morpho-syntaxiques et s&#233;mantiques (classe
s&#233;mantique, temps, aspect, mode, modalit&#233;, polarit&#233;, etc.) de l&#8217;&#233;v&#233;nement annot&#233;. Les &#233;v&#233;nements annot&#233;s peuvent
correspondre &#224; des cat&#233;gories syntaxiques vari&#233;es (en particulier nom, verbe, adjectif), et le choix fait dans ISO-
TimeML est de placer la balise sur la t&#234;te du groupe (ou du chunk) &#233;v&#233;nementiel, en excluant les auxiliaires, les
modifieurs, les adverbes de n&#233;gation, les clitiques, etc. Le second type de marquable est &lt;TIMEX3&gt; et correspond
aux expressions temporelles dans le texte. Cette balise comporte des attributs pour le type de l&#8217;expression (date,
heure, dur&#233;e ou fr&#233;quence) et sa &#8220;valeur&#8221; normalis&#233;e2. Tout l&#8217;empan est marqu&#233;.
</p>
<p>Les trois types de relations annot&#233;s en ISO-TimeML sont les &lt;ALINK&gt;, &lt;SLINK&gt;, et &lt;TLINK&gt;. Les ALINKS
indiquent une relation aspectuelle entre deux &#233;v&#233;nements. Par exemple, cette relation intervient entre un verbe
aspectuel (commencer, cesser, continuer...) et son compl&#233;ment &#233;v&#233;nementiel. Les SLINKS servent &#224; marquer les
relations de subordination (modale) entre deux &#233;v&#233;nements. Typiquement, on l&#8217;utilisera pour marquer la relation
qui existe entre un verbe modal (falloir, devoir...) ou de perception (voir, entendre...) et son compl&#233;ment &#233;v&#233;ne-
mentiel. Enfin, les TLINKS marquent les relations (strictement) temporelles entre marquables. Comme pour les
deux autres balises de relation, il existe diff&#233;rents sous-types, indiqu&#233;s au moyen de l&#8217;attribut relType. L&#8217;attribut
signalID permet de sp&#233;cifier l&#8217;identifiant du marqueur qui r&#233;alise la relation dans le texte, s&#8217;il y en a un. Dans ce
cas, c&#8217;est la balise &lt;SIGNAL&gt; qui est utilis&#233;e. Elle &#233;tiquette les marqueurs de relation lexicalis&#233;s dans les textes,
comme, typiquement, les pr&#233;positions temporelles (avant, apr&#232;s et pendant).
</p>
<p>Soulignons &#224; nouveau le caract&#232;re r&#233;solument surfacique de cette norme : l&#8217;id&#233;e n&#8217;est pas d&#8217;annoter le sens en soi,
mais de fournir une normalisation des formes linguistiques qui expriment la temporalit&#233; dans les textes, en limitant
autant que possible l&#8217;engagement th&#233;orique. Mais cette position de principe (qui conduit par exemple &#224; &#233;viter de
d&#233;sambigu&#239;ser l&#8217;annotation) n&#8217;est pas toujours suivie &#224; la lettre, et certaines annotations reposent parfois sur des
informations qui ne rel&#232;vent pas uniquement des formes de surface. Par exemple, l&#8217;annotation de la subordination
modale d&#8217;un &#233;v&#233;nement (ex. Jean croit que L&#233;a est all&#233;e au Japon) n&#233;cessite une connaissance de la structure
syntaxique de la construction en question (ISO, 2008, p. 12). On notera aussi que, par d&#233;finition, l&#8217;annotation des
relations n&#8217;est pas strictement surfacique, puisque les relations sont le plus souvent implicites dans les textes, et
ne correspondent &#224; un &#233;l&#233;ment visible que dans les cas o&#249; un marquable de type SIGNAL est pr&#233;sent.
</p>
<p>3 Modifications d&#8217;ISO-TimeML
</p>
<p>La norme ISO-TimeML est une norme r&#233;cente, &#233;labor&#233;e d&#8217;abord pour l&#8217;anglais, puis adapt&#233;e &#224; d&#8217;autres langues,
telles que l&#8217;italien (Caselli, 2008), le chinois et le cor&#233;en (ISO, 2008). Il n&#8217;est donc pas &#233;tonnant que cette norme
soit encore sujette &#224; des adaptations et changements &#233;ventuels. Nous proposons ici deux types de modifications :
certaines ind&#233;pendantes de la langue (&#167; 3.1), d&#8217;autres plus sp&#233;cifiques au fran&#231;ais (&#167; 3.2). Les modification que
nous proposons concernent deux des balises ISO-TimeML : la balise &lt;EVENT&gt;, avec ses attributs de classe, temps,
aspect, mode, modalit&#233;, polarit&#233;, etc., et la balise &lt;ALINK&gt; qui sert &#224; r&#233;aliser les relations aspectuelles entre
&#233;ventualit&#233;s. Certaines de ces modifications sont en cours d&#8217;adoption dans la norme ISO-TimeML. On trouvera
</p>
<p>1Pour plus de d&#233;tails sur la norme dans son &#233;tat actuel (et sur son historique), voir p.ex. (ISO, 2008).
2La norme adopt&#233;e est une extention de la norme ISO 8601 pour la repr&#233;sentation internationale des dates et heures.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FRENCH TIMEBANK
</p>
<p>dans (Bittar, 2010b) l&#8217;ensemble des consignes d&#8217;annotation qui ont &#233;t&#233; &#233;labor&#233;es.
</p>
<p>3.1 Modifications ind&#233;pendantes de la langue
</p>
<p>Les modifications propos&#233;es correspondent &#224; l&#8217;annotation d&#8217;expressions qui n&#8217;&#233;taient jusqu&#8217;alors pas pr&#233;sentes
dans le sch&#233;ma ISO-TimeML ; nous pensons qu&#8217;elles sont utiles &#224; annoter, en restant dans l&#8217;esprit surfacique du
projet ISO-TimeML : m&#234;me si elles ne d&#233;notent pas en elles-m&#234;mes des &#233;v&#233;nements ou des temps, ces expressions
contiennent des informations exploitables pour raffiner les informations aspectuelles ou de localisation temporelle
des autres marquables du texte.
</p>
<p>Conteneurs &#233;v&#233;nementiels La notion de conteneur (&#233;v&#233;nementiel), introduite par Vendler (1967), d&#233;signe les
pr&#233;dicats (verbes ou adjectifs) qui s&#233;lectionnent un &#233;v&#233;nement comme argument : p.ex. se passer, se produire,
avoir lieu. Ils servent &#224; &#233;tablir l&#8217;existence d&#8217;un &#233;v&#233;nement (1-a) dans le temps, mais aussi &#224; relier un &#233;v&#233;nement
&#224; des &#233;l&#233;ments de modalit&#233; et de polarit&#233;, ainsi qu&#8217;&#224; des adverbiaux temporels (1-b). Afin de permettre la prise en
compte de ces cas de port&#233;e, nous proposons d&#8217;ajouter une nouvelle classe d&#8217;&#233;v&#233;nement au sch&#233;ma ISO-TimeML
afin de traiter ces contextes : la classe EVENT_CONTAINER.
</p>
<p>(1) a. La c&#233;r&#233;monie a eu lieu.
b. La c&#233;r&#233;monie ne devrait pas se tenir aujourd&#8217;hui.
</p>
<p>Constructions &#224; verbe support On parle de verbe support (ou light verb) dans le cas de verbes ayant une
contribution s&#233;mantique faible mais participant &#224; une pr&#233;dication complexe avec un nom (ou un autre verbe, un
adjectif, etc). On s&#8217;int&#233;resse aux constructions qui font intervenir un nom d&#233;notant une &#233;ventualit&#233; :
</p>
<p>(2) a. Ce politicien a men&#233; une attaque contre le lib&#233;ralisme.
b. Ce politicien a lanc&#233; une attaque contre le lib&#233;ralisme.
</p>
<p>Dans (2-a), le verbe mener a une lecture aspectuelle &#8220;neutre&#8221; (sans aucune pr&#233;cision aspectuelle sur le proc&#232;s
d&#233;not&#233; par le nom), alors que dans (2-b), le verbe lancer a une valeur aspectuelle inchoative : il exprime la phase
initiale dans le d&#233;roulement de l&#8217;&#233;v&#233;nement introduit par le nom, ce d&#233;but &#233;tant temporellement localis&#233; par le
temps du verbe support. Assimil&#233;s dans la norme actuelle, ces deux cas de figure sont d&#233;sormais distingu&#233;s :
d&#8217;une part, en conservant l&#8217;annotation standard (relation entre le verbe et le nom not&#233;e avec un &lt;TLINK&gt; de type
IDENTITY), et d&#8217;autre part, en utilisant la balise &lt;ALINK&gt; dans le second cas pour marquer la relation entre le
verbe aspectuel et son compl&#233;ment nominal.
</p>
<p>P&#233;riphrases aspectuelles Beaucoup de langues r&#233;alisent des valeurs aspectuelles par le biais de p&#233;riphrases,
telles que en train de + Vinf , en cours de + N et en voie de + Vinf pour le fran&#231;ais. Ces constructions sont
elles aussi ignor&#233;es dans la norme actuelle ISO-TimeML. Nous traitons ces constructions en annotant une valeur
aspectuelle sur la balise &lt;EVENT&gt; du compl&#233;ment &#233;v&#233;nementiel ; les valeurs possibles sont celles d&#233;j&#224; &#233;tablies
dans ISO-TimeML plus celles propos&#233;es dans la Section 3.2. Les valeurs de temps, d&#8217;aspect, de modalit&#233; et de
polarit&#233; de la copule y sont &#233;galement annot&#233;es.
</p>
<p>Modalit&#233; ISO-TimeML permet de repr&#233;senter la modalit&#233; attribu&#233;e &#224; un &#233;v&#233;nement dans une relation o&#249; un
&#233;v&#233;nement est subordonn&#233; par un verbe modal, par exemple. Le traitement actuel consiste &#224; annoter la modalit&#233;
sur l&#8217;&#233;v&#233;nement subordonn&#233; par un attribut modality dans la balise &lt;EVENT&gt;, dont la valeur est de type XML
CDATA (sans restriction donc). Ceci est vraisemblablement justifi&#233; pour l&#8217;anglais, o&#249; la modalit&#233; est exprim&#233;e
essentiellement par des auxiliaires, non annot&#233;s en eux-m&#234;mes. Mais dans une langue comme le fran&#231;ais, la mo-
dalit&#233; est exprim&#233;e pr&#233;f&#233;rentiellement par des verbes pleins, qui peuvent &#234;tre tens&#233;s, avoir des valeurs aspectuelles,
et s&#8217;ench&#226;sser les uns derri&#232;re les autres, et il nous semble pr&#233;f&#233;rable d&#8217;avoir une annotation sp&#233;cifique pour ces
verbes modaux. Suivant les cat&#233;gories modales classiques (Palmer, 1986), nous proposons de limiter le jeu de
valeurs &#224; : NECESSITY, POSSIBILITY (pour le type &#233;pist&#233;mique), OBLIGATION et PERMISSION (pour le
type d&#233;ontique).
</p>
<p>Cette derni&#232;re proposition doit &#234;tre un peu discut&#233;e car elle conduit &#224; s&#8217;&#233;loigner un peu du point de vue surfacique
qui pr&#233;vaut en g&#233;n&#233;ral dans la norme ISO-TimeML. En effet, au lieu de pr&#233;voir de marquer la modalit&#233; avec le
lemme du verbe (ou plus g&#233;n&#233;ralement du pr&#233;dicat) qui est responsable d&#8217;une subordination modale, ce qui nous</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANDR&#201; BITTAR, PASCAL AMSILI, PASCAL DENIS
</p>
<p>conduirait &#224; conserver l&#8217;ambigu&#239;t&#233; potentielle d&#8217;un verbe comme devoir (qui marque selon les cas la n&#233;cessit&#233;
&#233;pist&#233;mique ou l&#8217;obligation d&#233;ontique), nous proposons de lever l&#8217;ambigu&#239;t&#233; pour indiquer au niveau de l&#8217;anno-
tation la valeur modale elle-m&#234;me. Notre choix est motiv&#233; par les raisons suivantes : d&#8217;une part, le lemme du
verbe modal, puisqu&#8217;il est annot&#233;, est facilement r&#233;cup&#233;rable ; d&#8217;autre part, il a sembl&#233;, dans les premiers essais
d&#8217;annotation, que la distinction entre les modalit&#233;s ne posaient pas de probl&#232;me important aux annotateurs, et il a
donc sembl&#233; pertinent de profiter de l&#8217;occasion d&#8217;enrichir l&#8217;annotation.
</p>
<p>3.2 Adaptations pour le fran&#231;ais
</p>
<p>Temps (verbaux) et aspect Le syst&#232;me fran&#231;ais du temps et de l&#8217;aspect est diff&#233;rent de celui de l&#8217;anglais,
et nous avons par cons&#233;quent propos&#233; un jeu de valeurs appropri&#233;es pour l&#8217;annotation des temps verbaux (ainsi
que les constructions en en train de + Vinf ). Il s&#8217;agit d&#8217;une correspondance entre les valeurs ISO-TimeML et les
valeurs aspectuo-temporelles. L&#8217;objectif n&#8217;est pas de fournir toutes les valeurs possibles des interpr&#233;tations des
temps verbaux, mais de fournir un ensemble de valeurs normalis&#233;es pour le fran&#231;ais3. Voir le Tableau 1.
</p>
<p>Groupe verbal tense aspect
mange PRESENT NONE
est en train de manger PRESENT PROGRESSIVE
a mang&#233; PAST NONE
mangea PAST NONE
mangeait IMPERFECT NONE
&#233;tait en train de manger PAST PROGRESSIVE
avait mang&#233; PAST PERFECTIVE
avait &#233;t&#233; en train de manger PAST PERFECTIVE_PROGRESSIVE
mangera FUTURE NONE
sera en train de manger FUTURE PROGRESSIVE
aura mang&#233; FUTURE PERFECTIVE
va manger PRESENT PROSPECTIVE
allait manger IMPERFECT PROSPECTIVE
</p>
<p>TAB. 1 &#8211; Valeurs pour les temps verbaux et l&#8217;aspect en fran&#231;ais.
</p>
<p>Mode verbal Le mode verbal subjonctif est plus fr&#233;quemment employ&#233; en fran&#231;ais qu&#8217;en anglais, et nous
proposons d&#8217;ajouter la valeur SUBJUNCTIVE pour l&#8217;attribut mood, qui n&#8217;&#233;tait pas pr&#233;vu dans ISO-TimeML. De
fa&#231;on plus g&#233;n&#233;rale, il serait sans doute pertinent de sp&#233;cifier syst&#233;matiquement le mode (indicatif, subjonctif,
conditionnel...) dans les annotations.
</p>
<p>Verbes modaux Les verbes modaux en fran&#231;ais (ex. falloir, devoir, se pouvoir, etc.) ne se comportent pas
de la m&#234;me fa&#231;on que les auxiliaires modaux de l&#8217;anglais. Il s&#8217;agit plut&#244;t de verbes lexicaux qui peuvent &#234;tre
conjugu&#233;s &#224; tous les temps, peuvent tomber sous la port&#233;e d&#8217;op&#233;rateurs de polarit&#233; et s&#8217;ench&#226;sser les uns derri&#232;re
les autres. Il est donc n&#233;cessaire de les annoter avec la balise &lt;EVENT&gt;, contrairement aux modaux de l&#8217;anglais.
Nous proposons d&#8217;annoter les modaux du fran&#231;ais avec la classe MODAL.
</p>
<p>4 M&#233;thodologie d&#8217;annotation
</p>
<p>Nous pr&#233;sentons ci-dessous les points principaux de notre m&#233;thodologie d&#8217;annotation.
</p>
<p>4.1 &#201;chantillonnage de textes
</p>
<p>Les textes source pour FTiB ont &#233;t&#233; s&#233;lectionn&#233;s &#224; partir du corpus de L&#8217;Est R&#233;publicain du CNRTL. Le choix
du domaine journalistique se justifie principalement par le nombre g&#233;n&#233;ralement important d&#8217;&#233;v&#233;nements et d&#8217;ex-
</p>
<p>3Nous avons fait le choix de conserver autant que possible le jeu de traits aspectuo-temporels de TimeML, ce qui conduit &#224; certaines
difficult&#233;s connues depuis longtemps (Kamp &amp; Rohrer, 1983, p.ex.). Par exemple, pour le pass&#233; compos&#233;, nous avons privil&#233;gi&#233; l&#8217;interpr&#233;tation
la plus fr&#233;quente, analogue &#224; un pr&#233;t&#233;rit anglais, sur l&#8217;interpr&#233;tation du type present-perfect. Une alternative qui m&#233;riterait sans doute d&#8217;&#234;tre
&#233;tudi&#233;e pourrait consister &#224; choisir d&#8217;annoter avec les temps verbaux du fran&#231;ais, en gardant toutes les ambigu&#239;t&#233;s.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FRENCH TIMEBANK
</p>
<p>pressions temporelles dans ce type de textes. La distribution des textes choisis en fonction de leur sous-genre
est r&#233;sum&#233;e dans le Tableau 2. On notera que certains sous-genres sont plus fr&#233;quents que d&#8217;autres ; ce choix est
motiv&#233; par deux raisons. D&#8217;abord pour favoriser une comparaison avec le TimeBank 1.2 de l&#8217;anglais, et deuxi&#232;me-
ment, parce que ces sous-genres repr&#233;sentent une certaine diversit&#233; de style (p.ex., actualit&#233; politique) par rapport
aux autres sous-genres, qui suivent plut&#244;t un format particulier (p.ex., les n&#233;crologies). Tous les textes du corpus
contiennent des &#233;v&#233;nements et des expressions temporelles. Nous reviendrons de mani&#232;re plus d&#233;taill&#233;e sur les
corr&#233;lations entre sous-genres textuels et contenu linguistique dans la section 5.
</p>
<p>Sous-genre # documents % documents # tokens % tokens
Annonce 22 20.2% 1 679 10.4%
Bio 1 0.9% 186 1.1%
Actu. inter. 32 29.4% 5 171 31.9%
Actu. loc. 19 17.5% 4 370 27.0%
Actu. nat. 25 22.9% 3 347 20.7%
N&#233;crologie 2 1.8% 313 1.9%
Actu. sport 8 7.3% 1 142 7.0%
Total 109 100% 16 208 100%
</p>
<p>TAB. 2 &#8211; Proportions de sous-genres de textes dans le French TimeBank.
</p>
<p>4.2 Pr&#233;-annotation des marquables
</p>
<p>Afin d&#8217;acc&#233;l&#233;rer le processus d&#8217;annotation, nous avons opt&#233; pour une pr&#233;-annotation des marquables dans les
textes, suivie d&#8217;une correction manuelle. L&#8217;annotation des relations a, quant &#224; elle, &#233;t&#233; effectu&#233;e enti&#232;rement &#224; la
main. Le syst&#232;me d&#8217;annotation des marquables consiste en deux modules : le module TempEx Tagger et le module
Event Tagger, que nous d&#233;crivons ci-dessous.
</p>
<p>Le module TempEx Tagger balise les expressions temporelles (balise &lt;TIMEX3&gt;) et fixe ses attributs. Il rep&#232;re
&#233;galement certains marqueurs de relation (balise &lt;SIGNAL&gt;), par exemple ceux qui apparaissent devant une ex-
pression temporelle. La technique choisie repose sur l&#8217;application de transducteurs Unitex (Paumier, 2008), qui
s&#8217;appliquent directement sur du texte brut. Une des raisons de ce choix est que nous avons pu partir d&#8217;une batterie
de transducteurs existants (Gross, 2002), que nous avons enrichie et adapt&#233;e. Les expressions sont class&#233;es selon
leur type ISO-TimeML4, et les valeurs de certains attributs sont calcul&#233;es. La valeur de l&#8217;attribut VALUE n&#8217;est
attribu&#233;e que dans un second temps, par un script qui calcule la valeur normalis&#233;e des expressions temporelles, y
compris quand elles sont d&#233;ictiques, comme lundi dernier ou l&#8217;ann&#233;e prochaine (la date de parution de l&#8217;article
servant alors de point de rep&#232;re).
</p>
<p>Nous avons proc&#233;d&#233; &#224; une &#233;valuation comparative de ce module avec celui de (Parent et al., 2008) appel&#233; DEDO,
et nous observons des performances tr&#232;s similaires sur un m&#234;me corpus d&#8217;&#233;valuation. La mesure de pr&#233;cision et
de rappel pour la correspondance (match) correspond au balisage des m&#234;mes empans textuels ; la mesure pour les
valeurs correspond au calcul des valeurs d&#8217;attributs. Voir la table 3.
</p>
<p>Syst&#232;me Pr&#233;cision Rappel F-score
Match TempEx 84.2 81.8 83.0
</p>
<p>DEDO 83.0 79.0 81.0
Valeur TempEx 55.0 44.9 49.4
</p>
<p>DEDO 56.0 45.0 50.0
</p>
<p>TAB. 3 &#8211; &#201;valuation comparative du TempEx Tagger.
</p>
<p>Le module Event Tagger s&#8217;occupe quant &#224; lui des &#233;v&#233;nements et des &#233;ventuels marqueurs qui r&#233;alisent une
relation temporelle5. Il s&#8217;agit d&#8217;une suite d&#8217;applications de r&#232;gles qui agissent sur les chunks et qui visent &#224;
&#233;liminer ou &#224; choisir les bons candidats pour l&#8217;annotation, sur la base de listes lexicales d&#233;taill&#233;es, et de divers
</p>
<p>4DATE (15/01/2001, le 15 janvier 1010, jeudi, demain), TIME (15h30, midi), DURATION (ex. trois jours, un an) ou SET (ex. tous les
jours, chaque mardi).
</p>
<p>5Les pr&#233;positions comme avant, apr&#232;s, etc. qui introduisent un chunk &#233;v&#233;nementiel.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANDR&#201; BITTAR, PASCAL AMSILI, PASCAL DENIS
</p>
<p>crit&#232;res contextuels. Ces r&#232;gles supposent un texte d&#233;j&#224; annot&#233; en partie du discours, lemmatis&#233;, et chunk&#233;. Nous
avons choisi d&#8217;utiliser pour ce pr&#233;-traitement la cha&#238;ne de traitement Macaon (Nasr et al., 2010).
</p>
<p>Ce module repose sur certaines ressources lexicales, notamment un lexique de noms &#233;v&#233;nementiels &#224; large cou-
verture. Le lexique est bas&#233; sur VerbAction (Hathout et al., 2002) qui contient 9 393 paires (verbe, nom d&#233;verbal).
Nous avons enrichi ce lexique par extraction de noms qui ne sont pas dans VerbAction. Ceci a &#233;t&#233; fait par recherche
dans des moteurs de recherche de certains patrons, comme &#8220;un * a eu lieu&#8221;, &#8220;lors de la *&#8221; et &#8220;le * se produit&#8221; o&#249;
* est susceptible d&#8217;&#234;tre un nom d&#8217;&#233;v&#233;nement. Cette m&#233;thode a rajout&#233; 804 entr&#233;es au lexique des noms, notam-
ment des noms d&#8217;&#233;v&#233;nements non d&#233;verbaux, comme anniversaire, apocalypse et gr&#232;ve ainsi que des d&#233;verbaux
n&#8217;apparaissant pas dans VerbAction.
</p>
<p>Il n&#8217;a malheureusement pas &#233;t&#233; possible de comparer de fa&#231;on fiable les performances du module Event Tagger
avec le module similaire de (Parent et al., 2008), le seul autre syst&#232;me d&#233;velopp&#233; pour cette t&#226;che sur le fran&#231;ais &#224;
notre connaissance. En effet, les &#233;valuations ont &#233;t&#233; effectu&#233;es sur des corpus diff&#233;rents, quoique similaires, ce qui
fait que les r&#233;sultats ne sont qu&#8217;indicatifs. Pour le rep&#233;rage des &#233;v&#233;nements (les empans textuels des expressions),
notre syst&#232;me a enregistr&#233; une pr&#233;cision de 62,2 (62,5 pour DEDO), un rappel de 89,4 (77,7), pour un F-score de
75,8 (69,3).
</p>
<p>De conception assez simple, ces modules fournissent des r&#233;sultats encore m&#233;diocres, mais suffisants pour per-
mettre de consid&#233;rablement acc&#233;l&#233;rer les cycles d&#8217;annotation manuelle et ainsi de r&#233;duire le &#8220;co&#251;t&#8221; total de l&#8217;an-
notation.
</p>
<p>4.3 &#201;tapes d&#8217;annotation manuelles et validation
</p>
<p>Apr&#232;s la pr&#233;-annotation des marquables, les textes ont &#233;t&#233; corrig&#233;s par trois annotateurs humains (&#224; raison de
deux annotateurs par texte). La correction a &#233;t&#233; faite avec les outils Callisto6 et Tango7, con&#231;us pour les t&#226;ches en
question. Le cycle auquel est soumis chaque document est d&#233;crit &#224; la figure 1.
</p>
<p>Notons que ce cycle se termine par la v&#233;rification de la coh&#233;rence des graphes temporels produits pour chaque
document. Cette v&#233;rification a &#233;t&#233; faite par l&#8217;application de l&#8217;algorithme d&#8217;Allen (Allen, 1983) par saturation des
graphes temporels (Tannier &amp;Muller, 2008). &#192; ce stade, le corpus contenait un total de 8 incoh&#233;rences, qui ont &#233;t&#233;
r&#233;solues &#224; la main. le corpus final ne contient aucun graphe temporel incoh&#233;rent. Pour comparer avec le TimeBank
1.2 de l&#8217;anglais, nous avons effectu&#233; la m&#234;me v&#233;rification sur ce corpus et avons trouv&#233; 18 graphes incoh&#233;rents
(sur le total de 183 fichiers). Enfin, les textes du corpus ont &#233;t&#233; valid&#233;s selon une DTD ISO-TimeML pour le
fran&#231;ais, que nous fournissons avec le corpus.
</p>
<p>EVENT 
correction
</p>
<p>Adjudication Adjudication
</p>
<p>Coherence 
check
</p>
<p>TIMEX3 
correction
</p>
<p>SIGNAL 
correction
</p>
<p>Pre-
annotated 
</p>
<p>text
Annotated 
Markables
</p>
<p>Annotated 
Markables 
+ LINKs
</p>
<p>Gold 
Standard
</p>
<p>LINK 
annotation
</p>
<p>FIG. 1 &#8211; Sch&#233;ma des &#233;tapes de la strat&#233;gie d&#8217;annotation adopt&#233;e.
</p>
<p>6http://callisto.mitre.org/
7http://timeml.org/site/tango/tool.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FRENCH TIMEBANK
</p>
<p>FIG. 2 &#8211; Contenu du French TimeBank compar&#233; avec TimeBank 1.2.
</p>
<p>5 French TimeBank
</p>
<p>Notre projet pour le FTiB est de proposer un corpus de taille comparable &#224; celle du TimeBank 1.2 de l&#8217;anglais
(environ 61 000 tokens). La version 1.0 que nous pr&#233;sentons ici, et qui a &#233;t&#233; mise en ligne en janvier 2011,
repr&#233;sente environ un quart de cette taille. Les quantit&#233;s et proportions pour les divers &#233;l&#233;ments annot&#233;s sont
donn&#233;s dans la Figure 2 avec, pour comparaison, les chiffres correspondants pour TimeBank 1.2.
</p>
<p>On constate que les proportions des &#233;l&#233;ments annot&#233;s pour le fran&#231;ais sont, pour la plupart, tr&#232;s proches de celles
de TimeBank 1.2. La plus grande proportion de &lt;TLINK&gt; dans le French TimeBank est due au fait que nous
avons annot&#233; les relations temporelles entre les &lt;TIMEX3&gt; qui avaient une valeur pleinement sp&#233;cifi&#233;e, alors que
ce n&#8217;&#233;tait pas le cas pour l&#8217;anglais. Lorsqu&#8217;on enl&#232;ve ces relations, les proportions se rapprochent. Cette similarit&#233;
dans les proportions nous semble indiquer que les consignes d&#8217;annotation ont &#233;t&#233; appliqu&#233;es de fa&#231;on comparable
sur les deux corpus. Cela sugg&#232;re &#233;galement que, pour le genre journalistique, les distributions des diff&#233;rents types
d&#8217;&#233;l&#233;ments sont similaires en anglais et en fran&#231;ais.
</p>
<p>Nous avons examin&#233; l&#8217;effet de notre strat&#233;gie d&#8217;annotation sur le contenu du corpus, en particulier les effets de
l&#8217;&#233;chantillonnage de textes et l&#8217;&#233;ventuel biais introduit par la pr&#233;-annotation automatique. En ce qui concerne
l&#8217;&#233;chantillonnage, nous avons cherch&#233; &#224; savoir si une corr&#233;lation existe entre le sous-genre de texte et le contenu
linguistique servant &#224; exprimer la temporalit&#233;. Nous pr&#233;sentons les r&#233;sultats dans la Section 5.1. L&#8217;&#233;tude des effets
de la pr&#233;-annotation se focalise sur les influences positive et n&#233;gative du traitement pr&#233;alable sur le r&#233;sultat final.
Nous pr&#233;sentons cette exp&#233;rience dans la Section 5.2.
</p>
<p>5.1 Sous-genre textuel et contenu linguistique
</p>
<p>Nous avons observ&#233; un certain nombre de corr&#233;lations entre le sous-genre du texte et son contenu linguistique.
Nous nous focaliserons ici sur les corr&#233;lations d&#233;tect&#233;es entre le sous-genre et les types d&#8217;expressions temporelles
employ&#233;es, ainsi qu&#8217;entre le sous-genre et les classes des &#233;v&#233;nements mentionn&#233;s.
</p>
<p>La Figure 3 montre les pourcentages de chaque type d&#8217;expression temporelle, ainsi que les proportions des classes
d&#8217;&#233;v&#233;nements annot&#233;s pour chacun des sous-genres textuels.
</p>
<p>La variation du nombre total d&#8217;expressions temporelles est due &#224; la diff&#233;rence de proportions de chaque sous-genre
dans le corpus. On constate que le sous-genre d&#8217;annonces contient une proportion importante (19/41, ou 46%) des
expressions de type TIME, alors que les autres sous-genres en contiennent des proportions relativement basses (de
2% &#224; 24%). Cela est d&#8217;autant plus significatif compte tenu du fait que les annonces repr&#233;sentent une proportion
relativement faible du total des tokens du corpus. Il se trouve alors que ce sous-genre compense le manque de
ce type d&#8217;expressions dans les autres sous-genres. Cela montre l&#8217;effet positif de l&#8217;inclusion de ce sous-genre, qui
contribue visiblement &#224; la diversit&#233; linguistique du corpus.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANDR&#201; BITTAR, PASCAL AMSILI, PASCAL DENIS
</p>
<p>FIG. 3 &#8211; Distribution de marquables par sous-genre.
</p>
<p>On constate &#233;galement que les dur&#233;es (DURATION) sont relativement peu fr&#233;quentes dans les annonces (2% du
total), alors qu&#8217;elles sont plus utilis&#233;es dans les autres sous-genres, en particulier les actualit&#233;s (de 21% &#224; 32%) et
les actualit&#233;s sportives (13,5%). L&#224; encore cela sugg&#232;re un certain &#233;quilibre dans le corpus, une des motivations
pour l&#8217;&#233;chantillonnage.
</p>
<p>Les expressions de DATE sont de loin les plus fr&#233;quentes &#224; travers les sous-genres, avec presque 80% des expres-
sions annot&#233;es. Inversement, les expressions quantifi&#233;es ou de fr&#233;quence SET sont les moins fr&#233;quentes (3% du
total). Les SET apparaissent dans des proportions relativement homog&#232;nes dans les annonces et les actualit&#233;s, mais
relativement peu ou pas du tout dans les autres genres. Les n&#233;crologies et les biographies sont trop peu repr&#233;sen-
t&#233;es dans le corpus pour pouvoir tirer des conclusions, mais il est int&#233;ressant de noter que les actualit&#233;s sportives
ne contiennent aucune expression de type SET. Ce n&#8217;est pas &#233;tonnant si l&#8217;on note que ces articles se concentrent
sur la description d&#8217;un &#233;v&#233;nement sportif particulier au lieu de d&#233;crire des &#233;v&#233;nements r&#233;currents.
</p>
<p>Une &#233;tude pr&#233;liminaire nous a permis de noter la pr&#233;sence de certaines corr&#233;lations entre les sous-genres textuels
du corpus et les types d&#8217;expressions temporelles qu&#8217;ils contiennent. Des tendances assez claires apparaissent pour
les annonces, qui contiennent une proportion relativement importante d&#8217;expressions d&#8217;heure et peu de dur&#233;es, une
tendance qui est compens&#233;e par les autres sous-genres du corpus. Les dates et les expressions quantifi&#233;es sont
distribu&#233;es de fa&#231;on plut&#244;t homog&#232;ne. On observe ainsi une certaine vari&#233;t&#233; dans les expressions, ainsi qu&#8217;un
&#233;quilibre, que l&#8217;on peut attribuer &#224; la politique d&#8217;&#233;chantillonnage. Cela tend &#224; valider le choix de s&#233;lectionner les
textes en fonction du sous-genre de texte.
</p>
<p>Maintenant, examinons les &#233;v&#233;nements qui sont annot&#233;s dans les diff&#233;rents sous-genres de textes. Nous nous
focaliserons sur le rapport entre les classes d&#8217;&#233;v&#233;nements annot&#233;s et les sous-genres de textes. On remarque im-
m&#233;diatement la pr&#233;pond&#233;rance de la classe OCCURRENCE, qui repr&#233;sente 62,1% de tous les &#233;v&#233;nements annot&#233;s,
4 fois plus que la deuxi&#232;me classe la plus fr&#233;quente, STATE &#224; 15,4%. Cette tendance se trouve &#224; travers tous les
sous-genres, avec quelques exceptions. Premi&#232;rement, les articles d&#8217;actualit&#233;, en particulier les actualit&#233;s inter-
nationales et locales contiennent des proportions significatives de la classe REPORTING, avec 7% et 5,4%, res-
pectivement. Les autres sous-genres contiennent environ la moiti&#233; de cette proportion (3.1% pour le sport, 2.6%
pour les actualit&#233;s nationales, 0.8% pour les annonces et 0 pour les biographies et les n&#233;crologies). 84 des 102
(82,5%) &#233;v&#233;nements de classe REPORTING appartiennent aux sous-genres d&#8217;actualit&#233;s internationales et locales.
Cela montre l&#8217;importance d&#8217;avoir inclu ces sous-genres, qui contiennent des quantit&#233;s significatives de discours
rapport&#233;, dans le corpus. La m&#234;me tendance est apparente, m&#234;me si elle est moins marqu&#233;e, pour la classe MODAL,
qui appara&#238;t plus fr&#233;quemment dans les articles d&#8217;actualit&#233;, et dans des proportions l&#233;g&#232;rement plus faibles dans
les annonces et les actualit&#233;s sportives. Cela sugg&#232;re que la modalit&#233; est une caract&#233;ristique g&#233;n&#233;rale de la langue</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FRENCH TIMEBANK
</p>
<p>utilis&#233;e dans la description d&#8217;&#233;ventualit&#233;s, malgr&#233; une l&#233;g&#232;re corr&#233;lation avec le sous-genre du texte.
</p>
<p>Les annonces se d&#233;marquent encore par une proportion relativement &#233;lev&#233;e de la classe EVENT_CONTAINER.
Nous rappelons que cette classe est utilis&#233;e pour classifier les verbes comme avoir lieu et se passer qui prennent
un sujet &#233;v&#233;nementiel. Non seulement cette classe se trouve dans la plus grande proportion dans ce sous-genre de
texte, mais elle y appara&#238;t &#233;galement le plus fr&#233;quemment (6 occurrences contre 5 dans les actualit&#233;s nationales).
Dans les annonces, toutes les occurrences de cette classe sont utilis&#233;es pour relier le sujet &#233;v&#233;nementiel &#224; une
expression temporelle, comme dans (3-a). Cela refl&#232;te le fait que la fonction de tels documents est de pr&#233;ciser le
moment pr&#233;cis auquel des &#233;v&#233;nements auront lieu. Il est int&#233;ressant de constater que cette classe sert une tout autre
fonction dans les textes de nouvelles internationales, o&#249; elle est annot&#233;e dans des cas de localisation spatiale d&#8217;un
&#233;v&#233;nement (3-b), ou la mani&#232;re d&#8217;occurrence (3-c).
</p>
<p>(3) a. La distribution de lunettes sp&#233;ciales pour l&#8217;&#233;clipse aura lieu pour les administr&#233;s mardi 10 ao&#251;t...
b. Une violente explosion survenue dans la maison d&#8217;un membre des Brigades Ezzedine al-Qassam...
c. Le second remplace Edith Cresson, par qui le scandale est arriv&#233;...
</p>
<p>Les classes I_ACTION et I_STATE apparaissent dans des proportions assez uniformes &#224; travers les sous-genres
(hormis dans les biographies et les n&#233;crologies qui sont trop peu repr&#233;sent&#233;es). Les classes ASPECTUAL, RE-
PORTING et PERCEPTION figurent toutes dans des proportions relativement tr&#232;s basses. La disparit&#233; entre la classe
&#8220;par d&#233;faut&#8221;, OCCURRENCE, et les autres sugg&#232;re que la typologie des &#233;v&#233;nements pourrait &#234;tre affin&#233;e. Une possi-
bilit&#233; serait de distinguer plus finement les diff&#233;rentes classes aspectuelles, par exemple pour annoter la diff&#233;rence
entre les &#233;v&#233;nements duratifs et ponctuels. Cette distinction est particuli&#232;rement pertinente lorsqu&#8217;on souhaite
annoter les relations qui existent entre deux &#233;v&#233;nements. Par exemple, un &#233;v&#233;nement ponctuel peut &#234;tre temporel-
lement inclus dans un &#233;v&#233;nement duratif, mais le contraire n&#8217;est pas possible. Ces annotations sont pr&#233;vues dans
les prochaines &#233;ditions de la norme ISO-TimeML.
</p>
<p>5.2 Effets de la pr&#233;-annotation automatique
</p>
<p>Nous avons choisi d&#8217;effectuer une pr&#233;-annotation automatique des marquables dans les textes, suivie d&#8217;une cor-
rection manuelle, une pratique courante dans les projets d&#8217;annotation linguistiques (Marcus et al., 1993, p. ex.).
N&#233;anmoins, &#224; l&#8217;heure actuelle, aucune &#233;valuation des effets de la pr&#233;-annotation n&#8217;a &#233;t&#233; publi&#233;e pour la t&#226;che de
l&#8217;annotation temporelle en ISO-TimeML. Dans cette section, nous d&#233;crivons une exp&#233;rience men&#233;e pour d&#233;termi-
ner les effets de la pr&#233;-annotation dans le cadre de la cr&#233;ation du French TimeBank. Nous avons examin&#233; deux
point principaux : l&#8217;effet sur le temps d&#8217;annotation et l&#8217;&#233;ventuelle introduction par l&#8217;annotation pr&#233;alable d&#8217;un biais
sur les choix des annotateurs. L&#8217;exp&#233;rience a &#233;t&#233; effectu&#233;e sur un sous-ensemble de 8 documents (956 tokens, 121
&lt;EVENT&gt;, 27 &lt;TIMEX3&gt; et 18 &lt;SIGNAL&gt;) ayant d&#233;j&#224; &#233;t&#233; annot&#233;s en marquables8 suivant la strat&#233;gie d&#233;crite dans
la Section 4.3. Nous avons mesur&#233; le temps d&#8217;annotation manuelle &#224; 85 minutes, alors que la correction d&#8217;une
pr&#233;-annotation a &#233;t&#233; mesur&#233;e &#224; 47 minutes &#8211; une r&#233;duction presque de moiti&#233;. Cette r&#233;duction est certainement
due au fait que les balises contiennent des attributs fastidieux &#224; annoter, avec des valeurs multiples ou qui doivent
respecter un format tr&#232;s sp&#233;cifique, notamment l&#8217;attribut value des &lt;TIMEX3&gt;. La pr&#233;-annotation acc&#233;l&#232;re cette
t&#226;che en permettant &#224; l&#8217;annotateur d&#8217;effectuer une simple v&#233;rification suivie d&#8217;une correction, si n&#233;cessaire. Une
deuxi&#232;me partie de cette exp&#233;rience consistait &#224; mesurer l&#8217;influence de la pr&#233;-annotation sur les choix des anno-
tateurs, ce que nous appelons le biais9. Le biais positif repr&#233;sente les erreurs &#233;vit&#233;es par la pr&#233;-annotation et le
biais n&#233;gatif les erreurs attribuables &#224; la pr&#233;-annotation. Afin de v&#233;rifier le biais, le document pr&#233;-annot&#233; (Dp) et le
document manuellement annot&#233; (Dm) ont &#233;t&#233; compar&#233;s avec le document valid&#233; du corpus correspondant (Dr, le
document de r&#233;f&#233;rence). Pour un marquable donn&#233; (empan de balise ou attribut), si les conditions suivantes &#233;taient
remplies, la diff&#233;rence dans les annotations &#233;tait attribu&#233;e &#224; un biais positif :
</p>
<p>1. Dp et Dr ont la m&#234;me annotation,
2. Dm est diff&#233;rent de Dp et Dr,
3. Dm est jug&#233; incorrect.
</p>
<p>Le biais n&#233;gatif &#233;tait mesur&#233; de fa&#231;on similaire, mais la condition 3 &#233;tait :
3. Dm est jug&#233; correct.
8Les relations ont &#233;t&#233; enti&#232;rement annot&#233;es &#224; la main et donc cette exp&#233;rience ne s&#8217;applique pas aux relations.
9Nous pr&#233;cisons qu&#8217;il ne s&#8217;agit pas ici de la notion de biais utilis&#233;e dans le domaine des statistiques.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ANDR&#201; BITTAR, PASCAL AMSILI, PASCAL DENIS
</p>
<p>Biais positif : le biais positif introduit par la pr&#233;-annotation se voit particuli&#232;rement dans l&#8217;annotation des expres-
sions temporelles. Les erreurs manuelles pour l&#8217;annotation des &#233;v&#233;nements &#233;taient moins fr&#233;quentes. La premi&#232;re
colonne du Tableau 4 donne les erreurs d&#8217;annotation manuelle rep&#233;r&#233;es avec leur taux d&#8217;erreur10.
</p>
<p>Biais n&#233;gatif : la plupart des erreurs attribuables &#224; la pr&#233;-annotation &#233;taient commises sur les &#233;v&#233;nements. La
deuxi&#232;me colonne du Tableau 4 montre les erreurs introduites par la pr&#233;-annotation mais &#233;vit&#233;es dans l&#8217;annotation
manuelle11.
</p>
<p>Biais positif Biais n&#233;gatif
Balise Type erreur % erreur Type erreur % erreur
&lt;TIMEX3&gt; Mauvais empan 14.8 Mauvais empan 3.7
</p>
<p>type omis 25.9
value omis 18.5
Erreur de value 11
Erreur de format value 7.4
</p>
<p>&lt;EVENT&gt; Fausse balise 4.1 Balise manquante 2.5
class omis 3.3 Erreur de class 0.8
Erreur de class 5.4 Erreur de tense 0.8
Erreur de tense 2.5 Erreur de aspect 0.8
Erreur de aspect 2.5
</p>
<p>TAB. 4 &#8211; Biais positif et n&#233;gatif de la pr&#233;-annotation.
</p>
<p>On voit que le nombre d&#8217;erreurs introduites par la pr&#233;-annotation et non rep&#233;r&#233;es pendant la correction manuelle
est relativement bas. Cela sugg&#232;re que la pr&#233;-annotation a introduit peu d&#8217;erreurs, mais aussi que les annotateurs
sont rest&#233;s vigilants pour corriger celles qui restaient. Ces r&#233;sultats montrent que la pr&#233;-annotation apporte plus
d&#8217;avantages que d&#8217;inconv&#233;nients, notamment en r&#233;duisant de fa&#231;on significative le temps d&#8217;annotation et le taux
d&#8217;erreur humaine.
</p>
<p>6 Conclusion
</p>
<p>Dans cet article, nous avons pr&#233;sent&#233; le French TimeBank (FTiB), un corpus de r&#233;f&#233;rence sur la temporalit&#233; pour
le fran&#231;ais. Cette ressource est librement disponible et adh&#232;re &#224; la norme ISO-TimeML pour l&#8217;annotation tempo-
relle. Bien qu&#8217;encore de taille modeste (un quart des tokens du TimeBank anglais), le FTiB devrait n&#233;anmoins
grandement favoriser le d&#233;veloppement et l&#8217;&#233;valuation des syst&#232;mes pour le fran&#231;ais. Bien &#233;videmment, ce corpus
va permettre l&#8217;usage de syst&#232;mes bas&#233;s sur l&#8217;apprentissage automatique, mais il fournit &#233;galement un mat&#233;riau
int&#233;ressant pour approfondir les &#233;tudes linguistiques sur la temporalit&#233;, ce que nous avons modestement entam&#233;
dans cet article. Par exemple, la d&#233;tection du genre textuel pourrait tirer parti de caract&#233;ristiques distributionnelles
des expressions temporelles et &#233;v&#233;nementielles, comme sugg&#232;re l&#8217;&#233;tude pr&#233;alable que nous avons &#233;voqu&#233;e ici. Les
analyses pr&#233;liminaires des donn&#233;es que nous avons pr&#233;sent&#233;es ont fourni un premier aper&#231;u du contenu du corpus.
</p>
<p>La constitution de ce corpus nous a permis de tirer un certain nombre d&#8217;enseignements sur l&#8217;annotation temporelle,
et l&#8217;annotation s&#233;mantique en g&#233;n&#233;ral. Tout d&#8217;abord, nous avons pu constater que la norme ISO-TimeML semblait
relativement stable et pouvait &#234;tre appliqu&#233;e au fran&#231;ais, moyennant une s&#233;rie d&#8217;amendements et enrichissements
(certains de ceux-ci d&#233;passent d&#8217;ailleurs le cadre strict du fran&#231;ais et ont une vocation multilingue). Ce travail nous
a aussi conduit &#224; discuter le principe d&#8217;annotation surfacique : il s&#8217;agit d&#8217;un principe souhaitable : il permet de
rester neutre vis-&#224;-vis des th&#233;ories linguistiques du temps et de l&#8217;aspect (particuli&#232;rement nombreuses...), et aussi
de conserver les ambigu&#239;t&#233;s, pour permettre leur &#233;tude en tant que telles. Mais il doit &#234;tre tout aussi clair qu&#8217;une
annotation intrins&#232;quement surfacique reviendrait &#224; ne marquer que ce qui est d&#233;j&#224; visible, et par cons&#233;quent ne
serait pas tr&#232;s utile. Nous avons donc fr&#233;quemment &#233;t&#233; conduits &#224; introduire de l&#8217;interpr&#233;tation dans l&#8217;annotation,
en essayant de bien d&#233;limiter les cas concern&#233;s. C&#8217;est sur ce fil entre annotation redondante et surinterpr&#233;tation
que doit se tenir, nous semble-t-il, toute entreprise d&#8217;annotation s&#233;mantique.
</p>
<p>Comme nous l&#8217;avons montr&#233;, la construction du FTiB a &#233;t&#233; le fruit d&#8217;une m&#233;thodologie r&#233;fl&#233;chie, bas&#233;e sur
un &#233;chantillonnage rigoureux et des cycles d&#8217;annotations combinant pr&#233;-&#233;tiquetage automatique et annotations/
</p>
<p>10Le taux d&#8217;erreur est calcul&#233; comme le nombre d&#8217;erreurs divis&#233; par le total de balises manuellement annot&#233;es &#215; 100.
11Cette fois, le taux d&#8217;erreur est calcul&#233; comme le nombre d&#8217;erreurs divis&#233; par le nombre de balises dansDr &#215; 100.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>FRENCH TIMEBANK
</p>
<p>corrections humaines. Cette m&#233;thodologie a fourni des r&#233;sultats positifs, notamment en termes de r&#233;duction du
temps d&#8217;annotation et du taux d&#8217;erreur humaine. Notre d&#233;marche pourrait &#234;tre suivie pour la cr&#233;ation de cor-
pus similaires au FTiB, ou dans d&#8217;autres t&#226;ches d&#8217;annotation. Notre exp&#233;rience argumente en faveur d&#8217;une pr&#233;-
annotation automatique suivie d&#8217;une correction par des annotateurs humains et on pourrait envisager de tirer profit
des donn&#233;es existantes afin d&#8217;annoter le reste du corpus avec un syst&#232;me statistique.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; r&#233;alis&#233; pendant le doctorat d&#8217;Andr&#233; Bittar, dans le laboratoire ALPAGE, sous la direction de Lau-
rence Danlos, Pascal Amsili et Pascal Denis. Les auteurs souhaitent remercier, pour leur contribution &#224; diff&#233;rents
stades de ce travail, Philippe Muller, Michel Gagnon, et Gabriel Parent, sans oublier, bien s&#251;r, Laurence Danlos.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ALLEN J. F. (1983). Maintaining Knowledge About Temporal Intervals. In Communications of the ACM,
volume 26, p. 832&#8211;843.
</p>
<p>BACH E. (1986). The algebra of events. Linguistics and Philosophy, 9(1).
BITTAR A. (2010a). Building a TimeBank for French : a reference corpus annotated according to the ISO-
TimeML standard. PhD thesis, Universit&#233; Paris Diderot, Paris, France.
</p>
<p>BITTAR A. (2010b). ISO-TimeML Annotation Guidelines for French. Alpage-Universit&#233; Paris Diderot, Paris,
France.
</p>
<p>CASELLI T. (2008). It-TimeML : TimeML Annotation Guidelines for Italian, Version 1.0. Rapport interne,
Instituto di Linguistica Computazionale, C.N.R.
</p>
<p>GROSS M. (2002). Les d&#233;terminants num&#233;raux, un exemple : les dates horaires. Langages, (145), 21&#8211;38.
</p>
<p>HATHOUT N., NAMER F. &amp; DAL G. (2002). An Experimental Constructional Database : The MorTAL Project.
In P. BOUCHER, Ed., Many Morphologies, p. 178&#8211;209. Somerville, Mass., USA : Cascadilla.
</p>
<p>ISO (2008). ISO DIS 24617-1 : 2008 Language Resource Management - Semantic Annotation Framework
- Part 1 : Time and Events. International Organization for Standardization, ISO Central Secretariat, Geneva,
Switzerland.
</p>
<p>KAMP H. &amp; ROHRER C. (1983). Temporal reference in french. Manuscrit, Universit&#228;t Stuttgart.
</p>
<p>MARCUS M. P., SANTORINI B. &amp; MARCINKIEWICZ M. A. (1993). Building a Large Annotated Corpus of
English : The Penn Treebank. Computational Linguistics, 19(2), 313&#8211;330.
NASR A., B&#201;CHET F. &amp; REY J.-F. (2010). MACAON : Une cha&#238;ne linguistique pour le traitement de graphes
de mots. In Actes de TALN 2010, Montreal, Canada.
</p>
<p>PALMER F. R. (1986). Mood and Modality. Cambridge, UK : Cambridge University Press.
</p>
<p>PARENT G., GAGNON M. &amp; MULLER P. (2008). Annotation d&#8217;expressions temporelles et d&#8217;&#233;v&#233;nements en
fran&#231;ais. In Actes de TALN 2008, Avignon, France.
</p>
<p>PAUMIER S. (2008). Unitex 2.0 User Manual. Universit&#233; Paris-Est Marne-la-Vall&#233;e, Marne-la-Vall&#233;e, France.
</p>
<p>PUSTEJOVSKY J., HANKS P., SAUR&#205; R., SEE A., GAIZAUSKAS R., SETZER A., RADEV D., SUNDHEIM B.,
DAY D., FERRO L. &amp; LAZO M. (2003). The TIMEBANK Corpus. In Proceedings of Corpus Linguistics 2003,
p. 647&#8211;656.
</p>
<p>PUSTEJOVSKY J., VERHAGEN M., SAUR&#205; R., LITTMAN J., GAIZAUSKAS R., KATZ G., MANI I., KNIPPEN
R. &amp; SETZER A. (2006). TimeBank 1.2. Linguistic Data Consortium.
</p>
<p>TANNIER X. &amp; MULLER P. (2008). Evaluation Metrics for Automatic Temporal Annotation of Texts. In E. L.
R. A. (ELRA), Ed., Proceedings of the Sixth International Language Resources and Evaluation (LREC&#8217;08),
Marrakech, Morocco.
</p>
<p>VENDLER Z. (1967). Linguistics and Philosophy. Ithaca, N.Y. : Cornel University Press.</p>

</div></div>
</body></html>