<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Un syst&#232;me de d&#233;tection d&#8217;opinions fond&#233; sur l&#8217;analyse syntaxique profonde</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
 
</p>
<p>Un syst&#232;me de d&#233;tection d&#8217;opinions fond&#233; sur l&#8217;analyse syntaxique 
profonde 
</p>
<p>Caroline Brun 
</p>
<p>Xerox Research Centre Europe, 6 chemin de Maupertuis, 38240 Meylan, France 
Caroline.Brun@xrce.xerox.com 
</p>
<p>R&#233;sum&#233; : Dans cet article, nous pr&#233;sentons un syst&#232;me de d&#233;tection d&#8217;opinions construit &#224; partir 
des sorties d&#8217;un analyseur syntaxique robuste produisant des analyses profondes. L&#8217;objectif de ce 
syst&#232;me est l&#8217;extraction d&#8217;opinions associ&#233;es &#224; des produits (les concepts principaux) ainsi 
qu&#8217;aux concepts qui leurs sont associ&#233;s (en anglais &#171;features-based opinion extraction&#187;). Suite &#224; 
une &#233;tude d&#8217;un corpus cible, notre analyseur syntaxique est enrichi par l&#8217;ajout de polarit&#233; aux 
&#233;l&#233;ments pertinents du lexique et par le d&#233;veloppement de r&#232;gles g&#233;n&#233;riques et sp&#233;cialis&#233;es 
permettant l&#8217;extraction de relations s&#233;mantiques d&#8217;opinions, qui visent &#224; alimenter un mod&#232;le de 
repr&#233;sentation des opinions. Une premi&#232;re &#233;valuation montre des r&#233;sultats tr&#232;s encourageants, 
mais de nombreuses perspectives restent &#224; explorer. 
</p>
<p>Abstract: In this paper, we present an opinion detection system built on top of a deep robust 
syntactic parser. The goal of this system is to extract opinions associated to products but also to 
characteristics of these products, i.e. to perform feature-based opinion extraction. To carry out 
this task, and following the results of a target corpus study, the robust syntactic analyzer is 
enriched by the association of polarity to pertinent lexical elements and by the development of 
generic rules extracting semantic relations of opinions, in order to feed an opinion representation 
model. A first evaluation gave very encouraging results, but many perspectives remain to be 
explored. 
</p>
<p>Mots-cl&#233;s : d&#233;tection d&#8217;opinions, analyse de sentiments, analyse syntaxique robuste, extraction 
d&#8217;information 
Keywords: opinion detection, sentiment analysis, robust parsing, information extraction 
</p>
<p>1 Introduction  
</p>
<p>La fouille d&#8217;opinions (parfois aussi qualifi&#233;e d&#8217;analyse de sentiments) fait l&#8217;objet d&#8217;un engouement tout 
particulier que ce soit dans les milieux acad&#233;miques ou dans l&#8217;industrie. En effet, avec l&#8217;&#233;mergence de 
groupes de discussions, forums, blogs, sites compilant des avis consommateur, on trouve une masse tr&#232;s 
importante de documents contenant des informations exprimant des opinions, constituant une source 
&#233;norme de donn&#233;es pour des applications de veille diverses (technologique, marketing, concurrentielle, 
soci&#233;tale). De nombreux travaux de recherche, &#224; la crois&#233;e du TALN et de la fouille de donn&#233;es, se 
penchent sur le probl&#232;me de la d&#233;tection d&#8217;opinions. Dans cet article, nous pr&#233;sentons le syst&#232;me de 
d&#233;tection d&#8217;opinions d&#233;velopp&#233; pour l&#8217;anglais dans le cadre du projet europ&#233;en Scoop1
</p>
<p>                                                          
1 http://www.scoopproject.eu/overview.html 
</p>
<p>, syst&#232;me bas&#233; sur 
l&#8217;utilisation d&#8217;un analyseur syntaxique robuste adapt&#233; &#224; l&#8217;analyse des opinions. Apr&#232;s une br&#232;ve revue des 
travaux du domaine, nous d&#233;crirons l&#8217;analyse de corpus que nous avons r&#233;alis&#233;e, sur un premier corpus 
cible constitu&#233; de revues sur des imprimantes, photocopieurs et scanners extraits du site de revues grand 
public &#8220;Epinion&#8221;, et qui a conduit &#224; la conception et au d&#233;veloppement du syst&#232;me, lui-m&#234;me d&#233;crit en 
d&#233;tails dans la section suivante. Nous pr&#233;senterons ensuite l&#8217;&#233;valuation pr&#233;liminaire de ce syst&#232;me et 
conclurons sur le bilan et les perspectives envisag&#233;es.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAROLINE BRUN 
 
</p>
<p>2 Travaux en fouille d&#8217;opinions 
</p>
<p>Outre les travaux concernant la constitution de ressources lexicales pour l&#8217;analyse d&#8217;opinions, &#233;voqu&#233;s 
dans la section 4.2.2, deux groupes de travaux autour de la fouille d&#8217;opinions se distinguent : ceux visant &#224; 
classifier les textes selon une polarit&#233; globale (positive, n&#233;gative et quelquefois neutre), g&#233;n&#233;ralement 
bas&#233;s sur des approches supervis&#233;es (comme (Pang et al. 2002), ou (Charton et Acuna-Agost 2007)), et 
ceux visant &#224; l&#8217;extraction pr&#233;cise d&#8217;opinions exprim&#233;es sur des aspects positifs ou n&#233;gatifs. Ces derniers 
consid&#232;rent qu&#8217;un concept principal (par exemple, un produit) se compose de plusieurs concepts associ&#233;s 
que l&#8217;on peut &#233;valuer s&#233;par&#233;ment (par exemple, qualit&#233;, vitesse d&#8217;impression, et r&#233;solution pour une 
imprimante). Notre syst&#232;me se situe dans cette cat&#233;gorie. Le but ici est de d&#233;tecter les concepts associ&#233;s 
(caract&#233;ristiques d&#8217;un produit) ainsi que les opinions &#233;mises &#224; propos de ces concepts. On distingue donc 
trois sous-t&#226;ches : l&#8217;extraction des concepts associ&#233;s, la d&#233;couverte des opinions (positive, n&#233;gative et 
parfois neutre), et la production d&#8217;un r&#233;sum&#233; des informations associ&#233;es &#224; un concept donn&#233;. Pour extraire 
les concepts associ&#233;s, les m&#233;thodes se basent g&#233;n&#233;ralement sur des crit&#232;res de fr&#233;quence coupl&#233;s &#224; des 
heuristiques linguistiques (Yi et al. 2003), (Popescu and Etzioni 2005). Pour associer les opinions aux 
concepts, (Hu et Liu 2004) extraient les segments contenant un concept et additionnent les orientations du 
vocabulaire d&#8217;opinion pr&#233;sent dans le m&#234;me segment. (Vernier et al. 2009) proposent une m&#233;thode 
symbolique de d&#233;tection et de cat&#233;gorisation des &#233;valuations localement exprim&#233;es dans un corpus de 
blogs multi-domaine. Certains syst&#232;mes utilisent des d&#233;pendances syntaxiques pour relier source et cible 
de l&#8217;opinion comme (Kim and Hovy 2006) ou (Bloom et al. 2007). Notre syst&#232;me se situe dans cette 
famille, car le traitement syntaxique de ph&#233;nom&#232;nes complexes (n&#233;gation, comparaison, d&#233;pendances &#224; 
longue distance) semble une &#233;tape n&#233;cessaire &#224; l&#8217;extraction fine d&#8217;opinions.  Une particularit&#233; de notre 
syst&#232;me est son architecture &#224; deux niveaux : un premier niveau, g&#233;n&#233;ral et valide sur tout type de corpus, 
et un deuxi&#232;me niveau, adapt&#233; pour chaque sous-domaine d&#8217;application.  
</p>
<p>3 Analyse de corpus 
</p>
<p>Nous avons utilis&#233; un corpus de revues &#8220;grand public&#8221;, disponibles sur le site web &#8220;Epinion&#8221; 
(http://www.epinions.com/), un site g&#233;n&#233;raliste compilant des millions de revues concernant produits, 
films, livres, etc. La premi&#232;re application vis&#233;e par notre syst&#232;me concernant les revues d&#8217;utilisateurs 
d&#8217;imprimantes en anglais, nous avons extrait de ce site environ 3500 revues d&#8217;imprimantes. Ces revues, 
semi structur&#233;es, contiennent : le nom du produit, la note globale (de 0 &#224; 5 &#233;toiles), le titre de la revue, la 
date de cr&#233;ation, les &#171;Pros&#187;, &#171;Cons&#187; et &#171;Bottom line&#187;, et la revue compl&#232;te en texte libre, se terminant par 
la mention &#8220;Recommended&#8221; : &#8220;yes&#8221; ou bien &#8220;no&#8221;. Une &#233;tude men&#233;e sur une centaine de ces revues 
(choisies au hasard), servant de corpus de d&#233;veloppement au syst&#232;me, confirme deux &#233;l&#233;ments capitaux : 
</p>
<p>1. Un ensemble de ph&#233;nom&#232;nes linguistiques complexes sont mis en jeu dans l&#8217;expression des opinions 
et montrent que la seule polarit&#233; (positive ou n&#233;gative) associ&#233;e &#224; des mots cl&#233;s est insuffisante pour la 
d&#233;tection fine d&#8217;opinions : 
&#8226; La n&#233;gation, lexicale ou syntaxique, qui inverse la polarit&#233; des opinions : (i) I can&#8217;t use it without 
</p>
<p>problems. (ii) There is no way I can recommend this printer. 
&#8226; La modalit&#233;, qui affecte le caract&#232;re av&#233;r&#233; des opinions exprim&#233;es: (i) Considering the high cost 
</p>
<p>of the printer, the quality should be outstanding and there should be no problems. 
&#8226; La comparaison, exprimant une opinion comparative entre deux elements: (i) I would be happier 
</p>
<p>with a better price, (ii) Performance is better than many competing lasers. 
&#8226; La cor&#233;f&#233;rence, pour la d&#233;tection du sujet de l&#8217;opinion : sur l&#8217;exemple suivant, l&#8217;auteur r&#233;f&#232;re &#224; 
</p>
<p>d&#8217;autres produits (mentions soulign&#233;es) qui ne sont pas le sujet de la revue (mentions en gras) : (i) 
Xerox DocuPrint P8ex Laser Printer: When my previous printer (HP LaserJet 5) did not last as 
long as I would like it to have lasted, I had many options for a new printer. I had one functional 
HP remaining, one NEC and then I bought this Xerox P8ex. I have since purchased another 
Xerox laser all-in-one
</p>
<p>2. Concernant le vocabulaire d&#8217;opinion, il est n&#233;cessaire de tenir compte des probl&#232;mes : 
 because I was quite satisfied with the performance of the P8ex.  
</p>
<p>&#8226; D&#8217;ambigu&#239;t&#233;s, car un mot d&#8217;un m&#234;me domaine peut selon les contextes indiquer des opinions de 
polarit&#233;s diff&#233;rentes, comme l&#8217;adjectif &#8220;fast&#8221; dans le domaine des imprimantes : (i) It uses ink 
twice as fast. [opinion n&#233;gative], (ii)It is also a fast, high quality printer. [opinion positive]  
</p>
<p>&#8226; De polarit&#233; d&#233;pendante du domaine : (i) It walks like a lemon and quacks like a lemon : Dans le 
domaine des produits, &#8220;lemon&#8221; est n&#233;gatif, alors que c&#8217;est un mot objectif (neutre) en g&#233;n&#233;ral.  
</p>
<p>Suivant cette &#233;tude, notre syst&#232;me est con&#231;u selon une architecture &#224; deux niveaux, un premier niveau 
contenant du vocabulaire de polarit&#233; invariante selon les domaines, et des r&#232;gles g&#233;n&#233;riques, puis un </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN SYSTEME DE DETECTION D&#8217;OPINIONS FONDE SUR L&#8217;ANALYSE SYNTAXIQUE PROFONDE 
 
 
</p>
<p>deuxi&#232;me niveau, contenant du vocabulaire de polarit&#233; li&#233;e au domaine et des r&#232;gles &#233;galement sp&#233;cifiques 
au domaine. 
</p>
<p>4 Descr iption du syst&#232;me  
</p>
<p>4.1 Objectifs et mod&#232;le adopt&#233;  
</p>
<p>Nous souhaitons d&#233;velopper un syst&#232;me d&#8217;extraction d&#8217;opinions sur des revues de produits. Notre objectif 
est de classer les revues comme positives ou n&#233;gatives (opinion au niveau du document), mais aussi 
d&#8217;extraire finement les opinions &#233;mises sur les concepts principaux (les imprimantes) et associ&#233;s au produit 
(vitesse, qualit&#233; d&#8217;impression etc., pour une imprimante). En effet, au del&#224; d&#8217;une opinion globale, positive 
ou n&#233;gative, il est tr&#232;s int&#233;ressant de d&#233;tecter ce que les utilisateurs aiment ou au contraire n&#8217;aiment pas 
dans un produit donn&#233;. Pour atteindre cet objectif, nous adoptons la repr&#233;sentation formelle d&#8217;une opinion 
propos&#233;e par (Liu, B. 2010), sous forme d&#8217;un quintuplet de la forme  o&#249; :  est le 
concept principal cible de l&#8217;opinion (=l&#8217;objet),  est un concept associ&#233; au concept principal , 
</p>
<p> est la valeur de l&#8217;opinion (positive, n&#233;gative ou neutre) &#233;mise par 
 sur le concept , et  est le moment o&#249; l&#8217;opinion est exprim&#233;e. Nous proposons d&#8217;instancier, &#224; partir 
</p>
<p>des r&#233;sultats de l&#8217;analyse syntaxique profonde fournie par XIP, des relations s&#233;mantiques alimentant des 
quintuplets conformes &#224; ce mod&#232;le formel.  
</p>
<p>4.2 Descr iption des d&#233;veloppements 
</p>
<p>Notre syst&#232;me d&#8217;extraction d&#8217;opinions utilise l&#8217;analyseur syntaxique XIP, (Ait-Mokthar et al., 2002), qui 
produit, de fa&#231;on robuste, une repr&#233;sentation syntaxique profonde (contr&#244;le des infinitives, normalisation 
de la forme passive, etc.) et int&#232;gre un module de reconnaissance des entit&#233;s nomm&#233;es, (Brun &amp; Ehrmann 
2009), auquel nous avons int&#233;gr&#233; la reconnaissance des noms d&#8217;imprimantes, pour les besoins de ce projet. 
Nous cherchons &#224; extraire, &#224; partir du texte d&#8217;une revue, des relations s&#233;mantiques permettant d&#8217;instancier 
les quintuplets (cf. section 4.1) mod&#233;lisant les opinions. Dans le cadre de notre application, nous 
simplifions le mod&#232;le en consid&#233;rant que le moment o&#249; l&#8217;opinion est exprim&#233;e est la date de cr&#233;ation de la 
revue et que le d&#233;tenteur de l&#8217;opinion est son auteur. De plus, s&#8217;il n&#8217;est pas explicitement mentionn&#233; dans 
la phrase, par d&#233;faut, l&#8217;objet de l&#8217;opinion est le produit revu. La valeur de l&#8217;opinion est mod&#233;lis&#233;e par un 
trait (&#8220;positif&#8221; ou &#8220;n&#233;gatif&#8221;) associ&#233; &#224; la relation de sentiment. Enfin, nous conservons dans la relation le 
pr&#233;dicat porteur de la polarit&#233;, car il peut &#234;tre utile pour une phase de normalisation s&#233;mantique ult&#233;rieure. 
Nous cherchons donc &#224; extraire des relations s&#233;mantiques de la forme : 
SENTIMENT[POLARITE](CONCEPT_PRINCIPAL,CONCEPT_ASSOCI&#201;,PR&#201;DICAT_PORTEUR), comme : 
</p>
<p>(1) &#8220;This printer is slow&#8221; &#61672; SENTIMENT[NEGATIF](printer,_, slow) 
(2) &#8220;The laser print quality is great.&#8221; &#61672; SENTIMENT[POSITIF](Default_Product, print quality, great)  
</p>
<p> 
Dans (1), le pr&#233;dicat porteur du sentiment est &#8220;slow&#8221;, le concept principal est &#8220;printer&#8221;, l&#8217;opinion 
(n&#233;gative) porte sur ce concept dans son entier (et non sur un concept associ&#233;). Dans (2), le pr&#233;dicat 
porteur du sentiment est &#8220;great&#8221;, le concept associ&#233; sur lequel porte l&#8217;opinion (positive) est &#8220;print quality&#8221; 
et comme il n&#8217;est pas explicitement mentionn&#233;, le concept principal de l&#8217;opinion est l&#8217;objet de la revue 
(Default_product). Nous avons implant&#233; un lexique de vocabulaire porteur d&#8217;opinion, et des r&#232;gles 
d&#8217;extraction de relations s&#233;mantiques de sentiments, selon l&#8217;architecture &#224; deux niveaux propos&#233;e dans la 
section 3. 
</p>
<p>4.2.1  Extraction des concepts associ&#233;s 
</p>
<p> Les objets cibles de notre application sont les produits comment&#233;s dans les revues. Le vocabulaire qui les 
d&#233;signe est : printer, copier, scanner, machine, product. Afin d&#8217;extraire les concepts associ&#233;s &#224; ces objets, 
nous utilisons une m&#233;thode proche de (Popescu and Etzioni 2005), qui cherchent des relations de 
m&#233;ronymie (partie-tout). Nous utilisons XIP pour extraire automatiquement les noms les plus fr&#233;quents qui 
modifient un concept principal selon les deux relations syntaxiques suivantes : MOD-
ANTEPOSE(CONCEPT_PRINCIPAL,CONCEPT-CANDIDAT-ASSOCIE) correspondant &#224; &#8220;printer quality&#8221;, pour 
lequel &#8220;quality&#8221; est le candidat, et MOD-PREP[OF](CONCEPT-CANDIDAT-ASSOCIE,CONCEPT_PRINCIPAL), 
correspondant &#224; &#8220;the speed of the machine&#8221;, pour lequel &#8220;speed&#8221; est le candidat. 736 candidats concepts 
associ&#233;s sont ainsi extraits, avec leur fr&#233;quence. Nous consid&#233;rons ensuite qu&#8217;un candidat est effectivement 
un concept associ&#233; s&#8217;il est au moins une fois en relation attributive avec les adjectifs &#8220;good&#8221; et &#8220;bad&#8221; dans </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAROLINE BRUN 
 
</p>
<p>le corpus. Ces relations attributives sont extraites automatiquement du corpus avec XIP. Au final, nous 
obtenons une liste de 76 concepts associ&#233;s, les plus fr&#233;quents &#233;tant : quality, speed, photo, color, software, 
cartridge, price, resolution, &#8230; Une v&#233;rification manuelle permet de constater que ce sont bien des 
concepts associ&#233;s d&#233;signant des parties mat&#233;rielles (cartridge, drum), des caract&#233;ristiques techniques 
(performance, resolution, speed), ou des concepts voisins (price, support, warranty). 
</p>
<p>4.2.2 Constitution du lexique de vocabulaire d&#8217;opinion 
</p>
<p>La constitution d&#8217;un vocabulaire subjectif encodant les polarit&#233;s (positives ou n&#233;gatives) est une n&#233;cessit&#233; 
pour toute application de fouille d&#8217;opinion. Ce vocabulaire est constitu&#233; d&#8217;adjectifs (&#8220;beautiful&#8221;, &#8220;ugly&#8221;), 
de noms (&#8220;talent&#8221;, &#8220;nuisance&#8221;), de verbes (&#8220;love&#8221;, &#8220;hate&#8221;) et d&#8217;adverbes, (&#8220;admirably&#8221;, &#8220;annoyingly&#8221;). De 
nombreux travaux s&#8217;attaquent &#224; ce probl&#232;me. Par exemple, (Agarwal et Bhattacharyaa 2006) classent des 
adjectifs selon leur polarit&#233; en calculant leur degr&#233; d&#8217;association avec des adjectifs &#8220;d&#233;clencheurs&#8221; de 
polarit&#233; connue. (Vegnaduzzo 2004) utilise aussi des adjectifs d&#233;clencheurs et une m&#233;thode 
distributionnelle bas&#233;e sur la syntaxe. (Esuli et Sebastiani 2006) d&#233;veloppent SentiWordnet : ils analysent 
quantitativement les d&#233;finitions associ&#233;es aux synsets avec diff&#233;rents classifieurs statistiques, et associent 
des mesures de positivit&#233;, n&#233;gativit&#233; et objectivit&#233; &#224; chaque synset. Nous n&#8217;avons pas utilis&#233; SentiWordnet 
dans le cadre de notre application, car l&#8217;ambigu&#239;t&#233; de chaque entr&#233;e lexicale de Wordnet est pr&#233;serv&#233;e. Ne 
disposant pas non plus d&#8217;un corpus manuellement annot&#233; (comme (Vernier et al. 2009)), nous avons &#224; 
nouveau utilis&#233; XIP pour extraire automatiquement sur l&#8217;ensemble du corpus, des relations syntaxiques, 
afin de s&#233;lectionner le vocabulaire potentiellement subjectif. Ce sont des relations attributives, pour 
extraire les noms et adjectifs attributs d&#8217;un concept principal ou associ&#233; ou encore du pronom &#171;I&#187;, comme 
dans &#171;the size of the printer is huge&#187; ou &#8220;I am extremely unhappy&#8221;, des relations de modifieurs ant&#233;pos&#233;s 
d&#8217;un concept principal ou associ&#233;, comme dans &#8220;It prints great photos&#187; et des relations Sujet-Verbe-Objet 
et Sujet-Verbe, pour extraire les verbes dont le sujet est un concept principal ou associ&#233;, et le compl&#233;ment 
d&#8217;objet le pronom &#8220;I&#8221;, comme dans &#8220;I am disappointed with this product&#8221;, ou des verbes dont le sujet est 
un concept principal ou associ&#233;, comme dans &#8220;This pr inter  stinks !&#8221;. Les r&#233;sultats sont filtr&#233;s selon la 
cat&#233;gorie du candidat et sa fr&#233;quence, puis la polarit&#233; ainsi que l&#8217;appartenance au lexique g&#233;n&#233;ral ou au 
lexique de domaine sont affect&#233;es manuellement. WordNet est &#233;galement utilis&#233; pour &#233;tendre avec les 
synonymes et antonymes des mots valid&#233;s. Nous obtenons 130 verbes dans le lexique g&#233;n&#233;ral et 42 dans le 
lexique sp&#233;cialis&#233;, 465 adjectifs dans le lexique g&#233;n&#233;ral et 230 dans le lexique sp&#233;cialis&#233;, et 145 noms dans 
le lexique g&#233;n&#233;ral et 42 dans le lexique sp&#233;cialis&#233;. Nous avons ainsi constitu&#233; un lexique de polarit&#233; 
&#8220;g&#233;n&#233;rique&#8221;, valable pour toute application, et un lexique li&#233; au domaine des imprimantes. Cependant, la 
seule mention des polarit&#233;s est insuffisante au d&#233;veloppement des r&#232;gles. Elles n&#233;cessitent des traits de 
sous-cat&#233;gorisation s&#233;mantique sur les pr&#233;dicats encodant la port&#233;e de l&#8217;opinion. Les traits s&#233;mantiques 
ajout&#233;s indiquent si l&#8217;opinion porte sur le sujet, (1), le compl&#233;ment d&#8217;objet des verbes, (2), ou sur certains 
compl&#233;ments pr&#233;positionnels, (3). Nous ajoutons aussi des traits s&#233;mantiques de domaine, car dans (4), 
c&#8217;est la combinaison [easy + to + verbe indiquant une fonctionnalit&#233; de l&#8217;imprimante] qui exprime une 
opinion positive : 
</p>
<p>(1)  These printers never cease to amaze me with both quality and price.  
(2)  I appreciate the swiftness of this machine.  
(3)  We have had several problems with a LaserJet 8000.  
(4) This machine was very easy to setup.  
</p>
<p>4.2.3 D&#233;veloppement du syst&#232;me de r&#232;gles  
</p>
<p>Une fois encod&#233; le vocabulaire, nous avons d&#233;velopp&#233; manuellement un ensemble de r&#232;gles, construites 
sur la sortie de l&#8217;analyse syntaxique profonde, et extrayant des relations s&#233;mantiques d&#8217;opinion. Les r&#232;gles 
sont &#233;galement divis&#233;es en deux sous-ensembles : des r&#232;gles g&#233;n&#233;riques et des r&#232;gles propres au domaine. 
Les r&#232;gles g&#233;n&#233;riques testent, pour un sch&#233;ma syntactico-s&#233;mantique donn&#233;, la pr&#233;sence de vocabulaire 
d&#8217;opinion dans les arguments, et en fonction des informations de sous-cat&#233;gorisation s&#233;mantique associ&#233;es, 
extraient la relation de sentiment correspondante. Par exemple, la r&#232;gle XIP suivante : 
</p>
<p>If (SUBJ-N(#1[polarite!polarite:!,topic-subj],#2[concept-principal]) ) 
SENTIMENT(#2,_,#1) 
</p>
<p> 
Indique que si on a d&#233;tect&#233; le sujet normalis&#233; (SUBJ-N) d&#8217;un verbe (#1) exprimant une opinion (trait 
polarite : positif ou n&#233;gatif) sur son sujet (trait de sous-cat&#233;gorisation topic-subj) sur un concept principal 
(#2, trait concept-principal), alors on cr&#233;e une relation de sentiment en utilisant la percolation </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UN SYSTEME DE DETECTION D&#8217;OPINIONS FONDE SUR L&#8217;ANALYSE SYNTAXIQUE PROFONDE 
 
 
</p>
<p>( !polarite :!) qui associe la valeur positive ou n&#233;gative selon l&#8217;orientation du verbe (#1). Cette r&#232;gle 
permet par exemple de traiter les exemples suivants : 
</p>
<p>(1) &#171;These printers never cease to amaze me.&#8221;  &#61664; SENTIMENT[POSITIF](printer,_,amaze) 
(2) &#171;I was quite disappointed with this machine&#187; &#61664; SENTIMENT[NEGATIF](machine,_,disappoint) 
Des r&#232;gles tr&#232;s similaires sont &#233;galement d&#233;velopp&#233;es dans le cas o&#249; les opinions portent sur les concepts 
associ&#233;s. Le syst&#232;me contient une soixantaine de r&#232;gles g&#233;n&#233;riques, couvrant la majorit&#233; des constructions 
rep&#233;r&#233;es lors de notre &#233;tude de corpus. 
Nous avons aussi mis l&#8217;accent sur le traitement de la n&#233;gation, en d&#233;veloppant des r&#232;gles permettant de 
traiter les cas de n&#233;gation en style t&#233;l&#233;graphique (&#8220;Not quite as fast as HP says&#8221;), d&#8217;interaction entre 
n&#233;gation et quantification (&#8220; I never had so many problems&#8221;) ou de double n&#233;gation (&#8220;I can&#8217;t say I don&#8217;t 
appreciate this printer&#8221;). Ces r&#232;gles de n&#233;gation se combinent ensuite avec les relations de sentiments d&#233;j&#224; 
extraites &#224; l&#8217;&#233;tape pr&#233;c&#233;dente pour inverser la polarit&#233;, pour les exemples du type &#8220;I really don&#8217;t like this 
feature&#8221;, &#8220;This is not a good photo printer&#8221;, etc. 
De plus, une couche de r&#232;gles sp&#233;cifiques au domaine des imprimantes a &#233;t&#233; d&#233;velopp&#233;e, traitant les 
associations du type :  
</p>
<p>(1)  &#8220;It is easy to set up.&#8221;  &#61664; SENTIMENT[POSITIF](it,_,easy-to-set-up) 
(2) &#8220;It uses a lot of ink&#8221;  &#61664; SENTIMENT[NEGATIF](it,_,use-ink) 
 Dans (1), c&#8217;est l&#8217;association [easy + to + verbe de fonctionnalit&#233; de l&#8217;imprimante] qui exprime une opinion 
positive. Dans (2), un verbe de consommation (&#171;consume&#187;, &#171;use&#187;, &#171;eat&#187;, &#8230;) ayant pour compl&#233;ment 
d&#8217;objet un consommable de l&#8217;imprimante (&#171;ink&#187;, &#171;paper&#187;, &#171;cartridge&#187;, &#8230;) indique une opinion n&#233;gative. 
Une vingtaine de r&#232;gles de ce type, bas&#233;es sur le syst&#232;me de traits s&#233;mantiques d&#233;crit dans la section 
pr&#233;c&#233;dente, testent la pr&#233;sence de telles associations et produisent la relation de sentiment adapt&#233;e.  
Enfin, une dizaine de r&#232;gles prennent en compte la structure m&#234;me des revues du site &#8220;Epinion&#8221; : elles 
permettent d&#8217;utiliser certains indices structurels (&#8220;Cons&#8221; , &#8220;Pro&#8221;, &#8220;Recommended&#8221;,&#8230;) pour le calcul des 
opinions (par exemple &#8220;Cons : none&#8221; indique une opinion positive). 
</p>
<p>5 Evaluation 
</p>
<p>Ne disposant pas d&#8217;un corpus de revues d&#8217;imprimantes annot&#233; en termes de relations d&#8217;opinions, nous 
avons mis &#224; profit la structure des revues du site &#8220;Epinion&#8221; pour faire une &#233;valuation pr&#233;liminaire &#171;gros 
grain&#187; des performances du syst&#232;me : nous comparons la recommandation finale de l&#8217;utilisateur avec le 
pourcentage global d&#8217;opinions positives ou n&#233;gatives extraites par notre syst&#232;me, sur tout type de concept, 
principal ou associ&#233;. Si la revue est favorable et que le pourcentage d&#8217;opinions positives extraites par le 
syst&#232;me est sup&#233;rieur &#224; 50%, ou &#224; l&#8217;inverse, si la revue est d&#233;favorable et que le pourcentage d&#8217;opinions 
n&#233;gatives extraites est sup&#233;rieur &#224; 50%, nous consid&#233;rerons que le syst&#232;me classe correctement la revue 
selon une opinion globale. Le tableau I montre les r&#233;sultats obtenus sur le corpus de test (3337 revues). Ces 
r&#233;sultats sont tr&#232;s encourageants car en accord avec les r&#233;sultats de l&#8217;&#233;tat de l&#8217;art obtenus pour des t&#226;ches 
similaires, cf. (Pang et al. 2002) ou (Paroubek et al. 2007). De plus, afin de valider la qualit&#233; et la 
portabilit&#233; de notre grammaire g&#233;n&#233;rale sur d&#8217;autres domaines, nous avons conduit une &#233;valuation similaire 
sur des revues de films, extraites aussi du site &#8220;Epinion&#8221;. Seuls les concepts principaux et associ&#233;s sont 
modifi&#233;s dans le lexique de domaine, et nous n&#8217;utilisons que la grammaire g&#233;n&#233;rale d&#8217;extraction 
d&#8217;opinions. Les r&#233;sultats, &#233;galement satisfaisants, sont aussi donn&#233;s sur le tableau suivant :  
</p>
<p> Revues favorables Revues d&#233;favorables Total des revues 
Corpus   Imprimantes Cin&#233;ma Imprimantes  Cin&#233;ma Imprimantes Cin&#233;ma 
nombre 2517 1343 820 420 3337 1763 
Class&#233;es positive  2440 1264 218 143 2658 1407 
Class&#233;es n&#233;gative  77 79 602 277 679 356 
pr&#233;cision 97% 94% 73.4% 66% 91% 87.5% 
</p>
<p>Tableau I : r&#233;sultats de l&#8217;&#233;valuation pour le corpus &#8220;imprimantes&#8221; et le corpus &#8220;cin&#233;ma&#8221; 
 
</p>
<p>Pour les deux &#233;valuations, le syst&#232;me a plus de difficult&#233; &#224; classer correctement les revues d&#233;favorables. Il 
y a plusieurs explications &#224; cela : tout d&#8217;abord, comme le vocabulaire d&#8217;opinion est en partie extrait &#224; partir 
des corpus, et que la proportion de revues d&#233;favorables est plus faible, il est possible qu&#8217;il y ait un 
probl&#232;me de couverture pour le vocabulaire n&#233;gatif. D&#8217;autre part, les r&#233;dacteurs semblent avoir un discours 
diff&#233;rent selon qu&#8217;ils recommandent ou non un produit ou un film : une analyse rapide des r&#233;sultats montre 
que, dans les cas d&#233;favorables, les r&#233;dacteurs ont tendance &#224; utiliser la comparaison avec d&#8217;autres produits </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CAROLINE BRUN 
 
</p>
<p>ou films qu&#8217;ils ont au contraire appr&#233;ci&#233;s. Notre syst&#232;me ne traitant que tr&#232;s partiellement la comparaison 
et n&#8217;int&#233;grant pas encore de module de cor&#233;f&#233;rence, nombre d&#8217;opinions positives exprim&#233;es sur d&#8217;autres 
produits ou films sont comptabilis&#233;es de fa&#231;on erron&#233;e au cr&#233;dit du produit/film cible de la revue.  
</p>
<p>6 Conclusion et perspectives 
</p>
<p>Dans cet article, nous pr&#233;sentons un syst&#232;me d&#8217;extraction automatique d&#8217;opinions sur des revues de 
produits en ligne, utilisant des relations syntaxiques profondes pour construire des relations s&#233;mantiques 
correspondant aux opinions exprim&#233;es dans les revues. Nous avons d&#233;velopp&#233; un lexique contenant les 
polarit&#233;s associ&#233;es au vocabulaire subjectif mais aussi une structuration en traits s&#233;mantiques, et un 
ensemble de r&#232;gles manuelles extrayant les relations d&#8217;opinion. L&#8217;&#233;valuation des performances du syst&#232;me 
sur la t&#226;che de classification des revues est tr&#232;s encourageante. Nous devons &#224; pr&#233;sent poursuivre les 
d&#233;veloppements en cours afin de prendre en compte des ph&#233;nom&#232;nes linguistiques peu couverts par notre 
syst&#232;me, &#224; savoir la modalit&#233; et les comparatives, ayant jusqu'&#224; pr&#233;sent mis l&#8217;accent sur le traitement de la 
n&#233;gation. D&#8217;autre part, une &#233;tape essentielle pour atteindre notre objectif d&#8217;extraction d&#8217;opinions sur les 
concepts associ&#233;es aux produits revus est l&#8217;int&#233;gration d&#8217;un module de cor&#233;f&#233;rence. A la suite de cela, nous 
r&#233;aliserons une &#233;valuation plus fine de nos r&#233;sultats.  
</p>
<p>R&#233;f&#233;rences  
</p>
<p>AGARWAL A., BHATTACHARYAA, P. (2006). Augmenting Wordnet with Polarity Information on 
Adjectives. 3rd International Wordnet Conference, Jeju Island, Korea, South Jeju (Seogwipo).  
AIT-MOKTHAR, S. CHANOD J.P, ROUX C. (2002). Robustness beyond Shallowness: Incremental 
Dependency Parsing. Special Issue of NLE Journal. 
</p>
<p>BLOOM, K. NAVENDU G., ARGAMON S. (2007). Extracting Appraisal Expressions. Actes de HLT-NAACL, 
Rochester, USA. 
</p>
<p>BRUN C., EHRMANN. (2009). Adaptation of a Named Entity Recognition System for the ESTER 2 
Evaluation Campaign. IEEE NLP-KE 2009, Dalian, China, Sep 24-27. 
</p>
<p>CHARTON E., ACUNA-AGOST R. (2007). Quel mod&#232;le pour d&#233;tecter une opinion? Trois propositions pour 
g&#233;n&#233;raliser l'extraction d'une id&#233;e dans un corpus, Actes du D&#233;fi Fouille de Textes, Grenoble.  
</p>
<p>ESULI A, SEBASTIANI F. (2006). SENTIWORDNET: A Publicly Available Lexical Resource for Opinion 
Mining. Actes de 5th Conference on Language Resources and Evaluation (LREC&#8217;06), pp. 417-422.  
</p>
<p>HU M., AND LIU B. (2004). Mining and summarizing customer reviews. Actes de ACM SIGKDD 
International Conference on Knowledge Discovery &amp; Data Mining (KDD-2004), Seattle, USA. 
</p>
<p>KIM S-M, HOVY E. (2006). Identifying and analyzing judgment opinions. Actes de HLT-NAACL, New-
York, USA.  
</p>
<p>LIU, B. (2010). Sentiment Analysis and Subjectivity, Handbook of Natural Language Processing,2eme ed.  
</p>
<p>PANG, B. LEE, L., VAITHYANATHAN, S. (2002). Thumbs up? Sentiment classification using machine 
learning techniques. Actes de EMNLP (Conference on Empirical Methods in Natural Language 
Processing), pages 79&#8211;86. 
</p>
<p>PAROUBEK P., BERTHELIN J.B., El AYARI S., GROUIN C., HEITZ T., HURAULT-PLANTET M., JARDINO M., 
KHALIS Z., LASTES M. (2007). R&#233;sultats de l&#8217;&#233;dition 2007 du D&#201;fi Fouille de Textes, Actes du D&#233;fi Fouille 
de Textes, Grenoble. 
</p>
<p>POPESCU, A. ETZIONI, O. (2005). Extracting product features and opinions from reviews. Actes de EMNLP 
(Conference on Empirical Methods in Natural Language Processing. 
</p>
<p>VERNIER M., MONCEAUX L., DAILLE B., DUBREIL E. (2009) Cat&#233;gorisation des &#233;valuations dans un corpus 
de blogs multi-domaine. Revue des nouvelles technologies de l'information (RNTI). 
</p>
<p>VEGNADUZZO, S. (2004). Acquisition of subjective adjectives with limited resources. Actes de AAAI spring 
symposium on exploring attitude and affect in text: Theories and applications, Stanford, USA. 
</p>
<p>YI, J. NASUKAWA T., VALERIO A., ZHANG H. (2003). Sentiment analyzer: Extracting sentiments about a 
given topic using NLP techniques. Actes d&#8217;ICDM&#8217;03: 3rd IEEE International conference on Data Mining.  </p>

</div></div>
</body></html>