<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>G&#233;n&#233;ration automatique de questions &#224; partir de textes en fran&#231;ais</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>G&#233;n&#233;ration automatique de questions &#224; partir de textes en fran&#231;ais &#8727;
</p>
<p>Louis de Viron1, 3 Delphine Bernhard1 V&#233;ronique Moriceau1, 2 Xavier Tannier1, 2
(1) LIMSI-CNRS, 91403 Orsay, France
</p>
<p>(2) Universit&#233; Paris Sud, 91405 Orsay, France
(3) Universit&#233; Catholique de Louvain, Belgique
</p>
<p>louis.deviron@student.uclouvain.be, {delphine.bernhard, moriceau, xtannier}@limsi.fr
</p>
<p>R&#233;sum&#233;. Nous pr&#233;sentons dans cet article un g&#233;n&#233;rateur automatique de questions pour le fran&#231;ais. Le
syst&#232;me de g&#233;n&#233;ration proc&#232;de par transformation de phrases d&#233;claratives en interrogatives et se base sur une
analyse syntaxique pr&#233;alable de la phrase de base. Nous d&#233;taillons les diff&#233;rents types de questions g&#233;n&#233;r&#233;es. Nous
pr&#233;sentons &#233;galement une &#233;valuation de l&#8217;outil, qui d&#233;montre que 41 % des questions g&#233;n&#233;r&#233;es par le syst&#232;me sont
parfaitement bien form&#233;es.
</p>
<p>Abstract. In this article, we present an automatic question generation system for French. The system
proceeds by transforming declarative sentences into interrogative sentences, based on a preliminary syntactic
analysis of the base sentence. We detail the different types of questions generated. We also present an evaluation of
the tool, which shows that 41 % of the questions generated by the system are perfectly well-formed.
</p>
<p>Mots-cl&#233;s : g&#233;n&#233;ration de questions, analyse syntaxique, transformation syntaxique.
</p>
<p>Keywords : question generation, syntactic analysis, syntactic transformation.
</p>
<p>1 Introduction
</p>
<p>La g&#233;n&#233;ration automatique de questions &#224; partir de textes consiste &#224; transformer automatiquement une phrase
d&#233;clarative en une phrase interrogative. Il s&#8217;agit d&#8217;une t&#226;che complexe, qui mobilise nombre de ressources et outils
du TAL tels que la d&#233;tection d&#8217;entit&#233;s nomm&#233;es, l&#8217;analyse syntaxique, la r&#233;solution d&#8217;anaphores et la simplification
de phrases. Les applications de la g&#233;n&#233;ration automatique de questions sont par ailleurs vari&#233;es : cr&#233;ation de tests
et de questionnaires &#224; choix multiples pour l&#8217;aide &#224; l&#8217;apprentissage, syst&#232;mes de dialogue homme-machine ou
de questions-r&#233;ponses interactifs. Si le domaine a &#233;t&#233; largement trait&#233; dans le monde anglophone, et ce depuis
longtemps (on retrouve un article de Wolfe (1976) qui &#233;voque d&#233;j&#224; le sujet), il n&#8217;existe pas, &#224; notre connaissance,
de travaux &#233;quivalents pour le fran&#231;ais. Nous pr&#233;sentons dans cet article un syst&#232;me de g&#233;n&#233;ration automatique de
questions pour le fran&#231;ais qui proc&#232;de par transformation d&#8217;arbre syntaxique &#224; partir de l&#8217;analyse fournie par XIP
(Ait-Mokhtar et al., 2002) afin de produire &#224; la fois des questions factuelles et des questions ferm&#233;es.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>La g&#233;n&#233;ration automatique de questions trouve son application dans deux domaines principaux :
&#8211; Les syst&#232;mes de dialogue &#224; partir de textes expositifs (Prendinger et al., 2007 ; Piwek &amp; Stoyanchev, 2010). Ces
</p>
<p>dialogues peuvent &#234;tre pr&#233;sent&#233;s comme des textes ou encore &#224; l&#8217;aide de personnages virtuels.
&#8211; Les applications &#233;ducatives : g&#233;n&#233;ration de questions ouvertes pour la compr&#233;hension de texte (Wolfe, 1976 ;
</p>
<p>Gates, 2008) ou questions &#224; choix multiple (Mitkov et al., 2006).
Les syst&#232;mes de g&#233;n&#233;ration de questions d&#233;velopp&#233;s pour l&#8217;anglais proc&#232;dent g&#233;n&#233;ralement selon le sch&#233;ma
suivant : (i) analyse morphosyntaxique et/ou syntaxique du texte source (ii) identification du syntagme cible sur
lequel portera la question, (iii) d&#233;placement du syntagme cible, (iv) remplacement du syntagme cible par le mot
interrogatif appropri&#233;, (v) inversion et accord sujet-verbe, (vi) post-traitement de la question pour g&#233;n&#233;rer une
</p>
<p>&#8727;. Ces travaux ont &#233;t&#233; partiellement financ&#233;s par OSEO dans le cadre du programme QUAERO.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOUIS DE VIRON, DELPHINE BERNHARD, V&#201;RONIQUE MORICEAU ET XAVIER TANNIER
</p>
<p>forme de surface grammaticale et bien form&#233;e (Wolfe, 1976 ; Gates, 2008 ; Heilman &amp; Smith, 2009 ; Kalady et al.,
2010). Dans tous les cas, la g&#233;n&#233;ration n&#233;cessite au minimum une analyse morphosyntaxique de la phrase source.
Il est &#233;galement utile de disposer d&#8217;informations d&#8217;ordre s&#233;mantique telles que l&#8217;&#233;tiquetage en entit&#233;s nomm&#233;es
(personne, organisation, pays, ville) ou la distinction anim&#233;-inanim&#233;. Le syst&#232;me pr&#233;sent&#233; dans cet article utilise la
m&#234;me m&#233;thode, appliqu&#233;e au fran&#231;ais.
</p>
<p>La g&#233;n&#233;ration automatique de questions est g&#233;n&#233;ralement associ&#233;e &#224; une &#233;tape de simplification qui peut se situer
en amont de la g&#233;n&#233;ration. Ainsi, Heilman &amp; Smith (2010a) d&#233;crivent un algorithme d&#8217;extraction de propositions
ind&#233;pendantes &#224; partir de phrases complexes. Pour ce faire, l&#8217;algorithme se base sur la structure de la phrase
(propositions relatives et subordonn&#233;es, adverbes, appositions...) pour la d&#233;couper et supprimer les &#233;l&#233;ments moins
significatifs 1. La simplification peut &#233;galement intervenir en fin de processus, afin d&#8217;am&#233;liorer les questions
g&#233;n&#233;r&#233;es (Gates, 2008).
</p>
<p>3 Typologie des questions g&#233;n&#233;r&#233;es
</p>
<p>En traitement automatique des langues, les travaux sur les phrases interrogatives ont surtout &#233;t&#233; effectu&#233;s dans
le cadre des syst&#232;mes de question-r&#233;ponse. Les types de questions se focalisent g&#233;n&#233;ralement sur les questions
factuelles (personne, temps, lieu, etc.), les questions de d&#233;finition (qu&#8217;est-ce que ? qui est ?) et les questions de
type liste (Dang et al., 2006 ; Giampiccolo et al., 2007). Dans notre &#233;tude, nous nous sommes limit&#233;s aux questions
factuelles et aux questions ferm&#233;es. De plus, notre syst&#232;me ne traite pas les questions de quantit&#233; (combien ?) et de
mesure (quelle taille ? quelle longueur ?).
</p>
<p>Les questions sont g&#233;n&#233;r&#233;es par transformation syntaxique de la phrase de base. Nous avons donc identifi&#233; les
constituants syntaxiques &#224; propos desquels il est pertinent de poser des questions, sur la base de notre intuition
et d&#8217;&#233;tudes linguistiques portant sur les phrases interrogatives (Langacker, 1965 ; Grevisse, 1975). De fait, ces
constituants syntaxiques constituent les r&#233;ponses attendues aux questions g&#233;n&#233;r&#233;es. Nous avons ensuite class&#233; les
constituants selon leur fonction grammaticale. Le tableau 1 d&#233;taille les r&#233;sultats de cette analyse pr&#233;alable. &#192; cette
typologie s&#8217;ajoutent les questions ferm&#233;es (dont la r&#233;ponse peut &#234;tre oui ou non), qui ne portent pas sur un &#233;l&#233;ment
sp&#233;cifique de la phrase.
</p>
<p>Fonction Type de question R&#233;alisation de la fonction
Sujet Qu&#8217;est-ce qui / Qui Groupe nominal / Pronom /
</p>
<p>Prop. infinitive / Prop. en &#171; que &#187;/
Prop. relative
</p>
<p>Compl&#233;ment d&#8217;objet direct Que Groupe nominal / Pronom /
Prop. subordonn&#233;e
</p>
<p>Compl&#233;ment d&#8217;objet indirect &#192; qui / &#192; quoi / De qui / De quoi Groupe nominal / Pronom
Attribut du sujet Comment Adjectif / Groupe nominal
Compl&#233;ment de lieu O&#249; Groupe nominal / Pronom
Compl&#233;ment de temps Quand Groupe nominal / Pronom
</p>
<p>TABLE 1 &#8211; Typologie des principales fonctions grammaticales et de leurs r&#233;alisations
</p>
<p>4 Description du syst&#232;me
</p>
<p>Nous d&#233;taillons maintenant notre syst&#232;me de g&#233;n&#233;ration de questions. Le syst&#232;me prend pour entr&#233;e des phrases en
fran&#231;ais. Les phrases passent tout d&#8217;abord par une &#233;tape de pr&#233;-traitement, comprenant toutes les op&#233;rations qui se
d&#233;roulent entre la phrase brute fournie au syst&#232;me et celle qui sera effectivement trait&#233;e. Toutes les phrases sont &#224;
la base accept&#233;es par le syst&#232;me et aucune s&#233;lection s&#233;mantique n&#8217;est donc op&#233;r&#233;e. La structure syntaxique des
questions est ensuite g&#233;n&#233;r&#233;e &#224; l&#8217;aide d&#8217;un ensemble de r&#232;gles de transformation syntaxique. Enfin, la forme de
surface des questions est obtenue &#224; partir d&#8217;un ensemble de post-traitements op&#233;rant sur la structure profonde de la
question.
</p>
<p>1. Une d&#233;monstration de l&#8217;outil est accessible en ligne : http://www.ark.cs.cmu.edu/mheilman/qg-2010-workshop/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#201;N&#201;RATION AUTOMATIQUE DE QUESTIONS POUR LE FRAN&#199;AIS
</p>
<p>4.1 Pr&#233;-traitements
</p>
<p>Simplification de phrases. La simplification de phrases est un enjeu crucial car elle permet de faciliter le
processus de g&#233;n&#233;ration et, in fine, d&#8217;obtenir des questions de meilleure qualit&#233;. La simplification automatique
constitue toutefois un domaine de recherche &#224; part enti&#232;re, n&#233;cessitant des techniques &#233;volu&#233;es. Nous nous sommes
donc limit&#233;s &#224; quelques r&#232;gles de simplification basiques qui sont destin&#233;es &#224; &#234;tre am&#233;lior&#233;es dans le futur :
suppression des portions de phrases entre parenth&#232;ses, virgules, tirets et crochets et scission des phrases au niveau
des signes de ponctuation &#171; ; &#187; et &#171; : &#187;.
</p>
<p>Construction de l&#8217;arbre syntaxique. Les phrases sont ensuite soumises &#224; une analyse syntaxique &#224; l&#8217;aide de
XIP (Xerox Incremental Parser) (Ait-Mokhtar et al., 2002), afin d&#8217;obtenir un arbre de constituants ainsi que des
informations compl&#233;mentaires utiles &#224; la g&#233;n&#233;ration de questions telles que les informations morphologiques et
l&#8217;&#233;tiquetage en entit&#233;s nomm&#233;es (villes, pays, dates, personnes, ...).
</p>
<p>Construction de syntagmes complexes et deuxi&#232;me phase de simplification. Les arbres de constituants pro-
duits par XIP ne donnent pas la structure syntaxique compl&#232;te car cette information est par ailleurs disponible sous
forme de relations de d&#233;pendance. Nous avons donc complexifi&#233; la structure de l&#8217;arbre de mani&#232;re &#224; ce qu&#8217;elle rende
compte des &#233;l&#233;ments grammaticaux n&#233;cessaires &#224; la g&#233;n&#233;ration de questions. En pratique, nous avons rassembl&#233;
sous un m&#234;me n&#339;ud les &#233;l&#233;ments qui, ensemble, r&#233;alisent une seule fonction grammaticale. Parall&#232;lement, une
fois les syntagmes complexes rep&#233;r&#233;s, nous avons supprim&#233; les &#233;l&#233;ments superflus dans la phrase, tels certains
adverbes ou syntagmes pr&#233;positionnels. En outre, quand plusieurs syntagmes nominaux sont r&#233;unis sous un m&#234;me
n&#339;ud (voir figure 1), la t&#234;te du syntagme est explicitement balis&#233;e dans l&#8217;arbre, afin d&#8217;utiliser les traits morpho-
syntaxiques de la t&#234;te ult&#233;rieurement. Les n&#339;uds sont regroup&#233;s &#224; l&#8217;aide de 25 r&#232;gles de transformation &#233;crites dans
le formalisme de Tregex et Tsurgeon et appliqu&#233;es successivement &#224; l&#8217;arbre 2. Tregex et Tsurgeon 3 sont deux outils
de manipulation d&#8217;arbres syntaxiques (Levy &amp; Galen, 2006). Tregex permet d&#8217;explorer les arbres syntaxiques via
un langage d&#8217;expressions r&#233;guli&#232;res adapt&#233; et puissant. Ce formalisme fonctionne &#224; partir d&#8217;une combinaison de
patrons utilisant principalement des relations de fratrie et de filiation entre les n&#339;uds dans l&#8217;arbre. Tsurgeon permet
de transformer la structure des arbres sur la base des n&#339;uds sp&#233;cifiques identifi&#233;s par Tregex.
</p>
<p>But : R&#233;unir sous un m&#234;me n&#339;ud NP un groupe nominal et un compl&#233;ment du nom
(ex : Le chat de Jean dort.)
&#8211; Tregex : NP=nom $+ PP=cn [&lt;&lt;/de/] (identification d&#8217;un NP suivi d&#8217;un PP dominant &#171; de &#187;)
&#8211; Tsurgeon : move cn &gt; &#8722;1 nom (d&#233;placement du groupe pr&#233;positionnel PP sous le n&#339;ud NP)
</p>
<p>TOP
</p>
<p>SENT
</p>
<p>.
</p>
<p>SC
</p>
<p>FV
</p>
<p>dort
</p>
<p>PP
</p>
<p>Jeande
</p>
<p>NP
</p>
<p>chatLe
</p>
<p>TOP
</p>
<p>SENT
</p>
<p>.
</p>
<p>SC
</p>
<p>FV
</p>
<p>dort
</p>
<p>NP
</p>
<p>PP
</p>
<p>Jeande
</p>
<p>chatLe
t&#234;te du NP
</p>
<p>FIGURE 1 &#8211; Exemple de r&#232;gle de regroupement de constituants
</p>
<p>2. Ces regroupements pourraient &#233;galement &#234;tre r&#233;alis&#233;s &#224; l&#8217;aide des relations de d&#233;pendance.
3. http://nlp.stanford.edu/software/tregex.shtml.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOUIS DE VIRON, DELPHINE BERNHARD, V&#201;RONIQUE MORICEAU ET XAVIER TANNIER
</p>
<p>4.2 G&#233;n&#233;ration de questions
</p>
<p>Structure des r&#232;gles de g&#233;n&#233;ration. Chaque r&#232;gle de g&#233;n&#233;ration se d&#233;compose en une &#233;tape d&#8217;identification
de la cible de la question et une &#233;tape de transformation. La phase d&#8217;identification utilise des expressions Tregex
pour v&#233;rifier que les constituants n&#233;cessaires &#224; la g&#233;n&#233;ration d&#8217;une question donn&#233;e soient bien pr&#233;sents dans la
phrase. S&#8217;ils sont pr&#233;sents, on les marque comme tels &#224; l&#8217;aide d&#8217;une &#233;tiquette sp&#233;cifique. Une fois les constituants
remarquables identifi&#233;s &#224; l&#8217;aide de Tregex, la phrase est soumise &#224; des transformations profondes &#224; l&#8217;aide de
Tsurgeon. Si aucune des expressions Tregex ne s&#8217;applique &#224; la phrase, alors aucune question n&#8217;est g&#233;n&#233;r&#233;e.
</p>
<p>R&#232;gles de g&#233;n&#233;ration. Le syst&#232;me comprend 9 r&#232;gles de g&#233;n&#233;ration portant sur divers constituants de la phrase
(sujet, compl&#233;ment d&#8217;objet direct, attribut du sujet, compl&#233;ment d&#8217;objet indirect, compl&#233;ment de lieu et compl&#233;ment
de temps), ainsi qu&#8217;une r&#232;gle de g&#233;n&#233;ration de questions ferm&#233;es. La figure 2 illustre la g&#233;n&#233;ration d&#8217;une question
de lieu. Les autres r&#232;gles de g&#233;n&#233;ration fonctionnent sur le m&#234;me principe.
</p>
<p>TOP
</p>
<p>SENT
</p>
<p>.
</p>
<p>PP
</p>
<p>Angleterre +PAYS +LIEUen
</p>
<p>SC
</p>
<p>FV
</p>
<p>invent&#233;e&#233;t&#233;a
</p>
<p>NP
</p>
<p>locomotiveLa
TOP
</p>
<p>SENT
</p>
<p>.
</p>
<p>SC
</p>
<p>FV
</p>
<p>invent&#233;e&#233;t&#233;a
</p>
<p>NP
</p>
<p>locomotiveLa
</p>
<p>QUESTION
</p>
<p>Angleterre +PAYS +LIEUen
</p>
<p>(a)
</p>
<p>(b) O&#249; | (c) Dans quel pays (d) a-t-elle &#233;t&#233; invent&#233;e
</p>
<p>1. Identification du compl&#233;ment de lieu :
PP=loc[&lt;&lt;/LIEU/] $&#8722;&#8722; (SC &lt; (FV=verb $&#8722;&#8722; NP=subj))
</p>
<p>2. Transformation :
(a) D&#233;placement du compl&#233;ment de lieu en t&#234;te de phrase
</p>
<p>(b) Remplacement du compl&#233;ment de lieu par &#171; o&#249; &#187;
</p>
<p>(c) Si le compl&#233;ment de lieu est un pays, une r&#233;gion, ou une ville, on peut le remplacer par, respectivement
&#171; dans quel pays &#187;, &#171; dans quelle r&#233;gion &#187; &#171; dans quelle ville &#187;. &#192; terme, une proc&#233;dure de g&#233;n&#233;ration
de paraphrases plus complexe est envisag&#233;e mais le syst&#232;me actuel se limite &#224; ces quelques r&#232;gles.
</p>
<p>(d) Inversion Sujet-Verbe avec r&#233;p&#233;tition d&#8217;un pronom, accord&#233; avec le sujet, si celui-ci n&#8217;en est pas d&#233;j&#224;
un.
</p>
<p>Exemple : La locomotive a &#233;t&#233; invent&#233;e en Angleterre.&#8658; O&#249; la locomotive a-t-elle &#233;t&#233; invent&#233;e ? Dans quel pays
la locomotive a-t-elle &#233;t&#233; invent&#233;e ?
</p>
<p>FIGURE 2 &#8211; G&#233;n&#233;ration de questions sur le compl&#233;ment de lieu.
</p>
<p>4.3 Post-traitements
</p>
<p>Les &#233;tapes de post-traitement permettent, &#224; partir de la structure profonde de la question g&#233;n&#233;r&#233;e, de r&#233;cup&#233;rer la
question de surface, nettoy&#233;e &#224; l&#8217;aide d&#8217;expressions r&#233;guli&#232;res (suppression des &#233;l&#233;ments non-textuels, tels que les
traits morpho-syntaxiques, normalisation de la casse, suppression des espaces superflus, gestion des &#233;lisions...).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>G&#201;N&#201;RATION AUTOMATIQUE DE QUESTIONS POUR LE FRAN&#199;AIS
</p>
<p>5 &#201;valuation
</p>
<p>Nous avons proc&#233;d&#233; &#224; une premi&#232;re &#233;valuation manuelle des questions g&#233;n&#233;r&#233;es &#224; partir de textes correspondant &#224;
des niveaux de difficult&#233; langagi&#232;re diff&#233;rents. Pour ce faire, trois corpus de 10 phrases chacun ont &#233;t&#233; utilis&#233;s. Le
premier sous-corpus, appel&#233; WIKI-SIMPLE, a &#233;t&#233; extrait de Wikimini et Vikidia, deux encyclop&#233;dies Web de type
Wikip&#233;dia mais adapt&#233;es aux enfants. Le deuxi&#232;me corpus, appel&#233; WIKI, est quant &#224; lui issu de Wikip&#233;dia et traite
de sujets similaires au premier, tandis que le troisi&#232;me corpus, appel&#233; PRESSE, est tir&#233; d&#8217;articles de presse en ligne.
Les phrases ont &#233;t&#233; choisies al&#233;atoirement dans les trois sources mentionn&#233;es 4.
&#192; partir de ces 30 phrases, 78 questions ont &#233;t&#233; automatiquement g&#233;n&#233;r&#233;es par le syst&#232;me (36 pour WIKI-SIMPLE,
21 pour WIKI et 21 pour PRESSE) et &#233;valu&#233;es par 9 &#224; 17 annotateurs humains diff&#233;rents 5. Les &#233;valuateurs
devaient donner une mesure de la qualit&#233; des questions g&#233;n&#233;r&#233;es, sur une &#233;chelle allant de 1 &#224; 4, la valeur 1
correspondant &#224; une question irrecevable et grammaticalement incorrecte et la valeur 4 indiquant une question
parfaite, grammaticale, bien form&#233;e et pertinente. Des explications et un exemple &#233;taient &#233;galement fournis.
</p>
<p>Le syst&#232;me de g&#233;n&#233;ration de questions obtient un score moyen de 2,87 pour toutes les questions confondues,
ce qui est sup&#233;rieur au score de 2,5 marquant le milieu de notre &#233;chelle de valeurs allant de 1 &#224; 4. De plus,
41 % des questions se voient attribuer un score majoritaire de 4 et 29,5 % un score majoritaire de 3. L&#8217;accord
inter-annotateurs, mesur&#233; &#224; l&#8217;aide du score kappa de Fleiss (Fleiss, 1971) sur chaque sous-corpus, varie de 0,3 &#224;
0,381. Ceci correspond &#224; un accord faible, mais l&#8217;accord est nettement sup&#233;rieur pour les valeurs extr&#234;mes (1 et 4)
que pour les valeurs centrales, avec un kappa maximum de 0,622. Ceci indique que la diff&#233;rence entre les valeurs
centrales &#233;tait sans doute moins bien per&#231;ue par les &#233;valuateurs et pose la question de la pertinence d&#8217;une &#233;chelle
aussi pr&#233;cise. Nous indiquons ici pour chaque score un exemple de question qui l&#8217;a obtenu majoritairement :
</p>
<p>1. Le riz est la c&#233;r&#233;ale la plus utilis&#233;e comme aliment par l&#8217;homme.&#8594; Que Le riz est plus utilis&#233;e comme
aliment par l&#8217;homme ?
</p>
<p>2. Un train est compos&#233; de plusieurs voitures (pour transporter des personnes) et/ou de plusieurs wagons (pour
transporter des marchandises), et peut &#234;tre tract&#233; par une locomotive.&#8594; De quoi Un train est-il compos&#233; et
peut &#234;tre tract&#233; par une locomotive ?
</p>
<p>3. En France, pour permettre une meilleure fr&#233;quentation de ses trains, la SNCF a mis en service le TGV en
1981.&#8594; En quelle ann&#233;e la SNCF a-t-il mis en service le TGV ?
</p>
<p>4. L&#8217;observatoire volcanologique du Piton de la Fournaise enregistre depuis le 14 ao&#251;t une augmentation
lente mais continue du nombre de s&#233;ismes.&#8594; Qu&#8217;enregistre L&#8217;observatoire volcanologique du Piton de la
Fournaise depuis le 14 ao&#251;t ?
</p>
<p>On obtient globalement de meilleurs r&#233;sultats sur les questions g&#233;n&#233;r&#233;es &#224; partir de phrases soit tr&#232;s courtes, soit
tr&#232;s longues (ce qui confirme l&#8217;int&#233;r&#234;t d&#8217;un algorithme de simplification de phrases tel que nous l&#8217;avons d&#233;velopp&#233;).
Mais les phrases longues conduisent &#224; la g&#233;n&#233;ration d&#8217;un nombre plus restreint de questions. Quant au type de
questions, on retrouve les scores les plus &#233;lev&#233;s sur les questions ferm&#233;es, de type &#171; est-ce-que &#187; (moyenne : 3,25),
puis sur les questions sur le sujet (moyenne : 2,92). Ces types sont aussi proportionnellement les plus fr&#233;quents
puisqu&#8217;ils rassemblent respectivement 22 et 24 questions (environ 60% des questions g&#233;n&#233;r&#233;es). Les autres types
obtiennent des r&#233;sultats l&#233;g&#232;rement inf&#233;rieurs (2,34 de moyenne pour les 16 questions sur le compl&#233;ment direct,
2,35 pour 7 questions sur le compl&#233;ment indirect et 2,57 pour 9 questions sur les compl&#233;ments de lieu et de temps).
</p>
<p>Quelques probl&#232;mes r&#233;currents ont pu &#234;tre identifi&#233;s suite &#224; une analyse d&#233;taill&#233;e des questions g&#233;n&#233;r&#233;es, tels que
des majuscules intempestives 6, des probl&#232;mes d&#8217;accord ou des erreurs dues aux r&#232;gles impl&#233;ment&#233;es qui donnaient
lieu &#224; l&#8217;extraction d&#8217;un syntagme cible incorrect pour la question. Parmi ceux-ci, certains &#233;taient li&#233;s &#224; l&#8217;analyseur,
conduisant par exemple &#224; un mauvais accord entre le sujet et le pronom (exemple : Quand la SNCF a-t-il mis
en service le TGV? o&#249; la SNCF est consid&#233;r&#233; comme masculin par l&#8217;analyseur). D&#8217;autres probl&#232;mes pourraient
&#234;tre r&#233;solus par l&#8217;am&#233;lioration de diff&#233;rents aspects du syst&#232;me de g&#233;n&#233;ration, en particulier par une utilisation
plus syst&#233;matique des informations sur les relations de d&#233;pendance. Notons aussi qu&#8217;une prise en compte plus
approfondie de la &#171; s&#233;mantique &#187; du texte permettrait de pr&#233;ciser davantage les questions, notamment en r&#233;solvant
les anaphores, qui forment des constituants non pertinents pour la r&#233;ponse aux questions.
</p>
<p>4. http://fr.wikimini.org, http://fr.vikidia.org, http://www.wikipedia.org
5. Pour des raisons pratiques, les questions g&#233;n&#233;r&#233;es ont &#233;t&#233; divis&#233;es en quatre parties diff&#233;rentes, &#233;valu&#233;es chacune par des annotateurs
</p>
<p>diff&#233;rents. Par ailleurs, le nombre d&#8217;annotateurs pour chaque sous-partie n&#8217;&#233;tait pas forc&#233;ment le m&#234;me.
6. Ces probl&#232;mes devraient pouvoir &#234;tre r&#233;solus assez facilement, par l&#8217;utilisation de listes de noms propres qui permettraient de d&#233;terminer
</p>
<p>les termes qui doivent conserver leur majuscule.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>LOUIS DE VIRON, DELPHINE BERNHARD, V&#201;RONIQUE MORICEAU ET XAVIER TANNIER
</p>
<p>6 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; un syst&#232;me de g&#233;n&#233;ration automatique de questions pour le fran&#231;ais. Le syst&#232;me de g&#233;n&#233;ration
proc&#232;de par transformation de phrases d&#233;claratives en interrogatives et se base sur une analyse syntaxique pr&#233;alable
de la phrase de base. Il s&#8217;agit, &#224; notre connaissance, du premier syst&#232;me de ce type pour le fran&#231;ais. Une &#233;valuation
pr&#233;liminaire a montr&#233; que les questions g&#233;n&#233;r&#233;es par le syst&#232;me sont par ailleurs de bonne qualit&#233; : 41 % d&#8217;entre
elles sont consid&#233;r&#233;es comme parfaites par des &#233;valuateurs humains. Les perspectives d&#8217;am&#233;lioration de l&#8217;outil
sont nombreuses : meilleure simplification automatique des phrases de base, utilisation plus syst&#233;matique des
relations de d&#233;pendance, reformulation des questions via la g&#233;n&#233;ration automatique de paraphrases (Tomuro, 2003),
impl&#233;mentation d&#8217;un syst&#232;me de classification automatique des questions &#224; l&#8217;aide d&#8217;un algorithme d&#8217;apprentissage
supervis&#233; (Heilman &amp; Smith, 2010b) ou encore g&#233;n&#233;ration de questions transversales au sein d&#8217;un paragraphe.
Les applications potentielles du syst&#232;me sont &#233;galement vari&#233;es : g&#233;n&#233;ration de questions pour syst&#232;mes de
question-r&#233;ponse interactifs et g&#233;n&#233;ration automatique de questionnaires pour des applications &#233;ducatives.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AIT-MOKHTAR S., CHANOD J.-P. &amp; ROUX C. (2002). Robustness beyond shallowness : incremental deep
parsing. Natural Language Engineering, 8(3), 121&#8211;144.
DANG H. T., LIN J. &amp; KELLY D. (2006). Overview of the TREC 2006 Question Answering Track. In Proceedings
of the Fifteenth Text REtrieval Conference (TREC 2006).
FLEISS J. L. (1971). Measuring nominal scale agreement among many raters. Psychological Bulletin, 76(5),
378&#8211;382.
GATES D. M. (2008). Automatically generating reading comprehension look-back strategy questions from
expository texts. Master&#8217;s thesis, Carnegie Mellon University.
GIAMPICCOLO D., FORNER P., PE&#209;AS A., AYACHE C., CRISTEA D., JIJKOUN V., OSENOVA P., ROCHA P.,
SACALEANU B. &amp; SUTCLIFFE R. (2007). Overview of the CLEF 2007 Multilingual Question Answering Track.
In A. NARDI &amp; C. PETERS, Eds., Working Notes for the CLEF 2007 Workshop, Budapest, Hungary.
GREVISSE M. (1975). Le bon usage. Grammaire francaise avec des remarques sur la langue francaise d&#8217;aujour-
d&#8217;hui. Gembloux : Duculot, 10e edition.
HEILMAN M. &amp; SMITH N. A. (2009). Question Generation via Overgenerating Transformations and Ranking.
Technical Report CMU-LTI-09-013, Language Technologies Institute, Carnegie Mellon University.
HEILMAN M. &amp; SMITH N. A. (2010a). Extracting Simplified Statements for Factual Question Generation. In
Proceedings of the 3rd Workshop on Question Generation, Pittsburgh.
HEILMAN M. &amp; SMITH N. A. (2010b). Good Question ! Statistical Ranking for Question Generation. In
Proceedings of the NAACL-HLT 2010, p. 609&#8211;617.
KALADY S., ELIKKOTTIL A. &amp; RAJARSHI D. (2010). Natural language question generation using syntax and
keywords. In Proceedings of the 3rd Workshop on Question Generation, Pittsburgh.
LANGACKER R. W. (1965). French interrogatives : a transformational description. Language, 41(4), 587&#8211;600.
LEVY R. &amp; GALEN A. (2006). Tregex and Tsurgeon : tools for querying and manipulating tree data structures.
In 5th International Conference on Language Resources and Evaluation.
MITKOV R., HA L. A. &amp; KARAMANIS N. (2006). A computer-aided environment for generating multiple-choice
test items. Natural Language Engineering, 12(2), 177&#8211;194.
PIWEK P. &amp; STOYANCHEV S. (2010). Generating Expository Dialogue from Monologue : Motivation, Corpus
and Preliminary Rules. In Proceedings of NAACL-HLT 2010, p. 333&#8211;336.
PRENDINGER H., PIWEK P. &amp; ISHIZUKA M. (2007). Automatic generation of multi-modal dialogue from text
based on discourse structure analysis. In Proceedings of ICSC-07, p. 27&#8211;34, Irvine, CA, USA.
TOMURO N. (2003). Interrogative reformulation patterns and acquisition of question paraphrases. In Proceedings
of the second international workshop on Paraphrasing, p. 33&#8211;40.
WOLFE J. H. (1976). Automatic question generation from text - an aid to independent study. SIGCUE Outlook,
Proceedings of the SIGCSE-SIGCUE joint symposium on Computer science education, 10(SI), 104&#8211;112.</p>

</div></div>
</body></html>