<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Restad : un logiciel d&#8217;indexation et de stockage relationnel de contenus XML</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Restad : un logiciel d&#8217;indexation et de stockage relationnel
de contenus XML
</p>
<p>Yoann Moreau Eric SanJuan Patrice Bellot
LIA, 339, chemin des Meinajaries 84911 AVIGNON Cedex 9
{yoann.moreau,eric.sanjuan,patrice.bellot}@univ-avignon.fr
</p>
<p>Restad 1 est un outil pour charger de grands nombres de documents XML dans une base de donn&#233;es PostgreSQL 2.
La structure XML ainsi que le contenu, y compris celui des attributs, est stock&#233; sous forme relationnelle. Cela est
fait sans aucun pr&#233;suppos&#233; sur les DTDs des fichiers et permet de g&#233;rer tous les standards XML. Il est le format le
plus courant pour des donn&#233;es semi-structur&#233;es (issues d&#8217;applications de bureautique, annot&#233;es par des analyseurs
syntaxiques, enrichies de multiples annotations s&#233;mantiques...).
</p>
<p>Restad reprend ainsi les fonctionnalit&#233;s d&#8217;importation de TopX (Theobald et al., 2005) et XRel (Yoshikawa et al.,
2001) en l&#8217;adaptant au SGBDR libre PostgreSQL et surtout, en int&#233;grant la gestion des attributs de balises.
La structure hi&#233;rarchique des documents (balises et attributs) est repr&#233;sent&#233;e de mani&#232;re relationnelle dans des
tables. Le texte du document est enregistr&#233; en tant que bloc de texte nettoy&#233; de toute balise XML. La table des
balises conserve les positions de d&#233;but et de fin de chaque balise, tandis que l&#8217;index plein-texte conserve pour
chaque mot sa position.
</p>
<p>Cette approche permet de stocker la forme et le contenu de documents XML, sans perte d&#8217;information. On peut
ensuite utiliser les index de la base pour effectuer des recherches plein-texte en r&#233;duisant les requ&#234;tes &#224; un ou
plusieurs sous ensembles de l&#8217;arborescence des documents. L&#8217;utilisation d&#8217;un SGBD offre les performances du
langage SQL pour effectuer des requ&#234;tes complexes.
</p>
<p>La premi&#232;re version de Restad est &#233;crite en Ruby et disponible sous licence GPL. Elle a &#233;t&#233; test&#233;e sur le corpus
XML de la campagne INEX 2010 de 52Go comprenant l&#8217;ensemble du wikipedia en anglais enrichi de multiples
annotations s&#233;mantiques (Schenkel et al., 2007).
La base de donn&#233;es finale, apr&#232;s cr&#233;ation de tous les index occupe un espace disque inf&#233;rieur &#224; 5 fois la taille du
corpus. L&#8217;outil permet de re-g&#233;n&#233;rer le contenu XML d&#8217;un document tr&#232;s rapidement gr&#226;ce aux index de la base.
Diff&#233;rents tests sont pr&#233;vus pour &#233;valuer les performances avec des requ&#234;tes utilisant les balises XML. L&#8217;outil
pourrait par la suite &#234;tre facilement adapt&#233; &#224; tout format de document arborescent et &#224; tout autre SGBD.
</p>
<p>Remerciements
</p>
<p>Ces recherches ont b&#233;n&#233;fici&#233; du soutien financier de l&#8217;Agence Nationale de la Recherche (ANR 2010 CORD 001
02) en faveur du projet CAAS.
</p>
<p>R&#233;f&#233;rences
</p>
<p>SCHENKEL R., SUCHANEK F. M. &amp; KASNECI G. (2007). Yawn : A semantically annotated wikipedia xml
corpus. In A. KEMPER, H. SCH&#214;NING, T. ROSE, M. JARKE, T. SEIDL, C. QUIX &amp; C. BROCHHAUS, Eds.,
BTW, volume 103 of LNI, p. 277&#8211;291 : GI.
THEOBALD M., SCHENKEL R. &amp; WEIKUM G. (2005). An efficient and versatile query engine for topx search.
In K. B&#214;HM, C. S. JENSEN, L. M. HAAS, M. L. KERSTEN, P.-&#197;. LARSON &amp; B. C. OOI, Eds., VLDB, p.
625&#8211;636 : ACM.
YOSHIKAWA M., AMAGASA T., SHIMURA T. &amp; UEMURA S. (2001). XRel : A Path-Based Approach to Storage
and Retrieval of XML.
</p>
<p>1. Relational Storage for Tagged Documents (https ://github.com/ymoreau/Restad)
2. http ://www.postgresql.org</p>

</div></div>
</body></html>