<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Construction d&#8217;un lexique des adjectifs d&#233;nominaux</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Construction d&#8217;un lexique des adjectifs d&#233;nominaux
</p>
<p>Jana Strnadov&#225;1,2 &amp; Beno&#238;t Sagot3
(1) LLF, CNRS &amp; Univ. Paris 7, 5 rue Thomas Mann, 75205 Paris Cedex 13, France
</p>
<p>(2) Univerzita Karlova, Filozofick&#225; Fakulta, n&#225;m. J. Palacha 2, 116 38 Prague, R&#233;p. Tch&#232;que
(3) Alpage, INRIA &amp; Univ. Paris 7, Rocquencourt, BP 105, 78153 Le Chesnay Cedex, France
</p>
<p>strnadjana13@gmail.com, benoit.sagot@inria.fr
</p>
<p>R&#233;sum&#233;. Apr&#232;s une br&#232;ve analyse linguistique des adjectifs d&#233;nominaux en fran&#231;ais, nous d&#233;crivons le pro-
cessus automatique que nous avons mis en place &#224; partir de lexiques et de corpus volumineux pour construire un
lexique d&#8217;adjectifs d&#233;nominaux d&#233;riv&#233;s de mani&#232;re r&#233;guli&#232;re. Nous estimons &#224; la fois la pr&#233;cision et la couver-
ture du lexique d&#233;rivationnel obtenu. &#192; terme, ce lexique librement disponible aura &#233;t&#233; valid&#233; manuellement et
contiendra &#233;galement les adjectifs d&#233;nominaux &#224; base suppl&#233;tive.
</p>
<p>Abstract. After a brief linguistic analysis of French denominal adjectives, we describe the automatic tech-
nique based on large-scale lexicons and corpora that we developed for building a lexicon of regular denominal
adjectives. We evaluate both the precision and coverage of the resulting derivational lexicon. This freely available
lexicon should eventually be fully manually validated and contain denominal adjectives with a suppletive base.
</p>
<p>Mots-cl&#233;s : Adjectifs d&#233;nominaux, d&#233;rivation morphologique, lexique d&#233;rivationnel.
</p>
<p>Keywords: Denominal adjectives, morphological derivation, derivational lexicon.
</p>
<p>1 Introduction
</p>
<p>La morphologie constructionnelle est la partie de la morphologie qui permet de cr&#233;er des lex&#232;mes &#224; partir d&#8217;autres
lex&#232;mes, et d&#8217;augmenter ainsi le lexique d&#8217;une langue. Il s&#8217;agit donc d&#8217;un proc&#233;d&#233; de structuration du lexique qui
relie des lex&#232;mes entre eux et un proc&#233;d&#233; d&#8217;extension du lexique. &#192; ce double titre, la disponibilit&#233; de ressources
lexicales d&#233;rivationnelles est cruciale &#224; la fois pour la description linguistique et pour le traitement automatique
des langues (TAL). En linguistique, les ressources lexicales enrichies de liens d&#233;rivationnels permettent une ap-
proche syst&#233;mique du lexique et des proc&#233;d&#233;s productifs de construction de lex&#232;mes. En traitement automatique
des langues, de nombreux travaux ant&#233;rieurs ont ainsi montr&#233; l&#8217;importance de la prise en compte de la morpho-
logie constructionnelle pour l&#8217;analyse des mots inconnus (n&#233;ologismes, termes techniques) et l&#8217;enrichissement
de ressources lexicales (Dal et al., 1999; Hathout &amp; Tanguy, 2005), l&#8217;analyse syntaxique (Bourigault &amp; Fr&#233;rot,
2004), mais &#233;galement dans des contextes plus applicatifs tels que les syst&#232;mes de question-r&#233;ponse (Bernhard
et al., 2011) ou de traduction automatique (Cartoni, 2009).
</p>
<p>Pour le fran&#231;ais, les noms d&#233;verbaux ont &#233;t&#233; &#233;tudi&#233;s de fa&#231;on syst&#233;matique et font l&#8217;objet d&#8217;une ressource lexicale
librement disponible, VerbAction (Tanguy &amp; Hathout, 2002). Cette ressource a &#233;t&#233; d&#233;velopp&#233;e en partie gr&#226;ce au
syst&#232;me Webaffix (Hathout &amp; Tanguy, 2005), qui utilise le Web comme un corpus pour y d&#233;tecter des lex&#232;mes
construits n&#233;ologiques. Nous nous penchons ici sur les adjectifs d&#233;nominaux, avec pour objectif de construire &#224;
terme une ressource du m&#234;me type que VerbAction, mais qui s&#8217;en distinguera entre autres par des entr&#233;es plus
d&#233;taill&#233;es (d&#233;finitions, proc&#233;d&#233; morphologique d&#233;rivationnel d&#233;taill&#233;. . .) et par la prise en compte de la d&#233;rivation
non r&#233;guli&#232;re (&#233;cole vs scolaire, cf. partie 2).
</p>
<p>Dans cet article, nous d&#233;crivons la premi&#232;re phase des travaux entrepris en ce sens. Nous nous sommes pour
l&#8217;instant concentr&#233;s sur les adjectifs d&#233;riv&#233;s &#224; partir d&#8217;une base nominale par affixation r&#233;guli&#232;re, tout en prenant en
compte les nombreuses variantes possibles selon les affixes et les bases. Apr&#232;s une &#233;tude linguistique pr&#233;liminaire
(section 2), nous d&#233;crivons nos exp&#233;riences destin&#233;es &#224; produire des liens de d&#233;rivation formels entre entr&#233;es
lexicales connues de lexiques de r&#233;f&#233;rence (section 3.2) puis entre noms connus et d&#233;riv&#233;s adjectivaux inconnus
(section 3.3). Nous estimons enfin la pr&#233;cision et la couverture des r&#233;sultats obtenus (section 4). La ressource
obtenue est librement disponible sous licence LGPL-LR comme compl&#233;ment au lexique Lefff (cf. plus bas).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JANA STRNADOV&#193; &amp; BENO&#206;T SAGOT
</p>
<p>2 Adjectifs d&#233;nominaux
Notre travail repose sur la notion de lex&#232;me telle qu&#8217;introduite par Matthews (1974). Le lex&#232;me est une unit&#233; abs-
traite multiplanaire, d&#233;finie par sa forme sur les plans phonologique et graph&#233;mique, par sa signification sur le plan
s&#233;mantique et par sa cat&#233;gorie sur le plan syntactique (Fradin, 2003). Les r&#232;gles morphologiques de construction
de lex&#232;mes doivent ensuite donner une sp&#233;cification pour chacun de ces plans.
</p>
<p>La suffixation constitue le principal proc&#233;d&#233; morphologique permettant de construire les adjectifs d&#233;nominaux 1.
Les r&#232;gles morphologiques de construction de lex&#232;mes formant des adjectifs d&#233;nominaux sp&#233;cifient les diff&#233;rents
plans du lex&#232;me base et du lex&#232;me d&#233;riv&#233;. Pour le plan graph&#233;mique, la r&#232;gle sp&#233;cifie la forme graphique du
suffixe qui doit &#234;tre ajout&#233;. Pour le plan syntactique, les r&#232;gles indiquent que le lex&#232;me base est un nom et que le
lex&#232;me d&#233;riv&#233; est un adjectif. Enfin, l&#8217;instruction s&#233;mantique port&#233;e par le proc&#233;d&#233; d&#233;rivationnel d&#233;pend en partie
du choix du suffixe. La ressource lexicale &#233;tant bas&#233;e sur le code &#233;crit, seul le plan graph&#233;mique va &#234;tre d&#233;taill&#233;
dans ce qui suit et les bases et les suffixes vont &#234;tre consid&#233;r&#233;s comme des cha&#238;nes de caract&#232;res.
</p>
<p>Du point de vue formel, les adjectifs d&#233;nominaux fran&#231;ais sont construits principalement par les suffixes sui-
vants : -aire (alimentaire), -al (artisanal), -el (nutritionnel), -esque (livresque), -eux (mousseux), -ien (rotulien),
-ier (sourcilier), -ique (folklorique) et -u (barbu). Il ne s&#8217;agit pas d&#8217;une liste exhaustive, car d&#8217;autres suffixes
peuvent d&#233;river des adjectifs &#224; partir de noms. Cependant, ils posent des contraintes sp&#233;cifiques sur les noms
bases (par exemple les suffixes -ais, -ain, -an, -ois apparaissent presque exclusivement avec les bases toponymes :
islandais, africain, castillan, lillois) ou sont plus marginaux et ils n&#8217;apparaissent que dans quelques lex&#232;mes (-ard :
campagnard). Dans la situation id&#233;alis&#233;e ou canonique, au sens de Corbett (2010), le suffixe serait simplement
concaten&#233; &#224; la base nominale. N&#233;anmoins, en fran&#231;ais, ce qui pr&#233;c&#232;de le suffixe ne correspond pas toujours &#224; un
nom base existant dans le lexique. Plusieurs cas de figure doivent &#234;tre distingu&#233;s.
</p>
<p>Pour la construction de certains adjectifs, l&#8217;addition d&#8217;un suffixe peut entra&#238;ner des modifications (graph&#233;miques)
de la base. Il s&#8217;agit notamment du d&#233;doublement de la consonne finale (poisson &gt; poissonn+eux), de la suppression
de la voyelle finale (universit&#233; &gt; universit+aire), de l&#8217;alternance de deux graph&#232;mes (adjectif &gt; adjectiv+al) ou
de la combinaison de plusieurs changements (muscle &gt; &#9702;muscl+aire &gt; muscul+aire). Comme ces cas pr&#233;sentent
une certaine r&#233;gularit&#233; au sein du syst&#232;me de la d&#233;rivation adjectivale en fran&#231;ais, il est possible de les d&#233;crire en
sp&#233;cifiant des r&#232;gles allomorphiques 2 pour les diff&#233;rents types de bases qui subissent ces modifications.
</p>
<p>Afin de pouvoir d&#233;crire tout le syst&#232;me d&#233;rivationnel des adjectifs d&#233;nominaux en fran&#231;ais, il faut r&#233;soudre un
autre probl&#232;me qui se pr&#233;sente sous forme des adjectifs qui n&#8217;ont pas &#233;t&#233; construits en fran&#231;ais, mais qui ont
&#233;t&#233; soit h&#233;rit&#233;s du latin, soit emprunt&#233;s au latin, au grec ou &#224; une autre langue. Dans ce cas, la base ressemble
formellement &#224; un nom du fran&#231;ais, mais les deux formes sont trop &#233;loign&#233;es pour qu&#8217;elles puissent &#234;tre reli&#233;es
par une r&#232;gle (moine &gt; monacal, temps &gt; temporel). Le ph&#233;nom&#232;ne se limite &#224; des lex&#232;mes particuliers ou &#224;
des petites s&#233;ries de lex&#232;mes et il est donc difficile de le d&#233;crire par des r&#232;gles g&#233;n&#233;rales. Enfin, il existe des
adjectifs dont les bases ne sont pas corr&#233;l&#233;es formellement &#224; un nom du fran&#231;ais, m&#234;me si une relation s&#233;mantique
existe (jeu - ludique, oiseau - aviaire). Ces bases dites suppl&#233;tives ou non autonomes (Corbin, 1985) sont assez
nombreuses et le domaine de la d&#233;rivation adjectivale en abonde. Les deux derniers cas sont assez proches et il est
souvent difficile de distinguer les exemples qui en rel&#232;vent. Dans les deux cas, on reconna&#238;t les suffixes mais les
bases n&#8217;apparaissent jamais comme des noms autonomes. Seule la similarit&#233; phon&#233;mique ou graph&#233;mique semble
pouvoir les diff&#233;rencier, ainsi que l&#8217;origine &#233;tymologique commune entre la base utilis&#233;e pour la d&#233;rivation et le
nom associ&#233; (tempus/temporis &gt; temps ; tempor-).
</p>
<p>3 Extraction de liens de d&#233;rivation entre noms et adjectifs d&#233;nominaux
Notre objectif est de construire une base d&#8217;adjectifs d&#233;nominaux associ&#233;s &#224; leur base nominale, que ces adjectifs
soient d&#233;j&#224; connus des ressources lexicales existantes ou non &#8212; ce qui est &#233;galement un moyen &#224; la fois de
construire de nouvelles entr&#233;es candidates &#224; ajouter au lexique et/ou d&#8217;extraire des termes techniques &#224; partir de
corpus sp&#233;cialis&#233;s. Nous sommes partis de deux ressources lexicales : (1) le Lefff (Sagot, 2010), qui repose sur
le formalisme lexical Alexina, dont la couche morphologique permet de repr&#233;senter les op&#233;rations de d&#233;rivation
applicables au sein d&#8217;une classe flexionnelle donn&#233;e (cf. ci-dessous) ; (2) Morphalou (Romary et al., 2004), que
</p>
<p>1. Les adjectifs d&#233;nominaux peuvent aussi &#234;tre construits par conversion, un proc&#233;d&#233; morphologique fond&#233; sur l&#8217;identit&#233; de la forme du
lex&#232;me base et du lex&#232;me converti. Toutefois, ce ph&#233;nom&#232;ne sort du cadre du travail d&#233;crit ici.
</p>
<p>2. Cette &#233;tude se situant au plan graph&#233;mique, la description d&#233;velopp&#233;e ici ne correspond pas &#224; ce qui est souvent consid&#233;r&#233; comme
allomorphie en linguistique o&#249; l&#8217;int&#233;r&#234;t porte sur le plan phonologique. Il est &#233;galement possible de parler de r&#232;gles de sandhi ou de r&#232;gles
morpho-phono-graph&#233;miques. Tous ces termes v&#233;hiculent l&#8217;id&#233;e de certains changements subis par le nom base lors de l&#8217;adjonction du suffixe.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CONSTRUCTION D&#8217;UN LEXIQUE DES ADJECTIFS D&#201;NOMINAUX
</p>
<p>&lt;table name=&quot;nc-2m&quot; rads=&quot;..*[&#710;sxz]&quot;&gt;
&lt;form suffix=&quot;&quot; tag=&quot;ms&quot;/&gt;
&lt;form suffix=&quot;s&quot; tag=&quot;mp&quot;/&gt;
&lt;derivation name=&quot;adj_d&#233;nominal_en_-iel&quot; suffix=&quot;&#8706;iel&quot; table=&quot;adj-l4&quot;/&gt;
&lt;derivation name=&quot;adj_d&#233;nominal_en_-iel_variante&quot; suffix=&quot;&#8706;&#8706;iel&quot; table=&quot;adj-l4&quot; rads=&quot;.*(ce|eur)&quot;/&gt;
&lt;derivation name=&quot;adj_d&#233;nominal_en_-uel&quot; suffix=&quot;&#8706;uel&quot; table=&quot;adj-l4&quot; except=&quot;.*u&quot;/&gt;
&lt;derivation name=&quot;adj_d&#233;nominal_en_-al&quot; suffix=&quot;&#8706;al&quot; table=&quot;adj-al4&quot;/&gt;
&lt;derivation name=&quot;adj_d&#233;nominal_en_-al_variante_nn&quot; suffix=&quot;nal&quot; table=&quot;adj-al4&quot; rads=&quot;.*n&quot;/&gt;
&lt;derivation name=&quot;adj_d&#233;nominal_en_-al_variante&quot; suffix=&quot;&#8706;&#8706;al&quot; table=&quot;adj-al4&quot; rads=&quot;.*(ion|eur)&quot;/&gt;
...
</p>
<p>&lt;/table&gt;
&lt;sandhi source=&quot;e_&#8706;&quot; target=&quot;_&quot;/&gt;
&lt;sandhi source=&quot;ce_&#8706;&#8706;&quot; target=&quot;t_&quot;/&gt;
</p>
<p>FIGURE 1 &#8211; Extrait de la table nc-2m des noms masculins &#224; pluriel en -s et exemples de r&#232;gles de sandhi. On note
les contraintes sur la base : ainsi, la variante -nal du suffixe -al n&#8217;est possible que sur des bases en -n, redoublant
ainsi cette consonne. Le graph&#232;me factice &#8706; est utilis&#233; dans des r&#232;gles de sandhi simulant les op&#233;rations &#224; effectuer
sur la base avant de lui ajouter l&#8217;affixe d&#233;rivationnel, comme illustr&#233; par la r&#232;gle qui efface le -e final lorsqu&#8217;il n&#8217;y
a qu&#8217;un symbole &#8706; (ferme &gt; fermier), ou la suivante, qui transforme le -c en fin de base (&#233;ventuellement apr&#232;s
&#233;limination d&#8217;un -e final) en -t (s&#233;quence &gt; s&#233;quentiel) lorsque l&#8217;affixe de d&#233;rivation est &#224; deux &#8706;.
</p>
<p>nous avons converti automatiquement dans le formalisme Alexina, en faisant en sorte que les classes flexionnelles
utilis&#233;es par cette version convertie du lexique Morphalou soient les m&#234;mes que celles du Lefff , ce qui permet
de le fl&#233;chir avec la m&#234;me description morphologique que le Lefff . &#192; partir de ces ressources, l&#8217;id&#233;e g&#233;n&#233;rale est
de g&#233;n&#233;rer un grand nombre de candidats d&#233;riv&#233;s &#224; l&#8217;aide de r&#232;gles de d&#233;rivation d&#233;crites manuellement, puis de
chercher parmi ces candidats d&#8217;une part ceux qui sont connus des lexiques de d&#233;part et d&#8217;autre part ceux dont
les formes sont bien attest&#233;es dans tel ou tel gros corpus tout en n&#8217;&#233;tant pas couvertes par les lexiques de d&#233;part.
Nous avons fait le choix de d&#233;velopper manuellement les r&#232;gles de d&#233;rivation. En effet, une approche automatique
(non supervis&#233;e) ne garantit ni la couverture des cas rares ou des variantes sp&#233;cifiques ni la qualit&#233; des r&#232;gles
extraites. En effet, ces r&#232;gles peuvent &#234;tre des r&#232;gles de d&#233;rivation valides (dont l&#8217;orientation sera du reste d&#233;licate
&#224; d&#233;terminer), mais elles peuvent &#233;galement relier diff&#233;rents d&#233;riv&#233;s d&#8217;une m&#234;me base (-ation &#8211; -able). &#192; l&#8217;inverse,
une approche manuelle permet des descriptions fines, qui prennent en compte les proc&#233;d&#233;s peu fr&#233;quents et leurs
diff&#233;rentes variantes, bien que le travail doive &#234;tre r&#233;p&#233;t&#233; pour chaque nouvelle langue.
</p>
<p>3.1 Description formalis&#233;e de la d&#233;rivation nom-adjectif
Nous avons donc tout d&#8217;abord ajout&#233; manuellement &#224; chaque classe de flexion nominale de la description mor-
phologique du Lefff l&#8217;ensemble des op&#233;rations de d&#233;rivation list&#233;es &#224; la section 2 (cf. figure 1). Pour cela, nous
utilisons diff&#233;rentes caract&#233;ristiques du formalisme morphologique d&#8217;Alexina, et notamment les suivantes.
&#8211; La possibilit&#233; de contraindre une base &#224; correspondre et/ou &#224; ne pas correspondre &#224; des motifs r&#233;guliers (par
</p>
<p>exemple, contraindre le rajout de -naire aux bases se terminant en -n) ;
&#8211; Les op&#233;rations morpho-phono-graph&#233;miques (dites r&#232;gles de sandhi) qui permettent de d&#233;finir des transforma-
</p>
<p>tions appliqu&#233;es &#224; la fronti&#232;re entre base et affixe. Ces op&#233;rations sont de deux ordres :
&#8211; d&#8217;une part des r&#232;gles d&#233;di&#233;es indiquant les op&#233;rations &#224; effectuer sur la base avant de lui ajouter l&#8217;affixe d&#233;ri-
</p>
<p>vationnel, tel que la suppression du e final (muscle &gt; muscl) ; dans certains cas, une op&#233;ration de d&#233;rivation
morphologique est d&#233;doubl&#233;e en diff&#233;rentes variantes, qui s&#233;lectionnent des affixes ou des r&#232;gles de sandhi
diff&#233;rentes : par exemple, il peut y avoir insertion d&#8217;un -t- au cours de la d&#233;rivation en -ique sur bases en -s(e)
et -ma (phrase &gt; phrastique) ou de -at- pour les bases en -m(e) (programme &gt; programmatique).
</p>
<p>&#8211; d&#8217;autre part des &#171; vraies &#187; r&#232;gles de sandhi, d&#233;j&#224; pr&#233;sentes dans la description ou rajout&#233;es pour l&#8217;occasion,
telles que -cl + aire$ &gt; -cul + aire (muscl(e) + -aire &gt; musculaire).
</p>
<p>Au total, nous avons rajout&#233; 596 r&#232;gles de d&#233;rivation r&#233;parties dans 29 tables nominales, couvrant ainsi les adjectifs
d&#233;riv&#233;s sur base nominale par diff&#233;rentes variantes de la suffixation en -el/-iel/-uel, -al/-ial, -aire/-uaire, -ique/-
tique/-atique, -esque, -u, -er/-ier et -eux/-ieux. Chacun de ces affixes est donc associ&#233; &#224; des contraintes sur les
bases admissibles, et le r&#233;sultat de cette affixation peut &#234;tre lui-m&#234;me modifi&#233; par les r&#232;gles de sandhi.
</p>
<p>3.2 Construction de relations d&#233;rivationnelles entre entr&#233;es du lexique
L&#8217;union des entr&#233;es nominales du Lefff et de Morphalou comporte 65 651 lemmes (forme citationnelle et classe
flexionnelle), qui produisent par ces r&#232;gles un total de 886 526 couples (nom base, adjectif d&#233;riv&#233;) candidats. Parmi
ces couples, 3 293 ont un adjectif d&#233;riv&#233; qui est lui aussi du Lefff ou de Morphalou. Ils concernent 2 687 adjectifs
distincts, un m&#234;me adjectif pouvant &#234;tre obtenu par d&#233;rivation &#224; partir de plusieurs bases (correctes ou non). Ces
couples sont donc des relations d&#233;rivationnelles candidates entre noms et adjectifs d&#233;j&#224; connus du lexique.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JANA STRNADOV&#193; &amp; BENO&#206;T SAGOT
</p>
<p>Type de couple (nom base, adjectif d&#233;riv&#233;) couples (base, adj. d&#233;r.) adj. distincts
Candidats produits 886 526 844 519
1. dont retenus car l&#8217;adjectif est connu du lexique (Lefff +Morphalou) 3 293 2 687
2. dont retenus apr&#232;s confrontation au corpus (adjectif soit inconnu du lexique)
</p>
<p>avant filtrage 12 140 10 064
apr&#232;s filtrage des candidats orthographiquement proches de mots connus 11 463 8 317
apr&#232;s filtrage additionnel des couples &#224; nom ou adjectif trop court 8 736 7 449
</p>
<p>Total des candidats retenus 12 029 9 692
</p>
<p>TABLE 1 &#8211; R&#233;sultats quantitatifs de l&#8217;extraction de couples (base nominale, adjectif d&#233;riv&#233;).
</p>
<p>3.3 Identification en corpus d&#8217;adjectifs inconnus du lexique d&#233;riv&#233;s de noms connus
Un certain nombre des 883 233 couples (nom base, adjectif d&#233;riv&#233;) produits pr&#233;c&#233;demment et dont l&#8217;adjectif est
inconnu du Lefff comme de Morphalou sont corrects. Pour les identifier automatiquement, nous avons confront&#233;
les formes fl&#233;chies des adjectifs concern&#233;s l&#8217;union de trois corpus tous volumineux mais de natures diff&#233;rentes :
&#8211; ER : le corpus de l&#8217;Est R&#233;publicain (presse quotidienne r&#233;gionale, tout ou partie des ann&#233;es 1999, 2002 et
</p>
<p>2003), librement disponible sur le site du CNRTL (37,5 millions d&#8217;occurrences, 330 000 tokens distincts) ;
&#8211; frwiki : l&#8217;ensemble de la version fran&#231;aise de l&#8217;encyclop&#233;die libre Wikipedia, que nous avons transform&#233; en un
</p>
<p>format texte utilisable dans nos outils (232 millions d&#8217;occurrences, 2,6 millions de tokens distincts) ;
&#8211; g1g : la collection de 1-grammes (mots associ&#233;s &#224; leur fr&#233;quence) distribu&#233;e par Google &#224; partir des ouvrages
</p>
<p>scann&#233;s puis num&#233;ris&#233;s (reconnaissance optique des caract&#232;res) par l&#8217;entreprise, en se restreignant aux occur-
rences issues de livres dat&#233;s post&#233;rieurs &#224; 2000 (4,6 milliards d&#8217;occurrences, 540 000 tokens distincts environ).
</p>
<p>Pour choisir les plus plausibles des adjectifs d&#233;riv&#233;s candidats restant, nous avons appliqu&#233; un processus it&#233;ratif
qui ajoute &#224; chaque it&#233;ration un nouvel adjectif au lexique, initialement l&#8217;union du Lefff et de Morphalou. &#192;
chaque it&#233;ration i du processus, chaque adjectif d&#233;riv&#233; a candidat re&#231;oit un score si(a) d&#233;finit comme suit. Soient
a1, . . . , an(a) les formes fl&#233;chies de a, et occ(a1), . . . , occ(an) leur nombre d&#8217;occurrences en corpus. On d&#233;finit
par ailleurs une fonction Li d&#8217;appartenance au lexique tel que pour une forme f on a Li(f) = 1 si f est dans
notre lexique apr&#232;s la i&#8722; 1-i&#232;me it&#233;ration, et Li(f) = &#8722;1 sinon. On pose alors si(a) = &#8722;
</p>
<p>&#8721;n(a)
k=1 Li(ak)occ(ak).
</p>
<p>Ceci d&#233;favorise les candidats dont un maximum de formes fl&#233;chies sont fr&#233;quentes en corpus mais inconnues
du lexique, et d&#233;favorise ceux dont certaines formes fl&#233;chies sont d&#233;j&#224; connues du lexique, surtout si elles sont
fr&#233;quentes. Le mieux class&#233; des adjectifs d&#233;riv&#233;s candidats est alors ajout&#233; au lexique : ses formes fl&#233;chies sont
d&#233;sormais consid&#233;r&#233;es comme connues. Et on passe &#224; l&#8217;it&#233;ration suivante, sauf si plus aucun candidat n&#8217;obtient de
score strictement positif. Nous obtenons ainsi 10 064 adjectifs d&#233;riv&#233;s, qui sont tous par construction des adjectifs
inconnus et du Lefff et de Morphalou. Nous avons conserv&#233; la ou les bases nominales des candidats dont ils
proviennent, soit un total de 12 140 couples (nom base, adjectif d&#233;riv&#233;) sur les 883 233 concern&#233;s.
</p>
<p>&#192; ce stade, nous avons constat&#233; qu&#8217;une proportion importante de ces 12 140 couples &#233;taient propos&#233;s en raison
d&#8217;erreurs orthographiques dans le corpus, et notamment de probl&#232;mes d&#8217;accentuation (p.ex. extremal pour ex-
tr&#233;mal, douannier pour douanier). Nous avons donc utilis&#233; le correcteur orthographique sxspell, int&#233;gr&#233; &#224; la
cha&#238;ne de traitements de surface SXPipe (Sagot &amp; Boullier, 2008), pour proposer une correction orthographique
pond&#233;r&#233;e pour chacun de ces adjectifs. Nous avons fix&#233; empiriquement un seuil sur ce poids (50), et &#233;limin&#233; tous
les couples dont l&#8217;adjectif peut &#234;tre corrig&#233; &#224; un co&#251;t qui lui est inf&#233;rieur en un mot connu du Lefff , lexique sur
lequel repose sxspell, ne conservant ainsi que 11 463 couples. Enfin, comme mentionn&#233; par (Hathout &amp; Tan-
guy, 2005), les d&#233;riv&#233;s propos&#233;s &#224; partir de bases tr&#232;s courtes sont souvent erron&#233;s. Nous avons ainsi &#233;limin&#233; les
couples dont la base fait 3 lettres ou moins (ainsi (bru, bruel) propos&#233; en raison d&#8217;occurrences erronn&#233;es de bruel
sans majuscule) 3. Nous avons &#233;galement &#233;limin&#233; les couples dont l&#8217;adjectif d&#233;riv&#233; fait 6 lettres ou moins. Au final,
nous avons ainsi retenu 8 736 couples candidats couvrant 7 449 adjectifs d&#233;riv&#233;s distincts inconnus du lexique.
</p>
<p>Les r&#233;sultats obtenus automatiquement aux deux &#233;tapes d&#233;crites dans cette section sont indiqu&#233;s &#224; la table 1.
</p>
<p>4 &#201;valuation des r&#233;sultats
Nous avons effectu&#233; une double &#233;valuation de ces r&#233;sultats. Pour en &#233;valuer la pr&#233;cision, nous en avons valid&#233;
manuellement une sous-partie choisie arbitrairement (section 4.1). Pour en &#233;valuer la couverture, nous avons
calcul&#233; une estimation &#224; partir de l&#8217;analyse d&#8217;articles du Wiktionnaire, dictionnaire libre du fran&#231;ais (section 4.2).
</p>
<p>3. Notons que cette heuristique nous fait perdre un nombre tr&#232;s faible mais non nul de couples valides, comme (pouillu, pou) ou (sonique,
son), mais &#233;limine avantageusement (pubien, pub) ou encore (motu, mot), rendu plausible par son hypoth&#233;tique pluriel motus. . .</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CONSTRUCTION D&#8217;UN LEXIQUE DES ADJECTIFS D&#201;NOMINAUX
</p>
<p>&#201;tiquette Couples dont l&#8217;adjectif est :
d&#8217;&#233;valuation connu du lexique inconnu
total (adj. en g-) 156 265
OK 121 (78 %) 136 (51 %)
OtherDer 35 (22 %) 38 (14 %)
NoDer 0 0 (0 %)
NO &#8211; 91 (34 %)
</p>
<p>TABLE 2 &#8211; &#201;valuation des couples retenus com-
men&#231;ant par g. La pr&#233;cision de la seule suggestion
de nouveaux adjectifs &#224; ajouter au lexique, en igno-
rant toute information d&#233;rivationnelle, est de 70 %.
</p>
<p>&#201;tiquette Couples extraits
d&#8217;&#233;valuation du Wiktionnaire
total (adjectifs en g- ou h-) 86
Reg 31 (36 %)
Suppl 20 (23 %)
OtherDer 31 (36 %)
Err 4
</p>
<p>TABLE 3 &#8211; R&#233;partition des couples d&#8217;AdjNWik-
tionnaire, extraits &#224; des fins d&#8217;&#233;valuation. Les
deux premi&#232;res &#233;tiquettes recouvrent les deux types
d&#8217;adjectifs d&#233;riv&#233;s sur base nominale (d&#233;rivation
r&#233;guli&#232;re et sur base suppl&#233;tive).
</p>
<p>4.1 &#201;valuation de la pr&#233;cision
</p>
<p>Nous avons choisi arbitrairement d&#8217;&#233;valuer l&#8217;ensemble des couples candidats dont l&#8217;adjectif d&#233;riv&#233; (et donc, par
construction, la base nominale) commence par la lettre g. Sont concern&#233;s 156 couples dont l&#8217;adjectif est connu
du lexique, pour un total de 116 adjectifs distincts, et 265 couples dont l&#8217;adjectif est inconnu du lexique, pour un
total de 231 adjectifs distincts. Nous les avons tous pass&#233;s en revue manuellement, et les avons class&#233;s au moyen
des &#233;tiquettes suivantes, dont seules les trois premi&#232;res concernent les 156 premiers couples :
&#8211; OK : le lemme adjectival est valide, et le lien d&#233;rivationnel &#233;galement (ex. : gestionnel/gestion) ;
&#8211; OtherDer : le lemme adjectival est valide, il s&#8217;agit bien d&#8217;un adjectif d&#233;riv&#233; mais &#224; partir d&#8217;une base qui n&#8217;est
</p>
<p>pas le nom du couple (ex. : gazeux/gaze) ;
&#8211; NoDer : le lemme adjectival est valide, il ne s&#8217;agit pas d&#8217;un adjectif d&#233;riv&#233; (ex. : gotique/go) ;
&#8211; NO : le lemme adjectival propos&#233; est incorrect (ex. : gabarru/gabarre).
L&#8217;&#233;valuation a &#233;t&#233; r&#233;alis&#233;e par deux validateurs qui ont chacun valid&#233; deux tiers des couples candidats de chaque
type. L&#8217;accord inter-validateurs sur les couples dont l&#8217;adjectif est connu du lexique est de 88 %. Pour les couples
dont l&#8217;adjectif est inconnu du lexique, l&#8217;accord est l&#233;g&#232;rement moins bon (85 %). Une annotation consensuelle a
alors &#233;t&#233; attribu&#233;e &#224; tous les couples pour lesquels il y avait initialement d&#233;saccord, afin de produire une annotation
unique sur l&#8217;ensemble des couples &#233;valu&#233;s. Les r&#233;sultats sont regroup&#233;s &#224; la table 2. Concernant les couples dont
l&#8217;adjectif est connu du lexique, les 22 % d&#8217;erreurs sont presque tous issus de couples dont l&#8217;adjectif est d&#233;riv&#233; d&#8217;une
autre base que le nom propos&#233; (ex. : galeux/gala). De tels couples ne pourraient &#234;tre &#233;cart&#233;s qu&#8217;au moyen d&#8217;outils
compl&#233;mentaires, tels que des mod&#232;les distributionnels qui garantiraient une certaine proximit&#233; s&#233;mantique entre
base et d&#233;riv&#233;. Par ailleurs, le taux de 51 % obtenu pour les couples dont l&#8217;adjectif est seulement trouv&#233; en corpus
reste tout &#224; fait satisfaisant au regard du taux de 78 % obtenu pour ceux dont l&#8217;adjectif est connu du lexique,
surtout si l&#8217;on prend en compte le fait que 14 % des couples propos&#233;s gr&#226;ce au corpus (38 des 91 &#233;tiquet&#233;s &quot;NO&quot;)
proviennent d&#8217;erreurs orthographiques dans le corpus. Enfin, si l&#8217;on met de c&#244;t&#233; les liens de d&#233;rivation, plus de
70 % des adjectifs appartenant &#224; des couples propos&#233;s mais inconnus du lexique sont valides.
</p>
<p>4.2 &#201;valuation de la couverture
</p>
<p>Il n&#8217;est jamais facile d&#8217;&#233;valuer in abstracto la couverture d&#8217;une ressource lexicale. C&#8217;est d&#8217;autant plus vrai dans
notre cas qu&#8217;il n&#8217;est pas toujours facile, comme expliqu&#233; &#224; la section 2, de d&#233;limiter de fa&#231;on nette les adjectifs
d&#233;riv&#233;s d&#8217;une base nominale (f&#251;t-elle suppl&#233;tive) et ceux qui sont en relation uniquement s&#233;mantique avec un
nom. De plus, la couverture de notre ressource ne peut &#234;tre estim&#233;e directement par le biais d&#8217;un corpus, puisqu&#8217;il
n&#8217;existe pas de corpus indiquant pour chaque occurrence d&#8217;un lex&#232;me d&#233;riv&#233; la base dont il est issu.
</p>
<p>Nous avons donc estim&#233; la couverture de notre ressource en recourant &#224; une ressource externe incompl&#232;te compo-
s&#233;e de couples (adjectif, nom) que nous avons extraits &#224; partir du Wiktionnaire comme suit : nous avons simple-
ment construit un couple (adjectif, nom) pour toute entr&#233;e adjectivale du Wiktionnaire dont la d&#233;finition suit un
certain nombre de motifs caract&#233;ristiques tels que Qui appartient &#224; NOM, Relatif &#224;/aux NOM, etc. Cette ressource,
que nous nommerons AdjNWiktionnaire, contient 1 433 couples (associ&#233;s &#224; leur d&#233;finition). L&#8217;id&#233;e sous-jacente &#224;
l&#8217;utilisation d&#8217;AdjNWiktionnaire pour &#233;valuer la couverture de notre ressource est que la forte incompl&#232;te d&#8217;AdjN-
Wiktionnaire est distribu&#233;e al&#233;atoirement. Autrement dit, si l&#8217;on ne conserve d&#8217;AdjNWiktionnaire que les couples
qui sont dans le champ de notre &#233;tude, c&#8217;est-&#224;-dire que l&#8217;adjectif est bien un d&#233;riv&#233; du nom (hors bases suppl&#233;-
tives), on peut &#233;valuer par rapport &#224; eux la couverture de notre ressource. Les autres couples d&#8217;AdjNWiktionnaire
se r&#233;partissent en diff&#233;rentes cat&#233;gories, dont on peut &#233;galement tirer une estimation de la fr&#233;quence relative entre
d&#233;rivation r&#233;guli&#232;re (celle trait&#233;e ici) et d&#233;rivation sur base suppl&#233;tive, pour peu que l&#8217;on ait annot&#233; manuelle-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>JANA STRNADOV&#193; &amp; BENO&#206;T SAGOT
</p>
<p>ment un nombre significatif d&#8217;entr&#233;es d&#8217;AdjNWiktionnaire. C&#8217;est ce que nous avons fait pour les 36 entr&#233;es dont
l&#8217;adjectif commence par g (36 couples) ou h (50 couples), en utilisant les &#233;tiquettes suivantes :
&#8211; Reg : l&#8217;adjectif est effectivement d&#233;riv&#233; du nom, et notre m&#233;thode devrait avoir produit ce couple ;
&#8211; Suppl : l&#8217;adjectif est effectivement d&#233;riv&#233; du nom, mais &#224; partir d&#8217;une base suppl&#233;tive (oreille &gt; auriculaire),
</p>
<p>et notre m&#233;thode ne peut donc pas avoir produit ce couple ;
&#8211; OtherDer : il y a une relation de d&#233;rivation entre l&#8217;adjectif et le nom, mais d&#8217;un autre type ;
&#8211; Err : le couple est issu d&#8217;une erreur dans la construction de AdjNWiktionnaire.
Les r&#233;sultats de cette petite annotation sont donn&#233;s &#224; la table 3.
</p>
<p>Comme expliqu&#233; plus haut, la couverture de notre ressource peut &#234;tre estim&#233;e en calculant sa couverture sur les
cas &#233;tiquet&#233;s &#8220;Reg&#8221;, seuls cas que nous cherchons &#224; traiter dans ce travail. Sur les 31 couples concern&#233;s, 24 ont
&#233;t&#233; retenus parmi les 12 029 que contient notre ressource, soit un peu plus des trois quarts. Les 7 couples restant
ont une base nominale inconnue du Lefff comme de Morphalou, et ne pouvaient donc pas &#234;tre construits. Mais
parmi ceux dont le nom est connu, tous ont donc &#233;t&#233; propos&#233;s par notre m&#233;thode et sont pr&#233;sents dans la ressource
finale. C&#8217;est donc une indication satisfaisante du taux de couverture de notre approche.
</p>
<p>5 Conclusion et perspectives
La premi&#232;re &#233;tape de notre projet de d&#233;veloppement d&#8217;une ressource lexicale d&#233;rivationnelle sur les adjectifs d&#233;-
nominaux du fran&#231;ais nous a permis de construire un lexique pr&#233;liminaire comportant plus de 12 000 couples (ad-
jectif d&#233;riv&#233;, base nominale). Dans un premier temps, nous comptons valider semi-automatiquement l&#8217;ensemble
de ces couples, qui rel&#232;vent tous de la d&#233;rivation r&#233;guli&#232;re. Dans un second temps, et gr&#226;ce &#224; des moyens compl&#233;-
mentaires comme des lexiques bilingues fran&#231;ais-latin, une mod&#233;lisation partielle de l&#8217;&#233;volution diachronique du
lexique du fran&#231;ais ou encore des mod&#232;les s&#233;mantiques distributionnels, nous compl&#232;terons notre ressource par
des couples (adjectif d&#233;riv&#233;, base nominale) relevant de la d&#233;rivation &#224; base suppl&#233;tive, dont nous avons pu estimer
qu&#8217;elle concernait une petite moiti&#233; des adjectifs d&#233;nominaux (20 sur 51). Enfin, nous esp&#233;rons montrer &#224; travers
des applications concr&#232;tes, tant en linguistique qu&#8217;en TAL, qu&#8217;une telle ressource peut &#234;tre tr&#232;s utile.
</p>
<p>R&#233;f&#233;rences
BERNHARD D., CARTONI B. &amp; TRIBOUT D. (2011). &#201;valuer la pertinence de la morphologie constructionnelle
dans les syst&#232;mes de question-r&#233;ponse. In Actes de la Conf&#233;rence TALN. &#192; para&#238;tre.
BOURIGAULT D. &amp; FR&#201;ROT C. (2004). Ambigu&#239;t&#233; de rattachement pr&#233;positionnel : introduction de ressources
exog&#232;nes de sous-cat&#233;gorisation dans un analyseur syntaxique de corpus endog&#232;ne. In Actes de la Conf&#233;rence
TALN, p. 81&#8211;90, F&#232;s, Maroc.
CARTONI B. (2009). Lexical morphology in machine translation : a feasibility study. In Proceedings of the 12th
Conference of the European Chapter of the Association for Computational Linguistics, EACL &#8217;09, p. 130&#8211;138,
Stroudsburg, PA, USA : Association for Computational Linguistics.
CORBETT G. G. (2010). Canonical derivational morphology. Word Structure, 2(3), 141&#8211;155.
CORBIN D. (1985). Les bases non-autonomes en fran&#231;ais ou comment int&#233;grer l&#8217;exception dans le mod&#232;le
lexical. Langue fran&#231;aise, 66, 54&#8211;76.
DAL G., NAMER F., HATHOUT N. &amp; AMSILI P. (1999). Construire un lexique d&#233;rivationnel : th&#233;orie et r&#233;ali-
sations. In Actes de la Conf&#233;rence TALN 1999, p. 115&#8211;124, Carg&#232;se, France.
FRADIN B. (2003). Nouvelles approches en morphologie. Paris, France : PUF.
HATHOUT N. &amp; TANGUY L. (2005). WEBAFFIX : une bo&#238;te &#224; outils d&#8217;acquisition lexicale &#224; partir du Web.
Revue Qu&#233;b&#233;coise de Linguistique, 32(1), 61&#8211;84.
MATTHEWS P. H. (1974). Morphology. Cambridge, Royaume-Uni : Cambridge University Press.
ROMARY L., SALMON-ALT S. &amp; FRANCOPOULO G. (2004). Standards going concrete : from lmf to morpha-
lou. In Actes du Workshop on Electronic Dictionaries de Coling 2004, Gen&#232;ve, Suisse.
SAGOT B. (2010). The Lefff , a freely available, accurate and large-coverage lexicon for French. In Proceedings
of the 7th Language Resource and Evaluation Conference, La Valette, Malte.
SAGOT B. &amp; BOULLIER P. (2008). SXPipe 2 : architecture pour le traitement pr&#233;syntaxique de corpus bruts.
Traitement Automatique des Langues (T.A.L.), 49(2), 155&#8211;188.
TANGUY L. &amp; HATHOUT N. (2002). Webaffix : un outil d&#8217;acquisition morphologique d&#233;rivationnelle &#224; partir
du web. In Actes de la Conf&#233;rence TALN, p. 245&#8211;254, Nancy, France.</p>

</div></div>
</body></html>