<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Theorie et Praxis Une optique sur les travaux en TAL sur le discours et le dialogue</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p> </p>
<p> 
</p>
<p>Theorie et Praxis  
</p>
<p>Une optique sur les travaux en TAL sur le discours et le dialogue 
</p>
<p>Nick Asher 
</p>
<p>LILac, IRIT, Universit&#233; Paul Sabatier 
</p>
<p> 
</p>
<p>Abstract 
</p>
<p>Discourse parsing is a relatively new field and it differs from parsing in syntax in its pedegree.  Parsing and 
computational models of syntax have the benefit of 50 years of research in generative syntax and reactions to it. 
 Discourse parsing has on the other hand little conceptual help from linguistics or philosophy.   Though 
impressive gains have been registered in discourse parsing with superficial features, theoretical not really come to 
grips with the theoretical underpinnings of text interpretation, and its interaction especially with lexical 
semantics, a rather neglected branch of formal semantics.  In my talk I will assess the interaction between 
theoretical linguistics, formal methods, and experimental work on discourse structure and interpretation. 
 Sounding a note of optimism, I will then turn to assessing the situation for the computational analysis of 
dialogue.  I will argue that the view that we are saddled with from Grice and the philosophy of the seventies is 
inadequate and is great need of revision from work on communication from economics and theoretical computer 
science 
</p>
<p>Bio of Nicholas Asher 
</p>
<p>Nicholas Asher est directeur de recherche au CNRS depuis 2006.  Il a eu son doctorat en philosophie &#224; Yale 
University en 1982 et puis a &#233;t&#233; Professeur &#224; l'University of Texas at Austin pendant 24 ans.  Il a travaill&#233; 
longtemps en s&#233;mantique et pragmatique formelle et s'interesse surtout au discours et dialogue.  Il a d&#233;velopp&#233; 
une th&#233;orie de l'interpr&#233;tation du discours bas&#233;e sur la s&#233;mantique dynamique qui s'appelle la &quot;Segmented 
Discourse Representation Theory&quot; ou SDRT, sur lequel il a &#233;crit deux livres, Reference to Abstract Objects in 
Discourse (Kluwer, 1993) et Logics of Conversation (avec Alex Lascarides, Cambridge 2003).  Il a aussi publi&#233; 
une trentaine d'articles sur la SDRT dans des revues internationales.  Un autre th&#232;me de recherche est la 
s&#233;mantique lexicale et la composition de sens, sur lequel il vient de publier un livre, Lexical Meaning in Context, 
avec Cambridge University Press.  Il s'interesse aussi &#224; la validation empirique des th&#233;ories linguistiques et aux 
travaux sur corpus ainsi qu'aux techniques d'apprentissage sur les donn&#233;es structur&#233;es.  V&#233;t&#233;ran d'un projet 
d'annotation discursive sur des textes en fran&#231;ais, ANNODIS, il se lance maintenant sur un projet ERC sur la 
conversation strat&#233;gique et une r&#233;vision des fondements de la vision Gric&#233;enne de la communication humaine. </p>

</div></div>
</body></html>