<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Aligner : un outil d&#8217;alignement et de mesure d&#8217;accord inter-annotateurs</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>PROPOSITION DE DEMONSTRATION TALN 2011 
 
</p>
<p>Aligner : un outil d&#8217;alignement et de mesure d&#8217;accord inter-annotateurs 
</p>
<p>Yann Mathet1, Antoine Widl&#246;cher1  
(1)  GREYC, UMR CNRS 6072, Universit&#233; de Caen, 14032 Caen Cedex  
</p>
<p>{prenom.nom}@unicaen.fr 
</p>
<p>Une m&#233;thode unifi&#233;e d&#8217;alignement et de mesure d&#8217;accord inter-annotateurs a &#233;t&#233; d&#233;velopp&#233;e par 
(Mathet&amp;Widl&#246;cher 2011), consistant &#224; consid&#233;rer les annotations concurrentes faites par plusieurs 
annotateurs comme un facteur de d&#233;sordre que le choix du meilleur alignement va minimiser. Cette notion 
de d&#233;sordre, appel&#233;e entropie, est par ailleurs consid&#233;r&#233;e par rapport au d&#233;sordre induit par un processus 
al&#233;atoire sur les m&#234;mes textes pour &#233;tablir une mesure d&#8217;accord, suivant la formule (1) :  
</p>
<p>accord = (entropieHasard &#8211; entropie) / entropieHasard  (1) 
</p>
<p>Cette m&#233;thode a &#233;t&#233; impl&#233;ment&#233;e (dans une version l&#233;g&#232;rement relax&#233;e) et int&#233;gr&#233;e &#224; la plateforme 
d&#8217;annotation GlozzQL sous forme d&#8217;un outil nomm&#233; Aligner, objet de la pr&#233;sente d&#233;monstration. 
</p>
<p> 
</p>
<p>Lorsqu&#8217;un jeu d&#8217;annotations est charg&#233;, l&#8217;outil cr&#233;e une ligne horizontale pour chaque annotateur trouv&#233; (3 
annotateurs dans notre exemple ci-dessus), et empile ces derni&#232;res verticalement. Une ligne repr&#233;sente 
l&#8217;int&#233;gralit&#233; du texte (gradu&#233;e en caract&#232;res), et porte, sous forme de segments color&#233;s (selon leurs 
cat&#233;gories), les diff&#233;rentes unit&#233;s annot&#233;es par un annotateur donn&#233;.  Il est alors possible de lancer le 
module automatique d&#8217;alignement qui cr&#233;e, lorsqu&#8217;il les juge pertinents au regard de la m&#233;thode propos&#233;e, 
des alignements inter-annotateurs sous forme de lignes (relativement) verticales. Une valeur d&#8217;entropie 
correspondante est automatiquement calcul&#233;e. S&#8217;il le souhaite, l&#8217;utilisateur peut modifier les alignements 
propos&#233;s directement &#224; la souris. Par ailleurs, le syst&#232;me est capable de g&#233;n&#233;rer automatiquement des 
annotations al&#233;atoires judicieusement dispos&#233;es (en s&#8217;inspirant de ce qu&#8217;il constate en corpus), permettant 
de cr&#233;er une r&#233;f&#233;rence d&#8217;entropie al&#233;atoire de bon niveau pour un corpus donn&#233;. Pour cela, il suffit de placer 
un certain nombre d&#8217;exemples d&#8217;annotation du corups concern&#233; dans un r&#233;pertoire et de le soumettre &#224; 
l&#8217;application. D&#232;s lors, l&#8217;utilisateur dispose, &#224; chaque fois qu&#8217;il charge un jeu d&#8217;annotations du corpus en 
question, non seulement de la g&#233;n&#233;ration de ses alignements, mais aussi de la mesure d&#8217;accord telle que 
donn&#233;e en formule (1). Un exemple complet sur corpus r&#233;el sera montr&#233; lors de la d&#233;monstration, ainsi que 
les d&#233;ductions qui peuvent en &#234;tre tir&#233;es sur la qualit&#233; des annotations d&#8217;un annotateur par rapport &#224; 
l&#8217;ensemble des annotateurs. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>MATHET Y. ,WIDL&#214;CHER A. (2011), Une approche holiste et unifi&#233;e de l'alignement et de la mesure 
d'accord inter-annotateurs. TALN 2011, &#224; para&#238;tre (soumission 78). </p>

</div></div>
</body></html>