<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Traduction (automatique) des connecteurs de discours</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Traduction (automatique) des connecteurs de discours
</p>
<p>Laurence Danlos et Charlotte Roze
ALPAGE, Universit&#233; Paris Diderot (Paris 7), 175 rue du Chevaleret, F-750013 Paris
</p>
<p>Laurence.Danlos@linguist.jussieu.fr et Charlotte.Roze@linguist.jussieu.fr
</p>
<p>R&#233;sum&#233;. En nous appuyant sur des donn&#233;es fournies par le concordancier bilingue TransSearch qui int&#232;gre
un alignement statistique au niveau des mots, nous avons effectu&#233; une annotation semi-manuelle de la traduction
anglaise de deux connecteurs du fran&#231;ais. Les r&#233;sultats de cette annotation montrent que les traductions de ces
connecteurs ne correspondent pas aux &#171; transpots &#187; identifi&#233;s par TransSearch et encore moins &#224; ce qui est propos&#233;
dans les dictionnaires bilingues.
</p>
<p>Abstract. On the basis of data provided by the bilingual concordancer TransSearch which propose a statis-
tical word alignment, we made a semi-manual annotation of the English translation of two French connectives.
The results of this annotation show that the translations of these connectives do not correspond to the &#8220;transpots&#8221;
identified by TransSearch and even less to the translations proposed in bilingual dictionaries.
</p>
<p>Mots-cl&#233;s : Traduction (automatique), TransSearch, Discours.
</p>
<p>Keywords: (Machine) Translation, TransSearch, Discourse.
</p>
<p>1 Introduction
</p>
<p>Les connecteurs de discours n&#8217;appartiennent pas &#224; une cat&#233;gorie morpho-syntaxique unique : ce sont principale-
ment des conjonctions de coordination ou de subordination (mais, parce que) et des adverbiaux (ainsi, apr&#232;s tout).
Ils se d&#233;finissent fonctionnellement comme des pr&#233;dicats dont les arguments sont des &#171; segments de discours &#187;
(pour simplifier des phrases) et qui indiquent au niveau s&#233;mantico-discursif la &#171; relation de discours &#187; connectant
ces phrases. Ils facilitent la compr&#233;hension d&#8217;un texte par rapport aux cas o&#249; deux phrases sont simplement jux-
tapos&#233;es sans connecteur explicite pour les relier (ou, ce qui revient au m&#234;me, avec le connecteur vide, not&#233; &#15;) :
avec le connecteur &#15;, le lecteur doit inf&#233;rer la relation de discours en jeu, alors que ce travail d&#8217;inf&#233;rence n&#8217;est pas
n&#233;cessaire avec un connecteur explicite. Ainsi en (1) traduit de (Wilson &amp; Sperber, 1993), si la premi&#232;re phrase
Pierre n&#8217;est pas idiot est suivie de la phrase (a) avec le connecteur &#15;, on ne sait pas si (a) est reli&#233; &#224; la premi&#232;re
phrase par la relation de discours Re&#769;sultat ou par E&#769;vidence. En revanche, avec la phrase (b) introduite par le
connecteur du coup, on sait que la relation de discours est Re&#769;sultat et avec (c) introduit par apr&#232;s tout, on sait
que c&#8217;est E&#769;vidence.
</p>
<p>(1) Pierre n&#8217;est pas idiot.
(a) &#15; Il peut trouver son chemin tout seul. [Re&#769;sultat ou E&#769;vidence]
(b) Du coup, il peut trouver son chemin tout seul. [Re&#769;sultat]
(c) Apr&#232;s tout, il peut trouver son chemin tout seul. [E&#769;vidence]
</p>
<p>Les connecteurs de discours forment une classe semi-ferm&#233;e (semi-ouverte) : ainsi le fran&#231;ais compte environ
330 connecteurs selon la base lexicale LexConn (Roze, 2009; Roze et al., 2010), ce qui contraste avec les classes
ouvertes (V, N, Adj, Adv) qui comptent des milliers d&#8217;&#233;l&#233;ments chacune et les classes ferm&#233;es (Pr&#233;p, Pro, Det,
. . . ) qui comptent moins d&#8217;une centaine d&#8217;&#233;l&#233;ments chacune. LexConn 1 est une base lexicale des connecteurs
discursifs du fran&#231;ais, dans laquelle est renseign&#233;e, pour chaque connecteur, sa cat&#233;gorie morpho-syntaxique et la
ou les relation(s) de discours qu&#8217;il exprime 2. Les connecteurs ont &#233;t&#233; identifi&#233;s gr&#226;ce &#224; des crit&#232;res syntaxiques,
s&#233;mantiques et discursifs, appliqu&#233;s &#224; une liste de conjonctions de subordination fournie par Eric Laporte et une
</p>
<p>1. LexConn est librement accessible &#224; www.linguist.univ-paris-diderot.fr/&#8764;croze/D/Lexconn.xml
2. Un connecteur peut exprimer plusieurs relations de discours. C&#8217;est pourquoi les 328 connecteurs donnent lieu &#224; 428 emplois.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. DANLOS ET C. ROZE
</p>
<p>liste d&#8217;adverbiaux fournis par Beno&#238;t Sagot. De m&#234;me, la base de connecteurs construite pour l&#8217;anglais par (Knott,
1996) compte environ 330 connecteurs 3.
</p>
<p>Nous nous int&#233;ressons &#224; la traduction (automatique) des connecteurs qui pose des probl&#232;mes particuliers comme
en t&#233;moignent de nombreux articles d&#233;di&#233;s &#224; la traduction de connecteurs particuliers d&#8217;une langue &#224; une autre,
par exemple traduction de or en russe (Iordanskaja &amp; Mel&#8217;c&#771;uk, a paraitre) et en espagnol (Rey, 1999), traduction
de de fait et en fait en italien (Rossari, 1993), traduction fran&#231;ais &#8596; hollandais des connecteurs causaux (Degand
&amp; Maat, 2003). Notre &#233;tude se situe dans cette optique, mais &#224; la diff&#233;rence des travaux cit&#233;s, il repose sur des don-
n&#233;es bilingues fran&#231;ais-anglais fournies par l&#8217;outil de &#171; transpotting &#187; (alignement sous-phrastique) TransSearch
d&#233;velopp&#233; par l&#8217;&#233;quipe RALI de l&#8217;Universit&#233; de Montr&#233;al (Huet et al., 2009; Bourdaillet et al., 2010). Cet outil
est pr&#233;sent&#233; &#224; la Section 2. Ces donn&#233;es bilingues concernent deux connecteurs du fran&#231;ais, en effet (adverbial) et
alors que (conjonction de subordination), sur lesquels nous avons effectu&#233; une annotation semi-manuelle en pre-
nant en compte la langue originale, selon une m&#233;thodologie expliqu&#233;e &#224; la Section 2. Cette annotation permet de
donner des r&#233;sultats chiffr&#233;s sur la traduction ou la source anglaise de ces connecteurs, Sections 3 et 4. La derni&#232;re
section est consacr&#233;e &#224; l&#8217;analyse de ces r&#233;sultats qui ne correspondent gu&#232;re &#224; ce qu&#8217;indiquent les dictionnaires et
qui pr&#233;sentent des scores de transpotting en dessous de ceux annonc&#233;s par TransSearch.
</p>
<p>2 Donn&#233;es bilingues fournies par TransSearch et m&#233;thodologie
</p>
<p>TransSearch est un concordancier bilingue qui s&#8217;appuie sur un corpus align&#233; au niveau des phrases (un bitexte),
et notamment les textes des d&#233;bats parlementaires fran&#231;ais-anglais discut&#233;s au Canada (les Hansards). Lorsque
l&#8217;utilisateur soumet une requ&#234;te, par exemple en effet, TransSearch ram&#232;ne les paires d&#8217;unit&#233;s align&#233;es (souvent
des phrases) dont la partie fran&#231;aise contient la s&#233;quence en effet. La version r&#233;cente de TransSearch (avec laquelle
nous avons travaill&#233; ici) int&#232;gre un alignement statistique au niveau des mots et ram&#232;ne les paires d&#8217;unit&#233;s align&#233;es
en indiquant le &#171; transpot &#187; de la requ&#234;te, c&#8217;est-&#224;-dire pour en effet par exemple, la traduction anglaise de ce
connecteur si la langue originale est le fran&#231;ais ou la s&#233;quence de mots pouvant &#234;tre consid&#233;r&#233;e comme la source
de ce connecteur si la langue originale est l&#8217;anglais (Huet et al., 2009; Bourdaillet et al., 2010).
</p>
<p>Pour mener &#224; bien notre travail sur la traduction des connecteurs, St&#233;phane Huet nous a fourni, pour chaque
connecteur, un fichier XML compos&#233; d&#8217;une suite d&#8217;alignements o&#249; chaque alignement indique le transpot du
connecteur identifi&#233; par TransSearch ainsi que la langue originale 4. Ci-dessous deux exemples d&#8217;alignement.
Dans le premier, dont la langue originale est le fran&#231;ais, TransSearch a identifi&#233; &#224; juste titre que la traduction de
en effet est in fact.
</p>
<p>(2) &lt;alignment . . . &gt; &lt;part lang=&quot;fr&quot; original=&quot;yes&quot;&gt;
&lt;s&gt; &lt;match&gt;En effet&lt;/match&gt;, je les appelle des &#171; mesures-spectacle &#187; parce qu&#8217;on en fait de beaux spec-
tacles. &lt;/s&gt; &lt;/part&gt;
&lt;part lang=&quot;en&quot;&gt;
&lt;s&gt; &lt;match pattern=&quot;&quot;&gt;In fact&lt;/match&gt;, I call them &#8220;measures for show&#8221; because they are used to put on a
good show. &lt;/s&gt; &lt;/part&gt; &lt;/alignment&gt;
</p>
<p>Dans l&#8217;alignement suivant, pr&#233;sent&#233; de fa&#231;on plus lisible et dont la langue originale est l&#8217;anglais, TransSearch
propose talking (en gras dans l&#8217;exemple) comme source de en effet, ce qui est erron&#233;. Cette erreur vient de ce
que le traducteur a introduit en effet dans le texte fran&#231;ais sans qu&#8217;aucun &#233;l&#233;ment correspondant ne figure dans le
texte source, ce que nous notons &#216; &#8594; en effet 5 . Nous verrons que ce cas de figure (et l&#8217;inverse soit en effet &#8594;
&#216;) s&#8217;observe avec une fr&#233;quence &#233;lev&#233;e. Il conduit &#224; des erreurs syst&#233;matiques de TransSearch qui ne peut pas
prendre en compte l&#8217;alignement d&#8217;un mot avec &#216;.
</p>
<p>(3) &lt;part lang=&quot;en&quot; original=&quot;yes&quot;&gt;
</p>
<p>3. N&#233;anmoins, seuls 100 connecteurs sont pris en compte dans le corpus annot&#233; du Penn Discourse Tree Bank (PDTB Group, 2008).
4. Un alignement comporte aussi le contexte discursif du connecteur, soit les phrases pr&#233;c&#233;dant et suivant celle o&#249; il appara&#238;t. Ce contexte
</p>
<p>discursif est n&#233;cessaire pour comprendre le texte et donc l&#8217;emploi du connecteur. N&#233;anmoins, nous l&#8217;omettons dans nos exemples (faute de
place) quand il n&#8217;est pas pertinent pour la compr&#233;hension.
</p>
<p>5. La notation &#216; est aussi utilis&#233;e dans l&#8217;article de (Rey, 1999) consacr&#233; &#224; la traduction du connecteur or en espagnol, voir Tous les hommes
sont mortels. Or Socrate est un homme. Donc Socrate est mortel.&#8594; Todos los hombres son mortales. &#216; Socrates es un hombre. &#216; Socrates es
mortal.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TA(O) ET CONNECTEURS DE DISCOURS
</p>
<p>[fr] C&#8217;est pour cette raison que les jeunes scientifiques canadiens sont de plus en plus nombreux &#224; chercher
des emplois verts &#224; l&#8217;&#233;tranger.
En effet, nos cerveaux verts vont de plus en plus souvent chercher les emplois verts &#224; l&#8217;&#233;tranger &#224; cause
des politiques du gouvernement ; de tels emplois sont cr&#233;&#233;s par milliers aux &#201;tats-Unis gr&#226;ce au projet
ReEnergize du pr&#233;sident Obama.
</p>
<p>[en] That is why young Canadian scientists are having increasingly to go to other countries to find jobs, green
jobs.
We are talking here about green jobs for the green brains that are increasingly having to leave our country
because of the government&#8217;s policies ; green jobs like the thousands being created by Obama through
project re-energize.
</p>
<p>A partir de ces donn&#233;es, notre m&#233;thodologie d&#8217;annotation a &#233;t&#233; la suivante pour un connecteur donn&#233; :
</p>
<p>1. s&#233;parer le fichier XML en deux selon la langue originale,
</p>
<p>2. rep&#233;rer les transpots les plus courants (par exemple, in fact et indeed pour en effet), v&#233;rifier que TransSearch
les a bien identifi&#233;s et si c&#8217;est le cas les annoter comme bons transpots,
</p>
<p>3. annoter manuellement le reste.
</p>
<p>Ainsi &#224; partir de l&#8217;alignement (2), l&#8217;annotation est celle donn&#233;e en (4), dans laquelle le transpot calcul&#233; par Trans-
Search est indiqu&#233; en gras et la traduction semi-manuellement identifi&#233;e est soulign&#233;e. Cette annotation incr&#233;mente
le nombre de fois o&#249; on a en effet&#8594; in fact et le nombre de fois o&#249; TransSearch identifie correctement un transpot.
</p>
<p>(4) &lt;part lang=&quot;fr&quot; original=&quot;yes&quot;&gt;
[fr] En effet , je les appelle des &#171; mesures-spectacle &#187; parce qu&#8217;on en fait de beaux spectacles.
</p>
<p>[en] In fact, I call them &#8220;measures for show&#8221; because they are used to put on a good show.
</p>
<p>L&#8217;annotation de l&#8217;alignement (3) incr&#233;mente le nombre de fois o&#249; on a &#216; &#8594; en effet et le nombre de fois o&#249;
TransSearch identifie un transpot erron&#233;. Enfin, l&#8217;annotation en (5) incr&#233;mente le nombre de fois o&#249; on a because
&#8594; en effet et le nombre de fois o&#249; TransSearch identifie un transpot erron&#233;.
</p>
<p>(5) &lt;part lang=&quot;en&quot; original=&quot;yes&quot;&gt;
[fr] Une fois l&#8217;accord sign&#233;, nous avons &#233;t&#233; d&#233;savantag&#233;s. En effet, comme il l&#8217;a expliqu&#233;, au moment o&#249; nous
</p>
<p>avons sign&#233; l&#8217;accord, presque tous les march&#233;s avaient d&#233;j&#224; &#233;t&#233; attribu&#233;s
[en] When the agreement was signed, we ended up getting the short end of the stick because, as he explained,
</p>
<p>by the time we signed the agreement, almost all of the available business was already spoken for.
</p>
<p>3 R&#233;sultats de l&#8217;annotation pour en effet
</p>
<p>Notre corpus contenait 2157 exemples pour en effet avec le fran&#231;ais comme langue originale et 1977 exemples avec
l&#8217;anglais comme langue originale. Les dictionnaires bilingues (Robert &amp; Collins, Reverso, Dictionnaire Google,
Wordreference) donnent g&#233;n&#233;ralement comme traduction de en effet : indeed ou in fact. Nous avons effectivement
trouv&#233; ces deux traductions parmi les trois plus fr&#233;quentes, la troisi&#232;me &#233;tant la s&#233;quence vide &#216;. Plus pr&#233;cis&#233;ment,
les r&#233;sultats de notre annotation sont d&#233;taill&#233;s dans la Table 1 pour ces trois traductions (sources) de en effet selon
la langue originale et sans tenir compte de la langue originale (colonne fran&#231;ais + anglais). Cette table indique
aussi le pourcentage couvert par ces trois traductions ainsi que le nombre de fois o&#249; TransSearch a identifi&#233; le bon
transpot quel qu&#8217;il soit (parmi les trois traductions plus fr&#233;quentes ou non).
</p>
<p>Langue originale fran&#231;ais anglais fran&#231;ais + anglais
indeed 713 (33%) 532 (26.9%) 1245 (30%)
&#216; 574 (26.6%) 570 (28.8%) 1144 (27%)
in fact 669 (31%) 410 (20.7%) 1079 (26%)
Pourcentage couvert 90% 76% 83%
Transpots corrects 1470 (68%) 1134 (57%) 2604 (62%)
</p>
<p>TABLE 1 &#8211; Les trois traductions les plus fr&#233;quentes de en effet et nombre de transpots corrects</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. DANLOS ET C. ROZE
</p>
<p>En dehors de ces trois traductions les plus fr&#233;quentes, les r&#233;sultats sont les suivants avec le fran&#231;ais comme langue
originale : actually = 41 (1.9%), the fact is that = 25 (1.1%), as a matter of fact = 18 (0.8%), yes = 14 (0.6%), it is
true that = 9 (0.4%), basically = 7 (0.3%) . . . Avec l&#8217;anglais comme langue originale, les sources de en effet sont :
because = 83 (4.1%), yes = 77 (3.8%), in effect = 45 (2.2%), as a matter of fact = 15 (0.7%), actually = 12 (0.6%),
effectively = 11 (0.5%), certainly= 9 (0.4%), this is because = 9 (0.4%) . . .
</p>
<p>4 R&#233;sultats de l&#8217;annotation pour alors que
</p>
<p>Soulignons en premier lieu que la s&#233;quence alors que ne correspond pas toujours &#224; la conjonction de subordination,
voir Luc comprit alors que Marie ne viendrait pas. TransSearch ne peut identifier de tels cas que nous avons donc
d&#251; &#233;carter manuellement. Notre corpus contenait 623 exemples de la conjonction alors que avec le fran&#231;ais comme
langue originale et 807 avec l&#8217;anglais comme langue originale.
</p>
<p>Les dictionnaires bilingues donnent g&#233;n&#233;ralement comme traduction de alors que : while, whereas, when ou as.
Nous n&#8217;avons trouv&#233; que when parmi les quatre traductions les plus fr&#233;quentes, les trois autres &#233;tant even though,
&#216; et at a time when en ne prenant pas en compte la direction de traduction. Si on prend en compte la direction
de traduction, les quatre traductions les plus fr&#233;quentes de alors que avec le fran&#231;ais comme langue originale sont
even though, &#216;, at a time when et given that, when n&#8217;arrivant qu&#8217;en cinqui&#232;me position. Avec l&#8217;anglais comme
langue originale, les quatre sources les plus fr&#233;quentes de alors que sont &#216;, when, at a time when et and, even
though n&#8217;arrivant qu&#8217;en sixi&#232;me position apr&#232;s when in fact. Les r&#233;sultats de notre annotation sont d&#233;taill&#233;s dans
la Table 2 pour ces quatre traductions les plus fr&#233;quentes de alors que.
</p>
<p>Langue originale fran&#231;ais anglais fran&#231;ais + anglais
even though 302 (48.4%) 26 (3.2%) 328 (22.9%)
&#216; 60 (9.6%) 167 (20.6%) 227 (15.8%)
when 27 (4.3%) 115 (14,2%) 142 (9.9%)
at a time when 35 (5.6%) 96 (11.9%) 131 (9.1%)
Pourcentage couvert 68% 54% 58%
Transpots corrects 312 (50%) 82 (10.7%) 394 (27.5%)
</p>
<p>TABLE 2 &#8211; Les quatre traductions les plus fr&#233;quentes de alors que et nombre de transpots corrects
</p>
<p>En dehors de ces quatre traductions les plus fr&#233;quentes, les r&#233;sultats sont les suivants avec le fran&#231;ais comme
langue originale, en gras les traductions donn&#233;es dans les dictionnaires : given that = 31 (5%), while = 19 (3.04%),
but = 18 (2.88%), compared to = 11 (1.76%), despite the fact that = 8 (1.28%), and = 8, when in fact = 7 (1.12%),
however = 7, yet = 5 (0.8%), as = 4 (0.64%) . . . whereas = 2 (0.32%) . . . et 6.4% d&#8217;hapax.
Avec l&#8217;anglais comme langue originale, les sources les plus fr&#233;quentes sont : and = 29 (3.6%), when in fact = 28
(3.5%), even though = 26 (3.22%), while = 24 (2.97%), as = 19 (2.35%) . . . whereas = 5 (0.62%) . . . et 8.4%
d&#8217;hapax.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Une conclusion s&#8217;impose d&#8217;embl&#233;e : les traductions (ou sources) de en effet et alors que observ&#233;s sur corpus ne
correspondent gu&#232;re &#224; ce qu&#8217;indiquent les dictionnaires bilingues ou un syst&#232;me d&#8217;alignement au niveau des mots
comme TransSearch. Ce syst&#232;me annonce un score d&#8217;environ 70% de bons transpots (Bourdaillet et al., 2010) :
nous sommes l&#233;g&#232;rement en dessous pour en effet (62%) et carr&#233;ment en dessous pour alors que (27.5%).
</p>
<p>Une premi&#232;re raison de cette baisse des scores est la traduction (ou source) &#216; qui est g&#233;n&#233;ralement ignor&#233;e des
dictionnaires bilingues ; elle est parfois prise en compte dans les syst&#232;mes d&#8217;alignement au niveau des mots mais
pas dans TransSearch. Il est connu que certains mots (simples ou compos&#233;s) appartenant &#224; des classes ferm&#233;es cor-
respondent &#224; des traductions &#216;, e.g. certaines pr&#233;positions r&#233;gies par un verbe Je doute de ta sincerit&#233;&#8596; I doubt
&#216; your sincerity, certains d&#233;terminants Les baleines sont des mammif&#232;res&#8596; &#216; Whales are &#216; mammals, certains
pronoms Je t&#8217;aime&#8596; &#216; Te quiero. A rebours, les mots (simples ou compos&#233;s) appartenant &#224; des classes ouvertes</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>TA(O) ET CONNECTEURS DE DISCOURS
</p>
<p>sont la plupart du temps traduits explicitement. Pourquoi et quand observe-t-on un transpot &#216; des connecteurs
&#8212; qui appartiennent &#224; une classe semi-ferm&#233;e mais qui ne sont pas vides de sens puisqu&#8217;ils indiquent explicite-
ment, rappelons-le, la relation s&#233;mantico-discursive liant leurs arguments) ? Nous pouvons avancer les hypoth&#232;ses
suivantes, qui sont en rapport l&#8217;une avec l&#8217;autre.
</p>
<p>&#8211; la premi&#232;re consiste &#224; dire que certaines langues utilisent plus de connecteurs que d&#8217;autres. Il faut en effet
rappeler que les connecteurs sont souvent en comp&#233;tition monolinguement avec le connecteur vide &#15; sans que
le sens de l&#8217;&#233;nonc&#233; soit fondamentalement chang&#233;, voir Luc est tomb&#233; parceque/&#15; Marie l&#8217;a pouss&#233; ou Luc
entra dans le salon. Puis/&#15; il s&#8217;assit sur le sofa. Le connecteur &#15; demande au lecteur d&#8217;inf&#233;rer la relation de
discours, ce qui n&#8217;est pas le cas d&#8217;un connecteur explicite (qui demande au plus un travail de d&#233;sambiguation
lorsqu&#8217;il lexicalise plusieurs relations de discours). On peut avancer l&#8217;hypoth&#232;se que certaines langues sont plus
implicites &#8212; demandent plus de travail d&#8217;inf&#233;rence au lecteur &#8212; que d&#8217;autres, tout du moins en ce qui concerne
les connecteurs 6.
</p>
<p>&#8211; la seconde concerne l&#8217;absence de traduction(s) stable(s) d&#8217;un connecteur. Cette hypoth&#232;se, que nous allons
d&#233;velopper ci-dessous pour des traductions non vides, peut entra&#238;ner la strat&#233;gie suivante pour un traducteur hu-
main : utiliser le connecteur &#15; en laissant au lecteur le soin d&#8217;inf&#233;rer la relation de discours plut&#244;t que d&#8217;avancer
une traduction erron&#233;e.
</p>
<p>L&#8217;absence de traduction(s) stable(s) d&#8217;un connecteur est particuli&#232;rement criante (et impr&#233;vue) au vu des nos
r&#233;sultats pour alors que. Ainsi, avec le fran&#231;ais comme langue originale, rappelons que les quatre traductions les
plus fr&#233;quentes de ce connecteur ne correspondent &#224; aucun &#233;l&#233;ment donn&#233; dans les dictionnaires. Ceux-ci mettent
en t&#234;te while et whereas, qui ne sont utilis&#233;s que dans 3.3% des cas, et ne mentionnent pas even though qui est la
traduction la plus fr&#233;quente (48.4%). De plus, les traductions les plus fr&#233;quentes, even though et &#216;, ne couvrent
que 58% des cas, les autres faisant appel &#224; une myriade de traductions s&#8217;observant au mieux dans 5.5% des cas (at
a time when) avec 6.4% d&#8217;hapax.
</p>
<p>Certes, notre &#233;tude est limit&#233;e &#224; deux connecteurs pour une seule paire de langues et elle ne repose que sur un
corpus d&#8217;un genre particulier. Elle demande donc &#224; &#234;tre prolong&#233;e dans plusieurs directions. N&#233;anmoins, nous
pensons qu&#8217;il y a un probl&#232;me sp&#233;cifique de traduction pour bon nombre de connecteurs, ce qui explique la
multitude d&#8217;&#233;tudes contrastives qui leurs sont d&#233;di&#233;es, voir Section 1. Ainsi (Iordanskaja &amp; Mel&#8217;c&#771;uk, a paraitre)
et (Rey, 1999) argumentent qu&#8217;il n&#8217;y a pas de bonne(s) traduction(s) de or respectivement en russe et en espagnol
et nous pensons qu&#8217;il n&#8217;y en a pas non plus en anglais, de m&#234;me pour certes, au fur et &#224; mesure que, quitte &#224;, . . . .
(Cartoni et al., 2011) arrivent au m&#234;me type de conclusion pour les connecteurs causaux.
</p>
<p>Les syst&#232;mes de traduction automatique fonctionnent actuellement phrase par phrase. Pour les connecteurs adver-
biaux, ils ne peuvent donc pas prendre en compte le contexte discursif de la phrase o&#249; appara&#238;t le connecteur, ce qui
serait pourtant n&#233;cessaire pour identifier son emploi. Il serait toutefois important que les syst&#232;mes de traduction
automatique d&#233;veloppent des strat&#233;gies sp&#233;cifiques pour les connecteurs, qui rappelons-le, jouent un r&#244;le crucial
pour la compr&#233;hension d&#8217;un texte puisqu&#8217;ils indiquent comment s&#8217;articule s&#233;mantiquement et rh&#233;toriquement la
succession des phrases d&#8217;un texte.
</p>
<p>Remerciements
</p>
<p>Nous remercions St&#233;phane Huet, Philippe Langlais et Guy Lapalme du RALI sans lesquels cette &#233;tude n&#8217;aurait pu
avoir lieu, ainsi que Bruno Cartoni, Thomas Meyer et Sandrine Zufferey de l&#8217;Universit&#233; de Gen&#232;ve avec lesquels
nous avons eu des discussions fructueuses.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BOURDAILLET J., HUET S., LANGLAIS P. &amp; LAPALME G. (2010). TransSearch : from a bilingual concordancer
to a translation finder. Machine Translation, 24(3-4), 241&#8211;271.
</p>
<p>6. Ainsi, le fran&#231;ais est plus implicite que le cor&#233;en dans les discours causaux mettant en jeu un verbe causatif (Pak, 1997).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>L. DANLOS ET C. ROZE
</p>
<p>CARTONI B., ZUFFEREY S., MEYER T. &amp; POPESCU-BELIS A. (2011). How comparable are parallel cor-
pora ? measuring the distribution of general vocabulary and connectives. In Proceedings of the 4th Workshop on
Building and Using Comparable Corpora (BUCC 2011), Portland, USA.
</p>
<p>DEGAND L. &amp; MAAT H. P. (2003). A contrastive study of dutch and french causal connectives on the speaker
involvement scale. In A. VERHAGEN &amp; J. M. VAN DE WEIJER, Eds., Usage-based approaches to Dutch, p.
175&#8211;19. Utrecht : LOT.
</p>
<p>HUET S., JULIEN B. &amp; LANGLAIS P. (2009). Int&#233;gration de l&#8217;alignement de mots dans le concordancier bilingue
TransSearch. In Actes de la 16&#232; Conf&#233;rence sur le Traitement Automatique des Langues Naturelles (TALN&#8217;09),
Senlis, France.
</p>
<p>IORDANSKAJA L. &amp; MEL&#8217;C&#771;UK I. (&#224; paraitre). Cet OR myst&#233;rieux. Festschrift Professeur B. Oguib&#233;nine.
</p>
<p>KNOTT A. (1996). A Data-Driven Methodology for Motivating a Set of Coherence Relations. PhD thesis,
Department of Artificial Intelligence, University of Edinburgh.
</p>
<p>PAK M.-G. (1997). Les relations causales directes en fran&#231;ais et en cor&#233;en. Linguisticae Investigationes, XXI :1,
139&#8211;162.
</p>
<p>PDTB GROUP (2008). The Penn Discourse Treebank 2.0 Annotation Manual. Rapport interne, Institute for
Research in Cognitive Science, University of Philadelphia.
</p>
<p>REY J. (1999). Approche argumentative des textes scientifiques : la traduction de or en espagnol. Meta, 44 :3,
411&#8211;428.
</p>
<p>ROSSARI C. (1993). Probl&#232;mes pos&#233;s par la traduction fran&#231;ais-italien des connecteurs de fait et en fait. Actes
du XX&#232;me Congr&#232;s International de Linguistique et Philologie Romanes, p. 69&#8211;80.
</p>
<p>ROZE C. (2009). LEXCONN : Base lexicale des connecteurs discursifs du fran&#231;ais. Master&#8217;s thesis, Universit&#233;
Paris 7 Denis Diderot, Paris, France.
</p>
<p>ROZE C., DANLOS L. &amp; MULLER P. (2010). LEXCONN : a French Lexicon of Discourse Connectives. In
Proceedings of Multidisciplinary Approaches to Discourse (MAD 2010), Moissac, France.
</p>
<p>WILSON D. &amp; SPERBER D. (1993). Linguistic form and relevance. Lingua, 90, 1&#8211;25.</p>

</div></div>
</body></html>