<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Ressources lexicales pour une s&#233;mantique inf&#233;rentielle : un exemple, le mot &#171; quitter &#187;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>RESSOURCES LEXICALES POUR UNE SEMANTIQUE INFERENTIELLE 
 
</p>
<p>Ressources lexicales pour une s&#233;mantique inf&#233;rentielle : 
un exemple, le mot &#171; quitter &#187; 
</p>
<p>Daniel Kayser 
</p>
<p>LIPN &#8211; UMR 7030 du CNRS 
Institut Galil&#233;e - Universit&#233; Paris-Nord 
</p>
<p>93430 Villetaneuse 
Daniel.Kayser@lipn.univ-paris13.fr 
</p>
<p>R&#233;sum&#233;. On &#233;tudie environ 500 occurrences du verbe &#171; quitter &#187; en les classant selon les inf&#233;rences 
qu&#8217;elles sugg&#232;rent au lecteur. On obtient ainsi 43 &#171; sch&#233;mas inf&#233;rentiels &#187;. Ils ne s&#8217;excluent pas l&#8217;un 
l&#8217;autre : si plusieurs d&#8217;entre eux s&#8217;appliquent, les inf&#233;rences produites se cumulent ; cependant, comme 
l&#8217;auteur sait que le lecteur dispose de tels sch&#233;mas, s&#8217;il veut l&#8217;orienter vers une seule interpr&#233;tation, il 
fournit des indices permettant d&#8217;&#233;liminer les autres. On conjecture que ces sch&#233;mas pr&#233;sentent des 
r&#233;gularit&#233;s observables sur des familles de mots, que ces r&#233;gularit&#233;s proviennent du fonctionnement 
d&#8217;op&#233;rations g&#233;n&#233;riques, et qu&#8217;il est donc sans gravit&#233; de ne pas &#234;tre exhaustif, dans la mesure o&#249; ces 
op&#233;rations permettent d&#8217;engendrer les sch&#233;mas manquants en cas de besoin. 
</p>
<p>Abstract. Around 500 occurrences of the French verb &#8220;quitter&#8221; are scrutinized and sorted according to 
the inferences they trigger in the reader&#8217;s mind. This yields 43 so-called inferential schemata. They are not 
exclusive from one another: when several of them are applicable, their conclusions add together; however, 
as the author knows that the reader possesses this kind of schema, if s/he wants to direct the reader towards 
a given interpretation, s/he provides some clues to block the other ones. The schemata reveal regularities 
across families of similar words, and these regularities are conjectured to be due to the operation of generic 
procedures: omitting some schemata is thus harmless, insofar as these procedures have the ability to 
generate the missing ones in case of need. 
</p>
<p>Mots-cl&#233;s :   S&#233;mantique lexicale. Inf&#233;rence. Glissements de sens. 
Keywords:   Lexical Semantics. Inference. Shifts in Meaning. 
</p>
<p>1 Introduction 
Je pr&#233;conise depuis longtemps (Kayser, 1997) une s&#233;mantique qui ne soit pas bas&#233;e sur une r&#233;f&#233;rence au 
monde (selon laquelle les mots ont pour fonction principale de d&#233;crire des objets, des &#233;v&#233;nements, etc.), 
mais qui ne soit r&#233;f&#233;rentielle que par effet d&#233;riv&#233; de sa fonction premi&#232;re : d&#233;clencher des inf&#233;rences chez le 
lecteur / auditeur. 
Dans le cas de la s&#233;mantique lexicale, cette th&#232;se devrait signifier que chaque mot poss&#232;de un pouvoir 
inf&#233;rentiel (Small, 1981). Cependant, coup&#233; de tout contexte, un mot engendre assez peu d&#8217;inf&#233;rences et ce 
pouvoir reste latent (cf. l&#8217;id&#233;e de &#171; signifi&#233; de puissance &#187; de (Guillaume, 1964)) quoique, comme l&#8217;ont 
remarqu&#233; Schank et Abelson (1977), certains mots ont la propri&#233;t&#233; d&#8217;installer des &quot;scripts&quot; qui d&#233;clenchent 
par eux-m&#234;mes de nombreuses inf&#233;rences. Pour les autres, ce n&#8217;est qu&#8217;une fois connus le co-texte et certains 
&#233;l&#233;ments de la situation d&#8217;&#233;nonciation que la potentialit&#233; du mot se concr&#233;tise. La fa&#231;on de repr&#233;senter cette 
potentialit&#233; latente et, au fur et &#224; mesure que les caract&#233;ristiques du contexte se dessinent, l&#8217;actualisation de 
cette potentialit&#233; en de v&#233;ritables inf&#233;rences restent &#224; &#233;lucider. Pour cela, il est n&#233;cessaire de r&#233;pertorier les 
inf&#233;rences qui paraissent l&#233;gitimes dans les diff&#233;rentes circonstances o&#249; un m&#234;me mot est utilis&#233;. 
&#192; ma connaissance, il n&#8217;existe pas d&#8217;&#233;tude explicitement orient&#233;e vers la collecte des inf&#233;rences li&#233;es &#224; 
l&#8217;usage d&#8217;un mot. Cette contribution est une premi&#232;re tentative en ce sens, avec tous les t&#226;tonnements et 
imperfections que cela comporte. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DANIEL KAYSER 
 
</p>
<p>2 Cadre de l&#8217;&#233;tude 
Qu&#8217;inf&#232;re-t-on si, &#224; l&#8217;entr&#233;e d&#8217;un local, on entend (1) ou (2) ? 
</p>
<p>(1) Laissez votre manteau &#224; l&#700;h&#244;tesse du vestiaire. 
(2) Laissez leur manteau &#224; vos enfants. 
</p>
<p>Dans le cas (1), qu&#8217;il faut &#244;ter son manteau car il fait chaud &#224; l&#8217;int&#233;rieur, et dans (2) qu&#8217;il ne faut pas l&#8217;&#244;ter 
car il fait froid &#224; l&#8217;int&#233;rieur. D&#8217;o&#249; viennent ces inf&#233;rences ? Les dictionnaires existants recensent les usages 
d&#8217;un mot, les explicitent &#224; l&#8217;aide de paraphrases ou d&#8217;exemples, mais ne comportent pas d&#8217;indication pour 
d&#233;terminer les inf&#233;rences qu&#8217;on est en droit d&#8217;effectuer, et ce n&#8217;est d&#8217;ailleurs pas leur but. 
Dans le cas d&#8217;esp&#232;ce, l&#8217;arborescence que le Tr&#233;sor de la Langue Fran&#231;aise fournit pour le verbe transitif 
&#171; laisser &#187; comporte une branche I.A.3 glos&#233;e par &#171; mettre en d&#233;p&#244;t, en garde &#187;, ce qui convient bien &#224; (1), 
et une branche II.A.3, &#171; garder, r&#233;server &#187;, exemplifi&#233;e par &#171; Il fallait &#233;monder l'arbre, ne lui laisser que les 
ma&#238;tresses branches &#187; (M. Genevoix, Raboliot), qui est assez proche de (2). Mais pour savoir quelle 
branche correspond &#224; une occurrence donn&#233;e, ce dictionnaire ne mentionne que la nature anim&#233;e ou non des 
actants, ce qui n&#8217;est pas discriminant ici et ne l&#8217;est pas davantage dans de nombreux autres cas. 
Mon propos est donc de prendre les choses &#224; leur point de d&#233;part. J&#8217;ai choisi dans un premier temps le verbe 
&#171; quitter &#187;, car il est plus simple que &#171; laisser &#187;. On tente ici d&#8217;&#233;num&#233;rer les inf&#233;rences que d&#233;clenchent les 
diff&#233;rents emplois de ce verbe, et de d&#233;terminer ce qui, dans le contexte, justifie ce d&#233;clenchement. C&#8217;est un 
verbe qui exprime le contraste entre deux situations, et on cherche &#224; clarifier ce que l&#8217;on peut pr&#233;sumer des 
situations initiale et finale en fonction des circonstances o&#249; ce verbe est utilis&#233;. 
Cette &#233;tude ne vise pas l&#8217;exhaustivit&#233; : c&#8217;est la m&#233;thode qui importe. Si elle donne des r&#233;sultats, on pourra 
l&#8217;&#233;tendre &#224; une couverture plus syst&#233;matique des emplois du mot. De toute fa&#231;on, le fonctionnement m&#234;me 
de la langue encourage les emprunts : si un mot appara&#238;t dans un contexte o&#249; on ne s&#8217;attend pas &#224; le voir, on 
cherche s&#8217;il existe un comportement inf&#233;rentiel connu d&#8217;un autre mot dans ce contexte, et on tente une 
analogie en adaptant ce qui peut l&#8217;&#234;tre. L&#8217;exigence d&#8217;exhaustivit&#233; n&#8217;a donc pas beaucoup de pertinence. 
J&#8217;ai recueilli 275 occurrences de &#171; quitter &#187; extraites d&#8217;un corpus journalistique. J&#8217;y ai ajout&#233; 151 segments 
de texte extraits du TLFi, et 75 trouv&#233;s dans le Littr&#233;, en &#233;cartant les utilisations sp&#233;cialis&#233;es ou qui m&#8217;ont 
sembl&#233; archa&#239;santes. Ces 501 occurrences pr&#233;sentent des redondances et certainement des lacunes, mais 
elles forment une base repr&#233;sentative pour avancer. 
La m&#233;thode suivie a consist&#233; &#224; regrouper ces occurrences en fonction des ressemblances entre les inf&#233;rences 
qu&#8217;il m&#8217;a paru l&#233;gitime d&#8217;en tirer. Dans un deuxi&#232;me temps, j&#8217;ai cherch&#233; &#224; comprendre d&#8217;o&#249; venaient ces 
ressemblances, et sans surprise, j&#8217;ai observ&#233; que dans un groupe ainsi constitu&#233;, les actants du verbe 
partagent de nombreuses caract&#233;ristiques ; mais celles-ci sont loin d&#8217;&#234;tre suffisantes : la pr&#233;sence ou 
l&#8217;absence d&#8217;autres mots et la situation d&#8217;&#233;nonciation jouent souvent un r&#244;le capital. 
Les caract&#233;ristiques des actants peuvent &#234;tre &#171; ontologiques &#187;, au sens que le T.A.L. donne &#224; ce mot. Mais 
se reposer sur elles pour s&#233;lectionner, parmi les sch&#233;mas inf&#233;rentiels, ceux qui sont applicables, impliquerait 
que le choix du &#171; bon &#187; rattachement ontologique de chaque mot pr&#233;c&#232;de cette s&#233;lection. Or lorsqu&#8217;un 
rattachement de mots du co-texte conduit &#224; un sch&#233;ma inf&#233;rentiel donnant un r&#233;sultat contraire &#224; l&#8217;intuition 
ou &#224; la coh&#233;rence discursive, on le remet en cause et on envisage d&#8217;autres potentialit&#233;s de ces mots, ou un 
usage m&#233;taphorique. Le processus qui se d&#233;roule (g&#233;n&#233;ralement inconsciemment) s&#8217;apparente donc &#224; une 
recherche d&#8217;&#233;quilibre entre diff&#233;rentes contraintes. L&#8217;existence de plusieurs points d&#8217;&#233;quilibre correspond &#224; 
la possibilit&#233; de plusieurs interpr&#233;tations d&#8217;un m&#234;me texte. 
Une notion cruciale, d&#233;j&#224; mise en &#233;vidence dans une autre &#233;tude (Kayser, Nouioua, 2009), est celle de 
norme, et cela pour au moins deux raisons : (i) l&#8217;applicabilit&#233; de nombreux sch&#233;mas inf&#233;rentiels repose sur 
la connaissance de ce qui est per&#231;u comme normal dans la situation initiale ; (ii) un sch&#233;ma lui-m&#234;me est 
davantage une norme qu&#8217;une r&#232;gle d&#8217;inf&#233;rence, car ses conclusions sont &#171; fragiles &#187; : d&#8217;une part comme 
indiqu&#233; ci-dessus, cette applicabilit&#233; est imm&#233;diatement remise en cause si le r&#233;sultat du sch&#233;ma ne respecte 
pas des consid&#233;rations s&#233;mantiques ou pragmatiques ; d&#8217;autre part ces m&#234;mes conclusions ne peuvent &#234;tre 
consid&#233;r&#233;es comme impliqu&#233;es par le texte qu&#8217;en l&#8217;absence d&#8217;&#233;l&#233;ments contradictoires, et ceux-ci peuvent 
appara&#238;tre plus loin dans le texte. Ceci montre que la logique sous-jacente est non monotone (Gr&#233;goire, 
2000), et l&#8217;utilisation de ce type de logiques est d&#8217;autant plus appropri&#233;e qu&#8217;elles mod&#233;lisent &#233;galement, 
sous la forme d&#8217;une recherche de points fixes, l&#8217;id&#233;e d&#8217;&#233;quilibre d&#233;j&#224; &#233;voqu&#233;e. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESSOURCES LEXICALES POUR UNE SEMANTIQUE INFERENTIELLE 
 
</p>
<p>3 Les sch&#233;mas inf&#233;rentiels 
J&#8217;&#233;num&#232;re ci-dessous un ensemble de sch&#233;mas inf&#233;rentiels qui couvre les 501 exemples que j&#8217;ai analys&#233;s. 
Le d&#233;coupage en sections n&#8217;est fait que pour accro&#238;tre la lisibilit&#233;, mais il ne faut surtout pas le comprendre 
comme un choix &#224; faire entre possibilit&#233;s qui s&#8217;excluent. Il n&#8217;est pas rare en effet que plusieurs sch&#233;mas 
s&#8217;appliquent simultan&#233;ment &#224; un exemple : les inf&#233;rences se cumulent alors. 
Mais il est &#233;galement fr&#233;quent que, lorsque plusieurs sch&#233;mas ont leurs conditions d&#8217;applicabilit&#233; 
satisfaites, un seul soit pertinent. Comme l&#8217;auteur sait que le lecteur dispose de ces sch&#233;mas, il prend soin 
de lui fournir des indices l&#8217;aiguillant vers celui qu&#8217;il souhaite voir appliquer et/ou bloquant les autres. 
Par exemple, &#171; quitter son domicile &#187; invoque le sch&#233;ma &#8216;neutre&#8217; I.1.a. tandis que &#171; quitter le domicile conju-
gal &#187; &#8211; qui a toutes chances d&#8217;&#234;tre r&#233;f&#233;rentiellement &#233;quivalent &#8211; invoque le sch&#233;ma plus pr&#233;cis I.1.c. De 
m&#234;me, &#171; quitter sa ma&#238;tresse &#187; renvoie &#224; II.2.b., mais dans : &#171; Je me souviens qu'une fois Mme de 
Luxembourg me parlait en raillant d'un homme qui quittait sa ma&#238;tresse pour lui &#233;crire. &#187; (J.-J. Rousseau, Les 
Confessions, cit&#233; par Littr&#233;), le compl&#233;ment &#171; pour lui &#233;crire &#187; neutralise cette inf&#233;rence et ne d&#233;clenche que 
I.3.a. &#171; Quitter ses amis &#187; se rattache a priori &#224; ce m&#234;me sch&#233;ma I.3.a., mais dans : &#171; il a pr&#233;matur&#233;ment 
quitt&#233; ses nombreux amis &#187;, on pense de pr&#233;f&#233;rence au sch&#233;ma IV.2, &#8216;mourir&#8217;. 
Une grande difficult&#233; est de choisir la &#171; granularit&#233; &#187; des regroupements effectu&#233;s et de la maintenir cons-
tante d&#8217;un regroupement &#224; l&#8217;autre : pourquoi par exemple faire de la dur&#233;e pr&#233;sum&#233;e de l&#8217;absence un crit&#232;re 
diff&#233;renciant I.1.a. de I.1.b. ? Pourquoi avoir regroup&#233; sous III.3.a. des phrases assez diverses (quitter le 
pouvoir, quitter son poste) ? Je peux donner des arguments justifiant ces choix, mais je ne pr&#233;tends pas &#234;tre 
parvenu &#224; homog&#233;n&#233;iser la g&#233;n&#233;ralit&#233; des sch&#233;mas. Si les choses devaient en rester l&#224;, ce serait un d&#233;faut 
s&#233;rieux. Mais je conjecture que ces sch&#233;mas sont souvent eux-m&#234;mes des instances de sch&#233;mas plus 
g&#233;n&#233;raux. Si tel est bien le cas, il n&#8217;est pas tr&#232;s important d&#8217;en distinguer trop ou trop peu, car les lacunes 
in&#233;vitables seront combl&#233;es par la possibilit&#233; d&#8217;engendrer des sch&#233;mas &#224; partir de ceux que j&#8217;ai recens&#233;s. 
Dans ce qui suit, A d&#233;signe le sujet du verbe &#171; quitter &#187; et B son objet direct. La partie &#8216;Pr&#233; :&#8217; du sch&#233;ma 
explicite les inf&#233;rences concernant la situation pr&#233;existant &#224; l&#8217;action de &#171; quitter &#187; ; la partie &#8216;A :&#8217;, celles qui 
correspondent &#224; l&#8217;action elle-m&#234;me [cette partie est absente lorsqu&#8217;aucune inf&#233;rence ne para&#238;t li&#233;e &#224; 
l&#8217;action] ; la partie &#8216;Post :&#8217;, celles qui portent sur la situation cr&#233;&#233;e par l&#8217;action. Ce qui est &#233;crit en italiques 
n&#8217;est pas affect&#233; par une n&#233;gation du verbe (pr&#233;suppos&#233;s). 
Tout est exprim&#233; en langage naturel mais on remarquera qu&#8217;il s&#8217;agit d&#8217;un langage assez contr&#244;l&#233;. Le but est 
&#224; terme de limiter le vocabulaire et la syntaxe pour aboutir &#224; ce que les conditions et les inf&#233;rences 
s&#8217;expriment dans un langage formel. Imposer trop t&#244;t ces contraintes risquerait d&#8217;appauvrir les sch&#233;mas. 
</p>
<p>I. Quitter s&#8217;interpr&#232;te comme changer de lieu 
1. A est une personne (ou assimil&#233; : organisation, &#8230;), B est un lieu 
a. Pr&#233; : A est au lieu B. A a la possibilit&#233; de se d&#233;placer de fa&#231;on autonome. A : A d&#233;cide de partir de B. 
Post : A n&#8217;est plus au lieu B. [Les &#233;lecteurs quittent alors paisiblement les lieux] 
b. le lieu B est assez vaste pour contenir des habitations 
Pr&#233; : cf. a. + A s&#233;journe dans le lieu B (norme s&#233;jour &#8776; jours)  A : cf. a. 
Post : cf. a. + A va s&#233;journer dans un autre lieu (id.). [Le prince Sihanouk a quitt&#233; P&#233;kin, mercredi 14 octobre] 
c. cf. b. + il y a des raisons de penser que A n&#8217;a pas l&#8217;intention de revenir prochainement en B. 
Pr&#233; : cf. a. + A habite au lieu B (norme habiter &#8776; ann&#233;es)  A : A d&#233;cide de ne plus habiter en B. 
Post : cf. a. + A d&#233;m&#233;nage pour habiter dans un autre lieu (id.). [Chaque ann&#233;e trois mille jeunes quittent la Bourgogne] 
d. il y a des raisons de penser que A exerce une activit&#233; professionnelle au lieu B. 
Pr&#233; : cf. a. + A exerce une activit&#233; professionnelle au lieu B (norme profession &#8776; ann&#233;es) A : cf. a. 
Post : A n&#8217;exerce plus son activit&#233; professionnelle au lieu B. [Au moment de quitter Bercy, M. Fabius (&#8230;)] 
e. une norme associe le lieu B &#224; une certaine activit&#233;. 
Pr&#233; : cf. a. + A est venu en B pratiquer cette activit&#233; A : A a termin&#233; cette activit&#233;, c&#8217;est pourquoi il d&#233;cide de partir de B. 
Post : cf. a. + A ne pratique plus cette activit&#233;. [Le pr&#233;sident de la Commission europ&#233;enne a quitt&#233; la tribune] 
f. une norme associe le lieu B &#224; une contrainte li&#233;e &#224; un &#233;tat physique. 
Pr&#233; : cf. a. + A est dans un &#233;tat physique qui le contraint &#224; rester en B A : L&#8217;&#233;tat de A s&#8217;est modifi&#233; de fa&#231;on &#224; lever cette contrainte. 
Post : A a la possibilit&#233; de changer de lieu. [Quitter le lit (Littr&#233;)] 
2. A est une personne, B est un &#233;v&#233;nement qui se tient en un certain lieu L 
Pr&#233; : A est venu en L pour participer &#224; l&#8217;&#233;v&#233;nement A : A d&#233;cide de ne plus participer &#224; l&#8217;&#233;v&#233;nement B, c&#8217;est pourquoi il part de L. 
Post : A ne participe plus &#224; l&#8217;&#233;v&#233;nement B. Il n&#8217;est plus en ce lieu. L&#8217;&#233;v&#233;nement continue &#224; se tenir en ce lieu. 
[Nous allons quitter imm&#233;diatement cette conf&#233;rence s'ils exigent cela de nous] </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DANIEL KAYSER 
 
</p>
<p>3. A et B sont anim&#233;s (personne ou animal) 
a. Pr&#233; : A et B sont dans un m&#234;me lieu L. A a la possibilit&#233; de se d&#233;placer de fa&#231;on autonome. A : A d&#233;cide de partir de L. 
Post : A n&#8217;est plus en L. B est toujours en L. [Il quitta ses compagnons &#224; la porte de la ville (Littr&#233;)] 
b. il y a des raisons de penser que A et B habitent au m&#234;me domicile. 
Pr&#233; : cf. a. + A habite au m&#234;me domicile que B (norme habiter &#8776; ann&#233;es) 
A : A ne souhaite plus habiter avec B, c&#8217;est pourquoi il d&#233;cide de d&#233;m&#233;nager. 
Post : A d&#233;m&#233;nage pour habiter dans un autre lieu (id.). [Ils ont quitt&#233; leur famille qui refusait de les suivre] 
4. A ou B se d&#233;place 
a. B se d&#233;place de fa&#231;on autonome Pr&#233; : Depuis un certain temps (selon norme), A fait en sorte de ne pas s&#8217;&#233;loigner de B. 
Post : A s&#8217;&#233;loigne de B. [Le chien ne quitte plus les talons de son ma&#238;tre (Vidron, TLFi)] 
b. (cas sym&#233;trique) on &#233;change dans a. les r&#244;les de A et B. [Sa bo&#238;te &#224; outils ne le quitte plus. TLFi] 
c. cf. b. Pr&#233; : cf. b. 
Post : A et B s&#8217;&#233;loignent l&#8217;un de l&#8217;autre. [Le monde nous quitte bien avant qu'on s'en aille pour de bon (C&#233;line, TLFi)] 
d. A est le regard (les yeux) d&#8217;une personne ou A est une personne et le verbe quitter est suivi de &#171; des yeux &#187; ou &#171; du regard &#187; 
Pr&#233; : Depuis un certain temps (&#8776; minutes), A fait en sorte que son regard suive B. A : A d&#233;cide de ne plus regarder B. 
Post : Le regard de A ne suit plus B. [ses yeux, que ne quittent presque jamais ceux de ses interpr&#232;tes] 
5. A se d&#233;place, B est un chemin 
Pr&#233; : A a la possibilit&#233; de se d&#233;placer de fa&#231;on autonome. Depuis un certain temps (selon norme) A se d&#233;place sur le chemin B 
A : A d&#233;cide de changer de chemin. 
Post : A continue &#224; se d&#233;placer mais sur un autre chemin. [La voiture quitte la route embouteill&#233;e] 
6. A est un moyen de transport en commun, B est un lieu 
Pr&#233; : A se trouve au lieu B. Son trajet normal consiste &#224; partir de B. 
Post : A part de B. [Chaque semaine, le Transsib&#233;rien quitte Moscou] 
7. A est un &#233;l&#233;ment, B est un lieu 
Pr&#233; : A recouvre (une partie de) B. 
Post : un &#233;v&#233;nement fait en sorte qu&#8217;il n&#8217;y ait plus de A sur le lieu B. [La neige a quitt&#233; de bonne heure les parties basses des 
montagnes (Senancour, TLFi)] 
8. A est un objet, B est un lieu 
Pr&#233; : A est localis&#233; au lieu B.    A : quelqu&#8217;un d&#233;cide de d&#233;placer A. 
Post : A n&#8217;est plus localis&#233; au lieu B. [D'autres &#339;uvres bien connues n'avaient jamais quitt&#233; leur port d&#700;attache] 
9. A et B sont des objets 
Pr&#233; : L&#8217;objet A est attach&#233; &#224; l&#8217;objet B.   A : un &#233;v&#233;nement naturel fait que A se d&#233;tache de B. 
Post : A n&#8217;est plus attach&#233; &#224; l&#8217;objet B. [Comment la grappe quitte le cep et choit dans le panier (Colette, TLFi)] 
</p>
<p>II. Quitter s&#8217;interpr&#232;te comme changer d&#8217;&#233;tat ou d&#8217;attitude 
1. a. A est un &#233;tat, B est une personne ; une norme permet de d&#233;terminer l&#8217;&#233;tat A&#8217; qui suit ordinairement l&#8217;&#233;tat A (enfance -&gt; 
adolescence ; maladie -&gt; bonne sant&#233; ; &#8230;) 
Pr&#233; : B est rest&#233; dans l&#8217;&#233;tat A (dur&#233;e selon norme). 
Post : B est d&#233;sormais dans l&#8217;&#233;tat A&#8217; [L'un des bastonneurs se rappela comment la fatigue l'avait quitt&#233;] 
b. A est une attitude, B est une personne ; une norme permet de d&#233;terminer une attitude A&#8217; qui s&#8217;oppose &#224; A (foi &lt;-&gt; ath&#233;isme ; vice &lt;-
&gt; vertu; souvenir -&gt; oubli ; &#8230;) 
Pr&#233; : B est rest&#233; dans l&#8217;attitude A (&#8776; ann&#233;es). 
Post : B a d&#233;sormais l&#8217;attitude A&#8217; [La solitude m'a quitt&#233;e (Jouve, TLFi)] 
c. (cas sym&#233;triques) &#233;change dans a. ou b. des r&#244;les A et B. [un gar&#231;on qui n'a pas vraiment quitt&#233; l'enfance] 
d. A est un objet (sens large), B est une cat&#233;gorie 
Pr&#233; : A fait partie de la cat&#233;gorie B. A : Une personne ou un &#233;v&#233;nement fait en sorte que A ne fasse plus partie de B 
Post : A n&#8217;est plus dans la cat&#233;gorie B [le th&#232;me du partage du travail quitte la sph&#232;re des utopies] 
2. A est une personne, B est une personne ou un groupe 
a. B est une personne 
Pr&#233; : A a l&#8217;habitude de fr&#233;quenter B (dur&#233;e &#8776; mois). A : Un changement d&#8217;attitude de A ou de B fait que A ne d&#233;sire plus fr&#233;quenter B. 
Post : A ne fr&#233;quente plus B. [Il est souvent plus utile de quitter les grands que de s'en plaindre, La Bruy&#232;re (Littr&#233;)] 
b. cf. a + il y a des raisons de penser que A et B ont des relations amoureuses 
Pr&#233; : A a des relations amoureuses avec B (id. a.). 
A : A d&#233;sire ne plus avoir de relation amoureuses avec B, c&#8217;est pourquoi il ne veut plus fr&#233;quenter B. 
Post : cf. a. [La femme qu'il aime mais qui vient de le quitter] 
c. B est un groupe 
Pr&#233; : A fait partie du groupe B (id. a.).  A : A d&#233;cide de ne plus faire partie du groupe B. 
Post : A ne fait plus partie de groupe B. [Danseuse &#224; l'Op&#233;ra de Paris, elle a quitt&#233; la c&#233;l&#232;bre compagnie] 
d. cf. c + le groupe est connu pour avoir une certaine attitude 
Pr&#233; : cf. c + A a l&#8217;attitude du groupe B  A : A change d&#8217;attitude ; c&#8217;est pourquoi il ne veut plus faire partie du groupe B. 
Post : cf. c + A n&#8217;a plus l&#8217;attitude du groupe B. [M. Albert Vecten, s&#233;nateur de la Marne, quitte le CDS] 
e. B est une personne connue pour avoir une certaine attitude 
Pr&#233; : A est adepte de B et a la m&#234;me attitude que B A : A change d&#8217;attitude. 
Post : A n&#8217;est plus adepte de B. Il n&#8217;a plus l&#8217;attitude de B. B conserve son attitude. [Des ex-collaborateurs fid&#232;les du pr&#233;sident 
Doudaev finissent par le quitter] </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RESSOURCES LEXICALES POUR UNE SEMANTIQUE INFERENTIELLE 
 
</p>
<p>3. A est une personne, B est un produit 
Pr&#233; : A a l&#8217;habitude de consommer B (dur&#233;e &#8776; mois). A : Un changement d&#8217;attitude de A fait que A ne d&#233;sire plus consommer B. 
Post : A ne consomme plus le produit B. [Le pourcentage de toxicomanes parvenant &#224; quitter d&#233;finitivement la drogue] 
4. a. A est une personne, B est une question trait&#233;e par un texte ou un discours 
Pr&#233; : A traite oralement ou par &#233;crit la question B.  A : A consid&#232;re qu&#8217;il a fait le tour de la question B. 
Post : A continue de parler ou d&#8217;&#233;crire. A traite un autre sujet. [Quitter le domaine de l'art, du sacr&#233;, de la physiologie TLFi] 
b. A est une personne, B est une fa&#231;on d&#8217;aborder un sujet 
Pr&#233; : A traite oralement ou par &#233;crit des questions en utilisant la fa&#231;on B. 
Post : A continue de parler ou d&#8217;&#233;crire. A utilise une autre fa&#231;on (contrast&#233;e par rapport &#224; B) d&#8217;aborder les questions. [Il est 
impossible de savoir dans un r&#233;cit de Poe, &#224; quel moment on quitte la r&#233;alit&#233; pour entrer dans le monde des r&#234;ves 
(Mauclair, TLFi)] 
c. (cas sym&#233;trique) on &#233;change dans b. les r&#244;les de A et de B [La fa&#231;on dont la r&#233;alit&#233; ext&#233;rieure peu &#224; peu le quitta, ne lui 
laissant que la seule contemplation de sa vie int&#233;rieure] 
</p>
<p>III. Quitter s&#8217;interpr&#232;te comme changer d&#8217;activit&#233; 
1. A est une personne 
a. B est une activit&#233; professionnelle 
Pr&#233; : A exerce la profession B (dur&#233;e &#8776; ann&#233;es). 
Post : A n&#8217;exerce plus d&#233;sormais l&#8217;activit&#233; B [Ce football fran&#231;ais qu'il a quitt&#233; un jour de l'hiver dernier] 
b. B est un lieu rattach&#233; par une norme &#224; une activit&#233; professionnelle 
Pr&#233; : A exerce la profession correspondant au lieu B (dur&#233;e &#8776; ann&#233;es). 
Post : A n&#8217;exerce plus d&#233;sormais cette activit&#233; [P&#233;dagogue hors pair, dit-on, quand elle quitta la sc&#232;ne] 
c. B est une activit&#233;, ou B est absent 
Pr&#233; : A exerce l&#8217;activit&#233; B (dur&#233;e &#8776; heure) ou son activit&#233; professionnelle habituelle (si B est absent). 
Post : A s&#8217;interrompt dans cette activit&#233;. A a l&#8217;intention de reprendre cette activit&#233; (dans un d&#233;lai &#8776; heures). [Quand cela arrive, il se 
l&#232;ve de sa table et quitte son travail (Goncourt, TLFi)] 
2. A est une personne 
a. B est une entreprise 
Pr&#233; : A est salari&#233; par l&#8217;entreprise B. 
Post : A n&#8217;est d&#233;sormais plus salari&#233; par l&#8217;entreprise B [En 1973, il quitte la DATAR] 
b. B est une organisation qui a le monopole d&#8217;une activit&#233; professionnelle 
Pr&#233; : A est salari&#233; par l&#8217;organisation B. 
Post : A n&#8217;est d&#233;sormais plus salari&#233; par l&#8217;organisation B. A n&#8217;exerce plus l&#8217;activit&#233; professionnelle correspondant &#224; B. [J'ai quitt&#233; 
l'arm&#233;e en 1946, mais je suis rest&#233; en Indochine] 
3. A est une personne 
a. B est un emploi, une fonction, ou (m&#233;tonymie) une facult&#233; ou un symbole li&#233; par une norme &#224; un emploi ou une fonction 
Pr&#233; : A exerce la fonction (li&#233;e &#224;) B (dur&#233;e selon norme). 
Post : A n&#8217;exerce plus la fonction (li&#233;e &#224;) B [J'ai pr&#233;f&#233;r&#233; quitter le fauteuil pr&#233;sidentiel] 
b. B est un groupe qui exerce une fonction 
Pr&#233; : A fait partie du groupe B et exerce la fonction correspondante (dur&#233;e selon norme). 
Post : A ne fait plus partie du groupe B, c&#8217;est pourquoi il n&#8217;exerce plus la fonction correspondante. [Un gouvernement qu'il avait 
quitt&#233;, il y a six mois] 
c. B est un syst&#232;me dont les membres ont une activit&#233; 
Pr&#233; : A pratique cette activit&#233; dans le cadre du syst&#232;me B. 
A : A d&#233;cide de ne plus pratiquer cette activit&#233;, c&#8217;est pourquoi il cesse de faire partie de B. 
Post : A ne fait plus partie du syst&#232;me B. A ne pratique plus cette activit&#233;. [Jeanne avait quitt&#233; le lyc&#233;e &#224; douze ans pour 
s'occuper de sa m&#232;re (Nizan, TLFi)] 
4. A est une personne et B un instrument, un moyen, un style 
Pr&#233; : Dans ses activit&#233;s r&#233;guli&#232;res, A utilise B. 
Post : A n&#8217;utilise plus B. A pratique toujours ces activit&#233;s. [Perry Bamonte quitte ses claviers (dont il use de mani&#232;re ultra-
conformiste) pour sa guitare] 
</p>
<p>IV. Quitter s&#8217;interpr&#232;te comme perdre une qualit&#233; ou un objet 
1. A est une personne 
a. B est un ensemble de possessions 
Pr&#233; : A m&#232;ne un style de vie pour lequel il utilise l&#8217;ensemble B. 
A : A d&#233;cide d&#8217;adopter un autre style de vie, dans lequel B n&#8217;a plus d&#8217;utilit&#233;. 
Post : A change de style de vie, c&#8217;est pourquoi il se d&#233;fait de B. [Mon pays, mes enfants, pour vous j'ai tout quitt&#233;, Racine 
(Littr&#233;)] 
b. B est un habit (ou assimil&#233;) 
Pr&#233; : A porte l&#8217;habit B.  A : A d&#233;cide d&#8217;&#244;ter l&#8217;habit B 
Post : A ne porte plus l&#8217;habit B. [Quitter son habit pour &#234;tre plus &#224; son aise (Littr&#233;)] 
2. A est une personne, B est un (vaste) groupe de personnes, la vie, la terre 
Pr&#233; : A est vivant. 
Post : A est mort. [Pierre Mend&#232;s France nous a quitt&#233;s le 18 octobre 1982] </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DANIEL KAYSER 
 
</p>
<p>4 Perspectives 
Ces sch&#233;mas sont certainement contestables, ne serait-ce que parce que les conditions d&#8217;application sont 
probablement parfois trop larges et parfois trop restrictives. Comme on l&#8217;a vu, la pr&#233;sence ou l&#8217;absence d&#8217;un 
mot peut faire basculer l&#8217;interpr&#233;tation d&#8217;un c&#244;t&#233; ou de l&#8217;autre, et ces ph&#233;nom&#232;nes n&#233;cessiteraient &#224; chaque 
fois une &#233;tude plus fine. Mais une telle &#233;tude serait vou&#233;e &#224; l&#8217;&#233;chec si elle se bornait &#224; recenser des cas 
particuliers sans essayer de comprendre de quoi ils sont les instances. 
De m&#234;me que le lexique g&#233;n&#233;ratif (Pustejovsky, 1995) est cens&#233; restreindre le nombre de significations &#224; 
stocker, car des m&#233;canismes permettent de les reconstituer &#224; partir d&#8217;une quantit&#233; r&#233;duite d&#8217;informations, de 
m&#234;me les sch&#233;mas ci-dessus pr&#233;sentent des r&#233;gularit&#233;s, dont je conjecture qu&#8217;elles s&#8217;expliquent par des 
op&#233;rations g&#233;n&#233;riques, activables ou blocables selon le mot dont il s&#8217;agit, qui engendrent des sch&#233;mas &#224; 
partir d&#8217;un noyau plus restreint, quitte &#224; perdre &#233;ventuellement un peu de finesse d&#8217;analyse. 
Pour cette raison, plut&#244;t que d&#8217;affiner les 43 sch&#233;mas ci-dessus (un r&#233;examen attentif m&#8217;am&#232;nerait s&#251;rement 
&#224; modifier ici une condition, l&#224; un regroupement), il semble plus utile de les comparer avec des sch&#233;mas 
construits pour d&#8217;autres verbes, dans l&#8217;id&#233;e que les analogies constat&#233;es feront appara&#238;tre ces op&#233;rations 
g&#233;n&#233;riques, ce qui r&#233;duirait l&#8217;importance du choix pr&#233;cis des sch&#233;mas correspondant &#224; chaque mot, puisqu&#8217;&#224; 
partir d&#8217;une base &#171; raisonnable &#187; de sch&#233;mas, les autres pourraient &#234;tre r&#233;g&#233;n&#233;r&#233;s. 
J&#8217;&#233;tudie actuellement les verbes &#171; laisser &#187; et &#171; abandonner &#187;, qui partagent avec &#171; quitter &#187; un certain 
nombre de caract&#233;ristiques. &#171; Laisser &#187; est cependant plus complexe, car au lieu d&#8217;&#233;voquer deux situations, 
il fait partie de la grande classe des mots qui en sugg&#232;rent une troisi&#232;me, contrefactuelle. Cette classe 
comprend des verbes comme &#171; &#233;viter &#187; (on aurait pu rencontrer ou percuter), des noms comme &#171; p&#233;nurie &#187; 
(qui &#233;voque une situation o&#249; l&#8217;approvisionnement serait jug&#233; normal), des adjectifs comme &#171; grand &#187; (on 
n&#8217;est grand que par comparaison &#224; une norme), des adverbes comme &#171; trop &#187;, etc. Les sch&#233;mas inf&#233;rentiels 
de &#171; laisser &#187; comportent donc souvent, mais pas toujours, une ligne suppl&#233;mentaire. De plus, &#171; laisser &#187;, 
davantage que &#171; quitter &#187;, renvoie &#224; la notion de contr&#244;le telle que l&#8217;a d&#233;finie Descl&#233;s (1985). Mais une 
fraction non n&#233;gligeable des sch&#233;mas de &#171; laisser &#187; correspond, comme pour &#171; quitter &#187; &#224; des changements 
de lieu, d&#8217;&#233;tat, ou d&#8217;activit&#233; et cette similitude, ou d&#8217;&#233;ventuelles divergences, est pr&#233;cieuse pour faire 
appara&#238;tre des invariants. J&#8217;escompte de cette &#233;tude qu&#8217;elle permette de confirmer l&#8217;existence d&#8217;op&#233;rations 
aptes &#224; cr&#233;er par analogie des sch&#233;mas inf&#233;rentiels &#224; partir d&#8217;un sous-ensemble d&#8217;entre eux. 
Ces sch&#233;mas ne sont pas utilisables en l&#8217;&#233;tat par le T.A.L. Ils le deviendront si l&#8217;on traduit dans un langage 
formel le langage contr&#244;l&#233; dont j&#8217;ai fait usage pour les exprimer : un langage de type logique de description 
semble appropri&#233;, &#224; condition de recenser les entit&#233;s mentionn&#233;es (p.ex. personne, objet, groupe, lieu, 
activit&#233;, &#8230;), les r&#244;les (p.ex. poss&#233;der un objet, exercer une activit&#233;, aller / partir d&#8217;un lieu, &#8230;), et quelques 
notions de second ordre transcriptibles au 1er ordre par r&#233;ification (p.ex. le fait qu&#8217;une certaine entit&#233; joue un 
certain r&#244;le est normal / anormal). Comme je l&#8217;ai dit plus haut, je pense qu&#8217;il est bon d&#8217;attendre d&#8217;avoir 
examin&#233; un plus grand nombre de mots avant de se lancer dans une telle traduction. Mais l&#8217;objectif &#224; moyen 
terme est bien de disposer de ressources linguistiques dans un formalisme qui permette un traitement 
s&#233;mantique automatis&#233; beaucoup plus riche que ce dont on est actuellement capable. 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>DESCLES J.-P. (1985). Repr&#233;sentation des connaissances : arch&#233;types cognitifs, sch&#232;mes conceptuels, et 
sch&#233;mas grammaticaux. Actes s&#233;miotiques - Documents 69-70, E.H.E.S.S. 
GREGOIRE E. (2000). Logiques non monotones &amp; intelligence artificielle. Paris : Herm&#232;s. 
GUILLAUME G. (1964 - 73). Langage et science du langage. Paris : Nizet. 
KAYSER D. (1997) La s&#233;mantique lexicale est d'abord inf&#233;rentielle. Langue Fran&#231;aise 113, 92-106. 
KAYSER D., NOUIOUA F. (2009). From the Description of an Accident to its Causes. Artificial Intelligence 
173 (12-13). 1154-1193. 
PUSTEJOVSKY J. (1995). The Generative Lexicon. Cambridge (Mass.) : The M.I.T. Press. 
SCHANK R. C., ABELSON R.P. (1977). Scripts, Plans, Goals and Understanding. Lawrence Erlbaum Ass. 
SMALL S. (1981). Viewing word expert parsing as a linguistic theory. Proc. of the 7th I.J.C.A.I., 70-76. </p>

</div></div>
</body></html>