<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Acc&#232;s au contenu s&#233;mantique en langue de sp&#233;cialit&#233; : extraction des prescriptions et concepts m&#233;dicaux</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>Acc&#232;s au contenu s&#233;mantique en langue de sp&#233;cialit&#233; :
extraction des prescriptions et concepts m&#233;dicaux
</p>
<p>Cyril Grouin1 Louise Del&#233;ger1 Bruno Cartoni2 Sophie Rosset1 Pierre Zweigenbaum1
</p>
<p>(1) LIMSI-CNRS, BP133, 91403 Orsay Cedex, France
(2) D&#233;partement de Linguistique, Universit&#233; de Gen&#232;ve, Suisse
</p>
<p>{cyril.grouin, louise.deleger, sophie.rosset, pierre.zweigenbaum}@limsi.fr,
bruno.cartoni@unige.ch
</p>
<p>R&#233;sum&#233;. Pourtant essentiel pour appr&#233;hender rapidement et globalement l&#8217;&#233;tat de sant&#233; des patients, l&#8217;acc&#232;s
aux informations m&#233;dicales li&#233;es aux prescriptions m&#233;dicamenteuses et aux concepts m&#233;dicaux par les outils
informatiques se r&#233;v&#232;le particuli&#232;rement difficile. Ces informations sont en effet g&#233;n&#233;ralement r&#233;dig&#233;es en texte
libre dans les comptes rendus hospitaliers et n&#233;cessitent le d&#233;veloppement de techniques d&#233;di&#233;es. Cet article
pr&#233;sente les strat&#233;gies mises en &#339;uvre pour extraire les prescriptions m&#233;dicales et les concepts m&#233;dicaux dans
des comptes rendus hospitaliers r&#233;dig&#233;s en anglais. Nos syst&#232;mes, fond&#233;s sur des approches &#224; base de r&#232;gles
et d&#8217;apprentissage automatique, obtiennent une F1-mesure globale de 0,773 dans l&#8217;extraction des prescriptions
m&#233;dicales et dans le rep&#233;rage et le typage des concepts m&#233;dicaux.
</p>
<p>Abstract. While essential for rapid access to patient health status, computer-based access to medical in-
formation related to prescriptions key medical expressed and concepts proves to be difficult. This information is
indeed generally in free text in the clinical records and requires the development of dedicated techniques. This
paper presents the strategies implemented to extract medical prescriptions and concepts in clinical records written
in English language. Our systems, based upon linguistic patterns and machine-learning approaches, achieved a
global F1-measure of 0.773 for extraction of medical prescriptions, and of clinical concepts.
</p>
<p>Mots-cl&#233;s : Extraction d&#8217;information, Indexation contr&#244;l&#233;e, Informatique m&#233;dicale, Concepts m&#233;dicaux,
Prescriptions.
</p>
<p>Keywords: Information extraction, Controled indexing, Medical informatics, Clinical concepts, Prescrip-
tions.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CYRIL GROUIN, LOUISE DEL&#201;GER, BRUNO CARTONI, SOPHIE ROSSET, PIERRE ZWEIGENBAUM
</p>
<p>1 Introduction
</p>
<p>L&#8217;acc&#232;s au sens pr&#233;sent dans les documents au moyen d&#8217;outils informatiques est indispensable, tant du point de
vue de la compr&#233;hension du contenu que du d&#233;veloppement des m&#233;thodologies informatiques facilitant cet acc&#232;s.
Selon le domaine de langue &#233;tudi&#233; et le format des donn&#233;es accessibles, la production de syst&#232;mes est loin d&#8217;&#234;tre
triviale. Nous avons fait le choix d&#8217;axer cette &#233;tude sur un domaine de langue particulier, le domaine m&#233;dical,
en travaillant sur des documents sp&#233;cifiques, les comptes rendus hospitaliers. Les comptes rendus hospitaliers
int&#232;grent un nombre important d&#8217;informations sur l&#8217;&#233;tat de sant&#233; des patients, tant au niveau des prescriptions
m&#233;dicales que des concepts m&#233;dicaux utilis&#233;s. Ces informations, bien que partiellement structur&#233;es en sections
(ant&#233;c&#233;dents du patient, histoire de la maladie, traitement de sortie, etc.), sont r&#233;dig&#233;es en texte libre et leur ap-
pr&#233;hension par des outils informatiques, en l&#8217;absence de normalisation, se r&#233;v&#232;le difficile. Cependant, la langue
employ&#233;e dans les comptes rendus se caract&#233;rise par une stabilit&#233; et une formalisation &#233;lev&#233;es sur le plan syn-
taxique, s&#233;mantique, et m&#234;me structurel (Sager, 1981; Friedman, 2000), ce qui autorise une analyse automatique.
</p>
<p>Un acc&#232;s rapide aux informations m&#233;dicales contenues dans un dossier patient est essentiel pour les praticiens
hospitaliers, pour r&#233;sumer les ant&#233;c&#233;dents du patient ou pour r&#233;aliser des &#233;tudes pr&#233;ventives. Deux types d&#8217;infor-
mations m&#233;dicales &#233;mergent dans les documents cliniques : en premier lieu, les informations li&#233;es &#224; la prise de
m&#233;dicaments, qu&#8217;elles concernent le m&#233;dicament en lui-m&#234;me ou les informations associ&#233;es (dosage, fr&#233;quence,
etc.) ; en second lieu, les concepts cl&#233;s dans la pratique clinique, qui recouvrent les probl&#232;mes m&#233;dicaux (signes,
sympt&#244;mes, maladies, etc.), les examens r&#233;alis&#233;s pour les diagnostiquer, et les traitements associ&#233;s.
</p>
<p>Nous pr&#233;sentons dans cet article un &#233;tat de l&#8217;art sur l&#8217;acc&#232;s au contenu s&#233;mantique dans les comptes rendus cli-
niques (section 2) puis les approches que nous avons d&#233;velopp&#233;es pour acc&#233;der aux informations m&#233;dicales, d&#8217;une
part pour extraire les informations li&#233;es aux prescriptions m&#233;dicales (section 3), d&#8217;autre part pour rep&#233;rer, extraire
et typer les concepts m&#233;dicaux (section 4) dans le cadre de nos participations aux &#233;ditions 2009 et 2010 du chal-
lenge international i2b2 (informatics for integrating biology to the bedside) dont les th&#233;matiques concernaient ces
aspects (Uzuner et al., 2010a,b). Nous d&#233;taillons et discutons les r&#233;sultats obtenus dans chacune de ces sections.
</p>
<p>2 &#201;tat de l&#8217;art
</p>
<p>L&#8217;acc&#232;s au contenu d&#8217;un document textuel peut &#234;tre appr&#233;hend&#233; de deux mani&#232;res : soit par le biais d&#8217;approches &#224;
base d&#8217;apprentissage, soit par la cr&#233;ation de patrons linguistiques faisant appel &#224; des connaissances d&#8217;expert.
</p>
<p>Les approches &#224; base d&#8217;apprentissage reposent sur l&#8217;utilisation de corpus annot&#233;s avec soin, dans une volum&#233;trie
suffisante et une r&#233;partition homog&#232;ne, pour permettre &#224; un syst&#232;me d&#8217;apprendre les conditions dans lesquelles
se rencontrent les informations &#224; extraire. Ces approches font l&#8217;objet de nombreux travaux, en particulier dans le
domaine de la reconnaissance des entit&#233;s nomm&#233;es m&#233;dicales (Li et al., 2008; Doan &amp; Xu, 2010) ou en analyse
morphologique (Claveau &amp; Kijak, 2010), rendus possibles par la disponibilit&#233; &#233;tendue et la simplicit&#233; d&#8217;utilisation
de ces outils d&#8217;apprentissage. Si ces outils permettent d&#8217;obtenir rapidement de bons r&#233;sultats, ils demeurent large-
ment d&#233;pendants des donn&#233;es fournies en entr&#233;e, et seules des donn&#233;es homog&#232;nes, de qualit&#233; et disponibles en
nombre suffisant, tels les corpus des challenges m&#233;dicaux i2b2, permettent d&#8217;obtenir des r&#233;sultats convaincants.
</p>
<p>&#192; l&#8217;oppos&#233;, les techniques &#224; base de patrons linguistiques faisant appel &#224; des connaissances d&#8217;expert pour la
production de ces patrons ne n&#233;cessitent pas de corpus annot&#233;s. Elles n&#233;cessitent une somme de travail cons&#233;-
quente pour produire et adapter les patrons mais proposent l&#8217;avantage de fournir de bien meilleurs r&#233;sultats (Long,
2007; Hamon &amp; Grabar, 2010), gr&#226;ce aux ressources linguistiques existantes en anglais pour le domaine m&#233;dical,
telles que le Metathesaurus et le Specialist Lexicon de l&#8217;UMLS (Lindberg et al., 1993). La g&#233;n&#233;ralisation de ces
approches appara&#238;t souvent d&#233;licate &#224; op&#233;rer, du fait de la sp&#233;cialisation de la langue de sp&#233;cialit&#233; concern&#233;e.
</p>
<p>La combinaison de ces deux approches permet d&#8217;accro&#238;tre sensiblement la qualit&#233; des r&#233;sultats produits, soit
comme approches compl&#233;mentaires l&#8217;une de l&#8217;autre (une technique suivie de la seconde (Tikk &amp; Solt, 2010)), soit
comme apport de l&#8217;une pour l&#8217;autre (les patrons linguistiques utilis&#233;s pour extraire des informations r&#233;utilis&#233;es
comme caract&#233;ristiques lors de la construction des mod&#232;les d&#8217;apprentissage (Wang, 2009)).
</p>
<p>Le choix de mobiliser une approche plut&#244;t qu&#8217;une autre est souvent dict&#233; par le type de corpus rendu disponible :
une approche &#224; base d&#8217;apprentissage en cas de corpus annot&#233;, une approche &#224; base de lexiques et de r&#232;gles le cas
&#233;ch&#233;ant. Nous avons suivi cette observation dans les choix m&#233;thodologiques d&#233;crits dans les sections suivantes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ACC&#200;S AU CONTENU S&#201;MANTIQUE EN LANGUE DE SP&#201;CIALIT&#201;
</p>
<p>3 Acc&#232;s aux prescriptions m&#233;dicales
</p>
<p>Nous avons d&#8217;abord mis au point les m&#233;thodes d&#8217;extraction de prescriptions m&#233;dicales pour l&#8217;anglais, dans le
cadre de notre participation &#224; l&#8217;&#233;dition 2009 du d&#233;fi i2b2 (Del&#233;ger et al., 2010). Nous les avons ensuite adapt&#233;es
au fran&#231;ais. Les donn&#233;es &#233;tant relatives &#224; une langue de sp&#233;cialit&#233;, les techniques d&#233;crites sont en cons&#233;quence
conditionn&#233;es par cette langue de sp&#233;cialit&#233;.
</p>
<p>3.1 Pr&#233;sentation g&#233;n&#233;rale
</p>
<p>Les prescriptions m&#233;dicales recouvrent le nom du m&#233;dicament (qu&#8217;il s&#8217;agisse d&#8217;un nom commercial, du nom
g&#233;n&#233;rique, ou du principe actif) et les informations associ&#233;es &#224; ce m&#233;dicament. On distingue ainsi diff&#233;rents
types d&#8217;informations. En premier lieu, les informations relatives &#224; la posologie (dosage, fr&#233;quence, quantit&#233;, mode
d&#8217;administration, dur&#233;e), &#224; la forme gal&#233;nique, etc. Ces informations se pr&#233;sentent sous des formes relativement
stables qu&#8217;il est alors possible de d&#233;crire au moyen de patrons linguistiques. Un deuxi&#232;me type d&#8217;information
concerne la raison de la prise de ce m&#233;dicament. Ce type d&#8217;information n&#8217;appara&#238;t pas sous une forme r&#233;guli&#232;re et
doit faire l&#8217;objet d&#8217;une analyse plus complexe du texte. Enfin, un troisi&#232;me type d&#8217;information se situe au niveau
des &#233;v&#233;nements et de la temporalit&#233; relatifs &#224; ces prescriptions m&#233;dicales et n&#233;cessite une analyse des ph&#233;nom&#232;nes
linguistiques entrant en jeu autour des noms de m&#233;dicaments.1 Le traitement de ce dernier type d&#8217;information a
&#233;t&#233; abandonn&#233; lors du d&#233;roulement du d&#233;fi 2009.
</p>
<p>3.2 Pr&#233;sentation du corpus
</p>
<p>Le corpus est compos&#233; de comptes rendus hospitaliers r&#233;dig&#233;s en anglais. Les documents proviennent d&#8217;un centre
m&#233;dical am&#233;ricain sp&#233;cialis&#233; en cardiologie. Ils ont fait l&#8217;objet d&#8217;une anonymisation o&#249; les informations per-
sonnelles (noms, pr&#233;noms, etc.) ont &#233;t&#233; remplac&#233;es par d&#8217;autres informations de m&#234;me type en conservant un
caract&#232;re vraisemblable. Le corpus de d&#233;veloppement int&#232;gre 696 documents, parmi lesquels 17 ont fait l&#8217;objet
d&#8217;une annotation, tandis que le corpus de test int&#232;gre 547 documents. Les documents sont structur&#233;s en sections
assez g&#233;n&#233;rales telles que histoire de la maladie, allergies, examens de laboratoire, suivi de l&#8217;hospitalisation, et
prescriptions de sortie. Les textes contiennent des abr&#233;viations qui concernent les noms de m&#233;dicaments (&#8220;vanc&#8221;
pour vancomycin, &#8220;levo&#8221; ou &#8220;levoflox&#8221; pour levofloxacin), les sympt&#244;mes m&#233;dicaux (&#8220;afib&#8221; pour atrial fibrilla-
tion, &#8220;abd pain&#8221; pour abdominal pain), les fr&#233;quences (&#8220;bid&#8221; pour bis in diem), et les modes d&#8217;administration (&#8220;iv&#8221;
pour intravenous, &#8220;sub&#8221; pour sub-lingual).
</p>
<p>Aucune annotation de r&#233;f&#233;rence n&#8217;existant pr&#233;alablement au lancement du d&#233;fi, la r&#233;f&#233;rence a &#233;t&#233; constitu&#233;e en
deux temps, premi&#232;rement par un vote majoritaire des sorties produites par les participants, et deuxi&#232;mement via
une phase d&#8217;adjudication faisant intervenir l&#8217;ensemble des participants au d&#233;fi (Uzuner et al., 2010b). Au final,
la r&#233;f&#233;rence a &#233;t&#233; constitu&#233;e de mani&#232;re collective pour 251 documents du corpus de test. Les r&#233;sultats que nous
pr&#233;sentons dans cet article pour la partie extraction de prescriptions m&#233;dicales se fondent donc sur l&#8217;&#233;valuation
op&#233;r&#233;e sur ces documents de r&#233;f&#233;rence.
</p>
<p>D&#233;veloppement Test
Nombre de documents 17 251
M&#233;dicaments 749 100,0 % 8 941 100,0 %
Dosage 397 53,0 % 4 460 49,9 %
Mode d&#8217;administration 253 33,8 % 3 389 37,9 %
Fr&#233;quence 374 49,9 % 4 042 45,2 %
Dur&#233;e 66 8,8 % 550 6,2 %
Raison 150 20,0 % 1 636 18,3 %
</p>
<p>TAB. 1 &#8211; Nombre d&#8217;&#233;l&#233;ments &#224; extraire dans les documents annot&#233;s des corpus de d&#233;veloppement et de test.
</p>
<p>1La prescription m&#233;dicale est-elle en cours, ou bien doit-elle &#234;tre commenc&#233;e ou arr&#234;t&#233;e ? O&#249; se situe la prescription m&#233;dicale sur l&#8217;&#233;chelle
temporelle (dans le pass&#233;, le pr&#233;sent ou le futur) ? Comment la prescription m&#233;dicale est-elle pr&#233;sent&#233;e au patient (le m&#233;dicament doit-il &#234;tre
pris obligatoirement, sous certaine condition, ou s&#8217;agit-il d&#8217;une suggestion) ?</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CYRIL GROUIN, LOUISE DEL&#201;GER, BRUNO CARTONI, SOPHIE ROSSET, PIERRE ZWEIGENBAUM
</p>
<p>Le tableau 1 renseigne du nombre d&#8217;informations attendues dans chaque corpus. Faute de disposer d&#8217;un corpus
de d&#233;veloppement enti&#232;rement annot&#233;, nous donnons la volum&#233;trie pour les 17 fichiers annot&#233;s qui nous ont &#233;t&#233;
fournis par les organisateurs avec le corpus de d&#233;veloppement. Si le nombre d&#8217;informations de chaque type reste
proportionnel entre les deux corpus, il appara&#238;t d&#8217;embl&#233;e que certaines informations sont peu pr&#233;sentes dans l&#8217;en-
semble des corpus, rendant difficile le d&#233;veloppement d&#8217;outils robustes pour les traiter. C&#8217;est notamment le cas
des informations de dur&#233;e renseign&#233;es dans moins de 10 % des prescriptions. Une prescription sur cinq seulement
int&#232;gre la raison pour laquelle le m&#233;dicament a &#233;t&#233; prescrit. Les autres types d&#8217;information sont davantage ren-
seign&#233;s : le mode d&#8217;administration dans une prescription sur trois, les dosage et fr&#233;quence dans des proportions
&#233;quivalentes d&#8217;une prescription sur deux.
</p>
<p>Dans l&#8217;exemple du tableau 2, nous repr&#233;sentons les informations &#224; extraire en les encadrant de balises. Les deux
occurrences du m&#233;dicament heparin doivent donner lieu &#224; deux lignes de sortie. La premi&#232;re ligne &#8211; relative &#224; la
premi&#232;re occurrence &#8211; int&#232;grera les informations de dosage, de mode d&#8217;administration, de fr&#233;quence et de raison,
alors que la seconde ligne &#8211; relative &#224; la seconde occurrence &#8211; ne comprendra que l&#8217;information de raison, les
autres informations se rapportant uniquement &#224; la premi&#232;re apparition.
</p>
<p>&lt;raison&gt; Prophylaxis &lt;/raison&gt; , &lt;medicament&gt; heparin &lt;/medicament&gt; &lt;dosage&gt; 5000 units &lt;/dosage&gt;
&lt;mode&gt; subcu &lt;/mode&gt; &lt;frequence&gt; t.i.d. &lt;/frequence&gt; - the patient has consistently refused her &lt;medi-
cament&gt; heparin &lt;/medicament&gt; .
</p>
<p>TAB. 2 &#8211; Exemple d&#8217;annotation en prescriptions m&#233;dicales.
</p>
<p>3.3 Description du syst&#232;me
</p>
<p>Notre syst&#232;me ayant &#233;t&#233; d&#233;velopp&#233; dans le cadre de la participation &#224; l&#8217;&#233;dition 2009 du d&#233;fi i2b2, nous l&#8217;avons
orient&#233; vers le traitement des informations suivantes : nom du m&#233;dicament, dosage, mode d&#8217;administration, fr&#233;-
quence, dur&#233;e, raison de la prescription, et type de portion de texte dans lequel appara&#238;t la prescription (liste ou
passage narratif). Nous avons fait le choix de d&#233;velopper un syst&#232;me reposant enti&#232;rement sur des r&#232;gles d&#8217;ex-
traction et des listes, sans recourir &#224; des outils externes tels que des &#233;tiqueteurs, lemmatiseurs ou analyseurs
syntaxiques. Ce choix repose sur le fait que les informations &#224; extraire peuvent l&#8217;&#234;tre, soit par la projection de
lexiques (noms de m&#233;dicaments, modes d&#8217;administration), soit par l&#8217;utilisation de r&#232;gles (les chiffres des dosages,
fr&#233;quences, dur&#233;es, etc.), ces m&#233;thodes permettant l&#8217;obtention rapide de r&#233;sultats de qualit&#233;.
</p>
<p>Les probl&#232;mes &#224; r&#233;soudre dans cette t&#226;che consistaient &#224; g&#233;rer l&#8217;exhaustivit&#233; des noms de m&#233;dicaments (g&#233;n&#233;-
riques, marques, classes th&#233;rapeutiques) et l&#8217;ambigu&#239;t&#233; intrins&#232;que de ces noms (distinguer la concentration du
dosage, rep&#233;rer les substances actives utilis&#233;es comme nom de m&#233;dicament). Nous devions &#233;galement calculer le
rattachement des informations aux noms de m&#233;dicaments, prendre en compte la factorisation des informations, et
consid&#233;rer les cas particuliers de reprises pronominales.
</p>
<p>3.3.1 Lexiques
</p>
<p>Nous avons cr&#233;&#233; trois types de lexiques. Le premier lexique concerne les noms de m&#233;dicaments et existe sous deux
versions : une version r&#233;duite de 8 923 noms de m&#233;dicaments issus de deux sites Internet (FDA2 et RxList3), et une
version plus large contenant 180 089 noms correspondant aux entr&#233;es du Metathesaurus de l&#8217;UMLS4 pour le type
s&#233;mantique Clinical drug. Les &#233;l&#233;ments pr&#233;sents dans cette seconde liste sont n&#233;anmoins sujets &#224; discussion et
ne correspondent pas toujours &#224; des noms de m&#233;dicaments tels que ceux attendus (alcool, tabac, etc.). Le second
lexique est constitu&#233; d&#8217;une liste de sympt&#244;mes m&#233;dicaux pour permettre l&#8217;identification de la prescription d&#8217;un
m&#233;dicament. Il a &#233;t&#233; cr&#233;&#233; &#224; partir des entr&#233;es de l&#8217;UMLS class&#233;es sous le type s&#233;mantique Sign and Symptom.
Enfin, le dernier lexique consiste en une liste d&#8217;abr&#233;viations et termes sp&#233;cifiques issue des travaux de (Berman,
2004). Nous avons mis en correspondance chaque terme avec le type d&#8217;information qui lui correspond : des
abr&#233;viations ou termes de types dosage (mg, sliding scale), mode d&#8217;administration (iv, intramuscular), fr&#233;quence
(qd, prn), dur&#233;e (week).
</p>
<p>2FDA : Food and Drug Administration, http://www.accessdata.fda.gov/scripts/cder/drugsatfda/index.cfm
3http://www.rxlist.com/
4UMLS : Unified Medical Language System.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ACC&#200;S AU CONTENU S&#201;MANTIQUE EN LANGUE DE SP&#201;CIALIT&#201;
</p>
<p>3.3.2 Algorithme
</p>
<p>Nous avons d&#233;fini une strat&#233;gie d&#8217;extraction d&#8217;information reposant sur deux &#233;tapes principales (figure 1) : dans
un premier temps, nous identifions les noms de m&#233;dicaments ; &#224; partir de cette premi&#232;re &#233;tape, nous recherchons
les informations associ&#233;es &#224; chaque m&#233;dicament.
</p>
<p>Documents Segmentationen phrases Identification
des
</p>
<p>m&#233;dicaments
Segmentation
en portions Identification
</p>
<p>des
informations
</p>
<p>associ&#233;es
</p>
<p>Production
des listes de
prescriptions
</p>
<p>Lexiques de
m&#233;dicaments
</p>
<p>Lexiques,
abr&#233;viations
</p>
<p>et r&#232;gles
</p>
<p>FIG. 1 &#8211; Architecture du syst&#232;me d&#8217;extraction de prescriptions m&#233;dicales utilis&#233; pour i2b2 2009.
</p>
<p>L&#8217;identification des noms de m&#233;dicaments repose uniquement sur un appariement exact avec le contenu des
lexiques de m&#233;dicaments pr&#233;c&#233;demment d&#233;crits. Une fois les noms de m&#233;dicaments identifi&#233;s dans un document,
nous cherchons les informations qui lui sont associ&#233;es. Nous avons &#233;labor&#233; des expressions r&#233;guli&#232;res pour chaqye
type d&#8217;information &#224; traiter, &#224; partir des guides d&#8217;annotation et d&#8217;exemples identifi&#233;s en corpus. Nous compl&#233;tons
l&#8217;application de ces r&#232;gles par une recherche dans les listes d&#8217;abr&#233;viations et de sympt&#244;mes.
</p>
<p>Pour d&#233;terminer les informations devant &#234;tre associ&#233;es &#224; chaque m&#233;dicament, nous avons proc&#233;d&#233; &#224; deux &#233;tapes
de segmentation du texte. Dans un premier temps, nous segmentons le texte en phrases en nous fondant sur la mise
en forme du document (lignes s&#233;paratrices et titres de section) et la ponctuation (en distinguant les points de fin de
phrase des points d&#8217;abr&#233;viation ou des points math&#233;matiques dans les d&#233;cimales en anglais). Nous identifions les
noms de m&#233;dicaments dans ces phrases. Dans un second temps, nous proc&#233;dons &#224; une segmentation des phrases
sur la base des noms de m&#233;dicaments pr&#233;c&#233;demment identifi&#233;s, en consid&#233;rant que chaque nom de m&#233;dicament
constitue le d&#233;but d&#8217;une portion de phrase. Nous cherchons alors les informations associ&#233;es &#224; chaque m&#233;dicament &#224;
l&#8217;int&#233;rieur de ces portions, consid&#233;rant que les informations associ&#233;es aux prescriptions m&#233;dicales suivent toujours
les noms de m&#233;dicaments. Pour le cas o&#249; certains types d&#8217;information n&#8217;auraient pas &#233;t&#233; trouv&#233;s &#224; la suite du nom
de m&#233;dicament, nous les cherchons dans la portion qui pr&#233;c&#232;de.
</p>
<p>Le syst&#232;me permet &#233;galement de g&#233;rer les cas de doubles entr&#233;es, lorsqu&#8217;une m&#234;me information s&#8217;applique &#224; deux
prescriptions diff&#233;rentes (deux m&#233;dicaments prescrits pour soigner la m&#234;me affection), ou parce qu&#8217;une seule
expression factorise deux informations de m&#234;me type (un dosage diff&#233;rent le matin et le soir). Nous avons g&#233;r&#233;
ces cas au moyen de r&#232;gles d&#233;finies empiriquement.
</p>
<p>Enfin, nous avons trait&#233; quelques cas particuliers de r&#233;solution des anaphores au moyen de r&#232;gles d&#233;di&#233;es : le
pronom &#8220;this&#8221; suivi de trois syntagmes verbaux, &#8220;was discontinued&#8221;, &#8220;was increased&#8221; et &#8220;was decreased&#8221;. Dans
ces cas de reprise pronominale, nous avons cr&#233;&#233; une seconde sortie pour le m&#233;dicament d&#233;sign&#233; par le pronom,
&#233;ventuellement compl&#233;t&#233;e par les informations suivant le syntagme verbal (en cas de modification du dosage, etc.).
</p>
<p>3.4 R&#233;sultats et discussion
</p>
<p>Nous donnons dans le tableau 3 les r&#233;sultats obtenus par notre syst&#232;me sur le corpus de test compos&#233; des 251
documents annot&#233;s collectivement. Comme pour toute &#233;valuation d&#8217;un syst&#232;me d&#8217;extraction d&#8217;information, deux
points sont ici &#233;valu&#233;s : le typage de l&#8217;&#233;l&#233;ment extrait d&#8217;une part, et la port&#233;e de l&#8217;extraction d&#8217;autre part. Les r&#233;sul-
tats pr&#233;sent&#233;s ici exigent que la port&#233;e ait &#233;t&#233; d&#233;termin&#233;e de fa&#231;on exacte (notre syst&#232;me peut avoir correctement
typ&#233; un &#233;l&#233;ment mais l&#8217;&#233;valuation sera incorrecte du fait d&#8217;une erreur de fronti&#232;re dans la port&#233;e de l&#8217;information
extraite). Les informations &#233;l&#233;mentaires de type dosage, mode d&#8217;administration, fr&#233;quence, dur&#233;e, et raison ne sont
consid&#233;r&#233;es comme pertinentes que si elles sont associ&#233;es dans la r&#233;f&#233;rence &#224; un m&#233;dicament. Les rang&#233;es m&#233;di-
cament, dosage, etc., &#233;valuent chaque type d&#8217;information s&#233;par&#233;ment. La rang&#233;e &#171; niveau horizontal &#187; demande
qu&#8217;une prescription soit compl&#232;tement et exactement reconnue pour &#234;tre consid&#233;r&#233;e comme correcte.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CYRIL GROUIN, LOUISE DEL&#201;GER, BRUNO CARTONI, SOPHIE ROSSET, PIERRE ZWEIGENBAUM
</p>
<p>Nombre Rappel Pr&#233;cision F1-mesure
Niveau horizontal 8 941 0.725 0.827 0.773
M&#233;dicament 8 941 0.793 0.802 0.798
Dosage 4 460 0.732 0.892 0.804
Mode d&#8217;administration 3 389 0.792 0.885 0.836
Fr&#233;quence 4 042 0.770 0.893 0.827
Dur&#233;e 550 0.282 0.657 0.394
Raison 1 636 0.234 0.412 0.299
</p>
<p>TAB. 3 &#8211; R&#233;sultats obtenus par notre syst&#232;me au d&#233;fi i2b2 2009 (recouvrement exact).
</p>
<p>Notre syst&#232;me obtient globalement de bons r&#233;sultats (il a &#233;t&#233; class&#233; 8&#232;me sur 20 participants internationaux) avec
une pr&#233;cision toujours sup&#233;rieure au rappel, notre syst&#232;me g&#233;n&#233;rant relativement peu de bruit. Certains types
d&#8217;information tels que la dur&#233;e et les raisons de la prescription ont produit des r&#233;sultats assez bas. Concernant
les dur&#233;es, le nombre restreint d&#8217;exemples dans le corpus de d&#233;veloppement ne nous a pas permis de d&#233;finir de
mani&#232;re pr&#233;cise et robuste les r&#232;gles appliqu&#233;es pour l&#8217;identification de ce type d&#8217;information.
</p>
<p>Nous estimons qu&#8217;un moyen d&#8217;am&#233;liorer la d&#233;tections des raisons passe par l&#8217;utilisation d&#8217;outils d&#8217;analyse syn-
taxique, de mani&#232;re &#224; identifier pr&#233;cis&#233;ment les syntagmes nominaux et pr&#233;positionnels. Il semble que dans une
bonne partie des situations o&#249; notre m&#233;thode n&#8217;a pas pu d&#233;tecter la raison d&#8217;une prescription, cette raison &#233;tait
exprim&#233;e dans le contexte d&#8217;une portion de phrase relativement bien form&#233;e, o&#249; les relations grammaticales ont
de bonnes chances d&#8217;&#234;tre analysables automatiquement et d&#8217;aider &#224; rattacher raison et m&#233;dicament. Cependant, la
variation syntaxique et l&#8217;&#233;tendue des raisons annot&#233;es dans le corpus d&#8217;entra&#238;nement t&#233;moignent de la complexit&#233;
de cette t&#226;che : les raisons &#8220;pain&#8221; (un seul terme), &#8220;the previous enterococcus infection&#8221; (un syntagme nominal), et
&#8220;had a temperature to about 101&#8221; (un syntagme verbal) ont ainsi &#233;t&#233; associ&#233;es au m&#233;dicament &#8220;vancomycin&#8221;. Un
autre moyen consiste &#224; utiliser une base de connaissances faisant le lien entre m&#233;dicament et sympt&#244;mes trait&#233;s :
si le terme &#8220;hypercholesterolemia&#8221; (ou une variante) est trouv&#233; dans le voisinage des m&#233;dicaments &#8220;Zocor&#8221; et
&#8220;simvastatin&#8221;, nous pourrions extraire la raison en accordant une importance accrue &#224; ce terme. Une autre piste
permettant l&#8217;am&#233;lioration de l&#8217;identification des informations associ&#233;es consiste &#224; mobiliser des pr&#233;suppos&#233;s d&#8217;ex-
pert, en adoptant une approche par inf&#233;rence (d&#233;duire le mode d&#8217;administration d&#8217;un m&#233;dicament &#224; partir de sa
forme gal&#233;nique). Le co&#251;t de constitution d&#8217;une telle base de donn&#233;es associ&#233; &#224; l&#8217;absence de normalisation des
textes risquent n&#233;anmoins de limiter les apports d&#8217;une telle d&#233;marche.
</p>
<p>4 Acc&#232;s aux concepts m&#233;dicaux
</p>
<p>4.1 Pr&#233;sentation g&#233;n&#233;rale
</p>
<p>La premi&#232;re piste de la campagne i2b2/VA 2010 concernait la d&#233;tection et le typage de concepts m&#233;dicaux dans
des comptes rendus m&#233;dicaux, parmi trois cat&#233;gories de concepts (voir tableau 4) : les probl&#232;mes se rapportent aux
observations faites sur l&#8217;&#233;tat du patient et concernent les maladies et sympt&#244;mes anormaux ou li&#233;s &#224; une maladie
existante, les traitements d&#233;crivent les m&#233;thodes utilis&#233;es pour r&#233;soudre le probl&#232;me d&#8217;un patient (proc&#233;dures,
m&#233;dicaments, etc.), et les examens se rapportent aux examens prescrits pour aider &#224; diagnostiquer ces probl&#232;mes.
</p>
<p>Concept Exemples
Probl&#232;me &lt;problem&gt; C5-6 disc herniation &lt;/problem&gt; with &lt;problem&gt; cord compression &lt;/problem&gt;
</p>
<p>PRN &lt;problem&gt; Shortness of Breath &lt;/problem&gt;
Traitement &lt;treatment&gt; bilateral lymph node dissection &lt;/treatment&gt;
</p>
<p>&lt;treatment&gt; LISINOPRIL &lt;/treatment&gt; 10 MG PO DAILY
Examen If &lt;test&gt; BS &lt;/test&gt; is less than 125
</p>
<p>He was found on &lt;test&gt; physical exam &lt;/test&gt; to have an asymmetric prostate
</p>
<p>TAB. 4 &#8211; Exemples de concepts de chaque type pour la t&#226;che i2b2/VA 2010.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ACC&#200;S AU CONTENU S&#201;MANTIQUE EN LANGUE DE SP&#201;CIALIT&#201;
</p>
<p>La syntaxe sp&#233;cifique de la langue m&#233;dicale utilis&#233;e dans les comptes rendus m&#233;dicaux a notamment &#233;t&#233; d&#233;crite
par (Sager et al., 1994, 1995; Sager &amp; Nh&#224;n, 2002). Nous constatons aisi que certaines phrases peuvent &#234;tre
constitu&#233;es presque exclusivement d&#8217;&#233;num&#233;rations, ne comprendre qu&#8217;un seul mot ou au contraire &#234;tre longues et
qu&#8217;il n&#8217;y a pas eu de normalisation dans la fa&#231;on de noter les &#233;l&#233;ments (voir tableau 5).
</p>
<p>Ph&#233;nom&#232;ne &#233;tudi&#233; Exemples
Absence de Supprelin La vs Supprelin LA
normalisation magnetic resonance imaging of ... vs MRI of ...
</p>
<p>Thaw vs THAUW
Forme des phrases On physical examination today , his lungs are clear to auscultation and percussion .
</p>
<p>Regular rhythm .
f / u with PCP and Dr. Pump as scheduled , return to ED with worsening sob or
increased cough or sputum production
</p>
<p>TAB. 5 &#8211; Exemples de probl&#232;mes rencontr&#233;s en langue de sp&#233;cialit&#233;.
</p>
<p>Ces diff&#233;rentes consid&#233;rations nous ont convaincus de ne pas proc&#233;der &#224; une analyse syntaxique des documents
comme traitement de base. Du fait de la forme tr&#232;s variable des expressions d&#233;signant les concepts &#224; d&#233;tecter, nous
avons &#233;galement d&#233;cid&#233; de ne pas chercher &#224; mod&#233;liser compl&#232;tement ces expressions par une ou plusieurs gram-
maires locales. Par ailleurs, disposant d&#8217;un corpus d&#8217;apprentissage de taille raisonnable, nous avons opt&#233; pour une
approche s&#8217;appuyant sur des champs conditionnels al&#233;atoires (CRF) (Lafferty et al., 2001), ces derniers permet-
tant de bonnes performances pour une t&#226;che d&#8217;&#233;tiquetage en s&#233;quence comme celle de la d&#233;tection de concepts.
Nous avons pour cela utilis&#233; l&#8217;impl&#233;mentation CRF++ (Kudo, 2007). Toutefois, si ces mod&#232;les permettent de
bonnes performances, des exp&#233;riences (Zidouni et al., 2010) ont montr&#233; qu&#8217;utiliser comme attributs des informa-
tions d&#8217;ordre linguistique (POS, informations s&#233;mantiques, etc.) permettait d&#8217;am&#233;liorer les mod&#232;les. Nous avons
cherch&#233; &#224; produire des informations et des analyses partielles des expressions concern&#233;es, et &#224; fournir au CRF des
attributs encodant ces informations. L&#8217;objectif &#233;tant de produire les analyses linguistiques que l&#8217;on peut obtenir de
fa&#231;on fiable et de d&#233;l&#233;guer au processus d&#8217;apprentissage les d&#233;cisions finales sur les fronti&#232;res et type des entit&#233;s.
</p>
<p>4.2 Description du corpus
</p>
<p>Le corpus se compose de comptes rendus cliniques provenant &#224; part &#233;gale de trois h&#244;pitaux nord-am&#233;ricains.5
</p>
<p>Le corpus d&#8217;entra&#238;nement se compose de 349 documents manuellement annot&#233;s6 tandis que le corpus de test
comprend 477 documents. Il n&#8217;existe pas de type de concept sur-repr&#233;sent&#233; par rapport aux autres types et la
distribution des types reste &#233;quivalente entre les deux corpus (voir tableau 6). Enfin, nous observons que les
concepts m&#233;dicaux &#224; identifier recouvrent des formes d&#8217;expressions assez diff&#233;rentes &#224; l&#8217;int&#233;rieur de chaque type.
Une abr&#233;viation ou un syntagme nominal complet peuvent tous deux constituer un concept m&#233;dical (tableau 4).
</p>
<p>D&#233;veloppement Test
Nombre de documents 349 477
Concepts 27 837 100,0 % 45 009 100,0 %
Probl&#232;me 11 968 43,0 % 18 550 41,2 %
Traitement 8 500 30,5 % 13 560 30,1 %
Examen 7 369 26,5 % 12 899 28,7 %
</p>
<p>TAB. 6 &#8211; Nombre d&#8217;&#233;l&#233;ments &#224; extraire dans les corpus de d&#233;veloppement et de test.
</p>
<p>5Beth Israel Deaconess Medical Center (Boston, MA), Partners HealthCare (Boston, MA), University of Pittsburgh Medical Center (Pitts-
burgh, PA). Ces instituts ont tous trois fourni des comptes rendus cliniques ; l&#8217;Universit&#233; de Pittsburgh a &#233;galement fourni des notes de suivi.
</p>
<p>6Les organisateurs ont &#233;galement fourni 827 documents non annot&#233;s avec le corpus de d&#233;veloppement. Nous avons fait le choix de ne
travailler que sur les 349 documents annot&#233;s, notre syst&#232;me reposant sur la construction de mod&#232;le par apprentissage (voir sous-section 4.3).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CYRIL GROUIN, LOUISE DEL&#201;GER, BRUNO CARTONI, SOPHIE ROSSET, PIERRE ZWEIGENBAUM
</p>
<p>4.3 Description du syst&#232;me
</p>
<p>4.3.1 Pr&#233;sentation g&#233;n&#233;rale
</p>
<p>L&#8217;approche que nous avons d&#233;velopp&#233;e (Minard et al., 2011) repose sur un syst&#232;me &#224; base d&#8217;apprentissage. Nous
avons ainsi cr&#233;&#233; des mod&#232;les d&#8217;apprentissage &#224; base de CRF en utilisant les traits habituels pour ce genre de t&#226;che,
&#224; savoir des n-grammes et des indices typographiques (casse, ponctuation, token alphab&#233;tique ou num&#233;rique etc.).
Nous avons &#233;galement ajout&#233; des traits correspondant aux r&#233;sultats d&#8217;analyses linguistiques.
</p>
<p>Afin de proc&#233;der &#224; diff&#233;rents tests lors de la construction du mod&#232;le, nous avons scind&#233; le corpus de d&#233;veloppe-
ment en sous-corpus d&#8217;entra&#238;nement (241 documents), de d&#233;veloppement (54 documents) et de test &#224; blanc (54
documents). Pour la phase de test du d&#233;fi, une fois trouv&#233;e la meilleure configuration, nous avons reconstruit un
mod&#232;le global fond&#233; sur l&#8217;ensemble des 349 documents.
</p>
<p>4.3.2 Algorithme
</p>
<p>Notre approche reposant sur l&#8217;application d&#8217;un mod&#232;le &#224; base d&#8217;apprentissage, nous avons mobilis&#233; plusieurs
ressources pour produire les traits n&#233;cessaires &#224; la construction du mod&#232;le (sch&#233;ma 2).
</p>
<p>Documents cliniques
</p>
<p>Tree Tagger
</p>
<p>Specialist lexicon
UMLS
</p>
<p>Wmatch
</p>
<p>&#201;tiquetage
lemmatisation
</p>
<p>Mod&#232;le CRF&#201;tiquetagelexical
</p>
<p>Typage s&#233;mantique
</p>
<p>Liste de concepts
</p>
<p> R&#232;gles de post-traitement
</p>
<p>FIG. 2 &#8211; Architecture du syst&#232;me d&#8217;extraction de concepts m&#233;dicaux utilis&#233; pour i2b2/VA 2010.
</p>
<p>Tous les mots des corpus ont d&#8217;abord &#233;t&#233; annot&#233;s en utilisant le Tree Tagger (Schmid, 1994) et ses mod&#232;les pour
l&#8217;anglais. Ainsi chaque token a &#233;t&#233; associ&#233; avec sa partie du discours et son lemme.
</p>
<p>Nous avons ensuite effectu&#233; un &#233;tiquetage &#224; l&#8217;aide d&#8217;informations lexicales en utilisant les ressources fournies
par le Specialist Lexicon de l&#8217;UMLS (Lindberg et al., 1993). Ces ressources contiennent 62 263 adjectifs et
320 013 noms, et distinguent les adjectifs relationnels des adjectifs qualificatifs, ainsi que diff&#233;rents types de
noms (noms propres, noms comptables et non comptables). Pour les adjectifs, cette ressource contient &#233;galement
des informations sur la position des adjectifs dans la phrase (attribut ou post-nominal).
</p>
<p>Nous avons &#233;galement ajout&#233; une information s&#233;mantique en nous appuyant sur les travaux de (Sager et al., 1995)
et sur les donn&#233;es d&#8217;entra&#238;nement. Nous avons ainsi construit des lexiques sp&#233;cialis&#233;s (pour les noms des parties du
corps, de maladie, de m&#233;dicaments) et des grammaires permettant de typer des segments en fonction de diff&#233;rentes
cat&#233;gories : les parties du corps (sternal articular facet of third costal cartilage), les analyses de laboratoire (blood
wbc, creatinine, hematocrit), les diff&#233;rents examens (angiography, biopsy), des pr&#233;- et post-marqueurs d&#8217;examens
(follow-up ..., physicial ..., ... levels), les m&#233;dicaments (Abacavir Sulfate), les mode d&#8217;administration (inhaler,
oral, pills), les instruments et objets m&#233;dicaux (cannula, pacemaker, stent), les proc&#233;dures (bypass, amputation,
resection), et les dosages (100 mg, 1 dose). Ces diff&#233;rentes cat&#233;gories ont paru pertinentes apr&#232;s examen du
corpus et analyse des contextes droit et gauche des concepts ainsi que de la composition des concepts eux-m&#234;mes.
Pr&#233;cisons que ces cat&#233;gories n&#8217;avaient pas vocation &#224; repr&#233;senter directement les concepts, mais &#224; fournir des
classes permettant de regrouper des mots ou groupes de mots sous une m&#234;me appellation afin de r&#233;duire l&#8217;espace
de recherche. Le tableau 7 montre des exemples de ces cat&#233;gories (partie gauche du tableau) et les met en rapport
avec les concepts (partie droite). Nous avons par ailleurs remarqu&#233; que ces cat&#233;gories fournissent des informations
structurantes qui se rapportent aux concepts. Ainsi, un test se rapporte souvent &#224; une partie de l&#8217;anatomie et une
proc&#233;dure alors que certains noms ou adjectifs sont fr&#233;quemment pr&#233;sents en partie droite (pr&#233;-marqueur) ou
gauche (post-marqueur) des concepts, en particulier pour les concepts probl&#232;me et examen.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ACC&#200;S AU CONTENU S&#201;MANTIQUE EN LANGUE DE SP&#201;CIALIT&#201;
</p>
<p>Annotation s&#233;mantique + POS Annotation correspondante du concept
1)_JJ Rapid_JJ &lt;anat&gt; atrial_JJ &lt;/anat&gt; &lt;diag&gt; fibril-
lation_NN &lt;/diag&gt; with_IN demand_NN &lt;diag&gt; ische-
mia_NN &lt;/diag&gt;
</p>
<p>1) &lt;problem&gt; Rapid atrial fibrillation
&lt;/problem&gt; with &lt;problem&gt; demand
ischemia &lt;/problem&gt;
</p>
<p>&lt;localisation&gt; Left_VVD &lt;/localisation&gt; &lt;anat&gt; heart_NN
&lt;/anat&gt; &lt;procedure&gt; catheterization_NN &lt;/procedure&gt; wi-
thout_IN intervention_NN (_( **DATE[Dec_NP 16_CD
07]_NN )_) ._SENT
</p>
<p>&lt;test&gt; Left heart catheterization &lt;/test&gt;
without &lt;treatment&gt; intervention &lt;/treat-
ment&gt; ( **DATE[Dec 16 07] ) .
</p>
<p>There_EX was_VBD no_DT &lt;diag&gt; diplopia_NN &lt;/diag&gt;
,_, visual_JJ &lt;pomark-disease&gt; loss_NN &lt;/pomark-disease&gt;
,_, &lt;diag&gt; speech_NN abnormality_NN &lt;/diag&gt; or_CC sen-
sory_JJ change_NN in_IN her_PP$ history_NN ._SENT
</p>
<p>There was no &lt;problem&gt; diplopia &lt;/pro-
blem&gt; , &lt;problem&gt; visual loss &lt;/pro-
blem&gt; , &lt;problem&gt; speech abnormality
&lt;/problem&gt; or &lt;problem&gt; sensory change
&lt;/problem&gt; in her history .
</p>
<p>&lt;premark-disease&gt; Significant_JJ &lt;/premark-disease&gt;
for_IN non-insulin_NN &lt;diag&gt; diabetes_NN mellitus_NN
&lt;/diag&gt; ,_, for_IN which_WDT he_PP takes_VVZ &lt;me-
doc&gt; Diabeta_NP &lt;/medoc&gt; ,_, one_CD QD_NNS ;_ :
&lt;anat&gt; right_JJ eye_NN &lt;/anat&gt; &lt;diag&gt; cataract_NN
&lt;/diag&gt; ,_, operated_VVN on_IN three_CD years_NNS
ago_RB ._SENT
</p>
<p>Significant for &lt;problem&gt; non-insulin dia-
betes mellitus &lt;/problem&gt; , for which he
takes &lt;treatment&gt; Diabeta &lt;/treatment&gt; ,
one QD ; &lt;problem&gt; right eye cataract
&lt;/problem&gt; , operated on three years ago .
</p>
<p>TAB. 7 &#8211; Lien entre information s&#233;mantique et concepts.
</p>
<p>Enfin, nous avons cherch&#233; &#224; voir s&#8217;il &#233;tait possible de typer s&#233;mantiquement les tokens en fonction de leurs pre-
miers ou derniers caract&#232;res que nous appelons par commodit&#233; pr&#233;fixe et suffixe. Nous avons d&#233;coup&#233; les diff&#233;rents
mots n&#8217;appartenant pas aux dictionnaires de sp&#233;cialit&#233; (m&#233;dicaments ou parties du corps) puis en avons extrait les
successions de caract&#232;res qui permettaient &#224; coup s&#251;r un d&#233;but de classification. Ainsi, les suffixes de type -stomy
renvoient fr&#233;quemment &#224; une proc&#233;dure. En tout, cinq classes s&#233;mantiques ont &#233;t&#233; utilis&#233;es (position, chiffrage,
proc&#233;dure, examen, diagnostic).
</p>
<p>Les grammaires ont &#233;t&#233; construites en utilisant WMATCH, un moteur d&#8217;analyse fond&#233; notamment sur des expres-
sions r&#233;guli&#232;res de mots (Galibert, 2009; Rosset et al., 2008). L&#8217;analyseur a &#233;t&#233; construit de mani&#232;re automatique
&#224; partir des donn&#233;es d&#8217;entra&#238;nement et des diff&#233;rents lexiques de sp&#233;cialit&#233; &#224; notre disposition. Ceux-ci &#233;taient au
nombre de trois : anatomie (145 199 mots ou expressions complexes), m&#233;dicaments (27 518 mots ou expressions
complexes), et maladies (175 645 mots ou expressions complexes). Nous avons d&#8217;autre part collect&#233; les collo-
cations des concepts et cr&#233;&#233;, en nous appuyant sur la fr&#233;quence et la distribution non ambigu&#235; des termes, des
lexiques sp&#233;cifiques &#224; la t&#226;che (modes d&#8217;administration, proc&#233;dures, outils m&#233;dicaux, localisations sur le corps du
patient &#8211; souvent en rapport avec une partie du corps &#8211;, examens, et pr&#233; et post-marqueurs, tant pour les examens
que pour les maladies). Ces lexiques ont &#233;t&#233; utilis&#233;s pour l&#8217;acquisition des r&#232;gles d&#8217;analyse au format WMATCH.
Le tableau 8 pr&#233;sente des exemples de cat&#233;gorisation de mot fond&#233; sur le suffixe (extrait), de r&#232;gle contextuelle
pour la d&#233;tection de la cat&#233;gorie mode et d&#8217;appel &#224; un lexique. La r&#232;gle de cat&#233;gorisation indique que les mots se
terminant par &#8220;asty&#8221; sont une proc&#233;dure. La r&#232;gle contextuelle contient deux applications possibles (s&#233;par&#233;es par
le symbole &#8220;|&#8221;) : les mots d&#233;tect&#233;s par la macro &amp;modes (un ensemble de r&#232;gles contextuelles) et suivis &#233;ventuel-
lement de load sont annot&#233;s comme &#233;tant un _mode ; il en est de m&#234;me pour le mot release, s&#8217;il est pr&#233;c&#233;d&#233; d&#8217;un
adjectif. L&#8217;application du lexique se fait en appelant la macro qui inclut le lexique de proc&#233;dures.
</p>
<p>Cat&#233;gorisation _procedure : [A-z]+ &quot;omy&quot; | [A-z]+ &quot;asty&quot; ... ;
R&#232;gle contextuelle _mode : (&amp;modes load ? | (&lt;= _JJ| _VVD| _VVN) release) ;
Application de lexique _procedure : (&amp;procedure) ;
</p>
<p>TAB. 8 &#8211; Exemples de r&#232;gles.
</p>
<p>Ces diff&#233;rentes informations ont constitu&#233; l&#8217;ensemble des traits qui ont aliment&#233; l&#8217;apprentissage du mod&#232;le CRF.
Ce mod&#232;le et les modules d&#8217;extraction de traits forment le syst&#232;me de base pour cette campagne d&#8217;&#233;valuation.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CYRIL GROUIN, LOUISE DEL&#201;GER, BRUNO CARTONI, SOPHIE ROSSET, PIERRE ZWEIGENBAUM
</p>
<p>Enfin, nous avons ajout&#233; en sortie de ce syst&#232;me une phase de correction par l&#8217;ajout de r&#232;gles de post-traitement.
Nous avons suppos&#233; que l&#8217;hypoth&#232;se &#171; un sens par corpus &#187; (Fung, 1998) est v&#233;rifi&#233;e dans une langue de sp&#233;cialit&#233;,
&#224; plus forte raison dans le typage de concepts m&#233;dicaux : nous avons examin&#233; les expressions &#233;tiquet&#233;es par des
types de concepts diff&#233;rents dans le corpus et avons normalis&#233; leur &#233;tiquette au type observ&#233; le plus fr&#233;quent
(un token ayant pour trait la cat&#233;gorie m&#233;dicament qui n&#8217;aurait pas &#233;t&#233; typ&#233; ou l&#8217;aurait &#233;t&#233; typ&#233; diff&#233;remment de
traitement est corrig&#233; avec le type traitement).
</p>
<p>4.4 R&#233;sultats et discussion
</p>
<p>Le tableau 9 pr&#233;sente les r&#233;sultats obtenus par notre syst&#232;me sur l&#8217;identification et le typage des concepts m&#233;-
dicaux. L&#8217;&#233;valuation a &#233;t&#233; r&#233;alis&#233;e sur 477 documents. Les chiffres renseign&#233;s dans ce tableau reposent sur un
appariement &#224; l&#8217;identique des concepts ; les erreurs de fronti&#232;re ont donc &#233;t&#233; p&#233;nalisantes.
</p>
<p>Nombre Rappel Pr&#233;cision F1-mesure
Global 27 837 0.726 0.826 0.773
Probl&#232;me 11 968 0.742 0.799 0.769
Traitement 8 500 0.723 0.843 0.778
Examen 7 369 0.705 0.851 0.771
</p>
<p>TAB. 9 &#8211; R&#233;sultats obtenus par notre syst&#232;me au d&#233;fi i2b2 2010 (recouvrement exact).
</p>
<p>Le syst&#232;me d&#8217;identification et de typage des concepts m&#233;dicaux obtient une F1-mesure g&#233;n&#233;rale de 0,773 (notre
syst&#232;me s&#8217;est class&#233; 12&#232;me sur 22 participants internationaux). Pour cette t&#226;che d&#8217;extraction de concepts m&#233;di-
caux, notre syst&#232;me obtient de nouveau une pr&#233;cision sup&#233;rieure au rappel pour chaque type de concept. Nous
notons que les performances du syst&#232;me se r&#233;v&#232;lent &#233;quivalentes sur les trois types de concepts m&#233;dicaux &#224; traiter,
cette observation s&#8217;expliquant par la r&#233;partition &#233;quilibr&#233;e des concepts dans ces trois cat&#233;gories. Les dix meilleurs
syst&#232;mes du d&#233;fi ont tous employ&#233; des m&#233;thodes d&#8217;apprentissage. Le meilleur syst&#232;me (De Bruijn et al., 2010) a
mod&#233;lis&#233; la t&#226;che avec un CRF et s&#8217;en est servi pour d&#233;finir les traits d&#8217;un mod&#232;le semi-markovien cach&#233;. Plusieurs
autres syst&#232;mes bien class&#233;s ont utilis&#233; comme traits le r&#233;sultat de syst&#232;mes de reconnaissance d&#8217;entit&#233;s m&#233;dicales.
</p>
<p>5 Conclusion
</p>
<p>Dans le cadre de ce travail, nous avons constitu&#233; un ensemble de ressources n&#233;cessaires au traitement de la langue
m&#233;dicale. Nous avons ainsi dress&#233; un inventaire exhaustif des noms de m&#233;dicaments (g&#233;n&#233;riques, marques et
classes th&#233;rapeutiques) et cr&#233;&#233; des lexiques d&#8217;abr&#233;viations et de sympt&#244;mes. Nous avons par ailleurs &#233;labor&#233; une
m&#233;thodologie de d&#233;tection des types d&#8217;entit&#233;s de diff&#233;rentes sortes (par l&#8217;application d&#8217;expressions r&#233;guli&#232;res et
l&#8217;utilisation d&#8217;un lexique d&#8217;abr&#233;viations sp&#233;cifiques) et de gestion de la factorisation d&#8217;information (coordination
et duplication). Enfin, nous avons &#233;tudi&#233; les caract&#233;ristiques linguistiques &#224; utiliser pour la construction de mod&#232;les
d&#8217;apprentissage d&#233;di&#233;s au traitement des concepts m&#233;dicaux.
</p>
<p>En Traitement Automatique des Langues, les syst&#232;mes &#224; base de r&#232;gles constituent une solution pertinente pour
traiter des corpus non annot&#233;s porteurs d&#8217;informations stables syntaxiquement. L&#8217;application de patrons syn-
taxiques permet effectivement d&#8217;obtenir rapidement de bons r&#233;sultats comme en t&#233;moignent ceux que nous avons
obtenus sur l&#8217;extraction d&#8217;information dans les prescriptions m&#233;dicales lors de l&#8217;&#233;dition 2009 du d&#233;fi i2b2.
</p>
<p>En revanche, la variation syntaxique des informations &#224; extraire se r&#233;v&#232;le beaucoup plus difficile &#224; traiter. L&#8217;utili-
sation seule de r&#232;gles syntaxiques conduit &#224; un manque de robustesse du syst&#232;me et doit faire l&#8217;objet d&#8217;une appli-
cation compl&#233;mentaire d&#8217;autres types de m&#233;thodes. &#192; cet effet, l&#8217;utilisation de m&#233;thodes hybrides rassemblant un
apprentissage supervis&#233; et des informations linguistiques permet d&#8217;accro&#238;tre les chances de traiter correctement ce
type de donn&#233;es. C&#8217;est l&#8217;approche que nous avons suivie pour l&#8217;identification et le typage des concepts m&#233;dicaux
pour l&#8217;&#233;dition 2010 du d&#233;fi i2b2 ; dans le cas pr&#233;sent, nous nous sommes servis d&#8217;informations d&#8217;ordre linguistique
&#224; deux reprises : en premier lieu pour constituer des traits sur chaque token de mani&#232;re &#224; construire un mod&#232;le
pour l&#8217;apprentissage, puis dans un second temps, comme moyen d&#8217;affiner les r&#233;sultats produits par l&#8217;application
du mod&#232;le pr&#233;c&#233;demment construit.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ACC&#200;S AU CONTENU S&#201;MANTIQUE EN LANGUE DE SP&#201;CIALIT&#201;
</p>
<p>Dans le domaine m&#233;dical, la langue de sp&#233;cialit&#233; utilis&#233;e rev&#234;t un caract&#232;re particuli&#232;rement stable et formel,
tant sur les plans syntaxique que s&#233;mantique, voire structurel. Ces caract&#233;ristiques nous autorisent &#224; utiliser des
approches hybrides lorsqu&#8217;existent des corpus annot&#233;s. Lorsque les annotations font d&#233;faut, les caract&#233;ristiques
linguistiques de la langue m&#233;dicale nous permettent n&#233;anmoins de travailler uniquement &#224; base de patrons syn-
taxiques. Ces m&#233;thodes montrent leurs limites lorsque l&#8217;information &#224; extraire se trouve r&#233;dig&#233;e en texte plus libre,
&#224; l&#8217;instar des raisons qui justifient une prescription m&#233;dicale. Dans cette perspective, des traitements linguistiques
plus complexes faisant intervenir une analyse en d&#233;pendances pourraient constituer une alternative int&#233;ressante.
</p>
<p>Remerciements
</p>
<p>Ce travail a &#233;t&#233; partiellement r&#233;alis&#233; dans le cadre des projets Akenaton (ANR-07-TecSan-001) et Qu&#230;ro (finan-
cement Oseo, agence fran&#231;aise pour l&#8217;innovation et la recherche).
</p>
<p>Les donn&#233;es m&#233;dicales utilis&#233;es proviennent du consortium Informatics for Integrating Biology to the Bedside
(i2b2) gr&#226;ce aux financements num&#233;ros U54LM008748 de la National Library of Medicine, VA HSR HIR 08-
374 du Consortium for Healthcare Informatics Research (CHIR), et VA HSR HIR 08-204 du VA Informatics and
Computing Infrastructure (VINCI).
</p>
<p>R&#233;f&#233;rences
</p>
<p>BERMAN J. J. (2004). Pathology Abbreviated : A Long Review of Short Terms. Archives of Pathology &amp;
Laboratory Medicine, 128(3), 347&#8211;352.
CLAVEAU V. &amp; KIJAK E. (2010). Analyse morphologique en terminologie biom&#233;dicale par alignement et
apprentissage non-supervis&#233;. In Actes de TALN 2010.
</p>
<p>DE BRUIJN B., CHERRY C., KIRITCHENKO S., MARTIN J. &amp; ZHU X. (2010). MRC at i2b2 : one challenge,
three practical tasks, nine statistical systems, hundreds of clinical records, millions of useful features. In Proc.
of i2b2/VA 2010.
</p>
<p>DEL&#201;GER L., GROUIN C. &amp; ZWEIGENBAUM P. (2010). Extracting Medical Information from Narrative Patient
Records : the Case of Medication-related Information. J Am Med Inform Assoc, 17(5), 555&#8211;558.
DOAN S. &amp; XU H. (2010). Recognizing Medication related Entities in Hospital Discharge Summaries using
Support Vector Machine. In Coling2010 : Poster Volume, p. 259&#8211;266.
</p>
<p>FRIEDMAN C. (2000). A broad-coverage natural language processing system. In AMIA Annu Symp Proc, p.
270&#8211;274.
</p>
<p>FUNG P. (1998). A Statistical View on Bilingual Lexicon Extraction : From Parallel Corpora to Non-parallel
Corpora. In AMTA, p. 1&#8211;17.
</p>
<p>GALIBERT O. (2009). Approches et m&#233;thodologies pour la r&#233;ponse automatique &#224; des questions adapt&#233;es &#224; un
cadre interactif en domaine ouvert. PhD thesis, Universit&#233; Paris-Sud 11, Orsay, France.
</p>
<p>HAMON T. &amp; GRABAR N. (2010). Linguistic approach for identification of medication names and related
information in clinical narratives. J Am Med Inform Assoc, 17(5), 549&#8211;554.
KUDO T. (2007). CRF++. http ://crfpp.sourceforge.net/.
</p>
<p>LAFFERTY J., MCCALLUM A. &amp; PEREIRA F. (2001). Conditional Random Fields : Probabilistic models for
segmenting and labeling sequence data. In Proc. of ICML, p. 282&#8211;289.
</p>
<p>LI D., KIPPER-SCHULER K. &amp; SAVOVA G. (2008). Conditionnal Random Fields and Support Vector Machines
for Disorder Named Entity Recognition in Clinical Texts. In BioNLP2008 : Current Trends in Biomedical
Natural Language Processing, p. 94&#8211;95.
</p>
<p>LINDBERG D., HUMPHREYS B. &amp; MCCRAY A. (1993). The Unified Medical Language System. Meth Inform
Med, 32(4), 281&#8211;291.
LONG W. (2007). Lessons Extracting Diseases from Discharge Summaries. In AMIA Annu Symp Proc, p.
478&#8211;482.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CYRIL GROUIN, LOUISE DEL&#201;GER, BRUNO CARTONI, SOPHIE ROSSET, PIERRE ZWEIGENBAUM
</p>
<p>MINARD A.-L., LIGOZAT A.-L., BEN ABACHA A., BERNHARD D., CARTONI B., DEL&#201;GER L., GRAU B.,
ROSSET S., ZWEIGENBAUM P. &amp; GROUIN C. (2011). Hybrid Methods for improving Information Access in
Clinical Documents : Concept, Assertion, and Relation Identification. J Am Med Inform Assoc. &#192; para&#238;tre.
</p>
<p>ROSSET S., GALIBERT O., BERNARD G., BILINSKI E. &amp; ADDA G. (2008). The LIMSI participation to the
QAst track. In Working Notes of CLEF 2008 Workshop, Aarhus, Danemark.
</p>
<p>SAGER N. (1981). Natural Language Processing : A Computer Grammar of English and Its Applications.
Addison Wesley.
</p>
<p>SAGER N., LYMAN M., NH&#192;N N. &amp; TICK L. (1994). Automatic Encoding into SNOMED III : A Preliminary
Investigation. In Proc. of the 18th Annual Symposium on Computer Applications in Medical Care, p. 230&#8211;234.
</p>
<p>SAGER N., LYMAN M., NH&#192;N N.-T. &amp; TICK L. J. (1995). Medical language processing : applications to
Patient Data Representation and Automatic Encoding. Meth Inform Med, 34(1&#8211;2), 140&#8211;146.
SAGER N. &amp; NH&#192;N N.-T. (2002). The Computability of strings, transformations, and sublanguage. In B. E.
NEVIN &amp; S. M. JOHNSON, Eds., The legacy of Zellig Harris &#8211; Language and information into the 21st century
- volume 2 : computability of language and computer applications, volume 2, chapter 4, p. 79&#8211;120. Amster-
dam/Philadelphia : John Benjamins Publishing Company.
</p>
<p>SCHMID H. (1994). Probabilistic Part-of-Speech Tagging Using Decision Trees. In Proc. of the International
Conference on New Methods in Language Processing, p. 44&#8211;49.
</p>
<p>TIKK D. &amp; SOLT I. (2010). Improving textual medication extraction using combined conditional random fields
and rule-based systems. J Am Med Inform Assoc, 17(5), 540&#8211;544.
UZUNER O., SOLTI I. &amp; CADAG E. (2010a). Extracting medication information from clinical text. J Am Med
Inform Assoc, 17(5), 514&#8211;518.
UZUNER O., SOLTI I., XIA F. &amp; CADAG E. (2010b). Community annotation experiment for ground truth
generation for the i2b2 medication challenge. J Am Med Inform Assoc, 17(5), 519&#8211;523.
WANG Y. (2009). Annotating and Recognising Named Entities in Clinical Notes. In Proc. of the ACL-IJCNLP
2009 Student Research Workshop, p. 18&#8211;26, Singapore.
</p>
<p>ZIDOUNI A., ROSSET S. &amp; GLOTIN H. (2010). Efficient Combined Approach for Named Entity Recognition
in Spoken Language. In Proc. of InterSpeech, Makuhari, Japon.</p>

</div></div>
</body></html>