<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Une proc&#233;dure pour identifier les modifieurs de la valence affective d'un mot dans des textes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>Une proc&#233;dure pour identifier 
 les modifieurs de la valence affective d'un mot dans des textes 
</p>
<p>No&#233;mi Boubel1   Yves Bestgen2 
</p>
<p>(1)  UCLouvain, Cental, Place Blaise Pascal, 1, B-1348 Louvain-la-Neuve, Belgique 
(2) UCLouvain, CECL, B-1348 Louvain-la-Neuve, Belgique 
noemi.boubel@uclouvain.be, yves.bestgen@uclouvain.be 
</p>
<p>R&#233;sum&#233; : Cette recherche s'inscrit dans le champ de la fouille d'opinion et, plus particuli&#232;rement, dans 
celui de l'analyse de la polarit&#233; d&#8217;une phrase ou d'un syntagme. Dans ce cadre,  la prise en compte du 
contexte linguistique dans lequel apparaissent les mots porteurs de valence est particuli&#232;rement importante. 
Nous proposons une m&#233;thodologie pour extraire automatiquement de corpus de textes de telles expressions 
linguistiques. Cette approche s'appuie sur un corpus de textes, ou d'extraits de textes, dont la valence est 
connue, sur un lexique de valence construit &#224; partir de ce corpus au moyen d'une proc&#233;dure automatique et 
sur un analyseur syntaxique. Une &#233;tude exploratoire, limit&#233;e &#224; la seule relation syntaxique associant un 
adverbe &#224; un adjectif, laisse entrevoir les potentialit&#233;s de l'approche.  
</p>
<p>Abstract This research is situated within the field of opinion mining and focuses more particularly on the 
analysis of the opinion expressed in a sentence or a syntagm. Within this frame of research, taking into 
account the linguistic context in which words which carry valence appear is particularly important.  We 
propose a methodology to automatically extract such linguistic expressions from text corpora. This 
approach is based on (a) a corpus of texts, or text excerpts, the valence of which is known, (b) on a valence 
lexicon built from this corpus using an automatic procedure and (c) on a parser. An exploratory study, 
focusing on the syntactic relation associating an adverb to an adjective, shows the potential of the approach. 
</p>
<p>Mots-cl&#233;s : modifieurs de valence, fouille d&#8217;opinion, lexique de valence 
Keywords: contextual valence shifter, opinion mining, semantic orientation lexicon 
</p>
<p>1 Introduction 
</p>
<p>Depuis une dizaine d'ann&#233;es, la d&#233;tection d'opinion et de sentiments dans les textes est devenue un sujet de 
recherche important en traitement automatique du langage, ainsi qu&#8217;un enjeu strat&#233;gique pour les 
entreprises et les institutions (Pang, Lee, 2008). La t&#226;che classique de ce domaine consiste &#224; d&#233;terminer 
automatiquement la polarit&#233; globale d&#8217;un texte. Progressivement, l'attention des chercheurs s'est &#233;galement 
port&#233;e vers le niveau phrastique ou syntagmatique afin d'identifier les segments d'un texte qui expriment 
une opinion, la valence de celle-ci et sa cible (Hatzivassiloglou, Wiebe, 2000 ; Kessler, Nicolov, 2009 ; 
Vernier et al., 2009). Ce deuxi&#232;me axe de recherche souligne l'importance de la prise en compte du contexte 
linguistique dans lequel apparaissent les mots porteurs de valence. Si certains travaux en fouille d&#8217;opinion 
commencent &#224; prendre en compte ce genre de ph&#233;nom&#232;nes (Kennedy, Inkpen, 2006 ; Musat, Trausan-Matu, 
2010 ; Wilson et al., 2005), tr&#232;s rares sont ceux qui en ont fait leur objet central d&#8217;&#233;tude. Une recherche de 
Zaenen et Polanyi (2004) constitue cependant une exception notable. Leur hypoth&#232;se de travail est que la 
valence de termes polaris&#233;s peut &#234;tre renforc&#233;e ou affaiblie par la pr&#233;sence d'autres items lexicaux, par la 
structure du discours et le type de texte, ou enfin par des facteurs culturels. Ces chercheuses proposent 
d'appeler contextual valence shifters les diff&#233;rents &#233;l&#233;ments ou proc&#233;d&#233;s ayant un impact sur la valeur d&#8217;un 
mot comme la pr&#233;sence d'une n&#233;gation, d'un adverbe de degr&#233;, d'un verbe modal ou d'une tournure ironique. 
Il faut toutefois noter que les arguments empiriques pr&#233;sent&#233;s reposent sur l'analyse de quelques exemples </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NO&#201;MI BOUBEL, YVES BESTGEN 
 
</p>
<p>le plus souvent construits &#224; dessein. Plus r&#233;cemment, Klenner, Petrakis, et Fahrni (2009) et Vernier et al. 
(2009) ont d&#233;velopp&#233; des ensembles de r&#232;gles plus complexes et plus pr&#233;cises &#224; partir d'une analyse 
linguistique approfondie d'un corpus et montr&#233; l'utilit&#233; de celles-ci pour d&#233;tecter les &#233;valuations localement 
exprim&#233;es dans un texte. Enfin, dans une autre optique, Vernier et Monceaux (2010) se servent de ces 
modifieurs de valence (l&#224; encore d&#233;finis a priori) pour cr&#233;er un lexique axiologique sur la base de tests 
s&#233;mantiques.   
</p>
<p>&#192; notre connaissance, aucune proc&#233;dure syst&#233;matique n'a &#233;t&#233; propos&#233;e pour identifier les expressions 
linguistiques qui modifient la valence d'un mot alors qu'une telle proc&#233;dure semble indispensable en raison 
de la tr&#232;s grande diversit&#233; de ces expressions et de leur variabilit&#233; selon le genre de textes. L'objectif de 
cette recherche est d'essayer de r&#233;pondre &#224; cette lacune. Apr&#232;s avoir pr&#233;sent&#233; la proc&#233;dure que nous 
proposons et les diff&#233;rentes ressources qu'elle n&#233;cessite, nous rapportons une &#233;tude exploratoire qui illustre 
son fonctionnement.  
</p>
<p>2 Approche propos&#233;e 
</p>
<p>L&#8217;id&#233;e de d&#233;part consiste &#224; employer une proc&#233;dure automatique pour rechercher dans des textes class&#233;s 
selon leur polarit&#233;, comme des critiques de films ou de produits, les termes porteurs de valence les plus 
marqu&#233;s et extraire des informations &#224; propos du contexte dans lequel ils apparaissent. Notre hypoth&#232;se est 
que les expressions linguistiques qui ont pour fonction d'att&#233;nuer ou d'inverser la valence d'un terme seront 
tout particuli&#232;rement fr&#233;quentes dans le contexte d'un terme dont la valence est oppos&#233;e &#224; celle du texte 
dans lequel il appara&#238;t. Par contre, celles qui ont pour fonction de renforcer la valence d'un terme 
s'observeront tout particuli&#232;rement dans le contexte d'un terme dont la valence est similaire &#224; celle du texte 
dans lequel il appara&#238;t. On peut aussi penser qu'un nombre plus important d'expressions ayant un effet 
att&#233;nuant pourrait &#234;tre observ&#233; en relation avec de mots de polarit&#233; extr&#234;me pr&#233;sents dans des textes 
&#233;valuatifs neutres.  
</p>
<p>Cette m&#233;thodologie n&#233;cessite un corpus de textes d&#233;j&#224; class&#233;s selon la dimension &#233;valuative, un lexique de 
mots extr&#234;mes en termes de valence et un analyseur syntaxique. Id&#233;alement, le corpus devrait &#234;tre (comme 
toujours) le plus grand possible, mais, surtout, &#234;tre prioritairement compos&#233; d'&#233;nonc&#233;s &#233;valuatifs afin que 
l'emploi des constructions &#233;tudi&#233;es dans des fonctions non &#233;valuatives n'alt&#232;re pas trop la pr&#233;cision des 
analyses. Le lexique de valence, quant &#224; lui, doit &#234;tre sp&#233;cifiquement adapt&#233; au corpus &#233;tudi&#233; afin de 
prendre en compte un maximum de mots tr&#232;s positifs et tr&#232;s n&#233;gatifs (voir Vernier et al. (2009) pour un 
argument similaire). L'&#233;tude exploratoire pr&#233;sent&#233;e ci-dessous essaie de mettre en pratique ces contraintes.  
</p>
<p>3 Etude exploratoire 
</p>
<p>Afin d'&#233;valuer les potentialit&#233;s de la m&#233;thode propos&#233;e, nous avons opt&#233;, dans cette &#233;tude exploratoire, pour 
l'analyse de la relation syntaxique associant un adverbe et un adjectif ayant une valence tr&#232;s forte parce 
qu'on peut penser que cette construction, qui recouvre un grand nombre de mots diff&#233;rents, modifie 
fr&#233;quemment et fortement la valence de mots. Un autre int&#233;r&#234;t de cette relation est que, si l'approche 
fonctionne, les r&#233;sultats obtenus devraient largement correspondre aux intuitions linguistiques. Ceci aura 
n&#233;anmoins pour cons&#233;quence regrettable d'en r&#233;duire l'originalit&#233;. 
</p>
<p>3.1 Corpus 
</p>
<p>Un corpus de critiques de films nous a sembl&#233; id&#233;al pour tester l'approche parce que celles-ci peuvent &#234;tre 
trouv&#233;es en abondance sur internet. Le site allocine.fr, par exemple, propose, pour un grand nombre de 
films, de tr&#232;s brefs extraits d'articles de diff&#233;rents journaux auxquels est attribu&#233;e une note sur une &#233;chelle 
en 5 points allant d'un avis tr&#232;s n&#233;gatif &#224; un avis tr&#232;s positif1  (voir exemple ci-dessous et dans la suite). Ces 
extraits mettent particuli&#232;rement en &#233;vidence l'opinion du journaliste et non le sujet du film ou l'intrigue, ce 
                                                           
1  Les notes initialement attribu&#233;es par les auteurs des articles selon le syst&#232;me de notation en vigueur dans 
</p>
<p>la source, et donc a priori fiable &#233;tant donn&#233; l'expertise des auteurs, sont remises par allocine.fr  sur une 
seule et m&#234;me &#233;chelle.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE PROCEDURE POUR IDENTIFIER LES MODIFIEURS DE VALENCE AFFECTIVE DANS DES TEXTES 
 
</p>
<p>qui est une propri&#233;t&#233; int&#233;ressante pour la m&#233;thodologie propos&#233;e puisqu'on peut penser que la quasi-totalit&#233; 
des adjectifs de valence extr&#234;me pr&#233;sents dans ces extraits sera porteuse d'une information &#233;valuative.  
</p>
<p>1. C'est gentiment amusant, pas trop crado bien qu'&#233;grillard, mais &#231;a n'offre pas le moindre int&#233;r&#234;t sur 
le plan cin&#233;matographique. [&#171; 1001 pattes &#187; &#8211; L&#8217;Humanit&#233; &#8211; Note : 3] 
</p>
<p>3.2 Lexique de valence 
</p>
<p>Pour d&#233;terminer l&#8217;orientation s&#233;mantique d'un maximum de termes pr&#233;sents dans le corpus, nous avons 
employ&#233; la m&#233;thode d'apprentissage supervis&#233; de mots germes d&#233;velopp&#233;e par Vincze et Bestgen (2011). &#192; 
la suite des approches propos&#233;es par Bestgen (2002) et Turney et Littman (2003), cette m&#233;thode utilise une 
proc&#233;dure de r&#233;gression pour estimer la valence d'un terme sur la base de ses proximit&#233;s th&#233;matiques dans 
un corpus avec d'autres mots dont la valence est connue. Dans la pr&#233;sente &#233;tude, les proximit&#233;s th&#233;matiques 
entre les termes sont obtenues au moyen de l'analyse s&#233;mantique latente (Berry et al., 1993 ; Deerwester et 
al., 1990) du corpus de critiques et les mots, dont la valence est connue a priori et qui servent donc &#224; 
construire le mod&#232;le pr&#233;dictif, proviennent d'une norme lexicale de 3252 mots &#233;valu&#233;s sur une &#233;chelle &#224; 7 
points allant de tr&#232;s d&#233;sagr&#233;able (1) &#224; tr&#232;s agr&#233;able (7) par un minimum de 30 juges (Hogenraad et al., 
1995). En sortie, la m&#233;thode attribue une valence &#224; l'ensemble des termes contenus dans le corpus de 
critiques qui ont une fr&#233;quence sup&#233;rieure ou &#233;gale &#224; 10, soit 9368 mots. Pour la suite des analyses, nous 
avons retenu comme termes extr&#234;mes n&#233;gatifs les 10% de cette liste les plus extr&#234;mes du c&#244;t&#233; n&#233;gatif et 
proc&#233;der de mani&#232;re similaire pour les termes extr&#234;mes positifs. De ces deux listes, seuls les adjectifs ont 
&#233;t&#233; employ&#233;s dans la suite des analyses. &#192; titre d'exemple, les cinq adjectifs les plus n&#233;gatifs et les plus 
positifs obtenus par cette proc&#233;dure sont respectivement insignifiant, sadique, pr&#233;tentieux, sordide, glauque 
et merveilleux, d&#233;licieux, agr&#233;able, chaleureux, rafra&#238;chissant. Il est &#224; noter que, lors de la d&#233;termination de 
la valence des termes, les notes attribu&#233;es aux critiques n'interviennent en aucune mani&#232;re.  
</p>
<p>3.3 Analyse syntaxique 
</p>
<p>Afin de mettre en place la m&#233;thodologie propos&#233;e plus haut, nous avons d&#233;velopp&#233; une s&#233;rie de scripts perl 
permettant d'extraire les relations syntaxiques impliquant un terme d'une liste &#233;tablie au pr&#233;alable, gr&#226;ce &#224; 
un analyseur syntaxique robuste, XIP (Xerox Incremental Parser, A&#239;t-Mokhtar  et al., 2002). Le corpus est 
tout d'abord &#233;tiquet&#233; par l'analyseur selon les relations de d&#233;pendances pr&#233;sentes. Puis les relations 
(ADJMOD) associant un adjectif pr&#233;sent dans notre lexique &#224; un adverbe sont extraites du corpus et mises 
en relation avec la note de la critique dans laquelle ils apparaissent. Nous obtenons donc des triplets 
comme : ADV=&quot;compl&#232;tement&quot;, ADJ+=&quot;indigeste&quot;, NOTE=&quot;2&quot; ou ADV=&quot;souvent&quot;, ADJ+=&quot;hilarant&quot;, 
NOTE=&quot;3&quot;. 
</p>
<p>4 Analyses 
</p>
<p>4.1 Traitements statistiques 
</p>
<p>La partie sup&#233;rieure du Tableau 1 pr&#233;sente un r&#233;sum&#233; num&#233;rique du corpus analys&#233; en termes de nombre de 
critiques, nombre de mots et nombre d'adjectifs extr&#234;mes pour les diff&#233;rentes notes attribu&#233;es aux critiques. 
On observe que, non seulement, il y a moins de critiques extr&#234;mes (1 ou 5), mais que les critiques les plus 
n&#233;gatives sont aussi les plus br&#232;ves puisqu'elles ont une longueur moyenne de 21 mots alors que la longueur 
moyenne calcul&#233;e sur l'ensemble des critiques est sup&#233;rieure &#224; 26 mots. De plus, s'il y a globalement plus 
d'adjectifs tr&#232;s positifs que d'adjectifs tr&#232;s n&#233;gatifs, leur distribution en fonction de la note des critiques 
correspond &#224; ce &#224; quoi on pouvait s'attendre : une proportion plus grande d'adjectifs n&#233;gatifs dans les 
critiques les plus n&#233;gatives et l'inverse dans les critiques les plus positives. 
</p>
<p>Les donn&#233;es recueillies par l'approche propos&#233;e peuvent &#234;tre pr&#233;sent&#233;es sous la forme de tables de 
contingence, une par adverbe analys&#233;, construites sur la base des trois variables : la note des critiques, la 
valence de l'adjectif et l'adverbe. La partie inf&#233;rieure du Tableau 1 donne cette table de contingence &#224; trois 
entr&#233;es pour l'adverbe jamais. Les analyses les plus pertinentes pour nos objectifs visent &#224; d&#233;terminer, 
s&#233;par&#233;ment pour les adjectifs positifs et n&#233;gatifs, si l'adverbe modifie plus fr&#233;quemment les adjectifs </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NO&#201;MI BOUBEL, YVES BESTGEN 
 
</p>
<p>pr&#233;sents dans les critiques qui ont re&#231;u une note sp&#233;cifique. Elle porte donc sur les tables de contingence 
form&#233;es par les variables Note et Adverbe (cellules en vert et en jaune). 
</p>
<p>Ces tables de contingence ont &#233;t&#233; analys&#233;es au moyen du test du Chi-carr&#233; qui &#233;value l'ind&#233;pendance entre 
les deux variables formant la table. Lorsque ce test donne un r&#233;sultat statistiquement significatif pour un 
alpha de 0.05, nous avons calcul&#233; la statistique du r&#233;sidu ajust&#233; qui indique les cellules qui contribuent le 
plus aux &#233;carts &#224; l'ind&#233;pendance (Everitt, 1977) en employant le m&#234;me alpha pour signaler les contributions 
potentiellement int&#233;ressantes. Ces analyses statistiques n'ont &#233;t&#233; effectu&#233;es que sur les adverbes ayant une 
fr&#233;quence totale dans le corpus au moins &#233;gale &#224; 20. 
</p>
<p>   
1 
</p>
<p> 
2 
</p>
<p>Note 
3 
</p>
<p> 
4 
</p>
<p> 
5 
</p>
<p> 
Total 
</p>
<p>Nbr. Critiques  3641 16135 23210 25904 8671 77561 
</p>
<p>Nbr. Mots  77028 412990 619490 680796 239358 2029662 
</p>
<p>Nbr. Adj. +  506 3356 7964 11088 3979 26893 
</p>
<p>Nbr. Adj. -  1226 4871 4111 3783 1259 15150 
</p>
<p>Jamais 1 1 2 3 0 7  
</p>
<p>Adj+ -------- 505 3355  7962 11085 3979 26886 
</p>
<p>Jamais 0 4 13 42 17 76  
</p>
<p>Adj- -------- 1226 4867 4098 3741 1242 15174 
</p>
<p>Tableau 1 : Statistiques descriptives et tables de contingence pour jamais 
</p>
<p>4.2 Analyse des r&#233;sultats 
</p>
<p>Le Tableau 2 met en &#233;vidence une s&#233;rie d'adverbes qui fonctionnent comme des inverseurs ou des 
att&#233;nuateurs de valence. Par exemple, l'adverbe jamais utilis&#233; avec un adjectif n&#233;gatif est significativement 
trop rare dans des critiques tr&#232;s n&#233;gatives ou n&#233;gatives, et trop fr&#233;quent dans les critiques positives et tr&#232;s 
positives. On notera que cet adverbe est rarement employ&#233; avec un terme positif, un r&#233;sultat auquel nous ne 
nous attendions pas. Parmi les autres adverbes trop fr&#233;quemment associ&#233;s &#224; des adjectifs de la polarit&#233; 
inverse &#224; celle de la critique ou trop peu fr&#233;quemment associ&#233;s &#224; des adjectifs de m&#234;me polarit&#233; que la 
critique, on peut mentionner pas, parfois, un peu, trop, moins, peu, assez, plut&#244;t. Parmi les adverbes 
apparaissant trop souvent dans des critiques de m&#234;me polarit&#233; que l'adjectif qui lui est associ&#233;, et qui donc 
pr&#233;sentent le profil d'un intensifieur de valence, on peut citer franchement, compl&#232;tement, totalement, bien, 
profond&#233;ment, particuli&#232;rement. 
</p>
<p>D'autres r&#233;sultats semblent plus &#233;tonnants. C'est le cas, par exemple, de tellement [2] ou de 
particuli&#232;rement, (a priori intensifiant), trop souvent associ&#233;s &#224; un adjectif positif dans une critique n&#233;gative 
ou de tr&#232;s trop rarement associ&#233; &#224; un adjectif positif dans des critiques tr&#232;s positives, ou encore de 
faussement [3] dont l'impact sugg&#233;r&#233; par l'analyse statistique serait l'intensification. Des exemples de ces 
cas permettent de se rendre compte de la diversit&#233; et de la complexit&#233; des ph&#233;nom&#232;nes jouant sur la polarit&#233; 
canonique d'un terme. 
</p>
<p>2. Une com&#233;die tellement sotte qu'on l'oublie &#224; la seconde o&#249; l'on a quitt&#233; la salle. Tellement 
inoffensive, inefficace, et rat&#233;e que m&#234;me les ados risquent cette fois de passer la main. 
</p>
<p>3. L'ancienne version, cr&#233;pitante, visait &#224; tout dire sur les hommes, celle-ci passe les femmes au gril, 
sur le ton de la presse people et avec une connivence faussement m&#233;chante. 
</p>
<p>Plus g&#233;n&#233;ralement, les adverbes repris dans le Tableau 2 sont de nature tr&#232;s diverse : adverbes de 
comparaison (aussi, &#224; la fois), adverbes de fr&#233;quence (souvent, parfois, peu), adverbes mettant peut-&#234;tre 
plus en avant le locuteur (franchement, totalement) ou adverbes porteurs eux-m&#234;mes d'une certaine valence </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>UNE PROCEDURE POUR IDENTIFIER LES MODIFIEURS DE VALENCE AFFECTIVE DANS DES TEXTES 
 
</p>
<p>(faussement ou trop). De plus, le contexte plus large joue &#233;galement souvent un r&#244;le important ; l'inversion 
de la valence d'un adjectif, par exemple, peut se faire &#224; un autre niveau (tournures n&#233;gatives diverses, 
combinaison de termes de polarit&#233; diff&#233;rente, utilisation de l'ironie par divers proc&#233;d&#233;s [4] [5]).  
</p>
<p>4. La comp&#233;tition pour le navet le plus farfelu de l'ann&#233;e est lanc&#233;e sur des tr&#232;s hautes bases 
5. (&#8230;) le spectateur rendra facilement les armes devant un film aride, peu loquace, aussi chaleureux 
</p>
<p>que l&#8217;Allemagne de l&#8217;Est de la grande &#233;poque. 
 
Valence Fr&#233;quence Note 1 Note 2 Note 3 Note 4 Note 5 
</p>
<p>Trop rare   profond&#233;ment, 
particuli&#232;rement 
</p>
<p>moins, trop, peu, 
plut&#244;t, parfois, 
un peu 
</p>
<p>moins, pas, 
plut&#244;t, assez, 
un peu, trop, 
tr&#232;s, parfois 
</p>
<p>Positif 
</p>
<p>Trop 
fr&#233;quent 
</p>
<p>particuli&#232;re-
ment, pas, 
tellement 
</p>
<p>peu, pas moins, plut&#244;t, 
assez, trop, un 
peu,  parfois, 
toujours, fort 
</p>
<p>particuli&#232;rement, 
tr&#232;s 
</p>
<p>plus, &#224; la fois, 
absolument, 
profond&#233;ment 
</p>
<p>Trop rare parfois, un 
peu, jamais, 
trop, presque 
</p>
<p>jamais, 
parfois, un 
peu, moins 
</p>
<p>compl&#232;tement trop, assez, 
aussi, 
franchement, 
vite, souvent, 
totalement, 
lourdement, 
plut&#244;t, bien, de 
plus 
</p>
<p>un peu, assez, 
trop, aussi 
</p>
<p>N&#233;gatif 
 
</p>
<p>Trop 
fr&#233;quent 
</p>
<p>compl&#232;temen, 
faussement, 
aussi, de plus, 
proprement, 
franchement 
</p>
<p>lourdemen, 
vite, 
souvent, 
totalement, 
assez, 
franche-
ment, bien, 
aussi 
</p>
<p>un peu, parfois, 
trop, pas, moins, 
assez 
</p>
<p>jamais jamais, &#224; la 
fois, presque 
</p>
<p>Tableau 2 : Adverbes identifi&#233;s par l'analyse statistique2  
</p>
<p>Les analyses qui pr&#233;c&#232;dent portent uniquement sur les adverbes suffisamment fr&#233;quents pour &#233;tablir des 
conclusions statistiques. La proc&#233;dure a &#233;galement permis d'extraire 183 adverbes associ&#233;s une seule fois &#224; 
un des adjectifs retenus dans notre lexique et 376 adverbes n&#8217;apparaissent qu&#8217;un maximum de 10 fois. En se 
basant sur la note de la critique dans laquelle ils apparaissent ainsi que sur la polarit&#233; de l'adjectif associ&#233;, 
une &#233;tude similaire &#224; celle qui vient de l&#8217;&#234;tre peut &#234;tre men&#233;e. &#192; titre d'exemple, on peut citer abyssalement 
vide,  artificiellement glauque, authentiquement laids, am&#233;ricainement na&#239;f. 
</p>
<p>5 Conclusion 
</p>
<p>Nous avons propos&#233; une m&#233;thodologie pour extraire automatiquement de corpus de textes des expressions 
linguistiques susceptibles de modifier la valence de mots. Cette approche s'appuie sur un corpus de textes, 
ou d'extraits de textes, dont la valence est connue, sur un lexique de valence construit &#224; partir de ce corpus 
au moyen d'une proc&#233;dure automatique et sur un analyseur syntaxique. L'&#233;tude exploratoire, limit&#233;e &#224; la 
seule relation syntaxique associant un adverbe &#224; un adjectif, laisse entrevoir les potentialit&#233;s de l'approche. 
Elle laisse toutefois de nombreuses questions en suspens. Les principales nous semblent porter sur le degr&#233; 
d'efficacit&#233; qui pourra &#234;tre obtenu avec d'autres structures et la possibilit&#233; de g&#233;n&#233;raliser les constructions 
identifi&#233;es dans un corpus donn&#233; &#224; d'autres genres de textes. 
</p>
<p>                                                           
2  Les adverbes sont ordonn&#233;s dans chaque cellule en fonction de la taille des r&#233;sidus ajust&#233;s (en valeur 
</p>
<p>absolue). Il s'ensuit que les premiers mentionn&#233;s sont plus typiques que les derniers. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>NO&#201;MI BOUBEL, YVES BESTGEN 
 
</p>
<p>R&#233;f&#233;rences 
</p>
<p>A&#207;T-MOKHTAR S., CHANOD J.-P., ROUX C. (2002). Robustness beyond shallowness : incremental deep 
parsing. Natural Language Engineering 8, 121-144.  
</p>
<p>BERRY, M.. DO, T., O'BRIEN, G., KRISHNA, V., VARADHAN, S. (1993). SVDPACKC: Version 1.0 User's 
Guide, Tech. Rep. CS-93-194, University of Tennessee, Knoxville, TN. 
</p>
<p>BESTGEN, Y. (2002). D&#233;termination de la valence affective de termes dans de grands corpus de textes. 
Actes de CIFT'02, 81-94. 
</p>
<p>DEERWESTER, S., DUMAIS, S.T., FURNAS, G.W., LANDAUER, T.K., HARSHMAN, R. (1990). Indexing by 
Latent Semantic Analysis. Journal of the American Society for Information Science 41, 391-407. 
</p>
<p>EVERITT, B. (1977) The Analysis of Contingency Tables. Chapman &amp; Hall. 
</p>
<p>HATZIVASSILOGLOU, V., WIEBE, J. (2000). Effects of adjective orientation and gradability on sentence 
subjectivity. Proceedings of the 18th Conference on Computational Linguistics, 299-305. 
</p>
<p>HOGENRAAD, R., BESTGEN, Y., NYSTEN, J.L. (1995). Terrorist Rhetoric : Texture and Architecture, In 
Nissan et Schmidt (Eds.), From Information to Knowledge, 48-59, Intellect Book. 
</p>
<p>KENNEDY, A.,  D. INKPEN. (2006). Sentiment Classification of Movie Reviews Using Contextual Valence 
Shifters. Computational Intelligence 22, 110&#8211;125. 
</p>
<p>KESSLER J.S., NICOLOV, N. (2009). Targeting sentiment expressions through supervised ranking of 
linguistic configurations. Proceedings of ICWSM 2009. 
</p>
<p>KLENNER, M., S. PETRAKIS, A. FAHRNI. Robust Compositional Polarity Classification. Proceedings of 
RANLP 2009. 
</p>
<p>MUSAT, C., TRAUSAN-MATU, S. (2010). The Impact of Valence Shifters on Mining Implicit Economic 
Opinions. Proceedings of AIMSA 2010, 131&#8211;140. 
</p>
<p>PANG, B., LEE L. (2008) Opinion mining and sentiment analysis. Foundations and Trends in Information 
Retrieval 2, 1&#8211;135 
</p>
<p>TURNEY P. (2002). Thumbs up or Thumbs down? Semantic Orientation Applied to Unsupervised 
Classification of Reviews. Proceedings of ACL&#8217;02. 
</p>
<p>TURNEY, P.D., LITTMAN, M. (2003). Measuring Praise and Criticism: Inference of Semantic Orientation 
from Association. ACM Transactions on Information Systems 21,  315--346. 
</p>
<p>VERNIER, M., MONCEAUX, L. (2010). Enrichissement d&#8217;un lexique de termes subjectifs &#224; partir de tests 
s&#233;mantiques. Traitement automatique des langues 51, 125-149.  
</p>
<p>VERNIER, M., MONCEAUX, L.,  DAILLE, B. (2009). Cat&#233;gorisation des &#233;valuations dans un corpus de blogs 
multi-domaine. Revue des Nouvelles Technologies de l&#8217;Information (RNTI-E-17), 45&#8211;70. 
</p>
<p>VINCZE, N., BESTGEN, Y. (2011). Identification de mots germes pour la construction d'un lexique de 
valence au moyen d'une proc&#233;dure supervis&#233;e. Actes de TALN2011. 
</p>
<p>WILSON, T., J. WIEBE, P. HOFFMANN. &#171; Recognizing Contextual Polarity in Phrase-level Sentiment 
Analysis &#187;. Proceedings of the Conference on Human Language Technology and Empirical Methods in 
Natural Language Processing,  347&#8211;354. 
</p>
<p>ZAENEN, A., POLANYI L. (2004). Contextual Valence Shifters. Proceedings of AAAI Spring Symposium on 
Exploring Attitude and Affect in Text, 106&#8211;111. </p>

</div></div>
</body></html>