<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Identifier la cible d&#8217;un passage d&#8217;opinion dans un corpus multith&#233;matique</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211;1er juillet 2011
</p>
<p>Identifier la cible d&#8217;un passage d&#8217;opinion
dans un corpus multith&#233;matique
</p>
<p>Matthieu Vernier, Laura Monceaux, B&#233;atrice Daille
Universit&#233; de Nantes, LINA, 2, rue de la Houssini&#232;re 44322 Nantes
</p>
<p>{Matthieu.Vernier, Laura.Monceaux, Beatrice.Daille}@univ-nantes.fr
</p>
<p>R&#233;sum&#233;. L&#8217;identification de la cible d&#8217;une d&#8217;opinion fait l&#8217;objet d&#8217;une attention r&#233;cente en fouille d&#8217;opinion.
Les m&#233;thodes existantes ont &#233;t&#233; test&#233;es sur des corpus monoth&#233;matiques en anglais. Elles permettent principalement
de traiter les cas o&#249; la cible se situe dans la m&#234;me phrase que l&#8217;opinion. Dans cet article, nous abordons cette
probl&#233;matique pour le fran&#231;ais dans un corpus multith&#233;matique et nous pr&#233;sentons une nouvelle m&#233;thode pour
identifier la cible d&#8217;une opinion apparaissant hors du contexte phrastique. L&#8217;&#233;valuation de la m&#233;thode montre une
am&#233;lioration des r&#233;sultats par rapport &#224; l&#8217;existant.
</p>
<p>Abstract. Recent works on opinion mining deal with the problem of finding the semantic relation between
sentiment expressions and their target. Existing methods have been evaluated on monothematic english corpora.
These methods are only able to solve intrasentential relationships. In this article, we focus on this task apply to
french and we present a new method for solving intrasentential and intersentential relationships in a multithematic
corpus. We show that our method is able to improve results on the intra- and intersential relationships.
</p>
<p>Mots-cl&#233;s : Fouille d&#8217;opinions, Identification des cibles, M&#233;thode RankSVM.
</p>
<p>Keywords: Opinion mining, Targeting sentiment expressions, RankSVM.
</p>
<p>1 Introduction
</p>
<p>Le d&#233;but des ann&#233;es 2000 marque l&#8217;&#233;closion de la fouille d&#8217;opinions. Les travaux pionniers se sont principalement
int&#233;ress&#233;s &#224; la cat&#233;gorisation globale de documents d&#8217;opinion, soit selon leur polarit&#233; (Turney, 2002; Torres-
Moreno et al., 2007), soit selon leur subjectivit&#233; (Wiebe &amp; Riloff, 2005). Depuis, un tr&#232;s grand nombre de travaux
traitent de donn&#233;es textuelles d&#8217;opinion dans des axes scientifiques et des domaines applicatifs tr&#232;s diff&#233;rents. Plus
r&#233;cemment, le recul sur dix ans de travaux permet selon nous de segmenter le domaine en cinq probl&#233;matiques :
&#8211; extraire les mots d&#8217;opinions d&#8217;une langue pour construire des ressources et am&#233;liorer leur qualit&#233; (Baccianella
</p>
<p>et al., 2010; Mathieu, 2006) ;
&#8211; cat&#233;goriser globalement un document selon l&#8217;opinion (Torres-Moreno et al., 2007; Pang &amp; Lee, 2008) ;
&#8211; cat&#233;goriser des passages d&#8217;opinions dans un document qui exprime des opinions h&#233;t&#233;rog&#232;nes (Wilson, 2008) ;
&#8211; identifier la source 1 d&#8217;une opinion (Choi et al., 2005; Ruppenhofer et al., 2008) ;
&#8211; identifier la cible 2 d&#8217;une opinion (Kessler &amp; Nicolov, 2009; Jakob &amp; Gurevych, 2010).
</p>
<p>1. l&#8217;&#233;nonciateur d&#8217;une opinion.
2. le sujet sur lequel porte l&#8217;opinion.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATTHIEU VERNIER, LAURA MONCEAUX, B&#201;ATRICE DAILLE
</p>
<p>L&#8217;identification de la cible d&#8217;un passage d&#8217;opinion fait partie des axes les plus r&#233;cemment abord&#233;s dans la
litt&#233;rature du domaine. Aucun travail ne s&#8217;y est int&#233;ress&#233; pour le traitement du fran&#231;ais et, &#224; notre connaissance,
seuls deux travaux anglophones majeurs y consacrent une &#233;tude sp&#233;cifique (Kessler &amp; Nicolov, 2009; Jakob
&amp; Gurevych, 2010). Pourtant, afin d&#8217;analyser des textes dont le contenu est de plus en plus h&#233;t&#233;rog&#232;ne (blogs,
forums, etc.), cette probl&#233;matique correspond &#224; un besoin particuli&#232;rement criant. Elle n&#233;cessite de combiner des
techniques connues en traitement automatique des langues (analyse syntaxique, r&#233;solution d&#8217;anaphore pronominale
et nominale, segmentation th&#233;matique, etc.) pour proposer une solution souple et efficace (voir &#167;. 2).
</p>
<p>Dans cet article, nous nous int&#233;ressons sp&#233;cifiquement &#224; l&#8217;identification de la cible d&#8217;une opinion (voir &#167;. 2).
Nous renvoyons &#224; (Vernier &amp; Monceaux, 2010) pour la pr&#233;sentation d&#8217;une m&#233;thode et d&#8217;une ressource pour
la d&#233;tection automatique des passages d&#8217;opinions pour le fran&#231;ais. Dans nos travaux pr&#233;c&#233;dents, nous avons
d&#233;velopp&#233; le premier corpus francophone (corpus Blogoscopie) dans lequel les passages d&#8217;opinions et leur cible
sont annot&#233;s (voir &#167;. 3.1) (Dubreil et al., 2008). Une &#233;tude statistique sur ce corpus permet de structurer le
probl&#232;me et de proposer diff&#233;rentes pistes de solutions (voir &#167;. 3.2). Nous pr&#233;sentons quatre m&#233;thodes (dont deux
m&#233;thodes baseline) pour identifier la cible d&#8217;un passage d&#8217;opinion (voir &#167;. 4). Nous exp&#233;rimentons ces quatre
m&#233;thodes sur une sous-partie du corpus Blogoscopie et discutons des r&#233;sultats obtenus (voir &#167;. 5).
</p>
<p>2 Une probl&#233;matique r&#233;cente peu explor&#233;e
</p>
<p>L&#8217;identification de la cible d&#8217;une opinion a souvent &#233;t&#233; ignor&#233;e ou consid&#233;r&#233;e comme un aspect de second
plan. Par exemple, les travaux de cat&#233;gorisation de l&#8217;opinion au niveau du document consid&#232;rent qu&#8217;un texte est
monoth&#233;matique et n&#8217;&#233;value qu&#8217;un seul objet donn&#233; (un film, un livre, un appareil photo, etc.). Ce n&#8217;est que
r&#233;cemment que quelques travaux anglophones ont directement ax&#233;s leur &#233;tude sur cette probl&#233;matique (Kessler &amp;
Nicolov, 2009; Jakob &amp; Gurevych, 2010). Ils ont introduit le terme target, traduit ici par cible, pour d&#233;signer l&#8217;objet
concern&#233; par un passage d&#8217;opinion. Dans la pratique, ils ont limit&#233; cette cible &#224; quelques cat&#233;gories d&#8217;objets :
&#8211; un produit particulier ou une marque (iPhone, EOS 5D de Canon, Apple, Matrix, etc.) ;
&#8211; une caract&#233;ristique d&#8217;un produit (la dur&#233;e de vue de la batterie, le sc&#233;nario d&#8217;un film, etc.).
En fait, de part le large &#233;ventail d&#8217;objets qu&#8217;elle peut couvrir, la notion de cible est complexe &#224; circonscrire. Elle
est d&#8217;ailleurs souvent laiss&#233;e floue dans les travaux du domaine. Dans notre cadre, nous consid&#233;rons que tout objet
peut &#234;tre la cible d&#8217;une opinion. Nous t&#226;chons de mieux appr&#233;hender cette notion en pr&#233;sentant quatre facteurs qui
rendent complexe la probl&#233;matique d&#8217;identification de la cible d&#8217;une &#233;valuation (&#167;. 2.1). Plusieurs approches ont
&#233;t&#233; propos&#233;es mais celles-ci ne r&#233;solvent que partiellement la t&#226;che et n&#8217;ont &#233;t&#233; appliqu&#233;es qu&#8217;&#224; l&#8217;anglais. Nous
pr&#233;cisons leurs limites et motivons le travail pr&#233;sent&#233; dans cet article (&#167;. 2.2).
</p>
<p>2.1 Une t&#226;che complexe
</p>
<p>L&#8217;identification de la cible d&#8217;une opinion consiste &#224; relier un passage d&#8217;opinion avec l&#8217;objet du monde qu&#8217;il
&#233;value. Dans (1), il y a ainsi trois passages d&#8217;opinions qui &#233;valuent un objet cible unique. N&#233;anmoins, cette t&#226;che
s&#8217;av&#232;re particuli&#232;rement complexe de part quatre facteurs que nous pr&#233;cisons ci-dessous.
</p>
<p>(1) L&#8217;&#233;quipe de France va mal . Entre honte et d&#233;ception .
</p>
<p>Diff&#233;rentes formes textuelles pour un unique objet du monde Premier facteur, comme l&#8217;a introduit Benveniste
(Benveniste, 1966), il importe de distinguer les signes linguistiques et les objets du monde auxquels ils font
r&#233;f&#233;rences. Un m&#234;me objet peut &#234;tre repr&#233;sent&#233; dans le texte par diff&#233;rentes expressions nominales ou pronominales.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFIER LES CIBLES DE PASSAGES D&#8217;OPINIONS DANS UN CORPUS MULTITH&#201;MATIQUE
</p>
<p>Dans (2) et (3), on parle de l&#8217;objet du monde &#233;quipe de France de football par une variante nominale m&#233;tonymique
(les Bleus) et par une anaphore pronominale (elle). Dans un but applicatif, il est n&#233;cessaire de regrouper les
opinions qui portent sur le m&#234;me objet et de nommer l&#8217;objet &#233;valu&#233; le plus pr&#233;cis&#233;ment possible. On ne pourra ainsi
pas consid&#233;rer le pronom elle comme la cible de l&#8217;&#233;valuation s&#233;duisante. Les Bleus est une r&#233;ponse interm&#233;diaire
plus acceptable pour identifier l&#8217;objet cible r&#233;ellement &#233;valu&#233; (l&#8217;&#233;quipe de France de football).
</p>
<p>(2) [...] lors du fiasco des Bleus en juin. (3) Elle a enfin &#233;t&#233; s&#233;duisante [...].
</p>
<p>Les relations m&#233;ronymiques entre objets Les objets sont potentiellement li&#233;s &#224; d&#8217;autres objets par des relations
m&#233;ronymiques 3. D&#232;s lors, m&#234;me si &#233;valuer un m&#233;ronyme A d&#8217;un mot B peut &#234;tre une fa&#231;on d&#8217;&#233;valuer indirectement
B, il importe de consid&#233;rer le m&#233;ronyme A comme la cible exacte de l&#8217;&#233;valuation. Ainsi, dans (4) et (5), on &#233;value
tout d&#8217;abord la d&#233;fense et le marquage sur les corners de l&#8217;&#233;quipe de France et non l&#8217;&#233;quipe de France dans sa
globalit&#233;.
</p>
<p>(4) Disons-le clairement : la d&#233;fense fran&#231;aise n&#8217;a pas &#233;t&#233; tr&#232;s bonne , ce soir.
</p>
<p>(5) Le marquage sur les corners reste encore approximatif .
</p>
<p>Pr&#233;sence de plusieurs objets candidats autour de l&#8217;opinion Le troisi&#232;me facteur est la pr&#233;sence de plusieurs
objets distincts dans le contexte d&#8217;un m&#234;me passage d&#8217;opinion. Dans (6), les deux passages d&#8217;opinions portent sur
des cibles distinctes qu&#8217;il faut pouvoir d&#233;terminer parmi les quatres objets pr&#233;sents dans la phrase : la derni&#232;re
finale de la coupe du monde, l&#8217;&#233;quipe de France, le coursier, les pizzas. L&#8217;objet le plus proche de l&#8217;opinion n&#8217;est
pas n&#233;cessairement sa cible.
</p>
<p>(6) [...] pizzas command&#233;es lors de la derni&#232;re finale de coupe du monde avec l&#8217;&#233;quipe de France ,
</p>
<p>coursier courageux , pizzas aussi banales que le match .
</p>
<p>Proximit&#233; al&#233;atoire entre l&#8217;opinion et sa cible Dernier facteur de complexit&#233;, la cible &#233;valu&#233;e ne se situe pas
toujours &#224; proximit&#233; du passage d&#8217;opinion. Dans (7), le passage d&#8217;opinion de la provocation 4 porte sur la ligne
du s&#233;lectionneur qui se trouve dans la phrase pr&#233;c&#233;dente. Le pronom ce en est une anaphore. N&#233;anmoins, la
pr&#233;sence de nombreux autres objets dans le contexte (un iota, le jeu, les joueurs, la concr&#233;tisation de cette vue)
rend complexe l&#8217;identification de la cible r&#233;elle de l&#8217;opinion pour une approche automatique.
</p>
<p>(7) force est de constater que la ligne du s&#233;lectionneur n&#8217;a jamais boug&#233; d&#8217;un iota : le jeu
</p>
<p>appartient aux joueurs. Ce qui a souvent pu passer pour de la provocation n&#8217;est en fait [...]
</p>
<p>Pour r&#233;soudre la probl&#233;matique d&#8217;identification de la cible d&#8217;une opinion, il convient donc de consid&#233;rer ces
quatre facteurs. Le processus d&#8217;identification consiste alors &#224; :
&#8211; rep&#233;rer les diff&#233;rents objets impliqu&#233;s dans un &#233;nonc&#233;. Ceux-ci sont g&#233;n&#233;ralement repr&#233;sent&#233;s textuellement par
</p>
<p>des groupes nominaux ou pronominaux (t&#226;che T1) ;
&#8211; identifier l&#8217;objet cible qui est directement concern&#233; par une opinion (t&#226;che T2) ;
&#8211; r&#233;soudre les relations d&#8217;anaphores nominales ou pronominales entre les objets (t&#226;che T3) ;
&#8211; r&#233;soudre les relations m&#233;ronymiques entre les objets (t&#226;che T4).
</p>
<p>3. Un m&#233;ronyme A d&#8217;un mot B est un mot dont le signifi&#233; d&#233;signe une sous-partie du signifi&#233; de B.
4. Ce passage est consid&#233;r&#233; comme une opinion m&#234;me s&#8217;il s&#8217;agit d&#8217;un discours rapport&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATTHIEU VERNIER, LAURA MONCEAUX, B&#201;ATRICE DAILLE
</p>
<p>2.2 Travaux li&#233;s et motivations
</p>
<p>Pour r&#233;soudre l&#8217;identification de la cible d&#8217;une opinion, quatre types d&#8217;approches ont &#233;t&#233; propos&#233;es dans les
travaux du domaine. Les solutions qu&#8217;elles proposent ne sont que partielles et n&#233;cessitent d&#8217;&#234;tre am&#233;lior&#233;es. De
plus, elles n&#8217;ont &#233;t&#233; &#233;valu&#233;es que sur l&#8217;anglais et sur des corpus monoth&#233;matiques.
</p>
<p>Quatre approches propos&#233;es La proximit&#233; est la premi&#232;re hypoth&#232;se consid&#233;r&#233;e pour relier une cible et une
opinion. Ainsi, dans les travaux de Grefenstette et al. (2004) (textes journalistiques sur la politique) et Mishne
&amp; Glance (2006) (blogs sur le cin&#233;ma), les auteurs consid&#232;rent un mot ou une expression w comme objet cible.
Toutes les opinions d&#8217;un document qui co-occurent avec w dans une certaine fen&#234;tre de mots, sont consid&#233;r&#233;es
comme des opinions qui portent sur w. Cette t&#226;che n&#8217;&#233;tant pas le coeur de leur travail, l&#8217;efficacit&#233; de cette m&#233;thode
n&#8217;a pas &#233;t&#233; &#233;valu&#233;e. Les d&#233;pendances syntaxiques entre une opinion et une cible constitue la deuxi&#232;me m&#233;thode
pour r&#233;soudre cette probl&#233;matique. Hu &amp; Liu (2004) se sont restreints aux chemins syntaxiques proches entre un
adjectif et une cible dans un corpus de film. De la m&#234;me fa&#231;on, Bethard et al. (2004) se sont int&#233;ress&#233;s uniquement
aux verbes d&#8217;opinion. Bloom et al. (2007) ont d&#233;velopp&#233; manuellement des listes de chemins de d&#233;pendances
syntaxiques entre une opinion et sa cible dans des corpus de produits commerciaux. La pr&#233;cision obtenue varie
autour de 0,70. Toutes ces approches ont &#233;t&#233; entra&#238;n&#233;es sur des corpus monoth&#233;matiques ce qui tend &#224; restreindre la
richesse des cas observ&#233;s. De plus, ces m&#233;thodes ne sont pas applicables dans les nombreux cas o&#249; la cible se situe
dans une phrase diff&#233;rente de l&#8217;opinion. Kim &amp; Hovy (2006) ont ainsi montr&#233; que dans une majorit&#233; des cas l&#8217;&#233;tude
des d&#233;pendances syntaxiques ne suffit pas &#224; d&#233;terminer la bonne cible et qu&#8217;elle est souvent confondue avec la
source de l&#8217;opinion. En combinant des informations lexicales, grammaticales et syntaxiques par apprentissage,
Kessler &amp; Nicolov (2009) ont am&#233;lior&#233; les r&#233;sultats des approches syntaxiques sur un corpus monoth&#233;matique de
critiques de voiture. Leur m&#233;thode est la m&#233;thode &#233;tat de l&#8217;art pour l&#8217;anglais, n&#233;anmoins elle se restreint toujours
au grain phrase et ne traite pas les nombreux cas o&#249; la cible n&#8217;est pas pr&#233;sente dans la m&#234;me phrase que l&#8217;opinion.
Ils se sont &#233;galement limit&#233;s &#224; l&#8217;&#233;tude des cas o&#249; l&#8217;opinion est un adjectif ou un verbe. Jakob &amp; Gurevych (2010)
sont &#224; notre connaissance les seuls &#224; sortir du grain phrase. Ils se sont int&#233;ress&#233;s sp&#233;cifiquement &#224; la r&#233;solution
d&#8217;anaphore pronominale dans un corpus de critiques de film pour mieux identifier la cible exacte.
</p>
<p>Motivations Dans ce travail, nous souhaitons d&#8217;une part adapter les travaux existants au fran&#231;ais et v&#233;rifier ainsi
les conclusions obtenues. D&#8217;autre part, nous souhaitons am&#233;liorer l&#8217;existant sur les trois aspects suivants :
&#8211; notre approche est multith&#233;matique. En effet, l&#8217;aspect monoth&#233;matique des &#233;tudes existantes (souvent cibl&#233;es
</p>
<p>sur un genre particulier : les critiques d&#8217;objets commerciaux) tend &#224; simplifier les cas linguistiques rencontr&#233;s ;
&#8211; notre approche ne se limite pas &#224; quelques cat&#233;gories grammaticales d&#8217;opinion. Les opinions peuvent ici &#234;tre
</p>
<p>des groupes nominaux, adjectivaux, verbaux ou adverbiaux ;
&#8211; nous utilisons le texte comme grain d&#8217;&#233;tude. Les cas o&#249; la cible n&#8217;est pas pr&#233;sente dans la m&#234;me phrase que
</p>
<p>l&#8217;opinion sont pris en compte.
Pour les besoins de notre travail, un corpus de r&#233;f&#233;rence o&#249; les passages d&#8217;opinions et les cibles sont annot&#233;es est
n&#233;cessaire. Nous pr&#233;sentons dans la section suivante le corpus utilis&#233;.
</p>
<p>3 Corpus multith&#233;matique de r&#233;f&#233;rence
</p>
<p>Actuellement, le seul corpus francophone disponible o&#249; les passages d&#8217;opinions et les cibles d&#8217;opinions sont
annot&#233;s est le corpus de blogs Blogoscopie 5 (Dubreil et al., 2008). Pour le probl&#232;me pr&#233;sent&#233;, les blogs sont
int&#233;ressants car ils pr&#233;sentent une richesse linguistique plus grande que les textes de critiques d&#8217;objets commerciaux
</p>
<p>5. Le corpus est disponible &#224; l&#8217;adresse : http ://www.lina.univ-nantes.fr/Ressources.html</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFIER LES CIBLES DE PASSAGES D&#8217;OPINIONS DANS UN CORPUS MULTITH&#201;MATIQUE
</p>
<p>(beaucoup d&#8217;objets diff&#233;rents dans un m&#234;me texte, syntaxes des phrases plus vari&#233;es, etc.). Nous pr&#233;sentons
bri&#232;vement le corpus Blogoscopie (&#167;. 3.1) et analysons dans une deuxi&#232;me partie des donn&#233;es statistiques sur
le probl&#232;me d&#8217;identification d&#8217;une cible d&#8217;opinion (&#167;. 3.2).
</p>
<p>Nature du corpus Le corpus Blogoscopie est constitu&#233; de 200 billets de blogs, et de 614 commentaires associ&#233;s
&#224; ces billets, tous issus de la plateforme de blogs OverBlog 6. Il est constitu&#233; d&#8217;environ 100 000 mots. La cr&#233;ation
du corpus Blogoscopie est bas&#233;e sur un crit&#232;re de repr&#233;sentativit&#233; th&#233;matique. Ainsi :
&#8211; 110 billets et 458 commentaires ont &#233;t&#233; s&#233;lectionn&#233;s &#224; partir des 33 cat&#233;gories de la plateforme OverBlog :
</p>
<p>actualit&#233;, artiste, cin&#233;ma, consommation, console, croyance, d&#233;tente, &#233;conomie, gastronomie, etc.
&#8211; 90 billets et 156 commentaires ont &#233;t&#233; s&#233;lectionn&#233;s &#224; partir de dix mots-cl&#233;s (9 billets par mot-cl&#233;) : Beaujolais,
</p>
<p>d&#233;veloppement durable, gr&#232;ve SNCF, Harry Potter, loi LRU, &#233;nergie nucl&#233;aire, Raymond Domenech, etc.
L&#8217;exemple (8) pr&#233;sente une version all&#233;g&#233;e de l&#8217;annotation d&#8217;un passage du corpus Blogoscopie. Dans ce corpus,
trois types d&#8217;objets principaux ont &#233;t&#233; annot&#233;s :
&#8211; 6 876 objets. Ces objets peuvent &#234;tre dits :
</p>
<p>&#8211; &#171; principaux &#187; (OP) : si le sujet g&#233;n&#233;ral d&#8217;un document concerne principalement cet objet. Un m&#234;me document
peut avoir plusieurs objets principaux ;
</p>
<p>&#8211; &#171; associ&#233;s &#187; (OA) : si cet objet est une sous-partie d&#8217;un objet concern&#233;.
&#8211; 4 909 opinions ;
&#8211; 4 129 couples cible-opinion.
</p>
<p>(8) Le sommet a &#233;t&#233; atteint avec &lt;objet&gt; le nucl&#233;aire &lt;/objet&gt; : &lt;objet&gt; M. Sarkozy &lt;/objet&gt;
&lt;opinion cible=&quot;M. Sarkozy&quot;&gt; a abus&#233; &lt;/opinion&gt; &lt;objet&gt; l&#8217;opinion publique &lt;/objet&gt; en
annon&#231;ant qu&#8217;il n&#8217;y aurait pas de &lt;objet&gt; &quot;nouveaux sites&quot; &lt;/objet&gt;.
</p>
<p>Pr&#233;cisons que dans ce corpus :
&#8211; les annotateurs n&#8217;ont pas pris en compte les anaphores pronominales ;
&#8211; la forme textuelle de l&#8217;objet cible la plus proche de l&#8217;opinion est consid&#233;r&#233;e comme la cible. Lorsqu&#8217;une
</p>
<p>anaphore pronominale est pr&#233;sente, l&#8217;ant&#233;c&#233;dent nominal le plus proche est consid&#233;r&#233; comme la cible.
</p>
<p>Segmentation du corpus et statistiques Pour nos exp&#233;rimentations, nous segmentons le corpus en deux :
&#8211; une partie &#171; entra&#238;nement &#187; constitu&#233;e de 3 909 couples opinion-cible et de 5 584 objets (160 documents) ;
&#8211; une partie &#171; test &#187; constitu&#233;e de 1 000 couples opinion-cible et de 1 292 objets (40 documents).
</p>
<p>Nb OP / billet 1 2 3 4 5+
</p>
<p>billets concern&#233;s 17 % 35 % 19 % 14 % 15 %
</p>
<p>TABLE 1 &#8211; Nombre d&#8217;objets principaux par billet
</p>
<p>Nb OA / billet 1-5 5-10 10-15 15+
</p>
<p>billets concern&#233;s 30 % 23 % 15 % 32 %
</p>
<p>TABLE 2 &#8211; Nombre d&#8217;objets associ&#233;s par billet
</p>
<p>Des statistiques sur la partie &#171; entra&#238;nement &#187; du corpus donnent un aper&#231;u de la t&#226;che. Le tableau 1 montre
qu&#8217;une majorit&#233; de billets (et leurs commentaires) parle en g&#233;n&#233;ral d&#8217;au moins deux ou trois objets principaux
diff&#233;rents. Le tableau 2 montre que le nombre d&#8217;objets associ&#233;s est tr&#232;s variable. Dit autrement, si dans une
majorit&#233; de cas un blogueur articule le sujet de son billet autour de deux ou trois objets principaux, en revanche,
on peut difficilement pr&#233;dire le nombre d&#8217;objets associ&#233;s qu&#8217;il va &#233;voquer. Pour identifier la cible d&#8217;une opinion,
il s&#8217;agit donc de la trouver parmi une liste d&#8217;objets pouvant aller de 2 &#224; plus de 20. Le tableau 3 montre que la
position de la cible est variable : soit tr&#232;s proche, soit tr&#232;s &#233;loign&#233;e (voire dans une phrase diff&#233;rente dans 44 %
des cas). Dans 47 % des cas, il y a au moins un objet intercall&#233; entre l&#8217;opinion et sa cible.
</p>
<p>6. http ://www.over-blog.com</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATTHIEU VERNIER, LAURA MONCEAUX, B&#201;ATRICE DAILLE
</p>
<p>Position relative de la cible avant l&#8217;opinion apr&#232;s l&#8217;opinion
</p>
<p>opinions concern&#233;es 61 % 39 %
Distance - en nombre de mots - 0 1-4 5-10 11+
</p>
<p>opinions concern&#233;es 21 % 20 % 11 % 48 %
Distance - en nombre de phrases - 0 1 2 3+
</p>
<p>opinions concern&#233;es 56 % 9 % 6 % 19 %
Distance- en nombre de objets intercall&#233;s - 0 1 2 3+
</p>
<p>opinions concern&#233;es 53 % 7 % 12 % 28 %
</p>
<p>TABLE 3 &#8211; &#201;tude de la position de la cible par rapport &#224; son opinion
</p>
<p>4 M&#233;thodes utilis&#233;es
</p>
<p>D&#8217;apr&#232;s les statistiques du corpus &#171; entra&#238;nement &#187; Blogoscopie, nous distinguons deux niveaux de complexit&#233; :
&#8211; la cible et l&#8217;opinion sont dans la m&#234;me phrase (intraphrastique) : 56 % des cas du corpus d&#8217;entra&#238;nement ;
&#8211; la cible et l&#8217;opinion sont dans une phrase diff&#233;rente (interphrastique) : 44 % des cas du corpus d&#8217;entra&#238;nement.
D&#232;s lors, nos objectifs sont les suivants :
&#8211; &#233;valuer les m&#233;thodes existantes qui traitent uniquement les cas intraphrastiques afin de les valider sur le
</p>
<p>fran&#231;ais, sur un corpus multith&#233;matique et en prenant davantage en compte les diff&#233;rentes cat&#233;gories grammaticales
des opinions ;
</p>
<p>&#8211; d&#233;velopper une m&#233;thode qui traite les cas intra- et interphrastiques simultan&#233;ment.
Pour le premier objectif, nous r&#233;-impl&#233;mentons la m&#233;thode &#233;tat-de-l&#8217;art (M-RankSVM, voir &#167;. 4.1.1) et nous
la comparons &#224; une m&#233;thode baseline (M-Syntaxe, voir &#167;. 4.1.2). Pour le second objectif, nous proposons une
m&#233;thode bas&#233;e sur la saillance d&#8217;une cible (M-Saillance, voir &#167;. 4.2.1). Celle-ci r&#233;-utilise les r&#233;sultats de M-
RankSVM comme une amorce. Nous la comparons avec une m&#233;thode baseline (M-Proximite, voir &#167;. 4.2.2).
Pour ces quatre m&#233;thodes :
&#8211; les passages d&#8217;opinions sont annot&#233;s manuellement (annotations pr&#233;sentes dans le corpus Blogoscopie) ;
&#8211; le TreeTagger (Schmid, 1994) donne la cat&#233;gorie grammaticale ;
&#8211; un algorithme de d&#233;coupage en syntagmes non-r&#233;cursifs, qui r&#233;impl&#233;mente la m&#233;thode de (Vergne &amp; Giguet,
</p>
<p>1998), permet d&#8217;identifier les groupes nominaux et pronominaux d&#8217;un texte. Ces expressions nominales et
pronominales sont consid&#233;r&#233;es comme l&#8217;ensemble des objets principaux et associ&#233;s du texte.
</p>
<p>4.1 M&#233;thodes applicables &#224; un niveau intraphastique
</p>
<p>4.1.1 Approche par combinaison d&#8217;indices morpho-syntaxiques
</p>
<p>La m&#233;thode &#233;tat de l&#8217;art de Kessler &amp; Nicolov (2009) a &#233;t&#233; &#233;valu&#233;e sur un corpus monoth&#233;matique anglais. Elle
ne s&#8217;int&#233;resse qu&#8217;aux opinions de type verbe et adjectif uniquement. Elle consiste &#224; combiner des informations
lexicales et s&#233;mantiques pour pallier les limites des approches purement syntaxiques. Nous adaptons leur approche
pour traiter un corpus multith&#233;matique fran&#231;ais sans restriction grammaticale (par la suite, M-RankSVM). La
m&#233;thode prend en entr&#233;e : une phrase s &#224; analyser, un passage d&#8217;opinion opinion pr&#233;sent dans s, un ensemble
d&#8217;objets o pr&#233;sents dans s et une fonction d&#8217;ordonnancement permettant de classer les objets de s. Cette fonction</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFIER LES CIBLES DE PASSAGES D&#8217;OPINIONS DANS UN CORPUS MULTITH&#201;MATIQUE
</p>
<p>d&#8217;ordonnancement est extraite par apprentissage sur le corpus &#171; entra&#238;nement &#187;.
</p>
<p>Pour obtenir la fonction d&#8217;ordonnancement, nous utilisons l&#8217;algorithme RankSVM issue de SVMLight (Joachims,
2002). Le corpus &#171; entra&#238;nement &#187; Blogoscopie permet de fournir &#224; la m&#233;thode :
&#8211; 3 909 exemples &#171; positifs &#187; correspondant aux couples &#171; opinion-cible &#187; pr&#233;sents dans le corpus. Ces exemples
</p>
<p>ont un rang 1 ;
&#8211; 4 000 exemples &#171; n&#233;gatifs &#187; correspondant &#224; des couples &#171; objet non cible-opinion &#187; pr&#233;sents dans le corpus.
</p>
<p>Ces exemples ont un rang 0 ;
Chacun de ces exemples est d&#233;crit par les caract&#233;ristiques pr&#233;sent&#233;es dans le tableau 4. &#192; partir de ces exemples,
RankSVM entra&#238;ne un mod&#232;le ayant pour objectif de d&#233;terminer une fonction de pr&#233;f&#233;rence qui maximise le rang.
&#192; l&#8217;image de Kessler &amp; Nicolov (2009), nous utilisons les param&#232;tres par d&#233;faut de RankSVM. Lors de la phase
de test, cette m&#233;thode effectue un ordonnancement de tous les objets qui apparaissent dans la m&#234;me phrase que le
passage d&#8217;opinion en s&#8217;appuyant sur le mod&#232;le appris lors de la phase d&#8217;entra&#238;nement. L&#8217;objet class&#233; premier est
consid&#233;r&#233; comme la cible de l&#8217;opinion.
</p>
<p>Caract&#233;ristique Exemple
</p>
<p>Chemin lexical lemmatis&#233; entre l&#8217;opinion et sa cible pour
Chemin grammatical entre l&#8217;opinion et sa cible Prep.
</p>
<p>Cat&#233;gorie(s) grammatical(es) de l&#8217;opinion DET NOM ADJ
Cat&#233;gorie(s) grammatical(es) de la cible DET NOM
</p>
<p>Chemin de d&#233;pendance &#8595; PP, &#8595; DP
Nombre d&#8217;objets entre l&#8217;opinion et la cible 0
Nombre de mots entre l&#8217;opinion et la cible 1
</p>
<p>Rang 1
</p>
<p>TABLE 4 &#8211; Caract&#233;ristiques utilis&#233;es pour d&#233;crire chaque instance d&#8217;apprentissage. Exemple : &#171; [...] est
une d&#233;faite majeure pour l&#8217;&#233;cologie &#187;
</p>
<p>Chemin de d&#233;pendance(s) Fr&#233;quence Exemple
</p>
<p>&#8593; AP 121 C&#8217;est une belle image (ex : [TP [DP C&#8217; ] est [V P [DP une [NP [AP belle ] image ]]]])
&#8595; DP 91 Cette question me taraude
&#8595; PP, &#8595; DP 65 J&#8217;ai une v&#233;ritable fascination pour J.K Rowling
&#8593; TP, &#8593; CP 59 Un &#233;v&#233;nement qui contribue &#224; alourdir le d&#233;b&#226;t
&#8593; VP, &#8595; DP 45 Ce jeu est accessible pour les enfants de 12 ans
&#8593; AdvP, &#8595; DP 29 Cette histoire de travailler plus [...] ne tient [...] pas la route
</p>
<p>TABLE 5 &#8211; Chemins de d&#233;pendances syntaxiques les plus fr&#233;quents entre une opinion et une cible dans le
corpus d&#8217;entra&#238;nement Blogoscopie. AP = syntagme adjectival ; DP = syntagme d&#233;terminant ; PP = syntagme
pr&#233;positionnel ; AdvP = syntagme adverbial ; CP = syntagme conjonctionnel ; NP = syntagme nominal ; TP =
syntagme temporel ; VP = syntagme verbal</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATTHIEU VERNIER, LAURA MONCEAUX, B&#201;ATRICE DAILLE
</p>
<p>4.1.2 Approche syntaxique (baseline)
</p>
<p>Nous comparons la m&#233;thode M-RankSVM avec une m&#233;thode qui repose uniquement sur une analyse des
d&#233;pendances syntaxiques (par la suite, M-Syntaxe). Elle ne fonctionne &#233;galement que dans un cadre intraphrastique.
Elle prend en entr&#233;e : une phrase s &#224; analyser, un passage d&#8217;opinion opinion pr&#233;sent dans s, un ensemble d&#8217;objets
O pr&#233;sents dans s, un ensemble de chemins de d&#233;pendances syntaxiques entre une opinion et une cible avec leur
probabilit&#233; correspondante. Cet ensemble est d&#233;termin&#233; &#224; partir du corpus &#171; entra&#238;nement &#187; Blogoscopie.
</p>
<p>Nous avons utilis&#233; l&#8217;analyseur de d&#233;pendance syntaxique FIPS (Wehrli, 2007) sur 500 exemples 7 de couples
opinion-cible qui apparaissent dans la m&#234;me phrase dans le corpus d&#8217;entra&#238;nement Blogoscopie. Pour ces exemples,
FIPS fournit un chemin de d&#233;pendance (visualisable sous forme d&#8217;arbre syntaxique (Fig. 1)). Nous classons par
ordre de fr&#233;quence d&#233;croissante (voir tableau 5), les chemins de d&#233;pendances qui vont :
&#8211; de la fin d&#8217;une opinion vers le d&#233;but d&#8217;une cible, si l&#8217;opinion est situ&#233;e avant la cible dans le texte ;
&#8211; du d&#233;but de l&#8217;opinion vers la fin d&#8217;une cible, si l&#8217;opinion est situ&#233;e apr&#232;s la cible dans le texte.
Lors de la phase de test, cette m&#233;thode effectue une analyse syntaxique de la phrase contenant l&#8217;opinion. Le
chemin de d&#233;pendance syntaxique le plus fr&#233;quent qui permet de relier opinion avec un objet o (&#8712; O) d&#233;signe
l&#8217;objet o comme la meilleure cible potentielle. En utilisant un des chemins syntaxiques, il est possible que o soit
un groupe pronominal (il, aucun d&#8217;entre eux, etc.).
</p>
<p>FIGURE 1 &#8211; Analyse syntaxique de &#171; J&#8217;ai une v&#233;ritable fascination pour J.K Rowling &#187;.
L&#8217;opinion est s&#233;par&#233;e de sa cible par la d&#233;pendance &#8595; PP, &#8595; DP.
</p>
<p>4.2 M&#233;thodes applicables &#224; un niveau intra- et interphrastique
</p>
<p>Pour le second objectif, nous proposons une m&#233;thode (M-Saillance) pour traiter les cas intraphrastiques et
interphrastiques. Nous comparons cette m&#233;thode &#224; une m&#233;thode baseline (M-Proximite).
</p>
<p>7. Le nombre de couples est r&#233;duit &#224; 500 pour &#233;viter les cas des phrases trop longues qui induisent en erreur l&#8217;analyseur FIPS.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFIER LES CIBLES DE PASSAGES D&#8217;OPINIONS DANS UN CORPUS MULTITH&#201;MATIQUE
</p>
<p>4.2.1 Approche par mesure de saillance
</p>
<p>Lors de la phase de test, en sortie de la m&#233;thode M-RankSVM, pour chaque document d, nous disposons d&#8217;un
ensemble de couples d&#8217;opinion-cible d&#233;termin&#233;s automatiquement. Nous observons les quatre faits suivants :
&#8211; O1 : certaines opinions n&#8217;ont pas de cible affect&#233;e (si la phrase contenant l&#8217;opinion ne poss&#232;de aucun objet) ;
&#8211; O2 : certaines opinions ont pour cible un groupe pronominal ;
&#8211; O3 : certains couples cible-opinion ne sont pas reli&#233;s par une d&#233;pendance syntaxique couramment observ&#233;e ;
&#8211; O4 : certaines des cibles ne sont pas &#233;valu&#233;es ailleurs dans le document.
</p>
<p>Les couples qui v&#233;rifient l&#8217;une des observations O1 ou O2, ou qui v&#233;rifient simultan&#233;ment O3 et O4 sont
consid&#233;r&#233;es comment des couples faibles (cas douteux). Les autres couples sont consid&#233;r&#233;s comme des identifications
fortes sur lesquelles nous pouvons nous appuyer. Notre m&#233;thode (M-Saillance) consiste &#224; utiliser les r&#233;sultats
&#171; forts &#187; de M-RankSVM comme une amorce pour corriger les couples faibles. Cette m&#233;thode a deux objectifs :
&#8211; identifier une cible nominale pour les opinions qui n&#8217;en ont pas ou qui sont reli&#233;es &#224; un groupe pronominal ;
&#8211; corriger l&#8217;affectaction des autres couples faibles.
Les hypoth&#232;ses linguistiques de notre m&#233;thode sont les suivantes :
&#8211; Hypoth&#232;se 1 : s&#8217;il n&#8217;existe pas de objet nominal pertinent dans la m&#234;me phrase qu&#8217;une opinion, celui-ci existe
</p>
<p>probablement dans les phrases voisines ;
&#8211; Hypoth&#232;se 2 : l&#8217;&#233;nonciateur d&#8217;un discours subjectif articule ses opinions au fil d&#8217;un document en &#233;valuant les
</p>
<p>m&#234;mes objets plusieurs fois. Plus un objet est la cible d&#8217;une opinion, plus il est saillant et plus il est probable
qu&#8217;il soit de nouveau la cible d&#8217;une opinion dans le contexte.
</p>
<p>Description Soit opinion, un passage d&#8217;opinion du document d, dont la relation avec sa cible actuelle est faible.
Soit segment, l&#8217;ensemble des phrases voisines de l&#8217;opinion. segment est limit&#233; &#224; 4 phrases avant l&#8217;opinion et 4
phrases apr&#232;s. &#192; partir des couples forts opinion-cible issus de M-RankSVM, nous classons par ordre d&#233;croissant
les cibles les plus fr&#233;quemment li&#233;es &#224; une opinion dans segment. Nous classons &#233;galement les cibles les plus
fr&#233;quentes dans d. Les cibles sont pr&#233;alablement lemmatis&#233;es et les mots fonctionnels sont retir&#233;s (par exemple,
l&#8217;entra&#238;neur de l&#8217;&#233;quipe de France devient entra&#238;neur &#233;quipe France). Pour tout objet o pr&#233;sent dans segment,
nous mesurons une probabilit&#233; que o soit la cible de opinion avec la formule suivante :
</p>
<p>P(o, opinion) =
NB(o, cible, segment)
</p>
<p>NB(o, segment).NB(cible, segment)
.
</p>
<p>NB(o, cible, document)
NB(o, document).NB(cible, document)
</p>
<p>(1)
</p>
<p>Cible(opinion) = MAX(P(o, opinion)) (2)
</p>
<p>o&#249; :
&#8211; NB(o, cible, segment) est le nombre de fois que le objet o est une cible forte d&#8217;une opinion quelconque dans
</p>
<p>l&#8217;ensemble des phrases voisines d&#8217;opinion. De la m&#234;me fa&#231;on, NB(o, cible, document) est le nombre de fois
que o est une cible forte d&#8217;opinion dans le document ;
</p>
<p>&#8211; NB(o, segment) et NB(o, document) sont les nombres de fois o&#249; le objet o est pr&#233;sent dans le segment de
phrases voisines et dans le document ;
</p>
<p>&#8211; NB(cible, segment) et NB(cible, document) sont les nombres de cibles d&#8217;opinions dans le segment et dans le
document.
</p>
<p>P(o, opinion) repr&#233;sente la saillance de l&#8217;objet o dans le segment et le document. Cette mesure donne un score
d&#8217;association entre le l&#8217;objet o et l&#8217;opinion &#233;mise dans le document et le segment en calculant la d&#233;pendance de
ces trois variables. La cible de l&#8217;opinion choisie par M-Saillance est l&#8217;objet qui maximise cette probabilit&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATTHIEU VERNIER, LAURA MONCEAUX, B&#201;ATRICE DAILLE
</p>
<p>4.2.2 Approche par proximit&#233; (baseline)
</p>
<p>La m&#233;thode par proximit&#233; (par la suite, M-Proximit&#233;) est applicable au niveau intraphrastique et interphrastique.
Elle prend en entr&#233;e : le document d &#224; analyser, un passage d&#8217;opinion opinion et sa position dans le document,
un ensemble d&#8217;objets O pr&#233;sents dans d et leur position dans le document. La position dans le document est
d&#233;termin&#233;e par une indexation de l&#8217;ensemble des mots du texte : W = {w1, w2, . . . , wn}. Le passage opinion et
l&#8217;ensemble des &#233;l&#233;ments de O sont d&#233;limit&#233;s par un mot de d&#233;but (wd&#233;but &#8712;W ) et un mot de fin (wfin &#8712;W ).
</p>
<p>Pour tout o &#8712; O, cette m&#233;thode compte le nombre de mots qui s&#233;parent l&#8217;objet o de opinion dans le document
d. La ponctuation n&#8217;est pas prise en compte. Si opinion est inclu dans o, la distance en mots est &#233;gale &#224; 0. Le
choix du meilleur candidat s&#8217;effectue sur la base de la plus petite distance en mots. En cas d&#8217;&#233;galit&#233;, la cible qui
pr&#233;c&#232;de l&#8217;opinion est pr&#233;f&#233;r&#233;e (nous justifions ce choix empirique par l&#8217;&#233;tude statistique r&#233;alis&#233;e pr&#233;c&#233;demment).
</p>
<p>&#8704; o &#8712; O se situant avant opinion, Proximite(t) = wfin(o) - wd&#233;but(opinion)
&#8704; o &#8712; O se situant apr&#232;s opinion, Proximite(t) = wfin(opinion) - wd&#233;but(o)
</p>
<p>Cible(opinion) = MIN(Proximite(o))
</p>
<p>5 R&#233;sultats
</p>
<p>Type Intraphrastique Interphrastique Total
Score Pr&#233;cision Pr&#233;cision Pr&#233;cision
</p>
<p>M-Syntaxe 68.8 % (407/592) non applicable 40.7 % (407/1 000)
M-RankSVM 71.5 % (423/592) non applicable 42.3 % (423/1 000)
M-Proximite 53.5 % (317/592) 27.2 % (111/408) 42.8 % (428/1 000)
M-Saillance 72.8 % (431/592) 60.0 % (245/408) 67.6 % (676/1 000)
</p>
<p>TABLE 6 &#8211; R&#233;sultats obtenus par les quatre m&#233;thodes sur le corpus de test Blogoscopie
</p>
<p>Nous &#233;valuons les 4 m&#233;thodes pr&#233;sent&#233;es pr&#233;c&#233;demment sur les 40 documents du corpus test Blogoscopie. Ce
corpus contient 1 000 couples cible-opinion : 592 de ces couples sont intraphrastiques, 408 sont interphrastiques.
</p>
<p>Niveau intraphrastique Par rapport &#224; une approche syntaxique, la combinaison d&#8217;indices morpho-syntaxiques
am&#233;liore l&#233;g&#232;rement l&#8217;identification de la cible (71,5 % contre 68,8 %). Cette diff&#233;rence est n&#233;amoins beaucoup
plus marqu&#233;e dans les travaux de Kessler &amp; Nicolov (2009). Par rapport &#224; Kessler &amp; Nicolov (2009) qui ont
obtenu une pr&#233;cision de 74,8 % sur l&#8217;anglais, notre score de pr&#233;cision baisse d&#8217;environ 3 points sur le fran&#231;ais
(71,5 %). S&#8217;il est difficile de dire si cette baisse est significative, elle tend n&#233;anmoins &#224; montrer que la m&#233;thode
M-RankSVM est applicable pour traiter les cas intraphrastiques sur des corpus multith&#233;matiques en fran&#231;ais.
Elle est d&#8217;autant plus int&#233;ressante qu&#8217;elle fournit de bons indices &#224; la m&#233;thode M-Saillance pour corriger certains
couples intraphrastiques (72,8 % contre 71,5 %). L&#8217;hypoth&#232;se discursive consistant &#224; reclasser les cibles d&#8217;opinions
saillantes (celles qui sont fr&#233;quement li&#233;es &#224; une opinion) semble &#234;tre une hypoth&#232;se int&#233;ressante &#224; d&#233;velopper.
</p>
<p>Niveau interphrastique La m&#233;thode M-Saillance permet d&#8217;identifier correctement 60,0 % des cibles d&#8217;opinions
en s&#8217;appuyant uniquement sur l&#8217;objet d&#8217;opinion le plus saillant dans une fen&#234;tre de 4 phrases autour de l&#8217;opinion.
Ce r&#233;sultat est nettement sup&#233;rieur &#224; l&#8217;approche na&#239;ve consistant &#224; prendre l&#8217;objet le plus proche (27,2 %). Ce score
permet &#224; la m&#233;thode M-Saillance d&#8217;&#234;tre beaucoup plus performante que la m&#233;thode &#233;tat de l&#8217;art RankSVM sur
l&#8217;ensemble de la probl&#233;matique d&#8217;identification de la cible d&#8217;une opinion (67.6 % contre 42,3 %). Ce score nous
semble encore am&#233;liorable en introduisant d&#8217;autres types d&#8217;hypoth&#232;ses s&#233;mantiques et discursives. Par exemple :</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>IDENTIFIER LES CIBLES DE PASSAGES D&#8217;OPINIONS DANS UN CORPUS MULTITH&#201;MATIQUE
</p>
<p>&#8211; si une cible A est &#233;valu&#233;e fr&#233;quement positivement dans un document, si une cible B est &#233;valu&#233;e fr&#233;quement
n&#233;gativement dans le m&#234;me document, il est plus probable que A (respectivement B) soit reli&#233;e &#224; une opinion
positive (respectivement n&#233;gative) dont la cible est inconnue ;
</p>
<p>&#8211; si une ou plusieurs cibles appartenant au m&#234;me graphe d&#8217;objets (mod&#233;lisant les relations m&#233;ronymiques entre
objets) sont &#233;valu&#233;es dans le m&#234;me passage d&#8217;un document, il est probable qu&#8217;une opinion dont on ignore la
cible porte sur un objet de ce graphe.
</p>
<p>Ces hypoth&#232;ses seraient int&#233;ressantes &#224; comparer &#224; des proc&#233;dures de r&#233;solution d&#8217;anaphores nominales plus
classiques pour le fran&#231;ais. N&#233;anmoins, ces proc&#233;dures nous paraissent &#224; ce stade encore complexes &#224; mettre en
place sur des corpus multith&#233;matiques et en particulier sur les blogs (dont le respect grammatical et orthographique
est tr&#232;s variable). De ce point de vue, l&#8217;hypoth&#232;se de saillance d&#8217;un objet semble offrir une plus grande souplesse.
</p>
<p>6 Conclusion
Nous avons abord&#233; la probl&#233;matique d&#8217;identification de la cible d&#8217;un passage d&#8217;opinion. Nos r&#233;sultats montrent
</p>
<p>que la m&#233;thode &#233;tat de l&#8217;art &#233;valu&#233;e r&#233;cemment sur des corpus anglophones monoth&#233;matiques est adapt&#233;e pour
un corpus fran&#231;ais multith&#233;matique. Cette m&#233;thode, applicable au niveau intraphastrique uniquement, est utilis&#233;e
comme amorce pour le d&#233;veloppement de la nouvelle approche que nous proposons. Celle-ci est bas&#233;e sur la
saillance d&#8217;une cible d&#8217;opinion dans un segment textuel. Elle am&#233;liore l&#8217;&#233;tat de l&#8217;art sur l&#8217;aspect intraphastique de
la t&#226;che. Elle permet &#233;galement de couvrir davantage de probl&#232;mes en s&#8217;int&#233;ressant aux cas interphrastiques non
trait&#233;s dans le domaine jusqu&#8217;&#224; pr&#233;sent. De ce point de vue nous am&#233;liorons significativement les r&#233;sultats pour
identifier la cible d&#8217;un passage d&#8217;opinion. Ces r&#233;sultats nous semblent encore am&#233;liorables en prenant mieux en
compte les relations s&#233;mantiques entre les objets d&#8217;un document.
</p>
<p>R&#233;f&#233;rences
</p>
<p>BACCIANELLA S., ESULI A. &amp; SEBASTIANI F. (2010). Sentiwordnet 3.0 : An enhanced lexical resource for
sentiment analysis and opinion mining. In Proceedings of the Seventh conference on International Language
Resources and Evaluation (LREC&#8217;10), Valletta, Malta : European Language Resources Association (ELRA).
</p>
<p>BENVENISTE E. (1966). Probl&#232;mes de linguistique g&#233;n&#233;rale II. Gallimard edition.
</p>
<p>BETHARD S., YU H., THORNTON A., HATZIVASSILOGLOU V. &amp; JURAFSKY D. (2004). Automatic extraction
of opinion propositions and their holders. In Proceedings of the AAAI Spring Symposium on Exploring Attitude
and Affect in Text.
</p>
<p>BLOOM K., GARG N. &amp; ARGAMON S. (2007). Extracting appraisal expressions. In Human Language
Technologies 2007 : The Conference of the North American Chapter of the Association for Computational
Linguistics, p. 308&#8211;315, Rochester, New York : Association for Computational Linguistics.
</p>
<p>CHOI Y., CARDIE C., RILOFF E. &amp; PATWARDHAN S. (2005). Identifying sources of opinions with conditional
random fields and extraction patterns. In Proceedings of the Human Language Technology Conference and the
Conference on Empirical Methods in Natural Language Processing (HLT/EMNLP).
</p>
<p>DUBREIL E., VERNIER M., MONCEAUX L. &amp; DAILLE B. (2008). Annotating opinion - evaluation of blogs.
In Workshop on LREC 2008 Conference, Sentiment Analysis Metaphor, Ontology and Terminology (EMOT-08).
</p>
<p>GREFENSTETTE G., QU Y., SHANAHAN J. G. &amp; EVANS D. A. (2004). Coupling niche browsers and affect
analysis for an opinion mining application. In Proceedings of Recherche d&#8217;Information Assist&#233;e par Ordinateur.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>MATTHIEU VERNIER, LAURA MONCEAUX, B&#201;ATRICE DAILLE
</p>
<p>HU M. &amp; LIU B. (2004). Mining opinion features in customer reviews. In Proceedings of AAAI, p. 755&#8211;760.
</p>
<p>JAKOB N. &amp; GUREVYCH I. (2010). Using anaphora resolution to improve opinion target identification in movie
reviews. In Proceedings of the ACL 2010 Conference Short Papers, ACLShort &#8217;10, p. 263&#8211;268, Stroudsburg, PA,
USA : Association for Computational Linguistics.
</p>
<p>JOACHIMS T. (2002). Optimizing search engines using clickthrough data. In Proceedings of the eighth ACM
SIGKDD on Knowledge discovery and data mining, KDD &#8217;02, p. 133&#8211;142, New York, NY, USA : ACM.
</p>
<p>KESSLER J. S. &amp; NICOLOV N. (2009). Targeting sentiment expressions through supervised ranking of linguistic
configurations. In 3rd Int&#8217;l AAAI Conference on Weblogs and Social Media (ICWSM 2009).
</p>
<p>KIM S.-M. &amp; HOVY E. (2006). Extracting opinions, opinion holders, and topics expressed in online news media
text. In Proceedings of the Workshop on Sentiment and Subjectivity in Text, SST &#8217;06, p. 1&#8211;8, Stroudsburg, PA,
USA : Association for Computational Linguistics.
</p>
<p>MATHIEU Y. (2006). A computational semantic lexicon of french verbs of emotion. In W. B. CROFT, J.
SHANAHAN, Y. QU &amp; J. WIEBE, Eds., Computing Attitude and Affect in Text : Theory and Applications,
volume 20 of The Information Retrieval Series, p. 109&#8211;124. Springer Netherlands.
</p>
<p>MISHNE G. &amp; GLANCE N. (2006). Predicting movie sales from blogger sentiment. In AAAI Symposium on
Computational Approaches to Analysing Weblogs (AAAI-CAAW), p. 155&#8211;158.
</p>
<p>PANG B. &amp; LEE L. (2008). Opinion mining and sentiment analysis. Foundations and Trends in Information
Retrieval, 2(1-2), 1&#8211;135.
RUPPENHOFER J., SOMASUNDARAN S. &amp; WIEBE J. (2008). Finding the sources and targets of
subjective expressions. In Proceedings of the Sixth International Language Resources and Evaluation
(LREC&#8217;08), Marrakech, Morocco : European Language Resources Association (ELRA). http//www.lrec-
conf.org/proceedings/lrec2008/.
</p>
<p>SCHMID H. (1994). Probabilistic part-of-speech tagging using decision trees. In Proceedings of the International
Conference on New Methods in Language Processing, p. 44&#8211;49.
</p>
<p>TORRES-MORENO J. M., EL-B&#200;ZE M., B&#201;CHET F. &amp; CAMELIN N. (2007). Comment faire pour que l&#8217;opinion
forg&#233;e &#224; la sortie des urnes soit la bonne ? Actes du 3&#232;me D&#233;fi Fouille de Textes (AFIA 2007), p. 117&#8211;132.
</p>
<p>TURNEY P. (2002). Thumbs up or thumbs down ? semantic orientation applied to unsupervised classification of
reviews. Proceedings 40th Annual Meeting of the ACL (ACL&#8217;02), p. 417&#8211;424.
</p>
<p>VERGNE J. &amp; GIGUET E. (1998). Regards th&#233;oriques sur le &#171;tagging&#187;. In Actes de Traitement Automatique des
Langues Naturelles (TALN&#8217;98), p. 22&#8211;31.
</p>
<p>VERNIER M. &amp; MONCEAUX L. (2010). Enrichissement d&#8217;un lexique de termes subjectifs &#224; partir de tests
s&#233;mantiques. Traitement Automatique des Langues, 51(1), 125&#8211;149.
WEHRLI E. (2007). Fips, a deep linguistic multilingual parser. In Proceedings of the Workshop on Deep
Linguistic Processing, DeepLP &#8217;07, p. 120&#8211;127, Stroudsburg, PA, USA : Association for Computational
Linguistics.
</p>
<p>WIEBE J. M. &amp; RILOFF E. (2005). Creating subjective and objective sentence classifiers from unannotated
texts. In Proceedings of the Conference on Computational Linguistics and Intelligent Text Processing (CICLing),
number 3406 in Lecture Notes in Computer Science, p. 486&#8211;497.
</p>
<p>WILSON T. A. (2008). Fine-grained Subjectivity and Sentiment Analysis : Recognizing the Intensity, Polarity,
and Attitudes of Private States. PhD thesis, University of Pittsburgh.</p>

</div></div>
</body></html>