<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Recherche d&#8217;information et temps linguistique : une heuristique pour calculer la pertinence des expressions calendaires</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin - 1er juillet 2011 
</p>
<p>Recherche d&#8217;information et temps linguistique : une heuristique pour calculer la 
pertinence des expressions calendaires 
</p>
<p>Charles Teiss&#232;dre (1,2)   Delphine Battistelli (3)   Jean-Luc Minel (1) 
</p>
<p>(1) MoDyCo - UMR 7114 CNRS, Paris Ouest Nanterre La D&#233;fense, 200, av. de la R&#233;publique, 92001 Nanterre 
(2) Mondeca, 3, cit&#233; Nollez, 75018 Paris 
</p>
<p>(3) STIH, Universit&#233; Paris Sorbonne, 28, rue Serpente, 75006 Paris  
charles.teissedre@ u-paris10.fr, delphine.battistelli@paris-sorbonne.fr, jean-luc.minel@u-paris10.fr 
</p>
<p> 
</p>
<p>R&#233;sum&#233;. A rebours de bon nombre d&#8217;applications actuelles offrant des services de recherche d&#8217;information 
selon des crit&#232;res temporels - applications qui reposent, &#224; y regarder de pr&#232;s, sur une approche consistant &#224; 
filtrer les r&#233;sultats en fonction de leur inclusion dans une fen&#234;tre de temps, nous souhaitons illustrer dans cet 
article l&#8217;int&#233;r&#234;t d&#8217;un service s&#8217;appuyant sur un calcul de similarit&#233; entre des expressions adverbiales 
calendaires. Nous d&#233;crivons une heuristique pour mesurer la pertinence d&#8217;un fragment de texte en prenant en 
compte la s&#233;mantique des expressions calendaires qui y sont pr&#233;sentes. A travers la mise en &#339;uvre d&#8217;un 
syst&#232;me de recherche d&#8217;information, nous montrons comment il est possible de tirer profit de l&#8217;indexation 
d&#8217;expressions calendaires pr&#233;sentes dans les textes en d&#233;finissant des scores de pertinence par rapport &#224; une 
requ&#234;te. L&#8217;objectif est de faciliter la recherche d&#8217;information en offrant la possibilit&#233; de croiser des crit&#232;res de 
recherche th&#233;matique avec des crit&#232;res temporels. 
</p>
<p>Abstract. Unlike many nowadays applications providing Information Retrieval services able to handle 
temporal criteria - applications which usually filter results after testing their inclusion in a time span, this 
paper illustrates the interest of a service based on a calculation of similarity between calendar adverbial 
phrases. We describe a heuristic to measure the relevance of a fragment of text by taking into account the 
semantics of calendar expressions. Through the implementation of an Information Retrieval system, we show 
how it is possible to take advantage of the indexing of calendar expressions found in texts by setting scores of 
relevance with respect to a query. The objective is to ease Information Retrieval by offering the possibility of 
crossing thematic research criteria with temporal criteria. 
</p>
<p>Mots-cl&#233;s : Indexation d&#8217;informations calendaires ; Recherche d&#8217;information ; Annotation et extraction 
d&#8217;expressions calendaires 
Keywords: Calendar information indexing ; Information Retrieval ; Annotation and extraction of calendar 
expressions 
</p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLES TEISSEDRE, DELPHINE BATTISTELLI, JEAN-LUC MINEL 
 
</p>
<p>1 Introduction 
</p>
<p>Les syst&#232;mes de Recherche d&#8217;Information sur le Web destin&#233;s au grand public ne sont pas en mesure 
aujourd&#8217;hui de r&#233;pondre &#224; des requ&#234;tes exprimant des informations calendaires complexes, telles qu&#8217;on peut 
les exprimer en langue au travers notamment de la cat&#233;gorie des adverbiaux calendaires (Klein, 1994). Dans 
de nombreux cas de figure, cette cat&#233;gorie pourrait pourtant utilement intervenir dans le calcul de la 
pertinence d&#8217;un fragment de texte ou d&#8217;un document. En effet, la prise en compte de la s&#233;mantique des 
expressions adverbiales calendaires (soulign&#233;es ci-apr&#232;s) permettrait ainsi de traiter des requ&#234;tes comme 
celles qui suivent : 
</p>
<p>&#61623; &#171; Festival de musique aux alentours de la mi-ao&#251;t &#187; 
</p>
<p>&#61623; &#171; La France &#224; la fin du XVIIe  si&#232;cle &#187; 
</p>
<p>&#61623; &#171; Cin&#233;ma italien au d&#233;but des ann&#233;es 60 &#187; 
</p>
<p>Si les syst&#232;mes de bases de donn&#233;es sp&#233;cialis&#233;s peuvent permettre de fournir des r&#233;ponses &#224; de telles 
requ&#234;tes en filtrant les r&#233;ponses incluses dans une fen&#234;tre de temps, pour autant, parce qu&#8217;elles s&#8217;appuient 
sur une repr&#233;sentation discr&#232;te, elles n&#8217;offrent pas de moyen d&#8217;ordonnancer les r&#233;sultats selon des crit&#232;res 
permettant de mesurer la pertinence relative des propri&#233;t&#233;s temporelles retourn&#233;es par rapport &#224; la requ&#234;te. 
De tels syst&#232;mes ne permettent pas, par exemple, de jongler avec la granularit&#233; des expressions temporelles 
pour retenir en priorit&#233; celles qui partagent les m&#234;mes caract&#233;ristiques que la requ&#234;te ; en effet, le plus 
souvent, les r&#233;ponses fournies dans ce cadre de recherche sont uniquement celles qui r&#233;pondent 
favorablement au test d&#8217;inclusion dans la p&#233;riode recherch&#233;e.  
</p>
<p>Par del&#224; le test d&#8217;inclusion. Une autre approche nous semble possible. Elle s&#8217;inspire du fonctionnement 
des moteurs de recherche, &#224; savoir leur capacit&#233; &#224; trier les documents par pertinence en &#233;valuant la distance 
qui les rapproche ou les &#233;loigne d&#8217;une requ&#234;te. L&#8217;objectif est alors de fournir des crit&#232;res pour calculer des 
scores de proximit&#233; entre les zones temporelles recherch&#233;es et des expressions calendaires pr&#233;sentes dans un 
texte ou un corpus de textes. La m&#233;thode que nous d&#233;crivons pour attribuer un score de pertinence 
temporelle permet ainsi de combiner des requ&#234;tes th&#233;matiques et des requ&#234;tes temporelles calendaires, en 
agr&#233;geant et pond&#233;rant les scores de pertinence. 
</p>
<p>Afin de mettre en regard notre approche avec les travaux de recherche et les applications existants, l&#8217;article 
s&#8217;ouvre sur un &#233;tat des lieux de la recherche d&#8217;information fond&#233;e sur des crit&#232;res calendaires (section 2). Il 
se poursuit par la pr&#233;sentation de l&#8217;heuristique que nous proposons pour calculer des scores de pertinence 
temporelle (section 3). Enfin (section 4), nous illustrons l&#8217;int&#233;r&#234;t de cette approche &#224; travers une 
exp&#233;rimentation qui prend corps dans un outil de recherche d&#8217;information destin&#233; &#224; montrer le type de 
r&#233;sultats qu&#8217;il est possible d&#8217;obtenir en croisant des crit&#232;res de recherche th&#233;matique avec des crit&#232;res 
temporels. 
</p>
<p>2 Etat de l&#8217;art 
</p>
<p>2.1 Recherche d&#8217;Information et temps calendaire 
</p>
<p>Le traitement automatique de l&#8217;&#171; information temporelle &#187; exprim&#233;e dans les textes s&#8217;impose depuis 
quelques ann&#233;es comme un champ de recherche important auquel on associe des retomb&#233;es dans le domaine 
de la recherche d&#8217;information (Alonso et al., 2007 ; Mestl et al., 2009) ; parmi les applications vis&#233;es : les 
syst&#232;mes de questions/r&#233;ponses, les syst&#232;mes de r&#233;sum&#233; automatique, les moteurs de recherche sur le web 
et, int&#233;gr&#233;s ou non &#224; ces derniers, les syst&#232;mes visant &#224; proposer en sortie une visualisation des informations 
sur une ligne du temps. 
</p>
<p>La caract&#233;risation de l&#8217;&#171; information temporelle &#187; en tant que telle constitue un enjeu &#8211; au c&#339;ur des 
programmes d&#8217;annotation automatique - tant sur le plan descriptif (quelles sont les unit&#233;s de la langue qui 
expriment une information temporelle ?) que sur le plan analytique (quels sont les niveaux de repr&#233;sentation 
et les strat&#233;gies calculatoires &#224; mettre en &#339;uvre pour appr&#233;hender la cat&#233;gorie s&#233;mantique du temps ?). Dans 
le champ de la recherche d&#8217;information, par rapport auquel se situent pr&#233;cis&#233;ment le plus souvent les dits </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RECHERCHE D&#8217;INFORMATION ET TEMPS LINGUISTIQUE  
 
</p>
<p>programmes d&#8217;annotation automatique, l&#8217;information temporelle est la plupart du temps rapport&#233;e &#224; ce qui 
permettrait la r&#233;solution d&#8217;une t&#226;che en particulier : celle du calcul de l&#8217;ancrage calendaire de situations 
(souvent appel&#233;es &#171; &#233;v&#233;nements &#187;) d&#233;crites dans les textes. On pourra se reporter &#224; (Battistelli, 2011) pour 
une pr&#233;sentation des enjeux descriptifs de la temporalit&#233; linguistique pour des syst&#232;mes de recherche 
d'information. Dans les applications cit&#233;es ci-dessus, les expressions linguistiques r&#233;f&#233;rant explicitement &#224; 
un calendrier (le calendrier gr&#233;gorien par exemple) ont ainsi toujours constitu&#233; un champ d&#8217;investigation 
particuli&#232;rement explor&#233;. C&#8217;est d&#8217;ailleurs dans le cadre des syst&#232;mes de questions/r&#233;ponses qu&#8217;a &#233;t&#233; 
organis&#233;e pour la premi&#232;re fois en 2004 une t&#226;che d&#8217;&#233;valuation uniquement d&#233;volue &#224; la probl&#233;matique de 
rep&#233;rage puis de normalisation (i.e. de calcul en r&#233;f&#233;rence &#224; une norme) de ce type d&#8217;expressions : Time 
Expression Recognition and Normalization (TERN) ; t&#226;che plus largement &#224; l&#8217;origine de la d&#233;marche visant 
&#224; proposer une standardisation quant &#224; l&#8217;annotation s&#233;mantique de ces expressions (cf. en particulier 
(Schilder et Habel, 2001 ; Pustejovsky et al., 2002 ; Ferro et. al., 2003 ; Saquete et. al., 2004 ; Ehrmann et 
Hag&#232;ge, 2009 ; Bittar, 2010), avec en corollaire, l&#8217;&#233;laboration de corpus annot&#233;s tels que ACE1 et 
TimeBank
</p>
<p>2
 et d&#8217;un certain nombre de syst&#232;mes automatiques (cf. par exemple Mani et Wilson, 2000; Han et 
</p>
<p>al., 2006; Ahn et al., 2007). Depuis peu, avec les avanc&#233;es r&#233;centes sur le terrain de l&#8217;acquisition 
d&#8217;informations temporelles de type calendaire dans les textes dont les r&#233;sultats commencent &#224; &#234;tre 
exploitables (UzZaman et Allen, 2010 ; Llorens et al., 2010), le champ des applications s&#8217;&#233;tend 
progressivement &#224; d&#8217;autres initiatives originales, telles que la construction automatique de chronologies 
pour explorer et visualiser le contenu de corpus de presse (ainsi des travaux de Alonso et al, 2010 qui 
s&#8217;appuient sur l&#8217;outil de production de chronologies SIMILE timeline3 ou encore ceux de Matthews et al., 
2010). Parmi les quelques initiatives des moteurs de recherche sur le terrain de la recherche d&#8217;information 
selon des crit&#232;res temporels, citons celle de Google qui permet de visualiser les r&#233;sultats d&#8217;une recherche sur 
une chronologie, puis de filtrer les r&#233;sultats sur une fen&#234;tre de temps (il s&#8217;agit du service view:timeline). 
Pour autant, si ce service tire parti des expressions calendaires pr&#233;sentes dans les textes, il ne propose pas &#224; 
proprement parler de formuler des requ&#234;tes temporelles. Du reste, seule une sous-partie des expressions 
calendaires rencontr&#233;es dans les textes est index&#233;e et donne lieu &#224; une analyse (peu ou prou, les expressions 
de la forme JJ MM AAAA, MM AAAA ou AAAA). Ces expressions sont en outre syst&#233;matiquement 
r&#233;duites &#224; une repr&#233;sentation atomique : ainsi, une expression telle que &#171; de 1815 &#224; 1871 &#187; n&#8217;est pas 
analys&#233;e comme formant une zone temporelle born&#233;e &#224; gauche et &#224; droite, mais plut&#244;t comme deux dates. 
On retrouve un comportement similaire dans des syst&#232;mes de gestion de connaissances structur&#233;es tel que le 
projet TimeSearch History
</p>
<p>4
 qui permet de croiser une recherche par mots-cl&#233;s et une recherche temporelle : 
</p>
<p>le champ d&#233;di&#233; au filtre temporel permet uniquement de sp&#233;cifier une ann&#233;e. 
</p>
<p>La difficult&#233; du traitement des informations calendaires exprim&#233;es en langue tient dans ceci qu&#8217;elles font 
intervenir des op&#233;rations de r&#233;gionalisation (du type avant, apr&#232;s, etc.), de focalisation (du type d&#233;but, fin, 
milieu), des op&#233;rations de pointage (consistant &#224; d&#233;signer une zone de r&#233;f&#233;rence sur le calendrier) et des 
grains calendaires vari&#233;s (jour, mois, ann&#233;e, parties du jour, etc.). De l&#224; l&#8217;impossibilit&#233; d&#8217;organiser les 
expressions calendaires selon un ordre total : comment en effet ordonner d&#8217;apr&#232;s un unique crit&#232;re des 
expressions aussi vari&#233;es que &#171; avant 2009 &#187;, &#171; en mars 2009 &#187;, &#171; de mi 2009 &#224; fin 2011 &#187;, &#171; aux alentours 
de 2009 &#187;, etc. ? De l&#224; &#233;galement la tentation de simplifier le probl&#232;me du traitement de ces expressions 
pour la recherche d&#8217;information, en les r&#233;duisant &#224; une repr&#233;sentation atomique qu&#8217;il devient alors possible 
d&#8217;ordonner, quitte &#224; perdre une grande partie de leur s&#233;mantique. Ce probl&#232;me renvoie &#224; celui de 
l&#8217;opposition entre duratif et ponctuel, identifi&#233; en Intelligence Artificielle comme un &#171; probl&#232;me de 
granularit&#233; &#187; (Bettini et al., 2000 ; Bechet et al., 2000), dont il est pourtant possible de sortir en consid&#233;rant 
qu&#8217;il s&#8217;agit essentiellement d&#8217;une question d&#8217;&#233;chelle.  
</p>
<p>En d&#233;pit des quelques initiatives mentionn&#233;es, les expressions calendaires dans les textes sont encore tr&#232;s 
largement aujourd&#8217;hui trait&#233;es par les moteurs de recherche grand public comme des mots-cl&#233;s dont la 
s&#233;mantique n&#8217;est pas ou peu exploit&#233;e. Ainsi, une recherche par mots-cl&#233;s sur un intervalle de temps 
(mettons &#171; de 1750 &#224; 1800 &#187;) ne ram&#232;ne que des r&#233;sultats o&#249; les termes m&#234;mes de la recherche apparaissent 
(on pourra ainsi trouver des expressions telles que &#171; en 1750 &#187; ou &#171; en 1800 &#187;, mais pas des expressions 
telles que &#171; peu apr&#232;s 1763 &#187; ou &#171; de 1755 &#224; 1799 &#187;). 
</p>
<p>                                                          
1
 Cf. les corpus LDC2005T07 et LDC2006T06 du catalogue LDC (http://www.ldc.upenn.edu). 
</p>
<p>2
 Cf. le corpus LDC2006T08 du catalogue LDC. 
</p>
<p>3
 SIMILE Timeline toolkit: http://simile.mit.edu/timeline/  
</p>
<p>4
 http://www.timesearch.info/  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLES TEISSEDRE, DELPHINE BATTISTELLI, JEAN-LUC MINEL 
 
</p>
<p>2.2 Inclusion vs. similarit&#233; temporelle 
</p>
<p>Pour comprendre l&#8217;int&#233;r&#234;t d&#8217;un principe de pertinence temporelle que nous souhaitons appr&#233;hender, il faut 
souligner les limites des approches r&#233;duisant l&#8217;interrogation temporelle &#224; l&#8217;inclusion dans une fen&#234;tre de 
temps - approche retenue dans les syst&#232;mes de gestion de BDD ou dans les moteurs de recherche qui 
proposent d&#8217;indexer des donn&#233;es temporelles. En filtrant la recherche par l&#8217;inclusion, le risque est (1) de ne 
pas renvoyer de r&#233;sultat, (2) de ne pas pouvoir ordonner les r&#233;sultats par pertinence sous l&#8217;angle des 
propri&#233;t&#233;s temporelles, et (3) d&#8217;avoir des difficult&#233;s &#224; jongler entre des granularit&#233;s ou &#233;chelles de temps 
diff&#233;rentes. Ces limites tiennent &#224; la m&#233;thodologie retenue, qui rel&#232;ve, au fond, d&#8217;une approche bool&#233;enne 
(inclusion vs. non inclusion). L&#8217;int&#233;r&#234;t du calcul d&#8217;un score de similarit&#233; est d&#8217;&#233;chapper &#224; cette approche 
restrictive, en permettant d&#8217;&#233;valuer la distance/proximit&#233; entre diff&#233;rentes caract&#233;ristiques des expressions 
calendaires. Si les relations entre intervalles de temps telles que les a d&#233;crites (Allen, 1983) permettent de 
comparer des expressions calendaires et d&#8217;obtenir des r&#233;sultats bool&#233;ens (en testant l&#8217;inclusion, le 
recouvrement, l&#8217;intersection, etc.), elles ne permettent pas &#224; elles seules de les hi&#233;rarchiser par pertinence, 
ce qui constitue le c&#339;ur de notre approche. Pour cela il faut recourir &#224; des mesures telles que la distance 
temporelle entre intervalles de temps, le taux de recouvrement, les rapports de proportions entre 
expressions, etc. 
</p>
<p>(Le Parc-Lacayrelle et al., 2007) proposent une m&#233;thode de calcul de la pertinence temporelle par rapport 
aux centro&#239;des des intervalles de temps. La m&#233;thode d&#233;crite consiste &#224; calculer la pertinence relative entre la 
requ&#234;te et la partie de l&#8217;index qui entre en intersection avec la requ&#234;te. Pour deux expressions incluses dans 
la p&#233;riode d&#233;finie par la requ&#234;te (par exemple, les expressions &#171; en 1804 &#187; et &#171; en 1859 &#187; pour une requ&#234;te 
telle que &#171; au XIX
</p>
<p>e
 si&#232;cle &#187;), on privil&#233;gie celle qui est la plus proche du centre (&#171; en 1859 &#187;). Ces travaux 
</p>
<p>ont ceci d&#8217;int&#233;ressant qu&#8217;ils introduisent la notion de pertinence en proposant une m&#233;thode 
d&#8217;ordonnancement de fragments de documents (qui renvoie aux probl&#233;matiques de &#171; ranking &#187; ou de 
&#171; scoring &#187; famili&#232;res aux moteurs de recherche). Ils se limitent toutefois &#224; l&#8217;intersection entre une requ&#234;te et 
des expressions calendaires pr&#233;sentes dans les textes (soit encore &#224; l&#8217;inclusion dans une fen&#234;tre de temps, 
bien que l&#8217;inclusion soit ici entendue en un sens moins restrictif). Ceci a pour effet, pour une requ&#234;te telle 
que &#171; le 12 ao&#251;t 1988 &#187;, d&#8217;exclure des r&#233;sultats des expressions telles que &#171; dans la nuit du 10 au 11 ao&#251;t 
1988 &#187; qui sont pourtant susceptibles de pr&#233;senter un int&#233;r&#234;t.  
</p>
<p>2.3 L&#8217;annotation des expressions calendaires 
</p>
<p>Dans le cadre du traitement automatique des informations calendaires dans les textes, il est n&#233;cessaire que 
les syst&#232;mes d&#8217;annotation soient en mesure de traiter des expressions parfois tr&#232;s complexes tout en 
proposant une repr&#233;sentation formelle manipulable par les machines et suffisamment riche pour couvrir au 
mieux la mani&#232;re dont la langue exprime une r&#233;f&#233;rence au calendrier : le mod&#232;le d&#8217;annotation a donc ici 
toute son importance. 
</p>
<p>Quelles que soient les difficult&#233;s rencontr&#233;es par les syst&#232;mes, en particulier quant au calcul de la valeur 
d&#8217;une expression relative - d&#233;ictique ou anaphorique - (Caillau et al., 2008 ; Wang et Zang, 2008 ; Mazur et 
Dale, 2008), il reste qu&#8217;aucune d&#233;marche n&#8217;a &#224; notre connaissance pris pour objet l&#8217;analyse des relations 
entre ces expressions en tirant parti, non seulement de leurs valeurs, mais aussi des unit&#233;s linguistiques &#224; 
proprement parler dans lesquelles elles entrent le plus souvent, &#224; savoir des unit&#233;s adverbiales. A dire vrai, 
ce ne sont d&#8217;ailleurs pas des expressions temporelles adverbiales qui font l&#8217;objet d&#8217;une annotation (si l&#8217;on 
s&#8217;en tient en particulier aux deux projets d&#8217;annotation majeurs &#224; l&#8217;heure actuelle que sont TIMEX2 (Ferro et 
al., 2003) et TIMEX3 (Pustejovsky et al., 2003, 2005), mais uniquement leur r&#233;f&#233;rence au syst&#232;me 
calendaire &#224; proprement parler, la signification des locutions pr&#233;positionnelles &#233;tant vou&#233;e &#224; &#234;tre trait&#233;e &#224; 
part (via une balise nomm&#233;e SIGNAL). D&#8217;autres approches, comme (Aunargue et al., 2001), (Battistelli et 
al., 2008), (Teiss&#232;dre et al., 2010) tiennent compte, elles, des pr&#233;positions et de l&#8217;ensemble des &#233;l&#233;ments qui 
interviennent dans la composition des adverbiaux temporels &#8211; &#233;l&#233;ments qui s&#8217;av&#232;rent tr&#232;s utiles pour 
l&#8217;analyse s&#233;mantique et l&#8217;indexation d&#8217;expressions telles que &#171; au d&#233;but du XXe si&#232;cle &#187;, &#171; vers le milieu des 
ann&#233;es 1950 &#187;, &#171; 3 mois avant la fin de l&#8217;ann&#233;e &#187;.  
</p>
<p>Le mod&#232;le d&#8217;annotation propos&#233; dans (Battistelli et al., 2008) permet ainsi un traitement fin de la 
granularit&#233;, en d&#233;crivant la composition des expressions calendaires et la fa&#231;on dont elles imbriquent, par-
dessus une r&#233;f&#233;rence &#224; un syst&#232;me calendaire (autrement dit, la base calendaire), des op&#233;rations de pointage 
(pointage d&#233;ictique, anaphorique ou absolu), de focalisation (d&#233;but, milieu, fin), de d&#233;placement (ex : &#171; deux 
jours avant &#187;) et de r&#233;gionalisation (avant, apr&#232;s, pendant, jusqu&#8217;&#224;, etc.).  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RECHERCHE D&#8217;INFORMATION ET TEMPS LINGUISTIQUE  
 
</p>
<p>Enfin, on peut mentionner des travaux qui portent sur les expressions it&#233;ratives (Teiss&#232;dre et al., 2010), qui 
requi&#232;rent &#233;galement des traitements particuliers, faisant notamment appel &#224; des outils de raisonnement pour 
passer de propri&#233;t&#233;s temporelles d&#233;finies en intension (ex: &#171; tous les lundis &#187;) &#224; une repr&#233;sentation en 
extension (ex : le lundi 15 mars, le lundi 22 mars, etc.). Ces traitements permettent d&#8217;appr&#233;hender des 
expressions complexes comme les dates et horaires d&#8217;ouverture (ex : &#171; ouverture du lundi au vendredi, de 
9h &#224; 19h. &#187;).  
</p>
<p>S&#8217;appuyant sur les informations issues des moteurs d&#8217;annotation, le syst&#232;me d&#8217;indexation et de recherche 
que nous avons d&#233;velopp&#233; met en regard une requ&#234;te et des expressions calendaires pr&#233;sentes dans les 
documents index&#233;s, afin de faire ressortir les parties les plus pertinentes de ces documents. La mod&#233;lisation 
retenue par les syst&#232;mes d&#8217;annotation influe donc lourdement en aval sur la capacit&#233; &#224; comparer entre elles 
les caract&#233;ristiques de diff&#233;rentes expressions calendaires. 
</p>
<p>3 Vers une heurististique de calcul de la pertinence temporelle 
</p>
<p>3.1 L&#8217;int&#233;r&#234;t d&#8217;&#233;valuer la pertinence temporelle 
</p>
<p>Afin d&#8217;illustrer l&#8217;int&#233;r&#234;t du calcul de la pertinence temporelle, la figure 1 montre la fa&#231;on dont le syst&#232;me 
que nous avons d&#233;velopp&#233; hi&#233;rarchise, pour deux requ&#234;tes diff&#233;rentes, un m&#234;me ensemble d&#8217;expressions 
calendaires. Les r&#233;sultats sont pr&#233;sent&#233;s &#224; la mani&#232;re d&#8217;un nuage de tags o&#249; les &#233;l&#233;ments les plus pertinents 
sont surlign&#233;s graphiquement : la pertinence d&#8217;un r&#233;sultat joue sur la taille de la police et le niveau de gris5.  
</p>
<p> 
</p>
<p>Fig. 1 : nuages d&#8217;expressions calendaires propos&#233;es pour deux requ&#234;tes  
</p>
<p>La figure 1 montre que la hi&#233;rarchie des r&#233;sultats varie en fonction des caract&#233;ristiques de la requ&#234;te : elle 
d&#233;pend de plusieurs crit&#232;res, qui tiennent compte de l&#8217;inclusion, certes, mais aussi de la distance temporelle 
et des rapports de proportion (ou granularit&#233;) entre la requ&#234;te et les expressions calendaires index&#233;es. 
L&#8217;outil de navigation pr&#233;sent&#233; dans la derni&#232;re section s&#8217;appuie sur cet algorithme d&#8217;ordonnancement pour 
pr&#233;senter les portions de textes les plus pertinentes pour une requ&#234;te comportant un crit&#232;re temporel. La 
figure permet &#233;galement d&#8217;illustrer l&#8217;int&#233;r&#234;t de l&#8217;approche par rapport aux syst&#232;mes qui filtrent les r&#233;sultats 
sur le seul crit&#232;re d&#8217;inclusion : la requ&#234;te 2 pr&#233;sente une &#233;tendue temporelle restreinte, dans laquelle aucun 
des r&#233;sultats pr&#233;sent&#233;s n&#8217;est inclus. Pour autant, le syst&#232;me est tout de m&#234;me en mesure de fournir des 
r&#233;sultats class&#233;s par pertinence, m&#234;me s&#8217;ils ne sont pas inclus dans la p&#233;riode d&#233;finie par la requ&#234;te de 
l&#8217;utilisateur. 
</p>
<p>3.2 Heuristique de pertinence temporelle 
</p>
<p>Les crit&#232;res entrant dans le calcul de la pertinence temporelle sont : (i) le score brut d&#8217;intersection, (ii) la 
mesure de la distance entre la requ&#234;te et les expressions calendaires apparaissant dans les documents, (iii) la 
mesure du rapport de proportion (iv) la mesure de la distance pond&#233;r&#233;e par la granularit&#233; et (v) la mesure du 
</p>
<p>                                                          
5
 D&#8217;autres choix visuels sont &#224; l&#8217;&#233;tude, afin de permettre de jongler entre diff&#233;rents types d&#8217;ordonnancement 
</p>
<p>tout en laissant appara&#238;tre le degr&#233; de pertinence des expressions calendaires par rapport &#224; une requ&#234;te 
(tri par ordre de pertinence, tri par ordre d&#8217;apparition dans un texte, tri selon l&#8217;ordre temporel, etc.). </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLES TEISSEDRE, DELPHINE BATTISTELLI, JEAN-LUC MINEL 
 
</p>
<p>taux de recouvrement. Chacun de ces scores produit un r&#233;sultat entre 0 et 1, o&#249; 1 est le meilleur score 
possible. La logique de ces scores est illustr&#233;e par diff&#233;rentes figures o&#249; les expressions calendaires (EC) 
dont on &#233;value la pertinence relative sont repr&#233;sent&#233;es au dessus de l&#8217;axe du temps : la d&#233;nomination &#171; EC 
Requ&#234;te &#187; y d&#233;signe la zone temporelle d&#233;finie par la requ&#234;te et &#171; EC R&#233;p. &#187; les zones temporelles d&#233;finies 
par les expressions formant un ensemble possible de r&#233;ponses. 
</p>
<p>&#61623; Score brut d&#8217;intersection 
</p>
<p> 
</p>
<p>Fig. 2 : intersection 
</p>
<p>Ce score recouvre une sous partie des relations d&#233;crites dans (Allen, 1983) : la relation &#171; during &#187; 
(inclusion), la relation &#171; overlaps &#187; (recoupement), la relation &#171; meets &#187; (adjacence) et leur relation inverse. 
Les scores attribu&#233;s diff&#232;rent pour l&#8217;inclusion compl&#232;te, partielle, ou inverse (lorsque la requ&#234;te est incluse 
dans une expression d&#8217;&#233;tendue plus vaste) ; le score est nul pour une expression qui n&#8217;a pas d&#8217;intersection 
avec la requ&#234;te. Ce score permet de cat&#233;goriser les documents &#224; ordonner en cinq classes (intervalles inclus, 
incluant, en intersection, concomitant ou exclus).  Ce crit&#232;re est insuffisant &#224; lui seul, parce que 
l&#8217;intersection n&#8217;est pas toujours synonyme de plus grande pertinence : ainsi, pour une requ&#234;te temporelle 
telle que &#171; en 1953 &#187;, l&#8217;expression &#171; durant le XXe  si&#232;cle &#187; obtient un meilleur score d&#8217;intersection que 
l&#8217;expression &#171; en 1954 &#187;, qui est pourtant plus proche de la requ&#234;te du point de vue de la granularit&#233;. La 
cat&#233;gorisation obtenue &#224; l&#8217;aide du score d&#8217;intersection est utile pour d&#233;cider ensuite, parmi les autres crit&#232;res 
de mesure de la pertinence ceux qui seront calcul&#233;s (score de distance ou score de recouvrement), mais aussi 
ceux des scores interm&#233;diaires qu&#8217;il faudra privil&#233;gier au d&#233;triment des autres. 
</p>
<p>&#61623; Score de distance  
</p>
<p> 
</p>
<p>Fig. 3 : distance 
</p>
<p>La distance correspond &#224; l&#8217;&#233;tendue de temps s&#233;parant deux expressions calendaires. Ce score est calcul&#233; 
pour les expressions dont l&#8217;intersection avec la requ&#234;te est nulle. Pour celles o&#249; il y a intersection, le 
pendant du score de distance est le taux de recouvrement. La mesure de la distance porte sur la borne droite 
pour les expressions s&#8217;achevant avant la p&#233;riode d&#233;sign&#233;e par la requ&#234;te et sur la borne gauche pour les 
expressions d&#233;butant apr&#232;s. 
</p>
<p>&#61623; Score de proportion 
</p>
<p> 
</p>
<p>Fig. 4 : proportion 
</p>
<p>La mesure de la proportion relative permet d&#8217;&#233;valuer la proximit&#233; des r&#233;sultats avec la requ&#234;te du point de 
vue de la granularit&#233;. Pour une requ&#234;te telle que &#171; le 15 juillet 2007 &#187;, il semble en effet plus pertinent 
d&#8217;avoir en t&#234;te de liste une date comme &#171; le 16 juillet 2007 &#187; plut&#244;t que &#171; en 2007 &#187; ou encore &#171; au XXIe  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RECHERCHE D&#8217;INFORMATION ET TEMPS LINGUISTIQUE  
 
</p>
<p>si&#232;cle &#187;. On postule donc ici qu&#8217;un utilisateur sera vraisemblablement plus int&#233;ress&#233; par une r&#233;ponse qui 
n&#8217;est pas n&#233;cessairement incluse dans la p&#233;riode d&#233;finie par sa requ&#234;te, mais qui en est proche 
s&#233;mantiquement, au sens o&#249; la nature de la requ&#234;te d&#233;termine les caract&#233;ristiques attendues dans les 
r&#233;sultats.  
</p>
<p>&#61623; Score de distance pond&#233;r&#233; par la granularit&#233; 
</p>
<p>Ce score vise &#224; pond&#233;rer la mesure de l&#8217;&#233;tendue de temps s&#233;parant les deux expressions compar&#233;es en la 
faisant d&#233;pendre de la granularit&#233; de la requ&#234;te : la distance entre deux expressions telles que &#171; en 1840 &#187; et 
&#171; en 1860 &#187; est &#233;valu&#233;e comme &#233;tant plus faible qu&#8217;entre les expressions &#171; le 11 juin 1840 &#187; et &#171; le 20 mars 
1860 &#187;, car la granularit&#233; des premi&#232;res est plus &#233;tendue. 
</p>
<p>&#61623; Score de recouvrement 
</p>
<p> 
</p>
<p>Fig. 5 : score de recouvrement 
</p>
<p>Ce score reprend ici la proposition de mod&#232;le de calcul de la pertinence formul&#233;e par (Le Parc et al., 07), &#224; 
ceci pr&#232;s que l&#8217;on fait varier le centro&#239;de d&#8217;une expression en fonction de la nature des op&#233;rations de 
r&#233;gionalisation ou de focalisation qui interviennent dans la composition des expressions compar&#233;es. On 
privil&#233;gie ainsi la distance par rapport &#224; la borne du d&#233;but pour la plupart des expressions : ceci permet, 
pour une requ&#234;te telle que &#171; dans les ann&#233;es 80 &#187;, de faire remonter dans la hi&#233;rarchie des r&#233;sultats &#171; en 
1981 &#187; plut&#244;t que &#171; en 1985 &#187; ; ce qui revient &#224; dire qu&#8217;on privil&#233;gie l&#8217;ordonnancement par rapport &#224; l&#8217;axe 
du temps (de gauche &#224; droite). Pour les expressions pr&#233;sentant une r&#233;gionalisation de type &#171; avant &#187; ou 
&#171; jusqu&#8217;&#224; &#187; (expressions d&#233;finissant des intervalles infinis &#224; gauche), la distance des intervalles compar&#233;s 
d&#233;pend de la borne droite. On consid&#232;re en revanche le centro&#239;de pour les expressions pr&#233;sentant une 
focalisation de type &#171; milieu &#187; (&#171; &#224; la mi-mai &#187;). Ce score n&#8217;a de sens et n&#8217;est calcul&#233; qu&#8217;en cas 
d&#8217;intersection entre la requ&#234;te et l&#8217;expression test&#233;e. 
</p>
<p>Le cas des intervalles infinis &#224; gauche ou &#224; droite. Les intervalles infinis &#224; gauche ou &#224; droite (ex. : &#171; 
depuis la fin du XVIe si&#232;cle &#187;, &#171; jusqu&#8217;au 13 mars 2003) demandent un traitement sp&#233;cifique pour le calcul 
des proportions relatives et du taux de recouvrement, parce que leur dur&#233;e est infinie. Ainsi, pour le calcul 
du score de proportion, on ne retient que l&#8217;&#233;tendue de la borne principale (&#171; 1950 &#187; pour l&#8217;expression 
&#171; jusqu&#8217;en 1950 &#187;). On suppose donc que l&#8217;&#233;tendue de cette borne d&#233;termine la proportion des expressions 
susceptibles d&#8217;int&#233;resser l&#8217;utilisateur : une requ&#234;te telle que &#171; avant le XVIe si&#232;cle &#187; renverra en t&#234;te de liste 
des r&#233;sultats de m&#234;me granularit&#233;. Pour le calcul de l&#8217;intersection, on attribue une valeur minime, mais non 
nulle, qui place tous les r&#233;sultats qui sont en intersection avec la requ&#234;te au m&#234;me niveau. 
</p>
<p>Combiner les mod&#232;les de pertinence. La difficult&#233; pour &#233;tablir un score global de pertinence temporelle, 
c&#8217;est que, pris isol&#233;ment, chacun de ces crit&#232;res peut produire un ordre ou un classement diff&#233;rent des 
autres : il s&#8217;agit donc de les combiner afin de produire des r&#233;sultats coh&#233;rents et pertinents. Notre 
proposition d&#8217;heuristique consiste &#224; agr&#233;ger les scores interm&#233;diaires, avec un facteur d&#8217;augmentation ou de 
r&#233;duction des scores.  
</p>
<p>Score de pertinence temporelle = K &#61620;  Score d&#8217;intersection +  
L &#61620;  Score de distance + 
M &#61620;  Score de proportion + 
N &#61620;  Score de distance pond&#233;r&#233; + 
O &#61620;  Score de recouvrement  
</p>
<p>Les facteurs de maximisation d&#8217;un score et le calcul m&#234;me des scores sont interd&#233;pendants. Ils peuvent ainsi 
varier selon que les r&#233;sultats sont ou non inclus dans la p&#233;riode d&#233;termin&#233;e par la requ&#234;te. En cas de non 
inclusion, plus la distance est grande, moins les rapports de proportions importent :  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLES TEISSEDRE, DELPHINE BATTISTELLI, JEAN-LUC MINEL 
 
</p>
<p>Score de Proportion = Score Proportion &#61620;  Score Distance 
</p>
<p>De la m&#234;me fa&#231;on, si le score de proportion est tr&#232;s faible, on minimise le score de distance et le score de 
recoupement. A ce stade les facteurs intervenant dans le calcul de pertinence ont &#233;t&#233; d&#233;termin&#233;s 
empiriquement. Nous travaillons actuellement &#224; une formalisation plus syst&#233;matique, &#224; la fois du mod&#232;le de 
pertinence et de la prise en compte des p&#244;les des intervalles (d&#233;but, milieu, fin), qui fera l&#8217;objet d&#8217;un 
prochain article (Battistelli et al., soumis). 
</p>
<p>4 Un outil de navigation temporelle dans les textes 
</p>
<p>L&#8217;outil de navigation textuelle que l&#8217;on d&#233;crit dans cette section permet &#224; l&#8217;utilisateur/lecteur d&#8217;effectuer des 
recherches th&#233;matiques et temporelles dans un texte ou un ensemble de textes, pour filtrer ou surligner les 
passages les plus pertinents. Les fonctionnalit&#233;s de recherche s&#8217;appuient sur les techniques d&#8217;indexation 
auxquelles ont commun&#233;ment recours les moteurs de recherche. De ce point de vue, l&#8217;outil d&#233;velopp&#233; peut 
tout aussi bien &#234;tre pr&#233;sent&#233; comme un prototype de moteur de recherche en mesure de traiter des requ&#234;tes 
temporelles.  
</p>
<p>Le mod&#232;le retenu pour &#233;tablir la pertinence par rapport aux mots-cl&#233;s est ici plut&#244;t simpliste et repose sur les 
outils standards propos&#233;s dans la suite Lucene. Cette exp&#233;rimentation a en effet pour fonction d&#8217;illustrer le 
type de r&#233;sultats qu&#8217;il est possible d&#8217;obtenir en croisant une requ&#234;te th&#233;matique (recherche par mots-cl&#233;s) et 
une requ&#234;te temporelle. Ceci implique, sur un plan technique, de combiner les scores de pertinence obtenue 
par ces diff&#233;rents mod&#232;les - temporel et th&#233;matique -, afin d&#8217;obtenir une liste de r&#233;sultats hi&#233;rarchis&#233;s.  
Naturellement, les deux mod&#232;les de calcul de la pertinence entrent en contradiction, ce qui oblige &#224; trouver 
un juste &#233;quilibre entre eux. Sur ce plan toutefois, il s&#8217;agit d&#8217;un probl&#232;me classique que tout moteur de 
recherche doit g&#233;rer, puisqu&#8217;il leur faut bien croiser les mod&#232;les de pertinence par rapport aux mots-cl&#233;s 
(&#171; word similarity &#187;), par rapport &#224; la popularit&#233; des sites Web (&#171; popularity &#187;), par rapport &#224; la qualit&#233; du 
site (&#171; trust &#187;), pour ne reprendre que quelques uns des mod&#232;les d&#8217;ordonnancement les plus connus, qui 
chacun produit un ordre diff&#233;rent des autres. 
</p>
<p>Le d&#233;monstrateur, un service Web accessible en ligne
6, permet &#224; l&#8217;utilisateur de charger un texte ou un 
</p>
<p>corpus de textes. Un premier pr&#233;-traitement segmente les textes en paragraphes et en phrases, dont les 
expressions calendaires sont alors annot&#233;es, puis index&#233;es. Pour cette exp&#233;rimentation, les expressions 
relatives, qui demandent un calcul particulier (les d&#233;ictiques et anaphoriques tels que &#171; demain &#187;, &#171; deux 
jours plus tard &#187;), ne sont pas trait&#233;es. Seules les expressions absolues, qui peuvent &#234;tre dispos&#233;es sur le 
calendrier sans recourir &#224; des outils de r&#233;solutions des anaphores, sont &#224; ce jour index&#233;es. 
</p>
<p>4.1 Pr&#233;-traitements : des expressions calendaires aux intervalles calendaires 
</p>
<p>Les ressources pour l&#8217;annotation des expressions calendaires utilis&#233;es dans notre syst&#232;me consistent en un 
ensemble de transducteurs Unitex (Paumier, 2000) pr&#233;sent&#233;s dans (Teiss&#232;dre et al., 2010). Les expressions 
annot&#233;es par ces ressources sont ensuite transform&#233;es en intervalles calendaires. Ce passage du mod&#232;le 
linguistique ou symbolique vers le mod&#232;le calendaire constitue une probl&#233;matique &#224; part enti&#232;re. Elle est 
prise en charge par un module d&#233;crit dans (Battistelli et al., 2011). Retenons donc ici que les expressions 
calendaires annot&#233;es sont transform&#233;es en un ou plusieurs intervalles (pour les it&#233;ratifs en particulier, 
comme &#171; tous les jours sauf le dimanche &#187;), dont les bornes peuvent &#234;tre transform&#233;es au format ISO-8601.  
</p>
<p>Exemples de transformation vers des intervalles calendaires 
</p>
<p>&#61623;  &#171; de 1830 &#224; 1940 &#187; : [1830, 1940] 
</p>
<p>&#61623; &#171; XVIe si&#232;cle &#187; : [15**, 15**]7 
</p>
<p>                                                          
6
 http://client1.mondeca.com/TemporalQueryModule/  
</p>
<p>7
 La notation YY** renvoie &#224; des si&#232;cles et la notation YYY* &#224; des d&#233;cennies. Les intervalles peuvent 
</p>
<p>&#233;galement s&#8217;&#233;crire de la fa&#231;on suivante [d&#233;but(date1), fin(date2)], dans la mesure o&#249; les bornes des 
intervalles (date1 et date2) forment elles-m&#234;mes des intervalles ayant une dur&#233;e. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RECHERCHE D&#8217;INFORMATION ET TEMPS LINGUISTIQUE  
 
</p>
<p>&#61623; &#171; fin du mois de juin 2010 &#187; : [2010&#8722;06&#8722;20, 2010&#8722;06&#8722;30] 
</p>
<p>&#61623; &#171; depuis le milieu des ann&#233;es 60 &#187; : [1965, + [ 
</p>
<p>Il faut souligner que l&#8217;exactitude (du reste impossible &#224; &#233;tablir) dans la transformation d&#8217;une repr&#233;sentation 
symbolique des expressions calendaires vers une repr&#233;sentation discr&#232;te (les intervalles calendaires) ne rev&#234;t 
pas une importance majeure, dans la mesure o&#249; la recherche repose sur des mesures de similarit&#233; : ainsi, 
savoir si &#171; le 18 juin 2010 &#187; est inclus ou non dans la p&#233;riode d&#233;finie par &#171; fin juin 2010 &#187; n&#8217;est pas crucial, 
puisque que la &#171; distance s&#233;mantique &#187; entre les deux sera de toute fa&#231;on &#233;valu&#233;e comme &#233;tant faible. Dit 
autrement, une expression comme &#171; le 18 juin 2010 &#187; sera &#233;valu&#233;e comme &#233;tant moins prototypique (ou 
similaire) que &#171; le 30 juin 2010 &#187; au regard des expressions attendues pour une requ&#234;te portant sur la &#171; fin 
juin 2010 &#187;, elle sera toutefois consid&#233;r&#233;e comme &#233;tant plus pertinente qu&#8217;une expression comme &#171; le 10 
juin 2010 &#187;. 
</p>
<p>4.2 Indexation avec Lucene 
</p>
<p>L&#8217;indexation repose sur l&#8217;API de Lucene8 et les analyseurs propos&#233;s dans la librairie pour le fran&#231;ais et 
l&#8217;anglais. Le paradigme standard pour le traitement des mots-cl&#233;s (qui exclut les &#171; mots-vides &#187; ou &#171; stop-
words &#187;) est donc repris tel quel, dans la mesure o&#249; il ne s&#8217;agit pas directement de traiter la question des 
recherches th&#233;matiques, mais plut&#244;t d&#8217;illustrer les possibilit&#233;s ouvertes par le traitement des requ&#234;tes 
calendaires. 
</p>
<p>A ce stade des d&#233;veloppements, les objets index&#233;s sont des fragments de documents, en l&#8217;occurrence, des 
phrases, afin de disposer du segment textuel contenant l&#8217;expression temporelle qui nous int&#233;resse, mais aussi 
afin de s&#8217;assurer que la distance entre l&#8217;expression temporelle et les mots-cl&#233;s, lorsqu&#8217;ils sont retrouv&#233;s dans 
le texte, ne soit pas trop importante. A ces fragments sont associ&#233;s les termes du paragraphe, l&#8217;url de la page 
Web ou le titre du document et les diff&#233;rentes expressions calendaires pr&#233;sentes. Lorsqu&#8217;un fragment de 
document contient plusieurs expressions calendaires, il est index&#233; plusieurs fois. Pour une requ&#234;te 
th&#233;matique, on privil&#233;gie ainsi les mots-cl&#233;s pr&#233;sents dans la phrase, mais on tient compte &#233;galement de 
ceux pr&#233;sents dans le paragraphe et l&#8217;url ou le titre. Il s&#8217;agit l&#224; d&#8217;une simplification rudimentaire du 
probl&#232;me complexe, du point de vue de la linguistique textuelle, de la port&#233;e des expressions calendaires, 
c&#8217;est-&#224;-dire de la fa&#231;on dont elles prennent part &#224; la structuration du discours (Van Reamdonck, 2001 ; 
Charolles et Vigier, 2005 ; Bilhaut et al., 2003).  
</p>
<p>Mettre en regard une requ&#234;te temporelle et des expressions calendaires pour &#233;valuer leur pertinence ne peut 
pas se faire d&#8217;embl&#233;e au niveau de l&#8217;indexation, car la mesure de la pertinence relative des r&#233;sultats par 
rapport &#224; la requ&#234;te n&#233;cessite une comparaison deux &#224; deux des expressions calendaires. Pour &#233;viter des 
traitements co&#251;teux qui demanderaient de balayer tout l&#8217;index pour comparer les informations temporelles 
stock&#233;es et la requ&#234;te, le parti pris est de r&#233;duire les expressions calendaires, lors de l&#8217;indexation, &#224; des 
&#233;l&#233;ments atomiques (ponctuels) sur l&#8217;axe du temps. On r&#233;duit ainsi provisoirement les expressions 
calendaires &#224; une ancre calendaire sans &#233;tendue, en ne retenant des expressions que leur &#171; point focal &#187; qui 
correspond &#224; l&#8217;ancre calendaire &#233;valu&#233;e comme la plus pertinente. Ce point correspond le plus souvent &#224; la 
borne gauche de l&#8217;intervalle temporel d&#233;crit par une expression calendaire, ce qui revient &#224; dire qu&#8217;on 
privil&#233;gie l&#8217;ordre li&#233; au sens de l&#8217;&#233;coulement du temps : ainsi pour une requ&#234;te du type &#171; au XXe si&#232;cle &#187;, on 
ordonnera par exemple une s&#233;rie de r&#233;sultats de la fa&#231;on suivante &#171; en 1903 &#187;, &#171; de 1910 &#224; 1912 &#187;, &#171; vers 
1920 &#187;, notamment parce que la distance des ces expressions par rapport &#224; la borne de gauche de la requ&#234;te 
va croissant. Toutefois, pour des expressions formant un intervalle infini &#224; gauche (ex : &#171; jusqu&#8217;en 2007 &#187;) 
ou une focalisation de type &#171; fin &#187; (ex : &#171; fin ao&#251;t 1988 &#187;), le point d&#8217;ancrage est la borne droite. Ce point 
correspond en revanche au centre pour les expressions pr&#233;sentant une focalisation de type &#171; milieu &#187; (&#171; mi-
ao&#251;t 1993 &#187;). Ainsi, par exemple, l&#8217;expression &#171; au XVIe si&#232;cle &#187; est r&#233;duite pour l&#8217;indexation &#224; la date 
suivante au format ISO-8601, 1500-01-01T00:00:00, qui correspond au d&#233;but de la borne gauche de 
l&#8217;intervalle [15**, 15**]. Le point d&#8217;ancrage de l&#8217;expression &#171; au milieu des ann&#233;es 50 &#187; correspond lui au 
centro&#239;de de l&#8217;intervalle calendaire, &#224; savoir la date suivante : 1955-01-01T00:00:00. 
</p>
<p>Le processus de comparaison et d&#8217;&#233;valuation du score de pertinence n&#8217;intervient qu&#8217;apr&#232;s filtrage des 
r&#233;sultats. Le requ&#234;tage de l&#8217;index se fait ainsi en deux &#233;tapes : (1) recherche dans l&#8217;index des K plus proches 
voisins de la requ&#234;te (par rapport au point focal de l&#8217;intervalle calendaire) ; (2) ordonnancement des 
</p>
<p>                                                          
8
 http://lucene.apache.org/  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLES TEISSEDRE, DELPHINE BATTISTELLI, JEAN-LUC MINEL 
 
</p>
<p>r&#233;sultats ainsi filtr&#233;s en fonction de leur pertinence relativement &#224; la requ&#234;te. La premi&#232;re &#233;tape du requ&#234;tage 
consiste &#224; r&#233;cup&#233;rer dans l&#8217;index des documents les K plus proches voisins de la requ&#234;te, o&#249; K correspond 
au nombre de r&#233;sultats que l&#8217;on souhaite pr&#233;senter (soit les K r&#233;sultats a priori les plus int&#233;ressants). L&#8217;&#233;tape 
suivante consiste &#224; &#233;valuer la pertinence des r&#233;sultats issus de l&#8217;&#233;tape de filtrage, qui permet d&#8217;obtenir un 
ordre total des expressions calendaires sous l&#8217;angle de la pertinence relative des documents face &#224; une 
requ&#234;te. 
</p>
<p>4.3 Croiser une requ&#234;te th&#233;matique et une requ&#234;te temporelle 
</p>
<p>Les requ&#234;tes soumises au syst&#232;me par les utilisateurs sont annot&#233;es par le m&#234;me module d&#8217;annotation que 
celui utilis&#233; pour annoter les expressions calendaires dans les documents index&#233;s. L&#8217;analyse de la requ&#234;te 
s&#233;pare un ensemble de mots-cl&#233;s (la requ&#234;te th&#233;matique) et une requ&#234;te temporelle, exprim&#233;e en langage 
naturel. Lors du parcours de l&#8217;index, les cinquante plus proches voisins de la requ&#234;te sur l&#8217;axe du temps sont 
rassembl&#233;s, selon la m&#233;thode d&#233;crite pr&#233;c&#233;demment ; cet ensemble ainsi filtr&#233; est ensuite ordonn&#233; par 
pertinence.  
</p>
<p>Pour cette premi&#232;re exp&#233;rimentation, 7782 articles en fran&#231;ais provenant de Wikipedia et relatifs &#224; l&#8217;histoire 
de France ont &#233;t&#233; annot&#233;s et index&#233;s. Le corpus contient pr&#232;s de 180 000 expressions calendaires 
&#171; absolues &#187;. La figure 6 est une copie d&#8217;&#233;cran des r&#233;sultats renvoy&#233;s pour la requ&#234;te suivante &#171; Jules Ferry 
&#224; la fin des ann&#233;es 1880 &#187;. Les premiers r&#233;sultats pr&#233;sent&#233;s sont ceux dont l&#8217;expression calendaire est 
consid&#233;r&#233;e comme la plus proche s&#233;mantiquement de la requ&#234;te.  
</p>
<p> 
</p>
<p>Fig. 6 : copie d&#8217;&#233;cran de l&#8217;outil de navigation temporelle dans un corpus 
</p>
<p>Les r&#233;sultats pr&#233;sent&#233;s &#224; l&#8217;&#233;cran (un ensemble de phrases) sont regroup&#233;s par textes source et, pour chacun 
des textes, par pertinence. La figure 6 montre que la s&#233;mantique de la requ&#234;te temporelle est correctement 
interpr&#233;t&#233;e : en effet, dans les r&#233;sultats pr&#233;sent&#233;s, on trouve en t&#234;te de liste des r&#233;sultats proches de la borne 
droite de l&#8217;intervalle correspondant &#224; l&#8217;expression &#171; &#224; la fin des ann&#233;es 1880 &#187;. Les r&#233;sultats sont en outre 
ordonn&#233;s du plus prototypique au moins pertinent par rapport &#224; la p&#233;riode d&#233;finie par la requ&#234;te.  
</p>
<p>5 Perspectives 
</p>
<p>L&#8217;exp&#233;rience montre que la m&#233;thodologie propos&#233;e pour calculer des scores de pertinence temporelle 
permet de traiter des requ&#234;tes temporelles et de faire remonter des r&#233;sultats qui tiennent compte des 
caract&#233;ristiques temporelles de la requ&#234;te. Elle illustre &#233;galement la fa&#231;on dont il est possible de croiser une 
requ&#234;te th&#233;matique et une requ&#234;te temporelle pour explorer un texte ou un corpus.  
</p>
<p>Nous commen&#231;ons &#224; travailler sur la sp&#233;cification de protocoles pour permettre d&#8217;&#233;valuer le syst&#232;me lui-
m&#234;me. Les prochains d&#233;veloppements viseront &#233;galement &#224; proposer un mod&#232;le de pertinence pour des 
documents en entier (des sites Web, plut&#244;t que des phrases), afin de disposer d&#8217;un outil de recherche 
d&#8217;informations au sein de corpus &#233;tendus sur le Web. En effet, l&#8217;algorithme de calcul de la pertinence 
temporelle peut servir tout aussi bien &#224; la navigation au sein d&#8217;un texte ou d&#8217;un corpus de textes 
(l&#8217;application que l&#8217;on pr&#233;sente dans le cadre de cet article) qu&#8217;&#224; la recherche d&#8217;informations sur le Web, 
dans la mesure o&#249; les techniques utilis&#233;es sont semblables, m&#234;me s&#8217;il faut encore parvenir &#224; &#233;tablir un </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>RECHERCHE D&#8217;INFORMATION ET TEMPS LINGUISTIQUE  
 
</p>
<p>mod&#232;le de pertinence pour un document. Ces travaux visent ainsi, &#224; terme, &#224; montrer qu&#8217;il est possible de 
combler le vide qu&#8217;il y a aujourd&#8217;hui entre la recherche d&#8217;informations sur le Web et la consultation d&#8217;un 
document propos&#233; dans les r&#233;sultats d&#8217;une recherche, en permettant &#224; l&#8217;utilisateur de fouiller le texte d&#8217;un 
site Web ais&#233;ment, avant d&#8217;y acc&#233;der.  
</p>
<p>Remerciements  
</p>
<p>Ce projet est partiellement financ&#233; par l&#8217;ANR (Contint) RMM2. 
</p>
<p>R&#233;f&#233;rences  
</p>
<p>AHN D., VAN RANTWIJK J., DE RIJKE M. (2007). A cascaded machine learning approach to interpreting 
temporal expressions. Actes de NAACL-HLT&#8217;07 Rochester, NY, USA, April. 
</p>
<p>ALLEN J. F. (1983). Maintaining knowledge about temporal intervals. Actes de ACM 26, no. 11 (November). 
832-843. 
</p>
<p>ALONSO O., GERTZ M., BAEZA-YATES R. (2007). On the value of temporal information in information 
retrieval. Actes de ACM SIGIR Forum 41, no. 2 (December). 35-41. 
</p>
<p>ALONSO O., BERBERICH K., BEDATHUR S., WEIKUM G. (2010). Time-Based Exploration of News Archives. 
In HCIR 2010. New Brunswick. 12-15. 
</p>
<p>AUNARGUE M., BRAS M., VIEU L., ASHER N. (2001). The syntax and semantics of locating adverbials. 
Cahiers de Grammaire, 26, 11&#8211;35. 
</p>
<p>BATTISTELLI D., CORI M., MINEL J.-L., TEISSEDRE C. (soumis). Querying calendar references in texts. 8 p. 
</p>
<p>BATTISTELLI D., CORI M., MINEL J.-L., TEISSEDRE C. (2011). Semantics of Calendar Adverbials for 
Information Retrieval. ISMIS 2011 (LNCS), Warsaw, June 28-30 2011, 9 p. 
</p>
<p>BATTISTELLI D. (2011). Linguistique et recherche d&#8217;information : la probl&#233;matique du temps. Herm&#232;s 
Sciences, 249 pages, coll. Traitement de l&#8217;Information, avril 2011. 
</p>
<p>BATTISTELLI D., COUTO J., MINEL J.-L., SCHWER, S. (2008). Representing and Visualizing calendar 
expressions in texts. Actes de STEP&#8217;08, Venice. 
</p>
<p>BECHET G., CLERIN-DEBARD F., ENJALBERT P. (2000). A qualitative Model for Time Granularity. 
Computational Intelligence, Vol. 16 (2), 137-175.  
</p>
<p>BETTINI C., JAJODIA S., WANG S. (2000). Time granularities in Databases, Datamining, and Temporal 
Reasoning. Springer (Eds), 2000, XI, 230 p. 
</p>
<p>BILHAUT F., HO-DAC L.M., BORILLO A., CHARNOIS T., ENJALBERT P., LE DRAOULEC A., MATHET Y., 
MIGUET H., P&#201;RY-WOODLEY M.-P., SARDA L. (2003). Indexation discursive pour la navigation 
intradocumentaire : cadres temporels et spatiaux dans l&#8217;information g&#233;ographique. Actes de TALN 2003, 
315-320.  
</p>
<p>BITTAR A. (2010). Building a TimeBank for French: A Reference Corpus Annotated According to the ISO-
TimeML Standard. Th&#232;se de doctorat, Universit&#233; Paris Diderot (Paris 7).  
</p>
<p>CAILLAU F., GIRAUDEL A., ARNULPHY B. (2009). Tracking Out-of-date Newspaper Articles. ACL, Research 
in Computing Science 41, 2009, 277-288. 
</p>
<p>CHAROLLES M., VIGIER D. (2005). Les adverbiaux en position pr&#233;verbale : port&#233;e cadrative et organisation 
des discours. Langue Fran&#231;aise vol 2, no. 148, 9-30.  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>CHARLES TEISSEDRE, DELPHINE BATTISTELLI, JEAN-LUC MINEL 
 
</p>
<p>EHRMANN M., HAG&#200;GE C. (2009). Proposition de caract&#233;risation et de typage des expressions temporelles 
en contexte. Actes de TALN&#8217;09, Senlis, France  
</p>
<p>FERRO L., GERBER L., MANI  I., SUNDHEIM B., WILSON G. (2003). TIDES Standard for the Annotation of 
Temporal Expressions, http://www.mitre.org/work/tech\-papers/tech-papers-04/ferro-tides/. 
</p>
<p>HAN B., GATES D., LEVIN L. (2006). From language to time: A temporal expression anchorer. Actes 
TIME&#8217;06, IEEE Computer Society, June, 196&#8211;203. 
 
KLEIN W. (1994). Time in Language. London, Routledge. 
</p>
<p>LE PARC-LACAYRELLE A., GAIO M., SALLABERRY C. (2007). La composante temps dans l'information 
g&#233;ographique textuelle, Document num&#233;rique 2/2007 (Vol. 10), 129-148. 
</p>
<p>LLORENS H., SAQUETE E., NAVARRO B. (2010). TIPSem (English and Spanish): Evaluating CRFs and 
Semantic Roles in TempEval-2. Actes de 5th International Workshop on Semantic Evaluation, ACL 2010, 
284-291. 
</p>
<p>MANI I., WILSON G. (2000). Robust temporal processing of news. Actes de 38
th
</p>
<p> ACL, 69&#8211;76. 
</p>
<p>MATTHEWS M., TOLCHINSKY P., MIKA P., BLANCO R., ZARAGOZA, H. (2010). Searching through time in the 
New York Times Categories and Subject Descriptors. Actes de HCIR 2010 - Challenge Report, 41-44. 
</p>
<p>MAZUR P.,  DALE R. (2008). What&#8217;s the Date? High Accuracy Interpretation of Weekday Names. Actes de 
22
</p>
<p>nd
 International Conference on Computational Linguistics. Manchester. 553&#8211;560. 
</p>
<p>MESTL T., CERRATO O., &#216;LNES J. , MYRSETH P., GUSTAVSEN I.-M. (2009). Time Challenges &#8211; Challenging 
Times for Future Information Search. D-Lib Magazine, Volume 15 Number 5/6, May/June 2009. 
</p>
<p>PAUMIER S. (2002). Manuel d&#8217;utilisation du logiciel Unitex. IGM, Universit&#233; de Marne-La-Vall&#233;e.  
</p>
<p>PUSTEJOVSKY J., CASTANO J., INGRIA R., SAUR&#205; R., GAIZAUSKAS R., SETZER A., KATZ G. (2003). TimeML: 
Robust specification of event and temporal expressions in text. Actes de IWCS-5, Fifth International 
Workshop on Computational Semantics.  
</p>
<p>SAQUETE E., P. MART&#205;NEZ-BARCO, R. MU&#209;OZ, J.L. VICEDO (2004). Splitting Complex Temporal Questions 
for Question Answering systems. Association for Computational Linguistics (ACL) Barcelona, SPAIN. July 
2004 
</p>
<p>SCHILDER F., HABEL C. (2001). From Temporal Expres-sions to Temporal Information: Semantic Tagging 
of News Messages. Actes de ACL&#8217;01, Workshop on temporal and spatial information processing, 65 -72. 
</p>
<p>TEISSEDRE C., BATTISTELLI D., MINEL J.-L. (2010). Resources for Calendar Expressions Semantic Tagging 
and Temporal Navigation through Texts, Actes de LREC 2010, 3572-3577. 
</p>
<p>TEISSEDRE C., BATTISTELLI D., MINEL J.-L. (2010). Du texte au portail s&#233;mantique : cas d'utilisation li&#233; &#224; des 
donn&#233;es temporelles. In Actes d&#8217;IC&#8217;2010, 209-220. 
</p>
<p>UZZAMAN N., ALLEN J. F. (2010). TRIPS and TRIOS System for TempEval-2: Extracting Temporal In-
formation from Text. Actes du 5
</p>
<p>th
 International Workshop on Semantic Evaluation, ACL 2010. 276-283. 
</p>
<p>VAN RAEMDONCK D. (2001). Est-il pertinent de parler d'une classe d'adverbes de temps ? Actes de CLAC 7. 
</p>
<p>WANG R., ZHANG Y. (2008). Recognizing Textual Entailment with Temporal Expressions in Natural 
Language Texts. Actes de 2008 IEEE International Workshop on Semantic Computing and Applications 
(IWSCA '08). </p>

</div></div>
</body></html>