<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>Enrichissement de structures en d&#233;pendances par r&#233;&#233;criture de graphes</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211;1er juillet 2011
</p>
<p>Enrichissement de structures en d&#233;pendances par r&#233;&#233;criture de graphes
</p>
<p>Guillaume Bonfante, Bruno Guillaume, Mathieu Morey, Guy Perrier
INRIA Nancy-Grand Est - LORIA - Nancy-Universit&#233;
</p>
<p>R&#233;sum&#233;. Nous montrons comment enrichir une annotation en d&#233;pendances syntaxiques au format du French
Treebank de Paris 7 en utilisant la r&#233;&#233;criture de graphes, en vue du calcul de sa repr&#233;sentation s&#233;mantique. Le
syst&#232;me de r&#233;&#233;criture est compos&#233; de r&#232;gles grammaticales et lexicales structur&#233;es en modules. Les r&#232;gles lexicales
utilisent une information de contr&#244;le extraite du lexique des verbes fran&#231;ais Dicovalence.
</p>
<p>Abstract. We show how to enrich a syntactic dependency annotation of the French Paris 7 Treebank
format, using graph rewriting, in order to compute its semantic representation. The rewriting system is composed
of grammatical and lexical rules structured in modules. The lexical rules use a control information extracted from
Dicovalence, a lexicon of French verbs.
</p>
<p>Mots-cl&#233;s : d&#233;pendance, French Treebank, r&#233;&#233;criture de graphes, Dicovalence.
</p>
<p>Keywords: dependency, French Treebank, graph rewriting, Dicovalence.
</p>
<p>Introduction
</p>
<p>Cet article propose une m&#233;thode d&#8217;enrichissement des structures en d&#233;pendances syntaxiques de surface et il
applique cette m&#233;thode au French Treebank de Paris 7 (par la suite not&#233; FTB). Il entre dans la ligne de recherche
ouverte par Bonfante et al. (2010) o&#249; nous montrions comment calculer &#8212; au moyen de la r&#233;&#233;criture de graphes &#8212;
la s&#233;mantique d&#8217;une phrase &#224; partir de sa structure en d&#233;pendances syntaxiques. De mani&#232;re plus g&#233;n&#233;rale, notre
approche s&#8217;inscrit dans le contexte des m&#233;thodes exactes et symboliques de calcul en TAL.
</p>
<p>Les repr&#233;sentations de la syntaxe en d&#233;pendances connaissent une popularit&#233; croissante pour l&#8217;&#233;valuation et la
comparaison d&#8217;analyses syntaxiques. Les raisons principales en sont donn&#233;es par Kahane (2001) : les d&#233;pendances
syntaxiques sont lexicalis&#233;es et proches de la s&#233;mantique. Il existe tr&#232;s peu de corpus annot&#233;s en d&#233;pendances pour
le fran&#231;ais ; mais, r&#233;cemment, Candito et al. (2009) ont montr&#233; comment produire une annotation en d&#233;pendances
de surface du FTB &#224; partir de son annotation en constituants (Abeill&#233; et al., 2003). Dans cet article, nous utilisons
ce corpus pour tester notre syst&#232;me.
</p>
<p>Dans Bonfante et al. (2010), nous avons propos&#233; le principe de la r&#233;&#233;criture de graphes pour calculer la s&#233;man-
tique &#224; partir de la syntaxe. Nos entr&#233;es &#233;taient des analyses syntaxiques profondes &#224; la mani&#232;re des structures
tectogrammaticales du Prague Dependency TreeBank 1 (Hajic&#780; et al., 2000). Dans notre cas, il s&#8217;agissait de struc-
tures enrichies du format PASSAGE 2. Dans Bonfante et al. (2011), nous avons montr&#233; que l&#8217;on pouvait employer
en fait le format FTB d&#232;s lors que certaines d&#233;pendances syntaxiques profondes &#233;taient ajout&#233;es : les arguments
lexicalement ou grammaticalement d&#233;termin&#233;s des infinitifs et les ant&#233;c&#233;dents des pronoms relatifs et r&#233;fl&#233;chis et
</p>
<p>1. http://ufal.mff.cuni.cz/pdt2.0/
2. http://atoll.inria.fr/passage/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>des sujets r&#233;p&#233;t&#233;s. Dans les deux cas, les exp&#233;rimentations demandaient une phase manuelle de pr&#233;paration des
donn&#233;es pour ajouter les annotations manquantes. Par ailleurs, nos syst&#232;mes surg&#233;n&#233;raient car ils n&#8217;int&#233;graient pas
d&#8217;informations lexicales.
</p>
<p>Nous pallions ici ces d&#233;fauts en proposant un enrichissement automatique du FTB par des r&#232;gles purement gram-
maticales et par d&#8217;autres qui utilisent de l&#8217;information lexicale extraite de Dicovalence (Van den Eynde &amp; Mertens,
2003). Ces r&#232;gles, en combinaison avec celles de l&#8217;article Bonfante et al. (2011), permettent donc d&#8217;obtenir auto-
matiquement une structure s&#233;mantique 3 &#224; partir d&#8217;une annotation en d&#233;pendances provenant du FTB.
</p>
<p>Les probl&#232;mes &#8212; &#233;chec de la r&#233;&#233;criture, structures produites malform&#233;es &#8212; que nous avons rencontr&#233;s au cours
de nos exp&#233;rimentations, rel&#232;vent souvent d&#8217;erreurs d&#8217;annotations ou d&#8217;incoh&#233;rences dans les structures du FTB.
Notre syst&#232;me peut donc servir, par effet de bord, d&#8217;outil de fouilles d&#8217;erreurs et d&#8217;aide &#224; la correction de corpus
annot&#233;s.
</p>
<p>Dans la section 1, nous posons le probl&#232;me &#224; travers un exemple introductif et nous pr&#233;sentons bri&#232;vement le
mod&#232;le de r&#233;&#233;criture de graphes choisi pour enrichir les annotations en d&#233;pendances du FTB. Puis dans la section
2, nous d&#233;crivons le syst&#232;me de r&#232;gles de r&#233;&#233;criture de graphes qui a &#233;t&#233; utilis&#233; pour le faire et enfin dans la section
3 nous pr&#233;sentons la validation exp&#233;rimentale qui a &#233;t&#233; effectu&#233;e sur le FTB.
</p>
<p>1 Position du probl&#232;me
</p>
<p>De fa&#231;on g&#233;n&#233;rale, pour calculer la s&#233;mantique, il est utile d&#8217;ajouter &#224; l&#8217;annotation en syntaxe de surface deux
types d&#8217;informations : les ant&#233;c&#233;dents d&#8217;anaphores syntaxiques et certains actants syntaxiques. Dans la d&#233;marche
propos&#233;e ici, la structure en d&#233;pendances de surface est celle du FTB. Nous nous imposons comme contrainte de
ne pas modifier l&#8217;entr&#233;e mais seulement d&#8217;enrichir la structure &#224; l&#8217;aide de nouvelles relations. Ce choix permet
de rester compl&#232;tement compatible avec d&#8217;autres travaux ou outils bas&#233;s sur le format du FTB et de leur servir de
guide. Il &#233;vite &#233;galement de d&#233;finir un nouveau format ad-hoc.
</p>
<p>L&#8217;exemple donn&#233; ci-dessous est annot&#233; par, en noir, les d&#233;pendances syntaxiques du guide d&#8217;annotation utilis&#233;
par (Candito et al., 2009) 4 et, en vert, les d&#233;pendances &#224; ajouter.
</p>
<p>l' &#233;l&#232;ve que Jean dit qu' on a pr&#233;sent&#233; comme difficile &#224; g&#233;rer
DET SUJ OBJ AUX_TPS ATO OBJ A-OBJ OBJ
</p>
<p>SUJMOD_REL
OBJ
</p>
<p>OBJ
</p>
<p>ANT_REL SUJ
OBJ
</p>
<p>Pour les ant&#233;c&#233;dents d&#8217;anaphores syntaxiques, nous nous en tenons &#224; des ph&#233;nom&#232;nes bien d&#233;limit&#233;s : les ant&#233;-
c&#233;dents des pronoms relatifs, des pronoms personnels r&#233;fl&#233;chis et des pronoms personnels r&#233;p&#233;titions de sujets.
Retrouver l&#8217;ant&#233;c&#233;dent d&#8217;un pronom relatif peut s&#8217;av&#233;rer complexe. Sur notre exemple, il faut remonter une cha&#238;ne
de trois d&#233;pendances OBJ qui va du pronom relatif &#171; que &#187; jusqu&#8217;&#224; la t&#234;te de la relative &#171; dit &#187; (en passant par
&#171; pr&#233;sent&#233; &#187; et &#171; qu&#8217; &#187;). De l&#224;, on retrouve l&#8217;ant&#233;c&#233;dent &#171; &#233;l&#232;ve &#187; en remontant la d&#233;pendance MOD_REL. Plus
</p>
<p>3. une structure DMRS (Copestake, 2009)
4. http://www.linguist.univ-paris-diderot.fr/~mcandito/Rech/FTBDeps</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ENRICHISSEMENT DE STRUCTURES EN D&#201;PENDANCES PAR R&#201;&#201;CRITURE DE GRAPHES
</p>
<p>g&#233;n&#233;ralement, la longueur des cha&#238;nes de d&#233;pendances n&#8217;est pas born&#233;e. En outre, la cha&#238;ne peut contenir plu-
sieurs sortes de relations et les structures de traits des n&#339;uds rencontr&#233;s suivent certaines contraintes. Pour ces
deux raisons, le calcul n&#8217;est pas imm&#233;diat.
</p>
<p>Les actants syntaxiques &#224; ajouter sont essentiellement les sujets des infinitifs s&#8217;ils sont pr&#233;sents dans la phrase.
Nous mettons &#233;galement dans cette cat&#233;gorie les objets directs d&#8217;infinitifs comme dans la construction du tough
movement. Ainsi dans l&#8217;expression &#171; un livre difficile &#224; lire &#187;, l&#8217;objet de &#171; lire &#187; est &#171; livre &#187;. Manquent &#233;galement
dans le FTB les sujets des participes pr&#233;sents et des participes pass&#233;s dans leur utilisation adjectivale. De fa&#231;on plus
g&#233;n&#233;rale, il para&#238;t utile de traiter de fa&#231;on uniforme les syntagmes adjectivaux et de leur associer syst&#233;matiquement
un sujet, que leur t&#234;te soit un participe ou un adjectif.
</p>
<p>Comme les actants syntaxiques sont mutuellement d&#233;pendants, le calcul des relations SUJ et OBJ doit en tenir
compte. Dans notre exemple, nous proc&#233;dons dans l&#8217;ordre suivant. Nous commen&#231;ons par marquer la d&#233;pendance
SUJ entre l&#8217;adjectif &#171; difficile &#187; et son sujet &#171; que &#187;. En effet, &#171; que &#187; est l&#8217;objet direct de &#171; pr&#233;sent&#233; &#187; et &#171; difficile &#187;
en est l&#8217;attribut de l&#8217;objet. Partant de celle nouvelle relation, nous pouvons marquer la relation OBJ du verbe
&#171; g&#233;rer &#187; vers le sujet de &#171; difficile &#187;. Cette annotation d&#233;coule d&#8217;une propri&#233;t&#233; lexicale de l&#8217;adjectif &#171; difficile &#187; :
son aptitude au tough movement.
</p>
<p>Pour enrichir les structures de d&#233;pendances, nous employons le formalisme (&#946;-calcul) que nous avons introduit
dans Bonfante et al. (2010, 2011). Dans le cadre restreint de cet article, nous n&#8217;utilisons pas la r&#233;&#233;criture de
graphes de fa&#231;on essentielle ; nos r&#232;gle rep&#232;rent, dans des graphes, des motifs qui sont des arbres. Les seules
transformations consistant &#224; ajouter des ar&#234;tes, on pourrait certainement exprimer ces r&#232;gles avec un formalisme
moins puissant mais l&#8217;utilisation du &#946;-calcul permet l&#8217;homog&#233;n&#233;it&#233; de traitement avec les modules propos&#233;s dans
les autres articles. Dans ce formalisme, un calcul proc&#232;de par transformations successives des structures de d&#233;pen-
dances jusqu&#8217;&#224; leur normalisation. Le syst&#232;me est d&#233;crit par un ensemble fini de r&#232;gles, chacune d&#8217;entre elles &#233;tant
donn&#233;e par un motif et une liste de commandes &#233;l&#233;mentaires (ajout d&#8217;ar&#234;te, suppression de n&#339;ud, etc). Une &#233;tape
de calcul consiste &#224; reconna&#238;tre le motif d&#8217;une r&#232;gle dans le graphe courant et &#224; modifier le graphe selon les com-
mandes de la r&#232;gle. La figure 1, en fin d&#8217;article, montre le d&#233;roulement de la r&#233;&#233;criture sur la phrase &#171; Je trouve ce
livre difficile &#224; lire &#187;. L&#8217;encadr&#233; en haut de la figure pr&#233;sente les deux r&#232;gles ATTR-OBJ et TOUGH-MOVEMENT
utilis&#233;es dans cet exemple. Pour chaque r&#232;gle, le sch&#233;ma repr&#233;sente le motif reconnu, en rose et rouge. Au-dessous,
est not&#233;e la liste de commandes effectuant la r&#233;&#233;criture. Par exemple, pour la r&#232;gle ATTR-OBJ , la liste se r&#233;duit
&#224; la commande add_edge A &#8211;[SUJ]&#8211;&gt; O qui ajoute une relation SUJ de l&#8217;attribut de l&#8217;objet &#224; l&#8217;objet du verbe.
</p>
<p>Pour avoir un contr&#244;le global sur le calcul, nous avons montr&#233; dans (Bonfante et al., 2011) qu&#8217;une organisation
modulaire des r&#232;gles simplifie la t&#226;che de d&#233;veloppement d&#8217;un syst&#232;me de r&#232;gles. De fait, des consid&#233;rations
linguistiques justifient &#224; la fois la d&#233;finition des modules et leur ordre d&#8217;application.
</p>
<p>2 R&#232;gles utilis&#233;es pour l&#8217;enrichissement
</p>
<p>L&#8217;enrichissement de l&#8217;annotation de surface se fait au moyen de quatre types de r&#232;gles :
&#8211; des r&#232;gles grammaticales d&#8217;actants d&#233;terminent de fa&#231;on purement grammaticale certains sujets d&#8217;infinitifs, de
</p>
<p>participes et d&#8217;adjectifs,
&#8211; des r&#232;gles lexicales d&#8217;actants, extraites d&#8217;un lexique, d&#233;terminent les sujets ou objets d&#8217;infinitifs compl&#233;ments
</p>
<p>de verbes ou d&#8217;adjectifs &#224; contr&#244;le,
&#8211; des r&#232;gles d&#8217;ant&#233;c&#233;dents d&#233;terminent les ant&#233;c&#233;dents des anaphores syntaxiques,
&#8211; des r&#232;gles de coordination ajoutent les actants syntaxiques manquants aux conjoints.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>2.1 R&#232;gles grammaticales d&#8217;actants
</p>
<p>2.1.1 Sujets des syntagmes adjectivaux
</p>
<p>Les participes t&#234;tes de syntagmes adjectivaux n&#8217;ont pas de sujets explicites dans le FTB car celui-ci ne contient que
des arbres de d&#233;pendances. Le sujet d&#8217;un participe a d&#233;j&#224; une autre fonction syntaxique ; le d&#233;signer reviendrait
donc &#224; lui attribuer un deuxi&#232;me gouverneur. Voyons quelques exemples (les participes sont mis en gras) :
</p>
<p>Jean arrive en chantant.
Abandonn&#233;e de tous, elle ne sait plus que faire.
Pierre sait Marie d&#233;laiss&#233;e par son mari.
Un homme se pr&#233;sentant comme son fr&#232;re vient d&#8217;arriver.
</p>
<p>La configuration grammaticale dans laquelle se trouvent ces participes permet de d&#233;terminer leur sujet.
</p>
<p>Nous &#233;tendons d&#8217;ailleurs la notion de sujet aux syntagmes adjectivaux qui ont un adjectif comme t&#234;te, pour deux
raisons. Premi&#232;rement, au niveau s&#233;mantique, les adjectifs vont se traduire (comme les verbes) par des pr&#233;dicats
dont il faudra d&#233;terminer les arguments. Deuxi&#232;mement, les adjectifs peuvent se trouver dans des constructions
vari&#233;es : &#233;pith&#232;te, attribut du sujet, attribut de l&#8217;objet, dislocation. Toutes ces constructions sont compatibles avec
le tough movement, comme le montrent les exemples suivants :
</p>
<p>Je connais un livre difficile &#224; lire.
Ce livre passe pour difficile &#224; lire.
Je trouve ce livre difficile &#224; lire.
Difficile &#224; lire, ce livre n&#8217;est pas &#224; conseiller &#224; tout le monde.
</p>
<p>Dans ces phrases, la relation entre &#171; livre &#187; et &#171; difficile &#187; implique que &#171; livre &#187; est objet de &#171; lire &#187;. Attribuer
un sujet aux adjectifs permet de traiter les ph&#233;nom&#232;nes comme le tough movement (Rezac, 2006) avec une seule
r&#232;gle, qui est ind&#233;pendante de la configuration dans laquelle ces adjectifs apparaissent. Cela conduit d&#8217;ailleurs &#224;
une approche uniforme des adjectifs et des verbes, ce qui simplifie la d&#233;finition des r&#232;gles de calcul du sujet et des
autres compl&#233;ments.
</p>
<p>Il y a autant de r&#232;gles que de constructions int&#233;grant des syntagmes adjectivaux. Ici, nous en consid&#233;rons sept :
&#233;pith&#232;te, attribut du sujet (avec ou sans pr&#233;position), attribut de l&#8217;objet (avec ou sans pr&#233;position), dislocation,
g&#233;rondif. La r&#232;gle ATTR-OBJ de la figure 1 (en fin d&#8217;article) s&#8217;applique aux attributs de l&#8217;objet sans pr&#233;position.
</p>
<p>2.1.2 Sujets des infinitifs dans certaines constructions grammaticales
</p>
<p>Comme les sujets des participes, les sujets des infinitifs ne sont pas exprim&#233;s dans le FTB ; les ajouter aboutirait
&#233;galement &#224; violer la contrainte d&#8217;arbre des structures en d&#233;pendances. Certaines constructions syntaxiques asso-
ci&#233;es &#224; des mots grammaticaux contiennent pourtant des infinitifs dont le sujet n&#8217;est pas ambigu. Consid&#233;rons les
exemples suivants o&#249; les infinitifs concern&#233;s sont en gras :
</p>
<p>Jean vient &#224; Paris pour travailler.
Jean ne vient jamais &#224; Paris sans visiter la Tour Eiffel.
Jean est trop poli pour ne pas saluer Marie.
</p>
<p>Dans les deux premiers exemples, les pr&#233;positions &#171; pour &#187; et &#171; sans &#187; introduisent des compl&#233;ments circons-
tanciels qui sont des infinitifs. Dans le dernier exemple, le couple &#171; trop . . . pour &#187; se construit avec un premier
&#233;l&#233;ment qui peut &#234;tre un adjectif (ici &#171; poli &#187;), un adverbe ou un verbe et un second &#233;l&#233;ment qui est toujours un
infinitif (&#171; saluer &#187;).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ENRICHISSEMENT DE STRUCTURES EN D&#201;PENDANCES PAR R&#201;&#201;CRITURE DE GRAPHES
</p>
<p>PREP-MOD-V
</p>
<p>S V PREP
MOD
</p>
<p>XXXXX cat=v cat=prep cat=v
mood=inf|pastp
</p>
<p>SUJ MOD OBJ
</p>
<p>add_edge MOD &#8211;[SUJ]&#8211;&gt; S
</p>
<p>Deux r&#232;gles traitent ces diff&#233;rentes construc-
tions. Dans le cas des infinitifs compl&#233;ments
circonstanciels, la r&#232;gle PREP-MOD-V ci-
contre fait appara&#238;tre que le sujet de l&#8217;infini-
tif est le sujet de la proposition principale mo-
difi&#233;e 5. Dans le cas de la construction &#171; trop
+ ADJ + pour + VINF &#187;, une autre r&#232;gle fait
appara&#238;tre le sujet de l&#8217;infinitif comme le sujet
de l&#8217;adjectif. L&#224; encore, attribuer un sujet aux
adjectifs permet d&#8217;appliquer une m&#234;me r&#232;gle
dans diff&#233;rentes configurations syntaxiques.
</p>
<p>2.2 R&#232;gles lexicales d&#8217;actants
</p>
<p>2.2.1 Le cas des verbes &#224; contr&#244;le ou &#224; mont&#233;e
</p>
<p>Lorsqu&#8217;un infinitif est compl&#233;ment d&#8217;un verbe &#224; contr&#244;le ou &#224; mont&#233;e, son sujet, s&#8217;il est exprim&#233; dans la phrase,
est d&#233;termin&#233; par ce verbe. Voyons quelques exemples o&#249; les infinitifs sont mis en gras et leur sujet profond est
soulign&#233;.
</p>
<p>Jean semble changer d&#8217;avis.
Jean permet &#224; Marie de venir.
Jean promet &#224; Marie de venir.
Jean propose &#224; Marie de venir.
</p>
<p>Dans la premi&#232;re phrase, &#171; sembler &#187; est un verbe &#224; mont&#233;e, l&#8217;infinitif qui le suit partage son sujet. Dans les deux
suivantes, les verbes &#171; permettre &#187; et &#171; promettre &#187; d&#233;terminent le sujet de &#171; venir &#187; : &#171; Marie &#187; pour la premi&#232;re
et &#171; Jean &#187; pour la deuxi&#232;me. La derni&#232;re phrase est ambigu&#235;, le sujet de &#171; venir &#187; peut &#234;tre &#171; Jean &#187; ou &#171; Marie &#187;.
Ce dernier exemple montre que le syst&#232;me que l&#8217;on a &#224; d&#233;crire est n&#233;cessairement non confluent.
</p>
<p>Les verbes &#224; contr&#244;le peuvent &#234;tre group&#233;s en diff&#233;rentes classes selon la fonction de l&#8217;infinitif contr&#244;l&#233; et selon
la fonction du syntagme sujet de cet infinitif. Il y a trois possibilit&#233;s pour chacun de ces deux facteurs : sujet, objet
direct et objet indirect, donc six classes possibles (les deux fonctions syntaxiques sont n&#233;cessairement diff&#233;rentes).
Pour chaque classe, il y a plusieurs r&#232;gles, afin de g&#233;rer l&#8217;&#233;ventuelle pr&#233;sence d&#8217;un compl&#233;menteur &#171; &#224; &#187; ou &#171; de &#187;
introduisant l&#8217;infinitif.
</p>
<p>Les verbes &#224; contr&#244;le poss&#232;dent, dans le lexique des verbes du fran&#231;ais Dicovalence (Van den Eynde &amp; Mer-
tens, 2003), un ou plusieurs champs PIVOT qui contiennent leurs informations de contr&#244;le. Ces informations
sont extraites automatiquement de Dicovalence pour ancrer lexicalement les r&#232;gles des verbes &#224; contr&#244;le, comme
&#171; permettre &#187; dans l&#8217;exemple suivant :
</p>
<p>VAL$ permettre: P0 P1 (P2)
NUM$ 60700
FRAME$ subj:pron|n:[hum], obj:pron|n|compl|de_inf:[abs,mood:subj], ?obj&#224;:pron|n:[hum]
PIVOT$ P2/P0 [below de_inf in P1]
</p>
<p>5. Il y a quelques exceptions &#224; cette r&#232;gle qui ne sont pas trait&#233;es : les constructions impersonnelles et certaines expression fig&#233;es.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>V-OBJIND-AOBJ
</p>
<p>V A AO PREP O
</p>
<p>cat=v
lemma=permettre | ... 
</p>
<p>cat=prep
lemma=&#224;
</p>
<p>XXXXX
XXXXX
</p>
<p>cat=prep
lemma=&#224; | de
</p>
<p>cat=v
mood=inf | pastp
</p>
<p>A-OBJ OBJ OBJ
OBJ
</p>
<p>add_edge O &#8211;[SUJ]&#8211;&gt; AO
</p>
<p>P2/PO [below de_inf in P1] se lit ainsi : l&#8217;objet indirect de &#171; permettre &#187; introduit par &#171; &#224; &#187;, not&#233; P2 dans
Dicovalence, est le sujet, not&#233; P0, d&#8217;une infinitive introduite par &#171; de &#187; (de_inf) qui est l&#8217;objet direct , not&#233; P1, de
&#171; permettre &#187;. Cela se traduit dans la r&#232;gle V-OBJIND-AOBJ par la commande add_edge O &#8211;[SUJ]&#8211;&gt; AO qui
ajoute une relation SUJ de l&#8217;objet direct O vers le groupe nominal objet indirect AO.
</p>
<p>2.2.2 Le cas des adjectifs &#224; contr&#244;le
</p>
<p>Lorsqu&#8217;un infinitif est compl&#233;ment d&#8217;un adjectif &#224; contr&#244;le, son sujet ou son objet &#8212; quand il est pr&#233;sent dans la
phrase &#8212; est d&#233;termin&#233; lexicalement. Le tough movement est l&#8217;une de ces configurations. Voici quelques exemples
o&#249; les infinitifs sont en gras :
</p>
<p>Jean est lent &#224; comprendre.
Le livre est difficile &#224; comprendre.
</p>
<p>Comme pour les verbes, c&#8217;est l&#8217;information lexicale sur les adjectifs &#171; lent &#187; et &#171; difficile &#187; qui d&#233;termine que le
sujet du premier est le sujet de &#171; comprendre &#187;, alors que le sujet du second est l&#8217;objet direct de &#171; comprendre &#187;.
</p>
<p>Les adjectifs &#224; contr&#244;le forment deux classes, selon que leur sujet est le sujet ou l&#8217;objet direct de l&#8217;infinitif contr&#244;l&#233;.
Ces deux cas se traduisent chacun par une r&#232;gle ; la r&#232;gle TOUGH-MOVEMENT de la figure 1 correspond au cas o&#249;
c&#8217;est l&#8217;objet de l&#8217;infinitif qui est contr&#244;l&#233;.
</p>
<p>Il n&#8217;existe pas, pour les adjectifs, l&#8217;&#233;quivalent de Dicovalence pour les verbes. Nous avons donc relev&#233; les adjectifs
du corpus qui pr&#233;sentaient un argument infinitif et nous les avons class&#233;s manuellement pour ancrer les r&#232;gles.
</p>
<p>2.3 Les ant&#233;c&#233;dents d&#8217;anaphores syntaxiques
</p>
<p>Conna&#238;tre les liens anaphoriques qui sont totalement d&#233;termin&#233;s par la syntaxe permet de calculer certaines co-
r&#233;f&#233;rences s&#233;mantiques. Dans ce travail, nous en distinguons trois types.
</p>
<p>Le premier est le pronom r&#233;fl&#233;chi compl&#233;ment r&#233;el d&#8217;un verbe : son ant&#233;c&#233;dent est le sujet de ce verbe. Par
exemple, dans &#171; Jean ne veut pas se laver &#187;, l&#8217;objet direct de &#171; laver &#187; est &#171; se &#187;, qui co-r&#233;f&#232;re s&#233;mantiquement
avec &#171; Jean &#187;. Une r&#232;gle permet de d&#233;tecter ce cas et une relation not&#233;e ANT_REFL entre le pronom et son
ant&#233;c&#233;dent est ajout&#233;e.
</p>
<p>Le second est le pronom personnel r&#233;p&#233;tition d&#8217;un sujet : son ant&#233;c&#233;dent est l&#8217;autre sujet du verbe. Dans &#171; Jean
veut-il manger ? &#187;, &#171; veut &#187; a deux sujets, dont &#171; il &#187; qui co-r&#233;f&#232;re s&#233;mantiquement avec &#171; Jean &#187;. Une relation
ANT_REP est alors ajout&#233;e.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ENRICHISSEMENT DE STRUCTURES EN D&#201;PENDANCES PAR R&#201;&#201;CRITURE DE GRAPHES
</p>
<p>Le troisi&#232;me type de lien anaphorique que nous consid&#233;rons relie un pronom relatif &#224; son ant&#233;c&#233;dent. La cr&#233;ation
de ce lien, not&#233; ANT_REL, est un probl&#232;me plus complexe. Dans le FTB, il faut pour cela remonter les d&#233;pen-
dances depuis le pronom relatif jusqu&#8217;&#224; la t&#234;te de la relative, laquelle est reli&#233;e &#224; l&#8217;ant&#233;c&#233;dent par une d&#233;pendance
MOD_REL. Consid&#233;rons l&#8217;expression suivante annot&#233;e selon le guide du FTB :
</p>
<p>Jean dont on dit que Marie a pu conna&#238;tre l' amie de la m&#232;re
SUJ OBJ AUX_TPS OBJ DET DE-OBJ DET
</p>
<p>SUJ OBJ OBJMOD_REL
OBJ
</p>
<p>DE-OBJ
</p>
<p>Dans cet exemple, on passe du pronom relatif &#224; son ant&#233;c&#233;dent en remontant successivement les d&#233;pendances
DE-OBJ, OBJ, DE-OBJ, OBJ, OBJ, OBJ, OBJ, MOD_REL (en rouges dans la figure ci-dessous). Finalement, la
nouvelle d&#233;pendance ANT_REL (en vert et en bas sur la figure), est produite.
</p>
<p>Jean dont on dit que Marie a pu conna&#238;tre l' amie de la m&#232;re
SUJ OBJ AUX_TPS OBJ DET DE-OBJ DET
</p>
<p>SUJ OBJ OBJMOD_REL
OBJ
</p>
<p>DE-OBJ
</p>
<p>ANT_REL
</p>
<p>ANT_REL
</p>
<p>ANT N_1 N_2 N_k REL
cat=n | pro XXXXX XXXXX XXXXX cat=pro_rel
</p>
<p>MOD_REL &#172; MOD_REL &#172; MOD_REL* XXX
</p>
<p>add_edge REL &#8211;[ANT_REL]&#8211;&gt; ANT
</p>
<p>La transformation peut &#234;tre d&#233;crite &#224; l&#8217;aide
du motif g&#233;n&#233;ralis&#233; ci-contre. Toutefois, d&#8217;une
part, ce type de motif ne permet pas d&#8217;exprimer
les contraintes (comme les contraintes d&#8217;&#238;lots)
sur les structures de trait des noeuds. D&#8217;autre
part, un tel motif n&#8217;est plus local, or cette pro-
pri&#233;t&#233; de localit&#233; du calcul permet une implan-
tation efficace. La solution propos&#233;e ici em-
ploie un lien temporaire ANT_TMP entre le
pronom relatif et le point de la cha&#238;ne o&#249; on
se situe dans sa remont&#233;e. Les quatre r&#232;gles ci-dessous impl&#233;mentent le motif g&#233;n&#233;ralis&#233; en prenant en compte les
contraintes d&#8217;&#238;lots 6.
</p>
<p>INIT REC
</p>
<p>N_k REL
XXXXX cat=pro_rel
</p>
<p>XXXX
</p>
<p>N_k-1 N_k REL
XXXXX cat=n | prep | adj | pro cat=pro_rel
</p>
<p>&#172; MOD_REL
</p>
<p>ANT_TMP
</p>
<p>add_edge REL &#8211;[ANT_TMP]&#8211;&gt; Nk
del_edge REL &#8211;[ANT_TMP]&#8211;&gt; Nk
add_edge REL &#8211;[ANT_TMP]&#8211;&gt; Nk&#8722;1
</p>
<p>6. Des motifs n&#233;gatifs (non repr&#233;sent&#233;s dans les figures) permettent de bloquer l&#8217;application d&#8217;une r&#232;gle : par exemple, la r&#232;gle INIT ne
doit s&#8217;appliquer que sur un pronom relatif o&#249; il n&#8217;y a pas encore de lien ANT de cr&#233;&#233;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>RECV STOP
</p>
<p>N_1 N_2 REL
cat=v cat=v cat=pro_rel
</p>
<p>OBJ
</p>
<p>ANT_TMP
</p>
<p>ANT N_1 REL
cat=n | pro XXXXX cat=pro_rel
</p>
<p>MOD_REL
</p>
<p>ANT_TMP
</p>
<p>del_edge REL &#8211;[ANT_TMP]&#8211;&gt; N2
add_edge REL &#8211;[ANT_TMP]&#8211;&gt; N1
</p>
<p>del_edge REL &#8211;[ANT_TMP]&#8211;&gt; N1
add_edge REL &#8211;[ANT_REL]&#8211;&gt; ANT
</p>
<p>Les relatives qui sont en apposition ou les constructions cliv&#233;es peuvent &#234;tre rep&#233;r&#233;es par le m&#234;me m&#233;canisme
de r&#232;gle g&#233;n&#233;ralis&#233;e d&#233;compos&#233;e en r&#232;gles atomiques (en changeant seulement la derni&#232;re r&#232;gle). Les exemples
suivants sont issus du corpus :
</p>
<p>C&#8217;est une novice inspir&#233;e qui redressa [...]
Une mutation est en marche, qui ne s&#8217;arr&#234;tera sans doute pas [...]
</p>
<p>2.4 La coordination
</p>
<p>La coordination est annot&#233;e dans le FTB de fa&#231;on &#224; respecter la contrainte d&#8217;arbre : un lien COORD va de la t&#234;te du
premier conjoint jusqu&#8217;&#224; la conjonction de coordination et un autre lien DEP_COORD va de la conjonction jusqu&#8217;&#224;
la t&#234;te du second conjoint. Si la t&#234;te du second conjoint est un verbe ou un adjectif, il est n&#233;cessaire de d&#233;terminer
ses actants syntaxiques pour calculer sa repr&#233;sentation s&#233;mantique ; or les actants syntaxiques du second conjoint
ne sont pas annot&#233;s dans le FTB quand ils sont partag&#233;s avec le premier conjoint. Consid&#233;rons quelques exemples
de coordination de syntagmes verbaux ou adjectivaux, o&#249; la t&#234;te du second conjoint est en gras et les actants
partag&#233;s soulign&#233;s :
</p>
<p>Jean d&#233;balle et mange son casse-cro&#251;te.
Abandonn&#233;e de son mari et d&#233;go&#251;t&#233;e, Marie ne sort plus.
Jean pense partir aujourd&#8217;hui et pouvoir rentrer dans un mois.
</p>
<p>Dans le cadre de cet article, nous nous limitons &#224; la recherche du sujet du second conjoint. Pour cela, on cr&#233;e une
d&#233;pendance SUJ entre le verbe t&#234;te du second conjoint et le sujet du premier conjoint, &#224; condition que le second
conjoint n&#8217;ait pas d&#233;j&#224; un sujet. Deux r&#232;gles diff&#233;rentes cr&#233;ent cette d&#233;pendance, selon que les syntagmes verbaux
coordonn&#233;s sont introduits ou non par une pr&#233;position ou un compl&#233;menteur.
</p>
<p>3 Mise en &#339;uvre
</p>
<p>3.1 Organisation en modules
</p>
<p>Nous avons montr&#233; dans (Bonfante et al., 2011) qu&#8217;une organisation modulaire permettait d&#8217;avoir un contr&#244;le
global sur le calcul et de simplifier le d&#233;veloppement d&#8217;un syst&#232;me de r&#232;gles. Les modules sont d&#233;termin&#233;s lin-</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ENRICHISSEMENT DE STRUCTURES EN D&#201;PENDANCES PAR R&#201;&#201;CRITURE DE GRAPHES
</p>
<p>guistiquement : un module est un ensemble de r&#232;gles contribuant &#224; une transformation linguistique particuli&#232;re
qu&#8217;il est possible d&#8217;isoler relativement aux autres r&#232;gles.
</p>
<p>Cette organisation en modules permet &#233;galement de g&#233;rer le comportement global du syst&#232;me de r&#233;&#233;criture. Dans
le cas pr&#233;sent, la terminaison est v&#233;rifi&#233;e pour chaque module, elle l&#8217;est donc globalement. Comme on l&#8217;a vu dans
le cas des verbes &#224; contr&#244;le, notre enrichissement est n&#233;cessairement non-confluent mais cette non-confluence est
tr&#232;s localis&#233;e (lexicalement) et donc contr&#244;lable.
</p>
<p>Par rapport &#224; notre objectif g&#233;n&#233;ral de construire une repr&#233;sentation s&#233;mantique &#224; partir d&#8217;une repr&#233;sentation syn-
taxique en d&#233;pendances, les modules jouent un r&#244;le essentiel. Par rapport &#224; la t&#226;che limit&#233;e qui est celle pr&#233;sent&#233;e
dans cet article et qui consiste &#224; enrichir les d&#233;pendances du FTB, ils ont une port&#233;e plus restreinte. Les interactions
possibles entre les r&#232;gles permettent difficilement de les isoler en modules.
</p>
<p>Ainsi, les r&#232;gles grammaticales d&#8217;actants et les r&#232;gles lexicales d&#8217;actants peuvent se combiner de plusieurs fa&#231;ons.
Prenons deux exemples. Dans la phrase &#171; Jean boit pour essayer d&#8217;oublier &#187;, une r&#232;gle grammaticale &#233;tablit que
&#171; Jean &#187; est sujet d&#8217;&#171; essayer &#187;, puis une r&#232;gle lexicale ajoute que &#171; Jean &#187; est aussi sujet d&#8217;&#171; oublier &#187;. Dans la
phrase &#171; Marie interdit &#224; Jean de boire pour oublier &#187;, une r&#232;gle lexicale &#233;tablit &#171; Jean &#187; comme sujet de &#171; boire &#187;,
puis une r&#232;gle grammaticale &#233;tablit que &#171; Jean &#187; est aussi sujet d&#8217;&#171; oublier &#187;.
</p>
<p>S&#233;parer les r&#232;gles lexicales et grammaticales dans des modules diff&#233;rents ne permettrait pas de capturer toutes
leurs interactions. C&#8217;est la raison pour laquelle nous r&#233;partissons les r&#232;gles, au nombre de 47, pr&#233;sent&#233;es dans les
sous-sections pr&#233;c&#233;dentes en trois modules ordonn&#233;s comme suit :
&#8211; le premier module ajoute les relations ANT des pronoms r&#233;fl&#233;chis, r&#233;p&#233;titions de sujets et relatifs vers leurs
</p>
<p>ant&#233;c&#233;dents. Il contient 8 r&#232;gles : 6 pour les relatives qui d&#233;composent le motif g&#233;n&#233;ralis&#233;, 1 pour les pronoms
r&#233;fl&#233;chis et 1 pour les pronoms personnels r&#233;p&#233;titions de sujets ;
</p>
<p>&#8211; le second module, SUJET, ajoute les relations SUJ des adjectifs, participes et infinitifs, que la r&#232;gle soit gram-
maticale ou lexicale. Il contient 36 r&#232;gles :11 r&#232;gles grammaticales et 25 r&#232;gles lexicales ;
</p>
<p>&#8211; le troisi&#232;me module, OBJET, ajoute les relations OBJ des infinitifs contr&#244;l&#233;s dans des constructions de tough
movement. Il contient 3 r&#232;gles.
</p>
<p>Le fait d&#8217;ajouter des sujets aux adjectifs permet de g&#233;rer le tough movement avec une seule r&#232;gle. En revanche, il
est alors n&#233;cessaire d&#8217;appliquer le module SUJET avant le module OBJET.
</p>
<p>Enfin, la coordination intervient dans tous les modules et n&#233;cessite un traitement particulier. Reprenons un exemple
d&#233;j&#224; introduit pour la coordination :
</p>
<p>Jean pense partir aujourd&#8217;hui et pouvoir rentrer dans un mois.
Dans cet exemple, il faut d&#233;terminer le sujet de &#171; partir &#187; avant d&#8217;en d&#233;duire que &#171; pouvoir &#187; partage ce sujet. Cela
incite donc &#224; appliquer les r&#232;gles de coordination apr&#232;s le module SUJET. Cependant, pour d&#233;terminer le sujet de
&#171; rentrer &#187;, il est n&#233;cessaire de conna&#238;tre le sujet de &#171; pouvoir &#187;. De ce point de vue, il faudrait donc appliquer les
r&#232;gles relatives &#224; la coordination avant le module SUJET.
</p>
<p>Un moyen de r&#233;soudre cette contradiction est de particulariser chaque r&#232;gle de coordination en autant de r&#232;gles
qu&#8217;il existe de modules concern&#233;s.
</p>
<p>3.2 Exp&#233;riences
</p>
<p>Nous avons appliqu&#233; notre syst&#232;me aux 12 351 phrases annot&#233;es en d&#233;pendances que contient le FTB. Un extrait
de 120 phrases est disponible en ligne 7.
</p>
<p>7. http://wikilligramme.loria.fr/doku.php?id=taln2011</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>Les relations ANT, SUJ et OBJ que nous ajoutons sont tr&#232;s courantes dans le corpus : on en observe sur 87% des
phrases. En outre, on ajoute, sur chaque phrase, en moyenne, trois nouvelles relations. On peut remarquer le faible
nombre de relations OBJ ajout&#233;es qui montrent que le tough movement est assez rare en corpus. Pour avoir une
&#233;valuation plus fine, notamment de la pr&#233;cision, il faudrait disposer d&#8217;une partie du corpus annot&#233;e manuellement
qui n&#8217;existe malheureusement pas pour l&#8217;instant.
</p>
<p>Au total, nous ajoutons :
&#8211; 3 691 relations ANT (3 152 pour les pronoms relatifs, 99 pour les pronoms r&#233;fl&#233;chis et 270 pour les pronoms
</p>
<p>personnels r&#233;p&#233;titions de sujets) ;
&#8211; 33 605 relations SUJ (23 940 pour les adjectifs et 9 665 pour les verbes) ;
&#8211; 19 relations OBJ.
Pour avoir une id&#233;e pr&#233;cise de la pertinence de ce syst&#232;me, il convient &#233;galement d&#8217;essayer de d&#233;tecter les cas
probl&#233;matiques, c&#8217;est-&#224;-dire les cas o&#249; des relations sont susceptibles de manquer dans les structures produites par
notre syst&#232;me de r&#233;&#233;criture. Pour cela, nous avons observ&#233; les trois configurations suivantes :
&#8211; les verbes (sauf imp&#233;ratifs et auxiliaires) qui n&#8217;ont toujours pas de sujet (de surface ou profond) apr&#232;s r&#233;&#233;criture,
</p>
<p>il y en a 3 548 ;
&#8211; les adjectifs sans sujet : 955
&#8211; les pronoms relatifs sans ant&#233;c&#233;dent : 242
Pour chacune de ces configurations, nous avons &#233;tudi&#233; un &#233;chantillon de 100 phrases que nous avons class&#233;es
manuellement. Le r&#233;sultat de ce classement figure dans le tableau ci-dessous.
</p>
<p>Pas d&#8217;erreur Annotation FTB Probl&#232;me de lexique Probl&#232;me de r&#232;gles
verbes sans sujet 51 29 13 7
</p>
<p>adjectifs sans sujet 32 45 1 22
pronoms relatifs sans ant&#233;c&#233;dent 5 72 0 23
</p>
<p>Les erreurs d&#8217;annotation du FTB que nous avons relev&#233;es sont syst&#233;matiques et probablement li&#233;es &#224; la conver-
sion du FTB des constituants aux d&#233;pendances. L&#8217;annotation du FTB est donc la premi&#232;re source d&#8217;erreur dans
notre processus. Les probl&#232;mes de lexique sont li&#233;s &#224; des constructions nominales qui ne sont pas d&#233;crites dans
Dicovalence. Nos r&#232;gles ne couvrent pas certains ph&#233;nom&#232;nes linguistiques : par exemple, un adjectif en emploi
substantiv&#233; peut &#234;tre ant&#233;c&#233;dent d&#8217;une relative.
</p>
<p>Discussion
</p>
<p>(Gardent &amp; Cerisara, 2010; Gardent, 2010) ont aussi utilis&#233; la r&#233;&#233;criture de graphes sur le FTB mais avec un
objectif diff&#233;rent du n&#244;tre, celui d&#8217;ajouter une annotation en r&#244;les s&#233;mantiques pour les verbes. C&#8217;est pourquoi la
plupart des r&#232;gles qu&#8217;ils ont con&#231;ues vise &#224; reformuler les constructions passives et causatives en constructions
actives canoniques. Les quelques r&#232;gles suppl&#233;mentaires traitent de la coordination et des sujets des infinitifs. Les
derni&#232;res, n&#8217;utilisant pas d&#8217;information lexicale, ont le d&#233;faut de syst&#233;matiquement choisir pour sujet des infinitifs
compl&#233;ments celui du verbe dont ils d&#233;pendent. Enfin, l&#8217;&#233;tude n&#8217;aborde pas la question de la d&#233;pendance entre les
r&#232;gles et de leur ordre d&#8217;application.
</p>
<p>Nous avons montr&#233; dans (Bonfante et al., 2011) qu&#8217;il &#233;tait possible de prendre compte les reformulations dans
toute leur diversit&#233; (passif, moyen, causatif, impersonnel . . .) &#224; l&#8217;aide de la r&#233;&#233;criture de graphes. Si nous avons
&#233;cart&#233; celles-ci du travail pr&#233;sent&#233; dans cet article, c&#8217;est que nous nous &#233;tions fix&#233; comme cadre pour ce travail
d&#8217;enrichir les structures en d&#233;pendances du FTB sans modifier les relations existantes.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ENRICHISSEMENT DE STRUCTURES EN D&#201;PENDANCES PAR R&#201;&#201;CRITURE DE GRAPHES
</p>
<p>Int&#233;grer les reformulations n&#233;cessiterait d&#8217;ajouter des r&#232;gles correspondantes au syst&#232;me qui vient d&#8217;&#234;tre pr&#233;sent&#233;.
Les interactions complexes entre ces r&#232;gles nouvelles et les r&#232;gles existantes font que cela ne peut pas se faire
simplement par l&#8217;ajout d&#8217;un module avant ou apr&#232;s ceux qui ont &#233;t&#233; d&#233;finis dans cet article. Par exemple, pour
la phrase &#171; Jean est autoris&#233; &#224; partir &#187;, la reformulation du passif doit &#234;tre effectu&#233;e avant la d&#233;termination du
sujet profond de &#171; partir &#187;. C&#8217;est le contraire pour la phrase &#171; Jean demande &#224; Marie d&#8217;&#234;tre aid&#233;e de Pierre. &#187; En
cons&#233;quence, l&#8217;int&#233;gration des reformulations devrait nous amener &#224; restructurer le syst&#232;me de modules.
</p>
<p>Nos exp&#233;rimentations ont mis en &#233;vidence certaines limites du format d&#8217;annotation du FTB, qui sont dues essen-
tiellement au choix des annotateurs de n&#8217;avoir que des arbres comme structures de d&#233;pendance. Premi&#232;rement,
l&#8217;annotation des constructions causatives ne distingue pas le sujet et l&#8217;objet du verbe caus&#233;. Dans &#171; Jean fait
manger un lapin &#187;, &#171; lapin &#187; est annot&#233; OBJ de &#171; manger &#187;, que le lapin mange ou soit mang&#233;. Deuxi&#232;mement,
lorsque deux verbes sont coordonn&#233;s, l&#8217;annotation ne permet pas de retrouver les compl&#233;ments partag&#233;s du se-
cond conjoint. Ainsi &#171; Jean d&#233;balle et mange son sandwich &#187; et &#171; Jean d&#233;balle son sandwich et mange &#187; ont la
m&#234;me annotation. Rien ne permet de distinguer que dans la premi&#232;re phrase, &#171; sandwich &#187; est &#233;galement objet de
&#171; d&#233;balle &#187; alors que dans la deuxi&#232;me, &#171; sandwich &#187; n&#8217;est pas objet de &#171; mange &#187;.
</p>
<p>Remerciements Nous remercions Sylvain Kahane pour une discussion qui a d&#233;clench&#233; ce travail. Nous tenons
&#233;galement &#224; remercier Anne Abeill&#233; pour nous avoir autoris&#233; &#224; publier un extrait du FTB.
</p>
<p>R&#233;f&#233;rences
</p>
<p>ABEILL&#201; A., CL&#201;MENT L. &amp; TOUSSENEL F. (2003). Building a Treebank for French, In Treebanks. Building
and Using Parsed Corpora, chapter 10. Kluwer Academic Publishers.
</p>
<p>BONFANTE G., GUILLAUME B., MOREY M. &amp; PERRIER G. (2010). R&#233;&#233;criture de graphes de d&#233;pendances
pour l&#8217;interface syntaxe-s&#233;mantique. In TALN 2010, Montr&#233;al, Canada.
</p>
<p>BONFANTE G., GUILLAUME B., MOREY M. &amp; PERRIER G. (2011). Modular graph rewriting to compute
semantics. In IWCS 2011, p. 65&#8211;74, Oxford, UK.
</p>
<p>CANDITO M.-H., CRABB&#201; B., DENIS P. &amp; GU&#201;RIN F. (2009). Analyse syntaxique statistique du fran&#231;ais : des
constituants aux d&#233;pendances. In TALN 2009, Senlis, France.
</p>
<p>COPESTAKE A. (2009). Invited Talk : Slacker semantics : Why superficiality, dependency and avoidance of
commitment can be the right way to go. In EACL 2009, Athens, Greece.
</p>
<p>GARDENT C. (2010). Extraction des cadres syntaxiques &#224; partir de P7dep. Notes transmises par l&#8217;auteur.
</p>
<p>GARDENT C. &amp; CERISARA C. (2010). Semi-Automatic Probanking for French. In TLT9 &#8211; the ninth internatio-
nal workshop on Treebanks and Linguistic Theories, Tartu, Estonia.
</p>
<p>HAJIC&#780; J., B&#214;HMOV&#193; A., HAJIC&#780;OV&#193; E. &amp; HLADK&#193; B. (2000). The Prague Dependency Treebank : A Three-
Level Annotation Scenario, In Treebanks : Building and Using Parsed Corpora, p. 103&#8211;127. Amsterdam :Kluwer.
</p>
<p>KAHANE S. (2001). Grammaires de d&#233;pendance formelles et th&#233;orie Sens-Texte. In Tutoriel, TALN 2001,
volume 2, Tours.
</p>
<p>REZAC M. (2006). On tough-movement, In Minimalist Essays, p. 288&#8211;325. Linguistik Aktuell/Linguistics Today
91. John Benjamins.
</p>
<p>VAN DEN EYNDE K. &amp; MERTENS P. (2003). La valence : l&#8217;approche pronominale et son application au lexique
verbal. French Language Studies, 13, 63&#8211;104.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>GUILLAUME BONFANTE, BRUNO GUILLAUME, MATHIEU MOREY, GUY PERRIER
</p>
<p>ATTR-OBJ TOUGH-MOVEMENT
</p>
<p>V O A
cat=v XXXXX cat=adj
</p>
<p>OBJ
ATO
</p>
<p>S ADJ PREP V
</p>
<p>XXXXX
XXXXX
</p>
<p>cat=adj
lemma=difficile | facile | long
</p>
<p>cat=prep
lemma=&#224;
</p>
<p>cat=v
mood=inf
</p>
<p>SUJ A-OBJ OBJ
</p>
<p>add_edge A &#8211;[SUJ]&#8211;&gt; O add_edge V &#8211;[OBJ]&#8211;&gt; S
</p>
<p>structure initiale je
cat=pro
lemma=je
</p>
<p>trouve
cat=v
</p>
<p>lemma=trouver
mood=ind
</p>
<p>ce
cat=det
lemma=ce
</p>
<p>livre
cat=n
</p>
<p>lemma=livre
difficile
</p>
<p>cat=adj
lemma=difficile
</p>
<p>&#224;
cat=prep
lemma=&#224;
</p>
<p>lire
cat=v
</p>
<p>lemma=lire
mood=inf
</p>
<p>SUJ DET A-OBJ OBJ
OBJ
</p>
<p>ATO
</p>
<p>identification du
motif de la r&#232;gle
ATTR-OBJ puis
r&#233;&#233;criture
</p>
<p>V
O A
</p>
<p>je
cat=pro
lemma=je
</p>
<p>trouve
cat=v
</p>
<p>lemma=trouver
mood=ind
</p>
<p>ce
cat=det
lemma=ce
</p>
<p>livre
cat=n
</p>
<p>lemma=livre
difficile
</p>
<p>cat=adj
lemma=difficile
</p>
<p>&#224;
cat=prep
lemma=&#224;
</p>
<p>lire
cat=v
</p>
<p>lemma=lire
mood=inf
</p>
<p>SUJ DET A-OBJ OBJ
OBJ
</p>
<p>ATO
</p>
<p>SUJ
</p>
<p>identification du
motif de la r&#232;gle
TOUGH-MOVEMENT
puis r&#233;&#233;criture S ADJ PREP V
</p>
<p>je
cat=pro
lemma=je
</p>
<p>trouve
cat=v
</p>
<p>lemma=trouver
mood=ind
</p>
<p>ce
cat=det
lemma=ce
</p>
<p>livre
cat=n
</p>
<p>lemma=livre
difficile
</p>
<p>cat=adj
lemma=difficile
</p>
<p>&#224;
cat=prep
lemma=&#224;
</p>
<p>lire
cat=v
</p>
<p>lemma=lire
mood=inf
</p>
<p>SUJ DET A-OBJ OBJ
OBJ
</p>
<p>ATO
</p>
<p>SUJ
OBJ
</p>
<p>structure finale
je
</p>
<p>cat=pro
lemma=je
</p>
<p>trouve
cat=v
</p>
<p>lemma=trouver
mood=ind
</p>
<p>ce
cat=det
lemma=ce
</p>
<p>livre
cat=n
</p>
<p>lemma=livre
difficile
</p>
<p>cat=adj
lemma=difficile
</p>
<p>&#224;
cat=prep
lemma=&#224;
</p>
<p>lire
cat=v
</p>
<p>lemma=lire
mood=inf
</p>
<p>SUJ DET A-OBJ OBJ
OBJ
</p>
<p>ATO
</p>
<p>SUJ
OBJ
</p>
<p>FIGURE 1 &#8211; &#171; Je trouve ce livre difficile &#224; lire. &#187;</p>

</div></div>
</body></html>