<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#201;valuer la pertinence de la morphologie constructionnelle dans les syst&#232;mes de Question-R&#233;ponse</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>TALN 2011, Montpellier, 27 juin &#8211; 1er juillet 2011
</p>
<p>&#201;valuer la pertinence de la morphologie constructionnelle
dans les syst&#232;mes de Question-R&#233;ponse
</p>
<p>Delphine Bernhard1 Bruno Cartoni2 Delphine Tribout1
(1) LIMSI-CNRS, 91403 Orsay, France
</p>
<p>(2) D&#233;partement de linguistique, Universit&#233; de Gen&#232;ve, Suisse
bernhard@limsi.fr, bruno.cartoni@unige.ch, tribout@limsi.fr
</p>
<p>R&#233;sum&#233;. Les connaissances morphologiques sont fr&#233;quemment utilis&#233;es en Question-R&#233;ponse afin de fa-
ciliter l&#8217;appariement entre mots de la question et mots du passage contenant la r&#233;ponse. Il n&#8217;existe toutefois pas
d&#8217;&#233;tude qualitative et quantitative sur les ph&#233;nom&#232;nes morphologiques les plus pertinents pour ce cadre applicatif.
Dans cet article, nous pr&#233;sentons une analyse d&#233;taill&#233;e des ph&#233;nom&#232;nes de morphologie constructionnelle permet-
tant de faire le lien entre question et r&#233;ponse. Pour ce faire, nous avons constitu&#233; et annot&#233; un corpus de paires
de questions-r&#233;ponses, qui nous a permis de construire une ressource de r&#233;f&#233;rence, utile pour l&#8217;&#233;valuation de la
couverture de ressources et d&#8217;outils d&#8217;analyse morphologique. Nous d&#233;taillons en particulier les ph&#233;nom&#232;nes de
d&#233;rivation et de composition et montrons qu&#8217;il reste un nombre important de relations morphologiques d&#233;rivation-
nelles pour lesquelles il n&#8217;existe pas encore de ressource exploitable pour le fran&#231;ais.
</p>
<p>Abstract. Morphological knowledge is often used in Question Answering systems to facilitate the matching
between question words and words in the passage containing the answer. However, there is no qualitative and
quantitative study about morphological phenomena which are most relevant to this application. In this paper, we
present a detailed analysis of the constructional morphology phenomena found in question and answer pairs. To
this aim, we gathered and annotated a corpus of question and answer pairs. We relied on this corpus to build a
gold standard for evaluating the coverage of morphological analysis tools and resources. We detail in particular
the phenomena of derivation and composition and show that a significant number of derivational morphological
relations are still not covered by any existing resource for the French language.
</p>
<p>Mots-cl&#233;s : &#201;valuation, Morphologie, Ressources, Syst&#232;me de Question-R&#233;ponse.
</p>
<p>Keywords: Evaluation, Morphology, Resources, Question-answering system.
</p>
<p>1 Introduction
</p>
<p>Les syst&#232;mes de Question-R&#233;ponse (QR) ont pour objectif de fournir une r&#233;ponse pr&#233;cise &#224; une question. Pour
ce faire, ils reposent g&#233;n&#233;ralement sur un composant de recherche d&#8217;information (RI) qui vise &#224; apparier les mots
de la question avec les mots des documents contenant la r&#233;ponse potentielle. La principale difficult&#233; pour les
syst&#232;mes de RI r&#233;side dans le fait qu&#8217;une r&#233;ponse peut se trouver dans un document qui ne reprend pas forc&#233;ment
les mots de la question. Les syst&#232;mes de RI et de QR doivent donc pouvoir r&#233;cup&#233;rer les documents pertinents
sans se baser uniquement sur l&#8217;identit&#233; formelle entre les mots de la question et les mots du document. &#192; cette
fin, la morphologie a souvent &#233;t&#233; pr&#233;f&#233;r&#233;e &#224; une analyse s&#233;mantique plus complexe dans la mesure o&#249; deux
mots reli&#233;s morphologiquement montrent g&#233;n&#233;ralement une similitude formelle qui permet de prendre en compte
facilement leur relation s&#233;mantique. Les syst&#232;mes de RI et de QR int&#232;grent donc g&#233;n&#233;ralement des connaissances
morphologiques, que ce soit lors de l&#8217;indexation des documents ou lors de la recherche, en &#233;tendant les requ&#234;tes
ou en les reformulant au moyen de mots morphologiquement reli&#233;s. Cette int&#233;gration est g&#233;n&#233;ralement effectu&#233;e
de mani&#232;re tr&#232;s g&#233;n&#233;rique, c&#8217;est-&#224;-dire que toutes les relations morphologiques possibles, ou pour lesquelles on
dispose d&#8217;une ressource, sont incluses. Par ailleurs, les &#233;valuations sont effectu&#233;es de mani&#232;re globale, en &#233;valuant
l&#8217;am&#233;lioration de la performance globale du syst&#232;me, et non l&#8217;impact de cet ajout.
</p>
<p>La plupart des recherches men&#233;es dans ce domaine utilisent des techniques de d&#233;suffixation (stemming) bas&#233;es
sur des heuristiques simples qui suppriment la fin des mots (Lennon et al., 1988; Harman, 1991; Fuller &amp; Zobel,</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, BRUNO CARTONI, DELPHINE TRIBOUT
</p>
<p>1998). Ces m&#233;thodes s&#8217;av&#232;rent efficaces pour les langues &#224; morphologie moins riche comme l&#8217;anglais, mais ne
sont pas disponibles pour toutes les langues (McNamee et al., 2009). La plupart du temps l&#8217;utilisation de ces
m&#233;thodes permet d&#8217;augmenter l&#233;g&#232;rement le rappel, mais ces techniques g&#233;n&#232;rent &#233;galement du bruit. Bilotti et al.
(2004) ont par exemple montr&#233; que des mots relativement &#233;loign&#233;s comme organisation et organ sont r&#233;duits &#224;
la m&#234;me racine par l&#8217;algorithme de d&#233;suffixation de Porter. Moreau &amp; Claveau (2006) ont quant &#224; eux utilis&#233; une
m&#233;thode d&#8217;acquisition automatique de connaissances morphologiques par apprentissage, et leur &#233;tude a montr&#233;
que l&#8217;utilisation des connaissances morphologiques pour &#233;tendre les requ&#234;tes am&#233;liore les r&#233;sultats pour la plupart
des langues europ&#233;ennes qu&#8217;ils ont test&#233;es.
</p>
<p>Dans chacune des &#233;tudes pr&#233;c&#233;dentes, les mots de la question sont &#233;tendus &#224; l&#8217;ensemble des mots appartenant &#224;
la m&#234;me famille morphologique, et les diff&#233;rents types de proc&#233;d&#233;s (tels que la formation d&#8217;un nom d&#233;verbal ou
la formation d&#8217;un nom d&#233;sadjectival) ne sont pas distingu&#233;s. Ainsi, tous les mots appartenant &#224; la m&#234;me famille
morphologique sont consid&#233;r&#233;s comme s&#233;mantiquement proches. Or, nous pensons que tous les mots morpho-
logiquement reli&#233;s n&#8217;ont pas la m&#234;me proximit&#233; s&#233;mantique et que certaines relations morphologiques sont plus
pertinentes que d&#8217;autres dans le cadre de QR. Par exemple dans ce type de t&#226;che, il nous semble plus pertinent
d&#8217;&#233;tendre une requ&#234;te contenant le verbe diviser au nom d&#8217;&#233;v&#233;nement d&#233;riv&#233; division, plut&#244;t qu&#8217;&#224; l&#8217;adjectif d&#233;riv&#233;
divisible. Cependant, &#224; notre connaissance, aucune &#233;tude qualitative ni quantitative n&#8217;a &#233;t&#233; men&#233;e en ce sens, afin
de d&#233;terminer quels types de relations morphologiques sont pertinents pour la recherche en QR.
</p>
<p>Au del&#224; de l&#8217;extension de requ&#234;te, la morphologie trouve &#233;galement sa place dans les m&#233;thodes de reformulation
automatique des questions, qui visent &#224; traiter des ph&#233;nom&#232;nes de paraphrase entre question et r&#233;ponse. Ainsi Ra-
vichandran &amp; Hovy (2002) proposent une m&#233;thode d&#8217;acquisition de patrons de reformulation de surface pour des
types pr&#233;cis de questions. Ces patrons incluent entre autres des mots morphologiquement reli&#233;s tels que discover,
discovery et discoverer, dans le cas d&#8217;une question portant sur la personne ayant fait une d&#233;couverte donn&#233;e. Ces
patrons sont ensuite utilis&#233;s pour extraire la r&#233;ponse. Une approche similaire est propos&#233;e par Lin &amp; Pantel (2001)
et Hermjakob et al. (2002). Ces travaux ne se focalisent toutefois pas sur la morphologie et ne proposent donc pas
d&#8217;&#233;valuation sp&#233;cifique. Seul Jacquemin (2010) &#233;value l&#8217;apport de la mophologie dans ce contexte en utilisant le
lexique des verbes fran&#231;ais de Dubois &amp; Dubois-Charlier (1997) et les relations de d&#233;rivation qu&#8217;il contient pour
automatiquement reformuler des &#233;nonc&#233;s, sur la base des relations de d&#233;pendance syntaxique.
</p>
<p>Dans cet article, nous pr&#233;sentons les r&#233;sultats d&#8217;une &#233;valuation portant sur la pertinence des connaissances mor-
phologiques dans un syst&#232;me de QR. Ces r&#233;sultats permettent d&#8217;une part de d&#233;terminer quels types de ressources
morphologiques sont n&#233;cessaires &#224; l&#8217;am&#233;lioration des syst&#232;mes de QR, et d&#8217;autre part d&#8217;&#233;valuer la couverture des
ressources existantes pour une telle t&#226;che.
</p>
<p>Pour &#233;valuer la pertinence des connaissances morphologiques dans un syst&#232;me de QR, nous avons tout d&#8217;abord
constitu&#233; un corpus de paires question-passage contenant la r&#233;ponse &#224; partir de trois collections de donn&#233;es issues
de campagnes d&#8217;&#233;valuation en QR. Nous avons ensuite annot&#233; ce corpus afin de d&#233;terminer quelles sont les rela-
tions morphologiques les plus fr&#233;quentes qui relient les mots de la question et les mots du passage. Enfin, nous
avons analys&#233; les r&#233;sultats de cette annotation et &#233;valu&#233; la couverture des ressources existantes en fran&#231;ais pour
les proc&#233;d&#233;s morphologiques observ&#233;s 1.
</p>
<p>2 Constitution et annotation d&#8217;un corpus de paires question-passage r&#233;ponse
</p>
<p>2.1 Corpus de questions-passages
</p>
<p>Nous avons constitu&#233; notre corpus de paires question-passage r&#233;ponse &#224; partir de trois collections de donn&#233;es
utilis&#233;es pour l&#8217;&#233;valuation de syst&#232;mes QR : Qu&#230;ro, EQueR et Conique. Ces trois collections et le corpus qu&#8217;elles
nous ont permis de constituer sont d&#233;crits ci-dessous. La table 1 pr&#233;sente les statistiques concernant ces trois
collections.
</p>
<p>1. Cet article pr&#233;sente les r&#233;sultats de l&#8217;&#233;valuation uniquement pour des ressources morphologiques. Les m&#234;mes donn&#233;es de r&#233;f&#233;rence ont
&#233;t&#233; utilis&#233;es pour &#233;valuer des outils d&#8217;analyse morphologique (Bernhard et al., &#224; para&#238;tre)</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUER LA PERTINENCE DE LA MORPHOLOGIE DANS LES SYST&#200;MES DE QUESTION-R&#201;PONSE
</p>
<p>Qu&#230;ro EQueR-Medical Conique
#Questions 350 200 201
#paires de question-passage 566 394 664
Longueur moyenne de la question 8,8 9,9 11,4
Longueur moyenne du passage r&#233;ponse 38,5 29,0 92,4
</p>
<p>TABLE 1 &#8211; Statistiques sur les sous-corpus de questions-r&#233;ponses utilis&#233;s
</p>
<p>2.1.1 Qu&#230;ro
</p>
<p>Le corpus fran&#231;ais Qu&#230;ro a &#233;t&#233; constitu&#233; dans le cadre du projet Qu&#230;ro avec pour objectif d&#8217;&#233;valuer des syst&#232;mes
de QR (Quintard et al., 2010). Le corpus de documents contient 2,5 millions de documents en fran&#231;ais extraits
de l&#8217;Internet et 757 questions, dont 250 pour la campagne de 2008 et 507 pour celle de 2009. La collection de
documents a &#233;t&#233; constitu&#233;e en prenant les 100 premi&#232;res pages retourn&#233;es par le moteur de recherche Exalead pour
une s&#233;rie de requ&#234;tes trouv&#233;es dans les logs du moteur. Quant aux questions, elles ont &#233;t&#233; r&#233;dig&#233;es par des franco-
phones, sur la base du contenu des documents pour la campagne 2008, et sur la base du log uniquement pour la
campagne de 2009. Trois types de questions ont &#233;t&#233; formul&#233;es : des questions factuelles, des questions bool&#233;ennes
attendant une r&#233;ponse de type oui/non, et des questions de type liste. Pour notre t&#226;che d&#8217;annotation, nous avons
constitu&#233; des paires question-passage, form&#233;es de l&#8217;ensemble des questions factuelles et des passages contenant la
r&#233;ponse qui ont &#233;t&#233; fournis par les syst&#232;mes et valid&#233;s manuellement lors des deux campagnes d&#8217;&#233;valuation 2008
et 2009. Nous avons ainsi obtenu 566 paires de questions-passages contenant la r&#233;ponse, 338 pour la campagne
2008 et 228 pour la campagne 2009.
</p>
<p>2.1.2 EQueR-Medical
</p>
<p>Les donn&#233;es du corpus EQueR ont &#233;t&#233; constitu&#233;es dans le cadre de la campagne d&#8217;&#233;valuation EQueR-EVALDA
pour les syst&#232;mes de question-r&#233;ponse du fran&#231;ais (Ayache et al., 2006). La campagne comprenait deux t&#226;ches
principales : (i) question-r&#233;ponse g&#233;n&#233;rale sur une collection d&#8217;articles de journaux et de rapports s&#233;natoriaux
et (ii) question-r&#233;ponse sp&#233;cialis&#233;e sur une collection de textes m&#233;dicaux. Pour ces deux t&#226;ches, les passages
contenant les r&#233;ponses retourn&#233;es par les syst&#232;mes participants ont &#233;t&#233; valid&#233;s manuellement par des sp&#233;cialistes
du domaine. Pour notre &#233;tude, seule la partie m&#233;dicale a &#233;t&#233; retenue, constituant ainsi un ensemble de 394 paires
de questions-passages, pour un total de 200 questions distinctes.
</p>
<p>2.1.3 Conique
</p>
<p>Le corpus Conique a &#233;t&#233; constitu&#233; dans le but d&#8217;&#233;tudier les justifications pertinentes pour les r&#233;ponses des sys-
t&#232;mes de QR (Grappy et al., 2010). Les justifications des r&#233;ponses fournissent un mat&#233;riel suppl&#233;mentaire pour
l&#8217;utilisateur, afin qu&#8217;il ou elle puisse faire confiance &#224; la r&#233;ponse fournie par le syst&#232;me. Le corpus est bas&#233; sur un
sous-ensemble de 291 questions de la campagne EQueR pour le fran&#231;ais (Ayache et al., 2006) et de plusieurs cam-
pagne CLEF. Les passages-r&#233;ponses candidats ont &#233;t&#233; extraits de la version fran&#231;aise de Wikipedia &#224; l&#8217;aide d&#8217;un
syst&#232;me de RI et ont ensuite &#233;t&#233; annot&#233;s par 7 annotateurs. Contrairement aux deux corpus d&#233;crits pr&#233;c&#233;demment,
les passages-r&#233;ponses de Conique ne correspondent pas &#224; une sortie d&#8217;un syst&#232;me de QR. Le corpus poss&#232;de donc
un taux de rappel extr&#234;mement haut, et est exempt de tout biais inh&#233;rent aux syst&#232;mes de QR, comme les taux
importants de mots identiques entre les questions et le passage. Nous avons pr&#233;-trait&#233; ce corpus, pour ne conserver
que les justifications compl&#232;tes ou partielles. De plus, nous avons r&#233;duit le passage &#224; une longueur de trois phrases.
Au total, le corpus constitu&#233; &#224; partir de la collection Conique contient 664 paires de question-passage, pour 201
questions distinctes.
</p>
<p>2.2 Annotation
</p>
<p>Pour chaque paire question-passage r&#233;ponse, nous avons manuellement annot&#233; les mots de la question et les
mots du passage afin de d&#233;terminer quels mots sont morphologiquement reli&#233;s et par quels types de relations.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, BRUNO CARTONI, DELPHINE TRIBOUT
</p>
<p>Les annotations ont &#233;t&#233; effectu&#233;es par trois annotateurs ind&#233;pendants 2 au moyen de l&#8217;outil d&#8217;alignement YAWAT
(Germann, 2008). Cet outil a &#233;t&#233; initialement con&#231;u pour aligner les mots de paires de phrases bilingues pour des
campagnes d&#8217;&#233;valuation de traduction automatique. Dans cette &#233;tude, nous l&#8217;avons utilis&#233; pour aligner les mots
(ou groupes de mots) dans des paires question-passage r&#233;ponse, et pour assigner &#224; ces paires de mots une &#233;tiquette,
parmi les trois types de relations morphologiques suivantes : flexion, d&#233;rivation, composition. Les figures 1 &#224; 3
pr&#233;sentent des exemples de paires question-passage impliquant respectivement des relations de flexion, d&#233;rivation
et composition.
</p>
<p>Q : Quand est n&#233; Philippe d&#8217;Orl&#233;ans ?
R : Philippe d&#8217;Orl&#233;ans naquit le 2 ao&#251;t 1674.
</p>
<p>Q : Comment un insuffisant r&#233;nal doit-il &#234;tre suivi ?
R : Du fait du risque de transmission nosocomiale du VHC chez les insuffisants r&#233;naux h&#233;modialys&#233;s
et chez les transplant&#233;s r&#233;naux, une surveillance annuelle de la s&#233;rologie doit &#234;tre r&#233;alis&#233;e.
</p>
<p>Q : &#192; combien de milliards de dollars s&#8217;&#233;l&#232;ve le d&#233;ficit budg&#233;taire am&#233;ricain ?
R : Politique budg&#233;taire. Le PIB des &#201;tats-Unis s&#8217;&#233;l&#232;ve &#224; environ 10 000 milliards de dollars et les
d&#233;ficits atteindraient au moins 300 ou 400 milliards de dollars en 2003
</p>
<p>FIGURE 1 &#8211; Exemples de paires question-passage impliquant une relation de flexion
</p>
<p>Q : En quelle ann&#233;e Martin Luther King a-t-il &#233;t&#233; assassin&#233; ?
R : Il dit avoir &#233;t&#233; &#224; c&#244;t&#233; du pasteur King &#224; Memphis lors de son assassinat, le 4 avril 1968. Il est
ordonn&#233; ministre baptiste &#224; la fin de cette m&#234;me ann&#233;e.
</p>
<p>Q : Quels sont les quatre r&#233;alisateurs du film &quot;Le jour le plus long&quot; ?
R : Le Jour le plus long (The Longest Day) est un film am&#233;ricain r&#233;alis&#233; par Ken Annakin, Andrew
Marton, Bernhard Wicki et Gerd Oswald sorti en salle en 1962...
</p>
<p>Q : La pose d&#8217;amalgame dentaire peut-elle provoquer des allergies ?
R : Il est certain que la pose d&#8217;amalgames peut entra&#238;ner des r&#233;actions allergiques plus ou moins
graves et prononc&#233;es chez les patients.
</p>
<p>FIGURE 2 &#8211; Exemples de paires question-passage impliquant une relation de d&#233;rivation
</p>
<p>Q : O&#249; Marcos fut-il dictateur ?
R : Imelda Marcos, le 22 f&#233;vrier 2006. Imelda Romualdez Marcos (n&#233;e le 2 juillet 1929) fut la femme
de Ferdinand Marcos, pr&#233;sident-dictateur des Philippines de 1965 &#224; 1986.
</p>
<p>Q : Le mercure est-il un m&#233;tal toxique ?
R : En grande concentration ou lorsque l&#8217;exposition est prolong&#233;e, le mercure a des effets neuro-
toxiques connus, principalement dans sa forme organique, soit le m&#233;thylmercure
</p>
<p>Q : Qu&#8217;engendre la corticoth&#233;rapie sur l&#8217;os ?
R : Les fractures de l&#8217;ost&#233;oporose cortisonique surviennent au moins en partie en raison d&#8217;une perte
osseuse induite par la corticoth&#233;rapie
</p>
<p>FIGURE 3 &#8211; Exemples de paires question-passage impliquant une relation de composition
</p>
<p>&#201;tant donn&#233; que deux mots morphologiquement li&#233;s peuvent &#234;tre reli&#233;s par plus d&#8217;une relation, des instructions
sp&#233;cifiques ont &#233;galement &#233;t&#233; d&#233;finies. Ainsi, nous n&#8217;avons pas annot&#233; les variantes flexionnelles des auxiliaires et
des d&#233;terminants, dans la mesure o&#249; ils sont tr&#232;s fr&#233;quents et apportent donc peu d&#8217;information s&#233;mantique. Nous
</p>
<p>2. Co-auteurs de cet article.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUER LA PERTINENCE DE LA MORPHOLOGIE DANS LES SYST&#200;MES DE QUESTION-R&#201;PONSE
</p>
<p>avons &#233;galement d&#233;cid&#233; de donner la priorit&#233; aux relations de d&#233;rivation et de composition sur les relations flexion-
nelles. Par exemple, dans la paire de question-passage pr&#233;sent&#233;e &#224; la Figure 4, il y a deux &#233;tapes morphologiques
entre le nom Australie dans la question et l&#8217;adjectif f&#233;minin australienne dans la r&#233;ponse : la premi&#232;re &#233;tape est la
d&#233;rivation de l&#8217;adjectif australien &#224; partir du nom propre ; la seconde est la flexion de l&#8217;adjectif d&#233;riv&#233; au f&#233;minin.
Dans ce cas, la relation morphologique la plus pertinente est la relation d&#233;rivationnelle entre le nom propre et l&#8217;ad-
jectif, c&#8217;est pourquoi dans un tel cas seule la relation d&#233;rivationnelle a &#233;t&#233; annot&#233;e. Enfin, une &#233;tiquette sp&#233;cifique
&#8220;autre&#8221; a &#233;t&#233; utilis&#233;e pour annoter des mots qui ne sont par directement reli&#233;s morphologiquement, mais qui sont
le r&#233;sultat de deux constructions &#224; partir de la m&#234;me base. Par exemple dans la paire pr&#233;sent&#233;e &#224; la Figure 5 le
nom utilit&#233; et le verbe utiliser (sous la forme passive est utilis&#233;e) ne d&#233;rivent pas l&#8217;un de l&#8217;autre, mais sont tous
deux d&#233;riv&#233;s de l&#8217;adjectif utile.
</p>
<p>Q : Quelle est la capitale de l&#8217;Australie ?
R : le territoire sur lequel est situ&#233;e la capitale f&#233;d&#233;rale australienne, Canberra .
</p>
<p>FIGURE 4 &#8211; Exemple de paires question-passage o&#249; deux types de relation sont pr&#233;sentes (flexion et d&#233;rivation)
</p>
<p>Q : Quelle est l&#8217;utilit&#233; de la pierre d&#8217;alun ?
R : La pierre d&#8217;alun est un excellent d&#233;odorant corporel. Elle est utilis&#233;e pour neutraliser la transpi-
ration, emp&#234;cher la fermentation et &#233;liminer les mauvaises odeurs.
</p>
<p>FIGURE 5 &#8211; Exemple de paires question-passage o&#249; la relation morphologique implique deux constructions diff&#233;-
rentes &#224; partir de la m&#234;me base
</p>
<p>Nous avons mesur&#233; la qualit&#233; des annotations &#224; l&#8217;aide du coefficient kappa de Fleiss (Fleiss, 1971) 3. Le coefficient
&#954; varie en fonction du corpus et du type de relation consid&#233;r&#233; : il est fort (0,674) &#224; presque parfait (0,83) pour la
flexion, bon pour la d&#233;rivation (0,662 &#224; 0,729) et faible (0,39) &#224; bon (0,665) pour la composition.
</p>
<p>Tous les d&#233;saccords ont &#233;t&#233; r&#233;solus et les donn&#233;es valid&#233;es par l&#8217;ensemble des annotateurs afin de constituer
un corpus de r&#233;f&#233;rence. Nous avons ensuite class&#233; et caract&#233;ris&#233; les paires de mots que nous avions consid&#233;r&#233;s
comme morphologiquement reli&#233;s lors de l&#8217;annotation. Les r&#233;sultats de cette analyse sont pr&#233;sent&#233;s dans la section
suivante et fournissent un panorama des relations morphologiques mises en jeu dans le cadre de Question-R&#233;ponse.
</p>
<p>3 Analyse des r&#233;sultats
</p>
<p>Au terme de l&#8217;annotation, nous avons obtenu un ensemble de mots morphologiquement reli&#233;s jouant un r&#244;le dans
le lien op&#233;r&#233; entre la question et le passage contenant la r&#233;ponse. Plusieurs observations peuvent &#234;tre faites suivant
diff&#233;rents points de vue. Nous pr&#233;sentons tout d&#8217;abord la r&#233;partition des diff&#233;rentes relations morphologiques
observ&#233;es (flexion, d&#233;rivation et composition). Puis nous d&#233;crivons pr&#233;cis&#233;ment les proc&#233;d&#233;s de d&#233;rivation et de
composition les plus fr&#233;quemment observ&#233;s. Enfin, nous &#233;tudions la position du mot construit dans la paire et en
particulier s&#8217;il se trouve dans la question ou dans le passage r&#233;ponse.
</p>
<p>3.1 Types de relations morphologiques
</p>
<p>Les r&#233;sultats de l&#8217;annotation de chaque sous-corpus en fonction des diff&#233;rents types de relations morphologiques
sont pr&#233;sent&#233;s dans la table 2 4. Ces chiffres montrent que chaque sous-corpus semble favoriser un type particulier
de relation morphologique : le sous-corpus Conique contient un majorit&#233; de relations de d&#233;rivation, le sous-corpus
Qu&#230;ro contient davantage de flexion, alors que pour le sous-corpus EQueR, c&#8217;est la composition qui semble la
plus fr&#233;quente. De plus, si l&#8217;on &#233;tudie les relations morphologiques en fonction des sous-corpus, on constate que
la composition est quasiment absente des sous-corpus Qu&#230;ro et Conique.
</p>
<p>3. Le kappa de Fleiss permet de mesurer l&#8217;accord inter-annotateurs lorsqu&#8217;il y a plus de deux annotateurs. Il a &#233;t&#233; calcul&#233; en fonction de
l&#8217;accord des annotateurs sur la pr&#233;sence d&#8217;une paire de mots morphologiquement reli&#233;s pour une m&#234;me paire de questions-r&#233;ponse
</p>
<p>4. Les paires de question-passage (paire qp) ne contiennent pas toujours des relations morphologiques, et certaines paires peuvent contenir
plus d&#8217;une relation morphologique, impliquant parfois les m&#234;mes mots.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, BRUNO CARTONI, DELPHINE TRIBOUT
</p>
<p>Flexion D&#233;rivation Composition
Corpus (paire qp) nbr % nbr % nbr %
Conique (664) 159 41,8 188 49,5 33 8,7
Qu&#230;ro (566) 136 61,8 80 36,4 4 1,8
EQueR (394) 69 26,5 81 31,0 111 42,5
</p>
<p>TABLE 2 &#8211; Flexion, d&#233;rivation et composition dans les trois sous-corpus
</p>
<p>Il est notable que le sous-corpus Conique contient plus de relations de d&#233;rivation que le sous-corpus Qu&#230;ro. Ceci
est li&#233; &#224; la mani&#232;re dont le corpus Conique a &#233;t&#233; construit. En effet, il n&#8217;a pas &#233;t&#233; constitu&#233; &#224; partir des r&#233;ponses
fournies par un syst&#232;me de QR, mais sur la base de r&#233;ponses identifi&#233;es et annot&#233;es manuellement. De plus, Co-
nique contient en moyenne les passages les plus longs (c.f. table 1), ce qui peut expliquer la pr&#233;sence d&#8217;un nombre
plus important de paires d&#233;rivationnelles dans ce sous-corpus. Quant &#224; EQueR, la proportion importante de mots
compos&#233;s est li&#233;e au domaine de sp&#233;cialit&#233; du sous-corpus qui contient un grand nombre de termes m&#233;dicaux,
ceux-ci &#233;tant souvent compos&#233;s, comme le montre la figure 6.
</p>
<p>Q : Quelle est la cons&#233;quence de la corticoth&#233;rapie sur l&#8217;os ?
R : Le probl&#232;me essentiel des cortico&#239;des r&#233;side dans leurs effets secondaires (... ost&#233;oporose,
ost&#233;on&#233;crose aseptique des t&#234;tes f&#233;morales ou parfois hum&#233;rales ...).
</p>
<p>FIGURE 6 &#8211; Exemple de paire de question-passage de EQueR
</p>
<p>Il est &#233;galement int&#233;ressant de noter le r&#244;le important de la d&#233;rivation dans les trois sous-corpus (entre 31 % et
49 %), et l&#8217;importance de la composition dans le domaine m&#233;dical (42,5% dans EQueR). Ceci confirme l&#8217;int&#233;r&#234;t
d&#8217;inclure des connaissances morphologiques de ce type dans un syst&#232;me de QR.
</p>
<p>Dans la suite, nous d&#233;crivons plus pr&#233;cis&#233;ment ces deux types de construction, en analysant quels proc&#233;d&#233;s mor-
phologiques sont les plus pr&#233;sents. Nous ne nous attardons pas sur la morphologie flexionnelle dans le cadre de cet
article car elle est consid&#233;r&#233;e comme pertinente par les syst&#232;mes de QR existants. De plus, elle est g&#233;n&#233;ralement
bien prise en compte par les syst&#232;mes de QR existant, notamment via l&#8217;utilisation de lemmatiseurs.
</p>
<p>3.2 D&#233;rivation
</p>
<p>Comme nous venons de le montrer (table 2), la d&#233;rivation joue un r&#244;le important dans les trois sous-corpus. Dans
certain cas, la relation morphologique entre le mot de la question et le mot du passage-r&#233;ponse implique plus
d&#8217;une &#233;tape d&#233;rivationnelle : soit l&#8217;un des mots est plus complexe que l&#8217;autre, mais n&#8217;est pas un d&#233;riv&#233; direct (par
exemple, lune et alunissage, ce dernier d&#233;rivant du verbe alunir, lui-m&#234;me d&#233;riv&#233; de lune) ; soit les deux mots sont
complexes et sont tous deux d&#233;riv&#233;s d&#8217;un m&#234;me mot (par exemple joueur et jouable tous deux d&#233;riv&#233;s du verbe
jouer). Le premier cas de figure repr&#233;sente 1,70% des relations observ&#233;es et le second 8,30%, ce qui repr&#233;sente
une proportion assez faible et indique que dans la grande majorit&#233; des cas les mots morphologiquement reli&#233;s
entretiennent une relation de d&#233;rivation directe.
</p>
<p>Les relations non directes impliquent une pr&#233;dictibilit&#233; moindre, et influencent le choix des m&#233;thodes d&#8217;impl&#233;-
mentation, comme nous l&#8217;expliquons dans la section 3.4. Dans un premier temps nous &#233;tudions donc uniquement
les paires de mots morphologiquement reli&#233;s par une d&#233;rivation directe.
</p>
<p>La table 3, qui pr&#233;sente la proportion des diff&#233;rents types de proc&#233;d&#233;s morphologiques observ&#233;s, montre que les
sous-corpus diff&#232;rent selon les proc&#233;d&#233;s de d&#233;rivation majoritairement utilis&#233;s. Si Conique contient une majorit&#233;
d&#8217;adjectifs d&#233;nominaux (environ 47% des proc&#233;d&#233;s de d&#233;rivation), Qu&#230;ro et EQueR montrent une pr&#233;f&#233;rence pour
des proc&#233;d&#233;s de nominalisation (avec respectivement 61% et 54% des proc&#233;d&#233;s de d&#233;rivation).</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUER LA PERTINENCE DE LA MORPHOLOGIE DANS LES SYST&#200;MES DE QUESTION-R&#201;PONSE
</p>
<p>Exemple Conique (174) Qu&#230;ro (70) EQueR (70)
nbr % nbr % nbr %
</p>
<p>Nom &gt; Adj commerce &gt; commercial 37 21 16 23 28 40
Nom propre&gt; Adj Afrique &gt; africain 45 26 8 11,5 1 1
Nom &gt; Nom pr&#233;sident &gt; pr&#233;sidente 29 17 5 7 2 3
Nom propre &gt; N Arm&#233;nie &gt; Arm&#233;niens 6 3 8 11,5 2 3
Adj &gt; Nom national &gt; nationalit&#233; 3 2 0 0 9 13
Verbe &gt; Nom traiter &gt; traitement 41 24 30 43 25 36
Autres complet &gt; compl&#232;tement 13 7 3 4 3 4
</p>
<p>TABLE 3 &#8211; Proc&#233;d&#233;s d&#233;rivationnels dans les paires de question-passage
</p>
<p>3.2.1 Adjectifs d&#233;nominaux
</p>
<p>Dans les trois sous-corpus, les adjectifs d&#233;riv&#233;s d&#8217;un nom propre sont toujours des adjectifs relationnels, qui
peuvent &#234;tre remplac&#233;s par un compl&#233;ment du nom &#233;quivalent, comme chilien d&#233;riv&#233; de Chili ou africain d&#233;riv&#233;
de Afrique. Les adjectifs d&#233;riv&#233;s d&#8217;un nom commun sont la plupart du temps relationnels, comme le montrent les
chiffres de la table 4. Par exemple, commercial d&#233;riv&#233; de commerce ou solaire d&#233;riv&#233; de soleil. Cependant, on
trouve &#233;galement quelques adjectifs qualificatifs comme &#226;g&#233; d&#233;riv&#233; de &#226;ge ou montagneux d&#233;riv&#233; de montagne.
La table 4 pr&#233;sente les proportions d&#8217;adjectifs relationnels et qualificatifs dans notre corpus, et montre que ce sont
les adjectifs relationnels qui sont les plus fr&#233;quents dans les trois sous-corpus.
</p>
<p>Adj. relationel Adj. qualificatif
nbr % nbr %
</p>
<p>Conique (37) 23 62 14 38
Qu&#230;ro (16) 10 62 6 38
EQueR (28) 24 86 4 14
Total (81) 57 70 24 30
</p>
<p>TABLE 4 &#8211; Types d&#8217;adjectifs d&#233;nominaux
</p>
<p>3.2.2 Proc&#233;d&#233;s de formation des noms
</p>
<p>En ce qui concerne les proc&#233;d&#233;s de formation de noms, on trouve dans les trois sous-corpus un grand nombre
de nominalisations d&#233;verbales, ainsi que quelques cas de nominalisations d&#233;sadjectivales ou d&#233;nominales. La
formation de noms sur des bases nominales est relativement rare, sauf dans Conique qui contient plusieurs noms de
profession f&#233;minis&#233;s, comme infirmier et infirmi&#232;re, directeur et directrice, pr&#233;sident et pr&#233;sidente, que nous avons
consid&#233;r&#233;s comme d&#233;riv&#233;s l&#8217;un de l&#8217;autre et non comme deux formes fl&#233;chies du m&#234;me mot. Nous avons &#233;galement
trouv&#233; quelques noms diminutifs, comme rame&gt; ramette et quelques pr&#233;fix&#233;s comme pr&#233;sident &gt; vice-pr&#233;sident.
Nous avons aussi consid&#233;r&#233; les formations de noms &#224; partir de noms propres comme des nominalisations. Ces
noms d&#233;riv&#233;s sont principalement des gentil&#233;s comme Colombien d&#233;riv&#233; de Colombie.
</p>
<p>Les noms d&#233;sadjectivaux sont rares dans les trois sous-corpus, voire inexistants dans le cas de Qu&#230;ro. Ces noms
d&#233;sadjectivaux sont principalement des noms de propri&#233;t&#233;, comme toxicit&#233; construit sur toxique. La plupart des
noms d&#233;sadjectivaux se trouvent dans le corpus EQueR. Cela s&#8217;explique par le fait que le corpus m&#233;dical contient
beaucoup de noms de maladie ou de pathologie (comme toxicit&#233; ou insuffisance), or ces noms r&#233;f&#232;rent la plupart
du temps &#224; la propri&#233;t&#233; de se trouver dans un &#233;tat particulier (toxicit&#233; &#8776; &#8216;propri&#233;t&#233; d&#8217;&#234;tre toxique&#8217;, insuffisance &#8776;
&#8216;propri&#233;t&#233; d&#8217;&#234;tre insuffisant&#8217;).
</p>
<p>Quant aux noms d&#233;verbaux, qui sont les plus fr&#233;quents, ce sont essentiellement des noms d&#8217;&#233;v&#233;nements, comme
d&#233;barquement d&#233;riv&#233; du verbe d&#233;barquer. Les noms d&#8217;&#233;v&#233;nements repr&#233;sentent presque 85% des noms d&#233;verbaux,
comme le montre la table 5. Cependant, on trouve &#233;galement un petit nombre de noms d&#8217;agents dans les sous-
corpus Conique et Qu&#230;ro, comme r&#233;alisateur construit sur r&#233;aliser, et quelques cas de noms r&#233;sultatifs comme
produit d&#233;riv&#233; de produire.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, BRUNO CARTONI, DELPHINE TRIBOUT
</p>
<p>Exemple Conique (41) Qu&#230;ro (30) EQueR (25)
nbr % nbr % nbr %
</p>
<p>Verbe &gt; N &#233;v&#233;nement inaugurer &gt; inauguration 34 83 25 83 22 88
Verbe &gt; N agent r&#233;aliser &gt; r&#233;alisateur 4 10 4 13 0 0
Verbe &gt; N autre produire &gt; produit 3 7 1 4 3 12
</p>
<p>TABLE 5 &#8211; Types s&#233;mantiques des noms d&#233;verbaux dans les paires de questions-passage
</p>
<p>3.2.3 Autres proc&#233;d&#233;s de formation
</p>
<p>Parmi les autres proc&#233;d&#233;s de formation observ&#233;s dans le corpus, on trouve des formations d&#8217;adverbes, comme
compl&#232;tement d&#233;riv&#233; de complet ou directement construit sur direct, ainsi qu&#8217;un certain nombre de verbes pr&#233;fix&#233;s,
comme d&#233;boucher, ou d&#8217;adjectifs pr&#233;fix&#233;s, comme international. Il est &#233;galement int&#233;ressant de noter que nous
n&#8217;avons observ&#233; aucun verbe d&#233;sadjectival (comme national &gt; nationaliser) et tr&#232;s peu de verbes d&#233;nominaux
(quatre cas seulement dans le sous-corpus Conique, dont trois sont des verbes convertis : border, fusionner et
suicider). La quasi-absence de verbes d&#233;nominaux peut s&#8217;expliquer par la faible pr&#233;dictibilit&#233; du sens d&#8217;un verbe
d&#233;nominal. Comme l&#8217;ont d&#233;crit Hopper &amp; Thompson (1984), il existe une asym&#233;trie entre les cat&#233;gories lexicales,
dans la mesure o&#249; un nom d&#233;verbal continue de r&#233;f&#233;rer &#224; l&#8217;&#233;v&#233;nement d&#233;not&#233; par le verbe base, alors qu&#8217;un verbe
d&#233;nominal ne r&#233;f&#232;re pas &#224; l&#8217;entit&#233; d&#233;not&#233;e par le nom base, mais d&#233;note un &#233;v&#233;nement associ&#233; &#224; cette entit&#233;. Or,
les &#233;v&#233;nements associ&#233;s &#224; une entit&#233; peuvent &#234;tre nombreux et vari&#233;s. Par exemple, le nom destruction d&#233;note le
m&#234;me &#233;v&#233;nement que sa base verbale d&#233;truire, alors qu&#8217;un verbe d&#233;nominal comme hospitaliser ne r&#233;f&#232;re pas &#224;
l&#8217;objet d&#233;not&#233; par la base nominale (h&#244;pital), mais &#224; l&#8217;un des &#233;v&#233;nements li&#233;s &#224; cet objet. Ainsi, dans le cadre d&#8217;un
syst&#232;me de QR, la relation s&#233;mantique entre un nom et son verbe d&#233;riv&#233; est moins informative que la relation entre
un verbe et son nom d&#233;riv&#233;.
</p>
<p>3.3 Composition
</p>
<p>En ce qui concerne la composition, comme nous l&#8217;avons vu dans la section 3.1 et la table 2, elle est surtout pr&#233;sente
dans les sous-corpus EQueR et Conique, mais quasiment absente du sous-corpus Qu&#230;ro. Dans notre analyse de
la composition nous avons distingu&#233; les paires de question-passage contenant un compos&#233; et au moins l&#8217;un de
ses constituants (comme dans filmographie compos&#233; de film), des paires contenant deux compos&#233;s qui partagent
un m&#234;me constituant (comme a&#233;ronautique et a&#233;roport partageant le constituant a&#233;ro). La table 6 pr&#233;sente les
r&#233;sultats de cette classification, et montre que le second cas (deux compos&#233;s partageant un constituant) est avant
tout pr&#233;sent dans le corpus sp&#233;cialis&#233;.
</p>
<p>compos&#233;-constituant(s) 2 compos&#233;s
nbr % nbr %
</p>
<p>Conique (33) 26 79 7 21
Qu&#230;ro (4) 4 100 0 0
EQueR (111) 70 63 41 37
</p>
<p>TABLE 6 &#8211; Types de relations de composition
</p>
<p>3.4 Conclusion sur les relations morphologiques observ&#233;es dans les trois sous-corpus
</p>
<p>Comme le montre l&#8217;analyse des r&#233;sultats de notre annotation, la morphologie joue un r&#244;le important pour &#233;tablir
le lien de similarit&#233; entre question et passage-r&#233;ponse. D&#8217;apr&#232;s notre &#233;tude qualitative des relations morpholo-
giques observ&#233;es, la flexion est loin d&#8217;&#234;tre la seule connaissance morphologique pr&#233;sente dans notre corpus, et
la d&#233;rivation, tout comme la composition, jouent un r&#244;le important. Notons &#233;galement que les types de proc&#233;d&#233;s
morphologiques employ&#233;s sont tr&#232;s similaires dans les corpus de langue g&#233;n&#233;rale, alors que la langue de sp&#233;cialit&#233;
&#8211; EQueR, corpus m&#233;dical &#8211; montre des tendances nettement diff&#233;rentes.
</p>
<p>Nous avons &#233;galement &#233;tudi&#233; la position privil&#233;gi&#233;e du mot le plus complexe morphologiquement, afin se savoir
s&#8217;il se trouve plut&#244;t dans la question ou dans le passage r&#233;ponse. La pr&#233;dominance de l&#8217;une ou l&#8217;autre position</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUER LA PERTINENCE DE LA MORPHOLOGIE DANS LES SYST&#200;MES DE QUESTION-R&#201;PONSE
</p>
<p>joue un r&#244;le essentiel dans la mani&#232;re de g&#233;rer la morphologie dans les syst&#232;mes de QR. Pour les paires impliquant
une relation de d&#233;rivation, le mot complexe se trouve majoritairement dans le passage r&#233;ponse (52% des cas dans
EQueR, 59% dans Qu&#230;ro et 65% dans Conique). Ce r&#233;sultat confirme l&#8217;int&#233;r&#234;t de l&#8217;expansion de requ&#234;te aux mots
d&#233;riv&#233;s des mots de la question.
</p>
<p>De plus, le nombre important de relations de composition o&#249; les deux membres de la paire sont des compos&#233;s
partageant un m&#234;me constituant (37% dans EQueR et 21% dans Conique) pointe les limites de l&#8217;apport de la
morphologie dans de tels syst&#232;mes, &#233;tant donn&#233; qu&#8217;il est difficilement envisageable de vouloir g&#233;n&#233;rer tous les
mots compos&#233;s &#224; partir d&#8217;un &#233;l&#233;ment de la question.
</p>
<p>Dans la suite de cet article, nous utilisons les r&#233;sultats de l&#8217;annotation comme gold-standard (ensemble de r&#233;f&#233;-
rence) pour &#233;valuer les ressources morphologiques existantes en fran&#231;ais. Cette &#233;valuation permet donc implicite-
ment de conna&#238;tre l&#8217;impact de telles ressources si elles &#233;taient int&#233;gr&#233;es dans un syst&#232;me de QR. &#192; noter &#233;galement
qu&#8217;en plus des ressources statiques rendant compte des relations morphologiques, il existe &#233;galement des outils
d&#8217;analyse, &#224; base de r&#232;gles ou d&#8217;heuristiques comme D&#233;rif (Namer, 2009) 5.
</p>
<p>4 Evaluation des ressources morphologiques existantes
</p>
<p>En fran&#231;ais, il n&#8217;existe pas de ressources contenant des relations morphologiques d&#233;rivationnelles &#224; large &#233;chelle
similaire &#224; la base CELEX qui contient un nombre important d&#8217;informations morphologiques pour le n&#233;erlandais,
l&#8217;anglais et l&#8217;allemand (Baayen et al., 1995). Il existe pour le moment uniquement des ressources con&#231;ues pour
traiter d&#8217;un ph&#233;nom&#232;ne morphologique particulier. Dans le cadre de notre &#233;tude, nous nous sommes int&#233;ress&#233;s
&#224; trois ressources qui couvrent des ph&#233;nom&#232;nes morphologiques particuli&#232;rement fr&#233;quents dans notre corpus :
les noms d&#233;verbaux et les adjectifs d&#233;nominaux. Ces ressources sont VerbAction, Dubois et Prolexbase. Nous
laissons de c&#244;t&#233; dans le cadre de cette &#233;tude la couverture des proc&#233;d&#233;s de composition, pour lesquels il n&#8217;existe
pas de ressource.
</p>
<p>4.1 Pr&#233;sentation des ressources existantes
</p>
<p>Verbaction 6 est une ressource lexicale regroupant tous les noms d&#8217;actions d&#233;riv&#233;s d&#8217;un verbe (Hathout et al.,
2002; Hathout &amp; Tanguy, 2002). Elle contient un total de 9 393 paires de nom-verbe.
</p>
<p>Dubois 7 Cette ressource XML, constitu&#233;e &#224; partir du travail de (Dubois &amp; Dubois-Charlier, 1997) est une des-
cription des verbes fran&#231;ais regroup&#233;s en classes syntaxico-s&#233;mantiques, qui fournit &#233;galement des informations
sur les d&#233;riv&#233;s de ces verbes. Elle contient au total 25 609 entr&#233;es pour lesquels elle mentionne 33 955 d&#233;riv&#233;s.
</p>
<p>Prolexbase 8 est un dictionnaire multilingue de noms propres (Tran &amp; Maurel, 2006; Bouchou &amp; Maurel, 2008).
Bien qu&#8217;elle ne contienne pas explicitement de connaissances morphologiques, cette ressource fournit des infor-
mations sur les noms relationnels et les adjectifs associ&#233;s aux noms propres. Par exemple, Fran&#231;ais et fran&#231;ais
sont explicitement associ&#233;s &#224; l&#8217;entr&#233;e France. Au total, Prolexbase contient 76 118 lemmes et 20 614 relations
d&#233;rivationnelles.
</p>
<p>4.2 R&#233;sultats
</p>
<p>L&#8217;&#233;valuation de ces trois ressources d&#233;rivationnelles ne peut se faire sur l&#8217;ensemble du gold-standard dans la
mesure o&#249; chacune d&#8217;elles a &#233;t&#233; con&#231;ue pour couvrir un ph&#233;nom&#232;ne morphologique sp&#233;cifique. De ce fait nous
avons &#233;valu&#233; les ressources uniquement sur la partie du gold-standard concern&#233;e par le ph&#233;nom&#232;ne pour lequel
</p>
<p>5. &#192; ce sujet voir Bernhard et al. (&#224; para&#238;tre).
6. http://w3.erss.univ-tlse2.fr:8080/index.jsp?perso=hathout&amp;subURL=verbaction/main.html
7. http://rali.iro.umontreal.ca/Dubois/
8. http://www.cnrtl.fr/lexiques/prolex/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, BRUNO CARTONI, DELPHINE TRIBOUT
</p>
<p>elles ont &#233;t&#233; con&#231;ues. La couverture de VerbAction et de Prolexbase a &#233;t&#233; &#233;valu&#233;e en comptant le nombre de
paires de mots morphologiquement reli&#233;s qui s&#8217;y trouvent. Dubois, en revanche, ne contient pas les d&#233;riv&#233;s mais
mentionne uniquement leur existence et fournit des informations permettant de d&#233;duire la forme du d&#233;riv&#233;. Pour
&#233;valuer Dubois nous avons donc pris en compte les cas o&#249; le d&#233;riv&#233; pouvait &#234;tre automatiquement calcul&#233; &#224; partir
des informations fournies.
</p>
<p>La table 7 r&#233;sume la couverture de VerbAction et de Dubois pour les noms d&#8217;&#233;v&#233;nement observ&#233;s dans notre cor-
pus. La couverture de VerbAction est meilleure que celle de Dubois, en particulier pour les sous-corpus de langue
g&#233;n&#233;rale Conique et Qu&#230;ro. Quant aux noms d&#233;verbaux agentifs, Dubois couvre 100% des noms de Conique et
75% de ceux de Qu&#230;ro (aucun nom agentif n&#8217;a &#233;t&#233; trouv&#233; dans le sous-corpus EQueR). VerbAction est limit&#233; aux
noms d&#8217;action et ne contient donc aucun nom d&#8217;agent.
</p>
<p>VerbAction Dubois
Corpus (nbr.) nbr. % nbr. %
Conique (34) 33 97 19 56
Qu&#230;ro (25) 25 100 9 36
EQueR (22) 22 100 19 86
Total (81) 80 99 47 58
</p>
<p>TABLE 7 &#8211; Couverture des ressources pour les noms d&#8217;&#233;v&#233;nements d&#233;verbaux
</p>
<p>Pour ce qui est des gentil&#233;s et des adjectifs relationnels d&#233;riv&#233;s de noms g&#233;ographiques, les r&#233;sultats de l&#8217;&#233;valuation
de Prolexbase sont pr&#233;sent&#233;s dans la table 8. Nous distinguons les gentil&#233;s (habitants d&#8217;un lieu), les adjectifs rela-
tionnels, et les noms de lieu ou d&#8217;entit&#233; institutionnelle que nous avons appel&#233;s &#8220;LocOrg&#8221;. Les chiffres montrent
que Prolexbase a une tr&#232;s bonne couverture pour les gentil&#233;s d&#233;riv&#233;s d&#8217;un nom de lieu, et pour les adjectifs rela-
tionnels d&#233;riv&#233;s d&#8217;un nom de lieu ou d&#8217;un gentil&#233; 9.
</p>
<p>Les ressources existantes VerbAction, Dubois et Prolexbase offrent donc une bonne couverture des noms d&#233;-
verbaux et des gentil&#233;s et adjectifs d&#233;riv&#233;s de noms propres. Cependant, si l&#8217;on &#233;value ces trois ressources sur
l&#8217;ensemble des relations d&#233;rivationnelles observ&#233;es dans le corpus, le taux de couverture global est relativement
faible (environ 52%). Ce faible taux de couverture n&#8217;est pas &#233;tonnant dans la mesure o&#249; les ressources &#233;valu&#233;es
sont con&#231;ues pour des ph&#233;nom&#232;nes particuliers. Cela d&#233;montre &#233;galement qu&#8217;il reste un nombre important de rela-
tions morphologiques d&#233;rivationnelles pour lesquelles il n&#8217;existe pas encore de ressource exploitable. En premier
lieu, il manque une ressource associant les adjectifs d&#233;nominaux aux noms dont ils d&#233;rivent, lorsqu&#8217;il ne s&#8217;agit pas
de noms g&#233;ographiques. Or, ce type de relation d&#233;rivationnelle est une des plus fr&#233;quentes dans notre corpus puis-
qu&#8217;elle concerne environ 21% des paires de mots reli&#233;s par un proc&#233;d&#233; d&#233;rivationnel dans le sous-corpus Conique,
23% dans le sous-corpus Qu&#230;ro, et 40% dans le sous-corpus EQueR (cf. table 3). Une telle ressource sp&#233;cifiant
la relation entre un adjectif d&#233;nominal et son nom base permettrait donc d&#8217;augmenter de fa&#231;on significative la
couverture globale des ressources morphologiques du fran&#231;ais pour les relations morphologiques observ&#233;es dans
notre corpus de question-passage.
</p>
<p>5 Conclusion et perspectives
</p>
<p>Nous avons pr&#233;sent&#233; une &#233;tude d&#233;taill&#233;e des ph&#233;nom&#232;nes morphologiques permettant de faire le lien entre question
et r&#233;ponse dans le cadre des syst&#232;mes de QR. Pour r&#233;aliser cette &#233;tude, nous avons constitu&#233; un corpus de paires
de question-passage r&#233;ponse &#224; partir de divers corpus utilis&#233;s pour l&#8217;&#233;valuation en QR. Nous avons r&#233;alis&#233; une
annotation d&#233;taill&#233;e du corpus, portant sur les liens morphologiques entre question et r&#233;ponse. Cette annotation
nous a permis d&#8217;obtenir des donn&#233;es de r&#233;f&#233;rence, que nous avons analys&#233;es de mani&#232;re d&#233;taill&#233;e selon plusieurs
axes : types de relations morphologiques, proc&#233;d&#233;s d&#233;rivationnels utilis&#233;s, relations de composition. Cette analyse
nous a permis de tirer les conclusions suivantes : (i) la morphologie d&#233;rivationnelle constitue une forte proportion
des ph&#233;nom&#232;nes morphologiques &#224; l&#8217;&#339;uvre dans le corpus, (ii) les ph&#233;nom&#232;nes de d&#233;rivation observ&#233;s concernent
essentiellement les adjectifs d&#233;nominaux et les nominalisations verbales, (iii) le proc&#233;d&#233; de composition s&#8217;observe
essentiellement dans le sous-corpus sp&#233;cialis&#233; de la langue m&#233;dicale EQueR.
</p>
<p>9. Dans le corpus Qu&#230;ro, aucune paire gentil&#233;&gt;adjectif relationnel n&#8217;a &#233;t&#233; trouv&#233;e, et dans le corpus EQueR, seule une paire
LocOrg&gt;adjectif relationnel a &#233;t&#233; trouv&#233;e et est analys&#233;e correctement.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#201;VALUER LA PERTINENCE DE LA MORPHOLOGIE DANS LES SYST&#200;MES DE QUESTION-R&#201;PONSE
</p>
<p>Trouv&#233; dans
Corpus Relation morphologique (nbr.) Prolexbase
</p>
<p>nbr. %
Conique Gentil&#233; - Adj. Rel (1) 1 100
</p>
<p>LocOrg - gentil&#233; (6) 6 100
LocOrg - Adj. rel (45) 43 96
</p>
<p>Qu&#230;ro LocOrg - Gentil&#233; (8) 5 62
LocOrg - Adj. rel. (8) 8 100
</p>
<p>EQueR LocOrg - Adj. rel. (1) 1 100
Total 69 64 93
</p>
<p>TABLE 8 &#8211; Couverture de Prolexbase pour les relations morphologiques de type &quot;g&#233;ographique&quot;
</p>
<p>Si ces r&#233;sultats soulignent l&#8217;importance de la morphologie dans l&#8217;appariement en question-r&#233;ponse, et montrent
clairement quelles relations sont les plus pertinentes (car les plus fr&#233;quentes), ils ne permettent pas d&#8217;&#233;valuer
l&#8217;impact, notamment en termes de bruit, de la prise en compte de ces relations, fr&#233;quentes ou non, dans un syst&#232;me
de QR. Une int&#233;gration modulaire de chacune des relations, et une &#233;valuation pr&#233;cise de leur impact sur les
r&#233;sultats d&#8217;un syst&#232;me de QR permettraient sans doute d&#8217;avoir une meilleure id&#233;e sur la question.
</p>
<p>Nous avons &#233;galement &#233;valu&#233; la couverture de ressources morphologiques existantes pour le fran&#231;ais par rapport
aux ph&#233;nom&#232;nes observ&#233;s. Si certains proc&#233;d&#233;s b&#233;n&#233;ficient d&#8217;une tr&#232;s bonne couverture (noms d&#8217;&#233;v&#233;nement dans
VerbAction, gentil&#233;s et adjectifs relationnels d&#233;riv&#233;s de noms g&#233;ographiques dans Prolexbase), d&#8217;autres souffrent
d&#8217;un manque de ressource adapt&#233;e, comme par exemple les adjectifs d&#233;nominaux.
</p>
<p>Les perspectives de ces travaux sont multiples. D&#8217;un point de vue linguistique, l&#8217;observation des relations mor-
phologiques les plus fr&#233;quentes, et l&#8217;absence constat&#233;e de certaines autres, semblent indiquer que certains types de
relations morphologiques sont plus informatifs et donc plus pertinents que d&#8217;autres. D&#8217;un point de vue applicatif
cette hypoth&#232;se m&#233;riterait n&#233;anmoins d&#8217;&#234;tre &#233;valu&#233;e empiriquement. L&#8217;analyse a &#233;galement permis de distinguer
les proc&#233;d&#233;s d&#233;rivationnels &#224; int&#233;grer de fa&#231;on prioritaire dans les syst&#232;mes de QR. Nous envisageons d&#8217;int&#233;-
grer ces observations dans un syst&#232;me de QR existant, en d&#233;finissant notamment des patrons de reformulation de
question bas&#233;s sur la morphologie.
</p>
<p>Remerciements Ces travaux ont &#233;t&#233; partiellement financ&#233;s par OSEO dans le cadre du programme QUAERO.
</p>
<p>R&#233;f&#233;rences
</p>
<p>AYACHE C., GRAU B. &amp; VILNAT A. (2006). EQueR : the French Evaluation campaign of Question-Answering
Systems. In Proceedings of the 5th international Conference on Language Resources and Evaluation (LREC
2006), p. 1157&#8211;1160.
</p>
<p>BAAYEN R. H., PIEPENBROCK R. &amp; GULIKERS L. (1995). The Celex Lexical Database (Release 2) [CD-
ROM]. Philadelphia, PA : Linguistic Data Consortium.
</p>
<p>BERNHARD D., CARTONI B. &amp; TRIBOUT D. (&#192; para&#238;tre). A Task-Based Evaluation of French Morphological
Resources and Tools : A Case Study for Question-Answer pairs. Linguistic Issues in Language Technology -
LiLT.
</p>
<p>BILOTTI M. W., KATZ B. &amp; LIN J. (2004). What Works Better for Question Answering : Stemming or Mor-
phological Query Expansion. In Proceedings of the Information Retrieval for Question Answering (IR4QA)
Workshop at SIGIR 2004, Sheffield, England.
</p>
<p>BOUCHOU B. &amp; MAUREL D. (2008). Prolexbase et LMF : vers un standard pour les ressources lexicales sur les
noms propres. Traitement Automatique des Langues, 49(1), 61&#8211;88.
DUBOIS J. &amp; DUBOIS-CHARLIER F. (1997). Les verbes fran&#231;ais. Larousse-Bordas.
</p>
<p>FLEISS J. L. (1971). Measuring nominal scale agreement among many raters. Psychological Bulletin, 76(5),
378&#8211;382.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>DELPHINE BERNHARD, BRUNO CARTONI, DELPHINE TRIBOUT
</p>
<p>FULLER M. &amp; ZOBEL J. (1998). Conflation-based comparison of stemming algorithms. In Proceedings of the
Third Australian Document Computing Symposium, p. 8&#8211;13, Sydney.
</p>
<p>GERMANN U. (2008). Yawat : yet another word alignment tool. In Proceedings of the 46th Annual Meeting of
the Association for Computational Linguistics on Human Language Technologies (HLT &#8217;08), p. 20&#8211;23.
</p>
<p>GRAPPY A., GRAU B., FERRET O., GROUIN C., MORICEAU V., ROBBA I., TANNIER X., VILNAT A. &amp;
BARBIER V. (2010). A Corpus for Studying Full Answer Justification. In Proceedings of the Seventh conference
on International Language Resources and Evaluation (LREC&#8217;10), Valletta, Malta.
</p>
<p>HARMAN D. (1991). How effective is suffixing ? Journal of the American Society of Information Science, 42(1),
7&#8211;15.
</p>
<p>HATHOUT N., NAMER F. &amp; DAL G. (2002). Many Morphologies. chapter An Experimental Constructional
Database : The MorTAL Project, p. 178&#8211;209. Cascadilla Press.
</p>
<p>HATHOUT N. &amp; TANGUY L. (2002). Webaffix : Discovering Morphological Links on the WWW. In Procee-
dings of the Third International Conference on Language Resources and Evaluation, p. 1799&#8211;1804, Las Palmas
de Gran Canaria, Espagne : ELRA.
</p>
<p>HERMJAKOB U., ECHIHABI A. &amp; MARCU D. (2002). Natural Language Based Reformulation Resource and
Wide Exploitation for Question Answering. In Proceedings of the Eleventh Text Retrieval Conference (TREC
2002).
</p>
<p>HOPPER P. &amp; THOMPSON S. (1984). The discourse basis for lexical categories in universal grammar. Language,
60, 703&#8211;752.
JACQUEMIN B. (2010). A Derivational Rephrasing Experiment for Question Answering. In Proceedings of the
Seventh conference on International Language Resources and Evaluation (LREC&#8217;10), Valletta, Malta : European
Language Resources Association (ELRA).
</p>
<p>LENNON M., PIERCE D. S., TARRY B. D. &amp; WILLETT P. (1988). An evaluation of some conflation algorithms
for information retrieval. Journal of Information Science, 3(4), 177&#8211;183.
LIN D. &amp; PANTEL P. (2001). Discovery of Inference Rules for Question Answering. Natural Language Engi-
neering, 7(4), 343&#8211;360.
MCNAMEE P., NICHOLAS C. &amp; MAYFIELD J. (2009). Addressing morphological variation in alphabetic lan-
guages. In SIGIR &#8217;09 : Proceedings of the 32nd international ACM SIGIR conference on Research and develop-
ment in information retrieval, p. 75&#8211;82, New York, NY, USA : ACM.
</p>
<p>MOREAU F. &amp; CLAVEAU V. (2006). Extension de requ&#234;tes par relations morphologiques acquises automati-
quement. In Actes de la Troisi&#232;me Conf&#233;rence en Recherche d&#8217;Informations et Applications CORIA 2006, p.
181&#8211;192.
</p>
<p>NAMER F. (2009). Morphologie, Lexique et TAL : l&#8217;analyseur D&#233;riF. TIC et Sciences cognitives. London :
Hermes Sciences Publishing.
</p>
<p>QUINTARD L., GALIBERT O., ADDA G., GRAU B., LAURENT D., MORICEAU V., ROSSET S., TANNIER X.
&amp; VILNAT A. (2010). Question Answering on Web Data : The QA Evaluation in Qu&#230;ro. In Proceedings of the
Seventh conference on International Language Resources and Evaluation (LREC&#8217;10), Valletta, Malta.
</p>
<p>RAVICHANDRAN D. &amp; HOVY E. (2002). Learning surface text patterns for a Question Answering system. In
Proceedings of the 40th Annual Meeting on Association for Computational Linguistics (ACL &#8217;02), p. 41&#8211;47.
</p>
<p>TRAN M. &amp; MAUREL D. (2006). Prolexbase : un dictionnaire relationnel multilingue de noms propres. Traite-
ment Automatique des Langues, 47(1), 115&#8211;139.</p>

</div></div>
</body></html>